[
    {
        "title": "第六识和第七识的区别?",
        "author": "明证法师",
        "date": "",
        "html": "<div class=\"B1_text\"><p>问：请解释第六识，第七识，第八识让我们了解。</p><p>师父开示：有一本书叫《百法明门论》，其实比《心经》也不会长多少，好像还不如《心经》长，是世亲菩萨根据《瑜伽师地论》写的，《瑜伽师地论》是弥勒菩萨的论，在唯识宗叫根本论。《瑜伽师地论》把一切法，归纳为六百六十种法，《百法》把六百六十法又归纳为一百个法。分成五组：第一组叫八大心王，心王法，一共有八个；第二组叫心所有法，简称心所法，一共有五十个；第三组，色法有十一个；第四组，心不相应行法，一共有二十四个；第五组，无为法，有六个，加起来一百个法。</p><p>第一组，八大心王，心王法。就是眼识、耳识、鼻识、舌识、身识、意识，第七叫末那识，第八叫阿赖耶识。一心按照功能的不同分为八个识，八个识合在一起其实就是一心。我们背《心经》的时候，讲眼耳鼻舌身意，色声香味触法，后面眼识乃至意识，这叫前六识。其中意识就是第六识，第六识就叫意识，第七识其实是眼根、耳根、鼻根、舌根、身根、意根，六根的最后一个根，意根，也就是说意根就是第七识，第七识就是末那识。这三个名词在说一件事情，从根的分类上来说，这个第七识末那识，叫意根，从识来说，他是第七识末那识，像我们人，一位男子，对他妈妈来说，他是儿子，对他儿子来说，他是父亲，就是看对谁而言。一件事情从不同的角度上来说，就有不同的名相安立。第六的这个意识，我们是比较容易了解的，这就是我们生活当中大量地用的这个心，知冷，知热，知好，知坏，知美，知丑，知男，知女，知高低前后左右上下，这都是第六识的功能。前五识，其实我们不算太了解，不过前五识动作的时候，一定会有第六识参与，第六识和它们在一起和合运作，这种情况下的意识叫五俱意识，意思就是和前五识一起运作的意识。</p><p><br></p><p>好比说眼睛看一本书，但是知道这是一本书的却是第六识。眼睛只是看到，眼睛像是摄像机，或是一架照相机，它并不管照到的是什么东西，知道这个颜色的是眼识，照相机不知道它照到的是什么内容，知道那个照片里边照到内容的是后面的人，跟这个道理是一样的。那么知道这个颜色的是眼识，但他还不知道这是一本书，知道这是一本书的是意识。所以，他们在一起进行分别和合起作用，眼识和意识的关系如此，鼻识，舌识，身识，也是一样的道理。耳识是能够分辨声音好，还是不好，我们平常说，这个声音真好听；哇，那个声音太刺耳了，就是耳识的分辨，他分辨得很粗，至于说这个好的声音，好比说是黄梅戏的调子呢，还是京剧呢，耳识就不知道了，耳识只知道这个声音比较好听，京剧里敲锣打鼓的噪音，比较烦，他会有这种总相的分别。也就是一个是悦音，一个是噪音，这个他能分别，至于说是什么调子，好比说唱歌，这是哪一支曲子，这完全不是耳识所能分别的，而要靠第六识分别。也就是说第六识不单能够知道前五识所分别的总相，而且能够知道，前五识所不能分别的，不能了知的别相，两个他都能知道。为什么？因为第六识，他可以整合前五识，前五识的信息都会给第六识，所以他可以进行综合分析判断。另外，前五识只有现量，面对面的时候他才能了解，他不知道过去的事情，而第六识可以了解，前五尘谢落的这些影子成为种子存在八识心田中，到时候可以出来，和现在这个境界进行对比，依靠比量就知道了，比如说这一个杯子，这个杯子不是普通的玻璃杯，也不是瓷杯，而是钢杯，我往上一拿的时候，大家第八识以往储存的关于各种杯子的信息，就会一起出来，意识马上就判定，它不是一只平常所见到的杯，而是一个比较特殊的杯，马上就明白了，这就是第六识的功能，仅仅眼识就不知道，眼识只知道这个杯的颜色而已，其他的就不知道了。</p><p><br></p><p>我们这样大概地介绍了，五俱意识的情况，意识，除了五俱意识以外还有一种，叫独头意识，独头意识的意思就是他不和前五识一起和合运作，他可以单独存在，单独运作。这里边大致又分为四种情况：第一种意识，独头意识，就是散乱意识，什么叫散乱意识，好比说我们平常坐到那里胡思乱想，视而不见，听而不闻，在那里入了自己梦幻泡影的境界，那个时候，和前五识没什么关系，因为即使睁着眼睛也啥也没看见，这就叫散乱意识；第二，梦中意识这个大家都了，做梦，不管你梦到的是什么，前五识都不存在，都是第六识的境界，都是以往经历过的事情，再一次在脑海里边现出来的影像，即使在梦里边如何，如何地逼真，它也不过是梦幻泡影，没有任何实性。在梦中，人的意识不清醒，所以，分不清是在梦中，还是在现实当中，这是第二种叫梦中独头意识；第三，是定中独头意识，我们打坐，坐在那里闭着眼睛，进入了禅定的境界，入定了，定中一定有意识，唯除两种定没有意识，稍微旁开来一点没关系，马上就回来，第一种，无想定，第二种，灭受想定，也叫灭尽定，这两种定里边没有第六意识，其他的都有，为什么这两种没有呢，因为无想定是修到了四禅境界以后，外道不了解涅槃的真相，误认为他这个身体可以涅槃，只要把第六识灭掉就可以了，于是他发生了一个误会，由于他有四禅的定力，他真的就把第六识灭掉了。可是，并不同有进入无余涅槃，因为他弄错了，这一条岔道，叫做无想定，第二种是灭尽定，在灭尽定当中不单灭掉了，全部的第六识，而且把第七识的两个心所，受心所和想心所也灭掉了，因此也叫做灭受想定，当然没有第六识，除了这两个定以外，乃至非想非非想天，也就是三界最高的那一种定，仍然有第六识。</p><p><br></p><p>所以其他禅定当中的境界，其实都不可能超出第六识的境界，这是第三种独头意识，叫定中独头意识，第四种，叫病中独头意识，一个人精神不正常了，站到那里自言自语，好像跟什么人在对话，是完全沉浸在自己病态当中的一种境界，其实没有另一个真实的人，站在那里和他对话，但是他认为有因为他在病中，不正常了，他自己幻觉，看到有个人在和他对话，在和他吵架，我们见到有一些人，属于这个类型的精神病，这叫病中独头意识，但前提是在发病的时候，如果他没有发病在正常的时候当然不是，那么除了这四种情况，还有没有别的呢，其实还有，不过，我们大的分类是这四种，比如说，有人注射了迷幻药以后，迷幻的境界也是第六识的境界，再比如说，对一个人进行催眠，被催眠的境界也还是第六识的境界，我们就不说那么多，不说那么详细了，这是第六识所具有的两种大的状态。一种和前五识，或者其中一种，或者四种在一起的，或者五种都在一起的，这叫五俱意识，俱就是一个单立人一个具体的具，就是在一起的意思，第二种是独头意识，就是第六识可以单独运作的，这种情况，以上我们介绍了第六识的情况。</p><p>那么第七识或者叫意根，他到底是什么？既然叫意根，他就是意识的根。比如说，我有眼睛，眼睛叫眼根，由于眼根触色尘，外面的东西叫色尘，眼根接触色尘后，然后这个形象会跑到眼睛背后的视网膜上，落下一个影像，就像照相机后面的那个，显示影像的部分一样，眼球也有这个功能，视网膜上的视觉形象通过视觉传导神经，传到大脑里边，再合成一个形象，我们看到的仅仅是大脑里边的那个形象，视网膜上的形象我们自己也看不到，现在我举杯大家看到了，其实你是看到了你自己大脑里边出现的影像，这个杯不会跑到你的眼睛里，更不会跑到你的大脑里，这是谁都知道的。所以，你看到的仅仅是，第二重或者第三重影像而已，不单看到这个杯子是如此，你看到一切事物都是这样，只是影像，没有真实，可是，这个影像跟外面是一致的。</p><p><br></p><p>所以，我们误解为这是真实的，就像镜子里有一朵花，如果这个人不小心的话，他误认为它是真花，他会伸手去抓，结果手碰到玻璃才知道，这是镜中花，它不是真花，真花应该在外面，什么地方摆着，他弄误会了。眼识是如此，第六识呢，意根触法尘生意识，和眼根触色尘生眼识的道理是一样的，法尘有法尘的种子，变成现行以后就是第六识了解的境界，这叫法尘境界。法尘境界靠谁来触呢？在没有意识，意识还没有生起的时候，就要靠意根来触这个法尘，和前面的五根、五尘、五识，根触尘生识的道理是一样的，所以必须要有一个意根，触法尘然后才能生意识。</p><p>比如说我们睡着了不做梦，第六识或者说前六识也都没有了，那个时候继续在工作的识，只有两个，就是第七识和第八识。他们不需要睡觉，因为他们不是靠肉身存在的，即使肉身毁掉以后，这两个识仍然在，一直都在。所以，他们会继续工作，因此才能够保证我们肉体在睡觉的时候，仍然完好无损，或者说，体内还在进行一系列的运作，但是人睡了，什么都不知道了，前六识断了，但第七识，第八识没有断，那个第七识就是意根，他遍缘一切境界，一直在做监督的工作，人睡着了，这是第七识靠着肉体的，眼、耳、鼻、舌、身五根，仍然在监督外边的一切境界，万一着火了，人睡着了什么也不知道，但是人会突然惊醒，为什么？因为有火光，火光会映到眼睛里，虽然眼睛是闭着的，但是那个光亮还是会透过眼皮，还是可以反映出来，另外可能有吵杂的声音，有热，都被第七识了知了，但第七识不知道，这具体是怎么回事，喂！第六识，赶快醒来看看是怎么回事，他就把第六识叫醒了，你不能继续睡了，赶快起来，这时候第六识又产生了，第六识一看，大事不好，着火了，赶快逃命，第六识和第七识他们要互相配合，这是举梦中被惊醒的一个例子。</p><p><br></p><p>其实白天也是这样的，我们本来在这里听讲，听得很好，突然外边放一声炮，一响，大家的头一下都转过去了，什么声音，因为这个现象，先被第七识捕捉到以后，第七识，他不能够详细地了解，因为他遍缘一切法，攀缘得太广泛了，所以，就不能够单对一个法，进行很细致的了解。第六识的功能就是可以专门针对一个问题分别得很详细。好比我面前这朵花，可以跟眼识配合了解得非常详细具体，第七识不行，第七识虽然也看到了，但并不能具体了达。所有境界他只能够大概知道，却不能够很详细很具体地知道，这是第七识和第六识的一方面的区别，另一方面，第六识，他的主要功能是分别，刚才说过，他能进行周详的分别，可以在某一个点上进行，最详细的分别都没有问题，第六识做完了事情，做得已经成了习惯的事情，变成习惯以后，就由第七识来管了，这是二者的另一区别，好比说，我们一开始学车的人，很紧张，战战兢兢的，这个方向盘怎么掌握，这个离合器怎么踩，这个档怎么挂，外面又要看灯，打转向灯，很多地方需要协同配合。他的注意力，一会儿注意这个地方，一会儿注意那个地方，是跳动的，第七识不然他弥漫地监督一切情况，但是一旦协同已经完成，学习过程结束，已经很自如的时候，第六识，就可以再做别的事情了。司机可以跟旁边的人说话，可以打电话，可以听音乐都没关系了，因为他的运作已经熟练了，变成了一种既定的程序，可以自动地反应，那么就交给第七识了。因此凡是有关习惯的事情，是第七识来管理的，而学习新的东西呢，是第六识完成的，这是二者的第三个区别。所以，我们在做某一件事情的时候，过去的习惯就会强烈地表现出来进行干扰，因为，那个习惯是第七识监控的，他一定要出来干扰，让你知道让第六识进行分别，好比我们打坐念佛，我们本来念佛念得好好的，突然想起来，该做什么事情了，因为第七识是按照程序进行活动的，这个时候你就该回家了，该去买菜去了，这个境界就出现了干扰你念佛修定，他一次一次强烈地出现。</p><p><br></p><p>小偷被警察抓住为什么，因为他按照习惯做事，小偷的眼睛，好比说掏腰包的，那他的眼睛上了车以后，他就看人家的口袋在哪里，看人家的包包，他的眼光落在这些地方，所以警察上车一看就知道谁是小偷了。我们不看，我们不操这个心，警察他专干这种事情，当然一看就知道了，各有各的专业特长，小偷也是专业，他不看别的，专看你的钱放在什么地方，他已经习惯了，所以被警察发现了，那个习惯就是第七识在起作用。有一个小偷去撬门弄锁，那个锁是一个新锁，他怎么弄也弄不开，他在那里全神贯注，警察走过来，在那里等了半天，要抓他，可是小偷没有完成，门没打开，没进去不能抓，他在那里等着他，最后这个警察等得不耐烦了，你这么笨，开了半天没开开，警察拍拍他，老兄，躲开，不要干扰我，我在工作，警察说，我是警察！这显示第七识会很顽固地按照习惯做事情，第六识和他进行配合，全然不顾别的境界了。因为第七识他不知道是不是警察，他不知道，等第六识回过神来以后，他才会了解这是警察。这是我们从另外几个方面来告诉大家，第六识和第七识有些什么不同。</p><p>下面给大家介绍第八识。第七识是连结第八识和前六识的桥梁，好像我们的脖子一样，他有一个连系，第八识最重要的功能，是含藏一切种子。什么叫种子，种子就是我们造作过身口意三业以后，留下来的那些势力，能够继续发生，类似的身口意三业的那些功能。我们用一个譬喻来说，叫种子，这些种子遇缘就可以变成现行，好比说我们到中午要吃饭了，到中午就饿了，那没到中午的时候我们看到食物，我们也不怎么起反应，可是肚子饿的时候看到食物就起反应，这个反应是什么？你会不由自主的分泌唾液，你会流口水，流口水不好看你就悄悄的把它咽下去，小孩子不懂，不懂要避会人，就在那里当人的面吞咽口水。</p><p><br></p><p>另外，第八识他能够住持我们的身体，第八识如果离开我们的身体马上就是死尸，人死的时候就是因为第八识离开身体了，这个身体不能用了，他走了，同时走的当然还有第七识，我们在的时候只要还活着，第八识就时时刻刻，都住持着我们的身体，使我们的身体是一个活的有机体，而不是一个死尸。所以，我们会喘气，我们会喝东西，我们会吃东西，我们会适当地运动，就是因为第八识还没有和我们的身体分离。所以，第八识是生命的根本，他从来都不间断的，他也不累，一直在工作，第八识大公无私，第八识没有分别，他不管你是男的，女的，你要做好事，坏事，他都随缘，你说偷东西他都跟你一起偷，你说上吊，跟你一起上，你说跳河，可以，你说要成佛，没意见，怎么样都行，第八识具有随缘性，不动随缘就是说第八识，不生不灭也是指第八识，很多词都在说第八识，第八识本来就解脱，因为他没有烦恼，烦恼没有，怎么需要解脱烦恼呢。所以，他本在解脱，本在涅槃。另外，第八识做的事情太多了，多到无量无边，第六识就做一点点而已，好比说我们吃了东西以后要消化，身体里边各个系统都在协调运作，这是哪个识管呢，第八识和第七识在管而已，因为第七识遍缘一切法，当然身体里边的法他也缘，可是第六识只是分别外面的法，这个人好看，那个人好丑，这个食物好吃，那个不好吃，他会分别这些，他会很烦恼，看到了好的就高兴，看到的不好就生气，他烦恼，第八识才不管，他不分别。所以他没有烦恼，本来就解脱，不需要解脱了，他进行那么多的工作，没有智慧能完成吗。</p><p><br></p><p>所以，他一定有无量无边的智慧，这就是说本具的智慧，叫本觉。所以第八识的觉，第八识的智慧叫本觉，即本具的阿耨多罗三藐三菩提，开了悟的人悟后起修，就是第六识要转过来依靠第八识向第八识学习，第八识随缘，第八识不生气，第八识什么都任劳任怨，没有任何怨言，日夜不停地无我地工作。所以，我们学佛其实在很大的程度上，就是向第八识学习，其实最后成佛也就是让妄心前七识能够和第八识保持一致，完全一致，完全没有烦恼，完全具足圆满的大智慧那就成佛了。所以，第八识，对我们修学大乘佛法的人来说，至关重要，人在睡梦当中，第七识，第八识继续工作，人在死的时候第七识，第八识照样工作，因为要产生一个中阴身，而前六识都断了，不喘气了，人死了，可是中阴身还没有产生，大约需要八个小时，完成中阴身产生过程这是一般的情况，特殊的情况另说。有了中阴身以后，中阴身才能去投胎，投胎才有下一世，这件事情也需要第七识和第八识来完成，第七识比较主导的，第八识很被动，他是完全随缘的，所以，第八识工作必须要有第七识配合，如果没有第七识，第八识什么都不干，他非常听话，你让他干什么，他都没有意见，本事很大，什么都能干，但是没人指挥他就不干，那么不干的，是哪一种情况呢？唯有一种情况，那就是无余涅槃，这个涅槃是小乘的阿罗汉和辟支佛，修到一定程度以后，把这个身体舍了不要了，进入的一种解脱的状态，叫无余涅槃，只有这一种情况，第七识被灭掉了，即使在灭受想定也就是灭尽定当中，第七识也只灭掉受想两个心所而已，还有其他三个心所在运作并没有全部消失。但是如果修学大乘佛法这种情况也没有，因为佛不让弟子进入无余涅槃，为什么？因为进入无余涅槃以后，你就不会，也不能再来到这个世间上来，你就无法再跟随佛陀进行学习了，就不能成佛了，只是个人解脱而已，这就是小乘的法，大乘法不入无余涅槃。所以不断地转世，不怕烦恼，不怕生死，继续一次又一次来到世间，和众生在一起，这样才能够度众生，这样才能够弘扬佛法，这样才能够锻炼自己学习智慧，这样才能够最终成佛。所以，第七识和第八识有这样微妙的关系。</p><p>摘自明证法师《台中五方讲堂问题回答1》</p></div>"
    },
    {
        "title":"第六识和第七识的区别?",
        "html":"<div class=\"B1_text\"><p>唯识学中的“八识心王”是指眼、耳、鼻、舌、身、意、末那、阿赖耶。本人是知识的搬运工啊，只是把今天学习的成果，搬到这里来而已。</p><p><br></p><p>1、眼识：我们的眼睛能看到各种各样的东西，就是眼识的功能。注意，眼睛只能看见，而不会分别；如果你在区别这个是书、那个是笔，这已经是意识在作用了。</p><p><br></p><p>2、耳识：耳朵具有听的功能，同样耳朵只是具有听见的功能，而不会区分这个是长笛的声音、那个是小号的声音。一区分，就是意识在作用了。</p><p><br></p><p>3、鼻识：鼻子具有嗅觉，但它也只是具有嗅觉功能，一区分香臭，就已经是意识在作用了。</p><p><br></p><p>4、舌识：舌头具有味觉，同样它也只是具有味觉的功能，一区分甜和咸，就已经是意识在作用了。</p><p><br></p><p>5、身识：身体具有触觉的功能。</p><p><br></p><p>前五识是感识，认识具体对象。</p><figure><noscript><img src=\"https:width=\"570\"/></noscript><div><img src=\"https:</div></figure><p>6、意识：意识是第六识，具有认识抽象概念的功能。前五识中有一识起作用，意识便同时俱起。</p><p><br></p><p>此外，意识对内外之境，不分有形无形，及过去现在未来三世，有比知、推测的作用。因此迷悟升沉之业，皆由意识而作。现在心理学上，研究到前六识为止。但是在佛法上的分析，还有第七、第八——末那识和阿赖耶识的存在。</p><p><br></p><p>7、末那识：末那是梵语manas的音译。末那识是意识的根本，其本质是恒审思量。因为它是执取第八识（阿赖耶识）的见分或其种子为我，使意识生起自我意识，所以末那识又称为“我识”。这基本上是一种我执的作用，由此而形成烦恼的根本。</p><p><br></p><p>这种我执的具体表现是，我的具体生命在过去现在未来所思想所经验的东西，有其余势，以种子的形式，摄藏于第八识的阿赖耶识中。末那识在下意识层面执取这些种子，以之为我。实际上，这些种子都是无始来前灭后生、非常非断的作用。</p><p><br></p><p>《金刚经》中最重要的三句话是：“过去心不可得，现在心不可得，未来心不可得。”此中本来无常，末那识以这样虚妄的东西为我，因此生起贪、憎、痴、疑、慢等种种烦恼。</p><p><br></p><p>末那识属于潜意识的范围，它本身并不造作善恶之业，但因它执着自我，所以成为一切众生自私自利的根源。末那识所执着的我是什么呢？就是最后一个阿赖耶识。</p><figure><noscript><img src=\"https:width=\"1280\"/></noscript><div><img src=\"https:height=\"853\"></div></figure><p><br></p><p>8、阿赖耶识：阿赖耶是梵音，又称为藏识，含能藏、所藏、执藏三义，是一切善恶种子寄托的所在。</p><p><br></p><p>阿赖耶识是本性与妄心的和合体。由无明（无明二字的含义见我的《般若波罗密多心经》略解）而起的妄想概念称为阿赖耶识的见分，再因这妄想概念而幻现一种对象的境界，称为阿赖耶识的相分。</p><p><br></p><p>一切众生，每一个起心动念，或是语言行为，都会造成一个业种，这种子在未受报前都藏在阿赖耶识中，所以此识有能藏的含义。前七识的作用是能熏能缘，第八识是前七识所熏所缘，所以有所藏义。第七识恒定执此识中的见分为我，而为它所爱，所以有我爱执藏义。</p><p><br></p><p>［第六识与第七识的区别在哪里？］</p><p><br></p><p>第六识与第七识同为八识之一。第六识是意识，第七识是意根，意根是意识的所依根。</p><p><br></p><p>第六识具有认识抽象概念的功能。前五识（眼、耳、鼻、舌、身）中有一识起作用，意识便同时俱起。</p><p><br></p><p>第七识原名叫做“末那”，是意识的根本，其本质是恒审思量。因为它是执取第八识（阿赖耶识）的见分或其种子为我，使意识生起自我意识，所以末那识又称为“我识”。这基本上是一种我执的作用，由此而形成烦恼的根本。</p><p><br></p><p>末那识属于潜意识的范围，它本身并不造作善恶之业，但因它执着自我，所以成为一切众生自私自利的根源。</p><p><br></p><p>第七识意根遍缘一切诸法，而且可以处处作主。意根是恒而常住的；除非断尽我执而入无余涅槃中，否则意根是永远存在的，自无始劫以来他就一直都是如此的；在意识现行时，必须有意根作为俱有依，由意根配合意识而同时运作，意识才能运作。</p><p><br></p><p>第七识的意义是“意”，与第六识的意识是有所不同的。所谓意，正是指它在凡夫位其体是个纯染污的东西，无始劫来日夜相续没有刹那时间曾放弃执拗爱染；它是不断地单纯地执着第八识的见分为自内我，思量为我的爱见极强，因之管它叫意。</p><p><br></p><p>它是恒审思量（恒：永远，不间断的意思。审：审察，审视。思：反应，判断，决定。量：量度，区分。总的意思，即对事物不间断的做出反应区分和判断决定。），没有片刻停歇，第六识虽有思量作用，可是有时间断，例如熟睡无梦时，第六意识就不现前，也自然就没有起思量作用了；因之第六识不能单叫意而叫做意识，只有第七识思量义特强，而且第七识还为第六意识所依之根；故唯第七识得名为意。</p><p><br></p><p>第七识，意识的根。比如说，我有眼睛，眼睛叫眼根，由于眼根触色尘，外面的东西叫色尘，眼根接触色尘后，然后这个形象会跑到眼睛背后的视网膜上，落下一个影像，就像照相机后面的那个，显示影像的部分一样，眼球也有这个功能，视网膜上的视觉形象通过视觉传导神经，传到大脑里边，再合成一个形象，我们看到的仅仅是大脑里边的那个形象，视网膜上的形象我们自己也看不到。</p><figure><noscript><img src=\"https:width=\"750\"/></noscript><div><img src=\"https:</div></figure><p><br></p><p>现在我举杯大家看到了，其实你是看到了你自己大脑里边出现的影像，这个杯不会跑到你的眼睛里，更不会跑到你的大脑里，这是谁都知道的，所以，你看到的仅仅是，第二重或者第三重影像而已。</p><p><br></p><p>不单看到这个杯子是如此，你看到一切事物都是这样，只是影像，没有真实，可是，这个影像跟外面是一致的，所以，我们误解为这旨真实的，就像镜子里有一朵花，如果这个人不小心的话，他误认为它是真花，他会伸手去抓，结果手碰到玻璃才知道，这是镜中花，它不是真花，真花应该在外面，什么地方摆着，他弄误会了，眼识是如此。</p><p><br></p><p>第六识呢，“意根”触“法尘”生意识，和眼根触色尘生眼识的道理是一样的，法尘有法尘的种子，变成现行以后就是第六识了解的境界，这叫法尘境界，法尘境界靠谁来触呢，在没有意识，意识还没有生起的时候，就要靠意根来触这个法尘，和前面的五根、五尘、五识，根触尘生识的道理，是一样的，所以必须要有一个意根，触法尘然后才能生意识。</p><p><br></p><p>比如说我们睡着了不做梦，第六识或者说前六识也都没有了，那个时候继续在工作的识，只有两个，就是第七识和第八识，他们不需要睡觉，因为他们不是靠肉身存在的，即使肉身毁掉以后，这两个识仍然在，一直都在，所以，他们会继续工作，因此才能够保证我们肉体在睡觉的时候，仍然完好无损，或者说，体内还在进行一系列的运作，但是人睡了，什么都不知道了，前六识断了，但第七识，第八识没有断，那个第七识就是意根，他遍缘一切境界，一直在做监督的工作，人睡着了，这是第七识靠着肉体的，眼、耳、鼻、舌、身五根，仍然在监督外边的一切境界，万一着火了，人睡着了什么也不知道，但是人会突然惊醒，为什么，因为有火光，火光会映到眼睛里，虽然眼睛是闭着的，但是那个光亮还是会透过眼皮，还是可以反映出来，另外可能有吵杂的声音，有热，都被第七识了知了，但第七识不知道，这具体是怎么回事，喂……第六识，赶快醒来看看是怎么回事，他就把第六识叫醒了，你不能继续睡了，赶快起来，这时候第六识又产生了，第六识一看，大事不好，着火了，赶快逃命，第六识和第七识他们要互相配合，这是举梦中被惊醒的一个例子。</p><figure><noscript><img src=\"https:width=\"1280\"/></noscript><div><img src=\"https:height=\"768\"></div></figure><p><br></p><p>其实白天也是这样的，我们本来在这里听讲，听得很好，突然外边放一声炮，一响，大家的头一下都转过去了，什么声音，因为这个现象，先被第七识捕捉到以后，第七识，他不能够详细地了解，因为他遍缘一切法，攀缘得太广泛了，所以，就不能够单对一个法，进行很细致的了解，第六识的功能就是可以专门针对一个问题，分别得很详细好比我面前这朵花，可以跟眼识配合了解得非常详细具体，第七识不行，第七识虽然也看到了，但并不能具体了达，所有境界他只能够大概知道，却不能够很详细很具体地知道，这是第七识和第六识的一方面的区别，</p><p><br></p><p>另一方面，第六识，他的主要功能是分别，刚才说过，他能进行周详的分别，可以在某一个点上进行，最详细的分别都没有问题，第六识做完了事情，做得已经成了习惯的事情，变成习惯以后，就由第七识来管了，这是二者的另一区别，好比说，我们一开始学车的人，很紧张，战战兢兢的，这个方向盘怎么掌握，这个离合器怎么踩，这个档怎么挂，外面又要看灯，打转向灯，很多地方需要协同配合，他的注意力，一会儿注意这个地方，一会儿注意那个地方，是跳动的，第七识不然他弥漫地监督一切情况，但是一旦协同已经完成，学习过程结束，已经很自如的时候，第六识，就可以再做别的事情了，司机可以跟旁边的人说话，可以打电话，可以听音乐都没关系了，因为他的运作已经熟练了，变成了一种既定的程序，可以自动地反应，那么就交给第七识了，因此凡是有关习惯的事情，是第七识来管理的，而学习新的东西呢，是第六识完成的。</p><figure><noscript><img src=\"https:width=\"1280\"/></noscript><div><img src=\"https:height=\"970\"></div></figure><p><br></p><p>识和根的关系，就像草本的枝叶和根一样。但不同的是：草木的枝叶和根同一种子而生，识和根种子各别。不过由于某种东西有助于发某种识的作用，特地名为某识的根，这里有一个界限，任何识没有同类根就不能发生，任何根也不能助发异类识。如眼识种子必须依眼根才能发生，而眼根也只能助发眼识，绝对不能助发耳、鼻、舌识等。</p></div>"
    }
]