[{
    "title": "佛说大乘十法经 第314部",
    "author": "僧伽婆罗 译",
    "html": "<div class=\"B1_text\"><p>佛说大乘十法经</p><p>梁扶南<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽婆罗译</p><p>如是我闻。一时佛住王舍城耆阇崛山中。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>五千人俱。无量菩萨众。尔时彼大菩萨众中。有菩萨摩诃萨。名曰净无垢妙净宝月王光。集彼菩萨大众中。尔时净无垢妙净宝月王光菩萨摩诃萨。即从坐起舍莲花台往至佛所。偏袒右肩右膝着地。合掌白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。世尊大乘比丘住大乘比丘者。何故名住大乘比丘。复以何义故此大乘名曰大乘。尔时世尊告净无垢妙净宝月王光菩萨摩诃萨言。善哉善哉。净无垢妙净宝月王光。汝能问如来此甚深妙义。善男子。善思念之。吾当为汝分别解说。尔时净无垢妙净宝月王光菩萨白佛言。世尊。如尊教。尔时世尊告净无垢妙净宝月王光菩萨言。善男子。菩萨摩诃萨成就十法。名住大乘。何等为十。所谓成就正信。成就行。成就性。乐<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。乐法。乐观<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。行于正法及顺法。远离慢我慢等事。善好通达诸微密语。不乐声闻及缘觉等。善男子。菩萨摩诃萨成就如是十法。名住大乘。善男子。菩萨摩诃萨。成就不谄曲柔和行。柔和行彼能信诸佛如来正真正觉无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。善能信一念中三世诸佛智。信如来藏不断常不老死不可尽。亦信实际法界一切种智一切种智相诸力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>不共<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。复信诸佛如来不可灌顶。亦信三十二大人之相八十妙好圆光等法。复信声闻所说或缘觉所说菩萨及余所说。亦信<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>及出世间。复信正行<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>顺行等<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>及<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。亦信诸善根业报最胜上爱果若天天王若人人王。复信不善业报最下恶。不可乐闻不爱甚重粗过。或<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>畜生饿鬼等处。彼如是信已远离三法。何等为三。所谓疑惑不决等事。善男子。菩萨成就如是诸法名为正信。尔时世尊。欲重宣此义。而说偈言</p><p>信为最上乘以是成正觉</p><p>是故信等事智者敬亲近</p><p>信为最世间信者无穷乏</p><p>是以信等法智者正亲近</p><p>不信善男子不生诸白法</p><p>犹如焦种子不生于根芽</p><p>善男子。云何菩萨摩诃萨成就诸行。善男子。菩萨摩诃萨剃除须发以被正服。殷重<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>舍家<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。出家已习学菩萨威仪戒等诸行。或复声闻威仪戒等诸行。亦学缘觉威仪等行。彼如是或以所有身口意等同习<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。彼一切同灭。是中何者身所有同习烦恼。所谓<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>偷盗恶欲邪淫。刀杖瓦石等执悭吝。于他动手足等。往来逃走等事。是名身有同习烦恼。是中何者口家同习烦恼。所谓<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>两舌恶口绮语。恒说恶语毁谤甚深诸典。于诸尊长修梵行中广说恶名。是名口同习烦恼。是中何者意家同习烦恼。所谓悭贪邪见嫉妒。乐著名闻利养。亲族姓慢。色慢。幼年慢。无患慢。长寿多闻慢思惟慢。欲觉<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>觉恶觉亲觉土觉。饮食衣服卧具医药资用等觉。着处着乘着床。着诸饮食。妻子男女。营作犁耧奴婢等。钱财谷麦仓库贮积等事。乃至着种种资用之具。彼如是吝着已。所说事中。若失一事。便生其忧苦恼妄想等事。彼如是远离爱润心已生于思惟。善男子。略说意业。犹如世间轮转。故说意业同习气烦恼。彼如是离身口意业同习烦恼已。于和上所起其尊想。其阿阇梨所起和上想。于同梵行若老若少。起殷重恭敬。彼独在空闲之处。作如是思惟。我不应作如是。我为度一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。为解一切众生。为令安调伏静定众生故发诸行。然我自不调伏不隐诸根。未为寂灭。我必修正行。令有见我者必得成受调伏。亦顺诸佛微妙等教。复令<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>诸天神龙夜叉乾闼婆等。善男子。此名为菩萨惭。彼作如是思惟。勿有令我若道若俗于诸威仪行中取诸过失。所谓行戒行不正中。或见形或威仪行。或行资用<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>行等。彼如是惭愧已。日夜之中六时观于持戒等法。彼善持戒已无复疑悔。令入住如来佛法中。无有休息。善男子。此之名为菩萨愧。善男子。是名菩萨成就如是诸行。尔时世尊。欲重宣此义。而说偈言</p><p>诸佛行为本及声闻<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a></p><p>是故智者<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>行常坚固</p><p>诸菩萨大智行诸无畏行</p><p>令证离垢道诸佛所赞叹</p><p>善男子。云何菩萨成就性。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>菩萨性成。少欲嗔恚愚痴等。不妒不吝不恼。不说粗言。不欲嗔调戏。不轻动。调和柔。已软近亲可性。能成就上妙供具<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诸佛。所谓资用等财。惠施与他。具足成就手足头目等。若见如来或如来弟子。见已即生恭敬欢喜之心。善男子。菩萨如是名为性成就。尔时世尊。欲重宣此义。而说偈言</p><p>相烟即知火鸳鸯以显水</p><p>复相知诸性菩萨大名称</p><p>柔和不谄曲舍离悭嫉妒</p><p>愍念一切众名之为菩萨</p><p>善男子。云何菩萨摩诃萨喜乐菩提心。若有菩萨摩诃萨。体性微发菩提心时。值佛菩萨或声闻缘觉等。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>劝发而生阿耨多罗三藐三菩提心。是名喜乐初发菩提相。彼闻菩提及菩提<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>已。即发阿耨多罗三藐三菩提心。是名第二喜乐菩提相。彼菩萨见诸众生无能救护。无所归依。孤独无能济拔。无覆护。无舍宅。无有洲已。即起悲愍心。彼<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>已作如是念。我今为诸众生。作救护归依济拔覆护舍宅洲等。为彼<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故发无上菩提心。是名第三喜乐发菩提心。彼若见如来或菩萨声闻缘觉等满足诸行。见已心生欢喜爱敬安心。以是因缘发阿耨多罗三藐三菩提心。是名第四发菩提心。彼菩萨为诸众生利益安乐故行。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒修忍发<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>行思<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>修正慧。云何菩萨行布施。所谓须饮与饮。须食与食。须乘给乘。须床榻敷具者。给床榻敷具等。须衣施衣。须金银宝冠环钏等诸<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>具。乃至己身皮肉润益众生。彼如是行于布施已。然彼布施<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>发阿耨多罗三藐三菩提。虽施而不生我慢等心。云何持戒。成就身口意业。彼舍离身口意业等已。善离能防无碍无漏。纯一无杂奉持禁戒。然彼持戒回向阿耨多罗三藐三菩提。虽行持戒然不起我慢等心。善男子。云何菩萨修忍。彼嗔骂说枷锁系闭切割挝打。若道若俗能忍能容。不起诸习等烦恼。如是修忍已然彼回向阿耨多罗三藐三菩提。虽修忍然不起我慢等心。善男子。云何菩萨发精进心。彼作如是念。犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>界无量无边。众生界亦无量无边。然此众生界我独无二。令安无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>界中。是以为彼因缘故发行精进。身不离身念观受。彼观受已观心心行。彼观心心已顺观诸法。彼如是善忆念观已。为未生诸不<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>法令不生故。起欲修勤精进。持心等正行。为未生诸善法令生故。起欲修勤精进。直心等正行。已生诸不善法为令灭故。起欲修勤精进。持心等正行。已生诸善法为令久住故。复令增长思故。起欲修勤精进持心等正行。彼发精进已。令成初如意足分。如是第二第三乃至成第四如意足分。彼成就如意分。能令住一劫若减一劫。或具足行令满精进波罗蜜。如是发精进已。然彼精进回向阿耨多罗三藐三菩提。虽发如是精进然心不生憍慢。善男子。云何菩萨思禅定行。离意欲离意灭离欲静。不依内不依外。不依色不依受想不依识。不依欲色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。不依空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无愿。不依世间出世间。不依布施持戒忍辱精进等。善男子。乃至略说一切有想系缚等名为禅。如是修诸禅。然彼禅回向阿耨多罗三藐三菩提。虽思修此禅。然不起我慢等心。善男子。云何菩萨修智。彼作如是念。无量无边众生界令入涅槃。然无一众生可入涅槃。何以故。如佛所说一切法法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无众生无命无寿无富伽罗。如是修观智。然彼智回向阿耨多罗三藐三菩提。虽观修<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>然不起我慢等心。善男子。如是菩萨摩诃萨乐菩提心。尔时世尊欲重宣此义。而说偈言</p><p>犹如摩尼珠显于宝藏中</p><p>师以加功用倍明于本色</p><p>成就如是性求正菩提心</p><p>二边既寂静令魔不得便</p><p>善男子。云何菩萨乐法成就。善男子。若菩萨性乐法喜法爱法。彼若见沙门若婆罗门。所有资用命具饮食等事。彼能奉上。彼世间所有受用等。根茎枝叶华果等。彼收已施诸众生。持诸法者。令往<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>恭敬合掌迎接已殷重敬纳。心有所疑处问于正义。是以持法者随所闻义善能解释。彼于闻法者起世尊想善知识想。起同世间诸海想。起和上想阿阇梨想。久失导时世间旷野生难中。能访觅起访觅想。久远愚者闇闭目开故。令起<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>想。坠没世间烦恼泥中。而起济拔之想。久远失正路为作导师故。而起导师之想。久伏在世间牢狱能解故。而起解者想。久远着患疗治故。而起良医之想。以烦恼火焦灭身。令住灭故。而起大云雨想。彼为法为法因故。能忍寒热风雨蚊虻等。亦忍饥渴。或见他人受乐报者。不起悕求乐心。然作如是念。唯我世间独乐。而我能闻正法。彼为是事故。为彼因彼缘故。不生忧悲苦恼恨等。彼如是离忧悲苦恼等已。发如是心。我堪能荷负如来所说一法句故。在阿鼻地狱住一劫若减一劫。彼如是无疲倦心已。自然不行诸行。而得一切种智。未得诸佛法而令速得。善男子。以是义故菩萨名为乐着诸法。尔时世尊。欲重宣此义。而说偈言</p><p>大智乐诸法而成诸佛子</p><p>亲近正妙法而不生疲倦</p><p>敬心求正法诸深心佛子</p><p>及以心忆持亦显正妙行</p><p>善男子。云何菩萨摩诃萨正观诸法。善男子。若菩萨作如是观。一切诸法犹如幻。迷惑凡夫故。一切诸法如梦。不实故。一切诸法如水中月。非事故。一切诸法如响。非众生故。一切诸法如影。计妄想故。一切诸法如响。声生灭坏故。一切诸法生灭坏。缘假成故。一切诸法本不生不移。同真如体故。一切诸法不灭。本不生故。一切诸法无作。无作者故。一切诸法如虚空。不可染故。一切诸法定寂灭。性不染故。一切诸法无垢。离一切诸垢故。一切诸法性灭。离烦恼故。一切诸法非色。不可见故。一切诸法离心境界。无体性故。一切诸法不住。灭诸毒故。一切诸法不可求。灭爱憎等心故。一切诸法无著。离烦恼境界故。一切诸法如毒蛇。离善巧方便故。一切诸法如芭蕉。无坚实故。一切诸法如水沫。体性弱故。善男子。菩萨如是观名为正观诸法</p><p>尔时世尊。欲重宣此义。而说偈言</p><p>一切法如幻迷惑愚迷者</p><p>虚危犹如梦汝等如是持</p><p>法如水中月亦如响等事</p><p>复如影像等智者诸不觉</p><p>善男子。云何菩萨摩诃萨行法顺法等。善男子。若菩萨摩诃萨。观色<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。而不厌离色。欲证于法已。正智助法界。同用等法善自观入。善持彼者诸相。善思善记。彼记此相善持善修善记已。自然行法界等行。受想行识亦观无常。然不厌离识等之。入法界已。正智助同。法界等法善自观达。亦记彼相善持善修善记已。自然入法界等行。如无常苦空无我亦尔。彼观色无常已。于色中不生恐怖惊等。何以故。色是妄想颠倒所起。然彼如实知。观受想行识无常。乃至于识中。不恐不怖不惊。何以故。识者妄想颠倒所起故。然彼如实知。善男子。譬如善巧幻师或幻师弟子。化作种种幻事象兵马兵车兵步兵。彼智者见已不生恐怖惊等。何以故。彼如实知是幻师所作不实。未曾有虚诳作。菩萨亦如是。观色无常已。于色中不生恐怖惊等。何以故。色是妄想颠倒所起。然彼如实知。观受想行识无常已。乃至于识中不生恐怖惊等。何以故。识者妄想颠倒所起故。然彼如实知。尔时净无垢妙净宝月王光菩萨白佛言。世尊。云何菩萨观诸色无常。然不厌离色。而证法界已。正智观入助法界等法。尔时世尊。告净无垢妙净宝月王光菩萨言。善男子。吾当为汝分别说喻。善男子。譬如有智男子。常事诸毒。善持善覆善惜。起我相已种种庄严具贸易。然是不食彼毒。勿令我因此事断其正命。菩萨亦如是。向涅槃心。润向涅槃。顺向涅槃。近取涅槃。然不证彼涅槃。何以故。勿令我因于此事退菩提行。善男子。譬如有人事其火神。然彼人日夜香华等供养恭敬尊重赞叹亲侍。然彼人不作是念。我以事火供养恭敬尊重赞叹。亲近已我以二手接取之。何以故。勿令我因此事于身有苦于心有恼。菩萨如是。向涅槃心。润向涅槃。顺向涅槃。及取涅槃。然彼不证涅槃。何以故。勿令我因此事退菩提行。尔时净无垢妙净宝月王光菩萨白佛言。世尊。如我知世尊所说意趣。菩萨者应住世间。佛言。如是如是。善男子。菩萨应住世间。问曰世尊。云何菩萨住世间。而不以世间诸患所染。佛言。善男子。为此事故略说一喻。善男子。譬如咒术之人。以大咒术力故。诸恶毒紊叩扰?贰H槐巳瞬灰源耸露掀涿??:我怨省R员巳松仆ù镏涫趿?省F腥?嗳缡恰P惺兰渥∈兰洹W∈兰湟选4笾欠奖阒淞?省9仓罘衬斩旧叨?酉繁?R嗯?凶∽?浴F腥?灰源耸鹿视谄刑岫?型嘶埂:我怨省1顺删痛笾欠奖阒淞?省6?本晃薰该罹槐υ峦豕馄腥?浴J雷稹OS邢S小1酥钇腥??懿恢つ鶚劇8床灰允兰浞衬斩局??尽J雷稹N医窆橐乐畲笃腥?J雷稹J侵钪谏?删椭钌聘?N糯朔ㄒ讯??换断残摹J雷稹1松颇凶由婆?恕V罘鹨鸭恰H裟芪糯朔?拧7鹧浴I颇凶印K荡朔ㄊ薄N灏俦惹稹N粗の蘼┒?媒馔选1说媒馔岩鸭创幼?稹F?挥壹缬蚁プ诺亍:险葡蚍稹0追鹧浴J雷稹V钇腥?摺?删纯衫癜荨7鹩镏畋惹稹H缡侨缡恰H缛晁?怠6?笔雷稹S?匦?艘濉6?蒂恃</p></div>"
}]