[{
    "title": "大般涅槃经后分 第377部",
    "author": "若那跋陀罗 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>大般<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>后分 卷上</p><p>大唐南海波淩国<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>若那跋陀罗译</p><p>憍陈如品余</p><p>尔时须跋陀罗。从佛闻说大般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>甚深妙法。而得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>见法清净。爱护<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>已舍邪见。于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>中深信坚固。即从如来欲求<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。佛言。善哉善哉。须跋陀罗善。来<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。悦可圣心善入佛道。于是须跋陀罗。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃忻庆无量。即时须发自落而作沙门。法性智水灌注心原。无复缚着。漏尽意解得罗汉果。须跋陀罗既<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>已。即前佛所瞻仰尊颜头面礼足。偏袒右肩右膝着地长跪合掌。悲喜交流深自悔责在昔罪咎。而白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。恨我毒身久劫已来常相欺惑。令我长没无明邪见。沦溺<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>外道法中。痛哉苦哉为害滋甚。今大喜庆。蒙如来恩得入正法。世尊。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>大海慈愍无量。窃自惟忖。累劫碎躯未能报此须臾之恩。须跋陀罗说是语已。悲泣流泪不能自裁。复白佛言。世尊。我年老迈余命无几。未脱众苦行苦迁逼。唯愿世尊。少住教诫哀愍救护莫般涅槃。尔时世尊默然不许。须跋陀罗不果所请。愁忧热恼高声唱曰。苦哉苦哉。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。世间虚空。如何于今大怖即至热恼流行。哀哉哀哉。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>福尽正慧眼灭。复更流泪悲号哽咽。遍体血现发声大哭。于如来前举身投地。慌乱浊心昏迷闷绝。久乃苏醒涕泪哽咽。而白佛言。世尊。我今不忍见于如来入般涅槃。中心痛切难任裁抑。我自何能与此坏器毒身共住。今前宁可先自速灭。唯愿世尊。后当涅槃。尔时须跋陀罗。说是语已悲恋哽咽。于是时顷即入涅槃</p><p>尔时不可说不可说无数亿恒河沙诸大菩萨比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。一切世间<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗等。同声唱言。苦哉苦哉。如何正觉一旦舍离。无主无归无依无趣。追思恋慕悲感号泣。互相执手捶胸闷绝迷失诸方。哀恸三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。尔时世尊。出八种声普告大众。莫大号哭犹如婴儿。各相裁抑勿自乱心。汝等于此行苦<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>大海。勤修净心莫失念慧。疾求正智速出诸有。三界受身苦轮无际。无明郎主恩爱魔王。役使身心策为僮仆。遍缘境界造生死业。贪恚狂痴念念伤害。<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来常受苦恼。何有智者不反斯原。汝等当知。我旷劫来已入大寂。无阴界入永断诸有。金刚宝藏常乐我净。我今于此显难思议现方便力。入大涅槃示同世法。欲令众生知身如电生恋慕心。生死瀑河漂流速疾。诸行轮转法应如是。如来涅槃甚深甚深不可思议。乃是诸佛菩萨境界。非诸声闻缘觉所知</p><p>佛复告诸大众。是须跋陀罗。已曾<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>恒河沙佛。于诸佛所深种善根。以本愿力常在尼干外道法中。出家<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。以方便慧诱进邪见失道众生令入正智。须跋陀罗乘本愿力。今得遇我最后涅槃得闻正法。既闻正法得罗汉果。既得果已复入涅槃。自我得道度阿若憍陈如。最后涅槃度须跋陀罗。吾事究竟无复施为。设我久住无异今也。尔时世尊说是语已。即嘘长叹唱言。善哉善哉。须跋陀罗为报佛恩。汝等大众。应当供养其尸安立塔庙。尔时大众。惆怅惨结掩泪裁抑。即依<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>以香木苏油茶毗其尸。须跋陀罗当焚尸时。即于火中放大光明现十八变。身上出水身下出火。右胁出火左胁出水。小复现大大复现小满虚空中。尔时无量大众。及诸外道邪见众生。发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>得入<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。须跋陀罗现神变已还复火中茶毗已讫。是时大众悲感伤悼。收取<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>起塔供养</p><p>大般涅槃经遗教品第一</p><p>尔时佛告阿难普及大众。吾灭度后汝等<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>。当勤护持我大涅槃。我于无量万亿阿僧祇劫。修此难得大涅槃法。今已显说。汝等当知。此大涅槃乃是十方三世一切诸佛金刚宝藏。常乐我净周圆无缺。一切诸佛于此涅槃而般涅槃。最后究竟理极无遗。诸佛于此放舍身命。故名涅槃。汝等。欲得决定真报佛恩。疾得<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>诸佛摩顶。世世所生不失<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。十方诸佛常现其前。昼夜守护令一切众得出世法。当勤修习此涅槃典</p><p>佛复告阿难。吾未<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>示入郁头蓝弗外道法中。修学四禅八定受行其教。吾成佛来毁呰其法渐渐诱进。最后须跋陀罗皆入佛道。如来以大智炬烧邪见幢。如干草叶投大火焰。阿难。今我亲戚诸释种子吾甚忧念。我涅槃后汝当精勤。以善教诫我诸眷属。授与妙法深心诲诱。勿得调戏放逸散心。入诸境界受行邪法。未脱三界世间<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。早求出离于此五浊爱欲之中。应生忧畏无救护想。一失人身难可追复。毕此一形常须警察。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>大鬼情求难脱。怜愍众生莫相杀害。乃至蠢动应。施<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。身业清净常生妙土。口业清净离诸过恶。莫食肉莫饮酒。调伏心蛇令入<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。深思行业<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之报。如影随形。三世<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>循环不失。此生空过后悔无追。涅槃时至示教如是</p><p>尔时阿难闻佛语已。身心战动情识恾然。悲哽喑咽深没忧海。举体迷闷昏乱浊心。投如来前犹如死人。尔时阿泥楼逗安慰阿难。轻其愁心而语之言。咄哉何为愁苦。如来涅槃时至。今日虽有明旦则无。汝依我语咨启如来如是四问。佛涅槃后六群比丘行污他家恶性车匿。云何共住而得示教。如来在世以佛为师。世尊灭后以何为师。若佛在世依佛而住。如来既灭依何而住。如来灭后结集法藏。一切经初安何等语。尔时阿难如从梦中闻阿泥楼逗。安慰其心令致四问。渐得醒悟哀不自胜。具陈上问而以白佛</p><p>佛告阿难。何为忧苦悲哀乃尔。诸佛化周。施为已讫法归是处。善哉善哉。阿难。汝致四问为最后问。能大利益一切世间。汝等谛听。善思念之。唯然世尊。愿乐欲闻。佛告阿难。如汝所问。佛涅槃后六群比丘恶性车匿行污他家。云何共住而得示教。阿难。车匿比丘其性鄙恶。我涅槃后渐当调伏。其心柔和舍本恶性。阿难。我弟难陀。具极重欲其性鄙恶。如来以善方便示教利喜。知其根性以波若慧。为说<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。所谓无明缘行。行缘识。乃至老死忧悲苦恼。皆是无明憎爱<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。一切行苦弥满三界遍流<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>。大苦根本无明所起。以波若慧示以性净谛观根本。即断诸有过患无明。根本灭故无明灭。无明灭则行灭。乃至老死忧悲苦恼皆灭。得此观时摄心定住即入<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。以三昧力得入初禅。渐渐次第入第四禅。继心正念如是修习。然后自当得证上果离三界苦。阿难。尔时难陀比丘。深生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>依我教法勤心修习。不久即得阿罗汉果。阿难。我涅槃后汝当依我教法正观。教示六群车匿比丘。深心依此清净正法。不久自当得证上果。阿难。当知皆因无明。增长三界生死大树。飘没爱河众苦长夜。黑闇崖下绕生死柱。六识为枝<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>为本。无明波浪<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>策使。游戏六尘种苦恼芽。无能制者。<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>如王。是故我言无明郎主念念伤害。众生不觉轮<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死。阿难。一切众生为此无明起诸爱结。我见覆蔽八万四千。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>郎主役使其身。身心破裂不得自在。阿难。无明若灭三界都尽。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>名出世人。阿难。若能谛观十二因缘。究竟<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>深入本净。即能远离三界大火。阿难。如来是真语者说诚实言。最后付嘱汝当修行。阿难。如汝所问。佛去世后以何为师者。阿难。尸波罗蜜戒是汝大师。依之修行能得出世甚深定慧。阿难。如汝所问。佛涅槃后依何住者。阿难。依<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>严心而住。观身性相同于虚空。名身念处。观受不在内外不住中间。名受念处。观心但有名字名字性离。名心念处。观法不得善法不得不善法。名法念处。阿难。一切<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。应当依此四念处住。阿难。如汝所问。如来灭后结集法藏。一切经初安何等语者。阿难。如来灭后结集法藏。一切经初。当安如是我闻一时佛住某方某处与诸四众而说是经</p><p>尔时阿难复白佛言。若佛在世若涅槃后。有信心檀越。以金银七宝一切乐具奉施如来。云何举置。佛告阿难。若佛现在所施佛物。僧众应知。若佛灭后一切信心所施佛物。应用造佛形像。及造佛衣七宝幡盖。买诸香油宝花以供养佛。除供养佛。余不得用。用者即犯盗佛物罪。阿难复白佛言。若佛现在若复有人以金银七宝房舍殿堂妻子奴婢衣服饮食一切乐具。深心恭敬<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>供养如来。佛涅槃后。若复有人。以金银七宝妻妾奴婢衣服饮食一切乐具。供养如来形像深心恭敬礼拜供养。世尊。如是二人深心供养。所得福德何者为多。佛告阿难。如是二人。皆以深心供养。所得福德其福无异。何以故。虽佛灭后。法身常存。是以深心供养其福正等。阿难复白佛言。若佛现在。若复有人。还以深心如上供养恭敬如来。佛涅槃后。若复有人。还以深心如上供养恭敬全身舍利。世尊。如是二人所得福德何者为多。佛告阿难。如是二人得福正等。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>广大无量无边。乃至毕苦其福不尽。阿难复白佛言。若佛现在。若复有人。如上深心一切供养恭敬如来。佛涅槃后。若复有人。如上深心供养恭敬半身舍利。世尊。如是二人所得福德何者为多。佛告阿难。如是二人深心供养得福无异。所得福德无量无边。阿难。若佛灭后。若复有人。深心供养如来舍利四分之一。八分之一。十六分之一。百分之一。千分之一。万分之一。恒河沙分之一。乃至如芥子许。皆以深心供养恭敬尊重赞叹。若佛现在。若复有人。深心供养恭敬如来。如是二人所得福德皆悉无异。其福无量不可称计。阿难当知。若佛现在。若涅槃后。若复有人深心恭敬供养礼拜尊重赞叹。如是二人所得福德无二无别。佛告阿难及诸大众。我涅槃后。天上人间一切众生。得我舍利悲喜交流哀感欣庆。恭敬礼拜深心供养。得无量无边功德。阿难。若见如来舍利即是见佛。见佛即是见法。见法即是见僧。见僧即见涅槃。阿难。当知以是因缘。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a><a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>无有变易。能为众生作归依处。阿难复白佛言。佛涅槃后。一切大众依何法则茶毗如来而得舍利深心供养。佛告阿难。我般涅槃。汝等大众当依转轮圣王茶毗方法。阿难复白。转轮圣王茶毗法则其事云何。佛告阿难。转轮圣王命终之后。经停七日乃入铁棺。既入棺已即以微妙香油注满棺中。闭棺令密。复经七日。从棺中出以诸香水灌洗沐浴。既灌洗已烧众名香而以供养。以兜罗绵遍体儭身。然后即以无价上妙白[叠*毛]千张。次第相重遍缠王身。既已缠讫以众香油满铁棺中。圣王之身尔乃入棺。密闭棺已。载以香木七宝车上。其车四面垂诸璎珞。一切宝绞<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>其车。无数花幡七宝幢盖。一切妙香一切天乐围绕供养。尔乃纯以众妙香木表里文饰。微妙香油茶毗转轮圣王之身。茶毗已讫收取舍利。于都城内四衢道中起七宝塔。塔开四门安置舍利。一切世间所共瞻仰。阿难。其转轮王以少福德绍此王位。未脱诸有具足五欲。妻妾婇女恶见三毒。一切烦恼诸结使等未断一毫。命终之后世间犹乃如是法则。起塔供养一切瞻仰。阿难。何况如来已于无量无边无数阿僧祇劫。永舍五欲妻妾婇女。于世间法已作霜雹。难勤能勤。难行能行。一切菩萨出世苦行勤苦修习。十方三世一切诸佛所行之道甚深微妙清净<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>解脱知见<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。无不具足。修习如来十力大悲四无所畏。三解脱门十八大空。六通五眼。三十七品十八不共法。三十二相八十种好。一切诸佛<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。一切净佛国土。一切成就众生。一切难行苦行。一切摄善法戒。一切摄众生戒。一切摄<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒。一切功德。一切智慧。一切庄严。一切大愿。一切方便。如是等不可思议福德智慧。皆已成就无不具足。断除一切不善。断除一切烦恼。断除一切烦恼余习。通达<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>十二因缘。于菩提树降伏四魔成就种智。如是妙法悉修习已。尔乃一切诸佛唱言。善哉善哉。同以法性智水灌法身顶。乃成阿耨多罗三藐三菩提。以是因缘。我今号天人师十方种觉至极世尊。天上人间无与等者。等视众生如罗睺罗。故名如来应供正遍知明行足善逝世间解无上士调御丈夫天人师佛世尊。怜愍世间<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>周毕。为众生故今入涅槃。随世间法如转轮王。为令众生普得供养。阿难。我入涅槃如转轮王。经停七日乃入铁棺。以妙香油注满棺中密盖棺门。其棺四面应以七宝间杂庄严。一切宝幢香花供养。经七日已复出铁棺。既出棺已应以一切众妙香水。灌洗沐浴如来之身。既灌洗已以上妙兜罗绵遍体缠身。次以微妙无价白[叠*毛]千张。复于绵上缠如来身又入铁棺。复以微妙香油盛满棺中闭棺令密。尔乃纯以微妙牛头栴檀沉水一切香木盛七宝车。一切众宝以为庄严。载以宝棺至茶毗所。无数宝幢。无数宝盖。无数宝衣。无数天乐。无数香花。周遍虚空悲哀供养。一切天人无数大众。应各以栴檀沉水微妙香油茶毗如来。哀号恋慕茶毗已讫。天人四众收取舍利盛七宝瓶。于都城内四衢道中。起七宝塔供养舍利。能令众生得大功德。离三有苦至涅槃乐。阿难当知。一切四众起<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>七宝塔已。应当更起三塔供养。所谓辟支佛塔。阿罗汉塔。转轮王塔。为令世间知归依故。阿难白佛言。如来出世悲愍众生。显示十力大悲四无所畏。十二因缘四谛之法三解脱门。八种<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>雷震三界。五色慈光遍照六道。随顺众生心业所转。或得四果三乘所行。或证无漏无为缘觉之道。或入无灭无生菩萨之地。或得无量诸陀罗尼。或得五眼。或得六通。或脱三恶。或出八难。或离人天三界之苦。如来慈力清净。如来解脱法门不可思议。乃至涅槃一切世间人天四众起七宝塔。供养舍利得大功德。能令众生脱三界苦入正解脱。以是因缘。佛般涅槃。一切世间人天大众。报佛甚深无量慈恩。起七宝塔供养舍利。理应如是。世尊。其余三塔于诸众生得何等利。而令起立恭敬供养。佛告阿难。其辟支佛。悟法因缘入深法性。已脱诸有一切过患。能为人天而作<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。以是因缘起塔供养。所得福德次于如来。能令众生皆得妙果。阿难。其阿罗汉。于三界中生分已尽。不受后有梵行已立。能为世间而作福田。是故应当起塔供养。所得福德次辟支佛。亦令众生皆得解脱。阿难。其转轮王。虽未解脱三界烦恼。福德力故治四天下。而以十善化育群生。是诸众生之所尊敬。以是四众起塔供养。所得福德亦复无量</p><p>阿难白佛言。佛般涅槃。一切四众。当于何所茶毗如来得收舍利。唯愿示教。佛告阿难。佛般涅槃。一切四众。若于拘尸城内茶毗如来。其城中人皆绍王位。则相讨罚诤讼无量。亦令一切得福阶差。阿难。一切四众可于城外茶毗如来。为令世间得福等故。阿难白佛言。佛入涅槃茶毗已讫。一切四众收取舍利安置宝瓶。当于何所起七宝塔。一切皆得深心供养。唯愿示教。佛告阿难。佛般涅槃茶毗既讫。一切四众收取舍利置七宝瓶。当于拘尸那伽城内四衢道中起七宝塔。高十三层。上有相轮。一切妙宝间杂庄严。一切世间众妙花幡而严饰之。四边栏楯七宝合成。一切庄挍靡不周遍。其塔四面面开一门。层层间次窓牖相当。安置宝瓶如来舍利。天人四众瞻仰供养。阿难。其辟支佛塔应十一层。亦以众宝而严饰之。阿难。其阿罗汉塔成以四层。亦以众宝而严饰之。阿难。其转轮王塔。亦七宝成。无复层级。何以故。未脱三界诸有苦故。尔时阿泥楼逗白佛言。佛涅槃后茶毗已讫。一切天人四部大众。如何分布如来舍利而得供养。尔时佛告阿泥楼逗。我般涅槃汝等天人取佛舍利。以平等心分布三界一切六道世间供养。尔时释提桓因白佛。我今从佛敬请如来半身舍利。而我深心愿供养故。佛告天帝。如来等视众生如罗睺罗。汝不应请半身舍利。何以故。平等利祐诸众生故。佛告天帝。我今与汝右边上颔一牙舍利。可于天上起塔供养。能令汝得福德无尽</p><p>尔时天人一切大众。悲哀流泪不能自裁。尔时世尊普告四众。佛般涅槃。汝等天人莫大愁恼。何以故。佛虽涅槃而有舍利常存供养。复有无上法宝。修多罗藏。毗那耶藏。阿毗达磨藏。以是因缘。三宝四谛常住于世。能令众生深心归依。何以故。供养舍利即是佛宝。见佛即见法身。见法即见贤圣。见贤圣故即见四谛。见四谛故即见涅槃。是故当知三宝常住无有变易。能为世间作归依故。佛复告诸大众。汝等莫大愁苦。我今于此垂欲涅槃。若戒若归若常无常。三宝四谛六波罗蜜十二因缘。有所疑者当速发问为究竟问。佛涅槃后无复疑悔。三过告众。尔时四众忧悲苦恼哽咽流泪。痛切中心追思恋慕愁毒闷绝。佛神力故掩泪寂然无发问者。何以故。一切四众已于戒归三宝四谛。通达晓了无有疑故。尔时世尊知诸四众无复余疑叹言。善哉善哉。汝等四众。已能通达三宝四谛无有疑也。犹如净水洗荡身垢。汝等当勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>早得出离。莫生愁恼迷闷乱心</p><p>尔时世尊于师子座。以真金手却身所著僧伽梨衣。显出紫磨黄金师子胸臆。普示大众告言。汝等一切天人大众。应当深心看我紫磨黄金色身。尔时四众一切瞻仰大觉世尊真金色身。目不暂舍悉皆快乐。譬如比丘入第三禅难生是中。尔时世尊以黄金身示大众已。即放无量无边百千万亿大涅槃光。普照十方一切世界。日月所照无复光明。放是光已复告大众。当知如来为汝等故。累劫勤苦截身手足。尽修一切难行苦行。大悲本愿于此五浊成阿耨多罗三藐三菩提。得此金刚不坏紫磨色身。具足三十二相八十种好。无量光明普照一切。见形遇光无不解脱。佛复告诸大众。佛出世难如优昙花希有难见。汝等大众。最后遇我。为于此身不生空过。我以本誓愿力生此秽土。化缘周毕今欲涅槃。汝等以至诚心看我紫磨黄金色身。汝当修习如是清净之业。于未来世得此<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a></p><p>尔时世尊如是三反殷勤三告。以真金身示诸大众。即从七宝师子大床。上升处空高一多罗树一反告言。我欲涅槃。汝等大众。看我紫磨黄金色身。如是展转高七多罗树七反告言。我欲涅槃。汝等大众。应当深心看我紫磨黄金色身。从空中下坐师子床。复告大众。我欲涅槃。汝等深心看我紫磨黄金色身。尔时世尊从师子床复升虚空高一多罗树。复告大众。我欲涅槃。汝等深心看我紫磨黄金色身。如是展转高七多罗树七反告言。我欲涅槃。汝等大众。看我紫磨黄金色身。从空中下坐师子床。复告大众。我欲涅槃。汝等深心看我紫磨黄金色身。尔时世尊从师子床复升虚空高一多罗树。复告大众。我欲涅槃。汝等深心看我紫磨黄金色身。如是展转高七多罗树七反告言。我欲涅槃。汝等深心看我紫磨黄金色身。从空中下坐师子床。复告大众。我欲涅槃。汝等深心看我紫磨黄金色身。尔时世尊显出如来紫磨黄金色身。普示大众。如是三反上升虚空高七多罗树。三反从空中下坐师子床。如是殷勤二十四反告诸大众。我欲涅槃。汝等深心看我金刚坚固不坏紫磨黄金无畏色身。如优昙花难可值遇。汝等当知。我欲涅槃。汝等应当以至诚心看我紫磨黄金色身。如热渴人遇清冷水。饮之令饱无复余念。汝等大众。亦复如是。我欲涅槃。汝等大众。应当深心瞻仰为是最后见于如来。自此见已无复再睹。汝等大众。瞻仰令足无复后悔。佛复告诸大众。我涅槃后。汝等大众。应广修行早出三有。勿复<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>散心放逸。尔时一切世界天人四众。遇涅槃光瞻仰佛者。一切三涂八难世间人天所有烦恼。四重五逆极恶罪咎。永灭无余皆得解脱。尔时世尊显出紫磨黄金色身。殷勤相告示大众已。还举僧伽梨衣如常所披</p><p>大般涅槃经应尽还源品第二</p><p>佛复告诸大众。我今时至举身疼痛。说是语已即入初禅。以涅槃光遍观世界入寂灭定。尔时世尊所言未讫即入初禅。从初禅出入第二禅。从二禅出入第三禅。从三禅出入第四禅。从四禅出入虚空处。从空处出入无边识处。从识处出入不用处。从不用出入非想非非想处。从非非想处出入灭尽定。从灭尽定出还入非想非非想处。从非非想出入不用处。从不用出入无边识处。从无边识处出入虚空处。从空处出入第四禅。从四禅出入第三禅。从三禅出入第二禅。从二禅出入第一禅</p><p>尔时世尊。如是逆顺入诸禅已。普告大众。我以甚深波若。遍观三界一切六道。诸山大海大地含生。如是三界根本性离。毕竟寂灭同虚空相。无名无识永断诸有。本来平等无高下想。无见无闻无觉无知。不可系缚不可解脱。无众生无寿命。不生不起不尽不灭。非世间非非世间。涅槃生死皆不可得。二际平等等诸法故。闲居静住无所施为。究竟安置必不可得。从无住法法性施为。断一切相一无所有。<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>如是。其知是者名出世人。是事不知名生死始。汝等大众。应断无明灭生死始</p><p>尔时世尊说是语已复入超禅。从初禅出入第三禅。从三禅出入虚空处。从虚空出入无所有处。从无所有出入灭尽想定。从灭尽定出次第还入。至非想非非想处。从非非想出入无边识处。从识处出入第四禅。从四禅出入第二禅。从二禅出入于初禅。如是逆顺入超禅已。复告大众。我以摩诃<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。遍观三界有情无情。一切人法悉皆究竟。无系缚者。无解脱者。无主无依不可摄持。不出三界。不入诸有。本来清净无垢无烦恼。与虚空等。不平等非不平等。尽诸动念思想心息。如是法相名大涅槃。真见此法名为解脱。凡夫不知名曰无明。作是语已复入超禅。从初禅出乃至入灭尽定。从灭尽定出乃至入初禅。如是逆顺入超禅已。复告大众。我以佛眼遍观三界一切诸法。无明本际性本解脱。于十方求了不能得。根本无故。所因枝叶皆悉解脱。无明解脱故。乃至老死皆得解脱。以是因缘。我今安住常寂灭光名大涅槃。尔时阿难。无极悲哀忧愁痛苦。心狂慌乱情识昏迷。如重醉人都无知觉。不见四众。不知如来已入涅槃为未涅槃</p><p>尔时世尊。如是三过从超入诸<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>遍观法界。普为大众三反<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。如来如是展转二十七反入诸禅定。阿难。以不知故佛入一禅即致一问。如是二十七反问阿泥楼逗。佛已涅槃为未涅槃。阿泥楼逗深知如来入诸禅定。二十七反皆答阿难。佛未涅槃。尔时一切大众皆悉慌乱都不觉知。如来涅槃为未涅槃。尔时世尊。三反入诸禅定。三反示诲众已。于七宝床右胁而卧。头枕北方足指南方。面向西方后背东方。其七宝床微妙璎珞以为庄严。娑罗树林四双八只。西方一双在如来前。东方一双在如来后。北方一双在佛之首。南方一双在佛之足。尔时世尊。娑罗林下寝卧宝床。于其中夜入第四禅寂然无声。于是时顷便般涅槃。大觉世尊入涅槃已。其娑罗林东西二双合为一树。南北二双合为一树。垂覆宝床盖于如来。其树即时惨然变白犹如白鹤。枝叶花果皮干悉皆爆裂堕落。渐渐枯悴摧折无余</p><p>尔时十方无数万亿恒河沙普佛世界。一切大地皆大震动。出种种音唱言。苦哉苦哉。世界空虚。演出无常苦空哀叹之声。尔时十方世界一切诸山。目真邻陀山。摩诃目真邻陀山。铁围山。大铁围山。诸须弥山香山宝山。金山黑山。一切大地所有诸山。一时震裂悉皆崩倒。出大音声震吼世界唱言。苦哉苦哉。如何一旦世间孤露。慧日灭没大涅槃山。一切众生丧真慈父。失所敬天无瞻仰者。尔时十方世界一切大海。悉皆混浊沸涌涛波。出种种音唱言。苦哉苦哉。正觉已灭众生罪苦。长夜久流生死大海。迷失正路何由解脱。尔时一切江河溪涧沟壑。川流。泉源渠井浴池。悉皆倾覆水尽枯涸。尔时十方世界大地虚空寂然大闇。日月精光悉无复照。黑闇愁恼弥布世界。于是时间忽然黑风鼓怒惊振。吹扇尘<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>闇世界。尔时大地一切卉木。药草诸树花果枝叶。悉皆摧折碎落无遗。于是时顷十方世界一切诸天。遍满虚空哀号悲叹。震动三千大千世界。雨无数百千种种上妙天香天花。遍满三千大千世界[廿/积]高须弥供养如来。于上空中复雨无数天幢天幡天璎珞天轩盖天宝珠。遍满虚空变成宝台。四面珠璎七宝绞络。光明华彩供养如来。于上空中复奏无数微妙天乐。鼓吹弦歌出种种音唱言。苦哉苦哉。佛已涅槃。世界空虚。群生眼灭。烦恼罗刹大欲流行。行苦相续痛轮不息。尔时阿难。心慌迷闷都不觉知。不识如来已入涅槃未入涅槃。唯见非恒境界。复问楼逗。佛涅槃耶。楼逗答言。大觉世尊已入涅槃。尔时阿难闻是语已。闷绝躄地犹如死人。寂无气息冥冥不晓。尔时楼逗。以清冷水洒阿难面扶之令起。以善方便而慰喻之语阿难言。哀哉哀哉。痛苦奈何奈何。莫大愁毒热恼乱心。如来化缘周毕。一切人天无能留者。苦哉苦哉。奈何奈何。何期今日人天之师为事究竟。无能留者。奈何我与汝等且共裁抑。复慰喻言。阿难。佛虽涅槃而有舍利无上法宝。常住于世。能为众生而作归依。我与汝等当勤精进。以佛法宝授与众生。令脱众苦报如来恩。尔时阿难。闻慰喻已渐得醒悟。哽咽流泪悲不自胜。其拘尸那城娑罗林间纵广三十二由旬。天人大众皆悉遍满。尖头针锋受无量众。间无空缺不相障蔽。尔时无数亿菩萨一切大众。悉皆迷闷昏乱浊心。都不觉知如来涅槃及未涅槃。唯见非恒变动。一时同问楼逗。佛涅槃耶。尔时楼逗告诸大众一切天人。大觉世尊已入涅槃。尔时无数一切大众闻是语已。一时昏迷闷绝躄地。苦毒入心阨声不出。其中或有随佛灭者。或失心者。或身心战掉者。或互相执手哽咽流泪者。或常捶胸大叫者。或举手拍头自拔发者。或有唱言痛哉痛哉荼毒苦者。或有唱言如来涅槃一何疾哉。或有唱言失我所敬天者。或有叹言世界空虚众生眼灭者。或有叹言烦恼大鬼已流行者。或有叹言众生善芽种子灭者。或有叹言魔王欣庆解甲胄者。或自呵责身心无常观者。或有正观得解脱者。或有伤叹无归依者。中有遍体血现流洒地者。如是异类殊音。一切大众哀声普震一切世界。尔时<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>主尸弃大梵天王。知佛已入涅槃。与诸天众即从初禅飞空而下。举声大哭流泪悲咽。投如来前闷绝躄地。久乃稣醒哀不自胜。即于佛前以偈悲叹</p><p>世尊往昔本誓愿为我等故居忍土</p><p>乃隐无量自在力贫所乐法度众生</p><p>方便逐宜随应说众生无不受安乐</p><p>诱进令出三有苦究竟皆至涅槃道</p><p>如来慈母育众生普饮众生大悲乳</p><p>何期一旦忽舍离人天孤露无所依</p><p>痛哉众生善种芽无天<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>令增长</p><p>善芽渐渐衰灭已罪业相牵堕恶道</p><p>奈何世界悉空虚众生正慧眼已灭</p><p>既行无明黑闇中堕落三有沦溺苦</p><p>奈何众生罪无救愿依舍利得解脱</p><p>劝请如来大悲力救护令我脱苦地</p><p>何其痛哉此恶世如来弃我入涅槃</p><p>尔时释提桓因。与诸大众从空而下唱言。苦哉苦哉。发声大哭悲泣流泪。投如来前闷绝躄地。久乃稣醒悲哀哽咽。胡跪佛前。说偈哀叹</p><p>如来历劫行苦行普为我等群生故</p><p>得成无上正觉道等育众生如一子</p><p>施法药中为上药疗病医中为胜医</p><p>大慈悲云荫众生甘露慧雨雨一切</p><p>慧日光照无明闇无明众生见圣道</p><p>圣月慈光照六趣三有蒙光脱众苦</p><p>何期于今舍大慈已入涅槃众不见</p><p>本誓大悲今何在弃舍众生如涕唾</p><p>我等一切诸众生如犊失母必当死</p><p>四众互相执手哭捶胸大哀动三界</p><p>苦哉苦哉诸有人如何一旦尽孤露</p><p>我等福尽苦何甚善芽燋燃无复润</p><p>唯愿法宝舍利光照我令脱三有苦</p><p>哀哉痛哉我等众几何重得见如来</p><p>尔时楼逗。悲哀号泣伤悼无量。胡跪佛前。以偈悲赞</p><p>正觉法王育我等饮我法乳长法身</p><p>众生法身未成立又复慧命少资粮</p><p>应以八音常演畅令众闻已悉悟道</p><p>常放大慈五色光令众蒙光皆解脱</p><p>如何今日永涅槃行苦众生何依趣</p><p>苦哉世尊舍大悲我等孤穷必当死</p><p>虽知世尊现方便我等无能不悲哀</p><p>四众迷闷昏失心哀动天地震三界</p><p>世尊独处大安乐众生大苦欲何之</p><p>世尊往昔为我等众劫舍头截手足</p><p>得成无上正觉道不久住世即涅槃</p><p>我及四众处无明魔王欣庆舍甲胄</p><p>哀哉世尊愿大悲舍利慈光摄我等</p><p>伏请世尊愍四众法宝流润愿不穷</p><p>我等不能即殒灭苟存余命能几何</p><p>苦哉痛切难堪忍重见世尊无复期</p><p>尔时阿难。闷绝渐醒举手拍头。捶胸哽咽悲泣流泪。哀不自胜。长跪佛前。以偈悲叹</p><p>我昔与佛誓愿力幸共同生释种中</p><p>如来得成正觉道我为侍者二十载</p><p>深心敬养情未足一旦见弃入涅槃</p><p>痛哉哀哉荼毒苦无极长夜痛切心</p><p>我身未脱诸有网无明之[谷-禾+卵]未出离</p><p>世尊慧[此/束]未啄破如何见舍疾涅槃</p><p>我如初生之婴儿失母不久必当死</p><p>世尊如何见放舍独出三界受安乐</p><p>我今<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>于世尊侍佛已来二十年</p><p>四威仪中多懈堕不能悦可大圣心</p><p>愿正觉尊大慈悲施我甘露令安乐</p><p>我愿穷尽未来际常觐世尊为侍者</p><p>唯愿世尊大慈光一切世界摄受我</p><p>痛哉痛哉不可说喑咽何能陈圣恩</p><p>尔时无数亿恒河沙菩萨。一切世间天人大众。互相执手悲泣流泪。哀不自胜各相裁抑。即皆自办无数微妙香花。曼陀罗花摩诃曼陀罗花。曼殊沙花摩诃曼殊沙花。无数天上人间海岸栴檀沉水。百千万种和香。无数香泥香水。宝盖宝幢宝幡真珠璎珞。遍满虚空。投如来前。悲哀供养。尔时拘尸城内男女大小一切人众悲哀流泪。各办无数微妙香花幡盖等倍胜于前。投如来所悲哀供养。尔时四天王。与诸天众悲哀流泪。各办无数香花一切供养等三倍于前。悲泣流泪来诣佛所。投如来前。悲哀供养五天。如是倍胜于前。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>诸天亦如是倍胜供养</p><p>大般涅槃经后分卷上</p><p>大般涅槃经后分 卷下</p><p>大唐南海波淩国沙门若那跋陀罗译</p><p>机感茶毗品第三</p><p>尔时拘尸城内一切男女悲泣流泪。不知茶毗法则云何。问阿难言。如来涅槃如何法则可以茶毗。尔时帝释具陈上事而以答言。如佛所说依轮王法。尔时拘尸城内一切人民。悲泣流泪摠入城中。即作金棺七宝庄严。即办微妙无价白[叠*毛]千张。无数细软妙兜罗绵。办无数微妙栴檀沉水。百千万种和香香泥香水。一切缯盖幡花等。如云遍满在于空中积高须弥。既办已讫悲哀流泪。将至佛所投如来前。悲咽不胜而申供养。尔时拘尸城内一切人民及诸大众。重复悲哀哽咽流泪。复持无量香花幡盖一切供具。如云遍满空中。互相执手捶胸哽咽。涕泣盈目哀震大千。投如来前悲哀供养。尔时大众悲哽喑咽深重敬心。各以细妙白[叠*毛]障手。扶于如来入金棺中。注满香油棺门即闭。尔时拘尸城内一切士女贪福<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>相欲摄取如来功德。不令天人一切大众同举佛棺。即共详议遣四力士壮大无双。脱其所著璎珞衣服期心请举如来圣棺欲入城内。自申供养尽其神力都不能胜。尔时城内复遣八大力士。至圣棺所脱所著衣共擎佛棺。皆尽其神力都亦不得。拘尸城内复遣十六极大力士。来至棺所脱所著衣。共举佛棺亦不能胜。尔时楼逗语力士言。纵使尽城内人男女大小。举如来棺欲入城内亦不能得。何况汝等而能胜耶。汝等当请大众及诸天力助汝举棺乃得入城。楼逗所言未讫。尔时帝释即持微妙大七宝盖无数香花幢幡音乐。与诸天众悲泣流泪。垂在空中供养圣棺。至第六天及色界天。皆如帝释供养圣棺。尔时世尊大悲普覆。令诸世间得平等心得福无异。于娑罗林即自举棺。升虚空中高一多罗树。拘尸城内一切人民及诸世间人天大众。等共不得举佛圣棺。尔时帝释及诸天众。即持七宝大盖四柱宝台四面庄严。七宝璎珞垂虚空中覆佛圣棺。无数香花幢幡璎珞。音乐微妙杂彩空中供养。至第六天色界诸天。倍前帝释覆佛圣棺及申供养。尔时拘尸城内一切人民。见佛圣棺升在空中。捶胸大哭悲咽懊恼。尔时一切天人于大圣尊宝棺前路。遍散七宝真珠香花璎珞微妙杂彩缤纷如云。地及虚空悉皆遍满。哀泣流泪供养如来七宝灵棺。同声唱言。苦哉苦哉。我等无福。举佛圣棺遂不能得。我等孤露何有善根。尔时世尊大圣金棺。于娑罗林虚空之中。徐徐乘空从拘尸城西门而入。尔时拘尸城内一切士女。无数菩萨声闻天人大众。地及虚空悉皆遍满。随从如来大圣灵棺。互相执手号声大哭。捶胸叫唤喑咽流泪。各持无数香花宝幢幡盖。地及虚空悉皆遍满。悲号哀叹供养灵棺。其拘尸那城一面纵广四十八由旬。尔时如来七宝金棺。徐徐乘空从拘尸城东门而出。乘空右绕入城南门。渐渐空行从北门出。乘空左绕还从拘尸西门而入。如是展转绕三匝已。乘空徐徐还入西门。乘空而行从东门出。空行左绕入城北门。渐渐空行从南门出。乘空右绕还入西门。如是展转绕经四匝。如是左右绕拘尸城经于七匝</p><p>尔时七宝圣棺当入城时。一切大众悲号哽咽。各持无数微妙香木。栴檀沉水一切宝香。文理香洁普熏世界。复持无数宝幢幡盖香花璎珞。至茶毗所悲哀供养。尔时四天王及诸天众悲泣流泪。各持天上上妙栴檀沉水。表里香洁芬馥周遍。各五百根大如车轮。复持一切宝香宝幢宝盖妙花璎珞。至茶毗所悲哀供养。第二天各一千根。第三天各二千。第四天各三千。第五天各四千。第六天各五千。及幡花至茶毗所悲哀供养。尔时色界无色诸天惟有香花。至茶毗所悲哀供养。尔时一切世间大众。各持微妙栴檀沉水香花幡盖。至茶毗所悲哀供养。尔时楼逗。涕泣盈目哀悼无极。从诸天人乞妙香木栴檀沉水。足六千根。文理香洁芬馥周遍。至茶毗所悲哀供养。阿耨达池四面纵广二百由旬出四大河。佛初成道恒河北岸。一树栴檀随佛而生。大如车轮高七多罗树。香气普熏供养如来。其香树神与树俱生。常取此香供养于佛。佛入涅槃此一檀树即随佛灭。皮叶俱落神亦随死。有诸异神取此香树。送茶毗所悲哀供养。其地乃是三世诸佛茶毗之处。大觉世尊乘本愿力亦于是处茶毗。是处有诸往古诸佛无量宝塔。金刚不坏坚固之处。尔时如来大圣宝棺。渐渐空行至茶毗所。徐徐垂空下安七宝床上。其床一切众妙璎珞无价杂彩以为庄严。于是时顷复经七日。尔时拘尸城内一切士女。无数菩萨声闻三十三天一切大众。悲哀哽咽持诸幡盖宝幢香花。随从佛棺经于七日。以佛神力一切天人无饥渴想一无思食。唯见哀泣恋慕如来。既满七日大圣如来将欲出棺。尔时拘尸城内一切士女无数大众。复大哀泣震动世界。复持香花无数幢盖微妙天乐。投佛棺前哀咽供养。是时大众悲哽流泪。各以细微白[叠*毛]自障其手深重敬心。从宝棺中扶于如来紫磨黄金三十二相八十种好坚固不坏金刚之身。安详而出置七宝床</p><p>尔时大众重大悲哀。声震十方普佛世界。复持一切香花缯盖音乐深心供养。闷绝哽咽投如来前。是时大众复更悲咽盈目流泪。各持无数香水香泥。深重敬心从头至足。灌洗如来三十二相八十种好无量福德智慧庄严。金刚坚固紫磨黄金不坏色身。复洗宝棺微妙清净。既灌洗已。是时大众复大号哭悲哀哽咽。烧微妙香散七宝花。无数宝幢幡盖地及虚空悉皆遍满。悲哀号泣供养如来。是时大众咸哀喑咽。即持无数妙兜罗绵。从头至足缠裹如来金刚色身。既缠身已。复以上妙无价白[叠*毛]千张。于兜罗上次第相重缠如来身。缠身已讫。是时大众重大悲哀号哭闷绝。复持香花幡盖宝幢音乐哽咽供养。是时大众哀泣流泪深重敬心。各以白[叠*毛]障手喑咽悲哽。共扶如来入宝棺中。注满香油棺门寻闭。尔时大众重大悲哀声震世界。复持香花幡盖音乐。号恸悲泣供养宝棺。尔时一切大众所集微妙香木积高须弥。芬馥香气普薰世界。相重密次成大香楼。四面七宝庄严。幢盖幡花璎珞杂彩。遍空如云以为庄严。人天音乐悲哀供养。是时天人大众。将欲举棺置香楼上。复大悲哀捶胸大叫声震大千。复持幢盖香花音乐悲哀供养。是时大众哀悼悲结深重敬心。各以白[叠*毛]障手。共举如来大圣宝棺。置于庄严妙香楼上。复大号泣绝而复稣唱言。苦哉苦哉。何期孤露无有依恃。悲咽流泪。复散香花宝幢幡盖音乐杂彩。一切尽心悲哀供养。尔时如来大圣宝棺。既上微妙宝香楼已。将欲举火茶毗如来。是时大众复大号哭惊震大千。复更深重悲哀供养大圣宝棺及妙香楼。尔时一切大众哀泣盈目。各持七宝香烛大如车轮。焰彩光明遍照世界。一时大哭茶毗香楼。哀震大千一切世界。复以香花遍满供养。是时宝烛至香楼所自然殄灭。是时一切诸天。复持无上七宝大烛焰光普照。悲哀流泪投香楼所皆悉殄灭。尔时一切海神。持海中火七宝大烛无数光焰。投香楼所亦皆殄灭。是时大众。长时号哭一切供养。不知如来何缘未毕。投火香楼茶毗不燃。尔时世尊大悲普润。待<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>众来至乃燃。时大迦叶。与五百<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>在耆阇崛山。去拘尸城五十由旬。身心寂然入于三昧。于正受中倏尔心惊。举身战栗从定中出。见诸山地皆大震动。即知如来已入涅槃。告诸弟子。我佛大师入般涅槃。时经七日已入棺中。苦哉苦哉。应当疾往至如来所。恐已茶毗不得见佛三十二相八十种好真净色身。迦叶。以敬佛故不敢飞空往如来所。即将弟子寻路疾行。悲哀速往正满七日。至拘尸城城东路首。迦叶。遇见一<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>执一天花随路而来。迦叶问言。仁者何来。答曰。佛般涅槃我于茶毗所来。复问。此是何花。答言。于茶毗所得此天花。迦叶就乞。答言。不得。我期将归拟示六亲家中供养。迦叶。就借着其顶上便即闷绝。昏迷躄地喑咽悲哽。良久乃苏即自惟忖。于此号泣不见如来八十种好紫磨色身。何所追益。即与弟子疾共前进。至拘尸城北门而入。于其城中入一僧坊。见诸比丘丛聚一处。语迦叶言。汝等远来深劳苦耶。安坐待食。迦叶答言。我之大师已入涅槃。我有何情安此待食。诸比丘言。汝师是谁。答言。汝不知耶。哀哉痛苦。大觉世尊今已涅槃。比丘闻已各大欢喜而作是言。快哉快哉。如来在世禁制我等<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>严峻。我等甚不堪忍不能依行。今已涅槃严峻禁戒已应放舍。汝且待食。有何急耶。佛神力故掩诸天耳。及大迦叶诸弟子等皆悉不闻恶比丘语。唯有迦叶独自闻之。于是迦叶。即将弟子悲泣流泪疾往佛所。是时迦叶与诸弟子窃共思念。我等如何得诸供物。将至佛所供养如来。迦叶复言。我自生长在此城中。乞供养物亦应可得。将诸弟子即就城内次第告乞。得妙白[叠*毛]足满千张。复得无数妙兜罗绵。复得无量宝花香泥香水香油。宝幢幡盖音乐弦歌璎珞杂彩悉皆具足。迦叶与诸弟子悲哀流泪。即持疾往出城西门。尔时迦叶即闻茶毗之所一切大众悲咽号哭。共问帝释已供养讫。如何得火然此香楼茶毗如来。帝释答言。人众且待。摩诃迦叶即时而至。释言未讫一切大众正于哀中即见迦叶。与诸弟子寻路悲来。众即停哀便为开路。迦叶前进遥见佛棺。将诸弟子一时礼拜。号哭哽咽闷绝躄地。昏浊乱心良久乃醒。流泪不胜渐渐前行问大众言。如何得开大悲圣棺。大众答言。佛入涅槃已经二七。恐有损坏。如何得开。迦叶答言。如来之身金刚坚固。常乐我净不可沮坏。德香芬馥若栴檀山。作是语已涕泗交流至佛棺所。尔时如来大悲平等。为迦叶故棺自然开。白[叠*毛]千张及兜罗绵皆即解散。显出三十二相八十种好真金紫磨坚固色身。迦叶与诸弟子见已。闷绝躄地喑咽哀哽。良久乃苏涕泣盈目。与诸弟子徐上香楼近佛棺边。复更喑咽号哭悲哽。即以所得香花幡盖宝幢璎珞。音乐弦歌哀号供养。即以香泥香水灌洗如来金色之身。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>散花哀泣供养。灌洗已讫。迦叶与诸弟子。持其所得妙兜罗绵缠于如来紫磨色身。次以旧绵缠新绵上。兜罗缠已。复以所得白[叠*毛]千张。次第相重于兜罗上缠如来身。缠白[叠*毛]已复持旧[叠*毛]。着新[叠*毛]上次第相缠。总缠已讫。棺门即闭。七宝璎珞一切庄严。尔时迦叶复重悲哀。与诸弟子右绕七匝。盈目流泪长跪合掌。说偈哀叹</p><p>苦哉苦哉大圣尊我今荼毒苦切心</p><p>世尊灭度一何速大悲不能留待我</p><p>我于崛山禅定中遍观如来悉不见</p><p>又观见佛已涅槃倏尔心战大震惊</p><p>忽见闇云遍世界复睹山地大震动</p><p>即知如来已涅槃故我疾来已不见</p><p>世尊大悲不普我令我不见佛涅槃</p><p>不蒙一言相教告我今孤露何所依</p><p>世尊我今大痛苦情乱迷闷昏浊心</p><p>我今为礼世尊顶为复哀礼如来胸</p><p>为复敬礼大圣手为复悲礼如来腰</p><p>为复敬礼如来脐为复深心<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足</p><p>何苦不见佛涅槃惟愿示我敬礼处</p><p>如来在世众安乐今入涅槃皆大苦</p><p>哀哉哀哉深大苦大悲示教所礼处</p><p>尔时迦叶。哽咽悲哀说是偈已。世尊大悲即现二足千辐轮相。出于棺外回示迦叶。从千辐轮放千光明。遍照十方一切世界。尔时迦叶与诸弟子。见佛足已。一时礼拜千辐轮相。即更闷绝昏迷躄地。良久乃醒。与诸弟子哀号哽咽右绕七匝。绕七匝已复礼佛足。悲哀哭泣声震世界。复更说偈哀叹佛足</p><p>如来究竟大悲心平等慈光无二照</p><p>众生有感无不应示我二足千辐轮</p><p>我今深心归命礼千辐轮相二尊足</p><p>千辐轮中放千光遍照十方普佛刹</p><p>我今归依头面礼千辐轮相长光照</p><p>众生遇光皆解脱三涂八难皆离苦</p><p>我复归依头面礼轮光普救诸恶趣</p><p>世尊往昔无数劫为我等故修苦行</p><p>今<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>此金刚体足下由放千光明</p><p>悲哀稽首归命礼安于众生千辐轮</p><p>佛修众德为一切<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>树日降四魔</p><p>四魔降已伏外道众生因此得正见</p><p>稽首归依头面礼众生正见光明足</p><p>佛为一切真慈父足光平等度众生</p><p>我复归依头面礼平等离苦轮足光</p><p>我遇千辐光明足悲喜交流哀切心</p><p>我复悲哀头面礼有感千辐轮光相</p><p>稽首归依轮足光乘究竟乘出三界</p><p>敬礼天人归依足轮光普照三有苦</p><p>众生未得脱苦门皆悉归命轮光足</p><p>我等<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>未出离如何轮足见放舍</p><p>哀哉哀哉诸众生长夜莫睹轮足光</p><p>悔过世尊大慈悲示敬千辐轮光足</p><p>哀哉今遇轮光相自此当何复再睹</p><p>尔时迦叶与诸弟子说是偈已。复重闷绝昏迷躄地。良久渐醒。悲哀哽咽不能自裁。大觉世尊千辐轮相金刚双足。还自入棺封闭如故。尔时城内一切士女天人大众。见大迦叶复重号哭。捶胸大叫哀震大千无量世界。各将所持悲哽供养</p><p>尔时拘尸城内有四力士。璎珞严身持七宝炬。大如车轮焰光普照。以焚香楼茶毗如来。炬投香楼自然殄灭。迦叶告言。大圣宝棺三界之火所不能烧。何况汝力而能烧耶。城内复有八大力士。更持七宝大炬光焰。一切将投棺所亦皆殄灭。城内复有十六极大力士。各持七宝大炬来投香楼亦悉殄灭。城内复有三十六极大。力士各持七宝大炬来投亦皆殄灭</p><p>尔时迦叶告诸力士一切大众。汝等当知纵使一切天人所有炬火。不能茶毗如来宝棺。汝等不须劳苦强欲为作。尔时城内士女天人大众复重悲哀。各以所持号泣供养。一时礼拜右绕七匝。悲号大哭声震三千。尔时如来以大悲力。从心胸中火踊棺外。渐渐茶毗经于七日。焚妙香楼尔乃方尽。尔时城内士女天人大众。于七日间悲号哭泣哀声不断。各以所持供养不歇。尔时四天王各作是念。我以香水注火令灭。急收舍利天上供养。作是念已即持七宝金瓶盛满香水。复将须弥四埵四大香洁出甘乳树。树各千围高百由旬。随四天王同时而下至茶毗所。树流甘乳注写香瓶一时注火。注已火势转高都无灭也。尔时海神莎伽罗龙王及江神河神。见火不灭各作是念。我取香水注火令灭。急收舍利住处供养。作是念已。各持宝瓶盛取无量香水。至茶毗所一时注火。注已火势如故都亦不灭。尔时楼逗诸四天王及海神等。汝注香水令火灭者。可不欲取舍利还本所居而供养耶。答言。实尔。楼逗语四天王言。汝大贪心。汝居天上舍利随汝。若在天宫。地居之人如何得往而供养耶。复语海神。汝等住在大海江河。如来舍利汝收取者。地居之人如何得往而供养耶。尔时四天王即皆忏悔。悔已各还天宫。尔时大海江河神等。皆亦忏悔诚如圣言。悔已各还</p><p>大般涅槃经圣躯廓润品第四</p><p>尔时帝释。持七宝瓶及供养具至茶毗所。其火一时自然灭尽。帝释即开如来宝棺欲请佛牙。楼逗即问。汝何为耶。答言。欲请佛牙还天供养。楼逗言。莫辄自取。可待大众尔乃共分。释言。佛先与我一牙舍利。是以我来火即自灭。帝释说是语已即开宝棺。于佛口中右畔上颔取牙舍利。即还天上起塔供养。尔时有二捷疾罗刹。隐身随释。众皆不见。盗取一双<a href=\"/sheli/fo/36639.html\" class=\"keylink\" target=\"_blank\">佛牙舍利</a>。尔时城内一切士女一切大众。即一时来欲争舍利。楼逗告言。大众当知待且安详。如佛所说。应当<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>共分供养。尔时城内士女一切大众。不闻楼逗所言。乃各执持矛矟弓箭刀剑罥索一切战具。各自庄严欲取舍利。尔时城内人众即开佛棺。兜罗白[叠*毛]宛然不烧。大众见已复大号哭流泪盈目。各将所持悲哀供养。深心礼拜流泪长跪。同说偈赞</p><p>如来以大自在力于一切世得自在</p><p>大悲本愿处斯土周旋<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>度众生</p><p>无量智慧<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力出没生死无挂碍</p><p>能以一身为多身多身一身为无量</p><p>神变普应咸皆见<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>即现入涅槃</p><p>我等福尽无应缘故乃如来见放舍</p><p>佛于娑罗宝棺中大力士举皆不起</p><p>大悲之力自轻举升空高一多罗树</p><p>乘虚徐绕拘尸城七日大圣绕七匝</p><p>绕已自临茶毗所不共神力所施为</p><p>一切天人莫能测佛于大般涅槃中</p><p>金刚不坏力自在一切茶毗火不然</p><p>自于心中出慈火焚烧七日示现尽</p><p>人天不能灭此火如来大悲示应力</p><p>帝释来至火便灭妙兜罗绵缠<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a></p><p>大火焚烧都不燃白[叠*毛]随佛宝棺内</p><p>火中俨然而不烧方知如来自在力</p><p>于法自在为法王敬礼大悲三界尊</p><p>敬礼圣中无畏者敬礼普覆大慈力</p><p>敬礼神变自在者我等从今离世尊</p><p>没苦无能见救护哀哉哀哉大圣尊</p><p>方今长别何由见</p><p>尔时大众说是偈已。重复悲泣各以所持尽哀供养。尔时楼逗普为天人一切大众。与城内人共于棺所。徐举白[叠*毛]及兜罗绵。其迦叶等白[叠*毛]千张火全不烧。其城内人白[叠*毛]千张。除外一重余者灰烬。其兜罗绵宛然如故。尔时楼逗取此白[叠*毛]及兜罗绵细破分之。与诸大众令起宝塔而供养之。楼逗复取[叠*毛]灰亦细分众。令起宝塔而供养之。其余烬灰无复得分。众各自取起塔供养。其城内人先已遣匠。造八金坛八师子座。各以七宝而为庄严。其七宝坛各受一斛。各置七宝师子座上。其八师子七宝之座。座别各有三十二力士。各严七宝璎珞杂彩缠身。共举七宝八师子座。座上复各有八婇女。身严七宝璎珞杂彩持七宝坛。座上复各有八婇女。严身璎珞执七宝盖覆金坛上。座上复各有八婇女。身严璎珞持七宝剑卫七宝坛。座上复各有八婇女。身严璎珞执雉毛纛竖坛四面。座别各有无量人众。持妙音乐幢幡宝盖香花璎珞围绕供养。座各复有无量人众。各持弓箭矛矟罥索长钩一切战具而围绕之。从拘尸城前后围绕向茶毗所。其八师子七宝之座出城去后。城内人众即持无数香泥香水。寻力士后平治涂地作香泥路。广博严事向茶毗所。其路两边无数宝幢幡盖香花。真珠璎珞众妙杂彩。音乐弦歌严饰路边。俨然供养待大圣尊舍利而还。其诸力士持八师子七宝之座。围绕至茶毗所。即大哀泣号哭哽咽声震大千。各以所持深心供养</p><p>尔时世尊大悲力故。碎金刚体成末舍利。惟留四牙不可沮坏。尔时大众既见舍利复重悲哀。以其所持流泪供养。尔时楼逗。与城内人涕泣盈目收取舍利。着师子座七宝坛中。满八金坛舍利便尽。尔时一切天人大众。见佛舍利入金坛中。重更悲哭涕泣流泪。各将所持深心供养。尔时城内诸大力士及诸士女。将欲持佛舍利金坛向拘尸城。尔时大众复重悲哀。各将所持流泪供养。尔时城内诸大力士及围绕众并城内人悲咽流泪。举八师子七宝之座。随香泥路<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>拘尸。尔时一切人天大众。复大悲哀声震世界。各将所持随从舍利哀号供养。如来舍利至城内已置四衢道中。尔时拘尸城人。即严四兵无数军众。身着甲铠各执战具。绕拘尸城四面周匝。无数重兵俨然而住。拟防外人来抄掠故。虽为仪式无战诤心。复有五百大咒术师。守城四门。为遮难故。复有无数宝幢幡盖。微妙庄严大雉毛纛。于城四维俨然供养。为标式故。尔时城内一切士女天人大众。复大悲哀。各将所持深心供养。其舍利坛置师子座经于七日。于七日中一切大众。日夜悲号哀声不断。尽以所持深心供养。其八师子七宝之座。各有五百大咒术师各共持之。遮有天龙夜叉神鬼来欺夺故。经七日间。尔时如来本生眷属。迦毗罗国王诸释种等。佛神力故都不觉知佛入涅槃。佛涅槃后经三七日尔乃方知。时彼国王诸释种等。悲哭号泣即共疾来至拘尸城。见诸兵众无数千人围绕城外。复见宝幢幡盖列城四维映蔽国界。复见大咒术师守城四门。王及释等问咒师言。佛涅槃耶。答云。佛涅槃来过四七日。茶毗已竟将分舍利。王言。我等是佛所生眷属。佛神力故令我不知如来涅槃。我今欲见如来舍利。卿可开路令我得入。咒师兵众闻是语已即听入城。王及释种得入城已。见佛舍利在师子座。悲号哽咽涕泪交流右绕七匝。绕七匝已收泪而言。我今欲请如来舍利一分将还供养。大众答曰。虽知汝是释种眷属。然佛世尊先已有言。分布舍利未见及汝。各有请主。汝如何得汝可还耶。尔时王及释种不果所请。号哭悲哀闷绝躄地。良久乃醒。悲不自胜。语众人言。如来世尊是我释种。愍汝等故于此涅槃。汝等如何见有欺忽。乃不分我一分舍利。作是语讫。各礼舍利。右绕七匝悲泣流泪。生忿恨心慨悼还家</p><p>尔时摩迦陀主阿阇世王。害父王已。深生悔恨身生恶疮。既遇世尊月爱光触身疮渐愈。来诣佛所求哀忏悔。世尊大悲。即以甘露微妙法药洗荡身疮。极重罪灭即还本宫。都不觉知如来涅槃。于涅槃夜梦见月落日从地出。星宿云雨缤纷而陨。复有烟气从地而出。见七彗星现于天上。复梦天上有大火聚遍空炽然一时堕地。梦已寻觉心大惊战。即召诸臣。具陈斯梦。此何祥耶。臣答王言。是佛涅槃不祥之相。佛灭度后。三界众生六道有识。烦恼横起。故现大火从天落地。佛入灭度月爱慈光慧云普润。悉皆灭没即云月落。星落地者。佛涅槃后。八万律仪一切戒法。众生违反不依佛教。乃行邪法堕于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。日出地者。佛涅槃后三涂恶道苦聚日光出现世间。故感斯梦。王闻是语。将诸臣从夜半即来至拘尸城。见诸无数四兵之众。防卫拘尸无量重数。复见城门有咒术师防止外难。王见是已即问咒师。佛涅槃耶。咒师答言。佛涅槃来已经四七。当今大众将分舍利。王言。佛入涅槃我都不知。我于夜梦见不祥事。以问诸臣。方知如来入大涅槃。我欲入城礼拜如来金刚舍利。汝为通路。咒师闻已即听前入。王至城内四衢道中。见师子座舍利金坛。复睹大众悲哀供养。王与徒众一时礼拜悲泣流泪。右绕七匝哀惨供养。尔时王就大众。请求如来一分舍利还国供养。大众答言。何晚至耶。佛已先说分布方法。舍利皆已各有所请。无有仁分。仁可还宫。阿阇世王不果所请。愁忧不乐即礼舍利惆怅而还</p><p>尔时毗离外道名王。佛涅槃后经三七已尔乃方知。即将臣从疾往拘尸。既至拘尸即见无数四兵之众。防卫拘尸绕无量重。尔时阿勒伽罗王。佛涅槃后经三七已尔乃方知。即将臣从疾往拘尸。既至拘尸即见无数四兵之众。防卫拘尸绕无量重。尔时毗耨队不畏王。佛入涅槃经三七已尔乃方知。尔时遮罗伽罗国王。佛入涅槃经三七已尔乃方知。尔时师伽那王。佛入涅槃经三七已尔乃方知。尔时波肩罗外道名王。佛入涅槃经三七已尔乃方知。即将臣从疾往拘尸。既至拘尸即见无数四兵之众。防卫拘尸绕无量重。复见城门有大咒师防止外难。王问咒师。佛涅槃耶。答言。佛涅槃来已经四七。当今大众将分舍利。王语咒师。佛入涅槃我都不知。故今晚至。我欲入城礼拜供养如来舍利。汝可开路。咒师闻已即听前入。至四衢道见师子座七宝庄严。安置七宝舍利金坛。复见大众悲哀供养。王将从众一时礼拜悲哀流泪。右绕七匝各以所持凄惨供养。王语众言。佛入涅槃我都不知。一何苦哉。不得见佛。请众与我一分舍利还国供养。众言。汝何来晚。佛已先说分布法轨。舍利皆已各有所请。无有仁分。仁可还宫。王及臣众不果所请。愁忧不乐。即礼舍利悲恋而还。尔时诸菩萨及声闻众。天人龙鬼国王长者大臣人民。一切大众悲号涕泣捶胸大哭。五体投地作礼而去。</p></div>"
}]