[
    {
        "title": "佛遗教经译文",
        "author": "鸠摩罗什",
        "date": "2014-03-12",
        "html": "<div class=\"B1_text\"><p style=\"text-align: center;\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0123/20160123053019444.jpg\" style=\"width: 200px; height: 230px;\" /></p><p>　　<strong><a href=\"/fojing/foyijiaojing/yuanwen.html\" class=\"keylink\" target=\"_blank\">佛遗教经</a>译文</strong></p><p>　　<strong>姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</strong></p><p>　　<strong>中华习教<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>超然  白话</strong></p><p>　　<strong>沙 门  来华  白话证义</strong></p><p>　　释迦牟尼佛，从最初转法轮，度化阿若憍陈如等五<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>阿罗汉果；直到最后一次<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，度化须跋陀罗，证得阿罗汉果。所应当度化的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，都已经度化完毕。于是，来到娑罗双树之间休息，准备进入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。这一天的半夜，周围寂静无声，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>最后一次，为自己的弟子们，简略地讲说<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的要点。</p><p>　　各位比丘，在我灭度以后，你们应当无比尊重恭敬波罗提木叉（戒）。就如同在黑暗当中，遇到了光明；如同贫苦的人，得到了宝藏一样。应当知道，它就是你们可以依赖的大师。倘若我继续留在人<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>，和它也没有什么两样。</p><p>　　作为持守清净<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>的人，不可以从事贩卖和贸易；不可以安排置办田地和屋宅；不可以蓄养家奴和动物；乃至于一切种植，以及积蓄财宝等过失，都应当远离，就如同躲避火坑一样。不可以砍伐草木，和开垦土地。</p><p>　　不可以通过配药看病来谋生；不可以看相<a href=\"/remen/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>；不可以观察天象，推测地气<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>等等；乃至于用一切历算等方法，来预言未来的事情，都不应该。</p><p>　　应当节制身体的欲望，<a href=\"/remen/guowubushi.html\" class=\"keylink\" target=\"_blank\">过午不食</a>；依赖清净的乞食和<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>而<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>。不可以参与世间的国事，或者充当敌对双方的使者；不可以习练鬼神咒术和炼制仙丹妙药；不可以结交攀附权贵富人，乃至于嫌贫爱富等等，都不应当。应当端正自己的心念，一心一意向往<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。不可以故意隐藏自己的缺点，故意显露一些灵异，来迷惑吸引大家。对于饮食、衣服、卧具、汤药等四种供养，要适可而止，知量知足。随着缘分接受供养，不应当特意积蓄。</p><p>　　以上是简略地总说持戒的基本要求。戒律是走向真正解脱的根本，所以叫做波罗提木叉。依赖于持戒的缘故，才能够生起<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，以及灭除苦恼的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。因此，诸位比丘应当守持清净戒律，不要让它毁坏和缺少。倘若有人能够守戒清净，就可以具备各种善行和善法；倘若没有清净持戒，一切善妙<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，都无法产生。所以，应当知道，戒律是最了不起的安乐和功德，常驻的地方。</p><p>　　各位比丘，在持戒的基础上，你们应当管好自己的眼、耳、鼻、舌、身等五根，千万不要让它们自由放纵，陷入色、声、香、味、触等五欲当中。就好比放牛的人，手拿鞭子看着它，不让牛自由放纵，去破坏人家的庄稼。倘若放纵五根的话，不仅仅将会导致五欲泛滥得无边无际，没有办法制约；而且将会如同一匹烈马，缺少了缰绳一样，会把人驮着，掉到坑坎当中。又比如被强盗抢劫了，所带来的损失和苦难，最多只有这一生；而五根之贼所带来的灾祸，将会使<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>生世世都遭殃。它的危害非常严重，不可以不格外谨慎。</p><p>　　因此，有智慧的人，都常常制约五根，而不会随着它转。防备它就像防贼一样，不让它自由放纵。假使让它放纵的话，不久就会见到它所带来的危害。</p><p>　　这所谓的五根啊，心是它们的主人。因此，你们大家应当好好制约这个心。心的可怕之处，远远超过了毒蛇、凶恶的野兽、仇家和盗贼，乃至于漫天大火，都不足以形容它的可怕。就好比一个人，手里端着一碗甜美的蜂蜜走在路上，高兴得手舞足蹈一样；他的眼里只有蜂蜜，对于前面的深坑却视而不见。</p><p>　　又好比一头疯狂的大象，却连惩治它的铁钩都没有；也恰似猿猴回到了树上，翻飞跳跃，简直没有办法约束。所以要立即采取措施，制服它，绝不能让它继续自由放纵。放纵这个心的人，一切善行都将前功尽弃；把心专注在一个地方的话，没有什么事情办不成。所以，各位比丘们，应当恒常<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>，降伏自己的心。</p><p>　　各位比丘，你们在接受饮食供养的时候，应当像吃药治病一样。对于好吃的，不应当多吃；对于不好吃的，也不应当少吃。吃饭的目的在于给身体补充能量，消除饥饿口渴之病。就如同蜜蜂采花蜜一样，只是取走了花的甜味，并不损伤花朵和花香。比丘也是这样的，接受大家的供养，目的在于有精力断除自己的<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。所以不应当过多索求，以免伤害别人的<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。就好比一个有智慧的人，能够恰当地衡量牛的体力多少，不让它过多劳动，以免精疲力竭。</p><p>　　各位比丘，你们在白天，应当用心勤奋地修学各种善法，不要让大好光阴白白浪费。上半夜和下半夜，也不要荒废。午夜前后，念诵经文，以便消除困倦，息灭<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。不要因为睡眠的缘故，让这一生白白空过，什么成就都没有得到。</p><p>　　应当时常观察，<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>的大火，正在焚烧着世间的一切，所以应当尽早求得自己的解脱，不要懒散睡眠啊！各种各样的烦恼贼寇们，一直守候在我们的身边，伺机夺走人们的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。它们比仇家更可怕啊！怎么可以随便睡眠，而不赶快警惕和醒悟呢？烦恼的毒蛇，正沉睡在你的心里面；就好比一条黑蚖毒蛇，正睡在你的卧室里。应当用精进持戒这个铁钩，尽早把它们扔出去。睡在心里的烦恼毒蛇们走了以后，才可以安心睡眠；烦恼毒蛇还没走，就去睡眠，是没有惭愧的人。</p><p>　　惭愧知耻这件衣服，在所有的美好装扮当中，是最了不起的。惭愧就如同一把铁钩，能够制止人们做非法的事情。所以，应当随时保持惭愧知耻的心，一会儿也不要丢失。倘若离开了惭愧和知耻，就会失去种种功德。拥有惭愧的人，就会拥有各种善行和善法；倘若没有惭愧的话，和那些禽兽就没有什么差别了。</p><p>　　各位比丘，倘若有人来伤害你们，甚至把你们的身体一节一节地破坏；你们应当守护好自己的心，不要让它产生愤怒和怨恨。还应当守护好自己的嘴巴，不要让它发出凶恶难听的话。倘若放纵自己那个忿恨之心的话，就会妨碍自己的<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>，失去各种功德的利益。</p><p>　　忍辱的功德啊，连持戒和苦行都比不上。能够做到忍辱的人，才可以叫做有力的菩萨大人。倘若不能够，像饮用甜美的<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>一样，去<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地忍受恶毒的辱骂；就不能叫做已经入道的，有智慧的人。为什么呢？因为嗔恚的害处之大，能够破坏一切善法；也会破坏好的名声，让这一生和下一生所遇到的人们，都不喜欢见到他。</p><p>　　应当知道，嗔恚忿恨之心，比大火还要猛烈。所以应当坚持进行防护，不要让它趁机会进入到心里面。抢劫各种功德的贼寇，莫过于嗔恚。在家人，整天沉迷于五欲当中，不是<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的人，没有办法控制自己，产生了嗔恚心，情有可原。作为<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>了欲望，<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>修道的人，却在心里怀有嗔恚和忿恨，就太不应该了。好比一片清凉的白云当中，却忽然打起了霹雳闪电，是完全不应该出现的。</p><p>　　各位比丘，应当经常摸一下自己的头，提醒自己：我已经舍弃了社会上那些漂亮的装饰，穿上了出家人朴素的染色衣；手持着应量器——钵，通过乞食，来维持自己的生活。这样自己观察以后，一旦发现心中生起了骄傲和我慢之心，就应当迅速地消灭它。增长自己的骄慢心，即使是世俗的普通人也不应该。更何况出家修行，想要入道的人，为了彻底解脱的缘故，而放下面子去乞食呢？</p><p>　　各位比丘，心口不一的谄曲之心，与<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>之道背道而驰。因此，应当让自己的心坦荡正直。要知道，谄曲心属于欺骗的范围，倘若这样也能入道的话，根本没有这样的道理。所以，你们大家，应当端正自己的心念，以正直为根本。</p><p>　　各位比丘，应当知道，欲望多的人，往往因为贪求利益的缘故，带来的苦恼也非常多。欲望少的人，常常无欲无求，就没有这个问题了。单单少欲这个法门，尚且应当修习，更何况，少欲还能够产生种种功德呢？</p><p>　　欲望少的人，就不需要通过谄曲，来奉承别人，也不会被六根境界所束缚。能够实践少欲的人，他的心就会坦然无求，没有什么好害怕的；为人处事当中，到处游刃有余，总觉得没有什么不满足的。拥有少欲的人，就会拥有涅槃。这就叫做少欲。</p><p>　　各位比丘，倘若想要解脱一切苦恼的话，应当时常观察知足法门。因为知足这个法门啊，它就是<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>、快乐、安详和稳妥所在的地方。作为知足的人，即使躺在地上，他也觉得平安和快乐；而那些不知足的人，即使置身于天堂之中，他也觉得不能称心如意。那些不知足的人啊，即使富有，也是贫穷；而知足的人呢，即使贫穷，也是富有。那些不知足的人，经常被色、声、香、味、触等五欲，所牵挂而不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，经常让知足的人们感到可怜和同情。这就是知足。</p><p>　　各位比丘，如果想要得到寂静法性当中，那种自在无为的安乐，就应当远离杂乱的愦闹，一个人独处闲居。要知道，那些安静独处的人，连忉利天的帝释天王等很多天神，都会对他恭敬和尊重。因此，应当舍弃自己的弟子和眷属，以及其他有缘的人们。一个人闲下来，不要做什么，独自静处，专心思维观察，以便消灭烦恼和苦的根本。倘若喜欢和大家在一起凑热闹的人，就会受到别人带来的各种干扰和烦恼。就好比一棵大树，很多很多的鸟儿都在上面集会，就会有逐渐枯萎或者折断的危险。大家要知道，人世间的种种贪欲和束缚，会让人们永远沉没于<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>当中。（所以，大家应当学会远离。）否则，就好比一头年老的大象，如果陷入了泥潭当中的话，就没有办法自己出来了。这就叫做远离。</p><p>　　各位比丘，倘若能够恒常精进的话，就没有什么困难的事情了。所以，你们大家，应当勤奋精进。就好比一条细小的水流，如果长流不断的话，就能够穿透石头。倘若一个修行人，他的心每每放松<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>的话；那就好比钻木取火的时候，木头还没有发热，就停下来了一样，虽然也想得到火，却是不可能的。（因此，大家千万不要松懈。）这就叫做精进。</p><p>　　各位比丘，与其到处去寻求善知识，去寻求好的助缘，还不如不要忘失<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。倘若有能够不忘失正念的人，一切烦恼的盗贼，就无法进入他的心中。所以，你们大家，应当经常把心里的念头收摄住。倘若失去了对于念头的守护，也就会失去种种功德。倘若正念力量坚强的话，那么，即使进入到五欲盗贼的境界当中，也不会受到影响。这就好比披盔戴甲进入战场一样，就会无所畏惧。（所以，大家应当时常守护自己的念头。）这就叫做不忘念。</p><p>　　各位比丘，倘若大家能够收摄心念的话，心就已经在禅定当中了。心在禅定当中的缘故，就自然能够知道世间万法随着<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而生灭的状况。所以，你们大家，应当经常勤奋精进地修习各种禅定。倘若得到禅定以后，心就不会再散乱了。就好比珍惜用水的<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>，往往善于建造并且保养水塘和堤坝；修行人也是这样的，为了保护智慧之水的缘故，而善于勤奋地修习禅定，使智慧之水不会漏失。这就叫做禅定。</p><p>　　各位比丘，倘若有了智慧的话，就不会再有贪婪和执着。如果能够经常自己反省观察，不让智慧心丢失；像这样的人，在我的教法当中，一定能够得到解脱。倘若不这样的话，那就既不是修道的人，也不是普通在家人，真不知道叫他什么才好。</p><p>　　真实的智慧，就是度过这个生老病死大海最坚固的船啊！也是无明黑暗当中的大光明之灯啊！是一切病人最好的药啊！是砍伐烦恼大树的锋利斧头啊！所以，你们大家，应当通过对于经教的<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>，让它自然增长。倘若一个人，拥有智慧光明的话；他虽然没有天眼通，却是一个真正的明见法性的人啊！这就叫做智慧。</p><p>　　各位比丘，倘若有人沉湎于各种各样的杂话戏论当中，他的心就会变得混乱。虽然他好像也在出家修行，却总是无法解脱。所以，比丘们应当立即舍弃并且远离，杂乱心和戏论。倘若你们想要得到真常寂灭的究竟快乐的话，只有赶快想办法消灭戏论之病。这就叫做不戏论。</p><p>　　各位比丘，你们对于各种功德法门，应当经常一心一意地去修学。舍弃种种懒散放逸，就如同远离仇怨和盗贼一样。大慈大悲的世尊，所讲说的利益<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的教法，都已经究竟<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。你们大家只需要勤奋地去实践它。或者在山林之内，或者在水乡当中；或者在大树下面，或者在安静的房间里。时常想念自己所学的法门，千万不要让它丢失。应当经常勉励自己，坚持精进地修学。不要因为空度时光，到了临死的时候，导致后悔。我就像一位高明的医生，因为知道大家是什么病，才给与合适的药方。但是，你们吃不吃药，就不是医生的责任了。又如同一位高明的向导，总是把最合适的道路指给人们。如果有的人听了以后，却不肯走的话，就不是向导的责任了。</p><p>　　你们大家，如果对于苦集灭道<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>有所疑惑的话，可以赶快提问，千万不要把疑惑藏在心里，而不去解决它。当时，世尊像这样大声说了三遍，却没有任何人提问。为什么呢？因为在座的大众们没有任何疑惑。</p><p>　　这时，天眼第一的阿那律尊者，在观察了大家的心念以后，恭敬地向佛说道：世尊，纵然可以让月亮变热，让太阳变冷；<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>所说的四谛法门，也不会有任何改变。您所说的苦谛，真正是苦，没有办法变成快乐；烦恼习气的汇集是苦的真正原因，再没有什么其它的原因；倘若想要消灭苦，就必须要消灭苦的因，苦因灭了，苦果也就灭了；这个灭苦的修行之道，是最真实的道，再也没有其它的道了。世尊，在座的众位比丘们，对于四谛法门，已经决定相信，没有任何疑惑。</p><p>　　在座的大众当中，如果是尚未完成解脱的弟子们，见到佛陀灭度，就会有悲伤的感受。如果是刚刚进入<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>的弟子们，听到佛陀最后所宣说的妙法，就都可以走上解脱之路。好比一个人走夜路的时候，忽然见到了闪电的光明，于是就看见了前方的道路。如果是已经完成了解脱，已经度过了<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>苦海的弟子们，只是会起这样一个念头：世尊灭度得这样快啊！</p><p>　　虽然阿那律尊者代表大家做了这样的回答，表明在座的大众，都已经明白了<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>的法义。但是，世尊为了让大家都得到坚固的信解，以大慈大悲之心，再次为大众们讲说：各位比丘，不要怀有悲伤和忧愁的情绪，即使我能够在这个世界上停留一大劫，最终还是要入灭的。大家相会在一起，永远也不再分离，终究是不可能的。只要大家能够奉行自利利他，一切法就都已经圆满具备了。倘若我长久住世的话，也不会再有什么更多的利益。应当度化的人，无论天上还是人间，都已经度化完毕；那些尚未得度的人，也都已经为他们铺垫好了将来解脱的因缘。</p><p>　　从今以后，我的一切弟子们，代代相传，各自修行，这就是如来法身常在世间，不会毁灭的表现啊！所以，大家应当知道，世间的一切都是生灭无常的。有相会，就必定会有分离。大家不要忧伤懊恼，世间万象都是如此。而应当勤奋精进，争取早日求得解脱。用智慧的光明，去消灭所有的愚痴黑暗。这个世界到处都是危机和脆弱，没有什么东西是坚固不坏的。我如今得以灭度，就如同消除了一个恶毒的疾病。这个东西本来就是应当舍弃的，它充满了<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>，给它一个虚假的名字，叫做身体罢了。正是因为它，才沉没在生老病死的大海当中。哪里会有一个充满智慧的人，能够消灭它，如同杀掉仇家和盗贼一样，却反而会不欢喜呢？</p><p>　　各位比丘，大家应当经常一心一意地勤奋求学出世之道。要知道，世间的一切看似变动，或者看似不变动的万事万物，其本质都是在逐渐衰败和毁坏的。你们大家停止提问吧，也不要再说话了。适合涅槃的时间即将过去，我这就入灭。这些内容，是我对你们最后的教诲。</p></div>"
    }
]