[
    {
        "title": "心经全文解释，般若波罗蜜多心经白话文解释",
        "author": "唐三藏 玄奘法师",
        "date": "2014-02-17",
        "html": "<div class=\"B1_text\"><h2><a href=\"/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">般若波罗蜜多心经</a>白话文</h2><h3>　　《<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜多<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>》原文</h3><p>　　般若波罗蜜多心经，梵文prajnaparamitahrdayasutra。略称《般若心经》或《心经》。全经只有一卷,260字.属于《大品般若经》中600卷中的一节。被认为是般若经类的提要。该经曾有过七种汉译本。较为有名的是后秦鸠摩罗什所译的《摩诃般若波罗蜜大明咒经》和唐朝玄奘所译的《般若波罗蜜多心经》。</p><p>　　《般若经》共有八部：《放光般若》、《光明般若》、《道行般若》、《胜天般若》、《胜天王般若》、《文殊问般若》、《金刚般若》、《大品般若》、《小品般若》。本处所用的《般若波罗蜜多心经》则由浅入深地全部概括了《大品般若》的义理精要。可谓言简而义丰，词寡而旨深。古来认为读此经可以了解般若经类的基本精神。</p><p>　　此处的\"般若\"，为梵语prajna音译，本义为\"<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>\"。但这智慧是指<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>的\"妙智妙慧\"。它是一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>本心所具有的。有色能见，无色也能见；有声能闻，无声也能闻。它能产生一切善法。至于凡夫的\"智慧\"，则由外物所引生，必须先有色与声，才会有能见和能闻。若无色与声，即不能见不能闻，它不能直接生出善法。因而我们说，凡夫的\"智慧\"，在佛家看来，也就成了愚痴，成了<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。\"般若\"如灯，能照亮一切，能达一切，度化佛所指斥的那种有漏的\"分别慧\"。</p><p>　　“波罗蜜多”，梵文为paramita，意为\"度\"，\"到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>\"。亦即意在说明\"度<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>，到<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>彼岸\"。所谓\"彼岸\"是对于\"此岸\"而言的。生死便喻\"此岸\"。它指<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>内的众生由于<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>邪心而造业，因而不得不<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>于生生死死当中，永住于<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>苦海中。只有<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>才能摆脱轮回，永超生死地。</p><p>　　“三界”，指欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>，共有二十八重天。下面六重为欲界。所谓\"欲\"，指的是男女、饮食、睡眠三者。中间的十八重为色界，居于此界当中者已经离于三欲，但又保存了\"质碍色身\"，仍然离不开物质元素。是中众生，虽然有<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>等，但已经不必非有\"物质基础\"了。至于那上面的四层属于无色界。居于此界的众生则没有形色，他们已经修成了\"空\"与\"定\"。较之此一境界更高的则是所谓\"涅槃\"。就佛教说，可以认为涅槃境界是一种比喻的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，它仅指超出生死轮回<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>，摆脱<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>有限性和相对性。以传统说法，指的是因<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>而超出三界的<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，他已经处于一种不生不灭的状态，获得了不受垢染，永远安乐的寂灭之体。</p><p>　　凡任何修习佛教的人，按照经往的讲法，只要依法<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，就可以度脱生死苦恼，到达涅槃彼岸。一般认为，修习般若波罗蜜多法门属于六种\"到彼岸\"的法门之一，又称为\"<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>\"，具体说，这也就是<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>修习的基本内容。它包括：一、<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>（檀那）；二、持戒（尸罗）；三、忍（羼提）；四、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>（毗梨耶）；五、定（禅那）；六、智慧（般若）。《大品般若经》卷一说：\"菩萨摩诃萨以不住法住般若波罗蜜中；以无所舍法应具足檀那波罗蜜，施者受者及财物不可得故；罪不罪不可得故，应具足尸波罗蜜；身心精进不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>故，应具足禅那波罗蜜；于一切法不著故，应具足般若波罗蜜。\"<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>宗将<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>的\"智慧\"扩展为\"方便善巧\"、\"愿\"、\"力\"、\"智\"等四波罗蜜，合称\"十波罗蜜\"，作为菩萨\"胜行\"，以配合菩萨十地，说明修行的次第。这是题外的话了。总之，这六法门又可以喻之为船筏，它们运载修善众生过渡到彼岸去。六度之中，又特别以般若波罗蜜多为最上法门。即是说，一旦深入般若甚深法门，便可以随机而有布施、持戒、忍辱、精进、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>的诸度<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。</p><p>　　\"心经\"的\"心\"，意为\"核心\"、\"纲要\"、\"精华\"，言下之意是说，此经集合了六百卷般若大经的\"精要\"而成。</p><h3>　　唐<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘译</h3><p>　　[三藏法师玄奘，所谓\"三藏\"，即指<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>、<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>、论藏三者。经与律记录了释迦牟尼所说的大法，经为佛教真理的显示，律为佛教的禁则及规矩，而论藏是佛和<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们讲论其教义的记录，三藏的内容包含了戒、定、慧三学。\"三藏法师\"，意谓其通晓三藏教法，自己修法而得利益，又令人修行而得实在受用，所以堪为人师。玄奘为唐代僧人，俗姓陈祎，河南洛阳偃师人，幼年家贫，十三岁<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，十五岁已因聪慧而闻名，二十一岁受<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>，此前已经博通经论。唐太宗贞观三年（629）长安因发生饥荒，朝廷许百姓出城就食，他就趁机潜往西域，传说到罽宾国是道路更为险恶，虎豹横行，他只得在一洞内<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>，天快亮时，见一老僧，头面疮痍，身被脓血，盘脚<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>。玄奘上前施礼求问，老僧即授之以此心经一卷，说一旦朗诵则山川平易，虎豹不能为害，鬼魅不能作祟，于是玄奘继续往西前行，最终到达中印度的摩揭陀国王舍城，在当时东方最负胜名的那烂陀寺广<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>教经论，成为了中外称誉的\"大乘天\"。玄奘回国时，带回了大小乘经律论共500多帙，600余部。其中便有这部《心经》。他晚年主要住持长安宏福寺，主要从事译经。65岁时寂化，葬于白鹿原。若无玄奘法师，作为末世众生的我们，如何能够沫浴<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>的法恩呢？！回心经正文</p><h3>　　观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨</h3><p>　　观自在菩萨，\"观\"作\"观照\"、\"审视\"、\"审察\"等解。此处并非指用眼作观察，而是以心去\"审视\"，以心去调动眼、耳、鼻、舌、身、意六根，取其妙用。\"自\"，作\"自己\"讲；\"在\"，即\"存在\"。\"菩萨\"是bodhisattva的音译。意为\"觉有情\"、\"道众生\"，汉译又作\"开士\"、\"大\"、\"觉士\"等。有<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>觉他，导引众生开悟的意义。据大乘佛教，菩萨可以有在家与出家两种。菩萨有两种身，一为生死肉身，一为法性生身。三贤位之菩萨，若未证法性，仍有惑业，受三界生死分段身者为前者；<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无生法忍性，舍离三界生死肉身，得不生不死位。菩萨又有的称为\"菩萨摩诃萨\"，直译为\"大觉有情\"、\"大众生\"。\"摩诃\"，意为\"大\"；\"萨\"为\"萨埵\"的略音。\"萨埵\"，意为\"有情\"或\"众生\"。摩诃萨指有大心，能救度极多众生，使之得度脱生死的菩萨。《大智度论》说，此种人心能为大事，其智能得大理；因勤修六度大行及一切大善，能修难修，能舍难舍，能忍难忍；经三大阿僧祗劫而<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>不退；唯以阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>为所求目标。</p><p>　　观自在菩萨，合起来说，就是能观照自心，不为世间或出世间的万物所动，心中常能住寂，又能慧天悯人，以大觉有情为己任，自己已经得到<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>无碍，并能使他人也得解脱无碍自在。观自在菩萨，又称作\"<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>\"，梵文则为avalokiteshvara。</p><h3>　　行深般若波罗蜜多时</h3><p>　　行深般若波罗蜜多时，\"行\"，此处作\"功行\"解；\"深\"，则释为有极深的修行功夫，已达到甚深境界。说到这种功夫，是一步一步由浅而深地达到的；先是初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>，行观照审察，这就要求自心常在，要扫除妄念，专住佛境，眼只见佛色；耳只闻佛声；身只对佛境，这样才能发见真心。但这也只是浅近功夫，进一步则要求在心得自然之后，又能在无意中作意念守持，不为外界所牵动。知道所谓心想，无非是妄想攀缘影子。无论是能知所知，都在根本上是不存在的，从其本性来说，它们既是空是假，又非空非假，是有是无，又非有非无。若能到此，可以说已经达到空境了，但犹未达到\"空心\"；再进一步扫除妄情，观照现前的身心世界，一眼看透，一切意念也无非自心所现，浮光掠影，也如镜中像，如水中月，一切声响，如风之过树，一切境界，如云在空中，都是幻化不实的。不仅外面的世界如此，内心的妄情何尝不是如此呢？一切爱恨种子、习气烦恼也都是幻化不实的。于是起先要用意念来克服的心，现在就是不用心意守护也达到了空。一旦境也空，心也空，心境两忘，便升入了一个新的阶次。更进一步，连此境界也可以抛弃，便可以达到能空的心和所空的境都已经扬弃，这样的功夫达到纯熟而转深，再勇猛精进，便可以最终使一切人为的妄念消除，生出妙智妙慧，达于涅槃彼岸。\"处深般若波罗蜜多时\"，也即是得到妙观察智和无想慧的时候。</p><h3>　　照见<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>皆空</h3><p>　　照见五蕴皆空，\"照\"，光明所到，照耀；\"五蕴\"，梵文pancaskandha的意译，也称为\"五众\"、\"<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>\"，实指色蕴、受蕴、想蕴、行蕴、识蕴五者。\"蕴\"的意思是指\"蕴集\"、\"积聚\"。\"色\"指有形有相的事物。对于人的感觉来说，形质之色包括了地水火风等四大，一切有坚湿暖动性质的东西。人的身体称为\"色身\"。\"受\"作为\"领纳\"义解。即领纳感受种种境界；\"想\"是思想，由六根感触种种境界，心中思想种种相貌形状，这叫\"想蕴\"；\"行\"，即行为；\"识\"，指对所感觉的对象分别所起的认识作用。这句话的意思是说\"因修习了般若法门，功夫深久，生出了妙智妙慧，于黑暗中也有光明照耀，因则能够洞见一切诸法均为不实在，均为虚假。懂得了众生的五蕴对于菩萨的真心是有掩盖障蔽而使其昏昧的功能的。\"</p><h3>　　度一切苦厄</h3><p>　　苦厄，逼恼身心的苦恼灾厄。苦厄起于生死。生死因结聚五蕴而有，因之不能返观五蕴的虚假不真。由于认识有如是的错乱，难免受到<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>烦恼。痛苦烦恼不得清醒的认识，不免要起惑造业，结果便陷入了更深的魔道，因而轮回生死，现世执有五蕴，未来招致生死苦厄。如果能够了达，连五蕴都是虚假幻化的妄想，扫除一切魔缘，自然心中清净，生出智慧，也就可以度脱一切苦厄。这便是修行般若法所能达到的境界。</p><h3>　　<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a></h3><p>　　<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>子，即舍利弗，梵语shariputra（舍利弗怛罗）的音译略称。释迦牟尼佛的十大弟子之一，因其持戒多闻，敏捷智慧，善解<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，被称为\"智慧第一\"。此处称呼他的名字，因般若法门是大乘的真空妙理，最深最上，非具足大智大慧者不能享用。而舍利弗是智慧的象征，故佛在此称呼他，意在告示：般若波罗蜜多法门，非有深心智慧者而不能得入之。\t\t\t\t</p></div>"
    },
    {
        "title": "心经全文解释，般若波罗蜜多心经白话文解释",
        "author": "唐三藏 玄奘法师",
        "date": "2014-02-17",
        "html": "<div class=\"B1_text\"><h3>　　色不异空</h3><p>　　色不异空，\"色\"即形色，色身等。也可以说就是前面说到的一切有形有相的有质碍的东西，简言之，一切物质形态。\"空\"指<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，真空。\"空\"的意思并不是说没有色就是空，或者说\"色灭为空\"，不能说除掉了世间一切事物就可以达到空，因为\"空\"并不是空无所有，不是虚无。\"空\"是实相，实然之相，实然本体。空是绝对的相待性。而相待性是世界的真相，是它的依止。世间一切事物无不具有相待性，从这个意义上说，无不依止于相待性，离却相待，也就是离却了\"空\"，事物就会堕入虚无，堕入真正的无根无据无着落。正是从此意义上，才说\"空即是色\"，意思是：空与色本来就是不可以分析为二的。色身借四大和合而成，自体就是空，本来就含有相对性。不仅如此，世间的什么事物又不是假借<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而成的呢？就其相待性，依赖性而言，本来就是假，就是幻。而只是因为凡夫迷昧真性，以假为实，执色身为我所有，于是起惑造业，违背真心，贪恋物质利养，以为自己的一切可以安享百年而不坏，殊不知人生犹如风中的烛，犹如深秋枯树上的一片叶，不定何时就会熄灭，何时就会飘落，哪里能够自恃呢？我们由四大所成的身体，不过是假缘暂住，给人一种虚幻的实在性而已。究其实，物质之色先天性地包含着不稳定，包含着\"短命\"，所以说\"色即是空\"。此句既是佛祖广释般若法<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>的开端，更是佛教八万四千法门的要义。</p><h3>　　空不异色</h3><p>　　空不异色，真空与形色并没有什么区别。为什么这样说呢？以色执著为实有的，固然不应该；而将空执著为虚无的，同样也背离了释迦牟尼的教导。要知道，那怕凡夫的五蕴之身，也是业力所成，也是由于过去世的业力习气熏染才凝集而成。从因缘的角度，它不是无端呈现的，人生的内在依据便是佛所教诲的缘生之法院，世间一切事物无不处于前后无际的<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>系列当中。一切色质均是因缘凑合而成。这因缘凑合就是相待性，就是空性，因此才说空不异色。空不异色是要强调世间因果的实在性，是想说因缘<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>的真实不虚，是要说人类社会中的伦理<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>所赖以成立的基础，是不可以用空的理论来取消的。</p><p>　　简而言之，身由业力所造，业力由妄心所造，人若造业便会感受人生的苦果，以致受身出世而偿还果报的苦恼，今生受过去世的业报，未来世感受现世的苦果。三世之中，轮回<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>周而复始，除非修善根而超越，否则不会有了结之时。外道中人因为不了正因至理，远离妙智妙慧，错认为色若灭了便是空，落于顽空，认为人若死后，清气归天，浊气归地，一灵真性归于太虚空，于是追求清心寡欲，一味修持苦行。还有的人坚持断灭空的见解，认为人生既然终归是五蕴分离，便没有现世的道德可言，也没有未来的解脱可言，因而进一步便胡作非为，结果种下恶因，将来自己遭受恶果。</p><p>　　只有二乘声闻缘觉罗汉,依佛法修持,知见能够超出凡夫之外,得阿罗汉果位。他们知道三世因果道理,因而了解以色为实有是一种妄想,但仍未了解三界也是心中的幻现之法，不懂得万法无非识情变化而有，生死也是一种幻化，因而有的惧怕三界厌离生死，以为只要离开色就是真空，于是闭门独修，或在深山，或在坟冢，殚精竭虑，一定要离一切相，只为了求得解脱。结果忘了舍己救人一说，失却了众生同一本性，救他即是救己的真谛。他们把解脱也执为一种相，把空也执成一种相。所以仍然陷于幻妄之中。小乘得<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>者难免执相。相是什么呢？我们不妨称为\"相分\"之\"相\"。所谓相分，就是心中所生起的关于事物或者观念的心中之想，犹如人们所说的心念等。这种相分其实是心中幻化出来的。心中不著相，就不会有相分，一切境界也就了了可明，不会拘于形色而生惑。从而起心动念，无不符合自心本性，无不符合真空实相。这就是大乘菩萨的境地了。所以说，真空不是空，真有不是有。空不是色灭亡之后才有的，空与色本来无异，空是色的规定和依据。因而真空即是妙有。虚空是<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>的虚空。</p><h3>　　色即是空，空即是色，受想行识，亦复如是</h3><p>　　色即是空，此处菩萨又反复再说了达色性是空，真空即是色的道理。空性并不是兀突突的空，它是要落实在色的相对性中间的。色也并不是毫无依据的荒谬的世间事物，它们自身就包含了作为世界本质的真性，也即是空性。没有空，也就没有安立色的去处。诸佛菩萨，在时说空，有时说色说有，这是因为在一切诸法当中，色与空是相互通达的<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>而同一的。就空性至极言，世间无一色不空；就空性也要发用流行言，无有一色不显真性。空与色是两极，但又是包含着对方的两极。世间无一物不空，世间也无一物不有。修佛的人，关键是不要执迷于任何一工侧面，不要偏于任何一极，既不执于空相，也不执于色相。</p><p>　　由此可以引出\"受想行识亦步亦趋复如是\"的进一步推论。五蕴当中，色蕴为首，色蕴如果能够安立到本性是空又因空而相待假，而因缘有的立场上，则其它的四者，即\"受\"、\"想\"、\"行\"、\"识\"也就不难理解其一方面因缘而有，因空性而生；另一方面，也就因缘而无，也就是因缘相待而不可依恃，从而归为空的道理。总而言之，一切形色之有，无不是假，因为它们要依缘才能存在；又无不是真，因为它们无不包含着那绝对的相待性，无不包含着空性。所以我们才有充分的理由说\"色即是空\"。华藏是虚空的华藏。</p><h3>　　舍利子，是诸法空相，不生不灭，不垢不净，不增不减</h3><p>　　是诸法空相，不生不灭，不垢不净，不增不减。\"诸法\"，指世间一切法，亦即天地间的一切事事物物。此处指五蕴诸法，即因五蕴而生的一切相待而有者。\"空相\"，指\"真空实相\"。人的真心本来是<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>不动的，只因五蕴集聚心中生出私欲遮蔽真性，才会有种种执著，才会妄执外境为有，才会视所见、所闻、所嗅、所触为真，才会以五蕴为实有。只有般若慧才能如同利剑断除诸多迷惑，只有在缘起性空的立场上才能把握\"空相\"。</p><p>　　\"不生不灭\"，五蕴真空，便无法可生，若法不生，自无可灭。一旦明了般若妙法，无妄想心，就不会有生有灭，也就无需乎求离苦，也就没有度脱苦厄一说了。\"不垢不净\"，污垢与清净本来是两相对立而存在的。凡夫未破烦恼，未除贪嗔，生出了<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>与法执的偏见，这就是垢秽；二乘修习者已断烦恼，无离贪嗔，能证人空，名为清净；凡夫染于有漏的恶缘，名为垢；圣人熏修无漏的善缘，名为净。然而他们的垢净只有其名，究其本体言，根本无所谓垢与净，所存在的只是空而已。空是既不可谓净，也不可谓垢的。凡夫若一念头不觉，生出妄心便是垢；圣人了达空性实相，不受拘于五蕴，不受诸法色相影响，则是净。从诸法的本然之相上说，垢也没有，净也没有，这叫\"不垢不净\"。</p><p>　　\"不增不减\"，世人的本来心量，如大海一样宽广博大，含容万物，蕴育万机。但只有圣人才能把本来的心显示出来，不为事事物物所遮掩。从极的角度看，本有的心量并非修行而有，而是修行而显，所以说心量不会因为<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>而增另加一分，也不会因为迷妄而减去一分。凡夫似乎心量狭小，但那只是因为五蕴蔽障，六尘牵缠束缚，不能修行观照，所以才会有真心隐没不显。无论凡夫，无论圣人，<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>本有，真心俱在，人为地增一分或减一分都是不可能的。生灭垢净增减，都是从生的情见妄分别所致，这也就是苦厄，所以佛在此教诫，只有了达心性本来是空，一切<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>凡圣诸法都是因缘和合而生，其体性原本寂然，没有任何分别想量的必要。回心经正文</p><h3>　　是故空中无色，无受想行识</h3><p>　　是故，空中无色，无受想行识。真空实相中的五蕴诸法，都是因缘和合，虚妄而生，不可以用生灭垢净的心去追求。彻底了悟真空实相的圣人，连因缘本身也视为空，其中自然没有挂碍之色法，没有受想行识诸蕴的心法。只有勘破般若甚深法，才能无幽不洞，无暗不除。佛祖告诫说，修般若慧的人要时时观照，不可迷于色心二者。从根本的究极的角度来看，一切存在的根本相是空，是相对，是依赖，它并非磐石不可动摇，所以才说\"是故空中无色，无受想行识\"---色心二法都因为空性而丧失一切实在。</p><h3>　　无眼耳鼻舌身意，无色声香味触法</h3><p>　　无眼耳鼻舌身意，\"眼耳鼻舌身意\"称\"六根\"，梵文为sadindriya。也称为\"六情\"，为\"十二处\"的\"内六处\"，\"十八界\"的\"六根界\"。\"六根\"能够摄取相应的\"六境\"，即色、声、香、味、触、法；生长出相应的\"六识\"，亦即：眼识、耳识、鼻识、舌识、身识、<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。六根有着向外的取著倾向，众生由于外务，所以易于不知所归，因而真性蒙蔽，起惑造业，丧失本有佛性。</p><p>　　色、声、香、味、触、法六者，称为\"六境\"，它们是六根作用时不可少的境界，即眼能视色，耳能闻声，鼻能嗅香，舌能尝味，身有所触，意有所思所念。总之，六境包含了一切可认知的对象。\"六境\"有引诱众生心思向外的可能，即说它们易于蒙蔽众生本有的真心，由于有污染性，所以又称为\"六尘\"，因而\"六境\"又叫\"六尘\"。\"六根\"与\"六尘\"的相互作用使众生生出了种种虚妄分别心，造作种种业因，感受种种果报。</p><p>　　佛告舍利弗说，六根六尘都是由真空实相上幻化出来的虚妄法，本来并非实有，如果能够了解引理，虽有六根对待诸尘，但仍可以不受诸尘所染。最终能够做到眼见色尘而平等一如，由不起分别而视天界<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>相等；耳闻声尘而不作分别，无论他人是毁是誉，终归不起欣喜心、沮丧心；鼻闻香尘而不作分别，能使厕室化作香殿；舌尝味尘而不拣择甘苦；身感触尘而无意于涩滑软硬，以至能够令刀箭化为天华；意触法尘，而不随逐诸法，由不随虚假打转，心中自定，陶冶涵养，终归显出真心本性。</p><h3>　　无眼界，乃至无意识界</h3><p>　　无眼界，乃至无意识界。此处所说无非是\"十八界\"，即\"六根\"、\"六识\"、\"六境\"三者。十八界是以人的认识为中心，对世界一切现象和事物所作的分类。一人一身即具此十八界。其中的六根有认识功能；六尘作为认识对象；六识则为随生的感受与观念。总说起来，此十八界依次为：眼界、耳界、鼻界、舌界、身界、意界；色界、声界、香界、味界、触界、法界；眼识界、鼻识界、舌识界、身识界、意识界。这里的\"乃至\"是举十八界的首尾，将中间的各界省去了。</p><p>　　十八界是一切不善法的根本，是一切苦厄烦恼的原因。世间一切事物无不因为这根境识三种作用变化，而互成因果，展转无穷。只有修得甚深般若妙法，慧眼时刻观照，才能证到真空妙境，由是摆脱一切根尘识界，了然本来是空。\t\t\t\t</p></div>"
    },
    {
        "title": "心经全文解释，般若波罗蜜多心经白话文解释",
        "author": "唐三藏 玄奘法师",
        "date": "2014-02-17",
        "html": "<div class=\"B1_text\"><h3>　　无无明，亦无无明尽，乃至无老死，亦无老死尽</h3><p>　　无无明，亦无无明尽，乃至无老死，亦无老死尽。\"无明\"，指痴暗的意思。为<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>中的一支。十二因缘又称\"十二缘生\"。是佛教\"三世轮回\"中的基本理论。这十二支为：无明、行、识、名色、六入、触、受、爱、取、有生、老死，称\"十二支\"。据《<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>》卷九说，十二支的关系是：</p><p>　　1.无明缘行，\"谓诸愚夫于缘生法不知唯行\"。由于不懂得佛教缘生法，所以起惑造业。</p><p>　　2.行缘识，\"由引业力，识相续流，如火焰行，往彼彼趣，凭附中有，驰赴所生结生有身。\"前支的思想行为，作为引导力量，使识凭附中有，而向与其相应的投生处<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>。</p><p>　　3.识缘名色，\"于此趣中有名色生。\"此\"趣\"指六趣中的诸\"趣\"，善恶一共<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>。此\"趣\"，亦即\"结生\"一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>之\"有身\"，谓此\"有身\"于母胎中之心（名）、身（色）得到发育。</p><p>　　4.名色缘六入，\"如是名色渐至成熟时，具眼等根，说为六处。\"即胎儿由心身之混沌状态发育至有认识器官的分工。</p><p>　　5.六入缘识，\"次与境合便有识生，三和故有顺乐等触。\"六入，或六处与外境相合而生识，称为三和，触觉由此发生，此相当于幼儿的阶段。</p><p>　　6.触缘受，\"依此便生乐等之受。\"由有触觉便生苦乐及不苦不乐等受，此相当于所谓童年阶段。</p><p>　　7.受缘爱，\"从此三受，引受三受。\"由有感受，引生贪爱。三爱，指对世俗世界的执爱，这相当于所谓青年阶段。</p><p>　　8.爱缘取，\"从欣受爱，起欲等取。\"由有贪爱，便生出狂热的对世俗种种享受的追求，此相当于成年阶段。</p><p>　　9.取缘有，\"由取为缘，积聚种种招后有业，说名为有。\"由贪爱执取等思想行为，必然招致后世果报，就此能招后世果报言，这些思想行为总称为\"有\"。</p><p>　　10.有缘生，\"有为缘故，识相续流，趣未来生。\"由\"有\"产生后世之果报的思想行为，必然导致\"来世\"之再生。</p><p>　　11.生缘老死，\"以生为缘，便有老死。\"此下二支为一个总的因果循环链条，每两支间顺序成为一对因果关系，而配合过去、现在、未来三世；又可以概括为两重因果：由无明、行两支作为过去因，识、名色、六入、触、受五支则成为现在果；由爱、取、有三支作为现在因，行、老死则为未来果。此称三世两重因果。佛教认为，任一有情<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>个体，在未来得到解脱之前，均依此因果链条的力量在三世和六趣中间流转，永无终时；而人类社会中的一切不平等现状，也都可以从这一因果系列得到根源性的说明。</p><p>　　总之，十二因缘中的各个环节，是互为因果的，人类之所以陷于悲剧，人类的痛苦所以没有终了之时，都由于它的桎梏。缘觉罗汉悟得生死转回的苦趣能够逆观老死苦的境界以生为因，生以有为因，有以取为因，取以爱为因，爱以受为因，受以触为因，触以六处为因，六处以名色为因，名色以识为因，识以行为因，行以无明为因，而无明以真空妙性为体，本来是虚妄。若能返妄归真，返本还灭，便无明灭，由无明灭，便有行、识、名色、六处、触、受、爱、取、有、生、老死也都随之而灭。这是缘觉罗汉修行观照的境界，叫做\"还灭门\"。缘觉罗汉认为十二因缘为实有，便用功去消灭它；而大乘菩萨以般若妙慧观照这一境界，以为其未必是实在之体，应视同大虚空一般，因此说到底，凡夫流转于十二因缘中也属一种假说，从根本上看，仍是虚妄。只要达到了悟真实，扫除一切执著，把握因缘起而性空的谛义，也就空除了十二因缘。这才是大乘法门。达此境界，也便不再追求一己之私的解脱，不至于在\"个人\"的道德完善上下功夫，不会只追求了悟生死。因此才会悲心大振，无意于摆脱个人的十二因缘桎梏，而是投入世间，上行下化。不度空地狱，誓不<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。</p><h3>　　无苦集灭道</h3><p>　　无苦集灭道，\"苦集灭道\"，指<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>道理，也称四谛法门。\"谛\"为\"真理\"的意思。\"苦谛\"者，是人对于社会及自然环境所作的价值判断。苦，指生死果报，有三苦、四苦、八苦等的说法，简而言之，大凡世间上一切逼恼和身心不安的事，都可以叫做苦；\"集谛\"是指造成世间人的痛苦的原因，\"集\"是\"招集一切苦恼\"的意思。世人所以有苦恼，都因为倾向于以\"我相\"为基础和出发点，因有\"我相\"，故执著我有与我所有的妄想，一切争夺欺诈、穷奢极欲无不因之而起，也无不因之而导致更大的痛苦。世间的快乐，说到底也仍是苦，正所谓\"乐是苦因\"。众生因贪欲而造罪，招集众多苦报，所以苦集二谛是世间法，又是有漏因果，集是苦因，苦是集果。明白了这种烦恼业因的来源，自然就会思量厌离苦恼，并因此而行动起来，修善止恶，断灭集的苦因。</p><p>　　至于\"灭\"与\"道\"二谛，是出世间法，又叫无漏因果。\"灭谛\"指断灭产生世间诸苦的一切原因。\"灭\"者，灭有为还于无为，也就是涅槃，亦即靠修行而达于最终的寂静；\"道谛\"是指脱离\"苦\"、\"集\"的世间因果关系而超入无苦有常<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>清净地的理论说教和修行方法。\"道\"有\"能通\"的意思。简而言之，它包括了戒、定、慧三无漏学及所谓\"三十七道品\"。人有造罪的业因，所以一定会招来苦果，自作自受。罪业只能自己为自己消灭，这是灭谛；要消灭罪业，只有依据一定的方法，此为\"道谛\"。道谛为正道修习法门。这个法门又可以简单地说成\"知苦、断集、修道、证灭\"。</p><h3>　　无智亦无得</h3><p>　　无智亦无得，\"智\"作\"般若\"解。亦即智慧、能知的妙智。\"智\"为能求的心；\"得\"为所证的<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>或者所求的境界。佛果有四种，一缘觉、二声闻、三菩萨、四佛。二乘菩萨修行六度法门，上求法于诸佛，下普化众生，自己修行得利益，又以利益泽润他人。所以能如此，都因为以智慧为第一，有智慧，也便能够彻上彻下，自己得真空大智，又能教益众生，使除惑生慧。在凡夫看来，入了菩萨阶次，功行很大，智慧非凡，已经很了不得；但在菩萨本人看来，这不过是还了本来面目，并没有什么智慧可言。其实，什么也没有证得，不过是回归本来寂寥而已。因为真心本来空寂，在般若真体当中，一念圆融，本来没有修习的事，因此也就没有什么可以证得。所以不见有知的大智，也就没有所证的果德，若是以有所得的心去求，就已经不是真空。知而无知，才是真知；得而无得，才是真得。所以归结为\"无智亦无得\"。换言之，人人皆有本觉真心，智慧本然，不假修行。只要不起妄念，不作分别，也就复了本性和真心，就能返观<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>本空，除去五蕴、十二处、十八界等等智慧之障。障碍一除，本心显露，一切世间的空性、真如性了了分明。</p><p>　　从这个意义上说，修佛其实是复性。既然智慧本来就在心中，修般若也就不必执为实有，否则也就成了迷妄，成了遍计所执了。所以《<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>》上说：\"大乘说空法，为离诸见故，若复见于空，诸佛所不化。\"道理大致如下：众生执有为病，证空是除病的药草，有病既除，空也随之消灭，正如病愈而不再用药一样。如果明白这点，为什么说五蕴、十二处、十八界等等诸法本性是空也就可以理解了。进一步，还可以说，缘觉所修的十二因缘法门，声闻乘所修的四谛道理，二乘菩萨所修的六度万行，都是空，都是假设，都是譬喻。但这是得了大道之后的返观，是回首下看的结果。若众生尚在修行路上，就宣布佛说十二部经原本虚拟，那就是说胡话，信口雌黄，我慢如须弥山了。修行之人，依法修持，一步一趋，待到功夫<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，机缘成熟，自然真心常住不变，其中既没有丝毫虚妄，也就没有什么解脱无碍，生死惑尽，安乐现前。这就是大乘菩萨亲证后的境界。</p><h3>　　以无所得故，菩提萨埵，依般若波罗蜜多故，心无挂碍，无挂碍故，无有恐怖，远离颠倒梦想，究竟涅槃。</h3><p>　　此处的\"以\"说明原因和来由。《大般若经》上有\"佛果以无所得故而得也\"。</p><p>　　\"菩提萨埵\"，全称为\"菩提萨埵摩诃萨\"，意为\"大菩萨\"，梵文应为mahabodhisattva。直译为\"大觉有情\"、\"大众生\"。\"摩诃\"，意为\"大\"；\"萨\"为\"萨埵\"的略音。\"萨埵\"，意为\"有情\"或\"众生\"。摩诃萨指有大心，能救度极多众生，便得度脱生死的菩萨。《大智度论》说，此种人心能为大事，指心能度大众，智能悟大理，勤修六度大行及一切大善，能修难修，能舍难舍，能忍难忍；经三大阿僧祇劫而行愿不退；唯以阿耨多罗三藐三菩提为所求目标。这是区别于二乘菩萨的。</p><p>　　\"依般若波罗蜜多\"的\"依\"，作\"依靠\"讲；大菩萨是能依之人，般若波罗蜜是所依之法，其解脱智慧从所依持的修行法门中生出。</p><p>　　\"挂碍\"，的\"挂\"即牵挂；\"碍\"即妨碍。意谓由于物欲牵挂妨碍，所以不得自在；\"恐怖\"，即惊恐怖畏的意思，心中惊慌，当然不得安乐；\"颠倒\"，不平顺，不安定；\"梦想\"，不符合真实的妄想，错乱之想；\"究竟\"，达到至极地位。</p><p>　　\"涅槃\"，无余涅槃与有余涅槃相对而言。先释涅槃，涅槃为音译，梵文名nirvana。通常译为\"灭度\"、\"寂灭\"、\"解脱\"，也译为'圆寂'。灭者，灭生死因果之义也。灭度者，灭生死之因果，度生死之瀑流也。是灭即度。寂灭者，有无为空寂安稳之义也。灭者，生死之大患灭，不生者，生死之苦果不生也；无为者，无惑业因缘之造作也；安乐者，安稳快乐也；解脱者，离众果也。此中所译'灭'即为正翻。僧肇之《涅槃无名论》曰：\"泥曰泥洹、涅槃，此三名前后异出，盖是楚夏不同耳。云涅槃音，正也。......秦言无为，亦名度。无为者，取于虚无寂寞，妙灭绝于有为。灭度者，言其大患永灭，超流四度。\"涅槃又分为有余涅槃与无余涅槃两种。有余涅槃生死惑业已尽，但有漏身所依之苦果尚存；相对之无余涅槃，谓更灭依身之苦果而无所余也。</p><p>　　《大智度论》说：\"涅槃是第一法无上法，是有两种：一有余涅槃；二无余涅槃。爱等诸烦断，是有余涅槃；圣人今世所受五众尽，更不复受，是名无余涅槃。就大乘而论，变易生死的因如果得以断除，则为有余涅槃；变易生死的果如果得以断除，则为无余涅槃。</p><p>　　究竟涅槃是大灭度，大，谓其法身清净圆满，普遍显现于一切方所。由其无处不存，所以为\"大法身\"。\"灭\"是解脱，摆脱世间一切事物的妨碍，心中没有欲念，故谓之\"灭\"\"度\"，也即是\"般若\"，为六度之一，即照破众生长夜痴暗的智慧光明。菩萨依照般若法门修行，观照真实，最终达到人空、法空、空空，三障尽除。人空则境空，境因心有，境依人而立，人尚不得，何来依人的境？勉强地说，无人之境本来寂寥，荡然无存，仍然是空；从法空一面说，观境自然不见境，境不妨碍妙智，观心也不见心，惑不碍心，心境两空，于是心中没有任何牵挂滞碍，也就不致生出惊恐，没有死的怖畏，既已断尽恶因缘，心便常定不乱，远离七颠八倒，昏烦扰乱和幻妄，得解脱，得通达，证常乐我净，得究竟涅槃。</p><h3>　　三世诸佛，依般若波罗蜜多故，得阿耨多罗三藐三菩提。</h3><p>　　\"三世\"，指过去、现在、未来三者，此处含有\"十方三世\"的意思。这一佛教用语，大致相当于今天我们所说的一切时间和空间，这也就是佛教所看待的时空宇宙。十方，谓东南西北四方及东南东北西南西北四方，再加上上方和下方，一共十方。\"三世\"的\"世\"者，有\"迁流\"之义，\"有为\"之义。用于因果轮回，它也指个体一生的存在时间。即：过去（前世、前生、前际），现在（现世、现生、中际），未来（来世、来生、后际）的总称。《增一阿含经》卷四十八：\"<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>瞿昙恒说三世。云何为三？所谓过去、现在、将来。\"又说：\"云何过去世？若法生已灭，是名过去世。云何未来世？若法未生未起，是名未来世。云何现在世？若法生已未灭，是名现在世。\"</p><p>　　\"佛\"，即<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，意为\"觉者\"或\"妙觉\"，这是出世的圣人的极果。\"觉\"有三种意义：自觉、觉他（使众生觉悟）、觉行圆满。按佛教的说法，凡夫所缺的是全部三种意义：而三乘菩萨所缺的是后两项，只有佛才能做到三项具足。</p><p>　　\"阿耨多罗三藐三菩提\"，梵文anuttarasamyasambodhi的音译。意思是\"无上正等正觉\"，是只有佛才能够有的能力，\"正觉\"，就是佛智，或称作\"一切种智\"，是十方三世的一切诸佛修行所得的智果；\"无上\"，指其至高无上，无人可凌其上；\"正\"者，不偏不邪之义；十法界同为一体。谓之\"等\"，不同于凡夫外道的见解，称\"正觉\"。无上正等正觉就是圆极佛果，自在菩提。菩萨虽了然心性平等，自利利他，但尚未圆证究极之果，其上尚\"正等正觉\"有待努力；二乘超凡入圣，明心见性，但不能明了一切众生心性平等，故犹只能自利，而不能觉他，只是\"正觉\"而已；外道心外取法，修诸多苦行，却不明心性为何物，所以是\"邪见\"；凡夫众生，虽有本觉真心，但妄念未除，故称\"不觉\"。只有佛陀三智圆明，五眼洞照，始觉与本觉合而为一，能转生死为涅槃，化烦恼为菩提。总之，诸佛也是依赖般若法才得到菩提智果的。</p><h3>　　故知，般若波罗蜜多是大神咒，是大明咒，是无上咒，是无等等咒，能除一切苦，真实不虚。</h3><p>　　此一段极赞般若功能。\"故知\"二字，总结前面说的般若功用，引起后面所说的般若利益。就是说：因般若波罗蜜多能够了脱生死苦恼，驱除烦恼魔障，所以\"是大神咒，是大明咒，是无上咒，是无等等咒\"。咒，也叫\"总持\"，梵文为dharani，音译为\"陀罗尼\"。意思是\"有力量的语言\"，\"能成就除恶生善的事实\"。</p><p>　　佛教认为，不断地<a href=\"/fozhou/\" class=\"keylink\" target=\"_blank\">念咒</a>，就会受到这语言的熏习，便是一种熏修，不知不觉中就受到了<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。这里说佛陀以慈悲心说显密法，以法味熏习一切众生，愿他们如同佛一样也得正觉，在潜移默化中超凡入圣。另一方面，又因甚深般若的道理难以显明说尽，唯有密证一途，所以称作\"咒\"。咒，已经有\"神\"的意义。\"大明咒\"，谓其能破长夜痴暗，照彻一切皆空，无所遮蔽，如同日光照世，\"无上咒\"，指世间出世间无有一处超过此法门，若依此法门修行，便能证得\"无上\"的佛果；\"无等等咒\"，说没有一法能与般若相等，般若法是佛的修行心要，是圣中之圣，依此修行是无等等的途径。修般若法，能破色法心法，无牵无挂，不但明心见性，并可以径此证佛果，尽除一切众生所受的苦厄灾难。所以说，般若法门\"真实不虚\"。</p><h3>　　故说<a href=\"/fozhou/boreboluomiduozhou/\" class=\"keylink\" target=\"_blank\">般若波罗蜜多咒</a>，即说咒曰：揭谛揭谛，波罗揭谛，波罗僧揭谛，菩提娑婆诃</h3><p>　　揭谛，揭谛，波罗揭谛，波罗僧揭谛，菩提萨婆诃。</p><p>　　此为梵文<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>。本经前面，从\"观自在菩萨\"始，至\"真实不虚\"为显说般若；此段咒语则为密说般若。佛法本来分为显密两种，显明者，<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>借世俗文字语言传达道理，示现于人，导人修持而得利益。秘密法则含有咒语这样的方法，佛法的本质在至极之处是不可说的，佛只是为了众生利益才不得不说法，那神妙不可说的秘密只有借咒语来教授了。秘密法门之一的陀罗尼，凡夫不能理解，只好不作汉译，但念诵仍是有效力的。</p><p>　　按以往的说法，《心经》中全部要义，完全包括在这四句咒语中。念诵这四句咒，其效力等同于诵读此经。</p><p>　　依法藏大师所说，此四句分别可以释如下：\"揭谛\"者，此处为\"去\"或\"度\"之意，这也就是深般若的本有功能，度众生于彼岸；重复\"揭谛\"二字，无非是自度度他的意思；\"波罗\"意为\"彼岸\"；\"波罗揭谛\"者，\"度到所欲之彼岸\"的意思；至于\"僧揭谛\"的\"僧\"，意为\"总\"或\"普\"，因而\"波罗僧揭谛\"的意思便是\"普度自我及他人都到彼岸\"；\"菩提\"为\"觉\"；\"娑婆诃\"即\"速疾\"也，意谓依此心咒，速疾得成大觉。只要默诵此密咒，就在不觉不知的状态下超凡入圣，所以才说，此咒即般若，而般若即是咒。</p><p>　　《心经》一卷，说尽了《大品般若》六百卷的义理。佛教化众生，随机引导，由凡夫至佛界，修行的法门因人而异。若众生有迷于色法远甚于心法的，佛为之说五蕴合色而开心法门；若有迷于心法而远甚于色法的，则说六入十二处合心而开法门；若有众生迷于色法与心法二者不能自拔的，则为之说十八界的虚妄义；若众生有不迷于色法及心法的，又为之宣说一切诸法因缘而生，因缘而假，因假而得中道的含义。</p><p>　　总之，众生有异，是因为心不能照见诸法实相，所以不能照见，是由于根尘识显现且相互纠缠，所以执有执无，失却般若光明，起惑造业，陷于六道轮回，受苦无穷。若能回光返照，依般若法修行，功夫纯熟，自能自见本性，自显圣性，从而照五蕴为当体空，照十二因缘为缘起空，照一切诸法为自性空。得三智，即一切智，一切种智，道种智。《大般若经·初品》中所说的：\"欲以道种慧具足一切智，......欲以一切智具足一切种智，当习般若波罗蜜。\"《大智度论》上说：\"此三智一心中得，若就其次第而言，则有道种智生一切智，由一切智生一切种智\"。《摩诃<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>》说：\"空、假、中，皆见实相，名一切种智。故言三智一心中得。\"但这是配合《中论》的三是偈中的空假中来说佛智的。按照我们的说法，一切智是关于一切对象的认识能力，若就佛教而言，它所把握的是一切事物和现象的共性。《大智度论》卷二七说\"总相是一切智，总破一切法中无明暗\"。《大乘义章》卷十八说\"知一切如，名一切智\"；至于一切种智，那是关于事物个性或别相的认识。《大智度论》卷二七说：\"别相是一切种智\"，\"一切种智，观种种法门，破诸无明\"；一切种智有时也被认为是综合认识共直与别相，即共性与个性的智慧。《大品般若经·三慧品》说：\"一相故名一切种智。谓一切法之寂灭相；复次，佛如实知诸法行类相貌，为显示故说名字，以是故名一切种智\"；而道种智是一切智和一切种智的基础，贯穿佛教修习的全部过程。《大智度论》说：\"初发心乃至坐道场，于其中一切善潜心产名为道；此道分别思惟而行，是名道智。\"</p><p>　　以此三智观待诸法，可以了然，声闻四谛法、菩萨六度法、大乘菩萨的究竟解脱、佛的菩提大觉，都是真空所摄。一切法空，一切圣解脱法空。因为一切法原本不生不灭，也就不需要解脱，无需转染成净。世间与涅槃，生死与烦恼、佛与众生平等一如，了无差别。得此三智，强以了直空妙有，得中道之旨，这也就是摩诃般若。至此，也就显出了众生本有心性和灵光，其所照显，竖穷三际，横遍十方，这正是观世音菩萨修行甚深般若的亲证境界，也就是全部般若经类的义趣所在。</p><h3 style=\"text-align: center;\"><a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a></h3><p style=\"text-align: center;\">圣<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>极珍贵，诸未生者令生起，</p><p style=\"text-align: center;\">令已发起不衰退，辗转增上恒滋长。</p></div>"
    }
]