[{
    "title": "成唯识论卷第一",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p style=\"text-align: center;\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0123/20160123052427758.jpg\" style=\"width: 210px; height: 240px;\" /></p><p>　　<strong><a href=\"/fojing/chengweishilun/yuanwen.html\" class=\"keylink\" target=\"_blank\">成唯识论</a>卷第一</strong></p><p>　　外人难说：如果只有识的话，为什么<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的一般凡夫及诸外道和出世间的诸圣教都说有我、有法呢？</p><p>　　论主回答说：《<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>三十颂》说：“我和法都是假设而有，有各种各样的相状，它们都是识变现的。能变之识只有三种：第八阿赖耶识为异熟识，第七末那识为思量识，眼、耳、鼻、舌、身、意六识称为了别境识。”</p><p>　　论说：世间的一般凡夫及诸外道和出世间的诸圣教别说有我有法，都不过是一些假说而已，其实，它们并没有真实的体性。所谓“我”是主宰的意思，“法”是轨持，即所谓“轨生物解，任持<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>”的意思。若我若法，都有各种不同的形相。“我”的形相在世间称为有情、命者等，在小乘<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>称为预流、一来等。“法”的行相，胜论称为实、德、业等，佛教称为<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>、十二处、十八界等。“转”的意思是说随着识与种种方便施设的语言文字而有各种不同的假说。如果诸我、<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>都是假说，那么，它们依据什么得以成立呢？那些我、法之相都是由于识的变现而假说的。“识”是了别的意思。这里所说的“识”(心法)，也包括心所法，因为心所法必须与心法相应而起，也就是说，有心法生起的时候，必然也有与之相应的心所法相伴随而俱生。</p><p>　　安慧认为：所谓“变”，是说识体生时，转似相、见二分，因为相分和见分都是依赖自证分而生起的缘故。依据相、见二分假说有我(见分)、法(相分)。彼我彼法离此相分、见分则无所依取。</p><p>　　难陀等认为：由识所变现的外境，是由于<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>与法执分别熏习产生的，所以内识生起时，才会变现出种种的我与法来。我、法相虽然来自内识，但藉由虚妄分别，却能投射于外境上，成为一种幻相，随境而现。各类愚蠢迷惑的有情<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，从无始以来，就妄执这些“似外境”相以为实是我、实法，就像是患眼病或作梦的人，把因眼病而看到的五颜六色或者是一些梦境，误认为都是真实的东西。</p><p>　　<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>等认为：愚蠢人认为实有的我和法都是不存在的，但随顺其虚妄分别而施设，所以说为假有。由于内识的变现，好像是有我、有法，虽然可以说是有，但并不是真实的我和法，只是似我、似法在显现，所以说是假有。外境是随顺众生的虚妄分别而方便建立，所以不如识的存在；而识的存在必须依托内因外缘而生，所以不像外境那样是无，这就排除了增、减二种错误主张。外境依仗内识而虚假成立，从俗谛来看是有；内识是虚假外境的所依，从<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>来看也是有。</p><p>　　外道和小乘问：怎么知道实际上并无外境，只有内识变现为好像是有外境在产生呢？</p><p>　　论主简略回答说：因为真实的我、法是没有的。</p><p>　　犊子部、正量部、经量部和外道问：为什么说真实的我不存在呢？</p><p>　　论主回答说：认为有我的主张简略来说有三种：一数论和胜论师主张，“我”是永恒的，普遍存在于五趣当中，如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>那样存在于十方，到处造作各种行为而受苦、受乐；二耆那教认为：“我”虽然是永恒的，但大小不定，可以随着身体的大小而有变化，可以卷缩，也可以舒展；三兽主、遍击等外道认为：“我”是永恒的，细小得像一个极微，潜伏于身体中造作各种行为。</p><p>　　第一种主张是错误的，为什么呢？认为“我”是永恒的，普遍存在于五趣当中，量同虚空，就不应当随顺身体受苦、受乐等。如果“我”是永恒的，普遍存在于五趣当中，就应当不必考虑转不转动的问题，为什么还能随顺身体造作各种行为呢？而且，人们所执着的“我”，对于有情众生来说，是相同呢？还是不同呢？如果说是相同的话，一个众生造作某一行为时，一切众生都应造作这种行为，一个受某种<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>时，一切众生都应当受这种果报，一个得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，一切众生都应当得解脱，这就造成极大的过错。</p><p>　　如果你们所说的我和一切有情众生的我不同一体，则一个有情众生的我体周遍，各有情众生的我体也应当周遍。既然各有情众生的我体互相周遍，就会各各互相涉入，一个有情众生的我体和各个有情众生的我体应当相互混杂为一，即成同一个我体。一个有情众生作业时，一切有情众生都应当同时作业；一个有情众生受果时，一切有情众生都应当同时受果。因为你们所说的我和一切有情众生的我，同在一处，没有区别。这应当称为一切所作，一切所受。</p><p>　　如果说我体虽递，但作、受各有所属，即谁作谁受，这样就不会犯上述过失。但是这种<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>在道理上也讲不通，因为业、果、身与各有情众生的“我”相合为一体，不分彼此，说属于这个而不属于那个，这在道理上讲不通。一个众生得解脱，一切众生都得解脱，是因为所修法、所证法和上述一切相杂的“我”合为一体的原故。</p><p>　　第二种观点也是错误的，为什么呢？“我”<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>于身中，不应当随顺身体而有舒展或卷缩。既然有舒展或卷缩，就像是风箱中的风一样，应当是非永恒的。而且，认为“我”随顺身体的大小而有卷舒，应当可进行分析，或认为色是我，或认为受是我，或认为想是我，或认为行是我，或认为识是我，怎么能认为我体同一呢？所以，那种意见就如儿童、小奴戏于沙土一般。</p><p>　　第三种观点也是错误的，为什么呢？“我”小得像一极微，怎能使大的身躯运转呢？如果认为“我”虽然很小，而在身内迅速运转，就像旋火轮那样，就应当认为“我”并非同一，亦非常住，因为各次往来的并非常住，亦非同一。</p><p>　　另外，人们所说的“我”又有三种：一俗人认为五蕴就是我；二数论派认为“我”与五蕴不相同的；三小乘犊子部认为，“我”与五蕴既不相同，又不是毫无关系。俗人认为五蕴就是“我”，这是不对的，因为“我”应当是与五蕴一样并非常住，亦非同一。而且，根及属于根的扶尘根肯定不属于“我”，就像客观物质互相妨碍的缘故。心法和心所法也不是真实的“我”，因为心法和心所法并不是永恒相续的，需要各种条件和合而成的缘故。其余的不相应“行”和无表色也不是真实的“我”，因为它们就像虚空那样没有分别，是没有觉性的。</p><p>　　第二种所说的“我”与五蕴不相同，也不对，如果是那样的话，“我”就像虚空那样不能作业，也不能受果。</p><p>　　第三种认为“我”与五蕴并不相同，也不是毫无关系，这也不对，认为“我”依五蕴而立，就应当像五蕴那样是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>的。“我”与五蕴非即非离，就应当像瓶等那样无常，所以没有真实的“我”。而且，既不能说是有为法，也不能说是<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>，也不能说是“我”，也不能说不是“我”，所以，他们所说的真实“我”是不能成立。</p><p>　　又，人们所说的真实“我”体是有思虑呢？还是无思虑呢？如果像数论所主张的那样是有思虑，就应当是非永恒的，因为并不是永远有思虑。如果像胜论所主张的那样没有思虑，就应像虚空那样不能造作行为，也不能接受果报。所以认为有“我”的主张，从道理上来讲都不能成立。</p><p>　　又，人们所说的“我”是有作用呢？是无作用呢？如果像耆那教所主张的那样是有作用，就像手、脚等那样，就应当是非永恒的。如果像数论所主张的那样是无作用，就如兔角那样，没有真实的“我”。所以从两方面讲，认为有“我”的主张都不能成立。</p><p>　　又，主张有“我”的人们所说的“我”体能缘境吗？如果不能缘境的话，你们怎么知道“我”真实存在呢？如果“我”能缘境的话，有“我”的见解就不是错误的，如实知晓的缘故。如果是这样的话，为什么执有我的外道、小乘所相信的至教中都破除“有我”的见解而称赞<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>”呢？如果我见非是颠倒，为什么要予以破除呢？如果无我是邪见，为什么要予以称赞呢？因各个至教中说“无我”的见解能<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>，坚持“有我”的见解则会沉沦于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。如若依你们说：不执我的知见是邪见，执我的知见是<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>，那么哪会有错误的见解能证得涅槃，正确的见解反而沉沦于生死呢？而且，由<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>产生的我见，绝对不能缘于真实的我体，因为我见有它托缘而起的所缘，就如其余的心法和心所法那样，都缘自体所变的相分。所以我见所缘的对象肯定不是真实我体，因为是属于我见的所缘的缘故，就如其余的色法等那样，是所缘，是假有，那里可说为实我呢？所以我见不缘真实的“我”，只是缘内识变现的五蕴，但随众生的种种虚妄分别而方便施设为“我”。</p><p>　　种种的我执，简略来说有二种：一是俱生，即与生俱有的我执；二是分别，由于第六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>的虚妄分别而产生的我执。俱生我执从无始以来，由于虚妄熏习的内在因力，常存于五蕴身中，不需要外道的错误说教，也不需要因<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>外道的教义而于内心上生起邪分别，然后方得生起，所以称为俱生我执。</p><p>　　俱生我执又分为两种：一常相续，第七识缘第<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>，认为第八识在第七识的心中之相为真实的“我”；二有间断，这就是第六意识中缘于第八识阿赖耶识所变现的五取蕴这个相分为其本质，或总缘五蕴为我，或取五蕴之中任一者为我，而在<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>中产生幻觉，执取为我，于上执称为实我。这两种我执微细隐密，难以断除，要在<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>位上一再<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>我空观才能断除。</p><p>　　分别我执是由于现实环境中种种的客观<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>形成的，并不是与生俱有，需要有外道的错误说教和受持外道教义而于内心上起邪分别才能产生，所以称为分别我执。分别我执只有在第六意识中有。分别我执又分为两种：一因为外道错误地解释五蕴相，心中产生一种印象，对此虚妄分别为实我；二因为外道所说的“我”相，第六识在此产生自己心相的影子，对此虚妄分别计度为实我。这两种我执粗显，所以容易断除，在见道位观一切法空真如即可断除。</p><p>　　这样所说的一切有我的主张，或有认为心外五蕴是有，或是认为心外五蕴是无，但认为心内五蕴都是有，所以我执都是把非永恒的五蕴相妄执为“我”。但是，五蕴之相都是因缘和合而生，所以是幻有，由于人们的虚妄计度，硬说是“我”，这种“我”肯定是没有的。所以<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>这样说：“<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>应当知道，世间<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>和<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>主张有我的见解，都是缘五蕴而起。”</p><p>　　外人诘难说：真实的“我”如果没有的话，怎能记忆过去的事情？怎能认识外境？怎能诵持经书、温习文史？怎能有恩爱、怨恨等事呢？</p><p>　　论主批驳说：人们所说的真实我体既然是常住而无变易，以后的“我”应当像以前的“我”一样，实际上，这种事情是没有的。以前的我应当像以后的我，这样的事情并不是没有，因为以后的我体与以前的我体没有区别。如果说我的作用前后有变化，并不是我体前后有变化，像这样讲，从道理上也讲不通，因为作用不能离开本体，用亦应当同体一样的是常有。反过来说，本体也不能离开作用，如此体也应当是同用一样非永恒的。但是，各个有情众生各有一个阿赖耶识，持续不断，能使种子和一切事物互为原因。由于熏习缘故而有如此记忆、认识、诵持、温习、<a href=\"/remen/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>、怨恨等事。所以，像这样的诘难，失败的是你们，而不是我们唯识宗。</p><p>　　外人诘难说：如果没有真实的“我”，谁能造作行为？谁能接受果报呢？</p><p>　　论主回答说：人们所说的实我既然是没有变化，像虚空那样，怎能造作行为接受果报呢？如果有变化，就应当是非永恒的。然而由于各有情众生心法和心所法的因缘力持续不断，因而可以造作行为接受果报，这在道理上不相违逆。</p><p>　　外人诘难说如果“我”实际上是没有的话，谁在五趣或六趣中生死轮回呢？又是谁厌苦而求涅槃呢？</p><p>　　论主回答说：人们所说的“我”既然是无生无灭，怎能说是生死轮回呢？如果“我”永远像虚空那样不为苦所恼，为什么要厌苦舍苦而求涅槃呢？所以主张有“我”的人往往是自我推翻。然而有情众生身心持续不断，是由于<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>业力使众生在六趣轮回不息，由于厌恶<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>而求涅槃。由此可见，肯定没有实我，但有各种识，从无始以来，前念息灭，后念产生，<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>相续，由于虚妄熏习，好像是有“我”之相在显现，愚蠢的人们将此妄执为“我”。</p><p>　　外人问道：为什么说识外各种真实事物是不存在的呢？</p><p>　　论主回答说：因为外道和小乘所说的客观事物，在道理上来说是肯定没有的。</p><p>　　外道所说的外境为什么没有呢？数论认为“我”就是思虑，利用萨埵、剌阇、答摩三种属性构成五大等二十三种法。而五大等法由萨埵、剌阇、答摩三事合成是真实的，并非虚假的，因为它们是<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>所得。这种主张是错误的，为什么呢？因为五大等二十三法是由很多因素构成的，就像军、林等那样应当是虚假的，并非真实，怎么能说是现量所得呢？</p><p>　　而且，五大等二十三法如果是实有的话，就应当和自性一样，不是萨埵、剌阇、答摩三种属性合成，因为萨埵等三种属性就是五大等二十三法，就应当如五大等也由萨埵等三种属性合成。自性就应当如五大等一样是有变易的，是无常的。而且，自性的萨埵等各有多种功能，本体也应当是多种，因为功能和本体是一致的。萨埵等三既然遍于一切自性本体，一分转变成法之时，其余的也应当转变，因为自性之体是无区别的。自以为萨埵等三种属性，体与相各有区别，怎能三事和合成一相呢？不应当和合时变为一相，因为与木和合时的体是无区别的。如果认为萨埵等三种属性本体相异，其相相同，便违背本学派体、相同一的主张。假使三事合成一相，本体应当如相状一般隐密一体，相状也应当像本体一样明显地分为三种，所以不能说是萨埵等三合成一体。而且，萨埵等三是各别的，五大等是一总体，总体和各别是一致的，不应当分一和三。</p><p>　　萨埵等三变化时，如果不和合成一个体相，就和不变化一样，为什么显现为一个东西呢？如果萨埵等三和合成一个相状，应当丧失原来的个别相状，其体也应当随其相状而丧失。不能说萨埵等三各有二相：总相和别相。因为总相就是别相，总相也应当是三种，怎能见一总体呢？如果说萨埵等三各有三相，杂凑在一起，难以知晓，所以呈现一体的话，这也不对，既然是有三相，怎能呈现一体呢？又怎么知道萨埵等三有别呢？如果萨埵等三各具三相，应当是每一种属性都能构成物质现象等，既然如此，试问究竟何所缺少，定要待萨埵等三和合在一起才能成为一色呢？相有三种，本体也应当是各有三种，因为体就是相。</p><p>　　而且，五大等二十三法也都是萨埵等三和合而成，自性和五大等法应当是没有差别。这样，因果、五唯、五大、十一根的差别都不能成立，如果是这样的话，一根应缘一切境，或者一境由一切根所缘。人们于尘世间见到的有情众生和无情识的砖瓦木石等，清净与污秽等，现量与比量等，都应当没有差别，这是极大的过错。所以，人们所说的实际事物不能成立，只是由于人们的虚妄计度而认为是实有。</p><p>　　胜论主张“实”等六句义多数是实有的，因为它们是现量所得。这种主张是错误的，为什么呢？因为六句义中所说的永恒者，既然能生果，就应当是非永恒的，有作用的缘故，如所生果一样是非永恒的。如常住而不生果者，也应当是没有离识而有真实自性，如兔子角等。六句义中各种无常者，如互有妨碍便有方分，就应当是可以分析，如军、林等，并非有它的实有性。倘若这无常法是无质碍的，就像心法、心所法一样，应非离觉等有实自性。</p><p>　　又，胜论所说的地、水、火、风，应当是无碍，因属实句义身根所触，如地的坚性、水的湿性、火的暖性、风的动性。而且，胜论所说的坚、湿、暖、动，应当有碍，因为属德句义所摄持，身根所触，如地、水、火、风四大。地、水、火三种，就如青色等一样，都是眼所见，也应如前进行责难。由此可见，地、水、火、风及其属性坚、湿、暖、动，都是不真实的，都无自性，因为眼睛并没有见到真实的地、水、火、风。又，胜论所说的实句义有碍的常法，因为它们都是有碍的，就如粗显的地一样，应当是非永恒的。六句义中由色根所摄取的无质碍事物，都应当是有碍的，因为它们由色根所摄取，如地、水、火、风一样。</p><p>　　又，胜论学者所执非是实句、德句、业句等所摄的大有性，也并不是离识之外有其自性，因为它们是不真实的，就像石女的儿子一样，是根本不存在的。再说非是大有性所摄的实德业等五句，离识之外应当是无其自性，因属非大有性所摄，就如空中花一样。胜论所说的“大有”离识之外应无自性，因为胜论师认为大有性是非无的。如果离开“实”等句义，应是非有，因为你们认为离开实等应非有大有性，如毕竟无等。如果“大有”非无无其“有”性，为什么实句义等有特殊的“有”性呢？如果离开“有法”还有一个“有”性，应当是离开“无法”而特别有个“无”性，既然不是这样，为什么要设一个“大有”呢？所以你们说的大有性都是由于虚妄计度而产生。</p><p>　　又，你们认为实、德、业性(即同异性)不同于实、德、业，这在道理上肯定讲不通。不能说实句义不同于实句义之性，如德；不能说德句义不同于德句义之性，如业；不能说业句义不同于业句义之性，如实。如果胜论派的主张能成立的话，地等诸性坚、湿、暖、动不同于地、水、火、风之体。这在道理上同样是不对的，为什么呢？如果坚等之外没有另外的地等，地等之外没有另外的坚等。以此类推，“实”等之外没有另外的同异性，同异性之外没有另外的“实”等。就如实性、德性、业性之外没有一个同异性一样，实、德、业句义之外也应当是没有一个同异性。如果你们说离实、德、业之外有个同异性，就应当说离非实、非德、非业之外，有个非实等的同异性。既然不是这样，你们为什么说离开实、德、业之外有个同异性呢？由此可见，所谓同异性只不过是虚假施设而已。</p><p>　　又，胜论所说的和合句义肯定不是实有，因为它是由根本不存在的“实”等句义和合，就如毕竟无一样。胜论自以为“实”等句义是现量所得，从道理上进行推论，尚且都不是实有，更何况它自己认为和合句义并非现量所得，怎能为实有呢？如果胜论认为和合句义是现量境，由于上述道理原故，也不是实有。</p><p>　　胜论所说的“实”等句义并非离识而有自体由现量所得，因为你们认为是所知的对象，就如龟毛等是根本不存在的。又，缘“实”之智并不是缘离识之外，另有实句义自体的现量智所摄，因缘多法假合而生故，如缘“德”之智等。推而广之，乃至缘“和合”智并不是缘离识之外，另有和合自体的现量智，因缘多法假合而生故，如缘“实”之智等。所以，胜论所说的实句义等也是随顺有情众生的虚妄执着假设而有。</p><p>　　婆罗门教徒主张，大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天其体实有，遍一切处，是永恒的，能生万物。这种主张是错误的，为什么呢？因为如果事物能够产生，必定是非永恒的，有生必有灭，各种非永恒的东西肯定不能遍一切处，各种不遍一切处的东西不可能是真实的。本体既然是永恒的并遍一切处，又具备各种功能，应当是不管任何处所任何时间立即产生一切事物。待有希求或条件才能产生者，是和大自在天一因生万物的理论相违背的。或者希求和条件也应当立刻生起，因为你们说因是永远具有的缘故。另有一些人主张有一个大梵天、时、方、本际、自然、虚空、我等，是永恒的、实有的，并具各种功能，可以产生一切事物。对这些主张都可以像破除大自在天生万物那样去进行破除。</p><p>　　又，有一些人的主张是偏邪的，认为《吠陀》之声是永恒的，可以成为衡量是非的标准，可以诠释一切事物。声论师认为一切声音都是永恒的，声显论认为，声音本来就有，只是处于隐密状态，待条件具备后就显现出来。声生论认为，声音本来没有，待条件具备后才能产生。声音显现或产生以后才能起诠释作用。这些主张都是错误的，为什么呢？婆罗教认为《吠陀》之声可以解释一切事物，应当是非永恒的，和其他的声音一样。其它的声音也应当是非永恒的，因为声音之体和瓶、衣等一样，需要很多条件。</p><p>　　顺世论和胜论认为，地、水、火、风的父母极微是真实的，而且是永恒的，能够产生粗大的东西，所生的粗大东西仍依父母极微而有，虽然是非永恒的，而本体却是真实的。这种主张是错误的，为什么呢？他们所说的极微如果有方分的话，就如蚁行一样，其体应非实有。如无方分，就如心法和心所法一样，不应当聚合而生粗大的东西。既然能生果，就像所生果一样，怎么能说极微是永恒的呢？而且，所生之果既然仍依父母极微而有，就应当像极微那样，不应当称为粗大的东西。这种结果之色法就像极微那样，不应当被眼、耳、鼻、舌、身五种感觉器官所缘取，这就违背了顺世论和胜论本派的主张。</p><p>　　如果说极微合成的东西有微量、大量等不同现象，不是粗大的东西，又像粗大的东西，所以定为色根之所能取。他们所说的果色就如同父母极微一样，就应如父母极微那样没有粗量之合，或者说极微也是粗量之合，就如粗大东西一样，因为与粗果色其处是没有区别。如果认为果色普遍地存在于父母极微之中，因并非一个，可以称为粗大的东西，即此果色，其本体不应当是一个，由于所在因父母极微处各别的缘故。既然是这样，这种果色还不能称为粗大的东西，所以还不能被感觉器官所缘取。如果果色是由很多细分组合而成的粗大东西，因由很多极微组合而非细分，就足够成为根所缘的境，还要果色做什么？既然是由很多细分合成，就不应当称为实有，所以你们的主张是前后矛盾。</p><p>　　如果果色与因极微都有质碍，就不应当互相涉入，如二极微都有质碍不得互相涉入一样。如果认为果和因之体相受入，就如沙接受水、药入镕铜一样，谁能承认沙能受水、铜能受药呢？水入沙，只能入于沙之间的空处，并不入于沙的极微之中，药入铜也是这个道理。所以水入于沙，沙不增，药入于铜，铜不长，并不能引起沙和铜的变化。水和沙、药和铜并非一体，也非永恒。又，一个粗大的东西，如果其体是同一的话，得其一部分应得整体，因为彼此同一，整体如部分一样。如果你们不承认这种说法，在道理上讲不通；如果你们承认这种说法，就违背世间事实。所以你们的主张往前进或往后退都不能成立，只不过是随顺有情众生的虚妄执着而已。</p><p>　　然而，外道种类虽然很多，认为客观物质世界实有的主张不过有四种：一认为“有法”与“有”等性，其本体肯定同一，如数论等。这种主张是错误的，为什么呢？因为不能说一切事物都是“有”性，如果一切事物都是“有”性，其本体就无差别了。这就违背自性<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>(萨埵、剌阇、答摩)和所生“我等”二十三法体相各异的现象。也违背世间诸法各有差别性。而且，如果色等就是色等之性，色等就应当是没有青、黄等色之别。</p><p>　　二认为“有法”与“有”等性，其体肯定相异，如胜论等。这种主张是错误的，为什么呢？因为不能说除了“大有”之外的任何事物都不存在“有”性，如果事物已经灭除没有了，应如兔角一样及体也就没有了。这就违背你们实句义等自体实有的理论，也违背尘世间眼见万物存在的现象。而且，如果说色等并非色等之性，就应当像声等一样，就不是眼等所缘的境了。</p><p>　　三主张“有法”与“有”等性，既同一又相异，如耆那教等。这种主张是错误的，为什么呢？同一和相异和前述的同一、相异有同样的过错。同一和相异是互相矛盾的，本体应当有区别，如果认为同一和相异之本体相同，同一和相异都不能成立，不能说一切事物都同一本体。或者说同一和相异都应当是虚假而非真实的，人们妄执为实，从道理上来讲肯定不能成立。</p><p>　　四主张“有法”与“有”等性既不同一又不相异，如邪命外道等。这种主张是错误的，为什么呢？因为若说非一，就会犯前述相异之过；如果说非异，就会犯前述同一之过。说非一非异是否定呢，还是肯定呢？如果是肯定，不应说非一非异；如果只是否定，应当是无所执着。如果是既有否定又有肯定，这就是互相矛盾。如果说既非肯定又非否定，这是不符合佛教义理的戏谑之言。又，非一非异违背人所共知的同一物或相异物，也违背邪命外道本派所说色等事物肯定实有的主张。所以上述内容只是矫诈之言，又苟避过。各位聪明人不要误会而承认上述主张。</p><p>　　小乘佛教所说的离识之外的色法等为什么不存在呢？因为小乘佛教所说的色法、不相应行法和三种无为法，从道理上进行推论是不存在的。而且，小乘佛教所说的色法共有二种：一是有对，由极微组成的东西；二无对，不是由极微组成的东西。</p><p>　　有对色法肯定不是真实存在，因为组成色法的极微就不是真实存在。如果极微有质碍的话，就应当像瓶等那样是虚假而非真实的。如果无质碍，就应当像心法、心所法、不相应行法和无为法那样，怎能聚集成瓶、衣等东西呢？又，各种极微如有方分，一定可以分析，这就不是真实存在。如果没有方分，就如心法等那样，怎能和合承光现影呢？太阳刚出，照耀柱子等时，东边承光，西边发影。既然是承光发影的处所不同，小乘佛教所说的极微肯定有方分。又，眼见或手触墙壁等东西的时候，只能见、触这边而不是那边。既然和合物就是各种极微，所以这种极微肯定有方分。又，各种极微在其住所必然有上、下、东、西、南、北之分，不然的话，就不会有和集之义。如果极微互相涉入，不应该形成粗大的东西，由此可见，极微肯定有方分。主张存在有对色法就是各种极微，如果没有方分的话，就应当是没有障碍和间隔。如果没有障碍和间隔，就不是障碍有对。所以，你们小乘佛教所主张的极微肯定有方分。因为有方分，就可以分析，肯定不是实有。所以，认为有对色法实有的主张不能成立。</p><p>　　现在试问你们大乘唯识：眼等五识不就没有所依之根和所绿色法了吗？论主答：虽然不能说没有色法，但是色法是识变现的。第八识生起时，由于阿赖耶识中储藏的种子变现，好像是眼等五根和色等五境之相在显现，眼等五根是五识所依，色等五境是五识所缘。然而，眼等净色根并不是现量所得，由于能够发识推论为有，这仅仅是功能，并不是实有客观物质造作而成。既然客观有对色法在道理上不能成立，就应当只是内识所变现。眼等五根发眼等五识，根是识的所依，眼等五根生眼等五识。眼等五识以外的客观外境从道理来讲是不存在的，应当承认是自己的识变现的，这就是所缘缘。识变现的色法之相好像是自己的识，你们小乘佛教认为这就是识的所缘缘。</p><p>　　非但所缘缘有能生的条件，就是因缘、等无间缘、增上缘也有能生的条件，不能把因缘等也称为此识的所缘缘。</p><p>　　眼、耳、鼻、舌、身五识在了别色、声、香、味、触的时候，只缘和合相，好像是五识上有和合的色等形相一样。并不是说和合相不同于各种极微有真实的自体，对和合相进行分析时，能缘假和合相识肯定不能生起。这种和合相既然不是真实的存在，所以不能说和合相是五识所缘，因为不能说第二月(即水中月)等虚假的东西能生起五识。各种极微聚合在一起不能成为前五识的所缘，因为五识上没有极微相的缘故。不能说各种极微有和合相，因为各种极微在没有和合时并无和合相。也不能说和合时的极微与不和合时的极微体相不同，所以和合时与不和合时一样，色等极微都不是五识所缘的境。</p><p>　　有人认为：色等单体的极微，在没有和合聚集以前之时不是五识所缘的境，互相黏合在一起时，有粗大形相产生，是五识所缘的境，这种粗大形相是实有的，是五识的所缘。这种主张是错误的，极微和集在一起与未和集时本体相状是一致的。瓶、茶瓯等东西和组成它们的极微是一致的，所以缘瓶等东西的识与缘其茶瓯的识应当是没有差别的。组成和集相的每一个极微都应舍除其微圆相状。缘瓶粗相之识并不等于缘极微细相之识，不能说缘色境之识就是缘声境之识。如果是那样的话，一种<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>应缘一切外境。承认有极微还有这样的错误，更何况不承认识之外的真实极微呢？由此可知，自己的心识所变现的似色等相是所缘缘。人们见到的影相，托识而生，心识生起时带彼相起。</p><p>　　然而，识变现事物时，随其相分形量大小，其能变识顿现此相，并不是首先变现很多极微，然后和合成一种外境。因为有人主张粗色有其实体，佛说极微是为了让这些人消除执着而对极微进行分析，并不是说各种事物真的有极微。诸瑜伽师没想对粗大色相渐次除析，至不可除析时，虚假施设有极微，这种极微虽然有方分，但不可分析。如果再加分析就是空，不能再称之为物质，所以说极微是色法的穷尽。由此可见，各种有对色法都是识变现的，并不是极微和合而成。</p><p>　　其余的无对色和有对色是同类，也不是实有，因为是无对，就如心法和心所法一样，肯定不是实有色法。各种有对色法显现有色法之相，从道理上进行推究，尚且是离识而无，更何况无对色并非显现色法之相，怎能说是真实色法呢？</p><p>　　表色和无表色岂不都是实有吗？这不是实有，为什么呢？身表色如果是实有，其性如何呢？如果说是形体，就不是实有，因为这种形体是可以分析的，长等极微是不存在的。如果说是变动，也不是实有，刚生即灭，没有变动的意思。有为法的毁灭，不需待因，待因之灭应当不是灭。如果说有的色法既非青、黄、赤、白等的显色，又非大小方圆等的形色，而是由心所法引生起来的此色，能够牵动手等，故称身表业。这种看法道理上讲不通，这如果是变动，如前所破，如果是动因，应当是风大，设许是风，不应名表，无表示故，而且，触法不应当通善性和恶性。非是显色及香和味了，因它们都是无所表示的，应当如触那样去理解。所以身表业肯定不是实有。</p><p>　　然而，以心为因，由识变现手等色相，生灭相续，往趣余处，好像是有动作，表明此心，假名身表，并不是离心识之外，另有一法名身表的缘故，安立假名称为身表业。语表也没有真实的语性，一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>之声不能表示一定的意思，多念相续声不是真实的存在。客观有对色法，前面已经破斥。然而，由于心的缘故，识的变现好像是声，生灭相续好像是有，安立假名称为语表，在道理上并不违逆。</p><p>　　表色既然确实是空无，无表色怎能是实有呢？然而，依据最极殊胜的思愿，誓修一切善，誓断一切恶，以此<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之分，假立无表色之名，在道理上并非违逆。散无表色依据发殊胜身、语业善恶思种子的增长之位而安立；定无表色依据<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>之中防止身、语之恶，由现行思而安立，所以是假有。</p><p>　　外人问难说：释迦牟尼佛在经中说有身、语、意三业，现在否认身、语二业，这不是违背佛经吗？</p><p>　　论主回答说：我并没说身、语二业是无，只是说它们不是色法。发身之思是身业体，发语之思是语业体，前二审虑决定思，与意相应发意之思称为意业。发起身、语之思于境转，并造作于心，此称为业，身、语行是审虑、决定之思所缘所引发，因为能够产生苦、乐和异熟果，故亦称为道。所以，前述七种业道也以思为其自性。或者身表和语表由思引发，所以假说为身业、语业，或身语二业亦是思所游履处，故称业道。由此可印，实际上并无客观外境色法，只有内识变现，好像是外在的色法产生一样。</p><p>　　心不相应行法也不是实有，为什么呢？心不相应行法的得、非得等并不像色法、心法以及各种心所法那样体相可得，离开色法、心法和各种心所法，无其作用可得。由此可见，心不相应行法肯定不是实有，只是色、心等法的分位而假立。这肯定不是有异于色法、心法、心所法的真实本体及作用，如色法、心法等可以是五蕴所摄，或者并非由心法、心所法以及色法、无为法所摄取，就如毕竟无那样肯定不是实有。或者说心不相应行法并不由其余的实法所摄取。所以，心不相应行法像其它虚假事物那样并非实有其体。</p><p>　　论主问：人们怎么知道得、非得不同于色法、心法等有真实的本体和作用呢？</p><p>　　外人答：因为佛经说过，如说就像补特伽罗成就善和恶那样，佛教<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>成就十种无学法。佛经还说凡夫不成就佛教圣法，诸阿罗汉不成就烦恼，成就就是“得”，不成就就是“非得”。</p><p>　　论主批驳说：佛经没说得、非得不同于色法、心法等有真实的本体和作用，所以你们以经说为证不能成立。佛经又说转轮圣王成就七宝，岂不就是成就他身有情和非情吗？如果你们救说轮宝可以任意转动而假说成就，对于善、恶之法为什么不允许认为有真实之“得”呢？如果你们认为七宝存在于现在而假说成就，怎么知道所成善、恶等法离现在而有呢？离开现在的真实事物，从道理上来讲是不存在的，因为现在肯定有善性种子等。</p><p>　　又，“得”于事物当中有什么殊胜作用呢？如果说能生起各种事物的话，不仅能生起有为法，也应当生起无为法。按照你们的意见，不仅无为法不能生起，一切无情识的东西也应当是永不生起，未得之法和已失之法也应当是永不生起。如果与物俱生之“得”为起因的话，人们所说的有为生和无为生便无作用。而且，如果事物具有善、恶、无记之“得”，事物应一切时顿生善、恶、无记三性。如果还需要其它原因，“得”便没有作用了。如果“得”对于事物是不失之因，有情众生由“得”而成就善、恶、无记三性之事物，各种可成之法离不开有情众生，如离有情众生，事物确实不可得，所以“得”于事物之上皆无作用。因为“得”实际上是不存在的，“非得”也是不存在的。但是，随顺有情众生可以成就各种事物，从不同的方面虚假设立三种成就：一种子成就，二自在成就，三现行成就。与此相反即为不成就。不成就(非得)的种类虽然很多，然而<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>见道所断种子，还没有达到永远损害的程度，以此方便假立非得，称为异生，因为于各种佛教圣法还未成就。</p><p>　　论主问：又，怎么知道有区别于色法、心法等的同分呢？</p><p>　　外人答：因为佛经说过，如佛经说：这是天神同分，这是人同分等等。</p><p>　　论主批驳说：佛经并没有说过有区别于色法、心法等的真实同分，是以你证明实有同分那是绝不能成立。若因同智、回言而认为有真实同分的话，则野草、树木等应当有同分。而且，若于同分而起同智、同言，在同分上应当有另外的同分，既然不是这样，这是为什么呢？如果认为同事、同欲而有真实同分的话，在道理上也讲不通，因为宿业习气而起同事、同欲，为什么主张另有真实的同分呢？显然是依据有情众生身、心相似的分位差别，虚假设立同分之名。</p><p>　　论主问：又，怎么知道有不同于色法、心法等的真实命根呢？</p><p>　　外人回答说：因为佛经说过，如佛经说过寿、暖、识这三种。应当知道，命根就称为寿。</p><p>　　论主批驳说：佛经并没有说过有不同于色法、心法等的真实寿体，所以你以经中所说，证明实有寿体，这是不能成立。前面已经讲过色法不能离开识而单独存在，由此可知，离识之外不可能另有命根。而且，如果命根区别于真实的识而有，就应当如受、想等那样命根不是实有。</p><p>　　外人问：如果是这样的话，为什么佛经说有寿、暖、识三种呢？</p><p>　　论主回答说：从意义上的区别说有三种，寿是阿赖耶识的种子，暖是阿赖耶识的相分色法身根，识是现行识。这就像四正断一样，从意义上区分为四种，其本体都是<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。</p><p>　　外人问：住<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>位时，寿和暖应当是没有，这不就是佛经所说的识不离身吗？既然是识不离身，为什么称为无心位呢？</p><p>　　论主答：在无心位只是灭除了六转识或七转识，并没有灭除阿赖耶识，对于阿赖耶识之因，将于第三卷详细解说。阿赖耶识足可以成为三界、六趣、四生所依的本体，因为它普遍存在于三界一切位中，永恒相续不断，又能引生异熟果的缘故，不需要另外主张有真实的命根存在。然而第八识阿赖耶识是命根的所依，以名言种子为其因缘，只有所生阿赖耶识中储存的种子才能称为命根。由于先世之业力所引持身之差别功能，使色、心等住于世间一定的期限，依此功能假立命根之名。</p><p>　　论主问：又怎么知道二无心定、无想、异熟区别于色法、心法等而实有自性呢？</p><p>　　外人答：如果没有真实的自性，就应当是不能遮蔽心法和心所法，使之不能生起。</p><p>　　论主责难说：如果在无心位另有区别于色法、心法等的实法，能遮蔽于心，称为无心定，就应当是在无色法时，另有区别于色法、心法等的实法，能够障碍色法，称为无色定。既然不是这样，此三无心位说有个实法遮碍于心，这是为什么呢？而且，遮碍心法，哪里需要实法呢？</p><p>　　说一切有部认为，极微实有，堤塘等和合色法虽然是假有，也能够起到遮蔽水的作用。在修练禅定的时候，由于禅定的殊胜力量，可以暂时止息粗显的心法和心所法。发大誓愿遮蔽心法和心所法，使心法和心所法逐渐变得细小和微弱。至微微心阶段，就可以熏习阿赖耶识，形成极其强盛的厌恶心法和心所法的种子，由于这些摧损压伏心法、心所法的种子，使粗显的心法和心所法暂时形不成现行，依据这种无心分位，假立无心定和灭尽定。厌心功能的种子是禅定的体性，因为种子是善的，所以禅定也称为善。</p><p>　　在修练无想定以前，为了得到无想果，所以熏习形成的种子，感招第八识阿赖耶识。依此本识，使粗显的六转识等形不成现行，于此无心分位虚假设立无想。依据异熟而立，故得异熟之名，实际上并不是真实的异熟。所以，二无心定(无想定、灭尽定)、无想、异熟三种都不是实有。</p><p>　　论主问外人说：又怎么知道各种有为法之相区别于色法、心法等而有真实自性呢？</p><p>　　外人回答说：因为佛经说过，如佛经说“有三种有为之有为相”等等。</p><p>　　论主责难说：佛经并没有说过有为相区别于色法、心法等有真实的自性，因此你以此说证明有为相的实有，无论怎样是不能成立的。不能认为属格就表示不同之体，因为色法、心法之体就是色法和心法。不能说能相(生、住、灭三有为相)肯定不同于所相(色、心等有为法)，就如不能说坚、湿、暖、动与地、水、火、风不同一样。如果有为法之生灭相区别于有为法所有相的色、心法本体，无为法之相本体应区别于无为法所有之相。</p><p>　　又，如果生、住、异、灭四相本体同时具有，应当是一切时候都一起同时发生作用，如果你们因此又说：正因生、住、灭三相作用互相违逆，故不能顿时生起，则作用之本体也应互相违逆，怎么能一体同时具有呢？而且，住、异、灭的作用不应当同时具有。能相、所相之体本来同时具有。作用也应当是这样，因为作用没有另外的特性。如果说作用还需要因缘，所需要的这种因缘应当是非是本有的。而且，外人所主张的待缘而有的生、住、异、灭，因是待缘而有，所以对于色、心等的有为诸法就没有作用了。所相的色、心等法虽然是过去、现在、未来三世恒有，然而需要生等有时与法相合。无为法也应当有生、住、异、灭，因有为法和无为法为生等相合之因，彼此之间并非不同。</p><p>　　又，前世和来世并非现在，亦非常住，应当像空中花一样，不是真实的存在，“生”是有，怎能是未来呢？“灭”为无，不应当是现在，“灭”如果不是无，“生”应当不是有。而且，“灭”违逆于“住”，怎能是同时呢？“住”不违逆于“生”，怎能是异世呢？所以，正理师的主张进与退都不合道理。但是，由于有为法的内因和外缘之力，原来没有，现在有了(生)，暂时之有又变无(灭)，像这样的说明有为，不过是表明与不生不灭的无为法不同而已，由此证知有为四相是假立的，所以说虚假设立生、住、异、灭四相。原来没有，现在有了，有之位称为“生”；生位暂停，称为“住”；“住”位前后有别，又立“异”名；暂时之有变为无，无的时候称为“灭”。因为生、住、异都是有，都在现在，“灭”是无，所以在过去，怎么可如你们所说生在未来，灭在现在呢？</p><p>　　外人问：“灭”如果是无的话，怎能与有为法体作相呢？</p><p>　　论主答：以“灭”用以后的无为相，这有什么过失呢？“生”表示暂有之法，原来没有。“灭”表示有法之后的无。“异”表示这种事物不是一成不变的。“住”表示这种事物暂时有其作用。所以，生、住、异、灭四相，对于有为法来说，虽然都称为表相，然而这些表相是不同的。</p><p>　　这是依刹那而虚假设立四相，正量部主张一期立四相，最初之有称为“生”，最后之无称为“灭”，产生之后的相似和相续称为“住”，这种相续的变化称为“异”。所以，生、住、异、灭四相都是虚假而立。</p><p>　　论主问外人：又怎么知道有不同于色法、心法等起真实诠表作用的名、句、文身呢？</p><p>　　外人回答说：因为佛经说过，如佛经说：“<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>时得希奇少有的名、句、文身。”</p><p>　　论主责难说：佛经没说不同于色法、心法等实有名、句、文身，所以你们想以此经作为证明名、句、文身为实有，是不能成立。如果名、句、文身异声而实有，就应当如色法等那样，实际上不能诠释。如果说声音能够产生名、句、文身，这种声音一定要有音韵屈曲，这足以起能诠的作用，何必再用名、句、文身呢？如果认为声上音韵屈曲就是名、句、文身，异声而实有，则人们见到色处上的形量屈曲也应当是区别于色处另有的真实本体。如果认为声上音韵屈曲，像弦管声那样不能起诠释作用，则此语言音声就应当像弦管声音那样，不必要另有名、句、文身。又谁说过声上屈曲肯定不能起诠释作用呢？</p><p>　　外人救说：如果声音能够起诠释作用，风声、铃声等应有诠释作用。</p><p>　　论主反驳说：风声、铃声等如彼所执，不能另生真实的名、句、文身。</p><p>　　外人又申救说：如果认为只有语声能生名、句、文身，为什么不允许只有语声能起到诠释作用呢？有什么理由肯定知道，能起到诠释作用的就是语声呢？</p><p>　　论主诘难说：你经部师以何理由决定了知能诠表意义的即是语声？你正理师又怎么知道区别于语声另有一个实有的名、句、文身为能诠呢？语声不异于能诠的名、句、文身，人和天神都是知道的，主张能诠异于语声，像如此愚蠢的人除为<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>所怜爱之外，没有任何人。然而，依据语声分位虚假设立名、句、文身，名身诠释自性，句身诠释差别，文身就是梵文字母，是名身和句身的所依。名、句、文身虽然离声而无另外的本体，由于名等之假和声上实有之间的区别，名、句、文身不等于声，由于法无碍解和词无碍解所缘的境有区别，声和名、句、文身的五蕴、十二处、十八界的所摄也各不相同。而且，依此娑婆国土以音声为教体而言，所以说名、句、文身依声而假立，并不是在一切处所都是这样，在其余的佛土也依据光明、妙香、味等，假立触、思、数上的名、句、文身。</p><p>　　有人主张，随眠不同于心法和心所法，属于心不相应行法。这种主张也不合理，因为随眠称为贪、嗔、痴，如现行的贪、嗔、痴就不属于心不相应行法。有入主张有另外的心不相应行法，根据前边讲的道理，这种主张也应当否定。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第二",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第二</strong></p><p>　　认为各种无为法离开色法、心法等肯定实有，这在道理上是讲不通的。而暂且，先来决定实有的事物，简略来讲共有三种：一通过因明现量所认识的事物，如色法、心法等。二现见受用的东西，如瓶、衣等。以上两种东西，世间共知是有，不须比量成立。三有作用的东西，如眼、耳、鼻、舌、身五根，由于它们具有各自发识的作用，经过推理知道有根。无为法既不像前两种那样世间共知而肯定实有，又不像眼、耳、鼻、舌、身那样，有其作用。假设允许有其作用，就应当是非永恒的，所以不能认为无为法肯定实有。然而，各种无为法是佛和菩萨所知的境界性，或者由于色法、心法等，甚至为我、法二空所显的真如性。所以各种无为法如色法、心法等一样，不应当认为离开色法、心法等以外，另有真实的无为法之性。</p><p>　　又，虚空无为、择灭无为、非择灭无为中，虚空无为的自体是一个呢，还是多个呢？如果是一体的话，虚空无为就应当遍一切处。如此的虚空无为应能容受色法等，应随能合法，虚空无为之体应成多个。又因为空体若是只有一个，则一处色合，和余处色就不合。如果不是这样的话，色法等应互相遍，此处色合时，余处色亦合，此处色即余处色。如果说虚空无为不与色法等合，就应当像择灭无为和非择灭无为一样，不容受色法等。</p><p>　　又，色法等之中有没有虚空？如果说色中有虚空，体应相杂，如果色体中没有虚空，虚空就不应当遍一切法。不遍一切法，就不应当是无为法，而是有为法。如果择灭无为之体是一的话，五部九品惑中一部一品结法断时，其余的四部八品惑都应当得到择灭。如果非择灭无为之体是一的话，一法由于缺缘而不生时，一切法都应当得非择灭。因为你们主张，三种无为法之体各一，从道理上来讲应当有这样的过失。。</p><p>　　如果虚空、择灭、非择灭三种无为法之体各是多个，就应当是有为法，便有品类之分，就如色法等一样，不是真实的无为法。虚空无为之体是多个，应当是非遍非容受。色中无虚空是非遍，无色处有虚空是非容受。大众部等主张除开心法、心所法以外，实有无为法。根据前边讲的道理，也应当进行破斥。而且，认为诸无为法非六因所得，应承认它是无因果的，应当如兔角一样，不是异于心法等之外而有其它什么实在的无为法。</p><p>　　然而，佛经说有虚空等各种无为法，简略来说有两种：一依识变现，虚假施设而有，听闻佛、菩萨说有虚空无为等名，随此名后起分别之心，有虚空无为等相。过去曾听说过虚空无为等，现在再次听说，由于一再的熏习之力，心等生起，缘虚空无为等时，便似虚空无为等相显现。所显现之相，前后相似，没有改易，假说为永恒。</p><p>　　二依据法性虚假施设而有。意谓我空、法空所显真如非有、非无、非亦有亦无、非非有非无，既不能想，又不能说，与一切事物既不同一，又不相异等。因为这是事物的真理，所以叫做法性。因为这种真如不受任何障碍，所以叫做虚空无为。由于无漏慧的拣择力，灭除了各种杂染，最终证得，所以称为择灭无为。不用<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的拣择力，本性清净，或由于缺缘所显现的真如，称为非择灭无为。灭除一切苦、乐感受所得的真如称为不动无为。思想和感受都不运行的真如称为想受灭无为。虚空、择灭、非择灭、不动、想受灭五种无为法，都是依据真如虚假设立，所以真如也是虚假施设，其体是非如非不如。</p><p>　　为了驳斥真如空无的主张，所以要说有；为了驳斥化地部定有的主张而说空。不能像一说部那样认为真如是虚幻的，所以说真如是实。真如之理不是虚妄的，所以称为“真”；不是颠倒错误的，是永恒的，所以称为“如”，即于此理“假名真如”。唯识不像化地部那样，认为离开色法、心法等以外，有真实的常住之法称为真如。所以，各种无为法不一定是实有。</p><p>　　外道和小乘所主张的各种事物，不同于心法和心所法，并非实有，因为它们是所缘取的对象，如心法和心所法的相分那样。你们那能缘取的心法和心所法，也不能缘取心外的色法等，是能取(见分)的缘故，如缘取心法和心所法的相分。因为各种心法和心所法虽说是依他起性，也如虚幻事物一般，并非真实而有。为了遣除虚妄执着心法、心所法以外实有外境的主张，而说只有识。如果执着唯识真实而有，就如妄执外境实有一样，这也是一种法执。</p><p>　　然而，各种法执简略来说，共有两种：一是俱生，二是分别。俱生法执从无始以来，由于虚妄熏习的内在因力，永远与身同时具有，不需要待于外在邪教思想的熏陶和内在思维的错误识别，很自然地发生作用，所以称为俱生。俱生法执又分为两种：一常相续。在入无漏圣道以前，第七识末那识缘第八识阿赖耶识，起自心中影相，认为这是实际存在的事物；二有间断。当第六意识或总缘五蕴、十二处、十八界时，或别缘蕴、处、界时，认为起自于心中的影相是实际存在的东西。这两种法执微细，难以断除。在见道以后的十地中一再修行，地地别断，由于殊胜的法空观，才能断除。</p><p>　　分别法执不仅由于内在因力，也由于外部条件，并不是与身同时具有，需要外在的邪教和自己内心的错误识别，然后才能生起，所以称为分别。这种法执只在第六意识中存在。分别法执也有两种：一由于小乘所说的五蕴、十二处、十八界之相，对起自于心的影相，进行识别计度，认为是实际存在的事物；二由于数论外道所说的自性以及胜论所说的实句义等相，对起自于心的影相进行分别计度，认为是实际存在的东西。这两种法执粗显，容易断除，入初地<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地时，观见一切事物的法空真如即能断除。</p><p>　　这样所说的一切法执，认为心外之法或者是有，或者是无，由于一切事物都是心识所变，都是因缘和合而生，所以认为自心所变的内法，一切皆有。因此法执都是把自心所显现的假法误认为实有。然而，虚假法相都是因缘和合而生，所以是如幻之有。因为他们所说的实法是由于虚妄计度造成的，所以肯定不是有。所以释迦牟尼佛说：“<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>应当知道，各种识所缘的对象，都是识变现的，都是依他起性，皆如虚幻事物等。”</p><p>　　这样，外道和小乘所说离识之外的我、法，都不是真实而有，所以心法和心所法肯定不能用外境色法等作所缘缘，因为所缘缘必须依赖实有本体。现在，他身的心法和心所法不是自身之识的亲所缘缘，就如不是所缘的对象那样，因为由他身所摄取的缘故。同属眼识一聚的心所法也不是亲所缘，因为自体相异，如其余的眼根等，不是所缘取的对象。由此可知，客观事物实际上是不存在的，只有识变似我、法。所以佛经的偈颂这样说：“就如愚者所识别的那种外境一样，实际上都是不存在的，由于习气扰乱污浊之心，所以好像是外境在产生。”</p><p>　　胜论和小乘佛教犊子部等这样申难：如果没有离识之外的真实我、法，似事之假也应当是不存在的，因为假必须依赖真事、似事、共法而成立。如果有真火(真事)，有似火(似事)，人有猛、赤(共事)，就可以假说此人为火。又如假说牛、狗等，应当知道也是这样。</p><p>　　外人申难说：我、法如果没有的话，依据什么假说呢？因为没有假说，识所变的似事也不能成立。外境既然是无，如何说心似外境转呢？</p><p>　　论主反驳说：这种申难是不合道理的，离识之外的我、法(真事)前边已经破斥了，依据同异句义和实句义假说火等，都不能成立。依同异类假说，其理尚且不能成立，因为猛、赤等属性不是类有。如果没有猛、赤共法之德(属性)的人类而假说彼人似火，则也应当于水等中假说火等之名。如果认为猛等虽然不是类德，而又不相离，如人之类必与火德猛、赤等法不相离，所以可以假说，这也不对。现见人类猛等属性也有互相分离的现象。人类既然没有火的属性，又火的属性又失其类的互相分离，然而对于人而假说火等，由此可知，假说不一定要依类而成立。</p><p>　　依实而立假说，道理上也不能成立，因为猛、赤等别性不是共同而有。猛、赤等属性既可以在火，又可以在人，其体不一，所依也不相同。无共法而假说，就犯如前面把水称为火那样的过失。如果认为人、火之德相似故可假说此人似火者，在道理上也讲不通。因为只可说火在人，并非在德，只能说人似火，而不能说德似火。由此可知，似事之假不一定要依真事而立。</p><p>　　又，认为似事之假必须依真事而立，这也不合道理。真事是事物的自相，都不是认识似事之假的智慧和诠释所缘的境界。所以认识似事之假的智慧和诠释不能认识事物的自相，只能认识各种事物的共相。也不是离开假智、诠的共相以外另有方便善巧，格外施设一个自相，说为假智、诠的所依。然而认识似事之假的智慧和诠释必须依赖声音而生起，没有声音的地方便没有假智、诠。能诠之名和所诠之法都不是事物的自相。由此可知，假说决不依真事而立。不依自相说假，只依似事而说。似事是在自相之上增益共相，并不是真实有相。声音依据增益的似相而转，所以不能说似事之假必依真事。所以外道和小乘的非难是不合道理的。</p><p>　　然而，依据一切事物都是识变现的道理，对治遣除众生妄执的真实我、法，只有随顺有情众生而假说我、法。所以《厚严经》的偈颂这样说：“为了对治遣除愚者所妄执的真实我、法，所以依据一切都是识变的道理，假说我、法之名。”</p><p>　　识所变相虽然无量，而能变之识只能区别为三类：一异熟，即第八识，此识虽有多位，“异熟”之性最多，故称异熟识；二思量，即第七识，因为该识永起审思作用；三了境，即前六识：眼、耳、鼻、舌、身、意，因为这六识能够了别粗相外境。颂中“及”字表明把前六识合为一类。</p><p>　　这三类都称为能变识，能变有二种：一因能变，即第八识中的等流习气和异熟习气。等流习气由前七识的善、恶、无记三性现行熏习，使之产生和增长。异熟习气由前六识的善、恶现行熏习，使之产生和增长。二果能变，由于等流习气和异熟习气的因力，有八识变现产生的各种行相。以等流习气为其因缘，八识体性和相状差别而生，这就是等流果，因为果与因相似。异熟习气是增上缘，招感第八识中的酬引业力永恒相续，所以立异熟之名。异熟识招感前六识的酬满业力，因为前六识从异熟识生起，所以称为异熟生，不能称为异熟，因为前六识是有间断的。</p><p>　　前述异熟和异熟生称为异熟果，因为果的性质与因相异。异熟果虽通七识而有，初能变只是真异熟，它执藏我爱，持杂染种子，能变现善、恶业果，所以称为异熟识，这就是真异熟，并不是说一切识都称为异熟识。</p><p>　　虽然已经简略说过能变识的三名，还没有详细辨解能变识的三相。初能变第八识之相如何呢？</p><p>　　《唯识三十颂》说：“初能变第八识阿赖耶识，又称为异熟识和一切种识。执受、处、了皆不可知，它又常与触、作意、受、想、思五心所一起活动(相应)。在苦、乐、舍三受之中，阿赖耶识是舍受，其性质是无覆无记。触等五心所的情形也是这样。它就像瀑流一样永恒不断，到阿罗汉阶段才能舍除。”</p><p>　　论说：初能变识，大乘和小乘都称为阿赖耶识，因为此识具有能藏、所藏、执藏三义。能藏、所藏意谓阿赖耶识与杂染互为因缘。执藏意谓有情众生妄执阿赖耶识为“我”。这就是初能变阿赖耶识的所有自相，因为自相摄持因、果二相为自体的缘故。阿赖耶识的自相分位虽然很多，但因藏识之名过失最重，所以要偏说。</p><p>　　因为阿赖耶识能够引生三界、六趣、四生等善、恶业之总报，所以称为异熟识。如果没有阿赖耶识，就没有命根、众同分等永恒相续生死的殊胜真实异熟果体。这就是初能变第八识的所有果相。此识的果相虽然有多位多种，“异熟”之名包括面宽，而且能够不共于其余的诸识，所以要偏说。</p><p>　　因为阿赖耶识能够执持各种事物的种子，令其不失，所以称为一切种识。除阿赖耶识以外的任何事物都不能普遍执持各种事物的种子，这就是初能变第八识的因相。此识因相虽然有多种，执持种子是它的特点，所以要偏说。初能变识的体相虽然有多种，简略来说只有自相、因相、果相三相。</p><p>　　对一切种识之相应当再加分别，此中什么叫做种子呢？就是第八识中直接产生自己果报的各种功能。种子与阿赖耶以及所生果报不同一，也不相异。阿赖耶识之体和种子之用，理应非一非异；种子之因和现行之果，理应非一非异。虽然是既不同一，又不相异，但种子是实有的。虚假事物如果是无的话，就不是因缘，而种子是产生事物的因缘，所以它是实有的。</p><p>　　安慧等诘难说：既然种子与各种事物既不同一，又不相异，就应当如瓶等一样是虚假的，而非真实。</p><p>　　论主批驳说：如果是这样的话，真如之体应当是假有。承认安慧等人的主张，就没有真谛了。但是，各类种子只依俗谛而实有，与真如是不同的。种子虽然依第八识之体而有，但它只是第八识的相分，而不是见分，因为见分永远缘取相分以为外境。</p><p>　　各类有漏种子和第八异熟识，其体没有区别，皆属无记性。由于因果具有善、恶、无记三性，所以也可称为善、恶、无记三性。诸无漏种子，并非异熟识性所摄，其因果都是善性，所以只称为善。如果是这样的话，《<a href=\"/fojing/yuqieshidilun/yuanwen.html\" class=\"keylink\" target=\"_blank\">瑜伽师地论</a>摄决择分》为什么说“二十二根都是异熟种子，都是异熟生”呢？这些无漏种子虽然称为异熟，并非无记性，其体并非异熟，由于所依识是异熟，故称异熟种。能依之识和所依之根，其性不同，如眼等识与所依眼等根。或者说无漏种子由熏习力转变成熟，与本种不同，所以立异熟之名。即转变后才能成熟，能够产生现行。因而它是善性所摄的异熟，并不是无记性所摄取的异熟。</p><p>　　护月等认为：“一切种子本来具有，并不是由于熏习而产生，熏习之力只能使种子增长。如《无尽意经》说：“一切有情众生，无始以来有种种界，就如恶叉聚一般，自然而有。”此中“界”就是种子差别之名。</p><p>　　《阿毗达磨经》又说：无始以来就有的“界”，是一切事物的所依。”此中“界”就是因的意思。</p><p>　　《瑜伽师地论》也说：“有漏无漏种子都是本来就有的，由于染、净熏习，使本有种子增长。由于有漏净、染的熏习，使原来本有的有漏种子增长。由于有漏净和无漏清净现行的熏习，使本有的无漏种子增长。”各有情众生从无始以来，其涅槃之法的一切种子都是具足的，如不达涅槃便缺三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>种子。像这样的引文确实很多，并非一种。既然有情众生本有五种姓之别，所以应当肯定存在本来就有的种子，不是熏习而产生的。</p><p>　　《瑜伽师地论》还说：“<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中的受苦者也能成就三无漏根，这只能是种子，并非现行。”而且，存在从无始以来展转流传下来的本有种子。由此证明，无漏种子本来具有，并不是由于熏习而生。有漏种子也应当是本来具有，由于熏习而增长，并不是由于熏习而产生。这样，就会使因果关系不相杂乱。</p><p>　　胜军、难陀等认为：种子都是由熏习而产生，所熏、能熏都是自无始以来而有，所以诸有漏种子也都是自无始以来而有。既然种子是习气的异名，习气必须经过熏习才能产生，如胡麻中的香气是由于花熏而生。如《多界经》说：“各有情众生之心，由于各种染污和清净事物的熏习，使无量种子集于其中。”《摄大乘论》说：“阿赖耶识内储藏的种子，肯定要有熏习。谷、麦等尘世间的种子，可能有熏习，也可能无熏习。”</p><p>　　又，名言熏习、色识熏习、烦恼熏习，包括一切有漏法的种子。既然这三种习气都是由于熏习而有，所以有漏种子必藉熏习而产生。无漏种子也由熏习而产生，因为说闻熏习是由于听闻从清净法界平等流出的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>熏习有漏种而产生的，此时有漏闻熏的种子是可以成为无漏出世心的因缘种子。有情众生原来的种姓差别，并不是由于无漏种子的有无决定的，只依烦恼障和所知障的有无建立。如《瑜伽师地论》卷五十二说：“在真如之境，如果有烦恼障和所知障的种子，称为不般涅槃法性。如果只有所知障种子，而无烦恼障种子，一部分立为声闻种姓，一部分立为独觉种姓。如果所知障和烦恼障的种子都没有的话，则立为如来种姓。”由此可知，原来的种姓差别都是依据所知障和烦恼障建立的，并非依据无漏种子的有无。人们所说的无漏种子，都是后天形成的，都是由于熏习而产生，并不是未熏之前的即有体性。</p><p>　　护法认为：有漏、无漏种子各有二类：一是本有，自无始以来，第八识异熟识中，自然而有产生五蕴、十二处、十八界的功能差别。释迦牟尼佛根据这种情况，说有情众生自无始以来有种种“界”，如恶叉聚一样自然而有。其它的引证详见前述护月所引。这就是本性住种。二是始起，自无始以来，由于现行的一再熏习而有，释迦牟尼佛据此说有情众生之心，由于各染净事物熏习的缘故，使无量种子积集其中。各论也说染净种子是由于染净事物的熏习而生，这些种子称为习所成种。</p><p>　　如果只有“本有”种子，前七转识就不应当与阿赖耶识互为因缘。如《阿毗达磨经》所说：“各种事物摄藏于阿赖耶识之中，阿赖耶识也摄藏于各种事物之中。阿赖耶识与诸法更互为果性，也常为因性。”这一偈颂的意思是说：阿赖耶识与前七转识永远展转相生，互为因果。</p><p>　　《摄大乘论》说：“阿赖耶识与杂染诸法互为因缘，如灯柱与火焰展转相烧，又如一束束的芦苇，互相依靠而安住。只有阿赖耶识与杂染诸法互为因缘，其余的因缘是不存在的。”如果种子不是由于熏习而生，为什么前七转识与阿赖耶识互为因缘呢？</p><p>　　不是由于熏习而使种子增长，即可称为因缘，因为不能说善恶之业与异熟果的因缘，只是它的增上缘。而且，佛还多处教诲，有的种子是由于熏习而生，都与“唯本有”之说相违背。所以“唯本有”之说与因果正理及佛的教诲皆相违背。</p><p>　　如果只有“始起”，有为无漏之法即无因缘，不应当产生。有漏法不应当成为无漏法的种于，因为不能说无漏种子生有漏法。如果允许这种理论成立的话，诸佛又要产生有漏种子，善等之法应当成为不善等法的种子。</p><p>　　分别论者虽然这样说过：“心性本来是清净的，由于受到客尘烦恼的染污，才称为杂染。离开烦恼以后就可以转成无漏，所以无漏法并不是无因而生。”</p><p>　　这里所说的“心性”是什么意思呢？若说是空理真如的话，空并不是心之因，永恒的事物肯定不能成为诸法种子，因为常法之体前后没有转变。如果说是心的话，就应当同数论说“大”等一样，其相虽有转变，其体永远同一。恶性、无记性之心也应当是善，如果同意这种主张，就应当与信等<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>所法相应。如果不同意这种主张，就应当是非善心体，此不善心等尚不名善，又怎能称为无漏法呢？既然是有漏善心称为杂染，如恶心等，其性并非无漏，所以不能成为无漏法之因，因为不能说善、恶等互为原因。如果有漏心性是无漏的话，无漏心性应当是有漏，因为在一性之中，其间的差别因缘就不存在了。</p><p>　　又，如果众生之心是无漏的话，众生位的无漏现行应当称为圣者。如果说众生之心，其性虽然无漏，其相有染，故不称无漏，就不会犯上述过错，则心(阿赖耶识)中储藏的种子也不会是无漏。你们的论为什么说有众生只得成就无漏种子呢？如果只有无漏种子，现行也应当是无漏，因为种子和现行的性质要相同。</p><p>　　然而《胜鬘经》说：心性的清净说明心空之理所显示的真如，因为真如是心的真实本性。或者说因为心体并非烦恼，所以称为其性本净，并非有漏心性是无漏，故称本净。因此应当相信，有的有情众生自无始以来有无漏种子，并不是由于熏习而生，而是自然而有，后至解脱分，由于修行熏习而使无漏种子增长，无漏法的生起以此为因，无漏法生起的时候，又经熏习形成种子。有漏法的种子，根据上述道理也应当知道。</p><p>　　佛的各种教诲当中，虽然讲到阿赖耶识中储藏的种子肯定有熏习，但没有肯定说一切种子都是由于熏习而生，哪能完全否定本有种子呢？然而，本有种子也是由于熏习而使其成熟，才能得到结果，所以内种肯定有熏习。其闻熏习并不是只有有漏法，听闻佛教正法也熏习本有无漏种子，使之展转增盛乃至产生出世之心，所以称为闻熏习。在闻熏习当中，其有漏性是修道所断，招感殊胜性的异熟，成为出世法的殊胜增上缘。无漏性不是所断除的对象，与出世之法正为因缘。这种无漏种的正因缘微细隐蔽，难以明了，有假借粗显有漏闻熏习性中，是无漏的殊胜增上缘，以方便善巧的方式说是出世的心种子。</p><p>　　依据烦恼障和所知障的存在程度建立种姓差别，以此显示无漏种子的有无。如果完全没有无漏种子，烦恼障和所知障永远不可灭除，这就立为非涅槃之法。如果只有声闻、缘觉二乘无漏种子，其所知障种子永远不能灭除，一部分立为声闻种姓，一部分立为独觉种姓。如果又有佛的无漏种子，烦恼障和所知障种子都可以永远灭除，这就立为如来种姓。所以由于无漏种子的有无，烦恼障和所知障有可断和不可断两种意思。然而，无漏种子微细隐蔽，难以了知，所以，以其具有的烦恼障和所知障显现种姓差别。不这样的话，其<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>有何各别的原因，而说彼障有被除灭和不被除灭的区别呢？如果认为这种区别自然而有，为什么不承认无漏法的种子本有呢？如果无漏法的种子本来都没有，则诸圣道永远不能得生。应当由谁除灭烦恼、所知二障种子呢？而你们为什么又说依障建立种姓差别呢？既然是这样，圣道肯定不能产生，如果你们说现在不生，当来可生，这也肯定不合道理。</p><p>　　然而，佛的各种教诲到处都说有本有种子，这都与“新熏”之义相违背，所以只讲种子“始起”不符合佛教理论和佛的教诲。由此应知，有漏法和无漏法的种子各有本有、始起二类。</p><p>　　然而，种子义简略来说有六种：一刹那灭，即有能生性的种子，其体必然是才生，没有间隙随即消灭，有殊胜功力，这才能够成为种子。此破永恒的无为法，因为常法没有转变，不可说有能生的作用。</p><p>　　二果俱有，意谓与所生现行果法俱时显现和合，这才能够成为种子。此破经量部等因果前后异时的主张，亦破上座部等心法因果肯定相离的主张。现行和种子异类，互不相违，于一身俱时现在，有能生的作用。并不像种子那样自类相生，前后相违，故不得俱时一身和合。因与果有俱和不俱两种，有俱者谓生现，不俱者生自类。虽有俱、不俱两种，而现在时有能生果法的因用，因为有自体。过去无因用，因体已灭。未来也无因用，因用未生，没有自体。依生现行果立种子名，为俱有。不依引生自类称为种子，所以只应当说与果俱有。</p><p>　　三恒随转，意谓要成长时，其性一类相续，至究竟位时，才能够成为种子。此破七转识，因为它们有变化有间断，与种子法不相应，这表明种子自类相生。</p><p>　　四性决定，意谓随顺因力，生善、恶等法的功能是肯定的，这才能够成为种子。此破说一切有部，他们主张善法等与恶、无记等为同类因，有因缘之义。</p><p>　　五待众缘，意谓需要其它条件的配合，功能殊胜，这才能够成为种子。此破外道主张自然而有之因，不需要其它条件的配合，永远顿生现行之果。或者此破说一切有部条件永远具有的主张。显示需要的条件并不是永远具有，所以种子并不是永远顿生现行之果。</p><p>　　六引自果，意谓色法种子只能引生色法现行果，心法种子只能引生心法现行果，这才能够成为种子。此破外道主张大自在天一因生万物之果，或破说一切有部等主张色、心等法互为因缘。只有阿赖耶识中具有这种功能差别，而且还要具有这六义，才能够成为种子，其余的不能成为种子。外种子如谷、麦等种，是识变现的，所以只能假立种子之名，并不是真实的种子。内、外种子，生近果、生正果名为生因。引远果、引残果，使之不致于立刻断绝，称为引因。</p><p>　　阿赖耶识中储藏的内种必须经过熏习才能生长，才能直接产生结果，这类内种是因缘性。外种的熏习或者是有，或者是无，是增上缘所产生的结果。必须以内种为其因缘，因为这是阿赖耶识共相种子所产生的结果。</p><p>　　依据什么意思立熏习之名呢？所熏、能熏各具四义，使种子生长，所以称为熏习。什么是所熏四义呢？一坚住性，从无始之始，直至究竟之终，一类之性，相续不断，能持习气，这就是所熏。前七转识及声、风等，性不坚住，所以不能成为所熏。二无记性，若法平等，无所违拒，能够容纳习气，这就是所熏。如果善、恶势力非常强盛，不能够容纳习气，所以不能成为所熏。由此可知，佛的第八净识，只是携带原来的旧有种子，并不是新近受熏。三可熏性，如果事物之体自在，不依他起，性非坚密，体是虚疏，能够接受习气，这就是所熏。心所法和无为法是依他起，体非自在，其性坚密，所以不是所熏。四与能熏共和合性，所熏和能熏的和合是相应的意思，所熏和能熏若处于同一时间同一处所，所熏之体非即能熏，也不相离，这就是所熏。经部师所说的前念识与后念识刹那前后，因为二者不相应，没有和合的意思，所以不是所熏。只有第八异熟识具此四义，能够成为所熏，心所法及余转识不能成为所熏。</p><p>　　什么是能熏四义呢？一有生灭，如果事物不是永恒的，能够发生作用，能够生长习气，这就是能熏。无为法前后没有变化，不能够生长作用，所以不是能熏。二有胜用，如果有生灭，势力增盛，能够引生习气，这就是能熏。第八异熟心、心所等，势力弱劣，所以不是能熏。三有增减，如有殊胜功用，可增可减，能够摄植习气，这就是能熏。<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>是<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>善法，无增无减，所以不是能熏。如果这是能熏的话，就不是圆满，因为诸佛就有胜劣<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>多少的缘故。四与所熏和合而转，如果与所熏处于相同时间相同处所，既不相即，又不相离，这就是能熏。并不是前后刹那及与他身能熏自识，因为二者不和合的缘故，所以不是能熏。只有前七转识及其心所法有殊胜的势用，可增可减，具此四义，可以成为能熏。</p><p>　　这样，能熏识和所熏识，俱时而生，俱时而灭，熏习的意思可以成立。使所熏习的种子成长起来，就如花香熏胡麻一样，所以称为熏习。能熏之识等，从种子产生的时候起，就能够成为现行之因，又熏习形成新的种子。旧种子、现行、新种子三法展转相生，因果同时，如焰柱生火焰，火焰生燋炷一般。又如一束束的芦苇互相依赖而立。不像经部师那样因果异时，而是因果同时，从理论上来讲推不倒。能熏产生种子，种子又生起现行，就如俱有因得士用果一样。种子前后，自类相生，就如同类因引等流果一样。俱有因和同类因对于结果来说是因缘性，除此之外的事物都不是因缘，假设称为因缘，应当知道，这只能是假说。这就简略说明了一切种子之相。</p><p>　　阿赖耶识的行相所缘是什么呢？是不可知的执受、处、了。</p><p>　　“了”即了别，也就是行相，因为识以了别为其行相。“处”是处所，也就是器世间，因为器世间是各有情众生的所依之处。执受有二种，各有漏种子和眼、耳、鼻、舌、身五根。一切有漏善等诸法种子，是指相、名、分别的习气。有根身意谓各种净色根和扶尘根。种子和根身都由识所执受，并摄为自体，识与它们共同安危。执受和处所都是所缘。由于阿赖耶识的因缘之力，自体生起时，内变为种子和根身，外变为客观物质世界。阿赖耶识以其所变为自己的所缘，因其行相依仗它而得生起。</p><p>　　这里所说的“了”，意谓第八异熟识在自己的所缘上有了别的作用，这种了别作用由见分所摄。</p><p>　　然而有漏识自体产生的时候，都像所缘、能缘之相显现。由此应知，那种与心王相应的心、心所法也是这样。似所缘相称为相分，似能缘相称为见分。如果像安慧和小乘佛教正量部所说的那样，心法和心所法没有所缘之相，就应当是不能缘自己所缘的境。或者应当是每一人之心能缘一切外境，因为自境如其余外境一般，其余外境也如自境一般。如果心法和心所法没有能缘之相，应当是不起能缘作用，如虚空等一样，或者说虚空等也是能缘。所以心法和心所法必有能缘、所缘二相。如《厚严经》说：“一切只起觉知作用的识，所觉的东西都是不存在的。能觉知的见分和所觉知的相分，都是自然而有。”</p><p>　　主张有离识之外的所缘外境，说外境是所缘的对象，相分称为行相，见分称为事，因为这是心法和心所法的自体之相。心法和心所法同所依同所缘，俱依一根，俱缘一境，行相相似。“事”虽然是多种，其相各不相同，识、受、想等相各有区别的缘故。领悟到离识之外没有客观外境的人们，则说相分是所缘，见分称为行相。相分和见分所依止的自体称为事，即自证分。如果没有自证分，心法和心所法自身应当是不能忆念，因为对未曾得之境必不能回忆。心法与心所法共同所依之根，所缘之相相似，行相各有区别，因为了别、领纳等的作用各不相同。“事”虽然是多种，其相各不相同，因为识、受等的体有差别的缘故。然而心法和心所法一一产生时，从道理上进行推论各有三分，就因为有能量、所量、量果的区别，所以相分和见分一定要有所依的本体，如《集量论》的偈颂这样说：“似境之相分是所量，见分是能量，自证分是量果。能量、所量、量果的本体是一识，所以这三种的本体没有区别。”</p><p>　　又，如果对心法和心所法再仔细分别，应当有四分，有前述的三分，另有第四分证自证分。如果没有证自证分，谁能证明第三分自证分的存在呢？</p><p>　　既然同是心分，应当是都能证知。而且，如果没有证自证分，自证分应当是没有量果，可是事实上，各种能量肯定要有量果。不应当把见分称之为自证分的量果，因为见分有时候由非量所摄。因此，见分不能证知第三分自证分，因为证知自体一定要依靠现量。</p><p>　　在这四分当中，相分和见分是外缘外，自证分和证自证分是内缘内。相分只是所缘，见分、自证分和证自证分通能缘和所缘二种。见分只能缘相分，其量或者是非量，或者是现量，或者是比量。第三自证分能缘第二见分和第四证自证分，证自证分只能缘第三自证分，不能缘第二分见分，如果允许第二分见分得缘，就要犯重缘之过，因为没有缘彼之用。第三分自证分和第四分证自证分都是现量所摄。所以心法和心所法由相分、见分、自证分、证自证分合成，具有所缘和能缘，没有无穷之过，并非相即，亦非相离，唯识的道理由此而成立。所以《厚严经》的偈颂这样说：“众生之心有内、外二性，由于所取、能取的缠绕，见分有种种差别。”这首偈颂的意思是说，众生之心由内、外二性合成，都有所取、能取的缠缚，见分有种种差别，或者是非量，或者是现量，或者是比量，偈颂中说的“见”是见分。</p><p>　　这样的四分或摄持为三种，因为第四证自证分可以摄入自证分。或者摄持为二种，因为见分、自证分和证自证分都是能缘性，都属见分。这里所说的“见”是能缘的意思。或者摄持为一种，因为它们的本体没有区别，如《入<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>》的偈颂这样说：“由于内心的执著作用，好像是有客观外境在产生，人们所见的客观外境是不存在的，所以说<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。”</p><p>　　这样，到处都说只有一心，这里所说的“一心”也包括心所法。所以识的行相就是了别，了别就是识的见分。</p><p>　　所谓“处”，即第八异熟识由于共相种子的成熟之力，变似色、声、香、味、触等尘世之相，也就是地、水、火、风四大种和四大种的所造色法。虽然各有情众生所变不一，所变之相相似，其处所无异，如众多灯明共在一室，每一灯明都可充满屋室，好像是只有一盏灯一样。</p><p>　　是谁的异熟识变为此相呢？月藏认为，是一切有情众生的异熟识共同变化为此相，为什么呢？如《立世经》这样说：“由于一切有情众生之业的促进力，共同生起此相。”</p><p>　　难陀认为：如果是这样的话，诸佛和菩萨的异熟识应当变为尘世的杂秽土，各有情众生等的异熟识实际上应当变为三千界外及<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>中如灵鹭那样洁净微妙的土地。又，诸“圣人”厌离欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>，上生<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>，此后肯定不会下生欲界和色界，变为此杂秽土又有什么用途呢？</p><p>　　所以，现身所居界及此界当生者的本识变为现所居界及当生界，他们的异熟识变化为这个世界。佛经据少分推论一切，诸业相同者都共同变化。</p><p>　　护法认为：如果是这样的话，器世间将要破坏的时候，既没有现居者，也没有当生者，谁的异熟识变幻为这个世界呢？又，各有情众生厌离欲界、色界，生无色界，现无色身，预先变化为有色世界的国土又有什么用途呢？即使允许你宗如大众部所主张的那样，具有色身和无色身，二者粗细悬殊，不相依持，此变为彼，又有什么益处呢？然而，所变的杂秽之土为色身所依持所受用，所以，若于此身可以依持，可以受用，就可以变幻为彼器界。因此，假设生于三千界所依之处，其识也要变为此土。所以，尘世将要破坏或最初形成，虽然没有众生，尘世也应当现存。这里所说的是一切众生共同受用，如果是别受用，类此应知，因为鬼、人、天神等所见不同。</p><p>　　各种种子，是第八异熟识所摄持的一切有漏法的种子，因为种子是由本识所摄，所以是所缘。无漏法的种子虽然依附本识，但不属有漏，所以不是所缘。虽然不是所缘，而与本识不相脱离，像真如那样不违唯识之理。</p><p>　　所谓“有根身”，由于异熟识不共相种子的成熟之力，变似色根和根的依处，也就是地、水、火、风四大种和所造的色、声、香、味、触。当共相种子到了成熟而有力的时候，于他人的身处也变似那种色法，使之成为共变。不然的话，就没有受用他身之义。</p><p>　　安慧认为：也能变似他人的净色根，因为《辩中边论》说“就好像是自己、他人的眼、耳、鼻、舌、身五根在显现一样”。护法认为，只能是根在显现。</p><p>　　护法认为：只能变似依处(构成色根的物质)，因为他人的净色根对于自己来说，并非所用。似自、他五根显现，只能说是自、他之识各自变幻，所以生上界或下界，或入般涅槃，剩余的尸体遗骸，仍可见其相续不断。</p><p>　　前面已经讲过业力所变器世间外境、内身、界、地之别，如果是<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>等所变的器世间、根身、界、地、自、他等问题，皆不决定。所变根身、器界多恒相续，少分间断。所变的声音、光线等存在的时间很短，因为它们是随顺因缘之力击发而起。简略来说，异熟识所变的外境，包括有漏种子、十色处和法处所摄的无见有对的实在色法。</p><p>　　为什么说异熟识不能变似心法、心所法等为所缘呢？有漏识的变幻，简略来说有二种：一是随其因缘势力而变；二是随顺六、七识的分别势力而变。第一种有实体用，第二种只是虚幻外境，并无体用。异熟识的变化，只随其因缘，所变色法等肯定有实体用。如果变为心法、心所法，就没有实体用，因为相分心等如化心，故不缘之。须七识等受用于境，并且从第八识的种子生。所变化的无为法等也没有实体用，所以第八识异熟识不缘心法等。到达无漏位的时候，由于与殊胜的智慧相应，虽然没有筹度取相分别但澄净的缘故，假设没有实体用，也会显现心等影、无为影等，如果不是这样的话，诸佛就没有一切智了。</p><p>　　所以在有漏位，这种异熟识只缘器界、根身和有漏种子，在欲界和色界缘这三种，在无色界中缘有漏种子，因为在无色界厌离物质的缘故。在这里没有业果之色，有定果色，与上述道理不相违背，所以异熟识也缘定果色为境。</p><p>　　“不可知”的意思是说，这种行相极其微细，难以了知。或者说，这种所缘内执受境(有漏种子和有根身)也很微细难知，非执受境的外器世间，量大难知，所以称为“不可知”。</p><p>　　小乘佛教的经量部和说一切有部问：为什么识取所缘境的行相难知呢？</p><p>　　论主回答说：如修灭尽定的时候不离身识，应当相信身识是有的。所以一定要承认在修灭尽定的时候有识，因仍属有情众生，像未入定前有心时一样。外道在修无想定而入无想等位之时，应当知道也是这样。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第三",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p><strong>　　成唯识论卷第三</strong></p><p>　　第八识与几心所相应呢？</p><p>　　常与触、作意、受、想、思相应。阿赖耶识自无始以来，至未成佛以前，在一切位永远与这五位心所法相应，因为这五位心所法由遍行心所法所摄。</p><p>　　“触”是根、境、识三法和合分别变异，使心法和心所法与外境接触为它的性用，并引生受、想、思等心所法。使根、境、识三法更相随顺，故称三和。触依根、境、识而生，使这三法和合，故称三和。在根、境、识三和合位，都有顺生一切心所功能的作用，这就称为“变异”。触好像是领似根、境、识三和合法，所以称为分别。在根、境、识三和位使触生起的时候，根的变异力优胜于识和境，所以《集论》和《杂集论》只说分别是根的变异。触能和合一切心法和心所法，使它们不致于离散，各别行相同趣一境，这是触的自性。既然是好像三法和合，具有产生相应心所法的作用，就能引生受等心所法。</p><p>　　《起尽经》说：一切受、想、行蕴都以触为其条件。由此而说识依根、境二法和合而生，触依根、境、识三法和合而生，受等依根、境、识、触四法和合而生。</p><p>　　《瑜伽师地论》只说：触能够引生受、想、思，思在行蕴上居主要地位，只要举出思即可包括其他。</p><p>　　《集论》等说：触为受的所依，因为触能生受，二者互相邻近，引发殊胜。意思是说，触所取可意、不可意、俱相违之相与受所取顺益、不顺益、俱相违之相，极相邻近，引发之力殊胜。然而，触的自性是真实的，并非虚假，因为在六六法中是心所之性，由食摄取，触可以成为产生其它心所法的条件，如受等性，就不是三位和合。</p><p>　　“作意”以能警心为其属性，其作用是引导心趣向外境。这种警觉应当生起心的种子，因为它能够引心；并使之趣境，所以称为作意。这种作意虽然也能够引起心所法，因为以心为主，所以只说引心。正理师说它令心回趣异境，杂集论师说它于一境持心令住，所以称为作意。这两种意见都不合道理，作意不应当像正理师所说的那样令心回趣异境”，如果是那样的话，作意就不应当是遍行。也不应当像杂集论师所说的那样“于一境持心令住”，如果是那样的话，作意与禅定就没有区别了。</p><p>　　“受”以领纳顺境、违境及俱非境为其属性，能引起众生的爱欲。对于没有得到的乐受，希望得到，如果已经得到这种乐受，则希望不再分离。对于苦受，如末得到，希望不要得到，如果已经得到，则希望尽快分离。对于不苦不乐的感受，则无所谓希望与之相合或相离。</p><p>　　正理师认为受有两种：一境界受，即领纳所缘的境；二自性受，领纳同时触，名领自性。触有苦、乐、舍，受都能领纳。正理师认为，只有自性受是受的自相，因为境界受通其余的心所法，它们都能够领纳境界相。这种观点是错误的，因为受肯定不能缘俱生之触，怎能说受能“领俱触”呢？如果认为受领纳触，意思是说，好像是同时产生的触称为领，并不是缘称为领。那么，似因之果应当都是受的属性。</p><p>　　又，既然是触能生受，触就是受的原因，受应当称为因受，为什么称为自性受呢？如果认为就像国王食用其国土所生产的各种物品一样，受能领纳触所产生的受体而称为自性受，这在道理上也讲不通，因为这种观点违背正理师本派的主张(正理师认为心不能自缘)，自己不能证明。如若救言，不舍受的自相而称为自性受，那么，思、想等都应当是受的自性。所以，正理师的主张只能哄小孩。而境界受是只能感受自相，并非共于其余的心相，领纳顺、违、俱非等相肯定属于自己，此称境界受，因为它不共于其他的心相。</p><p>　　“想”以对外境取像为其属性，对外境安立种种名称和言词。对外境安立界限，才能够随顺而起各种名言。</p><p>　　“思”能引起心理活动，使心生善、恶、无记之行相，是邪、正、俱相违行为的原因，使自己的心造作善、恶、无记之业。</p><p>　　既然触、作意、受、想、思五位心所法属于遍行，所以肯定与第八识藏识相应，遍行义和心所等将于本书第五卷详细解释。触等五位心所法与第八识异熟识虽然不同，而时间相同，所依相同，所缘相同，事相同，所以称为相应。</p><p>　　第八异熟识的行相很不明了，不能分别违境和顺境之相，此识行相微细，始终一类，相续而转，所以只能与舍受相应。而且，这种相应受只能是异熟，随顺前世引业而转，不需要今世的条件，任凭善、恶业势力而转，所以只能是舍受。苦受和乐受唯是前六识异熟生而有，不是真异熟，因为它们需要现在的条件，才有苦、乐感受，是故不与异熟相应。而且，第八识异熟识永远没有变化，常被有情众生的第七识末那识妄执为自我，如果与苦、乐二受相应，就会有转变，还怎么能执为我呢？所以异熟识只能与舍受相应。</p><p>　　说一切有部难问说：如果是这样的话，异熟识怎么又是恶业异熟呢？</p><p>　　论主回答说：既然允许善业能招舍受，恶业也应当能招舍受，因为舍受与苦、乐皆不相违，如无记法，善、恶业都可以招感。</p><p>　　第八识异熟识为何不与别境等心所法相应呢？因为二者互相违背的缘故。</p><p>　　有希求随同乐境而转，就是别境心所法的欲。异熟识是任运之识，不随所乐之境而转，所以没有欲。</p><p>　　胜解印持(自信认受)曾为犹豫之境，今得决定。异熟识闇昧微劣，无所印持，所以没有胜解。</p><p>　　念只是清楚记忆曾经经过的事情，异熟识闇昧微劣，不能清楚记忆。</p><p>　　定能使心专注一境，异熟识随业而转，刹那之间即缘别境。</p><p>　　慧只能简择分别事物的属性等，异熟识微弱闇昧，不能起分别作用，所以异熟识不能与别境心所法相应。因为此识只是异熟性，异熟识与善、烦恼等心所法也不相应。悔、睡、寻、伺四位不定心所法是无记性，因为有间断，所以肯定不能与异熟识相应。</p><p>　　事物分为四类：善、不善、有覆无记和无覆无记。阿赖耶识属于哪一类呢？此识只能是无覆无记，因为是异熟性的缘故。异熟如果是善性或染污(恶)之性，<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>还灭都应当是不得成立。而且，阿赖耶识为善、染法所依止，如果永远是善，就不能够被染法所依止。如果是染，就不能够为善所依止。因为善、染二性互相违逆，不应使二者俱作所依。而且，因为阿赖耶识是所熏性，如果其性是善或染，就如极香或极臭一样，不应当受熏。因为阿赖耶识不能被熏习，染、净因果都不能成立，所以阿赖耶识只能是无覆无记。</p><p>　　“覆”是染法，能够障碍成佛之道，又能覆蔽其心，使之不净。阿赖耶识不是染，所以称为无覆。“记”是善性或恶性，含有可爱、非可爱之果和殊胜自体，可以记别。阿赖耶识不是善性，也不是恶性，所以称为无记。</p><p>　　有人认为：颂文中的“触等亦如是”，意思是说如前阿赖耶识是无覆无记性，触、作意、受、想、思也是这样，因为各种相应法的性质必须相同。</p><p>　　又有人认为：触等五位心所法就像阿赖耶识那样也是异熟性，因为它们的所缘和行相都不可知。阿赖耶识缘根身、器界、种子三种境，与五位心所法相应，是无覆无记性，所以说触等五位心所法也是这样。</p><p>　　又有人认为：触等五位心所法就像阿赖耶识那样称为异熟和一切种，乃至于也是无覆无记性，“亦如是”没有简别。</p><p>　　护法认为：这些观点都是错误的，为什么呢？因为触等五位心所法依阿赖耶识而存在，它们并非自在，如贪等染法、信等善法都不能接受熏习，怎能像阿赖耶识那样储藏种子呢？又，如果触等五位心所法也能够受熏，一个有情众生就应当有六个持种之体(五位心所法和一个阿赖耶识)。如果是这样的话，结果从何种而生呢？从道理上来讲，不应当说是从六种生起，因为从来没有见过很多种子共同生一个芽。如果说结果从一类种子生，则其余的五类种子就没有用途了。也不能说心种先生，五位心所法后生，因为重习是同时的，势力是相等的。也不能说六种结果是顿时而生，因为不能说一个有情众生一刹那间六眼识等同时而生。</p><p>　　外人救说：谁说过触等五位心所法也能够受熏，也能够储藏各种种子呢？</p><p>　　论主反问说：如果不是这样的话，触等五位心所法怎能和阿赖耶识一样也称为“一切种”呢？</p><p>　　外人回答说：因为触等五位心所法有似种相(阿赖耶识是真种相)，所以触等五位心所法称为“一切种”。因为触等五位心所法和阿赖耶识的所缘是相同的，至无色界，触等五位心所法虽然已经不能缘色，但仍有所缘，缘本识相分的亲所缘缘，肯定是应当存在的。这种“似种”之相不能作为因缘，而生现识的各种根、境等，如触等心所法上，所变似眼根等不能作为所依直接产生五识，就如“似火”没有燃烧的作用一样。</p><p>　　论主反驳说：这种救不合道理，触等五位心所法的所缘、似种等相，名一切种，要到后面的执受处中才能与识相例。所以，前面所说“一切种”一定视为受熏并能持种之义。不然的话，本颂就犯重复的过失。颂文所说的“亦如是”没有简别，如说一切皆可“相例”则肯定不能成为证明。不能说触等五位心所法也能了别，也不能说触等与触等相应。由此可知，颂文中的“亦如是”只是随顺相应者而说，并不是说在一切情况下都是这样。</p><p>　　阿赖耶识是断呢，还是常呢？既不是断，也不是常，正如《唯识三十颂》所说的，是“恒转”。“恒”意谓阿赖耶识自无始以来，总是一类无记性，常是相续，永无间断，是安立三界、五趣(或六趣)、四生的根本。阿赖耶识的本性坚固，能够储藏种子，令不丧失。“转”意谓阿赖耶识自无始以来，念念皆有生有灭，前后变化无常，原因消灭时，结果产生，阿赖耶识并非常恒不变，亦非同一，能够被前七转识熏习形成种子。“恒”是为了否定断见，“转”表示阿赖耶识不是常恒不变，就如瀑流一般，因果也是这样。就像瀑流那样，既不是断灭不起，也不是常恒不变，长时相续，使一些东西漂浮在上面，使另一些东西沉溺水底。阿赖耶识也是这样，从无始以来，有生有灭，相续不绝，既不是永恒不变，也不是断灭不起，使有的众生生于善趣，使有的众生生于恶趣，使他们逃不出生死轮回。</p><p>　　又如瀑流那样，虽然受到风等的吹击，生起各种波浪，而水流并不断绝。阿赖耶识也是这样，虽然遇到各种条件而起眼识等，但永远相续不断。如瀑流漂水，水上漂草等物，水下有鱼等，鱼、草等物随水流而不舍除。阿赖耶识也是这样，内有习气，外有触等，它们永远随从阿赖耶识而转。用这些东西进行譬喻，是为了说明阿赖耶识自无始以来，因灭果生，非断非常。意思是说，阿赖耶识自无始以来，刹那刹那果生，刹那刹那因灭。因为果生，所以非断，因为因灭，所以非常。既不是断灭不起，又不是永恒不变，这就是缘起之理，所以颂文说阿赖耶识“恒转如瀑流”。</p><p>　　小乘佛教说一切有部、正量部等难问说：既然是过去、未来并非实有，说“非常”还是可以的，“非断”怎么讲呢？断见怎能成立缘起正理呢？</p><p>　　论主反问说：过去、未来如果是实有的话，可以说是“非断”，“非常”怎么讲呢？“常”也不能成立缘起正理。</p><p>　　外人反驳说：怎能用驳斥他人的过失来成立自己的主张呢？</p><p>　　论主回答说：如果不摧毁错误的见解，难以说明正确的主张。前因灭，后果生，就像一杆称一样，一头高一头低，其时相同。这样的因果相续如瀑流一般，哪里用得着假借过去、未来才能成立“非断”呢？现在有因，后果还没有产生，因是谁的因呢？现在有果，前面的因已经消失，果是谁的果呢？既然没有因果，谁离断和常呢？如果有因的时候已经有后来的果，果既然是本有，哪里还需要前边的因呢？因的意思既然是没有，果的意思哪里还存在呢？没有因又没有果，怎能脱离“断”和“常”呢？</p><p>　　外人回答说：成立因果的意思是依据事物的作用，所以前所诘难与我宗无关。</p><p>　　论主难问说：事物之体既然是本来就有，其作用也应当是这样，因为所需的内因和外部条件也是本来就存在的。按照你们的意思，因果肯定是不存在的，应当相信<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>的缘起正理。这种正理深奥玄妙，不能用语言进行表达，因、果等说法都是虚假施设。看现在的事物有引生后来事物的作用，虚假设立未来之果，是为了说明现在的因。看现时现地的事物，需要想到这是为酬答从前的因相而有，虚假设立曾经有过的因，是为了说明现在的果。“假”意谓依于现在的识，缘于现在法的时候，好像是有其因果之相在显现，但决不是心外实有因果。这样，因果之理趣就很明白了，远离断、常二边见，认识中道之理，各位有智之人应当随顺修行和学习。</p><p>　　小乘佛教上座部说：虽然没有过去和未来，但有因果永恒相续之义，意谓现在的事物变化极其迅速，仍有最初产生和后来毁灭二时，生的时候需要因，灭的时候引生果。时间虽然有两种，而本体却是一个。前边的因正在毁灭的时候，后边的果正在产生，虽然法体与生灭二相是有差别的，然而都是现时而有。这样，因果并非虚假施设，却离断和常，又没有以前诸难。哪位有智之人能舍此胜义而信其他的不了义呢？</p><p>　　论主破斥说：这些都是虚假言词，没有实在内容，怎能容许一念(刹那)而有二种时间呢？生、灭互相违逆，怎能同在现在呢？灭如果是在现在，生应当是在未来。因为有而称为生，既然是在现在，无所以称为灭，怎能不是过去呢？灭如果不是无的话，生应当不是有。生既然是现在有，灭应当是现在无。而且，生和灭互相违逆，其体怎能同一呢？如苦、乐等不同一体，这是世间现见的事实。生、灭之体如果同一，时间应当是没有初、后二时。生、灭如果是不同的话，其体怎能是同一呢？所以，生与灭同在现在，同依一体，在道理上肯定不能成立。经量部等所说的因果相续，在道理上也不能成立，因为他们不承认有阿赖耶识能够储藏种子。因此，应当相信大乘佛教所说的因果相续的缘起正理。</p><p>　　阿赖耶识自无始以来恒转如瀑流，到什么位才能究竟舍除呢？到阿罗汉位才能究竟舍除。意谓诸佛教“圣人”把烦恼障断除究竟尽时，称为阿罗汉。到那时候，阿赖耶识中的粗重烦恼永远灭离，所以称之为舍。</p><p>　　这里所说的阿罗汉，包括声闻、缘觉、菩萨三乘的无学果位。因为这三乘的无学果位都已经永远消灭了烦恼之贼，应当受到世间的绝妙<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，永远不再有尘世的分段之生。</p><p>　　外人问：怎么知道呢？</p><p>　　论主回答说：《瑜伽师地论》的说，诸阿罗汉、缘觉和如来都不成就阿赖耶识。《大乘阿毗达磨集论》又说：如果诸菩萨得到<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>时，就会顿断烦恼障和所知障，成为阿罗汉和如来。</p><p>　　外人问：如果是这样的话，菩萨得到菩提时，才能究竟断尽俱生烦恼，才能舍弃阿赖耶名，而阿罗汉并未永远断尽俱生烦恼，自应仍皆成就具有我爱执藏的阿赖耶识。如果真是这样的话，为什么《瑜伽师地论》卷二说，到不退地菩萨也不成就阿赖耶识呢？</p><p>　　论主回答说：说不退菩萨也不成就阿赖耶识，是指修学二乘的学者，证得无学果位以后，遇到一种特殊的因缘，发回小向大之心，要求成为趣向大菩提的渐悟菩萨，肯定不会再退起烦恼障。由于他们此时趣向大菩提，于是即由二乘无学又称为不退菩萨，他们不成就阿赖耶识，即包括在这里所说的阿罗汉当中。所以所说的并不违背此论所说的意义。</p><p>　　护法认为：第八地不动地以上的菩萨，一切烦恼永不再行，因为他们掌握了真、俗二谛，可以在<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>海中任运而转，八、九、十地菩萨能于<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行的诸行中起修一切诸行，每一刹那都展转有所增进，这时候才能称为不退菩萨。此位菩萨虽然还没有断尽异熟识中的烦恼种子，而第七识的见分缘此第八识的见分时，不再生起我见、我爱等的烦恼，当然也就不被妄执为我。从此以后，永远舍除阿赖耶识之名，所以说不成就阿赖耶识，这也被称为阿罗汉。</p><p>　　难陀等认为：初地以上的菩萨已经证得我、法二空所显示的真理，已得根本智和后得智，已经断除烦恼障和所知障，可以于一行当中生起各种行为。虽然因为某些利益而起各种烦恼，但不算作烦恼过失，所以，这也称为不退菩萨。然而，这种菩萨虽然还没有断尽俱生而来的烦恼，而缘阿赖耶识所有的分别我见、我爱等，不再被妄执为“我”，因此也已舍除阿赖耶识之名，所以说不成就阿赖耶识，这也被称为阿罗汉。所以《大乘阿毗达磨集论》中说，十地菩萨虽然还没有永远断除一切烦恼，然而这种烦恼就如咒药所折伏的各种毒一样，不再生起一切烦恼过失，一切地中就如阿罗汉已断烦恼一样，所以这也称为阿罗汉。</p><p>　　论主批驳说：难陀等人的观点都是错误的，七地以前还有与生俱来的我见、我爱等，妄执阿赖耶识为“我”，怎能说是已经舍除阿赖耶识之名呢？如果那种分别我见、我爱等不再执藏而说为“舍”，则预流等各有学位也应当已舍阿赖耶识之名。如果同意这种意见，就会违害各论所说内容。</p><p>　　难陀等人救说：初地欢喜地以上菩萨所生起的烦恼，都是由于正知(为救众生)，而不是由于过失，并不等于预流所作所为，怎能以此与菩萨相比呢？</p><p>　　论主又批驳说：他们在六识中所生起的烦恼，虽然由于正知而不成为过失，而第七识末那识的有漏心位任运现行执藏阿赖耶识，怎能不与预流等相同呢？由此而知，难陀等人的意见是错误的。然而，阿罗汉已经把阿赖耶识中的粗重烦恼断除干净，所以不再妄执阿赖耶识为“我”。因此，永远丧失阿赖耶识之名，这就称为“舍”，并不是舍除一切第八识阿赖耶识之体。不能说阿罗汉已无识持种，此时便入无余涅槃。</p><p>　　第八识各有情众生虽然都有，但随其意义之别立种种名称。或者称为心，因为由各种事物熏习形成的种子积集其中。或者称为阿陀那识，因为第八识能够执持种子和各种色根，使之不坏。或者称为所知依，因为它被染、净所知的诸法做所依止。或者称为种子识，因为它能够普遍任持各种世间法和出世间法的种子。这种种名称可通有漏位、无漏位，亦通凡位和圣位，即相续执持位。</p><p>　　或者称为阿赖耶识，因为它能够摄藏一切杂染品法，使之不失。又可以执藏我见、我爱等，被妄执为“我”。阿赖耶识之名只在凡夫和声闻、缘觉二乘有学位，不在无学位和不退菩萨，因为无学位和不退菩萨没有执藏杂染法的意思。</p><p>　　或者称为异熟识，因为它能导至生和死，能够引生善业或不善业的异熟果报。此名只是在凡夫、二乘有学和诸菩萨位有，因为至如来地已无异熟和无记法。</p><p>　　或者称为无垢识，因为它最清净而无污垢，被各种无漏法所依止。此名只在如来佛地有，因为菩萨和小乘的声闻、缘觉二乘及凡夫位，都持有漏种子，可以接受熏习，还没有获得善净第八识。如《如来功德经》的颂说：“如来的无垢识，是清净的无漏界，它解脱了一切烦恼障和所知障，与大圆镜智相应。”因为阿赖耶识执藏杂染，过失极重，首先舍除，所以颂文中偏说阿罗汉位舍。</p><p>　　至于异熟识体，菩萨将得觉悟时才能舍除，声闻、缘觉入无余涅槃时舍除。无垢识体，任何时候都不舍除，因为它给有情众生带来利益和安乐，永无尽期。心、所知依、执持识等，遍通各位，何时而舍？应各随其义预以说明。</p><p>　　然而第八识总共有二位：一有漏位，属无记性，只与触、作意、受、想、思五位遍行心所法相应，只缘前述执受根身、种子及器界一境；二无漏位，只属善性，与二十一位心所法相应，即遍行五、别境五、善十一。为什么知道与遍行心所法相应呢？因为第八识的无漏位与一切心法永恒相应。因为别境心所法中的欲，使佛永缘乐境。因为别境心所法的胜解，佛于所观境永恒印持理解无碍。因为别境心所法中的念，使佛对于经历过的事情都能明记不忘。因为别境心所法中的定，使佛永恒入定，没有不定散心。因为别境心所法的慧，佛对于一切事物永远都能决择。第八识的无漏位永远与极清净的“信”等善心所法相应，没有根本烦恼和随烦恼的染污，没有恶作、睡眠、寻、伺等散动之心。第八识的无漏位也只能与舍受相应，因为它永远任运平等而转。因为一切有为法和无为法都是它所缘的境，所以大圆镜智可以普遍缘一切事物。</p><p>　　怎么知道这第八识离眼识等别有自体呢？</p><p>　　以如来的圣教及推理而知，如《大乘阿里达磨经》中这样说：“第八识是自无始以来之界，一切有为法和无为法都依止它，由于第八识而有六趣，及证得涅槃。”因为这第八识自性微细，所以要以其作用进行显示。颂文的前半颂说明第八识作因缘用，后半颂说明第八识可以作流转还灭的依持。</p><p>　　“界”是因的意思，也就是种子识，自无始以来，展转相续，是直接产生各种事物的内因，所以称为因。“依”是缘(外部条件)的意思，即执持识，自无始以来被一切事物所依止，所以称为缘。意谓第八识能够执持各种种子，这些种子可以变为现行诸法，又被现行诸法所依止。“变为彼”意谓第八识的种子变为器世间和有根身。“为彼依”意谓第八识被前七转识所依止。因为第八识能够执受眼、耳、鼻、舌、身五色根，所以眼、耳、鼻、舌、身五识依之而转。又因为第八识被第七识末那识所依止，第六意识依第七识而转。因为第七识末那识和第六意识都是转识，如眼、耳、鼻、舌、身识那样依俱有根。从道理上来讲，第八识应当具有识的性质，所以它以第七末那识为俱有依。所以第八识可以作因缘用。</p><p>　　颂文中的“由此有”意谓由于有第八识。颂文中的“有诸趣”意谓有人、天等善趣和饿鬼、地狱等恶趣。意谓由于有这第八识执持的一切杂染法种子，使各类有情众生生死流转不息。虽然惑业生有漏集苦都是流<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死法，但六趣是流转的生死苦果，因其殊胜而偏说。或者说，“诸趣”通业、惑之能趣和六趣之所趣，趣之资具器世间也可以称为趣。各种惑和业都依赖第八识，所以第八识可以成为轮回流转的依持。</p><p>　　颂文中的“及涅槃证得”意谓由于有第八识而可证得涅槃。意思是说，由于有这第八识，能够执持一切顺应灭、道之法，使修行的人们证得涅槃。此中只说能证得道谛，不是说所证得的涅槃，因为涅槃并不依这第八识而有。或者此中只说所证得的涅槃，因为涅槃是修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>所追求的最终结果。或者此中包含涅槃及证得涅槃的道谛，因为二者都是还灭类所摄。颂文中的“涅槃”说明所证得的“灭”，颂文后边的“证得”说明达到涅槃的圣道。由能断之道断除所断之惑，将惑断除干净以后，就可以证得涅槃。能断道、所断惑、能证道、所证灭都依第八识，所以第八识作还灭之依持用。</p><p>　　又，在此颂文之中，第一句“无始时来界”说明第八识的自性，自无始以来永远具有，后边三句说明第八识是杂染、清净二法的总依和别依。杂染法意谓苦、集二谛，所趣是苦谛，即生。能趣是集谛，即业和惑。清净法意谓灭、道二谛，所证是灭谛，能证是道谛，所证是涅槃？能证是八正道。灭谛和道谛都依第八识而有。因为若依前七转识，从道理上来讲不能成立。</p><p>　　或者说：颂文的第一句说明第八识自无始以来相续不断，后边三句说明第八识被三种自性所依止，即依他起自性、遍计所执自性和圆成实自性，如其次第，应当明了。在此颂文当中所说的各种意思，离开第八识都不会有。</p><p>　　《大乘阿毗达磨经》中又有颂文这样说：“由于第八识是摄藏各种事物的一切种子识，所以称为阿赖耶识，我(释迦牟尼佛)，只向胜者菩萨们说明这个道理。”</p><p>　　论说：因为第八识含有各类种子，所以能够摄藏各种杂染法，依此建立阿赖耶名。并不像数论所说的那样，由自性转为“大”等二十三谛，因为种子和果体并非同一，能依诸法和所依之识都是有生灭变化的。第八识与杂染法互相摄藏，也被有情众生妄执为“我”，所以第八识称为阿赖耶识。已入见道的菩萨们得到真实现观后，称为胜者，他们能够契合唯识之理，能够证解阿赖耶识，所以我们的<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a><a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>要为他们说明这个道理。或者说，各种菩萨都称为胜者，虽然在见道前未能证解阿赖耶识，但能信解，不生诽谤，希求此识转依之果，我们的世尊也要为他们讲评。前七转识没有这样的意思。</p><p>　　《<a href=\"/fojing/jieshenmijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">解深密经</a>》也这样说：“阿陀那识非常深，也很细，它摄藏的种子就像瀑流那样持续不断。我(释迦牟尼佛)所以对凡人和愚者不讲这个道理，就是害怕他们虚妄分别执着为我。”</p><p>　　因为阿赖耶识能够执持杂染现行熏习形成的各种事物的种子，并能执持净色根和根依处扶尘根，也能够执取新<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>体的形成和前后生命的连接相续，所以第八识阿赖耶识又称为阿陀那识。因为无姓有情不能穷解阿赖耶识的原底，所以说“甚深”，这只限于凡夫。趣于寂静涅槃的声闻、缘觉二乘人不能证知第八识阿赖耶识的隐微行相，所以说“甚细”。阿赖耶识中摄藏一切事物的真实种子，受到外部条件的击发，就产生前七转识的波浪，永远没有间断，就如瀑流一般。“凡”是无姓有情，“愚”是声闻种姓和缘觉种姓。因为害怕他们对阿赖耶识起虚妄分别执着，使凡夫堕恶趣，愚者障碍成佛之道，所以我们的释迦牟尼佛不为他们讲说，只有第八识才有这种相状。</p><p>　　《入楞伽经》也这样说：“如海水遇到风这种条件，就会生起各种波浪，其功能作用出现在面前而转变，永无间断。藏识之海也是这样，由于七识境等之风所击发，永恒生起七识波浪，其功能作用出现在面前而转变。”</p><p>　　眼识等前七识不能像大海那样永恒相续，生起各种识的波浪，由此可见，另有第八识。如《显扬圣教论》所引各大乘经中都说另有这第八识。各大乘经都顺应“无我”，违逆数取趣，背弃苦、集，趣向灭、道，赞扬佛、法、僧<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>，摧毁各种外道有五蕴等事物的主张，并摧毁他们对胜性的否定。乐行大乘佛教的人们一致许可这是显示没有颠倒错误的道理，是佛经所摄取，如《增一阿含经》那样，属于至教量。</p><p>　　圣弥勒用七种理由证明大乘经真正是佛所说：一、因为佛没有预言过，如果大乘经是佛涅槃以后，有人为破坏佛教正法而说，为什么释迦牟尼佛不像预言十八部等可怕事那样事先预言呢？二、因为大乘和小乘本来同时而行。大乘教和小乘教本来同时而有，怎么知道唯独大乘非佛说呢？三、因为大乘境界并非其它派别所能达到。大乘所说境界既广大又深奥，并非外道、小乘的思量境界。外道和小乘的经论中没有讲到，假设为他们讲说，他们也不会相信接受，所以大乘经并不是非佛所说。四、因为辩论双方都承认大乘是佛说。如果认为大乘是其它佛所说，并不是释迦牟尼佛所说，则大乘是佛说，辩论双方都承认这个道理。五、关于有体和无体的问题。如果你们承认有大乘，就应当相信各种大乘教都是佛所说，因除此之外，另外去找一种能诠大乘妙理的教法，根本是不可得。如果没有大乘佛教，声闻乘佛教也应当是没有。因为如果没有大乘，肯定没有成佛之义，世界上谁说声闻乘呢？所以认为声闻乘是佛说，大乘非佛说，此说不合道理。六、因为大乘教义能够对治烦恼。依据大乘经的教诲勤加修行的人们，都能获得无分别智，都能够正确对治一切烦恼，所以应当相信大乘是佛所说。七、因为大乘教义与经文有别。大乘佛教的意趣非常深奥，不能随顺经文而取其义，便生诽谤认为大乘非佛说。所以实际上大乘是佛说。如《大乘<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>经论》的偈颂这样说：“佛事先没有预言过大乘非佛说，大、小二乘同时而行。外道和小乘都达不到大乘佛教的境界。辩论双方都承认大乘是佛说。不管是有体还是无体，都证明大乘是佛说。大乘教义与经文有别。”</p><p>　　其它部派的经典中也暗示说阿赖耶识另有自性。大众部的《阿含经》中暗示说，阿赖耶识称为根本识，因受眼识等所依止，如树根是茎等之本，眼识等没有这样的意思。</p><p>　　上座部的经和分别说部的论都暗示说阿赖耶识称为有分识。“有”即三有，“分”是因的意思。只有有分识永恒周遍，为三有之因。</p><p>　　化地部称阿赖耶识为穷生死蕴，除阿赖耶识之外，没有另外的东西能够随顺生死，永无间断。在无色界各种色法已经间断，无想天等的有情，其余的六<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>等已灭，心不相应行法离色、心等法并非另有自体，辩论双方都承认这种观点，只有阿赖耶识称为穷生死蕴。</p><p>　　说一切有部的《增一阿含经》中也暗示说此识称为阿赖耶识，即爱阿赖耶、乐阿赖耶、欣阿赖耶、喜阿赖耶。阿赖耶识是贪三世总别之境，故立这“爱阿赖耶”等四名。有情众生妄执阿赖耶为真实的自内我，在未断这种妄执之前永生爱着，所以阿赖耶识是真正的爱着之处。不应当妄执其余的五蕴等为真爱着处，在三恶趣受苦的众生们，对于五蕴不生爱着，他们往往厌恶五取蕴，总想我什么时候应当舍除这种<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>，舍除这种众同分，舍除这种受苦的身心，使我自由自在地享受快乐。</p><p>　　五欲也不是真正的爱着处，离欲者虽然对于五欲已不贪着，但仍然爱“我”。乐受也不是真正的爱着处，离第三静虑染者，虽然厌离乐受，但仍然爱“我”。身见也不是真正的爱着处，末证无我的非是无学，于正法中已能信解无我者，虽然对于身见不生贪着，但对于内我仍生爱着。转识等也不是真正的爱着处，修无想定、灭尽定等非无学求灭心者，虽然厌离转识等，但仍然爱“我”。色身也不是真正的爱着处。生于无色界离色染者，虽然厌离色身，但仍然爱“我”。心不相应行法离色、心等法，没有另外的自体，所以也不是真正的爱着处。</p><p>　　凡夫及二乘有学生起我爱的时候，虽然对于五蕴有爱和非爱两种情况，但肯定产生对于阿赖耶识“我”的爱，所以只有阿赖耶识是真正的爱着处。因此，前述真正的阿赖耶之名肯定只能够显示这种阿赖耶识。</p><p>　　已引经中佛的教诲，佛教的正确道理应当是清楚的。如佛经所说，由于各种杂染、清净事物的种子之所集起，所以称为心。如果没有第八阿赖耶识，那种执持种子之心就不应当有，因为前七转识在灭尽定等时会有间断，根、境、作意三种肯定有别，善等类别容易脱漏。如电光、声等，性不坚住，不能接受熏习，不能执持种子。由此可见，转识并非染净诸法种子所集起的持种之心。第八识前后一类，永无间断，如胡麻等，性坚住，可以接受熏习，契合佛经所说的“心”义。如果不允许有能持种子的心，不仅违背佛经，也违背佛教的正确理论。如果所生起的各种染、净品法，没有它们的所熏之义，不能熏习形成种子，就不能生起当前的染净品法。染净之法生起时既然是没有因缘种子，就应当同外道所主张的那样是自然而生。色法和不相应行法，并非心性，如声、光等那样，从道理上来讲并非染净内法所熏，怎能执持种子昵？而且，这种色法和不相应行法离识之外没有真实的自性，怎能认为是内种依止呢？与转识相应的各种心所法，如果识间断的话，容易脱漏，因其性质不自在，也不是心性，不能执持种子，也不能够接受熏习。所以，从道理上来讲，执持种子之心应当另有。</p><p>　　经量部认为：眼、耳、鼻、舌、身、意六识，自无始以来依根、境等而有，前后分位，现象虽有转变，而类并无区别，是所熏习的对象，能够执持种子，因此染净因果都能成立，为什么还主张另有第八识呢？</p><p>　　论主回答说：这种说法是没有道理的，为什么呢？主张类别实有，就同外道一样。如果认为类别是虚假的，就没有殊胜功用，应当是不能执持真实的内法种子。又，主张识类是什么性质呢？如果是善或恶的话，应当是不受熏习，因为承认有善、恶之记别，就如择灭无为一样，不可能接受熏习。如果是无记的话，善恶心生起的时候，没有无记心，无记类应当断灭。也不能说识的自体事是善恶之性，类成无记，因为识体之性与类一定要相同。而且，当五位无心时，识类肯定没有，既然是有间断，其性并非坚住，怎么能认为是执持种子接受熏习呢？</p><p>　　而且，阿罗汉或凡夫之心，因为识类相同，阿罗汉应当受各种染污的熏习而成凡夫，凡夫受无漏法的熏习而成罗汉，承认这种理论就会产生过失。而且，眼、耳、鼻、舌、身、意六根或信等余法，与眼等六识根法类同，应当是互相熏习，然而你们并不允许，所以不应当认为识类接受熏习。而且，六识身不管是事还是类，前念与后念既然不是同时而有，如相隔之念不能互相熏习，因为能熏和所熏必须同时。如果认为只有六识同时而生的话，由于前述道理，既然不是所熏，所以它也没有执持种子的意思。</p><p>　　上座部认为：色法和心法各自成类而无间断，前者为后者种子，以此成立因果之义，所以前述第八识的意思不能成立。</p><p>　　论主反驳说：这种主张是不合道理的，因为没有熏习的缘故。既然是自类不能熏习，怎么能认为前念有后念的种子呢？而且，生无色界时色法已断，修灭尽定时心法间断。既然是有间断，应当是不能再生。根据声闻、缘觉二乘无学的理论，应当是没有死后的色、受、想、行、识五蕴，你们既然不以第八识储藏种子，而以死位色法和心法是后者种子，死位色法和心法既然已经永断，还以什么为种子呢？也不能认为色法有心法种子、心法有色法种子、色心二法展转互为种子所生，因为转识和色等都不是所熏习、转识不能受熏，因有间断，色根也不能受熏，因为它并不是心法，这些道理前面已经讲过了。</p><p>　　说一切有部认为：过去、现在、未来三世诸法都是实有，因能感果，果能赴因，没有不能成立的，哪里还用得着另立执持种子的第八识呢？</p><p>　　论主反驳说：然而佛经所说的阿赖耶识之心能够摄藏种子，因为它生起染净之法的势力强盛。说一切有部的理论是错误的，过去、未来并非永恒，亦非现有，如空中华等那样，并非实有。过去、未来没有生果的作用，不能认为是因缘性，如果没有执持染净诸法种子的第八识阿赖耶识，一切因果都不能成立。</p><p>　　清辩系的无相大乘以无相之空理为究竟，依据似比量否定阿赖耶识和一切事物的存在。这种理论特别违害前边所引的《染净集起<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>》，如果认为知苦、断集、证灭、修道、染苦集、净灭道都非实有的话，即成极大的错误见解。这种理论与外道没什么不同，因为外道毁谤说，染净因果也不能说全没有，但认为并非实存。如果一切事物都非实有，菩萨就不应当起大悲舍生死，精进勤恳修集菩提资粮。哪位智者为除虚幻之敌而以石女之儿作为军旅呢？所以，应当相信有能够执持种子的心，依此心建立染净因果，这种心就是第八识阿赖耶识。</p><p>　　佛经又说：有异熟心，使善业招感善果，恶业招感恶果，如果没有第八识的话，就不应当有异熟心。眼、耳、鼻、舌、身、意六识，因为有间断，并非永远接受业果，如电光等那样，所以不是异熟心。异熟不应当间断后再继续，命根及眼、耳、鼻、舌、身五根没有这种情况。眼等六识，由业所感，就如声等一样，并非永恒相续，是异熟所生，并不是真正的异熟。所以一定要承认有真正的异熟心，酬牵引业，周遍三界而有，但无间断，变化为根身和器世间，作为有情众生的所依。因为从道理上来讲，根身和器世间离开心以外是没有的。与心不相应的事物是没有实体的，六转识并非永恒而有，如果没有这心的话，谁变为根身和器世间呢？又依据什么永恒安立有情之体呢？</p><p>　　又，在禅定之中或不在禅定之中，或有别思虑时，或无思虑时，从道理上来讲应当有很多身受生起，如果没有第八识的话，出定时其身就不会有怡适或劳损之感。如果不是永恒具有真正的异熟心，定出等位怎能有此身受呢？大乘佛教的菩萨和小乘佛教的声闻、缘觉二乘及凡夫众生等，肯定应当现起真正的异熟心，如果允许起彼六识中的业所感是真异熟，这不是佛，而是有情众生。由此可见，永恒具有真正的异熟心，那种异熟心就是第八识阿赖耶识。</p><p>　　佛经又说：有情众生流转于五趣、四生，如果没有第八识阿赖耶识，五趣、四生之体不应当有。具备实有、恒续、周遍、无杂四个条件，才能成为正确的真实趣和生。假定以非具足四义真异熟法为趣生体，趣生体就会杂乱，因为它住此趣此生而起余趣余生。各种异熟色和眼、耳、鼻、舌、身五识中业所招感的结果，不遍五趣、四生，因为无色界中完全没有各种异熟色和五识中业所招感的结果。各种生得善和意识中所招感的结果，虽然周遍于五趣、四生而起，也无杂乱，然而不是永恒具有。不相应行没有真实的自体，都不能立为正确的真实趣和生。只有异熟心及其心所实有、恒续、周遍、无杂，是正确的真实趣和生。如果没有第八识阿赖耶识，生无色界的有情，在生起善心等位时，应当是非趣非生，如佛一样。如果认为趣、生摄诸有漏，生无色界起无漏心时，应当是非趣非生，这就违背佛教的正确理论。为了避免前述和现在所说的这种过失，只能认为异熟法是正确真实的趣和生。</p><p>　　由此可见，如来并非趣、生所摄，因为佛没有异熟无记之法。也不属于“界”，因为不是有漏，因为佛已经舍除苦、集二谛，各类戏论种子已经永远断灭。既然是正确真实的趣和生，只有异熟心及其心所，从道理上来讲，这种心法和心所法离开第八识阿赖耶识不能成立。由此可见，另有这第八识。</p><p>　　而且，佛经说：有色根身是有执受的，如果没有第八识，那种执受就不应当有。意谓眼、耳、鼻、舌、身五色根和它们的依处，只有现在世是有执受，这肯定是由于有能执受之心。只有异熟心有先业所引，而不是善、染等的无覆无记性，因为异熟心始终一类能够周遍，永恒相续执受有色根身，眼等六转识没有这样的意思。这些话表明：眼等六转识都没有始终一类，不能周遍，不能永恒相续执受有色根身，并不说明能执受的只是异熟心，不能认为诸佛的无漏色身没有执受，然而能执受有漏色身的只是异熟心，所以要这样说。意谓各种转识显现缘起，如声、风等那样，那种善、染等，并不是行为所引的总报，就如非择灭无为那样。因为异熟生并非异熟性，因为并非周遍依持，不是相续，如电光等那样，不能执受有漏色身。所说的各种心法也包括心所法，因为心法和心所法肯定相应，如唯识所说。并非各种色根不相应行，可以执受有色根身，因为没有所缘，如虚空等那样。因此，应当另有能执受之心，那种心就是第八识阿赖耶识。</p><p>　　而且，《三法契经》说：寿、暖、识三种更互相依持而得相续稳定，如果没有第八识执持寿和暖，令其久住之识就不应当有。六转识有间断有变易，如声音、风等那样，没有永恒执持的作用，不能成为执持寿和暖的识。只有第八识阿赖耶识没有间断，没有变易，犹如寿、暖那样，在一期生命中有永恒执持的作用，所以能够立为执持寿和暖的识。佛经说，寿、暖、识三种，更是互相依靠维持，假如寿与暖始终一类，永恒相续，只有识不是这样，这怎么能符合三法更互依持的正确道理呢？</p><p>　　外人诘虽说：虽然寿、暖、识三种更互相依靠和维持，只有暖不周遍于欲、色、无色三界，为什么不承认只有识有间断，有变易呢？</p><p>　　论主回答说：由于前述的道理，所以这种诘难不能成立。佛经说寿、暖、识三法互相依持，这里一定要承认这三法在欲界和色界没有间断，没有变易，可以永恒相持。不然的话，就没有永恒相持的作用。由于前述道理，上述寿、暖、识三法中的识，不是讲转识，你举出暖不遍无色界来反驳我，这怎能批倒我前边所讲的道理呢？所以前述道理大家都是承认的。而且，三法之中既然寿、暖二种仅是有漏，由此可知，识与寿、暖一样，肯定不是无漏。生无色界，起无漏之心，此时什么识能执持哪种<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>呢？由此可知，肯定有第八识异熟识始终一类，永恒周遍，能够执持寿和暖，那种识就是这第八识。</p><p>　　佛经又说：各类有情众生受生和命终之时，必住散位，非住无心，亦非住定位。如果没有第八识，生死时不应当有心识。意谓生死时身体软弱无力，心识闇劣，犹如熟睡无梦和闷绝时一样，明了转识肯定不能生起。而且生死时六种识的行相和所缘是不可知的，就如无心位一样，肯定不能生起现行。六种转识的行相和所缘如果是有的话，肯定可知，就如其他的散有心位一样。真异熟识极其微细，行相和所缘都是不可知的，是引业之果，于一期相续之中永无转变，是散位有心，称之为生死心，并不违背佛教的正确理论。</p><p>　　某些大乘佛教徒说：眼、耳、鼻、舌、身五识于生死位肯定没有，第六意识缘取外境，或者由于前五识，或者由于他人的说教而另生别解，或以禅定为因。既然是生位这些原因都不存在，所以受生位没有第六意识。</p><p>　　论主反驳说：如果是这样的话，有情众生生无色界后，第六意识应当是永远不生，因为定心由散意识所引，五识、他教在无色界肯定是不存在的，因为加行引定心和由他教引散心是没有理由产生的。</p><p>　　大乘异师又救说：如果认为那种禅定是由于串习力，以后的率尔心能现在前，这有什么过失呢？</p><p>　　论主诘难说：彼界定心即初生位，怎能不生起呢？而且，欲界、色界初受生时，串习意识也应当生起，即生得善。如果你们救说：无色界中最初产生的定心，及下界中初生位散心，由于惛昧，最初受生时意识没有出现在面前，此即前述之因，何必再用其他解释呢？上座部主张，生死等位另有一种微细意识，行相和所缘都不可知。应当知道，这就是第八识，因为大家都承认第六意识不是这种情况。</p><p>　　又，众生将要死时，<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>者从下向上冷，行恶者从上向下冷，冷触逐渐生起，最后至心。如果没有第八识，这种情况就不能成立。因为前六转识不能执受身体。因为眼、耳、鼻、舌、身五识所依不同，或不行。逐渐命终时有的先舍五识，因为第六意识不住于身，缘境不定。因为第六意识恒常起时，逢境即缘，随依即止，永恒相续，冷触不应当由它逐渐产生。只有第八识真异熟心，由于以前业力永恒不断，周遍相续执于身，舍执受处便生冷触，因为寿、暖、识三种不相脱离。冷触起处就是非生命，非生命体虽然是第八识所变和所缘，但不执受。由此可见，肯定有这第八识。</p><p>　　佛经又说：识是产生名色的缘(条件)，名色是产生识的缘，识与名色展转相依，如二束芦苇同时而立。如果像小乘佛教所说的那样没有第八识，就不应当有那种识的自体。佛经中是这样解释的，名是五蕴中除色蕴之外的四蕴：受、想、行、识，色为羯逻兰等胎内五位，名色与识互相依存，如二束芦苇那样互为安立的条件，永远同时而立，互不相离。眼等六转识属于名中，如果没有第八识，<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>中“识缘名色”的识是什么呢？也不能说名中的识蕴是前五识，“识缘名色”的识是第六意识，因为在羯逻兰位没有前五识。而且，因为六转识有间断，有转易，其性不坚，没有能力永远执持名色，怎能说永远与名色为缘呢？所以，经中说的“识缘名色，名色缘识”的那种识是指第八识阿赖耶识。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第四",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第四</strong></p><p>　　佛经又说：一切有情众生都依靠食维持生命。如果没有这第八识，就不应当存在那种识食的自体。佛经说有四种食：一是段食。消化为其自相，属欲界，香、味、触三境消化时可以作为食。由此可见，色处不是段食，因为消化时色处就不起作用了。二是触食。接触外境为其自相，能带来烦恼的触刚与外境接触时能够产生欢喜等，可以起食的作用。这种触虽然与各种识都相应，但对第六识来说，食的意思最为殊胜。因为接触粗显外境，可以产生喜、乐及能生顺益于心的舍受，资养之意最为殊胜。三是意思食。以希望为其自相，即带来烦恼的思想和欲望都在起作用，希求可爱的外境，可以起食的作用。这种思想虽然与各种识相应，但对第六意识来说，食的意义最为殊胜，因为意识对外境的希求最为殊胜。四是识食。以执持为其自相，因为带来烦恼的识由于段、触、思三食的作用增长，使识可以起到食的作用。这种识虽然能通各种识的本体，但第八识阿赖耶识的食义最为殊胜，因为它相续执持的意义最为殊胜。所以《集论》说，这四食由三蕴、五处、十一界所摄持。</p><p>　　这四食能够维持有情众生的身体和生命，使之不致于受到破坏断灭，所以称为食。段食只在欲界起作用，触、意思食虽然遍布三界，但依靠识而起作用，随从识的有无而有无。眼、耳、鼻、舌、身、意六识有时间断，有时转易，并不能够普遍地存在于三界，不能永恒地维持生命，因为每当处于无心定、熟睡、休克、无想天时有间断。假设处于有心位，随其所依根所缘境的三性、三界、九地等之别而有变化，所以对于维持生命并非普遍，亦非永恒。</p><p>　　那些主张没有第八识的人们，用什么作为食呢？佛经是这样说的：一切有情众生都依靠食维持生命。并不像说一切有部所说的那样，在无心位中以过去未来的识等作为食，因为那种识并非现有，亦非永恒存在，就像空中花等一样，没有实在的本体和作用。假设有其本体和作用，并不存在于现在，因为就像虚空等一样，没有食的本性。也不能像说一切有部所说的那样入定之心等与处于无心位时有情众生有其食体，因为无心位时其识已灭，过去的识不是现在的食，这是大家共同承认的。也不可以说当处于无想定等之中，不相应行就是其食，因为段等四食并不包含无想定等，不相应行法并非实有。</p><p>　　上座部认为：当修灭尽定等之时，还有第六意识，这对于有情众生来说，可以起食的作用。这种主张不合道理，以后要详细破斥。经量部和说一切有部可能要问：生于色界和无色界的有情众生，其心是无烦恼的，此时用什么作为食呢？因为无漏识等生起时要破坏有漏身，身体和生命不能以此为食。也不能像经量部所主张的那样，在无烦恼的识中存在有烦恼的种子，可以作为维持身体和生命的食。因为无烦恼的识等就像涅槃一样，不能执持有烦恼的种子。也不能像经量部和说一切有部所说的那样，色界和无色界的有情众生，其身体和生命互相维持，可以互相为食，因为四食并不包含它们的身食和命食。</p><p>　　假设身体可以作为食，上述主张也不能成立，因为在无色界没有身体，就没有能够维持生命的东西了，众同分等也不能维持生命，因为它们没有实体。由此可知，肯定有一个不同于转识的异熟识，它前后是一类的，恒常无间断的，普遍存在，能够维持众生的身体和生命，使之不间断不破坏。佛根据这种理由断定：一切有情众生都依靠食维持他们的身体和生命。一切有情众生只能依靠五蕴聚合而成，佛没有烦恼，不算有情众生。当然，佛也可以说是有情众生，也是依靠食来维持他们的身体和生命，但是应当知道，这都是依于大慈大悲示现的应<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>而说。既然异熟识是殊胜的食的本性，那异熟识就是这第八识阿赖耶识。</p><p>　　佛经又说：修灭尽定的人，身行、语行、心行都已灭除，但命根不灭，也不离暖，根没被破坏，识还在身内。如果没有这第八识，修灭尽定的人就不应当有不离开身体的识。眼识等有两大特点：一者粗显，二者变动。有时存在，有时间断，性质、处所等都可能发生变化。当眼识等对于它们各自所缘的境界，如生起活动，必然感到疲倦。一般人愚蠢不知道，圣人聪慧，对此产生厌恶之情，要求从粗至细，渐趋停息，逐渐制伏乃至于全部消除。依此建立灭尽定，所以灭尽定中转识全部消灭。如果不允许有一种微细意识，永恒相续，体遍三界，由它执持命根等。依据什么说识不离身？</p><p>　　说一切有部救说：如果说识如隔日疟一样，灭后还会生起，就可以说识不离身。</p><p>　　论主批驳说：如果是那样的话，就不应当说心行灭，因为识与想等同起同灭。寿、暖及诸根也应当像识那样，这就造成极大的过错。所以应当承认识像寿、暖一样，其实是不离身的。而且，在修灭尽定的过程中，如果是完全无识，人就应当像瓦砾一样没有情感，那还怎么说是修灭尽定呢？</p><p>　　而且，当修灭尽定的时候，如果没有异熟识，谁能执持诸根和寿、暖呢？因为没有执持者，诸根等都应当灭除，修灭尽定者就如死尸一样，没有命根等。既然修灭尽定的时候没有异熟识，前六转识肯定不会再生。佛经说识不离身，是什么原因呢？诸阿赖耶识舍除原来的身躯，再托生到其他的身躯，它们是永恒存在，并非灭后再生。</p><p>　　而且，在修灭尽定的时候，如果没有执持种子的识，前六转识没有种子，怎能生起呢？过去、未来二世及不相应法，并非实有本体，这是大家共同承认的。各种色法等离识以外都是不存在的，受熏、持种也已经被否定。然而在灭尽定等无心位中，就如有心位一样，肯定真实存在有识，因为一切有情众生都具有根、寿、暖。由此道理可见，修灭尽定者肯定有识确实不脱离身体。</p><p>　　如果认为修灭尽定的时候，有第六意识称为不离身识，这也不合道理，因为灭尽定亦称无心定。如果认为没有前五识称为无心，就应当把一切禅定都称为无心，因为修各种禅定时都没有前五识。意识包括在六转识中，它像前五识一样，在修灭尽定的时候就不存在了。你们或许要说：灭尽定中的识行相所缘微细难知，如寿、暖等一样，并非第六意识。如果你们说灭尽定中有行相所缘可知之识，就如其他时候一样，并不属于灭尽定位。前述内容从根本上来说，是为了防止行相所缘可了知的前六识进入灭尽定中。以上是总破有心，以下是别破有心所。</p><p>　　又，在修灭尽定的时候，如果有第六意识，其心所法是有是无呢？如果有心所法，佛经就不应该说修灭尽定的人心行都灭。而且，如果是这样的话，灭尽定就不应当称为灭受想定。</p><p>　　经量部救说：因为灭尽定的加行位，只是厌离受和想，所以在修灭尽定的过程中，只有受和想灭除。受和想资助心力作用强盛，增长劳虑，所以要灭除，思等心所法并未灭除。只有受和想的心行法称为心行，佛经说的“心行灭”有什么不合道理呢？</p><p>　　论主破斥说：在修灭尽定的过程中，应当是只有想灭除，因为只厌于想，而你们却不承认。既然是只有受和想资助心力强盛，它们灭时心也应当灭。</p><p>　　经量部救说：就像身行灭时身仍然存在一样，为什么一定要说心灭心行同时而灭呢？</p><p>　　论主批驳说：如果是这样的话，语行寻、伺灭时语应当不灭，但<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>并不允许这样。然而“行”对于“法”来说，有普遍和非普遍两种。遍行灭的时候，法肯定要随之而灭。非遍行灭的时候，法或者随之而灭，或者仍然存在。所谓非遍行，意思是呼吸。四禅以上，呼吸灭后身体仍存，靠下地力量维持身体。因为寻、伺对于语来说属于遍行，它们灭时语肯定是不存在的。受和想对于心来说也属于遍行，认为它们就像思等大地法一样。受和想灭的时候，心肯定要随之而灭，怎能说它们灭时心还在呢？你们又说思等是大地法，受、想灭时它们也应当灭。思等既然已灭，信等善法也就不存在了，因为并不是遍行诸法灭后其余的非遍行诸法可存。怎能说有其余的心所法呢？既然承认思等在灭尽定中并非不存在，受和想也应当是这样，因为它们是大地法。</p><p>　　又，在修灭尽定的过程中，如果有思等，也应当有触，因为其余的心所法没有不是依靠触的力量产生的。如果允许有触，也应当有受，因为以触为条件产生受。既然允许有受，想也应当产生，因为受和想不相脱离。</p><p>　　经量部救说：如经说以受为条件产生爱，并不是说一切受都能产生爱。所以以触为条件产生受，并不是说一切触都能生受，在灭尽定位中有触而无受。由此可见，你们的话难在道理上讲不通。</p><p>　　论主反驳说：你们的救不能成立，因为以受为条件产生爱和以触为条件产生受，二者是不同的。佛曾经亲自进行简别，只有无明触所产生的各种受为条件才能产生爱，并不是以所有的受为条件都能产生爱。在佛教经典中，在任何地方佛都没有简别过触生受，从来没有说过：散心位的触能生受，灭尽定中的触不能生受。所以不能以此为例。因为有触肯定有受产生，在灭尽定中有触肯定有受。受与想相随，这个道理是肯定无疑的。或者说灭尽定位和其他位一样，受和想也不灭除，因为在此位中有思等。假使允许有受想，便违背佛的说教“心行灭”，也不能成立灭受想定。以上是破除有心所，以下破除无心所。</p><p>　　如果没有心所的话，识也应当是不存在的，因为从来没有见过其余的心识是离开心所的。如其余寻、伺的语行是遍行法，遍行的寻、伺灭了，语行也就随之而灭。同样，灭定位中受想的心行灭。心法也就随之而灭，因为都是遍行法。如果遍行的受、想心行灭，而心法还是存在不灭，那受、想、思等就不应该是大地法。假若按照你们的观点，心识独存，则灭定位中的心识就没有心所相应，则此识应如色等，不是相应法。如果你们真的认为是这样，则灭定位中的心识就没有所依根和所缘境，就如色法等一样，不是心法。</p><p>　　《十问经》说：意为所依根，法为所缘境，以此意、法为条件产生意识。根、境、识三和合生触，与触共同生起的有受、想和思。如果在修灭尽定的过程中有意识存在，根、境、识三和合，肯定有触产生，还能生起受等。既然触肯定与受、想、思同时俱起，怎能说有意识而无心所呢？如果像经量部的一派论师所说：根、境、识三和合，其力成触　；或如另一派论师所说：三和产生触。触能生受等。由于在修灭尽定之前厌患心所法，在修灭尽定的过程中，根、境、识不能成触，不能生触，也不会有受等。</p><p>　　论主诘难说：如果是这样的话，应当称为灭心所定，为什么只说灭受、想呢？</p><p>　　经量部救说：如果厌患时只厌患受和想，由于受、想灭，心所法都灭。依据以前的厌患以定禅定之名。</p><p>　　论主诘难说：既然如此，灭尽定中的心法也应当灭，因为心法和心所法一样，也是被厌患的对象。不然的话，为什么称为无定呢？又，灭尽定的意识是什么性质呢？不应当是染污性或无记性，因为各种作为善性禅定中，没有染污性或无记性。除禅定之外的染污或无记之心法，肯定有心所法，不应当修善定而起染污或无记之心。不可能是求寂静反而起散心。如果说灭尽定是善，应当是相应善，应与无贪、无嗔、无痴三善根相应。此位善心不应当是自性善或胜义善，因为这与经量部本身的主张相违背，因为它既不是三善根及惭、愧，又不是涅槃。如果认为此心是等起善，由加行善根所产生。这在道理上也讲不通，这与经量部本身的主张相违背，该部并不认为其他散心位的善心为等起善。如果其余散心位的善心没有间断地生起善、恶、无记三性之心，怎能说此位善心是“加行善根所引发”呢？所以灭尽定位的心法如果是善的话，肯定是相应善，因为是由相应力促成的。既然如此，肯定与善根相应，怎能说只有此心没有心所法呢？如果没有心所法，心法也应当没有。</p><p>　　由此推论，眼等六转识于灭尽定位，并不是不离身，所以佛经所说的那不离身识，就是这第八识阿赖耶识。修灭尽定的时候并不是为了止息这极其寂静的起执持作用的第八识。无想定、无想天等位，依此类推，应当知道。</p><p>　　《染净心经》称：心杂染有情众生就杂染，心清净有情众生就清净。如果没有这第八识，杂染心和清净心都不应当有。杂染法和清净法都以心为其本源，有漏现行依心而生，种子依心而住，心受无漏现行熏习，并执持无漏种子。然而杂染大概来说有三种：烦恼、业、果，种类有别。如果没有第八识执持烦恼种子，<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>无色界的他地或还生本地，无染心后的解脱境界，各种烦恼的生起，都应当是无因。因为色法等不能执持种子，过去未来并非实有。如果各种烦恼无因而生，就没有声闻、缘觉、菩萨三乘，也不会有有学、无学之果，已断之惑都应生起。如果没有这第八识执持业种子和果种子，往生无色界的他地或还生本地；世间心灭尽，出世间心出现在面前；各种业果的生起，所有这一切都应当是无因。如果经量部和说一切有部之救称：后报业果现在成熟、色法等持种、过去世和未来世有因等，前边已经破斥。</p><p>　　如果说各种业果都是无因而生，入无余依涅槃以后，三界业果还可以再生，因为烦恼也可以无因而生。而且，十二因缘的“行缘识”就不能成立，因为前六转识接受熏习前面已经否定。如果经量部救说“结生染识是识支”，这也不对，因为结生染识并非由行招感。如果说一切有部、经量部救说“行感名色位中识”，这也不对，如果是那样的话，应当说“行缘名色”，不应当说“行缘识”。即使像说一切有部所主张的那样有过去世和现在世，行在现在世，色果在未来世，业果相望，时间遥远而又隔绝，行不能成为色果产生的条件。“行缘识”不能成立，“取缘有”也不能成立。</p><p>　　各种清净法可分三类：世道、出世道、断果。如果没有第八识执持世间、出世间清净道的种子，由欲界至色界、无色界，由世间至出世间的异类心后所生起的无漏净法都应当是无因。经量部和说一切有部所主张的其他原因，前面已经破斥。如果世间和出世间的清净道是无因而生，入无余依涅槃以后，二净道还可以再生，所依之身也应当是无因而生。</p><p>　　而且，出世道最初不应得生，因为没有一个东西执持它的法尔种子。各种不同的有漏法，并不以经量部的世第一法(最高的有漏智，在世俗法中，名列第一)为因。因为有漏和无漏，其性类是各别的，有漏种不能作为生起无漏道的原因。主张无因而生的不是佛教徒，初无漏不生，后时无漏亦应不生，这就不会有声闻、缘觉和菩萨三乘的<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。如果没有这第八识执持烦恼种子，转依断果也不能成就，因为无间道生起时，现行烦恼及其种子都是不存在的，因染、净二心不能同时俱起。圣道不执持烦恼种子，因与烦恼种自性相违，如涅槃那样。因为说一切有部主张有的过去、未来、得等皆非实有。像经量部所说的那样，由色法等执持种子，在道理上不能成立。既然没有所断之惑，也就没有能断之道，依何烦恼由何断道而立断果呢？</p><p>　　经量部救说：只由道力，后悔则不生起，由此成立断果。</p><p>　　论主难云：如果是这样的话，则初断道生起，就应当成为无学。以后的各种烦恼由于初断道，都已无因，因为没有种子，永远不再产生。承认有第八识阿赖耶识，染净二法能成立，只有第八识才能执持染净种子。证明第八识存在，理由非常充足，但恐怕太繁琐，这里只是提纲挈领地讲一讲。除其他识之外，另有第八识阿赖耶识，这在佛教道理上是显而易见的，一切有智之人都应当深信不疑。</p><p>　　前边已经讲了初能变第八识之相，第二能变第七识之相如何呢？</p><p>　　《唯识三十颂》说：“第二能变是末那识，以阿赖耶识为其所依，又以阿赖耶识为其所缘，思量是它的特性。常与四烦恼一起活动，即我痴、我见、我慢、我爱，和其他的触等心所法相应。第七识属有覆无记性，有情众生生于那一界，它就属于那一界，到阿罗汉位、灭尽定位、出世道位，它就没有了。”</p><p>　　论说：讲完初能变异熟识以后，应当辩别第二能变思量识之相。这第二能变思量识在圣教中，别名叫做末那(思虑)。因其永恒的思虑作用胜于其他七识。第七识与第六识有什么区别呢？第七识是持业释，如藏识之名，因为此识即意(末那)。第六识是依主释，如眼识等，此识与意有别，是意根产生的识。然而佛的各种教诲中，恐怕第七识与第六识相混，只在第七识立意之名末那。而且，标明意是为了和其他识相区别，它不能像第八识那样积聚种子，又不能像前六识那样起了别作用。或者为了说明第七识是第六识的近所依，所以只称它为“意”。</p><p>　　颂文的“依彼转”是为了说明第七识的所依。“彼”是前边讲的初能变第八识阿赖耶识，因为佛说第七识的所依是藏识。</p><p>　　难陀胜子认为：末那识是以阿赖耶识的种子为其所依，并不是阿赖耶识的现行识。因为第七识永无间断，不用现行识为俱有依即可生起。</p><p>　　护法等认为：第八识的种子现行识都是第七识的所依，它虽然没有间断，但有变化，因为它称为转识，必须以现行识为俱有依才能生起。</p><p>　　“转”是相续生起的意思，这为了表明第七识永远以第八识为其所依，以取所缘之境。</p><p>　　各种心法和心所法都有所依，其所依共有三种：一因缘依。即自己的种子，各种有为法都靠此依，因为没有自己的因缘，它肯定不能产生：二增上缘依。即眼、耳、鼻、舌、身、意六根。各种心法和心所法都靠此依，因为无此六根，心法和心所法都不能生起；三等无间缘依。即前灭之意念，各种心法和心所法都靠此依，因为没有起引导作用的意根：心法和心所法都不能生起。只有心法和心所法所具有的三种所依称为有所依，并不是其余的色法等。</p><p>　　第一种子依，即因缘依。关于这个问题有两种解释。难陀等人认为：只有种子灭除以后，现时之果才能产生，因为《大乘阿毗达磨集论》有“无种已生”之说，种子和芽不能同时而有。护法等人认为：这种论证不能成立，因为他们认为过去的种子引生以后的种子，这实际上是不可能的。这里说的种于生芽是世俗法，不是佛教道理。因为种子灭除芽才产生，这并不是大家共同承认的。又因焰与炷同时互相为因。然而种子自类相续，前念种灭后念种生，像这样的因果关系不能同时而有，但种子生现行，现行生种子，肯定同时而有。所以《瑜伽师地论》卷五说非永恒的事物以“他性”为因，这就是因缘的意思。“自性”是说种子本身前为后因，即种子生种子。“他性”是说种子与现行互相为因。《摄大乘论》卷一也这样说：藏识和染污事物互为因缘，就像一捆一捆的芦苇同时相依不倒一样。又说种子与结果肯定是同时而有，所以种子依肯定不是前后异时，假设有的地方说种子与结果一前一后，应当明白，这都是随顺经量部“异时因果”理论，权且转变大乘的教理。由此可见，八识和各种心所法肯定各有种子所依。</p><p>　　第二俱有依。关于这个问题有四种解释。难陀等人认为：眼、耳、鼻、舌、身五识生起时，以第六意识为俱有依，因为眼等五识生起时肯定有意识。并非另有净色大种所形成的眼等现行五根为俱有依，眼等五根本身就是阿赖耶识的种子。</p><p>　　《唯识二十论》的颂这样说：“识是从自己的种子产生的，好像是有客观事物存在，为了成立眼、耳、鼻、舌、身内五处和色、声、香、味、触外五处，佛说有十处。”这个颂的意思是说：佛为了成立十二处，说五识的种子是眼等五根，五识的相分是色等五境，所以眼等五根是眼等五识的种子。</p><p>　　《观所缘缘论》也这样说：“识上显现色等的功能称为五根，这是合乎道理的，其功能与外境色等，自无始以来，就互相为因。”这首颂的意思是说：阿赖耶识上有产生眼等色识的种子，称为色功能，被说成是五根，并不是除识之外另有眼等五根。见分种子和现行见分变似境色的色识互相为因，色识之能熏与根种之所熏互为能生，互为因由。第七识和第八识无此俱有依，它们所以永恒相续，是由于它本身的力量殊胜。第六意识有此俱有依，因为它要靠第七识末那识而得生起。</p><p>　　安慧认为：上述理论与佛的教诲相违背，如果说五色根就是五识的种子，十八界的种子就要混乱不堪。然而十八界各有自己的种子，圣人在很多地方这样说过。而且，五识种子各有其能生的相分种子和见分种子的差异，按照这种理论，哪些为眼根等呢？如果是见分种子，应属识蕴；如果是相分种子，应属色等外处。这就违背了圣人关于眼等五根都属色蕴的说教。而且，如果说五根是五识的种子，五根应当是五识的因缘，不应当说是增上缘。而且，如果鼻、舌二根是此二识的种子，就应当说鼻、舌二根只属欲界，或者说鼻、舌二识亦通色界，承认这种说法，就与圣人教诲相违背。如果说眼、耳、身<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>是此三识的种子，三识通二地，三根通五地，这就讲不通。而且，既然五识种子又是善性，又是恶性，就应当说五色根不只是无记性。而且，五识种子是无执受，五根也应当是无执受。而且，如果五色根是五识种子，第六意识的种子就应当是第七识末那识，因为《摄大乘论》认为第六根与前五根相同。</p><p>　　又，《瑜伽师地论》说眼等五识都具三依，如果五色根是五识种子，五识依应当是只有因缘依和等无间缘依。而且，各种圣人之教都说眼等五根都通现行和种子，主张五色根只是种子，这就与一切圣人教诲相违背。为了避免上述错误所受到的诘难，对那种主张又设救说：阿赖耶识中能够招感五识起促进作用的种子，称为五色根，并不是作为因缘而生的五识种子。这样讲就巧妙地与前面所引的《唯识二十论》和《观所缘缘论》的两个颂文相符合，又很好地随顺了《瑜伽师地论》。</p><p>　　上述主张都是虚假的，并非真实意思，因为五色根应非无记性。而且，身业色可有执受，声、意二业无执受。按照你们的观点，五根就是业种子，就应该不是唯有执受。五色根只属五蕴中的色蕴，只是内处。因为鼻根和舌根只属欲界，眼、耳、身三根只通二地，不应当通五地。因为招感意识的业种子应当是末那，眼等五应当通现行种子。而且，眼等不应当是色根。而且，如果五识都由业所招感，就应当一直是无记性。善、恶、无记性的五识既然不是由业招感，就应当是没有眼等为俱有依，所以他们的救不能成立。而且，圣人之教很多地方都说阿赖耶识所变，似乎是色根和根依处、器世间等，你们为什么不承认阿赖耶识变似色根呢？你们承认眼等五识可以变现为色根五尘，但不承认眼等五根是藏识所变。这种观点既迷于眼等五根不是第八识所变，又谬执五识种子或业种子就是五根，这违背教理实在是太远了。</p><p>　　然而，《观所缘缘论》的偈颂所说的“种子功能名五根”，是为了破除离识之外实有色根的理论，色根是识所变，好像是眼根等。因为它们有产生五识的作用，假名种子和色功能，并不是说色根就是识种或业种。而且，缘色、声、香、味、触的明了意识应当以五识为俱有依，因为它们必须与五识同时俱起。如果它不依眼等五识，它就不应以五识为依，彼此互相为依，因双方势力均等。</p><p>　　又，第七识末那识虽然没有间断，既然它在见道等有变化，它就应当像第六识那样有俱有依。不然的话，它就应当不属转识，这就违背了圣人关于有七种转识的教诲。所以应当承认第七识有俱有依，这就是现行第八识。这就像《瑜伽师地论》卷五十一所说的，因为有藏识才有末那识，以末那识为依，意识才能发生作用。《瑜伽师地论》的意思是说：因为以现行藏识为依止才有末那识，并非由其种子。不然的话，应当说因有藏识而使意识发生作用，这种理论不但与道理相违，也与教法相违。所以应当说前五转识的每一个都肯定有两种俱有依，即五色根，同时还有意识。第六识肯定永远有一个俱有依，即第七识。如果与前五识同时俱起，也以五识为俱有依，第七转识肯定只有一个俱有依，这就是第八识。只有第八识永远没有变化，自己本身可以成立，没有俱有依。</p><p>　　净月认为：这种意见不尽合理，既然第八识与其余七识同属识性，为什么不允许有俱有依呢？既然第七识和第八识永恒同时起作用，说它们互相为依，这有什么错误呢？允许现行识以种子为依，阿赖耶识的种子也应当以现行识为依。能熏六、七现行是新所熏种子生依，是本有种子长依，以异熟识为住依。如果没有六、七识，异熟识的种子就不能生，不能长，也不能住。而且，异熟识在有色界(包括欲界和色界)中能够执持自体，依靠色根发生作用。就像《楞伽经》卷九所说的：“阿赖耶识被业(行为)风所飘，普遍依靠各种色根，永远持续发生作用。”《瑜伽师地论》也说：因为眼等六识各有所依，不能执受有色根身。如果阿赖耶识不普遍地依止各种有色根，它就应当像前六识那样不能执受。或者说所立因支有不定的过失。所以如果藏识生起的话，肯定有一个所依，这就是第七识，在欲界和色界也依靠色根。如果阿赖耶识的种子肯定有一依是阿赖耶识本身，最初的熏习位或生或长，亦依能熏，这就和前述内容一样犯不定的过失。</p><p>　　护法认为：前述主张都不合理，因为他们不懂得所依和依的区别。“依”是一切有生灭变化的有为法，仗其内因并托其他条件而得产生和持续，各种所依托者都被说成为“依”，就像国王和大臣互相依靠一样。如果事物具备决定、有境、为主，令心、心所取自所缘四个条件，就是所依，即眼、耳、鼻、舌、身、意六根，因为除六根之外的其他事物非有境、非决定、非为主。这只如世间王为臣所依，非如臣等为王所依。所以诸圣人之教都说只有心法和心所法称为所依，色法等不能称为有所依，因为它们没有所缘的境。只能说心所法以心法为所依，不能说心所法是心法的所依，因为心所法不是心法之主。</p><p>　　然而有的地方说依就是所依，或者说所依就是依，这都是随顺情宜的假说。由此可见，前五识都有所依，肯定有四种所依，即五色根、第六识、第七识和第八识。这四种所依只要缺一种，五识肯定不能发挥作用。五根与五识为同境依，因为二者同取现境；第六意识于五识为分别依，因为意识对五识所缘的境起分别作用；第七识于五识为染净依，五识由此根本染故而成有漏，根本净故而成无漏；第八识于五识为根本依。圣人之教只说依五根，因为五根是五识的不共依。因为五识和五根肯定同取外境，又因为二者相近，互相随顺。</p><p>　　第六意识的所依只有二种，即第七识和第八识，只要缺一种，第六识就不能发挥作用。虽然有前五识可以使第六识明了取境，但不一定有前五识，没有它们也可以有第六识，所以前五识不是第六识的所依。圣人之教只说依第七识，因为第七识是染净依，它与前六识一样，同属转识。又因为第六识离第七识近，二者互相随顺。</p><p>　　第七识的所依只有一种，即第八识。如果没有第八识，第七识肯定不能发挥作用。这就如《楞伽经》卷九的偈颂所说：“以阿赖耶识为依，才能使末那识发挥作用，依止第八识阿赖耶识和第七识末那识，其他的六转识才能生起。”</p><p>　　阿赖耶识的所依也只有一种，即第七识。如果没有第七识，阿赖耶识肯定不能发挥作用。《瑜伽师地论》卷六十三说：阿赖耶识永远与第七识末那识同时发挥作用。又说阿赖耶识永远依靠染污识，这就是第七识末那识。所说灭尽定、无学位、圣道现前三位没有末那识，是说此时没有染污的有覆无记的末那识。如说声闻、独觉、不退菩萨、如来四位没有阿赖耶识一样，也只是说，在此四位中没有我爱执藏的阿赖耶识，并非真的没有阿赖耶识体。“三位无末那”之说与此相同。虽然在有色界也依五根，但不一定有，所以五根不是所依。阿赖耶识的种子不能现缘自己现行所缘之境，可以有“依”的意思，但没有“所依”的意思。心所法的所依，应当随顺识而说，还要各加与自己相应的心法，即相应依。如果这样讲，就巧妙地符合佛教道理和佛的教诲。</p><p>　　最后讲开导依。关于这个问题，共有三种解释。难陀等认为：因为前五识自类前后及与他前后，皆不相续，必须靠第六意识引生，所以只有第六意识为开导依。因为第六意识自己可以相续不断，也可以由五识所引生，由五识引生以前的第六识为开导依。第七识和第八识自己本身可以相续不断，不用借助其他识所引生，只以自类为开导依。</p><p>　　安慧认为：上述意见都不尽理，前五识在没有达到自在位(解脱)的时候，遇到平平淡淡的境界可以像前面所讲的那样。如果达到自在位，像诸佛那样，对于外境自由自在，眼、耳、鼻、舌、身、意六根互用，眼可闻声，耳可观境等，不借助分别，恒缘于此，所以称为任运；更无疑虑，这就称为决定；无所未知，这就是无寻求。那五识身为什么不能相续呢？第五心等流心的五识既然已有决定心、染净心，还有第六意识的引生，当专注一缘而未舍除的时刻，为什么不允许有多念相续呢？</p><p>　　所以《瑜伽师地论》说：决定无记心后才有第四染净心生，以后才有五识等流心起，此时才有眼识见的善或不善起作用，这时候不需要分别力，因为它是由意识所引生。但这种意见只指专一境而未趣其他外境的时刻，此时的眼识和意识或是善性，或是染性，持续不断地发挥作用。应当知道，眼、耳、鼻、舌、身识也和眼识的生起一样。这个意思肯定是说：此时眼识和意识同时持续不断地发挥作用。既然眼识产生时并不是没有意识，但并不是说意识和五识互相持续产生。如果强烈外境连续出现在面前，逼迫夺取身心，在不能暂时舍除的五识身，从道理上来讲肯定是持续的。如热地狱中的火增盛、戏忘天的戏乐增盛等，所以《瑜伽师地论》卷五十二说：如果这六识是那六识的等无间缘，虚假施设此名意根。如果五识间断，前后肯定只有意识，该论就应当说：若此前念第六意识为彼后念六识的等无间缘，或者说此六识为彼后念第六意识的等无间缘。既然不是这样，由此可知五识有相续的意思。五识生起时肯定有意识能够引生寻求意识，哪里用得着以五识作开导依呢？无心定、睡眠、休克等位之时，意识已经间断，以后再生起时既然藏识和末那识是永恒相续，也应当为它作开导依。如果第六识用自类作开导依，为什么不许五识用自类作开导依呢？既然不允许五识，怎能允许六识呢？</p><p>　　平等性智相应末那识最初转依生起时，必然由第六意识引导才能产生，也应当用它作开导依。大圆镜智与第八净识同时俱起，最初必须用第六识和第七识引生。而且，异熟心依染污第七识或依菩萨与慈悲誓愿相应的二智(根本智、后得智)善心。既然如此，必须允许第八识也以第六识、第七识为开导依。由此看来，以上所说，都无尽理。应当说眼等五识在前六识的范围内，随便用任何一识作为开导依。第六意识用前自类或第七、第八识为开导依。第七末那识用前自类或第六识为开导依，阿陀那识用前自类和第六、第七识为开导依。这都不违背佛教道理，由前述内容可以证知。</p><p>　　护法等认为：这种说法也不合理，开导依必须具备三个条件；一有缘法，即能缘取外境的心法。色法、不相应行法和无为法都不具备这个条件。二为主，即有自在力。一切心所法都不具备这个条件。三能作等无间缘，只限自类识，前念心王为后念心法和心所法开避彼路，引导令生，此称开导依。只有心王可作开导依，心所法、色法、不相应行法和无为法都不能作开导依。如果此识与彼识不能同时俱起，说此识对彼识有开避彼路引导令生之力。既然允许八识可以同时俱起，为什么以异类识作开导依呢？如果允许异类识为开导依，八识就不应同时俱起，这就和小乘佛教说一切有部关于六识不俱起的理论相同了。而且，一身八识俱起可多可少，如果允许互作等无间缘，色法等也应如此。这就违背了圣人关于只有心法和心所法可作等无间缘的教导。</p><p>　　然而《摄大乘论》说：色法也允许有等无间缘，是纵夺之说，意谓假纵小乘佛教经量部所说的色法、心法的前刹那和后刹那有等无间缘，夺彼因缘，因为经量部认为没有第八识，故以色法为因。若不作此解，则等无间缘的“等”字就没用了。如果说“等”不是说多少，而要前后各有一法称为“等”，只表示前念是此心、心所，后亦此心、心所，表此同类，这就违背你所说的异类识可作等无间缘。所以八识只能以自类作开导依，深刻符合佛教道理，自类眼识等肯定没有俱起的意思。心所法的开导依应当随顺识说。</p><p>　　虽然心法、心所法二者异类并生，但互相应，而不违背，所依、时、事、处四义等同，二者和合在一起，好像是一种，肯定是一起生、一起灭，所起的作用肯定相同，即同取一境，善、恶、无记三性一致。所以随一心开导之时，相应的心所也能开导，所以心法、心所法虽异类相望，互做等无间缘。各种识并不是这样，不应以此为例。然而各种心所法并不是开导依，因为它们对所引生者没有“主”的意思，也就是没有“依”的意思。如果心法和心所法的等无间缘，只能各以自类，第七识和第八识最初转依的时候，相应“信”等善法就没有等无间缘，这就违背了圣人所说的各种心法和心所法都具四缘。当无心定、睡眠、休克等位，意识虽然间断，但以后生起时，其开导依就是以前的自类。应当知道，五识间断时也是这样，没有自类心在其中间隔，故称无间。它原先灭除时就已经为现今之识开导，哪里还用得着异类作开导依呢？然而圣人的教导中说前六识互相引生，或者说第七、八识依第六、七识而生，都是依殊胜的增上缘而说，并不是等无间缘，所以并不矛盾。</p><p>　　《瑜伽师地论》卷五十二称：如果此心、心所等无问，各识肯定生起，心法和心所法是各识的等无间缘，而且此六识是彼六识的等无间缘，即将此六识称为意根。《瑜伽师地论》在言说方面，虽然总的遍于六识，但其意趣却别说六识自类各各相望。所以八识自类为依，深刻符合佛教道理。</p><p>　　论述不同见解的傍论到此结束，现在讲正论。此能变识虽然具有三听依，但颂文的“依彼转”只说明前面两种：因缘依和增上缘依。这是为了说明此识的所依和所缘相同，而且前二依有殊胜作用，或者说因为开导依容易明白。</p><p>　　这就讲完了第七识的所依，它的所缘如何呢？就是《唯识三十颂》所说的“缘彼”。“彼”就是前边所讲的这所依识第八阿赖耶识，因为《瑜伽师地论》、《显扬圣教论》等都说第七识缘藏识。</p><p>　　难陀等认为：第七识只缘第八识的识体及其心所，因为《瑜伽师地论》和《显扬圣教论》都说末那识的我执、我所执永远相应，即缘第八识的识体及其心所，按照次第执为我和我所。然而各种心所法都不离识，如“唯识”所说，并无违背圣人之教的过失。</p><p>　　火辨认为：难陀等人所讲的内容不合道理，圣人在任何地方都不曾说过缘“触”等遍行五法。应当说第七识只缘第八识的见分和相分，按照次第执为我和我所，因为相分和见分都以第八识为其本体，这样讲并不违背圣人的教诲。</p><p>　　安慧认为：这种说法也不合理，因为五根、五尘都不属识蕴，末那识应当像五识那样也缘外境。意识缘五尘与五识相同，称为缘共境，第七识缘五尘也应当像意识那样缘共境。若生无色界，不应当有我所，因为极端厌恶色而生无色界，此后并不变为色，所以在无色界肯定没有我所。应当说第七识只缘阿赖耶识及其种子，按照次第执为我和我所。因为种子是阿赖耶识的现识功能，并非实有其物，体是假有。这样讲并不违背圣人的教诲。</p><p>　　护法认为：前述三种观点都不合乎道理，因为色法等种子并不属识蕴，《瑜伽师地论》卷五十二和《摄大乘论》卷二等都说种子实有，如果你们一定认为是假，那就等于无法，应如无法一样，不可作为因缘。而且，第七识与萨迦耶见一起，自无始以来就非常相似，永远相续而生，哪能容许别执有我和我所呢？任何一念心中都不可能同时具有断、常等二见，因为二种互不相同的观点不可能同时而起，也不应当说我和我所一前一后，因为它自无始以来都是一味相续。由此可见，第七识只缘藏识的见分而不是其他的相分、种子和心所，因为藏识见分自无始以来总是粗细一类，相续不断，似常(不像色法、种子那样有间断)似一(不像心所那样多法)。因为心王永远是万物的所依，第七识只缘第八识的见分为自内我，乘语势而说我所，实际上并不是离我而起我所，或者说第七识执第八识为我之我。前我是第六识所缘五蕴和合之义，后我是第七识所计度的我；或前我前念，后我后念，这两个我都由第七识所计度；或者前我是体，后我是用。所以在一个“我见”上有我和我所两个意思。如果这样讲，就很好地随顺佛教道理，因为《瑜伽师地论》卷五十一和《显扬圣教论》卷十七、卷七十九等多处都只说有我见，我和我所不可同时生起。还没有达到转依位的时候，第七识只缘藏识，达到转依位以后，也缘真如及其他的一切法，因为末那识所转的平等性智，具有十种平等性，因为佛知道各种有情众生具有不同的胜解，所以要示现各种佛的影像。这里暂且说在没有达到转依位的时候，所以只说第七识缘藏识。转依是悟，是无漏，能够通缘；末转依是迷，是有漏，不能通缘，所缘是有局限的。在道理上来讲，应当是这样的。无我的境界遍于一切，有我的境是不遍的。这第七识怎么缘自己的所依呢？如有后念的第六意识缘前念的等无间缘意，既是所依，又是所缘，既然大乘和小乘都同意这种观点，说第七识缘自己的所依第八识，这有什么错误呢？</p><p>　　《唯识三十颂》的“思量为性相”，是为了说明第七识的体性(自证分)和行相(见分)，因为第七识末那识以思量为自性，所以又用思量作为自己的行相。由此“思量为性相”，也就兼解末那所立别名的原由，因为能审思量各自所取，就称为末那。末那识在没有达到转依位的时候，永恒思虑量度所执的我相。达到转依位以后，永恒思虑无我之相。</p><p>　　和末那识相应的有几位心所法呢？与四种烦恼相应。颂文的“俱”是为了说明相应的意思，即第七识从无始以来至转依位，无论如何都永恒缘这藏识，与四根本烦恼相应。有哪四种呢？就是我痴、我见，还有我慢、我爱，这四种烦恼。我痴就是无明，愚蠢地执我之相，对无我之理迷惑不解，所以称为我痴。我见就是主张有我，把并不是“我”的东西虚妄计度为“我”，所以称为我见。我慢就是高傲，依靠所妄执的“我”，使心过高地估计自己，所以称为我慢。我爱就是我贪，对于所妄执的“我”深深地产生贪爱执着，所以称为我爱。</p><p>　　颂文的“并”字表示慢、爱与见俱起，爱与慢俱起，这是为了否定小乘佛教说一切有部等不许相应的主张。这四种烦恼经常生起，扰乱搅浑肉心，使其内缘(第七识)永远让外六转识(前六识)处于烦恼之中，有情众生由此沦没生死，回转不息，不能脱离，所以称为烦恼。</p><p>　　外人问：烦恼有十种？这里为什么只讲四种呢？</p><p>　　论主答：因为有我见，所以其余的四见就不可能生起，一念心中不能同时具有两种见解。</p><p>　　外人问：第七识为什么要有我见呢？</p><p>　　论主答：见取见和戒禁取见只是分别生起，只是见道所断。这相应的四种烦恼是同时生起，由修道所断。我所和断、常二边见依我见后生，与第七识相应的我见，不依彼边见生起，永恒任运缘内相续而生，因为它永恒不间断地内执有我，所以有我见。因为我见能够审思决定，疑行犹豫，与之不相应。因为爱见顺着于我，嗔不能产生，所以与第七识相应的烦恼只有四种。</p><p>　　小乘等持不同见解的人问：我见、我慢、我爱为什么能同时生起呢？</p><p>　　论主答：它们的行相不相违背，同时生起有什么错误呢？</p><p>　　外人问：《瑜伽师地论》说“贪使心卑下，慢使心高傲”，怎能说不相违背呢？</p><p>　　论主答：因为分别与俱生有别，外境与内境有别，所凌与所恃有别，粗与细有别，所以我说的与《瑜伽师地论》并无矛盾。</p><p>　　外人问：照你所说，这第七识的心所法只有四种了？</p><p>　　论主答：不是。因为《唯识三十颂》的颂文说“及余触等俱”。</p><p>　　有人认为：第七识的心所法只有九种，即前述我痴、我见、我慢、我爱及其余的触等五法，即触、作意、受、想和思，因为末那识肯定要与遍行心所法相应。前边说触等五法与异熟识相应，恐怕让人误解第七识相应的遍行和前述异熟识相应的遍行一样也是无覆无记，为了说明第七识不同于第八识，所以加了一个“余”字。“及”是合集的意思，前四种我痴、我见、我慢、我爱和后五种触、作意、受、想、思合在一起，永远与末那识相应。</p><p>　　外人问：末那识为什么没有其他的心所法呢？</p><p>　　论主答：欲是希望还没有实现的乐境。末那识随意缘取现境，无所希望，所以没有欲。胜解是判断未曾决定的外境，末那识自无始以来，永恒缘取决定计我，不需要判断，所以没有胜解。念只是记忆自己经历过的事情，末那识永远缘取现在所感受的外境，不需要记忆，所以没有念。定只是系心专注一境，末那识任运而自然，刹那刹那别缘，既然不专注一境，所以没有定。慧就是我见，所以就不用另作解释了。善是净，所以与第七识不相应。随烦恼的产生必须依靠根本烦恼的前后分位差别建立，末那识永远与四烦恼相应，前后一致，没有变化，没有分位差别，所以末那识与随烦恼不相应。</p><p>　　恶作是对以前所作的事情感到后悔，末那识无论如何都永远缘取现境，并不对以前做的事情感到后悔，所以没有恶作。睡眠如果生起，必须依靠身心的沉重惛昧，这是内缘，有时还借助疾病、凉风等外缘。末那识自无始以来，总是内执，不假藉外缘，所以没有睡眠。寻、伺都是缘外境而生，寻属于一种浅的推度，对外境作粗俗的发言。伺属于一种深的推度，对外境作细密的发言。末那识自无始以来只是依于内门而转，永恒一类相续，内执第八识见分为我，用不着推度发言，所以不用寻、伺二心所与之相应。</p><p>　　有人认为：前述对“余”字的解释不合道理，因为《唯识三十颂》特别说“有覆无记摄”，又没说末那识与随烦恼相应，烦恼必须与随烦恼相应，所以这个“余”字是说随烦恼。</p><p>　　关于这个问题，有人认为：五种烦恼普遍地与一切染心相应，如《集论》卷三所说的惛沉、掉举、不信、<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>、放逸永远与一切染心相应。如果没有惛沉的不堪任性等，任何染污性都不能成立。既然烦恼生起时心是染污性，所以在染心位肯定有惛沉等五种随烦恼。如果烦恼生起，肯定是由于无堪任的惛沉、嚣动的掉举，还有不信、懈怠、放逸。掉举虽然普遍地存在于一切染心，但贪位增盛，只能称为贪的一部分。如睡眠和恶作，虽然普遍地存在于善、恶、无记三性之心，但痴位增盛，只称为痴的一部分。虽然《瑜伽师地论》卷五十五说有六种随烦恼普遍地存在于各种染心，该论卷五十八又说有十种随烦恼普遍地存在于各种染心，这只是就某种特定含义说“普遍”，它们并不是真的普遍存在于一切染心。</p><p>　　在二十种随烦恼中，不信、懈怠、放逸、失念、散乱、不正知通粗、细二位，不像忿等十种小随烦恼只通粗位。它们通无记、不善二性，不像无惭、无愧那样只通不善。它们通障定和慧，不像惛沉那样只障定，也不像掉举那样只障慧。惛沉、掉举是别障，不信等六是通障，其相特别明显，所以说这六种随烦恼遍诸染心。在二十二种随烦恼中通粗、细二位和无记、不善二性者，有不信、懈怠等八种大随烦恼，再加邪欲和邪胜解，所以说有十种大随烦恼遍诸染心。所以，这两种说法并不矛盾。然而第七识与十五种心所法相应，即前述五遍行及四根本烦恼的九种和五种随烦恼(惛沉、掉举、不信、懈怠、放逸)，再加别境的慧。我见虽然属于别境的慧，但在五十一位心所法中意义有别，所以分为两种。</p><p>　　末那识为什么没有其他的心所法呢？因为忿等十种小随烦恼行相粗显，末那识思虑细密，所以末那识不与忿等十种小随烦恼相应。无惭、无愧是恶性，末那识无记性，所以末那识与无惭、无愧不相应。散乱使心流散于外境，末那识永远内执，不向外流散，所以末那识没有散乱。不正知是外显的身行、语行、意行，违背善性，末那识总是内执，所以末那识没有不正知。没有其余的心所法与之相应，其义如前所说。</p><p>　　有人认为：应当说六种随烦恼普遍地与一切染心相应，因为《瑜伽师地论》卷五十五说不信、懈怠、放逸、失念、散乱、不正知与所有的染心都相应，如果没有失念、散乱、不正知，心肯定不能生起各种烦恼。心识要缘曾经接受过的外境，和听闻未曾接受的外境，就要产生失念和不正知，这就要生起贪等各种烦恼。烦恼生起的时候，心肯定驰流，于境纵荡，因为都是由于心接受外境而起散乱。惛沉和掉举行相互相违背，不能普遍地生起于各种染心。《瑜伽师地论》所说的五法(不信、懈怠、惛沉、掉举、放逸)普遍存在于染心，是因为：一、它们通粗、细二境，不像念等十种小随烦恼只通粗境；二、只与善法相违；三、它们是纯烦恼，不同于根本烦恼和四种不定；四、通恶、无记二性，不像无惭、无愧那样只通恶性。说十种随烦恼普遍地存在于一切染心，其义如前所说。然而末那识与十九种心所法相应，即前述九法、六种随烦恼和念、定、慧，再加惛沉。这里特别说的念，就如前师说慧那样解释。还有定，系指专注一类所执我境，不曾有一刹那暂舍。前述“加惛沉”，是说末那识与无明相应，其过失特别严重，内心迷执有我，所以有惛沉。没有掉举是因为它与惛沉性质相违背。没有别境的欲和胜解、忿等十种小随烦恼以及四种不定，如前第一师所说，应当知道。</p><p>　　又有人说：有十种随烦恼普遍与一切染心相应，《瑜伽师地论》卷五十八说，放逸、掉举、惛沉、不信、懈怠、欲、胜解、念、散乱、不正知十种随烦恼，能引起一切染心，因为它们通三界的一切处所。当没有欲、胜解的时候，心肯定不能生起各种烦恼。对于所接受的外境，如随顺自己则与之相合，如与自己相违背则与之远离，这就要决定外境的性质，方能生起贪等各种烦恼。怀疑佛教道理者，对物质等客观事肯定没有怀疑，所以和疑问并存的也有胜解。对于所缘事物有怀疑就像怀疑是人是柱一样，并不是产生烦恼的疑问。其余的经论不说欲、胜解普遍存在，是因为缘非爱事物和心有怀疑时，欲和胜解并非粗显。其他的心所法有的与末那识相应，有的与末那识不相应，其义如前所说。末那识有二十四种心所法，即前述九法、十种随烦恼，再加五种别境，其理如前所说。没有其他的心所法，如上述解释应当知晓。</p><p>　　护法认为：上述三师所说都未尽理。怀疑未来世是有是无，对此有什么欲和胜解之相呢？当烦恼生起的时候，如果没有惛沉，应当是没有无堪任性。如果没有掉举，应当是没有嚣动扰恼，就如善、无记一样，并非染污之位。如果染心中没有散乱，就应当不是流荡，这就不是染心了。如果没有失念、不正知，怎能生起烦恼呢？所以染污心肯定与八种随烦恼相应而生，这就是惛沉、掉举、不信、懈怠、放逸、失念、散乱、不正知。如果失念、不正知以别境的念、慧为其体性，它就不会普遍存在于染心，因为并不是所有的染心都缘曾经接受过的外境，因有不正当的简择。如果以无明为其自性，就能与一切染心同时俱起，这由前面所说，即可明了。然而这末那识与十八个心所法相应，即前述九法、八个随烦恼和别境的慧。没有其他的心所法，论有三处(《对法》及《瑜伽师地论》卷五十五和卷五十八)已经解释过了，为什么没有这些心所的理由，依照以前三师的解释可以知道。如果这样说，就不违背佛教道理。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第五",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第五</strong></p><p>　　这染污的末那识与什么受相应呢？有人认为：只与喜受相应，因为它永恒内执于我而生喜爱。有人认为：并非如此，如果允许喜受至非想非非想处，这就违背了圣人之教。应当说这末那识与忧、喜、乐、舍四受相应，如生恶趣则与忧受相应，因为这是以不善业为其条件所引生的果报。生于欲界人趣的初禅、二禅与喜受相应，因为这是以有喜地善业为条件所引生的果报。三禅与乐受相应，因为这是以有乐地的善业为条件所引生的果报。四禅乃至非想非非想处与舍受相应，因为这只是以舍地善业为条件所引生的果报。</p><p>　　有人认为：这种说法也不合理，因为末那识自无始以来，总是毫无变异地缘内阿赖耶识而妄执为我，永无变化，与变异受忧、喜、苦、乐不相应。而且，这末那识与前述阿赖耶识，其义有别者，颂文都要别说，如果与四受相应，颂文也应当别说。既然没有别说，肯定与阿赖耶识相同，所以与末那识相应的只有舍受。在没有达到转依位的时候，与前述心所法相应。达到转依位以后，只与二十一位心所法相应，即遍行五、别境五、善十一。就像第八识阿赖耶识达到转依位以后只与舍受相应一样，它自由运转，永远以平等性智对待所缘的对象。</p><p>　　末那识及其心所法属于什么性质呢？正像颂文所说的“有覆无记摄”，而非其他。因为与末那识相应的四种烦恼(我痴、我见、我慢、我爱)等是染污法，它们障碍成佛之道，掩蔽自己的思想，所以称为有覆。又因为它既不是善性，又不是恶性，所以称为无记性。就像色界、无色界的各种烦恼等由于定力摄藏而是无记性一样，与第七识相应的烦恼所依细密，自由运转，也是无记性。如果已达转依位，它只能是善性。</p><p>　　末那识及其相应的心所法属于哪一地呢？正像颂文所说的“随所生所系”。即生于欲界的有情众生，其现行末那识及其相应的心所法就属于欲界，乃至生于非想非非想处的人就属于非想非非想处天。因为它总是缘取自地阿赖耶识而妄执为我，非缘他地阿赖耶识。如果异熟藏识仍然在欲界地，又起上界彼地的异熟藏识出现在面前的时候，这就称为“生彼地”，染污的末那识缘取它并妄执为我，就系属于阿赖耶识所在的那地，这就称为“彼所系”。或为那地四种烦恼等所系缚称为“彼所系”。如果已达转依位，末那识就不系属于任何一地。</p><p>　　这染污的末那识自无始以来永恒相续，到什么时候才能永远断除或暂时断除呢？</p><p>　　世亲的《唯识三十颂》回答说：“阿罗汉、灭定、出世道无有。”阿罗汉总的显示三乘无学果位，在此位的染意末那识种子和现行都已经永远断灭，所以颂文说“无有”。在三乘学位、灭尽定、出世道中都使末那识暂时被折服，所以颂文说“无有”。这染污意末那识自无始以来，总是微细难知，又相类似，任运生起，在各种有漏道都不能被折服，在三乘圣道才有折服的意思，作真正的无我解释与我执相违背。当无漏后得智出现在面前的时候，随人法观无分别智等流引生，也与末那识相违背。认识真正无我的智慧和后得智都是无漏，所以称为出世道。既然灭尽定是圣道的等流引生，极其寂静，所以此位也没有末那识。因为此位还没有永远断除末那识的种子，灭尽定圣道以后，它还可以产生现行，直至种子还没有完全灭除以前。然而因为与这染污意末那识相应的烦恼是俱生，不是见道所断。因为它是染污性，所以也不是不断。因为末那识极端微细难知，所有的种子与有顶地下下品烦恼一时断除干净，因其势力相等。当修金刚喻定的时候，顿断末那识的种子而成罗汉。所以在无学位，末那识永远不再生起。小乘佛教声闻、缘觉二乘改学大乘的时候，从最初发誓直至未成佛的时候，虽然实际上是菩萨，也称为罗汉，其义应当相同，所以就不另外讲了。</p><p>　　关于这个问题，安慧认为：末那识只与烦恼障相应，因为圣人之教都说阿罗汉、灭尽定、出世道中没有末那识。《显扬圣教论》卷一说末那识永远与我痴、我见、我慢、我爱四惑相应。《摄大乘论》卷一说末那识是识的杂染依。</p><p>　　护法认为：安慧的解释和佛的教诲及佛教理论都相违背，因为《解脱经》说有出世末那，所以此说违教。因为没有杂染的意识和有染的时候一样，肯定有俱生不共所依。《瑜伽师地论》卷五十说，阿赖耶识肯定与一个识共同发挥作用，这就是末那识。意识生起的时候，与两个识共同发挥作用，这就是意识和末那识。如果五识中生起任何一识，这就要与三个识共同发挥作用。乃至于有时前五识同时生起，则与七个识共同发生作用。如果在灭尽定位没有第七识，此时的阿赖耶识应当是不和他识相应，这就不是永远与一个识共同发挥作用了。</p><p>　　在圣道位的时候如果没有第七识，此时的阿赖耶识应当是与一识俱起，《瑜伽师地论》为什么说如果意识生起，此时的阿赖耶识肯定与二识俱起呢？《显扬圣教论》说末那识永远与四烦恼相应，或者反过来说，与傲慢行和平等行相应，所以末那识通染、不染二性。如果由《瑜伽师地论》卷六十三说的阿罗汉位没有染污意便说没有第七识，应由论说的阿罗汉位舍阿赖耶识而认为没有清净的第八识。既然第八识不只在染位有，怎能说第七识唯在染位呢？《庄严经论》和《摄大乘论》都说转第七识得平等性智，这就像其他智一样，肯定有所依的相应净识。如果无此净识，那智也应当是无，不能说没有所依而有能依。也不能说它依前六转识，因为《佛地经》中说，佛的行为永远如大圆镜智。</p><p>　　又，在无学位如果没有第七识，那第八识应当是没有俱有依，但肯定有此俱有依，就像其他的识性一样。又像未证人空我执恒行一样，也应当是未证法空法执恒行。如果没有第七识，平等性智靠什么识呢？不能说它依靠第八识，因为第八识没有慧心所。由此可见，声闻、缘觉二乘圣道、灭尽定和无学位，第七识恒行，因为他们还没有证得法空。《瑜伽师地论》卷五十一和《摄大乘论》卷一都证七识中以五识为同法，证有第七识为第六识所依。圣道生起时和无学位如果没有第七识为第六识所依，所立宗支和因支便都有过失。如果第六识没有所依，前五识也会有无所依的时候，但前五识永恒具有它们的所依，第六意识也应当如此。因此肯定存在没有染污的末那识，在上述三位经常生起。所说的“无”是依染污意思说的，如说四位没有阿赖耶识并不是没有第八识，这也应当如此。</p><p>　　这末那识的差别大概有三种：一与人我见相应，二与法我见相应，三与平等性智相应。第一通一切凡夫相续位、二乘有学和七地以前的渐悟菩萨的有漏心位，在此三位中，末那识缘阿赖耶识而起人我邪见。第二通一切凡夫、声闻、缘觉相续位，在此三位一切菩萨的法空后得智之果都没有出现，末那识缘阿赖耶识而起法我邪见。第三通一切佛位，因为此时菩萨于见道和修道中的法空智慧之果已经产生。此时末那识缘无垢的异熟识等而起平等性智。</p><p>　　人我见生起之位，那法我见肯定要产生。我执肯定依法执而生起，比如一个人夜间行路，远远看到一株木桩，看不清楚，误以为是人等。首先是看不清木桩(喻法执)，然后才误以为是人(喻人执)。我、法二见的作用虽然是有区别，但不相违背，所依慧体是一个，如眼识等，虽然是一个识，但有了别青、黄等多种用途，不相违背，我、法二见也应当是这样。</p><p>　　声闻、缘觉二乘有学圣道和灭尽定出现的时候，顿悟菩萨在修道位，有学渐悟菩萨人空后得智之果出现的时候，都只是起法执，因为我执已经治伏。二乘无学和渐悟菩萨法空智果没有出现的时候，也仅是生起法执，因为我执已经断灭。八地以上的一切菩萨，所有的我执都永远不再发生作用，或者说已经永远断除，或者说永远治伏。法空智果没有出现的时候，仍然生起法执，因为人空观和法执是不相违背的。如《解深密经》说：八地以上菩萨，一切烦恼不再发生作用，只取第七识中法执所知障为其所依。这所知障是现行而不是种子，不然的话，烦恼障的种子也应当存在。法执和末那识一起，对于二乘等来说，虽然称为不染，对于各位菩萨来说也称为染，因为障碍他们的智慧。由此可称为有覆无记，对于声闻、缘觉二乘人等来说，称为无覆，因为不障碍他们的智慧。</p><p>　　末那识属于异熟生，因为它永远从异熟识而生，所以称为异熟生，不是异熟果，因为异熟生与无记之名相通。就像增上缘一样，不属于因缘、等无间缘、所缘缘的都属于增上缘。有四种无记：异熟无记、威仪无记、工巧无记、变化无记。三无记不摄者皆此异熟无记所摄。</p><p>　　我们怎么知道这第七识离眼等六识另有自体呢？通过圣人教诲和佛教逻辑而知。佛世尊在《解深密经》和《楞伽经》中多处讲到心、意、识三种不同的含意。积集种子生起现行的是心，即第八识阿赖耶识。起思虑作用的是末那识，起了别作用的是前六识，这是三类识的不同含意。这三种含意虽然通八个识，但随顺殊胜作用而显示第八识称为心，因为它为一切现行所熏习，形成种子，积集起来，又产生一切事物。第七识称为意，即末那识，因为它缘阿赖耶识等，永恒思虑，妄执阿赖耶识为我。其余六识称为识，因为它们对六种不同的外境起了别作用，粗显易知，有变动，有间断。如《入楞伽经》的颂文这样说：“藏识称为心，思量特性称为意，能够对外境起了别作用的称为识。”</p><p>　　而且，大乘经《入楞伽经》和《佛地经》多处特别讲到有第七识，所以肯定有末那识。各种大乘经都是至教量，前边已经详细讲过了，这里不用重复。</p><p>　　《解说经》中也特别讲到有这第七识末那识，如其颂文说：“这染污的末那识永远与各种烦恼同生同灭，一旦它从诸惑解脱出来，不仅现在没有，过去、未来都没有。”</p><p>　　《解脱经》自己对此颂文是这样解释的：“染污的末那识自无始以来，永远与四烦恼同生灭，这就是我见、我爱、我慢、我痴。对治道产生并断除烦恼以后，这末那识就从烦恼中解脱出来了。此时，这末那识相应的烦恼，不仅现在没有，过去、未来也没有，因为过去、未来没有自性。”像这样的教诲，各部大乘经典都有，但恐繁琐，这里不再赘述。</p><p>　　前面已经引证圣人的教诲，现在应当说明有第七识的基本理论和逻辑推理。《缘起经》说：不共无明微细，并与末那识相应，永恒不断地产生现行，覆无我理，蔽无漏智。如果没有第七末那识，那种不共无明就不应当有。各凡夫之心于善、恶、无记之时，常起迷无我理的不共无明，遮覆真如，障碍圣人的慧眼。如《摄大乘论本》卷上的颂说：“无分别智对于诸法真理应当生起悟解，但有一法常对此起阻碍作用，恒行于善、恶、无记之性，这就是不共无明。”</p><p>　　所以佛经说凡夫永远处于无明长夜之中，盲其慧眼，惛昧醉乱，恒自缠心，不曾觉醒。如果认为在凡夫位有暂时不起的不共无明时，便与佛经说的意思相违背。认为在凡夫位，迷理的无明有的变为现行，有的不变为现行，这在道理上讲不通。如果认为这种无明依六识身，这都不能成立，因为六识有间断，这种无明永恒染污。如果允许有第七识末那识，就没有这种过失了。</p><p>　　小乘佛教徒问：染意末那识永远与我痴、我见、我慢、我爱四惑相应，与之共起的无明为什么称为不共呢？</p><p>　　初师认为：我见、我慢、我爱不是根本烦恼，说不共有什么过失呢？二师认为：初师所说，于教于理皆相违背，因为纯随烦恼中不包括我见、我慢、我爱三种。这三种或者属于六根本烦恼、或者属于十根本烦恼。佛教的论典多处说到染污的末那永远与四烦恼相应。应当说四烦恼中无明是痴主，虽然三惑俱起，也称为不共，因为自无始以来，它们永恒内执惛迷，不曾省察，愚痴增盛。</p><p>　　外人问：我见、我慢、我爱不为主，应当称为相应，若许为主，应当称为不共。</p><p>　　论主回答说：我见等三为主时，也可以称为不共，如无明为主时一样，称为不共并无过失。</p><p>　　三师认为：这种无明称为不共，就像十八不共佛法一样，只第七识末那识有。前师诘难说：如果是这样的话，其余的识与一切烦恼相应，末那识中没有，应当称为不共。</p><p>　　论主回答说：依殊胜之义而立不共之名，并不是他识有此识无都称为不共。与第七识相应的无明永远障碍认识真如的智慧，像这样的殊胜作用，其他识没有，只有末那识有，所以称为不共。</p><p>　　前师问：既然是这样，与此识相应的我见、我慢、我爱也应当称为不共。</p><p>　　论主回答说：无明是主，只有它才得不共之名。或者允许其余三惑也称为不共，因为这是对其余识相应的愚痴而言，所以称为无明。不共无明共有二种：一是恒行不共，只第七识有，其他识没有；二独行不共，第七识没有。所以《瑜伽师地论》说：“无明有二种：若与贪等俱起，称为相应无明；不与贪等俱起，称为独行无明。”主独行无明只有见道所断，如《缘起初胜法门经》说：入见道的圣者有学已经永远断除不共无明，所以不再造新业。非主独行是见道断，也通修道断，因为忿等十种小随烦恼皆通见道所断。恒行不共无明，小乘佛教部派没有，唯大乘有。独行不共无明大乘和小乘都有。</p><p>　　佛经说：以眼根和色境为条件产生眼识，……乃至于以意根和法境为条件产生意识。如果没有第七识，就不会有前六识，就像前五识一定要有眼等增上不共俱有所依一样。第六意识既然是六识之一，从道理上来讲应当承认有这样的所依。如果没有第七识，哪会有第六识的所依呢？</p><p>　　上座部救说：胸中色物为其意根。</p><p>　　论主反驳说：不能说色为意识的所依，因为意并不是色，意识应当像前五识一样，没有忆念和计度的区别。也不能说五识没有所依，五识与五根同时发挥作用，如芽与种子、影与形必定同时一样。又，既然五识与五根必定同缘一境，如心法、心所法必定同时一样。由此道理，大乘和小乘共同承认的意识，就如眼识等一样，肯定有不共所依，不像第八识那样是共依，以显示意识自己的名字于意根处。在十二处中意处所摄，不像上座部所说的胸中色物以为意根，那是法处。不像次第灭意为等无间缘，是增上缘生的俱有所依，因为意识是大、小乘共同承认的六识中的一识，也有它不共俱生的所依。</p><p>　　佛经又说：思量称为意。如果没有第七识，思量之意就不应当有。</p><p>　　小乘佛教说一切有部救说：思量之意是过去的心。</p><p>　　论主反驳说：如果意识出现在面前时，等无间意已经灭除，过去之心已经不存在了。从道理上来讲，过去、未来都是不存在的，意的思量作用肯定不能成立。既然如此，怎么能称为意呢？像经量部所说的那样过去无体假说作用，这在道理上也讲不通。没有真正的思量，假说作用依何而立呢？</p><p>　　经量部或说一切有部救说：过去的意于现在时曾有思量，所以过去称为意。</p><p>　　论主诘难说：过去起思量作用称为意，现在了别称为识，识怎么能称为意呢？由此可知，有一个不同于六识的第七识末那识，永恒起思虑作用，它的真正名字称为意。意有二义：一思量义，二依止义。过去唯依止义。末那识已经灭除了过去依止此识所假立的意名。</p><p>　　佛经又说：如果没有染意末那识，无想定和灭尽定就没有区别了。因为这两种禅定都灭除了六识及其心所，这两种禅定灭除的心法、心所法体数没有区别，都是二十二种。如果不是染污意在无想定中有，在灭尽定中无，这两种禅定还有什么区别呢？如果说这两种禅定在加行、三界、九地、依身等方面有差别的话，这在道理上也讲不通。这些差别之因都是由于第七识末那识的缘故。如果没有末那识，这些差别之因也就不存在了，所以肯定应当有区别于前六识的第七识末那识。</p><p>　　佛经又说：无想天的有情众生，从生到死的一期生命中，前六识的心法和心所法都已经伏灭。倘若认为无想天的有情众生没有末那识。他们应当是没有染污现行。他们长时间内没有六转识，如果没有末那识，就没有我执。也不是其他地方有系缚，一期生命中都没有我执。他们没有我执，就应当像涅槃一样，不是贤人和圣人所厌恶的境界。</p><p>　　说一切有部等小乘佛教救说：初生之位和以后命终时都有心起，因有我执，所以这种意见没有上述过失。</p><p>　　论主诘难说：中间长时没有我执，故有过失。</p><p>　　除经量部以外的小乘佛教部派救说：因为过去和未来有我执，所以没这种过失。</p><p>　　论主诘难说：你们承认过去和未来有我执，而不承认现在常有我执，这就有过失。</p><p>　　小乘佛教救说：过去世和未来世虽然是现在没有，但有不相应行法的“得”，由于这种“得”在现在，所以有现在的我执。</p><p>　　论主诘难说：所得的过去世和未来世是无，能得之“得”也是没有的。因为能得非有，所以不成我执。</p><p>　　大众部、一说部、说出世部、鸡胤部和化地部救说：别有随眠是不相应行法，此位成就，故成我执。</p><p>　　论主诘难说：关于不相应行法，前面已经否定。</p><p>　　经量部救说：虽然没有现行，但有种子，这就称为我执。</p><p>　　论主破斥说：因为你们不承认有藏识，这就没有熏习，哪里来的种子呢？</p><p>　　经量部救说：我们承认的色法和心法都受熏习，既有色根，就有种子。</p><p>　　论主破斥说：除藏识之外的余法受熏问题，前边已经讲过了，这不合乎道理。所以应当有区别于前六识的染污意末那识存在于无想天，永恒生起我执。出定之后仍然沉沦于生死，生起各种烦恼，所以大乘和小乘的贤人和圣人都很厌恶无想天的果报。</p><p>　　佛经又说：凡夫于善、恶、无记心时永远有我执，如果没有第七识末那识，就不应当有我执。凡夫于善、恶、无记三性心时，虽然对外生起各种行为，但对内妄执有我。由于有我执，使眼、耳、鼻、舌、身、意六识所生起的<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>等不能亡相，总想我能布施、我能持戒等。所以《瑜伽师地论》卷五十一说：染污末那识为其他识所依止，当它还没有灭除的时候，境相系缚心，使之得不到解脱。末那识灭除以后，相缚才能得到解脱。</p><p>　　所谓“相缚”，意思是说：不知道境相是因缘和合而生，是假有，就像梦幻、阳焰等一样。能缘是见分，各位心法和心所法是境的相分，由于不懂得这种道理而使心受到束缚，得不到自在，因相分缚心，所以称为相缚。依据这种意思，《阿毗达磨经》的偈颂这样说：这样的染污意末那识被其他的识所依止，这种末那识还没有灭除的时候，识的系缚终究得不到解脱。”</p><p>　　而且，善心和无覆无记心时，如果没有我执，就不应当有烦恼，因为在自类相续中，前六识的烦恼与善性、无覆无记性不能同时生起。从这种道理来看，过去和未来的烦恼就不存在。并不是由于其他人的迷惑而成有漏，恰如不能由于他人的解脱而成无漏一样。</p><p>　　又，不能像大众部所说的那样，另有随眠是不相应行所摄，当这随眠现行相续生起的时候，使善、无覆无记形成有漏法，因为大乘和小乘都认为这种随眠不是实有。也不能像经量部所说的那样，从有漏种子产生善性和无覆无记性，所以成为有漏，因为那善法种子原先并没有构成有漏的内因。并不是由有漏种子使彼善法成为有漏的。也不是在有学无漏心中的无漏种子也有有漏种子随逐。虽然由烦恼引发布施等善，但布施等善业与烦恼染法并不同时俱起，所以烦恼不是有漏善业的正因，只是傍因，因为有漏之说表明与漏俱起。而且，无记业不是由烦恼所引发，无记业又怎能形成有漏呢？然而，各种有漏必须与自身的现行烦恼同时生同时灭，二者之间互相资益，这样才能成为有漏。由此现行熏习而成的有漏法种子，以后生起现行，这就构成有漏的意思。</p><p>　　既然凡夫如此，有学也是这样，末那识没有灭除以前有烦恼相应。无学有漏虽然不与漏(烦恼)俱起，但因为原先的有漏种子生起，所以成为有漏，这并不违背佛教道理。因为有末那识永恒生起我执，使善、无记性之法形成有漏之义。如果没有末那识，肯定没有这种有漏，由此可知有区别于六识的末那识。</p><p>　　证明有末那识的理由很多，随顺《摄大乘论》，大概有六种，各位有智慧者应当随顺<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>学习。然而有的佛经说只有六识。应当知道，这是随顺小<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>者因人施教之理，或者随顺所依六根而说有六识，但识的种类实际上是有八种。</p><p>　　这就讲完了第二能变，第三能变的相状如何呢？</p><p>　　《唯识三十颂》说：“然后是第三能变，差别共有六种，其特点是了别外境，其性质包括善性、恶性和无记性。”</p><p>　　论说：讲完末那识以后，应讲了别外境的能变识相，这种识的差别共有六种，因随顺六根六境而有不同的种类，所以称为眼识、耳识、鼻识、舌识、身识、意识。因随顺六根而立其名，具有五种含义，这就是依于根，根之所发，属于彼根，助于彼根，如于根。虽然六识都依末那识发挥作用，但只有第六识依第七不共意根而立意识之名，如前五识身，各依它们不共的五根而得名，这就没有相互混滥不清的过失。或者说只有第六识依意根，所以称为意识。前六识都因所依而得其名，心(阿赖耶识)、意(末那识)并非如此。前六识或者称为色识、声识、香识、味识、触识、法识，随顺所缘外境而立识名，这是顺通识的意思，这就是随顺对于六种外境的了别功能而立识名。</p><p>　　色识等前五识只了别色等五种外境，法识能够了别一切事物。或者说因为第六识能够了别法，所以只有它才得法识之名。所以六识之名不会相混。这后一种情况，是随顺所缘外境而立六识之名，是依五色根还未自在的情况而说。如果得自在，六根互用，一根所发之识能缘一切外境，只要随顺所依之根，就不会犯相混的过失。《大乘庄严经论》说：佛的五根每一根都能缘五境，是暂且依据粗显和同类外境而说。《佛地经》说：成所作智能够决择各个有情的心行差别，而起不可思议的身、口、意三业，又能作四记等。如果每个根不是普遍之缘，就不会有这样的功能。然而六转识的所依所缘都是粗显易知，大乘和小乘都承认，所以本颂都略而不说。前边已经讲了所依的意思，现在应当讲所缘境的意思。</p><p>　　《唯识三十颂》所说的“了境为性相”，说明了前六识的自性和行相。前六识以了别外境为其自性，又以了别外境为其行相。这又解释了心、意、识中识的别名，因为能了别外境的是识。如佛经所说，眼识如何呢？它依眼根并了别各种颜色。……乃至于意识如何呢？它依意根并了别各种法。彼经所说诸所依中，只就六识不共所依之根而言。未转依位的见分所了别的不同于自证分。与其余识共有的分别依、染净依、根本依，第四卷已经讲过了。其余的了别作用，如果是自证分，第二卷已经讲过了，如果是自在五识见分境，本卷前边已经讲过了。</p><p>　　前六转识属于什么性质呢？属于善、恶、俱非三性，“俱非”就是无记，因为既不是善，又不是恶，所以称为“俱非”。能为今世和前世、来世顺益，所以称为善。人和天神的欢乐果报虽然今世能为顺益，并不顺益于前世和来世，所以称为不善。能违损于今世和来世，所以称为恶。恶趣的痛苦果报，虽然违损于今世，但并不违损于来世，所以不能称为恶。既不是善，又不是恶，既不是顺益，又不是违损，所以称为无记。这六转识如果与信等十一位善心所相应，这就属于善性。如果与无惭等十位心所法相应，这就属于恶性。如果既不与信等相应，又不与无惭等相应，这就属于无记性。</p><p>　　有人认为：前六识的善、恶、无记三性不能同时俱起，因与外境互相违逆。前五识生起的时候，必须由意识导引，五识才能与意识俱生，才能同缘一境，才成善性或染性。如果允许前五识三性并存，就应当允许一念心中通三性，这不合道理，所以前五识肯定不能三性并存。《瑜伽师地论》等说：一刹那间藏识与转识相应，三性同时生起。这是依多念而说，如《瑜伽师地论》所说的“一心”并不是一次生和一次灭，所以上述理论和《瑜伽师地论》讲的并不矛盾。</p><p>　　护法认为：前六识可以三性并存，当率尔心和等流心时，眼等五识或多或少地容许同时生起，前五识与第六意识虽然肯定同时生起，但善、恶、无记三性肯定并不相同，前述诘难在此不能成立。所以《瑜伽师地论》说：当一个人<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>的时候，听到某一种声音，与定相应的第六意识同时发挥作用，其余的耳识也就生起了。并不是只有与那种禅定相应的意识才听取这种声音。如果不是这样的话，耳识不领受这种声音，就不应当为此声而出定。并不是听声时就出定，听到声音以后，如果意识希望出定，这才出定。在修禅定的时候，耳识率尔闻声，从道理上来说这是恶。《瑜伽师地论》说：率尔等五心中，前三心(率尔心、寻求心、决定心)肯定是无记性，这是就未转依位的五识而说，转依以后只能是善性。由此可证，五俱意识不一定与前五识的善等三性相同。《显扬圣教论》卷十九、《杂集论》卷七等多处都只是说五俱意识也缘五境，但没说五俱意识与五识同性。《大乘阿毗达磨杂集论》说：当修等引定的时候没有五识，这是依多分而说。如果与意识俱起的五识中具有善、恶、无记三性，意识随顺它特别注意的一识与之性同，没有特别注意的识就是无记性。所以前六转识善、恶、无记三性可以同时具有。</p><p>　　达到解脱自在的佛位以后，前六识只属善性，因为佛色、<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>等都属道谛，此时已经永远灭除了戏论种子。</p><p>　　前六识与几位心所法相应呢？</p><p>　　《唯识三十颂》说：前六识的心所法有遍行、别境、善、烦恼、随烦恼和不定，与苦、乐、舍三受相应。”</p><p>　　论说：这六转识与六位心所法相应，即遍行等。因为永远依心识而生起，与心相应，并系属于心，所以称为心所。就像属于我的东西称为我所一样。心对于所缘的对象只取其总相，心所对于所缘的对象也取其别相，因协助心完成它的缘境作用而称为心所。就像画人物像的师资，先由师父做模后由<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>填彩一样。所以《瑜伽师地论》说：心识能够了别外境的总相，作意了别心识所未了别之相，这就是诸心所所缘取的别相。触能了别一种外境的可意等相，受能了别乐等感受，想能了别作为言说之因的想法，思能了别产生正确行为等的因相，所以作意等称为心所法。这表明心所也能缘取事物的总相。</p><p>　　《辩中边论》又说：欲也能了别事物的可乐事相，胜解也能了别事物的决定之相，念也能了别自己曾经经历并已熟悉的事物之相，定和慧也能了别事物的得、失等相。由于前述作意等十位心所法缘取总相和别相，于境起善十一、染二十<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>不定四等。诸心所法都对所缘对象也缘取别相。</p><p>　　虽然诸心所法都称称心所法，名义没有区别，但有不同的六位心所法，即遍行五，别境也是五，善有十一，根本烦恼有六种，随烦恼有二十种，不定有四种。这六位心所法总共有五十一种。五种遍行于一切心中皆可得，五种别境只有缘取特定境界时才能生起，十一种善心所只能生起于善心。体性根本能生诸惑，即贪等六根本烦恼。二十种随烦恼只是六根本烦恼的等流，意帮与根烦恼同类，并由根本烦恼所引发。四种不定于善、染、无记之心不定。</p><p>　　然而《瑜伽师地论》卷三把六位心所法合并为五种，因为根本烦恼和随烦恼都是染性，合为一种。又以四个一切辨五位之别，即一切性、一切地、一切时、一切俱。五位心所法中，遍行具四个一切，别境只有最初二个：一切性、一切地。善只有一个，即一切地。染心所四个一切都没有。不定只有一个，即一切性。这就是五位心所的不同。</p><p>　　这六种转识容易变化间断，因其永恒不定，所以都很容易与苦、乐、舍三受相应，都能领受顺境、违境、非顺非违之境。领受顺境使身心感到舒适喜悦，此称乐受。领受违境，使身心受到逼迫，此称苦受。领受非顺非违之境，使身心既不感到舒适喜悦，又不感到逼迫，此称不苦不乐的舍受。</p><p>　　像这样的苦受、乐受和不苦不乐的舍受或者各分为二种：一者与前五识相应，称为身受，因其特别依靠身的缘故；二者与意识相应，称为心受，因其特别依靠心的缘故。而且，这三受又都通有漏和无漏，因为苦受也是由无漏引起的缘故。或者各分为三种：见道所断、修道所断和非所断。又可以分为有学、无学、非有学非无学三种。或者总共分为四种，即善受、恶受、有覆无记受、无覆无记受。</p><p>　　安慧认为：三受可以各分为上述四种，因为在五识中有俱起的任运贪、痴，第六意识在纯苦趣中任运生起的烦恼，是不发业的，是无记性。它们都可以与苦根相应。《瑜伽师地论》五十九说：“俱生烦恼一定要与苦、乐、舍三受现行俱起。各种任运而生的一切烦恼，假若是遍通一切识身，就普遍与一切识所有的苦、乐、舍一切根相应。假定不遍通一切识身而只与第六意地相应者，就只与第六意地所有的苦、乐、舍一切根相应。”《大乘阿毗达磨杂集论》说：“如果欲界系的烦恼，假定是任运而自然的生起，并引起各种<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>行为，这就属于不善。其余的不引发恶行及色、无色界任运而起的烦恼，都是有覆无记。”</p><p>　　由此可知，苦、乐、舍三受，都容许分为善、不善、有覆无记、无覆无记四性。或者将三受总的分为五种，即苦、乐、忧、喜、舍，三受中的苦、乐二受可以各分为二种，因为所缘外境有逼迫身心和适悦身心之相的区别。因为在五识上所感受的逼迫与适悦都是无分别的，所以称为苦、乐二受。因为在意识上所感受的逼迫与适悦，都是有分别的，所以称为忧、喜二受。在五识上所感受的逼迫与适悦都极其粗重，所以称为苦、乐二受。在意识上所感受的逼迫与适悦，都是极其轻微的，所以称为忧、喜二受。像这样的“极其粗重”和“极其微细”是有差别的，所以要分别说明它们的感受。不苦不乐的舍受所以不分为二种，因为它既不是逼迫，又不是适悦，其相没有不同，所以没有区别，其性等同。</p><p>　　各种与五识相应的适悦感受，永远称为乐受。与意识相应的感受，如果是在欲界与初禅、二禅的近分定中，这就称为喜，因为它只是适悦身心。与意识相应的感受，如果是在初禅和二禅的根本定中，就称为乐受和喜受，因为它适悦身心的缘故。如果是在第三静虑的近分及根本定中，称为乐受，因为第三静虑的安静状态，特别深重于前面所有的静虑，于中喜乐都无分别。与五识相应的各种逼迫感受永远称为苦。</p><p>　　有人认为：与意识相应的只是忧，因其逼迫心的缘故，因为诸圣人之教都说音戚受称为忧根的缘故。</p><p>　　《瑜伽师地论》卷六十六说：“生于地狱中各种有情众生，他门的第八异熟识在最初受生以后，更无间隔的有前六识异熟生，苦忧相续。”该论卷五十五又说：“地狱中的有情众生，其寻、伺二位心所法与忧相应，一部分饿鬼趣和傍生趣与之相同。”由此可知，第六意地所感地狱最严重的感受尚且不称为苦，而称为忧，更何况其余的轻微逼迫呢？</p><p>　　护法等论师认为：意地中的苦根区分为二种：忧和苦。在人界和天界永远称为忧，因为这不是重逼。在傍生界和鬼界称为忧和苦。因为容有喜、乐夹杂其间的杂受较轻，所以称为忧，纯受较重，此称为苦。在地狱中只能称为苦，因为这是纯受，是重逼，纯受苦的逼迫，毫无分别。《瑜伽师地论》卷五十九说：“不管怎样产生的烦恼，都与苦、乐、舍三受现行相应。”对这个问题的详细解释如前所说。该论卷五十八又说与生俱来的萨迦耶见只是无记性，应当知道那边执见也是这样。这俱生苦受亦不属于忧根，因为《瑜伽师地论》说忧根不是无记性。地狱中有情众生的诸根，“余三”肯定不能成就现行，纯苦的鬼界、傍生界也是这样。“余三”肯定是乐根、喜根、忧根，因为肯定有七、八二识相续不断，而成现行舍受。</p><p>　　前师反问说：与六识相应的外来舍受肯定不能成就现行吗？</p><p>　　护法等论师回答说：你怎么知道那论文只是讲的外来舍受呢？你不应当说肯定能够成就意根，因为六客识有时没有。不应当认为《瑜伽师地论》只是讲的受中客受，意中通说主识第八识，没有另外的理由作这样的论说。而且，纵使该论像你所认为的那样是依客受而说，如何说地狱定成八根呢？如果认为因为五识不相续，所以一定要说忧根为第八根。死生闷绝时怎么会有忧根呢？如果你认为苦根为第八根，也像前述一样进行破斥。如果以男根或女根为第八根，这在道理上也讲不通，因为地狱众生男形女形不定，他们是由恶业招感，可以无形。因为地狱众生由恶业招感，使五根都永远受苦，所以肯定有眼等五根。你一定要说有男根或女根，这对受苦来说有什么用途呢？并不是在无间大地狱中的受苦众生有希求淫欲之事。由此可见，第八根肯定是舍根，因为第七、八二识与舍根相应。就像在极乐地的意识之喜悦称为乐一样，这里没有喜根。所以在极苦处意识受到逼迫而称为苦，这里没有忧根。所以前面所说的“余三”肯定是忧根、喜根、乐根。</p><p>　　世亲的《摄大乘论释》说在地狱受苦的众生有等流乐。应当知道，这是依小乘佛教说一切有部而说。若依大乘，就应当是傍生趣和饿鬼趣的杂受处没有异熟乐，因为这是纯粹受苦的处所。《对法》卷七等所说的意戚楚感称为忧根，这是依人天趣之全部和鬼、畜趣少分而说，或者随顺小乘佛教说一切有部而说，这和《瑜伽师地论》所说并无矛盾。</p><p>　　《瑜伽师地论》说：“堕生地狱的各类有情众生异熟识没有间断，其异熟果苦、忧相续不断。”又说：“地狱众生寻、伺与忧相应。”鬼趣的一部分和傍生趣也是这样。或是随转小乘佛教说一切有部的教理方便法门而说，与本论所说并无相违之过。而且，地狱等苦根与意识相应，与其余的杂受处和人天中的忧根相类似，并使意识受逼迫，所说苦根为忧，并不是真正的忧受，而是假说为忧。地狱苦根能损众生之身心，虽然属于苦根，但也称为忧。就像在近分定中的喜受一样，因有益于身心的缘故，虽然是喜根，但也称为乐。《显扬圣教论》卷二、卷五十七和《对法》卷七等都说明了这个意思。初禅之前肯定没有乐根，《显扬圣教论》卷五十七说只有十一根。由此应当知道，意地戚楚感受在纯粹受苦的处所也属于苦根。像这样的圣人教诲，差别是多方面的，如三受、五受、有报、无报、界地系、何地断等。但恐繁不述。</p><p>　　有人认为：六识不能与三受相应，因为三受显现出来，彼此互相违背。五俱意识和五识所缘相同，如果是五识与三受相应，意识也应当是这样。这就违背了佛教的正确理论，所以六识肯定不与三受相应。《瑜伽师地论》等说：藏识一时与前六转识相应，三受俱起，这是依多念而说，如说“一心”并不表示一次生一次灭，而是多次生多次灭。所以这种理论与《瑜伽师地论》所说并不矛盾。</p><p>　　护法认为：六识可以与三受相应，因为它们可以同时接受顺境、违境和中境，第六意识不一定与五识的感受相同。当它们特别注意一种外境时，就生起一种感受，当它没有特别注意一种外境时，便生起舍受，所以六识可以与三受相应。</p><p>　　得自在佛果位以后，只有乐受、喜受、舍受，因为诸佛都已经断除了引起忧、苦之因。</p><p>　　前边已经简略标明六位心所，现在应当详细说明它们的特性。最初两位心所法的特性如何呢？</p><p>　　《唯识三十颂》说：“第一位心所法是遍行，包括触、作意、受、想、思五种。第二位心所法是别境，包括欲、胜解、念、定、慧，五种别境的所缘各不相同。”</p><p>　　论说：六位心所中的第一位遍行心所，即触等五种，前第三卷讲第八识的时候，已经详细解释过了。我们如何知道这些遍行心所的特性呢？我们用佛的教诲和正确理论作为认识的标准。这里所说的佛的教诲，如《起尽经》所说：“以眼根和色尘为条件产生眼识，根、境、识三位和合产生触，与触同时生起的有受、想、思。”由此可知，触、受、想、思四位心所是第一位遍行心所法。</p><p>　　《象迹喻经》说：“如果眼根不被破坏，色尘外境出现在面前，作意生起，这才能够产生眼识。”《起尽经》又说：“在那里生起作意，就在那里生起了别作用。在那里生起了别作用，就在那里生起作意，所以作意与了别永远和合在一起。”由此可见，作意也是遍行心所法。像这样的圣人教诲，确实不只一部佛经。从理论上来讲，识的生起必须有根、境、识三位和合，这肯定要产生触，并由触而有三和。如果没有触，心法和心所法就不应当和合在一起共触一境。所以触肯定是遍行。</p><p>　　作意之性能够警心，使心所趣向自境。如果没有作意，心识就不应当生起。受能领纳顺境、违境、中境，使心生起乐、苦、舍相。心不生起的时候，就不会有三受中的任何一受。想能决定特定外境，如大小、颜色、部分、整体等。当心生起的时候，如果没有想，就不能缘取外境的分齐相。思使心成为产生行为的正因、邪因等相，由此形成善、恶、无记三性之业，在没有心识生起的地方，没有三性中的任何一思，所以只要心识生起肯定有思。由此可见，触等五位心所法，当心法生起的时候肯定是存在的，所以称为遍行。其他的心所法不是遍行，其义我们将作适当解释。</p><p>　　然后讲别境，即欲、胜解、念、定、慧。所缘外境大部分不同，所以在六位心所法中放在第二位解释。什么是欲呢？对于可享乐的外境生起希望之性，并辛勤追求。</p><p>　　有人认为：可享乐的外境就是使人欢欣的外境，对于使人欢欣的外境想见、想听等，对此怀有希望。</p><p>　　外人问：对于所厌恶的外境，末得者希望不得，已得者希望别离，这不是欲是什么呢？</p><p>　　论主回答说：当人们只追求不与所厌恶的外境相合或别离之时，人们只追求令人欢欣外境本身，并不追求所厌恶的外境。所以对于人们所厌恶的外境和中境向来无欲，对于令人欢欣的外境如果不生起希望之心，也不会有欲心所生起。</p><p>　　第二师认为：所乐者即所求之境，随境体性可欣可厌，对于可欣事未得望合，已得愿不离。对于所厌之事，未得愿不得，已得愿别离等，因有希望，所以有欲。对于中容外境向来无欲，对于所缘欣、厌外境如果不生起希求，也不会有欲心所生起。</p><p>　　第三师认为：所乐境就是欲观境，对一切想观察和经受的事物，都是因为有希望。如果是不想观察和经受的事物，随顺外境，随意缘取，就都没有欲心所。由此可见，欲不是遍行心所。小乘佛教说一切有部说：因为有希望缘取外境之力，诸心法和心所法才能缘取所缘的对象，所以佛经说欲是万物之本。</p><p>　　论主回答说：这种说法不对。心等缘取外境是由于作意，因为诸圣人之教都说作意出现在面前，能够生起识，在任何地方都没有说过能够由欲产生心法和心所法。如果说爱为万物之本，怎能说心法和心所法皆由爱而生呢？所以前文所说的“欲为诸法本”，是说欲所生起的一切行为，或者说正确的欲望能够引发正确的努力，由此协助成就一切好事，所以《显扬圣教论》等说：欲是产生辛勤努力的基础。</p><p>　　什么是胜解呢？是对确立外境起判断作用，不可动摇。意思是说：由于错误、正确的说教和理论，对于所缘取的外境经过深思熟虑以后再作判断，不被外来的不同因素所动摇。所以于犹豫不决的外境都没有胜解，没经过深思熟虑而作决定之心也没有胜解。由此可见，胜解不属于遍行心所。</p><p>　　说一切有部认为：心等缘取自己的外境时没有阻碍，都有胜解。</p><p>　　论主反驳说：这种意见不合道理，为什么呢？你们所说的“无拘碍”有能不碍和所不碍二种。能不碍是除心法、心所法以外的所有事物，它们都不阻碍心法和心所法的生起，所以“能不碍”就是除心法、心所法以外的一切事物，它们都不能成为你们所说的胜解。“所不碍”就是心法和心所法本身，并不指任何一种心法或心所法，所以也不能成为你们所说的胜解。如果说一切有部救说：由于胜解，心法、心所法的生起都不受阻。论主就会这样反驳：心法和心所法生起的强盛原因，都是由于根和作意，和胜解有什么关系呢？如果说一切有部救说：根和作意的生起，是由于胜解，而不是由于它们本身。论主就会这样反驳：如果说根和作意的生起是由于胜解，胜解的生起又由于其他，这就要犯无穷的过失。</p><p>　　什么是念呢？对于自己所经受的事情明记而不忘怀，是禅定所依的基础。意思是说：对于自己所经受的事物，一再记忆，使之不忘，并能引生禅定。对于未曾经受的事物不起任何忆念。假设说对于自己所经受的外境不能明记，念也不会产生，所以念肯定不属于遍行。</p><p>　　说一切有部认为：当心识生起的时候，肯定有念与之俱起，因为此念能够成为后时忆念之因。</p><p>　　论主反驳说：这种说法不合道理，因为不能说后有痴、信等，前边也有，就说它们是遍行。因为以前的心法、心所法缘取外境，已熏功能在本识中，足为后时有忆念之因，不须前为后因。或者凭于想心的势力强盛，足为后时忆念之因，不需要今念引后念生。</p><p>　　什么叫定呢？对于所观外境，使心专注而不散乱，是智慧所依靠的基础。意思是说：当注意有功德、有过失、中容外境时，由于定的力量使心专注而不散乱。依靠定，心便明净，便有无漏智产生。这里所说的“心专注”是说我们的一念心想住在什么境界上，就能够住在什么境界上，并不是专注一境。否则，见道以十六心观各个真理时，前后之境就会有区别，随时都会出现变化，就不应当有平等持心的<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。当散乱心不专注时，就不会有禅定生起，所以定不是遍行。</p><p>　　正理师认为：散乱心位也有定生起，其相微细隐蔽难知，但应当说是实有。正理师救说：定能使心等和合在一起，共同趣向一境，心起皆有，所以是遍行。</p><p>　　论主反驳说：这在道理上也讲不通，因为这是触的作用。如果你们说这种禅定使刹那顷心不改变所缘的对象，所以属于遍行，这在道理上也讲不通，因为一刹那之心对于自己所缘的对象没有改变的意思。如果你们说由定之心缘取所缘外境，所以属于遍行，这也不合道理，因为作意使心缘取所缘的对象，并非定力。</p><p>　　经量部论师说：这种禅定本体就是心，因为佛经把定学称为心学，静虑支中说为心一境性。</p><p>　　论主破斥说：此说非理。心学是说定依摄于心，使心住于一境，所以称为心，并不是其体就是心，定属于五根、五力、七觉支、八正道等，就像念、慧等一样，定并不等心。</p><p>　　什么是慧呢？对于所经受的外境进行区别，其作用是断除疑惑。对于所经受的外境是有德、有失，还是中容？皆由慧推敲决定。对于没有经受过的外境和愚昧心中都没有区别作用，所以慧不属于遍行。</p><p>　　说一切有部认为：对于没有经受过的外境和愚昧心中也有慧起，但其相微细隐蔽难知。</p><p>　　论主反驳说：一般人不知道有慧，你们这些天爱怎知道呢？</p><p>　　说一切有部救说：因为一身、六足论说慧属于大地法，而小乘的大地法相当于大乘的遍行。</p><p>　　论主破斥说：你们所信仰的一身、六足论互相矛盾，你们怎么能够把它们作为认识事物的标准呢？佛经说只有触等五种是遍行，并没有说过遍行有十种(说一切有部的大地法有十种)，不应当固执己见。然而欲等五种并不是触等五种，如信、贪等一样，肯定不属于遍行。</p><p>　　安慧认为：欲、胜解、念、定、慧这五种别境肯定要互相资助，当一个生起时，其余的四个肯定要生起。</p><p>　　护法等认为：欲等五种别境可能俱起，也可能不俱起，因为《瑜伽师地论》卷二所说的四个一切(一切性、一切地、一切时、一切俱)中，没有后二种。又因为该论卷五十五说：这五种别境依所乐、决定、曾习、所观四境而生，所缘四境和能缘欲等五种别境肯定不能俱起。应当说：这五种别境或许有时只能生起一种，于所乐境只能生起欲，于决定境只能生起胜解，于曾习境只能生起念，于所观境只能生起定。极其愚蠢者为了摄敛粗动散心，虽然专注系念所缘的对象如眉间等住心，但不能对此进行鉴别和判断。人们都知道，他们只有定而无慧。</p><p>　　外人问：如果是这样的话，此境为什么称为所观呢？“所观”是慧的意思。</p><p>　　论主回答说：这种极其愚蠢者，于摄敛心加行位中，有很少的听闻和思考，或者从老师那里听到敛心之说，或者只从经论看到敛心之说，但很少有所简择。此定所缘之境，从定前的加行位来说，称为所观境。或者依据大部分行者而说，是定慧俱起的，如戏忘天专注一境而起贪、嗔等，此时只有定而无慧。像这样只有定而无慧的情况实在是太多了。</p><p>　　或者是于所观境只有慧而无定，意谓掉举多者不能专注一境，他们驰散其心，推求法相或复杂义理。或许有时生起两种，于所乐、决定境中生起欲和胜解。或者于所乐、曾习境中生起欲和胜解，如是乃至于于所观境中生起定和慧，总共有十个二。或者有时于四境生起三位心所法，于所乐、决定、曾习境中生起欲、胜解和念，如是乃至于于曾习、所观境中生起念、定、慧，总共有十个三。或者有时于四境生起四种别境心所法、于所乐、决定、曾习、所观境中生起欲、胜解、念、定，如是乃至于于决定、曾习、所观境中生起胜解、念、定、慧，总共有五个四。或者有时于四境生起五种别境心所法，即于所乐、决定、曾习、所观境中生起欲、胜解、念、定、慧五种别境心所法。像这样的于四境生起欲等五种别境心所法，合前一一别起，乃至于生起五种别境心所法，总共有三十一句。或者于有心位五种别境心所法都不生起，如当四境不出现在面前时，于散疑境等率尔心生起时，以及与藏识俱起时。像这种情况还有多种。</p><p>　　第七、八二识是不是与五位别境心所法俱起，要依据是否成佛而论，正如前边所说。第六意识在各位都与五位别境心所法俱起，若在因位或五俱起，或一一别生；若在果位，一向定有，不管是转依位或未转依位，第六识永远与五种别境心所法俱起。</p><p>　　有人认为：前五识部没有这五种别境心所法，因为前五识缘已得之境，没有希求，所以没有欲。前五识不能深思熟虑并作出决定，所以没有胜解。前五识永远缘取新境，不缘过去境，所以没有念。前五识自性散动，不能专注一境，所以没有定。前五识不能进行推理和鉴别，所以没有慧。</p><p>　　第二师认为：前五识可以有这五种别境心所法。前五识对于外境虽然没有像第六识那样的强烈欲望，但在第六识的导引下，对于乐境有微弱的希望，所以有欲。前五识对于外境虽然没有强盛的深思和判断，但有微弱模糊的印象，所以有胜解。前五识虽然不能清晰记忆过去所经历的事情，但可以微弱忆念外境，所以有念。前五识虽然不能像第六识那样故意系念于一境，但有微弱的专注一境之义。因为不能有等引之定，所以说“自性散动”，但不能否认有等持之定，所以容许有定。前五识虽然对于所缘外境不能进行推理，但有微弱的鉴别之义，所以《瑜伽师地论》卷六十六说：眼通、耳通是与眼、耳二识相应的智慧。既然眼、耳二识有慧，所以其余的鼻、舌、身三识与前二识一样，也有智慧，此说并无过失。在没有得到解脱自在之前，这五种别境心所法或许是没有，但得自在解脱佛位时，这五种别境心所法肯定是存在的。佛期望观看各种外境，其欲并无减退，所以有欲。佛要判断外境，恒常无灭，所以有胜解。佛忆念经历过的外境，并无减退，而且佛的前五识缘过去、现在、未来三世外境，所以有念。佛没有不定之心，所以有定。因为佛的前五识都有成所作智，所以有慧。</p><p>　　这五种别境心所法与什么受相应呢？有人认为：欲与除忧苦二受以外的三受(喜、乐、舍)相应，因为逼迫法生忧受和苦受，欲缘人们所乐好的外境。其余的四种别境心所法(胜解、念、定、慧)与除苦受之外的四受(忧、喜、乐、舍)相应，因为前五识没有对外境进行审思判断的胜解等四种别境心所法。</p><p>　　第二师认为：一切别境心所法都与五受相应。为什么说忧受与欲相应呢？因为《瑜伽师地论》卷五十七说：忧根于无上法思慕欲证，愁戚所摄，即善法欲与忧相俱。纯受苦处的地狱和一部分饿鬼、畜生都希望解脱这种痛苦，意识与苦根相应，前边已经说过了。《瑜伽师地论》卷五十九说：贪爱与忧、苦相应。既然有贪爱，肯定有欲。既然苦根与意识相应，说胜解、念、定、慧与苦根俱起，这有什么错误呢？而且，与五识相应俱有的，也有微弱的胜解、念、定、慧，这个意思正如前文所说的。由此可见，欲等五种别境心所法与苦、乐、忧、喜、舍五受相应，这五种别境心所法所依之性、界、学等，如上述道理应当明了。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第六",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第六</strong></p><p>　　我们已经讲过遍行和别境一位心所法，善心所的相状如何呢？</p><p>　　《唯识三十颂》说：“善心所包括信、惭、愧，以及无贪、无嗔、无痴三根，还有精进、轻安、不放逸、行舍和不害。”</p><p>　　论说：只与善心相应而起，称为善心所，包括信、惭等，肯定有十一种。什么叫信呢？深刻理解并强烈希求实有、有德和有能，其本质特点是心清净，对治随烦恼的不信，乐意行善。然而，信的差别简略来说有三种：一相信实有。深刻相信并深刻理解真实存在的各种事物和道理；二相信有德。深刻相信并十分喜欢三宝的真实功德；三相信有能。深刻相信自己有能力得到并成就一切世间善业和出世间善业，并对此产生希求。由信对治不信，强烈希求证修世间善和出世间善。</p><p>　　外人问：忍是胜解，这是信的原因。乐欲是欲，这是信的结果。确实而论，这信的自相是什么呢？</p><p>　　论主回答说：我不是说过吗？心净是它的特性。</p><p>　　外人难说：还没有讲清楚“心净”的意思，如果净体就是心，这是持业释，信就不应当是心所法。如果“心净”是使心清净，这就是依主释，这与惭等有什么区别呢？如果“心净”是说心与净法相俱，此为邻近释，其诘难与上述内容相同。</p><p>　　论主回答说：此信之体澄清，能净心等。由于有信等善心所，心等方善，因心殊胜，故立“心净”之名，就像水精珠能使浊水清净一样。惭等虽然是善心所，但不以净为其相状，信以净为其相状，所以没有那种相滥的过失。而且，各种染法各有自己的相状。只有不信，不仅它的自相浑浊，并能使其他的心法、心所法浑浊，就像一个极其污秽的东西一样，不仅它自己污秽，还能使其他东西污秽。信与浑浊的不信相反，所以信以净为其特性。</p><p>　　上座部或大乘异师认为：信以强烈追求为其特性。</p><p>　　论主难说：信如果以强烈追求为其特性，追求善、恶、无记三性之境，信也应当通三性，其本体应当是欲。而且，苦、集三谛不应当是信所缘的对象，因为欲缘所乐外境。</p><p>　　大众部或大乘异师认为：信以随顺为其特征。</p><p>　　论主难说：如果是这样的话，应通善、恶、无记三性，这信就成了胜解或欲。如果他们作如下之救：虽然说随顺，本体并非胜解或欲。论主难说：如果是认定随顺，这就是胜解。如果是乐顺其境，这就是欲。如果他们作如下之救：印顺和乐顺之体都是信，并不是欲和胜解。论主难说：离开欲和胜解，肯定没有随顺之相。由此可见，心净就是信。</p><p>　　什么叫惭呢？依靠自己羞耻过恶的法力，崇重贤人和善法，只要是有贤德者，不管是贤人或圣人，皆生崇重，对于一切有漏无漏善法皆生崇重，对治随烦恼的无惭，防止邪恶行为的产生。就是依靠自己的法力，对于自身产生自尊自爱之情，崇贤重善，对于自己所犯的过错和罪恶感到羞耻，对治无惭，使各种邪恶行为不再发生。</p><p>　　什么叫愧呢？依靠世间之力，对于有恶之暴和染法之恶不亲近不作，这些都是愧的特性，对治随烦恼的无愧，防止邪恶行为，使之不再发生。就是依靠世人所诃自厌法的增上促进力，对有恶者之暴徒和染法(令人烦恼的行为)之恶业，不亲近，也不作。对治无愧，使各种恶行为不再发生。对于自己所犯的过错和罪恶感到羞耻，这是惭、愧二法的共性，所以《显扬圣教论》等假说为二法别体。如果认为羞耻是惭、愧二法的特性，惭与愧之体就应当是没有差别，惭、愧二法肯定不能相应而起，并不是受、想等有这样的意思。如果说由待自、他之境而有区别，惭、愧二法应非实有，因为相待而成立的事物肯定没有实体。这就违背了《瑜伽师地论》卷五十五所说善十一中有八种是实有。如果说惭、愧二法实有并分别生起，这又违背了《瑜伽师地论》卷六十九所说的善十一中，有十种普遍存在于善心之中。</p><p>　　外人问：崇重善为惭，唯缘善法。轻拒恶为愧，唯缘恶法。如果说这就是惭、愧二法特性的话，既然惭、愧二法所缘不同，不应当是同时而生。既然是这两种说法彼此相同，为什么要偏偏责备我呢？我也讲到缘境之别，因缘自、他之境，又不同时。</p><p>　　论主反问：谁说过惭、愧二法所缘不同呢？</p><p>　　外人问：如果不是这样的话，又怎样呢？</p><p>　　论主回答说：善心生起时，不管是缘什么境，都有崇重善法和轻拒恶法之义，所以惭与愧都普遍存在于善心，所缘并无区别。</p><p>　　外人问：我前所说不是也有这样的意思吗？</p><p>　　论主回答说：既然你认为惭、愧二法自相相同，有什么理由推翻我前边所设之难呢？然而《<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>》等所说“顾自他”，意思是说自法本身称为自，世间称为他。或者说崇善是顾自，拒恶是顾他。于己有益，称为自；于己有损，称为他。</p><p>　　颂文所说的“无贪等”，包括无贪、无嗔、无痴，这三种称为根，因生善法殊胜的缘故，又因为它们能够直接对治贪、嗔、痴三不善根。什么叫无贪呢？对于三界和造成三界轮回的条件皆无贪着，这是它的特性，对治贪着，令人行善，这是它的作用。什么叫无嗔呢？对于三苦和造成三苦的条件皆不愤恨，这是它的特性，对治嗔恚之心，令人行善，这是它的作用。当善心生起的时候，不管缘什么外境，都对有、有具以及苦、苦具，都无贪着和愤恨之心。观待有等，皆非缘彼，就如前述惭、愧观待善、恶时所说一样，所以无贪、无嗔二法都普遍地存在于善心之中。什么叫无痴呢？对于各种事物及其道理都明确理解而不迷惑，这就是它的特性，能够对治愚痴，令人行善，这是它的作用。</p><p>　　有人认为：无痴以别境心所法的慧为其特性，《大乘阿毗达磨集论》卷一所说的“报、教、证、智，抉择为体”，意思是说：报是生得慧，因为生得善法以宿习为因：闻是闻慧，就是从听闻正法所得到的智慧；思是思慧，就是从思维其义所得到的智慧；修是<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>，就是由于修定所得到的智慧。依照次第，它们都是慧的辨别和决定之性。</p><p>　　问：若体即是别境慧者，何须善中唯说于慧，余四别境善中不说呢？</p><p>　　答：虽然无痴就是慧，为了说明善心所的殊胜功能，能够增加善法，能断不善之根，就像烦恼的恶见一样，因其功能殊胜，所以要特别解说。</p><p>　　护法认为：无痴并不是慧，另有自性，和烦恼的痴正好相反，就像无贪、无嗔一样，属于善根。《瑜伽师地论》卷五十七说：大悲以无嗔、无痴二法为体，并不属于二十二根。如果无痴以慧为其特性，这大悲就如十力、四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>一样，属于二十二根中的慧根和三无漏根。而且，如果无痴没有其他的自性，就像不害等一样，不应当是实有之物，这就违背了《瑜伽师地论》卷五十五所说的十一种善中有不放逸、舍、不害三种是世俗假有，其余的八种是实有。然而《大乘阿毗达磨集论》所说的无痴以慧为体，是以无痴的因果来说明无痴的自性，犹如以忍、乐即胜解、欲一样，以信的因果来解释信的自体，对无痴的解释，从道理上来讲也必然是这样。因为贪、嗔、痴与六识相应，属于根本烦恼，生起恶业的作用殊胜，所以立为不善根。要断除它们，必须经过通对治和别对治，通对治只有善心所的慧，别对治就是无贪、无嗔、无痴三根，因此必须别有无痴。</p><p>　　勤就是精进，在修善断恶的过程中，勇健无堕是它的特性，对治随烦恼的懈怠，成满一切善品为业。“勇”表示精进努力，不同于各种烦恼事业。“悍”表示精纯，不同于四无记，不须要再次净化，这就说明精进只属于善性。精进之相差别简略来说有五种，就是被甲、加行、无下、无退、无足，就是佛经所说的有势、有勤、有勇、坚猛、不舍善轭，按照次第应当明了。这五种区别，就是最初的<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>，和修行中的自分、胜进。自分修行中又分上、中、下三品，或者是因为最初发心、长时修、无间修、殷重修、无余修之间的区别，或者是因为资粮道、加行道、见道、修道、无学道五位之别。声闻、缘觉二乘的究竟无学道回心欣大菩提，所以诸佛的究竟果乐尽未来际，利乐有情众生。或者是因为近远二加行道、无间道、解脱道、胜进道之间的区别。</p><p>　　安就是轻安，意谓轻而安稳，远离粗重称为轻，调畅身心称为安，能够对治惛沉，并能使人达到转依。因为有漏轻安可以压伏能障禅定之法，无漏轻安可以灭除它，使所依身转去粗重而得安稳。</p><p>　　不放逸就是精进和无贪、无嗔、无痴三根，其特性是于所断恶法防令不起，使所修善法修令增长。对治放逸，能够圆满成就一切世间和出世间善法，这是它的作用。就是精进、三根四法于断恶修善的过程中都能起到防恶修善的作用。四法本身就是不放逸，并不是另有不放逸之体，离彼四法无异相故，因为于防恶修善的过程中，离开四法的功能，并无其他的体用。</p><p>　　问：信等十法皆有防恶修善的功能，为什么只讲四法呢？</p><p>　　答：虽然信、惭等六法也有这种防恶修善的功能，但和四法比较起来，其功能微而且劣，四法当中的三法为根，精进遍策一切能断能修善心，六法非根及遍策，所以并非不放逸之依。</p><p>　　顺正理论师等外人问：防恶修善不就是不放逸的特性和作用吗？</p><p>　　论主反问：防恶修善和精进、三根有什么不同呢？</p><p>　　外人回答说：四法没有能力起到防恶修善的作用，四法中必须另有不放逸才能起到防恶修善的作用，所以不能以四法为防恶修善的本体，故知别有不放逸。</p><p>　　论主诘难说：按照你们的意见，四法没有能力防恶修善，所以要待不放逸，不放逸也没有这种能力，需要另有所待，如是展转即有无穷的过失。</p><p>　　外人问：精进只能是普遍策励善心，三根只能作为善法所依，怎能说四法有防恶修善的作用呢？</p><p>　　论主反问：你们所说的防恶修善的相状如何呢？如果普遍依持一切善心称为防恶修善之义，这就是无贪等三根。如果能够普遍促进善心的增长，这和精进就没有区别了。所以防恶修善就是四法。如果令人等不散乱是防恶修善的话，这就应当是定。如果令心、心所同取一境称为防恶修善，这与触有什么区别呢？如果使所作善恶忆念不忘称为防恶修善的话，这就应当是念。按照这种道理推论下去，不放逸的防恶修善作用，离开无贪等四法，究竟不可得，所以不放逸肯定不是另有其体。</p><p>　　什么是行舍呢？行舍即行蕴中的舍，其功能和精进、三根一样，使心平等、正直、无努力性，能够对治掉举，使心安宁。意谓四法使心远离掉举等障碍心静住的因素，这就叫做舍。平等、正直、无努力性符合舍初位、中位、后位之别。首先由不放逸灭除杂染，再由舍使心寂静安住。四法的功能就是行舍，行舍并非另有其体，因为就像不放逸离开四法无其体相和作用一样，能使心寂静者就是四法，变得寂静者就是心等。</p><p>　　什么是不害呢？不损恼有情众生，无嗔恨为其特性，能够对治害，能使人产生悲愍之情。也就是说：无嗔不损恼有情众生，立虚假之名为不害。无嗔与断众生之命的嗔正好相反，不害与损恼众生的害正好相反，无嗔能够给众生以安乐(慈)，不害能拔除众生的痛苦(悲)。所以这里所讲的二种相反只是二者的粗相差别。实际上无嗔实有其体，不害是依无嗔的一部分拔苦之义而虚假成立。为了说慈、悲二相差别，在给众生带来利益和享乐方面，慈、悲二法功能殊胜。</p><p>　　说一切有部认为：不害并不等于无嗔，另有其体，它能够使人贤善。</p><p>　　论主问：其相如何呢？</p><p>　　外人答：就是不损恼众生。但是无嗔也是不损恼，不害怎会有自己的特点呢？也就是说：不损恼有情众生，体性慈悲贤善之相就是无嗔。</p><p>　　颂文的“及”字是为了说明除十一位善心所以外，更有义别心所，这就是欣厌等善心所法。欣厌等和十一种善心所比较起来，虽义有别而立种种名称，但其体无异，并非实有，所以不另外成立。欣与欲相应，是无嗔的一部分，因为对自己所欣赏的外境不憎恨的缘故。不忿、不恨、不恼、不嫉等也是这样，和随烦恼的忿、恨、恼、嫉等正好相反，因为忿等是嗔的一部分，所以不忿等是无嗔的一部分。厌与慧相应，是无贪的一部分，因为对自己所讨厌的外境不染不贪的缘故。应当知道，不悭、不憍等也是这样，与随烦恼的悭、憍等正好相反，悭、憍等是贪的一部分，所以不悭、不憍等是无贪的一部分。</p><p>　　有人认为：不覆、不诳、不谄是无贪、无痴的一部分，和随烦恼的覆等正好相反，因为覆等是贪、痴的一部分，所以无覆等是无贪、无痴的一部分。</p><p>　　二师认为：不覆只是无痴的一部分，因为佛教经论在任何地方都没说过覆也是贪的一部分。</p><p>　　有人认为：不慢属于信的一部分，意思是说，如果一个人信仰某人，他就不会对那个人产生傲慢之情。二师认为：不慢属于舍的一部分，因为心平等的人，就不会过高地估计自己而生傲慢之情。三师认为：不慢属于惭的一部分，因为如果一个人崇敬师长，他就不会产生傲慢之情。</p><p>　　有人认为：不疑属于信，因为如果一个人相信某种事物或某人，他就不会产生犹豫。二师认为：不疑就是正确的胜解，因为下决心者不会有犹豫。三师认为：不疑属于正确的智慧，因为对佛教义理有正确见解者不会犹豫。不散乱之体属于正定，正见、正知都属于善慧。不失念就是<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。恶作、睡眠、寻、伺之性通染和不染，和别境心所法的触、欲等一样，善心所法中没有与此相对的内容。</p><p>　　外人问：六根本烦恼和二十种随烦恼中为什么有的翻过来就是善心所法，而有的就不是这样呢？</p><p>　　论主回答说：有的翻过来，性质和作用都有区别，所以别立为善。有的翻过来，性质和作用没有区别，故不立之。所以你们不应当责备。而且，各种染法普遍存在于六识之中者，因为作用殊胜，所以要翻转过来别立为善。慢等七种根本烦恼(慢、疑、身见、边见、邪见、见取见、戒禁取见)和忿等九种随烦恼(忿、恨、覆、恼、嫉、悭、诳、谄、害)只与意识相应。“害”虽然也是这样，但它一再生起，损恼他人，障碍大乘殊胜原因之悲，为了表明它的强胜违害作用，所以要翻过来成立“不害”善法。失念、散乱、不正知翻过来分别是念、定、慧，列入别境心所法，并不列入善心所法。</p><p>　　外人问：从染翻过来成为净，从净翻过来成为染，为什么染多净少呢？</p><p>　　论主回答说：净体是胜法，染体是劣法，因为以净胜染之劣，是以少敌多，所以染多净少。而且，对净法的解释，能够使人理解事物的普遍真理，其理通于一切事物。对事物之理迷惑不解的有情众生，认识不到事物的本质特征，随顺其染心而把事物的性质分为多种，所以你们不应当责备染、净不等之说。</p><p>　　在十一种善心所法中，有三种是世俗假有，这就是不放逸、舍和不害，其义如前所说。其余的八种是实有，因其性质和作用都有区别。</p><p>　　有人认为：在十一位心所法中，有四种普遍存在于一切善心之中，这就是精进和无贪、无嗔、无痴三根、因为它们普遍存在于定地、不定地、有漏或无漏等善心之中，其余的七种不一定普遍存在于善心之中，因为披读推理，当还没有决定的时候，不会有信产生。惭、傀二法与此相同，依自、他之力不同，都以羞耻为其自相，随便生起任何一种，第二种肯定不能存在。如果在世间道断除烦恼的时候有轻安存在，在无漏道时才能生起不放逸和舍，悲愍有情众生时才会有不害。《瑜伽师地论》卷五十五说：“十一种善心所法在六位生起，因为在决定位有信生起，在止息染法的时候有惭或愧生起，由于自己的力量而使惭生起，由于他人的力量而使愧生起。在善位有精进和无贪、无嗔、无痴三根，在世间道时有轻安生起，在出世间道有舍和不放逸，当对众生产生怜愍的时候有不害生起。”</p><p>　　二师认为：这种说法并不符合道理，在思考事物或原则的过程中，当还没有下定决心的时候，如果没有信产生，就不应当是善，如染心或无记心就不存在没有烦恼的信。惭、愧二法各有别相，体是异类，所依有别，所缘的外境相同，一时俱起，普遍存在于善心之中，在前文讲自体的时候，已经说过了。如果在出世道不产生轻安，这种觉支就不应当是无漏。如果世间道没有舍和不放逸，其心就不应当是寂静的，如染心和无记心，不能防恶修善。而且，不应当压伏掉举和放逸，既然有漏善心具有精进、无贪、无嗔、无痴四法，世间道就应当像出世间道那样具有舍、不放逸二法。当善心生起的时候，肯定不损恼他人，因为有抵制损恼他人的不害存在。</p><p>　　《瑜伽师地论》卷五十五所说的在六位生起十一种善心所，依决定时信增，止染时惭、愧增等，这种说法肯定是不正确的，因为决定时有信等六种增加，并不是只有信一种增加。应当说信等十一种善心所法有十种普遍存在于一切善心，轻安不普遍存在于一切善心，只有定位才有轻安，因为在散位不能调畅身心。因为《瑜伽师地论》卷六十九的《摄决择分》说：“有十种善心所法，不管是定地还是不定地，都普遍存在于一切善心，在定地心中增加轻安。”</p><p>　　有人认为：定前近加行也可以称为定地，此时也有轻微地调畅身心的意思，因此即使在欲界也有轻安。不然的话，便违背《瑜伽师地论》卷三《本地分》所说的信等十一种善心所法通一切地。</p><p>　　二师认为：轻安只存在于定地，由于禅定的滋润而有所长养，因此能够调畅身心。《瑜伽师地论》卷六十三等说欲界的各种心法和心所法由于缺少轻安，所以称为不定地。</p><p>　　《瑜伽师地论》卷三《本地分》所说的“信等十一通一切地”，意谓有寻有伺地、无寻唯伺地、无寻无伺地都有善心所法。这十一种善心所法前文我们都已经说过，第七识和第八识有的位有，有的位无。至于第六意识，在定位都有，如果在散位，只缺轻安。</p><p>　　有人认为：前五识只有十种善心所法，因为当自性散动的时候没有轻安。</p><p>　　二师认为：前五识也有轻安存在，因为禅定所引的善法，也有调畅身心的作用，前五识转成的成所作智肯定有轻安。</p><p>　　这十一种善心所法与什么受相应呢？除轻安之外的十种与五受相应，轻安只除忧、苦二受，因为有逼迫的忧、苦二受，就不会有轻安调畅身心的作用。　　十一种善心所法都与别境心所法相应，因为信等十一种善心所法和欲等五种别境心昕法不相违背。十一种善心所法只有善性，轻安不在欲界，其余的十种通欲、色、无色三界。都通有学、无学、非有学非无学。它们并不是见道所断，《瑜伽师地论》卷五十七说信等六根只是修道所断，并不是见道所断。其他方面的问题，如上述道理皆可明了。</p><p>　　这就讲完了善心所法，烦恼心所法的性质如何呢？</p><p>　　颂说：“烦恼心所法包括贪、嗔、痴、慢、疑、恶见。”</p><p>　　论说：贪等六种，其性是根本烦恼，所以得烦恼之名。什么叫做贪呢？贪爱三界和造成三界轮回的条件是其特性，能够障碍善心所法的无贪，产生痛苦是它的作用。也就是说：由于贪爱之力使取蕴产生。</p><p>　　什么叫嗔呢？憎恨痛苦和造成痛苦的条件是它的特性，能够障碍善心所法的无嗔，使人心情不安，产生邪恶行为，即嗔必定使人身心热恼，生起各种邪恶行为，因其性质不善。</p><p>　　什么是痴呢？对于各种事物及其道理迷惑不解是它的特性，能够障碍无痴，是一切烦恼的所依，即由无明(痴)生起疑、邪见、贪等根本烦恼和随烦恼，能够招感来世烦恼。</p><p>　　什么叫慢呢？总是过高地估计自己，能够障碍不慢，令<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>苦。即如果有慢，对于德法及有德之人，心不谦虚，使人无穷无尽地轮回，受各种痛苦。这种慢的差别有七种、九种之别。这七慢于上、中、下三品生起四种，于我生起一种，于德生起二种。一切都通见道所断和修道所断，圣位我慢即使产生现行，慢由此生起，亦无过失。</p><p>　　什么叫疑呢？对于各种道理犹豫不决是它的特性，能够障不疑，障碍善行。即对佛教义理犹豫不决的人不能产生现行。</p><p>　　安慧认为：此疑以智慧为其本体，因为犹豫鉴别被称为疑。因为在慧上加毗助之，这是疑的意思，因为末底和<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>的意思没有区别。</p><p>　　护法认为：此疑另有自体，使慧犹豫不决并不等于慧。《瑜伽师地论》卷五十五说：“在六种根本烦恼中，见是世俗有，属于慧，其余五种是实有，因为有自性。”末底加毗助之，可以认为慧就是疑，但若南加毗助之，智就应当是识。界有助之力，其义就会变化，所以这种疑不能以慧为其本体。</p><p>　　什么是恶见呢？对于各种佛教道理颠倒错误思度，其慧虚假是它的特性，能够障碍好的见解，招感痛苦是它的作用，因为有恶见者大多受苦。这种恶见的行相差别有五种：</p><p>　　一萨迦耶见，误认五蕴是我和我所，并由此产生一切错误的见解。这种恶见有二十句、六十五等之别。</p><p>　　二边执见，随之妄执断见和常见，障非断非常，处中而行的道谛和出离生死的灭谛。这种边执见的差别，有的主张前际四遍常论和一分常论；有的主张后际有想十六种，无想、俱非各有八论，还有七种断灭论等。</p><p>　　三邪见，否定<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>，认为无此世间、无彼世间、无母无父，无化生有情等，又认为世间无真阿罗汉等，坚持除萨迦耶见、边执见、见取见、戒禁取见之外的一切邪见。像增上缘那样义遍，包括一切邪解。这种邪见的差别，有的主张前际二无因论、四有边论和四不死矫乱。有的主张后际五现涅槃。或者主张大自在天、大梵天、帝释天和自性等永恒不变。或者主张自在天等是产生世间万物之因，或者顽固坚持各种错误虚假的解脱，或者错误地主张以非解脱之道为解脱之道，所有的这一切都属于邪见。</p><p>　　四见取，其余的一切恶见及所依五蕴被认为是最胜能得涅槃清净法，一切外道斗争因此而起。</p><p>　　<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>禁取，即依诸邪见所<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>及戒所依五蕴，被认为是最殊胜能得涅槃的清净法，这种辛勤和苦行对达涅槃毫无用途。然而，《大乘阿毗达磨集论》卷一等都把见取执为最胜，但不言能得净；把戒禁取称为得净，但不言最胜。这只是捕风捉影和概略之说，或者是随顺小乘等派而说。不然的话，怎能把非灭谛执为灭谛、把非道谛执为道谛说为邪见，而不说是见取见和戒禁取见呢？</p><p>　　贪等六种烦恼为总，萨迦耶等五见为别，在这总别十烦恼中，有六种通俱生和分别，任运生起是俱生，思察而生是分别起。疑和邪见、见取见、戒禁取见只是分别起，因为它们是由恶友或邪教之力，通过自己的推理和思考才能产生。边执见中通俱生者，有人认为只是断见，因为常见相粗，要有恶友、邪教和自己的分别才能产生，《瑜伽师地论》卷八十八等说：什么边执见是俱生呢？是属于断见的边执见。修禅者产生这样的想法：今天的这个我在哪里呢？所以，禽兽等如果遇到不利条件，都害怕自己死后断灭而起恐怖。</p><p>　　二师认为：《瑜伽师地论》等是依粗相而说，实际上俱生也通常见。禽兽等认为“我”永恒生存，热心地制造和积聚长期<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的食粮，所以《显扬圣教论》卷一等说：于五蕴计常、断通俱生或分别起。</p><p>　　这十烦恼彼此之间的关系如何呢？贪与嗔、疑肯定不能俱起，因为可爱之境和可憎之境肯定不同时。对于外境犹豫不决，就不会有染着。贪与慢、五见或许可以相应而起，所爱外境和自己所藐视的外境并非同一，所以说不俱起。所爱染的外境和引起我慢之外境可以相同，所以说相应。对于五见外境都可以产生爱染，所以说贪与五见相应并无过失。</p><p>　　嗔与慢、疑有时或许可以俱起，所憎恨的外境和所重视的外境并不相同，所以说不相应。所蔑视的外境和所憎恨的外境可以相同，所以说俱起。刚犹豫不决的时候并不憎恨它，所以说不俱起。经过长久思考仍然犹豫不决，这才产生愤怒，所以说相应。若疑顺己之事，或许不起嗔，若疑违己之事，便嗔于彼。嗔与见取见、戒禁取见肯定不相应，因为见取见执为胜，戒禁取见执为道，因为是顺己之境，所以不憎恨它们。嗔与萨迦耶见、边执见、邪见有时或许可以相应，对于乐蕴生起萨迦耶见和常见，因为不产生憎恨，所以说不相应。对于苦蕴生起萨迦耶见和常见，产生憎恨，所以说俱起。关于断见，与此说相反，谓于乐俱蕴执为断，与嗔相应；于苦俱蕴起断，便嗔不俱。邪见否定恶事之无，便不与嗔俱；否定好事之无，便与嗔俱。按照这样的次第，说嗔或者是无，或者是有。</p><p>　　慢对于外境不疑，疑则不是这样，所以慢与疑没有相应的意思。慢与五见都可以俱起，因为这些心所法的行相都无矛盾。但是慢与断见肯定不能俱生，认为“我”断灭时，不会看不起别人而骄傲自大。慢与一部分萨迦耶见、邪见的关系也是这样。</p><p>　　疑对外境没有深思熟虑，没下决心，与五见相违背，所以疑和五见肯定不能俱起。五见彼此之间肯定不相适应，多种见解不可能同时存在于一心之中。</p><p>　　痴与除此之外的九种烦恼肯定都相适应，因为各种烦恼的生起肯定都是由于痴。</p><p>　　这十种烦恼与什么识相应呢？第八识阿赖耶识与十烦恼的任何一种都不相应，第七识末那识与贪、痴、慢、恶见四烦恼相应，第六意识与十烦恼都相应，前五识只与三烦恼相应，即贪、嗔、痴，因为它们不需要思索和辨别，由于估量比较而生慢等烦恼。</p><p>　　这十种烦恼与什么受相应呢？贪、嗔、痴三种的俱生起和分别起，一切都可以与五受相应。因为贪遇到违己条件，就与忧、苦俱起，嗔遇到顺境条件，就与喜、乐俱起。</p><p>　　有人认为：俱生和分别起的慢可以与除苦以外的四受相应，因为苦蕴弱劣，与忧相应。</p><p>　　二师认为：俱生之慢也与苦受相应，因为意地有苦，前文已经说过了。在地狱纯粹受苦之趣没有分别起慢等，因为在地狱没有邪师、邪教等。一个人今世并没有使他今世下地狱的行为，但前生的强烈分别之惑有使他今世下地狱的行为。疑及邪见、见取见、戒禁取见四烦恼可以与四受俱起，欲界有情众生疑无苦、集谛等，也与喜受俱起。如果缘而俱起见取见、戒禁取见及所依蕴，此时与忧相应。</p><p>　　有人认为：俱生的萨迦耶见、边执见只与喜、乐、舍受相应，并不与五识俱起，因为此俱生者只是无记性。分别起的萨迦耶见和边执见可以与四受俱起，在极苦处执苦俱蕴为我、我所，常见、断见与此相反，与忧受相应。</p><p>　　二师认为：萨迦耶见和边执见如果是俱生的，也与苦受相应，因为在地狱极受苦处缘极苦蕴，与苦受相应。《瑜伽师地论》卷五十九说俱生的一切烦恼都与三受相应，详细解释可参见前文所说，分别二见与第一师相同。上述内容都依确实含义而说。如依粗相而说，贪、慢及除邪见之外的四见与乐、喜、舍三受相应。嗔只与苦、忧、舍受相应，痴与五受都相应，邪见和疑与除苦之外的四受相应。贪、痴与乐受相应，存在于下四地，除贪、嗔、痴之外的七种烦恼与乐受相应，存在于除欲之外的三禅。疑和独行无明在欲界只与忧受、舍受相应。烦恼与受相应的其余情况，如上述道理应当明了。</p><p>　　这十种烦恼与几种别境相应呢？贪、嗔、痴、慢可以与五种别境俱起，因为此四专注一境需要“定”别境心所法。疑和五见各与四种别境心所法相应，疑与除胜解之外的四种别境相应，因其不决定的缘故。五见与除慧之外的四种别境相应，因为五见与慧不能同时存在。</p><p>　　这十种烦恼属于什么性质呢？嗔只是恶性，因为它既损恼自己，又损恼他人。除嗔之外的九种烦恼通善性和无记性。色界和无色界的贪等烦恼只是无记性，因为它们被禅定所摄伏。在欲界系的贪等九种烦恼，如果是分别起的，只属恶性，因为它们一向发动恶行。如果是俱生的有两种：发动恶行的属于恶性，因为损恼自己和他人。其余的属于无记性，其原因有四：一极端微细，二不障善法，三并不是极端损恼自己和他人，四数数现行。应当知道，萨迦耶见和边执见只属无记性，因为它们不发动恶行，虽然一再产生现行，但不障碍善法。</p><p>　　这十种烦恼系于哪一界呢？嗔只在欲界，其余九种通三界。生在下地的有情众生，如果没有离开下地的欲染，则上地烦恼不会出现在面前。要得了上地根本定的有情众生，上地烦恼就可以出现在面前。各种有漏道虽然不能摄伏分别起之惑和俱生细惑，但能摄伏灭除俱生粗惑，逐步证得更高级的根本禅定。修道所伏之惑，一仅是由于迷事而生，二依外缘而起，三此所伏烦恼体散乱，四粗动，直接障碍禅定。</p><p>　　下地分别惑虽然不能摄伏，在修下地禅定以后，下地分别、俱生的各种烦恼都可以出现在面前。生在上地，下地的各种烦恼不管是俱生还是分别起，都可以出现在面前。得第四定的增上慢比丘，命终以后，中有现起，以后由于诽谤释种没有涅槃，便下堕地狱之中。身在上地，将生下地的时候，必然生起下地润生的俱生爱。《瑜伽师地论》卷五十八等文所说的生上地者不起下地之惑，这是依一般情况而说，或者是随顺说一切有部等小乘佛教而说。</p><p>　　下地烦恼也缘上地，《瑜伽师地论》卷六十二等所说欲界系的贪，贪味之力超过禅定，贪求生于上地。《瑜伽师地论》卷五十八既然说嗔憎恨和嫉妒灭道，也应当是憎恨和嫉妒离开欲地。萨迦耶见、边执见和慢总缘三界诸行，妄执有我和我所，生起断见、常见和慢，因为要缘上界或上地。其余五种缘上界或上地，其道理大乘和小乘都是承认的。《大乘阿毗达磨集论》卷六等处所说的贪、嗔、慢等不缘上，是依粗相而说，或依别缘自身为我。因为没有见到别缘我见有计他地现行为我等，边执见必须依身见而起。</p><p>　　上地分别或俱生烦恼也缘下地，《瑜伽师地论》卷五十九说：生在上地的有情众生，依靠自己的殊胜功德，藐视下地有情众生。因为如上文所说总缘三界诸行而认为有我、我所，生起断见、常见和爱，要缘下地。疑及邪见、见取见、戒禁取见四法，应如上述道理考虑。《瑜伽师地论》卷五十八所说的上地之惑不缘下地，是依一般情况而说，或依别缘自我而计为我。</p><p>　　贪等十种烦恼在有学、无学、非有学非无学之中，属于哪一种呢？只属于非有学非无学，只是善性。</p><p>　　这十种烦恼由何而断呢？不通非所断，因为它们不是染污性。分别起的烦恼，只是见道所断，因为它是粗显而易于断的。若是俱生烦恼，只是修道所断，因为它们微细难断。见道所断的十种烦恼实际上都是顿断，因为真见道总缘<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。然而对四谛迷惑不解之相有总有别，从总的来说，贪等十种烦恼一一都迷四谛，苦、集二谛是烦恼产生之因或依据，灭、道二谛使之产生恐惧。</p><p>　　别起意谓烦恼由于对四谛的不同迷惑之相而生起，萨迦耶见和边执见只迷苦谛，除身、边二见之外的八种烦恼通迷四谛，身、边二见只生起于苦果，别观十六行相的空和非我理都属于苦谛。疑及萨迦耶见、邪见、边执见由于对苦谛之理迷惑不解而直接生起。见取见和戒禁取见执前述三见、戒禁取见和所依之蕴为胜为净，于自身起贪，于他见起嗔，于自他二见起慢。相应无明与前述九种烦恼同样迷惑不解，不共无明直接对苦谛之理迷惑不解。疑和邪见直接对集、灭、道三谛迷惑不解，见取见、戒禁取见、贪等，准前苦说，应当明了。然而，嗔也能直接迷于灭、道二谛，由于怕他而生憎恨和嫉妒。关于十烦恼直接或间接迷于四谛的情况，大概就是这样。若详细而说，贪、嗔、慢、萨迦耶见、边执见、邪见和疑，如果是俱生的，随其所应，如彼见道所断。俱生的萨迦耶见和边执见及其相应的贪、慢、无明虽然迷于苦谛，但微细难断，修道才能断除。嗔及其余的独行爱、慢和相应无明等，是迷色、心等的别事而生，虽不迷于理，也不违四谛观，所以是修道所断。</p><p>　　虽然十种烦恼都有相分，但所仗托的本质可以是有，也可以是无，有本质的称为缘有事的烦恼，无本质的称为缘无事的烦恼。各种烦恼的亲所缘缘虽然都是有漏的，但所仗托的本质也通无漏，称为缘有漏无漏烦恼。贪等烦恼缘自地法，其相分似乎是本质，此称缘分别所起事境，缘灭、道谛及他地法，其相分与本质不相似，所以称为缘分别所起名境。其他的有无异熟、有漏无漏等问题都应当按照上述道理进行思考。</p><p>　　这就讲完了六种根本烦恼的特性，各种随烦恼的特性怎样呢？</p><p>　　《唯识三十颂》说：“随烦恼包括忿、恨、覆、恼、嫉、悭、诳、谄与害、憍，还有无惭、无愧，及掉举与惛沉，还有不信和懈怠、放逸及失念、散乱、不正知。”</p><p>　　论说：十种随烦恼只是根本烦恼的所属，或者是它们的分位差别，或者是它们的等流性，所以称为随烦恼。这二十种随烦恼又可以分为三大类：忿等十种因为是各别生起，所以称为小随烦恼。无惭、无愧普遍存在于不善之心，所以称为中随烦恼。掉举等八种普遍存在于染心，所以称为大随烦恼。</p><p>　　什么叫做忿呢？对现前所见所闻不利之事，心生忿怒。能够障碍不忿，使人执持器杖，即怀忿者多发暴烈邪恶的身行和语行。它以根本烦恼嗔的一部分为其本体。离开嗔，没有另外的忿之特性和作用。</p><p>　　什么叫恨呢？由于有忿，心怀恶义不能舍除，结怨仇为其特性，能够障碍不恨，使人身热心恼。即怀恨者不能忍耐，因他永恒身热心恼。恨也以根本烦恼嗔的一部分为其本体，因为离开嗔，就没有恨的特性和作用。</p><p>　　什么叫覆呢？自己犯了罪过，恐怕丢失财利和名誉，遮掩罪过为其特性，能够障碍不覆，使人后悔烦恼。即遮掩罪过的人，以后必然要后悔烦恼，由此不得安隐而住。有人认为：这覆也属于根本烦恼痴的一部分，因为《瑜伽师地论》卷五十五只说覆是痴的一部分，因为他不害怕当来在地狱中受苦才遮掩自己的罪过。二师认为：这覆是根本烦恼贪、痴的一部分，也是由于害怕丢失财利和名誉而遮掩自己的罪过，《瑜伽师地论》根据粗显之相只说是痴的一部分，就像说掉举是贪的一部分一样。然而，说掉举普遍存在于各种染心，不能认为只是贪的一部分。</p><p>　　什么叫恼呢？以忿、恨为先导，随之而来的是狂热和暴行，能够阻碍不恼，蜈蚣以螫为业，是由于以往的恶习所成，接触到违逆的因缘，就会产生凶狠粗暴，毒害他人的心念。犹如蜈蚣螫一样，毒害他人。恼也以根本烦恼嗔的一部分为其本体，因为离开嗔，没有另外恼的特性和作用。</p><p>　　什么叫嫉呢？拼命谋取自己的名誉和财利，不耐他荣，嫉妒是它的特性。能够障碍不嫉，深怀忧戚。即听闻或见到别人有光荣事的时候，深怀忧戚，身心不得安隐而住。嫉也以根本烦恼嗔的一部分为其本体，因为离开嗔，没有另外嫉之特性和作用。</p><p>　　什么叫悭呢？贪着资具等财和理、教、行、果之法，不能惠舍求者，秘藏和吝惜是它的特性，能够障碍不悭，鄙恶蓄积是由于悭的作用。即悭吝者心多鄙恶悭涩，积蓄财法，不能施舍。悭以根本烦恼贪的一部分为其本体，因为离开贪没有另外悭的特性和作用。</p><p>　　什么叫诳呢？为了获得财利和名誉，自己本来无德诈伪有德，诡诈是它的特性，能够障碍不诳，过不正当的生活。即矫诳者诡计多端，很不诚实，过不正当的生活。诳以贪、痴的一部分为其本体，因为离开贪、痴，没有另诳之特性和作用。</p><p>　　什么叫谄呢？为了把别人引入歧途欺骗他，采取不诚实不直接的手段。奸诈是它的特性，能够障碍不谄和正教诲训。即诲曲的人为了把别人引入歧途欺骗他人，错误地随顺时宜，采取各种方便手法，以取好他人，或者掩盖自己的过失，所以不能接受师长和朋友的正确教诲。谄也以贪、痴的一部分为其本体，因为离开贪、痴没有谄之特性和作用。</p><p>　　什么叫害呢？对于各种有情众生无悲愍之心，损恼他人是其特性。能够障碍不害，逼迫损恼他人是害的作用，即害者逼迫损恼他人。害也以根本烦恼嗔的一部分为其本体，因为离开嗔没有另外的害之特性和作用。嗔与害的区别，以善为准则而说。</p><p>　　什么叫憍呢？因获世间荣利、长寿等兴盛事，心恃高举，骄傲自大，耽醉傲逸为其特性。能够障碍不憍，是一切烦恼的所依，即骄傲惛迷者生长一切杂染法。憍也以根本烦恼贪的一部分为其本体。因为离开贪没有另外的憍之特性和作用。</p><p>　　什么叫无惭呢？不顾自己的人格，又不顾真理之法，轻视并远离有贤德之人，拒绝善法，这就是它的特性。能够障碍善心所法的惭，使人行恶，这就是它的作用。</p><p>　　什么叫无愧呢？不顾世间<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>等，崇重暴恶是它的作用。即对于世间道德等都无所顾忌，崇拜有暴恶行为的人，爱重恶法，对于自己所犯的过失和罪恶不感到羞耻，障碍愧，令人生起各种恶行。</p><p>　　对于自己所犯的过失和罪恶不感到羞耻，这是无惭、无愧二法的通相，所以各处圣人之教，特别是在《显扬圣教论》中，虽说不耻是无惭、无愧的体性，那不过是假说为体。如果认为不耻是无惭、无愧二法的别相，就应当认为这二法的本体没有区别。由此可见，无惭、无愧二法不应当是俱生，并不是受、想等有这样的意思。如果自他相待而立是无惭、无愧二法别相，就应当是并非实有，这就违背了圣人教诲。如果允许无惭、无愧二法实有，但分别生起，又违背了《瑜伽师地论》卷五十五等所说的同时普遍生起于一切恶心。因为心不善时，不管是缘什么外境，都有轻视远离拒绝善法和崇拜爱重恶法的意思。</p><p>　　无惭、无愧同时普遍生起于一切恶心，所缘并非不同，所以不能说它们分别生起。然而各处圣教所说“不顾自他”，自法称为自，世间称为他。或许此中拒绝善法崇拜恶法，于己有益称为自，于已有损称为他。而《大乘阿毗达磨集论》所说无惭、无愧二法是贪、嗔、痴的一部分，是说无惭、无愧是贪等三法的等流，并不是与此三法同性。</p><p>　　什么叫掉举呢？使心于所缘外境不寂静是它的特性，能够障碍善心所的行舍和别境心所的定。有人认为：掉举属于贪的一部分，因为《瑜伽师地论》等只说掉举是贪的一部分，是由于回忆过去的享乐之事而生。</p><p>　　二师认为：掉举不只属于贪，因为《大乘阿毗达磨集论》等说掉举普遍存在于一切染心。而且，掉举的特性是不寂静，据说掉举具有一切烦恼的共性，掉举离开烦恼的共性没有另外的特性。虽然依一切烦恼虚假成立，但贪位增盛，所以说是贪的一部分。</p><p>　　三师认为：掉举另有自性，普遍存在于一切染心，如不信等，不能说是除贪之外其余烦恼的一部分，便认为是并非实有。如不信、懈怠，《大乘阿毗达磨集论》说为痴分，《瑜伽师地论》说是实有。因为不能说不信、懈怠是假有，所以不能说掉举是假有。《瑜伽师地论》卷五十五所说的世俗有，如睡眠、恶作二法称为世俗有，是随他相而说。掉举的特性就是嚣动，因为它使俱生之法不寂静。如果离开烦恼不会有这样的特性，不应当像二师那样特别指出障碍奢摩他，不寂静并不是这样的特性。</p><p>　　什么是惛沉呢？使人对于外界无堪能任持是它的特性，能够障碍轻安和毗钵舍那，这就是它的作用。有人认为：惛沉属于痴的一部分，因为《瑜伽师地论》只说惛沉是痴的一部分，因为惛昧沉重是痴的特性。</p><p>　　二师认为：惛沉不只属于痴，因为无堪能任持是惛沉的特性。一切烦恼都无堪能任持，离此没有外惛沉的特性。惛沉虽然是依一切烦恼而虚假成立。但在痴位增盛，所以只说是痴的一部分。</p><p>　　三师认为：惛沉另有自性，虽然称为痴的一部分，只是痴的等流，就像不信、懈怠那样，并不属于痴。随痴相称为世俗有，就像睡眠等一样是实有性。惛沉的特性就是昏懵沉重，因为它使俱生之法无堪能任持。如果离开烦恼不会另有惛沉的特性，不应当特别说明障碍毗钵舍那，因为无堪能任持并不是这样的特性。惛沉与痴的区别，在于痴对外境迷惑不解，正障善中无痴，但并非惛懵沉重。惛沉对外境惛懵沉重，这是它的特性，正障善中轻安，但并不是对外境迷惑不解。</p><p>　　什么是不信呢？对于三宝的实有之事、实有之德、实有之能不相信、不高兴、没愿望。其心污秽是它的特性，能够障碍对于佛法的相信，懈怠所依是它的作用，因为不信者多有懈怠。不信的三个特点，把善心所法的“信”翻转过来就会知道。然而各种染法各有自己的特性，只有这不信的性质污秽，又能使其余的心法、心所法变得污秽。就像是极其污秽的东西，不仅自己污秽，还能使其他的东西污秽，所以不信以心秽为其特性。由于有不信，对于有三宝的实有之事、实有之德、实有之能不相信、不高兴、没愿望，并非另有自性。如果对其余的邪恶之事相信、高兴、有愿望，只是不信的因果，并不是不信的自性。</p><p>　　什么是懈怠呢？在修善断恶的过程中懒惰是它的特性，能够障碍善心所法的精进，增生染污行为是它的作用。即有懈怠者能够滋生增长染污行为。在各种染污事中勤勉也称为懈怠，因为它减退善法。于无记事勤勉者对于各种善法不增进，也不减退，这是别境心所法的欲和胜解，没有另外的心所法。如果对于无记法相信、高兴、有愿望，此心不净也不染，非信非不信。</p><p>　　什么叫放逸呢？不能防染，也不能修净，纵姿荡逸是它的特性。障碍善心所法的不放逸，依靠它能够增长恶法。即由于懈怠和贪、嗔、痴三毒，不能防止染法，也不能修行善法，总称为放逸，并不是另有其体。虽然慢、疑等也有放逸的能力，也不能防恶修善，但和懈怠、贪、嗔、痴四法比较起来，势用力微劣，障碍三善根和普遍促进一切善法的精进，放逸的这种特性能从不放逸推论出来。</p><p>　　什么是失念呢？对于各种所缘外境不能清楚记忆，这就是它的特性。能够障碍正念，是散乱的所依，这就是它的作用，因为失念者的心是散乱的。有人认为：失念属于念的一部分，因为《大乘阿毗达磨集论》说念与烦恼相应。</p><p>　　二师认为：失念属于痴的一部分，因为《瑜伽师地论》卷五十五、五十八说失念属于痴的一部分。痴使念失，所以称为失念。</p><p>　　三师认为：失念属于念和痴的一部分，因为初师和二师所讲都是捕风捉影和概略之说，《大乘阿毗达磨集论》又说失念普遍存在于一切染心。</p><p>　　什么是散乱呢？于各种所缘外境，使心驰流，使心荡逸，这是乱的功能。散乱能够障碍正定，是邪恶智慧的所依。即心散乱者能够引生邪恶智慧。有人认为：散乱属于痴的一部分，因为《瑜伽师地论》卷五十五说散乱属于痴的一部分。</p><p>　　二师认为：散乱属于贪、嗔、痴的一部分，因为《大乘阿毗达磨集论》说散乱属于贪、嗔、痴三毒的一部分，《瑜伽师地论》卷五十五说它是痴的一部分，是因为它普遍存在于一切染心。贪、嗔、痴三毒使心驰流荡逸，超过其他的烦恼法，所以把它们说为散乱。</p><p>　　三师认为：散乱另有自己的本体，《大乘阿毗达磨集论》说它是贪、嗔、痴三毒的一部分，是因为它是三乘的等流，如无惭、无愧非即彼三分，随他三分的相说明世俗假有的特点就是躁扰，因为散乱使俱生之法都驰流荡逸，如果离开贪、嗔，痴，没有另外的自体，不应当特别说明障碍定。</p><p>　　外人问：掉举、散乱二法的作用有什么区别呢？</p><p>　　论主回答说：掉举使俱生心、心所之解一再转易，也就是一境多解。散乱令心易缘别境，即一心易多境。外人问：如五识等一念染心，如何说易？论主回答说：虽然一念刹那之中，解、缘二法无俱易义，而多念相续有易解、缘义。染污心存在的时候，由于掉举、散乱二法之力，经常变易理解和变易所缘，或者由于俱生念、定等力制伏掉举散乱，就像系缚猿猴一样。俱生染心可以暂时专注一境，所以掉举和散乱都普遍地存在于一切染心。</p><p>　　什么是不正知呢？对于所观外境错谬邪解是它的特性。能够障碍正知，多起邪恶的身业和语业，并多犯惑等，即不正知者大多毁犯<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。有人认为：不正知于属慧的一部分，因为《大乘阿毗达磨集论》说不正知是与烦恼相应的慧。</p><p>　　二师认为：不正知属于痴的一部分，因为《瑜伽师地论》卷五十五说不正知是痴的一部分。使知不正称为不正知。</p><p>　　三师认为：不正知属于慧和痴的一部分，初师、二师所讲都是捕风捉影和概略之说，因为《瑜伽师地论》说不正知普遍存在于一切染心。</p><p>　　颂文中的与、并、及是为了说明随烦恼不只二十种，如《法蕴解杂事经》等说有贯等很多种随烦恼。随烦恼之名也包括烦恼，因为随烦恼是烦恼的等流性。因为随烦恼与烦恼同类，其余的染污法只称为随烦恼，并不属于烦恼。只说二十种随烦恼，因具三义：一非根本烦恼，二唯染，三粗显。除此其余的染污法或此分位，或此等流，都属于这二十种随烦恼，随其类别不同，如上述道理应当知道。</p><p>　　在这二十种随烦恼中，小随烦恼十种和大随烦恼三种肯定是假有，无惭、无愧、不信、懈怠肯定是实有，因为教和理都使之成立。掉举、惛沉、散乱三种有人认为是假有，有人认为是实有，所引理教如前，应当知道。</p><p>　　二十种随烦恼都通俱生和分别起，因为随烦恼是依此二类根本烦恼的势力而起。在这二十种随烦恼中，十种小随烦恼各自相望，定不俱起，因为体性相违，行相粗猛，一一各为主。无惭、无愧二种中随烦恼普遍与一切不善心相应，只要是不善心，肯定有这二种随烦恼，随其所应，皆得与小十、大八俱起。《瑜伽师地论》卷五十八说八种大随烦恼普遍存在于各种染心，展转自类相望，与小十、中二都可以俱起。《瑜伽师地论》卷五十五说大八中除惛沉、掉举以外的六种，普遍存在于一切染心，惛沉、掉举增时不能俱起，《集论》卷六说五法普遍存在于染心位，因为惛沉、掉举等五法只是与善相违。</p><p>　　二十种随烦恼只是染性，不与第八识相应；第七识中只有大随烦恼八种，取舍差别如上文所说应当知道；第六识容有一切随烦恼。十种小随烦恼行相粗猛，前五识中没有，相应俱起的中二、大八五识中容有。</p><p>　　由此可见，中二、大八与五受相应。有人认为：十种小随烦恼，除谄、诳、憍三种以外，忿等七种只与喜、忧、舍三受相应，谄、诳、憍三种与除苦之外的四受相应。</p><p>　　二师认为：忿等与除乐受以外的四受相应，谄、诳、憍三种与五受相应，意地有苦受，前文已经说过了。此受俱起的行相，如前根本烦恼中所说，真实的意思就是这样。如果随顺粗相而说，忿、恨、恼、嫉、害五法，只与忧和舍受相应，覆与悭二法只与喜、舍二受俱起，其余三法再增一个乐受，中随烦恼和大随烦恼，其相粗显，也如前面“实义”的说法一样。</p><p>　　这二十种随烦恼与五种别境心所法都可以相应俱起，因为它们的行相不相违逆。失念、不正知虽然不与念、慧相应，但与其痴分相应。问：忿缘现在境，念缘曾习境，二法怎么相应呢？答：因为念也缘曾习现在境，是过去曾习的同类。忿也缘刹那过去境，所以忿与念也可以相应。问：定专注一境，散乱缘取多境，二者怎么相应呢？答：染定生起的时候，心也躁扰，所以说散乱与定相应，并无过失。</p><p>　　中二、大八十种随烦恼俱起。十种小随烦恼肯定不能与见、疑俱起，因为十种小随烦恼行相粗动，见、疑行相审细。忿等五种小随烦恼可以与慢、痴俱起，不与贪、嗔并起，因为是嗔分。悭与痴、慢相应，不与贪、嗔并起，因为它是贪的一部分。憍只与痴相应，与慢的解说不同，是贪的一部分。覆、诳与谄、贪、痴、慢相应，因为它们的行相不相违逆，是贪、痴的一部分。</p><p>　　七种小随烦恼和二种中随烦恼只是恶性。三种小随烦恼和八种大随烦恼也通无记性。</p><p>　　七种小随烦恼和二种中随烦恼只属于欲界，诳、谄二种属于欲界和色界，其余的随烦恼通三界。生在下地的有情众生，能够生起上地十一种随烦恼，行者对自己所修的禅定，生起有力的耽着，于他欲界有情众生起憍、诳、谄，若生上地的有情众生，生起下地后十种随烦恼，中有邪见生无惭、无愧，命终起爱时具有八种大随烦恼。十种小随烦恼生在上地，没有理由生在下地，因为不是润生，又不是否定灭谛的邪见。二种中随烦恼和八种大随烦恼也缘上地，与前根本惑中所说上缘贪等相应生起。</p><p>　　有人认为：处于下地的十种小随烦恼不缘上地，因为它们行相浅近，不能深远缘取彼界。</p><p>　　二师认为：嫉等也可以缘取上地，对上地有情可以生嫉等。生于上地的八种大随烦恼和谄、诳也缘取下地，与前根本惑中所说下缘慢等相应俱起，大梵天对释子马胜生起谄、诳，憍不缘下地，因为下地法劣，不能成为憍的所依。</p><p>　　二十种随烦恼都不属于有学、无学，因为它们只是染法，有学、无学只是净法。</p><p>　　后十种随烦恼只通见道所断和修道所断，因为它们与俱生、分别两种根本烦恼相应生起。见道所断的随烦恼，随从总的或分别迷于四谛之相而生起，迷于四谛是直接还是间接的问题，都如前文讲根本烦恼时所说。</p><p>　　关于前十种小随烦恼，有人认为：只是修道所断，因为此十缘粗事境，是任运而生。</p><p>　　二师认为：通见道所断和修道所断，因为它们依俱生、分别二种烦恼势力生起，也缘他人我见等而生忿等十种小随烦恼。见道所断的随烦恼，随其所依止前能所引生烦恼，或从所缘以分四谛，迷谛总别之惑都通四谛。有人认为：忿等十种小随烦恼，只缘迷谛之惑所生，不直接迷于四谛，因为它们行相粗而浮浅，不能深远缘取。二师认为：嫉等也直接迷于四谛，因迷灭谛、道谛等而生嫉等。</p><p>　　然而，忿等十种小随烦恼只缘真实存在的东西，因为它们要依托本质才能生起。二十种随烦恼缘有漏、无漏的情况，如前根本惑中所说应当知道。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第七",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第七</strong></p><p>　　这就讲完了二十种随烦恼的行相，不定心所法有四种，其相如何呢？</p><p>　　《唯识三十颂》说：「不定心所法即悔、睡眠、寻、伺，分为二类，每类包括二种。」</p><p>　　论说：因为悔、眠、寻、伺于善、染等都不肯定，不像触等那样肯定普遍存在于一切心法，也不像欲等那样肯定普遍存在于一切地，所以立不定之名。</p><p>　　悔就是恶作，嫌恶作过的事情，后悔是它的特性，障碍禅定是它的作用。此恶作即是于果上假立因名，先恶作显其因，后追悔明其果。后悔原先不作也属于恶作，如后悔说：「我原先不作这样的事情，是我的后侮。」</p><p>　　眠就是睡眠，使身体不自在，令心极闇轻略是它的特性，障碍智慧是它的作用。即睡眠位身体不自在，其心极端闇昧弱劣，只有意识在发生作用。闇昧不同于定，轻略不同于醒时的散心位，是为了说明睡眠并不是没有体和用。有于无心位也称为睡眠，这是假立，犹如其余的盖和缠，因与心相应。</p><p>　　有人认为：悔、眠二法只以痴为其本体，因为《瑜伽师地论》卷五十五说它们是随烦恼和痴的一部分。</p><p>　　二师认为：并非如此，也通善性，应说此二染者以痴为体，净就是无痴，《瑜伽师地论》卷五十五依染分义说它们属于随烦恼和痴的一部分。</p><p>　　三师认为：这也不对，因为无记性不是痴，也不是无痴。应说恶作以思、慧二法为体，明了知所作，故以慧为体，思择所作，故以思为体。睡眠以思、想二法为体，因为睡眠时思想各种梦境，《瑜伽师地论》卷五十五说悔、眠二法都是世俗有，它们的染污性是痴的等流，如不信等，《瑜伽师地论》说是痴的一部分。</p><p>　　四师认为：这种说法也不合理，应当不是思、慧、想，因缠彼净性。应当说悔、眠二法各有别体，因为与其余心所法的行相有区别。《瑜伽师地论》随痴相说为世俗有。</p><p>　　寻就是寻求，使心怱迫遽急，以意普遍缘境，但性相粗动。伺就是伺察，使心忽迫遽急，以意普遍缘境。但性相细动。身心的安住或不安住，完全依于寻、伺二法。寻、伺二法都以思、慧的一部分为其本体，由寻对意言境粗转是不深推度，伺对意言境细转是深推度，这就形成意义和种类的差别。如果没有思和慧，寻、伺二法的本体和种类就没有差别了。</p><p>　　颂文的「二各二」，有人认为：这表明寻、伺各有染、净之别。二师认为：这种解释不合道理，因为悔、眠也有染、净二性，应说如前诸染心所一样，有的是根本烦恼，有的是随烦恼，这根、随二烦恼称之为二，各有不善和无记二性，称为各二，或者表明此二各有现行缠和种子随眠。</p><p>　　三师认为：这种解释也不合理，因为颂文讲四种不定以后才有「二各二」等。应当说第一个二表明有二种二：一、悔、眠二，二、寻、伺二。第二个二表明每一种不定心所法都有不同的二种界、性等。四种不定心所法各有染性和不染性，不像善、染心所各各只有一性。《瑜伽师地论》卷五十五等说为随烦恼，是恐怕混同于前文所讲的唯染。为了表明不定心所法的意思才说「二各二」，所以这样讲非常有用。</p><p>　　四种不定心所法中寻、伺肯定是假有，因为《瑜伽师地论》卷五十五等说寻、伺是由思、慧和合而成。关于悔、眠问题，有人认为：也是假有，因为《瑜伽师地论》卷五十五说它们是世俗有。二师认为：悔、眠二法是实有，因为《瑜伽师地论》卷五十五说只有寻、伺是假有。所说世俗有是随痴分而说，并没有说悔、眠二法肯定是假有。又比如说，内法种子的本体虽然是实有，但《瑜伽师地论》卷五十二也说是世俗有。</p><p>　　四种不定心所法中的寻、伺二法肯定不能相应而起，体类虽然相同，但粗、细不同。根据寻、伺有染无染的情况而立三地之别，不根据它们种子和现行的有无去区别，所以不会出现三地的混乱状况。寻、伺二法与前述悔、眠可以相应而起，前述悔、眠二法也有相应而起的意思。</p><p>　　四种不定心所法都不与第七识、第八识相应，其义如前所说。悔、眠只与第六识相应，因为不是五识俱法。有人认为：寻、伺也与五识相应，因为《瑜伽师地论》卷五十六说前五识有寻、伺。《瑜伽师地论》卷五又说寻、伺就是七分别，即有相等，因为《杂集论》又说任运分别就是前五识。</p><p>　　二师认为：寻、伺只与意识相应，因为《瑜伽师地论》卷一说寻求分别、伺察分别等七分别都是只与意识相应的不共法。《瑜伽师地论》卷五又说寻、伺只与忧、喜受相应，从来没有说过与苦受、乐受相应。舍受普遍相应，《瑜伽师地论》可以不说，为什么不说与苦受、乐受相应呢？虽然初定有意地乐受，但不离喜受，总的说为喜受。虽然地狱等纯受苦处有意地之苦，但与忧受很相似，所以总说为忧。因为《瑜伽师地论》卷五又说寻、伺以名身等为所缘，并不是前五识以名身等为所缘之境。然而《瑜伽师地论》卷五十六等说前五识有寻、伺，表明前五识大多数由于寻、伺而引起，并没有说与之相应。《杂集论》所说的任运分别即五识，这与《瑜伽师地论》所说的分别不同。《杂集论》说任运就是前五识，而《瑜伽师地论》说任运就是五俱意识与寻、伺相应。所以，初师的引证不能成立。由此可见，前五识肯定没有寻、伺。</p><p>　　有人认为：恶作与忧受、舍受相应，因唯戚行，又通无记。睡眠与喜受、忧受、舍受相应，因其行相通欢喜、忧戚和中庸之境。寻、伺与忧、喜、舍、乐受相应，因为初定中意识与乐受相应。二师认为：这四种不定心所法也与苦受相应，因为地狱等纯苦趣中意识与苦受相应。</p><p>　　四种不定心所法都可以与五种别境心所法相应，因其能缘行相和所缘外境不相违逆。</p><p>　　悔、眠只与十种善心所法相应，因为它们只在欲界，没有轻安。寻、伺可以与十一种善心所法相应，因为初定中有轻安。</p><p>　　悔只与痴相应，因为悔的行相粗，贪等九法的行相细。睡眠、寻、伺与十种烦恼相应，因为它们彼此之间不相违逆。。</p><p>　　悔能与中、大随烦恼相应，不与忿等十种小随烦恼相应，因为它们各自为主。睡眠、寻、伺能与二十种随烦恼相应，因为睡眠等三位能够生起二十种随烦恼。</p><p>　　这四种不定心所法都通善等三性，因为对无记行为也可以追悔。有人认为：悔、眠只通生得善，因为恶作行相粗而体鄙，睡眠昧略。寻、伺二法也通加行善，因为闻、思、修三位都有寻、伺。二师认为：悔、眠也通加行善，因为在闻、思位中有悔、眠。眠、寻、伺三法都通染性、净性和无记性，恶作不是染性，因其行解粗猛。</p><p>　　在四种无记中，悔只通中间的两种，因其行相粗猛，不能与异熟无记相应。不是禅定之果，不能与变化无记相应。眠与除第四无记以外的三种无记相应，因为睡眠不是禅定所引生，异熟无记之心也可以有睡眠。寻、伺与除第一种无记以外的三种无记相应，因为异熟无记心微劣，不能寻求、伺察名等五法的意思。</p><p>　　恶作、睡眠只存在于欲界，寻、伺存在于欲界和初定，因为其余二界及地之法都妙胜寂静。悔、眠二法一旦生到上地的有情，必定不会现起。生于上地的有情众生，其寻、伺缘能下地；生在下地的有情众生，其寻、伺能缘上地。有人认为：悔、眠不能缘上地，因为恶作的行相粗近，眠的行相极其昧略。二师认为：悔、眠也缘上地外境，因为有邪见者后悔自己修过的禅定，梦能够普遍缘取自已经历过的事情。</p><p>　　悔并不是无学，因为离开欲界时要舍掉悔。睡眠、寻、伺都通三种，因为寻求解脱者的有为善法都称为有学，修学达到究竟位者，其有为善法都是无学。</p><p>　　悔、眠只通见道所断和修道所断，因为悔、眠也是由于邪见等势力而生起，悔、眠不是无漏道直接所引生的，也不像忧根那样深求解脱。如果已经断除了一切有漏法，就称为非所断，所以无学的睡眠也是非所断。寻、伺虽然不是真无漏道，然而它们在加行位能够引生无漏，又从无漏引生寻、伺，所以通见道所断、修道所断和非所断。有人认为：寻、伺所以是非所断，是因为在五法中只属于分别，因为《瑜伽师地论》卷五说寻、伺是分别。</p><p>　　二师认为：寻、伺也属于五法中的正智，因为《显扬圣教论》等都说正思惟是无漏，因为它能使心寻求等。《集论》等都说正思惟言说之因。当没有达到究竟位的时候，对于能治药和所知病都不能普遍了知，于后得智中为他人说法必须假藉寻、伺二法，并不像佛那样说法时不假藉功用，所以寻、伺二法也通无漏。虽然说寻、伺肯定是分别，但没有肯定地说只属于五法中的第三种分别，因为五法的后得正智中也有分别。其他的有漏无漏等，如上述道理应当知道。</p><p>　　外人问：按照你的说法，六位不定心所法都是离心体而有自性了？或说六位心所法是心的分位差别？</p><p>　　论主反问：如果是这样的话，这有什么过失呢？</p><p>　　外人回答说：这两种意都不对。如果离心体另有自性，《<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>》等为什么都说只有识呢？《瑜伽师地论》卷五十七又为什么说心的远行和独行呢？《无垢称》为什么说心染故众生染，心净故众生净呢？《瑜伽师地论》卷五十六又为什么说人体是由六界构成的呢？《庄严经论》又怎么讲得通呢？如该论的颂文说：「成立心现似见、相二分，心复变似贪等染分，或变似信等善法，没有另外的染法和善法。」</p><p>　　如果六位心所法就是心的分位差别，《楞伽经》为什么说心所法与心相应呢？所谓「相应」肯定是与他性相应，不能说与自性相应。《楞伽经》卷七又为什么说心与心所就像日与光一样同时而起呢？《瑜伽师地论》卷五十六又怎能讲得通呢？该论认为心所法并不等于心法，其颂文说：「五种性不能成立，因为按照觉天等人的主张，只是由于心前后分位差别而成五种性，这就会产生过失。」如果只有识而无心所，有什么差别因缘使一识有很多行相的分位差别呢？这与《楞伽经》所说有矛盾。</p><p>　　论主回答说：应当说离心另有自性，因为心识殊胜，所以说唯识等。心所法依心识势力而生，所以说心似贪、信等现，不能说心所之体就是心。而且，当说心识的时候，也包括心所法，因为心所与心永恒相应。所说唯识等，以及现似贪、信等，都无过失。这是依俗谛而说，如依真谛而说，心所与心并不相离，也不相即，应当知道，诸识展转相望也是这样。这就是大乘佛教真、俗二谛的玄妙理论。</p><p>　　已经讲完与六识相应的心所法，怎么知道现起的分位差别呢？</p><p>　　颂说：依靠第八根本识，前五识随其产生的条件而显现，或者同时，或者不同时，就像波涛依水一样。意识经常生起，除生无想天、二无心定、睡眠和闷绝。</p><p>　　论说：颂文所说的根本识是指阿陀那识，因为它是各种染识和净识生起的根本。颂文的「依止」是说前六识以本识为共同的直接所依。</p><p>　　颂文的「五识」是指前五识，因为它们种类相似，所以总括起来讲。颂文的「<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>现」说明前五识不是永恒生起，只有具备作意、根、境等条件的时候才能生起。因为前五识内依第八识，外随作意、五根、境等各种条件的和合才能生起。就像颂文所说的那样，或者同时生起，或者不同时生起，因为外部条件的和合有顿、渐之分。就像水上波涛的生起要随顺条件的多少，这种比喻详见《解深密经》。</p><p>　　因为前五识的行相粗动，所需要的条件多时不具备，所以生起的时候少，不生起的时候多。第六意识的行相虽然也有粗动，但所需要的条件无时不具备，但由于违逆条件，有时候不能生起。第七识和第八识的行相微细，所需要的条件永恒具有，所以没有条件阻碍使之总不现行。</p><p>　　而且，五识没有寻、伺，不能思考。只缘外境，生起时需要很多条件，所以间断的时候多，生起现行的时候少。第六意识自己就能思虑，内缘理，外缘事，不需要很多条件，只除五位以外，经常能够生起，所以间断的时候少，生起的时候多，所以不说第六识「随缘现」。</p><p>　　五位是什么呢？生无想天等。所说的无想天，就是修无想定的时候，厌患这个粗想的动力；生第四禅的广果天中，与前六识不永恒现行的心法、心所法相违逆，首先灭除想，所以称为无想天。所以生无想天后，前六识都要灭除。</p><p>　　有人认为：在无想天永远没有前六识，因为《集论》等说在无想天没有转识，《瑜伽师地论》卷十说在无想天只有色支，该论卷十三又称无想天为无心地。</p><p>　　二师认为：在无想天的有情众生将要命终的时候，要生起转识，然后才能命终，因为他们肯定要润生下地之爱。因为《瑜伽师地论》卷五十六说有了想以后才能从该地结束生命。《大乘阿毘达磨集论》等所说的在无想天没有转识，是依中间长时说，并不是一期全无六识。</p><p>　　三师认为：初生的时候也有转识，因为他们的中有末后肯定有心润生烦恼。如其他天趣的本有初位，肯定有转识。《瑜伽师地论》卷十二说要生于无想天，只有修无想定。如果要生想的话，只有从无想坠落。在无想天的本有之初，如果没有转识，怎能称为入呢？先有后无才能称为人。因为《瑜伽师地论》卷五十三的&lt;摄决择分&gt;说：把原有的心法、心所法都灭除掉，此称无想。这话的意思是说：在本有初位，有从第八识生起异熟生的转识暂时而起，因为宿习无想定的因缘力，此后不再生起心，由此引起异熟无记心分位差别的时候，称为无心。如善心引生的无想定、灭尽定称为善一样。如果不是这样的话，转识三性不行，《瑜伽师地论》怎能说初期生起的心法要灭除呢？所以无想天的本有初位有转识短暂生起。</p><p>　　无想天只能在四禅，以下诸天处其想粗动，难以断灭。以上诸天是无受无想的异熟果报。即定前能引无想定思，因为思能够招感无想天的异熟果报。</p><p>　　颂文的「及无心二定」，是指无想定和灭尽定。因为此二定都无六识，所以称为无心。</p><p>　　无想定是说有的众生已经压伏遍净天的贪，还没有压伏以上诸天之染。希望出离尘世之想，或作涅槃想，以作意为先，使不恒行的心法、心所法皆灭。因以想灭为首，所以称为无想，又使身心安和，所以称为定。</p><p>　　修习无想定可以区分为三种。如果今世修下品的无想定，现法禅味必然退失，退失后不会很快恢复原状。以后生于无想天，不会光明洁净，其形色也不会广大，不满五百劫就会夭折。如果修中品无想定，现法禅味不一定退失，假设退失，能够很快恢复原状。以后生于无想天，虽然光明洁净，形色广大，但没有达到极限。虽然可能中途夭折，但不肯定。如果修上品无想定，现法禅味肯定不会退失。以后生于无想天，最光明洁净，形色最广大，肯定不会中途夭折，寿命穷满到五百劫后才能死亡。无想定肯定属于四禅，只能是善性，因为它是由禅定所引发。不属于上地或下地，其道理如前所说。</p><p>　　无想定在四业当中构成除顺现受业以外的三业。有人认为：无想定只生起于欲界，因为它是由于各种外道的邪说之力而生起，人的智慧和理解力极其勇猛锐利。二师认为：欲界先修，死后生色界，由于欲界宿习定力，还能引发此定现前，但要除去无想天，因为已至于究竟。无想定是由于厌恶想，希望生于无想天，所以它只是有漏的，佛教圣人不修此定。</p><p>　　灭尽定，就是无学或有学圣人已经制伏或脱离无所有处的贪，上地贪不一定存在。首先止息想作意，使不永恒、永恒的染污心法、心所法都灭，故立灭尽之名。使身心平静安和，所以称为定。特别厌弃受和想，故称灭受想定。修习灭尽定有三种不同类别，修下品灭尽定者，现生得法必然要退失，不能很快地恢复原状。修中品灭尽定者，现生得法不一定退失。如果退失的话，能够很快恢复原状。修上品灭尽定者，毕竟不退失。</p><p>　　初次修行灭尽定，必然是依有顶，以游观无漏为加行，才能入于此定。因为在次第禅定中，灭尽定处于最后最高。虽属有顶，但属无漏。如果修灭尽定能够自由自在，余下七地心后亦得现前。虽属道谛，但并不属于有学和无学，似乎是涅槃。初修此定只在人趣，由于佛及其弟子的教诲力，人的智慧和对事物的理解极其勇猛锐利。欲界之后上色界和无色界，因为《邬陀夷经》是这种观点的真实证明，无色界也称为意成天。对阿赖耶识不相信不接受者，如果生于无色界，不能有灭尽定，因为他们害怕无色界之心断灭。相信有阿赖耶者，生于无色界也可以有灭尽定，因为他们知道有阿赖耶识并非断灭。要断除三界见道所断烦恼，才能生起灭尽定，因为有情众生不能制伏和灭除有顶的心法和心所法。灭尽定微妙殊胜，需要证得二空，随应后得智所引发。</p><p>　　有人认为：在下八地的修道所断惑中，要全部灭除欲界随眠。至于其余的七地，或者是伏，或者是断，然后才能生起灭尽定。因为欲界的烦恼种子有不善、无记二性，极端繁杂，障碍禅定的力量强大。唯有证得不还果及三乘果位的阿罗汉并诸菩萨，才能得灭尽定。随其所应，生到上八地，都要以后生起此定。</p><p>　　二师认为：要断除下之四地的修道所断之惑，其余的或者制伏，或者断除，然后才能开始生起这种禅定，因为变异受和烦恼种子障碍禅定的力量强大。随其所应，生上五地，都要以后生起。</p><p>　　小乘佛教说一切有部问：如果说制伏下地之惑能生起这种禅定，但并未断除烦恼种子，以后不再退转，此人再生于上地。这不就是生上地以后，却断除下地之惑吗？</p><p>　　论主回答说：说断并无过失，就如生上地者断除与下地末那识相应的烦恼一样。然而不还果对治力量强大，正润生位不起现行烦恼，只由惑种润生上地。虽然所降伏之惑有的退失，有的不退失，但无伏下生上地之义，所以没有已生上地却断下地烦恼的过失。如果诸菩萨先于二乘人已得灭尽定，然后转向大乘，在一切位中都能入灭尽定。如果不是这样的话，或有一类菩萨，至七地究竟满心才能永远制伏一切烦恼。虽然没有永远断除欲界修惑，但如果已经断除就能生起灭尽定，因为《瑜伽师地论》卷六十二说已入第七远行地菩萨，才能生起灭尽定。有的菩萨从初地起就能永远制伏一切烦恼，就像阿罗汉一样，在十地当中都能生起灭尽定，因为《十地经》卷八说：菩萨在前六地中，也能生起灭尽定。</p><p>　　无心睡眠与闷绝，即有极重的睡眠和闷绝，使前六识都不能生起现行。由于极度疲倦等条件，使身心违逆于前六识，所以称为极重睡眠。虽此眠时无彼心所眠体，但由彼加引眠引生，所以假说为眠。由于风、热等条件，使身心违逆前六识，所以称为极重闷绝，或者睡眠、闷绝都是触处的一小部分。除此五心位以外，第六意识永恒生起。正死和正生之时也没有意识，为什么只说五位没有意识呢?</p><p>　　初师回答说：颂文的「及」、「与」就表明死、生之时。</p><p>　　二师认为：这种解释不合道理，为什么呢?因为《瑜伽师地论》卷十三只说六位称为无心，即前述五位和无余涅槃，应当说死、生属于五位中的闷绝，因为生苦、死苦的逼迫；是最沉重的闷绝。颂文说的「及」和「与」是为了说明五无心位没有杂乱。这是为了说明六识间断以后，依靠阿赖耶识中自己的种子再生起，所以不说前六识入无余涅槃以后永不生。</p><p>　　在这五位当中，有的众生只有除灭尽定以外的四位，圣者只有后三种，此中的如来和自在菩萨只有灭尽定，没有睡眠和闷绝。所以八识在一切有情众生当中，阿赖耶识和末那识永恒同行，如果生起第六识，则三种识同时发生作用。其余五识随顺条件的结合，生起五识中的一识或多识，这就有四种识同时发生作用，乃至八识同时发生作用。这就简略说明了识的「俱转」之义。</p><p>　　说一切有部等问：如果一个有情众生，多种识同时发生作用，怎能说他是一个有情众生呢?</p><p>　　论主回答说：如果有情众生依识多少而立，你们所说的无心位应当不是有情众生。而且，欲界的有情众生，但他分心现在前位时，怎能说为自分的欲界有情呢?实际上，有情众生依命根心所法或异熟识而成立，这两种解释都不违背道理，因为它们是永恒的，唯一的。</p><p>　　外人问：一个有情众生之身心，一念之中只有一个等无间缘，怎能说有多种识在同时发生作用呢?</p><p>　　论主回答说：既然你们同意一个等无间缘能够引生多种心所法，为什么不同意它能引生多种心法呢?而且，谁肯定地说过这等无间缘只有一识呢?我所说的多种识同时发生作用，是允许此缘多的缘故。而且，我们想同时缘取多境，多种境出现的时候，为什么不能以多种识同时缘取呢?因为不同识的根、境等共同发挥作用，只说识前后生是不合道理的。而且，心所法的性质虽然没有区别，但其类有差别者，允许多心所一念俱生，为什么不同意不同类别的识一念俱起呢?而且，就像很多波浪依一大海一样，所以依一本识多识俱起。而且，如果不允许意识与前五识同时俱起，第六识缘取前五识所缘外境，应当是不明了的，就像是散意识缘取灭除很久的外境一样。</p><p>　　外人问：五俱意识只有一个，在色等外境中，为什么能缘一境或多境呢?</p><p>　　论主回答说：如眼识等，各于色等外境缘取一境或多境，这有什么过失呢?因为诸识见、相二分各有种种相。</p><p>　　外人问：为什么诸识中，同类而不俱起呢?</p><p>　　论主回答说：于自所缘一种外境已经能够了别，余识更生便无用途。</p><p>　　外人问：如果是这样的话，前五识已能了别自己的外境，为什么还用五俱意识起了别作用呢?</p><p>　　论主回答说：五俱意识帮叻前五识生起，不仅是为了前五识的所缘。而且，意识对于所缘外境能够明了缘取，不同于眼识等，所以不能说无用。所以《解深密经》把意识称为有分别，前五识并非如此。</p><p>　　外人问：多种识同时发挥作用，它们为什么不相应呢?</p><p>　　论主回答说：因为境不同，假设境同，彼此所依根的体数不同，如依眼等五根之识依体各异，互不相应。</p><p>　　八个识的自性不能说是固定的一种，因为它们的行相、所依、所缘之相应当是不同的。而且，如果一识灭，其余的七识不一定要灭，所以能熏、所熏等相各不相同。它们也不是定性的不同，因为《楞伽经》卷十说八识就像水波等的关系一样，彼此之间是没有区别的。如果是定性的不同，就不是因果之性，如幻事等一样。也不是定异性，前文所说的识差别相是依世俗谛，如依真谛，既不能想，又不能说。如《楞伽经》卷十的偈颂说：「心、意、识八种，如依俗谛，其相有别；如依真谛，其相无别，因为能桐、所相皆无。」</p><p>　　已经详细解释三能变识之相，其自体是所变见、相二分的所依。怎么知道依靠识的所变而假说我、法，并非另外实有，因此所有的一切都只有识呢?</p><p>　　《唯识三十颂》说：这些识的转变是能分别和所分别，所以它们都是没有的，所有的这一切都只有识存在。」</p><p>　　论说：颂文「是诸识」是前文所说的三能变识及其心所法，都能变似见分和相分，故立「转变」之名。所变见分称为分别，因为它能缘取相分；所变相分称为所分别，因为它是见分所缘取的对象。根据这种正确的理论，人们所主张的实我、实法，离开识的所变，都是肯定不存在的，因为离开能取和所取没有另外的事物，没有真实的事物能够离开能取、所取二相。所以一切有为法、无为法，也不管是实法，还是假法，都离不开识。唯识的「唯」字是为了否定离识之外的真实事物，并不否定不离识的心所法等。</p><p>　　难陀认为：或者说「转变」，是各种内识转似我、法外境之相显现。这种能转变就称为分别，因为以虚妄分别为其自性，这就是变似三界的心法和心所法。这种遍计所执的外境称为所分别，就是妄执的实我、实法之性。由这分别之心，变似依他相分假我、假法之相，这种遍计所执所分别的实我、实法之性，肯定都是不存在的，前引教义理论已经详细破斥。所以一切都只有识，虚妄分别之假有，是大乘和小乘都承认的。唯识的「唯」字不否定不离的心法，所以真空等不离识，故体皆有。所以远离增、减二边见，这就能够成立唯识的意思，完全符合中道实理。</p><p>　　外人问：由于什么圣人教诲和道理成立唯识之义呢?</p><p>　　论主回答说：不是已经说过了吗?</p><p>　　外人说：但没有说明白。并不是破除他人主张，就能成立自己的意见，应当更确切地陈述成立唯识的圣人教诲和道理。</p><p>　　论主回答说：如《十地经》说三界唯心，《解深密经》又说所缘外境只是内识所显现，《楞伽经》又说万事万物都离不开心。《无垢称经》又说心净故众生净，心垢故众生垢。《阿毘达磨经》又说成就四智以后，菩萨就能领悟唯识及识外无境的道理。一相违识相智，意谓在同一处所，鬼、人、天神等，随其业因不同，所见各异。如果外境实有，怎么能这样呢?二无所缘识智，意谓缘过去、未来、梦中境、镜中影像等并非实有之境，由于识的显现可以得到，这种外境既然是没有的，其余的外境也应当是不存在的。三自应无倒智，意谓如果一切凡夫已得真实外境，就应当是自然成就无颠倒错误的认识，不用修行就应当得到解脱。四随三智转智：㈠随自在者智转智，意谓已经证得心自在者，可以随心所欲地转变界、地等，都可以成就。如果外境实有，怎么能转变呢?㈡随观察者智转智，意谓修行殊胜禅定并在定中修法观者，随观一境无常等相都会显现。如果外境实有，怎能随心变化呢?㈢随无分别智转智，意谓证得真实的无分别智者，一切外境之相都不会出现在面前。如果外境是真实的话，为什么不显现呢？已经成就这四智的菩萨，肯定能够领悟唯识道理。而且，《厚严经》的偈颂说：「心、意、识的所缘，都离不开识的自性，因此我说一切事物都只有识，除此之外别无其他。」像这样的圣人教诲不只一处，确实能够证明唯识道理。</p><p>　　大乘和小乘共同承认的眼等五识中的任何一种，和其余的四种一样，不能直接缘取离自眼识之色等。因为其余的识也是识，和眼识等一样，也不能直接缘取离开自识的各种事物。这种直接所缘肯定离不开识，相、见二分随一摄故，如彼能缘见分。因为是所缘法，就如相应法一样，肯定离不开心法和心所法。像这样的正确道理，不只一种，确实能够证明唯识道理，所以对唯识应当深刻相信并接受。实我、实法是不存在的，真如空理和能缘识不是没有的，初离有，后离无，所以符合中道实理。</p><p>　　弥勒依据这种道理，说了二个偈颂：「能取、所取法虚妄不实，只有分别的心识，能取、所取二体都无。只有无所取、能取的空性，在那二取皆无的空性中，只有虚妄分别，所以一切事物因有为法和无为法，所以说非空，二取实体绝无，所以说非不空。有胜义空性和虚妄分别，无二取。分别中有空，空中有分别，所以符合中道。」这二个偈颂暂且依染分依他，实际上这种道理也有净分依他。</p><p>　　外人难说：如果只有内识，好像是外境生起，如何现见非情物处、时二事决定，世间有情身及非情作用二事不决定呢?</p><p>　　论主回答说：如梦境等，可以解释这种疑问。</p><p>　　外人问：世尊为什么说十二处呢?</p><p>　　论主回答说：依识所变，并非离识实有。为了悟入我空，故说眼等六根和色等六法，犹如为了否定断见而说有情续于死后。为了悟入法空，又说唯识，使人们知道心外之法也是不存在的。</p><p>　　外人问：这岂不是说唯识性也是空吗?</p><p>　　论主回答说：并非如此。</p><p>　　外人问：为什么呢?</p><p>　　论主回答说：因为不是所执。意谓依识所变，妄执有实法，从唯识道理来讲是没有的，这说为法空。并不是说没有离言正智所证唯识性，所以说为法空。若唯识无便无俗谛，俗谛若无亦无真谛，因为真、俗二谛相依而立。否定真、俗二谛的存在，这是恶取空，诸佛都说这种人是不可救药的。应当知道，各种事物遍计所执无，故有空；依他起性和圆成实性有，所以有不空。因此弥勒说了前引二颂。</p><p>　　外人问：如果各个色处也以识为其本体，为什么就像色相显现，前后一类，无有变异，亦无间断，多时相续呢?</p><p>　　论主回答说：由于名言熏习势力而起，以染净法为其依处。色等若无，应无妄执之颠倒，便无杂染法和清净法，所以诸识也好像是色等在显现。《摄大乘论释》的偈颂说：「乱相为色识，乱体是非色识。若无所变似色乱相，能变乱体也不得有。」</p><p>　　外人问：色等五种外境，分明由五识现证，是现量所得，怎能说为无呢?</p><p>　　论主回答说：现量证时不能认为是外法，当以后意识进行虚妄分别的时候才能称为外法，所以现量境是自己的相分，因为它是识所变，所以说为有。意识执着外法为真实的色等，因为是虚妄计度而有，所以说为无。而且，依他色等非遍计色，好像是遍计所执色。这种色等虽然不是外法，又好像是外法。犹如梦中所缘外境，不能认为是真实的心外之色。</p><p>　　外人问：如果一切觉时之色皆如梦中之境，都离不开识。如果从梦中醒来以后，就应当知道世界上只有心识，为什么醒时对于自己所感觉到的色境不知道唯识呢?</p><p>　　论主回答说：犹如睡梦还未觉醒的时候不能自知一样，觉醒以后才能追忆以前的梦中之境，觉时境色，应当知道也是这样。在没有达到真觉位的时候不能自知，当得到真觉的时候才能追忆生死之梦境。当没有达到真觉时永远处于梦中，因此，佛说生死像长夜那样，不能了知色等外境唯识。</p><p>　　外人问：五色境确实是不存在的，但它们不是内识境。他人之心是真实存在的，怎能不是自心所缘呢?</p><p>　　论主回答说：谁说过他人之心不是自识之境呢?只是不说他心是自心的亲所缘。意谓识生起时，没有真实作用，不能像手那样直接拿取身外之物，也不能像日光等那样舒光亲照外境，心等缘时只如镜等照物，好像是外境显现。他心之影于自心上显现，此称了别他心，「亲所了」是自识所变相分。所以《解深密经》说：没有少实法能够缘取心外实法，只是识生起时，心似彼他心相显，名取他心。如缘他人之心一样，缘色等也是这样。</p><p>　　外人问：既然有他心异自心之境，为什么称为唯识呢?</p><p>　　论主回答说：奇怪呀!你太固执了!遇到一些问题又产生怀疑，岂唯识教但说唯我一人之识呢?</p><p>　　外人问：不如此又怎样呢?</p><p>　　论主回答说：如果是唯有我一人之识，怎能有十方凡人与圣人之别，尊贵与卑劣之别，因、果等别呢?谁为谁说法呢?修何法呢?何所求呢?所以，唯识之说肯定有深刻意趣。「识」从总的方面说明一切有情众生各有八识，各有六位心所法，各有所变相、见二分，及色、心分位和空理所显真如。因为心法是识的自相、心所法是识的相应，色法是识所变，不相应行法是识的分位，无为法是识的实性。如是五法皆不离识，总名为识。「唯」字只是否定一切愚夫所主张的离识之外肯定实有色等。</p><p>　　如果一个人这样认识唯识问题，就不会有颠倒错误，善备福、智二资粮，很快悟入法空，证得无上觉，把有情众生从生死轮回中救拔出来。完全拨无真、俗诸法的恶取空者，违背佛的教诲和佛教理论，不能成就这样的事情，所以肯定应当相信一切唯识。</p><p>　　外人难说：如果只有识，没有任何外部条件，由于什么而生种种分别呢?</p><p>　　论主回答说：《唯识三十颂》说：「阿赖耶识具有产生一切事物的种子，由于它和前七识彼此之间的相互影响力，使识的转化如此如此地进行，有各种各样的分别生起。」</p><p>　　论说：颂文的「一切种识」是说阿赖耶识中有能够产生一切有为法的种子，各有不同能生自果的功能。因为阿赖耶识的种子能生等流、异熟、士用、增上果，所以称为一切种。除离系果不是种子所生，它虽然可以证得，但并不是种子之果，要现起无漏胜道断结以后才能得到。这种离系果之无为法也有展转证得之义，不是本颂所说，奉颂所说只限于种子所生的有为法。因为种子以识为体，故立识名。种子离本识以外，没有别的体性。种子与识不同于非种非识，有的识并非种子，也有的种子并不是识。而且，种识说明本识中的种子，并不是持种名为种识，应当放到以后再说。</p><p>　　颂文的「如是如是变」，是说阿赖耶识中的种子，由于其他条件的协助，就会产生如此如此的转变，即从牵引位至成熟位。因为种子众多，皆有转变生诸分别，所以重复说「如是」。前所说的「一切种」包括名言、我执、有支三种熏习、共相种子、不共相种子等识种穷尽无余。</p><p>　　颂文的「展转力」意谓八种现行识，及与八识相应的心所法，以及所变相、见二分等，都互有相助之力。「彼彼分别生」意谓现行识等总称为分别，因为它们以虚妄分别为其自性，因为分别种类众多，所以说「彼彼」。此颂的意思是说：虽然没有外部条件，由于阿赖耶识中有不同的一切种子转变，以及现行八识等的展转之力，各种各样的分别也可以产生，哪里用得着外部条件才能生起分别呢?应当知道，各种无漏法的产生也如分别那样，也以无漏种子和现行为条件而生。</p><p>　　外人问：所说种子和现行的缘生分别，应当怎样知道这缘生之相呢?</p><p>　　论主回答说：缘暂且说有四种：一因缘。即有为法直接产生自己的结果。其体有二：㈠种，㈡现行。种子就是阿赖耶识中产生善、恶、无记三性以及三界、九地等各种不同的功能。能够引生次后自类功能，并同时生起自类现行之果。这种种子对自己所生的种子和现行来说，它是因缘性。现行就是前七转识及彼心所，还有识所变的相分、见分、三性、三界、九地等，除佛果一切善法和极劣无记都是能熏，其余七转识熏阿赖耶识而生自类种子。这种现行对种子来说是因缘。第八识没有另外的所熏，因为它已经是所熏了。并不是简去所依之心，心所独自为能熏。</p><p>　　问：心王简去心所，尚且可以独为所熏，心所简去心王独为能熏有何妨?答：心王有自在，自在独所熏。心所不自在，所以单独的不能为能熏。而且，因中第八及六识中异熟无记之心极微，所以不能为能熏。佛果位上的第八识因为极圆满，所以不能熏习成种子。同类现行前后展转相望，都不是因缘，因以本识中各自种子而生。一切异类展转相望，也不是因缘，因为不能直接产生。</p><p>　　《大乘阿毘达磨集论》等说异类同类现行展转相望，互为因缘。应当知道，这是假说，或随顺说一切有部而说。《瑜伽师地论》等只说种子是因缘性，这是依于种子显示种子胜于现行说的，并不是尽理而说，因为圣人说转识和阿赖耶识展转相望，互为因缘。</p><p>　　二等无间缘。即八个现行识及其心所，前念一聚的心王及其心所于后念的一聚自类的心王及其心所，毫无间断地等而开导，使之肯定继续产生。很多同类种子同时发挥作用，如果不相应的话，就不属于等无间缘。由此可见，八个识不能互为等无间缘。心所与心王虽然同时发生作用，但二者相应，和合似一，不可离别令其殊异，所以可以互作等无间缘。因为入无余涅槃的时候，心势最弱劣，没有开导的作用，又没有因开导而生起的等无间法，所以不是等无间缘。</p><p>　　外人问：怎么知道是这样呢?</p><p>　　论主回答说：《瑜伽师地论》等确实这样说过：如果此前识灭，中间等同而无间隔，使后识肯定生果，这前识就是后识的等无间缘。依据这样的意思，应当这样说：阿陀那识在三界九地都可以互相作等无间缘，因为异熟心在三界上地、下地死生相续，互相开导。以有漏作等无间缘可以产生无漏，以无漏作等无间缘，肯定不能产生有漏，因为大圆镜智产生以后肯定不能断灭。善与无记的相互关系也是这样。</p><p>　　外人问：这第八识在哪一界后可以使有漏产生无漏呢?</p><p>　　论主回答说：或从色界后，或从欲界后。意思是说：一切凡夫如果是顿悟而成佛者，肯定是色界后引生无漏第八识，他们肯定生在净居天上大自在天的宫殿，在此觉悟。如果是渐悟，即二乘人趣向大乘，要证得大菩提，只能是欲界后引生无漏，因为趣向大乘者愿力留身只在欲界。他们虽然一定到大自在宫才能成佛，但原来愿力所留下的生身是在欲界。</p><p>　　二师认为：色界也有声闻人趣向大乘，其愿力留生也可以在色界，这与佛经和佛教理论并非矛盾。所以声闻人的无漏第八识，色界心后也可以出现。然而在五净居天没有小乘趣向大乘者，因为《大般若经》没说他们发心趣向大乘。第七识在三界九地也可以互相作等无间缘，因为它随从第八识的生处所系。有漏和无漏第七识可以互相引生，因为在十地位中二者可以相互引生。善与无记的相互关系也是这样。于无记当中，染与不染也互相开导，因为生空智果于前后位中可以互相引生。</p><p>　　在欲界和色界的有漏、无漏末那识能互相引生，在无色界不能这样，因为地上菩萨不能生于欲界。第六转识在三界九地的有漏、无漏、善、不善等都可以互作等无间缘，因为润生位可以互相引生。最初生起的无漏只在色界无漏意识以后，因为决择分之善只在色界。眼、耳、身三识在二界二地，鼻、舌二识在一界一地，只能是自类互作等无间缘，善等的相互关系，应当知道也是这样。</p><p>　　有人认为：有漏、无漏五识，其自类可以互作等无间缘，因为在未成佛的时候，可以互相引生。</p><p>　　二师认为：无漏生起于有漏以后，并非无漏以后能够生起有漏。如果不是佛的话，不会有无漏五识，因为非佛者之五色根肯定是有漏，因为它们属于异熟识的相分。</p><p>　　问：有漏根生无漏识有什么不对呢?</p><p>　　答：有漏五根不是有漏识和无漏识的共依，「有俱」说明这不是等无间缘，等无间缘一定有前后，无漏可依有漏。而且，有漏五根所缘必须是同境。所以，以有漏根发无漏识，这在道理上讲不通。因为有漏根是闇昧的，无漏识是明亮的，二者完全不同的。</p><p>　　三所缘缘。如果非遍计所执之法，依靠能缘之心及其心所的挟带，能缘之心有似所缘之境相，这就是所缘缘。其体有二：一亲，二疏。如果与能缘之体不相脱离，只是见分等内所虑托。应当知道，这是亲所缘缘。如果与能缘之体虽然相脱离，但可为本质能起内所虑托之相分。应当知道，这是疏所缘缘。亲所缘缘，在能缘之心里都有，因为离内所虑托之相分，肯定不能生起。对于疏所缘缘来说，在能缘之心里或有或无，离外所虑托也可以产生。</p><p>　　关于第八识，初师认为：只有亲所缘缘，因为此识由业及自因之力，可以任运变现。</p><p>　　二师认为：肯定也有疏所缘缘，因为要先仗他变为本质，然后自己才能有所变现。</p><p>　　三师认为：初师和二师所说，都不合道理，自身他身，自土他土，可以互相受用，即以他人所变为自己第八识相分质。因为自己的种子于他身无受用之理，他人变为自己的种子，这不合道理，并不是一切有情众生的种子都一样。应说第八识是疏所缘缘，在一切因果位中有无不定。</p><p>　　第七识，在没有达到转依位的时候，此识中有漏是俱生，必仗第八识以为外质，所以也肯定有疏所缘缘。当达到转依位的时候，疏所缘缘不一定有，因为缘真如等的时候没有外质</p><p>　　第六意识的行相勇猛锐利，在一切因果位中能自由自在地发挥作用，所仗外质有无不定，疏所缘缘也是有无不定。</p><p>　　前五识在没有达到转依位的时候，因其行相一者粗，二者钝，三者劣，必仗外质才能生起，所以也肯定有疏所缘缘。得转依位以后，这疏所缘缘不一定有，因为缘过去、未来等没有所仗外质。</p><p>　　四增上缘。如果某些事物有殊胜势用可以作缘，能对其他事物起随顺或违逆作用。虽然前三缘也起增上作用，但第四缘取除前三缘以外之余法，这是为了显示各缘之间的差别之相。增上缘的随顺和违逆在四方面发生作用，因为各种事物有生、住、成、得四种区别。</p><p>　　然而增上作用顺之事虽然很多，但有明显作用的只有二十二种，应当知道，这就是二十二根。</p><p>　　前五色根以阿赖耶识等所变眼等净色根为其特性。男、女二根属于身根，故以身根的一小部分为其特性。命根只是依阿赖耶识的种子分位而虚假成立并非另有其性。意根总的以八识为其特性。苦、乐、忧、喜、舍五受根各以五种感受为其特性。信等五善根以信等及善念等为自己的特性。未知当知根的体性居位有三种：一、根本位。在见道位除最后一剎那外，没有未知而当知者；二加行位。意谓暖、顶、忍、世第一法邻近并能引发根本位；三资粮位。意谓因为认识了四谛之理，发心欲求肯定的殊胜善法——涅槃，乃至未起顺决择分善以前，于一切方便道中所有善根都称为资粮位，能够从远的方面资生根本见道位。于此三位九根为性，即信等五根再加意、喜、乐、舍。在加行位等于后涅槃胜法求证，也有愁戚，也有忧根，但它不是真正的善根，所以佛教经典大多不说。</p><p>　　在空无边处、识无边处、无所有处的前三无色也有未知当知根，有胜见道傍修那以前所起世俗种子而得，或说二乘回趣大乘者，为证初地法空，地前也起九地所摄生空无漏智。因为它先于生空智为菩萨观起，因顺菩萨观，所以属于此根。菩萨见道也有这未知当知根，只说地前，因见道的时间很短促。从见道最后一剎那开始，乃至金刚喻定，所有信等根无漏九根都是已知根性，因为还没有脱离欲望，为了求得上品解脱，还有愁戚，也有忧根，不是真正的善根，所以佛教论典大多不说。</p><p>　　各种无学位的无漏九根，一切都是具知根性。有顶虽然有游观无漏，但不明利，所以不是无漏三根。二十二根的自性就是这样，关于其他方面的问题，如《瑜伽师地论》卷五十七等所说应当知道。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第八",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第八</strong></p><p>　　这样的四缘依十五处义之差别立为十因。它们怎样依十五处而立呢?</p><p>　　一语依处。事物的名称引起人们的思想，又通过语言把这种思想表达出来，就是依语依处立随说因。依据这种语言，并随从所见、所闻等说明各种意思，这就说明：能说是所说之因。《集论》说这是名、想、见，如由名字而起取相、执着以后，随之而起的是言说，就是以名、想、见三法为因，是语言的依处。</p><p>　　二领受依处。意谓观待能受和所受之性，就是依领受依处立观待因。即观待能受和所受之性，使各种事物或生，或住，或成，或得，这就是它们的观待因。</p><p>　　三习气依处。意谓内外种子还没有成熟的时候，就依习气依处立牵引因。意谓牵引远处自果。</p><p>　　四有润种子依处。即内、外种子已经成熟的时候，就依此处立生起因。意谓能够生起近处自果。</p><p>　　五无间灭依处。就是心法和心所法的等无间缘。</p><p>　　六境界依处。就是心法和心所法的所缘缘。</p><p>　　七根依处。就是心法和心所法所依的眼等六根。</p><p>　　八作用依处。意谓作业、作具、作用，即除内外种子，其余所有的一切助现缘都是作用依处。</p><p>　　九士用依处。意谓于所作业、作者、作用，即除种子以外，其余作现缘者都是士用依处。</p><p>　　十真实见依处。即无漏正见，除去引发的自种子，对于无漏的有为法或无漏的无为法，如能有所资助增上和引证的，都是真实见依处。总依第五至第十这六依处立摄受因。前五依处成办三界有漏诸法，第六依处成办无漏法。</p><p>　　十一随顺依处。意谓无记、染、善三性之现行和种子，能够随顺自己同类的殊胜之法，即依此处立引发因。意谓能够引发同类胜行，并能引得无为法。</p><p>　　十二差别功能依处。意谓各有为法的种子，不仅各于自果有能生的差别势力，对无为法也有能证的作用。即依此处立定异因，即各种有为法能够产生自界等果报，并各能引得自乘结果。</p><p>　　十三和合依处。意谓从第二领受依处至第十二差别功能依处，在事物的所生、所住、所成、所得的结果中，有和合之力。即依此处立同事因，因为从观待因乃至定异因，都共同产生同一事业。</p><p>　　十四障碍依处。意谓在生、住、成、得的过程中，能对事物起障碍作用，即依此处立相违因，即对事物的生等起违逆作用。</p><p>　　十五不障碍依处。意谓在事物的生、住、成、得过程中，对事物不起障碍作用，即依此处立不相违因。意谓它对事物的生等不起违逆作用。</p><p>　　像这样的十因可以用二因包括：一能生因，二方便因。</p><p>　　《瑜伽师地论?菩萨地》说：牵引种子生起种子称为能生因，其余各因统称为方便因。这说明牵引因、生起因、引发因、定异因、同事因、不相违因中，各类因缘种子在没有成熟的时候称为牵引种子。已经成熟的时候称为生起种子。因为在那六因当中，各种因缘种子都包括在未成熟和已成熟二位当中。虽然有现行生起是能生因，如引发等四因当中，现行能生种子，但多间断，所以&lt;菩萨地&gt;略而不说。或者现行直接产生结果，也立种子之名，如假说现行谷、麦等种。意谓第一言说因、第二观待因、第五摄受因、第九相违因，以及前六因的非因缘法，都是前说未润生位、已润熟位二因种之余，所以总说为方便因。并不是牵引、生起二种只属于牵引、生起二因，因为其余的四因中有因缘种子。并不是只除生起、牵引二因之外的八因都称为所余因，因为这二因中也有非因缘种子。</p><p>　　《瑜伽师地论》的&lt;有寻有伺地&gt;等说生起因是能生因，其余的属于方便因。这段文字的意思是说：六因中不管是现行，还是种子，只要是互为因缘的，都称为生起因，因为都能生起自类之果，其余的都属于方便因。并不是说生起只属于生起因，因为其余的五因也有因缘。并不是除生起因以外的九因称为所余因，因为在生起因中有非因缘。&lt;菩萨地&gt;所说牵引、生起种子就是这二因，所余各因就是这其余的八因，虽然牵引、生起二因中有非能生因，但此二因中因缘种子殊胜，因为明显，所以偏说。虽然其余因中有非方便因，但增上法多，因为明显，所以要偏说。</p><p>　　&lt;有寻有伺&gt;等三地所说的生起因是能生因，其余的九因是方便。生起就是那生起因，其余的因，应当知道，就是除生起因之外的九因。虽然生起因中有非因缘种子，但是近得果，由于直接而又明显，所以要偏说。虽然牵引因中也有因缘种子，但距离得果尚远，亲生现行相隐，所以不说牵引因是因缘种的能生因。其余的因属于方便，按照上述道理应当知道。</p><p>　　所说的四缘依什么依处建立呢?又怎样包含十因和二因呢?《瑜伽师地论》等说因缘是依有润种子依处而立，依无间灭依处立等无间缘，依境界依处立所缘缘，依其余的依处立增上缘。此中所说的种子就是第三、第四、第十一、第十二、第十三、第十五，六依处中，除去现行，都属于因缘种子。六依处中除第三、第四依处以外，其余四依处虽然也有现行是因缘，但多间断，这里略去不说。或者这四依处的现行，也能直接产生自己的结果，如外种的麦种等，也立种子之名。或者说种子只属第四依处，关于亲疏、隐显、取舍问题，如前所说。所说无间灭依处和境界依处，应当知道这是从总的方面说明等无间缘和所缘缘的依处，不只在第五和第六依处，其余依处也有这二缘的意思。或者说只有第五、第六依处，其余的三依处虽有，但少而且相隐，所以略去不说。《瑜伽师地论》卷二十八说因缘属于能生因，增上缘是方便因，中间的等无间缘和所缘缘属于摄受因。虽然方便因内具有后三缘，但增上缘多，所以这里要偏说。其余的因也有中间二缘，但摄受因中明显，所以要偏说。能生因是因缘者，或说六因，或说二因，进退如前所说。</p><p>　　所说十因、四缘肯定应当有果，这果有几种呢?依什么依处而得何果呢?果有五种：一异熟果。即有漏善法和不善法所招感的八识自体相续的异熟无记；二等流果。所熏习的善、不善、无记种子所引生的同类结果，或似先前所作业，随之产生相应的结果；三离系果。意谓于无漏道断障所证得的善无为法；四士用果。各位作者假藉各种工具所办成的事情；五增上果。除前四果以外其余所得的结果。</p><p>　　《瑜伽师地论》等说：习气依处得异熟果，随顺依处得等流果，真实见依处得离系果，士用依处得士用果，其余依处得增上果。初师认为：所说习气依处表明各种依处招感异熟果的一切功能，所说随顺依处表明各依处引生等流果的一切功能，所说真实见依处表明各依处证得离系果的一切功能，所说士用依处表明各种依处招感士用果的一切功能，所说的所余依处表明各种依处得增上果的一切功能。如果不是这样，就应当是太宽，或者太狭。</p><p>　　二师认为：习气只属第三，虽然异熟因其余四处也有，习气依处中也有非异熟因，但异熟因离得果太远，习气依处望果也远，所以这里偏说。随顺依处只属第十一依处，虽然其余依处也得等流果，此处也得非等流果。但等流因招感胜有为行相明显，随顺依处也是这样，所以论要偏说。所说真实见依处只诠释第十依处，虽然其余的四依处也能证得离系果，真实见依处也能得非离系果，但证得离系果的行相明显，所以论要偏说。所说的士用依处只诠释第九依处，虽然其余的依处也招感士用果，士用依处还能招感增上果等，但士用依处所得士用果，其名相明显，所以论要偏说。除前四果所不属，只属其余的十一依处，虽然这十一依处也得其余的果，其余的依处也能招感增上果，但这十一依处大多招感增上果，其余的依处明显地招感具余果，所以论要偏说。</p><p>　　由此可见，所说的五果当中，如果是异熟果，由牵引因、生起因、定异因、同事因、不相违因和增上缘所得。如果是等流果，则由牵引因、生起因、摄受因、引发因、定异因、同事因、不相违因和因缘、增上缘所得。如果是离系果，则由摄受因、引发因、定异因、同事因、不相违因和增上缘所得。如果是士用果，初师认为：由观待因、摄受因、同事因、不相违因和增上缘得。二师认为：士用果由摄受因、引发因、定异因、同事因、不相违因和除所缘缘之外的三缘所得。如果是增上果，十因、四缘都可以得到。</p><p>　　傍论已经讲完，现在应当辨明正论。阿赖耶识中的种子可作因缘、所缘缘、增上缘三缘，所生现行为分别形式，唯独不能作等无间缘。所谓种子三缘是：一各有亲生种子，是彼八识的因缘；二能缘种子的心法和心所法，这种子就是它的所缘缘；三如果有的种子，对于现行法的生起能够给予助力，或不起障碍作用，这就是增上缘。应当知道，因缘种子生净现行也是这样。各种现行分别展转相望，可以作三缘，因为没有因缘。意谓有情众生自、他身分别展转容作二缘，三缘中除去等无间缘。</p><p>　　对于一个人来说，自己的八识及其心所等同聚法，此聚与彼聚展转相望，肯定有增上缘，肯定没有等无间缘，所缘缘的意思或者是有，或者是无。第八识对于其余七识有所缘缘的意思，前七识对第八识没有所缘缘的意思，因为前七识不是第八识所依仗的本质。第七识望于第六识和前五识没有所缘缘的意思，后一意识有。前六识望于第七识都没有所缘缘的意思。第六识望于前五识没有所缘缘的意思，前五识望于第六识有所缘缘的意思，因为前五识只托第八本识所变为境相。自身八识一一自类前后相望，第六识可以有三缘，其余七识只有二缘，没有因缘和所缘缘，因为它们只缘现境。也容许五识后念见分缘前念相分，前五识和第七识前与后也有三缘。前七识望于第八识可以有所缘缘，因为前七识都能熏成第八识的相分、见分种子。同聚异体之识，展转相望，只有增上缘，没有所缘缘，因为各种相应法所仗本质相同，不能互相为缘。</p><p>　　二师认为：或依见分不相缘，依相分有相缘的意思，因为各个相分互为本质才能生起，如本识中诸法种子同时为触等五种遍行心所法的相分本质。如果不是这样的话，无色界中五种心所应无所缘境。假设允许无色界第八识变下界之色，五位心所法如本识一样也肯定缘种，六见分境不同于一个本质。同体相分为见分二缘，见分于相分只有增上缘。见分与自证分展转相望，也是这样。其余的自证分与证自证分展转相望，俱作二缘。此中不依种子的相分说，只说现行互相为缘。净八识聚自他展转相望，都有所缘，因为一一都能遍缘一切法，不过在同体的四分中，一定要除去见分望于相分的非所缘缘，因为一切相分从道理上来讲，肯定没有能缘的作用。</p><p>　　既然现起分别缘其种子和现行而生，则其种子从道理上来讲也应当缘其现行和种子而生起，现行和种子对于种子来说能作几缘呢?种子肯定不能由中间二缘生起，因为这二缘待心法、心所法为果才能成立。现行望于亲种具作二缘，与非亲种只有增上缘，种子望于亲种也具二缘，于非亲种也只有增上缘。</p><p>　　依这内识若种若现互为缘起，一切分别若因若果，从理从教皆悉成立。小乘所执心外之缘假设有也没用，况且违背理、教，你们为什么固执己见呢?虽然此言分别是从总的方面说明三界有漏心法和心所法，但随从分别的殊胜之义，佛典中多方说明，或说二、三、四、五等分别，如《瑜伽师地论》等都详细解释过。</p><p>　　虽有内识，但无外部条件，有情众生怎能生死相续呢?</p><p>　　《唯识三十颂》说：「由于各种业习气和二取习气相应。前一生命的异熟体既尽，又会生起其余的异熟果报体。」</p><p>　　论说：颂文的「诸业」是指福业、非福业和不动业，即有漏善、不善思业。业的眷属也立业之名，因为它们和业一样，能够招感总报和别报。这种业刚刚生起，马上就消灭，无别义理能够招感当来真异熟果。现行之业当造之时，熏于本识，生起自业之功能，这种功能就是颂文所说的习气，因为这种功能是业的气分，这就是习气的「习」字。这种功能是由现行熏习而成，这就是习气的「习」字。不同于无惭外道所说的业皆宿作并是曾有，也不同于化地部等所说的业入过去，现皆有体，也不同于有部等所说的过去有体之曾业，也不同于顺世外道所说的一切果唯现业所得，所以称为习气。这种习气展转相续，到成熟的时候就会招感异熟果，这说明业习气是感当来异熟果的最殊胜的增上缘。相见、名色、心及心所、本末，以上所说的四取都包括在能取、所取当中。由于上述四种二取所熏发，能够直接产生本识上的功能，此称二取习气，这说明来世异熟果心及心相应法，各望自果为因缘种子。</p><p>　　颂文的「俱」意谓业种子与二取种子在一起，同时感生结果，是间接条件与直接条件互相协助的意思，由于业种招生结果明显，所以颂文先说。颂文的「前异熟」是指过去世多生之业招感异熟果报。颂文的「余异熟」是指由业所招感的未来世多生异熟果报。虽然二取种子受果无穷无尽，但业的习气受果是有穷尽的。因为异熟果一者性别，与业性不同；二者难招，得果必须异世。等流果及增上果一者性同，二者易感。由感当来余生业等种子成熟，于今生中前异熟果受用尽时，即是此身<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>之位，彼所熟业又能另外生起以后的其余异熟果。由此所说业果不断，生死相续，轮转无穷，哪里用得着假藉心外条件方得生死相续呢?这颂文的意思是说：由业和二取为因缘，使生死轮回都离不开识，所以心法和心所法是生死因果的体性。</p><p>　　此外，生死相续由于各种习气，然而各种习气总共有三种：一名言习气。就是有为法的各自直接种子。名言有二种：㈠表义名言。就是能诠表义理的音声差别：㈡显境名言。就是能够了别外境的心法和心所法。随从这两种名言熏习所成的种子，作有为法的各自因缘。</p><p>　　二我执习气。就是人们虚妄计度的我和我所的种子。我执有二种：㈠俱生我执。即修道所断的我和我所执；㈡分别我执。即见道所断的我和我所执。随从这二种我执所熏习而成的种子，使有情众生等有自他之别。</p><p>　　三有支习气。即招感三界异熟果报的业种子。有支有二：㈠有漏善。就是能够招感善趣果报的业；㈡各种不善。就是能够招感恶趣果报的业。随从这二种有支熏习而成的种子，使异熟果报有善趣和恶趣之别。应当知道，我执习气和有支习气在差别果报上是增上缘。应当知道，颂文所说的「业习气」就是有支习气。应当知道，二取习气就是我执习气和名言习气，即取我、我所及名言以为境界，熏我执习气和名言习气，都称为「取」。「俱」等其余文字的意思，如前所释。</p><p>　　又，生死相续由于惑、业、苦，引发行为润生烦恼称为惑，能够招感后有果报的业称为业，业所引生的各种痛苦都称为苦，惑、业、苦的种子都称为习气。前二习气对于生死苦果来说是增上缘，因为它们能够协助产生痛苦。第三习气对于生死苦来说能作因缘，因为它能够直接产生痛苦。颂文所说的三种习气，如其所应，当知是这样的：惑和苦称为取，因为惑是能取，苦是所取。取是执着的意思，业不能称为取。颂文的「俱」等，如前所释。</p><p>　　应当知道，这惑、业、苦总的包括十二有支，即从无明乃至老死，如《瑜伽师地论》等所详细解释的。</p><p>　　然而十二支可以简略为四支：一能引支。即无明、行，能够引生识等五种果报的种子。这里的无明只取能够引发招感后世善业和恶业者，即这种无明所引发的乃称为行。由此可知，一切不感果的顺现受业，或者别助招感当来果报的业力当中，那唯感别报的业力，都不是行支。</p><p>　　二所引支阿赖耶识内直接产生当来异熟果的识等五果种子，因为这是前述无明、行二支所引发，所以称为所引支。五种之中的识种是本识之因，除后边的六根、触、受三种，其余的色心因缘种都是名色种子，后边的六处、触、受三因，如其名称次第就是六处种子、触种子和受种子。或者说名色种子总的包括五因，此中随顺殊胜之义而立其余四支的种子，六处和识的总别之义也是这样。</p><p>　　《集论》说识也是能引支，因为识中的业种子称为识支，异熟识的种子属于名色种子。《缘起经》说识支通能引支和所引支，业种子和识种子都称为识，识是名色的所依，并不属于名色。识等五支由业所熏发，感招之位虽然确实同时，但主伴、总别、胜劣、因果之相不同，所以诸圣人之教假说前后，或依当来生起分位，或依现在已起分位，因为次第而说识等五支前后不同。所以，《十地经论》等说识等五支也有现行，因为在因位时肯定没有现行的意思。因此，《缘起经》又说生与引同时，润与未润肯定不能同时。</p><p>　　三能生支。即爱、取、有三支，因为它们最近能够产生未来的生和老死。受内异熟时，由迷内异熟果的无明，引发能够招感后有的各种业，以此为缘，引发直接产生未来生和老死的识等五果的种子以后，又依迷外增上果的无明，以境界受为缘发起贪爱烦恼，以贪爱为条件又产生欲等四取。爱和取合润，能够产生业种子，以及所引因识、名色、六处、触、受五支的种子转名为有，因为这六类种子都能直接产生最近未来的结果。《瑜伽师地论》卷十说只有业种子称为有，因为它能够直接产生异熟果。又有的经论说识、名色、六处、触、受五法种子称之为有，因为它们能够直接产生未来的识等。</p><p>　　四所生支。即生和老死，因为它们直接由爱、取、有所产生。意谓从中有初生以后至本有中，未衰变位都是生支，诸衰变位总为老，身坏命终方名为死。老不一定有，所以附属于死立为一支。</p><p>　　外人问：病为什么不立支呢?</p><p>　　论主回答说：因为病不遍三界、五趣，并非定有。老虽然不定有，但由于它遍有，所以立支。诸界、诸趣、诸生，除中途夭折者而外，临终之时根、识都会衰朽。</p><p>　　外人问：名色并非普遍存在，为什么要立支呢?</p><p>　　论主回答说：因其定有，所以立支。因为胎生、卵生、湿生者，六处未满以前，肯定有名色。而且，名色所以要立支，是因为它们也遍三界。在色界化生初受生位，虽然具有五根，但还没有作用，此时还不能称为六处支。初生无色界的时候，虽然肯定有意根，但不明了，还不能称为意处。因此《瑜伽师地论》说十二支在欲界全有，在色、无色二界有一部分。</p><p>　　外人问：爱并不是普遍存在，怎能特别立为一支呢?因为生恶趣者并不爱恶趣，所以爱并非普遍存在。</p><p>　　论主回答说：因为爱肯定存在，所以特别立为一支。不求无有及生善趣者，肯定有爱。不还果生他地润生，虽然不现起爱，然而如果于彼自身取支，肯定有爱的种子。而且，爱也是普遍存在的，生恶趣者于现我身及现在境也会生起爱，所以生恶趣者有爱润生。《缘起经》依无希求当来恶趣身之爱，说生恶趣无有爱生起，并不是说生彼趣诸爱全无。</p><p>　　外人问：为什么所生之果合立生老死，于所引位乃立识等五支呢?</p><p>　　论主回答说：因为在因位很难知道它们的差别之相，佛教经典依据当生果位分别立为识等五支。意谓于当来初生之时果识初起，即是因识相显。于次识位五根未满以前，名色相貌增长，以后五根满时，因六处明盛，依六处发触，因触生起受，此时称为受果圆满究竟位，依此当起果位次第立因支为五。因为在当现果位容易明了差别之相，总立生、老死二支，以此显示三苦。然而所生果若在未来，为令有情生厌离故，总相说为生、老死支。若至现在为了使人们了知分位之相产生，故说识等五支。</p><p>　　外人问：各种烦恼都能发业，为什么总立无明呢?各种烦恼都能润业，为什么分别立为爱、取呢?</p><p>　　论主回答说：虽然一切烦恼都能发业润业，但无明之力发业的作用优胜于其他烦恼，因具十一种殊胜之事，即所缘等，详解如佛经所说。虽然各种烦恼皆能润生，但于润业位爱力偏增，因为圣教皆说爱如于水，能沃能润。经过多次灌溉才能使它生芽。而且，依初后分爱、取二支，发业之义不可重发，立一无明、如一芽生。虽然取支当中包括各种烦恼，但爱润生殊胜，故说爱增胜。</p><p>　　外人问：诸缘起支，若生此地十二支，皆唯与同地十二支为缘呢?也容许与他地十二支为缘呢?</p><p>　　论主回答说：一般来说，十二有支都与自地支为缘，但所发行支也有依他地无明为缘的，如下地无明发上地行支。否则，初伏下地染所起未至上定，应当不是行支，因为此时彼地无明犹未生起。</p><p>　　外人问：从上地生到下地，或从下地生到上地的有情众生，以什么受为缘呢?</p><p>　　论主回答说：随其所应，这种爱也缘当生地之受，不管是现行还是种子，这种说法都不违背佛教道理。</p><p>　　在这十二支当中，前十支因和后二支果肯定不能同世。因中的前七支与爱、取、有三支，或者异世，或者同世。十二支中，生、老死二支，爱、取、有三支，无明、行、识、名色、六处、触、受七支，各定同世。这样的十二有支，只要设立一重因果关系，肯定能够说明轮回理论，并脱离断见和常见，像有部那样施设两重因果关系实在是没用。或者应更超过三世两重因果，这就犯无穷的过失。</p><p>　　这十二支的义门分别：</p><p>　　第一、假实分别门。前九支为实，后三支为假。因为被爱、取己润的行、识、名色、六处、触、受六支种子，合名为有，识等五支种子至现在时，显生、异、灭三相位的差别，分别称为生等。</p><p>　　第二、一事非一事门。有五支是一事，即无明、识、触、受、爱五支。其余各支并非一事。</p><p>　　第三、染不染门。无明、爱、取三支是染性，因为它们是烦恼性。识、名色、六处、触、受、生、老死七支，只是不染，因为它们是异熟果。因为七支的分位容许起染，假说通二。其余支通二种。</p><p>　　第四、独杂分别门。无明、爱、取三支称为独相，不与其余支相交杂，其余九支都是杂相。</p><p>　　第五、色非色门。十二支中有六支是心法，不通色法，即无明、识、触、受、爱、取，其余六支通色、心二法。</p><p>　　第六、第七有漏有为无漏无为门。十二有支都是有漏，只属于有为法，因为无漏无为不是有支。</p><p>　　第八、三性分别门。无明、爱、取三支只通不善和有覆无记，行支只通善性和恶性，有支通善、恶、无覆无记，其余七支只是无覆无记，七支在分位中也起善、染。</p><p>　　第九、三界分别门。十二支虽然都通三界，但有的是部分，有的是全部。</p><p>　　第十、能所治门。上地行支能伏下地一切支，即粗、苦、障、静、妙、离六种行相，有求上地法的有情众生，由观下界十二支为粗、苦、障，观上界为静、妙、离。</p><p>　　第十一、学等分别门。十二有支都不是有学和无学，圣者虽有所起的有漏善业，但他们以无漏明慧为缘所起，与有支相违，不属有支。由此应知圣者肯定不造招感后有果的业，因为圣者们于后有苦果不迷不求。不还果等杂修第四静虑，资下无云天等故业，生净居天等，这于道理不相违背。</p><p>　　第十二、三断门。初师认为：无明只是见道所断，因为迷于谛理的无明能发诸行，圣者肯定不造后有果之业。爱、取二支只能由修道所断，因为贪求当生润生之爱，九种命终之心与俱生爱相伴随。其余九支都通见道所断和修道所断。</p><p>　　二师认为：十二支都通二道所断，因为《瑜伽师地论》卷十说预流果已经断除一切支的一部分，并没有完全断除。如果无明支只是见道所断，怎能说预流果没有完全断除呢?如果爱、取二支只是修道所断，怎能说预流果已经断除一切支的一部分呢?《瑜伽师地论》卷五十九又说三界一切烦恼都能结生，往恶趣之行只能由分别起的烦恼所引发。诸圣教中不言润生之惑只有修道所断，因为全界烦恼都能结生，也不说诸感后有行皆见所断烦恼所发。由此可知，无明、爱、取三支也通见、修所断。然而正发行的无明只是见道所断，助发行的无明不定。爱、取二支正润生者只是修道所断，助润生者不定。而且，染污法的自性应当断除，对治生起的时候，它要永远断除，一切有漏的不染污法并非自性应断，因为不违圣道。</p><p>　　然而，有二义说之为断：一离缚断。即断缘彼烦恼、杂彼烦恼；二不生断。断彼所依之因，使果永不生起。依离缚断，《瑜伽师地论》卷六十六说各有漏善和无覆无记只是修道所断。依不生断，《集论》等说诸恶趣、无想定等只是见道所断。《瑜伽师地论》等说十二有支通见、修二道所断，于前述二断中应当知道。</p><p>　　第十三、三受俱门。这十二支中，除受、老死二支以外的十支与乐受和舍受相应，因为受不与受相应。老死位中大部分无乐及客舍。十二支中，除受支以外的十一支与苦受相应，因为受不与受相应。</p><p>　　第十四、三苦分别门。除老死支以外的十一支少分属于坏苦，因为老死位中多数没有乐受，依乐受变坏而立坏苦，所以不说老死也是坏苦。十二支中少分属于苦苦，因为一切支中都有苦受。十二支全部属于行苦，因为各种有漏法都是行苦，约舍受说行苦即十一少分，除老死支以外，其义如前坏苦所说。实际意思就是这样，各种佛典中根据各支的外相增盛有不同的说法。</p><p>　　第十五、四谛门。十二有支都属于苦谛，因为它们是取蕴性，行、有、无明、爱、取五支也属于集谛，因为行、有二支是业性，无明、受、取三支是烦恼性。</p><p>　　第十六、四缘门。在四缘当中，诸支相望，增上缘肯定都有，其余三缘有无不定。佛经依据定有，只说有一缘。爱支望于取支，有支望于生支，有因缘的意思，如果说识支是业的种子，行望于识也作因缘，其余支相望没有因缘的意思。</p><p>　　《集论》说无明望行支有因缘的意思，依于无明俱时之思业习气说，无明俱时假说无明，实际上是现行种子的思业习气。《瑜伽师地论》卷十说诸支相望而无因缘，此依现行爱、取，只依业种说为有。无明望行支，爱望于取，生望老死，有其余二缘：等无间缘和所缘缘。有望于生，受望于爱，没有等无间缘，有所缘缘。余支相望，都无这二缘。此中所说诸支相望为缘的意思，是依邻近、顺次、因果前后不相杂乱的真实缘起义说。若异此相望，则为缘不定，各位聪明有智慧的人，应当按照上述道理进行思维。</p><p>　　第十七、惑业苦摄支门。惑、业、苦三类包括十二支，无明、爱、取三支属于惑，行全有一分属业，识、名色、六处、触、受、生、老死七支全部和有的一部分属于苦。《瑜伽师地论》等说业全摄有，应当知道，这是依业有而说的。《集论》卷四说识属于业，意思是说：业的种子是识支。只有惑、业所招感的结果称为苦，只属于苦谛，又为了使众生生厌患心，不再起惑造业，由此可知，惑、业、苦就是十二支，能使众生生死轮回，相续不断。</p><p>　　而且，有情众生的生死相续，由于内部因缘，不需要外部条件，所以只有识。因就是有漏业和无漏业，因为这二业是正招感生死的因素，所以说为因。缘是烦恼障和所知障，因为它们协助招感生死，所以说为缘。为什么呢?有二种生死：</p><p>　　一分段生死。就是各种有漏善业和不善业，由烦恼障作为缘，作为辅助势力，所招感的三界异熟果粗显，由于因缘之力，身体和生命有短有长，都有一定的限度，所以称为分段。</p><p>　　二不思议变易生死。即以各种无漏后得有分别业为亲因，以所知障为缘助势力，所招感的异熟果殊胜细密。能由悲愿力改变身命的长短，没有一定的限度，所以称为变易。如果无漏定愿力正所资生，正所感后得，其妙用细密难测，所以称为不思议。也可以称为意成身，因随大悲愿意所成就。</p><p>　　如《胜鬘经》所说：如果以取为缘，有漏业因续后有者而生三界之有，以无明习地为助缘，无漏业因即生阿罗汉、独觉、已得自在菩萨三种意成身。也称为变化身，因为无漏禅定之力，使其身体与原来不同，犹如变化。如《显扬圣教论》卷十六所说：声闻无学永远断尽以后的再生，怎能证得无上觉悟呢?依变化身证得无上觉悟并不是业报之身，所以这种说法并不违背道理。</p><p>　　小乘佛教问：假若以所知障为助缘，无漏业能够招感生死，二乘人的定姓声闻应当不永远入无余涅槃。</p><p>　　论主回答说：如各有情众生虽有无漏种，但由于烦恼所拘碍，驰流生死，不趣涅槃。</p><p>　　外人问：道谛为什么实际上能够招感苦呢?</p><p>　　论主反问：谁说过道谛实际上能够招感苦呢?</p><p>　　外人问：如果不是这样的话，感义如何呢?</p><p>　　论主回答说：由于无漏胜定资有漏业，使所得果相续新生，长时不绝，展转增胜，假说名感。此无漏业如是感时，由所知障为缘，助此无漏之力，非无漏业独能感果。然而所知障不障碍解脱，不能引发有漏业，没有润生的作用。</p><p>　　外人问：为什么要资感生死而受苦呢?</p><p>　　论主回答说：为了自己证得菩提，给有情众生带来利益和安乐，即不定二乘独觉、声闻和已得自在发大誓愿的菩萨，已经永远断伏烦恼障，不需要再受当来分段身，恐怕废除长时间以来所修的菩萨行，便入无漏的殊胜禅定，以殊胜的誓愿力，如阿罗汉的延寿之法，资养现身之因，使业长时生果不绝，如此由于一再地修定及誓愿的资助，乃至于证得无上菩提。</p><p>　　外人问：那又何须所知障助方感此果呢?</p><p>　　论主回答说：既然还没有圆满证得无相大悲，如果不认为实际菩提可以求得，有情众生可度，就没有理由发起猛利大悲和誓愿。而且，所知障障碍大菩提，为了永远断除它，留身久住，说之为缘。而且，这种所知障是一切有漏之依，这种所知障若无，那种能依有漏肯定没有，对于变易生死的久住，有很大的助力。</p><p>　　如果所留身是由有漏业和有漏愿所资助，属于分段生死，因为这是二乘人和有情众生所知道的外境。如果所留身是由无漏定及无漏愿所资助，属于变易生死，因为这不是二乘人和有情众生所知道的外境。由此应当知道，变易生死的性质是有漏，望感现业属于异熟果，于无漏业是增上果，《十地经》所说的出过三界，这是随此无漏助业因而说。</p><p>　　《唯识三十颂》所说的「诸业习气」即前文所说的有漏、无漏二业种子。颂文听说的「二取习气」即前文所说的烦恼障和所知障种子，因为执着都称为「取」。颂文的「俱」等，其义如前所解释。</p><p>　　外人问：变易生死不像分段生死那样别死别生，怎能说前异熟既尽后异熟产生呢？</p><p>　　论主回答说：变易生死虽然不像分段生死那样前异熟灭尽，后异熟产生，但由于禅定和誓愿的一再资助，改去前恶，转生后胜，也有前尽后更生之义。虽然也由于诸法现行，使有情众生生死相续，种子相续一切时肯定具有，所以颂中偏说种子。或者说为了显示真异熟因是业种子，果即本识，因为一切果都不离本识，所以不说现行。此诸现行虽然也是异熟因，但并不是立即生果。</p><p>　　外人问：六识中也有异熟果，为什么颂中不说前尽后生呢?</p><p>　　论主回答说：转识有间断，不是真异熟。前际、中际、后际的生死轮回，不需要外部条件，既然是由于内识，净法相续应当知道也是这样。意谓自无始以来，依附本识有无漏种子，由于前七转识等的一再熏发，逐渐增胜，以至于到究竟位成佛的时候，转舍原来的杂染识种子，转得开始生起的清净识种子，维持和含有一切功德种子，由于佛本有的誓愿力，相续至无穷无尽的未来际，生起各种神妙作用，相续无穷无尽。由此应当知道，只有内识。</p><p>　　外人问：如果说只有识的话，为什么世尊在佛经中到处说有三性呢?</p><p>　　论主回答说：应当知道，三性也不离识，为什么呢?</p><p>　　《唯识三十颂》说：「由于各种各样的分别活动，遂有各种各样的事物产生。实际上，这些事物都是由于一般人的虚妄计度，其自性是没有的。依他起自性是分别缘所生。圆成实性就是依他起性和遍计所执性永远远离的情形。所以圆成实性和依他起性，既非有异，亦非不异，如无常等性，圆成实性不被见时，依他起性也见不到。」</p><p>　　论说：难陀等认为，一般人的心识普遍认为客观事物实有，所以称为「遍计」，其心识品类众多，所以颂文说为「彼彼」，即能遍计的虚妄分别。就是由各种心识的虚妄分别，普遍计度各种所遍计之物，就是人们所虚妄执着的五蕴、十二处、十八界等，不管是法还是我的自性差别。这种所虚妄执着的自性差别，总称为遍计所执自性。这种自性都是不存在的，因为从佛教道理和佛的教诲，仔细推论起来，都无此自性。</p><p>　　护法认为：或者颂文的第一句说明能够遍计的心识，第二句说明所遍计的外境。后半颂才申明遍计所执的对象，不管是我是法，其自性都是不存在的，因为已经详细说明这种自性是不可得的。</p><p>　　颂文初句所说能遍计的自性如何呢?安慧等认为：八个识及其各种心所法，属于有漏者都是能遍计，因为虚妄分别是其自性，都像是所取、能取之相在显现，因为《瑜伽师地论》等都说阿赖耶识以遍计所执自性的妄执种子为自己的所缘。</p><p>　　护法等认为：第六、七识妄执我、法者都是能遍计，因为《摄大乘论释》只说意识能遍计，第七识和第六识合称为意识，因为它们的计度分别能够遍计，执我法者肯定是慧，我、法二执肯定与无明相应。《瑜伽师地论》等都没说过无明有善性，因为痴、无痴等不能相应，从来没有见过执着于「有」的观点能够导致于认识「空」的智慧。执着于「有」和认识「空」不能同时生起，从来就没有执着于「有」的观点不能熏习。有漏心等不能证得实理，一切都称为虚妄分别。虽然好像是所取、能取之相在显现，但并不是一切都属于能遍计。因为不能说无漏心也有执着，如果认为有似能、所二取之相现就是遍计所执，如来后得无漏智心岂非亦应有执?《佛地经》说佛智显现身、土等种种影像，犹如镜等一样，如果没有能缘的功能，就不应当是智能。虽然阿赖耶识能缘遍计种子，但没说只缘遍计种子，所以经文没有把它作为能缘的确实凭证。</p><p>　　由于上述道理，只有第六识和第七识有能遍计。识品虽然是二种，但有二、三、四、五、六、七、八、九、十种等不同的遍计，所以颂文说「彼彼」。再者，所遍计的自性怎样呢?《摄大乘论》说依他起自性是所遍计，因为遍计心等以此为所缘缘。</p><p>　　外人问：圆成实性怎么不是所遍计的外境呢?</p><p>　　论主回答说：真如不是妄执所缘的外境，依展转说，真如也是所遍计。遍计所执虽然是遍计心境，所以不是所遍计。</p><p>　　遍计所执之相怎样呢?与依他起性又有什么区别呢?</p><p>　　安慧认为三界之心及其心所，由于无始以来的虚妄熏习，虽然各自本体是一自证分，但似依他见、相二分而生，也就是能取和所取，如是二分情执方面虽似体有，但从佛教道理来看，实际上是不存在的。此之二相，《辩中边论》等说为遍计所执。此二所依识等体实际上是托缘而生，此性并不是没有，称为依他起性，因为它是从虚妄分别种子之缘而生。怎么知道见、相二分非有呢?因为《辩中边论》等说虚妄分别是依他起性，二取是遍计所执性。</p><p>　　护法认为：一切心法及其心所法，由于熏习之力所变见、相二分从缘而生，所以也是依他起性，遍计依此二分妄执为真实的有无、为一、为异、为俱不俱等，此见、相相二分方名遍计所执。《摄大乘论》等说：唯量、唯二、种种都称为依他起性。四法和十一识等，《瑜伽师地论》等都说属于依他起性。假定不是这样，佛等无漏后得智品所变相、见二分，应当称为遍计所执。假定容许无漏二分也是遍计所执，圣者的后得智就不是缘彼依他起的二分所生。能缘依他所有智品应非道谛，若不许圣智非遍计所执，应当知道，有漏心也应当是这样。</p><p>　　而且，如果有漏见、相二分是遍计所执，就应当像兔角等一样不是所缘缘，因为遍计所执之体是没有的。而且，应当是见、相二分不能熏习成为种子，后识等生应当是没有见、相二分。而且，各种有漏习气属于相分，其体非有之法又怎能作因缘呢?如果从缘所生识内相、见二分不是依他起性，二分所依依他起的识体，照例也应当是这样，因为没有不同的原因。</p><p>　　由于上述道理，各种条件和合而生的心法、心所法及相分、见分、有漏、无漏等，都是依他起性，因为它们都是依靠各种条件和合而生起。颂文所说的「分别缘所生」，应当知道这是暂且说染分依他，因为净分依他也就是圆成实性。或者说染净心法、心所法都称为分别，因为它们都能缘虑，所以一切染分依他和净分依他都属于这里所说的依他起性。</p><p>　　二空所显示的圆满、成就和诸法实性称为圆成实性。这就是真如体的遍、常、非虚谬，不同于自相、共相、虚空、我等。无漏有为也具三义：离倒、究竟、周遍，也可以称圆成实性，但颂文所说的是初真如名为圆成实性，并非以后的无漏依他。这种圆成实性在那依他起性上，永远远离前述遍计所执性，以二空所显真如为其自性。颂文的「于彼」说明圆成实性与依他起性既不同一，又不相离。颂文的「常远离」说明遍计所执是虚妄所执，其能取、所取之性，从道理上讲永恒非有。前文说明不空是依他起性，其性说明二空不是圆成实性，因为真如既不是有，也不是无。</p><p>　　由于前述道理，这种圆成实性与那依他起性既非相异，亦非不异。相异即真如应非彼之实性，不异即此真如性应是无常。彼此都应当是净非净境，根本智与后得智应无区别。为什么说依他起性与圆成实性非异非一呢?如无常、无我等性是一样。无常等性与行等法如果相异，应彼行法非无常等。如果不异，无常等此应非彼行等之共相。由上述譬喻，说明这种圆成实与那依他起性，既非同一，又非相异。诸法与法性，从道理上来讲也必然是这样，因为胜义与世俗相待而有。</p><p>　　不能说不证得圆成实性，就能见到那依他起性。在没有达到遍计所执性空的时候，就不能如实知道依他起性之有。无分别智证得真如以后的后得智中，才能了达依他起性如幻事等。虽然心法、心所法自无始以来已经能够缘取自己的相分、见分等，但我、法执永恒俱行，不能如实知道各种条件所引生的各种心法、心所法的虚妄变现。就像幻事、阳焰、梦境、镜像、光影、谷响、水月、变化而成的东西一样，非有似有。</p><p>　　依据这种意思，《厚严经》的颂说：「如果不认识真如，就不能如实知道各种行法都如幻事等一样，虽然是有，但非真有。」此颂的意思是说：遍计、依他、圆成三性，都不远离心法和心所法，意谓这三性都是由于心法、心所法及其所变现的各种条件所引生的事物，都如幻事等一样非有似有，以此诳惑愚夫，一切都称依他起性。愚夫于此硬坚持我法执、有无、一异、俱不俱等，如空中花等一样，若性若相皆无，一切都称为遍计所执性。在依他起性上，人们所妄执的我、法都是空，这空所显示的识等真性，称为圆成实性，所以三自性都不离心法等。</p><p>　　虚空、择灭、非择灭等无为法属于哪一性呢?可以属于三性。心变似虚空等相，因为这些无为法是随心而生，所以属于依他起性。愚蠢的人们对此虚妄执着为实有，这就属于遍计所执性。如果于真如虚假施设有虚空等无为法的意思，这就属于圆成实性。有漏心等肯定属于依他起性，无漏心等可以属于依他、成实二性，因由众多条件而生，所以属于依他起性，因无颠倒，所以属于圆成实性。</p><p>　　这样的三性与七真如的相摄关系如何呢?七真如如下：㈠流转真如。即有为法生灭流转的真实性质；㈡实相真如。二无我所显示的真实性质；唯识真如。意谓染法净法皆为识变之实性；㈣安立真如。即苦的真实性质；㈤邪行真如。即集的真实性质；㈥清净真如。即灭的真实性质；㈦正行真如。即道的真实性质。这七真如的真实性质属于圆成实性，因为这是根本智和后得智的境界。七真如的外相属性，流转、苦、集三真如属于遍计、依他前二性，因为这是虚妄执着的杂染法，其余的四真如都属于圆成实性。</p><p>　　三性与六法的相摄关系如何呢?六法当中都具三性，因为色、受、想、行、识及无为法都具有虚妄执着的缘生之理。</p><p>　　三性与五事的相摄关系如何呢?佛教经典的说法不一致，《瑜伽师地论》卷七十四等说依他起性摄持相、名、分别、正智，圆成实性摄持真如，遍计所执性不摄持五事。《瑜伽师地论》等说有漏心法、心所法变似所诠称为相，似能诠的显现，虚假施设为名，能变心等称为分别，因为无漏心等远离戏论，所以称为正智，不说能诠和所诠，四事从缘而生，都属于依他起性。</p><p>　　《辩中边论》说依他起性摄持相和分别，遍计所执性只摄持名，正智、真如属于圆成实性。还说有漏心法及其心所法的相分称为相，其余的称为分别，因为遍计所执都无本体，为了显示非有而假说为名，正智和真如都无颠倒，所以都属于圆成实性。</p><p>　　《楞伽经》卷七&lt;五法品&gt;说：「依他起性只摄持分别，递计所执摄持相和名，正智和真如属于圆成实性。」又说有漏心法及其心所法、相分、见分等总称为分别，因为以虚妄分别为其自性。遍计所执的能诠和所诠，随顺有情众生立为名、相二事。</p><p>　　世亲的《摄大乘论释》卷五说名属于依他起性，义属于遍计所执性。又说有漏心法、心所法、相分、见分等，由于名的势力而成递计所执性，所以称为名。遍计所执，随于此名而横计于义，其本体实际上是不存在的，虚假地成立义之名。以上诸处所说五事，其文虽然不同，而义理不相违逆，但初瑜伽所说不相杂乱，如《瑜伽师地论》的详细解释应当明白。</p><p>　　又，佛教经典中说有五相，它们和三性的相摄关系如何呢?所诠、能诠各具三性，意谓妄所计属于遍计所执性，相、名、分别随其所应，所诠、能诠属于依他起性。真如、正智随其所应，所诠、能诠属于圆成实性，因为后得智变似能诠之相。能诠、所诠二相只属于遍计所执性，因为所妄计的名之与义肯定相属。第四执着相只是依他起性，因为以虚妄分别为其自性。不执着相只属于圆成实性，因为以无漏智等为其自性。</p><p>　　又，《显扬圣教论》卷六讲到四真实，这与三性的相摄关系如何呢?世间和道理所成真实属于依他起性，因为属于相、名、分别三事。二障净智所行真实属于圆成实性；因为属于正智、真如二事。《辩中边论》说世间真实只属于遍计所执性，因为这是被世俗人共同所虚妄执着的我和法，道实所成真实通属三性，因为道理通属执着、无执着、杂染和清净。后二真实只属于第三性。</p><p>　　三性和四谛的相摄关系如何呢?四谛中一一各具三性。而且，苦谛中的无常、苦、空、无我四行相，各有三性。有三种无常：一无性无常，因为体性常无；二起尽无常，因为观生灭法为无常；三垢净无常，因为分位转变而成。有三种苦：一所取苦，由于我、法二执的所依所取形成的痛苦；二事相苦，以三苦为相；三和合苦，即各种苦相的和合。有三种空：一无性空，因为自性非有；二异性空，与虚妄所执体性不同；三自性空，以二空所显为其自性。有三种无我：一我相无我，因我相体无；二异相无我，与虚妄所执的我相不同；三自相无我，以我空所显为其自相。</p><p>　　有三种集谛：一习气集，即遍计所执自性执习气，执彼习气假立遍计所执之名；二等起集，即业和烦恼；三未离系集，即未离障真如。有三种灭谛：一自性灭，因自性不生；二二取灭，即择灭所得智使二取不生；三本性灭，即真如。有三种道谛：一遍知道，能知遍计所执性；二永断道，能永断染分依他起性；三作证道，能证圆成实性。但是，遍知道也通后二性。共七种三，与三性如次相配解释，此中所配三性，或假或实，按照上述道理应当知道。</p><p>　　三解脱门所行境界与此三性的相摄关系如何呢?从道理上来讲，三解脱门都通三性，随其事相，各一相摄。应当知道，由遍计所执性立空解脱门，由依他起性而立无愿解脱门，由圆成实性而立无相解脱门。又以三性为缘而立三无生忍：一本性无生忍，二自然无生忍，三惑苦无生忍。如其次第，此三自性是彼三忍所缘之境。</p><p>　　此三自性如何摄持那真、俗二谛呢?应当知道，俗谛具此三性，真谛只是圆成实性。有三种世俗：一假世俗，二行世俗，三显了世俗。应当知道，如其次第即此三性。有三种胜义：一义胜义，即真如，因为是殊胜之义：二得胜义，即涅槃，因为胜即义；三行胜义，即圣道，因为以胜为义。前二胜义没有变化，第三胜义无颠倒，所以都包括在圆成实性当中。</p><p>　　这样的三性何智所行呢?遍计所执性都无智所行，因为它没有自己的体性，不是所缘缘，愚蠢的人妄执为有，圣人通达为无，也可以说为凡人和圣者所知之境。依他起性是二智所行之境，圆成实性只是圣智境。</p><p>　　这样的三性几种是假，几种是实呢?因为遍计所执性是妄情安立，可以说为假，既然是无体相，所以是非假非实。依他起性有实有假，假有三种：一聚集假，二相续假，三分位假。所以说为假有。心法、心所法和色法是从众缘而生，所以说为实有。如果没有实法，假法也没有，因为假法必须依实法之因而虚假施设。圆成实性只是实有，因为它不依靠其他条件而虚假施设。</p><p>　　这三性是相异呢，还是不异呢?应当说既非异，亦非下异，因无别体，遍计所执性是妄执，依他起性是缘起，圆成实性是真义，三者有此差别。</p><p>　　这样的三性，义类深广无边，但恐怕厌于繁文，只能提纲挈领地预以阐明。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第九",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第九</strong></p><p>　　如果有三性，为什么佛说一切事物都无自性呢?</p><p>　　颂说：依此三性而立三无性，所以佛教经典中都以密意而说，一切事物都是无自性的。首先依遍计所执性而立相无性，次依依他起性而立生无性，因为它不是由身生成，所以也无自然性。至于最后的圆成实性，因为它远离遍计所执的我性和法性，所以它本身就是无自性的状态，这就是胜义无性。因为它是一切事物的最高理境，所以它也就是真如。因为它永远是这种性质，所以这就是唯识的真实性质。</p><p>　　论说：就是依据前文所说的三性而立后文所说的三无性，即相无性、生无性和胜义无性。所以佛以密意而说，一切事物都是无自性的，并非其性全无。所谓「密意」是指非了义，意谓后二性虽然体性并不是无，但有的愚蠢人，对于它增益妄执为实有我、法自性，这就称为遍计所执性。为了破除这种妄执，所以佛世尊对于有和无总说为无性。</p><p>　　怎样依此三性而立彼三无性呢?即依此第一遍计所执性而立相无性，因为遍计所执的体性和外相毕竟是没有的，就像空中花一样：依据第二依他起性而立生无性，这就像幻事一样，依托各种条件而生。不像虚妄执着的自然性那样，所以假说无性，并非其性全无。依最后的圆成实性而立胜义无性，意思是说：这种胜义由于远离第一遍计所执的我性和法性，所以是假说无性，并非其性全无。就如太虚空一样，虽说普遍含有各种色(物质)，但各种色都表现出无自性。虽然依他起性并非胜义，也可以说是胜义无性。如果是这样的话，圆成实性的胜义无性就是第二胜义无性。为了防止与第二胜义无性相滥，所以这里不这样说。</p><p>　　圆成实性就是各种事物的胜义，因为这是一切事物的胜义谛。然而胜义谛简略来说有四种：㈡世间胜义，即五蕴、十二处、十八界等；㈡道理胜义，即苦、集、灭、道<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>；㈢证得胜义，即我、法二空真如；㈣胜义胜义，即一真法界。这里所说的胜义是依第四胜义而说，因为这是最胜道所行之义。为了和前胜义相区别，所以《唯识三十颂》说：「此诸法胜义，也就是真如。」「真」意谓真实，表明并非虚妄。「如」意谓永恒如此，表明永无变易。意谓这种真实在一切发展阶段，其本性永恒如此，所以称为真如，就是明显的非虚妄之义。</p><p>　　颂文的「亦」字表示真如还有很多名称，又称为法界、实际等，如《大乘阿毘达磨集论》、《佛地经论》、《瑜伽师地论》、《显扬圣教论》等，随顺其义，详细解释。圆成实性就是唯识实性。唯识性简略来说有二种：一者虚妄，即遍计所执性：二者真实，即圆成实性。为了除掉遍计所执的虚妄计度，所以这里说实性。又有二陆：一者世俗，即依他起性：二者胜义，即圆成实性。为了除掉世俗，所以这里说实性。</p><p>　　《唯识三十颂》的这三颂从总的方面说明各部佛经所说的“无性”是非极了义，告诫有智之人，不应当据此三颂认为诸法皆无自性。</p><p>　　这就形成了唯识的相和性。谁于几个阶位悟入呢?怎样悟入呢?具大乘二种姓者，简略来说于五位可以逐渐悟入。</p><p>　　什么是大乘二种姓呢?一本性住种姓。意谓自无始以来，依附本识阿赖耶识自然而有的无漏法之因：二习所成种姓。意谓由于听闻十二分教法界等流正法以后，由闻、思、修慧熏习所成种姓。只有具备这二种大乘种姓，才能逐渐悟入唯识。</p><p>　　什么叫做悟入唯识五位呢?一资粮位，即修大乘顺解脱分：二加行位，即修大乘顺抉择分：三通达位，即诸菩萨所住见道：四修习位，即诸菩萨所住修道：五究竟位，即佛住无上正等菩提。</p><p>　　如何逐渐悟入唯识呢?意谓诸菩萨对于识的外相和体性，在资粮位中能够深刻信仰和理解。在加行位能够渐次制伏铲除所取和能取，引生对最高实在的认识。在通达位，以无漏现行二智证悟实相。在修习位，按照所认识的道理，反复修行，伏余烦恼，断余智障。至究竟位，全出二障，功德智慧无不周备，所以称为圆。福智清净极胜，不迷不闇，故称为明。能至无尽未来，<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>有情众生，使他们也悟入唯识的相和性。</p><p>　　第一位资粮位的相状如何呢?</p><p>　　《唯识三十颂》说：「由最初发心修行求住于唯识，但还没有安住于唯识的时候，能取、所取的随眠活动还没有制伏灭除。」</p><p>　　论说：从发深刻坚固的大<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>开始，乃至于还未生起顺抉择识，求住于唯识的真正胜义状态。这一阶段都属于资粮位。为了达到无上正等菩提，修习各种殊胜资粮，为了教化有情众生，勤勉地追求解脱，因此也称为顺解脱分。处于这个阶位的菩萨，依靠因、善友、作意、资粮四种殊胜之力，对于唯识的意思虽然深刻信仰理解，但还没有明了能取和所取之空，多住散心修菩萨行。所以对于能、所二取所引生的随眠，还没有能够制伏和灭除的功力，不能使之不再生起二取现行。</p><p>　　能、所二取之说表明二取之取，因为它们执取能取和所取之相。能、所二取习气称为它们的随眠，因为它们随逐有情众生，眠伏于阿赖耶识之中。或者随顺它们而增生过失，所以称为随眠，这就是所知障和烦恼障的种子。</p><p>　　烦恼障就是以遍计所执实我萨迦耶见为首的一百二十八种根本烦恼，以及与此平等而流出的各种随烦恼。它们都扰乱有情众生的身心，能够障碍达到湼盘，所以称为烦恼障。所知障就是以遍计所执的实法萨迦耶见为首的恶见、疑、无明、爱、瞋、慢等，遮覆所知境的真实性，能够障碍菩提，此称所知障。这种所知障肯定不与阿赖耶识相应，因为阿赖耶识微细劣弱，不能与无明和慧相应，菩萨的法空智品可以与这第八识俱起。七转识内，根据不同情况，或多或少地与所知障相应，就如烦恼障一样。眼、耳、鼻、舌、身五识因为没有计度分别，肯定不能与法见、疑等相应，其余的由意识力都可以引起。所知障只与不善、无记二种心相应，因为《瑜伽师地论》卷五十九说无明只通不善和无记性，因为痴与无痴等不能相应。</p><p>　　在烦恼障中肯定有所知障，因为烦恼障肯定要以所知障作为所依。烦恼障和所知障，其体虽然没有区别，但作用却有区别。所以烦恼、所知二障随眠随声闻、缘觉、菩萨三乘圣道有胜有劣，断的时间有前有后。所知障在无覆无记性中是异熟无记，并不是其余的三种无记，因为威仪等三种无记，势力薄弱，不能遮覆所知境，不能障碍菩提。所知障称为无覆，是对小乘佛教的声闻、缘觉二乘所说，如果对菩萨来说也是有覆。</p><p>　　如果所知障有恶见、疑等，《胜鬓经》为什么说为无明住地呢?</p><p>　　论王回答说：因为所知障中无明增盛，所以总称为无明。并不是没有恶见等。如果烦恼种子立见一处住地、欲爱住地、色爱住地、有爱住地之名，岂不是又没有慢、无明等了吗?烦恼、所知二障都通六识，分别起者属于见道所断，任运起者属于修道昕断。声闻、缘觉二乘只能断烦恼障，菩萨二障都断。永远断除二障，只有圣道才能做到，压伏二障现行通有漏道。在资粮位的菩萨，二障的粗现行虽然有的已被伏灭，但对于细现行和二障随眠来说，由于<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>之力微弱，还没有能够伏灭。</p><p>　　第二加行位，其特点如何呢?</p><p>　　《唯识三十颂》说：「在修学四寻思观、四如实智的时候，仍有少量的假立之物出现在面前，自以为是唯识的性质。因为有所得，这并不是真正的住于唯识。」</p><p>　　论说：菩萨首先在最初的无数劫波之中，很好地准备了福德智慧资粮，已使顺解脱分圆满成就。为了进入见道并住于唯识实性，又在加行位修行，以灭除能取和所取，这就是暖、顶、忍、世第一法。这四种总称为顺抉择分，因为它随顺趣向真实的抉择分，邻近见道，所以立加行之名，但并不是说以前的资粮没有加行的意思。</p><p>　　暖等四种，暖、顶二位依四寻思观而立，忍和世第一法依四如实智而立。所谓四寻思观是寻思事物的名、义、自性和差别，从而认识到世间万物是虚假的有，实际上是无，真实地普遍认识到，暖等四法离开识是不存在的，识也是不存在的，这就叫做如实智。因其名称和意义都不相同，所以要分别寻求。因为一自性同，二差别同，所以把名、义二种的自性和差别合起来进行思索观察。</p><p>　　菩萨依此智慧而修禅定发下品寻思观，认识到所取为空，由此而立为暖位。即在暖位首先认识到所取外境的名、义、自性、差别四法都是心识所变，都是虚假施设而有，实际上是不存在的。因为这种禅定是最初获得智慧太阳以前的行相，所以称为「明」，这也是所获净道之火以前的行相，所以又称为「暖」。</p><p>　　依据增长的智慧引发上品寻思观，重观所取为空，由此立为顶位。即在此位重观所取的名等四法皆自己的心识所变，都是虚假施设而有，实际上是不存在的，因为智慧之明相增长，所以称为明增，修寻思观至此位达到最高绝顶，所以又称为「顶」。</p><p>　　依印顺定引发下品如实智，对于所取空能够明确地认识到，并预以确定，对于能取空也能够忍乐随顺。既然没有真实的外境离得开能取的心识，怎么会有真实的心识离得开所取的外境呢?因为所取和能取相待而成立。印持忍随顺忍的时候，总的立为「忍」，印持前面的四寻思观，随顺后面的四如实智，故立印顺之名，认识到外境和心识都是空，所以又称为「忍」。</p><p>　　依无间定力引发上品如实智，印持能取、所取都是空，成立世第一法。意谓前述上品忍只印持能取空，现在所讲的世第一法印持能取、所取二空，从世第一法入见道位，中无间隔，所以称「无间」。在世俗法中最为殊胜，所以称为世第一法。</p><p>　　像这样的暖位、顶位依据能取之识，观察所取之空，下品忍生起的时候，印持外境之空相，中品忍转换为能取之识，像外境一样也是空，顺乐后位的上品之忍。上品忍生起之处印持能取之空，世第一法印持能取、所取二空所执相，因为都还带有外相，所以还没有证得真理，所以说菩萨在这四位中还有心识所变的名等少物，自以为是唯识的真正殊胜之义。但因为这种空、有二相还没有灭除，其心识仍有执着之相，因为有所得，所以并不是真正地安住于唯识道理。灭除那种相状，才是真正地安住于唯识道理，依据这种意义，有经文的颂这样说：菩萨在禅定的时候，观内心境影，只是内心，这是暖位。遍计所执心外之境义相既已灭除，审观唯自相，只有内心，这是顶位。这样住于内心，知晓所取为空，这是下忍位。然后知道能取之识也是空，这是中忍位和上忍位。把以上内容合在一起，就能知道能取、所取都是空，这是世第一法。然后接触到无所得，进入真正的见道。」</p><p>　　在此加行位，还没有遣除相分对见分等的系缚，对于一切有漏法的粗重系缚也没有能够断除，只能降伏并灭除起分别作用的能取之识和所分别的所取外境，因为它不同于见道。有漏之心对于俱生二取及俱生、分别二种随眠还有所得，还有分别，还没有全部降伏，还没有能够全部灭除。加行位的菩萨，对于安立谛和非安立谛都学习过并考察过。这是为了引生未来的二种见道，也是为了降伏分别烦恼、所知二障，对非安立谛也能够正确地进行思察，并不像声闻、缘觉二乘人那样只思察安立谛。</p><p>　　菩萨生起暖、顶、忍、世第一法四善根，虽然方便的时候可通各种禅定，但是只有依靠第四静虑才能够得到圆满成就，因为只有依靠最殊胜的禅定才能进入见道。只能依靠欲界善趣之身生起，因为色界和无色界的智慧，厌伏三界一切事物之心并非殊胜。这四善根也属于解行地，因为它们还没有证得唯识的真正殊胜之义。</p><p>　　第三通达位，其特点如何呢?</p><p>　　《唯识三十颂》说：「假若无分别智产生的时候，对于所缘的真如理及其能悟所缘真如的无分别智，二者冥会都无所得，这时候就住于唯识之理，因为已经没有了能取、所取之相。」</p><p>　　论说：如果那时候，菩萨不仅所观境无所得，能观的无分别智亦无所得，因为此时已无各种戏论之相。这时候就称为实际住于唯识真正的殊胜之义，也就是亲证真如之智，体即真如，都已远离能取、所取之相。能取、所取都是分别，有所得之心会使戏论呈现。</p><p>　　有人认为：无分别智已无相分和见分，因为颂文说已无所取、能取之相。</p><p>　　又有人认为：无分别智的相分和见分都有，因为《观所缘缘论》说：「所缘缘者，谓能缘识带彼相起。」这就称为缘彼相分。如果没有它的相分而称为「缘彼」，就应当是缘色相分之智等称为缘声相分之智等。如果没有见分，就应当是不能缘，怎么能够说为缘真如之智呢?因为不能说真如之性也称为能缘，所以应当承认无分别智肯定有见分。</p><p>　　护法认为：这种无分别智有见分而无相分，因为《瑜伽师地论》卷七十三说没有相可取，不缘取外境之相。虽然有见分但无分别，虽说没有能取识的见分，但并不意味着能取的功能一点也没有。虽然没有相分，但可以说无分别智带彼真如之相而起，因为无分别智离不开真如。就如自证分缘见分时一样，不经变化而缘取，无分别智缘真如时也应当是这样。如经变化而缘取就不是亲证，就像是后得智那样，应当是有分别。所以应当承认，无分别智有见分而无相分。在加行位修无间定无分别智产生的时候，去体会真如，这就称为通达位。因为这是最初照见真理，所以也称为见道。</p><p>　　然而这种见道简略来说有二种：一真见道，这就是所说的无分别智。实际上已经证得我、法二空所显示的真理，实际上已经断除烦恼、所知二障的分别随眠。虽然众多剎那才得究竟，但其相状一直相同，所以总的说为一心。</p><p>　　有人认为：在真见位逐渐证得人、法二空，逐渐断除二障，因为有浅有深有粗有细，互不相同。</p><p>　　又有人认为：在真见道可以顿证二空，顿断二障，因其意向和欢乐力具有这种功能。</p><p>　　二相见道，又有二种：第一、观非安立谛，包括以下三品心：㈠认识到有情众生的自身都是虚妄所执，只有内心。有情识众生的自身似乎是存在的，但实际上是假有，并无实体，从而认识到我空。这种能缘之心是遣除有情众生自身的缘智，这种缘智能够灭除下品或弱小的分别随眠。㈡认识到一切客观事物都是虚妄所执，只有内心。一切客观事物似乎是存在的，但实际上是假有，并无实体，从而认识到法空。这种能缘心是遣除一切虚假事物的缘智，这种缘智能够灭除中品分别随眠。㈢认识到一切有情识众生自体和一切客观事物都是虚妄所执，只有内心。一切有情识众生自体和一切客观事物似乎是存在的，但实际上是假有，并无实体，从而认识到我空、法空。这种能缘之心是普遍遣除虚假有情自身及一切虚假事物的缘智。这种缘智能够灭除一切分别随眠。前二种缘智称为法智，因为分别而缘。第三是类智，因为它综合而缘二。真见道的法则有我、法二<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>分，见分中有无间解脱，有二个无间，即我、法二空，有一个解脱，故有三心。二个无间为别，一个解脱为总，这就是相见道。有人认为：这三心是真见道，因为相见道缘取四谛。又有人认为：这三心是相见道，因为真见道总缘真如，并不分别缘取。</p><p>　　二缘安立谛，包含有十六心，这又分为二种：第一依观所取谛理和能取的缘理之智，分别建立法智和类智的十六种心。即苦谛有四种心：㈠苦法智忍。即通过观三界的苦谛真如，正确断除三界关于苦的见解所断除的二十八种分别随眠：㈡苦法智。即忍是无问道，观察以前的真如，因为以前所断除的烦恼，而证得解脱：㈢苦类智忍。与以前的苦法智毫无间断，使无漏智慧产生，各别证得法、忍、智，所说以后的圣法都与此同类：㈣苦类智。即这种无间道使无漏智慧产生，经过审思核定而承认苦类智忍。就像苦谛有四种心一样，应当知道集、灭、道谛也是这样。这十六心的八种法品缘如，八种类品缘智。在法真见道中，无间和解脱的见分和自证分，分别而立，所以称为相见道。</p><p>　　第二依观上下二地安立苦、集、灭、道四谛之境，分别建立法类十六种心，即观欲界及色、无色二界的苦、集、灭、道四谛，各有二心㈠现观忍，㈡现观智。按其桐应，在法真见道的无间解脱见分观四谛法，断除见道所断的一百二十种分别随眠，这称为相见道。</p><p>　　如果依据广泛传布的神圣敦诲的道理，据说相见道有九种心。这就是依据前述缘安立谛的二个十六种心，由止和观分别建立。即法类品的法忍和法智各有四心，合起来即为八心，这八心与止相应，总的说为一种。虽然见道中止和观都运用，但是见道的观并不是止，所以观和止有时分开，有时合并运用，这是不相同的。所以，这九心称为相见道。</p><p>　　各种相见道依真实义假说世第一法无间断而产生，并断除随眠，实际上并非如此。因为真见道以后才能得以产生，非安立谛以后才会生起安立谛，到这时候，分别随眠才真正已经断除。前述真见道证得唯识实性，后述相见道证得唯识之相。这二种见道之中，前者殊胜，所以颂文只说真见道。</p><p>　　前述真见道属于根本智，后述相见道属于后得智。</p><p>　　各种后得智是不是有见分和相分呢?</p><p>　　安慧认为：见分和相分都没有，因为它已经没有能取和所取。</p><p>　　二师认为：后得智有见分，但没有相分，因为后得智还有分别作用，又因为圣教的后得智都能够直接缘取外境，因为已无执着，所以没有能取和所取。</p><p>　　护法认为：这种后得智见分、相分都有，因为《瑜伽师地论》卷七十三说：思惟表明有见分。似乎是真如相，但不见真实的真如性，所以有相分。《佛地经论》、《摄大乘论》等又说这种后得智分别各种事物的自相、共相等，因为要根据各种有情众生的根性差别进行教诲。《佛地经论》又说这种后得智使菩萨呈现为身、土等，为各种有情众生现身，讲说正法，如果不变现为似乎是存在的色、声等，怎么会有菩萨现身说法等事呢?如果变现色蕴不呈现为色，变现受、想、行、识四蕴就应当是不呈现为受、想、行、识。由此可见，二师所说的无相义是不对的。而且，如果这种后得智不变似外境，各种非自体的事物就不带影像，应当下是所缘缘，缘色等的时候，应当是缘声等。而且，当缘不存在的事物时，应当是没有所缘缘，因为其体并非实有，没有缘的作用。由此可见，后得智有见分，也有相分。</p><p>　　真见道、相见道与六现观的相互包含关系是怎样呢?六现观是：㈠思现观。与最殊胜的喜受相应的思所形成的智慧。这种思现观能够观察各种事物的无常等共性，能够引生暖等，在加行道<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>察各种事物，思现观的作用最为猛利，所以特别立为现观。暖等不能广泛地分别事物，又没有证得真理，所以不是现观。㈡信现观。即缘三宝世间、出世间的坚定清净信仰，信现观可以帮助现观，使之不退，所以称为现观。㈢戒现观。即无漏戒律，断除破坏戒律的污垢，使现观增长明利，这也称为现观。㈣现观智谛现观。即一切见、修二道的根本智和后得智，缘非安立谛之境：㈤现观边智谛现观。即现观智谛现观以后，各种缘安立谛的世间智和出世间智：㈥究竟现观。即尽智等究竟位的智慧。这种真见道包含第四现观很少的一部分，这种相见道包含第四现观和第五现观很少的一部分。第二现观和第三现观虽然与道同时俱起，但并非自性，所以与二种见道无关。</p><p>　　菩萨得此真见道和相见道的时候，即生如来家。住十地中的极喜地，很好地通达法界，并得各种平等。往往生于诸佛的大集会之中，也就是常生在佛之报土他受用土之中。于一念间得百三昧，得见百佛，知百佛神力，能动百佛世界，能入百佛世界，能照百佛世界，能教化百佛世界众生，能住寿百劫，能知过去、未来世各百劫事，能善入百法门，能变身为百，于二身能示百菩萨以为眷属。像这样的百门皆得自在。自己知道，不久以后就会证得大菩提，能够永远使众生得到利益和安乐。</p><p>　　第四修习位，其特点如何呢?</p><p>　　《唯识三十颂》说：「此位菩萨没有能取之心，也没有所取的外境，这种无分别智具有超越世间的不可思议的功用，这就是出世间智。因为已经舍除了二障种子，这就证得了转依。」</p><p>　　论说：菩萨从以前的见道以后，为了断除其余的障碍，证得转依，还要多次地修习无分别智。这种无分别智已经没有所取的外境，所以颂文说无得」，也没有能取之识，所以颂文说「不思议」。或者解释为无戏论，说为「无得」。这种无分别智的奇妙功用难以揣测，所以颂文说「不思议」。这就是出世间的无分别智，因为它已经断除世间烦恼，所以称为出世间。能取、所取随眠是世间的根本，只有这种无分别智能够使之断除，所以只有它能得出世之名。或者出世之名依二种意义而立，即其体无漏并证得真如。这种无分别智具有这二种意义，所以只有它称为出世，其余的智慧都不能这样称呼。这就是十地中的无分别智。</p><p>　　因为多次修习这种无分别智，所以舍除了二种粗重。二障种子称为粗重，其性质使无分别智不可容忍，不细故名为粗，不轻故名为重。无分别智使之永远灭除，所以颂文说为「舍」。因为这种无分别智能够舍除那二种粗重，所以能够证得广大的转依。「依」就是所依，即依他起，因为染法和净法为其所依。「染」即虚妄的遍计所执性。「净」即真实的圆成实性。「转」有二层含意：一是转舍，二是转得。</p><p>　　由于多次修习无分别智，断除阿赖耶识中的二障种子，所以能够转舍依他起上的遍计所执性，并能够转得依他起上的圆成实性。由于转掉烦恼障，便证得伟大的涅槃：因为转掉所知障，便证得至高无上的正等觉。成立唯识的意义，就是为了使有情众生证得这样的二种转依果。或解释为「依」就是唯识真如，因为它是生死和涅槃的所依。愚蠢的人认识颠倒，对这种真如迷惑下解，所以自无始以来受生死之苦。圣人没有这种颠倒认识，领悟这种真如，所以得到湼盘和终究安乐。</p><p>　　因为经过多次修习，无分别智断除了阿赖耶识中的二障种子，所以能够依靠真如转灭生死，依靠这种真如还能够证得涅槃，这就是真如的远离染之性。这种真如虽然其性清净，但其相杂染。所以离开染污的时候，假说新变成的清净。这种新变成的清净就说成是转依。在修习位中断除二障，金刚心以后证得。虽然在修习位中也可以得到菩提，但并不是这里颂文所说的。颂文的意思只是说明转得唯识性。声闻、缘觉二乘圆满的时候称为解脱身，成佛的时候才称为法身。</p><p>　　怎样证得二种转依呢?要在十地中修十胜行，断除十重障，证得十种真如，二种转依由此而得。</p><p>　　所说的十地是：一极喜地。初断凡性而得圣性，具证我法二空，既能利己，又能利他。因此，得大欢喜，故称极喜地：二离垢地。遵守清净戒律，远离能够生起微细犯戒的烦恼污垢，故称离垢地：三发光地。成就殊胜禅定和殊胜之教大法总持，因为能够发出无边奇妙智慧之光，所称为发光地：四焰慧地。安住于最殊胜的菩提分法智慧，烧尽一切烦恼之薪，因为智慧火焰增盛，所以称为焰慧地：五极难胜地。真谛智和俗谛智，二者行相互相违逆，极难胜地的菩萨能够使之和合相应，此事甚难，菩萨能办，所以称为极难胜地：六现前地。安住于缘起智，引生无分别智最殊胜的般若智慧，使之现前，故称现前地：七远行地。此位菩萨常现观无相，仍有功用，其后超越世间及二乘之道：八不动地。无分别智任运相续，因为下为外境之相、功用及烦恼所动，所以称为不动地：九善慧地。此地菩萨成功地获得微妙的四无碍解，能够遍于十方，善于讲说正法：十法云地。此地菩萨具足广大敦法，这种一切事物共相境就像大云一样，含有总持、禅定等各种功德净水，又像大云隐覆虚空一样。这种法智就像虚空一样广大无边，消除了二障粗重，充满法身，故称法云地。</p><p>　　像这样的十地，其自性含有一切有为功德和无为功德。这十地是一切殊胜修行的所依，使修行功德增长，所以称为地。</p><p>　　十胜行就是十种波罗蜜多。施有三种，即财施、无畏施和法施。戒有三种，即<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒、摄善法戒和<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情戒。忍有三种，即耐怨害忍、安受苦忍和谛察法忍。精进有三种，即被甲精进、摄善精进和利乐精进。静虑有三种，即安住静虑、引发静虑和办事静虑。般若有三种，即生(我)空无分别慧、法空无分别慧和我、法二空无分别慧。方便善巧有二种，即<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>方便善巧和拔济方便善巧。愿有二种，即求菩提愿和利乐他愿。力有二种，即思择力和修习力。智有二种，即受用法乐智和成熟有情智。</p><p>　　这十波罗蜜多的本性如何呢?布施以无贪及其相应生起的身、口、意三业为性，戒以受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>和学菩萨戒时的三业为性，忍以无瞋、精进、审慧及其所生起的三业为性，精进以勤及其所生起的三业为性，静虑只以等持为性，以后五种(般若、方便善巧、愿、力、智)都以简别事物为性，因为《摄大乘论》说般若是根本智，最后四种是后得智。有人认为：第八波罗蜜多以欲、胜解和信为性，因为“愿”以这三种为其自性。此中所说的自性，如果把与之相应而起的眷属合并在一起的话，每一种波罗蜜多都以一切同时生起的功德为其本性。</p><p>　　至于这十种波罗蜜多的相状，必须有七种最胜所含摄的内容，才能成立波罗蜜多。一安住最胜。实行罗蜜多必须安住于菩萨种姓；二依止最胜。就是要使波罗蜜多依止大菩提心；三意乐最胜。就是要慈悲、怜愍一切有情众生；四事业最胜。就是要使波罗蜜多成办一切与之相应的事业；五巧便最胜。就是要使波罗蜜多由无相智所摄持所含受；六回向最胜。就是要使波罗蜜多的功德回向至高无上的菩提；七清净最胜。就是波罗蜜多不能以烦恼、所知二障所间杂。如果波罗蜜多不被这种最胜所摄持所含受，所实行的布施等就不能达到涅槃<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。因此，这十种波罗蜜多每一种都应当以四句进行分别。</p><p>　　波罗蜜多只能是十，不能多，也不能少，因为在十地中要对治十障，证得十真如，不能多，也不能少。而且，前六种波罗蜜多，不能多，也不能少，因为要除掉六种相违障，逐渐修行各种佛法，逐渐使各种有情众生成熟，这些内容通过《摄大乘论》的详细解释可以明白。而且，施、戒、忍前三种波罗蜜多，是菩萨们起增加和促进的道路，因为施能感大财，戒感眷属。精进、静虑、般若三种波罗蜜多是肯定胜利的道路，因为精进能够降伏烦恼，静虑能使有情众生成熟，般若能使佛法成熟。各种<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>只有这二种。而且，施、戒、忍前三种波罗蜜多，能给众生带来利益，菩萨行施即对众生施舍钱财，行戒不给众生带来损失和烦恼，行忍能够忍受众生给他们带来的损害。精进、静虑、般若三种波罗蜜多，能够对治烦恼。菩萨行精进的时候，虽然没有永远降伏烦恼，没有永远灭除随眠，但能勇猛修习各种善行，各种烦恼不能倾动善行。由于修习静虑，能够永远降伏烦恼。由于修行般若，能够永远灭除随眠。</p><p>　　而且，又因为施、戒、忍前三种波罗蜜多不住于涅槃，又因为精进、静虑、般若后三种波罗蜜多，不住于生死。所以，这六种波罗蜜多是无依处涅槃的资粮，所以前六种波罗蜜多不能增多，也不能减少。以后的波罗蜜多只有四种，其功能是为了帮助前六种波罗蜜多，使之修行圆满成就，所以不能增多，也不能减少。方便善巧波罗蜜多帮助施、戒、忍前三种，愿帮助精进，力帮助静虑，智帮助般若，使之修行圆满成就，像《解深蜜经》那样详细解释应当明白。</p><p>　　这十种波罗蜜多的次第，由前者引生后者，由后者确定并净化前者。而且前粗后细，前者容易修习，后者虽于修习，所以成立这样的次第。总的释名和分别释名，如《解深密经》、《摄大乘论》等所说。</p><p>　　修习这十种波罗蜜多，有五种修：一依止任持修，二依止作意修，三依止意乐修，四依止方便修，五依止自在修。依靠这五种修，修习十波罗蜜多，使之都能够圆满成就，其特点就是是《大乘阿毘达磨杂集论》等所详细解释的那样。</p><p>　　至于这十种波罗蜜多的相互含摄关系，即十种波罗蜜多的每一种都含摄一切波罗蜜多，因为各波罗蜜多之间互相随顺。依靠修习前者，能够引发后者，前者包括后者，因为后者必须依靠前者。后者不包括前者，依靠修习者确认并净化前者。后者包括在前者之中，因为后者确认并净化前者。前者不包括在后者当中，因为前者不确认并净化后者。如果依纯净和间杂进行修习的话，展转相望，应当用四句话进行表达。</p><p>　　波罗蜜多实际上是十种，但说为六种。应当知道，后边四种(方便善巧、愿、力、智)包括在第<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>多当中。分为十种，是因为第六(般若)只包括无分别智，后边四种都属于后得智，因为他们只缘世俗法。这十波罗蜜多的结果，属于有漏的有四果，五果中只除离系果。属于无漏的也有四种，五果中只除异熟果。《大乘阿毘达磨杂集论》说波罗蜜多具有五果，或者认为是所引果的相互资助，或者认为是波罗蜜多所生染、净二种结果的总合。</p><p>　　十波罗蜜多和戒、定、慧三学的互相摄持关系，戒学有三：一律仪戒，即正确地远离所应当离开的事物；二摄善法戒，即正确修习并证得应当<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>的事物；三饶益有情戒，即正确地认为一切有情众生带来利益和安乐。三学与声闻、缘觉二乘有的相同，有的不相同，这种道理非常深刻，又非常广大，如世亲著《摄大乘论释》所说。</p><p>　　定学有四种：一大乘光明定。这种禅定能够照耀大乘的道理、教诲、实践、果报的智慧，使之光明；二集禅王定。因为这种禅定能够自由在地聚集无边无际的幸福，就像是国王的势力一样，没有任何人与之相等；三贤守定。因为这种禅定能够守护世间和出世间的善法；四健行定。因为这种禅定由佛和菩萨这些伟大的圣贤们所修行。这四种禅定的所缘、对治、堪能、引发、作业，如《摄大乘论》所说。</p><p>　　慧学有在种：一加行无分别慧，二根本无分别慧，三后得无分别慧。这三慧的自性、所依、因缘、所缘、行等，如《摄大乘论》所说。像这样的三慧，在最初的第二位(资粮位和加行位)中，种子具有三慧，现行只在加行位。在通达位，现行有二慧，种子有三慧，因为在见道位没有加行。在修习位的七地以前，无论是种子还是现行，都具三慧，八地以后，现行有二慧，种子有三慧。因为在无功用道(第八地不动地)与加行无分别慧相违逆，所有进趣都用后得无分别慧，因为它在无漏观中任运生起。在究竟位中，现行和种子都具有二种慧，因为现行和种子中的加行无分别慧都已舍除。</p><p>　　如果只从自性含摄来说，戒学只含摄波罗蜜多，定学只含摄静虑波罗蜜多，慧学含摄后五种波罗蜜多。如果把三学及其助伴(起辅助作用的因素)合并在一起进行考虑，三学与十波罗蜜多都互相含摄。如果随顺功用含摄来说，戒学只含摄前三种波罗蜜多，因为施波罗蜜多是戒学的资粮，戒波罗蜜多是戒学的自体，忍波罗蜜多是戒学的眷属，定学含摄静虑波罗蜜多，慧学含摄后五种波罗蜜多。精进波罗蜜多含摄戒、定、慧三学，因为精进普遍策励三学。如果从显现的含摄关系来说，戒学含摄前四种波罗蜜多。前三种波罗蜜多，如前述及分别守护者，如定学含摄静虑波罗蜜多，慧学含摄后五种波罗蜜多。</p><p>　　这十种波罗蜜多在未成佛以前的因位，有三种名称：第一称为远波罗蜜多，意谓在最初的无数劫，当时施等波罗蜜多的作用还很微弱，被烦恼降伏，波罗蜜多还没有降伏烦恼。因此，在波罗蜜多还没有产生影响以前，烦恼仍然可以成为现行。第二称为近波罗蜜多，意谓在第二个无数劫，当时施等波罗蜜多的作用逐渐增大，烦恼不能降伏它们，它们确能降伏烦恼。因此，除非是故意才能使烦恼成为现行。第三称为大波罗蜜多，意谓在第三个无数劫，此时施等波罗蜜多的作用变得非常大，能够毕竟降伏一切烦恼。因此，使烦恼永远不能成为现行，但是因为还有所知障的微细现行和种子，还有烦恼障的种子，所以还没有究竟成佛。</p><p>　　这十波罗蜜多的义类差别是无穷无尽的，《解深密经》、《瑜伽师地论》卷七十八等都有论述，但文字十分烦琐，恐怕使人厌烦，所以我们只能提纲挈领地、简略地讲个大概。十波罗蜜多虽然实际上在十地都可以修习，但在初地施波罗蜜多增上，在二地戒波罗蜜多增上，乃至十地智波罗蜜多增上。随其增上之相，每地只能修习一种波罗蜜多。虽然在十地的修行无数但都包括在十种波罗蜜多当中。</p><p>　　至于十重障，第一是异生性障。意谓烦恼、所知二障之中的分别而生起，依其种子建立凡夫本性。声闻、缘觉二乘见道出现在面前的时候，只能断除烦恼障的一种种子而称为获得圣性。菩萨见道出现在面前的时候，断除烦恼、所知二障种子，称为获得圣性。二乘人的见道和菩萨的见道出现在面前的时候，二障种子肯定不能断续在。就像是光明和黑暗肯定不能同时生起，就像是一杆秤的两头不能同时既低又昂，各种相反的事物，从道理上来讲肯定也应当是这样。我们这样讲不会违犯凡夫和圣性同时成立的过失。</p><p>　　小乘佛教说一切有部诘难说：根据我们的意见，在无间道还有烦恼种子生起，到解脱道时进行对治。你们却认为在无间道已经没有烦恼种子，那解脱道还有什么作用呢？</p><p>　　论主说有二种原因：㈠因为以前的加行期有别。无间道能够断惑，解脱道能够证得择灭无为，所期之心有别。虽然无间道已无惑种，但要证得择灭无为要靠解脱道。因为有这样的作用，所以要特别生起解脱道：㈡为了舍除烦恼、所知二障的粗重性，粗重性即无堪任性。在无间道时虽然没有烦恼种子，但并没有舍除它们的无堪任性。为了舍除这种无堪任性，所以生起解脱道。无堪任性和解脱道都灭除以后，就证得了择灭无为。虽然说在见道生起的时候，确实也能断除恶趣的诸业诸果等。但是，现在姑且说能起的烦恼，因为烦恼是业和果的根本。</p><p>　　因此，《解深密经》和《瑜伽师地论》卷七十八说：在初地极喜地断除二愚及其粗重。二愚如下：㈠执着我法愚，就是这里所说的异生性障；㈡恶趣杂染愚，就是恶趣中的各种业、果等。应当知道，愚的种类总的说为愚，以后所讲的愚以这种解释为准。或者说：第一执着我法愚是利障品俱起愚，第二恶趣杂染愚。不一定是业和果，而是钝障品俱起愚。这里所说的粗重是二愚的种子，或者说是二愚所赖以生起的无堪任性，如苦根等，《瑜伽师地论》卷十一说入第二禅以后要断除苦根，所断的苦根虽然不是现行和种子，但称为重，这也应当如此。以后所说的粗重也应当这样解释。虽然初地极喜地实际上断除二障，但异生性障的意思只取所知障，世亲的《摄大乘论》卷七说有十种无明对二乘人来说并非染污，这里所说的无明就是十障之愚。小乘佛教的声闻、缘觉二乘人也能断除烦恼障，这是大乘和小乘的共同性，但这里所讲的是大乘，而不是小乘，因为小乘不能断所知障。</p><p>　　《摄大乘论释》所说的十无明并非杂染，只是依据十地修行所断而说。虽然在十地的修道位中也降伏烦恼，断除其粗重，但并非正意，因为不能断除随眠，所以这里不说。从道理上来讲，在初地的修道位中，也能够断除一部分与生俱来的所知障，但是现在所讲的是最初所断，以后九地所断，以此为准应当知道。第一无数劫过后，第二无数劫到来，时间相当久远，从道理上来讲，应当是进一步断除所应当断除之障，不然的话，第一无数劫、第二无数劫、第三无数劫三时之道应无区别。所以，《大乘阿毘达磨杂集论》卷十四说菩萨得到现观以后，又在十地的修道位中，只修行永远灭除所知障之道，留下烦恼障，因为他们曾经发下誓愿再次受生，以便普度众生。并不像小乘佛教的声闻、缘觉二乘人那样急于证得涅槃解脱，所以在修道位中不断烦恼障，因为要留下余习，方便度化众生。等到快要成佛的时候即可断除。</p><p>　　第二邪行障。即一部分俱生已知障及其所生起的身、口、意三业，它们障碍二地离垢地极端清净的戒律，入二地的时候就能够永远断除。所以，《瑜伽师地论》说菩萨进入二地要断除二愚及其粗重，二愚如下：㈠微细误犯愚。就是这里所说的一部分俱生所知障：㈡种种业趣愚。就是一部分俱生所知障所生起的错误的身、口、意三业。或者根据第二种解释，二愚如下：㈠唯起业愚，㈡不了业愚。</p><p>　　第三闇钝障。即俱生所知障的一部分，使所闻、所思、所修之法忘失。合钝障障碍三地发光地的殊胜禅定陀罗尼及其所引发的三种殊胜智慧，进入三地的时候就能够、永远断除。因此，三地能够断除二愚及其粗重：㈠欲贪愚。就是此中所说能够障碍禅定及其因修禅定所得的智慧。因为它过去经常与欲贪在一起，所以称为欲贪愚，现在修习这种殊胜禅定及其因修定而成就的智慧，它既然永远断除欲贪，也就同时降服了欲贪愚，因为这种欲贪自无始以来，依靠贪愚而生起；㈡圆满闻持陀罗尼愚。就是这里所说的能够障碍陀罗尼的闻慧和思慧。</p><p>　　第四微细烦恼现行障。即俱生所知障的一部分，属于与第六意识相应而起的身见等，因为它是最下品，不由作意而生，永远随顺现行，所以称为微细。此障碍四地焰慧地菩提分法，进入四地时就能够永远断除。因为它过去经常与第六意识中任运而生的我见等同时生起，所以称为烦恼，既然现在在第四地中已经得到无漏菩提分法，这种微细烦恼现行障便永远灭除，其我见等也永远不会成为现行。</p><p>　　问：为什么前三地不能断除我见等呢？</p><p>　　论主回答说：因为菩萨在前三地实行布施、持戒、修禅，这与世间众生相同，到第四地修得菩提分法，这才叫做出世，因为它能够永远灭除烦恼障和所知障中的身见等。我们怎么知道这种身见与第六意识在一起呢？因为第七识末那识执我见等，与无漏道的性质相违逆，八地以后才能使它们永远不能成为现行，七地以前还可以生起现行，因为以其余的烦恼为其依据。与第六识相应的身见等粗，与第七识相应的身见等细，降伏有前有后，这里所说的身见等只与第六识相应。这里所说的身见等，也包括无始以来所知障包含的定爱、法爱，这种定爱和法爱到三地时还在增加，到四地时才能够永远断除，菩提分法与此特别违逆。</p><p>　　所以说四地断除二愚及其粗重：㈠等至爱愚，就是这里所说的由定爱所伴随的愚；㈡法爱愚，就是这里所说的由法爱所伴随的愚。所知障包括的二愚断除以后，烦恼障的定爱、法爱愚也永远不会成为现行。</p><p>　　第五于下乘般涅槃障。就是俱生所知障的一部分，使人对生死感到厌恶，对涅槃感到欣乐，就像是小乘佛教的声闻、缘觉二乘人那样，对生死感到厌恶，对涅槃感到欣乐，这种下乘般涅槃障障碍五地极难胜地的无差别道，进入五地的时候就能够永远断除。所以说五地断除二愚及其粗重：㈠纯作意背生死愚，就是这里所说的厌恶生死：㈡纯作意向涅槃愚，就是这里所说的对于涅槃感到欣乐。</p><p>　　第六粗相现行障。即俱生所知障的一部分。由于执着若染若净的粗相现行，因为它障碍六地无染净的妙道，当契入六地时，便能永远断除。由于这种因缘，所以说入第六地的时候，就断除二种愚痴以及它具有的粗重。这里所说的二愚是：㈠现观察行流转愚。就是在这第五地中，执有实在的杂染，属于诸行流转的染分；㈡相多现行愚。就是在这第五地中，执有实在的清净者，因为妄取清净相的缘故而生欢喜，但他们不知道执有净相是有相观行，不能契入无相妙观，所以称为「相观多行」，不能常时安住于无相妙观。</p><p>　　第七细相现行障。即俱生所知障的一部分，仍然执着有生死流转「生」的细相现行，也执着涅槃还灭的细相现行。这种细相现行能够障碍第七地的妙无相道。当证入第七地的时候，便能永远断除这种细相现行障。由于这种原因，所以说在第七地中断除二种愚痴及其粗重。二愚如下：㈠细相现行愚。就是大地中执有生相，仍然执取流转生死的微细生相；㈡纯作意求无相愚。就是大地中执有灭相，还执取于还灭的微细灭相。对于纯粹的无相现行，一向注意方便勤求加行，不能于无相空理之中不加作意而起有观胜行。</p><p>　　第八无相中作加行障。即具生所知障的一部分，使无相观不能任运生起。前五地(极喜地、离垢地、发光地、焰慧地、极难胜地)有相观多无相观少，在第六地现前地有相观少无相观多，在第七地远行地中是纯粹的无相观，虽然永恒相续，但有加行。还没有任运出现金、银等相和大小土等，这种加行障障碍八地不动地中的无功用道。所以，如果进入第八地时就能够永远断除，因为永远断除了这种无相中作加行障，就得到了相自在和土自在。所以说第八地断除了二愚及其粗重。二愚如下：㈠于无相作功用愚，㈡于相自在愚。因为使菩萨在相状中不行自在，这也包括作为相一部分的土。因为八地以后，纯无漏道任运生起，所以欲、色、无色三界的烦恼永远不能成为现行。第七识当中微细的所知障还可以现起，因为生空(我空)智慧之果与此并不违逆。</p><p>　　第九利他中不欲行障。即俱生所知障的一部分，在做为有情众生带来利益和安乐的事情的时候，不想勤奋行动，只是乐于为自己谋福利。这种利他中不欲行障，障碍第九地善慧地的四无碍解，菩萨进入第九地的时候就能够永远断除。所以说九地断除二愚及其粗重：㈠于无量所说法无量名句字后后慧辩陀罗尼自在愚。对于佛无量所说教法陀罗尼自在的，是义无碍解，就是对于所诠释总持的意义自由自在的认识，因为在一种意义上能够显现一切意义。对于无数名身、句身、文身所表达陀罗尼自在的，是法无碍解，就是对起能诠作用的总持陀罗尼自在，因为在一个名身、句身、文身当中能够显现一切名身、句身、文身。对于连续不断的智慧进行辩说的陀罗尼自在者，是词无碍解，就是对于言说声音展转训释总持自在，因为在一个声音当中能够显现一切声音。㈡辩才自在愚。辩才自在就是辩无碍解，因为善于利用时机，巧妙地为众生说法。愚昧能够障碍这四种自在，都是属于这里所说的第九障。</p><p>　　第十于诸法中未得自在障。即俱生所知障的一部分，使人对各种事物不能自由自在。这种于诸法中未得自在障能够障碍十地法云地的大法智云及其所含藏的陀罗尼、三摩地等各种功德，还有大法智云所生起的各种伟大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。菩萨进入第十地法云地的时候就能够永远断除。所以说十地断除二愚及其粗重：㈠大神通愚。就是这里所说的障碍大法智云所生起的神通；㈡悟入微细秘密愚。就是这里所说的障碍大法智云所含藏的三摩地、陀罗尼功德。虽然十地对于各种事物已能自由自在的掌握，但还有其他障碍，所以还不能称为圆满成就，意思是说，还有俱生而来的微弱所知障和任运而起的烦恼障种子。金刚喻定出现在面前的时候，它们就能够马上断除，进入如来地。所以说佛地断除二愚及其粗重：㈠于一切所知境极微细着愚就是这里所说的微弱所知障；㈡极微细碍愚，就是这里所说的一切任运而起的烦恼障种子。所以《大乘阿毘达磨杂集论》卷十四说：得到菩提的时候，马上断除烦恼障和所知障，成阿罗汉并成佛，因为已经证得大涅槃和大菩提。\t\t\t\t</p></div>"
},{
    "title": "成唯识论卷第十",
    "author": "未知",
    "date": "2015-01-19",
    "html": "<div class=\"B1_text\"><p>　　<strong>成唯识论卷第十</strong></p><p>　　这十一障包括在烦恼、所知二障当中。烦恼障中见道所断种子在初地极喜地的见道是最初所断，烦恼障的现行在初地以前已经降伏。修道所断的种子，当金刚喻定出现在面前的时候，所有的一切马上断除。烦恼障的现行在初地以前逐渐降伏，初地以后的菩萨能够马上把它降伏干净，使之永远不能成为现行，这就像阿罗汉那样。虽然前七地中故意使之暂时成为现行，但是已能不会因烦恼而成过失。八地以后才终究使它不成现行。所知障中见道所断的种子，在一地极喜地的见道位是最初所断，所知障的现行在地前就已经降伏。</p><p>　　修道所断的种子在十地中逐渐断灭，金刚喻定出现在面前的时候，才能够永远断除干净，所知障的现行在地前逐渐降伏，到十地的时候才永远降伏干净。八地以后，与六识俱起的障碍不再成为现行，因为相续不断的无漏心和果能够相续不断地对它起违抗作用。与第七识末那识俱起的障碍还可以成为现行，到法空智慧之果生起的时候才能够降伏。如果前五转识还没有证得转依，因为受到无漏智的降伏，所以二障不能成为现行。虽然在修道位的十地中，都不能断灭烦恼障种子，但已将其粗重逐渐断灭，所以《瑜伽师地论》卷四十八说二障粗重的每一种都具有三位断的意思。虽然各个阶位都断粗重，但有三位很明显，所以这里要特别说明。</p><p>　　断除二障种子的渐断、顿断情况如何呢？与第七识末那识俱起的烦恼障种子，当三乘人将要得到无学果的时候，一刹那间在三界马上断除。所知障的种子到将要成佛的时候，一刹那间所有的一切马上断除，因为这种种子任运而起，唯缘内境，境无粗细。与其余六识俱起的烦恼种子，在见道位所断灭的，三乘人在见道位的真见道中，所有的一切马上断除。在修道位所断除的，随其所应，有一类渐次得果的钝根二乘人在三界九地当中，七生中分为九品，一个接一个逐渐分别断除。第二类利根二乘人，在三界九地合在一起，一生中按九品分别断除。如果菩萨要生起金刚喻定，一刹那间在三界马上断除。所知障的种子，进入初地极喜地的最初之心，马上断除一切见道所断的种子。修道位所断的种子，在以后十地的修道位中逐渐断除，直至正确生起金刚喻定的时候，在一刹那间才能够断除干净。因为通缘身内、身外之境，粗境细境皆生，因为品类差别很多。</p><p>　　二乘人根机迟钝，逐渐断除障碍的时候，必然各别生起无间道、解脱道、加行道、胜进道，或分别生起，或总的生起。菩萨利根在逐渐断除障碍的时候，没必要分别生起无间道和解脱道，因为能够一刹那一刹那地断障<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>，所以加行等四道，一刹那一刹那地前后相望，每一道都容许具有其余三道。</p><p>　　十真如是：一遍行真如。因为这种真如由我、法二空所显，没有任何一种事物不存在于这种真如之中；二最胜真如。因为这种真如具有无边功德，在一切事物当中它最为殊胜；三胜流真如。因为这种真如所流行的教法，对于其他教法来说，极端殊胜；四无摄受真如。因为这种真如没有任何系属，并不是我执等的所依和所取；五类无别真如。因为这种真如使生死和涅槃没有区别，并不像眼等那样各各有异；六无染净真如。因为这种真如本来的性质就是无染，也不能说后来才变得清净；七法无别真如。因为这种真如虽然有很多种教法而作种种安立，但它们之间是没有差别的；八不增减真如。因为这种真如没有增减执着，染法减时没有减，净法增时没有增。又称为相土自在所依真如，因为证得这种真如以后，现相现土都得自在；九智自在所依真如。因为证得这种真如以后，对于无碍解即得自在：十业自在等所依真如。证得这种真如以后，对于一切神通、身口意三业、陀罗尼、三摩地都得自在。</p><p>　　虽然真如的性质实际上是没有区别的，但随顺其殊胜功德，虚假成立十种。虽然菩萨在第一地就已经理解十真如，但其证行还没圆满，为了使之圆满，逐一建立十真如。</p><p>　　菩萨在十地中就是这样地勇猛修习十种胜行，断除十种障，证得十真如，这样就能够证得二种转依。</p><p>　　转依之位简略来说有六种：一损力益能转。即最初二位，由于修习胜解和惭、愧，损坏阿赖耶识中的染污种子势力，有益于阿赖耶识中的清净种子功能，虽然还没有断灭二障种子，但实际上已经证得转依，因为它逐渐降伏了二障现行，所以也称为转依。</p><p>　　二通达转。即通达位，由见道之力通达真如，断除分别产生的二障粗重，证得一部分真实的转依。</p><p>　　三修习转。即修习位，因为一再地修习十地之行，逐渐断除俱生而有的二障粗重，逐渐证得真实的转依。《摄大乘论》说通达转在前六地，在此六地中，以有相观、无相观，通达真、俗间杂现前，即以有相观通俗，无相观达真，当真实义相显现的时候，非真实义相就不显现。《瑜伽师地论》卷四十八等说修习转在后四地，纯粹的无相观长时出现，经过勇猛修行，断除其他粗重，使不真实的义相不再显现。</p><p>　　四果圆满转。即究竟位，经过三大无数劫，修习无边无际的难行和胜行，当金刚喻定出现在面前的时候，永远断灭本来具有的一切粗重，顿时证得佛果，证得圆满转依，永远具有无穷无尽利益和安乐。</p><p>　　五下劣转。即二乘人只求自利，厌恶生死，欣乐涅槃，只能得到生空真如，断除烦恼障的种子，证得真择灭，无殊胜功能，不能有所堪任，所以称为下劣转。</p><p>　　六广大转。即大乘位，为了给他人带来利益而趣向大菩提，对于生死和涅槃都没有欣乐和厌恶情感，具有通达二空真如的能力，断灭了所知障和烦恼障的种子，马上证得至高无上的菩提和涅槃，有殊胜功能，有所堪任，所以称为广大转。这里的意思是说：广大转依舍除了二障种子，证得了至高无上的菩提和涅槃。</p><p>　　转依的意思简略来说有四种：一能转道，这又分为二种：㈠能伏道。即降伏二障的随眠势力，使之不能引起二障现行，它通有漏、无漏二道和加行、根本、后得三智，随其所应逐渐或马上降伏二障随眠势力；㈡能断道。即能永远断除二障随眠，能断道肯定不是有漏加行，因为有漏心加行智和有漏后得智，前者是曾习道，后者是相执之所引的，未能泯伏灭除此相，所以不能断惑。无分别智是加行所引，真如是加行所趣求证，即由所引无分别智能证所证真如。</p><p>　　有人认为：根本无分别智直接证得二空所显现的真理，因无外境相分，所以能够断除随眠，后得智不是这样，所以不是断道。</p><p>　　又有人认为：后得无分别智虽然不直接证得二空真理，没有能力断障迷理随眠，但能够明确认识安立非安立相，因为没有颠倒认识，所以也能够永远断除迷事随眠。所以《瑜伽师地论》卷五十五说：在修道位有出世断道和世出世断道，没有纯粹的世间道能够永远断除随眠，因为世间道是曾经修习过的，是由相执所引生的。由此道理可见，各种见道所断和修道所断迷理随眠，只有根本无分别智，因为它直接证得二空真理，所以能够正确断除这种随眠，剩余的修道所断迷事随眠，根本智和后得智都能够正确断除。</p><p>　　二所转依。这又分为二种：㈠持种依。即阿赖耶识，因为它能够维持染、净事物的种子，是染、净事物的所依，圣道转能够使它舍除染污种子，得到清净种子。其余的依他起性虽然也是依，但不能维持种子，所以这里不说；㈡迷悟依。即真如，因为它能作迷和悟的根本，各种染法和净法都依之而生。圣道转能够使它舍除染法，得到净法。其余的依他起性虽然也作迷法和悟法的所依，但并不是根本，所以这里不说。</p><p>　　三所转舍。这又分为二种：㈠所断舍。即二障种子，真正的无间道出现在面前的时候，障碍和对治互相违逆，二障种子就断灭了，永远不再成就，所以称为舍。因为这种二障种子断灭了，不再成为现行虚妄执着我和法。所执实我实法本来是对妄情而说，现在妄情已断，不可能再对妄情发生作用了，所以应当随之而舍。所以，这叫做舍除遍计所执。㈡所弃舍。即有漏种子和弱劣的无漏种子，当金刚喻定出现在面前的时候，引生极其圆满光明纯粹清净的阿赖耶识，它不是这种种子的所依，所以要全部永远丢弃舍除。这种种子舍除以后，有漏法种子和弱劣的无漏种终究不能再生。既然永远不能再生，《杂集论》卷十四把这也称为舍。由此道理名舍生死法及劣法。</p><p>　　有人认为：所剩余的有漏法种子和劣无漏，在金刚喻定出现在面前的时候，都已经丢弃舍除，因为它们与二障种子同时舍除。</p><p>　　二师认为：那时候还没有舍除，因为它们与无间道不相违逆，菩萨应当是没有生死之法，因为此位应当是没有所熏之识，住于无间道应当称为佛，以后的解脱道应当是没有作用了。由此应当知道，剩余的有漏等，当解脱道生起的时候，才能够丢弃舍除，因为解脱道位的第八净识，已经不是那种种子的所依。</p><p>　　四所转得。这又分为二种：一所显得。即大涅槃，其本来自性虽然清净，但由于外在障碍覆盖，使之不显，真正圣道产生以后，断除那种障碍，使涅槃之相显现，这就叫做得到了涅槃。因为它依据真如，离开障碍施设，本体就是清净法界。</p><p>　　涅槃的不同意义简略来说有四种：㈠本来自性清净涅槃。即一切法相的真如之理，虽然外部染污，但本性清净，具有无数无量的微妙功德，无生无灭，静谧如虚空，一切有情众生都具有，与一切事物既不相同，又不相异，没有任何形相，不可识别。既不可想，又不可说，只能由圣人在内心证得，因其性质静寂，所以称为涅槃。</p><p>　　㈡有余依涅槃。即真如出离烦恼障，虽然还有微弱之苦所依而未灭除，但因障碍永远寂灭，所以称为涅槃。</p><p>　　㈢无余依涅槃。即真如出离生死之苦，烦恼既然已经灭尽，剩余的所依也已经灭除，因为各种苦都已经永远寂灭，所以称为涅槃。</p><p>　　㈣无住处涅槃。即真如出离所知障，常由大悲和般若所辅翼，因此不住于生死，也不住于涅槃，永远给有情众生带来利益和安乐，缘此虽起悲、智二用，但体性恒寂，所以称为涅槃。</p><p>　　一切有情众生都有第一种涅槃，二乘无学容许有前三种涅槃，只有我们的世尊具有四种涅槃。</p><p>　　为什么说如来有余依呢？虽无真实苦依未尽的有余涅槃，然而现为苦谛等，好似有余涅槃。或者说苦依已尽而称为无余依，因为苦依身还在，所以说为有余依，所以佛世尊可以说具有四种涅槃。</p><p>　　如果声闻等有无余依，为什么《胜鬘经》等处说没有呢？有的地方说二乘人什么涅槃都没有，这岂不是说有余依他们也没有吗？然而，声闻、缘觉二乘人，当他们的身体和智慧还存在的时候，仍然有所知障，其苦依还未灭尽，圆寂的意思隐而不显，所以说没有涅槃，并不是说二乘圣者真的没有烦恼障断尽以后所显真理之有余涅槃。这时候还没有证得无余依涅槃，所以也说他没有无余依涅槃，并不是后来灭除身体和思想以后，没有苦依灭尽的无余依涅槃。或者，《胜鬘经》所说的二乘人没涅槃，是说他们没有无住处涅槃，并不是说他们没有前三种涅槃。</p><p>　　而且，这里所说的没有无余依涅槃是依不定性二乘人所说，他们才证得有余依涅槃，下决心求得无上正等觉，由于禅定与誓愿之力，使其身体长久留住于人世，并不像入无余依涅槃的那种人一样。意谓有的二乘人深深地乐于涅槃，得到我空观，直接证得真如，把感生的烦恼障永远灭除干净，显现依真理而得有余依涅槃。因为他们能够把感生的烦恼灭除干净，所以以后的异熟果报没有理由再产生，现在的苦所依任运灭除之位，其余的有为法既然已经没有所依，与其苦依同时马上舍除，显示依真理的无余依涅槃。这时候虽然没有二乘人的身体和思虑，但由他们证得此灭，所以说二乘人有无余依。这时候只有清净真如，清澈澈的没有外部形相，寂灭安乐，依据这种情况说他们与佛没有区别。但由于没有菩提为他人带来利益和安乐，所以又说他们与佛有区别。</p><p>　　外人问：既然各种所知障不能够发业润生，怎么说断除它们而得无住处涅槃呢？</p><p>　　论主回答说：所知障能够遮蔽法空真如，使之不能产生大悲和般若，不能永远为有情众生带来利益和安乐，所以断除它们的时候就能够显现法空真理，这种真理就是无住处涅槃，使之不住于断、常二种边见。</p><p>　　外人又问：如果所知障也障碍涅槃，为什么断除它们得不到择灭无为呢？</p><p>　　论主回答说：择灭无为是离烦恼障的系缚，但所知障并不像烦恼障那样系缚众生</p><p>　　外人又问：既然是这样，断除系缚怎么能够得到涅槃呢？</p><p>　　论主回答说：并不是所有的涅槃都属于择灭，不然的话，本来自性清净涅槃应当不算涅槃。如果能够系缚有情众生，使之不住于生死，断除它们就可以说是得到择灭无为。各种所知障不招感生死，并不像烦恼障那样能够系缚有情众生，所以断除它们的时候得下到择灭。但断除它们，就使法空真理显现，法空真理之相静寂，这被说成是涅槃，但这种涅槃并不以择灭为其本性，所以四种涅槃在各种无为法中，第一和第四是真如，中间的二种属于择灭。</p><p>　　外人又问：如果只是断除系缚便得择灭，不动无为和想受灭无为在四种无为法中属于哪一种呢？</p><p>　　论主回答说：并不属于择灭无为，因为《显扬圣教论》卷十八说这二种无为法是暂时离缚。</p><p>　　外人又问：为什么说非择灭无为是离缚呢？</p><p>　　论主回答说：因为择灭无为只是究竟灭，非择灭无为法并不是永远灭除随眠。或者说无住处涅槃也属于择灭，因为它是由真正的简择力灭除障碍所得。择灭无为有二种：㈠灭缚得。即断除感生烦恼所得的择灭：㈡灭障得。即断除其余所知障所得的择灭。所以四种涅槃在各种无为法中，第一是真如，以后的三种都是择灭无为。不动无为和想受灭无为是暂时伏灭，并下属于择灭无为，究竟灭除的才属于择灭。</p><p>　　外人又问说：既然所知障也障碍涅槃，为什么只说它是菩提障呢？</p><p>　　论主回答说：如果说烦恼障只障碍涅槃，这岂不是说它不能为菩提障吗？应当知道，诸圣教中依殊胜作用而说，从道理上来讲，实际上都能障碍涅槃和菩提二果。这样说来，在四种涅槃当中，只有后三种称为所显得。</p><p>　　二所生得。即大菩提，它虽然本来具有能生的种子，但由于所知障的障碍，使之不生。由于圣道力断除所知障，使之从种子生起，这就叫做得到了菩提。生起以后，相续不断，直至无穷无尽的未来际，这就是四智的相应心品。</p><p>　　四智的相应心品是怎样的呢？㈠大圆镜智相应心品。意谓这种心品没有各种虚妄分别，所缘行相微细难知，对一切境相不忘失不迷闇，性相俱得清净，没有各种杂染，纯净圆满具足一切德相，是现行功德所依，种子功德之持，能现无量身，现无量土，乃至其余的三智之境皆悉影现。从无间断，直至无穷无尽的未来际，就像大圆镜那样，影现各种色像。</p><p>　　㈡平等性智相应心品。意谓这种心品观察一切事物及自己、其他一切有情众生，都是平等的，永远与大慈大悲相应，随顺各种有情众生的所乐，示现有差别的受用身土影像，与妙观察智是不共所依，悲智由无住涅槃所建立，永无转易，相续而不间断，直至无穷无尽的未来际。</p><p>　　㈢妙观察智相应心品。意谓这种心品善于观察各种事物的自相和共相，发挥作用时没有阻碍，摄藏并观察无数无量的陀罗尼、三摩地及其产生的功德珍宝，在大众集会的时候能现无边的神通作用，一一皆得自在，普降伟大的佛法之雨，断除一切疑惑，使各个有情众生都得到利益和安乐。</p><p>　　㈣成所作智相应心品。意谓这种心品为了给各个有情众生带来利益和安乐，在十方示现各种变化，以三业实现自己的誓愿，成就一切应当作的事情。</p><p>　　像这样的四智相应心品，虽然各自肯定具有二十二法，有能变的种子和所变的现行，但智的作用增盛，所以以智命名。所以这四智相应心品，把佛的一切有为功德都摄藏在内。四智如次转有漏第八、七、六和前五识而得。智虽然不是识，但依识而转变，因为以识为主，所以说智是转化识而得。而且，在有漏位智弱劣，识强盛；在无漏位智强盛，识弱劣。为了劝导有情众生依智而舍除识，所以说转八识而得这四智。</p><p>　　大圆镜相应心品，有人认为：菩萨在金刚喻定出现在面前的时候，是最初现起，因为阿赖耶识的种于和极微细的所知障种子同时舍除，如果大圆镜智这时候没有生起，就没有能力保持清净种子识。又有人认为：因为在解脱道的时候是最初成佛，所以大圆镜智相应心品这时候才最初生起，阿赖耶识种子在金刚喻定出现在面前的时候，还没有马上舍除，因为它们与无间道不相违逆。因为它不障碍有漏法和弱劣的无漏法，但与佛果肯定相违逆，金刚喻定没有所熏识，无漏不增长就应当成佛，所以大圆镜智相应心品从最初成佛的时候开始，直至无穷无尽的未来际，相续而不间断，因为它保持无漏种子，使之不至于丧失。</p><p>　　平等性智相应心品，因为菩萨在见道最初现前的时候，与我、法二执相违逆，这时候才最初生起，因为在以后的十地中，二执未断，在有漏等位或许有间断，法云地以后，与清净的第八识相依相续，直至无穷无尽的未来际。</p><p>　　妙观察智相应心品的我空观品，在二乘的见道位也可以最初生起，以后展转一直到无学位，或渐悟至菩萨的解行地终，或是顿悟菩萨至十地的上位，如果不是有漏或无心的时候，都容许现起。法空观品在菩萨的见道位才能够最初生起，从此以后展转乃至菩萨的十地位，如果不是有漏，在生空智果或无心的时候，都容许现起。</p><p>　　成所作智相应心品，有人认为：在菩萨的修道位中，由于后得智的牵引，也可以使之最初生起。又有人认为：到成佛的时候才能够使之最初生起，因为在十地中，依阿赖耶识所变眼等五根并非无漏，有漏五根只与有漏五识为不共俱有所依，即同境依根。根发无漏识，这在道理上是讲不通的，要知此有漏根识与无漏根识二者，对于所缘境，是明昧不同的。所以此智相应心品要到成佛的时候，依无漏根才能容许生起，一再间断，是由于作意生起。</p><p>　　这四种性虽然都是本来具有，但要经过熏发才能变成现行，因位逐渐增加，使佛果圆满成就，不增不减直至无穷无尽的未来际，只是从种子产生，不再熏习成为种子，因为不能说以前的佛德优胜于以后的佛。</p><p>　　大圆镜智相应心品，有人认为：只缘真如为境，是无分别智，但并不是后得智，因为行相所缘是不可知的。又有人认为：大圆镜智相应心品缘一切事物，因为《大乘庄严经论》说大圆镜智对于一切外境都不愚昧不迷惑，《佛地经》说如来大圆镜智对于各处、各境、各识之像都可显现，又因此品肯定缘取无漏种子和身土等各种影像，因为行相和所缘微细，所以说是不可知的，如阿赖耶识也缘世俗界各种事物。因为它缘取真如，所以是无分别智，又因为它缘取其他外境，所以属于后得智。其本体是一个，随顺作用分为二个，了解世俗是由于证得真如，所以称为后得智。其余的平等性智和妙观察智，也是一体分二，以此为准应当知道。</p><p>　　平等性智相应心品，有人认为：只缘第八净识，就像是染污的第七识缘取阿赖耶识一样。又有人认为：平等性智只缘真如为境，因为它是缘一切事物平等性的。又有人认为：平等性智遍缘真俗为境，因为《佛地经》说平等性智证得十种平等性，《大乘庄严经论》说缘取各有情众生的自他平等，随顺他人的胜解力，示现无边无际佛的影像。所以平等性智相应心品通真、俗二智所包含的，在道理上不相违逆。</p><p>　　妙观察智相应心品，缘取一切事物的自相和共相，都没有障碍，由根本智和后得智所含摄。</p><p>　　成所作智相应心品，有人认为：只缘取五现境，因为《大乘庄严经论》说如来的五根一一都于五境发挥作用。又有人认为：成所作智相应心品也能够普遍缘取过去、现在、未来三世的各种事物，与正确的道理不相违逆。《佛地经》说成所作智生起三业的各种变化，决择所化众生的心行差别，领受过去、未来、现在等义。如果不是遍缘的话，就没有这种功能。然而这种心品随其意乐力，或者缘取一法，或二种，或多种，暂且说五根于五境转，并不说只是如此，所以并无矛盾。因为随其作意而生，缘取事相外境，生起各种作业，这属于后得智。</p><p>　　这四心品虽然都能够普遍缘取一切事物，但其作用是有区别的，即大圆镜智相应心品现自受用身及其<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>相，保持无漏种子：平等性智相应心品现他受用身及其净土相：成所作智相应心品，能现变化身及其净土相：妙观察智相应心品，观察自己和他人的功能过失，普降伟大的佛法之雨，破除各种疑网，给有情众生带来利益和安乐。像这样的门类有多种差别。</p><p>　　这四智相应心品称为所生得，总的称为菩提，前述涅槃称为所转得。虽然转依的意思总共有四种，但是现在只取二种所转得，因为《唯识三十颂》说“便证得转依”。这种修习位被说成能证得，并不是已经证得，因为属于因位。</p><p>　　第五究竟位，其相如何呢？</p><p>　　《唯识三十颂》说：“这就是无漏界，是不可思议的，善的，永恒的，安乐的。这就是解脱身，是称为大牟尼的最高存在。”</p><p>　　论说：以前的修习位所得到的转依，应当知道，这就是究竟位的相状。这就是前述涅槃、菩提二转依果，属于究竟无漏界。各种有漏已经断尽，不像取蕴那样，使有漏随之增长。其性清净、圆满、光明，所以称为无漏。“界”是“藏”的意思，因为此中含有无边无际希有的伟大功德。或者是“因”的意思，因为能够产生五乘世间、出世间的利益和安乐。</p><p>　　小乘佛教难问说：清净法界可以说只属于无漏，四智相应心品怎么能只是无漏呢？</p><p>　　论主回答说：因为属于道谛，所以只是无漏，意谓佛的功德及身土都是无漏性所生，因为有漏法种子已经永远舍除，虽然有的示现为生死之身，业、烦恼等好像是苦谛和集谛，但实际上是无漏，属于道谛。</p><p>　　外人问：《大乘阿毗达磨集论》等说十五界等只是有漏，如来怎能没有五根、五识、五外境等呢？</p><p>　　一师回答说：如来的功德身土非常深奥微妙，不是有，也不是无，没有各种分别，没有各种戏论，并不属于界、处等，所以与你们说的道理不相违逆。</p><p>　　二师认为：因为如来的五根和五境是奇妙的禅定所生，所以属于法界的色蕴，并不是佛的五识，虽然依此佛所变变为佛的身土，但粗细不同，并不属于五境。如来的五识并不是五识界，因为《解深密经》说佛心永远在禅定，《大乘阿毗达磨杂集论》卷一说五识的性质是散乱的。</p><p>　　外人问：成所作智与什么识相应呢？</p><p>　　论主回答说：与第六识相应，因为它产生化身及其很多种作用。</p><p>　　外人又问：与妙观察智的性质有什么区别呢？</p><p>　　论主回答说：妙观察智观察各种事物的自相、共相等，成所作智只能生起化身，所以说是有区别的。</p><p>　　外人诘难说：成所作智相应心品和妙观察智相应心品不能同时而生，因为一类智品二识不能同时生起。</p><p>　　论主回答说：说二识不能同时生起，这对于道理来说不相违逆，同一识体，作用分为二种，说二智相应心品同时而生，这也没有过失。或者说与七识的净识相应，依眼根等绿色等外境，是平等性智的不同作用，即第七净识生起他受用身上之相，属于平等性智相应心品，生起化身的，属于成所作智相应心品。</p><p>　　外人问：不是说成所作智相应心品是转前五识而得吗？</p><p>　　论主回答说：不能说转化它所所得的本体就是它，例如说转化生死而得涅槃，不能说涅槃与生死相同，所以不应当就此对我的理论进行诘难。</p><p>　　有人认为：如来的功德身土，如果应当包含在蕴、处、界中，这三种都通有漏和无漏。《大乘阿毗达磨集论》等说的十五界等只是有漏，这是依二乘人的浅识智之粗境体而说，并不是说一切凡圣有情的十五界等都是有漏。在十八界当中，只有后三种属于无漏。成佛以后，虽然所有的一切都是无漏，但不属于二乘所知外境。然而，《大般若经》等所说的佛的功德等并不是界等，不同于二乘人劣智所知界等外相，所以从道理上来讲必定应当是这样。为什么呢？因为《解深密经》说有为法都属于蕴，又说一切事物都属于界和处，十九界等，佛都与以否定，如果不是戏论，就不会是界等，也不应当说是无漏界，也不应说是善、常、安乐和解脱身等。《大般涅槃经》等又说转化无常蕴而得常蕴，界、处也是这样，怎能说如来不是蕴、处、界呢？说他不是蕴、处、界，是依密意而说。又说五识的性质散乱，说其余的成就并不是佛所成就。所以在<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>之中，十八界等都充足具有，但纯粹是无漏。</p><p>　　这种转依果又是不可思议的，因为它超越思虑和言说之道，其智十分微妙，性相甚深，所缘境只能由自己内心证得，不能以世间事物进行比喻。这种转依果又是善的，因其性质属于白法，因为清净法界远离生灭，极其安稳，四智相应心品的奇妙作用无法比拟，非常巧便，对有为法和无为法都有顺益之相，与不善法相违逆，所以都说为善。</p><p>　　外人问：《大乘阿毗达磨杂集论》卷四说有八处只是无记性，如来怎能没有眼、耳、鼻、舌、身五根和香、味、触三境呢？</p><p>　　论主回答说：关于这个问题有三种解释，详细解释如前所说。一切如来的身土等都属于灭谛和道谛，所以只是善性，因为圣人说灭谛和道谛只是善性，又说佛土等不是苦谛和集谛，佛识所变有漏的不善、无记相等，都是从无漏善性种子所生，属于无漏善性。它们又是永恒的，因为没有灭尽之期限，清净法界没有生，也没有灭，其性质没有变易，所以说是永恒的。</p><p>　　四智相应心品的所依是永恒的，因为不可断除灭尽，所以也说是永恒的。并不是说自性是永恒的，因为是从因而生，所产生的东西终归要灭亡，经中一向是这样说的，没见过色法、心法不是无常的，但是四智相应心品，由于佛的本愿力，教化有情众生是没有尽期的，直至无穷无尽的未来际，不能断除，没有尽头。它们又是安乐的，因为没有逼迫恼害，清净法界的众多相状寂静，所以称为安乐。四智相应心品永远没有烦恼迫害，所以称为安乐。菩提和涅槃二种的自性都没有逼迫和烦恼，又能给一切有情众生带来安乐，所以二种转依果都称为安乐。</p><p>　　二乘人所得的二种转依果，只是永远没有烦恼障的系缚，没有殊胜之法，所以只称为解脱身。得到大觉悟的世尊成就至高无上的涅槃法，所以称为伟大的牟尼。牟尼世尊所得到的二种转依果真，永远没有烦恼障和所知障。又称为法身，因为以无量无边的十力、四无畏等伟大的功德法所装饰。其体依据聚集之义总的称为身，所以说法身以清净法界和四智相应心品五法为其属性，并不是只有清净法界称为法身，因为二种转依果部属于法身。</p><p>　　像这样的法身有三相之别：一自性身。就是诸如来真如的清净法界，受用身和变化身平等所依，没有外部形相，不可思虑，不可言说，具有无边无际真实永恒的功德，是一切事物的平等真实性质。这种自性身也称为法身，因为它受伟大功德法所依。</p><p>　　二受用身。又分为二种：㈠自受用。意谓诸如来在三无数劫修集无量的福德智慧资粮，所生起的无边无际的真实功德，以及极其圆满清净永恒普遍存在的色身，相绩不断，深远清净，直至无穷无尽的未来际，永远亲自享受广大法乐：㈡他受用。意谓诸如来由平等性智示现的微妙清净功德，居住于纯净之土，为居住于十地的诸菩萨显现伟大的神通力，转动正法之轮，决断各种疑网，使菩萨们享用大乘佛法之法乐。自受用和他受用合在一起，就称为受用身。</p><p>　　三变化身。意谓诸如来由成所作智变现为无量的随类化身，居住于净土和秽土，根据地前菩萨、二乘人、俗人的根机和时宜，现身说法，使他们各自获得利益和安乐。</p><p>　　关于以真如和四智相应心品五法摄持三身的问题，有人认为：最初的真如和大圆镜智持自性身，因为《佛地经》说真如是法身，《摄大乘论》说转去阿赖耶识而得自性身，又因为大圆镜智相应心品是转去阿赖耶识而获得的。中间的二智相应心品摄持受用身，因为《大乘庄严经论》说平等性智是佛在纯净土为诸菩萨显现的佛身，又说妙观察智使佛在大集会中说法，断除疑问，表现得自由自在，《摄大乘论》说转化各种转识而得受用身。最后的一种成所作智相应心品摄持变化身，因为《佛地经论》等说成所作智在十方土表现出无量的各种各样不可思议的变化。《摄大乘论》说实智殊胜，都摄持三身，因此知道三身都有实智。</p><p>　　又有人认为：真如摄持自性身，因为《大乘庄严经论》说自性身的本性是永恒的，《佛地经论》等说佛的法身是下生下灭的，《金刚般若论》说自性身是证因而得，但下是由因而生。《佛地经论》等又说法身是诸佛都有的，普遍存在于一切事物当中，就像虚空一样，没有外部形相，无因缘造作，并不是色法和心法。有人问：如果大圆镜智真的不摄持自性身，前师为什么引《摄论》说转去藏识而得自性身呢？现在回答说：然而《摄论》所说转去藏识而得法身，是由转灭第八识中的二障粗重而显法身。又有人问道：前师为什么引《摄论》说于智殊胜中具有法身呢？现在回答说：应当知道，《摄论》所说的于智殊胜中具有法身，是因为法身是彼四智心品之所依止的，也就是说法身是彼四智的实性。为什么大圆镜智不能摄持自性身呢？因为自性身虽然具有真实无边的功德，然而由于它是无为法，不可说为大圆镜智是色、心等物。</p><p>　　四智相应心品当中的真实功德，大圆镜智所生起的，经常普遍存在于色身，摄持自受用身。平等性智所显现的佛身，摄持他受用身。成所作智所显现的随类种种身相，摄持变化身。《大乘庄严经论》说大圆镜智是受用身，因为《摄大乘论》说转化各种转识而得受用。虽然转化阿赖耶识也可以得到受用，是因为转去各种转识而得法身，关于得受用身的问题，这里略去下说。又说法身不生灭，只是证因而得，并不是色法、心法等，大圆镜智相应心品与此相违逆。如果不是受用身，属于哪一身呢？而且，受用身摄持佛特有的真实的有为功德，所以四智相应心品真实存在的色法、心法部属于受用身。</p><p>　　又，他受用身和变化身都是为了教化他人而示现的权巧方便，所以不能说实智为其本体。虽然《摄大乘论》说化身摄持殊胜智慧，但好像是智慧在显现，或说智慧所生起，虚假地称为智慧，但其本体实际上并不是智慧。佛教经典只说平等性智和成所作智能够显现受用身和三业化身，不说二身就是二智，所以这二智属于自受用身。然而变化身和他受用身虽然没有真实的心法和心所法，但有化身的心法和心所法，获得无上正等觉的佛，其神力不可思议，所以能够化身为没有外部形相和物质的东西。如果不是这样的话，为什么如来表现出贪、嗔等呢？因为他早已经断除了。为什么声闻、傍生等知道如来的心呢？因为如来的实心等觉悟，菩萨们还是不知道的。所以《大般涅槃经》说教化无量众生，都使之有心理觉悟。《佛地经》说如来的成所作智化作三业。《解深密经》又说变化身有依他之心，因为有依他实心相分在显现。虽然《解深密经》说变化不依靠根、心等，是依据其余的有情众生而说，并不是依据如来而说。而且，变化色恨、心法、心所法，没有根等的作用，所以不说有。</p><p>　　像这样的三身，虽然都具有充足的无边无际的功德，但各有不同。即自性身只有真实的常、乐、我、净，没有各种杂染，是各种善法的所依，具有无为功德，没有色法、心法的差别之相和作用，自受用身具有无量奇妙的色法、心法等的真实功德。至于他受用身和变化身，只具有无边无际的有相功德，这些功德似乎是色法、心法等，是为了给有情众生带来利益和安乐。</p><p>　　又，自性身属于自利，因为它寂静安乐，没有动作。还可以利他，因为是增上缘，能给各个有情众生带来利益和安乐。又被受用身和变化身所依止，所以既利己，又利他。自受用身只属于自利，至于他受用身和变化身只属于利他，因为是为有情众生显现。</p><p>　　又，自性身是依法性土而住，虽然这种身土之体没有差别，但一属于佛，一属于法，相性是有差别的。这种佛身和法性土都不是色法，虽然不可说它们的形量是小是大，但随顺诸<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>相，其量是广大无边的，就像虚空一样普遍存在于一切处所。而且，如来的自受用身还是依于自受用上而住，这种受用土是依大圆镜智相应无垢净识所变现的。这是由于在因地中，于三大阿僧祇劫的长时间中，所修自利无漏的十胜行为纯净佛土的缘故，所以到了因缘成熟，从最初成佛的时候起至直未来际，和大圆镜智相应的净识，总是连续不断地变为纯洁清净的佛土，其土周围无边无际，各种宝物之所庄严，所以自受用身也就常时依此而住。如净土量之大，身量也这么大，身上诸根所具有的三十二相和八十种好，一一皆是无边无际的，因为这是无限善根所引生的。其功德智慧既然也不属于色法，当然不能说它的形量大小。尽管如此，然而依于所证及所依自性身是遍一切处的。</p><p>　　他受用身也依自土，即平等性智的大慈悲力，由于过去所修利他的纯净佛土，其因缘成熟，随顺住于十地菩萨的机宜，变为净土，或小或大，或弱劣或殊胜，前后变化，他受用身依之而住，能依的身量也没有一定的限制。至于变化身依止变化土的问题，意谓通过成所作智的大慈悲力，由于过去所修利他无漏，所化土中有净有秽，其因缘成熟。随顺地前菩萨等有情的机宜，化为佛土，或清净或污秽，或小或大，前后不同。佛的变化身依之而住，能依身体之量也没有一定的限度。</p><p>　　自性身和土，一切如来共同所证，其本体没有差别。自受用身及其所依之上，虽然一切佛各变不同，但都是无边无际的，皆不相互障碍。其余的二身及土，随顺诸如来所教化的有情众生，有的依靠几个佛，有的只依靠一个佛。依靠几个佛的，即同一处所及同一时间诸佛各变为身和上，形状相似，不相障碍，展转相杂，是增上缘。使所化生的，是自己的识变现的，意谓在一土有一佛身，为了现神通说法而饶益众生。只依靠一个佛的，是唯一的佛变。各有情类自无始以来，其种性是本来具有的，更相互系属，或多个属于一个，或一个属于多个。所以，所教化的有情众生，有的是共同的，有的是不共同的。不然的话，很多佛长久地居住于世间，所作的各种事情实际上是没有用途的，因为一个佛能够给一切有情众生带来好处。</p><p>　　这些佛身和土，不管是纯净的，也不管是污秽的，只要是无漏识上所变现的，和能变识一起，都是善的，都是无漏的，因为它们是纯净善的无漏因缘所生，属于道谛，而下属于苦谛和集谛。蕴等的识相肯定都不相同，因为蕴、处、界三法因缘，混杂引生。从有漏识上所变现的，和能变识一样，都是有漏，纯粹是从有漏因缘所生，属于苦谛和集谛，并不属于灭谛和道谛。善等识相肯定都不相同，因为三性因缘混杂引生，蕴、处、界的相同和相异，以此为准应当知道。不然的话，应当是没有五蕴、十二处等。</p><p>　　然而相分等依识变现，并不像识性那样是依他起性中的实有。不然的话，唯识道理应当是不能成立，因为容许识与识的内境都是实有。或者说识的相分、见分等是从缘而生，都是依他起性，其虚实和识一样。只是遣心外遍计所执，不遮内识所变相分等。不然的话，真如也不应当是实有。</p><p>　　外人诘难说：既然内境与识并不是虚妄，为什么只说唯识无境呢？</p><p>　　论主回答说：识只是内有，境也通于外，恐怕心内境与心外境相滥，所以只说唯识。或者说愚蠢的人们迷惑，执着于外境，生起烦恼业，沉沦生死，不懂得观心，不勤奋求得出离，因为怜悯这种人，所以说唯识。使他们自己观心，解脱生死，并不是说内境和外境一样都是没有的。或者说相分、见分都同识性，由于熏习力好像是多分产生，真如也是识的实性，所以除识之外没有其他的东西，这里所说的识也包括心所法，因为心法和心所法肯定要相应。</p><p>　　这部论用三部分成立唯识，所以称为《成唯识论》，也可以称为《净唯识》，说明唯识道理极其明净。本论称为《唯识三十论》，用三十颂讲解唯识道理而得圆满，不多也不少。</p><p>　　现在已经依据圣人的教诲和正确理论，辨别了唯识的性质和相状，把所获得的功德回向布施给有情众生，祝愿自他共同速证无上大觉。</p></div>"
}]