[
    {
        "title": "妙法莲华经 叙品第一",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><h3>　　叙品第一</h3><p>　　以下教法是我亲身从释迦牟尼佛那里听说的： 那时，释迦牟尼佛住在王舍城的耆阇崛山中。与佛随行共处的有一万二千多名大和尚，他们都已达到阿罗汉的果位，所以，他们已没有各种欲望和杂念，再也不会产生愚昧者日夜缠身的<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，使自身获得了真正的实惠。由于他们均已修身炼到超出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>外、不在五行中的精神境界，所以，个个身心快乐，逍遥<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。这些大和尚中有阿若憍陈如、摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>、优楼频螺迦叶、伽耶迦叶、那提迦叶、<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗、大目犍连、摩诃迦旃延、阿袅楼驮、劫宾那、憍梵波提、离婆多、毕陵伽婆蹉、薄拘罗、摩诃拘絺罗、难陀、孙陀罗难陀、富楼那弥多罗尼子、须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>、阿难、罗睺罗等大众所熟悉的大阿罗汉。还有未达到阿罗汉果位须继续学习修炼者及已无须继续学习者二千人。释迦牟尼佛的姨母摩诃波阇波提<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>与其眷属亲朋六千人以及释迦牟尼佛<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>前的妻子、罗睺罗的母亲耶输陀罗<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>尼与其眷属亲朋也都来到耆阇崛山佛的住处。另有大菩萨八万人也来到今日的法华会上，这些大菩萨们皆已<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>佛的无上圣智，并在此智道上<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不息，无论是果位、心念、还是行为，皆不倒退。他们精通一切<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>，又获乐说辩才，常转法轮，弘法利生。这些菩萨们已曾<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>过成百上千以至无数无量个佛，并于这么多的诸佛世界中持戒修福，积德<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>，植下了众德之本，时常受到诸佛的称扬赞叹。他们以慈悲之心修身养性，善于获得佛的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，所以，他们都通达大智大慧，均已达到了<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。他们不但自身解脱，而且还以慈悲之心，救度成百上千以至数不清的芸芸<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，他们的名称传遍了无量无数个世界。他们的名字是：文殊师利菩萨、<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>、得大势菩萨、常精进菩萨、不休息菩萨、宝掌菩萨、药王菩萨、勇施菩萨、宝月菩萨、月光菩萨、满月菩萨、大力菩萨、无量力菩萨、越三界菩萨、跋陀婆罗菩萨、<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨、宝积菩萨、导师菩萨等大菩萨。此类大菩萨一共有八万多人。</p><p>　　那时，在天界作王的释提桓因与其眷属二万人同时来到法华会上。还有明月天子、普香天子、宝光天子、四大天王各与其眷属一万多天子以及自在天子、大自在天子与其眷属三万多天子等也齐赴法华盛会。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>的主梵天王、尸弃大梵、光明大梵等也各自率领自己的眷属一万二千多人来到释迦佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的道场。八大龙王与其眷属若干人也来了。这八个龙王分别是难陀龙王、跋难陀龙王、娑伽罗龙王、修吉龙王、德叉迦龙王、阿那婆闼多龙王、摩那斯龙王、优钵罗成王。四紧那罗王与其眷属若干人也到了说法的地点，这四紧那罗王是：法紧那罗王、妙法紧那罗王、大法紧那罗王、持法紧那罗王。四干闼婆王：乐干闼婆王、乐音干闼婆王、美干闼婆王、美音干闼婆王各其眷属百千之众也来到<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>现场。四阿修罗王：婆稚阿修罗王、佉罗骞驮阿修罗王、毗摩质多罗阿修罗王、罗睺阿修罗王，也各与百千眷属同赴法会。四迦楼罗王：大威德迦楼罗王、大身迦楼罗王、大满楼罗王、如意迦楼罗王，各与若干眷属同赴法会。韦提希的儿子阿阇世王也走出王宫，与其亲朋及文武百官一起，来到耆阇崛山听佛说法。他们各自对佛的双足行礼之后，便退坐一旁。</p><p>　　这时的<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，已被<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>团团围住。大家纷纷供养佛、<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>佛、尊重佛、赞叹佛。佛为诸菩萨宣讲大乘经典，经名叫《无量义经》，这是<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>大乘菩萨的一个方法，深得佛的护持与眷念。佛说完此经后，便打起坐来，进入了义趣无穷的实相之定，从而达到身心寂静、默然不动的境界。就在这时，天空中下起了五彩缤纷的天花，如小白花、大白花、小红花、大红花。这些天花散落在佛及法会现场所有大众的身上。整个佛世界也同时出现了震、吼、击、动、涌、起等六种震动。参加这次法会的比丘、比丘尼、优婆塞、优婆夷等四众弟子以及天龙八部即：天、龙、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽，还有人，非人以及诸小王，转轮圣王等所有大众从没有遇见过这种祥瑞的景象，他们深感惊奇，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>不已，纷纷合掌致礼，个个都目不转睛地注视着<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>。这时，只见佛陀眉间放出白毫相光，照耀于东方一万八千多个世界，无不周遍。下至阿鼻<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>，上至阿迦尼咤天，这个世界各个部分中<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>着的六类众生即地狱众生，饿鬼、畜生、阿修罗、人、天等都有能清清楚楚地看见。除过这六凡之外，还能看见这个世界中的现在诸佛，并能听见诸佛所说的经法；同时还看见诸比丘、比丘尼、优婆塞、优婆夷以及那些<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>得道者；还看见诸菩萨和大菩萨们以种种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>修种种法门，通过对种种法门的信解，而呈现出各种各样非凡的相貌和<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>，并由此而行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。大慈大悲，普度众生。通过佛的白毫相光，大家还看到了已经涅槃的诸佛以及诸佛涅槃后以佛的舍利所建起的七宝佛塔。</p><p>　　这时，弥勒菩萨心想：今天，世尊现出这般神变之相，到底是因为什么而得有此祥瑞？现在世尊业已进入一种不可思议的<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>之中，这是一般人很难达到的一种非常少有的奇事，到底应该去问谁呢？谁又能回答这样的问题呢？弥勒菩萨转念又想：文殊师利菩萨是上座法王子，他曾亲近供养过去世中的无量个佛，所以，肯定会见过这种稀有的瑞相，我今天可以去问他。与此同时，法会上的比丘、比丘尼、优婆塞、优婆夷以及天龙、鬼神等都在这样想：佛陀的这种光明神通之瑞相，今天当向谁去寻问？那时，弥勒菩萨很想消除自己的疑惑，加上又发现四众弟即比丘、比丘尼、优婆塞、优婆夷以及诸天龙、鬼神等与会大众也心存这种疑惑，于是向文殊菩萨问道：“到底是什么原因，佛陀今天现出这般祥瑞神通之相，并放射出如此绚丽的光彩，照耀于东方一万八千多个国度，从而尽见这些佛世界中的种种<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>之象？”</p><p>　　于是，弥勒菩萨想重新表达这种意思，便以偈颂形式问道：文殊师利，我们的导师释迦牟尼佛何故眉间白毫大放光明，普照<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>呢？这时，天空降下了白色和红色的曼陀罗及曼殊沙花，不但色彩美丽，而且散发出·檀香味，使众人大饱眼福，心情欢畅。天花下过之后，大地一片庄严洁净，就在这时，世界又产生了六种震动。四众弟子都因看到此种瑞相而身心畅快，这是前所未有的壮观景象。佛陀的眉间光明照耀于东方一万八千多个国度，天地一下子都变成了金色的瑞相。从阿鼻地狱一直到三界的最高处，各个世界中的六类众生，生<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>死、死死生生，总在<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之中<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>，行善作恶之业缘及其各自引发的好与丑的<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，皆在佛的白毫光中一展无余。在释迦佛的白毫光中，还看见了圣中之主，犹如兽中狮子一般的诸佛，他们在为众生演说最为微妙的经典。佛的声音非常清朗，非常柔和，以这种动听悦耳的声音讲经说法，教化无数亿万菩萨，其法音之深奥微妙，令众生百听不厌，深信不疑。同时，他方世界的每个佛也都在各自的世界中以这样的清净微妙之声，讲说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。由于众生有种种根机及种种习气毛病，所以，诸佛以无量无数的比喻，揭示<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>，开导众生<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。如果众生遭受到各种苦难，惧怕衰老、疾病、死亡，那么，佛便为他们讲说涅槃寂灭、清净解脱之法，从而度脱无边的<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。如果众生积<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>善、广种<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>，并曾供养于佛，一心追求殊胜的妙法，那么佛便为他们宣讲<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>之法，使他们观察世间因缘，景物<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>本质，从而获得开悟。如果<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>，止恶行善，持戒修福，追求至高无上的圣智，那么，佛便为他们将讲说至清至净的佛道。</p><p>　　文殊师利菩萨，我住在这个世界，借助于佛的白毫光，而得以看到如此奇妙的景象，我所见之佛境，所闻之佛音还有成千上亿种之多，如此众多的见闻，我今日将向您大略地敍说一下。我看到在那些世界中，有恒河沙数那么多的菩萨，他们在各种珍宝如金银、珊瑚、珍珠、摩尼、·磲、玛瑙、金刚等都奉献出来，甚至连自家的佣人、车子包括那些装饰豪华的高级车乘也都高高兴兴地拿出来<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，以此追求<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>大业，表现出趋向佛的宏大誓愿。成佛解脱是欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中最彻底、最<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的解脱，三界中的六道众生若能以成佛为志向，并为此而精进努力，那么，他们必然会受到诸佛的赞叹。在佛的白毫光中，我还看到有的菩萨以驷马宝车、栏·花盖等装饰华贵的宝物进行布施。我还看见一些菩萨以自己的肉体、手足甚至自己的妻子进行布施，以求获证无上圣道。我还看见有的菩萨为了追求佛的无上智慧，欣然将自己的头颅、眼睛以至整个躯体来布施。文殊师利菩萨，我还看见有许多国王都到佛居住的地方寻问无上的圣道，经佛讲解教化之后，这些国王纷纷舍弃享乐的国土以及所有宏丽雄伟的宫殿和臣子、妻妾，剔除自己的须发，穿上了出家僧人的<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>，跟随佛陀一心修行去了。</p><p>　　我还看见有的菩萨以和尚的面目出现，他们独自呆在空闲寂静的地方，一心一意地读诵经典。有的菩萨目标远大，意志坚定，进趣不息，为了冷静地思考体悟佛道之理，他们进入深山老林之中。那些离欲之人，经常在空旷郊外修习禅定，豪无间断，从而获得了天眼通、天耳通、他心通、<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>通、神族足通等五种神通。还有一些菩萨，安住于禅定之中，并端心一意，恭敬合掌，以千偈万颂赞叹三世十方一切佛的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。又有一些菩萨，智能深邃，志向坚定，他们能经常向佛请问佛法，听佛讲解之后便依教奉行，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>不怠。我还看到一些佛弟子们，不但<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>深厚，而且智慧具足，他们通过无数种比喻为众生讲解佛法。他们乐于从事这种讲经说法的善举，从而教化菩萨，破除邪魔，使法鼓常击，法音常鸣。又有一些菩萨<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>入定，心清意净，不为外境而动念，天龙神圣前来恭敬<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>，他们也不会因此而生出欢喜之心。另有一些菩萨在山林之中打坐入定，功行圆满，身上发出清净的光芒，直照地狱深处，从而使地狱中受苦难的众生获得救济，使他们都进入圣洁的佛道。那些苦行菩萨，终日不坐不卧，一刻也不眠睡，他们游荡夜森林之中，极其勤奋地寻求着成佛的道路。我还看见那些受持具足圆满的清净大戒的修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，他们在日常生活中，事无巨细，皆循规蹈矩，一切以佛法<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>为准，从而具足了完满无缺的威仪，犹如明净的宝珠一样，纯洁无暇，他们试图通过这种方法求取无上佛道。又有一部分弟子，他们专心致志地修忍辱行门，那些傲气凌人的低俗之辈无论如何对他们恶意辱駡，甚至施暴捶打，他们都能忍受，毫无怨气。他们想借助于这种高超的忍辱功夫以达到佛的境地。还有一些不苟言笑、清净脱俗的菩萨，他们远离那些愚痴不化的亲朋眷属，亲近功行圆满、智慧具足的善者。他们专心一意，消除散乱，收摄心念于山林之中，在千年万载的岁月长河里，矢志追求着成佛解脱的道路。</p><p>　　我还看见有这样一些菩萨，他们将时间最美妙的东西都布施给佛陀与僧人，如：美味佳肴、名贵汤药、华丽服饰、包括一些价值千万甚至无价的珍贵衣服、千万种用檀香木作成的宝舍、各种微妙的卧具、清净无染的园林，茂盛鲜嫩的花果、清澈明净的流泉浴池，等等。他将诸如此类的微妙之物欣然尽情地拿来布施，以求证得无上的佛道。还有一部分菩萨，大慈大悲，以种种方便之门教化无数众生，为他们讲说涅槃寂灭之佛法。我也看到有的菩萨以智慧之力，观察万事万物的本质，体悟到一切事物和现象非实非虚，非真非假，犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>一样，无形无象。一些佛弟子们体悟到这种法性空寂的道理，从而在其内心对任何事情都无所执着，他们通过这种<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>妙慧而求趋无上圣道。文殊师利菩萨，我还看到，有的菩萨在佛灭度后，供养佛的舍利。有些佛弟子们建造起恒河沙数那么多的塔庙，以庄严佛国世界。这些宝塔高大而美妙，其高约五千由旬，四面各宽约二千由旬。没座塔庙上都布置着上千幅宝幢和宝幡，并以珠交罗作露塔幔，风吹宝玲，发出雅和之声。诸天神、龙神、人及非人时常以各种香、花、伎乐供养这些塔庙。文殊师利菩萨，诸佛弟子为了供养这些舍利，建造并装饰塔庙，使各佛过世界出乎自然，美妙殊胜，像长在帝释天园内的树王一样，花开四方。</p><p>　　释迦牟尼佛所放的白毫光，使我及法会中的大众得见一万八千国土这的各种殊妙之象。诸佛神力高绝，智慧稀有，放出一道清净之光即可照到无数个国土，我们见到这种景象真是三生有幸。文殊菩萨，您是佛的大弟子，就请您为我们解答疑问吧。所以的比丘、比丘尼、优婆塞、优婆夷都欣然仰慕于我二人。人民都看着我们，心里在问，世尊到底为什么要放出这种白毫光？请您现在就回答他们，以决其疑惑，令其欢喜。今天，释迦牟尼佛是为了<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>什么，而放出如此的光明？佛端坐于道场之中，是为了演说自己所得的微妙之法？还是为了给大家授菩提记呢？佛通过白毫相光为我们展示出各种佛国世界，各世界之中，众宝严饰，洁净无染，我们甚至还看到了各世界之中的许多佛。我们能遇到如此难得的盛事，这可不是很小的因缘呀！文殊菩萨，您应当知道，在座的比丘、比丘尼、优婆塞、优婆夷以及各类龙神，都在仰望观察着您，您就为大家讲讲其中的奥妙吧！</p><p>　　这时，文殊师利菩萨对弥勒菩萨及诸大众说：让我看来，今天释迦牟尼佛将要说大乘佛法，如下大法雨滋润众生，吹大法螺号召众生，击大法鼓惊醒迷梦，演大法奥义，觉悟众生。诸位善男子，我在过去世随诸佛修行的时候曾见过这样的瑞相。以我的经验，凡是放出这种神奇的<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>，必然会讲说大乘无上之法，所以，你们应当知道，今日释迦牟尼佛现出这种瑞光，也同过去诸佛一样。他是想让众生都能听闻知悉一切世间之中最神妙难信的佛法，所以才现出这种瑞相的。各位善男子，譬如过去不可思议无数<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>中，有一古佛名叫日月灯明如来—应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊。此佛为众生演说纯正的佛法，从初期到中期，再到后期，始终义趣深远，语言巧妙，纯一圆顿之法门，具足清白梵行之相。日月灯明佛随机说法，因人施教，他为求声闻乘者说苦、集、灭、道等<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>之法，以使他们度脱生、老、病、死，进入涅槃解脱的境界。他为求辟支佛乘者说十二因缘之法。他为诸菩萨说<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>之法，以使他们证得无上佛智，从而断除无明，达到无所不知的一切种智。此佛之后又有一佛同样名叫日月灯明佛。如此一共有二万位佛都是同一名字，号日月灯明，所有的佛都是十种称号具足，他们演说佛法也都分初、中、后三个阶段。</p><p>　　最后那位日月灯明佛未出家时，有八位王子，其一名叫有意，其二叫善意，其三名叫无量意，其四名叫宝意，其五名叫增意，其六名叫除疑意，其七名叫响意，其八名叫法意。这八位王子皆有威仪德行，各自统领四天下。诸王子听说其父出家为修行，已获无上圣智，便都舍弃王位，跟随父王出家为僧，发誓要求证大乘佛法。他们一心修习清净的法门，成为<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>具足的大乘法师。这些王子已于成千上万的佛面前，种植下了众善的根本。那时，日月灯明佛正在演说大乘法经典，经名叫《无量经》。这是教化菩萨的法门，深受佛的护持眷念。这位日月灯明佛说完《无量义经》后，便于大众中结跏趺坐，进入义趣无穷的禅定之中。入定中的佛陀，身体安安稳不动，心地纯净不乱。这时，天空中下起了曼陀罗花、大曼陀罗花、曼殊沙花、大曼殊沙花。这些天花散在日月灯明佛及听法大众身上。与此同时，大地也产生了六种形式的震动。这时，法会中的比丘、比丘尼、优婆塞、优婆夷、天龙、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩候罗迦、人、非人以及诸小王、国王等皆惊喜不已，叹为观止，他们都双手合十，目不转睛地看见日月灯明佛。忽然，佛在其眉间放出一道白毫光相，这束佛光灿烂无比，绚丽多姿，一直照到东方一万八千多个佛过世界，所到之处，无不明亮清晰，就像今天大家所见到的那些佛国世界一样。</p><p>　　弥勒菩萨，你应当知道，那时法会中共有二十亿菩萨，个个喜欢听佛说法。这些菩萨看见佛的白毫相光照耀东方诸佛土后，都深感自己从未见过，所以很想知道这种佛光之所以发放的有关因缘。那时，有一位菩萨，名叫妙光，他一共有八百个弟子，都随他一起来日月灯明佛的居处听法。日月灯明佛，从禅定之中起来后，为妙光菩萨讲说大乘经典，经名叫《妙法莲华经》。此乃教化大乘菩萨的无上法门，常受诸佛的护持与关怀。日月灯明佛讲说《妙法莲华经》一共历时六十小劫（注：相当于十几万年的一种时间单位）。在这么长的时间里，佛一直端坐不动，身心不乱。那时，法会中的听众也都各坐一处，不起于座，历时六十小劫而身心不动。他们听佛宣讲如此妙法，个个全神贯注，如醉如痴，六十小劫犹如一顿饭工夫就过去了。当时，法会之中的所有听众，没有一人身体疲倦，心神<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。日月灯明佛历经六十小劫，说完此经后，便当着梵天王、魔王、<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>、<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>以及天神、人众、阿修罗等大众之中宣布道：如来佛将于今天夜里进入无余涅槃。那时，在场的众人中有一位名叫德藏的菩萨，日月灯明佛当众为他授记，告诉比丘们说：这位德藏菩萨将在我涅槃后成佛，其号为净身、多陀阿伽度、阿罗诃、三藐三佛陀。日月灯明佛授完记后，便于半夜之时，入于无余涅槃。</p><p>　　日月灯明佛灭度后，妙光菩萨便传承师说，一心受持《法华经》，为众生演说开示，历时八十小劫。日月灯明佛的八位王子皆师从于妙光，妙光则悔之不倦，殷勤教化，使诸王子坚定了求证佛智的<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。这八位王子为了追求无上圣智而恭敬供养了成千上万个佛，最后终于自身成佛。其中最后一位成佛者名叫然灯。妙光菩萨的八百弟子中有一位名叫求名的人。此人贪求名利，追求享乐，虽然也在读诵各类佛经，但总是理解不了，读过之后便全忘了，所以称其为求名。不过，此人虽然慧业未修圆满，但其所植福业不小，善根深厚，他曾在千万佛面前，供养，恭敬、尊重、赞叹。弥勒呀，你可知道，那时的妙光菩萨是谁？他不是别人，正是我的前身。那位求名菩萨正是你的前身。今天，我看见释迦牟尼佛所现的这种瑞相，与过去日月灯明佛说法时的瑞相没有什么区别，所以，我想今天如来佛将是要说大乘经了，这经即是《法华经》，一部教化大乘菩萨，常受诸神护持的无上妙法。</p><p>　　这时，文殊师利菩萨想复述刚才所讲的故事，便以偈颂形式对大家说到：</p><p>　　我回想过去无量无数劫中，有一位人中至尊的古佛，号日月灯明。这位世尊广宣佛法，度脱了无量无数的众生，使数亿菩萨证悟了佛的大智大慧。佛未出家前所生的八王子见大圣出家修行，也都跟着出家习佛。当时，这位如来佛正在大众之中广泛演说一部名叫《无量义》的大乘经典。佛讲完此经后，便在座上打坐，进入深妙的禅定之中。这时，天空下起曼陀罗花，天鼓也自然鸣响。诸天众、龙众以及各类鬼神都来虔诚地供养这位人中最尊的如来佛。忽然间，大地震动起来。日月灯明佛的眉间放出夺目的瑞光，显然出稀奇而美妙的景象。</p><p>　　日月灯明佛的这束白毫相光一直照耀到东方一万八千多个佛国世界，展示出一切众生<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业报、生生死死、死死生生，不断轮回的全景。通过这种佛光，我看到了各个佛国世界的庄严景象，那里的一切均由琉璃玻璃等珍宝构成，佛光照来，一片璀璨。诸天神、人类、龙神、夜叉、干闼婆、紧那罗等前来供养自己的佛陀。各世界中的如来佛皆是累劫修行从而顺理成章地成佛大业。这些如来<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>体像金山一样光亮明净，端庄威严，妙不可言。犹如洁净的琉璃一般，内外莹澈，现出真金之像。这些佛都在大众之中敷演深奥的佛法义理，教化各自世界中的众生。各个佛世界中的众生芸芸难数，其中随佛听法的声闻弟子也不多得难以统计。由于佛光的照耀，所有这些大众都清清楚楚地展现在眼前。有的比丘居住于深山老林之中，刻苦<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>，勤勉不息，严守清净大戒，昼夜六时毫不懈怠，犹如守护明珠一样，持戒守律，洁身净心，朝着解脱的目标前进，有些菩萨从事布施、忍辱等修行，其数目多得像恒河沙一样，都处在佛光的照耀之下。我还看见有的菩萨在修习禅定之功，他们入定极深，整个身心皆已寂然不动，这部分人是想以次禅定之功求证无上的佛道。另外一些菩萨已了知万物空寂无实、本性寂灭的道理，他们在各自的佛国之中到处讲经说法，教化众生，以次来积功累德，成就佛道。</p><p>　　那时侯，四众弟子看见日月灯明佛现出如此巨大的神通，个个内心充满欢喜，他们相互询问，佛的这般瑞相到底因何而来？正在这时，天人所供奉尊重的日月灯明佛从甚深的禅定之中起来。他当着大家的面，赞叹妙光菩萨说：“妙光菩萨，你是世间一位明眼善士，一切天人终将<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>信奉于你因为你能奉持如来佛的佛法宝藏，我今天所说的微妙法旨，只有你才能证知。世尊的这番赞叹，使妙光菩萨惊喜不已。接着，日月灯明佛开始讲说《妙法莲华经》，历时六十小劫，不起于法华座席。佛所讲说的这种至高无上、深奥微妙的法义，妙光法师都能领悟信受。佛宣讲这部法华经，也使法会中其它所有的众生倍感心欣喜。日月灯明佛于讲完法华经的当日又告诉天人大众说：“诸法实相的妙义今天已全部为你们讲说完了，我将于今天半夜入于涅槃。往后，你们应当自勉，一心精进，切莫放怠放逸。要知道诸佛是非常难遇的，亿万劫中才会出现一位，所以，你们应牢记法华经句，奋发图强，勇猛精进。”日月灯明佛的八个儿子听说父亲将要涅槃，无不悲份万分，感叹佛这么快就要入灭。这时，身为众生之主，佛法之王的日月灯明佛安慰大家说：“如果我灭度时，你们不必忧伤恐惧，我虽离你们而去，但尚有德藏菩萨，他现在已通达无漏实相之法，继我之后将要成佛，号为净身如来，到时，他也将像我一样，教化度脱无量众生。”那天夜里，日月灯明佛入于涅槃，犹如薪尽火灭一样，寂然而化。世人将佛的舍利分散各地，建起无数个佛的<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>，供养起该佛的法身。佛灭度后，如恒河沙数那么多的比丘、比丘尼皆遵从佛的遗志，更加精勤修行，专心致志地追求至高无上的圣道。</p><p>　　这位妙光法师遵照日月灯明佛的遗嘱，奉持佛法宝藏，在八十小劫之中，广泛宣讲法华经。日月灯明佛的八位王子也受到妙光菩萨的教化，从而坚定了求证无上圣道的信念。也正因为如此，八王子必将于当来之世，得见无数位如来佛。他们依次恭敬供养这些佛之后，必然会随顺诸佛而行无上佛道，所以，他们最终也必将相继成佛，辗转依次而得授记。其中最后一位天中天、圣中圣名叫然灯佛，他是诸仙的导师，到处说法教化，度脱了无量众生。那时，这位妙光法师有一弟子，身心懈怠，不守戒律，贪求名利，经常出入于名门大户，舍弃了所习的佛法经典，荒废了道业，以至什么也不能领悟。为此，大家才称其叫求名。不过，他也作了许多善事，积下了一些福业，所以，还有机会遇见无数个佛，并供养于诸佛，从而潜移默化，随着佛的道法修行，慢慢地具足布施、持戒、忍辱、精进、禅定、智慧等六种解脱成佛之法门，由此历尽无量劫的严净修持，终于在今日遇见释迦牟尼佛，并将继释迦牟尼佛后作佛，号为<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>。到时，此佛将主持教化，<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>无量无数的众生。日月灯明佛灭度后的那位懈怠者不是旁人，就是你。那位妙光法师就是我。我看日月灯明佛的瑞光同今日释迦牟尼佛的瑞光是相同的，所以我知道今日的释迦牟尼佛是要说《法华经》了。诸佛所现说法之瑞相，是一种善巧方便之法。现今释迦牟尼佛所放的这种光明是扶助开发实象义门，所以，大家应当心中有数，恭敬合掌，一心等待佛的说法。众生等待佛法，犹如干渴思饮，所以，佛将广施大法之雨，普润一切众生之心，满足一切求道者的要求。那些追求声闻、缘觉和菩萨三乘的人，若还有什么怀疑、后悔的话，佛将为其讲说法要，所以其疑根，除其悔退，使其再无任何疑惑，而一心修行大乘之法。</p></div>"
    },
    {
        "title": "妙法莲华经 方便品第二",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　方便品第二</p><p>　　这时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>结束<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，安详地告诉<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗说：“诸佛的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>深奥无比，难解难入，所有声闻、辟支佛二乘之人不得知晓。为什么呢？因为佛之所以能成为佛，关键在于他曾亲近<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>过成百上千、数万数亿以至无量无数个佛，并随顺诸佛修习，尽行诸佛无量种道法，勇猛<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>，<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不怠，名声普闻于<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>，成就了前所未有的深妙法门。佛随宜<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，因机施教，所演法义微妙难解。舍利弗，我自<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>以来，曾为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>广泛宣讲过去、现在、未来种种<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a><a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，还曾以各种各样的譬喻为众生讲解<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>、通过无数巧妙方法的<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，引导众生转迷成智，远离各种执着系缚，获得开悟和<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，为什么呢？因为如此来虽然是从真如实象中如实而来得以成佛，但他同时又具备了权巧方便的法门，能以种种因缘譬喻广演言教。佛这种权实并用、事理<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>的知见波罗蜜，全都完整具备，舍利弗，如来佛的知见，广大而深远，无数无量，无有障碍。佛的十种特有力量和四种无所畏惧，佛的禅定和解脱之定等皆深奥无边，为亘古未有的法门。舍利弗，如来佛能通过各种不同方式，非常巧妙地宣说各种法门，其说法之辞柔和细软，使众生听后无不欢心愉快。舍利弗，取要言之，如来佛已成就了无量无边、亘古未有的法门。算了，舍利弗，不必再说了。为什呢？因为，如来佛所成就的第一稀有难解之法，只有诸佛与释迦牟尼佛才能穷究尽底，领悟诸佛法实相非实非虚，<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>而不相的微妙理趣。而诸法实相则是从诸法的相、性、体、力、作、因、缘、果、报、本末究竟等十几个方面来把握的。所谓相即外观形相；性即本性；体既众生之质伴；力即事物所具有的功能；作即身、口、意三业的作为；因即因、根源；缘即辅助原因；果即结果；报即<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>、<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，如是本来究竟等指本末皆空。</p><p>　　这时，世尊想重宣此义，便以偈颂形式说道：</p><p>　　<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>和出世间唯一的大英雄——佛，其实是高深莫测的，无论天上的神众，还是地上的世人，所有一切众生都不知道佛的深妙境界。佛的十种智力和四种无所谓，佛的各种解脱之道和诸多禅定，还有佛的其它道法，都是无法测度的。我本已跟从过无数个佛，具足了他们的所有道法，这些道法个个甚深微妙，一般人很难见到，也很难明了。佛已在无量亿劫数以前，广泛地修持佛的道法，终于在修法行道的所得成正果。所有这些，我已悉知悉见。像刚才所说的十种大果报，尤其是其中法性与<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>的深奥义趣，只有我和十方诸佛才能明白。因为这种法不可以随便就讲给人听，它是究竟实相的法门，在这里没有用言语表达的路，也没有用心思考的余地，它是超言绝象，绝对寂灭的一种至高境界，无论是哪类众生都不能理解其中的义趣。除过信力特别坚固的大菩萨之外，佛的其它<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，即使曾供养过许多佛，消除了一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>和欲望，只余下最后这一次<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>果报之身，行将获得最终解脱，他们也是无法测知佛的智慧的。假使全世界的人都像舍利弗那样富有智慧，他们即使穷尽思想和智力来揣测佛的智慧，也是揣测不到的。别说一个世界，就是十方所有世界中的众生都像舍利弗或其它所有的<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>那样智力超群，挖空心思，共同来度量、揣测佛的智慧，也还是不能理解的。因为这些声闻弟子的智慧只是权宜之智而非体悟实实相境界的实智。比声闻乘更高一级的辟支佛乘具有锐利的智慧，他们已断尽烦恼，即将最后解脱。可就是这些辟支佛，即使像竹林一样密密麻麻地布满十方世界，他们万众一心，在亿万劫那么长的时间里，共同思量佛的实智，也是连一点点都无法知道的。初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>的菩萨，已曾供养过无数的佛，他们对佛法的道理宗趣都通达无碍，而且还善于讲说。假使这些初发心的菩萨像稻子、麻、竹子和芦苇那么充满了十方世界，他们一心一意，用其微妙的智慧，在恒河沙劫那么长的时间里，共同思量，也无法知道佛的智慧。那些发心之后不再后退的菩萨，即使像恒河之沙那么多，他们一心共求佛的智慧，也是不得知晓的。</p><p>　　释迦牟尼佛又告诉舍利弗说：“这种清净超凡、不可思议、甚深微妙的实相之法，我今天已全部<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。只有我和十方诸佛才知道实相之法的深妙义趣。舍利佛，你应当知道，十方三世一切佛的话语是没有什么两样的，都说的是真实的、同样的妙法，所以，对于佛所说的各种法，都应当坚信不疑。我说法已很长时间了，各个时期所说之法皆不相同，在这说法的最后时期，我就应该将所有的真空的、终极的佛法和盘托出。过去，我说<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>法教化声闻乘弟子，说十二因何缘法教<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>觉乘弟子，都是为了让他们脱离<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>的系缚，迅速达到<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>解脱的<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。佛善于随宜说法，因机施教，针对不同时期、不同众生，佛示以声闻乘，缘觉乘、菩萨乘等三乘之教，其中菩萨乘才是最真实的、最终极的教法。众生不理解这种终极之法，处处执着，看不破，放不下，从而难以获得彻底的解脱，不得达到佛的境界。今天，我将宣说这种终极之法，以使众生从执着束缚之中解放出来。</p><p>　　那时，参加<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的大众之中有些修习声闻小乘，已断除烦恼的阿罗汉如阿若·陈如等一千二百多人，还有些发心求声闻乘和辟支佛乘的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞、优婆夷等，他们各自都在想：今天，世尊为什么要反复而周备地称赞诸佛随机施教的方便法门呢？今天，他为什么要反复强调佛所证司的妙法甚深难解，他所讲的佛法，其真实的旨趣都是很难理解的，所有声闻弟子和辟支佛都不能领会其中的奥妙。佛以前所讲的那种涅槃解脱法义，我们都已领会，并将依此进入涅槃境界。可是，现在佛的意思是说以前所讲的法并不是究竟彻底的实法，只是权宜方便的权法;以前说的并非实智，而是权智。佛这么一说，把我们都搞胡涂了，不知佛所说的到底是什么意思，究竟的义理到底是什么。当此之时，舍利弗知道大家心中的疑惑，加之他自己也不明白，于是问佛道：“世尊，您今天为何再三称赞三世诸佛那些灵活方便而又深奥的法门呢？我舍利弗自从跟着您学法<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>以来，已四十多年了，还从来没有听您这样说过。今天，<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>弟子对此都不明白，恳望世尊为我们讲讲其中的道理，今天您到底为何要如此殷勤地赞叹如来佛的奥妙难解之法门？”</p><p>　　这时，舍利弗想在复述一下自己的想法，便以偈颂形式说道：</p><p>　　世尊啊，您是最尊贵的<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，您的智慧好比太阳一样无与伦比。好多年以来，你为众生演讲这些佛法，循循善诱，勤勉不息。您说您自己已证得如是诸法：十种智力、四无所谓、种种<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>、四禅八定、八种解脱等一系列不可思议的法门。佛通过长期<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所得到的微妙之法是实智，而不是权智，所以，声闻、缘觉之人都不明白，也没有人能够发问。这种法只有佛这才能明白，佛所达到的这种意境，是很难揣摩测度的，所以，也是没有人能发问的。没有人问，世尊便自己宣说这种法，并称扬赞叹佛所行的无上圣道。由此佛道而得的真实智慧与权宜之智不同，它是极其微妙的，只有诸佛才能得到的。经佛这么一说，如今，无论是已断除烦恼的罗汉，还是求证涅槃的辟支佛等众弟子们都已堕入疑网之中，他们都在暗自发问，佛为何今日又这么说呢？那些追求缘觉的比丘、比丘尼以及诸天神、龙神、鬼神，还有干闼婆等大众疑虑重重，面面相觑。他们都望着释迦牟尼佛，期待着佛为他们解释其中的原由。在所有声闻弟子中，佛说我是智慧第一，但即使以我的智慧，如今也不能理解佛的意思了。到底什么法是究竟的法门，什么道是佛所行的<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>之道？作为佛口所生的真子——菩萨，都已合起掌来，恭敬地看着佛，等待着佛开口说法，盼望佛说出最美妙的法音，道出最真实的道理。如恒河之沙那么多的天龙八部神，约八万都求证<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>的各类菩萨，以及亿万国土等都来到佛的面前，他们都合起掌来，虔心敬佛，想听闻世尊演说所<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>的这种具足圆满的无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>大道的真实义理。</p><p>　　这时，佛对舍利弗说：“算了！算了！不必再说了。若说这种至高无上的奥秘之法，一切世间的诸天神和人类都会惊异怀疑。”</p><p>　　舍利弗又对佛说：“世尊啊，请您说吧！为什么呢？参加这次法华盛会的亿万众生皆曾见到过佛，他们的根性非常聪明，他们的智慧都十分明亮通达。他们听过佛的宣说之后，就会产生出敬信之心来的。”</p><p>　　接着，舍利弗想重新表达自己的意思，便以偈颂形式说道：</p><p>　　妙法之王，世间最尊贵的佛呀，您不必担心，就为我们讲解无上道法的奥秘吧。这次法会中有无量无数的众生，肯定有能够敬信奉持的弟子。</p><p>　　佛又制止舍利弗说：“如果我宣讲这种佛法，一切世间中的天神、人众、阿修罗都会惊惧而怀疑的，尤其是那些虚伪傲慢的比丘，他们自以为一切佛法都懂了，不会相信还有未解的妙法的。这些人的后果是不堪设想的，他们将堕于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼或<a href=\"/remen/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>中。”</p><p>　　这时，世尊又以偈言形式复述道：“算了！算了！不必说了。我这种甚深微妙的法门一般人是想象不来的，那些虚伪傲慢之辈听后肯定不会恭敬信受的。”</p><p>　　这时，舍利弗又对佛说道：“世尊啊，请您为我们宣说吧！请您为我们宣说吧！在今天的这个盛大法会中，与我们同辈份的弟子们足有亿万之众，他们世世代代接受佛的教化，这样的人必然会对佛所说的妙法产虔诚的<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的。他们一旦听闻佛说这样的妙法，就会在漫漫的长夜之中，身心安稳，得到无穷的益处。”</p><p>　　这时，舍利弗想再说一遍，于是又以偈颂形式说到：</p><p>　　至高无上、<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>双圆的世尊啊，请您为我们宣讲这独一无二的妙法吧。我舍利弗是佛的大弟子，今日恳请您详细地分别解说。请您放心，这次法会中的无量众生都会恭敬信受您的妙法的。他们已多生多世蒙<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>化，怎能忘记佛的法乳之恩呢？您看他们都已诚心敬意，虔诚合掌，静等着听受您的话语了。我等一千二百人及其它一些求证佛果的弟子，愿为在座的大众请法于您，恳请您分别解说佛的无上妙法。我们这些人如果听到这等微妙之法，必定会皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。</p><p>　　这时，世尊告诉舍利说：“你已连续三次恳切请求，我怎好不说呢？现在，你就洗耳恭听，仔细思考，我将为你们分别解说。”</p><p>　　就在如来佛说这话时，法会中有部分比丘、比丘尼、优婆塞，优婆夷等约五千人立即从其座位上站起来，对佛行礼之后，退出了法会呢？因为他们前世种下的<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>之根太深重了，这些人福薄慧浅，毛病很多，尤其是骄傲自满，他们本来没有得到上人法，却说自己已经得到；本来还没有证得某种果位，却自认为已经证得。这些人有如此的过失，所以他们又坐不住了，看来，他们是<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>听法华经的。对此，世尊默然而不加制止。</p><p>　　接着，释迦牟尼佛对舍利弗说：“现在留下的已不再有碎枝杂叶，全是有善根，有真纯<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>的人，舍利弗，这些傲慢水平面浅薄的人走了也好，你们喜欢听，我就为你们说吧。”</p><p>　　舍利弗连忙说：“太好了！世尊，我们非常喜欢听您说法。”</p><p>　　佛告诉舍利弗说：“这种妙法不是任何时候都能听到的，只有在各种条件成熟时，诸佛如来才宣示它于众生，就好比优昙钵花一样，只是到了一定时间才开放。舍利弗，你们这些人应当相信佛所说的教法，佛说的一切话语都是真实不虚的。舍利弗，诸佛为了显示真实的法旨而以一种权宜之法随机施教，因人说法，这其中的道理是不容易明白的。为什么呢？多少年来，我一直以种种方便法和因缘法，并举出许多譬喻的言辞来演说诸法。这种法不是一般的认识所能理解的，只有诸佛才知道这种法的奥妙。这是什么原因呢？因为所有的佛都只有为着一件大事才出现于世的。舍利弗，怎样理解诸佛只是为着一件大事才出现于世呢？诸佛见众生为无明所缚，生<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>死，轮回受苦不得解脱，为了使众生打开佛知、佛见之门，从而剔除愚昧，洞明诸法实相，证到清净的果位。所以，诸佛才出现于世；为了给众生指示佛知、佛见，使他们明白人人都有佛知、佛见，所以，诸佛才出现于世；为了使众生<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>自身本有的佛知、佛见，使他们内心深处真正领受，所以，诸佛才出现于世；为了使众生实际证入佛知、佛见，从而证得佛果，最终解脱，所以，诸佛才出现于世。舍利弗，这就是诸佛因为一件大事的缘故才出现于世的道理。可见，所谓大事因缘，实际上就是欲令众生开、悟、入佛知、佛见，从而了脱生死，离苦解脱”</p><p>　　释迦牟尼佛接着又对舍利弗说：“诸佛如来只是教化，让他们明白，所有一切作为常常就为着这一件事，即唯以佛知、佛见，开示、觉悟众生。舍利弗，如来佛仅仅以唯一的佛乘来为众生说法，除此佛乘之外，再没有其它什么乘了，既无所谓大、小二乘，也无所谓声闻、缘觉、菩萨三乘。舍利弗，所有十方诸佛所说的法也都是如此，只有唯一的乘，而无其它的乘。舍利弗，过去世中的诸佛以无数方便权宜之法，通过种种因缘果报、各类譬喻、美妙的言辞等为众生演说了一系列佛法。这些佛法无论是以小乘、大乘，还是以声闻乘、缘觉乘、菩萨乘的形式出现，佛的本怀只是为了演说这唯一的佛乘。众生跟从诸佛听法修习，最终将获得一切种智，即唯佛具有的中道智慧。舍利弗，未来世中的诸佛，他们出世之后，也将以无数方便之法，借助于种种因缘、种种譬喻以及美妙的言辞，为众生演说一系列佛法。这些佛法无论以何种形式出现，它们最终的目标都是为了说明唯一的佛乘。未来世中的众生随佛听法，最终也将证得无所不知的一切种智，从而成佛解脱。舍利弗，现在世中的十方无数佛国中，所有的佛都在<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>众生，使众生得到安稳和快乐。这些佛也是以无量方便之法，利用各种因缘、譬喻和言辞为众生演讲各类佛法。这些佛法都是围绕着唯一的佛乘而展开的。十方世界的众生听佛法，终将获得佛的无上圣智。舍利弗，所有过去、现在、未来的佛的宗旨就是教化菩萨，欲以佛的知见指示众生，欲以佛的知见觉悟众生，欲使众生证得佛的知见，从而得到佛的圣智，达到佛的果位。</p><p>　　“舍利弗，我如今也是这样。我深知众生有各种各样的欲望，这些欲望已深刻地植根在众生的心念之中，所以，我便随顺众生的本性，用各种因缘果报、譬喻故事及其它各种方便之力而他们说法。舍利弗，我这样教化众生，也都是为了使他们理解唯一的佛乘，从而最终获证无所不知的佛智，达到佛的境地。舍利弗，十方世界中尚且没有二乘之分，更何况还有什么三乘呢？舍利弗，诸佛出现于五浊恶世，所谓五浊是指劫浊，即整个世代灾难不断；烦恼浊，即众生充满贪欲、恼怒、愚痴等各种烦恼；众生浊，即众生不信善恶报应，不持禁戒，而受众苦；见浊，即众生持邪恶或错误的见解，佛教<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>日益衰替；命浊，即众生因作恶业，<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>极短。所以说，舍利弗，当劫浊大乱时，众生的罪垢非常严重，悭吝、贪婪、嫉妒、，从而种下了不善之根。所以，诸佛便以其方便之力，分别讲三种佛法，以逐渐引导他们归入佛乘。舍利弗，如果我的弟子有人说自己是阿罗汉、辟支佛，但却不闻不知诸佛如来方便法门教化菩萨证入佛果的微妙之法，那么，他们便不是佛的弟子，不是阿罗汉，不是辟支佛。另外，舍利弗，这些比丘、比丘尼自认为已证得阿罗汉果，已处在最后一次轮回果报之身，以后将不再轮回<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>，将证入究竟的涅槃，所以，这些人便不再发心追求无上圣智了。要知道这种人都是些骄傲无知之徒。为什么呢？如果有的比丘的确已证得阿罗汉果位，但他若不再信受这部妙法的话，也是绝对不正确的。除非在佛灭度后，众生面前没有佛。为什么呢？因为佛灭度后，像《妙法莲华经》这样的经典，很难找到能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、读诵、理解义趣的人。如果能遇到其它的佛，那么，对于《妙法莲华经》中的这种开权显实的道理便会明白了解。舍利弗，你们应当专心一意地信仰、理解、受持佛所说的这种法。诸佛所说的话语没有虚妄不实的，没有其它什么乘，只有唯一的佛乘。</p><p>　　这时，世尊想再说一遍刚才的意思，于是以偈颂形式说道：</p><p>　　比丘、比丘尼中有些傲慢浅薄的人，优婆夷中也有这样的人，包括优婆夷中的那些狐疑不信者，这四类人一共有五千人。他们持戒不严，看不见自己的过错，而且还护着自己的毛病。这些小智之人已经出去了，他们是大众之中的糟粕，因惧怕佛的威仪和<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>，所以才离开了。这些人福薄德寡，不能信受这样的妙法。现在留在法会中的人已没有碎枝残叶，全是真实的具有大乘<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>的人。舍利弗善于听闻诸佛所得之法。诸佛的教法是以无量的方便之力而为众生随机演说的。每个众生心里所想，他们各种各样的行为，各种各样的欲望和根性，他们前生所造的善业，这一切，如来佛全都知道，因此，佛就用种种因缘法、譬喻法、并使用一些美妙恰当的言辞来为众生讲经说道，以使所有听法者都能心领神会，欣然接受。也正因为如此，在长期的说法生涯中，佛曾说过各种形式的法，有时说长行直述的契经即修多罗，有时就每句字数固定的偈颂即伽陀，有时说弟子们前世因缘的本事，有时说自己前世因缘的本生，有进说佛显现种种神通的稀有之事，即未曾有，有时说各种因缘，有时说各种譬喻，有时说重宣契经教义的重颂即·夜，有时说阐释佛法意义的论议即优婆提舍，那些愚钝的人眼光短浅，看不到大乘佛法的微妙旨趣，只喜欢小乘之法，这些人看不透生死，贪着于<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>。他们过去在无量个佛面前未曾修行深奥微妙的佛道，所以，生生世世遭受诸苦，心恼意乱，无由解脱。对于这些人，我就讲说涅槃解脱之法，先将他们从生死贪着之中解放出来。通过这种随宜施教的权且之策，引导他们逐步入无上圣智。过去，我从来没有明确说过你们这些人都会成佛果。之所以没有这样说，是因为时机尚未成熟。今天正上时候，我决定要说大乘的妙法。</p><p>　　我这九部法门，都是随顺众生的根性和各种机缘而说的，最终目的都是引导众生归入大乘佛法，因此我今天才说这部《妙法华莲经》。其实，有许多佛弟子本来已具备了大乘的根基，他们心地清净，性情柔和，头脑聪明。这部分人已在无量个佛那里修行过深奥微妙的佛道。今天，我就为这一类人说此大乘经典，并为他们授记：这些人来世必将成佛。由于他们内心深处非常敬慕佛，多少年来一直严持净戒，所以，一旦听说自己也将成佛，他们肯定会充满欢乐的。佛深知此类众生的思想和修行，所以才为其讲说大乘无上法门。无论是小乘声闻弟子，还是大乘菩萨弟子，只要听了我的这次说法，甚至只听了一句偈颂，他们将来都会毫无疑问地成佛的无上果位。</p><p>　　在十方所有的佛国世界之中，只有唯一的佛乘之法，没有大小乘之分，也没有声闻、缘觉、菩萨三乘之别，除过佛的各种权宜方便说法之外。不过，佛的这些权宜法门仅仅是以假借的名言概念来引导众生修证佛智佛慧的。为了宣说佛的科研智慧，诸佛出现于世，只有这件事是真实，其它如二乘或者三乘等都不是真的，只能算作方便权巧的法门。可是诸佛终究并不是以小乘之法济度众生。佛本身就住在大乘法中，与其所证得和无上妙法融为一体。所以说，佛是用最深的<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>和最高的智慧武装起来的，佛也是用这种无上的佛法来救度众生的。佛自己已证得了无上的佛道，即大乘的平等之法，所以，我如果还以小乘这法教化众生，即使是一人，便算我堕于悭吝与贪婪，这是绝对不可能的事。</p><p>　　如果有人信仰佛法，<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>于佛，佛就会以诚相待，绝不欺诳，也没有任何贪婪、嫉妒之意，佛将谆谆教化，使其断除恶业，一心向善。所以，佛是最大公无私、光明磊落的人，他能于十方世界中泰然自居，毫无畏惧。我释迦牟尼佛以各种殊妙的相状<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>自身，我的光明已照遍一切世间，引起无量众生对佛的尊崇，这都是为了今天演说微妙的实相法印。舍利弗，你知道我的本意，我早已立下誓愿，要使一切众生证成佛果，与我毫无不同之处。昔日的誓愿如今已付诸实施，即教化一切众生，使他们都证得入佛道。</p><p>　　如果我遇着众生，全讲些高深无上的佛道，那么，没有智慧的人便会思想混乱，迷惑不明，所以，也就不会信奉。我知道这些众生未曾修<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>业，没有种下善根，他们贪着于财、色、名、食、睡等五种欲望，愚痴爱恋，穷追不舍，从而产生了种种烦恼。由于贪着于五欲，造下了无尽的恶业，所以他们总是轮回转生于地狱、饿鬼、畜生等三恶道之中，或是在整个六种轮回之道中生生死死，死死生生，备受诸苦的煎熬。受孕胞胎，生微末之形，今世出牛胎，下生入马腹今生张家子，来世李家女，生生世世，轮回不息。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>微薄、福业很少的人总是要受各种痛苦的逼迫的。这些人已陷入邪见的密林之中，他们或执着于有，或执着于无，坚持此等错误的观点，其数共有六十二种之多。这六十二种观点全是荒谬不实之法，可他们却坚定信受，不愿放弃。还有，他们傲慢自大，善于谄媚奉承，不正直坦率，心地不诚实。这些人于千万亿劫之中，连佛的名字都没有听过，也从没有听闻过真正的法义，所以说，这类人的确难以度化。</p><p>　　舍利弗，由于这些人福慧太浅，邪见太深。所以，我便为他们设计了一套权宜之法，给他们讲断除诸苦的办法，为他们指示出清净妙乐的涅槃解脱境界。我虽然为他们说涅槃寂灭之法，但这只是权巧方便之计，并非究竟真实的寂灭之法。其实，任何东西本来就是<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>空无，寂灭无实的。佛弟子只要依佛的教法修行，循序渐进，回小向大，必然会体悟到一切非真，本自寂灭的实相妙法，所以，他们终将在未来的世代里<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>成佛。</p><p>　　我通过方便权巧之力，为众生开示三乘法门，虽然有声闻乘、缘觉乘、菩萨乘的区分，但从本质上讲，所有的佛都只是说一乘的道法。说三乘之权教，是为显示一乘之实教，从开始的三乘必将会归于一乘。所以，今天在座的所有大众皆应该消除疑惑，要知道，诸佛的话语没有两样，他们所说之法只是一乘而无二乘。在过去的漫长岁月中，曾有过无量无数的佛相继灭度，其种类成千上亿，多得不可思量。所有这些佛都通过各种因缘法、譬喻法等许多方便法门为众生演说佛法，引导他们体悟真实之法相。这些佛其实讲的都是一乘佛法，他们相继教化无量无数众生，使其最终证入佛道。这些大圣之主的佛知道一切世间的天众、人众等各类众生内心深处和各种欲念，所以才随宜巧设种种方便法门，借此来显出第一义的佛乘。</p><p>　　如果有这样一类众生，他们在过去生中，曾遇到过许多佛，只要他们能听闻佛法，并依法修行，即<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>度悭贪、持戒度毁犯、忍辱度·恚，精进度<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>，禅定度散乱，智慧度愚痴，如此修持<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行，增长福业慧根，那么，这些众生都已成佛了。诸佛灭度之后，如果有人怀着纯善温软之心，修习正法，日积月累，功德圆满，那么，这众生也均已证成佛道了。诸佛灭度之后，那些供养<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>的人，修建起成千上万个佛塔，并以金银、玻璃、砗磲、玛瑙、玫瑰、琉璃、珍珠等清净庄严的宝物进行全面的妆饰，同时，还用铰链庄严诸塔。或者有人建造石庙，用·檀香及沉水香恭敬供养，或者以香木及其它木材和砖瓦泥土等盖佛庙，或者在旷野之中，积土成一座佛庙，或者小孩子玩耍时，聚沙为佛塔，等等，像这样的人，都该证果成佛了。如果有人要为佛树立形象，用种种不同的材料雕刻成佛像，这些人皆已证成佛道了。或者以七种宝物，·石、赤铜、白铜、白·、铅、锡、铁、木、泥、塑料、漆布等作成佛像，这样的人也都成佛了如果有人彩画佛像，将佛像画得非常圆满庄严，这些人无论是自己画，还是请别人画，他们也都成佛了。甚至小孩子玩耍时，用草、树枝、笔或者指甲等画作佛像，这类人渐渐积累功德，具备大悲之心，从而最终证成佛果，并在佛位上教化菩萨，度脱无量众生。</p><p>　　如果有人在塔庙之中，面对佛的庄严宝像或画像，以鲜花、诸香、宝幡、宝盖等恭敬地进行供养；或者请人演奏音乐，如击鼓、吹奏长角、贝螺、笙箫、竹笛、箜篌、弹琴、琵琶、敲打铙钹，等等，将所有这些美妙的音乐全用来供养佛；或者以欢快喜悦的心情，歌唱<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>，赞颂佛的德行，甚至于只唱了一小微小的声音，像这样的人都以证得佛位了。有的人定力不足，心常散乱，这类人如果能在画像佛面前，用甚至一朵花进行供养，那么，他们将慢慢地见到无数个佛。或者有人以<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>、合掌，甚至只举一手或只稍微低一低头等方式供养佛像，他们也会逐渐见到无数个佛。这些由最初的一念发心，渐积功德直到得见无数佛的修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，自然而然地至高无上的佛道，并广行教化，度脱无数的众生，使他们都进入无余涅槃的解脱彼岸，就像薪尽火灭一样，永远解除众生的痛苦。另外，如果有人精神散乱，但只要能到塔庙中念一声“南无佛”，他们最终皆可证成佛的无上圣道，因为，万德圆融始于一念所种的佛因，将来必定得佛果。</p><p>　　如果有人在过去世当中，无论是过去诸佛在世时，还是灭度后，只要能听到《妙法莲华经》这样的佛法，那么，他们就都已成佛了。未来世中的佛有无数之多，这些佛也都是通过方便法门来说法的。任何时代，任何世界的佛都以无量无数的权宜方便之法，演说权教，显示实教，引导众生逐渐证入佛的清净圣智。所以佛的说法，就没有不成佛的。一切佛当初誓愿都是，不但自己要修行佛道，而且还要让所有的众生也都来修行他们所修行的佛道，并最终证得这种无上的佛道。未来世中的诸佛有百千上亿的法门，但无论有多少方便法门，其最真实的法只有一乘法。十方诸佛都是福慧具足的两足尊，他们了知诸法本无自性，不过佛种种的法门是从缘而生起的，所以，为这一乘的佛教，才显说其它的各种教门，如藏教、通教、别教等。这种一乘佛法所住的法位总是在世间去追求这种无上的佛法。我释迦牟尼佛在菩提道场成佛以后，明白了这种道理，所以，如今我作为你们的导师，便用世间的种种方便法门来阐释这种微妙的一乘佛法。</p><p>　　天上和人间所一致恭敬供养的佛，在现世的十方之中足有恒河沙数那么众多。所有这一切的佛为了使众生得到安稳，故而出现于世，他们也都在讲说这部《妙法莲华经》。这些佛都知道最彻底、最圆满的寂灭之法，知道万法寂灭的实相妙义，可是他们若一开始就讲这种至高无上的实相妙理，就不会有人明白，于是他们便以方便之力，显示出各种各样的道法，当然，这一切方便法门，究其真实，都是为了显示唯一的佛乘，使所有众生最终都能成佛，从而得至高无上的解脱。佛知道众生的一切行为，知道他们内心深处的所思所想，知道全心全意前生所习染的各种业果，也知道从生欲望、本性及其精进之力，还知道众生的天赋聪慧或愚钝，所以，佛便以各种因缘、各种譬喻和各种不同的言辞，随顺众生的各种不同根性、不同状况而应机说法，方便教化。</p><p>　　今天，我也是如此，为了使众生获得安乐隐逸，以种各样的法门宣示佛道。我以佛的无上智慧之力，深知众生的各种欲望和本性。所以，我才通过各种权宜之法为众生演说各类法门，以使他们都能法喜充满，欣然奉行。</p><p>　　舍利弗，你应当知道，我以佛眼观看，看见天上、人间、阿修罗、畜生、饿鬼、地狱等<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之中的所有众生，他们不懂佛法，不修正业，所以毫无智慧，是真真正正的穷困者。一旦进入这种生生死死，死死生生的险恶之道，就必然会相继轮回转生，世世受苦，绵绵不绝。因为众生为无明所缚，个个深深地执着于钱财、美色、名誊、饮食、睡眠等俗世之欲，无休止地追求眼、耳、鼻、舌、身对色、声、香、味、触五境的快感，就像牦牛贪爱其尾巴一样，由于贪爱的缘故，自我蒙蔽，犹如黑暗之中的盲者什么也看不见，所以，他们也不去寻找威力无比、能救拔一切苦难的如来佛，也不求佛为他们指示断除苦难的方法。如此以不，这些众生便越不越深陷于各种错谬观点之中而不能自拔。痛苦中煎熬的众生要想舍弃他们的苦根是多么的不容易啊！佛看到这些尚在<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>里沉浮又无出期的苦难众生，便产生了大慈大悲的愿力，发誓要救度这些可怜的受苦者。</p><p>　　我最初成佛坐在道场的时候，在菩提树下静静观察，有时也绕着树漫步，整整二十一天，我都在不停地考虑如何救度众生的问题。我所看到的智慧，微妙难测，是宇宙间至高无上的智慧。可是众生的根基却非常愚钝，他们迷于眼前的欲乐，不知自己的愚痴。像这些没有智慧如同盲有一般的众生，我如何去度化他们呢？这时，<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天的大梵天王、忉利天的帝释天王、守护世界四大天王、住在色界之顶的大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天王，还有其它许多天神以及各天王的眷属千万之众都不到我的面前，恭恭敬敬地合掌致礼，恳请我讲说佛法。我心中暗想，假若我只称赞、演说唯一的佛乘，而不说那些浅显易懂的小乘方便法门，那么这些沉沦苦海之中，根性愚钝的众生是不会皈信这种高深的佛法的。而且，由于他们不信此法，甚至会造成极大的罪过，将来反而更惨，会转回堕入地狱、饿鬼、畜生等三恶道之中，这么说来，我宁愿不说这种微妙的佛法，还不如赶快进入涅槃，不要在世间说什么法了。</p><p>　　忽然，我想起过去世中的诸佛及其所施行的方便之力，由此使我<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>到，我今日所证得的无上佛道之法，也应该通过三乘法门演释。当我这么思考时，十方诸佛一下子都显现在我的面前，他们用佛的清净梵音安慰我说：“太好了！释迦文佛！你真不愧是世间第一个大导师，你获得了这种无上的妙道，并依照佛的办法，运用权巧方便的力量，为众生分别讲说。我们十方佛也都得到了这种最微妙的第一法，因为众生根性的缘故，我们分说声闻、缘觉、菩萨这三乘法门。愚钝无知的人喜欢小乘之法，他们不相信自己还能成佛，所以，只能用权巧方便的法门，分别讲说初果、二果、三果和四果阿罗汉等声闻果位以及缘觉果位，菩萨果位、直至佛的果位。虽然说了三乘法门，但实际上乃是为教化菩萨修行终极的佛乘法门。</p><p>　　舍利弗，你应当知道，当我听见十方诸佛上述极其清净微妙的声音时，我立即口称“南无诸佛”，心中又这样想：我现身于这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>，这是一个充满污浊和罪恶的世界。诸佛刚才说得很对，我也应该像他们那样，以各种方便法门教化众生。我这样想过之后，便立即前往波罗奈国的鹿野苑，最初随我修行的那五们侍者至今依然在此修道。我所证悟的佛法是微妙的实相之法，在这种道法里面，一切事物和相寂灭之法只可理会，不可言传。于是，我便以方便之力，假没了四谛、八正道等种种权宜法门，为·陈如、阿说示、跋提、十力<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>、摩诃男拘利等五位最早的比丘讲经说法，这就叫作转*轮。我在鹿野苑初转*轮，为众生指出了一种妙乐寂静的涅槃境界，从此便有了涅槃之音，有了阿罗汉之名，有了苦、集、灭、道等各种法和须陀洹、斯陀含、阿那含、阿罗汉等各种僧的相互差别之名。我从久远劫修持佛道以来，就一直称赞这种涅槃解脱之法。众生若能证得涅槃的妙理，就会永远断除人生的各种痛苦，所以，过去我常常给你们说这种法。</p><p>　　舍利弗，你应当知道，我看见佛弟子中立志追求佛道的人足有无量千万亿之众，他们都怀着极其恭敬的心情，来到佛的所在地。这些人过去曾在其它诸佛那里听闻过佛用方便法门所说的法。鉴于这种情况，我又在想，如来佛之所以出现于尘世，乃是为了演说佛所证悟的无上妙慧。今天，正是说此佛慧的时候。舍利弗，你应当知道，那些诸根愚钝少有智慧的人，不仅贪着于事事物物的相状，而且自以为是，轻浮傲慢，他们是不会信受这部大乘之法的。现在，这些愚痴傲慢的人都已退出法会了，所以，我已欣喜无畏，在这些菩萨之中，就应该径直舍弃权宜的方便法门，而以开门见山的形式，直截了当地讲说至高无上的佛道。我相信，在座的菩萨们听了这部大乘之法后，笼罩在他们心头的一切疑网将消除无余，在座的一千二百多名罗汉也将与所有菩萨一样，全部证成佛果。</p><p>　　同过去、现在、未来三世诸佛的说法仪式一样，我今天也说唯一佛乘、更无余乘这种毫无分别的微妙之法。诸佛出现于世是非常难以遇到的，往往要经过极其久远的年代才能碰到一佛出世。即使佛出现于世 ，但要碰到佛说这部《妙法莲华经》也是非常难得的。就是等无量无数劫这么漫长的时节，要听到这部无上之法也是很困难的。即使佛开始讲这部法，而真正能听到的人，也是极其难得。就像优昙花那样名贵而难得一见，无论天上诸神还是地上人类，都非常喜欢这种花，可它非到一定时候，是绝不会开放的。如果有人听了这部《妙法莲华经》之后，欢喜赞扬，甚至只说出一句称赞的话，这也算是已经供养了过去、现在、未来三世十方中的一切佛，这些人是比优昙花更难得、更可贵的。所以，在座诸位能听闻如此妙法，真乃三生有幸，你们切莫怀疑，切莫犹豫，请相信我释迦牟尼佛是诸法之王，我已得到了无上妙乐的真实智慧。今天我就如实普告参加法会的各位以及未来的一切众生，我只用一乘的佛道来教化一切菩萨。在此一乘佛道里面，没有教化声闻弟子的小乘法，也没有声闻弟子所追求的小乘果位。舍利弗，你们这些佛弟子，无论是声闻众还是菩萨众，都应当知道，这部微妙的《法华经》是三世十方一是最奥秘、最核心的道法，切莫再生一丝怀疑之心。</p><p>　　诸佛弟子，如今正值五浊恶世，邪见泛滥，贪欲横流，灾社祸连绵，污浊不堪。人们只知享乐，欲壑难填。这类迷昧的众生终究是不会追求佛道的。未来世界中的邪恶之人，一旦听闻佛说一乘佛法，肯定会心生疑惑，不能信受，甚至还会毁谤佛法，由此造成无尽的恶业，从而在轮回转生过程中，堕于地狱、饿鬼、畜生等三恶道之中，但是，也有这么一部分众生，他们面对浊恶的世风，生出惭愧之心，有意改恶从善，追求清净，立志得无上的佛道。对于一部分人，如来佛就应当为他们宣讲、赞颂《妙法莲华经》的一乘无上道法。</p><p>　　舍利弗，你应当知道，十方诸佛法都是一样的。为适应时代的特性，他们都以亿万种方便法门而随宜说法，因材施教，化导众生。如果众生不随佛修习，是不会明白其中的道理的。在座诸位现在都已知道这种真实有妙法了。诸佛是世界的导师，他们都是以方便之力随宜说法，对此，你们不要再有什么疑惑了。现在，你们听了这部《妙法莲华经》，应该生大欢喜心，生难遭遇想。你们也该明白，自己将来一定会成佛。</p></div>"
    },
    {
        "title": "妙法莲华经 譬喻品第三",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　譬喻品第三</p><p>　　这时，<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>无比，心潮起伏，他立即站起身来，双手合十，两眼注视着释迦牟尼佛那副尊严的面孔，开口对佛说道：“今天，我们有幸从<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>这里听到如此微妙的法音，个个心情振奋，莫不叹为观止。为什么这样说呢？我过去曾在佛那里听到这种微妙的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，当时我看到各位菩萨都蒙佛授记作佛，心中十分悲伤，感慨自己失却了如来佛慈悲无量的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>知见。世尊，我以往经常独自一人在山林树下或<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>或漫步。那时，我常这样暗自思索：我们这些人也同样得入如来法性，为何如来佛不教大乘而以小乘之法度化我们呢？想来想去，我终于明白，原来这都怪我们根性低劣，<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>浅薄，并非世尊对我们小乘人不慈悲。为什么呢？如果我们小乘之人听到佛说成就无上圣智的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，就必然会以大乘法<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，从而以大乘法获得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。但是，我们不了解佛以方便之法，随宜说教，开导<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，所以，刚一听闻佛法，便不折来扣地信奉以假为真，用功修行，得<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>位。世尊，我从修行佛法以来，终日竟夜，常自行克制，不敢放逸。而今从佛这里听闻从未听过、从未有过的妙法，从而断除了心中的诸多疑惑，身心愉快。安稳自得。今天，我才知道自己是真正的<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>，是从佛口所生，从佛法化生，真正得到了如来佛的清净法性。”</p><p>　　这时，舍利弗想复述其义，便说偈道：</p><p>　　我听了如来佛这清净微妙的法音后，得到了从未有过的佛道大法，我心中充满了无比的欢喜之情，笼罩在我心头的一切疑网如今终于尽行消除，多少年来蒙<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>悔，总算未失缺这无上的大乘道法。佛的声音真是珍稀难得啊！它是那么的清净，那么的深远，它能扫除所有众生的所有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，包括我这个已<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>罗汉果位的人，如今听闻了佛说的《妙法莲华经》，也将所有的忧愁与苦恼消除净尽了。</p><p>　　从前，我在山谷之中，树从下面，或者打坐，或者漫步，那时，我常想及此事，未免叹息不已，为什么要以小乘小法自欺自弃呢？我等也是佛的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，同得佛的清净之法，但却不能于将来演说佛有无上道法。佛的金色之身有三十二种常人所没有的殊妙之相，佛具备十种非凡的智力，佛具足八种解脱之法。可是，我们同处佛的清净法性之中，却不能得到授记<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>具备上述<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>的机会。佛还有八种与众不同的微妙身相，他还具备十八种不共它乘的微妙道法，这些唯佛具有的功德，我全都失去了。我在独自慢步之时，发现佛独尊于大众之中，他的名声普闻于十方世界，为众生带来了巨大的福利。可是我却失友了这些利益，我真是自己欺骗自己，还以为自己修行很到家。多少个日日夜夜，我都想起这些事情。现在请问世尊，我这些利益究竟是失掉没有失掉呢？我常见世尊称赞诸大菩萨，因此，我日夜间都在筹算这等事情。</p><p>　　今天，我听了佛的<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>之声，知道佛是随众生的机宜而演说妙法，一切方便法门全归于一乘真实之教。这种清净微妙、不可思议的佛法使众生都能获得菩萨之道。</p><p>　　我舍利弗以前曾执着于一种邪知邪见，要作一切<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>外道的师父。世尊了解我的根基，于是教导我拔除邪见，为人说<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>圣果之法，从而使我除尽一切邪知邪见，证得真空之法。那时，我自以为证到四果阿罗汉就是到达最终灭度的境界了。今天，我才发觉，原来我只是证到偏空之理，而非真正的涅槃。假使我将来作佛时，具足三十二种非凡相状，诸天神、人、夜叉、龙神等皆来恭敬<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，那时，才可谓永尽诸苦，得到了真正的无余涅槃。如今，佛已在大众面前说我将来当要作佛，我听了如是的法音，所有的疑虑和后悔消失殆尽。</p><p>　　回想我最初听佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>时，心中惊异不已，疑团重重，莫非是魔鬼变成佛来扰乱我的心吗？佛对我非常耐心，他以种种因缘、譬喻以及巧妙的言辞为我再三解释演说，他的心犹如大海一样安稳不动，我听了佛的说法后，心中的惊异与疑惑全都断除了。佛对我说，在漫长的过去世中，曾有过无量无数的佛相继灭度。这些佛在其住世教化时，都是按照这方便法门，为众生说这种佛道之法。现在和未来的佛也是无数无量的，他们同样以种种方便之力演说这种 佛道之法。如今的释迦牟尼佛，从降生到<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，从得道成佛到说法教化，也是以各种方便法门，随宜说法，因材施教。世尊现在所说的《妙法莲华经》是真实的智慧，而魔王波旬，他是不会说出这种真理的。由此我知道，肯定不是魔来作佛，只是由于我自己堕入疑网之中，误以为世尊说法是魔所为。</p><p>　　现在，我听到释迦牟尼佛这柔和的法音，它是那么的深远，那么的微妙，由此法音畅出清净的佛法，使我心中充满喜悦。我将永远安住于真实的智慧中。我将来一定会证成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>，受天神和人类的敬拜，我将转无上*轮，教化一切菩萨大众。</p><p>　　这时，佛告诉舍利弗说：“今天，我当着天神、众人、<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>、婆罗门等大众的面告诉你，我曾于二万亿佛以前的灯明佛那里。为了追求无上的道法，经常教化你。你也长夜跟随我受学，我用种种方便法门引导你，从而使你生于人的佛法之中，舍利弗，我过去曾教化你志愿修成佛道，可你如今竟然忘了，反而以为已得到灭度。我今天还想让你记起当初所发的成就佛道的本愿，所以为诸位声闻弟子说此大乘经典，名《妙法莲华经》。这是教化大乘菩萨的法门，常受诸佛的护持与关怀。</p><p>　　“舍利弗，我现在要为你授记：你于未来无数无边的年代当中，将供养亿万个佛，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>奉行佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，具足菩萨所行诸道，从而证果成佛，名号为华光如来，同时具足十大名号，应供，即应该享受人天的供养；正遍知，即正确遍知一切事物；明行足，即具有能知过去的<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>明、能知未来的天眼明和断尽烦恼得大解脱的漏尽明；善逝，即入于涅槃；<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解，即能了知世间一切，从世间获得彻底解脱；无上士，即世间最尊贵者；调御丈夫，即善于说教并引导世间修行的丈夫通往涅槃；<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师，即天和人的导师；佛；世尊。你的佛国名叫离垢，国土平正，清净<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>，安稳丰乐，天人兴旺。大地以琉璃构成，有八交道，以黄金之绳作界，旁有七宝作成行树，花果四季不衰。华光如来也以声闻、缘觉、菩萨三乘之法教化众生。舍利弗，你成佛出世时，虽非浊恶之时，但以本愿之力，故说三乘法门。</p><p>　　“舍利弗，你将来成佛时的劫名叫大宝庄严。为什么叫大宝庄严呢？因为这个佛国中将菩萨作为大宝。该国中的菩萨多得无量无边，不可思议，各种算数和譬喻都难以表述其数量的从多，除过佛的智力之外，没有人能知道到底有多少菩萨。华光佛行动时，有宝莲花承其足下。这个国土上的所有菩萨都不只是刚刚<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>修行的人，他们皆已久植善根，早就种下了诸德之本，因为他们已在亿万乃至无数个佛国世界中修清净梵行，生生世世常受诸佛的称扬赞叹。他们在这些佛面前，经常修行佛的真实智慧，具在巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力，能通达诸法实相，一切行为皆真诚无伪，志念坚定不退。这样的大菩萨充满其国。</p><p>　　“舍利弗，华光佛<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>十二小劫，除过他作王子尚未成佛的时间。该佛国的人民寿命长八小劫，华光佛在十二劫过后，为坚满菩萨授无上圣智之记号。他告诉所有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>们说：这位坚满菩萨将继我之后作佛，名号叫华光足安行如来、应供、正遍知。该佛的国土也像华光佛的国土一样，清净庄严。舍利弗，这位华光佛灭度之后，正法时代为三十二小劫，像法时代也为三十二小劫。</p><p>　　这时，世尊想重复一下上面所说，便诵偈道：</p><p>　　“舍利弗，你将在未来世中证得佛果，成为大智尊，名号叫华光如来，他将在佛位上度脱无量众生。由于他曾供养过无数个佛，具足<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行菩萨之道，身负如来十种非凡智力等诸多功德，多而证悟了无上的道法。经过无量无数劫之后，进入一劫，名叫大宝庄严。那时世界名叫离垢，全国上下一片清净，毫无瑕秽。大地用琉璃构成，界畔由金绳围起。到处是用七种珍宝制成的五彩之树，四季鲜花盛开，果实累累。这个佛国中的菩萨，志念十分坚固，又得巨大神通，具足<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>、持戒、忍辱、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>、智慧等六种波罗蜜。这些菩萨曾在无数佛的面前修习<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，现在又全都接受华光佛的教化。</p><p>　　华光佛作为王子时，放弃王位，舍去了世俗社会的一切富贵荣华，在其最后一次<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a><a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>时，出家修行，证成佛道。这位华光佛住在世间的寿命是十二小劫。该佛国的人民寿命为八小劫。佛灭度之后，正法住世长三十二小劫。在此期间，无量众生得到救度。正法时代结束，是像法时代。像法时代住世也长达三十二小劫。在此期间，<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>广泛流传于世，受到诸天神和人类的普遍恭敬养。华光佛的所作所为，他的事迹大概如此。福慧双方具足的<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>是神圣无比的。华光如来就是你的未之身，你应该欢乐庆幸这一无上大业吧！”</p><p>　　这时，<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>弟子即比丘、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞、优婆夷，以及天龙八部诸天、龙神、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽等参加<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的大众，看见舍利弗在释迦牟尼佛前得受无上圣智的记号，未来将成为华光如来，所以，他们个个欢欣鼓舞，激动不已。他们各自脱去自己身上的华丽衣服，拿来供养于佛。忉利天的天主帝释、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>初禅天之主大梵天王等天帝、天王各与其无数天子也以其微妙的天衣以及曼陀罗、摩诃曼陀等天花供养于佛。这些天神们供养于佛的天衣在空中飘荡回旋，与此同时，千万种天乐在空中齐奏，各种天花纷纷扬扬，空中响起了这样的话语：“释迦牟尼佛往昔于波罗奈国初转<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>*轮，今天则再转最妙最大的*轮。”</p><p>　　这时，诸天子想重宣此义，便说偈道：</p><p>　　释迦牟尼佛往昔于波罗奈国初转四谛*轮，分别讲说苦、集、灭、道以及<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>等各种<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>以及色、受、想、行、识等<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>的合散生灭。今天他又转最妙、最大的*轮，说《妙法莲华经》，在此，佛已去除权智而说实智，不用权宜之法而直说实相奥义。这种极其深奥的法，一般人很难信受。我等诸天子从往昔以来，虽然多次听佛说法，可是从没有听过这样深奥微妙的佛法。今天，世尊讲说此法，我们都很乐意听闻。声闻弟子 中最有智慧的舍利弗尊者如今已蒙佛授记作佛。按照这部妙法的道理，我等诸天子同舍利弗一样，未来必将成佛，成为一切世间中最尊贵、最高尚的圣者。佛道的确是不可思义的，可是佛以其方便之力，随众生的根性，应机说法，引导众生渐入佛道。我们诸天所有的福德善业，包括今世的和过去的以及所有幸运见佛的功德，都将<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>于我们未来成就的佛道。</p><p>　　这时，舍利弗又对释迦牟尼佛说：“世尊，我听了您说的这部妙法，已不再有什么疑惑了。今天我在佛面亲自接受无上圣智的记号，将来当成佛为华光如来。对此我均已领略了其中的道理，并信受不疑。可是在座的一千二百多名声闻弟子均已得到心大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>的程度，这些人往昔在初果、二果、三果的阶位上，修习佛的方便法门，佛常教化他们说，佛法能使众生脱离生、老、病、死的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，得到究竟涅槃的快乐。这些在三果位上的有学弟子和在四果罗汉位上的无学弟子，便也各自因为自己已消除了对自我的执着，对常有的执着、对虚无的执着，从而认为自己已得到了涅槃。而今在世尊面前听到这闻所未闻的无上妙法，他们便都陷入重重疑惑之中。啊，世尊！请您慈悲，为在座的比丘、比丘尼、优婆塞、优婆夷等四众弟子讲讲这其中的原委，以使他们都能远离疑惑与懊悔。”</p><p>　　释迦牟尼佛对舍利弗说：“我先前不是已经说过，诸佛莫不是为了无上圣智而以种种因缘、譬喻、巧言妙辞等方便法门说法吗？所有这些说法形式，都是为了教化各菩萨的缘故。不过，舍利弗，我今天还将再以譬喻的形式解释这种道理，诸位有智慧的弟子就可以从这种譬喻中领略其中的奥旨。”\t\t\t\t</p></div>"
    },
    {
        "title": "妙法莲华经 信解品第四",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　信解品第四</p><p>　　这时，在座的长老须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>、摩诃迦旃延、摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>、摩诃目犍连等大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们从释迦牟尼佛这里听到如此亘古未有的妙法，并亲眼看见释迦牟尼佛为<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗尊者授无上佛智的记号，宣布他将来世作佛，名为华光如来，这些多年跟随释迦牟尼佛修习方便法门的大弟子们有幸参加今日的<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>，莫不叹为稀有，他们内心充满<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>和崇敬之情，一下子都欢呼跳跃起来。他们从座而起，整理好各自的衣服，偏袒着右肩，一齐走到释迦牟尼佛的面前，然后右膝跪地，一心合掌，恭敬曲躬，虔诚地瞻仰释迦牟尼佛的尊颜。接着，他们开口说道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>啊！我们这些人是众僧之首，都已年迈老朽，自以为已得证<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>，不能再肩负其使命了，所以，也都不再积极进取以求无上圣智。世尊啊！从过去到现在您讲经<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的时间已相当长了，我们作为大弟子总是在座听法，慢慢地身体开始疲倦，精神也日益<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。我们一心只想着小乘人的偏空、无人我之相、远离愿求造作，认为这就是最高境界的<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，所以，我们这些老朽之人对于菩萨法门如游戏<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>、<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>净化佛国世界、<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>普度一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>等等，心中并不喜欢。为什么呢？因为，世尊过去说法教化我们，曾说让我们出离欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>等<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>苦宅，得证涅槃妙乐解脱。加之我们现在都已年老体弱，所以对佛所开示的大乘菩萨法门中无上圣智，已没有一点儿好乐之心了。可是，我们今天有幸在佛前听到佛为声闻弟子授无上佛智的记号，心中十分兴奋，因为这说明我等老朽之辈也终将会受记作佛，这的确是闻所未闻的稀有之法啊！我们万万没想到，并未追求的大乘妙法竟今日忽然得到了。</p><p>　　接着，须菩提等上首弟子们又对释迦牟尼佛说道：“世尊啊！我们现在想通过一个譬喻来说明我们心中的感想。譬如有一位男子，年少无知时离开父亲，长期住在其它国家。如此一直到十岁、二十岁以至五十岁。由于年纪已大，加之又很穷因，所以便走南闯北，四处求食乞讨，这样辗转漂流，来到了自己的国家。他的父亲自从失去儿子后，也一直在四下寻找，后来由于怎么也找不见儿子，便在某一城中停了下来，由此就在这里安家落户。慢慢地，家业兴盛，成为远近闻名的富豪，家中拥有无量的财宝，黄金、白银、琉璃、珊瑚、琥珀、玻璃珍珠等宝物取之不尽。家中的几个仓库个个盈满欲溢。许多童仆、臣佐、吏民都受雇执事，令其使唤。他家拥有的象马、车乘、牛羊等更是数不清、出入的利息遍布其它国家，专门为他跑生意的商客也十分众多。</p><p>　　“就在其父家业大振之时，那位贫困潦倒的儿子走乡过村，沿门乞讨，经历许多国家、城镇，刚好来到其父当初所落户的那座城市。多少年来，父亲常常想起自己的儿子，与儿子离别五十余年，但从未向别人提说过这件事。如今，他念子之心更切，经常一个人独自沉思，心中充满无限的悔恨。他自感身体日益老朽，家中虽有大量的金银财宝，仓库甚至都要溢出来了，可没有儿子，一旦命终，所有的财物都将散失，无人可以委付继承。所以，他日夜都在想念自己的儿子。他想，如果自己能够得到儿子，将所有的家产都委托于他，那该是多么坦然快活、无忧无虑啊！</p><p>　　“世尊，就在老父日夜思念儿子的时候，这位穷子作劳工为佣人，在外辗转流离，刚好来到其父的宅院。他站在院门旁边，远远看见父亲坐在师子床上，双脚放在宝几上面。一些<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>、刹帝利、<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>等都毕恭毕敬地站立周围。其父身上装点着价值千万的珍珠、璎珞。仆人手持白拂，侍立左右。床上盖着宝帐，屋里悬挂着花幡，地上洒着香水，到处都摆放着奇花奇草，还罗列着其它许多宝物，出出进进，随时取而予之。如此种种表明这位主人的尊贵和威严。那位穷子看到这种景象，觉得其父气势太大，于是心生恐怖，后悔来到这里。他暗想：这家主人可能是国王，或者是与国王地位相当的人，这不是我受雇作工获得食物的场所，不如到贫穷的地方去，那里出力之活好找，衣食也容易得到。我如果久留此地，有可能受到压迫威逼。想到这儿，穷子便快步走开了。</p><p>　　此时那位富贵的长者坐在师子座上，一眼便认出了自己的儿子。心里十分高兴，心想，这下我的家产可有了付托的人了！过去我日思夜想盼望儿子，一直未能见上。今天，他忽然自己来了，这简直是天遂人愿！我虽然已经年纪老迈，但依然贪爱怜惜自己的儿子和财产。于是这位父亲急忙派人将儿子追回。那位使者一路急跑，拉住了穷子。穷子感到十分惊愕，大喊大叫，抱怨道：我并没有惹你，为何要抓我呢？越是这样，那使者越是强拉硬拖，死活不放。这位穷子暗想，自己无罪而遭捕囚，看来凶多吉少。想到这儿，他就更加惶恐，吓得喘不过气来，一会儿便跌倒在地。父亲在远处看到这种情形，便对使者说：不需要此人了，请勿强行拉来他。后来，使者用冷水洒在穷子的面部，使其清醒过来。其父也不再与他说任何话，为什么呢？父亲知道自己的儿子志向低劣，性格自卑，自己的豪强富贵，儿子一下子很难适应。经过审慎分析后，他决定用方便权宜之法引导自己的儿子，并不告诉别人这是他的儿子。使者见穷子苏醒过来，便对他说：我现在放你走，你愿意去哪儿就去哪儿吧。穷子一听，自然十分高兴，也深感意外，急忙到贫穷的地方自求衣食度日去了。</p><p>　　须菩提等上首弟子接着讲道：“那时，长者为了诱引其儿子而设计了一套权宜方便之法，他密遣两个形色憔悴又无威德气势的人，临行时嘱咐二人说：你们去了之后可以语气缓和地告知穷子，就说这里有活可干，并加倍付给报酬。穷子如果同意，就可将其带来，让他在这里干活。如果人问干什么活，就说雇他打扫粪便，我们二人也同你一起干活。这两人听罢，立即去寻找那位穷子，找见之后，便按照长者的吩咐，一五一十地向穷子敍说了一遍。穷子听后，表示同意，于是先拿了工钱，接着便与二人一同扫除粪便。其父看见儿子后，既怜悯，又责怪。一天，父亲从窗户之中远远看见儿子的身躯，只见儿子一副消瘦憔悴的模样，满身粪渍尘土，污秽不净。这位父亲便脱去璎珞点缀的上等衣服和其它珍贵器具，换上破旧的衣服，手里拿着扫粪便的器具，装出畏畏缩缩的样子，来到扫粪便人中间，对他们说，你们都干活勤快点，不要懈怠。父亲便通过这种办法接近其子。过了好长时间，父亲又找到儿子，对他说：嗨！小伙子，你常在此干活，哪里也不去，当增加你的工钱。以后，你所需要的盆器、米面、盐醋等东西都无须担心，我会叫人随时送给你的，需要多少就给多少，你可放心下来。你可以把我当成你的父亲，请不要再有什么忧虑了。为什么呢？我年纪已经很大了，而你还年轻力壮。你平常干活时，从未有过欺骗、懈怠、恼恨和怨言等各种劣迹恶行，与其它作活的人是大不一样的。从今以后，你就如同我亲生儿子。这时，穷子虽然非常欣喜自己能遇到这等美事，但心中仍自认为是受雇劳作于他家的贱人。所以，在二十年当中，他一直干着清除粪便的工作。经过这么长时间之后，穷子的内心与外表都体现出<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，出进<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>大方。不过，他所干的仍是原来的工作，地位也未发生根本的变化。</p><p>　　须菩提等人接着又说：“世尊，有一天，那位长者忽然病倒，他自知死期不远，便对穷子说：我如今拥有大量的金银珍宝，各个仓库也都装行满满的。到底有多少财物，哪要拿出支付开销，这些你都知道。我的这种心情，你应当明白。为什么呢？今天，我与你已没有区分，你应更加用心，不断提高自己，不要再松懈后退了。听罢此言，穷子立即接受教敕，直接管理各种财物以及金银珍宝和各个仓库，但他并没有谋求一餐的意思。虽然他已掌握了所有财物，但他所达到的内在层次仍然与扫粪便没有多少分别，他的下劣之心也并没有舍去。又经过一段时间，父亲知道儿子的意境已泰然自若，可以成就远大的志向，而对于原来下劣之心业已反省认识，自我摈弃。这位长者<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>时，将自己的儿子以及亲族、国王、大臣、刹帝利、居士等全都召集来，向他们宣布说：‘诸位仁君应当知道，这位男子是我的儿子，我亲生的儿子。当年曾在某城中离我出逃，五十余年，孤身一人，受尽辛苦。他原叫某某，我名叫某甲。过去，我曾在本城满怀忧伤，四下寻找，没想到忽然在此相遇。他确实是我儿子，我确实是他父亲。如今，我所有的一切财物都归这位儿子所有。此前家中的各项收支，这位儿子也都知道。’世尊，此时，穷子一听其父此言，顿时大喜，叹为三生难得之事。他心中激动地想：‘我本来并无仰慕追求之心，如今这丰富的宝藏竟自然而得。’\t\t\t\t</p></div>"
    },
    {
        "title": "妙法莲华经 药草喻品第五",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><h2>白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></h2><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><h3>　　药草喻品第五</h3><p>　　这时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>对摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>及诸大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>说：“好！好！迦叶善于演说如来的真实<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。诚如迦叶所言，如来有无量无边不可思议的功德，你们即使于无量亿劫之中不停地敍说，也是说不尽的。迦叶弟子啊，你应该知道，如来佛是诸法之王，凡是他说的，都是真实无误的。他以无上圣智作根本，以方便权巧为方式演说出一系列的佛道妙法，这些法皆可通到无所不知的佛智境地。如来佛通过其<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>观察而了知一切法的归趣，对一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的内心世界，也了如指掌，通达无碍。对于诸多法门，如来佛已门门穷究，条条彻悟，所以，他能开示一切智慧。</p><p>　　“迦叶，譬如在<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>之中，山川、河谷、大地所生长的卉木丛及各种药草，名称各异，颜色不同，种类繁多。在它们的上面，密云弥布，遮盖了整个大千世界。一时间，大雨齐下，雨水平等均匀地滋润到大地的每一个角落。但大地上所生长的卉木<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>和诸种药草却根据其根、茎、叶的大、中、小不同，而各自接受其所得的一份。虽是一云所雨，但各自都依其不同的品种特性而得以生长、开花、结果。所以，一地所生，一雨所润的花草树木却是各不相同的。</p><p>　　“迦叶，你应当知道，如来佛也是如此，他应时出世，犹如天空起云一样。他宏亮的声音普闻于一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的天神、人类和阿修罗当中，就像密云遍布大千世界各个角落一样。如来佛在所有大众之中发出了这样的声音：‘我是如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛，世尊。众生之中，凡是未灭度的，我将使其灭度；凡是未<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的，我将使其解脱；凡是未安稳的，我将使其安稳；凡是未<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>的，我将使其涅槃。我了知今世和后世的一切真实情况，我是一切知者，一切见者，我是知道者、开道者、说道者。你们这些天神、人类、阿修罗等大众都应该到这里来听我讲经<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。”</p><p>　　这时，无数众生纷至沓来，齐集佛的住地，听经闻法。如来佛当即观察这些众生的聪慧与愚钝、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>与<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>等不同情况，并根据他们所能接受的程度而别宣说无量法门，其目的都是要使众生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>信受，很快受益。这些众生听过如来说诸法后，现世必将安稳，后世可生天上或人间的富贵处。因为<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>如来道法可获得快乐，所以就应闻此法，闻法之后，即可远离种种<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障碍。在各种法门之中，众生根据各自的力量渐渐入道，就好像大千世界的云雨一样，一切卉木丛林和药草皆在各自不同的种姓之下，具足滋润，各得生长。“如来佛说法的最终归趣是一相一味。一相即真如实相；一味即无所不知的佛智。实相即解脱相、远离一切颠倒相，也即是寂灭相。如果有众生听闻如来<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>后，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、读诵，依法修行，他由此所得的功德自己是很难觉知的。为什么呢？因为只有如来佛才知道此人所种的不同种子和此人的内部本质属性，知道他忆念何事、思惟何事，修行何事；知道他以何法忆念、以何法思惟、以何法修行；知道他习什么法并由此而得什么法。众生处于种种境界，唯有如来佛可以如实得见，明了无碍，好比花木药草并不知道自己的上、中、下品性。</p><p>　　如来佛知道这种吟唯一实相、唯一佛智之法，所谓解脱相、离一切相、寂灭相、彻底涅槃相，究其质，终归于空。佛了知这种妙理后，又观察到众生内心的各种欲念，所以，为了保护无上妙法不至为这些心性尚低的众生的诽谤，佛一开始并不急于为众生讲说至高无上的佛智。迦叶啊，你们这些人真是少有，能知如来随众生之机宜和根性而为之说法，所以也能相信如来的法，能受持如来的法。为什么这么说呢？因为诸佛随宜说法，是难解而难知的。”</p><p>　　这时，世尊欲重宣以义，便说偈道：</p><p>　　破除万事万物实有观念的如来佛，来到这个世间，随顺众生的各种欲念，而说各种各样的法门。如来佛是至尊至贵的，他的智慧深邃而悠远，可他长期以来将其道法中最要害的东西一直默默地藏在心中，始终不急于为众生宣说。因为有智慧的人听了，能够理解并相仰，而那些没有智慧的人听了，就会疑惑不信，从而永远失去最终解脱的机会。所以，迦叶呀，如来佛便根据众生所能接受的程度，利用各种各样的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而善巧说法，使众生皆能逐渐获得正解的见解。迦叶，你应当知道，譬如世间出现密云、覆盖了整个大地，这种象征智慧的密云，饱含着雨霖，电光闪烁，雷声远震，一场滋润大地的瑞雨即将来临，众生心中无不喜悦。此时，日光掩蔽于密云之中，大地一片清凉，浓云低垂，似乎举手可及。一时间，瑞雨均匀地降落到四面八方。此雨取之不尽，流注无量，整个大地无不滋润。恬不知那些生长在山川险谷以及黑暗隐蔽之地的花木药草、大小诸树、谷物禾苗、甘蔗葡萄等无不充分而透彻地享受到这场瑞雨的滋润。干旱的大地一片湿润，药草树木并茂并盛。这片密云所出之雨水是同一无二的味之水，所有的草木丛林各依其本份接受滋润。一切树木分为上、中、下三等，各依其大小而得到生长。草木的根、茎、枝、叶、花果的五光十色，皆因同一雨水的浇灌而得到鲜嫩或光泽。花草树木的体相有的大小不同，所以，虽然是一雨所润，但各自却获得了不同程度的生长或茂盛。</p><p>　　“如来佛也是如此，就像密云遍覆大地一样出现在这个世界上，为众生分别演说各种法最真实、最<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的教义，大圣世尊在诸天和人类的一切众生当中宣告说：我是如来，<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>双方具足。我出现于世间，犹如大云一样，滋润一切枯槁众生，使他们都能脱离<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>苦难，获得安稳快乐，包括世间之乐和出世间的涅槃之乐。天界和人类之中一切善于听法的众生都应该到这里来瞻仰、<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>无上尊贵的如来佛。我是一切世间中的至尊，没有谁会超过我的地位。为了安稳众生，我才出现于世，为大众讲说如同<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>一般清净的圣洁妙法。这种妙法只有一个宗旨，就是使所有众生获得解脱，证入涅槃。如来佛以一种清净妙音，演说法义，流畅通达。为了至高无上的大乘佛道，他经常是通过各种因缘来随宜说法。</p><p>　　“如来佛认为一切众生普皆平等，所以没有任何爱此憎彼之心。我没有任何贪着，所以也没有任何障碍，我恒久不息地为一切众生平等无别地讲经说法。我对一人这样说，我对众人也这样说。除说法之外，我再无别的事情，所以，无论是来是去，是坐是立，我始终不知疲倦，不厌其烦地讲经说法以满足世间一切众生的需要。就好像天雨普润大地万物一样，我讲经说法也是平等无别地针对所有众生的，无论贵贱和上下，无论持者还是毁戒者，无论威仪具足还是不具足者，无论持正确见解者还是持谬误见解者，无论聪明伶俐者还是愚钝无知者，我都平等无别地施予他们佛法之雨，而没有一丝懈怠和疲倦。</p><p>　　“所有一切众生，凡是听闻过我说法的，都会根据他们的接受能力而闻法受益，各处不同的境地。有的处于人和天的境地，如人间的国王，天界的帝释、梵天等天王等，这些众生如同小药草一样。他们知清净佛法，能得涅槃<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，可获六种<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>和三种明达。有的众生独处山林，经常修习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>缘觉果位。这些众生如同中等药草一样。有的众生求佛而来到世尊的处所，他们希望自己将来也能<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>，并为此而修行精进，禅定等大乘法门。这些众生如同上等药草一样。有的<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>专心学习佛道，经常从事慈悲济世之事，坚信自己未来也可成佛。这些众生如同小树一样。有的众生能安住于各种神通，转不退之*轮，讲经说法，普度无量亿众生，这些菩萨如同大树一样。</p><p>　　“如来佛平等说法，好似一云所下的一味之雨，众生各依其根基大小而接受不同的程度，就像那些药草树木一样，同得滋润而所受各异。如来佛以此为喻，进行权巧开示，以种种言辞演说一乘妙法，这在佛的无量智慧当中，犹如沧海之一粟。我施的法雨充满世间的各个角落，此法雨即一乘妙法，众生根据其各自的接受能力而进行不同层次的修行，如同药草树木各随其大小而接受不同的雨量，从而各自逐渐生长壮大。</p><p>　　“诸佛的妙法常以一乘之味使一切世间的所有众生都得到充分品尝，他们依法渐次修行，都能成道<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。声闻和缘觉弟子处于山林之中修行，他们听法之后获得罗汉果位，现世之身已是<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>果报中的最后一身，来世即进入涅槃解脱之境。如同药草经过天雨的滋润而各自得以生长壮大。诸多菩萨具有坚不可摧的智慧，他们对欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>的一切均明察无碍，他们的目标是求得至高无上的佛乘，这些菩萨好比小树受雨而得增长一样。还有一些在禅定中获得神通之力的众生，他们一听到诸法空相，心中非常喜欢，身放无量宝光，普度一切众生，他们好比是大树，也一样承受天雨而获增长。如此看来，迦叶，佛说的法好比是天空中的密云，以其一味之雨滋润于人这种花，从而使他们各得成长，开花结果。迦叶，你应当知道，通过各种因缘、各种譬喻来开示佛道妙法，是我的方便权巧之力，一切佛也都是如此。今天，我为你们宣说最真实的情况，所有的声闻大众都没有获得真正的灭度，你们所修行的是大乘<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，只要你们循序修学，将来都会证果成佛。”</p></div>"
    },
    {
        "title": "妙法莲华经 授记品第六",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　授记品第六</p><p>　　<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说完如上偈语后，对参加<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的所有大众宣告说：“我的这位<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>将来在未来世朝见三百万亿个佛，个个都悉心<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>、恭敬、尊重、赞颂，并广泛宣传这些佛的无量大法，终于在其最后一次<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>之身时<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a><a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>，名叫光明如来，应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊等十种名号具足。那时的国名叫光德，所处的的劫名叫大<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。光明佛的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>十二小劫，佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>流传于世二十小劫，相似正法但缺乏证悟的像法流传于世也二十小劫。光明如来的佛国庄严华丽，没有污秽恶浊，也没有瓦砾和荆棘，甚至没有大小便等不干净的排泄物。国内土地平正，没有高低差别，没有坑坑坎坎，没在土堆和小山。整个大地全部用琉璃铺成，七宝之树行行排列，大道两旁围着黄金制作的宝绳。全国上下，处处宝花飘散，芬芳无比，一片洁净。光明佛国之中有无量亿菩萨大众，声闻弟子也是无量无数。这里没有魔障，没有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，虽有魔王和魔民，但他们都接受了<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，所以都不再破坏佛法，反来保护佛法。”</p><p>　　宣布完毕之后，世尊又想再说一遍，便以偈语形式说道：</p><p>　　“诸位<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，我现在向你们宣告，我以佛眼看见，这位迦叶弟子将于来世中经历无数劫之后，证果成佛。在其成佛之前的整个来世当中，迦叶将朝见并供养三百万亿个佛。为了获得佛的无上<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，他清净<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，在供养至高无上、<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>具足的如来佛之后，修习所有一切最高最妙的智慧，终于在其最后一次轮回<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>身时，证成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。该佛国内琉璃铺地，一片清净；宝树众多，排列道旁；黄金作绳，围绕大道。人们看到这种庄严的国土，无不欢快喜悦。该佛国常常散发着芬芳的香味，各种名花随处可看，还有其它各种稀奇微妙的东西都在庄严着这个美丽的国土。光明佛国内大地平坦没有丘陵坑洼。国中菩萨大众多得不可计量，他们的心地都很调顺柔和，他们得到了许多巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力。这些菩萨都奉行<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>诸佛所说的大乘经典。一切声闻大众都获得了清净无烦恼、将进入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>永远摆脱轮回的最后果报之身，他们成为法王如来佛的儿子。这些人也多得不可计量，即使以天眼观看，也是数不清的。光明佛的寿命是十二小劫。佛灭度后，正确无误的佛法将流传于世二十小劫。次于正法，缺少证悟的像法接着正法流传于二十小劫。光明世尊的情况即是如此。”</p><p>　　听了释迦牟尼佛的上述宣告，大目犍连、须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>、摩诃迦旃延等弟子都深感震惊，他们虔诚地合起掌，目不转睛仰望着世尊，异口同声地说偈道：</p><p>　　“世尊啊，您是世界上最威猛的大英明圣雄，您是一切释子们的法王，请您大发慈悲，哀怜我等弟子，赐给我们佛的庄严声音吧！您可知道我们心里想着什么，我们看见摩诃迦叶得到佛的授记，就好像佛以<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>洒到我们身上，消除一切热恼，感到阵阵清凉。好比某人来自饥荒盛行的国家，忽然遇到了大王所吃的饭食，虽然垂涎三尺，但心中依然怀着疑虑和恐惧，不敢立刻就把那些饭吃了，若能得到国王的命令，那才敢去吃食。我们也是这样，常常想到小乘的过失和不足，却又不知如何获得无上智慧。虽然听佛说我们都可成佛，但心里还总感到忧虑和恐惧，就好像饥饿者遇到国王的饭食而不敢立刻就吃一样。我们这些人如果能蒙佛授记，那时才会十分<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>和安稳。世尊啊！您是威猛无比的大英雄，您总是想让世间的一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>都获得安稳和快乐，现在就请您赐给我们成佛的记号吧！我们此时此刻就像饥饿的人需要教导之后才敢吃食一样。”</p><p>　　此时，世尊知道诸位大弟子心中所想念的是什么，于是对诸比丘宣言告说：“这位须菩提弟子在未来世中，将朝见三百万亿那由他（注：数量词，相当于一亿）个佛，并供养、尊敬、赞颂，时刻修持清净梵行，具足菩萨的<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行，在其最后一次轮回果报身时将证果成佛，名号叫相如来，同时还具足十号，即应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。当时的劫名为有宝，国名为宝生。该佛国土地平正，琉璃铺地，宝树庄严，没有土丘和坑洼，没有沙砾和荆棘，也没有大小便的污秽。各种各样的宝花覆盖着大地，到处清净无染。该佛国中的人民都居住在七宝台上用珍宝造成的美妙楼阁之中。国中的声闻弟子无量无边，即使再大的数字和再多的譬喻也不能测知其数。菩萨众生也有无数亿那由他之多。名相佛的寿命是十二小劫。佛灭后，他的正法流传于世二十小劫。正法之后，没有证悟的像法也流传于世二十小劫。这位名相佛经常在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中为大众<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，度脱了无量菩萨和声闻大众。”</p><p>　　这时，世尊欲重宣其言，便说偈道：</p><p>　　“诸位比丘，你们都应专心一意听我说，现在我向你们宣告：我的大弟子须菩提未来将会作佛，号为名相如来。他在未来世中，将供养无数万亿个佛，并随佛修行，常行佛行，常修佛修，从而逐渐达到成佛的大道，终于在其最后一次轮回果报身时，得道成佛，具足了如来佛的三十二种非凡相貌，犹如宝山一样端正而殊妙。该佛国土，庄严清净，名列第一，众生见了，无不喜欢。名相佛在其国中说法教化，将救度无量无数的众生。那里菩萨很多，个个聪明伶俐，人人转不退之*轮，说法普度众生，所以，该国总是由菩萨来进行庄严的。本佛国的声闻大众多得不可计数，他们都获得了悉知过去、未来和断尽烦恼的三种明达和天眼、天耳、他心、<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>、神足、漏尽等六种神通，同时还<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>了八种<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，具有很大的威德，该佛说法时，能显现出无量种不可思议的神通变化。如恒河沙数之多的天众和人民，都双手合十，一心听受佛的教诲。名相佛寿命达十二小劫。佛灭后正法行世二十小劫。正法之后，像法行世也二十小劫。”</p><p>　　这时，世尊又对诸比丘宣告说：“我今天对你们说，这位大迦旃延于未来世将用各种供养侍奉八千亿佛，个个都尽情恭敬，至诚尊重。这些佛逝世后，大迦旃延都为其建起高一千由旬、横坚长宽各五百由旬的佛<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>。这些佛塔皆用黄金、白银、琉璃、砗磲、玛瑙、珍珠、玫瑰等七宝砌合而成，并以各种鲜花、璎珞、泥香、末香、<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>以及用丝绸作成的宝盖、憧、幡等进行供养。在此之后，大迦旃延还将供养二万亿佛，其过程也和供养前面的诸佛一样。供养这些佛之后，大迦旃延将具足菩萨之道，最终证果成佛，名号为阎浮那提金光如来，并具足十号，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。该佛国内，土地平正，玻璃为地，宝树庄严，黄金为绳栏于道旁，妙花盖地，一片清净，众生见到这种庄严景象，无不欢欣鼓舞。此佛国中，没有四种恶道，即<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生、阿修罗，多有天神和人类，尤其是声闻众和菩萨众更是无量万亿之多，他们都在庄严着这个佛国世界。此佛寿命是十二小劫。佛灭后，他的正法流传于世二十小劫。次于正法的像法也行世二十小劫。”</p><p>　　这时，世尊欲重宣此言，便说偈道：</p><p>　　“诸位比丘，你们都专心听着，我所说的都是真实不虚、恒常不变的。这位迦旃延弟子将在未来世中以各种各样美妙的供具供养大量的如来佛，这些佛灭度后，他分别建造七宝塔，并以各种花香供养诸佛真身<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>，终于在其最后一次<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>身中，获得佛的智慧，证悟了无上圣智，从而即身成佛。该佛国土地清净，经佛度脱的众生有无量亿万之多，所以该佛受到十方一切众生的虔诚供养，佛的光明能战胜一切，故其名号为阎浮金光。佛国内有无量无数的菩萨和声闻大众，他们都已经断除了对一切外相的执着，通过各种清净的修行庄严这个伟大的佛国世界。”</p><p>　　这时，释迦牟尼佛又向大家宣告说：“我现在告诉你们，这位大目犍连弟子将在未来世中，用各种供具来供养八千位如来佛，悉皆尽心恭敬，虔诚尊重，这些佛灭度之后，大目犍将为他们各建塔庙。这些塔庙，高一千由旬，长宽相同，皆五百由旬，全由黄金、白银、琉璃、砗磲、玛瑙、珍珠、玫瑰等七宝砌合而成。塔庙中还以各种花朵、璎珞、泥香、未香、烧香以及丝绸作的宝盖、憧、幡等进行供养。在此之后，大目犍连还将再供养二百万亿诸佛，其具体经过与前相同。至此，大目犍连将证果成佛，名号为多摩罗跋·檀香如来，同时具足十号，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。当时劫名叫喜满，国名叫意乐。国内土地平正，琉璃为地，宝树庄严，珍珠之花空中飘散，到处都非常清净，谁看见了都会满心欢喜，流连忘返。这里，天神和人类很多，菩萨、声闻二圣更是无量无数。此佛寿命二十四小劫。佛灭度后，佛的正法流行于世四十小劫，接着是缺少证悟的像法时代，像法流行于世也长达四十小劫。”</p><p>　　接着，释迦牟尼佛又以偈颂形式说道：</p><p>　　“我的这位大目犍连弟子将在舍去此身之后，先遇见八千个佛，接着又遇见二百万亿个佛。为了追求至高无上的佛道，大目犍连尽心尽力地供养、恭敬每一个佛，并在这些佛面前，修持清净梵行，奉行受持诸佛之法长达无量数劫。诸佛灭度之后，大目犍连又分别为他们用七种珍宝建起舍利宝塔，并用黄金作成长长的塔刹，还以花朵、诸香、伎乐等来供养这些塔庙。由此，大目犍连渐渐具足了大乘菩萨的六度万行，从而在意乐国中证果成佛，<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>为多摩罗·檀香。佛寿长二十四劫，在此期间，该佛常为诸天神和人类演说佛道。国中声闻弟子极多，犹如恒河之沙一样无量无数，他们人人具足三种明达、六种神通，个个都有巨大的威德之相。那里的菩萨也多得数不清，他们志向坚定，勇猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>，都得到了佛的无上圣智，永不丢失。该佛灭度后，佛的正法流行于世四十小劫，随之而来的像法时代也长达四十小劫。</p><p>　　“我的诸大弟子中，有五百位具足了威德之相，他们都将获得授记，于未来世，皆当成佛。我和你们因为有前世的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，所以，我今应当为你们说出此法，你们可要仔细谛听。”</p></div>"
    },
    {
        "title": "妙法莲华经 化城喻品第七",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　化城喻品第七</p><p>　　释迦牟尼佛告诉诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>说：“在过去无量无边不可思议阿僧·（注：表示时间的数量单位，意为无数）劫，有一位名叫大通智胜的如来，具足佛的十号之德，即：应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。当时的国名叫好城，劫名叫大相。诸位比丘：此佛自从进入不生不灭的<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>境界以来，已经有极其久远的年代了。譬如有人将此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>的所有国土，磨成的写字用的墨汁，如此经过东方一千个国土时，洒下一点如微尘大小的墨汁。再过一千个国土，又洒下一点墨汁。按照这样的方式，洒尽所有的墨汁。如此说来，你们认为这国土多不多呢？即使算术师或算术师的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们，他们能算到尽头得知其数吗？”诸比丘回答说：“不可能，世尊。”佛接着又说：“诸比丘，如果把此人经过的国土，包括洒上墨点的和没有洒上墨点的，都全部再磨为微粒之尘，一尘算作一劫，那么，此佛自从灭并以来所经过的劫数，要比这个劫数多出无量无边百千万亿阿僧·劫。由于我具足如来特有的知见之力，所以，在我看来，如此久远的劫数也如同今日一样，并不长久。”</p><p>　　这时，释迦牟尼佛欲复述其义，便诵偈道：</p><p>　　“我想起在过去世无量无边劫的时候，有位福、慧具足的佛，名叫大通智胜。假如有人竭尽全力将此大千世界所有国土全都磨成墨汁，然后过一千个国土，洒一点墨汁。如此，将所有的墨汁全部洒完，一点墨汁即一千个国土。再这所有的国土包括点上墨汁的和未点上墨汁的，全都磨成微尘，一尘算作一劫。大通智胜如来灭度以来所经过的劫数比此劫数还多。我释迦牟尼佛具足<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，悉知大通智胜佛及声闻、菩萨久远劫前的灭度如同今日灭度一样。诸位比丘，你们应当知道，佛的智慧是极尽微妙，绝对纯净，所向无碍的，它可以通达无量数劫。”</p><p>　　释迦牟尼佛又告诉诸比丘说：“大通智胜佛<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长达五百四十万亿那由他劫。本来，该佛在端坐<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>道场，破除一切魔军的扰乱之后，即可获得无上圣智，但他那时却尚未成就佛道，<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>也未出现于前。如此经过一小劫，以至十小劫，大通智胜佛始终结跏趺坐，身心不动，但佛法依然未能出现于前。这时，忉利天上的天人在菩提树下为佛铺设了一由旬高的师子座，佛将于此座上获得无上圣智。就在大通智胜佛刚坐到此师子座上时，诸位梵天王撒下各色天花，散落于佛座四周一百由旬的地方。一阵阵香风吹去了萎谢的花朵，新的天花又纷纷而下。如此持续不断达十小劫，以鲜花<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>于佛。甚至一直到该佛灭度，他们还是照常地散下天花。与此同时，四在天王等诸天神常击天鼓，其余诸天神常鸣天乐，他们以此方式供养于佛，长达十小劫，一直到该佛灭度也是如此。诸比丘，大通智胜佛经过了十个小劫，佛法才出现于前，他才最终<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无上圣智。</p><p>　　“大通智胜佛未<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之时，有十六个儿子。第一位儿子名叫智积。每个儿子各有其种种奇异的珍玩之具。他们听说父亲已证得无上圣智，于是都放弃了自己的珍宝，前往佛呆的地方。这些儿子的母亲依依不舍，她们流着泪，一同为儿子们送行。他们的祖父即当时的国王与一百名大臣及亿万人民前呼后拥地来到佛的道场，以便亲近大通智胜如来，并供养、恭敬、尊重、赞颂这位如来佛。他们到达佛的住地之后。全都五体投地，<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜，并绕佛三匝，以示敬礼，然后，看着世尊，用偈语赞颂佛说：</p><p>　　“世尊啊，您是世间最有威德的圣者，为了救度十方受苦受难的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，您不惜于无量亿劫之中坚苦<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，终于<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a><a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。您从前所发的一切誓愿，如今皆已<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>实现，这真是太好了！太吉祥了！世尊啊，您真是稀有难得，您一坐就是十小劫，而身体和手足仍寂然安住不动。您的心远离一切颠倒梦想，没有一点污染的尘垢，您是那么的淡泊宁静，从未有过一丝散乱。您已得到了永恒的圆觉，安住于清净纯洁的圣法之中。今天，我们看您安安稳稳地成就了佛道，使我们都得到了很大益处，所以我们怀着万分激动的心情庆祝这一盛事。我们这些芸芸众生，总是处在各种苦恼之中，我们如同盲人一样在黑暗中苦苦挣扎，没有指引我们前进的导师。所以，我们既不认识脱离苦难的道路，也不知道如何求得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，避免这无边无尽的<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。在漫漫长夜之中，我们昏昏噩地造下了许多罪业，从而不断增加了<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a><a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生等恶道的可能性，不断地减损着进入天神行列的希望。在恶道之中颠倒沉沦的众生，被无明<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>遮盖了智慧的双眼，他们从昏暗走向昏暗，从愚昧走向愚昧，永远连佛的名字都听不到。如今，我佛得到了至高无上、安稳清净的佛道，我们和一切天人大众如同黑暗中看到了明灯，为了得到最大的利益，所以，我们全都叩首致礼，一心一意地<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>于您这位无上的世尊。”</p><p>　　十六位王子以偈语赞颂完大通智胜佛之后，便劝请佛为他们讲经<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，他们异口同声说道：“世尊啊！请您为我们演说无上妙法，令我们一切众生都得到安稳。请您怜悯并<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>一切天众和人民吧！”接着，他们又以偈颂形式说道：</p><p>　　“世尊啊！您是无与伦比的大圣雄，您以百种福德自我<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>，相貌殊妙，威仪无缺，您所得到的智慧是至高无上的。愿佛为世间一切众生说出微妙之法，使我们及其它各种类型的众生都能速离<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>，早登觉岸。现在，就请佛分别开示，令我们也得到这种无上的智慧。如果我们能够证得<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>，其它一切<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生也就同样证得佛果。世尊，您知道众生内心深处所想念的是什么，您也知道众生所行之道，您还知道众生智慧力的大小以及他们的欲望、乐趣、所修之福和前世所行之业。世尊啊！您对众生的一切都了如指掌，现在就请您为我们转无上之妙*轮吧！”</p><p>　　释迦牟尼佛对参加<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的诸位比丘继续说道：“那时，大通智胜佛获得无上圣智，从而证果成佛，十方之内各有五百万亿佛国世界顿时发生了六种震动。在这些佛国之内，那些日月亮光所不能照到的幽暗之处，都同时现出光明。在这些地方的众生也都各得相见，所以，他们都这样惊讶地说：‘这里忽然从什么地方来了这么多众生？’另外，在这些国土的范围内，诸天的宫殿乃至梵天的宫殿皆产生了六种震动，光明普照整个世界，亮度胜过了日月之光。这时，东方有五百万亿国土中的梵天宫殿皆得光明照耀，其光胜过通常的光好多倍。所有的梵天王都这样想：‘今天宫殿中的这种光明过去从未有过，是何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>能出现如此的瑞相呢？’于是，所有的梵天王便立即相互拜访，共同议论此事。此时，他们当中有一位梵天王，名叫救一切，他为所有的梵天大众说出一首偈语：</p><p>　　‘我们宫殿之中的这种光明过去从未有过，这到底是什么因缘，我们应当共同寻求这光明的来源。依我推测，这也许是某一位大德<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>出世了，或者是有佛出现于世，因而才有如此的光明，照遍了整个十方世界。’</p><p>　　释迦牟尼佛接着说：“那时，东方五百万亿国土中所有的梵天王随身带着他们各自的宫殿，又用衣服盛满了天花，一共到西方去，推究探寻这种光明的来源。他们在遥远的西方看见大通智胜如来正坐在菩提树下的师子座上，许多天神、龙王、干闼婆、紧那罗，摩·罗伽、人非人等都非常恭敬地围绕在佛的周围，他们还看见十六位王子正在请佛说法。于是，这些梵天王们立即用其头面<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>之足，并绕佛百千圈，还以天花散在佛的身上。所散的天花犹如须弥山那么多，同时，他们还以天花来供养佛的菩提树。菩提树高十由旬。用天花供养之后，他们又以各自的宫殿奉献于佛，然后说：‘请佛慈悲哀悯我们，饶益我们。我们所奉献的宫殿，希望您能够接受。’这时，所有的梵天王就全都跪在佛的面前，怀着同样的心情异口同声地诵偈说：</p><p>　　‘世尊啊！您是世上最稀有的圣者，要想遇见您那可真是太难了。您具足了无量的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，能够救护一切众生。您是诸天和人类的伟大导师，能哀愍世间所有众生，使他们都能蒙受益处。我等梵天王从五百万亿国土而来，我们都舍弃了<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>入定的乐趣，就是为了来供养您。由于我们先世修下了福业，从而获得如此庄严的宫殿。今天，我们就将这心爱的宫殿奉献给您，惟愿您能哀悯我们的一片苦心，接受我们的这种供养！’</p><p>　　诸梵天王诵完偈后，又各自说道：‘惟愿世尊能为我们讲经说法，以度脱一切受苦难的众生，为他们开示一条通向涅槃的大道！’接着，所有的梵天王又一心而同声地诵偈道：</p><p>　　‘世尊啊！您是福、慧双足的无上圣尊，惟愿您能为我等众生演说佛道妙法，希望能以世尊大慈大悲的力量，来救度一切受苦难缠缚的众生，使他们早脱苦海，超登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>！’</p><p>　　这时，大通智胜如来便默许了他们的请求。”</p><p>　　释迦牟尼佛又说：“另外，诸比丘，东南方五百万亿国土中的所有梵天王，都发现各自的宫殿光明照耀，从未有过，他们个个欢欣鼓舞，叹为稀有。于是，诸梵天王便立即相互拜访，共议此事。这时，他们之中有一大梵天王，名叫大悲，为诸梵众说出一首偈语：</p><p>　　‘这件事到底是什么原因？为什么会出现如此的瑞相呢？我们宫殿过去可从来没有这样灿烂夺目的光明，莫非是大德从天上降生了？抑或是佛出现于世间？我们从没有见过这样美妙的境界，所以就让我们大家一起来推测它的来源吧！经过千万亿个国土，寻找这光明的源头，那里肯定是有佛出世，他将救度一切苦难的众生。’</p><p>　　这时，五百万亿梵天王各自随身带着他们的宫殿，并各以其天衣盛着五光十色的天花，一同向西北方向去索寻这种瑞相的起源。在遥远的东南方有一个佛国，诸梵天王在此看见大通智胜如来正坐在道场内一菩提树下的师子座上，诸天神、龙王、干闼婆、紧那罗，摩 罗伽、人非人等都非常恭敬地围绕在佛的周围。诸天王还看见十六位王子正在请佛说法。这时，所有的梵天王都上前以其头面礼佛之足，并绕佛百千匝，以示崇敬，然后还用天花散在佛的身上。所散的天花如须弥山一样众多。他们还将天花拿来供养佛的菩提树。以花供养之后，梵天王们又各以其宫殿奉献给大通智胜佛，并说：‘惟愿佛慈悲哀悯我们，饶益我们。现在我们就把我们最心爱的宫殿奉献您，希望您能够接受。’接着，诸梵天王便在佛面前一心而同声地以偈颂赞道：</p><p>　　‘世尊啊！您是圣中之主，天中之王。您说法的声音就好像好声鸟在鸣叫，非常悦耳动听。您是哀悯众生的大慈悲者，我们五百万亿梵天王现在向您敬礼。世尊啊！您是多么的难遭难遇啊！因为佛都是经历极其久远的劫数之后才出现于世的。从古到今已有一百八十劫没有佛出世了。由于没有佛的<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>指迷，越来越多的众生堕落于地狱、饿鬼、畜生三恶道之中，而<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>善道成为天神者却一天比一天减少。如今。这个悲惨的世界终于迎来了佛的诞生，您将拨开迷途众生的双眼，给这昏暗的世界带来希望的曙光。所以，世间所有的众生都会依于您，都会跟您修行。您将救度保护世间的每一位众生，所以，您就是我们所有众生的慈父，只有您才能哀愍我们的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，只有您才能给我们带来巨大的幸福。我们这些天神皆因在前世曾作过功德和善事，所以今世才这么幸运能遇见佛，这是很值得庆贺的。’\t\t\t\t</p></div>"
    },
    {
        "title": "妙法莲华经 五百弟子授记品第八",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　五百<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>授记品第八</p><p>　　这时，<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中有一位名叫富楼那弥多罗尼子的大弟子，从释迦牟尼佛这里听到关于佛以其<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>之力，广施方便，随宜<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的情况，又听释迦牟尼佛为诸大弟子授无上圣智<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之记，还听到自己前世随佛听法的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>之事，还听到诸有<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a><a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>、通达无碍的无边神力。所有这些都是他从未听过的。此时的富楼那心地清净，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>不已，他立即从座位上站立起来，走到佛前，以其头面<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>之足。行此大礼之后，他退在一旁，目不转睛地看着佛那尊贵慈祥的面孔，而内心深处却激动起伏，思绪联翩。他想：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>真是太奇特了，他的所作所为更是稀奇罕见。他以权巧方便之力，随顺<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的各种特性，而说种种方便利导的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，令众生拔除贪着，不再染污于六尘之境。我等智劣根浅，未能尽说及宣扬诸佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。唯有大彻大悟的世尊知道我们求佛的深心和本愿。”</p><p>　　就在富楼那慨叹不已之际，释迦牟尼佛开口对法会中的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>们说：“你们看见这位富楼那弥多罗尼子了吗？我常说他在所有说法人中水平最高，称其为说法第一，我也时常赞叹他的各种功德，他<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，勤奋护持佛法，并帮助我宣传佛法义理，善于为<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>开示教法，使之获得法益、法喜。他具备了解释佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>的能力，能够为一同修行的人带来巨大的好处。除了如来佛之外，再没有谁能比得上富楼那那种流利雄辩的口才。你们不要以为富楼那只能护持并帮助宣传佛法，富楼那在过去九十亿个佛那里就曾护持并宣传佛的正法，那时，他在所有宣传佛法的人中也是口才无与伦比，被称为说法第一。另外，富楼那不但善于说法，而且对于诸佛所说的空寂之法，也能通达明了，获得了理无碍、义无碍、辞无碍、乐说无碍等四种无碍智，所以，他总能勤于思索，详细审察各类<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>，从而作到清净说法，毫无疑惑。另外，他还具足菩萨的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力，能随其<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>，跟从如来佛修各种清净之行。在那时的诸佛世界中，人们都认为他是一个真正的声闻弟子，但实际上，富楼那是内秘菩萨行，外现声闻身，并通过这种声闻之相，广开方便法门，<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>无量众生。与此同时，他还<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>无量无数的人，引导他们立志修行成至高无上的佛智。富楼那为了<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>和清净佛国，所以，他常作佛事，教化众生。</p><p>　　“诸位比丘，富楼那在过去七佛座下所有说法人中也是名列第一，如今在我释迦牟尼佛这里的所有说法人中也是第一。在现在劫中以后出现的诸佛那里，他仍然是说法第一。在所有这些佛世界当中，富楼那都能护持并説明如来佛宣讲佛法。就是在未来世无量无边个佛面前，他同样护持并协助如来佛宣说佛法，教化、饶益无量众生，使他们都立志追求至高无上的佛智。总之，富楼那为了庄严和清净佛国，始终如一地精进努力，教化众生，从而使他自己渐渐具足了大乘菩萨的道法。</p><p>　　释迦牟尼佛接着为富楼那授记说：“再过无量阿僧·劫，富楼那将在这个世界上证成至高无上，<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍的佛智佛慧，从而即身成佛，名号为法明如来，同时还具足十号之德，即应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊。法明佛的国土由恒河沙数之多的<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>组成，佛国大地由七宝铺就，平坦如掌，没有山丘、·涧、沟壑，到处是用七宝建造的楼台亭观，天神们的宫殿就处在离地不远的<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中，人和天神可以互相看见，相互接触和交往。在法明如来的佛国之中，没有<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生等三恶道，也没有女人，一切众生皆以神通之力从法化生，所以也都没有淫欲，个个皆获得巨大神通，身上可放出光明，还可自由自在地飞行在空中。他们志向远大，信念坚定，修习佛法精进不息，所以也都富有智慧，具足三十二种非凡身相。该国众生有两种食物，一是法喜食，即心离贪着，以法为食，则法喜充满，不觉饥饿。二是禅悦食，即深入<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，微妙自娱，充满欢悦。国中有无量无数的大菩萨，个个都获得了巨大的神通和四种无碍之智，善于教化一切众生。国中声闻从也多得数不清，计不尽，他们都具备六种神通，三种明达和八种<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之法。总之，法明佛的国土即拥有这样无尽功德，无尽庄严和无尽成就。法明佛住世时，劫名叫宝明，国名叫善净。法明佛的寿命有无量阿僧·劫，佛法流行于世的时间极其长久。佛灭度后，众弟子以七种珍宝不其建起<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>宝塔，这种塔遍布全国各地。”</p><p>　　这时，释迦牟尼佛欲重宣其义，便又以偈颂形式说道：</p><p>　　“诸位比丘，你们仔细听着，<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>所行之道是微妙而不可思意的，因为他善于学习佛的方便智慧。当他知道众生喜欢小乘法而畏惧大乘法时，作为大乘菩萨的弟子们便甘心隐大示小，现出小乘声闻、缘觉弟子的身分，以无数方便法门，诱化一切众生。他们自称是小乘声闻，离佛道相去甚远，通过这种权巧之策而度脱了无量无数的众生，使他们都成就了出世离苦之道。虽然这些乐小法的人总是想<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>不前，中途退缩，但这些弟子们仍殷勤教诲，使他们再接再厉，逐渐趋向于佛之道。这种弟子内秘菩萨之行，外观声闻之相，他们看起来像个小乘声闻弟子，清心寡欲，厌离<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>世间，但他们内心却志向远大，信念坚定，他们以自己的实际行动站庄严佛国，净化佛土。他们在众生面前故意表现出有贪欲、·恚、愚痴等三毒以及其它各种邪知谬见，但实际上，他们却毫不染着，而是通过这种方便之法，深入群生，随类教化，因机说法，引导众生趋于佛道。我的弟子通过这种方便之法教化众生的种种现化事迹，我今天如果全都说出来的话，众生一听，心中就会产生疑惑。</p><p>　　“今天的这位富楼那弟子，曾在过去千亿个佛那里，勤修诸佛之道法，宣扬护持诸佛之法。为了追求至高无上的如来智慧，富楼那在过去诸佛那里，现居于一切弟子之上，多闻强记，富有智慧。他辩才无碍，说法第一，什么法都能讲，能使听者心生欢喜，闻法得悟。他始终不知疲倦地帮助诸佛弘扬佛法，教化众生。他已度脱了生死，获得巨大的神通，具足四种无碍之智，了知一切众生的根性利钝，常说清净妙法，弘通清净法义，教化亿万之众，使他们都能安住于大乘法中，从而都<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>地庄严、清净佛的国土。在未来世中，富楼那也将<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>无量无数个佛，并外现劣相，应诸根机，护持、助宣佛的正法；内秘真心，自心清净，庄严佛的国土。经常以各种方便善巧之法，说微妙无上的佛法而心无所畏，救度无以为计的众生，使他们都能成就一切智慧。”</p><p>　　“在极其漫长的时间中，富楼那始终如一地供养一个又一个的如来佛，并在每一个佛国<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>中，护持<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>法宝藏。在此之后，他将得道成佛，名号为法明，国名为善净，是由七种宝物合成的，劫名宝明。国中菩萨多得无量无数，他们都已获得度脱，具有巨大的神通之力和威德之力。国中到处都有声闻弟子，其数也是无边无尽，他们他们已得三种明达、八种解脱之法和四种无碍之智，以如是等小乘人为佛国之僧。法明佛国中的众生都已断除了淫欲，人们无一不是变化显生，个个具足微妙庄严的身相。他们以习法之喜和<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>之悦为食，除此之外，再没有什么吃食的想法。该国内没有女人，也没有各种恶道。富楼那比丘<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>了一切或德，故能获得如此清净庄严的佛国，拥有如此众多的贤圣。这种无量胜事，我今天就这么简略地给大家说说。”</p><p>　　这时，法会中有一千二百名无烦无恼，心地自在的阿罗汉，听了释迦牟尼佛的说法和授记，不禁这样想道：“我们真是太高兴了！今日所见所闻的确是从未有过的。如果我们也能像其它大弟子那样，得到世尊的授记，那不是件很快乐的事？”释迦牟尼佛知道这些人心中的想法，于是对摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>说：“这一千二百名阿罗汉，我今天就当场为他们逐一授无上等之佛智。在这些人中，我的大弟子·陈如比丘，将在未来供养六万二千亿个佛，然后自身<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>成佛，名号为普明如来，并具足十号，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。其五百阿罗汉，如优楼频螺迦叶、伽耶迦叶、那提迦叶、迦留陀夷、优陀夷、阿·陀罗、离婆多、劫宾那、薄拘罗、周陀、莎伽陀等，他们皆当<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无上正等正觉，即成就如来佛的大彻大悟而即身成佛。这五百罗汉成佛后皆是同一<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>，即叫普明。”</p><p>　　授记完后，释迦牟尼佛又想重宣其义，便说偈道：</p><p>　　“·陈如比丘将遇见并供养无量个佛，历经无数劫之后即可证得佛的无上圣智而得道成佛，此佛长放光明之瑞相，具足各种神通，名号传遍十方，成为一切众生所恭敬的圣者。此佛常说无上妙法，犹如慧光普照，故名号叫作普明。普明佛的国土清净庄严，国中菩萨个个勇猛精进，他们都可升入微妙的楼阁之中，遍游十方诸国，以最好的供具奉献给诸佛。作完这些供养之后，内心畅悦，满怀欢喜，片刻间又回到本国，可见他们有多大的神通之力。该佛寿命六万劫。佛灭度后，他的正法流行于十二劫，继正法之后的像法时代长达二十四劫。佛法灭时，天神和人类将陷于忧愁之中。五百罗汉比丘，也将依次成佛，皆号为普明如来。他们将转次授记说：‘我灭度后，某甲当作佛。’这些佛所教化的世间同我释迦牟尼佛所教化的世间是一样的。佛国的庄严、清净，以及各种神通变化之力、菩萨和声闻的情况、正法和像法的时代，还有佛的寿命等情况，皆如以上所说。迦叶，你已经知道五百罗汉皆获授记，必将成佛。其余的声闻大众也是如此，他们都将证果成佛。凡是今天不在法会中的人，就由你为他们宣说吧！”</p><p>　　五百罗汉在释迦牟尼佛得到授记以后，无不欢喜雀跃。他们立即从座坐上站起来，走到佛的面前，以其头面礼佛之足，悔过自责道：“世尊！我等过去常有这种念头，自认为已证得到最终的灭度。今天，我们才知道自己太愚蠢了。为什么呢？因为我们最终的目标应该是获得如来佛的智慧，但我们却以小智为满足。世尊，譬如有人到亲友家中作客，喝醉酒后便自个睡着了。恰在这时，亲友因官家之事要外出，他便将一颗无价宝珠塞进此人的衣服里，赠送此物之后，他便自个走了，而那人依然醉卧不起，对此毫不觉知。等他醒来之后，他又辗转到了其它国家。为了获得衣食，他辛勤努力，奔波不息，<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>十分艰难。所以，如果稍微得到一点，他便感到很满足。后来，有一天那位亲忽然碰见了他，便对他说：‘岂不怪哉！怎么会为了衣食而到这步田地呢？过去，我为了让你得到安乐，尽享五欲之福，于某年某月某日，将一颗无价珠宝系在你的衣服里，今天依在此，而你却不知不觉，竟然如此辛勤忧恼，艰苦度日，真是太傻了！你现在可以用此珍宝换取所需的一切，你将永远开心如意，要啥有啥，再也不会贫穷了。’”</p><p>　　五百罗汉接着对释迦牟尼佛说：“佛也是如此，您在作菩萨时，就教化我们让我们<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>追求一切智慧，但我们很快又都荒废淡忘了，对此，我们竟然不知不觉。得证阿罗汉道后，便自以为得到了最终的灭度，如同生活穷困的人，得一点就很满足。幸亏以前菩萨教化令发的追求一切智慧的大愿犹在未久，今天，世尊为了使我们<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>，而说如此之言：‘诸比丘，你们所得到的<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>，并非最终的灭度。我过去长期以来，为了让你们种下佛的善根，以方便之力，开示涅槃之相，但你们却以为是得到了真实的灭度。’世尊，我们今天才终于知道自己实际上都是真正的菩萨，都受到了无上佛智的记号，因此，我们皆大欢喜，叹为未有之幸事。”</p><p>　　这时，阿若·陈如等人欲重宣其义，便又以偈颂形式说道：</p><p>　　“我等得闻世尊无上安稳的授记之声，均感到从未有过的高兴。此时此刻，我们向您这位具足无量智慧的佛虔诚致礼，并在你的面前悔过自新。我们本来拥有无量佛宝，但当得证小乘有涅槃后，便自以为足，真像没有智慧的愚人一般。譬如有一位贫困的人，来到某亲友家暂住。这家十分富有，便以各种美味佳肴款待，同时还以无价宝珠系在这位贫者的内衣里面。悄悄地赠此珍宝之后，这位亲友便因故外出了。当时贫者正在睡觉，并不知道亲友送给他珍宝。后来，他游历到其它国家，寻衣求食以自活命，日子过得十分艰难。所以，只要稍有所得便十分满足，更不愿追求妙好的东西。那时，他并未察觉内衣里面有无价宝珠。赠给他宝珠的亲友后来遇见了这位穷人，将他狠狠地责备了一番，并给他指出所系的宝珠。贫者看见这宝珠后，内心充满欢喜，从此他财物丰饶，享尽五欲之福。</p><p>　　“我们这些人也是如此，世尊曾过去漫长的岁月中怜愍教化我们，使我们种下追求无上佛道的大愿。可我们没有智慧，对此竟然不知不觉。一旦得到小乘少许的涅槃之乐，便自我满足，不想再追求其它什么。今天，佛使我们迷中觉悟，告诉我们这种小乘少许的涅槃并非真实的灭度，只有证得佛的无上智慧，才算是真正的灭度。我们今天从佛这里听到授记成佛及佛土庄严和转次授记，依次作佛等情况，身心充满了无比的欢喜。”</p></div>"
    },
    {
        "title": "妙法莲华经 授学无学人记品第九",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　授学无学人记品第九</p><p>　　这时，阿难、罗睺罗心中也想：“我们常常私下暗想，假如能得到释迦牟尼佛的授记，那不是也非常快乐吗？“想到这儿，二位尊者便从座位上站立起来，走到佛的面前，以其头面<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>之足，行此大礼之后，二人一起对佛说：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>！我们应当成为您授记成<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>中的一员吧！我们始终以如来佛作为唯一的归依之处。另外，我们也是一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的天神、人类和阿修罗的良师益友。阿难是时常亲近持候佛的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，长期护持佛的一切法藏；罗·罗是佛的儿子。假如佛能慈悲为我们授无上圣智之记的话，不但我俩儿的愿望可以得到满足，就是<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上二千多位小乘四果位上的弟子们也都可以实现他们的愿望。”这时，小乘初果、二果、三果等有学位以及四果位无学位上的声闻弟子二千人都从座位上站立起来，他们偏袒右肩，来到佛的面前，一心合掌，仰望世尊。这些人静静地站在一旁，他们的愿望和阿难、罗·罗一模一样。</p><p>　　这时，释迦牟尼佛告诉阿难说：“你于来世将会作佛，号为山海慧<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>通王如来，同时具足十名，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊。阿难将<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>六十二亿位佛，并尽心护持这些佛的一切法藏，然后即可<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无上佛智。<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之后，他将<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>两万亿恒河沙数之多的菩萨，使他们都证得无上的佛智。阿难成佛后的国名叫常立胜幡，国内一片清净，琉璃为地。当时的劫名叫妙音遍满。该佛的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长达无量亿阿僧·劫，即使有人在无量无尽的漫长年月中去计算佛寿的长远，也是不能得知的。该佛灭度后，佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>流行于世的时间比佛的寿命还长一倍，而继正法而来的像法时代则比正法时代还长一倍。阿难，这位山海慧自在通王佛受到十方界内无量亿恒河沙佛的共同赞叹，他们都会称扬该佛的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。”</p><p>　　这时，释迦牟尼佛欲重宣其义，便又以偈颂形式说道：</p><p>　　“我现在当着所有僧众的面宣布，阿难弟子护持一切佛的法藏，并当供养所有这些如来佛，然后，他将功德<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，证成正觉而成佛，佛名为山海慧自在通王佛，该佛国土清净，国名叫常立胜幡。该<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>化恒河沙数之多的菩萨，他威德甚大，名震十方，为了怜悯<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，而长住于世，寿命无边无量。佛灭度后，他的正法流行于世的时间比其寿命还长一倍，犹如恒河沙之多的从生都在该佛的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>中种下了成就佛道的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。”</p><p>　　这时，法会中有八千位刚刚<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>菩萨的弟子都同时产生了这种想法：“我们还不曾听到诸大菩萨得到佛的授记，为什么那些小乘声闻弟子会得到成佛之记呢？”释迦牟尼佛知道这些菩萨内心的想法，便告诉他们说：“诸位善男子！我释迦牟尼佛和阿难等声闻大众曾在过去空王佛那里一起立志求证无上佛智。阿难总喜欢多闻强记，而人则经常勤修佛法，<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不息，所以我今天已得到了至高无上的佛智而即身成佛，而阿难则继续护持我的佛法，并将护持未来诸佛的法藏，教化并成就一切菩萨大众，从而积功累德，证成佛智。阿难早就发下证佛智、成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>的誓愿了，所以，他现在才得到佛的授记。”</p><p>　　阿难站在佛的面前，亲自听到佛为他授记，并得知未来佛土的<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>等情况，他的长期以来的愿望总算圆满实现，于是，他心中充满<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，感到从未来过的快乐。这时候，他立即回忆起过去无量千万亿佛所说的一切法藏，并都能通达无碍，记忆犹新。同时，他也记起了很久很久以前所发下的宏大誓愿。于是，阿难怀着激动的心情，诵偈道：</p><p>　　“世尊啊！您是世间最稀有难得的圣者，您让我想起了过去无量无数佛的一切法藏，这些法与我今天听到的法是一样的。所以，我现在不再有任何怀疑了，我将安住于佛道，用种种善巧法门来佛的侍者，护持佛的一切法藏。”</p><p>　　这时，释迦牟尼佛又告诉罗睺罗说：“你于来世当得作佛，<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>为蹈七宝花如来，并足如来十号，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。在未来世极其漫长的岁月中，你将供养十个世界微尘数之多的如来佛，并作这些佛的长子，就像你现在作我的长子一样。蹈七宝花佛的国土非常庄严，他的寿命劫数，所教化的弟子、正法和像法流行于世的时间等情况和山海慧自在如来没有什么差别。你也将为这位佛作长子。在此之后，你将证得至高无上的佛智，从而<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>成佛。</p><p>　　接着，释迦牟尼佛又想复述其义，便诵偈说：“我未<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之前作太子时，罗·罗是我的长子。我现在已经成就佛道，他又接受我的佛法，作为我的习法弟子。在未来的世界中，他将遇见无量亿个佛，并逐一无漏地作他们的长子，一心一意追求佛道。罗·罗所行的密行神奇奥妙，只有我才能知道。他的现身作为我的长子，也是为了示现给众生看，以求无上佛道。他的功德有无量万亿，不可尽数。他永恒信受佛法，并以法修持，以求证至高无上的佛道。”</p><p>　　这时，释迦牟尼佛以其妙观察智观察法会中的二千位小乘三果有学位和四果无学位的声闻弟子，发现他们个个柔和慈善，心清意净，都在全神贯注地看着自己。于是，佛就对阿难说：“你看见这二千名有学位和无学位的声闻大众了吗？”阿难回答说：“是的，我看见了。”佛又对阿难说：“阿难，这些人将供养五十个世界微尘数那么多的如来佛，悉皆尽心恭敬、尊重，并拥护、<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这些佛的一切法藏。最后，他们将在十方国土同时成佛，佛号也完全一样，都叫宝相如来，同时也都具足十号，即应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。他们成佛后的寿命都是一劫，各自的佛土一样庄严，国中的声闻、菩萨以及佛灭度后的正法、像法时代等都完全一样。”</p><p>　　接着，释迦牟尼佛欲重宣其义，便诵偈道：“这二千声闻弟子现在都站在我的面前，我皆给他们授记，他们将在未来世证果成佛。这二千声闻弟子在未来世中所要供养佛有如上所说的微尘数那么多，在这些佛面前，他们将护持诸佛法藏，之后，他们当共成佛道于十方国土，佛名完全相同。他们也都是在同一时间安坐道场，证悟了至高无上的如来<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。成佛后者叫宝相如来，他们各自的国土与弟子、正法与像法等情况也都相同无异。这二千位如来佛他们各自的国土上以各种<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力救度十方受苦众生，所以，他们的名声遍闻十方世界。随后，他们都将渐渐入于<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>境界。</p><p>　　这时，有学位和无学位的二千弟子一听释迦牟尼佛为他们授记，个个欢喜踊跃，他们异口同声地诵偈道：“世尊啊！您的智慧好像明灯一样明亮了我们的心扉，我们都听到了您为我们授记的声音，就好像是得到了<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>法水的浇灌，我们心中充满了欢喜！”</p></div>"
    },
    {
        "title": "妙法莲华经 法师品第十",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　法师品第十</p><p>　　这时，释迦牟尼佛借对药王菩萨<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>之机，告诉<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中的八万大士说：“药王，你看见了吗？参加这次法会的大众中有无量无数的天众、龙王、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽、还有人与非人，还有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞、优婆夷，有小乘法的声闻众，有修中乘的辟支佛众，有修大乘追求佛道者，所有这些不同种类的大众今天都在佛前听闻到《妙法莲华经》的一偈一句，甚至只是在一念间<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>信受这部经，我都给他们授记，他们均会<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>至高无上的佛智。”</p><p>　　释迦牟尼佛告诉药王菩萨说：“另外，在如来佛灭度之后，如果有人听到《妙法莲华经》甚至只是经中的一个偈颂、一句活语，或者一念间欢喜信奉，我也会为他们授无上佛智之记。如果还有人能信<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>行、阅读记诵、解释禅说或者书写《妙法莲华经》，甚至只是其中的一个偈颂，或者有人将此经卷敬视如佛，用各种各样的供具进行<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，如花、香、璎珞、末香、涂香、<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>、缯盖、幢、幡、衣服、伎乐等，甚至只是合掌恭敬，药王，你应当知道，这些人曾在过去生中供养过十万亿个佛，并在这些佛的国土中成就了他们的宏大誓愿。只因为他们怜悯一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，所以才<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>到人间来。药王，如果有人问哪一类众生在未来世中将会<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>，你就应当为他们指出，是这些人于未来世必将作佛。”</p><p>　　释迦牟尼佛又解释道：“为什么呢？因为，若善男子、善女子对于《法华经》甚至只是其中的一句，受持、读诵、解说、书写，或者用花、香、璎珞、末香、涂香、烧香、缯盖、幢、幡、衣服、伎乐等各种各样的供具供养这部经卷，甚至只是合掌<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>，那么，此人就是一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>所有众生应该瞻仰尊奉的人，应该受到如同供养佛一样的恭敬供养。你应当知道，这些人就是大菩萨的<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>，本已成就了至高无上的如来<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，只因哀悯众生，而发愿生此世间，来广泛演说、分别讲解这部《法华经》。受持一句尚且如此，更何况能全部受持，并以种种供具进行供养，药王，你应当知道，这些人本已成就了如来佛智，但他们自愿舍弃了这种清净的<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，发愿在我灭度之后，要怜愍受苦众生，故而再转生于这个恶浊的世界，来广泛演说这部《法华经》。如果这些善男子、善女子在我灭度之后，能私下为另外一人讲说《法华经》，甚至只讲一句，当知此人就是如来佛的使者，受如来佛的派遣，执行佛的使命。讲一句尚且如此，更何况在所有大众之中广泛宣传，到处弘扬。</p><p>　　“药王菩萨，假如有位恶人在某一劫中现身于佛前，他心地不善，经常毁谤辱駡于佛，此人由此而获得的罪业还算轻。可是，如果有人以一句恶言，毁谤讽刺读诵《法华经》的在家人和<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人，那么，此人的罪业就太重了。药王，若有人能读诵《法华经》，你应当知道，此人能得到佛一样的<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>，就好比如来佛将他荷担在肩上，无论他到什么地方，人们都应该向他致礼、一心合掌、恭敬供养、尊重、赞颂，并以花、香、璎珞、末香、涂香、烧香、缯盖、幢、幡、衣服、肴馔、种种伎乐等人间最上等的供具来供养他，还应用天上的宝花散在他的身上，因为这人就是天上的宝聚，理应受到如此的奉献和供养。为什么呢？因为此人喜欢说法，众生即使在很短的时间内听他说法，即可最终证得至高无上、<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍的如来圣智。”</p><p>　　这时，释迦牟尼佛欲重宣其义，便诵偈道：</p><p>　　“如果有人想要进住于至高无上的佛道，成就任运自如的自然智慧，就应当经常殷勤供养受持《法华经》的人。如果有人想要非常迅速的得到包罗万有、一切<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的智慧，就应当信受《法华经》，并以此身体力行，精勤修持，同时，还要供养其它一切受持《法华经》的人。凡是能受持这部《妙法莲华经》的人，当知他是受佛指使来怜悯关怀受苦众生的。所有能受持《妙法莲华经》的人，他们都舍弃了清净无染、美妙极乐的佛国<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>，为了怜悯救度受苦众生而自愿转生到人间。你应当知道，这些人都不受业报而生到人间，他们已摆脱了任何<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>的束缚，愿意转生到这个恶浊的世界广入这部至高无上的妙法，你们应当以天花、香以及天上的宝物、衣服和天上最妙的宝聚来供养这些说法的人。在我释迦牟尼佛灭度之后，若有人能受持《妙法莲华经》，人们就应当向他合掌礼拜、恭敬，如同供养<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>一样，用上等菜肴和各种衣服供养这位佛的法子，希望能在短短的时间内听到这部《法华经》。如果在未来世中，有人能受持这部经典，这一个人如同是我所派遣到人间来，实行佛所做的事情。</p><p>　　“假如有人在一劫当中，经常怀着邪恶之心，板起面孔而毁谤佛，此人获得的罪报无量无尽。可是，如果有人在极短的时间内恶言攻击读诵、受持《法华经》的人，这种人由此而获得的罪报比毁谤佛的罪过还要重。假使有人追求成佛之道，故而在达一劫的时间里，合掌恭敬于我的面前，并以无量无数的偈颂赞叹我、歌颂我，这种人由此将获得无量的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。假使有人赞美受持《法华经》的人，他的福德善报比合掌赞佛者的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>更大。如果有人在八十亿劫之中，以最妙的眼观之色、耳闻之声，鼻嗅之香、舌品之味、身感之触等来供养受持《法华经》的人，并在这种供养之后，于很短时间内听听受持《法华经》的人，，那就应该暗自庆幸自己今天获得了很大的利益。</p><p>　　“药王，我现在告诉你，我所说的一切经典，与今天所说之经相比，《法华经》是第一中的第一。”</p><p>　　这时，释迦牟尼佛又告诉药王大菩萨说：“我所说的经典无量千万亿之多，无论是已说过的、现在正说的、还是未来将要说的，这其中只有《法华经》是最难信、最难解的。药王，这部经典是十方诸佛最重要、最奥秘的法藏，是不可随便向外传授的，所以，十方诸佛一齐守护此经，始终未曾向外显说。如今，我说出这部经典，招致了许多怨恨和嫉妒。我在时尚且如此，何况我灭度之后。药王，你应当知道，在如来佛灭度之后，若有人能书写、受持、阅读、记诵、供养并为他人讲说这部经，这样的人就好像以<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>披覆在他的身上，而且还会受到他方现在诸佛的保护和关怀。这样的人具有很大的<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>力、志愿力和各种善根之力，他们往昔广修福德，种下善根，故能坚信并志愿奉持此经。你应当知道，这些人常与佛在一起，为如来佛以手摩顶，以德加被。药王，不论在任何地方，若有人阅读、若有人记诵、若有人书写《法华经》，凡是本经典存在的地方，皆应该建起七宝塔，所建之塔应极尽高广，极尽庄严，不需要再放<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。为什么呢？因为此宝塔中有《法华经》，就等于有如来佛的法身，所以，人们应以各种花、香、璎珞、缯盖、幢、幡、伎乐、歌颂等进行供养，并恭敬供、尊重和赞叹这座宝塔。如果有人看见这座塔后对塔进行礼拜供养，当知这样的人皆已接近至高无上、圆融无碍的正觉境界了。</p><p>　　“药王，如果有许多在家和出家<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>的人未能见到、听闻、阅读、记诵、书写、受持、供养这部《法华经》，你应当知道，这些人并未圆满地修行菩萨道。如果能听闻到这部经典，那才能善修圆满的菩萨之道。另外有一些众生追求成佛之道，他们若能见到或听闻这部《法华经》，并随之坚信不疑、心领神会、身体力行，你应当知道这些人将接近至高无上、圆融无碍的正觉境界。药王，譬如有人干渴需水，在一高原上挖井求取。当挖出来的全是干土时，他知道离水还远。他继续用功，挖凿不息，转而发现了湿土，逐渐地又看到了泥土，于是，他心里十分自信和坚定，他知道水肯定就在附近。菩萨也是如此，如果没有听闻、没有理解、没有修习这部《法华经》，那么，你应当知道，这些人离至高无上、圆融无碍的正觉境界尚远。但如果能够听闻、理解、思维、修习这部经，那么，你应当知道，这些人离至高无上的正觉境界已很近了。</p><p>　　释迦牟尼佛又为药王菩萨解释说：“为什么这样说呢？因为一切菩萨法门及其所要证得的无上正觉都包含于这部《法华经》之中。此经揭开一切方便权巧之法门，显示万法实相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>之妙理。这部法华<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>，深奥、坚固、幽远，没有人能探测得到。现在，佛为了<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>并成就所有的菩萨而为他们分别开示。药王，如果有菩萨听闻这部《法华经》后，惊奇、怀疑、畏惧，你应当知道，这些菩萨都是刚刚<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>修行的菩萨。如果声闻人中有的听闻此经后，惊奇、怀疑、畏惧，你应当知道，这些人都是虚伪傲慢、不知上进和<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。药王，如果有善男信女在如来灭度之后想为<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>弟子讲说这部《法华经》，应该怎样去讲说呢？这些善男信女必须住到如来室、穿上如来衣、坐到如来座，这样才可为四众广说此经。</p><p>　　所谓如来室，就是一切众生均怀大慈大悲之心。所谓如来衣、就是具足柔和忍辱之心。所谓如来座，就是体悟到一切事物、一切概念、一切现象皆是非实而假有的。达到这三种条件，然后再以不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>之心为诸菩萨及四众弟子广泛宣说这部《法华经》。药王，虽然我在这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>入了<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>，到其它国土教化众生，可是只要有人在此世上能入如来室、穿上如来衣、坐到如来座，为众生讲解《法华经》，我就会派遣我所变化的人为他召集听法之众，也会派遣我所变化的比丘、比丘尼、优婆塞、优婆夷等四众弟子去听他说法。我所变化的这些人听闻他说法之后，便会坚信不疑，受持不息，随顺不逆。假使那位说《法华经》的人在偏僻空闲之处，我就会派遣天众、龙众、鬼神、干闼婆、阿修罗等来听他说法。我虽然在其它佛国之中，但我会时时刻刻令说《法华经》的人见到我的法身。如果说法者忘记了《法华经》中的某句经文，我会去告诉他，让他能记起所忘的经文，以便完完整整，一句不差地为大众讲说此经。”</p><p>　　这时，释迦牟尼佛欲重宣其义，便诵偈道：</p><p>　　“若有人想要克服懈怠，就应当听此部《法华经》。这部《法华经》是很难听到的，也是难信难解、受持的。好比有人干渴需水，在一高原上挖井。当挖出的土依然十分干燥时，他知道离水尚远。当他继续挖凿，渐渐看到湿土甚至泥土时，他坚定水很近了。药王，你应当知道，那些不听闻《法华经》的人，离佛智是非常遥远的。如果能听闻到这部义理深邃的大乘经典，就会真正明白，声闻乘的法只是如来佛的权巧方便法门，而《妙法莲华经》才是所有经典中的经王。若能在听闻该经之后，聚精会神地思考经中的微妙义趣，当知此类人已接近于佛的智慧了。如果有人在我灭度之后，要为大众解说这部《法华经》，他就应该进入如来之室、穿上如来之衣、坐到如来之座，然后在大众之中严整威议，无有怖畏，广泛宣说这部经典。室即大慈大悲之心，衣即柔和忍辱，座即一本性空寂，具足这三个条件，即可宣讲此部《法华经》。若在讲解此经时，有人恶言辱駡，甚至用刀杖瓦石等来打他，他应该心念于佛，忍受这些污辱。</p><p>　　“当我灭度之后，我将在千万亿的国土中现清净、坚固之身，在无量无亿劫中，为众生说法。若有人能在我灭度之后讲说《法华经》，我就会派遣我所变化的四众即比丘、比丘尼以及在家修行的清净士和清净女，让他们去供养这位法师，并引导所有众生，集合一起，听这位法师说法。如果有人用刀杖瓦石等来伤害他，我就会派遣一些化人来卫护这位法师。如果说法的法师独自一人在偏僻空旷之处，这里非常清净，荒凉寂寞，听不见任何的声音，这位法师在此阅读或背诵《法华经》，我将于此时，为这位法师现化出清净光明的<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。如果他忘记了《法华经》中的某些句子，我便会以<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力默默告诉他，使他能记忆起来。如果有人具备这种功德，为四众弟子宣说《法华经》，或者在空旷寂静的地方读诵经文，我都会让他们得见我的法身宝相。假使有人在荒野山里讲解这部《法华经》，我就会派遣诸天神、龙神、夜叉、鬼神等来作他的听众。此人喜欢讲说《法华经》，而且能把此经的妙理解释得圆融无碍，光光相照，孔孔相通，无有任何矛盾之处。由于这位法师时时受到诸佛的保护和关怀，所以，他为大众说法，肯定会让大众满意欢喜的。如果能跟随这位法师修学，将来即可得见如恒河沙数之多的如来佛。”</p></div>"
    },
    {
        "title": "妙法莲华经 见宝塔品第十一",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　见宝塔品第十一</p><p>　　这时在释迦牟尼佛前面，现出七宝之塔，高五百由旬，宽二百五十由旬。此塔从下涌出，慢慢上升，最后停住在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中。在宝塔上面，有种种无价宝物装饰着。在宝塔的四周，有五千栏杆，千万个龛室以及无数幢、幡作为<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>之饰。在宝塔上面还垂挂着珍贵的璎珞和亿万个宝玲。宝塔的四面皆发出多摩罗跋·檀香味，香气随风飘散，充满了整个世界。塔上所有的宝幡、宝盖皆用黄金、白银、琉璃、砗磲、玛瑙、珍珠、玫瑰等七种宝物合成，这些宝幡、宝盖个个高耸云霄，直达四大天王的宫殿。天主帝释率三十三天神降下曼陀花，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>这座宝塔。其余一切天众、龙众、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽以及人非人等亿万天神，用其所有一切妙花、妙香、璎珞、宝幡、宝盖以及种种伎乐供养宝塔，并尽情<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>、赞颂这座宝塔。这时，宝塔中发出了宏亮的声音，赞叹道：“善哉！善哉！<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>能以最平等的大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>来<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>菩萨，十方诸佛保护你为大众讲说《法华经》。就是这样！就是这样！世尊所说之言皆是真实不虚的。”</p><p>　　这时，<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>以及男女<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>看见这座巨大的宝塔停留在空中，又听见塔中发出的声音，都感到十分<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，也觉得非常奇怪，他们从来出没有见到这样的情景。于是，<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们从各自座位上站起来，恭恭敬敬地合起双掌，退到一旁等待解释这个问题。就在这时，有一位名叫大乐说的大菩萨，明白所有天神、人类和阿修罗等<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心中所怀疑的问题。于是他对释迦牟尼佛说道：“世尊！为什么会有些宝塔从地下涌出而留住于空中？为什么会从宝塔之中发出这种声音？” 释迦牟尼佛告诉大乐说菩萨：“这座宝塔之中有如来佛的全身<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。这位如来佛是过去世东方无量个世界之外一个名叫宝净佛国中的一位佛，名号多宝。该在未<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之前<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>时，曾发下宏大的誓愿：‘我若能成佛，在灭度之后，于十方所有国土之中，凡是有佛演说《妙法莲华经》地方，我的塔庙因为听闻这部经的缘故，会从地下涌出而现于<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>者的面前，为他作证，为他赞美。’这位多宝佛后来<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>成佛，在他临入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时，当着天神和人类大众的面，对所有比丘们说：‘我灭度之后，欲供养我全身者，应建起一座大塔。’多宝如来佛以其不可思议的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>和愿力，在十方世界任何一个有讲说《法华经》的地方，他的宝塔都会从地下涌出，现于其前，而他则置身塔中，称赞这位宣说《法华经》的佛：‘善哉！善哉！大乐说，今天，多宝如来佛的真身宝塔因为听到我在宣说《法华经》，所以从地下涌出，并赞叹道：‘善哉！善哉！’”</p><p>　　这时，大乐说菩萨因为以如来神力加持的缘故，故而代表大众向释迦牟尼佛清法，说道：“世尊！我们大家都希望能瞻仰多宝如来佛全身宝相。” 释迦牟尼佛告诉大乐说菩萨：“这位多宝佛大往昔未成佛以前还发过一个深重的大愿：‘假使我的宝塔为听《法华经》的缘故，出现于诸佛面前时，有哪位佛想将我的全身示现给法会中的四众弟子的话，这位佛就必须将他在十方世界中说法的所有分身佛全部集合在一处，然后，我的全身才出现于四众面前。’大乐说，我所有的分身佛如今都在十方各个世界中讲经说法，现在应当召集他们都来这里。”大乐说菩萨对释迦牟尼佛说：“世尊！我们也很想见到您的分身诸佛，以使我们能礼拜、供养这些分身佛。”</p><p>　　这时，释迦牟尼佛从两眉之间放出一道白毫相光，即刻照见东方五百万亿那由他条恒河中所有沙数之多的国土诸佛。所有这些国土皆玻璃为地，以各种宝树和宝衣作为装饰，到处挂着宝幔，上面覆盖着罗网，非常庄严和华丽。各国均有无数亿菩萨。这些国土上的分身如来佛都以其宏亮微妙的生声音演说<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。在释迦牟尼佛的白毫相光中，大家还看见无数亿菩萨遍满诸国，他们都在为众演说佛法。东方诸佛国如此，南方、西方、北方、东南、西南、西北、东北、上方、下方，凡是释迦牟尼佛白毫相光所照耀的地方也都是如此。这时，十方一切佛各自对其座下的菩萨们说：“善男子！我现在应该去<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>释迦牟尼佛那里，并且供养多宝如来的舍利宝塔。”</p><p>　　就在这时，充满恶浊的娑婆世界，因释迦牟尼佛的巨大神力而顿时变得无比清净。整个大地全由玻璃铺成，行行七宝之树将大地点缀得庄严华丽，条条大道四通八达，大道两侧拦着黄金作成的绳子。既没有聚落、村营、城邑，也没有大海、江河、山川、林薮。到处燃烧着巨大的宝香，遍地开放着曼陀罗花，花上还盖着宝网、宝幔，并悬挂着宝玲。唯独留下在法华会上听释迦牟尼佛说法的大众，其余的天众和人民全转移到其它国土去了。这时，释迦牟尼佛所有分身的十方诸佛，各带一位大菩萨作为侍者，一同来到这个娑婆世界，各<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a><a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树下止步。这些菩提树每个均高五百由旬，菩提树的枝叶和花果均非常茂盛。每个树下都有狮子座，座高五百由旬。这些宝座也都用各种名贵的七宝装校一新。十方分身佛来到菩提树下后，便都在狮子座上结跏趺坐，如此一树连一树，一座接一座，布满了整个<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。即使如此，在释迦牟尼佛所住的东方世界中分身诸佛尚有未能入座者，何况其它九方诸国土中的分身佛呢！</p><p>　　这时释迦牟尼佛见大千世界已坐满诸佛，而许多分身佛依然无座可坐，于是，为了全部容纳所有的分身佛，释迦牟尼佛便运用其巨大的神通之力，在宝塔周围八个方向各变出二百万亿那由他个国土，并使这些国土清净庄严，没有<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生以及阿修罗等四道众生，其它两道众生即天是以琉璃为地，用各种宝树来作庄严。树高五百由旬，枝叶和花果依次严饰，美观大方。每棵树下均有一狮子宝座，座高五百由旬，不但高大雄伟，而且全装饰着各种各样的珍宝，显得十分华丽。这些国土之中，也没有大海、江河、石山、大石山、铁围山、大铁围山、须弥山等各种高山峻岭，所有国土均连成一片，相通无阻，成为一个完整的佛国大地，极其平坦，极其规正。众宝交络的露幔覆盖在这无边无垠的大地上。除此之外，到处还悬挂着各种宝幡和宝盖，燃烧着各种巨大的宝香，还有天神们所散的宝花更是铺天盖地，非常美丽壮观。</p><p>　　释迦牟尼佛为了使十方所有分身的化佛来到后有座位可坐，又在八方各变化出二百万亿那由他个国土，个个圣洁而清净，没有地狱、饿鬼、畜生三种恶道众生，也没有多怒好斗没有天福的阿修罗众，其它两道众生即各种天神和人民都被搬到其它国土去了。这次新变化出的国土也是以琉璃为地，宝树来作庄严点缀。这些宝树高五百由旬，皆用珍宝精心装饰，珠光宝气，十分美观。这些国土上也没有大海、江河、石山、大石山、铁围山、大铁围山、须弥山等高山峻岭，所以，各国连成一片，成为一个佛国世界。整个大地平坦规正。众宝交织而成的露幔覆盖在大地之上，宝幡、宝盖到飘悬，大宝之香遍地燃烧，诸天神所散下的宝花铺天盖地。</p><p>　　这时，东方释迦牟尼佛所分身的化佛，在成百上千以至亿万那由他条恒河之沙数那么多的国土中说法教化众生，他们皆辞别大众来到释迦牟尼佛这里集会，坐在宝塔的八方。这时，每一方各有四百万亿那由他那样多的国土，每一国土之中都充满了释迦牟尼佛分身的化佛。</p><p>　　这时，十方分身诸佛各在菩提宝树下面坐于狮子宝座之上，他们都派遣侍者去问候释迦牟尼佛。诸佛手捧宝花交给侍者，嘱咐他们说：“善男子！你到耆阇崛山释迦牟尼佛的道场，代我这样说：‘世尊！近来身体<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>吧！心情愉快吧！气力充沛吧！安稳舒适吧！世尊痤下的菩萨及声闻大众也都好吧！’问候完之后，你再将这些宝花奉献于佛，作为供养，并对释迦牟尼佛说：‘某某佛愿您打开这座塔，瞻仰多宝如来的德相。’”十方诸佛都是这样派遣使者的。这时，释迦牟尼佛看见自己所分身的所有<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>都已集合而来，个个坐在狮子宝座上，也听到所有这些佛都想打开多宝佛塔的心声，于是，他立即从座位上起来，住立于虚空之中。这时，所有四众弟子都站起身来，恭敬合掌，一心观看着释迦牟尼佛。</p><p>　　接着，释迦牟尼佛用他的右手指打开七宝佛塔的门户，只听一声巨响，犹如却关钥打开大城门一样。顿时，所有大众都看见了多宝如来。多宝如来坐在宝塔之中的狮子座上，<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>完整无缺，安然无恙犹如入定一般安详自在。这时，又听见多宝如来说道：“善哉！善哉！释迦牟尼佛请你快点宣说《妙法莲华经》，我就是为了听你说这部经才来到这里的。”这时，四众弟子看见过去无量千万亿劫前已经灭度的多宝如来说出这样的话语，莫不慨叹这般景象的稀奇难得，他们将各种天宝和天花散在多宝如来和释迦牟尼佛的身上。这时，多宝佛在宝塔中将他所坐的狮子座让出一半给释迦牟尼佛，说道：“释迦牟尼佛！你可以坐到这个狮子座上。”于是，释迦牟尼佛进入多宝佛塔之中，同多宝佛共坐一座，盘脚<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>。这时，大众看见现两位如来佛同坐七宝塔中的狮子座上，结跏趺坐，非常亲近，于是都产生了这种念头：“二位如来佛坐在又高又远的宝塔之中，我们看不清楚，听不清楚，惟愿如来慈悲，用大神通之力，将我们这些参加法会的大众都接到虚空中去。” 释迦牟尼佛了知大众之心，他立即以其神通之力，把众人全接到虚空之中，并以其宏亮深远的嗓音普告四众弟子们说：“谁能在这个恶浊充满、众苦煎熬的娑婆世界中广泛宣说《妙法莲华经》，现在正是时候。因为我释迦牟尼佛不久将入涅槃，我想将这部《妙法莲华经》托付于人，希望有人能担此大任，使这部微妙之法永远流传于世！”</p><p>　　这时，释迦牟尼佛想复述其义，便又以偈颂形式说道：</p><p>　　“多宝如来是众圣之主和一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>最尊贵的人。他虽然已在<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>前就已灭度，住在多宝佛塔中，可是为了听这部《妙法莲华经》，他尚且来到耆阇崛山的法华会上，诸位怎么就不精勤修持佛法呢？多宝佛自从灭度以来，已有无数无量劫了，可是由于《法华经》确实是太遭遇了，所以，他仍到处听法。这位在往昔时曾发过大愿：‘我灭度以后，无论何处佛讲 《妙法莲华经》，我都会去听法，并作为证明。’另外，我分身的无数化佛多如恒河之沙，他们为了听闻《法华经》，并瞻仰久已灭度的多宝如来，各自都舍弃了自己的妙土和众弟子，舍弃了天众、人民和龙神的各种供养，来到了这里，以使佛法永远流传世间。我释迦牟尼佛为了给我的分身诸佛安置座位，用神通之力将无量众生转移到其它国王，使这个国土变得极为清净。十方诸佛各到菩提宝树下，这些菩提树个个精心装饰，美观华丽，如同清澈明净的水池有莲花作为庄严一样。在每棵菩提宝树下面，都有一个狮子宝座，分身诸佛都坐宝座上面。每个宝座都用七宝装饰，闪闪发光，犹如黑暗之中燃起了巨大的火炬。分身诸佛的身上皆发放出一种微妙的香气，这种香气芬芳扑鼻，弥漫了十方所有的国土。这些国土上的众生幸蒙这种香气的熏染，个个喜不自胜，由此都下定了追求佛道的决心。分身诸佛利用这种权巧方便之法，以使佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>永久流传于世。”</p><p>　　释迦牟尼佛又以偈语形式告诉所有大众说：“在我灭度之后，谁能发愿<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>此经、读诵此经、宣说此经、现在应当在多宝如来座前和分身诸佛座前，自我宣誓。这位多宝佛虽然久已灭度，可是仍以他的大誓愿在宝塔中作大师子吼。你们今日发誓，多宝如来和我以及聚在此的我的化身佛都会知道你们所发誓愿的意思，并将护持你们专心<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。各位佛的弟子！谁能有<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>之心，就当发下最大的誓愿，令《妙法莲华经》的法恒久流传于世。假使有人能护持此经妙法，就等于是供养我和多宝如来。这位多宝如来虽然身处宝塔之中，可是为了听闻《妙法莲华经》并为此经法作证，他时常游于十方世界。你们若能<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>供养《妙法莲华经》，就等于供养我所分身的一切化佛，也就等于庄严一切国土，光饰一切世界。假使能解说《妙法莲华经》，就能见到我身和多宝佛身以及我的一切分身化佛。”</p><p>　　释迦牟尼佛接着说：“各位善男子！你们各自都要认真地想一想，受持、讲说《妙法莲华经》可不是件容易的事，你们各位应当发下宏大的誓愿。除《妙法莲华经》外，其余的经典多如恒河之沙。即使演说这么多的经典，也不算是一件难事。假使举起须弥山，将其抛掷到他方无数个佛土之中，也是不难的。即使以脚趾来挪动大千世界，将其踢到遥远的他国，这也是不难的。假使站立在<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>之中最高的有顶天中，为众生演说其余无量无数的经典，也不是一件很难的事情。但是，如果有人在佛灭度之后的恶浊世界中，能为众生演说这部《妙法莲华经》，却是一件十分困难的事。假使有人神通广大，手把虚空到处游行，这件事还不算出奇，可以办到。可是如果有人在我灭度之后自己书写、受持这部《法华经》，或者令人书写此经，这便不容易作到了。假若有人将整个大地放在脚指甲上，然后飞升到大梵天中，这也不算太难。而在佛灭度之后，如果有人能在这个恶浊的世界中，短暂地读一读这部《妙法莲华经》，这就难了。假使在劫燃烧的时候，有人背着干草进入熊熊大火而不被火所烧，这也是不能作到的。如果有人在我灭度之后受持这部《妙法莲华经》，为另外一个人讲说，这便是很难的事了。假使有人受持八万四千法藏，以全部的十二种经为众人演说，使听法者获得六种神通，即使如此，这也不算太难的事。但在我灭度之后，如果有人听闻、受持此经，寻问此经的微妙义趣，这便是一件很难的事了。假若有人讲经说法，使无数恒河之沙数那么多的众生都获得阿罗汉果位，具备六种神通之力，虽有这么大的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，可还不算是难事。如果有人能在我灭度之后奉持《妙法莲华经》，这才是一件很难的事。</p><p>　　“我释迦牟尼佛为了教化众生皆成佛道，所以，从开始到现在，我于无量佛国之中，广说各种经典，但在所有这些经典之中，只有这部《妙法莲华经》才是至高无上的经典。如果有人能受持此经，就是受持佛的真身。各位善男子！在我灭度之后，谁能受持、读诵此经，现在就应当在佛的面前，亲自宣誓。这部《妙法莲华经》很难受持，若有人能暂时受持，我便会非常高兴，其它诸佛也会十分欢喜的。这样的人将受到诸佛的赞叹，如是之人就勇猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>，就是严持<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>不放逸，就是修行十二种头陀苦行，他们必将很快<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>至高无上的佛道。若有人能在来世读诵、受持这部《妙法莲华经》，此人便是真正的<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>，便是达到了最纯淳的善地。在佛灭度以后，谁能理解《法华经》的妙义，谁便是诸天神和人类的眼睛。在邪恶恐惧的世界中，如果有人能在须臾之间讲说《法华经》，那么，一切天神和人民都应当供养他。”</p></div>"
    },
    {
        "title": "妙法莲华经 提婆达多品第十二",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　提婆达多品第十二</p><p>　　这时，释迦牟尼佛告诉各位菩萨以及天神和人间的<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们说：“我在过去<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>中，为追求《法华经》的妙理，而<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不息，始终未生出丝毫<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>和疲倦之心。在许许多多劫中，我常<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>为人间的国王，但我不贪俗世之欲，誓愿求证至高无上的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，毫不变心，毫不后退。为了<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>持戒、<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>、忍辱、精进、禅守、<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>等六种度脱法门，我勤行布施，心无吝惜。无论是象、马、七宝，还是国家城池；无论是妻子儿女，还是奴婢仆从，甚至连自己的头、眼、髓、脑、身子、肉、手、足等都愿拿出布施，毫不吝惜自己的身躯性命。那时的人民，<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>无边无量。我为了追求<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，舍弃王位，把所有的权力交给太子，然后击鼓宣布：“我要到四方求法，谁能为我说大乘<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，我就终身侍奉他，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>他、跟着他。”那时，有一位仙人来对国王说：“我有一部大乘经，名叫《妙法莲华经》，你若能不违于我，我就会为你宣说。”身为国王的我，一听此言，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>跳跃，便方即跟随仙人，供给他的一切所需。在那些时日里，我采果、挑水、拾柴、做饭、甚至以自己的身体当作仙人的床座，毫无厌倦和疲惫之感。如此长达一千年，为了求得正法而殷勤奉事、供养这位仙人，使其丰衣足食，要啥有啥，毫无匮乏。”</p><p>　　讲完这个故事后，释迦牟尼佛又以偈颂形式复述道：</p><p>　　“回想起我过去劫时，为了追求无上大法，所以虽身居国王之位，但无意于五欲之乐，于是用椎击钟普告四方说：‘哪位有大乘之法，若能为我解说，我将终身作他的奴仆。’当时有一位阿私仙人来对大王说：‘我有一部最微妙的法，是极为稀奇难得的。你若能依我所教，<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，我就为你解说。’国王一听，心中充满喜悦，便方即跟随仙人，供给他的一切所需，砍柴、摘果、采瓜，随时恭敬侍候。因为一心一意要追求无上妙法，所以，身心毫无懈倦。我是为了普度一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>才精勤求法的。我不是为了自己的身心利益，也不是要求得五欲之乐，所以，即使我身居国王之位，却依然辛勤求法，终于获得了这无上妙法，从而<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a><a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。也正因为如此，我今天才能在此为你们演说这无上的妙法。”</p><p>　　释迦牟尼佛告诉诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>说：“那时的国王就是我的前身，那时的那位仙人就是今天的提婆达多。正是因为提婆达多这位良师益友，才使我具足了<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>之法；具足了大慈、大悲、大喜、大舍等四无量心；具足了三十二种殊妙身相和八十种非凡的细微特征，身体可以放出一种最殊胜的紫磨金色；具足了十种智力和四种<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>；具足了布施、爱语、利行、同事等四种摄受众生之法；具足了不与声闻、缘觉、菩萨共有的十八种不共之法，具足了无量的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>道力，成就了至高无上的正觉，从而普度众生，所有这一切都是因为当初跟随提婆达多这位良师益友精勤习法的缘故。</p><p>　　释迦牟尼佛又告诉四众弟子说：“这位提婆达多再过无量劫当会证果成佛，名号叫天王如来，同时具足十号，即应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。当时的世界名叫天道。届时，天王佛将住留于世二十中劫。在此期间，天王佛将广为众生宣说无上妙法，使恒河沙数那么的众生得到阿罗汉果位，无量众生<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>求缘觉果位，又有恒河沙数那么的众生发誓求证至高无上的佛道，从而得到无生忍法，体悟到无生无灭的真如实相，达到了永不退转的境界。天王佛进入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之后，他的纯正无缺的佛法继续行世二十中劫。佛的全身<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>放于七宝做成的佛塔之中。塔高六十由旬，长宽均四十由旬。所有天神和人民以杂花、末香、涂香、<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>、涂香、衣服、璎珞、幢、幡、宝盖、伎乐、歌颂、<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>等各种方式和各种供具供养这座七宝妙塔。由此，又有无量众生得到阿罗汉果位，无量众生悟得辟支<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>位，还有不可思议多的众生发心求证无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>，终于达到不退转的境界。”</p><p>　　释迦牟尼佛告诉诸比丘说：“在未来之世中，如果有善男子、善女子听闻《妙法莲华经》的提婆达多品，并心清意净，恭敬信受，毫不疑惑，这样的人将不会转生于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生等恶道之中，必将转生于十方佛的面前，他们所转生的地方，也将常闻此经。如果这些人转生于人间或天上，他们就会享受各种殊胜而微妙的快乐。若转生于佛前，那将是由莲花而来化生，以九品莲花作为父母。”</p><p>　　就在这个时候，来自下方的多宝佛的一位随从菩萨名叫智积，对多宝佛说：“我们该返回本土了。”释迦牟尼佛告诉智积菩萨说：“善男子，请稍等！这里有一位菩萨名叫文殊师利，你可和他见面，相互论说《妙法莲华经》的道理，然后再回去吧！”这时，文殊师利菩萨坐在一朵大如车轮的千宝莲之上，与他同来的其它菩萨也坐在宝莲花之上，他们从大海之中的娑谒罗龙宫自然涌出，浮在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中，来到灵鹫山法华会场。他们从莲花上下来走到佛的面前，以自己的头面向两位世尊的双足敬礼。行此极敬大礼之后，他们又去智积菩萨之处，互相问候，退坐一旁。智积菩萨问文殊师利道：“仁者！你到龙宫去<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>了多少众生呢？” 文殊师利回答说：“我在那里所教化的众生无量无数，不可计算，非口所能说出，非心所能测量。暂且稍等一会儿，你将自我证知。”还没等文殊师利说完，有无量无数的菩萨坐在宝莲花之上，从大海之中涌出来，直奔灵鹫山，个个都停浮在虚空中。这些菩萨都是文殊师利菩萨在大海龙宫之中教化出来的，他们个个具足菩萨之行，都在一起讨论大乘六种度脱法门。他们原本都是小乘声闻弟子，所以他们在虚空中宣说声闻的修行。可是，他们如今都已回小向大，修行大乘一切皆空的真如实相法义。文殊师利对智积说：“我在海中教化众生的情况，就是如此。”</p><p>　　这时，智积菩萨以偈语称赞道：</p><p>　　“尊敬的文殊菩萨，你不愧是一位具足大智慧、大<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>、大勇猛、大殊胜的尊者，您教化度脱了无量无边的众生。现在，这<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中的一切众生以及其它能看见的众生都已看到了您的教化成果。您能畅演实相奥义，开示一乘妙法，广泛引导化一切众生，令他们快速成就无上的菩提妙果。”</p><p>　　文殊师利菩萨说：“我在大海之中，经常只宣说《妙法莲华经》。”</p><p>　　智积菩萨问文殊师利道：“这部《妙法莲华经》极为深奥，极为微妙，是一切佛经中的珍宝，是整个世间最稀奇少有的东西。如果有众生依此经典勤奋、精进地修行，能不能很快证果成佛呢？”</p><p>　　文殊师利说：“娑谒罗龙王有一位女儿，年方八岁，聪明伶俐，富有智慧。她了知众生的前因后果，得到十八种陀罗尼之法，对于诸佛所说的一切深奥玄秘的法藏都能信<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>行。她还能深入<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，了达诸法，在一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>间，发心求证无上智慧，达到永不退转的境地，获得了<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍的辩才。这位八岁的女子慈悲关怀一切众生，视一切众生犹如赤子。他具足了一切功德，心里念法，口中<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，所说之法既微妙又广大。她还具足慈悲仁让之心地，富有柔和雅善之意志。像龙王之女这样的众生必能速成菩提之道。” 智积菩萨说：“我见释迦牟尼佛在无量劫以前，行难行的苦行，不停地积功累德以求菩提之道。看看这<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>，甚至就是像芥子那么大的地方，无不是他为众生而舍弃身命的处所。经过长期的修行，释迦牟尼佛才得以证成菩提之道。所以，我不相信这位龙女能在须臾间就立地成佛。”</p><p>　　文殊、智积二人的辨论尚未结束，这时，龙王之女忽然出现在眼前。她恭敬地<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜诸佛菩萨，然后退坐一旁，以偈语赞颂道：</p><p>　　“如来佛深达明了一切众生的罪福<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，这种圣智的光明普照于十方无穷无尽的世界。如来佛微妙的法身，表现在外则具足三十二种非凡的大人之相。如来佛还以八十种细微身相来<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>自己的清净法身。所以，对于如来佛，所有的天神和人类都顶戴敬仰，所有的龙神也都恭敬备至，总之，无论是哪类众生，没有不宗奉如来佛的。我又听说<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>菩提成就佛果的境界，只有佛才能证知。所以，我现在阐扬大乘教理，欲救度一切受难的众生。”</p><p>　　这时，法会中的舍利弗尊者对龙女说：“你说自己不久当成就至高无上的佛道，这真令人难以置信。为什么呢？因为女身垢秽不净，不是成佛的<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>，怎么会得到至高无上的佛智呢？何况成佛之道极其遥远广阔，只有经过无量无数之劫的勤苦修行，布施、持戒、忍辱、精进、禅定、般若等<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>之行样样俱通，条条圆满，如此才可成就佛道。另外，女人之身还有五种障碍：一是不能作大梵王；二是不能作帝释；三是不能作魔王；四是不能作国王；五是不能成佛。如此说来，女身怎么会很快成佛呢？”这时，龙女将一颗价值大千世界那么宝贵的宝珠拿出呈献给佛，佛便接受了。龙女对智积菩萨说：“尊者！从舍利弗以言到我献宝珠，世尊纳受，这是不是很快的吗？” 智积菩萨回答说：“是很快的。”龙女接着说：“依你的威神之力来观察我的成佛，将比这还快！”</p><p>　　当此之时，法会中的大众都看见龙女忽然之间变成男子之身，并圆满具足了菩萨的一切行门，随即前往南方的无垢世界，端坐于宝莲花之上，成就了至高无上、唯佛具有的正觉，从而即身成佛，具足三十二种非凡身相和八十种细微妙相，为十方一切众生演说无上妙法。这时，身处这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>中的菩萨、声闻、天龙八部神、人与非人等都远远看见这位龙女证果成佛，并普为当时法会中的人和天神说法，故而皆大欢喜，全都遥相敬礼。有无量众生听闻龙女说法而得理解开悟，达到不退转的境界，又有无量众生得受成佛之记。当时，无垢世界出现了震、吼、击、动、涌、起等六中震动。娑婆世界的三千众生得住不退转的果位，又能三千众生发心求证无上菩提而得受成佛之记。面对这种奇妙的景象，智积菩萨、舍利弗以及法会中的一切众生无不默然信受。</p></div>"
    },
    {
        "title": "妙法莲华经 劝持品第十三",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　劝持品第十三</p><p>　　这时，药王大菩萨和大乐说大菩萨与其两万菩萨眷属，一起来到释迦牟尼佛的面前，宣誓说：“惟愿<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>不要担心忧虑，我们在佛灭度以后，当会奉持、读诵、讲说这部《妙法莲华经》。在以后的恶浊世界中的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，善根逐渐转少，傲慢无知的人不断增多。他们贪图利益贪图<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，日益增加其不善之根，离<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>越来越远。虽然这些众生很难<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，但我们仍将以巨大的忍耐之力，读诵此经，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、讲说、书写此经，以种种供具供养此经，不惜捐弃自己的生身性命。”</p><p>　　这时，大众中有五百刚得受记的阿罗汉，他们对释迦牟尼佛说：“世尊！我们五百罗汉也自我发誓在其它国土之中，广泛讲说这部《妙法莲华经》。”</p><p>　　又有小乘有学位和无学位上的八千位刚得到受记的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，也从座位上站立起来，向佛合掌致礼，并发誓说：“世尊！我们这些人将在其它国土广泛演说这部《妙法莲华经》。为什么呢？因为这个娑婆国土中的人，大多数性情邪恶，傲慢浮浅，<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>浅薄，多恼好怒，污浊不净，谄媚折腰，虚伪奸诈，没有一点诚实之心。”</p><p>　　这时，释迦牟尼佛的姨母摩诃波·波提<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>和小乘初果、二果、三果等有学位和四果无学位上的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>尼共六千人，从各自的座位上起来，一心一意合掌致礼，目不转睛地看着释迦牟尼佛的尊颜。这时，释迦牟尼世尊对他们当中的·昙弥说：“你为什么面带忧郁之色看着我呢？在你的心中是不是认为我没有说出你的名字，从而没有为你授无上圣智之呢？·昙弥，我一开始先总说一切声闻，他们都已得到我的授记了。现在你想知道自己的成佛之记吗？那我就告诉你。将来之世，你当在六万八千亿个佛的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>之中为大法师，还有这六千位有学位和无学位上的比丘尼与你一起都作为法师。如此经过在六万八千亿个佛那里供养侍奉、说法教化，你渐渐具足了菩萨之道，从而最终成佛，名号叫一切众生喜见如来，同时具足十号，即：应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊。·昙弥，这位一切众生喜见如来和六千菩萨依次相互授记，依次得至高无上的如来佛智。”</p><p>　　这时，罗睺罗的母亲、释迦牟尼佛未<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>前的妻子耶输陀罗比丘尼，心中暗想：“世尊对这么多的比丘、比丘尼授记，怎么就不提我的名字呢？” 释迦牟尼佛告诉耶输陀罗说：“你于来世，将在亿万个佛那里修持菩萨行，作为大法师，从而渐渐具足成佛之道，从而在善良国土中即身作佛，<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>为具足千万光相如来，同时具足十号，即：应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。该佛<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>无量阿僧·劫。”</p><p>　　这时，摩诃波·波提比丘尼和耶输陀罗比丘尼以及她们的眷属，都充满了巨大的<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，感受到从未有过的欣慰。她们便在佛前诵偈道：</p><p>　　“世尊啊！我们伟大的导师！您能使天上的众生的人间的众生得到安稳和快乐。我们这些比丘尼大众听了您给我们的授记，心中充满了巨大的安慰。”</p><p>　　诸比丘尼说完这道偈语之后，又对佛说：“世尊，我们这些人也能在其它国土之中，广泛宣说这部《妙法莲华经》。”</p><p>　　这时，释迦牟尼佛又将目光注视到八十亿那由他那样多的大菩萨身上。这些菩萨都是位不退、念不退、行不退位上的大菩萨，他们转不退*轮，永无止息地讲经说法，获得各种陀罗尼神咒。这些大菩萨同时从各自的座位上站立起来，一起来到佛前，一心合掌致礼，心中这样想道：“假若世尊命我们受持、讲说这部《妙法莲华经》，我们将一定遵从佛的教诲，广为一切众生宣讲这部寺乘经典的微妙之法。”接着，他们又想：“佛现在默然不语，未见下敕传旨，我们该怎么办呢？当时，这些大菩萨们只好恭敬顺从佛的心意，并欲满足自己原本所发的大愿，于是，他们将在如来灭度之后，周旋往返于十方诸世界之内，使众生书写此经，受持、读诵此经，并解说其义理，然后再根据经义去<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>和正确无误地回忆、背诵。所有这些都赖于佛的威神之力，所以，但愿世尊在遥远的地方，大发慈悲，守护我们和一切众生。”接着，所有这些菩萨同时发声诵偈道：</p><p>　　“世尊啊，请您放心！在你灭度之后的恐怖邪恶之世中，我们将担负起说法的重任，为众生广泛宣讲这部甚深微妙的经典。如果遇到那些没有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的人，无论是恶口漫駡，还是刀棒相加，我们都应当忍受。恶世中的比丘，心怀邪智邪见，善于谄媚，缺乏坦诚。未得道时却自称已得，充满了自傲自大之心。有的修阿练若行的比丘，穿着百衲衣，身处空闲处，自认为是修行真道，轻视人间讲《法华经》的法师。他们贪图利益，为在家人说法，好像自己很受世人恭敬，犹如具足六种<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>的罗汉一样。这类人怀着邪恶之心，总是关怀世俗的名利和争斗。他们打着修阿练若行的晃子，攻击我们有诸多过错，说什么：‘这些比丘贪图利益而说外道观点。他们自己作出这部《妙法莲华经》，以欺骗迷惑世人。为了求名，他们才分别讲说这部自作的经典。’这些恶性比丘总想在大众之中毁谤我们，所以，他们在国王、大臣、<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>、<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>及其它比丘大众面前诽谤我们是邪见之人，说的是外道的理论。我们因为恭敬佛的缘故，全都忍受了这些恶意的攻击。可是，这些人又讽刺我们说：‘你们都是佛，’这种轻慢的言语，我们都将忍受。在这五浊恶世之中，总会有各种各样的恐怖之事来扰乱我们的身心。恶鬼会附上人身而作祟，肆意漫駡毁辱我们。我们是敬信<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之人，应当穿上忍辱的铠甲。为了宣说这部《妙法莲华经》，我们要忍受如此众多的困难。我们不爱惜自己的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>，但却爱惜无上的道法。我们大众将在未来世中，遵守佛的嘱咐，护持这部经典。世尊，您一定知道，浊世中的恶性比丘不知佛所说的方便法门乃是随顺众生之机宜而说的法。他们恶口毁谤，皱眉作态，常常把善性比丘摈出塔寺之外。像这样的各种恶事，我们念着佛的告敕，而当默默忍受，在所有的村落或城乡之中，只要有人求法，我们便会来到他的面前，演说佛所咐嘱的妙法。我们是世尊的使者，在任何大众之中都是毫<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>惧的。我们将不遗余力地认真说法，愿佛安安稳稳地住在常寂光<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>中，不要担心《法华经》的后世弘宣问题。我们在释迦牟尼世尊和来自十方的一切佛面前，发下如此誓言，佛自当知道我们的心愿。”</p></div>"
    },
    {
        "title": "妙法莲华经 安乐行品第十四",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>　　安乐行品第十四</p><p>　　这时，<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>王子、大菩萨文殊师利菩萨对佛说：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，这些发大誓愿的菩萨是非常难得的。他们敬重顺从于佛，而发下了宏大誓愿，要在以后五浊恶世中，护持、读诵、讲说这部《法华经》。世尊，这些菩萨、大菩萨们怎样才能在以后的五浊恶世之中讲说这部经典呢？”</p><p>　　佛告诉文殊师利说：“如果这些菩萨、大菩萨们在以后的五浊恶世之中要讲说这部经典，应当安住于四种方法：首先，安住于菩萨<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的地方，和菩萨所亲近境界，如此，才能讲说此经。文殊师利，什么叫菩萨、大菩萨的修才处所呢？如果菩萨、大菩萨从事忍辱修行，柔和善顺而不暴躁，内心平稳而不惊惧，同时对一切事物和现象都不执着，所以，行而不行，即不执着于修行之相，如此而观悟万事万物背后的真如实相，即本性空寂，无所分别的湛然清净之相，如此，行而不行，毫无分别，这就叫大菩萨安乐之行。</p><p>　　“什么叫菩萨、大菩萨的亲近之处呢？菩萨、大菩萨不亲近国王、王子、大臣、长官，不亲近不属<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>的外道<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人如尼犍子等，不能编造低级趣味的世俗文学作品，不阅读赞咏外道的书籍以及教人造恶之论和背逆常理之论，不观看各种有暴力凶杀情节的戏剧以及相互打斗、力士角逐、魔术表演等，不亲近专门从事屠宰之业的·陀罗以及畜养猪羊鸡狗和打猪捕鱼的人，不亲近以各种邪恶不善的法则为规范的人。诸如此类人，如果他们有时也来听讲，那也可为他们<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，但不能存有希求或攀缘之心，此外，还不能亲近小乘<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>，即小乘的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>、女居士，就是见了面，也不能合十问候。如果在房屋内，在房屋外，在讲堂上，不与他们共处同行。若他们要求听法，那就为他们<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>说法，但不能存有希求和攀缘之心。</p><p>　　“文殊师利，另外，菩萨、大菩萨不能对女人之身产生欲望，不能出于对女人的欲望而为她们说法，也不能乐意见到女人。如果到了别人家中，不能与幼女、姑娘、寡妇等说话，也不能亲近五种似男非男之人，即生来无男根者、后天男根被除者、即妒忌男又妒忌女的人、男不男女不女的人、半月是男半月是女的人。对于这些人，不但不能亲近，而且更不能深交厚结。为了避免嫌疑，修菩萨行的菩萨、大菩萨们也不能单独一人到别人家去。如果确实因某事需要必须一个人到别人家中去时，就应一心<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>，不存杂念。如果为女人说法，则不能露齿而笑，不能袒胸露腹。像这样为了说法都不亲近深交，何况因为其它事情呢？菩萨、大菩萨 还不能乐意收年少<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，不乐意留下小<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>和小孩子在自己身边，也不能乐意与小沙弥一同随师修习。应于平时爱好<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>，尤其是在空闲寂静的地方坐禅<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>，以消除心的散乱。</p><p>　　“文殊师利，以上所述说是菩萨，大菩萨的第一类亲近之处。</p><p>　　“其次，菩萨、大菩萨观悟到万事万物的空幻假有，就像这假有背后的真如实相一样清净<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，不颠倒<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，不为外境所动，不退失<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>、不受<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>，就像<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>一样，没有自在之本性，超言绝象，非任何概念所能表达，无所谓生，无所谓出，无所谓起，即无名称，也无外相，一无所有，但却无量无边，无障无碍。万事万物只是一定条件下由诸多因素临时凑合而成的假相，人们不明白观悟实相的<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>圣智，所以妄生执见，认为万事万物实有，并由此而给予各种虚妄不实的说明。经常乐于观察这种非实假有的<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>，体悟法相背后的清净实相，这就是菩萨 、大菩萨的第二种亲近之处。”</p><p>　　这时，释迦牟尼佛为了重宣以上义理，便以偈颂格式说道：</p><p>　　“若有发大<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>的菩萨，于将来的五浊恶世中，无恐怖畏惧之心，欲为众人演说这部法华经，就应该进入身所行之安乐之所以及应该亲近之处。要时常远离国王、王子、大臣、长官、作凶险演戏者、屠宰牲畜者及一切修外道之法的出家者，也不能亲近傲慢之人、贪者小乘三藏经典而不发大乘心的人，不守<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>的比丘、冒名伪称的所谓罗汉以及好戏笑的比丘尼。对于那些深深贪着于色、声、香、味、触或财、色、名、食、睡五欲，只求今生今世获得灭度的女居士，也不能亲近。如果这类人以善意的求道之心来到菩萨的修行之所，欲听闻佛法，菩萨则应以无所畏惧之心，不怀任何贪求<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>等企图，而为他们说法。</p><p>　　“寡妇、姑娘以及似男非男者，皆不能与之亲近或深交厚结。也不要订近屠宰牲畜之人、狩猎捕鱼之人、为图私利而杀害<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>之人或贩卖肉类为生之人，以及出卖色相的女人。以上这几类人都不要亲近。”</p><p>　　“凶险搏斗之人、各种杂耍嬉戏之人以及各种淫乱之女，均不可亲近。不要在屏障背后单独为女人说法。若说法时，不得戏笑。进入市中乞食，应偕另一比丘同行，若无比丘相伴，入他人家乞食时则应一心念佛。”</p><p>　　“以上即是修行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>者的行处和亲近处。安住于这两种处所，就可安稳快乐地为大众讲说《法华经》。”</p><p>　　“另外，修行菩萨道者也不修行上中下法、有为法和<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>以及实法、不实法，也不分别是男是女。不认为自己真实得到了什么法，不知、不见一切法相，这就叫菩萨的修行处。一切事物和现象从本质上看都是空幻的，其内部并由永恒的主宰，所以，它们是不生不灭的。如此观悟万法，就是智者所应亲近的地方。不要不颠倒<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>所蒙蔽。人为地分诸法的有与无、实与虚以及生与不生。应该在空闲幽静之处修习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，收摄心念，像须弥山一样安住不动。观悟万事万物空无所有，犹如虚空，没有坚固常存之自体。观悟清净之实相，不生不出，不动不退，经<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>于这种微妙之实相，就叫作菩萨修行的亲近处。”</p><p>　　“若有比丘在我灭度之后，进入如是菩萨修行的处所及菩萨亲近和处所，演说这部《法华经》时，没有怯弱，或者若有菩萨有时入于静室之中，以<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>思维佛法之道理，然后从禅定中起来，为各位国王、王子、大臣、人民或<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>等开讲这部《法华经》，作到心中平稳安乐，无所恐惧。文殊师利啊，这就叫作菩萨安于初步法门，他们若能如此修行，将来末汉时，就能演说这部《法华经》。</p><p>　　释迦牟尼佛又对文殊师利菩萨说：“文殊啊，我灭度之后，在末法时代中，修菩萨行的大菩萨们要演说这部《法华经》，就应住于上面所说的安乐行门。如果用口宣讲或读诵此经时，不要乐意诉说他人的过错或经典的过错，也不要轻慢其它各位法师，洒谈论他人之好恶长短。对于声闻小乘之人，不能高傲无礼，直呼其名，诉说他们的过失，也不能赞叹他们如何的美。同时还不能产生怨恨、嫌弃之心。若能善修这种安乐之心性，那么，对于一切前来听法者，就不要违逆其来意。若对方质问，则勿以小乘佛法答之，而应以大乘之法为他们进行解说，令他们获得大乘神妙之智，即一切种智。”</p><p>　　这时，释迦牟尼佛为了重宣这种义理，便以偈颂格式说道：“修行菩萨道的菩萨总是乐于安稳说法，为此，他们就应在清净之地安置床坐，以香油涂身，洗净一式尘秽，穿上新鲜洁净的衣服，里外皆十分清净，然后安安稳稳地坐在法座之上，随听法者之间而为他们讲说佛法。若遇到比丘、比丘尼、男居士、女居士、国王、王子、群臣、百姓，应该以微妙的佛法义理，和颜悦色地为之讲说。若有疑难和质问，应该随顺大乘义理而来答复，并以各种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>与譬喻的方式，为他们敷演分析，借助于这种权宜之计，使他们发起大乘<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>之心，由此日益增长，最终成就无上的佛道。应该克服懒散之心及一切<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>之情，远离一切忧愁与<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，以慈悲之心为众生演说大乘佛法。如此夜以继日地讲说无上道法，以各种因缘和譬喻的方便法门开示众生，使他们皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，但绝不能因此而希望众生施行衣服、床具、饮食、医药的供养，只是一心一意地想着为众生随机说法的事情，想着自己如何成就佛道，如何令众生也成就佛道，如此，才是大利众生、安乐众生之清净供养。</p><p>　　“我灭度之后，若有比丘能演说这部《妙法莲华经》，内心没有嫉妒和·怒等各种烦恼障碍，对于责駡不担忧，对于刀杖之危不惧怕，相互忍耐，融洽共处。有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的人就应该这样去修炼其心，安住于如上所述的安乐行门。这种人的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>之大，即使千万年中以各种算度量，以各种譬喻衡量，也是说不尽、道不完的。”</p><p>　　释迦牟尼佛接着说：“另外，文殊师利，菩萨、大菩萨在未法时代佛法将灭时，凡是能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵为部经典者，都不能怀有嫉妒、谄媚、欺诳之心，也不能轻慢辱駡学习佛道的人，对他们吹毛求疵。无论是比丘、比丘尼、男居士、女居士，还是追求声闻乘、辟支佛乘和菩萨乘等三乘的人，都不能恼怒上述之人，使他们心有疑虑而后悔并生退转之心。例如，就不能这样对他们说：‘你们这些人距离佛道还差得太远，永远也不可能获得无上神妙的一切种智。为什么呢？因为你们都是些放纵沉溺、安逸享乐之人，修行道法时会松懈和怠慢。’</p><p>　　“还有，就是不能对各种佛法随意妄论亵玩，彼此争执，各持异见。应当对一切众生怀有大悲之心，对于诸如来<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>想他们就像自己的慈父，对于诸菩萨要心想他们都是自己和大师，对于十方世界中的一切菩萨始终诚心恭敬，虔诚<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。对于一切众生要一视同仁、无所分别地讲说佛法，根据佛法的深浅与众生的根机，适时应机地说法，不该多说则不多说，不该少说则不少说，就是遇到深深敬信佛法的人，也不能不适宜地为他们多说佛法。</p><p>　　“文殊师利啊，这就是菩萨、大菩萨在未来末法时代佛法将灭时，所要成就的第三种安乐之行。若能如此，他们在讲说这部经典的妙法之时，心志就不会烦恼散乱，就能够获得同志同道合的人一同修学，大家一起读诵这部经典。 同时，还能吸引大众前来听闻，听闻后接受，接受后读诵，读诵后还能为他人解说，除了解说外还能书写或请别人书写，与此同时便是把这部经典供养起来，并对恭敬、尊重、赞颂。”</p><p>　　这时，释迦牟尼佛为了再次说明这种道理，便以偈颂格式说道：“修行菩萨道的大菩萨，若想讲说这部经典时，应当舍弃嫉妒、·怒、谄媚、欺诳等邪伪之心，经常修行质朴、直率的心性，不轻视他人，也不亵玩佛法。不要使他人对佛道产生疑惑后悔之心，说他们不可证<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。这些<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>们说法时，能常怀柔和之心地，常持忍辱之修行，以大慈大悲之胸怀对侍一切众生，不生懈怠之心。十方的大菩萨因为怜悯众生之故而<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>修行菩萨道，所以，对他们应生恭敬之心，视其为自己的大师。对于诸佛，则视其为无上慈悲的父亲，破除骄慢之心，从而毫无障碍地说法，这就是第三种安乐行。有智慧的人坚持并护卫这种修行之法，一心一意地住于这种安乐之行，这样的大菩萨必然得到无量众生的敬仰。”</p><p>　　释迦牟尼佛又对文殊师利菩萨说：“文殊啊，菩萨、大菩萨于将来的末法时代佛法将要灭亡之时，凡是奉行受持这部《法华经》的，对于佛门的居家弟子和出家弟子要生令其快乐的大慈之心，对于非佛门的其它人也要生救拔其苦的大悲之心，应该这样想：‘这些尚未<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>佛门的人，他们真是损失惨重，如来为众生大开方便之门，根椐不同众生之根机而随宜应机讲说妙法，可他们这些竟不闻、不知、不觉、不问、不信、不解。这些人虽然不询问、不理解、不信从这部经典，但是，只要我们一旦<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>至高无上的佛智，那么，不论我们在什么地方，我们都要运用<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力和智慧之力，引导这些人悟入此经的神妙法义之中。’</p><p>　　“文殊师利，这就是菩萨或大菩萨在佛灭度之后，所要成就的第四种安乐之行。若能这样，他们讲说此经妙法时，就不会产生过失，而且还会常常受到比丘、比丘尼、男居士、女居士、国王、王子、大臣、民众、婆罗门居士等的供养与恭敬、尊重和赞颂。空中的各位天神为了聆听这种妙法，也常会随行侍奉。如果在村落、城镇或寂静的山林中说法，有人前来质疑责难，诸位天神便会昼夜不离地守护在旁边，以不使佛法受损，并能使前来听法的人皆大欢喜。为什么呢？因为这部经典是过去、未来、现在三世之中一切如来佛的神力所保护的。</p><p>　　“文殊师利，这部《法华经》在无量无数的年代中，连其名字都湮没无闻，更何况见到并受持、读诵此经的人，那就更为稀有了。文殊师利，譬如力量强大的国王，想以威武之势降伏各国，而各小国之王却不顺从其命令，这时，大王就诸兵其发，前往讨伐。大王若发现众兵之中有战功的人，便会非常高兴，并根据其战功的大少而给予赏赐，如有的给予田园家宅、村庄、城镇等封邑，有的给予衣服或其它装饰之物，有的给予各种珍宝和金银、玻璃、砗磲、玛瑙、珊瑚、琥珀以及象、马、车乘和奴婢、属民。总之，什么都可以拿出来赏赐，只有自己头上髻中的一颗明珠却从来不给别人。为什么呢？因为只有大王头上有这样一颗明珠，如果把它拿来赏赐，大王的随从与部下一定会十分惊异。</p><p>　　文殊师利，如来佛也是这样，他运用禅定和智慧的力量，获得了佛法国土，作为法王统领欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>和<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。但魔王并不肯顺从臣服，法王如来来各位贤圣将帅与魔王交战。若有谁从中立下战功，如来也会非常欢喜，于是便在比丘、比丘尼、男居士、女居士等四众弟子当中，讲说各种经典，使他们内心感到喜悦。通过讲经，赐予禅定之法、<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之法信断尽烦恼的五根之力等各种佛法财宝，赐予<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之城，说他们获得了灭度解脱，引导其心，使之皆大欢喜。但是，如来佛就是没有这他们讲说这部《法华经》。</p><p>　　“文殊师利，譬如国王看见士兵立下大功勋，心中万分欢喜，那颗难以置信的珍贵明珠，即使久藏于自己的头髻之中，从不轻易地赠予他人，这时还是赏赐给了士兵。如来佛也是这样，他是欲界、色界、无色界等<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>之中的大法王，以佛法<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>三界之内的一切众生，看见自己手下的贤圣之军与色、受、想、行、识等<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>之魔作战，与烦恼魔、死亡魔互战，取得了很大的功勋，消灭了贪欲、·怒、愚痴等三毒，超出了欲界、色界、无色界等三界，冲破了魔王的罗网，这时，如来佛也会十分欢喜。这部《法华经》是一部能使众生获得无上之智的经典，所以，也是一部世人大多会抱怨其难以信奉的经典。如来佛先前从未说过，现在方为众生演说。文殊师利，这部《法华经》是所有如来佛的第一说法，是所有佛法中最深奥微妙的，所以，直到最后才赐予众生，就像力量强大的国王，长期守护着自己的明珠，到了最后才赐予士兵一样。文殊师利啊，这部《法华经》是所有如来佛的秘密宝藏，居于所有佛经之首。在漫漫长夜之中，如来佛小心守护，从不轻易宣说，直到今天，才向你们敷演讲说。”</p><p>　　这时，释迦牟尼佛想重宣这种义理，便以偈颂格式说：“修行菩萨行的诸位菩萨或大菩萨应常行忍辱之法，哀悯一切众生，才能演说这部诸佛赞叹的经典。将来的未法时代，受持这部经典的人，对皈依佛门的在家和出家信众以及尚未皈依佛法的人，均应怀抱一片慈悲之情。那些不听闻、不信从这部经典的人，的确有很大的损失，将来我们一旦获得佛道，将以各种方便之法门，为他们讲说此经妙法，使他们也能沐浴于这种妙法之中。</p><p>　　“譬如力量强大的国王，对其士兵中作战有功者赏赐各种宝物，如象、马、车乘、装饰之物、田园家宅、村庄、城镇，或衣服、各种珍宝、奴婢、财物等。假若有勇健之将，作了一般人所不能作的事，这时，国王便拿下自己头髻中的明珠，赐予这位健将。如来佛与国王一样，他是法国之王，具备忍辱等<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>之力和无尽的智慧宝藏。他以大慈大悲之胸怀，依法教化<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>，看见一切众生遭遇苦恼，欲求解脱，从而与魔作战，于是，佛便为这些众生赏赐种种妙法，先以方便法门，演说诸经之理，当得知众生已从中获得了力量，最后才为他们讲说这部《法华经》。就好像国王拿出自己头髻中的珍珠来赐予士兵，这部经典乃是至尊之经，众经中无上之品，我长期以来谨慎守护，从不轻易开示，可如今正是时候，所以便为你们讲说。</p><p>　　“我灭度之后，追求佛道的诸位菩萨、大菩萨，要想安安稳稳演说此经，就应当亲近如上所述的四种安乐之行。读诵此经的人，常无忧愁烦恼，没有各种病痛，红光满面，皮肤白嫩，不会成为贫穷、卑贱、丑陋的人，众生乐意见到，就好像思慕圣贤一样，天上的诸位童子他会听其使唤，刀杖不会加害其身，鸩毒不会为害其身。若有人想恶意诬骂时，却总是难开其口。外出行路时，毫无畏惧，就好像狮子王一样。他的智慧之光，明遍法界，就像日光普照大地一样。</p><p>　　“如果在梦中遇到吉祥之境界，看见诸佛坐在狮子座上为众多环列周围的比丘说法；以看到神龙、阿修罗等各类天神如恒河沙一样众多，他们都恭恭敬敬地合掌致礼，而自己正在为他们说法；又看到诸佛，身现紫金色，放出无量光明，遍照<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>，佛以清净<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>，演说诸法，而当梦到佛如此向四众弟子说无上妙法时，也看到自己置身其中，合掌赞佛。</p><p>　　“听闻佛法之后，十分欢喜，便对佛进行供养，进而得到总持法门，证得不退之智。佛知其人之心业已深入佛道，便为其授予成就无上正觉的记·，佛这样说：‘你这位善男子，将于未来世中，获得无量智慧，证成佛道，你的佛国<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>清净，广大无比，其中也有四众弟子向你合掌礼拜，听你讲经说法，还在梦中看到自己身处山林之中，修习善法，证得实相之境，在禅定中看见自己十方世界中的所有佛。诸<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>相呈金色，具足百福之相，十分庄严。听闻佛法之后又为他人讲解，就会时常作到这样的好梦。还可以梦见自己作了国王，舍弃了富丽堂皇的宫殿以及三宫六院的妃嫔，舍弃了世欲人间美妙的五欲享受，走到修行的道场，在菩提树下，坐于狮子座，<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>历时七日，便证得诸佛之智。成就了这种至高无上的佛道之后，起来再转*轮，为四众弟子说法，经过亿万年，演说清净妙法，救度无量众生。然后将入涅槃，就好比烟尽灯灭一样。</p><p>　　“若在将来的五浊恶世中，有谁能演说这部至高无上的妙法，那么，此人必将获得大吉大利，犹如以上所述的各种功德。”</p></div>"
    },
    {
        "title": "妙法莲华经 从地涌出品第十五",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　从地涌出品第十五</p><p>　　这时，从其它国土来到<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上的菩萨、大菩萨，其数量已比八条恒河的沙粒总合之数还要多。他们在大众中站立起来，合掌<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>，对佛言道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，请您允许我们在您灭度之后，在这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>勤奋<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不息，护持、读诵、书写、<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>这部经典，并在这个国土上广泛演说此经法义。”这时，佛告诉诸位菩萨、大菩萨说：“不必了吧！各位善男子，不需要你们来护持这部经典。为什么呢？因为我娑婆世界已经有六万恒河沙数那么多的菩萨、大菩萨，每一位菩萨又各有六万恒河沙数那么多的眷属，这些人能在我灭度之后，护持、读诵、广泛演说这经典。”</p><p>　　释迦牟尼佛说此话时，娑婆世界三千大千国土上，大地全都震动开裂了，从裂缝中，同时涌出了无数千万的菩萨、大菩萨。这些菩萨，身皆金色，具足三十二种殊妙之相，身放无量光明。他们原先都住在这个娑婆世界的下边，即下方世界的<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中。这些菩萨听释迦牟尼佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的音声，便从下面一涌而出，他们每一个人都是<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的导师各自率领自己的眷属，有的有六万恒河沙数那么多的眷属，有的有五万、四万、三万、二万或一万恒河沙数那么多的眷属，还有的则只率领了一恒河沙数那么多的眷属，或者半条恒河沙数、四分之一恒河沙数、直至千万亿兆分之一恒河沙数的眷属，还有一些菩萨的眷属有千万亿兆，亿万、千万、百万、直至一万。另一些菩萨则只带了五个、四个、三个、二个、或一个<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。当然也有那些单身独行、乐于远离的菩萨，他们则没有眷属。总之，从地中涌出的菩萨及其眷属，无量无边各种算数数之，各种譬喻譬之，都是不能知晓其数量之浩大的。</p><p>　　这些菩萨从地下涌出后，都到那虚空中的七宝塔处，即多宝如来和释迦牟尼佛的所在之处。抵达之后，他们便向两位如来佛<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜接着又到从十方而来的<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>宝树下的狮子座前，向坐在上面的诸佛一一作礼，右向绕佛三周，双手合掌，恭恭敬敬，用菩萨的各种赞叹之辞赞叹如来佛。然后，退立一旁，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>欣悦地瞻仰着多宝如来和释迦牟尼佛这两位世尊。这些菩萨、大菩萨从初由地下涌出到以种种菩萨的赞叹之法赞叹如来佛，其间所经历时间，达五十小劫之久。在此期间，释迦牟尼佛默默而坐，其它<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>弟子也都默默无语。五十小劫那么漫长的时间，经过释迦牟尼佛神力的作用，使大家感到只有半天的时间。与此同时，四众弟子也借助于释迦牟尼佛神力，看到诸菩萨遍布在无量百千万亿国土的虚空之中。</p><p>　　在所有菩萨众当中，有四位导师：第一位名叫上行，第二位名叫无边行，第三位名叫净行，第四位名叫安立行。这四位菩萨是所有菩萨大众中的上首菩萨，是化导众生的导师。他们在大众面前，一起合掌致礼，看着释迦牟尼佛，佛问候说：“世尊啊，您没有病痛，没有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>吧？您身心安稳快乐吧？所应该度化的众生都容易接受教法吧？他们没有使世尊感到疲劳吧？”</p><p>　　接着，四大菩萨又用偈颂格式问安道：“世尊啊，您很安乐吧？没有疾病、烦恼吧？教化众生辛苦吧？诸众生接受您的教化还容易吧？他们没有使您感到疲劳吧？”</p><p>　　这时，释迦牟尼佛在大众之中说道：“是这样！是这样！各位善男子，如来我很安乐，无病无忧，所有众生也很容易教化，所以我并不感觉疲劳。为什么呢？因为所有这些众生，他们生生世世，一直到今世以来，时常接受我的教化，同时，他们在过去的诸佛面前恭敬皈信，尊重<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，从而种下许多善根。所以，这些众生一开始见到我的身相，听到我的说法，便立即信从接受，从而证入如来的无上圣智，除非那些原先修习小乘的众生。不过，对于这些众生，我现在也要让他们所闻这部经典，以便证入佛的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。”</p><p>　　这时，诸大菩萨又以偈颂格式说道：“善哉！善哉！佛啊，您是伟大的圣雄，<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>最尊贵者非您莫属。诸众生在您的神力加庇下，变得容易教化，从而使他们有幸听到诸佛深妙的智慧，并在听闻之后信受奉行。我们这些菩萨对此非常高兴，也愿<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>这种<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。”</p><p>　　当此之时，释迦牟尼佛赞扬这几位大菩萨说：“善哉！善哉！各位善男子，你们大家能在如来面前以随喜之心，真是难能可贵啊！”</p><p>　　这时，<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨和八千恒河沙数那么多的菩萨都这么想：“我们从往昔以来，从来没有见到，也没有听过这么多的菩萨从地下涌出，一下子都站在世尊面前，合掌致礼，恭敬供养，并向如来问候请安。” 这时，弥勒这位菩萨中的大菩萨，已晓得了八千恒河沙数那么多的菩萨，他们心中所怀疑的问题，并且他自己也想解决这些疑问。因此，弥勒菩萨便双手合掌，向佛致礼，以偈颂格式问道：</p><p>　　“从地下涌出的无量大菩萨有千万亿那么多，我们过去从未见到过，愿<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>具足的世尊为我们讲一讲，他们到底是从什么地方来的？到底以什么<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而聚集在此法会当中？他们皆现巨身，有很大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力，所具备的智慧更是不可思议。他们的心志与信念十分坚固，具有很大的忍辱之力。众生乐意见他们，但却不知他们从何而来。另外，每一位菩萨所率领的眷属，其数没有限量，如像恒河沙数那么多。其中有的大菩萨率领着六万恒河沙数那么多的</p><p>　　弟子。这些大众皆是一心一意地追求佛道。这些六万恒河沙数那么多的菩萨大师一同来供养佛，又发愿护持这部《法华经》。有的大菩萨率领着万恒河沙甚至更多的眷属，有的大菩萨率领的眷属则有四万、三万、二万、一万、一千、一百、一直到一恒河沙或半条三分之一条、四分之一条直至亿万兆分之一恒河沙数那么多，有的菩萨的眷属则是千万亿兆，亿万直到半亿或更多一些的弟子。还有的菩萨，其眷属一百万直至一万、一千、一百、五十、一十再到三、二、，一个相互不等。有的大菩萨单独一人，没有眷属，因为他们乐于独处，不愿收徒弟。现在，这些菩萨也都来到释迦牟尼佛的道场中。以上所说的菩萨之数量，假使有人设法计算，就是经过恒河沙数那么多年代，也不能完全知道他们的数目。</p><p>　　“这些具有大威德、精进修行的菩萨众，最初是谁为他们说法，教化他们而得成就如此功德的呢？他们是从谁<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>的？他们称扬何种<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>？<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>奉行哪一部经典？修习何种佛道？这些菩萨神通广大，神智无边，弄四方在地震裂，他们从中全都一涌而出。世尊啊！我从昔来，从未见到这种事情，愿您为我们说说他们从何而来以及他们所在国土的名号。我经常游历诸国，可从未见到过这些菩萨大众，他们当中，我连一个也不认识，如今忽然从地下涌出，请求世尊为我们说说其中的因缘。在今天的大法会之中，有无量百千亿个菩萨都想知道这件事情。所以，敬祈具有无量功德的世尊讲释这些菩萨的来龙去脉，以消除众人的疑惑。”</p><p>　　这时，释迦牟尼佛的各种<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>佛，从他方无量无数的国土中来到法会现场，他们在遍布八方的各种宝树下的狮子座上，结跏趺坐。这些佛的侍者，也都见到了上述菩萨大众在<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>的四方从地下涌出并住于虚空的情景，于是，他们各自对其所侍奉的佛说：“世尊，这些无量无数的菩萨大众到底从何而来？”</p><p>　　这时，释迦牟尼佛的分身的诸佛各自告诉他们的侍者说：“各位善男子，请稍等片刻，有位菩萨中的大菩萨，名叫弥勒，是释迦牟尼佛业记授记将随其之后作佛的菩萨，他已提出了这个问题，释迦牟尼佛现在就要答复他，你们自当因此而听到佛的解释。”</p><p>　　此时，释迦牟尼佛告诉弥勒菩萨说：“善哉！善哉！阿逸多啊，你能问佛这样大的问题，你们大家应当共同一心，披上精进的铠甲，立下坚强的意志，如来今天要显示宣说诸佛的无上智慧，以及诸佛的<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>神通之力，诸佛狮子般的奋迅之力，还有诸佛的威猛大执之力。”</p><p>　　这时，释迦牟尼佛想重申此义，便又以偈颂格式说道：“诸位应当勇猛精进，专一其心，我将要说明此事，你们切勿有什么怀疑。佛的智慧是玄妙而不可思议的。你们现在都拿出了<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>和力量，修习忍辱之行，滋养诸善之根，过去，你们没有听过这种佛法，今天，你们就要听到了。我现在安慰你们，不要心怀疑惑和恐惧，佛所说的法，真实不虚，佛的智慧，不可称量。佛所获证的第一妙法，犹如大海，深不可测。这些，我现在就要给你们讲说，你们应当专心致志地来听。”</p><p>　　释迦牟尼佛说完如上偈语之后，告诉弥勒菩萨说：“我现在对你们这些参加法华盛会的所有大众宣告。阿逸多啊，这些无量无数的大菩萨，从地下一涌而出，你们大家在往昔的时候从未见过。我在这个娑婆世界<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>至高无上的圣智之后，成为这个世界的教主<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，我教化、指导这些菩萨，调伏其心，使他们发下了求证无上妙道的誓愿。这些菩萨都居住在娑婆世界的下方，即十方世界中的下方世界的虚空中，他们对于一切佛经，或读或诵，非常流利，并在此基础上，认真思索分析，正确地记忆和回味。阿逸多啊，这些善男子们不喜欢在大众喧嚣的地方有所多说，而乐于在清幽寂静的地方精进修行，一刻不息。他们既不住于天上，也不住于人间，他们总是喜欢深奥的智慧，没有任何障碍。对于诸佛之法，他们也爱不暂舍，一心一意地修习，精进不息，以求获证至高列上的智慧。”</p><p>　　这时，释迦牟尼佛为了重宣此义，便以偈语形式说道：“阿逸多啊，你们应当知道，这些大菩萨从远古时代以来，就一直修习佛的智慧。他们都是经过我的教化而发下了上求佛道的大愿。他们就像我的儿子一样，总是离不开这个世界。他们常修苦行，安于寂静，远离大众的昏昧与吵闹，沉默寡言，一心修道。这些弟子为了求证无上的佛道，昼夜六时，精进不息地学习我的道法。他们住在这个娑婆的下方虚空中，意志和信念十分坚强，恒常勤求佛的智慧，演说种种微妙之法，内心没有任何畏惧。我在摩揭陀国伽耶城的一棵菩提树下<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>，证得至高无上的圣智，成为如来佛，此后开始转无上*轮，弘扬佛法，那时，我便教化这些人，使他们发下了求证佛道的誓愿。始今，他们都达到了不再退转的修行阶位，未来都将<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a><a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。我今天所说的都是真实之语，你们应当专一其心，相信我从久无以来就一直教化这些菩萨大众。”</p><p>　　这时，大菩萨弥勒和无数菩萨听了释迦牟尼佛的话，内心产生了疑惑，觉得很奇怪，怎么从未听说过，他们在想，为什么世尊能在如此短的时间内教化这样多的菩萨，使他们都证得至高无上的圣智？</p><p>　　于是，弥勒菩萨对佛说：“世尊，您当年作为迦毗罗卫国净饭王的太子时，为求<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之道，走出释家的王宫，在距离提伽耶城不远的地方，坐在菩提树下的道场中，证得至高无上的圣智。从那时以来，到现在只不过四十多年。世尊，您怎么能在如此短的时间里，大作佛事，运用佛的势力、佛的功德，教化如此无量无数的菩萨，并使他们有把握在将来也证成至高无上的圣智呢？世尊，这些菩萨的数量之多，即使有人在亿万年中地直去数，也是数不完的。这些菩萨从很久以来，在无数个佛世界中，种下了许多善根，成就了菩萨之道不停地清净修行。世尊，这等事情。世人难以置信。譬如有人，他的面貌佼好，头发乌黑，年纪二十五岁，竟指着一位业已百岁的老人说：‘你是我的儿子。’那位百岁老人指着这位年轻人说：‘你是生我养我的父亲。’像这样的事情，简直太难以置信了。佛也是这样，自从您证成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>以来，时间的确并不太长，但这些菩萨大众已在无量千万亿年前，为了求证佛道而精勤修行，他们善于入定，善于出定，也善于住于定中，对于各种各样的定，甚至亿万种定，都是这样。他们获得了巨大的神通，长期修清净行的法门，善于依次修习各种善法，又善于巧妙地回答所有的问题。他们不愧是人类之中最尊贵的菩萨，在任何世界之中都是极其少有的。今天 ，世尊却说您在证成佛道之后，才使他们发菩提之心，规律性化示导他们趋向于无上圣智。然世尊证得佛果的时间并不算久，竟能作出如此具有巨大功德的事情。我们虽然相信佛根据众生根机而随宜所说的佛法，我们知道，佛所说的话从来都是真实不虚的，佛所知晓的事情绝对是通达无误的。但是我们担心将来初发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>的菩萨，在佛灭度之后，若是听到这种说法，会有人不相信，不接受，从而产生破坏佛法这种罪业的因缘。正因为如此，请世尊您为我们作进一步解释，以消除我们的疑惑，也好让未来之世的各位善男子在听闻此事之后而不会产生疑惑。</p><p>　　这时，弥勒菩萨为了重申其义，又以偈颂格式说道：“佛昔日从释迦种族出生，后来<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>来到伽耶城附近，坐于菩提树下开悟成佛，从那时至今，时间并不长久。再看这些<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>，他们的数量多得难以称计，很久很久以来，这些人就已修行佛道，拥有巨大的神通之力，善于修学<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，不受世俗的污染，就好像出水芙蓉一样清净。现在，他们从地下涌出，站在佛的面前，无不心怀恭敬。这等事情更是不可思议，难以置信。因为佛得道的时间很近，而此间所成就的众生又如此众多。请您为我们如实而分别地解释其中缘故，以消除众人的疑惑。我再举一个例子，譬如有个年少力壮的人，年纪刚刚25岁，可他却指着一位百岁老人，说是他的儿子。这位老人已是鬓发花百，满面皱纹。年轻人却说他是自己亲生儿子，而那个老人也说，年轻人就是自己的父亲。这等父少子老的事情，全世界的人都不会相信的。世尊也是如此，得道成佛以来并没有多少时间，而这些菩萨，志向坚强，毫不怯弱，他们从久远的年代开始，就修行菩萨道，善巧答问，心<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>惧，忍辱顽强，相貌端正，<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>高尚，受到过十方诸佛的称赞。他们善于分别说一切法，平时，不喜欢在闹市人群中周游，而喜欢<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>入定，为了求得佛道，他们居住于下方世界的空中，我们亲耳听佛讲说，对此事不应有怀疑，但为了未来的众生对此能够理解，请佛演说其中的道理。假使有人对《法华经》产生怀疑而不相信，那么这些人就会堕于三种恶道之中，所以，还请世尊大发慈悲，对《法华经》中的这一说法进行解说。也就是说，这些无量无数的菩萨，为什么会在很短的时间内得到您的教化，以至发下求佛道的誓愿，从而达到了不退转的修行阶位。</p></div>"
    },
    {
        "title": "妙法莲华经 如来寿量品第十六",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　如来寿量品第十六</p><p>　　这时，释迦牟尼佛告诉诸位菩萨和<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上所有其它听众说：“各位善男子，你们应当相信和理解如来佛的真理之语。”</p><p>　　接着佛又告诉大众说：“你们应当相信和理解如来佛的真理之语。”</p><p>　　此后，佛又第三次告诉大众说：“你们应当相信和理解如来佛的真理之语。”</p><p>　　这时，菩萨大众以<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>为首，恭敬合掌，对佛言道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，请您开讲吧，我们一定相信、接受佛所说的一切。”这样说了三次，佛仍是默默不语，弥勒菩萨又说“请您开讲吧，我们一定相信、接受您所说的一切。”</p><p>　　这时，释迦牟尼佛见诸菩萨三次请法而不止，就对他们说：“你们都仔细听着，如来佛有秘密的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的天神、人类和阿修罗都认为，现在的这位释迦牟尼佛，从释迦族的王宫中出走，在离伽耶城不远的地方，坐于<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树下的道场中，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>了至高无上的圣智而<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。</p><p>　　但是，善男子们，实际上我自成佛以来，已过了无量无边百千万亿兆劫的时间。举个例子来说，譬如有五百千万亿兆阿僧·数那么多的<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>，假使有人将这么多的世界全部磨碎为微尘，然后又拿着这些微尘一直向东走，经过五百千万亿兆阿僧·数那么多的国家，便扔下一粒微尘，这样一直向东走。直到把这些微尘扔完。诸位善男子，在你们看来，这下所涉及的世界究竟有多少？能用思惟、算数得知其数目吗？”</p><p>　　弥勒等<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>同时对佛说：“世尊，这些世界无量无边，既非算数所知，也非心力所及。一切声闻乘和缘觉乘的修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，以其断尽<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>的清净智来思惟，也不能知道这些世界的最终数目。我们这些菩萨乘的<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者虽然已达到了不退转的阶位，但对这些世界的数目也是不能了达的。世尊，这些世界的确是无量无边啊！”</p><p>　　这时，释迦牟尼佛告诉诸菩萨说：“各位善男子，我现在应当对你们明确宣示，所有这些世界，不论它投有一粒微尘，还是未投有一粒微尘，全都粉为微尘，假若一粒微尘代表一劫那么长的时间，那么，我自成佛以来所经过的时间，已经超过这个数目百千万亿兆阿僧·劫。自从那个时候以来，我常在这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a><a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，也曾在其它百千万亿兆阿僧·数那么多的国土内教导、利益众生。</p><p>　　“各位善男子，从我成佛到现在这段极其漫长的年代中，我曾说过燃灯佛等诸位如来的事情，还谈到他们<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>的情况，这些都不过是以方便法门而随机讲说的。各位善男子，假使有众生来到我的处所，我就用佛眼来观观察他们的信、进、念、定、慧等五根，看他们的根性是伶俐还是愚钝，然后，根据他们的具体情况，采取不同的手段教化他们。人在不同的地方，说自己的名字均不相同，表现出的年纪大小也不一样。我也曾说我将要涅槃，还曾以种种方便法门，随机演说微妙的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，能使众生心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。各位善男子，如来佛见有些众生喜欢小乘法，这些人<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>浅薄，烦恼垢重，如来便对他们说：‘我在年少时<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>，最后证得了至高无上的佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。’可实际上，我自成佛以来，所历年月已如上面所说了那么久远，只是为了以方便法门随机教化众生，使他们导入于佛道，所以才这样说。</p><p>　　“各位善男子，如来佛所演说经典。都是为了救度众生脱离苦难而演说出来的。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>化众生时，有时说自己的身，有时示现自己的身，有的示现他佛的身；有时开示自己的三世<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，有时开示他人的三世因缘。佛所说的一切都是真实不虚的。为什么呢？因为，如来佛如实地观察到了欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>等此岸<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>的真相，既没有生，也没有死；既不退于内，也不出于外；既不住世，也不入灭；既非实有，也非虚无；即非一如，也非相异，不像三界的众生，见到三界，就认为有个三界。诸如此类的事相，只有如来佛才能明见无误。因为众生有各种各样的习性、各种各样的欲望、各种各样的业行、各种各样的忆想和分别，所以，佛为了让众生都能种下善根，便以各种各样的因缘、譬喻、言辞，演说各种各样的佛法。佛的教化事业从未有一时一刻暂废。就这样，我自成佛以来，时间极为久远，我的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>已有无量阿僧·劫，我<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>于世，并未灭度。各位善男子，我在往昔修行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>时所成就的寿命，至今犹未到头，这种寿命的长久，比我现在已有的寿命要大好多倍。这么说来，我现在说要入涅槃，并非真实的灭度，而只是方便说法，假设将要灭度，以便教化众生罢了。</p><p>　　“为什么呢？因为，佛如果一直住于世间，不入涅槃，那么，福德浅薄的人就生起依赖之心，不想去种善根。贫穷下贱的人众生就会贪着于财、色、名、食、睡等五种欲乐，不知不觉堕落在颠倒忆想的妄见罗网之中。他们如果见到佛常住于世，不入灭度，他们便会生出骄傲放纵的心性，从而感到厌倦，逐渐<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>，不能生起如来佛难以遇到的想法，也难以生起对佛的恭敬之心。所以，如来佛以方便法门，随宜应机地说道：‘各位<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，你们应当知道，诸佛出世，太难遇到了。’为什么这样呢？因为，一些福德浅薄的人，经过无量百千万亿劫那么长时间，有的见到了佛，有的没有见到佛，所以，我才这样说：‘各位比丘，如来佛是很难见到的。’这些众生听到这样的话以后，必会产生如来佛很难遇到的想法，于是他们就会心怀爱恋、仰慕，渴望见到<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，这样，他们便种下了善根。所以，如来虽然没有真正的灭度，但仍用方便法门权且说如来将要灭度。另外，各位善男子，所有的如来佛都是这样说法的。他们为了教化救度众生而说的法，都是真实不虚的妙法。</p><p>　　“举例来说，譬如有一位良医，睿智聪颖，熟悉各种方药，善治各种疾病。此人<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>众生，比方说十个、二十个或者甚至上百个子女。这位良医因某些事情而远走他国，家中的儿子慌闷狂乱，在地上滚来滚去。正在这时，他的父亲从遥远的外国回到家中。这些儿子已经中了毒，有的已失去了知觉，有的还算清醒。他们远远望见父亲之后，都感到非常高兴，于是跪拜在地，向父亲问候道：‘父亲，您平安归来，别来可好吧！我们兄弟太愚痴了，不小心把毒药给吃了，愿您为我们治疗，再给我们一次<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>吧！’父亲看见自己的儿子们如此<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>悲伤，便根据医经中的方法寻求解毒最好的药草，既颜色好看，又味道甜美，可谓色、香、味俱全。然后拿来对儿子们说：‘你们把这些药草服下，即可速除病痛，不会再有任何危险。’他的儿子们当中，有些人神志清醒，看见这般色香俱好的良药，便立即服了下去，他们的病痛便痊愈了。但那些中毒太深业已昏昧的儿子，看见父亲回来，虽也欢喜问安，求父治病，可是，父亲给他们的解毒药，他们却不肯服下。为什么呢？因为毒气深入，使其原本清净的<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>丧失了，对于这种色香味美的好药，却不认为是好药。</p><p>　　“这位父亲心想：‘这些儿子真是可怜，他们中毒太深，理性已经迷乱颠倒，所以，虽然看见我回来也很高兴，也求我治病救命，但我给他们配出这么好的药，他们却不肯服下。看来，我现在只好采取方便权宜之法，使他们服下此药。’于是，这位父亲就对儿子们说：‘你们应当知道，我如今已经老了，身体衰弱，死期已到。这些上好的良药，现在就留在这儿，你们可以取而服之，不要担忧这病不会痊愈。’留下这番教诲之后，这位父亲又到其它国家去了，接着他又派一位使者回来，对儿子们说：‘你们父亲已经去世了。’这时，诸位儿子听说自己的父亲死于他乡，风心十分忧伤，心想：‘若父亲在世，他老人家慈悲为怀，怜悯我们，我们能够得到他的救护。如今，他老人家撇下了我们，命丧他乡。我们现在孤苦零仃，再也没有依靠了。’儿子们因为心中悲伤，感叹不已，反而慢慢地清醒过来，<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>到父亲所留之药，色香味俱全，于是拿来服下，所中之毒即祛除。他们的父亲听说儿子们都已痊愈，便立即从国外归来，使孩子们又全都见到了自己的父亲。</p><p>　　“各位善男子，在你们看来，是否有人会说这个良医犯了虚妄之罪呢？众人齐声回答说：“不会，世尊。” 释迦牟尼佛接着说：“我也是如此，自成佛以来的无量无边阿僧·劫当中，为了救度众生，以方便法门权且而说将要灭度，也同样不会有人说我犯了<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>之过。”</p><p>　　这时，释迦牟尼佛欲重申这种义理，便又以偈颂形式复述道：“自从我证得<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>以来，所经历的劫数有无量百千万亿兆阿僧·数那么多。在此期间，我说法教化了无数亿众生，使他们都入于佛道。自从那时以来的<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>时间里，为了救度众生，我以方便法门，示现涅槃之相，但实际上并未灭度，而是常住此世间，说法度众生。我虽然常在此法会之处，以各种神通之力为众生说法，但为愚痴所颠倒的众生即使离得很近，却还是见不到我。众生<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>并得到调伏之后，个性变得直率而朴实，心意民变得温柔而顺服。他们一心一意想见到佛，甚至不惜自己的生命。这时，我与一切僧众一起出现于灵鹫山的法会中，我对众生说：‘我一直在此，永远不灭。’在其它国土中有些众生恭敬信仰佛法，我在他们之中演说无上妙法。你们没听说过这种事情，只认为我灭度了。我见诸众生沉没于<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>之中，所以不为他们示显身相，使他们生起渴望与敬仰。因为他们内心对佛产生了恋慕，所以我才现身为他们说法。我具有如此神通之力，在阿僧·数那么漫长的岁月中，一直住在灵鹫山和其它各种住处。众生见到劫尽的时候，发生大火灾，世界毁灭，可佛居住的地方却非常安稳，天神与人类充满其中，园林楼阁以各种宝物装饰起来，宝树所结的花果也非常繁盛，众生在此间游乐，诸天神击响于鼓，作着伎乐，散下天花，落在佛及大众的头上。</p><p>　　“我的<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>永不毁坏，但众生却看见了烧尽一切的景象，故而充满了忧愁、恐怖等苦恼之情。这些众生因为有往昔的恶业因缘，所以，经过无量无数的漫长岁月，也听不到佛、法、僧<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>的名号。一切修行而有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>的人，其性情柔和率直，这些人都可见到我的<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>在此说法。有的时候，我为这些众生说佛寿命无量，对于长久见佛的众生说佛难遇到。我的智力就是这样，智慧之光能照耀到无边的地方。我的寿命有无量劫那么长久，这都是长期修持善业的<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。</p><p>　　“你们都是有智慧的菩萨，切勿对此产生怀疑，应当将怀疑心断尽，相信佛语真实不虚。就好像那位良医，善于使用方便法门，为了救治癫狂的儿子，虽然自己确实在世，但却说自己死了，这不能说他打了妄语，我也是世人的父亲，所以想救护一切受苦受难的众生。因为凡夫颠倒<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，所以，尽管我确实在世，但却说是灭度了。这些众生因为经常看见我的缘故，产生了骄傲放纵的心情，从而贪着于五欲，将堕落于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生等三恶道之中。我知晓众生的根性，知道谁行道谁不行道，所以，我能随各人的具体情况，根据其应该能够救度的方式，为他们说各种不同的佛法。也正因为如此，我经常私下考虑，以什么办法使众生得入无上佛道，尽快成就佛果。”</p></div>"
    },
    {
        "title": "妙法莲华经 分别功德品第十七",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　分别<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>品第十七</p><p>　　这时，法华会上的大众听到释迦牟尼佛说如来<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>的劫数如此漫长，这些无量无边阿僧·那么多的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>均获得了巨大的教益。此时，释迦牟尼佛告诉<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>大菩萨说：“阿逸多啊，我在说如来寿命如此长远时，有六百八十万亿兆恒河沙数那么多的众生由此<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>了无生法忍的阶位；又有比此多千倍的菩萨、大菩萨获得了总持法门；又有将一个世界粉为微尘数那么多的菩萨、大菩萨得到了乐说<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的无碍辨才；又有同上一世界微尘数的菩萨、大菩萨获得了百千万亿乃至无量的旋转无量法门的旋陀罗尼门；又有将三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>粉为微尘总数那么多的菩萨、大菩萨由此能勇猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>，大弘佛法，即能转不退*轮；又有将中千世界粉为微尘所得微尘总数那么多的菩萨、大菩萨由此能摧破<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，清净<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，即转清净*轮；又有将一小千世界粉为微尘所得微尘总数那么多的菩萨、大菩萨由此经过八次<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>将证得至高无上的佛智；又有将四个四大部洲粉为微尘所得微尘总数那么多的菩萨、大菩萨由此经过四度转生将证成至高无上的佛智；又有将三个四大部洲粉为微尘所得微尘总数那么多的菩萨、大菩萨由此经过三度转生将证成至高无上的佛智；又有将两个四大部洲粉为微尘所得微尘总数那么多的菩萨、大菩萨由此经过两次转生将最终证成至高无上的佛智；又有将一个四大部洲粉为微尘所得微尘总数那么多的菩萨、大菩萨由此经过一次转生就可证得至高无上的佛智而最终<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>；另外还有将八个世界粉为微尘所得微尘总数那么多的众生由此发下了求证至高无上的佛智最终成佛的宏大誓愿。”</p><p>　　释迦牟尼佛说这些菩萨、大菩萨获得何等巨大的法利益时，天空中犹如下雨一样，降下了小曼陀罗花和大曼陀罗花。天花飘落在无量百千万亿棵宝树下狮子座上各位如来佛的身上，飘落在七宝塔中狮子座上释迦牟尼佛和久已灭度的多宝如来的身上，也飘落在所有的大菩萨和<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>的身上。天空中还像下雨一样撒下了·檀香、沉水香的细末。与此同时，<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中，天鼓自鸣，妙声悠远。接着，虚空中又飘下了上千种天衣，天衣上垂挂着各种各样的璎珞，如珍珠璎珞、摩尼珠璎珞、如意珠璎珞。这些华丽的天衣缤纷而落，遍布四面八方和<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的中心地带。各种各样的宝香炉中，燃烧着无价的上品妙香，香味自然飘散，弥漫各个角落，以<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>这次法华大会。大每一位释迦牟尼佛<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>的如来佛上边，都有很多菩萨，手执宝幡和宝盖，依次飘然而上，直至梵天之境。这些菩萨以其微妙的声音，唱出无量的偈颂，赞叹这些如来佛。</p><p>　　这时，弥勒菩萨从座位上站立起来，身披袒露右肩的<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>，向释迦牟尼佛合掌致礼，然后以偈颂格式说道：“佛说如此少有之法，我过去从未听过。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>有巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力，寿命不可计量。无数<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>听到世尊分别讲说获得法利益的情况，浑身上下都充满了<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>之情。根据世尊刚才所说，听您说此妙法之后，一些菩萨住进不退转的<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>阶位，有的菩萨得到了总持法门，有的菩萨获得了无碍乐说的才能，有的菩萨得到万亿种旋转总持的法门。另有大千世界微尘数的菩萨由此能转清净之*轮；还有小千世界微尘数的菩萨由此能转生八次就可最终证成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>；还有四组、三组、二组四部洲微尘数的菩萨也由此只经过四次、三次、二次转生之后，便可最终证成佛智而成佛。另有一组四部洲微尘数的菩萨由此只经过一生即可证成佛智而成佛。以上所说的这些菩萨，听到佛说如来寿命长久，故而得到了无量无数的清净<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。此外还有八个世界微尘数那么多的众生，听到佛说如来寿命长久之后，都发下了求证无上佛智的誓愿。世尊，当您说这极其不可思议的佛法时，有大量的众生从中受益，利益之广，犹如虚空一样无边无际。</p><p>　　“天空飘雨般下起了曼陀罗、大曼陀罗等各种天花，释提桓因和大梵天王就像恒河沙数那么多，纷纷从无数个佛国世界来到这里。·檀、沉水等名贵的香末如飞鸟一样从天空中缤纷飘坠，散于诸佛面前，作为对佛的供养。天鼓在虚空中自然发出微妙的声音，千万种天衣从空中旋转而下，各种美妙的香炉，焚烧着无价的名香，香气自然飘散，周遍法界，来供养所有的如来佛。那些大菩萨们，各执用七宝装饰的宝幡和宝盖，华丽无比，气象万千，依次徐徐上升到梵天之中。他们在每一位佛的面前竖起宝幢，悬起宝幡，并以千万种偈语歌颂如来佛。各种各样的盛事是过去从未有过的。凡是听到如来佛寿命无量的，无不充满欢喜。佛的名号传遍十方，为众生带来了极大的好处，使他们都种下了善根，帮助他们发起求证无上佛道的心愿。”</p><p>　　这时释迦牟尼佛对弥勒大菩萨说：“阿逸多啊，若有众生听说如来佛的寿命如此长久，能在一闪念间产生信奉理解的心意，那么，他所获得的功德就没有限量了。如果有善男子和善女子为求证至高无上的佛智，在长达八十万亿兆劫的岁月中修行五种从此岸度脱到<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a><a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>的波罗蜜法，即：<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>波罗蜜、持戒波罗蜜、忍辱波罗蜜、精进波罗蜜、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>波罗蜜，不包括<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>中以<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>度彼岸的<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。由这种持所得到的功德与听闻如来寿命长久而一念间产生信解所得到的功德相比，此功德的百分、千分、甚至百千万亿分不及彼功德的一分，就是用算数来推算，用譬喻来形容均无法探知彼功德的巨大程度。如果善男子、善女子具备了这样的功德，那么，他们绝对能够证得至高无上的佛智而<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>成佛。”</p><p>　　这时，释迦牟尼佛为了重复以上义理，便又以偈颂格式复述道：“若有人追求佛智慧，在长达八十万亿兆的劫数中，修行五种波罗蜜法，却不如一念间信解如来寿命长久所得到的功德大。具体来说，他们在如此长的劫数中，以珍异的饮食、上好的衣服、卧具以及园林环绕的、以·檀木建立的精舍等种种微妙的布施，来供养佛以及缘觉乘弟子和菩萨大众。诸劫之中始终如此，以求证无上佛道。同时，他们还严持各种禁戒，既清净无染，又<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无缺，以此上求佛道。受到诸佛的称赞。他们还修行忍辱法门，处于调顺柔和的心理状态，假使受到各种恶意对待，他们心里也不会<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>。假使受到那些傲慢无理的所谓得法者的轻视和扰乱，他们也能够忍受。他们还勤修精进法门，志向与信念始终坚不可摧，无量亿劫的时间里，没有一时一刻的<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>与停息。他们还修禅定法门，在无数劫的岁月中，住在寂静的地方，或者<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>，或者行走，都要摄心收念除过睡觉之外。由此他们能够生出各种禅定，在长达八十万亿劫的时间里一直安住禅定之中，心里无一丝散乱。他们把这种由禅定达到摄心一处的福德，用于追求无上佛道，以誓在穷尽一切禅定之后，获得至高无上的圣智。综上所述，这些修行 五波罗蜜法的众生，在百万亿劫的漫长岁月中，的确积下了许许多多的功德。但是，如果有善男信女听我说如来寿命长久之后，能于一转念间产生<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>之心，那么，此人的福德比他们的功德还要多。如果有人排除了一切疑惑，在须臾间产生了深深的<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，他的福德就是这么巨大。</p><p>　　“有些菩萨从<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>数以来，修行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，当听到我讲说如来寿命长久之后，便能信奉接受。这些人顶戴信受这部经典，并发愿希望我将来一直长寿不灭，以便救度众生。就像现在的世尊，是释迦族的法王，坐在道场之中，如狮子一般毫<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>惧地说法。他们希望未来之世，自己受到一切众生的尊敬，像现在一样，坐在道场中，并像今天如来佛讲说寿命长久一样讲说自己寿命的长久。假使有人心境深沉、清净无染、质朴直率、多闻强记并获得了总持法门，他们对于这种说法就不会有任何怀疑。”</p><p>　　“另外，阿逸多，如果有人听到如来寿命长久，能理解其中的含义，那么，此人所获得的功德是没有限量的，他必会由此证悟佛的无上智慧。何况有人能听闻此经的全部，并教别人听闻，自己依之修持，并教别人修持，自己抄写，并教别人抄写，还以鲜花、妙香、璎珞、宝幢、宝幡、宝缯、宝盖、香油灯、酥油灯等供养这部经典，那么，此人的功德更是无量无边，他由此将会成就如来佛的无上圣智。阿逸多，假如善男子、善女子听我说如来寿命长久，内心深信不疑，并了解其中义趣，那么他就能够看见佛常在灵鹫出上，同大菩萨和声闻乘弟子一起，在他们的环绕下，演说《法华经》。他还能看见，这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>的大地用琉璃铺成，到处平整坦荡，四面八方的大道由阎浮提河的檀金作界，七宝之树，排列成行，所有的楼阁和观台皆用七宝作成。诸大菩萨们都住在其中。假若有人能观察到这种景象，应当知道此人已有了深信《法华经》的信解相。</p><p>　　“还有，在如来佛入灭度之后，若有人听到此经，不加诽谤，并随顺经义而产生欢喜之心，应当知道，这也是深信《法华经》的信解相。何况如果有人能读诵、<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，那他就是在顶戴如来。阿逸多，这些善男子、善女子已不必再为我建立塔寺，不必再建造僧房，也不必再以衣服、饮食、卧具、医药四事供养僧众。为什么呢？因为这些善男子、善女子受持、读诵这部经典，本身就算是建立佛塔、僧房和供养众僧。这也算是为供养<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>而建起七宝塔，这塔由下而上，逐渐缩小，直达梵天。塔上悬挂着各种幡、盖以及宝玲、鲜花、妙香、璎珞、末香、涂香、<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>、从鼓、伎乐、竹箫、铜笛、箜篌，演奏种种的舞戏和微妙的音乐，来歌咏、赞叹、颂扬。这种供养持续无量千万亿劫那么长时间，而受持、读诵这部经典，就等于完成了这种供养。阿逸多，若我灭度之后，有人听到这部经典能够信受持行，自己抄写，并教别人抄写，那他就等于是建立了僧房。这僧房用红色的·檀木材，共有殿堂三十二栋，有八棵多罗树那么高，宽敞雄伟，富丽堂皇。成百上千的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>住在其中。这里还有园林、浴池、散步的路径、坐禅的洞窟。衣服、饮食、床褥、汤药及其它乐器也是一应俱全。这样的僧房和堂阁达百千万亿座，数量之多，无法统计。受持《法华经》就等于建造了这么多的僧房并把它们拿来供养我和僧众。所以，我说在如来灭度之后，若有人能受持、读诵此经，自己抄写或教他人抄写，供养经卷，那么，此人就不必再建起塔庙、修造僧房、供养僧众。”</p><p>　　“何况还有一部分人，他们在受持此经的同时，还能兼行布施、持戒、忍辱、精进、禅定、智慧等六种波罗蜜之法，这些人的功德最为殊盛，可说是无量无边，就像虚空一样，找不到它的边际，就像东西南北、四维和上下等十方一样，不可限量。这些人的功德如此巨大，他们很快就会达到无所不知的佛智果位。如果有人读诵、受持此经，为他人解说，自己抄写，并教别人抄写，与此同时还能建起佛塔、兴建僧房、供养并赞颂声闻的僧众，并以百千万亿种赞叹的方式赞颂菩萨的功德；另外，还能根据其它人的其体情况，随顺经文义理，机动灵活地讲解这部《法华经》；并且，他还能清净持戒，与温和者同处，忍辱无怒，意志坚强、常习坐禅，深入妙定，勇猛精进，<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>利人，天性聪明，富有智慧，善于答辨。阿逸多，如果我灭度之后，善男子、善女人们能在受持、读诵此经的同时，还能有这样的善良功德，应当知道，这些人已经走向道场，接近至高无上的佛智，已坐在了<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树下，快要悟道成佛了。阿逸多，凡是这些善男子、善女人坐、立或散步的地方，均应建起高塔，所有天神和人类都应像供养佛塔一样，供养这些宝塔。”</p><p>　　这时，释迦牟尼佛为了重复以上义理，便又以偈语格式说道：如果我灭度之后，有人能奉持此经，这人的福德已如以上所说，便大得无以称量。能奉持此经，就等于作了一切的供养，如为供养<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>佛而建起宝塔。宝塔由七种珍宝装饰，塔的外形与塔的刹竿，十分高大，由下而上逐渐缩小，直达梵天。塔上宝玲成千上万，随风吹动，传出妙音。不光建起这样的宝塔，而且于无量劫的时间里一直供养此塔。如用鲜花、妙香、璎珞、天衣、伎乐供养，用香油灯、酥油灯在周围照明。在五浊恶世的末法时期，凡能受持此经的人，就等于具足了如上这种供养。假若有谁能受持《法华经》，那就等于他已建造了如来佛现在所处的这种以牛头·檀为材料的僧院，作为对佛和僧众的供养。他所建造的僧院中有三十二座殿堂，每座殿堂高达八棵多罗树。上好的食品、精妙的衣服，坐床、卧具等应有尽有。成百上千的僧众居住在这里。有园林、浴池，有散步的小道，有坐禅的洞窟。种种设备，可谓十全十美。</p><p>　　如果有人对此经起信解之心，并受持、读诵、教人抄写，以鲜花、末香供养经卷，以悦意色花、金色花、胡麻籽等制油，在《法华经》所在之处，燃灯熏之，以为供养。这种供养能得到无量的功德，就好像虚空一样，无边无际。何况有人能在受持引经的同时，兼行布施、持戒、忍辱、精进、禅定、这五种波罗蜜法门，对一切众生不生·怒心，不恶言相加，对塔庙恭敬，对比丘谦下，远离妄自尊大的心理，时常体悟佛的智慧。遇到有人质问责难，也不发怒，随顺机缘，详细为其解说。若能如此修行，此人的功德将不可恨量。遇见成就如此功德的法师，就应以天花、天衣散向其身。像对待如来佛一样对他<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜，心中还应这样想，这位法师不久就会到达成佛的道场，证得清净微妙的智慧，并将为所有的天神和人类带来益处。在他所住的地方、散步的地方、坐卧的地方，甚至在他只说过一句经文的地方，都应该建起宝塔，并以各种方法装饰，使其非常美丽<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>；用各种供物供养，以示恭敬。这位法师作为佛的弟子，住在这里，如同佛一样享受这里的一切，在这里散步、<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>、安卧，一直不离开这个道场。</p></div>"
    },
    {
        "title": "妙法莲华经 随喜功德品第十八",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>品第十八</p><p>　　这时，<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>大菩萨对释迦牟尼佛说：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>啊，若有善男子、善女人听了这部《法华经》之后，能够身心顺从，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>信奉，那么，他们能得多少福呢？” 弥勒又以偈颂格式说了一遍：“世尊灭度经后，若有人听到此经后能身心顺从，欢喜信奉，此人能得多少福？”</p><p>　　释迦牟尼佛告诉弥勒菩萨说：“阿逸多，如来灭度之后，若有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>、女居士及其它有智能的人，不论其年龄大小，听到此经之后能够身心顺从，欢喜信奉，于是从讲经的<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上出来，到其它地方，如僧院、空地、城镇、街巷、村落、田间等，把自己所见到的，根据自己的能力，向父母、宗族、亲戚、好友、熟人讲说。这些人听闻之后，身心顺从，喜欢信奉，又向其它人讲说。其它人听了之后，也能身心顺从，喜欢信奉，并再向另外的人传授到北五十位。阿逸多，这等五十位善男子或善女人喜欢信从《法华经》的功德，我现在就为你讲一讲，你应当仔细听。”</p><p>　　“在四百万亿阿僧·那么多的世界里，有分别处于天界、人类、阿修罗、畜生、饿鬼、<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>等六种境界的四种形态的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，即：从卵壳中出生的众生，由母胎中生出的众生，水中或湿气中出生的众生，无所依托而仅凭业力化出的众生。这四类众生，不论其有无物质性形体，若其无物质性形体，又不论其有无思想活动，或者是无所谓有无思想活动；若其有物质形体，又不论其无足，还是二足，还是四足或者多足。有人为了求取福德，根据所有这一切属于众生范围之内的众生的欲望，给予他们所喜欢的享乐用品，如对每一位众生，分别赠予遍布人间世界的金、银、琉璃、砗磲、珊瑚、琥珀等各种美妙的珍宝以及象、马、车乘和用七宝所建成的宫殿、楼阁等。这样的大施主一直这样<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，长达八十年，然后，心中暗想：‘我已为这些众生布施了各种享乐用具，算是随顺了他们的愿望。但这些众生如今年过八十，均已衰老，头发斑白，满面皱纹，死期将近。现在，我应当以<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>来训导他们。’于是，他便召集这些众生，宣布佛法，指示、教导他们，使他们得到佛法利益而感到欢喜。这些众生很快便得到小乘四圣的果位，即预流果、一来果、不还果、罗汉果。从此，这些众生便根除 了一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，深入于各种<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>之中，无不逍遥<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，获得了八种排除世俗贪爱与系缚的<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之道。在你看来，这位大施主所得到的功德多不多呢？</p><p>　　弥勒菩萨说：“世尊，此人的功德极多，多得无量无边。如果这位施主只布施给众生各种享乐用具，功德已是无量，何况让他们<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>阿罗汉的果位，那功德就更大了。”</p><p>　　释迦牟尼佛告诉弥勒菩萨说：“我现在明确对你说，此人以各种享乐之物布施给四百万阿僧·世界中的<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生，又<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>使他们都证得阿罗汉，他由此获得的功德，不如上述第五十位善男子或善女人听到《法华经》一句而信从所获得的功德，就是其百分、千分、百千万亿分，也不及这种功德的一分，甚至用算数推算，用譬喻来说明，也无法知道这种功德的巨大程度。阿逸多，这第五十位辗转得闻《法华经》从而随顺其义而喜欢信奉的人的功德，尚且无量无边阿僧·这么巨大，何况最初于法华会中听闻此经而胡顺其义、欢喜信奉的人，其功德比这就更大了，纵使无量无边阿僧·数，也不能相比。</p><p>　　“另外，阿逸多，如果有人为了听闻这部经典，专程到僧院中去，不论是坐着，还是站着，只要能在很短时间内听讲、领受，那么，因为这个功德，他<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>来世时，便会得到非常漂亮的象、马、车乘，或者生在帝王之家，乘坐珍宝装饰的帝王辇·，或者转生天上，乘坐天神的七宝宫殿。如果另外有人在讲说《法华经》的地方坐着，这时又来了一人，他便劝此也坐下听讲，并把自己的座位分出一部分让他坐，那么，他的功德可使他来世转生于天帝的坐处，或梵王的坐处，或国王的坐处。</p><p>　　“阿逸多，如果有人对其他人说：‘有一部经名为《法华经》，我们一同去听讲吧。’其它人便接受其指教，甚至只在须臾间听闻此经，那么，此人的功德可使他来世与总持佛法的菩萨同生一处，获得六根聪利的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，在百千万世之中，始终不得·哑之症，口中不会吐出臭气，永远不患舌病和口病，牙齿不垢，不黑、不黄、不疏，也不缺落，不参差，不弯曲；唇不下垂，也不缩蹙，不粗涩，不生疮，不缺、不坏，不歪斜，不厚大，不发黑，总之，就是没有令人讨厌的地方；鼻子正直，不塌陷，不弯曲；脸色不黑，脸形不狭长，不凹陷，没有任何让人不喜欢的外相。总之，他会长得唇、舌、牙齿结实好看，鼻子高直，面貌圆润丰满，眉高而长，额宽而平，具备了一切美好的相貌。不光相貌堂堂，而且世世转生，都能看见<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，聆听佛法，<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>并接受佛的教诲。</p><p>　　“阿逸多，你且看看，劝一人前往听法，功德尚且如此，何况自己能一心一意地听讲、读诵，在大众中为大家分别解说，并根据经文所说而<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。”</p><p>　　这时，释迦牟尼佛为了重申以上义理，便又以偈颂格式说道：“如果有人在法会听到这部经典，甚至只是一句，从而随顺其义，欣喜地向他人讲说，如此辗转传授，到第五十个人，这最后的第五十个人的福德，现在我为你们分别说明。譬如有一个施主，为无量众生提供布施，满八十年，随众生所愿供给一切。后来，发现这些众生呈现出衰老之相，头发斑白，满面皱纹，牙齿松疏，形容枯竭，心想：‘他们离死不远了，我现在应当教化他们，使他们证得<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。’于是，就以方便法门为这些众生演说获证<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>的真实之法，告诉众生：‘<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的一切都是不牢固的，就像水上的泡沫，转瞬即逝；又像大地上的阳焰，似有似无。你们都应当赶紧生厌离之心，切莫再贪恋如梦空幻的红尘了。’这些众生听到这种说法以后，最终都获得阿罗汉的果位，具备了说种<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>、三种通达无碍的智明和舍却对<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>贪恋的八 种<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。上述第五十位听闻《法华经》的人，哪怕他只听了一句，只要能随顺经义，欢喜信奉，那么，他的功德比这位八十年中<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>从生并说法教化众生获得罗汉果所得的福德还要更大，甚至大得不可譬喻。如此辗转得闻《法华经》者的福德尚且无边无量，何况于法会中最初听闻后随顺经义而欢喜信奉者，其福德就更大了。</p><p>　　“如果有人劝导一个人，要把他领去听闻《法华经》，对他说此经深奥微妙，千万劫中难以遇到。那人便接受教诲，跟他一同去聆听，哪怕只听很短一会儿，这人有福德<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，我现在就分别说一说。此人以后，世世没有口腔疾病，牙齿不松疏，不黑不黄，嘴唇不肥厚，不缩不缺，没有令人厌恶的相状。舌头不干燥，不发黑，不短小；鼻子又高又直，额头又宽又平，面目无不端庄俊美，人见人爱。口中无臭气，常放优钵花的香味。如果有人想听《法华经》，专门到僧院中去，在须臾之间听闻，从而欢喜信受，现在说讲讲此人的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。此人来世转生天界或人间，能获得非常美妙的大象、骏马、车乘或珍宝制成的帝王辇·，还可乘坐自由往来的天神宫殿。如果能在讲经说法的地方劝人坐下来一同聆听，由于这种福德的缘故，来世得以<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>到帝释、梵王和国王的宝座上，何况能一心聆听，讲解经中义趣，根据经中所说修行，这种福德大得不可限了！”</p></div>"
    },
    {
        "title": "妙法莲华经 法师功德品第十九",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　法师<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>品第十九</p><p>　　这时，释迦牟尼佛对常<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>菩萨说：“如果善男子、善女人<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这部《法华经》不论是朗读，还是背诵，不论是讲解，还是抄写，那么，此人将会有到八百种眼功德，一千二百种耳功德，八百种鼻功德，一千二百种舌功德，八百种身功德，一千二百种意功德。以这些功德来<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>眼、耳、鼻、舌、身、意六根，使六根清净无染。这位善男子、善女人，以父母所生的清净肉眼，就能看见三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>内外的所有山林与河海。向下可以看到最下层的无间<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>，向上可以看到<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>最高一层的有顶天，也能看见其中的一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，对于这些众生的业行及<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a><a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>的去处等，也悉见悉知。”</p><p>　　这时，释迦牟尼佛为了重宣此义，便又以偈颂格式复述道：“如果有人在大众之中以无所惧之心讲说这部《法华经》，你且听听我说此人的功德。此人能得八百种殊胜的眼功德，由此庄严其眼，所以其眼非常清净，虽然只是父母所生的肉眼，但已能全部看见三千大千世界内外的一切，如弥楼山、须弥山、铁围山，还有其它各种山林、大海、江河等，下至无间地狱，上至有顶天，其中的一切众生都能看见。虽然此人尚未获得天眼，但却具备了如此的神力。”</p><p>　　“再次，常精进菩萨，如果善男子、善女人受持这部《法华经》不论是阅读还是背诵，不论是解说还是抄写，那么，他就可由此获得一千二百种耳功德。凭这种清净的耳根，他就可以听到三千大千世界下至无间地狱、上至有顶天的一切语言音声，如象声、马声、牛声、车辆声、啼哭声、哀叹声、螺声、鼓声、钟声、铃声、笑声、说话声、男人声、女人声、童男声、童女声、<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>声、非法声、<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>声、欢乐声、凡夫声、<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>声、喜悦声、悲哀声、天神声、龙神声、夜叉声、干闼婆声、阿修罗声、迦楼罗声、紧那罗声、摩睢罗声、摩睢罗迦声、火声、水声、风声、地狱声、畜生声、饿鬼声、<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>声、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>声、声间声、辟支佛声、菩萨声、佛声。总而言之，虽然他没有获得天耳，但仅以父母所生的平常而清净的耳根，对于三千大世界中无论发生于内还是发生于外的一切声音，他都能听到。如果分别各种各样的声音，但却不会破坏耳根。”</p><p>　　这时，释迦牟尼佛为了重申以上义理，便又以偈颂格式复述道：“父母所生之耳，清净而无浊秽，以此平常之耳，能听到三千大世界的一切声音。如象、马、车、牛声，钟、铃、螺、鼓声，琴、瑟、箜篌声，竹箫、铜笛声，能闻但不执着的清净妙歌声，闻后皆能分辨知晓的无数种人声，诸天神的声音，微妙的歌声、男人女人声，童男童女声，山川险谷中迦陵频伽乌鸟、共命鸟等鸟鸣声，地获中受苦众生的种种惨烈哀叫声，集聚在大海边的阿修罗相互谈话时所发出的巨大音声。这位讲说《法华经》的人，安住于此地，却能遥闻以上各种声音，而其耳根，并不会为这些声音破坏。在十方内的一切世界中，所有飞禽走兽互相争鸣呼叫，这位<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>人都能听到。大梵天、光音天、遍净天直到有顶天，其中所有的天神言谈之声，这位法师在此都能听到。一切比丘、比丘尼无论是在读诵经典，还是为别人讲说，这位法师此都能听到。又有所有的菩萨不论是在读诵经典，还是为别人讲说，或者在撰写、汇集解释经义的作品，所有这此声音，位法师也都能听到。作为大圣尊的诸位如来，为了<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生，在大众中演说微妙的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，受持这部《法华经》的法师，就能完完全全地听到。总而言之，三千大千世界之内，下至无间地狱、上至有顶天，其中的所有声音，无论是发生于内，还是发生于外，这位法师都能听到，而且还不会损坏耳根。由于他的耳根特别聪利，所以，对听到的声音都能分辨明了。受持这部《法华经》的法师，虽然尚未获得天耳，但他只用父母所生的肉耳，就能获得如此巨大的耳功德。”</p><p>　　“再次，常精进菩萨，如果善男子、善女人受持此经，不论是阅读还是背诵，不论是解说还是抄写，皆能成就八百种鼻功德。凭借这种清净的鼻根，就可以嗅到三千大千世界上下内外的各种香气，如：“悦意花香、金钱花香、茉莉花香、金色花香、重生花香、赤莲花香、青莲花香、白莲花香、花树香、果树香、·檀香、沉水香、霍香、根香以及千万种合香，或者为末香，或者为丸香，或者为涂香。受持这部经典的法师，住在这里，完全能分别出这些香气。这位法师还能分别嗅到各种众生的香气，如象香、马香、牛香、羊香、男人香、女人香、童男香、童女香以及草木<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>的香气。所有的这些香，不论其远近，这位法师都能嗅到并能正确辨别，不会出错。</p><p>　　“受持这部经典的法师，虽然住在这里，也能嗅到天上各种天神境界的香气，如：圆生树香、游戏树香、小白花香、大白花香、小红花香、大红花香、·檀香、沉水香、各种末香。各种杂花香。所有这些天界之香和合在一起，所放出的香气，这位法师无不嗅知。同时，这位法师还能嗅到诸天神身上的香气，如：天帝在胜殿享受五欲之乐和嬉戏时的香气，在妙法堂上为忉利天中的所有天神说法时的香气，在各个花园内游戏时的香气，还有其它天神不管是男的，还是女的，他们身上散发的香气，这位法师也都能嗅到。另外，他还能嗅到诸天神所烧的香，以及四种圣人即声闻、辟支佛、菩萨、诸<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>上的香气。这些香气虽然在很遥远的地方，但这位法师都能嗅到，而且知道这些香气的所在地。虽然嗅到这么多的香气，但对鼻根却没有任何损坏，也不会发生任何错乱。如果想为别人分别解说，他便会清楚无误地回忆起这些香气的情形。”</p><p>　　这时，释迦牟尼佛为了重申以上义理，便又以偈颂格式说道：“受持这部《法华经》的法师鼻根清净，这个世界中的各种香气、臭气，他都能嗅到。须曼那花香、提花香、多摩罗香、·檀香、沉水香、桂木香、各种花果香，还有各种众生身上的香气，无论其是男人或女人，这位说法者即使住在很远的地方，他都能嗅到这些香气，并知道各种香气的所在。大国王、小国王及王子、群臣、宫人等，这位法师一嗅其香，便知道他们在何处。身上所戴的珍宝，地下的宝藏，国王的宝贝女儿，这位法师一嗅其香，即知道其所在之处。人们用来装饰身相的饰物以及衣服、璎珞、各种涂香，经这法师一嗅，便知其是什么。各种天神不论行走、安坐，还是游戏、神变，这位法师通过闻香，皆能知晓。各种树木、花果。以及酥油香气，受持这部《法华经》的法师住在这里也完全知道其所在。在深山险峰处，·檀树开花，若有众生来到这里，这位法师一嗅香气，便完全知晓。铁围山和大海以及地上一切的众生，经受持这部《法华经》的法师一嗅香气，便完全知道他们的所在。阿修罗的男女及其所有眷属，以争斗发怒为消遣娱乐时，这位法师一嗅香气，便能知晓他们的情形。在荒野或危险狭隘的关口，有狮子、大象、老虎、豺狼，或有野牛、水牛等。这位法师一嗅其香，便能分辨清楚。因为有嗅闻得香气的神力，所以便知道它们的所在。假设有女人怀了孕，尚未辨清所怀之胎是男是女，或者是鬼胎还是怪胎，经这法师一嗅其香，便能知道孕妇初怀胎时的情形，也知道孕妇生产时机是否成熟，从而使孕妇能够安全而快乐地生下有<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>的儿子。又因为有嗅闻香气的神力，所以便知道<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>男男女女们想的是什么，既知道谁有贪欲、愚痴、·恚等三毒之心，也知谁有一心向善、修持善行的心。大地之下埋藏的宝矿，不论是黄金白银，还是其它珍宝，就是铜器里所装的东西，这位法师一嗅其香，便能知晓。各种各样的璎珞，无人能识别其价值，这位法师一嗅其香气，便知道它的贵贱、出产地和现在的位置。</p><p>　　“天界的各种花，如小白花、小红花以及圆生树花等，这位法师一嗅其香气，便完全知道。天上的各种宫殿分上、中、下三等，都用各种珍宝的各种奇花装饰。这位法师一嗅其香气，便能完全知晓。天上花园中的胜殿、观台和妙法堂，<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>在其中娱乐。这位法师法师一嗅其香气便完全知道它们的情形。各种天神听闻佛法或享受五欲时，无论是来是去，是行是坐，是立是卧，这位法师法师一嗅其香便完全知道。天女所穿的衣服，用美丽的花和上好的香来装饰。穿着这种漂亮而芬芳的衣服，天女们周旋嬉戏，快乐无比。这位法师一嗅其香气，就完全知道她们游戏时的情形。由忉利天辗转向上，直到梵世，在这里，不论是正在<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>的天神，还是已经出了<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>的天神，这位法师一嗅他们的香气，就完全知晓他们的情形。在光音天、遍净天直至有顶天之中，无论是最初投生而来者，还是最后衰退将要转生他处者，这位法师一嗅其香气，便完全知晓。</p><p>　　“<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的比丘大众，对于佛法总是精进修行，不论他们在坐着还是走着，不论在读诵经典还是在树下专精坐禅，受持《法华经》的法师一嗅香，便完全知道他们所在之处。菩萨的志愿非常坚强，不论他们在坐禅还是在读诵经典，或者为他有说法，这位法师法师一嗅其香气，便能完全知晓。十方世界中任何一方任何世界的如来佛，是一切众生恭敬的<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，他们怜悯众生，故为众生说法施教。这位法师法师一嗅其香气，便完全知道何方何佛在演说何等佛法。众生在佛的面前听闻佛演说经典，从而皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，如法修行。这位法师一嗅香气，便能完全知晓这种情形。</p><p>　　“这位受持《法华经》的法师，虽然尚未<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>菩萨清净法下的鼻根<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>，但由于受持了这部经典，所以便率先得到了这种清净鼻相。”</p><p>　　“再次，常精进菩萨，如果善男子、善女人受持这部《法华经》，不论是阅读还是背诵，不论是解说还是抄写，那么，他就可获得一千二百种舌功德。有了这种舌功德，那么，诸味当中不论是好的还是不好的，美的还是不美的以及其它各种苦涩之物，一直到这位法师的舌根上来，就全变成上等妙味，就像天降的<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>，无不甜美清香。若以这样的舌根在大众中演说佛法，则可发出浑厚微妙的声音，这音声能深入大众的心田，使他们皆大欢喜，快乐无比。另外，各位天神的儿女、帝释天、大梵天以及诸天的天主，他们听到这种浑厚微妙的声音在层次分明、有条不紊地演讲佛法，便全都前来聆听。天龙八部神中除了这些天神外，还有诸龙神和龙女，夜叉和夜叉女、干闼婆和干闼婆女，阿修罗和阿修罗女，迦楼罗和迦楼罗女，紧那罗和紧那罗女，摩·罗伽和摩·罗伽女，这些天神为了听闻佛法，都来亲近这位受持《法华经》而获得微妙舌功德的法师，并对他表示恭敬和<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。比丘、比丘尼、男女<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>、国王、王子、群臣、眷属、小神圣国王、大神圣国王、各神圣国王的一千个儿子，里里外外的眷属等，都乘其宫殿，一同前来听法。因为这位法师是菩萨法师，善于说法，所以，<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>和居家<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>的居士以及国内的人民，都跟随侍奉法师，供养法师。另外，各位声闻、辟支佛、菩萨、如来佛等四种圣者也都喜欢见到这位法师。这位法师不论在什么地方，诸位如来佛都会向其所在的地方说法。这位法师能完全受持诸佛所说的一切教法，又能讲出深奥微妙的佛法之音。”</p><p>　　这时，释迦牟尼佛欲重宣以上义理，便又以偈颂格式复述道：“受持这部《法华经》的人舌根清净，始终不会受到恶味的侵害即使吃到了恶味之物，也会使其全都变成甘露，此人以深沉、清净、微妙的声音，在大众中说法，用各种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>、譬喻的方法，引导众生以<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。听闻其说法的人无不欣乐欢喜，为其设上各种高级的供养。诸天神、龙神、夜叉以及阿修罗等八部龙神都以恭敬之心同来听他讲经说法。这位说法的人，若想使微妙的法音遍满整个三千大千世界，那么，法音将随其意愿，到达任何一个地方。大小国王及国王的千子和眷属们，都双手合掌，以恭敬之心，常来听闻、领受佛法。诸天神、夜叉、罗刹、毗舍·等诸鬼神也产生了欢喜之心，常来供养这位法师。大梵天王和魔王，<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天和大自在天等诸天的天神常来法师所住之处。诸佛和他们的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>听到这位法师说法的声音，便时常忆念并守护这位法师，有时还现身来见这位法师。</p><p>　　“再次，常精进菩萨，如果善男子、善女人受持这部《法华经》，不论是阅读还是背诵，不论是解说还是抄写，那么，此人便可获得八百种身功德。得到清净的身体，如同明净的玻璃一样明净光亮，众生都喜欢见到他。由于此人的身体清净，所以，三千大千世界中所有众生，或者生和时候，或者死的时候，或者在天上，或者在地狱，或者相貌美丽，或者相貌丑陋，或者转生善处，或者转生恶道，所有这一切情况，都会在此人清净的身体中呈现出。还有，铁围山、大铁围山、弥楼山和大弥楼山等各种山及其中的众生，也都在此人清净的身体中呈现出来。下至无间地狱，上至有顶天，所有诸天及其中的众生，都能在此人清净的身体中呈现出来。如来声闻、辟支佛、菩萨、诸佛等四种圣者讲经说法，那么，他们的色身之相皆可在此人清净的的身体中呈现出来。</p><p>　　这时，释迦牟尼佛欲重宣此义，便又以偈颂格式说道：“受持《法华经》的人，其身极为清净，就像明净的玻璃，众生都喜欢见到。这种清净的身体又如清净的明镜，各种色像都能在上面显现出来。这位菩萨在其清净身中，看到了世间的一切，只是唯独自己明了，其它人并看不见。三千大千世界之中，所有一切众生和一切境界，即天神、人类、阿修罗、地狱、饿鬼、畜生等六类众生，他们的色身之像都可在此人的清净身体中显现出来。诸天神的宫殿直至有顶天中的宫殿，以及铁围山、弥楼山和大弥楼山还有各个大海等，都能在此人的清净身体中显现出来。诸位如来佛和声闻、辟支佛、菩萨等四种圣者，不论单独自居还是在大众中说法教化，他们都可在这位法师的清净身体中显现出来。这位受持《法华经》的法师，虽然尚未获得法性的妙身，可是却能以父母所生的清净而平常的肉身之体，映现出所有的一切。”</p><p>　　“再次，常精进菩萨，如果善男子、善女人在如来灭度之后受持这部《法华经》，不论是阅读还是背诵，不论是解说还是抄写，那么，他就可获得一千二百种意功德。有了这种清净的意根，就是只听一首偈颂、一句经文，也能通达无量无边的佛法义理。理解了这么多的佛法义理。理解了这么多的佛法义理之后，哪怕只演说一句经文、一首偈颂，也能演讲一个月、四个月甚至一年时间，所讲的佛法，都能随顺经文的义趣，与实相之理不相违背。如果讲说俗世间的经书，如治理国家的文字及钱财生计行业等，也都能随顺佛法，使之与佛法不相违背。三千大千世界之中的<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生，他们心中所想的行为，所起的动作，所生的虚妄而不严肃的言论，这位具有清净意根的法师也能完全知晓。虽然这位法师尚未获得圣洁的佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，可是他的意根已如此清净无染。这位法师所思惟、筹量、言说的一切，都是佛法，无不真实可靠。它们也是原先诸位如来佛在经中所说过的道理。”</p><p>　　这时，释迦牟尼佛欲重申此义，便又以偈颂格式说道：“此人意根清净，明澈伶俐，没有浊秽。以此微妙的意根，可知上、中、下各类佛法，就是只听闻一道偈颂，也可通达全部佛法的无量妙义。按照佛法原义，有条不紊地演说，长达一个月、四月甚至一年。这个世界内外的一切众生，如天神、龙神、人类、夜叉、鬼神等，他们都处在六道<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>之中，内心有各种各样的念头。这位法师，由于受持《法华经》得到报应，所以，一时间便完全知晓这些纷繁的念头。十方之内的无数位如来佛，有百福庄严起来的妙身相，他们为众生演说的佛法，这位法师全能听到并能信受奉行。这位法师所思惟的义理无量无边，所演说的佛法也是无量无边，而且任何时候都不会忘失，不会出错，这都是因为他受持《法华经》的缘故。这位法师完全知晓有关<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>的义理，能随着这种义理而依次认识了别，通达法相不可执着的道理，于是便知道世间的各种名称与语言吸不过是虚假的施设。根据所悟到的法相非相、体悟实相的义理，这位法师又能为众生演说这种妙法。这位法师所说的一切，都是原来诸佛所讲的教法。因为他演说这种妙法的缘故，所以在大众之中没有任何畏惧。</p><p>　　“受持《法华经》的法师，他的意根就是这么的清净。虽然他尚未获得断尽<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>的圣智，但却提前得到了这样的清净之相。这位法师受持此经，安住在难得的宝地，一切众生见了他都会生欢喜之心，从而对其爱戴和尊敬。他能以千万种巧妙的语言，分别为众生讲经说法，这都是他受持《法华经》的缘故。”</p></div>"
    },
    {
        "title": "妙法莲华经 常不轻菩萨品第二十",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　常不轻菩萨品第二十</p><p>　　这时，释迦牟尼佛告诉大势至菩萨说：“你现在应当知道，如果<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男女<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>能够<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这部《法华经》，那么，若有谁对他们恶言相加、辱駡诽谤，如前面所说，谁便会获得很大的罪报，而受持《法华经》者因此所提到的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，却如刚才所说，能获得眼、耳、鼻、舌、身、意等六根的清净。大势至，从现在向往昔过无量无边不可胜数阿僧·劫的漫长岁月，在这个极其遥远的时代里，有一位佛，名叫威音王如来，同时具备十种称号，即应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。当时所处的劫，名叫离衰；所居住的国，名叫大成。这位威音王佛，在他所处的时代中，为天神、人类和阿修罗等三善道中的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a><a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。其中为求声闻果的人说苦、集、灭、道的<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>之法，以救度他们的生、老、病、死诸苦，达到终极的<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>境界，为求辟支<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>的人讲<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>之法；为求证至高无上的佛智的菩萨们讲<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>、持戒、忍辱、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>、<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>等<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>之法，使他们最终成就佛的智慧。</p><p>　　“大势至菩萨，这位威音王佛的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长达四十万亿兆恒河的所有沙数那么多的劫数。这位佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>存在于世的劫数相当于一个阎浮提洲粉为微尘总数。这位佛的像法存在于世的劫数，相当于四大部洲粉为微尘所得的微尘总数。这位如来佛使所有的众生受到教益、得到救度之后，便进入涅槃，自我灭度。此佛的正法、像法完全消亡之后，在他的那块国土上又有一佛出世，此佛的名字也叫威音王如来，同时具备十种称号，即应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。像这样依次辗转，一共有二万亿个佛先后主持<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，他们的名号完全一样。</p><p>　　“最初的那位威音王如来灭度之后，直到他的正法也消灭无闻的像法时代中，轻狂傲慢的比丘拥有强大的势力。那时，有一位修菩萨法门的比丘，名叫常不轻。大势至菩萨，你知道他为什么叫常不轻呢？因为这位比丘对凡是他所遇到的人，不论其是比丘还是比丘尼，不论是男居士还是女居士，都要施行叩拜，称扬赞叹，并对他们说：‘我深深地敬仰你们，不敢对你们有半点轻慢，为什么呢？因为你们都<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>菩萨之道，将会成为如来佛。’而这位常不轻比丘，并不专一地读诵经典，只是遍行<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>甚至远远看见比丘、比丘尼、男居士、女居士等<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，他也要特意走上前去，对他们施行礼叩拜，称扬赞叹，并且说道：‘我不敢轻慢你们，你们皆当作佛。’四众弟子中有的人心地不净，产生·怒，恶言恶语地骂道：‘这个没有智慧的比丘，从什么地方跑到这里，自言自语什么我不轻慢你们，甚至为我们授记作佛。我们不需要这种虚妄的授记。’这样，经历了好多年，常不轻经常被骂，但他从不<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>发怒，始终这么说：‘你将<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。’说这种话时，众人有时用手杖、木条、瓦块、石头等打他。他只好躲避，跑到很远的地方，但嘴里依然高声大呼：‘我不敢轻慢你们，你们皆当作佛！’因为这位比丘经常说这样的说，所以，轻狂傲慢的比丘、比丘尼、男居士、女居士便给他取了一个名号叫常不轻。</p><p>　　“这位比丘年老<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>之时，从<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中完全听到威音王佛先所说的《法华经》二千万亿句，并对此完全能够受持，于是他便获得了如上所述的眼根清净以及耳根、鼻根、舌根、身根、意根等六根清净。获得了广泛为众人演说这部《法华经》。</p><p>　　“这个时候，那些轻狂傲慢的比丘、比丘尼、男居士、女居士，特别是轻贱此人并为他起名常不轻的人，见他获得了巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力以及乐说雄辨的演讲能力和身心善良的忍辱能力，于是，他们听了这位比丘的说法，便全部信受拜伏，随从他一起<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。这位常不轻菩萨又教化了千万亿个众生，使他们都获得了至高无上的圣智。命终之后，他又多次<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>，遇到了二千亿个佛，这些佛的名号都叫日月灯明。他在这些佛的法化事业中，继续演说这部《法华经》，由于这个缘故，他又遇到了二千亿个佛，这些佛的名号都叫作<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>灯王佛。在这些佛的法化事业中，他依然受持、读诵并为四众弟子演说这部经典。由于这个缘故，他又获得了眼根清净、耳根、鼻根、舌根、身根、意根等六根清净，所以，他在四众弟子中说法，心中没有任何怖畏。大势至菩萨，这位常不轻大菩萨<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>了这么多的如来佛都非常恭敬，非常尊重，并进行了称颂赞叹，从而种下了很多善根。此后，这位常不轻菩萨又遇到了千万亿个佛，在这些佛的法化事业中，他还是演说这部经典，终于成就了所有的功德，应当就要作佛了。</p><p>　　“大势至菩萨，在你看来，那时的常不轻菩萨是旁人吗？其实，那时的常不轻菩萨就是我释迦牟尼佛的前身。如果我在前世不受持、读诵这部经典，不为他人演说，那么，我就不会这么快地得到至高无上的圣智。因我在原先的如来佛那里，受持、读诵这部经典，并为他人演说，所以，我才很快地得到了至高无上的圣智。大势至菩萨，那时的四众弟子，即比丘、比丘尼、男居士、女居士，以·怒的心态轻视我、卑贱我，因此，他们在二百亿劫的岁月中，一直遇不到佛，听不到法，看不到僧。他们<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>遇到佛、法、僧<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>，所以在长达一千劫的时间里，他们转生于无间<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中遭受巨大的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。等受完了这些罪报之后，他们又转生人世，再次遇到常不轻菩萨，受其教化，走上了求证至高无上的圣智的道路。</p><p>　　“大势至菩萨，在你看来，那时四众弟子中经常轻视这位菩萨的人难道是旁人吗？其实，他们就是今天法华会上的跋陀婆罗等五百位菩萨、师子月等五百位比丘、尼思佛等五百位男居士。他们如今已在求证至高无上的圣智的道路上，全部达到了不退转的阶位。</p><p>　　“大势至菩萨，你应当知道，这部《法华经》对所有的菩萨、大菩萨都是有巨大的益处，能使他们成就至高无上的圣智。所以，一切的菩萨、大菩萨在如来灭度之后都应该时常受持、读诵、解说、书写这部经典。”</p><p>　　这时，释迦牟尼佛欲重宣此义，便又以偈颂格式复述道：“过去有位佛，名叫威音王，此佛的神通无量、智慧无量。他接引并指导一切众生，受到天神、人类和各种龙神的共同供养。此佛灭度后，<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>将灭时，有一位菩萨，名叫常不轻。那时，四众弟子执着于<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>，故而滋生了轻狂傲慢的心理。常不轻菩萨来到他们所在的地方，对他们说：‘我不轻视你们，你们都在修道，都会成佛。’这些人听了之后，对他轻视、诽谤、辱駡，常不轻菩萨皆能忍受。这位菩萨之所以受到如此轻视与毁骂，都是前世所造罪业的缘故。当这种罪业宠毕之后，常不轻菩萨得以听到这部《法华经》，获得六根清净的神通之力，从而延长了寿命，又为其它人广泛讲说此经。原来执着于法相的那些四众弟子都蒙这位菩萨教化，有所成就，从而进住于无上的佛道。常不轻菩萨此<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>终之后，又多次转生，生生世世之中遇到无数个佛。由于他继续演说此经，所以获得了无量的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>，逐渐具足了功德，从而迅速成就了佛道。</p><p>　　“那时的常不轻菩萨，就是我的前身。那时执着于法相的四众弟子，因为听到常不轻菩萨说：‘你当作佛”，所以他们后来曾遇到无数字佛。现在<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中的五百位菩萨及比丘、比丘尼、男居士、女居士等四众弟子，如今正在我的面前听闻佛法，他们就是当时执着于法相的那些四众弟子。我在前世曾劝这些人听受此经的第一妙法，不断地开示教化他们，使他们能够进住于涅槃<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的境界，并生生世世受持这部经典。</p><p>　　“经过亿亿万劫甚至不可思议长的劫数，才能够听到这部《法华经》。经过亿亿万劫甚至不可思议长的劫数，诸佛才讲这部《法华经》。所以，修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>在佛灭度之后，若能听到这部经典，就不要产生疑惑，应当一心一意地广泛演说此经。果能如此，那么，他们生生世世都会遇到如来佛，从而能够很快地成就佛道。”</p></div>"
    },
    {
        "title": "妙法莲华经 如来神力品第二十一",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　如来神力品第二十一</p><p>　　这时，一千世界微尘数那么多的菩萨、大菩萨，即从地下涌出的那些菩萨大众，都在释迦牟尼佛面前专心一意地合起双掌，瞻仰佛的尊颜，对佛说道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，我们在佛灭度之后，将在世尊分身所在国土的灭度之处，广泛演说这部经典。为什么呢？因为我们也想得到这种既真实又清净的大法，并<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、读诵、解说、书写、<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>这部经典。”</p><p>　　这时，释迦牟尼佛在文殊师利等无量百千万亿过去曾住在这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>的菩萨、大菩萨面前，在各位<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>、女居士等<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>面前，在天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽等八部众面前，在一切人和非人面前，显示出巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力。他伸出既广又长的舌头，向上直达<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>大梵天。<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>上所有的毛孔，都发放出无量无数、色彩斑斓的光芒。照遍了十方世界的各个角落。坐在各种宝树狮子座上的各位分身佛也是如此，伸出既广又长的舌头，放出无量无的光芒。释迦牟尼佛。及坐在宝树下的各位分身佛显现神通之力的时间，延续了整整一百个千年之后，才收摄了这种广长舌相。他们同时发出轻咳声和弹指声，这两种声音响彻十方一切佛国世界，大地也随之发生了六种类型的震动。置身于法华会中的所有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>如天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽以及人和各种非人的恶鬼、冥众等，凭借佛的神力，都看见了这个娑婆世界无量无边百千万亿棵宝树下狮子座上坐着的各位如来佛，也看见了释迦牟尼佛和多宝如来在宝塔之中坐在狮子座上，还看见了无量无边百千万亿个菩萨、大菩萨以及四众弟子正恭恭敬敬地围绕着释迦牟尼佛。看见了这种景象之后，大家无不欣乐<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，赞叹这是从未有过的妙事。</p><p>　　紧接着，诸位天神在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中高声说道：“由此再过无量无边百千万亿阿僧·个世界，那里有一处国土，名叫娑婆。在此国土之中，有一位如来佛，名叫释迦牟尼，现在正为诸菩萨、大菩萨讲说一部名叫《妙法莲华经》的大乘经典。此经是<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>菩萨的妙法，是佛对众生护持与忆念。你们应当衷心随顺其义，欢喜信受，也应当<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>、供养释迦牟尼佛。”所有众生听到虚空中的这种声音之后，都合掌面向娑婆世界，并口中说道：“南无释迦牟尼佛！南无释迦牟尼佛！”众生们以各种鲜花、妙香、璎珞、宝幡、宝盖及各种装饰身体的用品和其它各类珍宝、妙物，一起向遥远的娑婆世界散去。所散之物从十方世界汇集而来，犹如云团相聚、变成了宝帐，周遍地覆盖在此间的各伴如来佛的上空。这时，十方世界，通达无碍，犹如一块完整的佛土。</p><p>　　这时，释迦牟尼佛告诉上行等菩萨大众说：“诸佛神力如此无量无边，不可思议。假如我以这种神力在长达无量无边百千万亿阿僧·劫的时间里，因为再三嘱托众生信受的缘故，不断讲述此经的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，但依然是说不尽道不完的。总而言之，如来所拥有的一切教法，如来所具备的一切<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>神力，如来所宣示的一切要法藏，如来所作的一切深妙<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>，所有这一切都在此经中作了宣讲、指示的明明白白的敍说。所以，你们在如来佛灭度之后，应一心一意地受持、读诵、解说、书写《法华经》，并按照经中所说的道理去<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，或者只要是这部经典所在的地方，如：花园、<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>、树下、僧院、民宅、殿堂、山谷、旷野，等等，所有这些地方都应该建起宝塔来供养。为什么呢？应该知道，这些地方就是道场，诸位如来佛就是在这里得了至高无上的圣智，诸位如来佛就是在这里转动*轮，教化众生，诸位如来佛就是在这里进入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。”</p><p>　　这时，释迦牟尼佛欲重宣此义，便又以偈颂格式重述道：“诸佛是世界一切众生的救度者，为了使众生获得究竟的快乐，所以他们进住于神通之地，并显现其所拥有的神通之力。诸佛首先现出神妙的舌相，舌头变得又广大长，直达梵天之境，诸佛之身也发放无量光芒，五彩缤纷。佛是为求佛道的众生，才现出这种稀有的现象。诸佛轻咳之声和弹指之声，遍闻十笔国土，所到之处，大地都出现了六种震动。因为闭佛灭度之后有人能受持此经，所以，诸佛均十分欢喜，故而现此神力。佛为了表示再三叮咛，故而赞美受持《法华经》的人，在长达<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>漫漫岁月中，这种赞叹依然不能穷尽。所以，受持《法华经》的人，其所获得的功德，是无边无际，永无穷尽的，就像十方虚空一样，不可找到它的边际。能够受持这部经典的人，就等于见到了我的身相，也见到了多宝如来和我所有分身诸佛，也就等于见到了我今日在此教化所有菩萨的情景。能受持这部经典的人，即可令我和我的所有分身佛以及业已灭度的多宝佛，都感到十分欢喜。也能见到，也能供养十方世界内的现在诸佛和过去诸佛、未来诸佛也能使他们得到欢喜。所有这一切如来佛，他们坐在道场中所悟得的秘要之法，对于受持《法华经》的人来说，他们不久也将得到。能受持这部经典的人，对于诸佛所说各种法义，如经中的名相、经中的言辞，能得到乐说无碍的辨才境界，好像风在空中一样，没有任何的限制与阻碍。在佛灭度之后，要是知道佛所说的经典，佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>与次序，并随顺经中的义理，如实的解说，那么，就好比日月之光明，能消除一切黑暗之处。这些人在<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>行道，能消灭众生心中的暗昧，规律教化无量菩萨，使他们最终进入佛乘，证成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。所以，凡是有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的人，听到受持这部经典能有这样的功德利益，他们在我灭度之后，就应当受持这部经典。那么，他们在<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>这个问题上，是绝对没有任何疑问的。</p></div>"
    },
    {
        "title": "妙法莲华经 嘱累品第二十二",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　嘱累品第二十二</p><p>　　这时，释迦牟尼佛从法座上站走来，显现了巨大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力。他伸出右手，抚摩无量无数个菩萨、大菩萨的头顶，对他们这样说道：“我在无量百千万亿阿僧·劫那么长的漫漫岁月中，修习这种难得的无上圣智之法，今天，我把这种妙法嘱托于你们，你们应当专一其心地流布此法，以更广泛地增加受益的范围。”像这样，先后三次抚摩诸位菩萨、大菩萨的头顶之后，释迦牟尼佛又说：“我在无量百千万亿阿僧·劫那么长的漫漫岁月中，修习这种难得的无上圣智之法，今天，我把这种妙法嘱托于你们，你们应当<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、读诵、广泛宣传这种妙法，使一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>都能听闻得知。为什么呢？因为，如来有大慈大悲之心，没有一丝一毫的悭吝，没有一丝一毫和畏惧，能够给予众生佛的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>、如来的智慧和<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>本有的智慧。所以，如来是一切众生的大施主，你闪也应当跟随如来学习<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，不要产生悭吝之心。在未来的时候，如果善男子、善女子相信如来的智慧，那么，就应当为他们演说这部《法华经》。使其闻知此经，就是为了使其获得佛的智慧。如果有的众生不信受这部《法华经》，则应当在佛的其它深奥之法中，开示他，令他得到利益，从而主生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>之心。你们若能如此去作，那就等于报答了诸位如来佛的恩情。”</p><p>　　这时，诸位菩萨、大菩萨听佛说了这样的话之后，皆大欢喜。他们全身充满欣喜，对佛更加恭敬，于是个个弯腰低头，合掌向佛致礼，同声说道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>的敕令，我们自当完全奉行，所以，还请世尊不要有什么顾虑。”诸位菩萨、大菩萨这样反复了三遍之后，又同声说道：“世尊的敕令，我们自当完全奉行，所以，还请世尊不要有什么顾虑。”</p><p>　　这时，释迦牟尼佛命令从十方来的所有分身佛各还本土，他这样说道：“诸位分身佛现在可以各随所安，回到各自安住的国土。多宝佛塔也可返回原来的地方。”释迦牟尼佛说话时，坐在宝树下狮子座上那些从十方来的无数个分身佛和多宝佛以及上行等无数个菩萨，还有<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗等声闻乘的<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>与所有<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的天神、人类、阿修罗等众生，听了佛的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，个个心中充满了欢喜。</p></div>"
    },
    {
        "title": "妙法莲华经 药王菩萨本事品第二十三",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　药王菩萨本事品第二十三</p><p>　　这时，宿王华菩萨对释迦牟尼佛说：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，药王菩萨是何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>来到这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>游历的？世尊，这位药王菩萨修习过若干百千万亿兆种难以<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的苦行，好啊！世尊，愿您为我们稍作解说。”<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上的各位天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽等天龙八部和人与非人的鬼神等，另外还有其它国土来的诸位菩萨以及此方的声闻<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>等，听了宿王华菩萨向佛请问后，都十分<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。</p><p>　　这时，释迦牟尼佛告诉宿王华菩萨说：“从现在向过去追溯无量条恒河的所有沙数那么多的劫数，那时，有一位佛名叫日月净明德如来，同时具足十种称号，即：应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、世尊。这位<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>边有八十亿个大菩萨，有七十二条恒河沙数那么多的大声闻弟子。佛的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>达四万二千劫，菩萨和寿命也是这么长。这个佛国中没有女人，没有<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生等三种恶道，也没有各种灾难和<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。大地平坦得犹如手掌一般，全都是琉璃铺成。大地上，宝树成行，一派<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。宝树上，宝帐覆盖，宝华披挂，宝幡下垂。宝瓶与香炉，遍布全国各地。七宝作成高台，每有一树即有一台，宝树与宝台相距一箭之地。这些宝树下都坐有菩萨和声闻弟子。所有的宝台上，各有百亿天神演奏天乐，表演伎艺，歌颂<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，作为<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。</p><p>　　“那时，日月净明德佛为一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>都喜欢见到的菩萨以及其它各位菩萨、各位声闻乘弟子演说《法华经》。这位名叫一切众生喜见的菩萨喜欢修习苦行，他在日月净明德佛的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>中，<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>修行，一心追求<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。经过整整一万二千年之后，终于获得了变现一切色身的<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>神力。获得了这种禅定神力后，一切众生喜见菩萨心中十分欢喜，于是他这样说道：‘我之所以能获得变现一切色身的禅定之力，都是因为得闻《法华经》的力量所致，所以，我应当供养日月净明德佛和《法华经》。’于是，他立即进入这种禅定状态，升于<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中，像下雨一样将小曼陀花、大曼陀花和坚硬的黑色·檀香末细末散落下来，一时间，整个天空犹如密云相聚，缤纷而下。同时，还像下雨一样洒下北海南岸产的·檀之香，这种香的六铢重理，其价值相当于一个娑婆世界。如今，一切众生喜见菩萨把它拿来供养日月净明德佛。</p><p>　　“作完了这些供养之后，一切众生喜见菩萨从禅定中起来，心中暗自想道：‘我虽然以神力供养了佛，不如以身躯来供养佛。’于是，他立即饮服各种妙香，如·檀香、熏陆香、兜楼婆香、毕力迦香、沉水香、胶香。他又饮下了··等鲜花制成的香油。如此经过一千二百年，他又用香油涂抹身体，然后，在日月净明德佛前，用天上的宝衣将自己的身躯缠绕起来，再灌下各种香油。这时，一切众生喜见菩萨以其<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>愿力，自焚其身。火光照遍了八十亿恒沙数那么多的世界。这些世界之中的每一位佛都异中同声地赞叹道：‘好啊！好啊！善男子，这才是真正的精进修行，这才是真正法供养如来。以华、香、璎珞以及各种<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>、末香、涂香以及天缯、幡盖和北海此岸的·檀香等种种东西供养，比不上这种以身体而进行的供养，即使以国城、以妻子进行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，也比不上这种以身躯而进行的布施。善男子，你这各焚身供佛的布施叫作第一布施，这是所有布施中最尊贵、最上第的布施，因为，这实际上是在以法来供养所有的如来佛。’说完这些话后，诸位如来佛便各种黯然不语。一千二百年后，一切众生喜见菩萨的身躯才全部焚烧而尽。</p><p>　　“一切众生喜见菩萨作完这种法供养之后，<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>便完结了。由此他又<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>到日月净明德佛的佛国中，在一个名叫净德的王室之家双膝<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>，忽然间便化成一个童子，并对其托生的父亲以偈语格式说道：‘大王现在应当知道，我当年游历到你这里时，获得了变现一切色身的禅定神力。我勤加修行这种法门，勇猛精进不息，后来，便舍去了所有爱惜的身躯，把它供养给了世尊，以求得至高无上的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。’</p><p>　　“说完这些偈语之后，又对其父亲说：‘日月净明德佛今天依然还在这个世界中。我原先供养了这位如来佛后，获得了通晓一切众生语言的陀罗尼法门，接着又从此佛处听到这部《法华经》中的八百千万亿兆甄伽罗、频婆罗、阿·婆等为数巨大的经偈词句。大王，我今应当再回去供养这位日月净明德佛。’说完之后，一切众生喜见菩萨托生的童子便坐到七宝台上，自行上升到空中，高达七棵多罗树。来到佛的住地后，他走下宝台，在佛面前<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜，双手合十，以偈颂格式赞叹佛说：‘佛的容颜极为奇妙，佛的光明遍照十方。我前生时曾供养于您，今天，我再来亲自觐见于您。”</p><p>　　“一切众生喜见菩萨说完这首偈之后，又对日月净明德佛这样说：‘世尊啊世尊，您依然在这世上！’这时，日月净明德佛告诉一切众生喜见菩萨说：‘善男子，我<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>的时候到了，灭尽的时期来临了。你现在可以安置床座，我于今天夜里，将要进入涅槃。’ 日月净明德佛又敕令一切众生喜见菩萨说：‘善男子，我把<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>嘱托给你和各位菩萨、各位大弟子。除了这无上圣智之法外，我把三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>的七种珍宝、各世界中的所有宝树、宝台以及专门从事供给与奉持的各位天神也都交付于你。我灭度之后，所得的全部<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>也交付嘱托于你，你应当把它们分散各地，广设供养，建起数千座宝塔。’如此一一嘱托完毕之后，日月净明德佛才进入了涅槃。</p><p>　　“一切众生喜见菩萨见佛去世灭度，悲感交集，懊恼不已。出于对佛的恋慕，他便用北海此岸的名贵·檀木作为薪柴，先对佛的身躯作了供养，然后佛点火烧之。火灭之后，他又收取佛的舍利，建起了八万四千座佛<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>，每座塔都有三个世界那么高，塔刹非常庄严，上面垂挂着各种宝幡、宝盖，还悬挂着各种宝玲。这时，一切众生喜见菩萨又暗自想道：‘我虽然作了这些供养，可对佛的心愿并未满足，我现在应当再供养佛的舍利。’于是，他就对各位菩萨大弟子及天神、龙神、夜叉等所有大众说：‘你们应当一心念，我现在要供养日月净明德佛的舍利了。’说完这话之后，一切众生喜见菩萨就在八万四千座舍利塔前，将自己那以百福严饰的胳臂燃烧起来，足足烧了七万二千岁，以此作为对<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>的供养 ，也使无数追求声闻果位的弟子和其它无量无数的人都发下了求证至高无上圣智的心愿，使他们都能进住于变现一切色身的禅定神通之中。</p><p>　　“这时，诸位菩萨以及天神、人类、阿修罗等，看见一切众生喜见菩萨没有了胳臂，所以都非常忧愁<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，悲伤哀怜，他们说：‘这位一切众生喜见菩萨是<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>我们的师父，他如今燃臂供佛，致使身体残缺。’这时，一切众生喜见菩萨在大众中立下誓言说：‘我虽舍去了两臂，却必将得到佛的金色之身。若此话真实不虚，就让我两臂恢复原状吧！’发了这个誓愿之后，一切众生喜见菩萨的双臂果真自然复原如初。这都是这位菩萨的福德与智慧非常淳厚所致。当此之时，三千大千世界发生了六种震动，天空之中下雨般降下了各种宝花，所有的人和天神都经历了一次前所未有的盛事。”</p><p>　　释迦牟尼佛对宿王华菩萨说：“在你看来，一切众生喜见菩萨难道是旁人吗？他其实就是现在的药王菩萨。他这样舍身布施，已有无量百千万亿兆的次数了。宿王华，如果哪位发愿欲得无上圣智的人能燃手指或脚中的一指，以供养佛塔，那么，他的布施便胜过以国城、妻子及三千大千世界的国土、山林、河池与各种珍宝所进行的供养。如果又有人把七种珍宝布满整个三千大千世界，拿来代养于佛以及菩萨、辟支佛、阿罗汉，那么此人所获得的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，不如<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这部《法华经》甚至只受持其中的一首四句诗颂所获得的功德。受持《法华经》的功德是最多的。</p><p>　　“宿王华，譬如所有川流江河等诸水之中，海为第一，这部《法华经》也是如此，在诸位如来佛所说的各种佛经中，《法华经》最为深奥，最为博大。又譬如，在土山、黑山、小铁围山、大铁围山以及十宝山等众山之中，须弥山为第一，这部《法华经》也是如此，在所有的佛经中地位最高。又譬如，在群星之中，月亮为第一，这部《法华经》也是如此，在千万亿经法之中，此经的光辉最为明亮，又譬如太阳，它能照破一切黑暗，这部经典也是这样，它能照破一切不善的黑暗。又譬如在各种国王之中，持轮圣王为第一，此经也是如此，它在诸经中最为尊贵。又譬如天帝是三十三天中所有天神的大王，此经也是如此，它是所有佛经中的王。又譬如大梵天王，他是一切众生的父亲，此经也是如此，它是一切圣贤和<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>小乘有学果和无学果的圣者以及发愿修<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>的菩萨们的父亲。又譬如在一切凡夫面前，须陀洹、斯陀含、阿那含、阿罗汉、辟支佛位处第一，此经也是如此，在所有如来佛所说或菩萨、声闻所说的各种经法之中，此经位处第一。受持这部经典的人也是这样，他在一切众生之中位处第一。在所有的声闻、辟支佛面前，菩萨位处第一，此经也是如此，在一切经法之中，此经位处第一。再如来佛为一切佛法中的法王，此经也是如此，是一切经典之王。</p><p>　　“宿王华，这部经典能充当一切众生的救度者，它能使一切众生离开各种苦恼，能为一切众生带来巨大的利益，使所有众生<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>自己的心愿。譬如清凉和水池能满足一切干渴困乏的人，又如寒者得火，裸者得衣，如商人得到顾主，游子得到母亲，又如渡河得船，病中得医，如黑暗时见到光明，贫困时得到宝贝，如人民遇到英明的国王，商贾得到海中的珠宝，如火炬驱除一切黑暗，这部《法华经》也是这样，它能使众生远离一切痛苦、一切疾病，能够自己抄写或让他人抄写，那么，他所得的功德，即使以佛的智慧来筹算其多少，也难以穷其边际。如果抄写了这部经卷之后，还能用鲜花、香料、璎珞、烧香、末香、涂香、宝幡、宝盖、衣服、各种灯明如酥油灯、香油灯、各种混合香油灯、金色花油灯、悦意花油灯、重生花油灯、夏生花油灯、、杂色花油灯等各种各样供具来供养经卷，那么，由此所得的功德，也是不可计量的。</p><p>　　“宿王华菩萨，如果有人听到了《法华经》中的这篇《药王菩萨本事品》，那么，此人由此也可获得无边的功德。如果哪位女人听到了这篇《药王菩萨本事品》后，能够信受、持行，那么，她此生的女身完结之后，来世转生将不再是女人。在佛灭度之后五个五百岁的最后一个五百岁中，若有女人听到这部经典，并按经中所说去修行，那么，她在此生命终之后，即可<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>西方<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>阿弥陀佛和围绕在阿弥陀佛身边的大菩萨众生的住处，从莲花中化生，在宝座上安坐，不再为贪欲所恼乱，也不再为·怒、愚痴所恼乱，也为再为傲慢和嫉妒等尘垢所恼乱，获得了菩萨的神通，证到了安住于不生不灭的真如实相理体的智慧。获得了这种智慧之后，他的眼根变得清净无染，从而看到了七百万二千亿兆恒河所有沙数那么多的如来佛。此时，这些如来佛各自从遥远的地方称赞道：‘善哉！善哉！善男子，你能在释迦牟尼的法佛中，受持、读诵、思惟这部《法华经》，为他人演说，所以，你所获得的福德是无量无边的。大火不能烧毁，洪水不能漂没，你的功德，就是千佛共说也不能穷尽。你现已能破除各种魔贼，尽享清净之乐；毁坏<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之军，不受<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>之苦。其它各种怨敌，也都能摧灭。善男子，成百上千的佛以神通之力共同守护着你。在所有世间的一切天神与人类之中，没有谁能像你一样。除过如来佛之外，在一切摆脱世间轮回的圣者之中，声闻、辟支佛甚至菩萨，在智慧与禅定方面，都不能与你相比。’</p><p>　　“宿王华，这位闻经修行、往生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>的菩萨，他的确能获得这样的功德，成就这样的智慧之力。若有人听到这篇《药王菩萨本事品》后，能够随顺经义，生欢喜之心，赞其美好，那么，此人在现世中，口里经常可以呼出青莲花那么样的香味，身上各毛孔中也能时常放出牛头·檀的香气。他所获得的功德，和上面所说的功德完全一样。所以，宿王华，我要将这篇《药王菩萨本事品》嘱托于你，你应在我灭度之后的最后一个五百年中，在这个人类居住的阎浮提洲广泛宣讲此品经文，不要让它中断消失，以免恶魔、魔民、某些天神、龙神、夜叉以及恶鬼等有可趁之机。宿王华，你应当以神通之力守护此经，为什么呢？因为，此经是这个阎浮提洲所有人治病的良药。如果有人病了，听到这部经典，疾病即可祛除，甚至不会衰老，不会死亡。宿王华，你如果看见有人受持这部经典，就应当以青莲花供养他，同时盛满末香，散布在他的身上。散毕之后，这样想：‘此人不久必将取草为座，坐在<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>道场之中，破除各路魔军。他必将吹响大法螺，击响大法鼓，把一切众生从生、老、病、死的<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>之中度脱出来。’所以，凡是要求证佛道的人，如果看到有人受持这部经典，就应当对其生起恭敬之心。”</p><p>　　释迦牟尼佛讲说《药王菩萨本事品》时，有八万四千菩萨获得了通晓一切众生语言的陀罗尼法门。多宝如来在宝塔中称赞宿王华菩萨说：“善哉！善哉！宿王华，你成就了不可思议的功德，因此你能向释迦牟尼佛询问这样的事缘，使无量无边众生都由此获得了利益。”</p></div>"
    },
    {
        "title": "妙法莲华经 妙音菩萨品第二十四",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　妙音菩萨品第二十四</p><p>　　这时，释迦牟尼佛从三十二种大人相中的肉髻相中放出光明，又从两眉之间放出白毫相光，这两种<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>照遍东方一百八十万亿兆恒河所有沙数那么多的佛国世界。越过这些数目的世界，有一个佛，名叫净华宿王智如来，此佛同时具足十号，即：应供、正遍知、明行足、善逝、<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解、无上士、调御丈夫、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛、<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。净华宿王智如来为恭敬围绕在他身边的无量大无边的菩萨大众讲经<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。释迦牟尼佛的白毫相光照遍了其国。</p><p>　　那时，这个一切净光<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛国中有一个菩萨名叫妙音。此菩萨在很外很久之前，就已种下了许多善根，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>、亲近过无量百千万亿的佛，所以成就了甚深的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，获得了各种<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>即妙定的境界，如：妙幢相三昧、法华三昧、净德三昧、宿王戏三昧、<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>三昧、智印三昧、解一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>语言三昧、集一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>三昧、清净三昧、<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>游戏三昧、慧炬三昧、庄严王三昧、净光明三昧、净藏三昧、不共三昧、日旋三昧，等等，共获得了百千万亿恒河沙数那么多的三昧。释迦牟尼佛的光明照耀在妙音菩萨身上，妙音菩萨便对净华宿王智佛说：“世尊，我应当前往<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a><a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>、亲近、供养释迦牟尼佛，并拜见文殊师利菩萨、药王菩萨、勇施菩萨、宿王华菩萨、上行意菩萨、庄严王菩萨、药上菩萨。”</p><p>　　这时，净华宿王智佛告诉妙音菩萨说：“你不要轻视那个国土，不要产生下劣的想法。善男子，那个娑婆世界高低不平，充满了各种土山、石山和污秽、恶浊。那里的<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，身材矮小，诸菩萨大众的身材也很小，而你的身高四万二千由旬，我的身高六百八十万由旬。你的身相最为端正，具备了百千万种福相，又能放出清净而殊妙的光明，所以，你到娑婆世界，切莫轻慢那里的一切，譬如不要对那里的佛、菩萨和国土产生下劣的想法。”</p><p>　　妙音菩萨对净华宿王智佛说：“世尊，我现在到娑婆世界去，都是凭佛的力量，佛的神通游戏，佛的功德智慧来庄严自己。”于是，妙音菩萨仍然坐在座上，既不站起，也不摇动，而是进入<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>状态，并以这种<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>来到娑婆世界的耆阇崛山，在离释迦牟尼<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>座不远的地方，化出八万四千朵众宝而成的莲花，这种莲花以阎浮檀金为茎，以白银为叶，以金刚为花须，用甄叔迦宝石作为花台。</p><p>　　这时，文殊师利法王子见到这些殊胜的莲花，便对释迦牟尼佛说：“世尊，是什么<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而现出这样的祥瑞景象呢？那成千上万朵莲花，个个以阎浮檀金为茎，以白银为叶，以金刚为花须，用赤红的甄叔迦宝石作为花台。”</p><p>　　释迦牟尼佛告诉文殊师利菩萨说：“这是妙音大菩萨想与围绕在他身边的八万四千菩萨，从净华宿王智佛的东方净光庄严佛国，来到这个到娑婆世界，前来供养我，亲近人，礼拜我，也是为了供养并聆听《法华经》。</p><p>　　文殊师利菩萨对佛说：“世尊，这位菩萨种下了何种善根？修下了何种功德？怎么会有这么大的神通之力呢？他修得的是什么样的禅定呢？愿你为我们讲说这种妙定的名称，我们也想勤奋修习这种妙定。因为，<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>这种妙定，才能看见这位菩萨身相大小，才能看见他的行、住之威议。等那位菩萨来到后，愿世尊以神通力使我们能够看见。”</p><p>　　这时，释迦牟尼佛告诉文殊师利菩萨说：“这位久已灭度的多宝如来将为你们现出妙音菩萨的景象。”这时，多宝佛告诉妙音菩萨说：“善男子，请你来吧，文殊师利法王子想见到你的身相。”</p><p>　　当此之时，妙音菩萨在他所处的佛国中隐没了。他率领八万四千菩萨一起出发，直奔娑婆世界而来，途中所经过的每一个佛国，大地均发出了六种震动，天空下雨般散下七宝莲花，成百上千种天乐，不用鼓动，自然响彻云霄。这位妙音菩萨的双目就像宽大的莲花叶，目光犹如百千万个月亮交相辉映。其面貌炎端正更胜过这种情景。他的身体是真金的颜色。无量的功德使其无处不美丽，无处不庄严，所以，他的威德如火般炽盛，他的身光，灿烂明亮，照耀一切，他的外相，无不具足，无不庄严，就像金刚力士那样健壮而潇洒。妙音菩萨坐在七宝莲花台上，上升到<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之中，离地面有七棵多罗树那么高，在那些菩萨大众的恭敬围绕下，来到了这个到娑婆世界的耆阇崛山。</p><p>　　来到耆阇崛山之后，妙音菩萨从七宝台上下来，手持价值连城的百千种璎珞，来到释迦牟尼佛面前，<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜，奉上璎珞，对佛说：“世尊，净华宿王智佛向您问好，您没有病痛，没有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>吧？您日常起居轻松顺利吧？您行、住、坐、卧安稳快乐吧？众生容易救度吧？众生不会有太多的贪欲、·怒、愚痴、嫉妒、悭慢吧？没有不孝敬父母、不恭敬<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>的众生吧？没有充满邪见和不善之心、不能收摄喜、怒、爱、恶、欲等五种情感的众生吧？世尊，众生能降伏一切魔怨吧？久已灭度的多宝如来在七宝塔中也来听您说法吧？净华宿王智佛还让我向多宝如来问好，他近来身心安稳、无忧无恼吧，还能忍耐久住吧？世尊，我现在就想见到多宝如来的身相，惟愿世尊指示以便让我见到这位如来佛。”这时，释迦牟尼佛对多宝佛说：“这位妙音菩萨想与你相见。”</p><p>　　这时，多宝佛告诉妙音菩萨说：“善哉！善哉！你为了供养释迦牟尼佛和聆听《法华经》并拜见文殊师利等菩萨，而来到这个到娑婆世界。”</p><p>　　这时，<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中有一位名叫华德的菩萨对佛说：“世尊，这位妙音菩萨，他在往昔因地时种下何种善根？修下了何各功德？怎么会有这样的神力呢？”</p><p>　　释迦牟尼佛告诉华德的菩萨说：“很早以前，有一位佛，名叫云雷音王佛，他有如来、应供、正遍知等称号。当时的国名叫现一切世间，所处的劫，名叫喜见。妙音菩萨在一万二千年当中，以十万种伎乐供养云雷音王佛，并为佛奉献了八万四千个七宝制成的宝钵，由于这个原因和<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，他现在才生在净华宿王智佛国，并具备了这样的神力。华德菩萨，在你看来，那时在云雷音王佛面前，以伎乐进行供养并奉上宝钵的妙音菩萨难道是另一个人吗？他就是现在的这位妙音大菩萨。华德，这位妙音菩萨已曾供养、亲近过无数位如来佛，很久很久以来，就种下了善根，另外，他所遇到的佛，有恒河沙那么多的成百上千直至万亿兆。</p><p>　　“华德，你只看见妙音菩萨的身躯在此，其实，这位菩萨能现各种身相，到处为各类众生演说这部《法华经》。他或者现梵王身，或者现天帝身，或者现<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天身，或者现大自在天身，或者现天大将军身，或者现四大天王中的·沙门天王身，或者现持轮宝的神圣国王身，或者现各种小王身，或者现长者身，或者现宰官身，或者现<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>身，或者现<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>身、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>身、男<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>身、女居士身，或者现长者妇身、居士妇人身，或者现官吏妇人身，或者现婆罗门妇人身，或者现童男、童女身，或者现天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽等天龙八部以及人与非人等的身相。通过示现这些不同的身相而为不同的众生讲说这部《法华经》。在<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼，畜生之中以及各种困难的场合，他都能前去救济，甚至变成女身，深入国王的后宫之中，为宫女们讲说这部经典。华德，这位妙音菩萨是能救护娑婆世界所有众生的菩萨。这位妙音菩萨如此显现各种各样的变<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>相，在这个娑婆世界，为所有众生讲说《法华经》，可是，他的神通力、他的显化力以及他的智慧，却毫无损减。</p><p>　　“这位菩萨用他的种种智慧光明来照耀我们这个娑婆世界，使一切众生各自得到应该知道的佛法。不但在娑婆世界如此，就是在十方恒沙数那么多的世界中，妙音菩萨也是这样来救度众生。如果有应该以声闻身形获得救度的众生，妙音菩萨就示现声闻形身而为其说法；如果有应该以辟支<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>形获得救度的众生，妙音菩萨就现示辟支佛身形而为其说法；如果应该以菩萨身形获得救度的众生，妙间菩萨就示现菩萨身形而为其说法；如果有应该以佛的身形而获得救度的众生，妙音菩萨便示现佛的身形为其而说法。如此各种各样的身形，都是随着所应救度的众生的不同身形而显现出相应的身形，甚至遇到应该以灭度的<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>身形获得救度的众生，妙音菩萨还会示现灭度之相。华德，妙音大菩萨所成就的巨大神通与智慧之力，就是这样。”</p><p>　　这时华德菩萨对佛说：“世尊，这位妙音菩萨的确深深种下了善根。世尊，此菩萨安住于何种妙定而能如此随时随地变化示现不同的身相，以求度众生脱离苦难？”</p><p>　　释迦牟尼佛告诉华德的菩萨说：“善男子，妙音菩萨所安住的妙定境界，名叫现一切色身。妙音菩萨住在这种妙定之中，所以，能像刚才所说的那样给众生带来很大的好处。</p><p>　　释迦牟尼佛讲说这篇《妙音菩萨品》时，与妙音菩萨一同前往来的八万四千人都<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>了名叫现一切色身的妙定。这个娑婆世界中的无数菩萨也获得了这种妙定以及陀罗尼的法门。</p><p>　　妙音大菩萨供养释迦牟尼佛及多宝佛塔后，便返回自己所在的国土。途中所经过的各个国土都发生了六种震动，天空中像下雨一样散下宝莲之花，并自然出现了百千万亿种歌舞与妙乐。到达本国之后，妙音菩萨与围绕在他周围的八万四千菩萨来到净华宿王智佛面前，对佛说：“世尊，我这次到娑婆世界去，使那里的众生蒙益受惠，我还见到了释迦牟尼佛，见到了多宝佛塔，并对其都进行了礼拜和供养。我还见到了文殊师利法王子菩萨，见到了药王菩萨、得勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>力菩萨、勇施菩萨等大菩萨，也使与人随形的八万四千菩萨都获得了名叫现一切色身的妙定。”</p><p>　　释迦牟尼佛讲说这部《妙音菩萨来往品》时，有四万二千名天子证得了安住为生不灭之实相理体的无生法忍，华德菩萨则证得了依据《法华经》思惟谛观中道实相之理的法华三昧。</p></div>"
    },
    {
        "title": "妙法莲华经 观世音菩萨普门品第二十五",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　<a href=\"/fojing/pumenpin/yuanwen.html\" class=\"keylink\" target=\"_blank\">观世音菩萨普门品</a>第二十五</p><p>　　这时，无尽意菩萨从座位上站起来，裸露右肩，双手合十向释迦牟尼佛致礼，开口言道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>以什么<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，而立名为观世音呢？”</p><p>　　释迦牟尼佛告诉无尽意菩萨说：“善男子，如果有无量百千万亿那么多的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，他们遭受到种种苦恼现在听说过观世音菩萨之后，只要一心称念他的名号，观世音菩萨就会立即观察到这音声，使那些身处苦恼的人都得到<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。如果有人奉持称诵观世音菩萨的名号，那么即使他不幸陷入大火之中，大火也不能将其烧着，这是因为此菩萨有大威力大神力的缘故。假如有人不幸被大水卷走，只要他有称念观世音菩萨的名号，他就能很快到达浅处。假如有百千万亿那么多的众生，为了寻求金、银、琉璃、砗磲、玛瑙、珊瑚、琥珀，珍珠等宝物，乘船进入大海，即使正好碰上狂风，将其船只吹到罗刹鬼国，如果其中有人，甚至仅仅一人，称念观世音菩萨的名号，那么所遇难的人都能从鬼国中解脱出来。因为这种因缘，所以就称其为观世音菩萨。</p><p>　　“假如有人，在他临能被害之际，只要能称念观世音菩萨的名号，那么，杀人者手里的刀杖，就会应声折坏为碎段，使受害者从危难中得到解脱。假如在三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>的国土中，到处都是夜叉鬼和罗刹鬼，它们想伤害别人，然而只要一听到有人称念观世音菩萨的名号，这些恶鬼连睁开眼睛看看都不可能，何况加害于人呢？又假使有人，无论是有罪或是无罪，如果手脚被戴上镣铐，全身被枷锁缚绑，可他只要称念观世音菩萨的名号，那么所有刑具都会自动断坏，使其从束缚国得到解脱。假如在三千大千世界国土上，到处都有谋财害命的盗贼，有一位商主，率领许多商人，携带贵重珍宝，经过一段险峻的道路，其中一个商人建议大家说：‘善男子，大家不要惊恐，你们只要能一心一意地念诵观世音菩萨的名号，这位菩萨能将其<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>神力<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>给大家，你们就能从怨贼的危害中获得解脱。’众商人听完他的话后，都大声念道：‘南无观世音菩萨。’因为诵念了观世音菩萨的名号的缘故，他们都立即众危难中解脱出来。</p><p>　　“无尽意菩萨，这位菩萨众中的大菩萨观世音菩萨，他的威德神力就是如此，巍巍宏大。”</p><p>　　“假如有众生过度沉弱于淫欲，只要常常念诵并恭敬观世音菩萨，就会自然脱离淫欲。若有众生常常·怒，只要经常念诵并恭敬观世音菩萨，便能自然脱离·恨。若有人十分愚痴，只要经常念诵观世音菩萨，就会自然脱离愚痴。无尽意菩萨啊！观世音菩萨有如此种种大威德神力，能使一切众生得到益处，因此，众生常应在内心虔诚地念诵观世音菩萨的名号。如果有女人想求男孩，只要<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>、<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>观世音菩萨，就会生下一个既有福德又有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的男孩；假如她想求一个妇女孩，便会生下一个相貌端正的女孩，而且这个女孩在前世就种下了善根，因此众人都很喜爱并尊敬她。</p><p>　　“无尽意菩萨，观世音菩萨有如此神奇的威力，假使众生，能恭敬、礼拜观世音菩萨，他的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>绝不会落空。因此，众生都应该<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>、念诵观世音菩萨名号。无尽意菩萨，如果有人能信奉护持六十二亿恒河沙数那样多的菩萨名号，又能终生供养饮食、衣服、卧具、医药，在你看来，这样的善男子、善女子，他们的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>多不多呢？</p><p>　　无尽意菩萨回答说：“当然非常多啊！世尊。”</p><p>　　释迦牟尼佛说：“假使另外有人受持念诵观世音菩萨名号，甚至作短时间的礼拜和供养，那么，他所获得的福报，与前面所说的善男子、善女子所获得的福报，完全相等而毫无差异，在百千万亿劫那么多的时间里，也不能穷尽他们的福服。无尽意菩萨啊！念诵观世音菩萨的名号，就能得到如此无量无边的福德利益。”</p><p>　　无尽意菩萨对佛说：“世尊，观世音菩萨怎样游历这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>？怎样为众生<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>？他<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生的方便神力是怎样的呢？”</p><p>　　释迦牟尼佛告诉无尽意菩萨说：“善男子，在三千大千世界的国土中，若有众生应以<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>而获得救度，观世音菩萨即现佛身为其说法；应以辟支佛身获得救度的，即现辟支佛身为其说法；应以声闻身获得救度的，即现声闻身为其说法；应以梵王身获得救度的，即现梵王身为其说法；应以帝释身获得救度的，即现帝释身为其说法；应以<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天身获得救度的，即现自在天身为其说法；应以大自在天身获得救度的，即现大自在天身为其说法；应以天上大将军身获得救度的，即现天上大将军身为其说法；应以·<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>身获得救度的，即现·沙门身为其说法；应以小王身获得救度的，即现小王身为其说法；应以长者身获得救度的，即现长者身为其说法；应以<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>身获得救度的，即现居士身为其说法；应以<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>身获得救度的，即现婆罗门身为其说法；应以<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男居士、女居士身获得救度的，即现比丘、比丘尼、男居士、女居士身为其说法；应以长者、居士、宰官、婆罗门的妇女身获得救度的，即现相应的妇女身为其说法；应以童男、童女身获得救度的，即现童男、童女身为其说法；应以天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽以及人和非人之身获得救度的，即现各之自身为其说法；应以金刚神身获得救度的，即现金刚神身为其说法。</p><p>　　“无尽意，这位观世音成就了如此的功德，能够以各种身形游历各个国土，救度那里的众生，所以，你们应当一心一意地供养观世音菩萨。这位观世音菩萨能在众生遇到恐怖与危急、灾难之时，把无畏布施给众生，所以，这个娑婆世界都称观世音菩萨为施无畏者。”</p><p>　　无尽意菩萨对释迦牟尼佛说：“世尊，我现在就应当供养观世音菩萨。”于是，无尽意解下脖子上的各种宝珠与璎珞，总计价值达百千两黄金，把它们供给观世音菩萨，说道：“仁慈有德的菩萨啊，请接受这<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>布施的珠宝与璎珞吧！”这时，观世音菩萨不肯接受。无尽意菩萨又对观世音菩萨说：“仁慈有德的菩萨啊，请您怜悯我们，收下这些璎珞吧！”这时，释迦牟尼佛告诉观世音菩萨说：“你应当怜悯这位无尽意菩萨以及<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>和天神、龙神、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽，还有人与非人等，因此你就接受这些璎珞吧！” 于是，观世音菩萨出于对四众弟子及天龙八部、人与非人等的怜悯，便立即收下了这些璎珞。他把这些璎珞分作两份，一份奉献给释迦牟尼佛，一份供奉多宝佛塔。</p><p>　　释迦牟尼佛对无尽意说：“无尽意，观世音菩萨有如上所述的自在神力，所以他才能自由地游历于这个娑婆世界。”</p><p>　　这时，无尽意菩萨以偈颂格式重问道：“具足各种妙相的世尊啊，我现在再问一问那位观世音菩萨，这位<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>以什么因缘而名叫观世音呢。”</p><p>　　具足各种妙相的世尊也以偈颂格式回答无尽意菩萨说：“你听着，观世音菩萨的行持，善于应化于十方一切处所。他救度众生的宏誓就像大海一样深厚，即使经历许多劫数，也很难思议其程度。他奉持过千亿那么多的佛，并发下了清净的大愿。我现在为你略加讲述，如果听到观世音菩萨的名字，见到观世音菩萨的身相，心中不停地念诵菩萨的名号，那么就可以消灭<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>中的各种苦难。假使有谁兴起害人之心，把某人推入大火坑中，通过念诵那个观音名号所获得的<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>之力，就可使火坑变成清凉水池。或者有人漂流于大海之中，遇到毒龙、大鱼及各种鬼怪的灾难，通过念诵观音的名号获得的感应之力，即使再大的波浪也淹没不了他。或者当某人在须弥山峰上，被人推下山岩，通过念诵观音的名号获得的感应之力，就可使他像太阳住在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>一样堕落不下。或者某人被坏人追逐，跌落到金刚山下，通过念诵那个观音菩萨名号获得的感应之力，就可使他不损一毛。或者有人遇到怨贼包围，各自持刀加害于他，通过念诵那个观音菩萨名号获得的感应之力，就可使所有的怨贼立即生出仁慈之心。或者有人遭受到国王相加的危难之苦，死亡即将临头时，通过虔诚念诵那位观音菩萨名号获得的感应之力，就可使行刑之刀接连断成几节。或者有人被枷锁囚禁起来，手与足均被镣铐束缚，通过念诵那位观音菩萨名号获得的感应之力，就可使他获释而得解脱。如果有人遇到诅咒或各种毒药加害其身，通过念诵那位观音菩萨名号获得的感应之力，就可使这些诅咒和毒药不但不能害他，而且反回去加于诅咒与投毒之人。</p><p>　　“如果有人遇到凶恶的罗刹鬼以及毒龙和其它鬼怪等，通过念诵那位观音菩萨名号获得的感应之力，就可立即使它们全都不敢加害。如果某人被凶恶的野兽包围，这些野兽露出锐利的牙齿和爪子，十分可怖，通过念诵观音菩萨名号获得的感应之力，就可使这些野兽迅速跑到天边的远方。如果有人遇到·蛇、蝮蛇和蝎子，被如同燃烧着的烟火一样剧烈的毒气所威胁，通过念诵观音菩萨的名号获得的感应之力，就可使这些毒虫闻声布各自退回。如果遇到乌云密布，打雷闪电，降下冰雹或倾盆大雨，通过念诵那位观音菩萨名号获得的感应之力，就可使这种状况实时得到消散。</p><p>　　“众生深陷于困苦危厄之中，无量无数的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>逼迫其身心。观音菩萨的妙智力能够救度<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的苦难。观音菩萨具足<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力，广泛修习智慧与方便法门，在十方的所有国土之中，无处不现其身。各种恶道即<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生以及善道中的生、老、病、死等各种痛苦，观音菩萨都可逐渐使其全部消灭。观音菩萨具备看破外相的真空观、毫不执着的清净观、广大<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的智慧观，还具备拔出一切苦的<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>和给予众生一切乐的慈观，所以，你们应当时常祝愿，时常瞻仰观音菩萨。观音菩萨远离一切尘垢，所以才会有微妙的清净之光。他的智慧像太阳一样把一切黑暗全都照破了，把一切风火之灾都降伏了，从而使其智慧之光遍照一切世间。观音菩萨收持戒而获得的大悲之法体如同天雷震动一样，观音菩萨的慈悲心怀好似天上的彩云一样微妙，从而降下了<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>般的法雨，灭除了众生心头的<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>之焰。如果争斗诉讼到官府那里，或者在两军阵前的恐惧之中，通过念诵那位观音菩萨名号获得的感应之力，就可使一切怨恨全都退散。</p><p>　　“观世音菩萨具有微妙的声音，就像其本身的名号之音一样。观世音的音声不但微妙，而且清净，犹如大海的潮音。观世音菩萨的声音胜过了世间所有的声音，所以，你们要经常念诵观世音，每念一下都不生出疑惑之心观世音菩萨这位清净的圣者，能在众生遇到痛苦烦恼之时，或面临死亡危险之时，作为众生的依靠。他具备了一切功德，以慈父的眼光看侍一切众生，所修的福德像众水聚成大海一样无边无量，所以，你们应该<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜观音菩萨。</p><p>　　这时，持地菩萨从座上站起来，走向前来对释迦牟尼佛说：“世尊，若有众生听到这篇《观世音菩萨品》，知道观音菩萨自在无碍的业行，了解观音菩萨广开无量法门，示现各种神通之力救度众生，那么，我们就应当知道，此人所获得的功德的确不少。”</p><p>　　释迦牟尼佛讲说这篇《<a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>》时，参加<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>的大众中有八万四行众生都发下求证至高无上圣智的誓愿。</p></div>"
    },
    {
        "title": "妙法莲华经 陀罗尼品第二十六",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　陀罗尼品第二十六</p><p>　　这时，药王菩萨从座位上站起来，他身披袒露右肩的<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>，双手合十，向释迦牟尼佛致礼，开口言道：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，如果有善男子、善女子能够信受这部《法华经》，或者非常流利地阅读背诵或者抄写经卷，那么，他们能得到多少福呢？”</p><p>　　释迦牟尼佛告诉药王菩萨说：“如果有善男子、善女子<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>与八百万亿兆恒河的所有沙数那么多的如来佛，在你看来，他获得的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>多不多呢？”药王菩萨回答说：“非常多，世尊。” 释迦牟尼佛说：“如果有善男子、善女子能在此经中甚至只<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>一首四句偈颂，对其读诵、解释，并按其所说义理<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，那么，此人的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>也同样是很多的。”</p><p>　　这时，药王菩萨对释迦牟尼佛说：“世尊，我现在应当给讲说《法华经》的法师说陀罗尼神咒，以守护他们。”于是，药王菩萨便说出了如下神咒：</p><p>　　安尔。曼尔。摩祢。摩摩祢。旨隶。遮黎第。赊·。赊履多玮。·帝。目帝。目多履。娑履。阿玮娑履。桑履。娑履。叉裔。阿叉裔。阿耆腻。·帝。赊履。陀罗尼。阿庐伽婆娑簸蔗毗叉腻。祢毗剃。阿便哆逻祢履剃。阿·哆波隶输地。欧究隶。牟究隶。阿罗隶。波罗隶。首迦差。阿三磨三履。<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>毗吉利·帝。达磨波利差帝。僧伽涅瞿沙祢。婆舍婆舍输地。曼哆逻。曼哆逻叉夜多，邮楼哆。邮楼哆·舍略。恶叉逻。恶叉治多治。阿婆庐。阿摩若那多夜。</p><p>　　说完以上<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>，药王菩萨又对释迦牟尼佛说：“世尊，这个陀罗尼神咒乃是过去六十二亿恒河沙数那么多的如来佛所说出来的，如果有谁侵扰诋毁这位说《法华经》的法师，那他就是侵扰诋毁这些如来佛。”这时，对释迦牟尼佛称赞药王菩萨说：“善哉！善哉！药王，你怜悯、关怀、拥护讲说《法华经》的法师，所以才说出这个陀罗尼神咒，这对于所有的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，都是大有裨益的。</p><p>　　这时，一位名叫勇施的菩萨对释迦牟尼佛说：“世尊，我也为拥护、读诵、受持《法华经》的法师们说一个陀罗尼神咒。如果这些法师得到了这个陀罗尼神咒，那么，即使遇到或者夜叉鬼，或者罗刹鬼，或者富单那鬼，或者吉蔗鬼，或者鸠盘荼鬼，或者饿鬼，不论这些恶鬼如何寻找他们的短处，他们也不会为恶鬼留下可乘之机。”于是，勇施菩萨便在释迦牟尼佛面前说出如下咒语：</p><p>　　痤隶。摩诃痤隶。郁枳。目枳。阿隶。阿罗婆第。涅隶第。涅隶多婆第。伊致·。韦致·。旨致·。涅隶墀·。涅·墀婆底。</p><p>　　说完如上咒语，勇施的菩萨又对释迦牟尼佛说：“世尊，这个陀罗尼神咒是与恒河沙数一样多的如来佛所说的，而且，这些如来佛都随顺此咒，心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。如果有谁侵扰诋毁这些讲说《法华经》的法师，那么，谁就是侵扰诋毁这恒河沙数一样多的如来佛。”</p><p>　　这时，四大天王中守护北方世界·<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>天王对释迦牟尼佛说：“世尊，我也有怜悯、关怀众生，拥护讲说《法华经》的法师，而说一个陀罗尼神咒。”于是，这位天王便说出如下咒语：</p><p>　　阿梨。阿梨。·那梨。阿那庐。那履。拘那履。</p><p>　　说完如上咒语，·沙门天王又对释迦牟尼佛说：“世尊，除了用这种神咒拥护讲说《法华经》的法师外，我本身也应当拥护受持这部经典的所有众生，使他们在一百由旬之内，没有任何衰退与祸患。”</p><p>　　那时，四大天王中的持国天王，也在法华会上，他与恭敬围绕在他身边的千万亿兆干闼婆神走到释迦牟尼佛的面前，双手合掌，对佛说道：“世尊，我也以陀罗尼神咒来拥护受持《法华经》的法师。”于是，持国天王说出如下咒语：</p><p>　　阿伽祢。伽祢。瞿利。干陀利。·陀利。摩蹬耆。常求利。浮楼莎·。·底。</p><p>　　说完如上咒语，持国天王又对释迦牟尼佛说：“这个陀罗尼神咒，是从前四十二亿位如来佛所说的。如果有谁侵扰诋毁这些受持《法华经》的法师，那他就等于是侵扰诋毁这四十二亿如来佛。”</p><p>　　这时，法华会中有十位罗刹女，第一位名叫蓝婆，第二位名叫毗蓝婆，第三位名叫曲齿，第四位名叫华齿，第一五名叫黑齿，第六位名叫多发，第七位名叫无厌足，第八位名叫持璎珞，第九位名叫皋帝，第十位名叫夺一切众生精气。这十位罗刹女与鬼母及其儿子与眷属一同来到佛的面前，同声对佛说道：“世尊，我们也想拥护那些读诵、受持《法华经》的法师，以消除他们的衰退与祸患。如果有谁寻找法师的短处，使他们不能得逞。”于是这位罗刹女等便在释迦牟尼佛前说出如下咒语：</p><p>　　伊提履。伊提泯。伊提履。阿提履。伊提履。泥履。泥履。泥履。泥履。泥履。楼酰。楼酰。楼酰。楼酰。多酰。多酰。多酰。兜酰。·酰。</p><p>　　说完如上咒语，罗刹女等又继续说：“我们宁愿诸鬼在我们头上为所欲为，也不让他们去扰乱受持《法华经》的法师。这些恶鬼，如夜叉鬼、罗刹鬼、饿鬼、富单那鬼、吉蔗鬼、毗陀罗鬼、犍驮鬼、乌摩勒伽鬼、阿跋摩罗鬼、夜叉吉蔗鬼、热病鬼。假使在一日、二日、三日，四日甚至七日之中，常有热病鬼出没，不论其以男形还是女形，不论其以童男形还是童女形，甚至在梦中，都不能扰乱这些受持《法华经》的法师。”</p><p>　　罗刹女等又在释迦牟尼佛前说偈语道：“如果谁不顺从我的咒语，扰乱讲说《法华经》的法师，那么，谁的头就会被破成七份，就像阿梨树枝一样坠落于地上，破碎为七片。如同杀父母的大罪，也如同压油压死其它<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>的灾殃，以大斗小秤来欺骗他人所获致的恶报，也好像提婆达多破坏僧团的罪业，凡是侵犯这位讲说《法华经》的法师的众生，就会获致如上这些灾殃。”</p><p>　　罗刹女们说完这些偈语之后，对释迦牟尼佛说：“世尊，我们也应当亲自拥护那些受持、读诵《法华经》并依《法华经》而修行的法师，使他们身心得到安稳，远离各种衰退与祸患，消除各种害人的毒药。”</p><p>　　释迦牟尼佛告诉罗刹女们说：“善哉！善哉！你们即使仅仅拥护那些受持《法华经》的名字的人，所获得的福报已不可限量，何况拥护那些受持整个《法华经》并供养经卷的人。这些供养经卷的人，或者以鲜花、香料、璎珞供养，或者以未香、涂香、<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>供养，或者以宝幡、宝盖、歌舞供养，或者点燃各种油灯供养，如酥油灯、香油灯、酥摩那花油灯、·卜花油灯、婆师迦花油灯、优钵罗花油灯。诸如此类通过成百上千种方式来供养《法华经》的法师，皋帝，你们这些鬼众与眷属应当拥护这些法师。</p><p>　　释迦牟尼佛说辽篇《陀罗尼品》时，<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>中有六万八千人获得了安住不生不灭实相理体的无生法忍。</p></div>"
    },
    {
        "title": "妙法莲华经 妙庄严王本事品第二十七",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　妙<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>王本事品第二十七</p><p>　　这时，释迦牟尼佛告诉法华会上的大众说：“远古之世，从现在向过去追溯无量无边不可思议阿僧·那么多的劫数，那时，有一位佛名叫云雷音宿王华智，同时具足如来、应供、正遍知等各种称号。佛所在的国土，名叫光明庄严，所处的时劫，名叫喜见。在这位如来佛的法化范围之中，有一位国王，名叫妙庄严，国王的夫人名叫净德。妙庄严王人两个儿子，一个名叫净藏，一个名叫净眼。这两位儿子皆有很大的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力，福德与<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>同时兼备。他们很久以来就修大乘菩萨所行的道法，即谓<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>波罗蜜、持戒波罗蜜、忍辱波罗蜜、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>波罗蜜、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>波罗蜜、<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜、方便波罗蜜，还有大慈、大悲、大喜、大舍直至三十七品助道法，他们全都明了而通达。净藏和净眼二位王子还<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>了大乘菩萨的各种清净妙定，如：日星宿妙定、净光妙定、净色妙定、净照明妙定、长庄严妙定、大威德藏妙定。对于这些妙定，二王子也都能通达无碍。</p><p>　　当时，那位云雷音宿王华智佛欲引导妙庄严王并出于对一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>怜愍关怀的缘故，所以便开讲这部《法华经》。这时，净藏、净眼二两位王子来到母亲的住所，双手合十，对母亲说：‘愿母后前去云雷音宿王华智佛那里，我们也应当随您一同前去，以便侍从、亲近、<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>这位如来佛。为什么呢？因为此佛在所有天神与人类大众中讲说《法华经》，所以我们应该前去聆听受教。’母亲告诉儿子说：‘你们的父亲信受外道，深深地执着于<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>教法。你们应该前去告诉父亲，让他与我们一同去。’ 净藏、净眼双手合十，对母亲说：‘我们是法王如来的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，竟生在这个执持邪见的<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>。’母亲净德后告诉两位儿子说：‘你们当为父亲感到担忧，为父亲多想想。若能为父亲示现各种神通变化，他看见以后，内心会清净，那时，他或许会听我们的劝告，与我们一同到佛的住所听闻<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。’</p><p>　　于是，两位王子出于对父亲的关怀忆念，便以神通力，涌向空中，距地面有七颗多罗树那么高。二人在空中示现出各种神变景象，他们在空中行走、站立、<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>、睡卧。一会儿身上出水，身下出火；一会儿身下出水, 身上出火。有时又示现巨大的身躯，以至遍满整个<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>；忽而他们又示现小身，又由小身变为大身。甚至又在虚空中消失，忽然间，却处在地上。能像入水一样地中，又能像走平地一样行走在水面。他们示现这些神变，以使父王心地清净，能生信解佛法之心。</p><p>　　“这时，父亲看见儿子有这般神通之力，心中十分<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，深感此乃从未有过的奇事。于是妙庄严王双手合掌对儿子说：‘你们的师父是谁？你们是谁的弟子？’两位儿子回答说：‘大王，那位云雷音宿王华智佛现在正在七宝树下的法座上坐着，在一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的天神与人类大众中广泛演说《法华经》。此佛是我们的师父，我们是他的弟子。’父亲对儿子说：‘我现在也想拜见你们的师父，我们可以一同前往。’</p><p>　　“于是，两位王子从空中下来，来到他们母亲的住所，双手合掌，对母亲说：‘父王现已信解佛法，可以在此基础上发下求证至高无上之圣智的誓愿。我们已为父亲作了佛事，愿母亲允许我们在那位如来佛的住所<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。’</p><p>　　“这时，两位王子欲重申其意，便以偈颂格式向母亲复述道：‘愿母亲放我们出家作<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。诸佛很难遇到，现在有佛出世，我们要去随佛学习。就好三千年才开一次的优昙钵罗花，很难遇到，要遇到佛也是这样的难啊！救世的<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>难遇，要脱离各种苦难也就很难很难。所以，愿母亲允许我们出家。’</p><p>　　“母亲便告诉儿子说：‘我同意你们出家，为什么呢？困为佛陀千载难逢啊。’于是两位儿子对父母双亲说：‘善哉！愿我们实时前去云雷音宿王华智佛的住所，亲近，供养这位如来佛。为什么呢？因为佛很难遇，就像优昙钵罗花历久才得一现一样，又像独眼之龟在大海上要找一个浮末的小孔一样。可由于我们先世已种下了深厚的善根，有了这样好的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>，今生得以出家。为什么呢？因为诸佛难遇，时机也是千载难逢。’</p><p>　　“那时，妙庄严王后宫的八万四千宫女都已能够<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这部《法华经》。净眼菩萨很久以来就已通达了法华<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，净藏菩萨已在无量百千万亿劫那么长的岁月中，为了使一切众生远离各种恶道，通达了离诸恶道和妙定。国王夫人净德也获得了名叫诸佛集的妙定，能够知晓诸佛的秘密法藏。两位王子就这样，以方便法门的力量，谆谆善诱，化导了他们的父亲，使其产生了相信并了解佛法的心意，从而喜爱上了佛法。</p><p>　　“于是，妙庄严王与群臣及其眷属一起，净德夫人与后宫嫔妃及其眷属一起，两位王子与四万二千人一起，大家一时间都动身前往佛的住所。到达佛的住所以后，他们向佛行头面礼足的<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>，绕佛三周，退而站在一旁。这时，那位云雷音宿王华智佛向国王<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，开示教法，赐以利乐。国王听后，十分高兴。妙庄严王及其夫人便解下脖子上的珍珠、璎珞，把这些价值百千黄金的珍宝散在佛的身上。这些珍珠、璎珞在虚空中化成有四根柱子的宝台，台中有一宽大的宝床，宝床上敷盖着百千万种天衣，天衣上有一位如来佛，正在双膝打坐，身放出耀眼的光明。这时，妙庄严王心想，<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>真是稀有难得，端庄威严，奇特无比，成就了最为微妙的色身宝相。</p><p>　　“这时，云雷音宿王华智佛对<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>弟子说：‘你们看见这位妙庄严王在我面前合掌站着吗？此国王将在我的佛法中作<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，他精勤修习，助佛弘道，日后必将<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>，<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>为娑罗树王，国名叫光大，劫名叫大高王。这位娑罗树王佛拥有无数菩萨大众和无数声闻弟子。他的佛国平坦方正。他的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>就是如此的巨大。’这位妙庄严王便立即把国家交付给弟弟治理，自己与夫人、两位王子和所有眷属们，在佛法中出家修道。</p><p>　　“国王出家以后，在长达八万四千年之中，勤奋不息，精进不怠，依《妙法莲华经》从事<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。经过如此长时间的修行之后，妙庄严获得了名叫一切净功德庄严三昧的妙定神力。于是，妙庄严王升上虚空中，距地面高达七棵多罗树。他在空中对云雷音宿王华智佛说：‘<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，我的两个儿子在过去已经大作佛事，从而获得了许多神通妙用。他们以神通变化的方式转变了我的邪心，使我得以安住于佛法之中，得以见到世尊。这两位儿子是我的良师，他们为发起我前世种下的善根，为使我从佛法中蒙益受惠，故而前来投生于我家。’</p><p>　　“这时，云雷音宿王华智佛对妙庄严王说：‘是这样！是这样！正像你所说的，如果善男子、善女人能够种下善根，那么，他们每一世都可以得到良师的指点。他所遇到的良师能大作佛事，指示众生，<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生，使众生获得利乐，并最终证入至高无上的圣智。大王，你应当知道，良师益友是一个非常重要的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，他能教化指导众生使其得以见到佛陀，并发了求证至高无上之圣智的心愿。大王，你看见你的这两位儿子吗？这两个儿子在过去曾供养过六十五百千万亿兆恒河沙那么多的如来佛，对这些佛表示了亲近和恭敬。在这些佛那里，他们受持《法华经》，怜悯关怀持邪见的众生，使这些众生转而安住于<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>的佛法中。’</p><p>　　“妙庄严王便从虚空中下来，对云雷音宿王华智佛说：‘世尊，如来真是稀有难得，因为有功德，有智慧的缘故，头顶上的肉髻大放光明，照亮了一切。如来的双眼既宽又长，呈绀青之色。如来的两眉之间有非凡的白毫光相，白如珂月一样的清洁。如来的牙齿，洁白，整齐，密实，时常发放光明。如来的唇色像频果一样鲜红而润泽。’妙庄严王对佛的这些无量百千万亿种功德大加赞叹之后，在云雷音宿王华智佛面前，一心合掌，又向佛说：‘世尊，真是亘古未有啊！如来的教法非常<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，可以成就不可思议的微妙功德，教戒众生，诸恶莫作，众善奉行，令众生得到安稳和快乐。我从今日起，不再随心所欲，妄自行事，再不生邪见之心，不生骄慢之心，不生·恨等各种恶劣之心。’说完这些话后，妙庄严王向佛再次行礼，然后退了出去。“</p><p>　　释迦牟尼佛对法华会上的大众说：“在你们看来，妙庄严王难道是旁人吗？他就是现在的华德菩萨。那位净德夫人就是现在站在佛座前的名叫光照庄严相的菩萨。她当年因为哀怜妙庄严王及其所有眷属，所以在这个家中投生。国王的两个儿子，就是现在的药王菩萨和药上菩萨。药王菩萨和药上菩萨成就了如此巨大的功德，他们已于过去在无量百千万亿个如来佛那里种下了各种功德和根子，从而成就了今日不可思议的各种善功与福德。如果有人能识得这两位菩萨的名字，那么一切世间内的所有天神、人民也便应该<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>这两位菩萨。”</p><p>　　释迦牟尼佛说完这篇《妙庄严王本事品》时，有八万四千人远离了尘垢，在各种佛法中获得了观察并通晓世间一切现象的<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>清净境界。</p></div>"
    },
    {
        "title": "妙法莲华经 普贤菩萨劝发品第二十八",
        "author": "鸠摩罗什",
        "date": "2014-02-18",
        "html": "<div class=\"B1_text\"><p>　　白话<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p><p>　　<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a> <a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　普贤菩萨劝发品第二十八</p><p>　　这时，以<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>无碍的<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力和声威与<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>著称的普贤菩萨，与无量无边不可称数的大菩萨一起，从东方前来这个<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>的耆阇崛山。途中所经诸国，大地普皆震动，天空中像下雨一样散下宝莲之花，并出现了百千万亿种歌舞与音乐。与普贤同行的还有天神、龙神、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩·罗伽八部神以及人与非人等。他们恭敬地围绕在普贤菩萨的周围，各自都现示出威严、福德与神通之力。普贤率领这些大众来到娑婆世界的耆阇崛山中，向释迦牟尼佛行以己之头<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>之足的<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>，又由右向左绕佛七周以示敬拜，然后对佛说：“<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，我在宝威德上王佛的国土中，遥闻娑婆世界正在讲说《法华经》，于是，我便率领无量无边百千万亿的菩萨大众同来听讲领受，惟愿世尊为我们演说。譬如在如来灭度之后，善男子、善女人如何才能得到这部《法华经》呢？”</p><p>　　释迦牟尼佛告诉普贤菩萨说：“如果善男子善女人能够成就四种法，那么，在如来佛灭度之后，他们就可得到这部《法华经》。这四种法是：第一，得到诸佛的爱护与关怀；第二，种下各种福德的根子；第三，进入破除颠倒<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>、必能最终证悟者的行列；第四，发下了救度一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的誓愿。善男子、善女人若能成就这四种法，那么，就是在如来灭度之后，他们也能得到这部经典。”</p><p>　　这时，普贤菩萨对释迦牟尼佛说：“世尊，在您灭度之后的最后一个五百年中，正处五浊恶世之时，此时如果有<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>这部经典的众生，我就会守护他，消除他的衰败与患祸，使他得到安稳，使如下魔鬼无可乘之机，如魔王、魔子、魔女、魔民、为魔附体者、夜叉鬼、罗刹鬼、鸠盘头鬼、毗舍·鬼、吉蔗鬼、富单那么鬼，韦陀罗鬼等等。所有这一切恼人的妖魔鬼怪都没有可乘之机去伤害受持《法华经》的众生。五浊恶世中受持《法华经》的人，不论他行走还是站立，只要他读诵这部经典，我便于那时骑乘长有六牙的白象王，与大菩萨众一起去到他的跟前，然后自己现出身相，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>并守护他，安慰他的心灵，当然这也是为了供养《法华经》。此人如果在<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>中思惟此经，那时，我出会骑乘白象王，现身在他的面前。此人如果对《法华经》中的某句话或某个偈颂一时忘记了，我就会去教他，与他一起读诵，使他恢复到流利的程度。那时，受持、读诵《法华经》的人可以看到我的身相，所以，他会极其<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，由此更加<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。因为看见我的缘故，他便会得到妙定和总持一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>神咒，其名为在法门中旋转自在的旋陀罗尼，共有百千万亿种这样的旋陀罗尼，还有应机<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>、方便自在的法音方便陀罗尼。总而言之，他能够得到如此神妙、如此众多的陀罗尼。</p><p>　　“世尊，如果在后世最后五百年的恶浊之世中，<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、男<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>、女居士中有人求索《法华经》，有人受持《法华经》，有人读诵《法华经》，有人书写《法华经》，总之就是想依据《法华经》而<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，那么，他们就应该在三个七日即二十一天之内，专心致志，精进不怠。满二十一天后，我将骑乘六牙白象，在无数菩萨的围绕下，以一切众生所喜欢看见的身相，显现在他们的面前，为他们说法，开示、教导他们，使他们获得利乐，同时再给予他们陀罗尼神咒。由于他们获得了这个陀罗尼神咒，所以，不可能再有什么非人的鬼怪之类妖邪之徒来破坏他们，他们由此也不会被女人所迷惑和扰乱，我的法身也会时常亲自守护这些人。现在，就请世尊允许我说这陀罗尼咒。”</p><p>　　于是，普贤菩萨在释迦牟尼佛前说出如下<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>：</p><p>　　阿檀地，檀陀婆地。檀陀婆帝。檀陀鸠舍隶。檀陀修陀隶。修陀隶。修陀罗婆底。<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>波·祢。萨婆陀罗尼阿婆多尼。萨婆婆沙阿婆多尼。修阿婆多尼。僧伽婆履叉尼。僧伽涅伽陀尼。阿僧·。僧伽婆伽地。帝隶阿惰僧伽兜略阿罗帝波罗帝。萨婆僧伽地三摩地伽兰地。萨婆达磨修波利刹帝。萨婆萨·楼驮·舍略阿·伽地。辛阿·吉利地帝。</p><p>　　说完如上咒语，普贤菩萨接着又对释迦牟尼佛说：“世尊，如果有哪位菩萨听到这个陀罗尼神咒，那么他应该知道这是普贤菩萨的神通力量所成就的。如果《法华经》流行于人类居住的阎浮提洲，那么，其中受持《法华经》的人就应该这样想：‘这全靠普贤菩萨的威神之力。’如果有人受持、读诵《法华经》，并正确无误地忆念，理解经中的义趣，根据经中所说而修行，那么应当知道此人是在修行普贤的行门，这人必然已在无数个佛的住所，深深地种下了善根，并为这些如来佛摩顶授记。如果有人只是抄写《法华经》，那么，此人今生<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>终之后，将<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>于忉利天上。那时，会有八万四千个天女演奏起各种各样的歌舞音乐来迎接他。此人便会戴上七种珍宝所成的宝冠，在众多的美女之中，享受各种娱乐，快乐无比。仅仅抄写经书尚且如此，何况受持、读诵《法华经》，并正确忆念，理解其中义趣，根据经中所说而修行，那福德就更大了。如果有人受持、读诵《法华经》，并理解其中义趣，那么，此人命终时，会有上千位如来佛为他伸手，使他毫不恐惧，使他不转生堕于诸恶道中，而是<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>于兜率天中<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨的住所。弥勒菩萨具足三十二种超凡脱俗的妙相，大菩萨们围绕在他的周围，还有百千万亿的天女眷属也<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>在这里。既然有如此的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>与利益，所以，有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的人应当专心致志地亲自抄写或让别人抄写此经，受持、读诵此经，正确忆念此经，并根据经中所说而修行，世尊，我现在以神通之力守护这部经典，在如来灭度后，将使此经在人类居住的阎浮提洲内，广泛流布，永不断绝。”</p><p>　　释迦牟尼佛称赞普贤菩萨说：“善哉！善哉！普贤，你能守护《法华经》并帮助其<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>于世，使许多地方的众生获得安乐与利益，你已成就了不可思议的功德和大慈大悲的心愿。你从久远的时代以来，立下求证至高无上之圣智的心愿，所以，才能在今日发下这种种神通愿力，表示要永远守护这部《法华经》。我将以神通之力守护那些能受持普贤菩萨名号的人。普贤菩萨，如果有人能受持、读诵、正确忆念、修习、书写这部《法华经》，那么，应当知道，此人就等于是见到了释迦牟尼佛，就好像是从佛的口中亲闻这部经典一样；同时也应当知道，此人就等于在供养释迦牟尼佛；还应当知道，此人为佛所赞叹叫好；另外还应当知道，此人就等于被释迦牟尼佛用手摩顶；最后还应当知道，此人就等于被释迦牟尼佛用佛衣覆盖。像这样的人，已不再贪念于世俗的享乐，不会喜欢外道的经书和外道的手笔，也不会再去亲近外道<a href=\"/remen/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>和其它各类造作恶业的人，如屠夫、畜养猪羊鸡狗的人、猎人、出卖色相的妓女等；此人心地质朴直率，有正确的心念，有福德的力时；此人不为贪欲、·恨、愚痴等三毒所恼乱，也不再为嫉妒、我慢、邪慢以及自以为业已修行<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>的增上慢等恶习所恼乱；此人少欲知足，能修行普贤菩萨的行门。</p><p>　　“普贤，如来灭度之后的最后一个五百年，如果有人看见人受持、读诵《法华经》的人，那么，他就应该这么想：‘此人不久将去道场，破除各类魔众，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>至高无上的圣智，众而成就<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>，并由此而恩*轮、击法鼓，吹法螺、雨法雨，此人将在天神的人类大众之中高坐于佛的宝座即狮子法座上<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。普贤，如果能在后世人受持、读诵这部经典，那么，此人就不会再贪着于衣服、卧床、饭食以及其它生活用品，他就会有求必应，心愿绝不落空，而且还能在现世获得<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。如果有人轻视而诋毁他说：‘你真是个疯子，白白地作了这些修行，最终却是一无所获。’此人因为这种诋毁所获的罪报，将于以后的每一世中，转生这无眼的众生。如果有人见了受持《法华经》的人，对他进行供养和称赞，那么，此人今生就可获得善报。如果还有一部分人看见受持这部经典的人之后，说出人家过去的各种恶行，以进行打击和中伤，那么，不管这种恶行是真的还是假的，这些中伤别人的人现世就会患上白癞病。如果有人轻视讥笑受持《法华经》的人，那么，他所获得的<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>是生生世世牙齿疏松、缺漏，口唇丑陋，鼻子扁平，手脚弯曲，双眼歪斜，身上臭秽，并患恶疮、脓血、水肿、气喘等各种重病。所以，普贤，如果见到受持这部经典的人，就应当起身远迎，就像敬拜如来佛一样敬拜他。”</p><p>　　释迦牟尼佛讲说这篇《普贤劝发品》时，与恒河沙数一样无量无边的菩萨获得了百千万亿种名叫旋陀罗尼的自在无碍的总持法门。与三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>所有微尘数一样多的菩萨都完全掌握了普贤菩萨所行的道法。</p><p>　　释迦牟尼佛说此经时，普贤等各位大乘菩萨、<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗等各位小乘声闻<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>以及各位天神、龙神等人部神众、人及非人的鬼神等<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>上的一切大众，都非常欢喜，他们受持了佛所宣说的一切法语，向佛致礼后离开了法会。</p></div>"
    }
]