[
    {
        "title": "为什么说早上念佛最好？",
        "date": "2016-04-28",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x6167;&#x51C0;&#x6CD5;&#x5E08;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x65E9;&#x4E0A;&#x5FF5;&#x4F5B;&#x6700;&#x597D;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2019/0119/20190119041745341.jpg\" title=\"&#x6167;&#x51C0;&#x6CD5;&#x5E08;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x65E9;&#x4E0A;&#x5FF5;&#x4F5B;&#x6700;&#x597D;&#xFF1F;\" /></p>\n<p>　　最好是早上起来就<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>，因为早上起来，还没有开始工作，那个时候念佛最好，为什么？</p>\n<p>　　我们早上起来，已经睡够了，不会再昏沉，同时，早上起来那一段时间的环境和心境怎么样呢？心是非常宁静的，那个时候还没有动脑筋想其他事情，那个时候的心很寂静，很接近我们的本性──就是<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，佛性是没有念头的，佛性是安详寂静的、不生不灭的、永恒存在的；空气很清净，早上工厂还没有开工，所以，空气还是很清净的；环境很安静，那个时候大家还都没有出门工作，所以没有什么噪音。</p>\n<p>　　所以，早上起来心最宁静、空气最清净、环境最安静，那个时候，我们就起来<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>念佛，先刷牙、洗脸，有佛堂就在佛堂上一炷香，这个香尽量不要用有化学成分的，有化学成分的话，对自己的喉咙、肺部都不好，我们在家，一支就够了，不一定要三支，好香，短短的，就可以了。</p>\n<p>　　<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>三拜之后，自己就来盘腿打坐念佛。你在哪里打坐念佛都可以，只要你觉得舒适。如果不能盘腿，没关系，你就散盘；不能散盘，你就坐在椅子上，把脚<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>来，让身体安安稳稳、舒舒服服的。眼睛闭起来，心中默念“南无阿弥陀佛”。因为是打坐念佛，所以不必拿<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>。腰带不要束太紧，让身体放松，让心放静，专一在这一句<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>上。你有半个钟头，念半个钟头，有一个钟头，念一个钟头，有两个钟头，念两个钟头。在这个时候，什么事情都不要去想，等大家要吃早餐了，才起来做早餐。</p>\n<p>　　晚上有时间的话，也可以这样做。如果说早上有一两个钟头的时间，但是坐在那里坐不住，可以起来<a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>、念佛，可以经行念佛，互相运用。</p>\n<p>　　如果觉得昏沉，可以张开嘴巴金刚念。金刚念大家晓得吗？我们念佛有四种声音，一种是大声念，一种是小声念，一种是金刚念，一种是默念。大声念、小声念的声音大家都听得到，金刚念的声音自己听得到，别人听不到，再就是默念，默念就是也不动嘴巴、也没有声音，在心中念佛，别人不晓得我们是在念佛。我们<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>，就是以心中默念为主，如果觉得昏沉，可以金刚念，同时把眼睛睁开；不昏沉，就把眼睛闭上，然后心中默念。</p>\n<p>　　在这四种念佛当中，平时是以哪一种念佛为主呢？以金刚念为主。因为大声念、小声念不能长久，会累，默念又往往容易昏沉或者打<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，所以就金刚念，金刚念最能够不累，同时也能够引起我们的心，因为动嘴巴能够引起心，同时也能够绵绵密密、细水长流、相续不断、念念不舍，所以，平常就金刚念，不管工作也好、走路也好，有事无事都好，只要不动脑筋，就动动嘴巴金刚念，这样了解吗？</p>\n<p>　　平常都是念六个字，“南无阿弥陀佛”，如果晚上要睡觉了，或者是中午要休息了，躺在床上，那个时候就心中默念“阿弥陀佛”四个字就好，不要提神，很轻松地念，自然地入睡。其他时间都是念六个字。</p>\n<p>　　这一句佛号最没有忌讳，最方便，你在大雄宝殿、念佛堂、客厅可以念佛，在卧室、在洗澡间、在卫生间也可以念佛，所以最方便、最没有忌讳。如果是诵经，就没有这么方便了，必须要是清净的地方，卧室、卫生间就不能诵。只有这句佛号，本身没有障碍，阿弥陀佛是无碍光如来，不会受任何的障碍，不会忌讳“这里干净不干净”，他是不垢不净的，同时，阿弥陀佛又叫清净光如来，能够化污秽为清净，所以，不管在哪个地方念佛，都会给当地带来清净、吉祥，能够消灾免难。</p>\n<p>　　所以，大家平常就是动嘴巴，动嘴巴最不累。当然，法无定法，如果动嘴巴还觉得昏沉，那就出声念；如果动嘴巴还觉得累，那就心中默念，很方便。</p>\n</div>"
    }
]