[
    {
        "title": "佛教有哪些禁止的恶行？十恶业道",
        "date": "2016-04-28",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x4F5B;&#x6559;&#x6709;&#x54EA;&#x4E9B;&#x7981;&#x6B62;&#x7684;&#x6076;&#x884C;&#xFF1F;&#x5341;&#x6076;&#x4E1A;&#x9053;\" src=\"https://www.liaotuo.com/uploadfile/2019/0109/20190109025227657.jpg\" title=\"&#x4F5B;&#x6559;&#x6709;&#x54EA;&#x4E9B;&#x7981;&#x6B62;&#x7684;&#x6076;&#x884C;&#xFF1F;&#x5341;&#x6076;&#x4E1A;&#x9053;\" /></p>\n<p>　　谈到<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>，人们心中呈现的大都是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>中各种各样的清规戒律，从数以几百条的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>僧戒到<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>的<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>、八戒、<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>等。很多人会觉得这种苦行僧式的<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>规范，给现实的<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>增加了不必要的<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>和束缚，是人类自由的禁锢。但在佛教看来，如果想获得优越的生存境况，使自己生活得更舒适快乐，那就必须遵守相应的道德准则。在<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>规律的法则下，如果欲以作恶的方式追求幸福和快乐，那无异缘木求鱼，最终必将竹篮打水，甚至带来负面结果。有鉴于此，寂天菩萨曾在其名著《入菩萨行论》中说：“人们向往快乐，但却种下<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>的种子；人们讨厌痛苦，但却沿着通往痛苦的道路一意孤行。”</p>\n<p>　　当某种思想、语言和行为，在将来会导致痛苦的发生时，佛教将之列为恶业。在所有恶业中，<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>归纳了十条必须禁止的恶行，这就是十恶业道。或许人们在最初遵守的时侯，会觉得非常不舒服，因为觉得自己失去了很多所谓的自由，这与自己追求快乐的意愿并不一致。只是由于佛陀的规定，才不得不遵守。但在进一步了解业果法则后，便会清楚知道，戒律不但不是快乐的羁绊，反而是通过快乐的必经之路。只有断绝了痛苦的因由，才能防止痛苦的产生。事实上，断除十恶业道的戒律并不是佛陀强加在人们身上的枷锁，而是打开痛苦锁链的利器。</p>\n<p>　　这十恶业道中，属于身体行为方面的有三种，语言方面的有四种，思想方面的也有三种。前面说过，在身口意三种业当中，身体方面的业最重，语言方面的业是其次，相对较轻的是意业，所以我们从身业开始谈及。</p>\n<h2><a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>：</h2>\n<p>　　身业中最严重的恶业就是夺取其他<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a><a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>的杀生。在佛教中，一般用四个因素来叙述一个完整的业，就是对象、动机、手段和方式及最终结果。无论善业还是恶业，都是具备这四个因素才是完整的一段业。在杀生中，对象函括一切生命，人、动物乃至鬼神都属此类。动机是指在无明的催动下，或者图财害命，或者为了满足口腹之欲而杀生取食，或者基于忿怒嗔恨杀害他们，或者受邪教等蛊惑，杀生祭祀……无论是处于贪婪、嗔恨还是愚痴的动机，具备一种就符合此条。手段是指一切杀生的方式，如刀杀、枪杀乃至诅咒等各种可以令对方丧生的手段。结果是对方丧命。如果这四个因素全部具备，就构成一个完整的杀业，其<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>也是最严重的；如果只是具有两个或三个因素，譬如动了杀机但没有施行，或者施行没有杀死等，不算完整的杀业，果报也没有完整的杀业严重。在对象的这一环节，以杀人为最重，罗汉圣者、父母、自己师长等是重中之重，其次是身体庞大的动物。顺带一提的是，佛教认为<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>也属于杀生恶业，所以严禁佛教徒的自杀行为。</p>\n<h2>不与取：</h2>\n<p>　　不与取通常被译为偷盗，但或许不与取更为准确。因为不与取不仅仅限于小偷盗窃的行为，还有更为广泛的含义。它不但包括偷盗，还包括借物不还、把公司的财物方便己用以及各种诈骗、巧取豪夺等一切没经过对方同意就据为己有的行为。如果说杀生是侵犯他人的身体和生命，那么不与取就是侵犯他人的财物。在不与取的四个因素中，对象是指一切有主的他人物品，包括国有及他人私有物品；动机是指出于贪婪、仇视或者愚痴随一；手段是指偷窃、骗取、豪夺等各种据为己有的方式；结果是指将他人物品占为己有或生起已得手的心念。俗语说，人为财死鸟为食亡，出于贪婪，不与取是一种极难防止的恶行。</p>\n<h2>邪淫：</h2>\n<p>　　在佛教中，<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>的<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>需要遵循不淫欲的教诫，普通人要遵守的则是不邪淫。邪淫是指不正当的性关系，这种恶业会对他人及<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>造成伤害及困扰，增加社会的不和谐稳定因素，因此也是一种较重的恶业。在四个因素中，邪淫的对象是指出家僧尼、未成年者等所有自己配偶以外的异性或者同性。严格来说，即使是自己配偶，口交、手淫等也都属于邪淫范畴。在佛教中还有更为细致的要求，比如在不合时宜的时间、地点与自己配偶性交，也都属于邪淫。如在自己或者配偶守持<a href=\"/remen/baguanzhaijie.html\" class=\"keylink\" target=\"_blank\">八关斋戒</a>的日子、白天，地点如在寺院、塔庙内等，都涉嫌邪淫。动机主要有贪婪、复仇或者愚痴随一；手段是指两性交媾；结果是指产生快乐感受。邪淫会导致自己配偶不忠，身处污秽环境等苦果。</p>\n<h2><a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>：</h2>\n<p>　　在四种语恶业中，妄语是指撒谎。谎言使人变得没有诚信，失去信任和感召力。在完整妄语业的四个因素中，对象是指能听懂自己语言的他人，如果是对动物及听不懂自己语言的人撒谎，那么并不构成完整的妄语恶业；动机仍然是贪嗔痴随一；方式则较多样化，虽然妄语是指口业，但这里是指所有的明说、暗示、默许等各种行为；结果是指对方明白撒谎的内容。在妄语中，有一种被称为大妄语的恶业，是就撒谎内容而言的，如说自己是佛陀再世，谎称自己拥有<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>能力等，以此欺骗他人，骗取财物等，即属大妄语。罪业较普通谎言要重的多。</p>\n<h2>离间语：</h2>\n<p>　　是指挑拨离间、搬弄是非的恶业。在很多情况下，大规模的战争也是由于小小的离间造成的，因此，离间语之恶业亦不可小觑。完整离间语业的四个因素中的对象，是指两个或以上的人。无论他们之间过往是否和睦，都可以作为离间语的对象。动机是出于贪嗔痴或者嫉妒等负面烦恼心绪；手段是指通过各种真实或虚假的谎言，在双方间进行挑拨，意欲令其不和；最终结果是指对方听懂自己所说的离间语，无论是否造成对方反目，都属于完整的离间语恶业。在现代竞争激烈的时代，此离间语尤为易犯。</p>\n<h2>粗恶语：</h2>\n<p>　　是指一切能令对方生起忿怒及恼乱的语言，譬如詈骂、诅咒、讽刺等。四因素中的对象是指一切有情甚至无情，我们固然可以骂人，也可以骂动物，甚至骂天骂地，因此粗恶语的对象可以是一切有情和外境；动机是出于忿怒等各种负面烦恼心绪；手段是指各种谩骂的语言，包括冷嘲热讽，谩骂或是真实语，譬如对瞎子辱骂瞎鬼，也可以是虚假的谎言，譬如骂一个精神正常的人为精神病等；结果是对其进行谩骂。</p>\n<h2>绮语：</h2>\n<p>　　是指一切没有意义的无聊话语。语恶业的绮语虽然是最轻的一种口恶业，但却是最容易违犯的，很多人在绮语中，浪费了<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>中宝贵的时光。四因素中的对象，是指一切能引发无意义的话语，譬如无聊的娱乐八卦、国际政治以及各种感叹和醉话等。动机是指各种烦恼等负面心绪；加行是喜欢谈论无意义的话题，由于只是抒发内心的无聊，因此无论对方是否懂得都算违犯；结果是将无意义的话语说出口。基于人生宝贵，佛教劝导人们不要为了打发时间、感觉好或使自己显得洒脱而说绮语。</p>\n<h2>贪婪：</h2>\n<p>　　贪婪是属于思想方面的恶业道，之所以说贪婪、嗔恨和邪见是恶业道而非恶业，是因为这三种心理活动并非是业，而是业必经的道路，所以叫恶业道。贪婪是积淀在众生身心中的负面心绪，由于势力强大，因此也有人说是<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>的推动者。完整贪婪四因素中的对象是指一切不属于自己的财物等，佛教对众生的心理活动分析得很细致，对于不属于自己的财物的执着才是贪欲的对象，而对于自己财物的执着，则归入吝啬中；动机是指贪婪本身以及嗔恨等任一负面心绪；手段是指要占有他人财物的想法；最终结果是指一定要占有的强烈欲望。由于贪婪并非身口的行为，单单具有这种强烈欲望已经<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>了四个要素。</p>\n<h2>嗔恚：</h2>\n<p>　　嗔恚是一种强有力的负面心绪，是一种足以毁坏善根、摧毁世界的黑恶力量。完整嗔业道四因素中的对象，是指内心烦乱欲打击对方；动机可以是各种负面烦恼心绪；手段是内心生起让对方遭到不幸的心念；结果是指一定要让对方遭受不幸的坚固心念，譬如一定要打杀等的决定。佛教认为，嗔恚暴怒的心态，会摧毁以前的善行，其果报也极为可怕，因此特别强调要严加防止。</p>\n<h2>邪见：</h2>\n<p>　　这是一种不承认因果轮回、不承认前生后世的观念。佛教认为，邪见是一切邪恶的源头，其力量也足以摧毁一切善根。四因素中的对象是指不承认有因果、<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>等存在；动机是愚昧等负面烦恼心绪；手段是指否认轮回、因果的思考过程；结果是指坚决否认轮回、因果的坚定心态。佛教中<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>得乐、作恶受苦的因果理念，是一切断恶行善行为的基础，如果否定这些，则善行大厦会濒临坍塌。佛教中有针对轮回真实的论证，我们将在下文介绍。</p>\n<p>　　与十黑业道相反的就是十白业道，即十种善行，分别是不杀生、不偷盗、不邪淫、不妄语、不说离间语、不恶口、不绮语、不贪、不嗔和<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。这是佛教徒最低的道德底限。</p>\n</div>"
    }
]