[
    {
        "title": "修定的基本方法、修止方法与入定的技巧",
        "date": "2016-04-28",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x4FEE;&#x5B9A;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x3001;&#x4FEE;&#x6B62;&#x65B9;&#x6CD5;&#x4E0E;&#x5165;&#x5B9A;&#x7684;&#x6280;&#x5DE7;\" src=\"https://www.liaotuo.com/uploadfile/2019/0321/20190321044026122.jpeg\" style=\"width: 484px; height: 300px\" title=\"&#x4FEE;&#x5B9A;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x3001;&#x4FEE;&#x6B62;&#x65B9;&#x6CD5;&#x4E0E;&#x5165;&#x5B9A;&#x7684;&#x6280;&#x5DE7;\" /></p>\n<h2><a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>的基本方法</h2>\n<p>　　在四个<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>里面，初禅最浅，四禅最深。</p>\n<p>　　<strong>初禅：</strong>称为离生喜乐地。---——离五盖（昏沉、掉悔、贪欲、嗔恚、疑）</p>\n<p>　　<strong>二禅：</strong>称为定生喜乐地。离觉观（觉指粗的觉察，观指细的觉察）</p>\n<p>　　<strong>三禅：</strong>称为离喜妙乐地。——离喜</p>\n<p>　　<strong>四禅：</strong>称为舍念清净地。——离乐（出入息断）</p>\n<p>　　舍念清净地的意思是，如果你的心念能够达到四禅，当时，你就会生起几种<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人最珍贵的心念：</p>\n<p>　　1.<strong>舍的心念</strong>——就是平等心，没有造作的心，在四禅里面会升起来。</p>\n<p>　　2.<strong>舍受</strong>——在四禅里面没有乐受，只有不苦不乐的舍受。在初禅、二禅和三禅里面，都有乐受，四禅的心比三禅的少了乐受贪着。</p>\n<p>　　3.<strong>念清净</strong>——在四禅里面，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>最强的时候，心中完全没有杂念。所以，四禅也称为念清净。</p>\n<p>　　如果一个人修到四禅，生起舍念清净的心，修观就很容易成就。有四禅的清净心，所观察的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>就会很容易现前，即不必经过思考，当下就能被你观察到。因此，在我们<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>修行时，就应该尽量掌握和认识四禅，并且要修到四禅。假如一个人正在打坐，如何衡量他的心有多稳定（即他的<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>）呢？<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>就是以初禅、二禅、三禅和四禅来判定。初禅的心念比较粗。如果<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>达到四禅，心念就会很清净。</p>\n<p>　　心念的清净程度会影响修行用功的效率。如果你能明了初禅到四禅的心念差别，你就明白以微细的心去观察佛法的重要性。假如今天你的定力只能到初禅，就直接去修观、参话头，不论你多拼命修观、或参话头，初禅的心力只是会在修观时打<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>而已。如果你今天定力达到四禅，无论你参话头或者修观，你都能用很微细的心去修。四禅的功效和初禅是绝对不一样的。因此，认识初禅到四禅对修观是非常重要的。</p>\n<h2>修止方法很多，今天，先介绍\"出入息观\"。</h2>\n<p>　　佛讲的出入息观并不是数息或随息</p>\n<p>　　观呼吸的方法，在佛教里面称观出入息。发展到后来就叫‘<a href=\"/remen/shuxiguan.html\" class=\"keylink\" target=\"_blank\">数息观</a>’，更进一步发展成‘六妙法门’。很多人把出入息观错误地以为是数息观，数息观是粗的方法，比较容易修。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>里讲到的修法是观呼吸，不是数呼吸，只是妄想杂念很多的人需要数息。这里，我以观出入息的方法来指导大家。</p>\n<p>　　根据经典的记载，观出入息的方法，就是观鼻端前面的呼吸。所以佛教里有这样一句话:‘眼观鼻，鼻观心’，有人把它叫做‘观鼻尖白’。就是从鼻尖前来观呼吸，进一步从<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>心，鼻尖白是因为观到后来在鼻尖见到光明。</p>\n<h3>　　1．调身方法</h3>\n<p>　　有些人打坐修定不久，会出现一些现象及障碍。比如姿势障碍、呼吸障碍、身体疼痛等，这些大都是因为身体没有调好所造成的。</p>\n<p>　　静坐的姿势是很重要的，修禅定最好的姿势是双盘。但是入定不一定要盘腿，重要的是全身放松。优波离尊者第一次入定时是站立的，当时他在为佛剃头发呢。但是，一般上静坐要姿势正确。坐时首先不必设法摆正头，只要眼睛向前看，头就自然正。然后眼皮垂下来, 眼皮垂下时别忘了眼睛也下视，眼睛不可向前看，下视后不要理会眼睛，太理会眼睛会产生幻境。</p>\n<p>　　每次上坐时，一定要检查一下全身是否放松。我说过，不一定要双盘或单盘，重点是全身肌肉放松。因为如果你静坐一小时，身上某处肌肉拉紧一小时，一小时后拉紧的部位就要疲劳。有些人坐久了，他的头就会低下来一点点。低一点点不要紧，不可以头低到打瞌睡的样子，除非你进入一种定的时候，头就会自然低下来，那是另一回事。</p>\n<h3>　　2．调息方法</h3>\n<p><strong>　　呼吸方法</strong></p>\n<p>　　呼吸方法有胸部呼吸和腹部呼吸，胸部呼吸会胸闷气短，所以必须用腹部呼吸。若要坐久或入定久，一定要用腹部呼吸。吸气时，肚皮要自然涨，呼时自然凹进去，不可用意念控制呼吸。最好的腹部呼吸是吸气吸到换气之前，小腹会有一种吃饱饭似的感觉。为了做到这一点，一定要放松裤带，如果你穿的裤子是松紧带的，必须把裤带拉到肚脐下四指宽。胸部呼吸无法达到很微细，从二禅开始会造成气喘、胸口闷、痛，乃致无法修到三禅。</p>\n<p><strong>　　观呼吸粗细</strong></p>\n<p>　　即修行用功之处，出入息的业处就是呼吸的动作。从鼻孔到你的丹田、肚脐都有呼吸的动作，观不同部位的呼吸，对于心念的影响也不一样。道家观下丹田，就是观肚皮上下的动作，是个很粗的呼吸动作。佛家用的方法是观鼻端前的呼吸，是微细的动作。观丹田的境界不但很粗，而且心集中丹田会产生内气的运转，会带来很强的气。佛教说修定所专注的境界有大有小，观肚皮的境界是比较大，比较粗的。虽然道家修任督脉也能入定，但境界粗，要修很久才能定下来。佛家观鼻前的呼吸，它的优点在于鼻端前的呼吸是很微细的，很快就能入定，如果你的心念不够微细的话，你就观察不到鼻端前的细境界。</p>\n<p><strong>　　业处：感觉人中处出入息的相</strong></p>\n<p>　　业处就是修行的用心处，出入息观的业处是六尘中的触尘，即观鼻腔对外面呼吸的触觉，不可在鼻孔内感觉呼吸，而是在鼻腔外来感觉，就是人中这个位置。当你呼吸的时候，有风在人中这个位置吹过。因此，观出入息时不要弄错，不要观鼻腔里面，而是在鼻腔外面。因为鼻腔外面的呼吸比较细，心念粗的人没有办法感觉到。如果你叫一个人观鼻端前的呼吸，很容易发现他平时的心念粗或者细；当他轻易地在人中观察到有风吹过，就可以知道这个人很容易进入微细的心。相反地，心粗的人找来找去都没有感觉。有些人为了找鼻前的呼吸感觉，找了三天都找不到；因为他的心念太散乱，太粗了所以找不到。一下子就观察到的人，他修禅定就会很快入定。</p>\n<p>　　你们现在要注意鼻端前的呼吸，一定要设法知道，呼吸给你的感觉是什么呢？就是八种触觉：</p>\n<p><strong>　　呼吸的相：出入息的长短粗细冷热滑涩</strong></p>\n<p>　　就是要观察呼吸的长短的触觉；粗细的触觉；冷热的触觉；还有滑涩的触觉。所谓观出入息，就是观呼吸的这八种变化。</p>\n<p>　　长短以什么来比较呢？是以前后的呼吸来比较的。不是你和我之间的比较。即呼吸的时候，看下一次呼吸比上一次呼吸长了还是短了，是呼气长还是吸气比较长呢？如果呼吸调得很好，就会越来越长。</p>\n<p>　　冷热则是观察呼气热还是吸气比较热。但是，当呼吸微细时则冷热不明显，此时就不必观察冷热了。</p>\n<p>　　滑和涩是什么呢？指的是你呼吸的易难。有时候吸气比较难，好象有阻塞，这就叫涩。如果容易吸气叫滑。呼出来也是一样，也就是说我们呼气的时候，是容易还是难，这就叫滑跟涩。</p>\n<p>　　粗细是你呼吸的风的强度，是粗还是弱。如果你呼吸的风声很大，那就是粗。如果风声很弱就是细。一个人如果要入定，他呼吸的风要求细。请记住：要入定不是要求呼吸长，是要求呼吸细。以下是观出入息的要点：</p>\n<p>　　⒈开始时要注意的是呼吸的冷热感，心不数息也不随息。</p>\n<p>　　⒉呼吸越细，冷热不明显。</p>\n<p>　　⒊当呼吸微细时，就要专注在呼吸的粗细。</p>\n<p>　　⒋呼吸越细，心念就越细；心念越细，入定就越深。</p>\n<p>　　⒌观呼吸粗细时，不要留在同样的粗细，要越观呼吸越细。</p>\n<p>　　⒍呼吸越长，就能入定越久。</p>&#13;\n　　错误的业处：人中、气感&#13;\n<p>　　你观呼吸时，不可观想将心抓住，安放在人中这个位置，这种行为叫做作意太甚。观呼吸时必须靠触觉，心专注呼吸在人中摩擦的感觉。千万不要没有摩擦的感觉，硬把心集中在人中，那就错了。换句话说，不允许将心念集中在身体的任何一个部位，包括人中，只允许集中在呼吸上。</p>\n<p>　　观呼吸除了八种触觉之外，还会产<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>感，即身体中有气在运转。练气功的人都知道，意到气到。中医也认为心念集中到哪里，气就会跑到哪里。任何长期静坐的修行人，都明白有此事。可是，那些不懂静坐的人，一听到有人讲到气，就说那是外道。由于我们在鼻端前观察呼吸，就会有一些气集中到人中这里来，这时心要分辨清楚，不可以去观察气感，只允许观察呼吸的风。如果你去观察气感，就发现人中越来越重，越来越麻。观察更久一点，你会觉得整个嘴唇都会麻起来。这时，你的心念除了观察呼吸，你也在观察涨的感觉。八触是呼吸给你的感觉，不是皮肤麻的感觉。在观呼吸时，人中麻的感觉不是你想要观的境界，你要清楚所观的境是出入息，身体上的痛和麻也不是观出入息要观的境界。</p>\n<p>　　那些不懂得如何观出入息的人，心念往往会集中在两件事上：一件是看呼吸，一件是集中于气的麻、涨的感觉。有些人还集中第三件事，就是他多加一个心念——将注意力集中在人中的意念。要清楚：观察呼吸时只有集中呼吸的触觉才是对的，其余的集中都错。要弄明白这三件事，你才不会错用心，才能以观察呼吸的修法进入心一境性。</p>\n<h3>　　3．调心方法：</h3>\n<p>　　静坐除了调身——姿势、调息——呼吸，还有调心，保持正念正知。就是正念正知专心于心一境性。</p>\n<p>　　<strong>心一境性</strong></p>\n<p>　　佛教的任何修行法门，都要清楚修法所观的境界，及如何用心于境界。出入息观的修法是以呼吸为境界——触觉。心在任何时候都要保持在呼吸上，你的心所对的境界是呼吸。你心中的任何感觉必须是和呼吸相关的，比如长短粗细的感觉。你可以起心动念，不过生起的心念必须是关于呼吸的事，比如想观冷热的差别或专心数出息等等。如果你做到了这一点就叫做心一境性。如果你的心念跑去听。在当时，你就离开了呼吸——所观的境，就不叫心一境性。心一境性维持的时间有长有短。即使时间很短很短，也是心一境性。如果你在五秒钟内很集中，五秒钟内也叫心一境性。心一境性慢慢延长，就产生定，佛法称为三摩地。即你心中的每一个念头都集中在同一境界，这就叫入定——三摩钵地。</p>\n<p>　　<strong>经行可以克服昏沉和掉举</strong></p>\n<p>　　有些人一静坐就会有昏沉、散乱、掉举等<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。凡是静坐时很昏沉不要硬硬支撑。就是说，你坐了十五分钟以后，觉得很昏沉，可以去洗一个脸。如果你很疲倦，我会让你去睡觉。为什么呢？睡眠不够的话，静坐时疲倦硬撑着，是浪费时间。不如去睡一、两个小时，然后再来坐，那效果会更好。用功静坐要讲效率的。不是说，我在这里坐一小时，我就是用功一小时，不相等的。我如果在这里坐一小时，心里老打妄想，我是在这里打妄想一小时。那么，静坐时坐得很昏沉，很掉举，怎么办？可以口含一粒糖或起来经行，经行能克服昏沉和掉举。如果你静坐一小时，前面十五分钟都很清醒，过后都是昏沉的，不如你静坐十五分钟，经行十五分钟。再重复静坐十五分钟、经行十五分钟，那效果会更好。经行也能修定，所以，我不会强迫你们一定要一起坐在这里。但是初学者在早上一定要至少坐两个小时。其余时间，你可以坐了走，走了再来坐。</p>\n<p>　　<strong>念念要分明</strong></p>\n<p>　　修定的重点是不管你坐或者走的时候，都要保持正念，就是念念清楚自己的心念。当你在观出入息的时候，要清楚心始终维持在观呼吸上；除了这件事，其它的事情都是错的。也就是说，如果你在观察呼吸的过程中，忽然想去念几句<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>、或者想<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>号，都是错的。那些都是掉举的烦恼。如果你在观呼吸的过程中，忽然间看到佛，也是错的，要斩掉它。为什么呢？因为你目前的目的是要完成观出入息的心一境性——以呼吸为境。凡是离开呼吸的境都是错。</p>\n<h3>　　4．修定时如何经行</h3>\n<p>　　经行是怎么回事呢？是来回地行走着修行。行走时也可以修定，也可以<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。就是说可以修止，也可以修观。</p>\n<p>　　<strong>经行的方法</strong></p>\n<p>　　修完四禅之前，我教你们经行是以修定为主。经行的方法就是来回地走，限定在十五步到二十步之间，不可以兜圈子，只能来回走直线。在这来回走的过程中，如何保持正念呢？首先，要在身体的动作上保持正念，身体以外的动作，你去注意的话，就是错的。就是说，你的脚在走的时候，身体的动作心里要明明了了。</p>\n<p>　　如果你走慢一点的话，你可以观察脚在‘上…下…接触，上…下…接触’。如果你走快一点的话，你可以观察两脚‘左…右…左…右…’地向前走。要这样观察，左脚动的时候，心中要知道是左，右脚动的时候，心中要知道是右。此时除了左右脚的动作这件事以外，观察其它的事情都是错的，全部心念都要专注在脚的动作上。当你走到尽头的时候，你要停下来，你要知道\"停\"。不但要清楚知道动作，心还要专注地念，做什么动作就念什么，如坐时念\"坐…坐…坐…\"，走时念\"左…右…左…右…\"，站时念\"站…站…站\"，转时念\"转…转…转\"，你要一面清楚地知道脚动作，一面在心中念着动作。</p>\n<p>　　为什么要念？是为了加强你的心念专注在脚的动作上，不要做第二件事情。如果你突然间注意有灯，那么就是说你的心念已经离开了脚。这时候，你快一点警告自己，要念‘知道…知道…’。这‘知道’就是提醒自己：我的心现在跑到眼睛这里来了，快点回来观察我的脚。这样就是修定。虽然你在动中，心专注在身体的动作上，这是在动中产生定力的方法。</p>\n<p>　　<strong>经行时的心念要从粗变细</strong></p>\n<p>　　在走的过程中，心念有粗有细，我们要设法达到细心。当心很粗的时候，你什么感觉都没有。当心念比较细的时候，你就能感觉到脚的肌肉在摩擦。甚至那肌肉摩擦的声音你都能感觉到，乃至骨骼里面的响声。如果你走到这样微细的时候，你的骨骼和肌肉的摩擦都清清楚楚，这时，你必定心无杂念，并且身心也会觉得特别轻安。当你心细到很集中的时候，会出现一种要跌倒的现象！你连走路的平衡都忘记了，就是说，你非常专注在你的动作上。经行来回走的当时，心只维持一件事情，什么也不管，只要知道脚的动作。当你想起另一件事情，就是妄想、杂念，你要快点念：知道！知道！然后快点摄心回来，小心看你的脚。</p>\n<p>　　<strong>任何时候要保持正念正知</strong></p>\n<p>　　这样的经行，要走多久？不限时间，越久越好。能走一小时两小时更好。如果你能够这样很平静地走两小时，效果跟静坐两小时是一样的。如果你不懂如何经行的话，可能是在打妄想、散步，不是修行。如果经行走累了，你就回来静坐，坐累了就再去经行。明白了吗？这样交换地修，你的心就不会觉得坐久了，没事干而起烦恼就想休息。身体坐累了就起来走，走累了就打坐,这样的话，就可以整天地在修行。</p>\n<p>　　如果整天持续地修持，不只在经行和静坐时，心只专注所修的法门。在其它时间里，也必须保持正念正知。就是任何时候你都要对自己的心念清清楚楚，知道自己在做什么。如果敲钟了，心想去吃饭，经行修得严密的人，就不会匆忙地就走去了。他会小心地看心念如何生起，从想去吃饭开始，观察自己的所有动作；就跟经行一样观察起身、站立、走去、端饭等等，吃饭时心中明明了了，自己正在拿饭碗、正在嚼食物、正在吞咽等等。心里只观照当下身心的变化，不会想第二件事情。听懂我说什么了吗？就是只管你眼前当下的动作，心中清清楚楚。不去想其它的事情。这样的话，你修定就会很快。</p>\n<p>　　关于修定，我就大略介绍到这里。\t\t\t\t</p></div>"
    }
]