[
    {
        "title": "癌症",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/remen/aizheng.html\" class=\"keylink\" target=\"_blank\">癌症</a></h2>\n<p>　　在医学上，癌是指起源于上皮组织的恶性肿瘤，是恶性肿瘤中最常见的一类。相对应的，起源于间叶组织的恶性肿瘤统称为肉瘤。有少数恶性肿瘤不按上述原则命名，如肾母细胞瘤、恶性畸胎瘤等。一般人们所说的“癌症”习惯上泛指所有恶性肿瘤。</p>\n<p>　　肿瘤是机体在各种致瘤因素作用下，局部组织的细胞在基因水平上失去对其生长的正常调控导致异常增生与分化而形成的新生物。新生物一旦形成，不因病因消除而停止生长，他的生长不受正常机体生理调节，而是破坏正常组织与器官，这一点在恶性肿瘤尤其明显。与良性肿瘤相比，恶性肿瘤生长速度快，呈浸润性生长，易发生出血、坏死、溃疡等，并常有远处转移，造成人体消瘦、无力、贫血、食欲不振、发热以及严重的脏器功能受损等，最终造成患者死亡。</p>\n<h2>基本信息</h2>\n<p>　　又称：癌瘤、癌肿</p>\n<p>　　 英文名称：Cancer</p>\n<p> 　　就诊科室：肿瘤科</p>\n<p> 　　常见病因： 约80%以上的恶性肿瘤与环境因素有关 常见症状 早期恶性肿瘤多无明显全身症状。</p>\n<h2>病因</h2>\n<p>　　恶性肿瘤的病因尚未完全了解。多年的流行病学研究及实验和临床观察，发现环境与行为对人类恶性肿瘤的发生有重要影响。据估计约80%以上的恶性肿瘤与环境因素有关。各种环境的和遗传的致癌因素可能以协同或序贯的方式引起细胞非致死性的DNA损害，从而激活原癌基因或（和）灭活肿瘤的抑制基因，加上凋亡调节基因和（或）DNA修复基因的改变，使细胞发生转化。被转化的细胞可先呈多克隆性增生，经过一个漫长的多阶段演进过程，其中某个克隆相对无限制扩增，通过附加突变，选择性形成不同特点的亚克隆，从而获得浸润和转移能力，形成恶性肿瘤。因此，肿瘤从本质上来说是一种基因病。</p>\n<h3>　　1. 外界因素</h3>\n<p>　　（1）化学因素：如烷化剂、多环芳香烃类化合物、氨基偶氮类、亚硝胺类、真菌毒素和植物毒素等，可诱发肺癌、皮肤癌、膀胱癌、肝癌、食管癌和胃癌等。</p>\n<p>　　（2）物理因素：电离辐射，如X线可引起皮肤癌、白血病等，紫外线可引起皮肤癌，石棉纤维与肺癌有关，滑石粉与胃癌有关，烧伤深瘢痕和皮肤慢性溃疡均可能发生癌变等。</p>\n<p>　　（3）生物因素：主要为病毒，其中1/3为DNA病毒，2/3为RNA病毒。DNA病毒如EB病毒与鼻咽癌、伯基特淋巴瘤有关，人类乳头状病毒感染与宫颈癌有关，乙型肝炎病毒与肝癌有关。RNA病毒如T细胞白血病/淋巴瘤病毒与T细胞白血病/淋巴瘤有关。此外，幽门螺杆菌感染与胃癌发生也有关系。</p>\n<h3>　　2. 内在因素</h3>\n<p>　　（1）遗传因素：真正直接遗传的肿瘤只是少数不常见的肿瘤，遗传因素在大多数肿瘤发生中的作用是增加了机体发生肿瘤的倾向性和对致癌因子的易感性，如结肠息肉病、乳腺癌、胃癌等。</p>\n<p>　　（2）免疫因素：先天性或后天性免疫缺陷易发生恶性肿瘤，如丙种蛋白缺乏症患者易患白血病和淋巴造血系统肿瘤，肾移植后长期应用免疫抑制剂的患者，肿瘤发生率较高，但大多数恶性肿瘤发生于免疫机能“正常”的人群，主要原因在于肿瘤能逃脱免疫系统的监视并破坏机体免疫系统，机制尚不完全清楚。</p>\n<p>　　（3）内分泌因素：如雌激素和催乳素与乳腺癌有关，生长激素可以刺激癌的发展。</p>\n<h2>临床表现</h2>\n<p>　　恶性肿瘤的的临床表现因其所在的器官、部位以及发展程度不同而不同，但恶性肿瘤肿瘤早期多无明显症状，即便有症状也常无特征性，等患者出现特征性症状时，肿瘤常已经属于晚期。一般将癌症的临床表现分为局部表现和全身性症状两个方面。</p>\n<h3>　　1.癌症的局部表现</h3>\n<p>　　（1）肿块：癌细胞恶性增殖所形成的，可用手在体表或深部触摸到。甲状腺、腮腺或乳腺的癌可在皮下较浅部位触摸到。肿瘤转移到淋巴结，可导致淋巴结肿大，某些表浅淋巴结，如颈部淋巴结和腋窝淋巴结容易触摸到。至于在身体较深部位的胃癌、胰腺癌等，则要用力按压才可触到。恶性肿瘤包括癌的肿块生长迅速，表面不平滑，不易推动；良性肿瘤则一般表面平滑，像鸡蛋和乒乓球一样容易滑动。肺部等胸腔器官无法直接触摸到，但在胸片或CT上可以看到相应的肿块，或在锁骨上等部位触摸到转移的淋巴结肿块。</p>\n<p>　　（2）疼痛：肿瘤的膨胀性生长或破溃、感染等使末梢神经或神经干受刺激或压迫，可出现局部疼痛。出现疼痛往往提示癌症已进入中、晚期。开始多为隐痛或钝痛，夜间明显。以后逐渐加重，变得难以忍受，昼夜不停，尤以夜间明显。一般止痛药效果差。</p>\n<p>　　（3）溃疡：体表或胃肠道的肿瘤，若生长过快，可因供血不足出现组织坏死或因继发感染而形成溃烂。如某些乳腺癌可在乳房处出现火山口样或菜花样溃疡，分泌血性分泌物，并发感染时可有恶臭味。胃、结肠癌形成的溃疡一般只有通过胃镜、结肠镜才可观察到。</p>\n<p>　　（4）出血：癌组织侵犯血管或癌组织小血管破裂而产生。如肺癌患者可咯血或痰中带血；胃癌、食管癌、结肠癌则可呕血或便血，泌尿道肿瘤可出现血尿，子宫颈癌可有阴道流血，肝癌破裂可引起腹腔内出血。</p>\n<p>　　（5）梗阻：癌组织迅速生长而造成空腔脏器的梗阻。当梗阻部位在呼吸道即可发生呼吸困难、肺不张；食管癌梗阻食管则吞咽困难；胆道部位的癌可以阻塞胆总管而发生黄疸；膀胱癌阻塞尿道而出现排尿困难等；胃癌伴幽门梗阻可引起餐后上腹饱胀、呕吐等。总之，因癌症所梗阻的部位不同而出现不同的症状。</p>\n<p>　　（6）其他：颅内肿瘤可引起视力障碍（压迫视神经）、面瘫（压迫面神经）等多种神经系统症状；骨肿瘤侵犯骨骼可导致骨折；肝癌引起血浆白蛋白减少而致腹水等。肿瘤转移可以出现相应的症状，如区域淋巴结肿大，肺癌胸膜转移引起的癌性胸水等。</p>\n<h3>　　2.全身症状</h3>\n<p>　　早期恶性肿瘤多无明显全身症状。恶性肿瘤患者常见的非特异性全身症状有体重减轻、食欲不振、恶病质、大量出汗（夜间盗汗）、贫血、乏力等。恶病质常是恶性肿瘤晚期全身衰竭的表现，不同部位肿瘤，恶病质出现早晚不一样，一般消化道肿瘤者可较早发生。</p>\n<p>　　某些部位的肿瘤可呈现相应的功能亢进或低下，继发全身性改变，如肾上腺嗜铬细胞瘤引起高血压，甲状旁腺腺瘤引起骨质改变等。</p>\n<p>　　此外，有些肿瘤如肺癌，由于产生内分泌物质，产生与转移、消耗无关的全身症状，即副肿瘤综合征等，表现为肺性骨关节病、Cushing综合征、Lambert-Eaton综合征、异位ADH分泌综合征等。</p>\n<h2>预防</h2>\n<p>　　国际抗癌联盟认为，1/3的癌症是可以预防的，1/3的癌症如能早期诊断是可以治愈的，1/3的癌症可以减轻<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，延长<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。据此提出了恶性肿瘤的三级预防概念：</p>\n<p>　　一级预防是消除或减少可能致癌的因素，防止癌症的发生。约80%的癌症与环境和<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>习惯有关，改善生活习惯，如戒烟，注意环境保护较为重要。近年来的免疫预防和化学预防均属于一级预防，如乙型肝炎疫苗的大规模接种，选择性环氧化酶2（COX-2）抑制剂对结直肠腺瘤进行化学预防等。</p>\n<p>　　二级预防是指癌症一旦发生，如何在早期阶段发现并予以及时治疗。对高发区和高危人群定期检查，一方面从中发现癌前病变并及时治疗，另一方面尽可能发现较早期的恶性肿瘤进行治疗，可获得较好的治疗效果。</p>\n<p>　　三级预防是治疗后的康复，提高生存质量，减轻痛苦，延长生命。包括各种姑息治疗和对症治疗。对癌痛的治疗，世界卫生组织提出三级止痛方案，基本原则为由非吗啡类药物过渡到吗啡类药物；由小剂量开始，根据止痛效果逐步增加剂量；以口服为主，无效时直肠给药，最后注射给药；定期给药。</p>\n</div>"
    }
]