[
    {
        "title": "保家仙",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"227\" src=\"https://www.liaotuo.com/uploadfile/2016/0104/20160104021908677.jpg\" style=\"width: 326px; height: 248px\" width=\"354\" /></p>\n<h2><a href=\"/remen/baojiaxian.html\" class=\"keylink\" target=\"_blank\">保家仙</a> （封建神位名）</h2>\n<p>　　保家仙一般在东北供俸保家仙，通常写在纸上贴在墙上，或是用木板制作的胡黄常蟒仙的排位。</p>\n<h2>保家仙　　</h2>\n<p>　　一般在东北农村供俸，一般是写在纸上贴在墙上，或是用木板制作的胡黄常蟒的排位，有的人家也有小庙；供俸保家仙一般不用做仪式，直接写上供俸即可，但是供俸保家仙不可以冷落，每逢家里蒸馒头都要上供莫让占荤，仙家真性情，山高日月明。庙小<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>大，搭救<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>人。保家平安乐，四海把名扬。瓜果梨桃摆，花开富贵家。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>又磕头，代代把名传。保家仙据东北那边老人讲是当年努尔哈赤封的，脱去身衣换人形，千年<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>苦难多。只愿还我清白身，一生只想把名扬。</p>\n<h3>　　堂仙群仙会圣问</h3>\n<p>　　原始通天颁法旨，布下迷局来闯关，闯过关者列仙班，共赴天庭开圣会。金花教主坐中央，银花云龙列两旁。今日来把仙堂正，天下堂口齐理清。四大家族有位者，皆上天庭来议事。无位草仙初<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>，城隍土地把旨传。天下堂口有十万，今日理清减五成。各府各州有数额，领兵过千方成堂！四方监堂齐会审，八方使者八方查。无德无道不正堂，今日不封明日封。四大家族各祖师，教诲门徒多<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>。怎奈现世天下乱，各路妖魔扰堂营。今日群仙来赴会，共把天下堂口议。各家祖师齐赴会，教主点名应声到。只报封号不报名，以免世人互混淆。终南山上来八位，领头之仙胡清阳。修得万年化仙身，门徒千万遍天下。长白山上十九位，无极教主头里坐。教主封号蟒无极，蟒家众仙开山祖。东华山上九十位，帝君坛前把法修。各封神候在天界，不争名来只度人！昆仑山中五十位，胡黄常蟒皆有名。玉虚金丹化仙身，名讳仅告有缘人！灵蛇岛中十一位，当家之人常莲花。方外神岛众仙修，脱得蛇形化人身！黄家道场五龙山，共赴大会十七人。广华真人领兵至，黄家众圣随后临。圣会传下此道文，得缘之人把法传。道尽天机唤善根，有缘得见皆缘人！</p>\n<h3>　　<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的浸染</h3>\n<p>　　中国特有拜物教信仰遗存，由于受到<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>与道教信仰的浸染，带有深刻的道教佛教色彩，是中国民间信仰的大部分分布于东北。</p>\n<h3>　　信仰的存在</h3>\n<p>　　五大仙作为东北仙堂信仰的崇拜对象，又被细分成几大类，如“清风”指男性鬼魂，而\"烟灵\"指女性鬼魂，但是又引入了道教鬼仙的一些观念和中原信仰中的神崇拜；而“胡黄”是对狐崇拜的发扬，包含了汉族的胡仙崇拜，又增加了黄仙这个新成员；“蟐蟒”、“柳仙”，来自于蛇神崇拜，亦带有龙图腾的影子的存在。</p>\n<h2>保家仙与萨满教</h2>\n<h3>　　神灵附体</h3>\n<p>　　仙堂信仰与原始萨满教有着密切的血缘关系，在<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>上，它继承了萨满教“神灵附体”的传统，只是由传统萨满教的“萨满法师”换成了“仙堂<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>”、“弟马”；在信仰论上，它同样强调万物有灵论，并在佛教道教理论的改装下显得更具<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>力；在<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>上，它仍保留着萨满教的传统，铃、鼓、镜等具有萨满教特色的法器还在使用。</p>\n<h3>　　保家仙与民俗</h3>\n<p>　　一般人家供奉保家仙如同供奉城隍神、土地神，逢节上供。</p>\n<p>　　它的仙谱与世界观佛道是纯朴的，它的信仰者或者倾向于佛，或者倾向于道，东北的一些佛道庙宇的前身即供奉保家仙的庙宇。在信仰的世界里，保家仙信仰天然地和道教佛教没有抵触的藩篱，彼此使用着同样的语言和思维方式，这正是它作为中国民间信仰最大的特征与优势。</p>\n<h2>四大仙族</h2>\n<h3>　　尊隆者之敬称</h3>\n<p>　　太爷太奶是对保家仙中地位尊隆者之敬称，有胡仙祖太爷、胡仙祖太奶、胡仙太爷、胡仙太奶、黄仙太爷、黄仙太奶、常仙太爷、常仙太奶、蟒仙太爷、蟒仙太奶等多尊，由于各堂口信奉之“仙榜”有所出入，兹不祥录。</p>\n<p>　　旧时东北三省及河北、山东等地又专门修庙供奉胡仙三太爷。有人称胡三太爷在保家仙信仰中道行地位颇高，被认为是狐仙家族的长老，有预知祸福于人的能力。一说胡三太爷为清初山东士人胡峄阳，信奉道教，擅长易数，被后人尊之为仙。胡仙太爷坐中央，有言要与诸位讲。各家堂口供仙榜，仙途修行非易事。莫为邪念坏道行，仙家弟子心善良。切莫为财黑心肠，有难理应给搭救。不能昧心总说谎，骗人皆是骗自己。害人子孙要遭殃，祸福皆在自身上。修道之路也修心，心好福星自高照。</p>\n<h3>　　东北保家仙</h3>\n<p>　　保家仙分别是：胡仙祖太爷，胡仙祖太奶，胡仙大太爷，胡仙大太奶，胡仙二太爷，胡仙二太奶，胡仙三太爷，胡仙三太奶，黄仙太爷，黄仙太奶，常仙太爷，常仙太奶，蟒仙太爷，黑老太，长眉大仙，结巴仙，山东大仙，胡天刚，胡天雷，胡仙姑，胡天春，胡翠娥，胡翠花，胡天飞，胡天风，常天龙 ，常天凤，常仙姑，蟒天龙，蟒翠霞，<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>天龙，护法地蟒等。</p>\n<p>　　历史：胡家太爷共有八位，和一位太姑。他们是同父异母所生的兄分别为胡大太爷（胡天祖）、胡二太爷（胡天南），胡三太爷（胡天山）、胡四太爷（胡天龙）、胡五太爷（胡天刚）、胡六太爷（胡天清）、胡七太爷（胡天霸）、胡八太爷（胡天豹）和一位太奶（胡云花）。胡大太爷和胡二太爷在商朝战死疆场，现已被封神，胡三太爷现掌管全天下胡家的出马仙。剩下从胡四太爷~~胡八太爷和一位太奶都在一个堂里做出马仙。</p>\n<p>　　胡天龙：驻足昆仑山戊云洞（昆仑瑶池附近），左边是紫霞宫，右边是紫兰洞，中间是戊云洞。坐骑：麒麟。生日：三月初五。胡天龙乃是胡四太爷，是全天下第一武将。玉皇大帝都会让其七分。曾拜李老祖为师，道行与天地共存，在封神之上。（上古神仙）身穿金盔金甲，紫袍加身。救过文王、武王、文帝（武王的儿子）。身带多种法宝：1.八方子母神剑2.八封神珠，也叫（阴阳神珠），能定乾坤。壁神珠、壁水珠、壁火珠、壁土珠、壁木珠、壁金珠、3.五行青龙、白虎剑。4.乾坤八封神球。5.五星球（五宝）6.六十四根金银毒针。</p>\n<p>　　胡天刚：驻足昆仑山戊云洞，坐骑：麒麟。生日：九月十五。排行老五，（胡五太爷）和胡天清排行老六（胡六太爷）他俩是双胞胎。道行65顿。一顿分为一万二千八百年。封神有名。被封为64星君之一。曾拜李老祖和孙老祖门下，学过道行和顿数。身穿金盔金甲，救过各朝各代的帝王。身带几样法宝：手拿虎月双峰剑，背后背着阴阳乾坤球和百宝囊。还带条火龙（太上老君八卦炉里炼的），封神中，过9关斩42将，破过胡娘娘的阵法。</p>\n<p>　　胡天清：驻足昆仑山戊云洞，坐骑：麒麟。生日：九月十五，排行老六（胡六太爷），道行65顿。封神有名。被封为74星辰之一。跟随姜老太公一生。曾拜李老祖和孙老祖门下，学过道行和顿数。还和吕老祖学过神通。身穿金盔金甲，红袍加身，救过各朝各代的帝王。身带几样法宝：手拿虎月双剑，带着五月双勾（一勾三魂，二勾七魄），背着七陵伞，可以遮阴阳五行，化成浓水。杀过3尾狐、6尾狐、7尾狐跟着纣王，还有杀过孔雀，真正它不是孔雀，而是只乌鸦，和四哥一起破阵，长蛇五行阵法。</p>\n<p>　　胡天霸：驻足昆仑山戊云洞，坐骑：麒麟。生日：二月初五。排行老七，（胡七太爷）。道行63顿。和胡天豹排行老八（胡八太爷）是双胞胎。封神有名。被封为74星辰之一。身穿金盔金甲，保过各朝各代的帝王。过七关，斩32将。身带几样法宝：手拿青龙燕月弯勾刀，背后背着个聚魂瓶。还背着七谷神爪。</p>\n<p>　　胡天豹：驻足昆仑山戊云洞，坐骑：麒麟。生日：二月初五。排行老八，（胡八太爷）。道行63顿。封神有名。被封为74星辰之一。身穿金盔金甲，身带几样法宝：手拿二龙盘蛇清风剑，背着八卦伞罗，和阴阳两界3盏灯。还带两面大旗（一红、一黑）。</p>\n<p>　　胡云花：驻足驻足凤凰山五莲花峰紫云宫 坐骑：莲花和七角鹿王（七角双眉千里鹿，全身黄色带着斑马线）。生日：七月十八。修行道行62顿。胡云花乃是八位胡家太爷的亲妹妹（胡老太姑）。曾拜西王母娘娘、女娲娘娘、孙王母为师，学过道行、顿数、仙术和药术。身穿银盔银甲，（白衣白靴白罗裙）后面披着红色战袍。能文能武，长的非常漂亮，五官不过16岁，因为她懂得变术（养颜术）。保过很多朝代，救过姜老太公，因中五蝎毒，后配仙方所救，救过文王的妻子2次，救过武王和他的妻子中黑烟黑毒，身中百针，后配仙丹所救。有几种法宝：左手拿着绣龙清风刀，右手拿着药王仙丹和仙书。身后背着五行山，还背着99根金针（太上老君八卦炉里炼的），洒出去能让天昏地暗，能治人于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>，生能治百病，死能灭三魂七魄。还带着3尺黄菱，放在空中可遮三山五岳，天地不可安宁。也曾几次<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，转下凡间，投胎做人。（都是赫赫有名的女战将）。五位太爷和一位太姑,已经跟随老弟马18代。</p>\n<p>　　金花教主 生日：三月初一</p>\n<p>　　金花教主：驻足丹东五龙山。 坐骑：三寸金莲花</p>\n<p>　　历史：金花教主乃是通天教主的夫人。所谓通天教主上边坐，金花教主陪伴着。通天教主和金花教主掌管全天下下方神明和下方仙和下方（胡、黄、白、柳、常、蟒、蛇、黑、狼、狗、蜈）等等。武将出身，封神有名，封为金花教主，姜老太公所封。脚踏三寸金莲。身穿银盔银甲，后面披着红袍。金花教主共姐八位。其中第一位是王母娘娘。最小一位是通天教主的夫人。有几样法宝：左手拿着青龙宝剑、右手拿着白虎宝剑。带着阴阳乾坤两球（一龙一凤）。曾8次因缘，转凡间8次。（都是赫赫有名的女中豪杰）。不久将来，还会在次因缘，转入凡间，转姓李家门下。保过各各朝代。跟随老弟马已经18代了。</p>\n<p>　　胡老仙翁</p>\n<p>　　历史：胡老仙翁：也叫胡老黑仙，驻足铁刹山中峰，南天门百仙洞。坐骑：旁坐水精兽（水眼金精兽，鼻孔翻翻，长相像狮子，头上带两个角，二目圆圆，卷毛带盔甲，还带两条老龙须，四个脚都是六指，跟胡老仙翁61顿）。生日：九月初九。修行道行66顿。和胡家太爷都是平辈。开天辟地时，住在贺洲九龙山（河南），后来居住铁刹山，玉皇大帝都让其3分，兄弟5位，战死疆场4位，他排行老三，有9个儿子和七个女儿，各个威风，赫赫有名，和一个妻子（黑妈妈）早期住在项洲（河南），后来在铁刹山，做下很多贡献，被长眉大仙封为东北道教总护法。道行60顿，真正的生日：四月十八（六月二十四），全天下只有一个黑妈妈。掌管2大洲。胡老仙翁带有几样法宝：手拿龙头清风剪（龙头拐杖），后面背着3面大旗，（红、黑、白）3中颜色，晃得天昏地暗，各路邪神，九丈缠魂灵（专门缠三魂七魄，包括神仙）。现在跟随老弟马已经17代了。</p>\n<p>　　胡天海</p>\n<p>　　历史：胡天海驻足昆仑山无云洞，坐骑：麒麟，生日：一月十九，道行66顿。胡天海原名胡海，混沌初开时居住牛头山，现居住昆仑山无云洞（洞中有66位仙）就在天山瑶池旁边。和居住蓬莱仙岛蓬莱阁2个洞府。封神有名。封为74个星辰之一。兄弟哥3位，胡天海排行老二，一兄和一弟战死疆场，曾保各个朝代，周武王在黑峰山和金灵子、银灵子救过武王。在开封、燕京凯玄门、奉天朝阳街挂过牌奉，救过薛金贵，薛金山。洛阳长安城也挂过牌奉。，救过汉高祖，青龙剑下斩白蛇。曾拜在李老祖门下为师，手拿九节霸王鞭，背后背着3样法宝。1、一面白旗，能晃阴阳<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。2、带着五谷神爪，专爪阴阳三界。3、斩妖剑，一生杀了78位妖魔鬼怪。现在跟随他的老弟马已经是第16代了。</p>\n<p>　　胡天九峰、胡天八峰</p>\n<p>　　历史：胡天九峰：驻足铁刹山北峰。坐骑：旁坐天豹（头上长有2个犄角，身带梅花斑点，身穿金盔金甲，跟随胡天九峰61顿）。生日：正月十五。修行道行62顿。封神有名，封为64星君之一。后来又被封为九鼎铁刹山的其中一坐山峰的山神。身穿金盔金甲，赫赫有名的战将。真正兄弟9位（都是一奶同胞），他的父亲是胡大太爷（胡天祖）。从胡天一峰、胡天二峰、胡天三峰、胡天四峰、胡天五峰、胡天六峰、胡天七峰、胡天八峰、胡天九峰。这九人都是长眉大仙的高徒，左膀右臂，所谓九鼎铁刹山，共有九个山头，个派一位老胡仙掌管。这九人个占一个山头。都被封为山神。九峰他有5个儿子和3个女儿，和一个妻子胡翠凤（胡丹翠凤）。手拿着乾坤阴阳2界清龙风剑，（一雄一雌），还带18个星辰，能捆各种灵魂。保过很多朝代的帝王和军臣。</p>\n<p>　　胡天八峰：驻足铁刹山西北峰、南天门百仙洞。坐骑：倒骑斑点梅花鹿。生日：冬月十五。修行道行62顿。混沌初期，住在南战布洲，龙凤山，后来跟随长眉大仙来到铁刹山。封神有名，封为74星辰之一。后来又被封为九鼎铁刹山的其中一坐山峰的山神。身穿金盔金甲，披着黄袍，赫赫有名的战将。保过很多朝代的帝王和军臣。身上带有几样法宝：手拿黑龙清风双剑（一雄一雌），壁尘珠（万年老蛇精的左眼）、壁邪珠（万年老龟精的有眼），都在太上老君的八卦炉里炼过。还带着阴阳伞、聚魂灯、乾坤球等法宝。跟随老弟马已经18代了。</p>\n<p>　　胡（海）天峰</p>\n<p>　　历史：胡（海）天峰：原名胡海峰，现叫胡天峰。驻足昆仑山无云洞，坐骑：麒麟，生日：正月初五，道行61顿，封神无名，但是立下汗马功劳，救过几代的黎民百姓，在民间威震四海。一生躯鬼撵魔67位。在奉天朝阳街挂过牌奉。手拿青风宝剑。现在跟随他的老弟马已经是第3代了。</p>\n<p>　　胡天花</p>\n<p>　　历史：胡天花：驻足五莲花山莲花峰。坐骑：莲花，生日：四月十九，道行59顿。封神有名。当年居住孔雀山上，现居住五莲花山莲花峰。和胡云花（胡家太姑）是拜把姐妹。救过个个朝代的王侯。保过16国。救过楚文王、赵王。左手拿着火龙宝剑，右手拿着药王仙丹，背后背着3样法宝：1、流星锤2、二龙吐须针，1穿阳2穿阴，上面带着18种毒气。3、二蛇吐须阴阳眼（蟒蛇精的眼睛），专治看不见的鬼魂和神灵。现在跟随他的老弟马已经是第16代了。</p>\n<p>　　胡金花、胡银花</p>\n<p>　　历史：胡金花、胡银花：驻足五莲花山莲花峰。坐骑：莲花。生日：七月初八（双胞胎）。药王仙姑。道行55顿。曾拜在女娲娘娘、张道祖、黎山圣母、金山圣母门下，学过道行。3世因缘下凡庭，曾<a href=\"/remen/zhuanshi.html\" class=\"keylink\" target=\"_blank\">转世</a>穆桂英、和樊梨花。封神有名。姐妹2人各身背百宝囊，身穿银盔银甲，杀过孔雀妖精，救过文王的皇后，还拿着药王仙丹，专治红伤。保过几朝几代，当时跟随姜老太公60年南征北战。现在跟随他的老弟马已经是第17代了。</p>\n<p>　　黄天霸、黄天清、黄天龙</p>\n<p>　　历史：黄天霸驻足昆仑山无云洞，坐骑：红龙马，乃是黄三太爷。生日：五月初五，修行六十三顿。黄天清坐骑：白龙马，生日：七月十二，道行62顿。手拿火龙关丈。黄天龙坐骑：黑龙马，生日：六月十三，道行61顿。手拿黑蛇剑。</p>\n<p>　　混沌初开时，居住二龙山风云洞中，现居住昆仑山无云洞。黄家太爷共哥五位，开天辟地，兄弟五人，两位长兄为保玉皇大帝战死疆场。因保玉皇大帝有无限公德。被封黄家太爷。玉帝都让其三分。专门躯魔撵鬼，掌管黄家一堂人马。在高门户下，一是保家，二是出马，保过几个朝代，封神有名，封为64个星君之一。保过大汉朝文帝，救过大宋朝。在广凌城救下胡家一员将。他叫胡燕青，是大宋朝的。黄三太爷有2样法宝：1左手拿着八节鞭，上打神明、下打鬼魂、神灵。右手拿着阴阳二魂灯，1晃阳来2晃阴。现在跟随他的老弟马已经是第16代了。保高门户下5代了。</p>\n<p>　　柳大仙</p>\n<p>　　历史：柳大仙（柳银龙）驻足铁刹山，坐骑：倒骑青龙，封神前居住盘蛇山，后跟随姜老太公来到铁刹山。专门掌管柳家，是柳家太爷。生日：三月初九。道行56顿。兄弟9位，其中3位是小妹，封神有名，封64星君之一。保过几个朝代，身高8丈，身穿金盔金甲，为周朝立下汗马功劳。带着几样法宝：手拿2虎黑白清风剑，（一雄一雌），背后背着2龙吐须2盏灯。现在跟随老弟马16代了。</p>\n<p>　　常天龙、常金花、常银花</p>\n<p>　　历史：常天龙：驻足铁刹山北门 坐骑：金精兽王。生日：三月初六。身高九长，当年居住在乱石山，后来居住在铁刹山，由长眉大仙安排一生。封神有名，28宿之一。由姜老太公所封。开天辟地兄弟共6位，2个小妹，（在一堂做出马仙）和3个长兄。（战死疆场）。专门掌管阴阳两界常家。是常家太爷、太姑。曾经救过大宋朝杨门女将，大破天门阵和救下他们儿孙，救过唐朝李世民，一直打到悠洲。身带有3样法宝：1、左手拿着3股火龙钢枪2、右手拿着三座山：1泰山2华山3恒山。3、背着一面黑旗和百步金钢针，能聚阴阳两界和神仙，金钢针上面带有12种毒。</p>\n<p>　　常金花、常银花：驻足凤凰山五莲峰。 坐骑：莲花。常金花身高七长六尺。生日：五月初三，是药王仙姑。道行56顿。手拿锈龙大刀，曾经拜师孙老祖门下修行，学得一身武艺和医术。常银花生日：三月初一，道行55顿。曾救过周武王，为大周立下汗马功劳，杀过妖精。救过大辽国女皇帝女真人。现在跟随他的老弟马已经是第10代了。</p>\n<p>　　蟒天龙、蟒天霸峰</p>\n<p>　　历史：蟒天龙：驻足铁刹山南天门。坐骑：黑狮（一雄一雌）。生日：3月3日。道行59顿。身边带有2样法宝，手拿青龙燕月大刀，后面背着乾坤鞭。蟒天霸峰：驻足铁刹山南天门。坐骑：雄师。生日：2月2日。道行58顿。蟒天霸峰原名蟒天玄。身边带有3样法宝，1左手拿方天化极，上打神仙，下打鬼魂和神灵。2右手拿阴阳八卦乾坤圈。3后面背着聚魂瓶。</p>\n<p>　　混沌初开时，当年住在盘蛇山（在贺洲），再后来盘居铁刹山南天门，兄弟哥2位，是蟒家太爷。由姜老太公所封位上方神。身穿金盔金甲，封神都有名。被封为74个星辰之一。他们保过很多朝代，封神前曾救过周文王、周武王。跟随姜老太公讨伐北征。救过大元朝成吉思汗，成死出关。现在跟随他的老弟马已经是第9代了。</p>\n<p>　　狼天龙、狼天熊</p>\n<p>　　历史：狼天龙驻足铁刹山，坐骑：青龙。生日：九月初一。道行56顿。是狼家太爷。大嘴能同时吃下88只狼和99只狗。混沌初开时，居住五虎山，后来居住铁刹山，兄弟哥6位。4位长兄战死疆场，剩下了老五和老六。狼家都是由这两位掌管。封神却无名，因为狼家不能封为上方神。所以被玉皇大帝封为中方神。但是封神时也出过力，立下汗马功劳。在五虎山下抓过九尾狐苏妲己。从天山撵到地下。专吃、专杀、专砍。把好各个山峰。身带有3样法宝：1左手拿着乾坤阴阳剑上斩上方神明、下斩鬼和灵魂。右手拿着阴阳银锤，上打阳来下打阴。3背着阴阳八卦乾坤九连锁。狼天熊驻足铁刹山，坐骑：白虎。生日：八月十五。道行55顿。身带有2样法宝：左手拿着五谷神爪，右手拿着碧水珠王。背后背着万年蜘蛛，专门来挂各种神灵和鬼怪。所谓东为青龙、西为白虎，把手铁刹山东门和西门。现在跟随他的老弟马已经是第7代了。</p>\n<p>　　黑老太：又名黑妈妈 道教中的地仙，东北地方神。在东北三省，一般的道观和有些寺庙，都会有黑老太太的塑像，一般认为黑老太太的总灵在辽宁省本溪市九顶铁刹山。相传黑老太太是在九顶铁刹山的悬石洞修练成仙。黑老太太是东北大护法，黑老太太的圣诞：农历六月二十四日。</p>\n</div>"
    }
]