[
    {
        "title": "【不二法门】是什么意思？怎么理解不二法门？",
        "date": "2016-02-18",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x4E0D;&#x4E8C;&#x6CD5;&#x95E8;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x4E0D;&#x4E8C;&#x6CD5;&#x95E8;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0813/20180813031417903.jpg\" title=\"&#x3010;&#x4E0D;&#x4E8C;&#x6CD5;&#x95E8;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x4E0D;&#x4E8C;&#x6CD5;&#x95E8;&#xFF1F;\" /></p>\n<h2><a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>是什么意思？</h2>\n<p>　　「不二」指一实之理，如如平等，没有彼此之别；「法门」指<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>入道的门径。「不二法门」原指不靠言语传授，只靠内心思考求得大彻大悟的<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>门径。后指最好的或独一无二的方法。出自《<a href=\"/fojing/weimojiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">维摩诘经</a>·入不二法门品》：“如我意者，于一切法无言无说，无示无识，离诸问答，是为入不二法门。”</p>\n<h2>怎么理解不二法门？（众法师开示）</h2>\n<p><span style=\"color:#ff0000;\"><strong>　　怎么理解不二法门？（<a href=\"/fjrw/hcrw/xyds/\" class=\"keylink\" target=\"_blank\">星云大师</a>）</strong></span></p>\n<p>　　据《维摩经》记载，有一天，维摩<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>示疾，文殊菩萨率领诸大菩萨前往探病，双方就在维摩丈室裡讨论起「不二法门」之意来。</p>\n<p>　　首先，在场的三十一位菩萨，各就所见，提出发言。最后文殊菩萨说：「照我的见解，于一切法无言无说，无示无识，离诸问答，这才是入不二法门。」</p>\n<p>　　文殊菩萨说后，反问维摩诘说：「现在换我来请问你，菩萨是怎样进入不二法门的。」此时维摩诘默然无对，众皆愕然，唯有文殊菩萨<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>超人，懂得此中奥祕，乃向大家说：「善哉！善哉！乃至无有语言文字，是真入不二法门。」</p>\n<p>　　像这么奔放美丽的<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>哲学，真是令人不禁拍案叫绝！</p>\n<p>　　在<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>上，「善和恶」，善的不是恶，恶的也不是善，我们要分清楚；「是和非」，是不是非，非也不是是，我们要分清楚；好不是坏，坏不是好，我们要分清楚。等于大不是小，小不是大，因为这是世间法，必定要有一有二，要承认这个事实。</p>\n<p>　　所谓「不二」，这是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>上的出世法，佛法讲「<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>即<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>」，理上是不二的。例如，原本酸涩的凤梨、柿子，经过和风的吹拂，阳光的照耀，就能成熟而变成滋味甜美的水果，可见酸即是甜，甜离不开酸。所以「烦恼即菩提」，这是出世法。</p>\n<p>　　出世法看世间，是从理上来解悟，但是在还没有<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>的时候，不可以在理上废事。我们可以用理来解事，可以因事而明理，能够「理事<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>」，那才是真正的「不二」。吾人若能将「不二法门」的哲学应用在<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>上，自能「人我一如」、「自他不二」也！</p>\n<p><strong><span style=\"color:#ff0000;\">　　怎么理解不二法门？（<a href=\"/fjrw/hcrw/syfs/\" class=\"keylink\" target=\"_blank\">圣严法师</a>）</span></strong></p>\n<p>　　佛为适应<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的根性，说有无量法门，通称八万四千法门对治八万四千尘劳的烦恼，若就实相而言，法法平等，无差别、无彼此、无高下，所以是不二法门。</p>\n<p>　　依《维摩经》的《入不二法门品》所载，因维摩诘居士问诸菩萨：「云何菩萨入不二法门？」于是引出一共三十三位菩萨各自宣说所见的不二法门是什么。那就是：生与灭不二，我与我所不二，受与不受不二，垢与净不二，是动与是念不二，一相与<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>不二，菩萨心与声闻心不二，善与不善不二，罪与福不二，有漏与无漏不二，有为与无为不二，世间与出世间不二，<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>与<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>不二，尽与不尽不二，我与<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>不二，明与无明不二，色与色空不二，四种异与空种异不二，眼与色不二及至耳与声、鼻与香、舌与味、身与触、意与法皆不二，<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>与<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>一切智不二，是空、是无相、是无作为不二，佛、法、众为不二，身与身灭不二，身口意善为不二，福行、罪行、不动行为不二，从我起二为不二，有所得相为不二，闇与明不二，乐涅槃与不乐世间不二，正道与邪道不二，实与不实不二，于一切法无言、无说、无示、无识、离诸问答为不二，乃至无有文字、语言是真入不二法门。</p>\n<p>　　其中第三十二位是文殊菩萨，最后的第三十三位是维摩诘居士本人默然无言，文殊为他做结论：「乃至无有文字、语言，是真入不二法门。」这也可说是<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>「不立文字，直指人心」宗旨所依的一部经典。禅宗主张<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>顿悟的方法与态度是「离心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>」，也能在〈入不二法门品〉中得到依据。《坛经》所引《维摩经》的「直心是道场，直心是<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>」以及「实时豁然，还得本心」的「直心」与「本心」，都是指的「离心意识」的不二法门。</p>\n<p><span style=\"color:#ff0000;\"><strong>　　怎么理解不二法门？（净慧长老）</strong></span></p>\n<p>　　就像《维摩经》所显示的那样：维摩居士生病了，佛派<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>去看望。大家都知道维摩居士辩才无碍，声闻弟子、诸位菩萨，都不是维摩居士的对手，都不敢去，只有文殊菩萨答应下来，率领众人前去探望。《维摩经》上有一品，叫做《入不二法门品》，前去探望的众人，都从理论上讲了什么叫入不二法门，最后轮到维摩居士，叫他说说什么是不二法门，维摩居士却默然无言。最后，文殊菩萨赞叹维摩居士说：善哉，善哉！乃至无有文字语言，是真入不二法门。</p>\n<p>　　不二法门者，无说无示，不是言语可以表达。有言语可以表达的都不是不二法门。因为有言语就有分别，有言语就是二，就不是不二。不二是绝对的，不是相对的。</p>\n<p>　　禅堂就是修不二法门的地方。禅堂本身就是一个不二法门。有许多禅堂的门口就挂着这样一块牌匾：不二法门。禅是唯一的，禅是完整的，禅是一个整体，所以是不二法门。</p>\n<p><span style=\"color:#ff0000;\"><strong>　　怎么理解不二法门？（<a href=\"/fjrw/hcrw/xhsr/\" class=\"keylink\" target=\"_blank\">宣化上人</a>）</strong></span></p>\n<p>　　《维摩诘经》中有这样的记载，维摩诘居士问众菩萨：「诸仁者！云何菩萨入不二法门？各随所乐说之。」有三十二位大菩萨，互相研究怎么样是「不二法门」？你说你的道理，他说他的道理；无论谁说谁的道理，都是讲这个不二法门。这个不二法门，本来是没有话可讲、没有话可说的，为什么呢？一说，就不是不二法门了。想用言语说出来「不能言的道理」，又用言语把这个「能说出来的道理」也要不说它。</p>\n<p>　　那么这三十二个菩萨，各说各的「不二法门」的道理，研究来研究去，也没有结论。于是乎，就请问文殊师利菩萨：「什么叫入不二法门？」前对联是：一切众生入不二法门，同证三觉地；百界诸佛上座千华台，<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>万德天），怎么叫「不二法门」呢？就是没有话讲了。所以我们这佛堂里边很少人讲话，没人说话这就是不二法门了。</p>\n<p>　　文殊师利菩萨就说了：「如我意者，于一切法，无言无说，无示无识，离诸问答，是为入不二法门。」他说，照着我的意思来讲，对于所有的一切法，「无言无说，无示无识」，没有什么可以讲的，也没有什么可以表示的，也没有什么可以认识的；「离诸问答」，既没有问，也没有答，这就是入不二法门。并不是说或者写出一个字来，你认识这个字；或者画出个图来，你认识这个图。不是的！所谓「离言说相，离名字相」，这就是不二法门。文殊师利菩萨就这么说，没有问也没有答，这就叫入不二法门。</p>\n<p>　　文殊师利菩萨说完之后，他自己也不知道对不对——不是他自己不知道对不对，是他觉得一般人还没有明白。因为他说了这个话，一般人就怀疑「不二法门」怎么没有话讲呢？当时有几个罗汉或者菩萨这小境界的，就不知道「不二法门」怎么不能讲、也不能说、也没有表示，怎么就叫「不二法门」了呢？</p>\n<p>　　于是乎，文殊师利菩萨就转问维摩诘居士，说：「我等各自说已，仁者当说何等是入不二法门？」就是说，你说怎么样？我说是这样子讲，你看我讲的对不对？我们每一个人都说了这不二法门的道理，唯独「仁者」你啊——就是维摩居士，你怎么样讲这个「入不二法门」呢？</p>\n<p>　　「时维摩居士默然无言」，这时，维摩居士坐在那个地方不讲话；「默然」也就是不讲话的，「默」也就是不开口。总而言之，这个不二法门，我现在传给你们，就是：不开口！谁若问你「不二法门」，你就不要讲话，那就是不二法门。你若不讲话，他就不知道你是怎么回事。人家问你一个问题，你像放机关枪似的，嘟嘟嘟嘟……讲了一大堆，人家就知道你一点真东西都没有。</p>\n<p>　　好像那个果某，人家问他一个什么问题，他就比人家问的那个问题讲了多几百倍。人家问一个问题，他就讲得七扯八拉的。这个问答，答非所问，问非所答，都没有意思了。人家问你什么，你就答什么；再不然，你不要答，就是默然。</p>\n<p>　　文殊师利菩萨考验维摩诘居士，说：「你说这个『不二法门』是怎么样讲呢？」维摩诘居士坐在那个地方不讲话。所以文殊师利菩萨就赞叹说：「善哉！善哉！乃至无有文字语言，是真入不二法门。」</p>\n<p>　　所以我告诉你们，「不二法门休开口」，绝对不可以开口的！「第一义谛莫妄谈」，妄谈，就是人家问你一句，你讲十句，这讲就没有意思了。</p>\n<p>　　所谓：</p>\n<p>　　亡言者可与道合，</p>\n<p>　　虚怀者可与理通，</p>\n<p>　　冥心者可与真一，</p>\n<p>　　遣智者可与圣同。</p>\n<p>　　「亡言者可与道合」：你若能亡言，就可以和「道」合。亡言，就是不知道怎么样讲话，不会说话了。你本来会说话，但不知道怎么样说这个话；不是说我不知道怎么样说、不知道怎么样开始。若是话还可以说得很多，那就不是亡言。亡言，就可以合道，与道相合了。</p>\n<p>　　「虚怀者可与理通」：你要能以「虚怀」，就是虚心。怎么叫虚心呢？就是没有贡高我慢，没有<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>和法执。所谓「有若无，实若虚」，自己有<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>，也就好像没有道德似的；自己有智慧，又好像没有智慧似的。不要以为你自己有一点点的道德，就觉得：「这个法界都没有地方可以放我了，我怎么办呢？到什么地方去呢？」你把法界都充满了，法界都放不下你了，就自满了；自己满了，那就不是虚怀了。真正的虚怀，就是自己不自满、不贡高我慢、不妒忌、不障碍，这都叫虚怀。本来这个人不如我，但是我也觉得他比我好，觉得他什么都比我自己好，这是虚怀。</p>\n<p>　　「有若无」，有，就像没有似的；「实若虚」，你有真实的智慧，也不要自满，要谦虚。你若能以虚怀、不自满，这样才能和真理相通。</p>\n<p>　　「冥心者可与真一」：你若再能做到不生心，就和「真」合成一个了。</p>\n<p>　　「遣智者可与圣同」：你再能把你这个智慧不用了，把智慧不要了，这就和佛是一样。</p>\n<p>　　我们为什么没有<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>呢？就因为我们觉得：「噢，看我多聪明！我这个智慧比旁人高。」有这一种执着，所以就不成佛了，和这个<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>就不一样了。圣人看一切人都是圣人，所以他自己就是圣人；佛看一切众生都是佛，所以他自己就是佛。</p>\n<p>　　维摩居士不说话了，正显明出来这「不二法门」，就是前面所说这个道理的意思。</p>\n<p><span style=\"color:#ff0000;\"><strong>　　怎么理解不二法门？（<a href=\"/fjrw/hcrw/hlfs/\" class=\"keylink\" target=\"_blank\">慧律法师</a>）</strong></span></p>\n<p>　　所谓不二法门，是指在现实生活中获得超越和<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，因此不能离开现实的烦恼而求解脱。因为离开烦恼，也是找不到解脱境界的。</p>\n<p>　　好比说有的人习惯每天吃山珍海昧、大鱼大肉，那天餐桌摆的是青菜粗饭时，他可能感到气愤、很丢脸、没胃口。但是，禅的意境，是让我们把物质降到最低点，才比较容易体悟到真理平凡、平淡的一面；唯有当精神生活领域升华到最高点时，我们才是世界上最快乐的人。所以在禅的境界中，是绝不会因为吃得少，或缺乏大餐而不高兴，因为在圣者眼中，这不过是一种幻化的东西而已，根本不值得<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>。</p>\n<p>　　释迦牟尼佛在世时，有个女孩受外道指使，乔装成孕妇来毁谤释尊，她见到释尊，劈头就骂：‘乔达摩，你真没良心，我怀了你的孩子，你却不闻不问。’释尊听了并不为所动，且笑脸依旧。面对这种情况，若换成是现代人还得了，你敢毁我清誉，那就等著法庭上见吧！‘以诤灭诤只有更增加困扰’，争论、气愤、对簿公堂并非真正解决之道；生活在现实生活中，超越你所面临的现实问题，才是不二法门的<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a><a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>，换句话说：眼见、耳闻、口说，都不会在你的内心里造成压力。‘生活就是佛法’，佛法生活化，生活佛法化；现实不离超越，超越不离现实，这才是修行最高的境界。</p>\n<p><span style=\"color:#ff0000;\"><strong>　　怎么理解不二法门？（妙华法师）</strong></span></p>\n<p>　　如果大家对佛法的不二法门要想了解，就必须要看一本经，这个经叫《维摩诘所说经》，《维摩诘所说经》当中从开始维摩诘示疾，装病，因为法不孤起，他得了病佛必然要派他的弟子前去问候，先派十大弟子去，十大弟子都说我不敢去问疾，因为往昔我修行的时候见到维摩诘菩萨他把我训斥了一顿，由此我得了法，并且提高了修行的境界。表面上是维摩诘在对十大弟子进行修行和人生的点化，而本质是演这场戏给我们看的，如果是聪明人你就要想到我的修行到了什么境界，我是不是粘住在空性上了，我是不是对佛法的认知上还有不圆满的地方，他的机关是非常巧妙的。紧接着是四大菩萨前去问疾，四大菩萨前去问疾，最后一位去的是文殊菩萨，文殊菩萨智慧第一。</p>\n<p>　　然后文殊菩萨就和维摩诘居士（维摩诘居士是金粟如来<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>），他们两个在方丈室里开始论法。整个庄严城倾城出动，因为维摩诘是大福德<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>的大居士，而文殊菩萨是智慧第一，他们两个见面必定有一场好戏，辩论非常激烈，那一品叫入不二法门品。辩论到最后文殊菩萨这样的能言善辩，这样智慧辩才无碍，他反倒一默如雷不说了，因此维摩诘居士赞叹说文殊菩萨是真入不二法门，这就是一默如雷的来历。在这里提出了不二法门，我们做一个简单的分析，我们一般的凡夫，我们烦恼的总开关就是二，我是我，你是你，我是主观你是客观，我是信佛的你是不信佛的。因为有二我们的心里头或者说我们的意识里头永远是二元对立的，因为你是二元对立的，你当下就不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。更何况你拿着自己的道德标准人生标准去衡量你周边的人，起心动念就是烦恼，这都是二分法在精神世界给我们带来的迷乱。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>是不二法门，是法平等，无有高下，佛法是真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>，因此佛法是不二。</p>\n<p>　　那我现在讲经有人问：你现在讲是二还是不二，我讲的是二因为法不孤起，你要买药我给你药，但是不管是听经的人还是讲经的人，我们的内心是真如心，是清静的，是如如不动的，不要把自己分裂成二，这是心上的功夫来说的。如果你在世间做人过于自私，或者以自己为标准，久而久之，轻则导致亚<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，重者导致精神性的疾病，很多人得了亚健康乃至得了精神性疾病，自己不知道自己哪里出了问题，通俗的讲是你做人的观念出了问题，是你的心境出了问题，你的心境为什么出问题呢？你老把自己和别人对立起来，久而久之当然会出问题，我们在社会教育学层面告诉大家，要包容别人理解别人，包容和理解是让你尽量的往不二法门靠近。如果一下叫你达到不二法门、悟到真如<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，悟不到。因此在社会中劝别人要包容别人，这是量的变化并没有达到质的变化，如果一个人真的开悟了就入不二法门了。</p>\n<p>　　由此大家可以品位到一个风味，如果按照教育或者按照北宗的渐悟法门，因戒生定。因定发慧。一定要通过<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>和解脱，制心一处，去除心里的粘附，六祖慧能说不论禅定解脱唯论见性，佛法是不二法门单刀直入，不要停留在次第上不要粘连在语言文字上，当下承当，势如破竹，一闻千悟如醍醐灌顶。达到这样的境界是六祖慧能最希望看到的，有没有这种可能呢，这种可能是完全可以发生的。如果用西方的观念来讲就是，任何事物都可以从量的积累达到质的飞跃，如果你平时参佛悟佛修佛，总有一天你的心可以和佛变成一个，不会成为两个，可以做到的，不是不能够做到。</p>\n</div>"
    }
]