[
    {
        "title": "【丛林】是什么意思？佛教丛林指的是什么？",
        "date": "2016-04-21",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x4E1B;&#x6797;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x4E1B;&#x6797;&#x6307;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0823/20180823040049576.jpg\" title=\"&#x3010;&#x4E1B;&#x6797;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x4E1B;&#x6797;&#x6307;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" /></p>\n<h2><a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a><a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>是什么意思？</h2>\n<p>　　丛林，梵语“贫婆那”，指大寺院，僧人聚居之处，许多<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>住在一起<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的地方。自古以来，丛林即是十方人士聚集之所，僧众住于深山大泽的丛林之中，不易受到物质世界的诱惑。《大智度论》云：“僧伽，秦言‘众’。多<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>一处和合，是名‘僧伽’。譬如大树丛聚，是名为‘林’，……僧聚处得名‘丛林’。”众僧和合共住一处，犹如树木之丛集为林，所以将寺院叫作“丛林”。“丛林”也是借喻草木生长有序，用来象征僧众有完整的法度和严格的规矩。</p>\n<h2><a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>丛林</h2>\n<p>　　丛林通常指禅宗寺院而言，故亦称禅林，但后世教、律等各宗寺院也有仿照禅林制度而称丛林的。中国禅宗从曹溪慧能后，四传至于怀海，百余年间禅徒只以道相授受，多岩居穴处，或寄住<a href=\"/remen/lvzong.html\" class=\"keylink\" target=\"_blank\">律宗</a>寺院。到了唐贞元、元和间（785—806），禅宗日盛，宗匠常聚徒多人于一处，修禅办道。江西奉新百丈山怀海以禅众聚处，尊卑不分，于<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>住持，未合规制，于是折衷大小乘经律，创意别立禅居，此即丛林之始。丛林的意义，旧说是取喻草木之不乱生乱长，表示其中有规矩法度云（《禅林宝训音义》）。</p>\n<h2>丛林的规模</h2>\n<p>　　丛林规模开始不大，到唐末五代之间，南方有发展。如洪諲住浙江径山，道膺住江西云居山，僧众多至千数；义存住福州雪峰，冬夏禅徒更不减一千五百人（《宋高僧传》卷十二）。入宋，丛林建置益臻完备，禅众亦以集中居住为常，凡名德住持的丛林，都有千人以上。如宋太祖建隆二年（961），延寿自杭州灵隐移住同地永明寺（今净慈寺），学侣多至二千（《景德传灯录》卷二十六）。</p>\n<h2>丛林的兴盛</h2>\n<p>　　北方丛林，亦始盛于宋代。仁宗皇祐元年（1049），内侍李允宁施住宅创兴禅席，仁宗给与寺额为十方净因禅院。庐山圆通寺怀琏应命为住持，禅道大弘于汴京。神宗元丰五年（1082），又命京师（今开封）大相国寺，创立慧林、智海二大禅院，后都成为京师有名的禅林。至徽宗崇宁二年（1103），宗赜集《禅苑清规》时，丛林制度已灿然大备。</p>\n<p>　　宋室南渡以后，禅宗名僧辈出，所居丛林，皆极一时之盛。如克勤所住江西云居山、宗杲所住浙江径山、正觉所住泗州普照寺及明州天童寺，清了所住真州长芦崇福寺等，其住众常至千人以上。史弥远因而请定江南禅寺为五山十刹（余杭径山、杭州灵隐、净慈、宁波天童、育王等寺为禅院五山。杭州中<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>、湖州道场、温州江心、金华双林、宁波雪窦、台州国清、福州雪峰、建康灵谷、苏州万寿、虎丘等寺为禅院十刹。见《七修类稿》），俾拾级而登，于是丛林制度遂遍行于江南，迄后世不衰。</p>\n<h2>丛林制度</h2>\n<p>　　丛林制度，最初只有方丈、法堂、僧堂和寮舍。以住持为一众之主，非高其位则其道不严，故尊为长老，居于方丈。不立佛殿，唯建法堂（后世乃立佛殿）。所集禅众无论多少，尽入僧堂，依<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>先后腊次安排。行普请法（集体劳动），无论上下，均令参加生产劳动以自给。又置十务（十职），谓之寮舍；每舍任用首领一人，管理多人事务，令各司其局（《景德传灯录》卷六《禅门规式》）。</p>\n<p>　　在这以前寺院的首脑为三纲：即上座、寺主、维那（或称都维那），都是领导大众维持纲纪的职僧。上座以年德俱高，都是朝廷任命。如姚秦、元魏，常有命令补上座。唐道宣亦曾被命为西明寺上座，其位居寺主、维那之上。寺主知一寺之事。如后周陟岵寺、隋大兴善寺等，皆有寺主。维那意为次第，谓知僧事之次第，或称为悦众；但后世常以悦众为维那之副，其职有数人，以大、二、三、四等别之（《百丈清规证义记》卷六）。</p>\n<p>　　至于丛林古规的职事，则有首座、殿主、藏主、庄主、典座、维那、监院、侍者等名目。如黄檗希运在池州南泉寺为首座、遵布衲为湖南药山殿主、雪窦重显为南岳福严寺藏主、南泉普愿于庄上为庄主、沩山灵祐在江西百丈山为典座、克宾于河北魏府（今大名县）兴化寺为维那、玄则在<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>会下为监院（见元道泰《禅林类聚》第九）、兴化存奖为临济义玄侍者等。</p>\n<p>　　后世丛林组织日渐庞大，各寺家风不同，为住持者多因时制宜、自立职事，名目层出不穷。宋宗赜《禅苑清规》的序文说：“<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛社，建立法幢，佛事门中，阙一不可。岂立法之贵繁，盖随机而设教”。在《禅苑清规》所载丛林职事名目即有二十三种。宗赜还撰了一篇《龟镜文》（弍咸《禅林备用清规》卷七称之为《百丈龟镜文》），概括地说明设立各种职事的必要。文云：</p>\n<p>　　“丛林之设要之本为众僧，是以开示众僧故有长老，表仪众僧故有首座，荷负众僧故有监院，调和众僧故有维那，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>众僧故有典座，为众僧作务故有直岁，为众僧出纳故有库头，为众僧主典翰墨故有书状，为众僧守护圣教故有藏主，为众僧迎待故有知客，为众僧召请故有侍者，为众僧看守衣钵故有寮主，为众僧供侍汤药故有堂主，为众僧洗濯故有浴主，为众僧御寒故有炭头，为众僧乞丐故有街坊化主，为众僧执劳故有园头、磨头、庄主，为众僧涤除故有净头，为众僧给侍故有净人”（《禅苑清规》卷八）。</p>\n<p>　　以上制度，自宋以来通行甚久，少有更改。至于今日可行的，则根据元代《敕修百丈清规》更有增益，且分成东西两序。东序序职（资格）有都监、监院等二十一员，列职（实职）有化主、库头等二十六员；西序序职有首座、西堂等十二员，列职有殿主、寮元等二十一员。细分职别可达八十种，可谓繁杂（见清仪润《百丈清规证义记》）。</p>\n<h2>丛林职务</h2>\n<p>　　丛林职事人员之多寡，各依其规模建制大小而定。方丈为禅林正寝、住持所居之处，故称寺主为方丈，他为全寺诸堂之头，故又称堂头和尚。至西序的重要职员，则为首座（即古之上座）、西堂、后堂、堂主、书记、知藏、藏主、知客、寮元（云水堂首领）等。东序为监院（即古之寺主，俗称当家）、副寺（即知库）、维那、悦众、侍者、庄主等，是一般丛林所常设的。此外，列职各专一务者，还有饭头、菜头、火头、水头、碗头（通称行堂）、钟头、鼓头、门头、园头、浴头（亦称知浴）、圊头（即净头）、塔头（亦称塔主）、树头（巡视山林、栽补树木）、柴头、磨头、茶头、炭头、炉头、锅头、桶头、灯头、巡山、夜巡、香灯、司水（禅堂专任）、照客、听用等。以上各种职事名称，以等级分，可统称为知事人员（一级）、主事人员（二级）和头事人员（三级）。规模较小的丛林，即以主事兼知事。规模较大的丛林，则有很完备的组织。方丈之下有库房、客堂、维那寮、衣钵寮四个机构（通称四堂口），是为丛林的基本组织，重要寺务由住持会同首座等班首与四堂口首领共议进行。此外有首座寮以处上座名宿，有侍者寮以处初学新参，有<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>寮以处杂务行者和童行，有众寮（云水堂）以临时接待过往禅衲。又有蒙堂以处知事职僧以上退职人员，有单寮以处副寺以下退职人员，有延寿堂以处老病僧人，有庄田以供禅众从事生产。各堂又各立规约以资遵守（参看本书《清规》条目）。</p>\n<h2>今日丛林</h2>\n<p>　　现今丛林，以其住持传承的方式不同，又可分为子孙的与十方的两类。本来从宋代起，丛林即有甲乙徒弟院、十方住持院、敕差住持院三种之分。甲乙徒弟院，是由自己所度的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>轮流住持甲乙而传者，略称为甲乙院。十方住持院系公请诸方名宿住持，略称为十方院。敕差住持院，是由朝廷给牒任命住持者，略称为给碟院。甲乙院住持是一种师资相承的世袭制，故又称为剃度丛林或子孙丛林。十方住持院由官吏监督的选举，故称为十方丛林。后世即大体沿用其制度，无大变动（现无其第三种）。</p>\n<p>　　另外，十方丛林中依住持继承制度的不同，还有选贤丛林与传法丛林之分。有如镇江金山寺名刹的住持，即是依法系相传的，称为传法丛林；宁波天童寺自清末寄禅（敬安）重兴后，改为十方选贤制度，称为选贤丛林。1924年厦门南普陀寺改子孙丛林为十方选贤丛林，即依天童寺选贤方法，订立“十方<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>规约”二十条。并规定选举法、住持任期及进院退院等手续（《厦门南普陀寺志》）。这种选贤制度是丛林住持史上的一个进步。</p>\n<p>　　关于丛林制度详见于《百丈清规》和它的注书《百丈清规证义记》等。至于丛林中行事和古德风规，则有道融《丛林盛事》、慧彬《丛林公论》、慧洪《林间录》、净善《禅林宝训》、无愠《山庵杂录》等可资参考。</p>\n</div>"
    }
]