[
    {
        "title": "【道衍】道衍和尚是谁？",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x9053;&#x884D;&#x3011;&#x9053;&#x884D;&#x548C;&#x5C1A;&#x662F;&#x8C01;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2017/0113/20170113043507330.jpeg\" title=\"&#x3010;&#x9053;&#x884D;&#x3011;&#x9053;&#x884D;&#x548C;&#x5C1A;&#x662F;&#x8C01;&#xFF1F;\" /></p>\n<h2>姚广孝（<a href=\"/remen/daoyan.html\" class=\"keylink\" target=\"_blank\">道衍</a>）</h2>\n<p>　　姚广孝（1335年－1418年），幼名天僖，法名道衍，字斯道，又字独闇，号独庵老人、逃虚子。长洲（今江苏苏州）人。明朝政治家、佛学家、靖难之役的主要策划者。</p>\n<p>　　姚广孝年轻时在苏州妙智庵<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>为僧，精通佛、道、儒、兵诸家之学，与高启、杨基等人结为好友， 后被明太祖挑选，随侍燕王朱棣，主持庆寿寺，成为朱棣的主要谋士。朱棣靖难时，姚广孝留守北平，建议朱棣轻骑挺进，径取南京，使得朱棣顺利夺取南京，登基称帝。</p>\n<p>　　成祖继位后，姚广孝担任僧录司左善世，又加太子少师，被称为“黑衣宰相”。永乐十六年（1418年），病逝庆寿寺，追赠推诚辅国协谋宣力文臣、特进荣禄大夫、上柱国、荣国公，谥号恭靖。</p>\n<h2>道衍生平</h2>\n<h3>　　早期事迹</h3>\n<p>　　姚广孝是长洲人，家族世代行医。1348年（至正八年），年仅十四岁的姚广孝剃度出家，法名道衍。后来，姚广孝拜道士席应真为师，学习阴阳术数。</p>\n<p>　　1375年（洪武八年），姚广孝以通儒僧人的身份被明太祖召入京师，但却没被授为僧官，只获赐僧衣。[4]</p>\n<h3>　　随侍燕王</h3>\n<p>　　1382年（洪武十五年），马皇后病逝，明太祖挑选高僧随侍诸王，诵经祈福。当时，道衍得到僧录司左善世宗泐的举荐，并与燕王朱棣相谈甚欢，便要求随朱棣前往北平。姚广孝到北平后，任庆寿寺住持，时常出入燕王府，与朱棣密谈。</p>\n<p>　　1398年（洪武三十一年），明太祖驾崩，建文帝继位，并实行削藩之策。周王朱橚、湘王朱柏、代王朱桂、齐王朱榑、岷王朱楩相继获罪，被废除藩国。姚广孝密劝朱棣起兵，朱棣道：“百姓都支持朝廷，怎么办？”姚广孝答道：“臣只知道天道，不管民心。”</p>\n<p>　　后来，姚广孝向朱棣推荐相士袁珙、卜者金忠，使朱棣逐渐下定决心。朱棣暗中拉拢军官，勾结部队，并招募勇士。而姚广孝则在燕王府后苑训练兵马，还修建厚墙环绕的地穴，打造军器，用饲养的鹅鸭来掩盖声音。</p>\n<h3>　　靖难建功</h3>\n<p>　　1399年（建文元年）六月，燕王府护卫百户倪谅告发朱棣谋反，朝廷下令逮捕燕王府官属。都指挥张信暗中向朱棣报信，朱棣便决定立即起兵，并以诛杀齐泰、黄子澄为名，号称奉天靖难。姚广孝则辅佐世子朱高炽留守北平。[8]</p>\n<p>　　同年十月，朱棣袭取大宁（今内蒙古宁城），南军主帅李景隆趁机围攻北平。姚广孝指挥将士守卫城池，击退南军的进攻，又在夜间将士兵用绳子吊出城外，与朱棣的援军内外夹攻，大破南军。李景隆、平安相继败退。[9]</p>\n<p>　　1400年（建文二年），朱棣围困济南三个月，难以破城。姚广孝让人传信给朱棣，道：“将士已经疲惫了，还是班师吧。”朱棣于是退回北平。后来，燕军又在东昌（今山东聊城）战败，大将张玉战死，朱棣再次退军。[10]</p>\n<p>　　当时，朱棣本打算稍作休整，但在姚广孝的极力劝谏下，继续进军，击败盛庸，攻破西水寨。后来，姚广孝对朱棣道：“不要去攻打城池，应迅速直取京师。京师兵力单薄，一定能攻克。”朱棣采纳他的建议，在淝水、灵璧连败南军，并渡江进入京师。[11]</p>\n<h3>　　辅佐朝政</h3>\n<p>　　1402年（建文四年），朱棣称帝，是为明成祖。姚广孝被任命为僧录司左善世。1404年（永乐二年），姚广孝拜资善大夫、太子少师，并复姓为姚，赐名广孝。明成祖每次与姚广孝交谈，都称他为少师，而不直呼其名。[12]</p>\n<p>　　后来，明成祖命姚广孝蓄发<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>，被姚广孝拒绝。明成祖又赐他府邸、宫女，姚广孝仍不接受，只是居住在寺庙中，上朝时便穿上朝服，退朝后仍换回僧衣。他到苏湖赈灾时，前往长洲，将获赐的黄金全部分发给宗族乡人。[13]</p>\n<p>　　此后，明成祖往来于南京、北京之间，并几次征伐蒙古，姚广孝都留在南京，辅佐太子朱高炽监国。1407年（永乐五年），姚广孝又奉命教导皇长孙朱瞻基。[14]</p>\n<h3>　　病逝</h3>\n<p>　　1418年（永乐十六年），姚广孝病重，不能上朝，居住在庆寿寺中。成祖数次前去探视，并赐金睡壶。不久，姚广孝病逝，终年八十四岁。成祖废朝二日，以僧人的礼制安葬姚广孝，追赠他为推诚辅国协谋宣力文臣、特进荣禄大夫、上柱国、荣国公，赐谥恭靖，还亲自为他撰写神道碑铭。[15]</p>\n<p>　　1425年（洪熙元年），明仁宗追赠姚广孝为少师，将他的灵位放在明成祖的宗庙中。1530年（嘉靖九年），明世宗又将姚广孝的灵位从太庙移到大兴隆寺，命太常寺春秋两次祭祀。[16]</p>\n<h2>道衍的典故</h2>\n<h3>　　形如病虎</h3>\n<p>　　姚广孝早年曾游览嵩山寺，相士袁珙对他道：“你是个奇特的僧人！眼眶是三角形，如同病虎一般，天性必然嗜好杀戮，是刘秉忠一样的人！”姚广孝大喜。[17]</p>\n<h3>　　赋诗怀古</h3>\n<p>　　姚广孝曾在丹徒北固山，赋诗缅怀古贤，以抒志向。诗道：“谯橹年来战血干，烟花犹自半凋残。五州山近朝云乱，万岁楼空夜月寒。江水无潮通铁瓮，野田有路到金坛。萧梁帝业今何在？北固青青客倦看。”同行的僧人宗泐听后，道：“这岂是佛家<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>说的话！”姚广孝笑而不语。[18-19]</p>\n<h3>　　妙解落瓦</h3>\n<p>　　成祖起兵之时，突有暴风雨来临，将王府的檐瓦吹落在地。风吹落瓦在当时被视为不祥之兆，因此成祖不禁变色。姚广<a href=\"/remen/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>：“这是吉兆啊！自古飞龙在天，必有风雨相从。王府的青瓦堕地，这预示着殿下要用上皇帝的黄瓦了。”[20]</p>\n<h3>　　和尚误矣</h3>\n<p>　　姚广孝到苏湖赈灾时，曾到长洲见姐姐，姐姐却闭门不见，便又拜访故友王宾。王宾也不肯相见，只是让人传话道：“和尚误矣，和尚误矣。”姚广孝再去见姐姐，却又遭到责骂，不禁惘然。</p>\n<h2>道衍评价</h2>\n<p>　　朱棣：① 广孝器宇恢弘，性怀冲澹。初<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>名道衍，潜心内典，得其阃奥，发挥激昂，广博敷畅，波澜老成，大振宗风，旁通儒术，至诸子百家无不贯穿，故其文章闳严，诗律高简，皆超绝尘世。虽名人魁士心服其能，每以不及也。② 广孝德全始终行通神明，功存社稷，泽被后世，若斯人者，使其栖栖于草野不遇其时以辅佐兴王之运，则亦安得播声光于宇宙垂功名于竹帛哉。[22]</p>\n<p>　　李贽：我国家二百余年以来，休养生息，遂至于今。士安于饱暖，人忘其战争，皆我成祖文皇帝与姚少师之力也。[23]</p>\n<p>　　张廷玉：① 道衍未尝临战阵，然帝用兵有天下，道衍力为多，论功以为第一。② 惠帝承太祖遗威余烈，国势初张，仁闻昭宣，众心悦附。成祖奋起方隅，冒不韪以争天下，未尝有万全之计也。乃道衍首赞密谋，发机决策。张玉、朱能之辈戮力行间，转战无前，陨身不顾。于是收劲旅，摧雄师，四年而成帝业。意者天之所兴，群策群力，应时并济。诸人之得为功臣首也，可不谓厚幸哉！[24]</p>\n<h2>道衍作品</h2>\n<p>　　姚广孝曾作为监修官，主持重修《明太祖实录》，又与解缙等人纂修《永乐大典》。[25]</p>\n<p>　　姚广孝的著作主要有《逃虚子诗集》十卷，续集及补遗各一卷，《逃虚类稿》五卷、《道余录》《<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>简要录》《<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>不可灭论》及《诸上善人咏》各一卷。</p>\n</div>"
    }
]