[
    {
        "title": "【打坐】好处有哪些？打坐的方法和注意事项介绍",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x6253;&#x5750;&#x3011;&#x597D;&#x5904;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x6253;&#x5750;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4ECB;&#x7ECD;\" src=\"https://www.liaotuo.com/uploadfile/2018/1128/20181128020302680.jpg\" title=\"&#x3010;&#x6253;&#x5750;&#x3011;&#x597D;&#x5904;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x6253;&#x5750;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4ECB;&#x7ECD;\" /></p>\n<h2><a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>是什么意思？</h2>\n<p>　　打坐，指跏趺而坐，使心入定。是僧道<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>的一种方法，即将双腿按一定姿势坐好，而双手结印，放在一定的位置上。打坐在<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>中叫“禅坐”或“<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>”，打坐既可养身延寿，又可开智增慧。</p>\n<p>　　打坐有好多种层次，普通人打坐，叫作<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>，目的在于养生，此可从身心的<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>长寿为著眼。印度的瑜伽士打坐，目的在于习定，此可包括<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的四禅八定，及出世间的九次第定。<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>也用打坐的方式，目的则在利用一个稳妥的坐姿，一味<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>。</p>\n<p>　　打坐是要慢工出细活的，要有恒心、毅力，要保持每天定时打坐，成为习惯，成为日常<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的一部分，日积月累，必有收获。到了那个程度，若有一天不打坐，都会觉得生活有些失序。非有长期打坐经验的人，难以体会到混乱的思绪与井然有序的思惟之间有绝大的区别。</p>\n<p>　　打坐时如觉得时间过得很慢，是因为心不能安定，心里不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>的缘故。时间的长短跟心情有绝对的关系，心不能适应，就觉得时间长，心能适应，便觉得短。所以<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>里说，在<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>觉得时间特别长，在天堂觉得时间特别短。当心不能适应时，便需要予以调整，方能得自在。</p>\n<h2>打坐的好处</h2>\n<p>　　打坐的功能有三项：第一是达到身心平衡，第二是达到精神稳定，第三是达到<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>心及慈悲心的开发。</p>\n<p>　　身心平衡：就是身体平衡和心理平衡，这就是身心健康。如果一个人的身体强壮像水牛，心理脆弱像老鼠，就不能说健康。</p>\n<p>　　精神稳定：精神的含义比较难理解，那不是心理，也不是生理，但是跟身心有关，它会产生无形的功能，会从有形的行为表现出来。</p>\n<p>　　智慧及慈悲的开发是什么？如果有了身心统一，以及自己和宇宙统一的经验，精神就能统一。如果把精神和身心的执着超越了，就有智慧力及慈悲心开发出来。这里说的智慧不是知识，也不是学问，而是绝对的决断力。</p>\n<h2>打坐的姿势及方法</h2>\n<p><strong>　　（一）暖身运动</strong></p>\n<p>　　早上起床后，未活动前勿打坐，应先做一套简易的暖身运动，让筋骨松软后再打坐。</p>\n<p>　　1.扭身甩手：两脚站开与肩同宽，转腰甩手，脚不动，身体尽量向右后转，左手掌顺手打到右肩上，再向左后转，做同样动作，左右分别甩打十次。</p>\n<p>　　2.腰部运动：双手插腰，眼睛睁开，先以顺时针方向转动上半身与腰部，再逆时针转动，分别各转十次。3.扭腰画圈：双手伸直高举，身体做三百六十度旋转，顺、逆时针分别各十次。</p>\n<p>　　4.甩手屈膝：一边双手前后摆动，手臂尽量提到与肩平，同时双脚随着手的摆动原地踮脚顿脚，做一百次。</p>\n<p>　　5.擎天触地：双手交叉，手心向外翻掌，掌心朝上，手往上抬，脚跟同时提起，越高越好。再向下弯使手掌触地。</p>\n<p>　　6.膝部运动：双脚并拢半蹲，双手扶在双膝上先顺时针转十圈，再逆时针转十圈；最后站立转动右脚踝，及左脚踝各十次。次数多寡可自行斟酌增减。</p>\n<p><strong>　　（二）头部运动</strong></p>\n<p>　　每次坐禅之前，不论有否做上述之暖身运动，均需作下述的头部运动。</p>\n<p>　　坐下蒲团后，先将两手平置于左右两膝，勿用力，身体坐正，再做头部运动的四个步骤：⒈头向下低，再往后仰；⒉头向右倾，再往左倾；⒊头向右后转，再向左后转；⒋头以顺时针方向，向前、向右、上仰、左转，再逆时针方向，向前、向左、上仰、右转。每个步骤身体不动，肌肉和神经放松，各做三次。动作缓慢柔软，眼睛睁开，呼吸自然。头部运动的目的，在使头部血液减少，降低思潮起伏的动力；使头脑清新，渐渐宁静。</p>\n<p>　　做完头部运动，把左右手掌放在丹田（脐下约三指）处，双手两拇指相触，成一倒三角形，深吸一口气，接着慢慢吐气并向下弯腰，双掌压小腹帮助把气吐出，直至气完全吐完，连续做三次深呼吸。做深呼吸的目的在使体内的浊气排出，换取新鲜带氧的空气，使血液循环顺畅。</p>\n<p><strong>　　（三）七支坐法</strong></p>\n<p>　　做好预备动作，便可开始坐禅了。正统的禅坐方法，是七支坐法。所谓七支坐法是：</p>\n<p>　　⒈双足跏坐——此有二式：</p>\n<p>　　⑴如意吉祥坐——通常是以左脚在下，右脚置于左大腿上，再将左脚置右大腿上，称为如意吉祥坐。</p>\n<p>　　⑵不动金刚坐——将右脚在下，左脚置于右大腿上，再将右脚置于左大腿上，称为不动金刚坐。这两种坐法，对于年长及初学的人，很难做到。</p>\n<p>　　初学的人如无法双盘，可改为单盘的半跏坐，只要将一只脚置于另一边的大腿上即可。左脚在右小腿下或右脚在左小腿之下均可。</p>\n<p>　　对于无法双盘及单盘的人，开始时还可以采用更简易的坐法。如：</p>\n<p>　　⑴交脚座——两脚均置于地，向内向后收，两脚掌向上，置于两小腿乃至两大腿之下。</p>\n<p>　　⑵跨鹤坐——即双膝跪下，将软垫置于骻下，如骑在鹤背上，两脚的大拇指上下交迭，将臀部坐落在骻下的垫子上。</p>\n<p>　　⑶天神坐——左脚坐如半跏式，曲向内，置于身前；另一脚曲向外，置于身后侧。南传上座部佛教徒，席地闻法时多用此式，乃至坐禅寺时的初步坐法也用此式。</p>\n<p>　　⑷如意自在坐——此式系模仿菩萨八相成道，自兜率天下降人间之前的坐姿，左脚坐如半跏式，曲向内，脚跟置于会阴前，右脚垂立、曲膝置于右胸前，左右两手平覆分置于左右两膝，或合抱于垂立的膝盖。</p>\n<p>　　⑸正襟危坐——以上各种坐法，均系席地而坐，此式则坐于与膝同高的椅子上或板凳上，两脚平放于地，两小腿垂直，两膝间容一拳的距离，背不可依靠任何东西，仅臀部坐实，大腿宜悬空，与小腿成一直角。</p>\n<p>　　以上各种坐法，仅坐姿及手姿略有不同之外，其他仍采用七支坐法规定的标准。功效最大最快且能经久稳固的坐姿，仍系最难的跏趺坐。因此，初学的人即使无法双盘，至少要多练习惯于单盘。</p>\n<p>　　⒉背脊竖直——腿盘好之后，挺起腰干，勿挺胸部，头顶天垂直，下颚内收，颔压喉结。</p>\n<p>　　⒊手结法界定印——两手圈结，右手在下，左手在上，两拇指轻轻相接结成圆圈形，轻轻平置于丹田下的骻部腿上。</p>\n<p>　　⒋放松两肩——将两肩肌肉放松，<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>如无肩无臂无手的状态。</p>\n<p>　　⒌舌尖微舐上颚——舌尖舐在门牙上龈的唾腺处，不可用力，若有口水则缓缓咽下肚去。</p>\n<p>　　⒍闭口——无论何时，只用鼻息，不可张口呼吸，除非有鼻病。</p>\n<p>　　⒎眼微张——闭八分开二分，视线投置于身前二、三尺处的地上的一点，不是要看什么，只因睁大了眼睛，心易散乱；闭起了眼睛，则易昏沉。如果睁眼过久觉得疲劳，不妨闭上一会儿。</p>\n<p><strong>　　（四）放松身心</strong></p>\n<p>　　一般的圆蒲团，不宜整个坐满，看个人情况可坐二分之一或三分之一，以利于腰干之挺直；腿下可置硬软适中的方垫。打坐时身心要完全放松，所以身上尽量不要戴项链、手表或眼镜等物品，最好穿宽松之衣裤，腰带放松，让身体完全无压力负担。</p>\n<p>　　大家坐好之后，开始把身体放松，在心里依序告诉自己头部、眼球、脸部肌肉、颈部、肩部、双臂、背腰、小腹、腿部一一放松，把重心放在臀部，把气沉到丹田。任何部位甚至皮肤都要完全放松，只要有压力就会紧张，紧张便会影响神经系统，乃至于消化及分泌系统。</p>\n<p>　　身体完全放松之后，眼睛微张约二、三分眼，眼球不要用力，头脑不想任何事，脸部肌肉放松略带微笑，心里要有喜悦感，舌舐上颚、下巴内收、腰椎挺直，两个手在脐下结法界定印，左手掌上、右手掌下、双手两个大拇指相接。之后便不再注意身体，将重心放在臀部和坐垫之间，开始注意自己的呼吸。此时把身体交给蒲团，把心交给方法。</p>\n<p>　　如果有瞌睡或昏沉的现象，把眼睛睁开睁大，等精神好了再微闭。注意呼吸是非常无聊的事，容易昏沉或胡思乱想，脑中<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>纷飞。我们应该上课的时候专心上课，吃饭的时候专心吃饭，睡觉的时候专心睡觉，做任何事都要把心专注其上。</p>\n<p><strong>　　（五）数呼吸</strong></p>\n<p>　　注意呼吸时间久了，可能觉得很无趣，现在教给各位另外的方法：⒈数呼吸（数息法），⒉<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>号。这些方法同样是要达到心无二用，令心念专注之目的。</p>\n<p>　　先练习数呼吸，注意呼吸之出入。一般人呼吸，出息时间较长，入息时间较短，所以我们数呼吸时，只数出息，不管入息，每一次呼出的时候数一个数目，到了吸入的时候，仍停留在该数字上，到下一口气呼出的时候，才换下一个数目。</p>\n<p>　　平常人每分钟呼吸大约十四至十六次。不能故意控制呼吸，否则胸部会不舒服。</p>\n<p>　　当打坐经验相当丰富之后，呼吸自然会逐渐慢下来，到每分钟四至五次，那已经要入定的程度了。一般呼吸到了每分钟十次，心已经相当安定、平稳。</p>\n<p>　　如果呼吸急促必然是非常烦闷、恐惧、急躁、兴奋的现象。呼吸和脉搏是息息相关的，呼吸有问题，脉搏必然也会有问题；脉搏快，呼吸也一定有问题，所以要用平常的呼吸方式呼吸。</p>\n<p>　　数息法是在每一个出息时数一个数字，从一数到十，然后重回到一再数到十，周而复始，反复地数。数息的时候，一旦起了<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>或杂念，无论中途数到多少，都得重回到一数起，因此往往无法顺利从一数到十，不是数不到十，就是数过了头而不自觉。开始数息可能觉得新鲜，等数了一段时间后也会觉得无聊，所以要练习着对于每一口气的每一个数目，经常保持新鲜感。</p>\n<p><strong>　　（六）数<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a></strong></p>\n<p>　　有些人不数息，呼吸很正常，一旦数息，呼吸便急促不自然。如是这样，可试试念佛的方法，就是念阿弥陀佛或<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>圣号。</p>\n<p>　　念佛之法，除了单纯地念佛号之外，也可念佛数数，即念一句阿弥陀佛或观世音菩萨圣号，数一个数目，如何弥陀佛一、阿弥陀佛二……，也是从一数到十，周而复始。其目的宗旨在让自己的心念能集中专注。</p>\n<p>　　念佛数数法与呼吸无关，不需配合呼吸，不要太快也不要太慢，不疾不徐，念一句佛号数一个数目，清清楚楚的知道这个数目的存在，再继续往下念第二句佛号第二个数目，很清楚地把注意力集中在所数的数目上，与数息法在每一个出息上数数的意义是相同的。</p>\n<p>　　各位可选择适合自己的方法来作工夫，随意法、数息法、念<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>、念佛数数法均可，但最好只选一样，不要一下用此法，一下用彼法，要专心一意在同一个方法上调心。</p>\n<p><strong>　　（七）调心方法</strong></p>\n<p>　　调身、调息、调心的调，就是调整的意思。打坐时候的动作、姿势与调身有关；调息则与呼吸的出入有关。注意呼吸的出入，心自然而然会平静下来。心息相通，心能平静，各种胡思乱想，种种心理活动及冲动，自然也会稳定下来，是为调息、调心。</p>\n<p>　　念佛与呼吸无关，与调心有关。心绪非常昏乱，念佛可以念得急促，心绪相当平静，念佛就当缓慢。念佛数数也是从一数到十，再回头重复的原因，是为防止变成机械式的数数，即口在数数，而脑在胡思乱想，数目却仍数得很好。我们从小就已会数数，这就是为什么有人数息时一不小心，一数就数到一百、二百，并认为数到二百比数到十还容易。</p>\n<p>　　每十个数字要回头一次很麻烦，但我们的目的不在数数，是要使我们的心随时随地专注在一点上，不离开这个范围。亦即心不离开我们用功的方法。数息不离呼吸出入的感觉，念佛不离佛号，也就是把心收回来摄在一点上。其目的是希望达到自我了解、自我认识、自我肯定的功能。若对自己的心念活动不清楚，即表示对自己是不够了解的；若对自己的了解越深刻，则对自己的<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>便越坚固，能发挥的能力也越强大。对自己越不了解，越容易做错事、说错话，那是因为心不由己地胡思乱想，口不择言地胡说八道，身不由主地轻举妄动，这些在在都显示自己不了解自己，所以无法掌握自己。</p>\n<p>　　想避免发生这些身不由己、心不由己的现象，就必须认识自己、了解自己、肯定自己，对自我了解越清楚，发生错误的机会就越少；相对的，自我的思考、判断及言行举止，也会越正确。当我们对自己的心念越能掌握，对自己的信心便越加强，就能达到从自我认识而自我肯定而自我成长的目的。</p>\n<p><strong>　　（八）起坐前的全身按摩</strong></p>\n<p>　　打坐结束，要起坐（出定）之前，心要先动，告诉自己要起坐了，身体跟着慢慢摇动，双手合掌，双手放在膝盖上，将身体做较大幅度的摇动，把每一个关节都摇动后；把腿放开，然后做全身的按摩。</p>\n<p>　　按摩的顺序是先搓热两掌，用拇指背轻轻按摩双眼眼眶，并用搓热的手掌心敷压眼球；再用双掌按摩脸部、额头、后颈、两耳、双肩、两臂、手背、胸部、腹部、背部、腰部，尤其是两臂腋下多淋巴结处、后腰肾部及命门，多多按摩有益健康；接下来右边大腿、膝盖、小腿，左边大腿、膝盖、小腿及轻柔转动双足脚踝。打坐的人，后腰非常重要，应多按摩。</p>\n<p>　　按摩小腿时从膝盖骨下三指的足三里处，往下一路按下去，会有点痛，但对胃肠有调节作用。</p>\n<p>　　当生活、工作紧张，压力大时，火气大，肝火上升，容易便秘。在肚脐眼左、右两侧各三指处，用二或三个手指稍微用力压下去，压三、五次就有效了，大便不通比气不通还不舒服，也会影响打坐的兴趣。</p>\n<p>　　此自我按摩的运动法，可使初学坐禅而感到的疲劳，完全消除，身心感到柔和温暖与舒畅。按摩时，必须将注意力集中于掌心或指头。整套按摩约十五分钟可做完，如做得简单些，则约三、五分钟亦可做完。除了打坐之外，平常感觉疲累、困倦时，都可做做全身的按摩，对消除疲劳很有功效。</p>\n<h2>打坐的注意事项</h2>\n<p>　　1.当脑筋清楚，体力充沛的时候，最适合打坐，最好养成每天固定的时间打坐，例如早上早些起床，晚上洗完澡睡前各坐一次，每次至少十五至二十分钟，如能坐到半小时至一、两小时更佳。</p>\n<p>　　2.早上起床刷牙洗脸后，喝些温开水再坐较好，如觉得累，喝一杯咖啡提神亦无不可，没有严格限制，但不要喝太浓的咖啡，会使心脑兴奋，不易定得下来。</p>\n<p>　　3.吃太饱、喝醉酒、太疲倦、做过剧烈运动或刚有过性行为者，身心均处在乏力状态，不宜打座。</p>\n<p>　　4.向来有子、午二个时段不宜打坐的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，但现代人的生活习惯与以前的人不同，如碰上只有子、午二个时段才有时间打坐时，只要坐的时间不是太长，亦是无妨的。</p>\n<p>　　5.我们要学习放松，随时练习在使用头脑时能不用眼睛，用方法使眼睛、小腹放松，可以节省很多能源，此外，也要注意营养的均衡，使能做到「开源节流」。</p>\n<p>　　6.能源充足能使我们身体各管道没有阻力，气脉便能畅通，那么消化系统、循环系统和神经系统也都能通畅，我们用打坐、运动的方法来达到这样的目的，这是属于健身（调身）。</p>\n<p>　　7.打坐时腰干原是挺得很直的，坐久了，会慢慢弯了下来，如不是弯得很厉害，不需刻意调整姿势，那会使自己紧张。如果气通了，背椎腰背会自己挺直的，完全是由气带动，不是人为地操控，这是非常奇妙的现象。</p>\n<p>　　8.不常打坐的人单盘腿就可以了。如果是瘦子，双盘时双腿会卡得很痛；如果是胖子，则两腿的腿肉会把双腿卡成一高一低，也不舒服，单盘比较平稳。</p>\n</div>"
    }
]