[
    {
        "title": "地狱",
        "date": "2016-01-15",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"282\" src=\"https://www.liaotuo.com/uploadfile/2016/0115/20160115022701932.jpg\" style=\"width: 339px; height: 243px\" width=\"392\" /></p>\n<h2><a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a><a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a></h2>\n<p>　　地狱（巴利语niraya，或作naraka），分为四大类：八寒地狱、八热地狱、近边地狱、孤独地狱</p>\n<h3>　　八寒地狱</h3>\n<p>　　八寒地狱分为：具疱地狱、疱裂地狱、紧牙地狱、阿啾啾地狱、呼呼地狱、裂如青莲地狱、裂如红莲地狱、裂如大红莲地狱</p>\n<p>　　八寒地狱的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>各不相同，所以安立了八种名称，称为八寒地狱。这里的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>求生不得，求死不能，<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>量也不是一两百年。打个比喻：二百藏升的大盆里装满芝麻，每一百年取出一粒芝麻，直到把所有的芝麻取尽了，具疱地狱众生的寿命量才尽。其余七个八寒地狱的寿命量，依次比具疱地狱增加二十倍。从具疱地狱到裂如红莲花地狱，寿命量越来越长，环境越来越悲惨，痛苦越来越大，八热地狱的寿命量也是这样。我们人道的众生，冬季裸体在外面停留一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>也无法忍受，更何况生在八寒地狱里呢？</p>\n<p>　　1、具疱地狱：具疱地狱的痛苦在八寒地狱中虽最为轻微，但仍然苦不堪言。多劫冻固之寒冰坚硬如铁锋利如刀，处处狂风怒雹雪虐冰饕，既无蔽体之衣，亦乏遮寒之所。其中众生被冻得僵直如尸无法屈伸，身体中的血液等水分冻结后膨胀为遍满全身的可怕疱疮，面目全非惨不忍睹。</p>\n<p>　　2、疱裂地狱：此地狱与前者类似，但更加恶劣。此中众生覆满疱疮的身体上仍不断层层叠叠地疱上起疱，以至疮口被挤压破裂，整个身体如同巨大的伤口，肉疮不分红白相间。以上二者以众生身外变化而述。</p>\n<p>　　3、紧牙地狱：至此地狱以众生声音变化而述。此中众生因寒冷而全身痉挛蜷缩，牙齿发出紧紧陷合之声，此时痛苦已非言语所能表达。</p>\n<p>　　4、阿啾啾地狱：由于较前更甚的剧寒痛彻心扉不堪忍受，众生被业力逼迫而毫无自主地凄惨哭嚎，整个地狱中撕心裂肺的惨叫号泣之声此起彼伏。</p>\n<p>　　注：阿啾啾，意为好冷啊。</p>\n<p>　　5、呼呼地狱：较前更甚的酷寒中众生被剧苦逼扼得奄奄一息，已无惨叫之力，绝望痛苦中只能发出断断续续、窒闷哽咽的呜呼哀叹之声。</p>\n<p>　　6、裂如青莲地狱：至此以地狱众生整个身体的变化而述。前五者身体与坚冰紧紧粘连一处，而此狱众生与冰地已成一体。在更加寒厉的环境中，众生的整个身体连皮带骨地变形迸裂为五瓣六瓣不等，色呈青蓝不复人形。</p>\n<p>　　7、裂如红莲地狱：此狱众生与前类似，但惨状更甚。众生体内的裂瓣更深更大，以至整个身体由内而外地翻剥出来，更多的内脏冻肉迸裂成十数瓣后色呈青红，肉块上再无躯干头肢之别。</p>\n<p>　　8、裂如大红莲地狱：此狱众生寒苦已达极致，已然翻剥开来的身体更多更碎地裂成百数瓣，状如肉疮之身如花瓣绽裂，色呈红紫。</p>\n<h3>　　八热地狱</h3>\n<p>　　八热地狱分为：等活地狱、黑绳地狱、众合地狱、叫唤地狱、大叫唤地狱、焦热地狱、大焦热地狱、阿鼻地狱</p>\n<p>　　八热地狱灼焰覆天烧铁为地，天上不断落下无数炽浆火雹，地面处处腾起猛火，其中无数狱卒以恐怖刑具追逐砍杀，以各种残忍方式施以伤害。</p>\n<p>　　1、等活地狱：人间普通火、檀林火、太阳火、末劫火的炽热程度依次递增七倍，如是等活地狱整个境域比末劫火炽热七倍，其中众生在烧燃中仍互相残害，又被狱卒砍杀刺割，死后由业力复生，于刹那间万生万死。刑期为等活地狱的500年，等同于人间的1兆6653亿年。</p>\n<p>　　2、黑绳地狱：其中众生身上被画上八、十六、三十二条黑线不等，被狱卒用炽燃锯斧沿线锯割，血肉淋漓内脏横流，于哀号惨呼中复复<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。刑期为黑绳地狱的1000年，等同于人间的13兆年。痛苦程度为等活地狱的10倍。</p>\n<p>　　3、众合地狱：其中众生被如羊头状的两座山猛烈撞击碾碎，或在巨大铁砧上被铁锤锤打，或在铁臼中被碓磨成泥，骨肉尽碎血流成河，其后又由业风吹拂而复生。刑期为众合地狱的2000年，等同于人间的106兆5800亿年。痛苦程度为黑绳地狱的10倍。</p>\n<p>　　4、叫唤地狱：其中众生被猛火烈焰燃烧，就算稍近边缘又被狱卒用可怖兵器投入火中，由于痛苦惊怖而大声哀号。刑期为叫唤地狱的4000年，等同于人间的852兆6400亿年。痛苦程度为众合地狱的10倍。</p>\n<p>　　5、大叫唤地狱：情形与叫唤地狱相似，但程度更甚。四方上下皆为炽燃铁屋，其中众生睁大凸怖之眼，强忍剧苦惊号狂奔，但十方毫无出路，因绝望痛苦而惨厉哀叫。刑期为大叫唤地狱的8000年，等同于人间的6821兆1200亿年。痛苦程度为叫唤地狱的10倍。</p>\n<p>　　6、焦热地狱：其中众生不仅被烤炙燃烧刺贯割截，且被狱卒用炽热铁水烊铜灌口，顺次烧融喉舌内脏后溶液混着血肉从九门流出；又被三叉戟从肛门纵贯身体刺穿头顶双肩，之后又往伤口中倒入炽红溶液，惨不忍睹。刑期为焦热地狱的16000年，等同于人间的5京3084兆1600亿年。痛苦程度为前五个地狱总合的10倍。</p>\n<p>　　7、大焦热地狱：其中情景与焦热地狱类似，但惨状更甚，众生被狱卒用狼牙棒从肛门捅进身体后搅割，狼牙尖刺如刺猬般从身体各处透出，血肉狼藉之状惨厉难述。刑期为半中劫。痛苦程度为前六个地狱总合的10倍。</p>\n<p>　　8、阿鼻地狱：在高广二万由旬的铁屋里猛火常劫不息，无数巨大铜锅中充满沸腾的铁水熔铜，四方都有猛火燃烧，其中众生被煎熬烧煮翻腾搅拌。前述地狱之苦并未遍及全身、尚有喘息之机，但此中众生由内而外皮肉骨血处处与熔浆炽火混为一体，其剧苦刹那不停直至劫尽，故名无间。刑期为一中劫。痛苦程度为前七个地狱总合的1000倍。</p>\n<h3>　　近边地狱</h3>\n<p>　　近边地狱分为：煻煨坑地狱，尸粪泥地狱，利刃原地狱，剑叶林地狱，铁柱山地狱</p>\n<p>　　阿鼻地狱的四面各有煻煨坑地狱、尸粪泥地狱、利刃原地狱及剑叶林四个地狱。</p>\n<p>　　东方有四个，南方四个，西方四个，北方四个，共十六个。东南有一座铁柱山，同样西南、西北、东北各有一座铁柱山。是阿鼻地狱的附属地狱。</p>\n<p>　　1、煻煨坑地狱：由于无间罪的业力减轻而从无间地狱中<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，见到远处有黑色的凉荫，高兴前往，结果陷入剧烈燃烧的炭火坑（煻煨坑）里，血肉焦烂，痛苦难忍。</p>\n<p>　　2、尸粪泥地狱：从前面的地狱（指煻煨坑地狱）中获得解脱，从远处看到一条河流，因为前一大劫毁灭前一直在火堆中煎熬，所以非常干渴，看见水后欣然前去饮用。哪里有什么水？结果陷入散发浓烈臭气、糜漫许多小虫的人尸马尸犬尸等腐烂尸体的污泥内，最后头也没入其中，被许多具锋利铁喙的昆虫啄食，感受无量痛苦。</p>\n<p>　　3、利刃原地狱：从前面的地狱中解脱出来后，看到有一悦意的青青草原，欣然前往，结果遇到的却是一片兵器所成的利刃原，整个大地长满形如草一样锋利燃火的铁刺。如果右脚踏在上面右脚被戳穿，左脚踩下左脚被刺透，脚抬起时又恢复，再踩踏时又如前一样被穿透，痛苦难忍。</p>\n<p>　　4、剑叶林地狱：从地狱中刚刚解脱出来的众生，看到悦意的树林，兴奋地狂奔而去，哪里有什么悦意的树林？遇到的却是剑叶林，铁树上生长许多象树叶一样的利剑，随风飘动，将这些众生的身体切割成碎片，复活后又割截，如是感受切割的痛苦。</p>\n<p>　　5、铁柱山地狱：毁坏梵净行、破<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>的<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人或行邪淫的众生<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>在此地狱。由于业力的牵引，来到恐怖的铁柱山前，听到山顶上有昔日喜爱的友人呼喊自己，便向山上攀登。此时被铁树上生长的、指向下方的树叶刺穿，爬上山顶时，乌鸦、鹰鹫等前来啄食他们的眼油。这时，又听到山下传来呼喊他们的声音，如前一样又向山下奔去，所有的树叶又指向上方，从他们的前胸刺入径直穿透后背，到了山脚下被可怖的铁男、铁女拥抱，将他们的头吞入口中，从嘴角两边流出白色的脑浆，异常痛苦。</p>\n<p>　　此外，在有些近边地狱和短命地狱中，身体和舌头被拉出至数十百公里长，凶恶的狱卒将长长的铁钉订穿舌头、身体到通红的铁板上，又以犁在上面耕之，如此受苦真是遥遥没有边际，解脱杳杳没有预期！</p>\n<h3>　　孤独地狱</h3>\n<p>　　孤独地狱不同于八寒八热等地狱都有固定的地方，而是随着各人的别业，孤独的处在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>或是山野之中。也就是使自己孤单一个受着地狱情境的痛苦。孤独地狱的处所不定、痛苦也不定。有的被夹压在崖壁中，有的封困于岩石之内，有的僵冻结在冰里，有的在沸泉中煮煎，火中烧炙、或、有的焚烧在火中……或藏于树中，随着树被原斫截时，其四肢百骸亦随之段段割截，受着极大的苦楚。还有些转生到日常使用的杵臼、笤帚、瓦罐、门、柱子、灶石、绳子等色境上被逼榨煎迫。有的每日生死各一次，有的每日生死百次，甚至每日无数次地生生死死，长时受到生死的痛苦。</p>\n<h2>佛教地狱 二</h2>\n<p>　　十八层地狱据东汉安世高所译的《十八泥犁经》中，地狱分为十八层，合称为十八层地狱。十八层地狱的“层”不是指空间的上下，而是在于时间和内容上，尤其在时间之上。十八层地狱是以生前所犯罪行的轻重来决定受罪时间的长短。每一层地狱比之前一层地狱增苦二十倍和增寿一倍，全是刀兵杀伤、大火大热、大寒大冻、大坑大谷等的刑罚。当到了第十八层地狱时，苦已经无法形容，也无法计算出狱的日期了。</p>\n<p>　　地狱（梵语naraka）十八泥犁纤中，列有十八个地狱，何等为十八呢？就是光就居、居虚略、桑居都、楼、房卒、草乌卑次、都卢难旦、不卢半呼、乌竟都、泥卢都、乌略、乌满、乌藉、乌呼、须健居、末都干直呼、区通途、陈莫。这些都是<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>，全部是一些刀兵杀伤，大火大热、大寒大冻、大坑大谷等的刑罚。</p>\n<h3>　　第一层，拔舌地狱</h3>\n<p>　　凡在世之人，挑拨离间，诽谤害人，油嘴滑舌，巧言相辨，说谎骗人。死后被打入拔舌地狱，小鬼掰开来人的嘴，用铁钳夹住舌头，生生拔下，非一下拔下，而是拉长，慢慢地拽......后入剪刀地狱，铁树地狱。</p>\n<h3>　　第二层，剪刀地狱</h3>\n<p>　　在阳间，若妇人的丈夫不幸提前死去，她便守了寡，你若唆使她再嫁，或是为她牵线搭桥，那么你死后就会被打入剪刀地狱，剪断你的十个手指！更不用说她的丈夫还没死，就像《<a href=\"/ctwh/gdxs/xy/shz.html\" class=\"keylink\" target=\"_blank\">水浒传</a>》中的王婆，潘金莲本无意勾引西门庆，王婆却唆使她讨好西门大官人，并赠予她毒药，毒害武大郎。且不说潘金莲，西门庆下场如何，单讲王婆，剪刀地狱够她一戗！</p>\n<h3>　　第三层，铁树地狱</h3>\n<p>　　凡在世时离间骨肉，挑唆父子，兄弟，姐妹<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>不和之人，死后入铁树地狱。树上皆利刃，自来后背皮下挑入，吊于铁树之上。待此过后，还要入拔舌地狱，蒸笼地狱。</p>\n<h3>　　第四层，孽镜地狱</h3>\n<p>　　如果在阳世犯了罪，若其不吐真情，或是走通门路，上下打点固旃海，就算其逃过了惩罚，逃亡一生也终有死那天吧？到地府报道，打入孽镜地狱，照此镜而显现罪状。然后分别打入不同地狱受罪。</p>\n<h3>　　第五层，蒸笼地狱</h3>\n<p>　　有种人，平日里家长里短，以讹传讹，陷害，诽谤他人。就是人们常说的长舌妇。这种人死后，则被打入蒸笼地狱，投入蒸笼里蒸。不但如此，蒸过以后，冷风吹过，重塑人身，带入拔舌地狱。</p>\n<h3>　　第六层，铜柱地狱</h3>\n<p>　　恶意纵火或为毁灭罪证，报复，放火害命者，死后打入铜柱地狱。小鬼们扒光你的衣服，让你裸体抱住一根直径一米，高两米的铜柱筒。在筒内燃烧炭火，并不停扇扇鼓风，很快铜柱筒通红……看过《封神榜》吗？苏妲己的炮烙,到此你肯定激灵一下。</p>\n<h3>　　第七层，刀山地狱</h3>\n<p>　　亵渎神灵者，你不信没关系，但你不能亵渎他；杀牲者，别提杀人，就说你生前杀过牛呀，马呀，猫，狗，因为它们也是<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>，也许它们的前生也是人或许还是你的......因为阴司不同于阳间，那里没有高低贵贱之分，牛，马，猫，狗以及人，来者统称为生灵。犯以上二罪之一者，死后被打入刀山地狱，脱光衣物，令其赤身裸体爬上刀山......视其罪过轻重，也许“常驻”刀山之上。</p>\n<h3>　　第八层，冰山地狱</h3>\n<p>　　凡谋害亲夫，与人通奸，恶意<a href=\"/remen/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>的恶妇，死后打入冰山地狱。令其脱光衣服，裸体上冰山。另外还有赌博成性，不孝敬父母，不仁不义之人，令其裸体上冰山。潘金莲定在！</p>\n<h3>　　第九层，油锅地狱</h3>\n<p>　　卖淫嫖*，盗贼抢劫，欺善凌弱，拐骗妇女儿童，诬告诽谤他人，谋占他人财产，妻室之人，死后打入油锅地狱，剥光衣服投入热油锅内翻炸，啪，啪直响！依据情节轻重，判炸N遍......有时罪孽深重之人，刚从冰山里出来，又被小鬼押送到油锅地狱里暖和暖和……平常人们所说的十八层地狱，数目是对了，但从意义上却却不见得理解。《十八泥犁经》中讲到这十八层的差别，最主要不在于空间的上下，而在于时间和刑法上的不同，尤其时间上。若与阳世的时间比教，第一层地狱是以人间的三千七百五十年为一日，在这里的众生必须此<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>一万年，想要早死一天都不行，而这一万岁就相当于人间的一百三十五亿年。而由于地狱的时间和寿命都是依次倍增的，所以，到了第十八层地狱，便亿亿亿年为单位，如此长期的受刑时间，可说是名符其实的万劫不复，痛苦和残酷的景象，是世人所难以想像和理解的。</p>\n<h3>　　第十层，牛坑地狱</h3>\n<p>　　这是一层为畜生申冤的地狱。凡在世之人随意诸杀牲畜，把你的快乐建立在它们的痛苦上。那么好，死后打入牛坑地狱。投入坑中，数只野牛袭来，牛角顶，牛蹄踩.....另据记载，与之相反的还有名为“刀船地狱”的，未在此十八层地狱之列，后面将补充。</p>\n<p>　　刀船地狱里有“养鸡女”。她头扎双股高发髻，著尖领窄袖襦服，体态丰满秀丽，表情稳重温和，两唇轻抿，嘴角微翘，体现了安逸享乐的情景。她与周围阴森恐怖，受刑人呼天号地，牛头马面狰狞，令人毛骨悚然的场面形成鲜明对比，有如“鹤立鸡群”。告戒世人不要<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a><a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>，现在清苦，但将来死后则其乐无穷；众生在人间贪食鸡和蛋，现在很乐，但将来下地狱则其苦无穷。同样，“养鸡女”现在养鸡是“乐”，但将来入地狱是“苦”。</p>\n<h3>　　第十一层，石压地狱</h3>\n<p>　　若在世之人，产下一婴儿，无论是何原因，如婴儿天生呆傻，残疾；或是因重男轻女等原因，将婴儿溺死，抛弃。这种人死后打入石压地狱。为一方形大石池（槽），上用绳索吊一与之大小相同的巨石，将人放入池中，用斧砍断绳索......</p>\n<h3>　　第十二层，舂臼地狱</h3>\n<p>　　此狱颇为稀奇，就是人在世时，如果你浪费粮食，糟踏五谷，比如说吃剩的酒席随意倒掉，或是不喜欢吃的东西吃两口就扔掉。死后将打入舂臼地狱，放入臼内舂杀。稀奇的是如果你吃饭的时候说话，特别是脏话，秽语，骂街，死后同样打入舂臼地狱受罪。所以提醒大家，吃饭的时候最好不要说话，特别是骂街。</p>\n<h3>　　第十三层，血池地狱</h3>\n<p>　　凡不尊敬他人，不孝敬父母，不正直，歪门邪道之人，死后将打入血池地狱。投入血池中受苦。我也不大明白，这里说凡难产，吐血，流血而死之人，死后也投入血池中受苦？</p>\n<h3>　　第十四层，枉死地狱</h3>\n<p>　　要知道，作为人身来到这个世界是非常不容易的，是阎王爷给你的机会。如果你不珍惜，去<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>，如割脉死，服毒死，上吊死等人，激怒阎王爷，死后打入枉死牢狱。就再也别想为人了。我劝戒在世的人，遇到多大的困难，也要顽强的活下去，自杀是懦弱的表现。特别是那些殉情的傻小子们。</p>\n<h3>　　第十五层，磔刑地狱</h3>\n<p>　　现在不多见了，不过此罪过很大。即挖坟掘墓之人，死后将打入磔刑地狱，处磔刑。</p>\n<h3>　　第十六层，火山地狱</h3>\n<p>　　这一层比较广泛，损公肥私，行贿受贿，偷鸡摸狗，抢劫钱财，放火之人，死后将打入火山地狱。被赶入火山之中活烧而不死。另外还有犯戒的和尚，道士。也被赶入火山之中。（这层应该人满为患了）</p>\n<h3>　　第十七层，石磨地狱</h3>\n<p>　　糟踏五谷，贼人小偷，贪官污吏，欺压百姓之人死后将打入石磨地狱。磨成肉酱。后重塑人身再磨！另外还有吃荤的和尚，道士皆如此。</p>\n<h3>　　第十八层，刀锯地狱</h3>\n<p>　　偷工减料，欺上瞒下，拐诱妇女儿童，买卖不公之人，死后将打入刀锯地狱。把来人衣服脱光，呈“大”字形捆绑于四根木桩之上，由裆部开始至头部，用锯锯毙。</p>\n<p>　　更恐惧被关押的时间：十八地狱是以受罪时间的长短，与罪行等级轻重而排列，若随最短时间的光就居地狱之寿命而言，其一日等于人间三千七百五十岁，三十日为一月，十二月为一年，经一万岁，也就是人间一百三十五亿年，才命终出狱，逐次往后推，每一地狱各各比前一地狱，增苦二十倍，增寿一倍，到了十八地狱时，简直苦得无法形容，并也无法计算出狱的日期了。</p>\n<h2>佛教地狱观念</h2>\n<p>　　佛教之地狱说是与其<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>观念有关，以便更形象地解析“业”与“<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>”，以导人向善。陈帅佛认为佛教所说的地狱和鬼，是不同的两类众生。地狱之名在许多<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>中皆有出现，最常见的是《立世阿毗昙论》中称「泥梨耶」(梵文niraya或naraka)，意思是没有喜乐和福德的地方。而在《新婆沙论》中，称为「那落迦」（梵文naraka），则是没有喜悦意和喜乐之意。从意译上可知，地狱道是欲界<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>中最苦的境界，因为在这里的众生，不但没有一丝的喜悦，还备受各种酷刑折磨。（地狱道是欲界六道中最苦的境界）例如在等活地狱（又名想地狱），此中众生备受砍、刺、磨、捣之苦，皮开肉绽，痛苦至死，当身体被冷风所吹，伤口愈合，身体复生，重又受罪，如此不断的受罪，直到业报受尽才能出离这苦痛无间的地狱。而且在地狱中的众生，寿命又特别长，在受罪之时，真是求生不得、求死不能。根据印顺导师在《<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之道》的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，地狱可分四大类：</p>\n<p>　　1.八大地狱：八大地狱是此道的最根本，到处充满火焰，所以也叫做「八热地狱」，与基督教所说的「永火」相近。最底层就是令人闻之丧胆的阿鼻地狱，亦即无间地狱。</p>\n<p>　　2.游增地狱：八热地狱的每一热地狱都有四门，每门又有四小地狱，总共一百二十八地狱。凡是从八热地狱出来的众生，要一一游历此处受苦，所以称为「游增」。</p>\n<p>　　3.八寒地狱：极为寒冷，此处众生经常因寒冷而悲号，身体也为之冻得变色。</p>\n<p>　　4.孤独地狱：这是在人间的山间，江边等，过著孤独、非人的生活，可说是人间地狱。总计八热、八寒、游增、孤独，地狱共有十八处。</p>\n<p>　　佛教中的地狱除了18层地狱的说法外还有 八炎火地狱，八寒地狱，八热地狱。</p>\n<p>　　八热地狱又称八大地狱，据《<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>》卷八、卷十一和《大乘义章》卷八记载，八大地狱在须弥山南的南方增长天王护持下的南赡部洲下面。八大地狱为：</p>\n<p>　　1．等活地狱(Samjva)，堕入这里的鬼魂互相残杀，凉风吹来死而复活，更受苦罪；</p>\n<p>　　2.黑绳地狱(Kalsotra)，以黑铁绳绞勒罪人；</p>\n<p>　　3．众合地狱(samghata)，以众兽、刑具配合惩处罪人；</p>\n<p>　　4．号叫地狱(Rdurava)，罪人受苦折磨，发出号叫；</p>\n<p>　　5．大叫地狱(Maharaurava)，在此受罪更惨烈，号叫之声更大；</p>\n<p>　　6．炎热地狱(Tapana)，罪人在铜镬、炭坑中煮烧；</p>\n<p>　　7．大热地狱（Pratapana），在这里受到更历害的烧煮。</p>\n<p>　　8．阿鼻地狱（Avici）意即“无间地狱”。凡造“十不善业”者堕入此地狱，一刻不停受诸刑惩罚，故称“无间地狱。”</p>\n<p>　　据说八大地狱是竖着一层层排列的，另外还有一层层横着排列的“八寒地狱”，这里酷寒异常，与八大地狱的酷热相对应。</p>\n<p>　　八寒地狱。据《俱舍论光记》卷十一说，八寒地狱名目如下：</p>\n<p>　　1．阿部陀(Arbud)，意思是“疮狱”，入者身寒生疮；</p>\n<p>　　2．尼刺部陀(Nirarbuda)，入者身寒疮破；</p>\n<p>　　3．阿吒吒(Atata)，入者唇舌冻僵，发出颤声；</p>\n<p>　　4.臛臛婆：(HahaVa)，入者口中冻得发出“臛臛婆”之寒</p>\n<p>　　5．虎虎婆(Huhuva)，已冻得发不出声音，只在喉间伦‘虎虎婆”之响；</p>\n<p>　　6．温钵罗(Utpala)，身体冻裂如青莲花；</p>\n<p>　　7．钵特摩(Padma)，身体冻得大折裂如红莲花；</p>\n<p>　　8．摩诃钵特摩(Mahapama)，全身冻得骨折如大莲花或白莲花。</p>\n<p>　　据《大智度论》卷十六说，在八大地狱周围还有更厉吾的“八炎火地狱”。</p>\n<p>　　八炎火地狱。其名目如下：</p>\n<p>　　1．炭(火)坑地狱；</p>\n<p>　　2．沸水地狱；</p>\n<p>　　3．烧林地狱；</p>\n<p>　　4．剑树地狱；</p>\n<p>　　5．刀道地狱；</p>\n<p>　　6．刺棘地狱；</p>\n<p>　　7．咸河地狱；</p>\n<p>　　8．铜(热铜)柱地狱。</p>\n<p>　　除了这些具体有名的大系统地狱之外，还有专门对付那些在零的零星鬼魂的地狱，这就是“孤独地狱”，又叫“平狱”。《俱舍颂疏》卷十说：“余孤地狱各别业招，或多或少，或二或一，所止差别多种，处处不定。或近江河山边旷野，在地下空及余处。”这种无定处、单个存在的地狱据说有八万四千多个，给鬼魂撤下了天罗地网，到处都跑不脱。</p>\n</div>"
    }
]