[
    {
        "title": "【烦恼】什么是烦恼？佛教怎么解释烦恼？",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x70E6;&#x607C;&#x3011;&#x4EC0;&#x4E48;&#x662F;&#x70E6;&#x607C;&#xFF1F;&#x4F5B;&#x6559;&#x600E;&#x4E48;&#x89E3;&#x91CA;&#x70E6;&#x607C;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0111/20160111121258945.jpg\" style=\"width: 377px; height: 245px;\" /></p>\n<h2><a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　烦恼，即迷惑，人类因迷惑而造诸恶业，受种种的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。这痛苦的来源，乃由六根本烦恼而起的。这六种烦恼分别是贪、嗔、痴、慢、疑、不<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。贪是贪爱五欲；嗔是嗔恚无忍；痴是愚痴无明；慢是骄慢自大；疑是狐疑猜忌；不正见是不正的见解，包括身见、边见、邪见、见取见、戒禁取见等。贪嗔痴慢疑加上五不正见，成为十根本烦恼，又名十惑，或十使。</p>\n<h2>烦恼的基本含义</h2>\n<p>　　梵语Klesa的意译。据《大智度论》卷七解释：“烦恼者，能令心烦能作恼故，名为烦恼。”唐·窥基《<a href=\"/fojing/chengweishilun/yuanwen.html\" class=\"keylink\" target=\"_blank\">成唯识论</a>述记》卷一解释：“烦是扰义，恼是乱义；扰乱有情（<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>），故名烦恼。”经上关于“烦恼”的分类、解说很多，如根本烦恼、随烦恼、分别烦恼、俱生烦恼等。最主要的烦恼，即贪、嗔、痴“三毒”。南朝梁·宝志《大乘赞》认为：“但无一切希求，烦恼自然消落。”后因以泛指忧愁苦闷，心绪不宁。如《京本通俗小说·志诚张主管》：“我恁地一个人，许多房奁，却嫁一个白须老儿，好不生烦恼！”又如闻一多《红烛·时间底教训》诗：“昨日的烦恼去了，今日的还没来呢！”</p>\n<p>　　<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>云：烦恼轻,<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>长。断了分别、执着的样子是：烦恼轻、智慧长。最明显的是，听经有悟处、<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>能通达义理。一门深入，长时熏修，是为了断烦恼；烦恼没有了，清净心就会现前，根本智就现前。戒能断烦恼，定能断烦恼，慧能转烦恼为<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。赞叹比毁谤伤害人还要厉害，毁谤会叫<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>烦恼，赞叹同样也叫人生烦恼。大家对他一赞叹，他就不知道天高地厚，就觉得自己很了不起，贡高我慢统统生起来了，他的道行不能再前进，只有往后退。八万四千法门，每一个法门都是修一心不乱；功夫就是在伏烦恼、断烦恼、开智慧。<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>，要从“<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>”开始。先放下见思烦恼，再放下尘沙烦恼，最后放下根本无明。 我们在境界里面，才起一念分别执着，那就叫迷，那就叫做无明。无明继续不断往下发展，那就变成见思烦恼，那就得造业受报。心一天比一天烦恼，就是<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>增加；心一天比一天清净，就是业障消除的现象。<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>容易成就，在于“带业<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>”，不需要断见思烦恼；八万四千法门只有这个法门是带业往生。 烦恼障是七情五欲、人我是非、贪嗔痴慢。见思烦恼通常归纳为两大类：一类是见惑，一类是思惑。见惑包括身见、边见、见取见、戒取见、邪见。思惑包括悭贪、嗔恚、愚痴、傲慢、对于圣教的怀疑。对于圣教的怀疑，就是对于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>所讲的理论方法怀疑；对圣教怀疑是很大的障碍，它是根本烦恼“贪嗔痴慢疑”里面的一个。</p>\n<p>　　烦恼的来由也有很多方面，它可能是因为自己想做好的一件事没有做好，所以烦恼；也可能是是<a href=\"/remen/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>上遇到挫折，导致脑子好乱，自然烦恼就来了；也可能是<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>原因，家人有点唠叨，东说西说，有些说的比较难听，又不能顶嘴，不知道怎么办而烦恼，还有很多原因。</p>\n<p>　　烦恼会使人感到心烦意乱，会影响到自己的工作效率，要试着解决这些烦恼。</p>\n<p>　　烦恼是因为有些事没办法解决，又担心有不好的事情，心烦意乱心事重重就会生出烦恼。有时自己一人解决不了的事情，又须要别人帮助时也会烦恼，遇到不顺心的事时也会烦恼。所以只有静下心来了解事情的原因和真相，才能让心里不会那么多烦恼。只要不是一下子就要解决的事，就等等再说，事情可能以解决，烦恼也就没有了。</p>\n<h3>　　影响</h3>\n<p>　　乐观、开朗、积极、进取、沉稳、平静、<a href=\"/remen/kuanrong.html\" class=\"keylink\" target=\"_blank\">宽容</a>等等，相当于情商高、性格好。如果我们内<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>常感到焦躁不安、积郁不欢、疑神疑鬼、情绪失控、行动混乱，或者自私、虚荣、患得患失、勾心斗角、愤世嫉俗、玩世不恭等，心理就不<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，也即是说，负面的情绪和不好的心态是心理方面的疾病。</p>\n<h2>佛教对烦恼的概念</h2>\n<h3>　　内涵</h3>\n<p>　　烦恼，在一般人的观念中，通常是指内心的烦闷苦恼或焦虑不安。不过，在佛教中包含的范围要大得多，它不单指烦躁、苦闷、焦虑，还包括贪婪、执着、自私、傲慢、虚荣、妒忌、吝啬、错误的见解、怀疑、猜忌、<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>、愤怒、憎恨、残酷、反感、愚昧、无知、麻木、散乱等等。用通俗话来讲，就是负面情绪、不好的心理状态。</p>\n<h3>　　分类</h3>\n<p>　　根据佛教，我们所谓的<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>不外乎两大类：一类是自己的身心，一类是外境。自己的身心是什么呢？是指眼、耳、鼻、舌、身和意（<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>）。眼睛所看的是颜色、光等。耳所听的是声音；鼻所嗅的是气味；舌所尝的是味道；身体所碰触的是触觉，如软的、硬的、滑的、粗的、轻的、重的、冷的、暖的，还有痛、痒等。意所思维的是各种各样的现象。</p>\n<p>　　修学佛教的最根本目标就是要去除这些。如果一种方法不能断除烦恼，那就不是<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>的教导！佛陀不是叫你去求长生不老，不是叫你去求升天成仙，也不是叫你去求财、求名、求利、求官、求子、求对象、求升学、求保佑、求平安……不是这些，这些都不是佛教！</p>\n<p>　　佛陀教导我们要真正认识自己的身心，去除自己的烦恼，这才是佛教！如果只是为了求这个求那个，那么我们又何苦要<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>呢，何苦要<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>呢？真正的佛教不是叫大家有所求，有所求本身就是一种烦恼。佛陀是教导我们断除烦恼，包括断除有所求的心。</p>\n<p>　　或许有些人会这样说：“我为什么要学佛呢？我为什么要修行呢？你们佛教说人生是苦，有生老病死苦，但我就觉得很快乐。我还年青，没必要把自己想象得很老；我还健康，没必要无病装病；死亡对我来说也还很遥远，所以我认为没必要学佛。即使想学，也等我老的时候再打算。”</p>\n<p>　　是的，生老病死苦对于有些人来说确实没有很深刻的体验。然而，生老病死苦是现实人生的现象，它们只是结果，并不是原因。佛陀教导我们修行并不是从结果着手，而是从因下手。如果“平时不<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>，临急抱佛脚”是没有用的。就好像一个人平时不注意身心健康，花天酒地、暴食暴饮、<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>紊乱，等到身罹绝症时才临渴掘井已经太迟了。一个社会不推广卫生保健，只知道建造医院、诊所；一个国家不提倡民风、<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>，只知道设立警察、监狱，都是治标不治本的方法。</p>\n<p>　　同样的，人生是现实，苦是结果，而导致苦的原因是烦恼，烦恼才是元凶。要解决人生的根本问题，要脱离诸苦，唯有从烦恼下手。断除烦恼才是佛教修行的目标。只要一个人有病，就有治病的必要。只要一个人有烦恼，就有修行的必要。</p>\n<p>　　佛教的下手之处就是烦恼。如果一个人没有烦恼，他就没必要学佛，也没必要修行。佛教对他完全没有意义。就好像我身体很健康的话，就无须看医生，无须吃药。但是，正因为人有烦恼，有各种各样负面的心理、不良的心态，容易紧张，容易焦虑，容易执着，容易斤斤计较，容易患得患失，内心充满了自私、虚荣、苦恼等等，这些烦恼给我们带来了许多的痛苦。如果想要获得内心的平静，获得真正的快乐，就要想办法去除这些烦恼。</p>\n<p>　　想要去除烦恼，必须先了解烦恼，以及烦恼产生的原因，这样才好对症下药。虽然烦恼多种多样，但都可以归结为贪、嗔、痴三大类。</p>\n<p>　　什么是贪？贪就是指想得到东西，心黏着对象。</p>\n<p>　　什么是嗔？嗔就是心厌恶对象，不喜欢、讨厌、反感。从愤怒、凶狠、残酷，到忧郁、烦躁，都属于嗔。</p>\n<p>　　什么是痴？痴是心对目标的愚昧、盲目、无知。</p>\n<p>　　离开了眼、耳、鼻、舌、身和意，离开了颜色、声音、气味、味道、触觉，以及所想的东西，就无所谓的身心，无所谓的外境，也无所谓的世界。</p>\n<p>　　生活在这个世界，不外乎是自己的身心和外界的互动。眼睛看到好看的、美丽的东西，会产生愉悦的感受，认为对象是好的、是美的，接着会喜欢、爱着。若这种喜欢的心理进一步加强，会产生想要得到、拥有对方的心理。这种心理就是贪。</p>\n<p>　　同样的，当我们听到悦耳的音乐、别人的赞美，闻到清香、吃到美味的食物、触摸到异性细滑的皮肤等等时，贪欲很容易就生起。</p>\n<p>　　当一个人见到不喜欢的东西，听到难听的声音，闻到很臭的气味，吃到难吃的食物，或者天气酷热难耐的时候，就会产生厌恶的感受（苦受），认为对象是不好的、是坏的，内心会排斥、反感。若这种排斥的心理进一步加强，就会生气、恼怒，甚至会想要以粗暴的方式来对待，这种心理就是嗔。</p>\n<p>　　然而，无论贪也好，嗔也好，都包含了痴。痴就是无知、不了解，不了解事物、身心、世间的真相。因为有痴，贪、嗔才会产生。</p>\n<p>　　总之，贪婪、追求、执着、痴迷，还有邪见、傲慢、虚荣等，都是属于贪。发脾气、烦躁、妒忌、焦虑、憎恨等，都属于嗔；麻木、愚蠢、无知、恍惚等，属于痴。所有的烦恼都可归类为贪、嗔、痴。</p>\n<p>　　贪、嗔、痴三种烦恼，佛教称为三不善根，即一切烦恼的根本。</p>\n<p>　　所谓的烦恼，其实都是基于内心和外境这两方面的关系产生的。光有心而无外境，烦恼不会产生；光有外境而<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>，烦恼仍然不会产生。这是一对的关系：内心与外境的关系。贪嗔痴三种烦恼简单来说都是这一对的关系：</p>\n<p>　　当心黏着外境，喜欢对象，想拥有、占有对象时，叫做贪。</p>\n<p>　　当心不喜欢外境、排斥对象时，叫做嗔。</p>\n<p>　　因为不了解外境的本质，认为对象是好的，是可以得到快乐的，是可以满足自己的，这叫做痴。</p>\n<p>　　当我们明白了这一层关系：见到好的就想得到，见到不好的就想排斥……烦恼就这样产生了。</p>\n<p>　　烦恼又可依其表现的轻重程度分为三个层次：</p>\n<p>　　第一个层面叫做违犯性烦恼。违犯性的烦恼是一个人不良心理已经表现在他的行为上了。比如一个人暴怒到要杀人或者<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>；由于贪心而去偷别人的财物，去抢劫；打架，骂人、骗人、搬弄是非；为了往上爬而不择手段打压别人；沉迷于追求异性、玩弄感情、吃喝嫖赌。心里的烦恼已经显露在身体的行为、语言上，称为违犯性烦恼。这种烦恼是最粗的烦恼，已经在燃烧人的身心了。</p>\n<p>　　第二个层面叫困扰性烦恼，即一个人的烦恼只浮现在心里，还没表露出来，还没有付诸行动。这包括贪婪、执着、傲慢、自负、憎恶、烦躁、散乱、沮丧、麻木等。例如你很讨厌一个人，恨死他，但既没有采取行动，也没有说出来，只是在内心憎恨、厌恶他。又如你感到很焦虑、烦躁不安，但还不至于做出冲动的事情来。虽然在语言和行为上并没有表露出来，但内心已经被不良的心理、不好的情绪所占据，这叫做困扰性烦恼。</p>\n<p>　　第三个层面叫潜伏性烦恼。潜伏性的烦恼是指没有表露于行动、语言和内心的烦恼。也即是说，没有烦恼，但并不等于说已经完全没有烦恼了，它们只是以潜伏性的状态存在着。例如：当大家在做一件好事、善事时，生起的心称为<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。生起善心、做善事时可能不会感到烦躁，没有烦恼，但是只要遇到适合的条件，烦恼立刻就跑出来了。譬如大家很<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地坐在这里听佛法开示，暂时将工作放在一边，没有烦恼；但听完之后，一回到办公台，看到一大堆还没有完成的文件，立刻又心烦了，是不是？有些修行人可以静止不动地坐在那里入定好几个小时，甚至几天几夜，他的心很快乐地安住在定中。在他入定的期间，入定多长久就享受多长久的<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>快乐，完全没有杂念，更不用说烦恼了。但是当他出定后，当他看到了漂亮的东西、听到悦耳的声音、吃到美味的食物等等，内心难免会产生贪爱，这证明他的烦恼还没有完全被断除，只是在定中被<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>镇伏住而已。就好像草一样，到了冬天，所有的草都死了，干枯了；但只要根还在，一到春天，它又开始发芽了。又好像拔草一样，只把草拔出来，但根没有被拔掉，有机会它还是会生长出来。烦恼只要没有被连根拔除，它就以潜伏性的状态存在着，叫做潜伏性烦恼。</p>\n</div>"
    }
]