[
    {
        "title": "【佛光】的意思是什么？佛光是怎么形成的？",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x4F5B;&#x5149;&#x3011;&#x7684;&#x610F;&#x601D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F5B;&#x5149;&#x662F;&#x600E;&#x4E48;&#x5F62;&#x6210;&#x7684;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0112/20160112033202652.jpg\" /></p>\n<h2><a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>中说，佛光是释迦牟尼眉宇间放射出来的光芒。佛光还指一种光的自然现象，当阳光照在云雾表面，经过衍射和漫反射作用形<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>光的自然奇观。阳光将人影投射到云彩上，云彩中细小冰晶与水滴形成独特的圆圈形彩虹。</p>\n<h2>佛光词义</h2>\n<p>　　1．佛所带来的光明。佛教认为佛的法力广大，<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>犹如太阳破除昏暗，故云。《<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>宝王论》卷中：“金山晃然，魔光佛光，自观他观，邪正混杂。”</p>\n<p>　　2．谓佛像上空呈现的光燄。宋邵博《闻见后录》卷二八：“五台山佛光，其传旧矣。《唐穆宗实录》：元和 十五年四月四日，河东节度使裴度奏：五台山佛光寺侧，庆云现，若金仙乘狻猊，领其徒千万，自巳至申乃灭。”</p>\n<p>　　3．指佛像表面的光泽。明李贽《与城老》：“﹝寺庙﹞既幸落成，佛光灿然。”</p>\n<p>　　4．也称“峨眉宝光”。太阳相对方向处的云层或雾层上围绕人影的彩色光环。人背太阳而立，光线通过云雾区小水滴经衍射作用所致。常见于山区，中国峨眉山最常见。</p>\n<p>　　看上去是一个七彩光环。而人影在光环正中。而且人影随着人而动，变幻之奇，出人意外。自公元63年发现以来，不仅具有1900多年的悠久历史，并以世界奇观名驰中外。</p>\n<h2>佛教“佛光”传说</h2>\n<p>　　佛家认为，只有与佛有缘的人，才能看到佛光，因为佛光是从佛的眉宇间放射出的救世之光，吉祥之光。传说1600多年前，敦煌莫高窟建窟前曾闪现“金光”和“千佛”的奇异景象。那么，“金光”和“佛光”的出现，是“<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>显灵”。公元366年的一天傍晚，在中国西北部的甘肃省敦煌市附近的一座沙山上，“佛光”的一次偶尔呈现被一个叫乐僔的和尚无意中看到了。看到“佛光”的乐僔当即跪下，并朗声发愿要把他见到“佛光”的地方变成一个令人崇敬的圣洁宝地。受这一理念的感召，经过工匠们千余年断断续续的构筑，终于成就了人们今天看到的这座举世闻名的文化艺术瑰宝——敦煌莫高窟。在敦煌莫高窟第332窟李克让《重修莫高窟<a href=\"/remen/fokan.html\" class=\"keylink\" target=\"_blank\">佛龛</a>碑》的碑文上记载了这一段莫高窟创建的原始动机。文献有将“金光”解释为霞或因幻觉所见的“光象”，也有将它解释为“佛光”的，如余秋雨在其《文化苦旅》中用白话文对李克让《重修莫高窟佛龛碑》前半段，特别是对“乐僔……忽见金光，状有千佛”作了较为详细而生动的阐释。</p>\n<h2>佛光的自然现象</h2>\n<h3>　　概述</h3>\n<p>　　佛光的出现要阳光、地形和云海等众多自然因素的结合，只有在极少数具备了以上条件的地方才可欣赏到。夏天和初冬的午后，摄身岩下云层中骤然幻化出一个红、橙、黄、绿、青、蓝、紫的七色光环，中央虚明如镜。观者背向偏西的阳光，有时会发现光环中出现自己的身影，举手投足，影皆随形，奇者，即使成千上百人同时同址观看，观者也只能只见已影，不见旁人。在中国峨眉山金顶的摄身岩前，平均每五天左右就有可能出现一次佛光，时间一般为15:00-16:00。</p>\n<h3>　　特点</h3>\n<p>　　“佛光”发生在白天，产生的条件是太阳光、云雾和特殊的地形。早晨太阳从东方升起，佛光在西边出现，上午“佛光”均在西方；下午，太阳移到西边，佛光则出现在东边；中午，太阳垂直照射，则没有佛光。只有当太阳、人体与云雾处在一条倾斜的直线上时，才能产生佛光。它是太阳光与云雾中的水滴经过衍射作用而产生的。如果观看处是一个孤立的制高点，那么在相同的条件下，佛光出现的次数要多些。“佛光”由外到里，按红、橙、黄、绿、青、蓝、紫的次序排列，直径约2米左右。有时阳光强烈，云雾浓且弥漫较宽时，则会在小佛光外面形成一个同心大半圆佛光，直径达20-80米，虽然色彩不明显，但光环却分外显现。”“佛光”中的人影，是太阳光照射人体在云层上的投影。观看“佛光”的人举手、挥手，人影也会举手、挥手，此即“云成五彩奇光，人人影在中藏”，神奇而瑰丽。</p>\n<p>　　“佛光”出现时间的长短，取决于阳光是否被云雾遮盖和云雾是否稳定。如果出现浮云蔽日或云雾流走，“佛光”即会消失。一般“佛光”出现的时间为半小时至一小时。而云雾的流动，促使佛光改变位置；阳光的强弱，使“佛光”时有时无。“佛光”彩环的大小则同水滴雾珠的大小有关：水滴越小，环越大；反之，环越小。</p>\n<h3>　　地点</h3>\n<p>　　在中国的峨眉山、黄山、泰山、庐山等地，以及在德国的布罗肯山、英国的维尼斯山等人们都能经常欣赏到“佛光”的风采；若乘飞机在云彩上飞行，遇上好的天气，眼睛注视飞机影子落在云上的地方或方向，人们几乎随时都可看到“佛光”的呈现。</p>\n<h3>　　成因</h3>\n<p>　　关于佛光成因，有“复杂散射”学说，也有“先反射，后衍射”学说，还有“先衍射，后反射”学说，不一而足。由于存在一些缺陷，至今尚有争议。用光学的知识解释，就是光源(通常为太阳光)从观察者身后射来，在穿过无数组前后两个薄层的云雾滴时，其间的前一个云雾滴层对入射阳光产生分光作用，后一个云雾滴层则对被分离出的彩色光产生反射作用。反射光向太阳一侧散开或汇聚，任一个迎接那些汇聚而来的光线的着眼点(即站在太阳和云雾之间的人)，都可见到略有差异的环形彩色光象，这就是佛光。只要光照较强，云雾滴半径较小，大小均一，一般都可见到多个光环明亮程度不同，但色彩排列顺序相同的“佛光”，一般都为4圈，因最外层的第4个光环圈光强过弱，通常情况下即使出现，人眼亦难于分辨。</p>\n<h2>佛光的实质</h2>\n<p>　　实际上，佛光是光的自然现象，是阳光照在云雾表面所起的衍射和漫反射作用形成的。夏天和初冬的午后，摄身岩下云层中骤然幻化出一个红、橙、黄、绿、青、蓝、紫的七色光环，中央虚明如镜。观者背向偏西的阳光，有时会发现光环中出现自己的身影，举手投足，影皆随形，奇者，即使成千上百人同时同址观看，观者也只能只见已影，不见旁人。谭钟岳诗云：“非云非雾起层空，异彩奇辉迥不同。试向石台高处望，人人都在佛光中。”</p>\n<p>　　佛光是一种非常特殊的自然物理现象，其本质是太阳自观赏者的身后，将人影投射到观赏者面前的云彩之上，云彩中的细小冰晶与水滴形成独特的圆圈形彩虹，人影正在其中。佛光的出现无原则要阳光、地形和云海等众多自然因素的结合，只有在极少数具备了以上条件的地方才可欣赏到。峨嵋山舍身岩就是一个得天独厚的观赏场所。19世纪初，科学界便把这种难得的自然现象命名为“峨嵋宝光”。在金顶的摄身岩前，这种自然现象并非十分难得，据统计，平均每五天左右就有可能出现一次便于观赏佛光的天气条件，其时间一般在午后3：00-4：00之间。</p>\n</div>"
    }
]