[
    {
        "title": "【佛龛】是什么意思？佛龛摆放位置及禁忌",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x4F5B;&#x9F9B;&#x3011;&#x4F5B;&#x9F9B;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x9F9B;&#x6446;&#x653E;&#x4F4D;&#x7F6E;&#x53CA;&#x7981;&#x5FCC;\" src=\"https://www.liaotuo.com/uploadfile/2018/1127/20181127052200105.jpg\" title=\"&#x3010;&#x4F5B;&#x9F9B;&#x3011;&#x4F5B;&#x9F9B;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x9F9B;&#x6446;&#x653E;&#x4F4D;&#x7F6E;&#x53CA;&#x7981;&#x5FCC;\" /></p>\n<h2><a href=\"/remen/fokan.html\" class=\"keylink\" target=\"_blank\">佛龛</a>怎么读？佛龛是什么意思？</h2>\n<p>　　佛龛读作「fó kān」。佛龛是指供奉佛像的小阁子，一般为木制。龛原指掘凿岩崖为空，以安置佛像之所。据《观佛<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>海经》卷四记载，一一之须弥山有龛室无量，其中有无数化佛。《大毗婆沙论》卷一七七记载：底沙佛至山上，入吠琉璃龛，敷尼师檀，结跏趺坐，入火界定。现今各大<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>遗迹中，如印度之阿旃塔，爱罗拉，我国云冈、龙门等石窟，四壁皆穿凿众佛菩萨之龛室。后世转为以石或木，作成橱子形，并设门扉，供奉佛像，称为佛龛；此外，亦有奉置开山祖师像。</p>\n<h2>佛龛摆放位置及<a href=\"/foxue/changshi/153461.html\" class=\"keylink\" target=\"_blank\">禁忌</a></h2>\n<p>　　佛龛的摆放位置很重要，也很有讲究，但是也有部分人不懂得如何正确的摆放佛龛。在家敬佛<a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>，把佛像请回家中，是虔心修佛的一种很好的方式。有佛龛盛放的佛像更是值得尊敬的佛，因为不是所有的佛像都带有佛龛的。古语有云，佛龛乃佛的棺材，佛像即佛本身。</p>\n<p>　　那么佛龛，根据大小确定佛龛摆放位置。基本的佛龛摆放位置，当然得高处正堂当中，佛龛需摆放于方桌上，方桌上得摆个架子似的东西。佛龛摆放位置的前面摆上香炉，水果等贡品。佛龛的形状各异，多见方形，当然也有半圆型，有时佛龛还有各种花纹。我们得根据这些来决定佛龛摆放位置。比如，是半圆型佛龛，那么背墙应挂相应的帘布，衬托佛龛的圆边。佛龛摆放位置的方位，是朝大厅大门，而建筑学上大门一般是朝南，所以佛龛自然也是面朝南了。此外，我们还需注意佛龛摆放位置的背后不得为厕所、厨房等杂物之所。</p>\n<p><strong>　　对于详解的佛龛摆放位置，有以下几点：</strong></p>\n<p>　　1.要由里朝外，佛龛或神台由家里面向门外摆放，由厅向外摆放。也就是说要对着大门，但如受环境的限制不能达到这个要求时，也应把他向着大门口的方向，忌冲门，即一进家门就见佛龛或神台（指离门太近），要和门保持一定的距离。</p>\n<p>　　2.宜在静方，安放的地方要清静，整洁。佛龛或神台附近最好不要有音响，电视机等东西。</p>\n<p>　　3.不可对着床铺。不可对着餐桌。厨房，厕所，因菩萨见不得不雅的行为和荤腥之类。如条件所限，有的把佛龛或神台放在卧室，那么在睡觉时要拿个黄布帘挡上。</p>\n<p>　　4.佛龛或神台要有靠，背后不能空虚。靠墙的隔壁不能是厕所，厨房。</p>\n<p>　　5.佛龛或神台忌在横梁下。</p>\n<p>　　6.如条件许可，设置的佛龛或神台不能太低，高度要适中。</p>\n<p>　　7.供奉的数目，逢单，不可逢双，如供菩萨和其他神明，要菩萨在上神明在下，因神明的档次要底于菩萨，佛和菩萨是至高无上的。</p>\n<p>　　8.佛龛或神台的方位：一般不要放在家中的正南方正西方（此方位稍偏一下也可以），其他方位皆可，最好根据其家里的<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>布局来决定。</p>\n<p>　　9.供奉佛和菩萨最好坐西向东。</p>\n<h2>佛龛的历史发展</h2>\n<p><strong>　　源于建筑又精于建筑</strong></p>\n<p>　　《说文》记载，“龛”在古时并没有后来的含义，汉扬雄著《方言》四称：“龛，受也。”即容纳、盛受之意。佛教传入中国后，龛又指掘凿岩崖为室，安置佛像，即供龛。在中国云岗、龙门、敦煌等石窟中均能见到。此后，又出现了将石、木或其他材料做成橱子形小阁供奉佛像，但大都是与佛堂建筑同期进行，尺寸上有一定规范的较大佛龛。而在故宫中，独立于建筑主体之外，可随时拆迁并与佛像有多种组合关系的小型供龛，则在数量、样式和艺术特征上远远超过了传统的佛龛。</p>\n<p>　　乾隆时期，承做供龛的事项主要记录在《活计档》的“金玉作”、“匣裱作”、“油木作”、“广木作”、“珐琅作”及“如意馆”等档案中。尽管雍正时期档案中已有大量制龛活动的记载，但现存实务并不多见。目前，故宫中珍存的供龛多属乾隆时所作，样式和装饰内容融汇满、蒙、汉、藏<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>和<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中众多艺术元素。据乾隆年间档案的记载可知，宫中佛龛制作遵循着传统的审定方式。</p>\n<p><strong>　　制作需皇帝亲自监督</strong></p>\n<p>　　当内务府官员将佛像及供龛呈皇帝时，皇帝首先会降旨将“法身梅洗，开脸，像染青发”，然后让造办处为佛像配龛，然后让如意馆或中正殿按皇帝意图绘画纸样，贵重的金银质地佛龛还要先做出模型，皇帝常会提出一些意见，令其修改后再次呈览，有时反复多次，直至满意后开始制作。内务部所属各部门按照分工性质承揽活计。如“钱粮库”筹备制龛用的各类材料，“广木作”、“油木作”、“匣裱作”承做各式木龛，除制龛、罩油、镶嵌外，还要进行红片金或黄缎裱里，龛背后刻四体字样等工序；“金玉作”承造各式金、银质地佛龛以及各类镶嵌工艺；“珐琅作”承造珐琅龛及珐琅装饰物；“如意馆”除绘画供龛纸样外，还负责各种玉饰雕刻工艺。一座制作精美的供龛通常需要由造办处多个部门协作完成。</p>\n<p>　　供龛制成后，最后的验收者往往是皇帝本人。不要小看皇帝的审美能力和对工艺细腻程度的苛求，工匠们因制龛不能令皇帝满意而遭罚俸禄之事时有发生。从“用材不好”、“大小不合”到“做工粗糙”，都有可能成为受罚的原因。乾隆十三年（1770年）7月就发生了这样的事：当造办处“金玉作”为皇太后万寿节所制四座供龛呈览给乾隆时，皇帝认为“佛呙做小了，又糙，片金里为何不用好圆金片做”等，降旨将相关责任人“并该作俱议不是”，结果，相关人分别被罚俸禄六个月、罚钱粮六个月。惩罚如此严厉的原因却极为简单：此龛是特地为皇太后八十大寿制作的，而皇太后又崇佛至极，<a href=\"/ctwh/shi/lsrwzj/qianlong.html\" class=\"keylink\" target=\"_blank\">乾隆皇帝</a>是至孝之君人尽皆知，岂能容忍制龛之事有半点闪失？此事也足见皇帝对供龛制作的重视。</p>\n<h2>佛龛样式</h2>\n<p>　　著名建筑史学家刘致平曾指出：“我国对于龛、藏、石灯、纪念柱、香炉等小物品，通常是用小型房屋来解决造型问题，这是一种习惯，也是有将小物大作的意思，显得格外精巧。”</p>\n<p>　　的确，在清宫中佛龛不仅以‘房屋’造型占很大比例，其中又以模拟官式建筑者为大宗，如宫殿式龛、楼阁式龛、亭式龛和各式塔龛等。清宫佛龛的价值并不仅仅在于其本身是建筑的某个类别，更重要的是由于中国古代建筑多为木制难以长期保留，因此佛龛作为建筑缩影的价值就更显珍贵。</p>\n<p>　　在清宫佛堂的显要位置，通常放置拟宫殿样式并完全按照实体比例微缩制成的佛龛。上为屋顶，常刻有斗拱，中为柱身，内供佛像；下为基座，常用须弥座。其间每个细节并非随意设计，而是具有强烈的伦理特征，体现着封建社会森严的等级制度。如屋顶的式样、装饰物走兽的数量以及斗拱、彩画纹样等，都一一有严格规定。</p>\n<p>　　除了宫殿式供龛之外，故宫中数量居众、样式颇多的是拟宗教建筑造型供龛，其中又以塔式供龛最为引人注目。塔是随佛教而传入我国的一种建筑类型，清宫造办处的工匠从历史文献、壁画、石刻中汲取丰富的营养，所制塔龛样式除传统的楼阁式、重檐式等外，还有许多大胆变体以及结合体式，其中最具清宫特色的是“三塔龛”和“五塔龛”，综合了汉藏两地的典型建筑，顶部排列三尊或五尊<a href=\"/remen/lama.html\" class=\"keylink\" target=\"_blank\">喇嘛</a>合欢塔，代表“三世佛”或“五佛五智”之意。</p>\n<p>　　此外，还有类似僧人苦修的“草庐”式龛，有些甚至还变幻出莲蓬的外形，专家称其创作灵感可能来自石窟壁画或西藏唐卡。总之，宫廷工匠利用其高超技艺，将各地宗教建筑的代表性特征浓缩到宫中的佛堂之中。</p>\n<p>　　此外，拟园林式建筑造型的佛龛也很常见。其中的点睛之作便是亭式龛，其写意手法极尽想象与创造之能事，成为清宫供龛中最富变化和观赏性的样式。拟亭式造型供龛又分为园亭式、四方亭式、长方亭式以及四角、六角、八角亭式等。其顶部的变化最为丰富多彩，有歇山、悬山、攒尖、盝顶等，一些飞檐设计更是变幻奇突，轻巧美妙。</p>\n<p>　　除了上述造型外，还有拟传统器物造型的供龛。如屏风式龛，灵感来自西藏唐卡的“漆泥子佛挂屏龛”则是独具清宫特色的装饰屏风。这种形式后来还被发展为全部以无量寿佛为主题的挂屏式龛，作为皇太后或皇帝的祝寿之器。此外，葫芦形龛也是清宫佛堂的常见供龛样式，它以葫芦及其变体为载体，内供佛像常以3、6、9或9的倍数为一组出现。之所以选用葫芦形，是因为传统认为葫芦多籽，藤蔓绵延不绝，象征子孙繁衍，生生不息。此外葫芦还因“福、禄”的谐音成为“福禄万代”的吉祥物，因此在清宫中有大量器物选用葫芦造型。令人惊异的是，这种造型被供龛制作者采用，而且供奉的是藏传佛教尊神，恰好表明了清朝诸帝认为的儒、释、道三教“理同出于一原，道并行而不悖”的观念。此外，在乾隆中晚期造龛档案中，开始频繁出现“西洋式龛”的记载，成为一种独特的风格。装饰上也使用了大量“西番莲纹”、“西番葡纹”、“西番花草纹”等，营造出浓郁的西洋情调。</p>\n</div>"
    }
]