[
    {
        "title": "【佛塔】-佛教佛塔",
        "date": "2016-03-10",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"299\" src=\"https://www.liaotuo.com/uploadfile/2016/0310/20160310043224498.jpg\" width=\"407\" /></p>\n<h2>佛塔（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　佛塔，亦称宝塔，原是印度梵文Stupa（窣堵波）的音译，还有称为<a href=\"/remen/futu.html\" class=\"keylink\" target=\"_blank\">浮屠</a>，即来源“Buddastupa”，藏语称“藏文”（曲登），佛塔最早用来供奉和安置<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>、经卷和各种法物。许多佛塔会刻有建塔碑记﹑圣像﹑<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>等。</p>\n<p>　　根据佛教文献记载，<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>释迦牟尼<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后的舍利，被分成八万四千份，在世界各地建塔加以供奉。我国的上万座佛塔，是古代高层建筑的代表，其用料之精良、结构之巧妙、技艺之高超、类型之丰富，远远超出了历代文人墨客的笔端。</p>\n<h2>名称由来</h2>\n<p>　　在公元一世纪佛教传入我国以前，我国没有“塔”这种建筑，也没有“塔”字。</p>\n<p>　　当梵文的stupa与巴利文见Thupo传入我国时，曾被音译为“塔婆”、“佛图”、“浮图”、“浮屠”等，由于古印度的Stupa是用于珍藏佛家的<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>和供奉佛像、佛经之用的，亦被意译为“方坟”、“圆冢”，直到隋唐时，翻译家才创造出了‘‘塔’’字，作为统一的译名，沿用至今。</p>\n<h2>佛塔种类</h2>\n<p>　　按层级分：三十七重塔﹑十七重塔﹑十五重塔﹑十三重塔﹑九重塔﹑七重塔﹑五重塔﹑三重塔等。</p>\n<p>　　按形状分：方塔﹑圆塔﹑六角形塔﹑八角形塔等，另有大塔﹑多宝塔﹑瑜祗塔﹑宝箧印塔﹑五轮塔﹑卵塔﹑无缝塔﹑楼阁式塔﹑密檐塔﹑金刚宝座塔﹑墓塔﹑板塔婆﹑角塔婆。</p>\n<p>　　按所纳藏之物分：<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>﹑发塔﹑爪塔﹑牙塔﹑衣塔﹑钵塔﹑真身塔﹑灰身塔﹑碎身塔﹑瓶塔﹑海会塔﹑<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>万灵塔﹑一字一石塔﹑籾塔等。</p>\n<p>　　按建筑材料分：砖塔﹑石塔﹑玉塔﹑沙塔﹑泥塔﹑土塔﹑粪塔﹑铁塔﹑铜塔﹑金塔﹑银塔﹑水晶塔﹑玻璃塔﹑琉璃塔﹑宝塔﹑香塔。</p>\n<p>　　按性质意义分：祈福塔﹑报恩塔﹑法身塔﹑寿塔。</p>\n<p>　　按塔排列位置之样态分：孤立塔﹑对立式塔﹑排立式塔﹑方立式塔﹑拱立式塔﹑分立式塔。</p>\n<p>　　按样式分：覆钵式塔﹑龛塔﹑柱塔﹑雁塔﹑屋塔﹑无壁塔﹑<a href=\"/remen/lama.html\" class=\"keylink\" target=\"_blank\">喇嘛</a>塔等。[1]</p>\n<h2>历史</h2>\n<h3>　　起源</h3>\n<p>　　佛塔的造型起源于印度。根据佛教文献记载，佛陀释迦牟尼涅槃后火化形成舍利，被当地八个国王收取，分别建塔加以供奉。另外，还在释迦牟尼一生中有纪念意义的八个地点，如诞生处的兰毗尼花园、成道处的尼连禅河、首次<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>处的鹿野苑、安居处的祗陀园，从忉利天下处的桑迦尸国曲女城，化度分别僧处的王舍城、将入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>处的毗耶离城，涅盘处的拘尸那城，建造了八大灵塔，依次称作聚莲塔、<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>塔、吉祥塔、神变塔、天降塔、和平塔、胜利塔、涅槃塔，这些塔都是有纪念意义的。在青海塔尔寺建有善逝八宝塔，西藏布达拉宫建有如来八塔也都是为纪念释迦佛八大事迹而建造的。</p>\n<h3>　　发展</h3>\n<p>　　印度在阿育王统治时期，佛教被列为国教，塔的建立达到了空前的高潮，在孔雀王朝所统领的小邦国内分建了八万四千座佛塔，这时期始造覆钵式的塔。塔分两种，有舍利者称塔，无舍利者称支提（caitya），现存时间最早的塔始建于阿育王时期。</p>\n<h3>　　传入中国</h3>\n<p>　　汉代，随着佛教传入中国，佛塔的建筑在东汉末年，就已经风行全国了。据《<a href=\"/ctwh/shi/24s/houhanshu.html\" class=\"keylink\" target=\"_blank\">后汉书</a>》记载，汉末三国时期，丹阳人笮融“大起浮屠，上累金盘，下为重楼，有堂阁周回，可容三千许人”，这些描述真实地记载了当时佛塔建筑的宏大与华丽。佛塔随着佛教自一世纪传入中国后，中国的工匠们将印度原有的覆钵式塔的造型与中国传统的楼阁相结合，便产生了楼阁式的佛塔，继而由楼阁式衍生出密檐式塔。</p>\n<p>　　我国幅员辽阔，不同地区具有不同的地域文化特点，因此便派生出了各种不同风格、不同式样的佛塔，并且佛塔的内容还被延伸，具有了更广泛的意义。中国佛塔的种类非常多，在材质方面有石塔，木塔，砖塔，玻璃塔等，塔的高度从数寸之小到数十丈都有，如吴越王所制之宝箧印塔高不过数寸，而魏献文帝时所造之永宁寺塔则号称百丈，为中国之第一高之塔。一般来说，不论佛塔的形态、大小如何，它的基本造型是由塔基、塔身、塔刹组成的。塔基有四方形、圆形、多角形，塔身以阶梯层层向上垒筑，逐渐收拢。在中国，若论塔的数量和它们形式的多样，风格的丰富，可以说在世界上也是绝无仅有的，各种极富有建筑装饰美感的塔，与山川、河流、村落共同构筑了中华民族独特的人文自然景观。</p>\n<h2>建筑特点</h2>\n<h3>　　早期佛塔</h3>\n<p>　　早期的佛塔是一个半圆形的大土冢，完全是坟墓的形式。现存比较完整的印度桑奇大塔，中央是复钵形塔体的方形平台和三层伞盖，塔的底部有基台和围栏，前面有阶梯上下。最外层还有绕塔围栏，围栏的四面各有一个牌坊状塔门。在东南亚爪哇，约在八世纪后半期，出现了一座窣堵波，它是当时苏门答腊赛林多罗王朝统治时期建造的。这座婆罗浮屠，自下而上包括：第一部分，作为塔基的极大的正方形石台，上有凸角堡。第二部分是在这平台上的五层高坛，向上逐层缩小，在上下各坛的壁面上，装饰着小系列壁龛，其内有数目相同的佛像，婆罗浮屠整个建筑所有壁皇共四百之三十六座，佛像的数目亦与此数相等。第三部分，在第五层高坛之上，有一个三级梯阶的环形平台，周边耸立着七十二座钟形的小舍利塔。第四部分，在最顶层的中央，为此窣堵波本身的半球形圆顶。这座巨大的建筑，表现了印度尼西亚民族卓越的艺术天才。</p>\n<p>　　在中国，一般立在寺院中的塔是由覆体式发展、演变而来的。东汉时期，随着佛教的传入中原，佛塔的建造也开始了。早期的佛塔，基本上都是中国建筑形式的楼阁式塔，其次有覆体式、密檐式、金刚宝座塔等等。</p>\n<h3>　　覆钵式塔</h3>\n<p>　　又称喇嘛塔，为藏传佛教所常用。这种塔的塔身是一个半圆形的覆体，这当然是源于印度佛塔的形式。覆体上是巨大的塔刹，覆体上建一个高大的须弥座。这种塔在元代开始流行，明清时期继续发展，这是和喇嘛教在当时盛行相联系的。元代设两层须弥座，明代袭之，但比例增高，清代多数只用一层须弥座。元代比例肥短清代则较瘦高，正面增设“眼光门”，内置佛像。塔身与基座之间，元代多施莲瓣一层，其上为小线道数层，线道内或夹以莲珠。明代仍沿此制。清初则改为金刚三层，不用莲瓣。塔顶最下层为塔脖子。元明较粗壮，清代较细。其上为十三天，应是相轮的变体，一般为十三层。元、明比较肥短，清代则细若铎柄。角上为圆盘，元明铜盘垂流苏，清代更为两层天地盘。最上为宝珠和铜塔。清代多用日、月、火焰。这里就一百零八塔来看看这种塔的造型与特征：一百零八塔在宁夏青铜峡市青铜峡水库西岸向东的山坡上，此地原本遍布寺庙，因河水淹没仅有塔林，以塔数而名之曰一百零八塔。此塔按几何图形依山势排列成下宽上尖的等腰三角形，最高端是一座形制最大的塔，塔身如同复钵，塔顶是宝珠，底座是八角形束腰须弥座，塔林自上而按1.3.5……奇数排列成12层，每层塔前用砖砌护墙一道。塔体分为四种类型，一层塔身复钵式，二、三、四层为八角鼓腹锥顶状，五、六层呈葫芦状，七一十二层呈宝瓶状。这一百零八塔是中国古塔建筑中唯一整体布局为三角形的大型塔群。这一古塔群建筑年代不详，据最新考古成就认为，是建于西夏时期。形制与北京妙应白塔相似。综合塔的结构，形制特征，承佛教喇嘛塔。</p>\n<p>　　著名的有北京北海白塔、山西五台山塔院寺大白塔、宁夏青铜峡市一百零八塔等。</p>\n<h3>　　楼阁式塔</h3>\n<p>　　楼阁式塔的形式来源于中国传统建筑中的楼阁，这种塔在中国古塔中历史悠久，形体最高大，保存数量也最多。早期楼阁式塔应为木结构，因为易于毁于火灾，所以实物没有能够保存下来。最早的楼阁式塔见于南北朝的云冈和敦煌石窟的雕刻中。隋唐以后，多用砖石为建塔材料，出现了以砖石仿木结构的楼阁式塔。它们的特征是：每层之间的距离较大，塔的一层相当于楼阁的一层，各层面大小与高度，自下而上逐层缩小，整体轮廓为锥形。楼阁式塔的平面，唐代为方形，宋、辽、金时代为八角形，宋代还出现过六角形。明、清时代仍采用八角形和六角形。塔的结构，唐代为单层塔壁，中空，内部呈筒状，设木楼梯、楼板。宋、辽、金各代均在塔的中心砌“砖柱”。柱与塔壁之间为登临的楼梯间或塔内走廓。底部设简单台基，宋以前多不用基座。塔身每层都砌出柱、额、门窗。唐代用方柱和八角柱。辽、宋多用圆柱，栏额之上用普柏枋。各层檐下都用砖或石制成斗拱，式样与当时的木结构相似。木结构楼阁各层有平座及栏杆，但砖石楼阁式塔，南北朝至唐代多不用平座，宋、辽、金始用平座。</p>\n<p>　　早期著名的楼阁式塔如西安大雁塔、山西应县木塔、河南开封祐国寺铁塔、杭州<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>塔、银川海宝塔、四川沪州报恩塔等等。</p>\n<h3>　　密檐式塔</h3>\n<p>　　密檐式塔的第一层较高，以上各层骤变低矮，高度面阔亦渐缩小，且愈上收缩愈急，各层檐紧密相接，故名。整体轮廓呈炮弹形。</p>\n<p>　　现存最古的砖塔河南登封县的嵩岳寺塔即属于密檐式塔。此塔也是中国现存古塔实物中年代最早的，该塔修建于北魏永平二年（509年）。嵩岳寺塔是由木结构向砖石结构过渡的早期实例，非常值得重视。嵩岳寺塔的总高度约30米，底层直径10.6米。全塔除塔刹和基石之外，均以砖砌筑。塔的下部是低平的基台，台上建塔身，塔身平面呈十二边形，这在全国是唯一的例子。第一层塔身特别高大，用叠涩平座将之分为上下两段，在四个正面开了贯通上下段的塔门。下段的其余八面都是素面平砖，没有加以装饰。上段是整个塔装饰最集中的地方，分别装饰壶门、狮子、火珠垂莲。第一层塔身以上，叠涩出密檐十五层，每层塔檐之间距离甚短。塔刹用石雕刻而成。刹座是巨大的仰莲瓣组成的须弥座，须弥座上承托着梭形的七重相轮组成的刹身，刹顶是一个巨型的宝珠。篙岳塔的外形流畅、秀丽，艺术成就非常高，正是由于它的设计和施工的优秀，使得这座古塔保存至今。其他像西安小雁塔、云南大理千寻塔也是密檐式塔中的精品。</p>\n<h3>　　金刚宝座塔</h3>\n<p>　　其造型仿照印度菩提迦耶精舍而建。塔的下部是为一方形巨大高台，台上建五个正方形密檐小塔（代表<a href=\"/remen/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>五方五佛）。这种塔在中国从明代以后陆续有修造，但是数量很少，全国现存十多处。著名的有北京真觉寺金刚宝座塔、北京碧云寺金刚宝座塔、内蒙古呼和浩特市慈灯寺金刚座舍利宝塔等。其中内蒙古慈灯寺的金刚座舍利塔，俗称五塔寺。建于清雍正年间。塔由塔基、金刚座和顶部的五座玲珑宝塔组成。金刚座建在塔基上，座下部是须弥座；束腰部分是砖雕狮、象、法轮、金翅鸟和金刚座柞等图案花纹；上半部有119尊鎏金小佛；拱门上有用蒙古、藏、汉三种文字刻成的“金刚座舍利宝塔”汉白玉石匾额。门内为无梁殿，东南角有通向座上的阶梯。五塔建于座上，当中塔高8.7米，为七层，四角小塔略低各为五层。塔身第一层均塑一佛、二菩萨及菩提树、景云图象，第二层以上为千<a href=\"/remen/fokan.html\" class=\"keylink\" target=\"_blank\">佛龛</a>。建筑工艺技巧精细娴熟，宝塔显得玲珑秀丽。塔后照壁嵌有蒙古文天文图石刻。</p>\n</div>"
    }
]