[
    {
        "title": "佛堂",
        "date": "2016-03-16",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0316/20160316035302269.jpg\" /></p>\n<h2>佛堂（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　字面意思有两个 一是佛所住的堂殿 一是指供奉佛像的堂殿﹑堂屋。</p>\n<h2>佛堂词义</h2>\n<p>　　拼音:fó táng</p>\n<p>　　词性:〖名〗</p>\n<p>　　词义:</p>\n<p>　　1.佛所住的堂殿。《毗奈耶杂事》卷二六“即以右足踏其香殿” 唐 义浄 注：“西方名佛所住堂为健陀俱知。健陀是香，俱知是室。此是香室、香台</p>\n<p>　　、香殿之义。不可亲触尊颜，故但唤其所住之殿，即如此方玉阶、陛下之类。然名为佛堂、佛殿者，斯乃不顺西方之意也。”</p>\n<p>　　2.指供奉佛像的堂殿﹑堂屋。清 陈维崧 《江城子·鲍让侯载酒泛舟小泊城南诸寺纪所见》词：“蓦遇娇红澹粉佛堂边。恰似湿云倚一朵，扶不定，竹栏前。” 张天翼 《儿女们》二：“走过佛堂的时候他瞟了那边一眼，瞥见五姨太太在敲着木鱼念经。”</p>\n<h2>佛堂镇的来历</h2>\n<p>　　佛堂镇的来历，有着神奇的传说。</p>\n<p>　　据《傅大士文集*嵩头陀传》和《（嘉庆）义乌县志》记载，相传在南北朝时，<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国有位嵩头陀，名字叫达摩的，在南朝梁代武帝天监年间（公元502-519年）到了乌伤，居住在香山的岩谷<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>中。后来，达摩云游到松峭山，与梁朝侍郎乌伤人楼偃相遇，两人志趣相近，谈得很投机，达摩就邀请楼偃次年回乌伤募建香山寺，楼偃欣然应允。寺建成后，达摩就成了寺中的方丈。</p>\n<p>　　梁代普通二年（公元521年）3月14日，达摩到附近村庄参加斋会，斋会结束后，达摩就不肯回寺，众人苦苦相留，达摩说：“贫僧缘会而来，缘尽而去。”众人见达摩去意已决，只得挥泪送别。</p>\n<p>　　达摩向南而去，到了金山。当时，由于连日暴雨，江水猛涨，有的堤岸已冲开缺口，洪水无情地淹没了田野，地势低洼的村庄也浸在水中，村民有的爬在屋顶，有的爬在树上，有的已被洪水冲走，在水中挣扎，情况十分危急。江上虽有几只木船，面对惊涛骇浪，都泊在堤岸边，畏缩不前。</p>\n<p>　　达摩是一位高僧，<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>广大，面对此情此景，口念<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>，把随身携带的铁鱼磬（一种用铁制成，形如鱼的<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>）抛入空中，只见铁鱼磬放出万道光芒，变成一只木船飘入江中。达摩又伸手一指，木船就向被洪水围困的百姓快速驶去，船在汹涌的波涛中，迂回曲折，直至把所有受难的百姓全部救起送到堤岸上，达摩才收回铁鱼磬，并把一把雨伞放在水上，自己坐在伞上飘流过江，到稽亭塘点化傅翕（即后来的傅大士）去了。</p>\n<p>　　为了感谢达摩救人的大恩大德，老百姓建了一座渡磬寺，供人们<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>膜拜。寺中有一楹联：“<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>透彩传万代，堂烛生辉照四方。”人们就以上下联的第一字，取地名为“佛堂”，而渡磬寺又称古佛堂。</p>\n<p>　　佛堂人民十分珍惜这座古寺，几经修缮，几经重建，渡磬寺至今仍完好保留在镇西。（楼益圣 搜集整理）</p>\n<h2>今日佛堂</h2>\n<p>　　佛堂镇现为省27个“小城市培育”试点之一。全镇区域面积134.1平方公里，辖106个行政村，3个居委会，户籍人口8.15万，<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>人口18.55万，建成区常住人口集聚率68.15%。2011年实现地区生产总值55.6亿元，工农业总产值201.47亿元，财政总收入5.8亿元，城镇居民人均可支配收入34250元，农民人均纯收入19251元。佛堂镇是义乌市建设国际性商贸城市副中心，义西南经济、文化、旅游发展中心，处在义乌“一体两翼”发展战略义西南“一翼”的西北位置，是义西南产业带的重要产业组团。六大交通干线纵横成网（杭金衢、金丽温、03省道、涌金、金义东快速通道，浙赣线），交通便利，区位优势明显。</p>\n<p>　　佛堂亦为农业大镇，佛堂镇大力发展效益农业、设施农业、都市农业，农业产业化进程不断加快。三年来，围绕高效生态农业建设目标，积极推进现代农业综合区和粮食功能区建设，在建成省级高效生态农业示范园区的基础上，启动面积2万亩的省级现代农业综合区项目，形成义红果蔗、正红富硒葡萄等一批省级名牌；大力推动农业规模化经营，拥有国家级农业龙头企业1家，省级农业龙头企业2家，金华市级农业龙头企业7家，义乌市级农业龙头企业27家；扎实推进土地<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>，全镇农村土地集中流转率达62.15%，真正实现农业增效、农民增收。</p>\n<p>　　佛堂镇商业繁荣，公共服务功能不断完善，区域商贸业资源洼地逐渐形成，建有大型商贸中心4个，年总营业额达5700万元，1000米以上商业街6条，综合性集贸市场2家，随着人流、物流、现金流的集聚，也吸引了工商银行、农业银行等6家金融机构在佛堂设立了营业网点，城市化进程不断加快。</p>\n<p>　　佛堂镇基础设施完善，城市功能健全，交通、供水、供电、排污、公交、医疗卫生、文化娱乐等基础设施完备，城市品位不断提升。《佛堂镇总体规划（2009－2020）》、《佛堂镇土地利用总体规划》、《佛堂镇城市道路网专项规划》等一系列规划相继通过论证和批准，明确了到2020年建成区面积达28.5平方公里，城镇人口达26万的发展目标，拉开了“五纵三横一环十三连”的城市骨架路网。三年来，供水排污管网、农村联网公路、消防大楼等基础设施逐步建成投用，建有自来水厂和污水处理厂各1座，日供水和处理污水分别为6万吨和4万吨，垃圾处理站6个，垃圾集中处理率达100%；教育文化卫生项目建设步伐加快，二中、三小相继建成，镇幼顺利开工建设，大成中学扩建工程有序推进，中心卫生院、敬老院完成改造，双林、工业功能区、田心垃圾中转站建成投用，养老中心、全民健身中心积极筹建；人才高地建设有效开展，总投资近3亿元的创新基地一期研发大楼即将结顶；民生工程稳步推进，安居工程、道院山生态园、乌皮塘生态景观公园、恐龙蛋遗址公园等一系列城市配套项目顺利实施，佛堂城市功能日臻完善，城乡面貌明显改善，居民<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>环境日益美化，一个规划有序、布局合理、功能完善的现代化新型城市雏形基本形成。</p>\n<p>　　佛堂镇自2009年2月启动扩权强镇改革以来，全面承接市里下放的村庄建设规划审批、<a href=\"/remen/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>登记等112项县级社会事业管理权限，并落实到镇365便民服务中心窗口统一办理，方便了群众办事，畅通了办事渠道，缩减了办事时间，降低了办事成本。截至2011年底，共受理扩权事项办件13097件，办结率达100%，无逾期和差错件，有效方便了群众。</p>\n<p>　　作为省“小城市培育”试点，佛堂将紧紧围绕国家历史文化名镇、文化旅游工艺品生产基地、义乌国际商贸城副中心——三大功能定位，着力实施“中心提升、两翼强化、南北接轨、跨江发展”的空间战略，加快拓展佛堂城市发展空间，全面建设现代化新型城市！</p>\n</div>"
    }
]