[
    {
        "title": "【感恩】什么是感恩？佛教徒应如何感恩父母？",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x611F;&#x6069;&#x3011;&#x4EC0;&#x4E48;&#x662F;&#x611F;&#x6069;&#xFF1F;&#x4F5B;&#x6559;&#x5F92;&#x5E94;&#x5982;&#x4F55;&#x611F;&#x6069;&#x7236;&#x6BCD;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0107/20160107052806866.jpg\" style=\"width: 330px; height: 249px;\" title=\"&#x3010;&#x611F;&#x6069;&#x3011;&#x4EC0;&#x4E48;&#x662F;&#x611F;&#x6069;&#xFF1F;&#x4F5B;&#x6559;&#x5F92;&#x5E94;&#x5982;&#x4F55;&#x611F;&#x6069;&#x7236;&#x6BCD;&#xFF1F;\" /></p>\n<h2><a href=\"/remen/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　感恩，《现代汉语词典》的解释：对别人所给的帮助表示感激 ，是对他人帮助的回报。</p>\n<h2>感恩基本解释</h2>\n<p>　　1、餐前或餐后对上帝表示感谢。</p>\n<p>　　2、感恩是一种处世哲学，也是<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中的大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。一个智慧的人，不应该为自己没有的东西斤斤计较，也不应该一味索取和使自己的私欲膨胀。学会感恩，为自己已有的而感恩，感谢生活给予你的一切。这样你才会有一个积极的<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>观，才会有一种<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>的心态。</p>\n<p>　　3、感恩是你对一个没有关系或者关系不够亲密的人给予你帮助所产生的一种亏欠心理。</p>\n<p>　　4、感恩是对亲人朋友的一种回馈心理。是一个人所需要拥有的品质。</p>\n<p>　　5、对他人给予的恩惠表示感谢。</p>\n<p>　　6、带着一颗真诚的心去报答，感谢别人。</p>\n<h2>佛教徒应如何感恩父母？</h2>\n<p>　　在佛教里，讲到<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>、感恩父母，有三个层次：</p>\n<p>　　初品的孝顺父母：是甘旨奉养，让父母在生活上获得适度的<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>，没有缺乏；</p>\n<p>　　第二是光宗耀祖：为人清白，事业成功，名利双收，<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>令人敬重，让父母祖宗都得到荣耀，这是中品的孝顺；</p>\n<p>　　第三是上品的孝顺：就是引导父母有道德、有慈悲、有<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>的<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>，不但此生他可以安身立命，就是百年之后，也能有好去处，这是最上品的孝顺。</p>\n<p>　　在<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>中，经常说“报四重恩”：一、感念<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>摄受我以<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>之恩；二、感念父母生养抚育我之恩；三、感念师长启我懵懂，导我入真理之恩；四、感念施主<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>滋润我色身之恩。我们感念<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>旷劫供我所需之恩，感念自然界，太阳供我光明与热能，空气供我呼吸，花草树木供我赏悦。</p>\n<p>　　<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>对我们来说非常珍贵，世界上没有任何东西比生命还珍贵。当我们遇到一些危难的时候，要在生命与财产之间进行选择，你肯定会抛弃财产而选择生命，这说明生命非常珍贵。这个珍贵的生命是谁给的？是父母给的。父母对我们的恩德是最大的，如果没有父母，就没有我们的身体、生命。父母抚养我们长大的抚养之恩，生长之恩，这是报答不尽的。</p>\n<p>　　纵然父母把我们生下来，都没有养我们一天，这个恩德也报不尽。怎么说？我们有这个身体，今天有这个受用，种种的享受就是有这个身才有这些享受。就是你的这个身谁给你的？如果你没有这个身，今天你有地位，你有<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，你的种种享受，怎么会有这些？当然就没有了。所以纵然父母生下我们，没有养过我们一天，这个恩德还是报不尽。</p>\n<p>　　抚养这个恩德更大，特别是教育跟养育的恩德更大。这个父母恩，父母的恩德。再来就是师长，父母生我们的生命，就是我们的身体生命得自於父母，从父母来的。我们的法身慧命，是师长<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>我们，启发我们，所以师长是生长我们的法身慧命。我们的智慧，我们有这个智慧，师长给我们的，这是师长的恩德。</p>\n<p>　　再来就是众生恩，一切众生对我们都有恩德，不管哪一类的众生对我们都有恩德，动物、植物、矿物对我们都有恩德。譬如矿物，这个大地，如果没有这个大地，你要站在哪里？大地对我们有恩德，所以要爱护它、尊敬它，不能任意破坏，而且要修善回报。植物对我们有恩德，我们吃的五谷杂粮，甚至花草树木让我们欣赏，这也是恩德。</p>\n<p>　　自己以外的别人，吃一粒米、穿一件衣服，日常生活当中所用的，这有多少人辛苦在工作，我们才有这个受用？不能说「我有钱买的」，你有钱没错，但是没人做，你要跟谁买？有钱也买不到东西。所以一切众生对我们都有恩德，这是众生恩。再来就是国家恩，国家办政治，使我们能有一个安定的生活，这个是国家的恩德，所以我们对国家不能忘记这个恩德。我们人要有国家的观念，如果没有国家的观念，这是错误的，绝对错误。所以我们要感恩，感恩四重恩，四重的恩德。</p>\n<p>　　知恩、感恩今生的父母以及生生世世的父母，这是大乘<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。但是我们首先要感恩今生的父母，这是做人的基本原则与基础，如果没有这个原则和基础，是不会有其他的<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>的。</p>\n<h2>解析感恩</h2>\n<p>　　感恩是一种处世哲学，是生活中的大智慧。<a href=\"/fojiaogushi/duan/rszs.html\" class=\"keylink\" target=\"_blank\">人生在世</a>，不可能一帆风顺，种种失败、无奈都需要我们勇敢地面对、旷达地处理。这时，是一味埋怨生活，消沉、萎靡不振？对生活满怀感恩，跌倒了再爬起来？英国作家萨克雷说：“生活就是一面镜子，你笑，它也笑；你哭，它也哭。”你感恩生活，生活将赐予你灿烂的阳光；你不感恩，只知一味地怨天尤人，最终可能一无所有！成功时，感恩的理由固然能找到许多；失败时，不感恩的借口却只需一个。殊不知，失败或不幸时更应该感恩生活。</p>\n<p>　　感恩，使我们在失败时看到差距，在不幸时得到慰藉、获得温暖，激发我们挑战困难的勇气，进而获取前进的动力。就像罗斯福那样，换一种角度去看待人生的失意与不幸，对生活时时怀有一份感恩的心情，则能使自己永远保持健康的心态、完美的人格和进取的信念。感恩不纯粹是一种心理安慰，对现实的逃避，阿Q的精神胜利法。感恩，是一种歌唱生活的方式，它来自对生活的热爱与希望。</p>\n<p>　　“感恩”是个舶来词，“感恩”二字，牛津字典给的定义是：“乐于把得到好处的感激呈现出来且回馈他人”。“感恩”是因为我们生活在这个世界上，一切的一切，包括一草一木都对我们有恩情！</p>\n<p>　　“感恩”是一种认同。这种认同应该是从我们的心灵里的一种认同。我们生活在大自然里，大自然给予我们的恩赐太多。没有大自然谁也活不下去，这是最简单的道理。对太阳的“感恩”，那是对温暖的领悟。对蓝天的“感恩”，那是我们对蓝得一无所有的纯净的一种认可。对草原的“感恩”，那是我们对“野火烧不尽，春风吹又生”的叹服。对大海的“感恩”，那是我们对兼收并蓄的一种倾听。</p>\n<p>　　“感恩”是一种回报。我们从母亲的子宫里走出，而后母亲用乳汁将我们哺育。而更伟大的是母亲从不希望她得到什么。就像太阳每天都会把她的温暖给予我们，从不要求回报，但是我们必须明白“感恩”。</p>\n<p>　　“感恩”是一种钦佩。这种钦佩应该是从我们血管里喷涌出的一种钦佩。</p>\n<p>　　“感恩”之心，就是对<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>所有人所有事物给予自己的帮助表示感激，铭记在心；</p>\n<p>　　“感恩”之心，就是我们每个人生活中不可或缺的阳光雨露，一刻也不能少。无论你是何等的尊贵，或是怎样地看待卑微；无论你生活在何地何处，或是你有着怎样特别的生活经历，只要你胸中常常怀着一颗感恩的心，随之而来的，就必然会不断地涌动着诸如温暖、自信、坚定、善良等等这些美好的处世品格。自然而然地，你的生活中便有了一处处动人的风景。</p>\n<p>　　“感恩”是一种对恩惠心存感激的表示，是每一种不忘他人恩情的人萦绕心间的情感。学会感恩，是为了擦亮蒙尘的心灵而不致麻木，学会感恩，是为了将无以为报的点滴付出永铭于心。譬如感恩于为我们的成长付出毕生心血的父母双亲。</p>\n<p>　　“感恩”是一种处世哲学，是生活中的大智慧。感恩可以消解内心所有积怨，感恩可以涤荡世间一切尘埃。人生在世，不会一帆风顺，种种失败、无奈都需要我们勇敢地面对、豁达地处理。</p>\n<p>　　“感恩”是一种生活态度，是一种品德，是一片肺腑之言。如果人与人之间缺乏感恩之心，必然会导致人际关系的冷淡，所以，每个人都应该学会“感恩”，这对于的孩子来说尤其重要。因为，的孩子都是<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>的中心，他们只知有自己，不知爱别人。所以，要让他们学会“感恩”，其实就是让他们学会懂得尊重他人。对他人的帮助时时怀有感激之心，感恩教育让孩子知道每个人都在享受着别人通过付出给自己带来的快乐的生活。当孩子们感谢他人的善行时，第一反应常常是今后自己也应该这样做，这就给孩子一种行为上的暗示，让他们从小知道爱别人、帮助别人。</p>\n<p>　　“感恩”是尊重的基础。在道德价值的坐标体系中，坐标的原点是“我”，我与他人，我与社会，我与自然，一切的关系都是由主体“我”而发射。尊重是以自尊为起点，尊重他人、社会、自然、知识，在自己与他人、社会相互尊重以及对自然和谐共处中追求生命的意义，展现、发展自己独立人格。感恩是一切良好非智力因素的精神底色，感恩是学会做人的支点；感恩让世界这样多彩，感恩让我们如此美丽！</p>\n<p>　　“感恩”之心是一种美好的<a href=\"/remen/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>，没有一颗感恩的心，孩子永远不能真正懂得孝敬父母、理解帮助其他的人，更不会主动地帮助别人。让孩子知道感谢爱自己、帮助自己的人，是德育教育中重要的一个内容。</p>\n<h2>感恩意义</h2>\n<p>　　人的一生中，小而言之，从小时候起，就领受了父母的养育之恩，等到上学，有老师的教育之恩，工作以后，又有领导、同事的关怀、帮助之恩，年纪大了之后，又免不了要接受晚辈的赡养、照顾之恩；大而言之，作为单个的社会成员，我们都生活在一个多层次的社会大环境之中，都首先从这个大环境里获得了一定的生存条件和发展机会，也就是说，社会这个大环境是有恩于我们每个人的。感恩，说明一个人对自己与他人和社会的关系有着正确的认识；报恩，则是在这种正确认识之下产生的一种责任感。没有社会成员的感恩和报恩，很难想象一个社会能够正常发展下去。在感恩的空气中，人们对许多事情都可以平心静气；在感恩的空气中，人们可以认真、务实地从最细小的一件事做起；在感恩的空气中，人们自发地真正做到严于律己宽以待人；在感恩的空气中，人们正视错误，互相帮助；在感恩的空气中，人们将不会感到自己的孤独……</p>\n<p>　　人生道路，曲折坎坷，不知有多少艰难险阻，甚至遭遇挫折和失败。在危困时刻，有人向你伸出温暖的双手，解除生活的困顿；有人为你指点迷津，让你明确前进的方向；甚至有人用肩膀、身躯把你擎起来，让你攀上人生的高峰……你最终战胜了苦难，扬帆远航，驶向光明幸福的<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。那么，你能不心存感激吗？你能不思回报吗？感恩的关键在于回报<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。回报，就是对哺育、培养、教导、指引、帮助、支持乃至救护自己的人心存感激，并通过自己十倍、百倍的付出，用实际行动予以报答。</p>\n<p>　　一切情绪之中最有威力的便是爱心，但它以不同的面貌呈现出来。感恩也是一种爱，因而安东尼?罗宾喜欢通过思想或行动，主动表达出自己的感恩之情，同时也好好珍惜上天赐给他的、人们给予他的、人生经历的。如果我们常心存感恩，人生就会过得再快乐不过了，因此请好好经营你那值得经营的人生，让它充满了芬芳。</p>\n<p>　　感恩是积极向上的思考和<a href=\"/remen/qianbei.html\" class=\"keylink\" target=\"_blank\">谦卑</a>的态度，它是自发性的行为。当一个人懂得感恩时，便会将感恩化做一种充满爱意的行动，实践于生活中。一颗感恩的心，就是一个和平的种子，因为感恩不是简单的报恩，它是一种责任、自立、自尊和追求一种阳光人生的精神境界！感恩是一种处世哲学，感恩是一种生活智慧，感恩更是学会做人，成就阳光人生的支点。从成长的角度来看，心理学家们普遍认同这样一个规律：心的改变，态度就跟着改变；态度的改变，习惯就跟着改变；习惯的改变，性格就跟着改变；性格的改变，人生就跟着改变，愿感恩的心改变我们的态度，愿诚恳的态度带动我们的习惯，愿良好的习惯升华我们的性格，愿健康的性格收获我们美丽的人生！</p>\n<p>　　朋友相聚，酒甜歌美，情浓意深，我感恩上苍，给了我这么多的好朋友，我享受着朋友的温暖，生活的香醇，如歌的友情。走<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>门，我走向自然。放眼花红草绿，莺飞燕舞，我感恩大自然的无尽美好，感恩上天的无私给予，感恩大地的<a href=\"/remen/kuanrong.html\" class=\"keylink\" target=\"_blank\">宽容</a>浩博。 生活的每一天，我都充满着感恩情怀，我学会了宽容，学会了承接，学会了付出，懂得了回报。所以，每天，我都有一个好心情，我幸福的生活着每一天。我懂得，学会了感恩，才会在生活中发现美好，用微笑去对待每一天，用微笑去对待世界，对待人生，对待朋友，对待困难。宽容和感动可以化腐朽为神奇，化冰峰为春暖，化干戈为玉帛。</p>\n<p>　　对于生活心存感恩，你就不会有太多的抱怨，世上没有十全十美的事物。比抱怨更重要的是自己为改变这一切做了哪些努力。感恩之心足以稀释我们心中的狭隘和蛮横，还可以帮助我们度过最大的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>和灾难。常怀感恩之心，我们就可以逐渐原谅那些曾和你有过结怨甚至触及你心灵痛处的那些人，会使我们已有的人生资源变得更加深厚，使我们的心胸更加宽阔。</p>\n<p>　　因此，感恩，是一条人生基本的准则，是一种人生质量的体现，是一切生命美好的基础。感恩是生活中的大智慧，能使我们感受到大自然的美妙、生活的美好，能保持我们的积极、健康、阳光的良好心态。怀有感恩之情，对别人、对环境就会少一份挑剔，多一份欣赏和感激。感恩，是一种美好的情感，是病入道义上的净化剂、事业上的原动力和内驱力，是人的高贵之所在。感恩将使你的心和你所企盼的事物联系得更紧，感恩将使你对生活、对一切美好事物的信念，从而一生被美好的事物包围。常怀感恩之心，我们便能够生活在一个感恩的世界，这个世界一定是非常美好的，我们的人生也会变得更加美好。</p>\n<p>　　感恩是一束金色的阳光,能融化冰雪,让我们学会感恩,让这束阳光照耀在我们大家的心底!</p>\n</div>"
    }
]