[
    {
        "title": "光音天",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<div style=\"text-align: center\"><img alt=\"\\\" height=\"227\" src=\"https://www.liaotuo.com/uploadfile/2016/0105/20160105015251870.jpg\" style=\"width: 344px; height: 248px\" width=\"304\" /></div>\n<h2>光音天（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　佛教术语。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天二十二层天第八层。参见色界详述。</p>\n<h2>基本释义</h2>\n<p>　　色界天分梵天、光天、净天、广天、无想天、无烦天、无恼天、善见天、善现天、色究竟天</p>\n<p>　　梵天又分梵身天、梵辅天、梵众天、大梵天。</p>\n<p>　　光天又分光天、少光天、无量光天、光音天。</p>\n<p>　　净天又分净天、少净天、无量净天、遍净天（离喜乐故称遍净）。</p>\n<p>　　广天又分广天、少广天、无量广天、广果天。</p>\n<p>　　梵天、光天、净天合称初禅三天（又可细分为十二层天）；广天四天为第二禅天；无想天、无烦天、无恼天为第三禅天；善见天、善现天、色究竟天为第四禅天。</p>\n<p>　　天道分为欲界天、色界天、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>天。</p>\n<p>　　一、欲界天：共六层天，分别为四大王众天、忉利天、夜摩天、兜率天、化乐天、他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天。</p>\n<p>　　二、色界天∶共二十二层天，分别为梵身天、梵辅天、梵众天、大梵天、光天、少光天、无量光天、光音天、净天、少净天、无量净天、遍净天、广天（严饰天）、少广天（小严饰天）、无量广天（无量严饰天）、广果天（严饰果实天）、无想天、无烦天（无造天）、无恼天（无热天）、善见天、善现天、色究竟天（阿迦腻吒天）。</p>\n<p>　　三、无色界天∶共四层，分别为、识无边处天、无所有处天、非想非非想处天等四天。</p>\n<h3>　　经文中的记述</h3>\n<p>　　《起世因本经》：“诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。此<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>中。有三十八诸<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>类。何者是其三十八种。诸比丘。欲界之中有十二种。色界中有二十二种。无色界中复有四种。诸比丘。于中何者是其欲界十二种类。所谓<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。畜生。饿鬼。人。阿修罗。四天王天。三十三天。夜摩天。兜率陀天。化乐天。他化自在天。魔身天等。此名十二。何等色界二十二种。谓梵身天。梵辅天。梵众天。大梵天。光天。少光天。无量光天。光音天。净天。少净天。无量净天。遍净天。广天。少广天。无量广天。广果天。无想天。无烦天。无恼天。善见天。善现天。阿迦腻吒天等。此二十二属于色界。其无色界四种者。谓空无边天。识无边天。无所入天。非想非非想天。此四种类属无色界。”</p>\n<p>　　《长阿含经》：“佛告比丘。欲界众生有十二种。何等为十二。一者地狱。二者畜生。三者饿鬼。四者人。五者阿须伦。六者四天王。七者忉利天。八者焰摩天。九者兜率天。十者化自在天。十一者他化自在天。十二者魔天。色界众生有二十二种。一者梵身天。二者梵辅天。三者梵众天。四者大梵天。五者光天。六者少光天。七者无量光天。八者光音天。九者净天。十者少净天。十一者无量净天。十二者遍净天。十三者严饰天。十四者小严饰天。十五者无量严饰天。十六者严饰果实天。十七者无想天。十八者无造天。十九者无热天。二十者善见天。二十一者大善见天。二十二者阿迦尼吒天。无色界众生有四种。何等为四。一者空智天。二者识智天。三者无所有智天。四者有想无想智天。”</p>\n<p>　　《起世因本经》：“诸比丘。阎浮提人。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>百年。其间有夭。瞿陀尼人。寿二百年。中亦有夭。弗婆提人寿三百年。中亦有夭。郁多啰究留人。定寿千年。无有夭殇。阎摩罗世诸众生。寿七万二千岁。中亦有夭。诸龙及金翅鸟。寿命一劫。中亦有夭。阿修罗寿。同天千年。中间亦夭。四天王寿五百岁。中亦有夭。三十三天。寿命千岁。夜摩诸天。寿二千岁。兜率陀天。寿四千岁。化乐诸天。寿八千岁。他化自在天。寿十六千岁。魔身天。寿三万二千岁。梵身天寿一劫。光忆念天。寿命二劫。遍净诸天。寿命四劫。广果诸天。寿命八劫。无想诸天。寿十六劫。不热诸天。寿命千劫。无恼诸天。寿二千劫。善见诸天。寿三千劫。善现诸天。寿四千劫。色究竟天。寿五千劫。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>处天。寿十千劫。识处天。寿二万一千劫。无所有处天。寿四万二千劫。非想非非想处天。寿八万四千劫。于其中间。并皆有夭。”</p>\n<p>　　《大宝积经》：“若于此中。色染愚痴悕望。欲得心所作业。是名色界。云何无色界。空处天。识处天。无所有处天。非有想非无想处天。若于此中。无色染污愚痴悕望。欲得心所作业是名无色界。是名三界。复次知四界。欲界。色界。无色界。无为界。是名知四界。”</p>\n</div>"
    }
]