[
    {
        "title": "【健康】-佛教的健康观",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"240\" src=\"https://www.liaotuo.com/uploadfile/2016/0107/20160107045747823.jpg\" width=\"333\" /></p>\n<h2><a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a></h2>\n<p>　　健康是指一个人在身体、精神和社会等方面都处于良好的状态。健康包括两个方面的内容：一是主要脏器无疾病，身体形态发育良好，体形均匀，人体各系统具有良好的生理功能，有较强的身体活动能力和劳动能力，这是对健康最基本的要求；二是对疾病的抵抗能力较强，能够适应环境变化，各种生理刺激以及致病因素对身体的作用。传统的健康观是“无病即健康”，现代人的健康观是整体健康，世界卫生组织提出“健康不仅是躯体没有疾病，还要具备心理健康、社会适应良好和有<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>”。因此，现代人的健康内容包括：躯体健康、心理健康、心灵健康、社会健康、智力健康、道德健康、环境健康等。健康是人的基本权利。健康是<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>的第一<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>。</p>\n<h2>十项标准</h2>\n<p>　　全世界公认的关于健康的13个标志：</p>\n<p>　　<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>勃勃，富有进取心；</p>\n<p>　　性格开朗，充满活力；</p>\n<p>　　正常身高与体重；</p>\n<p>　　保持正常的体温、脉搏和呼吸（体温37℃；脉搏72次/min；呼吸婴儿45次/min, 6岁25次/min ，15~25岁18次/min，年龄稍大会增加）；</p>\n<p>　　食欲旺盛；</p>\n<p>　　明亮的眼睛和粉红的眼膜；</p>\n<p>　　不易得病，对流行病有足够的耐受力；</p>\n<p>　　正常的大小便；</p>\n<p>　　淡红色舌头，无厚的舌苔；</p>\n<p>　　健康的牙龈和口腔黏膜；</p>\n<p>　　光滑的皮肤柔韧而富有弹性，肤色健康；</p>\n<p>　　光滑带光泽的头发；</p>\n<p>　　指甲坚固而带微红色。</p>\n<h2>概念演变</h2>\n<p>　　健康的英文是：Wellness，健康状况/状态的英文是：Health。在一些词典中，“健康”通常被简单扼要地定义为“机体处于正常运作状态，没有疾病”。这是传统的健康概念。通常我们确实是把疾病看成是机体受到干扰，导致功能下降，<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>质量受到损害（主要由肉体疼痛引起）或早亡。</p>\n<p>　　在《辞海》中健康的概念是：“人体各器官系统发育良好、功能正常、体质健壮、精力充沛并具有良好劳动效能的状态。通常用人体测量、体格检查和各种生理指标来衡量。”这种提法要比“健康就是没有病”完善些，但仍然是把人作为生物有机体来对待。因为它虽然提出了“劳动效能”这一概念，但仍未把人当作社会人来对待。对健康的认识，在生物医学模式时代被公认是正确的。</p>\n<p>　　在我们的词典里，为什么会对健康有上述的注释呢？其原因不外乎是两方面的，一是编写词典的作者，根本不知道世界卫生组织在1946年就有对“健康”的定义。二是他自己对健康的认识就是如此，应该说“害人不浅”。然而，话也说回来，一般大众的认识，健康就是“机体处于正常运作状态，没有疾病”。这个概念，在当时是被广大群众所认可和接受的，其中包括医疗工作者。因为，在过去的很长一段时间内，我们对“心理和社会适应能力上的完好状态”处于无知的状态。直到近几年改革开放后才开始重视心理和社会适应能力对健康的影响，有位上世纪六十年代医科大学毕业的医生告诉我，他们在校学习的时候有两门课没有好好地学。一门是营养学，另一门就是心理卫生。营养学没有好好学的原因，是当时连肚子都吃不饱，还谈什么营养？至于心理卫生那是<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>主义的东西。</p>\n<p>　　关于健康和疾病的概念，《简明不列颠百科全书》1987年中文版的定义是：“健康，使个体能长时期地适应环境的身体、情绪、精神及社交方面的能力。”“疾病，是以产生症状或体征的异常生理或心理状态”，是“人体在致病因素的影响下，器官组织的形态，功能偏离正常标准的状态。”“健康可用可测量的数值（如身高、体重、体温、脉搏、血压、视力等）来衡量，但其标准很难掌握。”这一概念虽然在定义中提到心理因素，但在测量和疾病分类方面没有具体内容。可以说这是从生物医学模式向生物、心理、社会医学模式过渡过程中的产物。一方面，这种转化尚缺乏足够的临床实践资料提供理论的概括；另一方面撰写者虽然接受了新的医学模式的思想，但难以作进一步的理论探讨。</p>\n<p>　　因此，它还没有达到1946年世界卫生组织（WHO）成立时在它的宪章中所提到的健康概念：“健康乃是一种在身体上，心理上和社会上的完满状态，而不仅仅是没有疾病和虚弱的状态。”（Health is a state of complete physical,mental and social well-being and not merely the absence of disease or infirmity.）WHO1948.</p>\n<p>　　事实上，要对此作出确切的定义很难。因为，即使没有明显的疾病，人对健康或不健康的感觉也具有很大的主观性。毫无疑问，觉得身体健康，不等于身体没有病。</p>\n<p>　　世界卫生组织关于健康的这一定义，把人的健康从生物学的意义，扩展到了精神和社会关系（社会相互影响的质量）两个方面的健康状态，把人的身心、<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>和社会生活的健康状态均包括在内。</p>\n<h2>健康含义</h2>\n<p>　　现代健康的含义并不仅是传统所指的身体没有病而已，根据“世界卫生组织”的解释：健康不仅指一个人身体有没有出现疾病或虚弱现象，而是指一个人生理上、心理上和社会上的完好状态，这就是现代关于健康的较为完整的科学概念。</p>\n<p>　　现代健康的含义是多元的、广泛的，包括生理、心理和社会适应性</p>\n<p>　　个方面，其中社会适应性归根结底取决于生理和心理的素质状况。心理健康是身体健康的精神支柱，身体健康又是心理健康的物质基础。良好的情绪状态可以使生理功能处于最佳状态，反之则会降低或破坏某种功能而引起疾病。身体状况的改变可能带来相应的心理问题，生理上的缺陷、疾病，特别是痼疾，往往会使人产生<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>、焦躁、忧虑、<a href=\"/remen/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>等不良情绪，导致各种不正常的心理状态。作为身心统一体的人，身体和心理是紧密依存的两个方面。</p>\n<p>　　维护健康四大基石：平衡饮食、 适量运动、 戒烟限酒、 心理健康。</p>\n<h2>心理健康</h2>\n<p>　　心理健康是比较而言的，绝对的健康是不存在的，人们都处在较健康和极不健康的两端连续线中间的某一点上，而且人的心理健康状态是动态变化的，而非静止不动的。人的心理健康即可以从相对的比较健康变成健康，又可以从相对健康变得不那么健康，因此，心理健康与否是反映某一段时间内的特定状态，而不应认为是固定的和永远如此的。</p>\n<p>　　健康是一个国际性学术期刊，致力于人类健康的最新进展，由美国科研出版社发行。这本杂志的目的是提供一个平台，让世界各地的推广，分享和讨论各种新的问题和发展与健康有关的问题的医师，卫生研究人员和学者。所有稿件必须以英文编制，严格的，公平的同行评审过程。录用的论文将立即出现在网上其次是印刷硬拷贝。</p>\n<h2>健康饮食</h2>\n<p>　　健康膳食金字塔这个金字塔分为七层，最顶端的一级是甜品与黄油，接下来依次为：乳制品，鱼类或少量红肉，坚果与豆类，蔬菜与水果，全麦食品与植物油，最下面一层与食物无关——长期而适当的体育锻炼。</p>\n<p>　　层层剖析金字塔</p>\n<h3>　　第一层：黄油与甜品</h3>\n<p>　　无论是老式金字塔，还是Willett教授最新提出的金字塔，都把黄油与甜品列在最顶端。由此可见，这一类的食物除了会增加热量与脂肪，几乎没有其他的功效，更谈不上对身体健康有益处了。如果你想保持曼妙的身材，最好远离这一层的食物；但如果你需要从事大运动量的体育锻炼，比如长跑和游泳，你可以在运动前吃一块巧克力来补充体力和热量。</p>\n<h3>　　第二层：奶制品</h3>\n<p>　　在老式金字塔中，奶制品是与肉类同在第二层的。Willett教授之所以把奶制品单独提出来放在第二层，是因为摄入过多的奶制品会增加心脏的负担，导致胆固醇升高，其副作用要比肉类大。有些人强调奶制品能够增加体内钙质，实际上奶制品并不是惟一，也不是最好的获取钙质的途径。实验证明，两杯牛奶所提供的钙质仅相当于几口豆腐为身体补充的钙量。当然，你也不必改变每天喝牛奶的习惯，只是尽量喝脱脂奶更加合理。</p>\n<h3>　　第三层：鱼类或少量红肉</h3>\n<p>　　海鲜类的肉质被称之为“白肉”，这些肉类含有丰富的蛋白质和各类氨基酸，而且不会转化为脂肪，因此可以每周适当摄入2～4次。其他的“红肉”类食物，过多地摄入会导致心血管病的发病率升高，特别是动物内脏，最好不要经常食用，即使是年轻人，过高的胆固醇指标也会为将来埋下祸患。</p>\n<h3>　　第四层：坚果与豆类</h3>\n<p>　　这一类食物在老式的金字塔中被忽略掉了，而Willett教授恰恰认为它们很重要。许多人都认为坚果会导致脂肪堆积，实际上坚果中的油类都属于植物油，比起动物体内的油脂要更清洁，所含的维生素和其他营养物质也就更多。豆制品中含有多种微量元素，特别是钙元素的含量所占比例很大，对于骨质疏松的人与老年人都很有好处。</p>\n<h3>　　第五层：蔬菜与水果</h3>\n<p>　　蔬菜与水果对于人体健康的重要性无需过多地强调，在“肚子”允许的范围之内，尽可能地多多摄入这两大类对身体最有益处的食物。</p>\n<h3>　　第六层：全麦食品与植物油</h3>\n<p>　　在老式的金字塔中，植物油没有被列入食用的范围之内。而在现实生活中，植物油在烹饪过程中是不可或缺的配料。要控制象大豆油、色拉油等含饱和脂肪酸的植物油摄入，增加主要含不饱和脂肪酸如小磨香油的摄入。</p>\n<h3>　　第七层：长期而适当的体育锻炼</h3>\n<p>　　Willett教授出人意料地把体育锻炼列为了金字塔的“根基”，他认为，一个完美的饮食结构应该以健康的生活方式为基础。<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>在于运动，只有将运动与科学的饮食相结合，才能够让身体保持在最佳的状态之中。</p>\n</div>"
    }
]