[
    {
        "title": "【讲座】 佛法讲座",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0112/20160112035711881.jpg\" /></p>\n<h2><a href=\"/remen/jiangzuo.html\" class=\"keylink\" target=\"_blank\">讲座</a></h2>\n<p>　　讲座，是由教师不定期地向学生讲授与学科有关的科学趣闻或新的发展，以扩大他们知识的一种教学活动形式。</p>\n<p>　　或：由主讲人向学员传授某方面的知识、技巧，或改善某种能力、心态的一种公开半公开的学习形式。</p>\n<h2>词语概念</h2>\n<h3>　　基本解释</h3>\n<p>　　[a course of lectures] 一种教学形式,多利用报告会、广播等方式进行。</p>\n<p>　　汉语拼音讲座。</p>\n<h3>　　引证解释</h3>\n<p>　　1. 高僧<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>或儒师讲学的座位。</p>\n<p>　　南朝 梁 宝唱 《<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>传·宝贤尼》：“ 贤 乃遣僧局賷命到讲座，鸣木宣令诸尼不得辄复重<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。”《朱子语类》卷七九：“﹝ 陆象山 ﹞於是日入道观，设讲座，说‘皇极’，令邦人聚听之。” 明 吴宽 《桂岩书院铭》：“桂巖种德，旧扁在此，讲座有铭，敢效遗轨。”</p>\n<p>　　2. 一种教学形式，多利用报告会、广播、电视或刊物连载的方式进行。如：法律常识讲座。[1]</p>\n<h2>讲座分类</h2>\n<p>　　大学讲座大致可以分为五类。</p>\n<h3>　　学术类</h3>\n<p>　　学术类讲座一般由某个院系或研究机构主办，邀请的嘉宾多为该领域的知名专家，而讲座的主题也会围绕领域内某一具体问题进行。这类讲座对该领域内的人来说，是一场学术盛宴，可是对于领域外的人来说，那可能连热闹都看不了。</p>\n<p>　　虽然这类讲座相对小众，但正因为此，讲座所谈的内容相对高端，有较高的学术水平和研讨价值，主讲嘉宾也是该领域中的翘楚。参加这种讲座，往往能体验到思路的火花式碰撞，也能了解到最新的学术研究成果。特别是一些理科和医科等基础学科的讲座，更是成了相关院系学生除上课和实验之外的第三课堂。</p>\n<h3>　　论坛类</h3>\n<p>　　在大学还有一类常见的讲座类型，那就是各式各样的论坛或者研讨会。这类论坛通常围绕某一个较为宽泛的主题进行一至三日的探讨，有的论坛还设有分会场，听众可以根据自己的兴趣选择不同的议题，在分会场中“串门”。听这类讲座仿佛像是吃自助餐一般，可自由选择，尽情享受大学论坛所提供的资源。</p>\n<p>　　由于论坛持续的时间比一般讲座更长，通常都会设置中场休息时间。这时感兴趣的听众还能有与嘉宾面对面单独交流的机会。碰上院系或社团举办学术周，讲座更是精彩纷呈，很多时候总让听众们痛恨自己分身无术，有时候还要忍痛割爱，在不同议题的讲座中作出选择。</p>\n<h3>　　名人类</h3>\n<p>　　社会名人是公众特别感兴趣的人群，大学对这类人群也有足够的吸引力。时机恰当的时候，名人们也会到大学客串一把。怎样才算是社会名人呢？他们当然包括各国政要、世界著名大学校长、知名科学家如诺贝尔奖获得者，以及文化名人等一切具有“票房号召力”的人物。</p>\n<p>　　各国政要在来华进行访问的时候，也常会选择前往高校，以讲座的形式与学子零距离接触。此外，哈佛大学、剑桥大学、耶鲁大学等世界名校的校长以及诺贝尔奖获得者来高校访问时，有一个约定俗成的“规定动作”，就是在高校举办一场讲座，由于机会难得，这样的讲座往往让学生和一些感兴趣的社会人士踊跃参与。</p>\n<p>　　国内知名企业的CEO，影视明星和著名主播等，也常常光顾高校与学子面对面。由于名人类的讲座一般对听众的限制较少，讲座主题也相对大众，亲和力较高，容易被更多人接受。也正因为名人会吸引到大规模听众，这类讲座一般会采用提前发票的方式来限制听众人数。</p>\n<h3>　　文化类</h3>\n<p>　　大学内学术自由、讨论开放，各类思想撞击竞发，并且汇聚了一大批知名学者，更通过名誉教授、客座教授、讲座教授等方式，网罗了不少名家，他们的<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>和思想在讲坛上得以展现和激发，形成了大学文化中一道亮丽的风景线。在大学里，只要你真的有思想，够水平，就能得到听众的支持，因此，大学也成为了一些有才之士“初试啼声”的场所。</p>\n<h3>　　热点类</h3>\n<p>　　针对社会上的热点问题，大学通常会邀请相关专家对该热点问题进行解读和探讨，这种热点类的讲座也很受人欢迎，除了校内学生外，某些讲座主题还常常引来不少社会人士的关注。</p>\n</div>"
    }
]