[
    {
        "title": "【静坐】静坐的意思，静坐的好处和方法是什么？",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x9759;&#x5750;&#x3011;&#x9759;&#x5750;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x9759;&#x5750;&#x7684;&#x597D;&#x5904;&#x548C;&#x65B9;&#x6CD5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0108/20160108031251196.jpg\" style=\"width: 365px; height: 241px;\" /></p>\n<h2><a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　静坐，是修养身心的一种重要方法，可以澄清思虑，增进<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>。 我们<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>在这个世界上，免不了有种种疾病，一切疾病又可分为身和心两方面，除身上所发生的疾病以外，凡一切贪欲、愤怒、忧怖、骄慢等等不正常的思想现象，都叫做心病。我们平时往往只注意身病，对于心病，一般都不予重视。</p>\n<h2>静坐的基本解释</h2>\n<p>　　一、排除思虑，闭目安坐，是气功疗法采用的一种方式。</p>\n<p>　　二、为达到某种要求或表示抗议安静的坐着。</p>\n<h2>静坐的好处</h2>\n<p>　　静坐的好处，在<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的立场来说，是能得圣道、能够转凡成圣、能成为阿罗汉、能得无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>，或者说是能得<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。若是静坐能得到<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，从禅定之中再修习神通的方法，就可以得到神通了。若是不静坐、没有禅的功夫，是不会有神通的。假使有神通，就是所谓报得的神通；报得的神通是很小的，有的时候也靠不住。由禅定者的神通，不一定靠的住，但是灵的、准确的比较多一点。静坐能得禅、能得神通，容易成就<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>——所谓<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜，这是在佛教的立场，说禅定得到的一些<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。</p>\n<p>　　其次，就是一般性的功德，就是对身体的健康有帮助，能减少病痛，不能说没有病痛，不能那么说。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗尊者是佛的大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，智慧第一的弟子，也是有神通的，但是他也有病痛；阿那律尊者也是大阿罗汉，他也有病痛，我们从《阿含经》上看，有这个记录的。所以<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>的人只能说减少病痛，不能说没有病痛。</p>\n<p>　　静坐，如果你的方法没有错误，你能够有恒心，是能减少病痛，能够帮助身体健康，也能够强壮人的神经，能够使令神经健康；神经健康，办事能力也就强一点，犯的错误就可能会减少，也有这种好处。或者有什么样的病痛，长期地静坐也可能会好。这是一般性的好处。</p>\n<p>　　此外，有的时候有什么难题不能解决，你若静坐一个钟头，喔！那个问题就解决了，他从静坐之中就会想出来办法。所以知道静坐能帮助开智慧、解决问题。（妙境法师）</p>\n<p>　　另外，静坐是打通经络的最好方法。经络是很神奇的东西，许多疾病都是由经络的不通造成的，什么便秘、脑血栓、心梗、胆结石、肿瘤等等，光看病名就知道了。其实所有的疾病都和经络不通都有着一定联系，经络一旦畅通无阻，病邪根本滞留不下来。</p>\n<p>　　而在现代医学中，经络仍是比较虚玄的东西，虽然敏感的人在针灸时会<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>得到，但说到经络的实质，人们总是觉得既看不见又摸不着，现代先进的医学仪器也透视不出来。从古代经脉图谱中我们了解到各条经脉的详细走向、交结，那么古人又是怎样看得一清二楚呢?其实方法就两个字：“内视。”</p>\n<p>　　经络本就是体内的景象，只有内视才能看到。现代社会高速发展，快节奏的生活，五花八门的仪器让我们逐渐失去了一些本来应该具有的能力。古代社会接近天然，古人显然比我们要聪明得多，身体灵敏度也高，较容易向内觉察到经络的运行。</p>\n<p>　　内视必须在入静的状态下才可以获得，通过静坐调息，我们可以感知气机在经脉中的循环。静坐到了一定程度，下腹部的丹田位置就会有一股热气循着经脉的走向自然流注循环。因为练习的火候到了，丹田里产生的真气充满流溢，开始向全身运行，这就是打通经脉的过程。此时，你的<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>也要随着气机<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>，做到“神与脉合”。如果练习的火候没到，丹田内的真气就仍在酝酿之中，切不可着急。</p>\n<p>　　静坐是完全靠精神内守使气机自然而然地融会贯通，一股冲和之气运行经络之间，化解郁积之处。这样地去通经络将是长久有效的，比起推拿、针灸等外界方法不知要高明多少倍。</p>\n<h2>静坐的方法</h2>\n<h3>　　静坐前的准备</h3>\n<p>　　（1)、静坐最好能另觅静室，假使条件不许可，那末可就在卧室中。窗门宜开，使空气<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>，但有风处不宜坐，门能关闭更好，以免别人的骚扰。</p>\n<p>　　（2)、坐时或另备坐凳或就在床上，但总以平坦为宜，座位上需铺被褥或垫子，务使软厚，以便于久坐。</p>\n<p>　　（3)、在入坐之前，应宽松衣带，使筋肉不受拘束，气机不致阻滞，但在秋冬等寒冷时，两腿必须盖好，以免膝盖受风。</p>\n<h3>　　静坐时的姿势</h3>\n<h3>　　（1）、静坐时的两腿</h3>\n<p>　　（a)、静坐时的两腿必须盘起来。先将左胫加到右股的上面，再将右胫扳上来加到左股的上面，这种坐法普通叫做双盘膝，也叫做双跏趺；因为这样的姿势，可使两膝盖的外侧，都紧靠着褥垫，全身的筋肉，正像弓弦的伸张，坐时自然端直，不至于左右前后的倚斜。不过这种坐法，假使初学和年龄较高的，觉得难以仿效，那就不必勉强，可改用下列第二种方法。</p>\n<p>　　（b）、盘时可随各人的习惯，或将左胫加到右股之上，或将右胫加到左股之上，这种坐法普通叫做单盘膝，也叫单跏趺，比较双盘膝有些缺点，因为假使将左胫加于右股之上，那末左膝盖外侧必落空，不能紧靠着褥垫，身子易向右倾斜，假使将右胫加于左股之上，那末右膝盖外侧必落空，不能紧靠着褥垫，身子易向左倾斜、初学的人，不能双盘，自以单盘膝为宜，但须注意姿势端直，能使身体不倾斜，那末功效还是一样的。</p>\n<p>　　(c)、初学盘腿的时候，必将发生麻木或酸痛，必须忍耐。练习久后，自然渐进于自然。当麻木到不能忍受时，可将两腿上下交换，假使再不能忍受，那末可暂时松下，等麻木消失后再放上去。假使能十分忍耐，听其极端麻木，渐至失去感觉，此后它能反应，自然恢复原状，经过这样阶段，几次之后，盘坐时便不会再麻木了。</p>\n<h3>　　（2）、静坐时的胸部、臀部和腹部</h3>\n<p>　　（a）胸部可微向前俯，使心窝降下，所谓心窝降下，就是使横膈膜松弛。胸内肺与胃之间有横膈膜，恰在胸部两胁间凹下的地方，叫做心窝。我们初学静坐时，常觉胸膈闭塞不舒，这是说明心窝没有下降，这时可用下面所说的调心一节、系心脐间或脐下的办法使横膈膜松弛，心窝处轻浮而不着力，久后自能降下，而得调适。</p>\n<p>　　(b)臀部宜向后稍稍凸出，使脊骨不曲。脊骨的形状，本来三折如弓，在臀部处，略向外弯，所以坐时臀部宜向后稍稍凸出；但不必有意用力外凸，可依循自然的姿势。</p>\n<p>　　(c)腹的下部宜宽放镇定，镇定下腹的目的，是在使全身的重心安定。</p>\n<h3>　　（3）、静坐时的两手</h3>\n<p>　　（a）、两手仰掌，以左掌安放在右掌上面，两拇指头相拄，安放在脐下跏跌之上。</p>\n<p>　　（b）、假使单跏趺，是右胫加在左股上，那末应将右掌安放在左掌上。</p>\n<p>　　（c）、两手这样安放，既自然，安适，且最能助长<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。</p>\n<p>　　（4）、其他</p>\n<p>　　（a）、头颈正直，但须自然不可故意挺直。</p>\n<p>　　（a）、两耳宜如不闻。</p>\n<p>　　（a）、眼宜轻闭。也有主张两眼微开的，这叫做垂帘，大抵坐时易于昏睡的，宜用这个方法。</p>\n<p>　　（d）、口宜噤闭，舌抵上颚，也是使筋骨团结的意思。</p>\n<p>　　（e）、呼吸宜用鼻，不可用口。</p>\n<p>　　（f）、坐时臀部也可垫高一二寸，以各人的舒适为度，并须使肾囊不受压迫。</p>\n<p>　　（g）、身宜平直，脊骨不要曲，要自然安稳地端正而坐，因为身正则气正，气正则心也正。</p>\n<p>　　（h）、坐毕将起，先想气从全身毛孔放出(否则以后坐时，可能会感到烦躁不安)。然后渐渐动身及舒放两臂，并将两手搓热，抚摩面目，然后放足，用手按摩足部毕，缓缓起身。</p>\n<h3>　　静坐时的呼吸</h3>\n<h3>　　（1）、呼吸方法的研究</h3>\n<p>　　呼吸与我们生活机能，关系很大，一般人只知饮食可以维持<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>，不饮不食，势必饿死，实不知呼吸比饮食更为重要。不过由于饮食非金钱不能获得，所以觉得可贵，而呼吸是摄收大气中的氧气，是“取之无尽，用之不竭”的，所以不觉得可贵。但要知我们断食，虽七日尚不至于死，假使一旦闭塞口鼻，不使呼吸，不久便死，这样也可见呼吸的重于饮食了。我们学习静坐，调和气息，是下手时一项重要的功夫，而要调和气息，先将呼吸的方法来研究一下，也是非常必要的。</p>\n<p>　　我们的一呼一吸叫做一息，呼吸肌肉有二个部份，一是肋骨间的肌肉，一是膈(即横膈膜)的肌肉，呼吸运动也受中枢神经系统的控制，在大脑下方的延髓中，有一部份神经细胞是管制呼吸的，叫做呼吸中枢，它跟呼吸肌肉发生联系。呼吸的机构，外面是鼻，里面是肺，肺叶的位置，是在两胸部内。呼吸时，肺部的张缩有天然的规律，我们平时的呼吸，大都不能使肺叶尽量张缩，只用肺的上部，而肺的下部几乎完全不用，因此不能尽吐碳吸氧的功用，以致血液不洁，百病丛生，这都是呼吸不能合乎规律的缘故。呼吸的方法有自然呼吸和正呼吸两种：</p>\n<p>　　第一自然呼吸，也叫做腹式呼吸，因为在呼吸时，一呼一吸，必须都能达到下腹部。在吸气时，空气入肺，充满周遍，肺底舒张，抑压横膈膜，使空气下降，这时胸部空松，腹部外凸，在呼气时，腹部收缩，横膈膜被推而上，上抵肺部，使肺底浊气，外散无余。可见呼吸作用，虽与肺叶有密切关系，但它的伸缩，常须依靠下腹和横膈膜的运动，方能合乎自然大法，使血液循环流畅。我们不但在静坐时，须用此法，实际上，不论行、住、坐、卧，应该随时使用。关于自然呼吸法的调和方法如下：</p>\n<p>　　（a）、呼息时，脐下腹部收缩，横膈膜向上，胸部紧窄，肺底浊气可以挤出。</p>\n<p>　　（b）、吸息时,从鼻中徐徐吸入新鲜空气，充满肺部，横膈膜向下，腹部外凸。</p>\n<p>　　（c）、呼息吸息，均使自然，渐渐细长，达于下腹。</p>\n<p>　　（d）、呼吸渐渐静细，出入很微，反复练习，久之自己不知不觉，好像无呼吸的状态。</p>\n<p>　　（e）、能做到无呼吸的状态，那末没有呼息，也没有吸息，虽有呼吸器管，好像不必用它；而气息彷佛从全身毛孔出入，到这一步，可以说达到了调息的极功。不过初学的人，切不可有意去求，必须听其自然。</p>\n<p>　　第二、正呼吸，这一方法，主张呼吸宜细长，宜达于腹部，以及使横隔膜上下运动等，都与自然法，没有两样。不过呼吸时腹部的张缩，完全相反。因为反乎自然呼吸，所以也叫做逆呼吸。关于正呼吸的调和方法如下：</p>\n<p>　　（a）、呼息宜缓而长，脐下气满，腹部膨胀，胸部空松，横膈膜驰缓。</p>\n<p>　　（b）、吸息宜深而长，空气满胸，胸部膨胀这时脐下腹部收缩。</p>\n<p>　　（c）、肺部气满下压，腹部收缩上抵，这时横隔膜上下受压逼，运动更为灵敏。</p>\n<p>　　（d）、在静坐时，呼息及吸息，宜极静细，以自己也不闻其声合宜。</p>\n<p>　　以上两种呼吸方法，有主张吸息宜比呼息加长的，也有主张呼息宜比吸息加长的，但根据一般实验，似以长短相等为宜。此外，无论自然呼吸和正呼吸，目的都在使横隔膜运动。正呼吸是用人功使腹部的张缩逆乎自然，而加强横膈膜的驰张和收缩，使更易运动。不过，由于这一方法参用人功，学时有宜有不宜，并不是人人可学，总不如自然呼吸的毫无流弊。</p>\n<h3>　　（2）、呼吸的练习</h3>\n<p>　　为了使呼吸能够正常而熟练，自宜加以练习，且由于我们平时的呼吸，每次只能吸入约350立方厘米的空气，这样气体的交换，并不是经常够用的。如果能加强呼吸的深度，那末每次便能吸入1500至2000立方厘米的空气，做到充分交换肺里的气体。但静坐时，必须逐步做到无思无虑，假使注意呼吸，心便不能宁静，而且在静坐时，决不宜行深呼吸，因此呼吸的练习，宜在静坐的前后，无论自然呼吸和正呼吸，有共同之点如下；</p>\n<p>　　（a）、盘膝端坐，与静坐的姿势相同。</p>\n<p>　　（b）、先用短呼吸练习纯熟，渐渐加长，最长时每一呼一吸约能占时一分钟，但决不可勉强，务使自然。</p>\n<p>　　（c）、呼吸的气息，宜缓而细，静而长，徐徐注入到下腹。</p>\n<p>　　（d）、呼吸时应用鼻而不可用口，因为鼻是专司呼吸的器管，内有毛，可以障蔽尘埃。口并非呼吸器，假使用以呼吸，等于侵夺鼻的功用，渐渐有使鼻孔阻塞的可能，而且尘埃入口，易生疾病，所以无论什么时候，口宜噤闭，不但在静坐时应该这样。</p>\n<p>　　（e）、每日清晨可择空气新鲜的地方，练习五分钟至十分钟。</p>\n<p>　　（f）、至于静细的呼吸，每口不论什么时候．随时随地，都可练习。</p>\n<h3>　　（3）、静坐时的调息功夫</h3>\n<p>　　上面已经说过，调和气息，是学习静坐下手时的一项重要功夫。因为息不调和，心便不能安定。而所谓息，共可分为四种相状：一、风相，凡气出入有声的叫做风相；二、喘相，出入虽然无声，但结滞而不通利的叫做喘相；三、气相，出入虽无声，也不结滞，但不能静细的叫做气相，(这三种都是不调和相)；四、息相，既无声音，也不结滞，也不粗浮，虽在极静的时候，也不觉鼻息出入，气息若存若亡的，叫做息相，息相方是调和的相。</p>\n<p>　　凡平时能练习静细的呼吸，以及静坐已有相当时间，心念安定的人，一入坐，不数分钟，气息便得调和，而自己也不觉得有呼吸一回事，这样原不需要再着意去调，反使心不安定，因为心念安定不动，气息便自然调和。但初学的人，每每不免有心烦意乱、息不调和的情况，耶末町根据下列两．种方法来加以调和：</p>\n<p>　　（a）、数息就是在坐定以后，默数自己的呼吸/一呼一吸叫一息，或在入息时数一，出息不计数，再入息数二；或在出息时数一，入息不计数，再出息数二。这样数至十，乃再从一数起，渐渐纯熟以后，可数至一百为一个单位。假使没有数到十或一百，而中途心起杂念，那末重新从第一数起，这样循环安详地徐徐而数，久久纯熟，便可收心息相依、身体轻安的功效，并可消除初学静坐最易发生的杂念纷飞和昏昏欲睡的两种毛病。</p>\n<p>　　（b）、随息学习上面所述的数息法纯熟后，息既虚凝，心念也渐入渐细，这时便可进一步放弃数息，而用随息的方法，就是不再计数。但一心依随息的出入，念兹在兹，心不散乱。这一方法纯熟后，渐观渐细，<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>此息仿佛从八万四千毛孔中出入，好象云蒸雾散，到这一地步，便能身心空灵，诸病消除。</p>\n<p>　　随息纯熟以后，心念更觉凝静，便可放弃随息功夫。更进一步来做好下面的调心功夫。</p>\n<h3>　　静坐时的思想</h3>\n<p>　　静坐的目的，不但在于促使身体的健康，而最最重要的，还是在于求妄心的调伏，妄心调伏则智慧明朗，身体的健康，尚是余事。</p>\n<p>　　前面所说的数息，随息时，虽是调息的方法，实际上，也正是调心的良好方法，因为专心数息时，心息相依，念头便无法驰散，所以在佛法上，教多散乱的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，用<a href=\"/remen/shuxiguan.html\" class=\"keylink\" target=\"_blank\">数息观</a>来对治。这里为了文字记述的方便，不得不将调身，调息，调心，分别来说明，在实践时，原是同时进行无法分开的，不过我们的思想，纷纭杂乱，最难控制，数息、随息等，尚是初步的调心方法，自有进一步由粗入细，加以调伏的必要。关于调心的方法如下：</p>\n<p>　　（1）、系心一处法我们的意识界，恰像舞台，各个念头，恰像演员。忽来忽去，时时隐现在舞台中，没有顷刻的停止。所以欲使<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>不起，极为困难，不过根据心理学的公例，当我们心意所注的一点愈明显，那末其他的杂念，便愈隐伏。因此我们在静坐中能注意于某一点，那末妄念便渐渐消除。系心一处法就是<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>一切杂念。而专心存想脐间或鼻端，这样因心有所缘，渐渐纯熟，便不至胡思乱想，正像将猿猴锁于一处，它便无法跳腾一样。</p>\n<p>　　学静坐最易发生二种现象：一、初坐时心中浮散，支持不定，二、静坐稍久，妄念较少时，心中昏沉，容易磕睡，注意脐间的办法，不但可以对治散乱浮动，而且根据生理上的定则，我们心念专注在什么地方，血液也必集中在什么地方，系心脐间或脐下，能使血液下降，有治病健身的作用。至于治昏沉的办法，最好注意鼻端，使心念向上，精神振作，而且有助于调息。一般说来，在晚上静坐时，由于日间劳倦，容易有昏沉现象，若早晨静坐，便不会发生。</p>\n<p>　　（2）、返照<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>法上面所说的系心方法，不过是集无数的妄念归于一处，使不驰散，还是一种较浅的，对治浮沉的止心办法。实际上，既有所着，仍不离攀缘<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，不是究竟的安静，因此，对治得效之后，必须舍弃，再进一步的由浅入深，用内观的方法。这种内观方法，也可叫内视术；就是我们平时的两目，都注视外物，当静坐时，可先放下身心一切万缘，将两目合闭，来向内细细返看自己的念头。那时一定觉得妄念来来往往，生灭不停。对于这些妄念，我们既不要去攀缘它，也不要去遣除它，只要知道它本来空寂，耐心静静观照，甲念起时一返照，甲念便空，乙念起时，再返照，乙念又空，这样念念生起，念念返照，便得念念空净，这实是正本清源的调心方法。</p>\n<p>　　初学静坐的人，往往有这样一种感觉，“不学静坐，妄念尚少，一学静坐，妄念反多”，这是不正确的。要知道我们的念头，忽生忽灭，本来很多，不过平时在动乱之中，不易察觉，一旦习静之后，方能了了看清，比如室内虽有飞尘而不见，假使门窗透入阳光，方见尘埃纷纷飞舞，所以能察觉妄念多的正是自觉的第一步，我们只要一切摒弃勿想，用坚定不移的毅力，精勤地练习观照功夫，到相当时间，妄念便能自然销落而达到，心意寂然的境地。这种观照功夫，假使在静坐中练习纯熟，渐渐能在平时日用之间，刻刻用心，凛然觉照，做到虽不静坐，也能如静坐时的心志静定，自将得更大的受用!</p>\n</div>"
    }
]