[
    {
        "title": "【喇嘛】-喇嘛是什么意思",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"304\" src=\"https://www.liaotuo.com/uploadfile/2016/0104/20160104024103639.jpg\" style=\"width: 360px; height: 238px\" width=\"365\" /></p>\n<h2><a href=\"/remen/lama.html\" class=\"keylink\" target=\"_blank\">喇嘛</a></h2>\n<p>　　喇嘛（音译自藏文：བླ་མ，藏语拼音：lama，威利：bla-ma），藏传<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>术语，意为上师、上人，为对藏传佛教<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>之尊称，长老、上座、高僧之称号。“嘛”是对待一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>犹如母亲呵护自己的孩子一般慈悲，是慈悲至高无上的意思，有这样至高无上慈爱的人，叫做“喇嘛”。</p>\n<p>　　喇嘛也是“上师”与“和尚”的意思。喇嘛有两个含义：一个是“姓氏的喇嘛”，一个是“恩德的喇嘛”。姓氏的喇嘛就是氏族的喇嘛，比如父亲是喇嘛，他的儿子也是喇嘛。恩德的喇嘛就是“恩师”与“上师”</p>\n<h2>形成经过</h2>\n<p>　　藏传佛教 的起源可以追溯到古象雄王朝，古象雄的王子幸饶弥沃如来<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>（释迦牟尼佛前世“白幢天子”的师父），为了救度众生而慈悲传教了“古象雄<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>”，也就是\"雍仲本波佛法”（简称\"本教\"），“雍仲本教”是幸饶弥沃如来佛祖所传的如来<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。雍仲本教的《甘珠尔》其实就是藏族一切历史、<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>和文化的滥觞与源头，是研究藏族古代文明的极其珍贵的资料，这也是任何藏文化研究者都无法绕过的一块重要领域。2013年7月，“古象雄佛法”<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>汉译工程已经被列入“中国社会科学院”的重点科研课题。</p>\n<p>　　从公元七世纪印度佛教传入吐蕃以后，印度佛教与本波佛教之间各自互相吸收了许多对方的内容而各自得到了发展，因为印度佛教与本波佛教在<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的本源上是完全一致的。印度佛教大量吸收了本波佛教的内容，使其能够更深入地根植于当时的社会并逐渐发展成为了现代的“藏传佛教”。</p>\n<p>　　在藏传佛教的教派中，不单单是宁玛派，连噶举派、萨迦派、格鲁派也都在运用着 “本教” 中的<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>本教<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>，包括、医学、天文、历算、招财、招寿、替身仪轨、烟供等等，“本教”仅仅在烟供、荟供、火供等方面的各种仪轨就超过了五百多涵，其内容也非常广泛丰富。</p>\n<p>　　西藏佛教史籍对佛教如何传到西藏有一个神话记载。传说大约在公元5世纪，一天吐蕃王室的祖先拉托多聂赞在屋顶上休息，忽然天上掉下来几件佛教宝物，国王不懂它们的用途，只听见空中有声音说，在你五代以后将有一个懂得这些东西的赞普（吐蕃王朝的国王）出现。</p>\n<p>　　松赞干布。先后与尼泊尔赤尊公主和唐朝文成公主联姻。赤尊公主和文成公主各自带了一尊佛像到西藏，修建起拉萨著名的大、小昭寺，随公主前来的工匠也陆续修建寺庙，随同前来的佛教僧人开始翻译<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>，佛教开始从尼泊尔和汉地传入西藏。</p>\n<p>　　松赞干布去世后，西藏历经半个多世纪的权力之争，到其曾孙赤德祖赞时，才又大力发展佛教。公元710年，赤德祖赞向唐朝请婚，求得金城公主。金城公主到吐蕃后，把文成公主带去的佛像迁到大昭寺供奉，安排随行僧人管理寺庙，主持宗教活动。金城公主还成功地劝说王室接纳从西域逃出的僧人，为他们修建了7座寺庙。这些措施促进了佛教在西藏的发展。直到赤德祖赞的儿子赤松德赞掌权后，佛教发展趋势才得到改善。</p>\n<p>　　为巩固王权，赤松德赞以佛教为号召，他请来印度著名僧人寂护和<a href=\"/remen/lianhuasheng.html\" class=\"keylink\" target=\"_blank\">莲花生</a>，于公元799年修建起西藏第一座剃度僧人<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>的寺院一一桑耶寺，剃度7名贵族子弟出家，开创了西藏佛教史上自行剃度僧人的先河。</p>\n<p>　　在邀请印度高僧的同时，赤松德赞还派近臣前往内地请僧人到西藏讲经。根据其要求，公元781年唐朝开始轮流派僧人去西藏。受人尊敬的大乘和尚摩诃衍，就是汉族僧人在西藏的代表，他在西藏传教l1年，著述9部经论，讲经<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，使汉地佛教在西藏兴盛起来。</p>\n<p>　　以后，历任赞普都不遗余力地提倡佛教，兴寺建庙，翻译佛经，以王室收入<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>僧人，以僧人参政削弱大臣权势。王室利用佛教巩固王权，于公元842年，他们趁国王赤祖德赞酒醉时将其谋害，拥戴其兄朗达玛为赞普，掀起一场大规模的灭佛运动。</p>\n<p>　　朗达玛灭佛不久后，遭佛教徒暗杀。吐蕃权臣，挟王子自重，互相征战。随后一场奴隶平民大起义又席卷吐蕃，西藏陷入各个势力割据一方的分裂状态，藏传佛教“前弘期”至此结束。</p>\n<p>　　公元10世纪初，藏区步入封建社会，原割据一方的吐蕃权臣，成了各地的封建势力，他们积极开展兴佛活动，佛教得以在西藏复兴。不过这时兴起的佛教无论在形式或内容上，与吐蕃佛教都有很大不同，在于西藏本土古象雄佛教的互相吸收、互相接近、互相融合的过程中，随着封建因素的增长，完成其西藏化过程，形成既有深奥佛教哲学思想，又有独特西藏地方色彩的地方性佛教。至此，藏传佛教终于形成，步入其“后弘期”。</p>\n<h2>发展历史</h2>\n<p>　　松赞干布积极发展与邻近地区的友好关系，先后与尼泊尔尺尊公佛教在西藏发展的历史分两个历史阶段，藏文史籍一般称“前弘期”和“后弘期”。7世纪中叶到9世纪中叶约2百年为前弘期。这一时期，佛教在吐蕃还是一种外来宗教，它在与当地原有的苯教不断斗争中发展起来，其间曾一度占优势。赤松德赞（755年一797年在位）时从印度迎来寂护和莲花生两大师，建立桑耶寺和僧团组织。期间，在印传佛教和汉传佛教之间曾引发一场争论（792年—794年），最终印传佛教在赞普的支持下得以取胜。赤祖德赞（815年一838年在位）时，又委僧人为大相，并规定七户养僧一人之制等，佛教得到进一步发展。他的继任者赞普达玛期间，佛教遭受严重打击，但其后约百年，卫藏地区的佛教仍不绝如缕。</p>\n<p>　　10世纪，佛教逐渐由西康、青海、阿里等地将<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>传回卫藏地区。同时有一些人去印度求法，其中最有成绩的是仁钦桑波（rin-chen-bzang-bo，958年—1055年），译出以<a href=\"/remen/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>为主的不少显密经典。又从印度迎请阿底峡进藏，主要传授显宗教理，兼及密宗。这样，佛教逐渐在吐蕃复兴，并发展成独具高原民族特色的藏传佛教，而且从11世纪开始陆续形成各种支派，到15世纪初格鲁派的形成，藏传佛教的派别分支才最终定型。主要有宁玛派、噶当派、萨迦派、噶举派等前期四大派和后期的格鲁派等。格鲁派兴起后，噶当派则并入格鲁派而不单独存在。藏传佛教的派别差异既不像印度的小乘十八派是由于其遵行的戒律不同而分派，也有异于印度的大乘因其主张的教义不同而分派。其派别差异是因不同师承、不同修持教授、所据不同经典和对经典的不同理解等佛教内部因素和不同地域、不同施主等教外因素而形成众多派别。这是藏传佛教的又一特点。主和唐朝文成公主联姻。尺尊公主和文藏传佛教教义特征为：大小乘兼学，显密双修，见行并重，并吸收了苯教的某些特点。传承各异、仪轨复杂、像设繁多，是藏传佛教有别于汉地佛教的一个显著特点。显宗说一切有部、经部、<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>、<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>四宗中以中观为最发达。龙树一系的论典以“正理聚六论”为中心，经过宗喀巴的倡导，中观应成派月称所著的《入中论》最受推崇，成为中观论著的代表作。《现观<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>论》与《入中论》两书汉文未译，而龙树的《大智度论》藏文未译，因而成为藏传与汉传佛学之一重要区别。藏传显宗教理的传授与探讨特别注重口头的立宗辩论，辩论时严格按照因明学的“应成论式”的规矩进行，辨析精细入微，为其他各系佛学少有。藏传密宗一般分为事部、行部、瑜伽部、无上瑜伽部等四部，而各宗派多以无上瑜伽部的各种教授为主要<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>法门。</p>\n<p>　　藏传佛教的传承方式既有师徒传承方式，如宁玛派、噶举派、噶当派；也有家族传承方式，如萨迦派，基本上采用以昆氏家族为基础的家族传承方式。但最具特色的还是活佛<a href=\"/remen/zhuanshi.html\" class=\"keylink\" target=\"_blank\">转世</a>制度。“政教合一”是藏传佛教的另一大特点。历史上，藏传佛教的多数派别都和一定的政治势力（包括地方实力集团或家族势力）结合在一起，形成政教合一制度，教依政而行，政持教而立，彼此依存。这一制度在吐蕃赤祖德赞赞普时初见雏形，至萨迦派时正式确立，其后不断完善，待格鲁派掌西藏地方政教大权后而达鼎盛。1959年西藏民主改革时废除。</p>\n<p>　　中华人民共和国成立后，重要的寺院依其重要的程度分别规定为国家级、省级、县级的文物重点保护单位。文革期间许多寺院受到严重的破坏， 1979年以后由政府资助和<a href=\"/remen/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>群众自愿集资逐渐恢复。藏传佛教的文献极为丰富。藏文《大藏经》分《甘珠尔》和《丹珠尔》两大部分，其中《甘珠尔》包括显密经律，主要为佛教的原始经典，　《丹珠尔》为论藏，系释迦牟尼<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>对佛语的阐释和论述的译文集成。</p>\n<p>　　藏传佛教于后弘期时传入青海、四川、甘肃、内蒙、云南及今蒙古人民共和国，13世纪后开始传入元、明、清宫廷，对中央政府的治藏政策和宗教政策产生了重大影响。还先后传入尼泊尔、不丹、锡金、拉达克等周边邻国及邻境。本世纪初，开始传入欧美，分别建有传教中心或藏传佛教研究机构，并得到迅速发展，现已成为西方国家的不可忽视的宗教信仰之一。</p>\n</div>"
    }
]