[
    {
        "title": "【临终】-临终的意思",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"325\" src=\"https://www.liaotuo.com/uploadfile/2016/0107/20160107022315161.jpg\" width=\"269\" /></p>\n<h2><a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　临终即将死。 当患者走向他<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>中最后一个阶段时，身体都会发生一些转变，家属需要清楚并留意。但并不是每位患者都会有同样的变化，有些症状可能不出现，也不是所有的症状都会在同一时间出现。</p>\n<h2>词语概念</h2>\n<h3>　　基本信息</h3>\n<p>　　词目：临终</p>\n<p>　　拼音：lín zhōng</p>\n<p>　　英文：at the point of death</p>\n<h3>　　基本解释</h3>\n<p>　　[approach one's end;immediately before one's death;be on one’s deathbed] 人即将死亡</p>\n<p>　　临终嘱咐</p>\n<h3>　　引证解释</h3>\n<p>　　指将死。</p>\n<p>　　《<a href=\"/ctwh/shi/24s/houhanshu.html\" class=\"keylink\" target=\"_blank\">后汉书</a>·祭肜传》：“﹝ 祭肜 ﹞临终谓其子曰：‘吾蒙国厚恩，奉使不称，微绩不立，身死诚惭恨。’” 晋 潘岳 《夏侯常侍诔》：“临终遗誓，永锡尔类。” 宋 梅尧臣 《宁陵阻风雨寄都下亲旧》诗：“母当临终时，嘱我贫莫羞。”《儒林外史》第六回：“这两套衣服和这银子，是二老爷临终时说下的，送与大老爷做个遗念。” 周而复 《上海的早晨》第三部一：“父亲生前也特别喜欢他，临终辰光还再三嘱咐，叫他不要忘记照顾这个小弟弟。”</p>\n<h2>基本含义</h2>\n<p>　　当患者走向他生命中最后一个阶段时，身体都会发生一些转变，家属需要清楚并留意。但并不是每位患者都会有同样的变化，有些症状可能不出现，也不是所有的症状都会在同一时间出现。</p>\n<h3>　　吞咽困难，越吃越少</h3>\n<p>　　因身体器官功能日渐衰竭，此时患者吞咽功能减退或拒食等现象，造成患者食量少、无食欲、吃不下或不想吃等，此时患者可能并不会感到饥饿，可能无法消化及代谢食物，所以不要强迫患者进食，以免增加患者的困扰。即使没有进食，也要定时清洁患者的口腔，保持其口腔湿润。</p>\n<h3>　　濒死喉声</h3>\n<p>　　由于机能的衰竭，患者无力将集聚喉头部的口腔分泌物吞下或排出，或肺部的分泌物增加，于吐气时发出痰音般的嘎嘎声（痰音在吸气、吐气都会发生，嘎嘎声只有在吐气时才有，而且声音较明显）。此时如果给患者吸痰也只能缓解几分钟。也可以把患者的头侧转，或抬高床头，会使呼吸容易些。</p>\n<h3>　　越睡越多</h3>\n<p>　　并将会逐渐地花更多的时间在睡眠上，而且不易被叫醒。这是身体代谢改变的结果。注意把握患者清醒的时间，多陪伴他，与其沟通，给予其最大的支持。</p>\n<h3>　　视觉、听觉、味觉的改变</h3>\n<p>　　濒死期由于神经系统机能衰退，患者视力逐渐模糊，目光呆滞，无焦距，目视前方，睡眠时眼睛不能完全闭合，球结膜水肿。多数患者常伴有口干、口苦、吞咽困难、口角发炎及唇裂等症状。听觉是患者最后消失的生理功能，患者常能听到周围的声音，但无力回应或表示。</p>\n<p>　　可让室内的灯光柔和些，播放轻柔或患者喜欢的音乐。经常跟患者保持对话，可以靠近他慢慢说，表达自己的感受。</p>\n<h3>　　皮肤的变化</h3>\n<p>　　濒死患者因血液循环变慢、周围血管痉挛、极度虚弱、营养不良等原因，以至全身皮肤苍白湿冷、肌肉无光泽、暗淡，松软无弹性或有盗汗现象，四肢末梢冰冷，口唇指甲呈灰白或青紫色，皮肤可出现淤血斑点，身体靠床侧肤色渐深或出现紫斑。</p>\n<h3>　　<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>改变及烦躁不安</h3>\n<p>　　患者对时间、地点、人物的辨别能力减低，回答的话语变得很简单。可以握着患者的手，主动告诉患者日期、时间以及何人在场，会令患者有安全感。</p>\n<p>　　有时患者会坐立不安或烦躁，这时先要查看是否存在疼痛、缺氧或膀胱积尿无法排出等生理上的原因，及时处理。但临终阶段的烦躁不安多与心理因素有关，此时家人可以与患者有肢体接触，如紧握他的手，用温柔的声音跟他说话，轻柔的音乐和柔和的灯光也可以令患者平静下来。在需要时，应使用医生处方的药物。</p>\n<h3>　　大、小便失禁</h3>\n<p>　　濒死患者由于血液循环变慢导致肾功能衰竭，表现为尿少而颜色深，甚至尿失禁或尿潴留。胃肠道因蠕动减弱，表现气体积聚于肠胃，患者常感到腹胀与恶心。肛门及膀胱括约肌松弛，患者常出现大小便失禁。这时可使用尿垫或成人纸尿裤，维持患者的清洁与舒适。</p>\n<h3>　　出现幻觉</h3>\n<p>　　由于血液循环减慢，造成脑部缺氧，患者可能会看见一些其他人看不见的人或事物，如已经去世的亲友，或出现其它幻觉。这时家人要保持镇定，不要恐慌，尽量慢慢地且自信地与患者说话。留意他说话的内容或语气，可能他想表达某些意思。同时，应该用被子或软垫护住床栏或其它部位，以免患者碰撞受伤。</p>\n<h3>　　临终脱水</h3>\n<p>　　濒死期患者可能会有临终脱水现象，主要是患者不能再进食及喝水，通常是一种自然过程。</p>\n<h3>　　呼吸变化</h3>\n<p>　　会出现不规律的呼吸形态，张口费力地呼吸，呼吸变浅而且速度加快，或出现10—30秒呼吸暂停的现象，这是临终患者“呼吸停止”前的一个重要征兆。</p>\n<h3>　　其他</h3>\n<p>　　当死亡临近时，疼痛和不舒服的感觉，通常会减弱些。</p>\n</div>"
    }
]