[
    {
        "title": "【六波罗蜜】是什么意思？六波罗蜜有顺序吗？",
        "date": "2016-03-17",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x516D;&#x6CE2;&#x7F57;&#x871C;&#x3011;&#x6709;&#x987A;&#x5E8F;&#x5417;&#xFF1F;&#x516D;&#x6CE2;&#x7F57;&#x871C;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0903/20180903021501957.jpg\" title=\"&#x3010;&#x516D;&#x6CE2;&#x7F57;&#x871C;&#x3011;&#x6709;&#x987A;&#x5E8F;&#x5417;&#xFF1F;&#x516D;&#x6CE2;&#x7F57;&#x871C;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" /></p>\n<p style=\"text-align: center;\"><strong><a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>是什么意思？<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>六波罗蜜介绍</strong></p>\n<p>　　六波罗蜜是指菩萨<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的六种行持，是佛教的大乘<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，是六种度脱<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>、抵达无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>的方法。菩萨之大行，谓之波罗蜜，有六种，即「<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>、持戒、忍辱、<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>、<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>、<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>」。布施对治贪心、忍辱对治嗔心，<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>解除愚痴。持戒、精进、禅定，则是息灭贪嗔痴的辅助修行，菩萨修此六法，究竟自利利他之大行，到<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>，故称六波罗蜜。六波罗蜜高度概括了菩萨修行的各个方面，所以又称<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行。菩萨修行六度不能离开慈悲心，所以佛当年先讲四无量心，而后宣讲六波罗蜜。而修行般若波罗蜜又不能离开前五度，否则即是断学般若。佛在多部经中反复告诫切不可断学般若，<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>在三恶道。</p>\n<h2>一、檀波罗蜜（布施）</h2>\n<p>　　檀者檀那之略，译曰布施，财施，<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>施，法施之大行也。布施是什么？布施是一种善的心理，是修布施时发起施舍的思心所；布施也是一种行为，是修布施时所产生的身语的行为。因此，布施的关键因素不是财物，而是布施时的舍心。</p>\n<p>　　什么才是<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的布施？并不是说把全部财物施舍给他人，令所有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>远离贫困之苦。如果那样的话，修行就没有尽头了，因为众生无量无边，<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>没有谁会有能力令所有众生远离贫困。</p>\n<p>　　圆满布施的标准在于，我们能够破除自身的悭贪和执著，并将布施之心修习圆满，没什么不愿布施给他人，也没有一个众生是我们不愿布施的。如果具备这样的施心，布施也就圆满了。</p>\n<p>　　布施的种类有三，财布施、无畏布施、法布施。法布施，即为众生开示如实而没有颠倒的<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a><a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>和工巧明等，以及世间各种<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>而有益身心的知识技能，都能如理地为对方传授，并引导他们走入<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>学处。无畏施，当对方遭遇统治者压迫或黑社会欺凌，以及猛兽、非人、各种天灾人祸的恐惧，将他们从困境中解救出来，帮助他们摆脱恐惧。财施，即以<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>帮助他人。</p>\n<p>　　布施的差别，主要从<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>的不同身份和布施种类进行说明。财物的布施，主要是在家菩萨道行者所修习的，<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>菩萨应该重点修习法布施，而不是财施。这是《菩萨别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>经》中所说的。这是从不同身份，说明布施应各有侧重。</p>\n<p>　　为什么说在家众侧重财施而出家众侧重法施呢？其中有什么特别的含义呢？主要担心出家众如果广行财施，就要想方设法地赚钱，会影响到闻思和修行。这是《大乘集菩萨学论》所说的。</p>\n<p>　　所以，这主要是防止出家人为行布施而求财，如果这么做对修行没有任何不良影响，只是因为往昔福德所致，那么也应该在法布施的同时广行财施。换言之，我们不要把这个问题绝对化，觉得出家众只能行法施而在家众只能行财施。因为法施的关键是有<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，而不是唯身份论，如维摩诘<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>即是一例。大德夏惹瓦说：我不对你们说布施的好处，但必须对你们说执著财富的过患。</p>\n<p>　　有的出家人多方经营，积集财物，多方毁坏<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>而行布施，这是诸佛菩萨所不喜欢听到的。所以从原则上说，出家人的正业是修行和弘法，至于财施，只需根据自身条件<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>而行。</p>\n<p>　　布施并不是简单地给别人一些什么，关键是将布施心培养起来，调动起来，让这念舍心在心相续中形成强大力量。修习布施也是为培养这种心行服务的，这样才能战胜<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>中的悭吝和贪著。作为菩萨行者所修习的布施，不仅需要克服障碍布施的悭贪心理，进一步，还要以慈悲心生起将所拥有的一切施舍众生的意愿。</p>\n<h2>二、尸罗波罗蜜（持戒）</h2>\n<p>　　尸罗，译曰戒，在家出家小乘大乘等之一切戒行也。戒，是指<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>，包括摄<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒、摄善法戒和<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情戒。戒的作用在于防非止恶，从而止息不善的心相续，强化善的心相续。从持戒来说，尤其是声闻戒，主要是从行为进行判断。但任何一种行为都有其心理基础，杀盗淫妄的心理基础就是贪嗔痴。一旦断除贪嗔痴的心相续，自然不会再有杀盗淫妄的行为。所以，持戒要止息的不只是外在行为，关键在于这些行为背后的心理基础。持戒的圆满与否，并不在于使众生全部远离损害，而在于断除损害众生的心理。</p>\n<p>　　「戒」在佛教来说，基本的有五项，称为<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>，如果不能全部受持，受持三条、四条也是可以的，愿意受多少就算多少，这是和其他<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>不同的地方。<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>时有个「戒体」，戒体是特殊的名词，为什么菩萨戒可以一受永受，而声闻戒只能一生受，这是因为戒体观念的不同。</p>\n<p>　　声闻戒属于色法，小乘有部宗认为，色法即是在受戒时，身口二业有发显之表色，以及依四大而生，以身口为缘，有防非止恶功能的，名为无作色、无表色。色法是物质的，当物质的身体死亡或消失，即使不舍戒，戒自然不存在，戒体也就没有了。</p>\n<p>　　声闻戒有在家戒及出家戒，共有四种戒品。在家的五戒与八戒，出家的<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>与<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。在家戒又叫世间戒，重于身口二业的现行，《增一阿含经》卷二十〈声闻品〉之一云，五戒得分分受，萨婆多部则不许分受五戒，《成实论》及《大智度论》许可随分多少受，八戒则须全部受。出家戒又叫出世间戒，身口意三业并重，必须要全部受。</p>\n<p>　　菩萨戒是属于心法，《大乘<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>论》便指出，受戒时，有发动思之心所，此心所之种子相续，而有防非止恶的功能，为依于受戒时之表色作用而起之功能，故附于色之名，实为心法。心法直至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>为止，都是存在的，它可以此生受了下一生再来受，或是这一生受了，觉得心已经不再坚固精进，可以增上受戒，使得心能够再次熏习。</p>\n<p>　　菩萨戒有十善戒及<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>的二种戒品。《大智度论》以十善戒为总相戒，其余一切戒为别相戒。而三聚净戒又分在家及出家两种，是随持声闻戒而发大<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>，那就是：摄律仪戒──大小乘一切律仪；摄善法戒──大小乘一切法门，如三十七道品、四摄、六度；摄众生戒──以佛法饶益一切有情。三聚净戒能对治恶业，清净身心。</p>\n<p>　　声闻戒是以出离心为主，断除欲望而出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>，菩萨戒则是以出离心为基础，以菩提心为根本。在家与出家的出离心是不一样的，在家的出离心，指的是虽然有眷属、有财产、有事业，但是在拥有的当下要观空；观空就是知道一切均为<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所生，并非是究竟的、永恒的、不变的，用这些暂时所拥有的资源来利益众生，不占为己有。因此，在家居士的出离心跟菩提心是相应心，没有出离心，菩提心发不起来。</p>\n<p>　　菩萨戒是以利益他人来做为利益自己的方法。我们每个人都是很自私的，所谓「人不为己，天诛地灭」，如果你能从照顾自己的家属开始，扩及环境里所有的人，用一切的资源来利益他们，就一定能受到他们的欢迎、拥护、回馈，如此才是真正的自利利他，而且是一本万利。</p>\n<h2>三、羼提波罗蜜（忍辱）</h2>\n<p>　　羼提，译曰忍辱，忍受一切有情骂辱击打等，及非情寒热饥渴等之大行也。通常所说的忍，主要是指受到别人伤害时能够忍辱。而菩萨道修行中的忍辱包含三个方面，一是忍耐冤家的伤害，为耐冤害忍；二是忍耐艰苦的<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>环境，为安受苦忍；三是忍耐佛法对自己固有观念的颠覆，为谛察法忍。</p>\n<p>　　能够障碍忍辱的心理，主要有嗔恨、怯弱、不解和不乐等。嗔恨，是对不悦意的境界心生抵触乃至报复。怯弱，则是不能吃苦耐劳。不解和不乐，是对真理不能如实理解，所以不乐意接受。</p>\n<p>　　忍辱的圆满，是要对治自身的嗔恚、怯弱、不解、不乐。若能彻底灭除自身的嗔恨和愤怒，使无嗔成为内心主导力量，忍辱的修行便成就了。并不是说，要使一切有情都远离愤怒，忍辱才能修习圆满。即使<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>在世时，也照样有人会对佛陀出言不逊。可见，忍辱的圆满是在于自身心行的圆满。</p>\n<p>　　忍辱的种类大体有三种。首先是对他人带来的伤害都不要在意。这并不是说，让我们在心怀不满时强行忍耐，那样往往会使内心压抑，积郁成疾。真正的耐辱，其实是忍无可忍，也就是不觉得有什么需要忍耐。之所以需要忍，一方面是因为我们把事情看得太实在了，一方面是因为心量狭隘而产生的排斥。如果我们能从缘起来看世界，了解一切都是因缘假象，哪有什么值得忍耐的呢？</p>\n<p>　　其次是对身心产生的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>能够泰然处之，对于和我们原有认识相抵触的佛法真理能够欣然接受，这就是安受苦忍和谛察法忍。可见，佛法所说的忍辱重点不在于忍耐，而在于正确的接纳——这种接纳又是建立在智慧观照的基础上。</p>\n<p>　　我们要培养忍辱的<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>，首先还是要从观念进行转变，需要思惟忍辱的殊胜利益，和不能忍辱的负面作用。认识转变了，修行才可能有持久的动力。</p>\n<p>　　思惟忍辱的利益，就是要想到，如果我们能够忍辱，必然不会四处树敌，亲友也不会彼此反目而远离你。此外，还能拥有<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>和快乐，临命终时，不会因曾经的鲁莽粗暴而后悔，而且会因修习忍辱得生人天，趣向善道。</p>\n<p>　　<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>者大多会有这样的经验，虽想<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>利他，但受到众生伤害时，往往会感到不满，感到失落，由此退失<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。《摄波罗密论》告诉我们：对于那些将要舍弃利他心的众生，忍辱是最为善巧的对治法门。而世间一切善业、快乐等圆满果报，往往会被嗔心所破坏，如果具备忍的修养，就能挽回嗔心带来的损害。</p>\n<p>　　忍辱还是断除嗔心最有效的力量，是灭除害人之心的<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>，对于世间一切损恼，忍辱都能从根本上予以解除。如果以打报打，以骂报骂，世界就会危机四伏，动荡不安。唯有忍辱才能息灭仇恨，消除对立，化干戈为玉帛。</p>\n<p>　　因为忍辱所具有的作用，所以它是菩萨行者的铠甲。如果那些粗暴众生恶言相向，对我们报以毒箭般具有杀伤力的辱骂，但因为有忍辱之铠的保护，即使听到再恶毒的话，也觉得像是赞叹一样，像是天女散布的妙花那样，不会使我们受到任何伤害。也因为忍辱，使我们美名远播，为人称扬。</p>\n<h2>四、毗离耶波罗蜜（精进）</h2>\n<p>　　毗梨耶，译曰精进，精励身心进修前后之五波罗蜜也。精进，简单地说就是勤奋而努力。但这种努力是有特定内涵的，唯有对断恶修善所做的努力，才称得上精进。所以，它是修习善法过程中的重要增上缘。所谓精进，就是对修习善法和利益众生的事业生起勇猛之心，以及由此产生的身口意三业的行为。</p>\n<p>　　精进的种类共有三种，分别是披甲精进、摄善法精进和饶益有情精进。第一是披甲精进。菩萨在修习精进时，要以勇猛的心力为先导。这种意愿就像身披铠甲一样，能够保护菩萨发心不退。因为具备这种意愿，即使用百千倍的三无数大劫，哪怕只是为了解除一个有情的痛苦，哪怕要入住<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>才能帮助他成佛，也会毫不犹豫地勇往直前，为成就无上菩提而精进不退。第二是摄善法精进，就是为了修习布施、持戒、忍辱、精进、禅定、般若六度，勇猛精进，坚持不懈。第三是饶益有情精进，凡是对众生有利的事，都励力而为，在所不辞。</p>\n<p>　　精进修行对我们有什么利益？因为精进属于心所有法，必须由心而生，而不仅仅在于行为。如果对此有了明确认识，才会有源源不断的动力。事实上，趋利避害正是一切有情的本能，关键是要认识到，究竟什么才是真正的利益。</p>\n<p>　　在一切善法修行中，精进是极其殊胜的，任何善法的成就都离不开精进。因为依止精进，我们才能安住在殊胜的快乐中，也就是禅定之乐，体证空性之乐。不仅佛法修行离不开精进，包括世间一切善法的成就，同样离不开精进。因为精进努力，我们才能获得世间的物质财富，成就清净的人天善果（下士道），才能断除我见和<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>（中士道），成就佛菩萨那样的高尚品质（上士道）。</p>\n<p>　　如果我们具备从不厌倦的勇猛精进，那么，无论想做什么都能成就，不可能有什么做不到的。当然，精进也是要善巧，要得法，不是蛮干就可以的，否则越精进越容易出问题。</p>\n<p>　　一个精进修行者，白天黑夜都不会空过，都会积聚<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，不再向下堕落。精进者还能获得过人之法，功德日日增长，犹如盛开的青莲花。据说青莲花种子微小，却能生长出硕大的茎叶和花朵，以此比喻精进的力量。</p>\n<p>　　不精进的过患，正如《海慧问经》所说：那些<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>的人，菩提道对他们来说简直遥不可及。他们不会修习布施乃至般若等六度行，所以也没有能力利益他人。有句话叫做“没有天生的<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>，也没有自然的释迦”，佛菩萨品质都是通过精进修行成就的。而那些懈怠者，自利尚且不能，更何况是利他呢？</p>\n<p>　　此外，《念住经》也说：懈怠是长养一切烦恼的根本，没有什么问题比懈怠更糟糕的。如果我们有一点懈怠的话，就无法从<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>和混乱的情绪中走出。即使你已具备一定知见，若因懈怠而不去运用的话，这种见也是没有力量的。我们要从这些方面思惟不精进的过患。</p>\n<p>　　障碍精进的违缘主要有两点，一是虽然见到可以修习的善法而不付诸行动，也知道这个法门好，也有能力修，但就是不修，不当做一回事。二是想着我怎么有能力修习这些法门而心生怯弱，觉得这些事情都是菩萨做的，不是自己有能力承担的。</p>\n<p>　　精进生起的四种顺缘，分别是胜解力、坚固力、欢喜力和止息力。第一是胜解力，要深信业果之理，对于善行招感乐果、恶行招感苦果的原理生起坚定不移的信解，这样才能在取舍<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>时生起<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>的动力。如果认识不到这些努力的意义所在，即使能够做一些好事，也很容易受到外力阻挠，难以坚持下去。第二是坚固力，对于没有观察过的事，不管是什么，都不会轻易随之而转。反之，对于经过智慧抉择的行为，一旦着手进行，就会朝着这一方向不断努力，直到达成目标。</p>\n<p>　　第三是欢喜力，应该像婴儿游戏一样，从不感到厌倦，从来不想停止，我们也要用这样的心态精进努力。在修行过程中，我们会认清很多<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>问题，烦恼会不断解除，内在的自主力越来越强，对佛法的领悟越来越轻松。所以，这是一个充满挑战和乐趣的过程，如果修得非常痛苦，必然是方法有误。第四是止息力，也就是松紧有度。如果在修行过程中过于精进，超出身心的承受力而导致疲劳，就要暂时休息一下，使疲劳得到缓解，接着再继续精进。修行要讲究质量，讲究效果，而不是一味打疲劳战，否则很容易使身心劳顿，甚至因为厌倦而退心。</p>\n<p>　　通过以上这些方面的努力，令违缘灭除而顺缘增长，将使身心轻安，就像微风吹过木棉，在安然<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>的状态下精进向前。所谓摇曳之中，就是张弛有度，保持良好的修行节奏。就像琴弦，如果绷得太紧，就会发出噪音甚至断裂；如果绷得太松，又无法奏出乐音。</p>\n<p>　　修学精进时，怎样才算具足六度而行精进呢？以布施为例，不仅需要自己安住于精进，也要令他人安住于精进，这才是精进的布施。其他五度也是同样。</p>\n<p>　　总之，佛法的一切修行都离不开精进，唯有精进地布施、精进地持戒、精进地忍辱、精进地修习禅定、精进地修学般若正观，才能迅速集资净障，成就菩提资粮。可以说，精进是一切法门的加速器。特别需要注意的是，在精进之前需要谨慎取舍。如果方向错误，越努力，就会距目标越遥远。</p>\n<h2>五、禅波罗蜜（禅定）</h2>\n<p>　　禅者禅那之略，译曰惟修，新曰静虑。又名<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，译作定。思惟真理定止散乱之心之要法也。有四禅八定乃至百八三昧等之别。</p>\n<p>　　静虑，就是禅定。静虑，是将心安住于善所缘境，达到心一境性的效果。当心正当安住的时候，其他<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>就没有机会活动了。凡夫的心，就是一大堆混乱情绪加上一大堆错误想法。正是这种混乱，遮蔽了我们对空性的认识。修行所要做的，就是让心安住下来。但这种安住必须是善所缘，才不会有负面效应。</p>\n<p>　　禅定的差别，从<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>进行区分，有世间和出世间两种。一种是世间禅定，如四禅八定；还有一种是出世间的禅定，如直接缘空性作为所缘，这是圣者的静虑。从品类进行区分，主要有三种：一是专门修止，二是专门修观，三是<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>双运。</p>\n<p>　　从禅定的作用上说，分为令身心安住、现证功德和饶益有情三种。现法乐住，是现前获得身心轻安的境界。除了<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>惟心轻安外，其余都是身心轻安。现证功德者，成就<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>，都是由定所引生，这是和外道共通的。至于成就遍处解脱，则不与外道共，因为心念力是为了希求解脱，必入内道佛乘才有。由此引生的<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>，才有遍处解脱功德。什么是遍处？指尽一切处无所不遍之意。<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>时先缘一小境，纯熟后，所缘之境即遍一切。如十遍处之青遍处等，先缘青色小境，然后遍一切皆青色。胜处者，谓如形色等胜一切处。凡遍处胜处都是定力串习的作用，这些静虑是菩萨与声闻共同修学成就功德的静虑。饶益有情静虑者，是以静虑成办十一种饶益有情的静虑。</p>\n<p>　　禅定的生起途径，首先是思惟修习禅定有什么殊胜利益，及不修有什么过患。怎样使所修静虑具足六度？其中的布施，就是自己安住于禅定，并帮助他人安住于禅定。其他五度也是同样。</p>\n<h2>六、般若波罗蜜（般若）</h2>\n<p>　　般若，译曰智慧，通达诸法之智及断惑证理之慧也。般若，是六度的核心所在。如果没有智慧指引，我们所修的布施、持戒、忍辱、精进、禅定，可能都是世俗的有漏行为，无法成为<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>资粮。</p>\n<p>　　总的来说，慧就是我们对所缘的一切境界、事物和法能够进行抉择、判断的作用，明了其中的功德、过失和真伪。同时，也包含对五明的善巧。五明是印度人对世间学问所作的归纳，即有关佛法的内明，有关辩论的因明，有关语言文字的声明，有关医学的医方明，有关科学艺术的工巧明。对这些学问的熟悉和使用，也属于慧的范畴，是通于凡夫和菩萨的智慧。</p>\n<p>　　关于慧的类型，主要分为通达空性、通达世俗和通达有情义利三种。或许有人会说，一切智慧皆含摄于胜义、世俗之中，为什么还要单列“通达有情义利”的智慧呢？这是特别针对菩萨行者以利益有情为重的修行特点而安立。</p>\n<p>　　第一是通达胜义，即通达诸法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>的究竟实相。其中包含两个阶段，一是依闻思正见推理观察，了知一切法无我；二是通过禅修，<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a><a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无我的空性。第二是通达世间一切现象的智慧，主要是通达五明的智慧，这样才能有效地摄受并度化众生。第三是通达利益众生的智慧，这就需要了解，哪些事对有情的现在或未来都有利益，而且是没有负面作用的利益，以及如何利益的原理。利益众生是有前提的，不是他们要求什么你就做什么的。因为众生的很多要求可能是颠倒甚至是<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>的，于人于己皆有害无益。所以菩萨在利益众生时须经智慧抉择，知道怎么做对众生才有好处。</p>\n<p>　　智慧的生起之法，还是应当思惟，具足智慧有哪些功德，没有智慧有那些过患。关于具足智慧的利益，《般若百颂》说：无论看得见还是看不见的功德，根本都在于智慧。所谓见，即当下可以看到的利益；所谓不见，即未来的长远利益。我们要修习现在和未来的利益，就要依靠智慧指引。接着，从修习六度说明智慧的重要性。如果离开智慧，前五度只能成为普通的世间善行。</p>\n<p>　　菩萨对于前来乞求的人，即使布施自身的血肉，也像从一棵长满药物的药树取药一样，没有丝毫我慢、怯弱等分别念。这是因为他们能以智慧彻底通达无我，通达色身的如幻如化。而凡夫的布施则不然，或是落入我慢，觉得自己很了不起；或是落入怯弱，感到害怕而想退却；或是心生分别，对有些人愿意布施，而对有些人不愿布施。</p>\n<p>　　菩萨以智慧了知不忍的过患和忍辱的功德，不论面对众生伤害还是恶劣环境时，都能安然接受，不被外境带来的痛苦所干扰。又因为具足智慧，而能真正了知如何精进之事，善用其心，<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>精进，这样才能事半功倍，在修行路上迅速前进。而当般若的明觉作用生起后，才有能力安住于空性定中。所以说，唯有在般若智慧指引下，才能使布施等五度修得清净，修得圆满。</p>\n<p>　　比如菩萨为了度化众生，会示现转轮圣王等各种身份，但不会被五欲尘劳所左右，因为他具足了慧和忍的力量。虽然看到喜欢的众生，立刻生起猛利的慈心，但不会因此生起贪著。如果带着贪著，心就会有粘性，就会粘到境界上。而菩萨在对众生生起慈悲的同时，因为具有般若智慧，又能保持心无所得，毫无染著。</p>\n<p>　　虽然对于有情之苦生起深深的悲悯和同情，但不会因此陷入悲伤而无法自拔，不会因此对行善生起懈怠。虽然菩萨对那些值得高兴的事感到欢喜，但不会因此对所缘境散乱掉举，浮想联翩。这种欢喜依然是平静的，依然是安住在空性中。虽然菩萨要利益所有众生，自己的一切都可以布施出去。但为了帮助众生获得利益，乃至很小的利益，从来都不会轻易放弃。菩萨所以会有以上这些能力，都是因为具备了空性智慧，这样才能将相违的事善巧地调和起来。</p>\n<p>　　菩萨在修行过程中，每修一种法，都会出现同等的障碍。比如修慈悲时，障碍就是贪著；修喜心时，障碍就是散乱；修平等舍时，障碍就是冷漠。菩萨因为具足智慧，就有能力克服这些障碍。正如《赞所应赞》中所说：菩萨的修行既能安住于空性，同时又能随顺世俗，广泛利益众生。平常的人，或是偏空，什么都不想去做；或是偏有，什么都做得很执著。而菩萨既要认识到一切了不可得，又要看到<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>的无尽相续，积极利他，这都要依智慧进行抉择。</p>\n<p>　　菩萨认识到世俗谛的一切有为相皆无自性，即使微尘都了不可得，但对所证得的空性则不需要舍弃，因为一切都没有离开空性。同时菩萨也认识到缘起因果丝毫不爽，方能二谛<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>，不舍于法性，亦随顺于世俗。对这些不具智慧者看来极其矛盾的事，可在具备空性慧的菩萨来说，不但没有任何冲突，而且是相顺的。事实上，这些本来就不冲突，只是因为众生的错觉才造成冲突。</p>\n<p>　　《赞所应赞》中还说：在不同经论中，对于同一件事的开许或遮止，佛陀有时会这么说，有时会那么说，其实这些并不矛盾，而是佛陀针对不同根机者施设的教法。在菩萨乘和解脱乘的经论中，或在显宗和<a href=\"/remen/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>的经论中，开许和遮止都有很多不同规范。有些人同时受了两种戒律，或修学两种法门，希望寻求佛陀所说一切经教的密意。对于缺乏智慧的人来说，这样做难免会遇到矛盾。而对于善巧通达佛法奥义的人来说，这些是不相违背的。之所以能够这样，也是般若慧的作用。</p>\n<p>　　《摄度论》说：如果没有智慧而希求果报，布施的体就不能清净。最殊胜的布施就是以无我利他之心而行布施，而要圆满无我利他布施，离不开智慧。如果离开空性慧，布施难免著相，最终只是培植<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>而已，只能感得增加财富的结果。又说：如果没有智慧观照，就不能清净地持戒。没有智慧观照的持戒，或是开遮不明，或是持得执著，这样的持戒反而会增长烦恼。论中又说：因为被错误知见及过失干扰其心，不能认识和相信安住于忍辱的功德，这样就会善恶不辨，就像无道的国君一样。论中说到：空性为一切智者所赞叹，没有比它更为甚深和微细的。而且这是欲尘所不能障蔽的，如果缺乏智慧，就无法通达空性。一个人如果不能精进修习闻慧、思慧、<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>，他的见就不能清净。</p>\n<p>　　怎样才能增长智慧呢？首先就要根据自己的水平和程度，从适合自身根机的经教开始闻思。《摄度论》说：那些没有听闻经教和什么都不懂的人，是不会知道怎么修行的。如果没有听闻佛法的基础，怎么会有正思惟呢？想来想去都是建立在妄想的基础上。所以，应该精进闻法，如理思惟，依法修行，这样才能获得正见，开发智慧。</p>\n<p>　　布施时对施者、受者和所施物生起分别执著，认为这是实在的，是属于所知障的范畴。而对财物悭贪吝啬，不愿布施，则属于烦恼障的范畴。如果要远离所知障和烦恼障，必须依靠空性慧，除此别无他法。空性慧的成就是以闻思为基础，所以，闻法是修行中的重要内容。</p>\n<p>　　如果对闻的重要性有了深刻认识，对于恶知识所说的“善和不善的思惟都是分别，应该舍弃”之类的话，就不会受到影响了。因为我们知道，佛法典籍中并没有这样说，善知识也没有认可这些<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。如果没有般若智慧进行抉择，只是对佛法有一点点信心，很可能听到别人说什么就是什么。看到别人哭，你也跟着哭；别人笑，你也跟着笑。就像流水一样，跟着别人所说的，一会儿以为是东，一会儿以为是西。因为不知分别而以为都是正确的，就会没有主见，随着这些说法而转。</p>\n<p>　　慧的圆满成就，还是要配合六度来修。如果自己能够成就智慧，也能够帮助他人成就智慧，就是慧的布施，其他也是同样。学慧而能不犯戒，是慧戒。学慧而不惧苦，是为慧忍。学慧而精进不已，是为慧进。一心学慧，是为慧定。学慧而了达三轮体空，通达无我，是为慧慧。</p>\n<p>　　六波罗蜜中的前五种，并非佛教所特有，比如布施，佛教固然倡导布施，其他宗教乃至社会也提倡布施；持戒、忍辱、精进、禅定，无不如此。那么，世间的布施与佛教的布施有何区别呢？世间的布施总是住相的，而佛法则要我们‘不住色布施，不住声香味触法布施’。又世间布施有相则有限，佛法布施要不住相，<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>则无限也。</p>\n<p>　　那么，造成两种布施差别原因在哪里呢？简单地说是般若。凡人般若未能开发，以妄心住相布施，将来只能招感人天果报；菩萨以般若引导布施，三轮体空，不住境相，布施就成为成佛的资粮。所以世间的布施等行不能称曰波罗蜜，惟有在般若引导下的布施、持戒、忍辱、精进、禅定等，才是成佛资粮，始可称波罗蜜。</p>\n</div>"
    }
]