[
    {
        "title": "【妙善】-妙善是谁",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"354\" src=\"https://www.liaotuo.com/uploadfile/2016/0112/20160112045354538.jpg\" style=\"width: 350px; height: 272px\" width=\"384\" /></p>\n<h2>妙善（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　三皇姑，原名妙善，春秋时期父城（今河南平顶山宝丰县父城）妙庄王与王后宝德之女，因有两个姐姐：妙音、妙缘，排行第三，故称“三皇姑”。妙善是中国历史上的第一孝女，用自己的手、眼为父亲医病，传说其圆寂后<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>为<a href=\"/fjrw/hcrw/xhsr/96402.html\" class=\"keylink\" target=\"_blank\">千手千眼</a>观世音。</p>\n<h2>身世</h2>\n<h3>　　父城传说</h3>\n<p>　　相传古代春秋时期，父城妙庄王有三个女儿：长女妙颜、次女妙音、三女儿叫妙善，因妙善出生于王室，故称“皇姑”，又因其排行第三，故又被称为“三皇姑”。三皇姑初生之时，五彩祥云环列王宫上空。她幼年时就能吟诗作赋，十三岁时就出落得亭亭玉立，不慕荣华，偏喜修仙访道。庄王没有太子，只有妙善三个姐妹。庄王为了讨好邻国的国王，就将三女儿许配其太子，以继承大业。但三皇姑决心<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>，不愿成婚，宁死不从。庄王一怒之下把三皇姑囚禁于后宫，导致三皇姑一连几天水米不进，容颜憔悴。王后宝德心疼女儿，悄悄放她出去逃生。</p>\n<p>　　三皇姑先到的白雀寺﹙位于今河南省宝丰县李庄乡马庄﹚里修道，不久被庄王知晓，派人三番五次逼她回宫，她执意不回，庄王气极之下将寺院放火焚烧。王后因此哭得死去活来。其实三皇姑并未被烧死，她被信众们救出，藏到了火珠山（即香山）上。</p>\n<p>　　庄王焚烧白雀寺后，三皇姑活不见人，死不见尸。他忧虑成疾。八仙中的铁拐李化作凡人，装扮成郎中，给庄王诊病后说：“圣王的病必须用亲骨肉的一只手、一只眼做药引，方能治愈，否则即使神医，也无可奈何。”庄王的大女儿和二女儿不肯舍己救父。就在庄王病入膏肓之时，门官通报：“三皇姑回来了，请求献眼手为父治病。”庄王的病好了，妙善也圆寂了。楚庄王痛哭道“朕之无道，乃令我女至死手眼不全，原天地神灵，令吾儿复活，枯眼重生，断臂复完。”</p>\n<p>　　庄王话音刚落，天地一时光芒四射，妙善随即手眼完具。妙善之<a href=\"/remen/xiaoxin.html\" class=\"keylink\" target=\"_blank\">孝心</a>感动天地，<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a><a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，得道之际，化作<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>之相，白日飞升。</p>\n<p>　　庄王为纪念爱女，令工匠在大殿塑一尊“全手全眼”的三皇姑像，结果，工匠错将“全手全眼”误听为“千手千眼”，于是塑出了一尊千手千眼的三皇姑（妙善）像。</p>\n<h3>　　蒲姑传说</h3>\n<p>　　蒲姑国是殷商时期的一个小国，西周时被武王所灭。武王封姜子牙齐地时，也包括蒲姑国故里。姜子牙的五世孙胡公，曾以蒲姑国故城蒲姑城为都，后迁都临淄。史料记载，现博兴境内“蒲姑城遗址”，应是殷商时期蒲姑国国都所在地，围绕这座古城，衍生出很多古老的传说。</p>\n<p>　　现如今在博兴境内，流传着这样的一个传说，从前，这里有一个小国，国名蒲国，国王是妙庄王，妙庄王膝下无子，只有三个女儿。当时，人称妙庄王的女儿为皇姑，当时大皇姑、二皇姑都已经出嫁了，只有三皇姑年龄小，还没出嫁。</p>\n<p>　　就在三皇姑15岁那年，妙庄王的背上起了一个疮。很奇怪的是这个疮竟然有鼻、眼睛、还有嘴，就像是一个人的脸，称为“人面疮”。妙庄王自从得了这个面疮后疼痛难忍，吃不下饭，睡不着觉，没几天的时间就瘦得不成样子。皇姑派人四处寻找名医，但是请来的名医束手无策，妙庄王日渐消瘦，眼看着就快不行了。</p>\n<p>　　就在妙庄王眼看着就要不行的时候，这天夜里，在他们家里发生了一件很奇怪的事情，妙庄王、皇后以及三位皇姑竟然做了同样的一个梦。在梦中，有一位看上去非常慈善的白胡子老先生走进皇宫，把他们一家人都叫到妙庄王的窗床前说，“妙庄王得的是罕见的人面疮，毒气很厉害，非常迅猛，现在快要攻心了，如果再不治疗的话就来不及了。”说到这，皇后和三位皇姑已经哭得不成人了。</p>\n<p>　　这时，这位老先生说他可以开一幅药方子，只要他们按照药方抓药，就能治好妙庄王的病，不过就是药方子实在是难求，必须要用儿女的两只眼睛和两只手作药引子，再加上这些药经过煎熬后一起服下，最起码能够保住性命。没等他们五人反应过来，这位老先生把开出的药方子放到妙庄王床前离开了。</p>\n<p>　　第二天还没等天亮，疼痛难忍的妙庄王就让皇后将三个女儿叫到床前，将昨晚做的梦告诉了她们母女四人，可是妙庄王没想到的是他们竟然做的是同样的梦。更奇怪的是，妙庄王的床前真的有一药方。这时，他们或许感觉到是神的旨意来救治妙庄王。想到这，妙庄王犯了愁，这药引子可怎么办啊！面对这一场面，三个女儿你看我，我看你，妙庄王在一边疼痛难忍，一个劲儿叹气。皇后看看妙庄王，看看三个女儿，直掉眼泪。</p>\n<p>　　这时，大皇姑开口说孩子在家不放心要回婆家看孩子，说完转身就走了；二皇姑看到姐姐走了，就说孩子太小基本上没离开家过，在外面不能长待，说完就抱起孩子走了。三皇姑站起身来，看看躺在床上的父亲，望望哭得不成样子的母亲，一声不吱也走了。</p>\n<p>　　三皇姑回到自己的绣楼后让宫女叫来御医和侍卫，命令侍卫将自己捆绑在柱子上，挖她的眼睛、剁下她的双手，御医和侍卫吓得跟丢了魂似的。三皇姑就将她们做的梦和刚刚发生的事情告诉了他们。御医和侍卫留着泪水执行了三皇姑的决议。御医将昏死过去的三皇姑包扎好，之后便急忙将三皇姑的眼睛和手拿去做了药引子并将煎好的药端到了妙庄王面前，妙庄王含泪服下了药。没过几天，妙庄王背上的人面疮就没了。</p>\n<p>　　三皇姑的事情深深地感动了妙庄王，妙庄王也没有忘记<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>的女儿，召集群臣向三皇姑当面封赏，下令将蒲国改名为蒲姑国，封女儿为“孝姑”让国民记住三皇姑，宣扬她的孝行。西方<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>听说了三皇姑的孝行非常感动，亲自下<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>准备封她为佛享受人间的供奉<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>人们孝行。妙庄王听后请求佛祖封女儿“全手全眼佛”。不巧的是佛祖误将“全手全眼佛”听成了“千手千眼佛”。结果三皇姑就真的成了“千手千眼佛”，她能够眼辨<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>，看清楚别人的心思，在她的协助下，妙庄王治理国家非常有策略，国家繁荣富强。</p>\n<h3>　　南和传说</h3>\n<p>　　相传南和县东北部白佛一带，原是一片林茂粮丰、成群白雀聚集的地方。南北朝时，从金山寺来了一个老尼师德真，用<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>所得银两修建了一处庵院。当地一个崇尚佛道的秀才，以“尼师三年苦心创业，可谓白玉无瑕；今日茅庐换庵院，世人<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>雀跃，成群白雀栖息庵院”为庵院题名“白雀庵”。相传这里是世人敬仰的千手千眼大慈大悲的观音菩萨——三皇姑出家<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>之地。</p>\n<p>　　<strong>逃婚遁<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a></strong></p>\n<p>　　相传，三皇姑系南北朝时期兴林国君妙庄王的三女儿，名妙善。其父妙庄王为南和县瓦固村人，南北朝时建立兴林国。其母宝英，南和县郄庄村人，小名郄武燕。妙庄王有三个女儿，长女妙音，次女妙元（一说妙颜），三女妙善即三皇姑。传说当年正宫娘娘梦花怀孕，于农历二月十九日生下一白胖女婴，取妙相善行之意，叫妙善。</p>\n<p>　　三女长大成人，妙音、妙元都招了驸马，享起了荣华富贵，唯有三皇姑笃志<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>。三皇姑生性聪明伶俐，她不学描龙绣凤，而在宫中秘修禅事。十六岁时，妙庄王要将她许配给宰相李龙之子李炳，她执意不从，夜逃皇宫，至南杨庄村。后来，南杨庄为纪念三皇姑逃婚避难这个日子，将四月初二立为醮会。</p>\n<p>　　三皇姑打扮成村姑模样辗转前行，于九月十九日来到了白佛村白雀庵，<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>了佛门。消息传到宫里，妙庄王给老尼师下了一道秘旨，要事事磨难三皇姑，以使其回心转意。三皇姑天天挑水、推磨、捣米、做饭、打柴、敲钟，受尽磨难，但矢志不渝。</p>\n<p>　　<strong>舍手眼救父</strong></p>\n<p>　　白雀庵西南侧白佛寺内有个黄龙和尚，趁三皇姑外出打柴时，酸言淫词调戏，尽管三皇姑不理，但仍被造谣说她不守清规<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。谣言传至皇宫，妙庄王下旨火焚白雀庵。霎时间白雀庵浓烟滚滚，烈焰腾腾，五百僧尼冤魂升天。玉皇大帝得知，派太白金星用通天避火绳搭救三皇姑脱离火海。</p>\n<p>　　三皇姑被救出后，决心到太行山修炼。来到邢台地界双楼村歇脚时，将灌进鞋里的泥土倒了倒，平地立刻从南到北隆起三座山，老百姓叫它“三台山”（今尧山）。为避妙庄王，三皇姑于农历九月十八日西走太行山，来到苍岩山眺望崇山峻岭，百感交集，放声恸哭，感动了太白金星。太白金星派了一只斑斓猛虎驮她上山。她登上苍岩山巅，住下来潜心修炼，日日净手焚香<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，虔心悟道。转眼九年，于农历六月十九修成了正果，日赴千坛，眼观万里。</p>\n<p>　　妙庄王火焚白雀庵，气病了国母，自己也整天神智恍惚，恶梦频繁，患了一种怪病——人面疮。在首府朝平城，求遍天下名医，不知所患何疾。三皇姑不计旧恶，化身点化妙庄王，并亲献手眼治好了妙庄王的“人面疮”。</p>\n<p>　　<strong>敕封三皇姑</strong></p>\n<p>　　妙庄王感念三皇姑救命大恩，率百官来到苍岩山敕封三皇姑。本想将其封为“全手全眼”观音，因过分激动说成了“千手千眼”。帝王都是金口玉言，话音刚落，三皇姑圣像展现空中，果然长出了千手千眼。从此，名刹寺院就添了尊端庄慈祥的“千手千眼”观音，“千眼遍观世界不平事，千手遍护受苦受难的庶民百姓”。</p>\n<p>　　妙庄王传旨全国能工巧匠重修白雀庵，增建“千手千眼”观音殿，为“三皇姑”塑画金身，端坐莲台。据说，这位菩萨“有求必应，<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>广大”。老百姓都把她当作保护神，只要虔诚拜求，就能逢凶化吉，阖家平安。</p>\n<p>　　因朝政败落，两个驸马在战乱中惨遭杀害，大皇姑、二皇姑皈依佛门，被如来佛封为文殊菩萨和普贤菩萨。妙庄王和国母宝英深感无法摆脱世俗<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，也遁入空门。后来观音菩萨去了浙江普陀山，文殊菩萨去了山西五台山，普贤菩萨去了四川峨嵋山。中国四大佛教名山，三姐妹占了三座，受到中外香客游人的膜拜。</p>\n<h2>记载</h2>\n<p>　　观世音菩萨在中国可谓家喻户晓，观世音有许多化身，其中最著名的要数千手观音了，千手观音的故事起源于河南省平顶山市香山寺。香山寺全称香山普门禅寺，位于市区西北方向，始建于东汉，是我国最早的寺庙之一。香山寺主供千手观音，香火旺盛。每年农历二月十九观音诞辰之日，每月初一、十五，都有盛大的庙会，规模盛大。香山寺被誉为“千手观音的故乡”。</p>\n<p>　　证实这一<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的，不仅有平顶山境内广泛流传的民间传说及相关文献记载，更有一个重要的碑文实物证据。它就是香山寺的镇寺之宝——蔡京碑，又名《香山大悲菩萨传》碑。蔡京是北宋大书法家之一，其书法成就与苏东坡、黄庭坚齐名。</p>\n<p>　　根据《香山大悲菩萨传》碑文记载，妙善系楚庄王的三女儿，出生于父城（今河南省宝丰县李庄乡古城村）。出生之时颇不一般，“不洗而净，梵相端严，五色祥云覆盖其上。”妙善聪慧美丽，但不愿出嫁，执意到白雀寺出家<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。楚庄王大为震怒，用尽办法也未能让女儿回心转意，便派使臣将女儿抓获斩首。妙善听命受斩之际，龙山山神运用神力将其救走。狂怒的楚庄王斩杀信众，火烧白雀寺。妙善获救后，隐居香山修行。后来，楚庄王得了重病，久治不愈，需用亲骨肉的手眼做药才能治好。妙善得知后，为报父母养育之恩，毅然挖下自己的双眼，砍下自己的双手，制成药丸，救活了父亲。</p>\n<p>　　《<a href=\"/ctwh/gdxs/bj/ssj.html\" class=\"keylink\" target=\"_blank\">搜神记</a>》二十卷，视观音为神。略记曰：“妙庄王有三女，长妙音，次妙缘，三妙善，妙善即观音大士。王令赘婿不从，逐之御花园，居之白雀寺，苦以搬运，极所不堪，旁役鬼力代之。王怒，命焚白雀寺，寺僧俱毁于焰，大士无恙如初。命暂之，刀三折；命缢以白练，忽黑风遮天，一白虎背之去。至尸多林，青衣童侍立，遂历地府，过奈河桥，救诸苦难。还魂再至尸多林，遇一耆硕，指香山修行。后，庄王病急，剜目断臂救之，尔时道成。空中现千手眼，故曰：南无大慈大悲救苦救难灵感观世音菩萨。”</p>\n</div>"
    }
]