[
    {
        "title": "【密教】-密教是什么",
        "date": "2016-04-09",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0409/20160409022628393.jpg\" style=\"width: 289px; height: 376px\" /></p>\n<h2>密教（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　密教又作<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>宗、瑜伽宗、金刚顶宗、毗卢遮那宗、开元宗、秘密乘。依真言陀罗尼之法门，修五相、三密等妙行，以期即身<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之大乘宗派。我国十三宗之一，日本八宗之一。主要以金刚顶经为<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>，苏婆呼经为<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>，释摩诃衍论为论藏。统称密教之经典为密经。</p>\n<h2>唐密缘起</h2>\n<p>　　密教始祖为法身佛大日如来（音译作摩诃毗卢遮那，又作毗卢遮那佛、最高显广眼藏、遍照王如来、光明遍照、大日遍照、遍一切处、遍照尊），大日如来传法金刚萨埵（与普贤菩萨同体，又称金刚手、金刚手秘密主、执金刚、持金刚、金刚持、一切如来普贤、普贤萨埵、普贤金刚萨埵），是为<a href=\"/remen/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>第二祖。金刚萨埵据大日如来内证法乐之境界集成密法之两部根本经典――《大日经》和《金刚顶经》，并将之纳入南天铁塔（然其全息意义乃有情本身法界之塔也），以期待后世有缘者。释迦牟尼佛（<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>佛）灭度后800多年时，<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>（亦翻译为龙猛）开启南天铁塔，亲自从金刚萨埵得受密法，为第三祖。龙树传法给其<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>龙智，是为第四祖。又过数百年，龙智700多岁时，传法给善<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>与金刚智，是为第五祖，史称“开元三大士”的善无畏、金刚智及不空于中国盛唐时先后自印度来华广弘密法，并经一行、惠果等祖师的努力，将金刚界、胎藏界两部大法集于一身，是为“两部一具”，因处于中国盛唐时期，故名唐密。</p>\n<h2>何谓汉传纯正密教</h2>\n<h3>　　密之涵义</h3>\n<p>　　「密教」与「显教」是相对待的。佛所亲传的经教共有两大类。</p>\n<p>　　一类为「密教」，另一类为「显教」。顾名思义，「显」之意为显明、显现出来：凡是可以用语言表达或宣示的法称为「显法」或「显教」；而「密」则表示「如来的秘密境界」，系离于言语思惟，超越言诠、亦即超过了凡夫「言语、思维所能达到」的范畴之外，无法为凡夫所了知，所以才称为「密」。因此「密」并非是故作神秘或神秘兮兮等。如来的「密法」或「密教」不但难以言语来表示，甚至以凡夫的思维亦无法想象得到，那样的境界便称之为「密法」或「如来秘密境界」。而如来的秘密境界，以其大悲。为了度化<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>，则示现在他的清净的身、语、意三业之上，而成为如来的「三密」；如来即是以此「三密」来加持众生，令他们速能除障、离染、断惑、证真、开悟成佛。所以可知，密教修学的主要内容即是身语意「三密法门」，用以求得如来的「三密加持」，速成佛道。</p>\n<h3>　　如来与众生的三密境界</h3>\n<p>　　如上所说，所谓的「三密」就是「身密」、「语密」、「意密」。如来便是以其身语意的「甚深不可思议秘密境界」来加持众生，令他们速能断除三障，开悟证道。因此，一般都以为只有佛才有「三密」，而不知众生亦有「三密」。唯一不同的是：众生的「三密」，正如其「三业」一样，是染污的；而佛的「三密」则是由其「清净三业」所成，故具足无量<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，其差别如是。</p>\n<h3>　　印度密宗</h3>\n<p>　　七世纪后半，印度佛教进入全盛期，已有经有教，有轨有仪，真正密教方始开展，以真言、陀罗尼为中心而增益<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>哲学，以奠定其基础。此为纯正密宗，纯密以大日经、金刚顶经为主。在七世纪后半时，成立于中印度之大日经，将杂密经典所说诸尊以大日如来为中心，集大成而成胎藏界曼荼罗。其理论可能承自<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>之<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，主张在现实之事相上，直观宇宙真相。金刚顶经成立稍晚，流行于南印度，系传自佛教瑜伽派之说，以<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>为中心而言五相成身（在心身中具备五相与本尊同一之观法）。以此二经为代表之纯密，在印度不久即告消灭。八世纪时，纯正密教由开元三大士传至我国，后经惠果阿阇梨及日本空海大师传至日本成为如今纯正密教真言宗的惟一血脉。</p>\n<h3>　　发展历程</h3>\n<p>　　密宗东传，当以东晋帛尸梨蜜多罗译大灌顶经、孔雀王经为经典。三国吴之支谦所译八吉祥神咒经、无量门微密持经、华积陀罗尼神咒经、持句神咒经、摩诃<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜咒经、七佛神咒经等亦颇著名。唐以前与密宗关系最深者则推东晋竺昙无兰，译有陀邻钵咒经、摩尼罗亶神咒经等凡二十五部，皆属密宗经典。唐时译密经最多者为义净<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>，有观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨如意心陀罗尼经、曼殊室利菩萨咒藏中一字咒王经、称赞如来功德神咒经等十余部。唐开元三大士（善无畏、金刚智、不空）传来纯密之前，中土业已广译密宗经典，此外，显教经典中之咒文陀罗尼尤不胜枚举。</p>\n<p>　　东晋帛尸梨蜜多罗译出大灌顶神咒经，咒术灵验，首都建康盛行咒术，此后杂密更不断传译。唐玄宗开元年间（713～741），善无畏、金刚智二纯密大师先后于长安译出根本经典，建立灌顶道场，我国密宗于是真正成熟。另有不空、一行、惠果、辨弘、慧日、惟上、义圆、义明、空海、义操、慧则等，传持纯密。其中，日本空海（弘法大师）于贞元二十年（804）来唐，就惠果受法，返国后，持弘不绝，是为日本真言宗之祖。会昌法难之后，加以唐末五代兵燹不断，战乱频仍，密宗坛场<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>销毁殆尽，不过，这并不意味着唐密开始消逝， 幸有惠果阿奢黎得金胎二部之法嗣，如惠应、惠则、惟尚、誓弘、惠日、空海、义满、义明、义照、义超、义愍等；和单受胎藏法者：悟真、义澄、法润等；单受金刚界法者：义证、义一、吴殷、义智、义圆等；另外受法弟子还有：义恒、义云、智兴、行坚、圆通、义伦、义润、开怌等。（其中义超和空海为正嫡，义超嗣青龙寺法灯，传出弟子义真、海云等）继续弘扬，但是真言宗道场各种<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>，佛像，曼陀罗等损失严重，无法恢复如初，故后代祖师将唐密和<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>互相融合，形成禅密一体的独特密法，由于佛教多次受到灭佛的打击，故祖师隐秘传承法脉，得以延续至今，世人皆以为唐武宗灭佛后，唐密逐渐式微，虽宋时虽有施护、法贤等师传其法，至元则绝矣。其实，密教并未消亡，而是隐入山中，秘密传承。为外人所不知。外界多认为唐密东传于日本，殊不想惠果阿奢黎杰出之弟子众多，持金胎两部大法者不在少数，虽经历法难，但身为汉人又持龙树菩萨一脉相传之真言法教，怎能让密法传承在自己这里断绝，怎么会让唐密在汉地绝响？宋代法贤、施护，法天等，传译密宗经轨，亦未能光大久远。且此时之密宗已异于唐代，唐代密宗可谓为有体系之综合密宗，宋代则是分化的、通俗的，以崇拜特定之本尊，诵持其真言陀罗尼为主，如宣扬宝箧印陀罗尼、观音六字明咒、<a href=\"/fozhou/zhuntizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">准提咒</a>等即是。又宋代因输入时轮怛特罗之印度密宗，故以威猛之忿怒明王本尊较多。元代定<a href=\"/remen/lama.html\" class=\"keylink\" target=\"_blank\">喇嘛</a>教为国教，喇嘛教实即以密宗为骨干之西藏佛教，其后以元帝室过分优待喇嘛教，导致腐化，乃有宗喀巴之改革，而形成新旧之黄教、红教。</p>\n<p>　　密教鼎盛于七世纪时，至十一世纪印度佛教衰亡止，在中印度颇为兴盛，融入性力派（梵Saktah）教说之后，成为左道密教，此派尤其强调散见在纯密金刚顶经中之大乐说（梵mahasukha -vada ）。八世纪以来，传入西藏，遂成为喇嘛教之骨干。至十、十一世纪时，其部分经典已在中国流传并翻译，但在思想上则未产生影响。因此从发达史而言，杂密先兴起，继而纯密集大成，与纯密平<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，为融入印度性力派等教说之左道密教。据传，谓大日如来越三世之一时，于色究竟天之法界心殿，对金刚萨埵等从心流出自内证之内眷属，为自受法乐而宣说大日经，又于真言宫殿宣说金刚顶经，后由金刚萨埵结集之（日本台密谓阿难亦参加）。后于<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>入灭后约八百年顷，龙猛（龙树）菩萨施咒于七粒白芥子，以之打开十六丈（表示金刚界之十六菩萨）南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>之铁塔，亲从金刚萨埵受两部大经（台密则称大日经系于铁塔外由文殊菩萨所传授）。后龙猛传予龙智，复经七百年左右（相传龙智岁寿七八百年），再授大经于善无畏。故密教以龙猛为开山祖师，根本教典为大日经及金刚顶经，信奉之教主系大日如来（大毗卢遮那佛），与释尊之说法不同，故自称为金刚乘。</p>\n<h3>　　金刚乘</h3>\n<p>　　一词，于日本系指纯密，于印度及欧人之间则惯指左道密教，英文为 Tantric Buddhism。广义之金刚乘分为二派：(一)右派：以大日经为主，即指纯密。富于稳健之神秘主义，欲藉咒术实现宇宙与精神之合一，以支配自然与人事，此派又称为真言乘（梵Mantrayana ），自我国传至日本，成为真言宗，称为唐密或东密。另在日本<a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>流传之密教称为台密。(二)左派：或性力派，重视双身法，以原始佛教立场言，此系左道旁门，九世纪以后与印度教结合而日趋兴隆，后传入西藏，成为‘藏密’之骨干。藏密，乃西藏佛教密宗之简称，系八世纪时由莲华生、寂护等传入。前弘期佛教中，西藏所行之密法多为行、事二部，史称旧密法；十一世纪初，仁钦桑波等翻译多种瑜伽密教经典，史称新密法；而后瑜伽部及无上瑜伽部密法遂盛行于西藏佛教各派中，传承不绝。而密宗之东传我国亦有此二阶段。</p>\n<h3>　　不同点</h3>\n<p>　　，在修持上之传承与仪轨。显宗理论固然有师承传授，而修持法门不一定要严格之师承、仪轨；如瑜伽之五重<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>观，天台之大小<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>，即无师承亦可自习。反之，密宗之仪礼繁复，世界诸<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>中无出其右者，自初皈灌顶至金刚上师有一定之程序，不可躐等，与显教之简易方便迥异其趣。就教义而言，显教为应身佛说法，密宗则以法身佛说法。依显教<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者，认为须经三大阿僧祇劫，修<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行始得证<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>；依密宗者，则认为仅修三密之妙行，现生即可成佛。又有六大缘起之说，六大即地、水、火、风、空、识，此六大乃一切诸法之本体，能造一切佛，乃至一切众生之根身器界，即<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>等四种法身，众生国土等三种<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>，皆为六大所生。依此六大缘起，故立生佛平等之义，大、三、法、羯等四种曼荼罗亦由六大缘起现法身德相。众生若依三密妙行修持，契证性德时，即以父母所生身立证大觉位。所谓‘三密加持妙行’，即手结印契，口诵诸佛真言，心住三摩地。如说修行时，行者之身口意能与诸佛之身口意相应，则可速得成佛。诸佛之身口意，即大、三、法、羯等四种曼荼罗：大曼荼罗即诸佛之身密，三摩耶曼荼罗即意密，法曼荼罗即语密，羯磨曼荼罗即其余三曼荼罗之业用。要之，四种曼荼罗具有诸佛之三密而不阙。又此四种曼荼罗赅摄一切曼荼罗，依大日经建立之曼荼罗称为胎藏界曼荼罗，依金刚顶经建立之曼荼罗称为金刚界曼荼罗；前者表示本觉之理，故又称因曼荼罗；后者表示始觉之智，故又称果曼荼罗。又对依余经所立之别尊曼荼罗而言，此金胎二部称为总德曼荼罗。此外，一切佛菩萨等乃从大日如来法身所流出之别尊，各代表其别德，为一门之本尊，对于此，大日如来即是总德普门之本尊；一门之诸尊中，阿閦、宝生等四佛表大圆镜等四智；四佛又各有四菩萨，合为十六大菩萨，与四波罗蜜、四摄、八供等，计三十七尊，凡此皆不外从大日法界体性智流出者。行者若常以白净之<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，自住金刚萨埵<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，修五相成身等妙行，即现得契证佛智，<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a><a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>，成就利他事业。</p>\n<h3>　　十住心</h3>\n<p>　　从异生羝羊心至极无自性心等九心为世间、出世间、小乘、大乘、二乘、一乘等之住心，第十秘密<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>心即真言密宗之住心。亦即本宗以凡圣不二为宗要，一尘一法皆住本初之智源，悉为三摩地之心地故，虽上根胜慧之人，起居动作、开口发声、心思念想，皆成<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>三密；而下根劣慧之机，依有相之三密门，能与三部诸尊之德相应，本宗思想之特质，自教主方面观之，显教为应化之释迦所说，本宗为法身佛之大日如来所说；自法身立场观之，显教法身为理体，理体法身无形无相，密宗法身有形有相，且能说法；自所说法观之，三论宗八不之中道寂灭境界、<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>之离言胜义谛境界、天台之一念三千不可思议境界、华严之性海果分不可说十佛境界等皆毕竟可说；自真理之表现观之，一切诸法皆是真理象征，此种象征之具体表现，即密宗之仪轨；自成佛迟速观之，除禅宗外，其余诸宗均须经三阿僧祇劫，密宗则主张即身成佛；自宗教之立场观之，密宗两部曼荼罗表现以人格主义思想为基础之世界观，由无量无数之诸佛菩萨，构成一即一切、一切即一之轮圆具足之世界；自教义体系观之，密宗为一种‘理智不二’之宇宙<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>观，大日如来即具此伟大人格，智法身之世界称为金刚界，理法身之世界称为胎藏界。由修持之力，可将智之世界扩大至与理之世界一致，此即理智不二。</p>\n</div>"
    }
]