[
    {
        "title": "【南传佛教】-南传上座部佛教",
        "date": "2016-03-30",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0330/20160330023706638.jpg\" style=\"width: 330px; height: 425px\" /></p>\n<h2>南传<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>（佛教解释）</h2>\n<p>　　南传佛教，又称上座部佛教。是指现在盛行于泰国、越南、老挝、柬埔寨、缅甸、斯里兰卡及我国云南省傣族地区等的佛教。它是原始佛教时期之后，部派佛教中的一个派系。南传，是从其源流及地理而说，因为这个派系是由印度南传到斯里兰卡而后发展起来的。这一系的佛学，近代发展比较快，世界上已有许多国家的佛学者用各种文字翻译和研究他们的典籍。</p>\n<h2>历史源流</h2>\n<h3>　　传教历史</h3>\n<p>　　公元前三世纪，由阿育王的儿子马兴德长老组成的第九弘法使团把佛教正式传入兰卡。马兴德早年<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，师事摩嘎离补答·帝思大长老学习<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>圣典，博学多闻、戒行精严。在他32岁、12瓦萨（vassa，戒龄，僧龄）时，率领由伊帝亚、伍帝亚（Uttiya）、桑拔喇（Sambala）、跋达萨喇（Bhaddasàla）四位比库，以及沙马内拉苏马纳、般度咖<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>一行七人组成的使团，于公元前247年渡海来到兰卡岛。当时兰卡的国王迭瓦南毕亚·帝思（Devànampiya tissa，又作天爱·帝须王，公元前247~207年）和一批大臣首先<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>了佛教，<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>御花园“大云林园” （Mahàmegha-vanaya），修筑“大寺”（Mahàvihàra，摩诃毗诃罗）<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>僧团。这座大寺日后成为整个南传上座部佛教的发祥地和弘法中心。接着长老剃度了国王的外甥马哈利特等五十五位兰卡青年，弘法工作进展非常顺利。不久，马兴德长老又邀请他的妹妹桑喀蜜妲长老尼从印度带领十位比库尼来到兰卡，为王后阿奴喇（Anulà）等五百多位女子传授戒法，建立比库尼僧团。佛教迅速普及全岛各地，成为几乎是全民<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的国教。</p>\n<h3>　　早期佛教源流</h3>\n<p>　　下面讲南传上座部的源流。所有佛教徒共同尊敬的教主释迦牟尼，大约为公元前六世纪的人，他的生灭年代有几十种不同的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，其确切的年代，无法肯定，这里略举几种比较普通的传说：</p>\n<p>　　（1）依照南方上座部佛教各国传统的说法是：佛灭于公元前544或543年，在1956年，有许多国家举行一次盛大的佛灭二千五百周年纪念活动，就是依据这种传说的。所以这个佛灭年代的说法，已经实际为世界许多国家所采用了。</p>\n<p>　　（2）近代的学者，根据考证印度历史上最伟大的阿育王年代，有的推论佛灭于公元前483年，有的说前480年，有的说前470年等等，未得一致。</p>\n<p>　　（3）中国的‘众圣点记’说，据传佛灭之后，<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>僧团在第一个雨季安居完毕，便在戒本末尾上点一点以记佛灭之年，到了萧齐·永明七年（489），共得九七五点。据此，则佛灭于公元前486年。</p>\n<p>　　释迦牟尼本人，原是迦毗罗卫国的一位王子，二十九岁出家，三十五岁成道，说法四十五年，八十岁入灭。他所说教的地区，主要是在古印度恒河流域的中游一带。他收了很多男女<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，建立了比丘和<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>僧团。在他寂灭之后的第一年，便由他的上首弟子摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>主持，召集了五百长老于摩揭陀国的首都王舍城，在阿阇世王的协助之下，诵集了<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>生前所说的教法。这次集会把当时诵出的教法分为毗奈耶（<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>）和达摩（法）两大类（<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>和<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>）。达摩被编成五集，即《长部》、《中部》、《相应部》、《增支》及《小部》。这些经典和戒律编好之后，分别付托一些教师传授弟子，使其用口授的方式代代保存下去。佛教史上称这为第一次‘结集’。所谓‘结集’，是合诵或会诵之意，就是佛的弟子们集合在一起，把佛陀所说而当时只有口头传诵并无文字记载的经典，进行一番会诵、审定，系统地把它确定下来。</p>\n<p>　　佛灭之后，约一百年间，比丘僧团仍然按照佛陀所制订的戒律过着原来最简单的<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，基本上是以乞食为主，把佛的教义口授给弟子，弟子们辗转相传，向各地继续宣扬<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>、八正道、<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>、<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>等法，严持戒律，和合相处，不分派别。佛教史上称它为‘原始佛教’时期，亦称为‘早期佛教’或‘初期佛教’。</p>\n<p>　　在佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>一百年后，当摩揭陀国迦罗阿输迦（俗称黑阿育）王在位时，僧团内部便发生了分裂。其主要原因是对于戒律的见解有分歧。据说当时以吠舍离为根据地的东部比丘，实行了一些与原始教规相违背的事，而西部（摩偷罗）的耶舍比丘对此加以反对，并且邀请东西方的七百位长老，在吠舍离举行第二次结集，从人数说名为‘七百结集’，从地点说又名‘吠舍离结集’。这次结集的结果宣布了双方争执的十点是违背戒律的，即所谓‘十事非法’。而东部大多数的僧人却不同意这种决议，因为是这些有地位的上座长老们所决定，大家也无可奈何，只好另外集会一处，也用会诵的方法，另外订正戒律，退出原来教团的主体，自成一派，因为他们人数多，就叫做‘大众部’。这样，僧团就公开分裂成为‘大众部’和‘上座部’两大派，各行其是。此后，佛教僧团形成了更明显的分裂，在四五百年间，分成十八部或二十部。佛教史称这个时期为‘部派佛教’。</p>\n<h3>　　阿育王时期</h3>\n<p>　　佛灭后二百多年，在印度史上最著名的阿育王统治时期，由于国王虔诚信仰佛教，因此便有许多非佛教徒，为了分享这些布施而来参加僧团，其行为放逸，则与佛教的教义相反。结果使那些行为纯洁而真正信奉佛教的比丘，不愿与这些行为不正的人为伍。据说在华氏城的王室寺院中，有七年没有举行过‘布萨’和‘自恣’等<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>仪式。阿育王闻知此事，大为震惊，便邀请目犍连子帝须长老来首都华氏城，帮助净化了僧团，并召集一千位长老，举行第三次结集，会诵出比较完整的经律论主要成分。据说今日存在的上座部巴利语三藏，就是这次大会最后编定的。</p>\n<p>　　这次大会，还曾作出另一项重要的决议，派遣传教师到世界各国去传播佛教。这些传教团，都由一位著名传教师及另外四位长老组成，不但可以传播<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，还可以建立新的比丘僧团。被派往僧诃罗（今斯里兰卡）的使团，是由阿育王的儿子摩哂陀率领四位长老和一位<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>，在提婆南毗耶·帝沙统治时期（公元前250～前210）到达该国的。他们传教的工作进行得很顺利，在不长的时间内，就使国王以及大臣和人民信仰佛教，建立了比丘僧团，创建塔寺，如著名的大寺等。以后，摩哂陀的妹妹僧伽密多也被派去斯里兰卡，建立了比丘尼僧团，并从佛陀伽耶佛陀坐在树下成道的那株<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树上折下一枝幼苗带去栽在大寺园内，至今尚存，被视为国宝之一。从此开始，斯里兰卡才有佛教。</p>\n<p>　　摩哂陀传入斯里兰卡的三藏经典，属于分别说系的上座部，但当时仍以传统的记诵方法流传。因为国内有时也发生内乱，使教团中的长老体会到，只依赖某些人用不可靠的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>对记诵的方法来保存经典，是一件冒险的事。由于这种考虑，使长老们于公元前一世纪，伐多伽摩尼·阿巴耶王时（公元前101～前77），在斯里兰卡中部马特列地区的阿卢寺，举行一次重要的结集，由罗揭多主持，五百长老参加，诵出上座部的三藏和义疏，并决定把一向口口相传的三藏经典第一次用巴利文字写在贝叶上保存。这对后来上座部佛教长期流传有着决定性的作用。斯里兰卡的史学家评说：‘保存印度早已失传的巴利文上座部圣典，是僧诃罗民族对人类文化遗产最伟大的贡献。’（《锡兰简<a href=\"/ctwh/shi/24s/mingshi.html\" class=\"keylink\" target=\"_blank\">明史</a>》）上座部的史书中认为这是第四次结集。北传佛教记载，约在一世纪，迦腻色迦王时，在迦湿弥罗第四次结集，但南传佛教史书无记载。</p>\n<p>　　佛教传入斯里兰卡之后，建立了僧团，国王把自己的王家公园布施给比丘，改建成著名的大寺，为比丘僧团的中心。在家佛教<a href=\"/remen/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>，皈依佛法僧<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>，遵守<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>，礼<a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>塔和菩提树以表示恭敬佛陀，大约在一世纪时，才开始以佛像作为<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>的对象。</p>\n<p>　　直至公元前一世纪，比丘僧团都是承认大寺的权威。到了伐多伽摩尼·阿巴耶修建了一座宏大的<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>山寺，献给大寺中的摩诃帝须，他便带领五百徒众脱离大寺去无畏山另立一派。这样，斯里兰卡的佛教史上便第一次分裂为大寺与无畏山两大派。（中略）到了摩诃舍那王建成只陀林寺，献给此派的古哄帝须，他们便以该寺为中心而被称为只陀林派。这样，斯里兰卡的僧团便分成了三派。僧团虽分为三，但都是属于上座部，他们主要的巴利文三藏经典是相同的。然而无畏山和只陀林寺的长老们都各自著有解释经典的注疏，对于经典某些章节的解释，则与大寺僧人所作的注疏有些不同。后来，这些注疏的原作都不存在了，唯有大寺派的思想体系继续流传至今，这和觉音有着密切联系。</p>\n<p>　　觉音是南传上座部巴利语系佛教的一位杰出的著述家，约为五世纪前半时人，出生于北印度佛陀伽耶附近的<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>族，在佛陀伽耶一座僧诃罗人建造的寺院出家，于摩诃那摩王时（410～432）去僧诃罗首都阿努拉达补拉，住在大寺，专研巴利三藏和僧诃罗文的注疏，并用巴利文著述了很多书。原来古代僧伽罗僧人，曾用僧伽罗文写了不少注疏，因为其他上座部佛教流行的国家不懂僧伽罗文，所以这些注疏——主要是大寺的作品，‘都被伟大的注释家觉音以律藏和经藏中各种典籍的注疏形式译成了巴利文（《锡兰简明史》）。觉音依据大寺派的传统思想理论，对巴利三藏圣典都写了重要的注释，并写了一部著名的《清净道论》，系统地论述三藏和义疏的精要。他对南传上座部佛教的长期流传是有很大影响的。</p>\n<p>　　上座部佛教在斯里兰卡盛行之后，同泰国和缅甸等盛行上座部佛教的国家有着密切的联系，教徒之间，互相往来，相互学习，相互补救。在斯里兰卡的佛教兴盛时期，把大寺派上座部的学说传播到泰国、缅甸去，到了佛教衰落时期，又从泰国及缅甸把上座部佛教传回来。例如：1361年，锡兰僧王被当时的暹罗国王邀请前往其国建立僧团，他所成立的僧诃罗僧团于以后约二百年中，在暹罗起了非常重大的作用。1425年，有缅甸、暹罗和柬埔寨比丘前来锡兰，学习经教，在迦罗利耶重新<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。他们回国后，分别在本国仿照锡兰僧团的形式，建立宗教组织。1476年，有一宗教使团从勃固来访锡兰，并有若干缅甸僧人在迦罗利耶受戒。他们回国以后，也建立了名叫僧诃罗僧团的宗教组织（见《锡兰简明史》）。在十一世纪和十二世纪，斯里兰卡经常遭到外国侵略，佛教也跟着衰弱下去，十一世纪末，曾遣使缅甸，请缅甸僧人去锡兰传戒，重新建立僧团。到十八世纪时，锡兰佛教的宗教形式已等于全部灭亡，塔寺尽成丘墟，连一位正式的比丘都没有了，经典也没有了，这是锡兰佛教史上最凄凉的时期！直至1750年，才遣使暹罗请求派比丘来锡兰传戒，获得暹罗国王的同情，派遣以优波离为首的十名比丘佛教使节团，并抄写了许多上座部的经典，于1753年到达锡兰，当时便有以萨拉能格拉为首的数百人从暹罗僧人受<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>，数年之后，便有比丘三千余人。从此重建僧团，重修塔寺，佛教文化又渐渐地在山区里重兴起来，同时这也是斯里兰卡暹罗派僧团的开始。1802年，摩诃格罗瓦·匿纳唯曼罗帝须又从缅甸传入比丘僧团，名为阿曼罗波罗派。1865年，阿般格诃梵多·即陀沙婆再从缅甸传来比丘僧团，名为蓝曼匿派。斯里兰卡虽有三大派僧团，但他们的根本教理并无差别，都是南传上座部佛教。泰国和缅甸等国的僧团也是这样。</p>\n<h2>宗教特色</h2>\n<p>　　南传佛教又称南方佛教、南传上座部。指传布于南亚的佛教。分布在南亚地区的佛教，可大别为四类：（1）流布于锡兰、缅甸、泰国、柬埔寨、寮国等国家的南方上座部佛教。（2）兴起于越南，而与儒道二教混融的混<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>教。（3）过去在柬埔寨曾盛极一时的吉蔑民族所信奉的佛教。（4）爪哇、苏门答腊、马来半岛等地所传的南海佛教。</p>\n<p>　　上列四类中，第三、四类现今仅存艺术的遗迹。第二类属<a href=\"/\" class=\"keylink\" target=\"_blank\">中国佛教</a>系统。第一类又称为巴利佛教，盖此系统大部分均依据巴利语圣典。而所谓南方佛教，主要即指此系而言。</p>\n<p>　　公元前三世纪，阿育王派遣其子摩哂陀长老将印度本土佛教输入锡兰岛，此为锡兰佛教之开端。公元前一世纪，锡兰佛教分裂为大寺派与无畏山寺派。三世纪时，无畏山寺派又分出南寺派。其中，大寺派被视为锡兰佛教的正统。五世纪时，有觉音、达摩波罗等大注释家。</p>\n<p>　　在其他国家方面，公元四至五世纪以后，缅甸即有佛教传入，然采纳南方上座部佛教，则始于1058年阿耨楼陀王时代。公元十二世纪以后，泰国开始接受上座部佛教。1361年，锡兰的僧伽领袖，被迎入泰国，为泰王传戒。至于柬埔寨、寮国之接纳上座部佛教，则始自十四至十五世纪泰民族之征略后。</p>\n<p>　　南方上座部之特质在于严守戒律，保持原始佛教传统。在巴利文献方面，除了完备的经律论三藏，还有数量极为庞大的注释书、复注、纲要书、史书、文法书、诗书等。</p>\n<h2>称谓</h2>\n<h3>　　僧人的法名</h3>\n<p>　　俗人出家，加入僧团，就意味着由于信仰而舍弃家居生活，专事<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。这样的改变在称谓上的反映则是放弃了在家时的姓名而采用法名。</p>\n<p>　　佛陀住世时，出家的<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>相对简单，只是佛陀本人对欲出家者说：“善来，比丘。”彼人便剃除须发，着<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>衣，得<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。《善见律毗婆沙》载，依此法得戒者为一千三百四十一人。这些人则称为“善来比丘”。</p>\n<p>　　在僧团内，他们依然使用在家时的姓名，如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗、目犍连等。在当时佛陀的大弟子中德高望重者，已开始被人们以其出生地称呼，以表示敬重，如目犍连也被称为“拘律陀”（古印度地名，目犍连出生地）。</p>\n<p>　　后来的出家众日渐增多，且由佛的弟子们授戒，于是开始由授戒师给予法名。在《增一阿含》中有“四河入海，不复河名，四姓出家，皆为释种”之说。在中国的东晋时期，道安首倡所有出家人皆以“释”为姓，名则得之于授戒师。此后汉地出家<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>的法名均由此构成，如释道安、释法云等等。</p>\n<p>　　在斯里兰卡等南传上座部佛教国家，出家人的法名由两部分构成，第一名字为其出生地，第二名字为授戒师所赐，如：Walpola Rahula（瓦尔朴拉·罗睺罗），前者为其出生地，后者为其法名；又如：Kualalumpur Dhammajoti（吉隆坡·法光）。</p>\n<p>　　虽然僧人的法名是如此确定的，但这一法名不能随便用于称呼，其使用范围是有限制的，主要是用于自称。在非常庄重的场合，自称时常冠以Bhikkhu（比丘），如：Bhikkhu Kualalumpur Dhammajoti；在非常正式的场合，如护照、文件等，则不冠以Bhikkhu，而使用法名全称；在比较随便的场合，则只称法名第二部分，如：Dhammajoti。</p>\n<p>　　其次，在毕业、授职典礼等官方场合，由他人称呼其名，通常在名前冠以the Reverend（缩写为the Rev.意为尊敬的），或Venerable（缩写为Ven.也是尊敬之意），如：the Reverend Walpola Rahula。在非正式的、与某僧人较熟识的场合，出家人和在家人都可用法名的后一部分称呼之，但不可直呼，可称为：Venerable Dhammajoti。</p>\n<p>　　对于国内外有名望的大法师，或一省、一市之僧领，则多用其出生地+法师称呼之，如：Walpola Hamuduruwo（意为法师或师傅，是斯里兰卡对所有僧人最最常用的称呼）、Columbo Hamuduruwo等。有时，为了表示对大法师的敬意，常常使用敬语形式Hamuduruwane（即词尾变形）。</p>\n<p>　　以上是和僧人法名相关的称呼问题，在斯里兰卡，对僧人所使用的敬语称谓相当多，容后专章叙述。</p>\n<h3>　　对僧人的称谓系统</h3>\n<p>　　佛教<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>分为两个社会群体，即出家众和在家众，分别有各自的称谓系统。出家众称为Samgha（僧伽、僧众），又分为男女二部，男部由Bhikkhu（音译为比丘，意译为乞食男）和Samanera（意为沙弥，或<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>男）组成；女部本应由Bhikkhuni（比丘尼或说乞食女）和Samaneri（沙弥尼、十戒女）组成，但由于比丘尼传承在斯里兰卡已经断绝，至今没有二部受戒的比丘尼，只有十戒女。以上所有这些名称一般不用于相互之间的称谓，僧人与僧人之间、俗人对僧人称呼时，按照长幼、身份、职业和职责有许多不同的称呼方式。</p>\n<p>　　在斯里兰卡使用最多、最普遍的称谓形式是Hamuduruwo（意为法师或师傅），无论长幼、身份高低、是否认识，都可以这一称谓称呼。为了更确切地表达或表示敬意，则是在这一称谓前加不同的定语。</p>\n<p>　　例如按长幼称呼时，对于年幼的小沙弥（十几岁），出家人、在家人一般称之为Podi Hamuduruwo（意为小师傅）以表示尊重与亲近。在僧团内部，年长的僧人或地位高的僧人或依止师对小沙弥常称之为Podinama、Podiunnanse、Poditana、Podiatta等，这些称呼的基本意思都是“小和尚”，有时亲近师或依止师在向他人介绍徒弟时使用GolaNama，意为学僧。对于年纪稍长，或有身份的僧人，如一寺之住持，则使用Loku Hamuduruwo（大和尚、大法师）称呼之。例如在我们所住的寺庙内，常听到僧人或在家人以此称呼庙里的住持。</p>\n<p>　　按照在僧界僧职的高低，有Mahanayaka（大导师或大首领）和Nayaka（头领或导师）等称谓。前者用于称呼某一教派的大首领或全国性佛教组织的领导，在斯里兰卡，主要有三个教派，这些教派的首领加上其他几个小教派和全国性组织的头领，能称为Mahanayaka的僧人不过十人。在使用这一称谓时，通常称为Nahanayaka Hamuduruwo。Nayaka一般用来称呼地方省或区的僧领，或大寺之住持，通常称为Nayaka Hamuduruwo，这一称谓与Loku Hamuduruwo可以互用。</p>\n<p>　　另外，也可按照僧人的职业称呼之。在南传佛教国家，僧人可在政府、学校及其它社区部门任职，因此，根据他们各自不同的职业有不同的称呼方式，如：Veda Hamuduruwo（从医的法师）、Nakathbalana hamuduruwo（占星师）、Chitra-adina hamuduruwo（美术师）、Guru hamuduruwo（老师）等。</p>\n<p>　　不管僧人地位多高，从事何种职业，一律住在寺院中，过僧团集体生活，并在寺院中担负一定的职责，因而，可根据僧人在僧团中的任职称呼之。如：Bana kiyana hamuduruwo（说法师）、Pirith kiyana hamuduruwo（诵保护经师）、Kavi bana kiyana hamuduruwo（偈陀讲法师）、Kruhtyadikari hamuduruwo（掌财师）等。</p>\n<p>　　由于寺院生活相对简单、清净，有利于僧人的学习与修行，因而僧团中的著名学者或学问僧层出不穷，他们或在国内外的大学中获得博士学位，或通过佛教界的全国考试，获得班的达（或译为班智达）学位。这些法师深得僧俗各界的尊重，获得博士学位的，一般称为Doctor某某，如：Ven.Dr.Dhammajoti；获得班的达学位的则称呼Pandita hamuduruwo。据说，班的达学位甚是难考，考生不仅要熟练掌握梵、巴文，而且要能诵多部经，并擅说法布道。每年考试通过率仅为2%。在我们所住的寺庙中，有大约60位僧人，而获得此学位者仅一人。</p>\n<h3>　　对在家众的称谓</h3>\n<p>　　斯里兰卡是一个全民信教的社会，除了庞大的僧团之外，其余的人构成了在家信众，称为Upasaka（为受三归、持五戒的在家男居士，音译为优婆塞，意译为信男、近事男），和Upasika（受三归、持五戒之在家女居士，音译为优婆夷，意译为信女、近事女）。这两个名称和比丘、比丘尼一样，是对某一类人的统称，因此一般不用于指称某人。</p>\n<p>　　由于在家信众的护持与供养，僧团才得以生存、壮大，因此僧徒把在家信众称为供养人，即：Dayaka（音译为檀越，意译为男施主、男供养人）和Dayika（檀越、女施主、女供养人）。这两个名称在使用时，一般不和姓名连用。</p>\n<p>　　此外，僧人对在家人，尤其是长者，经常使用敬语，留待后章再述。</p>\n</div>"
    }
]