[
    {
        "title": "【谦卑】在佛教中为何是修行？谦卑的意思是什么？",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x8C26;&#x5351;&#x3011;&#x5728;&#x4F5B;&#x6559;&#x4E2D;&#x4E3A;&#x4F55;&#x662F;&#x4FEE;&#x884C;&#xFF1F;&#x8C26;&#x5351;&#x7684;&#x610F;&#x601D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0108/20160108032639636.jpg\" style=\"width: 373px; height: 231px\" /></p>\n<h2><a href=\"/remen/qianbei.html\" class=\"keylink\" target=\"_blank\">谦卑</a></h2>\n<p>　　谦卑，即“谦虚﹐不自高自大”之意。中国人有一股祖先传下来的骨子里的谦卑。学会谦卑，你会轻松，可以更好的经营自己的<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>。</p>\n<h2>谦卑的基本概念</h2>\n<p>　　谦卑，就是甘愿让对方处在重要的位置，让自己处在次要的位置。易经谦卦说：谦卑是指人因为虚心所以能进入对方的心，被别人接纳。而在沟通时彼此接纳是很重要的，因此谦卑作为一种品格也非常重要。如果你不谦卑，就不能够被别人接纳。不被别人接纳你就无法与别人沟通，无法与别人沟通你就什么事也别想做！如果人与人之间能够相互谦卑、互相尊重，那人与人之间的关系就会很好，大家团结一致就没有做不成的事情。因此，韬光养晦不只是一种生存策略，也是一种美德。一个甘愿处于次要位置的人，一个谦卑的人，最后会赢得大家的尊重和爱戴，这样的人在领导位置上也能好好地服务他人。而一个骄傲的人，一个锋芒毕露的人，常常因为无法接纳他人的意见，从而失去他人的支持，最终常常被降到卑贱的地步。所以说，谦卑对一个人很重要。</p>\n<h2><a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>中的谦卑</h2>\n<p>　　人生的每一种境界，都是<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，修什么呢。修谦卑。记得以前想要建设一个观音殿，那时太年轻气盛，总觉得自己很行。而后到处碰壁后，就慢慢学会了，要谦卑。所以后来我都很感谢那次的碰壁，那是一次很好的反省。做任何事情，都要谦卑。</p>\n<p>　　许多人走上社会后，会觉得到处碰壁，然后抱怨社会不公平。这个碰壁，其实是好事，人要是懂得修正自己，坏事也是好事。不懂得修正自己，好事也是坏事。比如说，一直都很顺利的人，他就会骄傲，这样子就会颠倒。所以，一切顺利一定是好事吗，不一定。</p>\n<p>　　去观察宇宙万物，山要是太有棱角了，石头太锋利了，水就要去冲刷它，把它磨平，弄得很光滑。很光滑后，水也好，风也好，再也损伤不到它了。这就是要谦卑，不要太有棱角，有自己的一套套。那做人也是如此，不要太有自己一套。你看水，装到方形盆子，水成了方形，装到圆形的，它就成了圆形。这个是我们学习的精神。</p>\n<p>　　人的一切，都是天地，他人给的。比如说，这个色身，是父母给的，也是天地精华所化。山精鬼魅修行几辈子，都是为了得到人身。人得到了，就要珍惜。那不仅色身是别人给的，任何一样，都是别人给的。用的，吃的，你找不到一样，自己可以生产的。所以古人要拜，天地君亲师是天地给的，父母的，祖先给的，他人给的，总之我们来到这个世界上，都是别人给的。所以要谦卑。同时要谦卑。</p>\n<p>　　再比如说名声。佛在世时，自己并没有自称佛，佛是<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>给的。那祖师大德在世时，也没有自己称自己为祖师，是弟子给他自己的。比如说惠能登上六祖的宝座，也是他的弟子给的。他的弟子叫做神会。所以<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>中说，<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>是树根，诸佛菩萨是华果。因为有众生，才有佛。</p>\n<p>　　谦卑是人一辈子要修行的。越修行越谦卑，才能进步。这个也是很难。比如说，我能写一写文字，大家给了好评，我似乎也觉得自己有些境界了。这就是害人。古人讲的，人要是死在自己的长项上。会游泳的人一般死在水上，会开车的，一般容易在车上遇难。人有一定长项，就会自夸，就有了骄傲的资本。这不是损害自己的修行吗?做了善事的，会执着自己的善事。念了几部经的，会执着自己会念经。吃素的，会执着自己吃素，盖了庙的，会执着自己盖了庙。人都觉得自己有些<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，这样子恰恰是失去了功德。</p>\n<p>　　谦卑是一生的功课，尤其是修行人。要时刻点醒自己。修成了谦卑，什么都修成了。</p>\n</div>"
    }
]