[
    {
        "title": "【三观】是什么意思？佛教三观是指哪三观？",
        "date": "2016-01-14",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x4E09;&#x89C2;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x4E09;&#x89C2;&#x662F;&#x6307;&#x54EA;&#x4E09;&#x89C2;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0820/20180820052910749.jpg\" title=\"&#x3010;&#x4E09;&#x89C2;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x4E09;&#x89C2;&#x662F;&#x6307;&#x54EA;&#x4E09;&#x89C2;&#xFF1F;\" /></p>\n<p style=\"text-align: center;\"><strong><a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a><a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>是指什么？佛教三观是什么意思？</strong></p>\n<p>　　三观，在佛教中有多种解释，一是指<a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>三观（空观、假观、<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>）；二是指<a href=\"/remen/huayanzong.html\" class=\"keylink\" target=\"_blank\">华严宗</a>三观（真空观、理事无碍观、周遍含容观）；三是指南山三观（性空观、相空观、<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>观）；四是指慈恩三观（有观、空观、中观）；五是指三种三观（别相三观、通相三观、一心三观）。其中以天台宗为诸家所说三观中最为普遍之一说。</p>\n<h2>天台宗三观</h2>\n<p>　　天台宗三观是指「空观、假观、中观」。“空”，就是本体不实在，万法无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>，是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生法，如幻如化。“假”，就是在因缘生法、如幻如化的现象上，假名安立一切事物的名词。假名，只有幻象，没有实体。“中”，就是那个法里头既有幻象的假有，又有无自性的空。</p>\n<p>　　“空观、假观、中观”是天台宗的重要法门，智者大师所立，为教义与实践之骨架。系对于一切存在作三种观法，即空观、假观、中观，称为‘空假中三观’。此乃依据菩萨璎珞本业经卷上贤圣学观品所说‘从假入空二谛观，从空入假平等观，中道第一义谛观’而立。</p>\n<p><strong>　　（一）空观</strong></p>\n<p>　　空观，又作从假入空观、二谛观。空者，离性离相之义。谓观一念之心，不在内，不在外，不在中间，称之为空；由观一念空之故，而一空一切空，无假无中而不空；此因空、假、中三观能荡除三惑之相，以空观荡除见思之相，以假观荡除尘沙之相，以中观荡除无明之相，三相皆荡，即毕竟空，是为空观。简而言之，自世俗常识之立场（假）进入<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>立场之真理（空），是为空观。</p>\n<p><strong>　　（二）假观</strong></p>\n<p>　　假观，又作从空入假观、平等观。假者，无法不备之义。谓观一念之心，具足一切诸法，称之为假；由观一念假之故，而一假一切假，无空无中而不假：此因空、假、中三观皆能立法，以空观立<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>之法，以假观立俗谛之法，以中观立中谛之法，三法皆立，即为妙假，是为假观。简而言之，不停滞于‘空’，而进入佛智遍照之世俗境界，是为假观。</p>\n<p><strong>　　（三）中观</strong></p>\n<p>　　中观，又作中道第一义谛观。中即中正，泯绝二边对待之义。谓观一念之心，非空非假、即空即假，称之为中；由观一念中之故，而一中一切中，无空无假而不中；此因空、假、中三观皆能泯绝对待，言空则空外无法，言假则假外无法，言中则中外无法，三者皆绝待，即为圆中，是为中观。简而言之，不执空观，不执假观，空假<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>之大悲菩萨行，是为中道观。</p>\n<h2>华严宗三观</h2>\n<p>　　华严宗三观是指「真空观、理事无碍观、周遍含容观」。真空观是观一切法界的事相，皆以空为性，惟此空不是无的空，乃是真如的理性，超然而离诸相；理事无碍观是观真如的理性能生万法，故万法也就是真如，犹如水即是波，波也就是水一样；周遍含容观是观诸法互相含摄，重重无尽，不相妨碍，一可摄多，多亦含一，大小互容，举一全收，具足而相应。</p>\n<p><strong>　　一、真空观</strong></p>\n<p>　　真空观，穷尽法界之事相，无一有自尔之别性，皆归于平等之空性，以空为性也。空者非顽无之空，真如之理性超然而离诸相，故名为空观。吾人所见之森罗万象，悉为妄情之偏计，犹如空华之实性为<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，于口泯亡妄情所见之事相，显真空之妙体，名为真空观。真空即四法界中之理法界也。</p>\n<p><strong>　　二、理事无碍观</strong></p>\n<p>　　理事无碍观，今显实空，泯情所见之事相，以显真如之空性。然共此真如，非凝然无为之顽体，具不变<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>之二义，虽以不变之故，常往无作，然以随缘之故变造一切诸法。然则吾人所见之万象皆为真如之随缘，随缘之万象即真如也。犹如水即为波，波即为水。所谓色即是空空即是色是也。如是观真如性起万法，万法一一以真如为性，名为事理无碍观。此四法界中事理无碍法界也。</p>\n<p><strong>　　三、周遍含容观</strong></p>\n<p>　　周遍含容观，既知法界一一之事相为真如之随缘性起矣。而其起也。非分取真如之性，性为一味平等，不可分取。一微一尘，悉完具真如之全体也。故完具理之一一事相，如其理性之法界融通，一一事相亦遍含容一切法界而重重无尽也。此名周遍法界性。是为四法界中之事事无碍法界，随缘观之至极也。详见华严法界观。</p>\n<h2>南山三观</h2>\n<p>　　南山三观是指「性空观、相空观、唯识观」。终南山道宣律师所立，这三种观法，是基于南山宗把释迦如来一代的教法区分作化制二教，其中化教又分作性空教、相空教、唯识圆教三种，这三种化教的观法，即分为性空观，相空观，唯识观，后人称此为南山三观。性空观是观诸法缘生性空；相空观是观诸法的相皆空无虚妄；唯识观是观诸法唯识所现。</p>\n<p><strong>　　（一）性空观</strong></p>\n<p>　　性，即性分也。谓声闻缘觉小乘之人，观因缘所生一切诸法，其性本空，皆无有我。常以此理，照察自心，故名性空观。</p>\n<p>　　性空观。将因缘所生世出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>一切诸法，藉剖析的方便，观察它的自性本空，求人求法，了不可得，这叫作“析色明空”，破除对于人法本身的执着，叫它作性空观，又作析空观。</p>\n<p><strong>　　（二）相空观</strong></p>\n<p>　　相，即相状也。谓藏通二教菩萨，观因缘所生一切诸法，其相本空。但<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>情执，妄见种种差别之相。常以此理，照察自心，故名相空观。</p>\n<p>　　相空观。进而观察因缘所生一切诸法，外相似有，实自空无，犹如空华水月，但众生情执妄见种种差别之相，这叫作“当体即空”，叫它作相空观。</p>\n<p><strong>　　（三）唯识观</strong></p>\n<p>　　识，即<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>也。谓别圆二教大菩萨，皆了世间一切外尘诸法，自性清净，本来无实。此理深妙，惟意缘知，故名惟识观。</p>\n<p>　　唯识观。观察一切外尘诸法，唯识所变，本来无实，这样“识有非空，境无非有”，算是“性相圆融”，叫它作唯识观。</p>\n<p>　　道宣律师认为佛教的教法，不出性空、相空、唯识三种，所以本此而立三观，观无不尽。如《四分律行事钞》说：“然理大要不出三种：一者，诸法性空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>，此理照心，名为小乘。二者，诸法本相是空，唯情妄见，此理照用，属小菩萨。”（照心，照用的解释，如《行事钞资持记》说：“言照用者，二乘住寂，故但照心；菩萨涉事，故云照用”）三者，诸法外尘本无，实唯有识，此理深妙，唯意缘知，是大菩萨<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>证行。</p>\n<p>　　又如《羯磨疏》说：“要而言之，不过三种：一者，小乘人行，观事生灭，知无我人<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>等性；二、小菩萨行，观事是空，知无我人善恶等相；三、大菩萨行，观事是心意言分别。”《济缘记》更加以解释说：“初则见相如实，观性本空；次则见相如幻，空华水月，当相即空，不待观性；后则观一切法<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>所受，心外无法。”</p>\n<p>　　道宣的三观，本于他的四分律学，而他的四分律学，受当时玄奘法师所弘阐唯识学说的影响很深，所以以唯识观为极致（参阅化制二教）。</p>\n<h2>慈恩三观</h2>\n<p>　　慈恩三观是指「有观、空观、中观」。有观是观依他圆成之二性为有；空观是观遍计之一性为空；中观是观诸法以遍计性之故，非有，以依他圆成之故，非空，即是非有非空之中道。</p>\n<p>　　然此中道有二。对望中道者，如上所云，三性对望立非有非空之中道也。一法中道者，三性一一有非有非空中道之义也。其先遍计性为情有理无之法，故以情有之故非空，以理无之故非有，即非有非空之中道也。其次依他圆成之二性为情无理有，妄情所执之依圆，其体性非有，离迷情之圣智之境，体性宛然，而非空，故亦非有非空之中道也。见义林章一本，观心觉梦钞。</p>\n<h2>三种三观</h2>\n<p>　　三种三观是指「别相三观、通相三观、一心三观」。谓以观观心，不出次第圆融之义，故有三种不同也。</p>\n<p><strong>　　一、别相三观</strong></p>\n<p>　　别相三观者，即历别观于三谛也。谓若从假入空，但得观真，尚不得观俗，岂得观中道？若从空入假，但得观俗，未得观中道。若入中道正观，方得双照二谛，是名别相三观。（从假入空者，谓观<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之假，入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>真空也。观真、观俗、观中道者，真即真空之理，真谛也；俗即诸法宛然，俗谛也；中道，即中谛也。）</p>\n<p><strong>　　二、通相三观</strong></p>\n<p>　　通相三观者，即于一观中圆解三谛也。谓若从假入空，非但知俗假是空，真谛中道亦通是空；若从空入假，非但知俗假是假，真谛中道亦通是假；若入中道正观，非但知中道是中，俗假真空亦通是中。但以一观当名，解心皆通，是名通相三观。</p>\n<p><strong>　　三、一心三观</strong></p>\n<p>　　一心三观者，即于一念心而能圆观三谛也。谓观一念心，为从何处来？去至何所？毕竟无有，净若虚空，名空观。能观之观，所观之境，历历分明，名假观。虽历历分明而性常自空，空不定空，假不定假，名中观。即三而一，即一而三，是名一心三观。</p>\n</div>"
    }
]