[
    {
        "title": "【三论宗】-佛教宗派",
        "date": "2016-04-22",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0422/20160422053037880.jpg\" style=\"width: 484px; height: 300px\" /></p>\n<h2>三论宗 （中国隋唐时代<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>宗派）</h2>\n<p>　　三论宗是中国隋唐时代佛教宗派，祖庭为西安草堂寺；南京栖霞寺。因据印度龙树 《中论》、《十二门论》和提婆 《百论》三部论典创宗而得名。又因其阐扬“一切皆空”、“诸法性空”而名空宗或法性宗。后秦鸠摩罗什传译《三论》，盛倡龙树、提婆之学，为创立三论宗奠定了理论基础。后来，南朝刘宋时僧朗将鸠摩罗什、僧肇的学说传入江南。僧朗<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>僧诠，僧诠门人法朗，数代相传，教义渐趋成熟。法朗门人吉藏集鸠摩罗什、僧肇、僧诠、法朗等人的三论学说的大成，创立三论宗。吉藏门下有慧远、硕法师等，硕门人有元康，继续弘扬“三论”。但是流行不久，该宗即渐趋衰微。</p>\n<h2>简介</h2>\n<p>　　<a href=\"/\" class=\"keylink\" target=\"_blank\">中国佛教</a>宗派。隋吉藏创立。因依龙树的《中论》、《十二门论》和提婆的《百论》等三论立宗，故名。此宗的学统，在印度是：龙树一提婆一罗睺罗一青目一须利耶苏摩一鸠摩罗什。在中国则是：鸠摩罗什一僧肇一僧朗一僧诠一法朗一吉藏。 史略此宗初祖龙树。是释迦牟尼灭后第一个重要的<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>学者。其《中论》、《十二门论》等，发挥缘起性空的学说，为大乘佛学建立了牢固的理论基础。龙树将其学说传给弟子提婆，提婆深得其要领，辩才无碍，在与异派学者辩论中多次获胜。著有《百论》和《四百论》等，大大发扬了龙树学说。提婆之后，经罗睺罗、青目至西域沙车国王子须利耶苏摩。</p>\n<p>　　鸠摩罗什师承须利耶苏摩，专弘<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>性空之教，为四方学者所宗，道流西域，声被东国。后秦弘始三年（401）来到长安，姚兴待以国师之礼，四方义学<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>闻风而至者800余人。</p>\n<p>　　鸠摩罗什在长安草堂寺（后秦之逍遥园）内与弟子翻译的经典计97部，425卷，其中包括《中论》、《百论》和《十二门论》等“三论”。经道生、僧肇等人对它们的大力弘传，形成了早期的三论宗。鸠摩罗什入寂于后秦弘始十五年（413），并葬于草堂寺。</p>\n<p>　　鸠摩罗什盛倡龙树、提婆般若性空学说。门人号称三千，著名学者不下数十人，唯有僧肇精纯守一，得罗什之真传。罗什、僧肇之后，长安大乱，僧徒四散，三论传承，记载不明。南传罗什之学者虽不乏其人，但对后世均无甚影响。此学所以传承不绝者，端赖以《<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>》、“三论”命家，兼修禅观的僧朗。僧朗有得业弟子僧诠。僧诠门徒数百，上首弟子有法朗、智辩、慧勇、慧布4人，其中最著者为法朗。他在僧诠门下，禀受《华严经》、《大品》（即《摩诃般若经》）、《大智度论》、《中论》、《百论》、</p>\n<p>　　《十二门论》。僧诠殁后，于陈、永定二年（558）奉敕移住兴皇寺，被尊为兴皇大师。陈、隋三论学者多出其门下。其中最著名者为吉藏。他著作宏富，陈义精微，评判由晋以来各家学说，亦采取南北各派长处，大凡当时流行的经典，多为注疏，在此基础上，正式建立了三论宗。</p>\n<p>　　当时，除吉藏一系而外，同时弘传三论的学者亦复不少。因此三论学说在初唐曾盛极一时。后来<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>、华严、<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>相继成立和流行，此宗逐渐不振。但大历（766～779）年间，金陵有玄璧法师弘传三论，浙江金华有慧量法师专讲三论。虽至中唐，传三论者尚有人在。会昌禁佛之时，此宗章疏被毁殆尽，几成绝学。清代末年，海运畅通，杨文会<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>始从日本将此宗失传的章疏著作取回，世人方能探讨而窥其全貌。</p>\n<p>　　此宗所依经典，自罗什、僧肇、僧朗相承以来，就以《大品》、《<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>》、《华严经》为宗依。至法朗又加《<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经》。即有4部大经，所以隋唐诸三论师的传记中每每有“四经三论”或“四论三经”之说。此外《维摩经》、《仁王经》、《金刚般若经》、《胜鬘经》、《金光明经》等，也都有较详细的疏解。《智论》、《中论》、《百论》、《十二门论》是此宗的根本论典，除《智论》外，吉藏均有注疏。关于此宗的专著如《大乘玄论》、《法华玄论》、《净名玄论》、《二谛章》、《三论玄义》等皆是此宗的要典。</p>\n<p>　　此宗广破一切有所得，实有实无的偏见，说大乘经同明一道，同以无所得正观为宗，对如来所说经教，不作高下优劣之分，但因<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的根性千差万别，所以佛说的法门就有种种的不同。这叫随机施教，因病授药。因此立有二藏三轮以判一代佛教。二藏是依《大品》、《智论》等所说的声闻藏、菩萨藏，也就是小乘藏和大乘藏。吉藏《法华游意》中说：佛教中虽复尘沙，今以二意往收，则事无不尽。一者赴小机说，名曰小乘；二者赴大机说，称为大乘。而佛灭度后，结集法藏人，摄佛一切时说小乘者名声闻藏，一切时说大乘者名菩萨藏，即大小义分，深浅教别也。三轮的判教：一是根本法轮，指《华严经》；二是枝末法轮，即《华严经》之后，《法华经》之前一切大小乘经；三者摄末归本法轮是《法华经》。二藏和三轮，形式不同，其实一致。二藏是横判，三轮是竖判；二藏是大小两乘，三轮也只是本末二轮。所以说《法华经》之前“般若”诸大乘经为枝末者，以其不废三乘权教故名枝末，非谓“般若”等明理不究竟被判为枝末，不同阿含经本身是权教，说为枝末。</p>\n<h2>三论宗源起</h2>\n<p>　　此宗始于鸠摩罗什译出龙树《中论》、《十二门论》与提婆的《百论》，奠基于南北朝僧肇、辽东僧朗、兴皇法朗、茅山大明、吉藏大师。因依《中论》、《十二门论》和《百论》等三论立宗，故名为三论宗，属大乘<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>派。</p>\n<p>　　鸠摩罗什来到中国后，尽译三论，弟子事之者称三千人。以道融、僧睿、僧肇、道生，为尤著，并称为\"关中四杰\"。至什公去世，姚秦败亡，弟子四散，各自传播经典。其中被称为“解空第一”的僧肇不幸早死。向东南弘传的，如彭城的僧嵩，寿春的僧导，主要以《成实论》的宏扬为主，后世称为成实宗。至于僧睿、道生、慧观等人，则重视《法华经》与《涅盘经》的传播，至于鸠摩罗什所重视的般若中观与三论则反而被遗忘了。重新将三论研究发扬光大的，则是辽东僧朗大师及其门下。</p>\n<p>　　僧朗大师原居辽东，因当时辽东属于高丽，僧朗大师又被称为“高丽朗”，对华严、三论有深入研究。僧朗大师的传承不明，嘉祥吉藏说他曾在北方学到什公、僧肇门下的三论正义。南朝齐建武（西元494─497）年间，僧朗大师到达江南，隐居于摄山（即栖霞山），梁武帝派了僧诠等十人，去向他学习三论，三论宗也随之光大。僧诠大师后住摄山<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>寺，终身不下山，同样致力于华严、三论的研究。兴皇法朗，长干智辩，禅众慧勇，栖霞慧布都是僧诠大师的得意门徒。兴皇法朗曾作《山门玄义》，以三论意旨评破成实宗，因其辩才，又被称为“伏虎朗”。在法朗大师的努力下，三论传遍江南，远至于四川，成为南朝陈的佛教正宗。他的徒弟嘉祥吉藏大师是三论义学的集大成者。</p>\n<p>　　兴皇法朗去世时，嘱付茅山大明法师继续领导其门下学众，茅山明法师“即日辞朗，领门人入茅山，终身不出”。他的门人，如慧皓、慧棱、法敏等都是杰出人才，牛头宗的创始者法融也出于他门下。另一个门人智锴大师隐居庐山大林寺，二十年不下山，智锴曾从智顗，兼习天台教义，禅宗四祖道信曾经居于大林寺十年，之后道信改变<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>达摩以《<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>》印心的传统，改以般若经教学，不能说没有受到三论宗的影响。</p>\n<h2>宗义</h2>\n<p>　　三论宗又名大乘空宗、般若宗、性宗、破相宗。此宗广破一切有所得，实有实无的偏见，说大乘经同明一道，同以无所得正观为宗，对如来所说经教，不作高下优劣之分，但因众生的根性千差万别，所以佛说的法门就有种种的不同，随机施教，因病授药。</p>\n<p>　　诸法性空的“中道实相论”，为此宗的中心理论。这种理论，总说<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>、出世间万有诸法，都是从众多<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>和合而生，是众多因素和条件结合而成的产物，这叫缘起，离开众多因素的条件就没有事物，事物皆无自身质的规定性，皆非实体，这叫无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>，也就是性空。即缘起事物的存在就是性空，不是除去缘起的事物而后说空。如《十二门论》所说：“众缘所生法，即是无自性，若无自性者，云何有是法。”这就是说：缘起法无自性就是毕竟空。把缘起和性空统一起来，从缘起和合的现象中，直指“缘起”与“性空”不是对立的，所以，不离性空而有缘生的诸法；虽有缘起的诸法，也不碍于毕竟空的中道实相。“缘起就是性空，性空就是缘起；真空不碍妙有，妙有体现真空”，这就是中道实相论。</p>\n</div>"
    }
]