[
    {
        "title": "【色法】是什么意思？佛教色法解释",
        "date": "2016-02-20",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x8272;&#x6CD5;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x8272;&#x6CD5;&#x89E3;&#x91CA;\" src=\"https://www.liaotuo.com/uploadfile/2018/1009/20181009043703351.jpg\" title=\"&#x3010;&#x8272;&#x6CD5;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x8272;&#x6CD5;&#x89E3;&#x91CA;\" /></p>\n<p style=\"text-align: center;\"><strong>色法是什么意思？</strong></p>\n<p>　　色法，是指物质现象，即是<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>的身体及身体所赖以生存活动的环境。泛指有质碍性之物，即占有一定空间，具有自他互相障碍，及会变坏之性质者。即是众生的身体及身体所赖以生存活动的环境。如果以“五位百法”为一切万法分类，则可分为色法、心法、心所法、心不相应行法、<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>等五位。其中色法，在<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>分类中称为色蕴，心法称为识蕴。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>宗的五位百法中，将色法分为三类十一种：即一、眼、耳、鼻、舌、身五根。二、色、声、香、味、触五境。三、无表色。在五位百法中，色法在心法、心所法之后，乃因其不能独立生起，而仅为前二者的变现之故。</p>\n<h2>一、眼、耳、鼻、舌、身五根</h2>\n<p>　　眼、耳、鼻、舌、身、是五根，但怎样成其为眼等五根呢？亦由坚等、色等、能所八法而构成。而其与普通所接触所见闻的境物不同。即是动物有<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>的有机体，有特殊的功用，如眼能见，就与普通物质不同，以能发见用，故见虽由于<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>，而眼能有发见的功用。如是耳有闻声功用，鼻有嗅香功用，舌有尝味功用，身有觉触功用。所以五根虽属色法，而与平常所指物质有异；以其各能发功用，故为有生命的有机体，而无生命的无机体，便无功用。</p>\n<p>　　但眼等亦由坚等质力所构成，为眼根等所依处的，则有表面的形相可见；但是真正的五根，在佛学说，非常眼所能见，就是“净色根”。平常眼见物，是眼识依眼根作用，如瞎子无眼根，即不能见物。而真正的眼根──净色眼──非常眼所见，<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>到天眼方见。这五根，颇同科学所谓神经系统，遍于全身，因此而能发各部的感官作用，如眼能发见，耳能发闻等。而身根、一方面又同心理学所谓全身总机开的脑；脑、在佛学亦属身根，身根有两种作用：一、接触所触，二、为五根共同所依，如眼等发用，皆依其功能。所以身能为全体的总依，同时、亦发生特别作用，故相似神经与脑。</p>\n<p>　　法处所摄色是同前长、短、方、圆等由比量而知的色不同，非眼所见，是由意根辨别而知者，为法处所摄色。这有五种：一、极略色，即极微色，微是细小的意义，正显这色是色法中最小的一粒微点，虽有质而不可分析，如化学中分析到原子、电子等无可分析，非以眼见，但可意度，即是极微色。二、极迥色，就如把光、影、明、暗、空一显色等分析到极远，名极迥色，也是由<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>构画而成，如天文学家推测到星云星海，而不可捉摸者是。三、受所引色，是指<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>等所引的色。四、遍计所执色，即如通常一般人说有造物者主宰宇宙的神等，本无实体，计执而认为实有，在佛学中皆谓之遍计妄执色。五、定<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>所生色，即是定中所行境界现起种种影像的色法。</p>\n<h2>二、色、声、香、味、触五境</h2>\n<p>　　1.色，即眼根所见者为色，又可分三种：甲、显色，即光中所显现的色，如青、黄、赤、白等皆是显色，如现在科学中说明太阳光分七色等。乙、形色，眼所见者，如长、短、方、圆等色是。丙、表色，即动作，如风撼树木等色是。</p>\n<p>　　2.声，就是耳根所闻的粗、细、响、微等声，皆包括其中。</p>\n<p>　　3.香，是鼻根所嗅的香、臭等境界，皆包括其中。</p>\n<p>　　4.味，就是舌根所尝到甜、酸、苦、辛等味，皆包括其中。</p>\n<p>　　5.触，触有能触和所触，如身体是能触；冷、暖、饥、饿等被动的境界是所触；此中所明，即所触的境界。</p>\n<p>　　以上五种，皆由五官所感觉到的境界，是色法中的前五种。但是其中所触包含甚广，平常所说的物质，多可属于所触。如所见的色法，能任人执持、抛弃，或以身手所触，知其硬软，或以分量相称，知其轻重，故色法是质碍的，如墙壁等所障，即难通达。然其质碍之性质虽多，而根本者不外坚、湿、热、轻。这四种，若以具体地表显，即地、水、火、风的四大。但四大亦是指所触的性质，如坚是地性，湿是水性，或地是坚质，水是湿质；如中国所谓金、木、土等。</p>\n<p>　　凡坚硬性质，皆可包括地大中，凡流湿性质，皆可包括水大中；这二种分析，可说是物的体质。热、用具体表现，即火大的性质；轻、轻到极轻而动，即佛学中所谓四大中之风大，而从其性质名为轻。故与上可说力与质。其所接触的性质，可分坚和湿，而力中则可分热和轻。但是这四大种是能造──主动──的色法，前所说的色、香等是所造──被动──的色法，以凡具体存在的色、香等，皆藉坚等众缘而依住，故色等为地等所造的色法。但所谓能造，非有能造作其他的意义，不过、凡所造法皆依能造法为根本而生起罢了。如所见所闻的境物，其性质中皆具有坚等体性。故以坚等为能造，所接触的所造色，皆赖其为根本而生起，此为色等五法大略分析。</p>\n</div>"
    }
]