[
    {
        "title": "善心（名词解释）",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"275\" src=\"https://www.liaotuo.com/uploadfile/2016/0111/20160111022046261.jpg\" width=\"332\" /></p>\n<h2><a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　善心（shàn xīn），形容好心；善良的心意。语出《荀子·乐论》：“使其曲直、繁省、廉肉、节奏，足以感动人之善心。”《生经》卷四：“其五百童，虽有善心，<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>福薄。”《云笈七签》卷九五：“大王及诸羣臣八千馀人，皆发善心。” 巴金 《灭亡》第二十章：“你的前途是很幸福的，你有青春，你有<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>力，你有无限的善心。”</p>\n<h2>善心善行</h2>\n<h3>　　概述</h3>\n<p>　　善行是善心的结果，而善心是善行的出发点，我想大家都会认为我说的模棱两可，但是做什么事都要讲究结果，就算过程精彩也是为了结果打基础。如果你有善心而没善行就好像纸上谈兵，谈了很多还是无从下手，所以没有善行的话善心的话好像一堆废墟，如果你一直说你有善心但你从来没有去表现你的善心，这有用吗？没用。 无论心是怎样，但行动才能给人带来实在的东西，才能解决实在的问题，这是很重要的，因为人不可能以精神为粮食。一个社会也不可能靠善心来支持，也许心很重要。但造成结果的却往往是真实的行动。</p>\n<h3>　　好处</h3>\n<p>　　有了善良的行动，就可能造福于不同的群体。</p>\n<h3>　　关系</h3>\n<p>　　可能你会想。没有善良的心怎么会有善良的行动呢？不然，善行的话往往会有两个举动，一个就是你们所想的由善心而出发的，还由一个就是出自瞬间迸发的热情，所以没有善心的出发点也可能以善良的行动给别人带来幸福快乐。善行与善心最终的目的是为了给别人一种幸福，一种快乐，一种安慰，一种实在的东西，你有了心而没行动，人家会感觉到幸福，快乐，安慰吗？也不会。</p>\n<h3>　　辩驳</h3>&#13;\n　　<strong>善行重要于善心</strong>\n<p>　　我认为善心与善行的关系就好似决心与恒心的关系。往往有决心的人总是会失败的。而有了恒心的人总会做事成功。</p>\n<p>　　最后我还想问你们个问题，你们有善良的心而没去行动，你敢说你很善良吗？请搞清楚当你说出善良的时候，应该有你所做的事实依据。要不然人家问你你善良在哪啊？你总不能回答我有善心啊，这样你能说服人家吗？不能吧。所以你应该有实际的行动。如果你在有了善良行动的基础下你就可以雄赳赳气昂昂的说我是很善良的，因为那个时候你就有事实的依据，你也可以为你的话负责，人家问你怎么善良的时候，你也可以有很多的依据回答人家。</p>\n<p>　　所以这个社会需要的是实在的东西，也就一位着这个善行的重要性，我也不是完全不重视善心，只是我比较看重善行，就是因为善行是实际的，而善心是虚的。我想你们也会追求实际的。</p>&#13;\n　　<strong>善心重要于善行</strong>\n<p>　　<strong></strong>　英国作家伯吉斯的小说《发条橙》堪称一部现代经典。它的主要内容如下：少年亚历克斯是一个地地道道的小流氓，他打架斗殴、无恶不作。在他被捕后，政府采用经典条件反射技术——书中称为“路多维哥氏技术”对他进行“治疗”，使他一想到暴力，就会头痛、恶心，从此他不能作恶，只能为善。</p>\n<p>　　这部小说引我们深思的一个问题是：强迫为善，是真正的善吗？小说中的牧师面对小亚历克斯时，表达了自己的疑问：“上帝想要什么呢？上帝是想要善呢，还是向善的选择呢？”</p>\n<p>　　秦晖先生曾经在文章中引用过一个“监狱寓言”：世界上最高尚的地方在哪里？——在监狱。牢门一关，那里的罪案发生率为零，而且所有的人都在毫不利己，专门利人地干活儿。如果对牧师的问题的回答是前者，那么肯定能够推出以上的荒唐结论：既然善行本身是最重要的，那么监狱中的犯人和奴隶的劳动无疑是最“善”的。但想必没有几个人会同意这个结论。</p>\n<p>　　这让我想起了阿妮达陈研究文革红卫兵的的着作《毛主席的孩子们》，其中一段是讲“文革”前的学雷锋运动的：学生们挖空心思地想做哪些“无名”好事才会被别人发现，日记里该写哪些内容，是否应该把脏衣服藏起来以免别人“做好事”替自己洗了，甚至有个学生晚上睡觉时大喊“毛主席万岁”，以示自己做梦还不忘毛主席！这些“学雷锋”的举动是真善吗？显然不是，很多人可能会说，这是伪善。事实上，这些学雷锋的举动是为了争取一个较好的政治评价，为成为“接班人”铺路。</p>\n<h2>总结</h2>\n<h3>　　名句</h3>\n<p>　　那么，什么才是真正的善呢？让我们再次引用牧师的话：“善心是发自内心的，六六五五三二一号（亚历克斯在监狱中的编号）。善心是选择出来的事物。当人不会选择的时候，他就不再是人了。”“人选择了恶，在某个方面也许要比被迫接受善更美妙吧。”</p>\n<h3>　　真缔</h3>\n<p>　　自由选择的善才是真正的善；有自由选择的权利，才有真正的善。</p>\n</div>"
    }
]