[
    {
        "title": "【随缘】是什么意思？佛教里随缘的意思",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x968F;&#x7F18;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x968F;&#x7F18;&#x7684;&#x610F;&#x601D;&#x3001;&#x89E3;&#x91CA;\" src=\"https://www.liaotuo.com/uploadfile/2018/0710/20180710030730454.jpg\" title=\"&#x968F;&#x7F18;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x968F;&#x7F18;&#x7684;&#x610F;&#x601D;&#x3001;&#x89E3;&#x91CA;\" /></p>\n<p style=\"text-align: center;\"><strong><a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>是什么意思？随缘的意思</strong></p>\n<p>　　<span style=\"color:#ff0000;\">随缘，是随顺各种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>的意思，是指哪一种因缘先成熟，距离最近最亲，就到哪里去</span>。外界之事物来，与自体以感触，谓之缘。应其缘而自体动作，谓之随缘。缘就是各种关系、各种条件；随缘，就是不要去勉强，但不等于不去努力。无论对人对事，都不要去攀附、要求外境，而是把重点放在自己的身心行为上，随着自己面临的缘起而善加努力，就是随缘。随缘的心，不为顺境而狂喜，也不因<a href=\"/remen/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>而沮丧，平静而有力量。<strong><span style=\"color:#ff0000;\">以下是众法师对随缘的解释。</span></strong></p>\n<h2>随缘的意思（学诚法师）</h2>\n<p>　　“随缘”的意思是，做好自己能做的一切准备，来面对、因应外在的因缘。因缘没到，不着急、不强求；情况与自己想象的不一样，能够做出调整而顺应它；因缘过去了，不沮丧、不牵挂。很多人理解随缘，都是因缘消散时的安慰，随缘的确包含这一层意思，但这不是全部。如果只抓住这一面，而没看见“随缘”积极的一面，就会把随缘误解为随便、放弃。</p>\n<p>　　随缘，就是逢山开路、遇水搭桥。把握自己<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>的方向，随着因缘变化而采取适宜的行为，这才是真正“做<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>的主人”拥有的态度。随缘，是自己内在有主心骨、有愿力，并对<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>有着深刻的认识，所以能够不粘滞，随着外在的因缘灵活调整。随缘，是在自己身心上努力，根据外在因缘条件的不同而选择不同的做法。</p>\n<p>　　随缘不是随便，是在宗旨不变、<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>不变的前提下，根据外在的因缘灵活选择事情的处理方法。随缘绝不是指自己不需要付出任何努力，而是善于利用现实因缘更好地努力，着重点仍然是在自己身心上。譬如，法师有开微博的因缘，就随顺这个因缘，利用微博亲近<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，这是很好的。</p>\n<h2>随缘的意思（<a href=\"/fjrw/hcrw/dafs/\" class=\"keylink\" target=\"_blank\">大安法师</a>）</h2>\n<p>　　随缘不是消极，随缘就是顺着我们的本分去做，素位而行。我是富贵的时候就过富贵人的<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，把富贵人的生活做好，来帮助别人。我是贫穷的时候，我就过贫穷人的生活，我就节衣缩食，我也过好我贫穷的生活，这就随缘。</p>\n<p>　　你不要贫穷的时候，你还要追求富贵，这都是非分之想。现在很多人欲望很高，就是非分之想太厉害了，所以就导致了很多不必要的这种意外的灾祸。所以你随缘，还是尽你的本分，做好你的本职工作，把你的各方面做好。</p>\n<p>　　你命中有的，或者你命中还欠缺点什么，实际上你这种心态，还反而会更好，是这样随缘。随缘里面有积极进取，随缘里面不是偷懒，随缘就是你对于事情的结果不要执着。</p>\n<h2>随缘的意思（<a href=\"/fjrw/hcrw/jqfs1/\" class=\"keylink\" target=\"_blank\">济群法师</a>）</h2>\n<p>　　随缘，通常被人们误解了。随缘，似乎就等同于不做任何努力，是被动、消极的表现。这就把随缘和进取对立起来了，以为随缘就不思进取，进取就不能随缘，其实不然。</p>\n<p>　　我们讲的随缘，其实是很<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的。任何一件事的成败，都离不开因缘<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>这四个字。其中，有客观条件，也有主观因素。当我们面对一件事的时候，如何随缘？这就要考量各种因素，审时度势，然后做出智慧选择，而不是一厢情愿。因为多数人都是很主观的，我们带着经验和观念的模式在看世界，带着执著和强烈的需求在选择，这样难免会产生片面认识。所以，<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>告诉我们要随缘。</p>\n<p>　　懂得随缘的人，才能更好地进取，才不至于一意孤行。在综合评估各种因素的前提下，采用最合理的方法，才有助于目标的实现。</p>\n<h2>随缘的意思（<a href=\"/fjrw/hcrw/xyds/\" class=\"keylink\" target=\"_blank\">星云大师</a>）</h2>\n<p>　　「随缘」不是没有原则、没有立场，更不是随便马虎，「缘」需要很多条件才能成立，能随顺因缘而不违背真理，才能叫做随缘。</p>\n<p>　　「随缘」不是随便行事、因循苟且，而是随顺当前环境因缘，从善如流；随缘不是随波逐流，而是珍惜当下。随缘是自他互易立场，随顺当前的环境，但决非随便行事，苟且偷安。生活中，如果能在真理的原则纲领下守持不变，在小细节处随缘行道，自然能随心<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>而不失正道。</p>\n<p>　　佛教里讲的“随缘”是非常积极的，因为很多不同力量综合起来才叫做一个“缘”。植物要长出一个果实来，需要很多条件——良好的土壤、水分、阳光、肥料，有人的呵护，最后才可能长出好的果实。这一切条件具备，才是缘分成熟。</p>\n<p>　　但是有些是我们掌控不了的，比如气候就是我们掌控不了的；有些是外在的力量，我们有没有这个时间去照顾也是一种外在的力量。</p>\n<p>　　如果付出了这么多的努力，老天爷不给你面子，不下雨会干旱，下雨过多会发生洪涝，最后没有收成了。也就是说，认真努力了，但外界条件不配合，这个缘分不具足，果实没有长出来，也没有办法。</p>\n<p>　　这个时候，就要坦然面对，因为这是改变不了的，不是没有努力，已经努力了，结果是这样。如果老天爷给面子，下了雨，阳光也充足，最后果实累累，得到丰收，那又是另外一回事。</p>\n<p>　　我们在付出努力的过程中，要有充分的心理准备，不论是哪种结果都要坦然接受它，这才是佛教讲的“随缘”。</p>\n<h2>随缘的意思（衍慈法师）</h2>\n<p>　　‘随缘不是随便’，它不是没有原则、没有立场，更不是随便去放弃！</p>\n<p>　　随缘两个字，是很多人的口头禅。尤其是遇到困难，无法做好某件事情，不想管或管不了之时，脱口而出说：“随缘吧！”其实，随缘并不容易做到，要有真智慧的人，才能办得到。</p>\n<p>　　所谓‘随’，不是随便或跟随，是有一定的原则，顺其自然，不怨恨，不躁进，不强求。何为‘缘’，万事皆有缘，不论是人缘、机缘、善缘、恶缘等，到处都有，无时不在，缘的存在是一个过程，有聚亦有散。</p>\n<p>　　‘随缘’有积极和不积极两方面。他可以说是随着我们的条件去做事，如努力去做一件善事，至于努力之后的成果如何，便不会计较得失，用这种随缘的态度来面对世事，这是积极的，既不强求，又把握机缘，不<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>，不刻板，不慌乱，不忘形，达观又洒脱。反过来说，如果我们只是随缘而不尽份，听天由命，不思进取，用逃避问题及困难作为理由，这是负面的态度，随缘成为懒惰或消极的借口。</p>\n<p>　　那么‘随便’又如何呢？他是得过且过，顺着当前的环境与因缘，随波而流，没有原则、没有立场，马马虎虎，不负责任。举个实例：有一个人，他对我说很<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>，因为与人共处时人缘不好，但他又自慰而言：“随缘吧，有缘即住，<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>即退”。虽然他不执着一定的环境，但却没有认识自己的为人处事方法，随随便便，任由因缘去发展。又有一个例子，被人偷了东西，损失严重，心苦恼万分，但不努力去寻找线索，把失物追回来，只管坐在那里，将就从事，等待结果，以为这是随缘，其实是随便放弃。</p>\n<p>　　‘随缘不是随便’，它不是没有原则、没有立场，更不是随便去放弃！若能随顺因缘而不违背真理，对现实有正确、清晰的了解，对<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>的聚散离合有一种<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>达观的体会，超然地去面对成败得失，这才是真正的随缘。拥有一份随缘之心，你就会发现，天空无论是阴云密布，还是阳光灿烂，生活的道路无论是坎坷还是畅达，心中总会拥有一份平静和恬淡。随缘是告诉世人万事莫强求这个真理，不是叫你随便行事、因循苟且，而是积极地去把握机会，随顺当前的环境因缘去做人处事。</p>\n<p>　　在这个世界上，不可能事事都一帆风顺，天气也不会日日晴朗，长久的晴朗会变成旱灾，不断的下雨亦会变成水灾，所以一段时间晴，一段时间雨，才是天作之合。明白这道理，事成了，只是淡淡的欣慰，不用过激的兴奋乃至产生成事后的我慢心；事不成，就坦然地去接受，不用有难堪和懊恼的追悔。总之，谋事之时，随顺因缘，尽力而行，甚至知其难行而积极去奋斗，直到无着力点为止。事情过后，检讨得失，不为成败而喜、忧。大家学会随缘吧。</p>\n</div>"
    }
]