[
    {
        "title": "【娑婆世界】是什么意思？娑婆世界是怎么形成的？",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x5A11;&#x5A46;&#x4E16;&#x754C;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x5A11;&#x5A46;&#x4E16;&#x754C;&#x662F;&#x600E;&#x4E48;&#x5F62;&#x6210;&#x7684;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0710/20180710054856906.jpg\" title=\"&#x3010;&#x5A11;&#x5A46;&#x4E16;&#x754C;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x5A11;&#x5A46;&#x4E16;&#x754C;&#x662F;&#x600E;&#x4E48;&#x5F62;&#x6210;&#x7684;&#xFF1F;\" /></p>\n<p style=\"text-align: center;\"><strong><a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>是什么意思？娑婆世界的形成、真面目</strong></p>\n<h2>娑婆世界是什么意思？</h2>\n<p>　　娑婆世界，即世人们所在的“<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>”。这个世界的教主是释迦牟尼佛。娑婆世界为释迦牟尼<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>化的的三千大世界。此界<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>安于十恶，堪于忍受诸苦恼而不肯出离，为三恶五趣杂会之所。</p>\n<p>　　“娑婆”是梵语的音译，也译作“索诃”、“娑河”等，意为“堪忍”，也就是说这个世界的众生忍苦的能力相当强，何以言之是苦呢？这个世界一切法都是染污法，不清净的，故非常<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>；纵是乐，都是苦的因，没有真正的快乐，所以叫堪忍。</p>\n<p>　　如穿新衣服是快乐，但被尘埃染污就生<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。又人最<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>的是发财，可是财发得再多，死时亦带不去。在生时，即使一分钱也算得清清楚楚，没有得到钱时，就想法子去得，没有得到，心里贪求是苦，已得到了，又怕失去，这都是苦，可是你不觉得苦。患得患失，怕得不到，死时一分钱也带不走，你说这是苦?或是乐呢?这两样东西，是世界上人人所欢喜的。一切乐，皆是苦的因，不过你尚未<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>到，故此世界叫‘堪忍’。</p>\n<h2>娑婆世界是怎么形成的？</h2>\n<p>　　从空间上看，宇宙是没有边际的。从时间上看，宇宙是前前无始、后后无终的。佛将“一个日月所照”，称为一个“小世界”，相当于现代话所指的一个行星系，我们所在为太阳系。一千个小世界组成一个“小千世界”，相当于现代话所指的一个恒星系，我们所在为银河系。一千个小千世界组成一个“中千世界”，一千个中千世界组成一个“大千世界”，人们常将“大千世界”称作“三千大千世界”。宇宙由无数个大千世界组成，所有的大千世界都在成、住、坏、空的过程当中迁流变幻、循环不息，没有片刻的静止。每个大千世界过去、现在、未来时时有佛出世，<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>着那里的众生。 我们所在的大千世界称做“娑婆世界”。</p>\n<h2>娑婆世界的真面目</h2>\n<p>　　娑婆世界，就是影子的世界。风景很美，这风景是真的还是假的？是不是过眼云烟？是不是光影中事？都是影子！什么叫娑婆世界知道吗？就是影子的世界。娑婆世界的苦是无尽的，具足三苦、八苦，无法计算的各种苦，没有一点快乐，所以名叫娑婆世界。</p>\n<p>　　我们这个世界，第一件苦事，就是最初在母亲肚里的时候，同了生出来的时候的苦。小儿在胞胎里头，他的母亲吃些冷的东西下去，小儿就像在冰山旁边一样的冷。吃些热的东西下去，小儿就像在火山旁边一样的热。母亲的肚子吃饱了，又像有一座山压下来一样的重。等到生的时候，像是有两座山把他夹住了，他在两座山当中硬钻出来，那个时候的痛苦，真是说不出，话不完的。所以小儿一生下地，总是哭的，就是这个缘故。不过等到大了会说话的时候，就记不得了，所以大家不晓得。这个叫做生苦。</p>\n<p>　　第二件苦事，就是我们这些人，都是父母生的，吃的是五谷，天气又忽然冷、忽然热，所以病痛是总不能够免的。各人有各样不相同的病，就有各样说不尽的痛苦。这是人人晓得的，不过病好了，就忘记了病时候的痛苦罢了。这个叫做病苦。</p>\n<p>　　第三件苦事，就是老了的苦。世界上的人，若是没有到老就死了，自然人人说他是短命人，总说是很不好的。不过人到了老，就有种种的苦了。譬如要看什么东西，眼光不清楚，看不见了。要听什么说话，耳朵也不清楚，听不到了。要吃什么东西，牙齿又脱落了，咬不动了。要跑到什么地方去，脚又走不动了。坐船坐轿，也还嫌辛苦了。种种的不能够自由<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>的苦处，也是说不尽的。这个叫做老苦。</p>\n<p>　　第四件苦事，就是一个“死”字。一个人到了死的时候，实在是极苦的。不过人已经死了，不能够说话，旁人不晓得他的苦罢了。你们看一个人到了临死的时候，大半舌头是很硬的，透气是很急的，手脚也是很不灵便的。要动又不能够动，在床上翻来覆去，浑身酸痛。要吃又吃不下去，要吐又吐不出来，四肢百脉，处处难过，要死又偏偏死不了。这种情形，是很多的。况且一切事情或者都还没有料理好，要交代后辈，偏偏神志不清楚了，不能够说话了。或是神志倒很清楚的，不过嘴里要说话，喉咙里头又偏偏哽住了，说不出来了，对了自己家里的人看了，心里头说不尽的难过。若是急病，或是飞来横祸死的，那更有种种不了的事情，说不尽了。这个叫做死苦。</p>\n<p>　　第五件苦事，是极要好极恩爱的<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>儿女，天天在一块儿，很有趣的。忽然为了求衣求食，要出门去了。或是碰着了刀兵灾劫，或是死了，只得硬着心肠各自分开。就是亲戚朋友天天聚会在一处，也是很有趣的。等到有了什么事情，或是我离开他，或是他分开我，也就不能够相聚了，这都是没有法子的。到了那个时候，一种难分难舍的苦处，真真觉得可怜得很哩！这个叫做爱别离苦。</p>\n<p>　　第六件苦事，就是一个人，总有不要好的人，或是同我反对的怨家，巴不得不要见面的，偏偏又常常要碰着。避又避不开，逃又逃不过，碰着了又<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>无故，生出种种的烦恼苦处来。或是想出法子来破你的钱财，或是害你的性命，也是有的。这个叫做怨憎会苦。</p>\n<p>　　第七件苦事，就是要东不得东，要西不得西。譬如想要一件东西，或是盼望成就一件事情，或是要到一处地方去，或是要看见一个要好的人，偏偏都做不到。我心里头要的，偏偏要不到，种种不能够称心的事情，无论什么人，都是很多的。这个叫做求不得苦。</p>\n<p>　　这七种苦，都叫做果苦。还有一种苦，是因为<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>炽盛得着的苦，叫做因苦。七种果苦，一种因苦，合起来就叫做八苦。</p>\n<p>　　什么叫做“五阴炽盛”呢？那“阴”字，是“遮盖”的意思。有五种事情（五种事情，就是色、受、想、行、识五种。凡是有形像可以指得出来的，都叫做“色”。“受”是受着的种种苦的、乐的境界。“想”是心里头转着的种种好的、坏的念头。“行”是心里头持的念头，一个去了一个又来，接连着没有停歇的意思。“识”是分别那种种境界的<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>），遮盖了人的本性，可以使得人的心里头迷迷惑惑，造出各种的业来。所以那五种事情，就叫他“五阴”。因为有了这种五阴，那贪、瞋、痴的心，就着牢在这个五阴上头，像火碰着了干柴一样，就会烈烈烘烘的烧起来，所以叫做“五阴炽盛”。这“炽盛”两个字，本来是“火势旺得厉害”的解释。现在借这“炽盛”两个字来，譬喻这五阴的。并且譬喻这五阴的迷惑人，容易得很，像干柴容易着火一样。</p>\n<p>　　有了这五阴炽盛的一种苦，就会生出上边所说的七种苦来。因为五阴炽盛，譬如是苦的种子，是受种种苦的原因，所以叫做苦因。那上边所说的七种苦，譬如结的果子，是受种种苦的结果，所以叫做苦果。因为有了五阴炽盛的因苦，就自然有果苦生出来了。不过人正当那五阴炽盛的时候，糊糊涂涂，不觉得苦罢了。虽然人不觉得苦，但是既然有了这种五阴炽盛的因苦，将来就一定会受着那七种果苦，这是<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>一定的道理。并且将来受七种苦报的时候，却仍旧还有这五阴炽盛的一种苦因牵连着的，所以就成功了一世一世永远脱不了的苦哩！</p>\n<p>　　总之，这个世界上，苦的事情多得很。这八种的苦，无论富贵人、贫贱人，人人都有的，没有一个人没有的。还有别种的苦，各人各有不同的。富贵人有富贵人的苦，贫贱人有贫贱人的苦，哪里说得尽？</p>\n</div>"
    }
]