[
    {
        "title": "天竺",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"266\" src=\"https://www.liaotuo.com/uploadfile/2016/0112/20160112043616569.jpg\" style=\"width: 344px; height: 267px\" width=\"353\" /></p>\n<h2><a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>（古印度）</h2>\n<p>　　天竺是古代中国以及其它东亚国家对当今印度和巴基斯坦等南亚国家的统称。在中国历史上，对印度的最早记载在《<a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a>·大宛传》，当时称为身毒（印度河梵文Sindhu对音）。《<a href=\"/ctwh/shi/24s/hanshu.html\" class=\"keylink\" target=\"_blank\">汉书</a>》记载：“从东南身毒国，可数千里，得蜀贾人市。”。 《<a href=\"/ctwh/shi/24s/houhanshu.html\" class=\"keylink\" target=\"_blank\">后汉书</a>·西域传》记载“天竺国一名身毒”。唐初统称为天竺。天竺历史上相继出现了四大帝国：孔雀帝国、笈多帝国、德里苏丹国和莫卧儿帝国。</p>\n<h2>名字来历</h2>\n<p>　　唐高僧玄奘往西域取经，首创根据 Indu 读音正名为“印度”，“夫天竺之称，异议纠纷，旧称身笃，身毒，贤豆，天竺等。今从正音，宜云印度”。</p>\n<p>　　（地名）梵Sindhu=波斯Hindhu=希腊India（国名），Indus（河名），新称印度，印特伽，译曰月。Sindhu -&gt;Hindu-&gt;身毒、天竺。Hindu-&gt;Indu-&gt;印度。总而言之，身毒、天竺、印度都来自Sindhu。</p>\n<h2>历史沿革</h2>\n<h3>　　孔雀王朝</h3>\n<p>　　亚历山大撤出印度之后不久，被称为月护王的旃陀罗笈多推翻了摩揭陀的难陀王室。旃陀罗笈多建立起印度历史上的第一个帝国式政权孔雀王朝。他赶走了希腊人在旁遮普的残余力量，逐渐征服北印度的大部分地区。月护王在位后期击退了亚洲最强有力的希腊统治者塞琉古一世的入侵，并获得对阿富汗的统治权。孔雀王朝终于在阿育王时期到达颠峰，这位伟大的君主完成了对南方羯陵伽的征服，这样除了极南端的一些国家以外整个印度都在形式上统一于帝国政权之下了。阿育王大力支持<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>，广泛进行传教活动。但是，孔雀王朝的强盛在阿育王去世之后即告终止。摩揭陀的力量退缩回它本来居有的地区，印度恢复列国时代的那种分裂状态。</p>\n<p>　　从前2世纪初开始，大夏希腊人、塞人和安息人先后侵入印度；塞人的侵略尤其广泛，他们在整个西印度建立了许多公国。大月氏人成为最成功的侵入者，他们在北印度建立了强大的贵霜帝国，这个国家被列举为古典世界的四大帝国（罗马帝国、安息、贵霜帝国和汉朝）之一。贵霜时代的宝贵产物是<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>和犍陀罗艺术。</p>\n<h3>　　笈多王朝</h3>\n<p>　　贵霜帝国在强盛了若干世纪之后分裂为一些小的政治力量。取代他们在北印度的优势地位的是旃陀罗笈多一世建立的笈多王朝。笈多王朝是孔雀王朝之后印度的第一个强大王朝，也是由印度人建立的最后一个帝国政权，常常被认为是印度古典文化的黄金时期。与孔雀王朝一样，笈多王朝的发源地是在摩揭陀；这个王朝的头几位君主都是征服者，他们确实统一了北印度，但在南方则并没有扩张得太远。旃陀罗笈多二世取得了一次对塞人的辉煌胜利，常常被认为是印度传说中的伟大英雄超日王。中国僧人法显在旃陀罗笈多二世在位时访问了印度，他描写这位国王的贤明统治使印度人民安居乐业。笈多王朝的文化非常繁荣。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>教再度兴起，不过此时它已经开始向现代印度教转变；佛教和耆那教继续拥有广泛<a href=\"/remen/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>。笈多君主的<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>政策总体上来说是容许所有教派传播。在文学上，出现了古代印度最伟大的诗人迦梨陀娑。</p>\n<h3>　　后笈多王朝</h3>\n<p>　　从中亚侵入印度的嚈哒人（白匈奴）严重地损害了笈多王朝。嚈哒人后来被印度社会所同化，但他们在5～6世纪的活动促成了帝国的解体。许多地方王公和民族反对笈多王朝的中央权力，于是这个帝国迅速瓦解了。所谓后笈多王朝（实际上与真正的笈多王室没有关系）的统治权力再次退回摩揭陀。6－7世纪之间，波斯萨珊王朝还统治过印度河平原。7世纪的印度是分裂和混乱的，除了卡瑙季（曲女城）的统治者戒日王在北印度建立过短暂的霸权之外，没有一个王公拥有广大的权力。不过，在南印度则兴起了几个强盛的政权，如遮娄其人（其统治者打败了戒日王的进攻）、罗湿陀罗拘陀王朝和帕拉瓦人。</p>\n<h3>　　拉其普特时期</h3>\n<p>　　大约在7世纪北印度兴起了一种新的力量，即拉其普特人。他们在7～8世纪之后的印度历史中起了突出作用。从7世纪中叶直到12世纪末穆斯林征服北印度之间的历史时期常常被称为拉其普特时期。在这段时间里，几乎所有的北印度政权都是拉其普特人建立的；南方的遮娄其人也是拉其普特人的一支。拉其普特人并不是一个统一的民族，他们中特别重要的有瞿折罗-布罗蒂诃罗人、兆汉人和遮娄其人。各拉其普特王国之间混战不已，同时又激烈抵抗伊斯兰教力量对印度的侵略，以致拉其普特人常被认为是印度教的保卫者。期间在750－1174年间的波罗王朝统一过北印度。</p>\n<p>　　阿拉伯人在8世纪初征服了印度西北部的信德，揭开了穆斯林入侵印度的序幕。</p>\n<p>　　9～11世纪在南印度出现了几个强大的王国，如朱罗国（注辇）和潘地亚。其中朱罗国曾经侵入印度尼西亚诸岛屿。</p>\n<h3>　　德里苏丹国</h3>\n<p>　　伊斯兰对印度的真正征服开始于11世纪，是由中亚的突厥人进行的。伽色尼王朝的苏丹马茂德入侵印度12次以上，在北印度造成严重破坏。伽色尼王朝在中亚的领土于1173年被其位于阿富汗的原附庸廓尔王朝吞并。廓尔王朝的统治者穆伊兹-乌德-丁·穆罕默德（廓尔的穆罕默德）在1192年的第二次德赖战役中决定性地击败了兆汉人；他留在印度的总督（出身奴隶）顾特卜-乌德-丁·艾伯克于1206年采用苏丹头衔统治被穆斯林征服的北印度地区，定都德里。此后直到莫卧儿帝国建立，北印度的历史即为德里苏丹国的历史。</p>\n<p>　　德里苏丹国是由来自阿富汗的突厥人建立的穆斯林政权。先后有5个王朝在德里进行过统治：奴隶王朝、卡尔吉王朝、图格鲁克王朝、赛义德王朝和罗第王朝。不过，德里苏丹国并非统一了整个印度的帝国。除了在阿拉-乌德-丁·卡尔吉等极强大的苏丹统治时期，德里苏丹国充其量只是北印度的一个最大的王国。北印度的拉其普特人继续保有强大的力量，而南印度则几乎从未进入苏丹政权的版图。阿拉-乌德-丁·卡尔吉时期对德干地区的3次大举入侵使德干北部服从苏丹统治直到14世纪；菲罗兹·图格鲁克苏丹臣服了印度教王公统治的奥里萨。困扰苏丹的问题主要是叛乱和外部入侵。在整个德里苏丹国存在时期，叛乱和王室内讧层出不穷。各地的分立势头从未被有效遏止，几个著名的苏丹都曾镇压过大规模的叛乱。外部入侵的威胁开始主要是来自蒙古人，后来则是中亚的征服者帖木儿。帖木儿的可怕入侵终于使摇摇欲坠的苏丹政权彻底崩溃。德里苏丹国在帖木儿撤离之后不久解体，独立王国林立各地，虽然还有名义上的苏丹，但他们的权力几乎只限于德里和旁遮普。德里苏丹国时期，印度的穆斯林文化有了很大发展。许多苏丹执行相对宽松的宗教政策，除了征收人头税之外并不对非穆斯林居民进行迫害。伊斯兰式的宏伟建筑在印度耸立起来，这一时期所形成的建筑风格有时被称为德里风格。在文学上，产生了阿密尔·胡斯鲁这样的伟大诗人。突厥人也带来了一种有害制度：在宫廷和贵胄之家中流行的奴隶制。特别值得提出的是乌尔都语在苏丹时代产生，以及罗第王朝末期出现了锡克教。</p>\n<h3>　　莫卧儿帝国</h3>\n<p>　　德里苏丹国瓦解造成的权力真空并没有持续很长时间，新的穆斯林征服者很快在西北方出现。1526年，帖木儿的直系后代巴卑尔从中亚进入印度，在第一次帕尼帕特战役中击溃了罗第王朝的最后一个苏丹易卜拉欣·罗第。巴卑尔占领了德里并被尊为“印度斯坦的皇帝”。他继而在1527年击败拉其普特人，1529年又消灭了阿富汗人的残存力量。由巴卑尔建立的政权被称为莫卧儿帝国，意为“蒙古人的帝国”，因为巴卑尔的血统由母系可以上溯到成吉思汗。巴卑尔的统治只是莫卧儿帝国的肇始，他还未来得及巩固莫卧儿人在北印的地位便已去世。行政、司法和财政制度都没有建立；这些关键事物实际上是由莫卧儿人的敌人舍尔沙缔造的。舍尔沙是南比哈尔地区的阿富汗人首领，他在1540年打败并赶走了巴卑尔的继承人胡马雍，短暂地恢复了阿富汗人在印度的统治。舍尔沙的统治时期很短，但是却十分重要。他压服了孟加拉的叛乱，并把它分成19个小行政单位；征服瓜廖尔；打败了最强的拉其普特人领袖马尔德夫。在短短5年之内，几乎整个印度北部都被他征服了。在舍尔沙于1545年阵亡之前，他已经在北印建立了自上而下的行政制度，举行土地清丈以确定税制，并进行了货币改革。舍尔沙的统治事实上为莫卧儿帝国的最终建成铺平了道路。在舍尔沙死后，胡马雍得到波斯国王太美斯普一世的支持返回印度，不久夺回德里；但他在与主要敌人阿迪尔沙阿交锋之前突然死去，完成莫卧儿人伟业的任务归于其子阿克巴。阿克巴最强大的敌人是阿迪尔沙阿的印度教将军喜穆。喜穆利用胡马雍之死夺取阿格拉和德里，并自称为“超日王”，可能在印度复兴起一个印度教的王朝。阿克巴在1556年关键的第二次帕尼帕特战役中打败了喜穆，于是在印度再也没有可以与莫卧儿人抗衡的力量了。</p>\n<p>　　阿克巴是莫卧儿帝国的真正建立人和最伟大的皇帝。他在漫长的统治期间征服了印度北部全境，并把帝国的版图第一次扩展到印度南方。由于对拉其普特人采取怀柔政策，大多数好战的拉其普特部族都归顺了帝国的统治。对异教的<a href=\"/remen/kuanrong.html\" class=\"keylink\" target=\"_blank\">宽容</a>是阿克巴的显著特点，他不仅免除了非穆斯林的人头税，还企图倡导一种融合印度教与伊斯兰教的宗教改革。以苏巴（省）为单位的全国行政制度形成了，印度教徒也被允许担任政府官员。阿克巴时代的印度是伊斯兰世界最强大的帝国之一。</p>\n<p>　　阿克巴去世后，莫卧儿帝国先后由贾汉吉尔和沙阿·贾汉统治。这是两个才能较为逊色的统治者，沙阿·贾汉终于被自己的儿子奥朗则布推翻失去了皇位。</p>\n<p>　　奥朗则布是莫卧儿王朝最重要但也最具争议的皇帝。他放弃了莫卧儿帝国初期尤其是阿克巴时代的宗教宽容政策，加强伊斯兰教的宗教地位，企图使印度完全伊斯兰化。奥朗则布恢复对非穆斯林征收人头税，将印度教徒逐出政府，并大举拆毁印度教庙宇与神像。这些短视的政策导致帝国境内的非穆斯林与政府的矛盾突然尖锐起来，并很快演变成武装斗争。坚持自己<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的锡克教徒和拉其普特人成为莫卧儿帝国公开的敌人；奥朗则布虽然多次打败他们，却无法彻底消灭其反抗力量。最危险的国内敌人是新兴的马拉塔人国家，它后来发展出可与莫卧儿帝国匹敌的军事能力。另一方面，由于奥朗则布力图消灭他的政治对手，莫卧儿帝国帝国的疆域在他在位时扩张到最大限度。他长期驻留在德干指挥对该地区各穆斯林小国的征服，这些国家是16世纪初德干的伊斯兰教强国巴赫曼尼王朝分裂后形成的。其结果是奥朗则布取得了胜利，将德干地区并入帝国版图，成为印度南方的最高统治者。除了次大陆极南端和马拉塔王国以外，奥朗则布统一了整个印度。</p>\n<p>　　奥朗则布去世后的莫卧儿帝国称为“后期莫卧儿”。这一时期的特点是，皇帝大都昏庸无能，马拉塔人愈战愈强，大有取莫卧儿而代之的趋势。但是，决定印度<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>的因素是欧洲列强。</p>\n</div>"
    }
]