[
    {
        "title": "【无常】是什么意思？佛教的无常观是怎样的？",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x65E0;&#x5E38;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x7684;&#x65E0;&#x5E38;&#x89C2;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0712/20180712040846405.jpg\" title=\"&#x3010;&#x65E0;&#x5E38;&#x3011;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x4F5B;&#x6559;&#x7684;&#x65E0;&#x5E38;&#x89C2;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;\" /></p>\n<p style=\"text-align: center;\"><strong><a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>是什么意思？无常的意思</strong></p>\n<p>　　无常，梵语（anitya）的意译，<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>真理之一，是指<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>万物不是常恒不变、永恒存在、永远不变的，一切都在变化。谓器世间山河大地及一切有为之法，迁流无暂停，终将变异，皆悉无常。即世界上山河大地、万事万物，包括人的内心活动、人与人之间的关系，无不是以变化的形式而存在。</p>\n<p>　　部派佛教时期，对于无常产生了另一类的解说，强调必须透过<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>生灭中知无常，对此称之为“刹那无常”；或从其相续不断，称之为“相续无常”。而根本佛教则是认为，<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生的当下，即开始变异与改变，非刹那生灭与相续无常，而一切事物皆走向生、住、异、灭的道路，与部派之认知有显著的不同。</p>\n<p>　　“人无千日好，花无百日红”，这就是无常的写照。“月有阴晴圆缺，人有旦夕祸福”，这也是无常的意义。无常，就是迁流、变易的意思。世界上的人物你我、有情无情等，那有不迁流变化的东西呢？无常，不限于某一人、某一事，它有普遍性的意义；无常，不受权利大小的影响，它有平等性的意义。世间万事万物，都有无常的现象。</p>\n<p>　　无常是宇宙中最自然不过的现象，因此古来多少文人雅士莫不为文作赋感悟无常。例如诵读《瑜珈焰口》中的‘将军战马今何在，野草闲花满地愁’，不禁令<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>起了无常之感；朗诵荆轲的‘风萧萧兮易水寒，壮士一去兮不复还’，不禁令人生起悲壮牺牲的雄心。</p>\n<p>　　其实无常很好，因为无常，才有希望；因为无常，才有未来，所谓‘无常苦空，无常乐有’，假如世间一切都是定型的，没有变化，没有生灭，老的永远都是老的，小的永远都是小的，不知道你感受如何？所以无常变化就很可贵。无常，让人会珍惜<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>；无常，让人会珍惜拥有；无常，让人会珍惜因缘；无常，让人会珍惜关系。</p>\n<h2>什么是无常？（<a href=\"/fjrw/hcrw/cxfs1/\" class=\"keylink\" target=\"_blank\">传喜法师</a>）</h2>\n<p>　　前一秒钟找我，我已经没有了，这就是无常。世间一切之法，生灭迁流，刹那不住，祸福得失，空花一场。包罗万象，无非地水火风。沧海桑田，刹那<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>存亡。欲生便是苦生时，能离我我所，则欲灭苦灭。</p>\n<p>　　无常并不可怕，它使相续生灭，却也带来生机。若一切永恒<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>，则世间一片死寂，惟因一切法缘聚则生，缘散则灭，由着这因缘和合，才有春夏秋冬，四时<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>，才有月圆月缺，物换星移，才有聚散穷通，悲欢离合，才构成这一个生机无限，多彩多姿的有情世间。</p>\n<p>　　无常如盐，咸也好，淡也好，与其担忧未来，不如珍惜现在。看破无常，竹密不妨流水过。<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a><a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>，青山无碍白云飞。我们的每一步都决定着最终结局，执迷或者<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。我们的脚正在走向自己选定的终点，堕落或者<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。无常面前，我们别无选择。</p>\n<h2>无常的意思（学诚法师）</h2>\n<p>　　无常指事物永远在不断的变化，没有固定不变的。从因到果，本身就是一种变化，无常的体现。无常不是一个负面的概念，就是指一切事物现象的一个过程而已，只是我们把它误解了，一听到无常就觉得很害怕、很不好，这恰恰是人内心执著的一种体现。正是因为无常，所以我们才能够通过<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>而改变，从凡夫到智者，乃至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。</p>\n<p>　　每天傍晚，寺院里的僧人在念诵经文时会读到一句话：“是日已过，命亦随减，如少水鱼，斯有何乐？当勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>，如救头燃，但念无常，慎勿放逸。”这句话是提醒<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人：一天又过去了，自己如同处在浅水中的鱼儿一样，容易被飞鸟和渔民所捉；面对生死的无常，应当精进努力修行，不可懒惰荒废时光。</p>\n<p>　　<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>曾问<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>一个问题：人的生命中，自己能够把握的时间究竟有多长？有的弟子说50年，有的说30年，有的说10年、1年，甚至有人说短短几分钟，佛陀认为都不对。直到有弟子答道“呼吸间”，佛陀才给予肯定：“出息不还则属后世，人命在呼吸之间耳！”</p>\n<p>　　两千五百多年前的佛陀，曾多次让弟子们思考死亡。有人觉得这是佛陀让大家提前做好心理准备，当死亡来临时好坦然面对。其实不完全如此。思考死亡不仅让我们珍惜活着的时光，更重要的是通过直面死亡，体会到无常。</p>\n<p>　　佛教里强调的“无常”是指变化，世界上山河大地、万事万物，包括人的内心活动、人与人之间的关系，无不是以变化的形式而存在。对于我们而言，生死是最明显的一种无常。通过思考死亡体会无常，其目的是破“常”——破除我们心中的“常执”。常执是什么呢？就是常常执著——我们对某些人、某些事或某些境界特别喜欢或厌恶，就容易产生执著。佛教里讲，<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>的根源就是我们的执著，因为一切都是变化无常的，外在的东西并不随着我们的意愿而保持不变，当变化出现，不遂我们的意，就产生了痛苦。比如开车外出，情绪容易随着路况的变化而起伏，不堵车时觉得高兴，堵车时就容易起<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。如果我们认为车多车少的变化正是“无常”的表现，是正常情况，堵车就不会扰乱心情。</p>\n<p>　　遗憾的是，现代社会中忙忙碌碌的我们，很少有时间，也不太愿意思考“人生的终点”问题。美国医生努兰在他《外科医生手记：死亡的脸》一书中提到：“我们想寻找一些方法来拒绝承认死亡的力量，以及逃避它对人们思想的控制。”如果我们愿意思考生死，渐渐就会感受到生命的脆弱，体会到死亡来临的不确定性。当正视死亡这一重大的无常时，我们内心的常执慢慢会消融，从而坦然面对外在境界，不会有那么多的在意和比较。顺境也好，<a href=\"/remen/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>也好，都是我们要去改善和超越的。这样我们就能放下包袱，内心会有越来越清晰的目标和强大的动力，去面对越来越多的问题，承担越来越多的责任。</p>\n<h2>什么是无常？（<a href=\"/fjrw/hcrw/jqfs1/\" class=\"keylink\" target=\"_blank\">济群法师</a>）</h2>\n<p>　　我们的身体、<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>和事业，哪一样是永恒不变的？我们每天都可以观察到无常，但无常并未使我们警醒。相反，无常往往使我们更加执著。似乎执著就能抵挡无常到来，并使我们执著的对象变得坚不可摧。</p>\n<p>　　无常是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的重要概念，以此破除我们对生命和世界的常见。不少人对无常的认识偏于消极，觉得无常就意味着一切都在走向毁灭。事实上，无常只是说明事物不是常恒不变的，并不等同于败坏、消亡。无常本身也离不开缘起。因为无常，所以一切都是可以改变的，坏的可以变好，好的也可以变坏。而它朝什么方向改变，取决于我们创造什么样的条件。</p>\n<p>　　无常，是世间的真相，是人生的实质。所以，认识无常非但不是逃避现实，恰恰是要我们认清人生最大的现实，整体的现实。世人总是将无常当做人生障碍，当做破坏幸福的无形杀手，那是自身错误观念造成的。若能透彻无常本质，就不会因无常变化带来痛苦了。</p>\n<p>　　认识无常，可以使我们的贪心、<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>逐步减少，所谓“观无常，足以得道”。或许有人会觉得，无常，谁不知道呢？为什么我们知道这个道理后没有一点用处呢？这是因为，我们对无常的体验存在不同层次的差别。我们仅仅是知道“无常”这两个字，还是在不断观察、思考“无常”的显现？或是已经深刻认识到“无常”的无所不在？倘能透彻“无常”，我们还有必要抓着这些烟花一样短暂的名利不放吗？我们还愿意付出一生去交换吗？</p>\n<h2>无常的意思（<a href=\"/fjrw/hcrw/xyds/\" class=\"keylink\" target=\"_blank\">星云大师</a>）</h2>\n<p>　　“人无千日好，花无百日红”，这就是无常的写照。“月有阴晴圆缺，人有旦夕祸福”，这也是无常的意义。无常，就是迁流、变易的意思。世界上的人物你我、有情无情等，那有不迁流变化的东西呢？</p>\n<p>　　无常，不限于某一人、某一事，它有普遍性的意义；无常，不受权利大小的影响，它有平等性的意义。世间万事万物，都有无常的现象，所以说“无常”就是真理。</p>\n<p>　　世界上很多美好的东西，因为有“无常”，所以它是缺陷的。青春美貌，它不能永远常在；名位权利也不能永远拥有。再如金钱<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，随来随去，甚至我人的身体，依科学家的研究，从细胞的组织来看，今日之我已不是昨日之我，明日之我当然也不会是今日之我。不断的迁流，不断的变易，所以都是无常的啊！</p>\n<p>　　无常不是完全消极的，本来没有的，因为“无常”，也可以改变一切现象。我贫穷，因缘际会，我发财了；我愚笨，我勤劳苦读，一变而成聪明了。本来无儿无女，忽然妻子弄璋弄瓦，儿女成群；本来空旷的土地，集合建材而成高楼大厦，所谓“空中生妙有”，这不都是无常的现象吗？</p>\n<p>　　无常不可怕，无常也躲避不了！遗憾的是，人一听到“无常”，就如同“谈虎色变”，难道你惧怕无常，就能不受无常的真理的原则而迁流不息吗？</p>\n<p>　　从小看到花开花谢，你在无常里没有得到警觉吗？从小就看到人生人死，你在生死里面还没有所体悟吗？</p>\n<p>　　所以，吾人要当体悟“无常”，在“无常”里找寻自己的“未来”：未做完的事情要赶快做好，免得无常到来，未萌其志，未尽其愿；如果你有要做的事，就赶快积极去完成，因为你不积极完成，不知随时无常一到，所谓终生遗憾啊！</p>\n<p>　　无常，真是玄妙啊！所谓“坏的不去，好的不来。”无常的损坏是痛苦的、是凄惨的；但无常的新生，也是喜悦的、庆贺的。我们可以把坏的变成好的；我们也可以把无常超越世间之外，那就是一个永恒的真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界了。</p>\n<h2>什么是无常？（<a href=\"/fjrw/hcrw/syfs/\" class=\"keylink\" target=\"_blank\">圣严法师</a>）</h2>\n<p>　　无常是佛教的基本教诲，可用来调整、调适自己的心。需要了解三个方面的无常：环境的无常，身体的无常，心的无常。没有相当修行的话，难以直接体验到心的短暂、无常的本质。开始时藉著了解环境中的无常会容易得多，然后逐步能了解环境、身体和心的无常的本质。环境一直在改变，而你的身体随之改变。环境变动，你的身体随之变动。由于外在环境中没有固定、不变的现实，身为环境一部分的你的身体也不是固定、不变的。当身体随著环境变动时，会让你感受到环境也在变动。</p>\n<p>　　身体一直在改变，因此当你体验到身体上的不适或舒适时，那个感觉没有固定的本质，过一阵子就会消失。肉体也会感觉到饥饿、干渴和其它的感受，这一切也都是短暂的，也会随著身体而改变。这一切改变都会在你的身体上造成感受，因而影响到你的心。了解这一切，让你透过觉知自己对外在环境、内在自身的变化之感受，而在修行上有个契入点。</p>\n<p>　　我们很执著于自己的肉体，珍惜它，不轻易放弃。然而，深切觉知身体变化的本质，到头来终免不了毁坏，会帮助我们比较不执著于身体。我们能使自己摆脱身体的限制，能更摆脱身体的作用、动作和感受。</p>\n<p>　　没有一个修行的方法，很难体验到心的无常。如果我们的念头是长久不变的话，就不会受到迁流不息的心所困扰。当我们与自己不和时，就觉得不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，焦躁不安。在那种情况下，我们需要一个方法来安心，来觉知来来去去的念头不在我们的掌控中，念头起伏不定，接续不断。</p>\n<p>　　使心平静的一个方法，就是去观念头的短暂本质。知道自己的念头是自生自灭的，就不需要受到它们管控或制约。你的心会定下来，以超然的觉知来观察念头，情绪也会变得平稳。如果做得到的话，很快就能使心平伏。首先，学著放松身体，从头部开始，一路往下到身体其它部位。一旦安定下来，只要知道身体坐在那里，而且维持那种单纯。同时，要觉知无常：环境的无常，身体的无常，最重要的是，心的微妙的无常。</p>\n</div>"
    }
]