[
    {
        "title": "【孝心】什么是孝心？怎样做一个有孝心的人？",
        "date": "2016-01-13",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5B5D;&#x5FC3;&#x3011;&#x4EC0;&#x4E48;&#x662F;&#x5B5D;&#x5FC3;&#xFF1F;&#x600E;&#x6837;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x5B5D;&#x5FC3;&#x7684;&#x4EBA;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2016/0113/20160113045121705.jpg\" title=\"&#x3010;&#x5B5D;&#x5FC3;&#x3011;&#x4EC0;&#x4E48;&#x662F;&#x5B5D;&#x5FC3;&#xFF1F;&#x600E;&#x6837;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x5B5D;&#x5FC3;&#x7684;&#x4EBA;&#xFF1F;\" /></p>\n<h2><a href=\"/remen/xiaoxin.html\" class=\"keylink\" target=\"_blank\">孝心</a></h2>\n<p>　　孝心是对双亲长辈孝敬的心意，是中国<a href=\"/remen/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>文化的核心，是祖先崇拜的文化内涵。古人云，百善孝为先。一个人如果连生养自己的父母都不孝敬，那么他的为人就可想而知了。</p>\n<h2>怎样做一个有孝心的人？</h2>\n<p>　　<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>是我们为人的基本，孝顺之人得到众人称赞，反之，忤逆之人众人指责；天地鬼神敬重孝顺父母之人，而惩罚不孝之辈！<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>孝顺之中，也有真孝与假孝之分。何为真孝？发自内心的尊重报答，并从行动上落实者称之为真孝；而假孝虽然从外表上看则和真孝无异，但其内心若是只为了别人的评议，实际上并不想这样去做，但为了不遭到众人的指责而伪做孝顺，此则称之为假孝。那么，我们怎样做才是有孝心的呢？</p>\n<h3>　　一、<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>父母，不令缺乏：</h3>\n<p>　　在<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>上，物质所需、精神的关怀，要让父母满足，不虞欠缺。</p>\n<h3>　　二、凡有所为，必先禀白：</h3>\n<p>　　儿女无论要做什么事，要创哪里一种事业，都要让父母知道，不要让父母感觉到你隐瞒他，让他感受到儿女对他有十足的信任。</p>\n<h3>　　三、父母所为，恭顺不逆：</h3>\n<p>　　父母想要做好事，想要有所作为，身为<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>的就要顺从父母的意思，不要忤逆。我们一生受之于父母，怎忍心违逆他呢？所以中国固有的孝道思想中，做到孝比较容易，顺的标准比较难，顺父母的心意更难。</p>\n<h3>　　四、父母正令，不敢违背：</h3>\n<p>　　我们不要违背父母正当的命令，他要做善事、做好事，不要违背他。</p>\n<h3>　　五、父母正业，不为中断：</h3>\n<p>　　假如父母创造了什么好的事业，如：养老院、孤儿院或者办学校，办一些对社会福利的事业机构，为人子女者不能让它中断，要把父母的正业一直继承下去，这才是孝顺。</p>\n<h2>孝心的实际行动</h2>\n<p>　　1、学会节日的问候，懂得在节日时要向长辈送上一份祝福。</p>\n<p>　　2、初步学会帮助父母排忧解难，如当父母吵架时怎么办？妈妈和奶奶吵架时怎么办？</p>\n<p>　　3、初步学会和父母沟通，懂得要虚心接受长辈的批评。</p>\n<p>　　4、初步学会保护自己，让父母放心。</p>\n<p>　　5、掌握基本家务技能——洗碗等。</p>\n<h2>孝心的文化教育</h2>\n<p>　　确定了“孝敬日”，把每周日、学生父母的生日、三八妇女节、母亲节、重阳节和国际老人节作为全校学生的孝敬日，要求每位学生用劳动向父母、长辈献一份孝心，表一份爱意。学校还通过开展知心<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>学校、制作“家庭生日卡”、“给父母过生日”和亲子乐园等活动，沟通家长和子女的亲情，使孩子和家长变得更加亲密无间。在知心家庭学校之中，我们引导家长和孩子开展同写知心家信、同读好书好报、同诵中华美文、同做环保益事、同做孝敬标兵、同练强健体魄活动。制作“家庭生日卡”活动，通过问、写、记、做、想、搞、评七步曲展开。“问一问”就是每人了解自己爷爷、奶奶、外公、外婆、爸爸、妈妈的生日、岁数、属相；“写一写”就是把了解到的情况写在纸上；“记一记”就是把生日时间记在心里；“做一做”就是人人动手制作“家庭生日卡”，上面写上全家人的情况，周围画上精美的图案；“想一想”就是动脑筋，想一想怎样给长辈过个好生日的金点子；“搞一搞”，就是通过搞生日祝福活动把金点子变成现实；“评一评”就是家长和老师根据学生活动的情况和反映一起评评“十佳小孝星”。</p>\n<p>　　1、挖掘典型，树立榜样。</p>\n<p>　　2、正面引导 让孩子理解父母谋生的艰辛。</p>\n<p>　　3、肯定好行为 让孩子从小事做起。</p>\n<p>　　4、父母为孩子做个好榜样。</p>\n<p>　　5、坦然接受孩子表达孝心的行为。</p>\n<p>　　6、 要建立合理的长幼有序的家庭关系。所谓“合理”，是指全体家庭成员（包括子女）之间首先是民主平等的，父母要尊重孩子的独立人格，尤其是在处理孩子自己的事情时，一定要充分吸取他们的意见。同时，孩子应当在父母的指导帮助下生活、学习。如今，不少的家庭中，孩子是“小太阳”，家长却变成围着孩子转的月亮、侍从，这就为孩子形成以自我为中心的小霸王性格提供了土壤，更谈不上形成孝敬父母的好习惯了。因此，我们要让孩子明白自己与父母的关系，知道父母是长者、家庭生活的主事人，而不能颠倒主次，任孩子在家庭里逞强胡闹。</p>\n<p>　　7、 要从小事入手训练培养孩子孝敬父母的行为习惯。教育子女孝敬父母的一般要求是：听从父母教导，关心父母<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，分担父母忧虑，参与家务劳动。要把这些要求变为孩子的实际行动，就应当从日常小事抓起。如要求孩子每天要问候下班回家的父母；当父母外出时，孩子应提醒父母注意天气变化等；孩子应承担必须完成的家务劳动。让孩子不断增强孝敬父母的观念，让他知道父母养育了他，他应为父母多做事。</p>\n<h2>探索孝道</h2>\n<p>　　中国自古有教导人们要行孝道的美德，故出现了三不孝的教育格言，从而奠定了行孝道的基本规则。</p>\n<p>　　一不孝：阿意曲从，陷亲不义。一味顺从，见父母有过错而不劝说，使他们陷入不义之中，这是第一种不孝。这是教导我们要深明大义，博学广闻，才能指导父母向善为本的孝道。</p>\n<p>　　二不孝：家贫亲老，不为禄仕。家境贫穷，父母年老，自己却不去办事挣钱得到俸禄来供养父母，这是第二种不孝。这是教导我们要自立自强，勤于业务，不要依赖他人，才能有能力养活父母和自己的孝道。</p>\n<p>　　三不孝：不娶无子，绝先祖祀。不娶妻生男育女，断绝后代，这是第三种不孝。这是教导我们要有责任之心，结好良缘，娶得贤妻共同<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母的孝道。</p>\n<p>　　三不孝教育理念妙不可言，为中国历代家庭的和谐与社会稳定做出了贡献，故古今人们都非常推崇“三不孝”教育理念为孝道的法则。</p>\n</div>"
    }
]