[
    {
        "title": "【意识】意识是什么意思？人的意识是怎么产生的？",
        "date": "2016-02-19",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x610F;&#x8BC6;&#x3011;&#x610F;&#x8BC6;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#xFF1F;&#x4F5B;&#x6559;&#x7684;&#x610F;&#x8BC6;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2017/0110/20170110033527793.jpg\" title=\"&#x3010;&#x610F;&#x8BC6;&#x3011;&#x610F;&#x8BC6;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#xFF1F;&#x4F5B;&#x6559;&#x7684;&#x610F;&#x8BC6;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" /></p>\n<h2><a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>是什么意思？</h2>\n<p>　　意识，<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>之一，依第七识末那为根（意根）生起。所缘的是过去、现在、未来之法尘，发生认识的作用。意识层面包括眼、耳、鼻、舌、身、意六识。在认识能力上，前五识为<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>（直觉），其所缘对象必须是现在而非过去、未来，必须是现前而非别处，同时，不带名言、不能分辨是非差别。一旦和过去、未来的境界发生联系，或对认识对象作出判断、介入语言概念，便进入第六意识的作用范畴了。</p>\n<p>　　当我们眼睛看到一个茶杯并觉得它是茶杯时，已不单纯是眼识在产生作用，而是进入了意识的范畴；当我们觉得一个茶杯的好或不好时，也是意识在进行判断。我们现在所能够感觉到的一切思维活动，基本都属于意识的作用。意识除现量以外，还有比量和非量，也就是我们通常所说的判断、推理。当然，我们的判断有正确和错误之分，正确的判断为比量，错误的判断为非量。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>观和世界观的形成，也是取决于第六意识的作用。</p>\n<p>　　意识的能量极大，人生一切行为皆由其成办，无论是造善业或恶业，主要也是在它的指使下进行。这也是人所以为万物之灵的关键。因为意识具有分别、推理、判断的能力，可以使人通过理性思维来决定善、恶行为。同时，还能使人获得有别于动物的精神<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，乃至成就<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>真理。</p>\n<p>　　在心理活动中，意识虽为主体，却未必能保有权威作用。无始以来，我们为无明所惑，使贪嗔<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>大行其道，占据心灵主导。在这种情况下，意识就像充当傀儡的君王，对烦恼唯命是从。于是乎，明知所做是错事，仍控制不住去做，甚而再三犯错。何其可怜，何其可悲。唯一的出路，就是听闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，如理思维，树立<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>，夺回失去的主权，使心真正发挥正面作用。如此，才能将人生导向光明。</p>\n<p>　　与意识对应的是潜意识，其活动虽不为人所知，却暗中左右着意识。在<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>典籍中，将之归纳为第七识和第八识。意识的生起，以第八阿赖耶识储藏的种子为因，为根本依止。同时，第七末那识与生俱来的先天蒙昧（不共无明）和自私本能（俱生<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>）也对意识活动有着重大影响。</p>\n<h2>人的意识是怎么产生的？</h2>\n<p>　　意识是指人脑对大脑内外表象的觉察。按照生物学的解释，人的意识产生于脑部。人的大脑、小脑、丘脑、下丘脑、基底核等，将视觉、听觉、触觉、嗅觉、味觉等各种感觉信息，经脑神经元逐级传递分析为样本，由丘脑合成为丘觉，并发放至大脑联络区，令大脑产生觉知，即人的意识。</p>\n<p>　　意识是生物的神经现象，是个体生理功能发展到一定阶段的产物，是一种自我感觉和外部感觉的综合，意识的基础是个体具有了对自身本体认知（自我意识）、对自身认知能力的认可、对自身行使能力的认可的综合。</p>\n<p>　　因此产生一个疑问，我认为我的意识存在，我就是有意识，我认为我的意识不存在或未必存在，我就没有意识吗？由于人类意识产生于神经系统的功能，因此不论自身是否感知到，无论自身是否认可，意识均存在。如何界定意识是否存在呢？能够分别了知，具有自我内省能力和行使能力，就是意识存在的标志。</p>\n<p>　　意识无形无色，是心非物，故意<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>有时又称觉知心，意识主要功能即是觉知，凡是对内、外尘境从开始的了知、了别及其后之分析、思维、计划、整理、记忆……都叫意识，都是意识心的功能，故意识涵盖甚广，意识的出现必须要有功能健全的眼、耳、鼻、舌、身等五根去接触相对应的色、声、香、味、触等五尘，以及意根接触法尘（五尘与法尘合称为六尘），也就是说，需藉根尘相触的缘才会出生意识。在熟睡或闷绝或正死位或灭尽定的时候，五根功能无法显现，故意识无法生起，意识是中断的，因此无觉无知，什么都不知道。由此可见意识是会中断的，是虚妄之法。</p>\n<h2><a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>意识的详细解释</h2>\n<p>　　识，梵语为“vijnana”，其范围非常广泛，其中概括感觉、认识力和有意识的思想。佛教教义中有九识论，九识可被视作是九个不同层次的意识。九识不绝地活动，构成我们的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。九识中的前五识是与眼、耳、鼻、舌、身五官有关的感觉。<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>的功能，是统合和处理来自五识的官能感觉，加以推断衡量，组成整体的思维和判断。人的日常生活，主要是靠这六种机能来维持。</p>\n<p>　　在这底下的是第七识。与上述朝向外在世界的各层意识不同的是，第七识是朝向人的内在生命，并且在很大的程度上，不受感官感受的影响。第七识（manas）让我们意识到自我的存在，也造成自我执着、使人拘泥于与他人的区别。此外，对“对”与“错”的判断也出于此识。</p>\n<p>　　<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>阐明，比第七识更深的意识是第八识阿赖耶（alaya，居所）识，亦称无没识和藏识。人的业便是深藏在第八识里。前七识将随着人的死亡而消失，但是无论是生是死，第八识依旧存在。第八识可被视作是支持其它意识运行的生命源流。对于曾一度经历过濒临死亡而被救活的人而言，他们的体验或可说是发生于第七识与第八识的边界。</p>\n<p>　　理解这些不同的意识层次，了解它们之间的交互作用，能帮助我们认识生命和自我的本质，辨别一道解决人类基本问题的明径。</p>\n<p>　　根据佛教的教义，第七识对自我的本质存有一定的迷惑。迷惑根深蒂固，其来源可归根于第七识与第八识之间的交互作用。迷惑是导致根本慢心的原由。</p>\n<p>　　佛法把第七识描述为出自第八识的意识层﹕第七识不断把焦点指向第八识，视其为固定、独特且孤立的。实际上，第八识是处在一个不断变动的状态。人的生命在这个层次上，与他人的生命不停地互动，互相影响。将第八识视为一个稳定孤立的境界，是第七识的错觉和迷惑。</p>\n<p>　　惧怕死亡也是第七识的作祟。它无法觉察到，第八识的本体，其实是川流不息的生命能源，而误以为第八识将随着死亡而永远消灭。因此，对死亡的恐惧是源自心中深处的潜意识的。</p>\n<p>　　把第八识错视为真正自我的迷惑，有元品无明之称。这根本的迷惑，使人背离与一切生<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>互联系的真相，让人感到孤立、与他人隔离，以致歧视、破坏性的傲慢态度和无节制的贪欲等的产生。人类对自然环境的破坏，是另一个明显的例子。</p>\n<p>　　佛法教示，人的行动（身）、言语（口）和思考（意）无时无刻都在第八识里留下烙印。这就是佛教所说的“业”。为此，第八识也有藏识之称──即业的“种子”或业因的贮藏之所。业因是潜伏在第八识里，有善与恶之分，在时机成熟时化为业报。善因得善报。善因也激发信任、非暴力、自制、慈悲和智慧等为善的心理。相反的，恶业将引发各类愚见迷惑和具破坏性的行为，为自己、为他人都带来<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。</p>\n<p>　　把第八识形容为一个仓库般的贮藏之所，有助理解其本质，可是将其视为一道“业的源流”是更为贴切的构图。“业的源流”滚滚滔滔、长流不绝，对我们生活的一切遭遇起了决定性的作用。六识与外界接触，在这层面进行的思想和言行举止，为第八识植入新的业因。业因等待时机的成熟，返回六识，现为业报。</p>\n<p>　　我们都有纯属自己的相貌性格、<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>背景、人生际遇。这独有的一面，是由自身的“业的源流”所造就的。第八识虽然不停流动，却超越<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>，并不随之消灭。第八识的源流并不淤塞，其所存也不固定。佛法的业论与一般的<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>论不同，不主张束手就缚、听天由命等消极心态。相反的，业论所强调的是，人可借着制造业因，改变自己的<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>。</p>\n<p>　　问题在于如何增加善因的比例。佛道<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>门径虽多，所图的就是在生命中多积善因。然而，在恶因的拖累下，人们往往“一错再错”，接二连三地制造更多的恶因，以致无法自拔。要由这恶性循环抽身而出，关键在于生命最深的意识层——第九识，又名阿摩罗识（amala，纯粹的）。</p>\n<p>　　第九识可被理解为宇宙的生命。它是<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>所具备的<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，有无垢识、清净识等称谓。第九识不为业的操作所污染，是生命的真如、是真正自我的所在。日莲佛法与一般佛教和<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>传统有别，教示直入第九识，掏出内中清流般的妙用，净化其它八识。第九识之力，能够改变本已在第八识根深蒂固的业因。第八识的范围不局限于个人，更联结一家、一籍贯，甚至所有动植物的生命。</p>\n<p>　　因此，转变一个人的“业的源流”，其它人的生命，也会如紧扣在一起的齿轮一般跟着转变。诚如池田sgi会长所述∶“当我们敞开这清净无垢的根本意识时，生命中一切业因，不论<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>，都被引往价值创造的方向。人的心和意识，也将得以灌满慈悲和智慧的生命流泉。</p>\n<p>　　各个意识层次，将随着改变而显现其独有的智慧。其中，第八识的智慧让人准确无阻地看清自己、自己的亲身体验和其它一切事物，也让人感受到与其它物体的相互联系。第七识的迷惑虽然根深蒂固，但人们可借着迷惑的转变而克服对死亡的恐惧，并进而克服由此恐惧而起的凶狠与残暴的心态。产生自第七识的智慧，则让人领会万物的平等、懂得为他们给与不渝的尊敬。</p>\n<h2>各辞典对意识的解释</h2>\n<p><strong>　　《<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法数》对意识的解释</strong></p>\n<p>　　（一）谓意根若对法尘，即生意识。意识生时，即能于五尘之境，分别善恶好丑也。</p>\n<p>　　（二）谓意以法为缘，而生意识。意识依根，而生意根，因识而能分别，以能分别前五根所缘色等五尘境界，是名意识。（五根者，眼根、耳根、鼻根、舌根、身根也。五尘者，色尘、声尘、香尘、味尘、触尘也。）</p>\n<p>　　（三）谓意法为缘而生意识，意识依根而生，意根因识即能分别，以能分别前五根所缘色等五尘境界，是名意识。若断此识，即成声闻、缘觉。（五根者，即眼根、耳根、鼻根、舌根、身根也。五尘者，即色尘、声尘、香尘、味尘、触尘也。）</p>\n<p><strong>　　《佛学大辞典》对意识的解释</strong></p>\n<p>　　（术语）六识之一。依意根而起，了别法境之心王也。有四种之别：一独头意识，不与他之五识俱起，独起而泛缘十八界之意识也。此在散心，于三量中必为比非之二量。二五同缘意识，与他五识同时而起，与彼共缘其境明了依之意识也。是心之现量。三五俱意识，与五识同时而起，缘五境傍缘十八界之意识也，是通于现比非三量。四五后意识，生于五俱意识之后念，缘前念五境之境，及缘他一切法之意识也，是全与独头意识相同。此独头意识之释，乃就六识建立之小乘而言，若就大乘之八识家言之，则尚与末那识阿赖耶识俱起，非独头现行也。见百法问答钞二。又第六意识，六识中意识位于第六，故名。</p>\n<p><strong>　　《佛学常见辞汇》对意识的解释</strong></p>\n<p>　　为八识中之第六识，是依第七识末那为根（意根）生起。所缘的是过去、现在、未来之法尘，发生认识的作用。又意识分为五俱意识和独散意识二种：五俱意识者，即当前五识现起时，意识一定随同俱起；独散意识者，“独”的意思，是它能独起思构，独自分别一切法，或独作回忆过去的事，“散”的意思，是凡夫心常散乱，故名独散，因它不必和前五识俱起，故又名叫“独头意识”。</p>\n<p><strong>　　《唯识名词白话新解》对意识的解释</strong></p>\n<p>　　唯识宗所立“八识心王”的第六心王，此为我人理活动的综合中心。在西洋哲学中视之为“能把握客观对象的心机能”。广义言之，即吾人所有诸种经验，从原始之感觉至高度之思考均包括在内。凡能统摄多种经验内容的作用，皆称为意识。至于意识与物质之关系，乃哲学上的核心问题，观念论（<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>论）否定物质之独立性，视意识（思考、精神）为一切之根源；反之，唯物论视意识为物质（存在、自然）的产物。</p>\n<p>　　唯识宗又将意识分为五俱意识与不俱意识两种，前者是与前五识共同发生作用，后者是单独发生作用。单独发生作用者又称独头意识，它缘虑的对众是抽象的观念，即所谓法境，在其认识作用中包括著推理、判断等在内，且不受时间空间限制，而通于过去、未来、现在。</p>\n</div>"
    }
]