[
    {
        "title": "抑郁",
        "date": "2014-12-26",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0106/20160106041317771.jpg\" /></p>\n<h2><a href=\"/remen/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>症</h2>\n<p>　　抑郁症又称抑郁障碍，以显著而持久的心境低落为主要临床特征，是心境障碍的主要类型。临床可见心境低落与其处境不相称，情绪的消沉可以从闷闷不乐到悲痛欲绝，自卑抑郁，甚至<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>厌世，可有<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>企图或行为；甚至发生木僵；部分病例有明显的焦虑和运动性激越；严重者可出现幻觉、<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>等精神病性症状。每次发作持续至少2周以上、长者甚或数年，多数病例有反复发作的倾向，每次发作大多数可以缓解，部分可有残留症状或转为慢性。</p>\n<h2>病因</h2>\n<p>　　迄今，抑郁症的病因并不清楚，但可以肯定的是，生物、心理与社会环境诸多方面因素参与了抑郁症的发病过程。生物学因素主要涉及遗传、神经生化、神经内分泌、神经再生等方面；与抑郁症关系密切的心理学易患素质是病前性格特征，如抑郁气质。成年期遭遇应激性的<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>事件，是导致出现具有临床意义的抑郁发作的重要触发条件。然而，以上这些因素并不是单独起作用的，目前强调遗传与环境或应激因素之间的交互作用、以及这种交互作用的出现时点在抑郁症发生过程中具有重要的影响。</p>\n<h2>临床表现</h2>\n<p>　　抑郁症可以表现为单次或反复多次的抑郁发作，以下是抑郁发作的主要表现。</p>\n<h3>　　1.心境低落</h3>\n<p>　　主要表现为显著而持久的情感低落，抑郁悲观。轻者闷闷不乐、无愉快感、兴趣减退，重者痛不欲生、悲观绝望、度日如年、生不如死。典型患者的抑郁心境有晨重夜轻的节律变化。在心境低落的基础上，患者会出现自我评价降低，产生无用感、无望感、无助感和无价值感，常伴有自责自罪，严重者出现<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>妄想和疑病妄想，部分患者可出现幻觉。</p>\n<h3>　　2.思维迟缓</h3>\n<p>　　患者思维联想速度缓慢，反应迟钝，思路闭塞，<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>“脑子好像是生了锈的机器”，“脑子像涂了一层糨糊一样”。临床上可见主动言语减少，语速明显减慢，声音低沉，对答困难，严重者交流无法顺利进行。</p>\n<h3>　　3.意志活动减退</h3>\n<p>　　患者意志活动呈显著持久的抑制。临床表现行为缓慢，生活被动、疏懒，不想做事，不愿和周围人接触交往，常独坐一旁，或整日卧床，闭门独居、疏远亲友、回避社交。严重时连吃、喝等生理需要和个人卫生都不顾，蓬头垢面、不修边幅，甚至发展为不语、不动、不食，称为“抑郁性木僵”，但仔细精神检查，患者仍流露<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>抑郁情绪。伴有焦虑的患者，可有坐立不安、手指抓握、搓手顿足或踱来踱去等症状。严重的患者常伴有消极自杀的观念或行为。消极悲观的思想及自责自罪、缺乏自<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>可萌发绝望的念头，认为“结束自己的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>是一种<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>”，“自己活在世上是多余的人”，并会使自杀企图发展成自杀行为。这是抑郁症最危险的症状，应提高警惕。</p>\n<h3>　　4.认知功能损害</h3>\n<p>　　研究认为抑郁症患者存在认知功能损害。主要表现为近事记忆力下降、注意力障碍、反应时间延长、警觉性增高、抽象思维能力差、学习困难、语言流畅性差、空间知觉、眼手协调及思维灵活性等能力减退。认知功能损害导致患者社会功能障碍，而且影响患者远期预后。</p>\n<h3>　　5.躯体症状</h3>\n<p>　　主要有睡眠障碍、乏力、食欲减退、体重下降、便秘、身体任何部位的疼痛、性欲减退、阳痿、闭经等。躯体不适的体诉可涉及各脏器，如恶心、呕吐、心慌、胸闷、出汗等。自主神经功能失调的症状也较常见。病前躯体疾病的主诉通常加重。睡眠障碍主要表现为早醒，一般比平时早醒2～3小时，醒后不能再入睡，这对抑郁发作具有特征性意义。有的表现为入睡困难，睡眠不深；少数患者表现为睡眠过多。体重减轻与食欲减退不一定成比例，少数患者可出现食欲增强、体重增加。</p>\n<h2>治疗</h2>\n<h3>　　1.治疗目标</h3>\n<p>　　抑郁发作的治疗要达到三个目标：①提高临床治愈率，最大限度减少病残率和自杀率，关键在于彻底消除临床症状；②提高生存质量，恢复社会功能；③预防复发。</p>\n<h3>　　2.治疗原则</h3>\n<p>　　①个体化治疗；②剂量逐步递增，尽可能采用最小有效量，使不良反应减至最少，以提高服药依从性；③足量足疗程治疗；④尽可能单一用药，如疗效不佳可考虑转换治疗、增效治疗或联合治疗，但需要注意药物相互作用；⑤治疗前知情告知；⑥治疗期间密切观察病情变化和不良反应并及时处理；⑦可联合心理治疗增加疗效；⑧积极治疗与抑郁共病的其他躯体疾病、物质依赖、焦虑障碍等。</p>\n<h3>　　3.药物治疗</h3>\n<p>　　药物治疗是中度以上抑郁发作的主要治疗措施。目前临床上一线的抗抑郁药主要包括选择性5-羟色胺再摄取抑制剂（SSRI，代表药物氟西汀、帕罗西汀、舍曲林、氟伏沙明、西酞普兰和艾司西酞普兰）、5-羟色胺和去甲肾上腺素再摄取抑制剂（SNRI，代表药物文拉法辛和度洛西汀）、去甲肾上腺素和特异性5-羟色胺能抗抑郁药（NaSSA，代表药物米氮平）等。传统的三环类、四环类抗抑郁药和单胺氧化酶抑制剂由于不良反应较大，应用明显减少。</p>\n<h3>　　4.心理治疗</h3>\n<p>　　对有明显心理社会因素作用的抑郁发作患者，在药物治疗的同时常需合并心理治疗。常用的心理治疗方法包括支持性心理治疗、认知行为治疗、人际治疗、<a href=\"/remen/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>和<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>治疗、精神动力学治疗等，其中认知行为治疗对抑郁发作的疗效已经得到公认。</p>\n<h3>　　5.物理治疗</h3>\n<p>　　有严重消极自杀企图的患者及使用抗抑郁药治疗无效的患者可采用改良电抽搐（MECT）治疗。电抽搐治疗后仍需用药物维持治疗。近年来又出现了一种新的物理治疗手段——重复经颅磁刺激（rTMS）治疗，主要适用于轻中度的抑郁发作。</p>\n<h2>预防</h2>\n<p>　　有人对抑郁症患者追踪10年的研究发现，有75%～80%的患者多次复发，故抑郁症患者需要进行预防性治疗。发作3次以上应长期治疗，甚至终身服药。维持治疗药物的剂量多数学者认为应与治疗剂量相同，还应定期门诊随访观察。心理治疗和社会支持系统对预防本病复发也有非常重要的作用，应尽可能解除或减轻患者过重的心理负担和压力，帮助患者解决生活和工作中的实际困难及问题，提高患者应对能力，并积极为其创造良好的环境，以防复发。</p>\n</div>"
    }
]