[
    {
        "title": "【咒语】-佛教咒语是什么意思？",
        "date": "2014-12-25",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"\\\" height=\"266\" src=\"https://www.liaotuo.com/uploadfile/2016/0112/20160112030114909.jpg\" style=\"width: 336px; height: 261px\" width=\"312\" /></p>\n<h2><a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　<span style=\"color:#ff0000;\">咒语在中国属于法术的一种，以某种特别的顺序或特殊音节念出，以促成某些的特殊效果的语句</span>。语言<a href=\"/foxue/changshi/153461.html\" class=\"keylink\" target=\"_blank\">禁忌</a>发展到极点，达到灵物崇拜程度 ，就可能形成引 。咒是口头语言禁忌 ，平时禁止使用。咒语的文字表现形式是符箓。咒语并非<a href=\"/remen/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>，是人类表达意念的一种语言，传承于我国几千年的道家文化，史上曾记载源于一种巫术行为，后佛教文化传入我国，梵文咒语被广泛应用于佛教领域。</p>\n<h2>咒语概念</h2>\n<p>　　咒在中国地方佛教中被称为<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>，且广泛运用于中国<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>典籍中。在中国大乘佛教中，咒或圣陀罗尼，即总持一个法，即心即是“佛”，是诸佛菩萨修持得果之心法结晶。</p>\n<p>　　十方三世有无量数诸大乘佛，有八万四千陀罗尼门，而同一陀罗尼门，亦有无量数大乘佛修持成功得果。</p>\n<p>　　当知诸法如义，一法等于一切<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>法。但咒为梵文，其间有译意，而持咒者不必晓其意：因诵咒时，心解其意，反生分别心，而不能至炉火纯青，一心不乱之境。</p>\n<p><span style=\"color:#ff0000;\">　　以下咒的解释摘自<a href=\"/fjrw/hcrw/xhsr/\" class=\"keylink\" target=\"_blank\">宣化上人</a>《<a href=\"/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">般若波罗蜜多心经</a>非台颂解》：</span></p>\n<p>　　咒，什么叫咒？英文叫MANTRA。咒也有一种不可思议的境界，它有四个意思。</p>\n<p>　　第一个意思，所有的咒是鬼神王的名字，好像毗舍遮、鸠盘茶都是鬼神王的名字，你念鬼神王的名字，那小鬼小神就老实了。为什么呢？啊，你认识我们这个鬼王，你认识我们的神王！这小鬼小神就不敢不守规矩了。</p>\n<p>　　第二个意思就好像军中的密号似的，军中的密号就是军中的口令。在军中每一天每一天的口令不同，只有自己人才知道这个口令，外边的人不知道。好像今天的口令是“胜利”，那么整个军队都知道口令是“胜利”。譬如我见到你不认识，就问你口令，你说：“胜利”，这就对了，是自己人。如果我问你口令，你说：“吉祥”，这就不是了，就要开枪打。为什么呢？你不是自己人。咒就和口令是一样的，我们<a href=\"/fozhou/\" class=\"keylink\" target=\"_blank\">念咒</a>，鬼神一听，我们的口令是这样子，所以他们就都老实了，都守规矩了。如果不是，他就要和你斗一斗。</p>\n<p>　　第三个意思是一种秘语，其他的人不知道，只有这个人才知道。就好像本来有一个很穷、很微贱的人，他跑到外国去，外国人也不知道他是个什么？他就说：“我是某某国的国王，因为军人倒戈，国家政变，所以我跑出来到这个国家逃难。”国王也不知道是真是假，以为是真的，就把公主嫁给他，国王的女儿就和这个穷贱的人结婚了。这穷贱的人就装模作样以为自己是国王的身份，一天到晚发脾气，脾气还大得很。然后有一个认识他的人，知道他是一个穷贱的人，对公主讲：“他再发脾气，你只要说这句话：‘本来是一个贫贱的人，远游至他方，你何必有这么多的瞋呢？’”这么一讲，这贫贱的人知道有人了解他的根底，于是再也不敢发脾气。这咒也好像这样，你念咒，那鬼神认为你知道他的根底，知道他是怎么回事，就不敢对你不守规矩。</p>\n<p>　　第四个意思，咒是诸佛的心印，秘语。唯佛与佛才知道，其他的<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>都不知道，所以咒就不翻译，也就是一音演说咒，众生随类各遵守，某一类的众生听到这个咒都明白，好像我们人虽然不明白，可是鬼明白，神明白，阿修罗、畜生都明白，妖魔鬼怪也明白，所以你一念这个咒，他们都老实了。</p>\n<p>　　这就好像有一个国王要先陀婆，先陀婆是梵语，有四种东西都叫这个名字。四种东西是什么呢？盐、水、马和大小便的东西。所以当国王说我要先陀婆，其余的大臣也不知他是要盐呢，要水，要马，还是要大小便的东西？但有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>的人一听他在什么时候要就知道他要什么？吃饭的时候要先陀婆，当然不会要大小便的东西，一定是要盐。他要走路的时候要先陀婆，一定是要马。他渴的时候要先陀婆，一定是要水。那么看他也不渴，也不吃饭，也不走路的时候，当然就要大小便的东西。所以这咒你念出来，有智慧的鬼神一听就懂，其余不懂的也跟着那个懂的去做，所以咒有以上四个意思。</p>\n<h2>咒语详解</h2>\n<p>　　中国民间旧时，众生离世后请僧人、道士念经<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>亡灵 ，要在房屋四壁上贴符 ；盖房上梁时 ，在房梁上贴符；孩子生病时到寺庙里求符。符是一种奇特的图画，充当文字符号，代替语言的力量，用来作避邪镇妖之用。</p>\n<p>　　咒术、魔法、巫术，在这里，它们所指代的意思是相同的，它们是一种神秘的力量，利用仪式、咒语，或者其他秘术来达到目的，借助自然的力量，精灵或者恶魔什么的力量来达到目的。</p>\n<p>　　另一种<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>是说我们这个世界是存在神的，只有通过特殊的语言特殊的地点与特殊的环境才可以与神交流，久而久之就成了咒语。</p>\n<p>　　而魔法就是通过咒语与神订立契约，可以使用这个神的力量（驱动某一种魔法元素）。但由于平时是不可以与神交流的，所以要再念一次咒语，只要可以达到足够神把力量传给你的强度就可以了（这样条件就不是很苛刻了，不要求特殊的地点与环境）。</p>\n<p>　　魔力就是可以控制神力的程度（他是神嘛，力量很强大咯，你要是可以控制他全部能量你不就是神了~），不能控制的力量会在身体中破体而出——爆炸。</p>\n<p>　　在第一次与神交流（就是订立契约）的时候，咒语威力最大化，接下来，越契合与神交流的条件（时间地点语言），神就可以传递更多魔法，所以咒语念得越长越多，魔法威力越大，如果再一次最大化那就是——禁咒。</p>\n<p>　　禁咒就是咒语最大化（时间地点完全切合）——神祇接降临这个世界，再拿走一切他想要的东西后，毁灭一切你想要毁灭的敌人，如果两人同时使用禁咒，则两个神不会打起来，只会拼命拿东西，谁拥有的多，谁就是胜利者，另一方的神则会什么都不管，带着所有的东西走人。</p>\n<p>　　禁咒一般都没有人用，，因为无法负荷神的力量，还没等到神降世，就已经爆了……（当然这些都是说法而已，并不是客观存在的，不过小说里倒是经常看到就是啦。）</p>\n</div>"
    }
]