[
    {
        "title": "【自性】什么叫自性？自性是什么意思？",
        "date": "2016-01-14",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"&#x3010;&#x81EA;&#x6027;&#x3011;&#x4EC0;&#x4E48;&#x53EB;&#x81EA;&#x6027;&#xFF1F;&#x81EA;&#x6027;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" src=\"https://www.liaotuo.com/uploadfile/2018/0917/20180917024007465.jpg\" title=\"&#x3010;&#x81EA;&#x6027;&#x3011;&#x4EC0;&#x4E48;&#x53EB;&#x81EA;&#x6027;&#xFF1F;&#x81EA;&#x6027;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" /></p>\n<p style=\"text-align: center;\"><strong>什么叫<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>？<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>自性是什么意思？</strong></p>\n<p>　　自性是指自体的本性，亦即诸法各自具有真实不变、清净本然之个性。自性是一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>本具的，它是离开一切形状、颜色，不可把捉的。虽然不可把捉，它又在我们的内心存在。</p>\n<p>　　自性，是佛学典籍中经常出现的一个重要概念。在佛教的各个宗派中，不论是小乘，还是大乘，是教下，抑或是宗下；都谈到它。但由于各家的核心思想不同，所以赋予的含义也往往不一样。现举出几种代表性的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>并作一比较说明。</p>\n<h2>（一）有部的自性。</h2>\n<p>　　有部，具称说一切有部，是上座部流出的大部派，盛行于西北印加湿弥罗一带，人才辈出，注疏丰富。主要论典有“六足一身”。“六足”即《法蕴足论》、《集导门足论》、《施设足论》、《品类足论》、《界身足论》和《论身足论》；“一身”是《大毘婆沙论》，及《发智论》等。其理论特点是三世实有，法体恒有。</p>\n<p>　　有部之所以得名一切有部，就是因为它主张三世实有，法体恒有的缘故。有部将一切法加以归纳分类，其中最完整的分类，要算世友的《品类足论》及世亲的《<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>》中所说的五位七十五法。五位．即色法、心法、心所注、心不相应行法、<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。色法分为十一种，心法一种，心所法分为四十六种，心不相应行法分为十四种，无为法分为三种，共合七十五种法。这些法在有部看来，都有它的自性，此自性恒有。</p>\n<p>　　那么自性是什么呢？在《大毘婆沙论》中有自性门，说明某法的体性是什么，这就是出体。有部论师对<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>、身心一切现象，了解为复杂的综合体，分析复合体而发现内在单一的本质，就是自性。这就是实有与假有。如《大毘婆沙论》卷一三三曰：“地云何？答：显形色，此世俗想施设。……地界云何？答：坚性触，此是胜义能造地体。”这里把地分为二种：常识中的地，是和合有，是世俗假想施设而非真实的；佛说的地界，那是胜义有。从复合的总聚，而探得一一法的自性，也称为分。分是不可再分析的，也称为我。如《大毘婆沙论》卷九曰：“我有二种：一者法我，二者补特伽罗我。善说法者，唯说实有法我，法性实有，如实见故。”此外自性，还有本性等别名，显示了一切法自性，是自有、自成的，永恒存在的，所以《大毘婆沙论》卷二十一曰：“诸法实体恒无转变，非<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>故。”</p>\n<p>　　对于这样恒有的自性，与现实的<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>生灭现象似乎相违，与缘起因果也仿佛不合。针对这些疑问，在《大毘婆沙论》中有着详细的解释说明，兹略引几段。如《论》卷七十六曰：“未来诸法集现在时，如何聚物非本无今有？现在诸法散往过去时，如何聚物非有已还无？答：三世诸法，因性果性，随其所应，次第排立。体实恒有，无增无减，约依作用，说有说无。诸聚集物，依实有事，假施设有，时有时无。”这是说，诸法实体在三世中恒有，不能说从无而有，有已还无的，但依作用可以说有说无。</p>\n<p>　　又如《论》卷三十九曰：“问：诸行自性有转变不？设尔何失，若有转变，云何诸法不舍自相？若无转变，云何此中说有住导？答：应说诸行自性无有转变。复次有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故说无转变，有因缘故说有转变。有因缘故说无转变者，谓一切法各住自体、自我、自物、自性、自相，无有转变；有因缘故有转变者，谓有为法得势时生，失势时灭……故有转变。”这可见有为法的生灭有无，约作用、功能而说。自体是恒住自性，如如不变的，因此称为恒有。</p>\n<p>　　至于三世因果的建立，在有部有四大论师的不同主张，即法救、妙音、世友、觉天。这里但举出有部正宗世友的主张来介绍一下。如《大毘婆沙论》卷七七曰：“说位异者，彼谓诸法于世转时，由位有异，非体有异。如运一筹，置一位名一，置十位名十，置百位名百，虽历位有异，而筹体无异。如是诸法经三世位，虽得三世而体无别。此师所立，体无杂乱，以依作用立三世别。谓有为法，未有作用名未来世，正有作用名现在世，作用已灭名过去世。”三世但依作用有无建立，自体则是恒有不变，所以三世实有，法体恒有。</p>\n<h2>（二）<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>家的自性。</h2>\n<p>　　在佛灭度后的五、六百年间，印度佛教史上是部派佛教盛行时期，由其是一切有部影响极大。到了佛灭后七百年间，有龙树大士出世，因感于有部思想不契合佛意，遂依《<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经》，造《中论》、《十二门论》、《大智度论》等，针对着有部三世实有、法体恒有的思想，给予猛烈的评击。同时，高竖缘起无自性的中道法幢，在印度佛教史上放出异常的光彩。</p>\n<p>　　中观家的核心思想，就是缘起性空。缘起，即宇宙间一切有为现象，都是因缘和合而生起的。性空，谓由因缘和合而生起的一切现象，皆无自性。《大智度论》卷三十一曰：“性名自有，不待因缘，若待因缘，则是作法，不名为性。诸法中皆无性，何以故？一切有为法皆从因缘生，因缘生则是作法，若不从因缘和合则是无法。如是一切诸法性不可得故，名为性空。”又如《中论·<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>品》曰：“因缘所生法，我说即是空，亦为是假名，亦名中道义。未曾有一法，不从因缘生，是故一切法，无不是空者。”这是说一切法无不是缘起，缘起法必然没有自体，没有自体所以性空。</p>\n<p>　　自性与缘起，从有部的立场去看，本来可以并立而相成的，但到了中观家的经论里就变成水火不容了。以自性是自有、自成、永恒存在的，有自性就不必待缘起。既然待因缘和合而生，那就必然没有自性。因此，缘起必然性空，性空才能建立缘起，只有这样才是符合中道。像有部所说不仅不能建立，而且也是落于常见了。</p>\n<h2>（三）<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>家的自性。</h2>\n<p>　　唯识学是佛灭后九百年间，由无著、世亲兄弟共同兴起的一个教派。它与龙树倡导的中观学分庭抗礼，形成了印度佛教史上的空有二宗。前面说过，空宗的特征是彻底否定自性，阐明一切法都无自性空，可是，到了唯识家经论里又讲究自性。于是，又有了空有之争。</p>\n<p>　　唯识家的核心理论是三自性；即遍计所执性、依他起性、圆成实性。“三性”是唯识家对一切法的本质及状态所作的归类性的说明。其具体内容据《唯识三十颂》中说：“由彼彼遍计，遍计种种物，此遍计所执，自性无所有。依他起自性，分别缘所生。圆成实于彼，常远离前性。”此二颂中，前一颂解释遍计所执性。“彼彼”显示众多；“遍计”是周遍计度，谓我人能缘心不断地于所缘境上虚妄分别，错误的认为有我有法，我法二执即是遍计所执性。次一颂的前半颂解释依他起性。依他起性，是由因缘和合而生起的一切现象。次半颂显示圆成实性，圆成实乃圣智所缘的境界，是由远离我法二执而显。而三性的有无，颂中但曰遍计所执自性无所有、依他、圆成都未提及，可见是有的。【注：依他起自性，分别缘所生。分别缘即是<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，既然说依他起自性是分别缘生，可以知道依他起即是无自性。无对遍计依他起自性执即是圆成实，圆成实即是中观破除有无见的中道，而中道即离有无也就不可得，所以圆成实也以自性不可得的无性为性，故唯识说三性是为明了三无性，不应再对依他，圆成起有自性见】</p>\n<p>　　对三性有无作进一步说明的是三无性。《唯识三十颂》继三性之后曰：“即依此三性，立彼三无性，故佛密意说，一切法无性。初即相无性，次无自然性，后由远离前，所执我法性。”这里说明了一切法无性，即三无性是<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>密意说的【注：说明佛说唯识的假立三性是为了说三无性的密意即是一切法无性和中观相同】。在三自性中，遍计所执性的没有，是为“相无性”。依他起性，谓因缘和合而生起的事物现象是有的，而自生、自成的永恒性则是没有，是为“生无性”。圆成实性由远离二执而显，且不从其本身去看。相对遍计执性而言，则是有的。因此，在三无性中，只有遍计执性才是真实无性，依他、圆成皆是假说无性，非性全无也。【注：佛已说了三无性，清楚说明遍计无性，依他无性，离开了对遍计依他所执自性即是圆成实。正是佛密意的一切法无性，说无性不能执无，无是对有说无，有即无了，无也无，若起无见，此‘无’仍是有。所以不是假说无性，依他起即是无自性，圆成实性则离有无，不能说有性无性，即是中观的中道。】</p>\n<p>　　中观家讲缘起性空，唯识家讲依他、圆成有自性，乍看之下似乎矛盾。其实，二者并不相违背。为什么？因为所说的自性含义不同。中观家破的自性，是有部所建立的自性。它具有自有、自成、永恒存在的意思，这种自性在缘起法中当然不能成立，是没有的，而唯识家也是反对的。《唯识三十颂》讲到依他起性时说无自然性，此自然性岂不是有部所立，而为中观家所破的自性吗？再看唯识家所说的自性，“自”是简别它为义；“性”是体义、质义。谓因缘聚合而成现象，具有相对的体质及简别于他的功能，称为“自性”。此自性的含义正好与法的含义相等，这样，有法就有自性。所以，唯识家把依他起与自性联系在一起并不矛盾。而唯识家这种自性，中观家也不排挤，原因是中观家也承认性空而又宛然有的现实【注：中观洞视宛然有是假有，并非实有的】。《<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>》所说的“色即是空，空即是色”，不就是最好的证明吗？</p>\n<h2>（四）<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>的自性。</h2>\n<p>　　禅宗，是达摩西来以心印心，代代相传而形成的一个宗派。这宗派的特点是“直指人心，见性<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。”“心”为我人现前一念之妄心；“性”是生起心的相本，是心的本原。在禅家语录里，或曰本来面目、或曰本性、或曰<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>、或曰自性等。尤其自性一名，禅家使用偏多，如《<a href=\"/fojing/liuzutanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">六祖坛经</a>·序品》中五祖对神秀曰：“无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>，须得言下识自本心，见自本性，不生不灭，于一切时中念念自见，万法无滞，一真一切真，万境自如如，如如之心即是真实，若如是见，即是无上菩提之自性也。”这里以无上菩提为自性，说明明心见性情况，意谓神秀尚未见性。又同品六祖悟后曰：“一切万法不离自性，”遂启祖曰：“何期自性本自清净，何期自性本不生灭，何期自性本自具足，何期自性本不动摇，何期自性能生万法。祖（五祖）知悟本性，谓惠能曰：不识自心，学法无益；若识自心，见自本性，即名丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛。”又《般若品》六祖曰：“一切般若智，皆从自性而生。”显然，这里的自性就是佛性。它具有本来具足、清净、不生灭、不动摇、能生万法的特点，<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>悟之而成道，凡夫迷之则<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。</p>\n<p>　　禅家所讲的自性与有部所说的自性，约其自生、自成、永恒存在的一点，颇为相同。但有部是指缘起现象的世俗谛；禅宗则建立在<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>寂灭的第一义谛中【禅宗自性即是中观的中道，唯识的圆成实性】。缘起现象的世俗谛，因为缘起的，自然不存在自生、自成、永恒存在的自体，故为中观家所破。禅家从无相寂灭的第一义谛里说明：无相寂灭的第一义谛非缘起【非自然】，非缘起故自性得以建立。</p>\n<h2>结论</h2>\n<p>　　总观以上四家所说：有部的自性，是指因缘聚合的有为现象中，具有自生、自成、永恒存在的自体，唯识家的自性，是指依他生起的一切现象，各有相对独立的体质及简别于他的功能，禅家的自性，是指我人本具的真如佛性【即是无自性之性】。中观家所破的对象，主要是有部所说的自性。至于唯识、禅宗所说，从论主龙树破执的动机去看，显然不是他所要破的，而若有人执以为实有，中观家也会破斥的。</p>\n</div>"
    }
]