[{
    "title": "出版说明",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>一九九六年春,美国的包卓立（William Bodri）先生，向南师怀瑾先生提出佛法修证过程中的诸多问题，而引起了一连数月的谈论对话。这两本集子，就是那次对话的记录。包卓立先生，原就读康乃尔大学博士班时，即服务于纽约华尔街，他曾经学佛法密宗，一九八六年在美国与南师晤面后，旋即辞去华尔街的高薪工作，专心从南师修学佛法。十几年来，其成就自不待言，并有著作在美及台湾出版（注一）。</p><p>包卓立深感美国人士学佛学密，良师难遇，困难重重，他对当时在美国流行的一本有关密宗修拙火记录的书（The Kundalini Experience）（注二），颇有疑问，故而特别请教南师。也由于另一个特殊的机缘，他看到了西藏贡噶活佛（注三）颁发给南师的证书，知道南师是西藏密宗各宗派认可的上师，故而要请南师讲解并评论这本美国修拙火定书中的问题。</p><p>在对话的过程中，南师的解析涵盖颇广，一并提出研究的，还有西藏密宗有成就者的修行经历。这些问题的提出，和南师的分析评论，解答了许多学佛修行者的疑虑，对密宗的修行者，解惑尤甚。更 要特别提醒读者们的是，在研讨后，南师接着为修证佛法的行者们，讲解了《大乘广五蕴论》，并从《楞严经》中，抽出与五蕴解脱有关的章节，加以配合详细的讲解，俾使修持佛法的人们，明瞭五蕴解脱的根本性及重要性，以及修行解脱的方法和步骤。对 学佛修行的人来说，南师讲解五蕴解脱这部分，是划时代的重大贡献，这是许多老修行们的一致想法与感受。因 为在本书的编校过程中，曾有好几位真修实证的朋友们参与，大家一致认为，抱着这本书修行，疑问都有解答，而且不会迷路，更要紧的是不会入魔了。现 在修行人最大的苦恼是，佛的经典看不懂，虽然有许多大师们中规中矩的讲解，但要落实在修持上，常常感到难以着力。举 例来说，「观想」这句话，法师们的讲法是：「想是用情，观是用慧」，听起来这个解释十全十美，但什么是用慧？又怎么能有慧？令人仍是无所适从。但在这本书下集中，南师怀瑾先生，排除宗教字眼，具体说明如何观想，修行人应如何去做，这也不过只是一个例子而已。</p><p>古人说抱本参禅可以悟道，现代人在忙碌的生活中，哪有抱本参禅的机缘？只能在是生活中渐修，这本五蕴解脱的书，恰好是大家所需要的。因为南师数十年讲经说法，固然道尽了各种法门，但这一次不同，是应修行者提问而讲，是集中有条理的深入说法，使修行人能瞭解修持步骤，能正确判断自己的进度，不会再误以为自己已经成功了。</p><p>南师此次一连串宗教系列的讲解和对话，分成上下两集印行，上集是专门评析美国与西藏的密宗修行经验。由于近年来，研究及修学密宗的人颇众，尤以美国为最，南师与包卓立的对话，可能纠正许多时下学密法的不正确观念。下 集内容是五蕴解脱修证，我们为这本集子的出版欢喜赞叹，真正修证佛法的朋友们，抱着这本书，可以走上康庄大道了。</p><p>在 出版过程中，承蒙许多朋友的协助。先是香港大学的赵海英教授，担任口译的工作，并做记录及初步的整理。李素美居士，也曾担任部分的口译工作，其它如杭纪东教授、宏忍法师及欧阳哲，以及几位不肯具名的老修行们，或帮助查核资料，或对照经典，或校阅书稿等，对这两本书的出版，尽力很多，在此对他们一并致答感谢之忱。</p><p>由 于南师怀瑾先生目前工作极为繁重，故本书尚未经其过目，特此声明。在 本书付印之际，忽接两篇文稿，系包卓立先生与赵海英教授所撰，所言与本书内容有关，皆为南师下课后与他们的零星问答，经由他们整理后，编写成篇。这是他们的领悟和心得，更是有关修行的重要资讯，故特附录于后，作为补充，</p><p>以供读者们参考。</p><p>又 本书中经文部分，采用版本如下：</p><p>《 大乘广五蕴论》--新文丰</p><p>《 楞严经》--台湾印经处</p><p>《 解深密经》--台湾印经处</p><p>刘雨虹 记</p><p>二〇〇三年九月</p><p>[ 注一] 包卓立的著作：</p><p>（1）苏格拉底也是大禅师（台北老古）</p><p>（2）Twenty-Five Doors To Meditation（25 种修定法门）(美国SamuelWiser，INC.)</p><p>（3）The Story of Chinese Taoism</p><p>（4）The Insider｜s Guide to The World｜s Best and Worst Spiritual Pathsand Practices</p><p>（5）How to Measure and Deepen Your Spiritual Realization</p><p>（6）Kuan Tzu｜s Supreme Secrets for the Global CEO</p><p>（7）The Various Stages of the Spiritual Experience</p><p>[ 注二]台湾后来曾译成中文出版，书名为《拙火经验》（方智出版）。</p><p>[ 注三]唝噶呼图克图（一八九三 至 一九五七）是密宗白教有成就的上师，他曾经多次到汉地宏扬，时在廿世纪三、四十年代。南怀瑾先生除白教外，亦曾依止根桑活佛，黄教的阿旺堪布、章嘉活佛、以及东本格西活佛等。</p></div>"
},{
    "title": "第一章 拙火经验分析",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>包卓立：现在大部分人的修持程度都没有跳出色阴的范围。我们首先为大家介绍一些一般人修行的经验。一方面是为了让大家熟悉一下修持中可能遇到的现象，另一方面，避免有人在有了小小的体验后，误以为自己悟道了，或者有了很优越的修行成就，而进入外道。李撒那拉（lee Sannella）博士在他的《拙火经验》一书中，介绍了很多当代美国人修持的经验。下面，我们以他这本书中的案例为基础，对静坐中出现的一些基本现象加以说明和解释。在后面的章节中，我们会对历史上有修行成就的大德们的经验，加以分析和说明。</p><p/><p>案例一：人文学教授（男）</p><p>翻译：他现在六十九岁。儿时，他曾经有很多特异功能。一九六三年，他休息了几分钟，手自然的放在大腿上，醒来时，发现大腿放手的部位起了一个三英寸的大疱。这个不寻常的经历激发了他对心力功能的兴趣，不到两年时间，他就开始有规律的静坐。不过，他没有任何老师指导。一九六七年，他开始正式修习禅定。几个月后，有一次静坐，他觉得自己被金色的光所吞没，这种情形延续了好几分钟。几星期后，他又有了类似的经历。静坐的时候，他常有刺痒的感觉，这种感觉从腿内侧到大腿根，一直到双臂，胸部，背部，头部和眉毛。然后，再移到脸颊，鼻子，有时甚至会到下巴。后来，静坐的时候，喉部也会感觉到振动和痒。</p><p>十年以后的今天，他已经退休了，那些奇异的经历也都消失了。但是，他现在可以让自己的能量从骨盆部位向上移动，他觉得这个能量流可以帮助他增加生命力，并治好了他的背痛毛病。偶尔，他会觉得能量被堵在喉咙部位，我（指作者），第一次见他的时候，他好像也是因为喉咙部位而无法发起拙火。</p><p>然而，最近他的身体发生了一些有趣的变化。他会作一些轻微的有氧运动，然后他会觉得年轻了十岁一般。他的肩膀和胸部增大了好几英寸，腰部则变小好几英寸。他体重减少了十五磅，他的手有时还是会发热，他还会听到铃声，有时会被很响的吱呲声吵醒。</p><p>怀师：这些现象完全不是拙火发动，只是凡气发动而已。一般练气功的人亦会有这些现象。真正拙火是元气的发动。有病的人，练习静坐以后，身体很容易产生这些变化。我们与这个人虽未曾谋面，但从他气机发动的情况来看，他的肝脏应该比较弱。另外，他前生应该是位修行人，所以静坐不久就有了这些现象。这些都不是道、禅或者拙火。如果一个人对修行的理论有所了解，做功夫效果会更快。坐中所见到的金色光并非智慧之光，只是心与气，或者说身体与心理摩擦而造成的有相之光。在心念驱动之下，身体地、水、火、风四大互相发生作用，就会产生这些光的现象。只有修行功夫很高的人，喉轮才能打开。他的喉部还没有打通，所以他感到气无法通过喉部。</p><p/><p>案例二：高中教师（女）</p><p>翻译：她是一位西班牙语老师，现已中年，练习瑜珈和静坐已经很多年了。自从一九七0 年，她开始有很多症状，比如头痛，面部和鼻子抖动，喉部、心脏、和腹部会抽搐疼痛，整个身体表层会有跳动的感觉。每次静坐，这些症状就会变得很明显。同时，她有空的感觉，她觉得声音似乎不是她自己发出来的。</p><p>一九八五年十一月，她身体发生了很多变化。她参加了一次三十天的静坐集训，这期间，她可以感觉到很强的能量流通过并清洗她的整个身体。同时，除了头部的感觉以外，其它器官都失去了感觉。她的面部和头顶可以感受到拙火能量，喉轮、心轮、和腹部脉轮部位好像有阻碍和抽搐的感觉，强力静坐的时恢，这些感觉都会加强。同时，这些部位都会有热感。后来，她脑子里面开始听到像机器一样的噪音，这种情况一直持续了好几个星期。当她把眼睛闭上的时候，她可以看见自己的头和脸发出白光。</p><p>三个月后，这些现象慢慢消失了，但是，当她开始静坐以后，这些现象又出现了，并一直持续了好几个星期的时间。拙火能量也恢复了，沿着脊椎骨往上流动，再往下流到面部和身体。同时，她还有像性快感一样的感受。不久，她喉咙抽搐，她害怕自己会呛死，后来，其它的症状也恢复了，而且，有好几次，她觉得自己好像得了心脏病一样。后来，这些症状慢慢消失了。但是，她突然开始坐骨神经痛，经过检查，发现坐骨有裂痕并且压迫神经。三个月的治疗毫无效果，于是她决定动手术。当时，她已经患上了脚脱落（foot drop）的毛病，从后背的下部到左脚大拇指都很痛，坐骨部位粗重发麻。后来，很突然的，三天之内，她的坐骨神经痛的毛病就消失了，而且她可以自己走路，只有轻微的跛脚。</p><p>六个月后，她的左边小腿只有轻微的不适。她自己认为，她背部本来就有问题，但是，一直都没有显现出来，直到后来拙火发动以后，症状才开始明显化。她认为，自己之所以能很快恢复正常是上天的慈悲(a gift of grace)。后来她一直坚持静坐，所有的症状也都消失了。</p><p>怀师：这个人脊椎骨有毛病，所以会带来头痛及喉咙的问题。静坐后发现自己脊椎有问题的人，不要马上动手术，应该先用中医的方法作整骨，或者作深层肌肉按摩。这个人很聪明，知道脊椎的问题并非因静坐引起的，静坐只是帮助她发现了问题而已。神经有问题的人，静坐时亦会有类似的现象，一定要注意不要把这两种情况混为一谈。</p><p>她的这些现象也不是拙火发动。遗憾的是，人们都把后天凡气之动误以为是先天之气的拙火发动。但你们要知道，并非没有拙火，只是大家功夫不到家而已。正如唐朝黄檗禅师说的：「大唐国里无禅师，不道无禅，只道无师。」拙火，以道家来讲，就是先人一炁，就是先命还没有来的时候，宇宙本体根根上来的那股力量。这里讲的这些身体上的变化，都是后大的，不是先天的，都是有了身体以后，生理、心理摩擦而发生的现象。也可以说是四大（地水火风）生理的神经摩擦变化所发生的现象。</p><p/><p>案例三：艺术教师（女）</p><p>翻译：这位女性现在四十五岁左右，十年前，她做「自动绘画」（不用思索，想到甚么就画出甚么）已经十四年了。最近两年，她开始作「自然绘画」，也就是毫不费力的，自然的画出她内心深处的心理感受。这种情形开始得很偶然，两年前的一天，她在作画的时候，突然昏倒了。当她醒来的时候，她发现自己躺在地上，身体剧烈的颤动，而且感觉身体内部有一种巨大的能量。这种情形延续了大概半个小时左右。第二天早上她作瑜珈的时候又发生了一次，当时，她第一次作了这种「自然绘画」。</p><p>很快，她作了第二幅「自然绘画」。她能感受到一股强有力的能量流和内热，她不知道自己是谁，也不知道自己在哪里。她开始担心自己是不是发疯了。同时，她开始变得很焦急，并且头痛。这时，她根据自己的幻觉作了第三幅「自然绘画」。</p><p>这时，她完全崩溃了，得了忧郁症，觉得自己要死了，并且经常哭泣。她的第四幅「自然绘画」题目叫「分裂」，反映了她当时的心理状态。之后的两天，她画了自己的面孔和一条缠着她的头的蛇。晚上，她睡醒的时候，发现自己浑身颤抖，她还看见一个大象面孔的红色怪物，那怪物把手指放在她的前额上。她还梦见画布上的眼睛变成了真的眼睛。第二天早上，她开始画一个红蓝色的男人，并画出那个男人在治疗她受伤的头部。她还画出那个男人生出一个孩子。</p><p>又有一次，她画了一个红色章鱼，在极度惊喜的状态下，她画了一个头安在一个黑色头颅上的情景。画完这幅画后，她有重获新生的感觉。</p><p>她画第三十三幅自然画的时候，又进入了忧郁状态，她觉得自己是被关在集中营里，这些都在她的画里反映出来了。之后，她画了一个蛋，有一个波浪形的人从里面出来，之后，她又觉得充满生命力，生命又变得完整了。</p><p>后来又有一次，她的腿有灼热的感觉，一直扩张到胸部和手臂。她发过烧，也发过冷，无法进食。她头部左右和眼睛后面都有痛感，而且血压升高。后来她左脚大拇指很痛，好像指甲被拔出的感觉，当时，她的拇指已经发红了，但并不是因为流血发红的。同时，她听力消失了一个小时左右，她以为自己要死了，医生检查后并没有发现任何异样的地方。</p><p>后来，她曾经有喉咙打开的感觉，但同时她也感觉呼吸困难，脑部压力加大。这些经历似乎和她练习瑜珈以及她的艺术工作有关。后来她开始教书，她感觉教书的工作可以帮助她稳定情绪。</p><p>怀师：这个人的经验和前面两个不同。第一点要注意的是，她是练瑜珈的。</p><p>第二点，她的颈椎有问题。第三点，她本身脑神经有问题，需要检查脑子。她的这些境界，按唯识来讲，属于第六意识的独影意识引起的作用。我们平时能够思想，能够把眼耳鼻舌身的感受综合起来起分别作用，能够讲逻辑，都是属于第六意识的分别心的作用，也就是一般人讲的意识的作用。第六意识的另外一面叫独影意识，又叫独头意识。</p><p>第六意识要起作用需要配合前五识（眼识，耳识，鼻识，舌识，身识）。比如我们看书，就有思想作用，晓得对不对，这是意识的作用。独影境界是独头起的作用，比如睡觉作梦，就是独影起的作用。梦中我们可以看到东西，可以闻到香味，吃东西有味道，被打了也有痛感，但实际上，肉体还在睡眠状态。所以意识境界里有眼耳鼻舌身的作用，这个独影的境界、独头的作用也都是意识的作用。现代西方心理学里面讲的下意识，或者叫潜意识，就是独影、独头意识的作用。</p><p>那么，在甚么状态下会出现独影境界呢?有三种情况，一是做梦的时候。梦境仔细分析起来就很多了，有的梦牵涉到来生，有的牵涉到前生。还有些梦是把过去前生，今生，甚至来生，乱七八糟像卡通片一样凑拢来一起呈现的。二是精神有问题的人，会出现各种幻象，那也是属于独影意识的作用。三是在禅定的时候。</p><p>所以有些真正打坐的人能够前知，知道未来；能够看到菩萨，看到各种境界。我们白天的时候也会有独影意识的作用，比如说白日梦。另外，好比说你在专心的看书，或者在办公室工作，忽然另外有一个思想、一个境界出来，那也是独影意识的作用。一般学佛修道的人，对这些都分不清楚，都是糊里糊涂的，所以禅宗祖师有两句骂人的话：「通宗不通教，开口便乱道」，只晓得打坐参禅，不懂得佛学的这些逻辑教理，都是在乱说；「通教不通宗，好比独眼龙」，有些人佛学讲得很清楚，唯识也懂，但没有真正禅定修持过，那是没有用的，甚么都不能真正看清。</p><p>现在回过头来看看这个案例。这位女性生理上有病态，脑子有问题，但也不是大病，只是她的脑神经感受与一般人不同，脑皮质层有问题，所以引发了独影境。她画的那些画都是独影境界的，那些画面与她前生的经验，甚至小时候看过的漫画、卡通等都有关系。</p><p/><p>案例四：心理学家（女）</p><p>翻译：小的时候，她参加了一次宗教色彩浓厚的夏令营。这之后，她就开始感觉到，自己与上帝，与自然万物，是一体的，这种情况持续了大概一年左右。长大后，她经历过好几次严重的忧郁症，其中有一次，情况很严重，她不得不住院治疗。一九六O 年和一九七O 年她两次企图自杀，每次都是几天昏迷不醒。</p><p>一九七二年，她开始参加超级冥想静坐，这对治疗她女儿夭折的创伤有所帮助，同时，也治好了她的哮喘病。她练习冥想静坐六个月左右，又停了六个月，后来又恢复静坐。不过她换了静坐的方法，采用了佛家「观」的法门，观自己的呼吸、身体的感受和思想念头。</p><p>慢慢的，她静坐的时间越来越长，到了一九七四年的夏天，她每天都静坐三到四个小时。这时，她开始感觉到自己静坐的功夫越来越深入了。有一次静坐，她觉得很混乱，不知道自己是在何方，她开始感到一丝恐惧感。之后，她的左脚大拇指的底部突然感到刺痛，痛感像水波一样慢慢沿着腿往上传播。然后她的左边骨盆和海底感觉化脓发胀。当痛感传播到腰部的时候，她的身体突然剧烈的向右转。</p><p>在她的腹部，她清晰的感觉到自己要救度众生的愿望。产生这种想法之后，一股凉丝丝的感觉从头顶降下，一直传到胸，双肩，和双臂。同时，她还会告诉自己，「我还没有准备好!」这种情形发生于一个小时的静坐以后，延续了十到三十分钟。</p><p>几个月后，她闭关了一段时间。闭关期间，她又感觉到自己的身体被一股强大的力量所推动。然后，她感觉到，同时也「看」到，骨盆部位有像喷水池一样的光束一直通到她的头部，同时，她觉得自己的身体在中部被分开。</p><p>一九七五年，一位西藏大师说她的能量流偏于一进，于是她开始用西藏观想的法门。此后，她开始体验到身体不同脉轮（能量中心）的打开与关闭。同时，打坐时头部和喉部会有呲哧的响声，白天有时也会有这种现象。能量流和痛感一直持续了很久，到了年底的时候，她每晚又可以睡到三到四个小时了。</p><p>有一次，她在梦中见到沙哇目坦那达（Sawami Muktanand），于是她就去请教他。他教她一个咒语，并叫她注意头部，不要注意身体，就像作「观」的法门那样。之后，她身体动得更厉害了，但是痛感和恐惧感减少了，同时，静坐时的乐感和喜感增加了。她后背的下部和手的跳动和发热的现象也增加了。</p><p>她开始发现，自己身体比较强壮的一部分会阻碍她成长和心理成熟。直到一九八七年，她才真正开始解决自己儿时的不幸经历对她的心理所带来的创伤。</p><p>最近，她那个「拙火头痛」（伴随拙火修持而来的头痛病）的老毛病一直没好，但是她以前感受到的那股能量似乎消失了。她现在和很多活着的，以及已经去世的老师们保持着精神上的联系。她的心理特异功能现象有所增加，而且她现在开始给人作特异功能治疗。</p><p>怀师：这个案例与前面的又不同。她的一些经历可以说是前生习气带来的，但是很可惜，她不知道空的道理，不知道把念头空掉、观心。如果有一个懂得空，懂得般若的人，指导她走禅定的路线，她进步会很快。当然，这本身也需要般若和般若的功德。在生理方面，她脑子还是有点问题，颈椎、腰椎、和坐骨神经一带有问题。</p><p>蔡先生：她为甚么能给人治病?</p><p>怀师：这是因为她的意识观念，你们动一动念头的话，也可以给人治病，有时候注意力就可以给人治病。所谓治病，并不是说可以把病根治好，而是说对当时情况有点帮助。所有的气功治病也都是这样，不可能根治的。</p><p>包卓立：那位印度大师的讲法对下对?</p><p>怀师：不一定好！按禅宗来讲，那是头上加头。不过，一般的密宗喇嘛跟一般的老师一样，用的都是这些办法。空的道理是最难懂的道理，一般人哪里知道!我不是给你们讲过，空能破一切法，能生一切法，空能包含一切法吗?</p><p/><p>案例五：电脑专家（男） </p><p>翻译：他现在二十几岁。九岁的时候，他的生殖器和下腹部突然疼痛，晚上，他感觉到有一股很强的力量沿着他的喉部向下压。医生暂时诊断他是低血糖。十岁出头的时候，他和朋友们试验催眠术，他发现很容易就可以让自己与现实脱离。十六岁那年，有一天，他正静静的坐着，突然，他开始不能自制的浑身抖动，而且恶心，然后他弯下腰，之后，这个现象就慢慢消失了。第二天，也是静静的坐着的时候，他有了一次阴神出窍的经历。更早的时候，他也有过一次轻微的阴神出窍的经验。这一次不同，他可以在房子里自由移动，可以清楚的看见自己的身体。他很吃惊，赶快抖动自己的手臂，于是灵魂就又回到身体里面去了。几星期后，他的世界完全崩溃了，曾几次退学，他觉得自己要发疯了。</p><p>后来，有一次，在作尾骨按摩的时候，他感情冲动，开始嚎啕大哭，身体颤动。突然，他感到一股强烈的能量从海底沿脊椎骨向上移动。这股能量到达头部的时候，他头颅内有一种空无边的感觉，同时，前额似乎被开了一个洞口，头颅内部看到五彩的光线。前额开口后，他感觉到一股强气流从洞中流过，之后，在空无边中，他感受到无穷的祥和。他以为自己悟道了，后来，一位禅师告诉他，他不是悟道，他当时是处在一种三摩地的状态。</p><p>十八岁的时候，他腹部神经网（Solarplexus）十分疼痛，他让自己的身体随当时的感觉作出各种姿势，然后，疼痛就消失了。后来他才知道，那些姿势都是一些特定的瑜珈姿势。所以，他开始参加瑜珈班，练习呼吸控制等。直到现在，他每天还花两个小时练习呼吸控制的法门。他希望通过练习瑜珈可以恢复自己的三摩地境界。同时，他还开始读一些修行方面的书。</p><p>五年后，他发现了达·拉夫·阿难（Da Love-Ananda）的著作。学习的过程中，他感觉到自己的腹部充满，肚子发热。他很吃惊的发现，他的腰围（girth）扩大了四英寸，但是他的体重并没有增加。</p><p>很快他就成了达·拉夫·阿难的学生。他开始发现，自己之所以参加大负荷的瑜珈训练是因为他对死亡的恐惧，以及他减少生活压力的愿望。他意识到自己并没有悟道，因为他还有很强的自我观念，而悟道最重要的前提就是放弃我执。</p><p>后来，他第一次正式跟达鲁拉夫·阿难学习静坐。看着老师在上百人前面坐着，他突然有一个邪恶的冲动，他想毁掉老师!</p><p>李居士、包卓立：我们也曾经有过想杀老师的经历。</p><p>翻译：他几乎无法控制自己这个毫无理性的冲动，这时，老师与他两眼相视，他马上就回到了那个熟悉的喜乐和无边无际的境界，不过这一次不同，他觉得与老师完全合一，共同熔化在爱（和慈悲）之中。</p><p>怀师：爱与杀都是魔境!</p><p>翻译：他第一次有这种与另外一个人在完全的爱中合一的境界，这时，心中起来一个念头：我应该告诉太太这个经历，这个想法一出现，那个境界就消失了。慢慢的，他与老师的关系越来越开诚布公，对老师的信任也越来越深，但是，有时候，他还是会认为，这一切都是他自己的功劳。有一段时间，他有意玩弄自己的能量流。有时，他会让自己进入阴神出窍的状态，不过，很快他就知道这是在自我满足。现在，他时刻提醒自己要把与老师的关系恢复到自然的状态。偶尔，他还是会害怕，但那种恐惧的程度比以前小很多，他现在慢慢能够把自己从恐惧中解脱出来，让自己处于喜乐和平和(equanimity)的状态。</p><p>怀师：这个案例和前面四个又不同。这个人前生修行的根基，比前面四个人都要好一点。他的经验接近于真的拙火发动了，但也还不完全是，所以他能够打开顶轮，但是他的三脉还没有完全打开。他的顶轮、眉间轮打开过，所以他的三摩地接近于空无边处定。那位老师告诉他，他的经历是三摩地的境界，不是悟道，这个讲法是对的。老师和他的缘份不够好，而且老师还不够高明，否则，在那个空无边处定的时候点他一下，他就可能会悟道了。他后来的经历都是拙火的余波，如果真有般若智慧，福报也够的话，很容易就可以发起拙火，也可以得定，可以悟道。</p><p>对一般人来讲，拙火发动往往会性欲增强，一般人都不会转化这种能量，都被自慰或性交消耗掉了，很可惜。这几个案例都没有讲到他们的性行为，这是一个缺憾，「饮食男女」是修行的两个重点问题。</p><p>包卓立：以后的案例会讲到这一点。老师，前面三个案例里的人都有燥热的感觉，这是为甚么?</p><p>怀师：那些燥热的感觉不是拙火，是虚火，就是中医讲的五行的火。如果你懂得中医，你就知道，火就是阳气，火的本性又分阴阳。太阳的火是真阳，等于人生命和婴儿身上的暖（不是热）。西医讲的发炎，中医讲的虚火，也是火，但那是阴火，不是真阳。太阳热能、柴火热能是阳火，瓦斯是阴火，瓦斯没有燃烧以前是冰的，可以冰死人。</p><p>包卓立：为甚么这些人感觉发热而不是发冷?</p><p>怀师：发热就表示是发炎，有阴火；有时发烧的时候，皮肤热，里面发冷，表示火力没有了。</p><p>李居士：当我感觉五心烦躁的时候，肚子里面是冰的；当我打坐坐得很好的时候，会吐出冰气，里面慢慢会有暖气发动。</p><p>包卓立：一般人没发动拙火也能有很热很热的气，那种情形是不是一半风一半气?</p><p>怀师：那说明他的拙火不稳定，真正的拙火，按佛经来说是暖、顶、忍、世第一法。你有点热的感觉，那只是开始，还不是真的拙火发动。</p><p>包卓立：为甚么气脉打开的时候会有很痛的感觉?</p><p>怀师：那是因为，我们身体内部已经不是婴儿状态，经过几十年的积累，内部有很多阻塞。气脉要打通时，就像打通水管一样，要把坏的打掉才行。</p><p>包卓立：之所以会有幻听的情况，是因为后脑有问题还是别的问题?幻听是因为气在脉里流动还是因为气在血里流动?</p><p>怀师：不仅仅是后脑的问题，前面和其它地方也有问题。气既在脉里流动也在血里流动。比如说普通男女性交的快感，是像下雨一样沉下来，没有升华。如果升华了，真正的快感是在脑部，不是下面。气脉打通了，头脑有了乐感以后，下面的快感就看得很低了。</p><p>包卓立：男性性高潮时，整个身体都有感觉。</p><p>怀师：女性真到了那个功夫，跟男人是一样的。</p><p>李居士：有时候乐感是从会阴发动，有时候从子宫，感觉子宫会收缩，好像有小孩子在里面动一样。</p><p>怀师：男性和女性还是不同，在性欲方面，男性很容易冲动，女性就不大容易冲动。拙火一般人都可以发动，可是，由于习气的原因，只要一发动，他的第六意识就会配上男女性交的那个欲的观念，结果那个拙火发动就变成欲了。如果乐感不配上欲，就可以解脱，得「离生喜乐」了。精虫和拙火有关系，也没有关系。对男性来讲，拙火的功能引到两个睾丸，在交媾高潮的时候，精虫就会出来了。如果拙火发动到了睾丸，没有配上欲，就会炼精化气，就不会变成精虫了。</p><p>女性生殖器就像莲花一样，到了高潮的时候子宫还会张开，但是性感的地方不一定是子宫，有些人是外生殖器敏感。高潮时，脉打开，莲宫打开，有分泌液流出，这个分泌液不一定是卵。不管是男是女，这个流下来的液体都是由于快感刺激脑下垂体，变成另外一种液体而来的。一般人高潮的时候，真正的头脑智慧部不会用的，头脑都是迷迷糊糊的，都有独头意识的境界。入定的时候是「乐、明、无念」，是明白的，和性爱高潮的情况相反。</p><p/><p>案例六：艺术家（女）</p><p>翻 译：这位女性现在快六十岁了，修习超级冥想静坐将近五年了。静坐后，她的手臂开始振动，手掌开始发热。接着，她连续几天都无法入睡，身体内部充满了能量。还有几次，她感觉到自己的意识与身体分开了。她脑子里面一直听到一个很强的声音。后来，她的脚拇指痉挛，大腿抖动，一夜之间，脚指甲就黑了，好像被锤子打了一般，最后，脚指甲脱落了。大腿的肌肉组织振动得很厉害，这种振动的感觉沿着身体一直传到头部，额头好像有一条带子绑着一样。接着，她的头也不由自主的摇了起来，身体也摆动起来，舌头则自动的顶着上颚。</p><p>这些现象与瑜珈练习法门很有关系，舌顶上颚是瑜珈练习法里面最秘密的法门之一，很多修习瑜珈有成就的人，使用的就是这个方法。这位女性没有强迫自己的舌头往上弯，她的舌头自然而然的就顶住了上颚。</p><p>她的脑子里同时还会自然的发出「嗡」的声音，这个声音是印度教里面最神圣的声音之一。振动一直通过颈部传到头部和面部，两鼻孔也受到影响，她觉得自己的鼻子似乎变长了。两个眼珠可以各自独立的转动。</p><p>怀师：这种现象叫「象王视」，就是两眼同时向外看的意思。</p><p>翻译：同时，她觉得自己两个瞳孔好像是头里面的两个洞，在脑中心交会在一起。</p><p>怀师：对!</p><p>翻译：后脑和整个头颅骨以及前额都可以感觉到很大的压力，这种感觉在读书的时候尤其严重，甚至会导致眼睛不舒服，头顶会有跳动的感觉。接 着，她感受到一股强光，并有乐感，人还会大笑。振动一直传列嘴和下巴，这之后，她就开始梦到天堂的音乐。后来，这种感觉传到喉咙、胸部和腹部，最后，振动传播的路线慢慢形成了一个像鸡蛋一样的封闭的团圈，能量沿着脊椎骨向上移动，然后从身体的前面流下来。俊来，她能感觉到身体的一些能量中心被启动，这些中心分布于下腹部、脐部、腹部神经网（solar plexus）、心、头、以及喉部。整个圆圈形成的过程中，她觉得有能量从脐部进入她的身体，圆圈形成后，就不再有能量进入身体的感觉了。整个过程中，性欲都很强，她很自然的都在作一些瑜珈呼吸（控制呼吸）的法门。</p><p>这个拙火发动的现象持续了几个月。后来她只是偶尔经历过一些拙火的现象，一般都是在打坐的时候，或者是在床上静静的放松的时候。她以前曾经读过一些有关拙火的书，她知道自己的经历是拙火发动的一种现象。开始的时候，她很放松，任其自然发展。俊来，这种经历影响了她的日常生活，能量的流入白天晚上都有发生，影响了她的睡眠和工作。她觉得自己好像与生活分离开了，变成了自己日常活动的一个观察者而已。</p><p>后来，她的身体的感受都恢复了正常，只是头部还有压力的感觉，她觉得自己和那个更高的自我的联系越来越深厚了，那种感觉，就好像找到了一个不被日常生活的上上下下所影响的本质、本体、或者说中心。</p><p>怀师：这个人的气脉发动的情形比前面几个人正确一点，有点像道家讲的任督二脉打通的现象。她最后头部还有压力，她还有身见，说明她的顶轮和梵穴轮还没有打开。在 这个过程中，她没有睡眠，那其实是好现象，修道本来就是要断除五盖：财色名食睡（一般又说五盖指：贪欲盖、瞋恚盖、睡眠盖、掉悔盖、疑盖）。所谓五盖，就是说把你盖住了，是道业的障碍。很多人断除了睡眠，结果他反而害怕了，以为失眠了，这是观念的错误，会影响心理。</p><p>最重要的是，她缺乏般若，所以不知道大小乘佛法真修的理论和修证程序。</p><p>包卓立：为甚么她的舌头会自动抵住上颚?</p><p>怀师：任脉打通自然就会这样，这是生理的自然反应，不过她还是初步。她之所以能这样，是前生习气带来的。开始的时候，我们是作意把舌头抵住上颚，到后来就自然会抵住上颚，任督二脉在那个位置接上。真到任督二脉打通的时候，舌头还要往下拉。</p><p>包卓立：为甚么她会觉得自己和身体分开了?</p><p>怀师：这也是自然的现象，是前生修行带来的，接近于初禅的「离生喜乐」，可是她不知道，就这么浪费过去了。那么后来她怕影响工作，就又退步了，如果她真肯专修，还是可以进步，可以很快恢复起来的。这叫「功不唐捐」，你过去修出来的功夫，不会白白丢掉的。不过依我看，在现在这种现实的社会，没有人真肯学习出世法，跳出这个世界。</p><p/><p>案例七：科学家（男）</p><p>翻译：这个人现在已经六十多岁了，他一九六七年开始练习超级冥想静坐。 静坐五年后，他在打坐和睡觉的时候会全身动，这种情况持续了几个星期。几个月后，他小腿有振动感，脚大拇指痉挛。振动传播列背部，同时他「看见」背部有红色的光。慢慢的红光变成了一个竿子一般，一直沿着脊椎骨往上移动。移到头的时候，他看见脑子里面有白光，白光慢慢变成一个光束，从头顶出来。他的右臂和左腿都会抖动，当他把注意力放在这些部位的时候，抖动就消失了。有一次，他把注意力放在头的中间，结果就开始痉挛。他还听到过高频的「嘶嘶」的声音，有时，他会听到音乐声，也感觉过平和和乐感。</p><p>后来，由于身体不由自主的运动，他的睡眠受到影响。他有时会自然的做一些瑜珈的姿势和瑜珈呼吸。振动会传播到整个面部。振动传播到盆骨的时候，会激起性欲。</p><p>一年后，晚上头部会有压力，并向下移动；同时，胃部会振动，并一直往上移动。两种感觉在喉咙部位相会，而且喉咙部位似乎形成了一个洞，有很多声音从洞中发出。他的这种感觉似乎是在很遥远的地方感受到的。六个月后，这种感觉从喉咙部位移到了腹部，后来又移到了骨盆部位。</p><p>怀师：这个人的经历很普通。因为他年龄比较大，气脉很难发动，以中国道家的话来说，他的气脉没有归元。他 之所以听到声音有两个原因。第一，气脉走到后脑通过两边的听神经和视神经，因为走不通，所以会发出声音。就像普通人，感冒伤风的时候，偶然气脉不通，就会有耳鸣的现象。第二，在正常定的境界，有时也会听到声音，实际上，那是我们内部血液流动，呼吸往来，心脏跳动的声音。入定的时候，这些声音听起来也是很大的，这是正定的境界，一般人是听不到这种声音的。</p><p>那么，他感觉好像在很远的地方看自己，这种现象一般有两种情况：第一，他是年龄大了才开始修，精气衰弱，所以会这样。第二，对于真正修禅定的人，这种分离的感觉是进入初禅离生喜乐的前奏。两种情况不同，但是很难说明。正禅定分离的现象会伴随着清净充实的感觉：相反的，年纪大的人，或者年轻有点衰弱的人，虽然也清明，但有一点阴阴的感觉。这是勉强对这两种情况作一个说明。</p><p>前面这些案例里面介绍的这些现象，没有什么好与坏，如果懂得佛法般若空的道理，这都是好事。这些现象都是偶然经过的-个过程而已，不执着就是了。</p><p>包卓立：与前面几个人比起来，这个人身体运动多一点，为甚么?</p><p>怀师：每个人的身体禀赋和心理状况不同，所以反应就不同。好比说，各人的心量大小，嫉妒与否，脾气大小，等等，都是因各人业力不同所带来的。即使是双胞胎，看起来很像，其实也是不同的，这就是业力不同，仔细讲起来就很多了。你看，世界上几十亿人口，都是两个眼睛，一个鼻子，这么简单的几个东西， 脑子里而也都是装的脑神经，但是每个人都不同，这就是各人业力不同带来的。</p><p>同样的道理，由于各人业力不同，同样是打坐，每人动的情况不同。好几个案例都讲到，他们虽然没有学过，可是自己会作各种瑜珈的动作，那是因为最开始的时候，最原始的瑜珈和道家的那些拳，都是气脉自然发动以后自然有的姿势，每人情况不同，慢慢就发展成不同的流派了。</p><p/><p>案例八：演员（女）</p><p>翻译：这位女性四十出头，孩重时期曾经有过很多特异功能经历。少年时期，她常有偏头痛的毛病，精神混乱，和突然的冲动怪异行为。</p><p>怀师：她的一些奇怪行为没有具体讲，其实这都是关键性问题。</p><p>翻译：为此，她作过心理治疗，被诊断为分裂性幻想症(schizophrenic)，但没有住院。二十四岁的时候，她开始用各种方法静修。大约一年以后，她头痛得更厉害了，但是过了几个星期，她的精神混乱和怪异行为就停止了。</p><p>不到一年时间，她腿部开始振动，这种感觉一直传播到手臂和胸部。几个星期后，这种感觉传播到了颈部，后脑，和前额。静修的时候这种感觉会更明显。有时，她整个的身体，尤其是手掌，会感觉到热。静修的时候，她会摇动，痉挛，还会焦急。后来，拙火周期又发动了。</p><p>包卓立：他们大部分人并不真正了解拙火的意思，只要有这些经历，就误以为是拙火。</p><p>翻 译：有一次，她静修的时间比较长，她开始对自己的喉部有了新的认识。她似乎觉得头与身体分开了，喉咙开始自己发出声音，她觉知到，还有一个正在观察着这一切的「我」。这个经历相当于喉脉打开，这之后，她大部分的拙火现象都消失了。</p><p>包卓立：为甚么她觉得自己的头会浮在身体上面，和身体分开?</p><p>怀师：那是因为，气通过后脑走不通，气下不来。而且她可能脊椎骨有问题，也许她还有慢性支气管炎。</p><p>翻译：之俊，她静修的时候，一般都很安静很平和。她说，通过静修，她的工作效率和满足感都增加了。</p><p>讲到这里，作者提到一位有特异功能的英国人，叫曼宁。他小时候就会看见东西动，其实他自己没有动，可是他会觉得东西在动。这种情况一直持续到有一天，他发现自己可以不用思索就自动的写文章。很快，他发现，他可以像一些历史上很有名的画家那样画画，而且只要十到二十分钟就可以完成一幅作品。后来，他就做这个工作，他也不再看见东西动了。</p><p>怀师：这位英国人，能看见东西动，那是因为他的视觉神经不稳定，应该去检查脑科。后来，慢慢传到左脑神经去了，所以他思想特别多，视觉神经反而稳定了。他的思想神经很快，在中国医学中，这叫「感传」。</p><p>包卓立：那些动的东西是不是我们平常人讲的鬼，还是说他的气不对? </p><p>怀师：看见有东西在动，可以说是因为气的原因；但是，有的时候，确实是有东西在动，要仔细考察才知道到底是那种情况。一般情况下，很少真是鬼动，所以中国有句话：「魔从心造，妖由人兴」。以唯识学来讲，他的这些经历属于独头意识所造的独影境，如果是带质境就可以挟带物质了。有时候，黑夜里，我们看见一个人坐在那里，其实那是一张椅子，上面放了一个皮包，挂了一件衣服，是我们看错了，这叫做假带质境；我们的身体是真带质境，是阿赖耶识本质所呈现。</p><p>包卓立：有些小孩子听到有人敲门，出去一看，并没有人，这是不是也是他自己气动引起的?</p><p>怀师：对。但是有时候也真是有感应，是真的。</p><p/><p>案例九：心理学家（女）</p><p>翻译：一九七三年，她四十一岁，当时，她已经能感受到头部和胸部的热感，静坐时她身体和头还会振动。另外，当她把舌头抵到上颚的时候，会有性高潮一样的乐感传遍全身。她修习静坐已经很多年了。她 胸部和喉咙处经常感到热，里面也会参有冷的成分。她觉得自己的身体的形状像一只鸡蛋。振动从骨盆开始，然后通过背部传到颈部，胸部觉得很软很开阔。有一次静坐的时候，她觉得自己是一个很大的心。有时她全身会有痒痒的热的感觉，她没有为这些经历感到不安，因为她认为，这些经历表示她的静坐是有效的。</p><p>一 九七三年，这种「拙火现象」发生后几个月，在静坐时，她觉得自己变高了几英寸，而且她觉得自己的眼睛是从头上面往外看。这时，她自信她能够知道别人内心的想法，后来很多经验证实了这一点。</p><p>后 来，她开始脚痛和头痛。她注意到，如果她想要控制能量流在身体内部的运动，头痛会加重。按摩对脚痛的毛病有帮助，但是，她走路仍然很困难，甚至无法开车。她吃得很少，睡眠不稳，还会恶心。讲话很困难，有时她甚至怀疑自己的经历是否真实。她 背部的一边感到热，她自己认为，如果另外一边不感觉到热，情况会很危险。后来，她想办法做到了这一点，她心里的恐惧就消失了。后来，她开始感觉到振动，这种感觉一直从骨盆传播到颈部，她开始看见头里面有光。后来，此光顺着脊椎骨往下移动，能量和振动的感觉一直传到了前额，并在下巴处集中。她觉得头顶有个洞，睡眠变得很困难，静坐成了唯一能帮助她的事情。她自己觉得，如果她不继续静坐，身体内部的热能会毁坏了她的身体系统。当别人触模她的后背底部时，确实发现温度很高。</p><p>后 来，她身体开始抖动，身体内部有波动的感觉，觉得身体被清洗，身体变得更平衡了。不久，她觉得脸颊和下巴有剌痛（针刺）的感觉。这之后，所有的令人不舒服的现象都消失了，不过她还是一直坚持静坐。她的这个拙火经历持续了一年左右，后来她成立了一个中心，帮助其它修习拙火遇到问题的人。</p><p>怀师：关于这个人，有三个结论：一、她身体有先天性风湿，所以会觉得热。另外，她神经很紧张。二、因为她是学心理学的，用心太多，都在意识状态的境界中。三、有些境界满好的，但是都是下意识的自导自演，通过意识引动身体上的气脉。然后反过来，身体上气脉的感受又引导她心理意识的开发。按正统佛学来讲，这都是意识自我产生的现象。</p><p>包卓立：前面案例中，好几个人都可以在脑子里面看见光，为甚么?</p><p>怀师：这是身心摩擦引起的。</p><p>包卓立：为甚么她觉得比平常高两英寸?</p><p>怀 师：那是因为气不归元。有时候人会觉得变高，有时候是变小，有时候觉得身体可以扩大到充满整个宇宙。这都是身体上地水火风的变化所带来的意识思想的独影境界。</p><p/><p>案例十：图书馆员（女）</p><p>翻译：她现在五十多岁，静修很多年了，但她都是按自己的方式静修的。一九六八年的一天，她把手放在桌子上，慢慢入静，后来就失去了知觉。等她醒来的时候，发现双手把桌子烧焦了，留下了深深的手印。这种现象只发生了一次。</p><p>怀师：她身体病态严重，也是风湿的一种。</p><p>包 卓立：为甚么风湿会令人产生热呢?</p><p>怀师：我们身体是由地水火风组成的，但不是完全平衡的，会偏重某一种。以风湿来讲，就是风和水比较多，火大的成分比较少。西医认为风湿是因为血液里面不干净，等于水管浑浊，风力推动不够，血液不能正常运行，动得很慢。风湿会发生热，这个和瓦斯的道理一样，瓦斯很冷，是阴的，但是会燃烧，会烧到很高温度。</p><p>包 卓立：因为这种会燃烧的拙火经验，有人害怕静坐时身体会突然起火，所以很多人害怕这种拙火训练。</p><p>怀师：之所以会燃烧是因为身体上的病态。</p><p>包卓立：有的人已经死了，可是突然身体自己会烧起来，但是衣服并没有烧。</p><p>怀师：这也是因为他有病。不过，也有外面的因素。</p><p>包卓立：西方人不认为是气引起身体里面的波动，他们认为是能量，所以他们只是说身体内部有波动现象。</p><p>翻译：这本书的作者曾经和很多有类似经历的人打过交道，他发现很多人在做完这些修炼之后，身体不能完全恢复，身体的某些部位不能很好的工作。</p><p>怀 师：那是因为他们身体不够健康。另外，他们很多人走错了路，如果走对了路，不应该是这样的。这 个作者叙述的时候兼带有一些评论，但是他的程度很低。</p><p/><p>案例十一：家庭主妇</p><p>翻译：一九七二年，她五十多岁，经历了一次很令人不安的事情：她突然觉得有一个甚么东西从她的头上降落下来，之后，她就晕倒了。这种现象重复了好几次。一般在这种情况下，醒来后，人会有不稳的感觉，但是她完全没有这种问题。</p><p>有一次，她脑子里面好像有一个声音在问她：「你准备好了没有?」之后，她又听到音乐声。有一天下午，她突然觉得左脚大拇指痛，痛感一直传到胫部，她可以感觉到膝盖在自我治疗。痛感时断时续，但是她无法走路，只好在床上度日。在床上的时候，身体自然的会作出不同的瑜珈姿势。</p><p>几天以后，她可以感觉到，自己身体从脚到背部的各个部分都在作自我治疗。在这个过程中，她鼻子的两端会有痛感，能量流和振动的感觉一直传到颈部。同时，背部有强烈的热感，头部好像被老虎钳子夹住一样有压力感。由于身体内部的能量流的关系，她有时不得不像叹气那样呼吸。</p><p>偶然，她的头和颈会扭动，能量流进入她的头，她的头盖骨会发冷，面部会发热。经 过大约三年的时间，她慢慢觉得自己是上帝选出来，重获新生的一个更高级的人。于是她认为她所经历的这个非人力的现象是她个人能力所造，她觉得自己比一般人优越。她认为别人应该能完全理解她所说的话，并且亳无保留的接受她的意见，她慢慢的开始怀疑任何与她不同意见的人。</p><p>怀师：这个案例很简单。她是一位正常的女性，由于处于更年期的年龄，所以有这些现象。她的颈椎骨可能有点错位。她的那些经历都是一些生理、心理感受的状态，与静坐、禅定都不相关。按中国道家的说法，女性每七年是一个周期，二七十四岁左右，第一次月经来；到了七七四十九岁就是更年期了，月经也会断。具体个人，会稍有不同，有人提前几年断，有人迟后几年断。</p><p>这位女性的经历，是更年期的现象，不是拙火发动。因为受宗教意识的影响，所以她觉得自己与众不同。女性在更年期的时候会发生很多心理和生理的变化，而且还会有很多病，都是医学里很难治疗的。有人平时很小气，可是到了更年期却有可能变得很大方；有人本来很保守，跟男人谈话都会脸红，可是到了更年期，她可能甚么都敢做。更年期的心理和生理是互相影响的。</p><p>男性是每八年一个周期。男孩子二八一十六的时候是发育期，两个乳房会痛，等于女性第一次月经一样。男性更年期是七八五十六岁，有人会一直延迟到六十四岁。到了更年期，男人会变得古里古怪的。有些男人一辈子都很规矩，到老了，却开始讨姨太太，找情人，搞得一塌糊涂。在台湾，这叫「老来花」，其实，这都是更年期的现象。</p><p>并不是说，更年期到了，就是老了，完了。其实，更年期是另一个生命的开始，男女都是这样。以道家修道来讲，最好是经期没有断，没到更年期以前就修成功，修到长生不老，成神仙。假如是月经断了以后修，就需要加倍的努力，先要修到月经来，然后再修到月经断，不是天然的断，而是用功夫断，在道家这叫「斩赤龙」。月经就像一条龙，硬是要把这条龙斩断。斩断以后就不分男女了。书里没有交代她婚姻感情如何，也没有交代她性生活如何，资料都不全，没有办法作全面的分析。</p><p>包卓立：是停经以后更容易发动拙火还是停经以前更容易?</p><p>怀师：对心情宁静的人来讲，停经以后反而更容易发动拙火。比如有人更年期以后反而比年轻时还容易性冲动，一般人都忌讳讲这个，很多医生也不懂。我年轻的时候，读过一本书，描述的是乾隆以后的一个故事。</p><p>有一个寡妇，儿子考上功名，在地方作县令，突然老太太说要嫁人。这可不得了，儿子是地方官，妈妈临老了要嫁人，你说这可怎么办?儿子很孝顺，告诉妈妈说：「我给您找。」可是左等右等，都没有找来。妈妈每天在那里催，怎么还没有找来?痛苦万分。儿子向一个医生请教，医生说：「这个好办，我可以把她医好。你回去告诉她，人已经找到了，不过她要穿上新娘衣服，骑一头驴，嫁过去。然后，你给我找一头驴，越瘦越好。驴子瘦，背脊骨就会一块块突出来。」儿子照办了。老太太很高兴。儿子叫妈妈骑在驴上，自己牵着驴在后花园里转了几十圈，老太太清醒了，不要嫁人了。因为经过那个瘦驴背的磨擦，荷尔蒙释放掉了。这个医生的办法真是高明啊！这是我看医书，在医案里看到的。</p><p>所以更年期以后的男女性，还有这样的生命力，把握得好的话，经过修炼可以延年益寿，也许可以成道。实际上，道家的代表人物吕纯阳真正成道是七十多岁。张三丰，就是那个教人太极拳的，他到三百多岁才成道。所以，你们还希望无穷啊!</p><p/><p>案例十二：心理医生（男）</p><p>翻译：他现在四十岁出头，练习静坐已经有三年时间了。一九七五年的时候，他拙火发动，曾作我们的研究对象，试验磁场对人体的作用。他一生下来，脊椎骨就有问题，曾作开刀治疗，后来也就患了慢性背痛（背部的下面）的病。</p><p>一九七五年十二月，他参加了沙哇目坦那达（Swami MUktannanda）在一个周末举行的集训班。沙哇触摸他以后，他进入了很深的定境，不到十分钟，他的嘴自己就张大了，舌头伸出来。几分钟后，他体验到一种充满乐感的宁静，并且看见很多画面，画面中，沙哇上师帮助他和上师融合为一体。几分钟后，他可以「看见」自己腹部、胸部和喉部被一股金色的能量所照亮。然后，他的背部的下面开始感到很痛，同时，他脑子里面的白光也变得越来越强。静坐完了的时候，他背痛的毛病就消失了，而且再也没有复发过。</p><p>这 次经历以后，他在家里的静坐也变得很有效。静坐的时候，他似乎很快就可以解决自己感情心理的深层问题，还可以找到解决问题的方法。</p><p>一九七六年（次年）一月中，他身体上开始出现红斑，而且那些红斑呈弯弯曲曲的线状。最开始的时候，红斑是在他背的下部，两次穿过背脊骨，一直延伸到左边肩膀。他想，这也许有甚么特殊的意义。这时，他静坐的时候，开始重新听到一些高频声音和搔抓的声音，以前他作试验对象，被磁场仪器刺激的时候，也有过类似的经历。</p><p>一月，他又一次参加了沙哇的强化集训班。沙哇又一次触摸他，马上，他的背的上部和颈部就有刺痛的感觉，同时还有冷热的感觉。他的喉咙发烧，头和脖子会自己动。之后，他感到内心平和喜乐。后来，他的头开始转动，手掌开始颤动。此后，他膝盖开始发烧，他觉得有一股东西沿着脊椎骨往上走，到了头部的时候，就变成光和能量了。整个过程中，他的呼吸都不稳定，有时快而浅，有时慢而深。整个身体内部好像在松开，他感觉似乎在生小孩子一般。</p><p>静坐快完的时候，他有很深的平和的感觉，他似乎深深的了解到自己的内心深处，觉得有了彻底的自由和解脱，而且有一种回家的感觉。第二天，他无法恢复到平时的状态。</p><p>怀师：这个境界过了以后就很难回转了。</p><p>翻译：同时，他无法集中精力，无法协调自己的一切。有好几天时间，他都觉得很累，很疲乏。他静坐感到越来越深沉。后来，一连好几天时间，他左脚大拇指和整个左脚都有痛感，痛感一直传播到小腿。后脑左边也有痛感，痛感一直延伸到左眼，有时，左眼会因此而自动闭上。几天后，这些断断续续的痛感都消失了，腿痛也消失了。</p><p>在 日常生活中，家里人和朋友都说，自从拙火发动以后，他比以前更放松了，他的按摩师也有同感。他那个「回家」的感觉慢慢变成了与世界合一的感觉。后来，静坐的时候，他的前额开始发痒，面颊偶尔也会发痒，这表明他的拙火周期在进步。</p><p>一九七六年底，他拜访了沙哇上师在印度的住所。在那儿，他每天静坐三次，一共四个小时，另外，他还会花三到四个小时的时间念诵。静坐的时候，他经常有爱的喜乐的感觉，而且经常会感觉到与知觉（意识）的蓝色光明合一。这种强力训练在第一结和第二结的部位激发了他的拙火能量。因此，能量的增加让他生殖系统进入了极度快乐的抽搐中。他觉得自己的精予沿着中脉向上移动。</p><p>他后来知道，这经历说明第一个结打开了。之后，他开始禁欲，他的脚指甲在同一个晚上都脱落了。从印度回来以后，他花了好几年时间，想把自己的日常生活和修行结合起来。后来，他的第二个结也打通了。 后来，他又回到老师在印度的居所，他觉得拙火的能量集中在自己的眉心部位。马上，沙哇就走过来，用手在第六结和头顶中间的地方触摸他，他感觉到拙火能量开始以V 形向头顶中心流动。自从那次以后，拙火能量几乎从来没有离开过他的头顶中心。</p><p>怀师：他说自己的气到了男性生殖器，身心发生快感，这个同道家讲的炼精化气有一点相似，但还没有达到炼气化神的境界。他所了解的理论是印度的那一套，所以他以为自己的中脉打通了，其实，他的中脉没有打通，是任脉打通了。</p><p>任脉和中脉很接近，他们之间的距离只有一张纸那么薄。印度讲的左、中、右三脉是在一个平面上，而中国道家讲的任脉在前面，督脉在后面。其实道家也讲左右脉，就是所谓的左青龙，右白虎，只是一般不太注重而已。他的心脉还没有完全打开，如果完全打开了，自己静坐的时候，会听到像爆炸打雷一样的声音，很可怕的。海底轮和脐轮打开的时候都不会有这种声音。他看见自己和老师合一，那也是他自己心理意识的感受。</p><p>包卓立：现在西方的很多学派都认为，修道成功的人可以看到一个很细的，像针丝一样蓝色的光，自己和那个蓝色光合一以后才算修道成功。这个案例中，他也看到了一个蓝色的光，那是从他意识里面来的，还是从任脉，或者督脉来的?</p><p>怀师：那个蓝色是中脉的气，中脉的气是蓝色的。那个蓝色就是「万里青天无片云」的那个青色，几乎接近于黑了，但也不是黑色，也不是偏绿色的蓝。那个颜色，就像你站在喜马拉雅山顶上看到的那个天，或者云南西边夜里的那个青天。</p><p>中脉真正打通的人，顶轮一定都打通了，自己会觉得空了，看见的现象是青青的天，满天星斗，天上的太阳月亮的运动都能「看」得很清楚。这个看不是用眼睛看，而是说你有那么个境界。这个人看见的蓝光是意识境界，是靠外面刺激引发的，他的中脉没有真正打开。中脉没有真正打开的人，也可以观想到蓝色，而且那个观想的蓝色可以扩大可以缩小。比如我们现在观想北京城，有的人想的是大的景象，有的人心很细，想的是家里桌子上的一支笔。观想到的蓝色也是一样的，都是意识状态，是假象。</p><p>这个人的腰脊椎有毛病，颈椎有毛病，骨节也有一些小问题，他背上的红斑是骨节毛病所引发的。他腰酸背痛的毛病之所以没有了，是因为气路从别的地方走通了，其实他的腰脊椎毛病并没有好。要想真正治好，他需要作骨节整形。</p><p>（沙哇目坦那达的老师）</p><p>包卓立：利用这次机会，我为大家介绍一下沙哇目坦那达的老师的一些情况。沙哇的老师很胖，不爱说话。在印度，作静坐的人有一个传统，打坐时甚么都不穿，只穿一件内裤。有人甚至内裤都不穿。这位老师名气很大，大家认为他把自己的一生完全献给了修行，都觉得他很神圣，所以很多人会来祭拜并给他很多东西。</p><p>有 一次，他打坐的时候，他的生殖器突然很有力量的勃起，结果把裤子都弄破了，他换了一件新的，结果还是弄破了。他觉得这样不太好，认为别人会对他有看法，所以想要离开那个地方。他太不好意思了，甚至想自杀。这个故事在西方很流行。</p><p>怀师：男性静坐好的人，元气发动了，生殖器就会硬起来，有时候甚至七天都下不去。这种情况下，如果不配上欲念，没有男女性交的心理，它还是会硬的，就像很健康的婴儿一样，睡觉的时候，他的那个小东西就会举起。这时，如果能静下来，配合这个生命的功能，回转来就可以刺激脑，就可以打开脑的气脉了。</p><p>不过，要作到这一点很难。</p><p>女性坐得好的话下面也会冲动，两个乳房会胀。女性性欲最开始敏感的地方是乳房，不是下面。这个时候，如果不配上性欲，下面的阴部会缩小，变成处女一样，那么（气脉）就打通了。这是第一关，道家叫这种情形「降龙伏虎」，龙虎下山是要吃人的，所以要降服它。龙代表思想，思想在脑子里面像个龙一样，静不下来，会到处乱跑。这位老师连降虎的本事都没有，其它都是空谈的。</p><p>包卓立：这位老师每次静坐的时候，红光一出现，就有一个女的会来，她会把衣服都脱光了，然后他的生殖器就会硬起来了。</p><p>怀师：那是外面的感应，真会有阿修罗、魔障来引诱他的。佛 经上有这么一个故事。跟从释迦牟尼佛出家的尼姑们私下议论佛，她们觉得佛大概是性无能，所以出家。另外，根据佛的像，虽然佛的男性生殖器很雄伟，但是像马一样，会缩起来，这在佛经上叫「马阴藏相」。你看马的那个东西很长，可是收起来后就一点点。佛也是，睾丸像婴儿一样收进去了。阿难听见尼姑们议论，很受不了。有一次，夏天，佛在睡觉，那个东西就举起来了，很雄伟，阿难故意把佛的裙子拉开。尼姑们知道了统统都跪下了，原来佛不是性无能。</p><p>包卓立：沙哇的老师本来想自杀，后来就跑到树林里的一个小茅篷里面去静坐。他发现里面有一本书，里面描述的情形和他的经历一样，还告诉人在那种情况下该怎么做。以后，他就照着书上说的，把精从下面引到头上来，这之后就没有甚么问题了。</p><p>怀师：密勒日巴祖师也有一段很有意思的经历。修道到最后的时候，境界中出现很多女性生殖器，大小都有，无量无数把他包围起来。他当然一点都不动心，但是，任他怎么念经、念咒、观想都降伏不了这些东西。忽然，他悟了，他把自己观想成人大小小的男性生殖器，每一个都插进去，然后，那些东西都消失了。</p><p/><p>（拙火的现象）</p><p>包 卓立：西方出版的关于拙火的第一本书就作了如下总结：第一，拙火发动的初期，人会有烧和热的感觉，一般是先从背部开始，然后传到整个身体。</p><p>怀师：这是拙火发动不正常的现象。按中国人阴阳的道理来说，这个火属于阴的，不是阳的，不是阳火。阳火发动是安详、暖和，很舒适的。以中医来讲，比如有人发炎，中医叫「相火游行」，不是君火。君火是阳火，相火是阴火。发烧发炎都是相火游行。相火又分虚火和实火，仔细讲起来就很细了。</p><p>包卓立：正常的现象是甚么呢?如何真正发起拙火呢?</p><p>怀师：真正的拙火现象是暖。唯一发起拙火的办法是「空」!其它都是有形的，往往引动相火。真正空了，才能引动君火。邵康节有两句诗，讲易经宇宙生成的道理，正好拿来形容拙火发动「天根月窟闲来往，三十六宫都是春」。比方讲，天根是梵穴轮、顶轮，月窟是子宫、海底，三十六宫代表身体上的所有部位。那么，上下通了以后，身体所有部分就都舒服了。</p><p>密宗讲的拙火是根据印度文翻译过来的，也叫灵能，灵热。这个翻译很糟糕，不如佛经上说的「暖」字。这 里他说，拙火发动的时候先从背部开始，这不是正规的，就好像说，从北京到香港九龙，他走的不是京九线，走偏了。其实，拙火发动不一定是从某一个地方开始，但比较正规的是从海底发动。当然，海底发动有一个问题，就像那个印度人一样，没有智慧的话，就不知道如何降伏那个东西。</p><p>包卓立：第二点，伴随着拙火发动，能量会进入中脉，会有痛的感觉，但这不是病态。</p><p>怀 师：普通人身体里面都有病，脉将通未通的时候会有痛触的感受，刺痛过了以后就会发乐感了。实际上，气脉通的时候不仅仅有痛触，还有冷热轻重、粗涩、滑、软等等，归纳起来是八触，八大种感受。如果要仔细分析，还不只八种。</p><p>包卓立：第三，拙火发动的时候，有人还有可能心律不整。</p><p>怀师：不是心律不整，心会跳动得很厉害。如果有「嘭」的一声，心脉打开了，那个智慧的开发就很不同了。前面讲的三点都很接近，但都不完全准确。</p><p>包卓立：第四，脚指头会有蚂蚁爬的感觉，有时，整个身体会抖动，好像有蚁或者一只小蛇往上爬。</p><p>怀师：所以印度翻译叫灵蛇。</p><p>包卓立：或者像小鸟在你身上跳来跳去，爪子在你身上抓来抓去：或者像鱼在平静的水中游动；或者像猴子在树枝间跳跃。</p><p>怀 师：这些都是外形现象，拙火发动是会有类似的外部现象，但这都不是真拙火。</p><p>包卓立：有人跳舞也能引动那个气，为甚么?</p><p>怀 师：很好的静坐可以引发生命的功能，很合适的运动也可以引发生命本体的功能。其实，一个艺术家画画，写字，跳舞，唱歌，或者一个科学家读书很专心一致，有时候也会发生这种现象，会突然快活起来，那也是进入了这个拙火发动的情形，但是一般人认识不清楚。</p><p>一个真正的思想家哲学家，当他进入那个思想精微的境界的时候，有一种很安静的乐感，他别有天地，甚至男女夫妻都不要了。所以，世界上很多艺术家的生活，在我们看来很不正常，其实，他有他自己的感受。他看我们很脏，我们看他们很神经。</p></div>"
},{
    "title": "第二章 移喜磋嘉与莲花生大士",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>怀师：我们现在研究的是佛法实证修行的事。前面讨论了西方人实际用功的十二个案例，很多西方人以为那些现象就是拙火，他们都错了。拙火这个概念，最初是从印度来的，其实，拙火也就是中国道家讲的先天一炁。</p><p>包卓立真是很发心，费了很多功夫，找来了许多资料，买的书可以说是推积如山。这都是他有心，希望我们讨论的结果对美国人有所帮助，不要走太多弯路。</p><p/><p>（移喜磋嘉女佛）</p><p>怀师：最近，他找到一本新书，是关于移喜磋嘉的故事。移喜磋嘉是西藏一位女性修行大成就者，我早就晓得这件事，但中国没有这方面的材料，只是口头听说，点点滴滴而已。有关女性实际修持经验的书少得可怜，几乎没有。这次很难得，找到这本英文书，你们把重要的部分翻译出来，大家作个研究，同时，也让一般的女性修行者知道，修行不是一件容易的事情。</p><p>移喜磋嘉是西藏密宗教主莲花生大士的明妃，也就是双修的对象，她在西藏修行证果。在西藏，成佛的男性，也就是男佛，叫佛父，成佛的女性叫佛母。她经过艰苦的修行，后来活到两百多岁，在这个世界上传了很多法。昨天，我听了这个资料自己就笑了，我本来想活五百岁，后来又想早一点走，现在看人家女的都那么有志气，还是多活一点好了（众笑）。</p><p>等一下先由包卓立大概介绍一下这位女佛的情况，这是第一点。第二点，你们这几位女性自己要发心，为女性发心，不要偷懒占便宜，要把东西整理出来，利益女性大众，那样就功德无量了。</p><p>包卓立：移喜磋嘉出身贵族，十三岁就成了藏王的妃子。后来，藏王把她献给了莲花生大士，她成了莲花生大士的学生和明妃。移喜磋嘉忠实的记录了莲花生大士在西藏的教化，并将他们收藏保护于秘密处。但这不是我们研究的重点，我们研究的重点是移喜磋嘉实证修行的经历和路线。</p><p>这本书的英文名字叫《The sky Dancer 》，第五章最重要（英文第六十五页）。第五章简述了移喜磋嘉的修持方法，她在帝卓密窟中的空行聚会所，以及其它地方的修持。下面我们就翻译第五章的重点。这本书是以第一人称，自述的方式写的，所以，大部分翻译都是移喜磋嘉的话。</p><p/><p>（上师的净土与坛城）</p><p>翻译：刚开始的时候，我住在帝卓聚会所的密洞里，地方上的施主都很慷慨，我在此勤力修持莲师不受限制的实相法。禅定中，我很快就观想到自己的身体转化成天神般美妙的形态，本尊在我眼前清楚显现，自己的气与脉即是空行的坛城。所有这些转化都是自然成就的。得益于上师的加持，我自心本体的明点以上师的舞蹈形式生起，而器世间的一切都呈现为上师的净土。我心中现起对上师无限的虔诚与敬意。与此同时，外在的坛城亦如虹光般现起，佛父佛母在我感官知觉中结为一体。</p><p>李居士：请问老师，什么是上师的净土显现？</p><p>怀师：所谓上师的净土显现，就是看到那个上师修成功的境界。比如阿弥陀佛的净土，是西方极乐世界；释迦牟尼佛的净土，在这个世界；药师佛是东方世界。</p><p>佛成就的最高境界叫「净土」。严格来讲，「土」应该念成「度」。「佛度」，这里意思是说，她进入上师的那个境界了。后来，密宗所谓进入「上师相应法」的境界也是这个意思。Mandala （曼陀罗）的中文翻译要注意，现在普遍都翻成「坛城」或「坛场」。密宗书里面的那些四方的、三角的图案就是坛场，也就是中文讲的道场，那个道的境界,很难解释的。比如你打坐起来，周围感受的环境就是你的道场。</p><p>包卓立：她感觉到的这些景象，到底是因为她自己气动了呢，还是确实就有那么一个道场，是佛陀们带来的呢？</p><p>怀师：这是自力与他力互相感应的结果。这样很好，你们就是应该把这些材料作为一个课题来研究。空行净土的供养</p><p>翻译：在一片光明中，我来到空行净土，鸟金康卓林。在这片净土上，果树形同刀片，地面以肉覆盖，山丘则是一堆堆的骷髅。在这座坛城的中间，是一个无法估量的宫殿，宫殿是由头颅骨堆建而成的，天花板和门帘则由人皮做成。以此宫殿为中心，外围三十万里的地方，有火山带环绕，还有金刚杵的墙，雷电，墓地，以及美丽的莲花组成的墙。在此边界内，是一群喝生血，吃生肉的鸟，邪魔似的野人和其它的野兽，男女都有。他们包围着我，威胁的看者我，但不久就变得既不敌意也不友善了。</p><p>怀师：不要觉得可怕，这就是密宗的特点，天灵盖呀，头盖骨的，人的身体就是整个的宇宙。</p><p>赵教授：西藏人认为人死了是在「空」中，人活着是在身体中，死了就是空了。</p><p>怀师：对，没错。</p><p>翻译：我进入宫殿，过了三道门，很多空行母印入眼帘。她们身体呈人形，带着不同的供养给一位主要的空行母和她的伴侣。有些用刀子从身上割下一片片的肉做为供养，有些则放出身上的血液，有些挖出眼球，有些割下鼻子、舌头、或耳朵、有些挖出心肺，有些则供养骨髓和体液，甚至有些献出了生命力和呼吸，头和四肢。这位主要空行母和她的伴侣为空行母们加持，并把她们的供养重新分配给她们，做为她们诚信的标志。</p><p>怀师：你们打坐修行碰到这个境界，非发疯不可，真讲修行，这些都是要来的。</p><p>翻译：我问她们，你们为何如此痛苦追求？没有了生命，你们怎么到达佛的彼岸呢？她们答到：喔，不积极进取的女人啊，真正的上师，时刻都在布施他的慈悲，如果你明明知道什么会取悦于他，而仍然不马上付诸行动，你就延迟了他的喜悦，也失去了你的功德，拖延，修行的障碍就会加倍增加。你对真理的认知稍纵即逝，如果不把握每一刻觉悟的机会，功德便失去了，修行障碍就会加倍增加。我们拥有此身，时光短暂，我们依此身修法亦只有片刻，拥有此吉祥之身，却没能供养，拖延，修行的障碍就会加倍增加。</p><p>听到这席话，我深感惭愧。</p><p>怀师：这才是学佛的精神：布施与供养，没有丝毫犹豫。中国的佛学已经告诉你了，「无缘之慈，同体体之悲」「三轮体空」，无我相，马上就做，不拖延一分一秒。如果一个穷人向我们要钱，我们还要犹豫犹豫，考虑考虑，那就不对了。</p><p>李居士：就是供养没有第二念。当你有机缘遇到上师的那一刻，最好要把握住。</p><p>怀师：对！供养不能有分别心，不能有第二念的分别心，这才有功德。如果有第二念分别心，就没有功德了。</p><p/><p>（莲师指导八大苦行修持）</p><p>翻译：莲师再来访时，我描述了自己经历过的各种境界。我告诉他，我也要修那种苦行，我请求莲师接受我牺牲的誓言。莲师指导我说：那只是一个象征性的示现而已，你现在没有必要作血肉供养，有一个更好的苦行修法：专注的听我讲，女神移喜磋嘉，人的肉身如金子般宝贵，修行无疑无悔的人，不需为生命所需担忧，不修行则只会空度一生，最后走向死亡。</p><p>发愿修行下面的八大苦行吧，那于你有利。</p><p>修行节食的苦行：以矿物草药精华为生，然后以气为食。</p><p>修行衣物的苦行：着棉衣，然后只佩戴骨饰，最后完全赤裸，用拙火获取生命的暖力。</p><p>修行语的苦行：持诵，观想，唱祈祷文，持咒，修习呼吸法门，禁语，离弃无益的言辞。</p><p>修习身的苦行：大礼拜（拜佛），行香，修持身瑜珈，修习莲花坐禅定的功夫。</p><p>修习意的苦行：修持生起及圆满次第，修习空乐双运的三摩地。</p><p>修习宏法的苦行：举起佛陀的火炬，延续佛陀教旨的传承，完美救度众生的种种方便技巧。</p><p>修习慈悲的苦行：珍爱他人胜过自己，视敌若子，视金若粪土。</p><p>修习仁爱的苦行：不执着于自己身体和生命，培养大乘无我，服务众生的愿心。</p><p>如果你修习这些苦行，你将与佛、法合一，你将得无上成就，妙喜与上乐将与你同在。</p><p>如果你偏离这法门，无益的自残肌体，你将与狂热的极端分子无别。卡迁之女，把我的教法铭记于心。</p><p>怀师：这位老师教得很好。这里所说的服矿物精华等，也就是中国道家讲的外丹。至于说衣物的苦行，修行到某个程度后就可以去掉衣物了。另外，修习安那般那（呼吸法门）到气住脉停时，就可以禁语了。翻译英文的人，自己没有修持，所以交代不清楚。慈悲就是要诸恶莫作，众善奉行，修一切善。</p><p>包卓立：因缘真是有意思，昨天我还给老师看一本印度各种苦行的书，今天就讲到苦行了。</p><p>怀师：明天带给你们看。印度有很多残害肌体的苦行，像裸形外道，灰土外道等，这些都不是真正的道。</p><p>包卓立：我想强调两点：</p><p>第一，每次传法开始的时候，她的上师都会说，你要仔细谛听，用心理解，传法结尾的时候，也会强调用心的重要。就好像在《金刚经》中，怫对须菩提也是这样说的。我认为这是个关键。</p><p>第二，移喜磋嘉修习这些苦行以前，她已经修行了很长时间，已经有了很多三摩地的境界。这种苦行很艰难，并不是每个人都应该走这种路线。移喜磋嘉的上师是一位已经证道的佛菩萨，他知道移喜嗟嘉的因缘和业力，只有这样修行，移喜磋嘉才能成功。</p><p>所以，除非是有得道上师指导，否则不能轻易模仿这种修行路线。 </p><p>怀师：上师的每句话都要深入进去，要身体力行。</p><p/><p>（拙火发动）</p><p>翻译：我发愿勤力修习这些苦行。我从衣物苦行开始修起。帝卓山顶，冰寒地冻，我仅穿一件棉衣，禅修一年。开始时，拙火未能发起，身体几乎不能忍受新年刺骨的寒风霜雪。我的双修伴侣阿扎拉沙雷无法承受这些恶劣的条件，离开我去服侍上师去了。我则遵守誓言，继续禅修。我全身布满水泡，体内饱受痉挛的煎熬。我不停的打嗝，已到了死亡的边缘。我向上师祈祷：鸟金，有情众生的真理之主，我祈请您以您慈悲的阳光，加持于我，帮助我点燃那拙火。</p><p>包卓立：为什么会这样？</p><p>怀师：修行的人一定会经历这么一个过程。气脉要从上面下来，下面上去，接不通就会打嗝。道家讲，天气下降，地气上升，在中间不能变成甘露，变成雨，就会打雷了。开始的时候还打不出来呢。修行是科学，大家都不懂。密宗有一个观想的修法，比如你修准提法，或文殊、阿弥陀佛的法门，佛菩萨给你灌顶下来，可是你海底的气要接上去，一升一降，这样才会有用。这是秘密的秘密。</p><p>赵教授：如果海底的气上不来，灌顶就完全没有用了吗？</p><p>怀师：也还是有用的。</p><p>翻译：业力的力量引发了轻微的呼吸，我体内的拙火发动了。我对上师生起前所未有的诚信，唱起赞美歌，继续祈请上师的恩典。立时，上师现黑鲁嘎金刚相，赐我一天灵盖的白菩提饮用，然后像梦一般消失了。在这连续不断的如幻境界中。我的喜乐是真实的，温暖是真实的。我开始像蛇一样脱皮，我觉得可以去掉衣服，只佩戴骨饰了。我开始「三乘合一」的苦行，继续修行禅定的功夫。我整年连一粒大麦也没吃，只靠石头和水维持生命。渐渐的，我对心之本体的洞察力减弱了，我的身体变得很虚弱，我的腿无法支撑身体，身体无法支撑我的头，口鼻的呼吸都停止了。情况越来越坏，</p><p>我又一次到了死亡的边缘。我呼唤着上师，并观相不断供餐的空行。我唱着祈祷文，向上师倾诉我的苦处。然后，我见到一位全裸的红色女子，她将密处对准我的嘴，我深深的饮食着她的红菩提，立刻，我身体变得充满，像雄伟的雪狮一般。我告诉自己，修习全裸的时候到了，我不再吃任何食物，仅以服气（也就是吃气的意思）为生。开始时还没有什么问题，后来，一丝疑惑飘入脑海，我开始呼吸停止，喉咙和食道干燥，鼻孔像塞了棉毛一般，五脏六腑刺痛，肠道萎缩，我又一次到了死亡的边缘。我用最后的一点力气，呼唤着远处的上师。</p><p>怀师：修行会有很多要死的经历。</p><p/><p>如何得金刚身</p><p>翻译：…在我前面一人高的虚空中，上师显现在一团光明之中，向我道：听着，卡迁之女，皇族之女，你被自己的美丽和快乐所迷惑，不能忍受痛苦之境。现在是以苦乐为本修道的时候了。把痛苦转化成纯净的喜乐，减少对舒适生活的欲望。</p><p>…………</p><p>一切无常，由此起修，深深体会下三道之苦，减少野心，我诚信善良的伴侣。不要认为自己是优越的，现在是坦白自己错误的时候了。赤裸裸的呈现自己的不足，减少对名誉的追求，我诚信善良的伴侣。</p><p>…………</p><p>上师降到地上，继续说道：「你太压抑了，太心切了，现在是利用草木之精华恢复体力，开发智慧的时候了。我会把许多教法宝藏藏起来，等将来有机缘的有情取出。你要作这些宝藏的保管人。不久的未来，我还会告诉你更多的密续坛城，那时，也就是你传法利生的时候了。」说完这些，他就回噶亚的空行净土去了。</p><p>我带着我的伴侣阿扎拉沙雷，和一个叫德哇摩的女孩，去不丹的仙吉宗修习禅定。我利用草药，灌木和矿物的精华来转变我的身体，得刀枪不入的金刚身。我的声音亦变得如天音般柔美，凶猛的母虎听到后也变得温和柔顺。我心安住金刚三摩地。</p><p/><p>生起次第与圆满次第修持</p><p>翻译：我知道现在是修习最严谨苦行的时候了。第一，为了净化语业的污染，我修习了与本尊「趋近」和「认同」的法门，通过唱诵和观想，本尊现前。通过禅修空性，我达到与本尊的合一。我不停的礼拜，祈祷，持咒，唱诵戒律和经典，像源源不断的河流一般。</p><p>开始时，我的声音变得结结巴巴，大量的脓血自喉间渗出，喉咙变得扭曲、麻木，我又一次到了死亡的边缘。最后，我的声音变得甜美，不管我以什么样的方式说话，都能流畅自如。我得到了语言的六十种功德和保持记忆力的七种条件。</p><p>第二，我以莲花坐修习禅定，根据生起次第的修法观想八大本尊无上成就的坛城。我观想诵咒，直至八大本尊的坛城清晰可见。我定于空性之中，与他们合一。开始时，本尊的出现都会伴随着各种征象，如灿烂的光芒等，同时，我心中亦现起各种觉受功德。接着，我由本尊得到指导和授权，以及八种神通力，并彻底认识了菩提萨埵金刚似的三摩地。最后，我得到一个预言性的景象，显示我将得解脱，并入普贤如来佛母位。</p><p>怀师：得到解脱自在的境界是学佛的重点。</p><p>翻译：第三，我依圆满次第的修法，打开与上师心意相通的坛城。通过不断的练习咒语，以及对生命能量和三摩地的控制自如，与上师心意相通的坛城在脉轮上生起。不通过任何分别心，我认识了气，脉，明点的实相。开始时，脉疼痛，气倒流，明点不起，死亡的恐惧又一次来临。我豪不畏惧，继续修习。过一段时间，本尊现起，我对自己的气脉明点亦控制自如了。生老病死之河被截断，我成了一位大成就者。我心中生起对上师无上恩德的无限感激，唱起了颂词。</p><p>怀师：这是印度的规矩。</p><p>翻译：我向上师许下诺言，发誓无我利他。我提取并服用了一百零八种植物草药精华。此时，四百零八位药物女神拥绕着四位圣者现身，他们手持盛满灵丹妙药的瓶子，赞美我为利他而修习苦行，赞叹我已治愈生死流转的宿疾。机缘真是巧妙，当我有某种需要时，外境就有了相应的配合。这时，一位名叫奇珍的女孩来访，供养我大量的蜂蜜。有了这些补给，我开始修习身苦行。先是经行，接着是不分日夜的大礼拜。前额、脚掌、手掌都是伤口，骨头外露，脓血并涌。我不顾这些，继续修习无数的净身功夫。开始时，身体精疲力竭，关节处的明点转向淋巴，并发热，发痛，扭曲，肿胀，筋腱裂开，肌肉松弛，身体又一次失去了生命力。当有毒的明点从纯净的明点分离以后，我的知性扩大了，明点也永远的变成了觉性的本体。身体软弱的部分变得坚韧，伤口和裂开之处都重新长合，疲惫亦烟消云散了。由此，成就密续的基础已经打下。</p><p>怀师：人一生下来就带有胎毒，所以她身体会发热，流脓流血。只有这样，身体里面的毒性才会发出来。你们要注意，修行要有知识，没有知识就免谈修行了。真作功夫的话，这些现象都会出来的，那是很痛苦的。人老了病了，身体也会有这些反映。移喜磋嘉的老师不在身边，她都知道该怎么办，要是你们，就不得了啦。</p><p/><p>魔境中的诱惑</p><p>翻译：然后，我在耐林仙给宗和其它的偏僻山洞中发誓，继续身体的苦行。我端坐莲花座，不放过任何一个要点，眼睛凝定不动，进入无言三摩地。当地的神灵鬼怪，无法忍受我三摩地的光辉，变换种种幻境来打扰我。他们先变出令人垂涎的美味食物，然后又变出美服，马牛等世间各种必需和奢侈品。所有这些诱惑，于我都无济于事，因为，我有三摩地的光辉，我深深知道世间一切的本质都是如梦如幻。我厌恶对世间的执着，鬼魅因此就消失了。我用三昧力将土石变为粪便，幻境也就变得可恶了。我发愿把这些财物变为当地未来的食物和财富，鬼怪就消失了。</p><p>又有一次，鬼怪们变成身体强壮，充满欲望，令人一望就兴奋的俊美少年。他们开始还很礼貌，很快就熟络起来，对我讲一些黄色猥琐的话。有时，他们会跟我玩把戏，把密处暴露出来，向我低语「亲爱的甜心，你要这个吗？」他们还不断的拥抱我，亲吻我，抚摸我的胸部和密处。但所有的这些挑逗于我都无济于事，我三昧的光辉制伏了他们，他们有的立即就消失了。我智慧的觉性告诉我，这一切皆虚妄幻象，都是骗徒的把戏。因为我的菩提萨埵禅定，我生起厌离心，他们有的转换成了黑色死尸，有的则转换成了弯腰驼背的老人、麻疯病人、盲哑人、残废人，或其它丑陋的生物，并且都消失了。</p><p>怀师：你们注意，这叫用心念转变幻象，心念对了，魔境也就不打自退了。至于你心念运用的如何，那就要看你的智慧与见地了。欲与爱的诱惑，还不算厉害的，情的诱惑就更难解脱了，不过，移喜磋嘉会解脱得了的。</p><p>翻译：诱惑不得其便，邪魔们变出了新的花样。我四周开始地动山摇，并有咆哮声，似千龙怒吼一般；黑白红黄及蓝色的闪电夹杂着爆炸声，隆隆声，犬声，扑头盖脸而来。满天闪烁着光，夹杂着刀枪的惨淡青色，一片森然。我三摩地的神力，将这一切都消融得无影无踪。</p><p>还有一天，我被幻变的虎豹熊等各种野兽包围，它们在洞口疵牙裂嘴，咆哮着要攻击我。我已有身远离的成就，不再执着与这个身体和对自身的爱，心中生起慈悲心，于是它们都消失了。刹那间，数以亿计的蝎子、蜘蛛、蛇等昆虫覆盖了整片土地，它们钻入我的五官，咬蜇抓爬，并互相吞食，四周残骸遍野，令人憎恶。我略感颤栗，心中生起一念慈悲，我告诉自己，我已发愿，不执着欲身语意，现在为甚么又要畏惧这些精灵的幻变花样和业力示现的昆虫活动呢？我应该知道，一切的一切，皆是唯心所造，保持心的宁静吧。此念既生，我恢复了信心，并唱到：</p><p>一切现象都不过是心的游戏，如果内观，则找不到任何令人恐惧之物。这一切都只是明点自性的反射，不须反应，自如就是道。一切的活动都是我外在的装饰，我应该继续住于无言的禅定。</p><p>此时，我与法界合一，毫无分别心，进入禅定境界，所有的外相也都消失了。</p><p/><p>魔境出现的原因</p><p>怀师：你们不要以为这些是笑话，真作功夫就会碰到这些现象。你说你们还没碰到，那是因为你们还不够资格，功夫还没到家。遇到这种情况，心中要起一念慈悲，一切都可以布施掉。</p><p>人自己的贪心、痴心、嫉妒心、毒害心、杀害心的根根就会引发这些示现。</p><p>比如有一次，我的老师袁先生在闭关，下座后他跟我说：「怀瑾啊，糟糕了，」我说，「什么事啊？」他说：「我现在才晓得，我那个瞋心的根根没有断啊。刚才我打坐入定时，座底下出来一条大蟒蛇，要吃掉我。我就笑了一下，还有这种境界，原来我的瞋心还没断啊，我的心还那么毒啊。去啦，它就走了。」</p><p>饶先生：是根根发出来的，还是真有魔境？</p><p>怀师：当然有魔境，内外相合，自力他力都有作用。比如那些作邪法的，用纸剪成人、老虎、蛇，念咒害你。真有效果哦！你不懂，一害怕，一样会受伤，一样会被咬死哦。它是法术变的，你说没有他力吗？有他力；你说是真的吗？假的；假的吗？真的。这个世界上万法如此。比如这个房子，真的吗？假的；假的吗？真的。</p><p>饶先生：这样讲的话，心也跟着起作用了？</p><p>怀师：当然了，心物一元嘛！</p><p/><p>如何驱魔</p><p>赵教授：如果心中无我，魔是否就来不了呢？</p><p>怀师：心中无我，魔也来得了。来了，你要知道它是空。我跟你们说过，要「念死」，不管魔是真的也好，假的也好，你（魔）要来吃我，我就一切布施供养，发慈悲心仁爱心，希望你们（魔）吃了我得超生，得好果，我就很欢喜的供养你们（魔）。</p><p>你们也不是真修行，不过现在听了这些佛法，万一你们将来碰到这种情况，也知道该怎么办。你说，这些都是假的，我现在空，我不怕。告诉你们哦，说不定你就变成它的面包点心哦，魔真是可以把你吃掉哦。不过，你一心念&lt;心经&gt;，或者《金刚经》就行了，准提咒也行。不过，你们不要以为只有这些是魔障，现实中的魔障比这个还可怕。</p><p>玄奘法师西行取经，经过大沙漠，这些都经历过，他的传记里都有记载。他念什么咒都没有用，最后只有&lt;心经&gt;。大家都讲，我们现在流通的&lt;摩诃般若波罗密多心经&gt;是玄奘法师翻译的，这是不对的。玄奘法师还没出国以前，在成都大慈寺，当时二十几岁，还是年轻的小和尚。我在那个寺庙住过，贡噶师父给我传法授戒都在那里。</p><p>当时，有一位有病的老和尚，浑身都是发臭的脓血，没人照应。玄奘给他洗澡，照顾他。这位老和尚说：“我没有什么可以给你的，你就念这个&lt;心经&gt;吧。”所以，这部鸠摩罗什大师翻译的&lt;心经&gt;，玄奘当时就会背。后来碰到魔障困难，就靠这个&lt;心经&gt;起作用，后来玄奘法师参照鸠摩罗什的译本，重新翻译过，就是我们现在用的版本。那位老和尚其实是位菩萨化身，来试验玄奘的。</p><p>梦中有时也会有这些恐怖现象，虽是梦，一样可怕。有人梦中知道是幻象，但还是怕，说明修行还是不得力。梦中也会有爱，也很真实哦。</p><p>修习禅宗的人亦会有类似的经历，不过，都不记载。禅宗一般只记载大悟以后的情形。比如黄龙南祖师，他已是大悟的人。他把地方上那些牛鬼蛇神的庙子都打烂了，拆了。因为他是悟道的大和尚，声望太高了，大家对他也没有办法。</p><p>他住在禅堂里，夜里睡觉时有一条蟒蛇出来咬他。他说声：“你敢！”就翻身又睡了。他也不用念&lt;心经&gt;《金刚经》，蟒蛇就走了。</p><p>还有个禅师的故事。有个毒龙潭，人只要在旁边动一下，毒龙就会从水里冒出来。这位禅师索性脱了衣服跳进去游泳。毒龙不但没出来，从那以后，毒龙就不敢住在那里了。中国这些大禅师们，遇到这种情况，既不用咒，也不用法术，就这么明了简单，这是因为他悟道了。我也有一个咒子：“他妈的，滚你的。”</p><p/><p>一花一世界</p><p>翻译：此后，又出现了许多恐怖的景象。我看见许多残肢断臂，和无身体的头颅悬于空中。我还看见，在一个如芥子般大的城堡中，许多人在殴斗，还看见火光，洪水，狂风，和山崩地裂，但我仍如泰山般巍然不动，定于金刚般的三摩地，于是这些景象就消失得无影无踪了。</p><p>包卓立：这个小城堡是不是说明移喜磋嘉身体某个部位有毛病？</p><p>怀师：其实，我们人体的每一个毛孔，每一根头发都是一个世界，所有物理世界与精神世界都包含在里面了。每一个细胞，乃至现在讲的每一个基因，都是一个世界，都包含了一个宇宙。不过，现在的科学家们还不懂这个道理。所谓“一花一世界，一叶一如来”就是这个意思。你们要注意，她现在还是在五阴身体上做功夫，还在色蕴、受蕴、想蕴的境界里，还没到识蕴。她有三摩地，但还没得道。她还没得般若，但她信念坚定。你们不要看不起哦，对不起，你们还没到那个程度呢。</p><p>饶先生：她感觉到脓和血，这与禅秘要法的白骨观有什么不同？</p><p>怀师：白骨观是想阴境界，这里是色阴境界。色阴是地水火风四大，或者再加一个空大，一共是五大，变化而来的；想阴是精神境界，是观想来的。这两个效果一样，但也有差别。如果观想到色身起了变化，那就差不多了。这两种成就没有高低之分，只是不同。</p><p>翻译：经历过这些形形色色的魔境之后，我的领悟更透彻，觉性进一步扩大，见地更深刻了。我得到了永不退却的诚信，我再不会为幻境所困惑，在我看来，任何景象都不过是空性的展现，神妙的幻象都是上师的慈悲，帮助我进一步扩展我的创造力。我不再有痛苦与快乐，好与坏的分别心。好与坏都是我们修行成就的方便工具，都是上师慈悲的展现。</p><p/><p>金钟罩铁布衫</p><p>翻译：新的魔障出来了。以红、蓝、黑三色为代表的印度、西藏、及尼泊尔的魔鬼兵团，施法无效，遂引诱当地的民众来打扰我。它们施法术，令黑雾笼罩大地。雷电、冰雹、暴风雨摧毁了农田，引来了瘟疫。一位不丹的猎人碰巧见过我，于是消息传开，人们以为我是罪魁祸首。他们来到洞穴，要向我报复。我告诉自己，我无法改善这种情况，我把这一切当成是心之所造，我继续保持誓言，默然禅定，眼光凝静，自观心的本质。</p><p>他们将灰撒进我的眼睛，把刀插进我的耳朵，用弓箭射我，用棍棒打我，用矛刺我，用刀砍我，但无论如何，他们都无法伤害我。没有办法，他们只好各自回家了。</p><p>怀师：前面讲过，她不动瞋恨之心，已有了金刚不坏之身，道家用另一个名子，叫“金钟罩铁布衫”。</p><p>李居士：假如没有前面那段修行，她一念不生的话，伤不伤得到她？</p><p>怀师：那是另外一种境界。比如，黄龙禅师色身并没有转变，但他般若很高，吕纯阳飞剑射黄龙禅师，还是伤不到他，所以，般若有无比的威力。不过，她没有黄龙禅师那个道心，见道之心。</p><p>翻译：这之后，各地的神鬼魔王们都归顺了我，发誓作我的护法。当地的男男女女也都诚心忏悔，对我恭敬礼拜。不丹的哈姆拉斯国王还将他具一切空行征象的十三岁女儿献给我。我带她到巴洛塔克藏，和我的密伴阿扎拉沙雷以及阿扎拉吴扬，修习于我有益的最后的苦行：空乐双运的苦行。</p><p>我们用营养植物滋养身体，日以继夜的训练自己的修习技巧，如此整整七个月之久。开始时，我身体虚弱发抖，心灵痴滞，淋巴液布满全身，身体生病，疼痛发热，我又一次到了死亡的边缘。但在这之后，所有的淋巴都转换成了生命的精华。 怀师：注意，经过痛苦之后，转化成精华了，这不是普通的精华。</p><p>翻译：乐感传遍全身。开始，这种乐感还有激情的染污，但很快乐感就转为觉性，最终，转为无间断的觉性之流。我们的红白菩提（seed essence ）融为一体，成为无二性的明点。我将心置于征服者的坛城，供养喜乐，并在喜乐中礼拜，于是，净喜之身中又生起了最大的潜力的喜乐。红色的光布满我白色的身体，我转成纯净的金刚亥母，而我的外表仍保持着十六妙龄少女的模样。同时，我见到无量寿佛的坛城，成就了不受病、老侵害的金刚不坏身和持明者。我亦获预言，知道我将住世二百二十五年。荣耀的马头金刚和金刚亥母为我驱除邪灵，五方佛与空行是我永恒的伴侣，如影子般常随左右，在必要时显现无碍神通。此时我已是能自己控制寿命的持明者，并得到天蓝光明女神的名号。</p><p/><p>红菩提与白菩提</p><p>怀师：你们将英文的「种子精华」（seen essence ）翻成了（红或白）菩提。</p><p>菩提这个佛学名词，最初是从印度文翻成藏文，又从藏文翻成中文而来的。其实菩提也是一个代名词，按唯识教理来讲，也不叫菩提，玄奘法师叫它「净色根」。所谓净色根，就是物质的那个根源。现在讲的基因、细胞等还不是净色根。现在科学还不知道细胞生命的来源，那个来源就叫净色根。现在科学研究到基因，已经无法再往下分了，将来科学也许会发现，生命最初的那一点就是净色根。</p><p>密法中，女性的种子精华一般叫红菩提，男性的叫白菩提。英文翻成种子，因为英文中没有这个字。其实，人能生出人来，也是靠那个种子。女性阴户内有一种液体，是一种荷尔蒙；男性如果冲动了，生殖器口上也有一种液体，和女全的那种液体同一个性质。男性出精等于女性排卵，女性一个月排卵一个，男性一次可排几亿的精虫，精卵相和就成了生命的种子，不过这不是红白菩提。</p><p>这里讲到，他们双修七个月，他们有精卵的排泄吗？没有！他们已经把女性的卵，男性的精化掉了，都变成了菩提种子。这都是科学的大问题。</p><p>真正告诉你们密宗的东西，你们会害怕的。好比说，他们认为女人月经的血，男性的精-都是宝贝，都可以拿来供佛。洗澡的水倒了也犯戒，要先喝三口才能倒。一般人认为身体是脏的，其实都是红白菩提变出来的宝贝。拿庄子的话来说，我们认为的世界上好的东西，像那些好吃的东西，其实都是最脏的东西变出来的，也就是化腐朽为神奇。</p><p>翻译：（英文第三十八页）上师授予我成就本尊的秘密上师之法，给我秘密灌顶，教导我认识到我自己的五蕴之身即是殊胜坛城，脉就是本尊，气就是咒语，明点就是大手印。我如法修持三或七天。（英文第四十三页）这个灌顶的要点在于把爱升华为觉性，保持四喜不受障碍。我的感受一步步深化，从一个高峰到另一个高峰。这时，如果遗失明点（菩提心），就犯了杀害不变光佛的恶业，将入金刚地狱。我将自己的意识住于不受色欲污染的净喜之中，不入昏沉，因此觉性生起。</p><p/><p>移喜磋嘉女佛生平</p><p>十三岁：为帝王之后</p><p>二十岁：得到完全灌顶，并开始苦行</p><p>三十岁：已了悟，并开始服务众生的工作</p><p>四十岁：与上师心心相应</p><p>五十岁：开始降魔护法</p><p>六十岁：传播佛法，扩增僧团</p><p>七十岁：了知实相的自性</p><p>八十岁：莲师离开，去了西南方</p><p>九十岁：见到实相的本质</p><p>一百岁：明知达到圆满</p><p>一百二十岁：为帝王之师</p><p>一百三十岁：遍游西藏</p><p>一百五十岁：保存宝藏于秘密处并作利他事业</p><p>一百六十岁：慕质增波王圆寂</p><p>一百七十岁：帮助剩下的弟子得解脱</p><p>一百八十岁：在洛扎克投射幻影的形象</p><p>一百九十岁：重见她唯一的姐妹，成就者女王</p><p>二百二十五岁：圆寂</p><p/><p>末法时代的情形</p><p>包卓立：下面这段取自关于移喜嗟嘉的另一本英文书，书名《The CrystalGarland of Faultless Practice 》，其中第一百三十五页「Padmasanbhava｜sOralInstucions to Lady Tsogyal 」。</p><p>翻译：上师教导移喜磋嘉，当五百年的末法时期来临的时候，修习诵咒的人只会口中念念有词，而不知咒法的深意。他们将把密咒变成符咒之术，把三摩地境界变成空洞的仪式。他们会借用双修的名义纵欲。他们会假装救度众生，而实际上却是纵容其瞋心。他们将善恶不分，批贩如来，把教法像物品一样买卖，有的人甚至会借传法之名敛财。他们会把殊密的咒语变成赌博的工具，满足自己的政治野心。</p><p>怀师：每个宗教到后来都如此。许多人都会贪那个上师、大师、仁波切的名，贪图利养钱财。这种事情现在太多了，令人心灰，令人心寒。历史上很多人以修道当隐士来培养自己的声望，然后等政府请他出来，他的野心其实比谁都大。</p><p>供养正法本来是应该的，佛所以吩咐大家，对真正的上师，有修持的善知识，要诚心供养。供养一个大阿罗汉不如供养一个佛，供养一个佛不如供养一个无事闲人，供养一个无事闲人不如供养一个生病痛苦中没有饭吃的叫化子。救苦救难的功德最大。无事闲人不是佛也不是魔，连佛的观念也解脱了，自己成了佛而没有佛的观念，也不作教主。</p><p/><p>双修与空行母</p><p>怀师：西藏的红教讲究男女双修，美国也有很多人教人交媾的技巧，收费贵得很。真正的红教双修，讲的是气脉成就。关于双修，各个派别争论很多。有的说，开始时就要双修，为了了欲，等这一阶段过了以后就单修了。有的认为，先把气脉修习到一定程度，再用双修使气脉达到最高的成就。有一派认为，完成许多修行成就后，最后一次男女双修得到报身成就，达到色身的转化。报身也叫色身。</p><p>双修的对象有很严格的条件，很难找到。比如男的找女的双修对象，最好是年轻的，除非对方已经达到空行母的境界。有的说，女性双修对象的眉心、喉处、或者心窝要有一颗红痣。这里讲到，移喜磋嘉的男伴就有这么一颗红痣。另外，要家庭教养好，有见地，有智慧，有道德，心地善良，慈悲好施。</p><p>所谓空行母也有两层意思。西藏一般学密宗的人，以为空行母都是在虚空中飞来飞去的，这是有形的，其实空行母就是见了空性、明心见性、没有欲望、一切空、一切为度人帮助人的人。西藏黄教白教许多人单修，拼命修法，希望空行母来帮他。哎呀，梦中空行母来啊。我就骂他们，你们是在意淫，梦交，若要真正的空行母现身，除非你修持、智慧、福报、功德到了相当的程度才有可能。空行母有时现很凶的姿态，而且很丑陋，有时现比天仙还美的姿态。她还会对你有各种各样的测验。如果你还有善恶丑美的分别心的话，空行母一个耳光把你打扁了。你在定中，如果空行母低头这样看你，你就千万不要碰了，空行母对你已经生气了，说你修行不对。如果背对着你，更不能碰了。换句话说，她警告你不要动双修的念头。</p><p>宗喀巴大师创立黄教，主张单修，禁止双修。但是，他也承认，要想得法报化三身成就，只好等到自己这个肉体毁坏，中阴身时双修，这是另外一个秘密了。</p><p/><p>五世达赖的故事</p><p>怀师：在西藏，黄教的达赖是人王兼法王。第五代达赖告诉大家，他要双修，那可不得了，历代祖师都是规定单修的，因此左右宰相大臣都反对。</p><p>有一天，他叫来左右大臣和管宗教的“干布”，也就是管总务的大师，在日本叫“馆长”，国家的庙子都归他管。他带大家登上城墙，脱下裤子要屙尿，及至屙了一半，又把屙出来的尿吸回去了。他看看大家，意思是说，你们看我有资格双修吧？大家都不讲话。第五代达赖说，既然如此，我也不双修了，不久就涅盘了，转生为第六代达赖。所以，第六代达赖风流倜傥，开后门，偷偷去酒家约会。结果因为下雪天被人发现。第六代达赖的情诗就是这样写出来的。</p><p>消息传到满清政府，那是顺治的时候，就召他进京处理。走到青海他就不走了，我是法王，怎么这样去见一个人王呢？就圆寂了，走了。第七代达赖就靠不住了（没有这种功夫了）。据传，第六代达赖并没有死，他到了蒙古，还是喇嘛，还到过四川峨媚，活了很久，有没有双修不知道。据说，乾隆时期他还在世，乾隆答应他不宣布他是第六代达赖，他才答应和乾隆谈话，之后就走了，传说后来圆寂在中国的五台山。</p><p>像这里讲的这些大喇嘛，都在山洞里专修过，程度都很高，这样的大喇嘛很难得碰到的。这个（双修）作起来，很恭敬的。布幔遮起来，两人在里面修七天七夜，外面的喇嘛围着，七天七夜念咒念经，打坐供养，香花供养。据说，修好了整个帐篷都不见了，只有一团五彩的光明。元顺帝得了双修法，结果以此作乐，闹得一塌糊涂，历史上名声很坏。</p><p>清朝的顺治、康熙、雍正、乾隆都受过这些法的灌顶。所以，雍正没有当皇帝以前住的王府，也就是现在北京的雍和宫，还供养双身佛呢！欢喜佛就是这样来源的。乾隆以后的嘉庆还有，以后就不知道了。康熙、雍正、乾隆对禅宗、密宗都很有研究，很高明。</p><p>禅宗对双修既不表示批驳，也不表示赞成，根本不提这回事。有一位在家人，是一名尚书，名叫陈操。有一次，他请教一位禅宗祖师说：「吃肉嘛，犯戒；不吃肉嘛，不行。师父啊，你看我该怎么办？」这位禅师回答：「吃是你的禄，不吃是你的福。」也就是说，吃是你这一生的福报，不吃是你未来的功德。这就是</p><p>禅宗的教法，很妙。许多在家居士，不出家一样悟道，禅宗也不作说明。</p><p/><p>莲花生大士的教导</p><p>包卓立：下面，我们介绍一下莲花生大士对移喜磋嘉的教导，有些是她苦行以前教的，有些是苦行以后教的。</p><p>翻译：第一，要有一位可以信赖的，真正的悟道上师。这位上师需要得到过不曾中断过的传承。莲花生大士就是这么一位上师。第二，不要轻易把法传给那些会误解法的人。第三，不要传法给那些不精进，把法浪费掉的人。这些人就像商人一样追逐名利，修行对他们来讲并非人生大事，他们不求进步，只要有一点点成就，就会沾沾自喜。他们不会好好保护法的传承，相反，他们会不经意的误传教法。第四，如果你要即身悟道的话，就一定要精进、自守戒律、念念在道上。</p><p>包卓立：从这里我们可以理解，为甚么有些法老师不准我们修。老师也经常批评我们，好像学佛都是为佛菩萨学的，为老师学的。哦，我打过坐了，够了，我听过法了，够了。</p><p>翻译：（上面讲的都是原则，下面是细节。）白天时，要把一切所感所想当成梦境一样，放松，让一切都自然发生，不要有人为的痕迹，不要用分别心去修正什么，一切都应该是自在，开朗的。你身心都在休息，同时心中一片清明。</p><p>怀师：学佛到了这一步已经很不错了，算是有一点点基础了。《金刚经》最后四句偈子已经告诉你了：「一切有为法，如梦幻泡影，如露亦如电，应作如是观。」这几句话，不光是理论的总结，实际上是修行的三摩地，是一个境界，一个功夫。那么，怎么做到呢？由打坐开始，然后平常都处在那种状态中。打坐时有这么个境界，下座，还有老婆孩子，还要做事，还要像在坐中一样，如梦如幻。这是密宗的大法，叫梦幻观。老实讲，现代人打坐也到不了这个程度，古人也很少。真正做到了，身体若有若无，好像梦中的境界一样，其实也没有梦。假使有那么一点点念头动，也好像梦一样，随时空得掉。随时若有若无，如梦如幻。</p><p>梦幻观瑜珈是普贤如来化身也就是金刚萨埵所传承的法门。如果你随时都在那个境界中，身体比睡梦还松软，即使不修气脉，气脉自然就通了。打个比方，那种情形就像喝酒喝到七分醉，人很放松。还有一种体会是用眼神，你半张半开看前面一个东西，不动，把神收回来，慢慢一切都是幻的了。看前面一个人，就像一个影子。常住这个境界，慢慢的整个世界都变成一个梦境，都是空的了。</p><p>包卓立：我想给大家讲一个经验。要修行，一定要读很多书。即使是同一个法门，不同人有不同的经验，用不同的语言说出来。你第一次看到某种修法时，也许心中没有什么共呜，但种下了种子，以后再碰到，说不定会有共呜。或者，有的修法你一看见就有共呜。所以读书能学到很多东西。</p><p>翻译：到了晚上，则要以清醒为修道的根本。也就是说，不要让自己掉在昏沉里，要保持清醒和心的灵敏。半夜时，将法融于沉睡之中，心中要有一个很强的念头，让自己梦中清楚自己是在做梦。这样修行，你就可以做到即使在梦中亦不忘教法，就能解脱恶梦了。早上醒来时，则要以法为修道的根本。也就是说，一旦醒来，马上就将法融于心中，不要掉进昏沉散乱，不要偷懒，要精进、自律。</p><p>怀师：密宗分两部分，一是梦成就，一是幻观成就。白天和梦分不开，白天做事就好像做梦一样。打坐念佛也是梦，不过是打坐的梦，念佛的梦。下座了则是另一个梦。到了梦中，则好像白天一样，很清醒。如果能够做到像白天那么清醒，就不得了了。然后自己可以改变梦境。比如梦到火起，自己知道在做梦，念头一转，就把火变成水了。慢慢这样修，修到梦中亦不动念头。然后独影境界起来，能够前知，能够后知，过去的事知道，未来的事也知道，一切都知道。白天的一切物质人生，一切的一切都只是一个大梦，要空掉就空掉，要有就有。这是梦成就。</p><p>梦也是幻，幻也是梦，但严格讲起来，梦与幻有差别。现在开着灯，比如你看着前面，眼睛不动，时间久了，眼睛疲劳了，前面就变虚晃了，这是幻。真到了幻观的境界，一切物质都变成软的了，像面粉一样，一切东西都是影子，慢慢看到一切都是空的。这与神经分裂只一线之差，一般人到了这个境界就吓坏了，以为自己神经衰弱了，精神分裂了，不敢修了，要去看医生了。幻观成就修成了，山河大地也是幻的，要穿过去就穿过去了。这当然要很高的功力，不是说说就做得到的。这是幻观成就。</p><p>这时，没有时间空间感了，但还可以走路。这时走路是阿赖耶识引发身识的现量作用。所谓现量，就是进入幻境界去了，用到哪一识，哪一识就呈现，用到眼识，眼识就呈现。</p><p>怀师：这个学理分析起来很深的。现量与比量不同，像我们现在翻译，是比量，是思维意识的作用。所以打坐，或者双修，要达到这个境界很难的。</p><p>翻译：专修的时候，不要穿别人的衣服，因为那会玷污你的修行。要严格遵守一个平衡的饮食习惯，不要吃太油腻的食物，因为油腻的食物容易干扰你心理的平静。</p><p>怀师：中国道家把闭关叫做 「入圜办道」。道家正式修的时候是不看书的，专门做功夫。饮食要特别注意，要少吃多餐，饿了就吃一点点。一般是一日三餐，或五、六餐，七、八餐，慢慢减少，最后辟谷，不吃五谷肉类，只喝水。最后达到「精满不思淫，气满不思食，神满不思睡」的境界。神满不思睡就是昼夜长明，脑子昼夜清醒，但是空的，无念的。</p><p>翻译：闭关时，不要改变床和打坐的位置，否则，禅定的境界会受干扰，打生也会遇到一些突发性障碍。</p><p>怀师：拿普通人来说，有些人是认床的，出门睡人家的床，或住旅馆就睡不好，生活习惯很难改。以道家来讲，修道有四个重点：法、财、侣、地。法就是方法。财就是钱财，生活需要钱啊。侣不光是指男女双修的那个伴侣，也包括一个能招呼你的、道上的伴。所谓地，就是说要讲究风水地气，拿现在流行的话来说，就是地球磁场。所以释迦牟尼佛到处找地方，最后在菩提树下悟道。据佛经说，自上古以来，那个菩提树下的那一块地是金刚地，有地气升上来，过去佛，现在佛，未来佛都是在那个位置成道。初步开始，「地」是重要的，稍稍有成就以后就不一样了，到处是道场，随时随地都可以成就，不须受这些拘束。</p><p>翻译：不要一次发愿就完了，要天天发愿，否则容易变得懒散。闭关时，可能会出现各种各样的境界，不要执着于这些境界，不要有分别心；不要接受或拒绝这些境界，要顺其自然，心时刻在自然自在之中，继续修道就好了。闭关时，一定要严格自律，接受不舒适的条件，不管任何事情发生，都不要轻易提前出关，不要较易的向困难低头。</p><p>怀师：这里我特别补充一下。初步闭关，自己要给自己规定功课，心里想着，十手所指，十目所视，都有佛菩萨、护法看着你。孔子也讲过，「小人闲居为不善」，普通人，小人，只要一有空闲就散漫松懈了。其实，偷懒、懈怠、散漫本身就是罪过，所以佛法讲精进。</p><p>像我个人来讲，闭关的时候，一点也没有懈怠过，一天二十四小时，都兢兢业业用完。睡眠也是功课之一，也要管理自己，不能贪睡。小时候读书，除了老师规定的功课之外，我回到家里自己都定了功课表。上午起来吃完早饭做什么，下一个钟头做什么都定好的。现在虽然不用功课表了，但几十年来从没有松懈过，是从小养成的习惯。像最近，白天把跟你们的这些事做完了，回去差不多十二点了，再看些资料就到两三点了，然后开始写东西，一直到天亮六点锺，睡一会儿，很快就又起来了。事情很多，从来没有松懈过。</p><p>你以为，我每天来这里，只是陪大家聊聊天啊，在我认为，这不是聊天，我是在方便度化，我都在点你们。这对我来讲并不是甚么高兴好玩的事。每天，我都要见许多不想见的人，听许多不想听的话，讲许多不想讲的话，做许多不想做的事。所以，你们平常生活就要严肃精进，平常修行就要把自己管理好了。不管你是修儒家，道家，什么家的，就是做个普通人也应该如此。其实，这样做都会回向你自己，都会成为你自己的磨炼和功德。这是趁这个机会补充的。</p><p>翻译：做念诵修行时，要把每天分成三到四个时间段，每一个时间段都要督促自己做念诵。最好每天一千遍，再差一点也要五百遍，至少也要一百零八遍。在所有咒语中，「嗡阿吽」是一切咒的根本（是普贤如来的根本咒）。滴水汇合成大海，只要你嘴唇闲着的时候，就要念咒，这样积少成多，最后会有成就的。修法与正见合一才是修行的正确路线。所谓修法，就是你在修习的那个法门，生起次第，圆满次第都包括在内。所谓正见，就是能见空性的那个见地，以及自性光明。如果没有悟到自性空，你就没有得到正见。只有正见而没有修法，你就没有实修的经验，只有修法而没有正见，那么你就没有把真正的法放于实践之中（那么你就没有修行真正的法）。因此，二者不可分离。</p><p>怀师：这里的自性光明不是指物理的有相光，而是指无相的智能光明，是本体功能本来具有的。《圣经新约》里说，「神即是光」。一般基督教徒以为讲的是物理的光，都错了。更准确的翻译是：「神即是般若的智光」。一般人一说起上帝，就着相了，就想起了威武的尧舜禹汤，或者黄帝。这都是错误的，神是智慧的成就。</p><p>翻译：上座与下座无二，只有这样你才能得到空性。禅定时，你要如法而行，不用意识思维，但心中一切明明了了。出禅定时，你要深深领悟一切现象没有自性，一切皆空。不要执着于空性所现的各种境界，也不要为这些境界兴奋好奇，做到这一点，你自然会进步到禅定与出禅定无别，你自然会从思绪中解脱出来，就自然会烟消云散，蓝天现前。</p><p>怀师：这位老师指导得很好，很清楚。他教的都是大乘禅修的方法。没有分别心，不管是上座还是下座，随时都在一念清净中。在这个三摩地的境界，就连定境都是空的。所谓空，没有一个空相，一切无相。在这样的境界中，智慧进步当然很快。但是，人人晓得讲，个个做不到。哎呀，老师啊，我就是空不了。这一句话，已经着空相了。一般人以为，「空」就是把那些杂念都分别去掉，另外有一个空出现。那还是空吗？那是一塌糊涂的有！所以我常讲，我最讨厌一般学佛的人，一脸的「佛气」，满身的「佛相」，满嘴的「佛话」，听了就讨厌。本来给你讲空嘛，你这样摆一副修行的样子，早就空不了了。空是非常洒脱，非常自在，是大自在。</p><p>翻译：禅定时，你融于法的自性之中。当昏沉出现时，你观其自性，你会发现昏沉无自性，本来空。当散乱出现时，你观其自性，你会发现散乱本无自性，本来空。</p><p>怀师：昏沉与散乱是两个现象，一切众生不是在昏沉中，就是在散乱中。一般人睡醒时，眼睛还没张开，身子还没起来，思想已经出来了。那就是散乱。细一点的散乱叫掉举。众生一醒来就散乱，不散乱、不掉举就昏沉。粗的昏沉就是睡眠。有时候，你觉得没有睡，但身心不清明，那是细昏沉。其实散乱昏沉也没自性，它的本性也是空的。因为，散乱久了就昏沉，昏沉久了就散乱，反反覆覆， 昏沉和散乱都是停不住的。</p><p>翻译：不要只在静坐的时候才心法合一，一下座就「我是我，法是法」了。你要把一念不生，禅定时所见到的那个无相的法之本体，应用于下座后的日常活动中，行、住、坐、卧都无分别，要时时刻刻如法而行，永远在「合法」的境界中。</p><p>把布施、忏悔、修法与日常生活分离开来，你就无法清除自己的业障。真正修行是把「合法」之行贯穿于自己的一切行动之中。「合法」者，就是你时时刻刻都在禅定，时时刻刻都有布施心，时时刻刻都在做「合法」的事，比如念诵，行香，等等。你的一切行动都无条件的与法一致。所以，要无分别心的修行身语意的善行。修法有成就了，你就会感到内在的乐、明、无念。不要执着于自己的情绪，你的思想就自然得解脱了。</p><p>怀师：达摩祖师讲「二入（理入、事入）四行（报冤行、随缘行、无所求行、称法行）」。四行里面最高的那个成就是「称法行」，就是随时随地都在法当中，随时要合法。「法」不住空也不住有，「应无所住而生其心」。打个比方，就像电插头一样，随时要插对了才行。</p><p>翻译：如果你行善行的时候，还有我和他的分别心，还有我在作善事这么一念的话，你的善根终将枯竭。如果你为名为利作善事，你则曲解了修善行的原意。你要把善行变成一种不需要思维，自然自觉的行为，要把所有思想感觉化为虚空。这样，不管你修什么法门，你都能够不断扩大你的善根，直至到达无上证悟。</p><p>修行首先要打好基础。如果你功德累积不够，你就不会遇到一位真正的上师善知识。如果因缘不够，你就无法理解教法。如果你没有诚信和奉献精神，你就无法体会上师善知识的功德。如果你没有发愿，自律和正觉正见，你就违反了修法的根本。如果没有善知识亲自口授，你就不知道如何修习禅定。如果你不精进，没有恒心，你就不能真正进入修行之路。如果你不生起厌离心，你的修行就不可能有大成就。修法证悟需要许多因缘条件的配合，所以，不要忘记身口意的修持，要精进，要心行一致，把心中所想付诸行动。</p></div>"
},{
    "title": "第三章 密勒日巴与甘波巴的修行",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>密勒日巴的故事</p><p>怀师：密勒日巴是西藏一位修行真正有成就的大祖师，西藏人认为他是真正的活佛。现在书店里应该有他的传记卖，叫《密勒日巴尊者传》。其实他的传记以前就有人翻译，叫《木讷祖师》，木讷是密勒日巳的简称。</p><p>在西藏，不管是红教，黄教，白教，还是花教，都很崇拜木讷祖师（一0五二至一一三五）。以我的研究来看，他是宋朝时代的人。为了报复仇人，他最开始学的是黑教外道。他学会了念咒和法术，还会神通。如果他对着某个地方念咒，那儿就会下冰雹，打雷，结果害死很多人，破坏了很多生命财产。后来，他意识到自己不对，就诚心忏悔，开始学佛了。</p><p>他学佛的上师是很有名的玛尔巴活佛。为了磨炼他，帮他消业，那诺巴上师一开始就狠狠的折磨他，让他受了很多苦难。关于这些，他的传记里都有记载，你们要自己去看，我们当年读他的传记时候，都是一边看一边流眼泪的。红教的祖师都是有太太孩子的，都是双修，但也不一定生孩子。玛尔巴上师是有孩子的。师父对密勒日巴这位徒弟说，你要跟我学，可以，没问题，但是我是要求很严格的，而且我是要供养的。西藏人的财富就是牛羊，密勒日巴没有钱，牛都养不起，就把家里仅有的一点钱财供养师父。</p><p>除此以外，师父还用种种办法整他，叫他盖房子：你不是想跟我学吗？那就要先培养功德，可是你的供养又少，那就在南边给我盖个房子吧。他就去挖地基，找材料，最后终于把房子盖好了。师父故意整他，问他说：「你为甚么在南边盖房子啊？」「师父，你叫我在南边盖房子啊！」「乱说！我没有讲过啊，南边是我风水最好的地方，你在那里给我盖房子干甚么？去，马上给我拆掉！」他又只好再亲自去把房子拆掉。师父又叫他在北面盖个房子。等盖好了，师父又骂他：「甚么？盖房子？那是我那天喝醉了，乱说的，去拆掉！」然后又叫他西边去盖房子，他背东西，做苦工，肩膀都磨烂了，但他还是接着做，一声怨言都没有。师父的儿子实在看不下去了，就去帮忙他。师父把儿子叫回来，然后骂密勒日巴：「我的儿子是法王的儿子，是太子，你凭甚么资格叫我儿子去帮忙？」「师父，我没有叫他，师兄是自己来帮忙。」师父臭骂他﹂顿，又叫他把房子拆掉。</p><p>师母看见这个情况也心疼了，就问这位师父：「你为甚么这么折磨他啊？」「你不知道啊，他一生造的杀业罪过太大了，多少世修行都消不了啊，我这样折磨他是帮他洗净这一生的罪孽啊！」师父一边解释，自己也一边流泪，不过叫太太不要告诉密勒日巴这个情况。</p><p>最后房子终于盖好了，师父让他过关了：「嗯，看你还像个真学佛的样子。」就教给他法门，叫他去住山洞闭关。在山洞里，密勒日巴没吃的，就割草来吃， 一身脱得光光的，拚命用功。</p><p>密勒日巴出家以前有个未婚妻，家里还有一个妹妹。她们知道密勒日巴在修行，但不知道在哪里。最后终于找到这个山洞，见他一身光光，瘦骨嶙峋的在打坐，就忍不住哭了，并把眼睛遮起来。密勒日巴问她们为甚么不敢看，她们说：「你自己看看，你一身都是光光的。」「这是妈妈生的，大家都一样，有甚么不好意思！」于是，未婚妻和妹妹就去外面化缘，弄来些布给他做衣服，弄些腊肉之类给他补身体。</p><p>这本传记写得很有趣，像小说一样很热闹。随后，他未婚妻和妹妹又下山化缘去了，他就把布剪了，做了几个套子，把两只手、脚，和生殖器都套起来。妹妹和未婚妻化缘回来，给他弄些供养来吃，见他这个样子，妹妹就问他：「哥哥，你怎么搞的，好不容易化来的布，你怎么搞成这个样子？不伦不类！」他说：「你们认为最难看的，我把他们套起来就好了嘛，修行那有时间做衣服呢？」</p><p>这样修了十几年，后来好几年也没东西吃，他还不像那位女祖师，还懂得吃药，他不懂吃，完全是靠功夫，经过了种种的病痛和苦难。他快要成功的时候，师父已经死了。师父死以前，曾给过他一个锦囊，叫他背在背上打坐，告诉他，不到万不得已，实在是遇到不能解决的问题时不能打开。现在，他功夫到了最困难的难关，不知道该怎么办，于是想起了师父给的锦囊。打开一看，里面有一句话：「此时全靠好饮食！」经过那么多的痛苦，原来现在要吃好的补充了。正好，妹妹、未婚妻给他化缘来了腊肉和酒，他痛快的吃了一顿，当然以后不会常吃啦。吃完了，人一下子就变了，能在空中飞了。所谓飞，就是得道之人，五通里头的神足通。他以后就出来宏法讲经，很多法师都很嫉妒他。</p><p>密勒日巴和六祖一样，讲出来的就是佛法，不过经典不如法师那么熟。有一位在庙子里讲经的法师，当然对他很不服气，就和他辩论。密勒日巴说：「你不要辩，你懂得甚么是空吗？」法师于是搬出一大堆理论，密勒日巴就指着大殿里的柱子说：「唉，你那都是理论，你看这个柱子是空还是有啊？」法师说：「柱子是有的，怎么会是空？」他说：「我说是空的，你说是有的。」一边说，他就用手在石头的柱子里穿来穿去。所以，一直到现在，那个柱子还是两雨截的，中间是空的。他说：「空即是有，有即是空，你们光知道嘴里讲空即是色，色即是空，那有甚么用！」法师不敢说话了。他接着指着虚空说：「你说这个虚空是有还是空？」法师说是空，他说：「是有，我脚踏到虚空走路给你看！」法师不敢说话了，就皈依他了。所以，学佛要真修实证。</p><p>现在密勒日巴的故事大概介绍完了，下面包卓立要从密勒日巴英文翻译的传记中抽出一些重点来与大家分享，剩下的大家自己去读。佛法难得</p><p>翻译：密勒日巴遇到上师之前学的是魔法，后来意识到那不是正道。他很聪明，学魔法的时候，七天就学会了呼风唤雨、下冰雹，所以开始修佛法的时候，他不是很努力，以为佛法也很容易。老师叫他闭关十四天，他开始的时候很放松，每天睡觉休息。上师检查他的进度，他因为没有做甚么也就没有甚么好报告的。</p><p>上师很生气：「你出关到别的地方去好了，我和你没缘。」</p><p>包卓立：这段小故事其实很重要。我们应该意识到学法的艰难，佛法不是很容易就可以得到的，要很努力修行才行。</p><p>怀师：也就是说，不要人为懂了一点佛学知识，打了三天坐，就以为可以到西天成佛了。</p><p>月明帘下转身难</p><p>翻译：后来，上师给他准备了需要的束西，叫他去山洞里闭关，他把点亮的油灯放在自己头上，日夜静坐，一点都不敢动。这样坚持了十一个月以后，师父和师母来叫他出关，报告自己修行的身心经历。他不愿意出来，因为身心感觉都很好，很祥和。师父和师母告诉他不要怕，说他十一个月以来，一直很精进，现在可以出来和师父说话了。他考虑到这是师父的命令，于是就遵命出来了。包卓立：很多人达到好的境界后很执着，舍不得出那个境界。</p><p>怀师：憨山大师有两句名言：「荆棘林中下足易，月明帘下转身难。」做人做事、修行都是一个道理，那个满地都是荆棘，满地都是刺的地方，脚一下去就被割破了，但这还是容易的哦！很多人不怕艰难困苦，最难过的关反而是得意的时候。学佛、作功夫，到了那个清净的时候，就像秋天的天气，月白风清，风景优美，要从这种美景中跳出来比从痛苦的境界里跳出来还要难，所以叫「月明帘下转身难」。有人是失意不忘形，这已经很难了，但是要他做到得意不忘形，不要认为自己了不起，这个比失意不忘形还要难。所以佛法世间法都是同一道理。</p><p/><p>擅自出关的后果</p><p>翻译：人身难得，不能浪费做人的机会，能有血肉之躯是我们的幸运，利用得好的话，我们可以走向解脱之路。要想解脱悟道，有几点很重要。一是要有明师指导，二是心要保持极其空明的状态，第三是要行善积累功德。后来师父叫密勒日巴去闭关。有一天，密勒日巴突然作了一个梦，梦见自己家园被毁，母亲去世，醒来时，他发现自己枕头都被眼泪湿透了，于是他起来，决定出关回家看一看。上师问他：「你当初曾经对我说，你一切都不再执着了，现在让你真正闭关，你却又想念家里，违背当初的誓言，提早出关，现在赶快回到闭关的洞里去。」上师知道，因为密勒日巴违背了自己当初的誓言，而且他擅自出关来见上师的时候，师父正在睡觉，这个征兆表明他这一生就再也不能见到上师了。</p><p>怀师：这点需要讨论一下。密勒日巴活佛当时很年轻，聪明绝顶，所以修黑教的法门时学得很快，不像我们一般人，一辈子也学不会。他就是因为自己太聪明了，和龙树菩萨一样，把佛经拿来一看，觉得自己也可以成佛，很傲慢，所以你看他，很任性自己就出关了。这就像现在很多人，也跟着我学了一点点佛法，其实大家也没有真正跟我学甚么，修持一点都没成，就觉得自己很灵光了，就出来作大师、作师父了。这都是自作聪明，都是大问题。所以密勒日巴这一段很值得注意研究。</p><p>翻译：因为他已无缘再与师父见面，于是师父作了一个很正式的法会，传大法给他，并告诉他：「你不要以为自己没有给我甚么供养，就认为我没有把所有的法都传给你，我已经把所有的法都传给你了，而你求道的愿心就是对我最大供养。」之后，离别的时刻到了，师父为密勒日巴示现神通，并告诉他随便显示神通是没有意义的，现在现神通是为了坚定密勒日巴的信心。师父要他记住，一切如幻，要他依此修行。师父叫他去罕无人迹的深山老林里去修行，还给了他一个锦囊，让他在最困难的时候打开。临行时，大家都难过得哭了。</p><p>包卓立：现在我们很幸运，就在老师身边，可是我们都没有很努力的修行，等到将来有一天，老师离开的时候，我们恐怕就只会哭了。密勒日巴修行的身心变化</p><p>翻译：之后，密勒日巴就去闭关了，并发誓若不悟道就不出关。闭关期间，他有类似移喜磋嘉的经历。由于身体很虚弱，他呼吸困难，拙火无法发起，身体感到寒冷。</p><p>包卓立：书中说，他拙火无法发起是因为他身体太弱，以我来看，他以前能发起拙人是因为他在上师身边。现在我们也在老师身边，应该珍惜这个机会，好好修行。</p><p>怀师：密勒日巴前面经历的也还不是真正的拙火，就像现在很多修行人，身体得了一点定，有一点暖，就以为是拙火发动了，其实那都是拙火的假相。你们看，到了他这个时候，你就知道真正得暖不容易了。</p><p>翻译：后来，他还经历了很多和移喜磋嘉相似的艰苦，一直到最后，他打开老师给他的锦曩，知道应该补充营养。吃过东西以后，他继续按老师锦囊的指示修习瑜珈和静坐，他感到自己的中脉和各个微细的脉都打开了，他感受到乐、明、和清净的觉性，以前只是理论上懂，现在是真实的体验。他领悟到，不完美也就是完美；他意识到，法其实是极其平凡简单的。之所以有轮回是因为我们错误的观念，通过觉悟可以达到涅槃。他认为，他有这一次的清明觉悟的经历，是因为上师的指导、自己以前的修行，以及这些食物。他理解到，密宗的修行方法，就是通过触受的经历达到形而上精神的成就。</p><p>怀师：也就是把前五识转化为阿赖耶识的现量境界。他吃的这个食物，相当于道家讲的地元丹，因为这些食物都是地球上的产品；他的那个清净的境界，就相当于道家讲的天元丹，所谓天，就是天然的意思。他经过老师准确的指导，气脉发生变化，精化气，气化神，转变色身，这是人元丹。</p><p>翻译：后来，他白天的时候可以随意变化自己的身体，可以腾空飞行。晚上梦中，他可以毫无阻碍的畅游整个宇宙法界，可以有数以百计的肉体和精神化身，可以去不同的佛国听法，还可以给很多不同种的有情众生说法，同时，他的身体还可以变为火焰或者喷水。因为他的肉体可以飞行，所以他还曾飞到自己以前打坐的山洞去。.</p><p>怀师：据傅记上记载，有些与他没缘的人去看他，他就会变成狮子老虎在路上把他们吓走。那些狮子老虎是他变的，不是真的，可是，如果你硬要进去，那些老虎真会吃人哦！那些猛兽是真，也是幻。有人问他何以有这样的神通，他说了一个最重要的秘诀：「心气自在。」如果一个人修行到最高的止息境界，心息自在的境界，那么只要念头一动就甚么都能变出来。重点是你能不能做到自在，一般人也都在那里呼吸，但一点都不自在，无法控制宇宙之间的能量。密勒日巴在他那个境界，已经可以自由控制那个能量了，可以作主了，所以他身体可以畅游法界，到其它佛国听法。这个等于是道家的出阳神。</p><p>李居士：假如一个人只有法身智慧般若成就，没有色身成就，他也能做到这些吗？</p><p>怀师：也可以！如果真正法身彻底成就的话，也可以做到这个，那就要看你的功力了。</p><p>李居士：如果以他们的方法修色身需要很长的时间，如果法身成就的话，色身也会跟着转变，那我们是应该先修色身成就呢？还是法身成就呢？</p><p>怀师：这个修行次序的问题，要根据各人多生累劫修持的路线和业报而定，但最后结果都是一样的，到了最高处都是一样的。《楞严经》上讲，「迟速不同伦」「归元无二路」，虽作用不同，但到最高处结果还是一样的。这就是中国的禅宗，也就是大密宗，跟西藏修拙火的方法是两个不同的路线，怛最后是一样的。</p><p>所以中国过去的大禅师只强调法身证入，不管色身的转化，一样可以到达。密勒日巴的师父另有弟子，走的是修法身的路线，但他特别指定密勒日巴走拙火修色身报身的路线。五神通和生理、物理、拙火有绝对的关系，有了神通，世界上的人才更相信、更推崇你。法身只能在学理上、般若上知道，但般若智慧对一般人来讲是很难看见的。像过去道家有人专门炼气炼剑仙，鼻孔里出两道白光，千里之外可以杀人，可以砍树，这样的话就轰动了，大家就认为他一定有道。但是密勒日巴不同，他是报身、般若成就都有的，他是真正的有道。甘波巴大师的修行</p><p>翻译：密勒日巴大概有五万个喇嘛和五百个稍有成就的学生，甘波巴是其中一位。甘波巴年轻时做过医生，结过婚，也有孩子，后来太太和孩子在一次流行疾病中去世了，他后来也决定出家了。甘波巴曾做过喇嘛，位置很高。他精通教理，实证方面也很有造诣。但是他知道自己那些只是理论，还没有真修实证的道，因此决定拜密勒日巴为师。</p><p>密勒日巴问学生甘波巴：「你以前都学过甚么法，得过甚么灌顶？」甘波巴说自己曾经得到过很多大师的灌顶，并曾经连续七日打坐不下座。密勒日巴笑着回答说：「七日不下座算甚么，你不是还没有见过明点吗？你要知道，任你如何，你都没有办法从砂子里挤出油来，油是从芥末籽里挤出来的！如果你真想了解心的本体，你就跟我学习拙火吧。」.密勒日巴告诉甘波巴：「我并不是说你以前学的柬西都不好，但是你要知道，与上师的前世因缘对你的修行是很重要的，你要成就就一定要学习我的传承。」</p><p>甘波巴开始根据密勒日巴的指导修行，他一开始就得益不少，但后来，他发现密勒日巴的教导和其它师父的教导有不同之处，于是向师父请教。「师父啊，第一，根据我以前学的理论，供养上师一根头发的功德比供养三世诸佛山一样多的珠宝的功德还要大，有没有比这个更好的积累功德的方法呢？」密勒日巴回答说：「有啊！对上师的话信受奉行功德更大。」怀师：对！根据过去佛经的翻译，同样的供养，如果给十方三世诸佛，其功德不及供养上师功德的百分之一，乃至千分之一。但是，供养上师的功德，不及依照上师指示的法门切实修证的功德。即生成佛</p><p>翻译：甘波巴接着问密勒日巴上师：「我曾经问过几位上师，一个人是否可以即生成佛。不同上师给了我不同的答案。有的说，如果一个人对此生毫无执着的话，可以做到即生成佛；有的说，如果我吃了某种药，得长生不老，与日月同寿，我就可以即生成佛了；也有的说，修行七世以后即可成佛；也有的说，如果我能看见庄严的神，就可以即生成佛；更有人说，如果我有能力自己到其他众生国土的话，我就能即生成佛。到底哪个答案是对的呢？」</p><p>密勒日巴回答说：「对此生毫无执着，这一点很重要。如果一个真正的上师认为你有修行的根器，只要你按上师的指示，连续的修习咒语坛城的生起和圆满次第，上等根器的学生可以即生成佛；中等根器的学生会在临死时成佛，或者他们会在中阴身成佛；即便是很懒惰（一般）的学生，如果他遵守自己的誓言的话，也可以在七生或者十六生内成佛。」另外密勒日巴还告诉甘波巴说：「即使你偶尔有乐明无念的经历，如果你不能确实彻底证悟到心的本质，那还不是悟道。」</p><p>怀师：假设达到了乐、明、无念，还不算是得道，必须要彻悟，也就是要明心见性，用中文来说，就是要透彻的明见本性。许多学密宗的，以为乐明无念就是最高的了，得道了，那都是不对的。乐明无念是一个定力，是一个净光的境界。</p><p>翻译：密勒日巴继续教导甘波巴说：「一切众有情本觉具足，佛就是法界的净光。通过修习各种法门，修行人自然可以证道，烦恼自然消失，二元观念自然解脱，智慧自然降临。那种感受无法用言语形容，就像聋哑人的梦。虽然众生具足佛性，但众生看不见这一点。所以，能够追随有传承的上师是很重要的。本觉无始无终，本觉遍布法界没有障碍。本觉非言词可说。所以，不要故意造一个甚么，只要你放松，解脱，心的自然状态就是本觉。」</p><p>怀师：用中文叫「任运自在」。</p><p>翻译：密勒日巴接着说：「你只需观照自心，不需心外求法。」</p><p>怀师：按禅宗来说，就叫「不从他得，不从外求，但自观照自心。」</p><p>翻译：「你不需要清除昏沉与散乱，这是最高的修定方法；如果你用心去清除，那无异于白日点灯。不要在接收与拒绝间徘徊，没有分别心就是最好的行动。」</p><p>怀师：中国的大乘经典《圆觉经》有类似的说法，不过那是佛说的，比这个要高明多了。 居一切时，不起妄念；于诸妄心，亦不息灭；住妄想境，不加了知；于无了知，不辨真实。这是佛亲口说的，是佛的大手印，是经典，是心法。</p><p>「居一切时，不起妄念；于诸妄心，亦不息灭」，对于妄想心，不要再用一个心把它压下去。「住妄想境，不加了知」，不要另外再加一个知性。「于无了知，不辨真实」，统统都没有了，不增不减了。这时，不再动那些念头：哎呀，不知道这个对不对；哦，就是这个……等等。</p><p>翻译：「放松并坚定对正知的信心，觉性就在你心中，上师就在你自己的心中。」</p><p>怀师：本身就有佛性，本身就是上师。</p><p/><p>五方佛显现</p><p>包卓立：甘波巴修行的经历很独特，别的书都没有类似的记载，所以我们下面介绍一下他的一些闭关修行故事。</p><p>翻译：他在两个山谷交界的一个山洞里闭关，没有穿任何衣服。虽然夜风凉飕飕的，但他身体里面有一种很快乐的温暖的感觉。整整七天，他都没有躺下来，一直都在静坐的姿势。第七天早上，五方佛在他的境界里自然显现。</p><p>怀师：这个不是分别观想引起的，是自然显现。</p><p>翻译：他觉得这个经历太重要了，就报告了密勒日巴上师。上师告诉他：「如果你揉揉眼睛，你会看见两个月亮，你的这个经历和看见两个月亮一样，没有甚么了不起，也没有甚么好与坏。你有这种现象是因为你掌握了身体内的风大。继续修持下去。」</p><p>怀师：《楞严经》上说，「十方诸佛，同时显现」，这种境界不过是第二个月亮的影子，并不是得道。《楞严经》关于五十种阴魔的部分说：「不作圣心，名善境界」，如果你不认为那些境界是甚么了不起的成就，那些境界就是你的功德，是你的进步；「若作圣解，即受群邪」，如果你认为那就是得道了，了不起了，就是着魔了，佛变成魔了。这四句话很重要，佛在《楞严经》上讲五十种阴魔的时候，每讲到一种魔境都会重复这几句话，这是一个大原则，不管遇到任何好坏境界，都按这个办理就对了。我平常也经常告诉你们，这些境界都是由于四大的气，以及生理、心理互相磨擦所引起的现象。</p><p>翻译：听完师父的话，甘波巴继续修持。虽然师父告诉他那些境界并没有甚么了不起，但是他仍然觉得很受鼓舞，很高兴。他很有劲头的又继续修持了三个月。）</p><p>怀师：讲了半辈子的佛经，总算看见佛了。等于说，追求了几十年，终于让他找到了，当然高兴啦！还精补脑 化精为气</p><p>翻译：有一天早上，他突然感觉到整个三千大千世界像轮子一样的旋转，他开始头晕并呕吐。由于身体消耗得很严重，他昏倒了，很久以后才醒来。师父告诉他，这是由于左右脉的风进入中脉的原因，非好非坏，让他继续修持。又有一天，他看见洞内充满了观世音菩萨，而且每个观世音菩萨的头顶都有一个圆光。师父告诉他，这个现象是因为甘波巴头顶的大乐轮里的精增加了，这个非好非坏，并叫他继续修持。</p><p>李居士：我也有过类似的经历，但是看过一次以后就没有了，这是为甚么？</p><p>怀师：那是因为你没有专修。</p><p>包卓立：当头顶大乐轮刚打开的时候，头顶上好像有一片水银似的。</p><p>怀师：你们看，这些有成就的大师讲的法，这么平常，这么好，不像那些普遍做法师的邪门外道的师父会说：「哇！你这个不得了了，菩萨现身了」，那样讲的话，就会把自以为了不起的人都引向魔道了。</p><p>包卓立：甘波巴的师父说，他的这个经历是因为精从底部上升到脑，头顶的精增加了。老师您认为应该是精还是气？</p><p>怀师：「乐由精生，明由气生。」这是我的口诀，是大秘密，我以前都告诉过你（指包卓立），但是你都不记得。精充满了就要开始化了，化了就会得乐；而光明是由气生的。所以，看见光明充满十方世界是由气生的，也不过是如此。「无念空，由神生」，所以道家讲的「精化气，气化神，神还虚」都是对的。道家这句话连下来的最后一句是：「虚空粉碎，大地平沉」，虚空都粉碎了，归到本位。如果还有个空的境界，那就是四禅八定的空无边处定的境界，那还是在唯心、唯识、第六意识的境界里。「粉碎虚空，大地平沉」讲的是般若彻底的空。</p><p>包卓立，这可是我的专利，不能随便卖哦！如果自己没有修证到，随便传人，叫「未悟谓悟，未证言证」。等于说，一个没有钱的人冒充有钱，骗人，那可是犯菩萨大戒哦，弄不好会堕落很厉害。所以密宗叫你守秘密，也是这个原因。道家也说：「妄传非人，必遭天谴」，因为自己喜欢吹牛，喜欢表现自己高明，随便传法给不是根器的人，会得上天惩罚，会有果报的。有人甚至会把命都丧掉，这可不是开玩笑的。</p><p>李居士：如果是观想菩萨，带动自己内部气脉变化而引起的光明，不是自然显现光的话，是不是也是由精化气引起的？</p><p>怀师：对，也是同一个原因，差不多。</p><p>李女士：英文原文说顶轮的大乐轮里面的精增加了，这是不是道家讲的「还精补脑」？</p><p>怀师：这样讲也差不多，其实差不多快要化气了。</p><p>李女士：道家讲的「还精补脑」这个时候，是开始化气了还是已经化气了？</p><p>怀师：在下面的时候是精，到脑上以后同时就在化气，几乎没有界限差别。但是严格的讲，是有先后，有逻辑层次差别的，这是很精细的。所以古人有的道书上写真精、真气、真神。普通人哪里懂这些呢！真精的精不是男女交媾的精，是已经化掉的精；真气也不是呼吸之气，是安那般那止息的「息」，真息；真神也不是普通精神的神啦！通常我们说一个人头脑好，会做文章，会发明，那还是普通的神，还不是真神。</p><p>道家有句术语：「还精补脑，长生不老。」这两句话讲生命的科学，很重要。普通人性交做爱，最后达到高潮，精就出来了。你以为精是下面两个睪丸变成精虫出去吗？实际上，精是脑下垂体、间脑中间荷尔蒙降下，再通过全身内分泌到达下部，然后再变成精虫放掉的。所以真正守戒是很痛苦很难的，一般人做不到。「还精补脑」的「精」不是普通人讲的精虫。精到了脑，化为气的时候，就会有光明出现了。很多人头容易昏沉，头脑不清楚，智慧不够，定力不足，杂念多，反应慢，这都是脑不健康的表现。脑很重要，就像中国人说的：「一分精神，一分事业」。从脸色看功夫</p><p>怀师：有些人修道家练气功，拼命忍精不放，把精向脑子引。这种练法很糟糕，会出毛病的。他引的不是真的精，而是有形的精，这样甚至会把大小便的毒性都引到脑子里面去，结果不是变神经就是会早死。记住，真精是无形的！</p><p>有的人修道家，忍屁不放，认为放屁会把元气放掉，这样打坐的话，慢慢毒气会提上来，从督脉行到脑，把那些大便大肠的毒都提到脑子，他不死不疯才怪呢！这不是修道，这是修屁道，修尿道。还有人搞双修、采补，把那些杂质引上来，看上去都是红光满面的，但是红光中带着紫色、黑色。一般人不知道，看见黑黑红红的，脸上发光，还以为这家伙有道呢。这些人的脸色就像油没倒干净的炒菜锅，油光油光的，是凡精之气。这样修双修、修采补是往魔道鬼道上走，死后还要下地狱，至少是变畜生，千万不要玩这种把戏。</p><p>李居士：那些人看起来很脏很浊。</p><p>怀师：有些牢里面的犯人也是这种脸色，有经验的法官一看就知道是犯罪的，满脸黑亮黑亮的油光，和锅底的油光一样。道家看一个人是不是真有功夫，有这么两句话：「面如冠玉，碧眼方瞳。」面色像新玉那样润泽，眼睛清亮有神，瞳子好像方的，有轮廓，这种情形差不多有一点精化气的样子了。另外，「呼气如龙」也是有功夫的人。</p><p>李居士：我有「呼气如龙」的体会。假如你全身放松，进入一个很静的境界，只有一个很清明的「觉」，然后你就会全身呼吸，吐出来的气也会很大。</p><p>怀师：中国人用字很讲究，狗是「吠」，狼是「嗥」，虎啸，鹤唳，鸡啼，鸟鸣，龙吟，用的字都不同。李居士讲的那个还是有形的，你越放松就越好。文化不同的差别</p><p>怀师：中国那些禅宗祖师以及修道成仙的经验都很多，但是中国文化不是很科学化，而是很文学化，从来不强调这些，都是简单几句话就带过去了，很可惜。这些东西后来传到西藏，他们很重视这些，记录得很清楚。真正的逻辑学是佛家因明，从印度开始的，西方人说印度因明是从西方逻辑学来的，那是说反了。佛学唯识法相的学问很讲究逻辑，再加上玄奘法师的翻译很老实，结果大家愈看愈糊涂。逻辑的文章没有那么美，而中国人喜欢文学化的东西。</p><p>赵教授：中国人的语言不够逻辑化，对研究唯识也许不太方便，但是，对禅宗来讲，中国文字可能有特殊的优势，因为道是不可言表的。中国文字有点朦朦胧胧、模模糊糊，反而能让人理解不同层次的意思。</p><p>包卓立：加果说印度是逻辑的文化，中国是文学的文化，那么西方是甚么样的文化呢？因为这个研究以后要出英文书，所以问老师这个问题。</p><p>怀师：西方文化也是偏重逻辑，所以走向了科学的路线。不过，印度的文学也很美，我们前面的结论都是比较的讲法，实际上，每个文化都有逻辑和文学两面，只是偏重有所不同而已。</p><p/><p>地狱 六道 曼达拉</p><p>翻译：有一天傍晚，甘波巴看见金刚地狱，同时，他心脏部位有堵塞、收紧的感觉，心风生起，他感到很忧郁。上师告诉他，这种现象是因为他的腰带系得太紧，影响了上行气的正常运行，他松松腰带继续修持就好了。</p><p>怀师：有时候消化不良，或者食物中毒也会带来这种现象，不只一个原因。</p><p>包卓立：我曾经两次在梦中看见地狱的情形，两次都是因为按摩腿太厉害，腿被弄得青一块紫一块。人死的时候，灵魂如杲是从腿下面出来，脚会发烧发热，会到地狱去。</p><p>怀师：有时候是发冰，不见得是发热。</p><p>翻译：又有一次，甘波巴突然能够看见六道众生，从欲界天神到地狱众生，都看得很清楚。同时，他还看见诸天降甘露给低层众生饮用。他看见母亲很瘦弱，快要死的样子，她很渴很饿，但是无法饮用那些甘露。他向师父请教，师父回答说：「之所以有甘露，是因为你喉部受用轮处的左右二脉里面的精增加的缘故；你以前经历的恶心的感觉是因为风进入脉道的缘故，这次的经历不是因为风，而是因为精进入脉道；你看见母亲无法饮用甘露，那是因为你中脉的开口处还没有打开。这些都非好非坏，继续修持，不要害怕。」上师教了他很多瑜珈方法，他继续修持了一个月。后来，有一天，由于他练瑜珈的原因，身体开始抖动，他无法自制，他开始哭泣，并想大喊。甘波巴自问，我是鬼魔附体了吗？上师告诉他，这是因为心轮处精增加引起的，并叫他继续修持以前教他的瑜珈。此后，甘波巴基本不需要进食了。</p><p>又有一天，他看见日蚀和月蚀，龙头魔的两个尾巴把太阳和月亮光都挡住了。他请教上师，师父告诉他这是因为左右脉的风进入中脉而引起的，夸他很勇敢，并叫他继续加倍修持。回答完他的问题后，上师自言自语的说：「有一个至高无上的柬西，就是这个时候了，就是这个时候了。」讲完这些，他再没说甚么。</p><p>包卓立：有时候南老师也是告诉我们一句话后就不再讲甚么了，我们都没有往意到，其实，他是讲了一个很重要的事，讲完了就过去了，可是我们经常就忽略过去了。</p><p>翻译：之后，甘波巴回到洞中继续更加努力的作功夫。一个月后，他见到红色喜金刚的完整曼达拉。这时他记起上师上次说的话：「就是这个时候了！」莫非上师早就看到我本尊会显现？他请教密勒日巴上师，上师告诉他，这是因为从母亲那里来的红菩提从他身体下部上升到心轮部位而引起的，非好非坏，并叫他继续修持。</p><p>他继续修持。有一天，他看见现骷髅身的上乐金刚的曼达拉。他请教上师。师父告诉他，这是因为他的脐轮（也叫转化轮）部位精充满了，并叫他继续修持。十四天后，他感觉到自己的身体如天空一般大，而且，从头到脚整个身体都充满了六道众生。大部分众生只是在饮食一般的牛奶，其他的则是饮用从星星上流下来的牛奶。他同时听到暴风雨般的咆哮声，当他把打坐的腰带松开后，咆哮声就消失了。他又去请教上师，师父告诉他，这说明气把精推到了你身体的各个细脉中，现在是把业气转化为智慧的时候了。此后，密勒日巴上师传拙火大法给他。</p><p>又有一天，他似乎看见整个山谷充满了烟，到了下午，就变成漆黑一团了。他看不见路，摸索着找到师父那里。师父告诉他，不要担心，叫他放松、静坐，并教他清理上身的阻塞。之后，黑暗就消失了。又有一天晚上，他看见自己的身体没有血肉，只是一个用气脉连接起来的骷髅。师父告诉他，这是因为他太努力、太心急了，叫他修安那般那的时候再放松一点。遵照上师无价的指导，他回到山洞里继续修持，虽然他是坐在硬硬的石头上，他却感觉很放松很舒适，气可以在身体内自由流动。</p><p>怀师：甘波巴这个人真是很笨。教理虽然很通，真做起功夫来就甚么都不知道了，没有智慧，所以他的教理都是白学的。要是按中国禅宗的教育法，他每到老师那里问一次问题都要挨老师一顿棒子打，而且老师也不会告诉他怎么做。他的经历都还是在玩弄生理的变化，在色阴境界那个小范围里转动。所以过去禅宗教育有成就的传记里都不记录这些，记录这些是很丢人的事。所以达摩祖师说中国有大乘气象，很不同。不过，大家听了这句话，不要自豪，现在一般人连甘波巴整个程度都还没有呢！</p><p>这些经历都是在色阴区宇，而且还是很低层的身体生理变化。总的来说，这些现象说明身体生理、气脉在转化。中国道家不一定走同样的路线，他们有时靠药物外丹帮忙，身体可以转化得很快。现在欧美人看了这些藏密的书，「哇，这个好，这个好！」其实在中国道家禅宗来讲，这些都是四个字：「不值一谈」。即便是用现在所谓科学来讲，这些记录也不完全，比如他们都没有说明大小便，睡眠，皮肤等等的生理变化。</p><p>所以，如果要配合现代科学来研究，就要用血压，心电图，脑电波等等了。可是这样一来，很多人又会吓死了，哎呀，我血压为甚么这么低啊，哎呀，我心脏好像有问题了，还会有人说你营养不良啦，需要多种维他命啦，等等。真正修道，就要像古人说的四个字：「生死以之」，把生死都置之度外。说起来容易，做起来难，现在哪里会有这样的人！现在人是书读得越多，离道越远。</p><p>密勒日巴这位师父指导得很好，但还不够大乘的道理，其实每一个生理变化都牵涉到唯心唯识的一面，但他都没有讲。</p><p>翻译：甘波巴接着回去修持。一个月后的一天，他看见七个药师佛的面孔，这个时候，他每天只需要呼吸一次。当他呼出一口气的时候，药师佛就消失了。又有一天下午，他静坐闭气，看见无际无量的佛之化身了（sambhogakaya） 和其它奇妙的景象，他太激动了，气呼出来，这样一分神，那些境界就消失了。</p><p>怀师：分神了，气当然就闭不住了。</p><p>翻译：傍晚的时候，他继续修持闭气。</p><p>怀师：应该是止息。</p><p>翻译：这次，他看见有一千个佛围绕着释迦牟尼佛。他再一次请教上师。师父告诉他：「你不用告诉我，你看到甚么我已经知道了。现在你已经看见你本尊的化身和报身，但是你还没有看见本尊的法身，很快你就会看见了。」</p><p>李女士：为甚么他一天只需要呼吸一次？</p><p>怀师：这是修安那般那修气来的。真有止观有定了就会这样。甘波巴每天还需要一次呼吸，止观真到了以后，七、八天才需一次呼吸。</p><p>翻译：上师告诉他，你很快就会有各种各样的神通了，这个成就的路途上会有很多障碍。你要对那些神通保密，因为坛城是密宗的一种教法，只有根器好的学生才有资格学习。</p><p>怀师：神通可以对师兄弟、上师讲，不能随便向其他人宣扬，因为那是犯戒的。甘波巴的这些经历都是修气修安那般那到止息境界才来的。大乘教理告诉我们，我以前也经常讲：止是定的因，定是止的果。光靠止定的境界就已经可以得五神通了（天眼通，天耳通，他心通，宿命通，神足通），但这还是凡夫境界，还是会漏，这时，就要由止转观了。观是心地法门，智慧境界、般若境界。如果不转成观，纵然修成飞空自在和五通，都还是外道妖怪。注意哦，还没有第六通哦，第六通是漏尽通，是佛法境界。像前面讲的那种情形，以中国禅宗来讲，师父就会拿棒子，打你这个笨蛋。但是现在中国也没有禅宗了！</p><p>翻译：密勒日巴告诉甘波巴：「你对心之本质的领悟会越来越深刻，当你真正证悟到心的本质的时候，你就会发现，你的上师就是佛，不可动摇的诚信就会在你心生起，到那时，你就可以宏法带学生了。」</p><p>包卓立：很奇怪的是，英文的传记讲到这里，就笔锋一转，说密勒日巴叫甘波巴练习把气运到指尖。甘波巴很快就练成了，师父告诉他，现在他已经大概掌握了自已的气了，不再需要和师父在一起了。</p><p>怀师：这就是藏密，始终差一等。大家还记不记得，开始的时候，密勒日巴把甘波巴骂了一顿，说他只知教理，教理有甚么用？教他修拙火的路线，所以才有这些报告。其实，不走这条路线也会经历这种情形。这里讲到，甘波巴还要把气引到指尖，其实安那般那修好了，气自然会通达四肢，乃至指甲，统统圆满，用不着练。他们这里描述的这种练法，等于是练武功一样，已经很下乘了。甘波巴现在还没有神通，即使有神通了，出去宏法，也还是外道，没有般若。不过，他的上师吩附他，你将来自己会悟道，会出去宏法，你会见到我佛性的境界。这样还可以，否则是不行的，只能教教那些竹字头（笨）的众生。不过这个世界竹字头众生很多。</p><p>翻译：接着，密勒日巴把自己的衣服掀起，露出自己的屁股给甘波巴看，告诉他：「谁有资格接受我这宝贵的教法呢，现在我就把这宝贵的教法给你。你看，这上面都是硬茧，我是经历了无数的苦行才到达今天的。我之所以成功，就是因为我不懈的努力，能否成佛，完全看你的努力，这是我教法的中心点。你以后也要坚持在一个地方，一个位置修持，直到你悟道为止。佛教最深刻的教法是：实际修行求证！孩子，听我的，就像儿子听从父亲的指导一样。」这段话给甘波巴留下了深刻的印象，在他以后无数次的困难中给他鼓励。</p><p>怀师：大家都说密勒日已成了佛，看了这个资料，我只能给他个大阿罗汉，我以前也是这么告诉你们的。如果他真的成功了，即使是永远坐在石头上，他的屁股也应该是光润的，怎么会有茧呢！这是第一点。第二，中国禅宗这样苦行的多得很，长庆禅师坐破七个蒲团还没有悟道，他没悟道屁股也没有坐出茧疤来呢！中国禅师们这些经历多得很，写出来给西藏人看看。给那些竹字头的人看看。</p><p>翻译：和密勒日巴同一传承的，还有一位得道祖师谛诺巴，他比密勒日巴还要早。我们很简短的介绍一下他的情况。谛诺巴的师父叫他白天在妓院里为妓女带客，也就是帮助妓女把男客人带进带出；晚上叫他锤芝麻籽榨油。通过这种修行方式，他证得了真如。谛诺巴说：「从绝对真理的角度来讲，没有甚么法门可修，得到与舍弃之间也没有甚么分别，成果时，并没有得到或者丢弃了甚么。但是，从相对真理的角度来讲，一切法都是基于因果论而来的。每个有情都有佛性，在条件因缘合适的时候，佛性才会被开发出来。」</p><p>怀师：一切众生皆有佛性，好好用功，时间因缘到了都会悟道的。</p><p>包卓立：像宗喀巴大师，虽然他成就那么高，根器那么好，也还是要经过很苦的修持。他做了三百多万的大礼拜，一百八十万的曼达拉。</p><p>怀师：大礼拜，供养佛，这些都是加行法，资粮位。根据弥勒菩萨所讲的标准，修行有五位；资粮位，加行位，见道位，修道位，以及修道以后的究竟位。</p><p>一个人成就以后，比他高的人知道他的成就，别人就很难说了。这些材料对心地法门都没有提，对那些贪瞋痴慢疑的八十八结使习气都没有提。大概说起来，显教比较偏重心理和外面的行为，贪瞋痴慢疑减少到了某个程度才能跳出欲界，进一步减少以后才跳出色界。密宗这套比较迷人，讲的都是功夫，很好玩，像演电影﹂檬，境界很多。</p><p/><p>功夫 心地法门</p><p>包卓立：孔夫子主要是讲修心行为，和显教一样。</p><p>怀师：孔夫子有大乘菩萨的功德。孔子、老子差不多都是十地以上的菩萨了，庄子也是菩萨境界。他们都是用大乘心地法门，再配合人道天道的行为来修行的。孔子对色身转化这些都不谈，孟子则谈得比较多，孟子的安那般那养气功夫是很标准的。</p><p>刚才讲到密勒日巴教甘波巴把气硬引到指尖，这些英文翻译都是有问题的，要看藏文原文。应该是教他怎么样让气发起作用。前面介绍的这些都是走拙火的路线，拙火修法也叫军荼利，是欲界天升色界天最高的修法。这个修成了，就会自然发生清净光明的境界，但这还不是佛，那只是佛的清净面，整个的佛还没有完成。按禅宗讲，你这时只能成佛，还无法「成魔」。不是说魔比佛大，而是说你只认得白的那一面，还不认得黑的那一面。没有外境诱惑的时候，你是圣人，有外境诱惑的时候，你是人性。包卓立，你看，我讲这句话的时候，有多少人在听！我这可是很负责任的话哦！</p><p>包卓立：我们前面介绍的那些大师们，都没有走心地法门的路线，所以他们都没有到达色界天？</p><p>怀师：我没有说他们没有到色界天，我只是说他们这几个人比较注重拙火修法，他们应该也配上了心地法门，只是书里没有讲而已，并不是说他们没有修心地法门，别的书里、别的地方也许讲了。</p><p>这些书留下来的都是告诉我们怎么作功夫，这就好比是我们现在写一个人的传记，讲他年轻的时候怎么苦，后来多么有学问，是博士，再后来又怎么去做事。至于当初别人是怎么教他的，写得并不仔细，不是不肯写，而是认为那些都是当然的事情，不需要写，所以没写。因此，我们研究的时候不能只看到他写的这一面。一般人看了这些传记上写的功夫这一面，就死死盯住了，以为这些功夫就是佛法，这是错误的。大乘是要利世、利众生的。关于这一点，这些传记里面没有说，其实也说了，所以师父叫他们修成以后要出来利世。关于这一点，他们说的不多，不是不肯说，而是觉得那是很自然的事。可是我们后世的人看了以后，只知道抓功夫这一面，结果那些学佛修道的人都是越学越自私，心地行为习气甚么都没有转变。所以，有很多人，功夫经验都很了不起，做人就一塌糊涂了，更别说做佛了。</p><p>至于做功夫方面，不要说安那般那、拙火这些正道，老实讲，即便你是修外道魔道，如果你有决心肯下功夫，也会有其境界。等于现在在大陆，有很多气功啊、特异功能啊等等。其实，只要你肯做，都会有一些怪现象出来，可是大家做不到，所以就认为那些是「异人」，所谓「异人」就是不同于一般常人。如果你认为特异功能这些是道，那就是观念的大错误。这个道理《楞严经》讲得很清楚了。</p><p>《楞严经》讲到，对应色受想行识五阴，有五十种魔道，不过到了识阴就不叫魔道了，叫外道。所谓外道，就是说还没有找到本心、本性，他所认识的偏在门外。比如说，一个人站在窗子外面看我们里头，你说他看清楚了吗？没有！还隔着一层玻璃呢。所以，佛在《楞严经》里骂那些缘觉声闻，说他们还不算成佛，还是外道。我们这里是借这个题目作研究，不是故意要批评他们。他们对般若见道部分统统没有提，所以我们只是拿他们介绍的这一部分作研究，不能说他们没有般若没有见道，否则就是以偏概全。就好像李居士去作生意，一分一毫都不肯让，不肯客气，人家气死了，说你们学佛怎么还这么贪呢？其实，她的心地并不是那些人想象的那样，但是，他们了解的就只是她作生意的这一面，他们的说法就落在了一面，生意这一面。这是作个比方。罗汉有四果，初果，二果，三果，四果。初果向说明他已经修行向着初果的路线方向去了，不是凡夫，不是普通人，是果位。这个初果叫预流果，好像太子，将来有权力作皇帝的。所以四果有四个果向，每一个果分两个，一共是八个，所以又叫「四双八辈」，八个学位。到了大阿罗汉境界就是无学位了，那就相当高了，但是还是偏于空，所以佛在《楞严经》里讲，声闻、缘觉、罗汉还是外道，还没有看到全面，看到面孔还没有看到屁股，看到前面还没有看到背，看到白的还没有看到黑的，所以还是外道。</p><p>前面讲的这些人修道，看到「有」的一面，还没有看到「空」那一面；到过瑞士去滑雪，看到雪，但还没有看到水，不知道雪化了就是水，或者你看到水了，但还没有看到冰，那也不对。</p></div>"
},{
    "title": "第四章 死亡 禅病 修持",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>翻译：现在我们主要为大家介绍一下一些修行人临死时的情况，在西藏，很多修行人有功夫，就表现在他们死的方式与众不同。</p><p>缩小的彩虹身</p><p>翻译：第一个故事大概发生在一九六九年，这个人死后身体由原来的正常高度，慢慢按比例缩小到几英吋，像婴儿那么小。这个现象很多重要官员都看到过，火化时人们看见的不是五彩彩虹，而是白色的光。</p><p>怀师：白色光是对的，不是七色彩虹。</p><p>翻译：火化以后发现了很多舍利子，可是当人们想把那些舍利子拣起来的时候，他们就消失了。</p><p>一世达赖喇嘛</p><p>翻译：根据官方传记的记载，第一世达赖喇嘛过世的时候是八十三岁。临死时，他进入了坛城静坐境界，他的呼吸停止了，心脏也停止跳动了。但是，这之后三十天，他一直保持静坐状态，身体没有任何其他死亡的现象。他的身体从一个老人的样子转化成了年轻人的样子，同时，他的身体放射出夺目的亮光，亮光很亮，人们几乎无法直视他的身体。</p><p>包卓立：这里的记载不是很清楚，它说达赖喇嘛的身体变年轻了，我们不知道它是指身体变小了，还是指皮肤变好了。</p><p>怀师：这里记载不清楚，应该是指身体变小了。</p><p/><p>身体的消失和影像</p><p>翻译：有位叫大哇的修行人，他过世的时候外面有各种形状的彩虹，有方形的，也有线形的。他哥哥不相信他死了，看见他穿着衣服在打坐，可是当他哥哥抓住他的衣服的时候，发现里面是空的，只有一些头发和指甲掉在了地上。</p><p>根据记载，移喜磋嘉女佛活了两百多岁，她去世的时候整个身体空掉，只留下了鼻梁骨，指甲，牙齿，头发和体毛。这是一位叫吉尔的喇嘛。他知道自己前生曾经设陷阱，用大山石杀死过一个女巫。这个女巫这一生变成了一位公主来讨债，并准备用同样的陷阱来杀他。喇嘛虽然已经能够掌握四大的变化，可以不被石头砸死，但是他还是选择被砸死，以便了此血债。</p><p>他走进山谷的陷阱，第一块石头砸到他的腰部，他一点都没有受伤，石头上深深的印下了他腰部的印子。第二块石头压住了他整个的身体，结果他从头到脚都在石头上留下了印子。第三块石头砸在他的脚上，他接受了自己杀业的果报，死去了。</p><p>他之所以显示这些异象，也是为了教育这位女性，改变她的心，以便对她将来修行有所帮助。</p><p/><p>师子尊者之死</p><p>翻译：师子尊者是印度的禅宗祖师。他生活的那个国家的国王非常讨厌佛教，要杀掉所有的佛教徒。国王问师子尊者：「你是否已经达到了身心的空的境界？」师子尊者回答：「是的！」国王接着问他：「你已经解脱生死了吗？」他回答：「是的！」于是国王说：「既然你已经解脱生死，那就把你的头给我吧！」说着，就用剑砍下了师子尊者的头。</p><p>剑起头落，但是，师子尊者身体里面流出的不是红色的血，而是喷出了白色的牛奶一般的东西，同时，国王的右臂马上就掉下来了，七天以后，国王就死了。</p><p/><p>禅病--大发诗兴的憨山</p><p>怀师：很多人在修行的过程中，会碰到一些奇怪的身心变化和行为，这些不正常的现象叫禅病，因为修禅而产生的一种病态。通过介绍这些情况，可以帮助大家在遇到类似情况的时候，了解发病的原因，并知道如何处理。</p><p>翻译：憨山大师有一天有所领悟，一夜之间，写了二、三十首诗，思想无法停下来，而且不需要用心，那些诗句自然而然的就出来了。憨山的文学底子本来就好，但没有好到这种地步，所以他知道这样不对了，是禅病。他想起自己以前曾认识一个和尚，那位和尚也发过禅病，思想停不了，嘴里话多，甚至嘴歪流口水，自己作不了主。他问那位和尚，碰到这种情况怎么办，和尚告诉他：「最好能有明师、善知识打他一棒，使他知道，一切放下来就会过关了，就有进步了。」，想到这些，憨山就想办法睡觉，开始时睡不着，后来一口气睡了五天，病就好了。</p><p>怀师：当年也有人问过我，如果睡不着怎么办？我就告诉他，可以喝一点酒，让自己沉睡，睡醒了就好了。还有别的方法，这里就不讲了。</p><p>告诉你们这些经验都可惜了，你们也不是真的用功。有时候你如果用功得力了，精神会特别旺，思想不停，你怎么处理？到这个时候你就需要知道很多方便法门了。你们如果碰到这种情况，还要注意看发禅病的是男还是女，年龄有多大，教育背景如何，血压高还是低，等等。有人是血压高精神旺，有人是血压低精神旺，各个情况不同，所以学佛要「通一切法，彻万法源」，光知道一点点是不够的。</p><p/><p>一个印度人的拙火禅病</p><p>翻译：下面介绍的是一位印度修行者的故事。他应该已经达到了某种三摩地的境界，他走的是拙火的路线，但是还没有得道。他的故事在西方很流行，因为他的一些特殊经历，很多西方人认为修行会带来很多问题，因此产生很多误解。他已经结婚了，太太注意到他行为古怪，没有食欲，身体不稳定，喜欢不停的走动，尤其严重的是，他总是很焦急很沮丧。晚上睡觉的时候，他感觉脑子里有光在旋转，而且那些光还会在房间里形成一些令人恐怖的怪象。他自己以为这是由于灵火（拙火的别名）发动引起的，于是去请教另外一个修行人。那位朋友告诉他：「你的这种现象不是拙火，如果真是拙火发动的话，你应该感觉到乐感，你恐怕是有甚么灵鬼附身了。」他的另一位道友告诉他：「如果你的右脉先打开，中脉后打开，你就有可能被身体内部的热能烧死（自焚的现象）。」后来有一次静坐，他观想自己的右脉里面有一条细细的凉丝丝的柬西，后来这种感觉变得很真实，像真的一般，之后，他突然听到啪啪的声音，从此以后，他的气脉就开始改善了。他当时曾经很恐惧，觉得自己可能会死或者发疯。</p><p>包卓立：他的故事在西方很流行，所以很多西方人觉得修习拙火很危险，对拙火的功夫有误解，认为有可能死掉或者发疯。当然也有很多人跟他学，这个人写了很多书，但是里面并没有大多修道的东西，大部分是描述一些功夫和冥想的境界。</p><p>怀师：叫你们听这些，不是为了听故事，目的是要作研究，一方面利己，将来自己修行可以用；一方面利他，使人家了解，也可以帮助别人。这些东西现在在西方很流行，但是很乱，没有真正的明师指导。东西方文化初步沟通，大概也只能这样。这个人等于是在修瑜珈，但是他不懂学理，也没有得到正统的功夫训练。至于他为甚么学这个东西，学这个的目的是甚么，书上也没有交代。我平常一直跟你们讲，现在是二十一世纪，佛法、道这一套东西一定要配合科学才可以。我并不是说科学就可以解决问题，但是现在人类的知识智慧毕竟增加了，所以很需要配合现代科学和医学的知识，对某些现象加以了解。以后了解一个人的情况的时候，应该知道他是出家还是在家，年龄，出身环境，为甚么修持，用的是甚么法门，等等，要列一个表格，把情况都弄清楚。</p><p>根据你们刚才介绍的情况，这个人的颈椎骨以及从颈椎上来到头骨的关节有错位，内脏、胃、肝、心脏、呼吸都有问题。印度人只讲三脉七轮，所谓三脉就是左右脉和中脉。中脉是蓝色的，左脉是红色的，右脉是白中带篮，像法国国旗一样。 很多学密宗的人都是学印度这一套，觉得很稀奇，认为是不得了。我就笑他们，中国传统道家文化已经几千年了，这些都有啊！不光这样，我们还讲五方呢！左青龙，右白虎，前朱雀，后玄武，中黄。实际上，左边的这个脉是管气的，比如我们颈部的两个脉管，左边是气管，右边是食道。右边食道管切开了还可以救，如果是左边气管切了就没有救了。光的颜色与健康</p><p>怀师：另外，中国的五脉还与五脏六腑有关系。五脏是心肝脾肺肾，六腑是三焦、大小肠、胃、膀胱、胆。其实，中国五脏六腑十四经脉互相都有关联。而印度的那一套就不管这些了。当然中国道家也不懂三脉七轮，大家都是偏的，不完全。</p><p>我以前也告诉过你们，打起坐来有时候会看见不同的光色，或者不修行不打坐的人，偶然眼睛花了也会看见光色。如果看见的是红色、紫色，说明与心脏有关系；黑色的与肾脏有关系，白色与肺有关系；绿与胆有关系；青色或者紫青色与肝有关系。</p><p>比如打起坐来，如果看见黑点，就晓得是肾的关系了。另外，黑点也是灾难，说明会有点小灾难，像伤风感冒等等。如果黑色浓一点，或者大一点，说明外面有灾难，甚至可能代表死亡的前奏。如果看见红色，晓得是魔障，有障碍，也可以说是心脏这一部分有问题。也许是旁边有点发炎，心有点紧张，不见得是心脏。如果看见绿色，与阿修罗外魔有关，这个更严重了。如果是青色，肝气来了，事情会有点不大顺利，或者会有烦恼了。最好是白色，金色，清净的色。但也不一定，有时候是五色俱全，是清净吉祥的意思。你要有智慧才能判断。一般来讲，吉祥、平安、舒服、得喜乐都是对的，假设不对，就应该检查身体了。</p><p>李居士：我住院的时候，开眼闭眼看见的都是黑块，平时打坐的时候也会看见黑色，但是都很小，是黑点，开刀的时候，是很大的一块，而且还会看见绿光，我知道逃不掉那一刀了。阿如也看见病房里到处是蚊子，上千上万个蚊子，其实不是蚊子，是黑点，像蚊子一样。</p><p>怀师：你们现在还没有经验，到死亡来的时候，也是一片黑，很恐怖。你们现在这样听课都是在占便宜，我们以前学法的时候，有问题，老师才回答，哪像现在随便都可以听到。</p><p>刚才有人问到中脉的蓝色是甚么样的。其实，严格来说，应该说是青天色，不是蓝色。坐飞机在高空可以看见的那个天的颜色就是，比黑色明一点，不是亮一点，比蓝色灰一点的那种。或者，如果你到了太空，像那些载人火箭在太空看见的那个灰灰朦朦的那个颜色就是青色，那个颜色不是我们一般人看到太阳光的颜色。所以密宗里的画像都用青蓝色，尤其是药师佛。有人说，佛像应该很庄严，为甚么用像鬼一样的青蓝色？其实，青蓝色是本色，我们白天看到的亮光是太阳光通过云层，再反射到地球的，都不是真色，真色在中国字形容叫「杳杳冥冥」，像黑又不是黑，黑中还有亮光。</p><p>如果你打坐看见青光，假设没有喜乐的境界，就说明肝有问题。像上面讲的这个印度人，他观右脉，「嘭」一下，就是右边肝有问题，心脏有问题。因为脑子有些地方不通，细骨节有问题，所以脑子里有红光，头会晕。针灸对他应该有帮助。他的这些现象不能说是由于拙火发动、真气发动引起的，普通人打坐也会碰到这种境界。他身体内部有发炎，骨节也都有问题，整个五脏六腑都有问题。应该用药，或者针灸，或者推拿，没有甚么了不起的，不是甚么修道的境界。</p><p>像他这种情形，本身功德不够，智能不够，又没有明师指导，这样发展下去会有些特异功能出来的，但那是魔道。另外，他思想智慧也没有，书也读不进，智力会越来越差了。</p><p/><p>喜乐与轻安</p><p>怀师：刚才提到修禅定会得喜乐，这是密宗的讲法。修佛法还是要多注意显教，要根据佛的经典和菩萨的经论修持，密宗的讲法都有一点着相。在显教就不用喜乐这个词了，除了禅定方面叫喜乐，真正大乘佛法用的是「轻安」两个字。一般人读到轻安两个字就很轻易的过去了，其实那是真功夫，是很重要的。一个人身体真通了以后，没有痛苦，身体会变轻巧了，自己也感觉到没有障碍了，安详了，轻了。不像我们平常都觉得粗粗重重的。</p><p>喜乐也可以说是轻安的前奏，轻安也可以说是喜乐的前奏。真正的喜乐是绝对的轻安。像我们现在病痛难过起来，身体就粗重了，平常无病无痛的时候自己以为很轻安了，其实那并不轻安。你若仔细研究一下就知道，有个身体本身就是障碍，所以老子说：「吾所以有大患者，为吾有身。」最大的拖累就是这个身体。</p><p>元朝有一位大禅师高峰妙，徒弟向他问道，结果一进门就挨师父骂：「谁叫你拖这个死尸来的？」其实他不是骂徒弟，是叫他参究。我们的身体就是一个尸体，活着的时候会走路，会讲话，也会思想，会吵架，当然也会做事。但是，那个拖动这个身体的又是甚么东西呢？所以这里，他用禅宗法语：「谁叫你拖死尸来的？」因为，只要这个身体（尸体）在，都没有达到轻安。但是，并不是说没有身体就轻安了。不但要把身体转化成轻安，心理、心情都要轻安才行。你们看，有些人个性闷闷的，发不出来，情绪不安定。说得好听一点叫内向，其实，内向都是有问题的。</p><p>大家一想到「乐」，就想到身体快感，就想到男女交媾达到高潮最乐，其实那是很普通的。「喜」，大家以为哈哈大笑就是喜，那也是普通的喜。真的喜乐是大轻安！所以大乘经典上说，菩萨有内触妙乐，那个妙乐就不是普通快感的那个乐了。密宗很少提到这些，只是用喜乐来讲。</p><p>现在我问大家，你们想一想，你每天活着，觉得自己最粗重的是那一部分？（有人说脑，有人说肩膀）每个人都不一样。真正达到轻安喜乐，有功夫的境界，头脑永远是清醒的，像蓝天一样，万里青天无片雪。所以说，佛者觉也！这个觉性永远是清净圆满的。头顶怕冷怕热是外面触受的作用，真到了那个境界，即使是外面还怕冷怕熟，但头顶中心永远是清凉的，不是昏昏沉沉的。真得轻安的感觉是清凉的。</p><p>所以，从现代科学来讲，真正修道与脑的关系很大。需要弄清楚脑髓、间脑、皮质神经等。达到那个清净、舒服、自在的境界时，精神是昼夜常明的，不需要睡觉，永还是太阳那么光明，月亮那么清凉。这个光明并不是有相的光。像我们年轻的时候，有时盯着人家看，看人家的头，看到那些笨头笨脑的，我真想钻到他们的里面，看看怎么会有那么多垃圾。庄子有句话：「夫子犹有蓬之心也夫？」夫子是客气话，你老兄那里头是一堆烂草啊！</p><p>但要达到这些境界太难了。过去道书上讲，初步人仙、地仙的神仙境界，可以「身轻如叶」，身体轻得像一片树叶子在虚空里飘一样，是「昼夜常明」「夜睡无梦」，甚至说是「行疾奔马」，他轻轻走路可以像马跑那么快。</p><p>所以说，生命有无比的功能，无比的价值，普通人在那里轮回千生万劫，都是白活了，都没有把生命功能发起来。拙火不过是把生命功能初步发起而已。这些都还只是讲生理、物理的这一块，还没有讲心理的呢！</p><p>包卓立：非常感谢老师！</p><p/><p>一位日本禅师的故事</p><p>包卓立：下面给大家介绍一位日本医僧白隐禅师的经历。</p><p>翻译：修行三年以后，他觉得自己虽有所领悟但还无法解脱。于是他下决心全身心投入修持，强迫自己咬紧牙关睁开眼，以解脱饮食和睡眠。这样过了还不到一个月时间，他就觉得心头的火已经到了头上，肺部好像在炽热的燃烧，腿部则好像是放在冰雪里一样发冷，耳朵听到好像山谷里溪水流动的声音。他勇气消失了，时刻处于恐惧之中，腋下出汗，眼睛里充满了泪水，精神衰竭。他拜访了很多名医和名师，但都毫无益处。</p><p>包卓立：他太紧张，太努力太性急了。</p><p>翻译：后来，他找到一位长期住在山里的修道人，据说那位道人已经两百多岁了。道人的山洞很小，大概只有六平方英呎，里面甚么都没有，只有一个小矮桌，桌上放了三本书：《中庸》《老子》和《金刚经》！</p><p>找到一位明师实在是太难了，他诚心向道人请教，道人发现他真有求道之心，终于开口说话了。道人告诉他：「你太紧张太用力了，以至于失去了修持的节奏，你的这个禅病很难治疗，即使是最好的医生也无能为力。你现在要全身心投入内观才能治疗你的病，就像俗话说的，在哪里跌倒，就在哪里爬起来。」</p><p>接着，道人教了他一些道家关于气脉的道理，并告诉他问题在哪里。道人作了一个很有趣的比喻，他说：「维护身体就像治理一个国家，如果你总是往上看，不管下面，那么所有的官员都不会关心民间疾苦，国家就会衰落。修持的时候也一样，不要把一切都集中在脑子上。总的来讲，有一个准则，那就是你的头部应该感觉清凉，而你身体的下面应该感觉暖才对。」另外，道人还告诉他很多关于《孟子》、内丹等等方面的事情。</p><p>道人还告诉他：「你之所以有这些禅病是因为你心火上升引起的，如果你不把心火引导下去，甚么药都没有办法治你的病。我外表看起来似乎是属于道家的，你可能以为我教你的东西与佛家无关。其实，我教你的就是禅，等将来有一天，你见道的时候就会知道了。」</p><p>道人教他观的法门，他说：「正确的观是没有观，为而不为。观很多点是错误的，你就是因为观很多点而得了禅病，所以治疗你的病的办法就是‘无观’」。之后，道人给他讲述了很多佛家的教法。道人告诉他：「如果你把心火引到脚跟和脚底，你的胸部就会感到清凉，你就不会有算计妄想，不会受情爱的影响。这是真正的清净的观。你不要以为这样不是禅观，佛说过：‘把心放于脚底可治百病。’天台的止观经典很详细的介绍了各种病的现象和治疗办法，里面讲了十二种治病的呼吸法门。」</p><p>另外道人还叫他观想头顶有个鸭蛋大小的乳酪，乳酪慢慢融化，流到全身， 并观想身体是暖的，慢慢的，他的病就好了。</p><p>怀师：后面还有很多材料，我们没有时间讲，请大家回去自己看。</p><p>包卓立：我也曾经用过这个鸭蛋大小乳酪的方法，很有效。以后大家碰到有人有病，也可以介绍他们这种方法。</p><p>前面我们介绍了一些西方人修持的小案例以及大德们修行的经历，这一部分我们介绍了与修行有关的一些病症，我们可以介绍的就到这里了，我们有很多问题，希望得到老师的指导。</p><p/></div>"
},{
    "title": "第五章 唯识法相--密宗的基本理论",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>怀师：因为包卓立提出了佛法实际修证方面的问题，所以我们做了这次的讲课研究。到现在为止，我们已经介绍了现在西方人功夫境界的一些情形，也介绍了西藏修行大德们的修行经历，按说到这里可以作一个结论了。后来想到密宗修证最重要的基本学理之一是唯识法相学，因此抽出弥勒菩萨的修证法门系统，也</p><p>就是我们现在讲的法相唯识这一块，再为人家作一个补充。</p><p/><p>上座部</p><p>释迦牟尼佛快圆寂的时候，他的弟子们就分了好几派。这里所谓的派系并不是政治上的党派，而是由于个人修证的心得不同，那些彼此成就相同、比较谈得来的，就自然而然的形成了一个集团。政治的派系、党派是利益关系，宗教的派系最初并不是利害关系，可以说是道义上的关系。彼此成就相同，功夫也差不多的自然容易谈话，结合在一起，成为一个派系。</p><p>那么，释迦牟尼佛以后分了几个派系呢?第一是上座部，都是些修行有成就的大阿罗汉。上座在后来中国禅宗也叫首座，都是佛第一流的弟子，修持学理都有心得。比如迦叶尊者，就是禅宗的祖师，得佛的心法，自然是上座里的上座。</p><p/><p>阿难的故事</p><p>佛涅槃后，迦叶尊者马上召集大家，把佛平生所讲的佛法法要集中起来，这在佛学上叫结集，就是大家集中在一起，总结一下佛在哪月哪日，在什么地方讲了什么法。</p><p>第一次结集，他召集了有成就的大阿罗汉五百人。讲到这里，我们要介绍一个很重要的人，那就是佛的堂兄弟阿难。他的长处是记忆力特别好，就像现在的录音机一般，佛在哪一天讲了什么，他统统记得，我们现在看的佛经都是他讲出来的。</p><p>迦叶尊者第一次结集的时候，不许阿难来，因为阿难当时还没有悟道。这样做并不是故意为难他，大家也都知道非等阿难不可，其实这是大师兄迦叶的教育方法。结集时，五百罗汉都进了山涧，迦叶把门关了，不许阿难进来。阿难就讲：「你们对佛讲的话都有点记忆，可是没有我全啊，我大小乘都知道!请让我进来吧!」迦叶说：「可是你没有悟道没有资格进来啊！你理论都懂，但还没有证到。现在门已经关了，你要是有神通、有本事，你就自己进来啊，我们欢迎!」这一下阿难被逼急了，赶快去打坐，七天以后，他所有的都证到了，再来叫门，迦叶说：「你进来吧」，阿难就进来了，这是第一次结集的情形。后来迦叶是禅宗第一代祖师，阿难是第二代。</p><p/><p>一切有部</p><p>后来派系分得很多，好比说有一派叫「一切有部」，他们也是跟佛学的，了解到一切皆是有，不是空的。换句话说，空就是有。以后一切有部的发展，形成了弥勒菩萨这一派讲的法相唯识。其实一切有是讲毕竟空，真正的空。像般若讲空，其实是一切有，空也是有，所以很难讲佛法本体究竟是空还是有。讲到修持就是一切有，比如讲到五蕴解脱，色的边际是空，与空相对的边际就是色，是有。在空、有之间也是有，叫中有。究竟是空还是有?这是最高哲学的问题。「一切有部」发展到密宗，密宗的基本理论是法相唯识，讲一切有，那是法相之有，不是法性。法性是空的，起作用以后就一切都是有了。</p><p>因此，现在为大家介绍大乘法相宗，也就是密宗的根本修持原理《解深密经》里面的第六品，&lt;分别瑜伽品第六&gt;。这一章最重要的是讲到修奢摩他--修止和修定，以及修毗婆舍那--修观。所有佛法的宗派，不管是密宗还是显教，都是要修止观。止就包括得定，包括四禅八定，止是属于功夫方面、实证方面的。观是慧的方面，是般若。不管是显教密宗，大乘小乘，任何的修法归结起来就是两个字：止观。到后来的宗喀巴大师，他最著名的著作《菩提道次第论》，就是宏扬这一方面的佛法，讲渐修次第，一步一步的修持。</p><p>《菩提道次第论》是根据阿底峡尊者的《菩提道炬论》来的，菩提就是成佛之路的意思。阿底峡尊者是中国宋初一个很了不起，有成就的印度出家人。他的《菩提道炬论》应该是根据弥勒菩萨的《瑜伽师地论》来的，严格来讲，《瑜伽师地论》应该是根据佛说的《解深密经》来的。关于《解深密经》的第六品，这里只是给你们大概介绍一下，你们回去以后自己要仔细研究。八、九年前我刚来香港的时候，就讲过这部经，后来就没有兴趣讲下去了。这个东西和打牌、跳舞一样，要有好对象才好玩，否则很难继续下去。</p><p>弥勒菩萨的法相唯识这个系统，是根据《解深密经》《华严经》《胜鬘夫人经》这些来的，学的人要有很高的逻辑修养才行。我们中国人天性不大喜欢这种分析来分析去的东西，什么东西都喜欢大概，差不多就可以了。讲到这里，我想起一个笑话。满清灭亡后，那些王族还是喜欢摆摆架子，叫佣人去买酱油和醋，但是只给一块钱。佣人很为难：「老爷，一块钱能买什么啊?」，「想办法给我去买！」没有办法，佣人只好去店里，把那一块钱往柜台上一放：</p><p>「买醋了!」派头还是很大。虽然民国已经把清朝推翻了，老板还是给了一点面子，把一块收了，给他装一点醋。「哎，错了!我要的是酱油！」老板只好把醋倒出来，给他换成酱油，所以他一块钱酱油买了，醋也买了。中国人酱油、醋是不分的，反正酱油、醋差不多，都是黑黑的。中国人作学问也是这样，不喜欢分析来分析去的学问，所以学习唯识法相就很难了。</p><p/><p>《解深密经》说什么</p><p>《解深密经》分八品，所谓「品」就是「篇」的意思。第一篇是&lt;序言&gt;，解释佛为甚么讲解这本经，这部分很短。第二是&lt;胜义谛相品&gt; 。佛学有个名词叫「性宗」，讲般若的，性宗讲空，毕竟空，一空空到底，甚至最后成佛也是空，由空才能成佛。讲到一切有的话，就讲到了法相唯识，讲胜义有，一切皆是有，就连空也是有。这里为什么叫「胜义有」而不照普通那样就叫「有」呢?因为一讲有，人们就容易把它和现实世俗上的观念混淆了，以为我有钱，有太太，有儿子的有与那个有是一样的，那就错了。所谓胜义有是指最高最高那个本体的空。所谓空，是显教最高的理论，你的确可以证到空，可以成佛，的确有那么个东西你可以证到，那个空就是有，是「胜义」。胜义就是最高的道理，这个道理是有的，不是空的。般若讲空是破除世俗一切执着的那个有，所以是不得已才给他讲空。等你真正证到空性成佛了，是有个东西成佛，那个东西不是物质的，不像物质一样的有，没有办法用语言表达，所以叫胜义有。佛法的道理就是讲「毕竟空」「胜义有」。</p><p/><p>能即生成佛吗</p><p>自从佛涅槃后，毕竟空与胜义有的争论持续了两千多年，现在还在争。主张胜义有研究唯识法相的人，根本不相信即生可以成佛，他们认为要三大阿僧祗劫才能成佛。性宗的人讲理论，当然可以这一生就成佛，可以马上明心见性，立地成佛。</p><p>像我年轻的时候，听到要三大阿僧祗劫，要数不清那么多辈子才能成就，我就说这么没有希望，我不干了，不学了。后来学禅宗，属于性宗这一方面，讲直指人心，立地成佛，这可以干。有人问我：「依教理，不是要三大阿僧祗劫才行吗?怎么这一生就会成就?」我就说：「佛修了三大阿僧祗劫，最后那一天在菩提树下成佛，对不对?」</p><p>那人说：「是啊!那是佛最后生，三大阿僧祗劫修完了，到最后生。」我说：「那好，你怎么晓得我不是最后生呢?」他们只好说：「你这个人，真是没有办法!」</p><p>我告诉他们：「我看你们才是真没有办法!」这是讲到胜义有、毕竟空顺便讲到的。本经的第二篇就是讲胜义谛相（现象），讲胜义有、一切有，成佛也的确是有佛可成。这本经的第三品是&lt;心意识相品&gt;，介绍心意识起作用的现象，这篇最后有一个偈子很重要，我以前讲解过的：</p><p>阿陀那识甚深细，一切种子如瀑流，</p><p>我与凡愚不开演，恐彼分别执为我。</p><p>第四品是&lt;一切法相品&gt;，讲的是一切法界的现象是怎么生起的，大概介绍了唯识的三个要点：依他起，徧计所执，以及圆成实相。我们的心理状况，从前生到将来，包括入胎变胎儿等等一切都是依他起。我们的心是本来空的，现象都是外界所引起的。见到一个影象，我们的根根就栽进去了，等影像一起来，我们就会把它抓得牢牢的。如果能够对境心不起，不依他起，把自己的固执成见放掉，圆满清净的自性就会现前了。 </p><p>第五品是&lt;无自性相品&gt;，一切法无自性。比如说这个茶杯是一切法，佛说它无自性，我们听了会觉得莫名其妙，茶杯不是可以装水装酒，它不是有茶杯自己的性能吗?佛说茶杯以及一切东西都无自性，因为他们本来是没有的，只因为因缘凑合，人的力量或者其它的力量才造就成了这个东西，它不是永远固定不变的，所以没有自己独立、单独、自在的东西，所以叫做无自性。换句话说，一切法、一切相、一切作用都无自性，都可以破掉。只有最后那个东西，万有总体的那个东西，那个就叫做佛如来。所以诸法无自性，痛苦、快乐、功夫，一切无自性，没有一个单独存在、永恒不变的东西。</p><p/><p>佛法的重点</p><p>第六品是&lt;分别瑜伽品&gt;，我们稍微讲仔细一点，瑜伽的意思很难懂，大概就是相应的意思。用现代话说，就是一种交感、互相感应的作用。禅定、打坐、作功夫都属于瑜伽，这一品就是专门讲止与观。&lt;分别瑜伽品第六&gt;四十五页起：尔时慈氏菩萨摩诃萨白佛言：世尊!菩萨何依?何住?于大乘中修奢摩他、毗钵舍那？「摩诃萨」就是大菩萨，「慈氏」就是弥勒菩萨，又称慈氏菩萨。观世音是大悲菩萨，弥勒是大慈菩萨，也叫大慈氏。奢摩他是「修止」，毗钵舍那是「修观」。这位叫弥勒的菩萨向佛请问：佛啊!请问您，这些大菩萨们修大乘的法门，修止观，是依据什么?住在什么境界啊?弥勒菩萨首先问的这个问题，是修行成佛的中心问题。他用「何住」而不用「定」字，就是说，他想知道修行的立足点是哪个方法，应该从哪里开始。所有佛法修持归纳起来就是止观两个字，修止是修定，修观就是修慧。</p><p>佛告慈氏菩萨曰：善男子!当知菩萨法假安立，及不舍阿耨多罗三藐三菩提愿为依、为住，于大乘中修奢摩他、毗钵舍那。佛就告诉弥勒菩萨说：孩子啊，你应该知道，大乘菩萨一切法皆是方便假立的，包括念佛、准提法、参禅、密宗，等等，百千法门都是假设的。按现在话说，佛法都是假的。</p><p>为甚么说假安立呢?因为本体本来是空的，一切万有现象就像《金刚经》说的：「一切有为法，如梦幻泡影，如露亦如电，应作如是观。」你所有作为和修法都是梦幻泡影，是真空的，妙有也是假有，所以叫做假安立。</p><p>即然念佛、准提法、参禅、四禅八定、神通、成佛放光等等都是假安立，那么佛法的重点在那里呢?佛法的重点在于不舍离一个目标，那就是阿耨多罗三藐三菩提，大彻大悟，证得本体，明心见性。只有这个是最重要的，其他的方法都是假安立。所以佛告诉弥勒菩萨这个原则，要修一切法，但不要被一切法困住；也就是要法无我，要以三藐三菩提为依，要根据这个道理、这个原则修行，要在这个愿力上面安住，发起坚求无上正等正觉的愿心，才是大乘的止观定慧。</p><p/><p>四种所缘修法</p><p>慈氏菩萨复白佛言：如世尊说四种所缘境事：一者有分别影像所缘境事；二者无分别影像所缘境事；三者事边际所缘境事；四者所作成办所缘境事。于此四中：几是奢摩他所缘境事?几是毗钵舍那所缘境事?几是俱所缘境事?接着弥勒菩萨又问：我平常跟你那么久，听你说分析归纳起来有四种修行的方法。这时弥勒菩萨是直接向佛发问了。这里先解释一下「所缘境事」的意思。「境」就是境界。缘是心挂在那里，抓住一个东西的意思。好像我们一般人想要心定，我们一定要抓住一个东西才能定，这个抓的东西是假立的。下面我给大家解释一下四种修行的方法。</p><p>第一个方法是「有分别影像所缘境事」，意思是有分别心，有思想的，以这个分别思想为所缘来修行。比如说禅宗参话头，念佛的是谁?能讲话的是谁?身体是真的还是假的?这些都是从思想来的。再比如密宗讲的阎曼德迦，也就是文殊菩萨大威德金刚，有三个牛头、两个角、三十六只脚、十八只手，每只手部拿着东西，每只脚也都踩着东西，前面还挂了很多珍珠玛瑙宝石之类。这些都是有分别影像。再比如说修气脉，甚么打通任督二脉，打通中脉，这也都是有分别影像。有分别影像的修法有很多，这里是讲总的，没有详细分析。</p><p>第二种是「无分别影像所缘境事」，意思是甚么心都不用，都放下。有人还有感觉，哎呀，我腿痛，我这里气动了，我的手有感觉，这都是因为你念动了，都还是有分别影像。无分别影像是一切不起分别，但也不是无想定。</p><p>第三是「事边际所缘境事」。不一定打起坐来才算修道。你每天做人是追寻事，做布施、做好事、做福利事业都是追寻事，做功夫也是追寻事。一切事到最后都是空的，在事情上磨练自己，做事时心中随时都还在修行，这叫「事边际所缘境事」，是菩萨境界。菩萨大慈大悲是真慈悲，我们一般人的慈悲是假慈悲，事没有到边际。</p><p>第四是「所作成办所缘境事」，这就很高了，这时你的心念功夫到了，你念头想到甚么就成功甚么，是佛的境界，佛的所缘境界。</p><p>包卓立：事边际与所作成办的境界有甚么不同呢?</p><p>怀师：当然不同。像这种最后成果的境界，这本经后面都有讨论。像这种经典，我大概不会给你们讲下去，太辛苦了，这都是给菩萨境界讲的，我们大家都还没有到菩萨境界，很难听懂。</p><p>关于成果的境界其实我以前也讲过，你们可以参考一下《圆觉经略说》，这本书现在外面很流行，其中就有一部分是佛讲给菩萨们听的。这里为大家简单提一下，总结来讲，就是把禅那、修止、修观这三个原则转来转去，有二十五个法叫二十五轮。可以先修禅，后修止，再修观；也可以先修止，中修禅，后修观；也可以先修观，中修禅，后修止，等等。《圆觉经略说》上详细说明都解释了。</p><p>这二十五轮不是呆定的，是旋转的，等于这个圆桌一样，是圆的，从哪一面都可以到达。《圆觉经》的二十五轮与《楞严经》中讲的二十五位菩萨圆通不同，《楞.严经》中是一个菩萨讲一个法门，《圆觉经》是给大家讲三个大原则，应用如何要看个人的情况，所以很难懂，其实这都是密宗的方法。现在我们再回到原文。</p><p>弥勒菩萨的问题很厉害，他说：这四种修行方法中，哪几个是修止（奢摩他），属于止定的境界?哪几个是属于观的毗钵舍那的所缘境?又有哪几个是止观一起来的?</p><p>佛告慈氏菩萨曰：善男子!一是奢摩他所缘境事，谓无分别影 像；一是毗钵舍那所缘境事，谓有分别影像；二是俱所缘境事，谓事边际、所作成办。真要得止的时候，心中没有思想杂念，意识心不起分别作用。有分别影像则属于观，毗钵舍那有观察、省察、反省的意思。所以真得定的时候，必定是无分别意识，一念不生，清净圆明，但同时又都知道。</p><p>前面讲的四种方法中，一个是讲止，一个讲观，后面的事边际所缘境事和所作成办所缘境事，是俱所缘境事，有止也有观，止里头有观，观里头有止，止观同时具有。等于说我们在这个世界上要做事，有的同学要研究经济学，有的同学要做生意办公，这就要求你心很定，也就是说要有止。同时还要求你能运用智慧分析事情，要有观，所以修行与做事的原则很像。修止的时候就要万缘放下，修观的时候就要研究透彻。</p><p>再比如说修准提法，开始叫你修生起次第，先定下来，把地水火风观起来，观到菩萨境界，准提菩萨心月轮中，这是有分别影像。最后到圆满次第，随时无分别影像，无分别影像才是真正的止，才是定，有分别影像属于观。等你修成功了，身心都会起变化，是事边际所缘影事。最后你大彻大悟成佛是所作成办的所缘境事。</p><p>慈氏菩萨复白佛言：世尊!云何菩萨依是四种奢摩他、毗钵舍那所缘境事，能求奢摩他？能善毗钵舍那？佛告慈氏菩萨曰：善男子！如我为诸菩萨所说法假安立：所谓契经、应诵、记别、讽诵、自说、因缘、譬喻、本事、本生、方广、希法、论议。菩萨于此善听、善受，弥勒菩萨接着又问：怎么样能够得定得止呢？又怎么样才能善于观慧呢？</p><p>注意，这里讲得止的时候用的是「求奢摩他」，讲观的时候用的是「善毗钵舍那」，一个是求，一个是善，用的都很准确。</p><p>佛回答弥勒说，我带领众菩萨，讲了几十年的佛法，但所有的佛经都不是真正佛法，都是教育法而已。我对一年级讲的是这个，对二年级讲的是那个，对博士班讲的又是一个，你不要死死认为那就是佛法，三藏（经律论）十二部都是假安立，但也都是真的。一切大菩萨对这些所有经典的道理都「善听」，听懂了，就「善受」，接受了。不仅仅是听进去了，而是都接受了。</p><p>言善通利，意善寻思，见善通达。这三点很重要，学佛就是要「言善通利」，对每一句佛经文字都明白：另外还要「意善寻思」，要在思想里头研究了又研究。这还不够，还要在见地上能达到那个境界，要「见善通达」。即于如是善思惟法，独处空闲，作意思惟。复即于此能思惟心，内心相续，作意思惟。</p><p>这里讲到禅定了，禅定是从梵文翻过来的中文，它真正的意义就是善思惟。这里是说在没有外缘干扰的地方，自己内心相续作意思惟。如果被杂念或者感情、思想岔乱了，就不是内心相续了。如是正行多安住故，起身轻安，及心轻安，是名奢摩他。这个才是大乘的定，不是守住某一点小法，而是在道理上定。长久的安住在这个境界上，你慢慢就会有身轻安、心轻安的变化，这一点很重要。你们大家讲修气修脉，甚么任督脉通了，气可以转了，那我问你，你气脉转到甚么时候为止呢？你又何必在那里转气脉呢？去买张公园的票，坐穿山车就好了，那是佛法吗？修气修脉不是结果，修气修脉是因，轻安才是果。</p><p>这里说，你有了正思惟，得了定，身体就可以得轻安了，就无病无恼，健康长寿了。我们身体不舒服，那是身不轻啊！不仅如此，得定后心也可以轻安了,心中没有痛苦烦恼，没有悲伤，也没有甚么放不开的。这时，即便思想妄念来了，</p><p>那个妄念情绪黏不上你，都飘过去了，不是你去空它。这才叫奢摩他，叫得止得定。如果你还生气还难过，那是因为你被困住了，那不是轻安，是粗重。如是菩萨能求奢摩他。彼由获得身心轻安为所依故，得了轻安还不是究竟哦！得了身心轻安只是说明你学佛有了拐杖，有了倚杖，等于作生意有了本钱的意思。即于如所善思惟法内三摩地所行影像，观察胜解，舍离心相。即于如是三摩地影像所知义中，能正思择，最极思择，周徧寻思，周徧伺察，若忍、若乐、若慧、若见、若观，是名毗钵舍那。如是菩萨能善毗钵舍那。依据于正思惟和内心得定的三摩地的境界，观察自己，把心空掉、舍掉。</p><p>这时不能说没有思想，还有一个影像在哦。「善思惟法内三摩地」不是讲身体，而是讲你内心的那个境界。「观察胜解」，仔细的观察，更求进步。所谓胜解是不用心意识，不用思想，一切都是自然的，舍离心相，不用心了。到了这个空的境界还会有岔路有偏见哦！所以还要「正思择」，还要静静的思考、选择，「最极思择」就是到了极点的思择。还要「周徧寻思」，到处找啊，找清楚。还要「周徧伺察」。寻思与伺察的意思差不多，但是不同。寻思就好像拿着手电筒在黑暗里找东西，伺察就好像等在那里看住，像猫看住老鼠一样，老鼠连跑都不敢跑。这时，身上快感起来了，智慧也打开了，见地也懂了，也能观察得很清楚了，这才叫毗钵舍那修观。</p><p>慈氏菩萨复白佛言：世尊！若诸菩萨缘心为境，内思惟心，乃至未得身心轻安所有作意，当名何等？佛告慈氏菩萨曰：善男子！非奢摩他作意，是随顺奢摩他胜解相应作意。</p><p>弥勒菩萨接着问：那些初学菩萨们，在内心上用功夫，还是正思惟，可是他还没有在身体上求证到轻安。心也没有得到轻安，这又叫做甚么呢？佛回答说：这个还不算是定，但也不错了，算是往求定的路上走了。</p><p>世尊！若诸菩萨、乃至未得身心轻安，于如所思，所有诸法内三摩地所缘影像，作意思惟，如是作意，当名何等？善男子！非毗钵舍那作意，是随顺毗钵舍那胜解相应作意。</p><p>弥勒菩萨接着问：有些人身心未得轻安，可是他在用思想，在观察内在作功夫，这个叫甚么呢？佛说：这个不算是正修观，但算是向修观的这条路上走了。</p><p>这是玄奘法师翻译的，很仔细，很逻辑，但是有点罗嗦。如果是鸠摩罗什翻译，那就不同了。下面还有很多，你们自己回去研究。接着我们看本经的第五十五页，第二行起。</p><p/><p>七种真如</p><p>尽所有性者：谓诸杂染清净法中，所有一切品别边际，是名此中 尽所有性。如五数蕴、六数内处、六数外处，如是一切。如所有性者：谓即一切染净法中，所有真如，是名此中如所有性。</p><p>佛告诉弥勒菩萨，我们现在是「杂染清净法中」，我们凡夫的内心是杂的，污染的，不干净的。但是我们凡夫心中就没有干净的一面吗？其实也是有的，我们本来就是佛嘛！要「尽所有性」，就是要把道理都通透了，比如五蕴是甚么，六根六尘是甚么等等。要「如所有性」，就是要合于本体道理，所以唯识建立了真如，也就是本性的意思。阿赖耶识转成佛的境界叫真如，一共有七种真如。</p><p>真如是佛学的名称，就是佛，如来藏，在禅宗也叫明心见性的那个本性、本体。所以佛法是真正破除迷信的，没有佛也没有菩萨，那个东西叫真如，其实真如也是假立。真如这个词，佛学翻译的真是很高明，把真如反过来就是如真，好像有那么个真东西一样，其实并没有个东西，而是空的。「所有真如，是名此中如所有性」，一切万法都是真如起的作用，都是真如本体的功能。</p><p>此复七种：一者流转真如，谓一切行无先后性。二者相真如，谓一切法补特伽罗无我性，及法无我性。三者了别真如，谓一切行惟是识性。四者安立真如，谓我所说诸苦圣谛。五者邪行真如，谓我所说诸集圣谛。六者清净真如，谓我所说诸灭圣谛。七者正行真如，谓我所说诸道圣谛。</p><p>我现在把秘密都给你们讲开了。甚么叫「流转真如」呢？一切生命生了死，死了生，或者轮回六道，造了业下地狱，变畜牲，然后修行又跳出地狱畜牲道，重新变人，或者升天。这个过程就像这个转盘一样，一直在那里转动、流转，这就是流转真如。一切的行为没有先后，自性轮回就像这个圆盘一样，起点就是终点，终点就是起点，是圆满的。一切众生的生命就在流转之中，生了死，死了生，生生死死，死死生生，但那个能生死的是真如本性的功能，叫流转真如。</p><p>第二是「相真如」。一切佛法，一切现象始终无我，像我们这个人的肉体，你说是我吗？不是我，它会老会死，会变掉；脑筋是我吗？思想是我吗？都不是我。「补特伽罗无我性」，就是人无我。最后法也无我，也没有个佛可成，也没有个众生可度，一切法皆是空的，这是「相真如」，现象的真如。</p><p>第三是「了别真如」。本体是空的，但是它甚么都知道，甚么都能了别。之所以能够知道是心识起的作用。这三种真如最重要。</p><p>第四是「安立真如」。「谓我所说诸苦圣谛」，这里其实是讲教育方法了，等于叫你们出家、受戒、修四禅八定，证得阿罗汉果，叫菩萨修布施持戒等六度万行。</p><p>第五是「邪行真如」。好比说刚才有同学报告说，在西安有人念准提咒，说灵得很，多少年的病，一念咒子就没有了。那些人就抓住这个了，这就叫苦集灭道，集苦为乐。但是念咒有没有这个作用呢？有！但这是邪行真如，偏了、歪了。邪就是歪了，但还是在这盘子里头，不过摆歪了而已，还是真如，是邪门真如。</p><p>第六是「清净真如」。就是万缘放下，一念不生，是苦集灭道的灭谛。</p><p>第七是「正行真如」。就是证道。</p><p>当知此中：由流转真如、安立真如、邪行真如故，一切有情平等平等。</p><p>一切有情众生都在流转真如、安立真如、邪行真如当中，所以，上至天人、帝王，下至凡夫、地狱，没有一个人逃得过这个范围，所以一切众生平等。</p><p>由相真如、了别真如故，一切诸法平等平等。</p><p>相真如讲补特伽罗无我，法无我，直到自己晓得一切无我，一切都放下了，还有甚么呢？了别真如讲自己有个智慧，自然清楚的。一切诸法平等，你就晓得一切法皆是空。</p><p>由清净真如故，一切声闻菩提、独觉菩捉、阿耨多罗三藐三菩提，平等平等。</p><p>万缘放下，一念不生灭了，那么就得道成功了。一切小乘罗汉、独觉、大乘菩萨都要知道清净真如平等平等，最后都归于成佛成道。</p><p>由正行真如故，听闻正法，缘总境界、胜奢摩他、毗钵舍那所摄受慧，平等平等。</p><p>修正行真如，万缘放下，当下即是，不要想别的，就是正行真如。这一篇要好好研究，大乘佛法的定慧都在里面了。</p></div>"
},{
    "title": "附录",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>说明<p>讲课期间，根据平常的习惯，课余我们还经常就课堂上不清楚的问题继续请教怀师，有时包卓立同学甚至还用他半生不熟的中国话，直接与老师沟通，说出几个关键词，用身体做一个动作，然后问老师：「是不是这样？」「是不是这个意思？」有时候，我们旁边的人不是很明白他在说甚么，但老师会笑着告诉他对或者不对。那种情形也真是十分的有趣，当然，这种沟通方式也可能导致了一些理解上的偏差。</p><p>老师课余的开示只是点到为止，没有长篇系统的论述，而且也没有录音。我们根据这些课余开示，以及我们自己平时修持的心得，就上下册分别整理出两篇</p><p/><p>附录，希望对广大读者能有所裨益。文字内容多是拾老师牙慧，并非完全自己的发明。但如有不准确的地方，咎在我等，敬请各位先进不吝赐正为感。</p><p>包卓立</p><p>赵海英（佩瑜）</p><p>二00 三年九月四日晚于北京</p><p/><p/><p>普通人修持案例小结</p><p>首先需要给大家交代的是，一般人以为这些就是拙火发动的现象，其实，这些人都还没有达到真正修气的阶段，更枉谈修脉、修拙火。这些现象都不是真正的三摩地境界，大部分都是身心稍微宁静以后，风大在经脉中移动所自然产生的现象。真正气脉成就的人，身体的每一个细胞都会感到充实、温暖、祥和，远超过性交的快感。要想达到这种成就，你需要经常静坐，不放纵欲望，积累功德。</p><p>第二，如何看待这些身心转化的现象呢？我们特别向大家推荐怀师的《静坐修道与长生不老》，这本书是修行者必备的参考书，对静坐的原则有详细的说明，前面案例中讲的每一种情况，都能从中找到答案和解释。举例来说，案例二、三、四、六、七、九、十一、十二都提到，左脚拇指会有疼痛、肿胀或抽筋的感觉。我们生命的能量与腿脚密切相关。比如说，婴儿躺在襁褓里，他随时都在玩自己的双腿，慢慢长大了，开始到处爬，甚至到处跑，一刻也不愿意停，那是因为生命的能量和气机很充实，他们有使不完的劲。但年纪大了就不同了，人老首先就是从腿开始，腿没有力量了，走不动了。通过静坐，可以打通腿部气脉，让你更健康长寿。腿内侧一直到脚指头的气脉最难打通，一些重要的气脉末梢就在脚指头部位。仅仅是打通腿的气脉这一点，就需要整整一章，甚至整整一本书来说明。</p><p>《静坐修道与长生不老》指出：「人的根源在于头顶，头顶以上的虚空，就好比是植物的大地，而人的双腿双足，等于是植物枝叶的颠末。修习静坐作工夫，如果气机没有到达两腿双足而畅通四肢的神经末稍，等于一株枝叶枯落的枯木，虽然干身尚未腐朽，那也只是‘不亡以待尽’而已，毕竟未能恢复生机。」初学静坐者，很容易感觉气在脚拇指和大腿内侧间移动，「（这种现象，）实在是气机开始发生了反应的作用。因为气机在筋脉血管肌肉之间，不能畅通流行，所以有了胀痛麻木的反应感觉。换言之，这便证明了在生理上阴蹻、阳蹻的气脉上，已经有了后天的障碍。反过来讲，当腿麻到不能过份忍受时，只须轻松的放开两腿,慢慢地让它自然舒畅之后，便会感觉到由于经过这一段短暂时间的压迫，而换得新奇的舒服和快感。事实上，当静坐功夫到达某种适当的阶段时，无论盘腿或不盘腿，这种新奇而舒服的快感，是长期永恒地存在。此时，虽然长期盘腿而坐，不但没有妨碍，这种舒服和快感，反而愈来愈盛。」（《静坐修道与长生不老》，第八十六页）。</p><p>佛在几千年前就指出了脚对修行的重要性，譬如在不净观及白骨观中，都叫大家从左脚大拇指开始观起。长生不老的仙人修法也强调要做到气通足底，道家则说「至人之恩以踵」（《庄子》）。所以说脚、脚拇指很重要。因为脚拇指与脑有关, 左脚大拇指对应的是右脑。现在流行的足反射疗法，也间接证明了脚拇指与脑的关系，尤其是与脑下垂体和松果腺的联系。这些案例之所以常常提到左边身体的反应，是因为左边对应的是气，右边对应的是血，气比血更容易转化，静坐初期的反应多是从左边开始。前面案例中，很多人提到脚大拇指，印证了佛说的话。所以，修行是大科学，需要大智慧，绝对不是迷信。密宗认为身体有二十四个主脉，分为三组，每组八个。每个主脉又可以细分为三个小脉，全身一共七十二个小脉。每个小脉又可以细分为一千个微细脉，因此全身有七万二千个微细脉。印度教说有三十五万个微细脉，等等。这些数字没有关系，重点是说明，身体内有很多微细的能量通道，就像无数的遍布全身的神经网与微细血管一样。</p><p>第三，案例中经常提到刺麻、刺痛等触受感觉，其实，静坐的触受感觉很多，如酸、痛、胀、麻、痒、耳鸣、耳塞、冷、热、抽搐、痉挛等，这些都是身心初步宁静时身体四大自然的反应。静坐时的身心变化现象，还与一个人的身体状况、年龄、性情、职业等有关系，要想了解一个人静坐的现象及对治法门，需要像中医看病一样，全面了解一个人的生活。譬如，如果身体内湿气太重，则静坐时容易出汗、产生热感；如果身体太寒，静坐时会感觉有「冷气」往外冒。了解道家、佛家的气脉理论，及地水火风四大，可以帮助我们理解修行时的一些身心现象。</p><p>第四，一般来讲，长期静坐的人身体比较敏感，对外在环境如风、温度、湿度、气味、天气，以及疾病和旁边的人等，反应比较敏锐。所以，当他们身体有问题时，很快就会知道，可以及时治疗。一般人生病了自己都不知道，疾病得不到及时治疗，随着时间的推移，在身体内日积月累，甚至会变成严重的疾病，如风湿病、癌症等。所以当他们发现问题时，一般都已经太晚了，无法用改变生活方式或食物治疗等方法保养身体，需要药物或手术治疗。</p><p>千万应该注意的是，静坐时身体不适的感觉，都是因为早已有病根在内，静坐时气脉通不过，所以有堵塞、疼痛、麻胀等感受，因此静坐可以帮你及早发现身体的病症，而不是因为静坐而导致这些病症。如果坚持静坐，可以促使内在体能发生自我治疗的功效，如果持之以恒，再配合药物的治疗，必然可以使自己恢复绝对的健康。所以，自古修道者，都必须对医理有所了解。</p><p>案例中的这些人都有各种各样的病态，其实，世界上没有真正健康的人，只有佛才是真正健康的人，在道家也叫真人。通过静坐，你可以发现自己身上的毛病，而且是在发病以前，在病患潜伏期时就可以发现，比什么X 光啊、核磁共振啊还灵光。同时，静坐也可以帮助你身体自我治疗。在中国道家，我们平时吃的中药啊等等叫外丹，通过静坐而自己产生治疗效果，叫内丹，程度高的叫天丹。当然，很多情况下，修炼内丹也需要外丹的配合，需要用外丹调理身体。且不说修行，如果你每天都能花点时间，让自己静一静，把那些杂乱的念头空一空，身心真正休息，将对身体利益无穷，是最好的「补药」。以后的科学会证明这一点的。</p><p>气脉打通时，会有很痛的感觉。譬如说，心脉轮打开时，你甚至会有心脏病发作的感觉。禅宗二祖神光（慧可）气通头骨时，他以为自己要死了，因为头骨实在是痛得很厉害。这些大师生活在古代，吃的都是自然的食物，也没有化学、杀虫剂、食品添加剂的污染，但他们的身体仍然有很多的堵塞和毒素，需要精进修持才能排出去。现代人更是如此。很多「新时代人类」（NEW AGE ）用意识力量强行导引，这些方法都是错误的。真正的法门是空，把身体都空掉，自然身体的气脉会充满起来，力量会越来越大，直到打通气脉，将毒素排出体外。</p><p/><p>西藏密宗案例小结</p><p>第一，饮食与修行。以中国文化来讲，食物就是药，所以适当的饮食对修行非常重要。现代社会一般人都是营养过剩，因此妄念、欲念特别多，修行更加困难。寺院里要求出家人过午不食，就是为了减少性欲和过多的妄念。寺院里还要求大家清晨三点到五点就开始作早课，因为这段时间属阴，特别容易梦遗，这样做可以帮助出家人避免漏精。所以修行的很多做法和要求都是很科学的，不是随意制定出来的。</p><p>辟谷、断食是很重要的修行法门，但大家一定要明白其中的道理和方法，不能随便断食，不要因饥饿而伤害了身体。从前面的材料可以看出，移喜磋嘉几年时间没有吃食物，而是以草药矿物精华及服气为生，这就是道家讲的辟谷。密勒日巴也有类似的经历。他们之所以可以辟谷，以气为食，因为他们修气已经达到了相当高的境界，已经有了很高的三摩地境界。但即使如此，他们仍然经历了很多艰难困苦，因为身体四大还没有完全转化。</p><p>虽然断食是重要的修持法门，但必要的时候也需要有营养的食物。像释迦牟尼佛，只有在吃了牧羊女供养的乳酪，恢复了体力后才能悟道。密勒日巴也肯定需要有营养的食物，他遵照师父锦囊里的指示，吃了有营养的食物，身体恢复体力后，才有了那些神通和证悟。但他太久没有食物了，身体需要一段时间适应这种情况，因此刚开始的时候，密勒日巴吃了妹妹带来的食物，心中妄念增加、感到迷惑，这是因为食物使得气上升到大脑的缘故。仅仅是饮食一事，就有这么多的学问，所以修行要有智慧，要知时知量。</p><p>第二，苦行与魔障。前面介绍的三位西藏密宗祖师，都经历了很多的苦行与魔障的考验，有时甚至是死的考验。像移喜磋嘉，她修行的过程中有六七次要死的经历，但真正的修行人，为了求道，可以生死与之。所以修行需要大智大勇。就像禅宗讲的，若要人不死，先要死个人。</p><p>那么，大乘路线也会经历很多困苦吗？大乘的困苦更大，所谓难行能行，难忍能忍。大乘修行的魔障更大，不仅仅是身体的痛苦，开眼闭眼都有魔障。在家里有魔障，到了工作的地方也有魔障，那些让你烦恼的事情和人都是你的魔障。</p><p>真正修行，就会遇到各种各样的魔障，这些魔障都是来测验你的。你越是修持有进步的时候，越可能遇到各种魔障，譬如你静坐刚刚宁静一点，突然电话响了，或者身体病了，或者生意赔钱了，工作遇到困难了，性欲控制不了了等等。而这里介绍的移喜磋嘉、密勒日巴的苦行多是身体的痛苦，不过这也是很难的，现代人根本做不到。重点是大家不要被这些花花现象迷惑住了，要有般若智慧，要透过这些觉了本心，觉了那个「不生不灭，不垢不净，不增不减」的本心，真正解脱。</p><p>如何运用方便法门处理这些魔境，反映了一个人智慧的高低。根据圣经的记载，有个女人被指责犯了通奸罪，一群人把她带到耶稣面前，问该如何处置她，并说：「根据摩西约法，这个女人应该被石头砸死。」如果耶稣回答说「是」，这个女人会被杀死，人们也会指责耶稣博爱的教导很虚伪；相反，暴徒就会指责耶稣违背了摩西的约法。面对这个难题，耶稣在地上列出了人类的原罪，并说，「请那些没有这些罪业的人掷第一块石头。」没有人符合这个条件，于是人群就散去了。谁能说这不是智慧的方便法门呢？</p><p>第三，性与修行。这是一个很复杂的问题，我们自认没有资格讨论这个课题，只是想借此机会补充一点资料。</p><p>对修行人来说，守戒非常重要。佛在《楞严经》中告诉我们，不断淫欲而想得定，无异煮沙成饭，是绝不可能的。憨山大师没有动过欲念，所以他功夫进步很快。移喜磋嘉也没有动过欲念，她知道，如果漏失明点，就会成就杀不变光佛之业，而将投生至金刚地狱；她有不被色欲染污的喜乐，有脱去心意造作的三摩地；她没有昏沈，时刻融于觉性之流；所以她才有资格修持双修法门。性与健康也是一个很复杂的问题。在西方，很多运动员在大赛前，都会尽量避免多行欲事，但是一般科学家会嘲笑他们迷信。到目前为止，西方医学还无法证明，是否常常漏精的人更容易得病，甚至容易早亡。但根据中国传统医学道理，过份纵欲对身体是非常有害的。在这方面，西医与中国和印度医学分歧很大。</p><p>那么禁欲是否就健康呢？大家仔细观察一下那些年老的和尚、尼姑、修女，以及任何实行禁欲主义的宗教人士，他们很多人身心紧张僵硬，气色很难看，身体问题很多。他们只是守住了戒律的形式，但他们没有真正达到清净的定境。只有达到清净的定境，才是真正的守戒，才能炼精化气，软化自己的身体和性情。</p><p>所以，不管你是什么宗教，不管你走的是什么修行路线，练习清净的禅定都是很重要的，必不可少的。据记载，印度教大师拉摩克利斯那（RAMAKRISHNA ）有很多的三摩地境界，也很少漏精，但他很年轻的时候就死于喉癌。这说明他还没有打通任脉，任脉打通的人，喉咙不会出现这种问题。更正喉轮打通的人，就能够掌握生死了。从拉摩克利斯那的例子可以看出，简单的禁欲也可能对身体有害，硬性的忍精不放是不健康的，重点是你要能够炼精化气。前面怀师讲过，性欲发动的时候，其实就是拙火在动，道家讲的炼精化气就是通过拙火化的。修持拙火有一个难关，在拙火发动以前，修持会使身体变得更健康，精气神更充满，性欲会比平常人更强烈，如果不能炼精化气，在性交中把精气神都消耗掉了，就永远也无法达到拙火的境界。这个关口很难过，很多人到了这个关头是屡战屡败，浪费了前期功夫的积累。这时性欲的增强，说明生命力更强了，如果不配合性欲的观念，一念清净，空掉身体的感受，功夫就能更上一步。性欲发动，一方面是心理的原因，一方面也是身体生理的原因，说明身体有阻塞，不通畅。从生理的角度来讲，性欲强的人有两种情况，一种是精力旺盛、身体很好的人，一种是身体弱但阻塞严重的人。性欲这种不通畅的压力，要么通过性交泄掉，要么通过修持化掉，总之，它要找到一个出路。身体绝对健康的人，精气神真正充满了，身体通畅了，反而没有性欲的压迫了，正如道家讲的，「精满不思淫，气满不思食，神满不思睡」。就像前面提到的，其实这种境界的快感比男女交媾的快感要高多了。</p><p>第四，密宗与禅宗的流弊。印度与西藏特别注重转化色身的修法，比较容易着相。达摩祖师初来中士的时候，就知道中土有大乘气象，所以他介绍了禅宗。</p><p>当时，中国有道家、儒家、小乘佛法等等各宗各派，但禅宗从来就不强调身体触受、功夫等外在现象，以免大家太着相，而忘记了本心。正所谓心外求法即是外道。禅宗法门走的是般若智慧的路线，是直取无上菩提，根本不在这些路边小景上下工夫。但即心是佛也有其流弊，变成了口头禅。不是即心是佛不对，而是众生智慧不到，所以产生了流弊。</p><p>其实禅宗真正的中心，是达摩所提出来的行入，一般人都把那些应机教法如拈花微笑、棒喝饼茶当成了禅。其实即使是禅宗，开始修持也要从小乘修起，小乘都没有修成，还谈什么大乘呢？如鸠摩罗什大师，他修持所走的路线，还是小乘禅观的法门，也就是十念当中，念身的白骨观，或不净观这一类法门（《如何修证佛法》第一百七十页）。禅宗六祖慧能，闻《金刚经》悟道，但仍然要悟后起修，到现在他的肉身还完好无损。所以禅宗真正成就的，色身也会成就的。</p><p>禅宗天王道悟大师的故事最能说明禅宗与密宗的不同特点。据记载，这位禅宗祖师很有「架子」，他整天打坐，县老爷来访他也不理，县长被惹恼了，叫人把他扔到河里，结果河里浮出一座莲花，他就坐在莲花上面，因此感化了这位县长，成为他的皈依徒弟。后来，天王道悟生病躺在床上，疼的哎哟哎哟叫，旁边服侍的徒弟说，师父，您叫轻点好不好？您是悟了道的大和尚，议人听见，多丢脸啊！您当年的威风哪里去了？ </p><p>天王道悟一听不再叫了，说：「哦！不对呀？我痛得叫哎哟哎哟里，有个不痛的，你们知道吗？」徒弟都说不知道。你看，禅宗就是这样教育人的，叫你找到那个不痛的。但他也有功夫，能空能有，不是纸上谈兵。 历史上的西藏大德，也不全是偏重色身转化。下面我们再为大家介绍一位女成就者：玛吉瑙准，她就是走的般若智慧路线。她是西藏「断境施身（CHOD ）大手印」传承的创始人。</p><p/><p>玛吉瑙准的修持</p><p>玛吉瑙准、移喜磋嘉都是得道的大成就者，都对西藏文化产生了深远的影响。但与其它文化一样，西藏文化更重视男性成就者。佛性是无男女相的，但作为本体的化身，男女在身心结构与特性上确有不同，因此他们修持的方法也有微妙的区别。其实，不仅仅是男女有别，每个众生都是独特的、不同的，烦恼也是不一样的，所以佛说，众生有八万四千烦恼，佛有八万四千对治法门。因此，一切法门都是对应众生某种烦恼的方便法门。</p><p>比较而言，女性得定易，得慧难；男性得慧易，得定难。莲花生大士也曾教导移喜磋嘉说：「身体是修行的基础，男女并无重大区别，但如果已经有修行的愿心，则女性的身体更利于修行。」因此，相对而言，男性很难解脱生理烦恼的束缚，如性欲等，而女性则更难解脱心理烦恼的束缚，如情感等。女性起步易，身体容易有各种各样的气脉反应，但后期智慧开发较慢；男性起步难，但一旦能脱开身体的束缚，后面的智能开发就相对容易一些。以五蕴来划分，男性更难突破色阴的束缚，而女性更难突破受阴、想阴、行阴的束缚。成佛最终是智慧的成就，这也解释了为什么历史上有更多的男性成就者。</p><p>玛吉瑙准与移喜磋嘉的修持方法不一样，移喜磋嘉比较偏重身体的修持路线，而玛吉瑙准则比较接近于般若智慧的路线。密勒日巴与甘波巴走的是拙火路线，也比较偏重于身体的修持。因此，我们很幸运，能在藏传佛教中找到这么一个案例，而且还是一位女成就者。当然，移喜磋嘉、密勒日巴、甘波巴最后也都有智慧成就，玛吉瑙准也有色身转化的成就，我们这里只是强调一下，他们修持路线偏重之不同。</p><p>玛吉瑙准年轻时，就学习了所有的大乘般若经典，为她日后的修行打下了基础。但她的一位老师索南喇嘛（KYOTON SONAM DRAG -PA ）告诉她，修行不能仅仅停止在书本上，般若智慧的教法一定要与身心行为相联系。</p><p>「你似乎已经学习了所有的般若经典，但你真正明白经典的内涵吗？」索南上师问。</p><p>「我明白。」 玛吉瑙准回答。</p><p>「那么，请你给我解释一下。」</p><p>她仔细解释并评论了菩萨十地、五位修行次第，及最后证道成佛的教义。</p><p>「看来你确实了解了经典的教义，但你还没有把你心念的瀑流融于佛的教义。」</p><p>「怎么做到这点呢？」她问。</p><p>「你刚才讲的那些道理是你对教义的‘理解’，你说的都对，但现在你需要将这些知识与心念相融，合法而行，一旦做到这一点，原本被现象奴役的心灵就会进入全新的、对现象无有罣碍的境界。一旦解脱对现象的执着，你就会解脱主观与客观的观念，解脱一切‘能与所’的法尘境界。不二无对法门是智慧的火炬，能摧毁我见的黑暗。一切教法的中心，不外善知心念。你应依此而行。」</p><p>瑙准又开始念诵经典，并深深参究索南喇嘛的教导。阅读到魔障一章时，她忽然明白了老师的教导，一个前所未有的觉悟在心中生起，她解脱了所有观念的束缚，消除了我执、我见的魔障。无我的慧观，如阳光驱散了黑暗，永远灭除了我相的妄想……。</p><p>二十岁的时候，她是塔巴喇嘛的寺庙的供养僧，负责为他人朗诵佛经法本。有一次，她请求塔巴喇嘛为她灌顶，塔巴喇嘛告诉她： 「因为你和索南喇嘛前生的因缘，我无法给你灌顶，你应该请索南喇嘛为你灌顶。……」</p><p>于是她找到索南喇嘛，并说明了塔巴喇嘛的预言。索南喇嘛见她有成道的根基，答应了她的请求，为她灌顶。在艾冈瓦寺庙，索南喇嘛给瑙准和其它四位修行者作了三灌顶：意灌顶，通过深刻的三摩地了知四灌顶的深意；名叫「开启虚空大门」的祝福灌顶；及大幻网坛城的灌顶。</p><p>上述的最后一个灌顶过程中，当祈请智慧本尊，天空的星星开始清晰可见时，瑙准的身体跳起六尺高，示现了天人的二十四种舞蹈姿势，并用神的语言--梵文唱诵，声音有六十种功德之相；同时，她证得了金刚般的三摩地，完全进入了无量实相的境界。接着，庙宇的泥土墙不再是她的障碍，她腾空而去，在空中消失了。 她在一个叫色拉格之树的地方落下，树脚旁有一眼泉水，是忿怒月光龙王的住所。此地非常恐怖，甚至没有人敢正眼看它。她立即用自己的三摩地之力压倒了龙王，龙王召集附近的其它龙王，组成了巨大的队伍，显示一系列的恐怖神力。</p><p>瑙准立即将自己的身体变化成食物布施给这些魔鬼。魔鬼无法毁灭瑙准，不得不投降，并供养他们的生命精华，以便能够保存性命。最后，忿怒月光龙王及其它龙王都成了瑙准的护法，并发誓永不侵害众生。</p><p>最后，黎明时分，其它学生终于在色拉格树下找到了瑙准，他们一起回到索南喇嘛的庙宇。他们说，昨天，瑙准错过了灌顶的主要部分，但索南喇嘛立即打断他们：「你们得到的只是灌顶的形式而已，但瑙准得到的是证得实相之真正灌顶。」</p><p>玛吉瑙准的故事再次说明了，什么是真灌顶。现在有很多人像收集奖杯一样，到处收集灌顶，甚至把得到多少次灌顶当作是衡量修行成就的尺规，这些观念都是错误的。</p><p>另一点值得注意的是，瑙准处理魔境的方法与移喜磋嘉不同，瑙准没有与魔鬼进行任何超自然的「战斗」，而是将自己布施出去，同时她进入深深的三摩地境界，使得魔鬼无法伤害她，只好归顺于她。瑙准的这个布施教法非常有名，这个方法也是解脱五蕴的重要法门。瑙准开创了「施身断四魔」（断境施身法）的法门，也就是通过布施血肉来截断对五蕴的执着的法门。这个法门基于&lt;般若波罗蜜多心经&gt;，与白骨观法门类似，主要是通过观想将身体布施给其它众生，通过抛弃色法的方法转化色法。</p><p>其实，这种布施的法门不仅仅适用于色法。譬如说，如果你能放开对情感、感受的执着，你则能解脱受阴。这就是般若智慧的法门。因此，玛吉瑙准的修行法门比较类似禅宗，直接放下一切，到达本我，无须像道家或密宗那样一步一步的转化身心。</p><p>后来，她修行日趋深入，荼枳尼（天人）不断给她传递视觉影像和预言，告诉她应该与印度大师拓巴哈扎结合，修持双修的法门。之所以如此，是因为双修可以帮助瑙准更快的转化色身。这也是她的宿命因缘。</p><p>虽然双修是快速转化色身的有效法门，但一般人都不能使用这个法门，因为他们没有足够的般若智慧，没有稳定的三摩地基础。修习双修法之前，你至少需要熟练掌握白骨观及安般法门，并需要有足够的智慧和福德。</p><p>据记载，一位头戴骷髅冠和璎珞的深蓝荼枳尼（天人）告诉瑙准，「拓巴哈扎是骷髅杯佛化身，与他一起修持智慧、方便双运的秘密法门吧，如此，你的传承会增加，你的教法会得到广泛宏扬，你自己则会证得十地菩萨的果位。」玛吉</p><p>瑙准后来在女施主拉摩尊的房子碰到拓巴哈扎。</p><p>「……瑙准到达后的第十七天晚上，西藏阴历初八，哈扎和瑙准完成了智慧、方便双运的使命。这时，光明充满了整个房子，女施主拉摩尊以为是酥油灯不慎倾倒，使房子着火了，于是上楼看个究竟。但她只看见如彩虹一般的五色光明，充满整个屋子，在闪耀的光芒下，两个月亮结合在一起，一个是红色，一个是白色。除此之外，她没有看见任河人，她害怕的离开屋顶的佛堂，回到房间睡觉。」</p><p>玛吉瑙准走的是般若智慧的路线，但与密勒日巴、移喜磋嘉、甘波巴一样，她同时还是密宗在气脉、拙火、脉轮方面的持明者。但她没有像他们那样经历那么多的身体苦行。</p></p></div>"
},{
    "title": "第一章 大乘广五蕴论",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>由包卓立发起的这门课,到现在为止,也讲了一、二十天了。现在该做结论了。但要做结论，首先要了解五蕴的道理，因此抽出安慧菩萨的《大乘广五蕴论》来讨论。 佛学经典有“经”有“论”，“论”是菩萨们引申、演绎佛的教法所作的著作。最初，世亲菩萨提出《大乘五蕴论》，安慧菩萨将它扩充，写了《大乘广五蕴论》，把五蕴的道理作了仔细的分析。 修行以五蕴为基础 佛法最重要的就是五蕴论，我们修行学佛，以及任何佛法以外的旁门左道，乃至魔道，一切的修持都离不开五蕴。根据佛法的归纳，生命就是一个五蕴。不管你是修持大乘的六度：布施、持戒、忍辱、精进、禅定、般若，还是小乘的戒、定、慧、解脱、解脱知见，都是以五蕴为基础。在这里先为大家定义几个名词。五蕴就是五个范围：色蕴、受蕴、想蕴、行蕴、识蕴；六根是根据五蕴分析出来的，指的是眼根、耳根、鼻根、舌根、身根、意根；六识指的是眼识、耳识、鼻识、舌识、身识、和意识；与六根相对应的外在世界是六尘：色、声、香、味、触、法。六根对应六尘，中间靠六识起分别作用。六根、六尘、六识加起来一共十八，叫十八界。之所以叫“界”，是因为六根六识六尘各有它们自己的范围与界限。与眼相对的是色，与耳相对的是声，与鼻子相对的是香臭，与舌头相对的是味道，与身体相对应的是饱饥冷暖等，与识相对应的则是各种各样的思想情绪，它样各有各的界限。好比说，耳朵不能看色，鼻子不能听声。所以十八界也就是我们这个肉体生命与外在物质世界发生的作用。六根、六尘合在一起也叫十二根尘。 “蕴”是新译，梵名塞建陀，是积集的意思，有蕴藏、含藏在里面的意思。也有人翻译成五阴，是旧译，有盖住的意思。就好像说众生清净光明的佛性被盖住了，不是阳面，而是黑暗、无明这一面。两种翻译都对。浓缩归纳来讲，六根、六尘、六识，十八界的作用都属于五蕴的范围。《摩诃般若波罗蜜多心经》说：“观自在菩萨，行深般若波罗蜜多时，照见五蕴皆空。”谁都会念，谁都没有办法把五蕴空掉，所以说有般若极难。 我们现在研究这个做功夫的课题，会把许多秘密揭穿！因为我们不注重佛教的形式，好像随便就把秘密都跟你们讲了，你们不要因此而不晓得珍重啊！你们没有多大的因缘和福报听到佛法，现在听了，要晓得回报给世界，发心把中、英文都整理出来。不能整理出来，罪过无边啊！这里严重告诉你们，不要轻易听过去。 说色蕴 我们先介绍色蕴。用现代的话来解释，色蕴是物质的、物理的，包括地水火风“四大”。所谓四大也就是四种大类的意思，地是坚固性的，水是温性的，火是热能，风就是气，是动性。两千多年前，科学还不发达，佛就简单的把色蕴归纳为四大。严格来讲，还应该加一个空大，一共是五大，但一般只提四大。 整个五大是属于物的方面，四大是物质的，空大已经接近物理的了。注意，我们可以看见的天空的那个空是有相的空，属于色法（色蕴），不是般若的空。我们身体的气、脉、血、热能，乃至拙火，都属于色蕴的范围。 讲到这里，我要特别强调一点，一般人以为只有心是不生不灭的，其实物也是不生不灭的！心与物同等的功能！一般人把这一点都忽略了，或者根本就不清楚。诸佛菩萨也没有直接讲这一点，现在我直接明白的告诉你们，物的功能也非常伟大。虽然物的功能很伟大，对修行来讲，注重的还是唯心的一面。但是，这样讲并不是说心与物是对立的，心与物其实是同一个根根，是一体两面，用中国的哲学观念来讲，就是心物一元。但是，世界上的凡夫都困在物这一面，跳不出来，都被物所左右，被物转动了。正如《圆觉经》上说的，“一切众生妄认四大为自身相，妄认六尘缘影为自心相。”所以，不管是大乘佛法还是小乘佛法，第一步都是要解脱物理的困惑，进入心的那一面，然后再用心转物。 一般人修行打坐，不管是修持佛法，或者旁门左道，或者魔道，搞了半天，都是在那里玩弄色蕴的变化，没有什么了不起啊！连佛法的边都还没有摸到呢！比如你坐在那里盘腿打坐，不管你是修什么法门，是修显教还是密宗，乃至观想什么东西，反正你是四大这一堆东西堆在那里对不对？你说，我坐起来这里舒服那里舒服，今天有个好境界，很清净，明天境界不好，不清净，这都是在色蕴的范围。所有这些现象都只是说明色蕴在起变化，如果你认为这就是佛法，那是你自己认识不清，自己乱加注解，自我陶醉。 一切凡夫之所以不能解脱，首先就是因为被色蕴困在那里。不要说佛法，要跳出三界外，就连你自己身体色蕴的三界你都跳不出来。比如说男女性冲动的问题，就与色蕴有关。不是说性冲动完全就是色蕴的关系，而是说色蕴很厉害，引动你的心理起作用。拿我们身体来讲，从脚到横膈膜这一段属于欲界，男女性关系都是从这里引动的；从横膈膜到眼睛属于色界；从眼睛到虚空则是无色界。 </p><p>色身转化的修行次序 </p><p>如何转化色身呢？密宗告诉你先修气，再修脉，第三步修明点与拙火。我们前面研究了那么多报告，都是在这个范围里打转。包卓立找来的那些美国人的资料，更是连拙火的影子都没有，他们把那些修气修脉的色蕴里发生的感受，当作是拙火，那是完全错误的。 身体四大很难转变，地大的转化最难，所以首先要修风大（修气），修安那般那；风大转化了以后，再转化水大（修脉），脉包括血管、所有的微细神经，甚至细胞及遗传基因；等风大和水大都转化了，才能引发热能，才开始转化火大，修拙火；等这三样都转化了以后，才能转化地大。地大转化了，才能转化色蕴的空大。所以这种转变是有一定的次序的，而要达到这种转变，达到最后的成就，需要修持各种功德、智慧和加持。 这个修行次序，道家讲得很明白，一般人弄不清楚，只是在那里胡闹。道家《诸家气法•元气论》第五十六卷说： 一年易气，二年易血，三年易脉，四年易肉，五年易髓，六年易筋，七年易骨，八年易发，九年易形，从此延数万岁，名曰仙人。 第五十八卷说： 凡服气断谷者，一旬之时，精气弱微，顔色萎黄；二旬之时，动作瞑眩，肢节怅恨，大便苦难，小便赤黄，或时下痢，前刚后溏；三旬之时，身体消瘦，重难以行；（已前赢弱之候，是专气初胀所致，若以诸药，不至于此也）四旬之时，顔色渐悦，心独安康；五旬之时，五脏调和，精气内养；六旬之时，体复如故，机关调暢；七旬之时，心恶諠烦，志愿高翔；八旬之时，恬淡寂寞，信明术方；九旬之时，荣华润泽，声音洪彰；十旬之时，正气皆至，其效极昌，修之不止，年命延长。三年之后，瘢痕灭除，顔色有光。六年髓填，肠化为筋，预知存亡。经历九年，役使鬼神，玉女侍旁，脑实胁胼，不可复伤，号曰真人也。 一旬就是十天。修习服气断谷的人，开始很难，修习到一旬的时候，人的精气会变弱，面色萎黄。修习到二旬的时候，肢节都会难过，都会主硬；大便先是硬的，屙不出来，接著是稀稀水水的。到三旬的时候，身体会变瘦弱了，这是气开始变化所引起的。不要害怕，如果懂得用药物帮忙，就不至于这么严重了。到四旬的时候，面色慢慢好转，思想专一，心里头也没有什么杂念妄想了。如此继续修习， 到八旬的时候,智慧打开,喜欢寂静,即使在人世间很繁杂牡胤?也很清净了.到这个时候,各种方术都懂了,小神通也都有了,什么药治什么病也都知道了。到九旬，人就很漂亮了。等到十旬的时候，就能与宇宙之气相通、与天地正气合一了。 修到第六年的时候，气充满了，身体比婴儿还要婴儿；肠子里面很干净、变成筋了，不过肠子中间还有洞，还可以排泄。如果这时砍了他的头，流出来的不是血，而是白浆。到达这个程度，自己可以预知生死了，不过要想跳出生死，则还需要继续修行。 这样保持戒律清净，修到第九年的时候，鬼神听你指挥，天人伺候左右。如果是男的，女天人、空行女就来了，你就不用讨姨太太了（众笑）。如果是女的，就有男性的天人来伺候你了。这时，气完全充实，不像你们几位练武功的，两胁还软软的，一抓就完了。最后，修道成功，到达真人境界。 这个服气断谷的经验，都属于色蕴的范围，是真实不虚的，一般人只把他当成是道家的经验，就忽略不注意了。 修行断谷期间，有时会讨厌吃东西，不必担心，在这个过程中间，可以喝水，偶然也可以吃水果、或者一、二口东西，不过吃多了就会变成毒药、障碍修道了。 练气有时候会出汗、发痒、长疱、长脓，那是因为风碰到水，散开了，把身体里的湿气都逼了出来。用卦相来表示就是（风水）涣卦。反过来是（水风）井卦，表示身上水分太多了，气调不好，困在身体里面，会出毛病的。 修气的时候碰到火，就是（风火）家人卦，像包卓立最近鼻子红红的就是这种情况。反过来就是（火风）鼎卦，所以像丹田发热啊，都是很平常的事，没有什么了不起，那不是拙火。再好比说（风地）观卦，（地风）升卦，气由下面往上升，这只是从字面上简单解释一下，真讲起来内容很多。再比如（风山）渐卦，山就是背，这个卦相代表气在督脉慢慢上升，如果透不出去，说明背部有风，督脉有风赶不出去。反过来就是（山风）蠱卦生虫了，人会很不痛快，闷闷的。这是补充，现在还只是前奏，还没有讲到五蕴本身呢。 </p><p>佛说五蕴 </p><p>下面我们看《大乘广五蕴论》的第一段。 佛说五蕴。谓色蕴。受蕴。想蕴。行蕴。识蕴。云何色蕴。谓四大种及大种所造色。云何四大种。谓地界水界火界风界。此复云何。谓地坚性。水湿性。火煖性。风轻动性。界者。能持自性所造色故。 <p>“云何色蕴。谓四大种及大种所造色。”注意啊，梵文的语法与中文相反，与英文一样，都是倒装句。按中文的语法应该写成“色蕴云何”才对。色蕴是什么呢？色蕴就是四大种，以及通过质量互变，由四大种所变化、所构成的“色”——物质与能量。这个色后面还有解释。 “云何四大种。谓地界。水界。火界。风界。此复云何。谓地坚性。水湿性。火煖性。风轻动性。界者。能持自性所造色故。”四大种包括地界、水界、火界、风界。这里的“地界”，不是讲地方的界限，而是指“地大”的范围。“水界”是指液体的这个范围。“风界”是指风大的范围。地是属于固体的，具坚固性。水具有湿性，火具有煖性，风具有轻动性。四大各有其范围，各有各的特性和功能。 世界上所有的物质都含藏了地、水、火、风四大种性。比如这个录音机，是人造的化工产品，它有燃烧的功能，所以有火大的种性；温度高了，它可以变成软软的液体，所以它也有水大的种性。依次类推，它还有地大和风大的种性。即便是水果，像西瓜，也可以燃烧，也含有四大的种性。实际上，基因本身就具有地、水、火、风四大种性。 这个研究起来很细致很科学的，但科学最终一定要归纳到哲学的高度。所以当今世界的科学很需要与哲学再来一次会合，但现在还没有做到这一点。 《楞严经》所讲四大 关于四大，《楞严经》解释得最清楚了，以风为例，《楞严经》讲，“性风真空，性空真风，清净本然，同遍法界，随众生心，应所知量，宁有方所，循业发现。”也就是说，四大的本体、那个“性”本来就是空的，而只有真正空了，才能生出妙有，空与有是分不开的。四大本来清净、自然清净，它充满法界，无所不在，而你能了知的那个量，取决于你智慧的大小，依赖那股业的力量，它超越了时间和空间。所以物的功能很大，这是《楞严经》秘密的秘密，多少次讲《楞严经》我们都没有讲这些，因为一般人智慧不够，听不懂。他们研究《楞严经》，只注重七处征心，只知道在心性方面一功夫，弄不清楚物的这一面。 这里再补充说明一下。什么叫作“应所知量”呢？比方说，你功夫好，定力高，你的功能就强，所知量就大。再比如说，你在那里叫：“哎呀，我的身体好痛啊！”旁边人叫你忍一下，轻点叫，那个旁边的人不晓得你痛的程度，你的所知量知道你自己痛的程度，他的所知量不知道。再比如说，小乘罗汉修到最高成就，可以证到空，可以解脱了。他认为那就是究竟，这是他的所知量，他只到达这个程度。菩萨境界的所知量就不同了，就超过这个了。真正到了大彻大悟、成佛得阿耨多罗三藐三菩提时，就连“即空即有、非空非有”都是戏论了，那个所知量又不同了。像你们现在听课，听同一个理论，同一句话，每个人理解的深浅也都不同，也是“应所知量”的不同。“宁有方所”，意思是这并不是死板一定的。“循业发现”，各人的业力不同，智慧不同，理解的就不同。气派大的、智慧高的人了解得就多。四大所造色 ,云何四大所造色。谓眼根。耳根。鼻根。舌根。身根。色声香味及触一分。无表色等。造者。因义。根者。最胜自在义。主义。增上义。是为根义。所言主义。与谁为主。谓即眼根与眼识为主。生眼识故。如是乃至身根与身识为主。生身识故。 云何眼根。谓以色为境。净色为性。谓于眼中一分净色。如净醍醐。此性有故眼识得生。无即不生。 云何耳根。谓以声为境。净色为性。谓于耳中一分净色。此性有故耳识得生。无即不生。 云何鼻根。谓以香为境。净色为性。谓于鼻中一分净色。此性有故鼻识得生。无即不生。 云何舌根。谓以味为境。净色为性。谓于舌上周遍净色。有说此于舌上有少不遍。如一毛端。此性有故舌识得生。无即不生。 云何身根。谓以触为境。净色为性。谓于身中周遍净色。此性有故身识得生。无即不生。 四大所造出来的这个东西，在地球上来说，就是这个物质世界，在我们人来说，就是我们这个身体。我们每个人的业报不同，所以我们每个人的身体这个色也不同。 云何四大所造色。谓眼根。耳根。鼻根。舌根。身根。色声香味及触一分无表色等。”那么对于我们人来讲，四大所造色是什么呢？就是我们的眼睛（眼根）、耳朵（耳根）、鼻子（鼻根）、舌头（舌根）、和身体（身根），以及眼睛所看的色、耳朵所听的声、鼻子所闻的香臭味、舌头所尝的味道、以及身体的感触。注意哦，嘴巴属于身根，不是舌根。色声香味触是我们可以感觉、可以知道的，但是还有一个无法表达的那个作用，叫无表色，关于这一点，下面还会讨论到。 地、水、火、风四大各有其界限和功能。各自独立，水与火不相融，风跟地不相融，《圆觉经》上说“四大性离”，就是这个意思。但是四大又可以混合在一起，造出我们这个人的身体，造出宇宙间的万物。这初听起来很奇怪、很奇妙，所以叫做不可思议。这个的后面到底是什么在起作用呢？下面接著就解释了。 “造者。因义。根者。最胜自在义。主义。增上义。是为根义。”这里翻译的不是很高明，但是也已经很好了。他意思是说四大之所以能造出我们的眼、耳、鼻、舌、身五根，和色、声、香、味、及触一分无表色，是因为“最胜自在义、主义、增上义”三个因素。 所谓“最胜自在义”就是那个妙不可思议的、最高明的、最伟大的那个力量，是那个最初的第一因的功能。宗教家们无以名之，只好称这股力量为神、上帝、佛菩萨。对一般凡夫，也可以叫它“业力”。它可以自在的变化出所有的东西。 “所言主义。与谁为主。谓即眼根与眼识为主。生眼识故。如是乃至身根与身识为主。生身识故。”这个第一因的功能动了以后，还有一个作主的因素叫“主义”。比如一个刚死的人，虽然眼睛还没有冷却，因为眼睛（眼根）损坏，那个眼识也就起不了作用。我们活著的人眼睛能看，是因为眼根完好，眼识才有了别作用，所以说“眼根与眼识为主”。同样的道理，“身根与身识为主”，身体是由地水火风所组成的一团肉，人活著的时候，身识不起作用，身体就会有感觉，人死后，就失去触的感觉了。什么是身识呢？比如说，你睡著了，蚊子叮你，你“啪”一声把它打死了，这时，你的意识不知道，是身识在起作用。再好比说，你们现在听课，专心一致，意识完全集中在老师这里，但是身子还有感觉，这种感觉并没有通过第六意识，这是身识。打坐的时候，身识也会起作用，有人认识不清楚，以为它是魔障、或者菩萨加被、或者特异功能，那都是错误的。 “增上义”就是增上缘、助缘，有帮助、另加的意思。好比说，一个人的眼睛漂亮而不近视，就是增上缘好，遗传就属于增上缘的范围。总之，以眼睛为例，眼睛能分别众多形形色色的作用，是那个眼根“最胜自在义”。“主义”的功能，不近视、漂亮是“增上义”的功能。这三个“义”合拢起来“是为根义”，才“造”出眼根的功能。 眼耳鼻舌身 广义的心与物包括范围很广，五蕴论把这个范围缩小，主要讨论人的生理与心理的关系。为了便于大家理解，首先向大家介绍佛学唯识学的一个名词净色根。净，就是干净到极点的意思，净色根就是色法的那个根根。我们很难找到另一个辞汇来解释它的意思。当年翻译这些经典的时候，玄奘法师带领千余人，费了吃奶的力气才找到这个辞。现代科学进步了，我们把生命不断的细分，发现基因可以决定我们的遗传，是生命的根本。等到将来，科学进一步发展，人类还可以找出比基因更细的那个生命的根根。目前来讲，你们可以暂且把基因假认为净色根，这样比较容易理解。你们要注意，密宗里讲的红白菩提也还不是净色根。 “云何眼根。谓以色为境。净色为性。谓于眼中一分净色。如净醍醐。此性有故眼识得生。无即不生。云何耳根。谓以声为境。净色为性。谓于耳中一分净色。此性有故耳识得生。无即不生。云何鼻根。谓以香为境。净色为性。谓于鼻中一分净色。此性有故鼻识得生。无即不生。云何舌根。谓以味为境。净色为性。谓于舌上周遍净色。有说此于舌上有少不遍。如一毛端。此性有故舌识得生。无即不生。云何身根。谓以触为境。净色为性。谓于身中周遍净色。此性有故身识得生。无即不生。”我们的眼睛这个生理组织所对应的外在境界是色相，它的体性是“净色”。净色很难解释、很难形容，在古代，没有别的物质可以比喻，把它比喻为净醍醐，就好像把牛奶提炼所得到的那个牛奶精华一样。因为有净色这个体性、这个功能，所以眼睛可以配合眼识看东西。你们可以勉强把眼之净色理解为眼神经，如果眼神经、或者组成眼神经的那个细胞坏了，眼识就生不起作用了，眼睛就不能看东西了。所以说，“此性有故眼识得生，无即不生。”如果眼睛瞎了，眼根坏了，眼识还是存在的。这一点《楞严经》讲得很清楚，佛问阿难：眼睛瞎了的人能不能看见啊？阿难回答说：眼睛瞎了的人，眼是不会看的。佛回答说：你错了，瞎子也会看，只不过他看到的是黑洞洞的，那是眼识的作用，眼识还存在。依此类推，耳鼻舌身意也是一样的。好比说，有人得一种病，吃东西一点味道都没有，这就说明他舌头上的净色有问题了。再比如说，年龄大又有病的人，身体的一部分净色死掉了，身体感觉就不会那灵敏了。给你们讲这些，是因为这与你们打坐、做功夫很有关系，只有了解了这些，打坐中出现各种境界时，你才能晓得到底是那一部分出了毛病。很多人讲自己气脉动了，有这样那样的境界，其实那只是身识所起的作用，还不是真功夫、真般若。这里主要告诉你，做功夫时有些是生理、物理的变化，有些是心理变化。许多人打坐这些都不懂，都分不清楚，把假的当成真的，那就成了魔障、魔境界。《金刚经》说“凡所有相皆是虚妄”，也有这层意思，只是讲得比较简略而已。 色声香味触 云何色。谓眼之境。显色。形色。及表色等。显色有四种。谓青黄赤白。形色谓长短等。云何声。谓耳之境。执受大种因声。非执受大种因声。俱大种因声。诸心心法。是能执受。蠢动之类。是所执受。执受大种因声者。如手相击语言等声。非执受大种因声者。如风林驶水等声。俱大种因声者。如手击鼓等。云何香。谓鼻之境。好香。恶香。平等香。好香者。谓与鼻合时于蕴相续有所顺益。恶香者。谓与鼻合时于蕴相续有所违损。平等香者。谓与鼻合时无所损益。 云何味。谓舌之境。甘。醋。咸。辛。苦。淡等。云何触一分。谓身之境。除大种。谓滑性。涩性。重性。轻性。冷饥渴等。滑谓细软。涩谓粗强。重谓可称。轻谓反是。煖欲为冷。触是冷因。此即于因立其果称。如说诸佛出世乐。演说正法乐。众僧和合乐。同修精进乐。精进勤苦虽是乐因。即说为乐。此亦如是。欲食为饥。欲饮为渴。说亦如是。已说七种造触及前四大十一种等。 “云何色。谓眼之境。显色。形色。及表色等。显色有四种。谓青黄赤白。形色谓长短等。” 这里“云何色”的色，不是四大色法的色，是眼可见的境界，它指的是各种颜色（显色）、长短方圆（形色）和有色相可表的“表色”。唯识中还有一个叫“法处所摄色”，也就是意识里面所生的色。比如说，你打坐或做梦，自己意识深处呈现出五颜六色，其实外面并没有那些颜色。再比如说，你入定的时候，觉得自己没有动心，但可以看到山光水色与红花绿叶，那就是法处所摄色。人死后到中阴灵魂境界，那个意识也可以看到五颜六色，那也是法处所摄色，这是更深一层的道理。 <p>“云何声。谓耳之境。执受大种因声。非执受大种因声。俱大种因声。诸心心法。是能执受。蠢动之类。是所执受。执受大种因声者。如手相击语言等声。非执受大种因声者。如风林驶水等声。俱大种因声者。如手击鼓等。” 现在讲到声音了，什么是声呢？声是与耳根相对应的外境。这里要特别注意执受两个字，执受就是我们那个什么都抓住的习气。比如说，耳朵听到声音，意识马上就有分别了，马上就执著了，而且抓得很牢。年轻人谈恋爱，情人的一声哥哥啊（妹妹啊）能让你心波荡漾。再比如说，有的人对父母感情很好，自己已经是老头子了，有时候还是会想他*的那个声音，哎呀，我妈妈当时是这么吩咐我的。虽然声音是抓不住了，但是众生在意识上都很执著，这就叫做执受。 那么，那个能执受的是什么呢？“诸心心法，是能执受。”第一个心字，是意识的根根，第七识，心法是第六意识。这里是说，你的意识有执受的功能。那个所执受的又是什么呢？“蠢动之类，是所执受。”什么叫蠢动之类呢？就是那些含灵的、会动的，包括各种虫，包括我们人。有灵性、有生命的众生，听了声音意识就会抓住，是所执受。他这里讲得很仔细，把声分成三大类：执受大种因声，就是有执受功能的众生所发出的声音，好比说拍巴掌、语言之类；非执受大种因声，就是没有执受功能的物质所发出的声音，好比说风刮起来，树林的声音；俱大种因声，就是有执受功能的众生和没有执受功能的物质共同发出的声音，好比说手敲鼓的声音。 “云何香。谓鼻之境。好香。恶香。平等香。好香者。谓与鼻合时于蕴相续有所顺益。恶香者。谓与鼻合时于蕴相续有所违损。平等香者。谓与鼻合时无所损益。” 香（气味）是与鼻子相对应的境界，分为三类：闻起来感觉舒服的叫好香；闻起来生理和心理都感觉不舒服的叫坏香（恶香），好比说臭味；闻起来于五蕴相续既无损害又无利益的叫平等香。 “云何味。谓舌之境。甘。醋。咸。辛。苦。淡等。” 味道是与舌头相对应的境界，好比说甜酸苦辣等。 “云何触一分。谓身之境。除大种。谓滑性。涩性。重性。轻性。冷饥渴等。滑谓细软。涩谓粗强。重谓可称。轻谓反是。煖欲为冷。触是冷因。此即于因立其果称。如说诸佛出世乐。演说正法乐。众僧和合乐。同修精进乐。精进勤苦虽是乐因。即说为乐。此亦如是。欲食为饥。欲饮为渴。说亦如是。已说七种造触及前四大十一种等。” 触所包含的范围很广，这里排除四大，只讲触的一部分，叫触一分。除了四大以外，触还包括滑涩重轻冷渴等许多方面。当身体感觉很热的时候，我们就想要凉快点；感觉很饿的时候，我们就想吃饭；感觉渴的时候，我们就想要喝水。凉快了、吃饱了、喝过水了，人就快活舒服了。这是从因与果的角度讨论触这个概念。这样，我们一共讲了“触一分”的七种（滑涩重轻冷饥渴），再加上四大种，一共是十一种。再好比说，诸佛最喜欢做的事就是演说正法，最高兴的事情就是众僧道友们相处融洽，修法精进，这些是诸佛的乐因，诸佛以此境界为乐。 </p><p>什么是无表色 </p><p>云何无表色等。谓有表业。三摩地所生无见无对色等。有表业者。谓身语表。此通善不善无记性。所生色者。谓即从彼善不善表所生之色。此不可显示。故名无表。 三摩地所生色者。谓四静虑所生色等。 此无表色。是所造性。名善律仪不善律仪等。亦名业。亦名种子。如是诸色略为三种。一者可见有对。二者不可见有对。三者不可见无对。是中可见有对者。谓显色等。不可见有对者。谓眼根等。不可见无对者。谓无表色等。 前面讲过了表色，现在回过头来讲无表色。这里提醒大家注意，色法在佛经中有两个意思，一是色相，好比说男女爱漂亮，叫作好色，色相的色。色法的另一意思是物理的、物质的，在我们人来讲，我们这个四大（或者说五大）所构成的有形身体，就属于色法的范围。你们读佛学书碰到这两个字的时候，自己要注意分辨它的意思。“云何无表色等。谓有表业。三摩地所生无见无对色等。有表业者。谓身语表。此通善不善无记性。所生色者。谓即从彼善不善表所生之色。此不可显示。故名无表。”这里把无表色分为两类：有表业所生色、三摩地所生色。“有表业者，谓身语表”，所谓有表业，就是身体动作、语言可以表示出来的那个业，那种力量。它有善、不善、及中性三种。我们之所以有某种语言动作，都是有原因的，都与我们以前所造的业有关系，都受那个业的驱动。而我们的语言动作又会造出新的因、新的业，因因果果，永远不停。刚才我叫我们的翻译官说话慢一点，她笑笑说：这是我的业力。这句话没错，其实，我们一个人的寿命长短、健康与否等等，都是我们过去、现在所有业力的表达。这个有表业可以产生出无相可表的色，叫有表业所生无表色。注意！虽然我们的语言动作是由第六意识发动的，我们每时每刻都会有思想有脑海中飘过，但没有付诸行为的思想只属于意念的范围，不属于这个可表色的范围。 我们这里有的朋友喜欢看看相啊，算算命啊，其实命和相也都是可以改的，所以中国人看相有一个大原则：“有心无相，相逐心生；有相无心，相逐心灭。”比如说一个人相很好，碰到什么问题，忽然心中恨恨的，想要杀人，这时，他身上的细胞，他的脸相都会变了。再好比说，一个人生得一副大富大贵的相，但有相无心，道德行为很差，他的相也会慢慢随心而变的。这是从色、相、业力所引出来的一段话。 “三摩地所生色者。谓四静虑所生色等。” 这里所谓三摩地所生色，是指得定以后，在定的境界里所生出来的色相。修道学佛打坐练气功，常常会有些奇妙的境界，一般人不懂教理，认为很神奇，其实这些境界都是生命本来就有的，生命、宇宙本来就是这样的玄妙。 <p>一般人打坐，都在那里“坐驰”，脑子里思想不停，那是胡思乱想三摩地。有人坐起来，男孩子想女孩子，女孩子想男孩子，那是相思三摩地。这里讲的三摩地是正修行，是四禅八定的三摩地。当时的翻译，不用四禅定，而是用四静虑，这是唐代玄奘法师根据儒家《大学》的话：“知止而后有定，定而后能静，静而后能安，安而后能虑”浓缩而来的。 “此无表色。是所造性。名善律仪不善律仪等。亦名业。亦名种子。” 为什么进入三摩地的定境会生出这些色呢？这都是我们多生累世善于守戒，或不善于守戒所积累的功德和不道德的业力造出来的。这个业也叫种子，所以我叫大家专心念咒念佛，这个善的意念就会变成将来的种子。就像唯识学讲的，我们现在这一生作人做事的遭遇，是前生的种子在这一生的现行，而我们这一生的作人好坏，又会变成未来的种子。 我们定中所生的色，是无表色，只有自己定境里知道，它是我们过去、现在那个业力种子的发现。无表色不是科学仪器可以测验到的。有一次，我的老师袁先生闭关打坐，看见有蟒蛇从座下钻出，他难过得都要掉眼泪了，因为那说明他的那个瞋心的根根还没断掉。“如是诸色略为三种。一者可见有对。二者不可见有对。三者不可见无对。是中可见有对者。谓显色等。不可见有对者。谓眼根等。不可见无对者。谓无表色等。” “不可见无对色”是指不是眼睛看得见的，与眼不相对的那个色。比如说，我们眼睛可以看见红色、蓝色，知道这是葡萄，那是苹果，这是看得见的，有对的，相对的。物质世界是有见、有对的，物理世界是不可见无对的。我们借助仪器可以看见的东西，像细胞也都还属于肉眼可见的范围，还是可见的、有对的，而那个能量的东西是不可见的、无对的。 讲到这里，给大家作个总结。色分三种，一种是“可见有对”，好比说颜色、长短等；一种是“不可见有对”的，好比说我们的眼根，自己无法看见；还有一种是“不可见无对”的，无表色属于这个范围。 </p><p>受蕴和想蕴 </p><p>云何受蕴。受有三种。谓乐受。苦受。不苦不乐受。乐受者。谓此灭时有和合欲。苦受者。谓此生时有乖离欲。不苦不乐受者。谓无二欲。无二欲者。谓无和合及乖离欲。受。谓识之领纳。 云何想蕴。谓能增胜取诸境相。增胜取者。谓胜力能取。如大力者说名胜力。 “云何受蕴。受有三种。谓乐受。苦受。不苦不乐受。乐受者。谓此灭时有和合欲。苦受者。谓此生时有乖离欲。不苦不乐受者。谓无二欲。无二欲者。谓无和合及乖离欲。受。谓识之领纳。” 首先为大家解释一下受这个字，用现在的话来讲，勉强可以叫它感觉。为什么说勉强呢？因为感觉是我们四大生理的反应，是机械性的。但这个生理的反应会影响我们的心理，会带给我们痛苦与快乐，所以“受”不仅仅是感觉，它还包括了心理的反应。这里他说，受就是识之领纳，领就是感觉的意思，纳就是归纳、吸收，领纳在心，就是放在心上了。比如说，你年轻的时候受过很多苦，现在想起来都还会难过，其实那个苦早就像梦一样过去了，但你把它领纳在你的心里了，这就是受的道理。 我们现在活在这个世界，是受报应来的，有的人报应好，一辈子无病无痛，一辈子不知道伤风感冒是什么。相反的，有人则是一天到晚生病。像我们吃完饭，坐在这里研究佛学，觉得蛮有福报的，不像其他人，跑到什么大富豪啊，迪斯科啊，在幽暗的灯光下跳来跳去，皮鞋踩来踩去。虽然我们觉得那样很痛苦，但他们觉得那样也很享受啊，这就是各人的受、报不同。你打起坐来，气脉通了，身体舒服，那个三摩地的境界就是受，是你的善报，是你修善业才能达到的。 受有三种，一是乐受，就是说，一件事，一句话过去后，自己很舒服很高兴，还希望下一次再碰到。一种是苦受，就是说，一件事情过去后，自己希望能逃避开，以后再也不要碰到那样的事。最后是不苦不乐受，既不近切希望它再来，也不逃避，无所谓。《心经》中说：“无色无受想行识”，可是一般人做功夫都还在色蕴受蕴的范围。我们前面讨论的那些修苦行的人，甚至那些放光动地的境界，也都还在色蕴受蕴之中。他们的那些境界是用功的很好表现，但还不是佛法，不是阿耨多罗三藐三菩提，不是明心见性。 <p>受与思想有什么不同呢？严格分析起来，受是领纳进来，不是思想，是“念”。所谓“念”，就是习惯性的会放在心上，是一种习惯性的力量。好比说，你特别喜欢某种东西，或者你想念你的情人，你会念念不忘，就是这个道理。 “云何想蕴。谓能增胜取诸境相。增胜取者。谓胜力能取。如大力者说名胜力。” 中国字很奇妙，思、想、念三个心理境界各有其范围。“思”是比较细致的，“想”我们马上就会讲到，而“念”则属于后面要讲的行蕴了。这里说，“想”具有很大的力量，能够抓住东西或境界。所以说，信宗教的人，诚心祈祷，往往会有好的结果，那是因为想的增胜力、加强力的作用。再好比说，修密宗的人都要观想，就是利用想的力量，如果在讲话做事时，你也能清晰的观想到观音、文殊菩萨像的话，在密宗中就叫观想成就了，那已经很难了，已经是相当高的功夫了。 </p><p>关于行蕴 </p><p>云何行蕴。谓除受想。诸余心法及心不相应行。云何余心法。谓与心相应诸行。触。作意。思。欲。胜解。念。三摩地。慧。信。惭。愧……是诸心法。五是遍行。此遍一切善不善无记心。故名遍行。…… <p>云何触。谓三和合分别为性。三和。谓眼色识。如是等。此诸和合心心法生。故名为触。与受所依为业。 云何作意。谓令心发悟为性。令心心法现前警动。是忆念义。任持攀缘心为业。 <p>云何思。谓于功德过失及以俱非。令心造作意业为性。此性若有。识攀缘用即现在前。犹如磁石引铁令动。能推善不善无记心为业。 云何念。谓于惯习事心不忘失。明记为性。惯习事者。谓曾所习行。与不散乱所依为业。 云何三摩地。谓于所观事心一境性。所观事者。谓五蕴等及无常苦空无我等。心一境者。是专注义。与智所依为来。因心定故知实了知。 云何睡眠。谓不自在转。昧略为性。不自在者。谓令心等不自在转。是癡之分。又此自性不自在故。令心心法极成昧略。此善不善及无记性。能与过失所依为业。云何寻。谓思慧差别。意言寻求。令心粗相分别为性。意言者。谓是意识。是中或依思。或依慧而起。分别粗相者。谓寻求瓶衣车乘等之粗相。乐触苦触等所依为业。 云何伺。谓思慧差别。意言伺察。令心细相分别为性。细相者。谓于瓶衣等分别细相成不成等差别之义。云何心不相应行。谓依色心等分位假立。谓此与彼不可施设异不异性。此复云何。谓得。无想定。灭尽定。无想天。命根。众同分。生。老。住。无常。名身。句身。文身。异生性。如是等。 “行”这个字很难解释。首先，行是心的状态，所以修行也叫修心。也就是说。修行要从自己的心理状态修起，要改正自己的思想，要随时注意修正自己的起心动念。打坐只不过是修行的一种，只是帮助你养成一种习惯而已。如果自己的行为不改，那种修行是没有用的。注意，思想是没有表达出来的行为，是未表的色，行为是已经表达出来的思想。所以，我常常叫人家学佛要先读《普贤行愿品》，先要发大愿，而且不光是思想发大愿，还要贯彻于行动。 “行”还有动力的意思，比如说太阳、月亮时时刻刻都在转动，那就叫行。有人说，胡适之提出，中国文化是静态的，那种说法并不正确。中国佛道儒从来没有讲静态，因为静态不过是动态里的一个现象，是一种缓慢的动。易经乾卦的第一句话就是“天行健”，天就是宇宙，意思是说宇宙永远都在动。如果天不动的话，宇宙生命就会毀灭了。其实死亡也是一个动态，所以宇宙生命本来是活动的。生死轮迴是动的，不生死轮迴也是动的。佛入涅槃也不是死亡，而是证得生命最初的那个活动的能力。其实没有一个真正的静态。宇宙就像圆桌、圆球一样，是圆的，永远在动。我们把圆的看成是直线，那是因为我们人为的把它切了。在小范围内，圆与直线很相似，所以没有真正的静态。其实，动就是静，静就是动，没有静也没有动，没有阴也没有阳，这是形而上的法则，很高很妙的。佛法真正到了最高境界是不动也不静，即动即静的。比如说阿罗汉入定，自己以为不动了，其实还在动。大菩萨、佛境界也一样的，不是不动，是慢动。“云何行蕴。谓除受想。诸余心法及心不相应行。云何余心法。谓与心相应诸行。触。作意。思。欲。胜解。念。三摩地。慧。信。惭。愧……是诸心法。五是遍行。此遍一切善不善无记心。故名遍行。” 这里说，行蕴包括了受、想两蕴以外的所有与心相应和不相应的状态。所谓与心不相应的，是说我们心理无法配合、无法转变的东西，一共有二十四种，比如佛法的规律、时间、空间等。举例来说，你打坐入定七天，你觉得很快，好像只有半个钟头，但是宇宙运行的时间还是七天，一点都没法改变。与心相应的状态就很多了，我们所有的意识心理状态都属于行蕴的范围。行蕴不是你“想”出来的，好比说，我们很多思想是自己冒出来的，我们并没有去著意想它，那就是行蕴。行蕴包括很多，我们只挑出下面几个重要的来讨论。 “云何触。谓三和合分别为性。三和。谓眼色识。如是等。此诸和合心心法生。故名为触。与受所依为业。” 广义来讲，行蕴里的“触”这一部分，包括很多，像我们的身体就充满了触的作用，冷暖滑涩都是我们触的感受。其实，我们的眼睛看见东西，耳朵听到声音，这里面都有触的作用。严格来讲，我们的生命时时刻刻都与外面的物质与物理世界进行交感和交流，通过意识的作用产生痛苦和快乐。我们的生命，外在物质和物理世界，以及意识合在一起叫三和合。以眼为例，眼睛看外面物质世界的色相，就像照相一样没有分别，但与意识配合后，就会知道这是红的，那是蓝的，这个好看，那个不好看。所以，眼睛、外在的色、意识这三缘和合起来后，就有了分别作用。这样，三缘和合后，心会发生各种苦、乐、喜、怒等形态，我们将这些心理、生理状态领受吸纳进来，就会产生一种力量和业力，这叫作触。“云何作意。谓令心发悟为性。令心心法现前警动。是忆念义。任持攀缘心为业。” 什么是作意呢？作意直翻就是“作成意识”的意思，“谓令心发悟为性”，就是说作意是一个使我们内心开悟，“喔，懂了！”这么一个作用。另外，作意能“令心心法现前警动”，能令我们心中起警动的作用。好比说，别人很客气，倒一杯茶给我们，我们马上说“哎哟，不敢当！”这就是警动。作意还有第三层意思，“是忆念义，任持攀缘心为来”。比如说，我们到一个地方，一个我们很尊敬或者不认识的人，突然很客气，为我们倒茶，我们马上说“啊呀，不敢当！”我们心中对这个印象深刻，记在心里了，这叫“忆念义”。同时，我们心还会攀缘，“哎呀，某人倒茶给我，真不好意思，下次有机会，我要请他喝茶！”这个攀缘心会造成一个业力，这就是作意的第三层意思。 “云何思。谓于功德过失及以俱非。令心造作意业为性。此性若有识。攀缘用即现在前。犹如磁石引铁令动。能推善不善无记心为业。”注意，思与想不同，思属于行蕴，想属于想蕴。关于想，我们前面已经讲过了，很重要，在五蕴中独占一蕴，而且想蕴是五蕴的重镇。中文里，经常把思与想连起来用，叫思想。比如说国民党、****都经常说：“某人思想有问题，应该抓起来！”我一直反对这样做，我说，你们要搞清楚，世界上每个人都有思想，思想一定有问题，有问题才会有思想，你难道要把天下人都抓了吗？所以说，说别人思想有问题要讲清楚，是男女思想有问题，还是政治思想有问题，还是经济思想有问题，不能扣大帽子。这是讲到“思”，顺便提到的。这里的“思”，是指对于自己所做的好事、坏事、不好不坏的事，很自然的有一种反省的力量，根据西方心理学的分类，这叫监察意识。就是说，我们心中有某一个思想时，旁边还会有一个东西在监察这个思想。比如我们想吃某个东西，马上又想到，哎呀，我不能吃，吃了恐怕会肚子痛，这就是监察意的作用，思的作用。这里说，那个反思的作用构成了一种力量,意识的业力,再加上我们心意识的攀缘作用,我们的反思与反省就会随时呈现于心中。好比说你做一件不好的事，或者你想追求某个女孩子，“剪不断，理不乱”，你随时都会想到她，她随时都在你心中，就像磁石随时能吸铁一样。这个思的力量很大，能导致我们善的行为、恶的行为、和不善不恶的行为。注意，想是比较粗的，我们平常都在妄想之中，思则是比较细的，会在“想”的后面自动起作用。有一点要特别注意，我们讲的这些心理状态都属于行蕴的范围。说到行蕴，你们要了解佛在《解深密经》讲的一个偈子， <p>阿陀那识甚深细，一切种子如瀑流， <p>我于凡愚不开演，恐彼分别执为我。 <p>阿陀那识就是我们的心理思想作用。佛在这里打了一个比方，我们这个生命一生下来，那个心意识作用就像长江、黄河的流水一样，千秋万代永远在流。表面上看起来，只是一股水在流动，其实仔细分析起来，每个水分子都各有自己的作用与性能，非常复杂，非常细密。所以佛说，我对于没有智慧、愚笨的人，不愿意讲这个道理，因为怕他们听了以后，误以为生命功能有一个究竟我的作用。其实，根本就没有一个我，根本无我。你真懂了这个道理，你就懂了行蕴。 修行就是转动切断这个种子的瀑流，如果你仅仅是念念佛，打打坐，祷告祷告，而你的思想瀑流从来没有清净过，那不算修行。当然，打坐、念佛、祷告也有用，帮你练习练习。 “云何念。谓于惯习事心不忘失。明记为性。惯习事者。谓曾所习行。与不散乱所依为业。” 前面讲到“想蕴”，讲到“思”，现在讲“念”。一般情况下，思、念、想的意思差不多，尤其中国文化比较文学化，有时甚至会将两个字连起来用，像想念、思念，用的真是很美。古人作诗、作对，怕重复用字，更是把这三个字换著用。这是中国人的习惯，不喜欢太逻辑。但是在佛学中，这三个字代表的意思很不同。什么是念呢？我们前面讲过想、触、思，因为想，或者思，或者触等等，在你心中引起一个影像，你永远丢不开，永远不能忘记，“心不忘失，明记为性”，这就是念。相思病就是一个例子。再好比说，你从小受的教育，别人的虐待，或者别人的爱，虽然已经过去许多年了，但是你仍记在心中，不能忘怀，这也是念。 一般人念佛“南无阿弥陀佛”，或者祷告“阿门”，只是嘴里念念而已，根本就没到心里去。我就笑他们，这样念，你什么门都不会有！念，就须要随时放于心中，随时记得，那才是真正的念。好比说，我们这位律师朋友明天要出庭打官司，如果今天有人请他跳舞吃饭，不管他今天晚上多么开心，他还是丢不开明天要出庭这个念头，这才是念。 修行的重点在念，要把修行变成一个习惯，不能涣散、散乱，要念念清净。大家学打坐修禅，定要明白一个道理，打坐是很普通的事，那只是让你的身体休息一下而已，禅定的境界才是心念的功夫。至于说气动啊，脉动啊，特异功能啊，都不算什么。就好像你点蜡烛，旁边一定会有黑烟，大家如果把黑烟当成了光，那就大错特错了。 “云何三摩地。谓于所观事心一境性。所观事者。谓五蕴等及无常苦空无我等。心一境者。是专注义。与智所依为业。因心定故如实了知。” 这里是讲三摩地的总原则。三摩地是定的境界，“于所观事”，对于心里想要明白了解的事（注意！观不是用眼下看），能“心一境性”就是三摩地的境界。什么是心一境性呢，就是一心不乱，专心一致的意思，就好像打靶时，子弹要打在靶子的中心。注意，定是与智慧配合的，有了定才能发出真正的智慧，而且，只有心定了，你才可以随时了知，你所了知的也才会究竟、彻底、真实。那么，修行所观的是什么呢？“所观事者，谓五蕴等。及无常、苦、空、无我等。”修行人要心一境性的内观自己的色受想行识五蕴的变化。气脉的变化，属于四大的范围，你要观察得很清楚，同时，心不散乱。只有到了定的境界，你才能做到这一点，那个境界就好像一个擦得透亮的玻璃杯，即便是一点点灰尘，一点影像在动，都能看得很清楚。我们的心同时还要清楚的观察到，这个五蕴的生命，是无常的，是苦的，是毕竟空的，一切作为毕竟无我，没有一个真我的存在，我是假我，毕竟无我。诸行无常、诸法无我、涅槃寂静就是小乘的三法印。我们这次讲五蕴的目的，是要配合大家研究做功夫的道理，所以就不仔细说明智慧般若解脱，也不准备把五蕴所有的细节都全部解释，下面看睡眠这一段。“云何睡眠。谓不自在转。昧略为性。不自在者。谓令心等不自在转。是癡之分。又此自性不自在故。令心心法极成昧略。此善不善及无记性。能与过失所依为业。” 睡眠是一种习气，一种生理习惯，是多生多世的生理习惯积累而来的。修持到家的人，能断除了睡眠，不需要睡觉。普通人到了要睡的时候，一点精神都没有，你说，格老子，我就是不睡，但你做不到，你一点都不自在，不能自己做主，你糊里糊塗就睡着了，所以叫做“昧略为性”。睡着了以后，思想都没有了，一片无明，属于贪瞋癡中“癡”的范围。睡觉有时是恶业，有时是善业，有时是无记业。好比说，你今天很生气，想要杀了某人出气，但转念一想，算了，先睡一觉，明于起来再说。但睡过以后，那个杀人心念的力量就减小了，这就是睡眠的善业。但是，如果你说，我今天太累了，等休息好了，明天就去杀他，那就是恶业了。我们平常睡觉是无记，睡完觉，第二天什么都忘记了。一个悟道的人，如果太疲劳时，他心里明白，自己需要睡一下，这也不算过失，这是一种休息的定境。所以说睡觉也有很多学问，也很有意思，运用之妙，也是很难的。 <p>我们的心理状态反映了行蕴的力量，现在我们只是讲大概的意思，真正仔细分析起来内容很多。下面我们接著讲外两个重要的心理状态：寻与伺。这个与功夫很有关系，在《瑜伽师地论》中有详细的论述。“云何寻，谓思慧差别。意言寻求。令心粗相分别为性。意言者。谓是意识。是中或依思或依慧而起。分别粗相者。谓寻求瓶衣车乘等之粗相。乐触苦触等所依为业。”“云何寻”，什么是寻呢？寻这个中国字的意思就是寻找。那么在行蕴中，这个“寻”是指什么呢？“谓思慧差别。意言寻求。令心粗相分别为性。”意思是说，我们在寻找一个东西的时候，思想会动，心会起分别作用。“意言者。谓是意识。是中或依思或依慧而起。”“意言”怎么讲呢？就是意识形态的意思。“是中”，这个中间，“寻”是靠“思”或者“智慧”而来的分别。 关于这个“思”的作用，给大家举个例子，好比说有人修密宗的观想法门，希望观想到菩萨的相，这是想的作用，也有寻求的作用。有人“寻”不到佛菩萨的相，“老师啊，我那个佛像，怎么观想都观想不起来！”我就告诉他，你放松一点嘛，不要想嘛，用思的作用轻轻带一下就好了！“分别粗相者。谓寻求瓶衣车乘等之粗相。乐触苦触等所依为业。”好比说我要买一个桌子、花瓶，或者一件衣服，我就要上街去，这里看看，那里瞧瞧，要去寻找，这就叫作分别粗相。再比如说，你打坐屁股痛，有苦触，或者，你打坐很舒服，不肯下座，这中间你也在寻找。苦的时候，你要找乐，乐多了，你觉得没有味道，你又要去找苦。寻找到了，你就很高兴，找不到，你会有失望之感。我们打坐想得定，那也是在寻找。许多人功夫做了几十年，定境都没有见过，所以说凡夫都在“有寻有伺有”。修行、打坐，修止观，要修到心理上无寻了才对，等到了“伺”的境界，就又进一步了。如果达到“无寻无伺”，自心清净，定境就出现了，那才是功夫。“寻”与“伺”的差别很微妙，比如说打猎、猎狗到处寻找目标就叫“寻”，如果猎狗蹲在那里，等待猎物出现，就叫“伺”。再好比说我们投资作生意，有时候到处找项目，找投资机会，结果费了半天劲，什么收获都没有，这是“寻”。可是等到运气来的时候，那个发财的机会会跑到你面前来，那是“伺”。“寻”与“伺”是两种心理状态，用在做功夫上很细致的。“云何伺。谓思慧差别。意言伺察。令心细相分别为性。细相者。谓于瓶衣等分别细相成不成等差别之义。” 他这里翻译解释得不是很好，我们前面讲寻的时候其实已经讲到伺了。如果用中国禅宗的手法，那解释得就很文学化，很妙了。 一兔横身当古路，苍鹰一见便生擒， 后来猎犬无灵性，空向枯椿旧处寻。 一只兔子横躺在大路上，那苍鹰在空中已看得清清楚楚，从空中冲下来把它活活叼走了。可怜的猎狗闻到兔子的味道，还有那里寻呢，哪知道天上苍鹰早已把兔子叼走了。猎狗就是那个寻的境界。这是禅宗祖师借用这个故事，来说明一般人用功、参话头，不过是像猎狗一样在“寻”找一个境界。还有一个故事，也是讲“伺”的道理，有个徒弟看见师父在研究佛经，这位徒弟已经悟道了，就在外面吟了一首诗，讲那个苍蝇好笨，“百年钻故纸，何日出头时”，都一百岁了，还在窗户纸上钻，哪有出头的日子呢？师父听到这个，马上放下书本，对徒弟说：“你一定悟道了，以前你叫我师父，现在我叫你师父。”经过这位徒弟的指导，这位师父也得道了。后来有人作了一首诗：<p>蝇乃寻光纸上钻，不能透过几多难， <p>忽然撞著一时路，始信平生被眼瞒。 <p>苍蝇喜欢寻找亮光，所以在纸窗上钻来钻去，但无论如何也无法透过纸窗，飞出窗外。忽然撞到进来时的那个洞，才知道自己是被自己的眼睛骗了，原来那个洞就在这里，这就是“伺”的境界。所以中国禅宗是很文学化的，用文学的语言表示出来，寻与伺境界的不同就很清楚了。“云何心不相应行。谓依色心等分位假立。谓此与彼不可施设异不异性。此复云何。谓得。无想定。灭尽定。无想天。命根。众同分。生。老。住。无常。名身。句身。文身。异生性。如是等。”“心不相应行”在唯识中叫做“心不相应行法”。这里的“心”就是意识心，所谓心不相应行，是指那些无法与我们的意识心配合的东西，一共有二十四种。“谓依色心等分位假立”，我们的大脑、心脏是色法，为四大所造，这二十四种东西是依我们现有生命的想而假立的，不是真的。“谓此与彼不可施设异不异性”，这二十四种与我们的心可以说不同（异），也可以说是一体的（不异），但不是我们的意识心可以转动或影响的，除非我们成了佛，达到心能转物的境界。这二十四种下面都有解释。“此复云何。谓得。无想定。灭尽定。无想天。命根。众同分。生。老。住。无常。名身。句身。文身。异生性。如是等。”像无想定、灭尽定等都和我们的意识心不相应，跟我们的意识心绝对是两个世界，你无法用意识心去转动它。还有，我们也无法转动时间和“势”，这一点这里没有提到。所谓“势”，就是一股挡不住的力量，好比说台风，大风来的时候，你完全无法挡住，等它过去，就什么都没有了。禅宗的方法与这些研究教理不同，古代许多禅师都穿得破破烂烂的，也不洗脸，不像那些大法师们，穿得整整齐齐，架子摆得很大。有这么一位禅师，坐在路边的茶馆里喝茶，当时茶馆里还有一位大法师，派头十足，旁边坐著许多皈依弟子，对这位穷兮兮的和尚不大理会。这位禅师要整整他们，就跑到他们面前说：“法师啊，嘿，看你这个样子，佛法一定很高明啊。那你们都讲些什么法呢？”“嗯，我研究的是法相唯识学。”禅师说：“哇！了不起，那我向你请教一个问题，唯识学讲百法，那么，昨天下雨今天晴是那一法？”这一下那位法师就愣住了，晓得碰到高手禅师了，“哎呀，老禅师，请指教！”禅师回答：“那是二六时中，心不相应行法。”一天有十二个时辰，天气随时都在变化，但你的意识心无法把晴天变成下雨，也无法把下雨变成晴天，所以那是心不相应行法。 行蕴讲到这里，算是简单的概括了一遍。真要细讲，内容还很多。 <p>关于识蕴 ：云何识蕴。谓于所缘了别为性。亦名心。能採集故。亦名意。意所摄故。若最胜心。即阿赖耶识。此能採集诸行种子故。又此行相不可分别。前后一类相续转故。又由此识从灭尽定无想定无想天起者。了别境界转识复生。待所缘缘差别转故。数数间断还复生起。又令生死流转迴还故。阿赖耶识者。谓能摄藏一切种子。又能摄藏我慢相故。又复缘身为境界故。又此亦名阿陀那识。执持身故。最胜意者。谓缘藏识为境之识。恒与我癡我见我慢我爱相应。前后一类相续随转。除阿罗汉圣道灭定现在前位。如是六转识。及染污意。阿赖耶识。此八名识蕴。“云何识蕴。谓于所缘了别为性。亦名心。能採集故。”什么是识蕴呢？就是说对于外界一切的缘，心中明明白白，很明了。识的作用也叫做心，它能把外在的境界收拢来，好比说，我们小学、中学所学的中文、外文现在还都能记得，就是这个心、识蕴的作用。“亦名意。意所摄故。若最胜心。即阿赖耶识。此能採集诸行种子故。” 识蕴也叫做“意”。注意，这里的心是总体的心，中间的作用叫做“意”，因为这个识包含在意内，“意所摄故”。我常常拿大海水作比方，那个大的波浪就好比说心所起的作用，叫第七识（末那识），大浪上面的波纹变化就好比是意（第六意识），而我们的眼耳鼻舌身五蕴就好比是大浪上面的浪花，很细，叫做识。所以，这个识蕴包含在“意”里面了。那么识是那里来的呢？是唯心所起。“若最胜心。即阿赖耶识。能採集诸行种子故。”作用最大的那个，叫阿赖耶识，它无形无相，能採集一切心理行为，将它们变成种子。所以，你这一生的行为思想是来世果报的因；而你这一世所遭遇的果，是前世种的因。所以，唯识有两句话：“种子生现行”，过去种性带来的每个人的个性不同，遭遇不同：“现行生种子”。佛学把过去、现在、未来的关系都说得很清楚了，我们这是用前生、今生、来生来说明这个道理。 “又此行相不可分别。前后一类相续转故。” 再说，这个识蕴的作用，它的动的“行相”（行就是运动），有时候几乎分辩不出来。没有时间、没有空间，前后一律，连续的转动，所以叫做轮回，这是第二层的意思。 “又由此识从灭尽定无想定无想天起者。了别境界转识复生。待所缘缘差别转故。数数间断还复生起。” 另外，得了灭尽定、无想定，或升到无想天的人，识暂时灭掉不起作用了，许多阿罗汉就在这个境界，但是，这只是把识的作用压在那里而已。“了别境界转识复生。待所缘缘差别转故。数数间断还复生起。”等时间到了，重新出定的时候，如来藏里行蕴的作用开始，加上各种因缘湊合，那个识的作用还会生起。 “又令生死流转迴还故。” 这个识的作用，让我们在生死轮回中转圈。注意，在这个转的过程中，我们可以把恶的转成善的，但有时，一念之差，无明起作用，也可以把善的转成恶的，白的转成黑的。一切众生，都具备善、恶（不善）、无记的三种种子。没有成佛以前，所有的种子都具备，就是缺三样：声闻（罗汉）、缘觉（独觉佛）、成佛。其实严格来说，不是缺，而是说那个种子还没有发出来。成佛以后，所有的种子都具备，不过，所有种子都被转成白业了。所谓白业，就是纯白纯清的，纯善无恶，也没有无记性了。“阿赖耶识者。谓能摄藏一切种子。又能摄藏我慢相故。又复缘身为境界故。又此亦名阿陀那识。执持身故。” 阿赖耶识就像一个仓库，能包藏现在、过去、未来的一切种子。同时，更严重的是，阿赖耶识还包含了我慢的种子。我们觉得很了不起，很聪明能干，很漂亮，那就是我慢。甚至，那个最笨的人也会觉得“格老子就是笨，怎么样？”这也是我慢。我们心意识同时还会把这个四大和合的肉体生命抓得很牢，所以又叫“阿陀那识”。 “最胜意者。谓缘藏识为境之识。恒与我癡我见我慢我爱相应。前后一类相续随转。除阿罗汉圣道灭定现在前位。如是六转识。及染污意。阿赖耶识。此八名识蕴。”那个藏识，或者说第八阿赖耶识，起用以后，如果没有成道，就会生生世世与我癡（没有智慧）、我见（我的主观成见）、我慢（我了不起）、我爱（我所爱）相应，永远轮回生死。除非你能够得道，大阿罗汉果，得灭尽定，把这个识蕴空掉，把行蕴转过来，否则无法跳出轮回。色受想行识（包括前六识、第七识、和第八阿赖耶识）都包含在阿赖耶识里面，它们是识的八个层次、八个部位。佛的五蕴法相到这里就讲完了。 </p><p>色阴境界的憨山 </p><p>包卓立：现在五蕴已经讲完了。我们首先想请教老师，怎样把五蕴的知识应用于我们的修行。另外，希望老师能用五蕴的概念，对前面讲的案例作一个评价。好比说，他们是否走了弯路，中否可以做得更好，以及他们的修行到了什么程度。最后，请老师说明一下，五蕴与第六、七、八识的互相感应关系。 <p>怀师：你的这三个问题，每一个都可以写成一本一、二十万字的书，我们先拿憨山大师年谱里记述的例子作说明。比如憨山大师二十八岁时，有一次来到河北省的盤山。山上一个茅蓬里住著一位修行的老和尚，憨山大师去看他。古时修行住的茅蓬一般是不关门的，像我过去在农村生活，那时，即便全家人都在农田里干活，家里门也是开的，看门的只有鸡啊、狗啊、猫啊。我们给人家送东西，老远就要叫：某某在家吗？家里有人吗？叫了半天，没人应，就知道家里没人，送的东西摆在那里就行了，也不用留条子。所以中国农村当时就是这种自然社会，外国也是一样的。不像我们现在，不但要关门，还要两三道锁。这是讲到茅蓬顺便提到的。那位师父看见憨山来，并不理会，继续修行。到晚上吃饭了，老和尚自己做饭，自己就吃了。憨山见老和尚吃饭不叫他，就自己拿碗添饭吃，老和尚也不骂他。到第二天，憨山就知道了，到晚饭的时候洗米做饭，老和尚回来不说话就吃，憨山也跟著吃。每天晚上，老和尚都会到盤山顶上经行，双手甩开，大步一圈一圈的走，憨山也跟著他这么一圈一圈的走。有一天晚上正在经行，憨山突然好像身心都空了，看见大海，整个世界都在一片光明之中，舒服清凉极了，这时当然没有杂念妄想。老和尚已经知道了，故意问他：“怎么样？”注意哦，这时他们才开始说话。憨山说：“一片光明中”。 根据《华严经》，这种境界叫“海印发光三昧”。如果你坐远洋轮船，在大海之上，到了深夜，满天没有片云，大海与天连成一片，人站在船上，身心皆空，那个情景就是这个境界。老和尚说：“哼，这有什么了不起，我住山三十年，夜夜经行都在这个境界里头。”这种境界属于《楞严经》里讲的色阴（色蕴）范围，等于密宗讲的气脉起了变化。这当然也是个好的境界，不过与“道”无关。 </p><p>李女士：书上说这位老和尚“夜夜经行此境但不著，则不被他昧却本有。” </p><p>怀师：对，不要贪图这个境界，这有什么了不起呢？这不过是四大生理变化所反映的现象而已。你不要执著于它，否则就会被这些境界骗走了。所以这个老和尚很了不起，当然，能达到这个境界也很不容易，很了不起了。注意，这种境界不是只有打坐才能达到，站著、经行、睡觉做得到，那才是修行啊！憨山三十岁时，在五台山习定修行，他住的地方有个溪流，轰轰隆隆很吵。如果像我们现在这样讲话，声音太小，听不见，需要大声喊。憨山在那里打坐静不下来，一气之下，“格老子，我就到溪水旁边的桥上，在那个最吵的地方打坐，让你吵个够。”开始时水声很大，后来就什么都听不到了，进入了一种定境。不知道过了多久，出定了，才发现饭锅里的饭已经长绿毛了。这样算起来，起码过了十几、二十天了。这又是一个修行境界，像你们诸位打坐修行，连想都不敢想。三十一岁时，一位姓胡的平阳太守请憨山到自己家里过冬。当时有人想请太守题诗，那太守胸无点墨，把古今诗集放在茶几上，准备等一会偶尔翻一翻，得点灵感。憨山碰巧翻了一下诗书，也准备吟上一首诗。忽然，灵感来了，一口气写了三十几首诗，从前学的诗书词赋都出来了，就算浑身都是嘴巴，也没法把脑海中出现的那些诗词都写完。当时，没有身子的感觉，整个身体好像要飞起来了。这样过了一天，第二天他已经知道这是自己的文字习气来了，是“禅病”。但是怎么办呢？没有办法，只好睡觉。睡觉果然有效，睡醒后接著就打坐，一下子就觉得身体没有了。后来太守家的小佣人来敲门，但是没人应，胡太守就把窗子打开，发现他在打坐，怎么叫都不醒。好在憨山以前就告诉过这位胡太守，用引磬一敲，入定的人就会出定了。这时，憨山入定已有五日，但憨山已经不记得是怎么一回事了。这是憨山大师的一段修行公案。中国历代禅宗祖师们也都有类似的实证用功经验，但是不像西藏与印度那样记录于案。大禅师们认为，这些境界都是小玩意，没有什么了不起，都不大理会。所以，达摩祖师说中国有大乘气象。当然，我不是说现在的中国人了不起，现在的中国人是起不了。憨山大师的修行经验，是他的学生写的。以前不叫传记，叫年谱，老师把每一年的经过讲出来，然后由学生记录整理出来。年谱是到明朝才开始有的，以前古人都不太写自己，不像现在人，动不动就写自传、回忆录，都是说自己怎么了不起，看了以后你就知道，其实都是起不了。这些修行境界不是究竟，不是道，修行的人很容易被这些境界挡住。不过，以现代科学观念来讲，这些经历也确实应该写出来，给大家一个参考。所以我主张大家多研究、多写。这是第一点。 <p>第二，你们注意，憨山大师的经历很特别，他很有天才，但就是喜欢走修行的路线，父母没有办法，只好同意他出家。憨山有一位很了不起的师祖（师父的师父），见他很有天才，没有马上同意他出家，而是请老师来教他世间的一切学问。拿现代话来讲，就是物理、化学什么都要他学一学。等憨山到了十几岁的时候，在学问上就已经很有成就了。注意哦，他这时还没有出家哦！这时师祖就问他，“你看你这一生要作什么呢？”憨山还是决定出家，这个决定与他小时候的一个故事有关。那还是他很小的时候，母亲和他谈起读书做官的事。他问母亲：“功名考取做什么？”“做官啊”母亲回答。“官做到什么最大？”他接著问，“宰相啊”，母亲回答。“那宰相以后呢？”“罢了”。母亲回答所谓罢了，就是退休的意思。憨山说，“那多没意思，作了宰相还不是罢了，不如我去作佛吧！”所以师祖问他的时候，他还是决定出家。根据佛法的规矩，年满十八，父母同意，而且自己真发愿才可以出家，不然则犯了佛的戒律。如果有家人，还要得到家人的同意才可以。所以说出家可不是一件很随便的事，佛的戒律是很有道理的。憨山的母亲是拜观音菩萨的，有一天，她梦见观世音菩萨抱著一个小孩子给他，接著她就怀孕了。等到憨山九岁的时候，有一次，他在庙子里读书，听见和尚说，念观世音菩萨的经能够救苦救难，他就向和尚要了这本经，读完后就念给妈妈听。妈妈觉得很奇怪也很高兴，不知道儿子怎么会有这本经，而且念起经来有模有样，像老和尚似的。十岁的时候，憨山就想要出家了。母亲说：“那要看你有没有这个福报了”，他说：“我有这个福报，就看你舍不舍得！”母亲说：“只要你有这个决心，我就舍得。”憨山十九岁正式出家，见到棲霞山很有名的云谷禅师。出家后，他看佛经、修行，在二十八岁到三十一岁的四年之中就有了那些境界。有一点要特别注意，在我看来，他在那个年龄应该没有动过欲念，没犯过手淫，没有讲过恋爱，没有破过身。这样的人，一旦开始修行，功夫进步会很快。所以，佛法的比丘戒和小乘戒都叫你戒淫欲。淫欲不仅仅指男女关系，还包括手淫和意淫。还有一个关键，大家恐怕都没有注意到，三十一岁以后，他就开始宏法了，关于他功夫的记载也就少了。这之后他的名气很大，儒、佛、道都通，著述很多，应该说是明朝以后出家人中著述最多的了。他可以说是影响了一个时代，到明朝末年的时候，甚至皇太后都皈依他，作了他的弟子。而当时的皇帝受西方文化影响，信天主教，因此与母亲有冲突。讲到这里，我想起台湾广钦老和尚的故事。广钦老和尚一辈子不吃饭，只吃水果，在台湾很有名。当年，他曾在福建泉州的清源山洞入定，一定就是几十天。他虽然不认识字，但大家都说他有道，也有些灵感（不算是神通）。我上山拜访他，他讲的是闽南话，我不会讲，我讲的是国语，他也不会听，但是我们可以对答。当时旁边没有人，有人我就不好问了，我说：“听说你在泉州山洞入定，有这么一回事么？”他说：“有啊，当时，我住在茅蓬里，入定以后，后山顶庙子里的和尚不懂，以为我死了，要把我抬出去烧了。当时弘一大师在那里挂褡，他问和尚们作什么，和尚们告诉他，山顶有个住茅蓬的人死了。弘一大师说，慢一点，看样子恐怕是入定了，不是死了。所以弘一大师敲引磬叫我出定，是他把我救出来的，否则，恐怕早被那些和尚烧掉了。”我接著问他：“师父，那个时候，你恐怕不超过三十岁吧？”他说：“对啊！你怎么知道？”我说：“我想是这样的。”我是故意逗他的，他也不晓得。我说：“你以后就没有再经历过这样的定境了吧？”他说：“没有，后来就来台湾了。”我说：“为什么呢？”他说：“宏法太忙了”，我笑了一下，就不现谈了。 你们再看中国历史上的一个故事：宋徽宗致和三年的四月，四川嘉州地方忽然一阵骤风，吹倒了龙渊寺内的一株老树。赫然发现树干中有一个入定的和尚。皇帝命令迎入京城（时在八月）。老和尚出定后却问，“我哥哥慧远法师在哪里？”慧远法师是东晋时代的人，在庐山创办了净土宗念佛法门。大家告诉他，现在是宋朝了，几百年前的人，怎么是你哥哥呢（嘉泰普灯录》卷廿二）？原来这位老和尚是晋朝四川嘉州龙渊寺的主持慧持法师，他入定过了几百年（《释氏稽古略》卷二），到宋朝才出定。像这各修行的经验里面有很多问题，我们要走科学的路线，好好研究。其实佛法就是科学，你佛经讲五蕴讲八识，分析得那么清楚。现在问题来了，为什么他们用功以后能有这样的定境呢？他们的境界都属于什么定境（三摩地）呢？他们的定是否都是同样的境界呢？如果用五蕴的道理来讲，他们是受那一蕴的影响呢？我提了很多问题，你们要研究，明天你们要讲话，否则有什么用？谈恋爱，打架也还要有个对象呢，你们要是提不出问题来，我就没有对象了，就没有意思了。 <p>说定 ，定的境界也叫三摩地，佛经上说“百千三昧”，就是说，有成百上千个三摩地的境界，各有不同。好比说，刚有同学写毛笔字，进步入了写毛笔字的定境，忘我了，忘了外面的时间与空间，没有其他妄想了，一心都在书法上，这叫书法三昧。画画的人可以进入画画的三昧，读书的也可以进入读书三昧。这些都是属于普通的，比较小的定境。 <p>现在，我们再回过头来，看那些修行人的定境。像广钦老和尚尽管只吃水果，并且已经修行几十年了，而且还有那些定境，但是他的背是弯的，像罗锅一样。 很多人打坐都有这个罗锅的问题。你看中国画上的那些老和尚，也都是弯腰驼背的，没有一个像雕塑的菩萨那样端容正坐。如果这叫作打坐入定，那我何必学这个呢？我学罗锅就好了。你看你们自己打坐坐得好的时候那个样子（师表演昏沉样），那是小昏沉，还算不上大昏沉呢（师接着表演弯腰驼背点头样）。这算什么定呢？ 还有，达摩祖师到中国传法，面壁九年，结果日本人就学会了面壁，每个人打坐都要找一个地方面壁，背向外面打坐。我就笑他们，修行不是修腿，也不是看壁。你说修行到底是怎么一回事呢？另外，你们已经听了移喜磁磋嘉女佛的修行故事，还有密勒日巴、甘波巴等等，这里面都有很多问题值得研究。我们现在只是把问题提出来，等到后面再讨论。憨山大师入定后，叫不醒他也喊不醒他，最后是靠引磐才能出定，这又是什么道理呢？你们现在也学了一点佛法了，也要买把磐，作个准备，万一什么时候会需要，也能帮助人家，否则，人家告你麻醉，告你引导自杀，你还要去法院，还要消灾呢！不过，我想你们是不会入定的，你们那是五漏之身，是个漏得一塌糊涂的破房子，怎么会真正入定呢？ 如果真有人打坐入定了，千万不要摇动他，否则，他出定后身体会受伤。中国古代的《神尼传》里有很多这样的记载。比如说，徒弟不知道师父入定了，拉师父的手叫师父起来吃饭，结果手像面筋一样越拉越长。当然，放开以后，手还会自然收回去，但是出定以后就受伤了，不过，这是可以治的，重新入定后气脉还可以重新转过来。 <p>还有一个故事，是唐朝时候的事。有一位禅师是修水观的，徒弟去看师父打坐，结果看不见人，只看见房间里一池水，徒弟好奇，就往水里丢一个小瓦片。师父出定后身体就有问题了，于是问徒弟：“我刚才打坐，你来看过我吗？”“我来叫师父吃饭”，“那你做了什么？”徒弟回答：“我见都是水，就丢了一个小石头进去。”师父吩咐徒弟说：“我再打坐入定，你把那块石头捡走就行了。”这样以后就没有事了。 </p><p>陈女士：禅师入定的时候对石头没有感觉吗？ </p><p>怀师：这时，色身的四大、气脉都已经转变了，这些人修行都是很有功力的。那位禅师进入水观境界的时候，已经没有身见了，我就是水，水就是我。所以看不到人，只有水。所以说物可以变心，心也可以变物。《神僧尼传》中记录的很多高僧尼姑都很了不起，随炀帝的父亲杨坚，就是神尼带大的。除了水观外，还有人作树观、入“树观定”以后就变成树了。另外，修光明定的人作火观，入火观的时候人就看不见了，只能看见一团亮光。如果在房子里打坐，房子也不会烧，只是房子也看不到了，只见到一团火光。中国古时候这种记载很多，有人以为着火了，跑去救火，到地方才知道没有起火，只是有人入定了。但是这个火观的火也真能烧起来哦！再比如说，大阿罗汉有神通，但平时一般不会示现给大家看，等他现十八变给你看的时候，说明他快要死了。十八变就是左边出水右边出火，或者左边出火右边出水，身体下面出水上面出火，或者下面出火上面出水。他会把虚空变成实体，实体变虚空，可以在虚空中行、坐、飞行，等这些示现完了以后，就一阵火光走了。这些大阿罗汉走的时候不用柴火，仅用自己的三昧真火就可以燃烧了。所谓三昧真火，就是说在定中，他调动火大把自己焚化了。如果他调动的是水大，他就会变成水了，如果调动气大，就会变成风了，如果调动空大就会空了，没有了。这些佛法都需要实证的，没有那么简单。有的修行人走的时候会化成彩虹，这种情况与上面讲的差不多，不过道理不同，境界又不同了，这就是所谓百千三昧。有时候，我们身体一边是冰的痛苦，而另一边却在发烧，或者下面寒上面却发炎。我们的情绪有喜怒哀乐，我们的身体每分每秒都不同，都在变。如果你能够稳定自己的情绪、思想、身心，那就是很大的定力了，很难做到哦！这个定与前面讲的定又不同了。大家不要以为打坐、念佛、拜佛就是修行，不要以懂了理论就是修行，那样的话，你连修行的影子都没有呢！所以我常说，只有两个人是真修行，一个死了，一个还没有投胎。所以研究教理固然重要，但光研究教理而不修行也没有用。根据唯识学的教理，有五种情况属于无心地：睡眠、闷绝、无想定、无想天、大阿罗汉的灭尽定。闷绝就是昏迷过去，比如麻醉、植物人都属于闷绝。“无心”就是没有意识思想的意思。 比如说无想定、无想天、空无边处定、无所有处定。这四种定与闷绝有什么不同呢？灭尽定与无想定的差别又在那里呢？这些问题你们都不会想的啦，你们随便去打打坐还可以，那是休息、好玩。我以前就讲过，世界上最享受的就是打坐，但要真学佛修道，就要很认真的研究了。佛经讲了四禅八定的大原则，但是没有讲放光变彩虹之类的。除了《楞严经》五十种阴魔讲这些境界外，其他佛经都不谈这些，都不谈神通，因为神通都是唯物唯心的变化，都是无常。没有这个身体，你就什么都不通了，有人说没有身体还中可以有神通，比如说“鬼通”，那我问你，你看见过鬼吗？</p><p>赵教授：无想定是一个定境，无想天是一个果位，为什么把两个并列放在一起呢？ </p><p>怀师：得了无想定境界的人还有一个肉体存在，而你若进了无想天你就不是这个肉体了，差别就在这里。好比说你拿了博士学位，那只是说明你到了那个境界，你若当上教授或者总统，那就表示你到了那个果位，教授与总统就好比是不同的果位。注意！五位无心地也包括灭尽定，灭尽定并不是断灭相。断灭相是佛学名词，包括两层意思，一是断见，一是常见。什么是断见呢？好比说×××××××信仰唯物哲学，他们认为生命死了就是死了，没有轮回也没有三世因果，就像这香烟一样，抽完就没有了，不会再回来，这就是断见。什么是常见呢？比如说基督教和天主教认为生命死了还存在，等到末日的时候再复活，再听上帝的审判，这是常见。再比如说，印度有学派认为轮回是一个阶段，而我们既然有轮回，可见有个生命是不生不死的，生命是永远存在的，其实这也是错误理解了佛法，也落在了常见。断常二见都不对，佛法是智慧的见解。一般人不是落于断见就是落于常见，学习佛法最怕的就是落在两边，落在断常坑。好比说刚才讲的灭尽定，那是一种方法，一种功夫。如果你得了灭尽定就认为一切灭了，修道成功了，就落在了断见上。灭尽定或者无想定是功夫，是可以求证来的，而那个断见是见解的问题，属于理解、智慧这一面。 </p><p>赵教授：为什么说断常两见都不对呢？如果说轮回不说明生命常在，难道说轮回说明生命不常在吗？ </p><p>怀师：大家注意！轮回并不说明生命常在，轮回只是说明生命的变化，到最后是没有一个东西的。落在空不对，落在有也不对，什么都不对，连“什么都不对”这种说法也不对。 <p>小乘佛法讲的是“断惑证真”，认为斩断一切迷惑，一切妄念，什么都没有了就是道，这是错误的，是断见。实际上，我们的贪嗔癡慢疑这些“惑”是非常非常的，不是切得断的。好像说你今年五十岁了，你以为五十年前的事就没有了，都断了吗？其实，五十年前的事都有，都还存在，你一回想，它不就都来了吗？你说这算不算有呢？今天不是昨天，明天也不是今天，所以说它是非“常”。可是，你说它没有吗？今天也就是昨天，明天也就是今天，所以说它也不是“断”。这是本体论，这才是菩提道，这才是佛法，至于那些功夫，不过都是花样外表而已。 “修行恐落断常坑”，所以你面对现实不对，逃避现实也不对，半面对关逃也不对，说不对也不对，说对也统统不对。佛法、菩提道是离四句绝百非，哪能四句呢？就是空、有、即空即有、非空非有”。所谓百非，就是不对是不对，不对不对也还是不对，就是说一百个不对（非）也还是不对（非）。什么打坐啦，四禅八定，那也不是道，不定也不是道，倒定不定也不是道。放光不是道，不放光也不是道。如果放光是道，那何必修一辈子呢？电灯泡就得道了。你死了能化为彩虹又怎么样呢？与我又有什么关系呢？如果靠你照亮的话，那我还不如买个电筒好了，如果你说彩虹好看，那我还不如看电视呢！ 道、菩提，到底是个什么东西呢？这真正是很难讲！禅宗有个公案，没有正式记载，相传的，说有一个人修行了几十年都没得道，于是就回家了，还是做个普通人。夜里抱著太太搞了一半，突然就悟道了。 <p>赵教授：我们没有尝过悟道的滋味，只有悟了以后才知道什么是“道”。<p>怀师：“随顺世缘无挂碍，涅槃生死等空花。”这是张拙秀才的诗，有没有道？那个就是道！在用功方面，《楞严经》有一句话：“狂性自歇，歇即菩提。”注意，这只是方便说法哦！以禅宗的规矩，这两句话也要打棒子的，歇也不是菩提！但是，谁又真能做到狂性自歇呢？ 有这么一个故事。一位禅师悟道了，在内裤上写了一个佛字，徒弟模仿师父，也在内裤上写了一个佛字，师父告诉他：“你怎么可以这样，不得了啊！”徒弟说：“师父，你不就是这样吗？”师父说：“哎呀，不能跟我学啊！”结果徒弟的身体统统烂掉了。师父是悟了道的，可以这样玩一下，没悟道的人不可以随便这样。 还有一个禅宗故事是这样的：有个小孩跑到大殿，对著佛像撒尿，和尚嚇坏了，说：“你这个小孩怎么可以这样？”小孩回答说：“佛经上说，十方三世都有佛，不在这里屙，你叫我在那里屙啊？”对啊，佛无所不在，你叫他在好里屙呢？憨山大师走的是中国禅宗大乘佛法的路线，先渐修然后到达顿悟，与西藏、印度许多人的行路线不同。像憨山大师那种经历，要是在西藏或者印度，烘托一下，宣扬一下，讲起来就不得了啦。 </p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "第二章 密宗有关的修行",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>五蕴 五行 五方佛 </p><p>包卓立：前面讲了如何利用五蕴的知识去理解那讲过的案例。现在我手头上有一份英文资料，它说色是物质的，就好像是啤酒上那些细的泡沫；受则像是肥皂水吹的大泡泡；想就像海市蜃楼；行就像芭蕉树；而识就好像人的幻觉。 </p><p>怀师：这种说法是西藏一般学佛的人，根据佛说的五蕴，再加上密宗的一些道理而来的，佛并没有完全这样讲。我们现在还没有对五蕴做总结论，也还没有把佛学经典与西藏佛学作比较。你们刚才讲的这些比喻与做功夫都是有关系的。把色蕴比喻为聚沫，受蕴比喻为大泡沫，想比喻为海市蜃楼，这样比喻不是很恰当。其实整个学佛本身就可以被比喻为海市蜃楼，例如释迦牟尼佛当时说法的时候就说过，一切如梦如幻，这就是海市蜃楼的意思了。 行蕴讲的是一个动能，按道家来说，就是宇宙万物那个生生不已的功能。刚才他说识蕴是虚幻的，从佛学的理论来讲，这个说法有问题，识蕴是非空非有，不能完全认为是虚幻的。他的这五个比喻犯了一个错误，引用诸葛亮的话来说，叫作“引喻失义”。讲逻辑（也叫因明）是可以用比喻的，但这里这种比喻不当。不管是儒家还是道家，或者是算命、看风水的阴阳家，中国人用的是金木水火土五行，也就是相当于佛学的五蕴，这其实也是个比喻。东方属木，为什么呢？因为生命力最强的是草木，生生不已，就像唐朝诗人白居易的诗所描述的： <p>离离原上草，一岁一枯荣， <p>野火烧不尽，春风吹又生。 <p>草木具有很强的生发力量，我们地球最初形成的时候，首先出现的就是草木，就连从一千多年前的坟墓里挖出来的种子，经过培养，还能重新发芽成长。木属于行蕴，代表那股生生不已的力量。南方属火，火属于想蕴；北方水属于受蕴；西方金属于色蕴；而中央戊已土属于识蕴。中国阴阳家有两句话：“四象（太阴、太阳、少阴、少阳）五行皆藉土，九宫八卦不离壬。”这是地球文化，土能生长万物，含藏万物，识蕴也有这个功能，所以识蕴属土，这是听到他们的比喻而联想起来的。 </p><p>李居士：五蕴也叫五阴，老师刚才说行蕴代表了那股生生不息的力量，似乎代表的是“阳”的那一面，而不是“阴”的那一面，那为什么不叫“五阳”呢？<p>怀师：在佛学里，修持没有成就以前叫阿赖耶识，叫作众生的妄心，那是阴的一面；而修行成佛以后，就不叫阿赖耶识了，叫如来藏识，那就是阳的一面了。修行并不是断了什么，而是回到本来。五蕴是对凡夫众生讲的，成佛以后就不叫五蕴了，叫五方佛，这是密宗所用的秘密，现在都给你们讲透彻了。空本身就是有，空就包含了一切，能生一切万法。密宗自己认为比显教高，其实密宗是佛涅槃后，佛弟子们中的一派，他的修法属于“一切有”部。不管是显教还是密宗，都认为空、般若第一。这里要特别提出来的是，本性是不生不灭的，唯心的那个作用是不生不灭的，唯物的也是不生不灭的。这个秘密《楞严经》里有讲，以后我们作总结论的时候还会提出来讲。你转识成智成佛以后，色蕴（金）就变成了西方极乐世界，阿弥陀佛就在西方极乐。行蕴（木）则转成东方琉璃世界，东方药师佛和阿閦佛在东方琉璃世界。想蕴（火）变成了南方宝生佛。受蕴（水）变成了北方不空佛。而识蕴（中央）则变成了毗卢遮那佛。古今中外，古往今来的一切佛都是毗卢遮那佛的化身，所以释迦牟尼佛，乃至阿弥陀佛都是毗卢遮那佛的化身而已。真正的佛，总体的佛，就是毗卢遮那佛。卢舍那佛是色界天成佛的，是报身佛。所以说唯心可以成佛，唯物也可以成佛，不过要真正转物就需要真功夫真本事了，所以说学佛是一个大科学。这些都是大秘密，是佛学的内幕，现在都替你们揭穿了。大毗卢遮那佛的密宗修法是最大的一部，包括了日本的东密和西藏的藏密，中国翻译成大日如来，日本人就拿大日来炫耀自己。 </p><p>李居士：如果这样分的话，那不是说，在西方极乐世界，只是转化了色蕴而已，其他四蕴都没转呢？ <p>怀师：不是，由于各人业力不同，所以转的方面不同，但最后还是唯心的。这里他只是用这个来说明唯物与唯心是一个根根，物与心都是不生不灭的，不过他用宗教的言语一讲就变成这个样子了。 </p><p>时轮金刚 </p><p>包卓立：下面要给大家介绍的这段是从时轮坛城里翻译成英文的，坛城的内容一般是不允许翻译的，我们很幸运，这一段刚好被翻出来了。这段讲的是人身体的发育过程，他说，卵受精以后先开始发育的是脉，脉是由四个元素组成的，共有五个：督脉、任脉、中脉、左脉、右脉。色蕴是基于血肉来的，想是基于血来的，受蕴是基于呼而来的，行蕴是基于吸而来的，识蕴是基于热而来。 <p>怀师：这样翻译都有问题，不知道藏文原文是怎么讲的。不能说色蕴是基于血肉来的，说血肉是基于色蕴来的还差不多。其他的那几点也都不对。在西藏的密宗来讲，时轮金刚是个大法，他们认为时轮金刚有十二人头在那里旋转。时轮金刚的灌顶威力很大，要想得到时轮金刚法门的灌顶非常困难。 宗喀巴大师是西藏黄教的祖师，他修的最大法门是阎曼德迦（Yamantaka)，藏文也叫十三尊大威德金刚，是文殊菩萨的化身，有三个牛头，十八只手，三十六只脚等。 时轮金刚几乎和十三尊大威德一样的严重，所以在西藏是很大的法。现在我要揭开时轮金刚修法的秘密，首先向十方诸佛抱歉，还不仅仅是向诸菩萨抱歉。时轮金刚的修法其实与长寿佛、药师佛的修法是相通的。时轮金刚有十二个头旋转，代表了一天十二个时辰，一年十二个月。药师佛也有十二大护法神，他们是一个系统的法门。这是首先对时轮金刚作的一个说明，许多喇嘛活佛们也不见得懂。我始终不肯讲密宗，讲出来怕有些人也许会拿毒药给我吃呢。按这材料讲，生命首先发育的是脉，这句话还马马虎虎过得去，不过，他没有讲生命与风大的关系。佛其实在《入胎经》里很仔细的讲了生命发展的过程，佛说，怀胎时，每七天一个变化，有一个风轮在转动。所谓风轮，就是中国人讲的气，不过不是空气的气，好个风代表的生命的能量，无以表之，只好用气字来代表，其实也就是行蕴的转变。 <p>另外，出入气是生灭法，不能说受蕴、行蕴是基于出入气，只能说地水火风四大的变化与脉的关系密切。我们的每一个细胞都具备了地水火风空五大种性，不能说它是属于心肝脾肺肾或者什么经脉。好比说唯识法相宗讲八识，按西藏说法，好像眼耳鼻舌身前五识都在身上，属于外面，第六意识在脑里面，第七识在身上的海底，第八阿赖耶识在中脉，这种固定的说法都是不通的。关于这一点，《楞严经》曾经提到，比如说我同时打你的头、膀子、和脚，你不会说只有头痛，或者只有脚痛，或者只有膀子痛，它们三个地方会同时反应痛。所以说，识无处不在，不能硬性把它归为身体的某部位。 </p><p/><p>重要的第六意识 </p><p>戴教授：你说不能这样分类，可是修拙火就与第六意识有关啊！ </p><p>怀师：修拙火当然与第六意思有关系，与四大也有关系啊！任何一种修法，不管是显教还是密宗，都与第六意识有关系，都是靠第六意识的功能来的，包括最后成佛也是靠第六意识来的。这是回答你问题的第一点。第二点，到现在为止，我还没有对拙火作总结。不过既然你提到这个问题，我就先说明一下。我们前面讨论的密宗修法的那些境界都是在生理的、唯物方面的，那些修行法门都属于佛法的加行法，不是究竟的方法。那些修气所发生的境界,都是四大的变化所引起的。比如说，修气、修安那般那可以转变风大，这之后修脉则转变水大，然后修拙火转变火大，风、水、火都转了以后，最后转变地大。整个色身的转变是修报身的过程，是唯物的、生理的部分，不过，要做到这些，都要靠意识的力量。许多学密宗的人，都被这些唯物转变的种种现象迷惑住了，以为这就是佛法，其实这只不过是佛法的加行法，不算什么了不起。中国禅宗祖师们走的是大乘路线，对这些境界都不大记载，而在西藏，则特别重视记录这些色身转变的过程。 风大、水大、火大、地大都转变了以后，还不算是成就报身，要到涅槃的时候，才达到报身成就。化一道虹光，或者大阿罗汉的十八变，都只是四大变化所发生的各种功夫现象而已。真正的佛法在智慧、菩提那一面，不是这个功夫现象。这些显教密宗的修法秘密，《楞严经》上都有，大家都没有去看，也看不懂。 </p><p>拙火与成佛 </p><p>现在我们先回忆一下以前讲的内容。我们的课是从包卓立介绍的美国人修习拙火的案例开始的。所谓拙火是印度瑜珈修持的专门名词，密宗，尤其是密勒日巴那一派，非常重视修气、修脉、修色身，也就是修报身成就，而修拙火定是修报身的重要法门。 拙火的印度梵文本名叫军荼利，拙火是中文的意译，表示它是生命本能上就有的功能。对普通人来讲，它处于睡眠状态，如同死了一般。所谓“拙”就有笨笨的、傻傻的、潜伏在身体内部的意思。也有人把拙火翻成灵能或灵力，拙火是从元朝开始用的中文翻译。 密宗、印度瑜珈或婆罗门教等，经常用一条半睡半醒的蛇来表示拙火，通常的画面是一条身体盘起，头翘起来的蛇。中国的道家，比如说北方道家的真武大帝——也叫玄武大帝，就有一种说法：在武当山上供奉的玄武大帝，前面有龟蛇二将，蛇盘在那里，与乌龟成交媾状。这个造型代表了道家，也代表了拙火，不过在道家不叫拙火，而是叫“先天一炁，从虚无中来”。现在藏密以及印度瑜珈，正向欧美和全世界传播，到处都有人在讲拙火，那么有没有人真正明白拙火的道理，真正修习到拙火的成就呢？在我看来，答案是“没有”。有人自己标榜有功夫、有成就，以我来看，别的功夫没有，有的只是庄子讲的“吹功”。包卓立看了很多案例，也怀疑是这种情况，所以要我作个说明。他介绍的那些美国案例，都是自以为有拙火，其实他们的经历不过是第一步修气的反应，而且还谈不上是真气，也谈不上修脉，更谈不上拙火了。从修行的次序来讲，第一要修气，第二修脉，第三步才修拙火。现在后世的人学藏密，动不动就随便讲什么修气脉，甚至讲什么男女双修，他们对修持的次序，对双修欲乐定与拙火、气脉的关系都不清楚，都在那里乱搞，如果这样学密宗，那是离佛法越来越远了，这是第一点要说明的。<p>第二，密宗很重视修气、修脉、修拙火。密宗流行以后，全世界都好像以为，只要到了拙火发动就成佛得道了。在这里，我可以肯定的下一个断语，这种观念是绝对错误的！修习拙火在佛法中只能说是加行法的方便法门，双修的欲乐定的方法也是加行法的方便法门，这些与明心见性悟道成佛，与佛所说的阿耨多罗三藐三菩提，可以说根本不相干。<p>但是，你们也不要片面理解我讲的这句话，真正得道成佛，大彻大悟明心见性的人，他的气脉一定是通的，他的拙火一定是发动的，他自然就会到那个境界。所以说，你也不能说修气脉拙火毫无价值。这里主要是想提醒大家，学佛要有正知正见，要明白学佛的最高目的是证得无上菩提、明心见性而成佛成道，并不是成就拙火，拙火只是辅助的。假如说有人理通了，明心见性了，但是气脉不没有通，这个还不算真成就，还要悟后起修、做功夫。佛说的显教经典翻译成中文的有五、六千卷，但并没有讲到修气、修脉、修拙火的问题。这些都是印度后期的佛法，在初唐的时候传到西藏，再由西藏传到全世界的。藏密的这种修法，配合印度的瑜珈，才有了修气修脉修拙火这种说法。如果严格的站在人类历史发展的立场来讲，应该说印度文化受了中国道家的影响，或者说后期的密宗受了印度瑜珈和道家综合的影响，才产生了这些对人体生命功能的理论研究和经验。这是从学术考据的立场来看这个问题。</p><p>四加行 密行 苦行</p><p>佛菩萨所说经典，以及后世弟子们的著作五千多卷，表面上来看没有提到气脉拙火的修行，其实，显教经典里也讲了，只是一般研究佛学的人都是书呆子，只懂学理，自已没有修持，所以不了解。佛经的显教经典，经常提到四加行的方法，它对小乘的声闻缘觉以及菩萨、或者凡夫修行成佛都很重要。所谓加行，按现在的话来说，就是对好的材料进行加工，把它变成成品。<p>四加行就是暖、顶、忍、世第一法。从三国以后到唐宋元明法的历代法师们，都是这样解释四加行的：<p>暖——就是把我们的恶念慢慢转成善念，善念慢慢转成清净没有妄想的境界，功夫到了暖法，全身软绵绵的，如婴儿一般。<p>顶——就是达到很高的清净境界，与天地精神相往来。<p>忍——就是忍受，修忍辱波罗蜜，妄想截断了，超然独立。<p>世第一法——就是能断一切法，作人到达了顶尖，但仍未超出世间。</p><p>一般讲学理的人都是把四加行说成是心理道德的修养，当然这样讲也不为错，但是，四加行实际上讲的是修行的功夫境界。比如大家念佛修行，真正能得“暖”的人不多，如果杂念妄想恶念去掉了，都转成善念了，四大也就转化了，人就会随时都在“暖”中。注意，生命就是一个“暖”字，万物都是温暖的春天里成长，如果冷却了，就是死亡。得暖以后，功夫达到了，则顶脉打开了，也就是所谓的与佛菩萨法界合一了，这就是“顶”的境界 “忍”有切断的意思，到了“忍”的阶段就一切切断了，一切停住了，一切空了。所以“忍”才是大家，这之后才达到“世第一法”。<p>有一部经典，是弥勒菩萨讲的《现观庄严论》，过去一直没有翻译，是几十年前太虚法师的弟子法尊法师到西藏留学带回来的。中文翻译的文字不是很高明，用的是玄奘法师翻译的体裁，不过，也已经很不错了。 所谓“现观”就是现量境界，“庄严论”是专门讲四加行的。修气、修脉、修拙火属于四加行暖顶忍的范围，所以说，显教密宗本来就是相通的，只是一般人没有学通，所以就越来越不通了。<p>前面讲的那些现代美国人修行的案例，都不是拙火，所以后来我们就提出移喜磋嘉、玛吉瑙准两位女性成就者，以及密勒日巴、甘波巴等这些有拙火定成就的男性来作讨论。注意哦！我只是说他们有拙火定成就，我没有说他们有别的成就哦！你们注意，这些人拙火发动以前，都经历了几十年种种的苦行修持，都受了很多磨难。现在有些学密宗的人，不了一点点，叫人家灌了一下顶，就以为是学密宗了。我就笑他们，拿水洒一洒就叫灌顶吗？要想真正灌顶，你首先自己要修持到某个程度才行，到那时候，诸佛菩萨自然给你灌顶！我可以明白的给你们讲，你修持到四加行“暖顶”的程度，灌顶可以初步有作用了。真正的大灌顶是在快要成佛的时候，那是十地菩萨以上的灌顶位（或者叫灌顶地）法王子，再一个身就可以成佛成教主了，那时的灌顶才是真正的灌顶。学密宗的人很容易著相，常常在那里癡人说梦，哦！我昨天梦中又得感应啦，等等。真正达到拙火定，得到气脉成就，要很多苦行，很多功德。我们介绍的那几位西藏祖师（编按：移喜磋嘉、密勒日巴、甘波巴等。）的拙火成就，算是比较标准的了。<p><p>包卓立：达到拙火定成就是不是一定要经过苦行呢？</p><p>怀师：是的。比如说你生活环境很好，但是你需要天天修持，念经拜佛，念咒子修定，即便你是帝王，如果要修行，也需要这样做。另外你还要作功德，要救世救民。菩萨行本身就是苦行，不是说一定要去讨饭住山洞。住山洞是小乘的苦行，大菩萨入世，难行能行，做不到的能够做；难忍能忍，救世救人，这种苦行比住山洞、讨饭、吃素还要难。换句话说，苦行有明显的苦行和秘密的苦行两种，秘密的苦行在佛经里也叫密行。不苦行磨炼自己，就不能消去多生多世累积的业，就不可能成就。在印度现在还有很多人是修苦行的，我也自认为一辈子到现在，一直在修苦行。为什么要修气脉拙火那么我们为什么要修气脉修拙火呢？不管是显教还是密宗，都没有拉开帷幕直接回答这个问题，现在我就明白的告诉你们。我们这个父母所生，四大和合的身体，是业力所生。来到这个世界的众生善业少，恶业多，所以我们全身都是恶业的习气。这个习气在佛学里面，尤其在密宗里面有专门的名词，叫业气，我们生命活著就是业力这股气。我们的业气是受恶法污染的业气。拿现代话来说，生理与心理是互相影响的，所以有时我们希望念头清净，不起杂乱妄想，但是我们做不到，因为我们受四大生理的影响，我们被业气緾住了。<p>所以说，病痛、烦恼、烦恼障、所知障这些障碍，固然是唯心的，但也会受四大业气的影响。四大业气太深，就清净不了，守戒也守不住，想得定也定不了，慧力也发不起来，因此须要修气脉修拙火，转化四大的业气。修气修脉修拙火是修色身、报身的最好方法。修色身首先要利用安那般那呼吸法修气。《达摩禅经》、天台宗止观的修法，乃至天台宗小止观六妙门的修法，都是从安那般那入手的。密宗密勒日巴所修的六种成就法等等，也是从安那般那入手的。其实，我们除了鼻子的呼吸以外，全身十万八千毛孔，乃至五脏六腑也都在呼吸，都在安那般那，但是一般人不了解这一点。<p>任何人，只要还活著，就自然会呼吸，但是一般凡夫不知道把心与呼吸配合为一。假使一个人能修到随时心气合一，在道家也叫心息相依，他的功夫就差不多了。修气可以修到念住气住，我们念头动的时候思想就会动，呼吸就会跟著动，安那般那出入息就会动。如果思想真正停住了（注意不是空了，空也是一种住的方法），出入息一定会停止，这就是修息了。我们生命活著的这股业气就是一股风力，这股风力力量很大。弥勒菩萨在《瑜伽师地论》里把这股风力分为大刀风、小刀风两种，我们身体有时会感觉痛，就是因为气在身体里面，像一把刀一样在割你。等气都顺了，念住了，呼吸住了，色身的风大就起了变化。关于安那般那呼吸法，我只是讲一个大原则，几句话就讲完了，你们不要以为修起来很简单。普通一般人修行，也许一辈子也修不到那个成就。如果懂了方法，真正的好好修行，也许三天就可以了。释迦牟尼佛在世的时候，有的弟子听佛一讲完这个法门，就到达了那个境界。气通了以后，就可以开始修脉了。我们身上的脉属于水大，血管是粗的脉，肌肉里面的纤维是细的脉。比如说北京那位卢医生讲，我们身体很多毛病都出在肌肉上，肌肉并不像大家想像的那样是一块一块的。相反的，肌肉是一束一束的肌肉纤维组成的，而每一条纤维就是一条细的脉管。当你气住脉通,把这些微细的脉管都打通了，你就可以得乐了。这种乐比男女交媾的快感要高很多，有了这种乐你就不要结婚了，所以佛经上讲，菩萨有内触妙乐。关于修气修脉的道理，道家用下面几句话作了总结：炼精化气，炼气化神，炼神还虚，然后粉碎虚空。<p>修气等于转变风大，把业力之风转成善行功德之风。修脉等于修水大，把业力所产生的水大变成清净光明，用唯识的语言来说，就是变成净色根的水大。打通气脉需要很多年，以及很多功德和苦行。气脉通了以后，拙火自然发动，可以得暖了，这是修火大的阶段。你们知道那些自然作物，那些稻子麦子，都需要在适当的温度下才能成长，我们的生命也一样，只有在这种温暖的情况下，才能真正健康成长，生生不已。五脏六腑也属于脉的范围，气脉通了，拙火发动了以后，五脏六腑就会转变了，这之后开始转变骨头。所以说，前面总结的那个道家的色身修行次序是对的，你们不要忽视了那个资料。拙火发动不一定都是从下面开始，真正的拙火发动是全身一起来的。我年轻的时候，有位学密宗的同学跟随我讲：“我拙火发动了，丹田都是烫的。”我告诉他：“你小心一点，赶快吃药，那不是拙火，是发炎。”有一种病叫骨蒸，感觉身体骨头都是发烫的，那是病态，不是拙火。真正拙火发动以后，身体都是松软的，你会忘记了身体的感觉，身体是一团清净光明，有内触妙乐。用双修也能达到这种境界，不过那是个危险的道路，跳不出来就墮落了。关于双修，密宗有个秘密的口诀：“精不降则乐不生。”一般凡夫做不到这一点，精一降就放射了，所以男女交媾消耗一次，生命就消耗一次。<p>精降乐生就是精化气了，密宗只有这句口诀，后面就没有了，现在我把我的密宗口诀告诉你：“气不定则光明不起”。气不凝聚，身体内的有相光明就不会显现，“神不凝聚，则杂念不会清净”。我把这些秘密都告诉你们了，你们不要出去乱传。神由宁静变成澄清，然后会很清明，就像晴朗的天空，万里无云万里天。<p>修气修脉到达拙火定的境界时，只是说明你转化了色蕴和受蕴，还不是成佛境界。修气修脉修拙火是修定的一种共法，除了学佛以个，阿修罗、天人、一切外道都可以达到那种境界。佛的不共法是至高无上的般若成就，但是一般修密宗的人都是在境界上转，那样就著相了，就变成外道法门了。所以说般若智慧很重要，如果认识错了，就离菩提越来越远。</p><p>气脉打通的现象</p><p>李居士：我有三个问题。精神病的人大脑一定有毛病，这是不是因为他的气升不上来？第二，道家讲打通任督二脉，与我们讲的修气修脉有什么关系呢？第三，气脉打通的外表现象是什么？自己怎么知道气脉打通了？</p><p>怀师：你说得对，精神有毛病的人是因为气上不来。至于道家讲的打通任督二脉，那不过是修气的初步而已，不是真正的打通气脉。气脉打通的人，内部外部都是有标准的有特征的，不过我不想告诉你们外部特征，否则有人就会拿这个尺码去量别人了。从内部来看，气脉打通的人会有内触妙乐，神凝气聚，随时都在空定之中，身体感觉如同虚空一样。讲到这里，有两个要点要提醒你们。修气修脉修拙火定的次序，并不一定是一步一步来的，并不是那么死板。根器好的，前生修行过的，善心善行功德多的，有智慧的人，可以很快就拙火发动，而且不一定按步骤来。有时拙火先动，气脉随后，有时脉先动，气与拙火随后，没有一定的步骤。但是，一般来讲是按我们前面讲<p>的次序来的。总之，修行没有善行功德智慧则一切免谈。这是第一点。<p>第二点，修气修脉修拙火属于功夫，不是佛的独有法门，阿修罗、天人、外道都可以做到那个境界。关于这一点，佛经和密宗的经典上都没有直接讲清楚。这种修法是证得菩提前修的一种方便，也是修行的一种功德。</p><p>拙火定 双修 火光定</p><p>拙火定是从化乐天到他化自在天的欲界天天人的修法，双修也是欲界天天人的修法。双修的原理是“以欲除欲”，或者用中国禅宗的话讲，叫作“以楔除楔”，就好像一个钉子钉在木头里取不出来，再拿一颗钉子钉进去，就可以把原来那个钉子打出来了欲乐定与拙火定有很密切的关系，众生都在欲界之中，性欲发动的时候就是拙火在动，但是一般人认识不到这一点，无法把那个性欲的冲动化掉。所以说道家讲的炼精化气是通过拙火化的，就是这个道理。<p>关于拙火，老子也曾提到。一个男婴儿睡足了，神足气满以后，生殖器就会翘起来，那个时候并没有欲，那就是拙火，婴儿长大就是靠这个拙火。等长大以后，一有欲望，配合心理的作用就会想要发泄，一旦发泄就消耗了，下墮了。双修欲乐定的修法，可以帮助你化精为气。我在这里只是讲个大原则。身体不健康，或者老年人，很难自己发动拙火，中国人叫那种状态是“吊儿郎当”。所谓吊儿就是那个东西，所谓郎当就是说那个东西不行了，只能在那儿摇铃了。对女人来说，没有拙火的时候人就干瘪了，胸部也松了。老年人如果还有感觉的话，说明身体还健康，是好事。婴儿可以很自然的就把精化掉，对大人来说就很难了。那种感觉来的时候，不要配合男女的心理欲念，把它清净空掉就可以化精为气了。不过要做到这一点很难，有一个秘诀，那就是用安那般那（出入息）法门。有些学佛的人很傲慢，看不起这些欲界天人的修法，声称三界天人是其护法，要跳出三界外不在五行中。你要知道，要想死后作个天人也不容易哦，你要做很多的善事，要经过修持才可以啊！<p>《楞严经》上介绍了二十五位菩萨的圆通法门，其中有一位菩萨，他原来的淫欲很重，通过修火观而得火光定。注意火光定与拙火定的修法不完全一样，但是拙火发动的现象与火光定的现象有相似之处。修火观真正得定的话也会发动拙火。这是给你们嘱咐一下，不过你们都还没到那个境界，不能真正明白这句话，等你们到菩萨境界的时候，就会懂了。<p>我们这里有同学在静坐的时候，曾经看到一位带著火焰会放光的菩萨，那位菩萨用的就是修拙火的方法。你看到的那个火并不是真正的火，那是智慧的火焰。得拙火定以后身体都空了，没有障碍，心中十分清明，有内触妙乐，是一种很好的定境。注意，拙火发动以后如果不继续修持，它还是会重新“休息”的。修气修脉修拙火是转变四大色身，是转变这个业气之身的最好最重要的一个修法，但是拙火定也不是很容易就可以达到的。修气从安那般那入手，饮食、男女欲念都要遵守一定的戒律。等到修脉的时候就可以变化气质，是由气到质的变化，这些都需要很多年的专修功夫。</p><p>道家气脉系统与密宗的区别</p><p>包卓立：为什么修任督二脉是修气而不是修脉呢？</p><p>怀师：道家讲的任督二脉和奇经八脉，是中国传统文化、传统医学里提出来的，与密宗的三脉七轮很不同。任督二脉和奇经八脉是生理的，是四大身体现有的现象，只要保养得好，它本来就是通的，不用做什么特别的功夫，如果不通的话身体就会生病了。<p>从宋元明清一直到现在，道家都很重视任督二脉。所谓打能任督二脉，就是把气吸到丹田，然后用意识的引导作用，从海底从肛门引上来进入督脉，上到头顶，然后再沿任脉回到丹田，这样叫大周天。这样引导呼吸通气脉，只能说是普通的气功，是很低层的。真正修持修道是更高一层的，要由定发慧，修到身心转变成佛的境界。<p>现在中国文化成了气功文化，甚至也不是真正的气功。在古代，学气功有四步，第一是学武功、运动、练拳。武功又分内外两种，有两个内涵。“内练一口气”，也就是训练用意识控制呼吸的出入，不是密宗的修气，也不是安那般那出入息；在外功方面是“外练筋骨皮”。<p>等武功练好以后，才是第二步练气功。气功原则上讲，是练“吐故”，把身体里的碳气排出去，和“纳新”——吸进亲鲜的氧气。等气功修好了，进一步修道功，也叫内功。修道功有点类似密宗的观想，要用意念的作用作导引。道功练好了，才到第四部修禅功（不是禅宗），修清净法门。这是你们问到任督二脉顺便讲到的。有人修大周天时怕气漏掉，忍屁不放，这样会把小便小肠的毒气都用意念引导到头上来，结果脸色发黑发紫。有人觉得自己满面红光，还自以为是有道之士，其实不是有糖尿病就是有心脏病或者血压高。所以道家宋元以后，修任脉、督脉奇经八脉，真正修成功的人很少，几乎没有，因为大家都太著相，太执著于后天的妄想。</p><p>包卓立：道家讲的炼精化气，炼气化神，炼神还虚，这是属于修气还是修脉？这些修法属于四加行的那一方面？拙火的修法是否相当于四加行的暖？双修是修气还是修脉？双修是不是修拙火的另一种？双修与四加行又有什么关系？</p><p>怀师：这些都是大问题，要详细研究需要几十万字，很严重。一般人，包括你们，对道家也外行，对佛家也不怎么内行，自己也没有真正好好做功夫，跟你们很难讲。现在不想直接回答你的这些问题，因为讲起来太复杂，扯开讲太长了，等将来有机会再讨论。总而言之，这些修法互相之间都有一点相似，但又不完全一样，炼精化气也好，炼气化神也好，这些修法的目的都是帮助你转变色蕴、受蕴，换句话说，都是帮助你转变生理，转变本身业气的方法。大家这个要点都没有抓住，回家以后也没有好好参究，光知道听，听完了也没有了。这叫作没有心得，没有回到自己身心做功夫上面去体会。这点很重要。<p>现在转回来给大家作总结论，归纳起来，修气修脉修拙火和双修都是欲界天天人的修法，不能说谁高谁低，差不多，修气修脉修拙火与四加行也有相关之处，不同的是正统佛学很重视心理状态，根据心理结使、习气的不同，修行所能达到的成就也会有所不同。好比说双修的法门，双修的目的不仅仅是为了发动拙火，更重要的是要利用它修气修脉最后发动拙火，然后配合心理化解男女性欲的根本习气与结使。总而言之，佛学统统要归结到心理方面的功夫。修气修脉修拙火可以帮助我们转化这个父母所生、业气所生、受痛苦烦恼的罪报之身。转化了以后，我们才能慢慢证到一个很正规的三摩地定境。换句话说，我们转个方向，不配合心理的状态来讲，如果修气修脉修拙火成功了，得了拙火定，身心解开了，可以说破除了我们世俗欲界的身见（没有身体了）而得了一种定境，这种定境也可以说包括了一、二、三、四禅定所能达到的定境。</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "第三章 如何修法报化三身",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>这次的课的缘起，主要是因为许多西方人迷信密宗，结果都走了岔路，包卓立为了帮助他们，提出来研究实验做功夫这个课题。那么佛法到底是什么呢？在中国文字中，佛法的代号很多，佛、如来、菩提、般若、法身等等，这些名词都代表了那个东西。用现代的观念来解释，佛就是宇宙众生一切生命的本体。菩提就是觉悟的意思，一切众生，只要觉悟了就是佛，因此真正的佛法不是宗教，没有宗教的形式，没有形象，也不是盲目的崇拜。<p>那个本体也叫如来，它没有来也没有去，它没有动也没有静。如果你明白了这个道理，这个智慧就叫般若，这个大的境界就叫涅槃。所以追求宇宙万物生命的根本，才是佛法的真义。拿宗教哲学来讲，这就是宇宙的第一因、初因、最基本的东西，你叫它神也好，阿拉也好，总之它就是那个东西。用西方哲学的语言，这属于本体论。这是你们首先要了解的。所以真正修行就是要找这个东西。按佛学名词来讲，成佛有三身：法身、报身、化身。法身就是体（本体），没有形相。报身是本体的显现，有形相。报身也叫报应身，有善报、恶报、不善不恶报。成佛得法身的人，为度众生而重新来到世间或者其他众生的世界，那个叫应化身。所谓应化，就是因有所“感”而有所“应”的意思。好比说你们有问题问我，我就讲了这个课，这也是应化。化身是一个变化的作用，所以中国人讲化有千百亿化身。修行就是要找回法身成佛，那才是大成就。佛法本来是破除一切迷信，破除一切偶像崇拜，一切究竟皆空。但是到了后期，佛法受到释迦牟尼以前就存在的，多神印度文化的影响而有了很大变化。印度人崇拜很多神，有很多密法和修持方法，龙树菩萨等，把这些各种各样的修法系统化，像灌香肠一样融于佛法之中，根据这个新的教法，毗卢遮那佛代表了法身佛，是本体，一切佛，包括释迦牟尼佛，包括阿弥陀佛，乃至一切众生一切万有，都是毗卢遮那佛的化身。它的报身是色界天的卢舍那佛。从这里产生了后来的密宗。<p>化身代表了变化，变化就是轮回，变化就是一定是无常，不是永恒。中国道家把这个宇宙万有叫作造化，也就是这个意思。比如我们人类，自卵子受精后，就根据父母的遗传基因不断生长变化，我们随时都在生长，我们随时也都在死亡。我们靠食物、水、空气、日光等生存，我们变化万物，万物也变化我们。<p>中国唐朝有一位年轻的道家神仙，名叫谭峭，他写了一本书，叫《化书》，用我国当时所了解的物理原理，讲解了宇宙的造化作用。他认为我们的宇宙就是一个大的化学锅炉，我们的生命不过是锅炉里的一分子，随时都在与其它分子互相变化。他说：抟空为块，见块而不见空；粉块为空，见空而不见块。把虚空捏拢来就变成块，等于说我们生命从虚空中来，但是一旦基因精虫卵子变成了人，我们见块（见人）而不见空了；不过，当我们把这块物质的东西打碎变成了虚空，我们就见空不见块了。这个宇宙一切万有都在变化之中，没有停留，没有永恒，一切无常。在变化的就是那个本体法身的功能，它是无相、无声的，看不见也摸不著。</p><p>从现象认识本体</p><p>既然如此，那么我们如何了解那个本体的功能呢？我们是通过本体功能变化所带来的有形有相的现象来认识本体，认识法身与化身的关系。就像我们刚才引用的谭峭的话，不管我们见的是空还是块，都是一个现象，这个现象有形有相，这个现象就是报身。<p>其实就是那么一个东西在三个层面上轮转。这是显教、密宗、道家的大原则，你们不要被一些宗教的外形迷惑了。就像人，变成白人的样子，看上去就是白人，变成黄皮肤，看上去就是东方人的样子，其实都是一个东西变的，不要因为样子不同你就不认识了。<p>话虽如此讲，但本体是无形无相的，无所在无所不在，你怎么能抓得住那个本体呢？你怎么去求证那个本体呢？所以释迦牟尼佛到最后传禅宗法门的时候没有讲话，只是拿著花微笑了一下就讲完了。这就是禅宗的教法，当时大家都不懂，只有佛的大弟子迦叶尊者懂了，佛也知道了，这就是禅宗有名的“拈花微笑”。换句话说，我们生命的本体、清净法身本来如此，从来没有动过。<p>禅宗祖师们走的路线是“直取无上菩提”。本体掌握以后，还要留个舍利子作什么呢？身体发光等等，这些也都不过是狗屁事情。轮回死亡都没有什么可怕了，死与生不过是昨天与今天，进房间与出房间一样普通，本体从来就没有动过，生命涅槃一切皆空。这是禅宗的路线。<p>龙树菩萨怎么讲本体呢？他写了一部《中观论》，里面讲了有名的中观“八不”，也叫中观正见：“不生不灭”，没有生过也没有死过；“不去不来”，“不断不常”，“不一不异”，不是一元论也不是多元论，也没有两样，其实仔细讲起来不止八个啦，比如说不善与不恶，不空也不有，等等。有了这个正见，什么功夫啦、妄想啦，一概放下就是了。 所以《大乘起信论》讲了两样东西：妄想与真如。没有妄想了就是那个东西，起了妄想了，本体就动了。就像水，起了波浪就不是水了，但是波浪是水做的，等波浪没有了，还是回归到水。成功了以后还会不会死呢？当然还是会死，会不会生呢？当然还是会生，不过生与死没有什么可怕的，所以悟道的人说：“涅槃生死等空花。”得到清净境界是唯心所造，混乱的境界及烦恼痛苦也是唯心所造，只要心放下了，就接近那个本体了。所以佛在《楞严经》中，开头就告诉阿难：“现前纵得九次第定，犹是法尘分别影事”，你即使现在得到了各种三昧，各种定境，甚至你可以放光动地，那也不过是心理思想功能的一种变态，不是真的。换句话说，假如说你修到可以在空中飞，你去美国还要不要买机票呢？恐怕还是要买，否则太累了，偶尔飞飞还可以。再比如你身体会放光，你恐怕还是需要装电灯。至于说临死时化为虹化，那种神通又有什么用？舍利子也不过是烂骨头，佛之所以留下舍利子，不过是为了向你示现一下，表示确实有这么回事，法身有这么个功能。<p>凡是你修成功的东西，就一定坏得了，不修就没有了。而佛的境界是不生不灭的，不修也不坏，这到底是什么呢？你找到这个东西才是大彻大悟。<p>法身本体是本来空、彻底空，空也是空。你们今天坐在这里听课，五十年以后你还在这里吗？这个房子还有吗？你说你修持好，神通高，释迦牟尼佛的大弟子，神通最大的目连尊者，比密勒日巴、甘波巴神通还高，那又怎么样呢？ 佛说：神通没有用啊！你会放光动地，但是你逃不过一个东西，那就是无常，最后一切还是会归于没有的。那些圣人，那些会飞的、放光动地的，而今何在啊？都会过去的。过去心不可得，现在心不可得，未来心不可得。法身本来清净，管它未来与过去！该生就生，该死就死，不生不死就不生不死，都不过是偶尔玩玩的，是水上的泡影。佛在《金刚经》上告诉你：一切有为法，如梦幻泡影，如露亦如电，应作如是观。<p>佛菩萨也不过是梦幻泡影，一个大魔术师而已啊！他的魔术比我们演得好一点，是法身境界。法身可没有三摩地哦！三摩地是法身的用和相，它本身没有三摩地，一切三昧都是唯心所造。</p><p>三身的修法</p><p>以我们以来讲，我们的心意识是最无常的，我们的思想情绪每一分每一秒都在变，永远不会停留。但是我们对每一个思想情绪都有知觉，这是法身变成报身所起的作用，是唯心的。所以禅宗祖师临济大师说：“赤肉团上有一位真人”，每个人都有一个没有位子的真人（人的那个根本的人）；“常从汝等面门出入”，每天在我们的眼睛、耳朵、鼻子、嘴巴里跑进跑出，找不到自已的本来。所以云门大师也说：“乾坤之内，宇宙之间，中有一宝，秘在形山”，我有一个宝贝，被这个身体限制住了。柏拉图也认识到这一点，所以他把世界分为两部分，一个是精神世界，一个是物质世界。法身本体功能起作用以后，一方面产生了我们的思想意识，一方面产生了我们的四大肉体。所以法身形成了宇宙万有，包括众生生命。法身有这样的功能，可见不是空的，认识到这一点以后，再回转来改变自己的身心，这是修报身化身的原理。那么修持的方法呢？戒、定、慧。几乎所有的宗教，所有的圣贤都是走的这条路。所谓戒就是从我们的心理、生理、思想与行为入手，去恶为善，达到最后无恶无善，毕竟清净的境界，接近法身。所谓定，就是把散乱无常的心宁静下来，归到清净本来的境界。戒定圆满后，你就可以自然见到万物的本体，回到本体的功能，与本体合一，慧是自然产生的。<p>宇宙生命的本体是空的，但可以生万有，空与有是同一个根源，是一体的两种功能。心与物也是同一根源，物能转心，心也能转物。现代人很可怜，精神思想都受物质的影响和左右，而修行就是用本体的功能去转物。现在我们每一个生命都是化身，因为我们各人的心理思想、行为、个性以及业力不同，所以我们的化身也不同，但是我们的根根统统是一样的。修行就是要转变我们的受苦受乐，以及受不苦不乐的受报之身，最后证得法身。为了让大家对三身了解得更清楚，给大家打个比喻。清净法身就好比是不起波浪的大海水，报身就好比是大海水所起的波浪，而波浪上面的水泡和泡沫就好比是化身。我们现在就是波浪里面的水点。修行就是回到本来清净的地方。药师佛修成佛了，所以有了东方药师佛，等将来弥勒菩萨修成佛了，就会有一个弥勒佛。修成后，菩萨们还会发愿回到这个世界上来度众生。</p><p>赵教授：我本来是海底的一颗水珠，不知道是谁把我推上来变成水花了。</p><p>怀师：（指著一位做过船员的同学）他在海底做了很久的海精，大概是他把你推上来的（众笑）。告诉你吧，是因缘聚会，是因缘所生。</p><p/><p>四禅八定</p><p>前面我们把法报化三身的修路线和原则，以及显教密宗等等，作了一个简略的归纳。要证得宇宙万有的自性，不能光在理论上转圈，要经过实际求证才可以。世界上各国宗教及圣贤，都有他们修持求证的方法。所以佛说众生烦恼八万四千，对治众生的八万四千烦恼，诸佛菩萨的方便法门（修证法门）也有八万四千，各有各的三昧（三摩地）。要想求证到本体成佛的境界，必须从身心两方面著手，佛法尤其偏重于心，要使心没有烦恼妄想，达到清净，得到定境。这里的定属于功夫，每一个定境，佛学中也叫三摩地，都有它的境界和现象，不同的境界有不同的现象。佛所讲的原则是共法，是其他外道以及一切宗教共通的（共有的），不是佛法里独有的方法。佛法特有的方法叫不共法，不共法就是菩提、涅槃。修定的共法，也就是修定的那个原则叫四禅八定，加上佛法小乘大阿罗汉的灭尽定，叫九次第定，不论是对大、小乘，还是显、密教，四禅八定都非常重要，东南亚流行的南传佛教尤其推崇这个。<p>关于四禅八定，我已经给大家讲了不知道多少遍了，大家好象都听了，但是没有真正作研究，没有真正听懂，都漏掉了，所以你们大家修的是漏尽通，都是漏尽的菩萨。其实佛法已有几千年了，现在全世界也有很多人研究佛，都知道这个名词，但都只是跟著佛的嘴巴，拿佛的口水讲一讲而已，几乎没有人真正做到，真正成就的。初禅就是“心一境性，离生喜乐”，心专一在一点上，思想境界都专一了，变成习惯了，然后有分离解脱之感而生出喜和乐。拿出教理来讲，“喜”是心理的境界，“乐”可以说是身体的境界，但是喜与乐几乎是不可分的，生理与心理是合一的，我们这里只是勉强作一个分类。<p>修行也叫“修为”，有修持有作为；也叫行持，有坚持不断的行为和动作的意思。达到初禅境界的人，已经超越了欲界，进入初级色界天人的境界了。配合这个功夫，如果同时转化和减轻了心理的结使和五见，可以进入小乘罗汉的境界了，可以说得到初果罗汉的果位了。这在佛学中叫“预流果”，预流果就是预备候补的意思。“结使”是佛学的专有名词，就是心理的贪嗔癡慢疑根本烦恼的习气（师手作结绳状）。结使的“结”就好比是我们用线结的一个结子，“使”是指有那么一个意念，指使我们的心理、个性和情绪，我们自己作不了主。这个“结”不仅仅是这一生打下来的，它多生多世都在那里，我们的理性不想这样作，但被它驱使去作，所以叫结使。我们每个人的个性都是结使来的。所谓五见就是邪见、身见、边见、见取见、戒禁取见。譬如我们修行学佛，把六根放清净，闭眼或者开眼盘腿打坐，我们说：“哎呀，他入定了！”那是开玩笑的，盘腿打坐勉勉强强可以说是“习定”，练习定的境界。盘腿打坐只是练习定的一个方便，一个方法而已，其实，各种宗教的祷告也都是打坐的一种形式。佛法打坐的形式主要是七支坐法，这里面有很深的道理，等以后再讨论。</p><p>什么是心一境性</p><p>心一境性有三个层次：身（身体），口（嘴巴），意（意识思想），三者都要进入专一境界。之所以用打坐这个方式，是因为我们的身体习惯于动，甚至坐在那里都要歪著坐，眼睛没有事地要东看西看，打坐至少是让你的生理有一个假装的静相。打坐的时候，嘴巴也休息了，不说话，意识也要专一于一个东西。有的方法要求嘴巴唸咒、唸佛号或者唸佛经，但那也是为了让你得止。这是修定的基本原则，所有的修法，不管是佛法还是外道，都要遵循这个路线。譬如说修白骨观，嘴巴不说话，身体站著、睡著、或者盘腿坐著，意识观想自己为一个白骨。这个法门也须要专心一致、心一境性哦！心专一了，不理会别的什么思想和感觉，把它变成一个习惯性的境界，这才叫白骨观，谁做到了？现譬如说呼吸法门，修安那般那，你要专一的听自己的呼吸，要把心理和风大的呼吸配合，把二者统一。心就是呼吸，呼吸就是心，其他杂念妄想丢开，把这种境界变成一个习惯，谁做到了？<p>譬如念佛，你用嘴巴或者在心里念一句南无阿弥陀佛，念至整个心里都是这个佛号，其他杂念不起。将这种专一念佛号的境界变成一种习惯，心一境性，谁又做到了？你们修行打坐还要问一问，你今天坐了几次啊？我坐了两次啊，三次啊。我就笑你们，坐了一次，你就好象对得起祖宗十八代了，好像打坐都是为了别人。<p>打坐的时候，你要静下来，思想都宁静了，心专一了，自然感觉到一个清净状态，并把这种境界变成一种习惯。所谓变成一种习惯，不是说只有打坐的时候才这样，要做到不管是走路也好，睡觉也好，做事也好，时时刻刻都在这个境界中，那才是心一境性。<p>我们再看密宗，他们是身口意三方面一起来，手里叫你拿著杵啊，摇著铃啊，嘴巴里叫你唸著咒语，心里面还要观想四臂观音、曼达拉等等。我们前面研究的移喜磋嘉、密勒日巴、甘波巴等都是用这种方法，不管你用什么方法，首先都必须要做到专一，心一境性，并把它变成一种习惯，行住坐卧都在那个境界上才可以。中国禅宗标榜的是直指人心明心见性，号称没有方法的方法。但到后来就慢慢演变为参话头了。所谓参话头就是提起一个怀疑的话头在心中研究。譬如说：“生从那里来？”“死了有没有？”“念佛的是谁？”“哪里来？哪里去？”等等，就叫做话头。话头也要参到心一境性，然后才能谈得上开悟不开悟，这也是初禅的第一步。<p>再譬如说我们一般人学静坐，或者天主教、基督教、回教的祷告，也都是要心一境性。譬如有人不用任何方法，只是闭目养神，思想来去也不管，一切清清楚楚，这个叫空心静坐。至于它的价值与好坏，它的般若智慧与功力，我们暂且不谈，这也属于一种定，也要心一境性。甚至像哲学家、科学家，他们用思想研究一个问题，会专心到忘我的地步，心中除了他们的问题外，没有任何别的杂念。道家有个词，形容得很好，叫“精思入神”，精密的思想已经到了进入神话中那个神的境界，这也是一种定了。所以管子说：“思之，思之，鬼神通之”，用很专一的思想来思维，到最后突然灵感发了，什么都知道了，这也是一种境界哦，接近初禅了！所以讲，有成就的人都有他定的修养的一面，这样给你们讲你们就可以了解了。世界上所有的宗教和哲学，都要达到心一境性这个状态，并把它变成习惯，忘记了时间和空间，永远在那个境界。但是世界上谁做到了？有些人想钱、名利、男女，到了发疯的境界，那也是专一啊，但那不是道，那是病态，他是走岔了路，我们叫他神经病。中国武侠小说有个名词，叫走火入魔，那也是专一啊。所以佛说四禅八定是共法，是佛道以及外道共同的一个法和原理，但并不是佛法。我们用现代化的逻辑的办法，把显教、密宗给你们分别讲清楚了，也告诉了你们心一境性的道理。现在回过头来，看一下前面讲的那些祖师们，他们证道非达到心一境性的境界不可。你们大家也在学静坐，你们大部分不过是坐在那里闭眼休息一下，等于睡眠，不是静坐修道，大家要反省一下自己了。<p>我们前面介绍的那些男女祖师们，乃至中国一般修禅的，都是真正下过功夫后达到心一境性的境界的。不经过这样的修证功夫而想要证悟成佛，那是绝对不可能的！没有经过这样的功夫，你一生所学都是枉然，没有用。你可能会说，有些人智慧很高，像六祖啊，中国其他的禅宗大祖师啊，包括像有些密宗的大祖师们，他们似乎没有经过这些经历就悟道了，那是因为他们多生累世所积累的戒定慧根基深厚了，在道理上一下就悟道了。注意哦！他们那个空是般若的空，不是空无边处定的那个空；他们的心一境性是大乘的心一境性，比一般的心一境性要高很多，这是我们对心一境性的研究分析。所以我经常讲，一般人都不懂，把显教、密宗跟普通的佛的教理都分开了，其实，显教就是密宗，密宗就是显教，你懂了学理就明白这一点了。<p>中国有四个字“好学深思”，要深入研究。叫你证得空性，不是叫你不用大脑。修行证道如果不用头脑，会越来越笨，来生变猪，猪也变不上，都变昆虫了。这是很严重的事，不要搞错了，往畜牲道去修了。正确的修持方法再加上时间，当你达到心一境性的境界时，你的身心，包括气脉，当然要起变化。要达到那种境界，也许要几十年，也许一百年，也许三、五天，这就要看各人的根器，看你前生所种的种子了。像释迦牟尼佛在世的时候，很多弟子听他说法后，当下就得阿罗汉果。唯识有两句话：“种子生现行，现行熏种子”，多生多世修行的种子，生出你现在的情形，你身心的变化也许很快，也许很慢，不是呆定的。身心的变化也许伴随著痛苦，也许伴随著快乐，身体有时候痛苦，有时候是舒服，总之会有各种反复的变化。前面讲的西藏那些修行人身心变化的境界，很令人响往，但也令人望而却步，“哎呀，我怎么受得了那种苦行，我没有那么多功德啊！”</p><p>初禅——离生喜乐<p>初禅是“心一境性、离生喜乐”，心一境性我们刚讲过了，那么什么叫“离生喜乐”呢？“离”就是对人世间的厌离心，对人世间有脱离之感，这是初步。然后，慢慢气脉打开了，你可以得喜乐了。这个喜不是普能发了财，或者讨了一个好老婆，或者嫁了一个好男人那种喜，是法喜充满，无比的快乐。到了这个程度，你有分离之感，身心可以分离了。如果身体衰老了，不想留在人世间了，也可以马上走，如果再想来，找一个身体投胎就是了。佛把什么都告诉你了，可是一般研究佛学的人，甚至研究唯识学的人，只知道在嘴巴上讲讲四禅八定，而不经过各种各样的修持，所以永远不能了解佛法的深意。佛法越来越衰没了，也就是这个原因。我们普通人懂了一点佛法的道理，或者有一点体会，也会很高兴快乐。但这只是一种心理上偶然的反应，也是很好的，对现有的生命也会有帮助。但要想修证做功夫，这个是不算数的。你看那些有成就的祖师们，都曾经离开尘世去专修，也许即生成就，也许两生，也许很多生，不一定的。如果走大乘的路线，修菩萨道，一方面有家庭，有事业，一方面还要修持，那需要大智慧，大功德，大气派。修菩萨道要一边入世做事情，一边随时有慈悲心，在大愿，利世利他。这个比出世专修还要难，也许成就比小乘还要快还要大。<p>要达到初禅境界就要修持，或者叫行持，在大乘叫行愿。行愿所培养的功德必然会引发身心的变化。在密宗他们是用修气修脉修拙火的方法。如果自己的拙火发动不起来，也可以用修火观的方法。至于说哪种方法更适合你，没有一个呆定的说法。但有一点，不管你是用什么方法，要想有成就都需要修持自身的功德，这个功德包括自己心理行为的转化。功德到了的人，不修气脉，拙火也会发动起来，四加行里面的“煖、顶、忍、世第一法”的境界，也都会来。有些人初步有一点功夫，他的傲慢心就来了，而且脾气瞋恨心就越来越大，越来越讨厌别人，看不起别人，这样就走向外道魔道了。所以说修定是共法，就是这个道理。孟子说：“人之患、好为人师”，不是说不可以为人师，传道是应该的，但是要做到不受人家恭维，不被这些事影响了自己的静修，所以这句话里戒定慧包含了。如果你有功夫以后，更能反省自己，知道自己得到的一切，不过是众生本有的自性功能，因而发起更多的慈悲心、布施心，那就是佛法了。<p>同样的道理，修密宗的人寻找上师，要对上师很严格的考察，如果一个人吝啬没有慈悲心，就不是一个好的上师。换句话说，上师对弟子也要作严格的考察，看这个人有没有资格作学生。四禅八定加上佛法小乘境界，以及大阿罗汉的灭尽定，都不是究竟，这不过都是法尘影事而已。</p><p>欲界的喜与乐</p><p>现在我们讨论的是真正修证做功夫的事，不是普通的学理，所以需要把显教密宗融会贯通起来研究。如果拉开来讲，这个课题涉及到人体生命科学的很多方面。但简单的归纳起来讲，“喜”是心理方面的境界和现象，“乐”是身体生理方面的反应。喜乐的境界有大有小，我们普通讲的喜乐都是欲界的事。譬如饮食，看到好的菜，心里很高兴，就是喜，吃得很舒服就是乐。但吃饱了以后又生病，不舒服。如果拿男女作比喻就更清楚了，两个人情啊爱啊抱在一起，有了性欲就性交做爱，就会高兴、有快感，喜乐都包含在里面了。男女性高潮的快感只有一刹那的时间，喜乐都过去以后，两人身心都空空洞洞的，严重的甚至有虚脱的情况，因为这是普通的喜乐。 一切众生都有一个共同的目标，那就是离苦得乐，包括修道成佛也是这个目标。譬如欲界天人也和我们一样，仍有男女饮食的欲望，他们交合还是五欲（色声香味触）之乐。但是与我们人相比，天人的修养层次高一点，他们的福报大一点，喜乐也比我们高一点强一点。欲界天分六层，人道以上的有四天王天、三十三天（忉利天），以及再上面的焰摩天、兜率天、化乐天，和他化自在天。以性这个问题来讲，四大天王和三十三天的喜乐比我们高了，但是和我们人一样，还是从“笑视交抱触”中得喜乐。眼睛要看漂亮的，耳朵要听好听的，像“我爱你”啊、“达令”啊之类的，还要闻气味对不对，还要接吻呀等等，总之身心都要接触在一起。天人境界比我们高，福报比我们大，因为他们的生理和心理结构与我们不同，至于说有没有悟道，那完全是另一回事。在三十三天以上的欲界天，就不一定是笑视交抱触了。焰摩天的天人是“执手为乐”，手一握住就达到喜乐的最高境界了。再高一点的天人，连手、身体都不用接触了，笑一笑就达到那个最高境界了。再高一点到化乐天和他化自在天，眼睛一看，甚至连看都不需要看了，意识一沟通就可以了。所以说天人境界比我们高，不像我们，要身心合一才能达到很短暂的一点点喜乐。我们人类的性交需要精气神合一，比我们高一点的天人境界是精交，再高一点的是气交和神交。所以说密宗的欲乐定的修法是欲界天天人的修法，不是佛法中最高最了不起的，但也可以变成最高最了不起的，那就要看你自己的智慧了。<p>这是为了要让你们了解禅定之乐而对一般的喜乐作的一个补充，要详细讨论的话，涉及到生理学医学的知识，我们就省略了。<p><p>戴教授：到达初禅境界还有身见吗？</p><p>怀师：到初禅还是有身见。你们要注意，我们现在研究的禅定境界都在讲功夫这一块，而有否身见是思想境界的问题。譬如我们很生气，要跟人家打架，那时你可能忘了自己，暂时忘了身见。五见都属于慧的见解范围，不是功夫的境界，这个逻辑上的差别你们要搞清楚。再譬如你初步得喜乐的时候，都还在身心两个方面，偶然也可以忘记身见。如果你能通过慧的见解真正忘了身见，你的初禅的禅定就会更大一点了。<p>李居士：色蕴、受蕴解脱了是不是就可以去掉身见了？</p><p>怀师：不一定，身见的根根在心意识的第七识上面。等于说你可能没有性行为了，但那并不代表你淫根已经断了，因为你心理可能还有性欲。</p><p>轻安的境界的喜乐</p><p>不同天人境界的喜乐，其程度也不同。在佛学中我们只是用喜乐二字来说明那种不同的感受，其实这两个字并不能准确的表达那个境界，所以你们不要执著于这两个字。“轻安”也可以说是一种喜乐，得到轻安境界的人，已经过了拙火发动的境界，但用轻安来描述那种境界，也不是很准确。初禅的喜乐比天人喜乐还要高，其实清净的定境本身就是一种喜乐，而欲界的喜乐有点执著于其中的意思。打坐的喜乐与性交所发出的喜乐不同，打坐时，气脉打通的地方就会有喜乐的感觉。<p><p>包卓立：轻安的境界有清凉的感觉，可是拙火发动不是暖的现象吗？</p><p>怀师：暖是轻安的前奏，清凉也是轻安的前奏。宗喀巴大师在《菩提道次第论》里说，你用功打坐时，头顶有清凉之感，这个算轻安了。不过由头顶发起的轻安有时会退掉的，如果清凉从脚底或者海底发起，一直通到上面就不会退掉了。这种都还只能算是小轻安，大轻安就不得了了，身体的气脉拙火都过了，整个身体是轻灵的。所以说轻安有大小程度的不同，真到了广大的轻安的境界是可以得神通的，身体可以飞了。一个月前，一个南普陀的和尚来看我，他在东南亚学了安那般那呼吸法门，和四禅的修行秘诀。据他老师说，身体某部位有觉受是初禅，某部位是二禅，某部位是三禅，某部位是四禅。他说这是南传佛法。<p>我听了笑一笑，不好讲他对不对，其实也不能讲对不对，真修安那般那呼吸法门，开始是鼻子呼吸，慢慢功夫深了以后就不用鼻子呼吸了，变成零呼吸了，到达那个程度，你身心的感受也不同了。等呼吸到达住的时候，就更不同了，再达到歇，就又不同了。所以说不能说他不对，但如果说这里是初禅，那里是二禅，那里是三禅，那里就是四禅，那就不对了。这里为大家总结一下初禅境界。要达到初禅喜乐的境界，需要经过很多修持和苦行，但是最重要的还是靠智慧，靠自己行为功德的修持，靠转变贪瞋癡慢疑的心理结使。借用中国古代大禅师的一句话，“一片白云横谷口，几多归鸟夜迷巢”，理路不通，道理不通，就会像迷巢的飞鸟一样，找不到自己的窝了。有时境界会突然出现，可是要保住那个境界却非常难。</p><p>二禅 三禅 四禅</p><p>二禅是“定生喜乐”。注意哦，虽然不谈心一境性了，实际上还是心一境性哦。心一境性的境界很多，你可以定在空无边处定，或者识无边处定等等。心一境性了，自然就可以达到离生喜乐的境界，二禅当然还在心一境性的境界上，心本来就是清明的，所以进入二禅后就不提心一境性了，不过这个新的层次和境界又不同了。四禅八定的这个翻译法历代都没有动过，大家都没有异议，只有玄奘法师把“禅”翻译成“静虑”，把四禅译成初静虑，第二静虑，第三静虑和第四静虑。不过不管是静虑也好，定也好，都是从儒家《大学》的“知止而后有定，定而后能静，静而后能安，安而后能虑”来的。这是学理方面，我们不再多讲。定生喜乐，注意这几个字，二禅这个“定”，有定的境界，比初禅大了，所生出来的喜乐也比初禅更进一步了。这个二禅的喜乐连佛菩萨，连那些祖师们也只能讲到这里，没有更好的形容词来解释翻译了。我们只能勉强地说，二禅的喜乐境界比初禅更清净、更伟大。有同学曾经对我说：“我得了这个境界以后，好像过几天就没有了。”我说：“其实你都在那个境界里啊！只是你自己不了解而已。”这好像一个穷人忽然挖到宝，高兴得三天三夜都睡不著觉。慢慢钱越来越多了，他就不会睡不著觉了，这时的烦恼是怕钱少了才睡不著觉。<p>喜乐、轻安境界得到了，大家自己不知道。所以我经常用古人的一个比喻，一个人挖井，第一天、第二天……第一个礼拜，嚇，成绩好得很，挖出好多泥巴。等你挖出一丈、两丈深的时候，你就惨了，挖了好几天才一筐泥，其实这个成绩同你刚开始是一样的，而且更深、更细、更难，只是你自己没有感觉而已。喜乐的境界跟这个是一样的道理。所以二禅定生喜乐比初禅更定，喜乐的境界更扩大、更严重了。二禅已是色界天天人的境界，包括三个层次：少光天、无量光天、极净光天，都在光中。讲到这里，要提醒大家研究三界天人表。<p>前面讨论的修行人做功夫的报告，尤其是修密宗的人的报告，都是与离生喜乐和定生喜乐的境界有关，禅定的喜乐境界和禅定本身的境界，包括四禅八定以及第九次第定，都是意识状态所造成的。意识与五蕴配合，或者说与色阴、受阴、行阴配合，就会发生这种境相，这个原则首先要把握住。二禅的境界是天人境界，是意识状态和受阴配合所产生的。三禅是离喜妙乐，包括少净天、无量净天、和遍净天的境界。到三禅，已经超过了喜的境界，只有乐的境界。这种乐与欲界天的饮食男女之乐不同。四禅是“舍念清净”，舍掉了烦恼、假想、妄念，这个已经超过了那些喜乐的境界。换句话说，有喜有乐还是受阴的感受，还是念的作用。有一点特别值得注意，如果拿佛学唯心的道理来看，色受想行识都是一念，到了四禅“舍念清净”的境界，这些喜乐感受的念都没有了，完全是清净的境界。注意，清净并不是空哦！这种清净境界已到了色界天的最高层。配合天人境界共有九层，分别是福生天、福爱天、广果天、无想天、无烦天、无热天、善见天、善现天、色究竟天（也称有顶天），不同天的三摩地境界也不同，但都属于舍念清净。普通人以为心境清净了，就是四禅的舍念清净境界，这是完全错误的。须要说明的一点，舍念清净不是空定，不是小乘的空定，更不是般若空的境界。另外，舍念清净还是意识的境界，还没有离开意识的作用。所以说三界都没有跳出意识的范围，你看，意识有这么大。如果意识修持到能舍一切杂念妄想而得清净，那也是很大的功德哦，但还不是佛法。所以说四禅八定是共法，是佛法与一切外道等的共法，道理也就在这里。其实，做到舍念清净已经很难了，一切神能、一切生命的特异功能，都还是从这些禅定出来的。普通人，乃至学佛的人，有几个真修到了这个境界呢？四禅都离不开意识状态，这一点要首先认识。这是四禅，下面我们讨论四定。</p><p>空无边处定</p><p>佛学的很多境界都有很微细的差别，比方佛学讲到，唯识的无心位（这里的心是指意识心）分五种：睡眠、闷绝、无想定、无想天、和灭尽定。无想定是三摩地的境界，无想天是无想定所得的天人果位。再比方密宗红教讲的“大幻化纲境界”，里面提到五、六种中阴境界。人死后到投胎之前的这个阶段是一个中阴，是生死的中阴；从醒到睡眠是另一个中阴；呼吸的出入气之间是一个中阴等等。所以中阴境界也有很多微细的差别。我们研究打坐、学佛、做功夫，就要学习认识自己定的境界。四禅八定里的四定，就是四种三摩地的境界，属于三界天里的无色界，已经超越了色界。无色界，顾名思义，已经超越了物理（色界）、物质（欲界）世界，完全是精神世界的现象。 四禅八定里面的四定，就是空无边处定（也叫色无边处定）、识无边处定、无所有处定、和非想非非想处定。需要了解的一点是，从四禅到四种定，不一定是像楼梯一样，非要一层一层上不可。你可以修空无边处定进入初禅，再由初禅到四禅，或由初禅到三禅、到二禅或任何一个境界，都没有一定的。不过，四种禅定的境界，在功夫修行的层次上不同，有非常微细的差别。那么，空无边处定的“空”是什么呢？给大家作个比方，一个人学佛、打坐用功，有时候会说：“哎呀，我今天念经念咒，都不知道自己的身体了，好像进入了空的境界。”这只是偶然之间忘了色阴和受阴而已，还不是这里讲的空的境界。再比如，有人研究念头之间显现的那个阶段，会说：“刚才好像没有我了”，实际上，一瞬间那个没有我的境界也是受阴，仍然是意识范围之内。所谓空无边处定，确是一种空，硬是做到有个空的境界，当然离不开意识的指导。比方我们坐飞机，当飞到三万公尺以上时，看到天空的那个感受。假想没有坐飞机，而是你就在那个高空，这个空的境界，比较我们坐在这个房间里空的境界，是完全不同的！这是一个物理的空的境界。空的力量很大，这个原理用于武器研究，就能造出毀灭性很大的原子弹。但是空也有生长万物的功能，正如佛早就说过的，“空”包含了地水火风空觉识等七种东西。过去佛学讲到这里，大家都不从物理科学的角度研究，只是一带而过了。<p>如果你真想修这个空无边处定，打坐时，两腿一盘，什么都不管，将自己身体丢掉，进入地球外面太空的那个空的境界就可以了。这时你的意识当然还是清楚的。所以佛经翻译时，也会把空无边处定译成色无边处定。这个境界里有光明，可是灰濛濛的，也可以有各种顔色，不一定是亮光，但有个光明的境界。等于我们在高空中看到的那个虚空，虚空也是个东西，但不能叫它物理的或物质的。这就是空无边处定的道理。</p><p>识无边处定</p><p>识无边处定,这个名词在佛经上只是提了一下,不管是显教还是密宗,均没有作详细的解释,好像忽略了,但是它很重要。识无边处定是意识境界，连带包括第七识及阿赖耶识的作用。这个识不是我们平常所指的：思想能感觉，耳朵能听，嘴巴能说，眼睛能看等等意识相互配合的作用。识无边处定的这个“识”，是精神境界的范围，不是“空”的了。换句话说，空无边处定是个“空”的境界，有个空，是虚空的境界；而识无边处定是个“有”的境界。我们不用去观，不用去观想一个什么佛像、空之类，而只是把我们的精神意识合于物质的作用，把它放到无量无边的伟大境界里头，这个就是识无边处定。换句话说，我们的身心都没起作用，可是有个知性，知道一切，在虚空中有个虚空的知觉，都知道。这个是识无边处定。宋朝理学家程明道（颢）有两句诗讲：“道通天地有形外，思入风云变态中。”这位理学家也是讲究静坐的，也有其伟大的境界。这个境界接近识无边处定，也可以说就是识无边处定的境界，有思，但不是不是想。这是“有”的这一面，不落在空无边处定的“空”的那一面。这个境界没有喜乐，什么气脉也都不在话下了。</p><p>无所有处定<p>无所有处定，中国古代的大善知识们，花了很大的功夫才找到这个翻译。从表面意思来看，“无所有”不就是空吗？不是已经有一个空无边处定了吗？无所有，什么都没有了，对不对？这个无所有同“无想定”又有什么差别呢？无所有不是什么思想都没有吗？由此我们想起明末清初的大哲学家顾亭林的一个比喻。顾亭林也曾研究过佛学，他的理解是佛学没什么好研究的，它就是两个桶，一个桶空的，一个桶有水，佛学就是把那桶水倒过来倒过去，倒来倒去还是那么一桶水。乍一听好像满有道理，智慧高的人听完只是一笑，你说倒来倒去还是一桶水，但到底还是两个桶啊，一个是空一个是有，可见你不懂，还是个笨桶。<p>要修无想定，硬是需要用意识修练，把它变成无想、没有思想，等于是把思想包住了、压住了。修到无想还是外道，不过修到无想也不容易，无想定是色界天高层的天人境界呢。无所有处定比无想定还要高一点，是无色界的境界。无所有处定等于《庄子》第一篇&lt;逍遥遊&gt;里描写的一个境界，其中讲到，北冥有条鱼化为鸟，从北极飞到南极。《庄子》这里是比喻气脉，讲的是物理的变化，大家以为他只是比喻而已，其实，他是比喻又不是比喻。&lt;逍遥遊&gt;的最后两句是：“无何有之乡，广漠之野”什么都没有了。用佛法的四禅八定来讲，这个讲法就是无想的，无所有处定了。《庄子》这句话很妙，很有学问。“无何有之乡，广漠之野”，无边的虚空，无边际的空，这个地方什么都没有，初看起来和空无边处定差不多，其实很不同。无所有处定是意识自然达到的境界。用言语只能表达到这里了，需要大智慧才能了解。无想定是把思想排斥掉而达到无想，人的身心如木石，但有知性，知道自己这个时候是无想。在这个无想定的境界，这个知也是无想。得到无所有处定的境界也是很伟大、很了不起的。这都是三界天人的境界，当然已经超过物理现象的色界了。<p>这里我们顺便补充一个文学典故。一个人修到“无何有之乡”的境界，连大沙漠都没有了，当然还有自己，那个情景一定如唐朝大诗人陈子昂的一首诗所写的：前不见古人，后不见来者，<p>念天地之悠悠，独怆然而涕下。<p>中文字没有那么多的词汇，所以只能用无想定、无所有处定等等，来描述这些不同的境界。释迦牟尼佛十九岁出家，第一个学的就是无想定，以他的聪明和能力，修了三年才修到。然后他说这个不是道，就抛弃了。你说你不学这个，你学得到吗？要达到这个境界不容易啊，这个境界的果报是无想天，那是无色界的高层呢！</p><p>非想非非想处定</p><p>再来就是“非想非非想处定”。非想，不是一般的思想，没有了思想，不知道了。非非想，并不是不知道。<p>这个定境是什么？与识无边处定有什么差别呢？非想就是说不用很强烈的分别意识思想，但是它有知，有知性、知觉。非非想，这个没有空，也不谈有，是这么一个境界。严格讲，这个同独影境差不多。比如当我们睡下，将睡非睡的时候，或者走路时，一件事情忘记了，脑子里忽然显现出另外一个思想，不是用心来的，这个就是独影显现出来的意识境界，跟非想非非想有类同之处。再好比说,你很疲劳了，回家就靠在沙发上，说你没有睡，其实你睡著了；说你睡著了，你又知道，叫你时你还会回答：“我没有睡呀！”这也类似非想非非想这个境界。再举例说，假设你观想一个菩萨或一个佛，修到身心皆忘，但又不是很清明的时候，没有用心，又好像知道这么一个境界。所以观想时也会产生非想非非想的境界。我们有时候修行作观想，作曼陀罗，认为到达了观想成就，其实是落入这个境界里，自己还搞不清楚。实际上观想与识无边处定是相通的。释迦牟尼佛十九岁出家，先修了三年的无想定，修成后，讲了四个字：“知非即舍”，知道这个不是道，只是一种功夫，用心理作成的功夫，它修得成就坏得了。因此他走了，找到更高明的老师，修这个非想非非想处定，又花了三年。修成后又是四个字：“知非即舍”，这个也不是道，还是心理造成的一种状况，没有离开意识思想。因此他又离开，去修其它的外道。接著他修了六年苦行，二、三十岁的人饿得像七、八十岁的老头子，但苦行仍不是道。直到最后，抛掉所有这一切，证得菩提，那完全是另外一回事了，我们这里暂时不讲了。<p>现在我们研究这个四禅八定的境界，初禅、二禅、甚至三禅，都还未离开生理的色阴和受范围，离不开气脉的感觉状态。到了四禅定的境界，已经不谈气脉了，气脉已经通了。但是，达到这个境界是否就是成佛得道了？还不是。所以佛在《楞严经》上告诉阿难：“现前纵得九次第定，犹是法尘分别影事。”意思是说，现在，你就是修到九次第定，也还不过是意识的境界。“法尘”，与第六意识相对的叫法，包括一切思维、知觉、和感觉；尘，外面的灰尘，还不是本身。“分别影事”，心意识的分别所产生的，由思想功能变化而来的，还只是道的影子，不是道的体。释迦牟尼佛当时对阿难讲：你不追寻生命功能的本体，只在这些功夫境界上转，距离道还呢！但是从另一个方面讲，一切贤圣、阿罗汉，一切菩萨，他们的功夫都到达一定的境界了。当然有些禅宗祖师们，不走功夫的路线，直取无上菩提也是有的，这里不谈这个路线。但到底他们只是了解了最好的，最清净、美丽的，真善美的一面。相反的，不是真善美的那一面你还没有去见，没有走完全程。要走过全程，必须要渐修四禅八定，任何一程都要走到，直到菩提，这才是了不起的事。</p><p>阿罗汉的灭尽定</p><p>我们把四禅八定给大家作了一个简单的介绍,下面为大家讲解一下小乘阿罗汉境界的灭尽定。<p>罗汉进入涅槃时，会跳到虚空现十八变给你看，完了以后，自己用三昧真火，在空中引起定中的火大，把自己化掉，不用汽油或瓦斯。罗汉成就最后走的时候有四句话：我生已尽，梵行已立；所作已办，不受后有。 我所有的生命，到这一生已达到尽头，该做的事已经做了，人世间欠的帐该还的已经还了，不再回来了，证得灭尽定，一切智慧都不用了。灭尽定是证得涅槃境界的一种现象，而涅槃是道体。以大乘菩萨、佛的境界来讲，罗汉境界是“有余涅槃”，并非佛菩萨境界的无余涅槃。所以，罗汉进入灭尽定涅槃境界，八万四千劫后非出定不可，出来以后重新修行，回心向大，走大乘路线，最后成佛，得无余涅槃。得了灭尽定还没有跳出三界外，以禅宗来讲，得了灭尽定是“担板汉”，走到了“空”的一边，还不能起妙有。换句话说，这个境界只能让你避开八万四千劫，最后出定，重新走大乘路线才究竟。得到灭尽定的人，气脉当然已经通了，所以他可以调兵遣将一样，随意调动自己的四大，要想调动火大当然可以做到。罗汉分两种，一种兼修神通，一种不兼修神通，所以罗汉不一定有神通。由此再回转来看那些密宗祖师们，大部分都是走四禅八定小乘的路线，最后，充其量不住灭尽定的涅槃，往生他方佛菩萨的国度去了。对于这个苦难的娑婆世界，都有点逃避的味道，因此都被禅宗祖师们列入半吊子的范围里了。<p>四禅八定与四加行<p>四禅八定是共法，既然是共法，你要学佛求证形而上道这个本体，自然也离不开这个共法，你不要认为是共法就看不起。不管是显教还是密宗，都是从我们的根本老师释迦牟尼佛那儿来的。释迦牟尼佛本身的修证，就是从共法开始的，这是第一点要了解的。释迦牟尼佛以后的那些密宗大祖师们，不管是红教、白教、黄教、还是花教，都曾经过严格的禅定修持。他们记录下来的那些境界，都属于禅定的范围，都离不开气脉的变化。修气脉修拙火充其量都是在初禅、二禅，最高不过三禅的境界，但这样说并不代表做到这点很容易。这是第二点总结。前面讲到很多人的入定经验，像有名的憨山大师山上入家和在弟子家入定，慧持法师入定好几百年，以及现代的广钦老和尚入定的经验。他们入定后身心皆忘，甚至不知道入定有多少天，都是靠引磬才出定的。什么都不知道的定境也有很多差别，一种是无想定，一种是无所有处定，一种是昏沉，不包括空无边处定。空无边处定还有空的境界。其实昏沉不是定，把它算作定境的一种是我讲话的方便。那么这些案例都是什么定呢？是无想定还是无所有处定？还是昏沉定？现在一般人学佛打坐第一个困扰是思想停不了，好像每个人都想入定，其实你问他入定是什么意思，他也不清楚。是不是什么都不知道叫作定呢？难道佛法的目标就是什么都不知道吗？如果这就是佛法，那我还何必学呢？吃安眠药就可以了，再不然学成木头石头一样，那不是比我们讲的那些定的境界还厉害吗？山门外的那对狮子在那里一千多年了，那是成佛得道了吗？所以“定”是一个大问题。<p>我提出这些问题是叫你们参究，要大家懂得教理。光知道呆板的打坐而不通教理，就是外道，就是魔道。所谓外道就是“心外求法”，到本心以外去找佛法。所谓魔道就是被迷糊住了，被魔闷住了，自己不清楚自己在做什么。再其次，像憨山大师、广钦和尚那样证到什么都不知道，一入定就是好多天也很难啊！他们的气脉总应该有点通了，否则，一个身体有障碍不舒服的人，别说入定好几天，就是让他连睡三、四十个种头他也做不到。打坐不一定是“定”，打坐是练习进入一种定的姿势。“定”的境界在佛法中也叫三摩地，旧译中简称三昧。三摩地有很多种，所以佛讲有“百千三昧”。众生有八万四千烦恼，可以进入对应某一种烦恼的三摩地。因为烦恼不是有意修持来的，所以烦恼不叫三摩地，只有修持的成果才叫三摩地。比如作水观的人，把身心都融化为水的现象现前，那是水观的三摩地；作火观的人整个身心进入很深的定境，别人只能看见一团火光，火光里面还有身体的形象，这是火观的三摩地。<p>佛法真正的修定修止观之路，与四禅八定有什么关系呢？每一个禅定过程都有四加行的暖顶忍世第一法，因此弥勒菩萨特别讲了一部《现观庄严论》，讲解四加行的重要。四禅八定里面的四个定境，用现代的话来说，属于精神状态，跟生理有关联但又不同。实际上四禅八定都没有离开第六意识的范围。笼统来讲，可以说修气脉、得初禅、二禅、三禅比较偏重于生理的色阴、受阴区域。四定修好了，你的气脉一定也有一点通了，否则你无法得定。四加行是这些定的前奏，没有四加行的基础你无法得定。其实，暖顶忍世第一法，也在那个定境里面，就好像我们今天晚上喝的汤里面放了酱油、盐、白糖、辣椒，你觉得很好喝，你也不会去管里面是酱油还是盐，或者别的什么东西，其实那个汤包括了所有这些成分。<p>四禅与四定没有什么固定的搭配，四定其实也是一个方法，可用在四禅的任何一禅里面。<p>憨山大师在五台山入定，出定后好像忘记了一切，虚云老和尚在终南山入定几十天，也有类似的情况。根据我个人的经验，有时候出定后连人都不认识了，你们没有真实修持经验，不懂。但是严格来讲，这种定不是正定，属于唯识讲的昏沉的无心，等于一种睡眠和闷绝。憨山大师是明朝的大师，我不好公开讲，你们文字上最好不要记载，记载了很多人要骂我的。我倒不怕骂，祖师自己也知道那不是清明的定境界。所以，你们不管是学密也好，学显教也好，都要把般若中观唯识三样搞清楚。但是很可惜，一般人都把唯识当成哲学研究了，其实唯识是一个非常严重的讲修证用的书。红教六种中有,,我们有的同学修过红教,红教里面讲六种“中有”（生死中有、梦境中有、妊娠中有、禅定中有、法性究竟期、转生中有）。比如说，我们人从死后到重新投胎是一段中有，这段的中有身也叫中阴身，死后灵魂重新投胎，变成胎儿出来。我们活著的这一段也是中有，从白天醒著到夜里睡著了，这个中间又是一个中有。所以我常常问一般参禅用功的人，你知道自己是怎么睡著的吗？注意啊，当你靠有枕头上要睡著的那一刹那是什么样，你知道吗？一般人听了我的话就去注意了，结果又睡不著了。不注意呢，就又昏沉了，一般人就是这样。<p>我们的念头在梦与醒之间也是一段中有。一个念头过去了，后一个念头还没有生起，有时候好像楞住一样，这一段也是中有。我们呼吸一进一出之间也是中有，弥勒菩萨在《瑜伽师地论》里告诉我们，有个“中间息”，指的就是这个。修安那般那修止息，我所以常常骂你们修数息观都在乱修，不是叫你光数呼吸啊！又不是学会计！中有认识清楚之后，你就可以把握昏沉与散乱中间是什么了。如果拿本体来讲，散乱不是定，昏沉也不是定，散乱与昏沉都是本体来的，就好像黑暗与光明都是一个东西所变的。不过我们现在是讲功夫，不管你本体不本体，黑暗就是黑暗，光明就是光明。那么在黑暗与光明中间是不是也有一段中有呢？那个好像亮又好像不亮的东西是什么？认识清楚这个，你就懂得用功了，上起路来就快了。</p><p>铁牛定禅师公案</p><p>现在我用禅宗的方法，叫你们参一个公案，注意，不是参话头。我特别把《大事因缘》这本书印了，希望你们大家注意。书中有这么一个公案，有一位叫铁牛持定的禅师，很用功，已经参禅很久了。有一天，大家在禅堂打坐，都很严肃，他老兄却躺下来睡觉了。这可不得了，按禅堂的规矩，这样做是犯规矩的，要打棒子，不是打屁股，是打背。严重的时候，一个香板打下来膀子就脱掉了。不过师父都有本事，马上就可以给你重新把膀子接起来。如果没有这个本事的话，千万不要随便拿香板打人啊！他师父晓得他已经领悟了，把他叫起来问他：“怎么可以犯规矩呢？你说，你的心在那里？”铁牛持定就作了一个偈子：</p><p>铁牛无力懒耕田，带索荷犁和雪眠，大地白银都盖覆，德山无处下金鞭。<p>他说，我好像一条牛在耕地那么辛苦，带著身上的绳索和犁地的铁犁，倒在雪地里就睡了，整个世间都被一片白色覆盖，德山师父向那里打我呢？嘿！大悟了，不处罚了，你们参参这个公案。</p><p>凡夫定与顽空定</p><p>刚才有同学问到，如果有人入定十几天，醒来以后所有的事都记得，这算不算一种定？答案是，不一定。不过要了解这一点，需要看五蕴解脱的道理，这个我们马上就要讲到，现在只作一个初步的说明。佛在显教的经典里讲到：“制心一处，无事不办”。制心一处就是一种定的初步，凡夫也可以做得到。佛有一次作过一个试验，叫国王找一位被判死刑的犯人来，令犯人头上摆一盆洗脸水，手里拿两盏灯，如果犯人能三天三夜不动，油灯不熄，就恕犯人无罪。如果犯人头动了，洗脸盆倒下来，油灯就会熄，犯人就失去了这次免罪的机会，就要被处死。这个犯人很感谢，结果三天三夜没有动。所以制心一处，无事不办也是一种定境，是凡夫的定境，也是一种功夫，不过不是般若，不是修道的禅定。所以，我常常说，任何功夫，不管是练武功也好、气功也好，制心一处，无事不办，假以时日，自会成功。<p>现在给你们讲一个我个人的经验。我二十多岁的时候，有一个阶段，自己试验顽空定的境界，这个境界不是无想定，不是空无边处定，就是拿一个空的观念，把其他都丢掉。结果，三个月以后，拿起笔来一个字也不会写，所有写过的书，看过的东西，也都忘记了。嘿！这个境界太可怕了。慢慢的，通过思想回忆，五天以后都恢复了。这个也说明记忆这个东西是非断非常，你若想把它断了，则什么都没有了，你要把它提起来，则什么都有了。这些都是实际求证的经验。总而言之，不要以为进入定境就是什么都不知道了，常入这种定，死后来生的果报是畜牲道，变猪，这点要特别搞清楚。 换句话说，你为什么智商主低呢？从科学的角度来说，这与脑有关，左脑的某一部分，如果长期不用，会达到白癡的境界，活著是白癡，死后变畜牲，这样的修行不如不修。<p>另外，宗喀巴大师在《菩提道次第论》里也再三提到这一点，大家要特别注意。但是你们不要听了就不敢打坐，不敢入顽空定了。哎呀，我拜托你，你能入顽空定我还向你顶礼呢，你们是连顽空也顽空不了啊，尤其像那些脑筋时时刻刻活动的人，能做一天白癡也不错。</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "第四章 五蕴解脱修证次第",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>前面讲了五蕴以及四禅八定，现在我们讲五蕴解脱和修证次第。我把《楞严经》的重点和秘密抽出来，取个名字＜增补楞严法要串珠修证次第＞。你们许多人虽然都读过这个经典，但是怕都没有注意到这些重点，因此就拿原文，带领你们读书。《楞严经》讲五十种魔境，就是说修持走岔路的境界有五十种。现在人不知道，实际上，像国内气功、特异功能，包括印度、尼泊尔欧美那些莫名其妙的修法，这些魔境，佛当年都已经讲过了。大家看不懂，因为翻译用的是古文。其实佛说的都是有科学根据的。如果把五十种魔境配合现代科学，详细作个说明，对人类的贡献应该很大，但是没有时间去做，这个世界人太多，让他疯一下也不错。</p><p>色阴解脱与楞严大定</p><p>汝坐道场，销落诸念，其念若尽，则诸离念一切精明。动静不移。忆忘如一。当住此处，入三摩地。如明目人，处大幽暗。精性妙净，心未发光。此则名为色阴区宇，若目明朗，十方洞开，无复幽暗，名色阴尽。是人则能超越劫浊，观其所由，坚固妄想以为其本。（《楞严经》卷九---一七九页。）<p>汝坐道场，销落诸念，其念若尽，则诸离念一切精明。道场两个字翻译得很有趣。四十年前，一位中国教授在美国史丹福大学教禅学，他翻译了很多禅宗典故寄到台湾，要我给他修改。我看了就头大。修改还不如自己写！他是位老先生，怎么给他改呢？当时我有个学生，年纪比我大，要是现在还活着，已经超过一百岁了。我这位学生曾留学加拿大，我说，你看英文，看完后告诉我内容。他看了就笑：“老师啊，他把禅宗祖师讲的道场译成了坟场。”我说：“他没有错啊。”他是没有错，他小的时候在中国大陆，一定看到过和尚给死人念经，送到坟上，叫做“作道场”。所以他把道场翻译成坟场了。他当然是错了，什么是道场呢？道场就是修道的场合，密宗叫曼陀罗或坛城。你今天在这个位置上两腿一盘，或者打坐，或者念佛，这里就是你的道场。也不一定讲打坐不打坐，所以佛告诉你，行住坐卧都行。不过，静坐是求证道业方法里面最重要的一个姿势，尤其是盘腿跏趺坐，是过去、现在、未来诸佛采用的。所以这里讲，你坐在道场。你注意啊，他中文翻译得太美了，很容易一下就读过去了，每个人都认为自己很聪明，不肯用心。“销落诸念”，一切杂念自己不起了，注意不是你把它压下去了。“销落”等于下雪时雪飘下来自己化了，杂念都掉下来，杂念自己清净了。“其念若尽”如果你所有的杂念都干净了，清清楚楚了，注意，我把念都解释成杂念了，到下一句就清楚了。“则诸离念一切精明”那么你就内心清清楚楚，明明白白，这可不是杂念，不是妄想，很自然的，中间一个杂念都不上来，道家有一句话，“烦恼无由更上心”，此时，外界对你没有任何影响，即使是一把枪顶在你头上，你都没有生气和烦恼，来吧，打死就打死吧！比如参禅、念佛、或念咒，开始时杂念非常多，等你制心一处，专心到某个程度的时候，慢慢杂念没有了，就连念咒这一念也没有了，一切离念，离开妄想。“动静不移，忆忘如一。当住此处，如三摩地。”一动一静之间，都一直保持杂念自然清净的境界，没有变动。一动一静是讲生活的形态，尤其是在家人，还要去办公室工作，还要做事，在动中也要保持这种境界。或者赶快去办公室一两个钟头，处理完事情回来，再进入这种状态。“忆忘如一”，不管你是用心去保持这个境界或者不用心去保持都一样。这里的“忆忘”两个字，一个代表用心加上保持，一个不需要用心保持，它反正在这个境界中。“当住此处，入三摩地”，应该这样入三摩地，这是定境。如果盘起腿打起坐来只是在禅堂有定境，放掉腿就什么都没有了，那不是修定，那是修腿。你们应该提问题啊，你们不提，那好，我帮你们提。世尊，有没有一种方法可以求得制心一处呢？您老人家告诉我，达到这个境界气脉是否通呢？答案是：不用方法。这个《楞严经》所讲的“楞严大定”，等于《华严经》里面讲的“法界自性”。以我们中国话来讲，要“体任天然”任是一切放下，连放下也不要，很自然就达到那个境界，这里其实也是讲专一，不过这个专一不像小乘，要加一个什么方法或者念一句佛、咒子或者作一个菩萨本尊的观想等。这里是自然就达到的。体任自然，销落诸念，在智慧里，这就叫做“法界体性自性智”。当然你也可以走小乘的路线，那是别的法门了。从现代生理科学的立场告诉你，在这个境界上，气脉一定宁静，气住就达到止息的境界，呼吸几乎没有了，但是还有一点，心脉也快要打开了，所以讲心与物是互相影响的，气脉不调和，色身四大没有调好，杂念思想就不会停下来，气就宁静不下来，注意，佛对这个一点没有明说，这是我加进来的，很值钱啊！</p><p>色阴区宇</p><p>“如明目人，处大幽暗。精性妙净，心未发光，此则名为色阴区宇。”佛他老人家真是很慈悲，又为你作了一个比喻。他说，到了这个境界，就好像是一个眼睛好好的，没有瞎，没有近视，也没有老花的人，被关在一个黑暗的房子里，先问你们一个问题，你们有没有被关到一个极其黑暗的房子里的经验？（有人答：“有，停电的时候。”师答：“关那么一下下不算数。”）密宗有一个方法，叫“闭黑关”只准七天，房间不大，可以通风，里面有床铺，有洗澡的地方，可能还摆一张桌子和椅子，当然还有佛像，你一个人裸体在里面打坐，一点光都没有，这是修眼通，也可以说是修天眼用的。处在黑暗久了，慢慢会有亮光了，那个亮光不是太阳光，不是月亮光，也不是灯光，是真实能看见的光哦！至于这种亮光在物理上叫什么，我现在不告诉你们，要参考现在的物理学、光学的理论。佛是说你上面的这个境界，就好比是有眼睛的人处于黑暗里，我给它加上裤子啊衣服啊，根据自己的经验，把它形容得更仔细，你们不要被我的话骗住了。所以现在学佛不懂科学就免谈了，佛都知道这些道理，不过，他老人家生活在两千多年前，不是现在，如果现在他老人家再来说法，就会加上科学了。黑暗中那个隐隐的光是有相的光，不是自性的光明，不过于宇宙自性和你自性也有关联。在黑暗的房子里，什么都看不见，可你心里特别清楚。像我们原来带兵的时候，最好的处罚就是关禁闭，不是正式坐牢，而是把你关在暗室里，一点亮光也没有，一点声音也听不见，普通人在这种情况下会怕哦，当然，如果把我关进去，那我正得其所哉，正好打坐。这时你的心孤零零的，只有个精性，心里头自己思想都很清楚，可是自性的智慧光明还没有发出来。“心未发光”是说还没有发智慧的光芒，无相的，心里头还没有透亮，没有大彻大悟的那种境界。“如明眼人，处大幽暗”那个黑暗里的亮光是有相的光，是物理的作用。心光不是物理的作用，但是文字只能用光字来形容、来代表。<p>现在很多学密宗的人，动不动就把“心光”的光看成有相的光，都错了，有个电影里演中阴境界时，也用那么一团光，我告诉大家，这样理解中阴光，人就更难得度了。你以为中阴时还真有一片光明来接你啊，有是有，是“心光”，不是有相的光。像我们常说：这件事情我没有想通，突然灵光一现，我想出答案来了，这也是心光。佛说到了这个境界叫“色阴区宇”。色阴是身体四大（地水火风）加空大所变化作用范围，还不是道，憨山大师在盘山顶上经行时，看到整个的海天和世界，在一片光明之中，那是生理变化，也是在色阴区宇。下面佛会讲十种魔境，讲修行过程中的岔路，十种还只是讲原则而已，许多练气功的人，也有一点心得，有时也会有清净的心境，但很容易从这里走到岔路上去，很容易入魔。魔者磨也，就是自己迷糊了。你说没有外魔吗？也有啊！外魔内魔一起来的。这也是在色阴区宇。如果能把十种阴魔配合现代医理和物理讲出来，是很大的贡献。这里补充两点，要修一个闭黑关的关房很难，需要双重墙壁，不能透一点光，但是空气要流通。这是一。第二，其实，我们现在闭眼打坐就是“如明目人。处大幽暗”啊！不过不是在房里头，而是在爸爸妈妈借给你的这个身体的房间里打坐。这都是在生理、唯物的范围内转哦，都还是色阴区宇的范围。<p>　　　　　　　　　　　　　　　<p>色阴解脱　超越劫浊　“若目明朗，十方洞开，无复幽暗，名色阴尽。是人则能超越劫浊。观其所由，坚固妄想以为其本。”佛接着打比方说：如果像白天张开眼睛看东西一样，一切都明明白白，清清楚楚，看到天空，看到空灵的境界了，这才叫色阴尽。在生理方面，现在气脉完全通了，跳出了生理的范围，这叫色阴尽。这段色阴的讨论是讲生理的，物理的，不盖在无明中，发生光明了。到达这个境界的人，不再受这个物理世界及社会环进境的影响了，但是还没有成佛证得菩提。为什么呢？因为这还在妄想境界，心念想念还在。但是，也就是靠这个坚固妄想，才能达到这个境界。你若思想不坚定，学学就退道，那你还达不到这个境界呢？虽然这个不是道，不是菩提，可是功夫能做到这一点，那已经不得了啦！通过定的境界再加上般若的开发，你可以到达色阴尽了，不过这里不用什么方法，只是讲销落诸念，一切杂念都放下，一切都销融掉，进入动静不移，忆忘如一，这是修大乘菩萨的境界。在这种三摩地的定境里，自然包含了四禅，至于说用那一个定，到这时，连四定这个念都要放下，四禅八定已经微不足道了。但是四禅定的经历就在里面了。所以大可以包小，但小不能包大。从欲界到无色界的三界，四禅八定，乃至小乘的灭尽定，都没有离开第六意识的范围。注意第六意识并不是什么坏东西，转了就变成妙观察智，还是那个第六意识，重要的是看你怎么用。《楞严经》里面讲的十种仙，寿可达万岁，长生不死也都是靠这个坚固妄想，所以从作用的角度来讲，坚固妄想作用很大。当然这还不是菩提道。<p>　 为什么我们有色阴区宇呢？因为自从无始以来我们这个生命都在坚固之中，所以叫“坚固妄想以为本”。我们的色阴区宇就是我们这个肉体色法。包括地水风火，我们一入胎，有了这个地水风火的生命，就有这个色阴区宇了，甚至入胎以前，生死中阴的时候也有，在唯识学中叫“法处所摄色”是在意识境界中，自己有个地水风水空的物质观念。好比说，在梦中，本来是个梦，我们还是觉得有个身体，那个身体是法处所生的色，换句话说，自无始以来，我们认为这个身就是我，身见很难忘掉。那么身见又是怎样来的呢？是坚固妄想来的。所以我们的身体就像一个牢笼一样，把我们困于色阴区宇，就是云门禅师所讲，“中有一宝，秘在形山”被形体关住了，空不掉。要解释色阴区宇，达到色阴尽，需要销落诸念，那时就好比十方世界，一切幽暗都没有了。但是用什么方法达到这一点呢？大乘的方法不是四禅八定一步一步做工夫了，而是用智慧的解脱，就像永嘉大师所说的：“了因之所了，非生因之所生。“一步步做工夫，慢慢进去，那是“生因之所生”，所以永嘉大师的方法是不用方法，等于《楞严经》讲的无门为法门，这是真正的大秘密。一般人只是把这些当作是显教的教理，这些都错了。了因之所了，“了”就是了，放下就是了。换句话说如果用数学公式来表达，“道”就是“了”，“了因之所了”的“了”是减法，一减一等于零。零就是零。“生因之所生”的“生”是加法。在《圆觉经》上佛说：“一切众生妄认四大为自身相”，众生都错了。把四大肉身误认为是自己，“妄认六尘缘影为自心相”，把六根六尘接触的反应当成了自己的心，所以身心两方面都认错了。我们今天父母所生的四大之身和六根，都是第二、三重的影子，自性功能本来在那里，没有动过，所以《圆觉经》是很高的华严境界，本来也是佛境界。如果你真正认识到这个色身不过是四大假合之身，一切放掉，管他生也好，死也好，苦也好，乐也好，根本不去理它，那就是大乘根器了。<p>　 有人问这时气脉通了没有，有两个答案。第一，你这句话本身就说明你坚固妄想的习气没有变。第二，告诉你，真的放下了，气脉当然就转变了。佛在《楞严经》第三卷就告诉你了：“返观父母所生之身”，回转来看看父母所生的这个身体，“若存若亡”，好像有好像没有，几十年，或者一百年，随时都会走掉，我们的身体不过是我们借住的一个房子，如果你真能明白这个道理，明白自身的体相，不妄认四大为自身相，不妄认六尘缘影为自心相，一切放下，就对了。问题是大家就是放不下。比如你们大家学佛打坐，眼睛一闭，坐在那里，都是闷在牢笼里一般，所以禅宗祖师骂人：“黑漆桶一团”，等于一个东西放在桶里，盖住了出不来。一般人打起坐来很难跳出色阴的范围，动不动就在那里做功夫，可见身体这个牢笼很厉害的，色阴的范围很严重。如果你的心不在身体上搞什么气脉了，不为它所转了，就像《楞严经》一开始就告诉你的：“虚空生汝心中，犹如片云点太清里”，整个虚空在你心里，犹如一片浮云在太空里一样，那么渺小，你的心、本体有这么大，整个身体，整个世界有多么渺小啊，为什么还要管这个身体呢？这样你认识本来之后，再“返观父母所生之身，若存若亡”，就是这样的，本来空的。不管你是走大乘还是小乘路子，若真能转化色阴，销落到空了，于虚空合一，连虚空也销落了，就像道家讲的：“炼精化气，炼气化神，炼神还虚”这时还没有到家啊！“虚空粉碎，大地平沉”，就是打破色阴的牢笼了，算是色阴尽了。虚空粉碎，大地平沉是一个比喻，已经是虚空了，还粉碎什么呢？地球都毁灭了，没有时间空间了，更没有肉体这些观念了，都打破了。</p><p>李居士：色阴尽的物理现象或者说标记就是“若目明朗，十方洞开”好像站在高山之顶，一切都看得清清楚楚，都是亮的，整个虚空都没有障碍了，不像“处大幽暗”的时候，什么都是黑的。<p>包卓立：“十方洞开”，这种境界是不是暂时的？不修就没有了？像西藏有一些记录，有的大法师曾经有一段时间可以看得很远很远，什么都可以看见，但是过一段时间就没有了。<p>怀师：真的达到“十方洞开”这个境界的时候，所有的脉统统都打开了，而且这种成就不是暂时的，至于你说的那个大法师的情形，他只是中脉打开了而已，还在色阴范围。气、脉、拙火都是色阴范围。之所以跳不出来，是因为无始以来自已的坚固妄想这个根根没有破掉。道家“炼精化气，炼气化神，炼神还虚”也还是在色阴范围。破这个坚固妄想还是要用第六意识，还是用坚固妄想去破它，这叫以楔出楔。色阴区宇还包括生理，物理方面。下面讲不同的东西了。<p>　　　　　　　　　　<p>受阴解脱　超越见浊</p><p>彼善男子，修三摩提，奢摩他中，色阴尽者，见诸佛心，如明镜中，显现其像。若有所得而未能用。犹如魇人，手足宛然，见闻不惑，心触客邪而不能动。此则名为受阴区，若魇咎歇，其心离身，返观其面，去住自由，无复留碍。名受阴尽。是人则能超见浊。观其所由，虚明妄想以为其本。（一八二页）彼善男子，修三摩提，受阴尽者，虽未漏尽，心离其形，如鸟出笼。已能成就，从是凡身，上历菩萨六十圣位。得意生身，随往无碍。（一八六页）“彼善男子，修三摩提，奢摩他中，色阴尽者，见诸佛心，如明镜中，显现其像。若有所得而未能用。”这里文字用得很妙。讲色阴区宇是从“汝坐道场”开始，这里换成“彼善男子”了。在《金刚经》中，有善男子，善女人，在大乘菩萨境界，不管你是男是女，到了菩萨境界都称童子，所以文殊菩萨又称文殊童子。这里佛说，诸位先生们，诸位兄弟们，修定修止达到色阴尽的境界，你见到一切佛的心就和我们的心一样，一切众生心等于一切佛的心一样，这一点你看得很清楚，好像明镜中的影像一样。注意啊，这时你还在定中啊！在奢摩他（止）的境界里啊，自己的每一个思想念头，都像影像一样飘过来飘过去，无所谓，好像是空的，很轻松。你们用功有时也会有这个境界啦。这时你自己觉得好像已经懂了，明心了，但还不能起用。“犹如魇人，手足宛然，见闻不惑。心触客邪而不能动。此则名为受阴区宇。佛作了一个比方，此时的情形，就等于我们在睡觉做梦，好像被鬼压在那里，心里很明白起心动念都很清楚，但叫不出声，手脚都在，也感觉得到，但就是动不了，被它压得死死的，很害怕<p>为什么会有这样的梦呢？因为“心触客邪”，有灵鬼，或者魔障，或者因为身体里有病，总之，都是邪气碰到你的身体，而使你的心起这么一个反应。这种情形叫受阴范围。受是怎么来的呢？无始以来，我们生命多生累劫，触受都搞惯了，受苦、受乐、非苦非乐、喜忧，这些都是受阴解脱不了而来的。还没有离开身见的作用。“若魇咎歇，其心离身，返观其面，去住自由，无复留碍。名受阴尽。是人则能超越见浊。观其所由，虚明妄想以为其本。”<p>前面讲到睡著了，被鬼压住了，后来一下子醒了，鬼也没有了，身体也不受压了，这时身心可以分离，随时可以把这个身体丢掉，要走就走，可以解脱这个身体了，功夫到了这里，触受都没有了。等于道家讲的阳神出窍一样，不过道家讲的阳神出窍还有一个影子，这里连影子都没有了，身心都无所谓了。此时，去住自由，没有障碍了，要留在身体里也可以，要走也可以。这是受阴尽。修行到这种境界的人，智慧打开了，观念思想不会有偏差了，不会被小乘的五见（邪见、身见、边见、见取见、戒禁取见）所缚了。色阴尽的时候是超越劫浊，不再被现实的物质世界所困住，不像二十世纪末二十一世纪初的这批人，被电脑等等这些物质文明所困。到受阴尽，超越了思想见解，得正见了。为什么会这样呢？因为我们无始以来的“虚明妄想”。色阴的时候，是被坚固妄想抓得牢牢的，到受阴，是被虚明妄想抓住了。好比说你坐在公园里，思绪飞得好远好远，可能想到阿拉斯加去了，这就是虚明妄想。受阴境界有触受两面，有十种魔境，都是虚明妄想来的。要想妄想不虚明了，还需要小心用功。正如神秀大师讲的：“身是菩提树，心如明镜台，时时勤拂拭，莫使惹尘埃。”</p><p>受阴尽得意生身<p><p>“彼善男子，修三摩提，受阴尽者，虽未漏尽，心离其形，如鸟出笼。已能成就，从是凡身，上历菩萨六十圣位。得意生身，随往无碍。”<p>受阴尽了，就好比是人睡觉不受梦魇压力了，但不是成道，还没有得漏尽通。六根都不漏了，一念不生，得无生法忍，念念清静了叫漏尽通。普通天人有五通：“天眼通、天耳通、他心通、宿命通、神足通，但没有漏尽通。只有佛的弟子，小乘阿罗汉或者大乘的菩萨才有漏尽通，尤其是大阿罗汉，得漏尽通，六根都不漏了。换句话说，不动心了，等于中国孔子讲的对境心不起，起而不起，不是完全不起，起了也像是没有起。佛说，到受阴尽的时候，虽未证得漏尽通的涅槃境界，但是心已经可以离开身体了。此时，要死就，要留也可以留。那个舒服程度就像小鸟出笼一般，到这个程度，当然比道家所谓出阳神高明多了。不过这个时候，寿命没有尽，业力没有完，如果想要早走，逃避痛苦，那是犯了杀戒。这是顺便提到的。这时如同经历了菩萨的六十圣位一般（六十圣位包括三渐次，十信、十住、十回向、四加行，十地，妙二觉等），对佛菩萨的境界都能体会了。这就比道家的阳神高了，天上人间任意寄居，随便你的意思。寄居，只是挂褡一下，偶然住住。苦难的人世间需要我来就来一下。<p>　　　　　　　　　　　　<p>想阴解脱　　超越烦恼浊</p><p>譬如有人，熟寐寝言。是人虽则无别所知，其言已成音韵伦次。令不寐者，咸悟其语。此则名为想阴区宇。若动念尽，浮想销除。于觉明心，如去尘垢。一伦生死，首尾圆照，名想阴尽。是人则能超越烦恼浊，观其所由，融通妄想以为其本。（一八七页）“譬如有人，熟寐寝言。是人虽则无别所知，其言已成音韵伦次。令不寐者，咸悟其语。此则名为想阴区宇。”这时佛又作了一个比喻。这个情况就好比是一个人睡著了说梦话，他自己也不知道自己在讲话，可是他的讲话话别人听起来都能听懂。达到这个层次的人，可以像菩萨一样说法了，说的法与大菩萨、佛说的一样，使没有睡的人听了他的话都懂了，可是他自己不知其所以然。你若问：“你怎么会说出来？”这时他是自然就说出来了。所以，你不要轻视普通弘法的人，他虽然没有到家，他讲的话却是菩萨的话。这是想阴的范围，分析起来又有十条岔路。“若动念尽，浮想销除。于觉明心，如去尘垢。一伦生死，首尾圆照，名想阴尽。是人则能超越烦恼浊。观其所由，融通妄想以为其本。”浮想也就是妄想。如果心念如如不动，任运自在，一切妄想都没有了，尘垢都洗去了，一念不生，悟了，生也无所谓，死也无所谓，为了度畜牲，就去投畜牲道，要走就走，这叫一伦生死。这时，从头到尾都是圆满清静的。修到这里，就是想阴尽了。修到这里，一切烦恼都没有了。前面讲过，妄想有坚固作用，虚明作用，而我们之所以有想阴，是因为妄想的融通作用。所谓融通，就是融会贯通的意思，融会贯通了，则一悟千悟，一了百了，此心“一念不生全体现”，平常什么都明白了，像大明镜一样。我们一般人都受想蕴的控制，随时都被控制着。但是平时思想用在对自己身体的坚固妄想方面，很严重。有时候也会有虚明妄想来。有时候看佛经修持，忽然有所领悟，似乎很解脱了一样，那个就是属于妄想的融通作用。<p>在想阴区宇，已经得意生身，自己可以自由来去，但还不能成形，而且生死也还没有看通，还在现在这个身体里，等到想阴尽的境界，对六道轮回、生生死死都无所谓了，生死涅槃等空花。含光默然不管时间长短，现在大家打坐至少可以了解什么叫身心（思想的心）分开了。你闭眼打坐，好像被关在黑桶里一般，身体不动，思想来来往往、昏昏扰扰的，但是慢慢的，你可以把身体六根和思想往来分清楚了，能随时清净自己的思想念头了。有了这么一个基础，即使心仍然被盖在这个肉体里面，能够这样清静的人已经很少了，很不错了。有了这个认识，估计你还听得进我们这个五蕴解脱的课，否则是听不进了。你们大部分人都是闭眼打坐，照古代严格的讲，打坐并不完全是闭眼，眼睛应该是微微张开的。后来道家对这种方法叫“垂帘”，眼睛的上下眼皮，等于窗帘一样，闭三分之二，留一点缝。根据古时候佛经的翻译，做白骨观也好，安那般那呼吸法门也好，都要眼观鼻，鼻观心。就是说眼睛三分之二关闭起来，看着自己的鼻尖，而鼻子与心窝子对成一条直线，然后不管眼睛，回转来观自己的心念。另外严格地讲，小乘修法是半闭眼睛看前面三步距离的地方，大乘修法是开眼对着前面五、六步的地方。<p>　 使眼睛去看的这个注意力是意识，我们一般人习惯性的会把眼识和意识配合起来去看。如果是开眼打坐，要把眼睛的意识拿掉，眼珠子开着，但没有看，这种方法与闭眼的感受不同。你们平时闭眼打坐习惯了，让你开眼你还受不了呢。如果你训练自己把眼识拿掉，那你对于身心分开，思想与身体分开的体会就会比较清楚了。<p>　这样眼睛半睁半闭，用中国字来形容叫“含光默然”，那个样子就像健康婴儿睡觉那样，眼睛有一条虚虚的缝。注意，只有脑力、神充满了才做得到这样，对现代人来讲，我主张闭眼打坐，什么道理呢？因为现代人用眼用脑太过度，神都不充满，开眼打坐容易把气神都提到脑上，算不定搞出毛病来，把神经搞错乱了。为什么眼睛要这个样子？你看佛菩萨塑相都是这样。我告诉你，比方借用道家的炼精化气，炼气化神来说，神充满了，你想闭眼都闭不住，自然会开开。但是眼睛开开并不是看哦。我不叫人走这个路线，因为普通人会习惯性地往前面看，这就不对了。有人打坐，在那里规规矩矩地“眼观鼻，鼻观心”。我做给你们看，你们注意我的眼睛，它慢慢变成两个眼珠向上去，前面一条白的线出来，这样是不对的哦，这还是有意在看，是把眼睛硬拉到上面去看，这样都会使精神出问题，是一种病态。你们用这个方法很容易这样出问题，理由等一会儿告诉你们。眼睛巧妙得很，你们身心有时候观照不清楚，就有这个毛病，所以在讲行阴之前补充讲一下。<p>　　　　　　　　　　　<p>七处征心　八还辨见</p><p>这个是顺便带到，也是很重要的事情。广东韶关六祖道场南华寺，我们有同学从那儿回来跟我讲：“哎呀！那真是大祖师！我们拜下去，他的眼睛好像在注意我们一样，我们换一个地方站，他的眼神好像就会跟着我们换一个方向。”你要晓得他的肉体眼睛是半开半闭的，佛菩萨塑相也是这样，这可是个大关键哦。《楞严经》里佛开头就讲两个要点，“七处征心”，跟阿难讨论“心”是个什么东西，心在哪里？七次往返讨论心的问题。佛说心不在外，不在内，也不在内外中间，不在虚空，也不是不在虚空。换句话说，心也在内，也在外，也在中间，也在虚空，也不在虚空，无所在也无所不在，全体内外、心物一体都是一个心的作用。所以你若真明白了这个心的道理，就不要守着自己这个肉体、和这个思想意识心，这些都算不了什么。<p>《楞严经》已经把这个大秘密告诉大家了，你们也都读过《楞严经》，只是就这么读过去了，都没有看懂。一般法师们讲《楞严经》，也都是像鹦鹉学舌传声筒一样的过去了，我们很多同学在外面讲《楞严经》也是一样的情况。不过，即便是传声筒，也还是了不起，还是有功德的。<p>《楞严经》开头讲的第二个要点是“八还辨见”。八次辩论“看见”这个“见”字的道理，佛特别用眼睛来讲这个道理，我们开眼可以看见光明，那是因为宇宙里有光，像太阳光、月光、星星的光，还有人造的电灯光等等。佛问阿难：“瞎子能看吗？”阿难说不能看，佛说：“你错了，瞎子也能看。看到里面黑洞洞的，不像我们看到外面这个样子。”开眼见光，闭眼见暗。这样来回有八次辩论。佛就告诉阿难，明来暗去，暗来明就去，现象的变化是无常的，但能见明见暗的那个能见的东西，不在明暗上面。有人说，佛说的不如现在详细，不如现在科学，那是乱说。当今科学虽然很详尽，但对很多事情也还没有定论。佛是两千多年前讲的，那真是了不起。你们现在学佛经很容易有主观成见，不像我们当年看这些经典，那是完全听他的，然后用自己做试验，把自己的主观都拿掉。佛说，你把光明还给太阳、月亮、星星，把障碍还给墙壁（如果是一张纸挡住你了，就把障碍还给那张纸），把一切都还完了，但还有一个东西没有办法可以归还的，也没有办法还给虚空，那个东西不就是你那个能见的吗？这样分析完了，佛讲了四句名言“见见之时，见非是见，见犹离见，见不能及。”见道时，明心见性的这个见不是眼睛看见的见，见道的本身不是物质的东西，离开物质的东西，离开现象的东西，不是眼睛看见的见所能达到的，这是谈形而上的见。那么佛为什么在提出七处征心以后就提出眼睛谈“见”呢？道家有一个最古老的经典，姜太公的《阴符经》，也有人说是姜太公的师父作的，到底如何不知道。《阴符经》就讲“机在目，机在心”（眼心之机也），眼睛是心的开关，当我们休息好了，睡醒了，眼睛就要打开，做白天一切的活动。等疲劳了，就要走入黑暗状态，走入阴境界，就闭上眼睛睡眠了。一阴一阳都在眼睛这个机关里，所以开眼见明，闭眼见暗。这两句话可以用来修道，也可以是世法大政之治，大谋略的哲学。“机在目”，外面要观察清楚，“机在心”，应用之妙就在于你的思想心了。为什么讲到这里呢？因为前面讲到一念之间有坚固妄想，有虚明妄想，还有融通妄想，大家平时都没有看清楚，《楞严经》把这些言语文字表达不出来的秘密都告诉你了。眼睛能见色，见一切物理的现象，但是还有无表色，还有理念世界，那就不是物理的现象了，但与眼睛也都有关联。讲这些就是告诉你们，不能光听色受想阴的理论，要自己试验。现在要讲行阴了。<p>　　　　　　　　　　　　　　<p>行阴解脱　超越众生浊</p><p>彼善男子，修三摩提，想阴尽者，是人平常梦想消灭，寤寐恒一。觉明虚静，犹如睛空，无复粗重前尘影事。观诸世间大地山河，如镜鉴明。来无所粘，过无踪迹，虚受照应，了罔陈习，唯一精真。生灭根元，从此披露。见诸十方十二众生，毕殚其类。虽未通其各命由绪。见同生基，犹如野马，熠熠情扰。为浮根尘究竟枢穴。此则名为行阴区宇。若此清扰熠熠元性 ，性入元澄，一澄元习。如波澜灭，化为澄水，名行阴尽，是人则能超众生浊。观其所由，幽隐妄想以为其本。（一九七页）<p>行阴区宇前的想阴尽现象“彼善男子，修三摩提，想阴尽者，是人平常梦想消灭，寤寐恒一。”修定修慧到想阴尽的时候，平常就没有梦与想了，等于《心经》里讲的“远离颠倒梦想”。梦就是想、想就是梦，梦、想消灭以后就清净了，而普通人不是在做梦就是在思想。这里讲的“没有想”是真的一念不生，是自然的一念不生，不是压下去的，压下去就是无想定了。到这个时候，“寤寐恒一”，清醒与睡眠一个样，这就很难懂了，一定要实际修持到那个境界才了解。三祖僧璨禅师的《信心铭》就讲：“眼若不寐，诸梦自除，心若不异，万法一如。”如果你瞪着眼不睡觉，自然就没有梦了，如果你心没有分别没有变异，也就万法如一了。这里的“梦想消灭，寤寐恒一。”是想阴尽的境界，只有到了想阴尽的人才晓得行阴，行阴是很难懂的。“觉明虚静，犹如睛空，无复粗重前尘影事。”到这个时候，才是灵明觉知之境，永远清楚，永远清净。佛作了一个比方，说这个时候就像万里无云，永远是晴空万里那个样子。用中国文学来形容它，就是“千江有水千江月，万里无云万里天”。这时身心没有粗重的感觉，很轻灵。这时也还能像普通人一样做事。思想吗？也可以！但是我们普通人做事都负担很重，很粗重，而到了这个时候不管是吃饭也好，高兴也好，骂人也好，都飘飘的，像做梦一般，又不是做梦。以前的事情也都像影子一样。“前尘”不是以前的意思，现在所有的也都是前尘，我们睁眼闭眼看的，心里想的，都是前尘影事。“观诸世间大地山河，如镜鉴明，来无所黏，过无踪迹。虚受照应，了罔陈习，唯一精真。”这个样子想阴清净了，就慢慢进步了，看一切世间，整个物质世界，整个地球，山河大地，一切事和物，此心是“心如明镜台”“如镜鉴明”，完全清清楚楚，心不会被黏住，一切用完了就了无踪迹了，心中还似明镜一般。我们普通人想阴没有尽，自己随时都会被自己的思想骗住。《楞严经》不用骗这个字，而是用黏，像浆糊粘住那样，普通人那个思想的灰尘一来就粘住了，慢慢越积越多，明镜就不见了。想阴尽的人，一切灰尘来了都无法黏了，一下就溜过去了，连一点影子都没有了，永远“虚受照应”。那么这时他还是起作用吗？没有想阴的人，作用比我们普通凡夫还要大，智慧还要高，更清明，只要一来就有反应，所以有时候你一起头讲，下面的结论我就已经很明白了，不用等你讲完。所谓“虚受”就是像镜子照东西一样，“物来则应，物去不留”，一切都照应，都有反应。但过去了就过去了，没有留。“了罔陈习，唯一精真”。这个翻译太高明了。“了”就是明明了了，“罔”就是恍恍惚惚，一切事情都是不实在的。“陈习”就是无始以来陈旧的习气，拿这一生来讲，从小到大我们这个陈旧的习气都是想阴的连续作用。想阴过了，习气就真可以转了。“了罔陈习”，是说不会被思想骗了，现代人经常讲的“理性”也是思想。“唯一精真”的这个精，不是男女性交出精的那个精，这个精是形容词，就是中国人讲的精神的精。这里是说到了这个时候，唯一那个精，是真的。真正的精就是心中很清明，没有杂念，没有昏沉和散乱，什么都很清楚，那个是精真。色阴境界与医学、生理学、解剖学，生化都有关系，受阴与神经系统，呼吸系统、五脏六腑、荷尔蒙系统都有关系。讲到想阴解脱，“了罔陈习，唯一精真”就完全讲到脑里面去了，脑里面的细胞都要起变化了，起真空爆炸式的变化。真精可能是间脑这部分起变化，这都是真的哦！我可不是在乱说。讲到想阴尽，才知道行阴之难懂。整个太阳地球月亮的转动，就是个行阴的作用。像我们思想停不了，感觉停不了，也都是行阴的作用。你今天还活着，还没有死，这也是行阴的作用。甚至你死了以后进入中阴，再轮回，那也是行阴的作用。再比如我们一生下来就要睡觉，也是行阴的作用。道家讲打通任督二脉，我经常笑大家，叫你们不要有意去打通，他本身就是通的，它也是行阴的作用。这行阴最难辨，可是佛两千多年前就讲了，但是也还是没办法表达，尤其是这本经，翻译成那么优美的中文，就更难懂了。</p><p>行阴区的宇的魔障</p><p>“生灭根元，从此披露。见诸十方，十二众生，毕殚其类。虽未通其各命由绪。见同生基，犹如野马，熠熠清扰。为浮根尘究竟枢穴。此则名为行阴区宇。”达到唯一精真以后，你在那个定的三摩地境界里，对于生与灭的根本就很清楚了，某人要死了，会投胎变猪，或者会升天，对这些物理的变化都可以看得清清楚楚。这些都是定中的境界，这个定并不是故意打坐才有的，你本来就在定中嘛！这时候你能“见诸十方，十二众生”东南西北、东南角、东北角，西南角、西北角，上下一共是十方。一般我们都讲六道，《楞严经》是讲十二类众生，若有色（有形有相的），若无色（没有形象）都包括在里面了。这时“虽未通其各命由绪”，虽然还不能完全看清一个人生命之来源，但已经能够“见同生基”，能看到我们一切众生的共同生命后面有个动力，已经能看清生命轮回转动的能源。这个生命能源“犹如野马”野马是引用《庄子》的，野马不是一匹马，是阳焰，虚幻的烟，好像有又好像没有，所以庄子说“野马也，尘埃也，生物之以息相吹也。”拿现代比喻来讲，好比说原子弹爆炸那个动力，好像有又好像没有。但是一旦爆炸了，那个威力就大了，有声音、有亮光、还有味道，你闻到还会死，色声香味触都有。佛经用了这些文学翻译，现代的人，不把它当成野马野狗才怪呢！讲到“各命由绪”，给你们讲个故事。大阿罗汉可以看到每个人生命八万劫以前的事。有一次，有一个人向佛要求出家，舍利佛这些佛的大弟子们就在门口把他拦住了，吵了起来，不许他出家。佛在屋子里打坐，问他们吵什么，舍利弗说：“世尊啊，我们看了，这家伙八万劫来都没有结佛缘，不能出家。”佛就笑了，“你们这些罗汉功夫修养只能看八万劫，他八万零一以前是条狗，同我结了缘。那时我是缘觉佛，已经涅槃了，人家给我立了塔，供舍利子。这时候，上面有人屙大便掉在这只狗的尾巴上，它被惊跑了，尾巴一摇就把大便甩到了我的塔上，就是这么个因缘，它就是可以出家了。”大便是狗最好吃的东西，所以那也是供养。生命的那个能源犹如阳焰一样，它“它熠熠清扰”像闪电一样，闪得很快，力量很大，很清，可是也很扰乱。熠熠就是形容有亮光的，哗哗闪的意思。这个生命能源是“浮根尘究竟枢穴”。浮根尘就是我们这个生命，我们的眼耳鼻舌身五根。这个生命的中枢有个动力在动，这个动力，或者说这个行阴很厉害，这个东西不是思想。你打坐修到一念不生，或者念念清净，你身上的任督二脉，十二经脉还在转动，心脏还在跳动，这个作用就是行阴区宇，就是动能。这个中文翻译得实在是太美了。翻译这部经的人是宰相房融，被下放到广东，就翻译了般刺密帝带来的这本经典。<p>庄子之所以用野马这个词，也是有道理的，野马这个东西是会乱跑的，尘埃也是用来形容野马的。讲到这里有两点需要注意。第一点，“为浮根尘究竟枢穴”，佛在这里讲得很隐晦，但很有道理。我们人类的整个生命在脑部，所以我在《静坐修道与长生不老》书中讲，人参就像我们人一样，它的俩个根根在土里，两只脚从上面长出来，人参一千年会变成人形。对我们人来讲，我们的土是头顶上的虚空，两个脚就是人参两个叉子，所以我们一切都在这个脑部。下面男女生殖器是神经末梢，整个中枢神经在头部。佛讲那个动力，“为浮根尘究竟枢穴”用的非常高明，所以那个生命的动力与我们的脑子关系很大。究竟枢穴大概等于我们现在讲的间脑，所以道家讲灵魂是从头顶上出去，但这个并不是肯定的。<p>第二点是，对应行阴区宇也有十种魔障。前面讲过色受想阴，每一阴都对应有十种岔路，十种魔障。有人说怕打坐，因为怕走火入魔。告诉你们，你不用功的话，魔还不屑来看你呢，这些魔障你不用功还出不来呢。就好像一个男孩子被女孩子看上，那还不容易呢！讲到魔境，有四句重要的话：“不作圣心名善境界，若作圣解即受群邪。”<p>如果你自己认为那些境界没什么了不起，心里不执著，就是好的：相反就是入魔了。这四句话是要点，佛讲到每种魔境都要重复说一遍。所以我经常告诉你们，不管碰到什么境界，都要记住《金刚经》上的一句话：“凡所有相皆是虚妄，若见诸相非相，即见如来。”换句话说，你若用得好，对魔境不执着，不被它骗走，魔境是你进步的一种考验，是一种好事情。等于我们做人、做事业，如果没有艰难困苦你就不会有进步。受到艰难困苦，你仍然不被魔住，那你就超脱了。“若此清扰熠熠元性，性入元澄，一澄元习，如波澜灭，化为澄水，名行阴尽。是人则能超众生浊。观其所由，幽隐妄想以为其本。”这个有动力的行阴很清，可是也很扰乱，它无形无相，可是又有一点形象，有一点影子，好象黑夜里一点亮光，它似亮光又非亮光。如果这个根本源头的性质不动了，好象没有波浪的，永远干净，一澄到底的水那样，就是行阴尽了。这时候没有呼吸了，很久才有一下，但不是死了。这时可以超越众生浊了，他要发愿来这个世界就可以来，不发愿就可以不来，可以定在那个境界。“观其所由，幽隐妄想以为其本”，这也是一念起的作用，这个念很难懂了，等作结论时再说。“幽”就是看不见的，“隐”就是人世间看不见的，这个妄想有这么一个功能，看不见也摸不着。在这种境界定久了就可以解脱了。光理论懂了还不行，还要功夫到，上面讲到行阴，其实想阴、行阴，识阴都讲了，说到底，五阴就是一念，一个人如果能够把自己一念五阴检查出来，那就不得了啦。</p><p>识阴解脱　超越命浊<p>彼善男子、修三摩提，行阴尽者。诸世间性，幽清扰动，同分生机，倏然隳裂，沉细纲纽，补特伽罗，酬业深脉，感应悬绝。于涅槃天，将大明悟。如鸡后鸣，瞻顾东方，已有精色。六根虚静，无复驰逸。内外湛明，入无所入。深达十方十二种类，受命元由。观由执元，诸类不召。于十方界，已获其同。精色不沉，发现幽秘。此则名为识阴区宇。若于群召已获同中，销磨六门，合开成就。见闻通邻，互用清净。十方世界及与身心，如吠琉璃，内外明澈。名识阴尽。是人则能超越命浊。观其所由，罔象虚无，颠倒妄想以为其本。（二○四页）汝等存心。秉如来道。将此法门，于我灭后，传示末世。普令众生觉了斯义。无令见魔，自作沉孽。保绥哀救。销息邪缘。令其身心入佛知见。从始成就，不遭歧路。（二○九页）</p><p>识阴区宇前的行阴尽现象“彼善男子，修三摩提，行阴尽者。诸世间性，幽清扰动，同分生机， 倏然隳裂，沉细纲纽，补特伽罗，酬业深脉，感应悬绝。于涅槃天，将大明悟。”这里和前面一样的，你都还在那个定慧等持（平等保持）的三摩地境界，现在新的翻译也叫三摩钵地。现在讲到行阴尽了。其实呢，如果你真正懂了般若《心经》，“无无明，亦无无明尽”，你就知道，也无所谓尽与不尽，行阴也是本体的功能，重点是你要转化它，就好象一个机器在转动。所谓转化就是把它停住，其实也不是停住，就是非常慢，静态的意思。慢其实就是很快。好比说以物理学的原理来讲，宇宙运行速度很快，可是我们感觉起来却很慢。所以行阴尽是这么个意思，当然无所谓尽与不尽，这里之所以用“尽”这个字，是为了讲话方便。世间万有生命的就是行阴的作用，“幽清扰动，同分生机”是形容行阴的动性。所谓“幽清”是说它是看不见的，但有个东西在起作用。所谓“同分生机”就是说在没有成佛以前，大家都共同有这么个东西，这就是业力，也叫业气，也就是投胎、转胎这个东西。“同分”就是共业。显教一般叫业力，一股力量的意思，密宗比较注重形象，叫业气。这时，行阴“倏然隳裂”，啪！一下就打开了，破掉了，就好像物理上讲的爆炸开了，与虚空合一了。这里这个倏然用得很好。“沉细纲纽，补特伽罗，酬业深脉”是说，行阴平常都沉得很深、很细，像螺丝钉钉在那里，无法转动，都生锈了。“补特伽罗”就是生命一出来，就有的那个我执，我们入胎觉得有个我，刚生下来的婴儿也觉得有个我，双胞胎也会抢奶吃，都是只管我，不管他人。为什么叫“酬业深脉”呢？这个我执是天生俱来的，也就是业力形成的第七识这个我，在世界上轮回，善有善报，恶有恶报，不善不恶有不善不恶报，都是业力，所谓轮回就是还那个业力。这个东西像脉络一样很深，停不了的，所以叫“深脉”并不是说真的一条脉，是形容它像一条脉。现在倒转来讲，中阴身其实就是业力形成的，中阴身就是幽清扰动，沉细纲纽的那个东西。所以修行人，如果不能把业空掉、切断的话，死了以后还会反复，还有报应，该投胎你就躲不掉，还是要来，就像磁石吸铁一样，一感应就把你吸过来了，你就入胎了。这里是说你修行到这一步，行阴尽功夫到了，“感应悬绝”，能够隔离开来，自己作主，不受业力影响了，这时你“于涅槃天将大明悟”快要开悟了。修行到这里最难了，行阴难看清楚，不是光靠知识就够的，非功夫到不可。所谓功夫到，并不是另外产生个什么，那个清净的涅槃境界是你本有的，涅槃就是自性那个境界，常乐我净，不生不灭。讲教理的人说：禅宗有人参话头开悟了，那是你所理解的那个悟，你要功夫真悟了，非到行阴不可。当然五蕴里最重要的还是想阴，想阴一念空了，行阴慢慢跟着就上了，所以五蕴中想阴在中心，很厉害。想阴与第六意识有关，你要第七识无我，还是要靠第六意识来转，玄奘法师《八识规矩颂》说“六转呼为染净依”，凡夫叫染依，会染污一切善恶，第六意识想阴转清净了，才能转成净依，才能进入行阴，把第七意识转了。<p>从行阴到识阴“如鸡后鸣，瞻顾东方，已有精色。六根虚静，无复驰逸。内外湛明，入无所入。深达十方十二种类，受命元由，观由执元，诸类不召，于十方界，已获其同。精色不沉，发现幽秘。此则名为识阴区宇。”佛讲到这里给大家作了一个比方，说修行到这个时候“如鸡后鸣，瞻顾东方，已有精色”。我们先看这个文字，现在年轻人翻译这种经典，一定会错。这里为什么会用“如鸡后鸣”呢？鸡叫不就天亮了吗？你们全错了！因为你们没有听过鸡叫，鸡第一次叫大概是夜里三四点钟，天还没有亮，等最后一次叫快天亮了。修行到这里就好像被鸡最后一声叫醒那个时候，看看东方已经有一点亮了，这时行阴快要宁静，快要转过来了，自性的智慧光明出现，快要见道了。这一段是讲行阴到识阴境界的过程，下面就要讲到识阴了。“六根虚静，无复驰逸”，这时眼耳鼻舌身意这六根，随时随地都在宁静定境之中，外界来的事物都知道，但不会跟着它跑，即便不要定也是在三摩地的境界。我们平常人不同，眼睛看见一个影像就会跟着跑了，眼识也跟着转了。耳朵听到一个声音，意识也会跟着跑了，有人喜欢音乐，身体都会跟着摇起来，要跳舞了，像马一样奔驰放逸掉了。这时你“内外湛明，入无所入”，身心内外像水一样湛清，清到极点，内外似水晶一样透亮。此时外界境界通过六根进来，等于没有进来一样，没有被黏住。这时你就能够“深达十方十二种类，受命元由”你能深深通达十方世界，知道十二类众生的“受命元由”，知道为什么有的会变人，有的会变狗，变老鼠，你能把那些因果看得清清楚楚。“观由执元”，我们生命的来源都是因为起心动念来的。“由”就是“因”，“执元”就是本来的源头，我们把它抓得很牢。“诸类不召”，修行到这个程度，如果自己不想转世入胎了，即便是马上晓得自己一念动可以生在无色界天，也可以不去了，自己甚至会笑自己怎么会动这么个念头。这时，六道轮回、十二类众生，对你已经没有那个吸引力了，已经不能感召你了。这时，“于十方界，已获其同”。看十方世界，一切法界，虚空无尽，都看得很清楚。“精色不沉，发现幽秘，此则名为识阴区宇。”一切都空了，一切妄念都平静了，想阴也不起，受阴也无关，色阴变化就更不理了（但是一切都知道，心里很明白），行阴也宁静了。此时，你才会发现有一个东西，叫唯心，那个心意识动了会变成物质的，返本还源，那个物也归到精神。这时，你才发现生命那个看不见的秘密，你才晓得心意识的功能有这样的厉害，这才算进到了识阴区宇。识阴区宇也有十个岔路，十个魔境。识阴里面的魔境就很严重了，以这个来讲，声闻、缘觉，罗汉，也都还属于外道。声闻缘觉都是佛的亲传弟子，但只看到了一半，只看到了“空”，没看到“有”。其实准确地讲，这十个并不是魔，前面的四十个都是魔境，这十个是外道，门外汉，还没有认识到生命的本原。</p><p>识阴尽的境界</p><p>若于群召已获同中，销磨六门，合开成就。见闻通邻，互用清净。十方世界及与身心，如吠琉璃，内外明澈。名识阴尽。”“若于群召已获同中”，这时的定更清净了。所谓定，就是把混乱的水变得清净又清净，等于化学提炼到达清净的极点。这时的定已经进入慧中，知道一切众生是共同一个东西来的，一个本体来的。这个东西在凡夫叫阿赖耶识，对大彻大悟的人就叫如来；如来藏就是涅槃，我们现在就叫它本体吧。我们一般人习惯的会用自己的六根（六门），眼睛会看，耳朵会听，鼻子会呼吸闻香臭，舌头会尝味道，身体会感觉，意识会思想。但到这个时候，“销磨六门”，无所谓分成六个作用了，就是一个“合开成就”。所以《楞严经》上面提到，很多众生无目而视，不用眼睛就可以看东西；不用耳朵就可以听声音。比如蝙蝠在夜里飞，它没有眼睛而是靠感觉（声觉）就能分别得很清楚。所以修行成功了以后，“合开成就”六根合拢一起用，鼻子可以当眼睛看，耳朵可以当鼻子闻，就不受我们平常习惯约束了；可以分开来用，也可以合拢来用，随便你选择，这是大神通了。其实也不是神通，而是生命本来具有的，你找到根源后就可以随便用了。功夫到了，“见闻通邻，互用清净”，眼睛不用开已经看到了，耳朵不用听已经知道了，这就是互用清净。这个时候，“十方世界及与身心，如吠琉璃”，整个空间、法界、无量的虚空，以及我们个体生理、心理，都像水晶一样，“内外明澈”里头外面通明。这个时候才到“识阴尽”。所谓“尽”，是形容，无所谓尽与不尽。“是人则能超越命浊，观其所由，罔象虚无，颠倒妄想以为其本”。到了识阴尽的人，心意识道理完全搞清楚了，可以超越命浊了。我们的生命很浊，自己作不了主。父母生孩子，无法命令他来；孩子来投胎，也没有办法自己作主，莫明其妙，糊里糊涂就进来了。所以生命很浊，一切无明，而且来的时候，还要靠精虫卵脏，靠基因的演变。<p>　 据密宗讲，莲花生大士（释加牟尼佛转世）再来的时候，不经过男女关系不经过娘胎，是在莲花苞中间，嘭的一声，就出来了一个小孩，这就是超越命浊，可以自己作主了。这也等于道家有两句话：“散而为气，聚而成形”。这个“ 气”也还是形容，意思是说可以空掉，你找不到它在哪里，它散到虚空之中；但只要念头一动，就马上可以有个形体，要变人或者菩萨，或者癞蛤蟆，只要一念就能“聚而成形”了。“观其所由，罔象虚无，颠倒妄想以为其本”。识阴境界的根根就是“罔象”好像有那么个作用。比如我们的思想，一生下来就有了，你说它是个什么东西呢？现在科学研究都说思想是脑波的反应，过去大家讲是心的作用，都没有一个定论。你不要以为思想一定是脑的作用，它这个东西是“罔象”没有现象，没有个实体，是虚无的，但它有这个作用。思想其实就是心意识的作用。众生都被这些东西给骗住了，“颠倒妄想”都在妄想之中，把假的当真的，不晓得真的是什么。我们认为现在一切生命的有，思想的有都是真实的，所以当空真的来的时候就害怕起来了，认为没有了，所以是颠倒妄想以为其本啊！<p>　 这里为大家补充说明一点。佛学总称这个世界为五浊恶世。这个世界上的人思想都不好，这是见浊。这个世界的众生到处都在争，这是众生浊；这个世界上的众生每天都在痛苦烦恼之中，这是烦恼浊；我们的命本来不好，靠精虫卵脏，现在甚至用试管婴儿，都是脏东西做的，所以叫命浊；这个世界几千年来随时战争，随时死人，随时有问题，这是这个时代的劫数，这是劫浊；佛说娑婆世界是五浊恶世，没有一样是好的，到处都是烦恼、痛苦、病痛。学佛修行本来是要解脱这些痛苦，但现在很多人是越学见越浊，烦恼越浊，命越浊，不学佛修道还好一点。<p>　 “汝等存心。秉如来道。将此法门。于我灭后，传示末世。普令众生觉了斯义。无令见魔，自作沉孽。保绥哀救。销息邪缘。令其身心入佛知见。从始成就，不遭岐路。”<p>　 五蕴讲完了，佛接着说：你们要发心啊，抓住我讲的佛法道理，五蕴解脱法门。当我死了以后，把它传给后代众生，让众生普遍懂得这个修持的道理。有些人自以为有些特别功夫，你们要帮助那些众生不要见魔，不要自己作弄沉沦造孽。注意，这里佛用的是“自作沉孽”的“孽”字，而不是“业”，业有善业、恶业、不善不恶业，孽就不同了，孽完全是坏的。所谓“见魔”是指见解上的错误，这里是说要帮助众生得到佛的正知见。你们要“保绥哀救”，保护大家平安，要救他们啊！“绥”就是平安，“哀”就是大慈大悲；“销息邪缘”，要帮助他们不要走错了路；“令其身心入佛知见”，使他们身心进入佛的正知见；“从始成就”，从一开始就走这条大路（正路），“不遭歧路”，不要走岔了路。<p>　　　<p>五阴解脱总结</p><p>精真妙明，本觉圆净。非留生死及诸尘垢，乃至虚空，皆因妄想之所生起。斯元本觉妙明精真。妄以发生诸器世间，如演若多，迷头认影。妄元无因。于妄想中，立因缘性。迷因缘者，称为自然。彼虚空性，犹实幻生。因缘自然，皆是众生妄想心计度。(二一一页)这一段，佛讲本体起用，讲体与用的关系，很精要，等于密宗里红教的《大圆满》，或者白教，花教的《大手印》。“精真妙明，本觉圆净。非留生死及诸尘垢，乃至虚空。”他说一切众生本来自性是最“精”致最“真”实的。精真是形容词，不要误以为真有个什么东西。这是说众生本来明白，一切众生本来是佛，“本觉”，一切众生本来就有，只是他迷糊了。众生的本来自性是能够成佛，本觉的，是圆满清净的。“非留生死”，生死没有留痕迹，“及诸尘垢”，一点尘埃都没有，就像《心经》上所说的：“不垢不净，不增不减”；乃至虚空，本觉里头也没有什么虚空，虚空也是个假象，物理世界乃至理念世界的虚空都是假象；“皆因妄想之所生起”这些假象都是众生自己妄想生起的。“斯元本觉妙明精真。妄以发生诸器世间，”“斯”，就是这个，“元”就是根本的。这个根本的本来是佛，是“本觉”的，本来就是觉悟的，妙不可言的，它本来明白，来本就是精致的，真善美的。“妄以发生诸器世间”妄想一动，才形成了物理世界、物质世界，乃至这个宇宙。“器世间”就是物理世界、物质世界。唯物是唯心变来的。妄想心怎么会变成物呢？这就要配合现代科学哲学来研究了，人类正在往这方面走，但还没有研究通。“如演若多，迷头认影”演若多是一个人的名字。《楞严经》上讲到，佛在世的时候，城里有个疯子叫演若多，他早起来照镜子，越照越觉得自己漂亮，照了半天，慢慢的，他突然觉得自己的头没有了，就变疯了，到处找：我的头呢？我的头呢？他的这个疯病等到什么时候才会好呢？佛说，等到有一天，他再去照镜子：我的头原来就在这里啊！他就又好了，不疯了。这里是拿演若多作比方，说众生都像演若多一样，以为真的有个什么，是迷头认影。大家都像那个活宝演若多一样，自己头本来就在身上，却对着镜子照影子，自己以为头掉了，就疯了。也就是说，众生本性本来就在那里，却拼命修行啊，明心见性啊，向外找一个东西，所以叫“迷头认影”。再比如说那些练气的，你生命中本来就有气啊！你没有气就死了，还要外面的气做什么？这也叫“迷头认影”。讲到这里想到密宗有个修法是对镜子修的。你把四面上下都安上玻璃镜子，用眼睛盯着看，慢慢的，自然就看见自己是个影子，慢慢地看见自己没有头了，也没有身子了。这个方法不能随便修，容易得离魂症。但是，如果你修好了，可以把自己空掉，灵魂可以自由了。这个不能多讲，只露一点点给你们。“妄元无因。于妄想中，立因缘性。迷因缘者，称为自然。”众生的这个妄想是没有原因的，你们常问：“哎呀！我的这个是什么原因来的？是没有原因来的，本来就这样，本来没有原因，但为了表达给大家听，就讲一个因缘，说许多因缘凑合拢来就有思想啦！现在心理学分析一个人的心理，会牵扯到社会的因素，家庭的因素。那都是心理学家说的，其实那些因素本身就是妄想。佛法认为因缘分两种：亲因缘和疏因缘，任何东西都是相对的，都是很多因素构成的。既然很多因素构成了一个事物，那把这些因素都分析了以后，不就没有个东西了吗？所以佛法在妄想中立了一个因缘的道理。缘生本空，靠因缘凑拢来的本来就是空的。比如说一个木头做的桌子，是靠了人工、木头等等因缘而变成了一个桌子；木头本身又是靠种子、泥巴等等许多因缘凑拢才有的。这些都是因缘的现象。其实因缘本身是个方便，佛是为了给你分析问题才提出来的。从哲学学派的角度来讲，有的人不懂因缘，走的是唯物论的路线，认为这个宇宙是自然的，万物是自然生出来的。宗教家则认为是上帝啊、天啊造就了一切。“彼虚空性，犹实幻生。因缘自然，皆是众生妄心计度”。这个宇宙、生命、虚空，其实没有个东西。你说没有吗？它也有。好比说电灯的光，也是幻象，它是靠电配合我们的眼睛这个因缘才有光可以看见，实际上分析起来中间没有任何东西，都是空的，一切都是幻生幻灭，能生能灭的那个东西是本来清净，没有动过的。所谓因缘所生，或者自然来的，那都是些狗屁的理论。“皆是众生妄心计度”都是众生自己的妄想、思想，美之名曰学问、道理、修道，其实都是自己的妄想在那里估计、推测。“度”就是推测，“计”就是计算，佛自己讲因缘，又推翻了因缘，也推翻了自然。阿难，知妄所起，说妄因缘。若妄元无，说妄因缘，元无所有，何况不知，推自然者。是故如来与汝发明，五阴本因，同是妄想。（二一一页）是五受阴，五妄想成。汝今欲知因界浅深。唯色与空，是色边际。唯触及离，是受边际。唯记与忘，是想边际。唯灭与生，是行边际。湛入合湛，归识边际。此五阴元，重叠生起，生因识有。灭从色除，理则顿悟，乘悟并销。事非顿除，因次第尽。（二一二页）“阿难，知妄所起，说妄因缘。若妄元无，说妄因缘，元无所有”佛接着说：“阿难啊！我告诉你啊，因为知道有个妄想起来，你们拚命问妄想是怎么起来的，我就只好回答你，说妄想就是因缘所起。但“说妄缘无”妄想本来没有啊! “说妄因缘，元无所有”，妄想哪有什么因缘啊？妄想就是因缘，妄想本来空的嘛！我说妄想是因缘所生，那也是为了方便，理论上说说而已啊！“何况不知，推自然者。”佛问阿难：现在你懂了吗？你还是不懂啊！更何况那些不知道这个道理的人呢？他们推测有个自然的作用，以为生命是自然来的。自然又是个什么东西呢？你说是自然，虚空能掉下个人来吗？你还不是要经过精子、卵子结合才变成一个人！其实自然是个假说，因缘也是个假说，都只是名称而已。“是故如来与汝发明，五阴本因，同是妄想。”<p>所以佛明白的告诉你，五阴的本原都是妄想来的，你真正懂了这个，就悟道了。“是五阴受阴，五妄想成。汝今欲知因界浅深。唯色与空，是色边际，唯触及离，是受边际。唯记与忘，是想边际。唯灭与生，是行边际。湛入合湛，归识边际。”这五个阴都是妄想所成的。佛很慈悲，又进一步为我们分析它的“因界浅深”，它的成因与范围。色与空是色的边际。触就是接触、感觉，离就是分开了。比如我打你，你就有触痛的感觉，分开来触受就没有了，所以触与离是受的边际。记忆与忘记是想的边际。所以禅宗祖师讲，不要妄想，妄想一放就到空了，忘掉也就是丢掉。这个“忘”字加个心不好，应该用古文的“亡”字，亡就是丢掉，没有了，不记他了，不念他了，是想的边际。灭与生是行的边际。识阴的边际最难明白了，“湛入合湛，归识边际”你不动念，本来就清净，能回到那清净的本位，就是识阴的边际了。<p>“此五阴元，重叠生起。生因识有，灭从色除”<p>色受想行识这五阴都是一念来的，没有次序的，他们互为因果，重重叠叠，我们的生命来的时候，就是靠那么一念动了，阿赖耶识变成中阴身来投胎，然后又和精虫卵子一起，像搅牛奶一样这么一搅，就进去了。但你要解脱的时候，嘿，你还是要从“色除”，还是要从四大身心变化，气脉，拙火处着手，你还是要转化色阴。<p>“理则顿悟，乘悟并销。事非顿除，因次第尽”<p>真正有大智慧的人，一懂了这个道理就空掉了，就进入了佛境界，所以叫“乘悟并销”。如果你智慧不够，道理虽然懂了，但力量还不够，你还要“因次第尽”一步步，一点点来，庵提遮女问文殊菩萨也是这个问题：“师父啊，明知道生死是空的，却就是被生死之流转动了，跳不出来，这是怎么回事呢？文殊菩萨回答说：“其力未充”道理你虽然懂了，但上起座来你就是放不下，空不掉。所以要渐修，你要一点点做功夫才行。</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "附录",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>说明<p>讲课期间，根据平常的习惯，课余我们还经常就课堂上不清楚的问题继续请教怀师，有时包卓立同学甚至还用他半生不熟的中国话，直接与老师沟通，说出几个关键的字，用身体作一个动作，然后问老师：“是不是这样？”“是不是这个意思？”有时候，我们旁边的人不是很明白他在说什么，但老师会笑着告诉他对或者不对。那种情形也真是十分的有趣，当然，这种沟涌方式也可能导致了一些理解上的偏差。<p>老师课余的开示只是点到为止，没有长篇系统的论述，而且也没有录音。我们根据这些课余开示，以及我们自己平时修持的心得，就上下册分别整理出两篇附录，希望对广大读者能有所裨益。文字内容多是拾老师牙慧，并非完全自己的发明。但如有不准确的地方，咎在我等，敬请各位先进不吝赐正为感。<p>包卓立 赵海英（佩瑜）<p>二00三年九月四日晚于北京<p><p>关于五蕴<p>掌握五蕴的道理对修行非常重要，但一般人都不喜欢学习五蕴。觉得很枯燥。这主要是因为，大家不知道如何把五蕴的道理应用于实际修持，用于理解自己修行的各种经历，判断自己修行进步的程度，而把它当成了纯粹学术的理论探讨。从前面的讨论我们可以看到，那些发光动地的境界，都没有超过五蕴的范围，甚至都没有超过色蕴与受蕴的范围。生命就是一个五蕴，那些现象也都是生命本来就有的功能，没有什么神秘的。那些脑海里出现的光啊、佛啊、身体感觉的暖啊、乐啊等等，不过是色受想行识五蕴互相交感的影像反应而已。且不说一般人修行打坐的身心感受，即使你得了各种三摩地的境界，那也不过是五蕴的作用，意识的幻象而已。放下对五蕴的执著，方能寻得本心。一切现象和境界都是暂时的存在，如梦幻泡影。但大家太执着于修行路上的风景线，因此迷失了本心。佛在《楞严经》上说，“现前纵得九次第定，犹是法尘分别影事”。佛苦口婆心，把五蕴的道理做了仔细的分析，把各种境界和现象的范围作了详细的分类，就是为了让我们知道这些现象都是心外之物，别受骗上当，正所谓“频呼小玉原无事，只要檀郎认得声”<p><p>关于净色<p>五蕴的理论中提到净色一词，现代科学还不知道净色到底是什么，净色是比基因，DNA更基本的物质，它也是由四大及空大组成的。净色只存在于生命组织中，像其它生命那样，它也有生老病死。通过静坐，使净色更充满和健康，所以身体感觉会更加灵敏。现代科学一直在寻找心与物的连接点，净色即是这个连接的关键所在。事实上，我们的眼耳鼻舌五根的生理组织弥漫着净色，因此五根才能与五识一起配合起作用。以后，科学会知道到什么是净色，目前，只有那些得到很高三摩地境界的人，才能认识到什么是净色。譬如说，当修持者感到全身细胞都在喜乐境界的时候，就等于说他全身的净色都启动了。净色弥漫于我们的色身之中，每一个细胞都可以变成一个佛，佛经中有很多这样的描述，修持报身成就就是把每一个细胞都转化成净色，这是修行的一个大秘密，西藏密宗也没有把这点指出来。一切贤圣皆以无为法而有差别前面介绍的很多三摩地境界和现象，在其它宗教中也有类似的记载。其实不管你是佛教还是基督教、印度教、伊斯兰教、犹太教、神道。小乘佛教、大乘佛教、显教、密教、道家、儒教，或者任何其它宗教，只要你专心修持，都可以达到四禅八定的境界。四禅八定是共法，是各种三摩地境界的概括，代表不同的心的清净程度。所有宗教的圣者都有三摩地，否则他们不可能成为历史上的圣人，就像《金刚经》说的，一切贤圣皆以无为法而有差别。不管你信仰什么宗教，只要你进入一定的禅定境界，都有可能发生各种各样色身的变化，这些现象并不神秘，生命本来就有这些功能。譬如前面提到过的神尼传中的故事，入定以后，手可以像面筋一样越拉越长，西方天主教的修女也有类似的记录。譬如说拙火，其它宗教描述的没有佛学这么详尽。但也有类似的说法。在印度教叫“SHAKTI”，也就是精神力量的意思；伊斯兰教的苏非派叫分离之火；基督教则叫神火。再譬如说轻安的境界，在基督教神秘学里，也有与轻安类似的概念，他们叫“洗足”，因为当轻安从足部发起时，感觉就像清风或柔软的清凉之气从脚上飘过。这种境界与性交所产生的喜乐截然不同。轻安境界开始出现的时候，脑下垂体会分泌有点甜味的荷尔蒙，有利身体健康。在希腊古文化中，这被称作“神的食物”；印度最古老的吠陀教派，称为甘露；在中世纪基督教神秘学派，称为圣酒；在密教经典中称为神酒；在伊斯兰的苏非派禁欲神秘主义教派，称为甜酒；还有很多其它各宗各派，包括中世纪的炼金术，都称此为长生不老的仙露。印度吠陀教义的《奥义书》这样描述这种境界；当生命之火已经点燃，生命的气息已经自在可控，甘露已经在身内流动，这时心才出生。这里描写的就是呼吸已止，甘露已生，即将到达三摩地的炼精化气的过程，所以，世界上的各宗各教都是相通的，只是描述的方法和精细程度不同而已。再譬如说空无边处定的境界，这是一个有形的空的境界。一切思绪妄念都没有了，只有一个无障无碍、无量无边的虚空。印度教大师阿什塔夫（ASHTAVAKRA）自己亲身经历了这个境界，他描述说：“我就像虚空一样无量无边，宇宙就像一个大容器，被虚空围绕，被虚空充满；不须放下、接受、或销落什么，这就是智慧；没有黑暗，没有光明，也没有停止，这里根本就是空无一物；没有天堂，没有地狱，甚至也无所谓解脱。修道人眼前无有一物。<p>　　　　　　　　　　　　　<p>唯识五位<p>以唯识的分类，修行有五大阶段：资粮位，加行位，见道位，修道位，究竟位。一个人要想修行，首先要积累功德智慧的资粮本钱就像开公司赚钱，首先要投资一样。至少要积德行善，严守戒律，不放纵欲望。积累了足够资粮，然后才到加行位。到了这个阶段，修行者开始精进的修持气脉拙火，修持各种三摩地及智慧，为见道位打下基础。只有通过三摩地和智慧的修持，才可能截断妄想，识得空性；没有三摩地的定力，不可能真正见道。前面介绍的那些气脉修持成就以及拙火，不过是加行位而已，只是为明心见性打基础，还没有见道。只有见道以后，才谈得上真正的修行，这之前的修持不过是为见道所作的准备工作而已，正如禅宗五祖说过的“不识本心，学法无益”。但即使见道了明心见性了，仍然要悟后起修。所以叫修道位。最后一切圆满了，得到了法身、报身，化身三身成就，才是究竟位，才是真正成佛。不管是禅宗、印度教、伊斯兰教、犹太教，还是基督教，都要遵守这个基本的修行次第。只有见道以后，才知道如何是真正修行。当然，各人根基不同，修行次第的表现形式不同，根器好的、智慧高的人，可能很快就可以直接见道，而不需经过前面的气脉修持。有的人有很高的气脉成就，也有拙火境界，基至各种神通，他们修持的功德很大，死后可能会转到很高的天人境界，但这不代表他们已经见道。见道是智慧的成就，那些功夫境界是共法，明心见性才是佛法独有的。<p>四禅八定与三界天人<p>以佛法来看，众生痴迷。不断在三界中生死轮回，而修行就是要跳出三界外，不在五行中。所谓三界指的是：“欲界、色界、无色界，色界比欲界清净。而无色界比色界更清静。用现代科学的语言来说欲界是一个物质的世界，色界更接近于一个能量的、物理的世界，而无色界则好比是一个更高层的精神世界。欲界众生最根本的烦恼之一是性欲，色界天天人已经没有性欲的缠缚。我们人类属于欲界众生，当你修行达到四禅定的境界时，你的心就跳出了欲界，与色界天天人的境界一样了；当你达到四空定的境界时，你心的境界就与无色界天天人的境界一样了。达到这些禅定境界的修行人，他们身在这个世界，但心的境界已经与天人相合一了。初禅境界与道家的精气神修行次序又有什么关系呢？初禅已经超了欲界天，所以，要想达到初禅境界，首先要能作到解脱性欲、不漏精，在道家这是炼精化气的阶段，正是因为“精”充满了才能达到初禅的身心喜乐境界。也可以说，此时你身体的细胞都转化成净色了，都充满了生命本来的能量，每个细胞都在快乐之中。在炼精化气的境界，气机已经达到大脑，烦恼妄想减弱了。密宗说，精不降则乐不生；道家说，炼精化气，精满不思淫。把这些说法与我们上面讲的联系起来，那么初禅的境界与精、气、神的转化一定是密切相关的。同样的，双修的目标必定是通过修持拙火、空乐双运，从而达到以欲除欲，并进一步进入初禅境界。注意。初禅境界已经超越了欲界天，属于色界天了，所以不同的宗派的修持方法其实是相通的，一个智慧的修行人要学会融会贯通，举一反三。根据历史记录，古时的基督教圣人和一些其它修行者都曾经进入到一种“极喜”的境界，事实上，众生对自己的身体以及这个世界上的一切都抓得很紧不肯松手，如果能够一念放下，放下对身心感受的执著，甚至放下身体这个念头，身体内部气的流动将更加通畅，你自然就会体验到身心的喜乐。从这里也可以看到，身心是一体的、合一的。达到初禅境界并不见得能够解脱受阴，因为还有喜乐，只是说此时是乐受，不是苦受了。<p>如何修持达到二禅的境界呢？熟练掌握初禅境界后，用你的般若智慧观察那些更微细的心理结使和妄念，慢慢把这些微细的烦恼也放下，就能进入二禅了。在这个过程中，你可能觉得自己没有什么进步，其实就像黎明前的黑暗，只要不执著于初禅的境界，不断的精进下去，就是黎明，就能到达更深、更细、更清明的二禅境界了。<p>从色身转化的角度来讲，初禅境界对应的是道家“炼精化气”阶段，二禅境界对应的则是“炼气化神”的阶段，此时已经可作到气住脉停，气已止，脉已通，已经不需要口鼻的呼吸，身体所有的细胞都可以呼吸。道家名言：气满不思食，神满不思睡，所以如果要修持道家的辟谷（禁食）最好是差不多达到初禅以后。当然，佛家与道家的修持境界不能绝对的一一对应，我们只是想说明，各种不同的修持方法其实是相通的，互相有关联的。同修持二禅的境界一样，要想达到三禅的境界，需要在二禅的基础上，用你的般若智慧观察那些更微细的心理结使和妄念。在初禅和二禅境界，既有心理的喜受又有生理的乐受。到了三禅境界，智慧已经能够观察到“喜”亦是尘，放下“喜”之束缚执著，即进入一个更清净的境界。三禅叫“离喜得乐”，仍有生理的乐感，仍是色阴与受阴境界，但这种乐比初禅、二禅更加微妙，非欲界众生那种粗乐感可比。三禅境界对应道家之“炼神还虚”阶段，心境更空灵了，此时甚至脉搏都会停止了。<p>　四禅境界比前面三禅更清净，初禅到三禅仍在色阴与受阴境界，四禅已经跳出色阴与受阴的束缚，开始修持想阴了。一切喜乐境界都离不开第六意识的分别作用，到四禅境界，只有极细微的妄想及很淡的我执，很多阿罗汉由此境界证得解脱。从另一个角度来讲。我们也可以说初禅是“有寻有伺”境界；到二禅与三禅是“无寻有伺”境界，一知便了；到了四禅则是“无寻无伺”境界，下面要讲的各种空定境界也是“无寻无伺”境界。不过，这些仍是小境界的“无寻无伺”不是大境界的“无寻无伺”（编按：此段所说为别部传承）前面讲过，四禅的定的境界是分层次的，越到高层，定的境界就越大，所以修持时要按照一定的顺序，先从较粗的初禅、二禅、再到三禅、四禅逐步达到更微细、更广大的禅定境界。但四定不同，他们都是属于无色界，不能说哪个定境更高，只能说他们各有自己的定的特征，修持时也没有什么固定的顺序。当然四定在功夫修行的层次上有微细的不同，起观的物件目标也是不同的，也可以勉强按清净的程度排列。另一方面，四禅对应的是色界天的境界，四定对应的是无色界天的境界，因为无色界高于色界天，我们可以说四定高于四禅，但从一个意义上来说，我们也不能机械的说无色界比色界天境界高，他们就像盐与糖，只是不同而已。<p>成道的障碍<p>障碍我们得定的因素很多，总的来说贪嗔痴慢疑五毒是最基本的障碍。这五毒是众生基本的习气结使，会时时刻刻生出各种各样的烦恼与障碍。正是这些烦恼与障碍将众生紧紧束缚，使众生不能得定。譬如说，打坐有进步，身体会生出乐感，但众生对身乐感的贪恋会障碍你进入更高的定境，使你无法进步。有人甚至因为身体好了，反而生更强的欲念，身体积累起来的一点能量化作一江春水向东流。除了上面讲的五毒以外五见也会障碍我们得定，进而得道。所谓五见是指身见、边见、见取见、邪见，戒禁取见。要想得定，进而得道，需要有正确的见地，见地对了，修行才能上路，但只有通过修持禅定，才能有心灵深处的转化。否则你的转化都是不持久的、不深刻的。譬如达到初禅境界的人，虽然还没有完全空掉身见和我见，但身见、我见已经比较淡了、薄了；虽然还没有完全空掉贪念、嗔念，但已经很淡了。而且已经没有欲界众生的欲念了。智慧需要“定水”滋润，所以要想修行悟道，四禅八定是基础，不管你是那种宗教，要有所成就，都必须修持三摩地，所以四禅八定是共法。但如果你不通教理，则很容易走入处道，所谓外道就是不识本心，心外求法。现在西方流行的催眠状态以及萨满教的“出神”状态都是外道。他们无法控制自己的精神意识，与修道根本是风马牛不相及，还有人追求灵魂出窍（OOBE）、通灵等等，这些人都是在精神病态的边缘，对身心都会造成伤害。<p>密勒日巴，甘波巴，移喜磋嘉，玛吉瑙准等西藏大师都修习过各种禅定法门，得定以后，他们继续精进，三摩地境界不断深化，直至亲证无上道体。其实，自心本来清净，常在定中，一切三摩地也都不过是本心清净的自然流露，众生来来在定中，只因颠倒妄想不能证得。因此，修行的一般次第是，首先证得空定，然后以此为基础，粉碎一切束缚，证得本心。修持三摩地是修行的基础，《金刚经》说，“一切贤圣皆以无为法而有差别”，没有空定为基础免谈修行成就。<p>五见也叫见惑，会迷惑你的那些思想、见地；五毒也叫思惑。《楞严经》说：“理则顿悟，乘悟并销；事非顿除，因次第尽。”一般人即使见地对了，也还要经过长时间的修持才慢慢除掉思惑。当然智慧真正到了的，思惑自然也就解除，就像我们前面提过的大禅师们，他们似乎没有经历过那些身体的变化就悟道了，那是因为他们多生累世积累的戒定慧的根基深厚了，在道理上一下就悟道了。<p>许多大师如印度的拉摩克利斯那（RAMAKRISHNA），瑜珈那达（YOGANANDA），目坦那达（MUKTANANDA），他们都有一定的三摩地功夫，有的也有一些般若智慧，但他们没有一人是真正悟道的。在西方，有些人如RUDOLF STEINER，EDGAR CAYCE，他们有精神特异功能，但他们没有上面讲的禅定功夫，更免般若智慧和空性，也有人如MEISTER ECKHART，PADRE PIO，他们从未见道，但有一定的禅定工夫，圣经里面的许多先知也一样，虽然有一些定的功夫，但还没有悟道。也有人的我执少一点，不会到处标榜自己悟道了，但却高推自己的功夫境界。比如说，很多人静坐以后身体比较健康了，气机比较充满了，就误认为自己已经达到了空无边处定或识无边处定的境界等等。其实他们都还在色阴里面打转，那些境界只不过是身体气脉摩擦在意识境界里的折射而已。反过来讲，即使你悟道了，你也不见得马上就有在空中飞行或者穿透墙壁的神通，除非你同时修持神通，相反，有人有神通，却不见得有很高的智慧成就，所以不能简单从一个的神通判断他智慧成就的高低，比如说伟大的圣者孔子 ，他从来没有示现过任何神通，而西藏的大修行人密勒日巴，示现过各种神通。当然我们不敢肯定说孔子就一定没有神通，也许他只是不愿标榜神通，而是希望以道德行为教导众生，以免社会大众误入歧途。所以，当弟子问孔子鬼神之事时，孔子很巧妙地回答说：“敬鬼神而远之，可谓知矣”，“未能事人，焉能事鬼？”大儒王阳明也一度很热衷各种神通变化，但他后来领悟到这并没有很大的功德，因此知非即舍。根据柏拉图《对话录》记载，苏格拉底可能也有神通，他能预见未来，但他也从未滥用自己的神通。像孔子一样，他的主要目的是教导人们做人的道理，智慧与行持才是他教导的重点。修行路上歧途很多，所以需要真正悟道的明师指导， 如日本和尚HAKUIN开始修行时，第六意稍清净了一点，得到了一点空的境界，但他以为自己悟道了，没有人比自己更高明了，他回忆说“我的自我意识膨胀的像山一样，我的傲慢心理像大海的潮汐一样淹没了我的觉性”高推自己境界在修行人中是很常见的，因此修行路上要处处小心，观察清楚自己的贪嗔痴慢疑心理结使。幸运的是HAKUIN有一个好老师，DOKYO大师没有印证他的经历，后来HAKUIN还有很多境界，并多次以为自己悟道了，但他从来没有得到DOKYO大师的印证，大师称他是山洞里可怜的魔鬼。所以不自欺欺人是很难的。当你修持到很高的禅定境界的时候，很容易走向歧途，佛在《楞严经》里面把这些歧途总结为五十种阴魔，在修行的路上，佛被考验过，耶酥被考验过，移喜磋嘉被考验过，密勒日巴被考验过，任何认真修行的人都会被考验。所以要切记佛讲的：“现前纵得九次第定，犹是法尘分别影事”，“不作圣心，名善境界；若作圣解，即受群邪”。南师：“销落诸念”，一切杂念自己不起了，注意不是你把它压下去了。“销落”等于下雪时雪飘下来自己化了，杂念都掉下来，杂念自己清净了。“其念若尽”如果你所有的杂念都干净了，清清楚楚了，注意，“其念若尽”，如果你所有杂念都干净了、清清楚楚了，注意，我把念都解释成杂念了，到下一句就清楚了。“则诸离念一切精明”那么你就内心清清楚楚，明明白白，这可不是杂念，不是妄想，很自然的，中间一个杂念都不上来，道家有一句话，“烦恼无由更上心”，此时，外界对你没有任何影响，即使一把枪顶在你头上，你都没有生气和烦恼，来吧，打死就打死吧！比如参禅、念佛、或念咒，开始时杂念非常多，等你制心一处，专心到某个程度的时候，慢慢杂念没有了，就连念咒这一念也没有了，一切杂离念，离开妄想。从现代理生科学的立场告诉你，在这个境界上，气脉一定宁静，气住就达到止息的境界，呼吸几乎没有了，但是还有一点，心脉也快要打开了，所以讲心与物是互相影响的，气脉不调和，色身四大没有调好，杂念思想就不会停下来，气就宁静不下来。。。轻安开始出现的时候，脑下垂体会分泌有点甜味的荷尔蒙，有利身体健康。在希腊古文化中，这被称做“神的食物”；印度最古老的吠陀教派，称为甘露；在中世纪基督教神秘学派，称为圣酒；在密教经典中称为神酒；在伊斯兰的苏非派禁欲神秘主义教派，称为甜酒；还有很多其它各宗各派，包括中世纪的炼金术，都称此为长生不老的仙露。印度吠陀教义的《奥义书》这样描述这种境界；当生命之火已经点燃，生命气息已经自在控制，甘露已经在身内流动，这时心才出生。这里描写的就是呼吸已止，甘露已生，即将到达三摩地的炼精化气的过程，所以，世界上的各宗各教都是相通的，只是描述的方法和精细程度不同而已。首先要能作到解脱性欲、不漏精，在道家这是炼精化气的阶段，正是因为“精”充满了才能达到初禅的身心喜乐境界。也可以说，此时你身体的细胞都转心化成净色了，都充满了生命本来的能量，每个细胞都在快乐之中。在炼精化气的境界，气机已经达到大脑，烦恼妄想减弱了。只有通过修持禅定，才能有心灵深处的转化。否则人你的转化都是不持久的、不深刻的。譬如达到初禅境界的人，虽然还没有完全空掉身见和我见，但身见、我见已经比较淡了、薄了；虽然还没有完全空掉贪念、嗔念，但已经很淡了。而且已经没有欲界众生欲念了。智慧需要“定水”滋润，所以要想修行悟道，四禅八定是基础，不管你是那种宗教，要有所成就，都必须修持三摩地，所以四禅八定是共法。只有通过三摩地和智慧的修持，才可能截断妄想，识得空性；没有三摩地的定力，不可能真正见道。前面介绍的那些气脉修持成就以及拙火，不过是加行位而已，只是为明心见性的打基础，还没有见道。只有见道以后，才谈得上真正的修行，这之前的修持不过是为见道所作的准备工作而已，正如禅宗五祖说过的“不识本心，学法无益”。但即使见道了明心见性了，仍然要悟后起修。最后叫修道位。最后一切圆满了，得到了法身、报身，化身三身成就，才是究竟位，才是真正成佛。<p/></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
}]