[{
    "title": "禅秘要法讲座 01",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>我们今天开始重新讲《禅秘要法》。很多年来，是在我闭关的时候曾经讲过一次，专门对他们几位出家的法师们做正式闭关修持、修法的那个时候讲，讲的时候也很简单，大概把它讲一下。后来，在前年打七的时候，也重新很简单地说过白骨观的修法。白骨观的修法是《禅秘要法》的初步，并不是包涵了《禅秘要法》的全部。</p><p>所谓《禅秘要法》，是包括显教修定做工夫，所谓学佛真正做工夫的奥秘，所以叫做“禅秘”，“要法”是中间最重要的要点。</p><p>我们大家在座的很多人是修净土的、修禅的，乃至于修密宗的，为什么我们现在的人，几十年的经验，很多时间的观察，学佛修道做工夫，本身都没有成就？不要说修道证果，连一个身体都搞不好，恐怕在座的人大部分都在生病中。</p><p>当然了，佛在世的时候，佛的弟子很多也在生病，不能说人无病。但是，一个真正晓得修持的人，至少是减少了病痛，比较起来是健康得多。换句话说，我们修持，对于病痛还不能过关，还抗拒不了、还化解不了、解脱不了，那么，对于我们自己的修持，这是一大考验，这就是个重大的问题。</p><p>再严重的问题，为什么我们修持都达不到一点标准的成果？连个初步的果位都证不到？不过大家在那里静坐而已。所谓静坐，当然有一点点的好处，这个好处是很微小、很微渺的，谈不上、真正的佛法的边都没有摸到。</p><p>我们晓得，这个话要回转来。我在闭关的中间，曾经有一次，我记不得时间了，特别为这一件事情，为他们这几位出家的法师们，在关中又破例出来，讲了三个月的所谓“显密修持的方法”，当然没有讲完，刚刚起头已经三个月到了，没有讲完也就算了。我这个做事的习惯，素来做半截就算了，兴致即来就讲，兴致完了我就不讲了。</p><p>那么，真正的那一次讲，我提出来一个问题：为什么佛在世的时候，我们在经典上看，很多人当场听佛说法、修持，乃至有当下就成道，至少几天修持下来就得果位的，佛经上记载得很多。佛过世以后，很少看到人学佛修道真正证得成果的，太少了。</p><p>那么两个问题，要么佛经是欺骗人的——假设我们相信佛不会说假话，用不着；而且佛经也不是说假话，那么，后世的人所谓业重，究竟是什么原因呢？这是一个科学的问题，拿现在来讲，是个科学的问题，是值得探讨的。</p><p>第二点，我们看到，从东汉以后，佛法进入中国，由汉到魏晋南北朝，一直到隋唐之间，我们看《高僧传》，看各种的传记，各方面的记载，古人证道的非常多，学佛成道的不管男的、女的、出家、在家。到了隋唐以后，所谓大乘的佛法兴盛，乃至禅宗兴盛，说立刻顿悟，我们看到，一代一代下来，佛法佛学越发达，证果的人越来越少，这是个什么原因？是个问题。</p><p>再到了我们现代，也可以说是近代，由西藏跟内地的文化沟通，所谓西藏保守了一千多年的密宗——密宗的修法专门侧重于瑜伽观想、念咒，甚至于说修色身---我们这个身体。密宗大部份中间，修法的要点，侧重在这一方面。但是，据我所知，也曾经遍学了这些法门，除了说某一个古人因此证果以外，现代人几乎没有看到，这又是一个什么道理？</p><p>因此，我觉得必须要回转来，找这个佛法真正修持的意义。所以，我们把三藏十二部看完了，回转去，找佛经里由小乘一直到大乘，结果我发现，我们大家忽略了一个事：佛说法，当时叫我们求证，最基础、最基本的修持方法（是）十念法里头的一种，念身与念死，我们没有留意它。</p><p>十念法，是学佛人的基本。佛法，八万四千法门，归纳起来，在小乘部提出来十念法，念，当然要心里意念，（从）心里的意念开始，十个意念包括了一切的修法，所谓念佛、念法、念僧、念戒、念（布）施、念天、念安那般那、念休息、念身、念死，十念法。</p><p>譬如我们普通讲的念佛，现在流行的念佛是根据小本弥陀经，净土宗三经的小本的弥陀经《阿弥陀经》来的，只要念一声佛号，就叫做念佛。真正的念佛不是这个道理！根据《法华经》，根据各种经典，念佛（的）三十二相、八十种好，是外形，念佛，每一个佛都有三十二相、八十种好；乃至于念佛的功德、念佛的智慧，就是念念不忘在念佛。</p><p>所以，我们大藏经有一本《观佛三昧海经》，对于把释迦牟尼佛的一生，由出家成道，乃至于弘法，各种事情都有记载。使我们深入研究人之所以成佛，是怎么个一条路子。所以，真正的念佛，不是那么简单的。</p><p>至于念法，也不是那么简单，三藏十二部，一切大小乘，显教、密宗，各种佛教的教理要通达，理通达以后，加以实验、修持，这是念法。</p><p>念僧，更不简单。我们念僧（是）光念和尚啊？找个师父来皈依，随便剃了光头，我们一皈依了，天天念他就会成佛？不简单。念僧，就是念佛过世以后，佛的一切悟道的、证道的弟子们；不管他在家、出家，真正修持成就的，都属于圣贤僧的范围。就是说，我们要随时念念以成就的古人、祖师们做榜样，自己加以修持，这是念僧的法门，方法也很多。</p><p>诸如此类，我们先讲了这三念，念佛、法、僧。每一个法门啊，方法都是多得很，不是那么简单。那么，十念中间有念身，念身体这个身。《禅秘要法》的重点主要建立在念身这一法门；但是,《禅秘要法》包括了十念法门，都包进去了。</p><p>而《禅秘要法》首先的建立……我们看佛的十念法，最后一个是念死，把死摆在最后。所以我们晓得，近代净土宗的大师印光法师，他个人的关房里头也没有供佛、也没有供菩萨，只供了一个字，写得很大---“死”，一抬头就看到这个字，念死很重要，学佛第一步要念死。不要觉得自己前途无量，后途无穷，我们要心心念念晓得随时会结束这个生命，随时随地。能够真晓得念死的人，才能真放下，才能真看空。</p><p>事实上，我们大家学佛的人，没有一个真正在念死的，都念得自己前途无量后途无穷，希望大得很呢。然后嘛，学佛成道，成了道以后走的歪路，最好是放光、有神通，哦，在空中飞，然后再出去弘扬佛法，名成利就。我们大家要检查自己的心理是不是这样？是这样的话，是魔道的修法，也就是邪见的立志，不能学佛，也不能修道。所以，一个真正学佛的，要以生死一致的精神，念死是为第一。</p><p>如果佛教的十念法把死字摆在前面念，大家不愿意学佛了。那就是袁枚讲的——清朝那个才子袁子才，他引证一句错误的话，经典上根本没有，他乱写的。袁枚一生什么都好，就是绝不碰佛，打死他他都不搞佛的，哈，有这么一个怪癖，说佛不能学，他说佛说的：学我者死！哈哈，这句话根据哪里来的？哈哈，可是袁子才就是这个观念，学我者死。道理对不对呢？也就是念死法门来的。</p><p>真正学佛，随时随地供一个佛，你还不如供一个“死”呢，你不要看大家自己（是）年轻人，讲这个字同我不相干，（人）随时会死的啊，年轻（就）死了的多得很呐！那有什么稀奇。把生死死的这一念摆在前面，然后可以修佛法了。</p><p>那么第二，再提到《禅秘要法》。我们大家学佛、修道，不管你走哪种法门，为什么没有效果啊？第一是陷于身见，这个身体的麻烦……心法我们先不谈，我们现在人生活着，一天到晚最大的麻烦就是老子的话，我之所以为我累者，“为吾有身”，有这个身体。你看，我们一天多少麻烦，都是为了这个身体。之所以不能成道，身体的障碍是第一步。譬如大家打起坐来，绝不能忘身。那么，这个身体的障碍，（是）因为不能忘身啊。所以说证到空，你心想空，在那里空不了的，身体空不了，它的感觉，一下天气冷了会冷，热了会热，这个身体没有办法控制。</p><p>所以《禅秘要法》先空此身，身怎么空？我们晓得，身之所以难空，就是佛讲的五阴里头的色阴最难空。譬如，我们大家都会念《心经》，心经上“色即是空，空即是色；色不异空，空不异色”，就是这个色法空不掉啊，这个身体。你们大家都在打坐，都在练打坐，哪个把身体空掉了？你们敢说一句大话，说我空掉了，做到吗？有人做到没有？做不到啊。你们所谓打起坐来，不但空不掉啊，（还）在加，大家都在加，打起坐来报告：“哎呀，老师啊，我觉得那个气脉，这里……任督二脉，到这里了……哦，到这里了……”报告了半天都在身上搞嘛，对不对啊？那不是在搞佛法。</p><p>就是为了练身体，练身体很好，你看我们现在在座的蔡策先生，身体打坐坐得很好，工夫也做得很好，他就是个证明——《论语别裁》也是他记录的，记录得很好。（平常）生龙活虎的，这几天病了，病了以后天天躺着睡觉，我说：“你起来打坐，坐不住了？”“对，坐不住了。”好了，此身四大一病，你打坐（都）坐不住了！</p><p>再说，我在医院里送了很多老朋友走路的，很多学佛的老朋友走路……最后躺在病床上，我看他快要走了，我说：“你念佛嘛。”“念不起来啦。”我说：“念不起来？你会讲话？”他说：“是啊，你问我，就会讲啊。”我说：“念佛呢？”“念不起来啦。”这是个什么道理？你念不起来，还可以跟我讲话？那叫他“念念阿弥陀佛，好不好？南无阿弥陀佛。”“不晓得，不会念了。”他又听到。</p><p>你以为念身……你们普通这个修持抗得住生死啊？扛不住的。色、受、想、行、识，一样都没有了（liǎo）。你不要以为自己现在打坐啊、做工夫啊，气到哪里了……哎呦！密宗、道家那一套工夫都会，早晨起来又是八段锦、又是太极拳、又是瑜伽术，哎呦，全堂工夫，好像好得不得了。对不住，有一天你真病倒了以后，你一样都用不上，一点都没有用！一点方法都帮不上你忙！还是念死，呵……</p><p>所以，关于念是怎么念，大家还没有搞清楚呢。</p><p>所以这一次，从智法师他们再提出来要求，要我非讲不可，因为原来我给他讲白骨观这些，他一边听一边反感：我们走大乘路子，还走这个小乘啊……他不听，哎，这个没有意思，我要修就走大乘，菠菜（般若）啊、蒸鱼（真如）啊，都端上来了，再不（然）唯识啊、法相啊、唯心啊、唯性啊，都拿上来了，他不听耶！现在他多年修持（下来），晓得这个东西厉害了。</p><p>所以我说“你懂了嘛，就不要再讲了。”“不行不行，我懂了，很多人（还）没有懂，你无论如何要再讲……”我说：“不行了……”那么他要求几次，后来我想想也对，有个道理。所以，这一次正式跟大家讲这一面，讲这面就要大家了解，此法门就是教我们真正如何解脱五阴，解脱这个身心的法门，真正证果的法门。</p><p>那么，真正解脱五阴，真正证果呢……我可以说，它包括了密宗，西藏密宗这些气脉的修法都包括在内。你要晓得，一个人练气功，修气、修脉，气脉是依附什么而生的啊？依附什么而有？我问大家一句话，气脉依附什么而有？前面的同学，年轻同学，依附什么而有？（同学：身体有。）那身体依附什么有呢？依附骨头有吗？还是靠五脏六腑还在才有气脉？有神经（才）有气脉的路线？对不对？那么，这个五脏六腑假设坏掉了，还有气脉吗？中阴身有没有气脉？哦，那不是气脉……有啊，中阴身的那个气脉是带质境，真正的气脉没有了。</p><p>所以修气脉，还是依附在肉身上来的。那么，这个肉身是依附在骨架子上来的，对不对？所以，真一修白骨观，先把这一部分拿掉了，气脉自然通了嘛，不要修气脉已经超过去了。所以，佛传给我们的法宝是有真法宝留下来，可是一般人不懂，偏要在身体上弄，因此气脉永远也修不好。这不是走的冤枉路嘛！</p><p>那么回转来看看，佛有法宝留给我们，我们自己几千年来把它当成小乘，把秘密的法宝丢掉了，可惜了！所以，一走这个路，成就的就很快了。因此，它是密、禅里头的秘密，也是真正最高的秘密。</p><p>那么，它是以白骨观等等入手修的，可是呢，它中间包括了三十多步的工夫，包括了这十念法，也有修念佛、念法、念僧的，都有了，一切都成就了。</p><p>第三点，真正的佛法……你们都听过佛学的，佛学不管大小乘的教理，真正学佛是建立在什么上面？（同学：三世因果。）诶，那个是基础。真正的修法是建立在三十七菩提道品，对不对？要想成道，三十七菩提道品。</p><p>三十七菩提道品第一步是什么？（同学：四念处。）四念处四个法门，念身、念受、念心、念法，这四个法门叫四念。（其实）四念处只有两个法门，身心两面。所以，只有身心起修，就完成了三十七菩提道品。大小乘不离此法，一切的经典都建立在这一个架子上。</p><p>那么，我们真正修身念处，身体的念处是什么？身体的第一个反应是感觉。你看那位道友坐在那里气脉动了，头尽管摇，他是被感觉拉起走了，一天到黑在搞感受，被感觉拉起走，他自己不能解脱嘛。你念头一解脱，我不听你感觉的！把感觉不理了，它就没有事了。</p><p>身的念处就是感受，心的念处是思维法则。所以，如何了思维法则，是了心；如何了感觉状态，是了身。身心俱了，佛法成就了嘛，简单得很！</p><p>所以《禅秘要法》，白骨观的修法先是求得了（liǎo）身。</p><p>再说，大家一修白骨观，尤其我听了很多，一提到白骨啊就害怕。哎呀，你们年轻的同学到医学院看了解剖，回来饭都吃不下去了。所以，我们大家修不好白骨观，是没有看过真正荒冢里的死人。你到解剖室里看了以后，你以为修白骨观就修得好啊？照样修不好。</p><p>我不是讲，过去有一位出家的朋友告诉我……在大陆上，几十年前，他修白骨观修得啊，在街上走路，看到满街都是骷髅，都是骷髅在走路，他到这个程度了。他说：“哎呀，那个心境之清净啊，真是一念不生啊！一点……对世间没有一点什么欲望，没有欲念，清清净净。”我说：“后来呢？”他说：“后来啊，久了不行了，纵然白骨也风流啊，哈，白骨也很好啊。”所以他说：“我就不修了。”这是几十年前。我这位出家的朋友已经死了，也是一位大法师，在大陆上过世了。最近我听一位朋友告诉我，已经死了。这个话，他跟我讲了到现在，（有）四五十年了。他还真修到白骨观这个境界，但是后面他就不晓得了，因为他没有学。</p><p>白骨观你真修成功了，以为是丑陋害怕？那才不然，修白骨观真修成功了，是走到真正的真善美，至美的境界、至善的境界，那才叫做功德圆满。</p><p>所以，基于这许多理由，我们对于《禅秘要法》的基础白骨观，要有一个切实的认识。</p><p>现在，我把前面的，要讲这个《禅秘要法》的因缘给大家提过了。我们现在好好研究本经，希望这一次啊，我们在坐的道友们、朋友们，至少大家身心……最好大家能够证果、成道，至少嘛，能够修得自己健康长寿。</p><p>有病的朋友在这个时候啊，真要做白骨空观，把白骨都化了，身体都没有了，完全无我。《禅秘要法》下面有空观，跟虚空在一起。然后你觉得自己身心化了，就是一片无云，青天无点云的那个境界，这个虚空即我，我即虚空，身体没有不好的；真的念到这样，修到这样的定境，没有不好的。</p><p>念空，这个空是有相的，不是无相，是青天无片云，万里晴空，不能有别的，一点渣滓都没有。</p><p>纵然就是这个身体化掉了、走了，也是无疾而终，清明自在。况且，修到真的空境界的话，这个身体暂时走不了，要它留形驻世就可以留住。</p><p>所以，讲到白骨观，因此我们要插一首诗，很有意思，提到白骨观，唐伯虎有首名诗：</p><p>“怅怅莫怪少时年，百丈游丝易惹牵。</p><p>　何岁逢春不惆怅，何处逢情不可怜。</p><p>　杜曲梨花杯上雪，潮陵芳草梦中烟。</p><p>　前程两袖黄金泪，公案三生白骨禅。</p><p>　 老后思量应不悔，衲衣持钵院门前。”</p><p>“怅怅莫怪少时年”，这个“怅怅”是形容青年人，你们台湾话或者广东话讲一个女孩子、一个女人，很泼辣的叫“怅家婆子”，就是这个“怅”，怅少年是那个年轻小太保，就是怅，很怅。所以，台语啊、广东语啊都保持有古代唐朝的音。“怅怅”就是年轻人蹦蹦跳跳的，不要怪他，“怅怅莫怪少时年”，……这个时代的这一批少年。</p><p>“百丈游丝易惹牵”，现在是唐伯虎老年、晚年的时候，“百丈游丝”，这个老年啊，很多的烦恼，容易牵着很多的烦恼，“百丈游丝易惹牵”。“何岁逢春不惆怅”，年纪大了嘛，看到青年人……没有欢乐了……这个不管了，都看懂了。下面两句，“前程两袖黄金泪，公案三生白骨禅。”……就认为前生也是修行来的，因为他也晓得有白骨禅这个名称，这个白骨禅给他用到文学诗句上，用得很美，“公案三生白骨禅。”这个唐伯虎毕竟是……你看后面两句，“老后思量应不悔”，老了，回转来想想，也没有什么后悔的，“衲衣持钵院门前”，穿个和尚衣托钵，站在院子的门口……你们看到吧，这首诗还蛮不错的，唐伯虎是明朝的诗，都是白话体的，跟唐诗比差得很远，但是有明朝的风格。</p><p>实际上唐伯虎啊，前面看到的都对，“前程两袖黄金泪”，我们在座的老朋友们都有这个感触，前面的辉煌一时，大家带兵的、政治的，都搞过的，唉，现在想想，都过去了，老了，“公案三生白骨禅”。后面唐伯虎啊，到死还风流，“老后思量应不悔”，哎呀，没有什么的！“衲衣持钵院门前”，你以为穿和尚衣持钵呀？嘿，所以你们读书不多啊，你就不会懂诗了，这个是什么事呢，是一个典故。</p><p>这是唐末，唐朝末年有个宰相，叫做‘韩熙载，这位风流宰相的太太多得很，年纪大了的时候，太太太多了——政治环境、国际环境变了，就是南唐的时候，就是南唐李后主前后这个阶段，看看南唐也靠不住了，很灰心。结果干什么呢，晚年自己就玩，玩到什么程度呢，自己故意穿一件和尚衣……宰相府邸很大了，那么小太太们每一个有一栋房子，有一栋院子，他自己穿个和尚衣在小太太门口化缘，自己玩的，“衲衣持钵”是这样。（文献记载：韩熙载每到这个时候，他就会换上破衣烂衫，装成盲叟模样，手持独弦琴，令门生舒雅执板，敲敲打打，逐房向诸伎乞食。---三校注。）</p><p>所以，苏东坡后来也有这个诗，“欲教乞食歌姬院，犹胜云山补衲衣。”苏东坡的名句。就是说，他跟唐伯虎都一样，老了也不肯修道，就是拿个钵到舞厅里头、到歌女前门口一站，去化缘讨饭吃啊，还比那个在山上的和尚啊，自己破了衣裳，还在那里缝啊缝啊的可怜相（强）。他讲，我们的风流史还是值得的，呵，唐伯虎还是这样，“老后思量应不悔，衲衣持钵院门前。”</p><p>所以，大家（因）不懂文学，看看就说：哦，唐伯虎晚年也想修道，也想穿和尚衣托钵在寺院的门上……那不是寺院啊，是歌姬院的门前啊。就是苏东坡的“欲教乞食歌姬院，犹胜云山补衲衣。”文人的风流到死啊，纵然白骨也风流，叫做至死不悔，呵，那多得是。这是关于白骨禅，顺便提唐伯虎用过的一句名句。这两句倒很好，我们采用他这两句好的，“前程两袖黄金泪，公案三生白骨禅”，你们真做到这个就好了。</p><p>这是由白骨禅顺便想到的，这个法门很严重，这一次我们完全根据经典来讲。不过，我不希望大家……有几位同学好心，约他的亲戚、朋友、哥哥……我讲过了，这一次讲这个《禅秘要法》不公开讲，要大家真要修持的人来听。因为我们讲一个东西……你说，那与其少数人听，（不如）大家听——没有用啊！你假设不是真实讲修持的，你听了做佛学听，没有用的，千万注意啊。所以，不要随便介绍人，到此为止了。</p><p>那么，我们现在讲本经。这样，我们分工合作，你来念好不好？念到一段要讲的，我来讲，试一下这个方法……</p><p>同学念：</p><p><strong>【禅秘要法　经卷第一　姚秦三藏法师鸠摩罗什等译</strong></p><p><strong> </strong></p><p><strong>如是我闻。一时佛住王舍城迦兰陀竹园。与大比丘众千二百五十人俱。复有五百大德声闻。舍利弗。大目揵连。摩诃迦叶。摩诃迦旃延等。</strong></p><p><strong> </strong></p><p><strong>尔时王舍城中。有一比丘。名摩诃迦絺罗难陀。聪慧多智。来至佛所。为佛作礼。绕佛七匝。尔时世尊。入深禅定。默然无言。时迦絺罗难陀见佛入定。即往舍利弗所。头面礼足。白言。大德舍利弗。唯愿为我广说法要。尔时舍利弗。即便为说四谛。分别义趣。一遍乃至七遍。</strong></p><p><strong> </strong></p><p><strong>时迦絺罗难陀。心疑未寤。如是乃至遍礼五百声闻足。请说法要。诸声闻等。亦各七遍。为转四真谛法。</strong></p><p><strong><p>时迦絺罗难陀心亦不寤。复还佛所。为佛作礼。尔时世尊。从禅定起。见迦絺罗难陀顶礼佛足。泪如盛雨。劝请世尊。唯愿为我转正法轮。尔时世尊复为广说四真谛法。一遍乃至七遍。</p></strong></p><p><strong>时迦絺罗难陀犹故未解。五百天子闻佛所说。得法眼净。即持天华以供养佛。白佛言。世尊。我等今者因迦絺罗难陀比丘。快得法利。见法如法。成须陀洹。时迦絺罗难陀闻诸天语。心怀惭愧。悲咽无言。举身投地。如大山崩。即于佛前。四体布地。向佛忏悔。】</strong></p><p>我们研究这一段佛经的文字。第一点，这个《禅秘要法》不是后来集的一本……这是一本经典，是经典的记载。</p><p>就是说，佛在那里说法，这一段我们不要讲，都看懂了。那么，当时有佛的基本弟子，一千二百五十人，这是佛的常随众的弟子。有一点要注意啊，除了这个基本弟子以（外），还有“五百大德”，就是后来佛教里说的五百大阿罗汉，五百罗汉。那么，这五百大阿罗汉都是得道的，那么佛的十大弟子里头，得神通的目连啊、禅宗祖师迦叶啊、摩诃迦旃延等等都在坐。</p><p>那个时候有个佛的弟子，叫做摩诃迦絺罗，这一位是佛后来有名的弟子。这位弟子是什么一个性格呢？聪明，“聪慧多智”，这是个重点哦，这位弟子并不笨，聪明得很，智慧又高，学问好知识高。问题就出在他身上，又聪明，学问又好，知识又高，就不能成道。注意呦，呵！越聪明、越能干，知识越高、思想越多、本事越大，越不能成道。所以，迦絺罗就是犯了最严重的……这是要点啊，“聪慧多智”。</p><p>他到了佛这个地方，向佛顶礼。第二个要点，我们看到，佛这个时候是(在)干什么？入定，佛法真正的修持方法是禅定、入定、得定；佛法的不共法就是慧，智慧的开发。所以迦絺罗一来的时候，佛正在入定，“入深禅定，默然无言”，没有话讲。</p><p>那么当时，迦絺罗看到佛在入定，他向他顶礼磕头——然后（按）印度规矩，顶了礼起来，围着这个人走，包围走七圈，普通走三圈可以，最恭敬的七圈，（这是）当时印度的古礼——磕头以后起来，绕着佛，就是包围着佛，转个七圈。那么佛还在入定。</p><p>他看到佛在入定，就跑到佛的大弟子，智慧第一的舍利弗那里，又向舍利弗磕头，然后向舍利弗讲：希望你告诉我佛法的要点。那么舍利弗跟他讲什么呢？“四谛”法门。</p><p>同我们大家一样，讲四谛法门你们听都不要听，因为你们太熟嘛，苦集灭道，一考就背得出来，对不对？所以，我们大家也是迦絺罗，听了等于没有听嘛。这个四谛法门你们都会讲，恐怕讲得比舍利弗还要好一点，还有现代话加上。</p><p>“分别意趣”，给他讲四谛法门，讲了一遍不懂……</p><p>你们现在都讲了好多遍了，都懂，自己还会讲——懂了没有？没有懂！所以，真正懂了四谛法门就可以成道了。大家懂了佛学名词、记得有什么用啊？！所以，真正懂了四谛法门，不要修白骨观了，已经证阿罗汉果了。可是大家都是犯了这个毛病，“聪慧多智”，都会讲理论，证不到四谛法门的真谛，四谛的这个真谛，这个道的真实，你证不进去！同（舍利弗给）迦絺罗讲一样。</p><p>他给他广说“四谛，分别义趣”，就把中间的道理，“义”就是道理，它的奥妙；“趣”就是所趣的目的，都给他讲了。讲还不止讲一遍，“一遍乃至七遍”，舍利弗不厌其烦的给他说了一遍，看他不懂，再讲一遍，讲到七遍。“时，迦絺罗难陀心疑未悟”。</p><p>这不是同我们一样，佛学都懂了，是吧？你们在座的哪个不懂啊，你们都上过佛学院，至少这些居士，都晓得四谛，苦集灭道叫做四谛。</p><p>他同你一样，都懂，心里听了这个，没有开悟。于是，这个老师舍利弗，佛的大弟子之一，智慧第一，给他讲了七遍四谛法，他没有开悟。所以他去拜“五百声闻足，请说法要”，就拜这五百罗汉——全体就叫僧伽，僧团。等于有人来向大乘学舍的你们全体出家人顶礼，请你们集体地给他讲，请说法要。那么，当时这些声闻阿罗汉们也给他再说七遍“四真谛法”，苦集灭道——其实说了等于不说，舍利弗讲得已经比他们高明，一样了。</p><p>“时迦絺罗难陀，心亦不寤”，五百罗汉都同时传道给他，他还是开悟不了。那么又回到佛那里，顶礼求佛。刚好碰到佛出定了，看到迦絺罗跟他哭，“泪如盛雨”，自己哭啊，哭得……我怎么那么……他们给我讲……——其实，他不是那么讲了：他们给我讲的我都会讲啊，苦集灭道。你说这个就会证道，我实在证不过去嘛！开悟不了嘛！同我们现在一样。所以哭得“泪如盛雨”，下大雨一样下来，就叫：佛啊，你再给我讲。佛又给他讲四谛法门，讲了七遍。</p><p>你注意，四谛法门，小乘大乘学佛的第一步：苦集灭道，谁都会讲，可是谁也没有证得。佛亲口给他讲了，迦絺罗还是不懂：这是什么意思啊，你们真是只有这一点啊，只有苦集灭道这一点？给我翻来覆去，连佛也那么讲……所以他不信啊，不能开悟啊。</p><p>当时，有“五百天子”，听佛给迦絺罗说法，大家就得到“法眼净”。法眼净，就是什么是真正的正法，什么才是真正的佛法，分别得清楚，看清楚。这个是魔法、这个是邪门，这个是什么东西，这是属于什么学问的……所谓得了法眼净的人，世间一切法、出世间一切法，到他眼睛一看，头脑一了解就清楚了，所以叫得法眼清净，就分别得清楚。</p><p>所以，五百天子在旁听，佛根本无意给他们听的，是给这个弟子说的，（结果）他们得了法眼净了。所以，这五百天人拿“天华以供养佛”，跟佛讲：真难得啊！因为你老人家给迦絺罗难陀比丘说这个四谛法，他如何我不知道，我们今天已经得了法眼净，证得了初果罗汉，得“须陀洹”果。你要晓得，证果并不一定出家哦，这五百天子是在家的哦，是天人。他说我们已经得了须陀洹果，那么，就感谢佛。</p><p>那么，迦絺罗难陀在旁边一听难受了：这个主角是我嘛，佛给我讲，哎，我嘛听不懂，他们五百人，旁边拣便宜拣走了，说得了初果，这是什么道理？所以他越听越难过，“心怀惭愧”，难过了，“悲咽无言”，很悲啊，痛苦，痛苦得讲不出话，就把自己“嘭”跳起来跪在佛前面，“举身投地”，整个身体就趴下来，“四体布地”，向佛忏悔。那么，是这样一个情形。</p><p>你看这一段经文的记载，像小说一样。就是说，迦絺罗难陀又聪明，学问又好，就是不能成道。那么，向舍利弗问法、向五百罗汉请法，乃至（请）佛说法，跟他讲的都是四谛法门。四谛法门，不要说迦絺罗，我们大家学佛的学生都听过嘛，也同他一样，不能成道，这是什么理由？</p><p>这个就是我们今天大家一般学佛者的一个真实写照，大家都是一样的，光听经，什么经、什么法都来哟、都听啊，管它显教、密宗、基督教、天主教，只要能够对我“生财”的都来啊——你们大家学法的都是这个心理嘛，做生意嘛，只要对我有利的都来，结果还是不能成道。</p><p>我们先休息一会，有茶，准备的有茶。。。</p><p>（本录文尽量保持南老师的口语原貌，最好配合录音阅读。<a href=\"http://www.shixiu.net/e/action/ShowInfo.php?classid=170&amp;id=28\" target=\"_blank\"><strong>录音下载地址</strong></a>）</p><p> </p></div>"
},{
    "title": "禅秘要法讲座 02",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>我们先念一下啊……</p><p><strong>【尔时阿难即从坐起。整衣服偏袒右肩。为佛作礼。绕佛三匝。胡跪合掌。白佛言。世尊此迦絺罗难陀比丘。有何因缘生而多智。四毗陀论。违世羁经。日月星辰。一切技艺无不通达。复有何罪。出家以来经历多年。于佛法味独不得尝。如来世尊亲为说法。如生聋人。无闻无得。佛法大将随顺转法轮者。数有五百。为其说法亦无有益。唯愿世尊。为我分别说此比丘往昔因缘。</strong></p><p>阿难问时。佛即微笑。有五色光从口中出。绕佛七匝。还从顶入。告阿难言。谛听谛听。善思念之。我当为汝分别解说。阿难白佛言。唯然世尊。愿乐欲闻。</p><p>佛告阿难。此迦絺罗难陀比丘。过去久远无数劫时。有佛世尊。名曰然灯如来。应供。正遍知。明行足。善逝。世间解。无上士。调御丈夫。天人师。佛。世尊。彼佛法中。有一比丘。名阿纯难陀。聪明多智。以多智故憍慢放逸。亦不修习四念处法。身坏命终。堕黑闇地狱。从地狱出。生龙象中。五百身中恒作龙王。五百身中恒作象王。舍畜生身。因前出家持戒力故。得生天上。天上命终。来生人间。前身读诵三藏经故。今得值佛。由前放逸不修四念处。是故今身不能觉寤。</p><p>尔时迦絺罗难陀。闻佛此语。即从坐起。合掌长跪。白佛言。世尊。唯愿世尊教我系念。】</p><p>上一段，我们提到迦絺罗难陀“聪明多智”，因为他聪明多智，所以听到佛法……结果嘛，听了很久，佛学的理懂，修证不成功。当时就引出了佛的兄弟阿难——奇怪，每一次都是他请求讲法的时（候）多。他就请问佛法，问：佛啊，这一位出家的比丘同学，迦絺罗难陀，什么原因生来那么聪明，天生那么聪明，学问都好，“四毗陀论”，就是《四韦达典》，是印度文化最古老的经典，比佛经还早，《四韦达典》是印度文化，等于中国上古的四书五经。那个时候佛经还没有出来，就有《四韦达典》，佛还没有出世。是婆罗门教宗教的哲学，很难懂，他都懂。</p><p>“违世羁经”，就是世间法的，也就是各种外道——佛教叫它是外道，就是印度古老文化的那些“道家”的修法，都懂。天文地理无所不知，物理、化学科学，拿现在来讲，他样样会，“日月星辰”，天文都晓得。“一切技艺”，拿现在讲，工业化学、物理，没有哪一样不知道的，学问之好，“无不通达”。你看他多聪明、多好！</p><p>阿难问，既然他有那么好的学问，“何罪”，他犯了什么毛病，出家以来到现在，那么多年了，呵，就是佛法这个法味，真正佛法的修持，他一点影子都没有——那么聪明的人，学理都懂，佛法佛学也懂，他没有影子，这是什么道理？</p><p>他说，乃至你老人家亲自给他说法，他等于聋子一样，“如生聋人”，无闻无得，他当面听不见，当面都听不见！这是什么道理？</p><p>“佛法大将随顺转法轮者数有五百”，五百罗汉是佛法里头的大将，同时给他说法，他也听不懂，这是什么道理？他希望佛给他讲一讲——这些问题，都是阿难经常提出来问。是什么原因，前世种了什么果？</p><p>佛当时听了阿难问的话，笑了，哈！佛就笑了。这一笑啊，佛的嘴里就有五种色光出来，五色的光明从嘴里出来。</p><p>你看佛经上经常提到——现在的人看起来不大相信，这就是神话。你看《楞严经》，我经常叫你们参，佛有三次放光不同，头顶放光、胸口放光、面门放光。佛往往在说法以前，要说一个重要的事情，口中放光。</p><p>你们要想（知道）怎么样（才能）修到呢，就照《禅秘要法》修到了就做到了，没有什么难处。</p><p>你不要光听经教学理，画表格，这样一个学期下来，我要处罚你。要好好修持，要在这里修。这个说法不是普通的上课，要好好修持。修持上没有考验就不行，尤其你们在这里住院的学生，都要在修持上考验，佛学考得好都没有用，你们全体大乘学舍的学生要给我注意啊，到了学期终了，不要看我不讲情面的，你晓得，我不讲情面起来，什么人都没有办法的哦。唯有讲正法，绝不讲人情！</p><p>所以，佛这个时候笑了，放光了，这个光出来围“绕佛七匝”，你注意哦，这个地方就是禅秘，无上的奥秘！佛一笑，从嘴里放光，光转过身体外面，转了七圈，从头顶上进去了，哈，佛的身体好像是变成了七彩的电光瓶一样，从这个洞里露出来，转七圈，又从头顶上进去了。这个就要注意，什么理由，这就是禅秘！</p><p>那么，佛就给阿难讲话了，“谛听谛听”，你好好听，我告诉你，你想一想。佛说，这位比丘，这位同学，迦絺罗难陀，过去生、很多生以前，不止一生两生，很多生以前，“过去久远无数劫”以前，那个时候世界上有个佛，这个佛 “曰然灯如来”。你看这位比丘，起码来头很大，跟释迦牟尼佛还是同学，哈。释迦牟尼佛在燃灯如来……《金刚经》上就说，是燃灯佛给他授记的。这位老哥跟释迦牟尼佛是同学呢，还亲见过燃灯如来来，你看，来头多大！</p><p>下面十个佛号你特别注意，任何一个众生成了佛都有这十个佛号，也叫“如来”、也叫做“应供”、也叫做“正遍知”、也叫做“明行足”、也叫做“善逝”、也叫做“世间解”、也叫做“无上士”、也叫做“调御丈夫”、也叫做“天人师”、也叫做“佛”、也叫做“世尊”，佛有十号，有十个代名号。</p><p>实际上，这十号——我们现在不是讲普通的经典，不加解说了，不讲佛学。十号，你真正了解进去了，才晓得佛学、佛法的精神是个什么东西。所以，佛并不是一个宗教化、神话的，把佛塑得……变成上面摆着拜拜用的，不是这样。（佛是）真正的大智慧成就，真正的解脱。你看，这十个名号里头没有一点宗教气氛。</p><p>佛说这位迦絺罗难陀尊者的因缘，说他很多生以前，等于跟佛两个就是同学，在燃灯佛前面一起学法，那个时候，他的名字叫“阿纯难陀”。你注意啊，下面注意了，他这个人，在很多生多世以来，有几个条件，“聪明多智”，又聪明，智慧又高。“以多智故憍慢放逸”，以为自己聪明，就是聪明反被聪明误；以为自己聪明，所以很骄慢，因此也放逸。骄慢要注意哦，“聪明多智”，我们这里并不多了，我们这里现代人，同学们里头假聪明的很多，假多智的也不少，都是假的，还不是真货；真货，十足的聪明多智真货，那很可怕的。</p><p>因为他“多智故骄慢”，骄是骄，慢是慢。“骄”，看不起一切；“慢”，里头的、内在的，内在的骄傲是慢；外在的也看不起人，那个是骄，骄慢两个字的心理状况是这样。</p><p>那么实际上，这是表面的骄慢心理。有许多人你看他老实不讲话，很内向的，他一样是骄慢。他什么人的话也不听，他管他自己，那个就是骄慢！自己的主见为真实，认为自己对，那个就是骄慢！所以，骄慢外在的心理还容易懂，内在的心理，我们大家都有骄慢！有许多人尽管听经，他到处都来听，也不听，现在（在）打他的坐，那何必浪费时间呢？！（来）就要好好研究这个经典。这个东西也是犯了骄慢戒，因为自己有一套主见嘛。我们现在来上课听经，就是研究这本经典，就要拿着这书来研究。</p><p>“放逸”，怎么叫放逸呢？放逸跟（马虎）两个差不多，马虎，自己找许多理由对自己马虎。这几个毛病都是大毛病，我们千万不能犯；学佛的人犯这些毛病啊，不会成功的。连迦絺罗难陀那么聪明的人，多生多世还成不了道。</p><p>最重要的是下面一句话，“亦不修习四念处法”，学佛的根本，身念处、受念处、心念处、法念处。所以，他死了以后，因为出家，因为学佛——不学佛、不出家还好，做一个普通人。因为在圣人道上学，而不走真正修持的路，所遭遇的果报更惨！“身坏命终堕黑闇地狱”，胡涂地狱，永远没有光明。</p><p>他由地狱出来以后变畜生，变好的畜生哦，变龙、变象，都是大的，因为他的果报很骄慢，所以什么都是大的，自己都是了不起。像我们个子小的，前生已经骄慢得太过度了，现在就是已经很渺小了；可是渺小的人啊，越个子小的人越骄慢，你不要看……。佛经也讲过，个子越高大的人越谦虚一点，个子越小的人越骄慢。所以，骄慢的结果嘛，你尝尝那个味道，不相信将来慢慢尝，“堕黑闇地狱”。然后出来，地狱的罪刑期满了，放出来，还有些附带的刑期还没有满呢，从那个地狱里放出来，假释在外面，假释在外面变龙、变象，变了“五百身”龙、象。不过，因为他聪明、智慧高，“恒作龙王”，做龙也做大的，还不错；“五百身中恒做象王”，这又过了一千生，不是一千年哦，死了又变龙，又变龙……龙就是大蛇，象就是大兽，都在畜生道里。</p><p>他由畜生道中跳出来，因为在燃灯佛前面出家、守戒，所以“生天”，“因前出家持戒”的功德“生天”，“天上命终，来生人间”。</p><p>迦絺罗的“前身”，前一身，“前身读诵三藏经故”，比较谦虚一点，总算肯看看佛经了，读了三藏佛经，所以，他今生碰到佛。</p><p>由于过去生“放逸”，对自己的马虎，“不修四念处”故，所以这一生不能“觉寤”。注意，你看，四念处你们都背得来，一考就答出来，修过没有？没有修啊，佛学有什么用啊？！所以我经常讲，你们年轻的同学都上过佛学院，哎呀，那是“衲衣持钵院门前”，上过佛学院有什么用？！穿个和尚衣，托个钵，站在佛学院的门口。不修四念处，所以这一生不能觉悟。</p><p>那么，迦絺罗听了他前生的因缘——你看，佛讲的，前生、后生不管，反正他不能悟道，（是）犯了几种重点的错误，“聪明多智”，“以多智故骄慢放逸，亦不修习四念处法”，因此不能开悟。这个值得大家反省了。</p><p>那么下面再继续了，佛要说法了。</p><p><strong>【尔时佛告迦絺罗难陀。谛听谛听。善思念之。汝于今日。快问如来灭乱心贼甘露正法。三世诸佛治烦恼药。关闭一切诸放逸门。普为人天开八正道。汝好谛观。莫令心乱。</strong></p><p>佛说此语时。众中有五十摩诃罗比丘。亦白阿难。世尊今者欲说除放逸法。我等随顺欲学。此事唯愿尊者为我白佛。说此语时。佛告诸比丘。非但为汝。亦为未来诸放逸者。我今于此迦兰竹园。为迦絺罗难陀比丘。说系念法。</p><p>佛告迦絺罗难陀。汝受我语。慎莫忘失。汝从今日修沙门法。沙门法者。应当静处。敷尼师坛。结跏趺坐。齐整衣服。正身端坐。偏袒右肩。左手著右手上。闭目。以舌拄腭。定心令住。不使分散。先当系念著左脚大趾上。谛观指半节。作泡起想。谛观极使明了。然后作泡溃想。见指半节。极令白净。如有白光。见此事已。次观一节。令肉劈去。见指一节。极令明了。如有白光。佛告迦絺罗难陀。如是名系念法。</p><p>迦絺罗难陀。闻佛所说。欢喜奉行。观一节已。次观二节。观二节已。次观三节。观三节已。心渐广大。当观五节。见脚五节。如有白光。白骨分明。如是系心谛观五节。不令驰散。心若驰散。摄令使还。如前念半节。念想成时。举身暖熅。心下热。得此想时名系心住。</p><p>心既住已。复当起想。令足趺肉两向披。见足趺骨。极令了了。见足趺骨。白如珂雪。此想成已。次观踝骨。使肉两向披。亦见踝骨。极令皎白。次观胫骨。使肉褫落。自见胫骨。皎然大白。次观膝骨。亦使皎然分明。次观臗骨。亦使极白。次观胁骨。想肉从一一胁间两向褫落。但见胁骨。白如珂雪。乃至见于脊骨。极令分明。次观肩骨。想肩肉如以刀割。从肩至肘。从肘至腕。从腕至掌。从掌至指端。皆令肉两向披。见半身白骨。】</p><p>现在，佛就讲出了白骨观的方法。这个白骨观的方法，依佛说来是呆板的次序。我们先了解呆板的次序，（这）就是告诉大家修法。</p><p>这一段，佛再三强调，现在他要说的法门就是白骨观，我们这个形体就像桌子上（的骷髅模型），我们这个身体死了以后，血肉一切烂完了，剩一具白骨，这个架子就是这样——这是小的模型。其实蛮好看的嘛，没有难看，很美嘛，这个是杰作啊，你看，每一节每一节做得很好。</p><p>佛就告诉（阿难），你问的好，问佛“灭乱心贼”，我们心为什么散乱，不能得定？得定是心定嘛，心不能定就是心散乱，心为什么散乱？用什么方法使心不散乱？所以你问得好，怎么样来“灭乱心贼”这个“甘露”法门？</p><p>而且讲白骨观的严重，不要轻视了它，过去、现在、未来三世诸佛的治一切烦恼的药——一切烦恼，要注意哦，烦恼，并不是（仅仅）思想、感情叫烦恼，生老病死都是烦恼哦。我们生病是最大的烦恼。所以，能够真修到白骨观，定在白骨观上，可以（是）治烦恼的药。尤其譬如说我们的肺病啊、肝病啊、心脏病啊，你真统统把它拿掉了，只有一个白骨骷髅，白骨最后也化光了，就把病化掉了。所以，三世诸佛这个治烦恼的（药），关闭了一切的放逸之门，他说我告诉你。下面就讲白骨观，告诉我们观白骨观的次序。</p><p>那么，他正要讲的时候，其中有五十个大和尚，“五十摩诃罗比丘”，就是大和尚、老和尚，跟佛出家老资格的和尚，也没有得道的，旁边就给阿难送红包了，哈，打招呼：师兄啊，你告诉佛，不要为他一个人讲，也讲给我们听听，我们都是犯同样的毛病，又聪明又放逸。佛就说：放心，不止给你们听，还给将来的人听！所以就记下来这一部书。</p><p>他告诉迦絺罗难陀，要想真正学佛，先要修定，先做白骨观——我们叫它是白骨观，就是刚才引用的唐伯虎的诗，“公案三生白骨禅”，就是这个白骨观。佛就说：你从今天起，要开始修真正的“沙门法”。“沙门”是印度文化的名称，中国开始的翻译称为“桑门”，桑树那个桑，也就是沙门，桑门是翻音的。所谓求清净，专门出家修道的，谓之沙门。</p><p>他说，一个真正修白骨观的沙门，“应当静处”，你要找一个清净的地方自己专修。“敷尼师坛”，“尼师坛”，他们出家人受戒，手上挂的一块方方的、长方形的那一块挂在手上，披个袈裟，那个叫尼师坛。现在我们中国出家人，挂那一块做个样子，拜佛、拜祖师，打开拜一下就收起来，挂起来。实际上，那个是什么？出家人的毯子，过去是背起走的，也就是这样背起走的。后来到中国来，不需要用这个毯子了，所以把它叠拢来——我们这个法师去拿了，拿出来给大家看。尼师坛就这么挂在这里，这么挂在这个衣服上，这个就是尼师坛。实际上，那个是什么？就是出家人打坐用的、睡觉用的，铺在地上用的毯子，那个叫尼师坛。尼师坛也就是坛城，我们打坐坐在那个上面。</p><p>那么后来，到中国来不需要这个，环境时代不同。所以中国人——（法师送来）对，这一块就叫尼师坛。现在，佛教的名称叫具，这样铺开来四面。那么，现在出家人拿这个铺开来，放在地上，或者拜大和尚、拜佛，除了真拜佛，整个的打开以外，很少整个打开，打开一半做做样子，就表示很礼貌，拜大和尚用。这个现在都是粗布做的，我们在大陆上看到的还很讲究，越来越摆样子了，将来用尼龙做的了，有那么一天以后将来变成画画，画一个就好了。这个叫尼师坛。现在中国的佛教名词叫“具”，具者什么意思啊，等于演戏的道具，我们修行打坐的具，工具，就是尼师坛。那么现在，我们懂了这个名称。</p><p>就是说，你要专修白骨观，要有一个清净的地方，要打坐在一个很安详的位置，“结跏趺坐”打坐，打起坐来要注意哦，修白骨观人，营养要吃得好一点哦。修白骨观，营养要不吃好得话，越修得自己活形活现，像我一样，就变成白骨瘦瘦的，就会这样哦。</p><p>所以，你们有些出家的修白骨观，还搞成吃一餐、两餐，怪不得好几天我看到，我说“怎么搞的？”修成这样？你要修白骨观，一定要吃得营养要足够，还要吃得好一点，不是乱来的。</p><p>所以要“结跏趺坐”，“齐整衣服”，打坐的时候不要马马虎虎。你看，我经常看到你们打坐，尤其是到了……东一块挂着一块毯子，西一块披一条毛巾，不成样子！这个动作就是放逸，你以为什么叫放逸啊！？你说我打坐还放逸？你对自己的一点生活都不能整齐、不能清洁，对自己要求不严格就是放逸耶。放逸不要乱解释了。自己的错误犯了，马马虎虎过去了，自己对自己很原谅，就是放逸，不是修行的道理，不能放逸。所以要“齐整衣服，正身端坐。”……坐着，这一半膀子是露出来的，这边盖起来。</p><p>那么，我们讲禅定的手印，左手在下，右手在上，两个拇指……他这里讲的修白骨观的手印，稍有变动，也可以，右手在下，左手在上，这没有多大关系，有一点点关系，有什么关系啊？把手印变动了，左手在下，本来这个叫做毗卢遮那佛的大三昧印；左手在上，右手在下，指头稍稍围出一点，（是）阿弥陀佛手印。那么，因为修白骨观的第一步，你先要观想自己左边的大拇指，所以左手在上也可以；照大三昧印结手印也可以。</p><p>那么，这又是禅秘了，秘密了，为什么要结手印呢？像密宗结的手印，各种各样多得很，手印花样多得很，翻过来翻过去，两个（手）十个指头玩的花样很多了，这么一个手印就是献曼达手印，自己观想把这个世界的物质都献给诸佛菩萨供养了，然后，是花哦，那好看啊，手印一比，比那个跳舞的都好看。那么你说，这是做样子啊？不是。人体的这十个指头，同脚的十趾……你要晓得，我们头脑的脑神经是二十四对，一串二十四。所以，真修成功了，这二十四对……中国人说一年有二十四个气节，脑神经是二十四对，向外的。你之所以为什么（会）得神通呢，白骨观修到头颅部分都通了以后，白骨也化光了以后，就发神通了，都由这个发的，这就是天线、地线都接上了，拿我们现在讲。所以，结手印有它很深的道理，这一部分东西没有时间跟大家讲。</p><p>所以，每一个手印……哪一个手印是主动用哪一个指头，同内脏也有关系，譬如我们这个手（各个部位对应）胃、肺、心脏、肝脏、肾脏。所以你看，小儿生病的时候，我们中国大陆的小儿科，当年西医还没有发达，那我们不是死了人了，小儿都死光了，结果我们人口还越来越多。拿中国的老法子，小儿生病哪里诊断呢？看手：哎呦，肝里头不好喽……哎呦，什么不好……就在这个（手）上面。所以，十指连心，和心都有关系的。那么，这个手印的道理也是这样。</p><p>所以，讲我们打坐的姿势，佛亲口教的，闭着嘴巴，“闭目”，眼睛是闭起来，不是叫你张开的。不像别的禅观经，叫你眼观鼻、鼻观心……这里修白骨观叫你“闭目”。“以舌拄腭”，“腭”就是嘴巴牙齿张开，上嘴唇进去一个指头的样子，进去这么一截，这个（舌头）翘上去，对到鼻孔……（从）头顶中间下来，这里有个穴道，懂得针灸的人，这个地方可以打针进去。有一种病，这样打的。所以，舌抵上颚，“定心令住”，心静下来，不要分散了。那么开始白骨观了。</p><p>这一段我们都看下去了，这一段不要我讲，都看懂了。先叫我们从左边的大趾头观起，看到大趾头，自己想自己，就是要念死，自己觉得死了，死了以后嘛，左边脚趾头先开始烂，烂得……我们没有吃过猪肉总看到过猪（跑）嘛，至少大家都吃过猪肉的。猪肉放在厨房，不放在冰箱，尤其是热天，几天就烂了、起泡了、臭了，你也觉得自己——不过不要观自己臭了，真观自己臭了，会发生一种臭味哦。你就观自己肉烂了、起泡了。然后，烂了以后没有了，死了，左边脚趾头的白骨就出来。那么，看到自己左边的白骨干净，“白净”，“如有白光”，这个要点！</p><p>换句话说，你们说：“哎呀，老师啊，我观不起来啊，我想自己脚趾头，想不起来呀？”诶，当然你想不起来，这个等一下再说。假设（是）有本事的人，上来就是白骨嘛，肉都没有了；那就可以不要经过烂啊、起泡啊，都不要。他叫你一节一节观上来，观到上半身，佛讲到这里，只讲到上半身。一节一节观，有本事的，上来，我已经就观成一个白骨了嘛，什么都没有，丢光了，里头都没有了，那很容易嘛。</p><p>佛不能……你看佛讲的法，记下来的真很科学，一节一节，等于医生在解剖，先剖了脚趾头，再把刀拉上来，拉到脚背、脚身，再拉到脚踝、小腿、大腿，一点一点叫你观上来，观到半身都变成白骨。</p><p>你要晓得，我们的骨头并不白哦。大家看过死人骨头没有？黄色的。你现在把自己的骨头（割）开看看，拿刀割开看看，白的，活着就白，死了慢慢变（黄）了。</p><p>但是，佛教我们观想这个白骨，“白如珂雪”，比雪还要白，然后放光。你真不要说别的，你（若）一个脚趾头观起，观起（后）要定住啊，定住就没有骨了，只有这一点光了，“系念”，就把这个念头定住了。你整个的白骨化光了更好啊，但是，还是从这一点光开始。</p><p>那么他说，你真正定住啊，这里有个要点，“举身暖熅，心下热”，一身温温暖暖的、发热。</p><p>发热不是说头昏发热哦，假设你打坐白骨观起来，（或者）不管你参禅、念佛，念到头部发热，你要去看病了，你要注意了，说不定是血压上来、说不定是感冒了，你才会这样。所谓暖，头部还是清凉的，那没有问题，即使血压高都没有关系。如果头顶还是感觉到清凉，下半身发暖的……得暖是很重要哦。</p><p>所以学佛，不管大乘、小乘，先要能够得暖，你们随便打坐……要四加行，四加行的第一步是暖。这个四加行，不管哪个法门，随时一步有一步的四加行，第一步先能得暖；得暖以后，到顶；顶以后忍；忍以后世第一法，这是四加行。</p><p>所以，真一得暖，开始觉得里头……那么，一得暖的人，两个脚心、两个手心一定发暖的。修行了半天，手还冰的、身上还冰的，一摸都冰的，就变成凉血动物了，凉血动物是什么？就是海里头的鱼啊，那就不对了。所以禅宗祖师骂人：你这个人皮下无血的，打你一顿都没有反应的！所以，修行人身上（是）得温暖的，这是重点。</p><p>假设真得暖了以后，妄念就少，差不多自然自然（就少了）……得暖是什么道理？身上一得暖了以后，你身上的业气慢慢就给它烧化了。所以，大阿罗汉，得了道的人——真正我们佛教的人，不是死掉拿火烧嘛，这个道理是这样来的。真得了道的人，自己要死的时候，“走了！”一定，自吐三昧真火，烧了，只看到火光亮一下，没有了，自己化掉了，这个叫三昧真火。所以我们得暖，就是四大里头的火大先发起，真正得暖的时候，百病皆除了，要真正得暖。</p><p>所以，暖到顶，那是与天地接通了、与法界接通了；忍，自然没有妄念，你想妄念都起不来。那么，暖顶忍这个样子……达到了第四步，这个时候（是）世第一人，这个世界上的第一人，哪一个做到了都是世界上的第一人。当然，定还是世间共有的法，共法之一。</p><p>所以修白骨观，后来佛法进来了以后，道家用了这个法门，叫做什么呢？后世越来越来……后世道家，有些入一贯道的，叫你守这里；有些道家叫你守额头，不是守在这里；有些道家叫你守丹田，都是白骨观、不净观法门里头变化出来的。这个法门叫做什么？“内照形躯”，道家就有这个话。汉朝的道家，所谓叫火龙真人魏伯阳，著《参同契》，那个时候佛法还没有进来，不过已经跟印度文化交流了，有四个字，要内照形躯——白骨观的修法！所以叫你闭眼睛打坐，（是）内照形躯，变白骨、放光了。这一段是白骨观。</p><p>所以，观白骨观这一段，你们现在有什么问题啊？先听你们问问题，你们一定在修持中间发生问题，观得起来？观不起来？……趁这个时候问，不要单独一个一个……每一个都想单独找我问话，你晓得，我是一个人啊，你们多少人！每一个找我单独问话，我还有命嘛，我已经变白骨了，不观都变白骨了！趁这个时候赶快问。修持上有问题没有？不要单独问啊，这个时候没有问，就认为你们没有问题了。</p><p>（同学问：第三页背面倒数第三行，他原先说是观半节，可是后来又说是观一节、二节、三节、四节，那么，这里的这个节是直的还是横的？）怎么直的横的？……啊，他说，“当系念著左脚大趾上，谛观指半节，作泡起想。”这个左边的脚，大拇趾就是这一节嘛，就是这一节你就够了，就在大拇趾这里观。你这个腿打起盘脚来是这样，你就观这里就够了。然后，假设你把这一节观起来了，如果是血压高的人，比方，你真的观到这一节，或者观……观起明显了，念头（只）系念在这里，血压马上降了，就是这一节。然后，他讲第一节、第二节，是讲这个第一趾、第二趾、第三趾，是这个道理。不过古文没有那么分别得清楚。</p><p>先是叫你观趾头这一节……脚啊，不是手啊，我现在没有把脚拿上来……（师举脚）哎，拿上来，不然你们大家观那个手……先观这个，这个观好了，白骨光光的观好了，然后叫你观这个、这个、这个……趾节观好了，观这个脚掌，脚掌观好了，（观）踝骨，就是这里脚后跟，然后一路，髋骨就是屁股，腰骨这两块……慢慢慢慢上来，然后叫你观背脊骨，一路上来到这个地方，观到头这里，叫你这样观。</p><p>这个观是什么？观想观想，是想来的。现在问你们大家，观不观得起来吗？观起来的不要点头了，没有观起来的你再问啊！嘿嘿，看着我，我不是白骨啊，它才是啊。观不观得起来？都观起来了。</p><p>（同学问：老师，我有问题，观的时候，经文讲到，刚开始的时间要拿自己身体来观，）啊，对。（那可不可以一个方便，先前面观起来……）问的好！这才晓得问问题。对，现在《禅秘要法》所讲的是闭目内照形躯观自己。但是，一切人修行，观自己根本就观不起来！所以问你们，你们都不答话，你们都观起来了？！就看着我，好像入了那个黑暗定一样的。观不起来的！你们怎么观得起来？真观起来，一个趾头一节观起来，已经差不多了。那么，就是刚才慈仁法师问的，我们把这个形象，把这个假的白骨——这个假的白骨是根据科学做的，大体上都有，细骨没有做，大的骨头都有，真正的细骨还不是这样。那么，你就把这个（假）白骨记住，先观白骨的这个脚趾甲也可以，你就闭起眼睛坐着假想，想这个在前面，你把这个形象真定住了以后，进一步一回转来就到身上来了，是可以，绝对可以。</p><p>这个就是《瑜伽师地论》上面，有分别影像心一境性的修法，绝对可以的，而且应该这样修。因为一切凡夫众生，就是上面讲的，此心散乱，不容易得定，所以，才先观外面的有分别影像，观这个模型，先不管自己；因为你还不能、不容易回转来反照形躯。所以，一个人能够真做到反省自己，很不容易的，回不转来的。为什么回不转来，你应该再问了。为什么我们观自己，眼睛闭着观不起来？就是心向外驰、散乱，向外驰搞惯了。</p><p>所以，朱熹解释《孟子》的也解释得对，孟子所谓说“学问之道无它，求其放心而已。”我们的心在外面放逸，喜欢向外面想，无始以来，喜欢向外面放逸、散乱，习惯了，所以一下收不回来，因此我们不能得定。那么，我们利用的方法呢，就是用外面的这个有分别影像，因为这是白骨，这是有分别影像，晓得这是白骨；同时我们也在分别，晓得我死了也是这个样子，因此一切（都）没有道理，一心一念定在白骨上。白骨只要一定住，这个外界的形象一定，定久了，清明的时候，突然一念之间回转来，自己就是白骨，整具就完成了。</p><p>那么，为什么突然一念之间它会回转来？就是说，你观外界的有分别影像，定久了以后，静到极点了，就是达摩祖师那个话，“一念回机，便同本得”，它自己转过来了。是要这样观，对的。这是一个问题。还有什么问题没有？回去想想看，还有问题下一次可以再问。这个课上个把月，最多不能超过两个月，一个半月把它讲完的，三十几步修法。</p><p>你问什么？（同学问：讲到跏趺坐，是一定要跏趺坐吗？）跏趺坐，双跏趺嘛。第一，规规矩矩双盘脚，不管右脚在外，或者左脚……再不然单盘，再不然架起来，这个没有关系，不一定跏趺坐，能够跏趺坐最好。刚才给你们讲手印的重要，至于说跏趺，为什么脚要盘起来有那么重要呢？这些都是要牵涉到现在医学生理学、解剖学这个道理了，问题很多，暂时不管。就是说，你跏趺不起来，就是那么坐着也可以，普通坐在凳子上也可以。可是你腿子膝盖头一定要盖好，好吗？</p><p>还有问题吗？大家都有书了吧？还有要买书的，这个事情现在哪个在管啊？哦，你在那里举手，这里前面看不见。买书找那位史小姐，两位都是史小姐，到她那里登记，是代办的。这个课是礼拜一三五……</p><p>还有问题吗？不要客气了。还有问题，下次大家就要提出来问。还有，我们有许多同学，大家学禅的、学过静坐的，不要认为，我已经很好、很静了，何必还要做这个观呢？你注意，不管你悟了也好、没有悟也好，静也好、乱也好， 白骨观这一点都观不起来，你那个禅就靠不住，非经过这个修持不可。</p></div>"
},{
    "title": "禅秘要法讲座 03",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>有人问：我们平常都知道，修持佛法，处处是空，要证到空，何以我们现在讲白骨观，反而要用念头来修，修有，这是什么理由？有一点，特别要交代的，普通一般的观念认为，佛法是说空，这是因为大乘的佛学，由龙树菩萨之后到中国来，受般若宗的性空这个观念的影响，自性本空，性空的道理……后来，有唯识宗的兴起，主张不是空，胜义有，这个有不是普通的有，换句话说，所谓自性空，那个空就是有，那个空也是个有。所以，在学理上，后来的佛法在中国一直绵延下来毕竟空与胜义有这两个观念的争论。</p><p>其实，所谓空，是对万有自性的本体来说，那个本体的相是空相，对体而言；有，不是普通的有，所谓胜义有，因为空，于其真空才能生起妙有，这是理论上的。在修持上，最后修到返本还源，毕竟空，那个空也就是有，但是不是世俗的有，不是世间观念所讲的有。那么，在修持的方法上，我们一般开始谈空，都想空念头——念头空不了，念头的本身非空非有、即空即有。所以，念头的本身你要去空它，你有个观念去空它，那个能空它的观念就是个有，况且，你不理解、没有证得能空的本身就是有，你拼命在意识上假造一个空的境界来空它，还是意识的作用。</p><p>而且意识作用，不要说空，空得了空不了；即使空得了，犯一个很大的危险、很大的错误，往往落在顽空，或者是断灭空——空，认为就没有了，没有了，因果也空，一切拨无因果；但是自食果报的存在，不管你怎么空，空不了，你说我不理它，它理你。</p><p>所以，一般修空的，往往落于狂禅，自己狂得不得了，认为已经证到空。他不晓得，那个狂，你本身的那个狂，就已经是不空了。所以，后来禅宗与佛教流传一句话，“宁可执有如须弥山”，执著有如须弥山那么大；“不可落空如芥子许”，不可以落在空上的观念像芥子一点点样大，很危险。</p><p>至于你这个问题，我们现在讲修有，修白骨观还不是修有，白骨观基本白骨也空，毕竟是修空，在方法上看起来是有，目前是有，以有、以意念来观这个白骨……基本上，修到彻底返本还源，自性般若的实相空，那是最后的一步。所以，你认为修观想、修白骨观等等，就是修有，错的，不是修有。</p><p>因为你要证到空，谈何容易啊！而（修）有的路子是渐修的方法，一步一步给你证到空。这是实际上非常稳当的一个修行之路，即使修不成功，还不至于堕落到哪里去；你修空，修不成功，堕落得更危险，可以说一堕，堕在无间地狱。是这个道理。</p><p>而且，我们普通所讲的空，彻底的空，空不了的! 大家学禅的人，——当然，现在没有真正学禅的人，号称的，嘴里讲是学禅的人。偶然有一点点空，那是第六意识意境上，偶然造出来一个空的样子，实际上没有空，四大坐在这里，身体坐在这里，空不了，腿子麻也空不了，心里烦恼也空不了，有一个病痛更加空不了，那么，你平常谈的空是没有用的。所以，我们普通所讲的空，是意识上的理解，自己认为是空而已，并没有证到真空。</p><p>至于白骨观的修法，是修有。那么，它的修法（是）从什么地方开始修呢？当然也是从意识，观想也就是意识去观；不过它有不同，它修到最后，就在第八阿赖耶识整个转了的时候——一切密法，一切奥秘的修法，就是如此！</p><p>那么，第八阿赖耶识带着修……大家如果研究过唯识就知道，第八阿赖耶识是包括了我们的身心，包括了整个的物理世界，都是一个第八阿赖耶识所演变的。所以，我们现在的肉身四大，这就是第八阿赖耶识一个心的体所演变出来的。此身，这个身体四大不能了，你谈空是妄谈的，是假的，是意识境界自己认为空，空不了的。</p><p>所以，这个肉体……我们晓得玄奘法师的《八识规矩颂》，讲到第八阿赖耶识，有一句话，“受熏持种根身器”，“根”就是我们的肉体六根，根不离四大；“器”就是物理、物质世界，都是阿赖耶识所演变的。我们修白骨观，在阿赖耶识的“受熏持种”四大种里头，先由地大来求解脱。地大，在我们肉体来说就是骨。那么，五脏六腑里头也包括地水火风，一步一步把它真正修转，解脱了。</p><p>所以，这个修法的观想，还是从第八阿赖耶识着手去修，当然，前奏的工具是第六识。可是，第六意识的观……大家观想，观白骨观不观得起来吗？（有）一个人观起来?恐怕在座的很少……为什么观不起来呢？因为，你们不晓得用观，你（用）第六识意识想一个白骨，怎么想得出来，想不出来的，是不是这样啊？大家有没有这个困难？其实你们用错了，你们想这个白骨，拼命去想，那就跟啃骨头一样，吃排骨一样，怎么想得到，这是影像!</p><p>譬如现在这一个白骨人架着，你看了以后就是影像——之所以《瑜伽师地论》教你修止，这是有分别的影像，你这里有影像，就容易观起来。大家所以不能得定，很大原因……我经常有个比方，你们现在不管年纪大小，自己想自己小时候住过的那个家、那个房间，或者是小时候，家里最喜欢的哪样东西，现在我一提，你就想得起来吧？眼睛都不要闭就想起来。哎，就是这样！观想就是这个道理去观。所以，你白骨一带就想起来了，坐在这里想，眼睛都不要闭，这就是第六意识的带质境作用。带质境，晓得吧？都听过带质境。有分别影像，质一带就出来了，你懂得这个方法，念阿弥陀佛，净土境界一带也呈现了，怎么不会念佛呢？所以，会懂得观想，一定会懂得念佛，乃至更会懂得修密宗了。</p><p>许多人修密宗修了一辈子，观想不出来，观想一个菩萨，硬观不起来，菩萨怎么能观得起来？怎么观？大家闭着眼睛在那里瞎想，等于想啊：黄金美钞到我口袋里来，天上掉下来，掉到我口袋里一样的，那怎么能想得起来啊！带质境非常轻松的，眼睛都不要闭，一想就清楚，这个所谓是想。</p><p>想起来，然后能够把这个想起来的念头定住，那可难了，修定就是这个定，修止修定。你这个景象被你想起来了，定住不动，这叫做定。</p><p>那么，你们有一个境界想起来，就马上想把它定住，对不对？哦，为什么定不住啊？因为你把它推开了，这个分别影像一起来摆在你面前，“要定住！”就有个力量去推它，它走开了。你管它定住定不住，分别影像一摆，它就定在这里，渐渐渐渐……就定下去了，这个意思懂了吗？不懂的再来，慢慢来。这是第一个问题。</p><p>另外有人问第二个问题：四念处，照白骨观的修法，都是从意上，第六意识上起修，那么——四念处大家还记得吧？佛法基本的修持方法是四念处，身念处、受念处、心念处、法念处，对吧？那么这个四念处，同白骨观的修法，既然有念处，就要从意识上起心动念去修了，对不对？那么，他（问这）不是妄想、妄念吗？为什么叫去妄想呢？我的妈啊！刚才跟你讲，平常大家听佛学、听佛经，犯一个最大的错误，以为去掉妄念就对了。他告诉你去妄念，并没有叫你去正念啊，对不对？哪本佛经上叫你去了正念？！妄念，虚无缥缈的，像水面上的油一样，那个染污的油在水面上，把这些都去掉。但是，去掉了水面上的那些染污啊，油面一去了，一潭清水自然清净见底，这个是正念，正念不需要去，也去不了，不来也不去，不增也不减。所以，（修）四念处、白骨观叫你念，是正念的念，这个并不冲突。</p><p>还有，第三个问题，有人问：止观同观想有什么差别？几乎没有差别。观想，实际上是两个字，我们《禅秘要法》初步的，佛说的，是叫你想白骨，我们给它加一个名词叫做“修白骨观”。想是意想，想一个白骨。那么，这个白骨想出来以后呢？骨，有分别影像，一个影像在那里以后，静静地把它定住，不加分别，这个就是观；不是拿眼睛去看一个白骨，自己把眼睛闭着，向里面拼命去看骨头，那你不得了，你永远也观不起来，而且也走错了路。</p><p>这个想白骨很容易，你晓得我们总归要死，随时要死，（即使）你活到一万岁还是要死；死了以后，肉烂了什么的，自然变成白骨了，就是那么一想白骨，就行了，自己觉得自己就是白骨一具了，这就想起来了。因为大家没有这样锋利的智慧，所以佛就慢慢来，教我们做屠户一样、开卖肉店一样，先把大脚趾头的肉拉掉，先看一个指头白骨，看起来了，（再）慢慢慢慢，一个一个来……。其实，聪明伶俐的一想自己：我现在就死了、臭了……</p><p>前年打七，我们焦先生在那里，我一提白骨观，他做不起来，焦先生好像自己想：哎！我这个人本来要死的……他假想自己死了，死了……哎呀，假想死了以后怎么样，慢慢肉也烂了、黑了、化了，变成脓血了……哎呦，就是白骨嘛，他一下就想起来了。就是自己想，把自己想得很清楚，天然的路道。如果再进一步想，白骨又怎么样？白骨慢慢氧化了，氧化了慢慢粉碎了，粉碎了，变成一阵风来，把白骨一吹没有了，空就呈现了。</p><p>那么，这个呈现了以后，你真的意念到了这个境界的话，你这个肉体的感觉当下也没有了，受阴就去掉了，做到这个程度，就是观想的定力到了。观想的定力到了，你把空这个境界，或者白骨化光的境界定住了，这就是止观，这个境界定住了不动，如如不动，就是止观。所以你说，观想与止观有什么差别？差别在这，到了究竟呢，没有差别。止定了，那是真观；真正的观起来了，那才是真正的止，止在系心一缘、心一境性上，这样才算得定。你以为打坐起来就得定啊？打坐起来什么都不知道那叫得定啊？那叫昏迷，那叫做一片无明，要搞清楚。</p><p>第三个问题：观想白骨观与观想不净观，何以必须要注重饮食营养好？这样（是）讲初修的人，初步修持的人。第一个用观想啊，专一的观想啊，他自己不知不觉间觉得费力气，所以需要补充营养。第二个理由，你体能一好了，做观想的精神容易足。第三个理由，修白骨观的人有许多智慧浅、愿力浅的人，一想到白骨观，我本来这个样子，死掉了……哎，倒胃口了，就是饭都吃不下了，慢慢人就容易消瘦，体能差了。所以，你饮食注重好了以后呢，修白骨观要有力，这个体能不但不倒，而且身体越来越健康。那么，这个理由还很多，还不止这几点，将来慢慢再告诉你。</p><p>第五个又问：怎么样能够使白骨观切身而修？白骨观分空，“色即是空，空即是色”，怎么用空修呢？《禅秘要法》以后（会）讲下去，都有，什么法都有。现在简单地讲啊，白骨观是色，真修到白骨观成功了，一片空的境界就到了。“空即是色”，你修到了那个空的境界，然后，（同）你丢掉这个肉身一样，再把这个肉身转化修成圆满，即身成就，这一生就成就转成圆满报身，可以修得成，不是修不成，这就是“空即是有”。所以，白骨观的修法是“空色皆空”的修法。</p><p>大家都不知道，我们在座的人，恐怕很少真正学过密宗的。如果真正学过密宗的，就晓得密宗很多的佛像，脚下面踏一个骷髅。还有密宗许多的祖师，譬如说莲花生大师，或者有许多菩萨，手里拿一个杖，骷髅杖，两个骷髅（腿）骨做手杖。大家觉得这个佛像吓人，怪里怪气的，妖怪一样，脚踏着骷髅……很多菩萨，脖子挂的项链都是骷髅头的，头上还戴着骷髅，手里骷髅杖，脚还踏着骷髅，那可能是妖怪，好像不是佛。</p><p>还有密宗的修法，你们还没有看到过，前几天有个修密宗的同学，拿个东西问我买不买，是死人的天灵盖，修密宗天灵盖一定要的，装甘露水；那个摇的鼓，“嘣嘣嘣”的，人的皮做的，人皮，这种感觉是妖怪、妖教……。</p><p>实际上，所有的密法以白骨观为基础！</p><p>所以，骷髅踏在脚底是基本的……这是秘中之秘，从来没有人说过，也从来没有人悟到这个道理。为什么拿骷髅“杖”？就是依仗这个白骨骷髅法而修成就，报身成就、化身成就，三身都会修成。</p><p>今天，我把密宗里头的密宗之密，把它揭穿了，告诉你，就是这个道理，这就是表法，表示这个道理。大家看了这个，身上都围着骷髅，本来我们就是一个骷髅，本来这个人的确是，没有什么稀奇，没有什么色相好看的，最后都同他老兄一样（骷髅模型），不过有些宽一点，有些长一点而已。所以，答复第五个问题，顺便说到……。</p><p>第六个，有人问：这个观想与眼识的作用……这个不需要答复了，讲过了，观想不是拿眼睛去观的，意在观，意识在观。所以，拼命把眼睛闭着，在里头很用力地看自己的脚趾头，那你何必那么费眼睛？！干脆把袜子脱了，这样一观就观起来了，自己还可以闻闻臭脚丫的味道。不是眼睛看，意识在看，意识观。所以，第六个问题是这样。</p><p>另外，刚才从智法师也讲有人问的问题：“先当系念著左脚大趾上，谛观指半节，做泡起想。”他问：这个念头是否同我们系念佛号那样的心里动念？这个话（问题）前面已经答过了，想与观不同，都讲过了。（又问：）想是不是作意？有一个形象那么观呢？刚才我好像都说过了，对不对？不需要再答了。</p><p>二、他问：把肉劈开，怎么劈法？呵，（众笑），你来，我拿把刀来劈给你看。怎么劈法，一个橘子怎么剥法？切菜怎么切法？都可以嘛，这个不需要问。“令足趺肉两向披”，“两向披”就是那么扒开，叫两向劈。“使肉褫落”，问：怎么样叫褫落？褫落就是一块一块、一点一点掉下来。</p><p>第三个问题：经上只说观左边脚，是不是先左脚，一边次第观，一边到右脚？没有错，慢慢来，（经文）后面还有，右脚，岂止到右脚，全身的肉都要割掉。大概这样。</p><p>还有什么问题没有？（同学问：老师，请问一下，我们的观想是从脚先观上来，可以先从头观下来吗？）可以的，但是不要先观头，等听完了来……对，你这个问题倒可以答复，为什么先从脚底下观起呢？佛经里面讲修行的方法，例如密宗，有些观日轮、观太阳，脚底心观一个太阳，为什么如此呢，一定要观脚底下起呢？</p><p>我们人的生命，“精从足底生”，所以，人的生命从下部来，所以人的衰老死亡也先是从下部脚慢慢凉了，老年的脚没有力气了，从下部慢慢死上来。这个道理我跟你们讲过不晓得多少次了。你看生来的小婴儿，生来的小孩躺在那里玩，他怎么玩的？不打拳的，身都不动，光动脚；到了小孩子的时候，你看那个七八岁小孩，站在这里，他站不住，光想跑，两个脚发胀，站不住，好像狗要长牙一样，专门咬东西，他的脚要跑。十几岁以后，叫他坐着盘脚打坐，可怜了，坐不住啊 ；到中年以上懒得跑了，喜欢坐，而且坐也没有力气，两个腿还要翘起。到老年啊，坐起来，两个脚一翘，“哎呦，好！好舒服！”腿死亡半截了。</p><p>所以，叫你从脚底的观法是非常科学的，你从脚底一观，或者做太阳的日轮观，作明点在脚底观，作白骨在脚底观，高血压的血压就降下来了，就平和了，气就归元。气一归元，所谓庄子说的“常人呼吸以喉”，普通人的呼吸只到喉咙，“至人呼吸以踵”，有道的人一直到脚底心、到脚趾头，那就寿命长了。所以，这个观法一定要从脚趾下来观起。</p><p>同时，六道轮回，天道、阿修罗道、人道、畜生道、饿鬼道，地狱道在下面，所以，要了先了地狱道，一节一节上来，这是理论上的。</p><p>那么，后面《禅秘要法》全部的方法，佛也说了，到某一步工夫的时候，修持到某一步，不从脚底观了，从头顶上，换一下。所以，这一部《禅秘要法》是佛说的最完全的，有许多禅观经叫你眼观鼻、鼻观心、心里头……这个里头说不准是什么道理了，做不到的。怎么样的观法叫做眼观鼻、鼻观心？不是一般人所想的乱观。</p><p>那么，从顶上观下来也就是密宗后来特有的灌顶法，也就是一般所谓的修长寿法。老年身体不好了，可以从上面修下来，是这个道理。</p><p>还有别的问题没有？没有问题，跟到下面去，今天耽误（时间）了。“两向披。见半身白骨。”上一次是到这里，现在继续念下去。</p><p><strong>【见半身白骨已。次观头皮。见头皮已。次观薄皮。观薄皮已。次观膜。观膜已。次观脑。观脑已。次观肪。观肪已。次观咽喉。观咽喉已。次观肺腧。观肺腧已。见心肺肝。大肠小肠。脾肾。生藏熟藏。四十户虫在生藏中。户领八十亿小虫。一一虫从诸脉生。孚乳产生。凡有三亿。口含生藏。一一虫有四十九头。其头尾细犹如针锋。此诸虫等。二十户是火虫。从火精生。二十户是风虫。从风气起。是诸虫等。出入诸脉。游戏自在。火虫动风。风虫动火。更相呼吸。以熟生藏。上下往复。凡有七反。此诸虫等。各有七眼。眼皆出火。复有七身。吸火动身。以熟生藏。生藏熟已。各复还走入诸脉中。</strong></p><p>复有四十户虫。户领三亿小虫身赤如火。虫有十二头。头有四口。口含熟藏。脉间流血。皆观令见。】好，先到这里。</p><p>现在你看，叫我们做观想，大家想多困难……先看白骨观，下半身都观起来了，上半身这里都摆得很明白了。然后，叫我们先观自己的皮，“头皮”；头皮了解了，再观皮内在的内“膜”，等于在解剖自己；内膜都了解了，“次观脑”；脑子观到了，再观脑的脂“肪”，身上的脂肪部分；脂肪观了，你看这个解剖，解剖得很清楚啊，“次观喉咙”；喉咙都晓得了，看到“肺”，一路下来。你看，原来从背脊上来，现在一路下来了。肺看到了，再“心、肺、肝、大肠、小肠、脾、肾、生藏、熟藏。”“熟藏”是肠子，熟藏那里一节一节到了后面肛门这一边了。</p><p>他说，我们的身体……叫我们看内部的观想，观内部每一个机能上有四十户的虫，就是寄生虫，“在生藏中”，等于胃、肠的上半截。“户领八十亿小虫”，有这样多的生命寄生在我们身上。“一一虫”能够互相生出来。</p><p>你看我们身体的内部，不管你身体好、不好，那个地方我怎么看得到啊？我的天啊！白骨观修到这里，要我自己看，看得到吗？观不起来吧？哎，现在给你说了，懂了没有？观念有没有？观念就是观嘛。你就了解了人体内部本来是这样，就观了，就了解了嘛！</p><p>这个样子，不管它……同现在的生理医学（比），没有那么精详。你要记住哦，两三千年前的释迦牟尼佛把人体内部的解剖看得清清楚楚。</p><p>你说：“我身上并没有虫。”你一口气不来，摆在那里一个月看看，各种虫都来了，虫就爆发了，不是外面来的哦，里头就冒出来了。</p><p>所以……不过有一点，它同一般的医学生理学有所不同。把总的分类，又分成地水火风四种。身体内部“此诸虫等，二十户是火虫，从火精生”，就是从人身体上的热能所发生。“二十户虫是风虫”，从呼吸、从气化来的，“从风气起”。他只讲风火二虫，一个呼吸、一个热。</p><p>譬如我们身体内部，现代医学经常讲：“哎呀，哪里发炎了！”对不对？譬如说鼻子发炎了、或者肠子发炎了，发炎就有细菌，是不是啊？哦，所以，我们还有医生坐在这里。消炎的药都是杀菌的。你不发炎就没有。有些是从风来的，没有错。</p><p>他说，这些虫等，这些细菌的种子，平常在这个血脉里“游戏自在”， 是它活动得很自在啊，比我们跑那个运动场，还玩的舒服，在我们身体内部啊。“火虫动风”，火大才能增大，使气起变化。所以我们发炎了，呼吸就出问题，人一发炎，呼吸就会粗，“火虫动风。”“风虫动火，更相呼吸。”它们彼此在里头互相有依靠的，同命。“以熟生藏。”但是，它们在互相很平均的时候，风火二虫的两个作用很平均的时候，我们的熟生藏有了它，所以人的消化力强。“上下往复，凡有七反”，它在血液里跟着在循环。</p><p>这些虫等被他一描写很可怕，有七个眼睛，每个眼里都出火，等等等等……。那么，我们观得起来吗？而且，他第一个教我们，白骨一观好，先看我们的内脏，内脏就是那么一套东西。你把自己想出来，自己有那么可爱嘛，呵。</p><p>但是，你工夫定力真做到了，修白骨观修到后面，工夫真的入定了，眼识清净、意根清净的时候，你这个肉体摆在这里，内脏的五脏六腑，自己看自己，看得清清楚楚。所以，真修行到了的时候，里面自己看自己的（内）脏干净不干净、对不对，看得很清楚。</p><p>所以，《高僧传》上记载，那个印度的祖师佛图澄，到中国来，有时候到河边去，没有人看见的时候，把胃拿出来，翻过来，在水里洗洗，再把它放进去。看起来好像是神话，这个的确是唯心所现的。</p><p>所以，这一段的观是这个的意思，先把观念搞清楚。</p><p><strong>【见此事已。又见诸虫从咽喉出。又观小肠。肝肺脾肾。皆令流注入大肠中。从咽喉出。堕于前地。此想成已。即见前地。屎尿臭处。及诸蚘虫。更相缠缚。诸虫口中。流出脓血。不净盈满。此想成已。自见己身。如白雪人。节节相拄。】</strong>好，先到这里，拿个笔做记号。现在，我们观到了这一步，晓得五脏六腑，身体内部的组织……然后，要我们用意识仔细地观想，从喉咙这里下去，我们这个身体，从内部一直到下面……你们看过杀猪的，杀了猪，肚子一剖开，那个舌头一提，心肝脾肺肾一串连着的。他是叫我们不向上面提，整个都从下面“哗”丢掉了，丢在地下，也有人做到哦。</p><p>我们另外一位道友，他看一点、做一点，自己想，想到都丢在地上那个时候，“哎呀，脏的！”自己都……“噢，这不好看。”坐在那里都打颤起来。其实啊，是这样，扔在地上……。然后啊，看到这一套东西——我们现在认为我们生命很宝贵，一丢到地下以后，久了以后，臭了、烂了，烂了以后生虫。</p><p>那么，自己观想把内脏拿开了以后，我们这个白骨架子，眼睛一闭，自己看。这个时候，自己内部的观想，不是你眼睛看见，是你意识的眼睛看到自己的骨架，雪白。</p><p>我们在座好多修白骨观的，有好多位，有些能观起来骨头，自己看，观起来是黄的，对不对？平常问过我的人，我记不得是哪一位了。有些自己一定，骨头观起来是黑的——业力重，赶快忏悔，业力太重，就是本身业力太重。下面就有，“若见黄黑”，这一段开始。</p><p><strong>【若见黄黑。当更悔过。既悔过已。自见己身。骨上生皮。皮悉褫落。聚在前地。渐渐长大。如钵多罗。复更长大。似如瓮堈。乃至大如乾闼婆楼。或大或小。随心自在。又渐增长。犹如大山。而有诸虫唼食。此山流出脓血。有无数虫。游走脓里。复见皮山。渐渐烂坏。唯有少在诸虫竞食。有四夜叉。忽从地出。眼中出火。舌如毒蛇。而有六头。头各异相。一者如山。二者如猫。三者如虎。四者如狼。五者如狗。六者如鼠。又其两手。犹如猿猴。其十指端。一一皆有四头毒蛇。一者雨水。二者雨土。三者雨石。四者雨火。又其左脚似鸠槃荼鬼。右脚似于毗舍阇鬼。现丑恶形。甚可怖畏。时四夜叉。一一荷负九种死尸。随次行列。住行者前。佛告迦絺罗难陀。是名不净想最初境界。】</strong>好，到这里先。</p><p>现在，由上次讲的白骨观到达不净观。就是人，要把自己观想，真做观做起来的人，这一套东西、这个境界都现前。不过，我们大家有许多看了不相信，宗教神话。</p><p>他说，把肉体想得丢出去了——我们很不容易丢出去。你真观想白骨观，观想修到把肉体完全丢出去了以后，我告诉你经验，自己怎么呢？轻灵到极点！不过，有无限的厌恶，也有无限的慈悲。厌恶什么？哎，人这个肉体生命多么丑陋！慈悲，觉得一切众生都太可悲了，把这一个丑陋的生命抓得那么牢，自己不晓得抓一个真实的生命。</p><p>第二点，你看，然后叫我们丢在地下了，这个东西假我们意识的观念把它放大、扩大，扩大到很大，大了以后又烂了，烂了以后再观想白骨，看到地下冒出来这些饿鬼，在吃这个肉，吃这些烂肉。</p><p>我们（会）认为这个是不可相信的，大家就是信不过，不是不可相信，不可能相信。（因为）大家没有看到过鬼。其实啊，我们先不讲另外看不见一面的鬼，是有吃尸体的鬼；我们讲看得见的好不好？假设我们肉体被开了刀，或者挖了一部分丢在地上，你丢几天看看，然后把这一堆肉再拿到显微镜下化验，有许多细菌啊，有些像猫、有些像狗，各种各样多得不得了，没有错，这是现实的境界。</p><p>再说，我们假设身上生疮烂了，你把这块肉挖下来，丢在地上看看……他说，还有看到这个烂了的肉里头……“四头毒蛇”，有一个头上流下了水，有的流下石头。我们现在活着还没有烂，经常刮下来石头，有没有？有些小姐们脸上，面膜一擦，白的一块小石头，大一点就不得了，（会）变癌症的。流水的，身上的雨水，哪里一刮，血啊、水啊就流出来了，我们睡觉的时候，口水就流出来，脏！</p><p>这个样子，由白骨观到不净观，你把它观想成功了（是）第一步。所以佛讲的话，你不要看佛经讲得，“假的，都是神话。”后世真正修持的，没有人看，认为这些都……老实讲，不管你出家、在家，看到这些都信不过的，不会信的。我现在给你们讲明白了，你们就爱看了，哎，就知道佛说的对哟，真的，对不对？是这样的，你不要被我翻译的骗过去，佛给你讲的就是这个道理。所以，把自己白骨观、不净观，先看清楚。</p><p>佛再说下去，“佛告……。”（下课磬响）哦，那么快。</p><p>这不是讲理论啊，做工夫的境界，一方面听，一方面自己体会。</p></div>"
},{
    "title": "禅秘要法讲座 04",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p><strong>【佛告阿难。汝持是语。慎莫忘失。为未来众生。敷演广说此甘露法。三乘圣种。时迦絺罗难陀。闻佛说此语。一一谛观。经九十日。不移心想。至七月十五日。僧自恣竟。时诸比丘。礼世尊已。各还所安。于日后分。次第修得四沙门果。三明六通。皆悉具足。心大欢喜。顶礼佛足。白佛言。世尊。我于今日。因思惟故。因正受故。依三昧故。生分已尽。不受后有。知如道真。必定得成清净梵行。世尊。此法是甘露器。受用此者。食甘露味。唯愿世尊。重为广说。</strong></p><p>尔时世尊。告迦絺罗难陀。汝今审实得此法者。可随汝意作十八变。时迦絺罗难陀。住立空中。随意自在。作十八变。时诸比丘。见迦絺罗难陀。我慢心多。犹能调伏。随顺佛教。系心一处。不随诸根。成阿罗汉。尔时会中。有千五百比丘。乱心多者。见此事已。皆生欢喜。即诣佛所。次第受法。</p><p>尔时世尊。因此憍慢比丘摩诃迦絺罗难陀。初制系念法。告诸四众。若比丘。若比丘尼。若优婆塞优婆夷。自今以后。欲求无为道者。应当系念。专心一处。若使此心驰骋六根。犹如猿猴。无有惭愧。当知此人是旃陀罗。非贤圣种。心不调顺。阿鼻狱卒。常使此人。如是恶人。于多劫中。无由得度。此乱心贼。生三界种。依因此心。堕三恶道。时诸比丘。闻佛所说。欢喜奉行。</p><p>佛告阿难。汝今见此摩诃迦絺罗难陀比丘。因不净观。得解脱不。汝好受持。为众广说。阿难白佛。唯然受教。佛告阿难。谛听谛听。善思念之。】</p><p>（本集录音不清楚，记录的错误一定不少，请慎重理解！）</p><p>这一段，我们看到……都看完了这些经文，好多要点要留意一下。看着很方便。佛说出来的白骨观法，很最初的最初的……不净观……就得道了，我们大家也听懂了，怎么得道？啊！这个要讨论。现在，先看本段经文，再去仔细研究。</p><p>那么，佛说了白骨观、不净观的境界以后，吩咐阿难说：你把我所讲的法门记上，不要忘记了，为将来的众生，好做修习的方法。为“三乘圣种”，声闻、缘觉、菩萨三乘道的人要修持，都要拿这个来打基础。那么，佛又同阿难讲——阿难就是专门替佛录音的，脑子录音，他的脑子（对）听过的佛讲话，一句不会忘记的，都记得，所有经典后来都是他讲出来的。</p><p>那么，再回转来说。当时，迦絺罗难陀听佛说了白骨观与不净观的方法以后，他依教奉行，自己老老实实地用功，照佛的方法“一一谛观”，一步一步都不放弃地做，多少天呢？“九十日”，他学了佛的这个教法以后就开始修持，九十天，一百天不到，三个月。三个月“不移心想”，第二个念头……专做白骨观、不净观，照这个次序来修，绝不变。</p><p>我们晓得，这个很严重，“不移心想”！我们有许多学佛的人，学个法，修几天：哎呀，不对，我还是念佛吧……再念几天，不对，我要修密宗……不对不对，我还是道家搞搞蛮好……再不对，呼吸止不了，就看趾头……趾头看看也差不多了，不对，还是数息观吧……所以我们普通人之所以没有成就啊，这就是个大问题。</p><p>你要晓得，你聪明，绝没有迦絺罗难陀那么聪明吧，上面所说法都听过，不是一生，生生……这一下，聪明人走笨法，走非常老实笨的路子，是“谛观，经九十日，不移心想”，这三个月干什么呢？就是整个假期——佛教的制度，夏天结夏，就是大家集中在一起，不准在外面化缘。</p><p>因为印度的中印度到南印度天气热，热得呀，各种生命虫啊、蚂蚁都出来，杀生的机会多，这是一个理由；第二个理由，热，没有办法出去，太热了，温度太高了。那么比丘们出了家，做佛的弟子，光着，像印度人一样不穿衣服，跑出去不礼貌，穿着衣服又太热……佛的制度是关起来，大家一起在修持。到了七月十五，暑假过了……那叫“僧自恣”，自由自在的这个夏天的生活过去了，开始恢复游行、教化、化缘。</p><p>所以，七月十五那天，“僧自恣竟”，过了，大家临走之前——当然，三个月都跟着佛在一起修的。所以，“时诸比丘，礼世尊已”，很多的出家佛弟子向佛告别，磕了头，“各还所安”，每个人都回自己的庙子，回自己的茅棚去。“于日后分，次第修得四沙门果。”那么，弟子们回到了自己出家、自己修持的地方以后……怎么叫“日后分”呢？夜里，每个人都很用功，慢慢证得四果罗汉的果位。</p><p>所以，由修白骨观、不净观这个法门，证得四果罗汉，“三明六通，皆悉具足”。所以，每个比丘又回来，证得了的人，高兴，回来找老师、回来找佛，“心大欢喜，顶礼佛足。白佛言。世尊。”</p><p>这又是一个重点来了。第一个重点是“经九十日，不移心想”，这两句话，你看，我们做得到吗？做不到！不要认为自己比他们聪明，修了两天三天，或者搞了两三场打坐：哎呀，反正白骨观我没有希望了……你当然没有希望了，你本来没有希望，你不要把你当成希望……你能够像这样修？！所以这两句是重点。</p><p>现在的重点，回到佛这里后，“我于今日因思惟故，因正受故，依三昧故，生分已尽，不受后有，知如道真，必定得成清净梵行。”这一段是要点。这些佛的弟子们，回去修持证果了以后，来向佛感谢，感谢他提到经验之谈，我们后世学佛……。他说，我现在因为正思维，观想不是正思维，我前天告诉你们正思维怎么讲，修白骨观，里面五脏六腑看得清清楚楚，都是正思维。</p><p>因正思维故，并不是说，把念头放下，懒得想就叫做得定，你们自己懒得想叫做思啊？那正在昏沉无明中啊！不得了的啊！越来越懒、越来越笨、越来越坏。怎么坏呢？因为喜欢懒，念头不喜欢动（不）做正思惟，所以，任何一个贪嗔痴慢念头一来，越来越重！</p><p>所以，正修啊正思维……因为正受、正思维，“因正受故”，你做白骨观、做不净观以后，一步一步工夫，你看脚趾头的白骨，不要说多，你左边大脚趾头的白骨一想起来了，真的被你观起来，马上人就变了，自己的感觉就变了，或者是发暖，或者一切都变了。</p><p>但是，这个时候有许多人，或者气脉动了，平常学密宗、修道家有经验的：哎呦，里头督脉也动，任脉也动……你跟着气脉走了就不是正受！三昧是正受啊。因为你现在是在修白骨观，你的正受就是左边的大趾头，这个肉没有了，肉烂了，这个白的白骨这一点，这一点看清楚就是一心不乱，这就是你的正受！</p><p>那么，身上所起的暖相、所起的舒服的相、所起的气脉震动相，那是正受所发的余波，不要跟着这个余波走，这才叫做正受。</p><p>所以他说，“我于今日，因思维故，因正受故，依三昧故”，什么三昧？白骨观三昧、不净观三昧。“生分已尽”，这一生就了了，“不受后有”，不来了这个世界，欲界里不再来玩了，再也不来了。</p><p>“知如道真，必定得成清净梵行。”现在我们晓得，真正学佛学道的人，得了正道，这一生一定可以即身成功，得到清净梵行。所以，下面赞叹这个法门，而且，这些弟子们希望佛再回转来，为后来人要求……因为这是一个甘露法门，希望佛再说。</p><p>那么，佛也找个证明，找个学生来表演，就告诉迦絺罗难陀，他说：你现在，因为修白骨观、不净观证道了。他说对。你做给他们看，现身现十八变、现神通，所谓“十八变”，这个肉身可以一跳，意念一动就站在虚空中，上身出水，下身出火，各种变化修成了，“十八变”。迦絺罗难陀听了佛的吩咐，马上立在空中，“随意自在，作十八变。”</p><p>那么，这些弟子们一看，迦絺罗难陀平常傲慢得很，脾气又坏、又傲慢、学问又好，……眼睛看天花板的人，这还得了。看到迦絺罗难陀“我慢心多”，又有我慢，心眼又多，嘿！结果都调伏了，自己能够调伏，皈依佛法僧。一心不乱，调伏了。</p><p>“随顺佛教，系心一处，不随诸根，成阿罗汉。”阿罗汉怎么得的？这里法门都告诉你了。只要你“系心一处”，哪一处呢？这个是问题，下面都有（讲）啊。把心念专一，就定在那一个地方，不跟着六根转。眼睛看着外面好看的，这个眼睛就会动，眼睛一动，心就跟着跑了；耳朵听人家讲一句话：“你看这个家伙装模作样……”“怎么样，我在打坐啊！”耳朵跟着跑了，意根也动了，六根都随诸根而转，没有系心一缘。</p><p>所以你注意哟，要想怎么证道，“系心一缘，不随诸根，成阿罗汉。”这是重点，重点都要记起来。这就是秘诀了，修持的原则。</p><p>所以，大家修持不能系心一缘，系就是把心拴拢来，你说：我拴不住啊！像今天有个同学来问一样：“老师，妄想太多，怎么有个法子把妄想……”有个法子，妄想不是更多了！就是这个道理，你把心拴一拴嘛，就拴住了嘛，学笨法嘛。</p><p>那么，当时会中，“有千五百比丘”，注意这四个字，“乱心多者”，同你一样，都是散乱心。看到这个事，就立刻“生欢喜”，都到佛这里“学法”，学这个白骨观、不净观。</p><p>那么下面一段一段……所以，佛就告诫：“若比丘，若比丘尼”，“若优婆塞优婆夷”，男居士、女居士，“从今以后”，你们真想求佛法，“应当系念，专心一处”，这是学佛法的基本。</p><p>所以，大家念个佛号也是系心一念。但是，佛号那个路虽然也是有分别影像，它无处哦！把心系得很远，系到西方那里喔，很难栓得住，你没有那么长的绳子。现在教我们白骨观、不净观，系自己身体内在的，系心一处一做到了，嘿，就证果，这是佛说的。</p><p>假设，“若使此心驰骋六根”，六根跟着跑，像猴子一样的，他自己（还）不惭愧——你要晓得，大家自己反省啊，反省这个毛病。“当知此人是旃陀罗”，印度人讲的贱种，刽子手啊、杀生的啊……贱人、贱种第四种阶级……。换句话，你这个人自甘堕落，自甘下贱，“非贤圣种”，不能得道。</p><p>“心不调顺，阿鼻狱卒，常使此人”，他说你的心不能专一的话，地狱里的鬼就跟着你；而且你心里头有鬼，经常指挥你，鬼指挥你，魔鬼指挥你。重点在起心动念……。所以，“阿鼻狱卒，常使此人”。</p><p>“如是恶人，于多劫中，无由得度。”什么叫“大恶人”？心太散乱就叫恶人，佛经上说。这样的恶人，于多生累劫里，永远不会得度。“此乱心贼，生三界种”，你要晓得，就是因为乱心，所以堕下三恶道，地狱、畜生、饿鬼。所以这一段是学佛要点。</p><p>那么，我们现在做一个结论，学佛修持的方法很简单，如何系心一处，专心一念，怎么做到？那么佛，现在告诉我们第一步，白骨观、不净观，把自己观起来，自己随时变成个骷髅架子。</p><p>那么我告诉你经验，你只要一观起来，无比舒服，那真是觉得自己“纵然白骨也风流。”……一直到达。有病的，你五脏六腑那些肉统统丢在地下给鬼吃了嘛，观完了嘛，病痛从何而生啊？！没有了，自己就把它开刀拿掉了。</p><p>再，你观一下，下面有（讲到）的，观白衣观世音菩萨从那个净瓶里头，那个甘露水从你头顶灌下来，做个日轮观，太阳一照，钴60自己就照了，照了以后，癌（症）都把它照化了，骨也把它化空了、化光了，一片光中……最快的路子！希望大家真能够修到。那么，这是第一步。</p><p>（同学问：老师，有几个问题要请教老师。第一观，可以说是从白骨观到不净观，我这里有个感想：以我们平时的骨头来讲，就是所谓四大，四大来讲，以地大最粗……当然，像我们的肌肉、骨头，都算是属于地大。这个肌肉跟骨头之间，可以说骨头比肌肉要粗。他这个第一步观法，先从骨头观，从下面观到上面，然后又从上面开始(下来）改不净观。照说，白骨真观起来，那又何必又来修这个不净观呢？再说，应该先从不净观起，因为我们骨架外面包着皮、肌肉、神经系统,那我们从不净观来讲，应该先观这个肌肉，把这个肌肉拿掉，先观烂掉了，那白骨观不就观成了！为何不先从不净观开始，然后，白骨就自然现前了，这个是什么道理？)师插话：你讲得有道理。（还有第二个问题：里面关于什么虫的，有四十多户虫啊，或者是七只眼啊，还有九个头的，是不是真有这样子的虫，还是这个是象征代表什么意思？七个眼睛是象征什么吗？我这两个问题，请教老师）</p><p>你问得很好，也问得很对，真修持应该如此，问的好！</p><p>普通我们讲修持，白骨观……你现在了解了这个身体四大。骨头是地大变的，骨头是最粗的，粗重，最粗最重。所以，《瑜伽师地论》再三强调提到，凡夫、没有修持的人，身心都很粗、很重，拖累很大，证了道的，相反的名字就来了，变成轻安。那么，白骨观的修法呢，就是在四大里头先观成白骨，把肌肉都拿掉，我们看到桌子上摆的白骨架……大家也许有人跟从智法师同感，想问没有问。</p><p>那么，这个白骨照佛这样说，整个地观起来了，自己就是这样一个白骨，像这个架子一样已经观起来了，为什么要反转来，再到前面把五脏六腑都丢掉呢？问得好！你们晓得吗，这就是所谓《禅秘要法》，这个密法拿到了，但关键的这个钥匙没有开开。</p><p>第一，我们晓得，佛叫我们观白骨的时候，先观脚趾头，同焦先生过去自己所经验过的一样，他叫我们先把肉拨开，对不对？肉拨开了以后，先把骨头露出来，我们冬天吃橘子一样啊，呵呵，就是先把它拨开了，白骨观起来了。这个时候，白骨观上来了以后，到了上半身，一直观到头，对不对？你看看书上。那么，再叫我们观皮，把肉跟皮，剥橘子一样一起剥下来……那么再来呢，把皮慢慢剥掉，剥开了以后，从前面一直下来，然后叫我们把五脏六腑都从下部……像这个骷髅架，从下部这个地方“啪”地把它丢在地上。</p><p>这同天地自然，同我们现在生命的道理——你们学过医学，我们的骨头架子一直靠背脊骨这里——中枢神经，整个的神经……至于我们的自律神经呢，人为什么脚痛啊，中风啊，手啊都不能做主了，那就是自律神经、自觉神经又是一个系统，自主神经这个系统就是五脏六腑一路下来的………（录音不清）就是这样。</p><p>这个自主神经系统，我们道家所谓怎么（讲），你骨头架子观起来，是督脉这个系统把它打通了，也把它去掉了、空掉了。任脉还没有，可是他没有讲这个，所以是奥秘，最好不需要懂，不讲理论，你做到了，自己就清楚了。</p><p>所以你问的好，是有它的理。所以，它转过来，换句话，叫我们从底下先观好，向上观，再从上面降下来，向下观，把内脏都空掉。就是这个理由。</p><p>至于说，丢下来以后，我们看，什么九个头（的虫）啊……你要是研究过微生物，研究过细菌学，你看那个很小的细菌，显微镜放大……什么须子啊，多得很啊，好多，佛说的还是大的，那细讲就很多。就是讲，我们这个生命那个细菌，其它所谓附着的生命细菌多得很。</p><p>所以，我们身体活着，气机健康的时候，真正健康的，这些鬼呀、细菌呀——也可以叫它是鬼，起不了作用。等到你身体一衰老、一毁坏的时候，它都起作用，都是毁坏你的东西……就说被饿鬼吃了，都是这样，最后，都化为空。</p><p>（同学问：那为何不从前面肌肉……）那倒转来修不通的，倒转走，走不通的啊。如果倒转来这样修观，先从肌肉部分，先从内脏上（观），这就是我们道家的方法。密宗、道家后世走这个法子，观气脉、三脉七轮，观了半天，大家弄得血压高、心脏病，那个倒转来修并不对，修不好，很多容易出毛病。第二，而且身见去不掉，最重要的是身见去不掉。他这样一个动机，自然的法则……一来就把白骨观来，身见、我见很容易去掉，走渐修的路子。</p><p>那么，再看下面，研究第二观。第二观的修法并不一定叫我们照次序来，最好照次序来。</p><p><strong>【第二观者。系念额上。谛观额中。如爪甲大。慎莫移想。如是观额。令心安住。不生诸想。唯想额上。然后自观头骨。见头骨白如颇梨色。如是渐见。举身白骨。皎然白净。身体完全。节节相拄。复见前地诸不净聚。如上所说。不净想成时。慎莫弃身。当教易观。易观法者。想诸节间。白光流出。其明炽盛。犹如雪山。见此事已。前不净聚。夜叉吸去。复当想前作一骨人。极令大白。此想成已。次想第二骨人。见二骨人已。见三骨人。见三骨人已。见四骨人。见四骨人已。见五骨人。如是乃至见十骨人。见十骨人已。见二十骨人。见二十骨人已。见三十骨人。见三十骨人已。见四十骨人。见四十骨人已。见一室内。满中骨人。前后左右。行列相向。各举右手。向于行者。是时行者。渐渐广大见一庭内。满中骨人。行行相向。白如珂雪。各举右手。向于行者。心复广大。见一顷地。满中骨人。行行相向。各举右手。向于行者。心渐广大。见一由旬。满中骨人。行行相向。各举右手。向于行者。见一由旬已。乃至见百由旬。满中骨人。行行相向。各举右手。向于行者。见百由旬已。乃至见阎浮提。满中骨人。行行相向。各举右手。向于行者。见一阎浮提已。次见弗婆提。满中骨人。行行相向。各举右手。向于行者。见弗婆提已。次见瞿耶尼。满中骨人。行行相向。各举右手。向于行者。见瞿耶尼已见郁单越。满中骨人。行行相向。各举右手。向于行者。见四天下满中骨人已。身心安隐。无惊怖想。心渐广大。见百阎浮提。满中骨人。行行相向。各举右手。向于行者。见百阎浮提已。见百弗婆提。满中骨人。行行相向。各举右手。向于行者。见百弗婆提已。次见百瞿耶尼。满中骨人。行行相向。各举右手。向于行者。见百瞿耶尼已。次见百郁单越。满中骨人。行行相向。各举右手。向于行者。见此事已。身心安乐。无惊怖想。心想利故。见娑婆世界。满中骨人。皆垂两手。伸舒十指。一切齐立。向于行者。于时行者。见此事已。出定入定。恒见骨人。山河石壁。一切世事。皆悉变化。犹如骨人。尔时行者。见此事已。于四方面。见四大水。其流迅駃。色白如乳。见诸骨人随流沉没。此想成时。复更忏悔。但纯见水。涌住空中。复当起想令水恬静。佛告阿难。此名凡夫心想白骨白光涌出三昧。亦名凡夫心海生死境界相。我今因迦絺罗难陀。为汝及未来一切众生等。说是白骨白光涌出三昧门。为摄乱心渡生死海。汝当受持。慎勿忘失。尔时世尊。说此语已。即现白光三昧。一一相貌。皆令阿难悉得见之。尔时阿难。闻佛所说。欢喜奉行。此名白骨观最初境界。】</strong>　</p><p>好，这一段，我们先念完原文。注意，有几个重点啊。白骨观，像佛告诉我们的修持方法都非常简单，观起来了以后，第一步，白骨观、不净观照经典上告诉我们的方法做到了，然后系念额头上，是这里（师手示）。你要晓得佛法进来，后来变了，道家有些传你（系）念这里了，有些传是在头顶上，——都是佛家的白骨观法变出来的。我们现在就晓得找出这些思想的来源了。</p><p>但是，佛法讲修持的次序是呆定的，先把前面的白骨观、不净观做好了，佛现在给你们补充啊，（没有）做好了以后，你马上要观这个地方不行哦，没有做好（就）观这个地方，血压会高的哟，血压高不行。（但是）若把前面的白骨观、不净观做好了，你不观这里也不行哦，怎么不行呢？嗨，不观这里不舒服，白骨观、不净观做好了的人，心念清净专一了，系心一缘——密宗，特别是道家，要求气脉，在这个白骨观的修法里不谈气脉，但是气脉有没有呢？自然有，到了晚上，那个精神，噢，昼夜头顶……诸佛菩萨给你灌顶一样，都在光中。这个光中，你（若）作意思维，天眼这里都会开的，所以自然会系心在这里。所以你看佛像，有许多画的有三只眼睛，这里开一只眼睛，就是这个地方。</p><p>所以，第二个是系念在这里，其它的白骨观本来叫你从脚趾头观起的，对不对？有些人，你们有些人刚才问问题，不大愿意啃脚趾头啊，这一下啃头骨来了。</p><p>叫你“系念”，“谛观额中”，叫你自己——不是拿眼睛去看啊，意念境界。“如爪甲大”，指甲那么大的一块，头顶亮光，照见三千大千世界，头顶上会照见。四个字啊，“慎莫移想”！念头就在这里，白骨。这一节白骨如玻璃似的，它不是玻璃、金刚钻。换句话，变成了透明的雷达电眼，专定在这里，“如是观额。令心安住”，使心安定下来。所以有人不肯起定啊，他在这个境界“不生诸想，”其他妄想一概没有了，“唯想额上。”</p><p>由额上这一点，观自己的头骨——这个骷髅（模型）的头骨并没有做好，马马虎虎，实际上，头骨（是）由好几块兜拢来。“见头骨”是一块一块兜拢来的，“白如颇梨色”，所以头骨这个地方有个十字缝。实际上，假设你把头骨这里一打开，像西瓜一样，七八块头骨像莲花一样。这里一打开，一身白骨不要观，自然就出来了，“白骨”“皎然”，“皎然白净”，看到全身的白骨，这个时候观起来了，“身体完全，节节相拄”，就是这样一个架子摆在这里，心完全定住了。</p><p>那么，前面不是叫我们把内脏观到都丢在地下，给狗吃了——不是给狗吃了，给鬼吃了，那些饿鬼啊，有怪相的都来，一个一个飞起来吃。等于我们……其实你不要觉得：哎呀，好脏啊！我的肉身……你到中央菜场看看，我们就是饿鬼啊！把那个猪啊一条一条割来吃啊！哎，没有什么稀奇呀！你不要把自己看成了不起，我们吃人家的肉，人家饿鬼吃我们的，一样的。</p><p>这个时候，有一句话千万注意啊，“不净想成时，慎莫弃身”，这个时候会不想活的。所以，佛在世的时候，好多罗汉当时舍身自杀了，他观想成功了：哎，这个人身有什么用！结果嘛，有一个罗汉，也是佛的弟子，本来是外道出身的，他也观成了，观成以后，他跟大家……有些想自杀，杀不下去，他说：“我专门会杀。”他说：“那你就帮忙了。”他就给人家帮忙，就切菜瓜那样在那里切。后来佛过来了，这怎么搞的……。你看，佛他老人家在世的时候，也发生过这个案子。我们的检察官就要赶快去验尸体了。他一个一个在切，因为大家要他切嘛。</p><p>所以到这一步，很容易灰心，把自己自杀了，不想活了。所以佛告诉你，这一步（还）没有完成，他说：你“不净想成”，修成功了，“慎莫弃身”啊！不要把这个肉身丢掉啊！你还没有完成，还早的很呢！“慎莫弃身”，你看，特别提醒你注意。</p><p>那么，这个时候他叫你怎么办呢？你人是会发生很大的厌离心，讨厌自己，讨厌……没有可爱的！他说，诶，赶快 “易观”， 要转换方法，“易观”就是换方法。现在下面教我们第二步的方法，“当教易观。”</p><p>你们将来教别人也是这样，真有人修到了这个程度，赶快叫他换方法，不能再修这个方法，不净观不要修了。“易观法者”，这个不是白骨流光，佛告诉我们，这个叫“凡夫心想白骨白光涌出三昧”。</p><p>这种修法教我们怎么想呢？调一个方法，想每一个骨节，我们骨头里的，自己放出光来。这个光啊，光亮得很，每个骨节里都放光，“犹如雪山”，照亮一片。也是你用意想出来的，一切唯心哦，你硬想出来的。</p><p>有些人修到这里想出来，有什么效果呢？你夜里在房间里，灯都关灭了，一点亮光都没有——什么都看见，自己本身放光了！</p><p>所以，佛图澄到中国来弘法，那个时候没有电灯耶，他胸口里有一团棉花，他晚上要看书的时候，把那个棉花一取就照亮了，别人一进来看到他，他就遮起来，不给人看见。所以当时人都皈依佛法，很多啊！</p><p>第二点，你白骨观修到这个时候，白骨会流光的，那么，这个光明很盛，雪白一样。</p><p>这个不是想，也不是观，你看书上有个字，“见此事已”，实在的境界会来。就是刚才告诉你的，整个房间不要点灯，整个亮了，自己还在定中，整个亮了。那么这个时候，身心之舒服，那当然不要讲了。</p><p>这个时候，你观想丢在地上（的）不净观，自然被饿鬼搬走了，搬到中央菜场去卖了，卖人肉去了，你就不想了，他就卖你了。你只要想，就是改变方法想，我们自己觉得（是）一具白骨在这里，这个白骨当然还是我了。</p><p>那么，再观想，同样一个白骨人站在这里，由一个想两个，两个想三个、想五个、千千万万个，结果想到全世界、宇宙所有的一切众生都是一具白骨而已。都举着右手，向“行者”，行者即修行的人，就看到白骨人一个一个向你行礼、过去了、行礼、过去了，很好玩，哈，这个图案好玩。</p><p>最后想到这个全世界里头的人类，都是机器人，就是一个白骨架子在走而已。</p><p>他说，这个时候，你看到最后，“见此事已”，确实境界现前，“出定入定”的时候都看到，看到人都是一具骷髅。那么，这个时候有什么境界呢？注意哦，下面重点都要圈起来了，“山河石壁，一切世事，皆悉变化，犹如骨人。”你到了这个境界，修持到了，你看这个物质世界的一切，山也好、大地也好、石头也好，一切世间的万物都如白骨……。</p><p>那么，你修到这个时候，看到……刚才从智法师讲，修白骨观要先观地大，身体上修这个地大，跟着水大观来，见四方八面水流出来，白色的，牛奶一样白。然后，这个白水把这个世界上所有的白骨人都飘走了。那么飘走了，你渐渐……惭愧，就要起慈悲心了。</p><p>然后啊，由地大观、白骨观成就了，水观成就了，这一切成就了……。</p><p>白色乳白的水，这个水就是充满了整个的虚空。（同学问：为什么要流水？）是啊，修水大观嘛，地大化掉了，水起来，修水大观。</p><p>那么，这个水完全“恬静”了……所以，这个叫什么呢？“凡夫心想白骨白光涌出三昧”，另外一个名字，也叫做，“凡夫心海生死境界相”，生死海就是水。</p><p>有骨，然后先有水。男女交合出精，做爱，水大，就是这个水大。所以，这个水不是普通哦，乳白色的，生命的根本……。这还是第二步的修法。所以，这个水是“凡夫心海”的“生死境界相”。在我们身上的精都是这个变的。</p><p>佛又同阿难讲，“为汝及未来一切众生等。说是白骨白光涌出三昧门”，这个法门还是为了修定，为摄乱心，“渡生死海”，真正了生死。“汝当受持，慎勿忘失”，你好好去修，不要忘记了，流传给后世。</p><p>那么，佛说到这里的时候，自己耍一个神通给你看，自己玩一个，“即现白光三昧”，“一一相貌”，都使阿难看得清清楚楚，叫他做记录的时候，把这个情形记下来。</p><p>那么，佛给阿难（等）亲口讲了这个修持方法以后，这是白骨观最初成就的境界，由白骨观已经进入到《楞严经》上所谓“水观三昧”——《楞严经》二十五位菩萨，修持圆通的时候，有修水观三昧，也由白骨观……所以叫“最初境界”。</p><p>那么刚才有人问，为什么要有这个水呢？就是水大。所以，我们凡夫三界的第一个重劫，也是水劫；我们修持的第一个难关过不去的，也是欲念来的，就是荷尔蒙的变化。荷尔蒙内分泌就是水大变的。所以男女漏丹啊……清清静静的两个人，结果稍稍这个荷尔蒙增加一点、多一点，两个人就像狗一样去追去了，就为了把这一点点水流散了，就没有事了。</p><p>地水火风在这么的变化，这个物质的东西、物理的东西，就影响你在生死海中漂流。或者白骨观观了以后，你到达这里……。这一境界，你修到这里，不是观哦，这一步你注意哦，有一个字哦，到这一步不是观字，对不对？“见”，硬是那个境界现前，看见，不是眼睛看见，意识的境界里都清清楚楚。</p><p>所以，这一些修法……后世一般佛教，学佛证果的非常少，因为大经典来了，尤其禅宗啊、净土宗兴盛啊，噢，认为这些是小法，小乘的法子，没有意思！小乘法子啊才是佛法呢！佛亲自告诉你修持的经验，是秘密，非常重要，也非常切实。</p><p>（同学问：老师，提到的白骨人都各举右手，有什么道理？）对，右手啊，你看，有个道理，这个地球南北极的磁场，由北极向南，所以中国的文化，坐北面南是帝王的坐法，太阳从左边到右边，就是顺手。所以佛经里“右绕三匝”，我们人体做事也都是右手，就是这样，这个气脉，由左到右这样通的，是顺转。逆转呢？回到涅槃去了，那就好了。顺转是生法，所以“右绕三匝”。</p><p>但是，这个顺转在真正的生死海中是生法，逆转是灭法。所以都举右手，像我们人都喜欢用右手。最后，（录音听不清）……。</p><p>所以，你修持到那里以后，到那个时候有这个境界现前，有些人一打坐坐在那里，定力好了，硬是眼睛开着也好，真有人给你磕头顶礼啊，有些怪里怪相的，妖怪一样，都有啊，不要怕，修白骨观就是……嘿，这有什么！妖怪也好、鬼也好，哎，我都是白骨，你要啃骨头，你拿一块去啃。然后你把骨头一化光了，影子他都找你不到，你就（录音听不清）……。</p><p>所以，右手，佛经的“右绕三匝”也是这样讲。你们上殿，和尚右绕佛前向前面走，你们有许多……我看到你们有个人向左边走，就错了。这个道理。</p><p>赶快修持这个法门吧！有病的无病，要想长命的得长命，要想成道的得道。</p></div>"
},{
    "title": "禅秘要法讲座 05",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>噢，那么多问题呀？这些问题答答完了，两个钟头就没有了。（同学插话）嘿嘿，没有关系，你还年轻啊。</p><p>今天很多问题，第一个，先答重要的问题，有人问白骨观的修法，怎么样修法？看起来很好玩，我们现在教的，就是根据佛所说的白骨观的修法，还要问怎么样修法，这不是很滑稽，但是啊，也蛮有道理。</p><p>就是说，白骨观的修法，假设以打坐来讲，大家第一步先静坐，就是上座静坐，什么数息观、念佛这一切等等的方法都不需要用。第一步，上座就是盘好腿坐好，完全放下，静坐。不管你一分钟、两分钟、几秒钟，你自己觉得心境比较宁静——说真正静坐，绝对坐到静，这个境界是很不容易的，自己感觉上比较宁静了，那么，照规矩的修法，就是从十念法前面的次序来。或者心中先念佛，念几声南无本师释迦牟尼佛，不是念阿弥陀佛，南无本师释迦牟尼佛、南无本师释迦牟尼佛……，合掌念更好，很恭敬的，念佛求佛的加被，希望这个白骨观法，能够很快速地修成就，念佛。念法——本身白骨观的法门就是法。念僧，你只（要）心里念到，像佛的弟子等等，许多证果的圣贤，都是由修此法门成就的；或者心里念一句“南无十方圣贤僧”，就是已经得道的，就是求加被，求他力的加被，帮忙自己快一点成就。</p><p>然后，修白骨观法。现在经典上告诉我们一步一步的观，这是为了教人，佛的教授、教育的方法，有次序、有程序的，很分析的给大家讲，教我们怎么做工夫。</p><p>实际上，你工夫熟练的人，或者静坐有经验的人，或者初步开始学，心境已经……白骨观，我们大家现代人，很少真正看到坟墓上死人暴露的骨头，那么就拿这个模型……怎么观法？不是用意硬去想，第六意识观不出来的。</p><p>这一点，必须要了解一个学理，我们这个意识能够思想同感情，这是第六意识；意识的背面，意识背后的反面还是意识，唯识学上有个名称，叫独影意识、独影识，也叫做独头意识。就是现在心理学所讲的潜意识，另一种翻译叫下意识。现代心理学有时候乱比方，认为第八阿赖耶识就是潜意识，这是错误观念。</p><p>潜意识、下意识（是）第六意识的反面，独影意识。所以有一个翻译叫独头意识，怎么叫独影、独头？我们做梦的时候，眼睛眼识没有动，耳识也没有听见外界的声音，睡着了嘛，眼耳鼻舌身不动，眼耳鼻舌身前面五个伙伴都没有动，那么，怎么会做梦，梦中也会看、也会听、也会吃，这（就）是梦中第六意识的独影作用，怎么叫独影？它不靠眼耳鼻舌身前面五个伙伴帮忙，它自己单独反影过去、现在、未来的景象，所以叫独影意识。</p><p>其实独影意识不一定（只）在做梦的时候，有时候一个人在白天，有时候无意之间好像愣住了、呆住了，在呆住了的时候，忽然一个——我们普通讲直觉、灵感，有很多直觉与灵感都属于独影意识。</p><p>所以，观这个白骨的影像，这属于修持瑜伽的方法，是属于有分别影像。这个有分别影像观法的时候，独影意识起的作用就是独影意识的带质境。所以，把白骨的模型看清楚了，那个时候不是用意识硬去想，就是迷迷糊糊先有这么一个影像来。</p><p>这个带质境在唯识学里也有分别，是假带质境，换句话，是个幻影，幻化的影子。真带质境，第八阿赖耶识的真带质境，那是整个物理世界，三千大千世界宇宙万有，是第八阿赖耶识的真带质境。现在是第六意识的假带质境起观。</p><p>由起观这个有分别影像，这是个影像，慢慢把这个影像观实在了……我不是已经讲过，你把分别影像，不管它在内、外、中间，有这么一个影像定住了，比较明显了——注意这句话，明显不是说眼睛看到，在意识的境界上比较显明了，能够相当定住了以后，它自然而然回转到身上来了，跟你身心合一了。那么这个时候，以不分别的意识，看自己的脚趾头、全身的白骨，很快的，刹那之间很容易，一气就观好了。</p><p>像我们佛说的程序有那么久，一样一样，由骨头一节一节来，其实一节一节来……真到了那个定力一回转，止观一起来的时候，一回转来，刹那之间，一身白骨就呈现了，人就马上轻松了，身心，生理与心理柔软了，譬如有病的，像血压高的，马上就没有了，像心脏什么……因为跟着的是不净观，心肝脾肺肾一下拿空了，就是前面这个骷髅一样，它就没有感受了，这一切病痛就化了。</p><p>所以，有几个人问：白骨观怎么修法？他问的有道理，现在告诉你是这样修法，就是这样开始修。</p><p>然后修到，能够上坐下坐随时……最后白骨观起来了以后，那么下面，佛会一步一步讲下去，白骨流光，白骨里头就化光，化光以后慢慢白骨化空，人就住在整个无云的晴空里头，“无云晴空”四个字，没有云的天晴的时候，不是普通的天空，天晴的时候，天上一点云都没有，蓝色的晴空，天上是蔚蓝色的晴空。那个时候没有自己的身体，没有一切的感觉，整个的无云晴空即我，我即无云的晴空，无比的舒服、无比的安详、无比的轻松、无比温暖，没有身心的感觉。</p><p>这就是白骨观……有人（问的）第一个重要的问题，怎么样修法？今天，再重复讲一次，希望大家记得，不要再问到前头，又倒转来不了解了。</p><p>第二个问题，有人问：像第一观里头，白骨观与不净观，说人身体上内部有四种虫，每一种虫都有二十户，就是二十个大类。那么，有两种很严重的在生藏——佛经所谓讲的生藏，就是喉咙以下，肺、心脏、肝脏、胃、肾；熟藏就是大肠、小肠，尤其是大肠这一节。我们不但是胃会消化，肠子也会消化，吸收的不同，学过医的就知道。所谓肠胃病，严格地讲还是两种，有些是肠不好，有些是胃不好。</p><p>那么，他说这些虫，风火二虫只管生藏，风与火，说这两种虫各管二十户，那么各有四十亿细虫，那么，这位同学提出问，说我说的是“细菌”？我讲错了，呵，所谓虫是佛学的代名词，可以换个……所谓虫是形容词，说细菌在里头，人体内部是有的，不是那么……这些东西就是形容一个活的细胞，（是）活的细胞，不是细菌，因为我随便讲“细”字，就跟着“菌”字带出来了，就是形容我们的细胞。</p><p>所以，这个细胞有些是发热的作用，变血，有些是化气，乃至于说，中间这个变化很大，不能用现代的医学来解释。为什么道理？细胞已经是现在医学的名词，姑且借用这个医学的名词来做解释的，它是不是属于细胞，很难讲。就是身体上有发热，就是生命本能。譬如我们为什么吃饭，吃面包？天气冷，吃一口东西就会热起来？因为卡路里加进去了，能够发挥热量的蛋白质这些东西一吸收了，它就发热。那么，这些东西在里头变化，不一定完全变什么细胞啊变什么，复杂得很。就是现在的医学看着很进步，还不能解释。</p><p>因为医学不断的（在进步），现在全世界五秒钟以内，几百万份的医学报告（就）出来了，真正一个学医的也看不完啊，没有办法了解，新的太多了，新的观念、新的知识发现。</p><p>那么，佛在过去几千年以前，他是（用）归纳的方法，统统归纳起来，地、水、火、风。这个地水火风，我们普通讲普通的佛学，只是四个名称，现在讲实际的工夫，我们身体内部发热的，能够生长气的，这个东西是活动性的，有生命的作用。在我们大生命里面，它单独有小生命的作用。当它在健康的时候，它所谓是细胞化血，变我们的血液；化气……当我们的身体一衰败的时候，这些东西一腐化了，它就变成细菌了。所以，佛拿虫来形容它，是有它必然的道理、有它确切的道理，它内部一衰老、一腐化，就变虫、变成细菌。</p><p>那么，风火两样，就是地水火风的两种，是生命最重大的……。在我们中国古老的医学（讲），就是两个字“营”、“卫”，一个是管血，一个是管气。那么在佛学（讲），四大里头就是风火两种。所以学中医，读《黄帝内经》就是营卫。</p><p>我们血液的流动，大家只晓得（靠）心脏，一个泵一样打动，就（使血）全身流行。实际上，心脏（除了）打动血管内外，还有气化的力量在推动，并不是像我们自来水一样，光靠水的压力，它两个相辅而行、相对而走。</p><p>所以，佛教我们观清楚内脏。这个内脏观清楚了，然后把内脏空了……</p><p>再补充一点。他所以用虫来形容、比方，如果不是这个理由，这个同学问的也很对，怎么叫虫？譬如我们讲，人身上有精虫，拿男人来讲，女人身上有卵藏，这个卵是蛋，也是活动的生命。请问：这个精虫，如果我们身上有那么多精虫在，这个人的精虫有百把年、百把天都不发泄的话，那我们不是被精虫都把我们给咬死了！有那么多虫嘛，精虫一定有的，这是什么理由？就是这个理由，所谓精虫，是有这个东西，当欲念没有动，当欲的行为没有到某一种程度，它是个气，不是虫。经过某一个刹那之间一变化，它就有那么多。</p><p>譬如人，以男性来讲，一次排泄的精虫，现在的医学晓得，起码是六万条到十二万条之间，一次排泄的精虫有六万到十二万——所以我经常说，佛的形容有多了不起！几千年以前，他说我们人身难得，如大海之盲龟呀！我们这个生命犹如大海上一只瞎了眼睛的乌龟一样，要找一个地方钻进去而变成人，太不容易啊！即使这个地方被你找到钻进去，同时想要钻进去的就有十二万个同伴，都是你的兄弟姊妹，其它的都牺牲了，硬是被你抢到了，就是大海上的盲龟一样，找一个……所以生命的可贵呀！佛尽管用反面的文章来写，生命盲龟，如大海的盲龟一样。可是我们翻转来正面地看，佛也在赞叹生命之难得可贵！所以，自己生而为人，不要随便糟蹋，（是）这个意思。</p><p>道理，我们还是说明这个精虫，所以他用虫子的形容，因为它有活动性，活动性就像虫在活动一样、爬动一样、蠕动一样。这是要答复的第二个问题。</p><p>第三个问题，这三个都是大问题：第一观，佛说由白骨观做好了，跟着就是不净观，不净观做好了，第二个方法又来了，叫我们观白骨，白骨观了以后，都看到白骨人举右手，一行一行向右边转——那么，这个问题，从智法师礼拜三也问到。为什么要把白骨观做好了、不净观做好了，（还要）再来观这个白骨人一行一行？这个问题也问得好。不是第一、第二，假定你白骨观做好了，不净观连着来完成，就是刹那之间就观清楚了，那么，你就定在额上，这一点白骨定在白光……这是一个方法。</p><p>你不走这个方法，第二个方法也可以，白骨观成了以后，不净观不观也可以了，因为白骨就是空的了嘛，内脏不要把它空了，它就没有了。如果你不走第二个方法的路线，佛很慈悲，一个原则说了很多……那么你走这个白骨观一行一行……。</p><p>至于说，举右掌向右转，这是宇宙自然的，生生不已都是右转，就是照这个太阳系统。我们这个欲界的生命，娑婆世界是右转，太阳是东边西边下去这样右转。假设反其道走啊，就可以到涅槃了，那就好了。所以，这个生命都是向……。</p><p>其实，我们真到了白骨观的第二个方法，你完全转起来白骨，看世界上的人，整个世界都变成白骨骷髅在转了。有个什么好处呢？对世界放弃了，心能够完全跳开世界，所谓光荣、所谓历史、所谓什么，都是一批骷髅，大家在乱玩，真是鬼打架，这个世界没有道理的！使你的出离心发得起来；发得起来，容易趋入这个正定、正观。那么，之所以右转的理由，我们上次讲过了，就是这个道理。</p><p>那么，第三个原因呢，你只要把那个白骨一观起来，真的观起来，所谓观念看这个世界，不是把每一个人都看成是骷髅，硬是眼睛对着看是骷髅，明明白白的，那不是你眼睛的神经有问题了，就是你精神有问题了。</p><p>他这个观是观念，把每一个人都看的没有什么色相叫做漂亮不漂亮，没有什么欲爱不欲爱，你我都是一具白骨而已!那么，如此一来，自然修出离心，出离心发起了，你白骨观一观成了，你晓得人的身体内部是在这样转。</p><p>所以，再给你讲一个秘密，这里讲的都是《禅秘要法》，是有秘密的。我们普通中国人晓得道家讲打坐，都讲任督脉，背上上来前面下去，这个任督二脉这样转，叫做转河车。道家后来用这个方法叫做小周天。说任督二脉打通了嘛，依道家来讲，他就叫小周天转通了。大周天怎么转呢？不知道了，大周天是左右转。</p><p>所以你气脉真正……。当然，我们修白骨观不管气脉，因为气脉的事情已经是另外一件事了，不相干了；气脉的事是因内脏、因肉体而有，现在做白骨观，把这个肉体四大都把它空出去了，水火、火风都把它空掉了以后，不需要利用这个气脉而成就了。换句话，气脉的力量已经内敛归到白骨里头，白骨很容易进入空性，性空的境界。但是，这个气脉的感觉有没有呢？在你没有完全定住时，有感觉的，（而）气脉是到了（由）左向右，就是这一边上来，到这一边转通的时候啊，人是真正气脉通了，左右转，道家就叫做大周天。</p><p>今天，老实告诉你们……，你们去看看，道书上你们去翻遍了，把全部的道书……什么是真正的大周天，讲不出一个所以然。</p><p>所谓大周天就是什么呢？就是地球围绕太阳走一圈，一年三百六十度，那个度是大周天；所谓小周天是月亮围着地球，这一个月三十天的一圈是谓之小周天。那么，所谓大周天、小周天（是）道家做的一个比方，（是）气脉的行动。</p><p>实际上，这些东西是肉身上，我们有肉体的生命（上）自然的一个现象。这个现象，一做白骨观、一做不净观的时候……不净观一做，把内脏都拿下来，把它空掉了，白骨一定，白骨再一化光，这些过程就不需要了，所以，它（白骨观方法）成就得非常快。</p><p>那么，成就得快，是什么快呢？就是给你证明“一切唯心”的快。一切唯心，理论上我们晓得，大家学佛的人，都会念《华严经》上这四句，“若人欲了知，三世一切佛，应观法界性，一切唯心造。”造不出来！现在叫你做白骨观，你本身是白骨，但是，你回光返照，把白骨一照出来了就得定，就证果了，真正走入佛法了。一切唯心造，是基本给你自己去造，你本来是个身造的白骨，现在不过是回转来把自己找清楚；找清楚了以后，返还之路很容易成就了。</p><p>这是今天有人问的……哎哟，下面问的很多啊！问题答完，不得了，简单地答。</p><p>有一个人问：四谛法这样难懂，是否是因为我们只是用知性去记忆或者理解，而没有靠感性去体会？是否因为娑婆世界的众生有本住的堪忍种性特别深重，所以不能以苦为苦？你问的这个四谛法门---苦、集、灭、道，你讲得对，（不过）还在讲理论——这个问问题的同学。原因是什么？讲理论是苦集灭道，讲修法跟理论是两样。你要真正体会到世界是苦，人生一切是苦，没有真正的乐。所谓人生的乐、快感，那都是暂时的小苦，感觉上叫做乐。譬如我经常比方，去被人家马杀鸡（message）---按摩，那明明是挨人家的揍、挨人家的打……到理发馆，人家就“蹦蹦蹦……”，“哦，好舒服！”那不过是他乖一点、轻一点打，所以我们觉得舒服；重一点你看舒服不舒服？同样是打。所以，一切众生以小轻松的苦以为乐，是错误的、是受罪，这是理论。所以，苦集灭道的理论懂。</p><p>你要真懂呢，（是）倒转来的，先得道，前面都清楚了。所以，你白骨观真的做成了，道得到了，灭一切苦，一切妄念皆灭，也不去集了，亦无苦了，那么苦集灭道自然懂了。</p><p>所以，你要去（谈）理论，也不是知性、感性……你也可以拿现在哲学的名词，知性、感性，这些逻辑的名称——当然，这个感性不是指感性，你要真去证到！证到了四谛就容易懂了。所以说四谛法难懂，讲理论很容易讲；你要真正亲证四谛法门，先要得到道、得到空，得到空倒转来，前面就清楚了。</p><p>第二个问题：本经第五页，正面第三行说：肺、小肠等注入大肠，都把它观到大肠，从咽喉出，从咽喉里吐出来，吐掉，吐于前面。老师你说，都从下面出去？这点：有一个法（是）是从下面丢下来，有一步法是从上面吐出去。等于医病一样，我们中医、西医医病，治好病只有三个方法，中医西医一样。汗，发汗把它发掉；要么，药吃下去把它吐掉；要么把它拉掉，不管中药西药，治病祛病的方法……。譬如感冒了，中西药吃下去，你盖着睡个觉，汗一出，就是拿汗把它排泄了。再深入一点病，不是把它吐出来了，就是把它大便拉出来了。</p><p>这个白骨修法也是一样，这一步是讲统统从咽喉吐出来，也许我讲的太快了，从下面拉出来，没有关系，你吐掉就好了，不拉就是了，下面有个拉法的。</p><p>第三，本经所讲的观想很详细，甚至显得繁琐，可是到第十页背面，名第二观，白骨境为止，都是没有……，……他再讲右面，又叫你大趾头再来，更啰嗦了，所以，懂了左面，右边就是一样了。而且，不是连贯性的——讲连贯性，有一个人，就是写《外婆禅》的作者，那位老太太在美国，我寄了一本给她，她没有听过我当年的讲，也没有寄录音带给她，她照这一本经一步一步，她自己都去试过，试完了丢开了。寄一本《六妙门》给她，她也重新来过，把六妙门的呼吸止观也一步一步试过，试完了，她现在发现：我简直是上当了，初学可以，在我现在没有用，这是闲家伙了！把它摆开了，哈，她正准备摆开，我给她的批示也到了。我说你怎么倒转来看？我随便寄一本书给你，你又倒转来走冤枉路呢？她正好自己已经想到了，把它丢开了。所以，这个不是这个样子。</p><p>第四，想步步踏实，系念法能维持几分钟，可是往往刹那之间就变成系心住，而且马上变成全身皆白骨，完全不由自己做主，是否算是观想已经成功？可以呀，可以算。这就是你理没有参透，你（本）想一步一步来，结果一刹那之间你一下就已经观到全身是白骨，你就刹那一念，一念万年，中间没有程序的。到了，你还要怀疑，你不是变成茶叶蛋了？比笨蛋还要笨一点，那就变茶叶蛋了。</p><p>第五，从头到尾，看本经数次，观时每每次序混乱，不能如经所示，是不是当初不该将本经看完？没有这回事！哪一个法门如果合适，它里头好几部法门，你从这个进入进去，前后可以贯通，一样的。</p><p>第六，不要说九十天不移心想，就是九秒钟都办不到——那你何必问我啊——虽然，移来移去，可以有数十分钟存在本经范围以内，但差前错后，每每互相岔入，此乃心乱使然，如何能使心不乱？你问我啊？我还要问你呢，怎么样能使心不乱？</p><p>白骨观，第五页背面第七行，夜叉荷负九种死尸，《佛学字典》上查不出是哪九种？青的，人死了以后，发青色，肉色乌——你买块猪肉摆在那里你就看出来了，先乌，乌了以后发红、发紫、靑、乌，这样九种尸体。就是说，有些肉是刚刚烂，有些肉烂久一点，最后烂得干瘪了，就是火腿肉一样。你们吃火腿的时候注意，那就可以做白骨观、做不净观了。</p><p>所以，我们这里的出家同学跑到医学院解剖室一看，回来以后，面筋都吃不下了，一看红烧面筋，就像那个颜色。就是这样，这就是九种颜色不同。先是肉体，肉体以后啊，慢慢发肿了、发白、发青、发紫啊，这个样子的九种尸体。就是这样。</p><p>这回有那么多问题，真多啊！还有，另外一位，《禅秘要法》第四页第六行，次观细骨，乃至于脊骨，由下向上观，观髋骨后，时次观脊骨——是这样，一路照次序上来——《禅秘要法》第五页第三行，又观小肠肝胃脾肾，皆令入肠中，由咽喉出，堕于地……由上向下观，使由肛门出——哎，不净观白骨了，哪里还来个肛门，下部就一起掉出来了嘛，哎呀，你还把肛门记的牢牢的干什么？一下子 “咣当” 就空了嘛，一股邋遢就丢出来了，就是一个白骨。这就是观念问题，你又被世俗形体的观念困住了。</p><p>好了，已经耽误了四十多分钟了，问题答完了。现在，我们再来，上次讲到哪里啊？</p><p>哦，还有一个问题。上次由白骨观讲到水观，白骨观以后，跟着就是觉得世界上所有的人、物、山河大地整个的地球，一下化成乳白色的水了……？第一，叫我们也看清楚，我们地球要毁灭的时候，就是这么整个地化了，第一劫水劫，上次提到过，整个化成水了，使我们了解人世间的无常。</p><p>第二，人体方面、生命方面，我们第一个起作用的就是水，这个地球万有的形成，由空先有气，由气，“呜呜呜”就那么转，一团气体形成，“呜呜呜……”这样转，转久了，二十劫以后，气体变成液体了，气体里头出液体。液体再转，慢慢液体所谓冻结了以后，突出的就是高山，坑下去的就是江河海洋。你看冻豆腐啊，一个东西冻干了冻下来……。所以，我们人体内部的变化，（跟）这个劫数也是一样。就是这么一个东西。这一步由白骨观变成水观，最后，叫我们定在水观境界。地水火风，先由水观开始。</p><p>现在，第二步，这个问题做个总检讨，这是白骨观变水观下面的结论，“此名白骨观最初境界”，接下去：</p><p><strong>【佛告阿难。此想成已。更教余想。教余想者。当自观身作一白骨人。极使白净。令头倒下入臗骨中。澄心一处。极使分明。此想成已。观身四面。周匝四方。皆有骨人。此想成已。即于前地。作一白骨人。如似己身。亦复倒头入臗骨中。想一成已。次当想二。想二成已。次当想三。想三成已。次当想四。想四成已。次当想五。想五成已。乃至想十。如是满一房内。见诸骨人。皆悉倒头入臗骨中。见一房内已。乃至见于百房之内。是诸骨人。皆悉倒头入臗骨中。见百房已。见一由旬。满中骨人。皆悉倒头入臗骨中。见一由旬已。乃至见无量诸白骨人。皆悉倒头入臗骨中。</strong></p><p>此想成已。见诸骨人。各各纵倒。悉在前地。或见头破。或见项折。或见颠倒。或见缭戾。或见腰折。或见伸脚。或见缩脚。或见脚骨分为二分。或见头骨横入胸中。或见头骨偃仰掣缩。纷乱纵横。悉在前地。周匝上下。满一室内。此想成已。乃至见于无量无边诸白骨人。纷乱纵横。或大或小。或破或完。如此众事。皆当住心谛观。极令分明。</p><p>佛告阿难。是时行者。见此事已。当自思惟。前骨完具。今者破散。纵横纷乱。不可记录。此白骨身。犹尚无定。当知我身。亦复无我。谛观是已。当自思惟。正有纵横诸杂乱骨。何处有我及与他身。尔时行者。思惟无我。身意泰然。安隐快乐。</p><p>佛告阿难。此想成已。复当更教令心广大。使彼行人见一阎浮提。纵横乱骨。见诸骨外。周匝四面。有大火起。焰焰相次。烧诸乱骨。见诸骨人。节节火起。如是火相。或有众火。犹如流水。明炎炽盛。流诸骨间。或有众火。犹如大山。从四面来。</p><p>此想成已。极大惊怖。出定之时。身体蒸热。还当摄心。如前观骨。观一白骨人。极令明了。是时行者。入定之时。不能自起。要当弹指。然后得起。此想成者。当自起念而作是言。我于前世无数劫来。造热恼法。业缘所牵故。使今者见此火起。复当作念。如此火者。从四大有。我身空寂。四大无主。此大猛火。横从空起。我身他身。悉皆亦空。如此火者。从妄想生。为何所烧。我身及火。二皆无常。佛告阿难。行者应当至心谛观。如是等法。观空无火亦无众骨。作此观者。无有恐惧。身意恬安。倍胜于前。</p><p>尔时阿难。闻佛所说。欢喜奉行。此想成者。名第二观白骨竟。】</p><p>这一段，大家文字都看清楚了啊，都了解了。每一个法门，都要把……你不要看佛经，他给我们翻译……佛给我们说得非常详细，重复地给我们说清楚。这个法门的观法，就是说，由上面观世界上都是白骨，这个观成了以后，就是说，我们把自己的白骨观得很清楚了，然后，观想把头颠倒下来——我们晓得，道家有个方法，就是守丹田，觉得把人头缩到丹田里头去。</p><p>这个故事，小说《西游记》上有，孙悟空跟一个妖怪俩比杀头，杀一个又出来一个，杀一个又出来……头缩进去了，没有头，缩到肚脐里去了。像什么？像乌龟，你看那个乌龟，头一缩就缩进去了。这个法门是学的乌龟法，该缩头来且缩头。</p><p>白骨不是这样缩法，是两个观法，一个观想法就是把头——我们已经把白骨观起来哟，首先一个条件。然后没有头了，（譬如）这个白骨（模型）人的头没有了，这一节没有了，没有了把头拿到哪里？拿到这里来了，这个肚子这里，五脏都观空了，拿到这里，颠倒。</p><p>（另外）一个观法呢……——后来的道家都是（由）这种方法变出来的，所以，你研究道家方法的历史，很多都是佛法过来以后，魏晋南北朝才出来的，就是这个里头有修行的经验，修成功了的人，他产生……传给人家，变出来。</p><p>第二种呢，就是把头——观想我们已经变成这个白骨了，觉得这样弯起来，把头弯到肚子里头来了，等于一个人的身体变成这么一个圆圈过来、转拢来。</p><p>所以，后来产生一个道家的修法——你们在台湾这里没有看到过，我在大陆上亲自看到，一个修道的人，传人家那个打坐，我说“算了，我学不来。”打坐要弯曲弯曲弯弯弯……鼻子差不多要弯起来对着小肚脐，我说我没有那么大的软骨功。我就问这个师父：“师父，这个是什么理由啊？修道要这样打坐？”他说：“嘿，你不晓得啊？鹤鹿童春啊。”白鹤跟鹿……据说白鹤活一千年，它自己的呼吸是循环的，鹤啊……你看鸡同鸭、白鹅啊，它们睡觉的时候，把这个脖子转到后面屁股这里来，这个呼吸跟屁股肛门两个在里面转圈子循环。我说：“哦，那我们不是鼻子要弯到对着肛门才行，我说弯不过来呀！”他说：“不用到肛门，只要到小丹田……”所以有些人打坐坐着是弯的，一坨，嗨，那工夫好！</p><p>还有一个这一派的，我又看到一个，在重庆一家人都修道，大大小小。一进到他的屋子，没有凳子、没有椅子、没有板凳、没有床铺，什么都没有，干什么？地下铺的都是席子，他们一打坐坐好了，坐一阵、不到几分钟，一家人就转起来，转了以后啊，等一下就打滚了，哈，就看到一个陀螺一样在地下滚，一家人两夫妻、两位小姐、三个儿子，七八口晚上打坐用工夫，一家人都修道，男男女女。就看到老的、小的这么一坨滚来滚去、滚来滚去，在那个房间里滚啊，彼此还滚得很好，绝不会撞到谁！我想大概是人体的本能，滚的就看到（似）陀螺，我说：这个我也不学，呵，我学了我没有地方滚嘛，呵呵，出门人，我哪里铺一个席子，一天到黑滚。我说：“那滚到多久才能成道呢？”他说“那不一定。”我说算了，这个打滚的事情我不干，滚到几时也不一定，人这一辈子滚下来还不能成道啊，将来变成田螺了，我变成田螺了，在那里打滚了。后来才知道，等我研究了这些，都是这个法子里变出来，走差门的。</p><p>所以这个法子有时候叫我们颠倒，颠倒了以后干什么？叫我们观想、没有实际的。真正的骨骼你要化身虚空，变化身，把肉体报身修成功了，这个父母所生的肉体修成功了，把它化开，化开了以后——实际上我们身体还在呀。（是）这个四大的力量把它恢复功能了，成就了报身。所以，把这些骨架子都拆掉、都打散，他只叫我们一切打散、颠倒。</p><p>这个法子有个什么好处呢？我告诉诸位，我试验过，自己晓得。你们血压高的人，或者是上部有毛病的人，做这个观想，你真做成功了，觉得一上坐把头杀下来，自己宰下来，把头放在小肚子里头去了，嗨，血压马上降了，立刻就降了，上面觉得没有头了。</p><p>本来有些人打坐起来不是头痛嘛，把头宰了好了，变成白骨骷髅，变成这个东西，然后把它拿下来，放在肚子里把它住了，哎，身体血压马上降下来，那怪得很！</p><p>就是怕你们没有这个认识，没有这个狠心、没有这个毅力，理也搞不透，拿不下来。真观下来，他就叫你整个身体拆散了。拆散了以后，由一个开始，再看世界上的人，每一个都是一节一节骨头兜拢来的假人，有什么漂亮不漂亮的！什么叫胖啊、瘦啊？就是那么兜，兜了以后弄些泥巴敷，敷多一点就叫胖子，像我这样敷少一点，就叫瘦子。就是把这个世界整个的看通了。</p><p>看通了以后，怎么办呢？就观想白骨起火了、烧了。哦，你要真起火烧了，你一身都发烫哦，不得了哦！所以经典吩咐你，到这个时候你自己会害怕，会起恐怖，看到吧？第十页倒数第一行到第二行，“此想成已，极大惊怖。出定之时，身体蒸热。”是这样哦。</p><p>所以，有一个同学昨天问我，一打起坐来脚心发烫，我说恭喜你，很好！这是好的嘛，不过你不要理它、不要被……，那么假设是这样……这是修火光定。</p><p>所以，下面告诉你，他说人到了一身发烫、发软，那很舒服哦，你不想出定了，叫不出来的哟。所以翻过来第十页反面，“不能自起，要当弹指，然后得起”，在这个定境界里不能出定。刚才我们在下面，给我们上将军就讲过这个话，你真得定了以后，吩咐夫人不要叫你、不要碰你，要家里买个引罄，“叮”一敲，轻轻一敲，千万不要拉他、不要碰他，你一拉他……人一入定了，骨节都软了，会变成面粉一样、棉花一样，你可以拉得很长。当然，它会收回去，可是出定的人会觉得痛、难过，要花很大的工夫……。所以这一点，千万吩咐——不管，有没有入定，现在大家来打坐，虽然是假的入定，你们最好也不要碰他，轻轻叫。</p><p>所以，这个时候，要弹指，弹指或者敲引罄。所谓弹指就是这样（师示），或者是在耳朵边上：“某人可以起坐了。”慢慢地叫，不是死亡，他里面清楚得很，因为懒得出来，所以叫入定的境界。这里也吩咐给你。</p><p>这个是叫火大观。一得到火大观，真发起来，全身得暖的。得暖跟发烧两样。所以前几年好几个人修道，人家告诉我：啊，某某人，这个老师工夫做得冬天被子都盖不住啊，只盖个毛巾。哎呀，功夫好得不得了！当年，这个话讲了……现在都有十年了，我说：好嘛，那么好的老师，你赶快去学吧。后来呀，高血压死了，当然我也会死了，谁也会死了，不过，不应该是这样。</p><p>因为那个发烧跟发暖，这个中间有差别，真正里头得暖，不是发烧哦，你摸他体温好像很烫，可是他并没有发烧，这个中间的差别很微细的，要特别注意。</p><p>所以真得暖了以后啊，加行法的第一步就得到了，是火光定里的。假设得暖、得火光定的人，这个人绝对把欲念，把男女的欲念化掉了。在水观里头，男女的欲念会增强哦，特别注意啊！增强的时候要打破那一关哦。到了火观一起来的时候，这个欲念化掉了。可是化掉了，得什么呢？不是得人世间男女性的快感，不是得这个，得禅定的妙乐了，那舒服得很，不是世间这一切的舒服能够比的。</p><p>我们先休息一下，现在最舒服的是放了腿休息，比禅定之乐还要乐，呵。</p><p>诸位有些朋友没有坐过的，不要一定坐一两个钟头听啊，坐不住，腿子……</p></div>"
},{
    "title": "禅秘要法讲座 06",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>刚才，从智法师替一位同学再说明问的问题，说我没有看清楚，他说，照前面所说的，髋骨，就是屁股这块骨观清楚了，照程序应该观背脊骨上来，再观胸部这个骨。他说，为什么经典上是说髋骨一观好，上来就观胁骨，就观这两排骨头，没有照背脊这样的次序来？这没有关系的，我刚才跟你讲过，佛现在说的有几十个法子，这几十个法子都不是要你非要照这个次序来，有人修白骨观，一上来，他业力比较轻，一上来就观起来，那就整个一起来了。</p><p>或者有些人，譬如修白骨观非常试验的……假使这个人肺部不好，有毛病，你白骨观别的部分很容易观起来，有病的这一部分骨头很难出来；即使自己在定中看到，黑的。等到病慢慢被自己观轻了——所谓观，观的力量……甚至于有病的，你可以做这样的观，都可以插进来，自己发现一观起来，白骨都有，假定说，这一部分有病，这一部分骨节是黑的，或者慢慢变黄，病已经减轻一点，那么你可以观一个太阳，从顶上，等于钴60一样，自己用太阳光一照，大概没有几天，变白净了，病就轻了一半。</p><p>好像我们这里的史老先生、王主任，他有经验，他给你们报告一下看。他们因为身体不好，所以白骨观观起来，身体不好的那一部份，那个骨节的情况就两样。所以，这是一个非常……可以讲，是个很科学的修法。王主任在教育界几十年，在**大学做教务主任几十年，他跟那两位校长是好朋友，等于是创办，一直到现在。</p><p>过去在大陆，当年王主任也是在军方军事委员会服务很久的，所以，他是个非常笃实的人。请他报告一下，你们诸位做一个参考。</p><p>（王主任讲：老师、各位道长：去年春节，我的肝功能不太好，我就住荣总医院，住了差不多有两个月的时间。后来，老师知道了以后，把我找来，问我以后，刚好是春节打七的时候，老师叫我参加。参加的时候，在打七中间老师讲白骨观，我就按照老师开示的白骨观的观法，开始从左脚观起。开始观起，一直就是看不到白骨，就是灰灰的、黑黑的。后来慢慢地，老师在训练上一直开示我，我慢慢慢慢练，就按照那个方式，白骨慢慢由灰黑色变成浅白色，还不是纯白，到现在还没有观到发光的阶段。但是，大概我这个观白骨观是由黑变灰，由灰变白，可是现在还没有到骨节发光，我还没有做到。这是大概的情形，谢谢各位。）</p><p>谢谢你啊。不但王主任，还有几位年纪大的朋友做白骨观的经验，比王主任的身体还更严重一点的，那么，自己骨头观起来的，很困难地观起来了，观起来发现骨头是黑的。他来跟我讲，我说不要害怕，慢慢做去。那么，他慢慢观、慢慢观，颜色就是慢慢一天一天……这个打坐，自己修持的工夫越久了，慢慢慢慢颜色转化了。</p><p>所以，并不是你……我们这个生理上的骨头真的有没有这个现象、颜色呢？有的，这个我问过谁呢？有一位同学他没有来，洪医师，他是台大毕业的医生在高雄，他也做了很多年的法医，所以他现在很讨厌……可是他现在还在当法医。他经常同犯了案的，杀了人的，这些尸体有些都要他解剖，他跟我讲了很多的经验。而且他现在——在你们讲，就是一般人讲，越来越迷信。他说硬是有鬼啊、神啊！尤其是解剖，判断案子解剖那个死人，他都先要祷告：你帮忙我，你自己搞清楚点，使我灵感来，究竟你是被谁害死的？他说硬是奇怪啊，这个里头……他是学科学的。</p><p>那么，我说是不是每个人的骨头颜色有不同处？他说有，的确是这样。所以他对于佛法特别地相信，他修持特别地用功。</p><p>这个人业力不同……所以，业重、人坏、心思坏、恶念造得重，连骨相都变了，连骨髓都变了。所以善恶之间，一切唯心造，力量有这样大。</p><p>所以，白骨观开头观不起来，就要自己反省忏悔；自己不反省忏悔：格老子我不信！你不信啊，就是格老子，总有一天……是这个样子。这是我们（对）刚才的补充。</p><p>现在，再补充一点，所以黑板上大家写出来……至于修水观，由白骨观修到水观、修火观，佛在这里，释迦牟尼佛亲口讲的，“此想成时”，这个观想观起来的时候，“极大惊怖”，你会害怕。“出定之时，身体蒸热”，身上就发热。你们出家的、修持的人看到啊，那么，发热怎么办？“还当摄心，如前观骨”，就是要你收心嘛。你那个发热，（是）你跟着热气跑，你心在散乱了；你心不跟着那个感受走，你怎么晓得发热？对不对？这个理论上懂了吧？</p><p>譬如我们的脚无意中走过一个地方，割了一下，破了，但是急急忙忙，前面有事情，我们向前面跑，你觉不觉的痛啊？不觉得。等到停下来：哎呦，我这里破了！痛了。因为你那个急急忙忙向前面跑的时候，心不系念它，就没有感觉。</p><p>所以，同样道理，你足心发暖，一切发暖，你紧跟着：哎呀，越来越烧，越来越烧，越来越暖……“老师啊，我没有办法，赶快给我吃一点药！”有些茶叶蛋，就是这样的办法，哈。你越来找我吃药，你那个念就越跟着那个感受在跑，所以注意！“还当摄心”，佛跟你说得很明白，就是你心散乱，你赶快要收心。你脚发烧，现在脚就变成火把我烧掉，我还不过是两个腿算掉了！我不理你了，心还是定下来。那是好事，那就变成得暖了；工夫做到得暖不得了，就很好了，就可以有基础了。</p><p>大家做工夫，到那个时候非跟着感觉走不可！</p><p>所以你知道，有些人一打坐，气机一发动，“哎呀，我任督二脉通了！”同这个道理一样。它不是真通啊，（是）那个心理在配合乱搞，变成一个幻想的境界，也做通了，最后还是入魔，你懂吧？</p><p>所以，到这种情形，“还当摄心”，四个字，你心收回来不要跟着……有许多同学来问我，跟他讲这个道理，他不懂，然后还紧在哪里，踢里塔拉的，好像……总是搞不清楚，烦死了！这就是慧力的问题。</p><p>至于大乘的方法——这是讲小乘，不要看不起小乘哦，所谓小乘是渐修的。我们宁可把自己当成小乘，我从来不敢把自己当成大乘。</p><p>所以，我经常吩咐大家，尤其年轻的同学注意，世法也好，到社会上做人创事业也是一样，出世法修道也好，聪明人，绝顶聪明的人，一做事情，一定走最笨的路子，一步一步来，没有不成功的。就怕不肯笨，有一点聪明，没有真聪明，又不肯笨，要偷巧，自己认为头脑好，要超过别人，自己认为有办法骗了别人，结果都是骗了自己。</p><p>千万记住啊！聪明人要想成功，世间的事业也好，出世间修道也好，走笨路子，老实的路子。</p><p>最怕……世界上不成功的人，不管世法、出世法，不成功的人都是笨人，自己冒充聪明，一点办法都没有。不要说是修道，世间法都站不起来的人。只好哪里找一个小事，靠人家吃一口饭算了。不要玩聪明，聪明玩不得的；尤其修道，不能玩聪明，佛都告诉你。</p><p>所以，尽管你懂大乘的经典，你修持的工夫必须要按部就班老老实实地走，不要看不起小乘，小乘是大乘的基础。</p><p>当然，你有大智慧，可以走大乘的路子，什么水观成就了，火观……乃至病了，病了怎么样？也是这个道理，《楞严经》上告诉你的，“性火真空，性空真火”，地水火风四大都是同样的，“性水真空，性空真水；性风真空，性空真风”，下面都是这几句话：“清净本然，周遍法界。随众生心，应所知量。循业发现，宁有方所。”这是大彻大悟，心物一元，本空的。所以热也好、水也好，本来空的，“清净本然，周遍法界”，它无处不在无处在，“随众生心”，你念头一动，就起物力，心物一元，心就起作用，地水火风起作用。“应所知量”，你的智慧有多大，它的量就有多大。</p><p>所以大智慧的人，他的学问的量、胸襟的量也大；小智慧的人，就是这么一点点，讲话也啰啰嗦嗦，就那么一点。那个小鸟抓米一样，就是一口一口慢慢来；大智慧人就一吞，像龙吸海水一样，一口就吸完了，统统进去了，不管鱼啊、虾啊、鳖啊，鲸鱼啊，一口就进去了。所以“随众生心”，应所知的量，“循业发现”，跟着你心理的业力而爆发，“宁有方所”，没有定位。</p><p>所以，你懂了大乘，这里能够观空，管它发热也好、清凉也好——清凉有什么稀奇？发热怎么……就是放光了，又有什么稀奇？“清净本然，周遍法界”，“宁有方所”？自然就空，你越空得大，生命的功能越变化得大，这是大乘的道理。</p><p>但是，大家研究了《楞严经》，这些理懂了，你证到没有呢？你没有证到，为什么没有证到？没有好好修，这里告诉你修法。所以，你把大小乘汇通了，你到那个时候发暖也好、发清净也好，就晓得：清净本空，空本清净，“周遍法界，宁有方所”，“随众生心，应所知量”，“循业发现”而已。</p><p>所以六祖悟了，“何其自性具足万法”，地水火风都具足的，并不是外来的——可是不要讲理哦，这是悟的理。《楞严经》吩咐你，理是靠顿悟，工夫要渐修来的。现在是教渐修的工夫。</p><p>即使大彻大悟的人，不走渐修，工夫不成就，不算悟，没有用！你悟的那个理不能抵住生死，这里是教我们真正抵生死实修的工夫。</p><p>现在，我们第二观白骨观讲完了，另外第三（观），再看原文。</p><p><strong>【佛告阿难。观第二白骨竟已。复当更教系念法。】</strong>“系念法”，注意，现在教我们“系念法”。<strong>【系念法者先当系心着左足大指上。一心谛观足大指。使肉青黑津腻。犹如日光炙于肥肉。渐渐至膝。乃至于臗。观左足已。观其右足。亦复如是。观右足已。次当观腰。至背至颈。至项至头。至面至胸。举身支节。一切身分。皆亦津黑。犹如日光炙于肥肉。不净流溢。如屎尿聚。谛观己身。极使分明。想一成已。复当想二。想二成已。复当想三。想三成已。复当想四。想四成已。复当想五。想五成已。复当想十。想十成已。见一室内。满中津黑。犹如日光炙于肥肉。如屎尿聚。诸不净人。行列纵横。满一室内。见一室已。复见二室。见二室已。乃至见无量众多不净人。四维上下。皆悉充满娑婆世界。</strong></p><p>此想成已。行人自念。我于前世。贪淫愚痴。不自觉知。盛年放逸。贪着情色。无有惭愧。随逐色声香味触法。今观我身。不净流溢。他身亦尔。何可爱乐。见此事已。极自厌身。惭愧自责。出定之时。见诸饮食。如屎尿汁。甚可恶厌。</p><p>次教易观。易观法者。当更起想念。想念成时。见其身外。诸不净间。周匝四面。忽然炎起。如热时焰。其色正白。如野马行。映诸不净。尔时行者。见此事已。当大欢喜。以欢喜故。身心轻软。其心明朗。快乐倍常。</p><p>佛告阿难。是名第三惭愧自责观。尔时阿难。闻佛所说。欢喜奉行。此想成者。名第三津腻惭愧观竟。】</p><p>第三观的方法很快、很简单。</p><p>实际上，这一部经典告诉我们几十个修持的方法，做工夫的，都很简单，上面讲的白骨观都很简单，实际上观念一看就成。尤其你们有机会，当然，现在在坟场看不到了，想办法找我们医师带一带路，医学院解剖室去看一看，看了以后保你白骨观已经修成功一半了，呵。你要想想，算不定自己要躺在那里，被人家这样一块一块地割，药水一泡，都变成了云南火腿腊肉一样，黑紫的。</p><p>所以，他们同学看了以后，回来告诉我，那个红烧面筋都不要吃，那天晚上吃饭，他们红烧面筋没得销路，哈，因为刚刚看了那个死人，被药水泡了的那个颜色很难受。那白骨观、不净观就成功了一半，不要你观，就是你没有定力，理不透，理透当下就可以成功。</p><p>现在，第二个观法以后，他告诉我们第三个观法，这个法门叫做“系念法”，把念头拴住。先还是叫我们的心观左边的大拇趾上，这个不是做白骨观，也不是不净观，这个名称就是“溃烂观”。</p><p>其实啊，这个观想方法我们大家做不好……你想做好很简单，只要花几千块钱去买一个蹄膀或者买半个猪，等太阳好的时候，拿来晒几天，它就出来了，你看来，当然不吃猪肉了，你想想自己……无法找人肉来给你看。</p><p>叫我们观脚趾甲，想到什么呢？脚发青了，受了伤那个样子，我们受了伤，肉就发青了；得了病，那个地方血液不流通了，慢慢（也）发青了。医不好，那块肉就变黑了，黑了的肉等于什么？鲜的肉放在太阳里晒，晒久了以后，那个肉烂了，又臭，那个味道就出来了。</p><p>叫我们由脚趾头观起，把自己一身……假想有个太阳晒我们，晒烂了，（什么）就流出来，一身都……我们死了就是这样。</p><p>譬如焦先生前年打七，一听白骨观他就做，因为他是第一等的聪明人，他做什么都是最老实的做法。他自己观不起来白骨，他就觉得自己回家一想：我死了，躺在床上死了。死了以后，第一步，哦，我的肉开始烂了，化成脓水了，他这样一想一想，白骨一下就观起来了。人假设死了在那里，本来就是这个程序嘛。假设有防腐剂打进去了以后，（就）变成腊肉火腿一样，也不会那么白净好看，等于由于药力起了变化。</p><p>所以，要保持驻颜不老……假设白骨观修成——这里再告诉你们一个好的利益，挂个胡萝卜引诱你。这个工夫真的修成以后，涅槃一死，颜色不变，肉也不烂，颜貌如生，同活着一样。那靠这个修持，修成功了……因为他在活着的时候，已经在三昧定中把本身这些腐烂的细菌已经去光了，就不需要打防腐剂，也不需要什么，可以保持……</p><p>你看《高僧传》，尤其道家《神仙传》上很多，很多人死了颜貌如生，比生的时候还要好看，美丽漂亮。什么工夫做到的？就是这个，就是这个工夫修到成功的时候。</p><p>当然，你不要说，我修白骨观，（是）为了求到死的时候还很年轻漂亮，让大家都想我一下——那你就糟了！入魔道了，你不要修这个观了，哈。这是我给你讲坏的一面（后，再）讲好的一面给你听听。</p><p>所以，先要观想自己烂了，统统烂了，烂了以后，当然化成脓水，又臭又脏，大便小便一样……这个想了，自己把自己这个观想成功了，再观世界上的人，每个都如此烂了，然后观整个的娑婆世界，不但人，一切众生，这个活动的生命，最后烂了……。</p><p>那么植物烂了呢？你看我们吃素的，吃青菜：好啊，青菜！（被）油啊、盐啊一炒……你把青菜摆在那里烂了看看，你碰都不敢碰！也臭死了，这个世界就是那么充满了臭。</p><p>由此叫我们悟到什么？多生累劫贪淫欲、愚痴。淫欲因为水大、火大，水火二大淹没来的，“贪淫愚痴，不自觉知。”</p><p>那么，告诫我们人生，有几句话，就是11页的背面，“盛年放逸”，所有的人都要犯的，难免。什么叫盛年？年轻的时候，所谓春秋鼎盛，年龄轻、身体健康的时候，谁都不相信这一套的。“盛年放逸，贪着情色”，贪着情，要爱情、色相。“无有惭愧”，所以，年轻就跟着“色声香味触法”，法就是意识、乱想、思想。现在，因为这个观修成了，觉得一切都值得惭愧、忏悔，这个是真见到人生身空，真能修到此身空，“我身不净流溢”，再看世界上的人也是如此。</p><p>这个不是前面普通的不净观了，溃烂观，就是烂肉，我们活着的那个漂亮不漂亮，不过是一坨烂的肉加上化妆品把它涂一涂。我们男人靠刮胡子刀刮一刮，女性靠了许多的胭脂花粉涂一下、画一画，如此而已。</p><p>这一观观成了以后，有一个什么？你吃东西没有味道了。我是经验过，这个东西观成，再怎么荤的也好、素的也好，不想吃了，觉得是间接吃大便，因为吃下去，最后还是化成这个，不想吃了。后来怎么办？把眼睛闭一闭，（用）另一个观念把它转过来：还是很好吃！鼓起勇气，把那个观念，自己修成的那个观念赶快丢掉，不丢掉不得了，吃不下东西了。你说泡杯牛奶喝，牛奶也脏的。就是没有一样好吃的，不敢吃，会到这个程度，最后就这个样子。</p><p>所以，他这里也讲，佛告诉我们，“出定之时”，到我们这个溃烂观修成，“见此事已，极自厌身，惭愧自责”，自己对于身体讨厌极了，觉得处处不干净。“出定之时”呢，他说，你看到一切饮食等于（是）大便、小便，“甚可恶厌”，会发生这个问题。</p><p>到了这个时候，就是刚才我的经验也告诉了大家，我自己亲自修持的经验，现在告诉你，赶快“易观”，易观就是调一个方法。我的经验就是当时眼睛一闭：诶，这是维摩居士上方世界拿下来的，色声香味触法俱全，好吃哦！硬把那个念头压下去，不压下去不得了。就是换一种方法，把观念换过来。所以要晓得易观，赶快易观。</p><p>其实，我的经验，许多身体内部的疾病……当然，你定力坚强了，这就是道家有一句话，我经常引用道家的东西，中国道家的最重要的经典《黄庭经》。世界上（人）年纪大了生病，哪一种药最好呢？只有你自己药房里有三种药，“上药三品神与气精”，精、气、神，这是上药，《黄庭经》的话。上药三品不要钱的，你本身那里有，你能够自己利用它，就会治一切百病。</p><p>但是，这个上药三品怎么样用法呢？佛留下来的白骨观就是开的药方子，这个就是药方。道家讲的“上药三品神与气精”，就是精气神，这是药，这个方子怎么医病呢？只有你自己观。譬如你胸部、肺部或者肠胃不好，把它一拿空了以后，白骨观一观成了以后，你把神光一照，自己意想一观，没有治不好的。</p><p>譬如你要发呕、呕吐，就是食道管这一节，（看）我们前面摆的这个骷髅，到胸口这一节（师示），胃这里上来脉管不通，食道管这里有堵住。食道管为什么……所以密宗告诉我们，这一节到胃上这一节，这一节有十六根脉，向上的，雨伞一样向上的，道家叫这里是十二重楼（在那里下）。假使这一节（的）气脉打通了，你没有妄念了，处理事没有妄想、没有烦恼了。</p><p>所以有些人打坐坐着，这里就堵住，“呃呃”，就是这里打不通。这个两个乳房中间，男女都一样，这个中间有一个穴道，膻中，很难打通。这一个节，男人更明显，女人也一样，女人向里的，我们普通（叫）喉结，就是“生死关”，这个骨节（是）这样锁住。修道成功，这个生死关打开了以后，可以跳出生死了。这一节还最难打通。</p><p>所以，你假如修白骨观，会修的，这个部份马上观这个白骨，把它观清楚，就快多了，就快一百步路还不止，很快把它打通了。打通了以后，你晓得，你的呼吸，自然的呼吸，不是从鼻子吸了，从这里（师示）这两个穴道自然就进来，一吸就到脑，这里打通……，……你觉得厌恶，看到饮食，溃烂观修成了，对于素的也好，荤的也好，饮食厌恶！厌恶的时候，你赶快要调方法，易观了。这个方法只需要修到这里。修到这里的道理呢，佛没有跟你说明，就是说，你把人身认清楚了，不被两个字，情，男女的感情；色，不被淫欲，就是两性的需要所牵动了，到此为止！这个方法不需要再用下去了，因为下面没得可用的了，并不需要了，赶快易观！</p><p>易观什么呢？由最脏的变成、化成最干净的，至真、至善、至美。修到这样，最脏处把它看清楚了，所谓大乘的佛法，娑婆世界是秽土，污秽的秽，脏的，秽土看完了以后，你赶紧……就是庄子的一句话，道家的，“化朽腐为神奇。”</p><p>这又要通大乘的理。你说这个世界上，我们看了……这个修法修到看一切都是大便、小便，脏的啊，哎哟，难过极了！你要知道，世界上最美丽的东西都是大便、小便做出来的，青菜萝卜，乃至猪牛狗马，哪一样东西都是吃了最脏的东西，变成那么又白、又凈、又漂亮。你看我们这些人坐着，这些出家人，你看，这边这边，都是一百二胖的，多好看，他怎么来的？都是肚子里头跟潲水桶一样的，这个里面都是潲水，都是腐朽化出来的神奇。世界上所谓的美与丑是一个东西变化的，所以庄子（说）：腐朽一变，就变神奇了。</p><p>所以，你做溃烂观到了这个程度，必须要经过溃烂……那你说，我直接化神奇——哎，不行，你试试看，你想直接化神奇，越观想自己是菩萨，越想越美丽，越想越可笑，你贪欲越大，不得了！所以，必须溃烂观观完了以后，换句话，这个身体是父母所生，一身都是业气，你这个业气的秽气把它转化了以后，神奇一变出来，你就是报身成就了。就是这个奥秘，不过佛不给你说明，所以本经叫做禅秘，有这个奥秘在内，这就是化朽腐为……。</p><p>所以，这个时候叫你易观，“异观法者，当更起想念”，起个念头，“念想成时，见其身外诸不净间，周匝四面”，这些不净的一下（被）火化掉，化掉时，你的感受是什么呢？你会感受一身发热，“如热时焰”，慢慢慢慢，你在打坐中的境界一身发热，把这个腐朽都化了以后啊，你的眼睛开着、闭着都是一层白光，那就是庄子所说的“虚室生白”，白光。</p><p>这个白光如什么？白如野马，注意！经典上看到没有？野马是什么东西啊？不是一匹马，就是庄子所说的“野马也，尘埃也，生物之以息相吹也。”《庄子》的话。“生物”天地间一切生命的东西。宇宙就是一个化学的大锅炉，就是一股气，就是这个野马，野马是什么东西呢？佛经里讲（是）阳焰，太阳里的光影。</p><p>这要注意了，所以古人翻译经典，一用文学境界就完了，后来的人都是学白话出身的，白如野马，结果一观想，一匹白马来了，着魔境了，哈，糟糕了，还不是厩里养的马，还是野马呢，哈，不晓得哪里跑来的。野马是这个东西，啊，野马就是阳焰，阳焰就是太阳里头的光影。</p><p>你们在台湾有见过的经验吗？我告诉你们，我有经验，在台湾不多，大陆上多了。台湾到哪里去看阳焰？夏天，走高速公路的车，南部一走，那个车走得快，前面看到都是水，有经验没有？那就是阳焰，假的，不是水，日光把地上蒸汽晒的反影。你看着是水，开到那里就是干的，这样就叫做阳焰。所以，佛经上经常拿阳焰来比方。因为马路被高热的太阳一晒，那个照的……所以，我们坐在车上一看：哎呀，前面路上怎么都是湿的，都是水？其实你开到那里，看前面又是水，这个就叫做阳焰，就是野马。</p><p>这个时候，你坐起来看到都是白光，一片一片的放光，还不是真正放光；真正到了后来工夫深了，你本身放光。那不是故意可以表演，后面挂个布，“你们来看，看我放光！”不是那个哦，绝不是那个。你若真到了那个放光，不要挂布的，白天夜里都一样哦。像龙树菩萨说法的时候，上座，大家都看到座位上一个月亮、亮光，没有人，声音都从里头发出来，你想，那是神通啊？那还不是，那还是龙树菩萨故意观想，给你们看看而已。真到了光明境界还不是这样。这些都是把常识告诉你们，不要走错了路。“其色正白，如野马行，映诸不净”，看到这些不干净的地方就把它照化了，变成最清净的。</p><p>你这样一调换这个修持的方法，“见此事已，当大欢喜”，心境一下就开开，欢喜得很。你一欢喜啊，马上发现一个什么境界，“身心轻软”，身体觉得轻了，什么有风湿的啊、手抬不动啊、血压……没有了；软了，骨节都软了。轻软很难哦，年纪越大骨头越硬。</p><p>所以，我今天下午跟他们打拳的几位朋友讲，说某人打太极拳，一身骨头“咔咔”的响……我说不得了了，那是问题，那真是问题！老化了，石灰质多了，就生骨节的病了。</p><p>工夫做到了，就软，软如婴儿。婴儿，四川人叫奶娃儿，就是那刚生下来的，还吃娘的奶，几个月以内，你摸他，没有骨头一样。</p><p>“身心轻软”。那么这是身心两方面，“其心明朗”，心里头智慧开了，没有烦恼了，这个气脉完全会打开了。“快乐倍常”，心理上无比的快乐。所以，道家张紫阳真人有句话，“烦恼无由更上心”，这个时候想起一个烦恼，起不来烦恼。找个烦恼来生生气吧，没有什么生的，他“快乐倍常”。</p><p>佛告诉阿难，这个修法叫做什么？“是名第三惭愧自责观。”</p><p>“尔时阿难，闻佛所说，欢喜奉行，此想成者”，这个观想，惭愧自责以后，发生这个欢喜，包括这个观想，整个的法门叫做“第三津腻惭愧观。”我们这个全身，一个人气色好不好就是“津腻”。换句话，什么叫津腻？现在话就是荷尔蒙、内分泌，甲状腺的内分泌、脑下垂的内分泌、肾上腺的内分泌、性腺的内分泌，这个人体的年轻不年轻、漂亮不漂亮、有没有光色，是内分泌的作用。佛经这里是“津腻”，“津腻惭愧观”。</p><p>所以，我经常说：哎呀，世界上闹来闹去，明朝的文人李笠翁讲，世界上的一部人类历史就（是）在唱戏，这个戏台（上）只有两个人在唱，唱了几千年，哪两个？一个男的、一个女的。李笠翁说的。</p><p>我说的更不同，这世界上的人类历史只有两个小虫在作怪，男性荷尔蒙、女性荷尔蒙，屁事都没有，就是两种荷尔蒙造出来那么多业！这就是“津腻惭愧观”。</p><p>今天我们贪污五分钟，少讲五分钟。因为下面这一观很长、很多，你看，连着有四五页，中间把它切断了不大好意思，白骨切断了就没得玩的了。所以，这个留到下个礼拜一，今天到这里为止。</p><p>好了，不要起立了，就是这个样子，好好好……</p></div>"
},{
    "title": "禅秘要法讲座 07",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>我们第一次讲到白骨观这个名称（时），提到了唐伯虎的名句，“公案三生白骨禅”，那一首诗最后有“衲衣持钵院门前。”这首诗的故事、来源，在历史上的故事……，后来引用到苏东坡的两句话，那么，他的原诗现在找出来了。这是苏东坡有名的一条玉带，就是以前做官时穿的，玉带是代表阶级的。苏东坡把这一条玉带送给在金山寺的佛印禅师。所以，以前我们到金山寺，很难得要请出来宋朝苏东坡送的这条玉带看一看。就是这个故事。</p><p>那么当时，他送这个玉带给这个庙子，永远留下来做纪念，等于现在把东西送给故宫博物院。佛印禅师就还礼，送他一件和尚衣，和尚裙子——现在我们出家人穿的衣服是明朝老百姓的衣服，宋朝穿的有不同，是大的长裙。那么，当时苏东坡接到了他的这件和尚衣，就写了这一首诗，“病骨难支玉带围，钝根仍落箭锋机。”自己认为很钝，佛学很通，修持没有证得。不过，他总是风流才子，跟唐伯虎差不多，最后他讲佛印禅师为什么送和尚衣给他，“欲教乞食歌姬院，犹胜云山旧衲衣。”那么，这个故事是连着的，所以今天将这一首诗给大家补充出来。</p><p>今天没有很多的问题。现在没有太多的问题，就是白骨观，这个《禅秘要法》的修法已经讲了三种修禅定的方法，主要都是以白骨做基础。我们晓得，平常研究佛学，普通打坐，并不是为长生不老。那么看起来，佛学谈空，有许多的观念：人不为长生不老，得道有什么意思？所谓佛学谈空，不是没有，换句话，比普通观念（对）长生不老的欲望、贪念还要大，要求一个生命是永远不生不灭、永远不死！那不是普通的长生不老。那个永远不死的生命，在佛学的名词可以叫做金刚不坏的法身；肉体的长生不老也可以修到，那就是金刚不坏的报身；再加上千百万亿的化身等等，但是这是大目标。</p><p>不管怎么大、小的目标，要真正修到道的境界，第一步先要证到无我。我们在理论上的无我很容易讲，解说得通；实证上的，拿身心来求证，身体、生命来求证无我就不容易了，做不到了。不要说无我不容易做到，我们做到了无身、忘身，都不容易做到。</p><p>譬如大家静坐有经验，坐在那里，始终受身体的拘束、障碍，做不到（无身）的。所以，走白骨观的这个路线，真修到了，很快地能够到达忘身，甚至于进一步要无我。</p><p>关于忘身、无我，我们这个生命像个什么呢？所谓业力，业力像个什么东西呀？我们有个比方，可以有三种比方。大家晓得吸铁石，这一块吸铁石，所有的铁一碰到它，都把它吸过来了。我们有了这个生命以后，为什么思想、杂念、情感那么多、思想那么多？因为本身已经变成一个吸铁石一样了，业力的业解脱不开。所以，佛法的第一步先要修到解脱。</p><p>思想、杂念怎么能够解脱呢？等于吸铁石那个磁性的功能先把它还原了，还原到没有磁性的功能，那并不是磁性丧失了。磁性这个大地就是一个磁场，（但）我们现在并没有被吸动。修行就是把这个磁场归到本位了，那么，就不会乱吸了。</p><p>所以，白骨观的修法（是）先空掉我们的身，等于这块吸铁石已经还到本原了，还到那个磁场的本位，寂然不动，那么就很容易证得性空的果位。</p><p>第二，比方像这个地球，乃至每个星球，本身都有吸引力，地球中心的地心吸引力，这一点科学常识我们现在人都有。你看，用一个火箭，冲出了地球的地心吸引力，那地球把它没办法，吸不回来了。所以，我们修行，修白骨观的业力，念头为什么不空呢？等于我们这个身体是个地球，它总是向内吸的，所以业力脱不掉；业力要大勇猛如火箭一样，冲出来到太空，空的境界，业力解脱了。所以佛家求解脱。</p><p>脱出来以后，就是更升华的生命，所以，由欲界到色界、到无色界，乃至于超出三界。所谓超出三界，不是到第四界去，就是在三界可以自由往来，不受拘束，不受这个业力的吸力所拘束了。我们由这些道理，自己可以悟到、了解到修白骨观的功用（是）如此。</p><p>但是，工夫做到这样，是不是已经解脱了？不说往生西方、东方哪一方的佛国，至少，是不是能够（由）欲界进入到色界天，（由）色界天进到无色界天呢？不行，你工夫做到无我、空性，还是凡夫禅，那是工夫。真正要证果位（是）什么？八十八结使，就是这张表（三界天人表）。</p><p>就是说，你白骨观做到了身空——有一个问题，你怎么做到身空？四大空、白骨观空了，怎么做到的？我们青年同学里头，哪一位可以答复出来？……我代你答好了，免得麻烦，因为我修观想做到的，对不对？修观想的成就。谁在观想？我在观想。你什么在观想？我心在观想，唯心所造，所以做到了。心是什么？贪嗔痴慢疑，这些结使，十个结使，贪、嗔、痴、慢、疑，等于是情绪化的、情感化的、个性化的，那么加上还有五个东西，观念思想问题：身见、边见、邪见、戒取见等等，有五个见，所谓见，就是现在话讲的观念，思想观念都要解脱开。</p><p>再进一步，心上解脱开多少程度，他所得的天人之间的果位差别就在这个地方。所以，四禅工夫（是）配合三界天人的这个等差……但是，证果位呢？证罗汉果位？是从心的了（liǎo）。（而）要天人等差，那是从禅定的工夫了（liǎo）。</p><p>我想，这段话大家也许不大容易懂，因为一般人都是贪图做工夫。</p><p>做个比方，譬如这个房子有十二层楼，等于三界，要想到这个房子的哪一层楼，必须要坐电梯上来，当然走楼梯上来也可以，这个没有关系，电梯也好、楼梯也好，这是个工具，这个等于禅定的工夫，你就可以到达某一层楼的境界。可是，到达这一层楼，这一层楼里头要想怎么转变这个环境，这一层楼的环境布置，或者这一层楼本来是个跳舞厅，我现在把它变成了佛堂，是心了（liǎo），不是电梯、楼梯的功能，做不到的。是比方这个意思了，大概可以知道了。不晓得我的比方清楚了没有，这是现场的一个比方。假设没有搞清楚，要多从这个表（三界天人表）上去研究。所以，赶紧补充了这个表，不要光做白骨观的时候，以为做到了那个境界，就是可以证果位了。</p><p>证果位（是）心了（liǎo），证果位的工夫（是）身了，身体上了。身心二了，两方面都要了，那么才是佛法的真正修持之路，不是一方面了（就）可以做得到的。现在，我们这个前提交代了。</p><p>再看下面，也是属于“溃烂想”，把自己身体溃烂想，文字大概都看得懂，请你念下去。</p><p><strong>【佛告阿难。此想成已。复当更教系念。住意左脚大指上。令谛观脚大指节。起膀胀想。】</strong>这个“膀胀”，现在人大家讲膨胀，就是这个膨胀，念膨胀。<strong>【见膀胀已。起烂坏想。见烂坏已。起青黑赤白诸脓血想。是诸脓血。极使臭处。难可堪忍。如是渐渐。至膝至臗。皆令膀胀烂溃不净。观左脚已。右脚亦然。如是渐渐。至腰。至背。至颈。至项。至头。至面。至胸。举身支节。一切膀胀。皆悉烂坏。青黑赤白。诸脓流出。臭恶杂秽。不可堪处。想一成已。复更想二。想二成已。复更想三。想三成已。复更想四。想四成已。复更想五。想五成已。乃至想十。想十成已。见一室内。周匝上下。诸膀胀人。皆悉烂坏。青黑赤白诸脓。悉皆流出。杂秽臭处。不可堪忍。复当更想一由旬。想一由旬已。乃至想百由旬。想百由旬已。乃至见三千大千世界。周匝上下。地及虚空。一切弥满。膀胀烂坏。青黑赤白诸脓流出。杂秽充满。不可堪处。</strong></p><p>佛告阿难。尔时行者。见此事已。自观己身。不净充满。观于他身。亦复如是。当作想念。我此身者。甚可患厌。众多不净。弥满一切。谛观是已。畏生死患。其心坚固。深信因果。出定入定。恒见不净。欲求厌离。舍弃此身。作此想时。自见己身。举体皮肉。如秋叶落。见肉堕地。在前地已。即大动心。心生惊怖。身心震掉。不能自宁。身气热恼。如热病人。为渴所逼。出定之时。如人夏日。行于旷野。渴乏无水。身体疲极。此想成已。乃至食时。见所食物。如膀死尸。见所饮浆。犹如脓血。此想成已。极大厌身。观于身内及于身外。求净不得。</p><p>佛告阿难。复当更教。令其易想。莫使弃身。唐无所得。易观法者。当于远处臭秽之外。作一净物。教其系心想一净物。心眼明了。即欲往取。如是渐渐。所见广远。诸不净外。有诸净地。如琉璃地。见此净处。即便欲往。转复广远。意不能达。</p><p>佛告阿难。尔时当教如此行人。而作是言。汝所见事。是不净想。此不净想。而杂秽物。当知此想从颠倒起。皆由前世颠倒行故。而得此身。如此身者。种子根本。皆为不净。汝今实见此不净不。虽见不净。于外见净。当知此净及与不净。不可久停。随逐诸根。忆想见是。此不净身。属诸因缘。缘合则有。缘离则无。尔所见事。亦属缘想。想成则有。想坏则无。如此想者。从五情出。还入汝心。诸欲因缘。而有此想。此不净想。来无所从。去无所至。汝当一一谛观不净。求索彼我了不可得。世尊说我及他。皆悉空寂。何况不净。如是种种。呵责其心。教令观空。见发毛爪齿一切悉无。豁然舍诸不净之物。如前住意。还观骨人。</p><p>佛告阿难。汝持是语。慎莫忘失。此不净观及易想法。尔时阿难。闻佛此语。欢喜奉行。此想成时。名第四膀胀脓血及易想观竟。】</p><p>这第四个修法，我想，大家文字都看懂了，也是叫我们……第一句话，“佛告阿难，此想成已”，白骨观修成，先观清楚了，那么再来过，自己再来过，还是意念所造——先把方法讲了，我们讨论这个修持的经典理论与它的重要。自己在定中，观左边大趾头开始，不是观骨头了，是观我们的肉体，然后到右边、到全身……觉得我们自己膨胀了，怎么是膨胀？发水肿一样，我们人老了，有些人得水肿、中风，不灵光了，肉都发亮了，胀起来，就是要烂。人死了，这个肉体摆在那里也就是这样，这个水肿肿起来，慢慢要烂。</p><p>那么看到肉上一块青、一块黑的，慢慢的破了，皮破了，血流出来，臭得不得了！——这不是理念，自己对于自身做如此的观想。臭得不可忍！自己都闻到自己的臭味——不过有一点你要注意，一切唯心造，就有这样厉害，闻到自己的气味……。</p><p>那么，一直到全身，统统坏完了、烂了，烂了以后，流脓啊、血啊，流出来一地啊，统统满地都是。“不可勘处”，然后觉得自己身体没有留恋的，那么讨厌！那么脏！没有留恋的。不但如此，也可以假想别人，第二个人、第三个人，或者想自己过去的亲人，已死的、未死的，将来都有这一天，都是那么烂了，化一滩脓水又臭又脏，比阴沟里的水、厕所里头的味道都还难受，那个尸体的味道……一个一个想了，乃至一个房间，乃至全天下人，不过都是如此，所有的生命！这不是理念上的，硬是要你观想成功，这个境界出现。他说，尽虚空遍法界，都同我此身一样不净。</p><p>真修到这个，有一句话，“我此身者，甚可患厌，众多不净。”这个时候，佛经上是有这个理论，但是理念你真听过了，理论过了没有用，现在要自己以身求证，看清楚，硬是有这样一件事！所以“谛观是已”，把这个看清楚，“畏生死患”，真怕生死！</p><p>现在你说，我们大家怕不怕生死？并不怕生死，我们一般人是怕死，为什么怕死？老实讲，对于身体留恋得不得了，这个身体自己照镜子，越看自己越可爱，怎么都舍不得。所以，我们普通人并不是怕生死，是怕死，怕这个色身死了。</p><p>如果把这个观修成功了，（是）怕生死，真怕生死！</p><p>怕生死……充其量我死了，就是再来再投胎，变年轻、漂亮，最后还是这样，真的不想再来了。所以，真正“畏生死”，他的道心才真正坚固起来。那么同时，对于三世因果的观念真正相信了，彻底了解了。这几句话特别注意，就是这个道理。</p><p>到了这个时候，要做到什么？“出定入定，恒见不净”，在打坐的时候或者下坐，看到世界上的一切就是这样，脓血兜拢来，这么个人类、这么个世界……，那么，很想把自己的肉体不要了。</p><p>这个时候你会瘦了，工夫到这里人会自然瘦下去。不要害怕，不是病态。然后也会脱皮——像我们这里有几位打坐的，都是有脱皮经验的，有几位老先生最近都在脱皮，不过脱了以后，更白、更嫩、更漂亮了。这个时候是要脱皮的，一层一层皮都剥下来一样。那个肉皮掉在地下，自己看到：哎呀，好可怕！这个人原来是这么一个可怕的东西。</p><p>那么，修到这一步，还有第二个关键：下坐以后，一身热的不得了，好像发高烧一样的烫，口也很干，人会发干。实际上，你的生理里头都会起变化。出定的时候，就是冬天，衣服都穿不住，像夏天人在太阳当中一样，身体有疲劳之感。这个时候，到这种情形，你（要）晓得，（这）都是必然要经过的境界，不要害怕，那当然可以喝水、喝茶，没有关系。有一点，不想吃东西了，这个时候看到一切东西啊，觉得很脏，难以下咽。</p><p>所以，这里有一个难关，佛告诉我们他的经验，“此想成已，极大厌身，观于身内及于身外，求净不得。”他说，你真修到这一步，非常讨厌这个肉体，而且自己发现自己这个肉体，身体内外没有一点真干净的地方，看清楚了，不是理念看，工夫到了。</p><p>那么，佛吩咐的最后一个关键，“佛告阿难，复当更教令其易想”，这个时候要调方法了。“莫使弃身”，往往修持到这里很想自杀算了，不想留这个身体了，那就完了，呵。假设在这个时候想办法把自己的生命结束了，反而（会）堕入更惨的果报。所以，佛再三吩咐阿难，你们要注意啊，“佛告阿难，复当更教令其易想，莫使弃身，唐无所得。”如果这个时候把身体结束了算了——在观念上认为，我已经证到空嘛，这个身体没有，本来空嘛，没有意思，不想活了。佛吩咐四个字，一句话，“唐无所得”，徒然你白修的，“唐”就是后世讲的徒然的“徒”，徒然白修一场，白修行一场，了无所得，更谈不到证果，所以“唐无所得”。</p><p>到这一步，要赶快调方法。那么，“易观法者”，怎么调方法？修到这一步，你要马上想办法，最好有善知识在旁边指导。在你远远的地方，我们视线可以达到的，或者是，譬如说很好的金色佛像啊，或者是很好的一个西方极乐世界那个国土的图案啊，现实地摆在那里——最好是观佛像，很柔和、很美的、很庄严的观世音菩萨、阿弥陀佛的像，看他。调这个方法，做观想，观佛像。</p><p>而且，最好这个佛像能够塑成琉璃体，中空的，透明而光亮，慢慢把这个观念移到外境界，再打入内境界，最后懂得《阿弥陀经》所讲的极乐国土那个情形，看到……。那个是真正证入到——以这个娑婆世界的不净，换取了、证到了那个净土去。</p><p>这样的境界，那么，（是）由这个不净想变成了净土。所以，老实讲，这是念佛修净土法门的基础，这样把净土的境界随时观想起来。</p><p>所以，我们大家没有研究净土的《观无量寿经》，乃至大家《阿弥陀经》木鱼一敲念过去了，那个境界没有去想。这个想成功就是观想，就是大密法了，净土现前。</p><p>那么，再进一步就是禅了，这个时候并不会身上发热啊、厌恶自己生死啊，都没有了。就是心念也清净，身体也清净。那么，身体上有病的，这些病也好了、没有了，跟着前面阶段那些脓血的观想都流走了，各种病都变了，人就换了一个，脱胎换骨。</p><p>可是，这两样，由不净想——这是生命实际情形的观起，然后，到了不净想的工夫做到了，赶快换方法，一转，变成净想，净土的观法。那么，到了这一步，你悟了道没有？没有，下面就是禅。</p><p>“当知此想，从颠倒起”，这就是禅宗所谓的参了。这个时候参：哎呦，我起心动念做不净想工夫，把这个生命肉体硬是变成这样，样子都变了，一切唯心造；现在，一作净想的时候，自己马上就变成菩萨面，身相都变了，身心就立刻变了。等于禅宗的一个祖师，杀猪的屠夫，一悟了……，……杀猪的，天天杀猪，后来被一个禅师教化，悟道了。他当下把屠刀丢了，杀猪刀丢了出家了，写了个偈子，他大彻大悟了，“昨夜夜叉心”，昨天夜里是夜叉、恶鬼的心肠。“今朝菩萨面”，现在变成菩萨了。“菩萨与夜叉，不隔一条线。”这是所谓一个屠儿悟道，一个杀猪的悟道的偈子。但是，普通人看了只做文学的看法，他悟的是什么道也很难懂得。</p><p>现在，这里告诉我们渐修的方法，渐修跟顿悟一样，你把这两样观想工夫做成功了，由不净变成净，然后就要参了，净与不净不隔一条线，原来皆是我这个心念所想而起。这个心念所想的，一切众生——就是刚才八十八结使里头，就是下面这个见，我见、身见这个观念打破了。一切的人我是非等等的感情、思想、烦恼，都是由这个见，我的主观形成，唯心所造。所谓现在的话叫主观、唯心。就是“皆有前世颠倒行故”，自己理不清，被自己欺骗了，被自己心念欺骗了。</p><p>人没有悟道以前，没有一个人是聪明人，而谁骗了你呢？没有人骗了你，都被自己欺骗了。所以，我们这个身体、肉身得来，也由多身累劫被自己身见——所以，八十八结使里头，要解脱这个身见才能证果。自己被这个身见给骗了，所以始终要抓一个身，以为是我——怕死！以为抓到自己这个身，所以拿到这一坨冻肉，冰库里出来的那个冻肥肉，还觉得自己很好吃呢，舍不得，都由如此来。</p><p>到了这个时候，你真正悟到此身见的不对，“此身者，种子根本，皆为不净。”注意这个话，佛说的。到这个时候，你研究我们这个生命，生的种子是什么？女性的蛋，男性的精虫，这是身的种性，肉体（是）这样变来的，男女两个精虫卵蛋结合，父母生了我们，变成我们这个身体，此身种子是根本“皆为不净”。</p><p>所以，我们晓得讲哪吒太子，削骨还父，把自己的骨头削下来，砍了，还给爸爸；削肉还母，把血肉还给妈妈。后来《封神榜》上写，结果还完了以后，他的灵魂没有依靠了，怎么办呢？碰到他的师父——是什么人啊？记不得了，就把荷叶剪来，剪一个人的身体，把他的灵魂接上去，转来就是哪吒太子，三头六臂，脚踏风火轮，手拿火焰枪……不得了！脚踏风火轮就是气。唯识所生、唯心所变。所以，我们这个身上的“种子根本，皆为不净。”</p><p>那么，现在因为修这个法，“实见此不净”，注意啊，“实见此不净”。我们理论上现在都知道身体不净，这是理论啊，你没有确实见到身体内部的不干净。修这个观法，要“实见此不净。”“虽见不净，于外见净”，内心的不净，外面看到净土，“当知此净及与不净，不可久停”，都是无常，都是唯心所造。“随逐诸根，忆想见是”，这都是我们自己思想的颠倒、观念颠倒。所以，佛学的理论到这里统统要实证过。</p><p>然后，下面都是佛学的理论。我们读经、研究佛学只看理论，《禅秘要法》这个理论没有实修，不能实修、没有实践过——空洞理论！好听一点，一个名称叫做干慧，没有真正定水滋养的智慧；不好听的，就是瞎吹。你吹可以，抵不住事的，病来抵不住病，生死来更抵不住生死，你学问理论、佛学再好、佛经再会念，没有用！所以要实践、实修过来。下面都是理论。</p><p>那么最后，他要我们再回转来到身上内照形躯，观想清楚，我们身体是这样，头发、牙齿这些兜拢来的一个假的……最后，这个骨架子上面贴上许多不干净的东西，血啊、肉啊这些贴上来……等于我们艺术家塑造一个东西，先把一个人形弄起来，再来雕刻，再涂上油漆，就变成了……。</p><p>然后，清净了，还是一个白骨观，光修骨人。注意，“还观骨人”，所以，还是以白骨为主体。</p><p>“佛告阿难”，所以，你要把这个法子记着，修持的方法，千万不要忘记了。这个叫做不净观以及不净观的一个变换的修持方法，那么，给它定一个名称，叫做“第四膀胀脓血及易想观”， 这个法门，修法的过程大致如此。</p><p>几时有人修到？刚才我们看苏东坡的诗，“钝根仍落箭锋机”那就是钝根，也许三年、两年、几个月修不到；利根的话，这一念这个境界就出来，就马上修到，很难说。这个时间、迟速啊，《楞严经》上说“迟速不同伦”，利根与钝根的成就差别很大。所谓利根，（是）多生累世修持过来的，钝根是这一生刚开始在念幼稚园，慢慢来了，只好慢慢来。这个钝根理论都懂，修到难。</p><p>那么，这个修法，我们晓得，在佛经上是了什么呢？大家想的出来吗？研究一下看，我们在座的很多都是研究过佛学的，我可以指定范围给你们想想看，当做考试题。就拿净土宗的道理（看），是了什么呢？我再提一下你懂了，了五浊恶世里头的哪一浊？了命浊！所谓五浊恶世，佛说的，这个世界叫做五浊，五种都是脏的，清浊的浊；恶，不是善的世间。哪五浊？你们报报看，（同学答：劫浊、见浊、烦恼浊、命浊、众生浊。）劫浊、烦恼浊、命浊，这个观法就是了这个命浊的。</p><p>所以，真修行净土的人，扎实根基在修……如此了命浊的这个法门修好了，一念净土，没有不往生的，百分百的把握！而且，现生就可以净土现前。像这些都是本经，这一本经，这个法门里头所谓禅秘，它的奥秘所在。</p><p>普通讲净土，“南无阿弥陀佛、南无阿弥陀佛……”念到后来……，我不是常常告诉你们现实的经验，很多朋友念佛念了几十年，最后到医院上了氧气，看他的时候，我说“你现在正好念佛。”“念不起来了、念不起来了，没有用了……”他还会讲话，你叫他念佛，念不起来，他就是见地不行啊！你讲话的那个观念转过来念佛号——但是，就是你佛号念起来也不对，念者是念也——心念，就是这个观想成功。</p><p>所以，此法是了命浊。附带也了见浊，观念、见解。实际上，五浊皆了。所以，你不要看它是小乘方法，（那）就搞错了！所以，看到本经几千年埋没了，看都不看，埋没了几千年，修也不修。现在我特别把它抽出来。</p><p>埋没了，大家不修，所以后世学佛修道人证果很少，听起来很简单……——而且越是认为自己聪明的人越不肯修，怎么呢？“哎呀，叫我坐在那里想自己又膨胀、又烂了、又臭的不得了，诶！这有什么想的！本来等到死的时候，一定膨胀、一定臭、一定烂，我现在想干什么？”这就是妄作聪明。</p><p>你现在先想那个境界，做到了、修到了，此身肉身即身成就了，这一生就把这个肉体变了，这个成就的奥妙，妙用无穷。因为大家现在都没有修过，只（能）给你讲（到）这个程度。</p><p>所以，你看在座很多学佛的居士，男居士、女居士，叫他真正修行的时候，“哎呀，我这样事情没有了、那样事情没有了……。”等到你膨胀了以后，你看看，你了不了？那个时候你再来修修看——没得你修了，连白骨架子都没有了！现在还有点依靠啊。像密宗修法的那些佛菩萨拿的骷髅杖，现在你还有（骷髅杖），杖就是依靠。</p><p>所以你看，佛教里的法师们出来手里拿锡杖，杖就是依仗，有个依赖。你现在还有这个白骨可以依赖、可以修修。你说“我等中阴身修……。”哎呀，那你做不了主啦，随风飘堕啊……刚才我比方，那时候的中阴身像吸铁石一样，你的业力是块吸铁石啊，远远地就把你吸过来了，那还有你可以修？！</p><p>所以，这是第四观。现在，我们第五观……哦，还有五分钟，先休息一下，提早五分钟……</p></div>"
},{
    "title": "禅秘要法讲座 08",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p><strong>【佛告阿难。此想成已。次当更教系念一处。端坐正受。谛观右脚大指上。令指上皮携携欲穿。薄皮厚皮。内外映彻。其薄皮内。有一薄膜。亦当谛观。如是渐渐。至膝至臗。左脚亦然。至腰至背。至颈至项。至头至面至胸。举身皆尔。薄皮厚皮。内外映彻。携携欲穿。如被吹者。其皮膀胀。不可具说。身诸毛中。一一毛孔。百千无量。诸脓杂汁。犹如雨滴。从毛孔出。疾于震雨。内外俱流。脓血盈满。不净之极。难可堪忍。犹如脓池。亦如血池。诸虫满中。此想成已。当观胸里。举身是虫。犹如虫聚。复当更观左脚大指。膀胀脓溃。青脓。黄脓。赤脓。黑脓。红脓。绿脓。白脓。烂溃交横。与屎尿杂。复有诸虫。游戏其中。秽恶臭处。不可堪忍。厌患此身。不贪诸欲。不乐受生。</strong></p><p>此想成时。见大夜叉。身如大山。头发蓬乱。如棘刺林。有六十眼。犹如电光。有四十口。口有二牙。皆悉上出。犹如火幢。舌似剑树。吐至于膝。手捉铁棒。棒似刀山。如欲打人。如是众多。其数非一。见此事时。极大惊怖。身心皆动。</p><p>如此相貌。皆是前身毁犯禁戒。诸恶根本。无我计我。无常计常。不净计净。放逸染着。贪受诸欲。于苦法中。横生乐想。于空法中。起颠倒想。于不净身。起于净想。邪命自活。不计无常。</p><p>此想成时。复当更教汝莫惊怖。如此夜叉。是汝恶心。猛毒境界。从六大起。六大所成。汝今应当谛观六大。此六大者。地水火风识空。如此一一。汝当谛推。汝身为是地耶。为是水耶。为是火耶。为是风耶。为是识耶。为是空耶。如是一一。谛观此身。从何大起。从何大散。六大无主。身亦无我。汝今云何畏于夜叉。如汝心想。来无所从。去无所至。想见夜叉。亦复如是。但安意坐。设使夜叉来打汝者。欢喜忍受。谛观无我。无我法中。无惊怖想。但当正心。结加趺坐。谛观不净及与夜叉。作一成已。复当作二。如是渐渐乃至无量。一一谛观。皆令分明。</p><p>佛告阿难。汝好受持。观薄皮不净法。慎莫忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第五观薄皮竟。】</p><p>《禅秘要法》的第五个修法——我们不要忘记，都是以白骨观为主，所以，每一个法门，佛教（jiāo）的时候都说了这个。</p><p>为什么教了三十几个呢？这是个人的业力、智力，智慧的力量，情绪、兴趣各有不同，就是根性不同，所以佛说了很多方便的法门。但是每个法门，老实看起来，很难看，并不漂亮，很痛苦，这个经典……而且文字很明白，谁看了都懂。大家因为自己没有修过，所以证果的人很少。实际上，拿现在观念来讲，每个法门都是非常科学的。而且，有最高深的佛教的无上教理在内。</p><p>譬如说，我们刚才念过的是第五重(CHONG3)的修法，这个修法的名称定在最后，刚才我们看到了，叫做第五种“观薄皮”，就是薄皮观，由外皮肤观起。</p><p>那么，它的重点大家已经念过，我想已经看懂了。不过，回去要修，自己要真看看……——所谓修，（是）求身证，就是你们听到的《瑜伽师地论》，弥勒菩萨再三提出来，学佛求道以身证！心证、身证。理论上懂了很多，身心起不了变化，没有用！要身证，所以，《瑜伽师地论》中弥勒菩萨再三提到身证之重要。</p><p>那么，这个埋没了几千年的《禅秘要法》里的真正的大奥秘就是佛亲口所传的,至于其它的各种法，哪个佛传、哪个佛传，更多了，我们暂时不管。这都是我们本师释迦牟尼佛亲口所教的，而且合于现实。</p><p>他教我们这个法子的第一句话，“次当更教系念一处”，大家注意这个话——都觉得看懂了，你仔细想一想每一段……，由前面讲的四个白骨观的修法，是不是连着次序一个一个来的？不是。我告诉过大家，可以由你根器所如，（从）哪一个法门进来都可以，或者每一个法你自己（都）修过，也可以。</p><p>为什么叫你系念一处呢？白骨观观成了——我现在问青年同学们，尤其是研究部、学院部的同学们，白骨观修成了，系念一处在哪里？（同学答：……）白骨架上？（同学回答：前额……）对，额或者胸，上面有交代过的。可见大家都不留意……（叫）老师讲啊，拼命讲啊，自己回去不研究，也不去体会。叫你系念这里，白骨观成以后都有交代的，现在也是一样。</p><p>那么，因为你白骨观已经观成了，所以系念一处，“端坐”就是打坐，“正受”就是没有杂念了，心系一缘，杂念妄想没有了，这是正受境界。然后在这个里头……密宗呢、藏密就是说，这个又要另起一个生起次第的修法，叫我们再来，在这个定境界里……——所以，读书要注意啊，不然你们都白读了，假设考试，你们都答不出来，决不是我冤枉你了，讲过的一提，你都知道了，一提，每一个都是未提先知；一问到你，过后方知。</p><p>“谛观右脚”，这一个方式变了。观骨的时候，观内在起的时候，都从左脚观起，当然，右脚没有讲，就是由左边趾头观起，右边一起来，由下到上、由左到右，对不对？这个法子变了，从表皮外面，先从右观起，你要研究起来是什么道理，都牵涉到医学的道理。所以，你们大家一看，大概没有什么要紧的……。</p><p>所以，真正的密法，大奥秘都在大显教里头，很明显地告诉你，但道理你要去研究。</p><p>“谛观右脚大指上”，这是表皮的，先叫我们坐起来——不是叫大家把脚脱光了，拿到自己眼睛前面看，没有用啊，是心的念、想。</p><p>那么，觉得这个皮慢慢……，实际上，我们每天洗脸、洗澡，水里头都有脏的，这个皮肤新陈代谢，一擦就有擦下来，本来如此。他叫我们看清楚“欲穿薄皮”里头的“厚皮”，皮里面有层薄膜，学过解剖的大家都知道；你们没有学过解剖的，至少看过生理卫生，皮下面有脂肪、有薄膜。那么，这样都看清楚，由脚上来……，当然到脚边了，由右边开始又一直到膝盖头、到髋骨，就是屁股，就是现在普通讲的坐骨了，就是这个地方（师示骷髅模型），这个骨头现在是站着立起来，它就平起，就是我们打坐坐着的这两个骨头。</p><p>国语念kuān，过去念kūn，后来讲屁股不好意思，中国人很讲礼貌的，用kūn。后来，这个髋字也不写，用个乾坤的坤来代表。所以，吃鸡屁股说是后坤、后坤，乾坤的坤，实际上是这个髋，髋骨。</p><p>再加一句，“左脚亦然”，右边观清楚了，自己搞清楚了，左边一样。然后两脚一上来到腰、到背，一路上来都是皮。我们这个人的肉体是皮包的，就是一个皮包着，里面很多兜拢来的东西，脓啊、血啊。然后，观念上到达那个境界：使皮膨胀开来，然后看皮的每一个毛孔里头都是虫，寄生虫，都是脓血，从毛孔里（流）出。</p><p>然后这个时候——他这里不讲气功，实际上气功在内。一个念头真观起来，念头一定住了以后，呼吸可以停止了，自然地。所以，后世密宗修什么瑜伽、修什么宝瓶气，这个是后世硬做的哦，真得了定，自然……，气功不要修了，宝瓶气，自然不呼不吸了。</p><p>做“膨胀”想，一膨胀呢——普通说膨胀就是工夫了，我们看，练气功一练，手都胀满了，指头都满了：你看我工夫好……这是普通世间的。在这里，要加心理观这个气进满了、皮破了，血都爆出来了，下面很难看，就叫我们看虫子都落下地来，虫都掉出来。这一层比上面的修法又有不同。</p><p>他说，这个时候最重要的，第三行，“当观胸里，举身是虫”，就是说，由胸腔部分看起，我们的内五脏，心肝脾肺肾，身心内外都是寄生虫。你说：那我们还活着干嘛？现在并没有虫，你割块肉来化验，没有虫啊，我们肉割下来，或者是好的细胞，不是虫。你摆个三天两天看看，也不要放冰箱，马上细胞变虫了，一见到空气就变虫了，是都是虫。</p><p>所以，我们现在等于说，活着，我们整个没有生病以前，这个细胞没有腐化，不变虫以前，看着是个活人，很漂亮，实际上是个虫聚的身体，是一大堆的虫兜拢来，很多的细胞在兜拢。</p><p>到这个时候，你马上要再观左边的脚趾头，“膨胀”，本来这些脓啊，到处是“红脓、绿脓、白脓”，脓有很多种颜色，不错的，到外科病院去看看就知道了，很难看。“烂溃”，大便、尿……就看到都是虫。</p><p>如果你这种观想成功，也会同前面一样，自己可以闻到自己本身的体嗅的臭味。当然，你修禅定，念佛修成功的人，不走这个路线也闻到。所以，你们打坐经常有时候闻到香味，对不对？你们很多都有经验。然后你问到我，我说：“好嘛，功德无量，菩萨的香啊。”那是普通跟你讲。所以，香、臭都是自己本身体内发出来的。所以，有时候檀香味是脾脏，就是气到了脾脏，这一部分干净了就有檀香味；兰花香味啊（等），这些都是肝脏、肾脏所发来的。</p><p>同样的，你坐起来，有些人的禅定工夫不一定做这个白骨观，别的念佛也好、禅定也好，其它工夫做到……，有时候觉得，忽然一股臭——你体内有问题，你要注意，就是这个道理。</p><p>所以，修这一个观，到了这种境界的时候，你会感觉到自己身体内部的丑恶、讨厌臭的，不可忍……。那么，到这个境界，佛法不是要我们离欲嘛——广义的欲许多啊，都是欲，求名、求利；狭义的就是男女之间性观念的这个欲。到这个境界，你到了自己闻自己……观清楚了一身都是虫的世界，虫的生命的世界，又觉得自己这个体臭是不可闻——本来是嘛，我们几天不洗澡……，现在自来水方便，你要到边疆去，老实讲，那些人一辈子洗三次澡，你站在旁边，老远，一股味道就来了。再加上吃大蒜、葱、姜，哎呀，那个味道真是香不可挡啊！挡不住的，呵，是这样一个东西嘛。</p><p>不过是大家闻自己闻惯了，觉得很好闻。其它的动物跑到我们身边也并不觉得我们好闻。等于我们闻那个猪是一股猪味，它闻我们是一股人味，也不舒服的。</p><p>这个时候，你自然，贪欲心、欲念没有了。也“不乐受生”，很想这一生能够修成功，再也不想来了，这个世界、这个身体……至少这个世界上的身体是这么可厌恶的！他说，这一步是境界，工夫修到这里会如此，这些都要你去实证的。</p><p>但是，这里一个关键就来了，你们普通打坐的问题在这里可以解决了，不要再问我了。他说，“此想成时”，当你修持到这里，修持到这个境界的时候，你打坐起来闭着眼，看到一个大鬼、大夜叉——你们有时候看到一个黑人啊，看到什么，都吓死了，还不是真的呢。这个时候有真的大夜叉来。</p><p>夜叉是两种，夜叉是鬼道的，也属于鬼道、阿修罗道之间的。男的夜叉都丑，又凶、又丑、又坏；女的夜叉是漂亮到极点。所以，母夜叉不是形容那个女的难看，是形容那个女的是妖娆到极点，那才够得上称母夜叉哦，男的夜叉鬼不好看。</p><p>“大夜叉”鬼身如大山，“头发蓬乱”，这个鬼像把它画一画，画出来很难看的，“头发蓬乱”像“荆棘林”；“有六十眼”，每只眼睛“如电光”的样子，比手电筒还亮；“有四十”张嘴，每张嘴有两个牙齿，而且两个牙齿向上面长，“犹如火幢”，那牙齿都发红的，等于我们有许多人吃了槟榔，嘴也不洗，两个牙齿发红的那个样子；这个舌头，嘴里面的舌头像剑一样，舌头吐到多长呢，可以吐至膝盖头，那么长挂出来；手里拿着“铁棒”，那个棒子像“刀山”一样，马上就来打你。有时候……那你不发疯了才怪呢！</p><p>你们万一打坐坐得好好的……，当然，现在你们坐着，你说“我绝不怕！”当然，现在（有）那么多人保护你；（若）夜里坐在黑暗的地方，或者住在山里、庙里，打坐坐到这个境界，你问问自己看，那是什么情形？所以，我们现在修道都不算的，电灯下面、闹热下面，棉花垫子、毛巾盖起，然后再墙壁靠起，四面八方有人，然后，“我是对生死、鬼神都没有恐怖心……”你不要活见鬼了！到那个时候，你单独看看，确有这种境界来，就有这样的情况来。</p><p>这是描写的一种，还有一种怪模怪样来的，你所想象不到的，各种各样的都来，或者有笑的、哭的、叫的，乃至这些都没有了，很漂亮的现前，乃至你心里想一下情人，他都会来，那都是真的……告诉你这些，是什么呢，这是科学，你不要认为……。</p><p>“如是众多，其数非一”，不是一个来哦，他是描写一个鬼的现状哦——多得无比、无数来，都要拿棍子打到你的头上，不把你吓疯了才怪！你也不要做白骨观了，这个时候，你白骨一定倒下来了。佛吩咐你，见到这个境界的时候，佛告诉你，“极大惊怖，身心皆动”，不管你定力怎么好，人怕起来都发抖。</p><p>这个境界是什么来的？真的有鬼吗？一切唯心造。“如此相貌”，你看到的鬼像、夜叉像是什么像？就是你前生的相；何必前生，我们现在自己也有，有时候想钱，想人家口袋里的钱到我这里，挖空心思那个贪欲的想，那个面孔比这个还难看呢！有时候发脾气、有时候恨起人来，瞪起眼睛，当面“嘿嘿嘿……”转过来（师示动作），那个同这个差不多诶。他说，这些鬼像，不是外来的，“如此相貌，皆是前身毁犯禁戒”，就是不道德，“诸恶根本”所变。</p><p>这一段特别注意啊！佛经不是念过、看过就懂了。但是，你证到这个境界……。都是由“无我”里头“计我”，“无常”里头“计常”。计就是苦集，抓一个常、抓一个我，不净里头抓这个净。“放逸染着，贪受诸欲，于苦法中，横生乐想，于空法中，起颠倒想，于不净身，起于净想。”我们生命活着，佛经叫做“邪命自活”，都没有正命活着的，都是打人家主意来供养我。</p><p>你说：“我做生意，有什么打人家主意啊？做生意多辛苦啊！”做生意那是大骗子一样嘛，要把你口袋里的钞票骗得发跳，到我这里来，“好不好？买不买？”本来没有骗你，可是这个东西做得使你欢喜，你钞票非发跳过来。对，这个是广义的邪命。普通戒律上说的邪命啊，算命、看相、看风水，给人家算卦，讲阴阳怪气的话、讲预言，这都是犯邪命戒，不正念。</p><p>“邪命自活，不计无常”，这些鬼相怎么来的呢？你打坐境界（中）为什么有魔、有鬼来呢？魔鬼在哪里？你唯心所造，都是你前生业障反影的面孔、反影的情形，就是这个话。换句话说，等于精神病。</p><p>我们现在心理学（讲）这个人心理错乱了、精神错乱了，他所说的话、他所表达的事情、他所看到的境界，外面真有个鬼跟着他吗？没有。那么，现代医学说是精神分裂，精神何以分裂？他自己心理里来的，是没有鬼嘛。假设有一个精神病（人）坐在这里，怕得很，他会这样（师示动作），我看到是个布幔，没有东西嘛；他看到的真有东西，布幔里头会钻出一个东西来？是假的。</p><p>所以你们晓得，打坐里头的境界怎么来现前的，你们现在知道了，你们在坐中所看到、所呈现的什么境界——真对于佛学，显教、密教都是一样的，你懂了以后，这个境界一来……</p><p>譬如，我的老师有一次在青城山闭关，有一天中午他出来告诉我……叫我过来，我在另外一个地方，他喊我过来：“哎呀，怀瑾，我很惭愧……”我说“什么事？”他说：“刚才我在入定的时候，我那个座位……”他打坐也是那么个凳子，“座位下面出来一条大蟒蛇，身体有水桶那么粗，那个头就有好几丈长。”我说：“真的？我去看看……”他说：“不要看了，现在没有事了。我告诉你，你不要去看，就是一个境界。我多生累世的嗔念不断所形成的。”他脾气大，嗔恨的（时候）要杀人的，看不惯都要“宰了那个……”嗔念不断。他说“你怕这个境界是真得吗？真的，当然不假。”我说：“那我再去找，你坐下有个洞？”他说：“你看不到了，没有。”但是，是嗔念所生。假设不修持，他生来世变蟒蛇，嗔念大的变蟒蛇、老虎这些毒蛇猛兽。</p><p>那么，你看佛经上讲的这些因果话，我们普通听的《劝世文》，就是教化性、教育性的、境界性的。你要真讲修持，你自己的境界上都看到了，你呈现的……你业力重的是什么，看到的就是什么，都会来。那么，自己把自己会吓疯了、会吓死了的。死了以后，也变成这一类的东西去了，就转生，就转生这个鬼道、阿修罗道，就转生这一类东西去了，那个形象就是你心理的反影。</p><p>所以，这里佛怎么告诉你呢？我们看第四段，“此想成时，复当更教汝莫惊怖”，你要指导别人，告诉他：你不要怕！“此夜叉，是汝恶心，猛毒境界”，这些鬼啊、魔的境界哪里来的，外来的？都是你自己心里头过去、现在的坏心眼所反影出来的那个现象。</p><p>你说，那这个话怎么讲？诶，譬如我们画一幅画，画一幅山水画，没有看过山水，一个画家画得出来很美丽的一个山水嘛？当然画得出来，也（会）构想出来。这个是什么呢？这幅山水是你心里构想出来的。同样的，这些坏东西是你过去阿赖耶识心理上的阴影，已经有过的，反影出来的这么一个东西、变出来。都是你的“恶心”，“猛毒”的境界。</p><p>那么，它怎么会在打坐的时候呈现变成恶鬼的相呢？诶，你心理的幻想来啊，幻想会变成有形的，有时候打到你身上还痛哦，打你骨头上，你硬是觉得痛哦。哪里来的呢？心物一元的。这个心理的——现在的新名称叫做什么？意识形态？心态！新名称是心态，你不要老了，新名词来了就要学新名词。</p><p>这个心态怎么会变成真的？你会感觉到会打你呢、会痛呢？“从六大起”，心态跟你心理内部的变化配合。</p><p>六大是什么？我们都晓得四大，还有两大是哪一大？你大、我大？对，地、水、火、风、空、觉（感觉知觉）、识，那是七大。</p><p>都是因为你心理感受……，……走火入魔，哪里有魔啊，也没有火，佛叫你了解这个。</p><p>原因呢，它的原因是你心理上潜在的、下意识的贪嗔痴慢，就是八十八结使里头起的，因此配合了生理，同样由这个原理懂得病理哦，我们的病也（是）由身心（起）的。每个人身体不同，也是业力，它配合了你这个生理同心理交关的六大所形成。这个地方你就要“谛观六大”，这就又走到了禅的范围，参啊，参就是研究，你要观这个“六大者，地水火风识空”……这里用识不对？地水火风空觉，识是七大……（同学答：觉是第七大。）觉是七大？那我讲错了，你对了，对不起啊，“地水火风识空。”</p><p>他说，你要在这里头参究清楚。那么，怎么参究清楚呢？还是反观，在禅定中哦，还是坐在那里看“此身”，这个身体，再研究、参究：地水火风哪一大是我？都不是我。这一点，同《楞严经》的观法一样，走入大乘的那个观法一样，在身体上样样参究清楚。“六大无主，身亦无我”，这就是智慧观了。</p><p>晓得，这个时候是“六大无主”——不是六大无主，六大都有主哦，骨头属于地大做主，我们身上的口水、血液、眼泪、鼻涕等等，水大做主，对不对？怎么叫做无主呢？那都是因缘聚会，六大兜拢来（成）这个身体。这个身体既不能完全属于水大，也不能完全属于火大，所以说“六大无主”。最后是因缘所聚，这个身体新陈代谢，随时变化，所以“身亦无我。”既然，这个地方重要，就是证到此身无我。</p><p>上面四五层的观法，叫我们观白骨观，一个一个塌下来，化空了，那是拿实际的观想的形态，盖房子一样盖成，（再）垮了、空了。这个时候，是理念的了，更进一层。所以，没有什么恶魔，没有什么夜叉。</p><p>所以，在这里佛说，“云何畏于夜叉？”所以，这些魔鬼的境界都是你做工夫出来，内心的反影，你的恶业反影出来。随心，这等于你心里头的意识思想、心念一样，“来无所从，去无所至”，没有根的。所以，一切夜叉，这些魔鬼的境界都没有什么可怕的。</p><p>你们经常说有黑影来压你，（是）同样的道理。为什么你在睡觉的时候，经常有个黑影大人来压你？因为你在一团无明，你就乌漆抹黑的，所以，乌漆抹黑更来压你。你本来（是）一片乌漆抹黑，昏天黑地。怎么没有一个白的来压你？有啊，到某一种情形，就有白的来压你了，你白痴一个，他当然白的来压你了，都是相同的。</p><p>那么佛说，这个时候，怎么对付这个境界呢？15页的背面第一行，“但安意坐”，就是你一切念头空掉不管。先是夜叉来打你，好像觉得鬼来打你，马上觉得自己的头被他打掉了。“欢喜忍受”，没有什么，只要仔细观“无我”，“无我法中”，既然无我，连我此身也没有，本来是化成白骨，白骨也化空。不过呢，你现在把我打了，打成粉碎，早一点了也好，此心一观无我了以后，没有恐怖之想，就没有恐怖想。</p><p>所以，佛吩咐在这种境界上，“但当正心，结加趺坐”，正心诚意，双腿一盘：“你打死吧，来啊，打昏了就算了。”一切过去了。</p><p>“谛观不净”，然后，只有起慈悲观，对魔鬼、夜叉起慈悲观，你即是我，我既是你，同体之悲，无缘之慈，只有怜悯、慈悲的观念，何必你要做坏事，如此。</p><p>乃至每一点、每一点都观清楚了，然后，达到什么呢？真正达到此身忘身，身体的感觉忘掉了。</p><p>我们普通假设打坐做工夫，要等到身体奇经八脉的气脉统统通到，气住脉停，呼吸停止了，心脏的脉搏跳得非常慢、非常慢了，等于没有跳动了，气住脉停，才感受上觉得忘身，（这是）照普通修持的路。哪一年做到？差不多十几年、一二十年还不一定修到。如果走白骨观的路线，观想成就，证到理、事的解脱，很快到达忘身境界，这就是第五薄皮观的方法。</p><p>那么，我们现在第六观。</p><p><strong>【佛告阿难。此想成已。复当更教系念。着右脚大指上。当谛观脚指。使脚膀胀。从脚至头。如吹皮囊膀胀。津黑青瘀难堪。满中白虫。如粳米粒。虫有四头。蠢蠢相逐。更相唼食。肌肉骨髓。皆生诸虫。一切五藏。虫皆食尽。唯有厚皮。在其骨外。其皮厚薄。犹如缯练。诸虫出入。如穿竹叶。内外携携。其皮欲穿。眼中躁痒。有无数虫。穿眼欲出。生眼眶间。身分九孔。亦复如是。诸虫尔时。从厚皮出。入薄皮中。皮遂穿尽。虫皆落地。其数众多。不可称计。作一大聚。犹如虫山。在行者前。更相食啖。或相缠绕。尔时行者。见众多虫已。复当系念。谛观一虫。使此一虫。啖诸虫尽。既啖虫已。一虫独在。其心渐大。见向一虫。大如狗许。身体困顿。鼻曲如角。嗅行者前。其眼正赤。如烧铁丸。</strong></p><p>见此事已。极大惊怖。当自忆念。我身云何。忽然乃尔。作如此事。先见诸虫。更相食啖。今见此虫。形体丑恶。何甚可畏。此想成时。当自观身。我此诸虫。本无今有。已有还无。如此不净。从心想生。来无所从。去无所至。亦非是我。亦非是他。如此身者。六大和合。因缘成之。六大散灭。身亦无常。向者诸虫。来无所从。去无所至。我身虫聚。当有何实。虫亦无主。我亦无我。作是思惟时。所见虫眼。当渐渐小。见此事已。身心和悦。恬然安乐。倍胜于前。</p><p>佛告阿难。汝好受持。是厚皮虫聚观法。慎莫忘失。阿难闻佛所说。欢喜奉行。此想成已。名第六厚皮虫聚观竟。】</p><p>这是佛说的第六重（CHONG3）的方法。</p><p>实际上，我告诉你，《禅秘要法》真正的修持，如果有人不管走显教、净土也好、禅也好、天台的止观也好、走密宗的也好、走道家乃至其它的也好，这些境界都经历，小境界都来过，大的把握不住，所以不容易成就，证果的人少。</p><p>你不要看佛经的第一个法子、第二个法子，好像很罗嗦，什么薄皮，外表的，就是现在医学讲的表皮是薄皮；厚皮就是进一层了，粗的地方了。那么，他是已经讲过了，好像看起来又反复——都有的，每个用功，不管你修哪个法门，经过过这个程序都会有。</p><p>所以，因为我们大家在坐的人，很少有专修，有专修的境界，有时候很快就过了，有时候很慢地过，有时候就过不去——过不去，很多人修道啊、打坐啊，最后发疯了、着魔了、精神分裂了、神经病了、血压高了，或者马上得急性的心脏停止了，各种各样死的很多，就在这个境界……</p><p>我们现在看到这些境界不是不相干，你要特别注意，都相干。</p><p>第六个就是厚皮观了。我们都是厚皮了，这个厚皮……而且最讨厌了。这个厚皮第一个从哪里出来呢？他说，叫我们在定中，也是从右边脚想起。他这里叫你做观想，就是说，我们这个肉体一定要死，死的时候老化——现在还不讲死，一个人老化，皮肤干燥了、粗了，慢慢长黑斑了，皮肤都皱拢来……所以有些生皮肤癌啊、皮肤瘤啊，就是皮肤里头有白色的虫——所谓讲虫不一定是爬得动，（是）细胞有细菌性的，一颗米一样，等于我们年轻的时候的青春痘啊，如果在佛经形容，也是虫变的，血液不干净，这些东西就来了。他说，这个虫有四个头，等等等等。</p><p>这些在我们身体内部所观到的虫，都互相在里面作战。道家也讲这个身体是个小宇宙。实际上，我们身体上真研究起来，有很多寄生虫。</p><p>那么，只有厚皮包在骨头外面。那么，自己观察到，到某一个阶段，这个皮皲裂，身体像个皮囊一样，观察到身体上……包括自己的血液流动，带那些细菌走动，这个虫像在很静的山林里头，你看那个细虫在竹叶子上爬，“沙沙沙”那个声音。</p><p>到这个时候，你观到这里，打坐到这个时候是什么呢？往往眼睛发痒，恐怕你们很多人都经验过，坐坐坐……眼睛会发痒，痒得不得了，有时眼泪流出来——有许多虫因为你静坐的工夫，从眼睛这里掉出来。</p><p>但是，因为大家没有做白骨观，又没有真的达到那个真的定静境界，所以自己法眼不开，看不清楚——所谓法眼，不是这个肉眼的眼睛，一定要心地在光明中，这个眼就看清楚了，真的是这些东西掉下来，身上的这些渣滓，从命浊里头掉出来。</p><p>然后，虫虫从眼睛里头掉出来，乃至“九孔”——人生九个窍，头上七个洞，两个眼睛、两个鼻（孔）、嘴巴、耳朵，下部两个，人生所谓九窍，九个洞。有时候你工夫做到某一种程度，反而都有病态出来。不是病，（就）有时候烂啊、生虫啊、发痒啊，就是身体内部赶出来的，是有这个现象。</p><p>那么，佛跟我们讲的更清楚，他说这个时候，这些虫从“厚皮”里边爬出来，又在“薄皮”里爬进，爬来爬去，看到虫“落地”，掉下地来，不晓得多少！</p><p>其实我们每一天，睡在床上抓抓皮肤，抓白了，很多皮肤上的细菌也掉出来，白皮（屑）掉在床上多的很哦，是很多，这么抓几下（就）掉下来很多。所以，这个身体的生命是个很大的虫堆拢来的一个东西。</p><p>但是，你要真修持，往往又碰到一个境界——很可能会碰到。你正在入定，很好的时候，碰到这一种变化情形的时候，你会在定中看见：哦，这些虫在地上，满地都是，虫吃虫……就是边疆的人，云南西南边疆人养蛊一样，大虫吃小虫，有凶的虫吃，恶的虫吃善的虫，最后所有虫……他说，你这个时候，晓得这个景象，有一个方法，要把这个身体内部练变化了，那你就定住一个虫，增强它的力量，让它去吃大家，吃完了以后，这个虫马上膨胀，跟狗一样大。</p><p>就是说，你有时候打坐静坐，有时候修定境界好的时候，有时候忽然一个狗或者老虎一样，眼睛很红的就跑来吃你。你们好几个人经过的，是吧？吓死你！哎呀，眼睛都发红……就是这个境界，大如狗——狗还客气一点，更大。</p><p>然后，“行者”，就是打坐修行的人，到你前面，眼睛像烧的发红了。那么，你不懂这个境界是怎么来的，你心理害怕了、会狂乱了、会发疯了、会神经了。如果你学过《禅秘要法》，懂得了这个道理，自己晓得：这个所谓毒蛇、猛兽、恶犬也都是自身业力所变、反影，“哎，也就是我，”自己的业力，坏的一面的反影。</p><p>那么，再看这些虫，一个一个……晓得这些恶狗或者猛兽，都是我自己过去生的业力恶习所反影，恶毒的心理所反影，就没有事了。</p><p>再看此身虫也是空——那么这个地方也就是禅的境界，要理来参了。这些虫，因为我自己本有的身体，“本无今有”，父母没有生我以前，本来没有这个身体，现在活了几十年，固然父母帮忙生了这个身体在这里，“已有还无”，最后还是没有。</p><p>这两句话，后来被什么人用到呢？曹雪芹写《红楼梦》就用到了，“本无今有，已有还无”，就是这里抓起走的，千古文章一大抄，就是这里抄出去的。</p><p>此身“本无”，本来没有，“今有”，现在暂时有，虽然我现在有，最后还是没有，“已有还无”。所以，观想做到“如此不净”，这个不净包括虫，包括你前面看到的那个凶恶境界来的时候——我们讲是半天啊，当时就是一霎那一念之间就悟到了。都是“从心想生”，来也无所从来，去也无所去，《金刚经》也讲过了，也不是我，也不是他，一切是唯心所变，也就是“应观法界性，一切唯心造。”</p><p>所以，乃至说一笑就是降魔法了，呵，它境界就没有了；不笑，或者悟到了，点个头：你就是我，凶个什么呢？我对我又何必凶啊？或者我对你又何必凶呢？都是空的。</p><p>那么，所谓一切虫，这一切境界，都是在生灭的“六大”因缘“和合”，都是因缘所生。所谓变成狗、变成虫，都是因缘所生。“六大散灭，身亦无常”，六大分散，此身没有，就是真的狗要来吃我，这个肉体喂你吃饱了，等于我们吃羊肉火锅一样，也没有什么了不起。我就给你当羊肉吧，喂喂你饱吧，“身亦无常。”</p><p>定力坚固，这个境界，前面这个恶毒的境界慢慢地消灭了，也就是你经过这一关的修持，你的业力慢慢解散了。然后，前面恶狗的境界、虫的境界都没有了，你又进了一层。</p><p>此时，见到这样境界经过了以后，八个字，“身心和悦，恬然安乐，倍胜于前”，这个时候，你身体换了一个人一样，不但是身体，心理是无比的慈悲、慈爱、高兴，“恬然”就你们年轻人现在讲：好恬啊，好恬美这个意思，很恬的，恬然、清净、安乐，比前面所得的定的境界更高。</p><p>那么，佛告诉阿难，这是第六层的厚皮观，白骨观里厚皮观的观想。也是一个修定的人，正式走禅定之路，所必然（要）经过的一个境界与道理；也可以说是很可能经过的境界与道理。不管你走哪一种修法，都会碰上的。</p><p>今天到这里为止。不要起立了，好了……</p></div>"
},{
    "title": "禅秘要法讲座 09",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>观想两个字，实际上，这里经典上很少提到观、想，想就是用我们的思想，在五阴来讲，就是色、受、想、行、识，第三个想；在唯识五遍行里，就是作意，作意跟想，作意、触、受、想、思，就是想去作意，造作出来这么一个境界；那么，在八识里头，就是用意识的带质境，很轻松的就观起来。有讲过，先观这个模型都可以。</p><p>它的原理，在《瑜伽师地论》，我们正上课到这里，一切的观想、一切修持的方法，两个路线，一个叫无分别的影像，另一个是有分别的影像。譬如密宗的修法，做白骨观的修法等等，都是有分别影像修行。有分别，就是意识有分别，比方说白骨观，这个是脚趾头，这是哪个骨节，他讲的都是（要）你心去分别。</p><p>那么，你们大概觉得：那不是妄想吗？是妄想——是想，无所谓妄想。因为你知道，我现在有意的，也可以说故意的，去造作这么一个观、这么一个境界。</p><p>所以观法，先用这个影像观起来，一个影像不管在前面，或者在上面、在下面，都不管，乃至于说，你现在只把目前我们台子上摆的这一具白骨观的简单模型——不很详细，做的并不很好，不精详，大致上不错，大概不错。就用它做影像，你看了不是有个影像嘛，这个影像很轻松地留住，不是拿眼睛那么盯着去注意，也不是用心注意，用心注意就观不起来。</p><p>把这个有分别的影像，这一具白骨定住了——所谓定住（即）止住了，止什么呢？不是把它钉在墙壁上叫止，也不是钉在身上叫止，就在你的意境上，思想的领域里头，一个幻影一样就不动了，怎么叫不动啊？其它妄念都有，不管了，主要是这一个，此所谓止。</p><p>能够慢慢止、止得别的妄想杂念都没有了，只是这个白骨了，或者是一个脚趾头的白骨了，这叫止。止了以后，不用力、不用心，这个影像始终不去了，这就到达观，由想到达观。</p><p>所以，止观不是眼睛看，自己的意境上随时看到这个影像了。那么，这个止观影像定久了——要多少时间能够真得到止，能够真定得久呢？那就很难讲了，那看你个人的业力、个人的智力，智慧的力量，个人的功力，也许很快就到达。</p><p>到了以后呢，定久了以后，突然，一念之间回到身上来。所谓回到身上来，不是这个白骨模型跑到你身上去哟，就是你这个念头，一下，“一念回机，便同本得”，就到身上来。然后就看到自己的白骨，脚趾头啊、骨节啊，上面经典上所讲的，一样一样都呈现了，很自然、很轻松的呈现了。那么，呈现了，回到观心上了。</p><p>说硬用力去观，观不出来的，不对的。是这样一个情形。所以说，怎样观起来，就是这样观起来。</p><p>根据佛经，根据本经白骨观的修法，包括了佛法各宗各派显教求证的方法。也就是说，以身证入，身体这个身。那么，所谓以身证入最方便的法门就是白骨观，很快能够有效果，很快能够证到。</p><p>那么，这个以身证入的基本原理是唯心，心念去造的。所以心能转物、心能转心、心能转身了，这个心就转了这个身体。我们之所以有烦恼、痛苦，就是有身。老子也说过，“吾所以有大患者，为吾有身，及吾无身，吾有何患？”</p><p>这个色身怎么空它呢？平常讲空四大、空色身，那是理论，多困难!你怎么空得了！？所以，白骨观是切切实实教我们，做一点的成就，有一点的效果，使色身马上容易空掉，真正进入了空（了）这个色身，马上容易证到无我。这是观法的道理。</p><p>第二，你看白骨观的观法简简单单，它有很多的奥秘，包括了后世所谓密教、密宗的大成就的法门。当然，大家很少有真正学过密法、密教的，所以暂时还不讨论这个理论。以后，有所观起来后，慢慢告诉大家。密教密宗，用很大的方法，修气，修气功，修脉，然后转变这个色身，一生做不到三生，三生做不到七生，或者有点成就。</p><p>如果真了解白骨观为基础、基本，应该说，即身可以证得，就是现在这个生命。所以，看大家自己对于理上真切的了解了没有？做的工夫如何。</p><p>尤其在本学舍、本院的同学们，现在开始起，所有的日记与报告是讲切实工夫的路子，闲话不必多写了，写了没有用。说“我自己很忏悔、很惭愧……”在这里一个礼拜写一篇短短的，“我都没有什么进步……”那你不要拿来给我看了。现在是一步一步要考查真正的修持。</p><p>再说，白骨观现在讲到第六观了。我们在坐的平常都多多少少学过很久的佛法，佛法基本的四谛法门，苦、集、灭、道，大家都会讲，十二因缘、四大皆空，这些理论都会；那一点身心，哪一个人能够证到呢？！没有证到，那苦集灭道不过是一个名词上的观念而已，没有用！</p><p>修白骨观，切实使你证到此身是苦。怎么样是苦？怎么样是灭一切？灭一切杂念妄想？灭一切苦？那除了得道，道是什么？证到了空性境界。白骨观所讲的，你看，最起码的东西而（是）叫你真正求证苦集灭道。然后进而——那你说，这都是小乘法吗？不然，本法里头都是大乘法，后面每一观都是告诉你，空、无相、无愿的求证方法。</p><p>还有，第二个问题，大家问到，修白骨观那么多方法，一步一步来，怎么得定呢？这就是定法，白骨观告诉你的（是）修定的一个方法。</p><p>至于定的境界，每一个方法做到了，譬如你脚趾头，一个普通人，真正观起了一个趾头白骨，他四加行一定来了，得暖，身体得暖，内部得暖；由暖——身体所谓暖，就包括了道家所修炼的、密宗所修炼的气通、脉通，都来了，一得暖，气通、脉通自然来了，用不着讲那个气到哪里了，哪一条脉了……用不着了，一起来了。得暖以后自然到顶，顶会打通了。顶就是头顶，到达了顶，（就）与天地相通了、交了，宇宙天人合一了。那么，由顶以后，自然得忍，一念不生，全体呈现。自然得到世第一法，因为你还活着，还在这个世界上，这个色身没有抛弃，不需要抛弃，所以世间第一。这个世间是三世间，也就是三界的世间第一。</p><p>那么这个中间，自然是初禅、二禅、三禅都到了。你一个境界定了以后，你不要再去玩白骨去了，你白骨能够空了，这个肉身能够空了，那么再进一步，如何修到报身、法身的道理，都包括在内了，大家仔细去研究。</p><p>现在，我们只根据这个经文，详细加以说明，加以实证的说明，告诉你怎么修法。</p><p>修最后的理，前两次我们都有提到，最后都有很高深参证大乘的性空、妙有，妙有就是缘起，妙有性空的这个中道观，都自然在其中矣。希望大家要了解这个。</p><p>因为有人问两个问题，一个是做工夫怎么观；另一个就问它同禅定，四禅八定的关系。每一个观法的一点，都有四禅八定在内，包含了四禅八定，这个特别要注意！</p><p>今天所问的问题答复到这里。现在是第七观了。</p><p><strong>【佛告阿难。复当住意。系念一处。谛观右脚大指上。从足至头。好谛观之。当使皮肉都尽。肠胃腹肝。肺心脾肾。一切五藏。悉落堕地。唯有筋骨。共相连持。残膜着骨。其色极赤。或如淤泥。或如浊水。作浊水想。持用洗皮。从足至头。皆使如是。自观己身。极令分明。观己身已。于现前地。复作一身。使在前立。如己无异。想一成已。复当想二。想二成已。复当想三。想三成已。复当想四。想四成已。复当想五。想五成已。乃至想十。想十成已。见一室内。周匝上下。满中皆是。赤色骨人。或有淤泥色者。或有浊水色者。以浊水洗皮。如是众多。渐渐广大。满一由旬。想一由旬已。想二由旬。想二由旬已。渐渐广大。想百由旬。想百由旬已。乃至见三千大千世界。满中赤色骨人。或有淤泥色者。或有浊水色者。以浊水洗皮。周匝上下。纵横弥满。</strong></p><p>佛告阿难。汝今谛观此赤色相。慎莫忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第七极赤淤泥浊水洗皮杂想竟。】</p><p>这是第七个观法，也可以叫做——不是可以，也叫做“金锁骨”观法，黄金的“金”，金字旁的“锁”，琐碎的“琐”也可以，两个字都通，金锁骨想。</p><p>金锁骨在佛经里头……。一个修道成功的人，涅槃了以后有几种，一种（是）留形住世，肉身整个的在；或者是金锁骨，肉身化开，骨架子，全身的骨架子，骨都变成金色，而且每一个筋、骨，肉没有，筋等于黄金打的铁链，身上的筋同骨头一节一节都连着，就是说，提起来这一身的一具骨头，“哗啦哗啦”，都作五金声的响，金锁骨。</p><p>过去，有几位菩萨……。譬如中国有一本笔记，记到唐朝有位女士，平常的生活行为非常浪漫，谁都看不起（她），最后死了以后，随便葬在……，她的情人也很多啊，大家就把她埋葬了。结果碰到一个得道的印度梵僧过来，一看到这个坟，赶快跪下来拜。那么，一般人很奇怪，就问这个外国和尚，梵僧，所谓得道的，印度过来的，“你怎么拜这个坟？这是个妓女的坟啊，你这个出家人……”“哎哟，你们不要乱讲，坟中人（是）金锁骨菩萨化身。”大家说这个外国和尚乱讲，“哎，不信你挖开看……我正要来取这个骨头。”他说，“你拿去干嘛？”“回到西域，回到印度供养，金锁骨菩萨。”大家不相信，挖开，果然，全身骨头筋都连着，整个发金色，黄金色。梵僧就向大家说，“对不起啊，给我请走了，这是金锁骨菩萨现生来。”所以金锁骨，修行……</p><p>还有，唐史上记载，唐明皇晚年，开元三大士——唐明皇后来修密宗，说开元年间，密宗三大士，善无畏、金刚智、不空三藏，是他手里提倡弘扬的，他本人自己晚年修密宗。后来，唐明皇死后，若干年以后，坟墓被人盗开了，头变金色，说头颅骨变金色，敲都敲不（烂）……敲起来都发金石的音声，就晓得他原来修秘法已经有相当的成就，就是杨贵妃唐明皇那一位，头骨已经变了金色。所以，金锁骨修法这种成就……。</p><p>所以，得道的人涅槃有很多（方式）。还有一种，或者是修成了，连带色身化光而去，化一阵光，所谓自己体内发动三昧真火，只看到一阵光一亮，没有了，整个人都没有了，肉体骨头都化了，影子都没有。为了留给世间人纪念，头发或者是指甲、脚趾甲不化，留下来。这是一种。</p><p>还有一种成就了，人体最后涅槃的时候，缩小，缩小了变婴儿一样大，乃至缩小这个架子那么大，这也是一种涅槃。</p><p>还有一种涅槃是长大，长大更难。譬如说，研究过《瑜伽师地论》，或者各种经典上，欲界天的天人生下来，刚刚出生，就有我们世界人的三岁大；再高一层的，一生下来就有我们这个世界十岁那么大，种种，情形不同。</p><p>所以现在，本法讲的是金锁骨的修法，它的名称、起始观法。</p><p>佛告诉阿难，教我们重要的四个字，“系念一处”，一处没有讲哪一处。然后告诉我们，哪一处也可以，让我们“谛观右脚大指上”，从脚到头，整个的白骨一起来，皮肉掉了，都没有了，里头的心肝脾肺肾五脏都没有了，都掉到地上来，向下掉下来。只有筋骨还在，筋骨外面有一层残膜还在，薄皮一样包着。</p><p>等于你们（在）博物馆看到的木乃伊，不过，木乃伊那个样子并不好看，腊肉一样。这个要观自己薄皮还在，“赤色”，就是发古铜色。或者觉得这个身体外面烂泥，或者是“浊水”，浑的水……注意呦，这个时候观想，或者从头顶下来，或者（从）观音菩萨净瓶里倒出来，观音菩萨的净瓶这么一倒，浑浊的水，等于油漆一样，或者是浊水，整个地灌洗这一身筋骨，洗干净，从足至头，由下到上、由上到下都可以，都是这个样子，洗干净。那么，只看到自己，内观自己，就是这一具金锁骨摆在这里。</p><p>自己观成了，在你观想的境界上，再观想前面另一个，同样的一个，或者想你的亲人也可以、你过去的父母也可以，乃至佛菩萨也可以，或者都没有对象，就另外观一个我的化身也可以，再来一个……一个想一个、两个、三个，乃至遍三千大千世界，都是这么一个古铜色的骨人，都是经过这个浊水清洗。那么，就泡在这个水里头，“周匝上下，纵横弥满。”等于一个人，我们在化验室看到的一个肉体，这个骨泡在药水里面一样，比方。这次只有这一个修法，非常简单。</p><p>那么，佛同阿难讲，这个叫做赤色的，就是刚刚我提出来的金锁骨的修法，他说你不要忘记了，这是一个修法。</p><p>这个修法看起来很简单，但是一念之间，自己从右脚一边开始，一念之间立刻把它完成，一个金锁骨……什么叫一念？就是一呼一吸之间，气一进一出之间就观成，就在这个境界定住了。这里后面没有叫你化空，先在这里定住。这是第七个观法。</p><p>现在再继续第八个。</p><p><strong>【佛告阿难。复当更教系心住意。观左脚大指。从足至头。如新死人。其色萎黄。当观己身。亦复如是。见萎黄已。当令黄色变成青赤。此想成时。见于前地。有一新死人。其色黄赤。见一已见二。见二已见三。见三已见四。见四已见五。见五已心想利故。恒见己身。如新死人。如是想成。见一切人。满阎浮提。如新死人。此想成已。转复广大。见三千大千世界。满中新死人。自见己身及以他身。等无有异。此想成时。心意惙然。贪欲转薄。</strong></p><p>佛告阿难。汝好谛观。是新死想。慎莫忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第八新死想竟。】</p><p>这又是一种观法，佛同阿难讲的“新死想”。</p><p>但是一个重点，“系心住意”，心跟意，心就是指一切妄想心同本来的清净心，意就是意念，一切妄想杂念不起。就是一意观想，从自己的左边大拇趾开始，一路到自己头上——当然，你是个利根，会观得起来，就从脚这么一带，整个觉得人刚刚死掉，自己死掉。死人的肉，先是黄黄的，然后烂了，变青的，变腊肉一样，只叫你观到这里，自己觉得死了。</p><p>这个时候你不要管身上什么气动啊、脉动啊，你已经死了嘛。我们反正有一天死，呵，就刚刚死……。你的心意识好像离开了身体一样，也在这个身体上一样，在这个死身体上。</p><p>然后，这个时候，当你（做）新死想，新死，刚刚死掉，觉得自己死掉——你观成，一定住的时候，马上很可能有个反影，你在定中，或者闭着眼睛、或者开着眼睛，看到前面躺了一个死人，刚死的人。不要怕的。现在佛也告诉你，会有这个境界。这就是说，你的唯心所观想的境界，一个第二重的反影而已。</p><p>那么，慢慢的……这个境界还不止看到一个，好像站着、躺着，满地都是这样新死的死人，乃至看到三千大千世界……。</p><p>所以，拿中国文学来讲，四个字，行尸走肉，没有一个人，都是死人，看到也在走路、看到也在讲话，不过是个尸体，刚死了的尸体。</p><p>那么，到观成这个境界——这都很容易的，“新死想”，觉得这个世界……，……也没有人我是非，也无所谓烦恼，看到每一个都是这样的，刚刚死了的死人，如此而已。</p><p>这个时候，“心意惙然，贪欲转薄”，心里觉得“哎……”什么道理呢？觉得：哎，一切没有道理，不是没有意思，还不是一切皆空！心里头一切平平淡淡，引不起别的什么欲来，所谓贪名、贪利、贪饮食、男女，一切心念薄了，淡薄了，不是绝对没有，非常淡。他说，这个是“新死想”的一种方法、观法，这都是比较容易的，比上面所告诉我们的……</p><p>如果有利根的人，碰到烦恼，碰到什么事，拿这个观想，两腿一盘：哎！本来我们都是个死人，没有什么生气的，死人跟死人俩有什么生气呀！？我们骂人：“你这个死相！你这个家伙，死相！死鬼！”本来都是死鬼嘛，都是死相，没有错，这一念放下就到了，贪欲、一切烦恼就薄了，这是这个。</p><p>但是你看，这几个法子都很简单——你说简单，开始为什么不用这个呢，先来白骨呢？你看，这个是“第八新死想”，你们要研究哦，这个层次里头有问题的，很有问题，这个层次你慢慢都去参一参啊。为什么到这里才作这个新死想？假定前面的白骨想，你没有观成，你也觉得自己死了，起不了作用，起不了什么作用？你的贪欲、你的杂念，一切都空不了，所以到前面白骨观等等一切成就，（依）次序观到这里，作用就来了。后面统统会变的。</p><p>现在，第九。</p><p><strong>【佛告阿难。复当更教系念住意。谛观左脚大指上。从足至头。使心不散。见身诸骨。一一分明。共相支拄。亦相连持。无有破者。毛发爪齿。皆悉具足。皎然大白。见己身已。往复反覆。想令白净。想一身已。复想二身。想二身已。复想三身。想三身已。复想四身。想四身已。复想五身。乃至于十。想十身已。见一室内。周匝上下。悉是骨人。毛发爪齿。皆悉具足。白中白如珂雪。见一室已。复见百室。见百室已。见一阎浮提。见一阎浮提已。乃至见三千大千世界。满中骨人。毛发爪齿。皆悉具足。其色极白。白如珂雪。此想成时。心意恬安。欢喜倍常。</strong></p><p>佛告阿难。汝好谛观具身骨想。慎莫忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第九具身想竟。】</p><p>这个第九个观想，这个法门的观想，大家都看到了，都懂了。其中的要点就是“系念住意”四个字，还有“使心不散”，这都是要点，“系念住意”，“使心不散”，一念不散乱，就在这个境界里。</p><p>还是叫我们从左边的大趾头开始，从脚到头，就是身心完全合一了，把自己整个的身体，全副的白骨完全观清楚。当然，有准确的模型，大家看过更好；不然呢，乃至买医学上用的，骨科用的，真正学医的——好像中国翻成中文的不知道有没有，英文的有四大本，很大的大本，四大本，每一个骨架子，每一块细骨、大骨，都很清楚，都看得清清楚楚，就像我们前面摆的这个白骨模型架子。</p><p>每一节、每一节“支拄”，都连着起，没有破损，也没有断。白骨观成了，白骨外面包含头发、毛、牙齿、指甲，都在，就是没有肉，没有内脏，“皆悉具足”，全部观好。那么，这个境界观成一个什么呢？整个的白骨，自己这个身体外形的架子，白色的，很白，到这一步，很白的全身骨架子都在，观想出来以后。</p><p>然后，再观想、作意，造作出来，生起的，另外作意生起前面有一个，还是我的化身，乃至两个、三个、四个，乃至百千万亿化身，都是这样一个白骨架子，有头发、有毛、有牙齿、有指甲，都有。</p><p>唯一的重点，白到什么程度呢？“白如珂雪”，像那个发亮的贝壳，像雪那么白、那么亮。自己一闭眼——老实讲，观到这个白的、亮的一来，还不要观光，你可以在黑暗房间里，完全黑暗，自己正坐， “白如珂雪”全具一观出来以后，虚室生白，黑暗房间里，不要开灯你都透亮，任何一点东西都会看得很清楚了。所以，这个叫做“具身想”，第九个“具身想”。</p><p>那么，这个观想成功，不是说你刹那之间，脑子里一下“哎，我现在想出来了。”那没有用，你想出来，定不住不算，就是要你持心不散；你想出来，没有回到自己本身上也不算；第二，回到本身上要定住，这才算。</p><p>这个修法，观想成功的时候，“心意恬安”，心理上非常愉快，不是一天到黑愁眉苦脸有烦恼，心里非常恬然，就是现在人讲的很甜、很安详，心里一天到黑是欢喜，欢喜超过平常。那么，这是第九个观想。</p><p>现在，我们继续第十个。</p><p><strong>【佛告阿难。复当更教系心住意。谛观右足大指两节间。令心专住。无分散意。观两节使相离去。唯角相拄。观两节已。从足至头。皆令如是。使节节解。唯角相拄。从头至足。有三百六十三解。一一谛观。令节节各解。若不足者。安心谛观。令节节各解。唯角相拄。观己身已。当观他身。观见一已。观见二。观二已。观见三。观三已。观见四。观四已。观见五。观五已。乃至观见无量诸白骨人。节节各解。唯角相拄。见此事已。复见四方。众多骨人。亦复如是。</strong></p><p>得此观时。当自然见诸骨人外。犹如大海。恬静澄清。其心明利。见种种杂色光。围绕四边。见此事已。心意自然。安隐快乐。身心清净。无忧喜想。</p><p>佛告阿难。汝好谛观。此节节解想。慎莫忘失。阿难闻佛所说。欢喜奉行。得此观者。名第十节节解观竟。】</p><p>第十观，都是由上面这个成就（以后），再换一个，所谓易观，就是调一个方法。那么，这个易观就是说，叫我们做骨节的解脱观。</p><p>我们晓得，一个人肉体到死的时候很痛苦，这里痛、那里痛，那个痛苦无比！不要（说）心念的解脱难，肉体的解脱也很难。尤其我们心意识，从这个肉体要死亡的时候，一节一节就离开了，丧失这个关系、这个关联，很痛苦的。所以一个人到老、到死，各种病来了。</p><p>如果，平常修到了这个法门，白骨观的节节解脱观，所谓了生脱死，临死要走的时候，说“对不起啊，再见了。”刹那之间就走了，因为平常修这个节节解脱观修成了的人。至少，不算来投胎的时候是自由啊，死的时候自如；不敢说是来去自如，去的时候很自在。</p><p>这个修成了，不要说死的时候，现在活着也很自在。我们平常觉得痛苦，被身体的障碍拖累太大，一身都是病、一身都是痛苦、一身都是肉，筋骨肉四大给我们痛苦。所以，这个法门叫节节，每一节每一节解脱观。</p><p>由右边的大足趾观想起，“两节间”，譬如我们的手指头，一节一节的骨头兜拢（来），这两节之间，筋没有了，只有骨与骨……。我们小孩子摆积木，摆那嘎嘎走的的积木木头块，样样这么兜上，不过（是）靠牢而已，中间——实际上，我们这个骨头与骨头，骨节之间靠牢，还有那个筋拴住，筋像建筑房子的那个绳子一样，把它绑住了。这个时候筋把它解脱了，这一节一节兜牢，“唯角相拄”，这个角，就是骨节与骨节这样兜牢而已——不是兜牢！靠拢而已。</p><p>那么，从头到脚，譬如我们手指头，一节、两节、三节，一个指头三节，到这里四节、到这里五节，等等，一共“有三百六十三解”，每一个关节都把它解脱开、松开。这个松开了，“一一谛观，令节节各解”，每一节每一节都解开了。都是中间好像有空隙一样。</p><p>这里我告诉大家一个秘密，在座的有哪些人学武功的？练武功的，你要晓得，大家都讲达摩祖师到少林寺传了一部《易筋经》，《易筋经》你们大概有几个都在练吧？实际上，哪一部《易筋经》是达摩祖师真传的不知道，好多种方法，都是《易筋经》，都有效果的。我在峨眉山的时候看到一部秘本，庙子上藏的秘本……哎，因为我看了很多种，自己也学了很多种，都对身体有效。</p><p>但是，练武功人都晓得，达摩祖师还传了一部《洗髓经》，洗髓的法门。《易筋经》练成了，在武功上，所谓拿武侠小说来讲，武林高手了，呵。如果把《洗髓经》练成了，就入道了。可是，达摩祖师的这一本，少林寺也找不到，《洗髓经》失传了。</p><p>那么，过去练武术界的都那么相传，达摩祖师有没有传这一套，暂时不管；不能说没有，也等于说（是）教人运动，他并不是教武功。那么，有没有传《洗髓经》呢？也不知道，这是讲这些白骨观另外带出来的（话）。</p><p>但是《洗髓经》是什么呢？就是这个法门，就是白骨观里的节节解脱观。所以，武功练到这个程度，就继而进乎道已，由这个技、武功进入了道。所以，中国文化，任何一种技能，都要达到继而进乎道已。练拳也好、画画也好、音乐也好，由技术而进入道的境界。</p><p>所以，节节解脱观就是大家认为的达摩祖师那个失传了的《洗髓经》武功，就是节节解脱观。</p><p>每一节、每一节把它观清楚了以后，就是由作意观想很多的白骨人，都是这样空节。做到了以后，自然见到一切骨人以外，整个的世界非常安详。像大海，比方，整个的世界、心境与物质的世界，最闹，乃至地球翻了，你都在这个境界，非常安详，如大海，所以“恬静澄清，其心明利”，这个时候，心里的智慧开朗了，平常不懂的道理统统懂。</p><p>那么，在这个时候，自然在境中，内外看到七彩的光明，都是自性功能所发出来的七彩的光明，“围绕四边”，乃至充满整个的法界。</p><p>那么，这种观想的经验——我们不是有一位在国外的道友，一个老太太，七十岁了，自己一个人慢慢摸，我寄了这本《禅秘要法》给她，她每一节法门、每一节法门，自己都去实施过了，像这些境界，她都是亲自去经历过了，观到了大海“澄清”，光色四面围绕自己。</p><p>他说，你“见此事已”，到达这个境界以后，“心意自然安隐”，妄念都起不了，也没有烦恼。“安隐快乐，身心清净”，不但心清净，杂念、烦恼、思想清净，还有身清净——你注意哟，“身心清净”不是形容词哦。身清净，有病的没有病，因为一切都没有了，解脱了。这个身……我们有时候学佛打坐，偶然得到一个净的境界，心清净容易到达，身清净你到达不了，这个身体的障碍总归有。这个时候是“身心清净”，既无欢喜也无悲，就是那么安详清净，“无忧喜想。”</p><p>这就是白骨观的每一节、每一节骷髅的解脱观。第十个。我们先休息。</p></div>"
},{
    "title": "禅秘要法讲座 10",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>第十一观。</p><p><strong>【佛告阿难。此想成已。复当更教系念住意。谛观右脚大指两节间。令节相离。如三指许。作白光想。持用支拄。若夜坐时。作月光想。若昼坐时。作日光想。连持诸骨。莫令解散。从足至头。三百六十三解。皆令相离。如三指许。以白光持。不令散落。昼日坐时。以日光持。若夜坐时。以月光持。观诸节间。皆令白光出。得此观时。当自然于日光中。见一丈六佛。圆光一寻。左右上下。亦各一寻。躯体金色。举身光明。焰赤端严。三十二相。八十种好。皆悉炳然。一一相好。光明得见。如佛在世。等无有异。若见此时。慎莫作礼。但当安意。谛观诸法。当作是念。佛说诸法。无来无去。一切性相。皆亦空寂。诸佛如来。是解脱身。解脱身者。则是真如。真如法中。无见无得。作此想时。自然当见一切诸佛。以见佛故。心意泰然。恬泊快乐。</strong></p><p>佛告阿难。汝今谛观是流光白骨。慎莫忘失。尔时阿难。闻佛所说。欢喜奉行。得此观者。名第十一白骨流光观竟。】</p><p>好，我们很辛苦的由白骨研究起，假设一个人修到第十个层次，到了十一个层次，舒服了，易观转过来了。你看，我们还有些同学们修到第二、三法——你们听了课，有几位下去试验的，自己去修，修到观到内脏，自己饭都吃不下了，对不对，都想呕吐了。但是，非（要）把前面的修好，所谓清净此身很难，不但心清净，要把身清净；身清净，连骨髓都观清净了，然后转来，它自然会转，到白骨流光观，佛境界出来了。</p><p>那么，你通任何白骨观的一法，密宗、显教各种法门你都通达了。</p><p>佛告阿难，当你上面第十观，节节骨节解脱观观成了，已经对于生来死去的时候没有痛苦了，要走就走，好像脱了一件衣服一样，比那个还要轻松，因为你一节一节都解开了。我们人的身体，佛经所谓叫这个身体是业气之所生——业气，所谓业力，善有善业，恶有恶业，不善不恶是无记业，就是这股力量。</p><p>那么，修白骨观，这个业力到第十观节节解脱，已经解脱了一部分，真正轻松了。譬如我们大家坐在这里，哪个人轻松？包括男女老幼，没有一个轻松的，一天到黑头昏啊、脑涨啊、身上有病啊、这里不舒服，那里痛苦啊，乃至盘腿坐久了腿酸啊、发麻啊，因为你有肉体，因为肉体上都是你（从）父母生来一直到现在受身以后——受身，接受这个身体，所有都是业力所生。这股力量是无始以来唯心所造的，这个业解脱不了。所以学佛，真正的佛法修持是解脱。</p><p>可是，一切众生在修的时候，拼命去修道，练气功哦，气脉修通哦，哪里打通哦……所以,你们大家修道家的人也没有看道书。正派的道家，南宗，宋朝的张紫阳真人有个偈子，“何事抛身更入身。”像我们一般修道的人，都想求解脱，想成仙、成佛，超脱这个世界。“何事”，为了什么，本来要抛掉这个身体，结果在观想、在守丹田喽，修气功喽，修海底气打通了……“抛身”，抛开了身体，“又入身”，又进到身里头，本来要抛弃了这个身体，结果还又进到这个身体里做工夫，很笨。你们去查张紫阳真人《悟真篇》上的口诀诗，哎，一切众生“何事抛身又入身”，都还在轮回中。</p><p>所以，真正得了解脱，此身业力清净了，很轻灵。换句话，真证了果，得了道的人，这个身体还活着在这里，一样吃饭、穿衣服，也有生老病死，但是，这个身体变成我们手里拿的一支原子笔一样，就玩弄这个工具而已，借这个工具，通电的工具而已。万一坏了，坏了走了，呵，就那么解脱得容易。</p><p>所以，现在到了第十观解脱修成，了死容易，了生还难。所以，再来的时候，能够入胎做主不迷、投胎的时候不迷、住胎十个月也不迷，还在定、出胎也不迷——做不到哦。大阿罗汉，乃至八地以前的菩萨都有隔阴之谜，再投一个胎，所谓轮回，这样转滚来呀，就把他滚昏了。不要说……我们现在就可以测验，你把一个人吊起来，吊在高空，很快地转圈，几圈一转下来他就昏头了。再不然就（是）脑子有了问题，或者是心理起来变化，前面的事都忘记了。何况入胎的那个转动，比这个还快，所以，我们前生的事都记不得了。</p><p>真得了解脱的人，前面第十个解脱观……所谓死去可以不迷，不受这个痛苦；再入身，要抛身又入身，再转身的时候，再投胎变人啊、变什么，要不迷还很难哦，那是智慧定了。</p><p>现在到十一观，他说第十观，这个节节解脱观成功了以后，再进一步，“更教系念住意。”修道这个念头精进没有断，再求进步。那么，叫我们仔细用“右脚大指”着手——现在注意啊，每个法门，上面一个左边开起，下面一个又是右边来；这个假设是右边大趾头观起，下一个又是左边大趾头观起。不要搞错了，不要妄作聪明啊！</p><p>我们有许多青年同学，很多都玩聪明的，书也不注意看，自己觉得一听就懂了，“对了！”然后，一点都没有用，这个叫做自己在那里造业，就是不仔细。</p><p>真正第一等聪明人，绝对做事情、求学，走最笨的路子，那是真正聪明。绝顶聪明的人，做事业也好、修道也好，走最老实、最笨的路子，呆板地走，没有不成的。就怕一般人喜欢偷巧，实际上他是不聪明，世界上最笨的人，才爱走偷巧的路子。</p><p>你们大家再去研究看，世间成功的人物，学文学也好、做事业也好、做生意也好、打天下也好、修哪样……成功的人，都是很老实地走路、学东西；不成功的人，都很聪明，都玩偷巧的。</p><p>所以，佛再三吩咐，“当更教系念”，老老实实“谛观右脚大指两节间。”刚才讲，比方这个大拇指只有两节，现在我是拿手来比，用不着把脚拖出来比，就是右脚的大趾头，这个两节之间——当然皮肉没有，只是白骨了。白骨脱开、分开，有三个指头那么宽，这样三个指头那么宽，不是这样叠起来啊，这样三个指头那么宽（师示）。</p><p>在印度，往往指头叠起来做尺度算的。三指头等于我们这个一节，所谓这个一节啊，譬如我们讲丹田，古人讲——这也是秘诀，我对于这些都公开讲，天下事情不要保留秘诀，保留秘诀把文化断绝了，我很反对那个保留传秘诀，没有秘诀，我听都不听。肚脐下面一寸三分叫丹田，什么寸做标准呢？汉朝、唐朝、宋朝、明朝、清朝、中华民国的，（乃至）英寸，个个不同啊，一寸三分；每个人身体大小、高矮也不同啊，一个高的那么高，一寸三分，你拿尺来量量，肚脐下面，同我们这个矮子的一寸三分，你说怎么办？小孩子的肚脐下面丹田一寸三分又在哪里呢？以这个为标准（师示），这个就是一寸三分的标准，这一节，两节之间，每个人不同，以自己的这个为标准。</p><p>所以，在印度的量法，肚脐下来四指为标准，差不多，差一点点。实际上是三指为标准，就是同中国这个一样了，（指）很紧的时候。所以说，这个骨节相离，就是拿我们中国老话，一寸三分，“三指许”。</p><p>那么，这个骨节脱开了，中间这个空闲“三指许”里充满了白光。那么白光……我们现代人修光——科学进步了，（对）修行有很多帮助哦，我们现在修白光很容易，古人很难，你观这个日光灯的光就是白光，中间是白光。这个白光连起来这两个节。</p><p>夜里打坐的时候啊，你想每一个骨节与骨节之间，（是）月亮的光色；白天打坐的时候——你修观的时候，不一定打坐修。每个骨节之间充满了太阳光色。</p><p>据我的经验，试验结果，可以治疗自己内部的癌症，乃至生什么病……你只要做内部的骨节之间的日光想，比烤钴60还好，什么病菌都杀掉了。</p><p>他告诉我们，夜里修的时候做月光想，白天修的时候做太阳光想，就是每个骨节里放这种光明。骨节跟骨节脱开了，这个空闲的地方就是光连起来。</p><p>“莫令解散”，这是重点哟，骨节骨节不要脱开了，中间有一节是光，不要解散。从头到脚三百六十节，节节解脱，每个骨节、骨节离开了，都有三指那么宽，这个三指中间是白光，中间都有光，骨节整个自己……</p><p>内脏都没有了，肉也没有了，至于说头发、指甲这些要不要保留？你爱漂亮你保留吧，不（爱）漂亮不保留也好，如果当和尚，把头发剃得光光的更好。</p><p>那么，骨节不要散了。再重复一句，就是你平常观想，站着也可以、走路也可以，要入定打坐的时候，白天打坐，用日光想这个光，夜里打坐用月光想。实际上，你现在要用电光想，超过太阳光一样的光能想，你观想得起来也可以。这个工夫修成了，每一个骨节自己晓得放光了，这叫白骨流光、放光。</p><p>你如果工夫修到这个程度，你站在太阳，或者在灯光之下，自然前面显影，看到佛了，看到佛像，所谓丈六金身，一丈六尺——什么为标准啊？就是比我们普通的肉体，由脚到头，两个身体半就是丈六。所谓一寻，就是我们人体的两手伸直，这样叫一寻（师示），每个人身体……。</p><p>实际上，现在科学也晓得，人体本来就放光，就是大家的肉眼看不到，这个光有多宽呢？就是同我们两个手伸着这么宽，光就是这样宽，高度也就是这样。</p><p>所以，“圆光一寻”，就是这个叫一寻。古代量衣服，古代的尺码，原始很老古代的时候，这样一寻，这个布拿到这里是半寻（师示），这就叫半寻。</p><p>所以，丈六金身，看到佛放光站在前面，“左右上下”都是圆的……。</p><p>我们人体本来有光，现在科学很多都在研究这个问题哟。所以，人体的光，你修定得道有眼通，一看这个人的光就清楚了。这个人坏念头、恶念很重，一身外面都是黑光；要倒霉的时候，灰的光就来了；着了魔、着了鬼，各种颜色光就看出来了。所以，善观气色的人，不但外面的光，脸上气色的光就看出来了，要不要倒霉了？要怎样……就是这个道理。人同万物，物体一样、物理一样，本来会放光的。</p><p>不过，我们普通……所以，每个宗教，你看，对于教主，耶稣也一样，都是画圆光，有道之士，自然他本身的光明就起来。</p><p>现在讲，我们自己修白骨流光的时候，你站在那里，对面呈现佛了，“丈六”金身，“圆光一寻”，“左右上下”一寻，全身都是“金色”。所以，我们念佛教的经典，“阿弥陀佛身金色，相好光明无等伦”，这个境界就呈现了，就摆出来；就看到这个佛，全身都是光色，光明照亮像火一样，像打火机那个火一样，光焰，什么叫做焰呢？这个光明活的，这个火光动的就叫做焰；火光死的，那就是没有焰。所以，“举身光明，焰赤端严”，那个火光的头上，光的头上，“赤”的颜色，紫色就是紫色的光。“相”，“三十二相，八十种好”，相貌庄严，“皆悉炳然”，你看得清清楚楚，自然就站在你前面。</p><p>等于活着释迦牟尼佛就站在你前面——看到了不要入魔啊！所谓走火入魔就在这种地方。</p><p>就是看到真的佛来了，释迦牟尼佛本人再现身到你前面来，阿弥陀佛……你不要理，“此时，慎莫作礼。”尤其你们女生们更容易，男生也差不多了，“哎呦，看到佛还不拜呀？这一下还不拜呀！”你一拜，嘿，你就变魔了，那个佛也变魔了。</p><p>佛又怎么了不起呀？！你就是佛，佛就是你呀！你的心就是佛嘛。所以这里吩咐你特别注意，“若见此时”，你到这个时候，“慎莫作礼”，你不要向佛磕头顶礼了，看到就看到，你还是做你的工夫。他说，不要顶礼，不要“哎呀，我见到佛了，成佛了……”那你着魔了。</p><p>那你怎么办？“但当安意，谛观诸法。”这个时候要参了，就是禅宗的道理。“当作是念”，你应该理解，“佛说诸法，无来无去。”《金刚经》“无所从来，亦无所去，故名如来。”“凡所有相，皆是虚妄，若见诸相非相，即见如来。”这个看到的佛像，就是释迦牟尼佛本身站在这里，他也不过是如来的化影而已，（是）本体化出来的。所以佛也说过，“若以色见我，以音声求我，是人行邪道，不能见如来。”这都是幻影，我们这个肉体也是个幻影而已，是用了几十年马上没有了，所以不要理这个。</p><p>所以，你要把佛经大乘的理，这个时候都要通了，《金刚经》一部你记住了，无来亦无去，“所谓如来者，即非如来，是名如来。”根本不理会。所以，真正的佛法是不迷信的，也同其他宗教讲的一样，不崇拜偶像的，你不要崇拜这个偶像。</p><p>说“无来无去，一切性相”本来是空的，这是我做工夫，观想的反影出来的，这个佛就是我，我就是佛，哪一个是真的？都不是真的。哪一个是假的？也都不是假的，反正一切是空相、幻像。</p><p>所以,真正的佛就是得解脱身、法身，无形无相，这个呈现像已经不是了，“凡所有相，皆是虚妄。”</p><p>“解脱身者，则是真如”，那是本体、法身，法身无形无相，无边际、无方所，一切不在，“真如法中，无见无得”，也没有影，也没有事。</p><p>所以，你这个观念一转，把理参通了，有时候前面这个佛就没有了，空了；或者，十方三世，上下左右，统统都是佛像呈现了，“当见一切诸佛。”见一切诸佛包围了你，你也不理，因为你也是佛，我也是佛，呵呵，不过……一切佛总排队，大家排在这里，我也在这里，没有……一切唯心所造，“心外无法。”</p><p>所以，真到了这个境界，就是禅宗祖师所谓讲，“通玄峰顶，不似人间，白云万里，满目青山。”心外无法！</p><p>那么，这个时候，“以见佛故，心意泰然”，你身心舒服到极点，心空了，意识境界上舒坦到极点，身心内外，有无比的快乐、快感发起来。</p><p>佛同阿难讲，你仔细要观，这个叫做白骨流光，“流光白骨”，白骨放光观。“慎莫忘失”，你不要忘记了这个修法。“尔时阿难，闻佛所说，欢喜奉行，得此观者，名为第十一白骨流光观竟。”第十一个层次。这个法子说完了。</p><p>现在，第十二观。等于连贯了上面的次序，很长了，比较长。如果一个人念不下来，可以分两个人念。希望大家看着书，自己仔细啊。</p><p><strong>【佛告阿难。得此观已。复当更教系心住意。谛观脊骨。于脊骨间。以定心力作一高台想。自观己身。如白玉人。结加趺坐。以白骨光。普照一切。作此观时。极使分明。坐此台已。如神通人。住须弥山顶。观见四方。无有障阂。自见故身。了了分明。见诸骨人。白如珂雪。行行相向。身体完具。无一缺落。满于三千大千世界。此名白光想成。</strong></p><p>次见纵骨。亦满三千大千世界。复见横骨。亦满三千大千世界。见青色骨人。行行相向。满三千大千世界。复见黑色骨人。行行相向。满三千大千世界。复见膀胀人。行行相向。满三千大千世界。复见脓癞人。复见脓血涂身人。满三千大千世界。复见烂坏举身虫出人。满三千大千世界。复见薄皮覆身人。满三千大千世界。复见皮骨相离人。满三千大千世界。复见赤如血色人。满三千大千世界。复见浊水色人。满三千大千世界。复见淤泥色人。满三千大千世界。复见白骨人。毛发爪齿共相连持。满三千大千世界。</p><p>次见三百六十三节解。唯角相拄。如此骨人。满三千大千世界。次见节节两向解离。相去三指许。间有白光人。满三千大千世界。次见散白骨人。唯有白光共相连持。满三千大千世界。如是当见众多白骨人。数不可说。</p><p>得此观时。当起想念。我此身者。从四大起。枝叶种子。乃至如是不净之甚。极可患厌。如此境界。从我心起。心想则成。不想不见。当知此想。是假观见。从虚妄见。属诸因缘。我今当观诸法因缘。</p><p>云何名诸法因缘。诸法因缘者。从四大起。四大者。地水火风。复当观是风大。从四方起。一一风大。犹如大蛇。各有四头。二上二下。众多耳中。皆出是风。此观成时。风变为火。一一毒蛇。吐诸火山。其山高峻。甚可怖畏。有诸夜叉。住火山中。动身吸火。毛孔出风。如是变状。遍满一室。满一室已。复满二室。满二室已。渐渐广大。满一由旬。满一由旬已。满二由旬。满二由旬已。满三由旬。满三由旬已。转复广大。满阎浮提。见诸夜叉。在火山中。吸火负山。毛孔出风。周慞驰走。遍阎浮提。复惊夜叉。以逼行者。</p><p>见此事时。心大惊怖。求易观法。易观法者。先观佛像。于诸火光端。各作一丈六佛像想。此想成时。火渐渐歇。变成莲华。众多火山。如真金聚。内外映彻。诸夜叉鬼。似白玉人。唯有风大。回旋宛转。吹诸莲华。无数化佛。住立空中。放大光明。如金刚山。是时诸风。静然不动。</p><p>时四毒蛇。口中吐水。其水五色。遍满一床。满一床已。复满二床。满二床已。次满三床。如是乃至遍满一室。满一室已。次满二室。满二室已。次满三室。如是乃至遍满十室。水满十室已。见五色水。色色之中各有白光。如颇梨幢。有十四重。节节皆空。白水涌出。停住空中。</p><p>此想成时。行者自见身内心中。有一毒龙。龙有六头。绕心七匝。二头吐水。二头吐火。二头吐石。耳中出风。身诸毛孔。各生九十九毒蛇。如是诸蛇。二上二下。诸龙吐水。从足下出。流入白水。如是渐渐满一由旬。皆见是事。满一由旬已。复满二由旬。满二由旬已。满三由旬。如是乃至满阎浮提。满阎浮提已。</p><p>是时毒龙。从脐而出。渐渐上向。入于眼中。从眼而出。住于顶上。尔时诸水中。有一大树。枝叶四布。遍覆一切。如此毒龙。不离己身。吐舌树上。是龙舌上。有八百鬼。或有鬼神。头上戴山。两手如蛇。两脚似狗。复有鬼神。头似龙头。举身毛孔。有百千眼。眼中火出。齿如刀山。宛转在地。</p><p>复有诸鬼。一一鬼形。有九十九头。各有九十九手。其头形状。极为丑恶。似狗野干。似狸似猫。似狐似鼠。是诸鬼颈。各负猕猴。是诸恶鬼。游戏水中。或有上树。腾跃跳掷。有夜叉鬼。头上火起。是诸猕猴。以水灭火。不能制止。遂使增长。如是猛火。从其水中。颇梨幢边。忽然炽盛。烧颇梨幢。如融真金。焰焰相次。绕身十匝。住行者上。如真金盖。有诸罗网。弥覆树上。此真金盖。足满三重。</p><p>尔时地下。忽然复有四大恶鬼。有百千耳。耳出水火。身毛孔中。雨诸微尘。口中吐风。充满世界。有八万四千诸罗刹鬼。双牙上出。高一由旬。身毛孔中。霹雳火起。如是众多。走戏水中。复有虎狼狮子。豺豹鸟兽。从火山出。游戏水中。见是事时。一一骨人。满娑婆界。各举右手。时诸罗刹。手执铁叉。擎诸骨人。积聚一处。尔时复有九色骨人。行行相次。来至行者所。如是众多。百千境界。不可具说。</p><p>佛告阿难。此想成时。名四大观。汝好受持。慎勿忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第十二地大观。火大观。风大观。水大观。亦名九十八使境界。】</p><p>这一段，大家看得、听得都很吃力啊，觉得这个佛法修持很好玩，都在那里说鬼话、说神话。其实，一点都不是神话、一点不是鬼话。</p><p>所以，你们大家诸位尽管是学佛、修道很多年，到处找些老师、修法，大致上，社会上就是这几套：学学打坐，然后传你一个什么窍，守着肚脐下面啊、或者守着海底啊，在那里搞呼吸，然后转风箱一样，把气冲上来哟……然后啊，任督脉打通啊……然后啊，哪里放光啊……再不然修瑜伽术啊、练气功啊……再不然念个咒子啊，一个咒子是三千块钱、五千块钱，越贵越好，那个咒子越灵啊……再不然念佛啊、敲木鱼啊、打鼓啊，吹吹打打……除了这一套以外，这个世界上还有别的吗？你们仔细想想看。</p><p>你们学过的……就像每个人（都有）很多秘密，每个人都拜了很多老师，然后，还有些老师在耳朵边上给你讲“不可以外露啊……”还赌了咒，“亲传此法，是天打雷劈哦，结果如何如何……”对不对？绝没有教你这样搞的，呵，所以佛好怪啊！没有鬼，叫你生出来鬼。</p><p>其实，真正的佛法——这是佛说的啊，他怎么教人这样修啊？这就是作意观，作意，五遍行的作意，自己造作起来的；本来意识上没有这个境界，五遍行的作意……作意、触、受、想、思，唯识上的五遍行。</p><p>你梦中也离不开的，死了，变成灵魂，这个心呈现的作用境界也有，作意，都是自己造的。一切业，善恶业，都是自己作意。</p><p>那么其实啊，大家都学密宗，你们这里也没有真学过密宗的。像密宗修气的，譬如瑜伽术修气的就更不同，那要精致得多，工夫切实得多。真修练气功，做到了宝瓶气，不呼亦不吸……你看《高僧传》，古代讲许多成就的人，坐在雪地里，大雪天，就是到北极天，脱光了不会冷，一身还冒火。那他的气功怎么观成的呢？这一念之间，呼吸已经做到了宝瓶气——当然，讲给你们听，你们又没有做过，我也没有教过你们。宝瓶气做到了，浑身十万个毛孔，每个毛孔观想一个六臂到八臂的金刚，全身都放火，向外面开张，都是火；观起来了以后，你衣服绝对穿不住，乃至到雪山里头打坐，这个四面一寻的地方，下了大雪都不能堆积起来，都化掉了。那么证明一个什么？一切唯心造，人心的力量有这样大，不过，要靠肉体锻炼。</p><p>现在，他叫我们做这个四大观，叫我们造这个……你看，假设我们大家不研究（就）不懂啊，这个书懒得看的。所以佛教里，把这个书已经埋没了一两千年，没有错啊，这个书……</p><p>所以，说佛法的修法就是这样，绝对不相信——这就是奥秘，所以叫禅秘，这是有的。</p><p>那么，你要晓得，后世道家的修法同瑜伽术啊、这里守丹田啊、观三脉四轮啊、三脉七轮啊、做这些工夫啊、做这个九节佛风啊，对不对呢？都还是次等的法子，这个佛法是更唯心所造，直接来的。</p><p>第一个，你要注意，前面十一观，你一步一步都做到了；做到了，已经相当成就了。老实讲，前面的十一观都做到了，虽然不证果，还没有得罗汉，还没有神通，差不多了啊，已经差不多了。到十二观很严重了哦，心能转物，把四大都转化了。</p><p>那么，他告诉我们怎样修法呢？“佛告阿难”，你看原经，“得此观已”，就是归上面一段，十一观那些程序你做到了，再进一步修，“系心住意，谛观脊骨”，背脊上，就是这个骨的这里（师示），背脊骨这个地方。道家，这个穴道……就是我们两个手平放，到后面……这样，胸口才是真正完全挺出来，这个地方，道家谓之夹脊，这两块背脊骨夹拢来……这个地方，咱们有医生在这里，学针灸的晓得，这个地方通前面的胃、肺上……。</p><p>人昏过去了、死过去了，这里是个穴道，一点，一般可以醒转来。所以在练武功也叫做还阳穴，这个人死掉了，在这里救转来，还到阳世间来，阳气……大家没有研究，不晓得这是什么道理，他现在叫我们先观这里。</p><p>所以你看，我们老了的时候，每个人都看出来了，背都勾起来，就是这个骨节阳气没有了，都……你看，那些老头子坐在那里，越来越变成虾子了，头那么翘翘着，老头子、老太太都这样（师示）。年轻人，身体壮的是这样。许多年轻人身体差的，你看他走路背都是弯的，都背个包袱的，都是圣人，什么圣人？老子讲，“圣人终日行而不离辎重”，背上都背一个重重的东西（众笑），所以，驼背，这样走路都是圣人。</p><p>他叫我们观着这里，注意白骨观这一部位，观这里这个部位——前面有个修法叫我们观这里（师示）吧？后来道家就点窍点这里了，都是这个法子脱出来的、变出来的。</p><p>观这里以后，背脊骨的白骨之间（原）是脱开、有光嘛，白骨流光。“定心”，你把它观想不是骨了，我们这个身体骨……这个之间（有）一个“高台”，就是佛坐着说法的那个高台。当然，你这里不要观成钢铁做的高台、什么做的高台，是你观起来的虚空中的一个高台。这个地方也就是正对心脏这一部位，背上这个骨节也正对前面心脏这个部位，也就是女性两个乳房之间，生命最重要的地方。</p><p>那么，空的是光，白骨，自己一个虚空的高台……。</p><p>“自观己身”，不管白骨了，作意我的身体，身“如白玉”，我的身体变成佛像一样，身如白玉，盘腿打坐，自己又有个身体——你要喜欢变婴儿，你就是婴儿，哈；你要喜欢变女的，你就想比观音菩萨还要漂亮，自己另外一个身体坐在这里高台上；如果你要想变男的就男的；你要变丑八怪，就来个金刚像，怒目獠牙，都可以。当然，庄严清净……在这个光里，自己的化身观起来，硬是清楚现前。等于我这个身里头，白骨这里……这是（讲）什么理由要在这里观起，心脏、背脊骨这里。</p><p>然后白光普照，自己放光，心中放光。</p><p>他说，特别一句话注意啊，“作此观时，极使分明”，要清清楚楚，不能含糊，你自己做到另外一个作意的观念，化身坐在这个高台虚空中，等于有得神通的人，站在须弥山顶，太空里头，看四方，毫无挂碍。定久了以后，眼通……，天下事，过去、未来差不多都知道了，就是自己观起来，都知道了。</p><p>那么，“自见故身，了了分明”，你定久了，这个骨节这里不是有个高台，你另外一个化身，完全是……你爱多年轻的……如果你要变成老子一样，白胡子老头也可以啊，这个化身由你喜欢了，个人业力不同、愿力不同。你要自己变成阿弥陀佛一样也可以，站在这个台上也可以。</p><p>这个时候，你自然会看见自己的肉体，“自见故身”，你把自己这个肉身看得很清楚了；乃至于说，比X光透视体内还清楚。自己身体内部的心肝脾肺，哪一部分好的、坏的，都看得清楚，有细菌、没有细菌都看得清楚。“自见故身”是“了了分明”，清楚得很。“自见故身”，就是你原来这个肉体，自己看得很清楚。那么，这是返照自己。</p><p>向外界照呢，看到一切白骨流光的这个“骨人”，白骨人，一排一排的“行行相向”，都面对着你，等于这个白骨人脸都转过来对着你。“身体完具，无一缺落”，一排一排都是白骨放光的人。乃至“满于三千大千世界”，都是这个白骨，一排一排，很多层次哦。</p><p>再看“纵骨”的，“亦满三千大千世界”，直的骨头。“横骨”，像肋骨这些是横骨，“亦满三千大千世界”。都是白骨人，直的、横的都清楚，充满了……这就是地大，这个世界就是这个物质变的。</p><p>那么，慢慢看到各种颜色的观起来，“青色骨人”也是一样，就是反正脓的、烂的，下面都有，就不讲它了。一层一层，都“满三千大千世界。”</p><p>乃至看到许多的白骨人，白骨流光的，一节一节也“满三千大千世界”。下面不需要多讲了。</p><p>然后进一步，要变化了这个物质世界同这个肉体，这个修持是什么呢？就是修报身。真修持到了，这个肉身体——说一句严重的话，也可以修到这个肉身不死；也可以修到这个报身马上起变化，所谓三十二相，八十种好。这个里头很多秘密的法子。</p><p>原理他都说了，要大家去研究，自己去研究，有智慧研究；再没有智慧，赶快去找修成功的老师，经验……告诉怎么去修。</p><p>那么下面，所谓这些鬼呀、神啊，是什么呢？变化观出来的，就是我们肉体上地水火风的变化。你看他描写的：这个鬼恶言、恶状的，很难看，那个鬼又脏、又臭、又坏。我们肉体上的每一个细胞、每一个血液都很坏哦，什么毒龙啊，什么的……</p><p>所以，道家后来叫做“降龙伏虎”。什么是龙呢？道家所谓讲龙，也同白骨观（传来）这个时候出来的。龙是什么？龙是念头；虎是什么？虎是气。还有一个代表，龙，血是龙，身上的血是龙；气是虎。所以，男女性欲冲动啊，在修道的人说“你这两天搞得怎么样？”“哎呦，老虎要下山吃人哦，怎么样降虎啊！”降虎啊，就是把这个欲念，性冲动的欲念要降下。龙是什么呢？龙就是思想杂念，变化无常，像一条龙，所以要降龙伏虎。这个毒蛇啊、龙虎啊、四大啊、夜叉啊，就是讲生理上的地水火风，每个细胞、每个血液的变化，要用唯心的作用、思想，统统把它观化了！</p><p>所以，他也明告诉你，这些豺狼虎豹、毒蛇猛兽都是代表我们生理上的、身体上的各种各样的坏东西——好坏没有标准的，一个白血球、红血球，不生病的时候是好东西哟，一生病了，它有时变成坏东西了，就是这个道理。</p><p>那么，把这些一切的变化都观遍了，就是你的工夫做到了，统统把整个的肉体、这个身体，连血液一切四大地水火风，都把它变化完了——然后，下面注意啊，这一观，很大的第十二步工夫，到九十八结使的境界，就是八十八结使。我们有张表发给大家了，三界里的八十八结使。</p><p>所以，我们有许多人，看到大家也很值得原谅，很多人脾气很坏、个性很坏、心理很歪曲的，为什么呢？他也在学佛、也想改，自己也晓得坏，毛病多，（但是）在那里改不了。就是（因为）你有肉体存在，有这个生命，生命上面这些唯物的变化控制了你的心理、精神的生命。所以，你心理要解脱、要慈悲，慈悲不起来，你这个身就是坏蛋的身，坏极了，都是业力的身，要把这个唯物的色身转掉，才把八十八结使，贪嗔痴慢疑才能解脱，这是真实的工夫，不是理论。</p><p>所以，学佛学了半天，八十八结使啊、《百法明门论》啊，什么叫根本烦恼、什么叫随烦恼，理论你都懂了，烦恼怎么去掉啊？工夫不到就去不掉。这个工夫从哪里来？非从色身，这个肉体身上先做起，那才能够去掉、才能证果。</p><p>你以为，“哎哟，我悟到道理，一切皆空了……说来说去没有什么，我只要坦然清净，自然而住……”你坦然清净，你掉到那个粪坑里去了，哎呀！自己不知道，以为自己还高明的很呢！不是的，非要把色身转化过来不可。</p><p>所以，这是十二步的工夫观法，把前面一串，由白骨观起，十一步的次序，整个的连起来了。所以，每一层工夫都要切实做到。</p><p>那么，有许多修道家的人、修密宗的人，你注意，你修各种窍、修各种气脉，现在明白告诉你：不如做这里的观。年纪大一点，下一点，从命门、从腰骨这里观起，身体慢慢会强壮起来。</p><p>不过，重要啊！在腰骨这里观起，男女都同前面守丹田一样的可怕，从腰骨这里观起，等你这个精气神身体充满一反应，第一个给你的障碍，就是那个老虎要下山吃人了，你如何要（有）降龙伏虎的本事，就是性的观念就冲动起来了。</p><p>所以修行很难啊！阳气生命能真正发动，生命能一充沛了，欲念，尤其男女两性需要的欲念就冲动了。那么，你说把这个发泄了以后呢，平静了，生命能就进入死亡、昏沉的状态，那当然没有事了。那么你只好再修了。等到你修得刚刚一起步了，它那个东西又来了，所谓降龙伏虎之难……</p><p>龙啊，心念变化不定，像一条龙，怎么样使它清净，难！第二个，生命上这股气化，变化一来，它就来了。所以大家永远过不了这一关。欲念这一关，在道家后来变成叫做两界关。两界，等于一个跳板，翻不过去，堕落，下地狱；翻的过去，上、升华。这个关没有固定，松的，所以这个难。大家修行，搞了一辈子，第一关过不了。</p><p>尤其守这里，效果是很快，可是很难。</p><p>现在，《禅秘要法》佛说的这一点秘密，我再给你们补充：假定你修夹脊这一关来，比较好；不过你用道家的方法光守，守在那里干什么？把骨头守着，还守得住啊，最后还是要死，要观化！</p><p>后来道家呢……这是魏晋以后就翻译（过）来了，后来道家拿这个法门，支离破碎传传，传到外面，变成道家的各种修法，所以，都是佛家的，都是抓了一点，抓了一个法门当成秘诀，就去当祖师爷，传给这个、传给那个，结果都没有修成。守哪个窍才对、哪个法子才对——都是空事！它是一连串一起来的，光守着窍，守着肉体的这个尸骨有什么用啊？！要把它观化！再进入变化！</p><p>今天，我们先到这里为止。（起立！）好，谢谢谢谢！</p></div>"
},{
    "title": "禅秘要法讲座 11",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 现在，有几个重要的问题。第一个，有问：譬如做白骨观，即《禅秘要法》的观法，很多地方提到看到骨人，行行，就是一排一排，一排一排的相向，乃至很多地方提到身上有什么龙啊，地下出龙啊、水啊等等，觉得很复杂，为什么要观想这个？所谓观想，想跟念在修持方法，（是）渐修的方法。我们这个想与思，譬如五遍行——五遍行再提啊，大家应该很熟，恐怕有些人不熟。就是作意、触、受、想、思，这在佛法里（属）心（所）法，就是《百法明门论》里属于五遍行。所谓遍行，八识——把这个心分成八个情况，哪个地方它都存在，连睡梦中、连死掉变成中阴，它都起作用；除非成佛转化，那五遍行变成五方佛圣。所以，它无所不在。</p><p> 我们有时候静坐，觉得自己没有思想，那个正是思想，那是什么呢？没有粗的妄想，是五遍行第五个思，这个就是思，思跟想情况不同，那是思的阶段。所以，思和想差别非常大，而真正的界限非常微细，要了解。</p><p> 那么，为什么讲观想呢？你能够把自己的念，自己能够做得了主，这个念就包括了这五遍行，能够把它随时转化，才能够转业力，转烦恼为菩提，才能够转识成智。不然都是空洞的理论，空洞的理论抵不住事的。同时，使我们认识，在修持的过程中，有时候，你碰到这些境界，你不观想，不思它，它自然出现。所以，往往有许多人照普通小说上写的“走火入魔”，入了魔境，被吓着了。</p><p> 实际上，你懂了这许多观法的理，你晓得各种的境界，欢乐的、恐怖的、乃至毒蛇猛兽、水火沸腾等等，都是我们自性的阿赖耶识种子识在变，自己的变化；甚至于放光，甚至于身上各种的感受，舒服与不舒服，也都是自性一心的种子变化，要认识清楚这个。所以，佛给我们很详细地说明。</p><p> 第二点，我们大家都晓得一切唯心，真正的佛法是一切唯心的，这个心是心物一元之心。你把这个心呀……说“明心见性”，我们晓得善、恶、无记，一切的起心动念差别法门，都是这个心造的，既然是这个心造，我们心为什么只能造业啊？只能贪嗔痴慢疑很熟练地去做，把它转化过来你就转化不了啊，转化善业不是心造吗？你就造不起来，始终被恶业牵走。</p><p> 所以，要你做这些观想，心物一元的，把它整个的改变过来，那么，才能够真正心能转物，《楞严经》所讲，“心能转物即同如来。”不然，你空洞的理论抵不住实际的事的，没有用；自欺可以，不自欺，你过不了关的。</p><p> 再说，我们身上所谓白骨的分化，自己一个人白骨禅观修成了，为什么观第二、观第三，乃至观三千大千世界充满其中，都是白骨人，行行相向，一排一排地对着你，等等？大家觉得这个很神话似的，很好玩……大家有没有想到，我们的身上，本来有无数的生命，我们现在的身体，也对你是行行相向，本来充满的。</p><p> 譬如身上，我不是再三提过，根据生理医学，一个人排泄精虫，一次有六万到十二万之间。那么，假设六万、十二万都碰到一个对象，碰到一个女性的卵藏，那一次都可以生十万二十万个人，这就是生命的分化。因为没有作用，没有碰到对象，因缘不凑合，所以没有生人；可是在你身上，本身上，你具备着这个有，本来有，此其一。</p><p> 第二，我们身上所有的细胞，在整个的肉体没有死亡以前，它是一个整个的生命，单独的每一个细胞、每一个荷尔蒙等等，单独分析起来，它个个各各有各各的份子、各各的生命。所以，学过医的都知道，我们割一块肉，或者抽一点血液，或者拿一点蛋白下来，在化验的时候保温得好，它单独在那里还活着的。</p><p> 所以，千百万亿化身怎么修成呢？你先把白骨观观想的，由我自己观成分化一切，然后一念之间，修成了千百万亿化身同时俱来，（这）是色身的转变、业力的转变，转识成智的当然道理。所以，并不是神话，（是）讲修持的方法，非常实际的。这是第一问题，引出那么多话。</p><p> 还有，我们在座有些年纪大的道友、同学们，有些曾经学过佛，或者略有一点门径的，看到一点影子的，自性看到一点影子的，告诉你哦，赶快努力修持哦！《楞严经》的话千万记得哦！“理须（则）顿悟”，顿悟是理上的悟，达摩祖师所讲的“理入”，道理是那么样子，你（若）定不住——定不住，那个理的境界不能呈现，那就是干慧，干的种子不能结果的。所以《楞严经》说“理须（则）顿悟，乘悟并销”，你真悟到了，你把一切九十九结使、一切烦恼立刻转成菩提，消了一切业力，转识成智，那才可以，你能做到“乘悟并销”吗？不能，那这四个字怎么说法呢？“理须（则）顿悟”，理你虽然悟到了，“乘悟并销”，一悟了以后，悟过了对事对不住——那个理也等于没有用，消掉了、取消了，有什么用啊！？</p><p> 因此说，懂了这一点，晃到了这一点的人，赶快努力修持哦！回转来，走基本的路线，尤其真是理解透了，修基本的方法，修起来应该更快啊，为什么观不起来！？那就可见，你那个理悟得都没有对，这不是很明显一个证明嘛。所以，年纪大的朋友注意啊！</p><p> 所以说“事非顿除”，照工夫程序——空也好、你悟到的什么也好，这个事实要证明，境界要证到的话，必须一步一步做工夫来，“因次第尽”，一点一点来。</p><p> 所以，《楞严经》告诉你，修持、修证求解脱的法门是五阴解脱。五阴的第一是色阴境界解脱，四大，我们的身体是属于色阴境界。《楞严经》上有修色阴境界解脱，初步进入那个情况（是）怎么样？真得色阴解脱(是)怎么样？那么中间，在修持当中，色阴境界发生十种魔境，非常大的，你过不了关的。所以《楞严经》有五十种阴魔，就是五阴里头各有十种归类的大魔，大魔境界，你过不了。</p><p> 色阴境界就是四大、这个色身解脱了，是受阴境界，第二步就是受阴境界的解脱，感受、感觉，生理的感受、心理的感受。那么，由色阴境界解脱到受阴境界解脱，证入的初步情况是怎么样？最后解脱了是怎么样？《楞严经》交待得清清楚楚啊，只是你们自己没有去研究、没有看懂，佛都把方法交待清楚了。所以，叫“事非顿除，因次第尽”，你第一步必须先把色阴解脱了。</p><p> 悟道，那悟的理有什么用啊，你说：“我打起坐来清清静静……。”清清静静很简单嘛，因为你现在活着，又无病痛，所以坐在那里清清静静；假设你内部哪个地方有病，你清净去啊，你清净得了才有鬼呢！那我叫你爸爸、我叫你老祖宗，你会清净得了？！</p><p> 你们年轻人怎么参加听这个啊？白骨观一点影子都没有，什么都来听，要做到哦。</p><p> 所以，这个不是空洞的话。身体好，没有病，觉得有一点点清净境界，那个清净境界是因为你身体绝对健康，所以嘛，静下来就有这个反应，这个有什么稀奇，这何必学佛呢，学普通心理学懂了也做得到嘛，总是心理放平静。</p><p> 至于说有些修道、修密宗，身上守一个窍、守一个部位，马上有反应，那有什么稀奇啊，那一点都不稀奇！你叫不要修道的人，把他眼睛闭着闷在那里，闷三四个钟头，他心里还要跳起来，感觉受不了，那是生理本能的反应，都不稀奇，不要认为那个是道啊！等到你病了、老死来了以后，你看你能够清净吗，还能够气脉动吗？！所以不要瞎扯啊！不要自欺啊！赶紧修持啊！</p><p> 所以白骨观，佛告诉你一层一层的解脱、一层一层的修证，是这个道理。这是答复第二个问题。</p><p> 现在……还有写信来的哦，还有问题：观白骨不可用意识去想它，而应该用独影意识去观它，其方法是否在不思不想中自然浮现出来之对象？这个问题，我好像讲过好多次，很多人也类似地问过很多次，在这里也答复了很多次，刚才也提到……。</p><p> 观想，想就是想，不思不想你怎么观起来？不思不想的影像，你说是独影意识——独影意识那个境界就是思，也就是想；重一点就是想，轻一点就是思。</p><p> 观想，你形容它是在不思不想中自然浮现出来，那倒是真的，如果到这个境界，是观想的这个想比较入港了、比较入门。但是，自然浮现出来的不得力，只是一个影像而已，不会到身上来。所以，功夫不到身上来，也就是《瑜伽师地论》所讲、佛经说的“不以身证”，那不算数的。那只能是止观——你这个自然浮现的不思不想的影像，——初步奢摩他止观的第一影象而已。</p><p> 但是，这个浮现出来的影像，你能不能定得住呢？假设这个影象定住不动了，如如不动，就是这个影像，也忘身忘我了，久而久之，这个算是正观想了，正观，那会到身上来了。那你观身体内在的白骨，乃至观到了家，五脏六腑、每一节白骨，自己看得清清楚楚，自己开眼闭眼看自己身体内部，看得清清楚楚，是这个道理。</p><p> 第二问：如一所言为是，上面讲的对……未能现白骨全身，而只能观到肋骨这里的时候，应如何处理？你是说，自然影像只能到这里，要如何处理？你只要把这里定住，多观久了以后——因为你下面业气不通，就是下部的业力很重，等到上部清明观久了以后，突然之间，一下通了，心物一元的，身上的业气消了，善业的气、道气来了，自然下面一下就观想呈现了。</p><p> 就是上面白骨观给你讲过的，就是佛说过的，观不起来，或者是观到黑骨头，或者什么——赶快忏悔！所以，忏悔是佛法第一法门！不修忏悔永远不行。不修忏悔就是你对了，觉得自己对了的人才不忏悔；你对了，你去你的，那很简单。换句话，不修忏悔是不认错，错都不认的人，还谈什么啊。那你对了，何必跟佛学呢，你就是佛，你去吧，你去生你的国土去吧。所以忏悔第一。</p><p> 一个人的忏悔心发不起来，已经作废了！没有用，这个人永远不认错的，不知反省的，有什么用啊。所以，这个地方要忏悔。</p><p> 第三个问：如果观的白骨观现全身了，观照自己身体的时候，是否程序（还）从左脚的半节观起，或者可以直接观全身？如果可以，其要法又如何？这个问题谈了两节，我先答复你第一节。如果这个人修成了，全身都观起，第二座再修的时候，是不是从左脚趾头观起？不要问我，问你自己。比方讲我，我也可以不修白骨观，也可以不修这个……但是，每当我真要修法，或者真要如何，我绝对老老实实从基础做起，我一辈子做事是如此。</p><p> （譬如说）学毛笔字吧，我真的乱七八糟乱写。你要真叫我学毛笔字，我还是在小学、幼年被老师把着手拿笔的那个时候的精神来写字，绝不马虎。我始终觉得，写字始终还是在那个阶段，没有觉得自己长大；写文章也一样、读书一样、做学问也一样。因此，我学什么东西比大家学得精、比大家学得到家，因为我始终没有认为自己是有一点进步，就是第一天学的那个笨样子，我以后（任何）时候还是那个样子。也许我能够比大家有点成就（的原因）在此。</p><p> 我发现一般人不是（这样），说懂了一点文章也好——尤其他们青年人，写字也好、做什么也好，刚刚懂一点啊，哎呀，爬都不会爬，他已经觉得自己会飞了。所以，我看了几十年的青年，没有一个成功的。</p><p> 你像我，现在是白发苍苍，几十年读书也好、做什么也好，只要拿到这个事情要做，未有不敬其事、不恭敬其事，还是当自己在刚开始学的时候一样的。而且自己没有满意过，认为自己对了的。</p><p> 我发现很多青年人，都觉得自己对得不得了！对呀，当然对，你鼻子本来对着嘴，不过鼻子有点歪，不大对，有什么用？！</p><p> 所以，这位道友所问的问题，我是连带地告诉大家，他提得很好。即使白骨观起来，你再观一下脚趾头开始，很简单嘛，那就很快过去了，因为你很熟练了，没有妨碍的，只有好处。一条老路多走一万遍，更熟嘛，而走的更快，对不对？熟能生巧，巧妙就出来更多了。</p><p> 说直接观全身，它的要法又如何？我不答复你，因为后面还多，后面佛会提出来，告诉你直接观……。</p><p> 还有：如腿有毛病，例如风湿，或其它毛病等等，是否是依照《禅秘要法》所示之程序为途，或者是可以直接观全身？腿有毛病的，不一定了——你还是照规矩来，脚趾头观不起来，更要观。等到……譬如说你腿有风湿、麻痹，甚至于开刀砍断了，乃至于我这个腿砍断了，假设有一个人这一只腿残疾了，你最好还是假观脚趾头起，那真是……如果你至诚到了，算不定（被）砍断的腿还长出一个腿来呢。哦，你不要当笑话听哦，否则佛法就不可以证明了。那是要功德到，要诚信，绝对的信到；不然，佛经都骗人的，骗人的东西我们何必学啊。</p><p> 所以是这样，就是说假设你有风湿，观不起来，你更要观，等到你脚趾头……有风湿的两腿，乃至麻痹了，躺在那里都不能动，趾头、脚、腿，被你观起来了，你那个病就快要好了，而且非把这个病观好不可！那等于就是说，用太阳光、太阳能，用钴60自己来返照自己，非把它照好了不可。乃至内脏、肝脏有病，哪一脏有病，都可以作如是的观法，还是照《禅秘要法》的观最好。</p><p> 不过，你说像腿有病，有风湿病，是不是可以直接观全身呢？可以呀，那个全身当然包括你的两个腿嘛，你既然全身可以观得起来，你两个腿当然观起来了。这个问题？自己要多想一想。腿有病的，腿观起来更好……。</p><p> 为什么在这之前，佛都叫你从左边大趾头观起？有些法子（是）叫你从右边大趾头观起，这里头是什么问题？道理多得很，很多医学上问题、很多物理自然的问题……到后半部，有时候不一定叫你从腿观起，就是看你工夫的程度了，听下去就知道了。</p><p> 还有：打坐的时候，手掌、脚掌还是冰冷的，那是你的阳气还没有发动。拿佛法来讲，水大，地水火风的水大冻结在那。这样的人，多半个性是内向的，思想、用心比较深的人容易这样，要注意，个性比较内向的。</p><p> 换句话说，气分，气血的这个气，气分比较弱，阳气不够。阳气够，真阳气一来，就是纯阳之体，那就不同，全身发暖。那么，手脚自然都充满，这十个指头——你看人老了，十个指头就瘪了，都有皱，同脸上一样都打皱了。你看婴儿的十个指头，鼓槌一样的充满。你到了这十个指头都充满了，自然就转阳气来了。</p><p> 我们现在再继续第二卷，第一卷讲完了，第一卷讲完了嘛？……第十二观讲完了，上一次讲完了嘛，讲到九十八结使的境界，这句话我还记得，九十八结使境界如此解脱。</p><p> <strong>【佛告阿难。此想成已。复当更教系念住意。谛观腰中脊骨。想诸脊骨。白如珂雪。见脊骨已。见举身骨。节节相拄。转复明净。白如颇梨。见一一骨支节。大小一一皆明。如颇梨镜。火大风水地大。是诸境界。皆于一节中现。</strong></p><p> 此想成时。见下方地。从于床下。渐渐就开。见一床下地已。复见二床下地。见二床下地已。复见三床下地。见三床下地已。渐见一室内。见一室内已。次见二室内。见二室内已。渐见三室内。见三室内已。复见一庭中地。渐渐就开。见此事时。应当谛观。乃至下方。无有障阂。下方风轮中。有诸风起。向诸夜叉。皆吸此风。吸此风已。身诸毛孔。生鸠槃荼。一一鸠槃荼。吐诸山火。满大千世界。是诸山间。忽然复有无量妙女。鼓乐弦歌。至行者前。罗刹复来争取食之。</p><p> 行者见已。极大惊怖。不自胜持。出定之时。恒患心痛。顶骨欲破。摄心入定如前。悉见四大境界。见此境界已。四大定力故。自见身体。白如玉人。节节上火起。节节下水流。耳中风出。眼中雨石。见此事已。于其前地。有十蚖蛇。其身长大。五百由旬。有千二百足。足似毒龙。身出水火。宛转于地。此想成时。但当至心忏悔先罪。出定之时。不得多语。于寂静处。一心系念。唯除食时。复当忏悔。服诸酥药。然后方当易此观法。</p><p> 佛告阿难。此观名为第二四大观。汝好受持。慎勿忘失。尔时阿难。闻佛所说。欢喜奉行。此想成时。名第十三结使根本观竟。】</p><p> 讲到第十二个方法，也等于第十二层的方法。叫我们先是观想背脊骨这一节，夹脊骨那一节开始。这属于解脱四大，就是身体地水火风，转化这个四大。</p><p> 现在也是转化四大，第二个方法，叫我们先观腰，腰里头的骨节，（从）腰起到背脊骨。</p><p> 所以后来，等于这个佛经、佛法来了以后，魏晋南北朝，也有道家传守丹田、守这里、守眉间，乃至同瑜伽术的各种修法，都是这里脱出来的、分解出来的。也有道家专传守命门，就是背脊骨这个方法。</p><p> 但是，背脊骨有一点啊，前面十二步工夫没有做到的女性、还有男性犯有遗精病痛的男性，不要随便观——有两个可能，有时候青年遗精病，观背脊骨，连带观反转来做（上面）所讲的观夹脊，也许遗精病（会）治好；如果女性或男性身体过分弱的，一上来，（就）观腰脊骨的这个白骨观，反而容易遗精、容易崩漏，譬如月经加多了等等。当然，你整个白骨观观起来了，已经没有问题了，就是讲，初步不可以这样！</p><p> 佛在这里告诉我们，前面的十二个方法层次到了，到这里腰中的脊骨，就是腰骨。那么，观想这个腰骨“白如珂雪”，雪白，很干净，乃至白如白玉一样都好，要透明。你真的看到了自己的背脊骨了，一步一步，再内观全身的骨节，每一节每一节相对，每一节每一节、一节一节干净，白如玻璃，透明。见到每一个骨节，小骨节都看得很清楚，清楚到什么程度呢？你注意啊，如玻璃镜，透视的镜子，看得很清楚。</p><p> 那么这个时候，火大、风大、水大、地大一切的境界，在每一个骨节、小骨节上就呈现出来，任何一个骨节里都有地水火风，怎么讲法？譬如任何一个小骨节拿来，磨成粉，把它打碎磨成粉，那是地大；它也可以燃烧，所以它有火大在内；它也可以变成浆，有水大在内；它也可以化成空，有风大在内。所以，这个物理四大的身体，物理的道理要研究《楞严经》，佛在第四节所讲的“性水真空，性空真水”种种的道理。</p><p> 这个观想成功的时候，你自己到达……这个背脊骨起，一身都变成透明体了，骨节琉璃，那比这个标本还要漂亮了。</p><p> 所以，我们有一位道友前天跟我讲，“哎，老师啊，我已经观起白骨了，而且白的……哎呀，我现在对白骨好可爱啊！”我说：呵，你小心啊，这一念爱欲之心，就很严重了，白骨观起，反而不能得解脱了。所以，赶紧就要易观，就要调方法了。</p><p> 所以你看，佛告诉我们修持的方法，每次到重要关头——易观，赶快要调。</p><p> 这个时候，你观起来的时候，“白如珂雪”，是很可爱。那么，你就看到自己的床下……</p><p> 你要晓得，我们中国人没有床哦，这是南北朝的时候传过来的才有床，椅子这些，古代书上所谓称作胡床，胡床就是椅子、床。我们中国的古代就是日本的……就是我们中国的古代，席地而坐，坐也在地下，睡也……铺席子。这个椅子、床铺是外国文化、西域文化传过来的。所以，南北朝魏晋的时候才有胡床，这个床还叫胡床。</p><p> 胡萝卜也是外国传进来的，胡琴、胡椒都是外国来的，有个“胡”字，现在是有个“洋”字，那个时候有个“胡”字，再不然有个“蕃”字，番茄、洋番薯都是外国传进来的。</p><p> 所以这个床，就是说你的座位底下，你是坐在……打开了，地大裂开了，看这个地上，一路看到底。慢慢扩大，一床地、两床地，等于一平地、两平地、三平地，一直一下……等于说一个房子的地下都看通了，好像裂开一样看通了，看透了这个地球。那么，这个时候你就是把这个地球啊……自己由身体白玻璃、玻璃镜一样透明观起，忽然向下方一看，整个的地球看通了。这还不是天眼通哦，是天眼的一种。那么，就看到下方世界，地球看通了。</p><p> 就是说，以我们坐在这里为标准，下方的世界，“风轮”就是空气，地球的外壳就是大气层，所谓风轮就是看到大气层，看到地球、地心中间大气层起来。</p><p> 当你到达这个境界，你定中往往看到鬼了，看到夜叉——夜叉讲过了，是一种非人，同人类两样的，归到鬼道、阿修罗道之间的。男性夜叉都很凶的，女性夜叉很漂亮。</p><p> “诸夜叉,皆吸此风”,就是我们中国人讲的“呼风唤雨”。有一种生命只吃气的，这种生命吸气。“吸此风已，身诸毛孔生鸠槃荼”，看到那个鬼，男性的鬼属于夜叉鬼，气一进去了以后，他的本身毛孔里头化女鬼，这个女鬼鸠槃荼……</p><p> 鸠槃荼，我们中国文学形容很丑陋的女人，或者很丑陋的老太太，叫“鸠槃荼”。不然，“鸠槃荼”是很漂亮的女人，美女。</p><p> 男性的夜叉吃进去风以后，毛孔里生出来这个女性……那么，这个女性的“鸠槃荼”嘴里又吐出来“山火”，一个一个火力吐出来，而且象山一样的一股一股火力出来，充满了整个的三千大千世界——你说，这不是神话吗？你们写科学幻想小说，这里资料多得很，这不是幻想？那么，你以为是幻想，（其实是）真的，他是讲这个地球的生命活动的形成，我们身体上也是一样哦，要知道，我们现在的肉体就一样哦。</p><p> 所以，为什么道家、密宗、瑜伽术守丹田、守海底呢？因为我们真正生命的来源（在）下方，就是肚脐下面海底这个地方，这个地方的气最重要。所以，这个气充满了以后，等气充满了，阳气回转来，精神一好了，欲念的心来了，男性就会想到女性，女性就会想到男性，欲火就来了。我们的身体也是这样，这个地球生命也是这样。所以，你不要……你多研究就看懂了。</p><p> 那么，为什么佛不照我们这样讲呢？为什么（讲）夜叉什么的？唉，可是你在打坐的境界、修定的境界，硬是呈现这个东西。你说，为什么人打坐好好的时候看到恶鬼？哎呀，我们何必对自己太客气啊！我们有几种心理思想……每个人关起门来的时候，有时候打人家的主意，想赚人家的钱、想害人家，那个心理比恶鬼的面孔还难看！知不知道？我们本身就是饿鬼，以为自己还了不起啊！？</p><p> 所以，在自己这个正定的境界，自己的另一层面目就出来了！就是这个道理。</p><p> 那么，然后再观想这个女性所吐的火山里头，有无数的——嘿，坏里有好，烦恼中有菩提，菩提中有烦恼哦——“妙女”啊，“鼓乐弦歌，至行者前。”</p><p> 所以，释迦牟尼佛在菩提树下快要成道以前，就遭遇这个境界，那些女的裸体向他前面跳舞，各种各样姿势摆布他。释迦牟尼佛一看，动都不想动；也是看啊，看了毫不相干，这个魔就起不来作用了。</p><p> 其实，那个哪里来的？也就是你本身的……换句话，这所有的境界，都是我们修行人做工夫时，自己本身业识种子所呈现的一个现象。</p><p> 那么，看到这些女的来要吃我们……你注意哟，上面是恶鬼出来，恶鬼身上又出来女性，女性出来火山，火山里头又冒发了，欲火里头又冒发了最漂亮的女的，最漂亮的“妙女”来了，到要吃你肉的时候，来到你前面很漂亮，而且很好听哦，“鼓乐弦歌，至行者前”，“行者”就是你修行人、本人了，到你前面来，嗨，罗刹这里抢吃了，就吃掉你。</p><p> 所以你想，我们这一生，不要说修道，一生失败的时候、被人家骗的时候，乃至于说交男朋友、交女朋友的时候，就是那么漂亮的罗刹来，慢慢把你吃掉的，是这样，对不对？！你看佛经讲得多好！</p><p> 你们出家人，并不是没有被他吃掉啊，你们出家人还没有到啊，呵，到那个时候照样来——这一生不到，来生来吃你啊，唐僧的肉更好吃啊。</p><p> 所以，修行人见到这个境界的时候，“极大惊怖”，你非怕不可！硬是看到……在定中有时候定得好好的，这个境界一来，硬是张开嘴就把你头吞下去的那样。这个时候（要）真定力。往往起“大惊怖”入魔，“不自胜持”，这四个字注意哦，定力不高的人到这个境界，你自己克服不了，不能保持不惊、不怖、不怕……</p><p> 这一害怕，出定的时候“心痛”，硬是这里会痛。要注意，佛把禅病都告诉你，这叫“禅病”。你有恐怖心，“出定之时，恒患心痛，顶骨欲破”，头痛，哪里头痛？不是太阳穴，头顶这里痛，痛得头都要裂了一样，怎么医治它呢？这不是药（能）吃好的，赶紧再打坐、再入定，“摄心入定如前”，像前面一样。</p><p> 你要见到“四大境界”，就是了这个色身，“见此境界已，四大定力故，自见身体，白如玉人”，更漂亮！你要把自己地水火风这个道理参透，内在返照形躯，内在身体看得清清楚楚。那么，你自己见到身体一节一节的骨节，白的像个玉人，那真是玉人，美极了！</p><p> 所以，修成功了，功德圆满，三十二相，八十种好，菩萨庄严自然出来。所以，佛经所讲的菩萨庄严（是）真庄严啊！</p><p> 不像我们，每一个人坐在这里，不是大个肚子，就是瘪得丑吧啦的，打起坐来一脸讨债的相……那么挂起，多难看！</p><p> 到这个时候，“白如玉人”。不但是白如玉人，你在定境界里旁边一看，不是小说上写的一脸光滑，“面如冠玉”，身体都变成玉了，什么玉啊？润泽，皮肤都润了，像块润玉一样，自然就工夫到了，“白如玉人”。</p><p> “节节上火起”，但是，玉人还不是到家哦，不过到这个时候，你觉得每个骨节里化掉，每一个骨节上部分火起来，变成火；下部分变成水，流出来。</p><p> 所以佛经上说，大阿罗汉入涅槃的时候，踊身虚空现十八变，十八变就包括上身出火、下身出水，同时来的。实际上，我们生命的本身本有地水火风，就把这个本能引发。</p><p> 所以这个时候，再慢慢的“耳中风出”，耳根里头……慢慢有时候，你们打坐坐好了的时候，也知道气到耳朵里，耳朵一下搞得不对就耳聋了；搞到眼睛里头，气走到眼睛里，眼睛不对就瞎了。这一念动走错了路就瞎。所以，气到了耳朵，修持到了耳朵，耳朵风有时候闷住了，也是风动；再不然呢，就是听到“嘘……”很遥远的太空的音声，“嘘……”，你都听得见。实际上，也就是你自己本身“耳中风出。”</p><p> “眼中雨石”，打坐修定到某一种程度，坐在那里眼泪直掉的，眼泪掉下来（是）又酸又苦啊。然后有时候觉得眼里一块一块东西滚下来，都是内在的东西赶出来了。都是真实的事，做工夫一步一步真实的事。</p><p> 我们先休息一下。</p><p> 好好用功啊！尤其是老朋友们啊！好好用功啊，不是开玩笑的啊！你们平常这一点点打坐，有一点定境界，哎呀，身上这里感觉，以为气脉通了，有什么用啊！</p></div>"
},{
    "title": "禅秘要法讲座 12",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 现在讲到到这个程度,在这个境界里头，可能会发生几种境界——你注意这一段书，佛说的这一段经典告诉我们的方法，并没有叫我们去想，有时候它就呈现，自然呈现那些境界，所以并不是叫你去想。</p><p> “见此事已”，碰到这种情况，还有一个境界会来了：你正在定当中，不一定开眼或者闭眼，看到地下（有）大蟒蛇出来，这个出来的蟒蛇身体非常长大，大得无比、长得无比，看到这种蛇有一“千两百足”，脚像蜈蚣一样，其形态大得无比、长得无比，每个脚都有爪，像龙一样的爪，“毒龙”一样。那么，这种蛇身上出水火，有火出来、有水出来。</p><p> 我们在这个灯光下，大家人多，听听没有关系；你想想看——尤其出家的同学们，一个人住在山上，黑夜，又是台风之夜，冬天，衣服又穿不够，冻得鼻涕眼泪直流的时候，下面看到这样的境界，（若）你的定力不够，你想想看，你不疯了那才是怪人！疯了是正常的，对不对？哈，这个地方真要有点定力了。</p><p>  “身出水火，宛转于地”，看到这一个“毒龙”一样的“宛转”， 在地下盘起来，好像走不动了、生病了，这是什么东西？这就是我们人性心的本身坏的一面的反影。“此想成时”，你只有“至心忏悔”，深深反省到自己人性的根。</p><p> 固然人性本善，善是阳面啊，翻过来的那一面（就）是恶面，你平常修行非常好……所以，前天有个同学问我……我去到一个地方，这位出家的同学给我开车子，反正啊，他们给我开车子，在路上总捡些东西，一边给我开车，一边就问，问东问西。问到很多人，这一生福报很好……我说：“你晓得，福报很好，贪淫好色，前生是修行人啊。”他说：“哎，这是什么道理啊？”因为他是出家人，这个话很刺耳。我说：“前生修行持戒没有悟道，那个心里头都压着，看也不敢看、想吃不敢吃，等到这一生啊，受了好的福报以后，那个戒律范围一崩溃了以后，又贪淫、又好色、又好酒，哎，一切都是来了……”我说：“戒律呀，真悟道了自然持戒；不是真悟道是石头压草，越压越厉害，就是这个道理。”他说：“哦，有道理。”总算他很认可我，还说我说的有道理，哈哈，这个很有意思。</p><p> 所以你要晓得，我们人性里有善的一面……有时候你看一个人，有学问、讲道德，规规矩矩的……所以我经常说，你看：子孙就是个反动，一个善人有时候生一个孩子或者后代子孙，非常坏，原因是什么？他平常那个坏的念头压在里头，遗传到子孙那一面去了。有些老实人，走路都不敢乱走的，结果出个孩子，调皮的不得了，又蹦又跳——他心里想不想跳呢？想跳，因为要讲做人，只好规规矩矩，他那个坏的一面遗传下去了，就是这个道理，人性……所以你研究心理……。</p><p> 所以，在修定的境界（中）所出来的，都是你阿赖耶识种性出来的，毒蛇猛兽就是你的本性！所以，这里，佛不给你（将）秘密说穿，我替他老人家讲穿了，他不给你说理由，只叫你“至心忏悔先罪”啊！就是过去的业，阿赖耶识种子……。</p><p> 这个时候，“出定之时，不得多语”，不要乱讲，不要说：哎呀，我打坐有看到蛇啊……有些人，你看，很多学佛修道的人，做个梦，第二天都拼命讲，“哎呦，我梦到菩萨，我告诉你……”那着魔了。所以“出定之时不得多语”，这个修持的道理“如人饮水，冷暖自知。”</p><p> 所以，修密宗的戒律，像这各种的境界、善恶境界，除了上师，自己亲授的老师，除了善知识老师、除了金刚弟兄——就是自己真正同修的，在修道（上）有境界，比你经验多一点的道友，才可以讨论以外，不多说；有时候多说反而容易着魔境。其实也没有什么，因为你多说、你肯多说，你心理上就是个魔境相，你在那里把这个事情当成很厉害的。所以，“出定之时，不得多语。”</p><p>  “于寂静处”，更要入定，找清净，“一心系念”，除了饮食吃饭的时候，只有“忏悔”。</p><p> 可是呢，还有一点——你看真正的佛法修持，非常科学，除了心理上的作用以外，还有生理上的，要吃药、吃补品，“服诸酥药”，印度的补品都用酥油提炼的，各种药……。下面还有几个法子哦，佛说的哦，还主张你吃荤哦，呵。本来佛当时的戒律并不是吃素的，而且，做工夫到某一个程度……</p><p> 所以，你看密宗的木讷祖师，多少年来没有吃的啊，饿着修。最后师父涅槃的时候，给他一个锦囊，写一封信——不准开，你给我挂在身上，你修持到有个时候，关键打不开的时候，你再给我解开。师父死了，要涅槃的时候给他一个锦囊。所谓锦囊就是一封信，他就缝起来，挂在背上背着。打坐，一天没有吃的，吃草，吃了好多年，五六年，就是（同）释迦牟尼佛（一样），饿得人都不是人形了，总算他的未婚妻找到他了……。</p><p> 不晓得他在哪个山洞里，未婚妻来找他……他亲妹妹跟未婚妻两人一看就哭了，“哥哥你何苦修呢，修成这样，比一个骷髅还不如了……。”再看到一身光光的，所以未婚妻跟妹妹赶快下山化缘，化些布来，叫他做一件衣服，把身上遮一遮，总难看嘛。然后送些腊肉啊、酒啊给他。他收到衣物、针线，他就缝了五个套子，把两个手套一套、两个脚套套，另外下部套一套。后来未婚妻跟妹妹再来看他，说：“你怎么不做衣服，给你弄块布，你怎么搞的……。”他说：“你们认为难看的，就是这些地方，我把它套起来了就好了嘛，哈，啰嗦……”自己赶紧用功。最后饿的实在不得了了，哎呀，管他！心一狠，把那个肉弄去吃了，把那个未婚妻跟妹妹的酒也喝下去。酒喝了、肉吃了以后，噢！身上的气脉一下发动了！人就在空中飞了，大家都看到他在空中飞翔。</p><p> 然后他觉得，这个问题怎么解决呢？哎呀，师父讲，过不了关的时候，赶快把锦囊打开。把师父那个打开一看，师父一句话：此时全靠好饮食啊！呵呵，就是这么一句话，哈哈，修行到这个时候全靠好饮食，那就是药。佛也告诉你，到这个境界，你一方面要调整身体了。</p><p> 然后再进一步修下一步的法子，“然后方当易此观法”，赶快把这个四大观跳过去。就是由腰骨这里观起的这个法门，到这里为止。</p><p> “佛告阿难”，这个法门叫做第二种的“四大观”。我们上面第十二个层次的法子（是）第一种四大观，地水火风四大，破这个色身障碍。</p><p> 至于密宗、道家，修这个气脉，那是靠四大，靠肉体还在，白骨观是先把肉体拿掉了，气脉不谈了；不谈气脉，那才是更高的气脉。所以，我们佛有亲授的方法留在这里啊！埋没了几千年，多可惜啊！</p><p> 这是第二种的四大观，他叫阿难好好保护，不能掉了。</p><p> 那么，这个叫“第十三结使根本观竟。”第十三层的，九十八结使的根根，我们人性有光明面……那个黑暗面、恶的一面、最坏的那一面的那个结使解脱，就是九十八结使。我们有表发给大家的，对不对？都还带来吧？就是贪嗔痴慢疑的那个根根。到这个时候，并不能说你解脱得果哦，还没有证果哦；结使的根根总算给你翻出来了，修持到这一层。</p><p> 所以，我们普通修持，你修净土也好、修禅也好、修密也好，那都是活着（时）身心健康，偶然一点点境界，身上有一点点反应，以为是道了，然后加上许多理论，认为自己通了——通什么！嘴巴跟大肠两个相通，一点都没有通！没有用的，要实际修持过。</p><p> 现在我们继续下去。</p><p> <strong>【佛告阿难。此想成已。当更易观。易观法者。火大动时。应起山想。当想诸山。犹如冰霜。为火所融。如是猛火。极大炽盛。火炽盛时。身体蒸热。复更想龙。令雨诸石。以掩猛火。复当想石使碎如尘。龙复吐风。聚诸微尘。积至成山。无量林木。荆棘丛刺。皆自然生。尔时白水五色具足。流诸刺间。如是诸水。住山顶上。犹如积冰。凝然不动。此想成已。名第十四易观法。</strong></p><p> 佛告阿难。若有比丘比丘尼。优婆塞优婆夷。三昧正受者。汝当教是易观法。慎勿忘失。此四大观。若有得者。佛听服食酥肉等药。其食肉时。洗令无味。当如饥世食子肉想。我今此身。若不食肉。发狂而死。是故佛于舍卫国。敕诸比丘。为修禅故。得食三种清净之肉。尔时阿难。闻佛说法。欢喜奉行。】</p><p> 我们先到这里。</p><p> 刚才我忘记了，先（再）讲十四观。刚才不是讲那个毒蛇境界出来，然后他叫我们更要求证、更要修持下去，要定。定的时候，一方面心里“至心忏悔”——不要忘记了啊，我们看经，大家最容易把这种话，就看过去了，以为懂了；你懂了更糟糕，你没有忏悔。忏悔并不是说，跪下来磕两个头就完事的，跪下来磕头……</p><p> 所谓“忏”者不二过，再不犯第二次错误；“悔”，永远是精进修善道，忏悔两个字，六祖解释的最好了。也就是儒家孔子讲颜回“不二过”，知道错了，第二次不会再重犯的，悔一切的错误，以后不会重犯。所以儒家的道理也是这样，“弥天罪过，当不得一个悔字”，真忏悔，一切罪业清净，就怕不悔。</p><p> 他说，一边忏悔，一边对于色身，身体上要调整，吃补药，不是随便吃补，现在的什么当归鸭、四神汤了……随便这些没有用的，乱七八糟的没有用的，要懂医理。</p><p> 你要“服诸酥药”，四个字要注意，吃各种各种很多的药，吃经（医生）看过的，“酥药”，过去在印度，吃药都要酥油调。所以《维摩经》上（讲）佛病了，叫阿难去化缘，到维摩居士家里化酥油，酥油拿来做调药的。</p><p> 那么，这个情况之下，可以易观了，身心都调整好了，变更。“易观法者”，这个方法怎么修持呢？有一句话，“火大动时”——呵，佛经记载都告诉你了，（可）你真要看懂啊，你八辈子也看不懂，非要自己修持过以后……怎么看懂？自己吃了苦头，修持过了，再一看：哎呀，都有的！可是我的天啊，读懂了这个书，花的本钱太大了！当我有的时候、动的时候看不懂啊；等我超过了这个，回转来一看，看懂了，那对我没有用了，只好留给后人用。</p><p> 你看，“易观法者，火大动时”，那我们看书就要问：火大几时动啊？怎么样动呢？是我观想自己火大起来动？还是生命上火大自己动起来的动呢？对不对？你们要会问问题的，这种地方才是问题。</p><p> 所以，大家年轻的同学们问问题，我很烦啊，不会问问题，问鸡毛蒜皮——蒜皮都不是，蒜皮上掉下来的渣滓，那算什么问题呀！？这种地方，你读懂了吗？都以为读懂了，大学毕业有什么用哦。</p><p> 在“易观法者，火大动时，应起山想。”火大不是……普通我们打坐修行，有时候发炎的哦，有时候你这里发炎、那里发炎，绝不是里头生病。告诉你，用心太过了，内部会发炎；你要晓得，念头多了就是火啊。那么你说：我专门清净，妄念不起——那你一身会得风湿，沉默了就是水。难呐！很难调整。</p><p> 那你说：我听呼吸，天天练气功——你会发疯，风大多了硬会发疯，也不行。那你说：我吃的营养好——肠胃吃坏了，地大又太多了。地水火风四大，很难调整啊！不是那么简单啊！哪一个人做工夫……所以说，一万人、一亿人学佛修道，成功者一两个而已啊！</p><p> 所以我经常告诉大家，你们讲禅宗，《指月录》摆在这里，你查查看，《高僧传》，三千年的佛教，成功的不过一两千人啊；几百年出一个、两个。你才出了家就是高僧啊？看看你有多高，比我还矮一点。修道之难啊！不容易啊，所以要注意。</p><p> 所以刚才告诉你，火大动的时候，刚才讲，你用心太多就发炎。像普通人有许多胃病，有许多人跟我谈，“老师啊，胃病……”我说你当然胃病……为什么？他用脑过度，读书过多，脑神经用多了引起胃病，消化就衰弱了。有些是别种原因的胃病，各种各样来的。</p><p> 所以，“火大动”这个地方，还不（只）是这样，有时候你坐着，火大动（时）硬是身体上火大起来了，开始的时候也像一身都发烧，还是冬天这个气候，大概一件汗背心你都穿不住了，那是火大动。这还是好的哟，有时候火大动，人硬是受不了。</p><p> 他说，“应起山想”，怎么想山？你说我想一个山，压到上面来，把我压扁了？没有。有一个同学在基隆，夏天测验观想，他是做心理的测验，他学佛以后做心理……夏天，他跑到山顶上站着，最热的时候，他观想：我站在冰山下面，四面冰山，他观想了两个钟头，冷得他牙齿都打起颤来，实际上是在夏天的大太阳之下。他说：哦，心念的力量有这样强！他假想自己站在冰山的夹缝里，冻得……噢，后来自己牙齿都发抖，冷得发抖起来。</p><p> 所以，“山想”也就是这样，心念的力量，心能转物。所以，他也是这个境界，冰山上出水，止掉这个猛火。</p><p> 那么，再想到龙，说龙起云兴，你不一定想龙……下大雨，把这个火熄了，种种等等。下面就不要多说了。</p><p> 山石上面都是……荆棘之间都有……就是讲人身上的血脉，也就是代表血脉，都是水出来。</p><p> 最后，把这个火起来的时候，就是说，有时候身上过分的火大发动，要做水观想。</p><p> 所以，这个地方我们有一个考验，很多打坐学佛修道多年的人，个个都在生病，病中发炎。你说：“你做水大想嘛，把自己发炎的冲洗干净、清净了。”“哎呀，我想不起来。”不是想不起来，你心力没有那么强，就是平常没有修持，心理扭不转来——转识成智。</p><p> 实际上那个时候，人在发烧的时候，“哎呀！哎呀！好难过啊！”你把那个力气转成观想就行了嘛，他不肯啊，不肯是什么原因？不是转不过来，被那个业力拖走的，这就叫做业力把你拖走了。所以，平常修行哪里会得力呀？！然后，讲道理他都懂，懂了有什么用？真懂了，在这个时候，非把疾病扭过来不可！</p><p> 扭过来以后，由火大转成四个字，“凝然不动”，又定了，由发热的境界变成清凉境界。他说，“此想成已”，这个观想你做成功了，叫做“第十四层易观法。”四大里头，就是调整这个身体，把自己这个身体生命转化。第三步就是第十四个易观法。</p><p> “佛告阿难”，同阿难讲，“若有比丘比丘尼”，出家的和尚，“优婆塞优婆夷”，男居士、女居士。“三昧正受者”，真正在修行，得定的人，“汝当教是易观法”，你应该教他这个法子。换句话，不真修行的人不教，有什么用？懂了以后没有用，懂了以后可以写小说而已，自己吹牛，就不教了。</p><p> 那么，“此四大观”，这四大观转变身体，“若有得者，佛听服食酥肉等药”，准你吃肉，连出家的都在内。“其食肉时”，吃肉呢，“洗令无味”，要洗干净，“当如饥世食子肉想”，不要贪味道哦，觉得我吃肉很痛快；你吃的时候要非常难过慈悲，我现在是在吃药，没有办法，等于我是在吃自己的儿子、吃自己的父母，要有这样报恩之心想，还要超度这个被你吃的……。</p><p> “我今此身，若不食肉，发狂而死”，我现在不吃这个“酥肉等药”，营养不够就会死，所以只好借你治我身体，借你医……。</p><p> “是故佛于舍卫国，敕诸比丘，为修禅故，得食三种清净之肉。”所以佛在戒律上，比丘出家人，为了真用工夫，到某一个时候可以吃三净肉。</p><p> 怎么叫三净肉？不自杀，不为贪吃，自己杀它；不教他杀，不是说：哎，我不杀生啊，你去给我买一个鸡，你给我杀了，炖给我吃，阿弥陀佛，我不杀生啊——实际上为你而杀，这就是教他杀；不见杀随喜，我们到了这个杀鸡的门口过，一看到：嗨，你杀了，没关系，不是我欠的命债，我买一块——这你还要欠账的。所以不自杀、不教他杀、不见杀随喜，这个叫做三净肉。</p><p> 譬如你买一只火腿来，也不晓得（是）哪一天、哪一个人杀的，你现在还要恭敬这个火腿，当成吃药，还要认为有肉的这个猪，也就是一个人，我今天借你的肉治我的病，还要欠他的帐，要还帐，超度（？）。这是佛准许比丘吃这（样）的三净肉。</p><p> 但是，上面有一句话，他（是）说真正的出家，修定到这个程度……你不要没有到，说我现在也有病，去买一块，还要老师帮你去买，那你怎么办……，不对的啊，要吃这个三净肉。</p><p> “尔时阿难，闻佛所说，欢喜奉行。”他并不是为了吃肉欢喜，哈哈，是为了这个法子“欢喜奉行。”</p><p> 好，我们现在继续说，（同学：这个第十四观很长啊。）很长，一节一节来。</p><p> <strong>【佛告阿难。教易观已。复当更教如前系念。住意谛观脊骨。复使白净。过前数倍。于二节间。以明净故。得见一切诸秽恶事。此想成时。当自观身作一骨人。节节之中。白净明显。如颇梨镜。阎浮提中一切骨人。及四大观所有境界。皆于一节中现。</strong></p><p> 见此事已。见诸骨人从东方来。向于行者。行行相次。数如微尘。如是东方满娑婆世界。诸白骨人。皆行行相次。来向行者。南西北方。四维上下。亦复如是。复有青色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有淤泥色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有浊水色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有赤色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有红色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有脓血涂身骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有黄色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有绿色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有紫色骨人。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。复有那利疮色骨人。于诸节间。二节流出十六色。诸恶杂脓。行行相次。来向行者。满阎浮提。渐渐广大。乃至东方满娑婆世界。南西北方。四维上下。亦复如是。</p><p> 此想成时。行者惊怖。见诸夜叉。欲来啖己。尔时复当见诸骨人。节节火起。焰焰相次。遍满娑婆世界。复见骨人顶上。涌出诸水。如颇梨幢。复见骨人头上。一切众火。化为石山。是时诸龙。耳出诸风。吹火动山。是时诸山。旋住空中。如窑家轮。而无分阂。见此事已。极大惊怖。以惊怖故。有一亿鬼。担山吐火。形状各异。来至其所。</p><p> 佛告阿难。若有比丘。正念安住。修不放逸。见此事时。当教诸法空无我观。出定之时。亦当劝进令至智者所。问甚深空义。】</p><p> 好，到这里为止，暂时先切到这里。</p><p> 这一观，你看，佛经是印度的章法——在中国的翻译，只举一个例子，下面几个字“亦复如是”，但是我们很容易忽略过去了。印度的文化不厌其罗嗦，同样的话反复叮咛，反复告诉你，怕你忘记，尤其是佛经，采用这个章法。同样的话，我们假设读书，以中国的文章来读，很讨厌，同样的话嘛，不过是颜色不同，红色是这样说一套……可是呢，它有个好处……，……红笔两块钱，绿笔也两块钱。我家有个大哥、二哥、三哥、四哥、五哥、六哥、七哥、八哥、九哥、十哥，来看你家的大妹、二妹、三妹、四妹、五妹、六妹、七妹、八妹、九妹、十妹——这种说话的方式，就是佛经说话的方式。我们中国人说话：我家的十兄弟来看你家的十姊妹，就完了，呵，就不同，两个味道完全不同，各有各的长处，你要注意。那么，这个闲话说完了。</p><p> 就是说，我们在这个时候，还是要看脊骨，腰脊骨，还是从腰骨这里起，观这个脊骨，为什么总从腰骨这里起观？你注意这个地方，学中医的都晓得，腰这里的骨节，就是我们两个肾、两个腰子中间的这些骨节，在中医叫做命门，生命的根本。所以，佛在这个地方，叫你观命门。</p><p> 注意，后面有些太太们，中年以上生过孩子的，经常容易犯腰酸、头痛，那么，观命门的背脊白骨观法，非常有效。但是，那（是）指祛病延年有效；你要入定的话、得道的话，真的要修道，那么，这些境界马上就来了。</p><p> 这个时候，为什么看到一排一排……都是“东方”来的啊？各色的人，一排一排的，流脓的、流血的……流什么的？这些人都到“行者”前，都到你……你打坐在这里，都向这边来了。东方是什么道理？他都用东方开始来，对不对？（同学：……）是啊，生生不已，你倒讲得很通啊。东方是生气方，就是代表一个什么呢？就是你观这里，生命要回转来的时候，祛病延年的时候，这个阳气发生，生命力增强的时候——等于我们引用西方人的一句俗语，天亮以前有一段最黑暗的时期，所以好的境界来以前，这些境界（先）来。</p><p> 那么，这些来的境界是幻境吗？是幻境。是真的幻吗？是真的。怎么真的？就是你本身生命里有这些败种。我们每一个人，这个四大色身没有成就，所谓报身没有修圆满之前，没有修成卢舍那佛的境界，那么，我们这个色身上面自然有这些坏东西。每一样东西一发动，就是要你命，所以，各种病都来了。可是，你要晓得，这些情形就是讲每个人身上所潜伏的病根、病种，一样一样来，“行行”，一排一排地过来。乃至于觉得山摇地动，头都昏了，这个境界来……这是真讲修行的。</p><p> 他说，你看到这个的时候，你非常害怕。所以《金刚经》上告诉你——我们看《金刚经》不提这些事，只说你见到空的时候，不要恐怖的人……看到性空，天天学佛求空，到了空的境界一来，他就害怕起来了，真空来了他会害怕。所以《金刚经》上说，你修空见到空的时候，这个人不惊不怖不畏，“是人”，这个人已经“不于一佛二佛三四五佛而种善根”，那么，这就是印度文化；我们中国文化（就）几个字，“已于无量千万佛所种诸善根。”这个定力之难，一个人定力之难……。</p><p> 到这个时候，他说，我们会生大“惊怖”。那么，你一害怕的时候，再加上这个心理上的幻境，就看到一亿的鬼，就是搬山来压你，身上“吐火”。那么，这个时候，修行到这个境界的时候，碰到这种境界，你怎么来对治呢？佛同阿难讲——这个时候注意了啊，特别注意，你看，这个不是小乘的禅观经哦，所以我告诉你，它包括了大小乘，它不只是显教，它包括了无上的密教。</p><p> 他说，“若有比丘，正念安住，修不放逸”，绝不怕，以身殉道，充其量你魔鬼来要我死嘛，一念“安住”，“修不放逸”。那么，这个时候，怎么样破这些境界呢？万缘放下，一切空！这不是一句理论的话哦，你们不要点头哦，你要放得下万缘——在那里丝毫半点都放不下。</p><p> 这个时候，“当教诸法空”，一切法本空，自性本空。你说我也懂啊，（但）你怎么做到自性本空啊？！一切法“无我”，所以，这个时候要理上破了，“当教诸法空、无我观”，有个“观”字哦，（是）止观的境界哦；这不是理论上的空、无我，理论上空无我，我们很容易讲，你真正修持到、证到空，证到无我，这个不是吹牛的，不是说大话的。所以，要修诸法空观、诸法无我观。</p><p> 那么，出定的时候，这个境界可以破了。出定的时候，你赶快找善知识、明师，“令至智者，修甚深空义”，要听大乘经典，这个时候要穷理！</p><p> 这一段，你再继续念下去。</p><p> <strong>【闻空义已。应当自观。我身者依因父母不净和合。筋缠血涂。三十六物。污露不净。属诸业缘。从无明起。今观此身。无一可爱。如朽败物。作是思惟时。诸骨人皆来逼己。当伸右手。以指弹诸骨人。而作是念。如此骨人。从虚妄想。强分别现。我身亦尔。从四大生。六入村落。所共居止。何况诸骨从虚妄出。</strong></p><p> 作是念时。诸白骨人。碎散如尘。积聚在地。如白雪山。众多杂色骨人。有一大虺。忽然吞食。于白雪山上。有一白玉人。身体端严。高三十六由旬。颈赤如火。眼有白光。时诸白水。并颇梨幢。悉皆自然入白玉人顶。龙鬼蛇虺。猕猴师子、狸猫之属。悉皆惊走。畏大火故。寻树上下。身诸毛孔九十九蛇。悉在树上。尔时毒龙。宛转绕树。复见黑象。在树下立。</p><p> 见此事时。应当深心。六时忏悔。不乐多语。在空闲处。思诸法空。诸法空中。无地无水。亦无风火。色是颠倒。从幻法生。受是因缘。从诸业生。想为颠倒。是不住法。识为不见。属诸业缘。生贪爱种。如是种种。谛观此身。地大者。从空见有。空见亦空。云何为坚。想地如是。推析何者是地。作是观已。名观外地。一一谛观地大无主。</p><p> 作是想时。见白骨山。复更碎坏。犹如微尘。唯骨人在。于微尘间。有诸白光。共相连持。于白光间。复生种种四色光明。于光明间。复起猛火。烧诸夜叉。时诸夜叉。为火所逼。悉走上树。未至树上。黑象踏蹴。夜叉出火。烧黑象脚。黑象是时。作声鸣吼。如师子吼音。演说苦空无常无我。亦说此身是败坏法。不久当灭。黑象说已。与夜叉战。夜叉以大铁叉。刺黑象心。黑象复吼。一房地动。是时大树根茎枝叶。一时动摇。龙亦吐火。欲烧此树。诸蛇惊张。各申九十九头。以救此树。是时夜叉。复更惊起。手执大石。欲掷黑象。黑象即前。以鼻受石。掷置树上。石至树上。状似刀山。是夜叉奋身大踊。身诸毛孔。出诸毒龙。龙有四头。吐诸烟焰。甚可怖畏。</p><p> 此想成时。自见己身。身内心处。深如坑井。井中有蛇。吐毒上下。现于井上。有摩尼珠。以十四丝系悬在虚空。时彼毒蛇。仰口吸珠。了不能得。失舍躄地。迷闷无知。是时口火。还入顶中。行者若见此事。当起忏悔。乞适意食。调和四大。极令安隐。当坐密屋。无鸟雀声处。</p><p> 佛告阿难。若比丘比丘尼。优婆塞优婆夷。得此观者。名得地大观。当勤系念。慎莫放逸。若修不放逸行。疾于流水。当得顶法。虽复懒惰。已舍三涂恶道之处。舍身他世。生兜率天。值遇弥勒。为说苦空无常等法。豁然意解。成阿那含果。</p><p> 佛告阿难。汝今谛受地大观法。慎勿忘失。为未来世。一切众生。敷演广说。尔时阿难。闻佛所说。欢喜奉行。得此观者。名第十四地大观竟。亦名分别四大相貌。复名见五阴粗相。有智慧者。亦能自知结使多少。四念处中。名身念处。唯见身外。未见身内。身念处境界四分之中。此是最初。得此观者。身心悦乐。少于诤讼。】</p><p> 你看，我们看了一篇幻想小说，神游太虚幻境，不过太恐怖了。西方人如果拿这个写科学幻想小说，（是）最好的资料。</p><p> 但是，讲了半天，你看，所有的佛经……你们平常……四念处（中）身念处观的四分之一点，四大观真修持到这里还没有证果。那么，下面刚才念过了，我们再不多讲了。</p><p> 做这个观，你看，又有毒龙啊、又有猴子啊、又有……哎呦，各种猛兽都出来了，还有树，树上有蛇，蛇有九十九个头——九十九结使。那么，这些东西所描述的这些魔啊、鬼啊各种境界，真不真呢？真的，我告诉你，如果学过地质学的人、学过物理的人，佛经这一段就是讲地球物质的形成。我们现在生生命身体的形成也是这样。那么，新的科学同旧的汇流了，汇流什么？中国道家说的话，人身是个小宇宙，我们身体就是个小天地。这一切境界的变化，打坐修持到这里都是真的，没有假的。</p><p> 所以，九十九条蛇挂在树上，每一条蛇都毒……就是我们的心理状况：妒忌啊、贪嗔啊、傲慢啊……。所以，你真修到这个境界，自己看到自身，最后见到自身，见到自身，就可以在定中看到内心——自己才发现自己的内心有最深的一个坑井，深不见底的井。我们每一个人的心都是深的很啊！深沉的很，都是为己；挖一个坑坑，很深的井，都想埋别人的。这个境界里都呈现了。</p><p> 而井中“有蛇吐毒”，都吐这个毒气，贪嗔痴。可是这个井口，就是我们心窝这个井口上面，有摩尼宝珠。所谓摩尼珠，什么叫做摩尼珠？无价的宝珠，谁得到了，抓在你手里，（就）能够起死回生，返老还童。就是用句山东话：要啥有啥。你想钱，心一想，摩尼珠里钱就来了，你要想什么就有什么，如意珠，这颗摩尼珠在井口。但是，（看）这个画面，有十四条丝，吊起这个摩尼珠，可是，心里头这个毒蛇想吃这个珠就吃不到，吃到了就化龙。</p><p> 现在我们有没有这个境界？我们在打坐就是这个境界，心里头很深，都想成佛，贪嗔痴来，就想吃颗摩尼珠得道——永远得不到，对不对？现在就有这个境界，不过你这个境界没有呈现，其实大家现在都有这个境界，每一个人活着，都想功名富贵、发财啊各种理想，都是这一条毒蛇想吞这颗摩尼珠，在呈现。</p><p> 他说，这些境界来……修持当中有这些境界，这都是实在的。有时候佛经是那么说，你要知道，不是每一个人修持就是这一幕，这一幕一定是这样来的，不是的啊，不要搞错了。你搞了半天：哎呀，我怎么半条毒蛇也没有来，我修道不成功了？不是这个道理。</p><p> 佛讲的是（按照）程序来告诉你，没有错。任何人，个人业力不同，所遭遇的境界，前后次序，统统都不同的。要融会贯通，你就懂了，每一个都有。</p><p> 譬如你们，普通还没有悟道，有时候打坐忽然觉得闷闷的，前面黑黑的，那就是黑山压过来，就是这个道理，就是无明的境象起来反映。</p><p> 他说，碰到这个境界，唯有至心“忏悔”。还有，呵，又来了，我们很高兴的话，叫我们吃好一点，哈哈。其实啊，调和四大，要补充身体，要使四大……。</p><p> 还有呢，调了身体……好，要住一个房间专修，一点空气不准流通的，都在密屋里，鸟雀声音都听不到的。所以密宗有闭黑关。那我们现在在都市上修不行，现在在山上修也不行，有飞机（声）还不行，要隔音，好几层，一点声音听不见。</p><p> 一个人到了完全没有声音的地方，高山绝顶，真到没有声音，一点声音都没有——你们大概没有经验吧？不晓得在座的哪一位有经验？非常恐怖的，我告诉你。不管你白天……碰到这个境界你会吓死的，一点声音都……。</p><p> 因为我们人类，无论如何，听惯了声音，你说我喜欢静，那个静就是声音啊。你到山里很清净，一来：这个舒服啊，这个清净！这个清净就是音声，这就是老子所讲的“大音希声”，也是音声。真到了高山绝顶……。</p><p> 什么时候没有声音？我告诉你，你如果带上氧气，潜水衣穿上，跑到海里头，深海，那一点声音也没有，那个时候真宁静，可是啊，有无比的恐怖感。不过在海里头不会了，旁边还看到游鱼。有一个朋友下去了以后，他说旁边好多怪鱼，那个怪鱼看到我们也来看，嘿，没有看到过，动都不动，我们也看它，它也看我们。他说那个声音静的啊，一点什么声音都没有，深海里头，那个还舒服。所以他说，修持到了这个境界，要有一个地方绝对隔离了一切音声。</p><p> 那么佛说，有比丘、比丘尼，出家、在家的，工夫到这里叫做得到“地大观”，得到地大观要努力修持，不要放逸。这个时候，如果真正修持，成功很快了，“疾于流水”，顺流而下，你非成功不可。就是得到顶法，四加行的顶法，开顶了。开顶有几种，开了以后，那可以说，不要这个身体，自己随便就天上人间任意自在。还有呢，开顶了以后再回转来，再修这个色身。</p><p> 假定不精进人，懒惰一点，修到这个境界也不会堕落了，死后不会下地狱、不会变畜生、不会变恶鬼，才跳出了三恶道。那么，这个肉身一死啊，起码起码，到哪一位老板那里去呢？弥勒佛那里去，“生兜率天”，未来跟着教主来，他来成佛的时候跟着一起下。那么，在弥勒菩萨前面听说法，然后未来的时候，跟着弥勒菩萨一起下来的时候，降生人间“豁然意解”，你可以得三果阿那含。</p><p> 所以告诉阿难，这个第十四观千万不要忘记。这个第十四观，也叫做“地大观”。还有个名称，叫做“分别四大相貌”，地水火风的观法。也叫做也同时连带了（liǎo）这个五阴空的粗相。</p><p> 如果智慧高的人，利根的人，已经在理上悟了道的，再修这个法门，到这个境界，自己对自己阿赖耶识的结使，九十八个结使有多少，看得清清楚楚。那么换句话，自己对自己的道果看得很清楚了，解脱了多少，得个什么果位。</p><p> 所以你看，天台宗的祖师智者大师，我们可以称他是中国的小释迦佛。但是你看，智者大师自己的传记，临涅槃的时候，人家问他：师父啊，你究竟到了什么地方？登初地菩萨没有？他说没有，不过在十信位中而已，他初地菩萨都没有达到。修持有如此之难，渐修。</p><p> 所以，自己心中的烦恼都找不清楚，反省不出来，那一点影子都没有……所以，这个法门在“四念处中”，真正叫做“身念处”。但是，修到这一步，还只见“身外”哦，佛再吩咐你，还没有见到“身内”哦，“身念处境界四分之中”的一种哦，最初步的。可是，修行得到这个境界，“身心悦乐”，无比的喜悦，那就是神仙境界了，“少于诤讼”，再也不会跟人家争强好胜。所以，渐渐可以得无诤三昧，没有什么，没有争强好胜，自己身心无比的快乐、无比的慈爱，修到这一步。</p><p> 所以，这个禅观的修法……你说学禅宗，很多后世学禅、学密宗的人、修道的人，都容易走成狂，所谓“狂禅”，自以为是。真正的工夫境界一点都没有。这些工夫境界，一步一步都很扎实的，你不可违反。今天到这里为止。（起立！）谢谢谢谢！不要……好了，免了……</p></div>"
},{
    "title": "禅秘要法讲座 13",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 今天，《禅秘要法》今天一次，下个礼拜三一次，中间要停课到一月五号再开始，再补课。现在继续再念观法。</p><p> <strong>【佛告阿难。此想成已。次当更观身外。火从因缘有。有缘则起。缘离则灭。如此众火。来无所从来。去无所至。恍忽变灭。终不暂停。作是思惟时。外火即灭。更不复现。复当思惟。外诸水等。江河池流。皆是龙力变化所成。我今云何横见此水。此诸水等。来无所从来。去无所至。作是思惟时。外水不现。复当起念。此风者与虚空合。诸龙鸣吼。假因缘有。如此想者。亦不在内。亦不在外。不在中间。颠倒心故。横见此事。</strong></p><p> 作是思惟时。外风不起。复当更系念思惟。身内脊骨。见身内骨。白如珂雪。一一节间。三十六物。秽恶不净。皆于中现。或见身皮。犹如皮囊。盛诸不净。无量瘭疽。百千痈疾。悉在其中。诸脓流出。滴滴不绝。当在骨人头上。极可厌患。或见身内五藏。悉皆走入于大肠中。大肠膀胀。烂溃难堪。</p><p> 尔时行者。以定力故。出定入定。见一切人及与己身。同不净聚。见诸女人。身如虫狗。秽恶不净。自然当得不贪色想。</p><p> 佛告阿难。此想成时。名第十四观外四大。亦名渐解学观空。佛告阿难。汝持佛语。慎勿忘失。尔时阿难。闻佛所说。欢喜奉行。】</p><p> 这个观法，是接着上次所讲的，要了这个身，（是）第十四观法，第十四个层次，也是第十五个观法的开始。接着上面的四大观，就是了这个身的。那么，由上面第十三观完成了——观本身，我们这个肉身身体上的地水火风：地就是骨头，水就是液体，火就是身上的热力，风就是风。叫我们观这一段，就是理念上正思维的修了。</p><p> “观身外火从因缘有”，就是修持到那个境界，外面，自己感觉到，开眼闭眼都是火光，相当害怕的，有时候身上都直热，受不了。那么，如何把这个火熄了观空呢？就是从因缘法观，“有缘则起”，都是因缘所生，“缘离则灭”。这个因缘法观就要配合教理，十二因缘，这个教理都要熟练。那么，假设教理不熟练，走大乘的路线，就是《楞严经》的四大观法，“性火真空，性空真火”这一段，曾经提到过好多次。</p><p> 那么，然后想到火性也本空，火性，“众火来无所从来，去无所至”，那么，由这个身的智慧思维观法，定力到了，这个外面的火光境界，一下子没有了。那么，观火观是因缘生法，一下空了。</p><p> 所以，这是正思维、穷理的观法。拿中国文化讲，“穷理尽性以至于命。”“作是思惟时，外火即灭”，那个火光的境界没有（了）。这是讲外火。</p><p> 其实我们有时候生病，内心的发炎就是火大起来了，所谓四大不平均、不调，火大起来，各部分发炎。那么，假设真有定力，正思维修，这个内火也照样熄的，一念之间——这个正思维，看起来、讲起那么多，在修的时候，就（是）一念之间把这个理整个拿到了，用理的定力，这个理的定力，不是工夫的定力。就是必须要智慧、要通教理。那么，火光就不起来了。</p><p> 由这个，自己给自己一个证明——这不是理想的，当然，大家没有修持到那里，（就）变成一个理想。到这个程度，由自己给自己一个证明：火观平息了，心火也息下去了，所以，身上的发炎、皮肤上发炎，各部分生理机能的发炎都清净了，那么，了火大观，然后讲水大观。</p><p> 这里，佛经一个大问题，同现代思想……佛经上说：“水等江河池流，皆是龙力变化所成”，都是龙起的变化。就是最近，大概个把月、两个月，有人来讲这个道理，讲龙的道理，引起修持方面高层的佛教界的人，专门讲修持的，很大的辩论。那么，照一般的现代人讲，根本不承认有龙，下雨、江河这些不是龙，（是）气候变化，地球物理的问题。但是，学佛的绝对承认有龙，因此辩得很厉害，据说辩到脸红耳赤。后来，还是现代思想的人，一般学者收场，说这个问题我们不谈，先摆在那里再说。</p><p> 那么，就提到《华严经》，龙树菩萨到龙宫里取的《华严经》，那么大家就……龙宫究竟是在太平洋底，还是在哪里；拿出证据来看，等等……。后来这个问题到达我这边谈起，我只好笑，我说：这个问题，我还是同意你们的话，先保留再说。</p><p> 问题的关键，佛经所讲的龙作何解说是一个问题。如果我们一样地把它构想成像我们中国人画的龙，或者西方人的恐龙，那问题就大了。如果龙是宇宙间一股电磁的力量，不能够说没有这个变化的作用，那这个问题就容易解决了，接近到科学了。我说：此问题你们还是慢慢到美国再去讨论吧，讨论完了我再来给你们做结论。很大的问题，顺便提到。</p><p> 现在佛经上，照古代的写法——当然，佛经上有些对，有些地方的比喻，因为过去的知识……所以，你们也可以作这样的看法：龙这些等等，是宇宙间一个神奇的生命，有这股力量。譬如中国《易经》提到的龙，同佛经的观念有相同之处，也有不同之处。至于这个龙的存在、不存在，那是另一问题了。</p><p> 譬如佛经提到“龟毛兔角”，就是形容比方世界上没有这件事，乌龟没有毛的，兔子没有角的。事实上，现在全世界整个人类的知识普及了，乌龟有毛，有绿毛乌龟，长毛，日本北海道就很多，别的地方也有，哈；至于兔子生角倒是没有的。所以，有些经典上，不管哪个宗教经典，当时在教化、教育上，讲的、引用的当（时）代的知识（是）有限度的，这是在所难免。关于龙的问题，如果站在一般人学术的立场上，可以作此看法。</p><p> 那么，站在求证的立场上，到那个境界里头，真有没有龙？在中国人的了解，据说是比大蟒还大，不过它不是蟒蛇，“龙生九子”，有九种种类。譬如，我们过去刻的碑，庙子、坟上刻的碑，下面那个驮碑的就是龙的所谓变化所生的一种。还有过去修的庙子同皇宫屋顶上站着的那个桓口（？），也是龙的所谓子孙变化的一种，所以龙生九子。</p><p> 世界上这一类，除了龙本身以外，这七八种的生物，现在并不是没有存在，还有存在的。所以这个问题很严重，暂时我们讲到这里为保留。</p><p> 那么，这个地方主要是讲到做水大观，说龙可以吐水也好，或者是什么原因来也好，我们身上的龙，就是血管、就是血脉，比方身上的龙就是这个血脉。上次我们讲到过，道家经常把人身上的两个东西（比喻）龙、虎，一个血、一个气。</p><p> 现在叫我们做水大观的时候，重点在哪里？也就是说，这个水大之所以形成也是因缘所生。譬如人口干、发烧到极点的时候，心境一宁静了以后，那个干烧就丧失了，不要喝水。假设平常，你让他这个心念配合生理的感受成长下去，有大量的水还不能解渴。同样的，身上的水肿，或者发生血的毛病，都属于水大，能够有定力作因缘观的，也（可以）把它一样地清净下去。</p><p> 现在的重点不讨论龙，就是讲水因缘所生，也就是《楞严经》上——从来大乘经典不提这些，大乘经典就是“性水真空，性空真水”这个道理。</p><p> 那么，做了水大观以后，火大、水大两观以后，然后就是作风大观，就是呼吸，也空了。那么，地大观不需要作，因为白骨的本身就是地大，白骨观始终（是）从地大修起，然后了这个地大。</p><p> 他说，把水、火、风气空了以后，“复当更系念思维身内”这个白骨，一节一节“白如珂雪”，雪白如玻璃一样。每一节一节间，三十六种东西都看得到，就是在定境中间，自己看到内在的心肝脾肺肾、大肠、小肠、屎、尿，这些等等都看得见。或者，看到自己一身皮包着，都看得见，“犹如皮囊”，装了这许多不干净的东西。那么，也看到身体内部有百千种虫，有病的，都在中间，有身体内部的血液，清与不清，乃至于脓血，有病的地方，“滴滴不绝”，都看得清楚。</p><p> 那么，这个时候，自己对于这个身体的内在——所以，定境界比Ｘ光还厉害，都检查得清楚的。那么，看到身体里的五脏六腑。然后用定力的观想从头上起，直到讨厌了的这些内脏。因为内脏中……白骨本身这个架子暂时不管，还是很好，就是以自己的念力、心力，从头上起，把五脏六腑拖到大肠里来，然后大肠慢慢膨胀长大，然后可以抛弃了它。</p><p> 这个“抛弃了它”这一句，本文上没有，只是大肠长大——你非抛弃了不可，不然肚子鼓得很大，因为它跟着气会到这里，鼓得很大，非常难受，你必须要把它空掉。就是回转去上面，有一个把内五脏六腑完全空掉，或者上吐出来，或者下面丢开了，（是）同一个道理。</p><p> 他说，工夫到了这个时候，“行者”，修行人，“以定力故”，因为已经得到定了，随时在这个境界里，什么境界呢？自己随时内外清明，一具白骨，自己身体摆在这一具白骨，“白如珂雪”，不像我们这个模型那么难看，这个颜色已经不够了，“白如珂雪”。</p><p> 然后，出定的时候，看一切人，乃至自己的本身，都是个不干净的东西累积起来的。所以，以男性来讲看女人、女性看男人，都是如此。那么，等于虫一样、等于动物一样，等于狗啊、猪啊动物一样，人同动物没有什么分别、同虫也没有什么分别，没有净物的观念，不净，自然可以去掉“贪色”的观念，贪漂亮的、贪两性的差别，乃至于漂亮不漂亮，贪色的观念自然去掉了。</p><p> “佛告阿难”，这个想，这个境界（是）“第十四观”的境界，叫做“观外四大”空。也叫做——我们平常学佛想求空，空不了，念头空不了，身体也空不了，不管学佛修道，目的都是道家叫清净、佛家叫空。事实上，我们身心两方面空不了，非走内在白骨观的工夫，一步一步渐修来，（否则）绝对空不了！你理怎么样悟得好，空不了！这是个渐修的工夫。所以，你这样一来，也叫做，“渐解学观空”的道理，渐修的。</p><p> 那么佛吩咐阿难，你好好记住，修持这个法。这是第十四层。</p><p> 现在，第十五个观。</p><p> <strong>【佛告阿难。此想成已。复当更教系念。谛观身内地大。身内地大者。骨齿爪发。肠胃腹肝心肺诸坚实物。悉是地大精气所成。外地无常。所以知之。譬如大地。二日出时。大地焦枯。三日出时。江河池沼。悉皆枯竭。四日出时。大海三分减二。五日出时。大海枯尽。六日出时。大地焰起。七日出时。大地燃尽。外地犹尔。势不支久。况身内地。当复坚牢。尔时行者。应自思惟。今我此身。发是我耶。爪是我耶。骨是我耶。身诸五藏为是我耶。如是谛观。身诸支节。都无有我。自观诸骨。一一谛观此骨者。从何处生。父母和合。赤白精时。如乳时。如泡时。如是歌罗逻时。如安浮陀时。如是诸时。何处有骨。当知此骨。本无今有。已有还无。此骨者。同虚空相。外地无常。内地亦尔。作是思惟时。谛观己身一切诸骨。自然破散。犹如微尘。入定观骨。但见骨处。不见骨相。出定见身。如前无异。</strong></p><p> 复当更观身内诸火。从外火有。外火无常。无有暂停。我今身火。何由久热。作是观时。观诸骨上。一切火光。悉灭不现。复当更观。身内诸水。我此诸水。因外水有。外水无常。势不支久。内水亦尔。假缘而有。何处有水及不净聚。外风无常。势不支久。从因缘生。还从缘灭。今我身内所有诸风。假伪合成。强为机关。何处有风。从妄想起。是颠倒见。作是思惟时。不见身内诸龙。耳中所有诸风。悉灭不现。如是种种。谛自思惟。何处有人及地水火风。观此地是败坏法。观此火犹如幻。又观此风。从颠倒起。观此水从虚妄想现。作是观时。行者见身。犹如芭蕉。中无坚实。或自见心。如水上泡。闻诸外声。犹如谷声。</p><p> 作是观时。见诸骨上一切火光。见白光水。见诸龙风。悉在一处。观身静寂。不识身相。身心安隐。恬泊悦乐。如此境界。名第十五四大观竟。】</p><p> 现在，白骨观到了第十五个层次（及）最后的第十六个层次，这一步的观法是证果的方法；不是像前面做工夫，从第六意识的想、思，专门硬性做的。到第十四、第十五这个阶段，理上来了，完全靠智慧，靠理上修过来。</p><p> 所以他说，到这个时候，第一步，“更教系念”，这个念头是要定住的啊……这里大家有问题没有？什么念头……有哪一位，现在修得比较有初步成绩的，或者过去修的有更进步成绩的，我们现在研讨一个问题，做白骨观的时候，你看，每一个观法、每一步，都告诉我们“系念”，为什么系念下面有那么多的观法？这个中间的道理，或者大家哪一位做个实际的报告，使我们做研究，（令）未入门的、工夫未上路的，听起来比较清楚，然后我给大家做一个讨论，我想，这样好不好？请……那个线拉得过去吗？有没有可以讲的啊？请我们崔公或者焦先生，他两位对于白骨观比较经验深的……问一个问题，怎么样修白骨观？怎么样系念？……焦先生先开始……。</p><p> （焦先生：老师、各位同参：老师要我报告关于这个白骨观，每一个观里都提到系心一处，就是要系念。我想讲最重要的个人体验，就是作观的时候，在开始观的时候，第一次观全部或是观一点，你观想起来了以后，你一定要定住了，能够定以后，这个就会呈现的，甚至于发光了。那么，然后再进一步地去易观也好，或是继续观下去也好，才能够产生效果。这是我的一点点体验，不晓得正确不正确，还请老师开示。）</p><p> 慢慢地，听焦先生再讲一点点你的实际经验，给大家报告一下，譬如你观白骨做工夫的情况。（焦先生：在前年开始观这个白骨观的时候，是先照这个程序，一步一步地来，从左拇趾好像先看溃烂啊，或是出现这个……但是，始终是观不起来，后面还没有看到。后来我就想：我好像是已经死去了，睡在这个棺材当中，然后呢，就想到我这个身体就膨胀、溃烂，然后也生了很多的蛆虫，慢慢地，蛆虫把这个腐烂的东西吃干净以后，自然这个白骨全身就现出来了。现出来以后呢，当时我就是尽量往这个地方看，突然地，发现有一节有光，当时我以为是这个禅堂里的电灯开了，后来老师告诉我，当时并没有开电灯。这是我初步的一个经验，我再补充说明一下，谢谢诸位。）</p><p> （崔公：老师、各位道友，既然老师指示要我报告观白骨的经验……就是我在前年打七的时候，是第一次来参加打七，很多老师给我指导。因为我以前是练过**功（？），所以，那个时候我是守窍，守丹田、守中宫。在打七的时候，那个气太冲了，使得我的头脑、后颈跟麻木了一样，所以我就不敢再修下去。我去请示老师，老师就叫我观白骨，就是从左脚拇趾开始。那时候想：老师教我把这个气往下去、往下去……头稍微有一点清醒。</p><p> 我开始观的时候，开始从左脚大拇趾开始观起，就是系心一念地念着，系心在脚趾上面。一开始观的时候，我觉得大拇趾就发热，慢慢地……我想是经过了很快的时间，这个骨头没有了、化了，第一个是这样，第二个（也）慢慢下去，再就是右脚，一直到上面的小腿、大腿，我就是照老师所指示的，慢慢到髋骨、到脊骨、背骨。那时候头清了，甚至是气脉往下降一些，但是还是很胀。</p><p> 所以我观白骨的时候，就假设自己把我的头砍下来，砍下来放到我这个胯骨地方，这个样子守着之后，头比较清醒，这个样子……再以后，就觉得自己的身体很空、很轻松、很柔和。这是说我白骨观的经验，很粗浅的，向各位报告。）</p><p> 谢谢。现在，由他们两位修过的老前辈报告，回转来，向大家特别提出注意，希望这次讲了有点用处；大家如果听了没有用处，当成听学问、当成学理一样，对修持做工夫，身心没有用处，就是白讲了。当然，白讲无所谓；白听啊，你们很可惜，浪费自己的宝贵时间，没有用的。</p><p> 现在回转来讲，每一个修法上提到“更教系念”，或者是“更教系念一处”，那么……</p><p> ，……是问题。道理在哪里？你要注意，初步的白骨观观起来——到了二三步，佛已经告诉你，白骨观成了，内脏都空了，到这个时候有两个方便：一个是系心在这里，额上，不是道家讲的什么山根，不是眉毛中间的印堂，系心额上。就是我们看塑的佛像，这个地方有颗珠子，或者有些神像塑的三只眼睛的这个部分。系心在这里，不是叫你守窍，就是观这里的白骨“白如珂雪”，或者是透明琉璃体。</p><p> 有一点要小心啊，有些人身体气脉好，业力轻的，修到相当的时间，一观这里以后就看到东西了，有时坐在这里，你看家里的事情，清清楚楚；或者你看美国的事、看哪里的事，清清楚楚；或者看别人的事，清清楚楚——会有这个境界发生，千万不要去玩！一玩就变成修天眼通、千里眼去了。那么，你对修道的进步，以后从此停住了，就会玩这个眼通去了。停住了以后，不是这一生，一停留要很多生都转不过来！所以千万不能玩！有这些境界来，看到山啊、看到水啊、看到鬼神啊、看到……一概不理！你还是观你是白骨，那些境界自然化掉。</p><p> 当然，普通人有时候没有这个定力，或者有些害怕的境界来，或喜爱的境界来，那么，你（想）要把境界变去，变不了，心念力量没有那么强，最好念《心经》！也不要念什么咒子啊念什么，多念《心经》绝对有效的，《心经》本身就是咒子！这是一个方便，佛教我们观这里。</p><p> 第二个方便，他教我们观胸骨这里，就是塑的佛像胸口有个卍字的这个部位，男女都一样。</p><p> 所以，我们上面的白骨观观起来，白骨化空了，有人……譬如刚才焦先生、崔先生也讲到，身体觉得空了，既然空了，为什么还有这个部位呢？这个依处？就是说，没有肉体的感觉了，也没有骨头的感觉了，大概的意思就是：灵虚的，这个位置就是一点白光，或者透明白骨化光、定住，这个是定住，系心一处，念头就……</p><p> 你要晓得，当我们系心在一个地方——大家普通人也是一样嘛，不要说修道。我问诸位，你们念佛的也好、修道家守窍的也好、修什么……你们是不是主要的修一个念佛或者守窍，修在那里的时候，其它的思想还有没有？照样的有。那么，所谓修道，大家最苦恼的是什么呢？碰到这个情形，就感觉到，自己最痛苦（的是）这些乱七八糟、来来去去的杂念不能断，对不对？大家忘记了一个事——这是基本的渐修小乘观法——你系心一处以后，这些杂念思想来同你没有妨碍吧？（对）观那一点没有妨碍吧？没有妨碍，既然没有妨碍，你为什么受这些思想来去的烦恼呢？这不是自己找麻烦吗？！</p><p> 第二点，在这个时候，你可以了解到此心本来可以同时两用、此心同时可以三用，再定力越深了，此心可以同时千百万亿用！定境界还是有，那个意识在这个定境界，其它杂念妄想都有，然后自己还在讲话、还在推理，自己觉得很讨厌：哎！我这个境界蛮好呢，蛮高明……哎，就是许多的游丝杂念，格老子就是去不了啊！这些游丝……一想，我想些什么游丝杂念呢？哎呀，某人的帐没有还，或者冬天（买）毛衣到哪个地方便宜……可是这里还在看到这里，会不会这样？哦！</p><p> 那么，你把这个东西转过来——这个作用是不能压制的哟，压制（的后果）是两种，一种是脑子变白痴了；一种呢，或者你压久了以后，拼命地用心，血压高起来，疯了，脑力不健康；或者本身有毒的，乃至于先天性的梅毒——受父母的遗传，不是讲任何人的父母有梅毒啊，这有隔代的遗传，母亲系统或者父亲系统，上一辈子的哪一方面不知道哦。那么，梅毒在脑，你用心就用脑，一进入脑，疯了。所以，只有白骨观清理了内部，清干净了，倒是可以去掉。</p><p> 你要晓得，有许多病症不但这一辈子在身上去不掉，乃至还有遗传的作用，唯有白骨观真修到的，这些才都去光。所以，能够证果是在这里。靠自己心念的力量，药物是去不了的。</p><p> 那么现在，讲到白骨……所以下面的原文都不讲了，看过都知道了，讨论这个地方……这个地方是完全叫你去用理观了！系心一处，还是这个白骨。那么，你用理来观，不怕你用妄想，你把所有了解过的经典，反反复复再看，把理参透了，也就是孔子所讲的“穷理尽性以至于命”，穷理就是参究，穷理参究到极点，所以明心见性。然后可以回转来，把握自己的生命，可以自己做生命的主宰。</p><p> 其实，所有的修法，在中国文化，孔子这一句话讲完了，“穷理尽性以至于命。”</p><p> 但是，孔子讲的“穷理尽性以至于命”也包括了小乘与大乘，大乘也包括了禅宗的穷理、参话头等等。</p><p> 现在，渐修的法门，系念这个地方（后），然后都是穷理。平常对佛学一点基础都没有，乃至尽管讲是学佛——不管在家、出家都一律平等。自己的那个佛学知识不连贯，鸡零狗碎的，你说他不懂嘛——满口佛话，名词都会。这个理透了没有，譬如一本普通的书，《五蕴论》就没有好好研究，《百法明门论》也没有好好记得，一提到这些东西，实际修持……。</p><p> 譬如，大家喜欢看《楞严经》，《楞严经》的五阴修法、解脱法记不住；乃至三十七道品整个的理论性，所谓声闻乘的三十七道品怎么修、缘觉乘怎么修、大乘怎么修，都不知道。名词都会讲，一问他三不知。动不动就要修密宗啊、显教啊，一来把自己看得很高，都在造业；不但在造业，在发疯，已经着魔了，（自己）不知道。</p><p> 那么，爱着魔的人有什么办法，魔也是人做的嘛，他去做做魔也不错，转个三大阿僧祇劫再来嘛。</p><p> 所以，要真想搞清楚，这里完全用教理来破。教理破到极点，理穷到极点，也就是刚才焦先生跟崔先生所讲，身体到达四大空了。空了以后——这一节完全是思维修哦。</p><p> 所以，什么叫禅？我们现在一提禅，因为中了唐宋以后禅宗的毒，“禅那”，禅那就是菩萨道六度里的一种，禅那应该翻为思维修。那么，后来的有些翻译叫“禅修”，乃至叫“禅定”，乃至后来（有）禅宗了以后，单称一个“禅”，顾名思义，都是以思维修的四禅八定为基础。</p><p> 所以，这里所讲到的（是）初禅定境界的这些东西，系念住就是念住，初禅制心一处。那么，到这个时候，系念住了以后，加上正思维修。</p><p> 所以，在座有几位同学、在家居士修的非常好，但是我在他日记上批他没有确实下过工夫，他光在穷理，你的错误（是）光在穷理，没有系心一处，所以证果很难。那么，有些人修道家，或者其它的方法，光在系心一念，没有配合穷理，没有正思维修，所以也不成功。这两个（如）车子两轮一样，一边要修持……。</p><p> 所以，修持的开始，就怕你思想知识多了是个大障碍，障碍大得很，简直进不了门；你真到了定境界或者悟境界，就怕你知识学问不多，越多开发得越大、越快。所以，这个道理在这里。</p><p> 那么他说，叫我们到这个时候，把四大地水火风都观空了，中间有一句，就是第九页第二行，“不见身内诸龙，耳中所有诸风，悉灭不现。”到这个时候身空了，身空了，你身上的龙——本来看到自己身上的龙出来了，到这个时候龙没有了；而且每个龙的耳朵里头出气，到这个时候都没有了。假设给没有修持过的现代人看这个书……，所以，这个法门永远（被）埋没是应该的，这些翻译用的词句是有问题，用两千年（前）比方的东西，是有问题。身内的龙是什么呀？就是血脉，身上一条一条的血脉。</p><p> 所以，到这个时候，不但呼吸停止了，脉也住了。所以气与血完全宁静，定到极点，“身内诸龙”，龙耳朵里头都不出风了，是这个道理。如果真看到身内有只龙，我们这个书不要看了，我身上没有龙，一条虫也没有，何况龙，绝不干的。这是一个比喻名。注意，龙、虎都是身上作比喻的。这个道理我们先要了解了。</p><p> 所以，这一观完全是穷理的观，理观。这个叫第十五层四大观，破身见。</p><p> 我们到这里，先提前三分钟休息一下。因为下面的观法，把上面十五个层次一起连起来了，整个的观法，第十六蛮长的。</p></div>"
},{
    "title": "禅秘要法讲座 14",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> <strong>【佛告阿难。汝今至心受持。此四大观法。慎勿忘失。为未来世一切众生。当广演说。尔时阿难。闻佛所说。欢喜奉行。作此观时。以学观空故。身虚心劳。应服酥及诸补药。于深禅定。应作补想观。补想观者。先自观身。使皮皮相裹。犹如芭蕉。然后安心。自开顶上想。复当劝进。释梵护世诸天。使持金瓶盛天药。释提桓因在左。护世诸天在右。持天药灌顶。举身盈满。昼夜六时。恒作此想。若出定时。求诸补药。食好饮食。恒坐安隐。快乐倍常。修是补身。经三月已。然后更念其余境界。禅定力故。诸天欢喜。时释提桓因。为说甚深空无我法。赞叹行者。头面敬礼。以服天药故。出定之时。颜色和悦。身体润泽。如膏油涂。见此事者。名第十六四大观竟。】</strong></p><p> 现在，这个十六观的开始很重要，希望大家自己要多留意注意一下。我看，我来念这一段，很重要啊。</p><p> “佛告阿难，汝今至心受持此四大观法，慎勿忘失。”我们看佛经很容易看过去的，（要）一个字一个字看到心里去，仔细研究一下。</p><p> 佛同阿难讲，你现在应该至心诚意，非常诚心——“至心”就是尽心，就是儒家经常用的两个字，孟子所讲的尽心。要尽心接受，“受持”，“至心受持。”</p><p> 因为我们看惯了佛经，这四个字又容易懂，尤其敲木鱼一念，一下就把它念过去了；或者看书，一晃就过去了。如果你是个读书留意的人，一看，有时候毛孔里钻出一个”悚然”来，这四个字我们就不容易做到。</p><p> 要尽心接受、尽心去修持这个“四大观法”，千万不能忘记，“慎勿忘失”，你千万不能“忘失”，忘记了。“忘”是忘记；“失”是失念。有时候自己就莫名其妙起来了，有时候自己就聪明起来了，就跳出来玩了，跳出方法了，这都是失念，一点一点的，层次搞不清楚。</p><p> 所以，“至心受持”，“慎勿忘失，为未来世一切众生，当广演说”，为将来的人，要修持、修道、修持佛法的（人），应该不需要保持秘密，普遍告诉人家。那么，我们用白话记录，这个经典就是这样子。</p><p> “尔时”，讲到这里，“阿难闻佛所说，欢喜”，当然高兴，“奉行”，照着这个法子来修。</p><p> 下面重点告诉大家，“作此观时，以学观空故，身虚心劳”，你修白骨观还没有关系，真修空观的人，身心证到了空——不是你意念的空，你的感觉还在，觉得身体还在这里打坐，身上的气脉动还知道，那不算空；虽然你意识上观空，你并没有空。</p><p> 就是刚才崔先生同焦先生所讲的，他们两位年龄比较高一点，而且，因为人生的经验，经过的太多，所以一修道（就）很诚心地做，所以他们有空身的经验。当然，并不是随时随地，好几次这个身体没有感觉了。</p><p> 他说，真做到空心观，有时候自己都找不到自己了，当然没有白骨了，白骨已经化开了，觉得开眼、闭眼，自己觉得不晓得在哪里了。不是不知道，知道在空境界中。</p><p> 乃至有所成就了以后，那就是最高的隐身法，就是人家到这个房间看不见你了，没有、空了。当然，到这一步，那已经（是）很成就了的人了，很少的。</p><p> 普通觉得，身体做空观久了，“身虚”，身体感觉到很虚弱——你们一定有许多同学来：怪不得我这两天好想睡觉啊，一点力气都没有……你那个是懒啊（众笑）、是感冒啊、是有毛病啊，那个“身虚”不是这样。</p><p> 我告诉你经验，我修持曾经到了——自己晓得没有病，一张纸（都）拿不起来，两个指头拿一张小纸，还没有这么大，就是拿不起来了，会那么掉下去了，“奇怪，我有毛病？”硬拿不住，再次拿起来（又）掉了；拿只笔想写字，拿不动了，就掉了……很多的经验。</p><p> 普通人到这个时候，害怕死了，以为病了。尤其现代的人，医学常识非常多，赶快打电话找医生检查，检查起来也许有病，也许没有病。那么，在我呢，许多经验里头……自己也喜欢看医书，自己把中医、西医都摸。这个时候不管了，一个观念：要走，现在走了也好，一切都了，免得啰嗦，留此身在世间没有用；不过呢，我也晓得这是个过程，再给它一定，就回转来了。</p><p> 那么，那个回转来的时候啊，你拿东西，两个指头捏一块铁，算不定两个指头一按，好像都把它掐扁了。所以，变化很多。这个是“身虚”的一种情形。</p><p> 有时候“身虚”的经验告诉你们——像你们现在一班的老朋友们，到这个境界就会害怕。我经常告诉你们，（我）二十几岁的时候，有时候走路觉得自己昏头，觉得自己已经颠倒着走，头在下面，脚在上面走路，这个意思怎么说呢？自己觉得，一边在走一边在转，天旋地转。你们现在有现代知识：哎呀，血压高了，不得了！我啊，那个时候的环境也有关系，你不得了，也没有人理你啊，你喊爹、喊妈也没有用啊，照样地走啊！</p><p> 假设死在路上，死在路上怎么样呢？想到两句话，梁启超有两句诗，“求仁得仁有何怨，老死何妨死路旁。”死在这个路边……大概，我也想到，那真是……那个时候自己还不修这个白骨观哦。死在路上，大概下一步，就有好心人拿个草席或者给你盖一下；再不然臭了、烂了，大概狗来就东咬一块、咬一口，拖走了。都把它想清楚了，照走不误！没有事了，就“咕咚”一下，头上的通过，照样精神很好啊。噢，我说：原来这个玩意骗人！怪不得啊，许多人说走火入魔，你心、胆子小，没有以生死意志修道的精神，你不要谈了。</p><p> 后来，有时候走路，譬如有一段（时间）爬楼梯，腿就拿不上来，不像现在我在这里的十二楼，跑上跑下……我有一次试验，送人等电梯，结果客人下去了，电梯还没有上来，我说：算了，我走路，“嗖……”转下去，等我下到楼底，电梯还刚到呢。现在反而是轻灵。那时觉得腿关节拿不起来，好像中风了。</p><p> 这些现象，都是你用功过程的“身虚”。有时候觉得两个腿一点力都没有了，走路下楼梯觉得怎么样呢，这一脚踩下去还有力，或者是这一脚，或者发生在哪一脚不一定，这一脚踏到楼梯根本没有力量，人会溜下去。那么，两边也没有楼梯没有扶手……那么，平常还是练功，年轻练过一点武术有好处的，我干脆手就准备好，万一溜，后面一抓，就是手臂一搭，搭住，慢慢溜啊，把背骨节不要敲断了。诶，可是结果下去没有事。当然，这个时候我不常走路，这个腿拿起，晓得踏下去不是腿，等于什么啊？等于这样，没得力的，没得筋了，没得骨了，那我不踏下去；哎，要（是）踏下去，人整个就倒了，那不得了哦，背脊骨在楼梯（上）靠一下就断了！人是垮下去的……我怎么办？一只脚还有力，我就站着，把这个脚蹬个斜叉，这么吊住，大概吊个把两分钟，诶，它好了，“咚咚”跑了。不惊、不恐怖、不诧异。</p><p> 所以，真做工夫的经验很多了，讲到这里告诉你们这一点，“身虚”就懂了，大概如此。</p><p> “心劳”更难懂。“心劳”，你胸口这里，好像心脏病发了一样，劳到什么程度？觉得睡眠的时候、打坐的时候、平常的时候，觉得这个心脏掉下去，心脏觉得“啪嗒”一下掉下面了，掉到哪里去也不知道，到肚子、到肠子？不知道，反正觉得一个什么“啪嗒”……。所以中国古人形容，“心劳日拙。”</p><p> 还有，心理的思想，任何情绪、思想都不想动了。“心劳”不是灰心哦，（是）不敢动。思想没有力气了，不是身体没有力气。你们大概也许有这个经验，你们自己不懂。人有时候自己对自己，思想没有力气想了。这个时候啊，你就是骂我是个什么什么，祖宗王八蛋……什么都骂完了，也不会动念，呵。什么原因？累得很，就是“心劳”的现象。</p><p> 那么，心脏跟着虚弱了。这个时候如果你怀疑的话，也许可能去检查一下，也许心肌闭塞呀、什么心脏扩大，这些情形都会有。所以，这个时候你去检查，一检查了以后，“哎呀，我有病！”真有病了！</p><p> 我的经验……，所以到现在，我的西医朋友那么多，我也没有进过医院检查身体。只有他们那几位医生来测验打坐，把我搞得冻了几个钟头，那位陈先生他们四五个来，把脑电波（仪）带上、心电图（仪）给我装上，然后叫我衣服脱了，我以为脱了就一下下嘛，结果搞了我两个钟头，冻得半死……先叫我躺在床上，“普通人一样。”“好好，普通人一样。”最后我说“弄好了？”“弄好了，你坐起来。”只要听他们的，坐起来以后说：“你现在做你的工夫……”做工夫，“哎，你现在不要做工夫……”就不做工夫。哎呀！我就给他们折腾了两个钟头！</p><p> 我平生有一怕，怕进理发店，（那是）人生最倒霉的时候，他叫你“矮下来。”（众笑），（我）就提起来了。我一生怕人指挥我，碰到理发师我是投降，就怕他指挥我。所以，我理发，每一次二十分钟。一个人给我理发几十年，他晓得，“夸夸夸”几下，（要）低下来，他也不敢叫我低下，差不多我就低头了，差不多我又抬起来了，他照我的路线来，结果受他们……</p><p> 所以我不检查的。你要碰到这种情形，一检查，你心念不坚定的，你身体立刻就病了！其实没有病也搞病了，唯心造，病由业生。所以，现在再三地告诉你四个字，不要轻易看过去，做空观的时候，“身虚心劳。”</p><p> 那么要营养了，所以佛准许比丘吃三净肉。“应服酥”，补品，酥油，“及诸补药”，这个“诸补药”包括很多了。所以，讲比丘戒律，因得病、因为修禅得病，吃荤做药想不算犯戒。当然不要借故，说：我因为在十一楼打坐嘛，所以现在吃一点啊，这个没有关系，呵……。这不行了，戒与不戒，犯与不犯，（是）你心念的问题。如果真的需要，并不是心念贪这个口腹之欲，是必须的，没有办法，否则你工夫不上路。</p><p> “于深禅定，应作补想观。”</p><p> 注意呦，在座的老年朋友，今天给你们传一个真正的法，可以祛病延年。我们晓得，要修到长生不老，在道家有三种丹法，天元丹、地元丹、人元丹。第一，想修人元丹——你们在座的很多都是学道的，不管你正道、歪道，反正总是道吧，道者就是路了，总有一条路走。人元丹就是本身的精气神，炼精化气、炼气化神，精不能化气，所以密宗、道家，有南宗的双修啰、北宗的单修啰等等，都是为了使精能够化气。炼气化神修完成了，这还不过是人元丹的成就。人元丹的成就，纵然你出阴神也好、出阳神也好，还不过是人中之仙。这是讲道家的学术系统给你们听。</p><p> 其实，你们学佛不要看不起人，“那是外道。”哎呀，我从来是看哪一种道都看得起的。管你什么外道、内道，他修到这个样子，已经比我们好多了！你不要吹了，你是正道，你正到哪里去啊！？对不对？一个土地公公比我们还好多了，我们死了，土地公……算不定还被土地公管起来，一天要打三百板屁股的那个样子，不好办啊。这个人元丹的成就是人。</p><p> 那么，要进一步变成地仙呢，就是地行仙，《楞严经》上也提到，庄子、列子所谓“飞空无忌”（？），身体可以腾空飞得起来，这还属于地行仙。</p><p> 那么，这个地行仙，譬如说，我们佛教《高僧传》上，有个万回师，唐明皇的时候有个和尚，很有名，苏东坡的诗上也经常提到万回师。他平常是傻里瓜唧看不出来什么样子，穷兮兮、烂破破、笨巴巴的和尚，可是连皇帝都尊重他，因为晓得他有神通，得道的。</p><p> 那么，为什么他名字叫万回呢？他经常给人家做好事，那个时候没的邮政，看到有些孝子出门久了——隔好几个省哦，不是基隆到高雄那么远，总有四五个台湾那么远。说“想母亲……”“哎，你写封信，我给你送去。”说：“没有人啊？”以前没得邮政，唐朝、宋朝（时）送信都要托人顺路地带，所以，好几年难得有一封家信。</p><p> 万回师说：“你写封信，我给你送去，你妈妈现在正在家里想你呢……”因为他有神通，他知道，那个人不知道。他晓得他是孝子。“你也想她，这样了，你写封信，我给你送。”写了信交给他，路上要赶好几省……譬如像美国吧，西部跑到东部，坐飞机还要六七个、七八个钟头呢。他上午去了，下午回信来了，所以叫万回师，一天万里可以来回。</p><p> 像这一类呢——他是佛家啊——是道家修到地仙的境界。地仙境界这么来的？地元丹怎么样呢？地元丹要懂得各种药，五金八石之药。</p><p> 譬如在佛法，龙树菩萨有许多药方藏在龙宫里头。那么，唐代的孙思邈，那个医学的大师孙思邈，那么，他是一个修道家的，也学佛，两方面都来的，是个名医。</p><p> 说孙思邈有名的（故事），他在山上住，有一天走在路上，老虎在他前面张开大嘴——（若是）我们吓死了，因为孙思邈是修道的人，医生，他看到老虎这个样子，凶得很，张个大嘴……他说：“你要吃我啊，就来吧，我学佛的人，就布施给你了，你来吧。”老虎也不懂，也不扑过来，嘴还是张着。他说：“奇怪，你又不吃我，你有求于我嘛，你就点头。”那个老虎就点头，他说：“哦，大概找我医病。”跑去一看，嘴里别一个刺，不晓得吃人啊、吃什么，一个刺撑在牙齿上，嘴合不拢了。孙思邈：“呵，这样啊，好了，你张好，不要咬我啊……”所以拿个药箱出来，就把这个刺给它拿掉。那个老虎点头，就趴下了。他说：“你要我骑在背上啊，你带我到好地方去啊？”老虎点点头，另外给他找了一个很好的山洞。</p><p> 所以，孙思邈医可以通神。后来感动有病的龙王来找他了。龙王不像这个老虎，一天，白面书生找他看病。孙思邈一摸脉，他说“我不看了……”医书上有话，“六脉平和，非仙即怪”，不是神仙就是妖怪。“……你这个六脉平和，可是里头……你究竟是仙是怪，你给我讲清楚了，我再给你看，你不要骗我。”“我给你讲老实话，我是东海龙王，龙身。我这个病啊，非人境界里头看不好，你是人世间的名医，所以请你看看。”他说：“好，这样……。”看好了，龙王要感谢他，“要什么？”他说“没有什么。”“你接我到龙宫去玩玩？”他说：“那不太方便。”“哎，龙树菩萨有修道的那个药方，放在你龙宫里头，这个你给我拿来总可以吧？我们两个人做好事，不传之秘……”所以，孙思邈的许多方丹里头，看着里头……你们读孙思邈的医书很难找出来，他有时候故意把那个方丹……有修长生不老之法的药，有的，这是龙树菩萨所传的。那么，这是地仙。所以要懂得医学、药。</p><p> 天仙呢，天元丹难了。天元丹，道书，道家思想来讲，“从虚无中来”，从空中掉下来。诸佛菩萨、修成功的神仙……你这个人真的功德到了——功德，当然，你不要认为自己念念经啊、学个佛啊，就有功德，谈都不要谈。（要）利世利人！你们不但不做利世利人的事，都做害人害世的事，还有功德？！哪里有德呀！要利世利人，所谓“三千功就，八百行圆”，那么，有这个善果，（丹）自然下来。下来（后）从哪里吞下去？从这里吞下去（师示），不会从这里来。</p><p> 那么天元丹，现在你们年老的人，要想修天元丹的法子，要想健康长寿，赶快走这个第一步，我把这些秘密都告诉你们了，好好去修，到中年已经……不过，要多做好事啊！不做好事，你叫外科医生来，这里打个洞都没有用，它也不会掉下来的。</p><p> 现在，讲到这里，说“应作补想”，不吃药，这里是从天元丹来补身体。“补想观者”怎么修呢？“先自观身，使皮皮相裹，犹如芭蕉”，你先要管到身体——白骨观已经做好了，骨头没有了，内脏都没有了，身体就是个绸子的、透明的、尼龙的一个皮袋一样，还要通气的，乃至不通气也可以，透明尼龙皮袋一样，“皮皮相裹，犹如芭蕉”，什么叫芭蕉呢？你们做什么解释啊？王**……你们哪一位青年同学解释，怎么如芭蕉啊？观到自己圆圆的、一坨发绿的？芭蕉树芯扒过没有？中间空的，空心的。千万不要把自己观成芭蕉树一样，又发绿、又发青，这里还长几个叶子，哈哈，那变成吕纯阳的那个杨柳神了，要观到中空……。</p><p> “然后安心，自开顶上想”，开顶，先讲到这里，你自己做观。</p><p> 再“复当劝进，释梵护世诸天，使持金瓶盛天药”，或者你就干脆至诚皈依佛法僧、皈依南无大慈大悲救苦救难白衣观音菩萨，虚空里站着，净瓶，把无价宝、无上的药，用净瓶水灌下来，到顶。所以密宗叫灌顶的一种；也就是西方文化把佛法的灌顶一变，变成洗礼，所谓受洗，受洗也是由灌顶变的。那么，持这个“金瓶”盛着“天药”灌下来。</p><p> “释提桓因在左，护世诸天在右，持天药灌顶。”“释提桓因”是印度的称呼，在中国即玉皇大帝，上帝站在左面，“护世诸天”，二十八宿这些天神站在右边，中间是观音菩萨净瓶给你灌下来，“持天药灌顶。”</p><p> 然后感觉到……真到了那个境界，自身除疾（？），尤其在病痛苦中的人，要注意，生病的老年人身体。这个时候，“举身盈满”，慢慢觉得由顶上灌下来，头顶发清凉，一身都是清凉、发暖，充满，慢慢慢慢，晓得充满了。</p><p> 要“昼夜六时”，白天夜里，“恒作此想”，常常做这个观想。昼夜六时，我们中国古代是一天一夜十二个时辰，就是昼夜在定中，做这个观想。那么，这是自己精神……。</p><p> 换句话，我们借用道家的方法，你们大家现在打坐啊、练气功啊，那是修气；有些人引动气脉，像瑜伽术啊，那是修精；这个是炼神、修神。如果懂得修气、又懂得修神、又懂得修精，那就快了，更快，成就得更快。</p><p> 所以，叫你修这个定境界的观想。真到那里入定哦，那么此身与观音菩萨，或者你与药师如来合一了，到那个境界，无妄想，清净自在。</p><p> “若出定时，求诸补药”，出定以后，还要外金丹需要，还要好饮食。</p><p> “恒坐安隐”，因此你打坐起来，不想下座了，身心都舒服到极点、平安。不是稳当的“稳”，这个字没有印错，佛经都用这个“隐”，隐就是你一切的妄念、杂想、烦恼沉没下去了、退掉了、退化了、没有了，“恒坐安隐，快乐倍常”，精神快乐。</p><p> 如果修这个法门，“补身，经三月已”，然后再求进步。</p><p> 佛这一部分传你的修法，是放在第十六观的初步。实际上，修白骨观的人，中间有时候碰到病痛，修不上路了，赶快求忏悔，拜佛磕头求忏悔；可以中间插进来修这个。</p><p> 所以，修三个月以后，“更念其余境界，禅定力故”，你有这个禅定的功力到了，“诸天欢喜”，于是（到）天人合一的境界，跟天人两个相接。所以，儒家用庄子的话，“天人合一”，那是理念上的理论，这个是实际修天人合一。……“时释提桓因。为说甚深空无我法”，……说法，自然听到，最深的“空无我法”。“赞叹行者，头面敬礼”，乃至，你定力高了，天人都向你礼拜。因为你吃了“天药”，这个天药是哪种药？你看，完全靠用自己的定力，心物一元，要观想，瑜伽而来，什么叫瑜伽？相应、感应现在成就的人，诸佛菩萨等已经成就的。因为你的念力坚强，不是你的妄想，是你的感应来。这种药无所名，故曰“天药”。</p><p> “故出定之时，颜色和悦，身体润泽，如膏油涂”，所以，这种人出定以后，颜色光明，和蔼喜悦，整个的身体几乎是湿润的，等于滑的、柔软的。“见此事者”，这里所谓“见此事者”，要真实见到这个境界的，叫做“第十六四大观。”到这里，先把它观空，然后要求身心的健康。</p><p> 我们在座很多中老年的道友们，特别注意一下，如果你以白骨观为基础，到这一步，那么大家留下来，多留几年，好好玩玩，（回归）大陆以后嘛，你再上山也好，涅个盘也好，那个时候再说。绝对心境如一。</p><p> 你要晓得，在密宗求到这个法也很困难哦，花多少钱……那个叫修长寿法，不过是加上些咒语、加上些观想。</p><p> 这里，你看这个《禅秘要法》里头，把宗教的外衣几乎完全脱掉了，这是释迦牟尼佛的教法。释迦牟尼佛的教法把宗教的外衣统统脱掉了、丢开了、不要了。释迦牟尼佛提到宗教性的、神秘性的，他马上消失，譬如，一提到神秘性的秘密部分，往生西方世界阿弥陀佛那里，再不然去其它的上方世界、各方世界，不空如来那里，他把你带着去修行。他本身所讲的观法，在这个世界是合于人文文化的。</p><p> 你看，就是这（本经）里头，也用到龙啊什么的，太少，四分之一都没有，他这里给你讲的，都是实实在在，在人文文化里切实的。可是，只是在这一步的观法啊，他也只是告诉你这些观法的道理，也就是方法，绝不叫你做另外一个观想啊，也不叫你念一个什么咒子，也不叫你做些别的东西，你的心力直接就可以做到了。所以，这一段很重要，中老年以上的道友们特别注意这一步……。</p><p> （同学：……）中脉，密宗是讲中脉，不错，我已经再三再四讲，修白骨观（是）把气脉都丢掉了，白骨上没有脉啊，对不对？（同学：……）理念上，你硬去配合，可以啊，它中空了。修密宗，修到色身修成，那很困难啦，由欲界的欲乐定这一切等等，修到色身完全是个空囊，中间有三脉七轮，还有东西，空完就到了。这是释迦牟尼佛亲传的更进一步的方法，连三脉七轮都不谈。你说：“那个作用在他当中了。”那还可以说；你如果有一个观念说：“这个样子是打通中脉了。”那不是白骨观的修法，加上气脉观念……你懂吗，这个中间的因明逻辑是不能够混淆的，了解了吧？</p><p> 好像下面这一段长得很，是综合前面十六层层次的。</p><p> <strong>【佛告阿难。此想成已。复当更教系念。住意令观外色。一切色者。从何处生。作此观时。见外五色。如五色光。围绕己身。此想现时。自观身胸。胸骨渐渐明净如颇梨镜。明显可爱。复见外色。一一众色。明如日光。得此观时。四方自然生四黑象。黑象大吼。踏众色灭。如是众色。在地者灭。于虚空中。玄黄可爱。倍复过常。尔时大象。以鼻绕树。四象四边。欲拔此树。不能倾动。复有四象。以鼻绕树。亦不能动。</strong></p><p> 尔时行者。见此事已。出定之时。应于静处。若在冢间。若在树下。若阿练若处。覆身令密。应当静寂。更求好药。以补己身。如上修习补身药法。复经三月。一心精进。如救头然（燃）。心不放逸。于所受戒。不起犯心。昼夜六时。忏悔诸罪。复更思惟身无我空。如前境界。一一谛观。极令明了。】</p><p> 先到这里啊。现在，观到这个观空而进补的，对身体的恢复健康——拿道家来讲，就是返老还童修法的一种。他说，到了上面这个观想修成功，再进一步，还是“系念”住，这是一样的，那是“观外色”光。密宗也有这个修法，不过密宗繁琐，释迦牟尼佛的教授法都不同，把那些神秘外衣都剥掉了，不加上那些神秘的观念。</p><p> 他只教你唯心地观想，“令观外色”的光，自然界外色的光，外色就是色界，色界天，大自然里。</p><p> 那么，先观色，“色即是空，空即是色”这个理搞透，一切色皆是空，然后，才可以观自然界的外色光。</p><p> 那么，你的定力到这个时候，你眼睛闭眼也好、开眼也好，自然看到——我告诉你，看到什么：自然界光分子在活动，你都看得很清楚，每个光分子在跳动，你都看得很清楚，开眼闭眼都一样。</p><p> 然后，看这个光里的光分子，“五色”的光华，乃至有七彩的光，包围了自己的色身，乃至通过了自己的色身。这是由借自然光，包围了身外，甚至于通过了自身。</p><p> 那么，渐渐看到“身胸胸骨，渐渐”，到这里，就是胸口这里，一点一点，这个模型看得很清楚，犹如玻璃一样“明显”，非常“可爱”。</p><p> 再看“外色，一一众色，明如日光”，在这个光色观的里头，你们注意哦，有时候我教过你们小小的看光修观。做光的观……，你这个人伤风了、有病了，或者有灾难、有不好、有魔障了，眼睛闭眼开眼中就有黑点了，黑点很糟糕了；红点是冒火、绿红就很糟糕了；蓝有晦；青，天青色那个最好，白色如金光，自然看到。这是重点给你讲。</p><p> 他这里讲，你做这个光的观法，自然会碰到四面好像有黑的东西、黑影子过来，在这里叫它四头“黑象”，很大的黑影。会把一切光色灭了，变成黑暗。但是，灭了以后啊，你自性，觉得内在的光色更增强、更空，“玄黄可爱”，就是发金色，金色里头稍稍有一种七彩的淡淡金红。</p><p> 所以，我们中国人说神仙……西方人的神仙都是粉红色的，那是西方文化的神仙境界，也就是中国文化所讲的桃花色。中国的神仙境界稍微不同，不过都很美。</p><p> “尔时”，看到这个黑象用鼻子夹这个“树”，这都是形容看到黑影子碰这个四大。</p><p> 那么慢慢，出定之时——到这个境界，或你不用功的时候，在出定的时候怎么样？应该找一个地方闭关了，这个时候是闭关了，静修。或者到坟堆上，四面都是死人的地方，人口寥落鬼可多的地方去修；或者修头陀行，一棵树下打坐；或者住在清净茅棚，修道场。</p><p> “覆身令密”，把房间封了，一点空气都不透的，窗子统统要封掉。一进去关房以后，四面不通空气。乃至身体脱光了，只用被子盖着，温度要调整得很好，盖着了，一点风都没有。这个时候必须要更好的药，所谓丹药来进补，还要加上观想的“如上修习补身药法”，经过三个月，“一心精进，如救头然（燃）”，这四个字，年轻的同学们懂吗？老辈子都懂，什么叫如救头燃？好像救自己的头一样，对不对？“头燃”，头发烧起来了！燃烧的燃。你自己的头发烧了，被火烧了，快要烧到头皮，脑要烧坏了，你赶快抱着救啊！就是说，如救头燃，你这个时候用功，一心精进，心境要跟救命一样！一点都不能马虎，一点都不能松懈！说原谅一下自己：哎呀我休息一下再来——不可以了，要如救头燃。“燃”字是火字旁的燃。</p><p> 然字本身下面有四点，在中国字就属于火字旁。“然”字本身就烧起来、燃烧的意思。那么，后来越来越不懂了，中国人越不懂中国文化了，然字也不懂，“然也”，以为是不相干的虚字。然后，燃烧怎么办呢？旁边再加个火，下面一把火，旁边一把火，那就烧起来了。所以，你们现在旁边加一个，如救头燃，那就懂了。懂古文的人，看到这个（然）字就晓得在烧。</p><p> “心不放逸，于所受戒，不起犯心”，绝对要清净，不犯任何起心动念，起心动念都不可以犯戒，身心是一味清净，所以，再进一步，就是一味清净。</p><p> “昼夜六时，忏悔诸罪”，这个时候，昼夜只有忏悔自己过去生，你自己还不知道做了些什么业，一切忏悔。</p><p> “复更思惟身无我空”，再观自己色身空的，无我的，同前面所讲的境界一样，“极令明了。”</p><p> 好，你再念下去。这一下大家自己注意啊，看书。</p><p> <strong>【此想成时。胸骨渐明。犹如神珠。内外映彻。心内毒蛇。复更踊身。腾住空中。口中有火。欲吸摩尼珠。了不能得。如前失舍。自扑于地。身心迷闷。望见四方。尔时诸象。复更奔竞。来至树所。时诸夜叉罗刹恶兽诸龙蛇等。俱时吐毒。与黑象战。尔时黑象。以鼻绕树。声吼而挽。象挽树时。诸龙夜叉。吐毒前战。不肯休息。</strong></p><p> 尔时地下。有一师子。两眼明显。似如金刚。忽然踊出。与诸龙战。尔时诸龙。踊住空中。象故挽树。终不休息。地渐渐动。是时行者。地动之时。当观此地。从空而有。非坚实法。如此地者。如乾闼婆城。如野马行。从虚妄出。何缘而动。……】</p><p> 暂停啊。到这个境界，你们都看到了啊，这些境界可能都会出现的，就是告诉你会出现的境界。你不懂，一进入外境界，就入魔了。他说，到这个时候，还有，坐在那里都觉得地在震动，硬是大地在震动，不过别人没有觉得，你的确觉得会震动。所以这个时候完全是闭关在关房里，就是自己一个人盖在里头了。所以，完全在震动。</p><p> <strong>【……作是思惟时。自见己身胸骨。乃至面骨。渐渐明净。见诸世间。一切所有。皆悉明了。得此观时。如执明镜。自观面像。行者尔时。见诸身外。一切众色。及诸不净。亦见身内。一切不净。……】</strong></p><p> 修到这个时候，身体内外一片透明，眼睛开着、闭着一样，自己看身体内部好像看玻璃人一样，哈。看外界也看得很清楚，山河墙壁……，虽然你锁在房间里，已经没有障碍了，看透了。</p><p> <strong>【……此想成时。名第十七身念处观。</strong></p><p> 佛告阿难。汝好受持此身念处灌顶章句。慎勿忘失。开甘露法门。为未来世一切众生。当广演说。尔时阿难。闻佛所说。欢喜奉行。】</p><p> 今天，我们到这里为止。因为下面的很长，非常长，就是综合下来的一个观法，只好下一次一起能够讲完。讲完了以后，我们要到一月五号以后，再讲第三卷。</p><p> （起立！）不要客气了，谢谢、谢谢，盘腿不要起立了。</p></div>"
},{
    "title": "禅秘要法讲座 15",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> <strong>【佛告阿难。此想成已。复当更教系念。思惟谛观面骨。自见面骨。如白玉镜。内外俱净。净如明镜。渐渐广大。见举身骨。白如颇梨镜。内外俱净。一切众色。皆于中现。须臾见身。如白玉人。复见澄清。如毗琉璃。表里俱空。一切众色。皆于中现。复见己身。如白银人。唯薄皮在。皮极微薄。薄于天劫贝。内外映彻。复见己身。如阎浮檀那金人。内外俱空。复见己身。如金刚人。见此地时。黑象倍多。以鼻绕树。尽己身力。不能令动。】</strong></p><p> 现在，我们这个白骨观在卷二，第十八观，到最后一观，是总结。这个总结是连带上面十六观到上次（讲的）第十七观，包括一起的一个总观的观法。我们如果知道了整个的观法过程，就晓得白骨观的观法，到这个时候是个什么结论。</p><p> “佛告阿难，此想成已，复当更教系念，思惟谛观面骨。”这个时候开始的，是从面骨的观法开始。</p><p> “自见面骨，如白玉镜，内外俱净”，这个时候观面骨——因为上面的功力，修持的法门，照规矩累积下来，这个时候一定，自己见到这个面骨并不是像这个样子了，是有原来自己骨骼的影子，但是整个是发亮了，“内外俱净”，外面的面色、脸色，别人也看得到，同自己内部所看到，都是清净的，“净如明镜。”</p><p> 那么，这个面骨慢慢地自己扩大——你想它扩大，有时候做不到；不想它扩大，功力到了这里，修禅定、思维修到这里，渐渐就放大了。那么，自己可以看到“举身”，全身的骨，“白如颇梨镜，内外俱净”。直到这个程度，这是初观的现象。</p><p> “一切众色，皆于中现。”这是个重点。就是说，我们观到这一步、修持到这一步，观到全身白骨呈现，譬如像玻璃镜那么明净，“众色皆于中现”，那么，整个的色，七彩的色，自然光里内外呈现，都在这个白净境界里呈现出来。</p><p> 这个样子，“须臾”，一下，“见身如白玉人，复见澄清，如毗琉璃，表里俱空，一切众色，皆于中现。”再进一步，看到全身，像个白玉人一样。再看这个白玉人，中间无丝毫的渣滓，清净有如“毗琉璃”，玻璃是玻璃，琉璃是琉璃，“毗琉璃”等于就是水晶的最清净的颜色，“表里俱空”。</p><p> 这个玻璃是个比方哦，你如果真觉得自己的骨头像玻璃那么透明，这也是错了，就是变成一个空性——空相，不是空性，刚才讲错了一个字。</p><p> 这个时候内外，“表”就是外层、外面；“里”就是内，里面，统统是空的，就是这么一个透明的体，而且不像普通的玻璃或者水晶有个实质，没有个实质！那么，七彩，青黄赤白等等，“一切众色，皆于中现”，呈现出来。</p><p> 再进一层，“复见己身，如白银人，唯薄皮在，皮极微薄，薄于天劫贝，内外映彻。”再慢慢地，这个时间稍稍定……算不上一分钟、算不定半个月或者一天，那么，觉得自己本身的白骨像白银一样了——这是比方哦，到那个时候，你不要真变成白银啊，（那）你就变成化石了，就已经变成化石的人了。比方像白银色（是）有一点白色，稍稍带淡青。外面就是一层薄皮，所谓薄皮，也不是我们现在的皮，皮很薄很薄，“薄于天劫贝”，就是说，古代外国来的，波斯来的那个绸子、纱子，等于比现在最细、透明的尼龙还要透明，“内外映彻”，内外都是清的。</p><p> 那么，这个时候再进步，“复见己身，如阎浮檀那金人，内外俱空。”再进一步，由白银的色，全身变成佛像一样，紫檀金色，发金色的光。不过，内外都是空的。</p><p> 再进一步，看到自己身体“如金刚人”，所谓金刚，颠簸不破的，也可以说透明体发金色光。“见此地时”，那么，这个时候，换一个境界了。或者开眼、闭眼，看到这个地下的时候……这一段你念下去。</p><p> <strong>【……见此地时。黑象倍多。以鼻绕树。尽己身力。不能令动。</strong></p><p> 尔时众象。吼声震烈。惊动大地。大地动时。有金刚山。从下方地出。住行者前。尔时行者。见已四边。有金刚山。复见前地。犹如金刚。复见诸龙。寻树上下。吐金刚珠。树遂坚固。象不能动。唯五色水。从树上出。仰流树枝。从于树端。下流叶间。乃至树茎。亦流金刚山间。布散弥漫。满于大地。金刚地下。乃至金刚山。此五色水。放五色光。或上或下。游行无常。】</p><p>  好，先到这里。就是说，你自己本身观到“如金刚人”这个境界的时候，正觀的境界非常可能就要变化，它自然会呈现变化。那么，看到如上面十七观所讲的，四面又出来很多“黑象”，你注意，这是在印度的比方；在中国的比方，或者是黑老虎啊、黑狮子。总而言之，这个时候的境界，四面八方有黑影子，很大，很有力量。</p><p> 所谓是象、是狮子、是老虎，或者是魔鬼一样、龙一样等等，都是根据人的阿赖耶识的种性自己发现，并不太固定。如果你呆板地读这些地方、研究这些地方……比方了，假设有个人修到这一步，然后搞了半天，“哎呀，我旁边还没有黑象呢？”白象的毛还没有看到一根，还拼命去找这个黑象？！呵，那不但是走火入魔，（是）走入歧途了。</p><p> 这个时候，有很大的黑影子出来，如象一样，看到围绕，各种……。</p><p> 那么，“尽己身力，不能令动”，就是说，这些象出来，围着那一棵树，拿鼻子——象的力量都在鼻子，它一拽，那些大树一拉就断。这个时候你看到的外境界，可能有这种的现象，一个有大力的东西一样，大力量（想）摧毁一个东西，怎么样都动不了。</p><p> 那么，慢慢的，耳朵也会听到，好像象啊、老虎叫的很大的声音，没有定力自己都起了恐怖啊，所谓“震裂”，震动大地。那么，自己会觉得身体也摇动，好像大地、地下在震动。发现自己打坐的下面“有金刚山”，从下方地上出来、出土。或者一座山一样，挡在你的前面，什么也看不到。乃至于看到四面的金刚山，还有些树、有些龙，各种的境界……下面都如经典上所讲。</p><p> 我们现在告诉大家，这种现象不是非常像这个经典（讲的）那样呆板，也不是每一个人，必定是这样呆定的。但是，每个人所出来的境界大致上相同，有黑影好像挡住了前面，好像一切……身体是震动的，大地……有时候坐在这里打坐，乃至于你闭着眼睛，整个在大地震中。当然，你张开眼睛看看呢：一切东西没有动，可是事实有大地震动这个现象。那么，还要碰到各种的境界。</p><p> 现在，我们事先告诉大家啊，这一切的境界，都是阿赖耶识的种子发现。大家现代人，拿科学的现代道理研究，上面，你本身由面部一直到身，都观清楚了，一步一步进步，就是“道高一尺，魔高一丈”，魔也不是外来的，就是你本身反面的影像出来，所有的业力构成了这个现象。</p><p> 这还是正规的呦，假设不正规，这个人到这里或者是脾气大了、外面的事情来了，或者是忧郁多了，或者是什么样，各种现象统统来，贪嗔痴慢一起来。现在，拿这个外境界，他告诉我们（是）这个样子。</p><p> 好，下面再讲到毒龙，也是外境。每一个外境都是代表了你的内境，内境就是身体上的变化，这时候血液的流动像龙，各种样子都出来。下一段，你继续。</p><p> <strong>【尔时黑象。从金刚山出。欲吸此水。诸龙吐毒。与大象战。尔时诸蛇。入龙耳中。并力作势。共黑象战。尔时黑象。尽力蹴掣。亦无奈何。见此事时。诸水光明。皆作伎乐。……】</strong>　</p><p> 又变好的境界，所以看到，就发生音乐的声音。</p><p> <strong>【……或有变化。状如天女。歌咏作伎。甚可爱乐。此女端正。天上人间。无有比类。其所作乐。及妙音声。忉利天上。亦无此比。如是化女。作诸技术。数亿千万。不可具说。……】</strong></p><p> 注意这两句话啊，这个时候境界的变化很不一定，佛也无法交代完。因为一切众生每一个人业力不同，所发现的境界也不同，所以你注意这个话。</p><p> <strong>【……见此事时。慎勿随着。应当系心。念前不净。出定之时。应诣智者。问甚深空义。</strong></p><p> 尔时智者。应为行者。说无我空。尔时行者。复应系念如前。自观身骨。自见胸骨。明净可爱。一切不净。皆于中现。见此事已。当自思惟。如我今者。发是我耶。骨是我耶。爪是我耶。齿是我耶。色是我耶。受是我耶。想是我耶。识是我耶。一一谛观。无明是我耶。行是我耶。识是我耶。名色是我耶。六入是我耶。触是我耶。受是我耶。爱是我耶。取是我耶。有是我耶。生是我耶。老死是我耶。若死是我者。诸虫唼食。散灭坏时。我是何处。若生是我者。念念不住。于此生中。无常住想。当知此生。亦非是我。若头是我。头骨八段。解解各异。脑中生虫。观此头中。而实无我。若眼是我。眼中无实。地与水合。假火为明。假风动转。散灭坏时。乌鹊等鸟。皆来食之。瘭蛆诸虫。所共唼食。谛观此眼。若心是我。风力所转。无暂停时。亦有六龙。举此心中。有无量毒。心为根本。推此诸毒。及与心性。皆从空有。妄想名我。……】</p><p> 好，先到这里。这一段，用功到这一段，假设大家修持，正式的修持，专修的人，到了这一段，刚才讲过变化，“数亿千万，不可具说”，这是要点，就靠你智慧来破的。没有真正的魔、怪，能够破得了般若智慧，只有空的智慧破一切法，这个是要点。万一大家智力不到这个程度，再三提过，唯一的重点，记得两百六十字的《心经》，背《心经》、念《心经》可以破魔障。</p><p> 那么，这里修持，佛告诉我们，“见此事时”，你看到这个境界，有四个字圈起来啊，“慎勿随着”，千万不要执着了，也千万不要跟着境界跑，一跟着境界跑就完了——完了没有关系呀，下地狱也好、变魔鬼、魔王也好，再来嘛——再修过就是三大阿僧祇劫！慢慢来，等个几千万亿年，没有关系，呵，应该有这个精神啊，大家既然……能够发狂的人，都有这个气派，啊。</p><p> 好，佛吩咐你，如果是一个真正成器的人，“慎勿随着，应当系心，念前不净。”注意，凡是学佛，最初的动念，就是最后成功的一念，中间的变化不算数，还是从最初一念清净，或者是只观一点，甚至你这个时候再回转来，从脚趾头的白骨观开始（的第）一步，就是一点亮光定住了，所以，“系心念前不净。”</p><p> 那么，佛吩咐说，修到这个程度，出定的时候、下座的时候，只好求明师智者，讨论教理，就是佛经上的教理。</p><p> 那么，这一段的文章写法（是）印度梵文的写法，这个是我吗？那个是我吗？所谓“耶”字是古文，现在白话的翻译：地是我吗？水是我吗？骨头是我吗？眼睛是我吗？……</p><p> 就是后世禅宗的“谁是我？”这个境界我怎么看见？我在看见，谁是我啊？那我们就简单了，完全参究空、无我的道理。所以，下面一路，这个是我吗？那个是我？……</p><p> 这个“耶”字……我们南方话：这个是我呐？那个是我呐？北方话：这个是我吗？那个是我吗？——仔细地参究，为什么我看到这些境界？就是真有象、真有龙在前面，来吃掉我，吃掉我才好呢，你肚子饿喂你吃嘛，本来此身不是我，我就布施给你。就是完全要以无我理上来参，到此完全是理上参。</p><p> 所以，解脱（是）知见上了，不是功夫境界上了的，要注意！下面都是一段……。</p><p> 那么同时，我们要晓得……譬如大家，经常提到……现代人喜欢讲禅宗，喜欢讲寒山大师的诗。寒山大师的诗，简简单单两句话，“面有双恶鸟，心有三毒蛇。”每个人脸上有两个，一双很恶、很坏的鸟，“面有双恶鸟”。“心有三毒蛇”，我们每个人心里有三条毒蛇，也可以说是三条毒龙。</p><p> 我们有一位道友，一讲他就笑了，他自己指着脸上有两只恶鸟，他经常养的，大家都认得这一双恶鸟吧？过去，曾经有学佛的人拿这个题目考人、学佛的，结果答案很多，有些（认为）双恶鸟是呼吸，也不错啊；有些说是耳朵……，反正，正确的答案是两个眼睛，就是面上的双恶鸟，最坏的，是引诱使我们犯罪的最厉害的前奏。“心有三毒蛇”，贪、嗔、痴，这是当然道理。</p><p> 所以，这一段所讲的这些境界，就是你“面上双恶鸟，心有三毒蛇”变的，这是寒山的诗。</p><p> 所以，在这个地方，像这种情形，用功到这个境界，所以，禅宗再三提，“唯有智了”，智慧才能真了，了道、悟道唯有智了，只有智慧可以了。所以，了生脱死最后是智慧。</p><p> 他说，这一切，叫我们这个时候需要以空来破一切法。但是，你想象的空不行，要理悟，真正的悟到，所谓身心皆从空有。那么，下面接下去，就是他教的佛经，梵文原文了。</p><p> <strong>【……如是诸法。地水火风。色香味触及十二缘。一一谛推。何处有我。</strong></p><p> 观身无我。云何有我所。我所者。为青色是我。黄色是我。赤色是我。白色是我。黑色是我。此五色者。从可爱有。随缚着生。欲水所染。从老死河生。从恩爱贼起。从痴惑见。如此众色。实非是我。惑着众生。横言是我。虚见众生。复称我所。一切如幻。何处有我。于幻法中。岂有我所。作是思惟时。自见身骨。明净可爱。……】</p><p> 注意，就是说，你能够在理上了、智慧上了，理上参透了——这个经典明文都很熟，尤其大家学佛的人，对这些句子看得很熟。但是，大家之所以不能成道、不能了道、不能悟道，没有真体会到……把这个理返到身上来求实证。现在，这个法门的修法，是从实证的工夫来透这个理，所以，理事是合一的。</p><p> 那么，叫我们在这里，参通了这个理，无我之理……尤其中间很重要的，譬如，我们看到五色的光，很多人打坐就看到五色的光——光的变化，是由我们有身心来的，一定有。但是，看到五色光，有许多人在打坐的光境界里，以为自己得了道；或者密宗、道家、瑜伽，乃至学佛修禅的很多人，甚至还以放光来标榜；甚至有些人，还学学那个眼睛出了毛病的，看这个人身上有光、那个有光，还可以断定命运，他自己不晓得已经走入魔道了。</p><p> 实际上有没有光呢？有，我们现在也有光，这些也是光。外界自然界物质世界的光，同你修道境界内在所看到的光，“从可爱有”，因为你心念去爱这个光；“从缚着生”，你思念困在上面，被它拴住了；“欲水所染”，那个光色，这个“欲水”的“欲”不是男女狭义的爱欲，是众生广义的贪嗔痴，那个痴所发生的、贪所发生的，对一切都有欲望、要求。</p><p> 所以，我们打坐，你说：“哎呀，你究竟怎么样？我看你脸上都是黑气。”“啊，真的呀？”“哦，都是黑气哟！”你天天说、天天说，一定把他说死了，那个打坐的一定中毒了，他吓死了，他没有这个智慧。“哟，你有什么光，有什么光……”连着叫十几个人天天去赞叹他，会把他赞叹疯了。因为这些人学佛修道都有欲求，想得个道、想求个法，这个“欲水所染”。</p><p> “从老死河生”，为什么从老死所生？说句良心话，我们在座的男女老少，哪个不怕自己老了？哪个不怕自己死啊？就是有恐怖这一念、有爱欲这一念，都来了。</p><p> “从恩爱贼起”，彼此相爱，狭义的男女相爱。大的，我们对于一个东西，譬如这个表，我很喜欢，属于我的，你碰都不能碰，“哎，这个表不能动。”占有的欲，“从恩爱贼起”。</p><p> “从痴惑见”，就是痴性的根本，“惑”就是理不明，迷惑所致。所以看到这一切色……</p><p> 即使看到这一切光色又有什么了不起呢，“如此众色，实非是我”，这个还不是道的究竟，我们还没有见到真我，还没有了脱生死。</p><p> “惑着众生，横言是我”，有些智慧不够的一切众生，看到这一点（就）“横”起来，横起来讲，犟起来，“这个，我是得道了。”是横说。等于有些人个性犟，眼睛都是横着来讲话。</p><p> 所以历史上讲“处世横逆”（ 恒逆？），那个理由都是歪理千条，讲话都使人讨厌，发脾气的，就是横讲，“横言是我”。这是一种，这是“惑见”的众生。</p><p> “虚见”的众生呢？在这个我上面“称我所”，有了光以后，哎哟，还有神通了，还给人家看这样、那样，迷惑人不要命，迷信……</p><p> 世界上真正迷信的，学问越高、知识越深的人，迷信越大。你看，这个社会上一提什么，“哦，迷信迷信……”你说：“哎呀，对呀！这些家伙都迷信，就是你老兄不迷信。不过啊，我看看你，最近好像精神不大够啊？身体还是检查一下好。”然后他说：“真的呀？……诶，是喔，是喔。”他还是跑去检查的，你说他迷信不迷信？</p><p> 真不迷信，除非大彻大悟，成就的人。一切唯心，哪里有这许多鬼话？！你看到光不是色盲，就是……不相信到眼神经、脑神经检查一下那个看光的，决定有毛病。尤其是老眼昏花，更容易看到光，不带眼镜时，看到一切都发光的，都发光。你看，在座很多近视眼，你把眼镜马上脱了，一秒钟盯到我这里看，你不看到我这里有五色光才怪呢，不然，我就不姓南了，姓北了，哈。这个都是幻觉，“虚见”，要你理解这个道理，所以，佛法是绝对科学的。</p><p> 所以，假定这个地方的要点，都能用智慧了（liǎo），一切唯心，既不被外境所转，也不被自心所骗，那么，一切境界清净了，恢复到清净。那么，马上恢复到前面的境界，这个时候，正思维是参透了，“自见身骨，明净可爱”，还是回转来一具白骨，“明净”…… ，再三提到白骨……此法，这个法门，为什么那么注重白骨的道理呢？哪一位提出来讲一句话看，什么道理？因为这是修白骨法门的主法之一，就是说，你第一念的系心一缘就是修白骨，对不对？所以，最初的就是最后的。所以，始终不变这个最开初的这一念之所缘。中间你就是看到佛菩萨……下面跟着，佛菩萨都来了。所以，说明这一点。你再念下去。</p><p> <strong>【……一切世间。所希见事。皆于中现。……】</strong></p><p> 还有啊，注意！到这个境界，你平常看不见的事情，古怪的事情都看见了，有神通都来了，你不要以为是道啊，这个是最起码的过程。</p><p> <strong>【……复见己身。如毗琉璃人。内外俱空。如人戴琉璃幢。仰看空中。一切皆见。尔时行者。于自身内。及与身外。以观空故。学无我法。自见己身。两足如琉璃筒。亦见下方。一切世间所希见事。此想成时。行者前地。明净可爱。如毗琉璃。极为映彻。持戒具者。见地清净。如梵王宫。威仪不具。虽见净地。犹如水精。】</strong></p><p> 好，稍停一下。注意啊，这个地方是个考验了。用功到这个境界，看到自身空了，然后，觉得两个脚，一直到底……像水晶（样）透明，两个筒一样。同时，眼睛开眼也好、闭眼也好，这个地球下面，地下就看通了。所以古代说，看地的地师，眼睛能够看地下三尺到六尺，发现有没有龙脉，真的假的呢？绝对真的，这个时候一眼把地都看通了。</p><p> 但是有个差别，平常守戒，戒律修得好的人，这个时候把地看通，看地下的世界同天眼通人看天上世界是一样，清净；“威仪不具”，就是说戒律有缺陷的人，虽然看到这个地球中心，“虽见净地”，不过“犹如水精”透亮，地球里面还有没有其它的，地下还有没有世界？（就）没有看得那么清楚了，只看到地层透亮。</p><p> 那么下面，又转一个境界了。</p><p> <strong>【此想成时。有无量百千。无数夜叉罗刹。皆从地出。手执白羊角、龟甲白石。打金刚山。复有诸鬼。手执铁槌。打金刚山。是时山上。有五鬼神。千头千手。手执千剑。与罗刹战。毒蛇毒龙。皆悉吐毒。围绕此山。复有诸女。作妭歌咏。作诸变动。护助此山。若见此事。当一心观。诸女现时。当观此女。犹如画瓶。中盛臭处不净之器。从虚妄出。来无所因。去亦无处。如此相貌。是我宿世恶业罪缘。故见此女。此女人者。是我妄想。无数世时。贪爱因缘。从虚妄见。应当至心。观无我法。我身无我。他身亦然。今此所见。属诸因缘。我不愿求。我观此身。无常败坏。亦无我所。何处有人及与众生。作此思惟已。一心谛观空无我法。观无我时。下方琉璃地际。有四大鬼神。自然来至。负金刚山。时诸夜叉罗刹。亦助此鬼。破金刚山。时金刚山。渐渐颓毁。经于多时。泓然都尽。唯金刚地在。尔时诸象。及诸恶鬼。并力挽树。树坚难动。见此事已。复更欢喜。忏悔诸罪。】</strong></p><p> 好，稍停一下啊。这一段，刚才提过，用功到这个程度，可能另外变现一个境界，（前面）不是由地下面再起——这个地起，现在大家，（若）真有修持研究，应该可以了解为什么白骨观法的开头，要从左脚大趾头开始，都从下部起，都从下面起的，开始从人体的下面修起。到这里时，（是）连带着地从下面修起，这是个非常深的秘密的学理。</p><p> 我们大家，尤其是现代的青年，应该有这个头脑啊。所以，你真研究起来，看到这个佛经，（认为是）没有道理，一切是神话——你了解了以后，才深深佩服，佛说得一切是科学的。加上这许多鬼神一切的画面——这些画面有没有？你在那个境界里有，一定有，就是阿赖耶识所起的现变。</p><p> 理由在什么地方？我问青年同学们……大家就可以了解。这两天天气很干，地球的下雨，天气的变化……譬如在台湾，像这样晴的天气久了，忽然碰到一个地震，我们就晓得，这一两天，算不定明天，算不定……不会超过三天，（就）要变天了，会下雨；如果雨连着（几天）以后，地震轻微震了一下，晓得要变天了，要天晴了。天上的云、雨，气候的变化从哪里来？从地心的本身，气的变动来。</p><p> 所以，关于地震，大地的震动，现在地质学的一种说法（认为），大地的震动是地质的变化，这是现代科学讲地质。但是，现在科学慢慢又回到哲学路上，这个叫综合科学。这个地球地质为什么要起变化？当然，我们的解释可以加上时间的关系了，什么风化——哎，既然风化，就是气的变化！</p><p> 所以你看气候的变化……譬如说，到了四五月间，学过《易经》的更清楚了，到了四五月间，所谓黄梅天，地下就会发潮。乃至我们现在修的高楼，二三十层楼，距离地面很远了，到了黄梅季节，四五月间照样的返潮，地下……这些都是从下面来的。</p><p> 这下面一切一切的变化，地下的变化……从下部的变化，容易产生男女境界的现象。当然，过去也都是以男性为中心的社会了，所以这里说看到美女；换句话，一个女性修持到这里，（会）看到一个美男子了，看到你所喜爱的那个类型的。金刚力士打这个山，是同样的道理。</p><p> 所以，你通了这个理……如果把全部佛学的理，乃至显教、密宗都搞通了，配合现代的科学知识都参透了，那你用功起来快得很，修持起来一日千里，一秒钟有千里之势，层层就破了，任何一个境界来，一笑，“哈，原来这样一回事！”境界都把你没办法，恶魔、鬼神，乃至佛也把你没办法。</p><p> 没有这个智慧、没有这个功力，道理不透，那么，这些境界差不多都很呆板、固定地会呈现。所以，了解了这所有的佛经，（就晓得）那么多神秘的话全部是科学的代名词、道理，这个画面的代表、符号的代表。你再接下去。</p><p> <strong>【忏悔罪已。如前系念。观琉璃人。琉璃地上。于四方面。生四莲华。其华金色。亦有千叶。金刚为台。有一金像。结加趺坐。身相具足。光明无缺。在于东方。南西北方。亦复如是。……】</strong></p><p> 这个“金像”就是你自己，在这个时候会忘记了（自己），就会呈现出来，一个金刚台上自己变成一个佛像一样坐在那里。</p><p> <strong>【……复自见琉璃身。益更明净。内外洞彻。无诸障碍。身内身外。满中化佛。……】</strong></p><p> 都是自己的化身，很多，都是这个佛像。</p><p> <strong>【……是诸化佛。各放光明。其光微妙。如亿千日。显赫端严。遍满一切三千大千世界。满中化佛。一一化佛。有三十二相。八十种随形好。一一相好。各放千光。其光明盛。如和合百千日月。一一光间。有无数佛。如是渐渐。复更增广。数不可知。一一焰间。复更倍有无数化佛。是诸化佛。回旋宛转。入琉璃人身中。尔时自见己身。如七宝山。高显可观。复更严显。如杂宝须弥山。山映显在金刚地上。时金刚地。复更明显。如焰摩天。紫绀摩尼珠。身转复明净。如无数诸佛。光明化成宝台。亦入琉璃人顶。复见前地。在铁围山。满中诸佛。结加趺坐。处莲华台地及虚空。中间无缺。一一化佛。身满世界。是诸化佛。不相妨碍。复见铁围诸山。净如琉璃。无障碍想。见阎浮提。山河石壁。树木荆棘。一切悉是诸妙化佛。心渐广大。见三千大千世界。虚空及地。一切悉是微妙佛像。是时行者。但观无我。慎勿起心随逐佛像。……】</strong></p><p> 好，请停一下。到这个境界——由白骨观开始，一切什么凶恶的、好的、美的、坏的境界都过了，有个魔障来了：佛魔来了！你可难破，因为你想学佛嘛，本来求的也（是）见佛。这个时候，突然，在你阿赖耶识没有明净，一念之间，自己变成佛了，那么很多人……</p><p> 当年我在大陆上所看到的很多人——“高级着魔”，我们叫他高级着魔，没有办法，讲经说法样样好，也号称什么宗的大师，那上座说法的时候，“你们看！”手这么一举，大家看到大指头上一个光就出来，光里头韦驮菩萨站在里头。哎呀！你们那个头不低呀？一定要磕下去，非磕不可，他又不是玩把戏，真的。然后，等大家磕完了头，“好了，这信了啊，皈依三宝，阿弥陀佛……”然后讲经，没有不信的，那真厉害！</p><p> 但是，他讲的经有错没有？没有错，一字不错啊，讲的很高明。所以，我们当时看他，哈，有名的高级着魔，无以名之，叫高级着魔。他不是疯来疯去的哦，那很严谨，很了不起。这是一种。</p><p> 还有，我在汉口看到，一堂人坐在那里，师父坐在上面，也是在家人，很多出家的和尚、尼姑，很多居士，哎呀，地位高的人……房子有我们这里一半那么大，一排排坐起来，坐在那里面……那个时候没有灯哦，就是一堆蜡烛、佛像，“嗡嘛呢叭咪吽……”大家都在念，不到二十分钟，满房间里头，连每一个人，统统都是金光围绕！你说，看了那个境界，你那个头还不磕下去呀！？我们当年很怪的，这种地方不磕头，到处看看，站着看看，评语下来：高级着魔的！哈，又是一个高级着魔的。</p><p> 所以，这个经典……你们是见过的少啊，当年我们所看的这些所谓善知识啊，这些怪人多了。那是真的哟，学问也好……指头这么一指，一道光就出来了。那么，现在这里什么东放光、西放光，还没有这个本事啊。大指头这么一摆，光就出来，出来了，韦驮菩萨硬站着，威武极了！那不是幻灯片啊、也不是电影啊！他就是上坐的时候一定，很庄严。然后，从老法的讲经（规矩），左边还有个人，侍者像木头一样那么站着，老式的官问案子一样，“咣”一拍，大家肃静了。“出来！”就出来了。你说，那个头还不磕下来呀？！你当然信了。</p><p> 然后讲每个人前因后果，你是什么变的，前生是什么变的，这个是你前生的媳妇，那个前生是你的什么什么……哎呦，多得很。</p><p> 反正中国人说了半天，前生明朝什么人啊、唐朝什么、清朝什么，反正都生在中国，没有一个投胎到外国去了的。你到美国，现在有好几个女的都有神通，把人说得准得很，她说了半天，哎呀，你前生是埃及人啊……从来没有说是来中国投生过的，也没有说你是日本北海道什么人啊，都没有，因为她（对）东方情形不熟悉啊，呵。所以，这一切情形，都从个人的阿赖耶识所生。哎，可是许多知识分子，买飞机票，专叫她看，看了回来还信的很呢。</p><p> 哎呀，天下的事没有办法，学佛是“菠菜”波罗蜜多啊，要多吃菠菜呀；般若波罗密多啊，智慧的成就啊！</p><p> 所以，听了之后只好（觉得）可笑，第一流的知识分子……我说“你去了？”“去了。”我说：“是不是坐飞机专门去让她看前生？”说：“对呀。”我说：“看了你怎么样？”“哦，说我前生是希腊人啊，又如何如何……哎呀，真像！而且讲我丈夫跟我的因缘，要我这一生好好还账，而且还了帐还不能动念、不能生气，有一点埋怨，来生还要变他的太太，还要还。”我说：“哎，这一点看得很对哟。”（众笑）“老师，你也说对？”我说：“我也早看到了。”哎呀，狗屎！“菠菜”没有吃够，天下事都是智慧。</p><p> 你看，中国、外国的神通的人，你把他请来一堆，各说各的话。算不定一个人同时叫他（两个）看，那个外国神通一定说你前生是南美人，中国人算不定说你是湖北人，两个一定打起架来。</p><p> 一切都是唯心造啊！真神通不是这样的啊，要注意。</p><p> 所以这个地方，觉得自己本身呈现是佛的境界，智慧差一点还不把自己欢喜死了！赶快叫人家：你来给我修庙子，我已经坐到莲花台上了……哈哈，大家出一点，一个人出十块都好，就打起来了。</p><p> 所以，佛吩咐我们，他怎么说啊？叫我们“但观无我，慎勿起心随逐佛像。”知道吗？圈起来哟，你不要被境界骗掉，也不要跟着佛转哦，你们看到这种重点，就要自己下笔（圈）了，不要忘记了，不然……。</p><p> 所以，我原来的老师以前跟我讲：“怀瑾啊，什么魔都好办，有一种魔啊，我就根本没有办法。很多人都有这个魔，”我说，什么？“那叫做佛魔！一身的佛味、一脸的佛像、满嘴的佛话，这些著久了，佛魔救不回来的。”那是真话。</p><p> 现在佛也这样说，佛不过客气一点，说的文句好听一点，他叫你千万不要跟着这些佛境界转！因为这种佛像也是（因）你素来要想成道、要想成佛……。</p><p> 好了，我们先休息下。今天要把这一观讲完啊，还有几页啊？要快一点了。</p></div>"
},{
    "title": "禅秘要法讲座 16",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 继续下去。</p><p> <strong>【复当思惟。我闻佛说。诸佛如来。有二种身。一者生身。二者法身。今我所见。既非法身。又非生身。是假想见。从虚妄起。诸佛不来。我亦不去。云何此处。忽生佛像。说是语时。但当自观。己身无我。慎勿随逐。诸化佛像。】</strong></p><p> 这一段要注意啊，这里这么讲，就是《金刚经》的说明，“凡所有相，皆是虚妄，若见诸相非相，即见如来。”大乘经典的四句话，鸠摩罗什法师的翻译，非常清楚。这里，很详细地告诉我们，修持到这个境界，佛也不理。</p><p> 万一你们单独修，到这个境界，身边（要）带着两本书，一本是禅宗的语录，《指月录》等等，你翻开看看，自己智慧上会破开；此外，拿《楞严经》《楞伽经》两部经，“二楞”，我叫它二楞——我自己有个外号，自称“二愣子”，二愣子是北方话，傻头傻脑的，我就是个二楞子，因为翻过这两部，楞伽与楞严，我本来也是个傻头傻脑的，所以自称二楞子。你带着这两部经、《指月录》等等，不会着魔境的。你继续念。</p><p> <strong>【复当谛观。今我此身。前时不净。九孔脓流。筋缠血涂。生藏熟藏。大小便利。八万户虫。一一虫复有八十亿小虫。以为眷属。如此之身。当有何净。作是思惟时。自见己身。犹如皮囊。出定亦见身内无骨。身皮如囊。亦观他身。犹如皮囊。】</strong></p><p> 再插一下。注意，修持到这个境界，出定、入定，自己身体好像没有骨头了，柔软轻灵到极点。如果走到武功上去啊，这个人就很厉害了，出手投足之间，那就是气功到家了；气功到家了，不是骨头很硬的，就是软化了。</p><p> <strong>【见此事时。当诣智者。问诸苦法。闻苦法已。谛观此身。属诸因缘。当有生苦。既受生已。忧悲苦恼。恩爱别离。与怨憎会。如是种种。是世间苦法。今我此身。不久败坏。在苦网中。属生死种。风刀诸贼。随从我身。阿鼻地狱。猛火炽然。当焚烧我。驼驴猪狗。一切畜生。及诸禽兽。我悉当经受诸恶形。如此诸苦。名为外苦。今我身内。自有四大毒龙。无数毒蛇。一一蛇有九十九头。罗刹恶鬼。及鸠槃荼。诸恶鬼等。集在我心。如此身心。极为不净。是弊恶聚。三界种子萌芽不断。云何我今于不净中。而生净想。于虚妄物。作金刚想。于无佛处。作佛像想。一切世间。诸行性相。悉皆无常。不久磨灭。】</strong></p><p> 这几句话特别注意啊，“一切世间，诸行性相”，性、体、相，现象，“悉皆无常”，不会永恒存在，“不久磨灭”。</p><p> <strong>【如我此身。如弹指顷。亦当败坏。用此虚想。于不净中。假伪见净。</strong></p><p> 作是思惟时。自见己身。净如琉璃。皮囊诸相。自然变灭。观身及我。了不能得。但见四方。有诸黑象。践踏前地。前地金刚。一切摧碎。见地树荄。乃至下方。众荄甚多。不可称数。尔时黑象。如前以鼻绕树。无量诸龙。及诸夜叉。与黑象共战。狂象蹴踏。是诸鬼神。闷绝躄地。于虚空中。有诸鬼神。其数众多。手捉刀轮。佐助黑象。欲拔此树。如是多时。树一根动。此树动时。行者自见。绳床下地。自然震动。日日如是。满九十日如是。应当乞好美食。及诸补药。以补身体。安隐端坐。】</p><p> 你稍停一下啊。修持到这里，观苦、观无常，破除了这一切境界，可是本身，身心方面又有变化、进步。所以，自己看到这个饿鬼呀……上面有几句重要话，修持当中，不管修佛法、各种瑜伽、密宗、道家，都是一样，凡是此心心境……他这里有几句话，这一切境界、一切饿鬼，都是自心所生的——中间看到重点的话，把握住没有？都知道了啊，都有的。</p><p> 然后，就看到境界呈现，好像地下……我们这个座位，你随便在哪里打坐的座位，很多草根树皮一样纠结不清，为什么会有这个境界出来？就代表我们贪嗔痴慢，九十九结使，就是疙瘩，永远没有解脱的。</p><p> 那么，又看到黑象爬这个树啊，这个时候，感觉到下面这些树根一样，抽掉了一个，我们自己身体都会震动起来，觉得大地都在震动；实际上没有动，不过，你的境界会呈现。换句话，你解脱了一个结使，贪嗔痴慢解脱一个，自己本身身心都震动。</p><p> 要这样专修的人，要九十天修下来……可是啊，要吃得好，“乞好美食，及诸补药，以补身体。”</p><p> 所以，后来的道家，借用了这个话，就说：我们人的身体是假的，四大假和，不过呢，要爱惜身体，“借假修真”，这个观念就是这种地方来的。这个借假修真，没有成道以前，还靠这个肉体作工具，没有错。这个时候，佛再三提起，要注意营养，要吃得好。</p><p> 那么，叫我们从头再来，再用功。</p><p> <strong>【复如前法。如前所见。从初境界。】</strong></p><p> “从初境界”，注意啊！</p><p> <strong>【一一谛观。往复反覆。经十六反。极令明净。</strong></p><p> 既明净已。复还系念。观身苦空。无常无我。悉亦皆空。作是思惟时。观身不见身。观我不见我。观心不见心。尔时忽然见此大地。山河石壁。一切悉无。出定之时。如痴醉人应当至心。修忏悔法。礼拜涂地。放舍此观。】</p><p> 注意啊，这一段是用功最吃紧的。真正所谓修禅定，不管你走后世的禅宗、密宗、道家，都一样，同一个路线。为什么佛在这里再三吩咐，把身体维护好？有病的赶紧看病，不能够说……。</p><p> 我看到很多的修行人，住茅蓬几十年，多的很啊，出家人……，现在还有在香港山上住几十年茅棚的，不下山的，大陆和尚。所以，我十几年前还有朋友特别接我到香港，为他在一个小茅棚，里头很小，打一个七，（他）一身内外都是病。我说：你修个什么道嘛！痛骂他一顿，骂了七天。现在还在山上住茅蓬，不过还是病，呵呵。后来，总算是我们那位朋友杨管北先生，没有死以前，花了好几万港币，把他拖下山来，医院看病，病好了回去，再住茅棚，修行人！现在呢，还是一身病，修行还是在修行，照修不误，也照病不误，很多人啊……。看到都是修行人，打起坐来嘛，勾腰驼背，都变成人虾子了，人像个虾子，这个样子，多得是了。</p><p> 所以，佛告诉我们，身体先治好，治好了进入另一个境界，真到了这个境界，他说：你从白骨观的第一个观法起，不能马虎，不要自作聪明，从头“十六返”，一步一步试验过来，要真修；尤其是理上有所悟的人、有所见的人，更要如此，一定要真修过来，“十六返”，“极令明净”，每一步工夫要亲证过来，这不是空谈理论。</p><p> 那么，然后观“空、无常、无我”。 修持到达这个境界，有几句重要的话，“观身不见身”，自己觉得身体都找不到了，开眼闭眼觉得没有身体了；“观我不见我”，自己觉得无我了；“观心不见心”，会到这个境界，身、心、我皆空了——哎，你不要认为这一下我总（算）证到空了！还不是哦，还不是哦！</p><p> 用功到这里，忽然眼睛睁开，看到大地山河、整个地球空了，彻底的空了！那真是你们看过的那个济颠……《济公传》小说，“天也空，地也空，生生死死在梦中”，就是这个境界来了，“天也空，地也空，你也空，我也空，生生死死在梦中。”那个《济公传》小说上都有，完全怎么唱的我记不得了，这还是童子功，小时候看小说念来的。他说，连这个地球都看……。</p><p> 这个时候，你出定的时候，人就像傻瓜一个，如醉如痴。所以你看，佛多科学啊，用功到这个境界的前一段告诉你，先把身体补好，不然你这个时候真病倒。人就变成一个傻瓜一样、白痴一样。</p><p> 那么，到这里这个阶段，（是）用功的一个程序，必然经过的。所以佛吩咐我们，唯一的办法，“应当至心修忏悔法”，拜佛，“礼拜涂地，放弃此观”，这个空境界丢掉，不要住在这个境界中。</p><p> 千万注意这一段啊，所以，唯一的，要相信有他力，有诸佛菩萨成就的……，至心忏悔、顶礼，自他不二，自然会……。</p><p> 你们听了禅宗，尤其年轻的，莫名其妙，自他不二，好像他不在乎，我就是——你是啊？你是个罪业种子，呵，一点没有错。就是这样。</p><p> <strong>【礼拜之时。未举头顷。自然得见如来真影。以手摩头。赞言法子。善哉善哉。汝今善观诸佛空法。以见佛影故。心大欢喜。还得醒悟。】</strong></p><p> 注意啊，到了超过这个阶段，你至心顶礼，恭敬到极点，只有求他力的加被；当今世上，没有“真身佛”，你也相信不过谁是真的证道的明师，所以，你只有求佛加被。这个时候，至诚一念拜下去……，前面不是看到，境界里头很多佛吗，这个佛又呈现了，不同，“如来真影，以手摩头”，你头顶会发生清凉，舒服无比的感觉；也可以听见声音，“善哉善哉”，这是经文哦，翻成白话就是“好的好的”，你很好、很好，你现在已经见到一点空了，你也见到佛的化身的一点影子了。那么，这个时候，脑子清醒过来，不会那么傻里呱唧了。</p><p> 现身罗汉——看你修持的功德了，（若）诚心，会来给你说法。</p><p> 佛的弟子有两位，释迦牟尼佛命令他们，不准肉身死的，一个是迦叶尊者，拿着佛的衣钵，在鸡足山入定，等……；还有一位宾头卢尊者，十八罗汉之一，永远在人世间转来转去，算不定他在这里，你也不知道。</p><p> 以前在大陆上，所谓庙子上做千僧斋，有些发心的居士一次供养一千个和尚吃一餐，还有衬钱，一个和尚一块钱，当年的一块钱使用价值很高哦。往往像普陀山这些大庙子打千僧斋，有时候凑不到一千个和尚，连云水和尚、比丘尼都凑上，加上我们这些烂居士啊，那两天为了吃斋，为了要钱嘛，把头发剃得光，借一件和尚衣服穿上，也混在里头，拿一块钱……有一块钱好拿、一条毛巾好拿，又吃一餐，然后合个掌，“南无南无……菠萝菠萝的……”没有关系，这个钱蛮好赚的，这样凑都凑不到一千个。</p><p> 有时候，往往看到一个烂和尚，又生病、又（生）疮，烂兮兮的，我们看到这些，特别注意，宾头卢尊者要来的时候，他有时候就是这样一个现身，使你谁都怕他，臭啊，一身脏，一个臭和尚，又脏又臭，裤裆都破的，衣服都……，是真的呀，你们真是没有见过，我讲的不是形容，我们看见多得很，穿的裤子东掉一块、西掉一块，缝补都懒得缝，有这样的人。</p><p> 我们那个时候啊，大名之下的和尚们不大理，看到这些，赶快跪下来拜。拜错了也没得关系，算不定他就是宾头卢尊者，就拿这个做生意的心肠来拜的，磕个头都有利益。年轻时候我们学佛是这样学的，不像你们，这里找南怀瑾，那里找什么法师，那个时候我们不是这个心情，专去找宾头卢尊者，佛的亲自弟子，佛命令他住世。</p><p> 所以，《大藏经》里也有修拜宾头卢尊者的方法，真修到至诚，他硬现身给你说法。这里也谈到了啊，注意。好，你念下去。</p><p> <strong>【尔时。尊者摩诃宾头卢。与五百阿罗汉。飞至其前。广为宣说。甚深空法。以见五百声闻比丘故。心大欢喜。头顶忏悔。复见尊者舍利弗。摩诃目揵罗夜那。及千二百五十声闻影。</strong></p><p> 尔时。复见释迦牟尼佛影。见释迦牟尼佛影已。复得见过去六佛影。是时诸佛影。如颇梨镜。明显可观。各伸右手。摩行者顶。诸佛如来。自说名字。第一佛言。我是毗婆尸。第二佛言。我是尸弃。第三佛言。我是毗舍。第四佛言。我是拘楼孙。第五佛言。我是迦那含牟尼。第六佛言。我是迦叶毗。第七佛言。我是释迦牟尼佛。是汝和上。】</p><p> “和上”，古代翻译就是这个“上”字，现代就是那个“尚”，一样。</p><p> <strong>【汝观空法。我来为汝作证。六佛世尊。现前证知见。佛说是语时。见佛色身。了了分明。亦见六佛。了了分明。尔时七佛。各放眉间白毫大人相光。光明大盛。照娑婆世界及琉璃身。皆令明显。尔时诸佛。现此相时。身诸毛孔放大光明。化佛无数。遍满三千大千世界。地及虚空。纯黄金色。是诸世尊。中有飞行者。中有作十八变者。中有经行者。中有入深禅定者。中有默然安住者。中有放大光明者。唯大和上释迦牟尼佛。为于行者。说四真谛。分别苦空。无常无我。诸法空义。过去六佛。亦复分别十二因缘。或复演说三十七道品。赞叹圣行。</strong></p><p> 尔时行者。见佛闻法。心生欢喜。应时自思惟。诸佛世尊。有二种身。今我所见。见佛色身。不见如来。解脱知见。五分法身。作是思惟时。复更忏悔。殷勤不懈。昼夜六时。恒修三昧。应作是念。此色身。如幻如梦。如焰如旋火轮。如乾闼婆城。如呼声响。是故佛说。一切有为法。如梦幻泡影。如露亦如电。如是诸法等。我今一一应当谛观。极令了了。作是观时。化佛不现。】</p><p> 注意啊，修行到这里，这个佛是真的化佛，化身佛来，只是恭敬、顶礼、忏悔。不过，他是他的佛，说法给你听，修持成佛，还是要靠你自己。所以，还是只有至心忏悔，心不随境转。佛亲口给你说法。</p><p> <strong>【若有少在。复更观空。以观空故。化佛即灭。唯七佛在。尔时七佛。与诸声闻。眷属大众。广为行者。说三十七助圣道法。闻此法已。身心欢喜。复更谛观。苦空无常。无我等法。作是观时。狂象大吼。挽树令动。树初动时。见一房地。六变震动。复有夜叉。刺黑象杀。众多黑象。死卧在地。不久烂溃。白脓黑脓。青脓黄脓。绿脓紫脓。赤脓赤血。流污在地。复有蜣螂诸虫。游集其上。复有诸虫。眼中出火。烧蜣螂杀。</strong></p><p> 尔时下方金刚地际。有五金刚轮。有五金刚人。在其轮间。右手执金刚剑。左手执金刚杵。以杵捣地。以剑斫树。见此事时。大地渐动。见城内地。六种震动。见一城已。复见二城。渐渐广大。见一逾阇那。见一逾阇那已。复更广大。普见三千大千世界。一切地动。动时东踊西没。西踊东没。南踊北没。北踊南没。中踊边没。边踊中没。此地动时。】</p><p> 这就叫做大地六种震动，这样叫做六种震动。</p><p> <strong>【见大树荄。乃至金刚际。时金刚人。以刀斫之。令树荄绝。树荄绝时。诸龙诸蛇。皆悉吐焰。寻树而上。尔时复有众多罗刹。积薪树上。</strong></p><p> 时金刚人。以金刚杵。捣树枝折。捣此树时。一杵乃至八万四千杵。树枝方折。尔时杵端。自然出火。烧此树尽。唯有树心。如金刚锥。从三界顶。下至金刚际。不可倾动。是时行者。得此观时。出定安乐。出定入定。心恒静寂。无忧喜想。复勤精进。昼夜不息。以精进故。世尊释迦牟尼。与过去六佛。当现其前。为说甚深空三昧。无愿三昧。无作三昧。闻已欢喜。随顺佛教。谛观空法。如大水流。不久当得阿罗汉道。</p><p> 佛告阿难。此不净想观。是大甘露。灭贪淫欲。能除众生结使心病。汝好受持。慎勿忘失。若佛灭度后。比丘比丘尼。优婆塞优婆夷。闻此甘露灌顶圣法。能摄诸根。】</p><p> “能摄诸根”是一个用功的方法啊，特别注意。</p><p> <strong>【至心系念。谛观身分。心不分散。敛心使住。经须臾间。此人命终。得生天上。若复有人。随顺佛教。系念谛观。一爪一指。令心安住。当知此人。终不堕落三恶道中。</strong></p><p> 若复有人。系念谛观。见举身白骨。此人命终。生兜率陀天。值遇一生补处。菩萨号曰弥勒。见彼天已。随从受乐。弥勒成佛。最初闻法。得阿罗汉果。三明六通。具八解脱。若复有人。观此不净。得具足者。于此身上。见佛真影。闻佛说法。得尽诸苦。】</p><p> 先到这里。最后这一段，大家都特别注意啊，看清楚了。</p><p> 由白骨观起，修到最后，念佛法门为止，是真念佛。而且，这个念佛，是念本师释迦牟尼佛，但是包括阿弥陀佛，所谓最后十方三世诸佛现前，此所谓真念佛法门。不是说别的念佛法门是假的，不是这个意思，就是佛亲自所教，最后，乃至念佛成佛的真正法门。</p><p> 如果，我们自己一般念佛、求静心、求禅悟，此身，这个身体在，此身不能了，终非究竟。而且，纵然这一生打坐坐得好，佛学道理讲的好，平常修定有一点清净的境界，谈不到真正的定，到临命终时，一点把握都没有，我告诉你！同样的昏沉，同样的散乱……。</p><p> 你现在觉得自己很有把握，到四大一分散的时候，气息一断的时候，一点把握都没有！不管你任何一种修法，千万注意哟！这个话不相信，你拿自己来试试看，怎么试啊？你拿自己死了来试试看，呵，到那个时候，后悔都来不及，找我也来不及，没有用。</p><p> 所以，“修要真修，证要实证”，禅宗两句话没有错，修持要真修，证要实证。白骨观到最后见佛、证佛这个法门，都是真修实证。所以最后做“十六返”。</p><p> 但是，到这里他告诉我们，修到白骨观、不净观的禅定法子，到了这一步，能够见佛的“真影”，注意啊，就是佛的化身，也就是佛的色身。但是，你没有成佛哦，要怎么成佛呢？要见了自性法身才成佛、才成道。不然的话，修这个法门……他再三地吩咐，告诉阿难，白骨观、不净观这个禅定，禅定就是正思维修法，“是大甘露”法，灭一切“贪淫欲，能除众生结使心病。”</p><p> 我们这个欲界里头，人的生命就是爱与欲，男女之间的爱欲。要想……了不了这个，只有走白骨观、不净观这个法门，才是真正彻底了。</p><p> 不要（像）有些老年人说：“我早了了。”那不是你了了淫欲，你老了，快要完了，没有那个本钱了——就是彻底讲一句话。或者你身体不好：“我没有淫欲念。”你那个身体根本就是，哎呀，老病之身，不堪负荷的。只要你身体一好，心力一强健，第一个跟着的就是欲念来了。所以佛说，要真修实证，要从这里了（liǎo）。</p><p> 所以，他吩咐阿难，好好受持此法，“慎勿忘失”。等到我走了以后，比丘、比丘尼，和尚、尼姑们，男人、女人，一般学佛的，听到这个“甘露灌顶圣法”，叫他相信得过，“能摄诸根，至心系念”，一心一意专修去。</p><p> “谛观身分，心不分散”，依身上起修的，就是十念法的念身，“敛心使住”，只要这一念修下来……。</p><p> 我们讲了很久了，佛经十六个观法，佛也再三说过要九十天、一百天……。有上根利器的，“敛心使住”，一念真到了那个境界的话，只要须臾一刹那之间，他说，这个人就是所谓“朝闻道夕死可矣”，工夫真做到这个程度，一刹那之间，你死掉的话，起码是不堕落——升天。如果这个中间加大乘之愿，一愿往生西方极乐世界就往生；你不加大乘……，……要定住哦。你说我观得起来，你观得起来有什么用啊！？你东观一下、西观……“面上双恶鸟”，滴溜溜的，眼睛就是转，越聪明，两个眼睛讲话都在转的，不然就在眨，脑子定不住---妄想。他说，你能够定得住，“当知此人，终不堕落三恶道中”，命终绝不会堕落畜生、地狱、饿鬼。</p><p> 假设有人“系念谛观”，能够观起来全身的白骨，肌肉的整个感受没有了，定住。这个人命终，往生欲界中心兜率天，弥勒菩萨那个地方，会亲自见到弥勒菩萨，跟着弥勒菩萨下生的时候成佛。那么，在弥勒菩萨的前面“得阿罗汉果，三明六通”，八种解脱，自然具足，自然……。</p><p> 你要晓得，我们很多的大师们发愿，譬如现代的，讲是近代、也可以讲现代的，太虚法师（等）好几位大法师，乃至西藏许多大喇嘛，发愿不是往生西方极乐世界，都发愿往生兜率天，依弥勒菩萨再来修过，为什么？他们为什么登记要登记到那里呀？办出境要证到兜率天呢？这个地方，生意利便，哈，有未来现身佛，弥勒菩萨在那里等着，下一次就是他来当校长、成佛的。那么，跟着他一路下来……这个时候跟着他，将来下来便当啊。西方极乐世界遥远，飞机票贵一点，而且到那里去，要修到第八不动地的时候，才能够回到这个世界来教化众生。所以，有许多人，大祖师乃至包括现代很多的大师们，都是发愿往生兜率天，弥勒菩萨（处）。</p><p> 所以，这个地方也讲现身成佛的……，往生兜率天，见弥勒菩萨。</p><p> 他说，假设有人，修这个白骨观、不净观法门，“得具足者”，这个话怎么讲？这十六步工夫都做给完成了，“于此身上，见佛真影”，可以见到佛的亲自化身，“闻佛说法”，得证苦集灭道，小乘法都了了。</p><p> 我问大家这里有没有问题啊？你们不问，我代表大家问，应该有问题。那么，这个时候几时开悟呢？这个同开悟还不相干，开悟是大乘法。但是，那么，我修白骨观、不净观能不能开悟？当然可以。而且，你真是修禅——后世所谓唐宋以后，一般大禅师的语录记载，在理上固然悟了，有许多工夫没有到，根本就没有到！还是依然轮回转来，没有错，依然还转来。</p><p> 禅宗所谓讲沩山禅师，三世为国王，做了皇帝，几乎丧失神通，原来基本的修持都几乎丢掉了，被富贵缠绕、缠绕会掉了。所以，有许多理上悟了，好像平常打起坐来，也有点清净境界，在这一点清净、一念相似的空境界里头，好像自己道理都通了，以为悟了---错了！天台宗所以分成六佛，这叫做“理即佛”，你讲的那个理都是佛的理，你本人可没有到。</p><p> 所以，真悟了理的时候，正好回转来，由白骨观这个法子修上来，那就快了。换句话说，我们比方啊，你已经有当大学研究所权威教授的资格，你今天再回转来，从小孩子读幼稚园、读小学那么用心，再做学问上来，你说如何？这个结果是怎么样？那当然是好！那当然好！况且你还没有到那个程度，不要狂妄，千万注意。</p><p> 所以，释迦牟尼佛的教法，在这个《禅秘要法》里，它真是显密所有法门归纳起来。你看他，除了叫你礼拜佛，至心求忏悔以外，其它的宗教程序、宗教色彩、外衣都剥掉了，清清楚楚。所以，此法之妙，妙不可言，特别注意。下面还有一点，你念完。</p><p> <strong>【尔时阿难。即从坐起。整衣服。为佛作礼。叉手长跪。白佛言。世尊。此法之要。云何受持。当何名此法。佛告阿难。此名观身不净杂秽想。亦名破我法观无我空。汝好受持。为未来世。浊苦众生。贪淫多者。当广分别。佛说是语时。释梵护世。无数天子。持天曼陀罗华。摩诃曼陀罗华。曼殊沙华。摩诃曼殊沙华。而散佛上及诸大众。顶礼佛足。赞叹佛言。如来出世。甚为希有。乃能降伏骄慢邪见迦絺罗难陀。亦为未来贪淫众生。说甘露药。增长天种。不断三宝。善哉世尊。快说是法。龙神夜叉。乾闼婆等。亦同诸天。赞叹于佛。尊者阿难。迦絺罗难陀。及千比丘。无量诸天。八部之众。闻佛所说。欢喜奉行。礼佛而退。得此观者。名十色不净。亦名分别诸虫境界。是最初不净门。有十八方便。诸境界性。不可具说。入三昧时。当自然得。此第十八一门观竟。】</strong></p><p> 这个是总结，由上面来十七个观法的总结。由白骨观、不净观起，最后见佛。</p><p> 那么下面，另一卷，第三卷，也是白骨观的修法，大同小异，但是又不同。</p><p> 那么，我们等到几号？……通知几号？不是大概，我们有通知吗？发了没有？诸位自己不要忘记了，通知都拿到了啊？……一月七号，星期三开始。请大家诸位都拿着那个通知，自己不要忘记了，我们没有办法再临时通知啊。一月七号星期三晚上，再恢复继续讲这个第三卷。今天我们到这里为止，好嘛？不要起来、不要敬礼……好了，散会。</p></div>"
},{
    "title": "禅秘要法讲座 17",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 今天，有位道友提出来，对于白骨观，总是不容易观得起来，反而觉得观佛像容易。这个问题，我们今天的课程正好讲到这里，等一下可以做整个的结论。</p><p> 今天要讲的是《禅秘要法》第三卷，《禅秘要法》第三卷正好讲到观想佛，观想佛的境界的禅定修法。那么，也包括了禅定、净土，包括了密宗，密宗的修净土念佛的方法，有一种是弥陀佛的修法，修观想……这个弥陀佛修法里面也分两种：有东密的，就是流传在日本高野山的，用我们中国过去的，保留在那里的一种修法；一种是藏密，西藏密宗的修法。</p><p> 西藏密宗的修法，大部分弥陀修法---念佛，同长寿佛的修法要连起来。如果两个不配合，光修弥陀佛的修法，这个人很容易修成功，就想离开这个世界，马上就走了，因此，要把他拉回来，再加上一个长寿佛的修法，那么，也可以随时往生，也可以随时留在这个世间。</p><p> 实际上，这个修法的组织系统，就是释迦牟尼佛亲自所讲的《禅秘要法》第三卷念佛法门的这个系统，是一个东西。</p><p> 不过，在我们开讲这个方法之前，有一个问题要解决的，也就是我们方丈和尚前几天提出来的，我们老和尚提出来：中国的禅宗赵州和尚说过一句话：“有人在我禅堂里念一声佛号，要罚他挑水洗三天的禅堂。”就是这一句话。赵州和尚是唐末、五代之间的人，禅宗的，所谓“赵州和尚八十尤行脚”，年纪到八十岁了，还到外面到处参学。人家问他：为什么你到八十岁……难道你悟的道不对？修的道不对？不是这个意思，他说：只为因为没有打成一片，怎么叫没有打成一片？有些人的修行，可以成佛，没有办法成魔，这话怎么讲呢？可以出世，走清高的路线，没有办法入世；（是）圣人的境界，而入世行动上很平凡，自己没有圣人的气味，所以，一个代号就叫：可以入佛，也可以入魔。有些修行人可以在清净的道场上、山林中修道，没有办法入世做人、做事，那么，所谓叫做不能打成一片的道理。</p><p> 赵州和尚八十尤行脚，只为没有打成一片，这是赵州和尚谦虚的话。我们看了古人的许多东西，有许多话不一定对，（有些）是狂妄的，讲笑话的；有许多话是谦虚的。</p><p> 那么，因为赵州和尚的名气与他的影响之大，说了这么一句话：有人在我禅堂里念一声佛号，要罚他挑水洗三天禅堂，因此啊，后世禅宗跟净土，变成几乎水火两派，所以学禅的人绝对不能念佛的，念佛的人、修净土的人听到禅宗是这个样子（讲），觉得简直是太可怕了、太狂妄了。</p><p> 事实上，赵州和尚这一句话有个绝大的秘密，（到）现在，从来也没有人提出来过——提这个问题的人很多，答案很少。现在，我们要把这个秘密要解开了，这个秘密是什么秘密呢：赵州和尚是绝对赞成念佛的。怎么说呢？因为大家不懂赵州和尚这个话。所谓禅宗的禅堂，过去从唐代百丈禅师以后，禅堂里头没有供佛像，不准供佛像，因为佛法僧三宝……当时的、当代的大和尚方丈就是禅堂堂主，就是代表现在的佛，三宝合一的。必须要证悟到的人来主持这个禅堂，（做）堂主，也必须是这个庙上的大方丈。他本身，随时到了证悟到了、成就的人，念念在净土中，本身就是佛、唯心净土、念念在佛中，如果已经悟了道念念在佛，不是念念不在佛，再加念一声佛号不是多余了嘛！头上安头啊！可见这个人所悟的道、所证的道没有彻底。所以说，在禅堂本身就是净土，在禅堂里的修行众他本身已经达到心念清净的净土境界，本身已经净土境界，净的上面加一点灰尘固然脏了，加一点黄金也脏了，不能加一点东西！所以说在禅堂本身就是净土，就与西方极乐净土念念相应的。那么，还在那里自己信心不够，加一句佛号，所以他说该罚。是这个道理。</p><p> 那么，再进一步的道理呢？所谓真的到了禅堂境界了，念念在唯心净土中啊，如果还有起心动念、散乱处，那当然，那岂止罚，要赶出禅堂。所以，赵州和尚的道理……禅宗人讲话，往往歇后语很多，歇后语讲一半，你自己有智慧去了解。因此说，赵州和尚是赞成念佛，这才是真正净土的境界。</p><p> 距离赵州不到一百年之间，禅宗另外一个大师，宋代的永明寿禅师，他是专门以禅为主，但是提倡念佛的。所以，他就做了四个偈子，这是有名的永明寿禅师的四个偈子，就是连带赵州的观念一起来的。</p><p> 因为唐代以来，走禅宗的路线很多，但每每发现一个什么呢？不稳当，有一点道理，自己（就）认为成佛了，那么往往变成狂禅了。所以，到了永明寿禅师手里，他除了禅以外，专门提倡禅净双修的。所以，他的四个偈子，“有禅无净土，十人九错路”，十个人，九个人走错了路。“阴境若现前，瞥尔随他去”，平常觉得念头很清净，五阴境界现前的时候，就是快要四大分散，要死的时候，平常清净的境界完全没有了，这个时候，莫名其妙就随业力牵走了，这个禅是不到家的禅，就是禅定修不到家的，没有用的。说“无禅有净土”，如此，干脆还是专修净土念佛，没有禅有净土，“万修万人去。但得见弥陀，何愁不开悟。”“有禅有净土，犹如带角虎。现世为人师，来生做佛祖。无禅无净土，铁床并铜柱。万劫与千生，没个人依怙。”这个就是有名的永明寿禅师提倡的禅净双修的偈子。</p><p> 那么，这里所讲的禅呢，不足以代表真正的全体禅宗，而（是）讲禅定——禅定跟禅宗有分别哦，譬如现在讲的《禅秘要法》是属于禅定。禅定所得的，或者参禅宗的人，偶然得到一点清净境，偶然得到妄想断了，“见山不是山，见水不是水”，什么都不是，那是你健康的时候哦。那么，如果发烧的时候，烧还是烧，痛还是痛哦，你也是“见痛不是痛，发烧不是烧”，那差不多了；如果发烧还是烧，“哎哟”还是痛，那靠不住。</p><p> 所以，还是把握有念去修。所以，赵州和尚那一句话，是真正讲的修净土，并不是反对念佛。这个奥秘的地方，我们需要了解。</p><p> 所以，宋代的一位居士，李文和（？）居士，是宋朝一个驸马，所谓驸马者，上公主——历史上，上公主就是皇帝的小姐嫁给他。驸马就是千古以来很难做的，做皇帝女婿也很不好办，因此他是学佛，学禅宗开悟了。他有几句话很重要，“修道须是铁汉”，一个修道的人必须要……“修道须是铁汉”。“着手心头便判”，这个是非一到手……“直趋无上菩提，一切是非莫管。”这是说，我们对于这些知见，一到手里，马上要分别得清楚。</p><p> 这里正好（讲到）念佛，这是佛亲口说的，非常重要。但是，我们要（把）前面十八层次序的白骨观都修好，到现在第十九个法门，（是）真正修到走上念佛的观想法，那是万修万到，非常稳当。</p><p> 念佛的观法，怎么观法？我们先看原文。你念吧。</p><p> <strong>【如是我闻。一时佛住舍卫国。祇树给孤独园。尔时世尊。与千二百五十比丘俱。是时会中。有一比丘。名禅难提。于深禅定。久已通达。成阿罗汉。】</strong></p><p> 我们注意啊，这一位弟子，当时向佛提出问题的这位弟子，他本身禅定已经很高深了，已经得成阿罗汉果了。</p><p> <strong>【三明六通。具八解脱。即从坐起。正衣服叉手长跪。而白佛言。如来今者。现在世间。利安一切。佛灭度后。佛不现在。诸四部众。有业障者。若系念时。境界不现在前。如是烦恼。及一切罪犯突吉罗。乃至重罪。欲忏悔者。当云何灭是诸罪相。若复有人。杀生邪见。欲修正念。当云何灭邪见杀生恶烦恼障。】</strong></p><p> 好，慢一点，请你等一下啊。现在有个问题，第十九个修念佛观法门的修法，是这位“禅难提”尊者，是佛的弟子，而且当时，他本身已经证得阿罗汉果，神通具足，一切都解脱了，他不为自己，为后世人着想，他向释迦牟尼佛问一个问题。他说：现在，你还在世间，肉体还在世间，能够说法，那么，大家跟着你学，能得到利益；假设你过世了以后，将来有些人，你注意一个重点，“有业障者”，业力的障碍，修持业力障碍非常深，“系念”，要想修禅定的时候，妄念断不了，思想妄念断不了，“境界不现”，所以观白骨也观不起来，这个大家都有经验啊，很多（人）怎么观也观不起来，就是说，业障深重，境界不现前。“如是”，这个样子，“烦恼”，这些思想烦恼太多的人，乃至罪业很重——业障不一定是罪业，这个人福报很大，事情很多、很烦，管的事情很多，就是善的业障；坏的一方面呢，过去犯罪，错误的、恶的业障太多了，“犯突吉罗”戒律，这种戒律等于犯了根本大戒，在佛的修持人的集团里，要赶出去的。</p><p> 他说，犯根本大戒，乃至有更重罪业的人，想求忏悔的人，忏悔罪业，应该怎么灭除这个罪业？怎么样能够忏悔？还有人，犯了“杀生”的罪、“邪见”的罪，杀生、邪见多了，正念提不起来——邪见就是观念思想问题，走错了路，那么，正念提不起来。如何去掉这些罪障，而能够修持观想，“正念”可以现前？就是我们现在碰上的，很多人做观想观不起来，什么原因呢？烦恼的障碍重。顺便提出来重复一下，使大家注意。</p><p> <strong>【作是语已。如大山崩。五体投地。顶礼佛足。复白佛言。唯愿世尊。为我解说。令未来世一切众生。恒得正念。不离贤圣。尔时世尊。犹如慈父。安慰其子。告言善哉善哉。善男子。汝行慈心。与慈俱生。今具大悲。无漏根力。觉道成就。汝于今日。为未来世一切众生。问除罪法。谛听谛听。善思念之。尔时世尊。即放顶光。此光金色。有五百化佛。绕佛七匝。照祇陀林。亦作金色。现此相已。还从佛枕骨入。】</strong></p><p> 好，先停一下啊。现在，我们第一个要注意的问题，这同修法有关系的。我经常问许多同学们一个问题：《楞严经》上佛有三次放光，三次不同的部位（时间），一次是顶上放光、一次是眉间放光、一次是胸口放光，这代表了什么？大家要特别注意。那么，大家要研究《楞严经》，你看佛说法，说哪一种问题的时候，才放这种光明；而哪一个问题放的部位为什么不同？这个是修行事相上值得注意的。</p><p> 现在佛又说，观想念佛法门，是从头顶上放光。你注意啊，这个不是普通讲空了，这是每个地方都讲到事上。由头顶上放光以后，照遍了五百位化佛，境界扩展得很大。最后，统统的光，从后面的骨头，枕骨，后脑的枕骨再收回来，千万注意这个问题啊。这是修念佛法门。</p><p> 我们都晓得，修念佛法门，一个人最后要死的时候，临命终时要走，从头顶走（是）最好往生的路。这个头顶以自己的头发为标准，每个人头发不同，（以）自己前额的头发为标准四个指头，四个指头平放下去，这里是自己的顶，每个人不同，有人额头长的头发（从）这里开始，那这个顶就到达了这里。那么，这个是顶，普通我们针灸时候，中国人针灸叫百会穴，这里可以针灸。这是修往生法，真正有修持到达了这个地方，顶是开的，开开，那么这个顶骨这里有七个小孔，所以平常扎针也可以扎，修持到了这个时候，顶骨是开的，几乎有一点像婴儿那样，生下来有跳动的。所以，往生的时候，多半都向头顶这一类走，但是，这是要有相当修持的人，功力深一点的可以。普通还有一个往生捷路呢，就是靠后面一点，还有个穴道，就是我们摸自己的头骨，有些人很明显的，这两个骨头中间有一条槽一样，一个坑陷下去，顶骨这个地方可以走。所以，这个顶骨同修持的关系非常大。</p><p> 佛在经典上已经把生理上的秘密，给我们透漏出来，（但）没有明显地告诉我们，但是要注意这一段。所以，这个光是从顶上出去，出去以后，两个路线回来，从后枕骨这里再进入自己的身体，这个要注意的。好，现在你继续念。</p><p> <strong>【尔时世尊。告禅难提及敕阿难。汝等当教未来众生。罪业多者。为除罪故。教使念佛。以念佛故。除诸业障。报障。烦恼障。</strong></p><p> 念佛者。当先端坐。叉手闭眼。举舌向腭。一心系念。心心相注。使不分散。心既定已。先当观像。观像者。当起想念。观于前地。极使白净。取相长短。壁方二丈。益使明净。犹如明镜。见前地已。见左边地。亦使明净。见右边地。亦使明净。及见后地。亦使明净。使四方地。悉平如掌。其一一方。各作二丈地想。极使明净。】</p><p> 好，先停一下啊。这是一个密法的观法，佛告诉我们，先端坐，端容正坐，能盘腿打坐最好，“叉手闭眼”，所谓叉手就是合掌，佛经上经常讲的叉手，并不是这样啊（师示），因为我们讲叉手……也不是这样（师示），那是打架的叉手。这个叉手是合掌，所谓叉手而跪，是合掌。闭着眼睛。注意这个舌头，向上腭，上面口腔，这个口腔上面两个门牙的后面，这个地方有个穴道，通这个脑下垂体的，这个穴道有时候针灸还可以在这里打针呢，这个地方是上腭，很重要。</p><p> 那么，这个姿势坐好了，“系念”，“一心系念，心心相注”，然后念佛。念佛并不是没有散乱心，有散乱，不过，一个念头、一个念头，所谓“心心相注”，就是一念一念像流水一样，一个波浪，一个波浪，接一个波浪，一句一句接一句。“心心相注”，慢慢练习到不分散，念佛第一步先要做到这样。他并没有叫你念阿弥陀佛还是哪个佛，都不管，你喜欢走阿弥陀佛的门路也可以，喜欢走释迦牟尼佛的门路也可以，东南西北十方都有佛，你念弥勒菩萨也可以，这个他没有给你规定，只叫你念佛这一声。念，不是嘴里念，思念这个念。</p><p> 先把心念定了以后，起观。先当“观像”，你把佛的影像，画像也好、塑像……</p><p> 在密宗的修法呢，我告诉过大家的，假定你自己（有）一个专修的地方，自己打坐的位置在这里，你要摆一个你认为最好的佛像，一切都合于规矩的，摆在刚刚使你的眼睛看到的平座，相对而坐。那么，你观这个佛像，已经在眼睛普通意识上，这个影像很深了，所以，你开眼闭眼，这个影像始终存在，这叫做先由有分别影像观起。那么，这个念佛的法门，观想的时候，你要去思想，念这个佛像。这是一个。</p><p> 下面为什么说……我们坐在那里——再讲一遍（姿势），坐好了，外形的姿势坐好了，这样合掌也可以，结定印也可以，念佛的定印是右手在下，左手在上，同我们平常的三昧印相反。三昧印是左手在下，右手在上——我跟诸位方向相反哦，要注意。这个念佛的手印（是）右手在下，左手在上，这样也可以（师示）。</p><p> 然后心念，心念也叫瑜伽念、瑜伽念诵。这个都做好了以后，要起观的作用，在密宗起观呢，专门要一个坛场、修的环境，最好的环境啊修这个像，观法很严重……这个场地，要固定的，这里前面是两丈远，四面都两丈，乃至一切都是干净的，不能够有一点杂色，最好是什么？玻璃、四面玻璃，但是，假使四面是玻璃，上面也是玻璃，下面也是玻璃，这么盖一个房子，你这里有个打坐的位置坐在这里，前面有佛像，这样一念佛，有个很严重的问题，也许不到七天你就死掉了，这个肉体不要了，你人就分开走了，很清楚地走了。</p><p> 所以平常啊，密法里不教你这个方法，因为一般没有这个定力。你不相信，可以自己做一个实验，你摆着一个大的穿衣镜，你站在那里看自己看上一个钟头，就会看见自己好像精神同身体分裂开了一样——分离，不是分裂。</p><p> 所以，有很快捷的念佛往生的法门啊----自己不想多留，等于，我叫它是最高明的自杀方法，哈哈，坐在那个里头一念佛啊，马上自己跑掉了，可以离开。可是，你平常没有修持、没有定力呀，非常危险！我先把好的、坏的都告诉大家，这些都……，……打坐在这里，这两个眼睛不是平视啊，两个眼睛半开半闭，看到前面这个地是干净的，是净地，有两丈见方。那么，慢慢的用意念观想前面的地完全变成净土，净土境界玻璃为地——所谓玻璃为地，我们看《阿弥陀经》上也讲，西方极乐世界以玻璃为地——我们大家有一个观念，一想到玻璃为地呀，大概（是）我们新竹玻璃工厂出来的玻璃，或者是外国来的、意大利来的水晶玻璃，这个观念已经错了。</p><p> 所谓玻璃为地，（是）拿世间的玻璃做比方，就是那么明净、透明，如果我们心念里头还有世间玻璃的观念，这个已经不净了，不是净土了。特别要注意，这是个比喻。</p><p> 所以，要念到观前面的地空灵，非常“明净”，“犹如明镜”可以照见自己，那么，一念观清楚了，这个境界现前了，心境非常清明，这四方面都有了，是这个道理。你再念下去。</p><p> <strong>【地既明已。还当摄心观于前地。作莲华想。其华千叶。七宝庄严。复当作一丈六金像想。令此金像。结加趺坐。坐莲华上。见此像已。应当谛观顶上肉髻。见顶上肉髻。发绀青色。一一发舒长丈三。】</strong></p><p> 这都是观佛像了，完全照三十二相、八十种好观来，我想，这个我想不要补充了，看原文。</p><p> <strong>【还放之时。右旋宛转。有琉璃光。住佛顶上。如是一一孔。一毛旋生。观八万四千毛。皆使了了。见此事已。次观像面。像面圆满。如十五日月。威光益显。分齐分明。复观额广平正。眉间毫相。白如珂雪。如颇梨珠。右旋宛转。复观像鼻。如铸金。铤似鹰王喙。当于面门。复观像口。唇色赤好。如频婆罗果。次观像齿。口四十齿。方白齐平。齿上有印。印中出光。如白真珠。齿间红色。流出红光。次观像颈。如琉璃筒。显发金颜。</strong></p><p> 次观像胸。德字卍字。众相印中。极令分明。印印出光。五色具足。次观佛像臂。如象王鼻。柔软可爱。次观像手。十指参差。不失其所。手内外握。手上生毛。如琉璃光。毛悉上靡。如赤铜爪。爪上金色。爪内红色。如赤铜山与紫金合。次观合曼掌。犹如鹅王。舒时则现。似真珠网。摄手不见。观像手已。</p><p> 次观像身。方坐安隐。如真金山。不前不却。中坐得所。复观像胫。如鹿王腨。直圆满。次观足趺。平满安庠。足下莲华。千辐具足。足上生毛。如绀琉璃。毛皆上靡。脚指齐整。参差得中。爪色赤铜。于脚指端。亦有千辐相轮。脚指网间。犹如罗文。似雁王脚。如是诸事。及与身光圆光项光。光有化佛。诸大比丘众化菩萨。如是化人。如旋火轮。旋逐光走。</p><p> 如是逆观者。从足逆观。乃至顶髻。】</p><p> 好，这里要停一下啊。刚才上面讲的一路观佛像，观下来，这个大家都很熟悉，所以我不补充了，就是有佛的三十二相、八十种好。在普通呢，在西藏一般学密的出家人，差不多七八岁起，第一个学习的，就是画佛像，或者塑佛像，所以佛的三十二相、八十种好，已经很熟了，所以做观想的时候，一观就观起来。所以观眉间，就是这里（师示），白毫光，一条白毛转拢来，稠结拢来，就是我们看塑的佛像，这里有一颗珠子，像印度人的那个装饰品的道理是一样的。</p><p> 这个眉间白毫光也代表一个修持人有成就，他眉间这里自然放光，自然有亮光出来，是个圆光。那么，有些真正的眼通，所谓普通现在讲的第三只眼——管他第三只啊、第四只啊，你不要管了。所谓天眼通，这个地方的气脉一定打开了，一定打开了的时候，一定是有光的，这个眉间白毫光。</p><p> 那么，普通教我们观法，从上面，从佛的头上观下来。但是，这里有个重要的话：不一定，他说，“如是逆观”，也可以同白骨观一样，先由佛的脚趾头观起——刚才来的次序是从顶这里观起，顶修好了的人、佛，这里有个肉托，就是拱出来的，一路观下来。也可以同白骨观一样，从脚趾头观上来。注意，这不一定，就看你自己观法……。</p><p> 那么，为什么佛不告诉你？有一个道理的，所谓修持，“知时知量”四个字最重要，看自己的应用，知时知量。譬如，一个人年纪大了，现在开始学佛，或者自己血压很高，做这个观想很严重了，那要怎么观起呢？可以先观脚趾头开始，逆转的，没有问题。那么，譬如有些人血压特别低，那可以从顶上肉髻观下来。那么，这个也不呆定的，我这么告诉大家的也不是呆的。</p><p> 第一，大家自己修行要知时知量，你晓得，测验下来，觉得这样修持对我很熟练，一条路线……你照那个路线走。总而言之，任何的修法，对了的时候，对身心都有特别舒适的感受；不对的，等于吃药一样，吃不对了以后更难过，你赶快要调方法，要注意这一点啊。</p><p> 这一点啊，道家的比方很对，这就叫做“火候”，这个跟煮菜、煮饭一样，告诉你饭是怎么做的，这个饭怎么做刚好？或者你要硬一点、我要软一点，这个火候到什么程度为止，靠你自己的经验。</p><p> 我补充的就是这个道理，现在讲逆观，倒转来观，“逆观乃至顶髻”，由脚起观到头顶。</p><p> <strong>【顺观者。从顶至足。如是观像。使心分明。专见一佛像。见一像已。复当更观。得见二像。见二佛像时。使佛像身成琉璃。出众色光。焰焰相次。如烧金山。化像无数。见二像已。复见三像。见三像已。复见四像。见四像已。复见五像。见五像已。乃至见十像。见十像已。心转明利。见阎浮提。齐四海内。凡夫心狭。不得令广。若广大者。摄心令还。齐四海内。以铁围山为界。见此海内。满中佛像。三十二相。八十随形好。皆使分明。一一相好。有无数光。若于众光。见一一境界。杂秽不净。从罪报得。复应更起。扫兜婆涂地。造作净筹。谦卑下下。修诸忏悔。】</strong></p><p> 这一段补充一下。等到你佛像观起来，自己开眼闭眼，看到都是光了、都是光明，佛像也很清楚。但是，这个光明里头有不干净的。譬如一个修持禅定的人，假设突然在境界里头看到黑光，那当然是有灾难的事，很不好。等于我们拼命揉眼睛，揉了以后，眼睛前面也看到很多光，故意刺激它发光，这个里头有黑点，或者黑色的，很不好，就是有灾难；假设有很红的，非常红的，这个光也不好，太红的光有魔障。乃至于配合黑光，也可以说，在身体上讲，下部的毛病，身体内在以下有毛病；红色的呢，血压又高，对外面的事情讲（是）有魔障；绿色的很严重，魔障很严重。当然，最好是金光、白光，这个里头有杂物的光，就是表示有毛病。有时候有灰色的光……。</p><p> 自己每一天，测验自己一看，很清楚的，尤其有修持的人。你譬如说，不管你怎么修持，修持越好的人，他的感应越灵敏，忽然眼睛一个苍蝇一样飞一飞，好，你晓得有小灾难找你麻烦了，你看要不要受，要接受嘛，没有关系；不接受，你就要想办法了。</p><p> 在这里稍微告诉我们，观佛光观出来的，这个境界里头有杂物不净的，这就是业报要来现前，所谓“纵使经百劫，所作业不亡；因缘会遇时，果报还自受。”这个地方赶紧要起来，“扫兜婆涂地”，地上打扫干净，檀香涂抹，赶紧——所谓“净筹”，“筹”现在人不用，用念佛珠，就是一颗一颗计数的，赶紧礼佛求忏悔，拜佛求忏悔。晓得这个现象，就是说，重整这个道场的环境，赶紧拿着数珠计数，礼佛拜佛，祈求“忏悔”。</p><p> <strong>【复当安心正念一处。如前观像。不缘余事。谛观像眉间。观像眉间已。次第观其余诸相。一一相好。皆使分明。若不分明。更复忏悔。作诸苦役。】</strong></p><p> 观不清楚的人，自己更要“忏悔”，为什么观不清楚啊？你心境的乌云障碍太大、业障太大，观不起来。</p><p> 还有一句话，除了“忏悔”以外，最好自己多做“苦役”，做劳动。你说，那我多拜几次佛，那还不算劳动啊？多做一点为大家、为别人应该做一点劳苦的事，劳其筋骨的事情。这个道理，所谓有一句话，“劳者善心生”，一个人适当地劳役，慢慢就引起善心。</p><p> 所以孔子也说过，“小人闲居为不善”，自己四体不勤、五谷不分，悠闲到极点，一天坐在那里叫做修行，实际上变成了……不好呢，就是“小人闲居为不善”，反是糟了。</p><p> 所以，这个时候，重点就是告诉你，要做很深的“忏悔”，同时要做一切的“苦役”，自己拿苦头给自己吃。</p><p> 休息了。</p></div>"
},{
    "title": "禅秘要法讲座 18",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p><strong>【见诸佛像。身色端严。三十二相。皆悉具足。满四海内。皆坐华上。见坐像已。复更作念。世尊在世。执钵持锡。入里乞食。处处游化。以福度众生。我于今日。但见坐像。不见行像。宿有何罪。作是念已。复更忏悔。既忏悔已。如前摄心。系念观像。观像时。见诸坐像。一切皆起。巨身丈六。方正不倾。身相光明。皆悉具足。见像立已。复见像行。执钵持锡。威仪庠序。诸天人众。皆亦围绕。复有众像。飞腾虚空。放金色光。满虚空中。犹如金云。复似金山。相好无比。复见众像。于虚空中。作十八变。】</strong></p><p>这都是你意境上观想起来的，要你意境上做如此观想。</p><p><strong>【身上出水。身下出火。或现大身。满虚空中。大复现小。如芥子许。履地如水。履水如地。于虚空中。东踊西没。西踊东没。南踊北没。北踊南没。中踊边没。边踊中没。上踊下没。下踊上没。行住坐卧。随意自在。</strong></p><p><strong> 见此事已。复当作念。世尊在世。教诸比丘。右胁而卧。我今亦当观诸像卧。】</strong></p><p>这一段还要观卧佛，睡相，不但是坐相、立相。睡相，靠右边是睡，手放脸颊这里，左手放置大腿边上，屁股这里，右面的脚（在）下面是弯的，左面的脚是伸直的，下面是这样弯的，勾着的（师示），这样睡着，卧相。</p><p><strong>【寻见诸像。牒僧伽梨。】</strong></p><p>“僧伽梨”就是袈裟，就是看到一切佛像把袈裟叠拢来做枕头。</p><p><strong>【枕右肘右胁而卧。胁下自然生金色床。金光栴檀。种种杂色。众妙莲华。以为敷具。上有宝帐。垂诸璎珞。佛放大光。满宝帐内。犹如金华。复似星月。无量宝光。犹如团云。处空明显。中有化佛。弥满虚空。</strong></p><p><strong> 见卧像已。复当作念。过去有佛。名释迦牟尼。唯独一身。教化众生。住在此世。四十九年。入大涅槃。而般涅槃。犹如薪尽火灭。永灭无余。我今心想。以想心故。见是多像。此多像者。来无所从。去无所至。从我心想。妄见此耳。】</strong></p><p>请注意，刚才我们提到，上面所修的都是观想法，密宗修的路子都是如此。我们把佛像都看清楚了，根据经典，每一个成佛的人（有）三十二种相不同，同我们普通人不同，跟着这三十二种相的不同，有八十种随行好，这相完全不同。那么，平常（对）画像、塑像熟了，看熟了，所以在这个念头里头，在禅定观想的境界里，自己把一个一个影像（观）出来，唯心所造的。</p><p>如果你在观想中，想想……真看到一个佛来跟你讲话，你不要管啊，你正在……诶，好，我正在观想……有个真佛来，他跟你讲话，你也听他的，那你就着魔了，佛就立刻变成魔。</p><p>拿现在的话，现在的观想就是我们训练我们自己的意识思想，非常严重地训练自己的意识思想，构成佛的一个画面。等于一个艺术家画一个画，或者一个艺术家谱一个音乐，或者一个雕塑家构想一个雕塑，我们人没有看见过的，他自己自我可以做主的，（用）意识把它构想出来，那是对的。</p><p>如果你正在修持的时候观想境界，结果啊，你自己都没有想出来，你没有想的时候，下意识有一个佛像出来，甚至于（是）活的，还跟你讲话……，很多人因此以为是走入神通境界，实际上（是）到神通的弟弟那里去了，到神经那里去了，慢慢地就到了神通的最小弟那里，精神就分裂了，就完了。</p><p>现在要我们特别注意，所谓观想，（是用）我们自己的意识思想，硬把它构成一个这样的心理境界。在密宗，这样的修法叫做生起次第，本来本空，没有的嘛，是我有意把它生出来，叫生起次第，是我有意把它观想成功的，观想观出来的。假设你做不了主，看到佛像、听到什么声音，有人给你讲什么，那就不对了，千万注意这个啊！</p><p>好了，密宗修法的这个生起次第以后，要转入圆满次第。所以，每个修法有两个次第，特别注意啊。生起次第，本来没有这个东西，我把它构成功，然后，念头可以专一了，我要观想哪样，观想就呈现，立刻要进入圆满次第，就是《禅秘要法》所讲的易观，要换一个方法。圆满次第是万缘放下，一念皆空，佛像什么都没有。这个时候，就是赵州和尚讲的，在禅堂里，你还念一声佛，罚你挑水洗三天禅堂，因为这个时候走入法身清净佛，没有佛的形象了。</p><p>所以这里注意，修到这里，你就要观念清楚了，“我今心想”，这一切境界都是我观想起来的，“以想心故，见是多像”，所以，看见了那么多的佛像。“此多像者”，这样多的佛像，“来无所从，去无所至”，都是空的，把这些观想念头到此，一概放下，完全一念清净，真正法身净土现前，这个要特别注意。</p><p><strong>【作是念时。渐渐消灭。众像皆尽。唯见一像。独坐华台。结加趺坐。谛观此像。三十二相。八十种好。皆使明了。见此像已。名观像法。</strong></p><p><strong> 佛告禅难提。及敕阿难。佛灭度后。若比丘比丘尼。优婆塞优婆夷。欲忏悔者。欲灭罪者。佛虽不在。系念谛观形像者。诸恶罪业。速得清净。</strong></p><p><strong> 观此像已。复当更观。从像脐中。便放一光。】</strong></p><p>这里要注意，佛在这里告一个段落。真正要修行、忏悔罪业，唯有念佛法门，这是观佛的真正念佛法门，这都是佛当时亲口所教的啊。到这里又转了一个，他说，把这个前面的境界，你修持观想成功了，要另外换一个方法观想，从肚脐里头放光了，注意，刚才开始是顶上，现在要从肚脐放光。</p><p><strong>【其光金色。分为五支。一光照左。一光照右。一光照前。一光照后。一光照上。如是五光。光光之上。皆有化佛。佛相次第。满虚空中。见此相时。极使明了。】</strong></p><p>你稍停一下。这里要注意，为什么由肚脐上观起化光，分五种光？因为我们人的身体内部，所谓气的行路，有五行气，上行气、下行气，也就是下走的，所以我们人到死亡的时候，这个上行气跟下行气就脱开了，就死亡了。所以，人要到死的时候，常常觉得这里虚了，那么，快要断气的时候，上面“呃呃呃……”没有了，下面肛门张开了，大小便流出来，气就放掉了，上下中间脱开了，中行气脱开了。所以有上行气、下行气……。</p><p>譬如有许多人生病，下部的病，或者是下行气虚了，可是他精神很好，身体也很好，（那是）上行气还充足。</p><p>上行气、下行气、左行气、右行气，那么，中间的一个连锁，一个球一样的就是中行气。如果修持瑜伽、修持yoga，乃至学过密宗的气功、修过道家的这些气功，这个五行气要搞得很清楚。</p><p>佛说不说呢？说了，他不偏重于这一面，但是他更近一层，这个五行气，气可以化光，这是所谓《禅秘要法》，许多秘法他没有给你讲（明），要你自己参通，要各方面（都）学了，你就融会贯通了。</p><p>那么现在呢，他更近一层，不用气，用光。因为肚脐是化轮，化轮六十四根气脉一发动了以后，把五行气化光了，所以，可以治好各种病，要特别注意啊。</p><p><strong>【复见化佛。上至梵世。弥满三千大千世界。于三千大千世界中。见金色光。如紫金山。内外无妨。见此事时。心意快然。见前坐像。如佛真影。见佛影已。复当作念。此是影耳。世尊威力智慧自在。现作此事。我今应当谛观真佛。尔时寻见佛身。微妙如净琉璃。内有金刚。于金刚内。有紫金光。共相映发。成众相好。三十二相。八十种好。犹如印文。炳然明显。微妙清净。不可具说。】</strong></p><p>注意啊，这个时候是观佛给你灌顶，也就是密宗后来修的长寿法。观佛在上面（用）净瓶给你灌顶，从头顶上下来。上面的白骨观，到第十六观、十七观也有。大家年纪大，或者身体不健康，多修这个灌顶法下来，身体一定健康的。</p><p><strong>【手执澡瓶。住立空中。瓶内盛水。状如甘露。其水五色。五光清净。如琉璃珠。柔软细滑。灌行者顶。满于身中。自见身内。水所触处。八十户虫。渐渐萎落。虫既萎已。身体柔软。心意悦乐。当自念言。如来慈父。以此法水。上味甘露。而灌我顶。此灌顶法。必定不虚。尔时复当更起想念。唯愿世尊。为我说法。】</strong></p><p>这里停一下。就是说，叫我们做观想啊，灌顶，就是佛像在顶上灌顶，光灌到自己身体内，可以祛病、可以延年，密宗长寿佛的修法就是这个，由这个变出来的。</p><p>那么他说，佛的灌顶下来，我们身体里头的虫，道家叫做三尸虫，佛法叫做“八十户虫”，我们身上怎么那么多虫啊？现在，正有一位同学，特别从高雄……这位医生，我们那一位医生知道的，洪文亮医师，他因为不能亲自来听，他就把这里的录音带寄回去听，他发现一个问题，纠正我的说法，他打长途电话来说：补充老师的说法——客气话，纠正我的说法——才是对的。</p><p>上次我讲到佛说身体内部，生藏是消化系统，熟藏是排泄系统，不对，他的对。他听了我们讲的这个经，回去仔细研究，他高兴得不得了，他说：想不到两三千年前的佛啊，对于生理学透彻到这个程度，想不到！那么，他跟我通了长途电话，我说：不行，你要把资料立刻给我寄过来，哈，他寄过来了，刚刚寄到。</p><p>他说，这些虫是什么啊？细胞，细胞的活动……，我们的细胞随时在身体内部新陈代谢，所以，上面的白骨观讲，我们身体里头有很多虫，一个一个虫上面有嘴、有尾、有爪子，那个嘴啊、爪子啊，一个抓一个这样来的，很厉害，看起来……他说讲的太精彩了！我们的细胞变成红血球以后，什么二氧化碳……一大堆，他一封长信来了。他说，那些排泄出去了，新的连上来，硬是一个爪子一个爪子，硬是一个连一个，完全……太好了！他写了一封长信来……这一点，正是讲到这里啊。</p><p>所以，我们观想下来，新陈代谢的效果更快，可以治一切病。那么，洪医师写信来的报告是这样，你再念一下。</p><p>（下面{ }内的内容为同学念洪医生的信）</p><p>{比较原典的生藏与熟藏}你等一下，解释一下好了，免得念下去。{生藏方面，他分两点解释，第一点就是有二十户火虫，二十户风虫，在原典上是这么讲，说“二十户是火虫”，“二十户是风虫”}原典就是我们这本书上。{那么，洪医生他自己做的说明就是，火是代表化学能，风是代表由红血球里的血色素带来的氧。“户”，所谓“户”就是身体里进行内呼吸的大略分化区域。}</p><p>{那么，他的第二点讲，就是解释这本书上讲的，“户领八十亿小虫”，他在这边做一个数字统计，八十亿再乘上四十户，就是等于0.32兆。他做的文字解释是，人体里头的红血球平均有25兆，大部分在血管里头流动，只有八分之一左右的红血球——这个八分之一左右的红血球，正好就是我们刚刚八十亿乘四十户所求出来的0.32兆，在身体的组织里，和细胞进行着内呼吸。}</p><p>{那么，关于生藏方面，他还有第三点的解释，就是关于《禅秘要法》里面讲的“口含生藏”，每一小虫有四十九头，七个身，“眼皆出火”，那么洪医生的解释是说，从毛细血管游出来的红血球，就好像是靠着码头的船一样，贴近身体的细胞开始交换氧跟二氧化碳，所谓七个身还有四十九个头，就是说这些虫子，每一个虫子有七个身，还有四十九个头，这表示它们的作用点之多，跟红血球本身形状的扭曲变形，以利工作（有关）。“眼皆出火”就是表示能量的输入。}</p><p>{关于生藏的第四点解释是在作用方面，就是经文上面讲，“口含生藏”，“吸火动身，以熟生藏”，“上下往复，凡有七反”，“生藏熟已，各复还走入诸脉中。”他做的解释就是，“口含生藏”就是描写红血球贴近身体细胞的情形。所谓“吸火动身”就是描写内呼吸的时候，怎么样耗费动能。现在生理学已经告诉我们，当红血球游出毛细血管的时候，毛细血管里头百分之五十左右的蛋白质，也随着被推出了管外，幸好管外的淋巴液，又把渗出来的蛋白质，再送回到锁骨下静脉里头去。那么，他在这个淋巴液，幸好管外的淋巴液下面做了一个括弧，有个解释，就是说，没有了这些毛细血管外的淋巴液，红血球就无法自在地游动，进行它们的内呼吸工作。}</p><p>{他在前面再解释，“生藏熟已，各复还走入诸脉中”，他的解释是生藏熟了，二氧化碳交给了红血球，而又补充了氧，变成活泼泼的熟藏，这些工程完成之后，劳苦功高的小虫们，也就“各复还走入诸脉中”，又回到毛细血管里面去，继续它们的天路历程。}</p><p>{这一段内呼吸的描写实在是精彩极了，尤其是那一句，“更相呼吸，以熟生藏，上下往复，凡有七返”，这个“七”字对现代生理学有很深的提示。}</p><p>{在卷一第四页前半页，经文上写，“皆令肉两向披，见半身白骨。见半身白骨已，次观”，这个“半身”不必拘于左半身、右半身，或者是上半身，下半身，“半”字只是表示与还没有观成的那一半相对，所以，也不必刚好是二分之一，或左或右，或上或下。}</p><p>{上面是他大概就生藏所作的解释，下面是关于熟藏，他还有解释，熟藏他也分成几点。}</p><p>{第一点，经文上讲，“复有四十户虫”，他一个括弧就是，不明言多少火虫跟多少风虫，他的解释就是，因为熟藏已经交换过了氧跟二氧化碳。}</p><p>{第二点，“户领三亿小虫”，也就是说，交换好了氧跟二氧化碳以后，还没有离开身体细胞的红血球，当然要比作用中的红血球少得多。}</p><p>{第三点，“身如赤火，虫有十二头，头有四口，口含熟藏”，这个时候，洪医生的解释是，内呼吸已经不再需要，头跟口自然也就减少了。}</p><p>{第四点，关于和熟藏作用的工作情形，只是简简单单的说，“口含熟藏，爪间流血”……。他这几点就是针对上面的生藏互相做的比较。}</p><p>{这个东西，真要念起来，可能大家没有办法听得很清楚，因为要配合原文对照着看，是不是下一次整理以后，影印了发给大家？}</p><p>就是刚才讲到的，灌顶的时候，“水所触处，八十户虫，渐渐萎落”这一段，所以做这个补充，就是新陈代谢的作用。</p><p><strong>【罪业除者。闻佛说法。</strong></p><p><strong> 佛说法者。说四念处。说四正勤。说四如意足。五根五力。说七觉。说八圣道。此三十七法。一一分别。为行者说。说此法已。复教观苦空无常无我。教此法已。以见佛故。得闻妙法。心意开解。如水顺流。不久亦成阿罗汉道。</strong></p><p><strong> 业障重者。见佛动口。不闻说法。犹如聋人。无所闻知。尔时复当更行忏悔。既忏悔已。五体投地。对佛啼泣。经历多时。修诸功德。然后方闻佛所说法。虽闻说法。于义不了。复见世尊。以澡瓶水。灌行者顶。水色变异。纯金刚色。从顶上入。其色各异。青黄赤白。众秽杂相。亦于中现。水从顶上入。直下身中。从足跟出。流入地中。其地即时变为光明。大如丈许。下入地中。如是渐深。直到水际。到水际已。复当作意。随此光去。复观此水。水下淳空。复更当观空。下有绀琉璃地。琉璃地下。有金色地。金色地下有金刚地。金刚地下复见虚空。见此虚空。豁然大空。都无所有。</strong></p><p><strong> 见此事已。复还摄心。如前观一佛像。尔时彼佛。光明益显。不可具说。复持澡瓶水。灌行者顶。水相光明。亦如上说。如是七遍。佛告禅难提。此名观像三昧。亦名念佛定。复名除罪业。次名救破戒。令毁禁戒者。不失禅定。】</strong></p><p>这个方法的几个名称啊。</p><p><strong>【佛告阿难。汝好受持。此观佛三昧。灌顶之法。为未来世。一切众生。当广分别。</strong></p><p><strong> 佛说是语时。尊者禅难提及诸天众。千二百五十比丘。皆作是言。如来世尊。于今日为诸众生乱心多者。说除罪法。唯愿世尊。更开甘露。令诸众生。于佛灭后。得涅槃道。禅难提比丘。闻佛说此观佛三昧。身心欢喜。应时即得无量三昧门。豁然意解。成阿罗汉。三明六通。皆悉具足。</strong></p><p><strong> 佛告阿难。此想成者。名第十九观佛三昧。亦名灌顶法。汝好受持。慎勿忘失。为未来世。一切众生。分别广说。佛说此语时。诸比丘众。闻佛所说。欢喜奉行。】</strong></p><p>这一段，我们刚好（连带将）方丈老和尚提的禅净双修这个念佛法门，以及赵州和尚为什么说，有人在禅堂里念一声佛，罚他挑水洗三天禅堂的这个道理都解释清楚了。</p><p>下面，第二十个观法，由念佛法门……，就是一切修持的人，走忏罪、成道最好的路线，也包括了一切的修法。当然，这里观的佛像，是释迦牟尼佛像，但是现在，你可以用阿弥陀佛像观也可以……五方佛像都可以观。</p><p>比方有人说，在修道家的人最怕面对北方打坐，不敢，（怕）一切修不成。但是，北方正有不空如来的修法，反是更好。这一切都是三界唯心造。</p><p>到了第十九层，念佛的观想三昧修成了、练成了以后，带着这个肉体进一步再进修的，就要第二十个白骨观的修法，修气的修法了，走数息观了。</p><p>天台宗智者大师后来采用数息观而修六妙门的法门，就是从这个里面又重新变化出来的，采合了佛所传的修气的方法。下一个就是这个了。</p><p><strong>【佛告阿难。贪淫多者。虽得如此观佛三昧。于事无益。不能获得贤圣道果。次当更教自观己身。令如前法。还作骨人。使皎然大白。犹如雪山。复当系念。住意在脐中。或在腰中。随息出入。一数二随。或二数三随。或三数四随。或四数五随。或五数六随。或六数七随。或七数八随。或八数九随。或九数十随。终而复始。随息往反至十复舍数而止。】</strong></p><p>好，我来接下去。佛同阿难讲，上面的念佛法门修成功了，尤其有许多修密宗的，或者是修瑜伽术的，一切观想成功了，对于有一种人，生理禀赋不同，他的欲念特别强，这是狭义的欲念，专对男女……，……数息的时候，要进来这一口气、出去这一口气时计数一，在这里数。</p><p>如果身体很衰弱、衰老、生病，不得了了，快要死了，年纪也大了，气也……那赶紧要进来的时候计数，这是个非常重要的道理。</p><p>所以，有时候你夜里睡眠，睡得不好，不能睡着，你听呼吸要听出息，出气的呼吸，很快睡着了；如果你听呼吸治疗这个失眠，是听进来的呼吸，保你不会睡着，这个要注意的。</p><p>所以，你数……，至于你数进、数出，采用哪个方法，刚才交代了，我不说了。</p><p>“一数”，数（到）觉得呼吸很宁静，心里没有杂念，“二随”，第二数就不要数息了，（已经）是心息合一，心念配合为一了，就跟着息就是了，不要数了，叫做“一数二随”。就是说，怎么样随呢？你真到了心念专一，心息合一了以后，这一口气进来，也许很长很长，到脚趾间，到全身都灌满了，还是在吸气中，这个时候你不要把它切断了。为了再数，“哎呀，我第二数太长太慢了，赶快把它切断，来个三、四。”你是学会计还是打算盘啊，（就）不是在修行了，懂了嘛？</p><p>所以说，你“一数”，或者你一念专一了，跟气两个合一了，“二随”，第二下你不要数了，就随下去。或者你第一口气不能专一，二数，数到第二口气，心念合一了，气息很轻微了，二数就三随，第三你就不要数了，跟着气走，这懂了吧？</p><p>所以，大家有许多在国外看这个书，看的……我的妈妈！这个事情怎么解释呢？一数二随、三数四随、五数六随……结果有些在外国看了书啊，自己就一数，数了以后，二随，呵呵；三数，又计，四随，又随一下；然后再来第三数，第四又随一下……哎呀，后来写信来问，我说你信写不清楚，赶紧录音，录回来告诉我，我听了你怎么弄的，再告诉你。就是这个道理，你现在懂了吧？大家搞清楚了吧。</p><p>“一数二随”，或者一数做不到，心念还不能专一，你数到二、三、四、五，觉得心气都宁静专一了，不要数了，随，就是这样。“一数二随，或二数三随，或三数四随”，一切等等，到“七数八随”，“或九数十随，终而复始。”</p><p>计数的时候呢，最好是倒转来数，万一你光是心乱，心不能宁静，还是用数息观倒转来，一、二、三、四、五、六、七、八、九、十，数到十口气的时候倒转来，十、九、八、七、六、五、四、三、二、一，这样好，为什么？因为如果有些人打坐坐起来，“噢，我已经数了三百口气了！”然后变成又在练气功、又在赚钱。“噢，今天练了五百口气呀！”好像那个气就赚了很多一样，不要搞空事了。所以，不采用那个数字连堆上去的方法，有一增一减，就是一升一降、一顺一逆的方法来最好。所以讲“终而复始。”</p><p>万一你不能专一，还在数息上用啊，一二三四五六七八九十，这个气一进一出为之一；第二，一进一出，二；数到十口气，就倒转来数了。万一倒转来数到一，心还不能专一，再由一二三四五六又来，就是这样。总而言之，你觉得心息专一了，不要数了，随息了。</p><p>天台宗六妙门，第二妙门就是随，随到了以后呢，呼吸配合心念为一了，自己觉得没有呼吸了，止息，正好停住。</p><p>所以，我不是讲一个同学，自己常常到了止息了，他又觉得没有气息了一样，那个没有气息也是止息呀。你能够把它停住了以后，就是宝瓶气充满了，自然不要修炼宝瓶气了，就是这个道理。</p><p>尔时心意。恬静无为。自见身皮。犹如练囊。见此事已。不见身骨。不知身处。】</p><p>好，对不起了，这里还要补充了。你假设数息，观白骨观好了，走这个随息的工夫、这个修持的方法，慢慢慢慢，你感觉到自己白骨也空了、化光了，整个的身体像个皮球一样——还不是皮球、透明，就是密宗所要求的修到虹光之身，里头整个的中空了，完全是个气体。那么，这个定久了，身体可以悬空，不要这个座位，这样悬空就起来，身体就是圆……“练”就是绸子，很薄的丝织品，“练囊”，一个气囊、气袋一样。</p><p><strong>【尔时复当更教起想。还使身内心意身体支节。如白玉人。既见此已。复当系念在腰中脊骨大节上。令心不散。尔时复当自然见身上有一明相。大如钱许。渐渐广大。如摩伽大鱼耳。周遍云集。复似白云。于白云内。有白光明。如颇梨镜。光明渐盛。举体明显。复有白光。团圆正等。犹如车轮。内外俱明。明过于日。】</strong></p><p>先停一下啊。他说，你到达了止息，随息以后止息的这个境界，这个时候自己的身体，慢慢，白骨也空了，就是个空体，一个气体在。当然，你的思想、感觉、知觉是存在的。那么，你自己看不到身骨，没有身体的感觉了。</p><p>有一句话，佛不告诉你，就是说，舒服极了，这个时候人舒服极了，世间没有一样舒服的、快乐的事（可以）相比。</p><p>那么，到了这个时候，赶紧要起念，还是要起念，再观这个身体，好像变成个“白玉人”。再系念在腰里腰骨，大脊骨上，一念使心不散。</p><p>那么，这个时候稍稍定一下，马上在身体的内部发现一点亮光，很大的亮光。所以“有一明相”，光明的现象起来。所以，光明是由气修成功而生的。这个有相的光明起来，有形的，“大如钱许”，一个圆圈那么大。慢慢扩大了，“摩伽大鱼”，佛经上描写的摩伽大鱼大得很，比我们海里的鲸鱼还要大，有它的耳朵那么大，就是很大的一片。整个的身体内部起了光明，没有腑脏、没有心肝脾肺肾、也没有骨头，就是这个身体，一团光的一个肉体、白骨。那么，慢慢，开眼闭眼，自己身体内部的光明比太阳光还强烈，看得很清楚。</p><p><strong>【见此事时。复更如前。一数二随。或二数三随。或三数四随。或四数五随。或五数六随。或六数七随。或七数八随。或八数九随。或九数十随。或单或复。修短随意。如是系念。在于密处。使心不散。】</strong></p><p>这里有个秘诀了，“在于密处”，在哪里？</p><p>现在，像我对于这个密法，素来不密，我是一个观念——照密法的规矩，我的罪过是大得不得了，我也只好挑了这个罪过了。我的观念也不同：不管古今中外，一切圣贤、一切仙佛、一切教主，他的目的是对于世道人心、身心性命有利的，应该要布施出来，没有什么秘密。所以我反对有什么传法秘密……那除非是做生意。假使真的弘法，道是天下之公道，应该告诉人。至于说，人家学习拿去做了坏事，那是他的事情，他造业同我没有关系。我们的诚心是要对世道人心、对别人的身心性命有利处，不需要保密。</p><p>所以，这个密处的道理，历代都是保密，用不着保密。但是，现在我给你公开了，可是有害处，你自己去负责，非常有害处。</p><p>“系念在于密处”，就是后来密宗瑜伽所讲的海底，名称叫海底。在中国的道家，就是下部的会阴穴，下体的会阴穴，这个是“密处”。就是肛门之前小便之后，这个地方，肉体有个三角地带的这个地方，要定在这里。</p><p>你要注意呦，他讲，上面的气与光明修成了以后，最后定在这里，发动生命能，把所有的病都去掉了，那的确可以修到了祛病延年、返老还童。但是，你没有修到这个程度，你一定住密处啊，或者是遗精，或者是刺激性欲更强，犯淫欲的行为、罪恶更大。所以，好的、坏的我交代完了，没得事了。但是，你要修到了这个阶段，应该是定在密处。</p><p>不过有一点，我们在座的老年朋友多了，老年朋友可以用，老年朋友密处的这个生命泉源干枯了，所以，这一定啊，气数到了这个阶段，一止息的时候，一念一定在密处啊，生命能又唤起来。可是，要定得住啊，定不住啊，老还是老、病还是病；要定得住，可以把它挽回的。就是这样。</p><p><strong>【复当系念如前。更观腰中大节。观大节时。定心不动。复自见身。更益明盛。胜前数倍。如大钱许。倍复精进。遂更见身明倍增。长如澡罐口。世间明物。无以为譬。见此明已。倍勤精进。心不懈退。复见此明。当于胸前。如明镜许。见此明时。当勤精进。如救头然。殷勤不止。遂见此明。益更增盛。诸天宝珠。无以为譬。其明清净。无诸瑕秽。有七种色光。光七宝色。从胸而出。入于明中。此相现时。遂大欢喜。自然悦乐。心极安隐。无物可譬。复更精进。心不懈息。见光如云。绕身七匝。其一一光。化成光轮。于光轮中。自然当见。十二因缘根本相貌。若不精进。懈怠懒惰。犯于轻戒。乃至突吉罗罪。见光即黑。犹如墙壁。或见此光。犹如灰炭。复见此光。似败故衲。由意纵逸。轻小罪故。障蔽贤圣无漏光明。</strong></p><p><strong> 佛告阿难。此不净观灌顶法门。诸贤圣种。敕诸比丘比丘尼。优婆塞优婆夷。若有欲修诸贤圣法。谛观诸法。苦空无常无我因缘。如学数息。使心不乱。当勤持戒。一心摄持。于小罪中。应生殷重。惭愧忏悔。】</strong></p><p>“于小罪中”，自己每一天行为思想的一点小错误，都要忏悔，不要认为自己对，还找许多理由来，支持自己的错误。</p><p><strong>【乃至小罪。慎勿覆藏。若覆藏罪。见诸光明。如朽败木。见此事时。即知犯戒。复更惭愧。忏悔自责。扫兜婆涂地。作诸苦役。复当供养恭敬师长父母。于师父母。视如佛想。极生恭敬。复从师父母。求弘誓愿。而作是言。我今供养师长父母。以此功德。愿我世世恒得解脱。如是惭愧修功德已。如前数息。还见此光。明显可爱。如前无异。</strong></p><p><strong> 复当更系念。谛观腰中大节。念心安定。无分散意。设有乱心。复当自责。惭愧忏悔。既忏悔已。复见脐光。七色具足。犹如七宝。当令此光。合为一光。鲜白可爱。见此事已。如前还教系念。思惟观白骨人。白如珂雪。既见白骨人已。复当更教系念。住意在骨人顶。见骨人顶自然放光。其光大盛。似如火色。长短粗细。正共槊等。从其顶上。颠倒下垂。入顶骨中。从顶骨出。入颈骨中。从颈骨出。入胸骨中。从胸骨出。还入脐中。从脐中出。即入脊骨大节中。入大节中已。光明即灭。光明灭已。应时即有一自然大光明云。众宝庄严。宝华清净。色中上者。中有一佛。名释迦牟尼。光相具足三十二相。八十种随形好。一一相好。放千光明。此光大盛。如亿千万日。明赫炎炎。彼佛亦说四真谛法。光相炳然。住行者前。以手摩头。化佛复教言。汝前身时。贪欲瞋恚愚痴因缘。随逐诸恶。无明覆故。令汝世世受生死身。汝今应当观汝身内。诸萎悴事。身外诸火。一切变灭。</strong></p><p><strong> 作是语已。如前还教不净观法。观身诸虫。一切萎落。】</strong></p><p>好，今天到这里为止。因为这一段的观法，气，就是后世密宗气脉修法的开始。这一段的修法很长，好几层。今天时间到了，先到这里为止。</p><p>（起立！）行了，不要起立了啊，阿弥陀佛，谢谢，谢谢……（礼！）</p></div>"
},{
    "title": "禅秘要法讲座 19",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 我们现在，《禅秘要法》由白骨观一路下来，现在到第十九观，第十九观、第十九节的修法。这个修法依白骨，加上数息、加上观光,数息由气化光、化神。上次讲了一半，上次讲到气化光、化神，由数息观证到随息，化光、化神。当然，中间方法上非常仔细的还没有详细地讲，要大家自己仔细去研究、去体会。现在我们继续下去。</p><p> <strong>【见此事已。复当起火烧诸虫杀。虫既不死。复自见身。如白颇梨。自然鲜白。见白骨已。从头出光。其光大小。粗细如槊。令长丈五。复当作念。使头却向。复当作意。使头却向。令身皆倒。以头拄脊骨。对脐大节。见此事已。复当谛观。】</strong></p><p>  好，先停。就是继续上一次讲过的，然后修到光的境界，再么，要做火观，自己做火观，就是身体内部也起暖相，使一切火消灭本身的这些虫，等于也包括了这些细胞等等。但是事实上，就感觉到自己身体内部这些不好的东西都消灭了。</p><p> 那么他说，同开始的一切一样，像不净观，参考以前讲过的做不净观的那个修法，是一样的，看到内在、身内一切虫都萎缩了、都凋落了——这都不是理论的，都要工夫求证的境界，光是做理论，或是假想一番，没有用的。</p><p> 到了这一步，“见此事已”，就是说，你工夫做到了这个境界，自己切实看到内在的这个情形，这个境界都明显呈现了。那么，然后再做火观，烧一切“虫杀”，所谓“虫”，等于这些活动的细胞；“杀”是外来的，外界传染进来的细菌。譬如我们现在，最近大家都很时髦地在感冒，这是细菌性的传染，这一类的细菌性不是普通的虫，（是）滤过性的病菌等等，就是“杀”这个字。</p><p> 事实上，身上的细胞等等，经过修持——你做的火观是意境上的火观引起的，唯心所造的，细胞不会死掉，不会受破坏，是更增强，增强了那个青春的活力。</p><p> 那么，在这一段，就再进一步修持，由练这个息，由随息等等的修持，自己内观,（就是）所谓内视。其实，这个方法在中国文化，最早的、最古老……五千年以前，就是所谓内视，里面的视，看见身体内部。我们也提到过，后世道家所谓提的“内照形躯”，里面都看到。这都是事实，是确实的境界。</p><p> 那么，再内视返照，看到自己的内身犹如白色的玻璃——像白色的玻璃啊，你不要真的把自己观想成一个白玻璃，然后你人就会强硬了。是像白玻璃，“如白玻璃”。“自然鲜白”，就是形容它里面都是干净的。</p><p> 见到自己的白骨，然后头出光。光的大小……，不能太长，初步的练一丈五，或者一人一手，就是两个手合起来，一人一手。</p><p> 再“复当作念”，就是你作意来的，使自己的头倒转下来，这是很难的。譬如有几位同学讨论……，我们崔公也讲过，观想自己的头怎么下来，下不来，他就观想自己把头砍掉，拿下来，就非要那么意境……。</p><p> 其实，我们现在同外界接触引起来的一切烦恼，差不多（都是）由这个六根……大部分都是眼睛看见东西、耳朵听声音、嘴巴讲话引起的烦恼。所以，（若要）六根不漏，只有把这个东西拿下来，放到里面去，不去用它，把它封闭了。</p><p> 那么，“使头却向”，对着背脊骨的大节，等于人观想自己，不要真的……像我所看到的，修炼打坐，硬把头勾起来，鼻子拼命够，够到这个肚脐，对着肚脐呼吸，那你将来变成弯弓了，这个人的身体会变形的。这是观想。</p><p> “见此事已”，真做到了，再要换方法，“复当谛观”。这一段你念下去。</p><p> <strong>【使白骨人。与光同色。既同色已。见其光端。有种种色果。见是果已。复见众光。从果头出。有白色光。其光大盛。如白宝云。是诸骨人。其色鲜白。与光无异。</strong></p><p> 复见诸骨。摧折堕落。或有头落地者。或有骨节各各分散。或有全身白骨。犹如猛风吹于雨雪。聚散不定。譬如掣电。随现随灭。此诸骨人。堕地成聚。犹如堆阜。似腐木屑。集聚一处。行者自观见于阜上。有自然气出至于虚空。犹如烟云。其色鲜白。弥满虚空。右旋宛转。复还云集。并在一处。】</p><p> 好。再由这一步，进到——不要忘记了，这是由白骨观入手、由数息入手，由数息到达随、止，随、止这个境界，随息、止息。讲都没有用，非要自己做工夫才知道。</p><p> 如果永远跟着呼吸气在转，那还不是随息，差不多到随息的时候，已经到达了不呼不吸了；到达止息的境界，就更严重了。这个时候做这个观，每一步很快的就呈现。</p><p> 然后，把这个头转下来以后，再由息——不是气了，没有办法代表，只好讲一个“气”，化成光了，乃至身体整个化了，变成光了。白骨人都一堆一堆，变成一个山丘，一个圆圆的，摆在那里。</p><p> 那么，这个时候，看到白骨与光的综合堆（成）一堆，就是把自己四大这个肉身，已经可以自由变化了。然后，像一团云气一样在转，大气一样在转。</p><p> 那么，见到、修持到这个境界，确实达到这个境界——这都是事实，讲工夫的，详细的当然还没有讲；详细讲，每一个动作，每个里头多得很哦。就是（使）大家都知道，（再）慢慢去研究。不要认为念过去了，就都看懂了啊。换句话说，念过去了，（只是）带领大家念一下，（若）每句话（都）讲，这一本修法要讲好几年，而且大家要做一步工夫，来讨论一部分，不是那么简单的。</p><p> 那么，这个时候，佛要我们再进一步，换一个方法。再接下去念。</p><p> 　 <strong>【见此事时。复当教作一骨人想。见此骨人。身有九色。九画分明。一一画中。有九色骨人。其色鲜明。不可具说。一一骨人。复当皆使身体具足。映显前骨人中。使不妨碍。作是观已。复当自观。一一色中。犹如琉璃。无诸障蔽。于其色中。九十九色。一一色复有九色众多骨人。是诸骨人。有种种相。其性不同。不相妨碍。见此事已。应勤精进。灭一切恶。】</strong></p><p>  注意啊，修持到这个境界，应当更要精进、忏悔。所谓精进、忏悔，（是）不要得少为足，有一点点境界，（就）认为自己了不起了。</p><p> 这完全是在光的境界里头修了，我们都晓得七彩的颜色，再搭配成九色，就是各种彩色的光，人的自性就在光明中进修。在这个里头再求进步，才能灭一切恶。起心动念一点（恶都没有），身口意三业当中，一点贪嗔痴慢不能动的，着了一点贪嗔痴慢，这个时候，真正走入魔道了。这个时候的魔道不是发疯哦，就走入阿修罗道了，得阿修罗道的果报。这个特别注意啊。</p><p> 到达这个境界以后，碰到这个话，“见此事已”，到达了这个、亲自看见、到达了，证见了、到了。</p><p> <strong>【见此事已。前聚光明云。犹如坏器。来入其身。从脐中入。既入脐已。入脊骨中。入脊骨已。自见己身。与本无异。平复如故。出定入定。以数息故。恒见上事。】</strong></p><p>  好。到这个时候，发光明云……，然后，看到光明的云气，自然向本身——我们现在的肉身本身内在地吸收了，这个吸收是从肚脐里头过来，意念一提，这股气统统吸进来。这吸进来是有事实的，所以，肚脐到这个时候，有时候可以喝牛奶，牛奶可以喝进来，鼻子还可以吐得出来，会这样通了，整个的身体通了。进到肚脐里头，通过脊骨，“入脊骨已”，然后，诚然恢复到我们现在的这个身体，观想那些境界，都把它吸收到自己身上来。</p><p> 修持到这里，自己的肉身，我们现有的肉身已经大变了，至于说返老还童，祛病延年，那是不在话下。不过，外表看起来，这个身体同普通一样，“与本”本来没有两样，“平复如故”，同普通一样。</p><p> 这个时候，你出定、入定，都在心息合一的境界里。</p><p> 心息合一，不是同呼吸气，（呼吸气）不是息哦，搞清楚哦！你们初步打坐，熟一点的，练一点密宗、瑜伽、气功啊，或者普通听听呼吸、数息，以为这个就是“息”，差远了！这是生灭的“气”。</p><p> 到那个时候，“息”，内在有一种“能”，身体的能……，当然，它发散，最差的就是呼吸之气。</p><p> 所以，普通一般你把……包括密宗、瑜伽术、显教的，以为听到呼吸之气这样叫打坐了，修天台宗了、数息观了，那连影子都没有！不是这一回事啊，这一点特别吩咐大家。</p><p> 这个是数息观入手，到最后完全是心息合一了。这个时候，所谓“出定入定，以数息故”，就是代表啊，数息是代表，不是你在那里打算盘，我数了几口气了……那你现在买一个电子的算盘拿在手里，还免得数呢。呼吸一次按一下、呼吸一次按一下，多好啊，不是这一回事啊。“以数息故，恒见上事”，出定、入定，开眼、闭眼，都在光明中，要在那个境界，就在那个境界里，“恒见上事”，随时随地。</p><p> 那么，到这个境界还要进修。下面念下去，</p><p> <strong>【见此事时。复当还教系心。住意在本脐光中。不令心散。尔时心意。极大安隐。】</strong></p><p> 这个时候心意极大安隐，再无烦恼起来，起也起不来，“烦恼无由更上心”，忧、悲、苦、恼、喜、乐等等七情六欲泯然。</p><p> <strong>【既安隐已。复当自学。审谛分别诸圣解脱。尔时复当见过去七佛。】</strong></p><p> 这个时候只是定哦，定（是）与外道的共法哦，与魔道也是共法，不是佛法哦。佛法（是在）这个定当中起慧观了——佛学整个要亲证过来，佛学所学的理论，所谓苦集灭道、十二因缘等等，还要亲证过来。不是你们懂了佛学，考试倒背得出来都不算数！这里你注意了，“复当自学，审谛分别诸圣解脱。”</p><p> <strong>【尔时。复当见过去七佛。为其说法。说法者。说四真谛。说五受阴。空无我所。是时诸佛。与诸贤圣。恒至行者前。教种种法。亦教观空。无我无作无愿三昧。</strong></p><p> 告言。法子。汝今应当谛观。色声香味触。皆悉无常。不得久立。】</p><p> 他说，到这个境界，过去一切成就的佛、菩萨、前辈的罗汉，亲自现身在你前面给你说法，这个时候才真见到佛，真可以见到，亲自的。为什么我们不能见到呢？光与气味根本就是阻隔住的，是阴境界的，他也不会愿意进来，你也接触不到；到这个时候可以接触到了，修成就的人，真还存在的，都可以看见了——不是看见，是可以接触了，修到这一步啊。</p><p> 但是，他说的法，也不过是我们现在讲的法，可是，那个时候你听的程度，理解、证的程度就不同了。念下去。</p><p> <strong>【恍忽如电。即时变灭。亦复如幻。犹如野马。如热时焰。如乾闼婆城。如梦所见。觉不知处。如凿石见光。须臾变灭。如鸟飞空。迹不可寻。如呼声响。无有应者。汝今亦当作如是观。三界如幻。亦如变化。于此即见。一切身内及与身外。空无所有。如鸟飞空。无所依止。心超三界。观诸世间。须弥巨海。皆不久停。亦如幻化。自观己身。不见身相。】</strong></p><p>  好，稍停一下。这一段，就是你修证到上面这个工夫，亲见诸佛、贤圣亲自说法。而这些说法，你看，我们平常经典上也看到，对不对？那你说：到那个时候还要他来说，我都背的出来。不然，他来说都是求证，一步一步，都是真实的工夫。所以佛经上说“一切有为法，如梦幻泡影，如露亦如电，应作如是观”，真实工夫！</p><p> 所以，这个时候，你身心解脱如鸟之出笼，硬是超越了、超脱了。这都是讲佛法真修持的境界，文字也很优美，到了这一段，都是理论性的，你现在就看懂了；（但是，）你现在的佛学再懂也没有用，那是佛学，必须要亲证到这里，这一段……。</p><p> 这个时候，自己观身——每一步、每一步都是境界哦，实际修持的境界。再观自己身，身完全空了，这个时候的身空，不是你现在打坐起来，偶然碰到一下的没有感觉，觉得很轻松，不是那个境界哦。</p><p> 所以，插进来告诉你，这个时候才有一点点“心超三界”，还没有完全跳出三界哦。“如鸟飞空，无所依止”，人都住在空中。“心超三界”，欲界、色界、无色界，这个时候都无所挂碍了。</p><p> “观诸世间”须弥山乃至大海，都在变幻中，就是这个肉眼看得清清楚楚，它们在变，看到大地在长大，长大再毁灭；看到地球在长大，毁灭，都看得清楚，“亦如幻化”。那么，自己看自己这个肉身，“不见身相”，都是实际境界。</p><p> 所以，大家学佛，在这里有一点点什么舒服啊、得定啊、清净啊……还早的很哦，真正佛法的修持……。念下去。</p><p> <strong>【便作是念。世界无常。三界不安。一切都空。何处有身。及眼所对。此诸色欲。及诸女人。从颠倒起。横见可爱。实是速朽败坏之法。夫女色者。犹如枷锁。劳人识神。愚夫恋著。不知厌足。不能自拔。不免杻械。不绝枷锁。行者既识法相。知法空寂。此诸色欲。犹如怨贼。何可恋惜。复似牢狱。坚密难舍。我今观空。厌离三界。观见世间。如水上泡。斯须磨灭。心无众想。得知世法。是重患累。凡夫迷惑。至死不觉。不知众苦。恋着难免。纵情狂惑。无所不至。我今观此。狂惑女色。如呼声响。亦似镜像。求觅叵得。观此女色。为在何处。妄见衰害。欺诸凡夫。为害滋多。今观此色。犹如狂华。随风零落。出无所从。去亦无所至。幻惑无实。愚夫乐著。今观此色。一切无常。如癞病人。良医治瘥。我今观苦空无常。见此色相。皆无坚实。念诸凡夫。甚可愍伤。爱著此色。敬重无厌。耽愚惑著。甘乐无穷。为诸恩爱。而作奴仆。欲槊刺己。痛彻心髓。恩爱枷锁。捡系其身。】</strong></p><p>  好，先停。这一段，到此境界，特别是到这里，才能够了除性，男女两性真正的观念，这个结使才可以了除一部分。当然，这里站在男性的立场，只讲“女色”；站在女性修持的立场，换一个字，就是“男色”，同等的。这里还只了了欲界的欲，整个法门修完……这里还没有了色界的欲，现在都是讲欲界的欲。好，再念下去。</p><p> <strong>【如是念已。复观一切。都皆空寂。此诸淫欲。诸色情态。皆从五阴四大而生。五阴无主。四大无我。性相俱空。何由而有。作是观时。智慧明显。见身大明。如摩尼珠。无有妨碍。似金刚精。青白明显。如鹿突围。得免猎师危害之苦。】</strong></p><p> 先停啊。到这一步，还只是了欲界的欲，刚才再三声明……了欲界欲不是说，“那我们现在听经的时候都没有欲。”这个不算的，哈哈。</p><p> 这个了了欲界欲以后，还没有了色界欲哦，整个法完了的，还没有啊。欲界的欲可以了，这都是从生理上，欲界的生理、心理变化来的；这个时候，欲界的生理、心理起变化了。</p><p> 那么，明显地看到自身内外光明透洁，所以“见身大明，如摩尼珠”，闭眼开眼，自己看自己自身都是光明透射内外，没有妨碍，犹如金刚钻一样，“青白明显”。</p><p> 那么，这个时候有一种解脱，真正解脱的来了，这个解脱是“如鹿突围”，等于动物园里的野兽被关起来了，刚刚被抓住关进牢里，突然打破了这个牢门，跳出来一样，可以免除欲界欲的这个生死层的危害；还没有彻底了，还要靠显教的理。继续下去。</p><p> <strong>【观于五阴。性相皆净。观六大如鸟高翔。身无所寄。以吞色钩。俯仰得度。离诸女色。更不起情。自然超出。诸淫欲海。一切结使。犹如众鱼。竞走随逐。堕黑闇坑。无明老死。为智慧火之所焚烧。观色杂秽。陋恶不净。犹如幻惑。无有暂停。永离色染。不为色缚。佛告阿难。若有比丘比丘尼。优婆塞优婆夷。贪淫多者。先教观佛。令离诸罪。然后方当更教系念。令心不散。心不散者。所谓数息。此数息法。是贪淫药。无上法王之所行处。汝好受持。慎勿忘失。此想成者。名第二十数息观竟。尔时。尊者阿难。及禅难提。并诸比丘。闻佛所说。欢喜奉行。】</strong></p><p> 这是第二个观法，特别要注意，以数息观入门，由息化气、观光、化身，化掉身体，然后，得到了最高的光明定境。还不是你们大家偶然打坐，前面黑洞洞的，偶然来一点精神上的幻光，以为这个是光明，差远了，（是）整个的身心化光明。</p><p> 在这个定境中，然后，以真正的佛法——所谓五阴、十八界、十二因缘等等，慧观。上面是定的工夫，慧观（是）依声闻乘的慧观法门，破除了欲界的色欲——没有到色界的最高处啊，还没有到色界最高处。（是）欲界的色欲观、结使比较干净了，可是，（已经）了不起了。</p><p> 如果有人真正修持佛法到这一段，普通罗汉果位不要谈了，现身可以如鸟之出笼，如鹿之突围，那都不是在观念上的理想……，不要把自己有时候那两天身体健康，没有感冒、没有病，心理好一点点，万事看开一点：“哎呀，我已经如鸟出笼了！”你呀，你是个笨鸟，不是的啊。修持，这都是真工夫，这些里头都是真工夫。</p><p> （而）我告诉大家所讲的，也只是十分之一地提一下。实际上，有许多怎么样修法，到这一步应该怎么防备，乃至于说，进一步怎么样修法，一步有一步的细节，一步有一步……那不简单，太不简单！特别要注意，不要以为，看了、听了这个就懂了，也没有用，不过是提倡提倡而已。这都要真修实证来的。</p><p> 下面，第二十一个修法，综合上面整个的来了，又进一步了。</p><p> <strong>【如是我闻。一时佛在舍卫国。游行教化至多罗聚落。至聚落已。与千二百五十比丘。入村乞食。乞食还已。止于树下。洗足讫。收衣钵。敷尼师坛。结加趺坐。尔时众中。有一比丘。名迦栴延。有一弟子。名槃直迦。出家多时。经八百日。读诵一偈。不能通利。】</strong></p><p> 这位老兄，我们的大师兄，够笨了，八十天读一个偈子，记不下来，也搞不通。好像比我们（还笨），所以，我们大家足以自慰，没有关系……。这都是亲自跟着佛的，不过，是佛的徒孙，迦栴延的（弟子）。</p><p> <strong>【昼夜六时。恒诵此言。止恶行善。修不放逸。但诵此语。终不能得。】</strong></p><p> 你注意啊，他说，他八百天读一个偈子，就读不到，你看多笨啊，可是，我们读八十年也做不到。这个偈子（是）哪两句话：“止恶行善，修不放逸。”难道他记不得啊？都记得了，他做不到，这个话！怎么样才能止恶行善？身口意三业起心动念，一点恶业都没有，做的都是善业；昼夜六时，随时在不放逸中。</p><p> 表面上，你读书一看，这个比丘好笨啊，比我笨多了，八百天读一个偈子……我们，至少一天还背一首诗呢，两百六十个字的《心经》总会背，你想，（自己）总比他聪明多了——你看，不然你看书又马马虎虎看过去了。</p><p> 这个偈子中间重要的，“止恶行善，修不放逸”这个偈子，他八百天做不到，我们八十年也做不到啊！譬如佛经的“自净其意，是诸佛教”，这两句话大家都会背，做到没有？做不到啊。就是你活到八十年、九十年，也没有（做到）。都会（背），这不算通啊，记得文字没有用，注意这个道理，“止恶行善，修不放逸。”</p><p> “但诵此语，终不能得”，嘴里会念这两句话，实际上没有做到，就是这个道理。刚刚给你们提一下，不然又：哦，这位同学好笨……。你们笑了，好像你们聪明了，你仔细一想，我们比他笨多了。</p><p> <strong>【尔时。尊者迦栴延。尽其道力。教授弟子。不能令得。即至佛所。为佛作礼。绕佛三匝。而白佛言。如来出世。多所利益。利安天人。普度一切。唯我弟子。独未蒙润。唯愿世尊。为我开悟。令得解脱。</strong></p><p> 佛告迦栴延。谛听谛听。善思念之。如来今者。当为汝说往昔因缘。迦栴延白言。世尊。愿乐欲闻。佛告迦栴延。乃往过去九十一劫。有佛世尊。名毗婆尸如来。应供。正遍知。明行足。善逝。世间解。无上士。调御丈夫。天人师。佛。世尊。彼佛出世。教化众生。度人周讫。于般涅槃。而取灭度。佛灭度后。有一比丘。聪明多智。读诵三藏。自恃憍慢。散乱放逸。有从学者。不肯教授。专愚贡高。不修正念。】</p><p> 你们注意啊，这是大家最多的、最容易犯的。说佛过世以后，毗婆尸佛过世以后，有一个比丘，“聪明多智”，很聪明，也很伶俐。“读诵三藏”，经典也看得多、读得多，自己认为了不起，结果起不了了。</p><p> “自恃憍慢，散乱放逸”，我们这里诸位的同学，一部经典还没有好好搞呢。“有从学者，不肯教授”，而且自己吝法，有人愿意跟学的，不肯教。</p><p> “专愚贡高，不修正念”，自己很傲慢，看一切人都（是）混蛋，看（哪）个也看不上眼，大家都有缺点，就是他最好，他也晓得自己好，好不了多少，可是他就是要傲慢、贡高，这叫做贡高。那么，“专愚贡高”，实际上，最不聪明、最笨的人才这样做，所以叫“专愚”，贡高我慢。“不修正念”，没有真正在修行，尽管住佛学院里读啊，看佛经啊，好像天天还摸到佛的边缘——佛学影子都没有，修行更谈不上，“不修正念。”</p><p> <strong>【命终之后。堕黑闇地狱。经九十劫。恒在闇处。愚蒙无智。由前出家功德力故。从地狱出。得生天上。】</strong></p><p> 这个果报是怎么来的呢？为什么这样聪明的人，又读了佛经，好像得了宝藏一样，结果下地狱，还下黑暗地狱？本来这个刑期可以少一点的，因为他读了佛经，更重一点，加上贡高我慢嘛，以为自己懂得很多——实际上（是）大糊涂蛋一个，应该堕糊涂地狱，黑暗地狱就是糊涂地狱。</p><p> 堕了这个糊涂地狱以后，这个果报满了，出来再变人……为什么出来还能够得人身？因为他是出家人，犯贡高我慢这些等等……所以，出来总算还得到人身，还升天，（皆）由出家的这一点点功德。</p><p> <strong>【虽生天上。天宫光明。及诸供具。一切黑闇。卑于诸天。诵三藏故。天上命终。生阎浮提。得值佛世。因前贡高。虽遇于佛。不解法相。我今当为说诸方便。教系念法。尔时迦栴延白佛言。世尊。唯愿如来。为此愚痴槃直迦比丘。及未来世一切愚痴乱想众生。说正观法。】</strong></p><p> 注意啊，这“一切愚痴”的“乱想众生”，注意，你看这一位老兄，迦栴延的弟子，就是这么一个榜样，佛所以提出来……。现在，佛教他修法。</p><p> <strong>【佛告槃直迦。汝从今日。常止静处。一心端坐。叉手闭目。摄身口意。慎勿放逸。汝因放逸。多劫之中。久受勤苦。汝随我语。谛观诸法。时槃直迦。随顺佛语。端坐系心。佛告槃直迦。汝今应当谛观脚大指节。令心不移。使指节上。渐渐疱起。复令膀胀。复当以意。令此膀胀。渐大如豆。复当以意。使膀胀烂。坏皮肉两披。黄脓流出。于黄脓间。血流滂滂。一节之上。肌肤烂尽。唯见右脚指节。白如珂雪。见一节已。从右脚渐渐广大。乃至半身。膀胀烂坏。黄脓流血。令半身肌皮。皆两向披。唯半身骨。皎然大白。见半身已。复见全身。一切膀胀。都已烂坏。脓血可恶。见诸杂虫。游戏其中。如是种种。亦如上者。观见一已。复见二。见二已。复见三。见三已。复见四。见四已。复见五。见五已。乃至见十。见十已。心渐广大。见一房中。见一房中已。乃至见一天下。见一天下已。若广者。复摄令还。如前观一。</strong></p><p> 观已。复当移想。系念谛观鼻头。观鼻头已。心不分散。】</p><p> 好，稍停一下。佛这一次说法，（是）对这位笨的聪明人而讲，修持境界从头再来，从大趾骨白骨观观起。</p><p> 我们要注意啊，不要光听过、念过，要看着书哦，要研究哦，这个是要用眼睛的。该看的时候偏要打坐，闭眼睛；该要打坐的时候，偏来看书了，这都是聪明的笨蛋干的事。</p><p> 在这个时候，白骨观观到这样以后，再“谛观鼻头，观鼻头已，心不分散。”这个鼻头，这里也是一个（师示），对不对？我们是不是叫这里是鼻头啊……观这里，就是说，眼睛适度地闭上，不是两个眼睛兜着看这个，那变成斗鸡眼了，不得了的！尤其老年人，血压低的人，马上会昏倒哦；血压高的人会血压膨胀，不得了啊。就是眼睛适度低下，这个影子自然差不多，这个鼻头的影子就知道了，对不对？不需要低头，这样低头（是）你把鼻头看心窝，不需要的。这个眼睛这样一挂，很平静地……。</p><p> 那么，观这个做数息观更要如此。所以，这个气的进出，乃至鼻（耳）根的感受，都很清楚。尤其在北方，假设天气这样冷，呼吸差不多都有光亮，呼气变成蒸汽，都看得见的，那修持起来，由呼吸变光明观，更容易了。所以，这一点特别注意啊。 </p><p> <strong>【若不分散。如前观骨。复当自想。身肉肌皮。皆父母和合不净精气。所共合成。如此身者。种子不净。复当次教。系念观齿。人身中。唯此齿白。我此身骨。白如此齿。心想利故。见齿长大。犹如身体。尔时。复当移想。更观额上。使额上白骨。白如珂雪。若不白者。复当易观。教作九想。广说。如九想观法。作此观时。若钝根者。过一月已。至九十日。谛观此事。然后方见。若利根者。一念即见。见此事已。复更教观腰中大节白骨。见已。即如前。应观种种色骨人。</strong></p><p> 此法不成。复当教慈心观。慈心观者。广说如慈三昧。】</p><p> 上面都是佛教他，你看，多细心啊，教他一步一步看来，又观鼻、观牙齿……我们人的牙齿是骨头剩余的，摆在橱窗里的陈列品。然后，再观到额间。这个观好了以后，再回转来，教他怎么观腰骨节。</p><p> 他说，钝根的人啊，至少九十天，一百天可以修成；利根人一听，一念之间就观起来了。</p><p> 钝根、利根不在于你聪明与笨。根器利，就是对于道容易成道；根器笨的人，佛学会讲，很聪明，学问讲得蛮好，去修持做工夫，你就观不上，那就晓得自己是钝根了。这个钝根是（指）对于修持道上的。你再聪明也没有用，修道是聪明一点用不上的。</p><p> 然后，教观腰间的大节。那么，同前面所修的白骨法门，这一切境界是一样。</p><p> 他说，“此法不成”，他告诉你，万一你这样也不行呢，另外换一个方法，佛就叫他做慈悲观，“慈心观”。</p><p> <strong>【教慈心已。复教更观白骨。若见余事。慎勿随逐。但令此心。了了分明。见白骨人。如白雪山。若见余物。起心灭除。当作是念。如来世尊。教我观骨。】</strong></p><p> 注意啊，观白骨的时候会看到别的境界，看到光啊、看到什么影啊、看到菩萨啊、看到什么，这个时候都不要理，“若见余事”，不是这个境界所需要观的，“起心灭除”，起心动念要把它丢掉、空掉。</p><p> 这些话，经典上都讲过了，不要再问。有时候，听完了经，哎呀，好像马马虎虎……要听经，要听这个，哎哟，拼命要插进来听啊，听完了以后，碰到工夫做到这里，然后又不懂、又来问“我怎么办呢？”你说烦不烦嘛，这种鈍根鈍到极点了！每一次听了再来问，这干什么呢，这是学佛的啊！？</p><p> <strong>【云何乃有余想境界。我今应当。一心观骨。见白骨已。令心澄静。无诸外想。普见三千大千世界。满中骨人。见此骨人已。一一皆灭。如前观苦。尔时。槃直迦比丘。闻佛说此语。一一谛观。心不分散。了了分明。应时即得阿罗汉道。】</strong></p><p> 你看他笨吧？当时佛一教，他每句话听进去，每句话照着做，当时就证得“阿罗汉道”。</p><p> <strong>【三明六通。具八解脱。自念宿命所习三藏。了了分明。】</strong></p><p> 然后，他过去劫读的书，这一生不要再读了，马上都返出来。</p><p> <strong>【亦无错谬。尔时世尊。因此愚痴贡高槃直迦比丘。制此清净观白骨法。佛告迦栴延。此槃直迦愚痴比丘。尚以系念。成阿罗汉。何况智者。而不修禅。尔时世尊。见此事已。为说偈言。</strong></p><p> 禅为甘露法。定心灭诸恶。</p><p> 慧杀诸愚痴。永不受后有。</p><p> 愚痴槃直迦。尚以定心得。</p><p> 何况诸智者。不勤修系念。</p><p> 尔时世尊。告迦栴延。及敕阿难。汝今应当。受持佛语。以此妙法。普济群生。若有后世愚痴众生。憍慢贡高。邪恶众生。欲坐禅者。从初迦絺罗难陀观法。及禅难提观像之法。复当学此槃直迦比丘所观之法。然后自观己身。见诸白骨。】</p><p> 注意了，这前面全部的修法，都要记住，后世的比丘修禅，你们正式要学佛的，都要走这个路子。</p><p> <strong>【白如珂雪。时诸骨人。还来入身。悉见白骨流光散灭。见此事已。行者自然心意和悦。恬静无为。出定之时。顶上温暖。身毛孔中。恒出诸香。出定入定。恒闻妙法。续复自见。身体温暖。悦豫快乐。颜貌熙怡。恒少睡眠。身无苦患。得此暖法。恒自觉知。心下温暖。心常安乐。若后世人。欲学禅者。从初不净。乃至此法。得此观者。名和暖法。</strong></p><p> 佛告阿难。佛灭度后。若有比丘比丘尼。优婆塞优婆夷。于浊世中。欲学正受思惟者。从初系念。观于不净。乃至此法。是名暖法。若得此法。名第二十一暖法观竟。】</p><p> 好，先休息吧。这是修暖，四加行最重要的一步。佛法是讲真修实证的，不是讲空洞理论的！</p></div>"
},{
    "title": "禅秘要法讲座 20",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 我们现在，白骨观法到了二十一观，得暖法，修持到这里，参合上面，是最重要的。所以修定修禅，没有得到暖法，不能得四加行第一步的暖法，一切修持都是没有基础的。这个暖法也就是修瑜伽、修密宗、修道家许多人所追求的拙火定。</p><p> 那么，瑜伽、密法、道家等等，拼命有意地去练这个拙火定，当然，先修气、修脉、修明点，到拙火，是多么的困难！假使走白骨观，佛所教的这个正统路线的修法来，虽然讲二十一步、多少步工夫，但是利根的人，算不定很快地、很短的时间就到达了。到达暖法以后，下面再修四大观法。</p><p> 以后（的修法），大概地念下去，很快地念过去，大概的文字都很明白。</p><p> 当然，中间修法详细的实际经验，那不是很短的时间能够讲完的，那非要一个人修到了某一步，碰到了什么困难，有什么问题，再做研究。所以，现在开始起，要自己多看书了。有人帮忙念，多注意了。现在我们继续，刚才讲的暖法还没有完。</p><p> <strong>【若得此法。名第二十一暖法观竟。佛告阿难。汝今持此迦栴延子所问暖法。慎勿忘失。尔时阿难白佛言。世尊。后世众生。若有能受持是三昧者。一心安隐。得于暖法。此人云何当自觉知。佛告阿难。若有谛观诸结使相。从初不净。乃至此法。自觉身心皆悉温暖。心心相续。无诸恼恚。颜色和悦。此名暖法。</strong></p><p> 复次阿难。若有行者。得暖法已。次当更教系念。在诸白骨间。皆有白光。见白光时。白骨散灭。若余境界现在前者。复当摄心。还观白光。见诸白光。炎炎相次。】</p><p> 由白骨到达白光了。变白光的时候，自己开眼、闭眼观身心内在见白骨、白光，你就空了。</p><p> <strong>【遍满世界。自观己身。复更明净。颇梨雪山。不得为比。自见骨人。各各离散。作此观时。定心令久。心既久已。当自见顶上。有大光明。犹如火光。从脑处出。佛告阿难。若见此事。便当更教。从头至足。反覆往复。凡十四遍。作此观已。出定入定。恒见顶上火出。如真金光。身毛孔中。亦出金光。如散粟金。身心安乐。如紫金光明。还从顶入。此名顶法。若有行者。得此观时。能得顶观。】</strong></p><p> 由暖法到顶法，硬是顶上开了啊。头顶都是在光明中，就是一片光明中。这不是幻想，要真修持到。</p><p> <strong>【佛告阿难。汝好受持。是顶观法。广为未来一切众生说。尔时阿难。闻佛所说。欢喜奉行。得此观者。名第二十二观顶法竟。</strong></p><p> 佛告阿难。此想成已。复当更教系念。观诸白骨。令诸散骨。如风吹雪。聚在一处。自然成积。白如雪山。若见此事。得道不难。若有先身犯戒者。今身犯戒者。见散骨积。犹如灰土。或于其上。见诸黑物。复当忏悔。向于智者。自说己过。既忏悔已。见骨积上。有大白光。乃至无色界。出定入定。恒得安乐。本所爱乐。渐渐微薄。复当更观如前。复寻九孔脓流不净之物。皆令了了。心无疑悔。复当如上。骨间生火。烧诸不净。不净已尽。金光流出。还入于顶。此光入顶时。身体快乐。无以为譬。得此观者。名第二十三观助顶法方便竟。</p><p> 复当更教系念住意。自观己身。犹如草束。出定之时。亦见己身。犹如芭蕉。皮皮相裹。】</p><p> 现在由暖法、顶法，到这里要注意，稍稍转一下，也是进一步的观。要注意自己，修持到这个时候，身体反而是瘦了，非常瘦，非常衰弱的情况出来。佛在这里告诉你，要注意营养饮食了。我们念下去。</p><p> <strong>【复当自观。众芭蕉叶。犹如皮囊。身内如气。亦不见骨。出定入定。恒见此事。身体羸劣。复当更教。令自观身。还聚成一。如干草束。见身坚强。</strong></p><p> 既见坚强。复当服酥。饮食调适。然后观身。还似空囊。有火从内。烧此身尽。烧身尽已。入定之时。恒见火光。观见火已。见于四方。一切火起。出定入定。身热如火。见此火大。从支节起。一切毛孔。火从中出。出定之时。亦自见身。如大火聚。身体蒸热。不能自持。】</p><p> 这个时候修火大观，观到了身体热得自己都受不了，好像电烤一样，比电烤还厉害，自己都受不了，“不能自持。”</p><p> <strong>【尔时四方。有大火山。皆来合集。在行者前。自见己身。与众火合。此名火想。复当令火烧身都尽。火既烧已。入定之时。观身无身。见身悉为火所烧尽。火烧尽已。自然得知身中无我。一切结使。皆悉同然。不可具说。此名火想。真实火大。第二十四火大观竟。佛告阿难。汝好受持。是火大无我观。此火大观。名智慧火。烧诸烦恼。汝好受持。为未来世一切众生。当广敷演。尔时阿难。闻佛所说。欢喜奉行。】</strong></p><p> 这一节要注意啊，修到这一步，白骨化光都做到了，顶法也修到了，才能够修真正的火大观。这不是普通一般所讲的拙火，就是真正的三昧真火的修法，这还是在境界里修持。修到后来，所以佛经上记载，佛在世的时候，许多阿罗汉自己要走的时候，一切都吩咐好了，然后盘脚一打坐，自己不需要送到什么殡仪馆，也不要电烤、也不要拿柴火烧，自己一念三昧真火起来化火光就没有了。有时候，要留给大家一点纪念，故意留点东西，自己不化掉的。</p><p> 但是你说，他自己把自己用三昧真火烧了，没有了？他还是存在的，你只要修持得好，他照样到你前面跟你谈话。这样，是火大观的成就法门，所谓三昧真火。</p><p> <strong>【佛告阿难。若有行者。得火大观已。复当更教系念思惟。令系念鼻端。更观此火。从何处起。观此火时。自观己身。悉无有我。既无有我。火自然灭。复当作念。我身无我。四大无主。此诸结使。及使根本。从颠倒起。颠倒亦空。云何于此空法之中。横见身火。作是观时。火及与我。求觅无所。此名火大无我观。】</strong></p><p> 要注意。上面火大观的时候，要把八十八结使，就是心理的行为——八十八结使这个表，发给大家过的。心理行为，就是刚才前面的一句话，起心动念纯善的，没有一切恶念，这一切结使空了。</p><p> 所以，结使空了以后，这是慧的境界，火观不但把身化空了，心也化掉了。那么到这里，是进一步修火观，如果求大乘果的，可以与《楞严经》大乘道的配合，所谓“性火真空，性空真火”，这个境界与一切就配合起来了。也有人修这个法，从这一节就跳到大乘圈子里去了。继续念。</p><p> <strong>【佛告阿难。汝好受持此火大观。为未来世一切众生。当广分别。敷演解说。阿难闻佛所说。欢喜奉行。是名第二十五观竟。</strong></p><p> 佛告阿难。我见火灭时。先从鼻灭。然后身体一时俱灭。身内心火。八十八结。亦俱得灭。身中清凉。调和得所。深自觉悟。了了分明。决定无我。出定入定。恒知身中无有吾我。此名灭无我观竟。</p><p> 佛告阿难。复当更教观灌顶法。观灌顶者。自见己身如琉璃光。超出三界。见有真佛。以澡瓶水从顶而灌。弥满身中。身弥满已。支节亦满。从脐中流出。在于前地。佛常灌水。尔时世尊灌顶已。即灭不现。脐中水出。犹如琉璃。其色如绀琉璃光。光气遍满三千大千世界。水出尽已。复当更教系念。愿佛世尊。更为我灌顶。尔时自然见身如气。粗大甚广。超出三界。见水从顶入。见身粗大与水正等。满于水中。复自见脐。犹如莲华。涌泉流出。弥满其身。绕身如池。有诸莲华。一一莲华。七色光明。其光演说。苦空无常无我等法。声如梵音。悦可耳根。</p><p> 此相现时。复当更教。叉手闭目。一心端坐。从于顶上。自观身内。不见骨想。出定入定。自见己身。如琉璃罂。】</p><p> “琉璃罂”就是一个桶子中空，身体就是透明的。</p><p> <strong>【复当起念。使自己心。四大毒龙想。见己心内如毛孔开。有六种龙。一一龙有六头。其头吐毒。犹如风火。弥漫池中。在莲华上。一一华光。流入龙顶。光入顶时。龙毒自歇。唯有大水。满其身内。</strong></p><p> 此想成时。名观七觉华。虽见此想。于深禅定。犹未通达。复当更教。如上数息。使心安隐。恬然无念。此想成时。名四大相应观。佛告阿难。汝好受持。是七觉意四大相应观。慎莫忘失。普为未来一切众生。当广分别。为诸四众敷演解说。尔时阿难。闻佛所说。欢喜奉行。</p><p> 复当更教系念。住意谛观水大。从毛孔出。弥漫其身。出定入定。见身如池。其水绿色。如此绿水。似山顶泉。从顶而出。从顶而入。见有七华。纯金刚色。放金色光。其金色光中。有金刚人。手执利剑。斩前六龙。复见众火。从龙口出。遍身火然。众水枯竭。火即灭尽。水火灭尽已。自见己身。渐渐大白。犹如金刚。出定入定。心意快乐。犹如酥灌。如服醍醐。身心安乐。</p><p> 复当更教系念。观他观外境界。以外想故。自然见有一树。生奇甘果。其果四色。四光具足。如此果树。如琉璃树。弥漫一切。见此树已。普见一切四生众生。饥火所逼。一切来乞。见已欢喜。生怜愍心。即起慈心。见此乞者。如己父母。受大苦恼。我今云何当救拔之。作是念已。即自观身如前。还为脓血。复为肉段。持施饥者。是诸饿鬼。争取食之。食之既饱。四散驰走。</p><p> 尔时复当自观己身。及以他身。我身他身。从颠倒起。实无我所。若有我者。云何忽然见此饿鬼。来在我边。尔时复见无量饿鬼。其身长大。无量无边。头如太山。咽如丝发。饥火所逼。叫唤求食。见此事已。当起慈心。以身施鬼。饿鬼得已。噆食其体。即便饱满。见是事已。复当更教观众多饿鬼。见诸饿鬼。绕身四匝。如前以身食诸饿鬼。见此事已。复教摄身。使心不散。自观己身。是不净聚。作是观时。寻自见身脓血。诸肉皆段段坏。聚在前地。见诸众生。争取食之。既见此事。复当自观其身。从诸苦生。从诸苦有。是败坏法。不久磨灭。饿鬼所食。作是相时。忽见身内心处。有猛火烧前池上。一切莲华。及诸饿鬼。众恶丑形。及与池水。泓然都尽。</p><p> 见此事已。复当更教谛观己身。如前完具。身体平复。复当更观己身一切毛孔。以慈心故。血变成乳。从毛孔出。在地如池。众乳盈满。复见众多饿鬼。至此池上。以宿罪故。不得乳饮。尔时慈心视鬼如子。欲令饮乳。以鬼罪故。乳变成脓。斯须之间。复更慈心。以慈心故。身毛孔中。一切乳出。胜前数倍。念诸饿鬼。饥苦所逼。何不来饮。尔时饿鬼。其形长大。数十由旬。举足下足。如五百乘车声。来至行者前。唱言饥饥。尔时行者。即以慈心。施乳令饮。饿鬼饮时。至口变化为脓。虽复为脓。以行者慈心故。即得饱满。</p><p> 见鬼饱已。复自观身。即自见身。足下火出。烧前众生。及以诸树。泓然都尽。尔时若见众多异类。复还系念谛观己身。使心不动。寂寞无念。既无念想。当发誓愿。愿后世生。不受后有。不乐世间。作此誓已。】</p><p> 我们先停一下。这一段大家都听了，修持到这一步功夫，然后，由自己的观想境界里头，就是活见鬼了，硬是见到一切的饿鬼。现在你不要笑哦，你还没有到哦，还不要说见饿鬼，你们现在打起坐来，闹热场中打打坐没有关系，一个人打坐，不是饿鬼，普通的鬼，给你看到影子都吓死了。世界上所谓的六道轮回，这个恶鬼众生相有没有？到那个时候再说。</p><p> 那么这里，所谓学佛的，这个是大关键所在了。到这里，见一切恶鬼、见一切鬼、一切等等各种的境界而不畏惧。为什么不畏惧呀？你说：我不怕，格老子，我死了也变鬼，跟你打一架——那不是修道，不是学佛。这个时候真要修慈心观，以身伺鬼。不是恶鬼，等于一切众生……，譬如碰到大荒年一样，人没有吃，假如把我杀了，你们都吃饱了，可以救大家的命，就砍了（自己），就死掉了——慈心观，就在这个境界特别提出来慈心观。</p><p> 到那个时候，会有各种境相出来，你管它真、假，那是另外一个问题，可是，你的确会看到这个事，会见到这个事。</p><p> 当然，你工夫不到这一步不行，你想见鬼还见不到呢，你放心。你不相信，你天天点三支香，摆在马路上磕三个头，你说：有鬼的话，你夜里来跟我来见面。他还绝不来呢，没有点影子；你到那个境界，这种情形，你不求还自来。</p><p> 有时候你打坐坐得好好的，他四面八方就给你站起来了；你不信，睁开眼睛一看，四面八方都有影子，就摆在那儿。</p><p> 那么，你说，这个道理在哪里？那个哲学的道理，究竟是唯心啊，还是怎么样的，那就很深了。所以，佛在这个时候告诉你，到这个时候——所以，大家念过去了，都忘记。他说：你虽然修到这一步，于甚深的禅定境界，你还是没有基础的，还不彻底。</p><p> 然后叫我们观身，以身布施，修布施。这个肉身，我们人最难舍的，是肉被人家吃了，把自己的命吃掉，谁干呀？这个绝定不干的！学佛之人慈心没有修到这样，不算数的。</p><p> 现在讲慈悲，嘴里讲慈悲很容易呀，“哎呦，好可怜哦，我当时一念好慈悲哦，不过我身上没有钱，好惭愧哦。”前面讲慈悲，好像想买个馒头给他吃吃，因为我身上没有钱，所以，只好惭愧一下就算了，把慈悲就抵过去了，还觉得自己也很慈悲。我们活着，经常帮忙人家一点……方便的事情能够帮忙人家一点，绝不干的，我第一。至于说割（自己）一块肉能够给人家吃饱，绝不干。所以，学佛真正的难……。</p><p> 这里说，你在定中（起）慈心观，不但是起慈心观，而且根本没有恐怖不恐怖的，此心念中没有妨碍自己的定境，定还在定中，你尽管把肉拿去，拿去吃掉。</p><p> 要注意这一段，不是在那里搞幻想、说鬼话哦，不要随便念过去了。</p><p> 然后在这种……发愿，这个愿还是小乘的愿，先发小乘愿：“愿后世生，不受后有”，如果我再来的生——我现在布施给你吃了，我再来修持的这一生，下一次生，我就修成功了，不希望再来，“不受后有”，不落世间，不希望再来这个世间。那么，到另一个世间去。要注意啊。</p><p> <strong>【寻见前地。犹如琉璃。见琉璃下。有金色水。自见己身。与地正等。与水色同。其水温暖。水中生树。如七宝树。枝叶蓊郁。上有四果。果声如铃。演说苦空无常无我。闻此声已。自见己身。没于水中。往趣树所。谛自观身。顶上水出。弥漫琉璃池中。</strong></p><p> 忽然之顷。复有火起。火中生风。犹如琉璃。复见顶上。从顶坚强。至乎脚足。犹如金刚。复有火起。烧金刚尽。温水枯涸。寻更观身。我前见身内池中忽然有树。枝叶具足。树端有果。其声如铃。演说苦空无常无我。清净之法。如此妙果。有好音声。香味具足。我今宜食。作此想已。即仰攀树。取果食之。才得一果。其味甘美。无物可譬。既食果已。见树干枯。其余三果。尚有光明。食果之后。身心恬澹。无忧喜想。自观心识。是败坏法。从诸苦有。诸苦根本。识为因缘。今观此识。如水上泡。无有暂停。四大无主。身无有我。识无依止。如是诸法。复七七四十九遍。谛观心识。是败坏法。</p><p> 尔时自见己身。白如珂雪。节节相柱。复当更教。自以右手。摩触此身。见身如尘。骨末如粉。如粉尘地。寻复更教观身如气。从数息有。身如气囊。无有暂停。</p><p> 复当更教。寻自观身如前。还为一白骨人。见骨人已。自观己身。如前还散。犹如微尘。如人以粉。用涂于地。寻见地上。有青色骨人。复如前观末。此青色骨人。以用涂地。复更观身如青微尘。尘变成骨人。其骨尽黑。复当如前。以末涂地。复自观身。犹如黑地。见黑地中。有四黑蛇。眼赤如火。蛇来逼身。吐毒欲害。不能为害。即变为火。自烧己身。尔时空中有自然声。恒说苦空无常无我等法。见此事时。一一毒蛇。八十八头。为火所焚。见此事时。空中自然有水。洒毒蛇身。众火尽灭。八十八头。一切都消。出定之时。觉身安乐。恬泊无为。</p><p> 复当更教。自观己身。无高大想。寻复见身。自然高大。明显可观。如七宝山。自见己心。如摩尼珠。尔时复当如上观空。作观空时。自觉己身。和悦柔软。快乐无比。前莲华上。七宝色光。流入己心。在摩尼珠中。满足十过。七支七色。皆悉具足。自观身空。亦无众想。尔时顶上。有自然光。似金色云。亦如宝盖。色复似银。从顶上入。覆摩尼珠光上。出定入定。恒见此事。见此事者。自然不杀。不盗。不邪淫。不妄语。不饮酒。</p><p> 佛告阿难。佛灭度后。四部弟子。比丘比丘尼。优婆塞优婆夷。作此观者。名第二十六正观。亦名得须陀洹道。若得此观。要当审实。使身自然离五种恶。合修多罗。不违毗尼。随顺阿毗昙。此名须陀洹果相。尔时阿难。闻佛所说。欢喜奉行。】</p><p> 这一段很长，做的观法同上面都有关联的，一步一步……。要想这一生证果，证初果罗汉、二果罗汉，（这个）修持的观法。而且由火大观变水大观……，所以，再看我们中国的《高僧传》、《神尼传》……。……修水观这个路子来，修水观就是这个路子，所以，很容易证果，很容易即身有所正念。但是，修这种水观，由火观到水观……。第一，色身很难,舍掉这个身……。那么，所有观法的程序，可能发生的境界，修持这个观法的过程可能发生的境界，佛都告诉你了。</p><p> 佛说，这就是他所教的第二十六个，所谓证果的正观的法门。但是，必须要严持五戒，“合修多罗”，合一切经教上的道理，“不违毗尼”，不能犯戒律。然后“随顺阿毗昙”，就是论藏，《俱舍论》八十八结使心性统统都要清净掉、真空掉。</p><p> 我们不要光看到上面的观法：哎呀，又说鬼话，又说神话、又说些理想……。当然你不会信，很难做到。你想证到那个境界，鬼给你见到、神给你见到，还不容易耶，有个条件，（要）严持五戒，合经典的一切道理；戒律没有亏欠，经、律、论修持的方法基本都要守到的，才能到达，才能说即身证果的事。这是第一点。</p><p> 比方，（修）这个观法，假定我们有一个人，现在年纪还不算大的话，假定啊，忽然被医院宣布得了癌症，反正啊，治疗也要死，不治疗也要死，能够把生死真的看空了，走这步二十六观的正观方法，在我想——当然，我自己有没有癌症不知道，我也不去检查，也没有去……用第二十六正观法，绝对可以自救。</p><p> 下面所谓观到后面，硬是本身出黑色的毒蛇这些东西，都是身上的东西所变化的，一切境界不是唯物的，都是唯心所造的。因为这个色身内在四大的每个细胞也是唯心所变的。所以，真修证这个，可以治愈真正的病。</p><p> 话是这么讲，可是，几个人有这个定力，有这个狠气，可以定得住，自己把生死丢开，修这个观想的方法？！第一、定力不够；第二、信心不够；第三、老实讲，他也观不起来啊。假设能够观起来，走这个路线，一定成就，呆定的。所谓呆定啊，像法律一样，条律定在那里不会变动；像物理、化学的公式一样，实验了一定到达。</p><p> 那么，在修这个观法的时候，见到鬼呀，见到什么，这个境界是必然的。不要说在这种情况之下，假设我们普通真正——你们修白骨观或者数息观，真正得到定境，这些境界都要来的。当然，有很多人打坐坐了很久，也生病，说：我都没有……因为你还没有得定，所以当然没有。换句话，你还没有资格，（让鬼）跑来逗你一下呢；有这个资格的，鬼也好、神也好，他就来逗你一下。你还不够那个资格，他还懒得逗你，因为你同他一样，都是鬼，他懒得逗，哈。是这个道理。</p><p> 现在，我们接着下面。（学生提问……），师答：火大观是同上面一起来啊、同上面连着的，是两节……因为配呼吸气，有数息的道理在内。所以，普通讲的呼吸数息观练成了，入火不能烧就是这样，呼吸气停止了，火光进来，自己本身气的外放力量抗住了，所以入火不焚，入水不湿的，（是）这个道理。现在继续。</p><p> <strong>【佛告阿难。若有行者。得此观者。宜当密藏。勿妄宣传。】</strong></p><p> 哦对，这一点，佛再三吩咐，你们到达这些境界，见到这些、那些，不要拿去自我宣传啊，越宣传，越搞，真是入了鬼道、入了魔道了。修持到了，（要）认为是当然的，没有什么稀奇。</p><p> <strong>【但当一心勤行精进。勤行精进已。复当更教。谛观地大。地大观法。亦如上说。观地大已。次教观水大。观水大者。自观己身。身中诸水。身如琉璃。刚强难坏。若见自身。悉皆是水。当教易观。若复见身。尽成琉璃。亦教易观。】</strong></p><p> 这里注意啊，到这一步，自己要特别注意，将来你们各人自修的……。就是说，这个时候赶快要调换方法，“当教易观”，这要特别注意啊。</p><p> <strong>【观于地大。使琉璃身。犹如微气。见水从眼中现。若见此事。名细微四大观。复当更教。从头已上。使水满中。见水从眼中出。亦不堕地。自见己眼。如水上沫。亦满水中。若见此事。头水不温不冷。调和得所。水若温者。是假伪观。水色澄清。不温不凉。次当更教。观腰已上水。不温不冷。复观咽喉。如琉璃筒。水入胸中。次下至腹。乃至毕（加月旁）膝。莫令入臂。使水澄清。如颇梨精色。若觉水温。乃是真观。</strong></p><p> 此想成已。复教通彻四支诸节。水皆满中。】</p><p> 做水观的人，如果觉得身体发冷，就不对了，不是的，也是得温暖的，四加行法，暖、顶、忍，这是必然的。所以，佛在这里再三地吩咐，就是要温暖的。</p><p> <strong>【如琉璃器。持用盛水。渐渐广大。见满一床。外人亦见。若见此水清冷。乃是真水。若见余相。不名真实。入水光三昧。渐渐广大满一室内。水皆澄清。如琉璃气。渐渐广大。遍满三千大千世界。见此事时。当于静处一心安坐。敕诸同学。皆使清净。不令愦闹。尔时复当见水上紫焰起。当自忆想。此水从何处起。云何当尽。若言我是水者。我身无我。前已观无我。今从无法中。水从何起。作是念时。水性如气。渐渐从顶上没。水稍稍尽。唯身皮在。自见己身。极为微薄。无物可譬。如微尘草束。复见身内。忽然有火。烧身都尽。观身无所。永无有我。我及众生。一切都无。尔时行者。心意恬泊。极为微细。无物可譬。</strong></p><p> 此想成时。名第二十七真无我观。亦名灭水大想。亦名向斯陀含。其余微细贤圣法界。微妙难胜。不可具说。】</p><p> “不可具说”，就是说，修持工夫到这里，可以到达二果罗汉，快速成就二果罗汉的境界。但是，中间由此再求进步，向菩萨道，所谓“其余微细贤圣法界”，这个修法的各种境界，“微妙难胜”，变化很多，“不可具说”，佛也没有办法告诉你完。因为你没有修到那个境界，说了你也不懂，到那个时候再问，就是“不可具说”，没有完全说完。</p><p> 　 <strong>【行者坐时。修诸三昧。得无我三昧时。当自然见佛。</strong></p><p> 佛告阿难。汝今好受持。是真实水大微妙境界。广为未来一切众生。敷演广说。尔时阿难。闻佛所说。欢喜奉行。</p><p> 佛告阿难。得此观已。复当更教水大观法。此水大观。极为微细。使此水大与火大合。见身如气。如琉璃影。观脐四边。火焰俱起。见于火焰。犹如日映。若见脐上有火光起。或有从鼻中出。或有从口中出。耳眼随意出入。若见此事。见一切火。从毛孔出。火出之后。有绿色水。寻从火后。自见身中。水上火下。火上水下。观身无身。此想成时。见身水火。不温不冷。身心寂尔。安住无碍。此名斯陀含果。亦名境界实相。】</p><p> 注意哦。他说，自己修持的定力到达了二果罗汉——不管出家、在家，是一样的，证果是一样的。到达这个境界的时候，这个水火所谓颠倒了，水火自在。后世道家所谓“水火相济”，用坎卦、离卦来做这些代表，都是实际的。现在不讲道家，不用代名词，直接告诉你水火观，颠倒。</p><p> 那么，到了这个水火无碍的境界，就是可以到达斯陀含果。上面的水大观是斯陀含向，“向”就是说还没有证果，就是说（是）候补的，超过了初果，但是还没有证二果，可以做二果的后补人，佛经上称为“向”，初果向，预来向。正式证位到斯陀含果的，身上的水火四大可以变换，修持到这里，实际可以变幻，这就到达二果罗汉的境界。</p><p> 你注意啊，佛说：“此名斯陀含果，亦名境界实相。”不是理想的，是真的，可以使水火颠倒。那么你说，玩玩神通，这个时候是神通了，一个证得二果罗汉的人，你生一盆火放在他手里，他可以变成水了，他要把水变成火就变成火了。</p><p> 所以，道家不是讲一个故事，说另外一个修道的人，达摩祖师后来看到他在都市的妓院中修道。达摩祖师一看，看到这个房子的光色不同：哎，糟糕，这里有圣人，有得道的人。达摩祖师下来看看，哎呦，是个“绿灯户”，奇怪！这个里头怎么有个修道的？！结果进去一看，找到他，他看到达摩祖师来了，他也晓得，“老和尚、师父，你不要说话，我请你喝茶。”就叫佣人打了一壶冷水，一边跟达摩祖师谈话，一边把这个冷的茶壶放在肚脐上，等一下烧开了就泡茶给达摩祖师喝了。达摩祖师一看，“好，没有问题，你在这里没有问题。”就走了。所以，水火可以互变的。所以，佛也说“亦名境界实相”，真实的。</p><p> <strong>【见此事时。出定入定。恒不见身。入定之时。外人亦见水火从毛孔出。从毛孔入。贪淫多者。见火从顶上入。从身根出。然后遍满身体。水亦复然。</strong></p><p> 复当自观头上。火如阎浮檀那金光云盖。或见身下如七宝华。心中恬静。安隐快乐。世间乐事。无以为譬。出定之时。身亦安乐。令外众生。见己禅定三昧。安隐金光。金色帝释诸天。恭敬礼拜。并言。大德。汝今苦尽。必定当成斯陀含果。闻已欢喜。修身禅定。心无系碍。】</p><p> 啊，做工夫是很苦的哦。到这个境界证果了，你看，连天人、玉皇大帝都来了，来恭喜你，锦上来添花了，哈哈。“大德，汝今苦尽”，你的一切苦吃完了，功德圆满，“必定当成斯陀含果。”所以，修行是苦修哦；你们以为修行是乐修，就完了。</p><p> <strong>【安隐快乐。游戏无我三昧中。亦渐入空三昧门。无愿无作诸三昧等。悉现在前。如此微妙善胜境界。行者坐时。于禅定中。自然分别。</strong></p><p> 若钝根者。大师世尊现前为说。以见佛故。闻法欢喜。应时即得斯陀含道。复当至心覆寻前观。经二十五反。极令明利。】</p><p> 还要注意，这些微妙的境界，他说，真正的修行人，在禅定中自己自然会清楚。尤其学佛，研究了佛经，由正统的佛经——当然，不是随便看看现在的佛学杂志啊，现代佛学研究的著作啊，近百年以内的佛学著作你不要读了，好好去看佛经。不然，百人走，百错路；万人走，万错路。还是找本师释迦牟尼佛的经典读，多好呢，何必浪费时间呢。</p><p> 所以，佛学的理你真通了，修持到这个境界，一切境界你很自知，清楚得很，我到了哪一步该如何走……。当然，要你道德高，功德圆满的人。因为你戒性好，不会走错路，功德会圆满。当然，尤其是心性的戒行，起心动念，贪嗔痴慢绝对清净，不会走错路。走错路，就是你贪嗔痴慢不清净。</p><p> 所以，他这里就告诉你，“此微妙善胜境界”，“行者”就是你这个修行的人，“坐时”，你打坐，“于禅定中，自然分别”，你的智慧自然晓得到了什么境界。</p><p> “若钝根者，大师世尊现前为说。”你是诚实修持的人，虽然智慧没有那么明利，真正笃实，还是心地法门，你心地真正笃实，可是智慧差一点，你工夫修持到这个果位的时候，我们真正的老师，释迦牟尼佛，“大师”，是真大师——不像我们（这些）随便的大师，我们也可以叫大师啊。那个真的大师，佛，世尊亲自现前会指导你。</p><p> “以见佛故，闻法欢喜，应时即得斯陀含果道”，二果罗汉。“复当至心，复寻前观，经二十五反，极令明利。”你证得了这个果位，以及到了最高明的时候，会是最踏实。就是佛亲自指导你证到了果，还应该温习前面白骨观，由脚趾头开始，一直到这里的二十五种观法，整个地还要复习一番，一方面考验自己，一方面为将来教化他人熟练。所以，学佛都是如此发心，不是说你懂了，就不要了，不是这样。</p><p> <strong>【佛告阿难。汝好持此第二十九水大观。慎勿忘失。得此观者。亦名斯陀含。亦名善往来。往宿世善根业因缘故。遇善知识。清净法行。汝乃当得此斯陀含道。尔时阿难。闻佛所说。欢喜奉行。】</strong></p><p> 我们今天到这里为止。希望再有一两次，刚好把我们的课补完，补完了，这个白骨观《禅秘要法》就讲完了，刚好是寒假期间了，正好功德圆满。寒假，大家就证它一个阿罗汉果！试试看！</p></div>"
},{
    "title": "禅秘要法讲座 21",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 现在，我们继续上次……,大家应不会忘记了，现在都在做四大观：地、水、火、风四大观，就是了这个色身的障碍，解脱这个肉身，我们这个肉身是四大所构成的，地水火风，了这个障碍的真正修持。</p><p> 上次在水大观到火大观的中间，现在，你继续念下去……。</p><p> <strong>【佛告阿难。若有比丘比丘尼。优婆塞优婆夷。若得此微妙水大观已。复当更教。安隐微妙最胜奇特火大观法。】</strong></p><p> 这里停一下。上面由水大观修过了——实际上……，当然详细讲，我们这次还是不详细的啊，真正详细地讲，（要）把这个理论的发挥同中国的医学、同西方的医学配合，再同瑜伽的修法，藏密，西藏的密宗，乃至东密，流传在日本高野山的密宗，各种的修法配合研究，就指出了笼罩了显教、密宗的各种研究的办法，都（是）从这个经典里头出来的，所以内涵非常丰富。所以，本经叫做《禅秘要法》，不但是修禅定，（还是）修密法最重要的。</p><p> 密法的重要观点，也就是多半侧重于了身。了心固然已经很难了，了身也很不容易。现在是修了身，所谓水大观修好了以后，修火大观。那么，部位转了，“脐中”，在肚脐中间开始。</p><p> 千万不要看到“脐中”，有许多人——因为我们中国几千年流行道家的思想，（就）马上想到肚脐下面一寸三分，不是的，“脐中”就是脐中，就是肚脐。为什么后来的道家变成了一寸三分呢？那是根据针灸的穴道，所谓气海穴。肚脐下面的一寸三分——就是我们每个人自己的四个指头，从肚脐这里下去，就是一寸三分；再不然，就是每人自己中指的骨节下去（量），大体就是一寸三分。（用）每个人自己中指的骨节，量自己的身体最准确了。哦，不是那个气海，气海道家叫丹田。</p><p> 现在讲“脐”，“脐”字的关系很大。你看，大家许多人不了解这个肚脐的关系。我们在娘胎里头的呼吸、营养，本身都靠这个脐带，（靠）肚脐的脐带跟母亲连起来。所以，婴儿在娘胎里长大，吸收母亲吃进来的营养是靠这个肚脐脐带输送进来，不是嘴里，也不是别的。当然，也没有呼吸，连这点氧气也是靠母亲呼吸进来，也靠肚脐。</p><p> 一出娘胎，第一个动作就是把脐带剪断。脐带一剪断了以后，呼吸没有了，一切没有了，所以，婴儿不能不开口，“啊、啊……”就哭啊。</p><p> 所以，脐带一剪断，助产士的动作、护士的动作，第一个——现在是很进步了，像过去，我们乡下叫做产婆了，接生的这些老太婆。第一个动作，就当婴儿的嘴巴“啊”要张开的时候，指头先进去，把嘴里的东西先挖掉。那个挖出来的东西比泥巴还要黑、比牛筋还要牢、比那个粘糊的浆糊还要粘，这个东西就是胎儿在娘胎里含着的，脐带里头另外……就是吸收母亲吃进来的饮食（中）有毒的什么东西，都在这个里头。</p><p> 这个要挖得很干净，要一丝不留，（则）这个小孩比较健康，容易养大。万一挖得慢一点，“啊”一下，那个东西有一部分咽下去了，就是带来的，叫做胎毒。年轻，没有什么关系，到了中年老了以后啊，那么，心肝脾肺肾各个部分衰坏了以后，这个胎毒一配上——以我的研究……我的想法啊，我到底不是医生，癌症同这个胎毒的不干净大有关系。所以，有许多人年轻的时候，觉得身上没有毛病，一到二十几岁、三十几岁，尤其是女性，快挨近三十岁，各种毛病都来了，它这个胎毒在本身里头……。</p><p> 所以，修道做工夫，做到了气脉完全打通，最后要拉大便，拉得像屙痢疾一样，一天七八次、五六次都会拉，但是肚子不痛，就是想拉。拉到最后，都像水一样，后来屙出来的那个大便——当然，要到辟谷，就是完全不吃饭。到了最后，屙出来的大便一坨，黑黑的、粘糊的，像鼻涕一样，你要抓起来，拉都拉不开，就是这个东西最后下来了。那么，这个气脉打通了，最后逼出来了，所以可以祛病延年了。</p><p> 所以，这个“脐”有这样的关系，这个脐带，胎儿这里一剪断，嘴巴“啊”一叫，鼻子开始后天的呼吸了。所以，我们这个肚脐本身现在还在呼吸，大家不觉得就是了。有一个事情就知道了，所以，道家有一种方法，有许多药敷在肚脐上，敷在肚脐上比你吃下去的吸收还厉害。</p><p> 吃鸦片的人，过去抽鸦片的人就可以测验出来。一个鸦片鬼，那个瘾发了以后很痛苦，瘾发了，不像抽香烟哦，那个鼻涕、眼泪一起来，一点力气都没有。那个时候你说，“我有鸦片给你抽。”你叫他叫我祖宗，他就叫祖宗，你要他做什么他都干。说：“把你家的太太、儿子都送给我，就给你吃。”“都可以。”这是鸦片之毒啊！</p><p> 可是，有些人出门，以及后来禁鸦片烟的时候，抓到吃鸦片的要枪毙，那么他们吃不吃呢？也是吃，怎么办呢？不能明吃，把鸦片烟膏抹在肚脐上，拿带子捆起来。哎，两三个钟头以后，一点都没有了，吸进去了。所以，肚脐会吃东西的哦，它在娘胎里头呼吸东西搞惯了。</p><p> 所以，你们有许多人洗澡，看到肚脐里头脏，（就）拼命抠，抠了以后生病，然后拉肚子啊、头痛啊，哎呀，他不晓得是自己抠肚脐抠来的。这个肚脐的关系很大，所以，就是说肚脐是先天生命……。现在讲的“脐中”就是肚脐。</p><p> 所以，叫做内呼吸……我们修数息观修到了随，你们晓得，数息的第二步就是随，到了随的境界就起胎息，道家叫胎息，密宗、瑜伽术叫宝瓶气，就是内呼吸。内呼吸起来的初步，就是鼻子里没有呼吸，肚脐这个地方又像胎儿在娘胎里一样会呼吸，所以叫做胎息。</p><p> 做工夫，不管你禅也好、密也好、禅宗也好、净土也好，真讲修证，都是呆板的，非到这一步不行。不到这一步，你那些所有的工夫都是白谈的，是空话！自欺欺人的话。所以，这个“脐”就是这个道理。</p><p> 现在讲了四大观这一步，说火大观都是从脐中来，那么，注意这个地方。所以，这点特别提出来。</p><p> <strong>【作此观时。自见脐中微妙火光。床如莲华。其色光明。如和合百千万亿阎浮檀那金。见此事已。复当更教观身内火。观内火时。自见心火。】</strong></p><p> “心火”不是在心脏，（是）观肚脐这个地方，密宗、瑜伽（讲）就是修拙火。观这个肚脐的内呼吸起来了以后，在这个地方“忆”观起来的火光，自己的心中像是有光明，不是心脏部分哦，就是说，是你心理上观起来的。</p><p> <strong>【常有光明。过于百千万亿明月神珠。心光清净。亦复如是。出定入定。如人持明火珠行。虑恐他见。唯自心中明了。】</strong></p><p> 修到这一步，自己这里发暖，不是发烫，你觉得发烫就不对，（是）发暖，整个温的。脐内……，女性注意，需要顶上上部的修完成了，已经返回到童体，就是说，等于到达了十一、二岁第一次月经没有来以前，到这个时候才可以修脐，记住哦！不能随便躐等，不能跳一级修的，修的不好……尤其女性要注意啊。</p><p> 这个时候，你看，“出定入定”，脐中观的火光，拙火明了，“心光清净”，念头是绝对清净的，只有这一念，心念一直是这个火光。随时，“出定入定”，无论是入定做工夫或者出定，“如人持明火珠行”。“虑恐他见”，你就保护自己的这个工用境界，不能向人家炫耀，也不能说。等于人身上有一个无价之宝的金刚钻带在身上，深恐，怕人家知道，保留得好好的，绝不会让人家看见我身上有一个无价之宝，对不对？</p><p> 人都有这个（心理）作用吧？你身上多两个钱，有十万块钱带在身上，上街还用帕子包起来，怕人家看见，对吧？所以，你修道工夫到这个境界，不能宣传、不能炫耀，只能自修。所以，“如人持明火珠行”在走路，“虑恐他见”，就是深藏不露，完全要深藏不露。不要宣传“我已经到达什么工夫了……，我已经到达什么境界了……”然后，“我可以传你道了，你可以皈依我做徒弟了、拜我为师了……”不可以。</p><p> <strong>【如是他人不见。渐渐大明。见身犹如颇梨明镜。见心亦如明月神珠。虑他人见。他人其实不见此事。入定之时。以心明故。见三千大千世界粗相。见阎浮提。须弥山及大海水。悉皆了了。】</strong></p><p> 到这个境界，所谓默默地修持期久，心真明了，拙火明了。讲密宗所谓气脉的话，这个时候气脉打通了，当然，（是）粗的打通。然后，你入定的时候，看这个世界上的事、地球上的事，清清楚楚，等于看电视一样，一切明了。但是要严守戒律，看见了不要宣传。未来的事你知道了，不要去吹牛了，一吹牛呀，你会入魔道；有神通，神通换一步就是神经，就入了魔道。所以，这个地方切记，佛告诉我们，“如人持明火珠行，虑恐他见”，自修自了。</p><p> <strong>【复见大海水中摩尼珠王。其摩尼珠王。焰出诸火。】</strong></p><p> <strong>【见此事已。尔时见佛。为其广说九次第定。九次第定者。九无阂八解脱。如此等观。不须预受。佛现前故。佛自为说。其利根者。闻佛说法。九无碍道中。应时即得阿罗汉道。】</strong></p><p> 到这个境界，佛亲自现身给你说法，“九次第定”，一步一步地领导你。他说，“不须预受”，你用不着去考虑下一步怎么走。正成就的，你走的是正佛法的路子，诸佛菩萨自然来引导你，“佛现前故，佛自为说。”</p><p> “其利根者”，中间还是在（于）利根、钝根的差别。属于利根的，听佛这个时候说法，“九无碍道中，应时即得阿罗汉道”，当时就可以证得阿罗汉道。</p><p> <strong>【超越阿那含地。如好白氊。易染为色。若钝根者。复当更教风大观法。】</strong></p><p> 注意啊，我们不要把自己当利根看。不要有个魔化身为佛来，你也当成佛，分辨不清楚。你还是规规矩矩把自己当钝根看，不会错。</p><p> 假设钝根人修到这一步，还要走“风大观”。风大观，拿中国的道理讲，还要修气、修脉，怎么样修风大观？注意啊，所谓风大观就是修气。</p><p> 　 <strong>【风大观法者。见一切风。极为微细。细中细者。可以心眼见。而不可具说。风复杂火。火复杂风。水入火中。风入水中。火入风中。风火水等。各随毛孔。如意自在。】</strong></p><p> 这一点要注意啊，体会风的道理、气的道理。</p><p> 我们普通把鼻子的呼吸，譬如天台宗、密宗、瑜伽术、修气功，道家修气功，拼命在鼻子的呼吸上搞来搞去，这是最粗浅的。</p><p> 真正的“风”，天台宗告诉你，什么时候的呼吸是风呢？这几天流行感冒，最时髦的，我们感冒了，鼻子“呼呀呼”的有声响，气也很粗，呼吸都觉得困难或者咳嗽，这个是风，这是外风，外风邪钻进来，所以中医叫做伤风。这叫做风。</p><p> “气”呢？身体最健康的时候，除了睡在枕头上自己听到一点呼吸声音，这就是气。</p><p> “息”呀，自己都几乎听不到，那个叫息。耳根听不到，只有内在的感觉到，那个叫息。所以，数息观是数这个息。</p><p> 一般人光在鼻子那里数气，统统落在昏沉中，一辈子落昏沉。落昏沉——不是我说的，佛说的哦，你查宗喀巴大师的《菩提道次第论》，根据《瑜伽师地论》来的，你把《瑜伽师地论》各种大小乘……，以昏沉境界当成定，果报不可思议！怎么不可思议？他生来世，求善果而得恶道，进入畜生道去了。</p><p> 猪呀、牛呀，一天都是昏昏沉沉的。你看，牛呀、猪呀呼吸特别粗，“呼呀呼、呼呀呼”的；那个猫的呼吸更粗，“咕呀咕”的，都听得见的。就进入畜生道去了。</p><p> 所以，定绝不是昏沉哦，千万搞清楚，这个话重要得很啊！定是可以做到六根对外界不知，可以解决，但不是昏沉！昏头昏脑的那是大昏沉，果报不可思议哦，福报也不可思议！</p><p> 如果因为善根好，功德做得多，可是呢，一做工夫就落昏沉，他生来世就是在异道中生、异类旁生中生也是王，或者变牛王、猪王，或者什么王，也是王，因为他福报大；可是，昏沉的果报也具在。</p><p> 所以修持啊，理上不通不谈修持，注意，不能差一点。</p><p> 所以息，不是数这个风。这个风，现在告诉你了，你自己不修持不融会贯通，看不懂的哦，《禅秘要法》……。</p><p> 他说，“见一切风，极为微细”，“一切风”，就是我们内在的气，你会看得清清楚楚，不是眼睛看哦——气到了，几乎没有办法，觉得没有呼吸，整个定止了，里头气还在动。“细中细者”，到达最细的时候，所谓天台宗讲的息、数息，到了息的境界，“可以心眼见，而不可具说”，是你心眼开明见到的，定的境界（中）晓得这是气的作用，“不可具说”，说不清楚啊。</p><p> 所以，普通讲修气，什么是气？以为身上……，有许多：“哎哟，我气脉通了，任督二脉打通了。”都是把皮肤、身体里的一点感觉，有许多人肠胃发炎了，“哦，就是拙火喽，已经是拙火了。”其实都是大肠发炎，真的哦。</p><p> 我看了好几个老前辈，一身都在发炎，大肠发炎，然后，鼻子红得啊像……，我们叫酒糟鼻子，前面整个都像蜂窝一样，一粒一粒的……然后他说：“拙火修成功了。”最后嘛，是修成功了，到了美国去，神经了，就在那里进了神经病院。那真叫“拙火”，拙者笨也，那不是“笨火”嘛。</p><p> 这都是事实，我不讲人的名字，也是个立法委员，当年不得了……我只好：哎呀，阿弥陀佛！没有话讲。所以你晓得，修持，这个色身有这样严重。</p><p> 所以，这个欲化掉，修火光定……你看《楞严大义》上，欲念最重的时候，火首金刚就利用这个欲念，欲念就是拙火，一入火光定……。所以，《楞严经》二十五位圆通，焰慧地菩萨火首金刚，就化了。到这个时候一化了，生怕自己的欲念不大，欲念（越）大，转化的功德更大，火首金刚的功德更大。大乘菩萨的护法。</p><p> 所以，有时候我们的大丛林庙子厨房里供的，也就是焰慧地菩萨，大的丛林是焰慧地菩萨化身的。</p><p> 所以，风与火要这样……你们不要听到一点点风呀、火呀，发炎的时候，（就）当成是自己拙火修成功了，千万注意啊！这些我都是经验看得多了，看得无话可说。现在，跟大家讲实际的，所以这个“风”字就是指气。</p><p> 风与火，你看，他现在教我们风火两个合修。我们感冒了，咳嗽、流鼻水、难过，就是外感的风火，就是发炎。发炎也是火哦。</p><p> 火有好多种哦，阳火、阴火，瓦斯的火是阴火，木材烧的火是阳火。瓦斯这些阴火……，所以你打开瓦斯，如果它不起火，你手一（触），马上是冰的，对不对？你们有经验吧？瓦斯不但冰，还中毒的，阴火；阳火不会种毒。火分很多种呀，（还）有阴阳合起来的火。</p><p> 所以，我们感冒了、伤风了，也发烧，就是发炎，是阴火。为什么发烧就难过呢？就病了？有毒嘛，也等于瓦斯的火，你一烫到手就中毒啊，就是这个道理。也是火呀，不能叫它不是火。</p><p> 风也好，地水火风，各个分析起来有多少种？所以，我给人家讲《易经》，好多年前我看到报纸上，外国人现在装到雷……，认为天上打一次雷，地下要增加八十万公吨的肥料，这是雷。所以，美国的科学家想方法把雷装起来研究，打雷时怎样把雷收起来，然后再来研究，为什么地上……。</p><p> 那一年正好讲《易经》，（过去）十多年的时间了，有个美国学者来看我，正谈这个事。我说：“哎呀！那有什么稀奇！雷，你们只晓得一种，雷有八种，中国人早知道。”“哎，这是什么理论呀？”我说：“《易经》上有啊，天雷无妄、火雷噬嗑、地雷复、山雷颐……哦，八个雷耶！”</p><p> 天雷无妄，夏天打的是天雷，在天空打，“哗……”放屁一样，放完了就没有事了，在空中的。春天来的第一声雷，地雷复，地下里头打的，“嗯……”这样上来，等于你们工夫做好的，有时候“呜……”有时候是地雷复哦。有时候你胃吃不好了，打嗝了，“呃……”那个是天雷无妄。还有山雷颐，头顶有时候顶轮气脉开了，“嘭”一声，砸雷一样，那是气脉震开了，那完全震开了，气脉震开了的人就不同了。</p><p> 所以，雷是有八种，风、火、水都有八种，所以讲阴火、阳火。气同火（一起）修，这是正火，正火是什么？是暖。</p><p> 那么，讲教理呢，唯识讲人只要还没有死，识就在，唯识心意识的这个识。暖、寿、识三样连起来的。暖气在，这个身体的寿命就在，识就在。所以死亡的时候，冷却到哪里，没有暖了，冷却了，哪一部分冷却了，寿命也等于停止了，识也跑掉了。暖寿识是连起来的。所以，这里讲的火是暖，还不是我们饭吃下去，增加西医所讲的卡路里，不是这个东西，是生命之火。乃至，所以有许多修道的人，饿个几十天，它这个生命之火点着了，不会死。这个气是这个气，这个火是这个火。</p><p> 搞清楚啊，特别吩咐大家。本来都可以念过去的，我不讲的，姑且也告诉你们。这个里头，就是我这样讲，都还是没有详细地讲啊。你们注意，特别吩咐大家，不要认为：“哎呀！我也听过《禅秘要法》白骨观了。”白骨观？“白听观”哦！你要去好好去研究，尤其是佛法，不是那么简单的。我假设讲十次，十次不同，一步一步深入讲；深入讲，不是很短的时间（能）讲完的，乃至于把道家、密宗、显教的各种方法……，……这一本经，差不多了，把显密修法都注解完了，装订起来，能卖十万块钱一部，哈哈。现在给大家讲，只（是）讲扼要的，你们要注意，不要认为这样听过去了……每一句话、每个字都要留心，特别吩咐。</p><p> <strong>【或复有风。十色具足。如十宝光。从身毛孔出。从顶上入。从脐中出。从足下入。一切身分中出。从眉间入。从眉间出。从一切身分入。如此种种。无量境界。贤圣光明。贤圣种子。诸贤圣法。皆从此风大中起。从此风大中入。】</strong></p><p> 注意啊，这个火观修成功了以后，然后身体在定中，光明随便从哪里出来，再进入到哪里，要注意这个道理。“如此种种无量境界，贤圣光明”，这个时候，就要你欲大点成这个火，点成就化了，完全化了，“贤圣光明，贤圣种子”就从这个来。“诸贤圣法，皆从此风大中起”，修气中起，所谓风火同修。</p><p> <strong>【此风大观。具足相貌。微妙境界。唯阿罗汉。能广分别。不可具说。行者坐时。当自然见。若见此事。练诸烦恼。成阿那含。此风大观。名第三十阿那含相应境界相。</strong></p><p> 佛告阿难。汝好受持。是阿那含相应。最胜境界风大观法。慎勿忘失。尔时阿难。闻佛所说。欢喜奉行。】</p><p> 你看，佛再三吩咐阿难，这个修持的法门千万不要掉啦！结果我们还是掉了，呵呵，众生很可怜啊，“慎勿忘失”。当然，将来慢慢发愿，再把它补完全，不要掉了。啊！现在第四卷了。</p><p> <strong>【如是我闻。一时佛在舍卫国。祇树给孤独园。与千二百五十比丘俱。尔时。尊者摩诃迦叶。有一弟子。是王舍大城苦行尼揵子儿。名阿祇达多。求尊者摩诃迦叶。出家学道。修行苦行。具十二头陀。经历五年。得阿那含果。不能增进成阿罗汉。】</strong></p><p> 注意啊，现在又是一个佛亲身教的一则学案。拿禅宗（讲）叫公案，儒家叫学案，拿我们现在叫个案，亲身的经历，也是佛弟子。这个人出家跟谁呢？是我们禅宗的祖师，摩诃迦叶尊者。有一个弟子，是佛在王舍城教化的那个讲堂（里的）。是什么学派的人呢？苦行学派的，佛在世时就有。</p><p> 那些专讲苦行修的,印度当时有些人，所谓裸行外道，都属于苦行，脱得光光的，在火旁边烤，站着一只脚入定，一只脚提起来，一定要好久啊，那都是苦练啊，这些修苦行……。当时的苦行学派也是讲修道的，都是苦修的，一天吃一餐，或者吃一点点，硬把自己饿得扁扁的，这些都属于苦行的法门。</p><p> 这位是苦行派的大师尼揵子的儿子，名字叫阿祇达多。那么，他跑来学佛，不走他父亲那个苦行——我们佛家叫他是外道路线。跑来求正法，跟迦叶尊者出家，学佛道修行，修行什么？修佛的苦行法门，佛法里头也有苦行法门，就是十二头陀行。</p><p> 佛法里头的十二头陀行的苦行法门同外道不同，（是）合理的，非常合理。外道的苦行法门简直是不合理、硬整。</p><p> 你说中国有没有？中国现在也有，有许多人烧香——我前天跟他们讲，现在此地看得少了。三步一拜朝香，那个香炉（用）一个铁钎，就是这样插进去（师示），这边透出来，铁钎等于含在这里，插进去插到肉里，哎呀……两头挂个香炉，永远烧着的，三步一拜，拜峨眉山或者拜五台山。这是修苦行。但是你说，好怪呢，他挂了几个月的香炉，等香炉拿掉以后，这里没有印子，不会穿一个洞。苦行功德也是不可思议哦，所以神通也不可思议哦。</p><p> 像这些苦行是苦行外道的修法，可是，佛教里有时候也很流行，他不晓得这是苦行外道的。</p><p> 头陀行，所谓日中一食就是头陀行，不蓄三衣、不住庙子、不住什么，都是……先是永远不倒单，是十二头陀行之一。“头陀不三宿空桑”，一个庙子、一个地方没有住三天的。所以，头陀行带大斗篷、一个蒲团，像达摩祖师背上的那个蒲团，都是席地而坐，到庙子上、大丛林挂单，修头陀行的不进来挂单的，庙门口坐坐就是了。不管下雨、冬天，就是大斗笠撑到……。所谓十二头陀行，（有）十二种。</p><p> 迦叶尊者是禅宗的祖师，是以十二头陀行为主的。所以讲禅宗，我们后世，毯子盖着，棉花垫坐着，禅宗？是很“馋”就是了。禅宗是走的十二头陀行的路子哦，迦叶尊者……。所以，许多禅宗祖师都是走这个路子。千万要注意这一点！</p><p> 所以，这一位修十二头陀行，学了五年，已经得到三果罗汉的境界，就是不能证四果，不能证得阿罗汉，问题在这里，要注意。他修到了三果罗汉的境界——三果罗汉的境界如果讲果报，肉身完了的时候，一返人间；也等于说，三果罗汉再进一步可以修到不还果了，就不来了，就不来了，不来了在另一个世界里再进修。但是，要证即身成就的阿罗汉果，谈何容易啊！</p><p> 阿罗汉分两种，大阿罗汉，佛也不过是叫大阿罗汉，佛才是真正的大阿罗汉；声闻阿罗汉，是佛弟子们中的四果罗汉。他就是不能证到四果，修不成功，这个问题在这里。你们注意看啊。</p><p> <strong>【即从坐起。至迦叶所。整衣服。叉手合掌。顶礼摩诃迦叶。白言。和上。我随和上。勤修精进。如救头然。已经五年。今得住于阿那含果。身心疲懈。不能增进无上解脱。唯愿和上。为我速说。】</strong></p><p> 这个注意啊，这个“和上”就是现在称的“和尚”。后来中国翻译的用那个“尚”字，原始佛经的翻译多半用这个“上”，也代表上人的意思。你看，我给老和尚写信，有时候就称“和上”，就写这个“上”，最恭敬了，“和上”就是佛。</p><p> 这里所谓称迦叶尊者（释迦牟尼佛？）“和上”，佛的徒孙嘛。他说：“我随和上，勤修精进，如救头然”，我最用功了……那么，等于说自己头发烧起来，救命一样，你头发被火烧起来，你什么都不管了吧，一定先救自己的头吧，用功要这个精神。他说：我以这种精神来修行，五年了，到了三果罗汉。哎呀，我修行都修累了，“身心疲懈”，就是达不到阿罗汉果。“唯愿和上，为我速说”，求佛，你快来告诉我怎么进步。就是他的师父迦叶尊者把他也没办法了，他只好找师祖，找佛祖。</p><p> <strong>【尔时摩诃迦叶。即入三昧。观比丘心。知此比丘不尽诸漏。从此命终。生阿那含天。从三昧起。告言。法子。我今身心。一切自在。入自在三昧。观汝宿世所有业报。于此身上。无缘得成罗汉道。】</strong></p><p> 注意啊，千万注意读经，你们注意哦。我们大家的肉身，全身都是业力所生的。照密宗讲，此身的业气不能转，你不要谈修道了！</p><p> 修道，心容易啊，大家都晓得：哎呀！最好是心念不要妄想——你做到吗？哎哟，我不要起烦恼——你做到吗？我对人要慈悲的——你做到吗？等于有个同学的日记写得好：我们口口声声讲见地、行愿……哎呦，一谈行愿头头是道，派到他做一点什么事情，先躲开了，呵，是真的哦，心想，做不到啊！这个肉身就是业力，本身就是业力，业在哪里？这个肉身没有转化，没有变成圣贤的报身，你统统就是业力所生。</p><p> 所以，迦叶尊者告诉这个弟子，他说：我在定中观察你所有出世的业报，“与此身上”，你这个肉身、你这一生没有希望成阿罗汉，就有这样严重！就是迦叶尊者把他没办法，只有去找佛，找大和尚去了。</p><p> 所以，我们特别注意啊，此身业报不转，没有办法！头脑为什么开不了智慧？你的脑神经为什么那么坏？为什么生老病死脱不掉？为什么头脑障碍那么多？为什么烦恼不能断除？明知道烦恼是空，空不了烦恼？明知道妄想是空，空不了妄想？明知道不要贪嗔痴慢疑，你贪嗔痴慢疑随时来？——你此身上的业气随时动！现在告诉你什么叫业气，这股业气。</p><p> 所以，你会常常发起无名、愚痴、障碍，魔障就来了，魔障在哪里？你本身的业气。</p><p> 所以，你看这个弟子，现在佛经都是给你做证明，迦叶尊者说：我的老弟啊，我把你没办法喽，“于此身上，无缘得成罗汉道”。</p><p> 所以，道家后来有句话，“此身不是神仙骨”，这个身上没有神仙的骨骼，“纵遇真仙莫浪求。”你就是碰到神仙，你不必求道；他就是要教你，也没有办法，你不是那个材料嘛！你是尼龙做的，他这个东西要钢筋水泥，第一等的钢筋水泥做的。你是尼龙做的这个身业，真的拙火一来，你就烧化了，来一根洋火都把你尼龙烧化了，有什么用啊！？所以要修身。看看怎么办？看我们大和尚释迦牟尼佛怎么办？这是个考验了。</p><p> <strong>【阿祇达多闻此语已。悲泣雨泪。白言。和上。如我今者。不乐生天。如困病人。求无常力。我畏生死。亦复如是。</strong></p><p> 尔时迦叶告言。法子。善哉善哉。善男子。夫生死恶。犹如猛火。烧灭一切。甚可厌患。我观汝根。不得明审。】</p><p> 迦叶尊者说：我在定中观察你的前生，但是，虽然看到你这一生没有希望，我的工夫功力——大阿罗汉可以观察人的五百生，到五百生，五百生以前是什么？非证入大乘菩萨境界才知道。所以他说，我看你的根器，“不得明审”，只好到此为止，只好带（他）去见师祖去了，见佛祖去了。</p><p> <strong>【又复世尊。与诸比丘。在祇陀林。我今与汝俱往佛所。时彼比丘。著衣持钵。随迦叶后。诣祇陀林。到于佛所。见佛世尊。身如金山。处大众中。威德自在。三十二相。八十种好。皆悉备足。为佛作礼。绕佛七匝。却住一面。胡跪合掌。白言。世尊。我此弟子阿祇达多。随从我后。修十二头陀。住深禅定。至阿那含。不能增进。竭烦恼海。唯愿世尊。为说甚深灌顶甘露净解脱行。】</strong></p><p> 好好听啊，这是非常重要。但是很不容易哦，修到这一段，到这个境界，前面白骨观是一路下来的哦。</p><p> <strong>【尔时世尊。告阿祇达言。善哉善哉。阿祇达。快问是事。吾当为汝分别解脱。谛听善思。乃往过去。无央数世。彼世有佛。名大光明如来。应供。正遍知。明行足。善逝。世间解。无上士。调御丈夫。天人师。佛。世尊。彼佛出世。三种示现。教化众生。度人周讫。于像法中。有一大国。名波罗奈。王名梵摩达多。王有太子。名忍辱铠。坚发甚深阿耨多罗三藐三菩提心。求一切种智。自誓不杀。修十善业。于六波罗蜜。无疲厌心。</strong></p><p> 时彼国中有一长者。名日月音。自在无量。唯有一子。忽遇热病。风大入心。狂乱无智。手执利剑。走入巷陌。杀害众生。时彼长者。爱念子故。手擎香炉。至四城门外。烧香散华。】</p><p> 这是个故事啊。</p><p> <strong>【发大誓愿。而作是言。世间若有神仙。圣人。医师。咒师。能救我子狂乱病者。一切所有。悉用奉施。】</strong></p><p> <strong>【尔时太子。出城游戏。见大长者。修于慈心。为子求愿。心生欢喜。而作是言。此大长者。勤修慈心。普为一切。而长者子。遇大重病。愿诸神仙。必兴慈悲。来至此处。救长者子。</strong></p><p> 语顷。即有一大仙人。从于雪山。腾虚而至。名曰光味。至长者所。告长者言。汝子所患。从热病起。因热病故。生大嗔恚。心脉悉开。风大入心。是故发狂。】</p><p> 注意啊，这是个医理学，所谓中医、西医……这一段故事，佛经所讲的故事，你不要看成是神话，都是真实。这位太子叫忍辱铠，专修忍辱境界的。那么，这位长者的儿子发疯了，“忽遇热病，风大入心”，就是发高烧，高烧久了狂乱了，气就错乱，神经错乱，就是生神经病。然后，神经病分两种：一种文的神经（是）内向，自己笑啊、自己哭啊，什么人也不愿意见；一种武的，拿刀杀人。</p><p> 那么，这位长者为了这个儿子，大慈悲去求，到处宣告，不管神仙，谁帮我医好如何如何，感动了一位大仙，所以“腾虚而至”。他说：你的儿子所生的病，“从热病起”，因发烧而来，现在（讲）就是高烧、热病。为什么高烧呢？那就是病根了，“因热病故，生大嗔恚”， 身体上发烧已经是火，心理上发了大脾气，又加上火，心理上动大嗔恚，有大脾气，脾气大的人嗔恚心大。噢，这一下，心脉震开了，邪气、邪风进入心，发狂。</p><p> 所以，中医治神经疯癫的病，用的药……，看印度许多佛学的医理，大部分的原理是相同的，很值得研究的。所以，如先曾说，此病是“风大动者”，是由气分，气分的治疗。我们先休息一下。这同我们修道是一样的，修道容易发生许多境界也等于是神经，是风大、火大的关系。</p></div>"
},{
    "title": "禅秘要法讲座 22",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> <strong>【当须无嗔善男子心血。以用涂身。须善人髓。服如大豆。可得除愈。】</strong></p><p> 这个“大豆”不是黄豆，也不是中国的那个大豆。你不要觉得现在精神不正常，就多吃点大豆，那个植物蛋白质吃多了，有时还是不行的。</p><p> <strong>【尔时长者。闻仙人说。即于路中。顶礼太子。白言。地天大仙人说。我子所患。当用慈心无嗔人血。及以骨髓。乃可得瘥。我今正欲。自刺我身。出血食子。破骨出髓。持与令服。唯愿太子听许此事。尔时太子告言。长者。我闻佛说。若有众生。苦恼父母。堕大地狱。无有出期。】</strong></p><p> 注意啊，佛经说，一个儿女不孝顺，使父母苦恼，“堕大地狱”，永无出期。所以，注意啊，佛教是非常教孝为根本的。</p><p> <strong>【云何长者。自破身体。欲令子瘥。且忍须臾。当为长者。作大方便。</strong></p><p> 尔时长者。闻太子敕。心大欢喜。礼太子足。还至家中。象负其子。送与太子。太子见已。醍醐灌之。尔时仙人。告太子言。设以此药。灌此男子。经九十日。终不可瘥。要得慈心无嗔人血。尔时太子。内自思惟。除我身外。其余众生。皆当起嗔。我今为此。救诸病苦。济生死命。誓求佛道。于未来世。若得成佛。亦当施此法身常命。】</p><p> 学佛的，修慈悲观（是）根本，注意哦。工夫做得最好，到了三果罗汉，慈悲心没有真正发起，大阿罗汉不得证果，更谈不到菩萨道。</p><p> 所以，这位太子自己一想，当今的世上，除了我没有嗔心以外，找不到第二个真正有慈悲的心。他就发愿，准备把自己牺牲了，救一个人，“于未来世”，以此功德能够成佛，那么，准备布施自己的生命，所以，自己刺自己身上的血，这一段……，慈悲真不容易。所以嗔心一动，一个脾气一来，里面风动；所以脾气动了，肝火一定旺。</p><p> 你看两种人，一种人看到都没有脾气，（其实）脾气大得很，一句话也不会说，看到慢慢的，你讲他什么都不生气——他发闷脾气，内在的嗔心，肝非坏不可，这样的人最后多半是得癌症。你看啊，一种是脾气大，向外发挥的，动不动脾气就来，最后是神经发疯而死，或者是脑溢血。嗔心，贪嗔痴——贪是欲方面，尤其偏重于色欲，那当然很严重。嗔，有这样的严重，嗔心。</p><p> 所以，是非善恶太分明，看不惯，有许多人表面上的修养非常好，实际上里头的嗔心非常大。当然，你不能说：“我是修怒目金刚……”那是我讲的啊，呵，有许多年轻的同学……你们随便，“哎哟，我也跟老师学怒目金刚。”你学学看，怒目金刚？都把你眼睛爆出来！怒目金刚是你讲的啊，那是十地菩萨以上的境界。</p><p> 你以为学得脾气大，动则心肠歪曲……像我们年轻同学里头，很多都走这个路，我不大想看，莫名其妙！跟我学的人有这些毛病，好的学不到，狂妄先学会。学老师一样脾气大，嘿嘿，我的脾气大，我的本事比你大，你怎么学不到呀？坏的都学到，那我抽烟，你们怎么不学抽烟啊？你试试看吧，果报立刻现前，自己还不知道，自己都检查不出来。</p><p> 所以，学佛第一要学会慈悲，除嗔心谈何容易呀！有时候心理不如意，动一点点心，就是嗔心哦，一点不高兴，那就是嗔心哦，你以为嗔心一定要发出来啊。</p><p> 所以，这位太子说：当今世上，没有无嗔心的人，因为他是修学忍辱行，多生累劫……只有我自己自破身体，慈悲心谈何容易啊！</p><p> 现在看他，这段故事……。</p><p> <strong>【作此誓已。即刺身。以血涂彼大长者子。破骨出髓。与之令服。长者子服已。病得除愈。是时太子。以破骨故。迷闷躄地。尔时天地六种震动。释梵护世。无数天子。佥然俱下。到太子所。告太子言。汝今以身济病众生。欲求何等。为求帝释。魔王。梵天。转轮圣王。三界之中。欲求何等。</strong></p><p> 尔时太子。白帝释言。我今所求。亦不欲三界之中尊荣豪贵。我所求者。乃愿欲成阿耨多罗三藐三菩提。尔时。帝释闻此语已。告太子言。汝今刺身。破骨出髓。身体战掉。有慨恨不。尔时太子。即立誓愿。我从始刺身体。乃至于今。若无慨恨。大如毛发。令我身体平复如故。作此誓已。身体平复。如前无异。尔时帝释。见此事已。白太子言。太子威德。奇特无比。有强大志。必得成佛。太子成佛时。愿先度我。作此誓时。太子默然而说偈言。</p><p> 愿我成佛时。普度诸天人。</p><p> 身心无挂碍。普慈爱一切。</p><p> 亦度于汝等。令诸众生类。</p><p>  皆住大涅槃。永受于快乐。】</p><p> 注意啊！大家学佛的人，都学到这样的发愿，愿我成佛的时候如何如何——前面恐怕忘记了，你没有那么大的善心啊。有时候也学佛学到发愿，你那个发愿是做生意耶，愿我拜一下佛……愿我此功德，将来成佛时，如何如何……然后是一本万利、开门见山对我发财，呵，都是如此发愿。</p><p> 你看看这个活的教材，能够做到吗？他当时把自己身体刺了，布施了。后来所谓感动了玉皇大帝这些天人都下来，说：你要求什么？想求为“帝释”，做玉皇大帝、做天主吗？——天主跟魔王两个对等的，所谓魔王是大神通者，但是有嗔念，也是天人哦。</p><p> 所以说：你要求做玉皇大帝还是做“魔王”，还是做“梵天”——这个三千大千世界的唯一天主。“帝释”是玉皇大帝，欲界天的天主。梵天是包括三界天的天主。你要做梵天？还是在人世间做一个“转轮圣王”？太子说：我这些都不是，我所求只要成佛。</p><p> 那么，这些天人一听，说：你当时自己刺出血，把自己身体破坏、骨头敲碎，把这个血水涂他的身体——不是出血啊，我们也可以输血，（是）骨髓敲出来！你当时有没有怨恨？“慨恨”，不是发脾气，“慨”有点感叹，“唉呀，我痛死了！”（有）这样一点都不行。有没有一点感慨？有没有一点恨念？太子假如说我没有，他也不相信，他也不答复，他说：现在我求一个证明，当时我如果动了丝毫的“慨恨”之念，有感慨，有稍微一点退悔、后悔，一点感慨自己，不算数了。假使证明我完全没有，应该一个因果马上证明，我的身体自然恢复了，结果就是身体自然恢复了。所以，感动得天人，就晓得了他有这样坚强的意志、这样坚强的愿力。</p><p> 不是三天、两天毛病又来了，三天、两天，哎呦，要请假了……三天、两天又要什么了……三天、两天这里不对了、那里不对……这两天又好得不得了了——都是神经病！学什么佛啊！</p><p> 他说：不是这样，我将来成佛。所以天人晓得，他这样大的志愿、坚定的心，非成佛不可。所以，“愿先度我”，所以他是发这个愿，因为这个愿……</p><p> 我经常看你们发愿，一切善知识也教你们发愿，你们发愿……我从来不敢发愿，呵，愿可不容易发哦，要发正愿、要发真愿。所以，我都是劝你们早晚课诵应该念《普贤十大愿》，这是学佛的第一步。</p><p> 好，现在再念下去。</p><p> <strong>【尔时。太子说此偈已。诸天雨华。持以供养。复雨无量百千珍宝。积满宫墙。太子得已。持用布施。布施不止。修诸波罗蜜。皆悉满足。得成为佛。佛告迦叶。尔时波罗奈国王者。今我父王阅头檀是。尔时月音长者。今汝摩诃迦叶是。尔时长者子。今阿祇达比丘是。尔时忍辱铠太子者。今我释迦牟尼佛是。尔时帝释者。今舍利弗是。</strong></p><p> 佛告迦叶。此阿祇达比丘。乃往过去风大动故。发狂无知。是故今者。入四大定。于风定中。心疑不行。设使此人。入风大定。观四大者。头破七分。心裂而死。当教此人。修于慈心。】</p><p> 注意，这是一个故事，佛讲前生的故事。他说，现在迦叶尊者的这个弟子——因为迦叶尊者只能查出他的五百生，就说他没有希望证阿罗汉果，所以只好带来见佛祖。佛告诉他这个故事，讲完了，说：他就是当时那位生病的年轻人，当时的这位太子就是现在的他（释迦佛）。所以，他把这个故事讲完了。故事归故事，这是讲佛自己的行持。</p><p> 当时那一生，过去“风大动故”，气分发狂，“发狂无知”，所以神经了。因为他过去阿赖耶识业识因缘的种子带来，我们这个身体就是阿赖耶识业识种子变的。如果真的“入四大定”，以地水火风四大定来修，把地水火风这个色身修化了，才能得阿罗汉果——这是佛经给我们讲的修持法门，切切实实喔。四大地水火风，把这个色身修化了，才能证得阿罗汉果。</p><p> 他说，现在，如果你教他进入四大定，不管水观、火观、风观，他一修到风大定的时候，“心疑不行”，他就不能进步了，自然的。为什么？阿赖耶识多生累劫的种子发现了。</p><p> 所以，你们有时候做做工夫，有三天打鱼，两天晒网，有好两天、有坏两天，有时各种魔障的思想又来了——你不要向外面研究别人的事，也不要研究环境，学了佛，听了佛经就晓得，（是）你的业力又发了，一切都是自己业力发作。没有善知识救你一下嘛，早就下去了。</p><p> 但是善知识——像我们不是善知识啊，慈悲心是有限度的，搞烦了，慈个什么悲啊，我就不行慈，行悲了，哭你一场就算了——也是悲啊，你死掉，我来哭哭，掉两颗眼泪，那不是悲呀？</p><p> 所以，你注意哦，修行都是自己业力发。</p><p> 他说，这个时候，“设使此人，入风大定，观四大者，头破七分”，头会大痛，虽然不像那一生一样发神经，可是，头痛得裂开了一样，会爆炸。所谓头破，现在讲，最后还是脑神经（血管）破裂而亡、脑出血。</p><p> 所以，你看，在台湾，有许多修道的，工夫做得怎么好，最后红光满面，无疾而终——所谓无疾而终就是血压高，脑神经破裂。看到没有病，“呃呃……”走了，那走了也是红光满面。然后我们写传记，望之如生啊，看起来像活人一样，他脸上都是红的嘛，可见都有血色，不像……实际上是脑神经破裂。他是“头破七分。”</p><p> “心裂而死”，不然就是心脏病。我们在台湾，三十年来，多少经验，你看道家、佛家好多，这些了不起的，修得工夫怎么高的，最后不是心脏病死，就是血压高死的。</p><p> 修持要科学啊，这个时代，科学进步了，真正修持佛法，不配合科学，你就不懂。</p><p> 他说，现在唯一的办法，你要使他证得阿罗汉果，那就不是前面的工夫了——你注意哦，前面的工夫，地水火风，修气、修脉、修白骨，都好办哦；到这里是理上修喽，智慧了，下面都是（讲）教理。不像白骨观、不净观，修气脉什么……那个都是做工夫的有为法；到这里，（是）教理的无为法来了。所以，只有修慈心观。</p><p> 要特别交代注意啊！所以，我特别提出，要大家注意。</p><p> <strong>【尔时。世尊告阿祇达。汝今当观一切众生。悉为五苦之所逼切。汝今应当。生大慈心。欲免众苦。观色受想行识。悉皆无常。苦空无我。阿祇达闻佛说此。豁然意解。应时即得阿罗汉道。三明六通。具八解脱。即于佛前。踊身空中。作十八变。】</strong></p><p> 好。你看，佛只叫他：你现在赶快修慈心观。这些教理都有，你统统要观察清楚，人生（是）五苦所变，就是八苦、五苦、十二苦——佛经讲的苦的分类不同。厌离心发起，修大慈悲度众生。</p><p> 度众生不是空讲一句话，你拿什么来度呀？！你自己也要佛法来度啊。</p><p> 所以，你要想“欲免众苦”，所谓苦集灭道……真要灭众苦，你要“观色受想行识”五蕴，所以“照见五蕴皆空”，怎么照法呢？注意，这一段经文讲得很简单，《楞严经》就要来了。《楞严经》讲五蕴解脱，一步一步工夫都有。尤其我给大家找出来的“楞严经串珠”，就是附在《楞严大义今释》后面的。五阴如何解脱，怎么样修证，都有的，就是大家不去找、不去看。</p><p> 他说，要“观色受想行识”，五阴一步一步的解脱了——五阴解脱不像四大，四大是肉体骨质哦，做工夫来的，修气、修风，所谓气脉、明点、拙火，可以修哦；这个修完了，你（要）晓得，这个四大纵然解脱了，变成阿罗汉一样的神通具足，还是外道哦——心没有解脱。</p><p> 要身心同时解脱，所以“照见五蕴皆空”，《心经》上告诉你要“照见五蕴皆空”，怎么样空？你去空空看，空得了嘛！？不要自欺欺人。</p><p> 五阴皆空的方法，《楞严经》给你讲得清清楚楚，《楞严经》后半部走的统统是五阴解脱的路子。那么，（每）一阴的解脱，容易发生的魔障，归纳起来有十种，所以变成五十种阴魔。这一段，特别把精华都给你们集中了。</p><p> 所以，叫你们研究所的同学们要看“楞严大义串珠”。大概我叫你们看的时候，怕我考，马上找《楞严大义》。过两天，我讲别的时候，你把《楞严大义》变成“楞严小义”了，再变成“楞严无义”了，然后“楞严”，搞得愣头愣脑的。哈，你们这些同学，我都看得很清楚。</p><p> 所以，我一讲《楞严大义》以后，怕我考，赶快下去买《楞严大义》哦，一个一个买哦，没有钱的借钱哦……我坐在那里看，蛮好笑，做生意倒是最好的宣传办法（众笑）。然后过两天，我不讲《楞严大义》，你变成“愣严大义”了，那等于是……但是，你要真讲修持，不要自欺了。</p><p> 他说，这个时候，你看，他把五阴解脱一修到了以后，当时在佛前面就得阿罗汉果。所以，达摩祖师讲禅，两种入，一个是行入，一个是理入。所以《楞严经》也告诉你，“理则顿悟，乘悟并销”，那是顿悟法门，这个时候，他进入顿悟法门，得阿罗汉，要注意这个关键。</p><p> 现在，下面的《禅秘要法》差不多转成大乘的路线了。不是转，你走修持之路就是这样呆定的，修持是个科学，没有办法违反的。</p><p> 你空洞讲佛学的理论很容易，何必花那么多时间呢？自己买一点佛学书看看，我们现代人的程度看佛书都看得懂，然后，你就可以吹起来了，办个刊物、办个报纸，大吹起法螺来。</p><p> 真讲修证，不容易哦。现在注意这一点，你看，他证到罗汉以后，就马上跳到虚空里，现十八变证明。</p><p> <strong>【作十八变已。从空中下。顶礼佛足。白言。世尊。如来今者。为我宣说。往昔因缘。及说慈心。广演四谛。我因佛力。寻时即破三界结业。成阿罗汉。唯愿世尊。为未来世浊恶众生。恶业罪故。生五浊世。如此众生。若修头陀。行诸禅定。得阿那含。如我心疑。停住不行。当修何法。得离苦际。</strong></p><p> 佛告阿祇达。谛听谛听。当善思之。如来今者。因汝阿祇达。普为未来世一切众生。广说从阿那含至阿罗汉。于其中间。所有微细一切境界。当自分别。】</p><p> 现在佛是详细——他说详细，比较还是详细，还只是告诉你原则，要注意啊。</p><p> <strong>【若风病多者。入风大定时。因风大故。喜发狂病。当教观佛。】</strong></p><p> 对，就是你身上的气不对，气分不对的人——佛在分析……将来你们教人的，你们将来总有做老前辈的，老前辈带领后辈，教人修行打坐不是那么简单啊。“若风病多者，入风大定时”，你再叫他练气的话，只“因风大故，喜发狂病”，容易得神经。</p><p> 四大，每个人的身体不同，地、水、火、风，等于我们生理部分的心肝脾肺肾，有些人肺弱一点、有些人肝弱一点，有些人哪一部分强、哪一部分弱，你都要观察清楚，再告诉他怎么样的修法。</p><p> 同样一个方法，教一百个人，几乎一百个人差别的路道有一百样不同，你要注意的。</p><p> 所以，“若风病多者，入风大定时，因风大故”，他对气分了解不透，智慧不够，光修气，容易发狂。</p><p> 再说，你们做呼吸的、或者修气功的、学密宗的、九节佛风、宝瓶气的，或者修道家的任督二脉气，气多了以后，你反是精神旺盛，睡不着觉啊、身体涨啊、很难过啊，欲念跟着也来了，什么也来了……。因为你这一面吃多了，你不晓得泄。所以道家的道理，进阳火要晓得退阴火。有时候你把这个东西培补起来了，某一部分要把它泄开，所以修行很难呐。佛告诉你“因风大故，喜发狂病。”</p><p> 那么，这个时候怎么办呢？对治气大，四大……有时候你工夫用得很好，非常壮……，当然，你们诸位还没有修持到这个境界，修持到这个境界，可以几天几夜不想睡觉；不是不想睡，里头气都充满了，脾气非常大哦，到这时是气大哦，那真是“气大佛”！平常是讲笑话叫气大佛，到这个时候真是气大佛，碰不得的，一点都不得了。</p><p> 我看了很多的前辈、善知识到这个境界，先不懂，都晓得他有道、工夫，脾气特别大，有时候觉得（是）无理得大。后来，自己慢慢才晓得，这些是风大病，也叫做禅病。</p><p> 他说，这个时候赶快——换句话，佛不像现代的话，我们拿现代话，赶快放弃了气的部分的修持，转到心理上——观佛，这完全用心理了，不管那个安那般那气的部分，马上就改道，也就是易观，调方法。这是一种。</p><p> 如果光修气呢，也可以，这个时候只修呼气了，就哈气哈出去，只有哈气，把身上正气部分完全排掉，排到空的境界，也可以。但是始终，这个中间都有方法的，一步一步的方法、一步一步的修持，严密得很啊。所以，真讲修持的工夫，简直是没有办法教。</p><p> 因为老实讲，那么多年，很多人也修，打打屁股呀，香板一天打他，好像都见到空一样，也觉得自己的智慧很了不起了。然后气色也好、身体（也好）——中间都是岔路，后面我多半不教，为什么？默默观察他的心行，心理行为，就不必了……让他去吧，走岔路就走岔路，再来嘛，三大阿僧祗劫慢慢来嘛，就不行……许多所谓是“十人九岔路”，十个修有九个这样，都是中间岔路开了。岔路开就放弃，就不管。</p><p> 六道轮回，地狱里头滚两下，坐电梯一样，也没有什么关系。滚到地下室去了，慢慢来嘛，停电在那里，多停留一下，三大阿僧祗劫（后）再把那个电源给他接上，苦头吃够了再说吧。修道的都是这样的多。</p><p> 现在讲观佛的法门。</p><p> <strong>【教观佛者。教观如来十力。四无所畏。十八不共法。大慈大悲。三念处法。观此法时。自然得见无量色身。微细妙相好。或有诸佛。飞腾空中。作十八变。或有诸佛。一一相好。普现无量百千变化。见此事时。当起恭敬。供养之心。作香华想。普散诸佛。然后复当。自思惟言。我今身中。五阴四大。皆悉无常。生灭不住。结使枝条。及使根本。皆悉无常。我所念者。念佛十力。四无所畏。十八不共。大慈大悲。如是功德。庄严色身。犹如宝瓶。盛如意宝珠。】</strong></p><p> 这都是理上了了。</p><p> <strong>【宝珠力故。映饰此瓶。珠无我所。瓶亦无住。但为众生。佛亦如是。无有色性及与色像。解脱清净。】</strong></p><p> 这一段，大家可以转成大乘，假设有人将来修持到这里，转成大乘，《金刚经》“若以色见我，以音声求我。是人行邪道，不能见如来。”“一切有为法，如梦幻泡影。如露亦如电，应作如是观。”到这一步，可以转成走禅宗路线了，《金刚经》的理参透，或者参《六祖坛经》的理，就可以成就。</p><p> <strong>【云何我今谛观如来十力。是处非处力。乃至漏尽力。十八不共法。大慈大悲。云何更见无量色像。</strong></p><p> 作此想已。见真金像满娑婆世界。行住坐卧四威仪中。皆说苦空无常无我。虽见此事。复当起意。想是诸佛。皆是戒定慧解脱。解脱知见。十力。四无所畏。十八不共法。大慈大悲。三念处。如此功德。所共合成。云何有色。作此想时。一一谛观。令一切佛。身心无碍。亦无色想。自见己身。如空中云。观五受阴。无诸性相。豁然欢喜。复还见身。如莲华聚。周匝遍满。三千大千世界。见诸坐佛。坐己华上。为说甚深空。无我。无愿。无作。圣贤十四境界门。</p><p> 佛告阿祇达。若有行者。见此事已。当教慈心。教慈心者。教观地狱。尔时行者。即见十八地狱。火车炉炭。刀山剑树。受苦众生皆是己前身父母。宗亲眷属。或是师徒。诸善知识。见一一人。阿鼻地狱。猛火烧身。或复有人。节节火然。或上剑树。或踏刀山。或投镬汤。或入灰河。或饮沸屎。或啖热铁丸。或饮融铜。或卧铁床。或抱铜柱。或入剑林。碎身无数。】</p><p> 我们注意啊。这个时候，他叫我们观地狱，当然地狱啊，谁也没有时间去看，也没有机会——希望大家也没有机会去看，万一看了，自己也差不多……。</p><p> 不过，地狱在哪里？人间就有地狱，你看看……你说，这些在哪里？我们都看见过地狱啊。你到医院里看看，有时候被电一电，就是火烧嘛；“节节火然”，拿电烤来烤；或剑树“刀山”，开刀了；或者一些烫的了；或者各种吃药了。现在那个检查的，科学的东西固然很好，这里吞下去，一直照下去，以我一看，这个家伙又在吞铁丸了，铁丸子吞下去了；喝的铜汁，哎呀……人间事多少时间是在地狱啊！</p><p> 你到医院多去看看，到外科、精神科，你去看看。容总（医院）较少，你到台大的精神科病院里，四五道铁门，比那个牢监还严重，监牢还没有这样严重。一进去铁门，然后一层一层锁了的铁门打开。一进去，关在那里，带着手铐，“嘿嘿”、“呵呵”，你一看，你都毛孔悚然起来。不过，我在里头看了半天、想了半天，究竟他神经、我神经，搞不清楚，哈，因为我看他们是神经，他们看我们都是神经，所有的神经（病）看我们都是神经。你看，都是带着铁链子坐着，有些笑的，有些……都在这里。每个医院你都去看，人间都有地狱。</p><p> 有时候我们病了，身上受伤了，石膏一打；再不然腰上插个铁片，那就是睡在铁床上受罪嘛。何必一定下去看，现在看的就多得很。其实，我们虽然没有下，有时候也在下。</p><p> 冬天吃辣椒，汤越烫越好，那还不是饮铜汁的地狱，不过，饮得很痛快，是愿意下一下这个地狱。吃得不好了，嘴巴也破了，这里也冒火了，再吃消炎片，又来嘛。这都在活下地狱，真的耶，你仔细观察这一切现象。</p><p> <strong>【或挑眼无数。持热铜丸。安眼眶中。或见饿鬼。身形长大。数十由旬。啖火啖炭。或饮脓血。变成融铜。举体火起。足跟铜流。或见闇冥。铁围山间。满中众生。状如罗刹。更相食啖。见诸夜叉。裸形黑瘦。双牙上出。头上火然。首如牛头。角端雨血。复见世间。虎狼师子。诸恶禽兽。更相啖食。复见一切诸畜生苦。或见阿修罗。割截耳鼻。受诸苦事。</strong></p><p> 复见三界一切众生。为欲所使。悉受苦恼。观无想天。犹如电幻。不久当堕大地狱中。举要言之。三界二十五有。一切众生。皆有三涂苦恼之业。】</p><p> 这句话注意啊，讲地狱的道理，注意佛经这句话重要，“观无想天，犹如电幻，不久当堕”，就是生到天上，生在天堂变天人——当然，比较起来，比我们寿命长，就是很享受，没有人世间的痛苦，但是你晓得，在一个舒服境界里的人，他过一万年等于我们过一刹那。在舒服中觉得时间很短，一样堕落。</p><p> 重点就是在这一句话，“举要言之”，佛说，最重要一句话。“三界”，欲界、色界、无色界，“二十五有”，一切众生的分类，生命分成二十五种，“一切众生，皆有三涂苦恼之业”，升到天上变天人，天人里头的地狱之苦……。</p><p> 譬如我们人间，我们这个社会上，我们坐在这里很舒服啊。真到劳苦阶层，或者最乡下，我们坐在那里好好观察一下，我们是天人境界哦，他们是真苦哦。但是，他们有他们的乐趣哦。最劳苦的人，煤炭洞里那个一身黑出来……进去的时候，算不定那个煤炭洞就塌了、压了。我常常到煤炭洞，看这些煤炭工人进去的时候，哎呀，我心里的味道……这一进去，钻进去，算不定煤炭洞一塌就压在里头。</p><p> 他一出来，劳苦一天，那个屁股上拖一篮煤出来，头上带一个亮灯，这么爬爬爬，出来以后一脸都是乌黑，然后煤炭一交，今天一算，做了多少工，拿来……然后脸一洗，坐在那里喝酒的样子——那一下，我觉得他由地狱一下上了天，他本身（在）天人之乐。</p><p> 然后，你看这些大福大贵、有钱有人的人，一天不得了……某人几千亿万的财产，他在痛苦的时候，被人家攻击，坐在那里，然后，“哎呀，南老师，这怎么办呢？”也下了地狱。</p><p> 所以，三界里头，天人也有（其）苦，没有这种……离苦得乐，除了证得涅槃、证得菩提。</p><p> 所以佛说，“举要言之，三界二十五有，一切众生，皆有三涂苦恼之业。”千万注意，自己要好好警觉自己，“一切众生，皆有三涂苦恼之业。”</p><p> 譬如我们做官的，做事都晓得嘛，做人家的部下，看到当主官的神气，你要晓得，那个当主官的见到比他更大的主官，他同你一样的苦恼啊，他那个时候又下地狱了。所以，“一切众生，皆有三涂苦恼之业。”你注意。</p><p> 譬如我们年轻和尚看到我们老和尚，像我看到老和尚还要磕头，老和尚再看到老和尚也要磕头啊，同样的道理，比方给你听了。就是叫你对这个佛经所讲的文字好好去体会。“三界二十五有，一切众生，皆有三涂苦恼之业。”不但文章好，那个道理……。</p><p> 我们大家念经念到这里，一定轻轻地看过去了，以为懂了，你想一下，多深的学问在里头。</p><p> <strong>【尔时行者。观见三界受苦众生。其心明了。如观掌中。深起慈悲。生怜愍心。见诸众生。宿行恶业。故受恶报。见此事已。悲泣雨泪。欲生救护。尽其心力。不能救济。】</strong></p><p> 这就告诉我们，学佛的要观察清楚人世间一切的苦恼，不是自己的，一切众生的苦恼；随时随地少为自己想，多为别人想，发慈悲心，这就叫做真发心了。</p><p> 我们一天到黑二十四个钟头，一秒钟也没有为人家想过啊。差不多二十八个钟头都为自己想，没有哪一点不为自己想，没有一点……。</p><p> 是讲我自己啊，不是讲你们诸位，你们诸位都是圣贤。所谓圣贤之道，应该都是这样学：观察社会、观察一切众生，那么多的苦恼，我如何才能修持到帮助人解脱这一切的苦恼，这是学佛人的心行。</p><p> 一切为自己想，然后，乃至一切的学佛修道也是为自己来。然后（认为）自己最慈悲，看别人都不对，越看越不对，然后脾气来了，嗔心来了，“这个家伙不是学佛的，混蛋！”嗔心又来了，都是这样的。所以，这一段书看起来这么明白，真正修行要这样。</p><p> <strong>【尔时心中。极生怜愍。厌患生死。不愿久处。心生惊怖。如人捉刀。欲来害己。</strong></p><p> 见此事已。更起慈悲。欲拔苦者。无奈之何。尔时行者。内自思惟。是诸众生。因于无明。无明缘行。行缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老死。忧悲苦恼。</p><p> 尔时行者。内自思惟。此无明者。从何处来。孚乳产生。遍满三界。】</p><p> 这一段提起大家注意，文字尽管念过去了。</p><p> 从这里起，所以，转入大乘，最后这一段就是禅宗的路，观心、参念头了。但是一般人，现在学佛的，一来（就）走观心、参念头、参话头……然后嘛，前面白骨观的禅定之路都没有修好，所以，末世众生没有一个人学佛成功的。</p><p> 所以，我大声疾呼：宁可今天走小乘禅观的路，不要妄言随便讲大乘，不然佛法没有了，种子都没有了。</p><p> <strong>【观此无明。假于地大。而得成长。依于风大。而得动摇。因于地大。体坚不坏。火大照育。水成众性。如是动作。风性不住。水性随流。火性炎盛。地性坚硬。</strong></p><p> 此四大性。二上二下。诸方亦二。东方者成色阴性。南方者成受阴性。西方者成想阴性。北方者成行阴性。上方者成识阴性。</p><p> 此五受阴。依无明有。】</p><p> 注意，这里头问题多了。你看，佛经讲讲，阴阳五行就来了，但是，印度的说法同中国不同。</p><p> “此四大性，二上二下”，二种上，就是二阴二阳，两种阳性。拿中国文化道家《易经》就是用阴阳代表。佛家换一个名词，“二上二下。”</p><p> “诸方亦二”，东南西北都分阴阳。学过《易经》、学过五行，懂得了。</p><p> “东方者成色阴性”，所谓东方五行属木，为什么东方有木呢？东方出木头？西方不出木头啊？不是这个意思。木，所谓东方木，世界上，木就代表草木，世界上生命最坚强的是草木，那个草，你今年把它烧了，只要根根不割掉，“野火烧不尽，春风吹又生”，它生生不已。所以，东方属木就是代表这个生命是连接的，生生不已。所以药师如来属于东方，长寿佛，生生不已。那么在身上呢，肝属木，所以肝是生血的，生生不已，肝属木。肝胆，肝属木是阳性，胆是阴性的，肝胆相连一起。那么，五阴里头就是所谓色阴，物质世界就是生生不已的东西来的。</p><p> 这个里头东西多了，我告诉你，印度、中国文化配合起来，就这一点，就可以上一个学期的课，还上不完。</p><p> “南方者成受阴性”，南方宝生佛，东方药师佛。“南明离火”，离卦，所以南方属火，受阴，感觉问题。我们有生命、有热能，就有感觉。南方都出火的？南极还有冰山呢，怎么叫南方有火呢？南方有火，热能的能源，南极、北极相通的，通过能源来。那么在生理上，它是属于明性，所以在身体上，两个眼睛属于离卦，《易经》的离卦属于火。南方，所以宝生佛、宝明佛，“受阴性”。在生理（是）心脏，南方火。</p><p> “西方者成想阴性”，西方阿弥陀佛，所以阿弥陀佛要想念力去，日落西山的时候，想阴。西方在身体上属金，金属肺。南方是火，火属心。所以，西方是阿弥陀佛代表，无量寿光。</p><p> 那么北方呢？“行阴性”，北方是不空如来做代表。你看到北方没有东西，没有东西——充实，一切充满，所以是不空如来。尤其密宗重不空如来，“行阴性”。所以北方属水，是坎卦。水，宇宙的来源，这个物质世界的来源，第一个是水资源，水来，滋润来。所以《易经》上说，“天一生水，地六成之。”这是水，不空如来。欲念生水，所以，欲念一念动，为什么欲念会引起淫欲念？就是荷尔蒙的变化，“天一生水”，欲念动了，阳气来了嘛。水变成不空如来哦，一接南方，水火相济，那就修成功了。</p><p> 这里学问大得很呢！诸位菩萨，你不要看那么简单。</p><p> “上方者成识阴性”，上方世界，所以维摩居士到上方世界，手一伸，香积世界里拿下来的饮食，人世间没有吃过的，那是思食。我们吃饮食，现在吃的是物质世间的抟食。那个思想到了最高处，那个精神升华到了最高处，那个可以长生不老的，那个东西是思食。上方世界香积居中，就是识阴境界。识阴境界在中国五行属于什么？中央无极土，“四象五行皆藉土，九宫八卦不离壬。”这个土不是土地的土，西方极乐世界之净土，土者不是土地之土，什么是土？心地就是土，五行里的土。</p><p> 所以“此五受阴，依无明有”，这个五行怎么来的呢？唯识、唯心所造的，一念来的。所以，能够了一念，真空可以修成妙有，“幻化空身即法身。”</p><p> 这个里头，我的妈妈啊！三藏十二部都在内了，你看《禅秘要法》，过去几千年把它打成是小乘法门！塞进去了。佛法怎么不沉沦、不断灭啊？！</p><p> 当然，没有人把这个里头发挥出来，要显教、密宗、道家、印度的瑜伽，婆罗门密法等等，什么密法统统都贯通了，这个里头发挥起来……就是这一段，我告诉你们，一学期的课都讲不完，可以著书五十万字。你把理说完了，还有要怎么修法，都要拿出来。所以，密宗有五方佛性的修法，是这样来的。</p><p> 我是简单地提一下，故意吓唬你们一下，表示我知道得多，下一次还可以收收费。</p><p> 可是，你们听听看，就是能够学会吹牛都不简单，花多大的本钱来的。所以，修行怎么是简单的事啊！？</p><p> 今天，我们只好到这里。本来想很快，今天最好就讲完，碰到那里，不忍心不告诉你们。实际上，我心里上想很快把它念完了，今天就结束了最好。到那里啊，我这个人的毛病就是不忍心。不忍心是什么心呀？大概……哈哈。</p></div>"
},{
    "title": "禅秘要法讲座 23",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 《禅秘要法》上次讲到四大观，四大方位。现在，（从）白骨观开始，所谓《禅秘要法》到四大观这个阶段，已经转入到大乘法门的参究了。最后，禅观的成就，就是定力到果位的成就，如果没有慧来解脱，那还是属于外道禅，所以，现在都转入到慧解脱，定慧等持的法门。尤其是要了四大，了这个色身、肉身，这是最难办的事。现在，我们还在四大观里头转。继续上一次的。</p><p> 关于参究大乘的教理，没有机会……我们时间来不及，没有详细地解释了。而且大家，尤其是出家的同学们更需要注意，到这里，教理都是一个事实，必须要参究的，不是只当学术知道了就算数。请念下去。</p><p> <strong>【此五受阴。依无明有。从触受生。乐触因缘。生于诸受。受因缘生爱取有。有因缘故。生于三界。九十八使。及诸结业。缠缚众生。无有出期。</strong></p><p> 如是诸业。从无明有。依痴爱生。此无明者。本相所出。从何而生。遍布三界。于诸众生。为大缠缚。</p><p> 我今应观。无明识相。从何处起。此无明者。为是地大。为离地大。为与地合。为从地生。为从地灭。地性本空。推地无主。云何无明起痴爱想。缘行而有。】</p><p> 这一段就是同禅宗参话头是同一道理，不过，是参十二因缘这个话头。一念无明，不管是贪、嗔、痴、慢、欲、爱，都是这一念无明起来，这一念无明从哪里来？这个时候要参了，要深切地参，配合这个身体同参。</p><p> <strong>【而此诸行。及爱取有。为从风起。为从水生。为火所照。】</strong></p><p> 注意啊，这一念无明起来，都同气两个配合的，念动气就动。所以，“而此诸行，及爱取有”，这是无明的三支，现有支。现在我们活着，对于世间的一切都是贪恋。“爱”就是占有、执着；“取”就是抓得很牢、执着；“有”，因此有。从哪里来？“为从风起，为从水生，为火所照”，跟四大合起来参。</p><p> <strong>【如此四大。一一谛观。此诸大者。实无性相。同如实际。云何牵诸众生。缠在三界。为大烦恼之所烧然。】</strong></p><p> 这个“实际”，不是我们现在观念讲的“实际”。“实际”是佛法的名词，大乘经典有种翻译，称为“本际”，就是现在的哲学名词“本体”，佛学名词就是“真如自性”。“实际”是个佛学的名称，大乘有些经典翻译成“本际”。</p><p> 所以，“此诸大者”，我们这个四大自性本来无自性，也无自相。譬如我们现在活着的有个身体，每一秒钟都在变去，都是无常，变去掉的，无性也无相。古文简单，四个字，“实无性相”。拿白话文来讲：实际上说，没有自性，同时，也没有真实相。我们现在的存在是个幻想。一个婴儿生下来，看一个月的婴儿已经变去了，一天一天在变，随时在变，十岁比一岁又不同，二十岁比十岁又不同。</p><p> 它的相也无实相，“同如实际”，“实际”是什么？空际，本空，自性本空，无自性，本空，所以“同如实际。”假设这个佛学名词搞不清楚，看这个经典，“实无性相，同如实际”，哦，四大是有的，我们现在讲实际的嘛，这个东西是实际的嘛——那就完全搞错了，要注意。</p><p> <strong>【作此思惟已。怖畏生死。患生天乐。观诸天宫。如梦如幻。如露如电。如呼声响。普见一切三界众生。犹如环旋。受苦无穷。】</strong></p><p> 所以，把这个十二因缘参透了，四大色身跟心的一念无明参透了，工夫也到了，上面的工夫已经到了，这个里面起观了——教理叫做观，我们不拿教理讲，禅宗叫做参，把它参透了，所谓正思维修，“怖畏生死”，就是说，要跳出这个生死。</p><p> 生死有什么值得怖畏的？疲劳，生了又死……等于我们吃饭一样，怖畏吃饭：早晨刚吃过，四个钟头以后又饿，又装进去；装进去一两个钟头又饿了，又要吃，怖畏饮食，同样的道理，觉得可怕，唉呀，这个太疲劳，太烦了！</p><p> 那么，虽然厌三界的生死，也“患生天乐”，自己也不喜欢变成天人，尽管活个几千万年，但是，拿我们人间的寿命比较，他几千万年也在无常变幻中，所以，升天之乐也不稀求。所以，“观诸天宫”等等，也看得“如梦如幻，如露如电，如呼声响”，等于回声一样，都是假的，没有真实。在这个时候，才能“普见”，真实见到，不是理论，空洞的理论，“一切三界众生，犹如环旋”，轮回。“环旋”就是如一个圆圈在转，就是我们跳不出这个圈圈。所谓跳出三界，跳出这个圈圈，怎么跳出这个圈圈？跳不出来。不要说三界跳不出来，我们人活在这个社会上，家庭、亲戚、朋友、社会关系这个圈圈，你永远跳不出来。</p><p> 所以，我们要求出世，甚至于出家，就想跳出这个“环旋”。但是，真跳出来（是）靠心，形式上离开了那个小环，进了一个大环，呵，还是在那里旋。所以，三界一切众生“犹如环旋”，受苦无穷，就是这个圈圈跳不出来，都在这个里头受幻有之苦。这就是佛经的文学。</p><p> 如果说：三界一切众生皆在轮回，受苦无穷。也一样呀，可是，我们现在假设看到这样一句话，觉得宗教气味很重。你看，这是鸠摩罗什法师翻译的，同玄奘法师距离还有一两百年，玄奘法师还没有生呢，影子都没有。翻的文学境界非常好，轮回的这个现象，就讲得清楚了，不一定讲死了投生，投生了又死那个轮回，“犹如环旋”，就是轮回，“受苦无穷”。</p><p> 这一段，然后，把四大观观完了，这个四大是第二层的四大，色身到这里真可以了了，自己可以做这个色身、肉体身的主宰了，不受生死所拘束了，这完全是实际的工夫哦。</p><p> 那么，到家了没有？还没有，再来，又是做数息观了。但是，下面的数息观跟上面的不同哦。佛经经典上看起来都是一样的简单，这就要修持经验了——完全不同。文字上差不多，我们先看了文字再说。</p><p> <strong>【见此事已。愁忧不乐世间。如驶水流。求涅槃道。刹那刹那顷。欲求解脱。尔时复当更教数息。一数二随。二数三随。三数四随。四数五随。五数六随。六数七随。七数八随。八数九随。九数十随。十数百随。百数千随。随息多少。摄气令住。】</strong></p><p> 好，这个时候也是一样，“一数二随”等等，这个道理已经给大家讲过。</p><p> 所以，很多人碰到做数息观的，这个问题往往解答不了，怎么“一数二随”，上次我讲过这个，都了解了。到这里，这个数息也是数与随。所以，做数息观也就是练气功了，我们简单明了讲，包括了密宗、瑜伽、道家一切的气功。</p><p> 这个数息观，意作数息观，“意息”。我们普通做数息观，大家打起坐来，都是闭着眼睛感觉，或者是耳朵回转来听自己的呼吸，那是最初步的，由听到呼吸，这是最初步的。修持到了这个阶段，没有呼吸听到了，只有感觉。感觉还不只是鼻子，全身的毛孔，包括九窍，我们身体九个洞，头上七个、下面两个，这些有漏洞的地方统统都在呼吸。但是不像我们鼻子或者嘴巴那么张开呼吸，它是一种感受，进出的问题。</p><p> 当然，你也能够记得，如果心已经专一了，没有杂念妄想了，可以不用数了，注意，是随，心息、心气是完全配合为一了。那不是我们现在这样一口气一呼一吸了，也许一口气进来，停留到几秒，或者一分、两分，乃至甚至到……功力再深了，一呼一吸半个钟头。那这个人很不同了，到这个阶段，人可以飞起来，可以腾空。那么，种种不同，那不同的好处太多了。所以只有随了。</p><p> 这里所谓讲“一数二随”，或者第一次你心不能定，还要加数，数者等于说，我们在呼吸往来，感觉是一件事；呼吸是一件事；心里加上数字，一，一口气，记住——这不是三件事在玩嘛，对不对？是不是这样？……是啊，我看你们都没有点头，都入定了。</p><p> 假设心专一了，根本不要数了，就是心息两个合一，甚至于整个的呼吸，不是鼻子的呼吸，整个身体上生灭的呼吸，整个可以控制了，所谓心风得自在。我们到了这个时候，真正少份的神通可以起来了，尤其是身通，整个的身体，所谓神足通可以起来。</p><p> 其实这个方法都非常简单，我们为什么做不到呢？没有真下修持的决心。譬如你做到了心息自在，完全到了随，这个境界你怕要多少天啊？一个人一念之间下狠心，一天、两天或者半天就做到了，不是做不到，可是，不是用妄想做到的。</p><p> 到达数、随，第三步是止，杂念妄想整个没有了，只要正念在，正念是念而无念，呼吸生灭没有了，永远保持一口气。密宗、瑜伽想做到这个宝瓶气，用意去做的，那很粗的。到了止，那已经不谈什么宝瓶气了，自然就呼吸不往来了。整个的身体在这里犹如皮球一样，气球一样；再加上上面的白骨观已经观成了，把身体肉体整个连骨架子都空掉了，就是一个气体坐在这里。所以，意念一动，这个气体就可以到那个山头、这个山头，自然念头就过来了，因为它是个气球嘛。当然要做到止的境界，这个止不简单了，得止就是这一念，杂念、妄想当然止了，真正的定。</p><p> 所以说“十数百随，百数千随，随息多少，摄气令住”，止，呼吸没有了，气停了，气住脉停了，“摄气令住”，一念把气就控制住了，正念一来，气就停住了。</p><p> 这个时候，假设有人问：还有没有欲念呀？还有没有烦恼呀？那谈都不要谈，那问得很好玩了。</p><p> 你要注意，念动、气动，呼吸停止这个时候，这些都不在话下了，谈都不需要谈，那是渣子了，根本就已经丢掉了，这是真得止。那么下面，再看下去。</p><p> <strong>【尔时自见己身。如百千万亿莲华。一切萎脆。四面风来。吹去萎华。变成琉璃。如琉璃器。自见其心。如大华树。从下方金刚际。乃至三界。顶上有四果。其果微妙。如如意珠。有六种光。遍照三千大千世界。】</strong></p><p> 注意，这又是形容，又是事实。修持到这个时候，刚才我事先跟大家讲过，“摄气令住”，气住念止的时候，那个时候自己看自己的心，等于一切莲华……，其它的四大、这个肉体空掉了，等于花枯了一样，这个肉体等于树叶子，花枯了一样。后天的肉体转成报身成就的肉体，所以，肉体转成像玻璃一样的东西，透亮，内外透明。这是比方哦，玻璃还有质量，这个时候，自己就觉得像气球一样透明。</p><p> 那么，自己见到这个心——这个心不是念头的心，注意了，否则就搞错了。这个心是心脉，身体的中心，就是肉体这样空了，变成中空……自己整个的肉体中心，一直跟地球金刚地际合成唯一了，上至顶天立地……这就是佛刚刚出生，一手指天，一手指地，“天上天下，唯我独尊。”身体是这个样子，这是实际的。</p><p> 那么在这个定中，有时候也跑出来如梦如幻的幻境，也看到金刚地际，也看到一切的花果——这个果是代表你的果位，境界也出来了。犹如如意宝珠，这个时候谈不上是梦境还是幻境、还是魔境，都谈不上，你自己很清楚。</p><p> 所以，这个经典上修禅定，从来没有谈什么修定的时候有没有魔境，什么走火入魔……，你看，没有这样一句话，对不对？全不讲了，所以，他把其它的外衣统统给你剥开了，所谓宗教性、迷信性的外衣都剥掉了。</p><p> 那么，自己见自己这个色身内外“有六种光”，我们所谓七彩光明，“遍照三千大千世界”，完全在光明中。下面，我们再看。</p><p> <strong>【行者见此事时。见金刚地际。乃至上方三界之顶。满中诸佛。与大弟子眷属围绕。或有诸佛。飞腾虚空。身上出水。身下出火。身下出水。身上出火。东踊西没。西踊东没。南踊北没。北踊南没。中踊边没。边踊中没。或现大身。满虚空中。大复现小。如芥子许。变现自在。随意无碍。</strong></p><p> 或见诸声闻。入四大定。身如火聚。诸火焰端。犹如金筒。盛众色水。】</p><p> 注意，这一段，修持到这里，真正见到十方三世诸佛。然后你可以证明，一切诸佛在人世间看到涅槃了，（其实）都在，只有你自己修持到这里，气分相接，真正见到……还是风大气息的问题，要气分相接。我们现在是凡夫的气息、气分，都是五浊的浊气，这个时候拿中国文化一句话，完全是清气，这个清不是普通的清，气分相接。</p><p> 那么同时，也可以真正见到过去一切诸佛前面的这些声闻众大阿罗汉，如目犍连、如舍利弗、如须菩提，都在。也见到他们“四大定身”，定中之身，“身如火聚”，一片火光。所以密宗很重视拙火定，其实，你到那里，就是定境中一片……。所以，得定得道的，他全身的温度、暖气都不同，甚至你坐在他的身边，都有热气的感受。其实他也是肉体的凡夫，哈，你摸摸他，身体上也许是冰凉的，可是他的热气就来了。四大“身如火聚”。</p><p> 在定境中的人看得定的人，看得很清楚，他浑身都是火焰一样的光明，“犹如金筒”一样，电力……等于我们街上看到那个铁工厂里焊电的那个火花都在爆。</p><p> 这些是讲修持真实的境界，不大愿意讲，讲了以后一般人很容易著相。可是，工夫到这里，不能说没有相，硬是定相就是定相，这要注意。</p><p> <strong>【复见己身。如彼入定。尔时当教行者。而作是言。汝所见者。虽是多佛及诸声闻。汝今应观此诸世尊。是无相身。是大解脱。是无学果。应当善摄汝心。如前数息。此数息法。有十六科。不可具说。】</strong></p><p> 好。他说，一个行者，就是你修行的人，到这个程度了，这不是怕着魔不着魔，这是怕你智慧不够，要智慧的理解。就是我们本师释迦牟尼佛、阿弥陀佛亲自来前面，就是：请吧，你回去吧，你是你的佛，我还没成呢。成佛还是靠自己，所以要靠慧解脱。要晓得，这一种所见的佛、圣贤境界，都是他的化身，也同我们自己修成功的化身一样，不足为数。我们自己还要修到真法身、报身的成就。</p><p> 所以，这个时候告诉我们，见到一切佛及诸声闻“汝今应观此诸世尊，是无相身”，真正的法身是无相的，这个有相可见还不是，都是化身。“是大解脱”身。</p><p> 这些声闻到四果罗汉是“无学果”，不著相的，所以不被境界所骗；这个境界是真的哦，但是不被所骗。等于说，一个真修行的人，到了我们十一楼这个场合，看到那么多人，看也不看，等于一个人都没有看见，不管，各修各的。就是灵山一会，俨然摆在你面前，理都不理——不是傲慢，因为那是释迦牟尼佛的佛，不是我的佛啊，我还没有成佛，没有用的。所以，视若不见。</p><p> 那么他说，这个时候赶快回转来，色身还是心息相依，走数息法。数息法有“十六科”目、十六层，“不可具说”，详细说不完。实际上，《摩诃止观》，天台宗智者大师把数息法门的后来十几步工夫与教理配合的都讲完了，《摩诃止观》。可惜，我们在中国现在一般学佛的，这些真正的佛学，修持教理的真正理论、概论，统统没有看。</p><p> 所以，修持也搞得莫名其妙，拿到一本《六妙门》，妙不可“盐”了，妙不可“酱油”了。然后也看不进去，不晓得“一数二随，三数四随”，不晓得怎么数、怎么随、怎么止。</p><p> 然后，所以的人都叫人家数息观、数息观，坐在那里做瞌睡，只有打瞌睡的时候，鼻子“呼呼”地才听得清楚，就把那个打瞌睡的呼吸数了一辈子，你说那是干什么定？这不是糟蹋自己一生吗？！</p><p> 实际上，真懂了一数、二随、三止、四观、五还、六净的六妙门道理，一念之间就做到。由数上来，一定马上随了，真随，气息保持在内，随气息转动的时候，既不散乱也不昏沉，一念之间就做到了。唉，所以啊，慨叹世无明师啊！害死了千千万万的修持人，瞎摸了一辈子，一无所成！所以，善知识的出世是难遇难得，其理由就在此。诸位，这本书就是大善知识在你前面，要好好照此修持。现在数息观，最后还没有讲完。</p><p> <strong>【尔时行者。既数息已。心意恬泊。寂然无见。复当更教。观心莲华。犹如华树。树上有果。如摩尼珠。现六种光。其光明显。从三界顶。照于下方金刚地际。见心华树。荄垂欲绝。然深无量。】</strong></p><p> 好。这个时候才真见到自心、自心的境界。所以由此，如果我们强调来说——大家注意，大家都晓得学禅宗，“释迦拈花，迦叶微笑”，捏花不是随便笑的哦。所以只有迦叶尊者能继承这个衣钵，他是修十二头陀行的，真修持的，这个时候，你真可以说是花开见佛，才可以……，讲理论……怎么拈花……这个时候你看，心花啊……由最后这一步的数息，“心意恬泊”，这个“泊”字不是竖心旁，三点水，这个心意完全宁静了，止水澄波。“寂然无见”，一切境界，身心内外完全空了。这个时候再观心，进一步观，所谓“心莲华”，整个身体像一棵“华树”，像莲花，心像莲花子开花了，打开了。那么，看到了实际的境界，所谓“心花怒放”，拿中文一句形容词就是心花怒放；心脏的气脉也开了，所谓“脉解心开”了。那么，才可以谈到真正的禅定、禅修的境界。下面，有更重要的问题来。</p><p> <strong>【尔时当观诸佛法身。诸佛法身者。因色身有。色身者譬如金瓶。法身者如摩尼珠。】</strong></p><p> 好。现在这句话，大家看了如何感想？“尔时当观”，进一步要见法身了，他说“诸佛法身者，因色身有”，别的经典上没有（这样）说到吧？而且同别的经典完全等于两样了，那这样讲起来，法身还靠肉身生出来？法身无相，怎么靠肉身生出来？大话头来了。“诸佛法身者，因色身有。色身者譬如金瓶，法身者如摩尼珠”，这是讲什么话？你不要随便看过去哦，这里是大问题来了。</p><p> 我们晓得法身无相，一念一空……照显教的道理、密教的道理，密宗也一样呀，一念一空了，清净一念，这就是法身来了。我不是常常告诉你们，不要随便错认了。</p><p> 你身体健康，还不错，打坐六七天，然后，身体也很健康，肠胃也通利，也无病无痛，然后一念很清净，你认为这个清净念是法身啊？这是第六意识的境界。如果这个就是法身，你身体一病了、一感冒了以后，你看你清净不？就不清净喽，那你的法身不是掉了，对不对？你这个法身境界是因色身而有啊，那还靠得住？那我四大死了以后，这个法身的清净到哪里去了？第一个道理。</p><p> 第二，如果真法身（是）无相法身，由有而归无，由空而生有，由有而归无，还是因色身而有哦。所以，这个肉体四大没有坏以前，赶快修持哦！年纪大了，一身是病了，再想修持要先祛病，祛了病才能够证道、证法身。年纪轻轻的，再糟蹋了自己的身体，一天在烦恼、欲念里缠缚下去，何苦自己骗自己呢？千万注意哦！这个字要拿出来，两句话要贴在额头上，顶在头上去哦。</p><p> “诸佛法身者，因色身有”，你要修成真正的不生、不灭法身，趁四大色身还在，好好修持哦。所以，上面的白骨观、四大观，一路下来，一套法门，叫你直接修证果的法。</p><p> 现在身体还在，年纪到了，老病死快要来了，色身……，觉得还在世间如环无端，轮回中滚来滚去，没有希望了；除非死了再来一生，再来生能不能变人还不知道呢。“诸佛法身者，因色身有。”</p><p> 但是，修到这一步工夫的人，“色身者譬如金瓶”，金子打的宝瓶了，所以密宗也讲宝瓶气，瑜伽术也讲瓶气。“法身者如摩尼珠”，这个瓶子里装着一个如意宝珠，什么叫摩尼宝珠？世界上有没有摩尼宝珠不知道，佛经上提到过，谁也没有看到过。如意珠，这颗珠，四方八面，随便你站在哪个角度看，各人色相不同、形状也不同。但是，它能使人万事如意，要啥有啥。你冬天要棉被有棉被，要夹克有夹克，这颗珠在你手里就有这样厉害。所以，它是有形象也无形象。我们的色身犹如金瓶里装了一颗摩尼珠、如意宝珠。</p><p> 所以，禅宗祖师也讲，临济、云门都讲，人人有一无畏真人，无价的宝珠，就在你色身以内，你找不出来。你看，普通一般禅宗，不讲修持，大家看不懂那个语录啊，它把工夫都含在里头了。</p><p> 所以，我经常告诉你们夹山的法语“龙含海珠，游鱼不顾”啊，那都是讲实际的工夫啊。什么“猿抱子归青嶂里，鸟衔华落碧岩前”，都讲实际的工夫啊，随便哪一点都讲实际的工夫啊。现在研究禅学的，都把它当文学境界看了，那还有禅啊？那是实际工夫的文学句子的形容词啊。</p><p> 这里也有很多文学，虽然他是正面讲，“法身者，因色身有。色身者譬如金瓶，法身者如摩尼珠。”文学不好啊？也好得很，都给你讲清楚了。所以，这个时候，在色身以内观法身，工夫到了，理也要到，事理要圆融。我们再看下去。</p><p> <strong>【应当谛观色身之内。十力。四无所畏。十八不共法。大慈大悲。无碍解脱。神智无量。绝妙境界。非眼所见。非心所念。一切诸法。无来无去。不住不坏。同如实际。】</strong></p><p> 好。你看，这个（跟）普通一般经典讲的不同吧，大乘经典也都说了这个理。在这个修持的经典里，理跟事是配合的。</p><p> 他说，你到了这个时候，修持到了身心差不多该了（liao3）的阶段，了(liao3)并不是没有了，都成就的阶段。你观这个肉体色身以内，所谓佛所具备的，成佛的“十力，四无所畏，十八不共法，大慈大悲，无碍解脱”都具备了，自己本身都具备了，所以我即是佛了。</p><p> 那么，他有个道理告诉你，“神智无量”，每个字都不能放过哦，已经到达了神化的境界。那个神化的智慧，你摸不到顶的，我们不知道，一到他那里就知道，它怎么来的……神化的境界。变化的化，不是讲话的话，不是神话，是神化，变化的化，到了神而化之的境界，“神智无量。”“绝妙境界”，你想象不到的，哎，“非眼所见。”</p><p> 你看，禅宗祖师夹山也提过，“目前无法，意在目前，不是目前法，非耳目之所到。”你们听了禅宗，笑笑，都以为懂得了：嘿嘿，“正合孤意”，正合我意，我也是这样啊，“目前无法”，眼睛睁开，一点佛法都没有；“意在目前”，不过我也想哦——也可以那么解啊；“不是目前法”，什么都不要，“非耳目之所到”，你们不懂——也可以那么解啊，这就叫禅了？那还叫禅？</p><p> “非眼所见，非心所念”，不是你心理上所想象的那个境界。</p><p>  “一切诸法，无来无去，不住不坏”，不生不灭，亲证到“如同实际”，本来如此，“本来无一物，何处惹尘埃。”要修证到。再继续下去。</p><p> <strong>【凡夫愚痴。为老死大贼之所追逐。妄见颠倒。以颠倒故。堕落三涂。爱欲河中。为驶水所漂。没溺三界。</strong></p><p> 我今云何。同凡夫行。妄想见佛。我大和上释迦牟尼佛。往昔之时。头目髓脑。国城妻子。持用布施。百千苦行。求解脱法。今者已得超越生死。住大涅槃。寂灭究竟。更不复生。如过去佛法。住常乐处。亦无去来。现在诸智。身心不动。恬泊无为。如此智慧。所成就身。当有何想。云何变动。我今见者。从妄想现。属诸因缘。故是颠倒色相之法。</p><p> 作是思惟时。一切诸佛及诸贤圣。寂然隐身。更不复现。唯一佛在。有四大弟子。以为侍者。】</p><p> 到这个境界，你看，再不要你念个什么“嗡啊吽”退个魔境界，没有这回事，理上参透了，这些境界都没有了。或者，只有本师释迦牟尼佛在你前面。</p><p> <strong>【尔时。释迦牟尼世尊。为于行者。更说四大清净观法。告言法子。过去三世诸贤圣等。观此行时。自然皆观风大观法。</strong></p><p> 观风大者。先观身内。从心华树。生一微风。】</p><p> 又是观气，修气的方法。</p><p> <strong>【如是微风。渐渐增长。遍满身体。满身体已。从毛孔出。满一房内。满一房已。见此微风。满一庭内。满一庭已。复见渐渐满一顷地。满一顷已。复更增广。满一由旬。满一由旬已。满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。如此渐渐广大。满十由旬。微风才动。渐渐广大。遍满三千大千世界。上至于顶。下至金刚际。遍此诸处已。还从顶入。令其心树一切华叶。渐渐萎落。自见己身。如颇梨镜。表里映彻。】</strong></p><p> 注意啊，又告诉你，到这一步，工夫修到这一步，再修气，这一步修气又不同喽。再不是“一数二随，三数四随”了，就是定中观气扩张、充满了，一步一步的扩充。那么，我们随便拿个比方做一句解释，比方啊，也等于孟子所说的，“浩然之气”，“充塞于天地之间”，孟子讲的那个话是理论上的话，这里讲实际气充满整个的……这个风就是气哦。</p><p> 这个气是什么所生呢？念力所观想，心气合一了。这个时候，所以佛经上说，菩萨修持到此境界，能够回向众生，能够沾露众生，就是他在这里一坐，他如果在这个境界里头，我们所有在座的，或者接触到他这个气分的人，马上就得安详、得平安、得安乐，因为他修持成就的……。所谓这个气也等于现在讲：他放射这个能、能量，充满了一切。再经过这个修持，修了以后，风、水、地大还再来，还要再修过。下面继续。</p><p> <strong>【尔时。复当教观水大。观水大者。先观身内心华树端。出一微水。如琉璃气。渐渐增广。似白色云。遍满身内。满身内已。从六根出。顶上涌出。绕身七匝。如白云行。滴滴雨水。其水柔软。盈满一床。满一床已。渐渐广大。满一房内。满一房已。满一庭中。满一庭已。满一城中。满一城已。满十顷地。满十顷已。满百顷地。满百顷已。满一由旬。水色正白。如白琉璃光。其气微细。过于凡夫眼根境界。渐渐广大。满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满十由旬。满十由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。满一阎浮提。满一阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。如是水相。其气如云。还从顶入。】</strong></p><p> 先休息。</p></div>"
},{
    "title": "禅秘要法讲座 24",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p><strong>【见此事已。复更教观火大。观火大者。自观身内心华树端。诸华叶间。有微细火。犹如金光。从心端出。遍满身内。从毛孔出。渐渐广大。遍满一床。满一床已。满一房内。满一房已。渐渐广大。满一庭中。满一庭已。满一城中。满一城已。满十顷地。满十顷地已。满百顷地。满百顷地已。满一由旬。火色变白。如真珠光。更复鲜白。颇梨雪山不得为比。红光照错。以成文章。渐渐广大。满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。</strong></p><p><strong> 见此事已。复当更教观于地大。观地大者。自见身内。心树诸华。渐渐广大。如金刚云。遍满身内。满身内已。复满一床。满一床已。遍满一房。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满十顷。满十顷已。遍满百顷。满百顷已。满一由旬。满一由旬已。其色变青。渐渐广大。遍满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。</strong></p><p><strong> 见此事已。复当更教还观地大。观此地大。如金刚云。难可摧碎。当云何灭。作此观时。见佛世尊释迦牟尼。坐金刚座。与尊弟子。眷属五百。坐行者前。异口同音。赞叹灭谛。闻此语已。当观地大。从因缘起。无明所持。无明无性。痴爱无主。虚伪因缘。假名无明。爱取有等。皆属此相。作此思惟时。见自心内。众华树端。渐渐火起。烧金刚云。一一云于诸叶间。与火合体。遍满身内。</strong></p><p><strong> 满身内已。地火俱动。遍满一床。满一床已。遍满一房。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满十顷。满十顷已。遍满百顷。满百顷已。满一由旬。满一由旬已。满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。遍满阎浮提。地火二大。其性各异。更相鼓动。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。</strong></p><p><strong> 见此事已。复当更教观于风大。观风大者。自观身内。心华树间。出紫色风。水大随入。灭此风色。同为水色。风动水涌。遍满身内。渐渐广大。遍满一床。满一床已。满一房内。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满一由旬。满一由旬已。风水二性。其性各异。风吹此水。如琉璃沫。其色焰炽。更相鼓动。遍满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。遍满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。</strong></p><p><strong> 见此事已。自见己身。身诸毛孔。一切火起。此火光炎。遍满三界。出三界外。如真金华。华上有果。果叶相次。彼果光中。演说四谛。及十二因缘。度生死法。复见身内。一切水起。其水温润。从毛孔出。流布三界。无不遍满。水色出光。照三界顶。入火光果中。复见身内。一切风起。遍满身内。从毛孔出。渐渐广大。驶速飘疾。遍满三界。化为金云。入火光果中。复有地气。极为微薄。弥满四大。</strong></p><p><strong> 见此事已。复当更教谛观五阴。观于色阴。此色阴者。依地大有。地大不定。从无明生。无明因缘。妄见名色。观此色相。虚伪不真。亦无生处。假因缘现。因缘性空。色阴亦然。受想行识。性相皆空。中无坚实。观此五阴。实无因缘。亦无受有。如此四大。云何增长遍满三界。</strong></p><p><strong> 作此思惟时。见一切火。从一切毛孔出。遍满三界。还从一切毛孔入。复见一切地大。犹如金刚云。从一切毛孔出。遍满三界。还从一切毛孔入。复见水大。犹如微尘。从一切毛孔出。遍满三界。还从一切毛孔入。复见风大。其势羸劣。从一切毛孔出。遍满三界。还从一切毛孔入。如是四大。从毛孔出。从毛孔入。往复反覆。经八百遍。</strong></p><p><strong> 见此事已。如前数息已。闭气而住。经一七日。尔时自然见此大地渐渐空。见一床下渐渐空。见一房渐渐空。见一房已。见一庭地渐渐空。见一庭已。见一城地渐渐空。见一城已。见十顷地渐渐空。见十顷已。见百顷地渐渐空。见百顷已。见一由旬地渐渐空。见一由旬已。见二由旬地渐渐空。见二由旬已。见三由旬地渐渐空。见三由旬已。见四由旬地渐渐空。见四由旬已。见五由旬地渐渐空。见五由旬已。乃至见十由旬地渐渐空。见十由旬已。乃至见百由旬地渐渐空。见百由旬已。乃至见阎浮提八千由旬地渐渐空。见阎浮提已。见弗婆提地十千由旬渐渐空。见弗婆提已。见瞿耶尼地三万由旬渐渐空。见瞿耶尼已。见郁单越地四万由旬渐渐空。见郁单越已。见须弥山四大海水山河石壁四天下中一切所有见坚鞕物。一切悉皆渐渐空。见四天下已。心遂广大。遍满三千大千世界。诸坚鞕物。大地山河石壁。一切悉空。心无所寄。</strong></p><p><strong> 尔时自然见金刚际。有十四金刚轮。从金刚轮下。自然上踊。更相掁触。至行者前。尔时心树诸妙花端。自然火起。烧诸华叶树上四果。堕行者顶。从顶而入。住于心中。尔时此心。豁然明了。见障外事。复有六象。其正色黑。踏大地坏。吸饮诸水。风吹象杀。象耳出火。烧象都尽。四大毒蛇。走上树端。见有一人。似大力士。拔此大树。下至金刚际。上至三界顶。令树动摇。行者心中。四明珠果。复出大火。烧树荄绝。是时大树。散如微尘。</strong></p><p><strong> 行者见已。我今观于水火风等及与水大。一切无常。须臾变灭。当自观我身内四大。火起无穷。地水风等亦复如是。此无明相。空无所有。假伪颠倒。犹如霜炎。属于三界。缘于痴爱。三十三亿念生法。九百九十转。次第念粗相。结使九十有八。枝条种子。弥覆三界。为是众结。受生无数。或堕地狱。猛火焚身。或为饿鬼。吞饮融铜。啖热铁丸。百千世中。不闻水谷。或为畜生。驼驴猪狗。数不可知。人中受苦。众难非一。如是众多。从痴爱得。今观痴爱。性无所有。</strong></p><p><strong> 作是思惟时。释迦牟尼佛。放金色光。与诸声闻眷属围绕。告行者言。汝今知不。色相虚寂。受想行识。亦复如是。汝今应当谛观空。无相。无作。无愿三昧。</strong></p><p><strong> 空三昧者。观色色性。及一切诸法。空无所有。如是众空。名空三昧。</strong></p><p><strong> 无愿三昧者。观涅槃性。寂灭无相。观生死相。悉同如实际。作此观时。不愿生死。不乐涅槃。观生死本际空寂。观涅槃性相皆同入空。无有和合。是名无愿三昧。</strong></p><p><strong> 无作三昧者。不见心。不见身及诸威仪。有所修作。不见涅槃有起性相。但见灭谛。通达空无所有。</strong></p><p><strong> 尔时行者。闻佛世尊。说是空无相无愿三昧。身心静寂。游三空门。犹如壮士屈申臂顷。应声即得超越九十亿生死洞然之结。成阿罗汉。不受后有。梵行已立。知如道真。豁然意解。无复余习。漏尽慧通。自然而得。其余五通。要假修得六通义。广说如阿毗昙。</strong></p><p><strong> </strong>……佛所吩咐的话，今天先提前。下一次再补好这个四大观，整个就完毕了。卷四第十七页：</p><p><strong>【尔时世尊。为阿祇达。说是贤圣空相应心。境界分别十一切入相已。默然安隐。入无诤三昧。放众色光。普照世界。是时会中。二百五十比丘。心意开解。成阿罗汉。五十优婆塞。破二十亿洞然结。成须陀洹。天人大众。闻佛所说。皆大欢喜。】</strong></p><p><strong> </strong>这一段就是——佛传了这个法门的修法，由白骨观一直到四大观、数息观，成就证果的这个境界。就是说，这个时候，当场有“二百五十比丘，心意开解。”所以，禅宗的开悟，第一步也就是“心意开解”，连心脉，心脏的脉都打开了，就证得阿罗汉。</p><p>有“五十优婆塞”居士，破掉了二十亿劫来的心理结使，贪、嗔、痴、慢、疑，所以证得初果罗汉须陀洹果——这个法门之重要。</p><p>佛在这个时候讲完了，他闭着嘴，一声都不响了，定在那里。那么，又引起阿难来问话。</p><p><strong>【尔时长老阿难。即从坐起。白佛言。世尊。如来初为迦絺罗难陀说不净门。为禅难提比丘说数息法。为阿祇达说四大观。如是众多微妙法门。云何受持。当以何名。宣示后世。】</strong></p><p><strong> </strong>你看我们这位阿难尊者，这位老师父多慈悲啊，他都替我们后世人想过，他说：你讲了那么多法门，后来人怎么办？修哪个法门啊？大概他当时也有这个苦恼，听得太多了，天天听，那么多，你叫我走哪一条路啊？就是这个话。</p><p><strong>【佛告阿难。此经名禅法秘要。亦名白骨观门。亦名次第九想。亦名杂想观法。亦名阿那般那方便。亦名次第四果想。亦名分别境界。如是受持。慎勿忘失。</strong></p><p><strong> </strong><strong>佛告阿难。我灭度后。若有比丘比丘尼。式叉摩尼。沙弥沙弥尼。优婆塞优婆夷。若有欲学三世佛法。断生死种。度烦恼河。竭生死海。灭爱种子。断诸使流。厌五欲乐。乐涅槃者。当学是观。】</strong></p><p>注意啊，真正要学佛法，只有走这一条路，佛说：你真正要修法，只有走这一条路。</p><p><strong>【此观功德。如须弥山。流出众光。照四天下。行此观者。具沙门果。亦复如是。</strong></p><p><strong> </strong>佛告阿难。佛灭度后。若有比丘比丘尼。优婆塞优婆夷。欲学此法者。当离四种恶。何等为四。一者净持禁戒。威仪不犯。于五众戒。若有所犯。应当至心。忏悔清净。戒清净已。名庄严梵行。】</p><p>第一，要修戒，戒律清净，修这个法门容易成就。</p><p><strong>【二者远离愦闹。独处闲静。系念一处。乐少语法。修行甚深十二头陀。心无疲厌。如救头然。】</strong></p><p><strong> </strong>第二，要修迦叶尊者的头陀行，日中一食等等。头陀行，我们在大乘学舍已经讲过的。就是说，要真正走修行的路子，完全要自己专修。</p><p><strong>【三者扫偷婆涂地。施杨枝净筹。及诸苦役。以除障罪。】</strong></p><p><strong> </strong>第三点，要修行的人要为大众服务，居丛林下，多为大众服务，不要希望别人替你服务。乃至扫茅厕，古代的厕所脏啊……就是说，你多替大众服务，自己劳其筋骨，饿其体肤，修苦行。</p><p><strong>【四者昼夜六时。常坐不卧。不乐睡眠。身倚侧者。乐常冢间。树下。阿练若处。食若鹿食。死若鹿死。若有四众。行此四法者。当知此人。是苦行人。如此苦行。不久必得四沙门果。】</strong></p><p><strong> </strong>第四种，就是说，修头陀行的，肋不至席，两边肋骨没有靠到床上，都在修禅定，“常坐不卧”。“食若鹿食”，就是草食，吃菜，简单明了，饮食都明了。</p><p>他说，四众弟子，能够依这四个基本的行为修白骨观一路下来这个法门，“当知此人，是苦行”，修行本来是修苦行哦。说：我打坐比一切世法都乐。当然，你打打坐……在社会上忙碌了以后，打一下坐是舒服嘛，贪图舒服修修不成哦！这完全是修苦行，对自己要求……</p><p>所谓苦行者，在行为上、心理思想上、在身体上，没有哪一点对自己不要求严格的，一切都可以宽恕别人，绝不能宽恕自己，这就是真苦行。</p><p>“如此苦行，不久必得四沙门果。”以此苦行专修下去，很短的时间可以证四果。四种沙门果就是四果罗汉。要注意，所以，这是真讲修行的。这一段是佛的遗嘱，吩咐的话。</p><p>所以，你们大家学佛，贪图那个享受，“哎，这是最舒服的。”舒服有什么用呀？没有用——修成功了当然得极乐，那是永远纯苦无乐。不要贪图目前生活上的这一点舒服，耽误了前途哦。</p><p><strong>【佛告阿难。若有四众修系念法。乃至观见脚指端手指端一节少分白骨相。极令明了。若见一指。若见一爪。一切诸白骨。当知此人。以心利故。命终之后。必定得生兜率陀天。灭三恶道。一切苦患。虽未解脱。不堕恶道。】</strong></p><p><strong> </strong>注意啊，佛的话，本师释迦牟尼佛的话：修白骨法的人，只要你真正修持，乃至观得起来一个指头的白骨，一指爪之一节，还不是整个修得好，心能专一修持，只要一节观得成功的人，“当知此人”已经进入了利根根器的范围里去。</p><p>就是这一生，死了以后必定生弥勒内院，跟弥勒菩萨学。“灭三恶道”，不会向畜生、地狱、恶鬼里头转了。“一切苦患”，灭除三恶道的一切苦患，必定能够见到弥勒佛；再跟佛下来，一修就成了。</p><p>“虽未解脱，不堕恶道”，这个法门，只要一节能够观得起来，有此大利，一本万利的法门哦。这一生虽然得不到……还没有得解脱，证阿罗汉道，但是不会堕落在三恶道中。再念下去。</p><p><strong>【当知此人。功德不灭。已得免离三涂苦难。何况具足诸白骨人。】</strong></p><p><strong> </strong>何况你全身观得起来，定得住。</p><p><strong>【见此骨人者。虽未解脱无漏功德。当知此人。已免一切三涂八难苦厄之患。当知此人。世世所生不离见佛。于未来世。值遇弥勒。龙华初会。必先闻法。得证解脱。】</strong></p><p><strong> </strong>将来弥勒菩萨第一次说法，所谓龙华会上——佛在灵山会上。以后，弥勒佛第一次说法是在龙华会上，你马上证果。</p><p>阿弥陀佛那个路途遥远啊，那个飞机票买得更贵了，极乐世界……。兜率天近一点，白骨观，一拿到指头这个出境证就去了，（此）法就有这么大利……。</p><p><strong>【佛告阿难。若有比丘比丘尼。优婆塞优婆夷。于佛法中。为利养故。贪求无厌。为好名闻。而假伪作恶。实不坐禅。身口放逸。行放逸行。贪利养故。自言坐禅。如此比丘。犯偷兰遮。过时不说。不自改悔。经须臾间。即犯十三僧残。若经一日。至于二日。当知此比丘。是天人中贼。罗刹魁脍。必堕恶道。犯大重罪。</strong></p><p><strong> 若比丘尼。妖冶邪媚。欲求利养。如猫伺鼠。贪求无厌。实不坐禅。自言坐禅。身口放逸。行放逸行。贪利养故。自言坐禅。如此比丘尼。犯偷兰遮。过时不说。不自改悔。经须臾间。即犯十三僧残。若经一日。至于二日。当知此比丘尼。是天人中贼。罗刹魁脍。必堕恶道。犯大重罪。</strong></p><p><strong> 若比丘比丘尼。实不见白骨。自言见白骨。乃至阿那般那。是比丘比丘尼。诳惑诸天龙鬼神等。欺世间人。此恶人辈。是波旬种。为妄语故。自说言我得不净观。乃至顶法。此妄语人。命终之后。疾于雹雨。必定当堕阿鼻地狱。寿命一劫。从地狱出。堕饿鬼中。八千岁中。啖热铁丸。从饿鬼出。堕畜生中。生恒负重。死复剥皮。经五百身。】</strong></p><p><strong> </strong>注意这一节。他说，真正学佛出家就要严重，这就是戒哦。出家的目的是修持，包括居士们，真正学佛的目的是修持，要证得禅定，才能戒、定、禅。不是这样做的，自欺欺人，所得的果报如何，经典（里）佛亲自告诉你，明明白白。</p><p>所以要大家特别注意！尤其在家的年轻居士，不要轻易随便谈学佛、学打坐，好玩一样，求长生不老、祛病延年，不是这回事哦。</p><p>现在都是经文在这里，明明白白，特别告诉大家啊。不是我说的哦，是佛说的，我不过是替大家帮忙你们读书，特别提起你们注意。</p><p>所以他说，这样自欺欺人的比丘尼等，女性出家的，堕了地狱以后，“寿命一劫”，地狱里住一劫哦。“从地狱出”，还要堕在饿鬼中，“八千岁中”，八千年，“啖”、吃热铁丸。“从饿鬼出”，还要变畜生道，畜生道，一生都做牛、做马，替人家背重物，做劳力，死后还要剥皮抽筋。</p><p>“经五百身”，你看，地狱一劫后还要堕饿鬼，饿鬼以后还要堕畜生，下三道都经过，再经五百生，变成人，变成人还五官不全，头脑不清。念下去。</p><p><strong>【还生人中。聋盲喑哑。癃残百病。以为衣服。如是经苦。不可具说。</strong><strong> 若优婆塞。实不坐禅。】</strong></p><p><strong> </strong>注意啊，“优婆塞”就是学佛的居士们，年轻人注意。</p><p><strong>【自言坐禅。实不梵行。自言梵行。是优婆塞。得失意罪。不净有作不起。堕落臭旃陀罗。与恶为伴。是朽败种。不生善芽。贪利养故。多求无厌。经于一日。乃至五日。犯大妄语。此大恶人。波旬所使。是旃陀罗屠儿。罗刹同类。必定当堕三恶道中。】</strong></p><p><strong> </strong>我经常看到现在社会上，哎呦，东一个、西一个，都是自己有成就了的居士；学佛的都自己号称了不起，功夫怎么样，看看啊……注意，这是我们本师释迦牟尼佛说的哦。</p><p>就是有所成就了的人，不会讲自己有所成就。我们普通的话，“学问深时义气平”，一个学问到了的人都非常谦虚，只有半罐水的人才自吹自擂。</p><p>现在你看，东一个又是“大师”，西一个又是“不得了”，我们看了佛法，是真怕！怕得不得了！不是那么简单！那除非佛靠不住，佛靠不住，我们何必学佛啊！？他说的句句真话，你们注意啊。</p><p><strong>【此优婆塞。欲命终时。十八地狱。火车炉炭。变化恶事。一时迎之。必定当堕三恶趣中。无有疑也。</strong></p><p><strong> </strong>若优婆塞。实不得不净观。乃至暖法。于大众中。起增上慢。唱如是言。】</p><p>注意啊，居士们修这个修定的法门，自己有了一点工夫，白骨观也做起，能够坐好久，然后呢，还得到暖法了，所谓密宗讲的拙火也生起了。然后，为人之师，“啊，我是不得了！”毁谤别人，“这些人都不行！”好为人师，起增上慢，你看他的果报……</p><p><strong>【我得不净观。乃至暖法。当知此优婆塞。是天人中贼。欺诳世间天龙八部。此优婆塞。命终之后。疾于雹雨。必定当堕阿鼻地狱。满一大劫。地狱寿尽。生饿鬼中。经八千岁。啖热铁丸。从饿鬼出。堕畜生中。生恒负重。死复剥皮。经五百身。还生人中。聋盲喑哑。癃残百病。以为衣服。如是经苦。不可具说。】</strong></p><p><strong> </strong>注意，所以，为什么佛最后重复地告诉我们，第一，佛法的中心（是）禅定，有定才有戒、才有慧，才有真正佛法驻世。你看，佛千二百五十弟子，八百罗汉，一切都在禅定中，这是佛法的……。所以，佛法末法了，这个中心没有了，就很严重。</p><p>到了真正末法时代，没有修持的人，都想当“善知识”了，都不得了……。所以，你们诸位叫我老师，是你们的客气话，我几时承认过是你们老师？你们行礼，我说请坐；你们说（老师）……（我说）老兄，如何——不敢啊！一个真正学佛的不敢啊。</p><p>你就是得了道也不能骄慢，何况我们没有得，这个了不起、那个了不起，我都是亲眼看到果报现前——自己不知道。佛法是处处建立在因果上的。</p><p>所以，禅定修持是这样的重要！不修持的过患有如此严重！在家居士们，男人、女人要学佛，这是第一大诚实的事，要诚诚实实，规规矩矩，老实修持，不是开玩笑的。</p><p>这个要学禅、那个要学禅，你看，多少都搞疯了的！搞疯了如何啊？都是前生累世有一点点打坐修持的，这一生一转来变成什么？“癃残百病”，什么叫“癃”？（病首里基隆的隆……）“聋盲喑哑”，不是头脑昏昏的，就是眼睛瞎了，精神不健全。“癃”就是脑子不健全，笨笨的；“残”残废。“聋盲喑哑”，是这个果报哦。</p><p>现在的病症就是神经、精神分裂啊。这个人为什么果报会变精神分裂，会得神经？你看，有得神经、精神分裂的人，多半还在讲修道啊、学佛啊，搞宗教啊，不管哪个宗教，基督教、天主教、佛教，而且都是神经兮兮的——那个兮兮就兮不得呀，兮兮就“吸”下去喽。</p><p>所以，我常常讲你们青年人，来搞这个干什么？为什么学佛？我讲你们好好先学做人。并不是拒绝你们，为你们好啊，叫你们先把儒家的书读好，把人做好；人的基础不打稳，来学佛打坐，我看到十个有五双最后都没有好结果的。至少我看了几十年了，看得很清楚啊。</p><p>现在，把佛的话再三提……这都不是我说的啊，这本书不是我编的，都看到了，佛很严重地告诉你。所以，修要真修，证要实证，不要妄自欺人、欺世，这不得了的！</p><p>普通的教育，把人家教不好了，自己的果报都是后世不昌，普通当教育为人师的；何况出世法，引导人的，修道，做出世之师谈何容易，那不得了的啊！</p><p>所以，最后的结论要你们特别注意，尤其年轻的同学们，特别要注意这些！不要跑来晃一晃，学佛啊，读佛学啊，搞些什么名堂！？</p><p>不相信，将来你变到哪里，我叫你，你还答应不出来呢！还不像《高僧传》上的那一位法师，你看，变了牛了，他是师兄晓得果报到了……——五台山上两位法师，《高僧传》里有，《历代佛祖通载》，叫什么，你们哪一位记得？</p><p>结果嘛，另外这个师弟还在，这个师兄修行不得力，堕落到南方苏州去变牛了。结果，另外一个和尚要下山到南方去，这个师兄说：我有一封信给你带去，你某年、某月、哪一天，你到苏州的一个地方过，在什么地方你会碰到一个人拉一条牛来，你看到那一条牛，你就拿着我的信叫他的名字，“某某法师！”然后他就会知道，你把信给他。</p><p>结果，这个和尚觉得很奇怪，带信就带信……结果到那，果然碰到，他一叫，那个牛掉眼泪了，那么他说：“师兄，时间到了。”把信给他。诶，那个牛就站在那里涅槃了——除非你还有这个本事，可是，他还是要来（受）过这个果报哦。</p><p>所以，吹牛吹牛，吹不得牛啊！呵，除非你不信佛法。所以特别告诉你们注意啊。</p><p><strong>【若优婆夷。】</strong></p><p><strong> </strong>“优婆夷”，女居士们，女同学们，你们的事了，轮到你们了。</p><p><strong>【显异惑众。实非坐禅。谓言坐禅。此优婆夷。得失意罪。垢结不净不起。堕落不净。有作臭旃陀罗。此优婆夷。与恶为伴。是魔眷属。必定当堕三恶趣中。是优婆夷。过时不说。不自改悔。经须臾间。一日乃至五日。是优婆夷。贪求无厌。实非梵行。自言梵行。实非坐禅。自言坐禅。此大恶人。必定当堕三恶趣中。随业受生。</strong></p><p><strong> 若优婆夷。实不得不净观。乃至暖法。于大众中。唱如是言。起增上慢。自言我得不净观。乃至暖法。此优婆夷。是天人中贼。命终之后。疾于雹雨。必定当堕阿鼻地狱。满一大劫。地狱寿尽。生饿鬼中。经八千岁。啖热铁丸。从饿鬼出。堕畜生中。生恒负重。死复剥皮。经五百身。还生人中。聋盲喑哑。癃残百病。以为衣服。如是经苦。不可具说。</strong></p><p><strong> 佛告阿难。若比丘比丘尼。优婆塞优婆夷。系念住意。心不散乱。端坐正受。住意一处。闭塞诸根。此人安心。念定力故。虽无境界。舍身他世。生兜率天。值遇弥勒。与弥勒俱下。生阎浮提。龙华初会。最先闻法。悟解脱道。】</strong></p><p><strong> </strong>注意啊，佛再三吩咐，末法时候，不管出家的比丘、比丘尼，男居士、女居士，只要肯修禅定，“系念住意，心不散乱，端坐正受”，就是证佛法的路子，“住意一处”，系心一缘。当然，依佛本经的教化，白骨观、四大观、数息观最好。</p><p>“闭塞诸根”，六根不动，“此人安心”，就是这样——当然，根本就（只）是打坐，还没有真得定。就是这样念念孜孜，一生“念定力故”，虽然没有境界，没有得到禅定，但是，死后绝不下堕！“生兜率天”，弥勒菩萨那里，跟着弥勒菩萨再来到这个世界上。弥勒菩萨第一次说法，龙华会上“最先闻法”，开悟，得解脱道，证果。这都是佛吩咐的，就是你修不成功，（但）真心在修，都有如此的果报！</p><p>除非我们不相信他说，就不要听他的，那这个书根本也不要听，何必浪费时间呢。还有……</p><p><strong>【复次阿难。佛灭度后。浊恶世中。若有比丘比丘尼。优婆塞优婆夷。实修梵行。行十二头陀。庄严身心行。念定修白骨观。观于不净。入深境界。心眼明利。通达禅法。如此四众。为增长佛法故。为法不灭故。】</strong></p><p><strong> </strong>所以说，学禅的修持的重要……末法时代，佛过世以后，这样的四种人在修，“为增长佛法故，为法不灭故。”</p><p>所以，我们老和尚在这里，到台湾来，特别在十一楼办禅堂，就是为这个原理，为佛教，“为增长佛法故，为法不灭故”。希望你们青年好好地修，就是这个道理。</p><p><strong>【当密身口意。犹如有人。遇身心病。良医处方。当服醍醐。尔时病者。则诣国王。求乞醍醐。王慈愍故。即以醍醐。持用赐之。因敕病人。服醍醐法。当于密屋。无风尘处。而取饮之。饮已闭口。调四大气。勿令失度。若比丘比丘尼。服此甘露灌顶药者。唯除知法教授之师。不得妄向他人宣说。】</strong></p><p><strong> </strong>就是你们修得有一点成就，不要去吹牛，好好自修，修成之……。所以，我常告诉你们：哎呀，只怕自己不成佛，不怕没有众生度。注意啊！只怕你不成佛，不怕没有众生度。这里佛告诉你也是这样，闭口不言，老老实实自己修。你看，禅宗的祖师都是四个字，潜修密伏。</p><p><strong>【若向他说。即失境界。亦犯十三僧残之罪。若诸白衣。欲行禅定。得五神通。尚不应向他人宣说。言我得神通。仙咒术。一切宜秘。何况出家受具足戒。若得不净观乃至暖法。不得妄向他人宣说。若向他说。即灭境界。使多众生于佛法中生疑惑心。是故我今于此众中。制诸比丘比丘尼。若得不净观乃至暖法。当密修行。令心明利。唯向智者教授师说。不得广传。向他人说。若向他说。为利养心。应时即犯十三僧残。过时不忏。心无惭愧。亦犯重罪。如上所说。】</strong></p><p><strong> </strong>……很多人都这样，我都看到有几个人都是这样。学了半天，然后去电力公司当电工，爬到电杆上去修……然后一电，电死了，吊在半空中，在基隆……就是同这个道理一样。</p><p>当然，你劝人家，讲给人家听，那你（是）弘法利生。人家问你：“你修到没有？”“我还不行，我是依教奉行，会讲给你们听而已。”——虽然你当然修到了，不修到了怎么讲得出来呢？但是问到你，“我是不会，我还在学，跟你一样。”要这样谦和，所以，真正的佛法是教人谦和。并不是叫你站在那里，哦，人天师表！“裱”个什么？！裱画？真佛法是教你谦和的，这个地方就是教你谦和。</p><p>这是戒律哦，所以佛告诉你，“我今于此众中，制诸比丘”，“制”就是建立这个戒律，佛的戒律制度建立。自己修持到某一步工夫向人宣传是犯戒、破戒。特别注意啊，都是最后一点点吩咐你……这个修法，所以叫《禅秘要法》，密宗的说法也是这样，最后下来，绝对不准你乱来。</p><p><strong>【复次阿难。佛灭度后。现前无佛。四部弟子。】</strong></p><p><strong> </strong>他说，将来我过世了以后，很长的时间没有佛出世，“现前无佛”，就是你们苦恼的时代了，要自己去修喽。</p><p><strong>【求解脱者。得不净观。当密藏秘。勿令他知。譬如有人。贫穷孤独。生浊恶世。属无道王。彼贫穷人。掘地求水。宿世因缘。忽遇伏藏。大获珍宝。怖畏恶王。密藏此宝。不令他知。但于屏处。取此珍宝。以供妻子。密受快乐。佛灭度后。四部弟子。得禅乐者。亦复如是。当密藏之。不得广说。若广说者。犯大重罪。】</strong></p><p><strong> </strong>你看，注意，这都是佛的戒律哦。他说，我过（世）了以后，长夜无佛啊，你们如果碰到了，有这个因缘，得了这个法宝，要好好保存，好好自己修持，譬如穷人得宝，偷偷藏起来，要好好自己修持。</p><p><strong>【复次阿难。譬如长者。独有一子。遇大重病。须眉落尽。尔时长者。内自思惟。我今衰祸。唯此一子。遇此重病。当何处求觅良医。作此语已。大出财宝。募访良医。长者宿福。忽遇一医多知经方。长者白言。唯愿大师。起大慈悲。我有一子。遇患多时。唯愿大师。救疗此患。设得愈病。今我家中。大有财宝。犹如北方毗沙门天王。若子得瘥。唯除我身。一切奉上。不敢违逆。时彼良医。告长者言。汝今能造七重闇室。极令深密。然后可令汝子服药。服此药已。不得见人。不向他说。经四百日。儿乃可瘥。</strong></p><p><strong> 佛告阿难。佛灭度后。佛四部众弟子。若修禅定。求解脱者。如重病人。随良医教。当于静处。若冢间。若林树下。若阿练若处。修行甚深诸贤圣道。当密身口。于内心中修四梵行。修四念处。修四正勤。修四如意足。修五根。修五力。修七觉道。修八圣道分。修四禅。修四无量心。游入甚深无量空三昧门。乃至得六神通。如是种种胜妙功德。但当一心密而行之。慎勿虚妄。于多众前。自说得过人法。若说得过人法。如上所说。必定当堕阿鼻地狱。】</strong></p><p><strong> </strong>乃至，所谓神通的戒律就在这里。他说，我过世以后，你就是证得了神通，都不准……所以，使用神通犯戒。为什么理由？当然有更深一层的理由，但是，佛的戒律……这里都是吩咐你戒行。</p><p>所以有许多现代人，还没有真神通，那个眼睛打花了、亮影了，哎哟，看到光了！看到这样、那样……专门玩这个。我看，他恐怕是堕“阿巴地狱”，鼻子下面是“巴”，嘴巴嘛，哈，那不是阿鼻地狱，阿巴地狱了，那更不得了。</p><p><strong>【佛告阿难。我般涅槃后。初一百岁。此不净观行阎浮提。摄放逸者。令观四谛。一日之中。修无常观。得解脱者。如我住世。等无有异。二百岁后。此阎浮提。四部弟子。二分之中。一分弟子。修无常观。得解脱道。三百岁时。四部弟子。四分之中。一分弟子。修无常观。得解脱道。四百岁时。四部弟子。】</strong></p><p><strong> </strong>注意啊，佛预言自己过世以后佛教的情形，特别注意啊！他说，他过世以后“一百岁”，一百年当中，过了一个时期，“不净观行阎浮提”，还有人一步一步（修）下来……他的预言。</p><p><strong>【五分之中。一分弟子。修无常观。得解脱道。我涅槃后。五百岁时。四部弟子。十分之中。一分弟子。修无常观。得解脱道。六百岁时。四部弟子。百分之中。一分弟子。修无常观。得解脱道。七百岁时。四部弟子。千分之中。一分弟子。修无常观。得解脱道。八百岁时。四部弟子。万分子中。一分弟子。修无常观。得解脱道。九百岁时。四部弟子。千万分中。一分弟子。修无常观。得解脱道。千岁之时。四部弟子。亿分之中。十人百人。修无常观。得解脱道。</strong></p><p><strong> 过千岁已。此无常观。虽复流行阎浮提中。亿亿千万众多弟子。若一若两。修无常观。得解脱道。千五百岁后。若有比丘比丘尼。优婆塞优婆夷。赞叹宣说。无常苦空无我观者。多有众生。怀嫉妒心。或以刀斫。或以瓦砾。打拍彼人。骂言痴人。世间何处有无常观。苦空无我。身肌白净无量。云何反说身为不净。汝大恶人。宜合驱摈。</strong></p><p><strong> 此相现时。百千人中。无有一人修无常观。此相现时。法幢崩。慧日没。一切众生。盲无眼目。释迦牟尼佛。虽有弟子。所著袈裟。如木头幡。自然变白。诸比丘尼。犹如淫女。炫卖女色。以用自活。</strong></p><p><strong> 诸优婆塞。如旃陀罗。杀生无度。诸优婆夷。邪淫无道。欺诳百端。此相现时。释迦牟尼无上正法。永没无余。佛告阿难。汝持佛语。为未来世四部弟子。当广宣说。分别其义。慎勿忘失。】</strong></p><p><strong> </strong>我们现在硬要把它拉回！非要把它拉回来不可！呵。</p><p>佛的预言都说到了，他过世以后，一千五百年后，此法根本没有人修了。你看看，他的预言都兑现了吧。</p><p><strong>【复次阿难。汝当为来世诸众生等。当宣此言。如来大法。不久必没。汝等于佛法中。应勤精进。当观苦空无常无我等法。佛说此语时。八千天子。悟解无常。远尘离垢。得法眼净。五百比丘。即于座上。不受诸法。漏尽意解。成阿罗汉。尔时长者阿祇达。并千二百五十比丘。诸天龙神。闻佛说此。无常观门。心开意解。皆悉达解苦空无常。顶礼佛足。欢喜奉行。】</strong></p><p><strong> </strong>我们提前把最后一卷讲完，下次，礼拜五，把四大观法后面的一点观法再补充完，这个经典就圆满了。</p><p>至于大家仔细地研究、仔细地修持，就要靠自己喽，深得很……。虽然我们这一次提出来，比上一次给他们几位出家的同学们讲的比较详细一点——（并）没有详细讲，还差远了。详细，每一修法，把显教、密宗各宗各派的修法都把它融会贯通，那要做一个科学的研究了，每个修法……将来我们有机会再说，下一次，还有一次。</p><p>现在九点半，请诸位看电视，“三审江青”，是哪个电台？中视？你们打开啊，哦，华视啊？……</p><p><strong> </strong></p></div>"
},{
    "title": "禅秘要法讲座 25",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p> 现在，继续上一次的四大观，就是四大观的修法，了色身的四大观。现在继续是卷四第十二页，再观火大。</p><p> <strong>【见此事已。复更教观火大。观火大者。自观身内心华树端。诸华叶间。有微细火。犹如金光。从心端出。遍满身内。从毛孔出。渐渐广大。遍满一床。满一床已。满一房内。满一房已。渐渐广大。满一庭中。满一庭已。满一城中。满一城已。满十顷地。满十顷地已。满百顷地。满百顷地已。满一由旬。火色变白。如真珠光。更复鲜白。颇梨雪山不得为比。红光照错。以成文章。渐渐广大。满二由旬。】</strong></p><p> 注意啊。“红光照错，以成文章”，不是说写文章，千万要注意。不然，现代人读古文读不懂，最后工夫做到这里，坐在那里写起文章来了，那就糟了。</p><p> 所谓“文章”，就是一个彩色，一个非常好看的画面的意思。所谓“文”就是条纹；“章”有条理的，构成组织有条理的，非常艳丽的一个画面，叫做“文章”。所以，我们后世把文字写得好，文字语句组织得好，组织成功了，很美丽的文字，那么，所以也叫做“文章”，文章是这个意思。所以，天地就是一个大文章，宇宙就是一个大文章，就是这个道理。</p><p> 这个道理（若）不交代清楚，我们年轻一辈的读书，哦，修到最后，学佛修成功了，到阿罗汉就要写文章了，哈，“红光照错，以成文章”，那就糟了。</p><p> <strong>【满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。】</strong></p><p> 然后，再从我们自己的头顶上收回。这个最后一个“顶”，是讲自己的头顶，要注意啊。</p><p> <strong>【见此事已。复当更教观于地大。观地大者。自见身内。心树诸华。渐渐广大。如金刚云。遍满身内。满身内已。复满一床。满一床已。遍满一房。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满十顷。满十顷已。遍满百顷。满百顷已。满一由旬。满一由旬已。其色变青。渐渐广大。遍满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。】</strong></p><p>  所谓观地大，不是观泥土这个地哦，要特别注意。地大，所谓最后转成青色，观火大转成白色……地大就是物质，这个物质，（是）什么质呢？当然不是液体。就是说，你观成一个有形无形充满的一个东西。</p><p> 譬如，我们普通后世的密宗叫人家观空，这个空是有相的空，像我们天晴的时候，万里无云，一片云都没有，那个青天、蓝天、青蓝、蔚蓝的天，那个空色。</p><p> 就是说，这个就是观地大，这个地大的空……我们现在看到的这个世界上的空，这个虚空并不是没有东西哦，是有哦，充满了东西，譬如电，一切的能，都在这个虚空中。佛法说的那个空，还是超过这个空的，这个虚空是有，属于五大以内。</p><p> 所以，这个地大也等于这个空，是观这个东西。不要把自己观成是泥巴，地大，这个泥巴一块一块长大，最后自己也等于观成泥巴了，哈。所以，要特别注意。</p><p> <strong>【见此事已。复当更教还观地大。观此地大。如金刚云。难可摧碎。当云何灭。作此观时。见佛世尊释迦牟尼。坐金刚座。与尊弟子眷属五百。坐行者前。异口同音。赞叹灭谛。闻此语已。当观地大从因缘起。无明所持。无明无性。痴爱无主。虚伪因缘。假名无明。爱取有等。皆属此相。作此思惟时。见自心内。众华树端。渐渐火起。烧金刚云。一一云。于诸叶间。与火合体。遍满身内。</strong></p><p> 满身内已。地火俱动。遍满一床。满一床已。遍满一房。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满十顷。满十顷已。遍满百顷。满百顷已。满一由旬。满一由旬已。满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。遍满阎浮提。地火二大。其性各异。更相鼓动。遍满三千大千世界。上至三界顶。下至金刚际。还从顶入。】</p><p> 这个地方，修持到这里，再叫你了身的时候，还是回转来再观地大。这个地大是破物质世界有形的地大。这个物质世界有形的地，这一段也写得非常精彩的。等于我们现在世界上的人，（正）当面临的这个劫数的境界。等于一颗核子弹、一颗氢弹，炸毁了这个地球，所以，这个地球的一切物质破坏了。</p><p> 那么所起的火“烧金刚云”，虚空中的这些云彩，不管是黑云、白云，都毁了——云也是物质之一哦，晴空里头有一点东西，有气体、有云，都是物质之一，统统毁完、空完，一切皆空。空完了以后，你要了解，地火二性，“性火真空，性空真火”，地大的道理也是一样。</p><p> 最后，把幻有的世界、物质的世界归到空；空的世界归到“地火二大，其性各异”，地是坚实的……譬如，假设普通的火起来，我们拿泥巴一倒就压熄了，可以压熄了；如果火的力量超过泥巴的力量，那个泥巴也被火烧成灰了。但是，这两样互相生克、互相克制。因此，地大跟火大互相鼓动。</p><p> 我们现有的身体也是这样，我们的肉体整个是地大，所以，人一发炎了，感冒了，就是身体内部里面起的阴火。身体、肉体，走也走不动了，头也重了，脚也走不动了，互相就克制了。假设身体整个地健康起来，发炎也自然好了，同样的道理。</p><p> 所以，修成阿罗汉，由定的工夫修成阿罗汉，了身证果是非常不容易的。所以，中国的佛法，后世的禅宗一来，各宗一来，就是那么一参究，心理上一点清净，以为就是道了——差远了！</p><p> 而且，佛说的法……，你看，佛经的翻译有个系统，“满一由旬，满一由旬已，满二由旬，满二由旬已……”我们觉得很啰嗦，你说，由一由旬一直至于多少由旬就好了——哎，但是，他硬要这样翻译，有他的道理。工夫是渐进的，修持的功力是渐进地扩大的，一点点……躐等，靠聪明，做不到的，不可能，一有聪明就完了，绝对不能用聪明。</p><p> 所以说，第一步走了以后，走第二步；第二步走了以后，走第三步；第三步走了以后，走第四步……就要那么说话，还要那么呆板！所以，做工夫修持要老实，没有聪明可走的。聪明的路子在幻想的境界里头可以，实际修持上不行。这一点也要特别注意。</p><p> <strong>【见此事已。复当更教观于风大。观风大者。自观身内。心华树间。出紫色风。水大随入。灭此风色。同为水色。风动水涌。遍满身内。渐渐广大。遍满一床。满一床已。满一房内。满一房已。遍满一庭。满一庭已。遍满一城。满一城已。渐渐广大。遍满一由旬。满一由旬已。风水二性。其性各异。风吹此水。如琉璃沫。其色焰炽。更相鼓动。遍满二由旬。满二由旬已。满三由旬。满三由旬已。满四由旬。满四由旬已。满五由旬。满五由旬已。渐渐广大。满百由旬。满百由旬已。渐渐广大。遍满阎浮提。满阎浮提已。渐渐广大。遍满三千大千世界。上至三界顶。下至金刚际。</strong></p><p> 见此事已。自见己身。身诸毛孔。一切火起。此火光炎。遍满三界。出三界外。如真金华。华上有果。果叶相次。彼果光中。演说四谛及十二因缘。度生死法。复见身内。一切水起。其水温润。从毛孔出。流布三界。无不遍满。水色出光。照三界顶。入火光果中。复见身内。一切风起。遍满身内。从毛孔出。渐渐广大。驶速飘疾。遍满三界。化为金云。入火光果中。复有地气。极为微薄。弥满四大。】</p><p> 好。我们特别注意啊，这些到后面的修持，（是）彻底证果的，了这个色身的，所谓真正的了生死，证这个色身。</p><p> 上面的一步工夫是火、地，地大与火大是一组，注意哦。所以，我们这个身体存在，体能有生命的暖气，这是一组了（liǎo）；再进一步，风大与水大是一组了，大家特别注意啊。所以，研究这个法门修持的……。</p><p> 还有，譬如说观火大、地大，一切化空以后，再由“顶入”，由头顶进来。到了最后呢，就完全可以证果了，所谓我们后世变成小说的，修成功三昧真火，定中真火。这个时候，风大与水大观，再没有从顶入了，你都要注意的。</p><p> 所以读书，今天所谓告诉学院的同学们，你们年轻（人）读书，没有一点是注意的，都是在玩弄那个后天的妄作聪明，一点用都没有。所以，每一本书，我一考你们题目，你就没有办法：哪一年出版的？版权在哪里？你一定考不出来。可是我读书，书头、书背（面），连它的出版年月都要看一看，你看到是个小事，关系很大。</p><p> 所以像现在，我提醒你们注意，你看这本书都看懂了，乃至可以把它丢掉了，都觉得是啰嗦的事，那么啰嗦——他吩咐得非常仔细！所以，修持做工夫就要这样地仔细。</p><p> 到达了后面的风大与水大观——前面也有，叫我们观这个风大与水大，前面是前面的工夫，到了这里是证果位的工夫。到达了这个时候，可以把身体化掉了。那么，身外这个色身四大，身外有身，“如真金华”，那么这个时候，可以谈了生死了。</p><p> 他说，“彼果光中”，就是快要证果位了。所以，我们说修道，要得道，得道就是证这个果位。自然在“果光中”，“演说四谛及十二因缘，度生死法”，真正可以了生死了，有把握了。</p><p> 但是，这个佛法的哲学原理呢，还是离不开四谛、十二因缘。可是，到这个时候，你所了解的四谛及十二因缘，不是我们平时看佛经（时）能够解释的这么一点点的意识境界。这个时候，是不离意识境界，可是，这个意识境界的智慧就是博大精深到极点了。</p><p> 同样一句话……所以，我们大家怎么可以体会呢？我们从小读书认识一个中国字，我们中国人（用）认识中国字来比……或者，从小读过的一句书，任何一句书，到我们老了，七八十，八九十，一百岁，你每个年龄不同，你（对）这一句书的体会就不同，是不是有这个经验呢？大家年轻人有没有这个经验呢？噢！就是这个道理。</p><p> 所以同样，你看佛法，四谛，所谓苦集灭道、十二因缘，无明缘行，行缘识……你们现在懒得念了，觉得都背得太熟了——你真懂了没有？没有懂。到了证这个果位的时候，你真懂了。</p><p> 懂了以后，可以了什么呢？就可以了了分段生死，还没有了变异生死哦。到这个时候可以了分段生死，这个欲界的人间可以不来，有个长期请假，可以做到；变异生死还没有了，那要转成大乘的哦。这个地方才是谈了生死。</p><p> 所以，我们在理念上看空了，一个人气派大，有修养，生死来了“哎，死就死吧，无所谓！”一个土匪拉去杀头，“无所谓！死了！你开枪打我吧，十八年以后再见！”好像他也了了生死，那不是了生死，哈。</p><p> 那等于我们一个会花钱的人，钞票在手里那么一撒，“拿去！”舍不得花钱的人发抖哦，十块钱拿去都发抖的哦，数了又数，然后绳子捆了又捆哦。会花钱的人，几千、一万，支票一签，“拿去！”这个不算是了生死啊，可以花钱的不一定是赚钱的。</p><p> 所以，看通了生死是一回事，了生死是一回事。了生死分层次的，这个地方可以了分段生死了，工夫做到这里了分段生死，罗汉境界，还在罗汉境界；变异生死还是问题。我们再看下去。</p><p> <strong>【见此事已。复当更教谛观五阴。观于色阴。此色阴者。依地大有。】</strong></p><p> 好，这一段我（最）好先交代。你看，四大了了以后，再观五阴，了五阴。所以，我经常劝大家多看《楞严经》后面，五阴的修持正念的方法。尤其我翻译《楞严经》成白话，把五阴修持的次序、精要都摘出来，放在后面，叫《楞严大义串珠》。</p><p> 那么，这里的了五阴，修持了五阴，是工夫上的修法，也可以说是小乘的修法。那么，要真正彻底地了了生死，大乘经，就要同《楞严经》了五阴的修法配合起来研究。现在我先交代，我们再看下去。</p><p> <strong>【地大不定。从无明生。无明因缘。妄见名色。观此色相。虚伪不真。亦无生处。假因缘现。因缘性空。色阴亦然。受想行识。性相皆空。中无坚实。】</strong></p><p> 对不起，我们暂停一下。如果要正式研究，我不是讲，这一部《禅秘要法》是释迦牟尼佛亲传的修持方法的经典，没有哪一个问题不是牵涉得很广，都牵涉得很广。譬如，我们现在注意一个问题，大家晓得，如果做学理的研究，牵涉到现在科学很厉害了。</p><p> “地大不定，从无明生”，他说，物质世界的一切物质，包括这个地球，“不定”，是不定，都在变化，沧海桑田，随时在变化。但是，“地大”，这个宇宙之间为什么构成一个地球、构成一个月球、构成一个火星？构成一个星球体，这个都是地大。他说，这个地大是怎么样生的呢？上帝创的吗？菩萨创的吗？不是！都是从一念无明起。请问，这个地大怎么从无明起？这是心物一元的最高的哲学道理，也是最高的科学，物理理论最高的科学道理，非常深！</p><p> 因此，我经常讲，告诉同学们，真正佛法的修持是个大科学，不是以为哲学讲讲理论，或者是满口禅话、满口佛经——你能够了？了不了的，那是实证的科学。</p><p> 所以，“地大不定”，是“从无明生”，“无明因缘，妄见名色。”理论上我们可以通，“无明”，一切都是因缘所生，一念无明起。可是，我们心里头也经常起一念无明哦，你一念无明在你面前生出一个小地球来，汤圆那么大，你生出一个来看？除非你吐一口浓痰，那还是液体，不是地大，那还是水大。</p><p> 一念无明怎么样生？“妄见名色”，无明从因缘所生，一念起，就是物理世界是一念唯心所变的——这个道理就是一切宗教、一切哲学焦点的问题，根本的焦点问题。在理论上，几乎没有办法可以论辩。在这里是讲求证，什么叫以身证？我们以身证明，以身心证明、求证这个东西。所以，到这里，是完全讲真实的工夫了。再念下去。</p><p> <strong>【观此五阴。实无因缘。亦无受有。如此四大。云何增长。遍满三界。</strong></p><p> 作此思惟时。见一切火。从一切毛孔出。遍满三界。还从一切毛孔入。复见一切地大。犹如金刚云。从一切毛孔出。遍满三界。还从一切毛孔入。复见水大。犹如微尘。从一切毛孔出。遍满三界。还从一切毛孔入。复见风大。其势羸劣。从一切毛孔出。遍满三界。还从一切毛孔入。如是四大。从毛孔出。从毛孔入。往复反覆。经八百遍。</p><p> 见此事已。如前数息已。闭气而住。经一七日。】</p><p> 好，注意啊。你看，四大，修持到这里，都观到从毛孔出入。其实，我们凡夫没有修到这里，四大是不是从毛孔出入？一样的！所以，气候一变，我们就要加衣服，四大都是在毛孔出入。懂得医学的都晓得，风寒暑湿，都是外感侵进来的。我们这个人身跟宇宙物理世界的一切是相通的。</p><p> 在这里，修持到这里，不过转变了，可以自己做主，观这个四大都从浑身毛孔可以出入，就不靠呼吸维持生命了。但是，到了这个时候，一切毛孔出入熟练了，“见此事已”，照前面数息法一样，修气一样，不呼不吸，止息了，一定七天，就是七天七夜不呼也不吸，就不要呼吸了，“如前数息已，闭气而住”，就止息了，“经一七日”，一个七天，一个周期。</p><p> <strong>【尔时。自然见此大地渐渐空。见一床下渐渐空。见一房渐渐空。见一房已。见一庭地渐渐空。见一庭已。见一城地渐渐空。见一城已。见十顷地渐渐空。见十顷已。见百顷地渐渐空。见百顷已。见一由旬地渐渐空。见一由旬已。见二由旬地渐渐空。见二由旬已。见三由旬地渐渐空。见三由旬已。见四由旬地渐渐空。见四由旬已。见五由旬地渐渐空。见五由旬已。乃至见十由旬地渐渐空。见十由旬已。乃至见百由旬地渐渐空。见百由旬已。乃至见阎浮提八千由旬地渐渐空。见阎浮提已。见弗婆提地十千由旬渐渐空。见弗婆提已。见瞿耶尼地三万由旬渐渐空。见瞿耶尼已。见郁单越地四万由旬渐渐空。见郁单越已。见须弥山。四大海水。山河石壁。四天下中。一切所有。见坚硬物。一切悉皆渐渐空。见四天下已。心遂广大。遍满三千大千世界。诸坚硬物。大地山河石壁。一切悉空。心无所寄。】</strong></p><p> 好，注意哦。真正见到空的境界是这个样子，看到了吧？所以，我们打起坐来眼睛一闭，有时候舒服一下，“哎哟，我要空了！”呵，空了？是空，就是闽南语，你是kongkong，是骂人的哦，哈。这个就是kongkong了。</p><p> 真正的空非要到达气住、脉停，得禅定境界，呼吸不往来了，妄念也不起，如此定，能够一定七天以后，开眼、闭眼所见，前面山河大地的东西，毕竟是空掉了，不是实在的，硬是见到空。但是，跟着修持功力的有限（程度），一步一步，见到三千大千世界，乃至日月星球整个都是空的，所以前面四（断录）……这个还不是自性的真空，是了空的事情。所以，一切物质障碍、物理世界见到空了。所以，一层一层……。</p><p> 见到空以后，还有没有修持的工夫？有啊，地、水、火、风、空，是了五大。一念之心，心中九十八个结使，贪、嗔、痴、慢、疑还是没有彻底地了哦。我们再看佛怎么教我们修……</p><p> <strong>【尔时。自然见金刚际。有十四金刚轮。从金刚轮下。自然上踊。更相掁触。至行者前。尔时心树诸妙花端。自然火起。烧诸华叶。树上四果。堕行者顶。从顶而入。住于心中。尔时此心。豁然明了。见障外事。】</strong></p><p> 特别注意，“尔时此心，豁然明了”，不是开悟的“豁然”。</p><p> 上面有一句话，见到三千大千世界一切物质的障碍境界都空了，修持到这个时候，定力……，有四个字你们特别注意，“心无所寄”，到这个时候，此心“豁然明了”，怎么叫“心无所寄”呢？大家不要轻易看过去哦，因为这个经典里有些句子文学太好，容易看过去哦。</p><p> 你看，我们一个人假使心到了无所寄，会发疯哦。我们普通一个人，心都有所寄的哦。</p><p> 所以，有许多人说：哎呀，我呀，没有别的什么嗜好，最爱读书，一看书，慢慢慢慢，晚上就睡了。因为他也（是）心有所寄，寄托在书上。再不然，爱打牌的人心有所寄，寄托在牌上。人生的功名富贵，赚钞票、做事业，心都要有所寄哦，这个妄心都要有所寄托哦，摆在一个东西上。</p><p> 你说，你们大家……“哎，我们修行的人，没有这种事。”你们也有所寄哦，想求佛修道哦，莫名其妙地想找个东西，心有所寄哦。</p><p> 到这个时候，完全空完了，此心感觉到无所寄了——要么大发疯，变真疯子了；要么空得了。</p><p> 所以，修持到这里……你们大家修持，天天求空，或者口口谈空，真正空了，你会恐怖的。所以，《金刚经》上说到那个空的境界，佛说，是人不起恐怖者，“当知是人，不于一佛二佛三四五佛而种善根，已于无量千万佛所，种诸善根”，是真实的事哦。</p><p> 你们天天修道求个空，到了真空的时候——你叫妈、叫观音菩萨，哭都来不及！</p><p> 譬如我们想清净，许多人生活很奔忙，都想礼拜天到阳明山那里找个野外、找个别墅，“哎呀，山边林下才舒服啊……”真把你搬到那个山顶，天黑一个人都没有，半个月，饭也没得吃，心无所寄，你不死掉才怪呢，吓都把你吓死了，什么把你吓死？空把你吓死了。</p><p> 所以，空、寂灭不是这么简单的，非大丈夫不能过哦。</p><p> 所以，到了这一步，再修持进去，“此心豁然明了”，“见障外事”，一切有所障碍，我们现在的障碍是被物质障碍。譬如他们修道的怕生死，都求了生死，真正工夫做到了，呼吸快要停了，他又怕死了，结果还是会怕的，怕空，就是心都要有所寄。</p><p> 到这个时候，过了以后，“此心豁然明了”，这就看得清楚，三千大千世界以外的“障外”，物质障碍所阻挡的都看得见了。这个时候，你说：了不起，得道了？——还没有成果。</p><p> 那么，有些境界来了，你自己会有境界来——再说，你到那个时候，修持到那，境界来，（是）真有啊，嘿，龙啊，真的龙到你前面抓你一样；看到老虎，硬是扑过来要抓你头上，嘴张开……。那个时候，你也忘记了我在打坐，这是幻境……。你现在讲理论讲得很高、很漂亮：反正是幻境，不在乎。到那个时候，（是）真的哦。如果在那个时候，你晓得了：这是幻境——那你（就）晓得现在这个也是幻境。现在这个幻境你心有所寄，不能无所寄，到那个时候，你的心还是不能无所寄。所以，修道没有不入魔了，什么魔？自心之魔。千万注意，到这个时候，境界就来了。</p><p> <strong>【复有六象。其色正黑。踏大地坏。吸饮诸水。风吹象杀。象耳出火。烧象都尽。四大毒蛇。走上树端。见有一人。似大力士。拔此大树。下至金刚际。上至三界顶。令树动摇。行者心中。四明珠果。复出大火。烧树荄绝。是时大树。散如微尘。</strong></p><p> 行者见已。我今观于水火风等。及与水大。一切无常。须臾变灭。当自观我身内。四大火起无穷。地水风等。亦复如是。此无明相。空无所有。假伪颠倒。犹如霜炎。属于三界。缘于痴爱。三十三亿念生法。九百九十转。次第念粗相。结使九十有八。】</p><p> 注意啊，我们心中的这些杂念之多……，这些境界来了，到最后靠什么了呢？靠理了，智慧去了。</p><p> 所以，经常告诉你们，佛学，学佛，连佛经的基本都没有搞熟，一问一考都答不出来；修持到这个时候，是一点用处都没有哦！这个时候是靠理了（liǎo）。</p><p> 到了这个境界，所谓“三界皆因痴爱而生”，注意，三界结使……，就是父母爱儿女，儿女爱父母；男女之爱，夫妇之爱等等，这个痴爱是生死结使的根本哦。“属于三界，缘于痴爱”，因痴爱所发生的烦恼妄念，“三十三亿念生法”，特别注意哦，多少，一念之间具备三十三亿所生的烦恼；“九百九十转，次第念粗相”，就是一圈一圈地把你捆绑住，“九百九十转”，就是把你一圈一圈地捆绑，“次第”是一念一念，所以，修行求解脱是慢慢求解脱哦。</p><p> 我经常听大家年轻的同学们谈，“我这个人什么都好，我只不过是嗔念重一点，别的都很好。”是好，好得差不多啦，好得快要到轮回下三道去了。自己能够检查得出来，那已经是大智慧成就了，很难哦。</p><p> “九百九十转，次第念粗相”，构成我们现有人身的……所以，《俱舍论》九十八个结使，一个都没有解脱。假使修持到这里，一个结使解脱了，那你的业力就是轻了一大半，结果，一个结使都没有动摇。所谓结使就是“结”，打在那里不能解脱。</p><p> 那么，由这个结使所发生的，如网一样，把我们罩住了，这个网把我们笼罩着。下面请你再念下去。</p><p> <strong>【枝条种子。弥覆三界。为是众结。受生无数。或堕地狱。猛火焚身。或为饿鬼。吞饮融铜。啖热铁丸。百千世中。不闻水谷。或为畜生。驼驴猪狗。数不可知。人中受苦。众难非一。如是众多。从痴爱得。今观痴爱。性无所有。】</strong></p><p> “痴爱”，注意！你念。</p><p> <strong>【作是思惟时。释迦牟尼佛。放金色光。与诸声闻眷属围绕。告行者言。汝今知不。色相虚寂。受想行识。亦复如是。汝今应当谛观空。无相。无作。无愿三昧。】</strong></p><p> 现在转入大乘了，完全转入大乘的理了，转入大乘基础的理。那么，假定我们自己修持到这里，配合禅的理参，可以了。所以，真正的禅与真正的禅宗都是从禅定来的，不是空口说白话的口头禅，（那）不能了生死，没有用。</p><p> 现在，就是大乘的基本三印，空、无相、无愿等等三昧，现在告诉我们怎么修法，这个理要变成事了。</p><p> <strong>【空三昧者。观色无性。及一切诸法。空无所有。如是众空。名空三昧。</strong></p><p> 无愿三昧者。观涅槃性。寂灭无相。观生死相。悉同如实际。作此观时。不愿生死。不乐涅槃。观生死本际空寂。观涅槃性相皆同。入空无有和合。是名无愿三昧。</p><p> 无作三昧者。不见心。不见身。及诸威仪。有所修作。不见涅槃有起性相。但见灭谛通达。空无所有】</p><p> 就是这个叫“无作三昧”，“不见心，不见身，及诸威仪，有所修作”，都不见，所谓不生不灭不垢不净了，“不见涅槃有起性相”，就是不入生死，也不入涅槃。“但见灭谛通达，空无所有”，最后，再转成大乘境界。</p><p> <strong>【尔时行者。闻佛世尊。说是空无相无愿三昧。身心静寂。游三空门。犹如壮士。屈申臂顷。应声即得超越九十亿生死洞然之结。成阿罗汉。不受后有。梵行已立。知如道真。豁然意解。无复余习。漏尽慧通。自然而得。其余五通。要假修得六通义。广说如阿毗昙。】</strong></p><p> 注意啊，这叫做漏尽通——有个同学，前一个月就说自己得了漏尽通了。这叫做漏尽通，这样才叫做漏尽通。所以，狂妄无知的人，有时候简直没得办法，看得我都吓死了，我看到他比看到佛都怕。这样叫做得漏尽通。</p><p> 那么，漏尽通是成阿罗汉道的基本，小乘的极果，二乘的极果。</p><p> 神通怎么修法？要想修得六神通义，修持的道理，你去研究《阿毗昙论》，《阿毗昙论》已经翻译成中文了，《大藏经》里都有。谁叫你们自己不看经呢，尤其我们这里，好几部《大藏经》摆着，你就“阿鼻达”，呵……。</p><p> 所以，佛下面都交代了，到这里算是证阿罗汉果，得漏尽通。漏尽通，一切结使解脱了，转入大乘道了。</p><p> 所以，其余的五通还要修持。所以，《大智度论》告诉我们，大阿罗汉分两种：一种有神通，一种无神通。有神通、无神通都一样，叫做阿罗汉，阿罗汉是道果。通，具备了神通，其它的五通都具备了，那是修得。那么，你得了漏尽通以后，得了道果以后，你要加起用，再修五通可以。那么，佛经也有交代，五通的修法，你去参考《阿毗昙论》，都说了。</p><p> 并不是说佛有保留，把修持方法都告诉你了。可是，你没有那个智慧，绝对看不出来哦，你把那个阿毗昙“昙”了一万弹也没有用哦。</p><p> 这个《阿毗昙论》都摆在这里，我们中国都翻完了，都把它翻过来了的，印度没有了。所以，修五通的方法在《阿毗昙论》。</p><p> 那么下面……我们好像上一次已经讲过了。我们今天，这个《禅秘要法》就到这里圆满了。这一次，是整个地整部把它念完了。中间详细的修持方法（若）再研究，那多得很啊，多得很！</p><p> 可以说，它的确是《禅秘要法》，包括了东密、西藏所有密法的修持，包括了显教，内道与外道，佛法与外道各种的修持。我们中国的许多道家，乃至其他外道的许多修法，都是从这里头流出来的，拿到了一点，就产生了另外一个道门，就是这样。</p><p> 现在，我们再重复一遍。《禅秘要法》的修法，从白骨观开始，主要是白骨观。我们大家全部看完了，研究完了，应该知道，纵使白骨观不能全部观起来，只要一个脚趾头的白骨观得起来——佛不会说谎话，也不会骗我们。只要一念专一，观一个脚趾头观得起来，业力减轻了以后，死后不会沉沦下三道，不会堕畜生、地狱、饿鬼；而且，决定会往生兜率天，跟弥勒菩萨亲自再来修持，即身成就。这个便宜很便宜哦。不相信，大家天天把脚趾头拿着多看一下，就把白骨看得出来了。所以，佛说过的啊，我们上次交代过的。</p><p> 如果能够全身的白骨都观出来，系心一缘，永远得这个定，那他的果报更不可思议。</p><p> 如果真照《禅秘要法》的每一点——千万不要玩聪明哦，好像我这一点到了，就跳过去了；我现在已经跳到修风大观了，哈哈，那“疯”掉了。可以跳啊，有大智慧的是可以跳；你中间插过来哪一个修法也可以。但是，千万不要把自己当成大智慧。</p><p> 我经常跟大家说，绝顶聪明的人要想成就，是走最笨的路线，最老实的路线，没有不成功的。何况我们自己还不是绝顶聪明的人，不要走偷巧的路线，那永远是失败的，不会成功的。</p><p> 那么，这个白骨观的修法，反复……占去了这本经典两三卷的内容，反复讲程序的修法。然后，转到了最重要的，配合白骨观修法的，就是安那般那，念出入息，就是后来天台宗所用的数息观。</p><p> 为什么叫数息观？数息观是最初最浅的，以最初最浅的做个名称。实际上，数息观是安那般那，就是念出入息的一个最初步。</p><p> 那么，《禅秘要法》最后到达了念出入息，修气，就是西藏密宗所讲的修气、修脉、修明点；修火观就是修明点、修拙火。</p><p> 那么，由这个修气，白骨观到达了，配合修气，再加上一个重要的，就是修火观，四大观等等。四大观……就是后来藏密所讲的修气、修脉的道理，都是从这里头流出去的。</p><p> 那么，把修气的这一步工夫做好了以后，整个的全体连起来，重新做一个修持，真正的念佛法门，他也说了，真正的念佛法门。那么，他念佛是念我们本师释迦牟尼佛，也就是代表了十方三世一切诸佛的念佛法门。</p><p> 所以，这一本经典，到了念佛法门以后，最后再一转，告诉我们修即身成就，了心也了身，即身证得大阿罗汉。大阿罗汉看起来是小乘，如果拿大乘华严境界的道理来讲，一切佛也不过是大阿罗汉。大阿罗汉这句话是指真正证果的人，学道证果的人。那么，告诉我们即身成就的方法。</p><p> 实际上，这本经典，看起来文字又明白又简……里面好多都是说神话一样，现代人没有办法可以相信，你仔细一研究，完全是科学。两千多年前，佛要说的时候，人类的知识不同，代表的东西不同，所以只好拿那些境界作代表。现在，如果修成功了的人，可以把它改写——当然，希望你们修成功了来改写，但是不要超出这个范围，最好保留他的原文。有大智慧的人自然会悟得进去这是个什么东西。</p><p> 这个能够完全证到了，（那么，）关于佛法显密的修持，乃至十念法都在内了，念佛、念法、念僧、念戒、念施、念天、念休息、念安那般那、念身、念死，都有了，包括了全部的修法。</p><p> 所以，你们青年同学们，抱着这本经典，一生好好求修证，算不定很快都可以证果，得果位了。</p><p> 我们今天是最后一次，把全书圆满了，刚好快要过年了，不管有钱没有钱，把经典讲完了好过年，哈哈，就可以休息了。</p><p> 我们今天到这里为止了，大家有没有什么问题要问的？没有问题，其它的问题……或者我们明年再有什么课程开的时候，再通知各位，再请诸位研究。</p><p> 不过，这本经典我们是简单明了地讲，千万不要（认为）听过了就是这样。里面包括的内容太多太多了，一时说不完，整个修持的方法说不完的。修到哪里的时候，有问题我们再问啊。</p></div>"
}]