[{
    "title": "《答问青壮年参禅者》第一天第一堂",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>第一天（2005年12月16日）</p><p>第一堂</p><p>居士与菩萨杨仁山居士熊十力的学院说王阳明王学影响日本王学的问题禅海蠡测的话题禅堂与香板</p><p/><p>现在我们这里没有什么形式，不是打七，也不是参禅。这次的事情，都是我们的老朋友古道师闹出来的。古道这位师父专门闹事情，都是找我麻烦的。他提倡少林寺要恢复禅堂，因此请大家来，让我们互相讨论一下。</p><p>首先要了解，我不懂禅，也不懂佛，什么都不懂，乱七八糟只会吹牛的一个人。他们上当了，听我乱吹。也许我的年纪比你们大一点，人活老了就变精怪了。我自己经常引用孔子讲得话，老而不死谓之贼；人老了，老贼一个。</p><p>这次请大家来，是准备做个讨论的。诸位不要搞错了，不是听我讲课哦！我没有资格讲课，也没有资格做老师，不是善知识啊，但也不是恶知识。这一点千万要了解！尤其我们这次很特别，不是你们向我请教，是我向你们请教，这些都是首先要了解的，我先交代清楚了。</p><p>中国的习惯，出家人不喜欢向在家人请教佛法，这是中国佛教很有趣的一个矛盾。我讲矛盾是客气话，应该是这种习惯是非常错误的。你们看中国禅宗，影响佛教比较大的著作，许多都是居士的作品，譬如禅宗最流行的《指月录》是瞿汝稷居士的作品。换一句话说，出家人没有时间，光管修行就够忙的了，佛教的弘扬却靠居士。</p><p>所以当年有一个人这样讲，我是最赞成的，就是欧阳竟无先生（1871-1943），诸位听到过吗？我再给你们介绍，他是金陵刻经处杨仁山先生（1837-1911）的弟子。杨仁山居士的父亲，跟曾国藩是同学，这个一讲一百多年了。那个时候洋文化来了，满清要垮了，杨仁山居士的父亲就推荐自己的儿子去找曾国藩。正好，慈禧太后派曾国藩的儿子曾纪泽到英国去做大使，开始中国的第一个国际外交。曾国藩看到杨仁山说，你跟我儿子一起到国外去吧。那个时候出国，不得了，不是留学哦，是做外交官，就这样一起到了英国。</p><p>他到了英国以后，才接触到佛学，在国内反而是不学佛的，而且反对佛教。后来一路跟随曾纪泽转到日本，日本那个时候，正流行中国的学问。这里告诉出家的同学们，一定要注意，日本的明治维新，是靠中国什么学问呢？王阳明的学问。王阳明是明朝儒家里头的禅宗，是最了不起的，中国文化叫“王学”。日本当时也推翻了旧的文化，接受新的文化，他们之所以有今天，用的是“王学”起家的。</p><p>现在讲到王阳明，中间岔过来时要大家注意。王阳明年轻的时候也学佛；究竟是参禅还是修天台宗什么的，不知道，总归他学佛，也学道家的。他静坐得比我们一般出家的好多了，做得有了眼通；他的朋友要来看他，半个月以前他就知道了。时候一到，他就去几里外等这个朋友。</p><p>“哎，你在这里干什么？”</p><p>“我来接你啊。”</p><p>“你怎么知道我会来？”</p><p>“我早就知道你今天会来。”</p><p>他常玩这个本事，道家、禅都玩得很好。最后忽然不完了，他说，完这些本事，只是自己“玩弄精神”而已。他是走禅宗明心见性的路线开始，最后他用儒家的话，讲心性之学。</p><p>这个事情你们要特别注意，直到现在王学还影响中国，影响东方也非常大。所以到了明朝末年，很多和尚是跟着王阳明学禅的，就是所谓直指人心，见性成佛。王阳明学问的重点是“即知即行，知行合一”，意思是说，我们能知之性，有个思想，有个知道，只闻觉知就是心。知道那个对的就该去做，不需要有分别去考虑，即知即行。日本人采用了他的知行合一这个原则，融合了西方、东方文化，才有了明治维新，开创了一个新的时代。</p><p>因为时间的关系，我只做简单的介绍，王学还有个道理的，你们这几位大师们，要特别的注意啊！你听了这个王学，将来接引知识分子、学者，你们就有本事啦！不然你讲到禅宗，一提王学，什么都不知道，那不行的啊！尤其你们年轻学白话教育出来的，这些都不知道，那是不可以的。</p><p>你们学禅，要参考王阳明的四句教，“无善无恶心之体，有善有恶意之动”，第三句话：“知善知恶是良知”，这个良知良能，是《孟子》里头提出来的。譬如我们的知性，大家今天做在这里盘腿，自己知道在盘腿，现在听到了记录，是自己的知性。第四句话：“为善去恶是格物”，作人是为善去恶，是戒律。这四句是王阳明学说的主旨，你看他学过禅没有？当然学过禅！对禅很清楚啊。</p><p>我现在又岔过来，跳了三，四岔了。可是后来我在教这个课的时候，反对王阳明，批评他了；我说他没有大彻大悟，没有见道。他参禅破了第六意识，分别心不起了，第七识影子都没有摸到，第八识更谈不上。换句话说，参禅他破了初关了，什么是重关也不懂，更谈不上破末后牢关。</p><p>我当年公开批评他时，那是很严重很危险的，等于现在共产党里头反对毛泽东！因为当时蒋介石委员长，他提倡的是王学，他是校长，我是教官，我上课公开讲王阳明不对，讲他没有彻底悟道，但我讲出了理由：</p><p>“无善无恶心之体”是根据六祖慧能来的，你们都知道那句话吧？慧能大师不是拿着衣钵，回到广东岭南吗？我请问你们知不知道？你们知道就点头，免得我费事嘛！不知道我就补充一下，不要客气，我们是讨论，随便谈话，都知道就不要解释是吧？当时六祖接引那个什么人？（答：惠明禅师）对了！这样讲话就痛快了，不要那么严肃。</p><p>惠明看到六祖，六祖说，“你为了衣钵，你拿啊！”他拿不动，这一下他就傻了。“师父啊，我不是为衣钵而来，是为法而来。”哦！既然为法而来，他就说法接引他。你们都看过《六祖坛经》吗？（答：看过）下面怎么记载的？这考问你们了。古道师已经告诉过你们，我讲课随时出问答题的啊！不是光讲光听的。</p><p>他说：“上座啊！”客气话，就是说法师啊！等于你们跟我对话，尤其学禅宗，读语录，完全变成对话就对了，像演电影一样，当场表演的，不是讲空话。你们一个人站出来，我就冒充六祖，你们冒充惠明。六祖说：“不思善，不思恶”，现在你们什么都不要想，好的不想，坏的不想，一切都不想。六祖教他这样做，当然惠明照这样做了一下，他真的办到了。“正与么时”，就是这个时候，用福建广东话就是“咁样”的时候，正是什么都不想，一切都放下了，这个时候，“那个是明上座本来面目？”哪一个是你的本来面目？因此惠明禅师开悟了。这个“哪个”就是疑情，是问号；可是一般后世学禅的看了《坛经》，都看成是肯定的句子。以为六祖说，不思善，不思恶，正这个时候，“那个“就是你本来面目。那是错了！以为修到最后没有分别心，没有妄念，不思善不思恶，达到这样就悟道了，完全错了。六祖原文没有这样讲，是不是？你们都看过嘛。</p><p>王阳明第一句话，“无善无恶心之体”，我说他错了，他没有彻底的开悟，只见到一点清静，你们打坐的时候都碰到过的；就是坐得好的时候，没有妄想，也没有想什么，可是都明白，清清楚楚的，好像这个是对了，不过你们不敢承认而已，对不对？好像那个稀饭煮得很稀，一端来“嘘嘘”一吹，米浆吹开了，看到里头有几颗米，这比方叫做“吹汤见米”，你听懂吗？好像把分别心打开了，咦咦！咦咦！很清静，就是这个。</p><p>这是第六意识分别妄想不起了，可是那个清静也只是心的一面啊！大家看《六祖坛经》学禅的，同王阳明一样，认清净心就是本体心，都走了这个错路，所以我说王阳明错了。“无善无恶心之体”，认为心性的本体，就是无善无恶，这个是什么佛啊？只能叫糊涂佛！我常说笑话，呼图克图，糊里糊涂。政府封西藏喇嘛活佛叫呼图克图，叫错了就是糊里糊涂。</p><p>你们注意！这叫做参禅，不是思想噢！你们学禅要晓得参，参就是追问，叫起疑情。再看第二句，他说“有善有恶意之动”，我们心性是无善无恶的，这个念头一动就有善有恶，对不对啊？对，他讲的也对。那我就要问了，请问：那个本体既然无善无恶，这个一动念有善有恶，这个有，这个作用，是不是从体上来的啊？（答：是啊）那可见体上有善有恶了，“用”离不开“体”的，“有善有恶意之动”，那体岂不是两个了吗？一个是不动的，一个动的，对不对？（答：是）</p><p>第三句“知善知恶为良知”，这个是第三个了，这个像是包子里有三个馅了，有青菜萝卜，还有牛肉呢！“无善无恶心之体，有善有恶意之动”，这一动就是体上来的，可见体本来是有善有恶，一动它就能分别啊。你另外加上这个良知，还有个知道，当我意动的时候，我们想一个事情善恶的时候，我们心里知道不知道？（答：知道）这一知，是不是本体来的？是啊！所以说，把它分成三个了。</p><p>“为善去恶是格物”，第四句话不管，是行为上的，都对。修行，是修正自己心里行为，每天都是诸恶莫作，众善奉行，为善去恶，行为上都是对的。儒家也好，佛家也好，道家也好，基督教也好，天主教也好，伊斯兰教也好，所有的宗教都是教人不做恶，向善方面走。</p><p>可是王阳明的知行合一学说，这一套在日本，却起了这样大的作用，成就了日本的明治维新，影响了全世界文化的思想；所以日本当年王学同佛学一样，都非常流行。我讲的话有逻辑，你们注意，现在不是讲王阳明，是介绍杨仁山先生到日本去，正碰到日本那个时代，一般留学生在那里都接触到佛学了，接触到心性之学，包括所有的国民党，共产党，这个你们就不懂了。</p><p>所以研究这一百年的历史，我今年九十了，再倒回去，一百二十年前，在虚云老和尚的那个阶段，那时候的知识分子，不管好的坏的，不管共产党国民党，都共同有一个心思，就是救世救人，救国家救民族。最初的动机都是这个，所以才去闹革命。至于革命成功以后，政治做法错误不错误，行为上的好坏，我们不谈，这个不是跟你们讨论的了。</p><p>所以，杨仁山先生那个时候到日本，一下就学佛了。回来官也不做了，开始提倡佛学，专门讲佛学，又在南京昆卢寺办“金陵刻经处”，我都去过的，现在还在木板印经的。回转来讲，像欧阳竟无，梁启超这些人，都是他的学生，很多都来跟他学佛，研究佛学。因为当时中国佛学已经不行了，他起来提倡。但是八指头陀还在哦！那时太虚法师还是年轻的小和尚，欧阳竟无是资格很老了，于是佛学才开始大流行。</p><p>后来推翻满清，民国起来，对中国佛教影响大的，又是居士了；靠的是杨仁山居士，包括太虚法师这些人，都是金陵刻经处出来的。杨仁山居士死了以后，学生欧阳竟无，办一所支那内学院（1922）。那也是日本式的，日本人把中国叫支那，就是英文的China；内学院是专门研究佛学。当年太虚法师想见欧阳竟无，他根本不见。他说，他（太虚）懂什么啊！就是这么傲慢。</p><p>我现在讲的话，你们看到扯得很远，说得很闹热，但是有个主题的！杨仁山居士的学生熊十力，现在一般讲新佛学，新儒家的学者们，多半都是熊十力的徒子徒孙辈。</p><p>欧阳竟无先生办支那内学院很多年，很可怜，我很佩服他，跟他学佛的人出家的很多。他有个习惯，出家人见他不跪下来拜，他马上把你赶出去了，他就骂人：“你们傲慢，出家人不拜居士啊！佛的戒律规定，出家人可以不拜居士，可是戒律也有个规定，要拜善知识；我是善知识啊，善知识不分在家出家的啊！”可是出家人给他一拜呢，你还没有跪下来，他先跪下来拜你了。这一点行为我很赞成他，就是说，要除去出家人的那个慢心，那个我慢。</p><p>出家人不拜白衣居士是戒律，可是出家人不拜善知识也是也是犯戒啊，那是大乘戒。可是你真拜他，他不接受，反而拜你了；可是你不拜他，他就把你赶出去了，就是这么一个人。</p><p>这个故事一连串说到善知识，现在重点收回来，我不是善知识，千万不要搞错，也不是恶知识，不过年龄大一点，告诉你们一些经验。现在话说回来，先说了零碎的故事，这个逻辑系统你注意到了吧！我不是跟你们乱扯，为了善知识这一句话，讲那么多故事出来，是怕你们听不懂这句话，兼带说明中间的过程，告诉你们其中的关联和影响。</p><p>回头过来讲这一次的事情，是古道师闹出来的，说什么嵩山少林寺要恢复禅堂啦！少林寺什么时候有过禅堂？我还真不大清楚，少林寺没有禅堂啊！现在讲禅堂，就要问你们，禅堂在中国什么时候开始的？这是个大问题。</p><p>我们都晓得，禅宗是从达摩祖师传来的，达摩祖师没有设立禅堂吧？（答：没有）那么五宗派也很少提到禅堂吧？（古道师答：后来有五家的钟板）也设禅堂吗？没有禅堂。禅堂是什么时候开始？香板什么时候开始？都要搞清楚。现在一到禅堂，就拿起香板乱打人。依我看来，打坐姿势也不对，禅堂也不对，行香也不对，什么都不如理不如法。换句话说，本身都不合规矩，就是不符合佛的规定，所以我们要在这里讨论。</p><p>你们还年轻，如果还有机会给你们开创一个新的时代，一个新的禅文化，我提出来这几个很严重的问题，你们必须要搞清楚。等于昨天晚上，你们的方丈大和尚在这里，我问古道师，少林寺的禅堂，修得怎么样？（答：原来已经有）是不是闷在中间，四面不通风？他说是这样。光线暗暗的，空气也不流通，几十个人在里面打坐，然后一天还吃三四顿，点心吃得消化不了，上面打嗝“呃”，下面放屁“噗”！五味杂陈，里头各种味道都有，自己习惯了不觉得。我说这个叫禅堂吗？一个修行的地方，光线配备，空气的调和都很重要。</p><p>禅堂里头原本是没有佛像的，后来变成中间有个佛龛，然后为了行香转圆圈，靠近佛像旁边这只手，走起来要少动，另一手多动，身体个个搞得歪东倒西的，体形都搞坏了，这个叫什么佛法？这种佛法我是不会来学的！连这个生理都不懂，佛不会这样教的。然后你看到，香板到处打人，尤其日本更严重。到日本学禅的，还要跪在师父面前，请师父先帮我打吧，痛打一顿消业啊！嘿，打了一顿，打伤了，只有罪业更重，当然要医了。什么消业啊？香板是打人的吗？都不对啊！这些理由，我们要根据历史来讨论，要知道什么是修行。</p><p>所以我昨天晚上跟他们说，你们的禅堂一定是这样吧？古道说，差不多。我说那你们不要再花钱修禅堂了，等我庙港那个新的禅堂修好，再做参考。首愚法师听了我的话，在台湾搞了一个禅堂，最新的设计，已经完成了，他们拿录影带来，我一看，还是不行，还要研究。</p><p>我现在庙港有个讲堂，也做禅堂，最新设计，冷暖空气都要调好，修行不是享受，但是修行离不开与自然的关系。如果卫生一切都搞不好，那是不行的。所以跟你们讨论这个禅堂的问题。</p><p>今天下午，我一听你们几位年轻大师都来了，我就急了，要大家先上来。等一下再讨论这些问题，就是关于禅堂外形的规矩，怎么用功？内在又怎么样参禅等等。我从年轻出来，这个事情也摸了几十年了，我把这几十年经验，讲给你们做参考。对不起啊！千万不要认为我教你们什么，我没有，我只是做一番报告。</p><p>昨天你们那个方丈师父讲：“老师啊！你的著作影响很大啊！”我说那些都不算。我的著作一大堆，我真正写的一本书是《禅海蠡测》，你们看到过没有？尤其你（僧甲）看懂了吗？我想你们一个都看不懂。所以你们要真正了解南怀瑾，连一本《禅海蠡测》都没有看懂，还谈什么呢！所有的书都不算数，就是这一本。</p><p>为什么要出这本书呢？这一本还是专门对付日本人讲禅宗的，现在一讲都五十年了。这是我们到台湾以后的事。日本自从二战被美国人打垮了以后，要用文化来征服别人，所以有意培养了两个人，叫他们到美国去弘扬禅宗。一个是禅宗和尚宗演，当时八九十岁；一个是居士铃木大拙。日本天皇政府每年津贴铃木大拙不少钱，要他在那里提倡禅宗。他讨个美国太太，所以英文很好，在美国大弘扬禅宗。这当中有这么个秘密，中国人不知道。</p><p>我们这里呢，虚云老和尚在云居山被打昏死了以后，重新活过来了。他是我的皈依师父，当时虚云老和尚在重庆，我们两个曾在重庆相处过几天，他的首座叫显明法师，现在还在美国，九十多岁了，他是东北人，天台宗四十五代的传人，我帮他办好手续到美国去的。他曾告诉我说，你回中国，我就跟你回去，现在他还没跟我回来。</p><p>讲到《禅海蠡测》这本书的内容，是我当时为了对付铃木大拙；他曾批评中国的学者胡适不懂禅。可是我没有批评人，只把中国禅宗东西拿出来，这是我真正的写作，且牵涉到中国的儒家道家；牵涉到打坐修行，修定与修慧；牵涉到生死问题，怎么样了生脱死；牵涉到科学、哲学、宗教等等的问题。现在看起来都很简单，可是当年我初到台湾，写这本书的时候很可怜，手边没有参考书啊！</p><p>所以有个学者问我：南老师啊，你写书，《五灯会元》《传灯录》都不引用，专门引用《指月录》，为什么这样推崇《指月录》呢？唉哟！大家不知道，我有个痛苦，初到台湾，什么书都没有，只有一本《指月录》，而这本《指月录》还是我买的。那时候张学良关在台湾，我还在成都。张学良突然要学禅宗了，看守张学良的那个将军叫刘乙光，湖南人，叫我师兄，他也暗中在学佛。当时我在成都，他写封信给我，要我赶快买一套禅宗最好的书，寄到台湾来，因为张学良要学禅宗。我接到信，正要离开成都，我笑了，凭张学良他有资格谈禅宗？可是刘乙光叫我买，我不能不买啊，到文殊院的印经处，给他买了一套《指月录》，寄到台湾。</p><p>天下的因缘很奇怪，台湾根本没有禅宗的书，那个时候什么书都买不到。我到了台湾以后，碰到刘乙光，我说：“张学良还在学禅吗？”</p><p>“唉呀，他学个什么禅啊？他怎么学得进去啊！”我说：“那你为什么叫我买书来给他？”</p><p>“他要学什么，上面就叫我办，我只好给他买啊！他现在研究明史了，政府找了一个学者周念行教他明史，而且信基督教了。”</p><p>这位姓周的也是我们的朋友，书读得好，一目二十行。南方福建、浙江“二十”音“念”，所以我们叫他“二十行”。</p><p>我说：“这样啊，正好我没有书，你把那套书还给我吧！”所以我手边只有禅宗一套《指月录》，其他的没有几本参考书，就凭记忆写。所以讲写作做学问，教你们读书要背才行。我那个时候很可怜，还有两三个孩子，太太还在等米下锅，怎么办啊？摇篮里一个孩子，这个脚在推摇篮，旁边站一个孩子在哭，手里抱一个孩子，还在写书。在这么穷苦的环境下，三个月当中，每天写六七千字，写完了几十万字；现在做不到了。你们年轻出家的注意啊，天天说读书，现在要你们一天写两三页报告给我，都很痛苦；不是没有东西写，是写不出来，不会写。</p><p>禅宗究竟要不要打坐？禅宗与修禅定有什么关系？禅宗究竟讲不讲气脉？禅宗是不是要参话头？禅宗能不能修密宗？同密宗什么关系？同道家什么关系？在这本书里，全部都讲了。现在你们都说看过南怀瑾的书，那我请问你们，哪个看过这一本？这位师父（僧甲）峨嵋山下来的，他还叫我师叔，叔个啥子！你这一本书都没有看懂，还说是在修行。禅宗很多真正的东西在这本书里，可是你们看不懂，这是禅。呵！</p><p>小朋友（僧甲），你身体好多了！好几年不见你了，有几年了？这是李居士帮你的忙，让你参加这次听课，是吧！</p><p>我们先讲到这里，大家休息一下，喝杯茶，上个厕所。我先开个头，然后听你们每一位报告怎么出家，怎么修行。听完了，然后像医生看病一样，才知道谁是饿了，谁是吃太饱了；才晓得怎么样下药，才好告诉你修行走那条路线。等一下再来讨论，先休息一下，这里不是禅堂，一切不拘束，很自由。</p><p><strong>－－－摘录自南师新书＜答问青壮年参禅者＞</strong></p><</div>"
}]