[{
    "title": "榴窗随判",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>　　　　　　　　　　　袁焕仙　南怀瑾<p>目录：<p>一、 判名<p>二、 判净宗七问<p>三、 判禅密简繁<p>四、 判唯识言有中观言说空<p>五、 判一悟顿超三大阿僧祇劫<p>六、 判三十二相及悟后起修等<p>七、 判三关<p>八、 判五家宗旨临济三玄等<p>九、 判行棒行喝<p>十、 判悟后起修化报<p>十一、 关于禅宗支分具否<p>十二、 判止观话头为同为异<p>十三、 判上根下劣<p>十四、 判定慧双修及教外别传<p>十五、 判禅宗阶位<p>十六、 判授受<p>十七、 判丹道 <p><p>一、判名<p>问曰“梵语禅那，此云静虑，是禅宗者同此禅邪?异此禅邪?若言同，则此禅者义仅六度之一，而是禅宗妙该万有之全；若言异，诸名实多，何独袭此而不他名?”<p>判曰：“如此昧心乱统，成何矩范?”<p>进云：“理以究而明，何得厚诬中人乱统?事以激而大，不合深斥吾侪逾行。”<p>曰：“狮子扑人，韩卢趁块。转解而缚转坚，转辩而义转渊。禅宗之禅与六度中位当第五之禅是同是异且搁不论，无容深研。即今问话者与未问话者是同是异，试道一句看！若道得，许汝拈头作尾，以实为虚，把逆作顺，以佛为魔，踏毗卢顶上行，从绿荫丛里过；若道不得，乌得不云乱统?云何不是逾行?”<p>进云：“昔圭峰云：‘欣上厌下而修者，外道禅；正信因果不舍欣厌而修者， 凡夫禅；悟我空偏真之理而修者，小乘禅；悟我法二空所显具理而修者，大乘禅；若顿悟自心本来清净，原无烦恼，无漏智性本自具足，此心即佛，毕竟无异，依此而修者，是最上乘心，亦名一行三昧，一名具如三昧，达摩门下展转相传者，此心也。’又判云：‘达摩未到此土，古来所解皆前四心，诸高僧修之都得功用，即南岳天台依三谛之理，立三止三观教义，虽极圆妙，然其趣入门户次第，亦只前之诸禅行相。惟达摩所传者，顿同佛体，迥异诸门’云云。又检曰：‘宗习者得则成圣，疾证菩提；失则成邪，速入涂炭。先祖革昧防失故，且人传一人，后代已有所凭， 爰任千灯千照’等如是说。彼且云云，何得厚诬学人乱统，深斥吾侪逾行?”<p><p>先生曰：“咄!如此恶口，何有吾宗!”于是凝然据座，进无语。久之，曰：“会么?”进云： “不会。”<p>乃曰：“于此会去，尚云落二落三，矧此不荐，敢云胜行?既非胜行，即是乱统。既是乱统，何行不逾?”进语阻气抑，礼求朗示。<p>先生曰：“此事人人具足，一切圆成，然未证据者，才涉思维，遂尔白云万里，矧乃逐末迷本，妄计黑白，横生异同耶。如此行心，何年乃彻?讵知诸名无常，皆依假立，必究名相?圭峰既以剖析。胡劳嗜痴?且一切唯心，何缘去取?极其至，法尔如幻，心亦强名。明知幻法，横课长短，妄立自他，云乎不碍证此?不但圭峰所谓之五种禅为无疾而呻，而临济三玄、曹洞五位、沩仰九十六圆相、法眼六相、云门三关、天龙一指，何一而非门庭设施、一期方便?宁有实法欤?不仅此也，三藏十二部、三世诸佛教、一切贤圣言，悉是应病与药，黄叶止啼。当人当下明心，一切现成，理事皆足，所谓尝鼎一脔，余旨可知。若不尔者，任汝多闻，达古今，总是痴狂外边走也。<p>“至云‘得则成圣，疾证菩提；失则成邪，速入涂炭’，尤为权语。何也?得本无圣，何有菩提可证?一物也无，失从何失?既无有失，云何成邪?既无有邪，入何涂炭?若曰人传一人是有法可授也，至于千灯千照亦属法尔如然。当人不检己阙，惟求他珍，说云趁块，不其然乎?扑人狮子，固不尔矣。明此，开一禅门为八万四千禅门，尘尘尔、刹刹尔、法法尔，滴滴显慈仁之沛；以八万四千禅门入一禅门，圆圆透法尔之全。若以理求，若以事得，若以声音相貌判，白云万里。”<p>　<p>　进云：“余即不问。如何是白云万里?”<p>　先生曰“日暮数峰青欲染，舟人说是汝州山。”<p>二、判净土七问<p>问曰：“禅宗、净土是一是二?学人进业，何去何从?永明寿四料拣曰：‘有禅有净土，犹如戴角虎，现世为人师，来生作佛祖。’次曰：‘有禅无净土，十人九错路，阴境忽现前，瞥尔随他去。’三曰：‘无禅有净土，万修万人去，但得见弥陀，何愁不开悟?’四曰：‘无禅无净土，铁床并铜柱，百劫与千生，没个人依怙。’云云。四偈出已，一时净宗风尚，禅席衰落。彼永明者方便言耶?如实谈耶?愿垂明示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚， 转辩而义转渊。当人但自明心，何土非净?’何净非禅?何禅非心?何心非自?自心既彻，何事不照?何义不通?为二为一，何去何从，不着问人，洞如观火。若不尔者，总为趁块韩卢，决非扑人狮子。所谓剑过已远而犹刻舟也，讵不悲乎?彼四料拣者，一期方便，捏怪空拳，原无实法，宁有是处？<p>“必曰‘有禅有净土，犹如带角虎，现世为人师，来生作佛祖’。然则禅净二也，不然云何双举?讵知非禅不净，非净不禅?禅即净，净即禅，名固不一，体宁有二?若体二者，则二法也，岂圣人之道欤?故曰：惟此一事实，余二则非真。惟不二也，能净即禅，以治净宗，言花开见佛，佛即禅，禅即佛也。惟非一也，能禅即净，以治禅宗，说见性成佛，佛即净，净即佛也。宁舍禅净外而别有他佛他祖耶?今曰有禅有净土，当下即已作佛作祖，何必来生?既作佛已，何用不京?讵以虎而戴角能喻其锐哉?今既如是诤论，如是驰求，何曾梦见有禅有净土来?故曰：趁块韩卢，决非扑人狮子。至于有禅无净土，无禅有净土，无禅无净土，皆如上判，以例而悉，固非一隅反三，今不赘。盖先圣为初机开一方便入德之门耳。”<p><p>又问曰：“治净宗者，口持佛号，得佛加被。如是履行，不但专工己有，力且借他，自他共掖，举必易擎。彼禅宗者，呵佛骂祖，力专在自，纵饶有人，其力难充。当否，祈示。”<p>判曰：“皮不存，毛安附?自不立，他何为?俗谛犹然，况踏毗卢顶上行耶?须知 才起借他之念，便落怠倚之行。大大夫儿一闻便信，一信便行，一行便深，一深便横超直出，魔来斩魔，佛来杀佛，觅自已无，何有于他?况借力耶?力必待借而充，其充也因他而充，何充于自?自既不充，何贵此充?若然，他生于自，非自无他，自他两忘，力在何处?道来!道来！必曰念佛则佛加被，不念则佛不加被，是等佛如贪吏，飨则福淫。不供而祸善也，宁有是处！况佛喻如镜，胡来照胡，汉来照汉，理无去取，宁有是非!若礼则照，不礼则不照，是镜也，异也!妖矣！佛云乎哉?咄!真小儿女语，非大大夫言。”又问曰：“净宗九品三阶，如实而行，事非立异，学子 易超。禅宗一物也无，遍含空有，行人难即。”判曰：“咄!一翳在目，空花乱飞。汝既异也，而犹异人。异哉!异哉!咄也!咄也!九品三阶，因机而立，且在彼土，汝尚在此，而未到彼，从何曰确?若必曰确，实因他确，倘不因他，汝从何确?确因于他，自且不知，亦云异也，宁曰异人?况彼土当此土西，远隔十亿万佛土，汝以肉眼云何能见?未见云见，不亦异乎?又彼佛报身白毫婉转五须弥，绀目澄清四大海，当人不但身未亲临，目未亲睹，饶汝亲临亲睹，毕汝百年寿命尚不能游遍一目，况其余耶?此不自异而独异人，不更异乎?吾宗一物也无，遍含空有，尘尘刹刹，无不毕 现。他不远言，即以汝例，汝此身者为有为无?若是有者，除却四大，身从何身?若曰四大即身，四大本四，云何是身?若是身者，何云四大?故不可言有也。若实无者，则此色身，明明是有，何得灭有言空?析有为空，故不可言无也。然立有时，有非实有，因无而有，故曰一物也无；立无时，无非实无，固有而无，故曰遍含诸有。物物尘尘，无不焕然等现，一派圆成。汝犹异之，真趁块韩卢，而非扑人狮子也。孰易孰难，当人自检，自检。” <p><p>又问曰：“净宗持一佛号，临命终时，乘彼佛号，即得往生。彼禅宗者一无所系，不待命终，即今现在，何所执持?既无执持，主人何在?既无主人，生死何了?祈示。”<p>判曰：“乘一佛号而往生固也。汝亦知乎？吾宗者不往即生耶。不然‘十世古今，始终不离于当念；无边刹境，自他不隔于毫端’谬也。无边刹境，自他既不隔于毫端，然则往往何往?十世古今，始终既不离于当念，然则生生何生?古有尊宿于此拈云：‘生则决定生，往则实不往。’又一尊宿曰‘往则决定往，生则实不生。’不快漆桶，何曾梦见?妄毁上乘，业堕无间，悲乎悲乎!向汝道一物也无，汝云执持，执持何物?苟有执持，岂无为法哉?一大藏教，演绎则万流竞秀，归纳则人法无我。既无人法，谁受执持?既无有受，谁为执持?若曰主人，谁为客子?谁生谁死?谁了谁不了?不快漆桶，试道一句看?” 又问曰“一持佛号，一参话头，为一为二若云一者，多此一法；若云二者，佛法有二。即有此法，何法为优?若等优者，究以何从?祈示。”<p>判曰：“众生舍本逐末，背觉合尘，虚荣死生，轮回六趣。先圣哀之，为设疑信二门，但臻于至，一也不有，云何曰二?若不尔者，万别千差，讵曰一乎?疑者疑此一事实，信者信此一事实。疑极而信实，信则一物也无，信岂能寓?信生而疑正，疑则纤毫不立，疑讵能居?疑信焕然，法尔如幻，故曰：惟此一事实，余二则非真。 持佛号者贵乎信，参话头者重在疑，当人明此，自合开口大笑也，宁问人乎?”<p><p>又问曰：“比来行人佥曰‘千稳万稳，不如一句佛号为稳；说禅说道，总无把握。’故昔在宗下参究数十年者，毫无入处，今改入净，似尚有力。若曰禅宗为优，或等优者，此云如何?乞示。”<p>判曰：“咄!如此自欺欺人，成何矩范?何为净土，何为禅宗，上已具言。非禅不净，非净不禅。彼在宗下无有入处，而于净土为有力得，是大诳语，是大偷心，是大自欺，何也?如饥人食饭。食此饭饱、必知食彼饭亦饱，盖等一饭也。如不知彼饭能饱，决未饱食此饭。不待智者而知，虽愚夫亦显。故曰：作是说者，是大诳语，大偷心，大自欺，穷劫不能生净土也，经曰‘不可以少福德因缘而生彼土’者，盖为此辈痛下一拶矣。又‘若一日若二日乃至七日，一心不乱，定获往生。’经垂朗示，试问漆桶。汝能一日或一时一心不乱否?如能，以七日较之，为程尚远，况不能耶?讵知吾宗一念明心便同本得，本得者明心也。心即佛，佛即心，是当人当下即已成佛，稳欤?非欤?说净说秽，说生说不生，皆权语也。诗曰：‘等闲识得东风面，万紫千红总是春。’不快漆桶，又何曾梦见东风一面耶?咄!趁块韩卢，远非扑人狮子。<p>　<p>进云：“然则净宗劣而禅宗优也。”<p>曰：“否！否！华严海众，犹归净土；文殊大智，不舍极乐；龙树妙阐入德之程，远公创结莲社之雅，云胡不令?若曰劣则总劣，若曰优则总优。何也?流水不曾怀昨日，桃花依旧到春时。” <p><p>三、判禅密简繁<p><p>问曰，“密乘建立生起、圆满二种次第，生起属外，圆满属内。外成就已，乃及于内。灌顶、加持三业相应，事理交彻，允称希有。治其道者，颇议禅宗过于简易，摄机不广，又自诩言于彼宗者即身成佛。宗门下客亦自况曰；‘何须即身，当下明心，立地成佛。’二者交诩，孰优孰劣?”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人当下把自己脚跟下一段风流大事了彻，三藏十二部成废话，曰显曰密。真可笑也。如不尔者，称郑称扬。悉属外求；说凡说圣，总是内觅，谓余不信。腊月三十到来，任汝说显说密，说圣说凡，阎王老子都不放你过的。所以说读破四韦驮而不免生死。拙哉！你看他铁练锁虚空的朋友，是何等光昌’何等气象！彼丈夫兮我丈夫，不于此痛下一锥，空号须眉，枉称汉子！<p>“本无内外，何法诠为生起属外，圆满属内?本目具足，一切圆成，成成何事?就就何法?若有成就，即有增减。既有增减，即非无为。既非无为，云胡说云‘灵光独曜，迥脱根尘’?至云灌顶加持，亦是依他，三业相应，悉为幻影。当人果能于此一觑觑破，无事不通，无理不彻，所谓头头上显，物物上明，至哉，扑人狮子！讵曰趁块韩卢?说云允称稀有，固不在彼而在此。所谓‘猿抱子归青峰里。鸟衔花落碧岩前’。不着问人，当人如观掌果，如察指纹也。<p>“若曰禅宗简易，摄机不广。且自诩云即生成佛，尤为戏论。讵知是法平等，众无短长。何有繁简?必诩自繁，既曰自繁。何曾梦见实际理地不存一物?彼必又曰本来无物，故修多罗曰：‘实无所得’,然此无得，至玄至幽、学人机浅，如何凑泊?必预有而后及无，必先繁而后涉简。若不尔者，三藏十二虚构也。诚然，诚然，虚 构，虚构。三藏十二句句彻，语语明、都教汝不他求，不立异，不炫奇，直上归家道路。归家道路者，诸行无常一切空也，既云众常，既曰一切空，谁教汝把三藏十二蕴在胸中，荷在肩上，如龟负壳，宁有超世?圣人指令穷子还家、而令其肩荷逆旅心蕴路程乎?况简莫简于禅宗，繁莫管于禅宗，是禅宗者恰恰又不在你简里繁里，不简不繁亦简亦繁里，何也?一喝而该万有之全，彼生圆二次第一切诸种法，不离万有，云何不该？非仅此也，彼宗只该生园二次第一切诸种法，而不该无生圆二次第一切诸种法。禅宗一喝，有无不驭，无法不该。若曰摄机，何广何不广？昧者且明，何容赘说?此言繁也。若以简言，临济三顿棒，天龙一指禅，踏翻溺器。蹴破脚头，所谓一物也无，而无亦无。遑论乎溪深每长于杓柄耶？ “至云即生成佛，实为一期方便语，黄叶止儿啼。众生本来即佛，佛即众生，无欠无余，不二不一，如何以佛更成于佛?若以佛成佛，是头上加头也，可乎?可乎?惟众生本来即佛，众生不荐，达者能仁指令见耳。若曰有佛可成，且不论乎即生不即生，许汝穷劫不能成佛，何也?邪见也。头上安头，南辕而北辙矣!若禅宗者，佛之一字，雅不欲闻。成与不成，悉为 戏论；当下明心，亦权语也，况余乎。”<p><p>进云：“然则禅宗密乘为二，优劣丕显也。”<p>曰：“否!否!禅者密之禅，密者禅之密。苟至于极，何密非禅?不驭乎道，何禅非密?所谓到家皆亲，于途总别也。昔一尊宿问一尊宿曰：‘如何是世尊有密语，迦叶不覆藏?’宿曰‘汝会则迦叶不覆藏，不会则世尊有密语。’何为禅?何为密?何为一?何为二?何为优?何为劣?道来道来！分明一片闲田地，过去过来问主人。咄！蠢哉。” <p><p>　四、判唯识言有、中观说空<p>问曰：“中观唯识，两学巍然。治中观者，谓唯识家立胜义为有，外境为无，是遮境存心，犹羁法执；治唯识家，谓中观学者立胜义为无，破斥种子有，坏缘生。 空有互争，议论千载，今以此判，何去何从?”<p>　判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当下明心，万事了毕，说有说无。一行总愆。讵知有非是有，因无故有；无非是无，因有故无?有无不驭，去取何居?若曰立有时纤忽不寓，立无时遍界不藏，所谓不有而有，不无而无，有即是无，无即是有，都是虚声，悉为谤论。何也?二法也，不明心矣，明心之士决不如然。卓焉扑人狮子，迥非趁块韩卢。当下识得自心，一切皆为剩语，何暇与人说无说有，说去说从耶?必曰遮境存心为羁法执，是诠执为劣法也。然则一诺而终身不逾，一行而万邦足式，乃至释迦四十九年惟说此一事实，执乎?非乎?<p>又戒、定、慧三学，今昔艳称人口，初机入德要途，戒则守而不逾，定曰心一境性，慧则寂 而常照。若以执为劣法，是戒不守，定不一，而慧则照而不常寂也，可乎?可乎?讵知非心不问境，非境不名心?此心即境，何境可遮?此境即心，既云境无，何心可有?既无有心，何法为执?此无论也，心境双忘，复是何物?道来，道来。<p>“必曰胜义为无，破斥种子有，坏缘生。此亦诤语，非是，何也?既云无也，而言此胜义为无者，为有耶?为无耶?不待筮龟，不着问人，当人自悉也。讵知种子缘 生，当体即无?若实有者，种从何生?缘从何会?种既不生，云何说云种子?缘既不会，何法设为缘生?昧者执而不察，是不待他破而自己预破也。讵不冤乎?此法既明，法尔如幻，安立因果，井然为章，乃知无始至今，生则幻生，灭则幻灭，惟当人脚根下一段无阴阳土，豆古至今不曾移异一丝忽头。修多罗颂曰：法身遍满于法界，普现一切众生前。随缘赴感靡不周，而恒处此菩提座。’<p>“总如是说，唯识详有，中观言空，皆一期方便语，接引初机谈，都无实义，宁有轾轩?须知惟此一事实，余二则非真。治唯识者必曰胜义有，治中观者必曰胜义无，有无互攻，遂为道病，讵曰法执且亦见邪?” <p><p>进云“无着、天亲义阐妙有之全，龙树、提婆法显真空之胜，今曰执法，又曰见邪，无乃毁灭先圣，自是非他欤?”<p>先生曰：“咄！如我说者为正说，非我说者为魔说，谁管自是或不是，他非或不非；甚么先圣、后圣、无着、天亲、龙树、提婆等一切冗词废语，即使弥勒到来，亦须痛摒异域，文殊临此，自合远贬殊方。为何如此?”先生以目顾视大众、良久乃曰：“古德云：我王库内，无如是刀。”<p><p>进云：“毕竟一句。作如何判?”<p>先生曰“两个驼子相逢说，世上而今无直人。”<p>五、判一悟顿超三大阿僧祇劫<p>问曰“顿悟成佛，又云一悟便至佛地，大违教言，何有是处?资粮加行，依次渐修，一大阿僧祇劫，乃得见道，顿断分别；一至七地，依次渐修，一大阿僧祇劫，登第八不动地，顿断执藏；八地至十，依次渐修，一大阿僧祇劫，得金刚喻定，顿断随眠。今言顿悟即超彼劫，如是长时，何能一悟便超?无始习气，何能一悟顿断?若能超则坏时，若能断则坏事，祈示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人果忽地一下摸着自家具孔，那有如许之绕来?今既不尔，辩亦徒劳。汝知顿悟成佛，一悟即至佛地，讵知吾宗不悟已成，本来即在佛地乎！不然众生已成佛竞之伟论谬也。《圆觉经》云“一切众生皆证如来圆觉。’《维摩诘经》云：‘不舍受蕴而取证。’亦谬也，可乎?可乎?众生既已成佛竞，既已证如来圆觉，既已不舍受蕴而取证，认何为时?认何为事?认何为烦恼习气?既无时，既无事，既无烦恼习气，超超何时?断断何习?今既有超有断。正是有作有为，何曾梦见已成佛竞，已证如来圆觉，不舍受蕴而取证耶?向居士曰除烦恼而趣菩提，喻去形而觅影；离众生而希佛果。若求响而默声。咄哉！向汝道：狮子扑人，韩卢趁块。“又既不得忽地一下摸着自家具孔，必昌言修行，肆说胜义。于是离声色著声色，离名字著名字，所以无想天人，修经八万大劫，一朝退堕，诸事俨然，盖未得忽地一下而不知根本真实也。于焉次第修行，三生六十劫，四生一百劫，如是直到三祇果满，他古人犹道不如一念缘起无生，超彼三乘权学等见，故曰：‘弹指圆成八万门，刹那灭却三祇劫’也。等如上说，孰为坏时?孰为坏事?道来，道来。”<p>进云“如说上根别器之行，初机必不能荐，不然三乘之说谬也，初中后善扬死法也。”<p>曰：“否!否!是法平等，本无高下，宁有初中?悟则顿悟，虽愚亦能悟；迷则总迷，虽智亦时迷。迷悟名言，相对而立，今不迷，悟何寓?上智下愚依悟而有，觅悟若无，彼上下者从何而建？既不能建，孰为上根?孰为下劣?道来！道来。须知悟则下愚即上智，不悟则上智即下愚。倘不于斯一觑觑破，任汝说得一大藏教，总为戏论！<p>“必曰有分别，有执藏，有随眠诸烦恼可断。然则无始劫来，一切分别，一切执藏，一切随眠诸种烦恼，讵汝三大阿憎祇劫能通然顿断耶?三大阿僧祇劫以时言诚久矣，然以例乎无始大劫，则又太仓之一粟耳。彼一粟能敌太仓，此一悟而等阿僧祇，又乌乎其不可况?当人自无始迄今，头出头没，历劫回向，不知经历若干阿僧祇劫，始有此悟。只以步前忘后，昧于进程，遂尔不自疾迟而反病速，亦可晒也。若然，是则总是，非则总非，彼乌得是彼三大阿僧祇劫而非此一悟耶?既是此三大阿僧祇劫而非此一悟，又谁为坏时?谁为坏事?不待龟卜数计，烛照而知也。<p>“又烦恼云断，然则果有能断所断耶?若有能所，谁当能所?若无能所，云何曰断?讵知作众生者，烦恼习气也，作佛作祖作菩萨者，亦烦恼习气也？断烦恼习气即是杀烦恼习，杀烦恼习气即是杀佛杀祖杀菩萨杀众生。三藏十二分教明明叫汝学佛学祖学菩萨度众生，谁叫汝杀佛杀祖杀菩萨杀众生?非仅此也，古人喻为牧牛，今曰断，是不牧牛而杀牛也，不亦大可笑乎?”<p>进云“然则毕竟一句，究作何判?”<p>先生曰“野水影残晴树后，家书正写夜灯前。<p><p>六、判三十二相及悟后起修等<p>问曰：“一悟即至佛地，理上耶?事上耶?若理则空头衔耳，何贵有此一佛?若事则三十二相、八十种好、百千三昧、无量功德、自土他土、一切种土，一时具耶，贪嗔痴等一时尽耶。或悟后起修，如修多罗云：理缘顿悟，乘悟并消；事须渐除，因次第尽耶。若次第者，何云顿悟?祈示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人当下识取自心，认取自己，是佛非佛，如理而知，如 实而知，决不驰求，说理说事，总是外觅，讵知非理不事，非事不理，宁有舍事而别有一理，亦舍理而别有一事耶?至三十二相、一切种土等随身玩具，更不足齿。何也?当人只愁不作国王，岂愁作国王而无饭啖乎?一悟喻国王，饭喻三十二相等。古德曰：只愁不作佛，不愁佛不解语。良有以也。又贪等本空，尽从何尽?理顿悟，事渐除，一期权语也，讵实法哉?”<p><p>进云：“云何说为随身玩具?学人不了，请为详示。”<p>先生曰“必曰三十二相八十种好为果乘之极，然则转轮圣王即佛也。转轮圣王即佛，是佛可修而得。佛即属修，有修必有坏。既坏也，何名曰佛?若佛有坏，何贵此佛?讵知是相也，垢腻之衣矣。但得本，一切具足，是衣者用亦得，不用亦得，用不用皆得。何也?王登宝殿，野老讴歌。所谓自南自北，自西自东，无斯不服。当人若非亲证，何能通了?汝穷子也，自未作王，而谓王亦穷子，讵不冤乎?王如上喻明。此曰百千三昧，曰无量功德，曰自土他土，三十二相、八十种好等，不用他求，悉在当人口里。”<p>进云：“如何悉在学人口里?”<p>曰：“塞却汝口，免汝乱统。<p>至以‘理缘顿悟，乘悟并消，事须渐除，因次第尽’为实法者，为悟后起修者，尤可笑矣。何也？不检方便，不计权实，恣情趁块也。余不及，我切切实实问 汝：释迦老子在菩提树下睹明星而悟道后，消消个什么?除除个什么?修修个什么?尽又尽个什么？而证又证个什么？好看，好看，此是第一彻头。”<p><p>“然则果无修无证乎?”<p>曰：“否！否！这些好处，他人言之不及，自检乃亲。若言修证是妄语，若言不修证是妄语，若言修证即不修证，不修证即修证，亦是大妄语。须知他得了的人，恁么亦得，不恁么亦得，恁么不恁么总得。中书堂的事，非十字街头贩夫走卒所能知得底。”<p>进云：“然则最亲一句毕竟如何?”<p>久之，先生曰：“向汝道：向来枉费推移力，此日中流自在行。”<p><p>七、判三关<p>问曰：“宗下悟程初关、重关、牢关等说。竞衔人口，是欤?非欤?若是，与教下三顿之说何异?若非，说三关者妄邪，盲耶?愿垂明示。”<p>判曰：“狮子扑人，韩卢趁块。一物也无，云何曰三?又，既曰宗下，自当远异乎教，若不尔者，何分宗教?必以教下三顿之说而与宗下三关判异判同，以何为平?纵得其平，与汝身心有何饶益?咄！向汝道转解而缚转坚，转辩而义转渊。此是什么所在，说宗说教，说是说非，说异说同，道来、道来。<p>“宗者、释迦老子睹明星而悟此一着子，时之诠语也；教者，以此一着子而教人，令六道四生同证此一着也。讵有他义奇义哉！若然，宗者教之宗，教者宗之教，前已明判，体固非二，用实不一也。用既不一，无论何宗何教，都以扶起破沙炉，使当人把自己足根下一段风流韵事，透顶透底，了了彻彻，为惟一职责。果能了彻，不但分宗下教下三顿三关，不是衍文，不是骈枝，即曰宗上教上千顿千关亦非游词。何也?惟此一事矣。不然，任汝多闻达古今，总是数人珍宝。<p>“况三关者一期方便语，实际理地不立一尘，宁有三乎?雍正曰‘不挂一丝，前后际断、曰初关；山者山，河者河，色声香味触法尽是本分，无一物非我身，无一物是我己，色空无碍获大自在，曰重关；家舍即在途中，途中即在家舍、行斯住斯，体斯用斯，如是惺惺行履，无明执着自然消落，曰末后一关。’末后一关者，今人说为牢关也。等如是说，概属诽语邪词，悉为谤论戏法。至云人人皆有生缘，我手何似佛手?我脚何似驴脚?当彼宋时，天下目为三关者也。而黄龙慧南者又何曾自诠曰：‘我此语句为彼三关或非彼三关耶?’圆悟勤曰：‘渠侬无背面，一镞破三关。’大慧杲曰：‘一簇破三关，分明箭后路。’不快漆桶，三关之说，会来!会来！<p>“当人不检己阙，不迈进程，不抖擞精神透关，日与关吏盘桓，关河邂逅，曰初关，曰重关，曰末后牢关。任汝说尽千关万关，总是说食不饱，何如亲透一关?望前路之悠悠，藐己躬之孑孑，春风秋月逐尔等闲而过，放荡天涯何年返屋?咄！如是昧行，向外咨逞，不曰己妄己盲，而曰人盲人妄者，何欤?诗曰：‘蝴蝶梦中家万里。杜鹃枝上月三更。’甚可怀也。” <p><p>八、判五家宗旨临济三玄等<p>问曰：“临济三玄、曹洞五位、沩仰九十六圆相、法眼六相、云门顾鉴咦等，为宗旨耶?门庭设施耶?有法可授耶?乞示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人倘明得自己，什么临济三玄，曹洞五位，沩仰九十六圆相，法眼六相，云门顾鉴咦等，什么 宗旨，什么门庭设施，什么有法可授无法可授，都为诤语。何也?眼若不寐，诸梦自除；心若不异，万法一如。必曰有宗旨可授，我且问汝三世诸佛究以何者为宗?何者为旨?必曰有门庭可设施，我又问汝门庭又门庭个什么?设施又设施个什么?余姑不论，即以五宗言，宗苟有五而宗旨亦有五也，岂事理哉?讵知五宗所明同此一事，此一事为何事?当人脚根下一段风流韵事故。<p>“雍正曰：‘五宗所明者，同是大圆觉性矣。’大圆性亦是假名，至于门庭设施则又诠曰：‘古人专为剿情绝见，惟恐一门路熟，又复情见炽然，是以别出一番手眼，使人悟取。’彼雍正者造诣固不足称，然拈此处亦有可取，况一切种法原为黄叶止儿啼耶?必曰无宗旨可授，无门庭可设施，亦是大病。何也?春夏秋冬无情者，犹章及时；藏通别圆演教者，皆成妙谛。今曰无，可乎?必曰无，何曾梦见是法?何曾属有无?用时便用，无文字欤！”<p><p>进云：“如是尚矣！沩仰、曹洞、云门、法眼，今且暂搁，临济云：‘大凡演唱宗乘。一句中须具三玄门，一玄门中须具三要义，一要义中有权有实，有照有用。汝等诸人作么生会?’是如实语欤?非如实语欤?若非彼临济者，千古楷模，一代宗匠，宁以非法而示行人章后世乎?若是则是三玄三要者义当何诠?又彼果非也，汾阳昭曰：‘先圣云：一句语须具三玄，一玄中须具三要。阿哪个是三玄三要的句?快会取好。’何欤？又云：‘还有商量者么?有即出来。’时有僧出而问曰：‘如何是接初机的句?’答曰：‘汝是行脚僧。’又问：‘如何是辨衲僧的句?’答曰：‘西方日出卯。’又问：‘如何是行正令的句？’答曰：‘千里特来呈对面。’又问：‘如何是立乾坤的句?’答曰：‘北俱卢洲长粳末，食者无忧亦无喜。’昭复曰：‘只将此四转语验天下衲僧，才见汝来便验得也。’　　“僧又问曰：‘如何是学人著力处?’答曰： ‘嘉州打大象。’问：‘如何是学人转身处?’答曰：‘陕府灌铁牛。’问：‘如何是学人亲切处?’答曰：‘西河弄师子。’昭又曰：‘若人会此三句，已办三玄。更有三要语在，切当荐取，不是等闲。’因颂曰：‘三玄三要事难分，得意忘言道易亲，一句明明该万象，重阳九日菊花新’者，又何欤?又古尊宿有注为句中玄、体中玄、意中玄者。有说为涂毒鼓者、有诠为清凉幢者。灯录所传，指不胜屈，学人浅机，究以何从？若竞以不落有无斥之，则笼统真如，颟顸佛性也。愿明示。”<p><p>答曰：“狮子扑人，韩卢趁块。大慧杲曰： ‘咬人矢橛，不是好狗。’向汝道 当人倘把自己脚根下一段历历孤明的大事了彻，何用不臧?自家宝藏，何用不具？何必食人余唾，饮人残羹?不然慢云了此三玄三要，纵把沩仰九十六圆相、曹洞五位、法眼六相、云门顾鉴咦，乃至三藏十二蕴在胸中，宿在脑内，圆圆如涵珠，滚滚如翻海，总是不快漆桶，所谓痴狂外边走也。讵知一句明明该百亿乎?“是法也，已如上说，不可言有宗旨，不可言无宗旨，不可言非有非无，即有即无等为有无宗旨，门庭设施亦然也。如不尔者，悉为邪说，统称魔法。何也?榛芜向上一着矣。向上一着既已榛芜，即属瞎却人天眼目。既瞎彼眼，自眼岂明? 非仅遗讥大雅，将必果遭显祸。临济三玄四料拣，曹洞五位君臣王子，乃至云门顾鉴咦，国师三唤侍者，婆子烧庵，女子出定，犀牛扇，吃油糍，野狐托钵，斩猫，难产，子湖狗，秘魔叉，禾山鼓，慈明榜，香岩上树，资福闭门等，口不胜说，笔不胜书，皆一期方便，接引初机，应病与药之谈，宁有实法名宗旨名设施耶?所谓宗旨所谓设施者，皆对方一期方便安立之假名耳!彼临济、彼曹洞等，宁自诩曰某吾宗旨也，某吾门庭设施也乎?不然迦叶不言三玄，六祖不说五位，是二大人者，为不明宗旨而无设施矣?可乎?可乎?<p>“若然，执此为方便之假名，非向上之真谛，尤为铸错。何也?向汝道非离真而有处，立处即真矣，须知真依假有，假以真名，假者真之假，真者假之真，伸手缩手，义不离臂，曰真曰假。理岂远心?是三玄、五位等，苟以真假权实玄妙非玄妙等名，加他分上，不得曰涂毒鼓、曰清凉幢等，当人自检。昔大慧杲颂佛性，泰和尚曰：‘惯说五家宗派禅，不将玄妙与人传。晚年一着真奇特，食罢长伸两脚眠。’又幻寄曰：“欲契三玄三妙义，请看金色笑拈花。窥鞭良马今何在。高树扶疏挂晚霞。’了此为宗旨为非宗旨?为有法授为无法授?为门庭设施为非门庭设施?不鉴而明。不卜而信也。”<p>进云：“如示信矣，然则毕竟一句究作何道?”<p>曰：“一句却不知，两句或可也。”<p>进云：“何为两句?”<p>曰：“唐人两句，”<p>进云：“如何是唐人两句?”<p>先生曰：“落花踏遍游何处，笑入胡姬酒肆。”<p><p>九、判行棒行喝<p>问曰：“行棒行喝，唐宋炽然，于古未有，于今阙如，道固何欤?愿赐明示。”<p>　<p>判曰“狮子扑人，韩卢趁块，转解而缚转坚，特辩而义转渊。唐宋两代宗师接人多假棒喝，汝即兴疑，昨雨今晴，汝胡不问?向汝道一期方便，用黄叶止儿啼，于此乱统，有何了期?用棒之显著者，（井刀）于六祖接神会，倡于临济而盛乎宋元明清。清之季此风则渐寝也。于古未有，讵知于古未有者实多?大炮飞机，古未有也，声光电化等学，古亦未有也。于今阙如，不但恐龙麟凤于今不有，古也实多，而尧舜禹汤周公孔子者，古之人也，今亦阙如，汝胡不问?汝胡不疑?当人果尽扪心，过在何处?若检得过在，古或非无，今亦非有也。如何，如何，道来，道来。<p>“讵知唯汝有此一问而棒兴，难汝有此一疑而喝兴。始无汝问汝疑，此棒此喝，不但不兴，即兴也，向何处安立?于此荐得，许汝粗知少分；此而不荐，牛胎马腹地狱畜牲，他时后日，自有汝亲证的时节，莫谓余言不先也。”<p>进云：“学人浅机，实不能契，愿垂明示。” <p>曰：“一心不生万法无咎。”<p>又曰：“至道无难，惟嫌拣择。彼三祖者，固已朗言明示，何用再饮恶水?须知影由形起，响逐声来，倘形声两忘，影响何寄?必曰行棒喝，昔在北齐天保之初有向居士者，二祖为之证可，只睹一书，不但一棒未行，一喝未信，而一面亦未觌也。必曰非棒喝，风穴沿者，传大统之龙象也，向使无廓侍者之激发，而借警于南院之一棒，临济宗旨宁秀到今?识者早知其遇风而息也，等如是说。行棒行喝，古无今阙，当人自悉。何也?影由形起，响逐声来矣。” <p><p>或曰:“唐之前,人心敦厚,一语契机，遂尔归家稳坐,更不驰求。唐之后,人情狡黠，未得饰得,每每捃摭攘窃，预备应机。以大慧杲之贤，初见佛果，犹厚颜下四十九转语；张无尽之慧，已亲兜率，尚滞半途。机锋棒喝应运而兴，不其然乎?”<p>曰：“似也！似也！非是矣，非是矣。夫棒喝机锋所以启向上关枥），而诱掖学人别行一路，踏毗卢顶上者也。若然三藏十二部何一而非机锋?何一而非棒喝?曰唐宋前，曰唐宋后，与是棒喝者 有何交涉?矧曰于古未有，于今阙如邪?讵知是法也亘古至今而不逾，何代未有？何世阙如?顾显著者易譬，不显著者易忽矣。必于此而兴疑，昨雨今雨晴，云胡不疑？” <p>进云：“如说信也，此云向上关枥），踏毗卢顶上行者，何耶？”<p>先生曰：“不知何处吹芦管，一夜征人尽望乡。”<p><p>十、判悟后起修化报<p>问曰:“行人悟后起修化报,事不必无,如西土锗祖,临命终时,大都摇身虚空，作十八变，此土初祖只履空棺，六祖伏龙出水浴衣等。际此而后，代少有闻，咸谓五祖传六祖，六祖永不传。今此宗门专擅修心，不知修身。心者性也，身者命也。然否？祈示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人只知只履空棺，摇身虚空作十八变，汝亦知乎一念明心，百变千变，八万四千变，乃至尘尘刹刹，刹刹尘尘，一尘一变，一变该八万四千变，八万四千变入此一变，而此一变又丝忽朕迹，不留一星，名相不寓乎?若知匪持，分说这一络葛藤是无疾而呻，当面说诳，而释迦老子亦虚说十二部经，空言三藏故也。既不知也，必任性驰求，学禅学道，学佛学祖，学贤学圣，学玄学妙，任人指使，任人愚弄，波波一生，长作天涯游子，头头俱失，甘辞堂上主人，讵不冤乎？亦可悯矣！必以十八变为佛，然则十字街头白纸变蛋之乞几，贤于饮光，等于迦文也。<p>“当人学释氏之道，何必深涉教言，亲证定慧，但向乞儿处求解脱，了生死可 也。此既不可，何有是处？古德曰：‘只愁不作佛，不愁佛不解语。’仰山曰：‘但得本，不愁末。神通妙用是圣末边事。’不快漆桶，说道一句看?此犹空言也。昔者世尊在法华会上，度个妙龄女子成佛；在涅槃会上度个广额屠儿成佛。彼一女子、一屠儿者，固未茅山学道，千里决玄也，亦无取坎填离功用，修气修脉进程，但只信得及耳，便能坐断报化佛头，径超生死关木戾）。不快漆桶又试逐一句看?临济云：汝若念念歇得驰求心，即与释迦老子不别；七地菩萨求佛智心未满足，谓之烦恼。若然既与释迦老子不别也，岂于此一十八变而又别耶?求佛智心未满足者，犹云烦恼，岂求此十八变等不云烦恼耶？既云烦恼是求佛陀者为求烦恼，南辕而北辙也，不亦大可哂乎? <p>“智者大师证法华三昧，见灵山一会伊然未散。未至者诠为表法。无尽张居士闻《首楞严经》至‘是人始获金刚心中’处，忽思智者当时所证非是表法，因谓大慧杲曰：‘当真实证人时全身住在金刚心中，李长者所谓无边刹境自他不隔于毫端。十世古今始终不离于当念也。’自他既不隔于毫端，始终又不离于当念，彼十八变等为具为不具?当人，当人，道来，道来。<p>“如是种说，犹曰明心之开士也，汝亦知乎？未明心者亦百变千变八万四千变， 乃至尘尘刹刹，刹刹尘尘，一刹一变，一变该八万四千变，八万四千变入此一变，而此一变亦丝毫朕迹，不留一星，名相不寓乎?若知，许汝踏毗卢顶上行，从绿阴丛里过；若不知，腊月三十到来，阎王老子与你打之绕，莫怪佛法敌不过生死。<p>“至云六祖永不传修命之学，专擅修性之长，尤为小儿女语，非大大夫言。何也?二法矣，讵知舍性而命何托?舍命而性何张?性命，固非一 然又不二也。翻手作云覆手雨，云雨虽殊，手岂殊?五祖传六祖，六祖永不传者，盖衣钵耳。《坛径》记录甚明，阅之自悉。若曰当人脚根下一段风流大事，一切圆成本自具足，所谓现成 公案者也。既曰现成公案讵曰能传不传乎?<p>“若然，传不传皆赘语，而悟后起修化报，尤为远道之谈，何也?悟且无，后何有?况修耶?曰修化报者，盖不明法身为何物也。若明则修不修皆戏论，讵知幻化空身即法身乎?”<p><p>“然则是法身也明从何明?”<p>先生曰：“上穷碧落下黄泉，两处茫茫都不见。” <p>十一、关于禅宗支分具否<p>问曰：“释迦四十九年行化，三藏十二理树风规，一行万行，事理条析。今曰不假修治，见性成佛，颇有议其支分不具，斥为破碎，大乘者然否?乞示。”<p>判曰：“狮子扑人韩卢趁块。真小儿女语，非大丈夫言。试问当人，释迦四十九年行化，行个什么化，若言有化，平地吃仆；若言无化，平地吃仆；若言非有非无，亦有亦无，亦平地吃仆。何也?盖汝不会释迦四十九年行化，不行化也。此既不会，修治不修治，见性不见性，成佛不成佛，乃至支分具或不具，汝又从何会?既不会也，而轻议其破碎，非曰无知下劣疯憨狂吠，实毁谤般若，无间地狱种子也。<p>“咄！魔子，魔子，何尝梦见大乘来？大乘且未梦见，曰破碎，曰不破碎，曰支分具，曰支分不具，谓非趁块韩卢可乎?扑人狮子固不尔也也。讵讵知吾宗有千圣不传之向上一路?即饶净名居士到来，亦须缄口毗耶；纵教妙德空生，临此当云赞叹不及。他不具论即以一喝法门而言，当人果有丝毫心肝，亦当胡跪致命，尚能妄议支分不具，大乘破碎者欤?谛听！谛听！吾与汝举一故事来。<p>“在彼宋代有净因继成者，同圆悟、法真、慈受并十大法师禅讲，千僧赴太尉陈公之斋。有善华严者，贤首宗之义虎也，对众问曰：‘吾佛设教，自小乘至于圆顿，扫除空有，独证真常，然后万德庄严，方名为佛。尝闻禅宗一喝能转凡成圣，与诸经论似相违背。今一喝能入吾宗五教者，是为正说，若不能入，是为魔说。’时诸禅德，目注净因，净因乃曰：‘如法师所问，不足三大禅师之酬。净因小长老，可以使法师无惑也。’因召善， 善应诺。<p>“净因曰：法师所谓愚法，小乘者乃有义也；大乘始教者，乃空义也；大乘终教者，乃不有不空义也；大乘顿教者，乃即有即空义也；一乘圆教者，乃不有而有，不空而空义也。如我一喝非惟能入五教，乃至工巧伎艺诸子百家悉皆能入。’于是震声一喝，问善曰：‘闻么?’曰：‘闻。’净因曰：“汝既闻此一喝，是有能入小乘教。’须臾又问善曰：‘闻么?’曰：‘不闻’。净因曰：‘汝既不闻，适来一喝是无，能人大乘始教。’遂顾善曰：‘我初一喝，汝既道有，喝久声息，汝复道无，道无原初实有，道有而今实无，不有不无能，入终教。我有一喝时，有非是有，因 无故有；无一喝时，无非是无，因有故无，即有即无，能人顿教。须知我此一喝不作—喝用，有无不及，情解俱忘。道有时纤尘不立，道无时横遍虚空。即此一喝入百千万亿喝，百千万亿喝入此一喝，是故能入圆教。’<p>“善乃再拜，净因曰：‘’非唯一喝为然，乃至一语、一默、一动、一静、从古至今十方虚空，万象森罗，六趣四生，三世诸佛，一切圣贤，八万四千法门，百千三昧，无量妙义，契理契机，与天地万物一体，谓之法身；三界唯心，万法唯识，四时八节，阴阳一致，谓之法性，故《华严经》云：法性遍在一切处。有相无相， 一声一色，全在一尘之中，含容四义，事理无边，周遍无余，参而 不杂，混而不一，于此一喝中皆悉具足。犹是建比门庭，随机方便，谓之小歇场，未至宝所。殊不知吾祖师门下，以心传心，以法印法，不立文字，见性成佛，有千圣不传底向上一路在。善又问曰：‘如何是向上一路?’净因曰：向下会取。’善曰：‘如何是宝所?’净因曰：‘非汝境界。’善曰：‘望禅师慈悲。’净因曰：‘任从沧海变，终不为君通。’善胶口而出。<p>“如说只一喝也，支分具欤?非欤?抑破碎欤?在汝漆桶必自讼曰：此一喝也，那 有如许多妙义玄言，不过当局者润色敷饰，逞快词耳’。讵知此一法门不但净因一口一人道不尽，量不及，纵饶三千界微尘众，一尘一世界，一世界尽净因，合力共口亦道他不尽，量他不得，况曰润色敷饰，逞快口耶?即道得量得，然犹滞此一法门也。而吾宗法门以有言，尽空有，遍尘劫，无一事无一理而非此法此门；以无言，不但无即法门，而无亦无，悉是法门。不快漆桶，汝梦亦不能及也。曰支分不具，曰破碎大乘，谓非趁块，得乎?咄！断人慧命，业堕无间。<p>“不然，睹明星而悟道，因野鸭以知心，释迦百丈支分皆为不具，皆为破碎矣。何也?未念嗡阿吽，未修生圆二次第，未念阿弥陀，未说种子缘生，未讲三观三止、四法界、二空、四谛、十善、三十七助道也，讵不谬哉?亦可笑也。”<p><p>进云：“然则毕竟一句，究作何判?”<p>先生曰：“时人不识余心乐，将谓偷闲学少年。”<p>　<p>十二、判止观话头为同为异<p>问曰：“话头止观，为异为同?若异，岂止观外别有初机入德之胜行?若同，曰止曰观，无数次第，彼一话头讵能兼摄?如何?乞示。”<p>判曰：狮子扑人，韩卢趁块。转解而缚转坚，转辩而义转渊。当人不识止为何止，观为何观，既不识此止观，而于话头法门，当然铸错。既铸错也，乱驰乱统，不亦宜乎?止者，心一境性；观者，抉择法慧。知心一境性，何止非观?能抉择法慧，何观非止?若然，止即观，观即止，何一话而非止?何一头而非观?止观双运，话头之的趋，遮照同时，话头之权巧；竞万流而总汇巨溟，话头之统摄，无一物而独耀灵府，话头之上阶。夫如是也，曰异、曰同、曰次第、曰非次第、曰兼摄、曰非兼摄，不快漆桶，道来，道来。” <p>“曰止、曰观、曰话头，说多说寡，说异说同，要在当人明自本心见自本性之敲门砖耳。敲得门开，无论止无论观，无论话头非话头，悉为胜法，谁有闲情课汝次第多寡、法门异同！如开门不得，任汝同、任汝异、任汝多、任汝寡，而于当人身心分上有何饶益?讵知万法本闲，仁者自闹，境无美恶，去取惟心乎?明此则先天地不云老，后天地亦不云小，尽尘沙而一数已无，亡丝忽而万流竞好。若然话头即止观止观即话头，止观话头虽非一，然又不二也。曰同、曰异、曰次第、曰非次第、曰兼摄、曰非兼摄，不快漆桶，又试道一句看。”<p>进云：“如说尚矣，学人浅机，实难凑泊，愿当下全提，就体直截，不落途程，一句觌面，亲指如何?”<p>先生忿然曰：“咄！宁有是事?分付河山开曙色，明朝游子动归舟。” <p>十三、判上根下劣<p>问曰：“禅宗尚矣！然是宗者，接上上根人于机不普。故卢公能曰：‘汝师接 上根人，吾接上上根人。’然上根犹少，悉属中下，矧曰上上。吾侪末学，望而莫阶，知难而退分也。非为长者折枝，实乃挟山超海。如何?祈示。”<p>判曰：“狮子扑人，韩卢趁块，吾纵有口从何剖说?向汝道：转解而缚转坚，转辩而义转渊。谁为上智?谁曰下愚?上已明析今又再食唾余，究何心乎?汝知吾宗接上上根人，然亦知夫吾宗者专接下下根人否乎?若知，许汝千劫不认识吾宗；若不知，许吾宗千劫不认识汝。何也?语证则不 可以示人，说理则又非证不了。汝不于证上取圆，恣情向理中求碍，非余摄汝之计穷也，即释迦老子到来，亦必回头返走，大 声而呼曰：乌乌，头痛，头痛。”<p>“夫上上根人觅自已无，何有于他?既无自他，谁为接者?谁受接者？为非上上而中下而下下也，吾宗之立遂尔当机而应，不然无的而发矢矣，何有吾宗?讵不谬哉?况上以下言，下因上有，上下假名，何有是处?既无上下，焉有如许闲汉于汝分上说上说下，说利说钝耶?然则果无此上下利钝乎?是又大坏名言而破世间相者也，讵知曰上根、曰下根、曰钝、曰利者，皆自限者懈怠之私论，徘徊瞻望之虚计。若是学道须是铁汉着手，心头便判，直取无上菩提。一切是非莫管的汉子，逢关夺关，遇县掠县，直向归家道上迈进，乌有闲情说上说下，说利说钝邪?既说利钝上下也，必是长落天涯之客，绝非回向乡山之人，可叹！可叹！<p>“夫根利根钝，上智下愚，匪依他立，实因己名。长落天涯之穷子，未返回车即钝根，即下愚 也；倘一思返，且不云风雨载途，即曰利根，即曰上智。何也?有回乡之念，必启载道之行，有载道之行，必有归家之日，是上下利钝之判，在当人一心之转矣，非有实法曰某利也，某钝也，某某上智下愚也。不然彼香岩者，于百丈下问一答十，问十答百，亦今之人所谓上智利根者也，然终百丈之世而一无所入； 金陵婆子闻乞儿一唱而了心宗，郑十三娘于沩山一问而知极则，他如龙女妙龄，屠儿广额者，灯录所传，指不胜收，谁又利根上智，谁又钝根下愚?故曰辔回车：下愚即上智；落天涯，上智即下愚。今曰利钝上下、折枝超海等说，一派胡言，谓非自限，谓非自懈，可乎?难易之趣，实当人一心之行，何能妄引六祖言章?若此心不行，纵将千圣语句将来，从何凑泊?噫！曹溪波浪如相似，无限平人被陆沉！”<p>十四、判定慧双修及教外别传<p><p>问曰：“有定无慧，诠曰死水；有慧无定，佥曰干慧。定慧等持，方合乃辙。故六祖能曰：‘双修是正。’若然教已滥说，胡云教外别传?祈示。”<p>判曰：“狮子扑人，韩卢趁块，转解而缚转坚，转辩而义转渊。当人以何者为定?何者为慧?何为宗?何为教?何为传?何为不传?又以何为修？何为别邪?若曰有定无慧，然则能定者非慧而何？必曰有慧无定，然则能慧者非定而何?宗不因教，宗从何宗?教不因宗，教从何教?宗者明释迦老子在菩提树下夜睹明星而悟此一着也，以此一着而示人，今天下后世翕然风从，明此一着者教也。若然宗者教之宗，教者宗之教。上固已明剖矣，今犹云云者，何欤?趁块也。明此一着，传不传皆戏论，修不修悉妄语，况所谓双邪?别邪?”<p><p>进云：“曰定曰慧曰双修，如说尚矣！然则教外别传之旨，义尽斯欤?或未至也?愿为开说。”<p>曰：“此教外别传于焉而懋也，何也?倘无汝此一问，不但教外别传之旨水月空花，而此云教者亦眼底浮云，空拳捏怪也。知此则教外无教，教内无教，教内教外总无教。惟无教也，别传之旨焕然成章，日丽天，月印海，尽汝诸人恣取，穷劫而不能罄矣。”<p>“然则云何曰别?” <p>曰：“凡教所有者，我宗非有，曰别；凡教所无者，我宗非无，曰别；凡教所有者，吾宗尽有，教所无者，我宗尽无，曰别；巧至一切非有非无，尽大地遍尘劫，如所有尽所有，如所无尽所无，皆具而皆不具，曰别。不然，达摩空来东土，二祖 必往西天也。今之人欲以教而诠吾宗者，是持管窥天，多见其不知量，而未梦见别传也。今之人欲以吾宗而同于教者，如盲说象，多见其不知量，而亦未梦见别传也。”“昔世尊在灵山会上，拈花示众，是时众皆默然，唯迦叶尊者破颜微笑。世尊曰：吾有正法眼藏，涅槃妙心，实相无相，微妙法门，不立文字，教外列传，咐嘱摩诃迦叶。’此释迦老子亲口吐出‘不立文字，教外别传’八字，试问当人，楷则尚在，传又传个什么?别又别在何处?若言有传有别试通一袭好音看?”<p><p>“然则无传无别乎?” <p>曰：“否！灵山会上百万人天，世尊缘何拈花?迦叶依何微笑?彼时龙象蹴踏者，固不仅迦叶一人也，世尊独曰吾有正法眼藏，教外别传等付嘱摩诃迦叶者，何欤?不快漆桶又试通一袭好音看。又世尊一日升座，迦叶白椎曰：世尊说法竞。’便下座。又世尊一日敕阿难曰：‘食时将至，汝当入城持钵。’阿难应诺。世尊曰：‘汝既持钵，须依过去七佛仪式。’阿难便问：‘如何是七佛仪式？’世尊召阿难，阿难应诺。世尊曰：‘持钵去！’不快漆桶，你又看这两则公案，是定是慧，是双修是单提，是教外列传是教内同传?真可笑也！”<p><p>进云：“然则毕竟—向如何?”<p>先生曰：“咄！倘许安心是灵药，一川明月涨遥天。”<p>十五、判禅宗阶位<p>问曰：“三贤十圣，阶段历然，是禅宗者得成办已，究属何位?何阶?何贤?何圣?渴望明示，开众巨惑。”<p>判曰：“狮子扑人，韩卢趁块。当人本心不明，纵饶将千贤万圣等差同异蕴在胸中，有何饶益?且益滋蔓也。故曰：转解而缚转坚转辩而义转渊。余姑且而不论，即当人现前问话一念，是何贤?是何圣?是何阶?是何位?速道速道！若道得，当下不立阶梯即正大位；若道不得，总是落天涯的浪子，数人珍宝，煮沙为饭。”<p>进云：“学人道此语不得，请代道一句如何?”<p>先生曰：“丑！锦官城外柏森森，谁有闲情代汝答话?”<p>进无语，逡巡欲退，<p>先生曰：“止止！姑无退，姑无退，恣汝所求，但莫谓余以恶水相加也。“草木犹现枯荣，风云尚张否泰，鸟兽昆虫优劣还显：小人君子善恶自殊，况踏毗卢顶上客，咸推了事人而无阶而无位者乎?若无位，则减一法也，岂教外别传之胜旨哉?讵知是法也，罄尘劫，遍空有，圆圆如随珠走盘，历历若水银泻地。未成办此一着，或在途间，或未升堂，固不具论；若已成办，所谓得忽的一下桶底脱落者，一时住在金刚心中。李长者曰：无边刹境，自他不隔于毫端，十世古今，始终不离于当念。’一切现成，不假他借，更有何贤何位何阶何圣而不阶而不 位乎?诗曰：尽日寻春不见春，芒鞋踏破陇头云。归来自把梅花嗅，春在枝头已十分。’不着问人，当人自合开口大笑！讵曰破颜邪?“若然，形形色色，影依镜显；有有空空，义岂离心?汝在何位彼在何位，汝无何位彼无何位。当人苟在信位也，以视乎彼，彼亦在信位；苟在向位也，以视乎彼，彼亦在向位；苟在住位也，以视乎彼，彼亦在住位，乃至汝在初地十地等，而彼亦在初地十地等。汝佛而彼亦佛，汝魔而彼亦魔，汝盗而彼亦盗，随处该名，有名即位,尽尘劫，遍空有，无一而不位，无一而不 阶，固所谓—月普摄—切水，—切水月—月摄者也。曰海、曰河、曰溪、曰渎、曰粪池、曰污沼、曰残涸、曰澄潭，水名虽异，月岂有殊?况形形有月印，处处无迹留邪?不快漆桶，何为阶?何为位?何为贤?何为圣?又试道一句看！<p>　咄！白鹭下田千点雪，黄鹂上树一枝花。”<p><p>十六、判授受<p>问曰：“既成办已，然佛心灯，续人慧命。师家所授，究依何法?若无授者，雕虫小技，尚承亲口；若有授者，千古续灯，未闻有则。如是巨疑，四众久伏，愿闻明示。”<p>判曰：“狮子扑人，韩卢趁块。向汝道转解而缚转坚，转辩而义转渊。彼雕虫小技尚承亲口者雕虫小技也。此曰雕虫小技可乎?纵曰此即雕虫小技，雕虫小技决非离此别有。须知雕虫小技者亦无授无受，不然弟同于师，而不贤逾师，弟等于师，而不不肖于师也，讵理事哉?为无授无受也，万派斐然而成章一行，卓焉而普迈。如实而授受如是而授受，世灯心灯不续而长明，不燃而自照。所谓其为物也不二，则其生物也不测矣。故曰有授受，是愚夫法，非圣人法，是有为法，是无明法，非无为法。“必曰有授有受，然则黄梅曹溪人室夜半，初祖二祖得髓安心，乃至警语闻于楼中，扇摇契于江外者，又以何法为授为受邪?大慧杲曰：‘古人见你迷却路头， 为你作指路人耳。’实无禅，实无道，实无心，可以传，可以受。才说有传有受，便是邪法。说理说事，说正说邪，悉是非法,那堪更说有玄有妙，可以授可以受乎?古德云：‘说个学道，早成接引之言，况其余邪?又释迦世尊在华严会上度一童子、涅槃会上度一屠儿、法华会上度一妙龄女子，但只云：‘我今为汝保任此事终不虚矣’，亦未闻有何法可授也。既无法授，汝从何受?心灯世灯续乎非乎?道来，道来。<p>“必曰无授无受，然则威音王后，无师自证悉为天然外道者，又何邪?讵知为无授也，而学人如所有尽所无，而大受为无受也，而师家如所无尽所有而罄授，何也?君臣道合，法尔圆成，一切具足，不假他求矣。不然别传宗旨宁轮到今?昔者黄檗问于百丈曰：‘从上古人以何法示人？百丈据坐，黄檗云：‘后代儿孙将何传授？’百丈拂衣便起云：‘我将谓汝是个人。’又临济将灭，顾谓众曰：‘吾灭后不得灭却吾正法眼藏。’三圣出曰：‘争敢灭却和尚正法眼藏。’济曰：‘以后有人问你，向他道什么？’三圣便喝。济曰，‘谁知吾正法眼藏向这瞎驴边灭却！’当人倘把这两则公案会得透透彻彻，曰授受，曰非授受，曰灯续，曰灯不续，如观掌果也，讵问人乎？如会不得，透不彻，纵饶一字一释，一释百言千言万言，于汝身心有何 饶益？”<p>进云：“如说尚矣！然则离四句，绝百非一句复为如何？”<p>先生曰：“西施村冷寥天月，勾践城寒广陌霜。”<p>十七、判丹道<p>问曰：“宋张紫阳以宗旨与金丹并举，治其学者谓宗旨只明得心上工夫，心上工夫名曰修性，而不能起身上妙用，身上妙用名曰修命。修性而又修命，滞在空处。于是肆谈龙虎，艳说坎离，曰炼精化气，炼气化神，炼神还虚。又曰火侯药物，非师奠传，非人莫授，而其徒有诋吾宗惟论见性，不知修命者，且云：既不修命，纵极其至，不过坐脱立亡，乌能分身万亿，神变无方？今也人百其口，莫不云云，共 疑久矣，为是为不是，愿垂明示，开此巨惑。”<p>判曰：“狮子扑人，韩卢趁块。转解而缚转坚，转辩而义转渊，当人但明自心，一切了毕，何暇与人逞辞肆舌，说是说不是？既说是说不是，必自不是，且莫课人是不是也。讵知我法中无如是是，亦无如是不是邪？倘摸着向上关木戾），不但丹道为是，而百工伎艺、声光电化乃至风云雷雨一切有情无情，悉无不是也。反之，而不游乎堂寝，踏向毗卢顶上者，纵将阿弥陀佛，释迦老子吞向腹中，亦是不快漆桶，所谓痴狂外边走也。何有是处？说性说命，有何饶益？曰是曰非，悉为戏论。 故大慧杲曰：‘岩头划之，曰是句非句：临济用之，曰三要三玄。’不然，苟以实法与人，必曰某也实为丹，某也实为道，某也实为龙虎、坎离、铅汞、阴阳等，不但自眼未明而瞎人眼，亦断人慧命，业必堕于无间也，吁！一字注错，身堕野狐。炯矣！戒哉，戒哉。”<p>进曰：“彼家者言：性，理也；命，气也。只理无气，流行之用何张？只气无理，主宰之功何显？合则两美，离必俱伤。又以抽象言曰性命，就具体说即身心，性之显曰心，命之显曰身。身心合一，说曰性命双修。若不修者，超凡之说妄，而菩萨不行六度也。若曰修者，必有进程。既有进程，必有多名。程也者，当人既由 先天乾坤一交而为后天坎离也。今欲神游无极，而路必借返于抽坎填离，以复乾坤。此抽坎填离而复乾坤者，程也。后天而进，复先天功用之进程，亦曰修也。曰坎离，曰铅汞，曰龙虎，曰乾坤，一切种名，悉表性命，悉表阴阳。<p>“就其体言曰乾坤，即其用说曰坎离，铅汞者，未采取之权名；龙虎者，已交情之显象；归其极，称云性命；相之错综，曰阴阳。阴阳合一名金丹，一名太极，得之则长生，失此必轮回，此理之全，似无可破者。至于合一之要，必守中抱一，收视返听、到无念无息时，则阴阳交，水火济也。阴阳交、水火济而双修之功自全， 合一之果乃获，等如是说，自合胜行。若曰断人慧命，若曰野狐见解，又乌乎其可哉？”<p>先生曰：“咄！摸着向上关枥）明自本心者，作如是语句乎？真小儿女语，非大丈夫言！固不仅邪说诐词也。谛听！谛听！今以四说略开汝惑。<p>“一，彼说不识本体绝待，安立性命为二，讵知性者体也，命者用也，无体而用不显，无用而体不彰也。是性命者，随处立名，立名即真如。当人自身实有多名，汝父母呼汝曰儿，汝子女尊汝曰父，兄曰汝弟，妻称汝夫，父儿夫弟名也实多。于汝自身岂有多？汝若多汝者，名言乱而事理背也，讵理事乎哉？故曰，随处立名， 立名即真，体实非二，用固不一。然此亦就其著者而说也。若以未著言，用亡而体亦不可得。体既不可得，性于何有？况命邪？性命既云虚立，双在何处？修从何修？既无从修，曰炼精化气，曰炼气化神，曰栋神还虚，无疾而呻也【学人于此千万不要妄怕妄计，落空滞空等障，倘能舍却性命，蓦地直下即便归家凰坐也。讵有他哉？千万千万，此是第一彻头，倘龙成而怖，决非丈夫】。不然，不快漆桶试道一句看。故曰不识本体绝待，妄立性命为二。曰金丹、曰太极，果有如是实法邪？亦可哂也。<p>“二、只知无念之无念，不知有念之无念。何也？盖不明得本休也。既不明得 本体，即不识何为有念，何为无念，曰抱一守中，曰收视返听，曰无念无息，一派胡言。在彼执为胜法者，于过量人分上观之，为黑山鬼窖里作活计，为抱石头，为绝气息的死人，纵下万分资格与之评一善价，极其至，不过小乘定，人天果耳，乌足以登大雅之堂，入超人之室哉！不然，门外巨石自开辟至于今日，皆在无念无息中，为得胜果也，可乎？可乎？若可，当人求解脱得胜果者，向石头处取证可也，何故亲投吾处？讵知吾宗有念时纤毫不立无念时遍界不藏，头头非取舍，处处失有无，有时用有作无，有时用无作有，有时有无两用，有时有无两不用邪？至火候等 秘，非师不传者，讵有他哉？实则无念之功须当人自力，师不能代矣。不快漆桶，若云别有奇特，又试道一句看。咄！汝只知无念之无念，不知有念之无念。蠢哉！蠢哉！陋也！陋也！<p>“三，彼说极果，纵其至，俱生无明耳。何也？处处在身心合一上乱讨乱咬矣。试问漆桶，汝哪一口、哪一时、哪一刹那，汝身汝心曾分离来？分者，别乎合也，汝身与心既已云分，拖此一幅死尸来与余亲谈，对面者谁邪？谁邪？若然是身心者，本来未分，今胡曰合？既曰未分，且不云修双从何双？等如上说，自且不明，斥他 滞空，真燕雀而笑鹏博，井蛙而嗤天碍也，不亦大可哂乎？故曰：彼处处在双修上用功、合一处着力者，纵极其至，俱生无明也。噫！恐汝辈只在分别我执上作活计耳，而于俱生无明且或未梦见也。如此陋质，妄议高明，方以东施效率西子，抑已拟人而失伦也。况反饰邪？“四，耽着阴阳交媾之乐，身见难忘，处处着竟失心，至难认识本体，身见不忘，门由何人？况余邪，总如上说，遍体皆污，洗不胜洗，若欲罄斥，实无闲情。讵知吾宗一派圆成，万胜不居，随处立体。此体即用，乾坤可为用，坎离可作体，气可说为心，心可名为气。拈一尘该百千三昧无量刹尘。以 百千三昧无量刹尘入此一尘，尘尘刹刹，刹刹尘尘，无不显法尔之全，君子之大。然于一切事理，一切名言，各住各位，又丝忽不紊。”<p>进云：“如是如是，然则丹道之说邪，味之者鸩也。”<p>曰，“否否！为少数行人半途之戏具，非达天德者及寝之良规。若曰全消，万行门中少此一法；苟云节取，实际理地多此一尘。曰少曰多，悉非我法，慎勿寐言。”<p>进云：“若然，我法一句重作何道？”<p>先生曰：“三要印开朱点窄，未容拟议宾主分。”</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "黄叶闲谈",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>　　　　　　　　　　　袁焕仙　南怀瑾<p>第一讲 缘起<p>　维摩精舍第一届行七已，诸子日集，每兴难问。<p>　若曰：“向上一路，千圣不传，然则入者何入？趋者何趋？百工之术尚有径循也，矧单提之的旨，万有之至行，可以入而无户，由而无道乎？”于是咸趋座下礼问。 <p>　先生怫然而起，翻然引去。诸子自恣，莫岸其涯。如是数日数问，莫闻其旨。中秋之前夕，庭桂宵馥，砌兰夜芬，共茗月下，中间如前。<p>　先生曰：“凡有言说都无实义，何有吾宗？”<p>　进曰：“若然，无言无说即实义，即宗旨，即阶道欤？”<p>　曰：“有且非，况无邪？”<p>　进云：“行人但有言时不作有想，无言时不作无想，即实义，即宗旨，即阶道欤？”<p>　曰：“有有有无，益增乃病。”<p>　进曰：“噫！我知之矣。有无不拘，一派圆成出主人奴，法尔如幻，的实义，的宗旨，的阶道矣故六祖能曰：‘有无皆不立，长御白牛车。’如何？” <p>　先生曰：“止！止！学般若人慎勿如是戏论，如是谤言，如是恶口。倘不自悛，讵曰遗讥君子实亦果遭迂曲。”<p>　问者大惑，益阻，复礼而叩曰：“学人愚昧罔测幽遐。愿先生哀我赤忱，并矜来学，令未入者思入，思入者能入，能入者升堂及寝而得入，用光前烈，为章后世。”<p>　如是数请，先生以手拈须，以目顾众，久之乃曰：“此事人人具足，个个圆成，不趋己入，说个直超，早已成了接引之言，方便之语。何也？所谓法身、化身、报身、秽上。净土、实报庄严土、常寂光上，一切一切已举未举，无不等现，法尔圆成，不从人得，不因师授，不以己求，实无修证，千圣所由，诸佛共履，而当人偏偏要入许多，知许多，见许多，奇特不奇特？到他分上遂弄成人人不知具足，个个不悉圆成，于是乎入不得入，信不自信。奇言妙义兴也，魔外邪正之立，三藏十二文字语言，非文字语言兴也。实际理地那有如许多事来？先圣悯之，为设檀度；上中下乘，为利初机；戒定慧学，乃诠共德。就自肯之浅深，假立阶梯；因入德之难易，权称顿渐，实无实法，宁有要门？当人果能于此一觑觑破，一了了却，不但一切经，一切论，一切临济三玄，曹洞五位，沩仰圆相，云门鉴咦，一切是法非法，胜法劣法等等皆成话柄，而当人自身亦成话柄也。人从何入？趋从何趋？果有入路，或有趋程，诸子诸子，入未入来！”众无语。 <p>　先生复曰：“苦言能入，龟毛千尺：若言不能入，不特佛法无灵，而且兔角万寻。”<p>　“然则究竟一句毕竟如何？”<p>　先生曰：“向汝道：木樨花开八月秋。”<p>　诸子复请未已，久之，　<p>　又曰：“余己罄量敷陈，脱体开说，而犹云云者，何邪？百无可己，于是以四讲而权开一门，假说五法，择拣先圣伟言，略附个人鄙意，如说成帙，且曰善用我法，踏毗卢顶上人；或泥己私，必系驴橛下客。倘不自契乃心，终是吾瞎汝眼：若曰即明本性，方知不从人言。把叶作金，咎固我也：因指认月，义岂他哉？勉之，勉之。” <p>　　　　　第二讲 权开一门<p>　曰显、曰密、曰禅、曰净、曰般舟，乃至空有诸宗，万流竞射，德实一趋。及其趋已，不但竞失万流，而实趋无一德。释氏之学，万有之殊，悉尽于此，故曰：人无我，法无我。当人果无人法两执，又不落在不执处，一派圆成，逢佛说佛，逢祖说祖，逢天堂说天堂，逢地狱说地狱，逢人说人，逢一切说一切，不但善恶境界，地狱天堂，奈你不何，即三世诸佛，释迦老子亦窥探无门，觑你不着，岂不诚大大夫哉？无如当人偏偏要无事生事，头上安头，把一片清净处所，东糅西杂，放尿屙屎，日复一日，年复一年，点染堆污，积成秽土，然后万里趋诚，千方决策，向善知识前求解脱、求清净。咄！惑哉！是处也，本自清净，汝自染秽，但除其秽，清净自复。善知识者不过示汝自除其秽耳！宁有善知识代汝吞却屎尿邪？ 苦哉！苦哉！去圣时遥，今之所谓善知识者，多未亲见亲证，或见也证也，大都滞在半途，未及其至，尽把光圣言章，古人妙义，蕴在胸中，或抄在册上，外形大德、内蕴巨奸，处处要人供养，滴滴阴埋已私，学人或有请益，师家无由观机，于是称郑称扬，说禅说道，是己非人，叛圣离经，狐媚莘莘学子，钝置人家女男。如是之流，不但教令学人吞没屎尿，而师家早已预吞自吞也，苦不自觉耳：可无悲乎？等如上说，犹是一期方便之语，都非达者向上之程，何也？滞在净秽也。若有智慧人、过量人、本分人一闻便知，一举便明，在这个场所说什么秽、什么净、什么优、什么劣、什么学人、什么师家，把一切秽、一切净、一切优、一切劣、一切，学人师家抛向无生国里，然后从净上、秽上，优上、劣上、学人师家上头头上显，物物上明，坐水月道场，行空花佛事、所谓净佛国土，成就众生也。门也者门乎此。为何如此？久之，乃曰：玄都观里桃千树，尽是刘郎去后栽。 <p>第三讲 假说五法<p>｛甲｝、起信<p>三门惟信得入，民无信不立。雪岩钦曰：“山僧五岁出家，在上人侍下，见与宾客交谈，便知有此事，便信得及。”又信为道源功德母，无论胜行劣行，非信不起；上智下愚，无信不立。大德胜业，当人每忽而不趋。或趋而不至，乃至沉沦六趣，流浪生死者，信不信也。不然宁有饥逢王膳，弃而不餐邪？信之树不可缓矣。故曰：一入信门便登祖位。然信德弥多，今略立二，以开来者。如十信等，当人阅教而通，固非此立也。一迷信，二实信。一、迷信<p>迷信非信，非信却信，故曰迷。谓所缘境未彻了知，依他起自认识而信也。如病渴者，不知茶可愈而求愈于医，医曰：饮茶。病者须信自有病，信有病当医，信医能愈病，信茶能解病而遂饮，皆迷信。何也？渴尚未解，何知能解？故曰：依他信非自信，曰迷信。二、实信<p>实信无信，无信乃实。如病渴者，既知自病知病求医，医令饮茗。饮茗既已，觅渴已无，信于何有？如是而信，曰实信。当人生不知来，死不知去，舍生受生，虚萦苦乐，头出头没，荡不知归。先圣悯之，为设檀度，广开则八万四千，略举尽四摄大度，要皆非信莫御。三藏十二亦不过生起学人信心，激发初机疑情耳。盖疑极而信生，信极而疑亡。信疑交丧，实相炳然。倘不借激于信，假权于疑，胜径莫游，苦海何济？六度四摄，三藏十二衍文也。昔者纯阳信黄龙激发而碎琴。文悦疑清素，风规以分果，皆能发明大事，了彻因缘，故曰：万行莫先于树信、信树而道自通、德斯懋矣！<p>｛乙｝、依师<p>是法分二，一择师，二事师。若盲师言事，非君子之行也。事不慎始，义则鲜终，行人进业，必难及成。首说择师。［一］、择师<p>是法圆成，当体即是。自无始来，不曾生不曾灭，无去无来，无常无断，非空非有，非短非长，觅自己冤　，何有于人？矧曰师邪？然自无始迄今，又非师莫办。比来师道衰微，至可悲痛，咎固在师，非仅关乎来学也。大慧杲云：古人见你迷却路，为你作指路头人而已。实允禅道佛法可以传授。才说有传有授，便是邪法，说理说事，就正说邪，尽是非法。那堪更说有玄有妙，可以传可以授乎？故民有传有授是无明法，是有为法非智慧法，非无为法，不然，若以奇特玄妙在胸中，抄在册上，递相沿袭，口耳传授，诩为宗旨者，是邪毒入心，不可治疗，古德谓之谤般若人，千佛出世不通忏悔者也。昔雍正序《永嘉集》云：黄梅曹溪密室夜分，传衣授受，究何曾道一字邪？曾溪云：自性自度。黄梅云：如是如是。既自性自度，则黄梅何授？曹溪何受；永嘉之于曹溪更可分明，举似天下。永嘉参承只一宿耳，观其问答语句，全是逆水之机，毫无顺水之意。然则曹溪何授？永嘉何受乎？不知无授无受，永嘉正从此得曹溪法乳，不可诬也。故曰：不依师授而亦非师莫办也。<p>若然有传有授，说妙说玄，已远隔三千。矧乃龙虎坎离，修性修命，荧惑人家男女，毁坏先圣教言邪？孟子曰：“杨墨之道不息，孔子之道不著。”比来邪师诐说，上下盈盈，己觉者习而不迁，安于旧染，未觉者昧而不返，未历新趋。天下昏昏，暗然失钧。祸固逾于洪水猛兽也。昔富枢密季申以此道叩大慧杲，杲曰：“切不可被邪师辈胡说乱说引入鬼窟里，闭目合眼作妄想。迩来祖道衰微，此流如麻似粟，以盲引盲，牵入火坑。虽暂拘得个臭皮袋子住，然意识纷飞，犹如野马，宗杲亦尝为此流所误。后来若不遇真善知识，几至空过一生。每每思量真是叵耐。以胡不惜口业，立救此弊。”在彼宏时，禅德遍丛席，而守静守默去道已远，况曰龙虎坎离，修性修命邪？不彻其非，极其甚，则放僻邪侈，无所不为，以善回而遭恶果，龟玉毁犊，伊谁之咎？师实为之，非仅此也。<p>昔婆修盘头一食不卧，六时礼佛，清净无欲，为众所归。閦夜多尊舌将欲救之，谓其徒曰：“此遍行头陀，能行梵行，可得佛道否？”徒曰：“我师精进，何故不得？”閦夜多曰：“汝师去道远也。设苦行历于尘劫，皆虚妄之本。”其徒同愤，厉声问曰：“尊者蕴何德行，而讥我师？”閦夜多曰：“我不求道亦不颠倒，我不礼佛亦不轻慢，我不长坐亦不懈怠，我不一食亦不离食，我不知足亦不贪欲，心无所希名之曰道。”婆修闻已，发无漏智。苦行如彼，犹曰远道，何去何从，不筮卜而烛照。胜行自起，邪途远离也。<p>然则必如何而曰是？　<p>昔黄檗问百丈曰：“从上古人以何法示人？”百丈据座。檗云：“后代儿孙将何传授？”百丈拂衣便起曰：“我将谓汝是个人。”大慧杲云：“这便是为人的样子。”又何曾教汝乾坤大转，阴阳大交，龙虎坎离，修性修命，如是放言诐语邪？先圣云：宁可破戒如须弥山，不可，被邪师熏一邪念如芥子许在情识中，何也？如油入面，永不可除。故曰：咎固在师，非仅关乎来学也。或比“彼阴阳丹道者，如是过患，自当摈而不治，绝而常离。然则万行门中不舍一法，谬也。”曰：“否！明乃心，贩夫牧竖尚称胜行；不见性，三藏十二允为魔说。”<p>进云：“若然必曰何修而后见性明心？”<p>曰：“莫妄想，踏踏实实学佛，等如上说而无过患，必戒律精勤者，方堪作师。师之难值不亦甚乎？”［二］、事师<p>既值师也，或慢而不事，事而不虔，虔而不恭，业必不修，德必不进。爰以下之五事律之，所作必办。一、言。<p>言无善恶，一出师口，炫如章甫，义无非谤，宁有纤违？苟涉稍疑，必滋大过。雪峰所以三上投子，圆悟终至一病金山。二、理。<p>理无是非，一经师许，重如典谟，义无稍异，宁可轩轾？苟越其藩，必滋大过。文益抉择于地藏，洛浦服膺于夹山，其先例也。［三］、事。<p>事无违顺，一出师门，严如王令，义无稍诿，宁有迟违？苟怀去取，必滋大过，所以临济领命而赴公安，丹霞闻语而趋南岳。［四］、行。<p>行无胜劣，一即师躬，端如圭玉，义无稍轻，宁有讥毁？苟怀愆尤，必滋大过。慧勤阻恨而闭户，清远兴疑而之他，其先例也。［五］、养。<p>师恩逾父母，盖父母生汝色身，师生汝法身也。色身累劫无穷，父母尘沙难计。此法身者实生自师，师只一师，法只此法，且生则永生，理无生灭，宁有断常？故曰恩逾父母。然有二法事之，一身供养，二法供养。身供养谓口体之奉，法供养谓荷担大法，宏济苍生。等如上说而依师，非曰行全，然亦庶几矣。<p>｛丙｝、勤三学<p>树信依师，舍三学而业何修、德何进？三学者，戒定慧也。无戒而德莫全，无定而事莫成，无慧而智莫显。德者仁也，慧者智也,事者勇也。释曰戒定慧，孔曰智仁勇。东方有圣人焉，西方有圣人焉，此心同，此理同，盖不同即非圣人。古德云：“同一鼻孔出气。”故曰：十世古今始不离于当念，无边刹境自他不隔于毫端也。然学人致力于斯，每生多异，今以二法揭其咎。 <p>《一》、志困平常。尝自念言，是三学者人人能作，人人能解，实无奇特，宁有胜行？以白乐天之贤，白鸟窠言，犹曰三岁孩儿解得，况其余乎？惟以平视，遂忽不趋，无始沉沦，长劫没顶。古德讥曰：“近山无柴，近河无水。”<p>《二》、心埋怠忽。未了当体圆成，无德不具，放心不系，怠忽趑趄，谓此三学，圣者所居，凡庸宁至？或云法尔如是，何假他术，以智隍之精勤，未遇玄策，犹困半涂；慧南之勇锐，不识云峰，尚落寞臼。况其余乎？惟以怠居，遂远离勇。古德曰：几多鳞甲为龙去？虾蟆依然鼓眼睛。此略立二支，余固不及也。依次第言三学，启当人之一行。 <p>［一］、戒学<p>沙弥十戒，比丘二百五十戒，善萨十重、四十八轻戒，密乘十四，优婆塞优婆夷等，乃至八万细行，统曰戒也。无戒何以全德？德不全行焉尚？尚行全德，君子胜行莫尚乎此。行人无始落没天涯，还家路迷，荡不知返。邪师诡说异论庞然，今欲回车，途何由识？此戒者指途的要，依要而行，安全抵舍，故曰：“佛涅槃后，以戒为师。”《永嘉集序》曰：“非戒不禅，非禅不慧。”或曰：“湛堂准谒梁山乘，乘曰：‘驱乌未受戒，敢学佛邪？”准捧手比‘坛场是戒邪？三羯磨梵行阿闍黎是戒邪？’乘大惊。又有以戒定慧学问一古德者，德曰：‘我这里无如是闲家具。’” 又嵩岳元圭答乞戒者曰：“汝既乞戒，即既戒也。所以者何？戒外无戒，又何戒哉？又曰：“若能无心于万物，则罹欲不为淫，福淫祸善不为盗，滥误疑混不为杀，先后违天不为妄，昏荒颠倒不为醉，是谓无心也。无心刚无戒，无戒则无心，无佛无众生，无汝无我，孰为戒哉？”云云，如彼说又何邪？曰：是法非语言能诠，意识能缘，汝辈但紧紧记着、守着：无戒而德莫阶，无舟而海莫泛，则得矣。何也？在他既阶既泛之人，何德非戒？何行非戒？何事非戒？若然持邪犯邪，开邪遮邪，开遮持犯之法，以权信愿行证之趣为实，因权及实，既及实已，云何是戒？云何非戒？然未济海者，固不可忘乃舟也。行人行人，即应严守下之五戒： 一杀，二盗，三淫，四妄，五酒。又此五戒者，任何一戒严守专工，悉能了彻本来，发明大事，况尽持乎？他方非计，以吾土言，道宣辈其先例也。<p>［二］、定学<p>记曰，“知止而后有定。”佛曰：“奢摩他。”天台大小止观，定相千差，定名匪一，曰定则不二。佛说无量法门，总摄止观。止者心一境性，观者抉择法慧。心一境性缘无分别，抉择法慧缘有分别。无分别断烦恼现行，有分别断烦恼随眠，二者相依，疾风扫叶。若曰偏废，必覆辅车。又止者定也，观者慧也。今以观糅杂于定学，共立一节者，盖以遍言，无止非观，无观非止，且欲于下文第四节，间彼参话头等四法也。黄叶止啼讵实义乎？是皆路途之方便，非及奥之良规。若及奥也，则此戒定慧学皆为闲话，尚何所谓糅杂非糅杂邪？然此止观亦开为二： <p>一、胜妙止观。先得止而后起观者；<p>二、随顺上观。依学人功行方便次序不定。曰止观，曰胜妙，曰随顺，种种名，种种法，悉以实诠人无我、法无我为其究竟。当人苟直下无我，无我则无心，无心则无法，无法则无人，而大用繁兴也。曰止曰观，讵不悖乎？其或未然，刺股封衾，宁忘载道？既载道也，而于此道起大障碍者，厥有多咎，今但及二： <p>一、昏沉，心身于所缘境，无堪能性者，昏沉也。如心缘无念而定久，渐心昏身疲，继至睡眠等。修定行人最难辨者此耳。盖掉举易知，昏沉难捡，古人于此乃开二门，一粗二细。粗固无论，细为如何？渭于所缘境稍不明显，心无策励，皆昏沉也。比来同辈每印个似清净境界，或少许光影者，即曰得某定、某三昧。以余勘之，皆昏沉也。去圣日遥，谬阳焰而曰清波，可无惧乎？<p>二、掉举，贪彼前境，妄计过未，摇心异趣，随业散乱者，掉举也。如心缘无念而定久，则放心不求，自意不牧，遂至朋从。尔思修定行人，人百其病，苟无昏沉掉举，无论何人，当时泊然在定，讵有他哉？一切止观法衍文也。 行人既不越乎止观，然则缘当何缘？此无定法，要以行人乐欲及烦恼轻重而为对治。略开六法：<p>一、贪重者应缘不净法；<p>二、嗔重者应缘慈悲法；<p>三、痴重者应缘缘起法（十二缘起）；<p>四、慢重者应缘界差别法（地水火风空识）；<p>五、寻思重者应缘出入息法；<p>六、等分行者应缘各别缘上诸观。止观理趣既已粗知，于焉起行得地为上，古哲择处，人物悉宜，四时咸序，曰山、曰海、曰崖谷、曰市廛，总以便利行人，不害进业为是。当人自检。既得地已，行住坐卧无非道场。为利初机，故言坐法。金刚坐、狮子坐、七支坐等，生有多名，名有多德，都非此急。今以下之九法为行者的趋，若忘筌蹄，是此非此，均无不可也。 <p>一、跏趺或半跏趺（如有病或吃苦随坐亦可）；<p>二、坚脊（直如树铜钱）；<p>三、平肩（肩须放松）；<p>四、手置脐下四指处结定印（右手放在左掌上，必两大指微微相触）；<p>五、项微俯（项左右有脉如鱼鳃，出入循环冲动内气，故易掉举，微俯则压二脉不动，自然在定也）：<p>六、唇合任其自然；<p>七、舌抵上腭；<p>八、眼微开，自鼻端下视（远五尺近三迟）； <p>九、呼吸任其自然。<p>行既趋乎上阶，业每新于日异。笃行固一，业相繁多。先圣以九法表之，令行者无栖故窠，日新乃德，甚可追也。今示定相，亦曰止相，当然应有之过程如次：<p>一、 内住：即念住，摄外攀缘，离内散乱，最初系心故；<p>二、等住：即续住，于所缘境相续而转，微细系缚渐略故；<p>三、安住：或失念，或驰散，能复敛摄故；<p>四、近住：收摄失念，及驰散已，能如理安住；<p>五、调顺：思维定生功德，乐察烦恼过患，令其调伏心不散乱故；<p>六、寂静：于粗寻思烦恼，能起正念，断除令心不流散故；<p>七、最寂静：于极寻思烦恼亦能断除，或时失念率尔现行，亦能治伏，如是等过，令不更起故；<p>八、专住一趣：于所缘境，恒常相续而行功用故；<p>九、等持：于所缘境，恒恒相续，无功用故。是九相者，修定行人必经之程，得等持已，心一境性，即时身心轻安，名为得止。止者定也，行人证此轻安，即得定也。然此亦有四胜相，恐学者昧而不察，得少忘全，特开四法，检其伪真：<p>一、头项似重，而无损恼；<p>二、遍身如风，内触妙乐；<p>三、身内如满溢状；<p>四、于诸烦恼乐断能断。<p>止既得已，由此起观，曰妙胜观。以外道例，止共而观不共。盖外道有止而无观，纵曰观，非此之观也。观亦开二门、六事。二门者，一、正思择，二、正极思择。正思择缘尽所有性，正极思择缘如所有性，此复依六事而行，观察如次：<p>一、义，谓于所缘，依圣言教而明了其义；<p>二、事，谓由义所指之一切事；<p>三、相，谓所缘之事，思维其自相及共相；<p>四、品，谓依义及不依义，所得善果恶果；<p>五、时，谓于过未现决定如此；<p>六、理，理又开四：<p>　（一）、观待道理。以观待而自明(如烟起而知有火)；<p>　（二）、作用道理。以作用而自明（如笔墨人作用而成字)；<p>　（三）、证成道理。以证得而自明(如饮茶已而渴解)；<p>　（四）、法尔道理。不待证而自明(如三加二等于五〕。既得止已，依轻安力起分别观。观法虽多，我空观最为殊胜。所以者何?以此观者，能破根本我执也。如是分别思维，因止以观，因观以止，有时全止无观，有时全观无止，有时观止双忘，有时止观共显，时时增上，了体明静，所观能观，一切不系，内心外境，了不可形，而当人在此过程之中，所见如虹如电，如日月，如流星，胜境劣境，光影非光影等一切境界，不舍不取，无憎无爱，一一消归自性，乃曰观果。上说杂摘经论，百中仅一，行人但企于此，曰观曰止其庶几也。然略而未及者，止观之前行资粮，并正行时之助行，与断除沉掉之方便耳。宁可忽乎?权开三法，次略说之：<p>(一)、未修止观前应具之资粮备预不虞，先哲所钦，矧应具之资粮乎?诗曰：“乃裹糇粮”，唯识于斯，特立一位，曰资粮体，固不可忽也。今依论摘四：<p>一、地随顺，上文已粗说，即得爽垲之地等；<p>二、戒清净，戒如筏，舍筏何渡?<p>三、远离欲欲如系，离系乃行；<p>四、应决定三见：<p>　（1）、出离见，人天六道，善恶诸业，皆为有漏，决不染不着；<p>　（2）、菩提见，即觉也，行人当净佛国土，成就众生，难行能行，决不推诿；<p>　（3）、空见，一切法因缘而生。<p>(二)正修止观之助行<p>借错攻玉，尚咏他山；展此胜行，宁忘助伴？缘苟有愆，过患立显，废半途返归车者，悉由此也。先圣悯之，爰开六法： <p>一、睡眠适度：是睡眠者，本系过患，身不堪能，乃暂休息。行者应作如是思维、务于自所缘自思择，审度如理，即在睡中亦不忘失。睡眠时间亦须适合，总以回复疲劳为度，过短过长皆为过患。睡眠方式以吉祥睡法为是。盖此式诸圣所由，能除恶梦及贪着睡眠等诸过患也。<p>二、食知量：万病多从食有。讵知食即是病?行者食时当作疾病想，防护想，不自在想，报恩想，药想，如量而止。［　三、密护根门：色声香味触等，本自虚寂，当体即空，如空无染，仁者自闹。苟不取相于外，云何能动于中?内外翕然，天君寂然，漏泄远矣。<p>四、正知而住：义所当为，力所能为，如理而为，不躁不诿，为而不为，不为而为，无间无遗，一派圆成，法尔如是，曰正知而住。 <p>五、发露忏悔：日新又新，德基于悔；讳恶自封，善无由迁。讳恶岂君子，迁善非小人。欲完大事于将来，宁潜过患于今日?过而不潜，悔德尚矣。<p>六、恳祷加持：《易》尚感通，爰立垦祷。恳祷曰感，加持图通。感而遂通。物且云然，君子胜行，宁忽乎?此密乘之所以重礼拜，而诸宗之所以有祈祷矣。斯法也，大人犹驭，矧彼初机? 如是六法，行人朝斯夕斯，借助于彼，所作必办。<p>(三)正修断除沉掉方法<p>曰止曰观，从本以来，人人具足，个个圆成，亦非他得，不从师授，且非修有。若修而有，小乘法、外道法、邪法也，讵正法、无为法、无上大法邪?良以沉、掉二障，趋役行人，不驰则昏，遂昧本来。若无沉、掉，当下即通。不求已得，及通也得也。沉、掉亦是本来一切，何非大用?若然，行人未通、未得者，固不得言无修也。修者何修?去沉、掉耳。此开六法，果当人直下，心如虚空，不着空见，应用无碍，动静无心，凡圣情尽，能所俱泯，则性相如如，无不定时也。于焉千法皆赘，一法也无，况云六邪?检之! 勉之!<p>一、掉举时应修止；<p>二、昏沉时应修观：<p>三、修止修观于沉、掉仍不能去，应起经行或讽诵、持念、忏悔，总以远离为是；<p>四、掉多者，应多观五欲过患；<p>五、沉多者，应多思维定有功德；<p>六、沉、掉俱无者，应修行舍，稍缓功用，看止是何法，观是何行。能观所观，为自为他，自然头头上显，物物上明也。如是等法，当人倘一觑觑破，曰止曰观，曰戒定慧、曰三藏十二，胜劣一切等说，都成话柄也，讵不毅然大丈夫哉？苟自缚而求解，无病而长呻，三世诸佛将奈尔何？<p>［三］、慧学<p>“恰恰用心时，恰恰无心用；无心恰恰用，当用恰恰无，学学何道？会会何法？有学有会，恰恰学错会错。”“然则无学无会邪？”曰：“否否：有且错，况无邪？”<p>进云：“有无不居，学人究从何会？”<p>先生曰：“当人开眼闭眼，凡所见色，皆是见心，心不自心，因色故有。汝但随时言说，即事即理，都无所碍，即菩提道果也。菩提道果者，慧果也。慧果者，佛果也。能如是即上趋乎三藐三菩提也。宁舍此而别有他学曰去取邪？故曰道不属修，若言修得，修成还坏，即同声闻；若言不修，即同凡夫。或曰初机者不言修，云何达道？况今之修道者遍诸方，何邪？”<p>先生曰：“自性本来具足，但于善恶事上不滞，唤作修道人。船子诚曰：‘藏身处莫踪迹，莫踪迹处莫藏身。’唤作修道人。不如密多曰：‘出息不随众缘，入息不居蕴界。’唤作修道人。百丈曰：‘即此用，离此用；离此用，即此用。’唤作修道人。’舍此不图，取善舍恶，观空入定，悉属造作，统摄驰求，讵知转求转疏，转疏转远，穷劫不能履乎上阶而趣慧果也，悲乎！悲乎！“六祖能曰：‘若得解脱，即是般若三昧。’般若者智慧也，三昧者正受也，舍此则邪则愚，而非至行也。般若三昧即是无念。何名无念？见一切法，心不染着，是为无念。用即遍一切处，亦不着一切处，但净本心，使六识出六门，于六尘中无杂无染，来去自由，通过无碍，是为无念。若百不思，百不想，合眼瞑坐，常令念绝，即是法缚，乃边见也。不名无念，不名般若，讵曰三昧邪？马师曰：‘前念中念后念，念念不相待，念念寂灭，唤作海印三昧。’是法也，不历阶梯，亦无顿渐，悟此即登佛地，一切不假他求。曰上根，曰中根，曰下根，曰三学，曰多学，曰万行，曰一行，皆方便而言，就行人迷悟示践履差齐耳。今兹权开四法，导彼初机。若曰悟门极尘沙罔罄开一法已云多，固不计也。”<p>　<p>　（一）随体消<p>长庆叩百丈之室，曰：“愿识佛性义。”丈曰：“大似骑牛觅牛。”庆曰，“识得后如何？”丈“如骑牛人归家。”庆曰：“未审始终，如何保任？”丈曰：“如牧牛人执杖视之，不令犯人禾稼。”庆从兹领旨，享受下半截风光，更不驰求。此随体消之楷范，是法也，易滞在体，而难脱落。古德曰：“就体消停得力迟。”<p>　（二）从缘入<p>香岩击翠竹以明心，灵源见桃花而悟本，从缘也。古德曰：“从缘入者得力强。”盖谓其直切契证，而远离乎情缘意度也。<p>　（三）依文字依先圣教言，如理而知，如实而行，或观或止，以戒以诚，丕说诠乎已言，幽理彰于未著，句破《楞严》先型悟则，语阅玄沙竟彻，灵源曰：“依文字。”古德曰：“从文字得力者弱。”盖幽虽渐著，理难彻忘矣。<p>　（四）参话头此法至易至简，至高至玄，胜行中之特行，要法中之妙法也。以言乎义，空生莫赞；以言乎慧，身子莫诠；摄上中下三根，普过未现三际。行者何修，得闻此法？既闻此法，即得此法；既得此法，喻如金刚王剑，魔来斩魔，佛来斩佛，何坚而不摧邪？伊庵曰：“是法也，穷未来际而不渝。”知言哉！爰以六说，略尽其义。<p>　1.话头之缘起话头者，黄檗揭于前，妙喜倡于后，比来宗门下客，言趣乎入处，莫不竟尚话头。而古人一言一句，契机契理，息心忘心，发明大事之风，不必曰无，然亦渐寝也。原古人纯笃，大事未明，如丧考妣，异域抉择，殊方趋诚，心摇摇于胜义，情殷殷而神一。孟子曰：“是集义所生。”集义而生，非话头即话头。话头之义实亦潜寓也。末法人情浇薄，集义既难，趋诚者少，而此法门遂应运而诞也。旨哉！旨哉！千古不渝，人百其口，讵能罄赞？<p>　2．话头之殊胜当人果能直下荐取，探堂过寝，固无论也。其或未然，宁离功用？且谈功用者，不越止观。是法也，止观双运，遮照互通。止则沉、掉皆破，观则体用齐彰。惧显而放，遮以诠实；虑隐而拘，照以明真。不沉不掉，无放无拘，入乎否邪？此观音入德之门，诸菩萨入德之门，三世诸佛一切贤圣入德之门也，然则参法伊何，说如下支。<p>　3．话头之参法法本无法，无法亦法。今必依法，便摘古德参情数则，似之以新来学。黄檗运曰：“若是丈夫汉，看个公案。”僧问赵州：“狗子有佛性无。”州云：“无。但二六时中，看个无字，昼参夜参，行住坐卧，著衣吃饭处，屙屎放尿处，心心相顾，猛著精彩，守个无字，日久月深，打成一片，忽然心花顿发，悟佛祖之机，便不被天下老和尚舌头瞒，便会开得大口也。达摩西来，无风起浪；世尊拈花，一场败阙。到这里说什么阎王老子，千圣尚不奈你何。”赵州诠曰：“汝但究理，坐看二三十年，若不会，截取老僧头去。”大慧杲曰：“当人当以生死二字，贴在头上。茶里饭里，静处闹处，念念孜孜，心知烦闷，回避无门，求生不得，求死亦不得。到这个境界时，善恶路头，相次绝也。切莫放过，正好把一个话头直截看下，看时不用搏量，不得注解，不用分晓，不得向开口处承当，不用向举起处作道理会，不得堕在空寂处，不用将心等悟，不得向师家说处领略，又不得掉在无事由里，行时卧时，但切切提撕，提撕得熟，口议心思都不能及，方寸里七上八下，如咬生铁橛莫滋味时，千万莫要退志，正是好消息到也。又把一个话头，喜怒静闹处亦须提撕，第一不得用意待悟。若用意待悟，则谓我至今迷，执迷待悟，纵经尘劫亦不能悟。但举话头时，略抖擞精神，看是个什么道理而已。又僧问赵州：“狗子还有佛性无？”州云：“无。”此一无字，便是破生死疑情的刀子也，这刀子把柄只在当人手中，教别人下手不得，须是自家下手方亲，若舍得性命，方肯下手，反之亦须在疑不破处，捱将下去。倘蓦然自肯舍命，一下便休，那时方信静时便是闹时的，闹时便是静时的，不着问人，自然不受邪师胡说乱道也。又日用二六时中，不得执生死佛道是有，不得拨生死佛道是无，但只看个狗子还有佛性也无。州云：“无””如是参法，舍是无法。行人但行是法，无事不办，即名胜行。上行、梵行，可忽乎？<p>　4．话头之歧路古德参话头得入者，指不胜屈，而策意行心略不外右之理趣。果能把此一心不异，蓦直而行，何坚不摧，发悟可立而侍也。然则话头法门百益而无一害乎？曰：“否！”钱伊庵云：“话头之弊，歧途有二。”伊庵造诣固不足称，然检点斯处，亦有可取，宁曰以人而废言乎？今说之以履行者。 钱伊庵曰：“参话头之弊，厥有二岐。一说道理，二认光影。如参无梦无想公案，忽然自心谓云：不过令断妄想，亦别无奇特，又谓既无梦想何有主公？更以所参在无梦想处，而实悟不在此之类，各各游思，种种妄想，落说道理边收也，参情紧急，忽觉本心，如日当空，或如孤灯独照，或密入无间，或大弥虚空，或金光闪烁，或暗然空寂，或大地平沉，或见佛菩萨像，以及一切殊胜非殊胜，种种皆光影边收。非悟门，非本心也” 上之种种，无一而非透路，无一而非要门，总在当人明得透，信得及，把得住。一闻便信，一信便行，一行便深，一深便直趋，而入间达奥，方堪称为宗门种草。若徘徊歧路，相羊两头，痴云甚矣！<p>　5．话头之检择检择话头，以何为尚？大慧杲多主单提“无”字，天奇瑞专以“谁”字示人，伊庵则以“无梦无想主人公毕竟在什么处安身立命”，为学人必参，此乃能于八识上大亚一刀云云。余意不然，火器铁器，均能杀贼，任一话头皆可结秀。苟能激得学人疑情起者，便是杀贼利器，固不必拘有义路、无义路，或半有半无义路等。所谓欲尚无所尚，欲为无所为矣。比来丛林，总以念佛是谁交令学人一味死参者，亦可笑也。<p>　6．话头之罢参问者曰：“参究话头以何时已？”先生曰：“是话头也，在未悟前为方便般若，既悟后为实相般若。未悟前参一话头便是一话头，有参时有不参时，有打成一片时，有走着而片段不成一片时，迄彻后一话头该一切话头，一切话头为一话头，大地、山河、风云、雷雨、四时八节、人我是非，一切三昧，一切修多罗，十方圣哲，四类含生，语的、默的、静的、动的，何一而非话头？学人多到此，参也是他，不参也是他，觅一星儿参与不参皆是戏论，皆是诤语，皆不可得，何时而已？落在何处？当人自检，思之思之。” 曰戒、曰定、曰慧，支开为三，理原不二。任何一学，皆可了彻本来，发明大事。未了彻前三学竞秀，理有万殊；既了彻已，一物也无，事非殊致。以戒言，能持即定，知持即慧；以定言，知定即慧，能定即戒；以慧言，能慧即戒，常慧即定。明其德曰智仁勇，即其体曰法报化，绳其用曰戒定慧。随处立名，立名即真。既有真也，妄即虚形，非离真而有妄，实藉妄以诠真。真妄虚名，三学焉寄？非达天德者，其孰能游？志公曰：“无智人前莫说，打汝色身星散。”大慧杲曰：无智人前莫说，打你头破额裂。”今昔永叹，贤哲徒怀。 <p>｛丁｝、警语<p>一言知返，千古尚有宪垂；一理契机，当下即明本体。载于史，炫于帙，不胜数也，爰摘古人明言、先哲伟论而次三学之后，再示入德之程。自不捡赘，遑曰说同，意者抛纶江上，或有金鳞破浪而来，非曰缘木求鱼，平地捞虾也。题曰“警语”。世尊升座，众集。文殊白椎曰：“谛观法王法，法王法如是。”世尊便下座。<p>黑氏梵志献合欢梧桐花，佛召仙人放下著，梵志放下左手一株花。佛又召仙人放下著，梵志又放下右手一株花。佛又召仙人放下著，梵志曰：“吾今两手俱空，更教放下个什么？”佛曰；“吾非教汝放舍其花，汝当放舍外六尘，内六根，中六识，一时舍却，无可舍处，是汝放身命处。”梵志于言下悟无生忍。 调达谤佛，生身入地狱。佛命阿难往而问曰：“你在地狱中安否？”曰：“我虽在地狱，如三禅天乐。”佛又令问：“你在地狱中还求出否？”曰：“我待世尊来便出。”阿难曰：“佛是三界导师，岂有入地狱分？”调达曰：“佛既无入地狱分，我岂有出地狱分？”<p>世尊在灵山会上，拈花示众，是时众皆默然，唯迦叶尊者破颜微笑，世尊曰：“吾有正法眼藏，涅槃妙心，实相无相，微妙法门，不立文字，教外别传，付嘱摩诃迎叶。” <p>阿难尊者问迦叶尊者曰：“师兄，世尊传金缕袈裟外别传何法？”迎叶召阿难，阿难应诺，迦叶曰：“倒却门前刹竿著。”真净文居洞山时，僧问：“华严论云：以无明住地烦恼为一切诸佛不动智，一切众生皆自有之，只为智体无性无依，不能自了，会缘方了。且无明住地烦恼如何便成诸佛不动智？理极渊深，绝难晓达。”文曰：“此最分明，易可了解。”时有童子方扫地，呼之，回首，师指曰：“这便是不动智。”又问：“如何是佛性？”童子左右视，惘然而去。师曰：“这便是住地烦恼，若能了之，即今成佛。” <p>又古德曰：“众生不能解脱者，情累尔。悟道易，明道难。”问：“如何得明道去？”师曰：“但脱情见，其道自明矣。夫明之为言信矣，如禁蛇人信其咒力药力，以蛇绾弄揣怀袖中无难，未知咒药等力，怖骇易去。但谛见自心，情见便破。今千疑万虑，不得用者，是未见自心者也。”<p>问：“真正修道人不见世间过，未审不见个什么过？”汾阳昭曰：“雪埋夜月深三尺，陆地行舟万里程。”曰：“和尚是何心行？”汾阳昭曰：“却是你心行。”<p>志公事理不二颂云：“心王自在悠然，法性本无十缠，一切无非佛事，何须摄念坐禅？妄想本来空寂，不用断除攀缘，智在无心可得，自然无诤无喧。不识无为大道，何时得证幽玄。佛与众生一种，众生即是世尊。凡夫妄生分别，无中执有迷奔，了达贪嗔空寂，何处不是真门。” <p>维摩会上，三十二菩萨各说不二法门。文殊曰：“我于一切法无言无说，无示无识，离诸问答，是为菩萨入不二法门。”于是文殊又问维摩：“仁者当说何等是菩萨入不二法门？”维摩默然，文殊赞曰：“乃至无有语言文字，是菩萨真入不二法门。”<p>无厌足王入大寂定，乃敕有情无情皆顺于王，若有一物不顺于王，即入大寂定不得。<p>广额屠儿于涅槃会上放下屠刀，立便成佛，自云：“是贤劫千佛一数。” 警语醒言，罄竹难书。今但及此，尝一脔而甘全鼎，所谓医病不假驴驮药者也，翠竹黄花何非般若？何非法身？仁者幸自检耳。<p>｛戊｝、悟缘<p>学人贪程嗜异，未得饰得，百其人，百其病，讵知愈贪愈远，愈嗜愈离，本无远近，何有程贪？本自寂常，何有异炫？倘把一切远、一切近、一切平常奇异、得未得等贬向他方，又不作贬向他方想，一派圆成，何用不臧？当人当下不趋已入，不炫已奇，无得而得，得无所得也，而谋不出此，意不洞此，慧不照此，于是乎证不及此，笼统顸依稀，说奇说常，说难说易，闹如十字街头，俨如山阴道上，相羊乎一德，趔趄乎两岐。爰开此章，示彼未学，王须真王，嗜须实嗜。倘认王于纪信，嗜龙等叶公，不可也。录先圣悟缘数则者，杜公子窃符，王孙矫命耳。 <p>法閦上座久依五祖，未有所入。一日造室，祖问：“不与万法为侣者是什么人？”曰：“法閦即不然。”祖以手指曰：“住！住！法閦不然着么生？”閦于是启悟。金陵俞道婆市油糍为业，常随众参问琅琊，琅琊以临济无位真人语示之，一日闻丐者唱莲花落云：“不因柳毅传书信，何缘得到洞庭湖？”忽大悟，以油糍投地。其夫曰：“汝颠邪？”婆掌其夫曰：“非汝境界。”往见琅琊，琊望之，知其造诣，问：“那个是无位真人？”婆应声曰：“有一位无位真人，六臂三头努力嗔，一擘华山路两分，万年流水不知春。” <p>云门偃以己事未明，往参睦州。州才见便闭却门，偃乃叩门。州曰：“谁？”偃曰：“某甲。”州曰：“作什么？”偃曰：“己事未明，乞师指示。”州开门一见便闭却。偃如是连三日叩门，至第三日，州开门，偃乃拶入，州便擒住曰：“道！道” 偃拟议，州便推出，曰：“秦时（车度）轹钻。”遂掩门，损偃一足。偃从此悟人。<p>明州大梅初参大寂，问曰：“如何是佛？”寂曰：“即心是佛。”大梅闻已大悟。<p>灵默初谒马祖，次谒石头曰：“一言相契即住，不契即去。”石头据座，默便行，头随即召曰：“闍黎！”默回首，头曰：“从生至死，只是这个，回头转脑作么？”默言下大悟，乃拗折拄杖而栖止焉。<p>大珠慧海初参马祖，祖问：“从何处来？”珠曰：“越州大云寺来。”祖曰：“来此拟须何事？”珠日：“来求佛法。”祖曰：“我这里一物也无，求什么佛法？自家宝藏不顾，抛家散走作么？”珠曰：“阿哪个是慧海宝藏”祖曰：“即今问我者是汝宝藏，一切具足，更无欠少，使用自在，何假外求？”珠于言下自识本心，不由知觉，踊跃礼谢。<p>俱胝和尚参天龙，龙竖一指示之，俱胝大悟。<p>临济在黄檗会中行业纯一。时睦州为第一座，乃问济曰：“上座在此多少时？”济曰：“三年。”州曰：“曾参问否？”济曰：“不曾参问，不知问个什么？”州曰：“何不问堂头和尚如何是佛法的的大意？”济便去问，声未绝，檗便打。济下来，州曰：“问话作么生？”济曰：“某甲问声未绝，和尚便打，某甲不会。” 州曰：“但更去问。”济又问，檗又打，如是三度问，三度被打。济白州曰：“早承激劝问法，屡蒙和尚赐棒，自恨障缘，不领深旨，今且辞去。”州曰：“汝若去，须辞和尚了去。”济礼拜退。州先到黄檗处曰：“问话上座虽是后生，却甚奇特。若来辞，方便接伊，以后为一株大树，覆荫天下人去在。” <p>济来日辞黄檗，檗曰：“不许他去，只往高安滩头参大愚，必为汝说法。”济到大愚，愚曰：“甚处来？”济曰：“黄檗来。”愚曰：“黄檗有何言句？”济曰：“某甲三度问佛法的的大意，三度被打，不知某甲有过无过？”愚曰：“黄檗与么老婆心切，为汝得彻困，更来这里问有过无过。”济于言下大悟，乃曰：“原来黄檗佛法无多子。”愚揪住曰：“这尿床鬼子，适来道有过无过，如今却道黄檗佛法无多子，你见过什么道理，速道！速道！”济于大愚肋下筑三拳，愚拓开曰：“汝师黄檗，非干我事。”济辞大愚，却回黄檗，檗见便问：“这汉来来去去有何了期？”济曰：“只为老婆心切。”便人事了，侍立。檗问：“甚处去来？”济曰：“昨蒙和尚慈旨，令参大愚去来。”檗曰：“大愚有何言句？”济举前话，檗曰：“大愚老汉饶舌，待来痛与一顿。”济曰，“说什么待来？即今便打。”随后便掌，檗曰：“这疯颠汉来这里将捋虎须。”济便喝，檗唤侍者曰，“引这疯颠汉参堂去。” <p>高峰妙曰：“某甲十五出家，二十更衣，入净慈，立三年死限学禅。初参断桥和尚，令参生从何来，死从何去？意分两路，心不归一，后见雪岩和尚，教看无字，又令每日上来一转，如人行路，日日要见工程。因见说得有序，后竟不问做处，一入门便问：‘谁与你拖这死尸来？’声未绝，便打出。次后径山归堂，梦中忽忆万法归一，一归何处？自此疑情顿发，直得东西不辨，南北不分。第六日随众阁上讽经，抬头忽睹五祖演和尚真赞，末两句云：‘百年三万六千朝，反复原来是这汉。’日前拖死尸句子蓦然打破，直得魂飞胆丧，绝后再醒，何啻放下百二十斤担子！其时正二十四岁，满三年限。 “次后被问：‘日间浩浩作得主么？’答曰：‘作得。’又问：‘睡梦中作得主么？’答曰：‘作得。’又问：‘正睡着无梦时主人公在何处？’于此无言可对，无理可伸。和尚嘱云：‘从今后不要你学佛学法，穷古穷今，只饥来吃饭，困来打眠，才眠觉来，抖擞精神，我这一觉主人公毕竟在什么处安身立命，自誓拼一生做个痴呆汉，定要见这一着于明白。’经及五年，一日睡觉正疑此事，忽同宿道友推枕子落地作声，蓦然打破疑团，如在网罗中跳出。所有佛祖淆讹公案，古今差别因缘，无不了了，自此安邦定国，天下太平，一念无为，十方坐断。” 铁山瑷曰：“僧十三岁知有佛法，十八出家，二十二为僧，先到石霜，记得祥庵主教时时观见鼻头白，遂得清净。后有僧自雪岩来，写得岩坐禅箴看，我做功夫却不从这里过，因到雪岩，依彼所说做功夫，单提无字，至第四夜通身汉流，十分清爽，继得归堂，不与人说话，专一坐禅。后见妙高峰教十二时中莫令有间，四更起来便摸索话头，顿在面前，略觉困睡，便起身下地也。是话头行时步步不离话头，开单展钵，拈匙放箸，随众等事，总不离话头，日间夜间打成片段，未有不发明者。依峰开示做工夫，果得成片。三月二十日岩上堂云：‘兄弟家久在蒲团上瞌睡，须下地走一遭，冷水盥漱，洗开两眼，再上蒲团，竖起 脊梁，壁立万仍，单提话头，如是用功七日，决定悟去，此是山僧四十年前已用之功。’某即依彼所说，便觉功夫异常，第二日两眼欲闭而不能闭，第三日此己身如在虚空中行，第四日曾不知有世间事。其夜倚栏杆少立，泯然无知。检点话头，又不打失。转身上蒲团，忽觉从头至足如劈破髑髅相似，如万丈井底被提在空中相似。 <p>“此时无著欢喜处，举似岩，岩云：‘未在。’更去做功夫。求得法语，未后云：‘绍隆佛祖向上事，脑后依然欠一捶。’ 心下道：‘如何又欠一捶？’不信此语、又似有疑，终不能决。每日堆堆坐禅，将及半载，一日因头痛煎药，遇觉赤鼻问：那吒太子析骨还父，析肉还母话，记得被悟？知客问不能对，忽然打破这疑团。后到蒙山，山问参禅到什么处是毕工处？遂不知，投山教再做定力功夫，洗荡尘习。每遇入室，下语只道欠在。一日哺时，坐至更尽，以定力挨拶，直造幽微。出定见山，说此境已，山问：‘哪个是你本来面目？’正欲下语，山便闭门。自此功夫日有妙处。盖以离岩太早，不曾做得细密功夫，幸遇本色宗匠乃得到此。原来功夫做得紧峭，则时时有悟入，步步有剥落。一日见壁上三祖《信心铭》云：‘归根得旨，随照失宗。’又剥了一层。山云：‘个事如剥珠相似，愈剥愈光，愈明愈净，剥一剥，胜他几生功夫也。’但下语犹只道欠在。一日定中忽触着欠字，身心豁然，彻骨彻髓，如积雪卒然开霁，忍俊不禁，跳下地来，擒住山云：‘我欠少个什么？’山打三掌，某礼三拜。山云：‘铁山这一著子几年几日方了。’”<p>百丈参马祖为侍者，檀越每送斋饭来，师才揭开盘盖，马大师便拈起一片胡饼示众云：“是什么？”每每如此，经三年。一日侍马祖行次，见一群野鸭飞过，祖曰：“是什么？”师曰：“野鸭子。”祖曰：“什么处去也？”师曰：“飞过去也。”祖遂把师鼻扭，负痛失声。祖曰：“又道飞过去也？”师于言下有省，却归侍者寮哀哀大哭。同事曰：“汝忆父母邪？”师曰：“无。”曰：“被人骂邪？”师曰：“无。”曰：“哭作什么？”师曰：“我鼻孔被大师扭得痛。”不彻同事曰：“有甚因缘不契？”师曰：“汝问取和尚去。”同事问大师曰：“海侍者有何因缘不契在寮中哭，告和尚为某甲说？”大师曰：“是伊会也，汝自问取他。”同事归寮曰：“和尚道汝会也，教我自问汝。”师乃呵呵大笑。同事曰：“适来哭，如今为甚却笑？”师曰：“适来哭而今笑。”同事惘然。<p>次日马祖升座，众才集，师出，卷却席。祖便下座，师随至方丈，祖曰：‘我适来未曾说话，汝为甚便卷却席。”师曰：“昨日被和尚扭得鼻头痛。”祖曰：“汝昨日向甚处留心？”师曰：“鼻头今日又不痛也。”祖曰：“汝深明昨日事。”师作礼而退。师再参，侍立次，祖目视绳床角拂子，师曰：“即此用，离此用。”祖曰：“汝向后开两片皮，将何为人？”师取拂子竖起，祖曰：“即此用。离此用。”师挂拂子于旧处，祖振威一喝，师直得三日耳聋。<p>水潦和尚问马祖：“如何是西来的意？”祖乃当胸踏倒，师大悟，起来拊掌大笑云：“也大奇！也大奇！百千三昧，无量妙义，只向一毛头上一时识得根源去。”乃作礼而退。师后告众云：自从一吃马祖踏，直至如今笑不休。”<p>上之形形色色、若作实会，埋汝千尺，莫谓余言不先；一作不实会，远汝万程，莫渭余言有咎。若云总不作如是会，许你百千亿劫坐在黑山鬼窖，求出不得，求入不得，求住不得，求不住更不得。然则必如何乃得，学人在此心上心下，必自念云：“先生若不装模作样，像那古人做宗师的样子，故意要钝置人。倘一口说出，我们当下即得哈哈。”果如是也，我得你不得。何也？纵饶三世诸佛、释迦老子一时到来，尽量共力道此一句，亦道不出的，且不问汝诸人得与不得。<p>或曰：“他或道得出时如何？”<p>先生曰：“我便拜他三拜。”<p>或曰：“先生为何如此大赌？”先生：“与其俭也宁奢。”<p>第四讲　　或者问<p><p>或问曰：“凡圣情尽，体露真常，但有文言，皆无实义。赵州云：‘老僧此间即以本分事接人。若教随伊根机，自有三乘十二分教。’在今先生如说云云，不但显违赵州，而亦大背宗旨。”如是数问，先生不答，巍然据座，众渴闻义，敬候朗音。<p>久之先生顾示诸子，弹指一声曰：“会么？”<p>进云：“不会”<p>乃曰：“凡圣情尽，谁知凡圣？体露真常，体所露者何一非妄？即妄即体，真从何露？今既有真，何真非妄？文言非实，若无文言，即云实邪？若然三乘十二不如死牛死狗，汝学佛乘纵极其至，死牛死狗也，何有于道？昧孰甚焉！又三乘十二若非本分，若非宗旨者，舍三乘十二即本分，即宗旨邪？如是彼说不通三乘十二者，不闻三乘十二者悉为本分，悉为宗旨也。是汝学佛乘为冤，不亦谬乎？固不仅三乘十二也，曰山川，曰草木，曰鸟兽，曰昆虫，曰星辰、雷电、风雨、晦明、人我、众生等，何一而非本分？何一而非宗旨？故经曰：‘刹说尘说，三世一切说。”<p>“又曰：‘山川、草木、鸟兽悉皆念佛念法念僧。’非本分，非宗旨，宁如是云云乎？至于溪深长，添杓柄，三界内，碍石头，见水知源，睹星悟道，踢翻溺器，蹴破脚头，缘风动以知还，闻雷声而悟本，从朝至暮，亘古及今，无一时、无一事、无一法、无一物、无一人、无一言、无一理而不是本分，而不是宗旨也。彼以彼为宗旨本分，此以此为本分宗旨。彼若来此，此必毒打彼三十棒。曰赵州，赵州为何信口开河，不畏人言如此，你卖胭脂我卖粉，买个猪头大家啃。从此各做各的梦，各行各的路，清天白日一物也无，晴空万里不挂片丝，再莫骗人家男女了。”言已，复顾视诸子曰：“会么？”进云：“不会。”<p>先生曰：“咄哉！舍却生盐亭而觅死赵州，驴年会道去。”<p>进云：“如示云云，彼一是也，此一是也，学人浅机何去何从。”<p>先生曰：“从此。”进云：“何故从此？”<p>先生曰：“九天阊阖开宫殿，万国衣冠拜冕旒。”<p/></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "中庸胜唱",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>口授 盐亭袁焕仙先生<p>编撰 乐清南怀瑾、南充徐剑秋、内江伍所南<p>记义 华阳吕寒潭、西充杨介眉、潼南傅仲穆<p>记事 &#13;盐亭范天笃、潼南田肇圃、盐亭黄人俊<p>记言 广汉杨光代、盐亭王乃鹤、盐亭邓岳高<p>校讹 &#13;峨山大坪寺释通宽、峨山龙门洞释演观、奉新许建业、内江冷笑岑、内江曾鹤君<p>缮稿 隆昌饶盛华<p><a href=\"#&#x7B2C;&#x4E00;&#x7F16; &#x603B;&#x8BF4;&#x5206;\">第一编 &#13;总说分</a><p><a href=\"#&#x7B2C;&#x4E8C;&#x7F16; &#x6B63;&#x8BF4;&#x5206;\">第二编 正说分</a><p>一、统说中庸 第一章<p>二、赞美中庸 &#13;第二第三章<p>三、难行中庸 第四第五章<p>四、践履中庸 第六七八九十章<p>五、一趣中庸 第十一章<p>六、遍行中庸 &#13;第十二十三十四十五章<p>七、保任中庸 第十六十七十八十九章<p>八、显用中庸 第二十章<p>九、要中庸第 二十一至三十二章<p>十、结中庸第 &#13;三十三章<p><a href=\"#&#x7B2C;&#x4E09;&#x7F16; &#x7ED3;&#x8BF4;&#x5206;\">第三编 &#13;结说分</a><p>　序曰：孔氏之学，该于六经。而子思独传《中庸》。汉儒稽文，程朱言理。皆欲探微言，抉大义，以承圣统。而至道叆[云+费]，门户各标，彼唱此非，莫衷一是。遂使后之学者，迷其径趋，望洋兴叹，不亦大可哀乎！剑秋。怀瑾等比来潜心内籍，栖志心宗，遍叩丛席，得闻盐亭袁先生焕仙出世维摩精舍，诸方重之。今夏都讲，剑秋、怀瑾等数数参谒、叩以心要、先生皆笑而不语。久之乃曰：\"若平昔酷嗜何籍？\"对曰：\"《中庸》。\"曰：\"何谓中庸？\"以不偏不易之义对。曰：\"偏而易非中庸邪？则圣人之道隘，而法有增减去取矣。\"进曰：\"偏与易即中庸邪？\"曰：\"圣人之道泛，法无去取，中庸之名虚立矣。\"如是数问数答，茫然罔措。因与潼南傅仲穆、释通宽诸君子共师先生。就精舍敷座列席，恭请讲授《中庸》。诸子轮记，剑秋、怀瑾校稿。校已，陈先生阅正。意固在乎激策同俦。久之，遂成巨帙。斯帙也，妙叶圆通。义诠孔释，阐幽扬隐，然诸佛之心灯，振瞶发聋，续吾儒之绝绪、诚剑秋、怀瑾等生平所未常闻，亦即孟荀而后仅有之说也。庸讵知二千余岁已绝之薪传，得续于今？旷代而下，求孔氏之知音如先生者几人！几人！乃请于先生之前曰：\"振宗风，正儒学，续众生之慧命，轨万有之一行，胥赖是篇，愿以公世。\"先生不答。侪辈攗摭鸠工，付之剞劂。 &#13;<p>先生盐亭龙顾井人，父品三，母氏谭。袁、谭皆邑之望族。以先生夙慧，课责綦严。年十三，即遣应童子试，名列前茅，老宿震之。三十服官，四十反政，锐志心宗。自反政迄今二十年，朝夕罔替，发明大事。蜀中尊宿潼南傅真吾、大竹萧静轩、巴县朱叔痴、荣县但懋辛诸先生等，成维摩精舍，恭延先生主法。剑秋、怀瑾共诸子得闻希有义谛，诚先生一音之转，然亦诸大德共缘之会也。此帙有时以禅说《中庸》，有时以《中庸》说禅，有时《中庸》与禅共说，有时《中庸》与禅共不说。把百千万亿形形色色入一句中，于一句中演出百千万亿形形色色。尘尘剎剎，有有空空。不立一己，不趣他同，诚万有之奇观，百类之殊至也。若曰逃禅泥孔，泥孔逃禅，讵曰拘墟？聿云眼瞎？门人南充徐剑秋，乐清南怀瑾敬序。<p><a name=\"&#x7B2C;&#x4E00;&#x7F16; &#x603B;&#x8BF4;&#x5206;\">第一编 总说分</a><p>第一章 &#13;悬说<p>先生曰：\"胜义幽邃，离即总殊，曰孔、曰释、日老、曰庄、耶、回。示范途有千差，原体理非二致。归其径于玄宰，溯其说于灵枢，极其理于相外，都非语言能诠、意识能缘。夫意识不能缘、语言不能诠，说者何说？闻者何闻邪？仲尼曰：'予欲无言。'子贡曰：'夫子之言性与天道不可得而闻也。'固实诠真，讵曰吝法？且非攻异。若然，《诗》、《书》、《论》、《孟》、《礼》、《易》、《春秋》，非儒家者言邪？三藏十二非释家者言邪？大小可兰，新、旧约，乃至《道德》、《南华》、诸子百家，非耶、回、老、庄诸贤哲之言邪？春而仁，夏而荣，秋杀冬藏，彼四时者又无情之言也。有情、无情且费然而言，今曰无说，又曰无闻，无乃非欤？曰：'否！否！'惟无言也，所以成言之大。惟无闻也，所以全听之绝。大言绝听，弦外希音，固非探堂达寝者不足以及乎此矣。<p>\"昔须菩提尊者岩中宴座，诸天雨花，赞叹者曰：'空中雨花。赞叹是何人？云何赞叹？\"天曰：'我是梵天，敬重尊者善说般若者。'曰：'我于般若未尝说一字，云何赞叹？'天曰：'如是，尊者无说，我乃无闻，无说无闻，是真说般若。'庄子曰：'言而足，终日言则近道﹔言而不足，终日言则近物。'皆斯义也。明乎此，《诗》，《书》、《论》、《孟》、《礼》、《易》、《春秋》，三藏十二，乃至耶、回、老，庄、百家等，汗牛充栋，实无一字。惟无一字也，《诗》、《书）、《论》、《孟》、《礼》、《易》、《春秋》、三藏十二部，乃至耶、回、老，庄，百家，驾日月而常明，亘天地而同枯矣。<p>\"非仅此也，凡百工技术、声、光，电、化、山鸣谷响、鸟兽之啼，昆虫之迹、岳峙之静、江流之动，若常若变，若是若非，若长若短，若色若无色，若人若我，若圣若凡，宁越斯义？所谓剎说尘说，三世一切，墙壁瓦砾等，永日通宵炽然而说也，不然，释氏不云不二，孟子讵曰尧舜与人同？漆园无天地与我并生、万物与我为一之论矣。知此胜义非语言能诠、意识能缘，或不诠不缘，即诠即缘。当人自知也。<p>\"昔者临济玄于僧堂里睡，其师黄檗入而见之。以拄杖打板头一下，临济举首见檗，却又睡去。檗复击板头一下，而往上间。见首座坐禅，乃曰：'下间后生却坐禅，汝在这里妄想作么？'座曰：'这老汉作什么？'檗又打板头一下出去。当时有个沩山老人把这一则事迹举问仰山曰：'只如黄檗意作么生？'仰山曰：'两彩一赛。'知此胜义，为语言能诠、意识能缘，或不能诠、不能缘？亦自知矣。<p>\"既知也。所谓孔，所谓释，所谓耶、回、老、庄一切贤圣、一切胜义、一切三昧、一切修多罗、一切功德海、五明、六通，无不焕然等见，当体圆成，法尔具足，不假他求。此本经所谓达天德者，亦即《盂子》所谓大丈夫，《大学》所谓有斐君子，释氏之文殊普贤大人境界、老庄谓之至人，叉曰玄宰，回教安立九天四圣之阿尔实库西两天至人，又曰真宰，耶稣谓之上帝，又曰主，皆一体而异名也。倘不于此一觑觑破，日向善知识前或古人故纸堆中寻章摘句，称郑称扬，谓为多闻，言称开士，此无智人，睦州斥为担板汉，永嘉觉谓之痴狂外边走也。勉之！检之！\"<p>先生说是语已，凝然冥坐，四众惘然。有问者曰：\"凡圣既云不二，一切本自圆成也。他固不问，如何学人不同孔释、孔释迥非学人？尚望哀而详示。\"<p>先生闻此语已，顾示大众。良久谓曰：\"会么？\"进云：\"不会。\"先生曰：\"赖汝不会。不然，我一篇无疾而呻、无韵而哦的话言从何结局？\"复曰：\"会么？\"进云：\"不会。\"<p>先生曰：\"万里凉风嘶逆马，一天明月到故人。\"下座。<p>第二章 &#13;略例<p>演唱、普说、小参、上堂、训诂、拈提、论赞，种种安立名言，要不外显用明体，立己破人也。演唱者，滔滔如洪波之激海﹔普说者，粒粒若圆器之倾珠﹔小参则随缘而赴机﹔上堂乃树范而风远。言必该典，训诂为尚﹔义叩专工，拈提乃通﹔至于论赞，抑扬乘其褒贬，去取悉轨阳秋，今此之说，有难遍及。仅以左之三支，诠其义而通其余。例固不仅三，故曰略也。<p>一释字。此土以语言文字诠理及事，不通字义，斯晦也。开例之首，先及之。<p>二通义。义不通，行焉笃？笃行全事，激义居先。故次释字曰通义。<p>三拈提。释字之失，臻其至，则蔽物。通义之失，臻其至，则囿理，蔽物囿理，宁曰中庸，超方之立于焉尚也。爰立拈提。<p>《书》曰：\"汤执中，立贤无方。\"《齐物论》曰：\"天下莫大于秋毫之末，而泰山为小﹔莫寿夫殇子，而彭祖为夭。\"云门曰\"顾鉴咦\"，首山曰：\"家家门前火把子\"。之数者，超方之似也，明此而后，出主人奴，把头作尾，无德不通，有感斯应。终日囿于理而远乎理，蔽于物而外乎物。不守一家之言，不倚他人之户。不立自己之场，不落圣贤之臼。不任运而闲闲，不役形而戚戚，不舍雅而居俗，不远俗而鸣高。不立异以非同，不趋同而舍异。或时用字作义，或时用义作字。或时字义两用，或时字义两不用。以之而说《中庸》，则中庸法如是﹔以之而说凡圣，则凡夫圣人法如是﹔以之而说百工、伎艺、曰兵、曰农、曰商、曰教、曰财等等法，而此等等一切法无不如是也。此超方之的旨，拈提此旨以示人，古人谓之\"评唱\"。又曰\"拈题\"。今演《中庸》，例固尚乎此矣。日词丽、曰文藻、曰典、曰雅、曰高、曰幽，一切胜名，都非所尚，必曰然诸圣之心灯，续众生之慧命﹔揭宇宙之至理，轨万有之行。责固肩夫貌躬，义讵让于当仁？此心此志，山岳可移，之死靡他矣。若曰斯言也，似离经﹔斯义也，实叛道，乃至佞佛逃禅，骛外盲内，一切游词，诽语、谤论、邪言，都非所计！<p>第三章 &#13;诠《中庸》之胜义次第，拈东西学者之失<p>浅尝西学之人，每病东土之说。曰：\"事失后先，语每颠倒，条理不纲，杂糅不治。\"且引《孟子》七篇、《论语》二十章而难曰：\"任何一事，可先可后。任何一则，可入可离。又语无回互，理失沟通。所谓破立皆不合乎逻辑者也。\"救者曰：\"否！否！\"是固拘墟而囿隅，盲者之言也。置无论，以余诠《中庸》十章言，首章显体用之极则，明相行之上起，而总说中庸。立现隐显微等说，以诠其所不能诠。盖无相中而立相，无言中而立言也，依此体用相行之假名，激信愿行，证之至叹。故二、三两章依之而赞美中庸，因赞而愿，因愿而行，因行而知难也。故四、五两章又以难行显夫中庸。盖行人驰求向外，背本逐未，出入生死，长梦不醒，且终日在中庸道中而不自知有此一段大事。<p>先觉悯之，师友激之，于焉乃泛归舟，适彼乐土，瞻望靡及，始知其难。在未掉回舟前，固瞢瞢然忽而易之也。七十子之徒，终身役此而不能息。故子贡问于仲尼曰：\"愿闻有所息。\"仲尼曰：\"生无息。\"子贡曰：\"然则终无息乎？\"仲尼曰：\"有。视其圹聿也，坟如也，则知所以息矣。\"子贡曰：\"大哉！君子息焉，小人伏焉。\"难为如何？又雪峰九上投子，三到洞山﹔长庆坐破几多个蒲团﹔释迦舍却头目脑髓，其难又为如何？耶稣谓其徒彼得曰：\"汝当三次不识主。\"耶稣殁，彼得果三反乃洞了此义。了此义已，即请身殉。先圣后圣，前知末学，见道因缘虽有千差，于此生难，实无一异。今曰\"先后失次，条理不纲，杂糅不治\"，盲乎非邪？<p>既难行也，讵不行哉？六，七、八、九、十诸章，乃拈古准今，曰舜、曰回、曰由，皆以难行能行而履乎中庸。既履已，回思畴昔，逆数多生，遍观诸有，皆以不履中庸，流浪生死，轮回六趣，出奴入主，枉受苦乐，虚萦是非。今也如实了知，曰人、曰我、曰物、曰非物，由来不动一念，不启一行，都在中庸道中矣。无一时之或逾，无一事之或愆。只以驰求心、人我心、是非心、一切处、非一切处如是等心，障而难入，自不肯趋。于焉悲喜交激，喜如是难能之法，而我幸能得履于中庸也﹔悲如是平遍之法，而人与我无始驰求不能履乎中庸也。于焉乃生二障：<p>一自许 &#13;行人届此彻见人我不二，物我不二，法我不二，一切圆成，不假他有，遂生满想。自云已足，讵知此正孔氏之谓\"入德\"，宗下谓之\"知有\"。云门曰：\"直得乾坤大地无纤毫过患，犹是转句者也。\"（按：云门偃上堂云：\"直得乾坤大地无纤毫过患，犹是转语。不见一色,始是半提。须知有全提时节\"云云。宗师语句，本无实法。宁有是处？曰权、曰实、曰体、曰用、曰全提、曰半举，无论形形色色，有有空空，都以诱掖行人入德，奖劝当机履乎中庸。若曰实法，不但损人而亦埋己也）释家者言谓为解脱深坑，又云般若酒醉人难救。宗门下客谓之净裸裸处，二乘圣人悉住于此。洞山曰：\"恰似入京朝圣主，只到潼关即便休。\"子思哀之。十一章引孔子之言曰：\"吾弗能已矣\"，以策之，俾极于中庸至道，若曰良骥，自必见鞭影而兴驰矣。<p>二竞异 &#13;行人届此无上支之过患，必自忖曰：\"本自圆成，不假他有。何百千三昧、一切功德海之于当人或具或不具、或具而不透、或透而不周邪？\"于是妄计优劣，横较短长，朋从尔思，繁兴尔疑。曰修性、曰修命、曰龙虎、曰坎离、曰汞、曰铅、曰玄、曰丹、曰采补、曰药石，乃至符录、咒祓、解幻、巫蛊等莫不由此竟异一念而生。既生也，害于外，则黄巾、白莲祸社会国家、贻及后世而罪不可赎也﹔害于内，则穷劫而不得择乎中庸，流浪生死，沉沦六道，头出头没，而苦不能出也。讵知初生之虎，体虽具有虎形，而用尚不能畏犬，况曰吞牛，及形而壮也，百兽犹慑其威，宁曰服豕？仰山曰：\"三明六通，是圣末边事。但达本识心，不愁其末，他时后日，自具去在。若未得本，纵饶将情学他不得。\"又以沩山语信之曰：\"凡圣情尽，体露真常。事理不二，即如如佛也。\"子思悯之，引孔子之言曰：\"索隐行怪，后世有述焉。吾弗为之矣。\"以折之，俾住于中庸至道。若曰开士，自必见归车而思反也。<p>故十一章以索隐行怪、半途而废等说以折之、策之而一趣乎中庸。十二、十三、十四、十五四章曰君子素位而行，曰道不远人，曰行远自迩、登高自卑等，乃扇示行者，如君子也，圣人也，夫妇之愚也，一一平常而遍行中庸矣，因难行能行而践履，而一趣，而遍行也。曰\"条理不纲，先后失次，杂糅不治\"，又盲乎非邪？<p>十六、十六、十八、十九四章，行人既一趣而遍行也，必令其长养善保之。四章者，首曰鬼神之为德，以\"不可度、不可射、不可听、不可遗\"而形遍行之殊致，所谓空有无、齐物我者也。曰舜其大孝，曰无忧者文王，曰武王周公其达孝，皆保任之至，洞上《宝镜三昧》曰：\"臣奉于君，子顺于父。不顺非孝，不奉非辅。\"孝之至，乃保任之至。保任之至，而用、而大用、而妙用于焉繁兴。此四章者，又以顺、以孝而保任乎中庸者也，故二十章举哀公问政以显中庸之全体大用，明圣道之无所不该。<p>夫为天下国家也，修身也，劝百工也，柔远人也，怀诸侯也，如是等用，溯其源，稽其行，宁在博学、审问、慎思、明辨、笃行外邪？一切神通、一切三昧、一切功德海悉在乎斯矣。行人证此，具效必显。故曰虽愚必明，虽柔必强。既明且强也，以此图功。何功不奏？以此京物，何物不臧？未闻田园不治，已业不修，终日兀坐，逞符咒、烧铅汞，为经邦国大天下也。亦未闻舍治家国、平天下、利人物为繁兴大用也。不然，妖人也，讵中庸至道邪？续众生之慧命，然诸圣之心灯，揭宇宙之至理，轨万有之一行，其在斯乎！其在斯乎！此章以文言为承上启下，以组织言为中枢，以义言为的轨，以超方言显万化之穷通，笃一行之常异，固以用而显乎中庸者。所谓：\"芍药花开菩萨面，棕榈叶现夜叉头\"。孟子曰：\"自西自东，自南自北，无思不服。\"此之谓矣。<p>二十一章乃至三十二章，立诚显明，即明诠理，因理即事，横通直达，述古要今，穷理尽性。立规度，法天时，所谓穷四时之态，拈万有之殊。渊渊其渊，浩浩其天，以要《中庸》三十三章，七引《诗》言，六称君子，而以无声无臭归结在未说未立以前，是未说前了无一物，一张白纸。既说后了无一物，一张白纸。正说时丝忽迹相不留，纤微事理不寓，了无一物，仍是一张白纸。首尾互通，中如裂帛。霁如雨过天晴，皎如云开月白。以结中庸，而精而密，有心皆通。行人证此，即中庸也，记曰：\"鹤飞千尺雪，龙起一潭冰。\"懋矣哉！夫《中庸》者，果有起有结邪？盖就其文与方便而言也。今表之：<p>一、统说中庸 &#13;第一章<p>二、赞美中庸 第二第三章<p>三、难行中庸 第四第五章<p>四、践履中庸 第六七八九十章<p>五、一趣中庸 &#13;第十一章<p>六、遍行中庸 第十二十三十四十五章<p>七、保任中庸 第十六十七十八十九章<p>八、显用中庸 第二十章<p>九、要中庸第 &#13;二十一至三十二章<p>十、结中庸第 &#13;三十三章<p>总上之说，必武断曰：\"任何一章，可先可后﹔任何一则，可入可离。\"且曰：\"破立皆不合乎逻辑。\"得乎？此固拘墟而囿隅，盲者之言也。于是往反数诘。<p>先生笑而谓曰：\"如说，古哲所谓一付棺材，两个死汉也。惑哉！惑哉！记曰：'智不囿物，贤不拘方。'逻辑者，论理学之别名也。轫于西方希腊哲人时代，当我土周之中叶，原文逻辑，意盖指为合理之思想与语言矣。明季李之藻译为'名理探'，清季严几道译为'名学'，有税务司者，又译为'辩学'。'论理学'，日本之译也。今曰'逻辑'，音译也。如佛经'般若'译智能，而义不能尽，仍存'般若'之名也。极其大，究其小，融其中，不外语言、思想之合理化。我此胜义，非语言能诠、意识能缘，纵合其辙，不为益﹔反其轨，讵曰害？如明暗之于太空，明者自明，暗者自暗，于空何有？<p>\"必曰合逻辑，未轫此名此义前，实无逻辑，必曰不合逻辑，既轫既立此名此义后，实需实宜有此一学。不然，逻辑之名，宁轮至今？就立此学之场而言，宇宙之大，科哲凡圣等学之宏，欲研讨之，无不适用此学。就破此学之场而言，宇宙之大，科哲凡圣等学之宏，无一可适用此学。何也？诸名无常，皆是假立。非真非实，非至矣。<p>\"然则至实至真至至，伊何？曰'中庸'矣。中庸之义，不可以语言诠、意识缘，在前悬说章已罄。中庸之名，姑待后文释名章而演。今以约而言，方便而谈。中者，体也﹔庸者，用也。遍凡圣、罄空有之学，即事即理，不越体用。体者，显用之理﹔用者，明体之物。无体不显用，无用不明体也。即无理不成物，无物不显理也。西方之学，多由用而归体，故拘于物﹔东土之言，多明体而及用，故囿于理。拘物之弊，每泥条理。所谓'死在句下'者也。囿理之病，失在涣杂。所谓'远乎环中'者也。然此亦法尔如是也。彼由用而反体，舍此物之理，此物之理谓条理井然也，则胜行何起？此由体而起用，舍此理之物，此理之物，即涣杂不拘也，则蹄筌何忘？故曰西门东门，皆可入城。又曰铁器火器，都能杀贼。城也者，喻中庸之大道也。贼也者，权执西执东之妄计也。东门之人谓西门之人曰：'必东门入而后及城。'亦犹西门之人谓东门人曰：'必西门入而后达城。'其惑一也。持铁器者遇贼时必曰：'火器杀贼为利。'于是舍铁器而别觅火器，而贼鮆。亦犹持火器者遇贼时必曰：'铁器杀贼为是。'于是舍火器而别觅铁器，而贼鮆。其惑亦一也。讵知'到头霜夜月，依旧落前溪'邪？<p>\"惜哉！惜哉！孔氏的旨，中庸大义，孟荀而后己失薪传。治汉学者曰今文学派，曰古文学派，要皆借他人门面为自己装璜，著书等身，更不过品行端洁而已，至品行之不端洁者，更可悲也。治宋学者，自云得不传之学于遗经，在汉学家，犹依据古人故意释经证古，今则终日兀坐，且誉静坐者为真好学。然则不兀坐者即非真好学邪？碍如此！又曰'春来不折枝。折枝有伤天地好生之德。'迂如此！毕生把一个'私欲净尽，天理流行'的话言律己身，验学人，又浅薄如此！苦哉！苦哉！孔子之学、中庸之道，竟被他汉、宋两派学者和会杂糅，于是乎亡全丧真，不但觅无灵魂，而筋肉皮骨都不可得也。<p>\"圣人之学，若在字义或事理，十五入学，七十从心，白费工夫矣。圣人之学，若在终日兀坐，春不折枝等，少正卯不必诛，乃至师项橐琴师，襄官、苌弘，礼老聃，游说于盗跖，自卫返鲁，述礼正乐等，及汤武一怒而安天下之民，背义失道矣。可乎？可乎？私欲净尽，天理流行，亦一期方便之言、半途之说，登堂达寝者，固不如斯。何也？二法矣。法既二，岂《中庸》云'其为物不二，则其生物不测'之义乎？讵知天理即人欲，人欲即天理，舍天理别无人欲，舍人欲亦别无天理也。天理人欲，实不二，然又非一。果一也，圣人即凡夫，凡夫即圣人。吾侪学圣人者，是以圣人而学圣人，头上安头也。果二也，圣人终是圣人，凡夫终是凡夫，吾侪学圣者，明知其不至而欲至，是嗜甘者知芩连为苦而大嚼也。惑哉！惑哉！昔临济玄云：'淮知吾正法眼藏，竟向这瞎驴边灭却。'然欤？非欤？亦可笑也！（按：临济此语，非罚非赏。今借作罚，实一期行言之便。读者若认作实罚实赏，不但不会临济此语，而亦冤诬古人，自投涂炭也。）<p>\"仲尼之道欲绝而未绝，汉宋两派学者傅会比拟而道遂绝。老庄之道将亡而未亡，丹道符?两派学者立奇鸣异而道遂亡。然则吾土黑暗矣。曰：否！否！有释氏之学起于晋宋，心灯西照，吾学东明。不然，孔子何以谓之圣？孟子何以权名贤？吾侪且不得而知也，况微言大义，圣学薪传乎？昧者不报饮水之源，翻仇惠我之好，曰佞佛、曰逃禅亦可丑也！甚有窃议余说为糅杂五宗，不守一德者，亦昧甚矣！夫圣人之学，不但不守一家，即人即我，亦当摈而不守。孔曰毋意、毋必、毋固、毋我，佛曰人无我、法无我，老曰吾之大患，为吾有身，庄曰今者吾丧我。此也，又不但杂糅五宗也。物并育，道并行，孔子之言﹔不齐之齐，庄生之化﹔自他不二，释迦之说。讵知世无孤独而不朋从之理事乎？纯一材不成屋，纯一人不成家，纯一事不成国。如只柱无余，屋不成﹔只男无女，家不成﹔纯一财而无兵农等，国必不成。此如是也，况演唱圣人大义、中庸的旨乎？今曰不守一德而杂糅，古德曰两个驼子相逢，说世上而今无直人也。可嗤！可咄！<p>\"役物之弊用。（即由用而未明体者），极其至，则残杀攻伐。囿理之愆（即明体而未起用者），极其至，则柔情不振。此世界之所以日寻兵革，祸不旋踵也。役物多强，囿理每弱。若强则总强，理无战伐﹔弱则总弱，义鲜斗争。此学术好尚之不同，强弱于焉而有异。无怪乎日寻凶暴而不息也。倘不因而救渡，则此全球二十余万万人数，不数百年无遗种，则管领宰割此世界者不为禽即为兽。彼且坐视吾人之肥瘠，待而窥我也，可不儆乎？语曰：'险处岂常忘顾鉴，纵行平地索提防。'余与若敢不勖？曰西、曰东、曰条理不纲、曰杂糅不治、曰无回互沟通、事失先后、语每颠倒等等一切，浮言剩语矣！\"下座。<p>第四章 &#13;中庸释名<p>\"中\"，《说文》和也。从口　。上下通，陟弓切。\"庸\"，《说文》用也。从用从庚。庚，更事也。余封切。<p>朱子申程子之义曰：\"不偏之谓中，不易之谓庸。中者，天下之正道﹔庸者，天下之定理。\"<p>今注曰：\"中，离二边，绝三际，悬立之假名也﹔庸，微二边，即三际，虚言之权号也。\"<p>必曰通上下，然则左右，前后、四隅及中不能通邪？果尔，圣人之道有碍有尽，其得谓之中乎？庸，用也。然则不用时即不得谓之庸乎？果尔，则用与不用，截然画为两橛。《中庸》曰\"其为物不二，则其生物不测\"谬矣。又上对下言，下因上有，无上则无下，无下亦无上。今此曰上，若到今此之上以视乎上，则上在今此之上，而昔所谓今此之上者实居下也。释下亦然。若曰揭一以概余，拈一以通万，摘一以远冗，则又指途不精，行人惑于去取，非所以张圣范而循循善诱于学子莘莘矣。<p>曰：\"不偏之谓中，不易之谓庸。\"然则偏与易即非中庸邪？\"中者，天下之正道﹔庸者，天下之定理。\"夫道有正必有邪，理有定必有不定。偏与易而非中与庸，则中庸之道不遍，圣人之义狭。孔子七十而从心所欲，定逾矩矣。道有邪正，理有定动，《中庸》之言曰\"百世以俟圣人而不惑\"谬矣。其得谓之通义乎？<p>无边不显中，边以中立，中因边有。是无边而中亦不立，无中而边亦不有也。了此乃谓之全边全中。三际者，过去、未来、现在也。然亦假名。过去已去，未来未来，才说未来又已过去。现在亦不住也。不住不得言有。过未亦然。虽不得言有而实有，此过未现之假名，故又非无也。虽非无，而眼不得而见，耳不得而闻，此不见闻中之极则。故曰：\"离。\"论曰：\"其入也离。\"百丈曰：\"离此用，即此用。\"无以名之，假名曰中、曰体。<p>虽非有，而眼实得而见，耳实得而闻。此得见得闻，庸之极则。故曰\"微\"。论曰：\"其出也微。\"百丈曰：\"即此用，离此用。\"无以称之，权称曰庸、曰用。<p>体用相乘而理事成，即阴阳合而化育成也，无体不成用，无用不显体。中与庸非二，然又不一。行人知此，不但《中庸》十章义尽，孔孟毕世之言、老庄罄有之说、释氏三藏、回、耶、百家之旨，一时毕尽，而无丝毫遗异矣。旨哉！旨哉！慎勿自启狐疑，妄计得失。倘无如是等过，一觑即破。子路之拱，曾子之唯，当下现成。大慧杲所谓\"忽地一下\"也。行人果得忽地一下实时证入中庸，而与尧、舜、禹、汤、周公、孔子、颜、曾、思、孟等把手同行。以释家言，则三世诸佛悉在斯也。讵曰\"茅山访道，千里决玄\"邪？不可失，不可忽。勖之！勖之！<p>曰解脱、曰般若、曰法身、曰真如、曰菩提、曰涅盘，曰无上正等正觉，释迦之言﹔曰自然、曰玄宰、曰螭珠、曰灵枢、曰天君，老庄之说﹔曰真 &#13;、曰上帝、曰主，耶、回之语。孔曰明德、曰仁、曰中庸、曰心、曰性等，皆此一事而立多名。马师\"曰\"非离真而有处，立处即真也\"。然真亦因假而有。若无假，真亦不立。千古立则，圣人成化，皆黄叶止啼，都无实义。若泥实义，非圣人之言也。故曰\"戏把枯桐收作乐，权将黄叶指为金\"。知此，上之释字、通义等，通亦得，不通亦得，通不通总得。不然，饶汝把尧、舜、禹、汤、孔、佛、耶、回玄言妙义，蕴在脑中，总是不快漆桶。何也？盖不知\"夜来一派多情月，依旧烟笼十里堤\"也。<p>先生说是语已，顾视大众，以手击案一下，瓦屋皆有声。久之乃曰：\"会么？\"众无语。先生复曰：\"此章释名如是！如是！\"<p><a name=\"&#x7B2C;&#x4E8C;&#x7F16; &#x6B63;&#x8BF4;&#x5206;\">第二编 正说分</a><p>第一章 统说《中庸》<p>第一节 &#13;总论<p>\"梁太子昭明者，开《金刚般若波罗密多经》为三十二分，识者悲之，谓妄割先圣伟范宏言，身陷地狱，名讥大雅。今先生割裂经义，开此十章，明知故犯邪？抑别有绍承而启未来邪？胡不远咎，自毁如此？\"<p>先生曰：\"余早晚入地狱也。\"问者大惑。曰：\"会么？进云：\"不会。\"<p>先生曰：\"昔赵州谂云：'我不入地狱，阿谁教化汝？'比来与若说玄说妙说短说长，义已违乎胜谛，形固囚于情牢。昭明死入地狱，余今生困愁城。非仅余也，先圣后圣，无不共萦此苦。盖至高、至妙、难行、难信之法，初欲演之，非语言能诠、意识能缘。继欲缄口而众生长劫沉沦，爱河莫度，大径不游。故仲尼兴'余欲无言'之叹。至若释迦掩室摩竭，净名缄口毗耶，《楞严》曰'真非真恐泥，我常不开演'，皆此义也。然则终不说乎？此固不可。于焉开方便，示权宜，横说竖说，以说说，以不说说。右之左之，前这之后之，上下之，总以奖策，或诱掖行人履乎中庸而已。既履也，是法可，非法亦可，开此经为十章、三十三章可，千章或一字一章、不立一章均无不可。不然，饶汝鞭笞三藏，驰骋五车，痴狂外边走也。何有于当人邪？今以十章说《中庸》，此而曰统，义固尚乎斯也。\"<p>第二节 &#13;经文<p>{朱注|第一章}天命之谓性，率性之谓道，修道之谓教，道也者，不可须臾离也。可离，非道也。是故君子戒慎乎其所不睹，恐惧乎其所不闻。莫见乎隐，莫显乎微。故君子慎其独也。喜怒哀乐之未发，谓之中。发而皆中节，谓之和。中也者，天下之大本也。和也者，天下之达道也。致中和，天地位焉，万物育焉。<p>一、释字<p>天 &#13;《说文》\"颠也。至高无上。从一大。他前切。\"朱注曰：\"天以阴阳五行化生万物，气以成形，而理亦赋焉。\"今注曰\"轫始而上之谓天。\"<p>命 &#13;《说文》\"使也。从口从令。眉病切。\"朱注曰\"命化令也\"。今注曰\"不能违赵之谓命。\"<p>之 &#13;《说文》\"出也。象屾过屮枝茎益大，有所之，一者地也。止而切。\"朱注无释。今注曰\"出荡十方而无碍之谓之。\"<p>谓 &#13;《说文》\"报也。从言胃声。于贵切。\"朱注无正释。今注曰\"尚其所指而语人之谓谓。\"<p>性 &#13;《说文》\"人之阳气，性善者也。从心生声。息正切。\"朱注曰\"性即理也。\"今注曰\"空有无之谓性。\"<p>显 &#13;《说文》\"头明饰也。从页显声，呼典切。\"朱注曰\"明，显也。\"今注曰\"无处不见曰显。\"<p>微 &#13;《说文》\"隐行也。从（微左部）（微右部）声。无非切。\"朱注曰\"微，细事也。\"今注曰\"无处能见曰微。\"<p>慎 &#13;《说文》\"谨也。从心，真声。时刃切。\"朱注曰\"戒惧而谨也。\"今注曰\"勿忽而不苟曰慎。\"<p>独 &#13;《说文》\"犬相得而斗也。从犬蜀声。羊为群，犬为独也。徒谷切。\"注曰\"独者，人所不知而已所独知之地也。\"今注曰\"灵光独耀，迥脱根尘曰独。\"<p>致 &#13;《说文》\"送诣也。从[故-古]从至。陟利切。\"朱注曰\"致，推而极之也。\"今注曰\"至也，言至于此而证入中庸也。\"<p>二、通义<p>\"天\"，轫始而上之谓天。释氏缘生之说曰：\"诸法不自生，不他生，不共生，不无因生缘生。\"此说统万有，偕诸义。取以释此甚偕。何也？盖有此缘而轫始，上者天也，下者地也，中者人也。权此土而立之假名也。\"而\"，者，谓此土立名，并同化、非同化、人物也。不然，色界、诸天、天人谓上，无色界为天，己色界、下欲界不名曰天，岂通义乎？故曰轫始而上之谓天。故此\"而\"字为不可忽。\"命\"，不能违越之谓命。如轫始为晴，无论自他，不得名阴。轫始而阴，无论自他，不得名晴。故曰\"不能违\"。又不得谓晴后即阴，阴后即晴。且正晴时无阴，正阴时无晴也。故曰：\"不能越\"。有轫始而上曰天。天，上也，颠也。此上此颠，即现示此晴此阴最初一现者。此一现也，在无知之现示者，不能违越，非晴非阴，亦犹领受彼现示者，不能违越非晴非阴也。故曰不能违越。成此不违不越，权称曰命。<p>\"之\"出荡十方而无碍曰之。谓轫始而上而命则此之也。出荡十方而无碍，入则纤毫而不留，使无此之，则彼晴彼阴从何而命而显邪？临济玄曰：\"东涌则西没，南涌则北没，中涌则边没，边涌则中没。\"故曰出荡十方而无碍曰之。<p>\"谓\"，尚其所指之谓谓。盖自尚其所欲言而及他也。<p>\"性\"，非语言能诠、意识能缘。今曰空有无之谓性，盖方便而言也。《说文》\"人之阳气，性善者也\"，朱注\"性即理也\"，两义皆悖。必曰人之阳气性善，然则人之阴气性恶，非性欤？必曰性即理，然则非理非性欤？是此性狭而不遍也，讵知阴阳相乘而化育成，善恶相乘而社会成？故无一事理而不备善恶，即无一事理而不该阴阳。合阴阳善恶，则无所谓事理也。执一事理而曰全，众盲摸象，讵达者之言乎？然则合阴阳善恶，曰理曰事即性乎？曰非。舍阴阳善恶曰事，曰理即性乎？曰：非。然则必如何而曰性？古哲于斯各封己说，必欲诠真，宁逾踰亲证？若然，亲证当依何陟？<p>孟子曰\"性善\"，荀子曰\"性恶\"，告子，孟子之徒也，反其师说曰\"性无善无不善\"。等斯说也，皆远宗乎孔子者也，考《论语》子贡曰：\"夫子之言性与天道，不可得而闻矣。\"夫子贡者，亲炙于圣门，且不可得而闻，余也孰得而闻？又，既不可得而闻，然则此不可得而闻者，为已闻？为未闻？若曰已闻，云胡不闻？若曰未闻，知此不可得而闻者为已闻为未闻亦可怀也。又，子曰\"性相近也，习相远也\"，检《论语》之记问孝、问政、问礼、问为邦，皆有问乃答。今则不叩而鸣，自曰性相近也，习相远也，何邪？讵知希有之法不说不可，欲说无从。虽颜、曾之徒尚不能兴一问，况游、夏乎？今兹去圣已遥，行人内失自修之勤，外无师友之勖，困妙义于字里行间，昧胜行于人欲天理，曰得中庸的旨，孔孟薪传，真缘木求鱼，痴人说梦，自欺欺人矣！讵不惑哉！讵不惑哉！<p>昔余以此义叩一老宿。宿曰：\"此理至明。人性与人性相近，与狗性相远。狗性与狗性相近，与人性相远。近者，亲也﹔远者，疏也。\"余曰：\"止！止！且不问习，人与人性相近也，商臣弒父，五公子争立，乃至夫妇、朋友互相攻贼者，何邪？与狗性相远也，人见狗必致狗死，狗见人必致人死。斯世界者，不尽人必尽狗。云何狗有饲养于人，人不必尽杀其狗者，何邪？\"宿大窘。曰：\"若言伊何？\"余曰：\"此理至明，实无当人摹拟处。若穿凿太玄，傅会过异，则去道愈远，滞而难通矣。夫远近乃相对而立，无近不表远，无远不立近也，相乃连介之说，片面不言相。性者，习之体﹔习者，性之用。无体不表习，无习不见体也。性当体即是，对习而言，故曰近﹔习对境乃有，于性而言，故曰远。\"宿闻语未卒，色然而喜，起而语曰：\"旨哉！旨哉！希有之论也。得自何书？传自何人？\"余曰：\"非因师得，不以书通。每日但虔参一个话头，敬念千声佛号而已。\"宿闻语已，凝神久之。乃怫然曰：\"我已投孔子，不再佞释迦\" &#13;。余曰：\"若不尔者，许先生穷劫不识孔子。何也？不会性相近、习相远矣。\"<p>清之季，华阳谢先生者，以傅大士偈闻余曰：\"空手把锄头，步行骑牯牛。人走桥上过、桥流水不流\"，杜顺大士偈曰\"益州牛吃草，嘉州马腹胀。天下觅医人，灸猪左膊上\"，余闻大诧，立斥其僻且咎具愚，引孔子\"攻乎异端\"，\"不语怪力乱神\" &#13;等说折之谢故笑而不言，三台张先生梦余者，闻之让曰：\"闻忠言而逆。岂开士之行乎？\"乃授余以《金刚般若波罗密经》。余三十服官，四十反政。既反政己，暮究朝参。民二十七年夏，张先生梦余弃世，固已二十年也。忽于成都春熙路遇谢先生，谢神形清逸，怡然自伟。余喜而握其手曰：\"比来如何？\"谢曰：\"潜心净宗。\"余曰：\"若然念佛，进程现为如何？\"谢曰：\"余正念时无念，无念时却念。\"余曰：\"果尔，得念佛三昧也。\"谢曰：\"不敢。\"<p>又二年，复遇于成都之春熙路，相邀品茗。余固知其未至也，复申问如前，谢答亦如前。余曰：\"若然，还往生否？\"谢曰：\"当然往生。\"余怫然而怒，且诘曰：\"无念已得法身，而念法身已起用。无念而念，念而无念，法身即起用，起用即法身。当人当下，即显净土。且能接引众生来生汝土也。今曰往，往何处？又曰生，生何土？襄者足下曾以傅大士、杜顺大士法身颂示余，今云云无念而念，是已得法身。既得法身，此颂当明。即请足下为余通说彼二颂者意果何在？\"谢大沮。<p>余曰：\"若此不会，今为足下寻个注脚。唐之中叶，有尊宿者曾于此偈注云：'太行山上云蒸饭，佛殿阶前狗矢天。剎竿颠上煎锤子，三个胡孙夜簸钱'，其义云何？\"谢闻已，窘如前。余又曰：\"若此不会，再与足下寻一注脚。曹山寂读此颂已，曰：'我意不欲如是道'，门弟子请别作之。其词曰：'渠本不是我，我本不是渠。渠无我即死，我无渠即余。渠如我是佛，我如渠即驴。不食空王俸，何假雁传书。我说横身唱，君看背上毛。乍如谣白雪，犹恐是巴歌'。其义复为如何？\"谢又窘如前。余曰：\"不但足下会他不得，纵饶把这一切玄言妙语会得透顶透底，还是法身边事，犹未透得法身向上事。\"谢曰：\"然则法身向上事为何？\"余曰：\"余言轻，不足信汝。今再以古德言章开若之惑。北宋之末，有一尊宿曰张无尽者，见皓布[衣+昆]举大士此颂。皓亦曰：'斯颂也，只颂得法身边事，而法身向上事则颂不得也。'无尽曰：'请师颂。\"皓遂应声而颂曰：'昨夜雨滂亨，打倒葡萄棚。知事普请，行者人力，拄的拄，撑的撑，撑撑拄拄到天明，依旧可怜生。'当人果于上之一切葛藤了得清清澈澈，而不作了与不了想，庶几无念而念，念而无念。不然，自欺欺人也。\"<p>谢闻语已，窘不自胜，愤不自胜，而喜不自胜。实时礼而诘曰：\"然则比如何而可？\"余曰：\"毋躁！毋躁！足下既念佛也，仍然把一句佛号，朝斯夕斯、行时坐时直下念去，一朝念到无可念处，取不得，舍不得，忽然转身摸着自己鼻孔，或此方报尽生彼方净土，花开见佛，悟无生已。然后洞彻今说，滴滴转珠字，字字吐玉，与三世诸佛一口同音。一切圣贤无二无别，实又一句也用不着，而一字也未说也。\"谢闻说已，欢喜踊跃，色然赞曰：\"希有哉！此论也，开我未闻。\"<p>法身者，性也。某老宿不信而难入，谢先生信而入也。未至斯二先生者，皆今人也。至于古人，二祖断臂，云门损脚，佛灯封衾，性之难注如此！今曰空有无之谓性，义安在？义安在？权语也。<p>一切有情、无情、曰事、曰理，未轫始前固不可状、不可名、不可评也。不可状、不可名、不可评，不得言有。如上晴阴喻，未轫始前不可言晴、或新晴、久晴、晴善、晴不善等。阴喻同。故曰非有。有情、无情、曰事、曰理，既轫始后实可状、实可名、实可评也。实可状、实可名。实可评，不得言无。如上晴阴喻，轫始后不可言现晴、现阴、无晴、无阴。立名与评例同上说，故曰非无。正有时非实有。若实有，有即不坏。晴则总晴，阴则总阴。今不尔者，故曰正有时非实有，因无故有。古德所谓\"言有时纤毫不立\"也。正无时非实无。若实无者，无即不有。若有则不名无。若然，无则总无，而世无若晴若阴之状，况名与评邪？故曰正无时非实无，因有故无。先哲所谓\"言无时遍界不藏\"也。<p>总上之说，法尔如幻。安立权名曰空，有无之谓性。行人如实了知，如实证知，释曰见性，老曰自然、耶曰识主，回曰真宰，孔曰中庸矣。证实相，了生死，得大涅盘，上趣乎三藐三菩提也。此实语者，如语者，不妄语异语者。行人苟不自疑，当下即入，不依他得，不从师授，不因己灵，一切圆成也。曰修性，曰修命，曰坎离，龙虎，三还九转，犀然而妖异自见矣。不然，斯脱网而无日，泛归舟以何年？昔永嘉觉虑行人不能决择，丝路无从也，乃大声疾呼曰\"证实相，无人法，剎那消却阿鼻业。若将妄语诳众生，愿遭拨舌尘沙劫\"，千载下犹耳提面命也。吾人倘不甘暴弃，必自思自反，自怒自谴而涕满襟，而泣滂沱矣。曰亲证者，必依此而陟，讵他异哉？<p>次以五释统说全章经文。<p>（一）释天命之谓性至谓教<p>广言天即性，命即性，之即性，谓即性，一切世间、非世间、遍空有、穷三际，何一而非性？必曰天命之谓性，此一性字而曰性，不可矣。若此一性字乃曰性，余不得曰性，性碍也，狭也，岂中庸博厚、高远、攸久、生物不测之义乎？以约言，不但此一性字也无，而无亦无。不然，下文曰隐、曰微，义当何释？有一滴可睹，一粒可数者，其得谓之隐与微乎？夫广与约，固非性，然亦非离广与约而别有也。盖有非是有，因无而有。无非是无，因有而无。故曰空有无之谓性。性即道，非离性而别有道也，率字与上文之字义。又循也，谓循此性而出即道也。整理此道以示，令其择乎中庸。孔曰入德，释曰见性，修道之谓教也。圣人立言，明显如此，宁有盲者说常、说异、说坎、说离，如是妄计邪？<p>（二）释道也者至不闻<p>虑行人向外驰求，舍心别觅，计外有也。开其说曰\"道也者，不可须爽离。可离，非道\"以救之。既不驰求向外，或执无言、无说、无声、无臭，而潜念无为计内无也，乃申其义曰\"君子戒慎乎其所不睹，恐惧乎其所不闻\"以启之。行人如无如是等过，圣人之言从何而立？中庸之名宁居此世？果于此一觑觑破也，所谓入德、所谓见性、所谓允执厥中、所谓曾子之唯、子路之拱，一 &#13;时瓦解冰消。昧者执何者为胜法劣法，何者为道，何者为教邪？<p>（三）释莫见乎隐至独也<p>不住内外，而虑其任运闲闲，执一切不计为自然、为解脱、为乐天也。乃指的途，示彼显径曰\"莫见乎隐，莫显乎微\"，无处不见曰显，无处能见曰微，若然，显微现隐，一派圆成。何事而非事？何事而是事？任运固闲闲，不任运讵不闲闲邪？君子慎独，独也者，非屋漏自勖、暗室自律，凝神静坐、百需仰人如三家村中土地也。果尔，福必折尽，自救不了，矧曰以道自教教人邪？独者何？灵光独耀、迥脱根尘矣。若曰笃恭暗室，无惭屋漏，此小知细行未脱拘系，安知大象所游，大智所诣，有超然于言相之外者邪？该中庸之大义，续诸圣之心灯，必俟君子。<p>（四）释喜怒哀乐之未发至达道也 &#13;<p>行者沦空有、囿显微、泥内外、执一而不得乎中，或居中而忘于一也，当下专拈曰\"喜怒哀乐之未发谓之中，发而皆中节谓之和\"，何等亲切！何等现成！又虑执喜怒未发为中，发为不中、中节为和、不中节为不和而失圆也，复以体用明之，令行者无时、无事、无地皆能证乎中庸。故曰\"中也者，天下之大本也﹔和也者，天下之达道也\"。本者，中也、体也﹔和者，庸也、用也、达道也。体用之义如上释。<p>（五）释致中至育焉<p>天地位，万物育，中之至亦和之至也。耀全章之统旨，立万世之极规，行人即此乃证中庸，宗门下客曰\"大事了毕\"矣。不然，统谓不至。故曰\"致中和，天地位焉，万物育焉\"。天地位，万物育，乃法尔圆成，非他与，非师授，非求得，非江湖下士所谓取坎填离、乾坤大转、阴阳大交、炼精化气、炼气化种、炼神还虚及修性、修命之一切光影、一切空有。一切玄妙等境界也。此法尔圆成者，中亦育，和亦育、不中不和亦无不育﹔中亦位，和亦位，不中不和亦无不位。臻此，孔子七十而从心所欲不踰距也，华严之\"理无碍。事无碍、理事无碍、事事无碍\"者也。然此一路，不趋己入，非假方便，亦无渐顿，不因师授，不以己求，宁有趋而不入者乎？苟不臻此，葛藤极多。古德云\"枯木岩前歧路多，非上上根人不至。\"何也？彼上上根者，不尝一裔脔而自足，不护己短而轻人，诚求师友，虔修胜行，不底于成势必不已。上上根者，亦非别有他长也。<p>第三节 &#13;拈提<p>宋侍郎张九成者，号无垢居士，未第时，慕杨文公、吕微仲之学。谒宝印明，叩入道之要。明曰：\"此事惟念念不舍，久久纯熟，时节到来，自然证入。\" &#13;复举柏树子话令时时提撕。一夕如厕（先生曰：\"古人用功何等精进！如厕犹勤，余可知也。\"）正提柏树子话，闻蛙声，释然契入。述偈曰：\"春天月夜一声蛙，惊破乾坤共一家。正恁么时谁会得，岭头脚痛有玄沙。\"旋谒大慧杲于径山，与冯济川辈议及格物。大慧杲曰：\"公祇知格物，不知物格。\"（先生曰：\"晴天霹雳，见缝插针。\"）张茫然。大慧杲大笑。张曰：\"师能开谕否？\"杲曰：\"小说载唐人有与安禄山谋叛者，其人先为阆守，有画像在焉。明皇幸蜀见之，怒令侍臣以剑掣其首。时阆守在陕西，首忽落。\"张闻举，顿领微旨。题其轩曰：\"子韶格物，昙晦物格。欲识一贯，两个五百。\"（先生曰：\"若要识真学孔者么？只这是。你看他出格人物何等气慨！不拘一墟，不瞒己，不瞒人，必要澈头澈尾，打穿后壁。\"）<p>又以临济四料拣叩曰：\"此甚议论？\"大慧杲曰：\"公之见解，只要入佛，不可入魔，安得不从料拣中去邪？\"遂举克符问临济至人、境两俱夺，不觉欣然。杲曰：\"余则不然。\"张曰：\"师意如何？\"师曰\"打破蔡州城，杀却吴元济。\"张于言下得大自在，尝曰：\"某了末后大事实在径山老人处。\"（先生曰\"这回不是梦，真个到庐山。\"又曰：\"是谁说的？\"）其甥于宪音侍张次，张令拜径山杲。宪曰：\"素不拜僧。\"张令扣以法要。宪遂举《中庸》\"天命之谓性，率性之谓道，修道之谓教\"以问。杲曰：\"凡人既不知本命元神下落处，又要牵好人入火坑。如何圣贤于打头一着不凿破？\"宪曰：\"吾师能凿否？\"大慧杲曰：\"天命之谓性，便是清净法身﹔率性之谓道，便是圆满报身﹔修道之谓教，便是千百亿化身。\"言已，张顾宪曰：\"于拜何辞？\"<p>先生曰：\"三身具，释氏之学，天地之道尽也。孔、老、耶、回、百家之学亦尽矣。瞎汉！瞎汉！孔子何曾要汝取坎填离、作一切大背圣道、惊奇欺俗等说，曰修性、曰修命、阴阳大转。神存黄庭、气还虚府邪？大慧杲亦何曾教汝取坎填离、修性命为得法化报邪？此不明，害必巨，所谓因地不真，果遭迂曲。今皓首穷研毕生不至者，囿乎此也。可叹！可叹！张无垢，儒老也，潜心内籍，必臻于至，此之谓善学儒。大慧杲，释者也。于儒家者言，精透如彼，此之谓善学释。岂陋者画地自封、同舟较胡越、一室论长短邪？故曰'大象不游于兔径，大智不拘于小节'。\"<p>第二章 &#13;赞美中庸<p>第一节 &#13;总论<p>朱子谓其下十章，盖子思引孔子之言以终此章{天命章}之意，义失偕，何也？十章外余章者，非引孔子之言欤？子曰\"无忧\"，子曰\"舜其大孝\"等，何邪？必曰非释此章之意，然此余章者，何不列于他经如《论语》等，而必归此篇，又何邪？此固例也。至\"次言存养省察之要，终言圣神功化之极，盖欲学者于此反求诸身而自得之，以去外诱之私，而充其本然之善\"等，义虽近是。然亦为初机者说也。若曰升乎堂寝，益滋其病。何也？外诱之私，与本然之善相对为二，非本经\"其为物不二\"义也。<p>又去外诱之私是增，充内有之善是减。不增何去？不减何充？有增有减，岂本经\"不动而信，不言而成\"之义乎？况曰反求诸身而自得，即有自得，必非无得。既非无得，必是有得。若是有得，岂无为义乎？故余是其说为接导初机之是，非是其所是也。初机者不是此德胡入？已入者苟是此业何至？朱子一代硕儒，语失圆透，义远精工若此，盖其所治，乃言前荐得，句下精通，非彻证乎中庸者欤！风穴沿曰：\"设使言前荐得，犹为滞壳迷封。纵饶句下精通，未免触途狂见。\"故余不惜口业而揭如上说。甚矣，立言之难，不亦甚乎？此诸圣在未说前而欲缄口也。余以十章说是经，首立统说，次言赞美，盖因立此之统，故有继统之赞，讵得已乎？黄叶枯桐，原无实义。然则赞何赞？美何美？久之，先生以手示一圆相曰：\"古德云：'不可毁，不可赞，体若虚空无涯岸。大千沙界海中沤，六道四生如梦幻。'\"<p>第二节 &#13;经文<p>{朱注第二章}仲尼曰：\"君子中庸，小人反中庸。君子之中庸也，君子而时中﹔小人之中庸也，小人而无忌惮也。\"<p>{朱注第三章} &#13;子曰：\"中庸其至矣乎，民鲜能久矣。\"<p>一、释字<p>反 &#13;《说文》：\"覆也。从又(厂之简体字)。反形。府远切。\"今注曰\"逆对方之事理曰反。\"<p>时 &#13;《说文》：\"四时也。从日寺声。市之切。\"今注曰\"表过、未、现之假程曰时。\"<p>忌 &#13;《说文》：\"憎恶也。从心己声。渠记切。\"今注曰\"外愧于行曰忌。\"<p>惮 &#13;《说文》：\"忌难也。从心单声。一曰难也。徒案切。\"今注曰\"内愧于心曰惮。\"<p>至 &#13;《说文》：\"鸟飞从高下至地也。从一。一犹地也。象形。不上去而至下来也。脂利切。\"今注曰\"极十方而无往曰至。\"<p>二、通义<p>仲尼子曰者，子，孔子，仲尼其字。曰子思重其说而证其人以信示乎他也。无征则不信，不信则民弗从。民也者，用于政，人民也趣乎中庸，行人也。人民不信，政必失﹔行人不信，述此中庸者无的而放矢，岂子思之意乎？故孟子道性善，言必称尧舜。孔子至人也，犹曰\"宪章文武\"。释曰世尊，皆重其说而定于一尊，以信示来兹矣。不然，于自为不重，于人为轻法，皆过也。后释同后，故不释。<p>有君子中庸，有小人中庸。君子必反小人中庸，小人必反君子中庸。故曰逆对方之谓反。无论事理，法尔然也。此君子者，非曰在位如诗\"彼君子兮\"等，谓彻证乎中庸者，君子也。既彻证也，虽无位，亦君子。反之，在位亦小人。<p>春仁、夏荣、秋杀、冬藏，四时之代谢，君子中庸也。故曰\"圣人者，与四时合其序，天地合其仁.\" &#13;曰仁、曰荣，而曰中庸﹔曰杀、曰藏则反是。曰杀、曰藏而曰中庸，曰仁、曰荣又反是，岂君子行四时之化，履中庸之道哉？君子内无所蕴，外无所诱，当仁而仁，当杀而杀，宜荣则荣宜藏则藏，而此宜此当，丝忽不居，故曰\"时中\"又曰\"无中\"。盖就其用言曰时，即其体说曰无。无实时，时即无。有时用无实时，有时用时即无，有时时无两用，有时无两不用。此君子之胜行，中庸之至德矣。<p>小人反是。曰仁、曰荣放而逸，检于心、鉴于行，罔知忌惮，其至宋襄公、陈仲子之俦也。曰杀、曰藏肆而恣，天变不畏、人言不恤。其弊商臣、盗跖之流也。故曰\"无忌惮\"。无忌惮者，谓行人未彻证乎中庸也。若曰已证，忌惮中庸，不忌惮亦中庸，忌惮不忌惮无一而非中庸。故曰\"中庸其至矣。\"惟其至，行人望而难即，习不能起。故曰\"民鲜能久\"，讵知是法无闲，无闲者。久之至德也。此\"鲜能\"，非君子能能，小人不能。盖君于无能可能，故曰：\"鲜\"。小人有能不能，故曰\"鲜\"，\"中庸其至矣乎？民鲜能久\"﹔义固尚乎斯。若曰中庸之至德，而人而民鲜能者，抑亦久也。岂通义哉！陋甚矣！<p>第三节 &#13;拈提<p>大耳三藏到京，云得他心通，帝命忠国师验之。师曰：\"汝得他心通邪？\"对曰：\"不敢。\"师曰：\"汝道老僧即今在什么处？\"曰：\"和尚是一国之师，何得却去西川看竞渡。\"良久再问，曰：\"和尚是一国之师，何得却在天津桥上看弄猢狲。\"师良久，复问曰：\"汝道老僧只今在什么处？\"藏罔测。（先生曰：\"实见实见，即见即见，真见真见。\"）师叱曰：\"这野狐精！他心通在什么处？\"藏无对。举已。（先生曰：\"只如大耳三藏，是不会无对，会了无对，若在此下得一语，许你亲说《中庸》，亲听《中庸》。\"）又僧问赵州曰：\"大耳三藏第三度不见国师，未审国师在什么处？\"州云：\"在三藏鼻孔上。\"僧后问玄沙云：\"既在鼻孔上，为什么不见？\"沙云：\"只为大近。\"又白云端云：\"国师若在三藏鼻头上，有甚难见？殊不知国师在三藏眼睛上。\"（先生曰：\"当人倘于这几则话言上下得一转语，亲亲切切，不蔓不枝，许你亲说《中庸》，亲听《中庸》。\"）众复无对。（先生曰：\"今天说的呀\"）<p>又昔者僧问嵩山峻曰：\"如何是修善行人？\"峻曰：\"担枷带锁。\"曰：\"如何是作恶行人？\"峻曰：\"修禅入定。\"曰：\"某甲浅机，请师直指。\"峻曰：汝问我恶，恶不从善﹔汝问我善，善不从恶。\"僧良久，峻曰：\"会么？\"曰：\"不会\"，峻曰：\"恶人无善念，善人无恶心。所以道善恶如浮云，俱无起灭处。\"其僧大悟于言下。后破灶堕闻举，赞曰：\"此子会尽诸法无生。\"<p>先生曰：\"试问诸法无生，从何处会？且不说尽。既无处会，赞来，赞来，若云赞他不得，大法无灵﹔如云赞得，龟毛千尺。然则毕竟如何？\"<p>先生以目顾视大众，良久乃曰：\"流水不会怀昨日，桃花依旧到春时。\"下座。<p>第三章 &#13;难行中庸 <p>第一节 &#13;总论<p>千里基于步始，万行肇自机先。上之二章，由统而赞。行人虽未税驾，然扬鞭之概固已潜于念初也。师友激之，环境袭之，于焉决择，乃裹糇粮而古道绝行人，芳草斜阳，马蹄每乱素丝，歧路达者犹迷。在未启行前，放荡西东，回车不辔，固忽而易之也。乃者进不可，退不可，不进不退、上下左右均不可。望前途之茫茫，眇己躬之孑孑。徘徊去取，遂生四难。<p>一、发心之难，<p>二。尚友之难，<p>三、依师之难，<p>四、不自瞒难。<p>一、发心之难，厥有三支：始难、识难、一难也。<p>（一）始难<p>行人无始驰求向外，背本逐末，熟径难忘，欲回车别觅新途，改趋如揽逆舟，不苟安而闲闲、心纷而悬悬者，百不一睹也。今日策其心于坦道，轨其行于中庸，即此回心而为极难。何也？望渺渺而惊远，神怆怆以慑危。故曰始难。<p>（二）识难<p>既回心已，宁有千里无波之逝水？亦无一行不阻之坦途。前境稍违，自心不牧。不希奇异，便困平常，希奇异则阴阳、丹道，越理悖行，万流竞射，一德无归。极其弊，黄巾、白莲、蛊祓、巫觋也。困平常，则囿心一隅，所谓\"坐在黑山鬼窖\"者也。既罹斯咎，百药难辛。此之二过，乃行人忽而失照，遂尔百异千奇，古德曰\"一翳在目，空花乱飞。\"故曰识难。<p>（三）一难<p>无上二支之过，一行斯尚，万派不羁，此为至难。《书》曰\"咸有一德\"，孔子曰\"吾未见好德如好色者也\"。赵州问台山路，婆子曰：\"蓦直去\"，一行之楷则也。故世无不笃行之君子，亦无不二三其德之小人。笃行者，一行也。故曰一难。<p>有上三支如是之难，曰发心之难。<p>二、尚友之难，亦有三支：知难、交难，笃难也。<p>（一）知难<p>无友则我行斯独，有过无攻也。子夏之贤，犹咎独居﹔夏禹大圣，尚拜昌言。倘使雪峰而不取证于岩头，慧南而不切激于文悦，宁有最后一段风流韵事乎？友于当人，重于丘岳矣，然人海茫茫，谁标达哲？纵欲友直，吾其谁从？故曰知难也。<p>（二）交难<p>既知也，人不我与，或与也而交道不终。遗金割席，见弃高明。交难也。<p>（三）笃难<p>仲尼曰\"以文会友，以友辅仁\"，文者，彰内心之之德也。有此内心之德，乃沛外有之文。既有外有之文，斯感辅仁之友。不然，群居终日，言不及义，而囿我于邪行，安我于乱德矣。唐之黄檗者，行乞洛京。有一妪出荆扉，间顾而语曰：\"太无厌生。\"檗曰：\"汝犹未施，责我无厌，何邪？\"妪笑而掩扉。檗大异，进而与语，多所发药。临去，妪复语之曰：\"可速往南昌，见马大师去。\"又，丹霞天然者，初业儒，将入长安应举。有禅者曰：\"仁者何往？\"丹霞曰：\"长安选官去。\"禅者曰：\"选官何如选佛？\"丹霞曰：\"选佛当往何所？\"禅者曰：\"今江西马大师出世，是选佛之场。仁者可速往。\"黄檗、丹霞，果于是行了彻大事。之二者，以文会友之显例也。倘黄檗、丹霞无内蕴之德，失外彰之文，彼一妇人、彼一禅者，非有杯酒之接，一日之雅也，宁有如是之激勉邪？不然，天下人皆激而之南昌也。岂理事哉？经曰\"笃躬而天下平\"，笃躬者，笃内蕴之德彰外有之文也。若然，天下犹平，况交友乎？讵知行人日酖习染，昧而不觉，移山犹易，笃躬至难。故曰笃难。<p>有上三支如是之难，曰交友之难。<p>三、依师之难，亦有三：一值明师难，二启自信难，三会合时难。<p>（一）值明师难<p>我眼本正，因师故邪。今古同慨也。学人本无欣异趋奇，纯然一幅净纸，而师家无实证，一一相似而言，糅杂而谈。问东则对东，问西则对西，为据实之谈﹔问东则以西对，问西则以东对，为超方之说。狐媚学人，亲瞒自己，末法时代，亲证者少，和会者多。一犬吠虚，千猱哇实，所谓\"久竹生青宁，青宁生程\"，天下翕然从风，众盲藐焉归化，虽有独立特行之圣哲，悯众生愚痴，以张慧魔外，恣逞而然犀，亦不可能。何也？君不见乎达摩仰毒、师子断头乎？故曰值明师难。择师具眼，古哲多途。今略以左之二事决择之。<p>１．品行高洁、戒律精严者﹔ &#13;<p>２．不以法缚人、理陷人、无得无授者。 &#13;<p>（二）启自信难<p>既值明师，昧于决择，疑而不信，或信而不专。圆悟懃犹舍五祖演而之金山，黄龙南因石霜圆乃登南岳，故密乘事师，示有仪轨，盖启自信而信人，信人即所以自信也。<p>（三）会合时难<p>知明师也，地分南北，事互穷通，趋庭不易，负笈维艰，所以牛头切思四祖，黄檗谒错马师。故曰会合时难。统此三支，曰依师之难。<p>四、不自瞒难，亦有三，\"一被己瞒﹔二被他瞒﹔三总不被一切瞒瞒。<p>（一）被己瞒者<p>行人自曰一切法尽空有，穷三际，总不外此一心。此心者，我也。若无此心，则一切种种从何而立？既有此立，非我何立？我立有我，我当不坏。今不尔者，修命之说灼焉而炽，则滥觞乎阴阳、丹道、解幻、蛊巫，故曰被己瞒。<p>（二）被他瞒者<p>知心非有，心非有者，然实有有。今既有有，有实因他而有。于是乎炼神还虚之说炽也。故曰被他瞒。<p>（三）总不被一切瞒瞒者<p>己无上之如是等过，认空有一切皆空，执以为是，曰不受一切瞒。于是放荡形外，莫驭环中，置国家于不顾，弃父兄而如遗。身陷险过浪不知非，故曰总不被一切瞒。<p>总以上三支为不自瞒难。<p>行人果于上之数者，穷研而精讨，则立此难行中庸为有意、为无意、为何意，不剖而析也。<p>第二节 &#13;经文<p>{朱注第四章}子曰：\"道之不行也，我知之矣。知者过之，愚者不及也。道之不明也，我知之矣。贤者过之，不肖者不及也。人莫不饮食也。鲜能知味也。\"<p>{朱注第五章}\"道其不行矣夫！\"<p>一、释字<p>行 &#13;《说文》： \"人之步趋也，从ㄔ从　（行右部）。户庚切。\"今注曰\"反止曰行\"。<p>明 &#13;《说文》：\"照也。从月从[\"四\"字内加\"ㄇ\"]。武兵切。\"[\"四\"字内加\"ㄇ]者，窗牖丽廔闿。明，象形，古文明从日。\"今注曰\"破暗曰明\"。<p>二、通义<p>道，中庸之至道。当人一切事理、非一切事理明而适，行而适，无过不及也。不行则天地闭、贤明隐﹔不明则天地晦、贤明遁。贤明者，所以开明天地、式范万流也。反止曰行。今曰不行，则反行即止。破暗曰明。今曰不明，则破明即暗。若然，则君不君、臣不臣、父不父、子不子、兄不兄、弟不弟﹔夫夫妇妇、上上下下，咸失其适。讵中庸之道邪？记曰\"天下昏昏，黯然失钧\"，责固肩乎贤明也。而智、而愚、而贤、不肖，不曰过，即曰不及。愚者固愚而不及，非知﹔贤者又越而过之，亦愚，不肖者，固不及而非贤，彼贤而过之者，亦不肖也。一十五双，宁有轩轾？夫过、不及而失驭乎中庸，无过、不及即趣乎中庸也。至简至易，宁逾于斯？曰行、曰难，无乃冤乎？既趣入也，过亦中庸，不及亦中庸，不过不及、亦过亦及皆中庸。贤亦中庸，愚亦中庸，不肖与智无不中庸。以之京于国则大，齐于家则治，用于民则亲，律于己则逸，柔远人、怀诸候、来百工，无一事而不宜，无一行而不迈。所谓繁兴大用，孔于七十而从心所欲，不踰矩也。下文之必得其位、必得其禄、必得其名，必得其寿，如是已举、未举，一切必得等，不假他求，一时具足，而当人昧不肯趋，习不欲趋，奋不能趋，以至易而形至难搁如是胜行，而不知趋，枉陷沉沦，虚荣生死，真自饮自食而不知其味也。故曰难行。<p>人固无不饮且食者，既饮且食也，叩以味，非不知，然其所以为味者，则昏昏而罔言也。一时不中则失和，一时不和则非中。不中不和，乖戾斯激。人固无一日不履乎中庸也，既履也，叩其道，非不知，然其所以为道者，则昧昧而忘言也。此至简至易，而行者蹀躞难趣。故子思引孔子之言曰\"道其不行矣乎\"，启难行之永叹，兴未学之跻齐。故曰难行。必曰游乎通径，义固在乎当仁。<p>第三节 &#13;拈提<p>问曰：\"此中庸者，千圣之心灯，不思而得，无为而成，当体即是，不假修治，无乃过易欤？\"<p>先生曰：\"唯，唯，过易！过易！\"<p>或诘曰：\"古德千里趋诚，殊方决择。有周克殷，《洪范》 &#13;犹惜传于箕子﹔永嘉入道，妙谛尚趣证乎卢公。况十五志学，七十从心，警枕封衾，铭心断臂者，更 &#13;无论也。无乃过难欤?\"<p>先生曰：\"唯，唯，过难！过难！\"<p>诘者又曰：\"曾子之唯，了在一贯﹔于路之拱，闻于时哉。一唯即得，一拱斯通。此亦何得？既无所得，斯亦何难？又武王受命，经称曰：'末'﹔宝掌闻玄，年已逾耋。彼二至人，尤难如此！实已非易。故曰有缘者得，无心者通。无乃非难非易欤？\"<p>先生曰：\"唯，唯，非难非易。\"<p>如是数问数答，总如前式。海众罔知所寄，默然无语。先生亦肃然在座。久之，乃朗吟曰：\"鹧鸪啼了又鸣鹒，先到黄鹂四五声。毕竟惜春情未已，强扶筇杖为他行。\"吟已，问曰：\"会么？\"众云：\"不会。\"先生曰：\"从古及今，不知谁人能会？\"复曰：\"此章权名难行，盖由统而赞，既赞思行，因行知难，行人当然过程。然师家亦感诲人之匪易也。曰君子、曰小人、曰贤智、曰愚不肖，一切病一切非病，彻底剖陈，通体揭出，而病源贼薮要不外过、不及也。若曰过量人，一闻便悟，一举斯通。借摇扇于江外，假活语于楼中。抑亦钝根阿师，况取语口头，闻玄纸上邪？唐之中叶，有庞公蕴者，庵中独坐。蓦地云：'难，难，难，十石油麻树上摊。'庞婆接声云﹕'易，易，易，百草头上祖师意。'其女灵照复曰：'也不难，也不易，饥来吃饭困来睡。'彼一家者唱和如此。迄宋，有妙喜老人者，圆悟勤入室之骄子也，而于此三则话言，下了一个注脚云：'此三人同行不同步，同得不同失。若以心意识博量卜度，非独不见三人落着处，十二时中亦自昧却本地风光，不见本来面目，未免被难易不难易牵挽，不得自在。欲得自在，将此三人道的作一句看。妙喜已是拖泥带水下注脚也。'云云，汝等诸人若云将此三人道的作一句看，或作道理会，或作无义路解，不但孤负三人，并且埋没妙喜，又自把己置向镬汤烈火中也。然则毕竟如何？\"久之，顾视大众曰：\"千圣不知何处去，倚天长剑逼人寒。\"下座。<p>第四章 &#13;践履中庸<p>第一节 &#13;总论<p>迢迢前路，踽踽行人。回车既辔，险阻斯兴，叱驭悲途，今古同慨也。不行则归思莫偿，即行而道阻难通。此三世贤哲又以难行能行而践履于中庸也。故次难行而曰践履。行人届此许曰入德。倘默默计玄妙之理，津津执贤圣之言，不曰入德，聿云造业。业有二途，曰黑曰白，白喻善，黑喻恶，此又造黑业者也。或曰此谓恶业可乎？曰可。盖谓其滞理沈玄，塞却悟门，穷劫而不得证乎中庸，以善因而遭恶果也，宁曰践履乎中庸？宁曰入德？儒曰入德者，约宗下而言初机也。初机于此，略有三病：<p>一、决择力薄，<p>二、安住力薄，<p>三、精进力薄。<p>一、决择力薄。 &#13;行人流而忘返，今返知难，知难犯难，犯难无难。程子曰：\"用力之久，一旦豁然。\"既豁然已，乃曰入德。然此入也，实有多途。释曰八万四千法门，门门可入。今约而言，安立为三：<p>（一）就体<p>\"三月不违仁\"，\"瞻之在前，忽焉在后\"，\"如有所立，卓尔，虽欲从之，莫由也己\"，如是等等，就体而消。悉曰就体，楷范极多，兹涉其略。古德曰：\"就体消停得力迟。\"盖谓其滞体而难脱落，不能别行一路也。<p>（二）从缘<p>山梁雌雉子曰：\"时哉！时哉！\"子路拱之。又灵源见桃花而悟本，香岩击翠竹以明心，从缘也。古德曰：\"从缘得力者强。\"盖谓其直切契证而远乎情缘意度也。<p>（三）文字<p>依先圣教言，如理而知，如实而行。或观或止，以戒以诚，丕说诠乎已言，幽理彰于未着，曰从文字。古德云：\"从文字得力者弱。\"盖幽虽显著，理难澈忘矣。<p>约开三支，豁然则一，然一豁然而登极地，千古其难，大都半途而滞。经曰\"一切圣贤皆以无为法而有差别\"也。临济三玄、曹洞五位、沩仰圆相、云门顾鉴咦等，纷然而兴、要皆锻炼学人透顶透底而到末后。不然，三藏十二部。孔、老诸经、耶、回、百家之说，从何安立？皆废词也。悟既囿乎浅深，见固别于近远。远而卑近，近又难远。如是交攻，离娄失觅于骊珠，盲人任驰乎瞎马。故曰决择力薄。<p>二、安住力弱。行人无上支之过也，彻见人 &#13;我不二、物我不二、法我不二，而落在无事甲里，习不能拔，或任性奔驰，中行不趋，黄龙慧南曾于若辈悯而下一大拶曰：\"何不无事令有事，有事令无事\"，所谓净佛国土，成就众生。又此言安住者，不以有住而住，不以无住而住，应如是住，而学人昧不能住，故曰安住力薄。<p>三、精进力薄。无上二支之过也，取不得，舍不得，用力不得，不用力复不得，颜渊曰：\"既竭吾才，又竭我力。\"行人企此，每况任运，讵知才有所重便有所轻，轻重交攻，去道愈远。古哲警之曰\"有佛处不可住，无佛处即走过\"。又船子诚诫夹山会曰：\"汝后当藏身处莫踪迹，莫踪迹处莫藏身。\"咨尔多士曰：\"谁跻此？\"故曰精进力薄。<p>总上三支，初机之通病，末法之共难。若曰掇明珠于发髻，度金针于绣师，宁舍乎是？宁忽乎是？<p>第二节 &#13;经文<p>{朱注第六章}子曰：\"舜其大知也与？舜好问而好察迩言，隐恶而扬善，执其两端用其中于民，其斯以为舜乎？\"<p>{朱注第七章} &#13;子曰：\"人皆曰子知，驱而纳诸舌罟护、陷阱之中而莫之知辟也。人皆曰予知，择乎中庸而不能期月守也。\"<p>{朱注第八章}子曰：\"回之为人也，择乎中庸，得一善则拳拳服膺而弗失之矣。\"<p>{朱注第九章} &#13;子曰：\"天下国家可均也，爵禄可辞也，白刃可蹈也，中庸不可能也。\"<p>{朱注第十章} &#13;子路问强。子曰：\"南方之强与？北方之强与？抑而强与？宽柔以教，不报无道，南方之强也，君子居之﹔衽金革，死而不厌，北方之强也，而强者居之。故君子和而不流，强哉矫！中立而不倚，强哉矫！国有道，不变塞焉。强哉矫！国无道，至死不变。强哉矫！\"<p>一、释字<p>迩 &#13;《说文》：\"近也。儿氏切。\"<p>纳 《说文》： 丝湿纳纳也。奴荅切。\"按：\"纳古作内。\"《说文》：\"内，入也。从门。自外而入也。\"<p>择 &#13;《说文》：\"柬选也。丈伯切。\"<p>强 通\"疆\"。《说文》：\"弓有力也。巨良切。\"今注曰\"胜进貌，远乎弱也。\"<p>而 &#13;朱注曰：\"而，汝也。\"<p>革 《说文》：\"兽皮治去其毛。革更之象，古核切。\"朱注曰\"革，甲冑之属。\"<p>矫 &#13;《说文》：\"揉箭箝也。居天切。\"朱注曰\"矫，强貌。《诗》曰'矫矫虎臣'是也。\"<p>二、通义<p>（一）舜其大智全章<p>至德盛业，当下完成，实非他异，亦非自庸。行人每昧昧外求﹔不然，戚戚而内计也，以故转觅转远，转计转非。子思悯之，举孔子之称舜曰云云。迩言恐泥，察之则远患﹔幽理难通，问之则达全，即践履中庸也。两端者，善恶、是非等也。执善恶、是非以用于人，善者善之，不以远于我而恶其善﹔恶者恶之，不以远于我而善其恶，即践履中庸也。人情恶直喜谀，隐其恶而扬其善，使恶者内惩，善者外勖，亦践履中庸也。斯义也，人人能知，人人能行，而人人知而不行。舜固知而行者矣，孔子赞之曰\"大智\"，智固如斯也，岂有他哉？必曰烧丹汞、修性命、书符竞异而曰践履、曰用中、曰胜业、大德惑矣。又知者，慧也。大知者，大慧也。通此释之，三藐三菩提，孔子之中庸也。其易践、易履如此！而昧者不履。即履也，不至。惜哉！惜哉！然此践履，此亦有二：一君子之中庸，二小人之中庸。君子之中庸者，执两用中，隐恶扬善，好问察迩，终日践之履之。影来镜里，风过长空，一丝朕兆不留，半忽迹相无着，所谓超乎事理也。小人之中庸者，亦执两用中，隐恶扬善，好问察迩，终日践之履之，而终日践、终日履，所谓囿乎事理也。君子、小人之践履中庸也，名一而迹异。然迹虽异而践履实又不二。<p>（二）人皆曰予知全章<p>上知不知。今曰\"余知\"，余必不知。何也？驱我而纳于罟擭、陷阱中，我莫之避，知欤？决择乎中庸，我不能期月守，知欤？然则必如何而可？上以舜例，如上\"大知\"云云，下以回明，如下\"一善\"云云，即远乎罟擭、陷阱也。夫大知者，大慧也。一善者，胜行也。大知不知，胜行无行。凡圣非居，善恶寍系？凡圣、善恶且不居，系在罟护擭如观火，居陷阱若游园也。不然，虽以天下荣、四海奉，而形囚利域。志困名场，尽善不善，皆罟擭陷阱也。大慧、一善者，中庸之一体而异名耳。是履乎中庸，罟擭、陷阱即天堂﹔不履乎中庸，而天堂即罟擭、陷阱矣。<p>（三）回之为人也全章<p>闻一知十，人中龙象，入德班头也。得一善则拳拳服膺而弗失。\"拳拳\"者，奉持义，弗失则久而能守义。久而能守，本经不息则久义。程子曰：\"用力之久，一旦豁然贯通\"﹔古德所谓\"生路转熟，熟路转生，自然契证矣。\"行人十百而无一契，病正反此。<p>（四）天下国家可均全章<p>均天下，辞爵禄，蹈白刃，诚难能也。果一策心，夷、齐弃国，之推自焚，成仁取义，于是乎在。此中庸者，即之不可，离之更乖。趣志莫策，识心岂缘？故曰中庸不可能。然亦有二义：一，小人之中庸，未入德者也，去取皆违，无一能是，故曰不可能﹔二，君子之中庸，已入德者也，去取皆中，无一不是。既无不是，何一非庸？果尔，可能且无，况不可能邪？故曰不可能。若曰是中庸者不可能，或必可能，或可能不能、不能可能等，理则滞于二边，事固惑于三际。岂孔子之心灯、子思之薪授乎？<p>（五）子路问强全章<p>\"强\"，胜进貌，远乎弱，以释氏六度言，则情进也。此支明践履的轨，示精进上行，子思引子路之问，揭孔子之酬，启行人之向。曰南方之强、北方之强，抑而强者，而，汝也，即子路，即行人也。强行虽三，而胜进则一。要之以时、以地而立名。非以名而有时、有地也。昧者释此三强有优有劣，有取有舍，碍甚矣！倘优南而劣北，从而取舍其强，则临阵校军，无衽金革之厉行、死不厌之激气，大敌何摧？升平何至？曰和而不流，宽柔以教，不报无道，固善也。不御之，极其弊，必宋襄之仁、建文之义，讵中庸之胜行乎？余二义，释推及之。当人果能游刃乎三强，行超乎一尚，践履之至，亦中庸之至也。<p>第三节 &#13;拈提<p>\"三千威仪，八万细行，释家者言；威仪三百，礼仪三千，孔氏之说。《论语》曰：'入则孝，出则弟，谨而信，泛爱众而亲仁。行有余力，则以学文'等一切名言、胜义，一一践履乎？曰不践履，禽兽也。且孝行如羊、义行如雁、仁行如象、侠行如黄鹞子者，比比焉，可以人而不如禽兽乎？曰必践履乎如是三千、如是八万、如是出则、如是入则、如是行、如是学，是劳形摇心，终日毕生困而不申，讵曰得天、乐天、任天者邪？中庸之至道、孔氏之胜行，或不如是也。\"<p>先生闻已，久之，顾视大众，众无语。乃曰：\"孔夫子说的'在下位，不获夫上，民不可得治也'。\"语已，诘众。众复茫然。<p>先生复以手击案有声，曰：\"荐取。\"众仍无语。乃曰：\"昔径山杲答赵师重书云：当人不见德山有言：汝但无事于心，无心于事，自然虚而灵、寂而妙。若毫端许言之本末者，皆为自欺。何故？毫厘系念，三途业因，瞥尔情生万劫羁锁。圣名凡号，尽是虚声。殊相劣形，皆为幻色。汝欲求之，得无累乎？及其厌也，又成大患。所以释迦老子在法华会上只度得八岁女孩，华严会上只度得个妙龄童子，涅盘会上只度得个市井屠儿。看他三个成佛的样子，又何曾向外取证、辛勤修学来？佛亦只言我今为汝保任此事终不虚也，只说为他保任而已，且不说有法可传，令汝向外驰求，然后成佛。幸有如此体格，何故不信？苟能直下信得及，不向外驰求，亦不于心内取证，则二六时中，随处解脱。何以故？既不向外驰求，则内心寂静﹔又不于内心取证，则外境幽闲。故四祖云：境缘无好丑，好丑起于心。心若不强名，妄情从何起？妄情既不起，真心任遍知。当知内心外境，只是一事，切忌作两般看。记得沩山和尚问仰山曰：'妙净明心'，子作么会？，仰山云：'山河大地、日月星辰。'沩山云：'汝只得其事。'仰山云：'和尚适来问什么？'沩山曰：'妙净明心。'仰山曰：'唤作事得么？'沩山曰：'如是。如是。'我把这一则古文，长长短短摘来作第四章践履中庸的拈提，当欤？非欤？诸仁者试道看。若言当。事隔释孔﹔若言不当，又看作两般。\"众复无语。<p>先生曰：\"富嫌千口少，贫恨一身多。\"下座。<p>第五章 &#13;一趣中庸<p>第一节 &#13;总论<p>万派朝宗，到头原汇一海﹔五灯共焰，彻底宁趋二途？峻路堪悲，笃行斯尚，故次践履而曰一趣。二趣者，忘二边，绝中道，无奇异之可名，无平庸之可形，理无胜劣，义失浅深，寄短于长，位高而下，一是非，齐小大，当人必游之的径，三乘入德之共程，然行人于此每生二障：一自许﹔二竞异。总评章悉举也。然亦有远乎此障，逸然达寝，不假阶梯，遂尔及奥者乎？曰：\"有。\"古德云：\"云门干矢撅，全超法报化。无事出山游，百钱杖头挂。\"虽然不啐地，折暴地断，即程子所谓\"一旦豁然贯通\"者，而云云，寐语也。检之！检之！慎勿闭户而王。<p>第二节 &#13;经文<p>{朱注第十一章}子曰：\"素隐行怪，后世有述焉。吾弗为之矣。君子遵道而行。半途而废，吾弗能已矣。君子依乎中庸，遁世不见，知而不悔，唯圣者能之。\"<p>一、释字<p>素 &#13;《说文》作{[人/人T人/人]/ㄠ/小}。白致缯也。从[ㄠ/小][人/人T人/人]。取其泽也。桑故切。\"朱注曰\"素，按《汉书》当作'索'。盖字之误也，'索隐行怪'言深求隐僻之理，而过为诡异之行也。\"今注曰\"素，质也，<p>本也。\"<p>二、通义<p>朱子曰：\"'素'当作'索'，求也。言深求隐僻之理，而过为诡异之行。\"此义余是而嫌其未竟，何也？索隐行怪，诡迹易彰，愚尚能辨，和者鲜也。和既鲜，害焉巨？此谓\"素，质也，本也，\"非索非求也，盖怪行隐于本素，智而难测。从者众也。从者众，祸斯烈，倘无大人者出，辟而正之，以盲引盲，天下梦然从风。后世翕焉归化。人伦失序，社会不轨。祸可问乎？春秋无孔子，少正卯千古闻人﹔战国失孟轲，陈仲子一世廉士。是非失经，大道何揭？<p>才有是非，纷然失心。行人届此不欣奇异，便困平常。是非名判，吉凶立形。困于常则胜境莫至，功每亏于一篑，事或废自半途﹔欣于异，一德每愆，万行多戾。讵曰索隐行怪？抑亦丝路悲途。然则遵何道乎？曰：\"一道。\"\"一何道？\"曰：\"中庸之至道。\"盖中庸者，事离平异，理绝是非，无斯不服。悉举咸宜。竞秀万行，归咸一趋，故曰一趣。<p>上云\"是非失经，大道何揭\"，又此云\"才有是非，纷然失心\"，自语相违乎？曰：否。否，上之云者，盖未入德，或入而不至，非履乎中庸者也。若而入焉，倘不精检是非，爱河何度？古曰\"度河须用筏\"。既入德或入而至，己达乎中庸者，必曰是非精检，是到岸犹借舟也。总之，此中庸者，当人必亲证，肆口工心，万劫不至。讵语言能诠意识能缘乎？既亲证已，是亦得，非亦得，不是不非、即是即非总得，遁世不见知而不悔亦得，悔亦得。企此即圣人，非圣人而企此矣，若曰必圣人而企此，是凡夫无分也。凡夫无分，然则说此中庸者为圣人而说，不为凡夫而说。岂理也哉？夫食因饥而食，今曰食因饱食，非饥者食，惑乎非欤？故曰语证则不可示人，说理又非证莫了。<p>第三节 &#13;拈提<p>唐牛头法融者，学通经史，雅赅儒典。后落发住牛头山幽栖寺北岩之石室，有百鸟衔花之异。贞观中，四祖道信入山访之。见师意端坐自若，曾无所顾。祖问曰：\"在此作什么？\"融曰：\"观心。\"祖曰：\"观是何人？心是何物？\"（先生曰：\"毒辣！毒辣！\"）融无对。便起作礼曰：\"大德高栖何所？（先生曰：\"可笑拋纶处，金鳞破浪来，\"）祖曰：\"贫道不决所止。或东或西。\"融曰：\"还识道信禅师否？\"祖曰：\"何以问他？\"融曰：\"向德滋久，冀一瞻礼。\"祖曰：\"即贫道也。\"融曰：\"因何降此？\"祖曰：\"特来相访。莫更有宴息之处否？\"融指后面曰：\"别有小庵。\"遂引祖至庵所。绕庵惟见虎狼之迹。（先生曰：\"不识闵颜富，焉之石王贫。\"祖乃举两手作怖势。（先生曰：\"作家宗师，宛尔不同。\"）融曰：\"犹有这个在。\"（先生曰：\"逢人且说三分话，未可全拋一片心。四祖，四祖，我为你呼冤。\"）祖曰：\"这个是什么？\"融无语。（先生曰：\"胡思乱想作么？\"）少选，祖却于融宴坐石上书一\"佛\"字。（先生曰：\"唉！你破戒不小\"。）融睹之竦然。（先生曰：\"然为礼也。\"祖曰：\"犹有这个在。\"（先生曰：\"好说！好说。\"）融未晓，乃稽首请说真要。（先生曰：\"食他唾余作么？\"）<p>祖曰：\"夫百千法门，同归方寸。沙河妙德，总在心源。一切戒门、定门、慧门、神通变化，悉自具足，不离汝心。一切烦恼、业障，本来空寂。一切因果，皆如梦幻。无三界可出，无菩提可求。人与非人，性相平等。大道虚旷，绝思绝虑。如是之法，汝今已得，更无阙少，与佛何殊，更无别法。汝但任心自在，莫作观行，亦莫澄心。莫起贪嗔，莫怀愁虑，荡荡无碍，任意纵横，不作诸恶，行住坐卧，触目遇缘，总是佛之妙用，快乐无忧。故名为佛。\"师曰：\"心既具足，何者是佛？何者是心？\"祖曰：\"非心不问佛，问佛非不心。\"师曰：\"既不许作观行，于境起时心如何对治？\"祖曰：\"境缘无好丑，好丑起于心，心若不强名，妄情从何起？妄情既不起，真心任遍知。汝但随心自在，无复对治，即名常住法身，无有变异。\"牛头闻已，大悟言下。<p>先生曰：\"你说一句良心话，悟个什么？若言有悟，平地吃扑﹔若言无悟，何年返屋住？后与黄梅并挺高誉，从此百鸟亦不衔花，虎狼已不纵横。师乃躬自于百里外负米供众。瞎汉！瞎汉！这便是大人先生择乎中庸而入一趣的好样子！他又何曾说奇说异、说阴说阳、说取坎说填离来？融师乃于百里外负米供众，他又何曾妆点臭架子，摆点滥套头，目示云汉，不顾他人，废自半途来？负米必躬亲，且远在百里，又何曾使唤六丁六甲驱役什么神鬼来？行人！行人！这便是不废半途、不素隐行怪而一趣乎中庸的好楷范！反此，岂君子之行欤？所以说牛头在未见四祖前，未免被他百鸟和虎狼伺出个漏窦。既见四祖后，不但百鸟和虎狼窥他不破，即无数天、无数魔、无数声闻、缘觉、菩萨、佛等，尽未来际亦窥他不破，又不但无数魔、无数天、无数声闻、无数缘觉、菩萨、佛等尽未来际窥他不破，即彼牛头融者窥彼牛头融自己，亦不能破。何也？\"先生以目顾示大众。良久乃曰：\"千山月酿枫林醉，一枕秋饶桂院凉。\"<p>复曰：\"一，数之始。《书》曰'咸有一德'，又'惟精惟一'，《礼记;礼运》曰'欲一以穷之'﹔老子曰'道生一，一生二。'余固曰成于一，败于二。事以专工，业以纷败，自昔然也。中庸<p>之立一趣。意在斯乎？意在斯乎？然执一而不通变，嗜歧而不专工，入德之病。障道之愆矣，昔宋有永明寿者，虑学人各封己说，大道失通，于焉启层楼，馆开士，决择微言，去取邪正，一时的向，翕然从风，所谓轨万有之一趋，启众生之一德者也。昌明宗旨，如日丽天。而提倡净宗四偈，至今成为极大窝臼。吁！圣如永明，犹罹斯咎。立言之难为如何乎？近来学人每每以此四偈叩余，余皆不答，或不得已，乃随书数字与之。为窝臼，为醍醐，幸仁者善自检焉。语曰：四偈煌煌耀古今，行人到此每沉吟。万缘非有休狂趁，一物也无何处寻。戏把枯桐收作乐，权将黄叶指为金。等闲透过成亏话，好听清宵昭氏琴。\"<p>先生说是语已，色霁声和，笑而谓众曰：\"会么？\"曰：\"不会\"。<p>先生曰：\"不会更好。何也？不会我说的，便是一趣中庸。若会，便成了中庸一趣说我了！\"下座。<p>第六章 &#13;遍行中庸<p>第一节 &#13;总论<p>日月经天，崖穴犹嫌明而不遍，矧乃勰天下之大和，泛中庸之的轨，行忘多德，墟拘一隅，可乎？虑行人奋志而棼也，爰立\"一趣\"，倘学者役神而囿，寍舍\"遍行\"？故次\"一趣\"，曰遍行。遍行者，曰智，曰愚，曰远，曰近，曰富责，曰贫贱，曰患难，曰上下，无一行之不遍，然亦无一德之不全，德之全即行之遍，行之遍实德之全，故永嘉觉曰\"一月普摄一切水，一切水月一月摄\"，事固洞乎环中，形必忘于相外者也。倘滞壳于丝忽，迷封于毫厘，乃小人之细行，讵大人之通径？章次第六，安立遍行，意在斯乎！意在斯乎！<p>第二节 &#13;经文<p>{朱注第十二章}君子之道费而隐，夫妇之愚可与知焉。及其至也，虽圣人亦有所不知焉，夫妇之不肖，可以能行焉。及其至也，虽圣人亦有所不能焉。天地之大也，犹有所憾。故君子语大，天下莫能载焉，语小，天下莫能破焉。《诗》曰：\"鸢飞戾天，鱼跃于渊\"，言其上下察也。君子之道，造端乎夫妇。及其至也，察乎天地。<p>{朱注第十三章}子曰：\"道不远人。人之为道而远人，不可以为道。《诗》曰：'伐柯伐柯，其则不远。'执柯以伐柯，睨而视之，犹以为远。故君予以人治人，改而止。忠恕违道不远。施诸己而不愿，亦勿施于人。君子之道四，丘未能一焉。所求乎子以事父，未能也﹔所求乎臣以事君，未能也﹔所求乎弟以事兄，未能也﹔所求乎朋友先施之，未能也。庸德之行，庸言之谨，有所不足，不敢不勉。有余不敢尽。言顾行，行顾言。君子胡不慥慥尔？\"<p>{朱注第十四章}君子素其位而行，不愿乎其外。素富贵，行乎富贵﹔素贫贱，行乎贫贱﹔素夷狄，行乎夷狄﹔素患难，行乎患难。君子无入而不自得焉。在上位不陵下，在下位不援上。正己而不求于人，则无怨。上不怨天，下无尤人。故君子居易以俟命，小人行险以徼幸。子曰：\"射有似乎？君子失诸正鹄，反求诸其身。\"<p>{朱注第十五章}君子之道，辟如行远必自迩，辟如登高必自卑。《诗》曰：\"妻子好合，如鼓瑟琴，兄弟既翕，和乐且耽。宜尔室家，乐尔妻孥\"。子曰：\"父母其顺矣乎。\"<p>一、释字<p>费 &#13;《说文》：\"散财用也。房未切。\"朱注曰：\"费，用之广也。\"今注曰：\"无用不及曰费。\"<p>隐 &#13;《说文》：\"蔽也。于谨切。\"朱注曰：\"隐，体之微也。\"今注曰：\"无用能及曰隐。\"<p>二、通义<p>此开为四：一、知行之遍﹔二、平易之遍﹔三、上下之遍﹔四、远近之遍。遍固不仅四，然以此四而纲其遍。非曰杂糅圣经，固所在而立名，因名而显实也。<p>（一）知行之遍（君子之道费而隐全章）<p>君子之道，无用不及，曰费，无用能及，曰隐。惟无不及也，夫妇之愚、不肖者，无不能知、无不能行，故曰费。惟无能及也，及其至，虽圣人亦不能知、不能行，故曰隐。是法也，非语言能诠、意识能缘。意识且不能缘、语言且不能诠，然则圣人之知，知何法邪？行，行何法邪？知行且无，今曰能知之、能行之，则非圣人必也。故曰圣人若知，则非圣人。语言既不能诠、意识既不能缘，然则夫妇之愚、不肖者，知何法邪，行何法邪？今既的然而知、贲然而行，是无相而相，相而无相之知行已起，则非凡夫必也。故曰凡夫若知，则非凡夫。行人证此，语大，天下莫载，语小，天下莫破。所谓形忘彼我，言绝是非。破立皆不能诠，况乎载不载乎？鸢飞鱼跃，无不察决乎此也。故曰君子之道，造端乎夫妇。及其至也，察乎天地。知行之遍，于焉而立。<p>（二）平易之遍（道不远人全章）<p>子事父、臣事君、弟事兄，朋友先施，自好者优能。今曰孔子未能，谦欤？曰：\"否。谦则近伪。\"\"然欤？\"曰：\"否。此而不能，彼孔子者，又乌乎能？\"然则何说欤？盖为高推圣境者投一辛剂耳！唐之中叶有德山者，蜀之简州人，娴通经论，闻南方禅席颇盛，乃曰：\"千劫学佛威仪，万劫学佛细行，未得成佛，今南方魔子敢曰'直指人心，见性成佛'。我当搂其窟穴，灭其种族，以报佛恩。\"遂担《青龙疏钞》出蜀。及见龙潭，夜话次，山欲就下间寝，而道黑难行，潭点纸烛度与山，山拟接，潭复吹灭，山遂大悟。翌日，将所有疏钞一炬而焚，曰：\"穷诸玄辩，若一毫置于太虚。竭世枢机，似一滴投于巨壑。\"遂杖锡观方。后住德山，天下募焉归化。向使德山不见龙潭，必曰千劫学佛威仪，万劫学佛细行，寍有最后一段大事乎？既见已，千劫只在目前，万劫即是今日。故曰\"道不远人\"。当人为道，必曰远也，是必非道。《诗》之\"伐柯\"，\"忠恕，违道不远\"等，比而知也。孔子于上之四道，犹曰\"未能\"。然则谓孔子为未证入中庸者，可乎？曰：\"不可。\"若然，于彼四道未能者，犹能证入中庸，不可画地自限，况已能尽能间能者而曰不能，自暴弃邪？故曰中庸之道，遍乎平常。孔子为高推圣境者而云，非仅基于特也。<p>（三）上下之遍（君子素其位而行全章）<p>上不陵下，下不援上，正己无求。不尤不怨，居易以俟，远离险行。或有未治，反求诸身，中庸至道，君子之胜行也。君子之胜行，即素位而行，不骛乎其外也。居富贵而不骄不吝，于贫贱无怨无恣，素夷狄，素患难各安其行。遍上下，一切无人而不自得者，中庸之行，胜行也，求在我者也，讵外驰哉？<p>（四）远近之遍（辟如行远全章）<p>是法虽无远近，然未证入者，实有亲疏。曰远、曰近，名虽万行，于遍则一。未入者远而难即，行之自迩﹔已得者迩尚云无，即之讵遥？是远近不越乎遍行，亲疏悉归乎权语，果能此也，《诗》曰：\"妻子好合，如鼓瑟琴。兄弟既翕，和乐且耽。宜尔室家，乐而妻孥。\"又古德曰\"汝家眷属一群子。\"曰父、曰母，其有不怡然而顺乎？顺之至，乃遍之至。遍之至，亦孝之至，所以成下章保任之至矣！<p>第三节 &#13;拈提<p>僧继宗者，问见性之义于天台云居智，智曰：\"终日见未尝见，求名处体相不可得，能所俱绝，名为见性。\"宗曰：\"此性遍一切处否？\"智曰：\"无处不遍。\"宗曰：\"凡失具否？\"智曰：\"上言无处不遍，岂凡夫而不具乎？\"宗曰：\"因何诸佛、菩萨不被生死所拘，而凡夫独萦此苦？何曾得遍？\"智曰：\"凡夫于清净性中，计有能所，即堕生死。诸佛、大士，善知清净中不属有无，即能所不立。\"宗曰：\"若如是说，即有能了、不能了人。\"智曰：\"了尚不可得，岂有能了人乎？\"宗曰：\"至理如何？\"智曰：\"我以要言之，汝即应念清净性中无有凡圣。亦无了不了人。凡之与圣，二俱是名。若随名生解，即堕生死。若知假名不实，即无有当名者。\"又曰：\"此是极究竟处。若云我能了，彼不能了，即是大病。见有净秽、凡圣，亦是大病。作无凡圣能所看，属拨无因果。见有清净性可栖止，亦大病。作不栖止解，亦大病，然清净性中，虽无动摇，且不坏方便应用及兴慈运悲，如是兴之处，即全清净之性，所谓见性成佛矣。\"继宗闻已，踊跃礼谢而退。<p>\"继宗闻如是开发，即便踊跃礼谢而退。何等便捷？今说《中庸》四遍已竟，个中若有个汉，亦踊跃礼谢而去么？若有，无云而雨﹔若无，亦无云而雨﹔若曰即有即无、即无即有，亦无云而雨。\"或曰：\"先生所举僧继宗等释氏之徒，今兹所说，儒家之语。彼问见性成佛，得义即通。此云择乎中庸，焉能顿了？今云个汉有踊跃礼谢者么，无乃疆域不分、课人过苛欤？\"<p>先生曰：\"唯, &#13;唯，无云而雨。\"海众莫崖其涯，寂而无语。<p>先生曰：\"此四遍行者，该三千威仪、八万细行。然此三千、八万，实该一行。此一行者，又无行也。惟无也而该有﹔惟有也而实无。有无不御，取舍成宜。一性圆成，虚通万类。无德不具，有感斯欣。此遍之至，亦云居智所谓极究竟处也。当人不假功勋，不依修证，不趋即入，动念又乖。一人便彻证中庸无渐顿、无方便、无三贤、十圣，非去来今，而行人昧不肯人，偏偏要彼疆此域，说释说孔，说苛说不苛，奈何？奈何？\"<p>先生顾视大众，良久曰：\"何事痴求佛法僧，羡他北秀与南能。分明一片闲田地，过去过来问主人。\"说已，问曰：\"会么？\"众云，\"不会。\"<p>先生曰：\"无云而雨。\"下座。<p>第七章 &#13;保任中庸<p>第一节 &#13;总论<p>差每失于毫厘，应即乖于律吕，法非渐顿，等班贤愚。二乘十圣之立，一簇三关之名于焉懋也。君子游之，形先物外﹔小人泥之，神役环中。系驹伏鼠，长年戚戚。信燕疑狐，毕世波波。此行者之戚，先圣之悲也。故次遍行，爰立保任。昔洞山价谓曹山寂曰：\"吾在云岩先师处，亲印宝镜三昧，事穷的要，今付于汝。\"末曰：\"臣奉于君，子顺于父。不顺非孝，不奉非辅。潜行密行，如愚如鲁。但能相续，名主中主。\"斯固保任之楷模，长养之规范。三世贤哲，无不借径于斯。若曰超人，则腊月扇、盛暑炉矣。<p>第二节 &#13;经文<p>{朱注第十六章}子曰：\"鬼神之为德，其盛矣乎？视之而弗见，听之而弗闻，体物而不可遗，使天下之人齐明，盛服以承祭礼。洋洋乎如在其上，如在其左右。《诗》曰'神之格思，不可度思，矧可射思？'夫微之显，诚之不可掩如此夫。\"<p>{朱注第十七章}子曰：\"舜其大孝也与？德为圣人，尊为天子，富有四海之内，宗庙飨之，子孙保之。故大德必得其位，必得其禄，必得其名。必得其寿。故天之生物，必因其材而笃焉。故栽者培之，倾者覆之，《诗》曰：'嘉乐君子，宪宪令德，宜民宜人，受禄于天，保佑命之，自天申之。'故大德者必受命。\"<p>{朱注第十八章}子曰：\"无忧者，其惟文王乎？以王季为父，以武王为子。父作之，子述之。武王缵大王、王季、文王之绪，壹戎衣而有天下。身不失天下之显名，尊为天子，富有四海之内，宗庙飨之，子孙保之，武王未受命，周公成文武之德，追王大王、王季，上祀先公以天子之礼。斯礼也，过乎诸候、大夫及士、庶人。父为大夫，子为士，葬以大夫，祭以士﹔父为士，子为大夫，葬以士，祭以大夫。期之丧，达乎大夫：三年之丧，达乎天子﹔父母之丧，无贵贱一也。\"<p>{朱注第十九章}子曰：\"武王、周公，其达孝矣乎，夫孝者，善继人之志、善述人之事者也。春秋修其祖庙，陈其宗器，设其裳衣，荐其时食。宗庙之扎，所以序昭穆也。序爵，所以辨贵贱也﹔序事，所以辨贤也﹔旅酬，下为上，所以逮贱也﹔燕毛，所以序齿也。践其位，行其礼，奏其乐，敬其所尊，爱其所亲，事死如事生，事亡如事存，孝之至也，郊社之礼，所以事上帝也﹔宗庙之礼，所以祀乎其先也。明乎郊社之礼、禘尝之义，治国其如示诸掌乎？\"<p>一、释字<p>揜 &#13;《说文》：\"自关以东，谓'取'曰'揜'。一曰覆也。衣检切。\"<p>孝 &#13;《说文》：\"善事父母者。从老省，从子。子承老也。呼教切。\"《礼记;祭统》：\"孝者，畜也。顺于道，不逆于伦，谓之畜。\"《孝经疏》引《孝经援神契》云：\"天子孝曰就，诸侯孝曰度，卿大夫孝曰誉，士孝曰究，庶人孝曰畜。\"<p>缵 &#13;《说文》：\"继也，作管切。\"<p>末 《说文》：\"木上曰末。从木，一在其上，莫拨切。\"朱注曰：\"末，犹老也。\"<p>旅酬 &#13;\"旅\"。《说文》：\"军之五百人为旅。力举切。\"\"酬。\"《说文》：\"主人进客也。市流切。\"朱注曰：\"旅，众也。酬，导饮也。旅酬之礼，宾弟子兄弟之子，各举觯于其长，而众相酬。\"<p>禘尝 &#13;\"禘\"。《说文》：禘，祭也。《周礼》曰：'五岁一禘。'特计切。\"\"尝\"。《说文》：\"口味之也。市羊切。\"按：《玉篇》：\"尝，祭也。\"《尔雅;释天》：\"秋祭曰尝。\"郭注：\"尝亲谷。\"<p>二、通义<p>此分四：一总持，二受命，三无忧，四达孝。<p>（一）\"总持（\"子曰鬼神之为德\"全章）<p>微而至于无微乎？曰：\"否，尚有无在。\"\"若然，此微也，无尚不立，显于何有？\"曰：\"否。否。惟无而不立也，故无在而不显，古人所谓'现成公案'。此曰'诚之不可揜，视之而弗见，听之而弗闻'者，非无见无闻，惟不可见、不可闻耳。不然，体物而遗也。今既不遗，使天下之人齐明盛服以承祭祀，洋洋乎如在其上，如在其左右，果有鬼神邪，谁见谁闻？无邪，而德又实莫之盛。《诗》曰：'神之格思，不可度思，矧可射思。'固非语言能诠、意识能缘也。此不可诠、不可缘，大道之正轨、中庸之总持。于保任章首揭此者，盖欲行人持此之总，任此之巨，保此之尚，自益而益人，援天下之溺，勰万有之和也。故曰总持。<p>（二）受命（\"子曰舜其大孝也欤\"全章）<p>命受而位正，位正道行，行斯普也，然则必如何而受命？曰孝。孝如上释。孝者，功勋，孝之至，功勋之至。功至而赏亦至。故曰大德必得其位、必得其禄、必得其名、必得其寿，德者状功勋之懋行也。功勋之懋行，即孝之懋行，即保任之懋行。舜其大孝，大保任也。保任大而功勋大，功勋大而赏大，于是乎贵为天子，富有四海，大命受，大位得也。然此位者，非仅人君之位，盖彻证乎中庸得位也。孟子曰：\"居天下之广居，立天下之正位，行天下之达道\"，位也者，位乎此，不得此，虽南面而君天下，失位也﹔苟得此，彼陋巷之回，敝衣之由，一夫不治，八口常饥，皆得位也。桀纣失之，孟子斥为\"独夫\"﹔宣尼得之，后哲尊曰\"素王\"。曰名、曰禄、曰寿，咸同此释。不然，操、莽贤于夷、齐，原宪下于盗跖矣，讵理乎哉？《诗》曰：\"嘉乐君子，宪宪令德。宜民宜人，受禄于天。保佑命之，自天申之。\"此重赞保任之至，宜民宜人，而天申命斯受矣。<p>（三）无忧（\"子曰无忧者其惟文王乎\"全章）<p>上令下行，父作子述，如礼而知，如实而行，忧于何有？在未克定大乱前，威或假乎武功，德每沛于文治。今天下既有，上祀先公，达乎诸候，爰及士庶。阶虽等差，礼无贵贱。如理而知，如实而行。诗曰：\"向来枉费推移力，此日中流自在行。\"忧于何有？故以文王喻之曰无忧云云。此无忧者，保任之至适也。<p>（四）达孝（\"子曰武王周公其达孝矣乎\"全章）<p>序昭穆、序爵、序事、逮贱、序齿及践位、行礼、奏乐、敬所尊、爱所亲、事死如生、事亡如存等，又善继善述曰郊社之礼、曰禘尝之义，如理而知，如实而行，即孝之至，即保任之至。故以武王况之曰\"达孝\"。达孝者，达乎此也。达乎此，即保任乎此。孝之至，亦保任之至也。故曰：\"明乎郊神之礼、禘尝之义，治国其如示诸掌乎。\"治国以政，政莫先于彰秩序。今兹宗庙之札，郊社之礼、禘尝之礼，井然而张，灼焉而序。治于国，宁曰不大而业？以京天下者，未之有也。故保任之至，又以启下章显用之至矣。<p>第三节 &#13;拈提<p>\"长庆安造百丈，礼而问曰：'学人欲求识佛，何者即是？'丈曰：'大似骑牛觅牛。'庆曰：'识得后如何？'丈曰：'如骑牛人归家。'庆曰：'未审始终如何保任？'丈曰：'如骑牛人执杖视之，不令犯人禾稼。'长庆自兹领旨，息却狂心，更不驰求，实时享受下半截的风光。当人当下试一自忖道：他长庆是保任？是非保任？若曰是保任，不但活埋长庆，而且拖累百丈﹔若曰非保任，又眼睁睁把子思引的'舜其大孝'、'文王无忧'、'武王、周公达孝'等和自己及他人一齐拋向火坑，殆不仅错判诸方，冤诬古人也。此而不明，必把南泉老人道的'王老师自小养一头水牯牛，拟向溪东牧，不免犯他国王水草﹔拟向溪西牧，不免犯他国王水草。不如随分纳些些，总不见得'的话言把来。凑泊在保任上。曰溪东溪西，未亡蹄筌。随分些些，实超相外，且不问云门拈的牛内纳及牛外纳，和云峰悦及幻寄拈的一切也。此而不明，又必把德山道的'无心于事，无事于心。自然虚而灵，空而妙'把来凑泊在保任上。若有诘者难其所通，则引古人'高高山顶立，深深海底行，等语硬作主张，强为和会。谬燕石而曰玉，混鱼目以为珠。永嘉觉曰'魔强法弱'，奈何？奈何？\"<p>先生说是语已，顾视大众。久之乃曰：\"老何没后吟声绝，虽有郎官不爱诗，无复篇章遗道路，空留风月在曹司。\"复问众曰：\"下文如何？\"有对者曰：\"不知。\"先生曰：\"余亦不知。古人说的向下文长。不如付在来日。\"下座，众未散。<p>久之，先生复上座。未语，有出问者曰：\"先生为某等讲说《中庸》，案此已七章也。章章雷同，一律有总有拈，无乃程序过呆而变化不兴欤？\"先生大声曰：\"太史公说的。\"问者大愕，莫崖其际，良久进曰：\"不会。\"先生回：\"连唯唯、否否、不然已不知。\"乃曰：\"天常上地，地常下天。而地不能上天，天不能下地。是天地呆而变化不兴也，春生秋杀，夏茂冬藏，历劫不逾，是秋不能生，春不能杀，而夏不能藏，冬不能茂，彼四时者，呆而变化不兴也。孔子十五志学，七十不逾。释迦四十九年转此一法。此二至人者，亦呆而变化不兴也。汝毕竟是汝，吾终是吾。吾不是汝，汝不是吾。吾若是汝，汝若是吾，则吾汝不成。今不尔者，是吾与汝亦呆而变化不兴也。他如狗不是牛，牛不是狗，金不是粪，粪不是金，乃至一草、一木、一土、一石、一空、一非空、一有、一非有，无不尔者，等如上说。是一呆一切呆，而一切变化非变化亘古而不兴也。法不为呆而呆余说，何邪？虽然，幸有此一呆也。若无此呆，则无汝我。即无汝我，焉有时空？既无时空，汝从何处开两片皮来向我说呆、说不呆、说变化、说不变化乎？\"问者大窘，目瞑而不能觉，舌翘而不能缩。良久，先生霁颜和声，谓彼问者曰：\"会么？\"进云：\"不会。\"先生曰：\"不堪风唳鹤，况对月眠龙。\"以木击案，瓦屋有声，下座。<p>第八章 &#13;显用中庸<p>第一节 &#13;总论<p>\"出山扶客掉，在岳济民田。\"用固张乎大小，时必期于短长。世固少无材而不用，亦鲜有用而非材。即材即用，即用即材，要在运斤者何如耳。用而适，窃国者候﹔用而失，窃钩者诛。适与失，形虽明判乎偏正，妙则悉轨于中庸。叶于中，州官火毁民房，滴滴显慈人之沛﹔远夫道，百姓灯然暗室，点点埋益己之私。是故中庸不寓，大用何兴？故次遍行、保任而曰显用。用也者，用乎此﹔显也者，显乎此。舍此而显、用同非中偏，皆邪也。吾土内圣之学，内乎此﹔外王之学，外乎此。内不圣而外王，王亦盗也。外不王而内圣，盗亦王也。是王盗之迹判于形，王盗之实根于心。今曰\"为政而不辔乎中庸，险必逾于朽索之驭六马，芥舟而捕长鲸也\"。多见其不自知量，颠越戮辱，讵仅道失中庸乎？必曰遗讥后世，哀公之问、仲尼之训，炯之哉！<p>第二节 &#13;经文<p>{朱注第二十章}哀公问政。子曰：文武之政，布在方策。其人存则其政举，其人亡则其政息。人道敏政，地道敏树。夫政也考，蒲芦也。故为政在人，取人以身，修身以道，修道以仁。仁者，人也，亲亲为大。义者，宜也，尊贸为大。亲亲之杀，尊贤之等，礼所生也。在下位，有获乎上，民不可得而治矣。故君子不可以不修身，不可以不事亲，不可以不知人。思知人，不可以不知天。天下之达道五，所以行之者三。曰君臣也、父子也、夫妇也、昆弟也、朋友之交也。五者，天下之达道也。知、仁、勇三者，天下之达德也。所以行之者一也。或生而知之，或学而知之，或因而知之。及其知之一也。或安而行之，或利而行之，或勉强而行之。及其成功一也。\"<p>子曰：\"好学近乎知，力行近乎仁，知耻近乎勇。\"知斯三者，则知所以修身。知所以修身，则知所以治人。知所以治人，则知所以治天下、国家矣。凡为天下国家有九经﹔日修身也、尊贤也、亲亲也、敬大臣也、体群臣也、子庶民也、来百工也、柔远人也、怀诸侯也。修身则道立，尊贤则不惑，亲亲则诸父昆弟不怨，敬大臣则不眩，体群臣则士之报礼重，子庶民则百姓劝，来百工则财用足，柔远人则四方归之，怀诸侯则天下畏之。齐明盛服，非礼不动，所以修身也﹔去谗远色，贱货而贵德．所以劝贤也﹔尊其位，重其禄，同其好恶，所以劝亲亲也﹔官盛任使，所以劝大臣也﹔忠信重禄，所以劝士也﹔时使薄敛，所以劝百姓也﹔日省月试，既禀称事，所以劝百工也﹔送往迎来，嘉善而矜不能，所以柔远人也﹔继绝世，举废国，治乱持危，朝聘以时，厚往而薄来所以怀诸侯也。凡为天下国家有九经，所以行之者一也。<p>凡事豫则立，不豫则废﹔言前定则不跲，事前定则不困﹔行前定则不疚，道前定则不穷。在下位不获乎上，民不可得而治矣。获乎上有道，不信乎朋友，不获乎上矣。信乎朋友有道，不顺乎亲，不信乎朋友矣。顺乎亲有道。反诸身不诚，不顺乎亲矣。诚身有道，不明乎善，不诚乎身矣。诚者，天之道也。诚之者，人之道也。诚者不勉而中，不思而得，从容中道，圣人也。诚之者，择善而固执之者也。博学之，审问之，慎思之，明辨之，笃行之。有弗学。学之弗能，弗措也﹔有弗辩。辩之弗明，弗措也﹔有弗行。行之弗笃，弗措也。人一能之，己百之﹔人十能之，己千之。果能此道矣，虽愚必明，虽柔必强。<p>一、释字<p>政 &#13;《说文》：\"正也，之盛切。\"<p>方 朱注曰：\"方，版也。\"按《仪礼聘礼》\"不及百名，书于方。\"<p>策 &#13;朱注曰：\"策，简也。\"按。蔡邕《独断》：\"策者，简也。其制长二尺。短者半之。其次一长一短，两编下[土+付]，单执一札，谓之为简﹔连编诸简，乃名为策。凡书字有多有少。一行可尽者，书之于简﹔数行可尽者，书之于方﹔方所不容者，乃书于策。\"<p>敏 &#13;《说文》：\"疾也。眉殒切。\"朱注曰：\"敏，速也\"<p>经 《说文》：\"织纵丝也。九丁切。\"朱注曰：\"经，常也\"<p>眩 &#13;《说文》：\"目无常主也。黄绚切。\"朱注曰：\"不迷于事也。\"<p>跲 《说文》：\"踬也。居怯切。\"<p>措 &#13;《说文》：\"置也。仓故切。\"<p>为天下国家之经九，曰修身、田尊贤、曰亲亲、曰敬大臣、曰体群臣、曰子庶民、曰来百工、曰柔远人、曰怀诸侯。达道五，曰君臣、曰父子、曰夫妇、曰兄弟、曰朋友。如是已举未举，舍知、仁、勇而理莫阶、事莫由、道莫运。故曰知、仁、勇，天下之达德美。达着，通也。有一碍则非通。今曰达，则事无碍，理无碍，事理无碍，事事无碍，而一无所得也。盖仁以董事，知以应事，勇以成事。三者重一必偏，轻一必阙。合则非一，离又不三。全体用，一是非，别善恶，明去取，不可以言语诠，不可以意识缘也。无以名，无以状，强名曰中庸之全体大用、三世圣哲之一行胜门。当人但跻乎此，一切事、一切理、一切事理、非事理毕。所谓\"大事了毕\"也。况曰为天下、治国家乎？庄子曰：\"圣人以其余绪而治天下。\"<p>知、仁、勇，儒之三德﹔法、报、化，释称三身。\"德身二乎？\"曰：\"不二。\"\"一乎？\"曰：\"不一。\"\"然则知、仁、勇即法、报、化欤？\"曰：\"然。\"或曰：\"法、报、化非知、仁、勇欤？\"曰：\"然。\"进曰：\"知、仁、勇之于法、报、化，法、报、化之于知、仁、勇，即是即非、即非即是欤？\"曰：\"然。何也？愚者囿之，即非一﹔达者游之，而不二矣。\"或大诧，忽而诘曰：\"先生如是杂糅，不但毁孔，且亦叛释。\"<p>先生亦忿而语曰：\"汝如是谬会，不但远释，而亦诬孔。\"或曰：\"经文俨然见在，学人固不远释而诬孔也。\"先生亦曰：\"经文俨然见在。且法尔亦如是也。胡得云余毁孔而叛释？\"或云：\"不会。愿垂明示。\"<p>先生曰：\"知么？汝之言，依文解义，大晦释氏之真诠﹔滞理求通，深远孔子之的趣。今余彻见汝是听经学人，决非远行客子，亦犹余彻见孔云知、仁、勇三德，即释说法、报、化三身者，一也。乃者必谓余彻见汝非听经学人，而是远行客子。可乎？可乎？昧孰甚！昧孰甚！<p>\"妙喜老人诠'天命之谓性'为'清净法身'，'率性之谓道'为'千百亿化身'，'修道之谓教'为'圆满报身'。彼果诬也。妙喜者，圆悟勤亲承法嗣之骄子，临济宗荷负大道之啸狮也。临济宗旨寍秀到令？况彼时于宪设拜无垢，对扬肆筵。沛法如日丽天。余果诬也，彼三尊宿者，宁不诬乎？\"或莫对。<p>先生复曰：\"谛听！谛听！千古无有以实法与人的圣人。故岩头曰：'若以实法与人，食土亦消不得。'若然，横说竖说，有说无说，是说非说，反说正说炽然而说，总以诱掖学人入乎中庸而已。讵有他哉？果能入也，何事不可？况三德三身等说邪其或不然，纵将十三经、三藏十二蕴之于心，犹是落空亡外道，执有为魔军也。讵知证入中庸者，孔亦可、释亦可、是亦可、非亦可，拈一茎草演出三世一切凡圣种法﹔把三世一切凡圣种法演入一茎草。尘尘尔、剎剎尔、法法尔，无一不可。孔子曰：'无可无不可。'<p>\"若然，彼三德、三身已证入者，置勿论。未入、欲入或正入之初机，究以何法趣证乎？曰博学、审问、慎思、明辨、笃行。是五法者，迷津筏、苦海航也。释氏六度、四摄、八万四千法门悉摄于斯，悉尽于斯。<p>\"行人不于此五法研工，而务修阴阳、坎离等，无乃舍近求远、崎路或不至欤？纵至，亦绕而苦。何也？法身无相，无相何修？令即有修，必非无相。即非无相，讵曰法身？又不仅法身无相，而化、报亦无相也。此五欲身者，念念生死。必曰修，修生法邪？修灭法耶？若曰修生，才行修生，此生已死，已灭何修？若曰修灭，已灭已死，灭更何修？然则毕竟无修？曰否，否。当人果于博学、审问、慎思、明辩、笃行而证乎中庸也，自然一切成现，不必问人。修亦得，不修亦得。不但阴阳、丹道、坎离等法得，乃至贩天、牧卒，无一而不得。何也？知本也。本者何？中庸也。故曰此谓知本、此谓知之至矣。不然，任汝说修、说不修，总是痴狂外边走。遑曰九经、五达道，以为天下治国家者乎？行人洞此，愚必明，柔必强。而明而强，标洪范于来世，超的向于今时，于是乎在也。取譬蒲芦，政布方策等，阅简而知，固不必一字咀文，一句较义。但证此知、仁、勇即纲举网张而为政之道毕，中庸之道毕矣。\"<p>第三节 &#13;拈提<p>\"舜，陇亩匹夫耳﹔文王昌，小国君耳﹔回，陋巷布衣耳。舜以匹夫妻帝二女，内无群雌粥粥之嫌。君天下，驱四凶，殛鲧陟禹，禹不以父死之仇而仇舜，舜不以子肖之贤而贤鲧，厥德用修，为章后世，外无人言啧啧之毁，道固何欤？姬昌以百里地而收大有功，颜回无一阶荣而有千世誉，道又何欤？此古人也。今虚云、妙树者，二老夫也。一言，达者炫如吐玉﹔一履，开士赞曰胜行，此又何欤？至于龙女八岁，善财妙龄，涅盘会上屠儿，金陵道畔婆子，桃花取证于灵源，溪深每长于杓柄，古今因缘，百笔难罄，此又何欤？\"<p>先生说已，顾视大众。良久乃曰：\"余于此下语不得。\"或曰：\"不下语可乎？\"先生曰：\"嘴上加嘴。\"久之，或又曰：\"毕竟如何？\"先生曰：\"三子者不同道，其趋一也。一者何？曰仁也。君子一仁而已矣。何必同？仁也者，法身也。得此<p>而化、报，而知、勇，而干矢橛、庭前柏林子、北斗里藏身、顾鉴咦、家家门前火把子、曰惟精惟一、曰一贯、曰明德、曰中庸、乃至一切事、一切理、一切胜行、非胜行，曰兵、曰农、曰财、曰教、曰政、曰工、曰商、曰艺一时毕具，丝急不逾。不然，任汝称扬称郑，徒滋小勤，于道更远。<p>又曰：\"人不急其缓，缓其急，大其小，小其大，如实而知，如理而行，万事毕也。讵曰为政乎？孟子曰'以齐王，如反掌'。岂诬语哉？哀公外弱于齐、威于晋，内又不牧于臣庶，故兴为政之问。孔子云云，盖探本之论也。方策，成文也。蒲芦，细物也。至易呈细而行之者人。故重修身，所谓躬己正南面，不言而信，不动而成也。夫身修，不言且信，不动且成，况言与动乎？君子所以修身为大也、然则何修乎？曰好学近知，力行近仁，知耻近勇，舍知、仁、勇，不可言修身。舍修身，必不曰知、仁、勇也。知、仁、勇之于修身，不可二，不可一。不可即，不可离。故曰知斯三卷，则知所以修身，所以治人，所以治国家、平天下也。当人不正己躬，兴知仁勇之妙行，而责于齐曰'弱我'，晋曰'威我'，内讼于臣庶曰'尔干我、远我、掷我、无我'，于是媾狱逞兵，等亲戚于胡越，视同舟如仇雠。此缓其急，急其缓，大其小，小其大。齐之为齐，所以有于田氏﹔晋之为晋，所以衰于诸侯﹔鲁之于鲁，所以弱于三家。沦三代为春秋，降春秋而战国也。千古成败如出一辙。前覆而后不知鉴，悲失！悲夫！<p>\"余髫年入学，有先生氏蒲者，善诱塾童，课余必说故事，以启奋儿童，令其乐而忘苦。曰某村有孟、仲、季者，皆瞽。孟、仲精甲子术，每事必以甲子排决休咎，百不一爽。季固不知也。一日三人同出，长次雁行。不知每日所行故道，陷而为坑。孟忽陷入。应声曰：'甲子乙丑海中金，不知旧路化为坑。'言未已，其弟仲亦陷入。亦应声曰：'丙寅丁卯炉中火，大哥陷了又陷我。'言未已，其弟季亦陷入。而应声曰：'我亦算不了甲子，可笑陷了一坑瞎子。'这一则故事，真所谓烛破古今，无论自命为知、或愚，人推为知、或愚，而未修身、或已修未至者，莫不同在此一坑中，先圣悲之，子思悯之，共三世贤圣都在此坑外或在此坑内大声疾呼曰：'曷兴乎？曷兴乎？\"'说已，先生倾视大众。良久乃曰：\"会么？\"众无语。<p>先生曰：\"若云会，吾与汝同在坑内同瞎子笑﹔若云不会，吾与汝同在坑外，闻瞎子叫。我已不管你笑和叫，依然把这一篇显用中庸的拈提说了。\"下座。<p>第九章 &#13;要中庸<p>第一节 &#13;总论<p>要者，约也。《左哀十四年传》：\"使季路要我吾无盟矣。\"谓行人必云云而约乎中庸也。又，结也。《国语·晋语》：\"以要晋国之成。\"行人必云云以要结乎中庸之成也。又，坚止也。《汉书·文帝纪》\"皇太后固要。\"行人必云云而坚止乎中庸也。又，求也。《孟子·告子》\"以要人爵。\"谓行人必云云以求乎中庸也。又，察也。《书·康诰》\"要囚。\"行人必云云而明察乎中庸也。又，取也《淮南·原道》\"以要飞鸟。\"谓行人必云云以取乎中庸也。义虽千差，归程匪二。盖行人因难行能行而践履、而一趣、而保任、而显用也。行已履乎上阶，义固参于妙谛。一行张万派之权，众妙擅独到之实。故次显用曰要。极其至，凡圣不二，空有咸齐。理失浅深，事非巨细。即此离此，无一而不要乎中庸﹔离此即此，漏万仍阶乎至道。释曰不思议、孔曰物不测，讵有他哉？故曰要谓行人一止一动、一格一默、一舍一取、一来一往、一有一空、一非一是、一浅一深、一长一短，无一而不要乎此。故又曰不可离。不可离者，要之至也。显用之极，归于至要。然此至要者，用极而要，又非离用而别有要。若别有者，魔法、二法也。讵大人之胜行哉？行人届此取之则左右逢其源，从心所欲不踰矩。故曰功已齐于诸圣，德实焕乎无为。 &#13;<p>第二节 &#13;经文<p>{朱注第二十一章}自诚明谓之性．自明诚谓之教。诚则明矣，明则诚矣。<p>{朱注第二十二章}唯天下至诚，为能尽其性。能尽其性，则能尽人之性。能尽人之性，则能尽物之性。能尽物之性，则可以赞天地之化育。可以赞天地之化育，则可以与天地参矣。<p>{朱注第二十三章}其次致曲。曲能有诚，诚则形，形则着，着则明，明则动，动则变，变则化。唯天下至诚为能化。<p>{朱注第二十四章}至诚之道，可以前知。国家将兴，必有祯祥﹔国家将亡，必有妖孽。见乎蓍龟，动乎四体。祸福将至，善，必先知之﹔不善，必先知之。故至诚如神。<p>{朱注第二十五章}诚者，自成也，而道自道也。诚者，物之终始。不诚，无物。是故君子诚之为贵。诚者非自成己而已也，所以成物也，成己仁也，成物知也，性之德也，合外内之道也。故时措之宜也<p>{朱注第二十六章}故至诚无息。不息则久，久则征，征折征则悠远，悠远则博厚，博厚则高明。博厚所以载物也，高明所以覆物也，悠久所以成物也。博厚配地，高明配天，悠久无疆。如此者不见而章，不动而变，无为而成。天地之道，可一言而尽也。其为物不贰，则其生物不测。天地之道博也，厚也，高也，明也，悠也，久也。今夫天，斯昭昭之多，及其无穷也，日月星辰系焉，万物覆焉﹔今夫地，一撮土之多，及其广厚，载华岳而不重，振河海而不泄，万物载焉﹔今夫山，一卷石之多，及其广大，草木生之，禽兽居之，宝藏兴焉﹔今夫水，一勺之多，及其不测，鼋鼍虾龙鱼鳖生焉，货财殖焉。《诗》云：\"维天之命，于穆不已。\"盖曰天之所以为天也。\"于乎不显，文王之德之纯。\"盖曰文王之所以为文也。纯亦不已。<p>{朱注第二十七章}大哉圣人之道！洋洋乎发育万物，峻极于天。优优大哉！礼仪三百，威仪三千，待其人而后行。故曰苟不至德，至道不凝焉。故君子尊德性而道问学，致广大而尽精微，极高明而道中庸。温故而知新，敦厚以崇礼。是故居上不骄，为下不倍，国有道其言足以兴，国无道其默足以容。《诗》曰：\"既明且哲，以保其身。\"其此之谓与？<p>{朱注第二十八章}子曰：\"愚而好自用，贱而好自专，生乎今之世，反古之道，如此者灾及其身者也。非天子不议礼、不制度、不考文。今天下车同轨、书同文、行同伦。虽有其位，苟无其德，不敢作礼乐焉﹔虽有其德，苟无其位，亦不敢作礼乐焉。\"子曰：\"吾说夏礼，杞不足征也﹔吾学殷礼，有宋存焉﹔吾学周礼，今用之，吾从周。\"<p>{朱注第二十九章}王天下有三重焉，其寡过矣乎？上焉者虽善无征，无征不信，不信民弗从﹔下焉者虽善不尊，不尊不信，不信民弗从﹔故君子之道，本诸身，征诸庶民，考诸三王而不谬，建诸天地而不悖，质诸鬼神而无疑，百世以俟圣人而不惑。质诸鬼神而无疑，知天也﹔百世以俟人而不惑，知人也。是故君子动而世为天下道，行而也为天下法，言而世为天下则。远之则有望，近之则不厌。《诗》曰：\"在彼无恶，在此无射。庶几夙夜，以永终誉。\"君子未有不如此而早有誉于天下者也。<p>{朱注第三十章}仲尼祖述尧舜，宪章文武，上律天时，下袭水土。辟如天地之无不持载、天覆帱﹔辟如四时之错行，如日月之代明，万物并育而不相害，道并行而不相悖。小德川流，大德敦化。此天地之所以为大也。<p>{朱注第三十一章}唯天下至圣，为能聪明睿知，足以有临也﹔宽裕温柔，足以有容也﹔发强刚毅，足以有执也﹔齐庄中正，足以不敬也﹔文理密察，足以有别也。溥博渊泉，而时出之。溥博如天，渊泉如渊。见而民莫不敬，言而民莫不信，行而民莫不说。是以声名洋溢乎中国，施及蛮貊。舟车所至，人力所通，天之所覆，地之所载，日月所照，霜露所坠，凡有血气者，莫不尊亲。故曰配天。<p>{朱注第三十二章}唯天下至诚，为能经纶天下之大经，立天下之大本，知天地之化育。夫焉有所倚？肫肫其仁，渊渊其渊，浩浩其天。苟不固聪明圣知达天德者，其孰能知之？<p>一、释字<p>自 &#13;《说文》：\"鼻也。象鼻形。疾二切。\"朱注曰：\"自，由也。\"今注曰：\"显始而溯其来曰自。\"<p>曲 &#13;《说文》：\"象器曲受物之形。或说'曲'﹔蚕薄也。丘玉切。\"朱注曰：\"曲，一偏也。\"<p>纯 &#13;《说文》：\"丝也。常伦切。\"朱注曰：\"纯，纯一不杂也、\"今注曰：\"不杂而无染曰纯。\"<p>凝 &#13;《说文》：\"水坚也。鱼陵切。\"。朱注曰：\"凝，聚也，成也。\"<p>[土/火 + 戈] 《说文》：\"天火曰[土/火 + 戈] 。从火，[载-车] &#13;声。祖才切。或从[家-豕]火。\"<p>射 &#13;\"射音斁\"《诗·周颂·振鹭》章作\"斁\"郑笺训\"厌\"\"射\"\"斁\"古音\"妒\"。<p>二、通义<p>二十一章至三十二章诠之曰要中庸。然此十二章者，章尽其至，至尽其理，理要于实，实也者，不可说、不可思、不可议、不可形，而又不可不说、不可不思、不可不议、不可不形者也。初欲默而不析，事近笼统。继欲条而彰之，不但理非言诠，且增学人情尘，初机识网矣。百思莫是，于是乎假立十二支，权通一贯言。<p>（一）要证（\"自明诚谓之性'全章）<p>本自清净、离真妄、绝是非曰诚。正觉直观，理事无碍、空有双诠而破暗曰明。诚，定也﹔明，慧也。由定而慧，慧显而性见﹔由慧而定，定诠而教成。然则定慧二乎？曰：\"否。\"当人正定时慧在定，正慧时定在慧。故曰非二。一乎？曰：\"否。\"当人正慧时非定，正定时非慧。故曰非一。然则教与性一乎？曰：\"否。\"性者，体也﹔教者，用也。体用判然，乌得云一？二乎？曰：\"否。\"无体何用？无用何体？乌得云二？夫诚也、明也、性也、教也、一体而异名，名异而体一。不臻于至，理有千差﹔苟止于善，事无二德。然非亲证，徒滋辩言。古德曰：\"语证则不可示人，说理则非证莫了。\"故首曰要证。<p>（二）要量（\"惟天下至诚\"）全章<p>至诚者，沛定慧之妙趋，张心性之玄宇。无以诠之，假名曰性。须知此性之量，即诚之量。诚之量，即天地人物之量。行人但尽己性之量，人性、物性、天地之性悉尽其量也。参，三也。我与天地并形而为三，合体原非二。是天地即我，我即天地。曰赞、曰参，一派现成。放乎中流，扁舟何系？故曰赞天地之化育、参天地之化育。释氏之言曰\"如所有性，尽所有性\"。故次要证而曰量。<p>（三）要等（\"其次致曲\"全章）<p>法本平虚，人有愚智。三乘于焉而焕立，十地因之有宪垂。倘千钧期负于下劣，万里责趋于羸乘，有不折鼎足而覆公[食+束]者乎？等之立，圣人方便也。\"其次\"，郑注曰：\"指贤人以下。\"凡诚有未至者而言曲，一偏之善。其次致曲者，盖谓行人悟一理而未该乎中庸之全。然即其理，星星燎原，势固期乎必证。所谓\"大风起于青萍之末，而甚于土囊之口\"也。故曰\"有成\"。释家者言\"莫轻末学\"，初祖曰：\"莫轻未悟\"，悉为此而言也。即此必诚、必形、必着、必明、必动、必变、必化，及其化也，无论生而知、困而知、学而知、安而行、利而行、勉强而行，成功则一。未跻于此，固不得言不二也。次要证、要量而曰等。可紊其进程、乱其步趋乎？权曰要等。<p>（四）要验（\"至诚之道可以前知\"全章）<p>《易·\"卦\"神也者，妙万物而为言也。\"又，明也。《荀子·修身篇》曰：\"莫神一好。\"至诚如神，验其吉凶、悔吝、兴亡、善不善如神也。曰前知曰后知、曰现知、乃至百千三昧、无量功德海、胜行、劣行，都非外有，皆此一法之所印，一行之所彰。或外有，则妖则异也。然则现乎蓍龟，非外乎？即外也，非妖乎异乎？曰：\"非。\"何也？此蓍龟之现，即一法之现。一法之现，即一诚之现。故曰：\"动乎四体，祸福将至，善，必先知之﹔不善，亦必先知之。\"如理而知，如实而知，三世一切圣哲共游之通径，非妄立谶语、诡说、阴阳者，不根于心而说神说异也。验也者，验乎此。必验此，乃曰择乎中庸。至诚如神，故次等而曰验。<p>（五）要德（\"诚者自成也\"全章）<p>本自具足，不假他求，故曰自成。自成者，诚也。非诚，则必借他。借他，则无自。无自，则无物。无物，则世间相坏矣。世间相坏，六度四摄依何而沛？此而莫沛，则长劫沉沦、世界黑暗也。君子者，行人也。谓行此者必君子。反之，则不行也。君子之贵，贵此成己以仁，充内心之德﹔成物以智，显外有之宜，内充外显，无措不宜。是性之德，即中庸之至德。中庸之至德，即性之德也。非此，而人己必不成矣。故次验而曰德。要者，要此。权曰要德。<p>（六）要不二（\"故至诚无息\"全章）<p>至诚无来无去，无是无非，非有非空，不二不一，即之不可，离之则乖。故曰不息。不息则久，久则征、悠远、博厚、高明等。事虽炫于千奇，理实原于一趣。显章万类，离娄失明。动毁三千，空生在定。故曰不二。惟不二也，群有森罗，皆印于一﹔纤无不立，实昭乎万。故曰\"不测\"。此法尔夫如是，本自圆成，无待功勋，讵云修证？昧者泥于不息则久、久则征，乃至博厚、高明等为阶而进、梯而升、渐而非顿、或领而非渐，亦可哂矣！虽然，此就已趣乎中庸、入不二法门者言也。一曲之致，必大惑焉。若曰外境内心不二，然则一草一木、一人一狗，皆不二也。果尔，草即木，木即草，人即狗，狗即人。可乎？曰：\"不可。\"是昧于长短、大小之义，囿乎人我、色空之见。滞名相之执，亡体用之全。盖体固不二用则非一也。<p>若曰必无阶梯、顿渐，则昭昭之多，不覆万物、系系星辰﹔一撮之土，不振河海、载华岳﹔一卷无广大，则动、植、宝藏不丽于山﹔一勺非不测，则蛟龙鱼鳖不媚于渊。不但显坏名言，而亦大悖事理。可乎？曰\"不可\"。惟无也，故生有。若有有，有复何生？有不生有，因无而有。有阶有梯、有顿有渐，例同此释。必曰有是有此昭昭、一撮、一勺等则长此昭昭、一撮、一勺而变化不兴、化育不成，曰系星辰、振河海等，寐语也。岂事理哉？斯义也，固一心之所显，一法之所印。至玄至妙，至平至庸。事无阶梯，理非顿渐。故孔子引《周颂》之《诗》曰：\"维天之命，于穆不已。\"盖理虽万殊，形上则一。子思以文王之德之纯、纯亦不已况之。不已岂纯？今纯而不已，是故为物不二、生物不测，天地之至德，圣人之至行，中庸之至道也。故次要德而曰不二。<p>（七）要不怠（\"大哉圣人之道\"全章）<p>中庸非至德不凝。一性虚明，讵怠者能至？尊德性、道问学、致广大、尽精微、温故知新、敦厚崇礼，入德之新阶、臻至之显径也。怠者每望而废自半途，盖究其体，洋洋乎发育万物，峻极于天，遂兴仰之弥高之叹。即其用，威仪三千，礼仪三百，又启钻之弥坚之思。讵知一性圆成，乌有难易？既无难易，行者莫阶。事每慊于未济，道固需乎待人。故曰苟不至德，至道不凝。至德者，精进不怠之德。居上而骄，为下而倍，必不然也。精进乃德之至，而凝道之至。既至也，何用不臧？曰兴、曰容，动止皆适。而骄、而倍，灾必及身。故子思引《大雅·蒸民》之篇曰：\"既明且哲，以保其身。\"次不二曰不怠，义固尚乎斯矣。<p>（八）要分（\"愚而好自用\"全章）<p>智不越分，明不违时。自用自专，违越交戾，讵曰利他？抑亦损己。议礼、制度、考文，国家重政，四庶共型也。非德懋位尊，莫由废作。位尊而德替，苟有作焉，必不足以勰天下之大和﹔德懋而位卑，苟有作焉，必不足以征天下之大信。故曰：\"非天子不议礼、不制度、不考文。\"又曰：\"虽有其位，苟无其德，不敢作和乐。虽有其德，苟无其位，不敢作礼乐。\"盖不越不违，益己利人于是乎在。曰灾曰患，安有寄乎？子曰：\"吾说夏礼\"云云，又明示生今而道不反古，且以用乎今，理如是，分如是也。故次要不怠而曰要分。<p>（九）要誉（\"天下有三重焉\"全章）<p>\"三重\"，朱子引吕氏之说曰议礼、制度、考文，且曰：\"唯天子得以行之，则国不异政，家不殊俗，而人得寡过也。\"先生曰：\"不然。三重者，由本章一'上征'、二'下尊'、三'君子之道本诸身'等三重也。前章前文前又已罄，此章此文此义自形。朱不以'故君子之道本诸身'与'上征'、'下尊'等安立为三者，以此'故君子'之'故'字难消耳。讵知故者，古也。故君子即古君子也。上征，征则民信。下尊，等则民从。君子之道，又本诸身，征诸庶民，考诸三王而不谬，建诸天地而不悖，质诸鬼神而无疑，百世以俟圣人而不惑。是天下协偕，虽欲动而世不为天下道，行而世不为天下法，言而世不为天下则不可能也。故远之必有望，近之必不厌。《诗》曰：'以允终誉'，又曰：'君子蚤誉'，岂偶然哉？重此三也。舜、禹之有天下，实重乎三﹔汉、唐之有天下，权重乎三﹔桀、纣之失天下，远轻乎三。君子蚤誉，宁忽乎三？誉蚤而过自寡，过不寡而誉必不蚤矣。今之君子，全失此三，而欲大邦国、京天下，过乎非欤？故次要分而曰要誉。\"<p>（十）要大（\"仲尼祖述尧舜\"全章）<p>尧、舜、文、武，人也﹔天时、水土，物也。祖述宪章，上律下袭，远绳乎人，近准诸物，取而律己，亦以益人，不攻异端，不堕平常，一味素行，无德不周。此君子之道全，中庸之德大也。取譬天地，借喻四时，乃至万物并育而不相害，道并行而不相悖，小德川流，大德敦化，又形君子之德大、中庸之道全也。曰大、曰全，名异而体一。斯即通衢，安问别径？仲尼之大、天地之大，此而已矣。故次要誉而曰大。<p>（十一）要临（\"唯天下至圣\"全章）<p>既大也，或虑不明，比而知，闻而知，思而知，不切证而知，皆非临矣。灯下见物，月下见物，日下见物，物固非三，见则不一。此曰临，以喻乎见，日下见也临。此寓乎仁，则宽裕温柔，足以有容。大乎勇，申乎义，则发强刚毅，足以有执，齐乎礼，则齐庄中正，足以有敬。激乎智，则文理密察，足以有别，智、仁、勇诸德丕显，法、报、化三身齐形，随处立名，立名即真﹔所在消权，消权即实。故曰\"薄博如天，渊泉如渊。见而民莫不敬，言而民莫不信，行而民莫不悦\"也。行人跻此，舟车所至、人力所通、天之所覆、地之所载、日月所照、霜露所坠，凡有血气者，莫不尊之、亲之。故曰配天，故曰至圣，故曰声名洋溢乎中国。天者，仰首而见，不待他证，不依例明。亲临乎中庸者，亦如仰首见天，不待他证，不依例明也。必如是乃曰临，反之曰不至。何也？纪信辇、叶公龙，非不壮观，然非诠实矣。配天者，天以无形而化生万物，行人以无为而临乎中庸，故曰配。配，犹偶也。行人至圣不二不一。在途曰行人，归家曰至圣。故次要大而曰临。<p>（十二）要本（\"唯天下至诚\"全章）<p>此章首曰\"自诚明\"云云，尾曰\"唯天下至诚\"云云，是首尾以诚诠实，因实立中。曰誉、曰证、曰大、曰临，随处安名，有名即实，实而不居，居之乃权。言条理，章章井然，句句非紊﹔判失纲，处处殊至，节节支离﹔观乎趣，维摩室中，百幻千奇，三都不足以壮其丽﹔探乎寂，空生崖下，春明花孔，万德不足以显其玄。有情无情，一切繁兴在我﹔即用离用，众妙之纷非他。行人跻此，大本立矣。记曰：\"本立而道生。\"孟子曰：\"取之则左右逢其源。\"源者，本也。《大学》曰：\"此谓知本\"，此谓知之至矣。凡兴一用，莫不本此。非语言诠、意识缘。可言可诠，重彼而轻此，或重此而轻彼者，都非亲非临，必有所倚也。既有所倚也，讵曰经纶天下之大经、知天地之化育、立天下之大本邪？故次证、临等曰本，以结本章之全，显文言之整。然则本有结乎？曰本也者，不来不去，不生不灭，不净不垢，不断不常，头且无，尾何有？今曰结，权语也。惟不倚，曰灵光独耀、曰照体独立、曰绝待、曰直觉。非比非喻，不可赞、不可叹、不可即、不可离、肫肫其仁、渊渊其渊、浩浩其天。跻乎此，聪明、圣知、达天德者矣。然此聪明、圣知、达天德者，非他非异，行人但一要乎本，即得也，岂二致哉？慎勿重彼轻我，高推圣境，穷劫不至，自取沉沦。故曰要本。<p>第三节 &#13;拈提<p>此章开十二支。首证、次曰量、三曰等、四曰验、五曰德、六曰不二、七曰不怠、八曰分、九曰誉、十曰大、十一曰临、十二曰本。然则仅此十二支乎？曰：\"否，否。八万四千法门，门门无尽。彼十二支者，太仓一粒耳。\"\"然则何不开一、或二、三或四、五而独标十二，有说邪曰：\"有。\"曰：\"何说邪\"曰：'我亦无知。\"曰：\"既曰有也，何得云无知？\"曰\"我若有知，即夺汝无知﹔汝既无知，亦云何夺？既无有夺，故曰无知。\"或大窘，莫知所措。<p>先生曰：\"向汝道灵光独耀、迥脱根尘，事理双忘，不拘文字。曰一、曰二、曰三、四，从何建立？此中庸者，尚是假有，况此十二支乎？朝三暮四，暮四朝三，原以慰乎狙怒，支固任乎人开。必于此课胜劣、检是非，惑甚矣！虽然，尝一脔而甘全鼎，饮一滴而美大溟。破句楞严已垂古范﹔庭前柏树早播风规。则此一句尤丽，矧曰支乎？迷悟在乎当仁，胜劣匪关法会。此要之立亦云是耳。\"<p>拈曰：舒州龙门清远佛眼者，与圆悟勤佛果、佛鉴为知友，宋之三佛者也。眼初读《法华》至\"是法非思量分别之所能解\"，质其师，师不能答。遂遍参，至太平，见五祖。旋乞于庐州，偶雨仆地，烦懑间，（先生曰：\"百折不回是好汉，半途而废岂丈夫？\"）闻二人交相恶骂。谏者曰：\"你犹自烦恼在。\"师于言下有省。（先生曰：\"会么，会么？一切处成正等觉，并不在你把古人或今人的奇言妙义蕴在胸中，作是非道理会，才叫用功。\"）及趋五祖，凡有所问，祖师曰：\"我不如你，你自会得好。\"或曰：\"我不会，我不如你。\"（先生曰：\"你看他作家宗师，钳锤何等严密！何等恶毒！何等亲切！当今有如是师家么？若有，与我然香来，拜他百拜。\"）眼愈疑。（先生曰：\"又吞钩一个。\"复曰：\"见块狂趋韩地犬，不贪香饵碧潭龙。\"）遂咨决于元礼首座。礼以手引师之耳，绕围炉数匝，且行且语曰：\"你自会得好。\"师曰：\"有冀开发，乃尔相戏邪？\"（先生曰：\"知恩者少，负义者多。\"）礼曰：\"他后悟去，方知今日曲折耳。\"后寒夜孤坐，拨炉见火如豆许，恍然自喜曰：（先生曰：\"你看！你看！要发疯了！清平世界那里有如许多事来。\"）\"深深拨，有些子，平生事，只如此！\"（先生复曰：\"而今世上人眼浅，只重衣冠不重贤。\"）遽起，阅案上《传灯录》，至破[空/虌-蔽]堕因缘，忽大悟，作偈曰：\"刁刁林鸟啼，（有这事）披衣终夜坐。（何必）拨火悟平生，（见神见鬼）穷神归破堕。（可知礼也）事皎人自迷，（平地吃仆）曲谈谁能和？（一种没弦琴，惟师弹得妙）念之永不忘，（休妄想）门开少人过。（白虎当轩，闻者丧胆）\"圆悟勤因诣师寮，举青林搬柴话验之。（先生曰：一家有事百家愁，一马不行百马忧。\"又曰：\"士穷见节，患难见交。\"）且谓：\"古今无人出得，你如何会？\"眼曰：\"也有甚难？\"悟曰：\"只如他道铁轮天子寰中旨，意作么生？\"眼曰：\"我道帝释宫中放赦书。\"（先生曰：两个明眼人，一齐说瞎话。\"）悟退与人曰：\"且喜远兄便有活人句也。\"<p>\"眼师在未拨火及阅破[空/虌-蔽]因缘前，固一行者也，及悟后，亦行者也。在未悟前说他是聪明、圣知、达天德者，他心里如何？既悟后，仍然说他是聪明、圣知、达天德者，他心里又如何？且不说眼师，即行人自身，祇如今日闻法者，闻拈提此语，心里又如何？\"众无语。<p>先生顾视大众，良久，乃曰：\"上穷碧落下黄泉，两处茫茫都不见。\"下座。<p>第十章 &#13;结中庸<p>第一节 &#13;总论<p>首以尾彰，势未形而大用已毕﹔尾因首显，局已终而希工正勤。事固无分乎首尾，理讵有诠乎初终？今曰结，因总而结﹔今曰终，全始而终。总结始终之立，以权信、赞、行、证之趣为实，因机及实。及实，匪特无权，而实亦不可得矣。实不可得，而无所不得。内蕴之仁，外沛之德，于是乎不言而信、不动而成也。不言何始？不动何结？始结双忘，实昭潜德。显微两知，蹈乎中庸。行人之业丕显，百辟其刑﹔君子之学笃恭，万方足式。归其至于无声，恶其文之有着，闇然日章，的然日亡，道固判于君子、小人，德实诱乎初机、来者也。始则戒惧，不睹不闻﹔终又要归无声无臭。反复谆谆，掖诱炯炯。记曰：\"百花落尽啼无尽，又向乱峰深处啼。\"懋也哉！<p>第二节 &#13;经文<p>{朱注第三十三章}《诗》曰：\"衣锦尚絅，恶其文之着也。\"故君子之道，闇然而日章，小人之道，的然而日亡。君子之道，淡而不厌，简而文，温而理，知远之近，知风之自，知微之显，可与入德矣。《诗》云：\"潜虽伏矣，亦孔之昭。\"故君子内省不疚，无恶于志。君子之所不可及者，其唯人之所不见乎？《诗》云：\"相在尔室，尚不愧于屋漏。\"故君子不动而敬，不言而信。《诗》曰：\"奏假无言，时靡有争。\"是故君子不赏而民劝，不怒而民威于斧钺。《诗》云：\"不显惟德，百辟其刑之。\"是故君子笃恭而天下平。《诗》云：\"予怀明德，不大声以色。\"子曰：\"声色之于化民，末也。《诗》曰：'德輶如毛。'毛犹有轮，上天之载，无声无臭，至矣！\"<p>一、释字<p>闇 &#13;《说文》\"闭门也。乌绀功。\"引申有隐晦义。<p>的 《说文》作\"的\"\"明也。都历切。\"引申有表见义。<p>奏 &#13;《说文》：\"进也。则[人+危-厄+厂之简体字+ˊㄧ/大]切。\"《诗·商颂·烈祖》章作\"[融-虫+傻-人]\"。《毛传》\"[融-虫+傻-人]，总。\"《释文》：\"子东反。\"<p>假 &#13;《说文》：\"至也。《虞书》曰'假于上下。'古[各+页]切。\"《诗》毛训\"大\"。郑训\"格。\"<p>二、通义<p>此章七引《诗》言，赞至道，结全篇。初言入德，次言潜伏，三曰屋漏，四曰奏假无言，五曰不显惟德，六曰予怀明德，七曰无声无臭。朱子曰：\"举一篇之要而约言之。其反复丁宁示人之意，至深切矣。学者其可不尽心乎？\"<p>先生曰：\"尽心\"二字以诠此章极善！极善！恐朱子之说，大异余言。果学人士如余说尽心也，尽心不但诠中庸尽，天下事若理乃至十三经、三藏十二部、《道德》、《南华》、耶酥《新旧约》、回教《可兰》、诸子百家无一不尽。何也？心尽至于无可尽处，尚有处在，不得言尽。此无可尽处亦尽，于是乎人尽、我尽、有尽、空尽、断尽、常尽、是尽、非尽、凡夫尽、圣人尽、乃至一切处非一切处无不尽。果尔，今之《中庸》十章尽。此十章尽也，说此《中庸》者，闻此《中庸》者，无不尽。然后从此无不尽中说入德、说潜伏、说奏假无言及无声无臭等，而说者、闻者乃至十三经、三藏十二部、《道德》、《南华》、耶、回、百家，头头上显、物物上明，觅尽不得，非尽亦不得。此中庸之至德，行人之尚趋也。故曰万物并育而不相害，道并行而不相悖。朱子之意果余说乎，不但注此《中庸》尽，当人无始大事亦了尽矣。<p>余权立十章，此开为七，余之统说、赞美、难行，入德也。践履当潜伏，一趣当屋漏，遍行、保任当奏假无言，盖遍行保任之至，无斯不顺，无斯不服，不赏而民劝，不怒而民威也。显用者，丕显惟德也。现法、报、化三身，全智、仁、勇三德。本章总论曰：\"行人之业丕显，百辟其刑﹔君子之学笃恭，万方足式。\"要者何要？予怀明德也。结者何结？无声无臭也。<p>此篇始曰\"天命之谓性\"，结曰\"上天之载\"，是始以天始，而结以天结也。天者，颠也。余说曰\"轫始而上之谓天\"。天亦幻有，皆依假立。未轫始前、既轫始后、正轫始中，悉不得言有天。何也？除前、后，无中，犹除过、未，无现也。若然，天命之谓性非始，上天之载非结，余三十一章非中。非始非结非中，而曰某始也、某中也、某结也，瞎汉也。然则是中庸者，无始、无中、无结邪？曰：\"担板汉也。\"明明始，明明中，明明结，乌得坏世间法而立奇兴异曰无？《中庸》首曰\"天命之谓性\"，继曰\"莫见乎隐，莫显乎微\"，终曰\"无声无臭，而有上天之载\"，味此，则十世古今，始终不离于当念﹔无边剎境，自他不隔于毫端。所谓言有时丝忽不立，言无时遍界不藏也。故此章七引《诗》言，六称君子，赞中庸之至德，美君子之胜行。结全篇之统旨，显未来之洪规。学人果如上说尽心，讵曰余注此为赘举，子思述之，亦蛇足矣。<p>复曰：余说《中庸》前之九章，章章尽至、字字透圆，纵颜、曾复起，孟、荀再生，赞不可，不赞不可，赞不赞均不可，共彼全力而欲得一善、不善等过，尽未来际无一罅可乘也。惟于此章漏一大隙，百拙万拙，千痴亿痴，若曰补之，匪特孟、荀、颜、曾无下手处，而释、老、耶、回亦开口不得。个中兄弟还有检别得出么？若有，即请出来对众宣说，盐亭老人许你识得尽心，不管他什么朱子、程子。若无，便是\"侍臣鹄立通明殿，一朵红云捧玉皇\"了。下座。<p>第三节 &#13;拈提<p>典牛依湛堂准于泐潭。一日潭普说曰：\"诸人苦苦就准上座，觅个什么？\"遂拊膝曰：\"会么？雪上加霜。\"（先生曰：\"倾筐倒箧，从头至尾，尽量把与当人也。会么，会么？好会﹔好会！速会！速会！\"）又拊膝曰：\"若也不会，岂不见干峰示众云：'举一不得举二，放过一着落在第二。'\"（先生曰：\"如此信口开河，不但心黑，而且脸厚。\"）师闻脱然颖悟。（先生曰：\"一出门来人咬狗，拣个狗来打石头。从来不说颠倒话，阴沟踩在脚里头、唉！唉！不知他悟个什么？况曰顿邪？\"）尝和忠道者《牧牛颂》曰：（先生曰：\"见财起意非君子，临危致命乃丈夫。\"）两角朝天，（盲认贼赃，成何体统）四脚踏地，（明知故犯，事出有心）拽段鼻绳，（恭喜！恭喜！前门失牛，后门丧马，从此做亦不做，要亦不要。嘎嘎嘎嘎），牧甚屎屁（这才是中立而不倚、上天之载、天命之谓性、自诚明、自明诚、大学之道、庭前柏树子、麻三斤、楚王城畔、汝水东流、西方日出卯、放汝三顿棒、小参不答话、斩猫、斩蛇等等一时来也。好看！好看！）张无尽见之，甚击节。先生曰：\"才有是非，纷然失心。隔壁洞房花烛，他人金榜题名，关汝甚事？大惊小怪作么？\"问者曰：\"先生说如是等言，哪一段、哪一句是结中庸的拈提？\"<p>先生曰：\"哪一字、哪一画、哪一点不是结中庸的拈提？\"进曰：\"不会。\"先生曰：\"会则朝三暮四，不会则暮四朝三。\"先生复曰：\"或问洞山价曰：'时时勤拂拭，为什么不得他衣砵？未知什么人会得？'山曰：'不入门者。'曰：'祇如不入门者，还得也无？'山曰：'虽然如此，不得不与也'山又曰：'直道本来无一物，犹未合得他衣砵。汝道甚么人合得？这里合下一转语，且道下得甚么语？（先生曰：\"卖尽风流。\"）时有一僧，下九十六转语皆不契。（先生曰：\"鼠子钻牛角，何年乃出头？\"）末后一转始惬山意。（先生曰：\"龟毛千尺凭君弄，绣出鸳鸯不似他。\"）山曰：'阇黎何不早恁么道？\"别有一僧密听，只不闻末后一转。（先生曰：\"上钩也，何不闻四海浪平龙睡稳，九天风静鹤飞高？\"）遂请益其僧。僧不肯说。（先生曰：\"好手！好手！\"）如是三年相从，终不为一举。一日因病曰：'某三年请举前话，不蒙慈悲。善取不得，恶取去也。\"遂执刃白其僧曰：'若不为某举，即杀上座去也。'（先生曰：\"好汉！好汉！\"）其僧悚然曰：\"阇黎且侍我为你举。（先生曰：\"无疾而呻，当面欺人。\"）乃曰：'直绕将来，亦无处着。'僧礼谢。（白昼见鬼也。）\"<p>先生曰：\"九十六转语语语堆金，句句集玉。洞山不肯，未免压良为贱。末后一转，无头无尾，百丑千奇，乃洽山怀，无乃嗜痂而甘？别有一僧密听，九十六语皆闻，惟不闻末后一转，真是平地死人无算，活天冤苦，何也？此九十六转语者，今固不得而闻，末后一转，声闻至今，不但余闻也，山河大地、一切有情无情莫不悉见悉闻。倘彼僧者，若于彼时同此一闻，三年之病冤、一刀之袭丑矣。况曰'直饶将来，亦无处着'乎？虽然，必闻此，大事乃毕，必举此，《中庸》乃结。乃毕乃结，而后大庾岭头一段提不起的公案，乃至时时勤拂拭、本来无一物、受授不受授等，当人如观掌珠、如察爪纹也。中庸始、中庸结，乃至仲尼授、子思受，如观掌珠、如察爪纹也。雪窦显曰：'他既不受是眼，将来必应是瞎。'还见祖师衣砵么？若于入门，便乃两手分付，非但大庾岭头一个提不起，设使合国人来，且款款将去。天童曰：'长芦即不然，直须将来。若不将来，争知不受？直须不受，若不不受，争免将来？将来的必应是眼，不受的真个是瞎。'还会么？照尽体无衣，通身合大道。如是已举未举，亦如现掌珠、如察指纹也。\"<p>举是语已，先生顾视大众，良久，弹指一声曰：\"会么？'众无语。先生复曰：\"会则我结《中庸》，不会则《中庸》结我。然则毕竟如何？\"良久乃曰：\"停车坐看枫林晚，霜叶红于二月花。\"下座。<p><a name=\"&#x7B2C;&#x4E09;&#x7F16; &#x7ED3;&#x8BF4;&#x5206;\">第三编 &#13;结说分</a><p>余说此帙任何一章、任何一则，把得便行，一行便入，一入使深，无分智愚，不列渐顿，皆能履乎上阶而蹈中庸。倘栖心两歧，妄意优劣者，必不能至。何也？盖孔、释、老、庄、耶、回，皆一时假现，水月镜花，实因当人一念而有，都非实法，无有是处矣。是此非彼，是彼非此，悉为昧行，悉为寐语。此喻如筏，如获度已，何筏非是？如未得度，何筏是是？老、庄、耶、回且暂搁置，即孔、释说，实无轾轩，仁者自闹。宣尼显化此土，言教之轨现行﹔迦文揭义殊方，事理兼诠过、未。因缘而显，缘寂斯冥。开士一见便明，何情絮絮啧啧？窃谓生死事大，远祸为佳。长夜不醒，菩萨常啼。一行有失，亲戚永叹。当人但检己阙，无较他非。苟臻于至，自然头头上显、物物上明。庄子曰：\"欲是其所非，非其所是，莫若以明。\"不着问人，孰优孰劣，何去何从，如察指纹、如观掌果也。<p>然则释孔之学，果无出入乎？是又不然。体则无殊，用即有异。释氏之说，极其大而条理外彰，行者易趋﹔孔子之说，邃其幽而理事内蕴，当人难入。入则非二，未入不一。故曰异也。倘忘其筌，寍有同乎？又迦文灭后，门人集结心灯，迄今犹自相续，广开十宗，宏宣万法。愈演而条理愈精，愈精而入德愈易，愈易而行者愈忽，忽则怠，怠则慢，慢则殆，殆斯亡也。比来海内入此门者，寥寥数人。视久成劳，法久成弊。可不慨乎？宣尼没已，杨墨乱真。殆至孟、荀，儒宗乃振。孟、荀而后，已绝薪传。汉、宋学者，其力未充，不探源掇要，誓诣上宫，乃和会比互，遂尔绝灭。总上诸因，孔以难入而先取亡。难入，故其嗣易斩。释以易趋而后及殆。易趋，故其统犹承。先后虽殊，丧道厥一。今释此经，摘释氏易趣之途，易孔子难入之径。权标十章，德入一门。讵曰长驰无弊？实亦一期坦程。历来谈孔者必斥释，谈释者必斥孔，迂哉！迂哉！小也！小也！陋乎！陋乎！<p>昔大慧杲致鄂守熊叔雅书曰：\"当人不强知、不强会，脚踏实地处， &#13;不疑孔、不疑佛，然后借佛、借孔、借老，鼻孔要自出气，真猛勇精进，胜丈夫所为也。愿猛着精彩，努力向前。\"同邪？异邪？又示张太尉益之曰：\"三教圣人，立教虽异，而其道同归一致。\"又示成机宜季恭曰：\"蓦然不知不觉向露字上绝却消息，三教圣人所说之法，不着─一问人，自然头头上明、物物上显矣。佛不云乎？菩萨摩诃萨，以无障无碍智能信一切世间境界是如来境界。古德云：'入得世间，出世无余。\"'又同邪？异邪？圭峰者，唐之开士也。其言曰：\"元、享、利、贞，干之德也，始于一气。常、乐、我、净，佛之德也，本乎─心，专一气而致柔，修─心而成道。\"攻释为同邪？伐孔为异邪？皆不驭也。故曰若得忽的一下，了儒即释、释即儒、僧即俗、俗即僧、我即你、你即我，会此，余说《中庸》为入孔、为入释、为孔释俱入、为孔释俱不入，分明一片闲田地，过去过来问主人。咄！惑哉！似此！<p>爰选三要，昭示行人。要固不仅三，今以三而总乎要。<p>一、勤修十学（即本经权开之十章）﹔<p>二、无窥他短，但补己愆﹔<p>三、─心不异。<p>行人但持此三的诣上阶，时日罔期，岁月不较，不入圣不超圣者。赵州有言：\"截取老僧头去。\"倘徘徊岐路，去取两头，或知而不趋，趋而不切，无智人也。讵曰达天德者乎？诗曰：\"洛阳三月花如锦，多少工夫织得成？\"玩之，荐之！</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
},{
    "title": "灵岩语屑",
    "author": "南怀瑾",
    "html": "<div class=\"B1_text\"><p>法语 盐亭袁焕仙先生</p><p>编辑 乐清南怀瑾、广汉杨光代、南充徐剑秋、峨山大坪寺释通宽</p><p>校讹 内江伍心言、内江伍所南、西充杨觉、华阳吕寒潭、内江曾鹤君、潼南田肇圃、曹溪南华寺释曼达、峨山大坪寺释通远</p><p>缮稿 简阳汪克成</p><p>笑岑曰：盐亭袁夫子焕仙掩关灵岩，诸方以函候，或面存者实繁。有徒凡所酬答，同学辑之曰《灵岩语屑》。灵岩者，唐天竺僧阿耆多尊者道场，锦城西胜地也，位灌县城后十里。诸峰耸蔚，俯瞰万流，极趣清幽。夫何语哉？且屑屑也。盖常闻诸夫子曰：至道无言，然非言而至道莫显；苟通其至，曾子所谓言满天下无口过者也。若然，虽有广长舌焉，遍覆三千大千世界，寂然无声矣。无声而言，故曰屑。曰诗，曰联，曰偈，曰书简等，要皆水月镜花，一时假现。读者但识斯名至道也。孔也，释也，老耶回庄也，尽空有，遍尘刹无疾而呻矣。谨序。</p><p>门人内江冷笑岑敬序</p><p>一九四四年</p><p><strong>一、壬午辑</strong></p><p>怀瑾曰：壬午，焕师掩关灵岩。怀瑾卸职往彼栖止，值师忌语。朋从我思，繁兴我疑，无由启迪，好友释传西曰：“余以若意禀师，求笔答如何？”怀瑾喜而合十曰：“可可。”因禀师，忌语则笔示，非忌语则口授，焕师颔之。数十日中遂成巨帙。今兹搜箧残简，尚存少许，犹可择读也，其言显，其义幽，其理约，其事质，吁！此千圣之心灯，入德之梯航也。敢曰自私？爰出鸿爪，飨我同仁，余尚有近体小诗七绝十处，寓言胜义，醒悟来机。又今古之绝唱者也，诚恐小见狐疑，贻陋者泥滞之误，至令醍酬上味化为毒剂，故不录出。颜曰壬午辑。辑曰：</p><p>问：“怀瑾朝夕孜孜，百无所寄，祈先生示个归家坦途，入道捷径。”</p><p>先生笔答曰：“蓦直不怠，即是坦途，曰二曰三，允非捷径。”</p><p>问：“直捷下手工夫，义当何先，迈向归家道路，车从何辔？”</p><p>先生曰：“汝但外舍六尘，内舍六根，中舍六识而不作舍不舍想，自然头头上明，物物上显，途中即家舍，家舍即途中也，捷莫捷于斯，先莫先于斯，三乘共载一德，同该今古，彻门莫尚乎是。”</p><p>问：“何云六根？何云六尘？何云六识？”</p><p>先生曰，“石头即六根，柱子即六尘，琢棒即六识。”</p><p>问，“先生如此漫言，学人不会。”</p><p>先生曰：“如此漫问，谁要汝会？”</p><p>问：“教云眼耳鼻舌身意六根，对色声香味触法六尘，根尘相接，所生眼耳鼻舌声意等之识，别曰六识，今曰六识即石头，六尘即柱子，六识即琢棒，无乃大违教义，言不该典欤？”</p><p>先生色然不悦，忿然握管，书曰：“汝既已明了教义，贯通道理，即自解脱可也，何投吾处，絮絮叨叨于是？”掷笔寂然在定。怀瑾无语潜退。</p><p>翌日再参，问：“即不许作如是道理会，然则学人浅机从何得入？”</p><p>先生曰：“汝是何年何月何时何地出的？”</p><p>怀瑾无语久之。</p><p>先生曰：“即未出入，何为出入？既无当下，一派圆成。谁是浅机？谁为深学？咄，无疾而呻，无病而药，释迦老子亦救汝不得也。”</p><p>问：“学人于此上不得，下不得，取不得，舍不得，尽平生力忘不得，计不得，祈师慈悲方便接引。”</p><p>先生曰：“好好，恐汝虽如此说，未到此地，果届此也，恭喜贺喜，好消息将到矣，谛听啼听！当人于此千万不可退步，不必作必悟想，不必作不悟想，不必想不必不想，行时坐时，醒时眠时，朋友交接时，妻儿子女会合时，但略略管带，自然坛子内走不脱鳖。”</p><p>问：“学人疑情不起奈何？”</p><p>先生曰：“只为你要信。信不立，疑何驭？疑信两忘，复是何物？此第一彻头也，千万莫要放过。“</p><p>问：“疑信两忘，就学人分上捡之，却无一物。”</p><p>先生曰：“瞎汉！说却无一物者。是有一物邪？无一物邪？好看好看。此释迦老子、三世诸佛及一切贤圣入德之门也。这个彻头，尽大地是我口都赞不及，慎勿失之交臂。”</p><p>问：“闻诸同参，疑情有二：一粗、一细何曰粗？”</p><p>先生曰：“朝天玉树春千尺。”</p><p>问：“如何曰细？”</p><p>先生曰：“带笑宫花月二分。”</p><p>问：“学人机浅，祈师如学究训蒙童，如俗而说，如理而说，觌面直提，开我迷昧。”</p><p>先生曰：“如此直截，何用肆口鼓簧，恣情摇舌，必欲饮此一杓恶水？余岂借他？谛听谛叫！如有一问题欲决择而不能决择，心悬悬如摇旌，曰粗；无一事一理不了知，无一事一理不决择，无一事一理可寻思，自心空廓，眼所见处澄然常寂，乐趣横生，根尘与识，自心及境，不一不异，无欠无余，如是胜行悉已具足，而此心中似有一事未办，一理未谐，仔细捡点，又丝忽迹相不寓，半星肤兆无有，曰细。”</p><p>问：“如是胜行，学人浅机，何能一时即臻，一趣即至？既难臻至，何能顿超？”</p><p>先生曰：“一派现成，谁要汝臻？本无去来，谁叫汝至？横遍十方，谁令汝超？实无有渐，谁云为顿？因诠劣法，故有胜行，曰深曰浅，允为魔说。法尔圆成，慎毋自闹。”</p><p>问：“千古圣哲，人也，学人虽愚不肖，亦人也。既云如是现成，如是直捷，如何学人不会，先圣独会？乞师朗示。”</p><p>先生曰：“汝自不去，不妨人会。人自人会，不妨汝之不去。会则学人即圣哲，不会则圣哲亦学人。圣哲学人名虽有二，体实无殊。汝但把会与不会等念抛到异域，学人圣哲等名贬向殊方，自然虚而灵，寂而照，不着问人，法华会上的多宝如来，不但与释迦老子分半座，亦须与汝分半坐也。”</p><p>问：“上说疑情，既有粗细之判，必有真假之诠，既有真假，云何曰真？”</p><p>先生曰：“汤元煮油锅。”</p><p>问：“如何是假？”</p><p>先生曰：“油锅都汤元。”</p><p>问：“如是之谈，益增学人迷惘。望师剀切直示，开我巨惑。”</p><p>先生曰：“咄，何不云迷惘益增，学人开我不惑？”</p><p>怀瑾无语久之。</p><p>先生曰：“会么？会么？诸名无常，皆依假立，若无假有，真亦强名。诠疑情曰假者，即上说粗相，有间断者也。说疑情曰真者，即上说细相，无间断者也。真疑若起，不一日，不二日，不三日，不一时，不二时，不三时，必摸着向上关（木戾），发明无始大事，嘎嘎大笑也！”</p><p>问：“从古迄今，有不疑而至悟者乎？”</p><p>先生呼：“怀瑾！怀瑾！”应诺。先生曰：“从古及今有未食饭而曰已饱，未饮酒而曰已醉者乎？”</p><p>问：“如说无疑则无悟，欲悟而必借径于疑，明矣！然则学人疑情不起，环顾自躬，实无纤疑，奈何？”</p><p>先生曰：“今有三法，能兴汝疑。”</p><p>问：“何者云三？”</p><p>先生曰：“一恸念生死，二发露忏悔，三勤参话头，如是三事，任何一事，皆能兴汝大疑。”</p><p>问：“云何言恸念生死？”</p><p>先生曰：“当人无始驰求，背本逐未，生不知来处，死不知去处，头出头没，舍生受生，枉受轮回，虚萦苦乐，如是等过，极思出离，思之至极，于焉起行，难行能行，日渐增至，细检出离，无法出离，无法出离，誓必出离，粗疑生也。粗疑既生，日日臻上，渐至觅行不得，觅不行不得，觅难不得，觅不难不得，觅生不得，觅死亦不得，觅人法、是非、山河、大地、苦空、无我，一切皆不得，二六时中乐趣横生，而此心中又若有一事焉未办，有一理焉未谐，细疑生也。细疑生，即真疑起矣。”</p><p>问：“云何发露忏悔？”</p><p>先生曰：“汝当恸念师恩，父母恩，五伦九族一切众生恩，欲报难报，难报必报。既曰必报，当充我力，欲充我力，远过为先。行人必自检讨往昔所作十恶不善等业，皆障我行，人我胜劣等法，皆违我道。当于佛前法前僧前恸悔过去已作之过，切忏不践将来未蹈之愆，心生惭愧，身堪起行，粗疑生也，粗疑既生，日日臻上，渐至觅过不得，觅非过不得，觅善不得，觅非善不得，觅忏悔不忏悔、一切胜劣等法，山河大地，日月星辰，苦空无我等等，已举未举，皆不可得，二六时中，乐趣横生，而此心中又若有一事焉未办，有一理焉未谐，细疑生也。细疑生即真疑起矣。”</p><p>问：“云何勤参话头？”</p><p>先生曰，“话头者，止观双运，遮照同时，（井刃）于唐，盛于宋。初机入德之津梁，千圣共由之胜法也。汝但朝斯夕斯，行时卧时，刻刻提撕，时时照检，一切胜行，自然而沛，矧曰疑邪？”</p><p>问曰：“云何为话头？”</p><p>先生曰：“汝但于未提话头以前，看此话头从何而生；既提话头以后，看此话头从何而灭；正提话头时，看此话头依何而住。话头之义不必问人，当人自合开口大笑也。”</p><p>问：“学人迷昧，罔测幽深，请师将古人说的参的直举一二，以醒愚昧，并兴来学。”</p><p>先生曰：“北斗里藏身、小参不答话、庭前柏树子、狗子无佛性、麻三斤、干矢橛、西方日出卯、父母未生前面目是谁、无梦无想主人公在何处安身立命、念佛是谁、家家门前火把子、东山水上行、一归何处，如是已举未举，悉名话头。古德究参皆能结秀，今欲悉说，尘劫不尽。”</p><p>问：“话头既多，依何为要？若曰兼摄，事涉分歧，趣此两端，祈师直示。”</p><p>先生曰：“任一话头，皆能结秀。曰二曰三，允为魔说。古人喻为鼠子咬棺材只在一处。修多罗曰：‘制心一处，无事不办。’若曰至行，一已云多，况二三邪？”</p><p>问：“大慧杲，宋之大宗匠也，常以‘无’字示人究参；天奇瑞，明之大宗匠也，常以‘谁’字示人究参：钱伊庵者又以学人必参无梦无想主人公在何处安身立命，乃能于八识上大亚一刀。而现在丛席多示学人参念佛是谁。今先生云云任一话头皆可结秀，彼非欤？此非欤？乞示。”</p><p>先生厉声曰：“家家门前火把子。”</p><p>怀瑾曰：“不会。祈师直指。”</p><p>先生色霁笑而谓曰：“家家门前火把子。”</p><p>怀瑾曰：“不会。祈师如理而说，如俗而说。”</p><p>先生曰：“他非我不非，何也？因有汝问才有他非，因有他非才有不非，始无汝问，所谓你我他者从何而立？既无有立，非从何非？况不非邪？好看好看！麻三斤、干矢橛、庭前柏树子、犀牛扇、食胡饼、吃茶去一时来也。谁管他大宗匠，小宗匠，高人琢棒，一时与我贬向他方，踏在足下，为何如此？要汝精精勤勤、快快活活参话头。”</p><p>问：“是话头者约分有义路、无义路、半有半无义路，今不可一味笼统，教令学人随捡一话头无味苦参也。当否？祈示。”</p><p>先生曰：“何一话头有义路，何一话头无义路，何一话头半有义路半无义路？汝若细检，今即汝者为有义路、为无义路、为半有半无义路？道来道来！向汝道任一话头皆可结秀，犹自趁块作么？”</p><p>问：“如说尚矣，学人浅机，参法依何？”</p><p>先生曰：“如参柏树子话，朝斯夕斯，行时卧时，口计心思，缘不外逸，一心只在此话头上，如蜂就蜜，如蚁就膻，如马就道，然后从此口计心思、缘不外逸上轻轻提起，略略管带，不用思量，不用卜度，不用有心，不用无心，不必待悟，不必不悟，惺惺行履，如实而行，如实而住，如实而坐，如实而卧，自然有瓜熟蒂落的时节。”</p><p>问：“正参究话头，杂念纷陈时如何？”</p><p>先生曰：“精进。盖杂念纷陈，正汝懈怠。倘不懈怠，心缘一境，彼杂念者从何而入？喻如无蚁之堤，水不能溃。勿忽勿忽！”</p><p>问：“正参究话头，忽尔神昏志昧，身不能堪，欲睡眠时如何？”</p><p>先生曰：“要睡便睡，不可睡时便参究不得也。”</p><p>问：“正参究话头，忽尔亲仇交集，家事国事己事他事一时纷来，如何？”</p><p>先生曰：“如理而作事，如理而交代，各就各位，正好究参，关汝何事？”</p><p>问：“正参话头，妻儿子女一时纷至，各相毁誉，去取抑扬时如何？”</p><p>先生曰：“文殊、普贤、观音、势至，一齐来接汝也，正是得力关头，何亏于汝？”</p><p>问：“正参话头，家徒四壁，朝夕不谋时如何？”</p><p>先生曰：“正好在吃油糍、胡饼、赵州茶上切切实实用功，莫要把无始劫来一件大事业轻轻放过。”</p><p>问：“家拥厚赀、食前方丈、从者数百、妾美妻娇，能参话头否？”</p><p>先生曰，“正好参究。若不参究，一期报尽，牛胎马腹，应缘而去，彼妻美妾娇厚赀而重奉者，以佛眼观之，如就刀山，如躬涂炭。”</p><p>问：“家拥厚赀者参究话头时，去彼娇妻美妾、食前方丈、从者数百乎？抑仍彼旧业乎？”</p><p>先生曰：“实际理地，不立一尘，万行门中，不减一法。去去何所？仍仍何处？汝若一觑觑破是话头者，岂离娇妻美妾、食前方丈、从者数百外而别有一话头邪？”</p><p>问：“士农工商兵等，能参话头否？若能，于彼进业有损恼否？”</p><p>先生曰：“士农工商兵必需参究，何有能否？若不尔者，理从何明？业从何进？进德修业于是乎在，有何损恼？”</p><p>问：“年老者能参话头否？”</p><p>先生曰：“武王受命，经称曰末；宝掌闻玄，年已逾耆，正当着力，云何不参？”</p><p>问：“年少者能参话头否？”</p><p>先生曰：“百丈四龄便欲作佛，云何不参？”</p><p>问：“女子能参话头否？”</p><p>先生曰：“龙女八岁即已作佛，云何不参？”</p><p>问：“壮年妇人能参话头否？”</p><p>先生曰：“金陵婆子参无位真人而了彻心要，云胡不参？”</p><p>问：“老年妇人能参话头否？”</p><p>先生曰：“范太封君究一归何处而明本体，云何不参？”</p><p>问：“病时能参话头否？”</p><p>先生曰：“圆悟勤金山一病而之五祖，云胡不参？”</p><p>同：“宗习外道者，能参话头否？”</p><p>先生曰：“吕纯阳见黄龙而碎琴亡汞，云胡不参？”</p><p>问：“荡女淫妇能参话头否？”</p><p>先生曰：“婆须提多早示矩范，摩登伽女略露风规，云胡不参？”</p><p>问：“市井少年能参话头否？”</p><p>先生曰：“涅槃会上广额屠儿，自云贤劫千佛之一，云胡不参？”</p><p>问：“正参话头时，不但心未开悟，真疑未起而粗疑亦无，忽然暴病而死如何？”</p><p>先生曰：“恭喜，贺喜，大事了毕。”</p><p>问：“如何是大事了毕？”</p><p>先生曰：“免汝打之绕，与你絮絮叨叨说参话头。”</p><p>问：“持一佛号，临命终时尚能往生极乐，持此话头，临命终时，宁曰进退失据乎？若不尔者，究生何土？祈示。”</p><p>先生曰：“生汝嘴里！”</p><p>问：“何故生学人嘴里？”</p><p>先生曰：“为汝乱说，所以生汝嘴里。”</p><p>问：“学人迷惘，请师如理而说，如俗而说。”</p><p>先生曰：“当人果能抱一话头，至死不渝，临命终时，随愿往生天上人间十方净上，应念而至。即不尔者，异世出头，一闻千悟，古人所谓历在耳根，永为道种者也，况朝夕孜孜，临死犹抱一个话头邪？”</p><p>问：“参话头，守戒定慧等三学否？”</p><p>先生曰：“守，能参即慧，常参即定；牧心一处，专在话头而不外驰即戒。”</p><p>问：“参话头，修止观二法否？”</p><p>先生曰：“修。牧心一处，常参话头，即止；栖心话头，不沉不浮，不内不外，不断不常，不生下灭，不有不无，照而常寂，曰观。”</p><p>问：“参话头，修生圆二次第否？”</p><p>先生曰：“修。话头未纯熟前，不参令参，欲参难参，难参必参，曰生起次第。话头纯熟后，不参即参，参即不参，曰圆满次第。”</p><p>问：“参话头是否缘生性空？”</p><p>先生曰：“是。参话头即缘生，不参话头即性空；不参话头即缘生，参话头即性空。”</p><p>问：“参话头修般舟三昧否？”</p><p>先生曰：“修。汝能七日七夜心缘一境，把着话头，定得开悟，不必九十日也。”</p><p>问：“参话头诠胜俗二谛否？”</p><p>先生曰：“诠。参即俗谛，参而无参，无参而参即胜谛。”</p><p>问：“参话头莫属密法否？”</p><p>先生曰：“属密。对面不相识故，曰世尊有密语。”</p><p>问：“参话头莫属显法否？”</p><p>先生曰：“属显，遍界不能藏，故曰迦叶不覆藏。”</p><p>问：“参话头莫是小乘法否？”</p><p>先生曰：“是小乘法，谓汝参话头有功用故，有修证故，有开悟故，有所得故。”</p><p>问：“参话头莫是大乘法否？”</p><p>先生曰：“是大乘法，谓汝参话头无功用故，无修证故，无开悟故，无所得故。”</p><p>问：“参话头莫落空否？”</p><p>先生曰：“落空，参一话头不作一话头故。”</p><p>问：“参话头莫滞有否？”</p><p>先生曰：“滞有，参一话头即是一话头故。”</p><p>问：，“参话头莫属非有非空否？”</p><p>先生曰：“非有非空，参一话头不作一话头，不作一话头即是一话头故。”</p><p>问：“参话头显法报化三身否？”</p><p>先生曰：“显。能参即报身，所参即化身，能所两忘即法身故。”</p><p>问：“参话头具足智仁勇三德否？”</p><p>先生曰：“具足。知参话头即智，能参话头即勇，一种平怀无染无净即仁故。”</p><p>问：“参话头具足法身、般若、解脱三支否？”</p><p>先生曰：“具足。话头起参即般苦，话头不着即解脱，话头寂灭即法身故。”</p><p>问：“话头具足菩提否？”</p><p>先生曰：“话头即菩提，菩提即话头，胡云具足不具足？所以者何？菩提者空无所得也，话头者亦空无所得也。”</p><p>问:“话头具足涅槃否？”</p><p>先生曰：“话头即涅槃，涅槃即话头，胡云具足不具足？所以者何？涅槃者不生不灭义，话头者亦不生不灭义，盖话头之起为缘起，话头之灭为缘灭，而是话头者本自不生，今何曰灭？即无生灭故即涅槃。”</p><p>问：“参话头每每易作道理会时如何？”</p><p>先生曰：“若作道理会，三藏十二教有明文，何故亲投吾处学参话头？”问：“学人当参话头时，不作道理会如何？”</p><p>先生曰：“道理与汝何仇何怨汝不会他？”</p><p>问：“学人参话头时，不作道理会，亦不作不作道理会时如何？”</p><p>先生曰：“丑！一派游腔滑调，戏论诽言，允为魔说，何有吾宗？”搁笔不书，寂然在定。久之，怀瑾私退。</p><p>翌日再参，问：“学人参情紧切，或觉大弥虚空，或金光闪烁，或显赤白黄绿等光，大如月轮，小如豆粒，或如电光闪烁时，未审何至，属优属劣，未知何从？祈示。”</p><p>先生曰：“概属光影，汝但不着，亦许胜境，若欲取之，翻成大患，何也？盖汝之本体无相，无空无不空也。”</p><p>问：“正参话头时，忽觉虚空粉碎，大地平沉时如何？”</p><p>先生曰：“咄！我说汝白昼见鬼，何也？虚空无形，汝从何碎？且不说粉，赵公山高，灵岩山低，汝从何平？且不说大地非大地。”</p><p>问：“参话头不能虚空粉碎，大地平沉邪？”</p><p>先生曰：“恭喜恭喜！虚空粉碎也。贺喜贺喜！大地平沉也。细检细检！”</p><p>问：“古德云：‘虚空落地’、‘柏树子成佛’。未审参话头能否届此？”</p><p>先生曰：“能。汝参话头便是柏树子成佛，不参话头便是虚空落地。”</p><p>问：“古德云：‘藏身处莫踪迹，莫踪迹处莫藏身’。未审参话头能否届此？”</p><p>先生曰：“参话头便是藏身处莫踪迹，不参话便是莫踪迹处莫藏身。”</p><p>问：“学人必到何阶真疑乃生？”</p><p>先生曰：“不问收获，只问耕耘。”</p><p>问：“真疑起已，开大悟后，还参话头否？”</p><p>先生曰：“参。谓话头在未悟前为方便般若，即悟后即实相般若。”</p><p>问：“得大悟后，顿同佛体，莫不参话头否？”</p><p>先生曰：“不参。谓既开悟后，觅法不得，觅人不得，觅我不得，谁是话头？谁是参者？”</p><p>问：“大悟人莫无功勋否？”</p><p>先生曰：“若无功勋，谁教化汝？”</p><p>问：“大悟人莫有功勋否？”</p><p>先生曰：“若有功勋，何云大悟？”</p><p>问：“大悟人还修报化否？”</p><p>先生曰：“报化体空，谁是修者？谁当修者？”</p><p>问：“大悟人莫不修报化否？”</p><p>先生曰：“若不修者，谁知报化？”</p><p>问：“大悟人还断习气否？”</p><p>先生曰：“若断习气，阿谁大悟？”</p><p>问，“大悟人莫不断习气否？”</p><p>先生曰：“不断习气，汝从何悟？”</p><p>问：“大悟人还得神通否？”</p><p>先生曰：“不得神通，是谁得悟？”</p><p>问：“大悟人必得种通否？”</p><p>先生曰：“若得神通，是得神通，何云大悟？”</p><p>问：“大悟人还成佛否？”</p><p>先生曰：“汝食饭，还饱否？”</p><p>问：“大悟人还有位否？”</p><p>先生曰：“有。劣法尚有，况大悟人邪？”</p><p>问：“大悟人既云有位，是彼位者，在凡位邪？在贤位邪？抑在声闻、缘觉、菩萨、佛等位邪？”</p><p>先生曰：“不在凡位不在贤位，不在声闻、缘觉、菩萨、佛等位。”</p><p>问：“既不在如是等位，确在何位？”</p><p>先生曰：“确在何位？”</p><p>问：“何位？既何云，何曰位？”</p><p>先生曰：“一位不居，位位皆显，说名何位，何位无何，无何即位，权曰确在何位。”</p><p>问：“莫落空否？”</p><p>先生曰：“不落空，了了常知故。”</p><p>问：“莫成断灭否？”</p><p>先生曰：“不成断灭，感而遂通故。”</p><p>问：“莫滞有否？”</p><p>先生曰：“不滞有，得无所得故。”</p><p>问：“莫趣两岐否？”</p><p>先生曰：“不趣两歧，长不是短，青不是黄，有不是空，是法住法位故。”</p><p>问：“莫自语相违否？”</p><p>先生曰：“不自语相违，滴滴显无生之沛，圆圆透法尔之全故。”</p><p>问：“如是放论游词，莫染污否？”</p><p>先生曰：“不染污，万法本闲，体净不受故。”</p><p>问：“毕竟一句，究作何道？”</p><p>先生曰：“斜阳不放霜林晚，染叶红于二月花。”</p><p>先生搁笔，怀瑾礼退。</p><p>此壬午未行七前九秋之序。灵岩红叶，正满山也。焕师笔示口授怀瑾者多侪伦数数倍，固忽而轻之。今兹捡箧，口授则几罄忘，笔示幸能略存残纸，一读再读，汗泪交倾，此狮子一滴乳也。怀瑾不悉往昔作何恶业，背我本明，乃等王膳于秕糠，齐黄钟于瓦釜，使非灵岩一七亲味醍醐，深沐法乳，而是篇之辑能现于世乎？而今而后，益知业不进思，必鲜深见，益滋陋矣！今辑此而梓，固昭告同仁，抑亦为浅尝法味，误金作砂，如怀瑾者痛下一拶耳。”</p><p>乐清南怀瑾谨辑</p><p>一九四三年六月吉日</p><p> </p><p><strong>二、尺素</strong><p>&#13;灵岩七会既已，诸方长老共省中贤明缁素尊宿集成都文殊院而议曰：“比来禅德寥寥，曹溪南华寺和尚虚云者，宗门哲匠也。驻陪都，幸密迩，宜派重员迎其宾省，矜式来学”云云。众可之。推昌圆法师、焕师往。逆丁行，昌公病，怀瑾侍焕师行，载道前日，友好麋集而谓怀瑾曰：“比到陪都必有一番议论也，其毕志以告如何？”怀瑾曰：“诺。”兹辑此帙内彼时答朋侪书揭之，颜其篇名“尺素”。讵曰集赘？然亦飨我同好者矣。书曰：“某某足下，怀瑾侍焕师车行两日，乃抵陪都，与虚老过从五日，前后数谈，益知作家相见，备极平常，不但未逞机锋，更无所谓棒喝也。使非兵连祸结，丝忽朕兆都难寻讨。谚曰：：大智不肆口，大拳不弄手。’不其然乎？纵有一二缀四连三，然亦击石火闪电光者矣。知注特及。<p>&#13;“明日焕师偕吴先生适钧、孔先生阵云，南渡谒虚老于狮子山之慈云寺，盖救国息灾法会亦设坛于此也，吴、孔为焕师介绍弘伞、显明二师，二师者密迩虚老者也，且以刺和诸方请牍，托代进。二师诺之，手去。久之，虚老命侍者延焕师往。及室，焕师伏地胡拜，虚老扶之起而看坐曰：‘老居士甚可不必也。’焕师坐通来意，然未一言及佛法禅道，虚老曰：‘老居士来意，余已知之。老居士不为自己而来，是为众生而来。’焕师笑而摇首曰：‘不是！不是！’旋辞去，虚老门送。怀瑾退。此第一则会语也。<p>&#13;“越日，戴先生季陶与焕师晤子法会之客室，焕师曰：‘蓉中诸君子渴望虚老一临，彼间仁者能一劝驾否乎？’戴曰：‘虚老高年，刻又奇冷，且五十日法会波波疲惫已甚，鄙意听之之如何？’焕师曰：‘善。’然虚老宾省之念固未斩也。滇主席龙云以代表来迎，赴蓉之议乃寝。盖到蓉必及滇，于事于时都不可也。于是焕师乃邀弘伞法师持语虚老曰：‘五十日法会，和尚未拔一人，成都佛子甚为精进，倘到彼，虽曰不得巨鳌，然小鱼尾尾必多吞饵者。’伞师持似，虚老笑曰：‘虚云老矣，钓且无，虽小尚不奈何，况巨邪？’伞师复闻，焕师曰：“苦！苦！倘有钓，成都抛纶者固多，不必和尚也。’此第二则背语。<p>&#13;“法会毕，虚老邀焕师夜谈，怀瑾侍，且曰：法会已终，彼此无事，可以冲冲壳子，甚不必拘拘律仪也。’焕师曰：‘善。虽然和尚西来，君虽明，惜相非良辅矣。五十日法会波波，未免水里画纹，空中书字。’虚老曰：‘何谓也？’焕师曰：良辰难值，良机易久。’虚老大笑，复曰：‘老居士与显明法师过从否邪？’焕师曰：‘不但过从，而且甚密。’虚老曰：‘有说乎？’焕师曰：‘有。’虚老曰：‘何说？’焕师曰：‘教渠踏踏实实与和尚作侍者三年，必摸着向上关（木戾）。渠曰：摸不着时如何？余曰：瞎瞎！你来成都觅一个啄棒打发你。’虚老大笑，且曰：‘成都学佛朋友如何用功？’焕师曰：‘有三种朋友落在难处，不可救药，所以望老师刀斧也。’虚老曰：‘云何曰一？’焕师曰：‘一云悟后起修报化，一云一悟便休更有何事？一云修即不修，不修即修。’虚老曰：‘嘻！天下老乌一般黑。’又曰：‘以此道兴替论，贵省之盛甲全国，而犹云云，况余乎？此当机所以不许徇情，而贵眼正者也。’焕师曰：‘唯，唯。’<p>&#13;“虚老曰：‘比来一般魔子酷嗜种通，并以之而课道行高下，成都朋友有如是等过患否乎？’焕师曰：‘有，有，还是天下老乌一般黑。’语已，指怀瑾而谓虚老曰：‘此生在灵岩七会中亦小小有个入处，曾一度发通，隔重垣见一切物，举似余，余力斥之，累日乃平。’言未卒，虚老曰：‘好！好！幸老居士眼明手快，一时打却，不然险矣危哉！所以者何，大法未明，多取证一分神通，即多障蔽本分上一分光明，素丝歧路，达者惑焉。故仰山曰：神通乃圣末边事，但得本莫愁末也。彼时纵谈声震瓦屋，极尽其趣。焕师骤起礼拜，虚老手扶曰：‘居士作么？’焕师曰：‘丁行之日，昌圆法师托焕仙问和尚一语云：如何是定相？彼时焕仙即欲答言：已问和尚了也。旋以祸不入慎家之门，胶口至今，乞师一语毕来命，’虚老曰：‘本来非动，求定奚为？永嘉云：二十空门，原不着一性。如来体自同，若起心求定，是为魔境，定境既魔，相安有是？若有是处，皆功勋边事也，请语昌师，决不相诳。’焕师笑曰：‘诳也！诳也！’起退。虚老挽曰：‘住，住！年来惟今日冲壳子，心中甚开阔也。夜虽深，余力尚能支。’又数十分钟。退。此第三度会语也。<p>&#13;“滇代表戒老和尚，虚老同参也。共王九龄君谓焕师曰：‘虚老能到蓉，滇即不难速驾。然此老极询情，且重先生，若辱跪求，必如愿，如何？’焕师知不可，然以为法为友，慨然偕怀瑾长跪俯请，虚老手之令起曰：‘老居士起，起。’焕师仍伏地，虚老曰：‘老居士愿虚云多活几年即请起。明岁之冬的来成都，不然与老居士道谢辞行矣。’焕师悚然而起，挽以住世，虚老领之。于是亲书一偈，并《南华小志》一册，自像一纸，赠焕师。偈曰，‘大道无难亦无易，由来难易不相干。等闲坐断千差路，魔佛难将正眼观。’复赠吴梦老偈一、像一，复蓉中诸贤信多函，托焕师转。明日回曹溪之南华。怀瑾侍焕师趋潼南之玉溪。”<p>&#13;乐清南怀瑾敬辑<p>&#13;大中华民国三十二年六月吉日</p><p> </p><p><strong>三、杂章</strong><p>&#13;广汉杨光代记曰：焕师掩关前后数月中，口示笔谈记者有之，忘者有之，而未记而未忘而收不胜收者亦有之。朋侪或志其言，或彰其行，光代书生不辩菽麦，宁知胜行？实愚之甚者也。又性懒而酷嗜言章，惟于焕师只字片纸或闻诸于友，或亲炙于师，或道听，或野闻，莫不悉捡而内册中，意者赴初学之来机，彰先哲之楷范，于是乎在也。今辑斯帙，断自掩关时，爰汇及之。<p>&#13;随唱<p>&#13;南山人在北山阿，错把平原认险柯。色色穷源空有我，心心相印本无他。忘情片刻非关少，作业三祗一念多，个个楼门通大道，凌风鹞子过新罗。<p>&#13;其二<p>&#13;认取真空自不空，本来非异强称同。三轮体幻君休趁，一派圆成孰假工，有义可循皆剩法，依门得入是虚通。无端多事澄潭月，印出桃花倩软红。<p>&#13;其三<p>&#13;朝朝弹个莫弦琴，认得淤泥不是金。弥勒门门皆可入，当人的的枉探寻。悟时有悟悟非悟，心到无心心乃心。一派圆成天上月，本来非霁亦非阴。<p>&#13;其四  一<p>&#13;纯阳昔日到黄尤，长剑亲提未肯封。有粟饶君藏世界，无铛执与煮虬松。汞金不炼非关洁，布袋全抛亦是慵。欲就先生明个事，一天晴月九垓共。<p>&#13;颂初祖达摩人师像<p>&#13;什么菩提什么禅，破沙炉值几文钱。一花五叶寻常事，何处将心向汝安？<p>&#13;颂马大师道一肖像<p>&#13;踏胸搊鼻掷斧下，觑的事，即不问如何是，自从胡乱后，三十年不少盐酱，这个是谁人语？谁人像？一时记不到心上，哦！明白了，的的是四川马簸箕的小儿子，做出了江西道一大和尚，不信道明眼人前一任举向。<p>&#13;舟行口号<p>&#13;卸却高车赁小船，不知何故不成眠，偶然一觉醒来看，已过垂杨浅水边。<p>&#13;拈永明寿四料拣<p>&#13;四偈煌煌耀古今，行人到此每沉吟。万缘非有休狂趁，一物已无何处寻？戏把枯桐收作乐，权将黄叶指为金。等闲透个成亏语，好听清宵昭氏琴。<p>&#13;咏根器优劣  i<p>&#13;梅开谁自问春先，小草无端计后前。一派随心谈五位，几回肆口说三玄。风回花送窥帘月，雪过云开带笑天。凡圣由来非二法，言愚已妄况言贤。<p>&#13;颂断无明<p>&#13;嗟君何事断无明，断却无明断又生，了体明明无彼我，缘行处处有亏盈。心空万法非关静，足遍千山不是行。为报痴狂门外客，从来谁败复谁成。<p>&#13;赠龙华长老性空开堂<p>&#13;明明百草头头荐，谁向西河卖弄狮？流水不曾怀昨日，桃花依旧到春时。与人有法还同妄，执我无心也是痴。问取龙华今长老，为谁跨跳为谁提？<p>&#13;口号五言二律<p>&#13;业识奔如许，家山到几时。惭言精进我，羞对天人师。五蕴明明幻，诸缘处处痴。藏珍谁可拟，之子欲何之？<p>&#13;其二<p>&#13;谁铸河山暗，嗟君自取明。寒潭澄万籁，皓月整三更。寂寂非无计，行行觉有情。是谁呼小玉，莫趁认虚声。<p>&#13;偶成<p>&#13;春信来花外，平林鸟下迟。缘心空有我，得智本无师。理事何曾碍，朦胧不是痴，明明扉启处。正是闭扉时。<p>&#13;书怀<p>&#13;从惊新梦觉，万派竟流洪。有酒休辞醉，无心不可通。春融天意外，人在月明中。去住原非碍，冰河发焰红。<p>&#13;椎秦<p>&#13;天风寒以冽，霜兮霜兮六月，我有思兮天浪，发美人兮忍引自，风狂兮砭肌骨。<p>&#13;我有排霄翮，不渡关河黑。谁栽路旁草，离离行不得。<p>&#13;是邪非邪，侬心夜夜到梅花，谁搅酪酥为粪毒，嗟嗟！十室九无家，君休看，莫邪！<p>&#13;修我戈矛不可以，仇我有思兮汝岂知？汝不知兮心烦忧。<p>&#13;椎秦无赖子，翩翩独当途，举世咸推桧，而我胡为乎？荆棒道路旁，默默不成行。<p>&#13;黄河<p>&#13;黄河之水浊，千年万年恣。荡涤谁家儿子？愤扬波不澄清，工驰角是非失经，今我不乐。<p>&#13;黑夜望黄河，严霜飞六月。而我天涯客，欲济怜舟筏。况乃正当年，谁堪对葳蕨？<p>&#13;黄河黄河滋我烦忧，振振君子明德其求，倾东溟兮而洗浊兮。猗欤谁俦？<p>&#13;光代曰：“《椎秦》五章，《黄河》三章寓言胜义，惺赴来机。若曰世谛流布，实谬玉而曰燕石，不可也。”<p>&#13;牧牛<p>&#13;噫！这头牲永日山行，野性难驯，蓦鼻牵来闲处牧。忽又狂奔，细认无迹，何术拘拧？犯人禾稼，入水穿云，哦！我眼未全，嗔本来无，任么牧童，何处牧牛，从何处寻？谁管他有腔笛无腔笛，弄到天明，斜阳芳草，紫陌娇垧，雪月风霜。阴与晴，总是虚声。听听哑儿歌一曲，谷应山鸣。<p>&#13;不令<p>&#13;胡嗟尔仪兮，策以授余，匪策之好矣！厥德惟追，金兮玉兮，匪我之怀矣！嗟彼君子，于役于此，友朋孔多，于居于止，终心藏之，曷可忘之？<p>&#13;齐齐尔邻，懋懋尔德，尔德不孤，尔仪孔则，愿言偕行，骖之八骏，驭彼天衢，云胡不令。<p>&#13;光代曰：“《不今》，戒独也。独则孤陋而寡闻，胜径莫践，行人过也。”<p>&#13;客来<p>&#13;客来不速去，由他高卧南山北斗斜，一觉醒来了无事，云门胡饼赵州茶。<p>&#13;长庆<p>&#13;长庆到百丈，倒骑牛背上，拈起百杂碎，十方空荡荡。任么老婆心，现此好模样？敬白如我曹，光阴休自浪，饭颗山头饭，枵腹去来是。痴汉君不见兮，见见见见见。<p>&#13;元旦<p>&#13;元无所始，旦亦空名，本来虚寂，妄新自评旦夕对待，除对无言。依妄生计，万类以形。识得贼根，总是虚声，不妨沽酒，任性陶情。<p>&#13;我不辞醉，亦不趋醒。醉醒名言，何有于真？无相光中，再进一巡。 <p>&#13;孔释<p>&#13;是非心尽，孰住孰行？曰释曰孔，其义皆心。尊孔非释，自背其明。尊释非孔，见亦失真，此心非二，一亦不存。枝虽千异，根则同根。途有万殊，到家皆亲。我语能仁，我见云云。见亦非见，谁俗谁僧？无相光中，万相以形，入此法门，不立见闻。离见即见，立闻不闻，得无所得，释兮孔兮何分？<p>&#13;古寺<p>&#13;古寺云深盖，闭关户不扃。未闻师说法，何处有龙听？到处云迷径，时闻钟磬声。独寻师不见，山月自空明。<p>&#13;一切<p>&#13;一切境因心有，心亡一切境亡。明明心如幻化，何收何放何狂？其体本虚，无碍明净，遍澈十方，瞥尔情生，一念著之，便起祸殃，凡圣皆缘妄计，佛道魔道非良，了达性自空寂，当人何用不臧？虽然理事如是，行解相应为强。苦我下根愚钝，说食终未充肠。行时转生过患，波波度日堪伤。宣尼七十从心，香林卅年道场。悯余牛马小走，敢不日夜相将？何时冰河焰发，十方殊土齐光。圆悟云：熏风自南来，殿阁生微凉。<p>&#13;丘兮<p>&#13;丘兮垤兮，山之类矣。嵩兮泰兮，岳之望矣。彼君子兮，我之怀矣。<p>&#13;嗟彼怀人，实追尔修，仪于邦家，友朋是求。<p>&#13;何嗟尔仪兮，不藏忒兮。凡今之人兮，不轨则兮，匪我之怀矣。<p>&#13;光代曰：“《丘兮》，思美人也。”<p>&#13;今夜蜀山月<p>&#13;今夜蜀山月，舒明雾可开。行行人万里，落落未归来。<p>&#13;今夜蜀山月，天涯望欲痴，不堪春冷冷，起视夜迟迟。<p>&#13;今夜蜀山月，铺光到海头。淋淋千尺水，不洗世烦忧。<p>&#13;今夜蜀山月，闺中只独看。佳人河汉隔，的的渡江难。<p>&#13;光代曰：“《蜀山月》行者回车难辔，真妄失齐，伤乖时也。夜夜者，叠言深感耳。”<p>&#13;行者日<p>&#13;日夜究个事，与么难成办，求之不可得，舍之亦过患，不舍复不求，其事自成现，明知个中情，行时总碍陷，顾我实愚顽，荐此何太难？尝闻一宿觉，一语即契合。彼丈夫兮我丈夫，何自趁焰如狂鹿？个中无知实无见。一切圆成净无绊，不离当处常澄然。咄！我无崖岸中立崖岸。<p>&#13;一炉<p>&#13;倒化立亡事有无，本来不二理何殊？蓦然布袋撕将破，天地原来共一炉。<p>&#13;赠秀空和尚<p>&#13;谁骑水牯到南泉，牛背横加逐影鞭。纵是无心犹远道，何堪有念侈谈禅？风行百草头头荐，月印千江处处圆。偿得云门胡饼价，赵州茶自不须煎。<p>&#13;光代曰：“先生于灵岩寺正殿撰一联，未付梓即下山。”联曰：<p>&#13;溉数万顷良田，在山泉水清出山泉水清，好个比邻秦大守；<p>&#13;揉千七则藤葛，不说话亦堕欲说话亦堕，拈与胡僧阿耆多。<p>&#13;寺，天竺僧阿耆多尊者道场也。秦大守祠在山右数里。<p>&#13;无题<p>&#13;耨琴耕月两悠悠，行到花前语未收。不是几行春雁过，险吟新句上西搂。<p>&#13;赠赤父<p>&#13;作佛称王梦两酣，前三三与后三三，夜来每启吴钩看，闻道有龙在碧潭。<p>&#13;荷<p>&#13;鱼潜鸟逸水无波，叶茂花添蝶粉多，纵出淤泥犹不染，弋人何处可张罗？<p>&#13;蜻蜓戏荷苞图<p>&#13;好花好到未开前，称意蜻蜓得信先。若了当年西土意，荷叶团团团团团。<p>&#13;鹤立松图<p>&#13;溪桥昨夜话尧年，一唳于皋遍九天。别有栖心言不得，倚松长立不长眠。<p>&#13;赠通超<p>&#13;卸却头巾不问禅，袈裟值得几文钱？有时懒阅案头忏，走到芦花浅水边。<p>&#13;蜻蜓慈藻图<p>&#13;细浪层层慈藻香，蜻蜓无故引风狂。明知墙外花如锦，飞向东邻何氏庄。<p>&#13;西楼小灯<p>&#13;如此风波任意行，夜来何处管弦声？昨宵曾到西楼上，万里河山一线明。<p>&#13;步内水冷生原韵<p>&#13;莫卖龙泉剑，江天尚有情。小行四五步，长啸两三声，出匣寒犹劲，还家念转轻。正宜春信好，草长乱飞莺。<p>&#13;遂宁别诸子<p>&#13;行矣二三子，迢迢路正长。骅骝开道古，岁月逼人忙。趁块来韩犬，接与过楚狂。由来梅有骨，莫厌露为霜。<p>&#13;王溪口舟行经红岩嘴夜抵潼南口号<p>&#13;一苇红岩后，微微夜色升。疏林传暮鼓，渔火接风灯。水落舟行碍，潮平渡幸能。莫愁云黑月，恐是有龙兴。<p>&#13;别潼南诸子<p>&#13;不可别君日，纤怀强赋诗，何堪春冷冷，况对柳丝丝？飞鸟营巢急，归车载道迟。殷勤报桃李，珍重未开时。<p>&#13;广汉杨光代敬辑<p>&#13;中华民国三十二年二月吉日</p><p> </p><p><strong>四、醉后之光</strong><p>&#13;通宽曰：“此剧壬午秋闻于师先生竹君，师先生者，灌之耆宿也。与申价屏、官玉章、贾山人克卿善护国之役，焕师共豪杰啸义北伐，灌县令杨端字在焉识竹君。今兹逾二十九寒暑而先生年七十又三矣！然健壮如丁年。焕师掩关灵岩,特张筵集戚好百余人，自唱《醉后之光》剧，享之潇洒清逸，音绕屋梁，抑扬开合，各尽其韵。彼时听众如醉如醒，如万壑鸣风，如银河泻影，如游钧天，如闻韶，如一切，总如而总不如，益知声教固不后于戒定等行、诗礼等学，抑亦处处杏坛，泗水鹫岭祗园者也！剧为焕师口哦，久乃笔之，藉稗官歌咏，写悲悯远怀，即事即理，滴滴显万法之如，为己为人，处处形君子之大，且初机入德之程，菩萨行化之雅，都于是乎在。通宽窃揭而梓之，意者或有开士闻声契理，得意忘言，讵不休哉？亦枕子落地，鹫飞度天者与？剧曰：<p>&#13;醉后之光<p>&#13;（净扮僧上引）佛座拈花余贝叶，樽前合笑看人头。（坐诗）琴剑埋光易，英雄寂寞难，西风黄叶交乱，等闲吹过十二栏干。（白）俺鲁智深自披剃以来，而春而秋不觉时逾半稔。禅门清寂，实无所谓奇特，亦非别有专长，每日照常啖饭，依旧饮茶，今日秋高气朗，有心出寺，睹睹山景，以消烦闷，还须斜扣单扉，随场游览则可。（宜黄头）（唱）掩单扉，步回廊，金风扑面，（作掩扉起行状），（二黄夺夺板）梵王宫，凝瑞霭，日午当天，（放腔作喜状）（大过板）满庭中寂无人，素兰心淡，（作周顾游赏状）傍危墙，笼松竹，虫鸟无喧。（放白）好清静的禅院呀！（唱）开大步，迈出了天王宝殿，三门外铺遍了锦绣江山，碧澄澄江天高晴空如练，风洒洒过桥西爽道楩楠，近溪头水清浅游鱼出现池塘内。（转，二流）浮睡鸭交颈而眠，望广陌田畴片片，耸高林红叶翩翩，木落惊秋鹰眼乱，猿猴戏树打仗千。行上了山垭越岩畔，衰草如茵石若盘，就盘石放下了身心一片。（白）哦哦！你看你看，（唱）是何人穿山径，担瓮而前？（白）鲁智深便说秋高意远，山水可人，仔细思量，万化如寄。这些时候觅俺的身心道也了不可停。何米贩客送沽，使俺胸中顿生渴想，俺不免踞此盘石，小坐片时，待他到来，饱饮一回，有何不可？正是一回渴饮思吞海，几度心狂欲上天。（指介，白）好呀！你看他酒担儿竟向这来也。凑兴呀凑兴！（末扮隐者荷担上唱，二流）世上人失却了一双眼，贪财贪色肆狂癫，把生死二字全不管，不杀不盗便淫奸。明明白白四大幻，眼睁睁把个事看之不穿，我屠龙人今变作乡村小贩，下苦口要唤醒世上痴顽。（白）俺天涯客髫年鞭笞子史，壮岁奔走，英雄利锁名缰，早已浮云等视，贤关圣域本来流水而观。每日越陌度阡，贩沽为业，藉以潇洒俺自己襟怀，而且要缁素他世上人的清浊。今日秋高气爽，正好荷担前行。正是（诗）万里河山带笑看，亦无凡圣亦无贤。漫言渴饮思吞海，杖头可有沽酒钱？（唱，二流）一肩儿担负起，风清云淡赤裸裸，任运自天然，谁管他桥长与亭短，谁管他越陌又度阡也？不问少殇合老聃也。不问石崇和范丹，上山垭俺正要迈步前站。（净白）老伯且住，（唱）挡定了老伯驾，权请息肩。（末）问阇黎因何故把俺阻绊？（净）就盘石愿与你倾盖谈玄。（末笑背介）这阇黎他也知个事一件，（净）论个事，水在清潭云在天，（末）既如此俺与你放下重担，（净白）好（唱）你班荆我踞石，气象万千。（齐白）老伯，（末）阇黎（净以手指担介）个中所蕴何物？（末指介）你问的是他，（净）然也。（末）阇黎可解密语，（净）老伯请讲，我学人愿来猜上一猜。（末）如此请听。（净作点头介白）好！（末诗）也非大道也非泉，一吸争夸斗十千。不为东山无贺老，等闭谁肯掉回船。（净）哦，哈哈哈！好酒呀好酒。酒酒酒，好朋友，老伯（末）阇黎，（净）老檀越，（末）大和尚，（净）想昔年祗陀太子与给孤独长者一施林园，一舍金帛，他二人至心供养如来，从古许为奇缘，而今艳称佳话。老伯老檀越，哈哈哈！（末）闺黎怎见？（净）自昔有言，万行门中檀施为尚，君子接物，不拂人怀，贫僧自出世以来，别无嗜好，独爱此一杯黄浆，哈哈哈，老伯！（末）阇黎！（净）可舍这两瓮清酒与贫僧消消胸中渴闷。（末）这个！（净）哪个？（末）这（背介）天涯客自叹，俺看这个师僧道也有些气息，道也有些来由，想俺走遍天涯未逢作家，不免藉此两瓮清酒，设个机关，他若解之得开，转得过，那末便是钓尽千江，获得巨鳞，俺便舍两瓮黄汤，供他饱饮一顿。他若解之不开，转不过，俺便一肩儿风轻云淡，迈向前村去也，就这样，待俺上前。阇黎！（净）老伯！（末）阇黎要此两瓮黄浆，道也无妨，但是老汉还有请教之处，你若认识的清，解答的确，我便尽量施你饱饮一场。（净）若认之不清，答之不确呢？（末）那么老汉，便一肩儿迈向前村去也。（净）如此老伯，就请！（末）好。（过场）（末油出短刀横架瓮上，怒气叉腰，一足踏瓮，一足立地介白，连连单捶）请请，（净熟视状背介）鲁智深便说俺观此老，真实内蕴，精华外发，翩翩如云中鹤，冉冉似尘外仙。袖出腰刀，横压酒瓮之上，一足踏地，两手叉腰，怒气汹汹，俨若天神。声声叫俺答话，口口叫俺答言，哼哼！你这勾当道也瞒俺不得，骗俺不了，待俺上前，自有理会。老伯，（末）阇黎（净）你看后面何物？（末）在哪里，（净）在这里，你去（将末踢仆执刀启瓮见酒笑介）好酒！好酒！哈哈哈！（唱，三板）起一腿将此老仆之在地，就腰刀劈开了两瓮卦皮，抱酒瓮似渴鲸无忌。（浪子作饮状介唱）那管他玉山颓，醉倒如泥。（齐作带醉状末暗起熟视白）好爽朗的和尚！哈哈哈，（唱）这师僧皮肉下有些血气，他也知年迈人袖里藏机，你看他似渴虹，全无回避，一霎时两瓮酒点滴无遗。（白）天涯客便说，这个师僧道也可人，想俺踏遍江湖，今日始逢作家，不可轻易放过，待俺上前再为深深拶他一下。阇黎（净作醉应介）老老伯！（末）和尚，（净）老老檀越！（末）两瓮清酒可当意？（净）道道道还当意。（末）饮可开怀？（净）道道道也开怀。（末）如此还来？（净）还什么来？（末）还我未饮以前的酒赀来！！！（净）是是是，老伯你要酒赀吗？请请请近身来，贫僧与你给给酒赀。（末作起身起足，将净仆地，介白）去！（作急行状）正是一拳拳倒黄鹤楼，一脚脚翻鹦鹉洲。得意气时添意气，不风流处也风流。（荷担下，净起醉白）好酒泥？（作四顾状）老伯檀越哪里去了，四顾无人不知老伯向何方而去？（作惊喜状，白）明白了，哦！哈！哈！这下俺明白了。唉！踏破铁鞋寻不着，得来全不费功夫。（净作大喜介白）哈哈哈！明白了，正是八个磨盘空里走，金毛狮子变作狗。意欲将身北斗藏，还须合掌南辰后，（净笑）哦！哈哈哈！日已西斜，回寺去者。<p>&#13;（内堂布景净作介唱，二流）赤条条来去无牵挂，一任他醉染枫丹，落日斜过疏林，秋风来四野。牧童儿横牛吹笛向谁家，渔翁执钓江边撒。又只见农夫樵子，他们一个一个负荷过山址，猛抬头不觉得三门近也，（白）你看那铜兽衔骄栊门紧闭，俺又如何得进呢？哦！有了，不免排闼而入。（作椎门状唱原腔）进三门先拜过四大菩萨，（作醉抖状白）菩萨俺在与你顶礼了，（作欲呕状）哈哈哈！（唱）这一个手持着黄伞一把，这一个怀中抱琵琶，这一个拔剑砍地下，这一个怒目又獠牙，哼哈将竖起拳，欲将谁打？（放白）俺在与你讲札，你举起拳头打谁？莫非要打俺吗？噫！俺良言相劝，你做起那个样儿，还不伏气吗？可恼嗳可恼！（唱）清平世岂容你撒野放夸，我在说你还在佯装做假？挺双眸，你胆敢怒眼瞧咱，气冲冲把你的头颅扭下也，免你逞骄傲，有我无他。（过场作扭打状，指四天王介）细思这四个也不成话，静悄悄在一旁片言不发，明明是大骗局，六个一把，或是喜或是怒，射影含沙，眼睁睁一切事无碍无挂，平白地起风波，把人醉麻，越思越想越气，大奋老拳，送你等肝脑涂沙，（作打过场唱）一霎时皮面碎，现出草把，天王殿遍地尽泥渣，越看越想越异诧，（指介）正当中还有个弥勒菩萨，无端开口在笑杀，惹得人说七又道八，把几句唯心唯识滥套话，骗尽了痴儿痴女走天涯，我不打你还说我在把你怕，这一拳俺便要连根而拔，（打介）香泥腐草委一坝，以免他世上人见了眼花，罢罢！这便是慈航普渡观世音，任人说俺的胆儿天来大。（齐白）鲁智深便说，适才带醉蹄来，则见一群强盗，喜的在喜，怒的在怒，或持刀剑，或带拳头，一时恼了俺的情性，举起拳头一阵好打好打，只打得飞尘蔽天，落英满地，哈哈哈！（作呕介）这些时候俺的心中道也潇洒，道也快活。（作吐状）身体闷倦，不免在此佛坛假寐片时，正是千山月酿枫林醉，一枕秋饶桂院凉。呵呵呵呵！（作眠状。副扮堂王，丑扮知客同上。副末）云来龙听法，（丑）客去鸟啼花，（副）俺堂主，（丑）俺知客，（副）师弟，（丑）师兄（副）二人寮房习静，（丑）耳听剥啄声腾，（副）不知是何情境，（丑）一同出外看明，（副）如此师弟请，（丑）师兄请，（课课子，副末）在寮房听了一阵，三门内响动非轻。（丑）一同去察看是甚？师兄不好了，（副）什么事？（丑）你看天王殿，破碎纷纷。（副）呵唷！了不得了！哼哈将头卢打损，四天王一个无存。（丑呀）弥勒佛当中不见影，师兄你看这不是他干的吗？佛坛酣睡鲁智深。（副指介）这贼秃生性轻神圣，他使酒撒疯，专好凌人，（丑）师兄！（副）怎见？（丑）趁睡着拿绳将他捆。（副）好（丑）不妥。他力大恐伤你我二人，（副）不错，到不如白众动公忿，和尚升座以理评。（丑）好！依法理总不仅打他一顿。师兄，咦，只怕要活迁化这个畜生，（副）既如此，主意要拿稳。（丑）对，就动手，说干就干。（副）你撞钟，我击鼓，雷厉风行。（齐同下内钟鼓开鸣，大喊）和尚升座，传鲁智深！（净作惊起介白）来了！来了！（唱三板）不知是何人击法鼓？（内白）传鲁智深！（净白）来了！（唱）惊醒了俺南柯梦觉（内喊）传鲁智深！（净白）来了！（唱）莫不是念诵有错？（白咦）不是！（唱）莫不是诸方来参学？（净白）唔！越发不是。（内喊）传鲁智深！（净白）来了，（唱）醉朦胧睁开眼，四下瞻顾，（净作惊状白）这下俺明白了。（唱）瞥见了天王殿，破碎满屋，一定是众秃丁来拿我过。白椎集众，要把俺逐，赤裸裸一片心，有谁识破？少时刻，听和尚亲口发落，毕竟是我错，他的错？都付与明眼人仔细摸索。迈开我英雄步，何须避躲，有谁知六六原来三十六？（齐白）鲁智深便说，耳听法鼓惊鸣、警钟频报，想必和尚升座，待俺上堂领话，（正是）不堪风唳鹤，况对月眠龙？（内喊）传鲁智深！（净）来了！（作醉状）哈哈哈哈！醉了醉了。<p>&#13;峨眉大坪寺释通远敬辑大中华民国三十二年冬月吉日</p><p> </p><p><strong>五、灵岩访问记</strong><p>&#13;常闻之怀瑾、通宽、光代等曰：师掩关灵岩时，诸德讶之。或函侯，或亲存，或便值，或以介而来访者实繁。有徒笔谈口答，一仪一形，无不煌煌显示第一义谛，谆谆诱掖初机进程。剑秋行薄，未能躬与斯盛，躬味斯法，而要与承法诸君子常通音讯，因搜录当时函访言章，久之成帙，今仅揭其面询语，余不入者，盖同人另有专编，故不赘也。是帙断自焕师掩关时，颜曰《灵岩访问记》。记曰：<p>&#13;朱先生叔痴者，蜀之巴县人也，年七十三，避暑灵岩，谒师，见僧手绾珠，口喃喃念持佛号，因曰：某在五台以净宗叩某法师曰：“是宗者小乘法耳，非究竟，如何？”某法师以手约之，私谓叔痴曰：“是是，慎毋泄，否则浅人知摄机不普也。”举未卒，先生色然曰：“嘻！是何言欤？华严海众犹归净土，文殊大智不舍极乐；龙树妙阐入德之程，远公创结莲社之雅，是大是小，是究竟是非究竟？道来道来。”当众无语，久之，乃曰：“个中自无青白眼，枉在人前羡阮公。”朱应喏诺退。是夜再参，先生送客及门，朱坐门侧小磴，先生握朱手曰：“三爷夜深坐几何邪？”朱曰：“渴思再见先生，及门闻客在，故待之，然已逾二钟也。”先生矍然邀入室，多所发药。临去以《中庸》一册手度于朱曰：“但看此，三日后当再会，日内不烦大驾也。”朱行。<p>&#13;越三日，先生预往东岳庙之后殿，以侍者速朱至，乃下阶逆躬。扶至殿，笑而诘曰：“三爷《中庸》之义可得闻乎？”朱语：“至其为物不二，则其生物不测处津津焉，甚可味也。”先生忿然曰：“呸！”朱罔知所措，侍者曰：“朱先生何不速呸？”朱亦连呸数呸，先生曰：“止止！”久之乃曰：“是什么？”朱忽释然伏地三拜曰：“何期晚年得闻这个？”先生曰：“这个是什么？”朱大笑。朱先生者国之老宿也，嗜道学佛，高逾时彦。初来山拟暑稍却，当往成都，听某法师讲《菩萨戒经》。至是命除庭馆，思久住。常谓人曰：“是法真有因缘呵！余壮客上海，相者曰：‘晚岁当闻至道。’固惑之，今果尔尔，亦可追也。”无何，陪都开国防参议会，朱之属以车来迓，不肯行，曾子玉、王子骞促之不可，先生闻往而谓曰：“三爷，昔黄龙南斥舜老夫曰：何不有事令无事，无事令有事，所谓净佛国土，成就众生者也。”朱大惊曰：“诺诺！明日行。”翌日，朱来辞，致三拜，先生亦答三拜曰：“蒲卢诘意，萨婆诃。”三称。<p>&#13;先生同傅先生初来山，曾先生子玉、李先生子方等，会先生室中肆谈勘辩，先生曰：“个事现成，何须语去言来，乃辨泾渭？但观行动，缁素判也。”傅先生曰：“噫！果邪。然则观何行动？”先生曰：“走路。”傅先生曰：“开悟人走路如何？”先生上前三步，回座。傅先生曰：“未开悟人如何走路？”先生亦上前三步回座。李先生子方兄见而翻然逸去。先生曰：“勘破也，勘破也。”因顾众而指李曰：“他足根来点地在。”问者曰：“如何是李先生足根未点地处？”先生曰：“汝去问他。”翌日问者曰：“先生昨日勘破李先生是许他，是不许他，是半许或半不许他？”先生曰：“是许他，是不许他，是半许是半不许他。”问：“如何是许他？”先生曰：“他名李子方。”问：“如何是半不计他？”先生曰：“他名李子方。”问：“如何是半许半不许他？”先生曰：“他名李子方。”<p>&#13;灵岩行七就座，李先生子方者出而大哭曰：“苍天！苍天！”先生曰：“咄！汝干饭吃多了邪？幸我无侍者，若有把汝活埋。”李无语，逾时，先生问众曰：“只如上语，汝等当如何答？”渠或曰：“请他再哭一场。”李乃大笑。先生曰：“丑丑！诸人有捡点得出么？”众无语。先生曰：“好好用功。”<p>&#13;王子赛来山，与先生、傅先生会于曾子玉处。王与曾同问曰：“如何是佛？”先生顾视久之，乃还问曰：“汝试道一句看？”曾、王两先生齐声曰：“心即是佛。”<p>&#13;先生曰：“汝有心否？”皆对曰：“有。”先生曰：“汝是佛否？”皆趑趄不语。先生曰：“何不道心即是佛？”皆复无语。傅先生大笑。先生曰：“会么？”皆云：“不会？”先生曰：“心即是佛。”<p>&#13;申旅长介屏者，先生敬友也。来山问曰：某七十之年忽焉将至，而四大不牢，生死未了，如何？”先生大声曰：“嘻！是何言哉！是何言哉！”申惘然，先生目视申者久之，曰：“会么？”申曰：“不会？”先生曰：“且付河山鞍辔外，一鞭红照出风前。”申复无语。先生又曰：“会么？”申云：“不会。”乃曰：“兄但行时、住时、坐时、卧时，乃至朋友交际、妻儿子女会合等时，切切实实持佛号，而不必外觅神仙，内计丹道，一朝报尽，自然往生彼上。生彼土已，生也死也不必问人，自然如观掌果也。”申闻踊跃叹称希有。<p>&#13;甘厅长典夔偕其夫人及邑人陈耀鱼来山。饭后品茗，因请益。夫人固治净宗，甘曰：“佛与道同邪异邪？”先生曰：“非异非同。”甘曰：“愿乐欲闻？”先生曰：“佛道皆一心之显，故曰非异。然道不是佛，佛不是道，故曰非同。”甘曰：“佛不言神凝气府、五气朝元、三花聚顶，乃至炼精化气、炼气化神、炼神还虚等，今曰非异，无乃非欤？”先生曰：“唯唯，否否。”不然，乃问其夫人曰：“‘汝念佛否？”对曰：“念。”先生曰：“汝得神凝气府、五气朝元、三花聚顶，乃至炼精化气、炼气化种、炼神还虚否？”对曰：“未得。”语未卒，甘曰：“佛法中正高深，余乘尚不及此，况净宗邪？先生此语非戏即幽，尚祈明示。”先生曰：“语实非戏，义亦不幽，何也？若必谓彼不是是，舍则多一法也，何云佛法？若必谓彼是是，取则少一法也，何云佛法？须知我法了无是非，何有增减？况诸法无常，皆依假立，三藏十二分教，悉属黄叶止啼，概为应病权药，要在当人明自心，见自本性耳。苟明得自心，见得本性，解幻巫蛊，皆为胜法；若不尔者，三藏十二允为魔说。”语已，以手拈须，寂然饮茗。当众渴欲闻义，先生不答。<p>&#13;甘夫人乃起问曰：“云何说云五气朝元、三花聚顶、神凝气府及炼神还虚等为治净宗者得有？”先生曰：“金木水火土五行，安立在身，则心肝脾肺肾也，五气者五行之气，即心肝脾肺肾之气也。当人手绾念珠，口持佛号，到一念不生时，脊梁自竖。脊梁既竖，心不外驰，则此心肝脾肺肾者各得其位，互不相损，既不互损，其气自舒，执此舒气以示人曰朝元。无者始也，又心也，心本无心，因此一始而心乃心。若然心即朝，朝即心，心与朝不二，然又不一，而朝无之义，悉尽乎斯矣。当人届此，身得胜乐，全体如满溢状，而脐下小腹丹田处较甚，曰神凝气府；头顶似有风状，内触妙乐，曰三花聚顶。三花者，精气神也。顶以当人身相言，曰头顶。就当人心相说曰法身，盖谓一心不异，胜行自起，则顶踵一如，诠名曰聚顶也。又至也，谓聚此而至矣；炼精化气者，一心不异，自然法我两忘，法我既亡，阴阳自配,天地配而生万物，夫妇配而生男女，自身阴阳配而生精，自然之运，法尔知是也。所谓炼者讵有他哉？直是故耳！充此精而沛全身，令得妙乐，今抗外邪，令运奔伸屈时。然而当者气也，既有精生，即有气行，亦自然之运，法尔如是。所谓炼者，讵有他哉？亦直是故耳。<p>&#13;“然精与气皆有形有质，可意可度，而行此精与气者，觅之无物，着之无形，意且不得，度形又讵能居？谓果无邪？然则运行此精此气者，何物邪？谓果有邪？视之不可见，扪之不可得，听之不可闻，意之不可及，统如上说，无以名之，假名曰神。神也者，别乎用而言也。既有此精此气，即有主持此精此气之神。神，用也，亦犹有物必有用，无用不成物也。所谓炼者，亦直是故耳，讵有他哉？炼种还虚者，谓此精此气此神本无一物。一时缘会假现，缘灭即亡，实无实法，何有还处？若有处还，宁曰虚邪？当人念持佛号，到无念而念，念而无念时，忽然认识自己，了彻本心，方知由来成佛，身住净土亦已久也。曰西曰东不亦远乎？届此然后自捡，精也是他，气也是他，神也是他，所谓三花聚顶，五气朝元，风云雷雨，山河大地，人我是非，一切一切，已举未举，无不是他而又丝毫迹相不留，半星朕兆不寓，然又不住在是他不是他里，即孟子所谓大丈夫也。然后才可以说大话，说小话，常说话，常不说话，如理而说，如实而说，非理而说，如妄而说，不然且慢开口，何以故？阎王老子在汝背后，不许乱统。”先生说是话已，咸惊希有，陈先生跃鱼曰：“不图佛法如是高妙！”先生曰：“否否！生来淡泊，一切现成，慎莫错认。”<p>&#13;先生之夫人袁王相君师母，偕其女公子淑平并外甥曹仁刚及王外老大太来山问存。甫见面，师母曰：“我道是袁佛爷还是袁先生？”先生曰：“汝只认得袁先生，且认不得袁佛爷。”进云：“如何是袁佛爷？”先生曰：“闭关的。”问：“如何是袁先生？”先生曰：“汝的丈夫！”一众大笑。师母曰：“这老汉信口乱统。”<p>&#13;女公子淑平跪而问曰：“爹爹在此成佛否？”先生曰：“我无如是不懂事。”问：“既不成佛，如此寂寥，如此清苦都不避忌，为的什么？”先生曰：“为的学佛。”问：“既不成佛，学他为何？”先生日：“汝去汝去，好好读书。”淑平曰：“噫嘻。”<p>&#13;先生之甥曹仁刚问曰：“大人住山学佛，甥以年以境皆不能住山，即在市城百务繁多，日不暇给，总此过患亦能学佛否邪？”先生曰：“能。”进曰：“如何是甥学的佛法？”先生曰：“入则孝，出则弟，谨而信，泛爱众而亲仁，行有余力则力则以学文。”进云：“这岂不是孔夫子说的？”先生曰：“是。”进云：“若然，孔子已有，大人何必入山自苦如是？”先生曰：“不可山中便无孔夫子也。”<p>&#13;先生岳母王外老大太车七十四矣，康健逾常人，问曰：“我念佛数十年矣，而生死仍无把握，如何？”先生曰：“大人胜行已起，将来报尽，定获往生，现在只好照旧精进，不管他生死不生死，往生不往生，蓦直向前，定有归家稳坐大笑一场的时候。”<p>&#13;师母等住山一日而返，闻来山时于成灌道中，乘一小商车，盈五十余人过板桥，桥折陷车后二轮，乘众大哗，咸谓必死，盖水流湍急，如奔万马也，而车突然自跃上道，于是桥折而车众无恙，群云天助，识者惊为先生神力加被，或闻先生大骂曰：“丑！等我于妖魔邪。”数十日议乃寝。<p>&#13;淑平女公子回成都修破瓦法，顶开，以书来，先生曰：“噫嘻！”<p>&#13;南怀瑾别号玉溪，浙之乐清人，父化度，母氏赵，法名通禅，学密康藏时法名法称，与郭正平同学，为知交。国难来川，郭先时在军抗敌，以病寄迹于蜀之峨眉山大坪寺，法名通宽。时怀瑾充中央军校教职，休假来灵岩寺，与通宽、传西等日夕究参，均以扶起破沙炉自任，固志在俗也。行七之三日，先生手持戒板指谓传西曰：“是什么？是什么？速道！速道！”传西无语。先生摇头数下，自笑曰：“又放走一个。”复以戒板指怀瑾曰：“是什么？是什么？速道！速道！”怀瑾亦无语，先生却点头数下，亦笑曰：“汝却好。”遂手至佛前问曰：“当时我叫汝速道！速道！汝因什么无语？”怀瑾曰：“我当时不知要说个什么？所以无语。”先生曰：“汝现在心中有一个什么否？”怀瑾复无语。先生因令大喝，甫三声，即曰：“止。汝看汝有个什么？”怀瑾曰：“现在觅我心中无有个什么。”先生曰：“此千圣之心灯，当人之慧命也。无再滋疑，速拜！速拜！”怀瑾乃拜，遂禁怀瑾语。一时四众大愕，谓同儿戏。怀瑾自心亦不知所措，乃佯为首肯，仍沉众中。无何各就坐，乃起问曰：“既云学人有个入处，云胡一计生死，便尔前途茫茫？”先生厉声曰：“丑！汝看汝说，生死未了的那个分上是有生死是无生死，是前途茫茫是后路茫茫？”怀瑾彼时当下释然，遂礼拜在地，时参众正瞑坐，怀瑾与传西坐邻，顾视诸人坐禅，真若无疾而呻，无韵而哦，而传西亦正凝神在坐也。因而内心不牧，几次嗤之欲肆，先生乃振威大骂曰：“作么太不懂事！”怀瑾当时被先生一骂，如病得汗，如梦得醒，惊悉个事原来如此不费力，不值钱，于是敛笑，遂尔收神，凝然与同学及传西等寂坐。<p>&#13;越三日，果州道士来山于先生室中闭户围炉夜话，曾王两先生及周杨诸子皆围炉次，怀瑾远隔重楼，睹先生室中人物状态话言如亲觐面，诧之。因请先生至祖殿通所见，先生大骂曰：“我道汝是个人，犹作如是见解邪？”骂毕忿然反室，闭门而寝。怀瑾乃无语归寝。是岁之冬，虚云老人自曹溪来陪都，成都尊宿聚于文殊院，同请昌公老法师与先生躬赴陪都，迎虚老宾省。怀瑾侍先生叩虚云老人，通所见如上语，虚老曰：“嘻！南先生使非袁老居士手急眼快，汝险矣危哉。”至是怀瑾还山，遂辞军校教职，图久住，常谓传西、通宽、光代、白眉等曰：“斯亦奇缘也，倘非国变，何缘入川？倘不入川，这一段提不起放不下的公案，从何处了？仔细思量真是个人汗泪交倾不止。”五月不禀先生，不谋友朋，突然而逸，不知所之。又三月乃闻遁迹于峨眉山之大坪寺，而闭关时生年二十五也，其皈依师曰普明。<p>&#13;释通宽者，浙之永嘉人，素与南怀瑾为同学友。国变起投身军籍，以病祝发于峨眉山大坪寺，从释普明为弟子。壬午来灌县灵岩寺与传西、怀瑾日夕参究。会七起司，击鱼四日，无所入。第五夜手持钢针，胡跪韦驮前，以针自刺臂及两手，泣而讼曰：“通宽不悉往昔所造何种恶业，四恶未报，一性愚顽，今于佛前僧前法前痛悔前非，不造后恶，倘有所入，毕此身心，誓宏大法。”语已臂血、眼泪交落如雨，怀瑾见而悯之，手之令起，而诘曰：“老兄似此区区，欲以何求？”通宽曰：“求佛。”怀瑾曰：“兄是何人？佛是何圣？求是何心？”通宽无语。怀瑾掌之，通宽复无语。于是通禅连掌数掌曰：“青天白日，胡思妄想作么？”通宽因有省，时已四漏，先生与同参众眠已数时矣，乃寝。翌日平明先生甫见，即以手执通宽手，令拜于佛前曰：“速拜！速拜！前途尚有十八滩在。”怀瑾等悉各大惊，咸推先生勘人不让宋之妙喜。无何，先生赴成都，通宽复于灵岩赴李先生子方七会下山，值先生于成都之中城公园，才见，先生以目顾通宽者久之，乃曰：“哪里来魔气与么深？”通宽才欲致语，先生厉声曰：“不是。”通宽拜，先生笑。<p>&#13;杨光代者，蜀之广汉三水关人也，毕业绵阳高中。以病来山作久居计，年二十四。或见而悯之，令念文殊五字真言，杨面从而心违。无何，灵岩行七，或令参学，杨殷勤起而致语曰：“光代病夫，一事未谙，百无所知，何德何能与彼会？”或笑曰：“非然也，是法平等，抑亦何需？若必需者即所谓信也。汝但信一切具足，更莫他驰。”杨应喏喏。行七之三日，自心不牧，动定皆违，乃私逸。及门犬暴至，杨大叱。无何，犬去。返观身心，脱然若释，因告或，或曰：“唯唯。”翌日上堂，通所见于先生，先生曰：“否否！速拜！速拜！”已，因自语曰：“而今而后乃知喜怒哀乐之未发谓之中。中也者无一物也。”先生厉声曰：“何不道发而皆中节谓之和。和也者，有一物也。”杨无语。<p>&#13;七毕，同参诸子侍先生赴省，杨独居山。一夕，阅《憨山年谱》至“通乎昼夜之理则知生死”处大惑，乃于佛殿且行且思，百究莫通其义。倦极，仍不掷念，乃对佛坐，瞑究显研，至百无可己时，忽巨声发佛后，杨大惊。惊已，觅所谓疑情了不可得，乃大笑曰：“哈哈！通乎昼夜之理，固如是也。”于是行吟山间，乐不可抑。或问曰：“见何道理，自乐乃尔？”杨曰，“盆内水仙花。”灵岩二次行七，李子方先生问曰：“前念不生后念不灭时，汝休息不休息？”杨曰：“一物也无，休息个什么？若有休息，则有一物也。”李颔之，杨退。有同参者要而问曰：“汝答上话，诚有入处，然不恰。余怀今请再答一语，能不吝金玉否乎？”杨曰：“善。”同参某举如上，杨应声曰：“休！休！”同参大笑，逸去。又一日，同怀瑾至参堂，抵门怀瑾以掌掀杨在地，曰：“是什么？速道，速道！”杨曰：“你青天白日，遇到鬼了吗？如此胡闹作么？”旋下山见先生。先生曰：“什么处来？”杨无语，即礼拜。先生曰：“不是不是，好好学佛，莫错认贼赃。”杨亦无语，复拜，先生厉声曰：“向汝道不是，礼拜个什么？”杨仍无语，再拜，先生笑。<p>&#13;马白眉者，华阳人也。先谒傅先生求解脱，多所开解，无何，傅先生赴渝，因谓马曰：“余当赴渝，可速往灵岩见袁先生，通余意，渠必能了汝大事，勿忽也。”灵岩七起，乃搁税务局事来山行七，昼夜精勤，至第六日，请益，先生曰：“此事不在用力处，不在不用力处，又不在用力不用力，即用力处。”马惘然，先生乃合眼开眼示之，且曰：“会么？”马曰：“不会！”先生曰：“开眼见明，合眼见暗，明暗自为代谢，能见明见暗者，有移易代谢否乎？”马曰：“无。”先生曰：“此千圣之心灯、四生之慧命，汝之本原也。”马于言下契理，因胡跪致问曰：“此后当用何功？当何保任？当何行履？”先生曰：“好好作事，好好持戒，好好为人。”<p>&#13;南充徐剑秋编辑<p>&#13;大中华民国三十二年冬月吉日</p><p> </p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></div>"
}]