[{
    "title": "二谛义 第1854部",
    "author": "吉藏大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>二谛义 卷上</p><p>补刻二谛章叙</p><p>嘉祥藏大师所撰二谛义章三卷。传流吾国已来。仅一千年奇矣。宠藏之古名蓝之间。而不以广其传者也久矣。向者龙宝与公。偶得上下两通。辄刻木以布海内。譬诸宝鼎之阙一足。不亦恨乎。近有书林某者。幸得古本之全者而来。请余重施国字而传于千岁之下矣。于是两本对捡。则与公之本。非但阙中卷。亦于上卷中。脱二十余纸。况且豕亥凤风比比有之。余慨然喟言。曾闻其名未得其书。如渴者闻梅。然而虽偶得传之。阙而未完全者几许年所。今也幸得见其全书。前之所谓渴云者顿息矣。余既然则人谁不尔乎。今将广行于天下。此举岂辞劳乎。是余之所以忘固陋而不敢辞其请也。而今上下两卷。直用与公之所刻者。不复改雕。其中或文字写误者。或两本相异者。或疑而未决者。或恐此处必脱某字者。则皆标之卷眉。而一处未尝以私意改易之。务在存古耳。于是乎可谓。宝鼎再得为完器也。何其快哉。其既然则安知。章主大师之不熙怡微笑于那伽定中也。又安知。与公之不忻跃于地下也。是为序</p><p>宝永七年岁次庚寅孟春日</p><p>洛西五智山<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>慧旭寂谨书于忘虑亭</p><p>镌二谛章叙</p><p>夫不了二谛。则契实之境。照俗之智。不可融彻。境智不融彻。而入萨波若海者。未有之也。宜哉。诸佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。常依二谛矣。支桑道学之士。亦恢张真俗。垂统于后昆者不少。且夫二谛二十家往复之族。虽各述其所见。关键紧要之处。未尝着工夫。岂非肤立持门户皮相矜影响之谓乎。吉藏上人。间出隋世。而禀朗公之学。灵知难思。无不克擢其髓。遂乃制诸经玄疏。翼赞教乘者。不知其几千万言。就中至如今章辨非有非无而二不二鼠娄栗案苽等。启沃旧师之未了。发特见之明也。如此其可忽。诸噫嘻中世以隆。其学不传。其书将泯。余属日名寺藏中得此之锦本。欣戴捧读不堪雀跃。率加点挍授书林。于时岁次丁丑元禄十年腊月谷日杀青斯竟</p><p>东奥仙台龙宝实养题于洛之陀峰下</p><p>胡吉藏撰</p><p>睿师中论序云。百论治外以闲邪。斯文祛内以流滞。大智释论之渊博。十二门观之精诣。寻斯四论者。真若日月在怀无不朗然鉴彻矣。若通此四论。则<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>可明也。师云。此四论虽复名部不同。统其大归。并为申乎二谛显不二之道。若了于二谛。四论则焕然可领。若于二谛不了。四论则便不明。为是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。须识二谛也。若解二谛。非但四论可明。亦众经皆了。何以知然。故论云。诸佛常依二谛说法。既十方诸佛。常依二谛说法。故众经莫出二谛。众经既不出二谛。二谛若明故众经皆了也。然四论皆有二谛之言。今且依中论文以辨之。论文云。诸佛依二谛为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>说法。一以世俗谛。二第一义谛也。然师临去世之时。登高座付属门人。我出山以来。以二谛为正道。说二谛凡二十余种势。或散或束。或分章段或不分分时。或开为三段。乍作十重。所以为十重者。正为对开善法师二谛义。彼明二谛义有十重。对彼十重故明十重。一一重以辨正之。师唯噵此义有重数。所余诸义。普皆不开。若有重数者。非兴皇者说也。十重者。初则二谛大意。最后二谛同异。今第一明二谛大意也。然师噵二谛义。多依二处。一依大品经。二依中论。今且依中论明二谛义。所以依中论噵二谛者。中论以二谛为宗。若了二谛。中论即便可明。为是义故。依中论说二谛也。中论<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>品云。诸佛依二谛。为众生说法。此语即难解。若为依二谛说法耶。解云。二谛是本。说法是末。二谛是所依。说法是能依。然此语惊耳。非从来所知也。问何以得知诸佛依二谛说法二谛是所依耶。解云出论。不假人解。故云。经有论故义即易解。今依论释之。论四谛品。前释二谛。次释依二谛说法。前释二谛云。世俗谛者。一切诸法性空。而<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>颠倒谓有。于世间是实。名为世谛。诸贤圣真知颠倒性空。于<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>是实。名第一义谛。次云。诸佛依是二谛。为众生说法。此则前释二谛竟。然后明诸佛依是二谛为众生说法。故知。二谛是本。说法是末。二谛是所依。说法是能依。依此二谛。为众生说法也。问从来云诸佛依二谛说法者。为凡说俗。为圣说真。为凡缘说有。为圣缘说空。名为依二谛说法。既云依二谛为众生说法。何得言为凡说有为圣说空为依二谛说法耶。今明。如上有于凡为实名俗谛。空于圣是实名第一义谛。依此二谛。为众生说法也。又且问。诸佛何意依二谛说法耶。解云。欲明十方诸佛所说皆实故。依二谛说法。何者。谛是实义。有于凡实。空于圣实。是二皆实。诸佛依此二实说法。是故诸佛所说皆实也。外道九十六种所说。何意虚假不实。以其不依二谛故。所以虚假不实诸佛依二谛说法故。凡所说法皆实。以诸佛所说皆实故。所以诸佛。依二谛说法也。又问。若为依二谛说法。说法皆实耶。解云。诸贤圣。如实悟诸法性空。如来依彼如实悟而说故。诸佛所说亦实。此则依第一义谛说法是实。世人于瓶衣等是实。诸佛随俗说瓶衣故。所说亦实。如百论云。佛入舍卫城。随俗语故无过。此则依世谛说法是实。依彼二实而说故。诸佛说法皆实也。前云依凡谛说名依世谛说法。依圣谛说名依第一义谛说法。依二谛为众生说法。此语不可失也。今问。依二谛说法。所依于谛。为是得为是失。为亦得亦失。教谛亦作此问。然大师云。于谛是失。教谛是得。何者言于谛失者。有于凡是实有。空于圣是实空。此空有于凡圣各实。是故为失也。言教谛得者。如来诚谛之言。依凡有说有。有不住有。有表不有。依圣无说无。无不住无。无表不无。此则有无二。表非有非无不二。二不二不二二。不二二则是理教。二不二则教理。教理应教。理教表理。理教二不二因缘。是为得也。然教谛如此。虽如此而复未可解。何者。汝依二谛说法。依二谛与说法。皆是教谛不。若皆是教谛。则违论文。论云。诸法性空。世间颠倒谓有为世谛。诸贤圣真知颠倒性空为第一义谛。诸佛依此二谛说法。那忽并是教谛耶。今正此一句。明依二谛说法。所依是于谛说法是教谛也。问所依二谛为得为失者。论自判。论云。诸法性空。世间颠倒谓有。于凡是谛。诸贤圣真知颠倒性空无生。于圣是谛。此则开凡圣二谛异。凡圣虽复不二。不二而二。有凡谛圣谛。凡谛即是失。圣谛即是得。何者。既云诸法性空颠倒谓有。诸贤圣真知颠倒性空。故知。凡谛失圣谛得。何以故。凡谛是颠倒故是失。圣谛是不颠倒故是得。此即开凡谛圣谛倒谛不倒谛也。问若所依二谛有倒不倒者不可解。何者。佛可依不倒说。云何依颠倒为众生说耶。若言二于谛皆不颠倒。则乖论文。论文云。世间颠倒谓有为世谛。诸贤圣真知颠倒性空为第一义谛。依是二谛。为众生说法。故知。依倒不倒说。若顺论文。诸佛菩萨。岂得依颠倒说法耶。进退难解未释云云。问前云所依于二谛有得有失。将不乖师所说耶。师云二于谛是失。今何得判二于谛有得有失耶。解云。汝言于谛并是失。是何处语耶。今明。于谛皆失者。非是所依于谛皆失。乃是禀教成于。此于谛皆失。何者。如来说有为表不有。说无为表不无。说二为表不二。彼闻有作有解。闻无作无解。闻有作有解有。于凡实名俗谛。闻无作无解无。于圣实名第一义谛。此之二谛皆失。问若为失耶。解云。如来说有为表不有。说无为表不无。说二令识不二。举指令得月。而众生闻有住有。闻无住无。守指忘月。住教遗理。岂非是失耶。若尔此则有二种于谛。一者所依于谛。二者迷教于谛。所依于谛。有得有失。迷教于谛。二皆是失。所依于谛是本。迷教于谛是末。所依于谛是本者。且约释迦一化为论。释迦未出之前已有此二于谛。释迦依此二谛为众生说法。何者。诸佛说法无不依二谛。故发趾即依二谛而说。当知。所依于谛是本也。迷教于谛是末者。众生禀如来有无二谛教。作有无解成于故。此于谛在后也。又有三异。谓前后能所通别。从后释之。言通别者。所依于谛则通。迷教于谛则别。所依于谛通者。世间颠倒谓有。于世间是实为世谛。诸贤圣真知颠倒性空为第一义谛。此之二谛通一切凡圣。如<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>经云文殊问云。世谛之中有第一义不。第一义中有世谛不。如其有者。即是一谛。如其无者。将非如来虚妄说耶。佛答云。世谛即第一义谛。随众生故分别说二。世人知者名世谛。出世圣人知者名第一义谛。此即世出世两人判于二谛。中论文正尔。世间颠倒谓有为世谛。此诸贤圣。真知颠倒性空为第一义谛。故此二于谛通也。言迷教于谛别者。如来说有无二谛。为表不二之道。有方便者。闻二悟不二。识理悟教名教谛。无方便者。闻二住二。不识理迷教名于谛。于谛但是无方便者。所以是别也。言能所者。所依于谛则是能化。迷教于谛则是所化。此一往偏约第一义谛边说耳。何者。论云诸贤圣真知颠倒性空故是能化。此如涅槃经。经云。一切世谛。若于如来是第一义谛。只世谛于如来是第一义故。此第一义谛是能化。论正尔。凡夫颠倒谓有。诸贤圣唯知此颠倒性空不生不灭。于圣人是第一义谛。若尔当知。此第一义谛是能化谛也。迷教于谛是所化者。禀教成于。虽复是圣。终是禀教。以禀教故是所化也。言前后者。与本末不异。所依于谛是本是前。迷教于谛是末是后。发趾依于谛说。然后众生禀教。有方便悟理成教谛。无方便不识理成于谛。故前后为异也。次更简一句。前云诸贤圣真知颠倒性空。于圣人名第一义谛。如涅槃经。一切世谛。若于如来是第一义谛。问既云一切世谛于如来是第一义谛者。亦得言一切第一义谛若于凡夫是世谛不。解云。如此只出论文。论云。世谛者一切法性空。而世间颠倒谓有。于世人为实。名之为谛。解世谛。前举一切法性空以释之。明一切法性空。世间颠倒谓有。于世人是实名为谛。当知。一切第一义谛。于凡是世谛也。如大品云。诸法无所有如是有。如是有无所有。如是有于圣人无所有。即世谛为第一义谛。无所有于凡如是有。第一义谛为世谛也。问何意开凡圣二谛耶。解云。今开凡圣得失二谛者。示圣得凡失令转悟。明此是凡谛此是圣谛此是倒谛此是不倒谛。示是凡圣。令舍凡学圣弃倒从不倒。为是义故开凡圣得失二谛也。何以知然。具出经论。大经云。欲令众生深识第一义谛。是故如来宣说世谛。众生若不因世谛悟第一义谛。如来终不说于世谛。说世谛令识第一义谛也。又中论若不依俗谛不得第一义。不得第一义则不得涅槃。说世谛令得说第一义。说第一义令得涅槃。故开二谛也。又大品云。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。为大事故起。所谓示是道是非道。非道即是倒。是道即非倒。示是道是非道。令举非道从道。亦示倒示不倒。令举倒从不倒。为是义故。开二谛示得失。令改悟也。然二谛大判有三节。一者凡圣就倒不倒判二谛。二者就圣中自判二谛。三者就凡中自判二谛。就凡圣判二谛者。凡所解为世谛。圣所解为第一义谛。此判凡圣者。就知性空不知性空判凡圣。未知性空为凡。若知性空为圣人。就此判二谛也。就圣中自判二谛者。圣人了有是空有空是有空。此之二谛。皆是圣二谛也。何者。如四谛者。苦集灭道皆名圣谛。二谛亦尔。真俗两种。皆是圣谛也。问何处作此说耶。解云。如般若四摄品末所明。自有时情转千开。有时须文义明据。今宜须文义分明也。彼文云。凡夫若知世谛。应是须陀洹乃至于佛。若尔凡夫不知世谛第一义谛。唯是圣人知此二谛。故此二谛皆是圣谛也。大判如此。就圣中复有无量种。如大经云。我一时与<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>在耆阇崛山。共论世谛。五百声闻不觉不知。何况甚深第一义谛。约此而论。二乘不知二谛。唯菩萨知于二谛也。此则从来义坏。何者从来云。三乘皆会<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。并解二谛。圣则真解二谛。贤则似解二谛。小乘七方便。大乘三十心相似解。小乘苦忍以上。大乘初地已上。真解二谛。解世谛通缘似理。解真谛四绝百非。三乘并解二谛。若是涅槃经。明五百声闻不知二谛。尚不知世谛。况甚深第一义谛。故从来义不成也。今时得有此义。何者。二乘生灭断常心。不行中道。不见<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。中道是本。既不识本。岂能知末。既不见理。岂能识教。何者。彼有不得无。无不得有。有不能无用。无不能有用。二不能不二用。不二不能二用。横竖皆碍。若是菩萨。有为空用。空为有用。二为不二用。不二为二用。横竖无碍故也。就凡中自判二谛者。一切皆是。只从来所释二谛是也。彼云。三假七实为世谛。四绝百非为第一义谛。三假不得四绝。四绝不得三假。亡不得有。有不得亡。绝不得不绝。不绝不得绝。如此二谛。皆是凡夫二谛也。何以知尔。大经云众生起见凡有二种。一者常见二者断见。具有有无断常二见也。又有于凡实为谛。亦空于凡实为谛。实有此空故空为谛。所以凡亦有二谛也。此则皆开三种二谛。从来人二谛。任运堕凡夫二谛中。何者。我有三种二谛。一凡圣判二谛。二就圣中自判二谛。三就凡中判二谛。凡二谛者。三假为凡俗谛。四绝为凡真谛。汝义若为耶。汝义三假是俗谛。四绝是真谛。自堕我凡二谛中。非故安处也。如一家理内外义。汝作义自落我理外中也。论文云诸佛依二谛为众生说法。前来略释依二谛竟。次释依二谛为众生说法。问既云依二谛说法。为何人说何物法耶。诸人领大师语云。为凡说有法。为圣说空法。为凡圣两人说空有二法。名依二谛说法。问师有此语不。答然师实有此语。但用此语有处。人唯得此语不解此意。何者。为凡说有。为圣说空。名依二谛为众生说法。此成何物语。诸佛依二谛为众生说法。何得言为凡说有为圣说空。名诸佛依二谛为众生说法耶。又且岂依凡说有还为凡说有。依圣说空还为圣说空耶。论文云。诸贤圣真知颠倒性空。既知诸法本性空。云何更为说空耶。今所明者如论释。论云诸佛依二谛为众生说法。亲噵依二谛为众生说法。何时噵为圣说法耶。为凡夫众生说法。不为圣人说法也。问此就何义判为众生说二谛耶。解云。此就迷悟能所。判为说不为说。明众生迷有无未悟有无故。为众生说有说无。明此是有此是无此是凡此是圣此是倒此是非倒。令众生从有入无舍凡取圣。为此义故说二谛。若是圣人已悟。何须为说。以凡未悟故。须为说二谛。凡未悟故禀教。圣已悟故不禀教也。言能所者。一切世谛。若于如来皆是第一义谛。既于如来是第一义谛故是能化。岂能化为能化说法耶。一切第一义谛。若于众生则是世谛。以众生是所化所以。须为众生说法也。次将中论观法品及大论释<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>品二处文。释成此义。中论观法品云。诸佛或说我。或说于<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。诸法实相中。无我无非我。长行中释。为凡夫说我说无我。又为得道圣人说我说无我。我无我即是二谛。故大论初品云。人等世谛故有。第一义谛即无。当知。我是世谛。无我是第一义谛。既为凡说我无我。为圣说我无我。则为凡说二谛。为圣说二谛也。大论释往生品云。问云。前习应品。明无菩萨则无去来。今何故说有菩萨有去来耶。释云。不相违。为凡说无去来。为圣说有去来。为圣说无去来。为凡说有去来。然去来无去来还是二谛。则为凡说二谛。为圣说二谛。大意与中论同也。然师复明为凡说有为圣说空为凡圣说空有。此都三节说二谛义。前为凡夫说二谛。不为圣人说二谛。亦就迷悟能所判如前也。次释法品。问法品何意为凡说二谛。为圣说二谛耶。解云。为凡说我无我。如前为凡说有无令转悟不有无。我无我亦尔。众生迷我无我。为其说我说无我。令离我无我。离我即离常。离无我即离断。令其离断常悟中道故。为凡说我无我也。为圣人说我无我者。圣人解我无我。是故为圣人说我无我。前为凡说我无我。凡迷我无我。为圣人说我无我。非是圣迷我无我故为说我无我。但圣人闻我无我。即解我无我故。为说我无我。大论引天问经中说。罗汉最后边身能说我无我不。解云。能说故圣人解我无我也。又云。如军防密号唯防人解余不解。说我无我。唯圣人解。余人不解。以圣人能解我无我故。为圣人说我无我也。中论既然。往生品类尔可知也。问凡夫迷我无我。为凡说我无我。令悟我无我。可有益。圣人解我无我。为圣人说何益耶。解云。此不就利益为说。直明凡不解我无我圣解我无我。以圣解我无我故。为圣说我无我。此为益凡。利他不自利。如阿难称我闻。为益众生也。次大师云。为凡说有为圣说空者。此之凡圣是所<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>。禀教凡圣。有于凡实。为凡说有令悟不有。空于圣实。为圣说空令悟不空。令凡圣说有无悟不有无。亦令凡悟不凡。令圣悟不圣。不凡不圣中道<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。故云。非凡夫行。非贤圣行。是菩萨行也。又为凡说有为圣说空者。明随凡说有随圣说无如一色。于凡有于圣无。随凡说色有。随圣说色无。色未曾有无也。此正为对由来人义。彼云。三假为世谛理。四亡为真谛理。有二谛道理。今明。随凡说有。随圣说无。乃是随凡随圣说有无。何处有二谛道理耶。为是义故。云为凡圣说有无也。此则释为众生竟。次释说法。然说法凡有三种。或具说二谛。或但说第一义谛不说世谛。或但说世谛不说第一义谛。此三种并出经论。大智论释往生品云。问曰。前习应品。明菩萨习应波若。不见菩萨。不见波若。无菩萨无波若。今何意复说有菩萨往生来生耶。答曰。前明无菩萨无波若者。就第一义谛门说波若。今说菩萨往生者。就世谛门说波若。此就二谛说波若也。又涅槃经云。善男子莫入甚深空定。何以故。大众钝故。当以世谛而解说之。此亦就二谛说涅槃不闻闻义。前云莫入甚深空定大众钝故。即是就第一义谛门说。当以世谛而解说之。此即是就世谛门说也。大智论云欲说第一义悉檀故。说波若波罗蜜经。此即但说第一义谛。又大经云与弥勒共论世谛五百声闻不觉不知。此。即但说世谛。虽复三种不同。如来所说。不出二谛也。问何意如来说法不出二谛耶。解云。二谛即是四悉檀。三悉檀即是世谛。第一义悉檀即是第一义谛。四悉檀摄十二部经。摄八万四千法藏。摄法既尽。二谛摄法亦尽。此就不尽尽明义也。以二谛摄法尽故。如来就二谛说法也。问曰。二谛与四悉檀摄法皆尽。何意诸佛依二谛说法。不依四悉檀说耶。解云。通皆得。既依二谛说。亦依四悉檀说。别即不例何者此有义。欲明诸佛所说皆实。金刚波若云。如来是真语者实语者。是故依二谛说。四悉檀名。不的主实。是故不依四悉檀说也。问不依四悉檀说法。用四悉檀何为。解云。二谛是所依。依二谛说四悉檀法。此亦两种。各取一义明。实而说义名四悉檀。说而实义称二谛。此即依于二谛。方便属缘不同。是故有四种悉檀也。问若为依二谛说四悉檀耶。解云。依第一义谛说第一义悉檀。依世谛说三悉檀。依第一义谛说。合而不开。依世谛说。开而不合。以依第一义谛还说第一义悉檀故。合而不开。依世谛说三悉檀故。开而不合也。问何意依第一义谛合而不开。依世谛开而不合耶。解云。既有二谛。那匆并合开。真俗因缘。开合因缘也。问等是二谛因缘。何故第一义谛合而不开。世谛开而不合耶。解云。世谛是空有。第一义谛是有空。第一义谛。差别无差别。世谛无差别差别。第一义谛二不二。世谛不二二。为是故。世谛开而不合。第一义谛合而不开也</p><p>问依第一义谛说第一义悉檀者。诸贤圣真知诸法性空。还依彼所悟性空。而说诸法本来无生寂灭。此可解。若为依一世谛说三悉檀耶。解云。三悉檀并依世谛故说。瓶衣车乘等法。于世间为实。名之为世谛。依世谛说世界悉檀。如说轮轴辐辋和合为车。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>和合为人。如此说者。即世界悉檀。故大论云。人等世界故有。第一义即无。此即依世谛说世界悉檀也。依世谛说对治悉檀者。众生略有三毒之病。广即八万四千尘劳之病。有三法药八万四千波罗蜜。对治此病。名对治悉檀。何故名对治。以药拨病。以药治病。名对治悉檀。如此药病相治。即依世谛说对治悉檀。故论云。对治故有。实性即无。当知。是依世谛说对治悉檀也。依世谛说各各为人者。前明三法药八万四千波罗密。治三毒八万四千尘劳。即明一切法尽。更何所论耶。解云。于各各为人中。更榄之。何故诸<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>中。或说我或说无我。适说常。斯须说<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。何故或说是舍那或说是释迦。或说净或说不净。何故前后更相违反耶。是故次明各各为人悉檀。昔为邪常故说无常。明诸佛缘觉尚舍无常身。今为三修封执故说常。昔为钝根故说三。今为着三故说一。为大根缘故说是舍那。为小乘人故说是释迦。如此等并是为缘不同。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违也。此即依世谛说三悉檀也。依第一义谛说第一义悉檀者。卷前三种。明不生不灭不动不倚。何处有人有车有药有病有人有法有常有无常有三有一。如是毕竟清净名第一义悉檀。为是义故。云依二谛说四悉檀法也。此即依二谛说四悉檀法竟。今次明依二谛就二谛门说法。然四悉檀唯是二谛。但合离为异。离二谛为四悉檀。合四悉檀为二谛。四悉檀实义名二谛。二谛究竟义名四悉檀。就二谛门说法者。大有三意。一者说世谛说第一义谛。令众生悟第一义谛。二者说二谛令离有无二见。三者说有无令悟非有非无。说二悟不二也。说二谛令悟第一义谛者。如最初所辨。世间颠倒谓诸法有。于世间是实。名之为谛。诸贤圣真知颠倒性空。于圣人是实。名之为谛。此则开凡圣得失二谛。令众生悟第一义谛。明凡夫世人颠倒谓有。圣人真知颠倒性空。令舍有入空改凡悟圣举失从得。众生改凡成圣者。悟第一义故也。若不悟第一义谛。则不能改凡成圣舍失从得。良由悟第一义谛。乃能改凡成圣舍失从得。为是义故。开真俗凡圣得失二谛。令悟第一义谛也。说二谛令离有无二见者。故大品经云。菩萨住二谛。为众生说法。论释云。为著有见众生。说第一义谛。为着无见众生故说世谛。为著有无二见众生故。菩萨住二谛说法也。肇师论亦尔。借有以出无。借无以出有。借有以出无。住世谛破无见。借无以出有。住第一义破有见。故说二谛破二见也。说二谛令悟不二者。如华严明一切有无法了达非有非无。此即说有无悟非有非无。说二悟不二。此即理教义也。一切经论。凡有所说者。不出此三种也。然前说二谛令悟第一义谛。此二谛即有得有失。诸法性空。颠倒谓有名谛。即是失谛。诸贤圣真知性空。即是得谛。故此二谛有得有失也。次说二谛令离二见者。此二谛并是失。何者。为著有众生说第一义。为着空众生说世谛。此有无并是众生所著。是故皆失也。次说二悟不二。此二谛并得。何者。因二悟不二。二即是理教。不二即是教理。二即中假。不二即假中。二即体用。不二即用体。故此二谛是得也。次詺前二谛凡谛圣谛。世谛是凡谛。性空即圣谛。第二二谛。并是凡谛。为著有众生说空。为着空说有。借有破无。借无破有。此之有无并是凡夫谛也。然复有圣谛义。何者。所借有无是病皆凡。能借有无并药皆圣也。第三二谛。二悟不二假中义。此二谛并圣。何者如中论云。因缘所生法。我说即是空。亦为是假名。亦是中道义。从来明。此是三是义。一因缘即是空。二是假。三是中。此之二谛。岂凡夫所知。唯圣能了。又非二乘所及。但菩萨境界也。问何故就二谛说法。说二谛有何利益耶。解云。略出两论文。一者中论四谛品云。若人不能知分别于二谛。即于深佛法不知真实义明。若不解二谛。于深佛法不知真实。若了二谛。于深佛法即知真实义。故知。说二谛有大利益。二者十二门论观性门云。若人不知二谛。则不得自利他利共利。若知二谛则得三利。此之二论互出耳。然此二益摄一切益尽。中论明知深佛法益。十二门明利众生益。上求下化。不出二益也。问若为人不知二谛无利益耶。解云。佛法中即萨卫方广不知二谛。大损佛法。何者。萨卫等计一切法皆有。则不识如来第一义谛。由识第一义谛所以成圣。既不识第一义谛。则破诸贤圣。论文云诸贤圣真知性空名第一义谛。汝既不识第一义谛故破圣人。斯有大损也。次方广道人。计一切法空如龟毛菟角无<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>君臣父子忠孝之道。此人不识如来世谛。若不识世谛。此有何过。失世谛则失第一义谛。失第一义谛则不得涅槃。中论云。若不因世谛不得第一义。不得第一义则不得涅槃。故此人过失极大也。此二人摄一切尽。若内外大小一切计有者。同萨卫有失。一切大小内外计无者。同方广无失也。又如中论初云。佛灭度后五百岁。人根转钝。求<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>五阴等决定相。此即不识第一义谛。闻大乘法说毕竟空。不知何因缘故空。若都毕竟空。则无罪<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>应等。此即不知世谛。此有无二见众生。<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>。为此等故造此中论。即是住二谛破众生二见。大品云。菩萨住二谛。为众生说法。是何物菩萨。今龙树即其人也。以众生求十二因缘五阴决定相。次闻大乘毕竟空便言无罪福。如此等失于二谛故。龙树菩萨。为破此二人造中论也。从初至后。求一切法毕竟不可得。即住第一义谛破有见。次复云。虽空不断。虽有不常。有二谛教门。何时无<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>四谛因果罪福耶。此即住世谛破无见也。又前来借空以破有。后四谛品借有以破空。如百论借一以破异。借异以破一。中论亦尔也。此之二种。各示一势。前申破后逈破。前申破。住如来因缘世谛破<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>。住如来因缘第一义破有见。带申破。后逈破者。借有破无。借无破有。此有无并是众生有无。皆须破洗。一无所留。借无破有。有去无亦除。故是逈破。此即说于二谛破众生二见。故有大利益也。次更明前两人失二谛义。前明。萨卫谓诸法有。不识第一义谛。方广计。有分无故诸分无。柱无故四微无。人无故五阴无。计一切诸法无。不识世谛。一往如此耳。再往二人俱失二谛。萨卫既不知诸法性空者。亦不识诸法于颠倒因缘有。既失第一义即失世谛。故中论云。汝破一切诸法因缘空义。则破于世俗诸余所有法。此即破空义。即破一切有法也。又云。以有空义故。一切法得成。若无空义者。一切即不成故。萨卫不识空义。二谛皆失也。次方广明诸法空失于世谛。既失世谛。即失第一义谛。故中论初云。闻大乘说毕竟空。不知何因缘故空。若都空则无罪福<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>等。如是则失世谛第一义谛。故方广不知有具失二谛也。何故尔。空是有空。既其失有。是即失空。又且有即是空。中论云因缘所生法我说即是空。既即是空。失有即失空。空既然。有亦尔。为是义故。此二人皆失二谛。以皆失二谛故。破失令识如来二谛也。问何人失二谛耶。解云。大而为言。有两种人失二谛。一者不学二谛失二谛。二者学二谛失二谛。凡失二谛不出此二种也。若是百论。即对不学二谛失二谛缘。何者。百论正对破外道。外道不知诸法性空。不识第一义谛。既不知诸法性空。亦不知诸法于颠倒因缘有。不识世谛。所以提婆菩萨。从初破诸法性有。毕竟无所有。次破空品破性空。破外道性有性空竟。然后示如来因缘二谛。明诸法性空为真谛。随俗说故无过。即世谛。破彼空有示其二谛。百论作此用也。次明中论者。具破两种失。百论但破不学二谛失二谛缘。中论具破不学二谛失二谛及学二谛失二谛缘。何者。中论正破内傍破外。正破内。则正破学二谛失二谛缘。傍破外。即破不学二谛失二谛缘。破不学二谛失二谛。如百论也。破学二谛失二谛者。复有两种。一者正破大乘。二者傍破小乘。大乘学二谛失二谛。小乘不识二谛失二谛。小乘不识二谛失二谛者。即是前方广萨卫两人。并不识二谛。萨卫明诸法性有。不知诸法性空。既不知性空。即不识诸法颠倒有。不知性空。不识第一义谛。不知颠倒有。即不识世谛也。次方广不识二谛者。未知此人何学。彼若小乘学。则推画起邪见。明有分既无诸分亦无。于有起邪见。彼若大乘学。则闻大乘说起邪见。闻大乘说毕竟空。不知何因缘故空。若都毕竟空。云何分别有罪福报应等。若有罪福则不应空。推画空便起邪见也。既起空见即不识世谛。既不识世谛。即不识第一义谛。又此空是邪见空故。二谛皆失也。问<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>明诸法有。云何于三藏起邪见耶。解云。于外道中。尚得起邪见。如六师中云。无黑业无黑业报等。于外道中。尚得起邪见。况于三藏中不得起邪见耶。此即小乘不识二谛失二谛也。次大乘失二谛者。大乘学二谛失二谛。龙树正为此人出世。造此中论及十二门大智论。并为学二谛失二谛也。然大乘失二谛。复有二种。一者学二谛成性二谛。二者学二谛成一谛。前小乘有两失。一性有失二谛。二邪空失二谛。今大乘亦两失。如前佛法中都有四种失二谛。学二谛失二谛。成性二谛者。闻有住有。闻空住无。如从来初章。他有有可有。有无可无。有有可有。不由无故有。有无可无。不由有故无。不由无故有。此有是自有。不由有故无。此无是自无。自有即有故有。自无即无故无。斯即失因缘二成性二。失不二二成二故二也。言学二谛失二谛成一谛者有二种。一者学二谛成空谛。二者学二谛成有谛。学二谛成一空谛者。诸法于颠倒有名世谛。诸贤圣真知性空名第一义谛。明颠倒有为非诸法性空为是。何以故。诸贤圣真知诸法性空。故知。诸法性空定是也。此人闻空故空。闻有亦是空。学二谛唯成一空谛也。学二谛成一有谛者。有二义。一者即鼠喽栗二谛。二者心无义。鼠喽栗二谛者。经中明色色性空。彼云。色性空者。明色无定性。非色都无。如鼠喽栗中肉尽栗犹有皮[穀-禾+卵]形容宛然。栗中无肉故言栗空。非都无栗故言栗空也。即空有并成有也。言心无义者。然此义从来太久。什师之前。道安竺法护之时。已有此义。言心无义者。亦引经云。色色性空者。明色不可空。但空于心。以得空观故言色空。色终不可空也。肇师破此义明。得在于神静。失在于物虚。得在神静者明心空。此言为得。色不可空。此义为失也。然此之两释。并是学二谛失二谛。失世谛不识第一义。不识第一义即不识世谛。何者。此是空有。失有即失空。又设得一有。此有是有见有。故二谛皆失。空边亦尔。故皆失二谛。失二谛即失假。失假即失中。中假理教皆失也。学二谛成性二谛。亦一切失。闻二住二不识不二。不识不二即失中。失中即失假。此非相待失。失中即失假。何以故。假即中故也。学二谛失二谛。既并失不识二谛。失二谛理然。皆失大有三节。一者学二谛成一谛。失二谛一切失。二者学二谛成性二谛。失二谛一切失。三者不识二谛失二谛一切失。如此等人既一切失。詺作何物人耶。此乃是狂愚人耳。为是人故。四依出世破之。有两菩萨出世。提婆菩萨出世。破不识二谛失二谛。龙树菩萨出世。破学二谛失二谛。此二菩萨。破病具足也。非但释迦佛须此二菩萨。十方三世诸佛。并须此二菩萨。何以故。此二菩萨摄一切菩萨。两失摄一切失。破此两失。则申一切教。何者。此二失障二谛。破此二失。则二谛通。二谛通则一切经申。若尔故知。三论不可思议。所以关中叹云。中百两论文未及此。人又无通鉴。谁与正之。及至之后叹云。后谈道之人。始可与论实矣。实理如此。何者。失不出此二。中百两论既破此二失。二谛即通。二谛通一切教申故。三论有大利益也。通意如此。次对当路数论者。数人则不识二谛。彼不知诸法性空。但明诸法性有。一切皆有。不识第一义。既不识诸法性空。则不知诸法因缘有。二谛皆不识故。失二谛也。成论者。依彼论宗则同三藏。何者彼序云。故我欲正论三藏中实义。则同萨卫不识二谛。若就彼义中有二谛义。彼明人法二空。但是声闻空。终不识性空。何者。大智论云。佛于声闻法中。不说<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>空自相空。以不说自性空故。不识第一义。不识第一义。即不识世谛。若尔数论皆失二谛。以如此等人并失二谛。所以诸佛说二谛。菩萨申二谛教。令众生识二谛。识二谛即识一切中假等。所以说二谛有大利益。前明失二谛有二种。一者不识二谛失二谛者。当世即数论二人。数人不知诸法性空。但明诸法性有。此人不识性空。无第一义谛也。论人虽明诸法空。是声闻法空。非今第一义空。今以诸法本性空为第一义谛故。论云。诸贤圣真知性空名第一义。成论无此空。何以知尔。成论正明三藏法。龙树判云。佛于声闻法中。不说诸法自相空自性空。既无自性空故。彼无第一义谛。于彼不无人法二空故。彼引罗陀只喻经。明人法二空。但此空折法明空。不明本性空也。此则据毗昙一节。毗昙不明空。成论则明空。若尔望毗昙则有二谛。望摩诃衍则无二谛。但是世谛。何者。今摩诃衍。正以诸法本性空为第一义谛。彼但折法明空。所以无第一义谛也。问用此语为何耶。解云。欲释十二门论中一句语。彼论云。汝今闻世谛谓是第一义谛。今将数论等释此语。问若为闻世谛谓是第一义谛也。解云。毗昙亦明二谛义。谓十六谛理苦无常等为第一义谛。刀杖逼迫等事苦为世谛。彼就事理判二谛也。今明。此判二谛倒。何者。理之与事并是世谛。诸法性空。乃是第一义谛。无常等是世谛。谓是第一义谛。故云。闻世谛谓是第一义谛。是故堕在失处也。二谛既倒。则一切皆倒。何者。诸佛依二谛说法。二谛既倒。故一切皆倒。所以堕在失处也。次成论闻世谛谓是第一义谛者。明诸法有为世谛拆法空为第一义谛。今明。诸法有拆法空。并是世谛。何者。今就性空非性空以判二谛。性空为第一义谛。非性空为世谛。汝拆法空非性空故。是世谛。汝谓是第一义故堕在失处。何者。汝论宗云正明三藏。龙树云。佛以三藏中不说性空故。无第一义。若有第一义。则乖汝论宗。且应云故我欲正论摩诃衍实义。而传格噵正论三藏义。故无性空。无性空故。无第一义谛。进退皆屈。此非横破。道理如此也</p><p>次明学二谛失二谛者。大师云。此如失琉璃珠。譬在大池浴失琉璃珠。诸人求珠不得珠。各提瓦石<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>持出。乃知非真。实是唤鱼目谓为夜光。此即学二谛不识二谛也。问此人得是闻世谛谓是第一义谛不。解云。亦得。此有二义。一者就破明。二者就立辨。就破明者。论中横破万法。竖洗五句。一切毕竟无所有。彼便谓是第一义。此是真谛遣故一切空也。拙讲三论者。亦作此谓。言此等破洗是第一义谛。今明。此是世谛谓是第一义谛。何以知之。且举譬如十六知见我空。无十六知见我。为是世谛为是第一义谛耶。彼云。十六知见我空。此是世谛空。何者。实无十六知见我。外道颠倒谓有。破十六知见我。十六知见我空者。此是世谛空。今亦尔。实无此等诸法。特是颠倒谓有。今破横谓明诸法空故。是世谛空。亦非是世谛。此乃是世谛所离。离如此等诸法。始是世谛。为是故。破一切诸法。无所有。是世谛。以彼不了。谓是第一义。是故堕在失处。故是闻世谛谓是第一义谛也。言立义者。因缘无碍二谛。如中论所说。因缘所生法。我说即是空。即是假名。即是中道。横竖皆无碍。假即中即竖无碍。二不碍不二。不二不碍二。二为不二用。不二为二用。因缘生法我说即是空。即横无碍。有不碍空。空不碍有。有为空用。空为有用。何但空有无碍。唯就有中一切法无碍。如华严所辨。三世无碍净秽长短佛刹无碍。如此无碍名曰圣谛。菩萨得无碍者。非是诸法是有碍。菩萨得无碍观。令诸法无碍。得无碍通使诸法无碍。良由诸法无碍故。菩萨体法无碍故。菩萨得无碍观。得无碍观故。得无碍辨。得无碍通。若诸法有碍。菩萨得无碍通。使令无碍者。菩萨则有过罪。以诸法自无碍故。菩萨得无碍观。得无碍通。得无碍辨也。如此无碍故。名第一义也。若是由来人二谛即有碍。三假为世谛。四忘为第一义谛。三假不得为第一义。四忘不得为世谛。第一义不得有名相。世谛不得无名相。所以大师云。彼作两橙解义。闻说诸法空。即内置真谛橙中。闻说诸法有。即内置世谛橙中。世谛不得空。真谛不得有。如此有无皆碍。碍故悉是世谛。彼即云。我有真俗二谛。云何并是世谛耶。解云。有无碍皆是世谛。汝自为是第一义故。是闻世谛为是第一义谛也。如此等。并失如来二谛。不能知佛法深义。若能知二谛。则知佛法深义。何者。识知毗昙二谛是毗昙二谛。知此二谛并是世谛。终不学如此二谛。识成论二谛是成实论折法二谛。非是诸法性空二谛。识从来有得大乘是有碍二谛。识诸佛菩萨无碍二谛。识如此等二谛故。知深佛法义。偈云。若人不能知分别于二谛。则于深佛法不知真实义。若反此。应云若人能了知分别于二谛。则于深佛法得知真实义。为是故。说二谛有大利益也。前就中论明得失二谛如此。次就十二门论以辨得失二谛。论文云。若人知二谛。则得自利他利共利。若不知二谛。则不得三利。此之二论互明得失也。言自利他利共利者。了世谛第一义谛。发生方便实智名自利。了第一义谛世谛。发生实方便智名他利。具了真俗二谛。具生二智名共利也。二者菩萨自了真俗二谛。发生权实二智名自利。菩萨如实而悟。今还如实而说。令众生亦了真俗二谛发生权实二智名为他利。自他皆了二谛。皆生二智名为共利也。问此两种二智何异耶。解云。初则就真俗判二智。后就自他内外判二智。前真俗判二智者。了世谛第一义谛。名方便实智。了第一义谛世谛。名实方便智。了二谛判二智也。后就自他内外判者。内自悟二谛名实智。外为他说二谛名方便智。此即就实智中开二谛。就方便智中开二谛。此即就内外自悟化他以判二智也。得此二智利益者。明此二智是十方三世诸佛父母故。净名经云。智度菩萨母方便以为父。一切众导师。无不由此生故。此二智是诸佛父母。若了二谛。则有二智。有二智故。有十方三世诸佛。若不了二谛。则无二智。无二智则无十方三世诸佛。故知。说二谛有大利益也。又利益者。了世谛第一义谛。离凡夫地。了第一义谛世谛。离二乘地。离凡夫地。离二乘地。是菩萨地。若不了第一义谛世谛。不离二乘地。不了世谛第一义谛。不离凡夫地。不离此二地。即在五百由旬崄道之内。若了二谛。即出五百由旬外。入菩萨位。生在佛家。种姓尊贵。为是故了知二谛有大利益也。又利益者。离断常二见。了世谛第一义谛。离常见。了第一义谛世谛离断见。离断常二见。行于圣中道。见于佛性。若不了二谛。即不行中道。不见佛性。不见佛性。即无性佛等。若了二谛。即离断常。行于中道。见佛性。即有性佛等。为是故当知。识二谛有大利益也。略明得失利益如此。次明悟教生智义。此义难解。若为生智耶。大师旧语云。禀教得悟。发生二智。教转名境。若不悟即不生智。言不悟者。闻有作有解。有即住有。有不表不有。闻无作无解。无即住无。无不表不无。名为不悟。言悟者。闻有不住有。有表不有。闻无不住无。无表不无。名之为悟。作若为悟耶。为当悟非有非无不二。为悟有无二耶。若因有无二。悟非有非无不二。应生不二智。云何生二智耶。若言悟有无二者。此乃是悟教不应悟理。既不悟理。那得名悟耶。进退难明。未释云云。次明二谛是教义。摄岭兴皇已来。并明二谛是教。所以山中师手本二谛疏云。二谛者乃是表中道之妙教。穷文言之极说。道非有无。寄有无以显道。理非一二。因一二以明理。故知。二谛是教也。所以明二谛是教者有二义。一者为对他。二者为释经论。为对他明二谛是境。彼有四种法宝。言教法宝。境界法宝。无为果法宝。善业法宝。二谛即境界法宝。有佛无佛常有此境。迷之即有<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>纷然。悟之即有三乘十地故。二谛是迷悟之境。今对彼明二谛是教也。言释经论者。中论云。诸佛依二谛为众生说法。百论亦尔。诸佛常依二谛。是二皆实不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>也。大品经云。菩萨住二谛中。为众生说法。又涅槃经云。世谛即第一义谛。随顺众生故说有二谛。以经明二谛是教故。今一家明二谛是教也。诵得师语。复知其意竟。何者。知为对他。知为释经论。但此义未可解。何者。汝言二谛是教。说二谛有二谛。未说二谛应无二谛。若已有二谛。即同他家。若不同他家。说二谛始有二谛。未说二谛即应无二谛也。又难。说二谛始有二谛。未说二谛未有二谛者。说色空始有色空。未说色空应无色空。未说之前。自有色有空。若尔未说二谛。已有二谛。已有即同他云云。然二谛是教义。若可了二谛义即可解。三论文亦可解。若不了此义。二谛义即不可解。三论文则不可解。何者。他明二谛是境。汝今明二谛是教。说法是教。二谛亦是教不。若二谛是教。即违论文。论文云。诸佛依二谛说法。那忽言二谛是教耶。解云。有两种二谛。一于谛二教谛。于谛者如论文。诸法性空。世间颠倒谓有。于世人为实。名之为谛。诸贤圣真知颠倒。性空于圣人是实。名之为谛。此即二于谛。诸佛依此而说。名为教谛也。问教若为名谛耶。解有数意。一者依实而说故。所说亦实。是故名谛。二者如来诚谛之言。是故名谛。三者说有无教。实能表道。是故名谛。外道所说。何故不名谛。外道所说。不能表道。所以不得名谛。诸佛所说。实能表道。是故名谛也。四者说法实能利缘。是故名谛。外道说法。不能实利于缘。不得名谛。诸佛菩萨。实能利缘。所以名谛。五者说不颠倒。是故名谛。如涅槃经释一实谛义。如来所说。无有颠倒。名一实谛。今亦尔。所说不颠倒故。所以名谛。外道所说。皆悉颠倒。不得名谛。诸佛菩萨说。无有颠倒。是故名谛。六者得如实悟。如实而说。是故名谛。故经云如语者实语者不异语者不诳语者。此即如来诚谛不虚故。教名谛也。次明于谛。何因缘名谛耶。为从谓情为名。为从境为称。为从解为目耶。解云。于谛从两情解为名。但此义有两种。一者得失判二于谛。有于凡实。名为世谛。空于圣实。名第一义谛。此有谓情有。此空真解空。谓情有为失。真解空为得。此就谓情真解判二谛也。何以知尔。故论云。诸法性空。世间颠倒谓有名世谛。诸贤圣。真知性空名第一义谛。既云真知性空故是真解。前云颠倒谓有故是谓情。若尔故知。此即谓情真解得失。以判二于谛也。二者就两谓判二于谛者。如色未曾空有。凡谓色有。于凡是实名谛。圣谓色空。于圣是实名谛。此之有无。皆是谓情故。并皆是失。既凡谓有。圣谓空。此之空有。悉须洗破。无如此有。无如此空。毕竟洗净。始得明因缘空有。因缘空有。即非空有空有。既识非空有空有。即悟空有非空有也。前之空有。并是所治之病。故皆失也。以如此义名教谛。以如此义名于谛。此是师语不。然此实是师语也。次作一疑难安中。何者。依于谛说法。于谛是境不。若非境即乖论文。论文云。诸贤圣真知诸法性空。真知即是智。智必有境。性空即是境。真知即是智。若尔二谛是境。依二谛境。为众生说法。生得附论文即成他义。他亦云。二谛是境。说二谛名教。故有言教法宝境界法宝。四谛二谛。是境界法宝。说四谛二谛。即是言教法宝。今亦尔。与他何异。若言我不如此。即乖论文。论文云。诸佛依二谛。为众生说法。那得言二谛是教耶。进退不可。扶论文即同他。不同他即乖论文也。又作一掩答难。有于谛有教谛。于谛有真俗。教谛有真俗不。若言教谛亦有真俗者。成论死三论未知若为成论死者。今且问汝。说俗说是俗。说真说是真不。汝若言说是真。即乖汝义。何者。汝义教谛是言语唯是俗故。不得言教谛具真俗。若畏改语言。若说非真者。那得言教谛有真俗耶。若是成论家解义者。即云。真俗二谛是境。境有真俗。说真说俗。此两说并俗谛。真不可说。寄俗谛说也。今问三论师。他家真俗是境。境中有真有俗。汝今明二谛是教门。教谛亦有真俗不。不解义者。必云教谛亦有真俗。何者有两谛。有于谛有教谛。于谛有真俗。教谛亦有真俗也。问若为教谛有真俗耶。解云。说俗名俗教谛。说真名真教谛。问说俗名俗教。教是俗。说真教教是真不。说真之说。此是言教。那忽是真。若说俗之说说是俗谛。说真之说说亦是俗谛者。即成他义。他亦明。真不可说。寄俗说真。说真之说。还属俗谛。今亦尔。故同旧义。三论之义。还是我义也。所以成论暄正读中论。中论云。言说是俗谛。第一义谛不可言说。若尔言说皆是俗谛。何得言二谛并是教耶。若又二谛是教。教唯是俗谛者。即学二谛成一俗谛。前来诸人。学二谛成一谛既失。汝今学二谛成一谛。失之甚也。又难。他家明二谛是境境中有真俗。汝明二谛是教。教为但俗。为具真俗。若但俗即失真谛。便同他家。若具二谛乖论文。义复不可。论云。言说是俗谛。真不可言说。又难。言说若为是真谛。今为取言说空名真谛。为取空言说为真谛耶。若取言说为真者。言说是有。那是真谛。若云言说空为真谛者。空言说为是何物。汝只应云空说为世谛说空为真谛。若云只说空为真谛者。说空之说是真不。若说空之说是真即并难。若说空与空说皆为真谛者。色空与空色皆真谛。反诘云云。前来至此。都有四难未解。后当释之。今更简得失义。前得失凡有四种。今简最后学二谛失二谛者。若是小乘。不足可简。但正为学二谛失二谛人也。明他家辨二谛义。今时亦辨二谛义。何异。解此凡有十句异。一者明理教义。他二谛即无理教。今明。二谛有理教他无理教者。彼明二谛是理。三假是世谛理。四绝是真谛理。今明二谛是教不二是理故。经云。文殊法常尔。法王唯一法。一切<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>人。一道出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。又云。一切有无法。了达非有无。故知。有无二是教。非有无不二是理。具有理教也。唯他有二无不二。则唯有教无理。可谓世闲法者有字无义。一往如此。再往夺并无。何者字本诠义。既无有义。字何所诠。故理教皆失。今明。有无是教。表不有无理。此则有理有教。理教具足也。作如此说者。为对他为释经云云。次明禀二谛教发生二智教转名境。何故作此语耶。亦为对由来。由来云。真俗是天然之境。三假是俗境。四忘是真谛境。迷之即六道纷然。悟之即有三乘贤圣。常有此境。若是智从修习生。境即常有。智即始生。未有智时前已有境。境智非因缘义。今对此明真俗是教。悟教生智。教转名境。由智故境。由境故智。境能为智所。智能为境所。境所为智能。智所为境能。境智因缘不二而二也。问诸有二者无道无果。何故明二耶。解云。为对他无智有境。今明。由智故境。由境故智。境智因缘不二二也。然今明。二谛是教门者。正为拔二理之见。彼埋二理见深。有此二理终不可改。为是故今明。唯有一理无有二理。何者。如来说有说无。为表一道。此之有无乃是道门。非是理。为是故明。二谛是教非是理也。二者有相无相义。从来云。山门得无相义。他家明有相。何故他是有相。山门明无相耶。解云。他有有有相。无有无相。有若无相。即无有有。无若无相。即无有无。便无二谛。既道理有二谛。即有有有相。无有无相。名为有相义。今明。有无有相有表不有。无无无相无表不无。有无表不有不无故。名无相义。以无相故。故名教门也。三者得无得义。他有得义。今明无得义。他有有可得。有无可得。若无有可得无无可得。即无二谛。既有二谛。故有有无可得名为有得。今明。有不住有。有表不有。无有可得。无不住无。无表不无。无无可得故。名无得义。以无得有无。有无名为教也。四者明理内外义亦尔。他真俗理外。今真俗理内。以理内故。名之为教也。五者明开覆。他二谛是理即覆。今明二谛是教即开。何者。他有住有无住无。此有无覆如来因缘有无也。今明二谛是教。有表不有无表不无。有无表不有无。如来教即开。无有壅滞。故经云。譬如秋月处空显露。今亦尔。故有无名教也。六者明满半义。他家二谛是半。今明。二谛是满。何者。他唯有二无不二故。唯教无理。名为半字。今明。具足理教。名为满字。一往如此。他既无满。是即无半。何者半是满半。既无满。何得有半。安师云。减满为半。足半为满。既无满何所减为半。故无满即无半也。七者明他二谛愚者今是智者。何者。涅槃经云。明无明愚者谓二。智者了达其性无二。明无明既然。真俗亦尔。真俗二即愚者。不二即智者。不二之性即是实性。故知。不二是理二是教也。八者今明体用。彼但有用无体。无体即无用。今则具有体有用也。九者明本末。不二是本。二是末。他既无本。何有末。今具有二不二。具有本末。故云二谛是教不二是理也。十者明了义不了义。由来释了义不了义者。明小乘教为不了义。摩诃衍教为了义。就大乘教中复有二。般若法华等为不了义。第五涅槃<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>教为了义。此就五时教中。有了义不了义。如此二谛义。为有了义不了义别耶。解云。彼明。若以三假为世谛理。四忘为真谛理。此之二谛唯是了义。无不了义也。今明。如此二谛皆是不了。何者。我二谛说有。欲显不有。说无欲显不无。说有无显不有不无名为了义。汝有住有不表不有。无住无不表不无。有无不表非有非无。二不表不二。即不能显道故非了义。今明。因缘有无。有表不有。无表不无。有无二为显清净不二之道。故名了义。所以大经云。如是二语。为了一语也。今亦尔。因缘二为显不二。此因缘二。悟不二故。二为教门也。不取两语为教门也。然今家非但有了义。亦有不了义。具有了不了义。何者。只是一二谛教门。有方便。即闻二不住二。因二悟不二名了义。无方便。即闻二住二。不悟不二名不了义。故今时具有了不了义也。略明十种。判学二谛有得有失义如此。更撮十种者。一者理教义。二者相无相。三者得无得。四者理内外。五者开覆。六者半满。七者愚智。八者体用。九者本末。十者了不了云云。次都总料简。前云他但有教无理。今具足理教。此事不然。何者开善云。二谛者。法性之旨归一真不二之极理。又云。不二而二中道即二谛。二而不二二谛即中道。若尔彼有理教有二不二。何以言无耶。责云。汝二谛。为是道理。为是方便。彼明。二谛是道理也。难若二是理。即无不二理。若有不二理。即成三理。汝唯有二理无有三理。故无中道不二理也。今明。二谛非理。乃是方便教门。如三车门外。门外实无三车。方便说三。令悟不三。今亦尔。实无二谛。方便说二令悟不二。故二谛是教门也。又责。汝明不二是中道。中道为在二谛外。为二谛摄耶。汝明。二谛摄一切法尽。真谛上超涅槃下绝生死。四句斯忘。百非洞遣。一切无即是真谛。诸法有是世谛。外无处有法。若尔唯有二谛理。何处有中耶。又且汝非有非无是何物耶。非有还是无。非无还是有。还是有无断常。何说中道耶。为是故今明。二谛是教门。不二是中道也。又他无不有无有有无。今有不有无无有无。反之也。他唯有有无二理。无不二之道。今即唯有不二之道无有无也。问既无有无应无二谛。解云。实无有无。但方便故假言有无。假言有无。为悟不有无。以是义故。明二谛是教门也。然二谛更无有二。只同学一二谛。有得有失。成性成假云云。大师从来举譬如<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。有方便者服即长存。无方便者服即夭寿。甘露未曾修夭。修夭出自两缘。今亦尔。只是一二谛。有方便学即成假。无方便学即成性。有方便故为得。无方便故为失。二谛未曾性假得失。性假得失。出自两缘也。然只自性因缘。亦复无有二。有方便者。学自性成因缘。无方便者。学因缘成自性。如无方便者服甘露成毒药。有方便者服向毒药成甘露。学二谛人亦尔。无方便学因缘成自性。有方便学自性成因缘。为是故。学二谛有得有失。有自性有因缘也。问彼学因缘成自性天然之理。为当取此理不取此理耶。解云。具有取不取。言取者。今时亦有此二理。何者。于凡有凡理。于圣有圣理。有于凡有理。空于圣有理。然理实未曾有二。于二缘故有二理。故论云。浅智见诸法若有若无相。是即不能见灭见安稳法。非有非无名安稳法。见有无相。即不见安稳之法。好言为浅智。恶詺则是愚人。见有无相。理实非有无。理实非有无。于彼有有无二理也。若翻此谓即云。深智见诸法非有非无相。是则皆得见灭见安稳法也。言不取者。都无此有无之理。何者。谓有有理谓有无理。有无是谓情。既有是谓情有。岂有此有理。无是谓情无。岂有此无理。都无此有无也。既毕竟知无如此有无。有何物法。唯有四倒八倒。实无有常。倒谓有常。实无无常。倒谓无常。实无有倒谓有。实无无倒谓无也。彼即云。我有有无二谛道理。云何言无耶。今现见有有无法非是妄。那忽言不见。又有三世法。过未无现在有。诸法从未来为生。谢过去为灭。有生有灭。有有有无。何得言无耶。为是故。龙树出世求捡此执。汝言有有理。若个是有理。汝言有无理。若个是无理。求有不可得。云何言有有理。求无不可得。云何言有无理。如此有无生灭。特是汝颠倒。横谓为是耳。故中论云。若谓以现见而有生灭者。是即为痴。妄而见有生灭。若尔痴妄故见有无生灭。实无汝所见有无生灭也。前取即于二缘有二理。今破谓有实无有也。问前明二谛是教门时。为当如来说因缘有无为教。为当即眼见耳闻有无为教耶。然师答此语开合不同。今还作开合两意释之。言开者。即是理内外义。明理外亦有二谛。理内亦有二谛。理外二谛。即闻有住有不表不有。闻无住无不表不无。有无不能表理。不名为教。此即理外无理无教。理内二谛因缘有无。因缘有不有。因缘无不无。有无表非有无故。有无名教门。此即理内有教有理也。此如初章两节语也。初章前节。即理外义。后节即理内义。前节者。他有有可有。有无可无。有有可有。不由无故有。有无可无。不由有故无。不由无故有。有是自有。不由有故无。无是自无。自有即有故有。自无即无故无。此之有无。不能表不有无。此有无非是教门。故理外无理教也。今对他明二谛是教门。无有可有。无无可无。无有可有。由无故有。无无可无。由有故无。由无故有。有不自有。由有故无无不自无。不自有有。是无有。不自无无。是有无。无有不有。有无不无。此有无表不有无。故名为教门。所以理内有理教也。一家初章言方如此。学三论者。必须前得此语。何意名初章。初章者。学者章门之初故云初章。此语出十地经第一卷。明一切文字皆初章所摄。今亦尔。初章通一切法。何者。有无作既然。一切法亦例此作。故知。初章通一切法也。此即开理内外二谛是教非教也。次合释者。明有无何曾有二。只是此有无。有方便者学即成教门。无方便者学即成自性。有方便学自性成因缘。无方便学因缘成自性。有方便学初章前节成后节。无方便学后节成前节。如前甘露譬。甘露未曾有两。拙服甘露成毒药。巧服毒药成甘露。今亦尔。无方便学因缘成自性。有方便学自性成因缘。犹如一色。不了者。言定有不知不有。了者知色有不有故。只是此有无。两人学教非教异也。问何故前开理内外异。后复合明之耶。解云。开合并为对缘。前开理内外。正为对由来人。由来人。唯知有一种有无二谛。不知有两有无二谛。唯知有一三假四忘。不知有两三假四忘。今明。有两有无。有两三假。有两四忘。他有有故有。有无故无。有三假故三假。有四忘故四忘。此并是理外二谛。今明。因缘有无。因缘三假四忘。是理内二谛。开理内外得失。令彼识理内外得失舍失学得从外入内也。所以合明者。此为三论学者。三论学者。闻说理内外。便谓。有理内外异。更成理内外二见。为此人故明。二谛何曾有二。特是无方便不了者。詺为理外。有方便了者。即名理内。然二谛实无异。为是故。明开合两种也。问何故明此开合两种耶。解云。此之两种。并为开道令众生悟入也。前开理内外令悟者。明有所得理外有无。不能表道。明无所得有无。有是无有。无是有无。有无表不有不无。因教悟理。从假入中。故师云。圣人开真俗以表道。说有无以化物也。次合明令悟者。明有无未曾二。不了者成自性。了者成因缘。只了自性有无成因缘。因缘有无有无即不有无。悟于正道故。此二种并令悟于一道。经文皆尔。故法华云。唯有一大事因缘故。出现于世。又云。说种种乘皆为一乘也。次问。既皆为显道者。何不发初即为说非有非无令悟正道。而忽诸法。非有非无说有无表不有无。然后令悟非有非无。何乃迂回者耶。解云。此可有两意。今且作一种释之。明若直说瓶衣等有是世谛。此贤圣真知诸法毕竟空名真谛。此已恦潜不受。明诸法实录是有。那得言究竟无耶。此尚不受。何况说诸法非是有非是无。岂当信之。为此人故。以方便。于无名相中。假名相说。说有是凡谛。说空是圣谛。令其改凡学圣。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华所明。众生诸根钝。着乐痴所盲。如斯之等类。云何而可度诸法寂灭相。不可以言宣。我宁不说法。疾入于涅槃。若直说世谛有真谛无。何事言不可说耶。只为诸法非有非无。所以不可作有无说。为此故。方便说三。脱珍御服。得近其子。不得正门见。于窓牖中窥之耳。若不脱珍御服。不得化子。今亦尔。若即说非有非无即不受。所以方便前说有无。令悟不有无也。若尔斯乃物自迂回。非关佛故曲巧也。广洲大高释二谛义。亦辨二谛是教门也。彼举指为喻。为人不识月。举指令得月。彼云。不识月故。寻指得月。虽寻指知所指。所指竟非指。所指竟非指。指月未尝同。寻指知所指。所指因指通。所指所指通。通之由神会。指月未尝同。所指恒指外。又云。真谛以本无受秤。俗谛以假有得名。假有表有不有。为息断见。非谓有也。本无表无不无。为除常见。非谓无也。言有不毕有。言无不毕无。名相未始一。所表未始殊。此意明。因二谛教悟不二。不二是所表。如因指得月月是所表也。古人释与今意同也。今明。二谛如指。为小儿不识月。此为小儿。不为大老子。大老子知月。何须为。为小儿不识月故。举指令识月。凡夫众生亦尔。不识理故。须二谛教。故经云。众生痴如小儿。亦名著者。故不得前说不二之法也。前已作一种释明。如须依二谛说法。不得发始即说诸法非有非无。何者。说有是世谛。说空是真谛。已惊潜不受。况为说非有非无耶。如脱珍御服也。今更作一种释。明依二谛说不得说非有非无也。然前须作一问然后乃得释之。问云。经中具有说有说无。及说非有非无非真非俗非色非空。如涅槃经云。即于波罗奈转正法轮。宣说中道。一切众生。不破诸结。非不能破。非破非不破。是名中道。说法非师非<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。非得利非不得利。名为中道。若尔此即。具有说二说不二。何得言唯依二谛说不得说不二耶。又且长者初脱珍御服。后还着珍御服。有脱有着不常脱。那言常依二谛说不说非有无不二耶。解云。说有说无。说非有非无。并是教非是理。一往开理教者。教有言说。理不可说。理既不可说。云何得悟。所以得悟理者。必假言说。为是故。说有无说非有无。并是教皆令悟理也。问说有无可是二谛教。说非有无不二。云何亦是二谛教耶。答为是义故。所以山门相承兴皇。祖述明三种二谛。第一明。说有为世谛。于无为真谛。第二明。说有说无。二并世谛。说非有非无不二为真谛。汝所问者。只着我家第二节二是世谛不二是真谛。我今更。为汝说第三节二谛义。此二谛者。有无二。非有无不二。说二说不二为世谛。说非二非不二为真谛。以二谛有此三种。是故说法必依二谛。凡所发言。不出此三种也。又此二节二谛。并出经论。有为世谛。空为真谛。如论所明。故论云。有为世谛。此贤圣真知空为真谛也。二为世谛。不二为真谛。亦出论。论云。有无并世谛。故说第一义谛即无也。又净名云。我无我不二。是无我义。反即我无我二为我义。真俗亦尔也。二不二为世谛。非二非不二为真谛者。华严云。不着不二法。以无一二故。又大论云。破二不着一。若尔故知。非二非不二。名为第一义谛也。次明。所以大师明此三种二谛者。有数意。两意已如前说。一者为释诸佛所说常依二谛。亦是明诸佛所发言不出三种二谛也。二者为释经论。经论复有此三种二谛。文如前所引云云。然经中所以有此三种说者。并是赴缘不同。即是各各为人悉檀。或有闻说有无二谛悟。即为说之。乃至闻说二不二为世谛。非二非不二为第一义谛故说之也。又所以明三重二谛者。此三种二谛。并是渐舍义。如从地架而起。何者。凡夫之人。谓诸法实录是有。不知无所有。是故诸佛。为说诸法毕竟空无所有。言诸法有者。凡夫谓有。此是俗谛。此是凡谛。贤圣真知诸法性空。此是真谛。此是圣谛。令其从俗入真舍凡取圣。为是义故。明初节二谛义也。次第二重。明有无为世谛不二为真谛者。明有无是二边。有是一边无是一边。乃至常无常生死涅槃。并是二边。以真俗生死涅槃是二边故。所以为世谛。非真非俗非生死非涅槃不二中道。为第一义谛也。次第三重。二与不二为世谛。非二非不二为第一义谛者。前明真俗生死涅槃二边。是偏故为世谛。非真非俗非生死非涅槃不二中道。为第一义。此亦是二边。何者。二是偏不二是中。偏是一边中是一边。偏之与中。还是二边。二边故名世谛。非偏非中乃是中道第一义谛也。然诸佛说法。治众生病。不出此意。为是故明此三种二谛也。此之三种。只得为一缘。亦得为三缘者。初节为凡夫。凡夫谓诸法是有。所以说诸法有为俗谛。空为真谛。正为破凡夫有见故。说有为俗空为真谛也。第二重。为破二乘人。二乘谓诸法空。沈空见坑故。法华云。我尔时但念空无相无愿之法。于菩萨游戏<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>净佛国土。永无愿乐。若尔。凡夫著有二乘滞空。此之空有。并是世谛。若非空非有非凡非圣。乃是第一义。故经云。非凡夫行。非圣人行。是菩萨行。亦非有行非空行。是菩萨行。为是故明第二重二谛也。第三重为破有得菩萨。有得菩萨云。凡夫见有。二乘着空。凡夫沉生死。二乘着涅槃。我解诸法非有非无非生死非涅槃。为是故。明有无二非有无不二。生死涅槃二非生死非涅槃不二。并是世谛。若非真俗非生死涅槃。非非真俗非非生死涅槃。乃是第一义谛也。此即摄五乘为三缘。开三种二谛。赴此三缘。皆令悟一乘一道。若悟此三即究竟。悟此三即非凡非圣非大非小。若尔始是悟也。是故经云。我今得道得果。于无漏法得清净眼。以得如此悟故。所以如来便入涅槃也。又所以明三种二谛者。为对由来人。由来人明三假是世谛四忘是真谛。今明。此之二谛。是我家初节二谛。我家有三重二谛义。汝二谛是初重二谛。今过汝有两重二谛也。第二节二谛。若真若俗为世谛。若非真若非俗为第一义谛。若尔。汝二谛是我家世谛也。又第三节。摄彼若二谛若中道。并是今世谛。何者。前第二节。明二为世谛不二为真谛。汝二谛但是我家世谛也。彼即云。我亦有非真非俗中道义。为是故。第三节明二不二为世谛。汝若二谛若中道。悉是我家世谛。为是故明此三种二谛义也。问从来明有三谛义。一世谛二真谛三非真非俗谛。故经云有谛无谛中道第一义谛。若尔。云何言诸佛常依二谛说法耶。诸佛常依二谛说法。此即时长佛广。常依故时长。诸佛故佛广。此即十方三世诸佛。常依二谛说法。那得有三谛。既有三谛。何得复言常依二谛耶。解云。常依二谛说法。不妨三谛。虽有三谛。不乖常依二谛说法。何者。今真俗是二谛。摄真俗二为世谛。不真俗为第一义。若尔。唯是二谛故。云诸佛常依二谛说法也。次时明二谛废立义。问有无表不有无。悟不有无时。为废有无为不废耶。次结二难。若悟不有无废有无。如得月忘指者。不然。何者。本了有无得不有无。若废有无即无有无。无有无宁有不有无。涅槃经云。菩萨具二<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。即能解知一种二种。若言无一二者。是义不然。何以故。若无一二。云何得说无一无二。要由一二得有无一二。若尔。要由有无得悟不有无。何得废耶。若便不废有无者亦不然。若不废有无者。何得从来云得月忘指会理忘筌耶。师解云。具有废不废义。所言废者。约谓情边。即须废之。何者。明汝所见有者。并颠倒所感。如瓶衣等。皆是众生颠倒所感。<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>见有。故中论云。若谓以现见而有生灭者。即为是痴妄而见有生灭。颠倒感得此眼。求此眼不可得。诸法亦不可得。特痴妄见有。是故须废也。此则用空废有。若更着空。亦复须废。何者。本由有故有空。既无有。何得有空。故中论云。若使无有有云何当有无。又云。若有不空法。可有于空法。不空法尚无。何得有空法。此之空有。皆是情谓。故皆须废。乃至第三节。谓情言有。亦皆须废。何者并是谓情。皆须废之也。问若此三种二谛皆废。用何物为二谛教耶。解云。约缘边即是谓情。佛为说边即是教门。今明。此等皆谓情。皆须废之也。何以故。谓情所见皆是虚妄。故废之也。又非但废妄。亦无有实。本有虚故有实。既无虚即无实。显清净正道。此亦名法身。亦名正道。亦名实相也。然此已拔从来也。何者从来云。取相<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>感六道<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。此须废。废六道生死。得如来涅槃。今明。有生死可有涅槃。既无生死即无涅槃。无生死无涅槃。生死涅槃皆是虚妄。非生死非涅槃乃名实相。一往对虚辨实。若无彼虚即无有实也。若就三重二谛义辨者。即由来人废立在初节二谛义中。何者彼废世谛立真谛。何者取相烦恼感得六<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>报名为世谛。断取相烦恼。六道果报谢。此即废世谛而有真谛之境。由真谛境生佛妙智。此即废世谛立真谛。今明。此之二谛。并是谓情。皆悉须废。何但初节二谛须废。乃至第三重皆须废。何以故。此皆谓情故须废之也。此即一往废三。不废不三也。次就三种二谛中论废不废。明无方便三即废。有方便三即不废。无方便三废者。明此三倒谓有三。实无此三。是故须废。如阳炎谓是水实无水也。然亦无有废。何者有水可废。既无水。何所废。而言废者。约彼谓有故言废也。有方便三不废者。即不坏假名。说诸法实相。不动等觉建立诸法。既云不坏假名说诸法实相。岂当得不二废二。若得不二废二。即坏假名说诸法实相。动等觉建立诸法。唯假名即实相。岂须废之。如中论云。是假即中。废假名即废中。既不废中。岂当废假。斯即空有有空。二不二不二二。横竖无碍。故肇师云。欲言其有。有非真生。欲言其无。事像既形。又云。譬如幻化人非无幻化人。幻化人非真人也。此唯幻化人非人。非人不无幻化人。幻化人非人。非人人。诸法亦尔。故不废也。此就有方便无方便因缘不因缘。论废不废如此。次更就谓情生灭无生灭二观。明废不废。何者由来云。小乘即断二轮烦恼。得见思两解。大乘断五住地惑。得十地解。此即见思伐二惑。十地解断五住地惑。此废惑立解。废凡立圣。若不断二惑。见思无由成。不伐五住。<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>即不立。故大小乘皆断惑成圣也。今依<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>望。并除粪人。何故谓为除粪人。欲鄙之耳。故经云。念子愚劣乐为鄙事。二乘断惑既是除粪。菩萨断惑亦是除粪。齐而过甚。何者同断故是齐。断少多故过甚。二乘除粪。盖是不足言。菩萨时长除粪广故。过之甚也。今明。菩萨知惑本不生今不灭。何所断。斯即生在佛家。种姓尊贵。如转轮圣王皇太子也。唯见客作贱人除粪。何曾闻长者之儿担屎。故今明。菩萨不断惑。何者菩萨知惑本不生今不灭故。无所断也。所以净名经云。法本不生。今则无灭。法华云。诸法从本来常自寂灭相。从来云。菩萨无生灭观。何故明无生灭耶。如向所辨。知本不生今无所灭故。言菩萨不生不灭观也。问他断二惑得小圣。断五住惑得大果。汝今不断。云何得言小圣大果耶。解云。汝断惑得有圣。我本无惑。岂无圣耶。又反之。汝见惑生今断不得圣。若知惑本不生不灭乃得圣。何者不生不灭是本。知本可得成圣。汝不知本。岂得成圣。故法华云。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>我今得道得果。于无漏法。得清净眼。今日得道当知。前来未得道。又涅槃经云。汝诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。未为大乘除诸结使。为是故。从来断不断。今始是断也。从前来。略明二谛大意如此也</p><p>二谛义卷上</p><p>二谛义 卷中</p><p>胡吉藏撰</p><p>释二谛名者。此义极难。解二谛名者。俗是浮虚义。真是真实义。从来久解。今未知那得二谛名而欲释耶。解此问者。我家明二谛有两种。一教二谛。二于二谛。如来诚谛之言。名教二谛。两种谓情。名于二谛。此则就情智判于教二谛也。问教谛是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。教谛名从佛起。于谛是缘于。于谛名从缘起不。解云。教谛是佛教。教谛名从佛起。于谛是缘于。于谛名亦从佛起。难云。教谛是佛教。教谛从佛起。于谛是缘于。于谛那得从佛起耶。解云。领僻。我云。教谛是佛教。教谛名从佛起。于谛是缘于。于谛名从佛起。于谛与于谛名。此语大挍。今明。教谛名从佛起。于谛名亦从佛起也。问教谛从佛起。于谛亦从佛起。教谛既是教。于谛亦是教。反诘云云。解云。两种二谛皆是佛教。问教谛可是教。于谛若为亦是教。既有于教之殊。云何并是教耶。解云。二于谛名。亦是为众生故说。为众生说有。于凡是世谛。为众生说空。于圣人是真谛。为众生说空有。是二于谛故。二于谛亦是教也。问二于谛名是佛说。名从佛起。空有二谛从何起耶。解云。只空有二谛。诸佛出世故有。佛未出世则无。缩长为短释。佛未出世时。虽言空有。不知空有是二谛。如佛未出之时。亦有苦集灭道等名。而不知苦集灭道是谛。由佛出世故。说苦集灭道四谛。故经云。甘露门初开也。空有亦尔。由佛出世。詺空有为二谛。故云空有佛出世始名二谛也。次更长释者。佛出世佛未出世。空有并由佛得知。所以成论云。劫初物未有名。圣人为受用故。为物立名。如瓶衣等。空有亦尔。佛未出世时。圣人为空有立名。若尔。佛出世佛未出世。空有名并由佛有也。次问。于谛名如此。于谛从何而起耶。解云。于谛有两种。一两情二于谛。二情智二于谛。两情二于谛可解。何者。两情二于谛。从佛教起。明佛为众生说二谛教。众生不了。作空有两解。成两于谛。此于从教起也。问情智二于谛何因得有耶。解云。一于但一。一于有二。一于但一者。凡夫颠倒。谓瓶衣等诸法为有。此瓶衣等物。有佛无佛。常于凡夫是有。如涅槃经云。十二因缘。有佛无佛性相常住。但小乘释有二人。毗婆阇婆提云。是无为常住法。萨婆多弹云。恒有为常。如火有佛无佛常热。不可言火有佛热无佛不热。有佛无佛恒热为常。十二因缘亦尔。今明。世谛亦如此。诸法于凡常有。常有世谛也。一于二义者。即是诸贤圣。真知诸法空为第一义。言二义者。就本迹两意以释之。本迹义。则诸佛出世故有。诸佛出世。知向颠倒诸法性空也。迹本义。则诸佛法身。本知颠倒性空。故法华云。我以佛眼观见六道众生。此即在法身地。本知颠倒性空也。略寻二谛名根本大意如此。然义必须得其根本识其大意。若不得意。义不中用。如中论序大小乘人不识佛说空有意所以成失。前序小乘云。像法钝根。求十二因缘阴入界等决定相。不知佛意。但著文字。次序大乘云。闻说毕竟空。不知何因缘故空。为此义故。龙树出世造论。申佛教意也。既有明则。今昉而学之也。次问。既有于谛教谛。佛何意说于谛与教谛耶。解云。如来所以说二于谛者。欲令众生一节转两节转。说于令悟非于非不于。何者。于无名相中。强名相说。无名而说名。令悟名无名。亦非于非不于。为众生说于。令悟于非于非不于。故经云。知有非有本性清净。又云。欲令众生深识第一义谛故说世谛。又云。一切有无法。了达非有无。为是故。说于令悟非于非不于也。所言一节转二节转。何者是耶。一节转者。说有于凡是谛。说空于圣是谛。作如此说者。令众生转有入空。何者。有于凡是有。此有实无所有。宣说有。于凡是有。则知此有不有。此正为凡夫。凡夫谓诸法实有。今说此有于凡是有。若知有于凡是有。即知此有非有。斯则因有悟不有。经云。知有不有。又经云。欲令众生深识第一义谛故说世谛。又论云。若不因世俗。不得第一义也。两节转者。说有于凡是实。对有于凡是实。说空于圣是实名二于谛。既说空有于缘二。即知于二不二。说于二显不二。故经云。一切有无法。了达非有无也。若好释者。于二者明非二。非谓是非二。若言于二为显不二。此言平钝。若骏悟解者。于二者。明非是二非谓是非二。亦应须上扬。不得下抑。上扬则两离。何者。于二非是二则离二。非谓是非二。不着不二。此则悟非二非不二非偏非不偏清净正道也。然作如此说。于谛者即是教谛。何处别有教谛。只作如此目詺于谛。即是教谛。即是依二谛说法。从来人。闻师说于谛教谛。作二谛解。诵语鹦鹉喙鵄脚耳。今明。如向所明。无别教谛。说于即教也。问若尔从来解那得云有于谛教谛耶。解云。于两情名二于谛。佛为众生说此二于。即是教谛。更无有二。但约义判。何者。于谛即是所。教谛即是能。能所判于教二谛也</p><p>又问。何意说于谛教谛耶。解云。二意。一者为释经读论。经论中并有此言也。二者为对他。他明二谛是天然之境。有此二理。而二谛名境。复名理者。会二谛生二智。名之为境。而道理有二谛故。名之为理。道理有此二理。道理有此二境。今对彼。明此是于二理。此是于二境。非道理有此理有此境也。若尔。今时有两境两理。两境者。一于境二教境。两理者。一于理二教理。为是义故。明于谛教谛也。然如来直说二于谛。凡有三句。谓得失亦得亦失。直作此说。若为得解耶。今佛直说二于谛。云何得解。答今明。佛说于谛有三句。一皆得二皆失三亦得亦失。言亦得亦失者。即是前二于谛。诸法于凡是有。此有为失。诸贤圣真知诸法空。此空为得。示其空有。令识得失。令其舍有学空改凡成圣也。二皆失者。二皆是于。故二皆失。于凡有。有既失。于圣空。空亦失。何者。诸法未曾空有。于凡谓有。于圣谓空。如一色未曾空有。有见之人谓色有。空观之人谓色空。一色于空有两缘成空有故。此空有并是失也。两皆得者。只知于二。即知不二。此下五句皆净。于缘二。岂是二。问于二非是二可是非二不二耶。解云。于二非是二。明非是二。非谓是非二。既非二非不二。五句皆净。斯则上拂霄汉。下漏渊泉也。从来只云二于谛皆失。不知有此三句。然此三句。有两种谛。前二句即于谛。后一句即教谛。前二句即于境。后一句即教境。于境即不转境。教境即转境。言前两句是于谛不转境者。诸法于凡是实有。有佛无佛常有此境。有境既常有。空境亦常有。诸贤圣常知诸法空。亦常有此空境。今时亦有天然之境。亦有天然之智。常有此境。常有此智。此之境智。并是于缘境智。非是转悟境智也。言转悟境者。只说于缘有。即知于有不有。说于缘空。即知于空不空。识于有无不有无。识教悟理。悟理即生权实二智。生二智时。空有之教即转名境。故是转悟境也。问犹有一疑妨。何者前明二于谛一得一失。失是所化得是能化。今那得云说于空令悟不空。若说于空令悟不空者。此乃所化。何谓能化耶。解云。前明二于谛。空是能化者。引凡令学圣。凡夫颠倒谓有。诸贤圣真知诸法空。明能化空。令其舍有。若玄变之徒。既知有不有。即知空不空。不须为说空令悟不空。但钝根之人。舍其所见有。学能化空。既学得能化空。作于空解。为此人故。说噵于汝是空诸法实非空也。此约渐悟为论。前令悟有不有。次令悟空不空也。问他亦明有境谛有教谛。彼有境界法宝。有言教法宝。境界法宝即境谛。言教法宝即教谛。汝既有教谛。他亦有教谛。汝有如来诚谛之言。他可无如来诚谛之言耶。若尔皆有境教。斯有何异。解云异。今明。汝二谛天然之境。是我家于境失。于境失中。有无量失。此是我家粗失。细失非汝所及。故经云。菩萨微细碍相。非二乘境界。今亦尔。汝天然之境。是今家粗失。故与彼大异也。所以大论云。外道与佛<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>去玄殊。犹若天地。又云。天食须陀比人中臭粪。又如驴牛二乳。驴乳抨成粪。牛乳抨则成苏。今亦尔。他得为今失也。此即是依二谛说法。二谛是境义也。又问。教谛为若异耶。解云。一往拔者。我有三种二谛。汝所明二谛。是我初节二谛。三假有为世谛。四绝为真谛。此之二谛。是我家初节二谛也。又问。汝二谛教表何物。彼云。二谛还表二理。若尔二还表二。指还指指也。又彼唯有二无不二。则唯有教无理。无理则无教。今有理即有教。具足理教也。前来明立名意。今次释名。然虽无名而名。是故今释名也。故肇师云。无名之道。于何不名。师云。于无名相中。强名相说。既无名强说名者。为令因名悟无名。说名不令众生住名中。若说名令众生住名中。此还是众生。非谓是佛。今明。无名强说名。令众生因名悟无名。然须知此名即无名。只名无名。无名而名。既知无名名。即知名无名。此即除故不造新也。若是从来人。则造新不毕故。何者。本有身心之病。今闻佛说真俗。后作真俗解。有真可真。有俗可俗。有名异无名无名异名。即有所得义。有所得者。名曰声闻。是魔眷属。像法决疑经云。是十方三世佛怨。佛藏经云。刀轮杀一切。有得之人罪过于此。华严云。譬如饿鬼等云云。所以大论云。有生死来。无能治此病也。今摄山兴皇出世。拆破此病。说名令众生悟名无名。不住名亦不住无名。举譬如双六打隐。打不隐即为他打。说二谛名。本为除病。若住名中。名复成病。今明二谛如双六打隐也。问何故恒作此释。解云。只为恒有此病故。恒作此说。如诸声闻恒障<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>故也。师何因得如此解。学龙树提婆两论主。两论主。何因得此解。学诸佛也。问曰。经中有立有破。何得言皆破耶。解云。经中若立若破。皆为破病。何者。经中若说一色一香皆为显道。若不显道。可不破病。既若立若破。皆为显道故。破立皆为破病也。经既然。故论主学经。师学论主。大小乘人。有新故两病故。有两论主出世破之。提婆破故病。龙树破新病。论主既然。大师亦尔。破此新旧等病故。作如此说也。然道义大意如此。必须得如此意。非为立名道义。乃道义为息名也。将欲息名故。前须释名。释名凡有四句。一者一名一义。二者一名无量义。三者一义一名。四者一义无量名。名不出此二种。义莫过斯之二条。言一名一义者。一名即一俗名一真名。一义者。俗以浮虚义。真真实义。从来得此一句。今明。是四句中一句也。次一名无量义者。若为一名无量义耶。解言。一是无量一。一岂不是无量。此则无量一。一无量。故经云。一中解无量。无量中解一。展<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>非实智者。无所畏也。问曰。若为一名有无量义耶。解云。就四义解之。一随名释。二就因缘释。三显道释。四无方释。随名释者。如俗以浮虚为义。又俗以风俗为义。然此具出内外故。律有国土毗尼。随国土处所。风俗不同也。<a href=\"/ctwh/jing/13j/liji.html\" class=\"keylink\" target=\"_blank\">礼记</a>云。君子行礼不求变俗。故风俗为义也。从来唯得前释。无有后解也。问此两释何异。解云。俗以浮虚为义。此即望真释。明圣人所知真实。凡夫所知浮虚。对真释俗也。若是风俗释俗。则当俗释俗。只处所风俗不同故名为俗。此无所望也。前则望他。后则当自。自他异也。又前约经释。后就律释。河西云。佛法不出经律二藏。阿毗昙只分别经律耳。故经律摄佛法尽也。前释约经者。经明。诸法浮虚无所有故。浮虚释俗约经也。风俗释就律者。明律中不得道诸法浮虚无所有。不得道人是浮虚草木浮虚。何以故。为制戒令佛法久住故。所以不得明物浮虚无所有。但明国土风俗不同也。此则就经律释异。由来亦不知也。次第二就因缘释义者。明俗真义。真俗义。何者。俗非真则不俗。真非俗则不真。非真则不俗。俗不碍真。非俗则不真。真不碍俗。俗不碍真。俗以真为义。真不碍俗。真以俗为义也。问前随名释有二义。一望他当自释。二约经就律释。今就何物义释耶。解云。对有碍有得。就无得无碍释。若言俗浮虚义真真实义。此是凡夫二乘有得解义。今明。菩萨无得无碍义故。明俗是真义真是俗义也。他家无此义。他俗定俗。真定真。三假定俗不得真。四忘定真不得俗。真俗有碍声闻解义。今明。真是俗义俗是真义。真俗无碍。菩萨解义也。问何故作如此说耶。解云。对彼自性。明今因缘。因缘动彼自性之执故。经云。前以定动。后以智拔。今前明因缘。动彼性执。后当拔之也。但今一往且明因缘。动彼自性。彼明浮虚定俗义真实定真义。为是故。今动摇已。明俗是真义真是俗义也。问若为俗是真义真是俗义。空是色义色是空义耶。解云。大品经中自释。彼经云。色即空空即色。真即俗俗即真。既云真即俗。真岂非俗义。又中论云。因缘所生法。我说即是空。因缘生法即是有。既即是空。真岂非俗义。释此偈具释经。论引经释。论即释经也。又义是名之所以。真是俗之所以。故真为俗义。经云。欲令众生深识第一义谛。是故如来宣说世谛。既说世谛令识第一义谛者。则俗为真。名真为俗义也。俗谛既然。真亦尔也。次第三就显道释义者。明俗是不俗义。真是不真义。真俗不真俗义。真俗不真俗即名义。不真俗真俗即义名。真俗不真俗教理。不真俗真俗理教。斯则名义理教中假横竖也。何处作如此说也。解云。即如华严所明。一切有无法。了达非有无。以达有不有故。不有为有义。达无不无故。不无为无义。亦如了达明无明二不二。既达二即不二故。不二为二义。了达真俗不真俗故。不真俗为真俗义也。问何故明不真俗为真俗义耶。解云。前明因缘横义动。今真俗不真俗竖义拔。横义动竖义拔。故一家从来明假伏中断义。言假伏者。真是俗义。俗是真义。伏彼自性也。既知因缘真。即知真不真。知因缘俗。即知俗不俗。悟真俗不真俗自性永断。为是义故。前横伏今竖断也。次第四节无方释义者。明俗以一切法为义。人是俗义。柱是俗义。生死是俗义。涅槃是俗义。无方无碍故。一切法皆是俗义也。问何故明一切诸法皆是俗义耶。解云。从前第三义生。前第三义云。俗不俗义。真不真义。真俗悟不真俗。此则悟无碍道。既悟无碍道故。有无碍用。以得无碍用故。所以一切法为俗义也。前则是从用入道。今则从道出用也。问若为得一切法并是俗义耶。且引例通。汝家有别待通待义。长短真俗因果待即别待。长待不长。俗待不俗。此即通待义。所以俗待不俗为通待者。明除俗之外一切皆不俗故。云通待也。一切法是不俗。不俗待俗。不俗既是俗义。故一切即俗义也。又泛简待义。从来云长短待因果待瓶衣二果不得待。今明瓶衣二果相待也。问高下相倾有无相生可得待。瓶衣二果云何待耶。反问汝。是非得待。不是瓶待非瓶不。彼云。是非得待。瓶待非瓶也。若尔衣是非瓶。非瓶既待瓶。衣即待瓶也。衣既待瓶。则瓶衣因缘。衣是瓶义。瓶是衣义。衣既是瓶义。一切物皆是瓶义也。又明。一切法是俗义者。就如义显之。色如一切法如。色如即一切法如。一切法即色。举譬如破僧佉大有与瓶一义。为有瓶不异有即瓶。有与万法不异万法亦即瓶。今亦尔。如与俗不异。俗即如。如与一切法不异。一切法即俗。何以故。体如故也。华严何意云一念<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>无量劫一念耶。体道故如此。何者。一念即是道。无量劫亦是道。故无量劫即一念。何以故。无碍道故。体无碍道故。得无碍用。一念无量劫。无量劫一念。无量劫一念非一念。一念无量劫。非无量劫。非一念非无量劫。而一念无量劫。此中横竖无碍具足故。经云。一中解无量。无量中解一也。然此四义次第不得前后。何者。第一就世俗以释义。俗浮虚义风俗义。且随情释也。第二渐深。明俗真义真俗义也。第三从真俗入不真俗。从用入道。第四悟道竟从道起用。次第相生也。就真俗释此四义。例一切因果人法等皆尔也。前释一名一义一名无量义竟。今次释一义一名一义无量名。言一义一名者。以正道为一义。真俗为一名。然正道未曾名。为一道故立乎一名。亦立一名为显乎一道。何者。既为一道立一名。一名岂不显一道。故言一义一名也。一义无量名者。还以一道为一义。无量名者。为显一道立无量名。立无量名为显一道。既为一道立无量名。无量名岂不显乎一道。故言一义无量名也。问若为无量名耶。解云。名无量略出四种。谓世谛俗谛真谛第一义谛问唯有此四名不。解云。名无量。世谛俗谛有谛凡谛真谛第一义谛空谛圣谛。故华严四谛品云。此<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>。有四十亿百千那由他四谛名。况十方世界名号。斯则有众数名。不可具举。若具举。竹帛所不能载。今且略释世与俗真与第一义四名也。然此四名有离有合。合者合世俗为一谛。合真第一为一谛。故经云。世俗谛故说。第一实义故即无也。离者则有世谛俗谛真谛第一义谛。问何故或离或合耶。解云。为存略故。离释。为义同故合明。世俗名虽异。其义是同。故合名世俗谛。真第一义亦尔也。问此之四谛名何异。他解云。真俗当体得名。世与第一。褒贬为称。言真俗当体得名者。明俗是浮虚为义。当体浮虚。真是真实为义。当体真实。故真俗当体得名也。世与第一为褒贬者。明世是代谢隔别为义。第一则莫过为义。既隔别为世。莫过为第一。故世与第一</p></div>"
}]