[{
    "title": "云门匡真禅师广录 第1988部",
    "author": "守坚",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>云门匡真禅师广录 卷上</p><p>并序</p><p>祖灯相继数百年间。出类迈伦。超今越古。尽妙尽神。道盛行于天下者数人而已。云门大宗师特为之最。擒纵舒卷纵横变化。放开江海。鱼龙得游泳之方。把断乾坤。鬼神无行走之路。草木亦当稽首。土石为之发光。其传于世者。对机室录垂代勘辨。行录岁久或有差舛。今参考刊正一新镂板。以永流播。益使本分钳锤金声而玉振。峥嵘世界瓦解而冰销。必若列派分宗。不免将错就错。论功纪德。已是埋没前贤。画样起模。适足糊涂后学。若是顶门有眼甚处与云门相见</p><p>熙宁丙辰三月二十五日</p><p>权发遣两浙转运副使公事苏澥序</p><p>门人明识大师赐紫守坚集</p><p>对机三百二十则</p><p>师上堂良久云。夫唱道之机。固难谐剖。若也一言相契。犹是多途。况复刀刀。有何所益。然且教乘之中。各有殊分。律为戒学。经为定学。论为慧学。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>五乘五时八教。各有所归。然一乘圆顿也大难明。直下明得。与衲僧天地悬殊。若向衲僧门下。句里呈机。徒劳伫思。门庭敲磕千差万别。拟欲进步向前过在。寻他舌头布路。从上来事合作么生。向者里道圆道顿得么。者边那边得么。莫错会好。莫见与么道。便向不圆不顿处卜度。者里也。须是个人始得。莫将依师语相似语则度语。到处呈中将为自己见解。莫错会。秖如今有什么事。对众决择看。时有州主何公。<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>问曰。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>请益。师云。目前无异草。有官问。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>如水中月。是不。师云。清波无透路。进云。和尚从何得。师云。再问复何来。进云。正与么时如何。师云。重叠关山路。有官问。千子围绕。何者为的。师云。化下住持已奉来问。问今日开筵。将何指教。师云。来风深辨。进云。莫秖者便是么。师云错。问从上古德以心传心。今日请师将何施设。师云。有问有答。进云。与么则不虚施设也。师云。不问不答。问凡有言句。皆是错。如何是不错。师云。当风一句起自何来。进云。莫秖者便是也无。师云莫错。问如何是啐啄之机。师云响。进云。还应也无。师云。且缓缓。问如何是学人的的事。师云。痛领一问。问如何是教外别传一句。师云。对众问将来。师云。莫道今日瞒诸人好。抑不得已。向诸人前作一场狼藉。忽被明眼人见。成一场笑具。如今避不得也。且问汝诸人。从来有什么事。欠少什么。向汝道无事。已是相埋没也。须到者个田地始得。亦莫趁口乱问。自己心里黑漫漫地。明朝后日大有事在。尔若根思迟回。且向古人建化门庭。东觑西觑看。是什么道理。尔欲得会么。都缘是汝自家<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>浓厚。一期闻人说着。便生疑心。问佛问法。问向上问向下。求觅解会。转没交涉拟心即差。况复有言莫是不拟心是么。更有什么事。珍重</p><p>问如何是云门一曲。师云。腊月二十五。进云。唱者如何。师云。且缓缓。问如何是祖师西来意。师云。日里看山。问如何是和尚家风。师云。久雨不晴。进云。如何是久雨不晴。师云。晒[日*良]着。问如何是不带眹。师云。天台普请。南岳游山。问如何是向上一路。师云。九九八十一。问如何是学人自己。师云。游山玩水。进云。如何是和尚自己。师云。赖遇维那不在。问如何是教主。师云。太无礼生。问如何是一代时教。师云。对一说。问如何是<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼。师云普。问如何是端坐念实相。师云。河里失钱河里摝。问如何是<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>行。师云。会不得。进云。为什么会不得。师云。秖守会不得。问如何是寻常之用。师云。且那里葛藤去。问如何是教意。师云。尔看什么经。僧云。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经。师云。一切智智清净。还梦见未。僧云。一切智智清净且置。如何是教意。师云。心不负人面无惭色。放尔三十棒。问如何报得四恩三有去。师云。抱头哭苍天。问如何是正<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。师云。粥饭气。问如何是<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。师云。到老僧一问。还我一句来。问如何是诸佛出身处。师云。东山水上行。问乞师指个入路。师云。吃粥吃饭。师云。我事不获已。向尔诸人道。直下无事。早是相埋没也。更欲蹋步向前寻言逐句求觅解会。千差万别广设问难。赢得一场。口滑。去道转远。有什么歇时。秖此个事。若在言。语上。三乘十二分教岂是无言语。因什么道教外别传。若从学解机智。秖如十地<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a><a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>如云如雨。犹被诃责见性如隔罗縠。以此故知。一切有心天地悬殊。虽然如此若是得底人。道火不能烧口。终日说事。未尝挂着唇齿。未曾道着一字。终日着衣吃饭。未曾触着一粒米挂一缕丝。虽然如此。犹是门庭之说。须是实得与么始得。若约衲僧门下句里呈机。徒劳伫思。直饶一句下承当得。犹是瞌睡汉。时有僧问。如何是一句。师云举。问如何是说时默。师云。清机历掌。进云。如何是默时说。师云嗄。进云。不默不说时如何。师将棒趁问如何是云门剑。师云祖。问如何是诸佛出身处。师云。更请一问。问如何是露地白牛。师云。觌机无改路。进云。放着什么处。师云。再举不逾尘。问如何是尘尘三昧。师云。桶里水钵里饭。问如何是一如体玄。师云。欠尔一问。问如何是玄中的。师云[祝/土]。进云。如何即是。师云。速退速退。妨他别人问。问如何是非思量处。师云。识情难测。问凿壁偷光时如何。师云恰。问一言道尽时如何。师云裂破。进云。和尚作么生下手拈掇。师云。拈取粪箕扫帚来。问如何举唱即得不负来机。师云。道什么。进云。还可来意也无。师云。且缓缓师云。三乘十二分教横说竖说。天下老和尚纵横十字说。与我拈针锋许说底道理将来看。与么道早是死马医。虽然如此。且有几个到此境界。不敢望尔言中有响句里藏锋。瞬目千差风恬浪静。伏惟尚飨。问如何是透法身句。师云。北斗里藏身。问如何是本来宗。师云。不问不答。问如何是<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a><a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>万法<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>。师云。我今日不答话。进云。为什么不答话。师云。驴年会么。问如何是吹毛剑。师云骼。又云胔。问如何是内外光。师云。向什么处问。学云。如何明达。师云。忽然有人问尔。作么生道。进云。明达后如何。师云。明即且置。还我达来。问如何是切急一句。师云吃。问如何是本来心。师云。举起分明。问如何是衲僧孔窍。师云。放过一着。进云。请师道。师云。对牛弹琴。问如何是大乘<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。师云。一榼在手。问如何是一切智智清净。师云。僧堂入佛殿。问如何是不挂唇吻一句。师云。合取狗口。问如何是海印三昧。师云。尔但礼拜。问着待我东行西行。问如何转动即得不落阶级。师云。南斗七北斗八</p><p>上堂云。诸兄弟尽是诸方参寻知识。决择<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。到处岂无老宿垂慈方便之词。还有透不得底句么出来举看。待老汉与汝大家商量。有么有么。时有僧出拟伸问次。师云。去去西天路迢迢十万余。便下座。问如何是当今施设。师云。道即不难。鉴从何来。问如何是不睡底眼。师云。不省。问如何是不犯之令。师云。那个师僧还见么。问如何是大人相。师乃擎拳。问如何是学人切急处。师云。尔怕我不知。问如何是佛法大意。师云。一佛二菩萨。问如何是雪岭泥牛吼。师云。山河走。进云。如何是云门木马嘶。师云。天地黑。问如何是兄弟添十字。师云。我共汝说葛藤。问如何是和尚为人一句。师云。心不负人面无惭色。速礼三拜。问如何是天然之事。师云。蹋步向前作什么。问如何是教意。师云。吃嘹舌头更将一问来。问如何是七纵八横。师云。放汝一着</p><p>上堂云。举一则语。教汝直下承当。早是撒屎着尔头上也。直饶拈一毛头。尽大地一时明得。也是剜肉作疮。虽然如此。也须是实到者个田地始得。若未且不得掠虚。却须退步向自己根脚下推寻看。是什么道理。实无丝发许与汝作解会。与汝作疑惑。况汝等且各各当人。有一段事。大用现前。更不烦汝一毫头气力。便与祖佛无别。自是汝诸人信根浅薄恶业浓厚。突然起得如许多头角。担钵囊千乡万里受屈作么。且汝诸人有什么不足处。大丈夫汉阿谁无分。独自承当。尚犹不着便。不可受人欺瞒取人处分。才见老和尚开口便好。把特石蓦口塞。便似屎上青蝇相似。斗咂将去。三个五个聚头商量苦屈兄弟。古人一期为汝诸人不奈何。所以垂一言半句通尔入路。知是般事。拈放一边。自着些子筋骨。岂不是有少许相亲处。快与快与。时不待人。出息不保入息。更有什么身心闲别处用。切须在意。珍重</p><p>上堂良久云。触目不会道。运足焉知路。僧问。如何是触目<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。师云。与我拈却佛殿。问如设是最初一句。师云。九九八十一。僧便礼拜。师云。近前来。僧便近前。师便打。问如何是实学底事。师云。大好消息。进云。毕竟是谁家之子。师云。腊月二十五。问承教有言。一切智智清净时如何。师便唾之。进云。古人方便又作么生。师云。来来截却汝脚跟。换却汝髑髅。钵盂里拈却匙筋。拈将鼻孔来。进云。甚处有许多般。师云。者掠虚汉。便打。问如何是禅。师云是。进云。如何是道。师云得。问如何是一切法皆是佛法。师云。三家村里老婆盈衢溢路。会么。学云不会。师云。非但汝不会。大有人不会在。问学人簇簇地。商量个什么。师云。大众久立</p><p>上堂云。尽乾坤一时将来着尔眼睫上。尔诸人闻与么道。不敢望汝出来性燥把老僧打一掴。且缓缓子细看。是有是无。是个什么道理。直饶尔向这里明得。若遇衲僧门下。好槌脚折。若是个人。闻说道什么处有老宿出世。便好蓦面唾污我耳目。汝若不是个手脚。才闻人举便承当得。早落第二机也。汝不看他德山和尚才见僧入门。拽拄杖便趁。睦州和尚见僧入门来便云。现成公案。放尔三十棒。自余之辈合作么生。若是一般掠虚汉。食人脓唾。记得一堆一担搕[打-丁+(天/韭)]。到处驰骋驴唇马觜。夸我解问十转五转话。饶尔朝问至夜答到夜论劫。还梦见么。什么处是与人着力处。似这般底有人屈衲僧斋也道得饭吃。堪什么共语处。他日阎罗王面前。不取尔口解说。诸兄弟。若是得底人。他家依众遣日。若未得。切莫掠虚。不得容易过时。大须子细。古人大有葛藤相为处。秖如雪峰和尚道。尽大地是尔。夹山和尚道。百草头上荐取老僧。闹市里识取天子。洛浦和尚云。一尘才起大地全收。一毛头师子全身总是尔。把取翻覆思量看。日久岁深自然有个入路。此个事无尔替代处。莫非各在当人分上。老和尚出世。秖为尔作个证明。尔若有个入路少许来由。亦昧汝不得。若实未得。方便拨尔即不可。兄弟一等是蹋破草鞋行脚。抛却师长父母。直须着些子眼睛始得。若未有个入头处。遇着本色咬猪狗手脚。不惜性命入泥入水相为。有可咬嚼。眨上眉毛高挂钵囊。十年二十年办取彻头。莫愁不成办。直是今生未得。来生亦不失人身。向此门中亦乃省力。不虚辜负平生。亦不辜负施主师长父母。直须在意。莫空过时。游州猎县。横担拄杖一千里二千里走。这边经冬。那边过夏。好山好水。堪取性多斋供。易得衣钵。苦屈苦屈。图他一斗米。失却半年粮。如此行脚有什么利益。<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>檀越一把菜一粒米。作么生消得。直须自看。无人替代。时不待人。一日眼光落地。前头将何抵拟。莫一似落汤螃蟹手脚忙乱。无尔掠虚说大话处。莫将等闲空过时光。一失人身万劫不复。不是小事莫据目前。俗子尚犹道朝闻道夕死可矣。况我沙门合履践何事。大须努力。珍重</p><p>问如何是诸佛出身处。师云。佛前装香佛后合掌。问十二时中。如何得不被诸境惑去。师云。三门头合掌。问四面森森。如何是灵树。师云。风鸣雨息。进云。如何是灵树枝条。师云。晒[日*良]皮草。问如何是触目菩提。师云。拈却露柱。学云。露柱岂干他事。师云。驴年会么。问醍醐上味为什么翻成毒药。师云[祝/土]。问如何是活。师云。心不负人。学云。如何是杀。师云。三日后不得唱衣。学云。不杀不活时如何。师以拄杖趁出。问学人与么来。请师实说。师云知。问金刚为什么倒地。师云。不着力。问杀父杀母佛前<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。杀佛杀祖向什么处忏悔。师云露。问不起一念还有过也无。师云。须弥山。问如何是和尚家风。师云。有读书人来报。问学人有疑请师不责。从上宗乘事作么生。师云。三拜不虚。问生死到来如何排遣。师云。在什么处。问如来唯一说无二说。如何是如来说。师云。那个师僧何不问。问闇中如何辨主。师云。务原是什么人坐。问学人实问。请师实答。师云。尔作么生辨。进云。正当与么时如何。师云的。问从上古德以何为的。师云。看取舌头</p><p>上堂云。诸和尚子莫妄想。天是天地是地。山是山水是水。僧是僧俗是俗。良久云。与我拈案山来看。便有僧问。学人见山是山见水是水时如何。师云。三门为什么从这里过。进云。与么则不妄想去也。师云。还我话头来</p><p>上堂良久云。还有人道得么。道得底出来。众无语。师拈拄杖云。适来是个小屎坑。如今是个大屎坑。下座。问万法归一。一即不问。如何是万法。师云。尔来这里说葛藤瞒我。问圣僧为什么被大虫咬。师云。与天下人作牓样。问十二时中如何用心。即得不负于上来。师云省力。进云。省力事如何。师云。省取前话。问万机不到处如何知有。师云。该得么。进云。日用事如何。师云。一箭到新罗。大汉国里说葛藤。问学人拟伸一问。还许也无。师云。佛不夺<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>所愿。问如何举唱即得不负来机。师云。痛领一问。问千圣功圆。冥然时如何击琢。师云。句里明人。问三界中何物胜于佛。师云。通尔一问。问摘叶寻枝即不问。如何是直截根源。师云。速礼三拜。问已事未明。如何指示。师云。不避来机还当得么。问尽其机来。师还接也无。师云。一问不错。学云。一问且置。师还接不。师云。细看前话。问毗卢向上即不问。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>请师留些子。师云。把却汝咽喉。尔作么生道。问如何是学人自己。师云。一叉一劄。进云。莫便是不。师云苏噜苏噜</p><p>上堂云。今日与诸人举一则语。大众耸听良久。有僧出礼拜。拟伸问次。师以拄杖趁云。似这般灭胡种。长连床上纳饭阿师。堪什么共语处。这般打野榸汉。以拄杖一时趁下。问大众云集合谈何事。师云。向下文长。付在来日。进云。便与么去时如何。师云堕。进云。什么处是堕。师云。长连床上饱吃饭了脱空<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。问<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>一会何似今日。师云。言中有响。学云。当今事作么生。师云。不烦再问。问以字不成八字不是。未审是什么字。师云。九九八十一。进云。学人不会。乞师指示。师云。我又辜尔什么处。问从上古德得个什么便称尊贵。师云。爱问不爱答。进云。与么则不假和尚舌头嚼去也。师云。熨斗煎茶铫不同。问和尚为人语话。还有未道着底句也无。师云。说不及。进云。为什么如此。师云。秖为如此。问大拍盲底人来。师还接也无。师放身倒。问如何是云门山。师云。庚峰定穴。问牙齿敲磕皆落名言。如何得不落古人踪。师云。通机自辨。问如何是和尚家风。师云。皮枯骨瘦。问如何是道。师云。七颠八倒。进云。为什么如此。师云。一不得向。二不得开。问暗室得明时如何。师云。朗州此去多少</p><p>上堂云。一言才举千差同辙。该括微尘犹是化门之说。若是衲僧合作么生。若将祖意佛意这里商量。曹溪一路平沈。还有人道得么。道得底出来。时有僧问。如何是超佛越祖之谈。师云糊饼。进云。这个有什么交涉。师云酌然有什么交涉。师乃云。尔勿可作了。见人道着祖师意。便问超佛越祖之谈。道理尔且唤什么作佛。唤什么作祖。即说超佛越祖之谈。便问个出三界。尔把将三界来。有什么见闻觉知隔碍着尔。有甚声色法与汝可了。了个什么椀。以那个为差殊之见。他古圣勿柰尔何。横身为物。道个举体全真物物觌体不可得。我向汝道直下有什么事早是相埋没了也。尔若实未得个入头处。且中私独自参详。除却着衣吃饭屙屎送尿。更有什么事。无端起得如许多般妄想作什么。更有一般底。如等闲相似。聚头举得个古人话。识性记持妄想卜度道。我会佛法了也。秖管说葛藤取性过日。更嫌不称意。千乡万里抛却父母师资。作这去就。这个打野榸汉。有什么死急行脚去。以拄杖便趁下。问父母不听不得<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。如何得出家。师云浅。进云。学人不会。师云深。问从上来事。请师提纲。师云。朝看东南暮看西北。进云。便与么会时如何。师云。东家点灯西家暗坐。问当今一句。请师道。师云。放尔一线道。还我一句来。问不涉廉纤。请师道。师云。一怕汝不问。二怕汝不举。三到老僧勃跳。四到尔退后。速道速道。僧便礼拜。师便打。问万机丧尽时如何。师云。与我拈佛殿来。与汝商量。进云。岂干他事。师咄云。这掠虚汉。问目前荡尽时如何。师云。热发作么。其僧礼拜而退。师云。且来且来。僧近前。师便棒云。这掠虚汉[言*(穴/卒)](呼讶切)我。问如何是法王主。师云。叉手着。问盲龟值浮木孔时如何。师云。老僧叉手去也</p><p>上堂云。故知时运浇漓代干像季。近日师僧北去言礼文殊。南去谓游南岳。与么行脚名字<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>徒消信施。苦哉苦哉。问着黑漆相似。秖管取性过日。设有三个两个。狂学多闻记持话路。到处觅相似语句。印可老宿。轻忽上流。作薄福业。他日阎罗王钉钉之时。莫道无人向汝道。若是初心后学。直须摆动精神。莫空记说。多虚不如少实。向后秖是自赚。有什么事。近前。问学人正在迷途。请师一接。师云。道什么。问如何是教意。师云。答犹未了。进云。和尚什么处答。师云。将谓汝灵利。问如何是衲僧正眼。师云。那个师僧近前来。其僧近前。师咄云去。问如何会得和尚一句。师云。腊月二十五。问教中即不问。如何是宗门中事。师云。既有来问。速礼三拜。问绝消息处如何履践。师云。三十年后。进云。秖今如何。师云。莫乱统。问性源还有语也无。师云莫问。问佛病祖病将何医。师云。审即谐。进云。将何医。师云。幸有力。问百步穿杨。请师指的。师云。答这话去也。问言诠不及处。如何体会。师云。对众快礼三拜。问竛竮之子如何进步。师云。目前不辨。进云。岂无尊贵。师云。不较多。进云。作么生。师云。作么生。问凡有言说皆是葛藤。如何是不葛藤。师云。大有人见汝问。问急急相投。请师指教。师云。作么生道。进云。不会请师道。师云作么</p><p>上堂云。大众汝等还有郓州针么。若有试将来看。有么有么。众无对。师云。若无散披衣裳去也。便下座</p><p>上堂。大众集定。乃以拄杖指云。乾坤大地微尘诸佛。总在里许。争佛法觅胜负。还有人谏得么。若无人谏得。待老僧与汝谏看。时有僧云。请和尚谏。师云。这野狐精。问尽大地人来。师如何接。师云。提纲有路。进云。莫秖这便是指示不。师云。合取狗口。问时中不明。如何得不落缘尘去。师云。闭门哭苍天。问十二时中如何体悉。师云。不难辨。进云。还有学人入头处也无。师云。细看前话。问灵山一会<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>亲闻。未审闻个什么句。师云。不避来锋。速道速道。进云。是什么句。师云。掣电之机徒劳伫思。问千圣不传古今不历。如何是和尚接人一句。师云。触忤老兄得么。进云。如何是接人一句。师云作么。问有何迳要令学人心息。师云。放尔三十棒。问目前坦然时如何。师云。海水在汝头上。进云。还着得也无。师云。向这里脱空妄语。问施主设斋。将何报答。师云。量才补职。进云不会。师云。不会即吃饭。问如何是向上事。师云。截却汝肚肠。换却匙筋。拈将钵盂来看。僧无对。师云。这掠虚汉。问如何是佛法大意。师云。来锋有路。问如何是学人转身处。师云利。问一口吞尽时如何。师云。我在汝肚里。进云。和尚为什么在学人肚里。师云。还我话头来</p><p>上堂良久云。秖这个带累杀人。便下座</p><p>上堂云。道即道了也。时有僧。出礼拜欲伸问次。师拈拄杖便打云。识什么好恶。这一般打野榸汉。总似这个僧。争消得施主信施。恶业众生总在这里。觅什么干屎橛咬。以拄杖一时趁下。问牛头未见四祖时如何。师云。家家观世音。进云。见后如何。师云。火里蝍蟟吞大虫。问如何是禅。师云。拈却一字得么。问浮桑柯畔日轮未出时如何。师云知。问背楚投吴时如何。师云。面南看北斗。问六国未宁时如何。师云。千里何明。进云。争柰不明何。师云。赖遇适来道了。问如何是本源。师云。受什人么<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。问如何是直截一路。师云。主山后。进云谢师指示。师云。合取皮袋。问曹溪的旨。请师垂示。师云。三十年后。问密室玄宫时如何。师云倒。进云。宫中事作么生。师云重。问万机吐不出时如何。师云。大众不匿。进云。犹是学人疑处在。师云。语覆前机去。问要急相应。唯言不二时如何。师云。对众举。大众可不知。进云。如何承当。师云驴年。问一生积恶不知善。一生积善者不知恶。此意如何。师云烛。问远远投师。师意如何。师云。七九六十三。进云。学人近离衡州。师喝云。是尔草鞋跟断。僧云珍重。师喝云。静处萨婆诃。问如何是学人自己。师云。一佛二菩萨</p><p>上堂云。汝等诸人。傍家行脚皆是河南海北来。各各尽有生缘所在。还自知得么。试出来举看。老汉与汝证明。有么有么。汝若不知。老汉瞒汝去也。汝欲得识么。生缘若在向北。北有赵州和尚五台文殊总在这里。生缘若在向南。南有雪峰卧龙西院鼓山。总在这里。汝欲得识么。向这里识取。若不见莫掠虚。见么见么。若不见。且看老汉骑佛殿出去也。珍重。问六国未宁时如何。师云。云擎雨色。问上无攀仰下无己躬时如何。师云。藏身一句作么生道。僧便礼拜。师云。放过一着置将一问来。僧无语。师云。这死虾蟆。问如何是色即是空。师云。拄杖敲汝鼻孔。问如何是和尚非时为人一句。师云。早朝牵犁晚间拽把。问三乘五性即不问。如何是衲僧门下事。师云。日势稍晚。速礼三拜。问久值为什么不识。师云测。问如何是心。师云心。进云不会。师云不会。进云。究竟如何。师咄云。静处东行西行。问三界唯心万法唯识时如何。师云。舌根里藏身。进云。藏身后如何。师云。苏噜苏噜。问如何是途中受用。师云。七九六十三。进云。如何是世谛流布。师云。江西湖南新罗渤海。问密室不通风时如何。师云。响露鸣风。进云。如何是密室中人。师云。再陈难辨。问直与么来时如何。师云。照从何立。进云。不去不来时如何。师云。前语道什么。问进向无门时如何。师云。三千八百</p><p>上堂云。放尔横说竖说。从朝至暮无人塞尔口。不放尔说。又作么生</p><p>上堂大众集。良久蓦拈拄杖云。看看。北郁丹越人见汝般柴不易。在中庭里相扑供养尔。更为儞念般若经云。一切智智清净无二无二分无别无断故。僧便问。如何。是一切智智清净。师云。西天斩头戢臂。这里自领出去。问挂锡幽岩时如何。师云。在什么处。问如何是深中浅。师云。山河大地。进云。如何是浅中深。师云。大地山河。进云。如何是深。师云。朝到西天暮归唐土。问迦叶入定时如何。师云。匿得么。进云。还见十方不。师云。好手透不出。问真如湛寂妙绝无门时如何。师云。自机回照。进云。秖这里如何。师云。莫错。问千般方便诱引归源。未审源中事如何。师云。有问有答。速道将来。僧应喏。师云。迢遥也。问如何是云门剑。师云揭。进云。用者如何。师云。苏噜苏噜。问如何是祖师西来意。师云。没即道。进云不会。师云。壮一问。问能诠表里时如何。师云。风不入。进云。表里事如何。师云错。问万机俱罢时如何。师云。冢上生芝草。问观身无己。观外亦然时如何。师云。热发作么。进云。与么则冰消瓦解去也。师便打。问龙门有意。进水无能时如何。师云。来机即易。再举还难。进云。正与么时如何。师云快</p><p>上堂云。我看汝诸人。二三机中尚不能构得。空披衲衣何益。尔还会么。我为汝注破。久后到诸方。若见老宿举一指竖一拂子云是禅是道。拽拄杖打破头便行。若不如此。尽落天魔眷属。坏灭吾宗。汝若实不会。且向葛藤社里看。我寻常向汝道。微尘刹土中三世诸佛西天二十八祖唐土六祖。尽在拄杖头说法。<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>变现。声应十方。一任纵横。尔还会么。若不会。且莫掠虚。虽然如此。且谛当实见也未。直饶到此田地。也未梦见衲僧<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>在。三家村里不逢一人。师蓦拈拄杖划地一下云。总在这里。又划一下云。总从这里出去也。珍重。问古人面壁意旨如何。师云念七。又云定。问百不会底人来。师如何接。师云。话堕也。进云。什么处是话堕。师云。七棒对十三。问承古有言。了即<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>本来空。未了还须偿宿债。未审二祖是了未了。师云确。问从上古德相传何事。师云。速礼三拜。问如何是云门一路。师云亲。进云。如何即是。师云。颠言倒语作么。问承古有言。拟心即差。如何得不差。师云。洪机历掌。进云。后人再问作么生。师云。迟风难改。问三身中阿那身说法。师云要。问如何是释迦身。师云。干屎橛。问请师提纲宗门。师云。南有雪峰北有赵州。问大彻底人见一切法是空不。师云。苏噜苏噜。问终日切切不得个入路。乞师指个入路。师云。当机有路。问如何是超佛越祖之谈。师云。蒲州麻黄益州附子。问如何是教意。师云。撩起来作么生道。进云。便请师道。师云。对牛弹琴。问玄机一路如何体会。师云。三十年后。问椁示双趺当表何事。师云言。进云。未审师意如何。师云。紧帩草鞋。问不是玄机。亦非目击时如何。师云。倒一说。问劫火洞然时如何。师云。更梦见什么</p><p>上堂云。天亲菩萨无端变作一条楖[木*栗]。拄杖乃划地一下云。尘沙诸佛尽在这里说葛藤去。便下座</p><p>上堂云。我共汝平展。遇人识人。与么老婆说话。尚自不会。每日饱吃饭了上来下去。觅什么椀。这野狐队仗向这里作什么。以拄杖一时趁下。问初秋夏末。前程忽有人问。如何只对。师云。大众退后。进云。过在什么处。师云。还我九十日饭钱来。问学人近到法席。未审家风事如何。师云。不历一问作么生道。问十方国土中唯有一乘法。如何是一乘法。师云。何不别问。进云。谢师指示。师便喝。问承古有言。一尘遍含一切尘。如何是一尘。师云。吃嘹舌头。更将一问来。问学人不问。师还答也无。师云。将汝口挂壁上不得。问一切寻常时如何。师云。虽然屎臭气熏我。我且问尔。昼行三千夜行八百。尔钵盂里什么处着。无对。师云。脱空妄语汉。问如何是教眼。师云。速礼三拜。问承古有言。牛头横说竖说不知有向上关棙子。如何是向上关棙子。师云。东山西岭青。问如何是露地白牛。师云。归依佛归依法归依僧。进云。白牛何在。师咄之。问树凋叶落时如何。师云。体露金风。问如何是布袋里真珠。师云。说得么。问如何是祖宗的子。师云。言中有响</p><p>上堂云。夫学般若菩萨须识得众生病。即识得学般若菩萨病。还有人拣得么。出来对众拣看。众无语。乃云。若拣不得。莫妨我东行西行</p><p>上堂云。我今日共汝说葛藤。屎灰尿火泥猪疥狗不识好恶。屎坑里作活计。所以道。尽乾坤大地三乘十二分教三世诸佛天下老师言教。一时向汝眼睫上会取去。饶汝便向这里一时明得。亦是不着便汉。无端跳入屎坑。可中于我衲僧门下过打脚折。时有三僧一时出礼拜。师云。一状领过。问如何得速超三界去。师云。如何得速超三界去。进云是。师云。是即休。问终日忙忙时如何。师云。觌机无响路。进云。作么生。师云。说不得。问一摆净尽时如何。师云。争柰老僧何。进云。此是和尚分上。师云。这掠虚汉。问如何是道。师云。透出一字。进云。透出后如何。师云。千里同风。问古人道知有极则事。如何是极则事。师云。争柰在老僧手里何。进云。某甲问极则事。师便棒云。吽吽。正当拨破便道请益。这般底到处但知乱统近前来。我问尔寻常在长连床上。商量向上向下超佛越祖。尔道水牯牛。还有超佛越祖底道理么僧云。适来已有人问了也。师云。这个是长连床上学得底。不要有便言有无便言无。僧云。若有更披毛戴角作么。师云。将知尔秖是学语之流。又云。来来。我更问尔诸人。横担拄杖道。我<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>学道。便觅个超佛越祖底道理。我且问尔。十二时中行住坐卧屙屎送尿。至于茆坑里虫子市肆卖买羊肉案头。还有超佛越祖底道理么。道得底出来。若无莫妨我东行西行。便下座。师见僧入来便云。瓦解冰消。僧云。学人有什么过。师云。七棒对十三。问如何是西来意。师云。长连床。上有粥有饭。问承古有言。道无横径立者皆危。如何是道。师云。普请看。问如何是三乘教外一句。师云。阇黎一问。老僧勃跳三千里。进云。谢师指示。师云。住住尔道老僧话作么生。无对。师云。三十年后来。与汝三十棒。问大众云集合谈何事。师云。[言*(穴/卒)](呼讶切)汝屋里老爷。问曹溪一句盖国知闻。未审云门一句什么人得闻。师云。阇黎不闻。进云。学人亲近得不。师云。子细踟蹰看</p><p>上堂云。如来明星现时成道。有僧问。如何是明星现时成道。师云。近前来近前来。僧近前。师以拄杖打趁</p><p>上堂有僧出礼拜云。请师答话。师召大众。大众举头。师便下座</p><p>上堂良久有僧出礼拜。师云。太迟生。僧应喏。师云。这漆桶</p><p>上堂云。有解问话者。置将一问来。僧出礼拜云。请师鉴。师云。抛钓钓鲲鲸。钓得个虾蟆。僧云。和尚莫错。师云。朝走三千暮走八百作么生。无语。师便打</p><p>上堂僧问。如何是本源。师拈起拄杖云。若是提起即向上去也。僧又问。如何是本源。师云。南赡部洲。北郁单越。问普贤为什么骑象。文殊为什么骑师子。师云。我也无象也无师子。且骑佛殿出三门去也。问如何是教意。师云。山河大地。又云。正好辨犹是曲说教意。若约提纲即未在。问一切智通无障碍时如何。师云。扫地泼水。相公来问。随流认得性时如何。师云。东堂月朗西堂闇。问如何是三乘教外别传底事。师云。尔若不问我即不答。尔若问我即朝到西天暮归唐土。僧云。乞师指示。师云。一不成二不是。问如何是祖师西来意。师云。青天白日[穴/(爿*臬)]语作么。问如何是佛法大意。师云。日里麒麟看北斗。问学人到这里。为什么。道不得。师云。野狐窟里坐。问不落古今是何曲调。师拽拄杖便下座。问如何是佛法大意。师云。面南看北斗。问古人斩蛇意旨如何。师便打。问如何是和尚家风。师云。阇梨<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>太早。问如何是宾中主。师云。骑一问。进云。如何是主中主。师云。叉手着。进云。宾主相去多少。师云。如眼如目。进云。合谈何事。师云。三九二十七。问自到和尚法席不会。乞师指示。师云。截却尔头得么。问乞师指示。令学人顿息昏迷。师云。襄州米作么价。问二尊相见时如何。师云。不是偶然</p><p>上堂云。天帝释与释迦老子在中庭里。相争佛法甚闹。便下座。问如何是曹溪的的意。师云。老僧爱嗔不爱喜。进云。为什么如此。师云。路逢剑客须呈剑。不是诗人不献诗。问二尊相见共谈何事。师云。不决即道。问人天交接其意如何。师云。对众呈机</p><p>上堂云。和尚子且须明取衲僧鼻孔。且作么生是衲僧鼻孔。乃云。摩诃般若波罗蜜。今日大普请。便下座。问如何是西来意。师云。山河大地。进云。向上更有事也无。师云有。进云。如何是向上事。师云。释迦老子在西天。文殊菩萨居东土。问父母俱丧时如何。师云。俱丧且置。那个是尔父母。僧云。苦痛深。师云。酌然酌然。问如何是大施主。师云。对机不辨。问彻底冥蒙底人来。师如何拯济。师云。两重公案一状领过。问说教当为何人。师云。近前来高声问。僧近前问。师便打。问和尚年多少。师云。七九六十八。进云。为什么七九六十八。师云。我为尔减却五年</p><p>上堂云。和尚子直饶尔道有什么事。犹是头上安头。雪上加霜。棺木里眨眼。炙盘上更着艾爝。这个是一场狼藉不少也。尔合作么生。各自觅个托生处好。莫空游州猎县。秖欲得揑搦闲言语。待老和尚口动。便问禅问道。向上向下。如何若何。大卷抄将去。[祝/土]向皮袋里。卜度到处火炉边三个五个聚头举口。喃喃地便道。这个是公才语。这个是就处打出语。这个是事上道底语。这个是体。语体汝屋里老爷老娘。噇却饭了。秖管说梦便道。我会佛法了也。将知与么行脚。驴年得休歇么。更有一般底。才闻说个休歇处。便向阴界里闭目合眼。老鼠孔里作活计。黑山下坐。鬼趣里体当便道。我得个入路也。还梦见么。这一般底打杀万个。有什么罪过。唤作打底。不遇作家。至竟秖是个掠虚汉。尔若实有个见处。拈将来看。共汝商量莫空过。不识好恶。[誌-士+匆][誌-士+匆]詷詷地聚头说葛藤。莫教老僧见。捉来勘。不相当槌折腰。莫言不道。汝皮下还有血么。到处自欲受屈作么。这灭胡种。尽是野狐群队。总在这里作么。以拄杖一时趁下。问十方薄伽梵一路<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>门。如何是一路涅槃门。师云。我道不得。进云。和尚为什么道不得。师云。是尔举话即得。问如何是法说。师云。大众久立速礼三拜。如何是随意说。师云。晨时有粥斋时有饭。如何是随宜说。师云。<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>六味施佛及僧。如何是方便说。师云。是汝鼻孔重三斤半。如何是大悲说。师云。归依佛法僧。问生死根源即不问。如何是目前三昧。师云。吃嘹舌头三千里。进云。今日得遇和尚也。师云。放尔三十棒。问乞师指示。师云。上大人丘乙巳。进云。学人不会。师云。化三千七十士。问不离三德六味。还有佛法也无。师云。秖怕尔不问。进云。请师道。师云。三德六味施佛及僧</p><p>上堂云。眼睫横亘十方。眉毛上透乾坤下透黄泉。须弥山塞却汝咽喉。还有会处么。若会得。拽取占波国。共新罗国斗额</p><p>上堂云。江西即说君臣父子。湖南即说他不与么。我此间即不如此。良久云。汝还见壁么</p><p>上堂云。去去递相钝置。有什么了时。却问众云。我与么道。还有过么。问如何是祖师西来意。师云。一不得问。进云喏。师咄云。话也不领。问今日供养罗汉。罗汉还来也无。师云。汝若不问。我即不道。进云。请师道。师云。三门头合掌。佛殿里装香。问如何是衲僧本分事。师云。南有雪峰北有赵州。进云。请和尚不繁辞。师云。不得失却问。学云喏。师便打。问承古有言。会即事同一家。不会即离牙擗齿。如何得事同一家。师云。乱走作么</p><p>上堂云。从上来且是个什么事。如今抑不得已。且向汝诸人道。尽大地有什么物。与汝为对为缘。若有针锋。与汝为隔为碍。与我拈将来。唤什么作佛作祖。唤什么作山河大地日月星辰。将什么为四大<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。我与么道。唤作三家村里老婆说话。忽然遇着本色行脚汉。闻与么道。把脚拽向阶下。有什么罪过。虽然如此。据个什么道理便与么。莫趁口快向这里乱道。须是个汉始得。忽然被老汉脚跟下寻着。勿去处打脚折。有什么罪过。既与么。如今还有问宗乘中话么。待老汉答一转了。东行西行。有僧拟问次。师以拄杖劈口打。便下座。问师子嚬呻时如何。师云。嚬呻且置。试哮吼看。僧应喏。师云。这个是老鼠啼</p><p>上堂云。我有一句语。不敢望尔会。还有人举得么。良久云。将谓胡须赤。更有赤须胡。便下座</p><p>上堂云。不得已且作死马医。向汝道。是个什么。是东是西是南是北。是有是无是见是闻。是向上是向下。是与么是不与么。这个唤作三家村里老婆说话。是尔有几个到此境界。相当即相当。不相当静处萨婆诃。便下座</p><p>上堂云。诸方老和尚道。须知有声色外一段事。似这个语话。诳[言*(穴/卒)]人家男女。三间法堂里独自妄想。未曾梦见我本师宗旨在。作么生消得他信施。腊月三十日。个个须偿他始得。任汝勃跳去。是尔诸人各自努力。珍重。问目前无一法。还免得生死不。师云。尔驴年未免得在。问如何是道。师云去。进云。学人不会。乞师道。师云。阇梨公验分明。何在重判。问维摩一默还同说也无。师云。痛领一问。进云。与么则同说也。师云。适来道什么。问如何是清净法身。师云。花药栏。进云。便与么会时如何。师云。金毛师子</p><p>上堂因闻钟鸣。乃云。世界与么广阔。为什么钟声披七条</p><p>上堂云。不可雪上加霜去也。珍重。便下座</p><p>上堂云。诸方老秃奴。曲木禅床上座地。求名求利。问佛答佛。问祖答祖。屙屎送尿也。三家村里老婆传口令相似。识个什么好恶。总似这般底。水也难消</p><p>上堂云。人人自自有光明在。看时不见暗昏昏。便下座。师入京在受春殿。圣上问。如何是禅。师云。皇帝有敕臣僧对。师在文德殿赴斋。有鞠常侍问。灵树果子熟也未。师云。什么年中得信道生</p><p>上堂云。尔诸人无端走来这里觅什么。老僧秖解吃饮屙屎。别解作什么。尔诸方行脚参禅问道。我且问。尔诸方参得底事作么生。试举看。又云。中间[言*(穴/卒)]汝屋里老爷得么。向老汉[月*屈]臀后。觅得些子睇唾嚼。将为自己便道。我解禅解道。饶尔念得一大藏教。拟作么生去。古人事不得已。见尔乱走。向汝道菩提涅槃。是埋没尔。是钉橛系却尔。又见尔不会。向汝道。非菩提涅槃。知是般事。早是不着便也。又更觅他注解这般底。灭胡种族。从上来总似这般。何处到今日。我向前行脚时。有一般人与我注解。他是不恶心。被我一日觑见是一场笑具。是我三五年不死。这般灭胡种底一斧打折脚。如今诸方大有出世纽揑。尔何不去彼中。在这里觅什么干屎橛。师便下地。以拄杖一时打趁下去。问如何是万法一决。师云。莫教失却问。问死中得活时如何。师云。朝行三千夜行八百。问大众云集合谈何事。师云。今日<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>令行去也。僧礼拜。师便打。问如何是学人自己。师云。怕我不知。问如何是透法身句。师云。海晏河清。道士问。视听无声无形老君说了也。云门一句请师指示。师云。迢然西天路。士无语。师拟下座。士云。再请师举扬宗旨。师云。道得底出来。众无对。师云。与么则辜负请主去也。便下座</p><p>上堂。大众集定。师乃拈起拄杖云。不得已且向这里会取。看看三门在露柱上。便下座</p><p>十二时歌</p><p>夜半子愚夫说相似 鸡鸣丑痴人捧龟首 平旦寅晓何人 日出卯韩情枯骨咬 食时辰历历明机是误真 禺中已去来南北子 日南午认向途中苦 日昳未夏逢说寒气 晡时申张三李四会言真 日入酉恒机何得守 黄昏戌看见时光谁受屈 人定亥直得分明沈<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a></p><p>偈颂</p><p>云门耸剔白云低。水急游鱼不敢栖。入户已知来见解。何劳更举轹中泥</p><p>药病相治学路医。扶篱摸壁小儿戏。幽谷不语谁人测。管解师承孰不知</p><p>康氏圆形滞不明。魔深虚丧击寒冰。凤羽展时超碧汉。晋锋八博拟何凭</p><p>是机是对对机迷。辟机尘远远机栖。夕日日中谁有挂。因底底事隔情迷</p><p>太阳溢目极玄微。谁人说道我渠非。句中有路人皆响。觌面难遭第一机</p><p>草岁依山人事稀。松下相逢话道奇。锋前一句超调御。拟问如何历劫违</p><p>玩古松高云不齐。鸿鸧鹤抱几年栖。剖[穀-禾+卵]同时殊有异。羽张腾汉碧霄低</p><p>万象森罗极细微。素话当人却道非。相逢相见呵呵笑。顾伫停机复是谁</p><p>话尽途中事。言多何省机。贵人言是妙。上士见知亏</p><p>大道何曾讨。无端入荒草。卷来复卷去。不觉虚生老</p><p>上不见天下不<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>。塞却咽喉何处出气。笑我者多哂我者少</p><p>丧时光藤林荒。图人意滞肌尪</p><p>举不顾即差互。拟思量何劫悟</p><p>咄咄咄力口希。禅子讶中眉垂</p><p>抽顾颂 鉴咦</p><p>云门匡真禅师广录卷上</p><p>住福州鼓山圆觉宗演校勘</p><p>云门匡真禅师广录 卷中</p><p>门人明识大师赐紫守坚集</p><p>室中语要一百八十五则</p><p>垂示代语二百九十则</p><p>室中语要</p><p>师示众云。尽十方世界乾坤大地。以拄杖一画百杂碎。三乘十二分教达磨西来。放过即不可。若不放过。不消一喝</p><p>师示众云。西天二十八祖唐土六祖天下老和尚。总在拄杖头上。直饶会得。倜傥分明。秖在半途。若不放过。尽是野狐精</p><p>师一日云。古来老宿皆为慈悲之故有落草之谈。随语识人。若是出草之谈。即不与么。若与么便有重话会语。不见仰山和尚问僧。近离甚处。僧云。庐山。仰山云。曾游五老峰么。僧云。不曾游。仰山云。阇梨不曾游山。师云。此语皆为慈悲之故有落草之谈</p><p>师有时云。若言即心即佛。权且认奴作郎。生死涅槃恰似斩头觅活。若说佛说祖。佛意祖意大似将木槵子换却尔眼睛相似</p><p>举古云。闻声悟道见色明心。师云。作么生是闻声悟道见色明心。乃云。<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>将钱来买糊饼。放下手云。元来秖是馒头</p><p>师有时云。灯笼是尔自己。把钵盂噇饭饭。不是尔自己。有僧便问。饭是自己时如何。师云。者野狐精三家村里汉。复云来来不。是尔道饭是自己。僧云是。师云。驴年梦见。三家村里汉</p><p>师有时云。真空不坏有。真空不异色。僧便问。作么生是真空。师云。还闻钟声么。僧云。此是钟声。师云。驴年梦见么</p><p>举疎山和尚问僧。什么处来。僧云。岭中来。山云。曾到雪峰么。僧云。曾到。山云。我已前到时是事不足。如今作么生。僧云。如今足也。山云。粥足饭足。无语。师云。粥足饭足</p><p>举孚上座参雪峰。峰闻乃集众。孚到法堂上顾视雪峰。便下看知事。明日却上礼拜云。某甲昨日触忤和尚。峰云。知是般事便休。时有僧问师。作么生是触忤和尚处。师便打</p><p>举僧问资福。古人拈槌竖拂意旨如何。福云。古人与么那。僧云。拈槌竖拂又作么生。福便喝出。师云。古人是什么眼目。僧云。和尚作么生。师云。驴年会么。僧无对。师复召僧来来。僧近前。师以拂子蓦口打</p><p>举三平颂云。即此见闻非见闻。师云。唤什么作见闻。无余声色可呈君。师云。有什么口头声色。个中若了全无事。师云。有什么事。体用无妨。分不分。师云。语是体体是语。复拈起拄杖云。拄杖是体。灯笼是用。是分不分。不见道。一切智智清净</p><p>举一宿觉云。幻化空身即法身。师拈起拄杖云。尽大地不是法身</p><p>举僧问赵州。某甲乍入<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。乞师指示。州云。吃粥了也未。僧云。吃粥了也。州云。洗钵盂去。师云。且道有指示无指示。若道有指示。向他道什么。若道无指示。者僧何得悟去</p><p>举僧问雪峰。乞师指示。峰云。是什么。其僧于言下大悟。师云。雪峰向伊道什么</p><p>师有时云。平地上死人无数。过得荆棘林是好手。僧云。与么则堂中第一座有长处也。师云。苏噜苏噜</p><p>举无情说法。忽闻钟声云。释迦老子说法也。蓦拈起拄杖问僧。者个是什么。僧云。拄杖子。师云。驴年梦见</p><p>师一日云。三家村里卖卜。东卜西卜忽然卜着也不定。僧便问。忽然卜着时如何。师云。伏惟</p><p>师有时云。大用现前不存轨则。僧便问。如何是大用现前。师乃拈拄杖高声唱云。释迦老子来也</p><p>师有时以拄杖打火炉一下。大众眼目定动。师乃云。火炉勃跳上三十三天见么见么。众无语。师云。无智人前莫说打尔头破百裂</p><p>师有时云。看看法身变作灯笼。超佛越祖之谈从尔脚跟下过也。僧云。脚跟下认得时如何。师云。钝置杀我。僧云。与么则逈然不在者里也。师云。十万八千</p><p>举槃山语云。光境俱忘。复是何物。师云。直饶与么道。犹在半途。未是透脱一路。僧便问。如何是透脱一路。师云。天台华顶赵州石桥</p><p>举仰山云。如来禅即许师兄会。僧便问。如何是如来禅。师云。上大人。又拈起扇子云。我唤作扇子。尔唤作什么。僧无语。师云。扇子上说法。灯笼里藏身。作么生。僧却问。如何是和尚禅。师叱云。元来秖在者里</p><p>举雪峰唤僧近前来。僧近前。峰云去。师举了问僧。尔作么生道得叉手句。尔若道得叉手句。即见雪峰</p><p>举三祖云。一心不生万法无咎。师云。秖者里悟了。乃拈起拄杖云。乾坤大地有什么过。</p><p>举一宿觉云。一切数句非数句。与吾灵觉何交涉。师云。行住坐卧不是灵觉。唤什么作数句</p><p>举槃山云。光境俱忘。复是何物。师云。东海里藏身。须弥山上走马。复以拄杖打床一下。大众眼目定动。乃拈拄杖趁散云。将谓灵利者漆桶</p><p>举僧问干峰。十方薄伽梵一路涅槃门。未审路头在什么处。峰以拄杖划云。在者里。师拈起扇子云。扇子勃跳上三十三天。筑着帝释鼻孔。东海鲤鱼打一棒。雨似盆倾相似。会么</p><p>师有时云。诸方拈槌竖拂云会么。但云莫压良为贱。却云是是。待伊拟议便打</p><p>举教云。心生种种法生。心灭种种法灭。乃拈起拄杖云。重多少。僧云半斤。师云。驴年梦见</p><p>举夹山语云。百草头上荐取老僧。师合掌云。不审不审。又以拄杖指露柱云。夹山变作露柱也。看看</p><p>举仰山问僧。近离甚处。僧云向南。山拈起拄杖云。彼中还说者个么。僧云不说。山云。不说者个。还说那个么。僧云不说。山召大德参堂去。其僧便去。山复召其僧。僧应喏山云。近前来。僧近前。山便打。师云。仰山若无后语。争识得人</p><p>举雪峰唤僧近前来。僧近前。峰云。甚处去。僧云。普请去。峰云去。师云。此是随语识人</p><p>举参同契云。回互不回互。师云。作么生是不回互。乃以手指板头云。者个是板头。作么生是回互。师云。唤什么作板头</p><p>举见闻觉知无障碍。声香味触常三昧。师云。一切处不是三昧。行时不是三昧。有处云。声香味触体在一边。声香味触在一边。见解偏枯</p><p>举夹山坐次。洞山到来。云作么生。夹山云。秖与么。师代洞山云。不放过又作么生。代夹山便喝。师又拈夹山云。秖与么。元来秖在虾蟆窟里。又云。秖与么。也难得</p><p>举祖师偈云。法法本来法。师云。行住坐卧不是本来法。一切处不是本来法秖如山河大地与尔日夕着衣吃饭。有什么过。又云。法本法无法。师拈起拄杖云。不是本无法</p><p>举傅大士颂云。空手把锄头。步行骑水牛。师云。是尔从向北骑一头水牯牛到这里。乃拈起拄杖云。不见道。千头万头到这里但识取一头</p><p>举宝公云。如我身空诸法空。千品万类悉皆同。师云。尔立不见立。行不见行。四大五蕴不可得。何处见有山河大地来。是尔每日把钵盂噇饭。唤什么作饭。何处更有一粒米来</p><p>举一切声是佛声。一切色是佛色。师拈起拂子云。是什么。若道是拂子。三家村里老婆禅也不会</p><p>举南方禅客问国师。此间佛法如何。国师云。身心一如。身外无余。师云。山河大地何处有也</p><p>师有时云。要识祖师么。以拄杖指云。祖师在尔头上勃跳。要识祖师眼睛么。在尔脚跟下。又云。这个是祭鬼神茶饭。然虽如此。鬼神也无厌足</p><p>师有时云。若说菩提涅槃真如<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。是烧枫香供养尔。若说佛说祖。是烧黄熟香供养尔。若说超佛越祖之谈。是烧瓶香供养儞。归依佛法僧下去</p><p>师一日拈起拄杖举。教云。凡夫实谓之有。二乘析谓之无。缘觉谓之幻有。菩萨当体即空。乃云。衲僧见拄杖但唤作拄杖。行但行坐但坐。总不得动着</p><p>举夹山语云。百草头上荐取老僧。闹市里识取天子。又云。一尘才起大地全收</p><p>举雪峰云。三世诸佛向火焰上转大法轮。师云。火焰为三世诸佛说法。三世诸佛立地听</p><p>师因吃茶了。拈起盏子云。三世诸佛听法了。尽钻从盏子底下去也。见么见么。若不会。且向多年历日里会取</p><p>举槃山语云。光非照境。境亦非存。光境俱忘。复是何物。师云。尽大地是光。唤什么作自己。尔若识得光去。境亦不可得。有什么屎光境。光境既不可得。复是何物。又云。此是古人慈悲之故重话会语。者裹倜傥分明去。放过即不可。若不放过复举手云。苏卢苏卢</p><p>举傅大士云。禅河随浪静。定水逐波清。师拈拄杖指灯笼云。还见么。若言见。是破凡夫。若言不见。有一双眼在。尔作么生会。良久复拈拄杖云。尽大地不是浪。师有时拈拄杖打床一下云。一切声是佛声。一切色是佛色。尔把钵盂噇饭时有个钵盂见。行时有个行见。坐时有个坐。见者般底作与么去就。把棒一时趁散。师有时拈起拂子云。者里得个入处去揑怪也。日本国里说禅。三十三天有个人出来唤云。吽吽。特库儿。担枷过状</p><p>举古人道。一处不通两处失功。两处不通触途成滞。师拈起拄杖云。山河大地三世诸佛尽在拄杖头上。有甚滞碍。如今明也暗向什么处去。秖者明便是暗。一切众生秖被色空明暗隔碍。便见有生灭之法</p><p>举一宿觉云。六般神用空不空。一颗圆光色非色。师拈起拂子云。者个是圆光。是色非色。唤什么作色。与我拈将来看</p><p>举夹山云。百草头上荐取老僧。闹市里识取天子。师云。虾蟆入尔耳朵里。毒蛇穿尔眼睛中。且向葛藤处会取</p><p>举十方薄伽梵一路涅槃门。师云。尔若不识。大食国里人。在尔眼睫里卖香药</p><p>举般若经云。无二无二分。无别无断故。师乃指露柱云。与般若经相去多少</p><p>举经云。经书咒术一切文字语言。皆与实相不相违背。师拈拄杖云。者个是什么。若道是拄杖入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。不是拄杖是什么</p><p>师一日拈拂子摵一下云。日月星辰扑落地上。见么。良久起身云。近后突着尔眼睛</p><p>举十方薄伽梵一路涅槃门。师云。者个是屋上头是天。手里是拄杖。作么生是涅槃门</p><p>师有时云。弹指謦欬扬眉瞬目拈槌竖拂。或即圆相。尽是撩钩搭索。佛法两字未曾道着。道着即撒屎撒尿</p><p>举瓦官参德山。瓦官为侍者。同入山斫木。德山将一椀水与瓦官。官接得便吃却。山云会么。官云不会。山又将一椀水与瓦官。官接得又吃却。山云会么。官云不会。山云。何不成褫取那不会底。官云不会。又成褫个什么。山云。子大似个铁橛。瓦官住院后。雪峰去访茶话次。峰云。当时在德山会里。斫木<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>作么生。官云。先师当时肯我。峰云。和尚离先师太早。其时面前有一椀水。峰云。将水来。官便过与雪峰。峰接得便泼却。师代云。莫压良为贱</p><p>因斋次。将糊饼一咬云。咬着帝释鼻孔。帝释害痛。复以拄杖指云。在尔诸人脚跟下。变作释迦老子。见么见么。阎罗王闻说。呵呵大笑云。者个师僧相当去。不奈尔何。若不相当。总在我手里</p><p>师有时以拄杖打床一下云。尔若是个汉。忽然者里闻声悟了。一切山河大地日月星辰有什么过</p><p>举洛浦云。一尘才起大地全收。师云。鸟窠拈布毛。便有人悟去</p><p>因吃茶次。举一宿觉云。三身四智体中圆。八解六通心地印。师云。吃茶时不是心地印。乃拈拄杖云。且向者里会取</p><p>举僧问雪峰。如何是触目菩提。峰云。好个露柱。有处云。还见露柱么。师拈起拄杖云。有底体上会事。见露柱秖唤作露柱。有处道。不见有露柱。见解偏枯。见露柱但唤作露柱。见拄杖但唤作拄杖。有什么过</p><p>举僧问灵云。佛未出世时如何。灵云竖起拂子。僧云。出世后如何。云亦竖拂子。师云。前头却实。后底打不着。又云。不说出不出。何处有一问时节。秖如雪峰。夏末于僧堂前坐。众才集。峰拈起拄杖云。者个为中下根人。便有僧问。忽遇上上人来时如何。峰拈起拄杖。师云。我不似雪峰打破狼藉。僧便问。未审和尚如何。师便打</p><p>举僧问玄沙。如何是学人自己。沙云。是尔自己。师云。没量大人被语脉里转却。有僧问。如何是学人自己。师云。忽然路上有人。唤衲僧斋。尔也随例得饭吃</p><p>师因斋次。拈起糊饼云。我秖供养江西两浙人。不供养向北人。僧云。为什么秖供养江西两浙人。不供养向北人。师云。天寒日短。两人共一椀</p><p>举国师云。南方佛法半生半灭。此间身心一如身外无余。师云。唤什么作身心一如。又云。汝等要识国师底么自代云。不可辜负国师去也</p><p>举肃宗帝请国师看戏。国师云。有什么身心看戏。帝再请。国师云。幸自好戏。师云。龙头蛇尾</p><p>举国师三唤侍者。侍者三应。国师云。将谓吾辜负尔。谓知尔辜负吾。师云。作么生是吾辜负尔处。尔若会得。也是无端。又云。作么生是侍者辜负国师处。师云。粉骨碎身未报得</p><p>举药山问僧。什么处来。僧云。湖南来。山云。洞庭湖水满也未。僧云未满。山云。许多时雨水为什么未满。云岩代云。湛湛地。洞山代云。什么劫中曾欠少。师云。秖在这里</p><p>举雪峰云。饭箩边坐饿死人。临河渴死汉。玄沙云。饭箩里坐饿死汉。水里没头浸渴死汉。师云。通身是饭。通身是水</p><p>举僧问资福。古人拈槌竖拂意旨如何。福云嗄。师云。雪上加霜</p><p>举僧问资福如何是一尘入正受。福作入定势。僧云。如何是诸尘三昧起。福云。尔问阿谁。师云。这阿师话堕也不知。又云。前头早是葛藤。又道。尔问阿谁</p><p>举茱萸上堂云。尔诸人莫向虚空里钉橛。时有灵虚上座。出众云。虚空是橛。茱萸便打。<a href=\"/remen/xuyun.html\" class=\"keylink\" target=\"_blank\">虚云</a>。和尚莫错打某甲。萸便归方丈。师云。屎上加尖。僧云。和尚适来与么道那。师云。槌钟谢响。得个虾蟆出来</p><p>举僧问投子。密岩意旨如何。子云。须是与么人始得。赵州云。何不与他本分草料。师问僧。作么生是本分草料。僧拟议。师便打</p><p>举古云。寂寂空形影。师展两手云。山河大地何处得也。又云。一切智通无障碍。师云。拄杖走到西天。却归新罗国里。乃敲床云。这个是尔鼻孔</p><p>举僧问夹山。如何是道。山云。太阳溢目万里不挂片云。师云。不唤作一句。不唤作法身。是什么</p><p>僧问。如何是学人自己。师云。老僧入泥入水。僧云。某甲粉骨碎身去也。师喝云。大海水在尔头上。速道速道。僧无语。师代云。也知和尚恐某甲不实</p><p>师有时云。直得乾坤大地无纤毫过患。犹是转句。不见一色始是半提。直得如此。更须知有全提时节</p><p>师有时云。泡幻同无碍。一切处不是幻。一切处不是无碍</p><p>师有时云。横说竖说菩提涅槃真如<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。总是向下商量。直得拈槌竖拂时节。亦是横说竖说。对前头犹较些子。僧问。请师向上道。师云。大众久立。速礼三拜</p><p>举崇寿问僧。还见灯笼么。僧无语。师代云。推倒灯笼</p><p>举赵州问僧。什么处去。僧云。摘茶去。师云。闭口</p><p>举法身说法。青青翠竹尽是法身。未是提纲拈掇时节</p><p>举有为无三世。无为有三世。有为是断灭法。何处得三世。无为有三世。不是守寂处法</p><p>举实学是葛藤言句。拈槌竖拂时节。于实学犹在半途</p><p>举三种人。一人因说得悟。一人因唤得悟。第三人见举便回去。尔道。便回去意作么生。复云。也好与三十棒</p><p>举法身吃饭。早是剜肉作疮。将谓合有与么说话</p><p>举僧问云居。湛然时如何。居云不流。师云。不流说什么湛然。又云。此是截铁之言</p><p>举药病相治。尽大地是药。那个是尔自己。师云。遇贱即贵。僧云。乞师指示。师拍手一下拈起拄杖云。接取拄杖子。僧接得拗作两截。师云。直饶与么。也好与三十棒</p><p>举翠岩夏末上堂云。我一夏已来与师僧说话。看翠岩眉毛在么。保福云。作贼人心虚。长庆云。生也。师云关。师有时云。不敢望尔有逆水之波。且有顺水之意也难得。乃举。良遂初参麻谷。谷见来便去锄草。良遂到锄草处。谷都不顾。便归方丈闭却门。良遂连三日去敲门。至第三日才敲门。麻谷问阿谁。良遂云。和尚莫瞒良遂。若不来礼拜和尚。洎被经论赚过一生。师云。便有逆水之波。如今得入是顺水之意。亦唤作双放时节。又云。麻谷问阿谁。良遂道。莫瞒良遂。不是识破麻谷相见时节。若不来礼拜和尚。洎被经论赚过一生。亦知有赚人处。自后良遂归京辞皇帝及左右街大师大德。再三相留。茶筵次。良遂云。诸人知处良遂总知。良遂知处诸人不知。师云。作么生是良遂知处</p><p>举<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>云。无眼耳鼻舌</p></div>"
}]