[{
    "title": "四明尊者教行录 第一卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第一卷 (并序)</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>陈隋两国师天台智者。悟<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>旋陀罗尼。嗣法性宗。以无碍辩才。剖判三世佛乘。开辟一家教观。人到于今承之。外有诸忏制法两朝敕文建寺碑刻等。门<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>章安禅师。集之成书。号国清百录。特蒙仁宗皇帝赐入大藏。同佛典诰流行。至是殆无余蕴矣。然吾祖之道化被六十州。盛于隋唐。衰于五代。法不终否。至人利见。石晋天福中有通公法师。(讳义通)来自高丽。南参</p><p>螺溪(即天台山螺溪院[羲-ㄎ+乃]寂法师也)尽得天台一宗之道。复欲杭海。大帅钱公固留之(钱讳惟治。吴越王之子。时判明州也)。遂传洪于明之宝云(宝云乃福州运使顾承徽舍宅造寺。以处于师)。法席大开。得二神足而起家。一曰法智师(讳知礼)。一曰慈云师(讳遵式)。法智尸延庆道场。中兴此教。时称四明尊者。慈云建<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>法席。峙立解行。世号<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>忏主。慈云生乾德二年。终明道之初。历一百二十载。五世孙(慧观)师。裒其遗文。成金园三集。行于世。法智生建隆改元。终天圣六祀。距今已一百七十有五年矣。所撰记钞三十余万言。学者共宗。复有教门义章问答释妨巨儒高释往返书启等。断简残篇存者流逸。呜呼。师一心讲忏传持四十年。胁不沾床。其应缘染翰。宁可以数量计。纵刊之于木石。书之于竹帛。亦千万之一耳。(宗晓)末学无似。叨预教庠。窃睹师之垂言。虽片文只字。咸为释氏之法。岂得以任其芜没哉。于是剧意访求。仅得一百余篇。以类铨次析为七卷。目之曰四明尊者教行录。四明乃所生得道转法轮地。世珍其为人。咸以是而称之。台宗户牖莫不依教立行以行显教。庶教行二途成<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>一辙。师尝勖众言。吾之或出或处。或语或默。未始不以教观之旨为服味为杖几。今录取以教行为名。亦尊者之志焉。大哉斯文既就。愿与国清百录天竺金园。鼎足而行。贻诸后代。共期祖道也。其乎未尽者。后贤随见闻而续之。斯又尽善美矣。旹嘉泰二年壬戌岁腊月既望<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>(宗晓)谨序</p><p>尊者年谱</p><p>大宋太祖皇帝初登宝位。改周显德七年为建隆。元年庚申。此年正月。太祖受周恭帝禅。谨按胡昉撰塔铭并门人则全实录。师寿六十九。示灭天圣六年戊辰岁。若准赵清献公所作行业记。则云天圣五年归寂。误矣。今逆推甲子。师乃当庚申年降诞。岂非真人应运而贤哲间生乎。师讳(知礼)。字约言。真宗特赐法智大师之号。时称四明尊者。俗姓金。前汉金日磾之远裔(西<a href=\"/ctwh/shi/24s/hanshu.html\" class=\"keylink\" target=\"_blank\">汉书</a>曰。金日磾匈奴休屠王之子。夷狄亡国。覊虏汉武。而笃敬忠孝。七世内侍。本以休屠作金人为祭天主故。因赐姓金氏)后代为鄞人也。父讳经。母李氏。初以嗣息未生。诚志祈佛。偶夜梦。梵僧遗一子云。是罗睺罗。泊生因以为名</p><p>二年辛酉 三年壬戌 乾德元年癸亥 二年甲子 三年乙丑</p><p>四年丙寅。时年七岁。塔铭曰。师年七岁属母丧。谓劬劳匪易报。且号泣而不绝。由兹厌俗。急于<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。其父异之。遂不夺其志。始投太平兴国寺僧(洪选)为弟子。天竺作师指要钞序云。师在童子受经。便能思义。天机特发。不曰生知之上性者乎</p><p>五年丁卯 六年戊辰 是年改开宝元年 二年己巳 三年庚午 四年辛未 五年壬申 六年癸酉</p><p>七年甲戌。时年十五。塔铭曰。师年十五受具戒。而专探律部 八年乙亥</p><p>九年丙子。是年太宗皇帝即位。改太平兴国元年</p><p>二年丁丑 三年戊寅</p><p>四年己卯。时年二十岁。行业记曰。二十从本郡宝云通法师。传天台业观。始三日首座谓之曰。法界次第汝当奉持。师曰。何谓法界。座曰。大总<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍者是也。师曰。既圆融无碍。何有次第。座无对。居一月。自讲<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>。人皆骇听。而惊传之</p><p>五年庚辰。实录曰。师在宝云及二载。厥父偶梦。其跪于通之前。通执瓶水注于口。自尔圆顿之旨一受即了</p><p>六年辛巳。时年二十二。行业记云。师居宝云方三年。常代通师讲。入文消义。益阐所学</p><p>七年壬午 八年癸未 雍熙元年甲申 二年乙酉 三年丙戌 四年丁亥</p><p>端拱元年戊子。师听读宝云十载。即值本讲归寂。石塔记云。通公寿六十二。端拱元年倾逝(知礼遵式)。子衿之高者</p><p>二年己丑 三年庚寅。是年改淳化元年</p><p>二年丁卯。师年三十二。即中选住持。实录云。淳化辛卯。受请于乾符寺。绵历四祀。于保恩院。戒誓辞云。予居宝云。既值鹤林。始迁乾符寺西偏小院(乾符寺中改承天寺。今为能仁寺。西偏小院即今法华也)有寝无庙。学徙爰止。盈十莫容。又观其密迩阛阓。诚非久宜。遂徙此城东南隅。指要序曰。师主乾符讲席。诸子悦随。若众流会海</p><p>三年壬辰 四年癸巳 五年甲午 至道元年乙未</p><p>二年丙申。使帖云。至道二年七月。内院主僧居朗显通。舍保恩院与(知礼)。永作十方住持。传演天台智者教法。戒誓辞云。院丙申秋承旧。越十年陈修。己酉告成。石公勒石纪之。逮壬子凡十七年。咸安来学</p><p>三年丁酉。保恩院记云。先是此院缔造年深。颓毁日甚。以至道三年。乃与余杭释异闻。戮力经营。适值丹丘僧觉圆。<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>陈力。三载讫役。观其土木瓌丽金碧交辉。先佛殿而后僧堂。昭其序也。右藏教而左方丈。便于事焉</p><p>真宗皇帝即位改咸平。元年戊戌</p><p>二年己亥。时年四十岁。实录云。师自咸平二年已后。专务讲忏。当坐不卧。足无外涉。修谒都遣</p><p>三年庚子。是岁大旱。师与天竺忏主祈雨有感。行业记云。岁大旱。师与遵式同修光明忏。祈雨约三日。不降当然一手以供佛。佛事未竟。雨已大浃。慈云行业记云。咸平三年。四明大旱。师入忏摩。祈雨约三日。不雨当自焚。如期果应。太守苏为异之。题石纪其事</p><p>四年辛丑 五年壬寅</p><p>六年癸卯。是岁日本国师遣僧问难。本序曰。咸平六年癸卯岁。日本国僧寂照等。赍本国天台山源信禅师于天台教门致相违问目二十七条。四明(知礼)凭教略答。随问书之</p><p>景德元年甲辰。时年四十五。撰十不二门指要钞。序纪岁月云。景德元年甲辰正月九日叙 二年乙巳</p><p>三年丙午。是岁师上钱唐昭公十义书。序曰。景德三年[萉-巴+(日/(句-口+匕))]月。四明(知礼)。谨用为法之心。问义于浙阳昭上人</p><p>四年丁未。是岁上昭公观心二百问书。序曰。景德四年。四明比丘(知礼)。谨用为法之心。问义于浙阳昭讲主</p><p>大中祥符元年戊申</p><p>二年己酉。时年五十岁。建保恩院落成。戒誓辞云。院己酉告成。石公纪之。记末曰。待问通守竹符函亲松柄。会兹院告厥成功。遂抽毫而为识。时大中祥符二年己酉四月六日立</p><p>三年庚戌。是年恭奉圣旨。改保恩额。为延庆院。据四明图经曰。保恩院周广顺二年建。皇朝大中祥符三年改为延庆院。绍兴十四年改院为寺。使帖曰。大中祥符三年七月。内僧(知礼)。经使府陈状乞申奏天听。永作十方住持。长讲天台教法。当年十月。内准中书劄子。奉 圣旨依</p><p>四年辛亥。是年师再状经州乞给。使帖备录上项。圣旨上石永为照据。使帖曰。(知礼)续于大中祥符四年三月。内经州着状。乞备写圣旨并前后使帖。镌上石刻。永作十方传教住持。是年七月十七。给帖立石</p><p>五年壬子。是年师与异闻师。撰十方传教住持戒誓辞。立石永诫非理妄占。斯文真是寺万代十方住持之本也</p><p>六年癸丑。是年二月十五日。创建<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>施戒会。师于祥符五年十月。亲制<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>。至今诱化。此会抵今凡一百九十载不废。往古来今其被化者。不知几何人哉</p><p>七年甲寅。时制观经融心解。序末题云。大中祥符七年甲寅重阳日叙。是年师又有教门杂问七章。门人自仁答 八年乙卯</p><p>九年丙辰。时年五十七。实录云。师年五十七。誓愿修法华忏。三年忏满。焚身<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>妙经。誓生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a></p><p>天禧元年丁巳。塔铭曰。天禧改元之初。师年及耳顺。乃谓其徒曰。半偈亡躯。一句投火。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之心为法如是。吾不能捐舍身命以警发<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。胡足言哉。于是结十僧。修法华忏三年。忏满共焚。是时翰林学士杨亿。驸马都尉李遵勖。皆当朝文雄勋盛。每响师通悟。必望风推挹。其年诏赐紫<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>。皆二公论荐之所授也。又闻遗身。而杨公致书。确请住世。往复数番。至于专委州将保护。由是愿行不得而施矣。又着消伏三用章。出绛帏三十问。门人(仁岳)答。皆纪于此年也</p><p>二年戊午 三年己未</p><p>四年庚申。实录云。天禧四年。驸马李遵勖。录行实奏上。特赐法智大师号。是年京师僧职高流二十三人。各赋一诗纪赠于师。待制晁说之作序刊石。后择邻诗题曰。庚申季秋望日书</p><p>五年辛酉。时年六十二。是年朝廷宣赐命修忏法。行业记曰。真宗知师名。遣中贵至所居。命修法华忏法。厚有赐予。中贵俞源清也。师因俞子欲知忏法旨趣。为述修忏要旨。人到于今受其赐。又撰别行玄疏记。序题曰。天禧五年八月旦。又撰观经妙宗抄。序题曰。天禧五年重阳下笔序</p><p>乾兴元年壬戌</p><p>二年癸亥。是年仁宗皇帝即位。改天圣元年。是年制光明拾遗记。纪云。天圣元年四月望日序。师又为潘屯田。作梦鱼跋。又出问帏试问四十二章。考试学子。又答<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>泰师<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>十问 二年甲子</p><p>三年乙丑。真宗天禧初。有诏天下立<a href=\"/remen/fangsheng.html\" class=\"keylink\" target=\"_blank\">放生</a>池。师欲广圣化。每遇佛生朝。募众行放生业。于是立放生碑。枢密刘筠撰文。太守殿撰曾会立石。天圣三年七月十五日。霅溪僧(仁岳)书。师是年一夜忽梦。相公入院。翌日即曾大守之子到。后果符此梦。乃鲁国宣靖公也。由此楚国黄夫人置恒产供众。又上书曾太守乞申奏后园地。永在伽蓝。亦此年也</p><p>四年丙寅。是年师有授辞授门弟子(文璨)。石刻见存</p><p>五年丁卯。师制光明文句记六卷。于是岁题曰天圣五年[萉-巴+(日/(句-口+匕))]月三日记。然此记师迫归寂。不及终帙。而后门人广智(尚贤)法师。续记赞佛一品。方为足本</p><p>六年戊辰。是年师年六十九示灭。准实录等。天圣六年正月五日戌时。师端身跏坐。召大众<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>毕。骤称弥陀<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>数百声。奄然而逝。露龛示身。经二七日。爪发俱长。颜貌如生。复过七日。迁于南门之外。将阇维。次先闻异香馥郁。火灭得舌根不坏。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>五色不知其数。(舍利犹藏以琉璃瓶。奉安大悲阁上)越五年。至明道二年七月二十九日。奉灵骨。起塔于崇法院之左</p><p>(宗晓)伏读三朝僧传。十科选佛西圣之法取材尽矣。而吾祖法智以道供职。眇观著述洪演兴起大教。义解为首。造寺造像。营福次之。生于舌根舍利灭后俨然。神异有余。遗身之际。虽为杨文公劝请而止。岂以一时固阻外其道耶。矧复尝然三指以供佛。斯亦舍身之支派也。大哉往古高僧十法师其一而四焉。岂与夫事佛徒劳于百载者。同日而语乎</p><p>(旧本取指要别行玄记妙宗钞拾遗记光明句记大悲行法六序。附入此中。此既随文见行于世。因得以略)</p><p>授<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>仪 结念佛会疏 交法师授辞(附入) 璨法师授辞 放生文 梦鱼记(潘屯田作) 跋梦鱼记 敕放生池碑铭(旧有石刻)</p><p>菩萨戒仪(十二科)</p><p>第一求师授法 第二策导劝信 第三请圣证明 第四授三归依 第五召请圣师 第六白佛乞戒 第七<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>罪愆 第八问无遮难 第九羯么授戒 第十略说戒相 第十一发弘誓愿 第十二结撮<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a></p><p>第一求师授法</p><p>夫欲受此菩萨戒者。必先请师策导开解。于一切境起慈悲心。若非此人。戒无由发。今为现前大众。恭请某人。作授大乘菩萨戒师。各须一心随我陈请。若至某甲处。当称自己名</p><p>大德一心念。我某甲今于大德所。乞授一切菩萨净戒。惟愿不辞劳倦哀悯听受</p><p>第二策导劝信</p><p>现前同会清净大众。既共伸请欲求戒法。先须发于<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。信心若成。三学任运具足。三身四智<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>圆常。决定可期。更无疑虑。一者深信一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>皆有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。二者须信勤修胜行而证<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。三者谛信咸登佛果常乐我净。故经云。大众心谛信。汝是当<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。我是已成佛。常作如是信。戒品已具足。华严云。信是道源<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>母。长养一切诸善根。断除疑网出爱河。开示<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>无上道。是知若发信心必纳得戒。戒为万行之先锋<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>之基址。如造屋宅。先固其基。若无基址。徒架<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。必不成就。戒是大道之资粮。济海之船筏。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>大海非戒莫渡。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>法身以戒为璎珞。破除热恼以戒作清凉。戒经云。戒如明日月。亦如璎珞珠。微尘菩萨众由是成正觉。诸人者须信所受菩萨净戒。乃是十方三世诸佛成道根本。诸大菩萨修行轨范。戒经偈云。如过去诸佛。及以未来者。现在诸<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。皆共尊敬戒。萨遮尼干子经云。如来功德身。以<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>为本。以持戒为始。又云。若不持戒。尚乃不得疥癞野干之身。况功德法身。月灯<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>经云。虽有色力及多闻。若无净戒如禽兽。虽处卑下少闻见。能持净戒名胜士。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>云。戒是无上菩提本。应当具足持净戒。若能坚持于净戒。是则如来所赞叹。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。欲见佛性证大涅槃。必须深心修持净戒。梵网经云。众生受佛戒。即入诸佛位。若不受此戒。外道邪见人。畜生与木头。平等无有异。故知不受菩萨戒者。纵<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>法勤苦修行经千万劫。秖名众生。欲脱生死。欲破<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。欲成菩提。欲证佛果。终无得理。是故西天国王登位。百官上任。并先受此菩萨戒。盖欲<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>境邑人民故也。诸仁者宁可受已毁犯。则不可不受。纵或受已毁犯。还是佛之弟子。若不受者。名为外道。故经云。瞻卜华虽萎。犹胜一切华。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>诸比丘。犹胜诸外道。在会大众诸<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>等。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之中无量众生。受三途苦。不闻佛法。纵得为人。或处边夷。或遭乱世。或迷声色。或报愚痴。或着邪见。佛法难遇。谁肯信从。今共喜庆。识知<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。知有戒法可受。知有净土可生。可谓万劫难逢千生一遇。法华经云。佛法难值。时亦难遇。宿福深厚。生值佛法。诸人须念。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>迅速。生死难期。一旦命终。识神无主。欲受佛戒。无由可得宜各<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。努力求之。拨弃世缘。斋戒念佛。功成事办。必得超往安养净土。各获长生。受胜妙乐。然戒有多种。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>八戒名近住<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。若受是戒。但只近获人天<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。小乘二百五<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>名别别解脱戒。若受此戒。持一一条。各得解脱。然虽出离生死爱河。但趣小乘阿罗汉果。不能<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a><a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>佛性广化众生。今此菩萨<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>。若受之者。报圆佛果。相好无边。三达五眼。十力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。一切功德无不具足。即于此身。一念之中讫至成佛。具足八种殊胜功德。一者趣道场殊胜。当知受菩萨戒者。如大鹏鸟。举翅高飞。能至十万九千余里。菩萨发心受此大戒。能越六趣二乘径。趣无上菩提。坐于道场。二者发心殊胜。若人一念发大悲智之心。受菩萨戒。超过二乘境界。如昔有<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。侍一罗汉而行。忽发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。求受菩萨戒。此阿罗汉返生恭敬。为担衣钵。让路而行。三者<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>殊胜。假使有人。供养满阎浮提大阿罗汉。不如供养一发心受菩萨戒者。以彼运心广大故。四者功力殊胜。若受小乘戒者。犹如萤火。但能自照。受菩萨戒者。状似日光当午。一切普照。五者灭罪殊胜。诸人莫疑受戒不能坚持而不敢受。经云。受戒后破犯犹胜外道。不受戒者。外道邪见。永沉恶道。无有出期。破戒之人。以戒威力故。设堕恶道。受罪轻微。若堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中。作地狱中王。若堕畜生类。作畜生中王。若堕饿鬼数。作鬼神中王。若在人间。作人中王。若生天上。作天中王。生生之处。不失王位。经云。有犯名菩萨。有戒可破故。无犯名外道。无戒可破故。六者受胎殊胜。受戒之人若在胞胎。常为天龙善神而共守护。七者<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>殊胜。受戒之人以持戒力故。能搅长河为酥酪。变大地作黄金。能于一念中超越千生。能于一日内度无数众。八者果报殊胜。受戒之人即是菩萨当生莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>海受法性身。一得真常永不退转。如上广引诸经。为诸佛子开发行门。愿今诸人各于此座。纳得清净戒法。永作津梁。为见佛因。作净土业</p><p>第三请圣证明</p><p>现前大众。我今既为说法开导。须怀忻仰。向下更为迎请圣众。降临道场。证明护念。汝等各须专秉一心随我音声奉请(先启白)</p><p>维太岁某年某月日。南阎浮提大宋国某州县某处。今有众多男女。各发精诚。同禀净戒。邀迎<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>一切圣贤。愿赐护持。即希感降</p><p>一心奉请。尽虚空界微尘刹中。一切诸佛真应二身。一切道法。大小两乘。三乘等侣。一切圣贤。惟愿闻今奉请。降临道场。证明受戒</p><p>一心奉请。<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>诸天。功德大辩。梵释四王。龙鬼八部。天灵地祇。日月星宫。江河淮济。名山大川。州城分野。社稷聪明。守护斋戒。正直神司。惟愿闻今奉请。降临道场。坚守加护</p><p>一心奉请。十方法界六道四生。三才九类。一切含情。现前受戒合道场人。住居香火本命星辰。生身父母上代宗亲。惟愿承三宝力。俱到道场。同沾戒善</p><p>第四授三归依</p><p>上来召请三宝百灵。降临道场。同资戒善。当知此戒不间男<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>人。凡圣普会。幽显同沾。乃至畜生。但解法师语者。皆得受之。不同小乘但尽形寿。此菩萨戒。从今一受直至成佛。永无失坠。此下更为大众。翻邪向正。受三归依法。当知三宝乃一切众生之敬田。若能至诚恭敬归向。则能发生一切善法功德。然三宝者有乎多种。一曰住持三宝。二曰别相三宝。三曰一体三宝。言住持者。泥龛塑画是佛宝。黄卷赤轴是法宝。剃发染衣是僧宝。言别相者。修行契证妙觉果德法<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>化名佛宝。所说八万四千法藏十二部经名法宝。等觉已还三乘圣贤名僧宝。言一体者。上至诸佛。下至蠢动。无不具此三宝也。所谓实相妙体即一而三。名秘密藏。如世珍琦。通名为宝。即今诸人本有觉性是佛宝。此性无染清净是法宝。此性柔和无诤是僧宝。今劝诸人。不得自轻。人人本具斯理。一一咸得成佛。如来由<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>此一体三宝故。而能运大神通。兴诸佛事。此之三宝在汝身中。如水凝冰。弃冰求水。无有是处。若欲融冰。善宜方便。拟趣佛果。非修不克。今既觉知此体。正向此宝作归依处</p><p>弟子(某甲)愿从今日尽未来际。归依佛两足尊。归依法离欲尊。归依僧众中尊(三说)</p><p>上来虽为归依。若不结归。法不<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。理须三番结归</p><p>弟子(某甲)归依佛竟。归依法竟。归依僧竟(三说)</p><p>从今已往。称佛为师。更不归依邪魔外道。惟愿三宝哀怜摄受。慈悯故(三说)</p><p>第五召请圣师</p><p>上来已受三归依竟。而(某)但为传戒之人。今当更为现前大众。奉请释迦世尊等五座圣师。降临道场。向诸佛菩萨之前。求哀忏悔。问于遮难。方堪秉法。然请师之法理合自陈。想汝未能。我今教汝。汝当虔心。切莫容易</p><p>弟子(某甲)一心奉请释迦如来。为得戒和尚。我依和尚故。得受菩萨戒。慈慜故</p><p>弟子(某甲)一心奉请文殊师利菩萨。为羯么阿阇梨。我依羯么阿阇梨故。得受菩萨戒。慈慜故</p><p>弟子(某甲)一心奉请<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨。为教授阿阇梨。我依教授阿阇梨故。得受菩萨戒。慈慜故</p><p>弟子(某甲)一心奉请十方诸佛。为尊证师。我依尊证师故。得受菩萨戒。慈慜故</p><p>弟子(某)一心奉请诸大菩萨。为同学侣。我依同学侣故。得受菩萨戒。慈慜故</p><p>第六白佛乞戒</p><p>上来所请五座圣师。具大慈悲他心道眼。怜愍众生。拔苦与乐。必降道场。更为诸人。白佛乞戒。汝等各须志诚对佛合掌谛听作白(下座白佛)</p><p>仰白五座圣师十方尽虚空遍法界一切诸佛大地菩萨僧。此<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>某国州县诸弟子等。求我恭白诸佛菩萨乞受三聚净戒。此诸弟子已是真实发菩提心。能生深信。于此净戒誓愿学行。惟愿诸佛诸大菩萨。怜慜施与三聚净戒(三白竟归本座)</p><p>第七忏悔罪愆</p><p>上来恭白圣师已竟。将受戒法。畴念。汝等自从无始已来<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>厚重。无恶不为。身心不净。然此戒法乃是白净之法。身器清净方堪求受。是故应当求哀忏悔。如洗故衣方堪受色。矧乎如来灭度二千余年。<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>隐没。邪风广扇生。当此时。虽见佛闻法。不生信乐者有之。良由无明所覆见网交缠。若不改往修来。何由还源复本。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。今日道场同于佛前。发露罪根。各须一心志诚忏悔</p><p>弟子(某甲)至心忏悔。自从无始至于今日。未识佛时。未闻法时。未遇僧时。不信<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。汨没死生。动身口意。无恶不为。遇不善缘。近恶知识。乃至焚烧塔寺。诽谤大乘。侵损常住。污梵诬僧。犯诸禁戒。作不<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>十恶五逆轻重罪愆。身业不善。行杀盗淫。口业不善。妄言绮语恶口两舌。意业不善。起贪嗔痴。杀父。杀母。杀阿罗汉。破和合僧。出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。自作教他。见闻<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。如是等罪无量无边。今日披陈发露忏悔。惟愿三宝同赐哀怜。令我罪根一念霜融悉皆清净</p><p>第八问无遮难</p><p>上来奉为诸人行忏悔法。身器清凉堪受净戒。当受此戒。准经所说。若有七遮。即不得受。良由七种逆罪能障净戒。并名为遮。我今一一垂问。汝等有即言有。无即言无。当如实答</p><p>汝曾出佛身血否(答云无。此下列同此答)。汝曾杀父否。汝曾杀母否。汝曾杀得戒和尚否。汝曾杀阿阇梨否。汝曾破羯么转法轮僧否。汝曾杀阿罗汉否</p><p>第九羯么授戒</p><p>喜汝诸人无上七种遮难。已是纳戒之器。众圣同庆凡俗俱忻。千生万劫得幸遭逢。今则正当羯么受戒。须知此戒乃是十方三世诸佛菩萨积劫熏修。无量功德之所成就。汝等诸人当起深心生乎难遭之想。必使此法一念圆成。今正是时。切在翘勤倾仰。如器盛物。不得差泄。以是因缘。谛听谛听</p><p>佛子(某甲)一众人等谛听。汝今于我所。求受一切菩萨净戒一切菩萨学处。所谓摄律仪戒。摄善法戒。饶益有情戒。此诸净戒此诸学处。过去一切菩萨。已受已学已解已行已成。未来一切菩萨。当受当学当解当行当成。现在一切菩萨。今受今学今解今行今成。当来作佛。汝等从今身至于佛身。于其中间不得犯。能持否(三说。并答云能持)</p><p>汝等诸佛子须信。初番羯么已成。十方世界妙善戒法。由心业力。悉皆震动</p><p>此是第二番羯么已成。十方世界妙善戒法。犹如虚空。如云如盖。覆汝顶上</p><p>此是第三番羯么已成。而此戒法从汝顶门流入身心。非色非心。无形<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。不觉不知。充满正报。当知汝身汝心即是无边功德之聚。各须于三宝前生大庆快。切在志心护持。勿令毁犯</p><p>第十略说戒相</p><p>诸佛子等。上来依法授汝三聚妙戒竟。虽已得法。汝必未能谙于持犯之相。我今依梵网经十重四十八轻戒相。一一宣说。汝当谛听</p><p>第一不得<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。若<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>。教人杀。无慈悲心。非真菩萨。若有犯者得波罗夷罪。汝等从今身至佛身。于其中间不得犯。能持否(答云能持下去例此)</p><p>第二不得偷盗。若自若他。乃至鬼神官物一针一草。不得故盗。犯波罗夷罪。汝能持否</p><p>第三不得行邪淫。男子不得背己妻房。女人不得背夫通外。当以净法<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>众生。汝能持否</p><p>第四不得<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。有则言有。无则言无。不得为利妄语巧生诳妄言。须真实。汝能持否</p><p>第五不得酤卖诸酒。酒是昏乱起过之物。饮则昏蔽正性。能生三十六种过失。汝能持否</p><p>第六不得说人过非。乃至师长朋友当为掩恶扬善。汝今能持否</p><p>第七不得自赞毁他。当须恶事自向己。好事与他人。从今不得赞毁。汝能持否</p><p>第八不得悭吝财法。若人来求。随己所有。悉当与之。从今不得悭吝。汝能持否</p><p>第九不得生嗔恚心。一念嗔火能烧无量功德。死堕蛇中。由嗔招致。汝能持否</p><p>第十不得毁谤三宝。而三宝于诸众生有大恩德。乃是敬田。不当毁谤。汝能持否</p><p>此上略示十重戒相。四十八轻既多。不能一一敷扬。现前大众听受此法。事非等闲。切在觉世无常修行众善。庶得以此庄严净土命终决取<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。方知念佛受戒功勋不可得而思议者矣</p><p>第十一发弘誓愿</p><p>现前诸人今日既已得戒。当须发起度生之心。良由世人自昔已来凡所作为皆是自己边事。不能发一念利他之心。所以<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>六道。<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>微薄。今既<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>大戒。已后必须发菩提心起四弘誓愿。此四弘者诸佛所师。诸佛由兹而成正觉。菩提此翻为道。以道为心故名道心。发此道心。依乎四教境智不同。今依圆教无作<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。以发道心。此道心者。即与十方诸佛及一切众生之心等无有异。故华严云。如心佛亦尔。如佛众生然。心佛及众生。是三无差别。若知此心即是<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>亦即众生之心。则事理不二。生佛一如。三谛天然。微妙寂绝。依此发心。是名真正。违兹立愿。愿不名普。故天台云。发心僻越。万行徒施是也。然则此心在理。同名佛心。理虽无别。事相天殊。故须学佛慈悲发起弘誓。上求佛道下化众生。弘者广也誓者制也。依四谛境广制其心。先依苦谛境发一弘誓。众生无边誓愿度。二依集谛境发一弘誓。烦恼无数誓愿断。三依道谛境发一弘誓。法门无量誓愿学。四依灭谛境发一弘誓。佛道无上誓愿成。现前诸人于一念凡心。全用佛境佛智。起此四弘。自利利他功不可量。凭此胜缘。求生上品净土。宜各志诚随声发愿</p><p>弟子(某甲)今于诸佛菩萨像前。真正发菩提心。众生无边誓愿度。烦恼无数誓愿断。法门无量誓愿学。佛道无上誓愿成(三说)</p><p>第十二结撮回向</p><p>上来施戒功德如虚空等法界。普为一切众生。庄严实际。超脱轮回。永证无生常住快乐。然后以此胜因。奉福护法诸天。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>赏罚。威德灵聪。现前众信。住居香火。本命星辰。上代家先。生身父母。冤家债主。欠命负财。法界有情。俱沾利益所冀。地天交泰。清浊殊分。四海晏安。万民乐业。风祥雨顺。谷果丰成。次乞。现前男女戒善所资。常臻吉庆。灾衰荡散。福智云临。觉世虚幻。多修白业。仰惟三宝洞明。诸天昭鉴。为上因缘和南圣众(会散)</p><p>结念佛会疏(并青山楼<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>跋)</p><p>明州延庆院念佛净社</p><p>当社普结僧俗男女一万人。毕世称念。阿弥陀佛。发菩提心。求生净土。每年二月十五日。于院启建道场。供养三宝。斋设僧田。功德祝延。帝寿。福利军民。其建会之法。劝请会首二百一十人。各募四十八人。逐人请念佛忏愿历子一道。每日称念佛名一千声。忏障道重罪。发菩提愿。为度众生。取于净土。请画佛数于历子上。至建会日。预赍历子。并备净财四十八文。到院攒录上疏。至日表宣。或入社弟子倾逝者。请劝首继。将姓名并其人历子。到院相报。即当告示。在社九百九十九人。各念佛一千声。为彼忏罪。资其愿行。令生净土。又至建会日。令社众念佛荐其往生。仍请劝首。速募人填补。所冀常结万人同修净业者</p><p>原夫一念本融。诸法无碍。遇熏既异。感报成差。是以顺性而修。则显诸佛净土。随情而作。则循五趣苦轮。所以处娑婆者。升出尤难。堕落者众。故经云。得人身者。如爪上土。失人身者。如大地土。直待三乘行备。方免四趣受生。盖境界粗强烦恼炽盛。自力求脱实难其人。若夫生安养者。国土庄严身心清净。直至成佛。不堕三涂。经云。尚无恶道之名。何况有实。又云。众生生者。皆是阿鞞跋致。若欲生彼。但当称彼佛号修彼佛慈。必为彼佛本愿摄取。舍此报身定生彼国。具如经说。实匪臆谈。今结万人。以为一社。心心系念。日日要期。每岁仲春。同集一处。同修供养。同听法音。会彼万心。以为一志。俾成定业誓取往生。况报得命光其犹风烛。一息不至。三涂现前。何得自宽。不思来报。当依佛语无顺人情。顿息攀缘。唯勤念佛。谨疏</p><p><a href=\"/remen/jingtufamen.html\" class=\"keylink\" target=\"_blank\">净土法门</a>决然可信。如来盖尝特言之。屡言之。委曲言之。而世之人尚毁信相半。大抵高明之士则曰。口称佛名。便能成佛。一何易哉。是未尝稽其所以。不知净土业成但生彼国。无恶境界。有进无退。直至成佛。岂才生彼国便成佛也。以少善根为无以加者则曰。口称佛名。定可往生。是亦未为至论。所谓念者致精诚。焉勿志之谓也。岂口舌云乎哉。予虽未尝不辍香火扬声叩拜。然动容周旋。念念不绝。虽衽席之上踰溷之间。亦必避西。自谓世人莫如我修净业也。四明法智大老起天台大教于既坠之后。使人见性成佛。犹且以此化人。是知此深法门为不可废明矣。祥符中尝结念佛胜会。延庆净人如庆得亢疏于人间。宛如新制。欲踵武前修。请予叙其事。予<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃。虽欲辞而不可得。敢望<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>同愿同求高明者俯而就。谈何容易者则致诚意焉。庶几无高无下。无智无愚。皆得超往。若曰何必生彼然后成佛。则在家者亦不必出家而星居。甲乙者亦不必寻师访道矣。未透关者幸留意焉。绍兴壬午中夏青山楼弆云</p><p>交法师授辞</p><p>吾祖智者垂言立行。谈出情表。非暗证及寻名者之所追及也。吾忝嗣洪业。绵历多稔。未尝少须有行说之懈。汝登吾之门亦有日矣。咨决微旨。厥功已积。今台之章安慧因古寺钦汝懿美。乃新构于讲院。令汝传持。吾今授汝香炉如意。用为传法之具。欲汝三学芳香先蔼乎自己。四悉巧意次适乎物宜。汝其慎诸。勿妄挥秉。忽名利之如芥。视强软之若寇能如是者。少合吾之意尔。亦不辜吾祖之言行。亦免致有情之生恼。择交论师勿欺吾嘱。天圣二年正月二日。四明座主(华押)辞</p><p>璨法师授辞</p><p>天台命宗。以偏圆一揆示乎教。以境智不二明乎观。非教无以生解。非观无以成行。解行具备。然后可登乎圣贤之域也。吾久事斯道。靡有懈怀。故四海学人往往遐至。文璨论师始则升于兴国祥法师之堂。讨论大义。克着功业。而祥师放心至理。情忘彼我。复旌汝好学。命入吾之室矣。于是孜孜教观。无昼无夕。绵历乎多祀。又能景行纯素。与言相应。今祥师严整塔寺。续三宝之遗风。虑妨示徒。故付讲于汝。吾嘉祥师有出俗之见。复观汝是传法之器。故授汝手炉洎郁多罗僧。欲汝一秉一披使德香芬馥寂忍成就。如是则利养毛绳名闻毒箭。何伤于己也。前所谓登圣贤之域者。汝其有分耳。文璨论师当体吾意。旹大宋天圣四年十月六日。延庆座主(知礼)授辞</p><p>放生文</p><p>法师应于放生之处。不近不远。敷座而坐。若有徒众。亦于其傍列位坐之。各以慈眼悲心视诸众生。念其沉沦深起哀慜。复念三宝有大威力能救拔之。作是观已。法师当执水盂默念想云。一心奉请。大秽迹金刚圣者潜降道场。加持此水。有大功勋。洒沾异类。令其身心清净堪闻妙法。即默诵秽迹<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>一七遍。再三洒之。然后执手炉白云</p><p>仰白十方三宝释迦本师弥陀慈父宝胜如来<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>等。惟愿慈悲证知护念。今有水族(或云飞禽若干头数)。为他网捕。将入死门。比丘某甲(或云弟子)修菩萨行。发慈慜心。行放生业。作长寿因。赎其身命。却收逍遥。仍顺大乘(或云仍请比丘随顺大乘)方等经典。授与三归。及称十号。<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>皆当为说。但以此类众生本为愚痴及诸恶业。今受异报。六识昏迷。不能了知方等深法。仰乞三宝灵通威德冥加。令此众生心开意解。于深妙法速得相应。转报受生。早得解脱。慈慜故(此句三唱)</p><p>汝等众生从无始来。不闻三宝。不解归依。所以轮回三有。今堕畜生。酬偿夙债。我今为汝哀告三宝。求乞护念。令汝等辈心开意解能知妙义。我当授汝一体三宝甚深妙法。所谓三宝者。佛名曰觉。法名不觉。僧名和合。此三即一。此一即三。不纵不横。不并不别。不可思议。名秘密藏。世出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>最尊最贵。名之曰宝。今以佛法僧为宝也。一切万法莫不归趣。故名三归。理虽旷远。即汝心性不远而复。汝等应当深信此理而归向之。大众同心。授与众生三归依法</p><p>现前异类一切众生。依大乘经甚深妙义。归依佛。归依法。归依僧(三说)。归依佛竟。归依法竟。归依僧竟(三说)。从今已往。称佛为师。更不归依邪魔外道。惟愿三宝哀怜摄受(三说)</p><p>佛子。我今更为汝称宝胜如来十号功德。为汝虔请慈尊。方便救护。彼佛本愿。若有众生。于十方界闻我名者。即得上生三十三天。流水长者为十千鱼称兹十号。彼诸鱼类即得生天。长者成佛号释迦文。彼十千天子。威德炽王而为上首。夙缘所追。而于光明会上。闻信相开士及其二子受菩提记。时诸天子重闻十号。顿悟本心。深证无生。便得受兹十号记别。愿汝今日闻我称扬宝胜十号。如彼天子所证。等无有异。南无过去宝胜如来应供正遍知明行足善逝世间解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊(三说)</p><p>宝胜如来常住不灭。愿乘本愿证我称名。令此众生速得道记(三说)</p><p>诸佛子。我今更为汝说十二因缘甚深妙法。愿承三宝力。令汝一一了知。此十二法体是<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>大般涅槃。而汝迷故翻为三道。三世因果轮转不息。我今为汝先唱十二因缘生相。次唱十二因缘灭相。愿汝达此生灭之法。当处即是不生不灭。当处究竟。当处清净。当处<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。一究竟一切究竟。一清净一切清净。一自在一切自在。同于诸佛证大涅槃。(大众同声唱云)所谓无明缘行。行缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老死忧悲苦恼(此是因缘生相。再听因缘灭相)。所谓无明灭则行灭。行灭则识灭。识灭则名色灭。名色灭则六入灭。六入灭则触灭。触灭则受灭。受灭则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老死忧悲苦恼灭</p><p>汝等水族异类众生。我今依大乘经甚深妙义。授汝三归十号十二因缘已毕。又复念汝无始业障深重堕在畜生。今则为汝对三宝前。发露众愆。求哀忏悔。愿汝罪业一念消除。便得生天。近佛受记</p><p>现前水族飞禽异类等。志心忏悔。自从无始。不悟本心。轮回生死。于诸有中。内无慧眼。外近恶人。开放逸门。造生死业。杀盗邪淫。妄言绮语两舌恶骂。贪嗔邪见。自作教他。赞叹随喜。四十种恶念念相应。未曾暂舍。乃至出佛身血。破和合僧。杀阿罗汉。杀害父母及以二师。谤方等经。偷僧祇物。自破净戒。污他梵行。斗秤欺诳。以伪为真。饮酒昏迷。犯诸过失。伤害众生。充己饮食。作无量罪。结无量冤。致令此身轮回三有。今堕畜生。酬偿宿债。从苦入苦。无解脱期。今遇比丘说大乘法。无边重罪如佛世尊所见所知。今皆忏悔。愿罪消除。愿罪消灭</p><p>惟愿放生已后。汝等不逢网捕。尽其天年。命终之后。承宝胜佛本愿力故生忉利天。受天快乐。诸佛出世说方等经。于彼<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>再闻此法。心悟无生。面承佛记。如威德炽王。等无有异。亦冀放生弟子(某甲)。从今日去。菩提<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>念念增明。救苦众生常如己想。以是因缘得生安养。见弥陀佛及诸圣众。早证无生。分身尘刹。广度有情。同成正觉</p><p>梦鱼记</p><p>(守<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>屯田员外郎知越州诸暨县事潘 华记)</p><p>(四明法师跋)</p><p>予到任。依普贤观经。不令人捕池沼江湖内鱼(城外难禁)。景德四年孟冬。奉诏还阙。十月十日夜忽梦。江湖中鱼约计数万。悉号泣云。长者去矣。吾众烹矣。哭声沸天。所不忍闻。然而是耶非耶。真耶妄耶。复焉知后来宰邑者非长者乎。所嗟者人何故而为鱼。鱼何故通人。而知人之去留。一何灵也。君子鉴之。何忍烹之乎。予闷其有情。故特记之云</p><p>四明沙门(知礼)偶睹兹事。能知厥由。非释典了义。莫可原之。盖鱼性佛性。宰邑之性本不二焉。在事强分二。无二也。佛既先觉。立法教人。观乎物性。起同体悲。安其危。示其乐。俾其复本与佛齐致。故流水救鱼已得成佛。鱼亦当成。不二之验矣。今所梦者。岂孤然哉。乃由佛广放生之教。鱼蕴得脱之。缘人有增善之分。共而成之。其理必也。夫如是。闻见之人得不力行其教。谛观乎性。使齐于流水者也。时天圣元年四月十一日跋</p><p>敕延庆院放生池碑铭(并序)</p><p>(枢密直学士中大夫尚书礼部侍郎知颖州军</p><p>州兼管内劝农使护军彭城郡开国侯食邑一</p><p>千七百户食实封二百户赐紫金鱼袋刘筠撰)</p><p>粤若庖牺氏之王天下也。始作罔罟。以佃以渔。取之有时。用之有节。盖所以顺杀伐而育人民也。是故四灵为畜。禽鱼亡獝淰之悲。万物由庚。草树遂抽零之性。及乎大道既隐。淳风不还。人欲无厌。天物斯暴。蚳蝝尽取。潜蛰咸伤。圣人所嗟。君子用悯。历代而下。申禁非一。所贵乎卒天下以仁。而登夫寿域者也。圣宋奄有万国。真宗嗣致太平。既纵雉以升中。复育縠而报本。然犹储精垂思。修坠起废。天禧纪元之初。诏淮南江浙荆湖之地。有放生池者。俾缮完而增新之。惟四明之奥区乃扬州之旧域。水居者众。鳞族甚繁。蚩蚩之氓惟利是视。蠢蠢之类曾不聊生。滥彼洿池。陈诸数罟。鲲鲕亦及。鳅鳝难逃。幸增无艺之贪。孰救可欺之失。有法智大师(知礼)者。道风孤峻。行业纯悫。传天台<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>之宗。修普贤忏涤之法。申旦不寐。三岁是期。每念。是身可恶如贼。志当舍离。乐在寂灭。固以比行厕之极厌。垂将效焚躯之真供。而大善知识恳劝住世。官曹府檄督责保全。实徇众之攸依。思利他之为广。矧遘圣神之运。宜恢方便之慈。式警群迷。聿形悲济。顾此净刹。旁有积流。窅若神渊。达于巨浸。极愿力以爰度。获俞命之亟下。公私率协。终始罔愆。矗然巨防环兹。注注繇是。普化廛里之俗。博市鳞介之品。脱豫且之网。朝有千计。返西江之使春盈万数。又每岁以佛生之旦。众大和会。浮泛彩鹢。演畅竺坟。寤流水之胜缘。识衔珠之善报。莫不竞持诡类咸造埼浔纵之于波。快哉共叹。[赤*頁]尾者戏荷而逝。呴沫者依莆而游。固以乐甚濠梁。望逾斗水。敝笱以之咸屏。枯肆谓之一空。至有断罟折竿悔过而易业者矣。呜呼淳古之俗前志有云。杂人兽之居。靡相为害。食草木之实。各遂所养。圣哲继作。播种是教。以前民用篾闻馁者。是故二仪訢合百嘉茂畅。龟龙在宫沼。胎卵不殪殈。虽火化[穴/浸]变。而血祀有经。故曰。獭祭鱼。然后虞人入泽梁。又曰。钓而不网。田则不渔。皆所以昭上之德而塞下之违也。自古致治之君。皆以好生为本。每严戒令务抑末游。其如利人之所诱。荡而忘返。害既为甚。法不胜奸。继以天灾。遂废啬事。家乏兼晨之爨。野无遗秉之利。乃至旱干水溢。山童泽涸。昆虫为孽。道殪相望。强暴之徒雚蒲是聚。椎牛屠狗。鬻盐盗酝。岂唯弃失本业。率多抵冒刑戮。得非敛饫腥味。天残物性。犯道家之明忌。事必好还。背春秋之美谈。政之所败者乎。不有慈悲之士。孰臻觉寤之本。且曰。凡有血气。同一触体。尽诸沙界。共一真性。庸讵恣口腹之欲。结轮回之业。其理不昧。缘心可观。则金光明经论之详矣。况复吴越之区膏膄兼倍。漠漠粳稻油油麻苎。陆则有苞笋姜汇。水则有海苔菰苜。固足以旅践。嘉珍丰溢兼豆。亦何必剖豢豹之胎。嚼鱼子之闹。滋味煎其府藏。香芳腐其骨髓。食气既胜。腊毒增厚。而殃病短折者。亦未必不由兹也。夫先圣立法本以驭众。大小贵贱不相踰越。惟辟玉食顺时以视膳。惟郊特牲因礼以贵臭。岂料后世有冒于宠利。罔知纪极。管氏设镂簋。秊氏旅泰山。乃至养食客之三千。探牛心之一割。骋嗜奔欲。穷奢极侈。豪杰胥效。风俗益讹。固虽罄川陆之毛。殚渔猎之力。驱以就役莫充其求。是知其源至深。其来有渐。机权不足以为御。呋钺不足以用威。故曰。善人为邦百年。然后可以胜残去杀。洪惟我朝在宥而治。以圣继圣。垂六十年。率上仁而绥群品。用柔道而怀犷俗。尊老氏之三宝。为大雄之外护。大师所以顾逢盛旦。集此妙果。介其秘祉。仰佑慈宸。表洪施之无疆。实含灵之允赖。谓是于益。宜有铺昭。予病夫也。曩在禁林。寻堕职业。旋承官乏。待罪中司。自时辱书。猥托叙事。而不知。中干已甚。轧思无堪。避让有初。阻修罔愬。今遂偃藩之适方存喉息之微。而又广印大师(智环)叠寓讯函。督兹铭述。强攀逸驾。仅成累句。绎颜公之妙作。嗤鄙自彰。讽周沼之灵篇。揄扬曷既辞不迨意。取愧群英。其铭曰</p><p>天地之大仁圣是则巍巍居尊</p><p>生生为德顺考古道只受民时</p><p>兆人允殖万物由仪易有中孚</p><p>书称咸若恩信所加飞潜自乐</p><p>末俗浸巧暴殄滋多麟凤去棷</p><p>鲸鲵骇波惟天聪明聿求元圣</p><p>邦家大同幅员底靖皇哉有宋</p><p>叠雉重明泽均敦苇惠及跂行</p><p>乃眷南服鲜食为盛缮治旧防</p><p>昭苏物命爰有开士化兹一方</p><p>就其宝刹疎厥金塘壁立大堤</p><p>练澄百丈滟滟风光昭昭景象</p><p>日募檀施岁举忏仪鱼鸟聱取</p><p>刷荡澜漪憯怛忠利国教胥洎</p><p>[惏-木]惕隐恻人端斯至自古及今</p><p>惟善可钦惭非吉颂聊代虞箴</p><p>天圣三年岁次乙丑七月十五日霅溪僧(仁岳)书</p><p>朝奉大夫尚书刑部郎中充集贤修撰知明州军州兼市舶管内劝农事柱国赐紫金鱼袋曾会立</p></div>"
},{
    "title": "四明尊者教行录 第二卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第二卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>观经融心解</p><p>修忏要旨</p><p>释辅行传弘决题下注文</p><p><a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>义例境智互照</p><p>天台教与起信论融会章</p><p>释请观音疏中消伏三用</p><p>对阐义钞辨三用一十九问</p><p>观经融心解(并序)</p><p>一旦学者稽首而言曰。十六观法<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之要津也。闻之有岁。究之粗勤。观道未明。造修安寄。敢请开决。庶为准绳。予曰。疏释显然。夫何惑矣。傥有所壅。试为通之。方随问而伸。征文以证。往复既数。旨趣稍彰。恐来者未闻。故录之以示。庶因此解。融诸滞心者也。时皇宋大中祥符七年岁在甲寅重阳日自叙</p><p>学者问曰。观无量寿<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>十六观法。于今家托事等三种观门。为属何耶</p><p>答曰。既非借于事义立观立境。不名托事。又非撮乎<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>入心成观。何关附法。韦提特请正受之门。善逝直谈<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>之法。虽托彼依彼。正皆了唯色<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。以法界身入心想。故约行明矣</p><p>又问曰。虽是约行。而初观落日。中想<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。后论三辈。为只想依正事境而成观行。为即照三谛理耶。人共疑之。愿为明判</p><p>答曰。佛意虽显。经语难知。须假四依示其修法。何者。一经旨趣搜在首题。故疏云。观虽十六。言佛便周。既以一心<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>释观。一体三身解佛。诸法实相为经正体。修心妙观显四<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>为宗。能除五逆即生九品为用。方等大乘圆顿为教相。五重既尔。岂可以唯想事境消经文耶。荆溪云。首题既尔。题下别释理非容易。又不二门云。览别为总。符文可知。是则题与经文总别相显。不可辄异。故知十六皆圆三观也</p><p>又问曰。韦提希被恶子幽禁。遂哀请<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>示无忧恼处。至光照诸土摄在金台。而云不乐余方志求极乐。况<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>总叙乐邦苦域金宝泥沙。据此等文。唯在同居明矣。何故专据三观四土之说耶</p><p>答曰。教之欲兴。何莫由于近事而渐耶。韦提虽欲舍兹秽土求生净邦。而佛示观法。舍秽必尽。显净无遗。如月盖为免舍离<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>之病故。请观音及乎宣咒。乃能消伏三毒之根。具足五眼之果。诸教兴由其例多尔。故修一心三观求生净土者。即以三惑为秽土之因。以三谛为净土之果。故别惑尽。则寂光净究竟三谛也。此惑未尽。则实报净分证三谛也。通惑尽。则方便净相似三谛也。此惑存。则同居净观行三谛也。非此谛观。安令四土皆净。尚非实报之秽。岂止同居之净。荆溪云。见思未破故。安乐行是同居净土行之气分也。故疏云。此经以修心妙观为宗。实相为体。若不尔者。宗非显体之宗。体非宗家之体。此如儒家训子衣食之方。即令读书干禄则富贵俱至。岂令耕稼商贾耶。得此譬意。今经可解</p><p>又问曰。若能圆修三观深趣妙理。何不只在娑婆直出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。岂须舍此求彼。又自修三观。何名净土之行</p><p>答曰。此经虽观深理。以缘极乐依正为境。修乎三观。则异于直观三道等观。是故得名净土之行。若不尔者。四种<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>如何分别。又为此土浊重。十信方出苦轮。彼土境胜九品悉皆不退。故令托彼胜境修观。纵理未显。见爱俱存。舍报必生无退转处。如此。争不舍此求彼。故起信论云。初学大乘。其心怯弱。以住娑婆不常值佛。惧谓<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>有退失者。当知如来有胜方便。专念西方<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>阿弥陀佛。求生彼土。若观彼佛真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身。毕定得生。住正定故。既惧此土阙缘信退。求生彼土。而令观于彼佛真如法身。自非一心三观。将何观之。今家以三观释经。与马鸣之意更无少异。故十疑论明<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>正行。令想弥陀法身报身光明相好及七宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>妙乐等。而云。备如十六观经。常行<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>三昧故知往生之行正在三观想彼三身。今缘彼佛修三观者。净土之行深观妙理。舍此求彼。初心不退。其义皆成也</p><p>又问曰。十六观中既无推理之语。疏文随释不示三观之言。是则三观释名。四土显体。乃是开乎圆解。而已至于历境修观。且只想于事境。托乎系念。生彼乐邦。既获阿鞞。何患不至寂光实报。一家制立岂出乎解行二门</p><p>答曰。理解释题。事行消观。未之可也。何则题标观佛。经说兼余。主伴正依具有十六。恐谓异辙。故先示云。举正报以收依果。言化主则包徒众。经既从要而明。疏乃就总而说。讲者必须以总贯别。修者仍须以理融事方得名实相。称宗体无违。傥解行有差。总别相反。则题非此经之名。观非此名所召。世之述作若也背题。则不应式。况圣教乎。若谓无文。则成诬罔也。故经云。诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>界身入<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心想中。是故心想佛时。是心即是三十二相。是心作佛。是心是佛。疏作<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>道交释解入相应释。若无初释。则观非观佛。若无次释。则生佛体殊。二释相成。是今观法疏云。佛法界体无所不遍。念佛三昧解入相应。故云入心想中。自非一心三止三昧。安与法界而论应入。是心作佛者。明即心变。全性成修。是心是佛者。心外无佛。佛外<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。此令<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>随观一境皆知心变。全体是心。既全是心。心岂见心。如指不自触。刀不自伤。故般舟云。我所念者即见心。作<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>自见心。乃至云。心者不知心。心者不见心。心有想则痴。无想则泥洹。止观约此而立<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>。中观若立。任运即三也。般舟此文与今经广略少殊。其旨不别。如来本恐着相观佛不成妙宗。故于真像之前示乎观体。令依此法而观佛身。傥不依此法。岂独不成妙观。抑亦不发胜相。智者得经妙旨。乃于首题预明观体。令将此观入十六门。则相相<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>。心心寂灭。故第九佛想疏。目为真法身观。真纵对像。法如何消。与法华微妙净法身具相三十二。云何异耶。须知小乘法身。义同生身。大乘生身。义同法身。故释迦牟尼名毗卢遮那。八万相海宁非法身。况非目击。但是观成。经文自云。佛法界身入心想中。又云。是心是佛。岂可局在应身之身有想之想耶。故韦提闻已顿入分真。侍女听之便阶相似。非圆观境。安得当机证入如此。以结益验观法可知</p><p>又问曰。上据是心是佛。此乃约佛。论中云何诸门界论三观。愿闻委说以息群疑</p><p>答曰。若于初心即修中观。必能双照任运成三。一观既然。诸门皆尔。盖圆人本信诸法圆融。今托胜缘想乎诸相。即知诸相四性不生。法体本空。心境叵得(一)。虽知叵得。不碍缘生。全性起修。念之即见(二)。起是性起。空是性空。性非二边。能所亦绝。唯心唯色。待对斯忘(三)。故止观判般舟之文心佛叵得为空。梦事宛然为假。心不见心为中。说则三相历然。修则一念备矣。经示诸相。而令谛观。圆人修之。非此不谛。故知十六莫不皆三。而此三观虽居一念。今观依正各有功能。何者。心境叵得故染可观净。不碍缘生故想成相起。唯色唯心故当处显现。人疑三观妨想依正。今谓三观能显依正。三观稍稍进依正转转明。于一心中互资互发。又复应知一心三观修有多门。若直于三道显理。此如一行。若托观佛显理。此如般舟等。若兼持咒显理。如方等等。若兼诵经显理。如法华等。若于数息显理。如请观音。若于<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记显理。如历事觉意。今之三观非直于三道显理。乃缘净土依正而修。虽缘于事。非散善恶及以无记。故知虽同全理起事。须分违顺。违理之事照令泯绝。顺理之事观令成就。今之依正是佛妙用与圆观相应。此观未成。则随假想而进。故观落日坚冰也。此观若着。则以实法为缘。故观地树佛身等也。故知用一心三观。则依正易明。非一心三观。依正难显</p><p>又问。法界入心是心是佛为妙观体。识者不疑。其如经文居像观首。此下诸观既有体式。可即具三。此前诸门佛既未示。以何为凭各修三观</p><p>答曰。佛鉴常机示法。前却其意难测。得经深趣。莫若四依。既以三观三身释乎总目。而云十六言佛便周。岂可行人不遵此说。若其未解。当询达人。慎勿抑经就情以愚难智。况一家制立其例盖多。如般舟三观之文普贤六根之忏。并是定中见圣始示其门。而智者教人。皆须预习方入道场。何不疑之。而独责此。况一家正受味禅之外六妙已上。无不具于无漏之想。岂方等顿教念佛三昧纯观事耶。愿勿谤经掇无间业</p><p>又问曰。据义征文分明。若是其如修者。何以措心。既历正历依。若大若小。境相委曲一一须观。傥照真如。必须绝念空有俱泯境观双消。且观相则违真。照理则乖事。既难并虑。必也无归。愿示用心永为修法</p><p>答曰。虽分事理。同在一念。既匪两端。何须并虑。故知身土不离真如。能于初心不二而照。唯圆顿教。前三不能。故华严云。娑竭龙王注车轴雨。唯海能受。非余地堪。般舟三昧观四八相。一一识知。复于此时而修三观。荆溪师立身相为境。空等为观。今问。为待身相观成方修三观。为复境观俱时而修。若待观成者。傥九十日相境未现。则三观靡施。安成圆行。若入道场即修三观。验知观相不碍照真。况复一家立兹圆行。不独三观。须论十乘。身要行旋。口仍称诵。三业俱运。九旬不休。三昧可成。诸佛同现故。不可以局情自碍。必须以融怀造修。然非我圆宗。他莫能会。只如三观。体虽无二。义且相违。空则一相不存。假则诸法皆立。中则性离二边。别人初心虽信中道。不能即观。要须析体空观成后必历多劫遍学诸门。二观均平方修中观。圆人发轸即于一心顿观三谛。故仁王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>云。有无本自二。譬如牛二角。照解见无二。二谛常不即。又云。于谛常自二。于解常自一。自非先了性具诸法融妙而观。孰能始心超彼积行。今之依正体本难思。妙观观之。自然符契。那将染碍事想断灭之真为疑难耶。应知禅那翻为静虑。即寂照之异名也。既寂中有照。圆人修之。岂照顽境而不照当处融妙耶。又此观法既类般舟。须论三力。谓佛威力三昧力。行者本<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>力。不可以己之情想议乎难思圣法也</p><p>又问曰。观法若然。谁堪修证。如其不修。何由生彼。是则往生路绝。徒仰当机。于今何益</p><p>答曰。人之根性皆由宿熏。成熟不时。对至能发。己尚难测。他安可评。须信能修不专。佛世仍知昧旨。岂独今人。韦提请宣。本为来世。佛知有益。故使<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>尔。自放逸不修。勿罔能修之者。然今论妙观。是经本宗。须就上根克论正行。故如上说也。若论此经力用。则何机不摄。何行不收。傥有一机未能圆照。且随事相。历境而观。以此系心。岂不生彼。故小乘行法五八<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>所亲<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>慈善。<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a><a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>皆得往生。以至<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>毁经十恶五逆。临终十念亦得往生。故知但于此经尽力<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>一念<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。皆趣念佛之海。尽归灵觉之源。如此摄物不遗除恶至极者。皆由经诠圆观理极渊源故。使力用难思与拔无际。安以滞想局此深经。当遵智者之言以会如来之意。而今而后。念兹在兹。于一念心显四净土。于是学者积疑。既尽得之于心。惟愿奉行。兼示来者焉</p><p>修忏要旨(因入内殿头俞源清奉宣到院。修法华三昧三昼夜。欲知忏法旨趣故。</p><p>述此以示之)</p><p>夫诸大乘经所诠行法。约身仪判。不出四种。摄一切行。罄无不尽。一曰常坐。即一行三昧。二曰常行。即般舟三昧。并九十日为一期。三曰半行半坐。即方等三昧。七日为一期。又法华三昧。三七日为一期。四曰非行非坐。即请观音三昧。四十九日为一期。又大悲三昧。三七日为一期。但诸经中有不专行坐及相半者。一切行法并属此三昧所摄。然限定日数者。盖令行者克时破障域。意修真决。取功成理显也。若欲长修。如法华安乐行。毕世行之。或宜时促。如<a href=\"/fojing/guanwuliangshoujing/yuanwen.html\" class=\"keylink\" target=\"_blank\">观无量寿经</a>。一日至七日。或如<a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>一时<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>等。然但在用心。不必定日也。今所修法华三昧者。若能精至进功。岂不破障显理。然须预识标心之处进行之门。所谓圆常正信也。云何生信。信一切法唯心本具。全心发生。生无别理。并由本具。具无别具。皆是缘生故。世间相常。缘起理一。事理不二。色心互融。故法法遍周。念念具足。十方三世不离<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。诸佛众生皆名法界。当处皆空。全体即假。二边叵得。中道不存。三谛圆融。一心具足。不一不异。非纵非横。不可言言。宁容识识。斯是不思议境。入道要门。依此博运慈悲。<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>无念。托此巧安定慧。无作无为。仗兹遍破执情。何情不破。据此反寻塞着。无著不通。道品因其。中适助治附此。合行圆位可登。寂忍不动。不滞相似。速入分真。故天台智者先令行人亲近良师学<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>处。即不思议理观所诣之处也。次示忏悔之法。乃有三种。一作法忏。谓身口所作一依法度。二取相忏。谓定心运想相起为期。三无生忏。谓了我心自空罪福无主。观业实相。见罪本源。法界圆融真如清净。法虽三种。行在一时。宁可阙于前前。不得亏于后后。无生最要。取相尚宽。盖妙观之宗是大乘之主。灭罪如翻大地草木皆枯显德如照澄江森罗尽现。以此理观导于事仪。则一礼一旋罪消尘劫。一灯一水福等<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。故口说六根忏时。心存三种忏法。如是标心方堪进行。法华三昧仪云。行者初入道场。当具足十法。一者严净道场。二者清净身器。三者三业<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。四者奉请<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。五者赞叹三宝。六者<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。七者忏悔。八者行道旋绕。九者诵<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。十者思惟一实境界。明此十法之中。有但说施为方法。有教运心作念。有教诵文章口自宣说。备详彼文。此不具载。今但略述用心旨趣而已。第一严净道场法。第二净身方法。此并可见(云云)。第三修三业供养法。行者三业供养之际。须起难思之想离于谓实之心。若香若华。体是法界。能供所供。性本真空。其量遍周。出生无尽。其性<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。亘彻无遗。岂唯遍至此界他方。抑亦普入未来过去。普献三宝。等熏众生。虽曰施财。以财通法。是真法供。能资法身。五果皆常。<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>咸显。故默想香华偈(云云)。第四请三宝法。第五赞叹三宝法。第六礼三宝法(云云)。且初礼佛时。深知佛体不离我心同一觉源。圆照诸法。诸佛悟起同体悲。众生迷强受诸幻。悲苦相对感应斯成。一身遍至诸佛之前。一拜普消无边之罪。故默想礼佛偈(云云)。次礼法时。深知诸佛所<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>德。众生所迷理心。一切行门无边教道。离染清净。能轨圣凡。称此法门。三业致礼。故默想礼法偈(云云)。次礼僧时。即三乘圣贤也。虽是因位。已到真源同佛。无缘之慈同佛。不谋而应。我今三业致感圣众。四誓所熏灭我罪根。生我乐果。故默想礼僧偈(云云)。次运普忏之心。用成旷济之道。若不然者。岂但不成大道。抑亦难灭众愆。何者。我从无始已来。造罪之际。自身为业本。众生为恶缘。生生于彼爱憎。处处于他淫杀。况一切男子是我父。一切女人是我母。无不业累相关。悉为<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>所覆。今运同体慈悲。如理忏悔。尽妄染际。彻真性源。仰答四恩。旁资三有。有情之类称性遍该。故默想(云云)。第七忏悔六根及四悔法。夫六根之罪愿悉消除。四悔之心愿皆成就。初修忏悔者。所谓发露众罪也。何故尔耶。如草木之根。露之则枯。覆之则茂。故善根宜覆。则众善皆生。罪根宜露。则众罪皆灭。今对三宝。真实知见照我善恶之际。穷我本末之边。故原始要终。从微至着。悉皆发露更不覆藏。所谓逆顺十心通于迷悟两派。故迷真造恶则有十心。逆<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>流顺生死海。始从无始无明起爱起见。终至作一阐提拨因拨果。所以沉沦生死无解脱期。今遇三宝胜缘。能生一念正信。先人后己。改往修来。故起十心。逆生死流。顺涅槃道。始则深信<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>不亡。终则圆悟心性本寂。一一翻破上之十心。不明前之十心。则不识造罪之相。若非后之十心。则不知修忏之法。故欲行五悔。先运十心。故默想(云云)。想已当说六根罪过。然此六根忏文非人师所撰。乃圣语亲宣。是释迦本师说。普贤大士为三昧行者。示除障法门。盖由洞见众生起过之由造罪之相。又知诸法本来寂灭全体灵明<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无为无染无碍互摄互具互发互生皆真皆如非破非立。迷情昏动触事狂愚。以<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>涅槃为烦恼生死。是以大士示忏悔法。开解脱门。令了无明即明知缚无缚。就兹妙理忏此深愆。故忏眼根罪时。即见诸佛常色。次忏耳根罪时。即闻诸佛妙音。乃至忏悔意根。即悟刹那住处三身一体四德宛然。以要言之。一切罪相无非实相。十恶五逆四重八邪。皆理毒之法门。悉性染之本用。以此为能忏。即此为所观。惑智本如理事一际。能障所障皆泯。能忏所忏俱忘。终日加功终日无作。是名无罪相忏悔。亦名大庄严忏悔。亦名最上第一忏悔。以此无生理观为忏悔主。方用有作事仪为忏悔缘。其事仪者。即五体投地。如泰山颓。克责己心。语泪俱下。挫情折意。首罪求哀。如此事行既勤。理观弥进。如洗涤之法。虽净在清水。若不加之灰皂。垢腻难除。故正助合行。如目足相假。岂独灭罪。即能证真。故六根忏悔若成。六根清净可获。若不以圆观为主。则不名大乘忏法。纵能灭罪。止免三涂。纵能生善。不出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。先知此意。然诵其文。俾在兼行取成大益也(云云)。次之四悔。所谓劝请随喜回向发愿也。所以悉称悔者。盖皆能灭罪故也。劝请则灭波旬请佛入灭之罪。随喜则灭嫉他修善之愆。回向则灭倒求三界之心。发愿则灭修行退志之过。初修劝请者。先知现今刹那十方世界。有不可说佛刹微尘数佛。方坐道树。未转法轮。我今称理运想。于一一佛前。请说妙法。即此刹那十方复有如上尘数诸佛。唱入涅槃。我皆于前请久住世。能此运念不止灭乎魔愆。复能成于法施。其功甚大。切在用心先运此心方陈其语(云云)。次修随喜者。则随他修善喜他得成。谓<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>凡夫。二乘贤圣。一切菩萨。三世如来。有为无漏善根。上求下化功德。皆<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>赞叹。随顺修行。夫善是乐因。今随喜助成。则与一切众生安乐之果。当以此意念念行之(云云)。次修回向者。所谓回事向理。回自向他。回因向果。初回事向理者。元由理具方有事用。一切修证不出理性。众生强执计是有为。今回此心向于实际。回自向他者。昔迷理遍。凡所修善庄严自身及己眷属。今顺本性回向众生。回因向果者。一毫善种。三业熏修。不趣二乘。宁滞三有。修既顺性。则成缘了二因。因必显真。同归究竟<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。是名回因向果。此三种回向一切菩萨共修。是故行人依此回向(云云)。次修发愿者。要誓志行也。一切菩萨通有四誓。谓未度苦者令度。未解集者令解。未安道者令安。未证灭者令证。此则通标其志。已具前门(旧本无此则下二句。今依悦庵所科之本。附见于此)今则别要其心专期净土。盖此堪忍之界不常值佛。多诸恶缘。深位尚乃有退。若彼安养之土。常得见佛。唯有胜缘。初心即得不退。又彼佛愿力普摄有情。若能愿求。定得生彼。况过现积集善恶业缘。每至终身咸来责报。临终恶念增盛。则众恶成功牵生恶道。临终善念增盛。则众善皆成牵生善道。今既求生安养。必须净业庄严。若无愿力强牵。焉克临终<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。故诚心发愿决志要期。既欲往生。宜在专切。第八行道法。第九诵经法(云云)。然欲略知观法之要者。但想绕佛之身诵经之声皆是法界各遍虚空。一切众生闻此句偈。十方三宝受我绕旋。而无能旋所旋。永绝能诵所诵。旋则步步无迹。诵乃声声绝闻。故曰。举足下足无非道场。又云。其<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>者无说无示。如此旋诵功莫与京。第十<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>实相正观法。上诸观想虽皆称理。而带事修。盖欲行人涉事之时。体事即理心无倚着。功不唐捐故。如前施设也。今之禅法乃是正修。纯用理观。今先明坐相方示观门。且坐相者。当于别室身就绳床结跏趺坐。以左脚置右脚上。名为半跏。更以右脚置左脚上。牵来就身令齐两髀。名为全跏。此坐为最。易发禅那。若不能全踟。半跏亦得。次整衣服。不得太宽。宽则袒。露不得过急。急则气壅。次当正身令不萎不倚。项背相对。其头不低不昂令平正。自然勿以力制。合眼令断外光。合口令断外风。次令气息调匂。心离昏散。故止观云。调身则不缓不急。调息则不涩不滑。调心则不浮不沈。三事若调。<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>可发也。次示观门者。所谓舍外就内。简色取心。不假别求他法为境。唯观当念。现今刹那最促最微。且近且要。何必弃兹<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。别想真如。当观。一念<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>德量无边。体性常住。十方诸佛一切众生。过现未来虚空刹土。遍摄无外。咸趣其中。如帝网之一珠。似大海之一浪。浪无别体。全水所成。水既无边。浪亦无际。一珠虽小。影遍众珠。众珠之影皆入一珠。众珠非多。一珠非少。现前一念亦复如是。性彻三世。体遍十方。该摄不遗。出生无尽。九界实造。佛地权施。不离即今。刹那能穷过未作用。然须知性具一切。是故能摄能生。勿谓本觉孤然随妄缘而方有。不明性具者。法成有作。观匪无缘。今观诸法即一心一心即诸法。非一心生诸法。非一心含诸法。非前非后。无所无能。虽论诸法。性相本空。虽即一心。圣凡宛尔。即破即立。不有不无。境观双忘。待对斯绝。非言能议。非心可思。故强示云不可思议微妙观也。此观非灭罪之边际。能显理之渊源。是首楞严禅。是法华三昧。亦称王三昧。统摄一切三昧故。亦号总持之主。出生一切总持故。功德甚深称叹莫及。上来所述事仪理观多有漏略。备急披详不烦援引。若欲广知。应寻摩诃止观。当知止观一部即法华三昧之筌蹄。一乘十观即法华三昧之正体。圆顿大乘究竟于此</p><p>释辅行传弘决题下注文</p><p>此之注文人多异说。今因讲次故亦录之。聊示诸生用祛多惑。初十句明辅行传弘四字。次十句明决之一字。后四句总结示。初中前八句明立四字之意。后二句结用众教之功。初立辅行之意云。济行之教有宗。信教堪辅行。释曰。荆溪为津济止观之行故。记录经论等教。而其教本自有宗。当分则成于己教证修。跨节则皆成法华因果。教既元为宗设。信知诸教堪以辅成止观行也。次立传弘之意云。显教之行符理验行可传弘。释曰。智者为光显如来之教故。说止观之行。而此行深符妙理。既是契理之行。验知一以传弘利物也。次征释传弘云。行何所弘。非众教不立。释曰。上句征止观之行。为是何法所弘耶。下句释非以众教开演。不能令止观妙行安立世间也。次征释辅行云。教何所辅。非妙行莫诠。释曰。上句征经论等教。以何法为所辅耶。下句释若非一乘妙行莫为诸教所诠也。是则所辅所弘即是止观。能辅能弘不出众教。其犹贤臣既以六经辅成帝道。复以六经弘宣帝德。虽彰二用。皆凭六经。荆溪亦尔弘辅止观。皆凭众教也。故下二句结用众教之功云。乃澌以三闻全教行一辙。释曰。澌尽也。以用也。三闻语出付法藏。彼云。三闻说法悉能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。故乃是载三闻于诸教章句也。盖荆溪云。数闻师谈众教。频览佛示群诠。故乃尽用此闻弘辅止观。欲使自他依教成行。以行显教。教行相冥成一辙矣。次十句释决之一字。上之用教弘辅。虽亦荆溪之能。而推功在教。今之决字盖是禀师心要。用己智能开通止观若文若行也。故十句中。咨禀口决唯在于师。审理等九多从己解。然是习教修观所发并非胸臆之谈。具在下文。读者自见。后总结示。其意更明。何须委释。问辅行二字既以教为能辅。止观为所辅。传弘二字何不以止观为能传弘。教为所传弘。有何所妨不作此释。答其妨略四。一者恐妨大体。本为传弘止观。制此记文。岂可立题却自传教。二者恐妨题中文字。若记主意以教为所弘者。何不云辅行弘教决。因何能弘存于二字。而特不示所弘之体。验所传所弘只是所辅之行也。三者恐妨征释之文。释云。非众教不立。既以众教为能立。须以止观而为所立。弘故得立也。问词虽即未分。答语非不显了。义例求答意以设问。斯之谓欤。四恐妨结文。结云。揽斯众旨辄为首题。聊申所传不遗先见。信立题众旨以止观为所传明矣。焉敢改所传为能传。能传为所传。欲免斯愆故。如上释。若谓未允。更请消之云耳</p><p>义例境智互照</p><p>义例问云。法华玄文境能照智。虽引承证。理亦难明。答顺方便教。理不可会。若从极说。于理易融。以心为境。心亦能照。能所俱心。心体俱遍。心心相照。于理甚明。故不可思议境初云。不可思议境即是观。以是得为四句分别。境照于境。境照于智。智照于境。智照于智。照者方照。非说可穷。照者应说。非照可了。说者方说。非照可穷。说者应照。非说可了(因学人问照者下八句。遂而评之)今辄评此文意者。盖由上以四句互照明不思议境智。恐疑者云。凡立不思议者。则心行路绝。言语道断。而反立于四句分别。句句咸皆云照。岂非句即是说照即是思。何名不思议境智耶。故复立八句。以照对说。定是遣非。意云。忘情照者方照。离字说者方说。如此照者应说。如此说者应照。是则忘情故照。则圆融乃能<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>而说。离字故说即自在乃能圆融而照。所以四句皆彰其得。则终日说照。言思道绝。是为圣说圣默也。傥滞情而照。执语而说。则若说若照。非穷非了。何者。滞情故照。照则成偏执。语而说。说必有碍。何能如上四句互融耶。故四偏愚句皆斥其失。乃扶不思议之名也。文中以句法交互乍似难见。若以此意定之。则说证之道自明。不思议之名复显。尚恐总叙未晓。更将此意逐句注之</p><p>照者方照(圆融照者方乃照之)非说可穷(着字而说不可穷也。此以实证而斥虚说)</p><p>照者应说(如上照者合自在说)非照可了(只能照者便成暗证。此以双美斥于独善)</p><p>说者方说(自在说者方乃说之)非照可穷(滞情而照不可穷也。此以双美而斥暗证)</p><p>说者应照(如上说者合圆融照)非说可了(但能说者必成谤法。复以双轮而斥双翼)</p><p>天台教与起信论融会章</p><p>有客忽问余曰。起信论于天台四教摄属何耶。余偶对曰。起信论是唐朝藏法师制疏申通。天台不见文句解释。此乃各是一家制作。难可和会。客乃动容问曰。闻天台一宗最能融会。如云以五时八教判释东流一代时教。罄无不尽。此语何为。余乃立理对曰。只恐不许天台融会。若信天台摄属。容有其理。则起信摄属何难。亦乃自见诸家妍丑。今试为先将教摄论。次为以教会疏。且夫此论宗百洛叉经。而首题大乘。则理合通于衍门三教。故天台净名玄义云。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a><a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>等论通申大乘三教。唯识尚具三教。起信何不具三。况与佛性大同小异。今且于论初后。撮略教文以对三教。论以一心为宗。乃云。总摄世出世法。此则正在圆门。亦兼余二。真如门有离言依言空不空义。则三教之理明焉。生灭门明初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>住。能少分见于法身。八相成道(涅槃云。十住能少分见法身。见不了了。天台判为圆位。妙乐云。唯华严起信明初住八相。最为显著)岂非圆位耶。次第翻九相。岂非别位耶。八地得无功用道。岂非通教被接之位耶。略引此文。诸可悉例。客曰。藏师制疏分齐如何。对曰。贤首立义望于天台。乃是别教一途之说。未是通方别教。何者。别有教道证道。彼则唯论教道。别有四门被机。彼乃只论双。亦别有自他横竖。彼乃独论自行竖入。别有多义。彼所不云。未是别教通方盖是一途之说。客乃难曰。彼疏<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>不变为宗。天台亦以随缘不变证于三因体遍。乃是圆意何言别耶。余曰。藏师虽用圆名。而成别义。何者。彼云。真如随缘作一切法。而真如体性常不变。却谬引释论云。无情唯有法性而无佛性。此则名虽在圆。而义成别。客曰。别明凝然为理。今以随缘真如而为别理。此据何文。余返曰。别理随缘其文稍显。凝然为理。出自何文。客曰。此宗讲者皆有此言。而未见文疏所出。余曰。盛将随缘以凝然二理。简于性相二宗。此乃出自贤首。天台未见此文。据理。随缘未为圆极。彼宗尚自判终教。未及于圆。岂天台之圆同彼之终。须知。若凝然若随缘。但据带方便义边。皆属别教。客曰。天台立别理随缘文据如何。对曰。止观立别教发心境云。只观根尘一念为迷解本记别如来藏为善不善因。妙乐云。别教从无住本立一切法。乃云。无明覆理。能覆所覆俱名无住。又云。真如在迷生一切法。又云。无明为因能生九界。必须法性为缘。文证若此。足可依凭。客曰。疏义在别。此则已明。论具三教。更冀剖析。余曰。傥有微碍。尽望陈述。客曰。真如门属理。具三教可然。生灭门论于地住修证。须依一辙。别则始终俱别。圆则初后俱圆。如何三教位次并陈。对曰。此论宗经。既多明理。是故非一理。既不一。依位修证。如何一途。如<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>。明圆初住。乃云。初发心时便成正觉等。后明地位。却云。八地得无功用道。又仁王一偈颂中。三贤十圣住果报在圆。十四般若为别。五忍属通。此一两经明位尚尔。况此论宗百洛叉经。岂可止有一翻地位。文中缺于<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>位者。既以大乘标题。只可唯明衍教。客曰。且如贤首。学通性相。位继四依。因何释义全下天台。余曰。菩萨弘教各逗机宜。盖是一类之机宜闻一途之说。所以作此申通。未必四依有不了也。客曰。既各擅一美。各逗机宜。何须彼此摄属。对曰。既知二宗各逗机宜。何须致问。既令摄属。如上所陈。若论被机。不须和会。客乃唯唯而退</p><p>释请观音疏中消伏三用(并序)</p><p>消伏神咒修行要道。功用难思。吾祖发挥。今人受赐。疏文既简。读者多迷。惟冠摄一经。实消伏三用。傥释之不当。修者何依。今附本宗。略评此义。敢言益物。聊轨自心。时皇宋天禧元年丁巳岁十月既望叙</p><p>疏云。用即为三。一事二行三理。事者。虎狼刀剑等也。行者。五住烦恼也。理者。法界无碍无染而染即理性之毒也</p><p>释曰。用即为三。标三用也。一事等者。列三用也。中道总持被十种行者。修之不同。乃成三种消伏之用。观音分证之法遍于一切众生之心。随乎功行亲疎。致使力用差别。如起信论明佛菩萨用。并就众生事识业识辨之。以良医妙药狂子服之乃彰功用也。应知三种毒害舍旁从正。受名不同。如普门别行疏。分别火难等相。报火至初禅。岂此下诸有全无业惑。盖苦报为正也。业火至有顶。岂三界无惑报。以业为正也。烦恼火通四教。岂三乘人全无业报。以烦恼为正也。今事毒在欲界。此约果报。故受事名。行毒从<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。尽别教教道以不即理故。别受行名。理毒唯圆。以谈即故也。盖烦恼中分即不即异。故名行名理不同。若分别相。从正受名。与彼不异。所消毒害既尔。能消三用可知。释中事者。牒事消伏用也。虎狼刀剑等者。所消伏毒害也。盖果报行人为免现在刀虎等难。多用散心持名诵咒。修因戒善者亦免未来果报刀等。约此人明能消所消。一往属事。行者者。牒行消伏用也。五住烦恼者。所消伏毒害也。虽不出能消之相。应以所消显之。五住烦恼非三观不消。但此三观摄两二乘及三菩萨。修因禅定者亦伏八地之爱。此等行人虽能伏断烦恼。而皆不即法性。如别教道。纵知能造之心体是佛性。而谓无明自住。以不闻本性具恶法门故。非即理之惑。别人尚尔。前教可知。故此等人所消毒害既当自住。能消之观全是别修。是则<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>俱非无作。故能消所消皆名为行也。理者者。牒理消伏用也。法界无碍无染而染即理性之毒也者。所消伏也。虽不出能消之相。应以所消显之。且明所消者。法界是所迷之理。无碍是受熏之德。所迷本净故无染。受熏变造故而染。全三德而成三障。故曰即理性之毒。然即理之谈难得其意。须以具不具简方见即不即殊。何者。若所迷法界不具三障染故有于三障。纵说一性随缘。亦乃惑染自住。毒害有作。以反本时三障须破。即义不成。不名即理性之毒。属前别教。等名为行毒也。若所迷法界本具三障染故现于三障。此则惑染依他。毒害无作。以复本时染毒宛然。方成即义。是故名为即理性之毒。的属圆教也。故荆溪释无明依他义云。此同体依依而复即。故知体具三障。起三障用。用还依体。与体不二。此依方即并由理具。方有事用。斯是圆乘。若不谈具。乃名别教。是知由性恶故方论即理之毒也。能消伏用者。所消之毒既即理性。能消之用岂不即理。斯乃理慧理定为能消能伏也。复应了知理消伏用。体是性恶。方得初心即修中观。故荆溪云。忽都未闻性恶之名。安能信有性德之行。性德非理耶。行非消伏用耶。欲明理消之用。要知性恶之功。何者。以初心人皆用见思王数为发观之始。前之三教不谈性恶故。此王数不能即性。既不即性。故须别缘真中二理破此王数。既有能缘所缘能破所破。故毒害消伏俱受行名。若圆顿教。既诠性恶。则见思王数乃即性之毒。毒既即性。故只以此毒为能消伏。既以毒为能消。则当处绝待。谁云能破所破。有何能缘所缘。毒害即中诸法趣毒。遮照相即言虑莫穷。故荆溪云。非但所观无明法性体性不二。能观观智即无明是。若非理毒。焉即能观。故一心三观圆顿十乘。更非别修。皆理消伏也。应知三用得前前者。不得后后。得后后者。必具前前。且约诵咒为事辨之。如散心诵者。未修禅慧。则唯得事。不名行理。若三教人等。如优波斯那。闻六字已。但观心脉及四大实际。得阿罗汉。此是但修消伏观行。既不兼口诵。则独受行名。或有不舍口诵而修三教观法。此乃诵全成观。虽兼事用。而须从胜皆名行消伏也。但不名理耳。若圆教人。如释迦因地闻此章句即便数息住首楞严。则专理用也。若云过去得闻此句受持读诵。则兼事用。若观芭蕉幻化以为助道。则兼行用。虽兼事行。既约圆修。无不即性故。须从胜皆名理消伏也。又此三用消伏不定。自有以事消惑。自有以行消报。有修事行而能悟理。有修理用但消业报。文中但出所消三种之毒。不释能消三种之用。盖有对消互消之意。不可卒备。此令说者准义示之。况不独此中诸文皆简。傥迷山家教观深旨。此疏敷扬诚为不易。今辄解此文。多有疎遗。庶几达人许为刊正云耳</p><p>对阐义钞辨三用一十九问(并序)</p><p>孤山法师吾宗之先觉者也。着阐义钞解请观音疏。于中发明消伏三用义亦详矣。而于一家教观大旨。尚复差忒。予切陋之。于是设问一十九章。征问是否。俾诸学者于兹法义不为异端所惑云。天禧纪元十月一日。四明(知礼)叙</p><p>一问。约事约行二种毒害。为理性本具随缘发现耶。为理本无因迷始有耶。因迷始有。非今圆义。本具随缘。能随之体非性恶耶</p><p>二问。据何显文。约何了义。理性毒害非性恶耶</p><p>三问。理性毒害是无明耶。非无明耶。若谓是者。则与约行全同。若谓非者。又非性恶。五住之外别有体耶</p><p>四问。行毒理毒若无别相。何故疏家特分三用耶</p><p>五问。钞云。修一心三观。破五住惑。即约行消伏毒害。至释理毒。何故复云。今观诸法唯心。染体悉净。即神咒治理性之毒。此之二解能治所治约行约理在修在性。异相如何</p><p>六问。钞释无碍无染而染云。法性之与无明遍造诸法。名之为染。染故即有事中之毒及约行之毒也。作此解者。无染之染全属事行毒害明矣。那释理性毒害复指此耶。理若不具毒害。性恶法门至果永断耶。三毒化事作意方有耶</p><p>七问。钞中特陈理毒非性恶者。为显思议耶。为显不思议耶。若谓思议。非今所论。若不思议。一体三用那忽永殊。毒害之义唯属事行。理性本无耶</p><p>八问。钞释理毒。何以都不陈理之相。便云。今观诸法唯心。染体悉净。即神咒治理毒也。此语为释理性所消伏耶。为解理性能消伏耶。若解所消理毒。为指染体耶。为指染用耶。若指染用。必是五住自属约行矣。若指染体。又非性恶。一家所谈性恶法门拟指何物耶</p><p>九问。钞曰。或谓性恶是理毒者。毒义虽成。消义全阙。若无消义。安称用耶(文)。诘曰。一家圆谈若许理毒即性恶义。那得复云消义全阙。若尔。荆溪何故云。忽都未闻性恶之名。安能信有性德之行耶。然不知理毒即性恶者。何异都不闻耶。纵许理毒为性恶。已那又责云。消义全阙。此乃虽闻。而不解矣。且荆溪之意唯恐不闻性恶则无性德之行。今何返此耶。如斯述作莫成坏己宗途否。莫成翳人眼目否。若谓不然。恭请三复斯文。探赜大旨细为答释</p><p>十问。钞指约行。是约智断。智即能断。断即所断。五住断处名消行毒。谓异理毒者诘曰。智即能断。断即所断。更无别体。即指五住。对能断智。名行消耶。断若无体。此即灭无之断。为此所断自有常体。指修即性为所断惑。名行消耶。断若无体。此即灭无之断。与小何殊。断若有体。行毒消处还具理性之毒否。若非理毒。指何为体而论圆断耶。应指别清净真如耶。众生因心但有修恶无性恶耶</p><p>十一问。理性若无消伏义者。约教行理。别释此题。教行名经。有消伏义。约理名经。必可全废耶。若可废者。何名别释题中理经耶。若不可废。那忽简云毒义虽成消义全阙耶</p><p>十二问。理性消伏为约修明。为约性辨。若约修者。不出约行消伏。若约理性。理自消伏。那云今观诸法唯心染体等耶。今观之言修耶性耶</p><p>十三问理消伏义。钞自简云。是则惑性相待非阙智断。今诘曰。理消伏义既云非关约行智断。为指理境非关智断耶。为约迷事非关智断耶。为据性德之行非关智断耶。为并约四义非关智断耶</p><p>十四问。理性若无消伏义者。约行消伏都非性起耶。若然。大师那云。今原性德种子。若悲心<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>庄严显出真身。皆了因为种子。若慈心福德庄严显出应身。皆缘因为种子。今文约行消义非悲智庄严耶。约行伏义非慈福庄严耶。若无本性种子。如何显示约行圆修耶</p><p>十五问。钞云。惑性相待非关智断名消理毒者。为约本净不染五住名理消耶。为用观智照理忘惑名理消耶。若云本净不染都未涉修者。那云今观诸法唯心染体悉净名治理毒耶。若云惑性相待推惑即性名消理毒者。此即约行推捡入空显是修成。何谓约理。荆溪那云理则性德缘了。那云本自二空即性德义耶</p><p>十六问。若云毒义虽成消义全阙者。今家应不合云。原乎因果根本。即是性德缘了。此之性德本自有之。非适今也。性德了因非理消义耶。性德缘因非伏义耶</p><p>十七问。若云惑性相待非关智断行消义者。此则修性理殊。智断体别。大师那云。始则起自了因。终则菩提大智。始则起自缘因。终则涅槃断德。如何特陈惑性相待名理消毒。非关约行智断义耶。性德了因非智体耶。性德缘因非断体耶</p><p>十八问。钞云。惑性相待名消理毒者。此对惑之性为修德境耶。性德境耶。若云修境。则约所起对。理自具。而为研核成消伏义。亦但属修约行明矣。若云性境。法性自尔。非作所成。此性对惑名消理毒者。能对性既云消义全阙。应取但中之理为能对性耶。应取清净真如为能对性耶</p><p>十九问。钞云。或谓性恶是理毒者。毒义虽成。消义全阙。若有。应破性恶者诘曰。若尔。辅行那云。又此理具变为修具。一一修具无非理具。令识修具全是理具。乃达理具即空即中。此之理具既即空中。亦莫破性恶法门耶。大师云。修德相貌在性德中。此亦断性恶耶。理具空中举修德相貌。岂非今约理消伏义乎予谓若凭钞语。一家所宣性德法门都成无用。圆修智行俱成有作。何哉。以谓理具诸行应破性恶法门故。若言性恶理毒消义全阙。则显同缘了始有。奈何修德非圆融耶。夫如是则修性之说倾矣。圆顿之道废矣。述作裨赞宗乘。那忽特违大义也</p></div>"
},{
    "title": "四明尊者教行录 第三卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第三卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>别理<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>二十问</p><p>光明玄当体章问答偈</p><p>绛帏问答三十章</p><p>开帏试问四十二章</p><p>教门杂问答七章</p><p>四种<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>问答</p><p>别理随缘二十二问(并序)</p><p>有当宗学者。问余曰。仁于指要钞中。立别教真如有随缘义耶。余曰然。客曰。且<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>藏师。着疏释起信论。专立真如具不变随缘二义。乃云。不变即随缘。随缘即不变。仍于彼五教中。属乎终教。亦兼顿教。而对破<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>宗谈真如之理。唯论不变不说随缘。审究唯识。正是今家别教。彼终顿二教所明不变随缘。乃是今家圆教之理。仁那云别理随缘耶。余语曰。藏师约何义。判唯识所谈真如不随缘耶。客曰。起信疏云。唯识宗只以业相为诸法生起之本。彼之真如无觉无知。凝然不变。不许随缘。但说<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>生灭。纵转成四智。亦唯是有为。不得即理。故诠法分齐唯齐业识。余曰。灼然。若云真如性有觉知。则可熏变。乃说随缘。既唯顽騃。乃不受熏。既不受熏。安能随缘。变造诸法。因诘之曰。别教真如无觉知耶。若无觉知。何故得名<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。故辅行云。今家教门所明中道唯有二义。一离断常。属前二教。二者佛性。属。后二教。别教中道既名佛性。佛非觉义耶。若中理顽騃。本无觉知。焉是大觉果人之性。况性以不改为义。若因无觉义。至果方有。此则改转。那名性耶。又妙乐云。凡别教中立<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>者。有其三意。一者以理性为佛界。二者以果头为佛界。三者以初地去分名佛界。别教既立佛界。岂有顽騃之佛耶。藏疏既约真如无觉知故凝然。凝然故不随缘。别理既有觉知。验非凝然。既非凝然。那不随缘耶。客遭此诘。兀然失措。余乃语曰。子既不知所以。安得妄有破立。余既悯其无知。乃立数十问。征其谬破立者。令少知别理有随缘义。客曰。愿闻</p><p>一问。藏疏既云。唯识宗齐于业相以为诸法生起之本。故彼真如不说随缘。荆溪既立别教真如在迷能生九界。则以真如为生法本。乃永异业相为生法本。安云别理不随缘耶</p><p>二问。藏疏又云。唯识宗未明业相等与真如同以一心为源。故说真如无觉知凝然不变。不许随缘。荆溪既释别教根尘一念为迷解本云。理性如来为<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>本。岂非业相等与真如同以一心为生法之源耶。既尔。安云别理不随缘耶</p><p>三问。藏疏既云。唯识宗但说八识生灭。纵转成四智。亦唯是有为。不得即理。荆溪既立别理名为佛性。岂是转八识成四智耶。别理既是佛性。即随净缘。成于果佛。那云不随缘耶</p><p>四问。藏疏五教既皆不立理具三千。但就不变随缘。立终顿圆三教。请子委陈三教之理随缘之相。若无异相。安立三教。若有异相。便请细说</p><p>五问。藏疏圆教既未谈理性本具诸法。与今家圆教得泯齐否。彼圆望今圆。尚自天殊。安将终教之理与今圆等</p><p>六问。藏疏不谈理具诸法。为知而不谈。为不知耶。若知而不谈者。则有隐覆深义之过。若元不知者。则不善谈圆。安得与今圆同。彼圆尚不同今圆。况终教耶</p><p>七问。藏疏既未谈理具诸法。是则一理随缘变作诸法。则非无作。若不成无作。何得同今圆耶</p><p>八问。藏疏圆教谈事事无碍主伴重重。似今色香中道诸法趣色等义。与而论之。似今圆教。彼终教不变随缘得作此说否。若说事事无碍。乃是彼圆。非终教也。若未得然者。尚望彼圆不及。安齐今圆耶</p><p>九问。彼终教不变随缘。与金錍所明不变随缘。同耶异耶。若异。则非今圆。若同。金錍明真如是万法。由随缘故。万法是真如。由不变故。约此二义。立无情有佛性也。终教虽立随缘不变。而云。在有情得名佛性。在无情但名法性。不名佛性。既分二派。徒云不变。正是变也。既违金錍。那名圆理。须知权教有名无义。以有佛性之言约解约理说故。约解约理尚未云遍。非权是何</p><p>十问。金錍云。客曰。何故权教不说缘了二因遍耶。余曰。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>无始计我我所。从所计示。未应说遍。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>中带权说实。故得以空譬正。未譬缘了。若教一向权。则三因俱局。如别初心闻正亦局。藏性理性一切俱然。所以博地闻无情无。依迷示迷。云能造是。附权立性。云所造非(上皆金錍不移一字)。二因不遍。尚云带权。正局有情。的属别。终教既尔。那执是圆</p><p>十一问。藏疏明判赖耶为生法之本故名分教。则显真如为生法本乃名终教。子今既信别理无住能造诸法。若不随缘。安能造法耶</p><p>十二问。他宗皆不云无住。子今曲解所依法性可覆为无住。纵子作此曲解。只如终教真随妄转造立诸法。是可覆义否。若不可覆。所造诸法得云一多相入事事无碍否。若尔。何异彼圆。若不尔者。非覆是何。岂真如理性不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>耶。当知终教但理以无住故。不可守佛界之性。为妄扼缚。压作九界。正当可覆义。禀此教者。虽信真如变造诸法。未知事事当处<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>。以此教未诠理性顿具诸法故。若禀今圆者。既知性德本具诸法。虽随无明变造。乃作而无作。以本具故。事既即理故。法法圆常遍收诸法。无非法界。终教所诠既其不尔。那得齐今圆教耶</p><p>十三问。终教说真如是本觉。别教说真如是佛性。性非本耶。佛非觉耶。名义既齐。安得不同</p><p>十四问。唯识宗说。真如无觉知故不能迷。终教谈真如有觉知故能迷。能迷故能悟。故立随缘。别理既有觉知。那不能尔耶。若能者。那不随缘</p><p>十五问。子云。别理无住能造诸法。只是理能造事。乃偏一之义者。岂非但有随缘义无不变义。子元不知不变则终教分教同诠。随缘则独在终教。故明不变未必随缘。若说随缘。必有不变。以是真如性随缘故。若随缘时改变。则不名性也</p><p>十六问。子云。别教云不即。终教说即。为不同者。盖子迷名全不究理。以彼不谈性具九界。乃是但理随缘作九。若断无明。九界须坏。若九界即是真如理者(大意与<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>皆以是义释即如云初心是后心是等)。何须除九。岂非九界定能障理耶。若谓不然。终教还说九界皆是法界一一遍收否。若说。与彼圆何别。若不说者。安称即耶。况彼圆既未谈性具三千。虽说一一遍收。尚未有遍收所以。若比今圆。不成即义。况终教耶</p><p>十七问。子云。性具九界不得云差别者。盖未知理中自有立一切法义也。故妙乐云。理则性德缘了等。又若谓性具诸法不名差别者。何故妙经疏云。若知地具桃李。即识实中有权。解无差别即是差别。若知桃李竖相。即识权中有实。解差别即无差别。既以地具桃李为权。此权名为差别。岂非性具九界得称差别耶</p><p>十八问。止观别教一念心为迷解本。引楞伽理性如来藏为善不善因。子意谓。此句若证终教。则是随缘义。若证别教。则非随缘义者。且今引文略。彼经具云。七识不<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。不作苦乐因(无明体空)。如来藏为善不善因。若生若灭。受苦乐。与因俱(真如成事)。既能为因。又即生灭。此文如何作不随缘解耶。若谓不引生灭等文则非随缘者。且唯识宗中。可云真如为善恶因否。又次文以大论池水喻。此如何通。故云。如大池水。象入则浊。珠入则清。当知池水为清浊本。珠象以无清浊之缘。今问。池水还随此二缘为清浊否。若随者。如何作不随缘解耶</p><p>十九问。辅行释别教<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>云。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>之中有如来藏。凡夫生盲常与藏俱。而不知见。故流转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。却为藏害。且别教菩萨既见众生如是故发心。岂可云真如不随缘耶</p><p>二十问。子云。指要为破安国师立问故。特立别理随缘者。盖子不解安国问意。致兹谬说。如彼问云。别教真如不随缘。起信真如能随缘。未审起信为别为圆。若别。文且相违。若圆。乖彼藏疏。且初云随缘不随缘者。盖为泛学者妄谓别教不谈随缘起信乃说随缘故。顺常情而为问端。既共知起信谈于真如随缘。故定之曰。未审此随缘义是别是圆。盖泛学之者不知真如随缘通于两教故。兹双定。后正难云。若谓起信是别。且违论文。以论文一心摄世出世法及相大。明具无量性<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。是本具千如故。又十住八相是圆教分真。任运垂应是圆位故。若定判属别。则违论此文也。若定判属圆。则乖藏疏。以疏不约心具百界为摄世出世法。及无量性功德不约性善性恶释之。又十住八相不说分真而辨。乃云是伏见思住愿力<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>而作故。若判属圆。则违疏中此等文故。子今若执安国定判终教是今圆者。何故正难云。若圆乖彼藏疏。藏疏正用终教释乎起信。若终教是圆者。作圆说之。恰顺藏疏。那云若圆乖彼藏疏耶</p><p>光明玄当体章问答偈</p><p>慈云忏主问 四明法师答</p><p>遵式稽首延庆法主。窃闻。迩曰纵辩宣扬金光明甚深法门。自惟。匏系<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>拥座。且此经玄义示第五当体得名。此意幽邃。曾弥夕思之不解。谨成偈句。奉以咨承。愿说授外。一为开决。颙俟报音之来矣</p><p>云何是法性自体金光明</p><p>为当从义立为当质亦成</p><p>法性本非质金色由何生</p><p>若从义所立还是假名字</p><p>全金为法界尘尘悉平等</p><p><a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>何所灭赞叹何所荣</p><p>罪福既无二空导是虚声</p><p>空藏空全现地藏地难倾</p><p>云何此同异愿决我疑情</p><p>莲华与稻稗当体若何评</p><p>例同一切法师子弦愿鸣</p><p>知礼和南<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>忏主。自效颦禁足接武讲科。虽为道未深。且格言有在。兹蒙雄问。起自大悲。俾我推寻。令他悟解。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>事冗。久失报投。今漫奉酬。幸希细览</p><p>法性具诸色名为微妙色</p><p>法性具诸义名为第一义</p><p>此义与此色岂可分为二</p><p>性火即真空楞严显其意</p><p>色性即智性起信彰其致</p><p>千如相非相<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>方可寄</p><p>一理空不空毗卢方遍处</p><p>穷色尽邻虚即是本来地</p><p>究心志刹那即是真如智</p><p>鼻嗅功德香舌尝妙法昧</p><p><a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>相得常良由住法位</p><p>法身流五道良由具权智</p><p>心狂金石翳色病念想醉</p><p>心色理无殊质义安曾异</p><p>众生迷本源确尔分情器</p><p>依空行忏赞法界体全备</p><p>光明照世间真金诸法贵</p><p>究竟真实体显召不从譬</p><p>击发此玄微知君二严备</p><p>我以此筹量更请研精粹</p><p>遵式再以伽陀禀问延庆法兄。能一披览。尚俟报音</p><p><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>四无说因缘故立字</p><p>复言第一义有言有实义</p><p>有无与真俗云何辨同异</p><p>诸法即真如无名无有字</p><p>真如即诸法随缘有差异</p><p>起必性三千云何勿名义</p><p>水火性真空空谁分一异</p><p>循业而发现从末方殊致</p><p>建立全由俗云何勿名义</p><p>色性即智性良由体无二</p><p>无二无是非无非本来地</p><p>却俟尽邻<a href=\"/remen/xuyun.html\" class=\"keylink\" target=\"_blank\">虚云</a>何方显智</p><p>元是一精明分为六种义</p><p>方便有多门归元性无二</p><p>无二即如如云何有香味</p><p>药病性相应心色方便治</p><p>水火各升沈顿尔成乖弃</p><p>缘起唯从性云何显不二</p><p>诸法如大幻一多互相寄</p><p>体幻即为真何劳共远离</p><p>尽尘忘刹那云何存没意</p><p>观心初不忍今何忍此意</p><p>取舍虽在我其如且犹豫</p><p>人天大导师云何无决智</p><p>观心亦观色唯只观心地</p><p>色不名观心心无不包义</p><p>同异与相摄云何得其意</p><p>观心唯一念一念三千备</p><p>三千含身土独遗观色义</p><p>三千洎外境云何得齐致</p><p>知礼谨率愚抱。再答灵山忏主来问。幸希采瞩</p><p>涅槃一实谛遮显非殊致</p><p>依言及离言悉是真如义</p><p>此俗洎此真非情是随智</p><p>二谛皆名真此真有名字</p><p>若了性三千此是圆成义</p><p>法法尽真常名实皆尊贵</p><p>依此偏计法如何得为类</p><p>其体若空华何实当名字</p><p>心色体无二情中坚执异</p><p>欲破坚执情须推到边际</p><p>若知依理藏法法无遗弃</p><p>寄此显圆常何曾求远离</p><p>虽是一精明体具三千义</p><p>依正理内含根境性中备</p><p><a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>即唯色唯香亦唯味</p><p>唯触唯是音此理好思议</p><p>水火力相倾明暗能更治</p><p>即此相违中弥见相从意</p><p>相违彰具德相从表不二</p><p>智者善思量本末何曾异</p><p>观心理趣深乍似相违义</p><p>出自旋总持谁当不犹豫</p><p>滥作<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>人自省居何位</p><p>片言难折狱再思方可矣</p><p>九界约修心三道寄心治</p><p>此从外境观外破内方着</p><p>约理虽相合据迷且分二</p><p>究竟知所以敢将情力置</p><p>三法皆称妙唯心最玄秘</p><p>于心见法界生佛齐一致</p><p>迷己逐他物确尔立情器</p><p>见色便见心灼然全性起</p><p>绛帏问答三十章</p><p>四明法师问 净觉法师答</p><p>天禧改元春二月四日。延庆座主出山家教义凡三十条。褰绛帏问诸子。其词惟要。其旨甚微。俾无或者兴布教之功。令不敏者奋强学之志。门人(仁岳)率尔而对。斐然成章。非求鲁国一字之褒。盖请武津四择之诫。既有传写。故兹叙云</p><p>一问。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>初果苦忍真明。何故复云灭非<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。四皆称谛。为谛真耶。为谛俗耶</p><p>答。原夫三藏理唯一真观有四谛理因观显。故云苦忍真明。理显观忘。故云灭非真谛。何者。盖由灭无之真离幻之俗。虽则知苦断集修因<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。皆生灭之事行。非空寂之理体。究论法性。何所迷悟。故大师云。三藏法性自天而然。集不能染。苦不能恼。道不能通。灭不能净。然而由于苦忍方明于真如。析色尽处乃见于空。虽能析所析俱非是空。而见空者。由于析色故也。是知苦忍真明灭非真谛义<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违。又上明必下显。谛俗则谛真。岂前后异耶</p><p>二问。因缘停心与支佛正观何别</p><p>答。因缘停心者。则为初心行人多愚痴之心起断常之见。是以令观三世因缘。对而治之。故荆溪云。三世相续故不断。三世迭谢故不常等。此但略知因缘生相。未知因缘灭相。支佛正观者。非秖观三世而已。乃至能观百千万世。复知生而知灭。兼谛俗而谛真。二观稍殊。不可相滥也</p><p>三问。诸文皆云。支佛观因缘断惑。观相如何</p><p>答。诸文异说。今试粗陈。若如阿含所明。中乘观因缘相。有逆有顺。从无明至老死名顺。从老死至无明是逆。生灭皆然。此乃大概而说。若如<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>。委辨推寻观破之相。或以爱支为首。或以取支为首。亦有逆顺。且如爱支为首者。即推贪爱因何而生。即知此贪因爱而起。乃至行因无明。无明因过去一切烦恼。又顺推。此爱能生于取。取生于有。有生未来二十五有生死等。若观破者。观爱即现在污秽<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>性念处。乃至观无明即过去污秽五阴性念处。又若观于有即善不善五阴性念处。乃至观未来生死即<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>生死无记性念处。是名逆顺观察破四颠倒。颠倒灭则无明灭。乃至老死灭(上皆略义采四念处文义)取支为首者。即见惑之人也。逆顺推破例如爱支。又如止观。明禅境中。寄修辨发。以有支为首。又释签明四教观因缘。皆从爱起。如此诸说不同者。良由根性有殊故。修入不等。今准辅行判因缘观。凡有二种。一者推果知因。二者推因知果。若念处及止观即推因知果也。释签即推果知因也。然此二种之义应用念处为正。以正能顺因缘之义故。因缘既以无明为首。今观爱取即无明也。故大师广示修相。良在兹焉</p><p>四问。阿含既但说三藏。何故八万诸天便发大道</p><p>答。良以渐顿法门体元不二。小大根性理本无差。盖遇熏不同。故得脱有异。今诸天悟大。岂孤然哉。审应昔世曾以小乘谛境修乎大乘观智。今闻本境即发宿种也。譬如先置毒药服于酪中。今再服酪。即能杀人也。然由如来知机知时。随熟随脱。故但用生灭四谛而赴大小两缘。此即显露不定教也。问在鹿苑时。秖云诸天得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。至<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>会。方乃指云。获无生忍。是则声闻等众。不知诸天便发大道。据此莫成秘密教义耶。答。比见学人。多作此说。诘其所以。言无所从。且秘密教者。乃是备谈渐顿等教。各对大小诸机。互不相闻。方名秘密。非谓小益不知大益为秘密也。若鹿苑中秘密之相。如大论说。诸菩萨所见无量阿僧祇人得二乘。无量阿僧祇人得无生忍等是也。今八万诸天但为说小。与诸声闻同见同闻。何秘密之有哉。况大师亲指为显露不定。岂不信乎</p><p>五问。通教受接之后。合作后二教位次<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>。大品经文何故只以第十地为果耶</p><p>答。此由大品十地。兼含衍门三教之义耳。如初地菩萨名为伏忍。二三两地名柔顺忍。四地已去名无生忍。乃至游戏神通净佛国土等皆通三教也。故辅行中。释十地为如佛云。若被接者至此。既破一品无明。亦能八相。故云如佛。岂非十地名义通三教耶。若尔。何故辅行明被接云。谓用前教有始无终。已用七八不至九十。即用后教有终无始。但用向地不须住行。中续接之故得名接。此岂非被接之后依后教位次耶。答若据经文。则无别位。而大师得经深旨。自以十地通于三教。故荆溪具约两教位次。引而伸之。欲令被接之义区以别矣。引广决略。乃作者之意焉</p><p>六问。通教菩萨约何义留习润生</p><p>答。留谓固留。非观力未充不能进断。何则以此教菩萨已于性地及八人地中伏结顺理。为诸众生遍行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。一切事中<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>皆令究竟。如三藏菩萨。于中忍中。三祇行行至已办地。自合真理必显正习皆除。如三十四心。有何不可。但以度生心广<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>时长故。扶之以誓愿慈悲。留之而润生化物。所以须留习者。为无妙应之真体故。用作受身之本矣。故妙玄云。通教亦得有应。但是作意神通灰身灭智<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>住本。约何起应。斯为诚证矣</p><p>七问。俱舍以尘沙为习气。如何留之润生</p><p>答。大师明通教习气。凡有二种。谓烦恼障法障之习气。法障即界内尘沙也。若留习润生者。此正为烦恼之习气耳。以由烦恼是染污无知。无明为体。能招生死故。尘沙是不染污无知。劣慧为体。不招生死故。应云。菩萨为润生故。须留烦恼之习。为化物故。须破尘沙之习。则知二习其体稍殊</p><p>八问。方等既有四教。为是文文皆须四解。为复各有文诠耶</p><p>答。或皆须四解。或各有文诠。逗会多途。不可一揆。如大师释请观音经。始从病相。乃至系念数息闻咒得益。并约十种行人说之。即皆须四解也。如释十六观经。正为顿机。不通渐入。即各有文诠也。或一经具明四教。各有文诠。如净名之类也。所以须四解者。为部教俱带(请观音经)各有文诠者。为部带教不带(十六观经)故知方等教相难明。不可一概也</p><p>九问。般若既只衍门三教。何故仁王经说四无常偈</p><p>答。斯乃以藏助于衍也。且彼经云。普明王依过去七佛之法。请百法师。一日二时。讲般若波罗蜜八千亿偈竟。第一法师为王说偈。即无常等四。岂非正宣般若傍演无常。所以然者。普明既为斑足所捉。将赴其死。恐王恋着身命国土。是故偈意皆劝舍身及国土等。至闻偈毕。诸王皆证三门空定。还是衍门得益之相耳。故今家明通等三教。俱用藏教而为助道。即此意也</p><p>十问。通教三乘共行。如何说菩萨远边</p><p>答。三乘同观幻有。皆取但空。从大分说。故云共行。菩萨非止偏空。兼知中实。从利根说。故得远边。是知若云共教。则菩萨须在当分。唯得近边。乃有局定之妨也。若云通教。则菩萨或被后接。即得远边。乃有<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>之美也。一家所立名义之巧。其若是乎</p><p>十一问。别教独菩萨法。如何说二乘近边</p><p>答。且如通教。不名共教者。盖有菩萨远边之义也。今亦例然。所立别教不名不共教者。盖有二乘近边之义也。但以方等般若中别教二乘共闻。为近边义耳。盖大论约菩萨与二乘不共闻。立不共般若。今别教既有共闻。则非不共闻。故约此义说于近边矣</p><p>十二问。别教不谈即理。何故能造之心是佛性耶</p><p>答。此教真如在迷能生九界。虽不即理。真如岂离于心。如妙乐云。别教法界不出于心。今谓即不即理。譬如一源之水(佛界真如)分为九派(随九界缘)九派虽异一源(事不即理)派水岂殊源水(心是佛性)是则能造之心终日不即终日是性也。若尔。何异圆教不即不离义耶。答。圆教性具九界起于修九。全修是性。故云不离。但由迷修。各自谓实。故云不即。别教真中无九。须断九归真故不谈即理。九中有真。而依真生九。故能造是佛性。今人见事理不即之说。作霄坏顿异而解者。能造是性。此如何通。真如随缘不可与言无也</p><p>十三问。别教理性既有三因。何故别修缘了</p><p>答。理性有三因者。皆但中之德也。别修缘了者。皆二边之行也。边既非中。修则成别。何哉。先以声闻空心断于见爱。次以菩萨假智断于尘沙。斯乃从空边而入有边。用别惑而除通惑。如此二边缘了具足。始为中道遮照方便。须登初地正显但中。即三因横在佛界。故妙乐云。别教虽有<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>之语。三皆在性。而不互融。故成别义。若三皆在修。前后而得道理。成纵。故知性中缘了不是修中缘了。岂同圆教正因缘了全是三千空假中修德缘了即性德缘了。不可烈火而滥圆伊</p><p>十四问。别人初心为甚不修<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a></p><p>答。盖边表之中。如云外月。用虽全于遮照。但是清净真如体不具于见思。安能起对法界。况复本来迷久。顿悟为难。既著有心强。则缘中力弱。故令始行先观偏真者也</p><p>十五问。今家以即离分于圆别。既判华严具此二教。彼经何文谈即谈离耶</p><p>答。荆溪谓。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>意兼含义难分判。祖尚斯说。今何敢评。然而委寻大师引用彼经证于圆别。亦可意解。且如止观引。心如工画师。造种种五阴等。证于圆教。玄义亦引此文。证于别教。故知谈即。不谈即难得显文。但以得意不得意。而分两教。何者。圆人谓心具而造。则诸法无生即在其中矣。别人谓心不具而造。则诸法自住离在其中矣。若乃诸位行相或一多相即。或次第别陈。荆溪已在诸文备载。此不繁述</p><p>十六问。既将华严心造一切。以立千如妙境。是则彼经已明开显。何故云开权局此</p><p>答。正由法华能开华严故。得将心造之文立千如之境。如荆溪明法华佛慧。须发四味兼带之大小。岂不以乳味兼权之教全同醍醐一实之诠。又如大师判华严为枝条。法华为根本。须会枝别以入本圆。今引用者。从会入后说也</p><p>十七问。既云法华是醍醐。何故大经云从摩诃般若出涅槃耶</p><p>答。所判二经俱是醍醐。盖有两番。次第熟脱。若云法华是醍醐者。即初番熟脱。八千声闻无量损生菩萨等是也。若云般若出涅槃者。谓钝根之人于法华不入更用般若洮汰方至。涅槃即后番熟脱。五千起去人天被移等是也。虽有两番。初番为正。故荆溪云。法华已开。功非彼得。大阵既破。余党不难也</p><p>十八问。经云我闻。何故须用四教解释</p><p>答。若释法华前经。盖明部教兼带等别机缘大小之殊。若释法华。意在开偏咸令会实。又复应以藏通等四入顿渐等四。拣前四味我闻不同显出法华。我闻亦异。则所闻法体超过八教。故妙乐云。若消诸经。但用藏等。其文稍通。若释法华。无顿等八。举止失措。问。法华既尔。涅槃云何。答。妙乐释我闻云。大经显圆。今乃义开耳。故知二经不无少异</p><p>十九问。释方便品题云。妙达于方。即是真秘既开显已。那得云秘</p><p>答。观乎真秘之言。不同隐秘之义。若为实施权。权名隐实。则方便之名正当隐秘。若开权显实。实外无权。则方便之名即是真秘。盖指权方之秘即是实相之真。故云真秘。又十界百界即空即中。离言说相。离心缘相。故云真秘也</p><p>二十问。常观三德。能所俱四。试陈行相</p><p>答。此妙乐观心四一之文也。文以三德对理教行三。和合三法成假名。人即观行如来等。而云能所俱四者。盖显境观不二也。何则且所观之四者。谓迷中三道即本有三德。众生妄我即理性如来。能观之四者。谓见思王数修空假中。如是<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>亦全三德。还用妄我为观行如来。是则两重四一。皆即障是德。举妄全真。能观所观只一四一。故知境自照境。心不知心。佛之知见于兹悟入</p><p>二十一问。释一大车体及具度等。既皆从果德。如何用此为十乘观法耶</p><p>答。众生本心具佛果德。虽迷转三道。必体包十乘。故辅行云。理性车体具度资成。白牛观照在一念心。是知理乘全驾于佛乘。因德岂惭于果德。所谓不动而运。不行而至。善恶不离于车体。故言更无余乘。果理要在于行门。方名等赐诸子。妙乐云。人天善恶与法界同。故父果车是子理车。但开其情假名等赐。即其义也</p><p>二十二问。大通应佛只在同居。何故名结缘本土</p><p>答。若唯谈权教。可云应佛只在同居。今既已说圆乘。即是法身。而依本土。如法华中龙女所赞。指释迦作遮那之身。劫火所烧。以娑婆为寂光之土。大通身土岂不然乎</p><p>二十三问。声闻之法的就何义开为经王</p><p>答。的就偏真之理。开为实相之理。所谓三千三谛统摄自在故称王。释签云。三乘已证权理。以理开理易明。今据此也</p><p>二十四问。博地在事。那云理即</p><p>答。只缘在事故云理即。盖指三障之事即三德之理。故妙乐云。理无所存。遍在于事。亦可云。理即简于后五事即之义。名字乃至究竟。岂非解行<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>等事耶。如妙玄云。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>得事。凡夫得理。记释曰。圣人得于因果化他<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>之事。众生但得非因非果迷中之理。故知理即简非事即。乃贬斥之义耳</p><p>二十五问。性德之行何故须闻性恶</p><p>答。不闻性恶则无性德之行。何哉。众生本来未曾离恶。若迷性具。须藉别修。故先空次假。缘理断九。苟或了恶是性。从性立行。不亦性行。须闻性恶耶。且如圆人依第六王数为发观之始。既知王数即是性恶。用此发观。岂非性行。是则性恶全是智照无减之义。孱然行起真流无作之义明矣。经云。不断痴爱。起诸明脱。斯之谓欤</p><p>二十六问。圆教四谛约何义故得称无作</p><p>答。但约苦集理具。则知道灭空虚。以理不可除故。功无所作。从本迷故。全<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>涅槃为烦恼生死。于今悟故。全烦恼生死为菩提涅槃。四不相倾。一一绝待。皆由四谛元是一理故也。大经玄义云。非苦非苦因。非苦尽非苦对。而是一实等。岂一实理而有作为取</p><p>二十七问。毕竟空观纤尘不立。何故空中具一切法</p><p>答。三谛俱空。方名毕竟。一切诸法悉在其中。且如真谛空有。具二乘界法。俗谛空有具菩萨界法。中道双遮空二边具佛界法。中道双照空佛界具九界法。不前不后。非一非三。三谛顿亡。即纤尘息矣。百界圆足即诸法宛然。是知三千俱空。未始不具。三千俱假。未始不空。此唯一家所谈。他莫能及</p><p>二十八问。同体如何说九界权相</p><p>答。若据同体言之。则百界一念不可分别。今说九界权相者。盖佛界九界不分而分。则非权非实。而权而实也。何者。虽九权皆实。而相相宛然。净之与秽参而不杂。且如<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>一界。虽具十界。岂以地狱性相便同畜生等性相耶。故知九权是三千少分。不妨非局而局。无差而差。一实是三千全分。故能非遍而遍。差而不差。但以一实不出九权。少分不离全分故。云同体也。若理若果莫不咸然。如荆溪云。物理本来性具权实。又云。至果契本权实。岂同他宗谓理无九界果唯一真。同体权相何由可说</p><p>二十九问。一切依正或云众生业感。或云诸佛变现。是二何者为定耶</p><p>答。二义相须不可偏判。若其依正千差苦乐万品者。乃众生业感也。如云苦乐由生非佛所作。然此业感复是诸佛妙应。随众生心而为变现。盖折伏摄受令成熟得脱。如云苦乐由佛不关众生。虽诸文中随缘别陈。究论二义不可暂缺。良由众生心地三千与<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>地三千不殊故。得染净互通感应无忒。众生迷故。于佛依正而计差别。诸佛悟故。于众生依正而得自在。是知果中胜用不异三道流转。又如圣人变化所造。不出众生三世变造。故云亦令众生变心所见</p><p>三十问。人有生死。物有凋变。何故经云世间相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a></p><p>答。若知常住之体具足三千。则生死凋变皆常住标帜之相也。从本自尔。非今始然。既知生是性生乃至变是性变。性元不动。相岂非常。但局情未忘。则生死相反。傥唯心所见则凋变皆如。自非性具之谈。安会相常之旨。虽藏疏谓之不变肇论谓之不迁。若以今望他则皆有言无义。荆溪云。永异诸说。梁肃曰。抗折百家。岂虚言哉。良有以也</p><p>开帏试问四十二章</p><p>诸子勤勤习学。而于一家教观津要。若何领会。由是敬率诸部文义四十二条。开帏试问。幸征文说义。一一答上。庶几开发后昆也。天圣甲子岁五月既望。延庆座主云</p><p>一问。待粗明妙。独褒法华。合对四时三教皆名为粗。文中何故同于诸经。先待鹿苑而为粗耶</p><p>二问。绝待释妙。绝粗开粗。亡能亡所。究论此意。是何法门方能绝待</p><p>三问。金刚藏说。佛甚微智辞异意同。空有不二不异不尽。意明三谛皆是经体。荆溪何故特云空假即中方为经体</p><p>四问。因果宗成方能取体。合先明宗方辨于体。约何义故前体后宗</p><p>五问。断权疑近疑。生实信远信。为妙经用者。且断疑生信。自是<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>智能。那云是经力用耶</p><p>六问。名等四章重重已约四教五时判后论开。何故第五更明教相</p><p>七问。生灭四谛既皆属事。若唯谛事。何能入真</p><p>八问。无生因缘十二法皆不生灭。即一一常住。那云此教初不知常</p><p>九问。别教四谛依何义故得名无量</p><p>十问。苦集灭道是迷悟因果。正是修得之法。圆教何故名为无作</p><p>十一问。三藏教说实有为俗。析灭归真。如何析之令实有灭。请陈行相</p><p>十二问。界内两教俱有三乘。藏教何故三因大异。通教何故三因大同</p><p>十三问。三藏教中自有小乘中乘大乘。法华何故都以三藏为小乘学者</p><p>十四问。金錍引大经一十。复次遮邪计空非佛性喻。离一十空外。为指何空是佛性喻耶</p><p>十五问。义例点不思议境。凡有四意。首于无情境立佛乘义。此为是色具耶。心具耶。若云色具。止观正云。介尔有心。三千具足。若是心具者。何谓无情。立佛乘耶</p><p>十六问。智者自于普贤道场。见宿世事。证法华<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。何故却云南岳授天台圆顿之理</p><p>十七问。观于缘生。缘生即空。空假不二名为三观。荆溪云。作此说者。尚未成通。离此观外通教三观。其相如何</p><p>十八问。圆理所具惑业之法与性恶。同耶异耶。若同。性中惑染体相如何。若异。果理究显有修恶耶</p><p>十九问。为令众生开佛知见。约心辨相。归趣如何</p><p>二十问。妙玄以五重玄义。别对四悉。有何深致</p><p>二十一问。百界千如。百如千界。互辨名数。妙旨如何</p><p>二十二问。圆教二谛约教行证明随情智。其相如何</p><p>二十三问。四念处云。一念心中具十界苦惑。名无作苦集。佛界辨相修性如何</p><p>二十四问。三教我闻并约耳根。圆教教即是闻。辨相和会旨趣如何</p><p>二十五问。大经八教具八别耶。若具何谓知常。不具如何论别</p><p>二十六问。大经四教知常。故得相即。既异方等。必同法华。若同。法华开废等耶。若异。四教云何相即</p><p>二十七问。化仪化法两种四教。判释<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>罄无不尽。云何妙乐谓之法华超八教外</p><p>二十八问。昔经今经谈圆不别。荆溪何故却云。始自华严终至般若。但次第三谛摄</p><p>二十九问。依法华约修约证明三慧。分齐如何</p><p>三十问。<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>乘者。广寻教观。进修己行。毕竟的指。何文开发信解。请陈相状</p><p>三十一问。法华本门授记数倍众经。云何但于事成远报。证入如何</p><p>三十二问。大乘真伊喻不思议。如何却云一点在上</p><p>三十三问。大经五事对五佛性。据文伸义。深旨如何</p><p>三十四问。智者心要唯有一偈云。实心系实境等与止观。同耶异耶。若同。非别有心要。若异。名坏驴车</p><p>三十五问。若遇他求安心要道。指何法门示令易解</p><p>三十六问。如学妙乘者。初修闻慧。要行如何</p><p>三十七问。生佛皆具三千。同异如何。宜究其旨</p><p>三十八问。金錍云。木石<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>之语出自小宗。随缘不变之言生乎大教。此约何义分大小耶。若云半满者。通无随缘不变之言。别有木石无心之称。若云真中者。别妨同前。若云偏圆者。通别定非小宗。其妨弥甚</p><p>三十九问。名诠三法。教判四章。何故妙宗云。五重玄义本是经中所诠观法</p><p>四十问。寂光既具金宝泥沙之异。那得经云唯佛一人居净土耶</p><p>四十一问。圆人初心顿以果地三德而为观体所以如何</p><p>四十二问。止观云。以观观昏。即昏而朗。以止止散。即散而寂。荆溪对释此二句云。照此昏体。一观而三名。即昏而朗。寂此散体。三止而一名。即散而寂。且一观昏耶。三止散耶。三观朗耶。一止寂耶。不然。何以对释云即昏而朗即散而寂耶</p><p>教门杂问答七章</p><p>四明法师问 门人(自仁)答</p><p>大中祥符七年。讲授次。未知学者浅深之解。因出数问。请各答上</p><p>一问。荆溪云。忽都未闻性恶之名。安能信有性德之行。然则由性恶而修性行。说听久矣。的论旨趣未审。若何</p><p>答。荆溪立此二句意。显圆宗无作之行耳。盖由圆人创心修观者。皆以见思王数。而为发观之端故。若前三教人。以教不谈性具九界。则见思王数不即性恶。既非性恶。定为能障。故须别修观智破此惑心。方显本有常住之体。遂致惑智待对境观不忘行成有作矣。今圆实教中既诠性具九界。则见思王数即是性恶。惑既即性。只以此惑而为能观。惑既为能观。其孰为所观。能所一如。境观不二。辅行所谓非但所观无明法性体性不二。抑亦能观观智即无明是。以是义故。方知初心修观造境即中无不真实。功由性恶。融通无作之行于兹成矣</p><p>二问。法华既显一实。何故玄文释题而明二妙</p><p>答。法华为开权显实之教。乃一代之所归。五时之极唱。若不以二妙甄之。则一乘显实妙义难彰矣。且初相待论判粗妙者。彼此互形曰相。以他望己为待。盖待前四时七教之粗。方显法华一乘之妙。良以昔日诸经机缘未熟。部味教观兼但对带。不若法华淳圆绝妙。是故为粗。故经曰。正直舍方便。但说无上道。已今当说此<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>最为第一。以故此经淳一无杂。独得妙名。良由以也。次绝待论开粗显妙者。绝前诸粗。无可形待也。盖以法华之妙有绝粗之功故。使昔日四时七教之粗。一经法华开显。以一妙乘贯而绝之。粗即是妙。妙外无粗。权即是实。实外无权。譬如神仙九转丹砂点铁成金。一成真金。不复为铁。故经曰。决了声闻法。是诸经之王指汝所行是<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。开方便门。示真实相。一开之后。无所间然。无小无大。咸归佛界。一切诸法。皆是佛法。更无余乘。直显一实。是名绝待论妙也。然此二妙若非相待以判。则不显法华超过诸说。若非绝待以开。则不知法华妙一切法。解释一题陈兹二妙。兹所谓抗折百家超过诸说者。其为吾祖乎</p><p>三问。行妙中所论慧圣行。与上智妙。如何拣异</p><p>答。慧行智妙其实不同。良由智妙是通论其解故。释签所谓解即是智是也。若慧行者。慧是妙观。照于妙理。不假助缘。而名慧行。是则智妙是依理生解。慧行是照理之行。行解既分。可知是异。然则智为行本。则行藉智生。行能成智。则智藉行成。行解相资缺一不可矣</p><p>四问。一切大乘经论皆谈一切众生本性清净。台宗明性具十界。六既是秽。如何合诸经论耶</p><p>答。十法界六秽四净。台宗既云性具。即是性恶法门。安得不清净乎。明此应具二义。一约情智说。二约迷悟分。情智者。如云以情分别诸法皆邪。离情分别诸法皆正。今之圆人应用佛眼种智了达一念染情体具十界互融自在则一切诸法悉皆清净。荆溪所谓故知刹那染体悉净者是也。二约迷悟分者。当知迷则十界净秽俱染。悟则十界净秽俱净。台宗所明十界性恶法门悉皆清净。正约悟解边说也。故荆溪曰。三千在理同名无明。岂非迷故三千俱迷也。三千无改无明即明。岂非悟故三千俱悟乎。然此二义犹是对修门说。若直约平等法界而言之。则非修非性。非迷非悟。非净非秽。一切众生不劳造作。本性灵明。具足十界。不受诸垢。故经曰。五道清净不受色。有学此者成大道。岂非一切众生法界本净乎</p><p>五问。一切依正或云众生业力。或云诸佛变现。究论何者为定耶(綘帏亦有此问。答文大同小异。故此重录)</p><p>答。不可专执。要须二义相承可也。当知诸佛变现依正种种不同。意在折伏众生令彼断恶修善超凡入圣故也。故曰。苦乐由佛。不关众生。若众生业力者。盖众生自造其业。而感依正差别之报。故曰。瓦砾七珍由生所感。非佛所作矣。若定执众生业力所感非佛变现。则显诸佛无度生之功。若定执诸佛变现非众生业力。则堕外道无因果之论以是义故。诸佛变现由众生业力。众生业力全诸佛变现。二义相须依正成立</p><p>六问。台宗说。一空一切空。又云。空中具一切法。其相云何耶</p><p>答。夫言空者。必空假中一心三观之道也。此道始则佛大圣人金口中乃龙树大士造论。后则北齐台衡祖承。然则虽曰<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>宣扬。其实一切众生身心本体。所言空观者。一切法俱空。无假无中。而不空。此空为妙观遣荡之法也。所言假观者。一切法俱假。无中无空。而不假。此假为妙观立法之法也。所言中观者。一切法俱中。无空无假。而不中。此中为妙观绝待之法也。此三三一一三。无寄谛观。名别体同。妙体天然。不劳造作。终日遣荡。而法法圆成。终日立法。而法法离相。终日绝待。而二边宛然。今之圆人解了三观体性相即。则达空中二观。不有纤尘。而诸法备矣</p><p>七问。止观破法遍中。先约四句破见思假。次约药病破尘沙惑。后约真缘破无明惑。次第如此。如何谓之一心三观破法遍耶</p><p>答。言不顿舒。文似次第。文虽次第。意实圆融。文似次第者。为对破三惑故。先空次假后中。意实圆融者。良由行人修之。乃举一即三。非前非后。故云。说时非行时。即兹意也</p><p>四种四谛问答</p><p>四明法师问 门人(自仁)答</p><p>四种四谛出自大经。祖诰备陈寻常说示。犹恐闻者领略不亲。暗于文义。今因讲次。即此命题。仰各形言而伸释之。延庆座主问</p><p>答。原夫四谛而不减三又不增五者。盖药病相对。因果义足故。而台宗以是对四教者。莫不摄偏圆含二理。一期化道始终备矣。藏通则诠界内真谛。别圆则诠界外中道。又理虽二种。而教分四殊。藏通为界内巧拙。别圆为界外巧拙。又前二诠真。真理不殊。别圆诠中。中分但不但。藏通所有诸法皆由业惑构造。别圆所有诸法皆佛性变造。通称为谛者。谛是审实为义。又是谛了为义。此并总示。后更别陈</p><p>藏教生灭四谛者。苦集灭道皆生灭法也。欲明其旨先示四相。所谓重檐逼迫系缚等。是苦相。见爱烦恼能招来果。是集相。<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>无常苦空能除苦本。是道相。二十五有子果俱断。是灭相。如止观云。苦则三相迁移。集则四心流注。道则对治易夺。灭则灭有还无。次究其旨者。生灭之意也。此教所化三乘是界内钝根。观智既拙。而不能解了六凡法界当体即空。乃次第析尽方见于空。是故六凡于生灭境中。随事而辨。则诸法念念迁移。如灯焰焰。似水涓涓。故谓之生灭四谛也。若论真谛。法性自天而然。则非生非灭矣。问。既云。因灭会真。灭非真谛。何云道灭是真苦集是俗。答。婆沙所谓俗谓苦集。第一义谓道灭。荆溪释此。谓合四为二也。又苦集迷真。道灭顺真。此乃对分迷悟也。又有苦集时则无道灭。有道灭时则无苦集。此药病对治之义耳。又有真谛时则无四谛。有四谛时则无真谛。辅行所谓更互相倾也。若论三乘进修。又初门不同。声闻则以苦谛为初门。缘觉则以集谛为初门。菩萨则以道谛为初门。况大经云。凡夫有苦而无谛。二乘有苦而有谛。当知一乘之人既知苦断集。慕果修因。故云有苦有谛。凡夫则不然矣。此上诸义并不出乎生灭境观。核其所以。只缘藏教之人迷真重故。从界内事以立兹名</p><p>二通教无生四谛者。四谛名相与三藏同。若论教旨则异。故曰苦无逼迫相。集无和合相。道不二相。灭无灭相。辅行所谓观所生心与前不别。能观观智即空为异。即空异者。藏是生灭观智。通是无生观智也。中论曰。诸法不自生。亦不从他生。不共不无因。是故说无生。亦是通教谈于四性无生幻故。故言无生。如大品曰。若有一法过涅槃者。我亦说如幻等。非其义欤。又净名谓。法本不生。此因不生也。今亦无灭。此果不生也。因果既不生。故言无生矣。而如此者。良由此教所诠三乘根性观智巧故。则能体了六凡幻法当处即空。既即真空更无一法可以当情。故谓之真空一寂涅槃也。又复应知。通教虽受即空之名。若以圆望之。有言无实。何者。以通教教旨非是全体起用全理成事故。夫言即者是也。全体是用。全用是体。体用不二。乃圆教所谈也。别教虽诠中实之理。理在事外。尚非即义。况通教乎。是知通教但有即名而无即义明矣。当知此教由迷真轻故。从界内理立无生名</p><p>三别教无量四谛者。此教所诠别菩萨法。历劫行行修习河沙佛法。故称无量。然所修虽曰无量。若指其要。不出药病四种。故曰。苦有无量相。十界果报不同故。集有无量相。尘沙烦恼不同故。道有无量相。非诸声闻缘觉所知故。灭有无量相。诸波罗蜜不同故。既有苦集之病。则有道灭之药。药病种种对治不同者。良由此教如来藏理而为尘沙烦恼所覆故。修尘沙法门而对治之。故辅行曰。照知一心。起无量心。心无量故。迷解无量。迷则十界苦集。悟则十界道灭。即此意也。然此教论理则是界外中道佛性。此性为一切法而作依持。但其体不论性具。唯论性起故。使诸法当体不即。荆溪所谓派出不云理。是故知是别是也。问。圆教诠具法中道。随缘起三千之用。何故不受无量之名。答。彼圆从实相理乃称无作。此教既是附权立性。云所造非。安得与圆同哉。当知别教所以与圆异者。良由界外钝根迷理之甚。贬之为无量四谛矣</p><p>四圆教无作四谛者。此四立名无作。直指其要。不出以性夺修。是故诸行无作。今广此意乃有其三。一药病相即。如妙玄云。以迷理故。菩提烦恼名集谛。涅槃生死名苦谛。以能解故。烦恼即菩提名道谛。生死即涅槃名灭谛。当知即之一字众妙之门。烦恼生死乃众生之病。今以一实理观体而导之。病即药。药即病。药病一如。更无所作。故云无作。一实外无余。止观曰。阴入界如。无苦可舍。尘劳本清净。无集可除。边邪皆中正。无道可修。生死即涅槃无灭可证。而如此者。良由圆教所诠不出一实。一实之外更无余法。龙树所谓除诸法实相。余皆落魔事。实相无相。遍一切法。无生死相。无涅槃相。所有诸相相相真实。是故四谛俱称无作。故四教义云。约一实以明四实谛。此四毕竟不可得。即是一实谛。是名无作四实谛也。非其义欤。三性恶融通圆实教中。所有苦集即是性恶。道灭即是性善。今论性德之行。若全性起修。则一一行业皆悉无作。若全修在性。则介尔有念莫不圆成。是知性虽本有不改。而不妨全性具三千起为修德三千。修虽修治造作。而不妨全修德三千即是性具三千。如是则性外无修。修外无性。修性一如体用相即。故玄签云。在性则全修成性。起修则全性成修。性无所移。修常宛尔是也。大哉圆乘于修于性既无增减。无作之义于兹更明。他宗不明性具。万法尽属有为。以是较之。诚不可与同日而语矣。圆论三义并显无作。只缘此教迷中轻故。从界外理以立斯称</p><p>以上<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>义谨按山家教观。略述梗概如斯。(自仁)言词孟浪。学问疎慵。伏惟和尚不弃荒芜。肯赐慈览。至幸 门人(自仁)谨答</p></div>"
},{
    "title": "四明尊者教行录 第四卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第四卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>答日本国师二十七问</p><p>草庵录纪日本国师问事</p><p>再答日本国十问</p><p>答泰禅师<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>十问</p><p>再答泰禅师三问</p><p>天童凝禅师上四明法师第一书</p><p>四明法师复天童凝禅师第一书</p><p>天童又上四明第二书</p><p>四明又复天童第二书</p><p>天童又上四明第三书</p><p>忠法师天童四明往复书后叙</p><p>草庵录纪天童四明往复书</p><p>答日本国师二十七问(并序准行业碑。则云二十问。若据传写诸</p><p>本。并载二十七问。恐续后问答参入前文。今依二十七问 行)</p><p>日本国师问 四明法师答</p><p>皇宋咸平六年癸卯岁。日本国僧(寂照)等。赍到彼国天台山源信禅师于天台教门致相违问目二十七条。四明传教沙门(知礼)凭教略答。随问书之</p><p>诸方匠硕或一披览。无吝斤削云</p><p><a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>疑问二十七条。恭投函丈。伏冀垂慈。一一伸释。不胜至幸</p><p>日本国天台山楞严院法桥上士位内供奉十大禅师 源信 上</p><p>一问。法华三周授记作佛(云云)。近代疑者。云。为是初住佛。为是妙觉佛。若是妙觉者。大师常云。初住八相佛也。若是初住者。圆顿速疾经一二生尚可究竟。况经无数劫耶</p><p>答。三周所授乃八相应身记也。此之八相始从初住分显法身。终至妙觉究竟法身。皆能现此益物之相。三周得入者不局初住。如疏云。身子既是上根利智。必是超入。而多云初住者。盖指其首耳。又皆云经无数劫者。与物结缘。作净佛国土因也。若无众多受化之机。如何现身<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>耶。若论法身之本。乃即座而得。岂待经无数劫乎</p><p>二问。譬喻品记云。身子于十住中第六心退。恐是尔前见思俱断。至六心时。见犹未尽。六心尚退。近代疑者云。别教初住界内见惑皆已断尽。岂第六住见犹未尽退作凡夫逆罪人耶</p><p>答。若常程别教皆云初住断见更不起诸重过也。况见惑名数虽多。乃一位顿断。思惑乃经诸位方尽。此常所谈别教分齐也。今记主见云身子六住尚退复起重罪。遂以义求。恐有教门见思俱断。至六心时。思犹未尽。见亦余残。所以能牵恶道也。此是记主约义斟酌之词。不可将现行别教难也。若据起信。唯云不退。乃克就圆人辨之。若论示迹。亦须示其阶位。约惑分齐。方有退义</p><p>三问。化城喻品疏云。问如上尘数。多许时节。今始得罗汉。当知无生法忍何易可阶。答。一云。大圣善巧依四悉檀作如是说。对治厌道长者说短。于道生轻易想者说长。当知言如许劫方今得罗汉者 此是如来权行四悉檀。引诸实行。令入道耳。近代疑者云。泛尔说佛道长短。或可是善巧四悉然大通尘数劫犹是指实事。若不尔者。则何劳展转摩重重土。莫不徒费言词耶。是事若非实。诸所言说权实难辨。加之。疏第一许久远为种过去为熟近世为脱者。记判之为本眷属也。此何言始得罗汉者是权行四悉檀耶</p><p>答。诚如所问。然有其由。何者。若远讨父子之因。深穷种熟之际。诸经未谈其始。此品亦未及说。须依寿量品文方尽<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力。但为若推远种。定指长时。则<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>不起壮心。不强自力故。今疏记且作悉檀解之。欲使立行加功。乃弘经之要也。故虽一生十地三世六根。若无宿种冥熏。岂有利根自发。又若此品唯论权示远寿。亦是虚谈。将何永异诸经。将何以明本妙。虽曰初心凭教。还须以义自裁。加复疏标一云。知非定判。记斥端拱。信是策词。若据斯文。全非违教也</p><p>四问。宝塔品。依多宝本愿分身咸集。疑者云。大论明释迦分身土云。白银世界。纯有支佛。黄金世界。纯有罗汉。彼土诸佛皆悉来否。若来者。<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>所照分身国土。皆以玻璃为地。不云白银黄金。又分身土有诸菩萨。分身来时。各将一大菩萨。而彼二世界不云有菩萨也。若言不来者。即违尽还集一处之愿。又违悉已来集之文。有遮难者云。约多分云尽集悉来。或云玻璃为地。有诸菩萨。如置绿豆乌豆聚中。以少从多。名乌豆聚。重难云。若约多分。还招巨妨。彼十方佛土唯有一乘之文。声闻菩萨皆<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道之言。亦应从多。若尔。即同五性宗意耶</p><p>答。经论相违。其例不少。不须和会也。今若强会者。此经虽则云皆以玻璃为地。何妨树木宫殿。或纯黄金白银。亦得云黄金白银世界也。又本居之土虽无菩萨。欲来集时。为同诸佛故。将化菩萨来为侍者。应无大妨。又诸土唯云菩萨充满者。盖约今经开显而说。但化菩萨。不为二乘。乃直以二乘而为菩萨。有何不可</p><p>五问。提婆品记释龙女所从来处有三义。其第二义云。海众纵移。而龙宫不动。龙谓不动。而所居已变。从变而不变处来。有何不可(云云)。疑者云。此中指何处名为所居。若龙宫者。上云不动。下那忽云已变。若大海者。上云龙宫不动。不云大海不动。今那忽约大海。云龙谓不动耶。又变而不变者。其意云何。近日学者各执不同。试垂一决</p><p>答。经云。移诸<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。记云。海众纵移。经云。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>即变琉璃为地。至无大海江河。验是移于有情。变于无情也。于有情中。娑竭龙众以有缘故独不被移。龙既不移。所居宫殿岂可依于宝地。即须在大海也。故知。此会之众以佛神力变故皆见宝刹。龙众自见海中宫殿。今文殊随彼类见。故经家云。从于大海婆竭罗龙王宫自然涌出也。变而不变。思之可知</p><p>六问。寿量品疏云。华严寂灭道场大经超前九劫皆成方便。疑者云。大经唯有雪山童子超十二劫。此中何云超九劫耶</p><p>答。或录者笔误。或后人写讹。况无大害。何足苦疑</p><p>七问。分别<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>品疏云。或可一人有八番增。或可一世或八世或无量世或一念或八念或无量念(云云)。疑者云。疏第四云。三周声闻未断无明。有<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>利钝。若真修体显。则无差降。初住已上更起缘修。无复胜负。真修体融。宁得有异耶(云云)。今何有一念八念乃至无量世差降耶。若尔。云何论父母所生身证妙觉耶若许证者。经以龙女为速疾证。而大师判为初住八相。既有速疾证理。何故龙女不是证妙觉耶。况复起信和会诸经长短两说。唯以三祇为证理。天台不可违马鸣也。若不许者。既有一念八番增损。何不许一生四十二番耶。圆顿速疾之道。岂必经尔许劫耶</p><p>答。第四疏云。三根入初住。犹有利钝不。记云。即此三根入住已后。犹名三不。今据记主出问意者。入住之后。身子等为上根。饮光满慈等仍是中下耶。疏答云。真修体显则无差降。此答意者。三根证理之后。纵起缘修。终不准前上根仍上中根还中等也。故知。为被根性求定故。云真修无差。若自判法身增道损生。宁无迟速耶。故有一念八念三世八世等异也。又问一生妙觉者。疏既有一念八番。金光明中复有生身十地。以此验。即身证妙觉。非一向无。但为<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>中初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>时便成正觉之文正是初住八相。世人多谓妙觉法身。则全失四十一位<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>。是故今家凡判八相。多在无生位中。且龙女修证之文。及以南方成佛之相。难可的判高下。盖发心毕竟二不别也。余处所明。初登地住。三因开发。既得无生。则任运证于后位。且龙女畜生之报便证此位。即能八相。益物足显速疾证也。若据起信。既是通伸衍门三教。定说劫数之文。恐是别教教道之义。若云马鸣天台不可相违者。如天台判本门记别则一向不用天亲本论。本论尚自去取。况通伸论耶</p><p>八问。<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>品第五。十人展转闻<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。一念随喜所得功德无量无边。疏判为初随喜品。合有五十功德。又劝发品云。成就四法能得是经。疏云。旧说能行四法。手得是经。今谓不尔。上文谓。诸法实相义已为汝等说。又云。为令众生开示悟入佛之知见。盖法华之正体能行四法必得此解。疑者云。大<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经说。善根未熟薄福德故。尚不闻名字。况得手执。若手得者。速坐<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>座。又云。一经其耳。善根力故。定得无上菩提。即知虽不具五十功德不解实相。但闻名字手执经卷者。皆是功德无量。诚不可偏取于此也</p><p>答。释经浅深各有其致。今经随喜具有二种。谓内解外事。外事容可浅释。内解须作深明。若劝发品。既是普贤远来重请说经。如来因兹略演四法。若非开示悟入总括一经。何能酬其所请。能请之位既高。所得之经岂浅。故不可但作手得经卷解也。彼般若经手得耳闻既成菩提之种。岂无善根者有斯遭遇耶。若成不坏之种。即有出离之期。故有速坐定得之谓也。况彼手执耳闻宁可一向作浅事解之。且夫弘经。本为生善。若不以理行策之。其可得乎</p><p>九问。法师功德品疏云。梵王报得天眼。在己界遍见大千。大千外有风轮。与眼作障。不能见外。若在他界。则不遍见大千。非所统故。大罗汉见大千。辟支佛见百佛世界。不以风轮为碍。亦无己他界隔。疑者云。大论第五云。大罗汉少用心见二千界。大用心见大千界。辟支佛亦尔。又论一十四云。声闻人极多傍见小千。上下亦遍见。问。大梵王亦能见千世界。有何等异。答。大梵自于千世界中立则遍见。若在边立则不见余处。声闻不尔。在所住处常见千世界。辟支佛见百千世界。据论意云。依任运用心。大小等别。二乘所见各有不同也。然梵王所见千世界应是一小千。支佛所见百千世界应是百小千。又十住毗婆沙云。二乘神通不过大千。今何云梵王见大千辟支佛见百佛世界耶(百佛世界论文意当百千世界。故<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>四教义并云。支佛发天眼。乃过三千见他方界)如是等事相不同。要须有定论也</p><p>答。总持菩萨之言必称<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。盖曾躬讲智论。应不徒然。乃是妙解论文。得其远意。何者。如论伸两教之义。文中凡举二乘。即兼藏通。只如所引。岂是一途。初云大用心者见大千。次云极多者见小千。声闻既有多种。支佛不可一准。既习气分侵。合所见更广。文中既云见百千世界。岂可定为小千耶。只为小辟支与声闻不别故。云支佛亦尔。梵王诸教功用亦多。但为让彼二乘故。令劣于一等。然是大千之主。宁见己界不周。愿将法义定文。无使专文失义也</p><p>十问。不轻品说。因行不轻行。疾得成佛(云云)。疑者云。此不轻事望久远实成。为前为后。若前。即违寿量疏云常不轻更近之言。若后。谁信由不轻行成佛速疾耶</p><p>答。若在前者。即是实因。若在后者。即为净佛国土之因也。故知。依此经意。偏示正因。行不轻行。即速疾取土。而得成佛。故云。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>此经。为人说故。疾得佛道是也</p><p>十一问。嘱累品疏云。佛以一权智善巧之手。摩三千三百那由他国土测塞<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>诸菩萨实智之顶。疑者云。指何等国土名三千三百那由他耶。有云。指三变<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。八方各更变二百万亿那由他国。若依此义。可云三千三百。此说是不</p><p>答。据理。须指三变净土也。此中应非大千为一国土。恐指一四天下为一国矣。娑婆既是大千之名。则可足成三千三百。然则大千亦似未及一百万亿那由他四天下。恐约大数。增至大千。何者。小数则十十成百。百百为千。千千为万等故</p><p>十二问。嘱累品记出<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>华误云。宝掌菩萨离开为二。更加宝印首。掌已是手。复加头首。离为二人。疑者云。彼经有宝掌菩萨印首菩萨。无宝印首菩萨。今云更加宝印首。意复云何。况余经中亦有此三菩萨。何苦破之耶</p><p>答。盖传写多误。存没难见。记主当时所览之本必有三菩萨名。终非妄斥。余经虽有此三圣号。既无重译之文。即非此例为难也</p><p>十三问。<a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>疏云。自有多苦苦一人。多人受一苦。一人受多苦。一人受少苦。疑者云。第三句可云多人受多苦。若不尔者。自与第一句同。何句法空设也</p><p>答。据其句法推其义意。第三句当如所改也。兹乃往时写者见第四句一人受少苦。欲对此句。乃妄改第三句。为之一人受多苦。而不思与上第一句义相同也</p><p>十四问。劝发品记云。十地但断十二品尽。非断伏极。知非普贤义。疑者云。十地但断十品。何云十二耶。若断十二品。还过普贤。何云非断伏极也。亦不可言是别教意。由来普贤但约圆位故</p><p>答。彼国记文写讹也。据宋地本云。十地但断四十品尽。非断伏极</p><p>十五问。妙记第一决释最初无教佛云。终有一佛。在初无教(云云)。疑者云。义犹未了。若许无教有佛。堕无因过。若言禀教。堕无穷过。愿闻一揆矣</p><p>答。最初一佛虽无禀教之因。而有内熏自悟之因。记中示之甚明。何言堕无因耶</p><p>十六问。南岳法华忏法云。过去二万亿日月灯明佛。未来具足千万光相<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛。疑者云。经中无亿字无庄严字。南岳何辄加之耶</p><p>答。经中虽无。而南岳是相似位人。以三达五眼照之。合有三字故加之。后世难辄削去也</p><p>十七问。妙玄第六示国土苦乐有二释。一云。由众生非佛所为。一云。由佛不关众生(云云)。疑者云。释尊本愿云。我未来出秽恶国土。利益十方净土摈出恶业众生。故知。所有苦事但是众生恶业所感。何言由佛不关众生。若佛所为者。莫也众生恶业空无<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>耶。岂如来背于大悲方便。令诸众生受三涂苦耶。然则不轻所行之行。文殊所化之众。皆是巧施方便。易长令短。转重令轻。固非设苦恼<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>也</p><p>答。若论作<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>因招苦乐报。乃由众生非关于佛。若约用苦乐事折摄众生。乃由佛现不关众生。良由宜用苦治方受化者。诸佛即为作之。如先王制刑。岂欲以苦加于百姓。盖至仁也。诸佛亦尔。为折摄故。而强现之。又苦乐之国众生虽居。不得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。诸佛于兹而能转变。故云由佛。又佛是生家之佛。生是佛家之生。故云众生心中诸佛念念证真。诸<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>内众生新新作业。故知。论生则一时属生。举佛则一时属佛。以是义故。故经云今此<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>皆是我有其中众生悉是吾子也</p><p>十八问。妙玄第九解本门得益云。令法身菩萨得大利益。抹十万那由他土为尘数。增道菩萨不能令尽。近代疑者云。分别功德品但举大千界中千界四天下等尘数。尚不及百千。何言十万那由他耶</p><p>答。于诸方面各那由他诸小国土方名大千。经云。大千等微尘数。岂不该于十万。如一微尘。尚有十方分。况大千耶。若言尽十方界皆抹为尘。则方与经文相违也</p><p>十九问。释签第五解不动<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>云。果报及三惑成三不动者。动则兼业。谛但有三。业及见思同入俗谛所破故也。近代疑者云。余三昧及以诸处皆以见思为<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>所破。此中何为俗谛所破耶</p><p>答。此中乃以业及见思同入<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>俗谛。正为真谛所破。成于真谛三昧矣。余文以业同尘沙破则成俗谛三昧者。各有所以。何者。如前无垢等诸文中乃以散善破于恶业。散善则成假观也。此中以定善破于散善则成空观也。故云。背舍伏见思等。记主穷幽故有斯对</p><p>二十问。<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>第一说<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>教佛神通云。一心作一。不得众多。弘决云。化主语时。化事即语。化主默时。化事即默。语默既尔。余义亦然。故非任运真化也。近代疑者云。按俱舍二十七云。声闻神通一心但作一。如来神通一心作无量。如彼颂曰。一化主语时。诸所化皆语。一化主若默。诸所化亦然。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>与化主。语必俱非佛。今止观何违彼文耶。又大论第九明毗昙佛义。与今记文亦相违。不能繁引耳</p><p>答。假令化主化事一时现。而其语默不俱。乃一心作一语。一心作一默故。故云一心作也。岂比夫安禅合掌。以千万偈赞诸法王。不动而应化。化无方者也。余者相违可以意会。必无巨妨</p><p>二十一问。止观第三说别接通人云。初修空假二观。破真俗上惑尽。方闻中道。仍须修观破无明能八相作佛。意云。即身登十地耳。近代疑者云。且别教人尚无肉身登十地者。云何从劣教来便能超登耶</p><p>答。据其二观功成二谛惑尽。仍修<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>深伏无明。必合经生历于多劫。未知何处定云即身。应现闻中之言可云即世。修观之语不必一生。况闻中之后不局今证。须归后教也</p><p>二十二问。止观第六云。若超断至第五品名家家。近代疑者云。弘决谓。大师所用并准旧婆沙。若欲知者。更检彼文。今检婆沙。断三四品三二生者名为家家。无超次。别亦无断五品名家家者。何云超断五品名家家耶。虽弘决解释。犹不出此义。止观又云。次断六品尽名斯陀含果。超断至六品尽名一往来。且斯陀含翻一往来。何以一名分超分次不同耶。止观又云。次断七品至八品名阿那含向。超断第八品名一种子。此亦依彼论说断。凡此中超义并未知所从</p><p>答。婆沙新旧未暇捡</p><p>二十三问。止观等意云。无始藏心具十界十如是法。乃至<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>亦复如是。弘决云。阐提断修善尽。但有性善在。如来断修恶尽。但有性恶在。近代疑者云。起信论对治邪执门云。闻修多罗说一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>生死染法皆依如来藏而有一切诸法不离真如。以不解故。谓如来藏自体具有一切世间生死等法。云何对治(问也)以如来藏从本已来。唯有过于恒河等诸净功德。不离不断。不异真如义故。以过恒沙等<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>染法唯是妄有。性自本无。从无始世来。未曾与如来藏相应故。若如来藏体有妄法。而使证会永息妄者。则无是处(答也)论谓性自本无。何与天台所谈性具顿相违耶</p><p>答。百界千如。性善性恶。皆是体具。微妙法门。清净功德。即起信中过恒沙等诸净功德。不离不断。皆真如故。若一切世间生死烦恼妄染之法。皆是修恶。虽全性起。而违于性。故须永灭。若称理而修。万行功德。皆是修善。亦全性起。而顺于性。即同<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。故云。像实故称理本有。虚空故迷转成性。遂使证会之时修恶虽尽性恶常存也。诸家所明<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>之义。为不知性恶法门故。其果后垂恶趣之身。皆须以神通力变现。所以今家斥同外道神变也。故云。证本真源。还任众生。转识现起。若不谈体具十界。亦是别教之义。若得此意。一家教旨如观掌中。与诸经论更无少异也</p><p>二十四问。四教义第一解有顿渐等教异云。鹿野鹤林之文。七处八会之教。岂非无顿渐之异不定秘密之殊。疑者云。此中应言岂非有。何言无字耶</p><p>答。若据此地本。而云非顿渐之异。今以义求之。知二处本皆讹。于彼本非字下。须除无字。此地本须于非字上加一岂字。则彼此文义成也</p><p>二十五问。四教义第三云。三藏菩萨行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。二阿僧祇劫是暖法位。第三僧祇是顶法位(云云)。近代疑者云。婆沙论后身菩萨坐道树下。始修四善根。一座成正觉。三藏教义多依婆沙。斯文相违何耶</p><p>答。三藏菩萨二三僧祇虽用暖顶观法。正为伏惑。行诸事行。若到树下。行为真故。复用四法为断惑加行也。如三祇久伏三界思惑。而于树下仍用三十四心。以此验之知非硕异</p><p>二十六问。一家圆<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>部所引经论。并旧师所著章疏。多与本文相违。未知何也</p><p>答。山家凡所立义。征引诸文多取其义。不专写文。乍似相违。实不相违。当以意会之则可也</p><p>二十七问。五百问论题下。云妙乐大师造。疑者云。此论似多讹谬。且举一二。如言阿难罗云。论中不举<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛数。及破他师所释种性等七地义。似<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>等十地。若是大师所制。不可不通</p><p>答。此论宋地阙本。兹不得而评论矣</p><p>草庵录纪日本国师问事</p><p>日本国师尝遣徒抗海。致问二十于法智。法智答之。皆深于理致也。后广智嗣法席。复遣其徒绍良等二人。赍金字法华经。如贽见之礼。因哀泣致敬。请学于轮下。三载其道大成。还国大洪台学。曾鲁公碑其塔。具道之</p><p>再答日本国十问</p><p>(此十问不知彼国何师所设而来相传但云。日本国问。四明法师答)</p><p>一问。定性声闻成佛不成佛疑。<a href=\"/fojing/jieshenmijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">解深密经</a>云。成就第一趣声闻。一切诸佛尽力<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。不能令其坐道场得无上菩提。我说名为寂灭声闻。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>论云。定性声闻入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>者。身智俱灭。犹如虚空。非众生数。更不发心。且经论若尔。而天台宗若何解释深密唯识之文。显定性声闻成佛之道理耶</p><p>答。深密唯识经论是显露施权之教。声闻趣寂唯尚偏真。依理发心但成灰断。未知实理究竟真常。欲趣菩提。终不可得。及至鹫峰法华会上。开权显实。正直舍方便。但说无上道。三周授记声闻作佛。不可更执昔日经论声闻不得作佛也</p><p>二问。阐提成佛不成佛疑。善戒经云。若无菩萨性者。虽复发心勤修<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。终不能得阿耨菩提。瑜伽论云。无种性诵持瑜伽。以无种性故。虽则发心及修加行。不堪<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无上菩提。如是经论足显阐提无成佛义。今天台宗于彼经论。若何融会</p><p>答。所引善戒瑜伽发心修证称阐提无性者。此是藏教。发心同前二乘。未明中实真常之性。非是阐提人也。其阐提者<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>未具。未能发心。谓<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>了二因。所以不云成佛。故涅槃云。或有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>阐提人有善根人无(谓阐提有恶境界性)或有佛性善根人有阐提人无(谓善根人有善因缘性故)或有佛性二人俱无(谓俱无缘了二性故)以上无缘了二性故。说阐提无佛性义。又经云。或有佛性二人俱有(谓有正因佛性也)约此正因。阐提极恶有成佛义。是以涅槃终极显性谈常。不简阐提极恶。咸同正性俱得成佛。况二乘耶</p><p>三问。非情草木成佛不成佛疑。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。若拘陀树有心。我当授与阿耨菩提记。以其<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>故。不与授记。法相论云。真如能为一切诸法所依。无心草木虽无所变。但有理性无行性。不可成佛(云云)。今天台宗如何解释经论。建立非情草木成佛耶</p><p>答。涅槃经法相论草木无心但有理性无行性者。此是权教故简无情。为起真修。乃须进行方得成佛。缘修乃是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。即是本无今有义也。欲显真修。须依理性。理非今古。不简色心。一成一切成。故说无情成佛也。又依缘修说。无情成佛者。相尽情忘。则无情悉成佛矣</p><p>四问。法华嘱累品安前安后疑。今罗什译于神力品后次置嘱累。而法相宗立十不可八相违。须移经末。若尔。如何通彼一十八难。当依罗什所安耶</p><p>答。嘱累一品慈恩安国并令移于劝发品后。若在于前。有八相违十不可。天台之意须依罗什次神力品。荆溪总别破之。亦八不可十相违。且出塔已后凡述多宝。皆云塔中。不云见佛。若移在后。无出塔处。一不可也。分身散后凡有所述。唯论佛塔。不涉分身。若移在后。佛无散处。二不可也。嘱累文中佛散土秽已下经文言。不涉净。若移在后。无复秽处。三不可也。会本居地。因塔升空。佛散出塔。后文在地。若移在后。无还地处四不可也。嘱累品后经既未尽。但述众喜。不云而去。若移在后。须加而去。五不可也。劝发品后无复余文。经既已终。则云而去。若移在后。须除而去。六不可也。本迹事毕。须有所付。是有嘱累。若移在后。法无所归。七不可也。嘱累已后明乘乘人事须嘱累。若移在后。师弟参杂。八不可也。其十相违一一叙破具载妙乐记中</p><p>五。今昔一乘同异疑。法华曰。十方佛土中唯有一乘法。盖昔日为三为二。今经开之唯一耳。若然。何故胜鬘经云。声闻缘觉皆入大乘。大乘者。即是佛乘。是故三乘即是一乘。此言一乘。与今法华一乘。同耶异耶。同则有妨一代化意。异则异相云何</p><p>答。经论同异固多。要须以义定之则可。且胜鬘一经部居第三方等时教。二乘在座。正当弹呵转小入大之时。台教有曰。若到方等。必到法华者。盖受弹之后次第证入也。而彼经谓二乘入一乘者。一者此经方等部中。预叙法华当来所证耳。故彼经上文云。必当得阿耨菩提。何以故。声闻缘觉皆入大乘。请观当得之言。自见指归矣。二则若就方等自论。则二乘受呵。转藏成通。通是摩诃衍门。亦得谓之二乘皆入大乘也。二释之中初义为正</p><p>六问。文殊无去有来疑。且此经序分文殊为列众之首。复为<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>引古决答。至下三周之中。并无文殊入海之文。如何达多品忽于大海娑竭罗龙王宫涌出耶</p><p>答。文殊无入海之文者。准佛成道后四十二年。便居灵鹫说法华经。首尾八载时既长远。或有入海之文。经文传译此土从略。是故不云也。此犹约事解释如此。若约理智伸之。此经如来常在海中宣扬。文殊实智周遍。岂隔鹫峰听受。理既无在。宁局方隅。感应而处处释迦。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>而身身妙德也</p><p>七问。龙女成佛权实疑。经云。八岁龙女于<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>顷发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。乃至云。即往南方无垢世界。坐宝莲华。成等正觉。且三论法相宗难曰。彼娑竭罗龙王既是深位。权现龙身。岂其龙女成佛是实证耶</p><p>答。他宗言权者。乃是高位<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>为轨下凡故示近成。若天台云实者。显佛乘权巧妙力。开性海不思议真常。一念发心便成正觉。故疏引经云。法性如大海。不说有是非。凡夫贤圣人平等无高下。唯在心垢净。取证如反掌。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗举女人五障以为疑。智积明积劫行行而作难。龙女以圆珠献佛。息众疑心。何至今日更存犹豫故</p><p>八问。龙女华座成佛别圆疑。且龙女成佛若是圆乘。当以虚空为座。何故坐宝莲华。而是别佛座耶。又三周得记皆是未来成佛。何故龙女现身成佛。而无成佛劫国名号。何耶</p><p>答。龙女是圆顿教中成道法身顿显。一成一切成。一身一切身。一土一切土。报智顿明。乃于莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>界。身土不相妨。色心为挂碍。虽坐宝莲华。体即虚空性。乃不思议<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>大用也。若然者。何别之有哉。其三周得记未来成佛者。皆是钝根声闻。未曾修菩萨行。是故再历尘劫修治。龙女乃是乘急戒缓之人。是故一超直入也。其如不言劫国名号者。当以通别二记伸之。通则不言。别则有之也</p><p>九问。身子今昔同异疑。华严会上有舍利弗。此与法华身子何异云何。且华严身子从外道家来。闻阿鞞说偈证初果。次到佛所证四果。则非法华身子。若异者。岂释迦一化有二身子耶</p><p>答。华严谈别圆。不说藏通。二乘在座如聋若痖。既不入二乘人手。不能革凡成圣。但全生如乳。遂游化鹿苑。施设渐权。于兹获益。革外道之邪计。证无漏之涅槃。次方等弹偏中。般若洮汰。来至法华。大显一实。此是法华之声闻也。是则不二而二。身子今昔不同。二而不二。只是一身。元无两人也</p><p>十问。不还果生五净居疑。小乘所说不还果遍彼上流圣位。于无云福生广果天中。生五净居天者。且不还果身不作受生业。何故下三天。能生五净居天耶。若言凡夫时作业者。入正性离生之日。但舍凡夫异熟业。何有凡夫业生五净居业耶</p><p>答。小乘入见道位断见惑。即障理惑也。初证人空。得<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>相。乃不发业。离四恶趣异熟生障也。其第二果欲界五趣杂居。九品界系润生惑。即于人天七反受生。其不来果色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>系。八九七十二品润生惑。在二界定业受生。既有惑润受生。何疑其生五净居耶。唯至四果永断界系。方不受生矣</p><p>答泰禅师佛法十问(并序)</p><p><a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>泰禅师问 四明法师答</p><p>清泰滥处禅关。叨陪海众。窃见诸方商略所疑。辄陈十种疑问。特伸请益。伏惟。金錍在手。宝鉴当怀。俯赐发挥。永为良导。不胜万幸。天圣元年三月初一日 清泰咨问延庆和尚法智大导师</p><p>一问。无明与法性。为有前后。为无前后。若云有前后者。何云。法性无初。无明亦无有始。又云。无明即是佛性耶。若言无前后者。何故佛果位中。断尽无明。方成佛果。既云断尽。应断法性耶</p><p>答。若论本具。平等一性则非真非妄。而不说有无。明法性亦不论于有始有终。但众生自无始忽然不觉。迷理而生无明。无明有熏真之用。法性有随妄之能。真妄和合名为缘起。故金錍曰。无有无波之水。未有不湿之波。在湿讵间于混澄。为波自分于清浊。虽则有清有浊。而一体无殊。所谓清浊波者真妄两用也清浊湿性者一体无殊也。无明法性体一故起无前后。故起信论云。如来藏无前际故。无明之相亦无有始是也。若<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>时达妄即真。了无明即是法性。约修门说。义当断妄。虽曰断妄。妄体本真。妄何所断。故曰。无明亦无有终。又若究其正迷之时。如梦中人。而不知是梦忽然梦觉。迷妄自息。是则风息水澄。妄消真显矣。审而思之。无俟多论也</p><p>二问。一切众生本来同一法性。法性本来清净。何因缘故忽迷。只如初迷之时。为一时迷。为前后迷。若云一时迷者。悟时亦应一时开悟证于佛果。何故现有众生未悟耶。若前后者。既同一法性。以何因缘而致前后迷耶</p><p>答。具德圆常正性真空妙有遇缘而发。法尔如斯。不劳造作。且迷妄缘起者。如人忽睡。灵焰潜生眼观刹那狂觉忽起。一切众生所迷真如能迷不觉。真妄和合二无二相。然则佛性虽一。迷悟虽同。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>四生遇缘。熏习亲疎不等。根性利钝有异。是故觉有前后。诚不可以无明法性一故根性俱同也。是知。一切众生迷无前后。觉有前后。譬如夜间多人同睡。睡时虽同。不妨前后起也。善解此譬。来问自消矣</p><p>三问。一切众生既迷本性已。何故忽然能开悟耶。若言因善知识教法缘熏得开悟者。只如最初一佛。又从何人得法信解开悟耶</p><p>答。众生得悟缘熏不同。或有无师自悟。承本自然智而证之。良由本具灵明。能自推理而得解悟。故祖师云。空寂体上无师智自然能知。既知<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>而便成佛也。一人成佛之后。展转说法化迷众生。众生禀教<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。是故次第成佛。若尔。何疑最初一佛无从开悟耶</p><p>四问。钦闻诸佛果上。凡所证法一切众生悉具有之。今且就人中以论因中。如何辨于三明八解五眼六通乃至毛吞巨海芥纳须弥等用耶。若言至佛果方得者。本有之义又何述焉</p><p>答。诸佛众生缘起虽异。觉海同源。诸佛悟理。性相无碍。众生迷妄。事理悬隔。故金錍曰。众生唯有迷中之事理。诸佛具有悟中之事理。迷悟虽殊。事理体一。一佛成道。法界无非此佛之依正。众生自于佛依正中。而生苦乐升沈。升沈既作。解脱无期。今则籍教熏修契圆实理。效菩萨之所修。修无所作。同诸佛之所证。证诸本具。是则一念顿圆于一切。一切普摄于一尘。三明八解日用不亏。五眼六通介尔具足。故荆溪曰。凡圣一如。色香泯净。阿鼻依正全处极圣之自心。毗卢身土不愈下凡之一念者是也。毛吞芥纳者。净名不思议解脱大用也。且凡夫一念造恶之心尚遍十方三世。岂不思议大用不即含纳。若不信凡心理本具足此用。则诸佛果上依正融通悉不成矣</p><p>五问。真妄二法为同为异。若言同者。妄本是真古人不应云错将世智为佛智。如认鱼目为明珠。若言异者。应是离妄有真。古人不应云弃波求水舍器求金。若真妄两立又不双存。云何剖伸耶</p><p>答。有真有妄者。对迷说觉也。绝真绝妄者。泯相离筌也。确论其旨。真则全妄之真。妄则全真之妄。二无二体也。佛大圣人说真说妄者。所以欲人慕其真而破诸妄。使妄不得而兴也。世人于兹不了。强执现前一念妄心均已是佛。正堕古人错将强认之说矣。若更弃此<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>别觅真如。复同偏教所修。犹如弃波求水舍器求金焉。兹二者过犹不及也。要须不即不离妙在其中。斯可矣。来意问。以真妄同异者。今答曰。非同异中。假立同异也。非同异者。真妄同源缚脱不二故。假立同异者。迷悟不同。情智有异也。如此甄之。自然悬合诸文。毋劳委论矣</p><p>六问。夫言无情说法者。为是名本清净法性为无情说法。为是指草木瓦砾为无情说法。若本清净法性为无情说法者。此性横遍竖穷。生佛平等。不应言说法也。纵有言说。谁为听受。若指草木瓦砾为无情说法者。教相如何分别耶</p><p>答。无情说法之言。其来尚矣。的论其要。难得其旨。汝问以清净法性草木瓦砾立二法也。当知法性之外无别瓦木。瓦木之外无别法性。二非二也。故华严曰。法性遍在一切处一切山河及国土。三世悉在无有余。亦无形相而可得。此道若论有相。充塞太虚。包含法界。若论<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。一法不留。见闻不住。卷舒自在。体露堂堂。昔南阳忠国师答学者。以墙壁瓦砾为古佛心。不异此旨。若论说法。炽然常说。古今无间。华严之中尘说刹说佛说众生说三世一切说。若论听受。十方齐说。十方齐闻。三世俱宣。三世俱听。古人道。虚空问万像。万像答虚空。谁人亲得闻。木叉了角童。又云。真说法时声不现。正堂堂处没却身。学人又问国师。无情说法谁人得闻。师曰。诸佛得闻。曰众生应无分耶。师曰。我为众生说。曰某甲聋瞽不闻。师应得闻。师曰。我亦不闻。曰师既不闻。争知无情说法。师曰。我若得闻。即齐诸佛。汝即不闻我所说法。曰众生毕竟得闻否。师曰。众生若闻。即非众生。国师之答稍有深致。识者知之</p><p>七问。世间有情变为无情。如石夫人地蟾石蟹等。无情变为有情。如麰麦腐草化为飞蝶萤火等。此等生类是何因缘而尔迁变耶</p><p>答。只一如来藏性。众生循业发现不同。是故山河大地建立胎卵湿化成形。如佛顶经曰。觉海性澄圆。圆澄觉元妙。元明照生所。所立照性亡。迷妄有虚空。依空立世界。想澄成国土。知觉乃众生。且无情化有情者。<a href=\"/remen/shenshi.html\" class=\"keylink\" target=\"_blank\">神识</a>乘时而来。依草附木也。有情化无情者。神识遇气迁变。驱[穀-禾+卵]枯朽也。当知千变不离于一念。万化难逃于藏识。世间更有火鼠汤虫冰蚕石燕。情器难量。业报奚测。佛及众生俱不思议于兹见矣</p><p>八问。世间有人。此身未死。彼处已生。如王院主等。此何因缘也。若云众生业用自在者。一切众生皆有业用。何故例无此事耶</p><p>答。天台承南岳三种妙法。一曰众生法。二曰佛法。三曰心法。此三妙故。不可以牛羊之眼观视。亦不可以凡情世智测识。有如来智眼者方堪量度。良由体性不可思议一一高广故。华严所谓如心佛亦尔。如佛众生然。心佛及众生。是三无差别。诸佛妙证无差之道。故能于一身化千百亿身。于一法演无量诸法六根三业法界大用无有穷尽。众生处迷虽不能尔。而由性德本具此体用故。只于业报之身亦能少分变现。如上古舜帝。分身而应二妃。倩女离魂而合为一质。县令昼寝识化为鱼。至有二人双存枕上。二魂悉在<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>受殃者。如斯等事不能殚举。皆是众生界中业报难思之事。是知不独王院主一人而已。何苦兴兹疑难哉</p><p>九问。有情无情既同一真性。何故斫伐树木。不为冤对。不令人堕地狱。才损有情。便为冤对。令人堕苦受报何耶。又复既是依正二报同一法性。何故有情有觉知。无情无觉知耶</p><p>答。法界体性离诸妄念。相等虚空。无所不遍。遍依遍正。遍根遍尘。至一极微无非法界全体而遍。嗟夫群生梏桎斯体妄为情器。情则四生六道水陆空行。器则山川岳渎草木<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。于情分中妄计我人知见。故有苦楚冤对之事。器分既无我人知见。故无业累仇偿之愆。如是不同皆是众生境界虚妄分别。究论法界。体性有何差别。故荆溪曰。纵然造依造正。依理终无异辙。斯言是也</p><p>十问。一切众生既同一觉性。何故捶打他人。不觉<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。却为快乐。既各不相知。云何辨平等觉性耶</p><p>答。清净本然。尚无一法可以当情。况论捶打痛苦之事。但真如不守自性。变为诸法。如一源水从流派别清浊动静海碱河淡。是故于中人我竞起。爱恶是兴。以强陵弱。攻击不休。子今设问。正是铨量迷妄中事。惟当返妄归真背尘合觉。则了十方三世一切众生同共一法身一身一<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>亦然。到此之时。一证平等觉性。尚无彼此色相迭相见。岂复论于世间捶打胜负哉</p><p>再答泰禅师三问</p><p>禅宗泰禅师问 四明法师答</p><p>清泰不揣下愚。辄具疑问十条。上请教诲。兹承赐答。三复感悰。如获珙宝矣。然则日月固明。盲者自咎。其间尚余三处未晓。不免再露鄙拙。果蒙洊与指示。下情感幸之至(清泰)上白。延庆教主法智大法师</p><p>一问奉。第一答中云。忽然不觉。迷理而生无明。只如不觉。依何而生。以何为体。何因缘故忽然生耶</p><p>答。甚深藏性之源非真非妄。此性随缘而真而妄。故佛性论云。单真不生独妄难成。真妄和合。方有所为。是故教门所示真有随缘不变之义。妄有体空成事之能。良以灵源无住。随妄而生。强觉既迷。忽然而起。然此起妄之言复应了知其意。若言众生本觉圆明之性。此即直指众生无始无明而为法性。以无明法性体一故。若言忽然不觉而生无明。此即约修以说。对性论起。从本觉体而有不觉也。不如是。则不能显进修之人。是复本还源之道矣。以此意故。凡诸经论多云从真以起妄也。其实一切众生自无始来。唯有迷妄不觉而已。故起信论曰。一切众生不名为觉。以从本以来未曾离念故。说无始无明是也。子问不觉依何而生。若晓上意。则不必如此问也。如首楞严中满愿子尝疑此事。佛反责曰。既称为妄。云何有因。又<a href=\"/fojing/yuanjuejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">圆觉经</a>金刚藏亦启此难。佛斥非为正问。谛观两处。佛意诚不欲兴此疑难。盖众生之妄自无始即有之也</p><p>二问奉。第二答中云。一切众生迷无前后。觉有前后。譬如夜间多人同睡。睡时虽同。不妨前后起也。若如此渐渐觉悟成佛。应是众生界有毕尽之期。若然者。经论之中何以并言众生无边耶</p><p>答。一切众生无始覆真和合而起诸相。虽真源不二。而所照有殊。如古德道。含生随业现。三界不同躯。如沤依水起。水不碍沉浮。迷源虽不二。熏发有贤愚。来问以众生成佛众生界尽者。如彼水生浮沤。沤虽前后灭。即不可言水随灭也。故佛藏经云。一日之中有百千万亿恒河沙众生。一时成佛。众生界不减。佛界亦不增。何以故。如来藏无尽故。又长沙大师赞南泉云。堂堂南泉三世之源。金刚常住十方无尽。其旨亦同。当善思惟。切勿于众生难思境界中而起断灭见也</p><p>三问奉。第六答无情说法中云。十方齐说。十方齐闻。三世俱宣。三世俱听。既齐说。又如何俱闻。既齐宣。又如何俱听。况复诸圣又如何用闻耶</p><p>答。子疑齐说齐闻俱宣俱听者。当知刹刹尘尘俱说俱听。说听同时。了无异趣。妙哉此境。不可以言想求。不可以凡情测。是大总相法门寂而常照。法身冥资之境也。故荆溪曰。愿解脱之日。依报正报常宣妙经。一刹一尘无非利物。又问诸圣如何用闻者。既云法身冥资一切俱说。岂不能一切俱听。如是则言不干舌。千圣俱闻。照故恒说。遮故俱听。众生才闻即同诸佛。前佛后佛其一揆焉。若更别立程途。则非西圣一路涅槃门矣</p><p>天童凝禅师上四明法师第一书</p><p>正月十八日。天童山景德禅寺住持传法苾刍(子凝)。谨熏沐裁书于延庆堂上教主法智大师(侍者。子凝)尝闻。智者千虑或有一失。愚者千虑或有一得。斯往哲之格言。非潜夫之臆说也。(子凝)素昧达人之旨。辄陈愚者之言。愿渎听聪。少陈狂狷。近因暇日。恭览十不二门指要钞。义峰孤耸。非郄克之足能跻。教海汪洋。岂师旷之耳能尽者也。珍重珍重。中所援引。达磨门下三人得法而有浅深。尼总持云。断烦恼证菩提。师云。得吾皮。道育云。迷即烦恼。悟即菩提。师云得吾肉。慧可云。本无烦恼。元是菩提。师云。得吾髓。但为传闻故无实证。未知斯语得自何人。大凡开物指迷。必须据文显解。岂可以道听途说将为正解。礼云。记忆之言不足以为人师。此亦虑无稽之言以为正说者也。宁可指鹿为马。事类赵高。使民战栗。宛同宰我。今据祖堂及传灯录。只云。二祖礼三拜依本位而立。未委彼宗。复何为解。今或有师云。达磨之道但接下根。未通上智。又云。悟即心之理。昧心外之法。斯皆以管窥天。将螺酌海者也。今试辨之。原夫病在膏盲者。失之于针砭。滞名相者。封之于言句。岂教不能明心。而药弗能瘳疾耶。良由积疗增痾伙言惑性。是以祖师西来。直指人心见性成佛。亦方便之一揆耳。或者犹云。但指即心未入佛慧。如般若说九类皆住无为涅槃。华严云一念普观<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>。未知此说与祖师之道同耶异耶。噫小智自私贱彼贵我。达人大观无可不可。古贤之言信而有征矣。然则田巴毁三皇罪五帝。随而和之者千人。盖海上有逐臭之夫。讵田巴之道能胜于三皇五帝之道者也。教主大师久积净行。恢张教网。前无古人。后不可继。自当依经解义续智者之真风。何必采鄙俚之言。玷启迪之旨乎。愿削传闻。自扶本教。无使滞名相者而取效焉。幸甚不宣。天童山景德禅寺住持传法苾刍(子凝)顿首上白</p><p>四明法师复天童凝禅师第一书</p><p>正月二十四日。延庆院住持传天台教观<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>(知礼)。谨修书复于天童景德堂头禅师(侍者)。今月十八日。僧使赍到长书一缄。文理相高。经实俱赡。舒卷忘倦。珍荷弥多。但以夙事忏摩。全疎文学。将谋投报。预抱忸怩。然阅华词。备谙雅旨。盖以(知礼)早岁为解本宗十不二门。辄述指要钞。编文纪事。聊资学众之寻研。义浅词荒。敢冀宗师之观览。其中所引。达磨门下三人得法浅深不同。尼总持云。断烦恼证菩提。师云得吾皮。道育云。迷即烦恼悟即菩提。师云得吾肉。慧可云。本无烦恼元是菩提。师云得吾髓。来书云。此语不契祖堂及传灯录。谓是道听途说采乎鄙俚之谈。而不知此出圭峰后集。裴相国(休)问禅法宗徒源流浅深。密禅师因为答释。广叙诸宗。直出傍传源同派别。首云。达磨直出慧可。傍传道育及尼总持。乃示三人见解亲疎。故有斯语。此之后集印本见存。南北相传流行不绝。曾逢点授因是得闻。而况有唐圭峰禅师帝王问道。相国亲承。和会诸宗。集成禅藏。制禅源诠都序两卷。及兹后集为世所贵。何为鄙俚之谈。岂是道听途说。此乃禅门自生矛盾。固非讲士敢此讥呵。只如祖堂亦是人师集录。谁是谁非。言何容易。夫法本无说。说必被机。机发在缘。缘有宾主。故诸圣人抑彼扬此。是一非诸。补处逸多尚受折于维摩诘。上首尸利甘负屈于庵提遮。岂补处纳言。上首暗理。盖知缘不在己。是以功让于他。以至正像法中。华竺宗主空有更破。性相互非。业禅者屡斥寻文。传教者或讥暗证。皆为进于初学欲使深于本宗。智论立悉檀被机。禅经用四随益物。设化之法大体合然。但以假名引令入实。不得其意。宁免生疑。来书又云。今或有师云。达磨之道但接下根未通上智。又云。悟即心之理。昧心外之法。未审此语何文所载。何处亲闻。无求闾巷之音而构诬罔之说。道听途说。事有所归矣。且夫信行法行各有利根钝根。唯色<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>岂分内法外法。刹那九世一念三千理事俱融。频彰指要。既蒙顾视。合察源流。愿存为法之心。广阐利人之道。俾信法根性从说默开明。无使达磨子孙独能破立。智者宗裔全废抑扬。则彼众当机有趣真之路。令此宗来学绝入理之门。禅师悟彻一心。辩超千古。为<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>之了使。作人天之导师。希开博济之怀。勿任偏情之执。讲忏之隙仓卒奉酬。幸无以朴野而见诮焉。不宣。延庆院住持传天台教观比丘(知礼)拜手上复</p><p>天童又上四明第二书</p><p>正月二十八日。天童山景德禅寺住持传法比丘(子凝)再修书奉白于延庆教主法智大师(堂下子凝)闻。夫意浅则言疎。思深则言讱。前所献言者。且欲大师削去传闻自扶本教。再垂来示。征引源流。徒知出于圭峰。问因相国三宗辨异。未尽所长。殊不知。知解宗徒祖师昔记。循其泛说。讵惬通怀。彼禅源诠云。达磨九年面壁。盖为绝缘。由是祖师独断乃云。知之一字是众妙之门。今达磨所传唯灵知而已。至于深推荷泽轻视牛头。矛盾之言洋洋于外。既曰曾逢点授。合具雌黄。何异采鄙俚之言资唇吻之解。且夫达磨之得二祖。亦犹思大之有智者。垂范作则。千古皎如。傥智者之言教成非。而达磨之子孙亦谬。岂容缄默。须议师承。非之则谤因谤缘空招捺落。是之则正人正己信奉讴和。岂谓相国亲承帝王问道。北宗神秀四帝国师。借势恃权。其风自弭。来书又云。补处逸多尚受折于维摩诘。上首尸利甘负屈于庵提遮。盖知缘不在己。是以功让于他。若如是。则虽晓抑扬。罔穷实际。苟云功让。未喻下怀。又云。业禅者屡斥寻文。传教者或讥暗证。俾信法根性从说默开明。无使达磨子孙独能破立。智者宗裔全废抑扬。此者深思。谁之咎欤。刚云破立。以过疣人。岂不云一念三千刹那九世。禅教之旨何理不臧。思益经云。说法有二种。若圣说法若圣默然。何必有说滞言。无说乖旨。实惟不二。非任偏情。昔人截耳捐身。引肠断臂。斯有由矣。不然贾有余勇。恃死不回。山人每一经心。如负荆刺。愿吾大师力扶像运。深察源流。无使正法浇漓人情美顺。唯宗高范。是振淳风。知事忏摩必无虚日。再形鄙抱。专候斥呵。不宣。天童山景德禅寺住持传法比丘(子凝)顿首再白上</p><p>四明又复天童第二书</p><p>二月初七日。延庆院住持传天台教观比丘(知礼)再裁书于天童堂上大禅师(丈室)比者累接真缄。颇彰深意。前书谓。指要所引三人得法全不据文。乃是道听途说。采乎鄙俚之谈。盖由不晓斯文出自圭峰后集。只齐曾见非彼所闻。故以长书责无实证。今知所出。合耻鲜闻。如何却斥圭峰弃乎援据。噫过而不改斯成过也。且如指要所引。非无所以。盖智者立法华绝待十妙止观圆顿十乘。以烦恼即菩提生死即涅槃二句之文而为刚格。诚非二法相合名即。故不可以断证明之。亦非一法翻转名即。故不可以迷悟示之。烦恼非定本无。菩提非定本有。故用烦恼即菩提等。绝其言诠。寂其思虑。俾妙解圆明妙行密契妙理顿显故也。柰以天台宗教陵迟之际。圭峰后集流衍来吴。禅讲之徒多所宗尚。咸云。达磨印于二祖。本无烦恼元是菩提。方为得髓。智者所说既同道育之解。乃成得肉之言。鄙僧忝嗣台宗。得无伤痛。况闻点授。粗见否臧。遂于指要文中对扬厥旨。何任唇吻之便。而浪有所讥。且夫分宗受法。传教接人。人据圭峰难于本教。岂不依教而返破之。斯皆扶树本宗。勉励初学。证悟之际。彼此岂存。前所谓设化之法大体合然。悉檀被机。四随益物。不得其意。信有狐疑。洎观捐身断臂之心。如负芒剌之语。后五百岁能几人乎省己扶宗。既能如此。于他<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。岂得周遮。幸冀禅师博览本宗。善扬祖道。无得阻他。释难便成。立我化功。蒙索报音。讵可缄默。不宣。延庆院住持传天台教观比丘(知礼)稽首再白</p><p>天童又上四明第三书</p><p>二月十四日。天童山景德禅寺住持传法比丘(子凝)谨重致书于延庆堂上教主法智大师(座下子凝)窃闻。屠保之内必有异人。讲忏之中岂无通识。何劳往复再叙端倪。而大师指要雕文刻义。只曰相传。达磨门下三人得法而有浅深(愚)既议之。岂可便责圭峰以求情实。所谓道听途说。可曰相传。果有后书。指为曲据。妄生穿凿。合晓否臧。或达磨授二祖。有本无之说。道育尼总持有断烦恼之称。则圭峰言之。而大师议之。斯亦可矣。既元无此说。拟剥何人。岂可逐浪随流扬声遏响。前云。设化之道大体合然。斯未可也。大凡援引古今。存乎婉当。彼宗固执可示斥呵。方谓抑扬昭乎义理。苟弘教者引<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>不当。亦须削之。如是则称作人师堪为教主。后生宗范千古不逾。所谓学而不思。传而不习。斯之为耻。何耻鲜闻。来书又云。天台宗教陵迟之际。圭峰集流衍来吴。人据圭峰难于台教。岂不依教而返破之斯皆扶树本宗勉励初学耳。尝试论之。原夫圣人立教示迷。情同蒭狗。智类冰壶。神遇之怀道无不在。岂同鄙俚有滥道途。常患<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>从师未能忘筌离相。余与大师言议者。盖存大师永永之道也。假使信任圭峰为是。须知回顾。祖堂无言。未坠本宗。尚犹焚躯炼指。岂同外道。非理赴火。投崖革故。是宜鼎新无爽。所依止观十乘法华十妙菩提烦恼信本无差。纲格之言。岂容繁剖。所谓过而不改。斯有归矣。不宣。天童山景德禅寺住持传法比丘(子凝)稽首上白</p><p>忠法师天童四明往复书后叙</p><p>吾祖法智尊者。始因钱唐奉先清师制珠指解十不二门。总在一念之文为真心。别分色心之言为俗谛。改色心门。造谓体用为造。谓体同改内外门。三千即空即假即中为即空即中。凡改二十来字。天台昱师注不二门。立唯观不思议境。消一念三千唯色唯心。为真谛。法智悯而救之。所以指要之所由作。故序云。或示或注著述云云。是此也。清师又立生佛三千为事造。心法三千为理造。而不知三法各具事理。如指要破曰。据他所释。心法是理。唯论能具能造。生佛是事。唯有所具所造。则心造之义尚亏。无差之文永失。又序曰。事理未明。解行无托。此皆破于清公也。然指要之中正明观心达妄之道。辟他山外观真之非。文引烦恼即菩提生死即涅槃二句。为发心立行之本。因此拣示达磨门下三人得道浅深。可大师云。本无烦恼元是菩提。达磨曰。得吾髓。法智评之曰。可师之见意纵阶。此语且未圆。凝禅师谓指要所引差错。从而辨之。乃准祖堂及传灯录。当时可师但礼三拜。依位而立。而不曾有本无烦恼等言。凝公如此扶救。毁斥法智云。是道听途说。非为正论。殊不知。法智准圭峰后集而示。到此凝公自当结舌服膺。柰何后书倔强不已。今更就彼书辨之。若将可大师无言依位而立。便是显圆顿者。且身子云。吾闻解脱之中无有言说。大品云。若有一法过涅槃。我亦说如幻。又有无言童子净名杜口等。今问。此诸无言而与可师无言。为同为异。请端的示之。切莫通谩。又如阿含外道问佛。不问有言无言。如来踞座。外道赞云。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>大慈开我迷云。即礼三拜而退。阿难问佛。外道得何法而退。佛言。如快马见鞭影即着正路也。祖堂引为圆顿第一则语。天台判此为小乘三藏。若望圆顿犹霄坏焉。故知不可才见无言便谓真证也。当时四明太守直阁林公见二师诤议不已。因请法智于指要下和融之语。法智不得而辞遂改之(指要旧文曰。此乃又超得髓之说也。可师之见意纵阶。此语且未圆。问今明圆教。岂不论断惑证理及翻迷就悟耶。若论者。何异持育之解。答秖如可师。岂不断惑翻迷。岂亦同前二耶。故知。凡分渐顿。盖论能断能翻之所以尔○指要新改曰。然汝所引达磨印于可师。本无烦恼。元是菩提等。斯乃圭峰异说。致令后人以此为极。便弃三道唯观真心。若据祖堂。自云。二祖礼三拜。依位而立。岂言烦恼菩提一无一有耶。故不可以圭峰异说而格今家妙谈尔)况达磨西来。以楞伽四卷授可大师。且曰。籍教悟宗。仁者依此修行。自得度世。荆溪尝判楞伽。阶天台别教。以经云一切众生自心现流之义。大慧菩萨问。是顿是渐。佛答是渐。既言是渐。安得指为顿耶。准此则法智所评信不诬矣。今谨录当时议书五番。非但令后昆睹指要新旧二文来力。抑亦不昧先时辨论之因起也</p><p>熙宁三年中春。永嘉法明院传教法孙(继忠)识</p><p>草庵录纪天童四明往复书</p><p>法智学行高妙。凡所著作。莫不立宗旨辟僻邪开奖人心到真实地。指要钞中。引圭峰后集。比决幽奥。而天童凝禅师者一见喜之。但谓。其所引少有参错。欲法智改正之而已。书简往返凡二十许。其末至有云千士诺诺不如一士谔谔。使大法流衍百世无瑕玭者也。余昔亲见此帖。字划如钟繇。语如韩退之。真可爱也。或谓。法智以此聊为改正。又闻。指要既出。雪窦显禅师特出山。羞斋为庆。仍有茶牓。具美其事。余未尝见之。尝睹广智初主南湖法席时。显公虽已老。亦牓煎茶。但记其高头大麻笺。其字小古。以此知。法智之时不虚也。在昔禅教一体气味相尚。至有如此者</p><p>(宗晓缵录天童四明之书。秖得五番。准草庵。既曰凡二十许。果堙没不少。其显禅师茶牓之类。并已无闻。凡阅此书者或有。此幸见赠。以全之)</p></div>"
},{
    "title": "四明尊者教行录 第五卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第五卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>真宗皇帝谕旨留四明住世</p><p>杨文公贺法智受命服启</p><p>法智大师谢杨文公启</p><p>杨文公请法智住世书</p><p>法智复杨文公书</p><p>杨文公谢法智答义书启</p><p>杨文公三问并法智答</p><p>杨文公谢法智答问启</p><p>法智再书上杨文公</p><p>杨文公再书请法智住世</p><p>杨文公书上太守李夷庚同请住世</p><p>杨文公上<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>忏主启</p><p>又致请法智住世内简</p><p>杨文公又书留法智住世</p><p>法智再复文公启</p><p>法智谢李驸马请住世书</p><p>法智贺杨文公加翰林书</p><p>杨文公谢法智贺书</p><p>李驸马荐法智师号贺启</p><p>法智谢李驸马启</p><p>慧照法师跋前往复书</p><p>草庵法师纪往复书中事</p><p>昭讲主上四明法师书</p><p>谢圣果法师书(圣果即天竺忏主先所召院名也)</p><p>四明与矩法师十书叙</p><p>付矩法师书(凡十书)</p><p>付彬阇梨遗书</p><p>上大雷庵长书(凡二书)</p><p>天竺忏主上四明法师书(凡二书并草庵跋)</p><p>付神照法师书(并月堂跋)</p><p>付妙果法师书(并月堂跋)</p><p>付永安山主书(凡三书并四家跋文)</p><p>四明付门人琮法师帖</p><p>真宗皇帝谕旨留四明住世</p><p>四明教主礼公。释门之高者也。聚徒实繁。而专以<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之法。普劝修治。天禧初结十僧。行忏法。三年期满焚身。内翰杨大年。慕其为人。以书请留住世曰。(亿)钦闻修千日之忏。焚四大之躯。结净行之十僧。生乐邦之九品。窃尝具请。冀徇群情。乞住世以为期。希传持而兴利。愿垂许可。庶获瞻风。礼终不允。大年又贻书天竺式师。托躬诣以留之。书曰。昨为明州礼座主。宏发愿心。精修忏法。期以三年。并趋火化。况此僧传持大教为世导师。得其久住。利益甚多。诚怀景重。窃欲劝留。罄叙克诚。遂形恳请。得其报音。确乎不拔。窃知忏主。与之同禀。并化东南。可涉淅江之巨浸。造鄞水之净居。善说谏言。宜久住世。是年诞节。(亿)干丞相寇公。荐以紫服而宠之。至天禧末。有枢密使马(知节)。请大年撰父神道碑。酬以润笔。一切不受。止求奏荐。四明师一师号。知节因奏</p><p>真宗曰。臣请杨亿。为先父撰神道碑。不受润笔。况词臣受所赠世之常规。乞降旨以受。上召大年问之。(亿)即奏以四明遗身事。上闻深嘉叹之。重谕大年曰。但传朕意。请留住世。若师号朕当赐之。润笔卿宜无让。于是特赐法智大师。师由此住世。数年方入灭。余一日至南城。瞻礼师塔。畴昔所闻见。恐世绝闻。因假笔以识之。景祐丙子仲冬钱(希白)谨题</p><p>杨文公贺法智受命服启</p><p>起复翰林学士光禄大夫行<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>工部</p><p>侍郎知制诰礼仪院判秘阁二柱国杨</p><p>亿上</p><p>亿启。夙陪清侣。因熟高名。闻传教于赤城。久领徒于鄞水。达契经之旨。叶彼重宣。精修忏之规。臻乎本净。机缘胥应。真俗焉依。顷更值于严凝。常奉陪于枢弼。辄求论荐。式冀褒扬。俄遇疾以归田。殆解麾而趋阙。涉乎累岁。绝望报音。暖席未遑。飞邮遽至。前言克践。私愿允谐。事虽自于乞邻。道弥光于出世。所有大师赐衣。敕命已于本州递角内附去。必垂领受。谨奉状。咨问兼伸陈贺。伏惟照察谨状</p><p>法智大师谢杨文公启</p><p>(知礼)伏念。身老林泉。任拘香火。仰明月而遐照我牖。望白云而高迁帝乡。徒效葵倾。因惭匏系。伏惟秘监果行。育德自诚而明。为诸夏之梓材。作九州之木铎。润色鸿业。挥彩笔于玉堂。康济明时。成皇觉于仙室。斯焉驾道。式副具瞻。素仰膺门。长悬丘捣。而知礼也。灰心寄世。砥行先经。切柏代香。忝嗣天台之乃祖。刻莲为漏。滥承庐阜之遗风。岂期误泛虚名。遐臻秘府。致诸命服。赠以善言。捧接宸章。感动肌骨。虽怀在笥。犹恐灾身。追思梁氏之知然。方兹何逮。退省裴公之优密类此犹轻。继都讲于山阴。作主人于莲社。顾微躯受赐。无足称焉。谅大教益光。有自来矣。造兰台而投刺。莫遂衷肠。栖石室以观心。永期外护。谨奉状申谢伏惟台悉</p><p>杨文公请法智住世书</p><p>亿启。近者窃审。大师期结社于十僧。约入忏之三载。然赴火光之正受。决取净土于<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。身见顿空。愿力弥壮。登莲华之绝品。闻法树之至音。兹事匪虚。先佛所证。然于俗念。切贮愿心。诚以大师。洞<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>之指归。为<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>之钦仰。续台岩之慧命。启越绝之度门。十善诱人。竞敦于白业。一音扶教。广演于金言。慈荫普均。道风允穆。惟极乐之界。盖觉皇之示权。而大患之躯。非智人之所乐。傥存忻厌。即起爱憎。既萌取舍之心。乃至能所之见。谅惟通悟。夙究真常。盖俯就于初机冀策发于净行。伏望因承恩诏弥广<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。增延住寿之期。恢阐<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>之盛。仍冀忏期之告毕。略迃法步。以相从。庶效纯陀。恭羞末后之供。愿同庆喜。顿释离尘之心。幸轸瞀蒙。未趋寂灭。切希垂听。颙俟报音。谨奉咨问</p><p>法智复杨文公书</p><p>(知礼)谨于讲忏之隙。依本<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>观。写书奉答秘监大檀越。(知礼)伏奉载垂真翰曲赐重言。俾(知礼)毕此忏期。更留讲训。仰承尊旨。合改先心。但以专诚久趣此门。鄙志莫能易辙。况良时难遇。胜事易差。故欲且副夙心。不果恭遵严命。所言(知礼)洞三观之指归者。称之太过也。又云极乐本由示权。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>须忘忻厌者。诚哉是言也。而(知礼)今忻净土。特厌患身。亦有其由。辄伸于后。若其一心三观。虽非洞达。敢不依凭(知礼)四十余年。寻其筌罤。学其去就。神根既钝。证入无由而于户牖关防。行用时节。多所游历。亦略谙知。今者蒙索报音。故难杜口。粗陈梗概。希赐否臧。三观者。一念即空即假即中也。恢扬肇自于如来。妙悟近推于智者。全由性发。实匪修成。故于一心。宛有三用。所谓空者。一切皆空。即三观悉彰破相之用也。假者一切皆假即。三观悉明立法之功也中者一切皆中。即三观悉是绝待之体也。是则终日破相。而诸法皆成。终日立法。而纤尘必尽终日绝待。而二谛炽然。故<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>谈空。八十法门得显。维摩立法。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>见爱皆忘。法华一乘。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。皆由三观相即。致令诸法无遗。故三即非三。一即非一。非次第而入。非并别而观。不可以有无求。不可以中边取。故云不并不别非纵非横。盖三一<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>。修性冥泯。岂<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>之所测。何言说之能诠。故强示云。不可思议之妙观也。说即非说。无说而说。能知此已。对一切境。以此观照了之。立一切行。以此观导达之。办一切事。以此观成就之。设一切教。以此观敷畅之。修此观者。能所必忘。取舍斯泯。故真如无念。向则心绝。终日说示。不异无言。舍此则必同众魔。离此则未超诸外。故龙树云。除诸法实相。余皆魔事。<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>云。未闻大<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。前皆是邪见。大矣哉。一心三观之妙宗也。故(知礼)所求。安养而生。所欲燃烬而死。凭此三观。遣彼百非也。言极乐之界盖觉皇示权者。经论既以净土之教。为胜方便。验知。是如来善巧权用也。但权名不局。实理亦通。是要甄分方知去取。体外之权须破。体内方便须修。离事之理则粗。即权之实方妙。故小乘无他佛之说。大教有刹海之谈。盖心性遍周法界无外。理极故令事广。华大故省池深。刹如帝珠。出现重重无尽。方显寂光之理。身类天馔。感报彼彼不同。乃表遮那之性。岂应极乐不预<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。故如来藏中。涅槃具足。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>发现。应量而知。既能彰<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>天宫。岂不造秽邦净国。本性虽具。由心发明。弥陀以<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>之慈。取极乐之土。释迦以乐说之辩。示往生之门。斯皆善巧之权方。摄彼沉沦之品汇。令惧退转者不退。使不善观者能观净土。权相盖多。今且略论此二。故起信论云。初学大乘正信。以在此土。不常值佛。惧谓<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>意欲退者。当知。如来有胜方便。摄护信心。但当专念<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>阿弥陀佛真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身。毕竟得生住正定。故专念真如法身者。岂异大乘正信。以依彼佛为境。故能牵生净方。斯是如来权巧也。又观无量寿<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>云。凡夫心想羸劣。未得天眼。不能远观。诸佛如来。有异方便。令其得见。此盖释迦神力。弥陀愿心。若有谛观。必能睹见。斯亦觉皇。异妙方便也。此之权巧方便。既约圆论。即与法华微妙方便。无二无别故。诸天及人。声闻缘觉。事度菩萨。渐修大士。充满世间。数等河沙。尽思度量。不能知觉。唯佛与佛。乃能究尽。圆信圆解。方能造修。(知礼)虽是钝根。滥沾圆教。不离当念。愿达彼方。庶即下凡。便阶不退。复闻。大通佛世。结缘之徒。已经尘点劫来。尚住声闻之地。皆由退大。故涉长时。身子六心。退落五道。况悠悠<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>者乎。盖由此土多值退缘。故云。鱼子.庵罗.华.菩萨初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。三事因中。多及其结果少。若求生安养。即于博地。能藉胜缘。才获往生。永无退转。闻兹利益。得不忻求。乃用一心三观。为舟航。复以六时五悔。为橹棹。求往唯心之净土。愿见本性之弥陀。然后运同体之大悲。度法界之含识。顺佛权巧。求生乐邦。其意略尔。所言傥存忻厌。即起爱憎。既萠取舍之心。乃生能所之见者。起过之相。诚如所言。立德之缘。今当略说。盖以忻厌取舍善。能起过成功。故马鸣立。为始觉之基。智者称为净土之渐。维摩以见爱为侍者。文殊以贪恚为功能。斯皆用之在人。乘之有法。且<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>旷劫。住此娑婆。贪于粗弊色声。着于下劣依正。既无厌离之念。但增系缚之缘。纵有熏修。鲜有克遂。以此土法多障。致道行难成。故<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。得人身者。如爪上土。失人身者。如大地土。是故诸佛。慜此众生。以愿行功。取清净土。令起忻慕。作受生因。以苦切言。说垢秽相。令其厌恶。成出离心。若非此心。不成始行。故非厌离。舍此无由。不起忻求。生彼无分。盖受生之法。以爱为缘。始自初心。终至等觉。变易未尽。忻厌叵忘。况始行耶。今求净土。不求身受诸乐心染妙尘。盖欲托彼净缘速增胜道。以彼<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>无尽依报自然。无有女人及以根阙。虽圣凡共处。而无恶道之名。虽声闻无边。且离执真之见。弥陀为良导。观音为胜友。一生补处甚多。十地<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>无数。风吟宝叶。波动金渠。皆出妙音。尽诠至理。既无违顺。永息贪嗔。凡有见闻。悉资寂照。皆住正定。功在于斯。今之众园。尚须求预。彼之宝刹。宁不愿生。但知净土唯心秽邦即性。即厌无厌即忻无忻。是则正助合修。解行兼运顺佛正教。非己曲情。况观经说上品生。因须大乘妙解。加修<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。兼劝众生。故(知礼)今以三观攻心。五悔助道。又恐净因未备。故以毕命。自要庶。凭最后之强缘。以作往生之定业。而又若不烧身臂指。非<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>菩萨。梵网之诫明。然舍身命财。是真法<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>法华之文焕矣。楞严然香一炷。宿债俱酬。轮王剜身千灯。妙果斯克。故知。初心后位。上圣下凡。皆可进修并彰至教。但行正解。自免邪修。以知性火真空。岂有能烧之相。所烧自亡也。又知佛体圆妙。岂存所供之人。则能供亦寂矣。两重能所既泯。一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>斯成。是名苦行法门。所谓火光正受。四土净境顿现。此心诸佛道场。咸彰此处。但随所愿。必遂往生。故智者云。<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>在定之心。即是净土。动念即是往生净土时。如此舍秽身。则尽垢秽之际。何理不彰。如此取净土。则极清净之源。何惑不遣。是以韦提忻清净业报之处。即证无生。萨埵舍痈疽瘭疾之身。云求常乐。此之取舍。与不取舍。体无二种。用亦同时。得名三种法门。谓取法门。舍法门。不取不舍法门。亦是三毒法门。具一切法。故无行经云。贪欲即是道。恚痴亦复然。如是三法中。具一切功德。文殊云。我是贪欲尸利。我是嗔恚尸利。我是愚痴尸利。深得此意。即一心三观。导一切行。办一切事也。以一切法空故。舍秽必尽。一切法假故。取净无遗。一切法中故。无取无舍。此之三法。一切如来同证。一切菩萨共修。故(知礼)今舍秽身。欣求净土。辄敢仰效也。然则修心万行。入道多门。随乐随宜。随修随悟。敢将测管。局彼太虚。但以(知礼)爰自少年。便敦此志。今已衰朽。多历事缘。此心常自现前。对境弥加增进。信由宿愿敢不恭酬。年来建立道场。众信共营供具。三载资缘粗备。数僧<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>。偶同此者。遭逢秘监。知乎姓名。察其始末。敢请俯为檀越。运以力轮。使片善之有成。俾净愿之克遂。然后芘我宗教。广见流行。令未闻者闻。使未悟者悟。更冀佐治功成之后。期颐报满之时。随愿求生极乐世界。冀得同会一处。同叙宿因。同化含生。同登大觉(知礼)素无文学。元是野僧。发语粗浮。显理疎脱。盖奉读前书云。精修忏之规。臻乎本净。次书云。净土匪虚。先佛所证。仰惟。秘监深洞苦行。可以穷源。复知净邦由来即理。盖欲(知礼)广援乘教。傍示未闻。是敢辄附本宗。少述愚见。有黩台听。不任悚惶。不宣</p><p>杨文公谢法智答义书启</p><p>(亿)启。近于公邮。获披芳翰。承法裕以增胜。享净乐以无涯。景仰尤深。感叙奚罄。属拘公局。夐阻句筵驰系于兹。敷宣宁既谨修状谢</p><p>杨文公三问并法智答</p><p>(亿)启。远寄示长书为答。重复窥玩。但钦渊奥。俗学肤浅。何以奉酬。辄缘来意。虔致三问。具于别纸。请赐见答。傥契卑心。别具咨报。然希取证于泥曰。亦冀专修于末供也。(亿)白</p><p>承师有言。西方净土。风吟宝叶。波动金渠。此是何人境界</p><p>答曰。即此见闻。更无道理。既彰教义。宁免指陈。夫净土依正。俱宣妙法。闻者合了。根尘绝迹。物我一如。岂执有人对他境界。此间圆顿<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。以根对尘。起识之时即了。以法界对法界。起法界。实非心外之境境外之心。则心自知心。境自见境。境岂见境。心岂知心。知见既忘。言诠亦绝。故强名云不思议境观也。凡位修之尚尔。圣位证之奚言。又若强论所离之境差别相者。粗中之粗。凡夫境界。细中之细。是佛境界。斯盖教道分别也。若今圆论。不离而离。初心能离佛之所离。以一心三观即佛智。故前书云。对一切境。以此观照了之。斯之谓矣</p><p>承师有言。烧身臂指。乃是出家菩萨。舍身命财。方名真法供养。此语出梵网法华二经。然并是魔王所说。且非正教</p><p>答曰。佛之与魔相去几何。邪之与正有何欠剩。良由本理具魔<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。不二而一。二而不二。随缘发现。<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>成魔。性既本融修。岂能异。故圆实教。称性而谈。魔界如。佛界如。一如。无二如。故得云魔外无佛佛外无魔。亦是一魔。一切魔。一佛。一切佛。俱称法界。皆一体遍周。故悉得称王。皆诸法朝会故。若于魔佛。起胜劣心。自是邪思。殊非正观。然魔法本妙。如富豪家满中七宝。而凡夫生盲。转动挂碍。为宝所伤。二乘热病。见是鬼虎龙蛇。怖故逃避。渐修菩萨。犹如夜视。见不了了。唯圆顿行者。从初决定。见是七宝。而<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>用。唯佛无碍故。魔是法界魔。是法王博地。唯理性。是初学但名字。是五品位观行。是十信位相似。是法身菩萨分证。是唯妙觉如来究竟。是以此位方穷魔<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>理边底。具足能于魔界。统摄自在。即魔王义成就也。应知。波旬称魔王者。有名无实。以乖统摄自在之能。故涅槃云。世谛但有名无实义。第一义谛。有名有实义。若然者。梵网法华真实魔王所说。更何所疑。以魔王与觉者一体异名。如帝释一身既具千德。遂有千名。岂因陀罗说异憍尸迦说耶。今云魔王说者。非独不异佛说。而能深显圆宗。何者。以圆不自圆。乃偏邪诸法。一一皆圆也。法华决了声闻之法。是诸经之王。岂不决了魔外为王耶。但魔外易开。诸大乘已说声闻难开。故法华随难别指耳。如华严胜热<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>投火化人。则全用外道之行。和须蜜多女。染欲摄生。则全用魔罗之法。若非深住魔外法界。安能令无量人得证<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。乃是行于非道。通达佛道也。况今烧身臂指。正助合行。舍身命财。财法兼济。则一切法趣苦行。为法界故。教主既与魔佛。体一法门。则邪正本融。乃名具足尸罗。所谓体内方便。魔说之意。岂不然乎。如是闻魔不惊。于佛离着。乃是粗研三观之功也。前书云。立一切行以此观。导达之其有由矣</p><p>承师有言。火光正受。是苦行法门。当劫火洞然大千俱坏之时。则何人受于极乐</p><p>答曰。然身之际。岂定有人受于极乐。劫烧之时。岂定无人受于极乐。故净名经说。虽<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之业不失。而作受之者本无。法华云。劫火所烧时。我此土安稳。<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>常充满。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>所游乐。以苦行人即本来人故。离有<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。本来人即苦行人故。非生灭法。全修在性。全性成修。此时彼时。无增无减。实不可思议也。此之正受。体是无上人法。贯彻三际。绵亘十方。成住坏空。不能变其质。水火风灾。未始离其用。以全金作器离水无波故。岂唯一理该通。抑亦当念总摄。故十方刹海。九世往来。同趣一心。名妙三昧。而以苦行为主者。原治事恶。助开理修。以为最后用心。庶作增上净业。既正助合运。乃修性一如。不离此心。而至极乐。前书云。办一切事。以此观成就之。其在此矣</p><p>杨文公谢法智答三问答</p><p>(亿)启。近致问端。远承答诲。恭闻了义。尤涤蒙襟。盖龙象之极。谈续云雷之雄韵。依而领解。奉以遵行。足照了于色空。乃混同于心境。往生随愿。福智并严。受顶记。以何赊。得法乳之正味。然而陋闻所及。结舌匪容。有疑须争。罔关于人我。觌面相示。期达于本源。若乃谷响随声动。彰于答应。镜火立照随。显于形规。如理而言。表枢机之迅发。依经以解。味糟粕以沉研。其如离句绝非。终焉杳邈。丧词忘虑。曷取攀缘。惟少室之宗风。本<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>之笑视。瞥然起念。已蹉西天之程。兀尔忘情。正坐山鬼之窟。有修有证。虑剜肉以成疮。以心传心。乃标指而为月。自他路绝。生佛道齐。纵直下以承当。已未来而丧失。故黄蘖痛杖于临际。至再三而自知。船子挥楫于夹山。一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>而顿悟。傥全无扣激。遂泯于宗风。然少室机锋。为求于道契。恭承旨喻。但积钦隆。谅惟领众之余。允获深禅之乐。未期瞻拜。但积倾依。谨奉状起居谢</p><p>法智再书上杨文公</p><p>(知礼)谨焚香涤研写书。贡于秘监大檀越。(知礼)伏念。僻居海角。杳隔朝端。每思摩诘之威仪。屡破禅那之方便。恭惟。秘监大檀越。早亲先佛。深证无生。以本愿而熏心。作大臣而<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。故得儒释双洞解行两臻。于习禅阐教之流。起密友至亲之想。为法之切。究理之精。当代之间。一人而已。而(知礼)智非深证。行未超常。偶以友僧。达于非善。便赐优隆之遇。特加振发之恩。荐以命衣。旌乎讲业。虽匪本心之所欲。乃于大教而有光。仍自妙证之心。特设难思之问。深以发明奥旨。遍令悟解圆宗。既受击扬。敢无酬对。实谓。将金易麨。殊非如响。答声。岂期。辱示长笺。远慰山抱。旨辞稠叠。粉饰过逾。见深明少室之真风。仰高体灵山之密旨。是兹超悟。诚谓绝伦。又轸深仁重垂。敦劝俾满三年之忏。且留四大之身。在檀越之爱念。谓必有益。如鄙僧之揆度。知去乃成。良由以教照心历缘验行。虽修三观。未破四魔。虽运慈悲。潜生爱见。无船救溺。带病称医。既无济度之功。宁有疗治之益。欲图真化。须云净方。故依大乘。专修妙忏。托道场之净境。革世务之杂缘。五悔洗心。一讲熏种。助发无生之观。期明具德之心。又乘报识之未衰。必于慧命之可策恭酬宿愿。决取往生。盖思现报之强牵。复虑宿殃而熟夺。乃凭苦行。庶作良缘。用薄解之功。导临终之念。不灭而灭。等后际以捐躯。不生而生。彻本源而取土。四十年而标意。期此克酬。百千劫之受身。谅皆虚掷。冀满匹夫之愿。难遵大士之言。此生觌面虽乖。彼土承颜。必遂专希外护之力。用副本心之期。仍念。所业教乘。仰托台恩庇荫。使乘乘不断。令处处皆闻。惟此是繄。仰期见允。(知礼)书不成字语。不成文。冀表寸诚。匪容假手。以此叙感。千万之一二也。伏惟。台慈略赐念察。不宣</p><p>杨文公再书请法智住世</p><p>(亿)再咨。(亿)顷露虔诚。愿延住寿。枉柔音之垂报。仰确志之惟坚。柰以。台教之复。兴聿自海邦而始唱。赖香象之所负。同优昙之一开。傥取证于乐邦。孰能扶于法运。迦文念过去之说。罔趣泥洹。生公待未至之经。久停枯聚。备存昔制。希察遐衷。幸甚幸甚</p><p>杨文公书上太守李夷庚同请住世</p><p>(亿)启。违阔已来。倾凝何极。辄有闻白。不避渎烦。顷者贵郡天台教主。礼大师。精修忏仪前约岁纪。将趋火化以泯身。缘(亿)素闻其风。辄伸首劝。以其通赤城之秘典。启浙水之度门。逈传<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>之妙机。允续能仁之慧命。实经论之龙虎。作黑暗之明灯。傥住世之久如。固利生之[穴/浸]广。函封沓委。志愿确坚。率和四众之情。叩端不已。度越重江之阻。驰讯继臻。得其来音。颇似相许。尚虑持于宿誓。或匪顾于幻躯。望敦外护之心。共延住寿之数。叶宣大教。克树胜因。遐祝在兹。繁述为此。凛冬冠序。精摄是宜</p><p>杨文公上天竺忏主启</p><p>(亿)启。逖仰孤风。宏敷至教。续台岩之慧命。逗浙水之上机。萦以尘烦。间于道里。阻亲软语。莫叩灵筌。清侣遐臻。圆封辱贶。同寄书于汉上。智辩难酬。陪结友于香山。愿心犹郁。钦承道眷。内积靦颜。暄序甫临。履用增胜。不宣</p><p>又致请法智住世内简</p><p>昨因闻。明州延庆寺礼座主。结僧入忏。期以三载。并趋火化。况此僧传持大教。徒众攸归。为世导师。开人眼目。得其久住。利益甚多。遂曾发书伸劝。他有答简。备述确乎之志也。今已召得他请益<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>(智环)来。此即总印大师。澄公之上足也。现欲专裁尺牍同其春水。请环师再伸劝请。切知。吾师与之同禀。并化东南。须仗法友之诚言。苦留大士而住世。相次别期奉简。先此导怀</p><p>杨文公又书留法智住世</p><p>(亿)启。近专驰寓谅已通。闻属在疚之方。初固叙怀。而未悉。盖以夙伸劝请。冀永住期。佥同缁白之诚。密契龙天之愿。允蒙金诺。遐慰蓬心。惟台岭之秘诠。免虞线绝。而灵山之慧命。克广灯传。社侣相欢。空居迭报。尚虑。大师未忘夙念。犹执誓言。外虽徇于吁辞。中尚存于确志。况义天初显。化土丛依。祈寿劫之增延。诱根机而[穴/浸]熟。利他斯博。报佛为深。虔露寸衷。幸副群仰。谨修状起居。咨问伏惟。照察谨状</p><p>法智再启复文公</p><p>(知礼)伏念。云在帝乡。豹栖山雾。虽体疎影吊。语默相悬。而道接魂交。朝夕自迩。岂谓蕙心见齿。琬检继臻。危坐整容。发函伸纸。粲星云之古字。俦彼偃波。铺绡縠之高文。篾夫雕玉。尤味雅旨。尚虑渝盟。切缘(知礼)学昧通情。辩疎精难。廓无极之野。贵乃游观。坥空洞之乡。聊兹偃仰。指华池而欲骛。誓薪榻以云。终免留曾布于笃诚。循省己移于壮志。既承爱物之道。奚爽可复之言。良由秘监侍郎。藻绘教门。丹青慈室。唯恐休明之代。篾闻圆顿之宗。示轩冕之身。上毗仁主。以寂照之道。克辅空王。欲进后贤。特垂洪范。但认流思斯博。岂同书带而休顾泉客之泣珠。未足为赠想。卫人之报玉。止解典言。承缉传通。庶酬[將/廾]劝。(知礼)上戴尊慈。山情不任</p><p>法智谢李驸马请住世书(驸马书旧失传)</p><p>(知礼)伏念。夙求藏密。因省庸才。漱石枕流。靡沽于荣利。收视反听。唯玩于希夷。拟捐如幻之躯。庶策无生之慧。岂谓。逈关雅素。遐示音徽。曲彰激劝之辞。俾退真归之限。金简玉字。如降丹室之中。瑶蕊[王*(虍-七+(一/八/八/目))]枝。永辉蓬庐之内。千钧未重。三观何厌。回虑孱微。敢言胜克然以驸马都尉。国纪人望。神清鉴明。品格悬殊。社颢才堪于亚相。声光奋发。传宣未可以偕行。良由尊道贵人。流谦崇让。既颇形于厚劝。讵奚诺以赐言。是敢竭朽竭愚。且讲且说。庶凭浩益。仰谢洪恩</p><p>法智贺杨文公加翰林书</p><p>(知礼)伏审。荣奉金泥。首司玉署。欢捴??F舸ξ薮印7??G煳竟б浴:渤な汤伞;?欣廴省2┪叶嗍丁S凶羰敝?馈N廾氖乐?荨T顺锟把怯谧臃俊R胖蔽慈挠谑逑颉</p></div>"
},{
    "title": "四明尊者教行录 第六卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第六卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>延庆寺二师立十方住持传天台教观戒誓辞使帖延庆寺</p><p>皇宋明州新修保恩院记(并史文惠王跋)</p><p>上曾太守乞申奏后园地书(并草庵法师跋)</p><p>乞圣旨申礼部公据</p><p>三省同奉圣旨</p><p>圣旨本州出给公据</p><p>四明图经纪延庆寺迹</p><p>曾鲁国宣靖公祠堂记</p><p>四明图经纪宣靖公祠</p><p>曾相公府延庆寺置庄田帖(并陆薛二知府跋)</p><p>晁待制作纪赠法智大师诗序</p><p>东京僧职纪赠法智诗二十三首</p><p>四明法师受命服门人神照作致语</p><p>四明尊者传持为二十九代祖师</p><p>四明尊者遣僧日本国求仁王经疏</p><p>纪神照法师悟经王颂</p><p>四明门人霅川净觉法师</p><p>妙悟法师辅四明作评谤书</p><p>草庵教苑遗事纪法智讲贯</p><p>记四明门下纂成十类</p><p>延庆寺二师立十方住持传天台教观戒</p><p>誓辞</p><p>院丙申秋七月承旧。越十年经始陈修。己酉告成。石公勒石。纪之逮壬子。凡十七年。咸安来学。二师同心祈佛。永命用休。昭烈山家教门。既遂攸叙。惧寿不我永。乃嘱院于后贤。惟善继者居焉。永永相授。非锡于子孙。遂作戒誓。使无反诲言。乃顾于手度<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>(立诚又玄本慈本常尚闲德才昙慧昙觉本淳)作戒誓。于是我等小子。咸载拜受命。二月刻石。存乎不朽。二师称(知礼)。次师称(异闻)</p><p>戒辞</p><p>吾惟有惭德。为汝等师无忘在三。咸承攸诲。吾昔之日受天台智者教观于宝云师门。非欲兼人受。以自益无何。尚即先师轮下。已有好学。萃吾左右。虚誉丧实。怅然长怀。既值鹤林。始迁旧乾符寺于西偏小院。有寝无庙。学徒爰止。盈十莫容。又观其密迩阛阓。诚非久宜。遂图此城东南隅。閴若林野。略允乃怀。既而备历艰关。用图周给。惟念传法。曾无他心。近以盖葺。有成广袤。兼称臼杵之利。自穷于通。适好传持。老之将至。往不可补。来宁几何。都由德薄位尊力少任重。略丧岁月。墓塞我心。山家妙宗。终何假寄。呜呼吾恨。生匪缘会死。乖物议。大车兼运。方将待人。吾等要持此讲处及所集教文。仰给后贤。用永敷训。俾法灯芳焰分照无穷。法鼓妙音遐震有截。法华若田若里。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>若树若石。梵网勖令建立。大集美其宣通。吾将藉此微缘。少补传化。汝既吾党。钦若我言。无匿尔怀。面受斯诲。矧夫我大师。能仁之制乃尔。攸闻三月迁居。八秽靡畜。子孙受业。非俗如何应知。四事本给谁乎。苟明负经戒。师严道尊。将无与汝未来堕焚。抑吾始以十方之心。受兹住处。逮乎改创安施栋宇。元为聚学。何敢私哉。孺子其明。自往无[忒-弋+戈]。今吾命汝。一无起秽以自臭焉。自吾之后。汝无复视厥居而廞己想。况朝夕处乎。吾为物主。既已仰给十方。尚非吾分。矧他人哉。但吾宗大德。备五者无择迩遐。吾将授以居之。后后之谋咸然。一曰。旧学天台。勿事兼讲。二曰。研精覃思。远于浮伪。三曰。戒德有闻。正己待物。四曰。克远荣誉。不屈吾道。五曰。辞辩兼美。敏于将导。何哉兼讲则叛吾所嘱。浮伪则误于有传。戒德则光其化道。远誉则固其至业。然后辩以畅义。导以得人。五者宁使有加。设若不及去辩矣。呜汝诸子中。有备斯德者。戒哉。亦无复居之矣。将挟尔众疑反吾诲也。畴念尔材。亦使汝后将怀子孙塞吾贤路。苟其不然。亦使后之人犹吾之授子矣。终否在兹。终否在兹。小子思之。汝克由吾。亦克由圣。汝不畏吾言。亦不畏<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>言。圣不云乎。但惜无上道。终不爱身命。亡躯存法。合在汝躬。况余者也。故吾惭所嘱盖微。非自大其事。吾言乃由汝言也。苟犹不畏吾言。吾有誓愿。神明照之。灾祥不僣。汝其戒哉</p><p>誓辞</p><p>沙门(知礼异闻)一心一意异口同音仰白。十方<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a><a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>释迦<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。当来<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>正遍知者。<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>。南岳禅师。天台智者。山门诸祖。各得真证。无碍道人。梵王。忉利。四镇天王。龙神八部。主善罚恶。守护塔寺。及五岳四渎正直鬼神。惟愿各以<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>本誓。屈降证明(知礼)等夙承慈熏。幸值天台智者说证法门。念报曩缘。竭愚讲训。绵历岁月。唐丧光阴。载眷所传。俄成断种。今各年逾知命。运近死王。既事与愿违。空抚膺长恨。刻肌剜骨。宁补前非。今与手度弟子(立诚又玄本慈本常尚闲德才昙慧昙觉本淳)等。下至系籍<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>一聚眷属。持所住讲院及所集教文。仰给将来十方传教菩萨。所祈后后遰相传付。以至无穷。略展诚怀。不辜遗嘱。窃以。如来垂像。久托鹫山。须达归心。先经祇树。梵王奉宫。而请说。净名卧室。以兴谈。至于<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>住持。皆嘱塔庙。四依继轨。咸显所居。既法藉人宣。故人必依处。此处虽寄聚落。颇若山林。西映湖光。东连野色。栋宇延袤。粗可栖依。灭后造堂。恶世扬法。日藏称如来游止。法华谓是佛受用。今兹陋室永言通经。仰惟诸佛慈临。四依哀纳。庶令凡鄙自然<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>永远休光未来安处。道隆内院化广香城。常得善师。遐聚贤学。星分法炬。遍照于十方。流布宗乘。绵亘于三世。常寿不断。妙种益滋。其或恶党凶徒。将来固占。恃权结势。横见欺夺。废传<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。障塞行道。我已将此处。奉上三宝。仰给传持。是人便为固占。欺夺佛受用处。亦是废坏转法轮处。亦是离间和合学处。此人当得破灭三宝断学般若。极重<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>。况复末世。护法为难。法华骂佛尚轻。不亦传护事重。当愿若我徒党乃至余人。将欲占据我传法处。动心则应时狂迷。动口则失音不语。动身手者。或被风挛。或遭火烂毒蛇蝮蝎一切侵害恶疮脓血盲聋喑痖。肢体阙坏。牢狱怨贼。枷杻刀杖。恶鬼霹雳。毒药横灾。一切诸难。令其备受。所有眷属。病恼斗诤。悉亦离散。住我此处。心常[跳-兆+參]热。如处火镬。所视毒其眼。所闻毒其耳。嗅尝及触皆成毒害。凡有触向。悉不安隐。命终当堕阿鼻<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。成坏转寄。永无出期。未来余殃复倍前劫。宁坏我身。宁断我命。宁破我眼。若坏我形命眼目。终不咒令是人招斯等苦。若坏我此处。即是断我及一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a><a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>善根般若种性。亦断智者教观<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。亦灭如来遗化势力。以要言之。即是坏灭十方三世三宝寿命正<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>目。开一切众生三恶趣门。闭一切人天涅槃道路。此人罪报不可思议。仰愿。诸佛菩萨诸天龙神。遮护此人。勿令一念起此恶心。况至毁坏。又愿。国主皇帝诸王辅相职权主任州牧县官大势力人。同垂卫护。令得此处永永传法绳绳靡绝。若我徒党及余诸恶<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。或有干执乃至毁撤此传法处者。愿准涅槃十六大国王大誓护法。严用折伏。乃至驱令还家。亦愿如彼经文。过去有王。身命护法。生不动佛国。为彼佛上首菩萨弟子。护<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>重。胜报无穷。下至我眷属知识。见闻<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>者。但能赞助。光显此传法处。愿此天众。在在处处。常为诸佛菩萨诸天圣众。所见爱念。昼夜护持。如彼恶人所得罪报。我得福乐。复过于彼。彼罪有漏。会有尽时。我福无为。同<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>性。庄严法界一切有情。同会菩提及涅槃道</p><p>祖师戒誓。志愿弥深。碑石烬亡。辞存旧本。比丘(法振)紏率府郭弟子叶(枝荣)等。买石命匠刻镌。用示见闻。共沾利益。时绍兴五年岁次乙卯十月吉日。传天台教观住持法孙澄照大师觉先重立</p><p>使帖延庆寺</p><p>据本院住持。传天台教沙门(知礼异闻)着状称先去。至道二年七月内。前两次院主僧(居明显通)舍此院与(知礼异闻)永作十方住持。传演天台智者教法。安僧<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。自此相次。主持院事。聚诸学徒。讲习天台教法。经今一十六年。昨为舍宇颓毁稍妨安众。遂请天台山金文藏院僧觉圆。募缘重新修盖。今已圆就。见管系帐。屋宇一百二十余间。已蒙颁赐敕额旌显院门。僧众五十来人。讲习焚修。上酬国泽。切缘此院元舍与(知礼)等永作十方住持。即非徒弟继续之限。常须名德僧继代讲演。不废安众焚修。欲依准江南湖南道山门体式。永作十方住持。(知礼异闻)或终身后任。在院僧众并檀越。于本院学众中。请明解智者教乘。能聚四远学徒。有<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>僧。继续传教住持。或本院全无此德人。即于他寺及他郡。请的传天台教法备解行僧。传教住持。并常选请到院听学僧。充主事。所冀永远安僧。焚修讲演。祝延圣寿。伏虑。将来徒弟。不悉元舍院宇住持因依。妄有干执。并恐将来本院。及外处僧讲业不精。但以传天台教为名。因嘱托权势。求觅住持。乞行止绝。代代须得素业天台智者教乘。实有戒行学众。咸愿者。住持此院。继续讲演。所冀常有德人。<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>妙教。上资国祚。广福蒸民。遂于大中祥符三年七月内。经使衙陈状。乞备录因依。奏闻天听。乞降敕旨。许永作十方住持长演天台教法。蒙使衙申奏。况本院徒弟僧(立诚又玄本慈本常尚闲德才)等。着状称伏睹师主(知礼异闻)经州陈状。将本院。永作十方住持长演天台教法。即非徒弟继续之限。(立诚)等亦愿将此院。永作十方住持。代代请明解智者教乘。能聚四远学徒有德行僧。传教住持。常选请到院听学僧。充主事。(立诚)等各有咸愿。更无干执。伏虑。将来别有徒弟。不知元舍院宇住持因依。妄有执占。乞备录情状。一处申奏者。蒙使衙具缘由体量申奏。当年十月内。准中书劄子。奉圣旨。宜令本院依久例指挥。寻蒙使帖下僧正司。仰详中书劄子内圣旨。速疾分析。久例具结缆供申。据僧司申称。勘会本州。天童山景德寺。大梅山仙居院两处。亦是十方住持。即依得上项江南湖南道山门体式。如勘会天童大梅两处不是十方住持。甘伏深罪者。蒙使帖下本院。仰依中书劄子内圣旨。并僧司分析到天童大梅等处。体例施<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。今欲传写圣旨并前后使帖。镌上石碑永作十方传教住持程式。申乞下司。指挥者右具如前。今捡昨据延庆院住持。传天台教沙门(知礼异闻)陈状。乞依准江南湖南道山门体式。将此院永作十方住持。及据徒弟僧(立诚)等六人着状。亦乞将此院永作十方住持。代代常须明解天台智者教乘。有德行僧继续传教住持。州司寻于大中祥符三年八月十一日。具状申奏。乞降敕命。指挥至当年十月十八日。准中书劄子。奉圣旨。宜令本州依久例指挥者。遂具录帖延庆院。仰一准中书劄子内圣旨。指挥去讫续于大中祥符四年三月内。又据经(知礼)等经州着状。称虑。将来别有徒弟不悉事由。谓依别院徒弟继续。体例妄生干执。有妨名行僧传教住持。乞再录因依闻奏。明降敕旨下本院。永作十方住持长演天台教法者。州司缘已曾申奏。明准圣旨指挥讫。遂具备状帖。僧正司仰详中书劄子内圣旨。疾速分析。久例具结缆。文状供申。续据僧司申。今捡本州天童山景德寺。大梅山仙居院两处。亦是十方住持。即依得上项江南湖南道山门体例。如勘会天童大梅两处不是十方住持。即甘深罪者。已于今月二十四日。帖本院。仰详昨来所降圣旨。并此来僧正司分析。到天童大梅两处。体例施行去讫。今所再据沙门(知礼异闻)着状称欲备写圣旨并前后使帖。镌上石碑永作十方传教住持程式。乞降指挥等。事事须帖延庆院。仰详圣旨及前后使帖指挥。备到僧正司。分析体例。任便施行。勿至有遗。大中祥符四年七月十七日帖</p><p>观察推官邵(押)大常博士通判军州事成(押)</p><p>太常博士知军州事康(押)徒弟僧(尚闲)句当树立</p><p>绍兴二十六年岁次丙子十二月一日住持传天台教观赐紫觉云大师(智连)重立</p><p>皇宋明州新修保恩院记</p><p>将仕郎守大常博士通判军州兼同</p><p>监市舶管内劝农事骑都尉借绯石</p><p>待问撰</p><p>若夫有生之生。肇自无始之始。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a><a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>汨没真如。往来于地水火风。合散于梦幻泡影。爱河浩浩。贯<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>以周流。尘网恢恢弥大千而洪覆。厥或渐修祇劫。顿悟<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。杰出此涂。径到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。变三十二具足相。化千百亿妙色身。普为一切心。广陈一切法。荫慈云于火宅。尽遣炎凉。揭慧日于昏衢。咸令夜晓者。其唯大雄氏而已乎。在昔周鲁二庄之时。我教已显。爰逮汉晋两明之后。吾道弥尊。莫不法<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>传心心相继。世无惭德。代有能仁。由是观之则像教之兴。其来久矣。梵宇之设。庸可阙乎。明州保恩院者。即沙门(知礼)座主。舍旧谋新之所作也。座主俗姓金氏。世居鄞江。七岁出家。于州之兴国寺。洎进具从宝云通法师。受天台智者教。是教也。广大悉被。微妙甚深。全兼<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>之功。尽得五时之味。义无幽而不显。理无隐而不彰。修之。止而念。念不差。斯之谓<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>成矣。然后<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>可断也。习之。观而空。空不滞。斯之谓慧解发矣。然后菩提可证。是以勤而行之。应堕恶道者。罪业即为消灭。守而勿失。种诸善根者。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>不可思量。座主二纪之余。一志于此。探赜索隐穷理尽性。可不谓勇猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>者欤。用能博极三乘周知<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。六尘不染。<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>皆空。甫乃吹大法螺。以警群迷。击大法鼓。而祛众惑。故得缁流蚁慕信士骏犇。有若鳞宗龙而羽宗凤也。先是此院缔构年深。颓毁日甚。思得能者从而兴之。众议所归。得请为幸。粤以至道三祀。乃与余杭素所同志息心异闻。乘召而至。勠力而居。一之二之岁。姑务经营。供其乏困。三之四之岁。肇兴<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>。要结檀那。五之六之岁。亲制<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>。训释精义。加以靡昼靡夜。或讲或忏。是以必葺之事。未暇矢谋。以日系时。方议改作。适值丹丘寿昌隶业苾刍觉圆。亦欲<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>愿言陈力。座主乃口传方略。指授规模。谈树提伽。以过去之因。说伊蒲塞。以未来之果。卒使悭贪易虑。结良缘而尽欲居前。喜舍励精。施净财而唯恐在后。一方响应。千里悦随。玉帛珠金。无胫而能至。楩楠[木*巳]梓。不召而自来。公输之削墨靡停。匠石之运斤弗辍。如是焉者三载。工乃讫役。观其基宇宏邈。土木镶丽。金碧交映。玉毫增辉。先佛殿而后僧堂。昭其序也。右藏教而左方丈。便于事焉。节棁并施。楹角咸刻。梁螮蝀而双亘。瓦鸳鸯而并飞。复道连甍。洪分蔽日。长廊广庑。[穴/叫]窱来风。游之者误在于化城。住之者疑居于幻馆。轮奂之盛。莫之与京。而又此邦异乎他群。列千峰于城上。止在檐前。走一水于[邱-丘+(序-予+墨)]中。才流槛外。地居形胜。天助幽奇。门开而紫陌相连。路僻而红尘不到。庭除冉冉坐对闲云。苔榭时时卧闻幽鸟。夫如是。亦何必乘杯访道。振锡游方。登涉于耆阇崛山。揭厉于阿耨达水者哉。待问通守竹符函亲松柄。会兹胜概。告厥成功。承列疏以见贻。遂抽毫而为识。非敢广征释部沾取文声。第庶几他日为莲社张本焉耳。时大中祥符二年岁在己酉四月六日立</p><p>昔有通法师。负大才识。远自三韩来。依中国求<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>大要。于是尽得天台<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>之义。得法弟子</p><p>四明法智尊者。与<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>慈云法师。二子青蓝冰水。能广其师之道。大兴天台一宗。直与智者并驾争驰。一时名士。如杨文公王冀公曾鲁公。相为师友。可谓盛矣。惟法智主明之保恩院。其后锡名为延庆。乃请于朝。永为天台教肆。所被敕文。与保恩院记旧有石刻。昨更兵火扫地不存。今住持觉云连公。道行高卓。希踪往轨。力访遗本。得之俾学徒戒。夫再刊诸石。工讫来丐数语。取信后世。余嘉其能不没前人之迹也。乃遂其请。绍兴丙子二月初吉。真隐<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>史(浩)跋</p><p>上曾太守乞申奏后园地书</p><p>(知礼)启。揆日祷圣。涤砚熏毫写意。上闻知府学士。伏念。(知礼)夙缘熏习性。好天台智者所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>门。故讨寻其意。讲说其文。如解而行。不闲寒暑。忍苦忘劳。于今四十余载。盖知此教。解圆行顿。理观事仪合一。而进趣于<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之门。可保任矣。切睹传此宗处。讲训。聚徒。乃勠力募缘。建造兹院。仅得成就。永作十方住持。传演天台教法。此事虽遂。且阙蔬园。乃俗父经公。传付本户地段数百余丈。与常住种植。逐日供僧。且免他求。实匪无厌虑。恐将来不知之辈。忽有词讼改更。恭乞学士。以洞达之心。为禅教之主。流布多艰。许赐闻奏天廷委达相府。然非受人舍施。亦非买置田园。乃是俗父授于男。不违条制。乞降敕命。俾此园地永在伽蓝。(知礼)礼像持经。心祈口祷。特为园事年深。果值学士行春。俯垂异顾。必期。此际克副愿心。切望。台慈念(知礼)苦行忘形为法特施巨力构此胜缘。(知礼)一日遂心。万死无虑。书不成字。语不成文。的写恳诚。不避荒拙。干冒威重。不胜悚惧。(知礼)启上。天圣三年八月十五日</p><p>昔法智大师作此书。求置后园地段。作今院宇建立基趾。其言恳至。其书勤劬。慕在兴隆广兹形胜。(道因)收藏有岁。惜其遗踪。恐未及见闻。刻之坚石。时崇宁元年壬午润六月望日。比丘(道因)立</p><p>乞圣旨本州申礼部公据</p><p>明州准行在<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>礼部符。准都省批送下。敷文阁学士左朝请郎知明州军州事提举学事莫(将)状。窃见本州延庆寺。系传天台教法。至道二年。创为十方。寺宇宏壮。学徒奔凑。传演不绝。真宗皇帝。尝遣使至寺。命僧(知礼)修治忏法。太子少保赵(</p></div>"
},{
    "title": "四明尊者教行录 第七卷",
    "author": "宗晓大师",
    "html": "<div class=\"B1_text\"><p>四明尊者教行录 第七卷</p><p>四明石芝<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>宗晓编</p><p>宋故明州延庆寺法智大师行业碑</p><p>明州延庆寺传天台教观故法智大师塔铭</p><p>四明法智尊者实录</p><p>十不二门指要钞序 <a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>(遵式)</p><p>祭四明法智大师文 同前</p><p>悼四明法师大师诗 同前</p><p>四明法智尊者赞 门人(僧江)</p><p>宋明州延庆法智大师真赞 御史(骆偃)</p><p>延庆始祖法智大师画像赞 太师(史浩)</p><p>四明法智大师赞 雪溪(希颜)</p><p>延庆法智祖师斋忌疏 陈(天俞)</p><p>四明法智大师讳日疏 雪溪(希颜)</p><p>延庆始祖法智大师忌疏 此山(可寿)</p><p>重修法智尊者像志铭 柏庭(善月)</p><p>宋故明州延庆寺法智大师行业碑</p><p>推诚保德功臣资政殿大学士守太子</p><p>少保</p><p>致仕上柱国南阳郡开国公食邑二千五</p><p>百户食实封六百户赐紫金鱼袋赵(</p></div>"
}]