[{
    "title": "法演禅师语录 第1995部",
    "author": "才良",
    "html": "<div class=\"B1_text\"><p>法演禅师语录 卷上</p><p>舒州白云山海会演和尚初住四面山语</p><p>录</p><p>参学才良编</p><p>师开堂日。授疏示众云。兵随印转。将逐符行。请对尊官。分明剖露。宣疏了指法座云。此大宝华王座。从朝至暮。与诸人同起同坐。诸人还见么。若见。更不在升。若不见。莫道今日谩儞。便升座拈香云。此一瓣香。先为今上皇帝。伏愿。常居凤扆永镇龙楼。次拈香云。此一瓣香。奉为州县官僚。伏愿。乃忠乃孝惟清惟白。永作生民父母。长为外护纪纲。又拈香云此一瓣香。得来久矣。十有余年海上云游。讨一个冤仇。未曾遭遇。一到龙舒。果遇其人。方契愤愤之心。今日对大众雪屈。须至爇却。为我见住白云端和尚。从教熏天炙地。一任穿过蔡州。有鼻孔底辨取。龙门和尚白槌云。法筵龙象众。当观第一义。师云。若论第一义。西天二十八祖唐土六祖。立在下风。一大藏教白云万里。摩竭掩室毗耶杜口。正在梦中。千佛出世寐语未了。文殊普贤拗曲作直。所以道。设使言前荐得。犹是滞壳迷封。纵饶句下精通。未免触途狂见。若也把定封疆。说什么法堂前草深一丈。直得凡圣路绝鸟飞不度。天下衲僧无出气处。众中莫有不甘底么。出来相见。时有僧问。优昙花现方便门开。朝宰临筵如何举唱。师云。今日好睛。学云。杲日当空清风匝地。师云。省得我多少。问如何是人中境。师云。宝阁凌空金铎响。怪松隈险野猿啼。学云。如何是境中人。师云。鼻直眼横。乃云。更有问话者么。若无。双泉今日向第二义门。放一线道。与诸人相见。和泥合水一上。且要释迦<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>动地雨花。文殊普贤观音势至。各踞一方助佛扬化。皆务本事器量堪任。双泉不免也入一分。共说东家杓柄长西家杓柄短。任从春草青青炎光烁烁。秋树叶零冬冰片薄。何故如是。且要诸人顺时保爱(谢辞不录)乃拈起拄杖云。古人道。拈起也天回地转。<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>也草偃风行。四面即不然。拈起也七穿八穴。放下也锦上铺花。且道。还有为人处也无。良久云。来年更有新条在。恼乱春风卒未休</p><p>师在白云授帖。拈起示众云。大众。只恁么会得。埋没宗风。过犯不小。幸有见成公案。请维那对众宣读。宣帖了授法衣提起云。既是大庾岭头提不起。为什么却在者里。且道。者里底是。那里底是。乃云。携瓶自汲清凉水。却着<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>作主人。便披指法座前云。象王回师子步。侬家看着双眉聚。然虽如是。事到如斯难为辞让但有路可上更高人也行。便升座。僧问。禅非意想道绝功勋。转身一句作么生道。师云。大众见儞。学云也。知和尚有此机锋。师云。独出阇黎。学云。今日却成造次。师云。捧上不成龙。问沙场久战名遂今朝。不涉功勋作么生道。师云。长蛇犹自可。偃月怎生当。学云。金镞惯调曾百战。铁鞭多力恨无仇。师云。知君不是金牙作。争解弯弓射尉迟。学云。眼亲不如手亲。师云。新长老败阙。学云。口是祸门。师嘘乃云。秋风飒飒玉露垂珠。水碧山青蛩吟蝉噪。圆通门大启。文殊普贤穿过汝诸人鼻孔。自是汝诸人当面讳却。复云。诸佛不出世。四十九年说。未审说个什么。少林有妙诀。殃及子孙。至今分疎不下。更说什么妙诀。若人识祖佛当处便超越。超越与未超越则且置。儞道。祖佛即今在什么处。若无人道得。山僧不惜眉毛。与汝诸人拈出。拍禅床一下</p><p>小参。僧问。如何是佛。师云。肥从口入。乃举。德山示众云。今夜不答话。有问话。者三十棒。众中举者甚多。会者不少。且道向什么处见德山。有不顾性命底汉。试出来道看。若无。山僧为大众与德山老人相见去也。待德山道。今夜不答话问话者三十棒。但向伊道。某甲话也不问。棒也不吃。儞道。还契他德山老人么。到者里须是个汉始得。况法演游方十有余年。海上参寻见数员尊宿。自谓了当。及到浮山圆鉴会下。直是开口不得。后到白云门下。咬破一个铁酸饀。直得百味具足。且道饀子一句作么生道。乃云。花发鸡冠媚早秋谁人。能染紫丝头有时。风动频相倚似向阶前斗不休</p><p>入院日。上堂。僧问。携筇领众祖令当行。把断封疆师意如何。师云。秋风吹渭水。落叶满长安。学云。四面无门山岳秀。今朝且得主人归。师云。儞道路头在什么处。学云。为什么对面不相识。师云。且喜到来。乃举。祖师道。吾本来兹土。传法救迷情。一花开五叶。结果自然成。达磨大师信脚来信口道。后代儿孙多成计校。要会开花结果处么。郑州梨青州枣。万物无过出处好</p><p>上堂。举古人道。若有一人发真归源。十方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>悉皆消殒。双泉则不然。若有一人发真归源。十方虚空筑着磕着</p><p>到兴化上堂僧问。和尚未离四面时如何。师云。在屋里坐学云。离后如何。师云。走杀阇黎。乃举<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>颂云。山水君居好城隍。我亦论静闻钟角响。闲对白云屯。大众。法眼虽不拏云攫雾。争柰遍地清风。四面今日试与法眼把手共行。静闻钟角响。且不是声闲对白云屯。且不是色。既非声色。作么生商量。乃云。洞里无云别有天。桃花似锦柳如烟。仙家不解论冬夏石栏松枯不记年</p><p>上堂云。天上无弥勒。地下无弥勒。十字街头立。被人唤作贼。便下座</p><p>上堂。僧问。四面无门山岳秀。个中时节若为分。师云。东君须子细。遍地发萌芽。学云。春去秋来事宛然也。师云。才方搓弹子。便要揑金刚。乃举。古人云我若向儞道。即秃却我舌。若不向儞道。即哑却我口。且道还有为人处也无。四面有时拟为儞吞却只被当门齿碍。拟为儞吐却。又为咽喉小。且道还有为人处也无。乃云。四面从来柳下惠</p><p>岁旦上堂云。元正启祚万物咸新。扬尽大千沙界。都来只在一尘。乃展手云。是新是旧。有人出来道看。若无四面且世谛流布去也。遂叉手云。孟春犹寒。伏惟。首座大众洎诸知事。尊体起居万福</p><p>上堂。僧问。千峰寒色即不问。雨滴嵓花事若何。师云。今日也相似。学云。一句逈超千圣外。千山锁断万重关。师云。一滴落在什么处。学云错。师云错。学云错错。师便打。乃云。千峰列翠岸柳垂金。樵父讴歌渔人鼓棹。笙簧[目*舌]地鸟语呢喃。红粉佳人风流公子。一一为汝诸人。发上上机开<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼。若向者里荐得。金色头陀无容身处。若也不会。吃粥吃饭。许儞七穿八穴</p><p>白众出队上堂云。明日匹马单锵。为国出战。得胜回戈之日。满路歌谣。大众。作么生是歌谣一曲。乃云。啰逻哩啰逻哩。还有人和得么。良久云。鸳鸯绣了从君看。莫把金针度与人</p><p>寒食夜小参。僧问。群迷久渴冒雨登山。向上之机请师方便。师云。不免入山一回。学云。恁么则步步踏实去也。师云。空手却回去。学云。若是那边。还的当也无。师云。罕遇知音。学云。谢师证明。师云。知音底事作么生。僧划一划。师云。又被风吹别调中。学云。往往随他口头走。师云。更是阿谁。乃云。李白桃红山青水绿。云横洞口月皎长空。若只向者里荐得。法眼道。月明幽室寒。星分拱辰异。便须瓦解冰消。韶国师道。通玄峰顶不是人间。心外无法满目青山。亦须百杂碎。何也尽乾坤大地不消一揑。然虽如是。事无一向。今夜且放过一着</p><p>上堂举。梁武帝问达磨。如何是圣谛第一义。磨云。廓然无圣。帝云。对朕者谁。磨云不识。又僧问六祖。黄梅意旨什么人得。祖云。会<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>底人得。僧云。和尚还得么。祖云不得。僧云。和尚为什么不得。祖云。我不会佛法。师云。大小大祖师。问着底便是不识不会。为什么却儿孙遍地。乃云。一人传虚。万人传实</p><p>小参。僧问。施主远趋于丈室。请师一句利于人。师云。教天下人<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>去。学云。悠悠尘内客。不谩入山来。师云。中间犹有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>在。僧便喝。师云。且道是佛是众生。学云。四面眼难谩。师云。儞向什么处见四面。僧拂袖归众。师云作家。乃云。满口道得底却不知有。知有底又道不得。且道过在什么处。将成九仞之山。莫惜一篑之土</p><p>上堂举。云门垂语云。古佛与露柱相交。是第几机。自代云。南山起云北山下雨。师云。大小大云门大师。元来小胆。四面道。古佛与露柱相交。是第四机。良久却云。者个说话。面皮厚三寸。出语成不逊。好将临济棒一日打三顿。什么人下得手。虽然罪过弥天新赦咸放</p><p>结夏上堂。僧问。五天结制分付蜡人。未审双泉如何示众。师云。足不履地。乃云。结夏无可<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>大众作一家宴管顾诸人。遂擡手云。啰逻招啰逻摇啰逻送。莫怪空疎。伏惟珍重</p><p>上堂云。于三七日中。思惟如是事。释迦老子半夜逾城直往雪山。早是漏逗不少。更思惟个什么。便下座</p><p>上堂举。药山久不上堂。主事报云。大众久思和尚示诲。山云。打鼓着。大众方集。山便归方丈。主事云。和尚许为众<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。何故一言不措。山云。经有经师论有论师。争怪得老僧。师云。虽然以己妨人。争柰贼身已露。诸人要识药山么。闲持经卷倚松立。笑问客从何处来</p><p>上堂举。僧问洞山。如何是善知识眼。山云。纸捻无油。师云。洞山老汉不是无只。是太俭。忽有人问四面。如何是善知识眼。只向伊道瞎。何故且要相称。乃云。纸捻无油也大奇不堪拈掇有谁知。回身却忆来时路。月下腾腾信脚归</p><p>上堂举。教中道。若谓如来有所说法。即为谤佛。只如一大藏教。甚处得来。若言无说。五千四十八卷什么处消遣。到者里须是个人始得。还会么莫谤四面好</p><p>上堂举。僧问投子。如何是十身调御。投子下禅床立。或有人问四面。如何是十身调御。老僧亦下禅床立。为什么却依样画猫儿。待我计校成。即说向儞</p><p>上堂举。药山问石头。三乘十二分教。某甲粗知。承闻南方直指人心见性成佛。某实未明。乞师指示。石头云。恁么也不得。不恁么也不得。恁么不恁么总不得。山僧在众日。闻兄弟商量道。即心即佛亦不得。不即心即佛亦不得。若恁么说话。敢称禅客。何故殊不知石头老人文武兼备韬略双全。若是四面见处。也要诸人共知。只见波涛涌。不见海龙宫</p><p>上堂云。三世诸佛遥望<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>。六代祖师开口不得。四面今日且权为指使。且道是个什么。一二三四。五雷门夸布鼓谩。说李将军蓝田射石虎</p><p>上堂云。真如凡圣。皆是梦言。佛及众生。并为增语。或有人出来道。盘山老[口*爾]。但向伊道。不因紫陌花开早。争得黄鸎下柳条。若更问道四面老[口*爾]。自云。喏惺惺着</p><p>上堂云。仲冬严寒。伏惟。首座大众。尊体起居万福。两彩一赛。便下座</p><p>上堂云。有一则语举似诸人。第一不得错举。便下座</p><p>上堂云。昨宵年暮夜。今朝是岁旦。都大寻常日。世<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>异见。不解逐根元。只管寻枝蔓。新旧只如今。子细分明看。若也更商量。秦时铎铄钻</p><p>诸院长老入山。师上堂云。临济入门便喝。是甚盌鸣声。德山入门便棒。抝曲作直云门三句。曹洞五位。大开眼了作梦。何故如此。国清才子贵。家富小儿娇</p><p>到龙门上堂云。有舌胡利。无口非哑。七出八没。风流儒雅。便下座</p><p>到海会上堂云。白云山里白云人。把定封疆无缝罅。无缝罅知几价。莫有知价底么。乃云。一二三四五</p><p>到兴化上堂云。世事冗如麻。空门路转赊。青松林下客。几个得归家。共唱胡笳曲。分开五叶花。幸逢诸道友。同上白牛车。大众。车在者里。牛在什么处。芳草渡头寻不见。夜来依旧宿芦花下座。<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>资长老。把师住云。舒州管界。元来有个草贼。师云和尚也须堤防。资拟议。师便拓开</p><p>上堂云。祖师道。叶落归根来时无口。祖师恁么道。犹欠悟在。便下座</p><p>上堂。僧问。祖意教意是同是别。师云。人贫智短马瘦毛长。乃云。祖师说不着。佛眼看不见。四面老婆心。为君通一线。便下座</p><p>上堂云。春气乍寒乍暖。春云或卷或舒。引得韶阳老子。放出针眼里鱼。乃云错</p><p>谢主事上堂。僧问。王索仙陀婆时如何。师云。七孔八窍。学云。如何是王索仙陀婆。师云。鸾驾未排齐号令。学云。如何是仙陀婆。师云。眼瞤耳热。僧<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。师云点。乃云。文殊张帆普贤把柁。势至观音共相唱和。赢得双泉闹中<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>。打坐即不无。且道下水船一曲作么生唱。啰逻哩啰逻哩。俗气不除</p><p>上堂云。今宵正月半。乾坤都一片。普贤门大开。相逢不相见。乃云。过在阿谁</p><p>上堂云。默默默。无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。从此得赚杀人。便下座</p><p>上堂云。适来思量得一则<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。而今早忘了也。却是拄杖记得。乃拈起拄杖云。拄杖子也忘了。遂卓一下云。同坑无异土。咄</p><p>上堂举。镜清问玄沙。学人乍入<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。乞师指个入路。沙云。还闻偃溪水声么。清云闻。沙云。从者里入。师云。果是得入。一任四方八面。若也未然。辄不得离却者里</p><p>谢典座上堂云。小绳钱贯大绳井索。日急要用笊篱木杓。虽然破家具。应用有处着着错。南北东西水洒不着</p><p>冬至上堂云。少年天子此日拜郊林泉之士。远望歌谣。万岁万岁。便下座</p><p>有一道姑。入山礼拜。请上堂云。道可道非常道。真可笑。姮娥一夜绣鸳鸯。解把金针呈巧妙。将并老黄梅儿孙一何拙。如今个个口吒呀。问着乌龟唤作鳖四面今日与君决。列怎生雪。冤家冤家。莫向背地里吐舌</p><p>次住太平语录</p><p>参学清远集</p><p>师入院日。僧问。远别双泉来临禅众。入门一句愿师举扬。师云。也待一一觑过。学云。恁么则清凉山远人休去。只此焚香便见师。师喝云。话也不领。学云。今朝亲见面。端的胜闻名。师云。犹自喃喃。问如何是太平境。师云。数层宝塔侵天起。万本乔松匝地寒。学云。如何是境中人。师云。闲持经卷倚松立。笑问客从何处来。学云。人境已蒙师指示。向上宗乘事若何。师云。须信下方城郭近。果然钟磬接笙歌。问如何是佛。师云。露胸跣足。学云。如何是法。师云。大赦不放。学云。如何是僧。师云。钓鱼船上谢三郎。乃云。我本<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>有所希求。今此宝藏自然而至。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之宝。能变穷为富。此之一宝。能转凡成圣。且道如今是凡是圣。太平道总不是。何故苦瓠连根苦。甜瓜彻蒂甜</p><p>上堂云。达磨无端少林面壁。二祖断臂。一生受屈黄檗树头讨甚木蜜。太平今日两眼如漆。李广神箭是谁中的</p><p>上堂云。十方诸佛六代祖师天下善知识。皆同者个舌头。若识得者个舌头。始解大脱空。便道山河大地是佛。草木丛林是佛。若也未识得者个舌头。只成小脱空自谩去。明朝后日大有事在。太平恁么说话。还有实头处也无。自云有如何是实头处。归堂吃茶去</p><p>上堂。僧问。如何是宾中宾。师云。少喜多嗔。学云。如何是宾中主。师云。传言送语。学云。如何是主中宾。师云。钟馗小妹。学云。如何是主中主。师云。一言才出口。地上绣絪开。乃云。近日太平院。禅和多聚散。参底老婆禅。吃底籼米饭。知事失照顾。主人少方便。虽然没滋味。要且缓缓咽</p><p>谢庄主上堂云。一不做二不休。不风流处也风流。若要公私济办。好看露地白牛</p><p>上堂云。此个物上拄天下拄地。皖水作口皖山作鼻。太平退身三步。放儞诸人出气</p><p>上堂。僧问。牛头未见四祖时如何。师云。头上戴累垂。学云。见后如何。师云。青布遮前。学云。未见四祖时。为什么百鸟衔花献。师云。富与贵是人之所欲。学云。见后为什么百鸟不衔花献。师云。贫与贱是人之所恶。乃云。西天二十八祖也恁么道。唐土六祖也恁么道。天下老和尚也恁么道。独有太平不恁么道何故寡不敌众且道。毕竟如何妙舞更。须知遍拍。三台须是大家催</p><p>上堂云。上是天下是地。南北东西依旧位。释迦老子弄精魂。达磨西来多忌讳。忽有个汉出来道。和尚低声。但向伊道。秖要抛塼引玉</p><p>上堂云。山僧今日。将山河大地。尽作黄金□该有情无情。总令成佛去。然后太平不入者保社。何故争之不足让之有余</p><p>上堂云。太平不会禅。一向外边走。腊月三十日。赢得一张口。且道那个是太平口。自云。两片皮也不识</p><p>上堂举。宝寿作街坊时。见两人相诤。一人以手打一拳云。儞得恁无面目。宝寿因而得入。若人于此知落处。可谓公办私办。大众。听取一颂。甚妙也甚妙。于此知性命。擗鼻与一拳。当时便打正</p><p>上堂云。太平淈[泳-永+盾]汉事事尽经遍。如是三十年也。有人赞叹且。道赞叹个什么好。个淈[泳-永+盾]汉</p><p>上堂举。教中道。假使满世间。皆如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。尽思共度量。亦复不能知。寻常衲僧家。高揖释迦不拜弥勒。是会佛智不会佛智。众中有则有。只是藏牙伏爪。太平有个见处。不惜眉毛举向诸人。待有人问随口便答</p><p>上堂。僧问。如何是夺人不夺境。师云。秋风吹渭水。落叶满长安。学云。如何是夺境不夺人。师云。路上。逢人半是僧。学云。如何是人境俱不夺。师云。少妇棹轻舟。歌声逐流水。学云。如何是人境俱夺。师云。高空有月千门掩。大道无人独自行。乃云。数日已来连绵大水。所到之处皆有损伤。曹源一滴弥满人间。衲僧一吸鼻孔辽天。且道名字既同。为什么损益有异。谁知远烟浪。别有好思量</p><p>上堂云。一叶落天下秋一尘起大地收。收即不无。何人亲手。月中仙桂和根拔。海底骊龙把角牵</p><p>上堂云。撮土为金犹容易。变金为土却还难。转凡成圣犹容易。转圣成凡却甚难。何故谁肯屈尊就卑。且道不凡不圣一句作么生道。乃云。不得教坏人家男女</p><p>上堂举。三祖见二祖礼拜。问曰。请师忏罪。二祖云。将罪来与汝忏。三祖云。求罪不可得。二祖云。与汝忏罪竟。因成一颂。举似大众。无孔笛子[疊*毛]拍板。五音六律皆普遍。时人不识黄幡绰。笑道侬家登宝殿</p><p>上堂云。浅闻深悟深闻不悟。争柰何争柰何。献佛不在香多</p><p>上堂云。开眼为昼合眼为夜。坐断舌头谁谈<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。金色头陀不入保社</p><p>上堂举。风穴云。若立一尘。家国兴盛野老嚬蹙。不立一尘。家国丧亡野老讴歌。太平即不然。若立一尘。法堂前草深一丈。不立一尘。锦上铺花。何也不见道。九九八十一。穷汉受罪毕。才拟展脚眠。蛟虫猎蚤出</p><p>上堂因雪。举僧问云门。不起一念。还有过也无。门云。须弥山。师云。有时问着师僧。或竖一指。或进一步。或下一喝。或拂袖便去。上座未在。何故太平未曾向二三月间下一阵雪。向汝诸人在。如今有。个汉出来道。老和尚莫七颠八倒。见今下也不是。乃展手云了</p><p>上堂僧。问莲。花未出水时如何师。云在。泥里学。云出。水后如何师。云在。水上问。王子未登九五时如何师。云逢。人多问路。学云。正登九五时如何。师云。天下太平。学云。登九五后如何。师云。谁论好丑。乃云。末后最殷勤。侬家随处新。大千沙界里。不免个中人且。道那个是个中人平。芜尽处是青山行。人更在青山外</p><p>上堂举。云门道。平地上死人无数。出得荆棘林者是好手。时有僧云。恁么则堂中第一座有长处。云门云。苏嚧苏嚧。太平即不然。平地上个个丈夫。荆棘林里坐得底是好手。何故乃云格</p><p>上堂云。将四大海水为一枚砚。须弥山作一管笔。有人向虚空里。写祖师西来意五字。太平下座大展坐具礼拜为师。若写不得。佛法无灵验。有么有么便下座。大众散。师高声云。侍者。侍者应喏。师云。收取坐具。复问侍者云。还收得坐具么。侍者提起坐具。师云。我早知儞恁么也</p><p>上堂。僧问。佛未出世时如何。师云。大憨不如小憨。学云。出世后如何。师云。小憨不如大憨。乃云。入荒田不拣。信手拈来草。不认大哥妻。元来是嫂嫂。郑州出鹅梨。青州出大枣。无事巾单下。个个从头咬</p><p>上堂云。山僧昨日入城。见一棚傀儡。不免近前看。或见端严奇特。或见丑陋不堪动转行坐。青黄赤白一一见了。子细看时。元来青布幔里有人。山僧忍俊不禁。乃问长史高姓。他道老和尚看便休。问什么姓大众。山僧被他一句。直得无言可对。无理可伸。还有人为山僧道得么。昨日那里落节。今日者里拔本</p><p>上堂云。有盐曰醎。无盐曰澹。太平闻说。口似匾檐。便下座</p><p>上堂云。<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>妙用不欠丝毫。通人分上何用忉忉。泥多佛大水长船高</p><p>上堂云。一月普现一切水。一切水月一月摄。诚哉是言也。可谓塑不成画不就。昨夜三更白如昼</p><p>谢典座上堂云。变生作熟虽然易。众口调和转见难。碱澹若知真个味。自然饥饱不相干</p><p>上堂。拈起拄杖云。昨夜三更梦见拄杖子。教我一片禅向我道。和尚明日早起上堂举似大众。昨日锦上铺花。今日脚蹋实地。但看今日明朝说甚祖师来意。翻思黄面老人。谩道<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>授记。直饶大地山河。借我鼻孔出气。不如放下身心。自然仁义礼智。为亡僧下火。举起火把云。火风四大互相违背。当此时节<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a><a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。次日又为一僧举起火把云。昨日也恁么。今日也恁么。且道昨日是今日是。说甚是不是儞看是甚火色</p><p>上堂云。今朝正月半。与诸人相见。嫰麦长新苗。粒粒皆成麫。荐不荐全藉春风扇</p><p>次住海会语录</p><p>参学景淳集</p><p>师入院。开堂日。宣疏了乃云。疏帖一时读了。若是具金刚眼睛底。何必重说偈言。虽然如是。事无一向。便升座拈香罢。四面白槌云。法筵龙象众。当观第一义。师云。金镞惯将平祖道。铁鞭多在恨无仇。莫有不顾危亡底衲僧么。出来相见。僧问。白云山下祖令当行。如何是祖令。师云。一二三四五。学云。恁么则昨日太平今朝海会。师云。高着师僧。问昔日为霖去。今朗领众来。朝贤临座下。愿震一声雷。师云。儞还闻么。学云。风送好云归碧洞。水潮沧海助波涛。师云。知心有几人。学云。寒山常抚掌。拾得每殷勤。师云。将谓无人。学云。也不得压良为贱。师云。且礼拜着。乃云。问话且止。夫第一义适来。若于四面捶下荐得。千圣不能近。祖师言不到。天下作者拱手归降何也。况第一义本来清净不受诸尘。如何说得。同道方知。今日放过一着。向建化门中。别作个解话会。是以绍先圣之遗踪。称提祖令。为后学之模范。建立宗风。若非当人。曷能传授(谢词不录)乃云。陈谢既毕。不可空然。有一颂举似大众。日暖风和花正开。七重山锁白云来。翻思城市繁华处。又出松门步一回</p><p>师在太平受帖。拈起。示众云。恁么会去。早是钝汉。何也若凭说五千四十八卷。岂不是说。若不凭说又如何辨白。请维那分明拈出。读疏了。遂升座乃云。祖令当行十方坐断。其中莫有不惜性命者么。出来与老僧相见。时有僧出云。日月易见好事难逢。师云。令人疑着。问公笺已至师今受。祖意西来愿举扬。师云。云从龙风从虎。学云。人天既获闻<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。更有尖新事也无。师云有。学云。如何是尖新底事。师云。蹉过也不知。问白云长老太平禅师。于其中间未审如何辨的。师云。儞试定当看。学云。莫是月无来去影现千江。师云。一任钻龟打瓦。遂云。法不孤起仗境方生。明镜当台好丑自现。久参上士言下知归。晚学初机当须子细。是以古人道。法无去来无动转者。辄成山颂举似大众。触目光明处处新。其中那个辨疎亲。祇园枝上千花秀。一度芬芳一度春</p><p>上堂。僧问。如何是佛。师云。悉达多太子。学云。逾城时如何。师云。自有四天王在。学云。到雪山时如何。师云。芦芽穿膝鹊巢顶上。学云。争柰未是学人安身处。师喝云。礼拜了退。乃云。天地为洪炉。烹炼强与弱。大道本无元。卷舒由橐钥。凡圣路坦然。各自看谋略</p><p>谢首座上堂云。槌破蟠桃核。得见其仁。捋断骊龙须。得遇其宝。虽然如是。也未是好手。黄帝失玄珠于赤水。使智索之而不得。使离未索之而不得。使契诟索之而不得。乃使罔象。直饶罔象得之亦未是好手。争似今日与大众。同使一个通事舍人。虽然如是。也只得一半</p><p>上堂云。永嘉道。取不得舍不得。不可得中只么得。祖师道。不是心不是物不是佛。大众且道。是个什么。乃云。到江吴地尽隔岸越山多</p><p>结夏上堂。僧问。如何是白云境。师云。七重山锁潺湲水。学云。如何是境中人。师云。来千去万。学云。人境已蒙师指示。向上宗乘又若何。师云。面赤不如语直。乃云。此夏居白云。禅人偶聚会。三月九旬中。尊卑相倚赖。粥饭与茶汤。精粗随忍耐。逐意习经书。任运行<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。彼此<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>儿。放教肚皮大</p><p>上堂云。昨日有一则因缘。拟举似大众。却为老僧忘事都大。一时思量不出。乃沉吟多时云。忘却也忘却也。复云。教中有一道<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>。号聪明王。有人念者。忘即记得。遂云。唵阿卢勒继娑婆诃。乃拍手大笑云。记得也记得也。觅佛不见佛。讨祖不见祖。甜瓜彻蒂甜。苦瓠连根苦。下座</p><p>解夏上堂云。一尘起大地收。一叶落天下秋。金风动处。警砌畔之蛩吟。玉露零时。引林间之蝉噪。远烟别浦。行行之鸥鹭争飞。绝壁危峦。处处之猿猱竞啸。又见渔人举棹樵子讴歌。数声羗笛牧童戏。一片征帆孤客梦。可以发挥祖道建立宗风。九旬无虚弃之功。百劫在今时之用。如斯话会。衲子攒眉。不见道。一尘不立始归家。若有纤毫非眷属</p><p>上堂。僧问。见来不采时如何。师云。各自守疆界。进云。见来却采时如何。师云。看筑着儞鼻孔。学云。谢师答话。师云。放。乃云。古人道。如何是不动尊。朝到西天暮归唐土。大众莫是动而不动。不动而动么。只者便是白云见处</p><p>郡中回上堂云。船上无散工。时时事不同。昨朝城郭里今日白云中。且道不动尊在什么处。自云。气似韛袋。令人可爱</p><p>自出缘化回。上堂云。白云海会院。足水兼柴炭。唯少麻与麦。众人皆尽见。亲去化檀那疎却阿罗汉且望大慈悲。一一看佛面。大众。<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>充满于法界。且作么生看。我道不隔一条线</p><p>上堂云。幸然无一事。行脚要<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>。却被禅相恼。不透祖师关。如何是祖师关。把火入牛栏</p><p>上堂云。我有一柄帚。扫尽雪山雪。我有一张口。临事无可说我有一双眼。和盲悖诉瞎。任意过平生。乌龟唤作鳖。处世学为人。吃水须防噎。仰山曾道底。两口一无舌。四海五湖人。当阳瞥不瞥</p><p>上堂举。灵云悟桃花颂云。三十年来寻剑客。几经叶落又抽枝。自从一见桃花后。直至如今更不疑。玄沙云。谛当甚谛当。敢保老兄未彻在。师云。说什么谛当。更参三十年始得</p><p>上堂。僧问。如何是佛。师云。独木桥子。学云。如何趣向。师云。紧峭草鞋。乃云。幸然可怜生。刚地学参。问既然参得了。未免肚里闷。闷即自家闷。困即自家困。祖佛生冤家。好与槌一顿。且道。<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>过在什么处。若人会得。许儞具一只眼</p><p>桐树郭宅请升座云。桐林郭评事家门幸。食禄性静好。吾宗温良如美玉。封疏请诸山。营斋殖洪福。二人长老共谈玄。正值阳和二月天。渴鹿饮溪冰作水。野猿啼树雾成烟。黄梅路上多知己。今日同乘般若船。乘船即不无。且道。说个什么事。幸遇三春明媚。因行不妨掉臂。啰逻哩啰逻哩。乃拍手大笑云。是何曲调万年欢</p><p>上堂云。二月春将半。相呼同赏玩。寒食近清明。百花开烂熳。或上白云峰。或游赤水畔。野外标坟人。路傍酒醉汉。半笑半悲啼。真诚堪赞叹。人人谓我泄天机。子细分明与批判。看看。五湖禅客莫轻詶。记取今朝者公案</p><p>上堂举。赵州问婆子。什处去。婆云。偷赵州笋去。州云。或遇赵州又作么生。婆连打两掌。州便休去。师云。赵州休去。不知众中作么生商量。白云也要露个消息。贵要众人共知。婆子虽行正令。一生不了。赵州被打两掌。咬断牙关。婆子可谓去路一身轻似叶。赵州高名千古重如山</p><p>上堂云。僧问云门。如何是一代时教。门云。对一说。师云。对一说。卷尽五千四十八。风花雪月任流传。金刚脑后添生铁</p><p>施主请上堂云。道吾与渐源。往山下吊慰。源拊棺问曰。生耶死耶。吾云。生也不道。死也不道。源云。为什么不道。吾云。不道不道。回至中路。源云。和尚须与某甲道。若不道。即打和尚去也。吾云。打即任打。道即不道。源便打。至院吾令潜去。白云今日忿气不甘。须要断者公案道。吾第一不解与身作主。第二不能随机入俗。当初待伊问道生耶死耶。但向伊道。等归院里向儞道。当时若着得者语。灵利汉一蹋蹋着。大小大道吾和尚也。又免得一顿拳头。有眼底子细看</p><p>解夏上堂云。九旬三个月。弹指瞥然间。忙者直然忙。闲者直然闲。事事无穷尽。千古白云山</p><p>上堂举。云门一日普请般柴次。乃抛下一片柴云。一大藏教。只说者个。师云。大小云门。错下注脚。老僧当时若见向伊道。普请处不得狼藉。若点检得出。免儞普请</p><p>上堂。僧问。如何是先照后用。师云。王言如丝。学云。如何是先用后照。师云。其出如纶。学云。如何是照用同时。师云。举起轩辕鉴。蚩尤顿失威。学云。如何是照用不同时。师云。金将火试。乃举。僧问首山。如何是佛。首山云。新妇骑驴阿家牵。大众。莫问新妇阿家。免烦路上波吒。遇饭即饭遇茶即茶。同门出入宿世冤家</p><p>上堂。僧问。如何是临济下事。师云。五逆闻雷。学云。如何是云门下事。师云。红旗闪烁学云。如何是曹洞下事。师云。驰书不到家。学云。如何是沩仰下事。师云。断碑横古路。僧礼拜。师云。何不问法眼下事。学云。留与和尚。师云。巡人犯夜。乃云。会即事同一家。不会万别千差。一半吃泥吃土。一半食麦食麻。或即降龙伏虎。或即摝蚬捞虾。禾山唯解打鼓。秘魔一向擎叉。者个一场戏笑。皆因微笑拈花。白云随队骨董。顺风撒土撒沙。若无者个肠肚。如何衣锦还家。且道还家一句作么生道。今日荣华人不识。十年前是。一书生</p><p>上堂云。但知吃果子。莫管树曲彔。不识曲彔树。争解吃果子。不过祖师关。争会敌<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。如何是祖师关。拈却大案山</p><p>上堂云。一向恁么去。路绝人稀。一向恁么来。孤负先圣。去此二途。祖佛不能近。设使与白云同。生同死。亦未称平生。何也凤凰不是凡间鸟。不得梧桐誓不栖</p><p>上堂举。法眼道。识得橙子周匝有余。云门道。识得橙子天地悬殊。师云。这两人。一人过船。一人渡水。若点检得出。许儞具正法眼</p><p>上堂云。望天祈好雪。祥瑞实难加。鹊噪青松上。变成白老鵶。紫骝牵出薄寒马。金镫妆成银镂花。苦苦苦个什么。忽然变成雨</p><p>石台师弟至。上堂。僧问。如何是和尚家风。师云。铁旗铁鼓。学云。只有者个。为复别有。师云。采石渡头看。学云。忽遇客来如何只待。师云。龙肝凤髓且待别时。学云。客是主人相师。师云。谢供养。乃云。昔日先师颂临济三顿棒云。一拳拳倒黄鹤楼。一趯趯翻鹦鹉洲。有意气时添意气。不风流处也风流。大众。若到白云门下。须要众人助拳</p><p>上堂。举起拳头云。若唤作拳头。一似不曾行脚。若不唤作拳头。对面相谩。除此之外。也少一拳不得</p><p>出队归上堂云。出队半个月。眼不见鼻孔。忘却祖师禅。拾得个骨董。且道向什么处着。一分奉释迦牟尼佛。一分奉多宝佛塔</p><p>谢首座上堂云。弥勒看不见。释迦说不得。恁么尊贵生。日用无差忒。得不得识不识。<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>六味味逾多。千古万古为规则</p><p>上堂。僧问。如何是燃灯前。师云。令人疑着。学云。如何是正燃灯。师云。错认定盘星。学云。如何是燃灯后。师云。一场懡[怡-台+羅]。乃云。每月有个十五。无始劫来尽数数。到弥勒下生。未免有甜有苦。且道毕竟如何。南山白额大虫元是西山猛虎</p><p>上堂云。日可冷月可热。众魔不能坏真说。大众。作么生是真说。泼狼泼赖。若信不及。白云为儞道。一要众人会。二要龙神知。乃拈起法衣云。者个真红色。刚然道是绯</p><p>法演禅师语录卷中</p><p>舒州白云山海会演和尚语录</p><p>上堂云。风和日暖古佛家风。柳绿桃红祖师巴鼻。眼亲手办未是惺惺。口辩舌端与道转远。从门入者不是家珍。且道毕竟如何相见。</p><p>又云。无事不来还忆君</p><p>上堂。僧问。如何是白云为人亲切处。师云。爱捩转人鼻孔。学云。便恁么去时如何。师云。不知痛痒汉。乃云。四海五湖奇士。围绕无状村夫。只解拖犁拽耙。水草无底钵盂。高悬羊头卖狗肉。时中那辨精与粗。恁么续佛<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。诚哉天地悬殊。谁有拔山之力。横身担荷也无。有么有么。有即家门富贵。无那辜负老卢</p><p>上堂举。僧问巴陵鉴和尚。祖意教意是同是别。鉴云。鸡寒上树鸭寒下水。师云。大小大巴陵。只道得一半。白云即不然。掬水月在手。弄花香满衣</p><p>上堂云。春风别有巧工夫。吹绽百花品类殊。唯有牡丹并芍药。时人一见便欢娱。且道衲僧分上。成得什么边事。拈来嗅罢归何处。透骨馨香付老卢</p><p>上堂。僧问。达磨面壁时如何。师云。计较未成。学云。二祖立雪时如何。师云。将错就错。学云。只如断臂安心时又如何。师云。炀帝开汴河。学云。总不恁么时如何。师云。却问取二祖。乃举达磨问二祖作什么。二祖曰。请师安心。白云当时若见。好与二十棒。何故他人觑见将谓。两个说安心法。毕竟如何。菩萨龙王行雨润。遮身向上数重云</p><p>上堂云。昨日闹哄哄。今朝静悄悄。子规枝上啼。虾蟆钻入草。好个寒食天。辜负白云老。为亡僧下火。提起火把云。大众。三世诸佛向火焰里转大法轮。闻名不如见面。今日智悟上座。见面不如闻名</p><p>上堂举。庞<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>问马大师。不与万法为侣是什么人。大师云。待汝一口吸尽西江水。即向汝道。师云。一口吸尽西江水。洛阳牡丹新吐蕊簸土扬尘勿处寻。擡头撞着自家底</p><p>结夏上堂云。圣制已临时当初夏。幽邃之岩峦苍翠。毕钵无差。潺湲之溪谷清冷。曹溪仿佛。称衲子安居之地。实吾家禁足之方。大敝禅关巨延俦侣。扶立宗旨高建法幢。上答君亲下资含识。莫不栴檀林中栴檀林。师子王多师子众。师子众共跻攀。万象森罗指掌间。大众。灰头土面从他笑。赢得白云堆里闲</p><p>上堂。卓拄杖一下乃举起云。拄杖子敢问儞。还说得如来禅么。自云。说不得。还说得祖师禅么。自云。说不得。既说不得。白云今日出自己意去也。出自己意小儿子戏。人天众前讨甚巴鼻</p><p>上堂。僧问。如何是白云一滴水。师云。打碓打磨。学云。饮者如何。师云。教儞无著面处。乃云。恁么恁么。虾跳不出斗。不恁么不恁么。弄巧成拙。软似铁硬如泥。金刚眼睛十二两。衲僧手里秤头低。有价数没商量。无鼻孔庭将什么闻香。邑中升座云。白云相送出山来。满眼红尘拨不开。莫谓城中无好事。一尘一刹一楼台</p><p>上堂举。马大师不安。院主问云。和尚近日尊位如何。大师云。日面佛月面佛。师云会么。如不会。白云与儞颂出。[髟/?]鬟女子画娥眉。鸾镜台前语似痴。自说玉颜难比并。却来架上着罗衣</p><p>炙茄会上堂云。六月三伏天。火云布郊野。松间临水坐。解带同欢奲。毳侣弄荷花。宾朋倾玉斚。红尘事繁华。碧洞何潇洒。重会在明年。相期莫相舍。白云曾有约。愿结青莲社</p><p>上堂云。佛祖生冤家。悟道染泥土。无为无事人。声色如聋瞽。且道如何即是恁么也不得。不恁么也不得。恁么不恁么总不得。忽有个汉出来道。恁么也得。不恁么也得。恁么不恁么总得。则向伊道。我也知。儞向鬼窟里作活计</p><p>上堂云。先入白云门。次过白云浪。吞底栗蒲禅。吃底籼米饭。君子如到来。好好看方便</p><p>上堂。僧问。如何是道。师云。治平郡。学云。如何是道中人。师云。赤心为主。学云。未审道与道中人相去多少。师云。名传天下。乃举。僧问南泉。如何是道。泉云。<a href=\"/fjrw/hcrw/syfs/105216.html\" class=\"keylink\" target=\"_blank\">平常心是道</a>。又庞居士问马大师。不与万法为侣是什么人。大师云。待尔一口吸尽西江水即向尔道。师云。为复是同是别。同则神出鬼没。别则醉后添杯。毕竟如何。待尔念得熟。向尔道</p><p>上堂举。古人云。释迦弥勒犹是他奴。且道他是谁。便下座</p><p>上堂云。五千四十八卷。教理行果成见。祖师门下商量。须知一贵一贱。贵则珠玉难偕。贱则分文太远。有人于此辨得。白云与尔三十。忽有个汉出来道。大丈夫赏罚分明。不知是那个三十。良久云。三十年后</p><p>上堂云。三处移场定是非。顽心不改在家时。呼兄唤弟长如此。且作隈[卄/崔]老古锥</p><p>陈助教入山煎茶。上堂云。<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>相扶。堂堂大丈夫。吹毛光灿烂。佛祖不同途</p><p>谢典座上堂云。白云嵌枯老汉要吃无皮酸饀。典座取巧安排。一任众人[口*(一/巾)]啖。良久云。羊羹虽美众口难调</p><p>上堂举。僧问马大师。离四句绝百非请师直指西来意。大师云。我今日劳倦。不能为汝说去。问取智藏。僧问智藏。藏云。我今日头痛。不能为尔说去。问取海兄。僧问海兄。海云我到者里却不会。僧却举似大师。大师云。藏头白海头黑。师云马大师无著惭惶处。只道得个藏头白海头黑。者僧将一担蒙[目*董]。换得个不会。若也眼似流星。多少人失钱遭罪</p><p>上堂云。庭开金菊宿根生。来雁新闻一两声。昨夜七峰牵老兴。千思万想到天明</p><p>冬日上堂云。达磨西来事久多变。后代儿孙门风无限。搅扰身心一团麻线。白云今日都通截断。大众。一百单五近清明。上元定是正月半</p><p>次日上堂云。一阳生后正严寒。皎洁蟾蜍挂碧天。冰锁瀑泉声细碎。风摇危木影挛拳。狂猿抱子藏深洞。羸鹤将鶵逐老仙。莫谓可师徒立雪。方知古德用心坚</p><p>上堂举。德山问龙潭。久向龙潭。及乎到来潭又不见龙又不现。潭云。子亲到龙潭。师云。龙潭老人。可谓骑贼马赶贼。便下座</p><p>送诸郡化主上堂云。荷众诸禅流。才能足机划。逢人定有钱。见面宁无麦。已是吾家儿。久为物外客。温柔一手擡。刚硬双拳搦。牙爪一时全。胜南山白额</p><p>上堂云。一代时教。五千四十八卷。空有顿渐。岂不是有。永嘉道。亦无人亦无佛。大千沙界海中沤。一切圣贤如电拂。岂不是无。大众若道是有。违他永嘉。若道是无。又违释迦老子。作么生商量得恰好。若知落处。朝见释迦暮参弥勒。若也未明。白云为儞点破。道无不是无。道有不是有。东望西耶尼。面南看北斗</p><p>上堂云。说佛说法拈槌竖拂。白云万里。德山入门便棒。临济入门便喝。白云万里。然后恁么也不得。不恁么也不得。恁么不恁么总不得也。则白云万里。忽有个出来道。长老尔恁么道也。则白云万里。者个说话。唤作矮子看戏。随人上下。三十年后一场好笑。且道笑个什么笑。白云万里</p><p>上堂云。白云门前路。往复行大步。中间有一片方塼。尔诸人为什么却蹋不着</p><p>王提刑入山上堂云。祖师门下如箭中的。手办眼亲无得无失。僧问朝盖临筵清风匝座。学人上来请师决破。师云残腊一雨即渐迎春。学云。天垂宝盖地布金莲去也。师云。未为多在。学云。多底事作么生。师云。人天众前不欲造次。学云。觉海波澜增浩渺。释天日月转光辉。师云。也不消得。乃举。阿难问<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>传金襕外。别传何物。迦叶召阿难。阿难应喏。迦叶云。倒却门前刹竿着。又永嘉道建法幢立宗旨。明明佛敕曹溪是。师云。迦叶教倒却刹竿。永嘉又教立宗旨。且道倒底是立底是。到者里须是具择法眼始得。毕竟如何。倒也七纵八横。立也二三成六。七峰阁上共谈玄。一句一言清耳目</p><p>归新僧堂上堂云。十月今朝初一。新构云堂已毕。圣众已得安居。雅丽全胜旧日。于中受用之时。凡百互相爱惜愿存古佛家风。三有四恩获益庆忏。别有上闻具位题名立石。敢劝远近诸檀越。记取摩诃般若波罗蜜。忽有个出来道。长老不妨好丈章。乃云咄。白云口里道。谁敢道不好</p><p>提刑入寺上堂云。兵随印转将逐符行。大权菩萨覆护众生。相顺者善言诱谕。凶顽者枷棒纵横。中间有个没量大汉。金锁玄关留不住。圣凡位里莫能收。若柰何不得。佛法无灵验。白云有个消息试说看。古人云。无边刹境自他不隔于毫端。十世古今始终不离于当念。纳须弥于芥中。掷大千于方外。变大地为黄金。搅长河为酥酪到者里合作么生。国土动摇迎势至。宝花弥满送观音</p><p>端午上堂。举昔有秀才造无鬼论。论就才放笔。有鬼现身。斫手谓秀才云尔争柰我何。白云当时若见。便以手作鹑鸠觜向伊道。谷谷孤</p><p>上堂举。肃宗帝问忠国师。百年后所须何物。国师云。与老僧造个无缝塔。帝曰。请师塔样。国师良久云。会么。帝曰不会。国师云。吾有<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>耽源。却谙此事。请诏问之。师云。众中尽道。国师良久。殊不知。悬鼓待槌。当时肃宗若是作家君王。待伊道教诏耽源。但向道国师国师。何必肃宗后诏耽源。源呈颂。湘之南潭之北。中有黄金充一国。无影树下合同船。琉璃殿上无知识。师代肃宗云。闲言语。雪窦颂道无缝塔见还难。澄潭不许苍龙盘。层落落影团团。千古万古与人看。师云。雪窦可使千古传名。老僧秖爱他道澄潭不许苍龙盘首尾一时贯串。秖如前来一络索拈放一边。且道毕竟如何。乃云。姹女已归霄汉去。呆郎犹自守空房</p><p>上堂举。僧问云门。如何是超佛越祖之谈。门云。糊饼。白云即不然。忽有人问。如何是超佛越祖之谈。只向伊道。驴屎似马粪。又云。破草鞋。又云。灵龟曳尾。且道是同是别试。辨看</p><p>上堂。僧问。如何是极则事。师云。何须特地。乃举。僧请益琅[王*耶]。清净本然云何忽生山河大地。琅[王*耶]云。清净本然云何忽生山河大地。其僧有省。师云。金屑虽贵落眼成翳</p><p>上堂云。祖师遗下一只履。千古万古播人耳。空自肩担跣足行。何曾踏着自家底</p><p>上堂云。<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>不报来打。鼓曲彔木头上不免将错就错参</p><p>上堂云。子丑寅卯辰巳午未申酉戌亥。终而复始。有厌有爱。毕竟如何但管熟念</p><p>上堂云。遍周沙界几曾移步。深山白云是何报土。若是真道人家。日洗钵盂两度</p><p>新鞔法鼓上堂云。多载顽皮击不响。新皮才动震天雷。无滞莫言随势去。有声谁谓不平来。何也。双眼听不闻。双耳觑不见。一条平坦路。是谁没方便</p><p>上堂云。本末须归宗。尊卑用其语。利剑掷虚空。大棒打老鼠</p><p>上堂举。世尊灭后。诸圣弟子于毕钵岩中结集法藏。阿难既升座。形仪与佛无殊。大众遂生三疑。一疑阿难成佛。二疑佛再现身。三疑他方佛化。阿难唱云。如是我闻。众疑皆息。当时若有个汉出众云。大众。依而行之。各自散去。免见满藏琅函搅人肠肚。然虽如是。犹未剿绝在。何也。阿难道如是我闻。白云也道如是我闻。若道当时是重古轻今。若道即今是重今轻古。要会么。优昙花不开。迹绝无香气</p><p>上堂云。六祖能大师。是个大痴汉后代儿孙多。展<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>惑乱。子细好思量。白云不着便</p><p>上堂。僧问。百尺竿头如何进步。师云。快走始得。乃举。云门道。闻声悟道见色明心。<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>将钱来买糊饼。放下手元来却是个馒头。云门好则甚好。奇则甚奇。要且只说得老婆禅。若是白云即不然。作么生是闻声悟道见色明心。遂举手作打杖鼓势云。[王*朋]八啰札</p><p>上堂云。四五百石麦。二三千石稻。好个休粮药。耆婆不得妙</p><p>上堂举。龙牙云天下名山到因脚。年深辛苦与[革*(卄/(ㄇ@人)/戊)]着。而今老大不能行。手里把柄破木杓。白云即不然。脚也不能着草鞋。手亦不能把木杓。端坐受供养。施主常安乐</p><p>上堂云。达磨西来事。今人谩揣量。天河争起浪。月桂不闻。香何。也见成公案</p><p>安乐院主修斋上堂云。昨夜得一梦。梦见臻公在天宫与帝释对坐。臻问帝释曰。天上有五衰相是否。释云。此是佛之所说。岂可妄言。于是帝释却问臻云。我闻阎浮提有不持戒者是否。臻云。此是佛之所说。岂可妄言。良久臻云。天宫虽乐不是久居。遂下十八重<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>乃见阎王居正殿与地藏菩萨耳语。臻便出门首。见一青衣童鞠躬云。东海龙王请伴诸罗汉斋。臻遂往赴斋。回得数颗如意珠。一时分付诸门人。白云被珠光一烁。忽然梦觉。以至今朝诸法乳为臻公设斋。请白云升座。大众且道。昨夜梦底是。适来说底是。众中尽是久参先德禅道之精。若人辨得试出来。露个消息看。有么有么。若无白云又有个古话。释迦老子在跋提河侧般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>了。迦叶始至绕金棺而哭。于是世尊为现双趺。大众且道。般涅槃时是。现双趺时是。乃云。止止不须说。我法妙难思。诸增上慢者。闻必不敬信</p><p>谢监收上堂云。人之性命事。第一须是○。欲得成此○。先须防于○。若是真○人。○○</p><p>上堂。僧问。不昧当机请师直道。师云。揑聚放开乃举。僧辞赵州。州云。有佛处不得住。师云。换却尔心肝五脏。无佛处急走过。师云。雁过留声三千里外逢人不得错举。师云。出门便错。僧云。恁么则不去也。师云。种粟却生豆州云。摘杨花摘杨花。师云。不觉日又夜。争教人少年</p><p>小参云。达磨西来不立文字。直指人心见性成佛。忽有个出来道。长老寻常室中爱问人如何是尔心。某甲即不会。却问长老。如何是和尚心。老僧即向他道。却来者里捋虎须。什么心造次说向尔。他若又问。柏树子话长老作么生会。向伊道。我有个方便有甚方便。却须先问取首座。又问德山入门便棒。作么生会。我闻便肉战。临济入门便喝。作么生会。是什么破草鞋。直饶一时透过。也是七九六十八</p><p>中秋上堂云。中秋月中秋月。古今尽谓寻常别。别不别。皎皎清光遍大千。任从天下纭纭说</p><p>上堂。僧问。一代时教是个切脚。未审切那个字。师云。钵啰穰。学云学人秖问一字。为什么却答许多。师云。七字八字。学云。也是惯得其便。师云。许多时茶饭。元来也有人知滋味。乃云。祖师心印好消息处。无消息无消息。古篆分明。拈起也大千岌崿。放下也凡圣同源。有时印却诸人面门。自是诸人甘伏。不肯承当。带累白云受屈。且道过在什么处</p><p>上堂。拈起拄杖子。者个拄杖子。不从天台南岳得。亦不在此土西天。且道生在什么处。若也知生处。同得受用。若也不知。遂靠却。下座上堂举。妙湛总持不动尊。首楞严王世希有。销我亿劫颠倒想。不历僧祇获法身。大众。若作禅会则谤经。若作经会则谤禅。若作一团则儱侗。有人跳得出。日销万两黄金。若跳不出。有处着儞在</p><p>上堂云。但知月圆月缺谁知月缺月圆。忙忙乘船过水。不知过水乘船。百年三万六千日。等闲老却朱颜。各自照镜看。是什么面孔</p><p>上堂举。僧问洞山。如何是善知识眼。山云。纸捻无油。若问白云。对道。无油不点灯。虽然如是。也较洞山三千里。秖是其间有个好处。有甚好处。诸人黑地里撞着。露柱悟去也不定</p><p>岁朝上堂云。威音王已前也恁么。威音王已后也。恁么。三世诸佛也恁么。西天四七唐土二三也恁么。前年去年也恁么。明年后年更后年外后年也恁么。忽有个出来道。和尚和尚。和尚自云。若不被他唤。住便一百年。也只恁么。复云。元正启祚万物咸新。去年乞火和烟得。今日担泉带月归。晷运推移日南长至。当轩有直道。无人肯驻脚。孟春犹寒。伏惟。首座大众。起居万福苏武牧羊海畔累日。忻然李陵望汉台边。终朝笑发落在甚处。仁义只从贫处断。世情偏向富门多</p><p>上堂。僧问。如何是本分事。师云。结舌无言。乃云。每日起来。拄却临济棒吹云门曲应赵州拍。担仰山锹驱沩山牛耕白云田。七八年来渐成家活。更告诸公。每人出一只手。共相扶助。唱归田乐。粗羹淡饭且恁么过。何也。但愿今年蚕麦熟罗睺罗儿与一文</p><p>上堂举南泉云。文殊普贤昨夜三更起佛见法见。各与二十棒。贬向二铁围山。白云则具大慈悲。遂拍手云。曼殊。室利普贤大士不审不审。今后更敢也。无自云。一度被蛇伤。怕见断井索</p><p>上堂云。狗子还有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>也无。也胜猫儿十万倍。下座</p><p>上堂举。雪峰问德山。从上诸圣以何法示人。山云。我宗无语句。亦无一法与人。雪峰从此有省。后有僧问雪峰。和尚见德山。得个什么便休去。雪峰云。我空手去空手归。白云今日说。向透未过者。有两个人从东京来。问伊。什么处来。他却道。苏州来。便问伊。苏州事如何。伊道。一切寻常。虽然如是。谩白云不过。何故只为语音各别。毕竟如何。苏州菱邵伯藕</p><p>上堂云。二十五年坐这曲彔木头上。举古举今则不无。秖是未曾道着第一句。众中莫有具。大慈悲者。试出来道看。也要众人共知。兼乃平生行脚。有么有么。莫道无。忽有个出来却问。如何是第一句。白云不免向他道。放么作么</p><p>上堂云。难难几何般。易易没巴鼻。好好催人老。默默从此得。过这四重关了。泗洲人见大。圣参</p><p>上堂云。是法不可示。言词相寂灭。这两句犹较些子。忽遇羚羊挂角时如。何直上指。云天天久立</p><p>上堂。僧问如何是佛。师云。口是祸门。乃云。今日上元之节。处处灯光皎洁。不知天意如何。瑞雪翻为苦雪。贫穷变作僵蚕。乌龟冻得成鳖。唯有四海禅流。个个眼中添屑。何故不说不说。下座</p><p>请化主上堂云。造化之功。祖宗门下。作天地发生之气。春夏秋冬。决含灵颠倒之心。常乐我净。若据衲僧用处。又且不然。变大地为黄金。搅长河为酥酪。犹未称白云在。忽有个汉出来道。似恁说话。只是个贪心不足汉。自云道着。参</p><p>上堂举。达磨大师云谁得吾正宗。出来与汝证明。尼总持云。据某见处。如庆喜见阿閦佛国。一见更不再见。达磨云。汝得吾皮。道育云。据某见处。实无一法当情。磨云。汝得吾肉。二祖礼三拜依位而立。磨云。汝得吾髓。师云。当时若见他三人恁么道。各人好与三十棒。只如白云。今日也合吃二十九棒。留一棒与汝诸人。其间若有知痛痒者。不辜负先圣。亦乃得见白云。其或未知。堂里吃粥吃饭。更须烂嚼多见。是浑囵吞却</p><p>上堂举。释迦如来往忉利天为母说法。优填王思佛命匠人雕栴檀像。及至世尊下来。像亦出迎。诸人且道。下来底是。出迎底是。又教中道。如来者无所从来亦无所去。莫是法身无来去。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>有来去么。若人于此见得。日销万两黄金。其或未然。草鞋钱教什么人还</p><p>上堂云。说禅被禅缠。不说却成现。若真个不说。真个好方便。如马前相扑。似霹雳闪电。会即大富贵。不会空对面</p><p>因斋上堂云。不寒不暖喜春游。士女倾心结预修。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>一生如幻梦。始知百岁类浮沤。子规啼处真消息。芍药开时野兴幽。此个门风谁会得。等闲白却少年头</p><p>上堂云。前回底今日使不着。今日底后次使不着。使不着说不着重遭扑。自古至如今。谁错谁不错。忽有个出来道。白云不是今日错也。自云错错。下座</p><p>师一日持锡绕方丈行问僧。还有属牛人问命么。无对。遂云。孙膑今日开铺。并无一人垂顾。可惜三尺龙须。唤作寻常破布</p><p>上堂云。有一则奇特因缘。举似诸人。欲说又被说碍。不说又被不说碍。欲举山河大地又被山河大地碍。从教头上且安头。真金不博鍮。丈夫意如此。快乐百无忧</p><p>上堂举。僧问曹山。佛未出世时如何。山云。曹山不如。出世后如何。山云。不如曹山。师云。若以世谛观之。曹山合吃二十棒。若以祖道观之。白云合吃二十棒。然虽如是。棒头有眼。两人中一人全肯一人全不肯。若人点检得出。许儞具半只眼</p><p>上堂云。尔等诸人。见老和尚鼓动唇吻竖起拂子。便作胜解。及乎山禽聚集牛动尾巴。却将作等闲。殊</p></div>"
}]