[{
    "title": "肇论疏 第1859部",
    "author": "元康法师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>肇论疏 卷上</p><p>序</p><p>释元康撰</p><p>肇论序小招提达法师作者 就此一论。文有二章。前序文。后论本。今言肇论序者。后秦姚兴时。长安释僧肇法师。作宗本不迁等论。从人立名。故云肇论。叙述肇法师所作论意。故名为序。尔雅云。东西墙谓之序。郭象注云。所以序别内外也。今达法师叙述论意。以为论之由渐。如东西墙为舍宅之序。故名为序。而言小招提达法师作者。闰州江宁县。旧是丹阳郡。始自吴朝。爰及宋齐梁陈六代以来。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>兴盛。伽蓝精舍接栋连甍。名字相参。往往而有。即如<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>寺。则有大庄严妙庄严。招提寺则有大招提小招提也。大招提是梁时造。小招提是晋时造。慧达法师是陈时人。小招提寺僧也。当陈时名达之者。非止一人。故标其寺。以为别也。有本直云小招提撰。撰者撰集。非是制作。应言作。不应言撰也。直言小招提不言名者。江左敬法师。不呼其名。故但标其寺耳。然此法师。未善文体。所作论序。多有庸音。直以叙述论宗。不无伦次。贵其雅意。如后释之。所望通人幸无讥诮也</p><p>慧达率愚下 就此序中。开为两段。前且明作之元由。后正序肇论之宗旨。就前文中开为六段。第一标举论名。第二称美人法。第三庆幸逢遇。第四非斥讥嫌。第五申述元情。第六宣明序意。今言率者。尔雅云。率劝也。慧达者名也。长安者。秦家本都咸阳。汉家移都长安。长安是秦时乡名。即以本为名。名长安县也。释僧肇法师者。梁朝会稽嘉祥寺皎法师撰高僧传云。释僧肇京兆人。家贫以佣书为业。遂因缮写。历观经史。备尽坟籍。深好玄微。每以老庄为心要。尝读老子<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>章叹曰。美则美矣。然期神冥累之方。犹未尽也。后见古维摩经。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>顶戴<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。披习玩味。乃言始知所归矣。因此<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>学道。善解方等。兼通<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。及在冠年而名振关辅。时竞举之徒。莫不猜其早达。咸千里负粮。入关抗辨。肇既才思幽玄。又善谈说。承机挫锐。曾不留滞。时京中宿儒。及关外英彦。莫不抱其鉾辨负气摧衂。后罗什至姑臧。肇自远从之。什嗟赏无极。及什适长安。肇亦随还。姚兴命肇僧睿等。入逍遥园。详定经论。肇以去<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>久远。文义舛杂。先旧所解时有乖谬。乃见什咨禀。所悟更多。因着宗本义。物不迁论。不真空论。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>无知论。竟以呈什。什读之称善。乃谓肇曰。吾解不谢。子辞当相抱。时庐山刘遗民。见肇此论叹曰。不意方袍复有平仲。因以呈远公。远乃抚机叹曰。未尝有也。因共披寻玩味。更存往复。及什亡后。追悼永往。翘思弥励。乃着<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>无名论。以上秦主姚兴。兴答旨殷勤。备加赞述。即敕令缮写。班诸子侄。其为时所重如此。晋义熙十年。卒于长安。春秋三十有一矣</p><p>但末世弘经允属四依菩萨下 第二称美人法也。人则肇法师。法则所作论。允者信也。嘱者属也。此字音有二音二义。二音者。一之欲反。二是时欲反。今取前音也。二义者。一是对属义。二是眷属义。今是前义也。尔雅云。属着也。亦可通后义也。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>四依品。明四依菩萨出世护持<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。具<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>性。能持禁戒。是名第一人。须陀洹人斯陀含人。是名第二。阿那含人。是名第三。阿罗汉人。是名第四。言西国弘经属在四依。则马鸣龙树之流是也。爰传兹土抑亦其例者。爰于也。尔雅云。爰易也。抑按也。谓此土弘经之人。亦按四依之例。则安远生肇是也。至如弥天大德童寿桑门者。高僧传云。释道安。至习凿齿造谒。既坐。自云四海习凿齿。安应声答云。弥天释道安。时人以为名答。今言弥天大德。即安法师也。高僧传云。罗什法师。本名鸠摩罗耆婆。此云童寿。以其善解文什。故云罗什。今言童寿。即什法师也。桑门者。古人译经名为桑门。近云<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。皆是<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>轻重之异。此云寂志也。并创始命宗图辨格致者。创初也。命告也。宗尊也。图度也。格量也。致理致也。如安法师立义。以性空为宗。作性空论。什法师立义。以实相为宗。作实相论。是谓命宗也。图度辨才格量理致也。播扬宣述所事玄虚者。播布也。宣布佛教。唯以虚玄为事耳。唯斯拟圣默之所祖者。思益经云。汝等<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。集会当行二事。若圣<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。若圣默然。今言唯安什二法师。所作轨仪。圣默之宗祖也。自降乎以还下。应云降斯已还。而言降乎。非文体也。凡着若僧传者。谓显著在传也。至能正辨方言节文阶级者。谓能分别方俗之言。节量经文阶级次第也。善核名教精搜义理者。核训实。搜训索。谓能研核名教之异同。搜求义理之差当也。揖此群贤语之所统者。揖训敬也。推敬前人为圣说法之所统者也。有美若人超语兼默者。毛诗云。有美一人清扬婉兮。邂逅相遇适我愿兮。<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>云。君子哉若人。今合此语。共成一句。而言超语兼默者。超语兼超默。此言超者。谓前安什二师。唯得理而文有所阙。睿师谢公唯得文而理有所阙。今肇法师文理兼备。故名为超。非谓肇法师文。胜睿师及谢公。理胜什师及安公也。何者。论文自云。性空者诸法实相也。见法实相故为正观。若其异者。便为耶观。安法师作性空论。什法师作实相论。皆究尽玄宗。何由可胜。睿法师作大智度论序云。夫万有本于生生。而生生者无生。变化肇于物始。而始始者无始。然则无生无始者。物之性也。生始不动于性。而万有陈于外。悔吝生于内者。其唯邪思乎。正觉有以见邪思之自起。故阿含为之作。知滞有之由惑。故般若为之鉴。然鉴本希夷。津涯浩汗。理超文表。趣绝思境。以言求之则乖其深。以智测之则失其旨。二乘所以颠沛于三藏。新学所以曝鳃于龙门者。岂不然乎。谢灵运文章秀发。超迈古今。如涅槃元来质朴本言。手把脚蹈得到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。谢公改云运手动足截流而度。又如作诗云。白云抱幽石。碧篠媚清涟。又云日相晖映。空水共澄鲜。此复何由可及。直以肇师兼文兼理。故名胜耳。有人云。肇法师语。超睿公谢公。故云超语。默同安公什公。亦可然也。标本则句句深达<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。明末则言言备通众教者。本谓宗本义。末谓涅槃论也。谅是大乘懿典方等博书者。谅信也。小雅懿深也。谓此论是深典博大之书耳。自古自今著文着笔者。此应言自古及今。不应言自今。而今云尔者。欲对下著文着笔故也。文家以有韵为文。无韵为笔。刘氏文心调龙非此语云。孔子曰。文王既没。文不在兹乎。可有韵乎。固不然也。详汰名贤所作诸论者。此言支法详。作实相论。有二家。一者是什法师作。今无此本。二者是支法详问。释慧仪答。此乃是慧仪法师作。非支法详作也。或六家七宗爰延十二者。江南本皆云六宗七宗。今寻记传。是六家七宗也。梁朝释宝唱作续法论一百六十卷云。宋庄严寺释昙济。作六家七宗论。论有六家。分成七宗。第一本无宗。第二本无异宗。第三即色宗。第四识含宗。第五幻化宗。第六心无宗。第七缘会宗。本有六家。第一家分为二宗。故成七宗也。言十二者。续法论文云。下定林寺释僧镜作实相六家论。先设客问二谛一体。然后引六家义答之。第一家以理实无有为空。凡夫谓有为有。空则<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。有则俗谛。第二家以色性是空为空。色体是有为有。第三家以离缘<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>为空。合缘有心为有。第四家以心从缘生为空。离缘别有心体为有。第五家以邪见所计心空为空。不空<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所生之心为有。第六家以色色所依之物实空为空。世流布中假名为有。前有六家。后有六家。合为十二家也。故曰爰延十二也。并判其臧否辨其差当。臧否差当即是非也。前六家论中。判第四家为臧。余五家为否。后六家论中。辨前五家为差。后一家为当也。唯此宪章无弊斯咎者。宪法也。十二家皆有是非之弊。今肇法师所作无有此弊。但是而无非也。良犹襟情泛若不知何系者。良信也。襟是胸襟。情是性。泛然无所系滞也。若是不计义。<a href=\"/ctwh/jing/13j/zhouyi.html\" class=\"keylink\" target=\"_blank\">周易</a>云。出涕沱若。沟者不计若寄。以其无有别义故。不计之耳。匹彼渊海数越九流者。渊海广博。越九流之数。肇法师襟怀广博。越详汰诸人也。渊海者。小雅深也。九流者。江有九江。河有九河。皆是九流也。九江者。寻阳记云。一者乌江。二者蜂江。三者乌土江。四者嘉靡江。五者畎江。六者污江。七者禀江。八者提江。九者菌江。九河。尔雅云。一者徒骇河。二者大史河。三者马颊河。四者覆辅河。五者胡苏河。六者简河。七者洁河。八者钩盘河。九者鬲津河也。挺拔清虚萧然物外者。挺出也。萧然谓萧条然也。肇法师才思挺出。清雅虚通。萧然在物之外也。知公者希归公采什者。知肇公之者希。归向肇公者。则收采其文什也。如曰不知则公贵矣者。曰者语端。老子云。知我者希则我贵矣。今用此语也。有人云。如日月日用而不知者。殊非理也</p><p>达猥生天幸下 第三庆幸逢遇也。猥众也。谓多生有幸。幸者宠者也。而言天幸者。天宠也。亦可凡言天者自然。今言天幸。自然有幸也。世说注云。张敏字子羽。与张华同时。而不得官。乃作头贵子羽文云。公受性拘系。不闲礼仪。误以天幸为子所寄。言天幸用此语也。有人将幸字属下句。殊为可哂也。忻跃不已向宴忘疲者。忻喜踊跃不知止也。歆向饮宴无疲倦也。然此响字合乡下作食。今多作向。亦可然。有本作音非也。每至披寻不胜手舞者。子夏诗序云。不知手之舞之足之蹈之。今用此语。意云欢喜也。况中百门观爰洎方等深经者。小雅云。暨及也。<a href=\"/ctwh/jing/13j/cqzz.html\" class=\"keylink\" target=\"_blank\">左传</a>云。暨至。或作洎字。义亦同也。十二门论。名为门观。睿师中论序云。百论治外以闲邪。斯文祛内以流滞。大智释论之渊博。十二门观之精诣也</p><p>世[口*(產-文+(立-一))]咸云下 第四非斥讥嫌也。传云。谓彦彦字言边作彦。今口边作彦。俗中字也。肇之所作故是成实真谛地论通宗者。成实论宗有真谛义。十地论宗有通宗义。谓肇师所明之理。犹是彼二论中之义也。庄老所资孟浪之说者。谓肇法师用庄老言资此论。为孟浪之说。孟者大也。浪者流浪也。此实巨蛊之言欺诬已没者。蛊是蛊毒。书云。以物病人为蛊。即如汉家巫蛊事也。没终也。小雅作殁。今作没也。见肇师亡没。作此欺凌诬罔。肇法师假庄老之言。以宜正道。岂即用庄老为法乎。必不然也。街巷陋音未之足拾者。此是街巷鄙陋之言。不可收采也</p><p>夫神道不形心敏难绘者 第五述元情也。述肇法师之元意。明不同庄老也。神道谓神妙之道。即佛道也。敏疾也。绘论语云。绘画也。既文约义远众端所说者。今谓作论。文有限局。理致弘远。不假庄老众端之言。无由宣畅玄理也。有本云说。有本云诡。诡变也。肇之卜意岂图然哉。肇法师卜措怀抱。岂自无理。以庄老之理。为佛理乎。信有所以也。如复殉狎其言愿生生不面者。殉字合立人边作旬。以身从物。谓之恂。今作殉者。则是送死。谓之殉也。狎习也合也。意若复有人。殉狎此言者。我即愿生生不与此人面对也。至获忍心还度斯下者。得无生忍。方还度此下品人耳</p><p>达留连讲肆二十余年下 第六宣明序意也。留连谓不离也。讲肆谓讲席也。说文云讲习也。左传云讲谋也。<a href=\"/ctwh/jing/13j/zhouli.html\" class=\"keylink\" target=\"_blank\">周礼</a>云。司市常以陈肆辨物。此谓陈设物产为肆耳。令谓讲说之处。陈设几席。事如肆也。自讲已来二十年也。亦可听讲以来二十年也。颇逢重席末观斯论者。颇亦曾逢重席。末后方见此论耳。重席者。汉帝令诸儒讲论。胜者夺劣者席。戴凭独坐五十重席。时人曰。说经不穷戴侍中也。聊寄一序托悟在中者。寄托悟怀在序内也。同我贤余请俟来哲者。俟待也。同于我者。贤于余者。待后明哲也</p><p>夫大分深义厥号本无下 第二正序论之宗旨也。文中有四。第一序次第。第二遣相。第三称叹。第四简别。今初言大分深义者。此语出十二门论也。彼论云。大分深义所谓空也。若通达是义。则达大乘。具足<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。无所障碍。今以本无是空义故。发首言之。此谓宗本义也。而言大分者。大分为言也。厥者其也。故建言宗旨标乎实相者。实相即本无之别名。以本无是深义故。建初言本无实相等也。开空法道莫逾真俗者。逾越也。涅槃经云。雪山菩萨。闻说半偈。上树舍身。以报偈价。树神问言。如是偈者。何所利益。菩萨答言。如是偈者。诸佛所说。开空法道。我为此法。弃舍身命。今不迁不真两论。能开空法之道也。不真明真谛也。不迁明俗谛也。所以次释二谛显佛教门者。真俗二谛佛教要门。以此故次宗本而释二谛耳。但圆正之因无上般若者。此谓般若无知论也。涅槃正因无有尚于般若者也。至极之果唯有涅槃耳。般若极果。唯有涅槃之法也。故末启重玄者。以此<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。更无加上。故末后明此两重玄法。般若为一玄。涅槃为一玄也。前言真俗。指前两论。后言重玄。指后两论。此是必然。不劳别释。重玄者。老子云。玄之又玄。众妙之门。今借此语。以目涅槃般若。谓一切圣人。皆住于此。故名为宅也</p><p>虽以性空拟本无本可称下 第二遣相也。语本绝言非心行处者。言本则是绝言之处。故非心所能行也。然不迁当俗俗则不生者。道不迁则是不生也。不真为真真但名说者。道不真为真。但是假名说耳。若能放旷荡然崇兹一道者。指前宗本论也。荡大也。谓宽旷无所拘碍也。一道语出涅槃经。彼第十二卷云。实谛者。一道清净。无有二也。清耳虚襟无言二谛者。指前不迁不真二论也。清耳谓静听也。虚襟忘怀也。无言谓得意也。二谛谓真俗也。斯则静照之巧着故般若无知者。着显也。能如此静照。即是般若无知义也。无名之德兴而涅槃不称者。兴起也。若能静照知法不可名。即是涅槃无名之义也</p><p>余谓此说周圆罄佛渊海下 第三称叹也。罄尽也。如覆罄更无有物也。渊深。浩博无涯穷法体相者。浩汗广博无涯岸。穷尽诸法实相体也。虽复言约而义丰文华而理诣者。约少丰多也。易云丰大也。毛诗传云。丰茂也。诣进也。出小雅。彼文云。造奏诣进也。语势连环意实孤诞者。连环不绝也。孤诞生也。毛诗云。诞阔也。尔雅云。诞大也。敢是绝妙好辞莫不竭兹洪论者。汉时会稽人曾肝。能抚节安歌。度浙江溺死。肝女曹娥。年十二。求肝尸不得。自投浙江而死。经宿抱父尸而出。度尚为作碑。置于会稽上虞山。汉末议郎蔡邕。夜至碑所求火不得。以手摸之而读。叹其能文。乃[鎨-十+乃]碑背。作八字云。黄绢幼妇外孙齑臼。后曹操共扬修。读此语。问修解不。答云解。操令修勿语。待吾思之。行三十里方解。乃嗟曰。有智无智校三十里。后乃杀修。操诸子皆救。操曰。此人中之龙。恐非汝力之所驾驭。遂杀之。黄绢者。丝边着色。此是绝字。幼妇少女也。女边着少。妙字也。外孙女子也。女边着子。此是好字也。齑臼者受辛也。受边着辛。此是辞字也。今谓绝妙好辞。竭尽此论之中也。洪者大也。所以童寿叹言下。此语出名僧传。慧观传中也。明什法师作此语。非无所以也。彰在翰牍者。肇法师文理彰显。在翰牍也。古人以鸡翰毛书简牍之上。今名纸为牍也</p><p>但宗本萧然下 第四简别是论非论也。宗本萧然。不可致难。故但称义。不迁等四。欲接引学人。假致问答。故称为论。有本云开通。有本云关涉。小雅云。开达也。问答折征所以称论者。论本折理。四科折理。故名为论耳</p><p>宗本义</p><p>宗者宗祖。本名根本。肇法师以本无实相等。是诸经论之宗本。今明此义。故云宗本义也。亦可以此少文。为下四论之宗本。故云宗本义也。今依后释。此文为二别。宗本一义。是谓标宗。不迁已下四论。是谓明教也</p><p>本无实相法性性空缘会一义耳者 论文有四。第一明本无实相宗。第二明非有非无宗。第三明沤和般若宗。第四明泥洹尽谛宗。第一明本无实相宗。为物不迁论之宗本。第二明非有非无宗。为不真空论之宗本。第三明沤和般若宗。为般若无知论之宗本。第四明泥洹尽谛宗。为涅槃无名论之宗本。今云本无等者。有人云。会释五家义也。竺法汰作本无论。什法师作实相论。远法师作法性论。安法师作性空论。于道邃作缘会二谛论。今会此五家。故云一义耳。此非释也。何者。若今会竺法汰本无论者。何故不真空论初。弹本无义耶。又且远法师作法性论。自问云。性空是法性乎。答曰非。性空者即所空而为名。法性是法真性。非空名也。今何得会为一耶。复有人言。支法详作实相论。今会此论。此释弥复不然。支法详不见什法师。承来至关中乃作书。问什法师门人释慧仪实相义。慧仪报答。名此为实相论。此并是肇法师同时人。才学又在肇法师下。宁肯会释此人所作论耶。必不然也。今直云此五家是经论中大义。有人谓同。有人谓异。肇法师今会之为一。不言异也。又本无等四为真。缘会为俗。今会此真俗二谛不异也。言本无者。如维摩经云。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无造无受者。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之业亦不忘。此本无义也。仁王经云。有本自无因缘成法。此亦本无义也。中论云。若使无有有。云何当有无。有无既已无。知有无者谁。又云诸法不可得。灭一切戏论。无人亦无处。佛亦无所说。此亦本无义也。言实相者。如维摩经云。如自观身实相。观佛亦然。我观如来。前际不来。后际不去。今则不住。不观色。不观色如。不观色性。此实相义也。中论云。诸法实相者。心行言语断。无生又无灭。寂灭如涅槃。此亦实相义也。言法性者。如大品经云。法性法住法位实际。有佛无<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>性相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。此法性义也。胜天王般若第三卷。有法性品。广明法性不可思议。此性即诸佛法本。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a><a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>因之而生也。中论云。如来所有性。即是<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>性。如来无有性。世间亦无性。此亦法性义也。言性空者。如涅槃经云。一切诸法性本自空。亦因菩萨修空故空。此性空义也。中论云。如是性空中。思惟亦不可。如来灭度后。分别于有无。此亦性空义也。言缘会者。维摩经云。说法不有亦不无。以因缘故诸法生。此缘会义也。中论云。未曾有一法。不从因缘生。是故一切法。无不是空者。此亦缘会义也。如此五义。经论大宗。以理会之。一而无异。故云一义耳。又涅槃及仁王经。皆明二谛一体。今明此五义唯是二谛。然此二谛一体无别。故云一义。虽有两释。前为正释也。何则下。此论凡云何。则是假问之辞也。一切诸法缘会而生者。前标列其义。先标本无。今会释五义。先论缘会。逐便故也。性常自空故谓之性空者。此有三读。一者性常自空故。谓之性空为句也。二者性常自空故。谓之性空法性为句也。三者性常自空故。谓之性空法性实相为句也。三读之中前为胜。今依前读。即以性常自空名为性空也。法性如是故曰实相者。性空即是法性。此性即是实相也。实相自无非推之使无者。诸法自无名为实相。非是推遣令无也</p><p>言不有不无者下 第二明非有非无宗。为不真空论之宗本也。言者谓经论所言也。大品经云。色非空非不空。受想行识非空非不空。涅槃经云。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>非真如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。非无如兔角。中论云。定有则着常。定无则着断。是故有智者。不应著有无。今通释经论此语。所言不有者。不如有见常见之有。而言不无者。不如邪见断见无。故云尔耳。有见者。谓有所得见也。邪见者。谓无所得见也。常见者犹是有见。断见者犹是邪见也。又有见者谓有我见也。常见者谓身是常也。邪见者谓无我见也。断见者谓身是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>也。中论云。我于过去世。为有为是无。世间常等见。皆依过去世。我于未来世。为作为不作。有边等诸见。皆依未来世也。亦可此中通以计万法定有为有。定无为无。有则是常。无则为断也。若以有为有则以无为无者。有若定是有。无则定是无也。有既不有。则无无也。有本有重无字。有本但有一无字。若有两无字。则此句已足。言有既非有。言无亦非无也。若唯有一无字。则此句遣有。后方始遣无。今以重无字为正也。夫不存无以观法者下。前既双遣有无。今更覆疏两义。今此句覆疏无无句也。是为虽观有而无所取相者。此句覆疏无有句也。不存无以观法。则无非无也。观有而不取相。则有非有也。非有非无是为中道矣。然则<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>为<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>之相者。此谓实相法也。无有法相。名为无相。以此无相为相故。名实相也。圣人之心为住无所住者。此谓般若也。安住无为。名之为住。住无所住故。名无住也。三乘等观性空而得道者。前云有既不有。无亦不无。皆是性空之妙理。三乘圣人。同观此理。而后成道也。涅槃经云。观<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>智慧。凡有四种。一者下。二者中。三者上。四者上上。下智声闻。中智缘觉。上智菩萨。上上智是佛。开佛及菩萨。故有四种。合佛及菩萨。则有三种。然此三人。同观因缘性空。故得成三乘<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>也。金刚般若经云。一切贤圣。皆以<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。而有差别。此之谓矣。性空者诸法实相者。诸法性空。此是真实之理。故名实相也。见法实相故为正观下。见空为正。见有为邪也。设二乘不见此理则颠倒者。有本作故字非也。设谓假设。假令二乘不见性空。则是颠倒。而今见空故。非颠倒也。是以三乘观法无异下。既云非倒。而有三乘之异者。为心有大小。智有浅深故也</p><p>沤和般若下 第三明沤和般若宗。为般若无知论之宗本也。具足梵音。应言沤和俱舍罗般若波罗蜜。沤和俱舍罗。此云方便。般若波罗蜜。此云智慧。方便者权智也。智慧者实智也。大品经九十品。<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>以方便已前明般若道。方便品已后明沤和道。维摩经云。有慧方便解。无慧方便缚。有方便慧解。无方便慧缚。今合明此二。只是大智之名也。诸法实相谓之般若者。观实相智。是谓般若也。能不取证沤和功也者。形现也。声闻观空即现取证。菩萨观空能不现证。所以然者。此理深妙。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>不解。菩萨起大悲之心。愿在<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。为说此法。令一切有心。皆得悟解。此即是菩萨善权方便之力也。故云沤和功也。适化众生谓之沤和者。适往也。菩萨往入生死。教化众生令悟性空。此是善权方便之智也。不染尘累般若力也者。凡夫涉有。多生染着。菩萨涉有。知有法皆空。所以于色于声而无染着。此是实智见空之力。故云般若力也。然则般若之门观空沤和之门涉有者。观空是实智也。涉有是权智也。涉有未始迷空故常处有而不染下。覆疏前两义也。未始者初未曾也。菩萨涉有未曾迷空。以常知法是空。故能处在生死。不生染着。释前不染尘累般若力也。不厌有而观空故观空而不证者。菩萨涉有不生疲厌。而能观空也。对前言涉有不迷空。此言观空不厌有也。以观空不厌有。所以观空不即取证也。是为一念之力权慧具矣者。涉有不迷空。权中有实。观空不厌有。则实中有权。初言一念之力权慧具者。则是权中有实也。后言一念之力权慧具者。则是实中有权也。好思下。审思则见也</p><p>泥洹尽谛者直结尽而已下 第四明泥洹尽谛宗。为涅槃无名论之宗本也。尽谛即灭谛。<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>之中涅槃即第三谛也。涅槃经第二十三卷云。善男子。涅槃之体。无有住处。真是诸佛断烦恼处。故名涅槃。今取此语。明涅槃之宗本也。无复别有一尽处者。尽本尽于结。结尽无别尽。如此无别尽。是谓常乐我净大涅槃也</p><p>物不迁论</p><p>此下四论第二章明教也。四论四章。即明四教。第一物不迁论。明有申俗谛教。第二不真空论。明空申真谛教。第三般若论。明因申般若教。第四涅槃论。明果申涅槃教。明此四法。申彼四教。释迦一化理斯尽矣。今言物不迁论者。<a href=\"/ctwh/zi/djjd/zhuangzi.html\" class=\"keylink\" target=\"_blank\">庄子</a>外篇达生章云。凡有貌像声色者皆物也。公孙龙子名实论云。天与地其所产焉物也。毛长诗传云。迁徙也。人谓物皆迁徙。变易无常。今明物本不迁。当世各有言。虽反常义仍合道。故云物不迁论也</p><p>夫生死交谢寒暑递迁有物流动人之常情也下 论文有二。前序。后正。今初序文。目为四段。第一叙常情。第二明真解。第三述异同。第四申论意。今初。有本云生死。有本云生灭。俱得。今用生死也。有本云迭迁。有本递迁。俱得。今用迭迁也。小雅云。迭递交更也。今明迭迁。更相迁易也。生死者。非直谓人身死此生彼。通谓一切万物生死变化也。如涅槃经云。一切诸世间。生者皆归死。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>虽无量。要必有终尽。既从生至死。亦从死至生。生死回还。终始无际。是谓交谢。谢往也。易云。暑往而寒来。寒往而暑来。又云。鼓之以雷霆。润之以风雨。日月运行。一寒一暑。是谓迭迁也。即以生死寒暑。名之为有。名之为物。皆有迁谢移易。故云流动。流如水流。动如风动。此是常情所解也。常者寻常也。小雅云。四尺谓之仞。倍仞谓之寻。寻者舒两臂也。倍寻谓之常也</p><p>余则谓之不然下 第二明真解也。余我也。谓言也。不如前解。故曰不然也。何者放光云法无去来无动转者。竺法护前翻大品。名曰放光。以此经初广明如来放光等事。即以为名也。彼经既云法无去来。何有生死交谢。复云无动转者。何有寒暑迭迁耶。亦可通说。未必须配也。亦可何者字。是肇法师语。非经文也。寻夫不动之作岂释动以求静。释者舍离。寻放光经作不动之语者。非谓舍动而别论静。即求静于动法之中。即动而为静耳。言岂释者不释也。必求静于诸动下。覆上意可见也</p><p>然则动静未始异而惑者不同下 第三述异同也。动静理虽不殊。而迷惑之人谓异也。缘使<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>滞于竞辨宗途屈于好异者。真言谓佛教也。竞辨谓异说也。宗途谓法理也。好异谓异解也。所以静躁之极未易言也者。谓静躁两间难辨也。又释静躁不二。是静躁之极。欲说此理。未易可论也。何者夫谈真则逆俗顺俗则违真者。俗人谓异。言不异者。则逆俗人也。真理是一。言不一者。则违真理也。此言真者。谓理实如此。故名为真。未必即为真谛也。如云真书真宝。可即是真谛乎。固不然也。有人执此语。非前序中不迁当俗谛。此非得意之言也。违真故迷性而莫返逆俗故言谈而无味者。违真理则迷法性。不能自返也。亦可情迷不能自返悟也。逆俗人则语薄淡无滋味也。老子云。乐与饵过容上道之出口淡乎其无味。今借此语。以饰论文也。如来说法。皆依二谛。言则顺俗。理则明真。且秦人好文。译经者言参经史。晋朝尚理。作论者辞涉老庄。言参经史。不可谓佛与丘且同风。辞涉老庄。不可谓法与聃周齐致。肇法师一时挺秀。千载孤标。上智贵其高明。下愚讥其混杂。是谓资宋章而适越。露形之俗见嗤。抱荆玉而归楚。无目之徒致哂。信可悲也。深可叹哉。近有无识之徒。自相朋附。或身参法侣。翻谤大乘。或形厕俗流。反宗小教。上诽高德。苟布负俗之名。下赞庸流。将谓契真之实。自忘颜厚。岂识羞惭。经云。譬如痴贼弃舍金宝。担负瓦砾。此之谓矣。然信毁祸福。素有诚言。及至<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>。果招其咎。舌出长余一尺。气奔经乎数晨。既出牛声。不知豹变。无间极苦。夫复何疑。后之学者。幸知前事也。缘使中人未分于存亡下士抚掌而不顾者。老子云。上士闻道勤而行之。中士闻道若存若亡。下士闻道大笑之。不笑不足以为道。今借此语也。中人闻此动静不二。未能决定。或信或疑。故云未分于存亡。下人闻此决定不信。故云抚掌而弗顾。抚掌拍手也。弗顾不视也。近而不可知者其唯物性乎者。动静不二。物之性也。近对目前而人不觉。今伤叹之。故云尔也</p><p>然不能自已下 第四申论意也。已止也。岂曰必然者。未必然也</p><p>道行云诸法本无所从来去亦无所至下 第二正是论文也。文有六章。第一引经明不迁。第二指物明不迁。第三遣惑明不迁。第四会教明不迁。第五反常明不迁。第六结会明不迁。今初。引一经一论。以标于指归。明不迁之宗本也。道<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。小品般若也。睿法师小品序云。章虽三十。贯之者道。言虽十万。佩之者行。行凝然后无生。道足然后补处也。<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>者。中论一名中观论。以此论中明观因缘等法故也。然彼论中。无有此语。应是取去来品意耳。去来品云。已去无有去。未去亦无去。离已去未去。去时亦无去。今取此意。故云去者不至方也。斯皆即动而求静以知物不迁明矣者。经云无来无去。论云无去。此之二文。皆是即去明无去。非谓离去有无去。即去无去。是谓不迁之义。一论之旨归也</p><p>去人之所谓动者下 第二指物明不迁也。人以昔物去今。故名为动。我以昔物在昔。故名为静。动而非静以其不来静而非动以其不去者。余本皆云静而非动以其不来。动而非静以其不去。句上可释。下句难解。今勘古本如前说也。动而非静以其不来者。此覆人之所谓动句也。静而非动以其不去者。此覆我之所谓静句也。人以昔物去今而往昔。故曰动而非静。我以昔物在昔而不去。故曰静而非动也。然则所造未尝异下。广雅云。造诣也。尔雅云。造适也。尝有两义。一者曾义。二者常义。庄子云。夫言非吹也。言者有言。其所言者。特未定也。果有言耶。其未尝有言耶。此是曾义。又云。仲尼语颜回曰。若必有以也。尝以语我来。此是常义也。目所造诣未尝有异。而心眼所见未曾有同也。逆之所谓塞顺之所谓通者。逆理则塞。顺理则通。逆理谓人也。顺理谓已也。苟得其道复何滞哉者。苟且也。且得其道理。则动静不二。更无疑滞也</p><p>伤夫人情之惑久矣下 第三遣惑明不迁也。伤是伤叹也。目对真而莫觉者。此亦谓不迁之事。理审如此。故名为真。未必即是真谛也。莫觉者不觉也。既知往物之不来而谓今物之可往者。叙或情也。往物既不来今物何可往者。难惑计也。何则求向物于向于向未尝无者。求昨日物于昨日。则昨不无也。责向物于今于今未尝有者。责昨日物于今日。则今日不有也。于今未尝有以明物不来者。此是前动而非静。以其不来句意也。于向未尝无故知物不去者。此是前静而非动。以其不去句意也。覆而求今今亦不往者。前之两对。直明往而不来。今以今类往亦复如是也。是为昔物<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>昔不从今以至昔者。此是不去也。今物自在今不从昔以至今者。此是不来也故仲尼曰回也见新交臂非故者。庄子外篇田子方章云。孔子谓颜回曰。吾终身与汝交一臂。而失之。可不哀与。郭象注云。夫变化不可执而留也。故虽交臂相守。而不能令停。今用此语也。见新者。谓故人已谢。新人自来也。交臂非故者。交臂相守。亦已谢往。非后故人也。此依郭注释也。今谓郭注不然。今言交一臂而失之者。谓交一臂之顷。已失前人。非谓交臂执手不能令停也。明知交臂之顷。前已非后。言谁迁耶。然前已非后。则是迁义。而言不迁者。此明无有一物定住。而从此迁向彼。故曰不迁也。如此则物不相往来明矣者。若前人至后。后人至前。可谓往来。既不如此。故无往来也。既无往返之微朕又何物而可动乎者。朕字有二音。一者陈锦反。出尔雅。二者陈忍反。出许慎注。淮南子。按事之萌兆谓之朕。今是后音也。李奇云。朕兆也。庄子云。体尽无为而游无朕。郭注云。任物故自然无迹。朕迹也。既无往返之迹。故知不动也。然则旋蓝偃岳而常静下。旋蓝。劫初时大风名也。亦曰随岚。梵音轻重之异耳。有本云旋岚。岚者。此方之风名也。旋岚即旋风也。又释<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>道地经云。兴云之风。名旋岚也。向前为俯。向后为偃。偃卧倒也。岳者山也。江河者。有本云江海。言海不及河也。庄子云。野马尘埃也。郭注云。野马者游气也。游气奔竞。喻如野马飘扬也。鼓动也。日月历天者。有本云丽天。言历易见也。日月周旋故言历也。丽者易云。日月丽乎天。百谷草木丽乎土。小雅云。丽着也。前风非后风。故偃岳而常静。前水非后水。故竞注而不流。前气非后气。故飘鼓而不动。前日非后日。故历天而不周。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>云。譬如长风起。鼓拂生动势。二俱不相知。诸法亦如是。譬如駃水流。水流无定止。二俱不相知。诸法亦如是。肇法师不见华严。而作论冥合。自非妙悟玄理。何至于斯乎</p><p>噫圣人有言下 第四会教明不迁也。文有两段。通是会教。前广后略。今初也。噫者。论语云。噫斗筲之人何足算也。注云。噫不平之声也。切韵云。噫者恨声也。圣人者。大载礼云。哀公问孔子。何谓圣人。孔子曰。圣人者智通乎大道。应变而不穷也。庄子云。以德分人谓之圣。以财分人谓之贤也。速于川流者。涅槃经云。人命不停。过于山水。非论语中叹逝。下文方引论语耳。此意云。圣教自云人命逝速。即是迁义。何谓不迁耶。人有此疑。故今遣释也。是以声闻悟非常以成道缘觉觉缘离以即真者。以法是迁流故。声闻闻无常教。悟无常理而成道也。亦以法是迁流故。缘觉觉无常理。而得证真也。苟即万动而非化岂寻化以阶道者。且使万物非是迁流变化。何由寻此无常迁化之理。而得道耶。固应是迁也。覆寻圣言微隐难测者。前如问此如答也。微者小也。老子云。视之不见名曰夷。听之不闻名曰希。搏之不得名曰微也。测者测量也。有本云。喻谓晓喻也。若动而静似去而留者。据言教则如动如去也。据理实则如静如留也。可以神会难以事求者。可以般若神心契会。不可以言迹事相而求也。是以言去不必去闲人之常想者。服虔注<a href=\"/ctwh/shi/24s/hanshu.html\" class=\"keylink\" target=\"_blank\">汉书</a>云。闲阑也。王弼注易云。闲阂也。若兰若阂。皆是防义。释者。小雅云。释解也。若释皆是遣义也。经中言诸法生灭无常。是谓去也。谓无常者。未必即无常。为防人之常执。故说无常耳。经中又言业果不失。是谓住也。言有住者。不必即住。为防人执断之心。故言住耳。岂曰去而可遣住而可留者。有本云。去而可追非也。法性不去。经中言去。不能遣得法性令其去也。法性不住。经中言住。不能留得法性令其住也。当知为缘故说去。其实则非去。为缘故说住。实亦非住也。故成具云菩萨处计常之中而演非常之教者。光明定意经也。彼文云。如来者不用衣食。处计常之中。而知无常之谛。今取彼经意。故云菩萨耳。摩诃衍论云者。大智度论。释摩诃衍经。故名彼论无摩诃衍论。摩诃衍梵音。此云大乘也。即大品经也。斯皆导达群方两言一会者。导谓引达谓通达。群方谓众生。言圣人引导众生多方便也。虽有多方。会归一致耳。亦可群自是群。方自是方。易云。方以类聚。物以群分。圣人道此。故有两说耳。岂曰文殊而乖其致哉者。不可以言去言住两文有殊。则令法性幽致乖阻也。是以言常而不住称去而不迁者。言常未常故不住也。称去未必去故不迁也。已后覆疏此语可见。然则庄生之所以藏山仲尼之所以临川者。庄子内篇大宗师章云。夫藏舟于[堅-臣+(虍-七+(一/谷))]藏山于泽。谓之固矣。然而夜半有力者负之而走。昧者不知也。论语云。子在川上曰。逝者如斯夫。不舍昼夜。庄子意明前山非后山。孔子意前水非后水也。斯皆感往者之难留岂曰排今而可往者。此二人皆感叹往者不停。前后各别。非谓定有一物。从此推排至彼也。所以引此二书。证成不迁者。夫教之为体。意在悟物。若于物有悟。教则为益。若于物无益。教反成损。依向经论广说不迁。恐儒道二家疑而不信。故引二文令其悟解耳。事如佛教说戒。以不杀为先。俗人好杀。岂能领会。若即俗书以明不杀。则无不从顺也。孟子云。五亩之宅树之以桑。则七十者可以衣帛矣。鸡[狂-王+屯]犬彘养不失时。则八十者可以食肉矣。若据此文。则七十已下不合衣帛。八十已下不合食肉。慈悲不杀。岂独<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。以此相证。谁能不信。今引二书意同此也。是以睹圣心者不同人之所见得者。有本云用。有本云同俱得也。经中言常言无常。圣人之心难见得。人之常心则不见圣心也。何者。人则谓少壮同体百龄一质者。常人谓昔日少年。后迁至壮。故云同体。百年同是一身。更非别人也。徒知年往不觉形随者。徒虚也。年往形亦往。此是迁义。即此迁中有不迁也。往年在往时。往形在往日。是谓不迁。而人乃谓往日之人迁至今日。是谓惑矣。是以梵志出家下。此事未详所出经也。昔人尚存乎者。谓昔人犹存至今日也。吾犹昔人者。犹如也。如似昔人。实非昔人也。亦可云吾身虽复犹是昔人。其实非昔人也。亦可云汝谓吾犹是昔人。其实非昔人也。亦可云吾可犹是昔人乎。吾非复昔人也。邻人皆愕然非其言者。愕谓惊愕。不解其言故惊愕也。所谓有力者负之而趋者。有力谓无常力也。负谓担负也。趋疾行也。昧谓暗昧也。欤者此字单作自得。不劳着欠。此谓助语。如焉乎之类也</p><p>是以如来因群情所滞即方言以辨惑者 第二略会教明不迁也。因物情滞有。即为说动教。因物情滞无。即为说静教。而言方言者。随方之言。说教以遣其惑也。乘莫二之真心吐不一之殊教者。知动静不二是莫二。即真心也。说动静两教。是不一之殊教也。乖而不可异者其唯圣言乎者。言乖乖而理不可异也。故谈真有不迁之称导俗有流动之说真则言不迁。导俗流则言迁也。虽复千涂异唱会归同致者。说动说静有异。理唯是一。所谓动即静也。而征文者闻不迁则谓昔物不至今者。执静教也。征谓征责也。聆流动者而谓今物可至昔者。苍颉篇云。聆听也。闻说动。则谓今物流动谢往去也。既曰古今而欲迁之者何耶者。昔自在昔。何须迁至今。今自在今。何须迁至昔耶。是以言往不必往下。经中言迁。未必即迁。以古在古。以今在今故也。称去不必去下。此句意同上。而语别也。不来故不驰骋于古今者。驰骋走也。古不来今。今不去古也。不动故各性住于一世者。此句意同上。而语别也。古今各定。故云各性于一世也。然则群籍殊文下。群籍谓经书也。百家谓子书。九经虽殊。同明一教。百家虽异。同明一道。以喻佛经虽众言迹不同。莫不同明一致。得其道理。文言不能惑乱也</p><p>是以人之所谓住我则言其去下 第五反常明不迁也。人谓从少至老仍是一人。故名为住。我言前人非后。故名为去。人谓昔人已往。故名为去。我言昔人在昔。故名为住也。然则去住虽殊其致一也者。我言去之与住。不相违反。取其念念变异故言去。取其各住一世故言住。此则住犹是去。去犹是住也。故经云正言似反谁当信者。中本起经云尔。斯言有由者。谓经此言有所以也。何者人则求古于今谓其不住者。以昔物去至昔。不在今也今。将为不住也。吾则求今于古知其不去。以今物自在今。不去至昔。将为不去也。已下覆疏此二句也。事各性住何物而可去来者。事物也。物各住其本性。各住一世。故无去来也。然则四像风驰下。举事释成也。四像谓四时之像。驰谢如风。故云风驰也。[打-丁+(旋-方)]机电卷者。此[打-丁+(旋-方)]字多遂手边作[旋-方]。人家不解。乃引<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>文释。谓言此字为非。尚书云。在[王*(虍-七+(一/八/八/目))]玑玉衡以齐七政。孔注云。在察也。[王*(虍-七+(一/八/八/目))]美玉也。机衡也。玉者正天文之器。可以运转。舜察天文。考七政。以审已当天位与不。若作此释。则[打-丁+(旋-方)]字合玉边作睿也。今谓不然。此是北斗枢星名也。北斗七星。一天枢。二[打-丁+(旋-方)]。三机。四权。五衡。六开阳。七摇光。今不能具道七星。故但言[打-丁+(旋-方)]机二星耳。七星运转犹如电卷也。虽四象七星运转流速。得其理也亦常不动也。王弼略例云。处[打-丁+(旋-方)]机而观大运。则天地之动未足怪也。此意亦指七星也</p><p>是以如来功流万世而常存下 第六结会明不迁也。万世百劫盖语多也。积功万世。前功在于前积道百劫。盖昔道在于昔。不朽不失。弥复坚固也。成山假就于始篑者。论语云。譬如为山。虽覆一篑。进者吾往也。注云。篑土笼也。积篑土以成山。前功在于前而不失。故积多而成山也。修途托至于初步者。老子云。九层之台。起于累土。千里之行。始于足下。积一步以至多故。至千里者。无由一步。故云托至也。托是假托也。果以功业不可朽故者。此之四事。皆前功不朽。后功相续。方成其事耳。虽在昔而不化者。昔功在于昔。于昔不失。故云不化。不化故云不迁。以不迁故。事如常在。故曰湛然也。故经云三灾弥沦而行业湛然者。弥沦遍满义。周易系辞云。易与天地准。故能弥沦天下之道耳。此经未详也。何者夫果不俱因因因而果者。因果不同处。故曰不俱。由因而得果。故云因因而果也。因不昔灭者。在昔不灭。因不来今者。昔因不来至今果也。不灭不来则不迁之致明矣者。既不灭失。又复不来。故言不迁也。复何惑于去留踟蹰于动静之间哉者。知去留无二。故不惑也。知动静不二。故不踟蹰也。踟蹰者。不进貌也。然则乾坤倒覆无谓不静。干天也。坤地也。虽倒天而覆地。莫言不静也。洪流滔天无谓其动者。尧遭九年之潦。洪水滔天。犹是静也。苟能契神于即物斯不远而可知者。以神情与物理相契。即物知不迁不复远也</p><p>不真空论</p><p>此论第二明空申真谛教也。诸法虚假。故曰不真。虚假不真。所以是空耳。有人云。真者是有。空者是无。言不真空。即明不有不无中道义也。此是为蛇画足。非得意也。若如所云。则空非中乎。大分深义为何所在。既不然矣。今不用焉。所明空者。诸大乘经论皆以空为宗本。今之学者多生诽谤。谓说空者。为不了义。无有慧明。可不悲哉。佛藏经云。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。于未来世。当有比丘。不修身戒心慧。是人轻笑如来所说如来所行。如来常于第一义空。恭敬<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。常乐是行。是诸比丘。轻笑如来所说所行真际毕竟空法。尔时有苦行比丘共轻笑。尔时有行空者。我赞其善。当尔之时。咸共不能护持重戒。而言诸法自相空。何所能作。如那罗戏人种种变现。无所知者。见之大笑。何以故。不解戏法其术隐故。生希有心。惊怪大笑。如是舍利弗。尔时真实比丘。说空寂法。求活命者。咸共嗤笑。何以故。是人不知佛法义故。闻说空法。惊疑怖畏。舍利弗。汝观此人。于安隐处生衰恼心。于衰恼处生安隐心。金口所言。信非谬矣</p><p>夫至虚无生者下 此论文有二章。先序。后正。今初序也。序文有三。第一标正宗。第二破异见。第三序论意。今初。文中又三。第一标真境。第二明真智。第三合明境智。今初。言至虚无生者。即无生毕竟空真境也。盖是般若玄鉴之妙趣有物之宗极者。盖是不定之辞。将以为是。未敢为定故。所以云盖。趣是趣向义。宗是宗本。谓此无生毕竟空。是般若所鉴之境。万物之宗本也</p><p>自非圣明特达下 第二明真智也。圣明即般若也。非是般若奇特明达。何能以神情。契合中道非有非无之理哉。即此非有非无。是中道毕竟空。故云有无之间耳</p><p>是以至人通神心于无穷下 第三合明境智相契会也。以神心观无穷之理。故云通神心于无穷。不为有物之所滞碍。故云穷所不能滞也。极耳目于视听声色所不能制者。纵耳听声。不为声所惑。纵目睹色。不为色所迷也。岂不以其即万物之自虚下。良以万物是虚。故纵视听。不为声色所惑耳。累者劳累也。是以乘真心以理顺则无滞而不通者。顺谓诸法是空。不违正道也。乘御般若之心。慗理顺空之道。则无有滞碍而不通畅也。有本作履字。亦可然也。谓履践顺空之道耳。审一气以观化故所遇而顺适者。化谓万化也。适谓往适也。庄子内篇大宗师章云。彼方且兴造物者。为人而游乎。天地之一气。郭注云。皆冥之。故无二也。庄子外篇北游章云。人之生也。气之聚也。是其美者为神奇。其不美者为臭腐臭腐复化为神奇神。奇复化为臭腐。故曰通天下一气也。离骚第六卷远游章云。顺凯风以从游。至南巢而一息。见王子而宿之。审一气之和德。王逸注云。究问元释精之秘要也。今借此等诸言。以目一道也。无滞而不通故能混杂致淳者。庄子云。众人役役。圣人愚芒。参万岁而一成纪。今借此语。以喻<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。若能无滞不通。即是不二法门也。所遇顺适则触物而一者。所逢遇皆以般若观之。知其皆空。无有滞碍。是则万法一相无相也。如此则万像虽殊而不能自异者。既同一相。所以不异也。不能自异故知像非真像者。一相无相。所以像即非像。下覆上意也。然则物我同根是非一气者。物是外物。我者己身。同一无相。故曰同根。同一正道。故曰一气也。潜微幽隐殆非群情之所尽者。潜是潜藏。微是微细。幽是幽深。隐是隐映。以难见故。非诸人所能穷尽也。殆者。尔雅云危也。广雅云败也。郑玄注礼云几也。毛长注传云始也。今取其音几。几者近也</p><p>故顷尔谈论下 第二破异见也。顷者俄顷。谓少许时也。此顷诸家作论。多有不同。良以虚宗玄妙故。谈者不得其实。致成异见耳。夫以不同而适同有何物而可同者。以用也。适往也。以不同之情。往取同理。何由可得同耶。有本作释字。皆谓解也。故众论竞作而性莫同焉者。总明诸家作论理性不同也。何则心无者下。正出诸家不同之论也。然不同之论。非止一家。今略破三家。余可知矣。心无者。破晋朝支慜度心无义也。世说注云。慜度欲过江。与一伧道人为侣。谋曰。若用旧义往江东。恐不辨得食。便立心无义。既此道人不成度江。慜果讲此义。后有伧人来。先道人。语云。为我致意。慜度心无义那可立。此法权救饥耳。无为遂负如来也。从是以后此义大行。高僧传云。沙门道恒颇有才力。常执心无义。大行荆土。竺法汰曰。此是邪说。应须破之。乃大集名僧。令<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>昙一难之。据经引理。折驳纷纭。恒杖其口辨。不肯受屈。日色既暮。明旦更集。慧远就席。攻数番。问责锋起。恒<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>义途差异。神色渐。动麈尾扣案。未即有答。远曰。不疾而速。杼轴何为。坐者皆笑。心无之义。于是而息。今肇法师亦破此义。先叙其宗。然后破也。无心万物。万物未尝无。谓经中言空者。但于物上不起执心。故言其空。然物是有不曾无也。此得在于神静失在于物虚者。正破也。能于法上无执故名为得。不知物性是空故名为失也</p><p>即色者明色不自色下 第二破晋朝支道林即色游玄义也。今寻林法师即色论。无有此语。然林法师集。别有妙观章。云夫色之性也。不自有色。色不自色。虽色而空。今之所引。正此引文也。夫言色者当色色即色岂待色色而后为色哉者。此犹是林法师语意也。若当色自是色。可名有色。若待缘色成果色者。是则色非定色也。亦可云若待细色成粗色。是则色非定色也。此直悟色不自色未领色之非色者。正破也。有本作悟。有本作语。皆得也。此林法师但知言色非自色因缘而成。而不知色本是空。犹存假有也</p><p>本无者下 第三破晋朝竺法汰本无义也。情尚于无多触言而宾无者。情多贵尚此无也。触言皆向无也。宾者客也。客皆向主。今本无宗。言皆向无也。尔雅云。宾服也。言服无故云宾无耳也。故非有有即无非无无即无者。谓经中言非有者。无有此有也。言非无者。无有彼无也。寻夫立文之本旨者。有本作文。有本作无。今用文也。谓寻经文本意也。直以非有非真有非无非真无者。真实也。非实定是有。故言非有。非实定是无。故言非无耳。何必非有无此有非无无彼无者。不言非有无却此有。非无无却彼无也。此直好无之谈者。直是好尚于无。故触言向无耳。岂所谓顺通事实即物之情哉者。不顺万事之实性。不得即物之实性也</p><p>夫以物物于物下 第三明作论意也。以物名名有物。故云以物物于物。以物名名非物。故言以物物非物。以物名名有物。则有物体之可名。故云则所物而可物。以物名名非物。则无物体之可名。故云虽物而非物也。是以物不即名而就实者。物体自别。不即以名字为物实也。名不即物而履真者。名字又别。不即以物体为名之真也。然则真谛独静于名教之外下。俗谛之物。尚名不即实。实不即名。真谛之理。名教之所不及。故云独静于名教之外也。既非名教所及。文言岂能辨得真谛乎。不能杜默聊复厝言以拟之者。杜塞也厝者。小雅云。措置也。今作厝字。义亦同也。理虽不可言。试以言理也</p><p>摩诃衍论云诸法亦不有相亦不无相下 第二正是论文也。文中有六。第一引教以明空。第二据理以明空。第三重引教以明空。第四重据理以明空。第五就名实以明空。第六结会以明空。引教据理。所以为异者。引教则先引经。然后释成。据理则先明所以。然后引经论帖释也。今初引教文有三段。第一正引两论以明空。第二解释论意。第三引经证成。今初。言摩诃衍论者。大智度论也。通指一部论意。亦可但指论中一文。文云。譬如镜中像。非镜亦非面。非有亦非无也。中论者。通指一部论意。亦可但指论中一文。文云。若使无有有。云何当有无。有无既已无。知有无者谁也。而言第一真谛者。自从者字已上。是二论之文。今言第一。肇法师之语。明此两论所说。是第一义谛。亦名真谛。故合说也</p><p>寻夫不有不无者下 第二解释二论之意也。岂谓涤除万物杜塞视听下。涤除是洗荡也。老子云。涤除玄览能无疵乎。今借此语用也。杜犹是塞也。寂寥者。老子云。寂兮寥兮独立而不改。释者云。无声曰寂。无色曰寥。此意言。非谓断空始为真谛也。诚以即物顺通故物莫之逆者。诚信也。即万物之有为空。故云顺通。顺通故无阻逆也。即伪即真故性莫之易者。即俗谛之伪。真谛之真。非谓改变俗谛。别明真谛也。性莫之易故虽无而有者。即有是空。虽空犹是有也。物莫之逆故虽有而无者。即万物顺通性空。当知虽有而是空也。虽有而无所谓非有下。虽有而是无。当知非定有。下句反此也。如此则非无物也物非真也者。非无物也。明非无也。物非真也明非有也。亦可直云非是无物。但物非真有之物耳。物非真物于何而可物者。既云非真。何处有此物乎</p><p>故经云下 第三引五经证成也。今引维摩经也。经云。色即是空。非色灭空。谓色性即是空。非谓灭色然后始空也。而云败者。古经也。坏败是毁败。亦是灭义。以明夫圣人之于物也即万物之自虚者。以明两字。或可属上。或可属下。唯庄子应属上。今此文意则将属下也。后亦然。明圣人见万物之性自空耳。岂待宰割以求通哉者。小雅云。宰治也。割谓裁也。即色是空。不须宰割破坏。然后方乃通于空也。是以寝疾有非真之谈超日有即空之称者。前引一经。此引两经。后更有两经也。寝疾谓维摩经也。彼经云。菩萨病者非真非有。众生病亦非真非有也。超日者。超日明经也。彼经云。不有受不保命四大虚也。然则三藏殊文统之者一者也。三藏谓修多罗毗昙毗尼。虽言迹异端。以理统之。莫终不归毕竟空也。故放光云第一真谛无成无得下。据第一义谛。无有<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。无有得涅槃。世谛则有耳。夫有得则是无得之伪号下。诸本皆云。成得则是无得之伪号。今依古本。有得为正也。准下无得句。义亦应然。实是无得。而云有得是假伪之名。无得反此也。真名故虽真而非有者。诸本皆云。虽得而非得。今依古本。虽真而非有也。准下伪号句。义亦应然也。虽曰真名仍非是有。伪号反此也。是以言真未尝有者。覆前两句也。二言未始一下。真伪两言不一。而有无二理不殊也。故经云真谛俗谛谓有异耶下。此是大品经第二十二卷道树品中问答也。此经直辨下。释前经中问答意也。真谛明非有下。据真则非有。据俗则非无也。岂以二下。不以谛名有二。则谓法体有二也</p><p>然则万物果有其所以不有下 第二据理以明空也。文中有二。先正据理以明空。后引二经证成也。今言然则者。若然则皆空也。果者果敢决定义。所以者是义也。万物有不有义。有不无义。故云尔也。有其所以不有故虽有而非有者下。诸本多云。有其所以不无。今勘古本。正应言不有。文义亦应然也。人谓万物是有。今明万物有不有义。故虽有非是有。下句反此也。虽无而非无无者不绝虚者。虽是无而非定无。则此无。不同大虚永绝。下句反此也。若有不即真无不夷迹者。有非定有。故云不即真。无不泯灭。故云不夷迹。夷平也。老子云。视之不见名曰夷也。迹者事相之迹。即事是无。不待夷平然后始无耳。然则有无称异其致一也者。名殊而理一也</p><p>故童子叹曰下 第二引二经证成也。童子者。维摩经中长者子宝积也。言佛说法非定是有。亦非是无。皆从因缘而有也。璎珞经云者。此是大缨络经也。彼经第十三卷初。文殊师利问云。一切诸佛转法轮。为有转耶。为无转耶。佛言诸佛正法。亦不有转。亦不无转。文殊复问。云何亦不有转亦不无转。佛言诸法空故。亦无有转。亦无无转也。此乃众经之微言者。诸经中微妙之言也</p><p>何者谓物无耶则邪见非惑下 第二解释经意也。邪见见无。若谓物定是无。则邪见应非是惑乎。谓物有则耶常见为得者。常见见有。若谓物定是有。则常见应非是惑乎。以物非无故下。覆上句可见也。然则非有非无信真谛之谈者。非有非无是真谛教也</p><p>故道行云心亦不有亦不无下 第三章重引教以明空也。初安故字。似如引证。看后语势。乃是开章也。文中有二。前引一经一论以明空。后单引一论以明空。今初文二。前正引一经一论以明空。后释经论意。今初也。中论云者。此通引中论意也。亦可是四谛品偈。偈云。众因缘生法。我说即是空。亦为是假名。亦是中道义也。寻理即其然矣。此经论所说理如然也</p><p>所以然者下 第二解释经论意也。文中二。先释非有。后释非无。今初也。岂待缘而后有哉者。有若定有。不须待缘生方有也。譬彼真无下。此举大虚之无。以喻有也。若有不能自有待缘而后有下。有要待缘。明知非有也。有非真有下。结明有空也。不无者下。释非无也。夫无则湛然不动下。若湛然不动。始可名为无也。万物若无则不应起者。无若定无。则不应缘会而起也。起则非无者。以缘起而生。故知非无也。以明夫缘起故不无也者。明知缘起故非无也。而言以者。以用也</p><p>故摩诃衍论云下 第二单引一论以明空也。文中有二。前正引论。后释论意也。一切诸法一切因缘故应有者。诸法皆从因缘故有也。一切诸法一切因缘故不应有者。诸法皆从缘故。非定有也。一切无法一切因缘故应有者。诸法本无。从缘故有也。一切无法一切因缘故不应有者。诸法从缘有者。以从缘故。非定有也</p><p>寻此有无之言下 第二释论意也。上来两对各各相反。如此相反。非徒然也。寻此语意。是明非有非无中道耳。此是理一称二其文有似不同者。只是一物。而言非有非无。故云称二。言非有似异非无。言非无似异非有。故云不同也。苟领其所同则无异而不同者。苟且也。所同者。谓中道也。言非有非无皆明中道。中道既同。故无不同也。</p><p>然则万法果有其所以不有下 第四重据理以明空也。文中有三。先正明空。次覆疏解释。后引经证成。今初。据理意同前章也</p><p>何则欲言其有下 第二覆疏解释也。有非真生者。假缘而生。故非真生。非真生故。不得言有也。事像既形者。万事万像皆已形现。皆已形现。不得言无也。像形不即无。非真无非实有者。事像形现。不即是无。有非真生。非是定有也。然则不真空义显于兹矣者。正以非真实有。故言不真。既非实有。所以言空。论之得名。从此义也</p><p>故放光云下 第三引经证成也。譬如幻化人者。此有三读。一者。连三句通成一段。二者譬如幻化人为句。后两句相着也。三者。譬如幻化人非无幻化人为句。已后为一段。今且从初也。幻化异者。从无起有为化。从有起有为幻也。非无幻化人幻化人非真人者。非无即非无也。非真即非有也</p><p>夫以名求物物无当名之实下 第五就名实以明空也。文中有二。前正明空。后引经论证成。今初也。将名取物。物非是名。故云物无当名之实也。以物求名名无得物之功者。将物取名。名非是物。故云名无得物之功也。物无当名之实下。覆疏前句也。是为名不当实下。又覆疏上句。直明名非实。实非名耳。名实无当万物安在者。名不当实。则名非名矣。实不当名。则实非实矣。名实不当。万物皆空。故云安在。安在者何在也</p><p>故中观云下 第二引经论证成也。先引中观论。后引成具等经。今云物无彼此者。通是中论意也。亦可别指观苦品一偈。偈云。自作若不成。云何彼作苦。若彼人作苦。是亦名为作。今取此意反证也。此彼莫定乎一名下。此不定此。彼不定彼。而惑者谓为定有此彼也。必然者决定也。志者志意。意有记录故名为志耳。然则彼此初非有惑者初非无者。彼此无定性。故云非有。于惑者则元不无也。既悟此彼之非有又何物而可有哉者。彼此在物既无。彼此又无物也。故知万物非真假号久矣者。号名也。以非真是假。故名为空。是以成具立释名之文下。引成具及大品经证成也。先引成具经及庄子。后引大品。今引成具经。兼引庄子。助成此义也。成具光明定意经云。是法无所有。强为其名也。庄子云。以指喻指之非指。不若非指喻指之非指。以马喻马之非马。不若非马喻马之非马。此意云。此以此指为指。将彼指为非指。彼亦以彼指为指。将此指为非指。于马亦然。各有一彼此。则彼此无定。各有一是非。则是非无定也。而言园林者。庄子为膝园吏。故云尔也。如此则深远之言于何而不在者。无彼无此。此是深言。成具固已有之。庄子亦作此说也。是以圣人乘千化而不变下。以万法是空。故圣人变之。而不染也。千化万变者。意言多也。变化非一。故云千化。惑倒非一。故云万惑。虽乘千化。出生入死。而不为生死所染。故云不变。虽履万惑。无所不为。而不为倒惑所壅。故云常通也。必以其即万物之自虚下。以法自空。不假将空观。本空法也。经云甚奇<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>下。引大品经证成也。彼经云。如来建立众生于实际。古本云立处。今引古大品文也。明一切诸法是实际。能令众生知诸法皆是真际。故云为诸法立处也。非离真而立处下。非是离真际。别建立众生于真际。即明众生是真际。故云立处即真也</p><p>然则道远乎哉下 第六会结以明空也。道谓无生真理也。圣谓般若真智也。道远乎哉者。言不远也。触事皆是道。更无别道耳。圣远乎哉。言不远也。体悟即是圣。更无别有圣人</p><p>肇论疏卷上</p><p>大唐开元二十三年。岁在乙亥。闰十一月三十日。杨州大都督府江都县白塔寺僧玄湜。勘校流传日本国大乘大德法师</p><p>使人发促无暇写。聊附草本。多不<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>。幸恕之。后睿师源师还更附好本耳</p><p>天平胜宝六年七月十九日写竟</p><p>信定篁</p><p>文永二年七月十三日。于光明山东谷<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>院。敬奉书写了。愿以书写力。自他开慧眼矣(同移点了)</p><p>三论宗 智舜(春秋六十七)</p><p>永仁二年(甲午)十月十五日。于东大寺新禅院。以古本挍合之次。任愚推加点毕。鲁鱼之至。越度有多欤。颇虽有其恐。粗凿荒途。后哲必加修治而已</p><p>抑今古本。文字多不定也。就中日本国大乘大德法师者。指道慈律师耳</p><p>三论圆宗沙门 圣然</p><p>正安二年(庚子)二月一日。于八幡宫法园寺。以先师上人第二传点本。重加挍点了</p><p>沙门 然(悟习刃)</p><p>肇论疏 卷中</p><p>释元康撰</p><p>般若无知论</p><p>此论第三明因申般若教也。而言般若者。梵音。此云智慧也。无智者。无有取相之知耳。常人皆谓般若是智。则有知也。若有知则有取着。若有取着即不契无生。今明般若真智。无取<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。虽证真谛。而不取相。故云无知</p><p>夫般若虚玄下 此论文有三章。第一正是本论。第二刘公致问。第三肇师释答。今初。本论之中。文有三章。第一先序般若之因由。第二正标无知之宗旨。第三问答料简。今初序中。文有四段。第一标宗旨。第二序什师。第三叹秦王。第四明论意。今初也。般若之法。无相故虚。幽隐故玄。玄黑也。幽深难测。义如玄黑。河上注老子云。玄天也。此亦以天远难明义。同幽黑也。盖是三乘之宗极诚真一无差者。盖者不定之辞也。谓是而未敢为是。故云盖是也。三乘皆有般若。皆因般若而得成道。皆以般若为宗本。皆以般若为至极。然有深浅不同。故有大小之异。以此义故。信般若是真是一无差之法也。然异端之论纷然久矣者。般若之法。理性无差。比者学人释有差异。以其不能明般若之性。故异说不同。即如远法师集云。闻壹公以等智为般若。情实不甘。即其事也。何者。等智者是共有之智。上下是同。如涅槃经云。一切众生。皆有三种等智。所谓淫欲。恐怖。饮食。小乘依此。故立等智。此是粗近。未为深妙。岂以此智而为般若乎。道一师不解。故云以此为般若耳。今肇法师亦弹此义。故云尔也。亦可常人或谓般若有知。或谓无知不能分别。今詺此为异端耳</p><p>有<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>沙门下 第二序什法师也。高僧传云。什法师父。是天竺国宰相子。名鸠摩罗焰。祖父当绍位。乃避位不受。东游龟兹。龟兹王帛伅妹。体有赤靥。法生智子。诸[囗@(儿/方)]娉之。皆不肯应。乃见焰。心欲当之。王遂逼妻焰。焰遂纳之。生什法师。法师出家已后。又往天竺。故云天竺法师也。而言鸠摩罗什者。本名鸠摩罗耆婆。此云童寿。其父名鸠摩罗焰。母名耆婆。今合取父母之名为字。故云尔也。至此已后。善解文什。故名为什。此梗概。略取传意。非全文也。此是皎法师作传云尔。余处不见。然此语或可然。或不然也。何者。若什法师至此。善解文什。故云罗什者。高僧传中。更有梵僧。名佛驮什。亦解文什。然后名什乎。彼既不然。此何独然哉。以此言之。未必然也。少践大方者。老子云大方无隅。今借此语。以喻大乘之法也。什法师七岁出家。先学小乘诸论。至年十三。从参军王子须利耶苏摩受学。苏摩兄弟二人。兄名须利耶跋陀。弟名须利耶苏摩。苏摩才辨绝伦。兄及诸人皆从受业。苏摩为什说阿耨达经。什闻阴界诸法皆空无相。怪而问曰。此经更有何义。而皆破坏诸法。答曰。眼等诸法。非真实有。什既执有根。彼据因成无实。于是研核大小。往复移时。什方知理有所归。遂专务方等。因广求义要。受诵中百十二门等。故云少践大方也。又大方者。谓天竺国。什虽生龟兹。早向天竺耳。研机斯趣者。机是机根也。易云。知几(平声)其神乎。又云。几者动之渐。字与今别。义或可同也。或不同也。而言同者。动之渐亦是心也。言不同者。机但论心。动之微则泛论诸事耳。什法师年二十。于龟兹王宫中<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。住于新寺。又于寺侧古宫中。初得放光经。始就披读。魔来蔽文。唯见空纸。什知魔所为。誓心逾固。魔去字显。仍习诵之。复闻空中声。曰汝是智人。何用读此。什曰。汝是小魔。宜时速去。我心如地。不可转动。今指此事。故云尔也。独拔于言像之表者。周易有文言象辞。假文言象辞。方显易道。王弼周易略例。明象文云。夫象者出意者也。言者明象者也。尽意莫若象。尽象莫若言。言生于象。故可寻言以观象。象生于意。故可寻象以观意。意以象尽。象以言着。故言者所以明象。得象而忘言。象者所以存意。得意而忘象。是故存言者。非得象者也。存象者。非得意者也。象生于意而存象焉。则所存者。乃非其象也。言生于象而存言焉。则所存者。乃非其言也。然则忘象者乃得意者也。忘言者乃得象者也。今借此语用也。易之言象。本明易道。什法师玄悟般若。不假言象也。妙契于希微之境者。有本有得字也。契谓契会也。说文云。契要也。案契刻木为要也。然契有雌雄。像于男女。雄为左契。雌为右契老子云执左契。此之谓矣。希微者。老子云。视之不见名曰夷。听之不闻名曰希。搏之不得名曰微。此三者不可致诘。故混而为一。今借此语。以喻般若无声无形。什法师能妙契会也。齐异学于迦夷者。齐谓齐整也。异学是外道也。迦夷是中天竺国名。此云赤泽国也。言迦夷者。意言在西国破外道。未必克在中天竺也。其事者。龟兹北界温宿国。有一外道。神辨英秀。名振诸国。手击王鼓而自誓曰。论胜我者。斩首谢之。什法师既至。以二义相捡。则迷闷自失。稽首归依。今指此事也。杨淳风以东扇者。风谓般若慧风。如淳和之风也。东扇。谓扇般若之风于此东国也。其事者。什母先将什至北天竺。遇一阿罗汉。名达摩瞿沙。见而异之。谓其母曰。常当守护。此<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>若年至三十五。不<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>者。度人无数。如忧婆毱多。若破戒者。无所能为。正可才明绝世法师而已。遂将什归其母。后复往天竺。临去谓什曰。方等深教。应大阐真丹。传之东土。唯尔之力。但于自身无益。其可如何。什曰。大士之道。利彼忘躯。若必使大化流传。能洗悟蒙俗。虽后身当炉镬苦而无恨。后遂传法来此。故云东扇也。将爰烛殊方而匿曜凉土者。将欲也。爰于也。小尔雅云。爰易也。烛照也。凉土即凉州也。凉有五凉。前凉张轨。后凉吕光。南凉吐蕃乌孤。西凉季暠。今言凉者。沮渠蒙逊。五凉并都姑臧。前后二凉并都姑臧可知。而南凉西凉北凉亦都姑臧者。南凉初都武威西平。后徙东都。又从姑臧。又反东都也。西凉初都姑臧。后迁须泉。蒙逊初都张掖。后迁姑臧也。今言凉者。是蒙逊凉也。言什法师将欲照烛此国。所以在凉土。隐匿才智者。有所以也。其事者。前秦主符坚。建元十三年正月。太史奏。有星现于外国分野。当有大德智人。入辅中国。坚曰。吾闻西国有鸠摩罗什。襄阳有释道安。将非此耶。即遣使求之。至十八年九月。坚遣骁骑将军吕光。凌江将军姜飞。率兵七万。西伐龟兹。临发坚饯光于建章宫。谓光曰。夫帝王应天而治。以子爱苍生为本。岂贪其地而伐之。正以怀道之人故也。朕闻西域有鸠摩罗什。深解法相。朕甚思之。贤哲者国之大宝。若克龟兹。可驰驿送什。光果克龟兹。将什东返。行至凉州。闻符坚为姚苌所害。光乃窃号关外。光死。子绍袭位。光庶子纂。杀绍自立。光侄超。杀纂立其兄隆。总经十八年。吕光父子不弘正道故。蕴具深解无所宣化。今言此事也。所以道不虚应应必有由矣者。符坚死此则无由也。姚兴出是谓有由也。弘始三年下。后秦姚兴年号也。岁次星纪者。丑月为星纪。丑年为赤奋若。今以月名詺年。故云星纪。何者。尔雅释名云。寅年摄提格。卯年单阏。辰年执除。已年大荒落。午年敦[牛*羊]。未年协洽。申年涒滩。酉年作[咢-二+一]。戌年阉茂。亥年大渊献。子年困顿。丑年赤奋若月也。正月析木。二月大火。三月寿星。四月鹑尾五月鹑火。六月鹑首。七月实沈。八月大梁。九月降娄。十月娵觜。十一月玄枵。十二月星纪。今弘始三年正当丑年。年属赤奋若。今以丑月之名。以代丑年之名。故云弘始三年岁次星纪也。有人云。十二年名。十二月名。皆是次第互用无苦在。故以月名詺年也。秦乘入国之谋举师以来之意者。诸本皆云八国者。非也。今依古本入国是也。三十国春秋云。吕隆惧南凉北凉之逼。表奏请迎。隆迁于秦。吕光之嗣于是乎绝。此乃是吕隆入秦国。非是八国也。高僧传云。弘始三年三月。有树连理生于庙庭。逍遥园。葱变为薤。以为美瑞。谓至人应入国。至五月。兴遣陇西公硕德。西伐吕隆。隆军大败。至九月隆上表归降。方得迎什入关。故云入国之谋也。师者兵众也。举兵以取什法师来耳。意者北天竺之运数其然矣者。文选鲁灵光殿赋序云。自西京未央。皆见堕坏。而灵光岿然独存。意者。岂非神明扶持。以保汉室。今效此语也。明符坚举兵法。往取什法师。未至而卒。今姚兴举兵往取。乃得归来者。此是北天之运。运数应尔也。而言北天者。大品经云。般若于佛灭后。至南方。次至西方。后至北方。北方大兴盛。大智论释云。北方谓北天竺也。今谓北天竺。运数展转。方至东国。故云尔耳</p><p>大秦天王者 第三叹秦王姚兴也。兴初承父之后。僭称皇帝。后之皇帝。号自称秦王。百官皆隆号。改年弘始。今不称天子。此云天王耳。道契百王之端下。道居前王之表。故云百王之端。德润洽于未来之世。故云千载之下。游刃万机者。智刃也。庄子内篇养生章云。庖丁为文惠君解牛。手之所触。肩之所倚。足之所履。膝之所踦砉(呼历反)然响然。奏刀騞然。莫不中音。合于桑林之舞。乃中经首之会。文惠君曰。嘻善哉伎。盖至于是乎。庖丁释刀对曰。臣之所好者道也。进乎伎矣乎始臣解牛之时。所见无非牛者。三年之后。未尝见全牛也方今之时。臣以神遇而不以目视。良庖岁更刀而割也。族庖月更刀而折也。今臣之刀。十九年矣。所解数千牛矣。而刀刃若新发于硎。彼节者有闻。而刀刃者无厚。以无厚入有间。恢恢乎。其于游刃必有余地矣。万机者。尚书咎繇谟曰。兢兢业业一日二日万机。孔注云。几微也。言当戒惧万事之微。今作机字。仍是单机字也。言秦王者。外能游智刃断割国务。内能终日弘通佛道也。信季俗苍生之所天下。信言信是也。季者。孟仲季。季末也。信秦王是季俗苍生所仰如天。释迦遗法之所凭如杖。亦杖托之杖也。遗法杖之而得兴盛也。而言苍生者。苍是天色。庄子逍遥篇云。天之苍苍。其正色耶。今云天生。故云苍生。所谓众生也。时乃集义学沙门下。于时集诸僧也。义学谓学义者也。秦时有逍遥园。园中有观。故云逍遥观也。睿师云。逍遥园西明阁。阁亦观也。逍遥园在西京故城之北。临渭水也。躬执秦文与什参定方等者。什法师弘始三年十二月二十日至长安。弘始五年四月二十三日。于逍遥园中。出大品经。秦王躬览旧经。验其得失。今言其事也。其所开托者下。明秦王所请译经。开托法门者。非但取益当时。乃为末代津梁也。累劫者。意云当来久远利益也</p><p>余以短乏下 第四序论意也。短谓短学。乏谓乏才。曾谓曾经也。厕谓间厕也。嘉善也。谓经预间在五百人数会耳。以为上闻异要始于时也者。我以此时初闻异法要法耳。然圣智幽微下。前且明曾闻般若。今明般若难解。不可言说也。为试罔像其怀下。怀抱罔像。然似如有解。寄狂言以说之也。而言罔像者。庄子外篇北游章云。黄帝游赤水之北。登乎昆仑之丘。南望而遗其玄珠。使智索之而不得。使离谁朱索之而不得。使契诟索之而不得。乃使罔象。罔象得之。黄帝曰。异哉罔象。乃可以得之乎。郭注云。明得真者。非用心也。罔象焉即真。今用此语也。字虽少异。本出庄子文</p><p>放光云般若无所有相下 第二正标无知论之宗旨。以为论体也。文有五段。第一标宗。第二辨相。第三融会。第四明体。第五总结。今初。文中有三。初正标宗。次解释。后引证。今初引两经标立无知宗旨也。此辨智照之用而曰无相无知者。此亦是释。但未正释也。此句如问。既云般若。正明智用。应是有知。乃云无相无知。何故然耶。果有无相之知不知之照明矣者。此句如答也。果者决定也。定有无相之知。则无取相之知。以无取相之知。以无取相之知。明是无知也</p><p>何者夫有所知即有所不知下 第二解释也。有所知者。取相知也。若有取相知。则无无相知也。又取相此即忘彼。知事即迷理。故知有所知者。则有所不知也。以圣心无知无所不知者。无此取相知。则有无相知也。又取相既有所不知。即不取相则无所不知。理数然矣。不知之知乃曰一切知者。无心取相而能知万物者。乃是圣人一切智之所知也</p><p>经云圣心无知下 第三引证也</p><p>是以圣人虚其心而实其照下 第二辨相也。所言相者。非有相之相。乃是无相之相耳。老子云。虚其心。实其腹。弱其志。强其骨。今借此语也。虚其心。谓不取相也。实其照。遍知万法也。故能默曜韬光者。以不取相。故能潜照万法也。鞱光者。谓藏匿智光。而不取相也。虚心者。谓心无执着也。玄览者。谓幽鉴也。闭智者。谓不分别也。塞听者。不听纳也。又不曜而曜名为默曜无光而光名为韬光。无心而心谓之虚心。不览而览名为玄览。不知而知谓之闭智。无听而听谓之塞听。虽复闭智塞听。而独悟空空之理。故云独觉冥冥也。然冥冥语。出庄子。庄子云。照照生于冥冥。有伦生于无形。今借此语。以喻空空也</p><p page margintb15></p></div>"
}]