[{
    "title": "诸法无诤三昧法门 第1923部",
    "author": "慧思大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>诸法无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>法门 卷上</p><p>陈南岳思大禅师撰</p><p>如万行中说。从初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。一身一心一<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。欲为<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>故。万行名字差别异。夫欲学一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。先持净戒勤<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。得一切佛法诸三昧门。百八三昧。五百陀罗尼。及诸<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。大慈大悲。一切种智。五眼。六<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。三明。八解脱。十力。四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。十八不共法。三十二相。八十种好。<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。三十七品。四弘大誓愿。四无量心。如意神通。四摄法。如是无量佛法<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。一切皆从禅生。何以故。三世十方无量诸佛。若欲<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>度众生时。先入禅定。以十力道种智。观察众生根性差别。知其对治。得道<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。以<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>观察竟。以一切种智。说法度众生。一切种智者。名为佛眼。亦名现一切色身三昧。亦名普现色身三昧。上作一切<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。诸菩萨身。辟支佛身。阿罗汉身。诸天王身。转轮圣帝诸小王身。下作三涂六趣众生之身。如是一切佛身。一切众生身。一念心中一时行。无前无后。亦无中间。一时说法度众生。皆是禅波罗蜜功德所成。是故佛言。若不<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>。平地颠坠。若欲断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。先以定动。然后智拔。定名奢摩他。智慧名毗婆舍那。定有无量。总说三种。下定名欲界定。中定名<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>定。上定名<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>定。复次下定是声闻定。总揽<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。中定是辟支佛定。上定是如来定。及诸菩萨定。智有无量说有三。一者道智。二者道种智。三者一切种智。慧亦有三。一者道慧。二者道种慧。三者一切种慧。复次分别说有十一智。何者是耶。法智。世智。他心智。<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智。苦智。集智。灭智。道智。尽智。无生智。如实智。复次尽智无生智。分别则有十八种智。尽智有九。无生智有九。是名十八智。亦得名为十八心。三乘<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>共在四禅诸智慧中。问如实道如实智者。于一切法总相别相。如实能知故。名如实智。是诸智慧。即是一切智。亦名无智。何以故。如先尼梵志问佛。经中说。先尼梵志白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。如来一切智慧。从何处得。佛答先尼。无有得处。先尼复问。云何智慧无有得处佛复答言。非<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>中得是智慧。非外观中得是智慧。非内外观中得是智慧。亦非不观得是智慧。是故智慧无有得处。故名无智。如奇特品说。一字入四十二字。四十二字还入一字。亦不见一字。唯佛与佛善知字法。善知无字法。为无字法故说于字法。不为字法故说于字法。是故四十二字。即是无字。复次欲坐禅时。应先观身本。身本者如来藏也。亦名<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净心。是名真实心。不在内。不在外。不在中间。不断不常。亦非中道。无名无字。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>貌。无自无他。无生无灭。无来无去。无住处。无愚无智。无缚无解。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。无一二。无前无后。无中间。从昔已来无名字。如是观察真身竟。次观身身。复观心身。身身者从<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>心生。随业受报。<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>诸趣。实无去来。妄见生灭。此事难知。当譬喻说。身本及真心。譬如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>月。无初无后。无<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。无出无没无去来。众生妄见谓生灭。大海江河及陂池。溪潭渠浴及泉源。普现众影似真月。身身心心如月影。观身然欲甚相似。身本真伪亦如是。月在虚空无来去。凡夫妄见在众水。虽无去来无生灭。与空中月甚相似。虽现六趣众色像。如来藏身未曾异。譬如幻师着兽皮飞禽走兽种种像。贵贱男女差别异。端正丑陋及老少。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>种种可笑事。幻师虽作种种变。本丈夫形未曾异。凡夫虽受六趣色。如来藏色不变异。身本及真心。譬如幻师睡身心无思觉寂然不变易。身身及心数。如幻师游戏故示六趣形种种可笑事。身身众生体。难解譬喻说。如此法性无涅槃。亦无有生死。譬如眠熟时。梦见种种事。心体尚空无。何况有梦事。觉虽了了忆。实无有于此凡夫颠倒识。譬喻亦如是。禅定智慧能觉了。余散心智不能解非。但凡夫如梦幻。月影现水种种事。复次诸佛菩萨圣皆尔。从初发心至<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。持戒禅定种种事甚深定心不变易。智慧神通幻化异。法身不动。如空月普现色身作佛事。虽无去来无生灭。亦如月影现众水。何以故。如经论中说。欲学一切智定。必修诸<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。若在定能知世间生灭<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。亦知出世三乘圣道。制心禅智。无事不办。欲求佛道持净戒。专修禅观。得神通能降天魔。破外道。能度众生断烦恼。问曰。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经中佛自说言。欲学声闻。当学般若。欲学缘觉当学般若。欲学菩萨。当学般若。复次有六波罗蜜。般若为前导。亦是三世诸佛母。汝今云何。偏赞禅不赞五波罗蜜。复次如经中说。五度如盲。般若如眼。汝今云何。偏赞度不赞明眼。谁能信者愿广解说。除我等疑惑。答曰。谛听善思念之。吾当为汝决定说</p><p>三乘般若同一观随证浅深差别异</p><p>如大海水无增减随取者器大小异</p><p>声闻缘觉及菩萨如来智慧亦如是</p><p><a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>四种智下智声闻中缘觉</p><p>巧慧上智名菩萨如来顿觉上上智</p><p>以无名法化众生方便假名差别异</p><p>三乘智慧不能知唯佛世尊独知耳</p><p>如大集经杂<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>三乘法行同一义</p><p>陈如稽首白世尊十方菩萨大众集</p><p>云何名法行<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>愿佛演说法行义</p><p>尔时佛告憍陈如至心谛听今当说</p><p>若求法行诸比丘诵如来十二部经</p><p>谓修多罗及毗昙优婆提舍及毗尼</p><p>乐为<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>敷畅说是乐诵说非法行</p><p>若更复有诸比丘诵如来十二部经</p><p>能广演说思惟义是乐思惟无法行</p><p>若复次有诸比丘更读诵十二部经</p><p>演说思惟观其义是名乐观无法行</p><p>夫法<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>三乘同一观我今当说者</p><p>有比丘能观身心心不贪着一切相</p><p>谦虚下意不生慢不以爱水洗业田</p><p>不于中种识种子灭觉观法境界息</p><p>永离烦恼心寂静比丘如是观身心</p><p>佛说是人真法行如是比丘即能得</p><p>声闻缘觉佛<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>法行比丘观三事</p><p>观身观受及观心比丘观察三念已</p><p>一心四禅十八智复次大智论中说</p><p>声闻缘觉及诸佛四禅二九十八智</p><p>同共证道明闇异共观四谛十二缘</p><p>随机感悟种种异声闻四谛十六心</p><p>辟支独觉无漏智菩萨亦解二乘法</p><p>获得无碍十六谛如诸天共宝器食</p><p>饭色黑白各有异四谛譬喻如镫品</p><p>定如净油智如炷禅慧如大放光明</p><p>照物无二是般若镫明本无差别照</p><p>睹者眼目明暗异禅定道品及<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a></p><p>般若一法无有二觉道神通从禅发</p><p>随机化俗差别异</p><p>问曰。佛何经中说般若诸慧皆从禅定生。答曰。如禅定论中说。三乘一切智慧皆从禅生。般若论中。亦有此语。般若从禅生。汝无所知。不解佛语。而生疑惑。作是狂难。汝何不见。十方诸佛。若欲说法度众生时。先入禅定。以神通力。能令大地十方世界。六种震动。三变土田。转秽为净。或至七变。能令一切未曾有事。悉具出现。悦可众心。放大光明。普照十方。他方菩萨。悉来集会。复以五眼观其性欲。然后说法。复次般若波罗蜜光明释论中说。有人疑问佛。佛是一切智人。智慧<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。即应说法。何故先入禅定。然后说法。如不知相。论主答曰。言如来一切智慧。及大光明。大神通力。皆在禅定中得。佛今欲说摩诃般若大智慧法。先入禅定。现大神通。放大光明。遍照一切十方众生。报禅定恩故。然后说法。为破外道执。外道六师。常作是言。我是等智慧。于一切常用常说。不须入禅定。佛为降伏如是邪见诸外道辈。先入禅定。然后说法。复次如胜定经中所说。若复有人。不须禅定。身不证法。散心读诵十二部经。卷卷侧满。十方世界皆闇诵通利。复大<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。恒河沙劫。讲说是经。不如一念思惟入定。何以故。但使发心欲坐禅者。虽未得禅定。已胜十方一切论师。何况得禅定。说是语时。五百论师来诣佛所。俱白佛言。我等多闻。总持十二部经。及韦陀论五部。毗尼讲说无碍。十六大国。敬我如佛世尊。何故不赞我等多闻智慧。独赞禅定。佛告诸论师。汝等心乱。假使多闻何所益也。汝欲与禅定角力。如盲眼人欲睹众色。如无手足欲抱须弥山王。如折翅鸟欲飞腾虚空。如蚊子翅欲遮日月光。如无船舫人欲度大海。皆无是处。汝等论师。亦复如是。欲角量禅定。无有是处。复次毗婆沙中说。若有比丘。不肯坐禅。身不证法。散心读诵。讲说文字。辨说为能。不知诈言知。不解诈言解。不<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>知。高心轻慢坐禅之人。如是论师。死入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。吞热铁丸。出为飞鸟。猪羊畜兽。鸡狗野干。狐狼等身。若复有人。不近善知识。虽复坐禅获得四禅定。无有转治。无方便智。不能断烦恼。虽得寂静之乐烦恼不起。获四禅时。谓得寂灭涅槃之道。便作是念。我今已得阿罗汉果。更不复生。如此比丘。实不得道。不断烦恼。但得似道禅定。不近善知识。无方便智。谓得实道。起增上慢。临命终见受生处。即生疑悔。阿罗汉者更不复生。我今更生。当知诸佛诳惑于我。作是念时。即坠地狱。何况余人不坐禅者。重宣此义。而说偈言</p><p>欲自求度及众生普遍十方行六度</p><p>先发无上<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>修习忍辱坚持戒</p><p>昼夜六时勤<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>发大慈悲平等心</p><p>不惜身命大精进欲求佛道持净戒</p><p>专修禅智获神通能降天魔破外道</p><p>能度众生断烦恼从初发心至成佛</p><p>一身一心一智慧为欲教化众生故</p><p>万行名字差别异欲觉一切诸佛法</p><p>持清净戒修禅定舍诸名闻及利养</p><p>远离愦闹痴眷属念十方佛常忏悔</p><p>不顾身命求佛道获得百八三昧门</p><p>亦得五百陀罗尼及诸解脱大慈悲</p><p>五眼六通一切智亦得三明八解脱</p><p>具足十力四无畏三十二相八十好</p><p>三十七品具六度十八不共微妙法</p><p>视诸众生如一子四弘誓愿具四摄</p><p>四无量心道种智一切种智四如意</p><p>观察众生广法施入四禅定放光明</p><p>遍照十方诸世界变秽为净大震动</p><p>现诸奇特希有事十方菩萨悉集会</p><p>三界天王皆在此端坐瞻仰一心待</p><p>同声三请愿闻法从禅方便三昧起</p><p>为众随应演说法色身香声种种别</p><p>禅定寂然心不异虽在座坐现法身</p><p>十方九道无不遍净戒禅定三昧力</p><p>十方了了分明见应可度者如眼前</p><p>未可度者即不见如空月影现众水</p><p>闇室深井即不现譬如幻师种种变</p><p>盲瞎之人则不见盲瞎睡重者不见</p><p>诸佛法身镜亦尔三障众生不能见</p><p>若无净戒禅智慧如来藏身不可见</p><p>如金矿中有真金因缘不具金不现</p><p>众生虽有如来藏不修戒定则不见</p><p>净戒禅智具六度清净法身乃显现</p><p>净妙真金和水银能涂世间种种像</p><p>如来藏金和禅定法身神通应现往</p><p>普告后世求道人不修戒定莫能强</p><p>无戒定智皆不应匆匆乱心讲文字</p><p>死入地狱吞铁丸出为畜生弥劫矣</p><p>如是众生不自知自称我有大智慧</p><p>轻毁一切坐禅人坏乱<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>作魔事</p><p>假使讲经恒沙劫都不曾识佛法义</p><p>如杀三千世界人及诸一切众生类</p><p>高心谤禅坏乱众其罪甚重过于此</p><p>譬如群贼劫牛乳高声唱得醍醐味</p><p>不知钻摇及熮暖亦失酪浆生熟酥</p><p>粗浅薄味尚都失醍醐上味在何处</p><p>不修禅智无法喜譬喻说言无妇女</p><p>不净乱心执文字故言皮囊可盛贮</p><p>譬如盲狗咬草丛不见人及非人类</p><p>但闻风吹草鸣声高声叫言贼虎至</p><p>养一盲狗虎咬故举世盲狗叫乱沸</p><p>其心散乱都不定觉观心语亦如是</p><p>赞百千经心常乱如蛇吐毒与世诤</p><p>增见诸非毒转盛自言坏常子难生</p><p>既见禅智法喜妻石女无儿难可生</p><p>解文字空不贪着若<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>时解无生</p><p>禅智方便般若母巧慧方便以为父</p><p>禅智般若无著慧和合共生如来子</p><p>三乘圣种从是学故称一切众导师</p><p>净戒禅智如大地能生万物载群类</p><p>禅智神通巧方便能生三乘一切智</p><p>若能一念在禅定能报三世佛恩义</p><p>三世诸佛坐道场<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>众生皆由此</p><p>一切凡夫共一身一烦恼心一智慧</p><p>真如一像不变易<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业影<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>异</p><p>诸佛菩萨一法身亦同一心一智慧</p><p>一字万行化众生一圣假名四十二</p><p>凡圣色藏一而二方便道中凡圣二</p><p>色藏元象无一二唯佛与佛乃知此</p><p>我从无数十方佛闻此一字无量义</p><p>少行法师不能知文字论师不能解</p><p>若人不近善知识学得有漏似道禅</p><p>初禅谓得须陀洹四禅谓得阿罗汉</p><p>起增上慢诸漏尽谓言断结不更生</p><p>临命终时见生处即作是言佛欺我</p><p>阿罗汉者不更生我今云何更受生</p><p>身证不了尚如此何况散心著文字</p><p>不知诈知起我慢颠倒说法诳众生</p><p>身不证法升高座死入阿鼻大地狱</p><p>身证不了尚生疑何况不证盲心说</p><p>高心乱语谤诸佛受学之徒皆效此</p><p>从地狱出为畜生备作种种诸杂类</p><p>若人亲近善知识证无漏禅乃明解</p><p>具足禅智多闻义如是导师可依止</p><p>禅定深隐难可知</p><p>复次禅波罗蜜。有无量名字。为求佛道。修学甚深微妙禅定。身心得证。断诸烦恼。得一切神通。立大誓愿。度一切众生。是乃名为禅波罗蜜。立大誓愿故禅定转名四弘。欲度众生故。入深禅定。以道种智清净法眼。观察众生是处非处十力智。尔时禅定转名四无量心。慈悲愍众生。拔苦与乐。离憎爱心。平等观察。尔时禅定。转名慈悲喜舍。既观察已。与其同事。随应说法。尔时禅定。转名四摄法。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。爱语。利益。同事。是名四摄法也。复次大慈大悲。现如意神通一切色身。以神通力入五欲中。遍行六趣。随欲度众生。尔时禅定。转名神通波罗蜜。亦普现十方一切佛事。常在禅定寂然无念。复次深大慈悲怜悯众生。上作十方一切佛身。缘觉声闻一切色形。下作六趣众生之身。如是一切佛身。一切众生身。一念心中一时行。无前无后无中间。一时说法度众生。尔时禅定及神通波罗蜜。转名一切种智。亦名佛眼。复次菩萨摩诃萨。持戒清净。深妙禅定。断习气故。远离三世诸爱见故。尔时禅定。转名十八不共法。复次菩萨摩诃萨。以三明智分别众生。尔时禅定。转名十力。善知是处及漏尽故。复次菩萨摩诃萨。色如受想行识如。观一切法。始从初学终至成佛断烦恼。及神通尽知十方世界名号。亦知三世诸佛名号。及知诸<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>名号。亦知一切众生名号。及知众生烦恼名号。解脱名号。一念一时知。及知宿命因缘之事。尔时禅定转名十号也。复次菩萨摩诃萨。以诸法无所有性。一念一心具足万行。巧方便慧。从初发心至成佛果。作大佛事。心无所著。总相智。别相智。辩说无碍。具足神通波罗蜜。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>十方一切佛。净佛国土。教化众生。尔时禅定。转名般若波罗蜜。复次行者。为出世间故。三界九地名为八背舍。次第断烦恼。欲界未到地禅及中间。二禅及四禅。空处及非有想。最后灭受想。于欲界中具五方便。一者发大善心。求佛道故。欲得禅定。名善欲心。是善欲心。能生一切佛法。能入一切禅定。能证一切解脱。起一切神通。分别欲界色界无色界。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>三毒四大。十二入十八界。十二因缘。一切诸法<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>变异。苦空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。亦知诸法无生灭真实相。无名无字。无漏无为。无相无貌。觉了诸法。故名法智。未到初禅得金刚智。能断烦恼证诸解脱。是名未到地。初欲界地及未到地。如是二地。是佛道初门。欲得禅定。是名欲心。复次初夜后夜。专精学禅。节食摄心。舍离眷属。断诸攀缘。是名精进。复次专念初禅乐。更无余念。是名念心。复次巧慧筹量欲界五欲。欺诳不净。是三恶道伴。初禅定乐。断诸欺诳。得真智慧。是入涅槃伴。是筹量。是名巧慧心。复次专心一处。灭诸觉观。境界都息。身心寂静。是名一心。如是五方便。能断五欲妖媚烦恼。灭除五盖。有觉有观。离生得喜乐入初禅。名初背舍得入二禅。名二背舍。入第三禅。名三背舍。喜乐心内清净得四禅。名为入一切处。灭一切色相。舍第四禅。灭有对想。入无边虚空处。名为空一切处。第四背舍虚空处定。得一切识处定。是名识一切处第五背舍。复次舍识处定。入无所有处定。是名第六背舍。舍无所有处定得入非有想非无想处定。生厌离心。是名第七背舍。舍非有想非无想处定。入灭定受想定。心无所著。是名第八背舍。尔时禅波罗蜜。转名八背舍。复次自觉觉他。通达无碍。得三解脱。能破三界一切烦恼。尔时禅波罗蜜。转名十一智。复次行者。总持旋陀罗尼。<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>三分。八圣道。破四颠倒获四<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。尔时禅波罗蜜。转名三十七品。起一切神通。所谓<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>。四正勤。四如意足。五根五力。七觉分八圣道分。名为摩诃衍。如四念处品中说。转一切智慧。以一神通。现一切神通。以一解脱。作一切解脱。转一名字语句。入一切名字语句。如是一切名字语句。还入一名一字一语一句。平等不异。是四念处字等语等。诸字入门。一切佛法尽在其中。复次菩萨摩诃萨。欲教化众生。令生清净<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a><a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>故。与一切圣人。建立一圣官阶位次第。众生之得大欢喜。决定无疑。尔时誓愿勤修禅定。得六神通。作转轮圣王。入五道中。飞行十方。广行布施。须衣与衣。须食与食。金银七宝。象马车乘。楼橹宫殿。房舍屋宅。五欲众具。箫[竺-二+遂]箜篌。琴瑟鼓吹。随众生欲尽给与之。后为说法令其得道。虽作如是种种法施。实无施者。无财物。无说无示。无听法者。譬如幻师幻作幻人。四衢道中化作高座。广说三乘微妙圣法。又作四众集共听受。如是幻师所作幻事。无色<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。无示无听。无受无闻。无得菩萨。尔时禅波罗蜜。转名檀波罗蜜何以故。施人物时。虽知诸法无所有性。无施无受。无财物相。三事俱空。虽知空寂。勤行布施。复次菩萨摩诃萨。虽知诸法空罪相不可得。持戒<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。如梦如幻。如影如化。如水中月。虽知诸法无生灭。坚持净戒无毁缺。亦以戒法为他人说。若人恶心不<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。化作禽兽行。礼仪人类。见此大羞辱。各发善心。坚持净戒。发大誓愿。遍十方不顾身命行戒施。常现六道种种形。广说如来清净戒。以宿命智观察之。必令欢喜无嗔害。非但为说戒法。亦说摄根定共戒。道共戒。性寂戒。报寂戒。尔时禅波罗蜜。转名尸波罗蜜。复次菩萨摩诃萨。行此财施法施戒施时。受者嗔恚来打骂。割截手足心不动。乃至失命心不悔。尔时禅定。转名羼提波罗蜜。菩萨行是甚深禅定。于一切圣行。以法忍故。心无所著。禅定即是羼提波罗蜜。复次菩萨。学四念处时。获得四禅。复作是念。我于身念处。未得如意神通。受念处未获宿命神通。修心念处。未获他心智。不知十方凡圣心故。修法念处时。如是思惟。我今未获漏尽神通。修身念处。观一切色。亦未得清净天眼。于受念处。未证因缘业报垢净神通。于心念处。未得众生语言三昧。作是念已。勤精进求乃至成就。具六神通。尔时禅定。转名精进毗梨耶波罗蜜。复次菩萨。为起神通故。修练禅定。从初禅次第。入二禅三禅四禅。四空定。乃至灭受想定。一心次第。入无杂念心。是时禅波罗蜜。转名九次第定。复次菩萨。入初禅时。观入出息。自见其身。皆悉空寂。远离色相。获得神通。乃至四禅。亦复如是。入初禅时。观入出息。见三世色。乃至微细。如微尘许。悉见无碍。亦见众生出没<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>差别。于<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>通达无碍。是名天眼神通乃至四禅。亦复如是。入初禅时。观息出入。以次第观声。悉同十方凡圣音声。是名天耳神通。乃至四禅。亦复如是。入初禅时。观入出息住息住舍摩他。观色相貌。以毗婆舍那。观他心相。善知十方凡圣之心。是名他心智神通。乃至四禅。亦复如是。入初禅时。观息入出。获得眼通。得眼通已。观于有歌罗逻时五阴生灭。乃至无量劫中五阴生灭。获得宿命。是名宿命神通。乃至四禅。亦复如是。悉能观察一切众生。善恶业行差别不同。亦复知其发心早晚。入道远近。十方三世通达无碍。是名道种智慧神通。尔时禅定转名师子奋迅三昧。以神通力。供养十方佛。及教化众生。净佛国土。边际智满十地具足。变身如佛满十方。<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>神通。未得满足。是师子奋迅三昧。唯有诸佛。乃能具足。复次菩萨。入重玄门修四十心。从凡夫地初发心时。所修禅定。次第重入。乃至最后无垢地。修诸禅定。学佛神通化众生法。从初禅入乃至灭受想定。三禅四禅四空。亦复如是。是名顺超无碍。从灭受想定超住散心中。超入初禅。非有想非无想处无所有处。识处空处。四禅乃至二禅。亦复如是。是名逆超自在无碍。尔时禅定。转名超越三昧。修佛神通。得佛智慧。余五波罗蜜。亦复如是。是少一波罗蜜。不名五波罗蜜复次学禅定时。修四念处。于欲界中。观内外色。入初背舍。具足闻慧。观内外假二相不可得故。亦非是一如。如性故一解脱。复次思慧具足。观察内外法。内外一切法。总相别相异相。不可得如如。故二解脱。复次<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。六观具足。色界五阴空。三解脱。复次闻慧修慧。用巧方便金刚智。破四空定。无贪着心。空五阴不可得故。得解脱空处。得解脱识处。得解脱无所有处。得解脱非有想非非想处。得解脱观灭受想定。不可得故。得是解脱。是名八解脱。如如性故。无缚无脱。菩萨尔时。禅波罗蜜名八解脱。复次菩萨禅定。修四念处。得三十七品。具足佛法。何以故。是身念处。观色法故。一念具足四念处故。是身念处。用念觉分。观五阴时。能断一切烦恼。故观色阴时。是身念处。不净观九想。具足舍摩他。能破一切烦恼。是名为定。如论偈中说</p><p>初观身念念系缚心令定</p><p>亦系缚识定及除烦恼怨</p><p>九想舍摩他。欲界金刚定。能破五欲如缚贼。十想毗婆舍那。欲界未到地金刚智。能观五阴。毕竟尽想。不能更生。得尽智无生智。断一切烦恼。如意利刀。斩断贼头。观色如受想行识如。深观五阴如如性故。即无烦恼可断。亦无解脱涅槃可证。何以故。色即是空。空即是色。受想行识即是空。空即是受想行识。空即是涅槃。涅槃即是空。烦恼即是空。空即是烦恼。智慧即是空。空即是智慧。不可以虚空断虚空。不可以虚空证虚空。如论偈说</p><p>观身不净相真如性常定</p><p>诸受及以心法亦如是观</p><p>烦恼者六欲心也初死想。能断威仪语言欲。膨胀想坏想散想。能断形容欲。青瘀血涂想脓烂想。能断<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>。骨想烧想。能断细滑欲。散想灭尽想。能断人欲。如论中说</p><p>四蛇同一箧六贼同一村</p><p>及王旃陀罗分自守根门</p><p>六欲妖媚起爱怨诈为亲</p><p>声香味触法六情起诸尘</p><p>贪欲如猛火嗔恚如蛇蚖</p><p>愚痴覆心眼智者当善观</p><p>外想三四块身器二六城</p><p>中含十二秽九孔恶露盈</p><p>痈疽虫血杂膨胀臭烂脓</p><p>骨锁分离断六欲失姿容</p><p>九想观成时六贼渐已除</p><p>及识爱怨诈兼知假实虚</p><p>四大共相依缘习成假名</p><p>行者谛观察但见骨人形</p><p>初观如珂许后渐满一城</p><p>骨人遍法界深生忧厌道</p><p>从生至老死老死复有生</p><p>转轮十二缘生死如循环</p><p>三涂苦难忍人天亦复然</p><p>谁闻六道苦而不兴厌心</p><p>妄识本无体依因寂法生</p><p><a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>生妄想转轮十二缘</p><p>知过二业患现不造三因</p><p>老死更不续反流尽生源</p><p>诸法无诤三昧法门卷上</p><p>诸法无诤三昧法门 卷下</p><p>陈南岳思大禅师撰</p><p>四念处观</p><p>身念处观如音品</p><p>观身不净时。先观息入出生灭不可得。次观心心相。若先观色。粗利难解。沉重难轻。若先观心。微细难见。心空无体。托缘妄念。无有实主。气息处中。轻空易解。先观入息从何方来。都无所从。亦无生处。入至何处。都无归趣。不见灭相。无有处所。入息既无。复观出息从何处生。审谛观察。都无生处。至何处灭。不见去相。亦无灭处既无入出。复观中间相貌何似。如是观时。如空微风。都无相貌。息无自体。生灭由心。妄念息即动。无念即无生。即观此心住在何处。复观身内。都不见心。复观身外。亦无心相。复观中间。无有相貌。复作是念。心息既无。我今此身从何生。如是观时。都无生处。但从贪爱虚妄念起。复观贪爱妄念之心。毕竟空寂。无生无灭。即知此身化生不实。头等六分色如空影。如虚薄云。入息气出息气。如空微风。如是观时。影云微风。皆悉空寂。无断无常。无生无灭。无相无貌。无名无字。既无生死。亦无涅槃。一相无相。一切众生亦复如是。是名总观。诸法实相。如是观竟。欲得神通。观身四大。如空如影。复观外四大。地水火风。石壁瓦砾。刀杖毒药。如影如空。影不能害影。空不能害空。入初禅时。观息入出。从头至足。从皮至髓。上下纵横。气息一时。出入无碍。常念己身。作轻空想。舍粗重想。是气息入无聚集。出无分散。是息风力能轻举。自见己身空如水沫。如泡如影。犹如虚空。如是观察。久修习竟。远离色相。获得神通。飞行无碍。去住远近。任意自在。是身念处。不净观法。九想十想。及观气息生灭出入空无障碍。亦能获得如意神通。先证肉眼。次观天眼。能见无量阿僧祇十方三世微细色等。亦见众生生死出没善恶业报。皆悉知之。明了无碍。总摄十力十八不共法。能作大身。遍满十方。能作小身。细如微尘。一能作多。多能作一。重能作轻。轻能作重。丑陋作端正。端正作丑陋。长短大小。青黄赤白。悉能变化。虚空作地地作虚空。地作水火。水火作地。能令变作。金银七宝石壁草木。亦复如是。皆能变作。金银七宝。象马车乘。城郭楼橹。宫殿屋宅。房舍灯烛。日月大珠。及如意珠。饮食衣服。床榻被褥。箫笛箜篌。五欲众具。众生所须。尽给与之。然后说法。令入佛道。能自变身。作十方佛身。名字不同。色像差别。亦复能令皆作金色。三十二相。八十种好。顶上肉髻光明。普遍满十方。间无空处。十方远近。如对目前。过去未来。亦复如是。人天交接。两得相见。亦复能作菩萨缘觉阿罗汉身释梵四王诸天身转轮圣王诸小王身。能作四种佛<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>形。男变为女。女变为男。亦作六趣众生之身。如是凡圣众色像。一念心中一时行语言音声。亦复如是亦复能作臭烂死尸缚魔波旬。令舍高慢远离魔业。求佛正道。臭烂尸观。非独系缚波旬魔王。亦能降伏一切淫女。令舍要欲发清净心信求佛道是禅波罗蜜身念不净观法。初<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>时。能断五欲一切烦恼。能除五盖。能断十缠。若人修习。如偈所说</p><p>气息轻空风火观飞行十方无障碍</p><p>皮肉筋骨不净观获得如意大神通</p><p>总名八大自在我一切形色能变化</p><p>总名十四变化心非但变化如上事</p><p>能令大地六种动变十方秽为<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a></p><p>是身念处不净观总说如是大功德</p><p>若广诸说不可尽三十七品亦在中</p><p>今已总说身念处种种功德差别法</p><p>受念处品</p><p>复次禅波罗蜜中受念处观如偈说</p><p>能断一切受今当更总说</p><p>断除三受法一切受亦尽</p><p>三受者。一者苦受。二者乐受。三者不苦不乐受。如十二因缘中说。不苦不乐受。但是无明。有名无色。苦乐二受是行识名色六入触受爱取有生老死灭坏苦忧悲恼。如是三受和合共成事。不能一一独生烦恼。内受外受内外受。内受是六根名为六情。外受是六尘。名为六境。内外受名六识。亦名为心思惟分别。如是内外。有三十种六根六尘六识六触六受。是名三十。皆由无明不能了故。贪善恶业。遍生六趣。若能修习戒定智慧。净三毒根。名曰六度。是故论言智度。大道佛从来生死往来故。曰大道智慧。断三受故名为度。是故佛言。净于三毒根。成佛道无疑。一切贪嗔痴。三受以为根。破戒是恶趣门。持戒是善趣门。若修戒定智。闭塞诸恶道。通达善趣门。亦得名为关闭一切诸恶趣门。开佛无上大菩提门。六根名为门。心为自在王。造生死业时。贪着六尘。至死不舍。无能制者。自在如王。是故名为无上死王。譬如世间五月时雨大恶雹。五谷果树。摧析堕落。人畜皆死。是恶雹雨。譬如金刚。无能制者。断诸善根。作一阐提。是故名为死金刚雨。譬如世间金翅鸟王。飞行虚空四大海中。擒捉诸龙。自在无碍。食啖令尽。无能制者。是故名为死金翅鸟。譬如世间恶转轮王。飞行虚空。遍四天下。擒捉诸王。自在无碍。坏他事业。无能制者。是故复名死转轮王。一切天人王。无能制者。唯除一人。大力神仙。幻术咒师。智如金刚。能伏一切。乃能伏此生死心王。亦复如是。二十五有。无能制者。唯除菩萨。修戒定慧智获得初禅。至第四禅及灭受想定。成就四念处。法忍具足。得大神通。乃能降伏生死心王。一切凡夫及二乘人。不能降伏如是死王。为无常法之所迁故。不能降伏。唯有法大力菩萨生分尽者。乃能降之。无习气故。苦受内苦外苦。内苦者。饥渴悲恼。愁忧嗔恚。嫌恨宿怨。不适意事。怨憎会时。内心大苦。如是等苦。名为内苦。复次求物不得。若得更失五欲众具。爱别离故。父母兄弟。妻子眷属。抄劫死亡。若遭恶病。无药可治。必死无疑。忧悲啼哭如是等苦。皆名内苦。闻外恶声。骂辱机刺。内怀忿怒。亦名内苦。外苦者。若为王法所加鞭杖拷楚。牢狱系闭。杻械枷锁。名为外苦。亦名内外苦。若师子虎狼。诸恶毒兽。风雨寒热。如是等。此名为外苦。若自身有病。诸根不具足。名身苦。若为他役使。担负重载。若行远路。中间崄难。无止息处。如是等苦。是名身苦。应学慈悲修空。忍之不生嗔恚。于怨憎处。应作是念。是我先世。恼害彼人。今但自责。不应嗔他。虎狼狮子。狂象恶王。亦复如是。于贪求处。应求舍心。不应嗔恼。观恶音声。如空中响。彼声不来。耳不往受。随闻随灭。谁骂谁受。则无嗔恚。闻好音声。称扬赞叹。如前观之。亦不生喜。<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>供养。一切乐受。应作是念。彼自求福。便于我处。自作功德。不闻我事。不应欢喜。譬如废田。有人耕种。自求报故。地不应喜。复有异人。多持粪秽。毒刺恶草。积种在中。掘凿穿穴。高下不平。彼人自生。如是恶心。地亦不嗔。亦不念彼徒自苦恼。有人问言怨害骂辱。能忍不嗔。是事可尔。礼拜供养赞叹乐受。何以不喜。答曰。彼今虽复供养赞叹于我。后若遇恶缘。即便嗔我。若打若杀。不应生喜。苦受乐受。皆如幻化。无有定相。不应嗔喜。如彼大地。无憎爱心。菩萨欲求无上佛道。应先修学大地三昧。亦应学如虚空三昧。不苦不乐受。亦复如是。不应贪着。应作是念。苦乐中间故。有不苦不乐。若无苦乐。则无不苦不乐。一切皆是无常生灭。不曾暂停。生灭无故。无生灭处。求不可得。如是观时。即无三受。得三解脱。男女等相。亦复如是。如幻如化。无生无灭。不可得故。如身念处。五阴如相。不可得故。无十八界。故无一切受。何以故。六根六尘六识空故。求不可见。名之为空。求亦不得。名之空空。亦无有空。复次禅波罗蜜中。观受念处。无生无灭。无一切受。即是涅槃。观察涅槃。亦不可得。无名字故。即无涅槃。如是观时。初学能断一切烦恼。又得一切宿命通。自观己身现在初生五阴歌罗逻时。生灭不住。亦见过去无量阿僧祇劫五阴生灭。以身念处天眼力故。住初禅中。能见如是宿命神通。一切生处<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长短。苦乐受报。饮食衣服。种性名字。生死出没。国土世界。欲性善恶。悉见悉知。现在未来宿命因缘。及一切事。悉见悉知。如过去世。亦知诸天六趣众生三世宿命。知己不异。亦复能知诸佛菩萨缘觉声闻一切宿命。一念心中。称量尽愿。明了无碍。于一切众生中。得自在寿命。随其所感。长短不同。为众生故。现一切身。受一切命。欲度十方三恶道众生。欲度饿鬼。观受念处。住初禅中。用如意通。施美饮食。令其苦息。而为说法。欲度畜生时。观受念处。入初禅时已入第四禅从四禅起住第二禅。用如意神通。令诸众生离畜生业得人天。令其欢喜。而为说法。欲度地狱众生时。观受念处。入初禅时已入第二禅。从二禅起入第四禅。从四禅起住第三禅。以如意通。变化十方阿鼻地狱及诸地狱。悉为天堂。一切苦具。变为璎珞。如其苦息。如第三禅乐。随应说法。欲度福德大力众生时。观受念处及三念。入初禅。初禅起入二禅。二禅起入三禅。三禅起。入第四禅。住火一切处。放大光明。遍照十方。住地一切处。十方大地六种震动。住风一切处。戒定慧香。遍熏十方。住水一切处。现月爱三昧。十方重病苦恼众生。悉得消除。身心安乐。住地一切处。秽恶世界。变为净土。池流华果。七宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。放眉间光。召集十方诸大菩萨。悉求集会。口光顶光。放中间光。集三界天王转轮圣王阿修罗王及诸小王并诸天人。<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>光明。普及三涂一切众生。集会听法。悉为受记。受记之法。凡有九种。三乘及六道。是名九种差别受记。如摩诃般若放光论中说。若放顶上肉髻光明。遍照十方。集大菩萨。并集过去多宝佛等。又及十方分身应化无量诸佛十方世界。为一切佛土满中诸佛。移诸天人三涂八难。置于他土。不令在会。无余杂众。当知此会。但说一乘。为一生补处菩萨受如来记。若放眉间大光明。同顶光中事。当知此会。为大声闻密行菩萨过十地入佛境界者受如来记。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华中说。二种放光受记之法。但说佛果事一乘佛智慧。无余杂众故。不说九道记。问曰。佛大慈悲平等说法。众生普闻。复何意故。说法华时。三变世界八方通同为一佛土。初第一变。八方五百万亿那由他恒河沙等诸佛世界。同于娑婆。上下两方。亦复如是。第二变化。八方各变二百万亿那由他恒河沙等诸佛世界。亦同娑婆。第三变化。八方各二百万亿那由他恒河沙等诸佛世界。同于娑婆。如是三变。各放眉间白毫光明。移诸天人阿修罗等三涂八难。置于他方。不得闻法。当知如来心不平等。答曰。是事不然。如来智慧。非汝境界。不应难言佛不平等。彼以何故。妙法华会但说一乘顿中极顿诸佛智慧。为大菩萨受如来记。难信难解。是故漏尽二乘人。新发意菩萨及以不退诸菩萨等。疑惑不能解。何况余人。譬如世间转轮圣王。庄严四天下。集诸转轮王。共论圣王事。唯有王边智慧大臣。乃能信解。得近王座。同论王事。诸余恶臣。愚闇无智。则不堪闻。不得同座。何况余小王及诸仆使。而近王座。如来顿教。亦复如是。唯有一生补处无垢大士。得佛智慧。受如来记者。乃得闻之。此会不说引导之教。是故余人不得在座。余人若闻不解故。即生疑谤。堕于地狱。是故移之置于他土。四众五千。亦复如是。譬如阎浮提人眼不得见上界诸天。若得见者。两眼双瞎。薄福德故。不堪见此诸天光明。是故见者两眼双瞎天人阿修罗三涂八难。亦复如是。尚不得见肉眼眉间受记光明。何况闻说受如来记也。若得闻者。则生诽谤。永失信心。断诸善根。作一阐提。将护彼意。不得闻之。譬如世间饥饿病瘦绝食来久薄腹者。不得一往多食干麸及以强饼[起-巳+并]麫验酒。一往饱食。必死不疑。五千四众天人阿修罗三涂八难。亦复如是。薄福德故。不堪得闻受如来记。问曰。诸佛神通无量方便。一音说法随类得解。何故移之置于他土。答曰。如汝所问。他土之音。有二义。一者本土。是如来藏。一切众生不能解故。贪善恶业<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>六趣。二者一切众生。无量劫来。常在六趣。轮回不离。如己舍宅。亦名本土。天人阿修罗等薄福德故。不能感见三变座席。复不感闻本无如教甚深妙声。是本无如如来如一如无二如本末究竟等。唯佛与佛乃能知之。余人不解。五千四众天人阿修罗三涂八难。不闻本无如。不得究竟解故。是故名为置于他土。复次五千天人阿修罗及难处。异座异闻。得解薄少。永舍六趣。是故复名置于他土。实不移却。不觉不知。不离本座。物解不同。故言他土。欲重宣受念义。而说偈言</p><p>行者初观受念时三种受法难舍离</p><p>苦受能生诸怖畏亦生九恼诸怨害</p><p>常怀忿难作方便得怨便时断其命</p><p>或净五欲起怨心或诤名利作怨害</p><p>或贪住处获利养见胜己来欲杀害</p><p>或加诽谤恶名流或时愿人令杀害</p><p>是苦受法有三种内受外受内外受</p><p>若欲断除诸苦受当观怨家如赤子</p><p>亦如父母及兄弟亦如诸师及同学</p><p>生生无不从彼生是无量劫之父母</p><p>我旷劫来曾生彼一切皆是我赤子</p><p>此观成时嗔恚尽获得大慈大悲心</p><p>怨家悲叹生悔心如见父母悉归命</p><p>我往昔曾彼受学一切皆是我大师</p><p>或修俗礼及五经或学出世解脱道</p><p>学善法故好名流忍恼害故得神通</p><p>一切皆是我和尚亦是诸师及同学</p><p>应当<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>勤供养恭敬供养如佛想</p><p>若受上妙五欲乐人天王处自在乐</p><p>三界天王人王乐无常至时皆碎破</p><p>一切乐受是苦本乐报尽故苦报至</p><p>贪受荣华谓是常爱别离时地狱至</p><p>苦乐受尽则无苦不苦不乐则无生</p><p>具五方便除五欲亦除五盖障道因</p><p>五欲五盖烦恼尽具足五支入初禅</p><p>二禅三禅第四禅还入初禅观五阴</p><p>见身如泡空如影出入息如空中风</p><p>见过去世无量劫诸受五阴生灭空</p><p>断五欲故烦恼尽断五盖故获五通</p><p>断五欲故获如意断五盖故获三明</p><p>是故诸佛而说偈言内外怨贼皆已</p><p>除无明父亦灭退若能断贪诸爱尽</p><p>自觉觉他名解脱诸行魔母既灭尽</p><p>无明魔父亦破碎既断烦恼获六通</p><p>立大誓愿度一切自能断除三受已</p><p>亦断众生一切受得自在受无量命</p><p>亦知一切解脱受知受凡圣九道记</p><p>亦受补处如来记若欲说法度众生</p><p>先现希有奇特事深入禅定放光明</p><p>普照十方诸世界变诸秽恶为净土</p><p>七宝行树以庄严三涂八难悉解脱</p><p>等齐人天来听法以受念处观察之</p><p>然后为其演说法或令世界净秽异</p><p>众生各见不相知形色音声种种别</p><p>众生各闻皆不同各见佛同为说法</p><p>都不见他前有佛虽复差别各各异</p><p>能令一时各解脱随众生寿命长短</p><p>能自在受种种命或见短寿入涅槃</p><p>或见长寿无量劫是受念处初学时</p><p>能断苦乐诸系缚初观诸受内外苦</p><p>亦观诸受内外空不苦不乐受亦空</p><p>断阴界入破无明观三受性非空有</p><p>则无系缚无解脱法性无佛无涅槃</p><p>亦无说法度众生众生与佛一如如</p><p>本末究竟无差别坐道场得成佛道</p><p>即是导师方便说如人梦中得成佛</p><p>放光说法度众生此无佛道无众生</p><p>佛法性相亦复然众生迷惑不觉知</p><p>深着苦因不暂舍诸苦所因贪为本</p><p>舍贪求心无相依见诸受空无生灭</p><p>证苦无生苦圣谛内外假合名为集</p><p>无十八界集圣谛生灭灭已名寂灭</p><p>证无寂灭灭圣谛阴无缚解无邪正</p><p>证平等慧道圣谛四谛无二是一谛</p><p>实无差别四种谛一谛空故即无谛</p><p>无谛巧慧佛三谛一切众生从本来</p><p>无生无灭无缚解五阴如性非明闇</p><p>凡夫与佛无一二</p><p>三十七品亦在其中。观受念处多故。受念处为主。独称其名(略说受念处竟)</p><p>心念处品</p><p>复次行者。初学禅时。思想多念。觉观攀缘。如猿猴走。不曾暂停。假使行者。数随心观。亦不能摄。即作是念。三界虚妄。皆心所作。即观是心从何处生。心若在内。何处居止。遍观身内。求心不得。无初生处。亦无相貌。心若在外。住在何所。遍观身外。觅心方所。都不见心。复观中间。亦不见心。如是观时。不见内入心。不见外入心。不见内外入心。不见阴中心。不见界中心。当知此心空无有主。无名无名行。无相貌。不从缘生。不从非缘生。亦非自生。是是名者。能观心念。心念生灭。观念念生灭。观念念相。不可得故。亦无生灭。如观我心。他心亦然。复观心性。无有心性。无有心性。亦无相貌。毕竟无心。亦无不见心。如是观竟。身心空寂。次第入禅。能起神通。复次菩萨摩诃萨。观心念处。学得一切禅定解脱起如意神通。立大誓愿。度一切众生。应先观其心入初禅。次第入至第四禅。乃至灭受想定。还入初禅心。观念处。内心外心内外心。亦复观察三毒四大五阴十二入十八界十二因缘。如是观竟。观诸解脱遍一切他心智三昧。以他心智如意神通。亦入天眼宿命漏尽神通遍观中。如是诸神通已观七觉分。住他心智三昧。用念觉分择分觉分及精进觉分遍观十方一切众生心心性欲。用十力智分别之。一一众生。感闻何法。闻何音声。见何色像。于何解脱门。而得解脱。如是观竟。用喜觉分神通三昧。悉令十方六道众生皆大欢喜。用除觉分定觉分舍觉分。用如意神通。普现色身。上中下根。随机说法。悉令解脱。此心念处。初修学时。身心得证。自断一切心想妄念诸结烦恼。亦能如已教他人学。但未得神通。不能明力。不识众生种种根性所念各异。不称其机。利益甚少。作是思惟。但是学时。未是说时。不应强说非时之言。若修禅定。获大神通如意自在。得他心智差别三昧。一念悉知凡圣差别之心。通达无量阿僧祇劫过去未来。如现在世。如是学竟。乃可说法。思惟既竟。还入初禅观于身心。空如影。息如空风。心无相貌。轻空自在。即得神通。住第四禅。放大光明。一者色光遍照十方凡圣色身。二者放于智慧光明遍照十方九道凡圣上下智慧。悉能遍知彼是处非处。及知宿世因缘果报。亦如身念处受念处三昧。如是竟现一切身。十方远近。如对眼前。各为说法。悉令解脱。欲说法时。现希有事。悦可众生。令大欢喜。以神通力。十方世界秽恶之处。变为净土。金银琉璃一切众宝。间错其地。充满世界。上妙</p></div>"
}]