[{
    "title": "前言 彻底无我的境界",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>前  言</strong></p><p>彻底无我的境界</p><p>如果能静下心来检查自己内心当中的那个所谓的我，就会发现，无论怎样觉得自己有修行，心中还是处处有个我，做每件事还是习惯性的首先考虑自己的利益得失，从自己的私人利益出发，其次才能考虑到他人的利益；把一切法都当作实有，所以才与一切法较劲。真正的做到无我是很难的，无始劫以来的惯性习气，自己能检查出来都不容易，何况还能压伏和断除。</p><p>无量劫学佛修行究竟是为了什么？就是为了能达到彻底的无我，只要能不把任何一个法当作我，当作实有，不与任何一个法较劲，那么我们就不用再学佛，不用再修行，大小乘都已经无学了。</p><p>要如何对治心中的各种我呢？首先就要知道所谓的我都是指那些，范围有多广，先断除最狭隘的我的知见，再降伏我性，断除我执。然后还有广泛的我见，把三界世间一切法都当作我，当作真实，这个是要在以后的修行路上慢慢降伏和断除，都断尽了，从此天下真正的太平，再也没有事了，究竟常乐我净，这样岂不快哉！</p><p>只要把一个法当作实有，去与其较劲，那就是我性。真正不较劲时，内心里是相当的平和，相当的柔软，相当的驯服，相当的慈爱，相当的光明，内心通明，豁达大度，光明无比，什么时候能完全做到这样呢？无一法可当情，说时容易，做起来太难，就是习气太深厚了，难以除尽。</p><p>不与一人作对，不与一事较劲，不与一法为仇，心中坦坦荡荡，平平和和，磊磊落落，光光明明，亮亮堂堂，寂寂静静，空空落落，融融洽洽，这可能就是彻底无我的心境了，这样的生命才有真正的价值，才有真正的意义，才值得保重。但也没有保重的心念了，内心不重一法，也不轻一法，几乎与如来藏的境界相等了。</p></div>"
},{
    "title": "第一章 极乐世界篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  极乐世界篇</strong></p><p>一、佛说观无量寿经三辈九品往生，世尊在观经中开示众生，往生极乐世界有上中下三辈九个品级。其中上辈往生，是发心修学大乘，走大菩提路，发愿明心见性，广利无量众生；中辈往生为小乘发心，只为个人解脱生死苦；下辈往生是造大恶业者，临命终善根显现，决定往生极乐世界。</p><p>上品上生，生到极乐世界，不用住在莲花里，直接见阿弥陀佛，闻佛讲法。因为此人在娑婆世界已经明心见性，心里已经断除了无始无明，断除了我见，不用在莲花宫殿里熏修大乘。见佛时，能听懂阿弥陀佛所讲甚深大乘法，并且能当场证得无生法忍入如来家，成为地上菩萨，具足广大甚深的智慧，然后分身十方世界，随意供养十方诸佛，随缘十方世界度众。</p><p>上品中生的人没有明心见性，但能读诵大乘方广经典。弹指间到极乐世界以后，要在极乐世界莲花里住极乐世界的一宿，等于娑婆世界的半大劫时间；然后从莲花里出来，在极乐世界的七天后见佛闻法，开悟成为不退转菩萨，再经过极乐世界的一小劫时间，成为初地菩萨，入如来家。极乐世界的一天等于娑婆世界的一大劫，也就是1680万年乘以80这么长的时间。</p><p>上品下生，在莲花里住极乐世界的一天一宿，就是娑婆世界的一大劫时间，然后从莲花里出来，极乐世界的七天后见佛，还看不清楚佛像，再经过极乐世界的二十一天，闻佛说法开悟明心，再经过极乐世界的三小劫，成为初地菩萨，入如来家。</p><p>中品往生，一般来说都是小乘根性的人，没有发大乘菩提心，不用读诵大乘经典。中品上生，到极乐世界直接见佛，闻法即成为三明六通的大阿罗汉，位同舍利弗、目犍连等。中品中生，在莲花里住极乐世界的七天，从莲花里出来后，证得初果，再经过极乐世界的半劫时间，成为四果罗汉。中品下生，在莲花里住极乐世界的二十一天，从莲花出来后，闻法证初果，再经过极乐世界的一小劫，证得四果罗汉，以佛力加持，永远不入无余涅槃，回心修大乘佛法。</p><p>下品往生都是造大恶业者，住在极乐世界的莲花里的时间极长。</p><p>二、世尊在阿弥陀经中说，众生往生极乐世界以后，在莲花里听闻苦、空、无常、无我法，苦集灭道四圣谛法，花鸟树木都同时演畅苦、空、无常、无我。在极乐世界里为什么也要学四圣谛法？ 与我们娑婆世界释迦佛讲的四圣谛是不是一样的内容？ 当然是一样的，因为佛佛道同，法法不二。四圣谛法是佛法中的最基础，是入门之法，所有学佛者都必须要修证，以降伏自我，断除我见和我执。</p><p>在极乐世界莲花里，熏习苦谛，让众生感受五阴自身的苦，是不非常容易的，因为极乐世界都是乐，太享福了，以至于很难体会到五阴苦。在娑婆世界里苦乐兼半，众生还不能体会到苦，不能产生出离生死轮回的心，何况在极乐世界熏习苦谛，熏习苦空无常无我法，更难感受到苦，更不容易生起出离心。所以在莲花里住很久很久的时间，慢慢熏习，什么时候熏习成功了，有了暖相，心里烦恼性障降伏一些了，不再造恶业了，才能从莲花里出来，闻佛或者是菩萨或者化佛化菩萨说法，之后再开悟和证果。</p><p>极乐世界一天就等于娑婆世界的一大劫，中品中生，住七天，不能出到莲花外面去，不能自由自在到各处见法和菩萨。为什么不能随便走动呢？ 因为娑婆世界的念佛人还没有降伏性障烦恼，如果在极乐世界随便活动，那就会到处造恶业，不久就把极乐世界搞得像娑婆世界一样，那就糟糕了。所以没有降伏烦恼的人不能随便活动，就住在莲花宫殿中熏习四圣谛，烦恼降伏了，才能出来到十方世界供养十方诸佛。</p><p>烦恼的降伏需要极乐世界的七天到二十一天，甚至十二大劫。极乐世界过一天，娑婆世界就已经成住坏空一个周期了。出莲花以后，听闻阿弥陀佛或者佛的化身讲法，才能证小乘的初果到四果。那我们在娑婆世界，学习四圣谛，如果很用功的话，几年时间就能证果，降伏烦恼也很快。如果只是念佛，什么法也不学，到极乐世界再学，多长时间才能学好呢？ 在娑婆修学菩萨六度，即使修三十年，条件满足，就能明心见性，再去极乐世界，就是地上的大菩萨了，然后不离极乐而回娑婆。</p><p>在各个世界修学佛法，有利也有弊。快乐的世界劫长，苦的世界劫短。在娑婆，如果没有降伏烦恼，一不小心，就会造业，下三恶道受苦。但是我们如果修学了正确的佛法，明理就很快，明理以后，就容易降伏烦恼，烦恼降伏下来，我们就轻松自在了，到哪里都可以自由自在。信受因果很重要，我们每天每时每刻的身口意行，造作的同时，第八识就存下来，将来要实现因果律则，就有果报。懂因果，有定力，降伏烦恼修行就能很快。而修学正确的大乘法，尤其是明心见性法，就能识因达果，不敢再造恶行。所以我们应该努力学法，明心见性以后，十方世界我们就能随意往生！</p><p>三、往生极乐世界可能比证小乘初果还难。因为往生是有条件的，要具足深信、愿、行三资粮，要福德具足，因缘具足，三福净业成就，临终心不散乱，又不颠倒，这几条做到实不容易。末法众生福薄定浅，烦恼习气业染都重，心识散乱。现代社会五欲炽盛，众生意根对世俗法的攀缘太重，无论怎样念佛，心也不离染。平时念佛心都是散乱的，何况临终时四大分解，如活龟剥壳，那么痛苦。即使有预知时至者，在阿弥陀佛即将要接引时，突然一念是娑婆，那么心就被锁在娑婆，极乐世界就没份。</p><p>例如有一个预知时至的女居士，五十多岁，佛告诉她某日中午十二点来接她，她知道后，告诉寺院师父要到寺院里往生，以此表法，让众生都信受。往生那天，很多居士都到寺院观看她往生，大家为她念佛送往生，而她为了表法，已经分心有杂念，不是一心念佛了，结果到了十二点，佛没有来，又接着念佛好长时间，佛还是没有来接，于是她只好收拾包裹，回家接着在娑婆世界念佛修行，这是真实的事例，绝非虚构。</p><p>所以在临终时能够一心不乱，放得下世间事，没有证三果离贪爱的人，很难做到。那么平时只念佛，不知五阴虚妄，不知万法虚妄，没有降伏烦恼，心中还是贪爱炽盛，放不下的事情非常多，到临终时就更不能放下娑婆世界的缘，一心求往生。现见很多念佛人年龄越大越贪恋家亲眷属和财物，即使病得很重。如果告诉他：放下求往生吧！他就说，我还没有修好呢，等我修好了，再求往生；或者说我还有事情没有处理完，等处理完了，再求往生，种种借口非常多。那这样的话，到临终时，心中都是娑婆，怎么可能往生极乐世界呢？</p><p>而在娑婆世界学阿含经修四圣谛，断我见，成为小乘初果，相对来说比较容易。因为证小乘罗汉果不需要太多的福德，定力只要未到地定或者再浅些就好，守持好五戒，也不需要断贪爱，只要对五阴生起厌心，观行出五阴十八界的虚妄、无常无我性就行。有几年时间就够了，再长点时间，二十年也足够了，证完初果，往生极乐世界就是中品上生，到极乐世界直接见佛，不在莲花宫殿里包裹着，马上就是三明六通的四果大阿罗汉，与舍利弗、目健连相等。然后在佛的加持下，永不入涅槃，修学大乘，十方世界随意游行，供养十方诸佛，随十方诸佛修学佛法。</p><p>所以我们学佛修行，一定要看佛在世时都讲了什么，具体要我们如何修行，不要只听一个人的见解，不要只看一部经，综合起来全面看佛究竟让我们如何修行。世尊给我们留下的三藏十二部经典，适合娑婆世界一万二千年当中的众生的根基，我们通过努力是能够修好的，应该对自己有信心，对三宝有信心。修行戒定慧三无漏学，集聚福德资粮，按照所发的四弘誓愿，精进修行，不违誓愿，广行无量善法，自利利人。以修行的殊胜功德和清净大愿，高品位往生极乐世界，然后不离极乐，回入娑婆，广度众生，早日共同成就佛道。</p><p>四、末法时期，如果按照观无量寿经的观行修行，其成就很快很稳妥。如果有相关的比较详细的极乐世界宝藏图作为观想引导，我们大家就能从第一观一直观到第十六观。观到第三观成就，保证必往生极乐世界，比预知时至要可靠稳妥得多，而且禅定永远不失，佛力永远加持。到第三观成就时，禅定非常好，三恶道的业就消除了，不会再因业障而下三恶道，禅定也不会退失，因此必往生。</p><p>到第七观必明心证悟，有佛力加持，不可能解悟，只能证悟，到极乐世界，其果报殊胜无比。自己修行的禅定，因为业力和无明，遇缘就会退失。有佛力加持的禅定，永远不会退失。第三观以后就是这样。</p><p>五、佛国净土或者极乐世界生活和工作方式是怎样的 </p><p>类似极乐世界的净土里，如果还有日常生活，还有工作，那就是像娑婆世界一样在家人的世间国土，也就不是净土了，众生必然有贪嗔痴烦恼，必然要分出家人和在家人两大部分，与娑婆世界没有差别了。</p><p>因为在清静佛国土里，一切都是变化而有，不用劳作，不用生活和工作，人心才能清静无染，没有私欲，没有男女，没有家，无比清静，也就没有出家在家之别，全体都是修行人。只有类似娑婆世界，有男女之分，有家室之累，需要工作生活，才有出家在家之别。因此佛制娑婆世界以出家僧为主，带领大众修行佛法，佛教由出家僧住持，佛法由出家僧弘传。佛临涅槃时，在家的大菩萨们要求继承佛法藏，替佛弘法，佛不许，令出家僧团替佛弘法，护持佛法三藏十二部。</p><p>清静佛国土以及天界，众生不分男女，也没有家庭，因此都是出家修行人，不用再出家。没有家，何谈出家？净土里的众生以及各大菩萨，一直到等觉菩萨，都没有家，所现相，都不分男女，因此他们都不用出家，不用现出家相，全部是出家僧，而且是菩萨僧。因此他们都不用剔光头，都不用穿僧衣，都不用受守出家戒。</p><p>六、平时心没有降伏，贪念不断，嗔念不绝，临终就能放舍一切，不沾染一丝，不带走一片，干干净净，无牵无挂的往生极乐世界，是否可能？</p><p>实话告诉大家：往生极乐世界，比断我见还难。临终一念娑婆，一念牵挂，一念不舍，一念不忍，一念嗔，这一辈子所修，仅仅是种个善根，极乐世界不要想，接着在娑婆世界生死流转，能继续在人身上流转也难。非想非非想天人的心清净不？临终恶业缘熟，照样入地狱，何况欲界人中，恶緣那么多，临终很多由业缘业力说了算，不由人平时主观的想法说了算。预知时至的人照样留娑婆，还是一念为众生，为表法，不是为己。何况其他情况，冤亲债主一个个各种方式纠缠不清，扯不断理还乱，善恶缘都出现，谁能脱身？</p><p>说往生极乐世界不容易，有的人不服气。看看如今的人是如何念佛的，以什么心念佛的，心里都有什么愿力，抱着什么目的去极乐世界的，就会明白现在的念佛人命终能否去成极乐世界。翻开净土圣贤录，看看古人是如何念佛的，对比一下，就知道了现在的念佛人能否往生极乐世界。不要说求生极乐的人根器不好，即使参禅想明心开悟的人又是什么根器。守个五戒都那样困难，想吃素都没有条件，其它的就不要谈了。</p><p>都靠阿弥陀佛接引，那事情不是简单多了，一佛就能度尽天下所有众生，不用十方诸佛。有这样便宜事吗？一句佛号念到极乐世界，然后等着成佛，命终一手拉着极乐世界阿弥陀佛，一手拽着娑婆世界冤亲债主，就这样成佛了？这是不可能的。</p></div>"
},{
    "title": "第二章 菩萨篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  菩萨篇</strong></p><p>一、什么是菩萨呢？菩萨是不但自己本身已经觉悟，并且也要觉悟他人，既能自利也能利他，这样的人就称作菩萨。如果只想自己得利益，不管不顾他人的利益，心中只有自己，基本的菩萨品格还不具备，就不能称作菩萨。这样的人，大乘菩萨道这条路走起来很辛苦，菩萨道的修行就有很大的欠缺和阻碍。菩萨以发大誓愿广利有情，才能得到诸佛菩萨以及护法龙天的护佑，未来才能成就佛道。否则修到中途，障缘重重，就会堕到小乘当中。佛也发过无数的清净大愿，救度一切众生，希望一切众生都能得度，解脱到涅槃彼岸，菩萨们应该学佛的慈悲喜舍四无量心，道业才能不断的增进，最终成佛，成为无上正等觉。</p><p>学佛人要想脱离凡夫境界，就要不断降伏心性，发大心愿，修行菩萨道，使自己的心性逐渐地趋向圣贤，靠近圣贤人的心性，才能最终超凡入圣，成为圣贤。修行佛法，不能只在理论上用心，最主要还应该在自己的心地上用功，在降伏心性上用功，将来才能具备菩萨慈悲喜舍的大心量，成为真实义的菩萨摩诃萨，这是正修行。</p><p>二、菩萨是觉悟的有情，自利利人，如果不度众生就是罗汉心态，不是菩萨。菩萨通过度众生，一个是培植自己的福德，另一个是增长智慧。最重要的是，菩萨在成就佛道的过程中，要不断的与越来越多的众生结缘，才能拥有无量无边的各个层次的弟子，未来才能建立佛国土。菩萨要成佛，建立一个佛国土，要有无数各个层次的弟子拥护和配合，才能广度无量众生，没有弟子就是孤家寡人，也无法建立佛国土。而且自己的道业增进也要依赖弟子们。就像一个金字塔，自己是塔尖，没有底层，怎么有塔尖？这就是说度众生就是度自己，菩萨要无条件地度众生，才能成佛。反过来说，自己道业增进又离不开善知识、诸佛菩萨们的提拔和帮助，所以与真正的善知识结缘也是很重要的。</p><p>三、菩萨与阿罗汉的区别是，菩萨以发心为贵，因发心为度众生出离苦海，将来就能成就无上菩提，成为正等正觉。而阿罗汉只想个人得解脱，出离生死轮回，不考虑众生的生死苦，因此选择入无余涅槃，灰身泯智。</p><p>菩萨依所修证层次分为五十二个阶位，明心以后的菩萨，大小乘的果位同时得，因此就有初果菩萨，二果菩萨，三果菩萨，四果菩萨，所以菩萨明心以后也断见惑和思惑，但不把思惑都断尽，留下一点，以保证有未来世的五阴出生，才能继续自利利人，成就佛道。阿罗汉只能断尽见思惑，因为不追求明心见性，不想成佛，所以也不能断无始无明，不断尘沙惑，这些无明惑，只有菩萨才有能力断，断尽就成佛。</p><p>阿罗汉修出四禅八定，可以有神通三昧，但是他们的神通非常有限；而菩萨修出四禅八定也有神通三昧，而且还有无数的意生身，以此来利乐无数众生，菩萨的神通无量无边的广大，这是阿罗汉所无法比拟的。</p><p>四、留惑润生，意思是留一点思惑烦恼不断，以滋润未来世受生。如果烦恼全部断尽，意根对三界法一点也不留恋，那么命终就能像四果阿罗汉一样，灭掉五阴，入无余涅槃。菩萨明心以后，一直到八地菩萨之前，都要留一点思惑不断尽，因为有这点思惑，就能世世投生，有五藴身，才能继续修学佛法，自利利他。如果菩萨明心以后，把所有的思惑烦恼都断尽，就会像阿罗汉一样，寿尽就会灭掉五阴，入无余涅槃，那样就没有菩萨了，不能再继续修学佛法。</p><p>修到七地菩萨时，菩萨由于思惑烦恼都断尽了，禅定功夫非常好，能随时随地入灭尽定，因此一不小心就会入涅槃，佛就随时关照菩萨，以保证菩萨不入灭，顺利进入八地中修行。如果没有清净大愿来维系的话，地上菩萨很容易就入无余涅槃，这是因为禅定的功夫越来越好，对三界世间法越来越淡薄，到七地时，就念念想入涅槃。所以佛教导菩萨们在入初地时，都要发华严经中的十个无尽愿，这个愿一直到成佛都无止尽，因为这个愿力的缘故，就会世世投生不入灭，有五藴出生，就能广度无量众生，终至成就佛果。</p><p>五、义菩萨就是已经证得了义法、明心见性的真实义菩萨，已入见道位中，是七住位以上的菩萨。名菩萨，是有名无实的菩萨，还没有开悟，没有悟得真实法的菩萨，只是名义上的菩萨。义菩萨是久修的菩萨，其心行大异于名菩萨，善根福德非常深厚，智慧深利。</p><p>名菩萨多是新学菩萨，遇逆境容易退失道心，少有布施的习惯，菩萨六度还没有修习成就。久修菩萨广修菩萨六度，往往有很强的布施习惯，心里总想着利人，自私心性减少。所以久修菩萨福德大，学佛修行就能遇正法，不久就会悟道，而且能够自悟，不由他人帮助。久修菩萨往昔也当过名菩萨，名菩萨将来也会成为久修菩萨。</p><p>六、我们此生真想求明心见性，就要严格按照菩萨六度来修学。慧学方面，六百卷大般若经得涉猎读诵，稍通其理，尤其心经和金刚经。阿含经也能读诵就更好了，五阴虚妄不实之理能明了，证得五阴无我无实，有助于参禅，能快速悟入诸法实相。如果这时证得了小乘果位，就是菩萨五十二阶位的第六住位，与明心只差一个阶位，这时参禅，悟道是很快的，比不懂阿含，没有证果的人快得多，而且不会悟错，不把意识心的各种境界当作第八识来悟，也不会悟个一无所有的空就认为是究竟。</p><p>而且懂阿含经，还为以后的菩萨道修行打下坚实的基础。大小乘理都通了，才能入初地，以后在三、四地菩萨位，还会重新观行小乘的四圣谛和十二因缘法。现在的修学，不管懂不懂，证不证，都作为种子存在如来藏里，将来遇缘都会开花结果；但是懂和不懂，存到如来藏里的种子是不一样的，所以佛法没有白学的。即使畜生听不懂佛法，听了佛法以后，也会种在牠的如来藏里，将来遇到佛法，就会欢喜接受。</p><p>在定学方面，要修到未到地定，欲界最高定，行走坐卧都能参禅、思惟佛法心不散乱，心思细密，才能入道。戒律方面，一定要受菩萨戒，有了菩萨戒，才能发起菩提大愿，发起成佛利乐众生之心。守持菩萨戒，有诸佛菩萨护法神护持，道业进步会很快。</p><p>忍辱方面，主要是对如来藏法的认同而不谤，忍于如来藏的不生不灭等中道之理，才能慢慢与如来藏相应，最后悟得如来藏。布施方面，主要在大乘法的布施，有宣传大乘法的道场和出家师父，必须辅助其宣传，维护其利益，这样集福是很快的，福德也是最大的。就像种田，想收成什么，就在什么田里种相应的种子，种错田地和种子，不收相应的果实。精进方面，对以上的修学都要精进不懈，努力去做。整个修学过程就是修菩萨六度，相对具足了，才能明心悟道。</p><p>七、如何做好菩萨</p><p>要想修行快速，做个好菩萨，与人说话就要柔和，不要言辞犀利、咄咄逼人，应该善和诤讼，尽量凝聚和摄受众生。菩萨四摄法应该尽量做到，摄受众生为第一，树敌为做菩萨的大忌。菩萨眼中应该没有敌对，所有众生都是被自己摄受的对象，所以不要把道场当战场，舌辩不休，争个输赢胜负，我高你低，我强他弱。</p><p>每个人内心当中的我，要严格看管，不要总是锋芒毕露，以强壮的我心去触恼他人，要善于降伏自我，隐匿自我；调伏烦恼，是真正的修行，而不是总想降伏他人，打压他人。菩萨心性要柔和，对他人要动之以情，晓之以理，不应该得理不饶人，有时让人一步，反而更能折服摄受他人。</p><p>度人和修行都是要刚柔相济，对己刚，对恶劣的境遇刚，而对人则要尽量的柔，这样才能把众生都能摄受到自己的周围，与众生打成一片。如果说话拒人于千里之外，只能让众生远离，与众生疏远，不能与众生结善缘，这样则不是一个合格的菩萨，也无法摄受众生。</p><p>心性刚，则易断而卒暴；心性柔，则虽弯而不折，作菩萨，应该有弹性，既能够随弯就弯，又能拉回原位保持不变异。菩萨本应该善于调和各种诤讼，不应该常常引起纷争不休。学着作好菩萨，柔顺调和，学会摄受众生，是每个菩萨必修的课程。得理不饶人，是菩萨的大忌，言辞犀利、咄咄逼人，是菩萨的大忌，违犯则违远众生，与众生结恶缘，则违犯菩萨四摄法。</p><p>八、菩萨与众生的关系</p><p>弥勒佛下生时，第一会说法，有九十六亿人天得道，听法者更是无计其数。第二会讲法，九十四亿人天得度，第三会讲法，九十二亿人天得度。其听法者，都是无计其数。</p><p> 佛菩萨永远不嫌学法众生多，都是希望所度众生多多益善，因为慈悯众生的苦难，悲悯众生的生死流浪苦，所以菩萨都是以大悲心广传佛法，尽量度脱更多的众生。菩萨抱着春蚕到死丝方尽，蜡炬成灰泪始干的自我牺牲精神，燃烧自己，照亮众生。我们怎么能不感激菩萨，向菩萨们看齐致敬呢。如果没有菩萨住世传法，世界永远不会有佛法，众生永远没有得遇佛法，求得解脱的机会。</p><p>菩萨是可敬可赞的，阿罗汉则不完全是。佛从来不承认阿罗汉是自己的真佛子，因为他们不懂得报佛恩，不报众生恩，只管个人解脱，离苦得乐，缺少慈悲心，所以佛常常呵责他们是焦芽败种。从这点来看，大乘法永远殊胜于小乘法，心量更大故，真实利益众生故，慈悯于众生故。</p><p>众生修到七八地菩萨时，那个我性才能完全消融，那时就不会搞派别和争斗，不会突显自我了。我们看诸佛都是互赞，互相推荐的，甚至佛要以菩萨的身份，倒驾慈航来护持其他诸佛弘法，不怕降低身份，只要能度脱众生，佛佛都是互相合作，互赞互助。文殊菩萨本来应该早就成佛了，而不取佛位，专门辅助諸佛弘法，作佛的助手，而不争夺什么佛的荣耀，完全没有自我，诸佛菩萨都是我们学习的榜样。</p><p> 一切的争执，就是因为心中有我，我心不灭除，这个我当然总是要出来兴风作浪，让天下不太平。 所以学佛的终极目标是，要彻底打倒自己，打倒那个所谓的我，把自己消灭无余，才能最终成佛。学佛其实就是与自己斗，不是向外斗，斗别人不如斗自己，把自己斗败了，斗没有了，生死也就大自在了。这些说起来容易，要做起来，实在是太难太难了。这个时代，佛法还是太少了，学佛的众生太多了，传法的力量其实是非常不足的。众生需要更多的菩萨来解救，菩萨的众生缘不同，众生的菩萨缘不同，所以菩萨们之间不能互相代替。</p><p>菩萨没有恶缘，就无法除去烦恼；没有恶缘，也不能灭除业障。菩萨没有众生，当然不能成为菩萨，菩萨没有弟子可度，无法增长自己的道业。不度众生，确实不能成就自己的道业，菩萨所获得的智慧，都是在度众生当中出生和增长的。没有众生的磨砺，菩萨的智慧无法长进。就像真妄和合互相依赖一样，菩萨与众生确实是互相依赖的关系，没此就没彼。很多人学佛不发大心，自私自利，不考虑众生苦，结果自己的道业很难增进，长期都是在原地踏步。不度众生，不能成佛，是众生成就了每一尊佛，佛又回头帮助每个众生出离生死深渊，其实都是互利互惠的，没有单独得来的好事。 </p><p>时常观察自己的苦，同时也要观察众生苦，见到自己和众生的苦，应该发起慈悯众生的心，发起与众生一起得解脱的心，这就是发菩提心。有了这个心，诸佛菩萨加持，自己道业增进，佛道才能勇往直前。</p><p>九、地上菩萨是否没有苦受了</p><p>有身皆苦，四果罗汉在世间生存时，叫作有余依涅槃，意思是说，还有余苦可依色身而现行，阿罗汉就要感受这些余苦。阿罗汉的身体仍然能感受到疼痛、冷热、风吹日晒、蚊虫叮咬，仍然能够感觉饥饱、渴饿、疲乏，和色身的各种疾病痛苦。罗汉涅槃以后叫做无余依涅槃，就是说已经没有色身，没有识心，任何的苦受都找不到他了。</p><p>初地以上的菩萨到七地菩萨为止，在小乘的果位就相当于四果慧解脱的阿罗汉，只要有色身的存在，就会感受到苦。但是菩萨心里的感受要远比普通人轻微很多，不在意的事情非常多，在世俗法上已经没有什么追求了，感受的苦就轻微，极大部分是在佛法上的追求。在教导众生上还是有很多苦受的，尤其在五浊恶世里，众生刚鄙难调，烦恼深重，根性低劣，不分别正邪好坏，菩萨们就要费尽心力，因此就免不了有一些苦受。释迦佛在世时，因为雪山苦行，背部受了风寒，也为众生示现背痛，示现有微苦。</p><p>十、菩萨的心行，众生不可揣度，尤其行密行的菩萨，其心行众生不能解。比如释迦佛在作菩萨时曾经杀过一个人，这个人在坐船时要杀船上的五百菩萨，佛知道后，为了保护这个人不下无间地狱，以极重的慈悲心杀了他，免得造地狱业，而宁愿自己因此下地狱受苦报。还有一些事例，说明佛菩萨度众生的慈悲善巧方便，不能一一都说出来，否则有烦恼心重的众生也以此为借口，而造恶业。</p><p>看一个人是善还是恶，不能只看一个人当时的外表行为，主要看一个人的心行和心地，看他作事的目的是什么，能达到什么样的结果。这样的智慧，普通人一般不具备，大菩萨们能掌握分寸和火候，能善知取舍和方便。众生只能看到表面的现象，看不到其实质，不知其真实的目的。所以很多事，菩萨不能明白告诉众生，因为众生无法理解，智慧浅陋故。</p><p>菩萨为了度众生，潜伏在众生当中，化作屠夫身、妓女身、嫖客身、赌徒身与众生厮混，目的就是要把众生救出生死火坑。只要能救度众生，菩萨不惜抹黑自己，不惜众生的误解和误会，不惜付出一切代价，有几人能看到菩萨的慈悲、忍辱负重的心行？</p><p>十一、顺生死流者凡夫，逆生死流者阿罗汉，不顺不逆者菩萨，到彼岸者佛。对于生死流，菩萨的态度是，不顺不逆。因为顺生死流，菩萨流转很苦，不能自度，焉能度他；逆生死流的话，必须舍弃生死，像阿罗汉一样入无余涅槃，那样就没有色身五阴了，自己不仅不能继续修学，成就佛道，也不能广度众生，这样就违背了自己的誓愿。所以菩萨对于生死，不逆不顺。</p><p>十二、菩萨修行的三观次序是空、假、中。空观是，观一切法，都是生灭空幻的，证得一切法空。以此空观为基础，继续进修，证得第八识以后，就观一切法都是第八识所变现出来的，因此一切法都是假，都是第八识幻化出来的。再以此为基础，继续进修，观一切法都是第八识的有为功用，并没有一切法，都是第八识，一切法全体即真如，十方世界即是一真法界，到此，则佛果已圆，佛道已成，佛道则全部走完，佛法全部修尽，就成为大乘的无学。</p><p>十三、对于波旬那样的坏孩子，师父也是一边呵责，一边手摸他头拍他肩，告诉他听话乖乖点，你将来也要作佛成佛的，不要再捣乱了。看在众生都能成佛的份上，看在众生苦的份上，菩萨一边现凶悍相，一边慈心满满，柔肠千转。</p><p>修出慈悲心的菩萨，看到众生的坏乱相，一边叹气怜悯众生愚痴，一边心如虚空一样包容一切。内心不仅广阔无边，也柔软异常。现在我心轻柔无比，也非常喜欢爱捣蛋的坏家伙，因为从小就与那些调皮捣蛋的小家伙们打交道，我并不讨厌他们。</p><p>再者说，一个菩萨应该有所觉悟，知一切法为如来藏所化，实际上也没有一切法，都是如来藏的空相和空性，躲在如来藏里享受清凉，该有多自在，多舒坦？这两天就有弟子说，赶快找到如来藏，然后躲在如来藏里享受清凉寂静，心里没有一切的是非纷扰相。</p><p>诸法无行经，行是运行运转出现的意思，诸法实际上都没有其实，没有运转。为什么如此？一切法都是涅槃相，寂静无所作为，不生不灭，无系无缚，也无解脱，常自寂静犹如虚空。</p><p>一切法都是如来藏相，见如来藏，则不见一切法，是则躲在如来藏里。什么法不是如来藏？全部是如来藏空性。因此没有三界世俗法相，没有善恶相，没有坏乱相，没有对立相。菩萨常游毕竟空，心常在定无所着。若有所着，则非菩萨，若见一切好恶相，则非菩萨。因此我心轻柔，柔软至极，无以言表。</p><p>十四、明心以后，就是真正的大乘菩萨了，如果心性在明心之前没有得到真正扭转，还不具备合格的大乘菩萨的心性，那很难或者说不能成为真正的大乘菩萨。菩萨就应该有菩萨格，人应该有人格，佛有佛格，其心性都应该与其果位相应，这才是正常。否则就是假菩萨，假佛。人格不具备的人，也不是完整的人，不是真正意义的人。</p><p>十五、菩萨无量劫受学于十方诸佛菩萨，讲法讲对的部分属于十方诸佛的法，错误部分属于自己修证还不完善的法。佛法不能归于一尊佛所有，更不能归于某位菩萨所有，凡夫更不能有佛法。有佛法的是佛，有菩萨法的是菩萨，有凡夫法的是凡夫。各层次的人有各层次的法，所以每个人应该发大心，早日具足佛法 ，才能早日成佛。</p><p>十六、对于法的观察，最究竟的是佛，菩萨悟后的观察都不能彻底究竟，程度都不够。所以菩萨的证悟分为无数层次，不可能顿时悟得所有的法，也不可能都能悟到最彻底。菩萨的福德不同，禅定不同，智慧不同，所悟的层次就不同。到一定时候，如果菩萨不修四禅八定，以后的法就不能悟到，受限制了。极大多数佛法还是通过极深的禅定来悟的。</p><p>有一些人偏偏要否定禅定的作用，菩萨不修禅定，道业根本不能增进，卡在某个阶位，卡在某个层次上过不去。细法和极细法必须有禅定神通的配合，才能证得，才能完全证得。甚深的智慧也是在极深的禅定和神通的配合下证得的。</p><p>十七、菩萨同时也是阿罗汉，也有阿罗汉的行持，也要有禅定，也要心清净无烦恼，也要有解脱智慧。菩萨的行持只会高于阿罗汉，不会低于阿罗汉，阿罗汉的品德菩萨都要具备，除了不想入无余涅槃，这才是真正的大菩萨。如果一个菩萨烦恼非常重，当然就不如阿罗汉，也不如初果须陀洹，那就不是真正的菩萨。</p><p>十八、菩萨如何降伏性障烦恼如阿罗汉</p><p>菩萨要想永伏性障如阿罗汉，必须具备初禅的定力，才有能力断除贪嗔痴烦恼，之后三界里的四住地无明烦恼能够断尽而不断尽，只留一点轻微的思惑烦恼不断，叫作永伏性障如阿罗汉，修到这时已经是初地满心菩萨了。如果没有初禅定，一点烦恼都不能断，最多只是暂时伏住，与初地菩萨的伏性障差别极大。初地菩萨的伏性障烦恼如阿罗汉，那是在具备初禅以上定力的条件下，把贪嗔痴慢疑邪见都断除了，四住地无明还留一点点，不能都断尽；如果都断尽了，就会入无余涅槃，因此菩萨是能断而不断，故意留着，叫作留惑润生。</p><p>如果在菩萨的道路上继续往上进修，悟后必须要修初禅定；有初禅定才能断贪嗔痴烦恼，才能成为三果人；三果四果人才有能力入初地，入初地以后，就能永伏性障如阿罗汉。这是菩萨必须要走的路，绕不过去，今世不这样走，来世早晚都得这样走，否则就不能证得三果，更不能进入初地。禅定是个硬指标，再难也得修，没有禅定谈不上什么果位。各种果位的施设都是有相应标准的，没有相应的定就谈不到相应的慧，定慧一体，定慧等持。</p><p>佛所说的戒定慧三无漏学，是修行的总持。我们不能不要戒，也不能不受戒不持戒就直接修慧，也不能不要定、不修定而直接修慧。没有戒就没有定力的发起，没有定力就没有真正智慧的生起。没有定水滋润，即使有慧也是浅慧和乾慧，没有内心的真实受用，不能降伏贪嗔痴烦恼；而不能断掉贪嗔痴烦恼，就没有解脱的功德受用。尤其在这个污浊的末法时代，我们修行一定不能废弃和违背佛陀的教导，严格按照佛陀所说的三无漏学修行，才能有所成就。悟前修行三无漏学，悟后也要修行三无漏学，地上菩萨仍要修行三无漏学，这样才能快速地圆满成就一切法，早日成佛。</p><p>十九、菩萨不能如阿罗汉一样断尽思惑烦恼</p><p>一念无明包括见一处住地烦恼、欲界爱、色界爱、无色界爱。菩萨不把一念无明都断尽，而是要留惑润生。惑，是迷惑，是痴业，是无明，小乘主要是指贪嗔痴慢疑等等思想观念上的迷惑颠倒；见，是见惑，是我见，是知见上的迷惑颠倒。一念无明全部断尽的人就是四果人，在大乘当中相当于八地菩萨，菩萨入初地时，小乘的果位接近于四果人，到初地满心时，完全可以灭掉一念无明，断尽我执，成为真正的四果人。但是菩萨在八地之前，不可以把我执断尽，不可以把一念无明断尽，否则就要出三界入无余涅槃，这样就没有五蕴身来自利利他，也不能成佛。所以菩萨要发十个无尽大愿，永远利乐众生无有穷尽，不能出离三界逃避苦难，因此菩萨在没有断尽我执的时候就开始断法执。</p><p>菩萨为了广度众生，不入无余涅槃，就要把见惑都断尽，只留一点点的思惑烦恼不断尽。应该留什么样的思惑烦恼为合适？应该留最轻微的思惑烦恼，也就是无色界爱，可以轻微贪着一点无色界的禅定境界，以保证自己不入涅槃，世世保有色身，自利利他。或者保有对佛法的贪爱，依此种贪，就会留在三界，继续修行佛法。如果保留欲界的贪爱烦恼，就能严重的障道，不仅要失去初禅定，也会退失三果的证量，退失初地的功德，所以地上菩萨一定是把欲界爱断得非常彻底，不能留一点点，欲界贪和嗔恚必须彻底断除，慢心也要断除，只可以保留无色界对禅定的贪，或者保留对佛法的贪爱不断，其它的惑业烦恼都要断尽。到六七地菩萨时，对无色界的禅定贪爱也要断除，道业才能增进，只有对成佛之法的精进追求，才能保证不入无余涅槃。</p><p>初地菩萨开始证得一分无生法忍慧，能用妙观察智观察蕴处界和合产生的法当中是无我无我所的。众生还没有修到有妙观察智的时候，没有能力观察和证得法无我，也就没有能力断除法我执。初地菩萨因为要留惑润生，世世保有五蕴身在世间自利利他，因此不能完全把我执断尽，否则就会出三界，但是这时却开始断法执了。初地菩萨修学百法明门以后，证得蕴处界和合而生的百法当中无我无我所，然后进入二地修行破除俱生法执，法执断尽，就是十地、等觉菩萨。</p><p>二十、菩萨是觉有情，自己本身就是一个有觉悟的有情。然后，再去觉悟其他有情，不仅自利，还要利他。菩萨也是大心众生，不为个人得安乐，但愿众生得离苦，心量宽宏大度，包容一切。就像弥勒菩萨，大肚能容天下难容之事。在真正的菩萨眼中，没有是非，没有对立，内心通达，不与一切人事物作怨对。菩萨看一切都是自己，都是自心的影像，心外无物。菩萨眼中没有恶人，只有因缘不成熟，暂时还教化不了的众生。</p><p>菩萨观众生，不看表面的善恶，着重于实质，看善根，看潜能，看福德，看因缘，看智慧。观音菩萨常常变化各种形像，来度化众生。但他度化的众生，并不一定是表面的善人，而是因缘成熟的人。因缘成熟的人，即使表面恶，善根却是无比深厚。度过来以后，造善的力度却强于小善人百千万倍，甚至无量倍。《楞严经》中一个淫女，被世尊度化为四果阿罗汉，那些善人们却还是凡夫一个；勇施比丘犯重戒，却被世尊度化为开悟的大菩萨，那些持戒比丘仍然是凡夫。唐朝时有个猎手，经常杀鹿，出家因缘成熟时，遇到禅师，禅师几句对话，度为比丘修道，不久即明心悟道。</p><p>所以善恶这些事很难说，众生的根性也很难说。很多时候，被看作恶人的人，由于善根深厚，智慧高，遇缘修行，非常快速；而心性不通的小善人们，却在后面紧追，也无法追得上。佛说智慧解脱，智慧成佛；心性通达，包容一切，即是智慧。</p><p>看看我们的如来藏，从来不与一法作对，从来都是包容一切人事物，不管善恶是非好坏，众生做什么都可以，全都随顺过去。众生上天，随顺上天；众生入地，随顺入地。这样，祂就能圆满地成就了一切法。哪一法，祂都能现出来，毫无滞碍。祂遇直则直，遇曲则曲，遇方则方，遇圆则圆；心性刚直，不妨随弯就弯。这样，祂才能永不卒暴，永不被催碎，永不生灭。心性通达，就有无量福德和智慧德能。</p><p>二十一、世俗人的爱，都是以小我个人某种利益为前提的，如果个人没有这种利益的保障，那种所谓的爱就会消失，或者化为仇恨。而佛菩萨的大爱，却是无我无私的，是为了众生得利益的，所以才能愿意为佛教为众生付出一切代价，而不在意众生的诽谤和无理取闹。</p></div>"
},{
    "title": "第三章 阿罗汉篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  阿罗汉篇</strong></p><p>一、众生界不增不减，阿罗汉入涅槃不断灭</p><p>佛说阿罗汉只断烦恼的现行，不断习气，习气是从初地菩萨开始断，到七地满心才能断完。八地菩萨已经没有烦恼习气了，但还有尘沙无明没有断尽，断尽即成佛。大迦叶是俱解脱大阿罗汉，闻乐还起舞，这是习气，不是烦恼的现行。难陀比丘是大阿罗汉，讲法时眼睛先看女众，后看男众，这是习气，不是烦恼的现行。还有位阿罗汉，叫恒河女神为小俾，这是慢习，不是我慢的现行。这些习气阿罗汉们还没有能力断除，也照样能入涅槃，但不能成佛。</p><p>因为他们无始无明和尘沙无明都没有破除，没有证得法界实相，就是说还有愚痴，法界之理不懂的还非常多。世尊慈悲，在他们入涅槃前，特意在他们心中种大乘种子，有了这个种子，因缘成熟时，种子发芽，阿赖耶识又会生出六根，又产生几个识心出来，五蕴十八界具足。出生以后，由于大乘种子的作用，他们就会寻求明心见性，继而开悟证得实相。所以阿罗汉不等于佛，远远不如佛世尊。有一法不知就不是佛。佛的名称是一切种智，阿罗汉是一切智，没有种这个字，就是还不懂阿赖耶识的种子功能作用，要成就佛道还得要很久远很久远，如果不入涅槃，回心大乘道，还能快些。</p><p>涅槃是灭尽五蕴十八界一切法，佛为什么还要给他们种种子呢？这个种子如果种到七个识心里，而七个识心是都要灭的，种种子还有什么用处呢？肯定涅槃当中有不灭的，佛才这样良苦用心。当然是阿罗汉的第八识不灭，种子种到那里去，有朝一日才会发芽结果，阿罗汉就从涅槃中出来，有个色身继续修行。</p><p>佛说过众生界不增不减，如果阿罗汉涅槃后，一无所有，第八识心也不在了，这个众生就会永远消失了，众生界就会减少。那么有一个人入涅槃，法界就少一个众生，有无数人入涅槃，法界就少了无数人；如果都学罗汉法入涅槃，就没有法界众生存在了，世界就是空无的。可能是这样吗？这样是与佛所说相违逆的。法界永远不增不减，众生数不会减少不会增加。阿罗汉入涅槃后，不是一无所有，不是断灭法。</p><p>佛的声闻弟子们随佛修学时，都是先知法住，后证涅槃，知道有一个法是常住不灭的，然后知道涅槃是灭掉五蕴十八界自己，都灭掉以后也不是断灭空，所以四果罗汉不害怕灭掉自己，敢于灭掉自己。这是有一定道理的，没有人愿意死后一了百了，一无所有了，众生都不愿意永远从法界当中消失。</p><p>二、三明六通的俱解脱大阿罗汉，三明：漏尽明、天眼明、宿命明。漏尽明是贪嗔痴慢疑恶见的烦恼现行全部断尽，没有见惑和思惑了；天眼明，发起天眼通，天上地下大千世界都能观察到；宿命明，能知自他前后各八万大劫事。六通：神足通、天眼通、天耳通、他心通、宿命通、漏尽通。外道只能得前五通，不能得漏尽通。俱解脱兼具慧解脱和定解脱，慧解脱，禅定达到初禅定，有解脱生死的智慧，以智慧出离三界；定解脱，有四禅八定和神通，没有解脱智，寿终能够依靠禅定出离三界，得到解脱，具有慧解脱和定解脱的两种功德，就是俱解脱的三明六通的大阿罗汉。</p><p>三、阿罗汉的修行结果是断我见、断我执、证罗汉果。通过修行四圣谛法，观行五阴十八界的虚妄，证得五阴十八界确实不是我，就断了五阴为我的错误知见，证初果；贪嗔痴非常淡薄时，成为二果；继而修出初禅定，断贪爱，断嗔恚，成为三果；断除我慢，断除对色界无色界的贪爱，断尽五阴的执著，就成为慧解脱的阿罗汉。</p><p>菩萨们的修行结果是明心见性，证得真心自性，从而一方面证得五阴十八界的虚妄，一方面知道第八识在五阴身中的运作，这样智慧就打开了，有了根本无分别智。刚开悟时的果位一般是住位菩萨，以后再证得如幻观，阳炎观，如梦观，成为十住位、十行位、十回向位，再证得一分无生法忍慧，就入初地，入如来家，成为圣人，之前都是贤人。如果前世很多世都悟过，今世再开悟，就不一定是第七住位，也许要高些。所以开悟时，每个人所悟深浅不一，悟的越深，果位越高。</p><p>要想明心开悟，成为大乘菩萨，就要修行菩萨六度。六度可以一度一度修行，也可以齐修，各个时期修行的重点应该有所不同，应该着重修最基础的以及比较薄弱的部分。如果布施和持戒两方面比较弱，应该重点修这两度，后边的也应该同时修；如果定力比较弱，也要练习禅定，加强定力。持戒方面，五戒和菩萨戒都要尽量受持，先皈依受五戒，守持好了，再受菩萨戒。最后一个般若度，般若的熏俢应该贯穿整个修行过程。</p><p>四、要想成佛，不能只想出离，那将来就像阿罗汉一样离开三界，不能成佛，众生也没有人救度。下定决心，命令自己必须舍弃一切，这就是阿罗汉只知自利的思想，舍弃一切，就没有五蕴在世间继续修行，也不能成就佛道。要想成佛，有一点出离心就够了，如果生起强烈的出离心，那就是走小乘路，将来必入涅槃，灭掉一切法，什么也不要了，那么就不能成佛。世界也不要，思想也不要，那就没有五蕴世间，没有修行的工具和环境了。把自己这颗心和外物全部舍弃，是舍弃修道的工具，那就不能成佛。</p><p>五、佛教中的果位，是以证得智慧的境界来划分的，因为是智慧解脱，智慧成佛。比如修习小乘的四圣谛法，断我见，获得人无我的智慧为初果，获得解脱的一切智的智慧为四果罗汉。中乘的缘觉修习十二因缘法，同样是证得人无我的智慧，但是这种无我的智慧要高于阿罗汉们。缘觉辟支佛修习因缘法，能够思惟推算到众生生老病死的根源和来源，根源是无明，来源是第八识。这个智慧要远远高于修四圣谛法的罗汉们，而且独觉佛还能够在没有佛和法住世的情况下，自己独自觉悟，智慧更是高深。</p><p>他们都是获得解脱，出离生死，但是智慧境界差异极大，所以中乘辟支佛的果位要高于小乘阿罗汉的果位。还有更高的大乘菩萨的果位，大乘菩萨们明心时，也证得了人无我智，不仅像缘觉们一样知道了众生的来源是第八识， 而且证得了第八识这个自性清净涅槃，这个智慧更高深，是声闻缘觉们所望尘莫及的。</p><p>大乘菩萨们不仅如声闻缘觉们一样证得人无我，还能证得法无我，不仅能够如声闻缘觉一样断除烦恼，还能够断除烦恼的习气。同样都是获得解脱，其智慧境界不可同日而语。大乘菩萨们不仅能像声闻缘觉一样断除分段生死，获得有余和无余涅槃，也能断除变易生死，最终达到无生死的大涅槃——佛地的无住处涅槃。那就是说菩萨们能够获得四种涅槃，声闻缘觉只能获得两种涅槃。菩萨的智慧深广无边， 所以获得大菩提果，声闻缘觉的智慧有限，所获得的是中菩提果和小菩提果。智慧是一切力量的来源。</p><p>六、阿罗汉涅槃以后，任何一个世俗法都不会留下，意根一灭，带走万法，都不存在了。剩下的第八识，没有任何相，佛眼也觑不见。既然除了第八识如来藏，都是不牢固的，不久住的，早晚要灭去，我们何必那么贪执，随缘度日有多好？</p><p>七、四果阿罗汉回到世俗界，就从四果退回到三果，重新出家远离世俗以后，又成为四果阿罗汉。四果阿罗汉能退，三果当然也能退。禅定也能消失，心行也会退。乃至于二果能退回初果。四果阿罗汉断除执著，还会退回，生起执著，何况三果。</p><p>佛经中有具体事例为证，没有证得那个果位，不能体会。身在低位看不明白高位，也评论不了高位。掌握事实真相，只有亲身体会。就像现在很多人，明明处于凡夫阶段，成天辩论佛地的境界，争得面红耳赤，都是纸上谈兵，毫无意义。</p><p>八、供养的含义比较广，奉持是供养，给与所需是供养，依教奉行是供养，尊重是供养，信受是供养，礼拜是供养，读诵是供养，忆念是供养，赞叹是供养。</p><p>阿罗汉断尽烦恼和我执，其心超越了欲界色界无色界，是世间第一，当然值得世间人天大众供养。菩萨断除烦恼，留惑润生，自利利他，舍己为众生，更值得人天大众供养。所有众生都应当供养佛菩萨和阿罗汉，只要有供养的能力，并且懂得供养。一条狗也可以供养佛菩萨和阿罗汉，狮子老虎都可以供养，做佛菩萨阿罗汉的侍卫和随从，尊重礼拜，听从教导，都是供养，得福无量。乃至于细菌为佛菩萨的饮食发酵，也是一种供养，只是细菌无知无心，其所得福甚微。鬼神更可以供养三宝，在三宝田地中种福，以乘三宝加持力而得脱恶道，获得解脱果。</p><p>九、当对境界没有贪时，就是三果人，已经断除了贪和嗔烦恼的现行。对境界没有执著时，就是四果阿罗汉，断除了意根的我执和对三界的贪爱。三果以前心再清净，也是压伏烦恼，不是断烦恼，烦恼藏在内心里，少有表现，但是重大事情出现时，一定藏不住，一定会表现出烦恼，让烦恼现行。能真正全面检查出自己烦恼的人，非常少，所以往往就认为自己没有烦恼了，或者是认为自己是二果了，其实离二果差得很远。</p><p>    十、阿罗汉因为灭除了三界世间的生死业种，不再留恋三界，命终时不仅灭掉五阴身，意根的思心所也不决定继续留存，如来藏就不再出生意根的识种子，于是意根就灭去，只剩下一个如来藏，成为了无余涅槃的那种状况。</p><p>如果阿罗汉在涅槃之前熏修了大乘佛法，听闻了佛陀讲的大乘经，一历耳根永为道种，大乘法的种子就种下了，存在如来藏里。阿罗汉的如来藏叫作异熟识，异熟识里的大乘种子早晚要成熟，要生根发芽。在无余涅槃里，异熟识一旦了别到大乘种子的缘熟了，异熟识就依缘而出生意根的识种子，意根就出生了，于是意根还是要有个色身作为依托，于是异熟识为祂出生了中阴身，在中阴身里，意根还是要想依托个真正的色身，于是就依业种和缘投胎，出生在三界中。长大以后，大乘法缘熟，就投身到大乘法的修学当中，生生世世作菩萨，最后终于成就佛道。</p></div>"
},{
    "title": "第四章 性障和烦恼篇(1)",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  性障和烦恼篇(1)</strong></p><p>一、我心我性的表现</p><p>众生的我心我性，从任何一个方面都能表现出来，即使是把自己全部伪装起来，总有露马脚之处，总有蛛丝马迹可寻，没有智慧的人看不出来，有智慧之人，从蛛丝马迹当中就能窥见此人的我心我性，况且现在的众生烦恼性都很粗重，流露出来远远不是蜘丝马迹那样淡薄微细。</p><p>所谓的我，可以分成很多层次，从小我私我到大我。有人单独把五阴十八界当作我和我所有的，因此而造业；有人稍微扩展一下，把自己的父母儿女家亲眷属当作我的一部分，因此而造业；有人把自己所在的一个小小的团体当作我的一部分，因此而造业；有人把一个地区当作我的一部分，因此而造业；有人把自己所在的国家当作是我的一部分，因此而造业。</p><p>为什么把国家团体当作我的一部分而造业呢？因为那里涉及到了自己的私人利益，没有自己的利益，一般人都不愿意去造业了，只有涉及到自己的利益时，才去造业，所以不管为了多大的团体造业，实际上还是为了自己，还是有个我心。</p><p>修到真正的无我，不是容易的，每个人总有些私欲，不是为了小我，就是为了大一点的我，因为大我里有小我的利益。众生往往不是为了金钱，就是为了权势；不是为了权势，就是为了名闻；不是为了名闻的人很少，就是为了更能说得出口的个人利益，比如佛法上福德、功德、眷属等等利益。总而言之，众生内心都是有个我，有的轻，有的重，有人隐藏的浅，有人隐藏的深，有人干脆不隐藏，真正无我，那是极少见的。</p><p>有些人外表的善，同时也正是大恶的表现，大恶表面好像是善的，表面能利益稍微多一些的人，看起来是善的，实际上还是恶，而且是大恶，因为他损害了更多人的利益。有人为了自己的国家觉得很光荣的上了战场，名义上是保卫自己的家园，可是却损害了他人的家园，自己的家园是家园，他人的家园难道就不是家园了吗？可是众生就不是这样看，只要与我有关的，就一定是正当的，不用考虑对方利益，一定要去做，于是就堂而皇之的造业。</p><p>有人认为做事只要是为了团体，就是无我的，可是这个团体里没有他，也没有他的利益，他就不能愿意无私的去做事去造业。如果说为了自己的团体做什么事都是善的话，那么如果损害了更多的团体和众生的利益，这个行为到底是善还是恶呢？那就是大恶。往往很多人外表的善，正隐藏着更大的恶，可是众生愚痴，不明此理，都是意根暗暗执我的外在表现。</p><p>众生往往都是以我为主，只要与我有关的，不管怎么样都要去维护，对错不管，实际上那就是非常强烈的我心我性，不管是哪种程度的我，只要涉及到了自己的利益，都是我心的表现。与我有关的都好，与我无关的都不好，这就是我心的表现，众生很多时候不能反观，也不愿意反观，因为智慧短浅，护己心极重之故。</p><p>二、如何破除情执增进道业</p><p>现在的众生情执都很深重，处处都要争个我高你低，我必须是最好最高的，我一定要第一，我的团体一定要第一，不仅要第一，还要唯一，只有我就行了，其他都不管不顾。学佛人中同样是如此，一点也不逊色于世俗人和团体。佛菩萨看众生看得很清楚，就是众生自己看不明白自己，没有反观力。凡是与我有关的，都好，这就是众生的情执心理，也是深重的我执习气。众生总是要不惜一切代价地维护自我和与自我有关的家亲眷属、大大小小的团体，根本就不考虑因果，不考虑后果，这是很难改变的深重情执心理，往往造业就是因为情执。</p><p>那咱们就要说说世界上有没有第一，谁是第一者。人外有人，天外有天，说的意思就是永远有比自己更优秀的人存在；除了佛，谁也不是第一，而且佛佛道同，也没有第一的佛，诸佛平等，都是无上尊，那么诸佛之间就没有第一第二之说了。菩萨是当不了第一的，总有比菩萨更高的更有智慧的人存在；凡夫就更当不了第一了，所以世间根本就没有什么好争的，越争越不能第一。因为心有所争，就已经落于下处了，只有完全不争者，其心高远而又空阔，才能达到顶峰，达到峰顶。</p><p>要想破除情执心理，就要依靠大智慧和禅定力，定下心来，深细思惟，就能知道一切法都是梦幻泡影，那还执著个什么。仔细想想，这个世界有什么，哪个是真实的，哪个值得去执著的，哪个值得去争的，哪个又值得去挂碍的。只有佛法值得用心，值得我们努力去付出，但是为了成佛去与人争，反而不能成佛，修行的速度就会缓慢下来，这样反倒耽误了自己成佛。除了成佛这件事，没有再值得执著和挂碍的，但是还是要把成佛的执著和挂碍都灭除掉，最后才能成佛。</p><p>三、什么是性障和烦恼习气</p><p>性障是心性方面的烦恼，与贪嗔痴相应，能障碍自己的道业；烦恼习气是意根无始劫以来所累积起来的惯性作用。四果罗汉只能断除贪嗔痴烦恼的现行，但是无法断除习气惯性，所以有时候习性还是要不经意发作出来，但是过去的非常快，内心不留痕迹，不会过去很长时间了还在生气和发火，或者内心记恨。</p><p>凡夫却是把烦恼都要现行出来，具体表现就是贪性的行为造作，嗔恚的行为造作，愚痴的行为造作，而且是内心的贪嗔痴烦恼性的直接体现和流露。习气就比如汽车刹车以后，按照惯性的作用还会往前跑一段路程，不是马上停止不动，但这个力量是比较小的，这段路程就是初地菩萨到八地菩萨之间的修行过程。初地之前都是烦恼的现行，烦恼没有断尽。三果之前，没有修到初禅定时，贪嗔痴烦恼都是压伏着，一点也没有断，初禅之后，才开始渐渐断烦恼。</p><p>没有明心见性，也没有证果的人，即使修出了四禅八定，烦恼也断不了，而是压伏着，将来禅定退失时，所有的烦恼还是要现行出来。所以说证果和明心见性的功德非常大，让众生将来就有能力断烦恼出离生死轮回苦，世世都非常自在。</p><p>四、性障烦恼影响福德</p><p>一个人好比一个磁场，能够影响周围的人事物，慈悲柔和的性体能带给周围一片祥和的氛围，能感化周围的一切，因此就会生出福德来。相反，贪嗔痴重，性情粗暴，就会扰乱了周围的磁场，扰乱了人心，让他人内心不安，那样就会消耗自己的福德。一个人禅定修不好，一个是因为福德不够，一个是因为贪心重，惦念的事情多，放不下，贪心重，念头就不断，就会影响禅定；再一个是因为嗔心重，嗔心重，内心也是有很多人事物摆不开，嗔心障碍禅定是最重的，尤其是不能得到初禅定。</p><p>佛说贪嗔痴这些性障障碍禅定，而慢心最障道，能障碍一切善法的生起。修行降伏烦恼是极其重要的，烦恼不仅障碍自己，也严重地影响了他人，影响了一个团体，影响周围的一切，损减自己的福德。性情柔顺的人，修养好，福德也大；福德大的人，道业就会快速进步。一个人的一张面孔，就是一个人的全部风水，从这里就能看出一个人的修为，一个人的心性；一个人的福德，一个人的性情，都会表露无遗的。</p><p>慢心这个东西根深蒂固，很难降伏，深细的我慢，四果罗汉才能断，四果以下都有慢。慢的表现不一定在表面，有些时候隐藏很深，眠藏在如来藏里，极大多数是没有机会表现出来，因为因缘还不成熟，慢的条件还不具备，自己各方面还没有特殊的地方，和其他人比，还不如人，慢心就不轻易显现。一旦条件成熟，自己稍微一点点资本，慢心马上就现行出来。即使自己远远不如人，没有慢的资本，也会显现慢心，比如一个乞丐过大街时，一辆林肯车开过来，鸣了几下喇叭，让他躲开。他无奈躲开了，车过去后，他就在背后骂道：开辆破车有什么牛的？等我有钱时，开的车比你的还豪华。这就是卑劣慢的表现，等他某生某世发达了，他的慢就会完完全全表现出来，这就是众生。当某些人在某一方面一旦得势，慢心不久就会出现，自己不一定能发现出来，一是心粗故，二是认为自己真的很不错。</p><p>烦恼这些东西根深蒂固，无量劫带过来，很难降伏，一旦降伏了，智慧快速增进，修行就非常的快。烦恼就是障道的因缘，遮蔽着自心，不见光明，愚痴无智，既不能正确的认识他人，也不能正确的认识自己。贪心着境界，嗔心障禅定，慢心障一切，尤其是遮蔽智慧的开启，这是最严重的。</p><p>这个世界如果是灾难频发，果物不收，那都与我们自己有关，战争频发，世界动乱，也和我们自己有关，都是自己的心所感召的，多检查自己的心，多检查自己的业障，多找自己的不是。人心动荡，贪嗔炽盛，国家就不太平，世界也随之不太平。把心修好了，世界一切都会发生改变，修行就能够改变一切。福人居福地，福地福人居，只要你有德有福，就不用害怕天灾人祸会降临到你头上，而且还能带给世界或者周围地方安乐和祥和。修行就是万能钥匙，没有打不开的心结，没有过不去的河。大家多多检查自己的心性吧！</p><p>五、烦恼的定义是什么</p><p>有人说，忧愁恐惧苦恼是烦恼，痛苦是烦恼，失意不如愿是烦恼，病苦是烦恼，内心不愉快是烦恼。那么快乐是不是烦恼呢？ 佛教里定义的烦恼是贪嗔痴慢疑恶见，是烦恼，这些烦恼是我们通过修行需要断除的，一旦断除就是三、四果人， 烦恼断尽，才能涅槃得清凉。如果严格定义烦恼，心不寂止、心不寂静就是烦恼。</p><p>快乐也是烦恼，很多时候的快乐就是贪爱烦恼的体现。快乐的时候，心喧闹不寂静，这时心散乱就没有办法思惟佛法，心不住在佛法上，法理不通，就不能得到法益。那么我们快乐一辈子又有什么益处呢？ 天人很快乐，他们一天时间就等于人间的几百年甚至几千年，可是因为快乐，时间过得很快，很快寿命就到期了，于是不得不托生到人间或者三恶道。当天人时，由于快乐而不愿意修学佛法，没有佛法的受益，白白地快乐了几千年。</p><p>所以我们学佛修行，不能只图快乐，要想办法多培养自己的福德资粮，戒定慧资粮，圆满这些资粮，我们才能够得到相应的道果，得到真正的法益。否则每天都是卖弄自己的口舌，说食不饱，佛法再好，也不是你的，即使本来是佛，你也只能当个凡夫，生死轮回不断。</p><p>六、众生的烦恼有下烦恼和上烦恼。下烦恼就是贪嗔痴慢疑恶见，这些烦恼四果罗汉就断尽了。上烦恼是开悟以后，修道位菩萨修证路上所应该断的，不与贪嗔痴烦恼相应的烦恼，初地以上菩萨慢慢开始断的。这个烦恼也叫尔焰，就是思考着怎样成佛，怎样修行道种智，怎样获得更大的智慧，怎样了知某些更深层次的法，怎样俢证各种观行，如何地地增上，如何取证佛果圆满菩提等等。也包括怎样破除外道法和邪法，怎样引领众生走上正路等等，而没有救度众生离开邪见之心，没有救度众生得解脱之心，不是真正意义上的菩萨，没有资格入初地进如来家。这些尔焰，是随修随生，随修随灭，不断灭去旧的，又不断生起新的。上烦恼断尽，才能成就佛道。</p><p>七、心里有不如理的想法应该隐藏起来，尽量不要说出来；如果不应该说的话，不如理的话都要明目张胆的说出来，表明内心烦恼非常重，克制不了，内心有个我，认为我很重要，别人应该要顺从我，都要以我为中心。随着修行的不断递进，烦恼应该逐渐轻微下来，内心里那些不如理的想法，也应该不要再出现，修行才有进步。如果内心这个我很严重的话，断我见就非常的困难。</p><p>修行就是要时时注意检查反观自己心中的那个我，是否每天每月都在减轻，都在缩小；如果还与从前一样的壮大，不可逆转，那么修行就没有得力，没有走上正轨。如果断我见觉得很难，那么明心就更困难，毕竟明心所需要的福德和各方面的条件要更高，要求菩萨的心性要更好。我心重的人，福德不容易集聚起来；无我的心与如来藏相应，将来菩萨道的修行就非常快速。</p><p>八、现在的众生贪嗔痴烦恼几乎都非常深重，但是众生却又不自知，可是贪嗔痴造成无边的恶业，未来基本上是要下三恶道的，再世为人的希望非常渺茫。众生因为有无明，才造作贪嗔痴业；而正是因为无明，都不知道那是恶业。人贵在有自知之明，不学佛法，不懂因果，就处在无明之中；或者学了佛法，仍然是不懂因果，不知道自己的一切身、口、意行都有果报，于是就任意妄为，丝毫不顾及后果。事情做的的对与错，自己的判断是不准确的，要依靠佛所讲的理来判断。众生无始劫以来广造恶业，轮回六道无有止息，得人身的机会微乎其微，因此都不会做人，不懂做人的道理，也不能反观自己的贪嗔痴烦恼。</p><p>众生无量劫得人身的机会，佛比喻说，犹如在一个汹涌奔腾的大海里，有一只乌龟，海上又漂浮着一块木头，木头上有一个圆孔，正好能让乌龟的头伸进去。这只乌龟迎着风浪把头伸进木头孔里，这个机率是极小的，佛说得人身的机会就是这样小。有一次佛从地上抓一把土，又扔掉，问大众说：我手指甲里的土多，还是大地上的土多？弟子回答：大地土多。佛说众生得人身的机会就像我手指甲里的土一样少，不得人身的机会就像大地里的土一样多。</p><p>佛在阿含经中说，众生极大部分时间都是在三恶道里渡过的，三恶道的业消灭一部分，剩下一点福，重新得个人身做人，做人时又没有做好，造了很多恶业，死后又下恶道了。三恶道里，在地狱的时间按劫算，当恶鬼的时间也是按劫算，当畜生时每种畜生最少是五百次，恶业消了，才再回到人间。所以我们看，极大多数人是不会做人的，人的品德是不好的，就是因为他们在三恶道的时间太长了，没有机会做人事，所以都不会做人。我们今世得人身，又遇见了佛法，真应该好好俢持，免去那些长劫的苦受。何必为了满足自己贪嗔痴的烦恼而造作恶行，有智慧的人，应该静下心来思惟，比较一下，考虑自己该如何度过这一生，考虑未来该如何不再受苦，以解决生死苦恼的最大问题。</p><p>九、每个人都有自己并不知道或者难以观察到的随眠烦恼，只有在一定因缘条件下才得显现出来。这些随眠烦恼是主动参加一些社会活动让之显现为好，还是闭门独修不让其显现为好？</p><p>烦恼随眠主要指烦恼习气，贪嗔痴慢疑恶见就是烦恼，这些烦恼如果没有初禪定，没有修到三果时，都不能断除，有机缘就要现行出来，只不过有人轻有人重。烦恼随眠的意思是有烦恼习气眠藏在识心里，不容易发现，这个习气是从初地菩萨开始断，凡夫和罗汉们还都没有能力断。烦恼现行太重的话，就要多修禅定，多思惟无我之理。如果自己发现不了，还想降伏的话，就得在人群中多磨练自己，并且他人指出来，自己能够听取，善于随顺；不能见他人指出来，就起嗔恨，造作恶行，如果是这种情况，就少到人群中；如果不是，就多在人群中反观自己的身口意行，虚心听取他人的劝告。</p><p>降伏烦恼和断烦恼都是在历缘对境当中，发现烦恼的现起，回光返照，当下就斩断。如果远离人群，烦恼不容易现前，就发现不了，那么烦恼就藏在心里，无缘断除。到了其它佛国土时，都是顺境，烦恼没有机会现起，断除就很难，修行就很慢，虽然是活得很舒适，可是道业进步的很慢。</p><p>十、如果一个人的情商高，智商也高，很懂得人情世故，说明这个人在无始劫以来，在人中生活的时间比其他人稍微长一些，或者在三善道生活的时间稍微长一点，熟悉人类的生存环境，善于了解人的心理，通达人情世故，很会做人做事。他的意根由于较长时间熏习人中的事情，心性与人相应。即使他前世在畜生道里，也是投生在一种与人比较相近的畜生类中，能够与人比较接近，懂得人的心理。比如猫狗之类的畜生，因为与人在一起居住，了解人的心理和习性，再投生为人时，就懂得人中的人情世故，做人做事儿很乖巧，甚至八面玲珑。一个众生在哪道里住的时间长，哪道的习性就重，所以看一个人的习性，就知道他前世是属于哪道中的众生，从哪道里托生过来的。这就说明了众生的意根是受熏染的，而且会把熏染的种子现行出来。那么我们如果长期受佛法的熏染，大乘法的熏染，如来藏法的熏染，种子就会种下来，有朝一日种子就会现行出来，开花结果。</p><p>十一、当心中生起烦恼的时候，我们要静静的看着它，观察它，探求它是从哪里现出来的，它的来源在哪里，因为什么而现出这个烦恼。然后再分析现出烦恼的原因，再解决这个原因。心里要不断的思索那个原因，再分析因为那个原因，值不值得生起烦恼，升起这些烦恼的后果是什么，能解决多少问题。再回想我们从前从小到大生起过多少烦恼，那些烦恼是如何解决的，怎么消失的，最终结果是什么。再思考我们过去生生世世无量劫的烦恼有多少，苦恼有多少，那些苦恼烦恼都是我们的业报，报完就过去了。我们今世的烦恼也是一样，无论怎样都要过去的，何不正确地看待这些烦恼，打开心结，如理地解决。</p><p>要思惟我们每个学佛人都是菩萨，菩萨的职责就是要广行菩萨道，那就不能总是沉浸在小我的烦恼当中。我们一定要打开心量，放眼未来；我们的未来是要在无量劫当中，在十方诸佛国土，广行菩萨道，广度无量众。菩萨心里不应该有个人的贪嗔痴烦恼，只能有想要获得佛法更高证量而生起的上烦恼，只能有为如何更好的教化众生而生起的烦恼，只能有为如何使正法永续流传而生起的烦恼。只要心中常想未来世的菩萨道行，就不会被眼前的小小烦恼所系缚住，心量就能放大了，心里就能开怀了。放眼未来，是极其重要的！</p><p>十二、漏，就是贪嗔痴慢这些烦恼；无漏，就是这些烦恼消失灭除了。有为，就是有所造作，有所运转，有所作为，包括身口意行；无为，就是没有心行，没有造作，没有身口意行，不运转。第八识是无漏无烦恼的，是无为法，在三界世间里没有心行，没有身行口行，什么也不造作，是自性清净心。</p><p>但是祂也有有为法，祂输送七个识的种子，收存业种，输送业种，变生显现一切法，这就是祂的有为部分；如果没有有为部分，我们的五阴就不能生存，祂对五阴纯粹是无私奉献。这种有为法，我们应该好好学习，既要学习转依祂的清净无为的体性，更要学习祂的无私奉献不求回报的有为性，这两方面我们都学习好了，彻底转依成功了，我们修行也就到达终点。</p><p>烦恼断除的前提是断我见，初禅以后，开始断贪爱这种烦恼，嗔恚烦恼也断掉，就是三果人，贪嗔痴慢的烦恼断尽，就是四果罗汉。外道们修行，没有断我见，不管心地如何清净，那都是伏烦恼，不是断，所以不断六道轮回，定力退失以后，还会生起烦恼，那么只靠修定是不能出离生死轮回的，必须配合断我见的智慧，靠智慧出离生死轮回苦。</p><p>无漏的有为法，一是指第八识无烦恼的在五阴身中的运行，二是指无烦恼的圣人所行。有漏有为法，是三果以下的人的行为造作，尤其是凡夫的行为造作。有漏的无为法，是指没有断烦恼的人，入到定中，意识心也灭，没有身口意行的造作，叫作有漏的无为法，只有无想定是这样。</p><p>十三、降伏烦恼和断除烦恼的区别</p><p>七识本身的识种子是清净没有烦恼的，是七识的心所法在运行中出现的烦恼性。所谓的善恶性，是指识心心所法的善恶性，心所法伴随着七识运行，七识清净时，是善十一心所法伴随着七识运行，七识染污时，是烦恼心所法伴随着七识运行。</p><p>修行以后，七识本身并不发生改变，是心所法在不断的改变。心所法没有彻底究竟改变时，七识只是压伏烦恼，以后还会随缘现行烦恼心所法；七识转识成智时，心所法已经改变了，烦恼心所法断除了，善心所法增加和现行，这时是属于三四果人，烦恼是断除而不是处于降伏压伏状态。烦恼的降伏和断除有质的不同，降伏压伏时，只是烦恼不现行出来，但是还存在着；断除烦恼时，是指烦恼连根拔除，不存在了，以后不会再现行出来，这是三四果人。</p><p>所以降伏五盖，和断除烦恼，也有本质的区别。降伏五盖，烦恼还在，只是不现行，这时就可以出现初禅定。当初禅定现起之后，依此定力，先断贪欲烦恼，请记住，断除不是降伏；贪欲烦恼断除之后，渐渐的断除嗔恚烦恼，之间经历多长时间断除嗔恚烦恼，因人而异。请记住，这是断除嗔恚烦恼，不是降伏和压伏嗔恚烦恼，二者有质的区别。嗔恚烦恼比贪欲烦恼要难断，比较困难，当嗔恚烦恼彻底断除时，才是真真正正的三果人，这是断烦恼的过程和细节，先降伏压伏，令不现行，然后在禅定作用下，斩断烦恼。</p><p>当然这里不离智慧，所谓的智慧就是断我见的智慧，知五蕴无我的智慧，没有这个智慧证量，就属于降伏烦恼和压伏烦恼，所有修出四禅八定的外道们都是如此。所以那些外道们，人品都相当好，不会把烦恼现行出来，但是烦恼没有斩草除根，未来世当定力消失时，烦恼仍然要现行出来，那时他们还在六道里轮回，也许还要下三恶道。这是有断我见的智慧和没有断我见智慧的区别。</p><p>十四、当一个人心里有轻慢心时，不仅是说出去的语言能成为恶业种子，将来要受恶报，连代表轻慢的表情也都成为业种，将来也要因此而受恶报，甚至心里的觉观想法也要作为种子收藏起来，将来也要因此而受恶报，因为心地染污了，业种就不净。</p><p>自己凡是出现过轻慢心的，不管是那种形式，都应该及时忏悔，为了后世不受恶报，付出多大代价挽回都值得。还有比轻慢心更严重的心行，更应该忏悔，免得后世大恶报，比如欺骗和谎言，故意欺骗和恶意的谎言，都应该及时忏悔。小因得大果，这些事情可都不是儿戏，果报不虚。</p><p>过去一个小沙弥说一个出家师父，吃饭像牛嚼草，五百世做牛，出家人说出家人的口业都那样严重，何况在家人说出家人的口业，更加严重。每个人都要检讨自己，有一点点过错都要忏悔，免得将来受报后悔莫及。现在诽谤三宝的人很多，不在少数，还堂而皇之的，公开的，理直气壮的，不可理喻，不可思议，这些人有可能要下地狱受报。如果有神通，能到地狱里走一遭，就知道地狱里的众生不都是杀人放火之流，有不少都是学佛众生造大恶业过去的，当时都不知道自己造恶业，有的人还以为是善业，以为没什么事，这些人当中有不少是自认为修行很不错的人。</p><p>只要贪嗔痴烦恼没有断除，就有可能造恶业，尤其是学佛人被自己所信任的人煽动，头脑一热，什么事都敢做，自以为没事，不知道将来果报极重。世间越尊贵者，对众生最有益者，对之造恶业，罪业越大。学佛人首先要懂因果，小心身口意行，不造作恶业，不受恶报，这是明智之人。真正能懂因果的，真正深深信受因果的，也差不多快修到初地菩萨了，地前菩萨对于因果还不能完全信受，何况凡夫。因为能证得如来藏，现观如来藏运作的人，知道身口意行是刹那刹那都存入了如来藏中，没有遗漏，果报就不可避免，因此没有侥幸心理。</p><p>经常读读佛经里讲的因果事例，就能多明因果，身口意行就能非常小心了。头脑经常发热，不理智的人，比比皆是，无始劫以来的恶习太深重，难以遏制。知之为知之，不知为不知，对于自己不懂的，不要轻易开口评论和评价，不要太自信，太自信的人，往往就吃亏，都是自己给自己亏吃。太自信的人，就是我壮，说来说去，造恶业，受恶报，还是因为内心的我，那个我没有降伏，就要不断的冒出来造恶业。</p><p>内心里有优越感，就是我慢，就是有我，只要内心认一个微小的法为我，就是我慢。我慢最难断，自己也难发现，因为太习惯了，往往是不觉不知，很自然的就表现出来了。大多数人都有非常粗重的我慢，而极少有人能意识到自己的慢心。因为定力不足，智慧不够，不能反观自己明显的慢心和隐藏着的慢心，如果没有人提醒，就会任其发展。</p><p>十五、烦恼和无明在什么情况下才能断除</p><p>众生因为没有神通，所知非常有限，眼界太窄，视野太小。识心被五阴身所限制，也被烦恼和习气所限制，被业障所限制，很多事不知不见不证，这就是无明。无明断尽，就成佛。很多人都是想躲避境界、躲避人事，好把烦恼和无明渐渐断尽，可是无明业障恰恰是在接触人事，在作事当中断除的。如果烦恼不现前，无明不现前，就无法作意和观行烦恼的现起，也就无法断除烦恼。在人际交往中，遇到不如意事，能忍下来，退一步，是非常不容易的，而断除烦恼和习气，就是要在逆缘中忍耐下来，然后才能断除。有些顺境，也需要忍耐而不得意，然后才能断除对顺境的贪爱。没有境界，无法断烦恼，因为看不到内心深处的烦恼，烦恼不现前，就无法斩断，不能连根拔除。</p><p>十六、我执，是对五阴我的执著不舍，断我执就得解脱，不被五阴所系缚，不被十八界所系缚，不被三界世间任何法所系缚，有智慧出离三界，这是四果罗汉的境界。他们断我执以后，再也不执五阴我，寿终就能灭掉自己，入无余涅槃。</p><p>法执，也叫作法我执，执著蕴处界和合起来所衍生的一切法当中有我是我。地上菩萨修一分无生法忍，就证一分法无我，断一分法执。地上菩萨因为要留惑润生，保有五蕴身，故意不把我执断尽，就开始断法执，证得蕴处界和合而生的一切法当中无我无我所，法执断尽，圆满成佛。</p><p>十七、有烦恼性的疑，比如执著于我，有我慢，有见取见，就无故怀疑他人他法，执著自己的知见看法为正确，认为自己错的也是对，他人对的也是错。因为有烦恼，有愚痴，不信受佛语，才无故疑师疑法。阿罗汉已经断了这种疑， 不疑佛，不疑法，不疑师。然而这是在小乘的修证方面不疑，在大乘法上，有无量的疑没有解决，这些疑不与贪嗔痴烦恼相关，纯是在大乘法理上的不懂，这就是无记疑。佛断了一切的疑，没有一样不明的，修证出了一切种智。</p><p>说声闻人厌于多闻， 是因为他们对于大乘法不喜乐，满足于自身所修证的小乘解脱道，能得解脱心就已经知足了。缘觉厌于思惟，他们逆推十二因缘法，推到第八识阿赖耶识，就知道一切法都由第八识而生，但不起心继续思惟以证第八识，满足于对缘生法的修证，能够出离生死就知足。而菩萨不厌足思惟观行，勇猛精进修行，探究一切种智，终于成就佛道。</p><p>声闻缘觉有五阴解脱的智慧，却不够清净，知道一切法都是空，证得了一切智，但是根器漏劣，只想自己得解脱，出离轮回，不发大菩提心，不顾众生苦，不想成就佛道。佛的智慧清净，根器极大，大心大量，誓度一切众。声闻缘觉行不清净，只为个人得解脱，不广行菩萨六度十度万行，广利众生。即使是为了成就众生，连小小的戒都不肯犯，就怕因此不能入涅槃得解脱，做一切只为自己得解脱。佛作菩萨时，为了众生，宁犯杀业邪淫业，宁愿自己下堕地狱，也要救度众生，一切所做，都不为自己。声闻缘觉为自己修行，所作所为都是有限量的，而佛三大阿僧祇劫的修行，六度十度万行，其行无量无边，度化无数众生。</p><p>十八、众生投生到六道中的某一道，一定有与这道相应的业和习气种子，否则就不能投生此道中。投生以后，就要表现出与这道众生相应的习性习气，一切行为造作、饮食生活习性自然就与这类众生相应。所以我们要多培养人界和天界众生的好习惯好品德，尽量降伏贪嗔痴烦恼和不良的行为习惯，习性与人和天人相应，后世就能投生到人中和天上。</p><p>作为学佛人尽量不蓄养畜生，因为长期与畜生打交道，朝暮相处，就会毫无觉知地受到畜生习性的熏染，来世就有投生到畜生道的危险。我们现在如果心里有悭吝心，就与恶鬼众生相应，来世就有可能投生到恶鬼道中。所以布施能破除我们的悭吝心，没有悭吝心，就不会投生到恶鬼道，心与恶鬼不相应故。心中有嗔恚、凶狠和邪恶，就与地狱众生相应，来世就有可能投生到地狱中，忍辱就能破除我们的凶狠嗔恚心，命终免堕地狱中。愚痴与畜生心相应，修学般若智慧，就能破除愚痴心，善于思惟思辨，就会破除无明和愚痴。</p><p>有些人心性粗恶，在家顶撞辱骂父母，在外违逆师长，毫无孝道，时时处处以我为中心，来世就与人绝缘，投生恶道。多做人事，说人话，多孝敬父母师长，受持五戒，心性就与人相应，来世能保住人身。修行十善，心性与天人相应，来世就会升天享福。但是学佛人尽量不去天界享福，应该发愿留在人中继续修行，所修福德都要回向自身道业，以使道业迅速增进，在道业上得到最大利益。</p><p>十九、每个人的我执都是很重，只有通过学佛修行认识到世间的真实相以后，我执才能慢慢消融。前世有人学佛时间长，有人学佛时间短，造成了每个人的学佛根基有所不同，然而无论什么样的根基，只要进入佛法当中，都是先于其他众生觉悟的人，应该为此感到庆幸。我们后边还有无数又无数的众生连人身都得不到，更没有机会接触佛法，苦难无边无尽，到我们成佛时，都不知道他们是处于哪种生存方式的众生。所以我们学佛人应该生起悲悯心，不仅要怜悯自己，也要怜悯众生，发起救度众生的大悲心，使得自己一方面道心能坚固，一方面福德就能快速累积起来，修行就能很快速了。</p><p>学佛尽量多修福德，佛是福慧两足尊，福德是不可缺少的成佛的因素，福德累积到一定程度，道业才能进步，智慧才能增长。很多人不重视修福，致使学佛很久，佛法知见还是很浅薄，智慧不得一点长进，根本问题就是福德不足。那些积极修福的人，进步就很快，智慧增进的也很快。是修福对自己有利，还是不修福对自己有利，请大家三思。</p><p>二十、众生因什么而有慢</p><p>众生因有我而有我慢。慢的种类有很多，都是以假我这个色身五阴所拥有的虚相、假相、生灭相而感到自豪自傲，因而生慢。慢包括慢、过慢、高慢、卑劣慢等，比如，众生以自己的色身外貌美丽、漂亮、庄严而感到自豪；以自己的见闻觉知心聪明伶俐、工于心计、知识丰富而自傲，认为自己的见解多么正确和高明而自豪；以自己能拥有极多的财富而自豪；以自己所拥有的名声、权势、地位而自豪；以自己所拥有的眷属，拥有优秀的孩子而自豪；以自己所拥有的产业巨大的父母、有权力和地位的亲属而自傲；以自己的学问、修养、经历而自豪。</p><p>因为自豪自傲，内心里就喜悦爱乐，逢人就向人夸耀，展示自我，自觉或不自觉想让他人了知和羡慕自己。所有的心行全都围绕着假我这个五阴而现行出来，不知五阴虚妄，本非真有，刹那刹那在生灭变化，没有一个真实不变的实体。我尚且不有，何况我所拥有的某某更是虚妄。比别人超胜而自傲的人还算好些，很多人是明明不如别人或者和他人差不多，也认为自己超胜于人，这种过慢就很严重，不但能障碍与他人平等交往交流，也让自己深陷贪执，增加生死系缚，不得解脱。 </p><p>也有一种人，总认为自己各方面都不如人，总是感觉很自卑。这是总把自己的五阴与他人的五阴相比较的结果，也属于非常注重自己的我心，五阴我在心里仍很重，内心里还是希望自己的五阴比较突出一些，因此才感到自卑，这是卑劣慢。我慢是下意识当中认为有个我的存在，这个我有功能作用，有影响力，内心感到满足和欣喜，这种慢是阿罗汉断的，离我们还很远，暂时断不了。</p><p>对我们学佛人修行有障碍的慢，是我们最应该着手要克服和改变的慢，比如有人认为，我学的法都是正法，有多么殊胜，他人都不如我学得好，但实际不是；我的师父是某某大德，名气非常大，我学来的智慧见解绝对正确，但实际不是；还有人说我学佛时间很长已经有三十年了，已经如何如何了，别人都不行。</p><p>因为这种慢，就不肯虚心向他人请教，遇到真比自己有智慧的人，就做不到不耻下问，甚至还要辩倒对方为己乐，白白失去参学的机会。这些慢心都能耽误和障碍自己的道业，以至于道业得不到增进。这些慢都因五阴我而来，心里牢牢地执著五阴为我为真实，这是障道的根源，这样阻碍自己的道业甚为可惜。因此有必要观行五阴的虚妄，破除我见，拔除生死的根源。</p><p>人的慢心是从哪里来？从我而来，以自己的五阴为慢，以自己的见闻觉知心为慢。把虚妄的当作真实的我，才有慢，拿自己的五阴与别人的五阴相比较，认为自己的五阴比别人的要好。拿自己的见闻觉知心，与别人的见闻觉知心相比较，认为自己的见闻觉知心是聪明的，优秀的，有智慧的，有才能的……，于是就觉得自己多么的了不得了，有一种高高在上的感觉，言语之间就把自己兜售出去，让别人都知道自己多么有能耐，多么的殊胜。这就是我们那个可怜的我！各种烦恼一旦形成习性，就很难改变，自己都不能觉察出来。但是言语之间明显地表露了出来，别人都能发觉，就是自己不知道。</p><p>二十一、当我们初禅现前的时候，外界无论怎样的际遇，他人无论怎样对待你，内心的烦恼都不会现起，虽然有时也难过，但那是浮层，不能进入内心深处。那时心如铜墙铁壁，外不入，内不出，外界的欺辱不能真正的碰触到内心里，心就会有一层保护膜，这个境界叫作烦恼不侵心，心不起烦恼。这就是阿含经中说的：心自在，心得解脱的境界。</p><p>修到这个地步，自己会生生世世都受益。所以二果以前，心都是不自在也不解脱的，因为与贪嗔痴烦恼联系在一起。心解脱，是以意识心为主，意识心贪嗔痴具足，前五识也解脱，眼不贪色，五识不贪色声香味触；意根第七识的解脱，那就要断我执，有能力灭掉自己，那是四果阿罗汉的境界。真正的心解脱是四果，断了我慢，五上分结都断了，能够自己证明自己不受后有。</p><p>二十二、喜欢音乐是不是贪</p><p>只要心里认为好，感兴趣，有喜乐，就是贪，只要有心于这些声音，心沉浸在这些音声里就是贪。因为贪爱，才生死轮回不息，只要喜欢一个东西，就被这个东西束缚住，就不得解脱。解脱就是心不著任何一物，阿罗汉因为心心念念想解脱生死，害怕著任何境界，他们接触六尘时，根和尘仅触一下就移开，不再往下进行，免得起贪，起觉受，他们很注重这些修行，我们也应该尽量这样做，虽然暂时还做不到，但熏习总是有利于自己的。</p><p>我们听声时，应该把声音当成空谷的回音，知道声音是不真实的，就不要对声音生起兴趣，对其它的六尘境界也要这样观行，不要生起贪爱，心就能解脱。佛在《杂阿含经》卷一中说：贪爱于色就等于爱乐苦，喜欢觉受就等于喜欢苦，喜欢想蕴就等于喜欢苦，喜欢身口意的行就等于喜欢苦，喜欢六识的识蕴就等于喜欢苦。如果不喜欢苦，就不要喜欢色受想行识的五蕴，对色受想行识的喜贪断，就能离欲断苦。</p><p>我们要想断我见，得解脱，首先就要观察苦，认识苦，才能生起厌，才能求解脱，厌离心不生起来，对五阴的贪爱就会继续，这样就不能断我见，较深一些的禅定也不能出现。我们厌离世间的五阴和生活，欲界定才能出现，厌离欲界天人五阴和生活环境，色界定才能出现。总是有一个喜欢五欲的心，什么好的境界也不可能出现，因为你的心里已经装满了，没有空间，更好的境界也只能摆在心外，你都享受不到。</p><p>二十三、如何减轻情执解脱自心烦恼苦</p><p>一个人如果情执太深重，内心深处肯定是纠结不断，苦恼重重。怎样才能减轻情执呢？最好的办法就是观察世间的无常，观察每个家庭的无常，观察每个家庭的结局；观察每个人的无常，观察每个人的结局；观察自他心理的无常变异，仔细思惟这些世俗法有什么可执著的，再思惟自己生生世世所有的情感，最终的结局都是什么；众生无量劫来泡在各种各样的情感里都得到了什么结果，观察每个人从前世都带来了什么，今世死后又能带走什么；什么是自己永远不变的东西，什么是自己最可依赖的东西，什么是永远属于自己的东西。</p><p>再观察思惟自己无量劫以来的父母、伴侣、儿女、亲朋以及所有的家亲眷属，他们如今都在哪里，那些感情都哪里去了，自己为什么生生世世轮回痛苦不已，都是因为执着于自他情感，从而系缚了自己的心，不出六道轮回。众生不管对什么都是贪生生贪，生死轮回，情为根本，爱为根本。知此，就不应该再去追求生死轮回苦的根源，应该从贪染的泥潭中渐渐地拔出腿来，逐渐走向自由和解脱。</p><p>二十四、生死的因是什么，这点要搞清楚。生死轮回是因为贪嗔痴烦恼，是对五阴十八界的贪爱执著，是对三界世俗法的贪爱执著。如果没有执著，没有贪爱，没有烦恼，烦恼全部断尽，自然就能出离生死轮回。如果对他人的恭敬实质是自己的烦恼性现前，而不是真正的恭敬，那就有生死；如果不是烦恼的显现，那就与生死无关，包括对佛的恭敬，如果是以清净心真诚心，反而能增加福德，有利于解除生死烦恼。楞严经第一卷里记载，阿难出家的因，是对佛的贪爱，不仅仅是恭敬，所以佛才征求爱乐佛的心是哪个，在哪里，然后降伏这个贪爱心，才能解决生死问题。</p><p>二十五、修四禅八定是否能证得涅槃得解脱</p><p>涅槃是心解脱和慧解脱的阿罗汉所证的境界，不仅与禅定有关，主要与解脱的智慧有关。即使修出了初禅二禅三禅四禅，也不能得解脱，仍然在生死轮回中。因为没有断除生死的根源——我见，因此就没有断除与我有关的烦恼，被烦恼所系缚，心不得解脱，未证涅槃。</p><p>心得解脱是小乘三果人的境界，不仅有初禅以上的禅定，也断除了我见，断除了贪欲和嗔恚烦恼以及三缚结，这是证得了有余涅槃。再断除我慢、我执，对三界的贪爱全部断尽，获得了解脱的智慧，就能入无余涅槃。</p><p>因此说只有禅定，不能断除烦恼，只能压伏烦恼，心不得解脱，智慧也不得解脱。心解脱是智慧加禅定，断除烦恼所获得的解脱境界，慧解脱同样是解脱智慧加禅定，断除所有烦恼所获得的解脱境界。</p><p>二十六、很多人每天都是为了说话而说话，为了表白自己，显示自己，而口无遮拦，心中的我很重，都不知道回光返照检查自己的身口意行，修行是修个什么？天天喊无我，心中的我却仍然很重，自己检查自己，修行究竟修了个什么，有没有力度？</p><p>检查自己的心里，为什么有不高兴的情绪，如果心里没有我，不是我重的话，能否不高兴呢？顺我者乐，不顺我者悲、愁、恨、苦，这就是十足的我，这样与无我正相反。修行的最终目的是要达到无我，把自己每天心中的我融化掉，这就是最好的修行，学习千经万论，就是要达到无我，不是为了学佛法而学佛法。学佛法的目的是要做到无我。如果每天都是为自己的我而学佛法，而显摆自己，那不是与修行背道而驰吗？</p><p>第七识意根的我执重的原因，是着我相，时刻想突出自己，表白自己，自己如何又如何，告诉他说错了，不是这样，马上就为自己辨白，或者气愤的走人，这些都是严重的我心。真想快速的修行，快速的增进道业，每天都应该检查自己的烦恼心所法，是不是比以前减少了；情绪化的表现是否减少了；慢心我心是否减轻了，这样才是正修行。不是学了一大堆知见，然后增长我心和慢心，这样是学错了，学反了。</p><p>二十七、什么是见惑和思惑</p><p>见惑是指知见上的烦恼，知见不清净不正确叫作见惑，见道时即断。见惑是指众生把五阴十八界当作真实的我，当作不生灭的我，因此执著不舍。断除五阴十八界为我的知见，就名为断见惑。</p><p>思惑是指思想上的迷惑颠倒，贪嗔痴烦恼和烦恼习气，所有的无明惑，修道以后才能断除。小乘的思惑指贪嗔痴烦恼，对三界世间的贪爱。大乘的思惑除此之外，还包括众生心地上的所有尘沙无明惑。小乘思惑断尽，就是四果阿罗汉，大乘的思惑断尽，就是佛世尊。</p><p>二十八、一切的争夺斗争，都是因为有我，无我就不会去争夺和斗争。无我之性分成不同程度，我性也分成不同程度。我性越轻微的，断我见越容易，反之就越不容易。在断我见的过程中，我性是要逐渐减轻的，以至于接近于无我，才能在最后观行时断除我见。</p><p>在平时的修行过程中，要时时检查自己的我，是否在逐渐减弱。在为人处世中，观察自己的烦恼是否还很重，慢心执著是否还很重。如果观察出来自己的慢心重，我心重，就要想办法调伏自己，压伏自己。</p><p>每个人因为什么有慢心呢？因为自己认为自己的五阴身殊胜于他人，自己比他人重要，因此起慢。这种知见不降伏，很难断我见。把自己的五阴身当真，把自己的觉知心当真，把自己所拥有的色声香味触法财色名食当真，内心才会自觉不自觉的生起慢心，而凌灭他人，心有高低不平。修行过程中，必须努力克服这些慢心，慢心我心轻微以后，才有可能断我见。</p><p>所有烦恼都是因我而来，无我就无烦恼，越无我越无烦恼，究竟无我，烦恼以及习气都会断尽。</p><p>二十九、世俗之争，让所有人身心疲惫，争来争去结束争个我，放下自我，你好我好，大家都好，岂不快哉！为什么非得要自己好，别人不好呢？每个人心中那个我，像巨石一样沉重，以至于压得喘不过气来，每天每月每年每生每世，活得都非常艰辛、疲惫和沉重。从现在开始，我们应该学会用无我这个工具，一点点的敲掉这块有我的巨石，让大石头变成小石头，让小石头变成碎石，让碎石一点点的离开心中消失掉。这样心就轻松没有沉重感了，心就解脱自在了，心就愉悦快乐祥和了。</p><p>三十、不知观心，不会观心，不能观心的人，无法觉悟自心，不能觉悟自心，就不能改变自心。有很多人学佛，都是任心自漂流，随顺自己的贪嗔痴烦恼，随顺自己的我性，从来没有想过自己有恶心，有不善心所，也就从来没有想过要改变自己。因此也就不会时时处处与自我相逆，与自己的烦恼习气相逆，与自己的愚痴无明相逆，不知道随顺我心我性就是随顺生死，随顺三恶道，随顺苦业。</p><p>革命，是革谁的命？是革自己的命，革意根的命，这样才能得解脱，得大自在。可是很多人每天却是革别人的命，努力想改变他人，以随顺自己的我性，满足自己的私欲和贪婪，这样的人正是无明深重的人。凡是不能观心的人，都是烦恼习气严重的人，我性重的人，自大自慢的人。这样的人，意识心都没有觉悟，内心深处的意根要如何觉悟、解脱和自在呢？</p><p>大多数人没有遇到佛法时，内心迷茫不觉悟，遇到佛法了，照样是迷茫不觉悟。抓取外境为我所有，为我所用，增加我见和我慢，不惜采取卑劣手段达到个人的私欲私利，却堂而皇之的认为自己有修行，有手段，聪明才智。从来不能回光返照自己，学法之后，把佛法知识作为一种伪装，来壮大自我，增长自我，实是愚痴，而不自知。</p></div>"
},{
    "title": "第四章 性障和烦恼篇(2)",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  性障和烦恼篇(2)</strong></p><p><span>三十一、如何抓住烦恼贼</span></p><p>修行到有一定觉悟的人，会经常回光返照自己，就能发现自己内心深处的那个我总是要冒出头来，这是好事，没有觉悟的人就发现不了。发现冒出头的那个我时，就观察这个我，看看他到底从哪里来，又到哪里去，是如何生起的，如何灭去的，如何运作的，心行如何，有什么目的。常常如此观察，必有重大发现。</p><p>这样修行的人，就不要刻意的压制自己，让烦恼冒出头，然后抓住它进行审判，搞清他的来龙去脉，就会大有收获。以后断烦恼也是这样，不要刻意压制烦恼，看烦恼起处，快速的抓住它，好好审判审查一番，定能改造。修行还是在娑婆世间里好修行，处处是擒贼的机缘，只要能擒住贼，就能识得他，自家宝藏就不会再损失了。</p><p>三十二、人心不平，是非纷争，为什么不平？心中有四相，相有好坏和凹凸，存于心中，所以心中不平。心本自平，不平的是那个见相的心，如何心平？把相抹平。如何抹平？观相平等一如，看透相的实质和本质。相的实质和本质是什么？不过七大种子组合而已，不过如来藏造就而已，岂有真实的相，而被我们所见？眼睛有翳病，见有高低、上下、美丑，病眼望空花，病去空花无。修行，就是除病见实相，除此无他！此为勉人，也为自勉。</p><p>那么遇到好争好斗之人怎么办？忍他，让他，再过几年看他；让他争，让他斗，让他第一，让他高大，把所有的相都让他置于心中。我们却要空掉所有的相，越空越好，越懦弱越好，越无我越好，四相空净，无挂无碍，心得解脱，常乐我净，成佛有余！这样，最后谁第一，谁得胜？智者无为，愚人有求！</p><p>一切争斗，都是与自心争，与自心斗，斗不着他人，只能斗自己。内心无明，见有他人，见有自我，见有利益可争。若无无明，不见自他，只见如来藏总持一切法，只见一真法界。</p><p>三十三、我们在面对是非，面对他人的过错时，在不能空掉和躲避这些境界，必须要解决这些人事时怎么办？应该观行人事境界的虚幻不实性，观行一切法无我、无人、无众生、无事相。口中如果一定要谈论人事，也应该只是在意识心的层面来客观的作以评价，以如理的方式如理的解决，内心不要有所骚动，不要被人事情节所牵引，陷于其中而不能自拔，这样就会失去所有的觉照之力，我相、人相、众生相、事相全部现前，并且执以为实，心被事相所染污，染污的业种存入自己的如来藏中，后世果报自受，得不偿失。</p><p>岂有智者，以他人之过失，藏于自己心中，侵污自家田地，累及后世，不得清净。见他人之过失，回光返照自心，莫要责人而不责己。谁人修行谁人了，谁能代替他人修行，替人成就，而自己背负业果？无有此理！</p><p>三十四、学佛是用来觉照自心降伏烦恼的</p><p>很多人学佛学了十几年甚至二三十年，至今不知道学佛是为了什么，学了很多佛理，仍然不知道用之来觉照自心，降伏自心，改变自心，却偏偏用来觉照他人。以至于遇到烦恼的人事，心起大浪，久久无法平静，是非纷争不断，偏离了学佛修行的目的和方向。学的理仍然是理，遇到的事仍然是事，理事不能结合，也不能圆融，得不到自心的功德受用。如果学佛人看待事严重的脱离了理，变成了单独存在的事，所学的理，也就失去了意义。</p><p>那么应该如何面对娑婆世界的人事纠纷和烦恼呢？学过大乘法的人，都知道一切法都是如来藏所幻化出来的，没有实际存在的人事物理，都是如来藏这个魔幻师依缘输出七大种子生成的。就像绘画师泼墨挥洒出的一幅幅画像，我们不要把画像当作真实之物，也不要把画像中的人物和风景当作真实，而去贪厌，所有的画像只不过是彩墨喷绘出来的，是一堆颜料的堆积而已，岂有智者去执著分别一堆堆的颜料，而生心动念。真正的智者也不应该面对如来藏用七大种子所堆积起来的人事物理和山河大地，而生执念。</p><p>多作此观行，常常觉照，就不会让自心陷于人事纠纷之中而不能自拔，以至于得不到学佛修行的真实利益，白白的用功于各种佛学理论知识的积累，画饼不能充饥。</p><p>三十五、每个人今生今世都经历过苦难、苦恼、波折、挫折，可是意识仍然不觉悟，遇到佛法，佛讲了苦谛的真实义，意识仍然不觉悟，还贪着苦，不肯出离。意识都如此，何况意根？众生愚痴、无明就是如此，亲身经历多少苦难，也不知反省自救，佛来救度也不接受。无明薄、善根深厚、烦恼轻微的人，遇到烦恼，就要想办法解决和躲避，愚痴人就会继续忍受，深陷其中也不肯自拔。记吃不记打。</p><p>意识知道自救吗？如果意识知道，佛陀来娑婆世界讲苦圣谛，也就没有必要了，可是佛陀讲完苦圣谛，对于我们末法时期的劣根人又有什么用？意识和意根有一个懂得自救，懂得苦，懂得要出离苦，也就用不着佛陀来救度了。可是现在佛陀再亲自来，作用也不大，众生无明太深重，愚痴不可救拔。</p><p>地藏经中描述：佛告阎罗天子：南阎浮提众生，其性刚强，难调难伏。是大菩萨，于百千劫，头头救拔如是众生，早令解脱。是罪报人，乃至堕大恶趣，菩萨以方便力，拔出根本业缘，而遣悟宿世之事。自是阎浮众生结恶习重，旋出旋入。劳斯菩萨，久经劫数，而作度脱。阎浮众生结恶习重，从地狱里旋出旋入，出出进进，像回家一样频繁。劳斯菩萨，久经劫数，而作度脱。菩萨们都够有耐心的了，众生都不觉得惭愧！何等下劣！</p><p>三十六、如何忏魔除去罪魇</p><p>有很多人修学佛法以后，由对世间法上的利益追求，转入对修学佛法上的利益的追求，实际还是对自我的追求和执著，内心的我不断，我执不断，增益我见与我执。我要更多更多的弟子，我要更大更大的权利，我要更高更高的名声，我要更多众生的更多恭敬，所有的目的就是为了心理感受舒服。可是这个心舒服的觉受有实在意义吗？众人追捧，我就舒服，这个舒服的觉受是意识心的感觉，这个意识心是生灭幻化的，本是虚妄，不能长久存在的，生来灭去，日夜都要断灭的。</p><p>真正的修行人，应该常常静下心来，时刻反观自心，我到底追求的是什么？我抓钱财，抓钱财的目的是什么？我现在贪图享受贪图觉受，其目的是什么？有什么意义？有什么过失？我有各种欲望，这些欲望最后的结局是什么？看清自己的内心，并且要勇敢的面对自己的内心，搞清楚自己修学佛法的最终目的是什么，如何如理如法的通过修学佛法达到这个目的，而不会与自己最终的目标背道而驰。如果内心无所求，就能快速达到目的，我还追求什么？经常要问自己要什么？争来夺去图什么？能不能得到解脱？有没有实际意义？所追求的一切是否是如来藏幻化的影像？是不是求来还要失去，或者失去的更多？这样不如理的作意和追求，是束缚自己的枷锁更多，还是解脱的功德受用更多？</p><p>一个人想得到的越多，往往失去的就越多。我们学佛就是要减轻心灵的负担，不能被世间的虚妄相迷住了双眼，看别人要看得清楚，看自己更要看得清楚，时常这样反观自己。学佛如果都在相上贪，不在心上用功，因相上的贪着，在世间上你争我夺，出卖自己的灵魂，违心做事，只能增加自己的烦恼和心灵的负累。把佛法作为了争夺世间利益的工具，个人贪欲的工具，压倒他人的工具，实是罪过，祸患无穷。修行人如果不是想办法减轻自己和众生心上的烦恼，反而在烦恼上又增加了层层的枷锁，又造作种种的不善业，这样殃及佛教和众生，求升反堕，得不偿失，实在是无智之举，应速速悔改，除去罪魇。 </p><p>三十七、有为法不一定都是有漏的</p><p>四果罗汉的身口意行是有为法，地上菩萨的身口意行是有为法，却是与无漏相应的，无漏就是无烦恼性。但是习气免不了。</p><p>佛的身口意行完全彻底的无漏，却是有为法，佛度众生，现无量佛国土，都是有为法，都是无漏的。如果有为法不能无漏，众生学佛修行就无用。</p><p>当六七识断除了烦恼，其心行与无漏相应，六七识转识成智以后，更是与无漏相应，其智慧也是无漏的，不仅心行上无漏。</p><p>三十八、证果以后三恶道的业消除了，但是这些业要在人中受报，人中无论怎样受报，都比三恶道轻微。在人中最大的恶报，就是短寿，被人杀死或者是折磨致死也比三恶道苦受轻微。有六识心就有感受，就能感受苦乐和不苦不乐。圣人也是如此，只是圣人少于用心，心不在五欲六尘上，苦乐受很轻微。如果在意六尘，苦乐受也多一些。</p><p>有烦恼就有业行，就会做错事，开悟和证果以后，也是这样。如果烦恼轻微，做的错事就少，断除烦恼，错事就更少。断除烦恼以后，还有烦恼习气，也要有一点轻微的错误。直到八地菩萨我执断尽，烦恼习气断尽，那时就没有关于我的业行了。四地菩萨以上，有了四禅八定，有了神通，就没有什么苦受了，他们轻易也不来人间，尤其是七八地菩萨，根本没有必要来人间。</p><p>三十九、饮食对禅定的影响</p><p>饮食也是影响禅定的一个重要因素，身体里如果摄取过多的营养物质，超出了身体所需，身体就会有所反应；之后就影响识心，识心的反应就有些躁动不安，心念不清净，情绪不容易控制，或者是需要强制控制。这些营养不仅包括鱼肉类、烟酒类和葱蒜类等荤腥物质，也包括素食。如果素食营养过剩，也会造成身体和情绪上的过激反应，身体和心理负担增加，心不容易清净，就会影响禅定。</p><p>所以很多人抱怨禅定难修，那就要检查自己的饮食结构，是否是营养过多过剩。现在由于物质生活丰富多彩，人们贪着口腹和营养，过于爱惜色身和美味，以至于造成身心不清净，贪和嗔都不容易降伏，烦恼重，禅定当然就无法成就，佛法的观行和实证就难上加难。那么学佛虽然广博多闻，理论娴熟，口若悬河，其内心的实证终究不成就，只成个知解宗徒和理论杂家。</p><p>世尊在楞严经中要求弟子们断除荤腥，降伏欲心和嗔心，使得道业快速增进。但在现代社会中，物质生活太丰富，即使是素食，也同样影响身心的清净，增长欲心和嗔心，道业无法快速增进。这应该引起我们广大的学佛弟子的关注，调整自己的饮食结构，以利于修行。</p><p>四十、心软化的前提是要明得修行之理，学了佛法中的正确知见，知道世间一切法都是假相，并且历缘对境去磨练这个心消融这个心，心才能慢慢软化。要想证得无我，首先知道自我虚妄，观行自我是如何的虚妄，真认可了，才能证得无我。然而还有烦恼没有断，需要继续深入地观行，烦恼才能淡薄。欲界的需求减少了，证初禅，才开始一点一点地断除各种烦恼。在这之前，都是压伏烦恼，不是断。</p><p>断我见，证无我以后，才有能力破除意根对自我的执著，才是一个没有自我的人。而破除五阴十八界我的虚妄见以后，就有能力在身口意的各种活动中，发现一个真实而不虚妄，时刻都在起作用的真心如来藏。证初果与明心只差一个阶位，这其中，福德和智慧大大不同。后者需要的福德要大，智慧要深，要有无我智再加大乘智慧。说的容易，做起来不容易。只要坚定自己的信心，就会不知不觉地满足了这些条件，成为真实义的菩萨。只要努力不懈，都能成就。</p><p>四十一、佛法本是一剂清凉药，能让人心清凉得解脱。在什么情况下，这剂清凉药变成毒药，服之增加生死，趣向地狱三恶道？</p><p>以贪嗔痴的烦恼心去学法，学法的目的不是为了获得无我的解脱功德，而是为了增加自我的砝码，以压倒一切人，凌灭一切人，驾驭一切人，控制一切人。</p><p>因此在佛法学得越来越多的时候，我性也就越来越强烈，就情不自禁的拿着佛法的刀杖砍杀一切，以至于烦恼和业障越来越增胜，贪嗔痴越来越严重，我性越来越强壮，这样在佛法中造作恶业之后，最终就趣向地狱，趣向三恶道，不但不得解脱，反而增长生死苦厄。</p><p>有些人追求明心见性，就是想当人上人，就是想超越于一切，站在一切人的肩膀上。这样的人不仅不能破除我相人相众生相和寿者相，反而增加了我相人相众生相寿者相，增加我执，生死系缚得越来越紧，这是颠倒众生。</p><p>最能救度众生生死烦恼的只有佛法这一清凉剂，如果把佛法知识当成自己获得世间法的砝码时，佛法就成为了烦恼散。那么这样的人，再也无药可救，学佛还不如不学。</p><p>四十二、初地菩萨之前比较容易造作的恶业，大约是改变佛陀修证的标的和轨道，所说法义不是佛意，扭曲佛的教法，贻误众生的法身慧命等等。还有互相争夺一些世俗利益的，以及造作一些诽谤业等等。关于这点，有几部佛经里记载了菩萨所造恶业的因缘果报，果报也很惨烈。</p><p>初地菩萨之前，都没有断除烦恼，还有轻微的烦恼有时要现行出来。严重的时候，也会造作比较大的恶业，这样大的恶业都与佛法修证方面有关，世俗法上的大恶业一般是不会造了，比如杀人放火之类的，这样大的恶业没有断我见的人也不会造，不学佛的人，也不会造。</p><p>四十三、真想解脱的学佛人，应该在日常生活中，仔细检查自己内心的各种觉受，检查自己在贪爱着什么，对什么事情在意，对什么事情花费着心思和精力。检查出来以后，就要分析这是什么心理，有什么意义，结果是什么。然后想办法对治自己的贪爱和觉受，修行就会扫除遮障，道业进步就快了。</p><p>我们无始劫以来的贪习很重，自己很不容易发觉，因为习惯了，习以为常了，只有过来人去掉贪习降伏贪习的人才能发觉自己和他人的贪心。就像久居香庭不觉香，久处粪缸不觉臭，香庭外的人才能闻到清香，粪缸外的人才能嗅出臭秽。</p><p>贪的范围很广，凡是欲界里的法，只要喜欢都是贪。那些擅长诗词歌赋的文豪，挥洒自如的画匠，几乎都去鬼道潇洒去了，因为那都属于贪，何况其他方面的，情情爱爱的更是贪，离不开鬼道受生。经常画马的，画得神似，死后投生马腹；经常写鬼类小说的，写得极神，死后投胎做鬼；脑子里经常想什么，死后就去与什么作伴。画匠画马非常专注，心与马相应，来世就托生为马；经常写鬼神小说的人，心都投入鬼神之中，与鬼神相应，死后就会做鬼；我们现在念佛，心与佛相应，就会出生在佛的身边。心与善相应，就会托生善道，心与恶相应，就会托生恶道。</p><p>鬼道的业报结束，还有一些福德，就去畜生道受生，畜生道业报结束，还剩一些福德的人，才会再回到人间受生。所以得人身的时间非常短暂，在三恶道的时间非常长，每个众生都是苦受多，乐受极少。所以我们还是为未来世着想，少享福，为后世多留一些福，福大才能尽快投生为人。</p><p>善根福德深厚的人在佛身边，受佛督导和熏染，修行非常快。没有佛，在断除烦恼的菩萨身边，在阿罗汉身边，修行也非常快，所谓近朱者赤，近墨者黑。心中的大贪心细一些还可以观察到，细微的贪极多，几乎没有人能观察得到，除非断烦恼的人。得人身的机会是多么微少，得人身的时间多么短暂，得人身证果得解脱多么稀少不易。已经得人身的我们，该如何把握这个难得的时机，精勤修证，得微少解脱，这是我们应该经常深思的问题。</p><p>四十四、智慧不足的时候，没办法依现量作判断，能判断准确需要有很高的智慧，有相当好的择法眼。很多人都把自己意识的理解当作是现量观察，如果是证据不够确凿的，就不可能是现量观察出来的，没有现量观察智慧的人占百分之九十以上，即使在世俗法中也是这样。所以提个现量观察，要依现量判断，这也是非常难的事情。</p><p>很多人不能实事求是的观察到自己并没有现量观察智慧，对很多的法都不能现量观察，尤其是比较高深的法，更不能现量观察。但是众生往往都自以为是，认为自己有现量，这就没办法了。就像很多人都会说我学的法是正法，其他人学的都是邪法，我的师父是正师，其他师父都是邪师，我的观点都正确，别人的观点都是错误的，因为有此严重的我执我所执，而从来不反思自己的错执。</p><p>众生难度就难在愚痴性上，因为愚痴而不知道自己愚痴。愚痴的范围极广极广，极细极细，细到九地菩萨十地菩萨还有深细的愚痴无明需要破除。一切的烦恼都是由愚痴引发出来，包括贪，包括嗔，包括慢，包括疑，包括所有的邪见。所以愚痴灭尽，烦恼就灭尽，无明就灭尽，那在佛法上再也不用学什么了，彻底毕业。</p><p>三恶道众生，还是畜生道众生最难度，因为有极重的愚痴性，因为愚痴，吸收不了什么法义，又不会反思。鬼道众生和地狱道众生，虽然恶业重，但是能听懂人语，能思考，就有办法去救度。</p><p>如果一个人没有现量智慧，想要依正教量，那也是不容易的。佛经白纸黑字，有多少人误解，有多少人错解？即使是原封不动一字不差的复述经文，声音发出来，抑扬顿挫，就能把经文的意思改变了。现在的大藏经里，有很多都是现代人又重新整理校对的，标点符号都给点错了。古文佛经的标点符号一般都是句号，现代人校对以后，就改成现代文的标点符号，然后经文的意思就扭了，看不出原意了。总之一句话，愚痴智慧就不足，智慧不足什么事也做不好。</p><p>四十五、慢心的危害性</p><p>很多人禁不住赞扬和批评，究其原因，还是由于我心，才出现慢心。三四果以前人人都有慢心，只不过因缘不具足的时候，慢心随眠隐藏着。等到有因缘现前的时候，慢心就要现行出来。几乎是人人都要经历这个阶段，只是时间长短不同深浅不同而已。</p><p>最卑微的人，一旦自己得势，往往是心最慢的人。因为卑微自卑也是慢心我心的一种表现形式，没有我心，就不会觉得自卑了。所以有多自卑，就有多慢。</p><p>几乎所有的慢，都表现为世俗法方面的。比如有的人因为富贵多金而慢，有的人因为有地位高而慢，有的人因为有权势而慢，有的人因为相貌而慢，有的人因为有如意的家亲眷属而慢，有的人因为阅历广而慢，有的人因为有某种特长而慢，有的人因为自己聪明才智而慢，很多人因为色身的缘故而慢，多数人因为头脑智慧而慢。这些慢的种类颇多，都是内心里有我有我所，身见我见重而导致的。</p><p>慢心最障道，慢心最容易入魔。有的人一脸麻子自己看不到，却成天紧盯着别人的脸，天天检查别人，这就是内心有自有他的原因。</p><p>四十六、诽谤正法不能往生和解脱的原因</p><p>无量寿经第十八愿（往生极乐世界的条件）：设我得佛，十方众生，至心信乐，欲生我国，乃至十念，若不生者，不取正觉。唯除五逆，诽谤正法。</p><p>五逆罪是出佛身血、杀阿罗汉、破和合僧、杀父、杀母。正法是能够让众生解脱的正确的法义，包括大乘和小乘法。</p><p>为什么犯了五逆重罪不能往生极乐世界，甚至不能证果不能明心不能解脱？为什么诽谤正法不能证果不能明心不能解脱？</p><p>首先来说出佛身血，因为佛的业种已经彻底清净，感召不到任何恶业和恶缘，没有任何恶报。所以任何众生都不能杀佛，也不能伤害到佛，让佛的色身上流出血液。为什么还有出佛身血之说呢？佛的血脉就是法脉，就是佛法的流传，出佛身血就是让法脉失传断流，不能正常传播。佛法能让众生出离生死得解脱，出佛身血就是非常严重的了，这个恶业的果报就是无间地狱业，造这种恶业的人不能得解脱不能离开生死苦。</p><p>阿罗汉是断尽一切烦恼的解脱圣人，由于其解脱德人天都应该供养，叫作应供。八地以上菩萨的解脱证量相当于四果大阿罗汉，初地到七地菩萨的解脱证量相当于三果圣人，留一丝惑业，不取解脱果，不入解脱正位，以保证不入无余涅槃。尊重、供养阿罗汉的果报就是断除烦恼、得解脱、解除生死。那么反之，杀阿罗汉就不能解脱烦恼，不能得解脱，不能出离生死，所有能出离生死苦的解脱路全部都闭塞不通，因此不能往生极乐世界，不能证果，不能明心见性。</p><p>和合僧团，僧：梵文 Samgha，详称僧伽，指出家修行的男性佛教徒，意为众、大众、团契，广义也包括女众，男女出家众统称僧尼。僧伽是四人以上的一群依佛法的出家人所组织的一个宗教团体。如果没有出家身份和资格，就不属于僧尼，人数再多也够不成团体。至于圣义僧，必须是真正证果真正明心见性的僧人，意识假证果假明心的人仍然属于凡夫僧人，没有意识操控的时候，完全显露的是没有证果和明心的意根的本性，必随意根的思想见解和烦恼而生死轮回。</p><p>和合是指按照六合敬的宗旨在一起居住，六和敬就是见和同解、戒和同修、身和同住、口和无争、意和同悦、利和同均。如果意见观点不一致，就不是和合；如果都不遵守三皈五戒、八戒、比丘戒、比丘尼戒和菩萨戒，所修戒律内容不一致，不符合佛陀所制，就不是和合；如果色身不能居住共同处所，东西南北各处杂居，不是和合；如果内部之间互相争吵，互相谩骂，互相攻击拆台，是非纷争不断，更不是和合；如果见面在一起时都不舒服，内心气恼不悦，多有隔膜，也不是和合；如果众生之间利益不均，不管是什么样的利益，一方只做牺牲付出，没有回报，另一方只是索取和占有，同样不是和合。若违反其中一条，都不能构成和合僧团。</p><p>真正的和合僧团，能代替佛陀流传正法于千古，救度众生于生死火海之中，破坏之，则是破坏度众生出生死的舟筏，果报则是不能得解脱出生死苦，因此不能往生极乐世界，不能证果和明心。对于不和合的僧团则无此过，不和合的僧团能带给众生烦恼和苦果，让众生烦恼之上又增加烦恼，增加系缚和枷锁，生死更苦甚。</p><p>父母带给自己肉身，有此色身能遇正法修学，能有机缘得解脱，永久脱离生死，因此父母恩重如山，粉身碎骨也难报答父母的生养之恩。众生不但不供养，反而杀之，杀父杀母之罪，其重无比，死后无间地狱不得解脱，因此杀父杀母不能往生极乐世界，不能证果和明心。</p><p>正确的佛法，众生依之修学，就是解脱的因，能得解脱了生死。如果诽谤这些法义，那就是不信正法，信尚不足，岂能修学？不能修学，何能解脱？法如度生死海的舟筏，破坏了舟筏，众生凭何能度生死海？诽谤了正法，不但自己不信，也阻止了其他人信受，其罪甚大，自己必不能出离生死得解脱，因此不能往生极乐世界，不能证果，不能明心。</p><p>能让众生解脱的法，包括小乘四圣谛、十二因缘，也包括大乘的如来藏系列法，如般若方广唯识，五识六识七识和八识的理论，包括戒定慧三无漏学。四圣谛和十二因缘，让众生得小解脱，不能永久究竟解脱，大乘如来藏法能让众生永久真正究竟解脱。而第七识意根的法，能保证众生小解脱，也能保证众生大解脱，以至于究竟解脱。所有的解脱，不管什么程度，都在于意根的解脱，意根不解脱，都是假解脱，烦恼不能断，生死不能了，苦海不能出，不能涅槃清凉寂静。</p><p>犯五逆罪者少之又少，而诽谤正法越来越多，随处看见，普遍如此，因此劝导大众自己禅定智慧不足，证量不够，应该时时处处谨言慎行，没有资格当评委的时候，默默修持自己，尽管暂时不能证果和明心，没有唯识种智，也要做个世间智者，不给自己招灾惹祸，不给自己解脱路上设置路障。</p><p>四十七、现在我们都知道了娑婆世界里有十亿个南瞻部州地球，心量就应该扩展到所有地球的生命轮回上，不仅要考虑自己的生死轮回，也要考虑六道所有众生的生死问题。心应该站在一个制高点上观察一切法，不要再局限在一个小小的地球上，更不要局限在自己个人私利上。如果只局限在自己眼前的小利益，其心量和智慧就过于狭隘了，被自己五受阴所迷惑和遮止住了，这样后世只有生死苦痛，没有一丝快乐了。</p><p>慢心重的人观察一下，自己在十亿个地球里是否渺小到不能再渺小了？拥有一项技能，懂得一些理论知识，有一定的权势地位和资产等等，又算得了什么？天外有天人外有人。半瓶子的最容易慢，因为有一点，还不足，就有空间晃荡。满了的人，因为眼界开阔，见识广大，眼里装的是广阔天地，心量也大，就不把自己太当回事了。其实我们每个人在十亿个地球里能算老几？即使修到几地菩萨，也得问自己：我算老几？十方世界八地菩萨数不胜数，十地菩萨数不胜数，自己算什么？</p><p>但是另一方面，菩萨戒里佛也要求菩萨一定要认识到菩萨的尊贵，菩萨不能轻贱自己，要好好保护自己，不能让自己随便处于危险境地。因为一个发了菩提心的菩萨，从发菩提心开始直至成佛，能利乐无数众生，无边无际的众生会因菩萨的发心而被救度出生死火坑。</p><p>我们算一算，十亿个地球上，究竟有多少众生？人类有多少，鬼类有多少，地狱众生有多少，畜生道众生有多少，大畜生如大鹏金翅鸟有多少，一直到最微小肉眼见不到的细菌众生有多少，任何人绝对想象不出来，不要说计算了，无数台电脑也算不出来。单独一个众生身体上的细菌就数不清了，何况空中的，所有众生身上的细菌众生。所以我们每位菩萨都任重而道远，好好保重自己，只是不要有太重的慢心。我们都曾经被很多佛菩萨救度过，因此就要发心同样的救度其他有缘众生，以报佛菩萨的救度之恩德，报无数众生养育自己和亲人的恩德。</p><p>四十八、如何断除贪爱烦恼</p><p>修行是为了断除贪爱，贪爱是在六根触六尘处生起，那就要在六根触六尘处止住贪爱。在眼根触色尘时，心不生起贪爱，就止住了贪爱；在耳根触声尘时，心不生起贪爱，就止住了贪爱；在鼻根触香尘时，心不生起贪爱，就止住了贪爱；在舌根触味尘时，心不生起贪爱，就止住了贪爱；在身根触触尘时，心不生起贪爱，就止住了贪爱；在意根触法尘时，心不生起贪爱，就止住了贪爱。按照内心的贪爱习气，本来应该生起对色声香味触法的贪爱，因为修行有力度，就制止了贪爱的现起，止住了贪爱，这就是修行之功，没有贪爱，就是修行之德，于是修行就出生了功德。德，就是品德，德行，是心的善的行相，有善就趣向于解脱，有善就近于自在，贪嗔痴烦恼就是束缚，不解脱，不自在。</p><p>功德不是容易出现的，因为无始劫以来的贪嗔痴烦恼根深蒂固，习气深重，不容易降伏和拔除，要经过长久多劫的思惟观行，观行贪爱之苦，一点点的降伏贪爱，如果不知道贪爱之苦，就不能降伏贪爱。因为众生都喜欢乐，都趣向于乐，躲避苦，如果现前观察到了苦，才会选择躲避苦，消除苦患。所以修行的第一步，要观察苦，认识苦，感知苦，才能把心从触六尘处缩回去，不深入到六尘之中，就不出生贪爱苦。没有第一步的观苦、知苦，就没有第二步的断集，也没有第三步的慕灭，也就没有第四步的修道。所以一个人能发起道心是非常不容易的，贪爱习性使然。</p><p>四十九、那么多人成天说大道至简，简在哪里？简在这里，只要放下自我，剔除自我，就达到无我了。但是做起来就不简单了，为什么？习气根深蒂固，自心遮障太严重了，以至于很难放下自我，就是连看破自我都是那样的难，更别说放下了。</p><p>学佛修行的目标就是要证得无我和解脱，那我们为什么还要追求个人自我的利益呢？这不与自己初衷背道而驰吗？学佛不能证得无我之果的原因，就是心中有个我，不与无我相应。有我就是绊脚石和拦路虎，何不尽快除去？</p><p>有智慧者，就不要一边追求无我之果，一边还以自我为中心，维护袒护各种我，追求小我的私利，与道相逆相违，这样就不聪明了。何至于如此矛盾？还不是无始劫以来的执我的烦恼习气造成的，如果自己不知不观察自心里的这种烦恼污秽，不想办法对治，总是随顺于我心我性，那何时能得到无我解脱？是解脱自在舒适，还是自我束缚自在舒适？两者比较，选择哪个？那么多人都是想的明白，做的糊涂，所以才不能证得无我之理，得不到解脱之果。</p><p>学佛修行需要有福德善根，没有在佛法中种过善根福德的，自然就不能在佛法有所受益。那些不皈依三宝，也不皈依佛的人，纵然世智辩聪，也不得智慧解脱。所以世俗人再聪明伶俐，也仍然不具佛法上的智慧，不是佛法中人。佛法只能度那些皈依于佛教，信重于佛教，愿意在三宝中种植善根福德之人。不愿意皈依三宝的人很难度化，他们即使来学法，也是搞研究，拿佛法作为消遣，不能证果和开悟以求得佛法上的利益。因为没有信根，也就没有五根，没有五根就没有五力，也就不能具足三十七道品，因此无法深入观行证果和明心，成为佛法中人。</p><p>五十、纵观一切众生，无不是贪爱六尘上的乐触，不肯放弃对六尘的触受。实际上贪爱都是苦受，没有乐受，可是众生都处于贪爱苦中而不自知。无数学佛人，学佛的目的还是为了享受世俗生活，追求于乐受，可是结果都是苦，只是无始劫来没有智慧认识到此理，盲目的追求乐，却没有真正享受到乐，这就是愚痴。愚痴烦恼最难摆脱，世尊苦口婆心的劝导，众生仍然处于愚痴无明之中，修行容易吗？非常不容易。所以才说，最初断我见之难，难于登天，应该看到这点，实事求是，不要自大。</p><p>五十一、修行的目的，不能盯着果位，果位是副产品，以降伏烦恼，去除无明为目标，以获得大智慧无量智慧为目标，以救度众生为目标，有这样的目标就纯正没有障碍了。</p><p>戒定慧实质就是戒心定心，使心生智慧。戒就是戒除烦恼，戒除我性，戒除遮障，这是戒的根本作用。戒除遮障，心不起非，才能有定，思惟深透，从而发起智慧。</p><p>五十二、修行的目的就是要破除一切无明，得到解脱。没有无明就没有烦恼，没有生死，没有束缚，一切烦恼因无明而来。如果把修行与其他方面挂钩，那就是无明，不得解脱。</p><p>而要想去除无明断除我心得解脱，离不开帮助他人共同得解脱。在帮助他人的同时，获得福德资粮，获得一切无我的见道资粮，培养自己无我的解脱心，培养自己慈悲喜舍菩提心，所以帮助他人就是帮助自己，二者之间不是对立的，是统一的。</p><p>有多少人学佛的目的就是为了获得知识，用掌握的知识理论，来获取世间的名闻利养，获取他人的恭敬，获取能够支配他人的权势，获得一个更强大的我。这样就增加了无明，更加束缚，更加不解脱，这样的知识理论，就是烦恼。而实证之后，却不如此，自心有相应一部分的解脱和轻安，同时也能带给其他人清凉，改善周围环境，能够利乐他人，自他都得利益。</p><p>众生的无明几大劫说不尽，如果有空能一点点的数落出来，会有多少人惊讶不已，自己原来怎样也想不到，内心都是无明。找不到什么法不是由于无明而生起的，谁都有无明，什么时候都有无明，任何事情上都有无明，无明广泛而普遍的存在。能找出明来都很困难，当有人认为自己没有无明都是明时，那就是无明。愚痴漫天遍野，无始劫以来，一直到无始劫以后，太多太多了。</p><p>五十三、如果没有修持，光是给别人讲，就像没有耳根的聋子给别人放音乐，音乐虽然好听，但自己一点也听不到，没有修持佛法的人也是如此。就像大海里的舟子（船夫），经常载人渡过大海，但有可能他自己会在大海里丧命，没有修持佛法的人也是这样。</p><p>五十四、现代人都不知道踏踏实实的修行，成天张口就说，到处说说说，不管说的是什么，究竟为什么，又图个什么？学佛修行难道就是为了彰显自我，让别人以为自己有修行懂得多？一些人想象力挺丰富，就是太欠缺实修实证，经常猜测佛法，而不是实际观行，还很自信。没有禅定的思惟都属于猜测，思惟离自己修证很遥远的佛法，也属于猜测，拿自己猜测的佛法跟人辩论，都属于彰显自我那类人。</p></div>"
},{
    "title": "第五章 戒律篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  戒律篇</strong></p><p>一、什么叫作学戒</p><p>譬如幼儿学走路，在能够正常走路无碍之前，都处于学走路阶段。学走路时常常跌跌撞撞，手有扶物，身有依倚，不免时而摔倒，跌坏手足。直到腿脚娴熟，东南西北自由开步，学习结束，名为独行者。但不免偶尔绊倒，即使成人也有不小心绊倒之时。又譬如幼儿学语，咿咿呀呀，一字二字，再至成句，终至自由表达自心之意，无有障碍，学语结束。</p><p>菩萨学戒也如是，烦恼习气攀附于心，不自觉知。新受戒律，不懂其义，不知如何守持，月月诵戒，以明其理，不时违戒，发现即悔，悔过即改，改过再犯，辛苦周章，轻戒难守，重戒也犯。直至烦恼断除，三果四果，自由洒脱，随缘自在，心无负累，也不越距。重戒不犯，轻戒能守，但仍不免偶尔疏忽，轻戒有漏，重戒无犯，此名持戒，相应于初地到八地。八地以后，习气断尽，任运自然，于诸戒律，无持无犯。</p><p>若有违犯出家菩萨十重戒，以及在家菩萨六重戒者，不名持戒，只名学戒。若轻戒难守，多有违犯，不名持戒，只名学戒。学戒不易，难于婴儿学语练步，然此是菩萨成长必经阶段。过此阶段，名为菩萨大人，如来之子，心得解脱，自在无碍，驰骋于三界，理事圆融。</p><p>二、在守持戒律方面，修行人身口不犯业行已经很好了，意业很难守。如果心总是住在一个正念上，那么邪念就没有机会出现，这就是守戒。什么是正念？念佛、念法、念圣贤僧，念诸行无常、诸法无我、涅槃寂静。修心之法懂得多而深，意业就会减少；定力增强，意业也会减少，懂得因果之理，心里的警觉性就高。</p><p>守戒，首先是做到明理，不是强行控制自己的行为，理明了，意根受熏，意业自然不现前。一切修行中明理最重要，知见能够引导自己的身口意行；其次定深能够伏住烦恼；最后识因达果，懂得此事的起因能够感召彼事之果，明白身口意一切业行造作当下，自己的如来藏都有记载，果报一定要实现，心的警觉性就提高了。这其中都有个过程，受戒得戒体之后，戒体本身就有防非止恶的功德作用。菩萨戒体更是如此，菩萨戒是戒心，要想完全守持好不犯戒，必须要修到一定的菩萨果位，在此之前，都难免要犯戒，轻重会有所不同。受菩萨戒有极多好处，自己警觉性大，再加护法善神的守护，道业进步很快。</p><p>三、关于五戒的开遮</p><p>一切戒行，只要是能够让众生得到大利益的，而且是根本利益，不遮，可以开缘；为自己私利就不行了，一律遮止，不能因为个人烦恼恶习而开戒。酒戒，为了治病，可以用药酒，涂身、饮用都可以，不能贪酒味。杀生戒，可以吃药杀菌，其它蚊子蚂蚁苍蝇虫子之类的，只要无害心，不是故杀，不算犯。</p><p>盗戒，他人没有同意的，拿了算犯，为了他人或集体更大利益，不算犯，严格来说，不是自己的东西，只要起心想归己所有，就算犯。淫戒，非己配偶，行非梵行，就是犯，这里有开戒的条件，大家还不具菩萨性时，暂时不说。妄语，大妄语，没有证得禅定说证，没有证罗果而说证果，没有明心而说开悟，是大妄语，必受恶报，但通忏悔。其它的是小妄语，如果为了帮助他人救度他人，可以开戒。大的原则是这样，具体遇事时，需要用智慧来具体对待，没有私心和烦恼心，为众生为团体都可以酌情考虑。犯了五戒，可以忏悔，还可以重新受戒。</p><p>四、学佛人中有多少人能严持五戒，丝毫不犯，能得满分的？五戒有点缺漏，能得八十分的人有多少？持大部分五戒，能得六十分的人有多少？恐怕都很少。不妄语这条戒我估计没有几个人能持得了，或者说一个人也不会有。所以人不是完全诚实的，是不可完全信赖的。</p><p>每个人完全不杀生吗？偷盗，也叫作不予取，别人没有同意点头，自己就拿了，就是盗。不属于自己的，心里认为是自己的，就是盗。包括人，不属于自己配偶，而心里生邪想，也是盗。心思不正常，用意不真不善，都属于邪。没有取得别人同意，随意吃别人的喝别人的，都属于盗。很多人都很随意，随自己的意，不管不顾。有的人还使用手段强行让他人不得不同意，而他人口上同意，心里不同意，仍然属于盗。盗，包括名声，骗取名声，骗取地位权势，都属于盗。</p><p>人总喜欢攀缘，自私自利，不随缘，不守心，不厚道，贪求很多，结果造成犯戒，心里散乱，不得禅定。还有多少人没有受五戒，也根本不想受五戒，连戒都不想受，不想守，却想要有很深的禅定和智慧，那是不可能的，妄想证果开悟更是不可能了。</p><p>五、增戒，是再一次受戒的意思。增上缘，是帮助协助出生识心的一种缘（法）。增语，语代表音声语言，用音声语言显义，叫作增语，帮助显示法义的语言音声叫作增语。这里的义是指菩萨摩诃萨之义。</p><p>六、没有证得无为法时的持戒，都是有漏、有烦恼的，与烦恼相应的持戒，是有漏持戒。证得无为法以后，再加修的戒是增上戒。心行真正无漏的人，能做到无漏持戒的人是三、四果人及初地以上的菩萨，他们的心行不与贪嗔痴烦恼相应，是无漏的。</p><p>开智慧的前提条件有很多，戒是其中之一，不是全部。只有持戒还不行，还要有福德和禅定等等条件。有无数持戒人并没有智慧，只能保住人身，或生天享福。而没有智慧也不能守持好戒行，对于戒相不懂，对于戒的内涵和目的不懂，不知戒的开遮持犯，只在相上着手，不知修心，有时犯戒也不知，还以为是守戒。更多的人是守小乘的有相戒，而犯大乘菩萨的利他戒。</p><p>小乘戒是修自己，不管他人。菩萨戒是起心动念为自己就是犯戒，真正的大菩萨是应该心心念念为众生，只要对众生有益，对佛法流传有益，宁可自己犯戒受苦，也要做有益于众生的事情。有时守小乘戒，就会犯大乘戒，守持大乘利乐众生的戒，就会犯小乘戒。菩萨在这时就要善于抉择，宁可自己犯小乘戒，而守持大乘菩萨的心地戒。</p><p>释迦佛在做菩萨时，为了救度众生，而不得不违背小乘戒，就是为了成全众生，护持正法。为了护持正法和救护众生违背小乘戒，不仅无罪，而且有功。佛在经中也说，在恶世里，为了护持讲正法的法师，可以蓄刀仗，可以杀破法恶人，这样做，他的功德远大于讲正法的法师，命终到佛身边作佛的第二大弟子，而讲正法的法师命终却作佛的第三大弟子。</p><p>我们学佛先做菩萨，最终要成佛，所以应该学好大乘菩萨戒，守持好大乘菩萨戒，这就是守持自己的心。当菩萨戒与小乘戒起冲突时，我们应该善护自己的心地戒，不为自己的个人利益，一切为大众，为佛法，这样成就的才快。</p><p>七、问：末法时期我们应该如何持戒？是不是初学佛人要持五戒和八戒，而久修菩萨就可以不用持有相戒，可以抛弃相不分别相，直接持大乘菩萨的无相的心地戒？</p><p>答：首先需要弄清楚初学菩萨与久修的概念内涵，什么阶段的人属于初学，什么阶段的人属于久修，各自的特征是什么，心里状态怎么样。</p><p>久修菩萨因为多生多劫做过菩萨，有菩萨的习气，不但生来烦恼就非常轻微，或者是没有烦恼，身口意行都很清净，不用人教导就是如此自动自觉，而且还能不自觉的习惯性的喜欢教化众生向善，却不是为了彰显自我，完全是希望众生弃恶从善。既然菩萨生来烦恼就轻微或者是无烦恼，那只有地上菩萨再来才能做得到，前世就已经断除了烦恼，今世因为有隔阴之谜，偶尔会有很轻微的烦恼，这应该称为烦恼习气。</p><p>久修菩萨生生世世证悟菩提，今世遇见佛法就会自动自觉的按照前世修行的惯性和方式方法去修行，能很快生起禅定，不久就能自动证果和再次明心开悟，不会很困难。证果和明心以后很快就能与前世的证量相连接，果位还是前世的果位，禅定还是前世的禅定，如果再接续修行，道业进步很快。对于教化众生方面，不用现学现熏习，自然而然就懂得如何教化众生，不会引领众生趋向贪嗔痴，不会姑息众生的烦恼，很自然的就成为一个严师，对弟子高标准严要求。</p><p>只有这样的久修才可以有效的持大乘菩萨心地戒，因为心地已经清净，不会违犯佛陀制定的有相戒，比如五戒和八戒不用特意去守持，自然而然不犯戒，身口意行都清净。因为有初禅以上的禅定，烦恼断除了，心地清净，在这基础之上，才能持无相心地戒，心里可以不受戒相的束缚，只要不影响心地清净的事情都可以做，目的是救度众生，而不是随顺自己的贪欲。</p><p>如果一个菩萨内心还有贪欲，还有嗔恚，愚痴也很重，那就必须严格持有相戒，五戒八戒一条条都要严格守持，坚决不犯，犯了就要疾首痛心的发露忏悔，尤其是菩萨戒，更要严格守持不犯，不能稍微姑息迁就自己。贪嗔痴烦恼一个都没有断的菩萨，尤其连最基础的未到地定也没有的菩萨，还没有资格持无相戒，也根本持不了无相戒，因为心地不清净，起心动念都与烦恼相应，必须持好有相戒，一步一步的从各种事相来约束自心不越距，初禅定生起以后，断除了烦恼，才能开始试探着抛开相而守持心地的清净。</p><p>如果没有以上久修菩萨的特征，都属于初学菩萨，都应该严格修持有相戒，不能废弃身行和口行的约束，任意胡为，随顺自己的贪嗔痴烦恼。有的人因为不能戒肉，不能戒酒，不能戒荤腥，非要享受这些口福，就找借口说，我不取相分别，我持心地戒，虽吃荤腥而内心不着荤腥相。既然如此，直接吃素有多好？为何还要挑食每日菜式变换着花样，重复一下都不吃？如果心里已经不着相了，一年365天吃一样东西应该不会厌烦，善知止足才对，春夏秋冬四季各一套衣服就好，渴了只要喝水就好，何必那么讲究，又不是进别人的口里和胃里。</p><p>现在的学佛者，可怜可愍可恨！明明善根轻鲜，却以久修菩萨自居，明明无法持五戒八戒菩萨戒，却要高喊着持无相的心地戒，丝毫没有自知之明，都是高大上的空喊口号者，长此下去佛教必衰亡，没有人能成就。世尊亲口宣说的戒定慧三无漏学，现在就要废弃戒学和定学，只要一个乾慧的慧学，一个个讲起佛法来，口若悬河头头是道，实际上什么修为也没有，眼高手低。这就是现在佛教界的乱相，没法整治，因为众生强大的慢心所致。</p><p>八、有人说：因缘对境，拿起放下，自在洒脱。但是这不是真正的放下，也不能自在和洒脱，这是自我麻痹。想要真正放下，就要真正断我见，修出初禅定断烦恼，断除贪爱，然后才能放得下，才能洒脱。没有修到这个地步，就不是真正的放下，只傻不脱。</p><p>很多人不希望被束缚，都想自在，却不知道何为束缚，何为自在。于是把戒律当作束缚，把禅定当作束缚，觉得受戒律的约束不自在，再于是就不要戒律，无拘无束。殊不知，佛陀之所以制定戒律，目的就是为了让众生得解脱，也所以把戒律叫作别解脱戒。众生由于守戒，不犯戒，就没有因果恶报，守戒容易断我见，容易降伏烦恼和断除烦恼，断除烦恼才能得解脱，才能自在，心不逾矩，也无心于人，无心于事，这才是真正的解脱。有想不受约束的心，就是不解脱不自在的心。戒衣，也叫礼忏衣，也叫作解脱服。受戒、诵戒、念经、忏悔时披。由此法事，心渐渐得解脱。</p><p>九、什么是守心戒</p><p>守心戒就是不让心起心动念，不起贪嗔痴烦恼。这个很难，必须断除烦恼才行，压伏烦恼都不容易做得到，经常有压不住的时候。现在的世间，身口戒都不容易守，犯戒的机会很多，稍微把持不住就犯身口戒。</p><p>因为什么犯身口戒呢？因为心，心有贪嗔痴烦恼，就会促使身口造业，如果能守住心，身口就不会犯戒造恶业了。如果心能不犯戒，身口无论怎样都不是犯戒，因为没有贪嗔痴烦恼心行。一切戒以有心无心为衡量标准，但是一般人很难看明白他人的心，就以他人的身口作为标准了，当然衡量错误的时候就很多了。</p><p>小乘戒行以身口业行为准，身口不犯戒就行，不管心行如何。大乘菩萨以心地戒为标准，起心动念都不为自己就好。真正的大乘戒很难守，像瑜伽师地论里的菩萨戒，就是为初地以上的地上菩萨制定的，地前菩萨没有断除贪嗔痴烦恼，无法去守，只要身口犯戒就算犯戒，地后菩萨以心行为标准，只要心为众生，就不犯戒。</p></div>"
},{
    "title": "第六章 因果篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  因果篇</strong></p><p>一、从前有个老和尚，牙齿不全，吃饭的样子不太好看，一个小沙弥见了，就说他：你吃饭像牛嚼草似的。因为这一句话，沙弥死后，五百世堕牛身，吃草嚼草。释迦佛住世时，他得为人身，随佛出家俢道，他虽然出家成为沙门了，因为前世的业没有消净，还有余业，他吃饭时还像牛嚼草似的。他随佛修行一段时间以后，就证得了罗汉果，但是吃饭时仍然像牛嚼草似的。</p><p>佛就对他说：你这样子会让很多众生讥笑，他们要因你而造作恶业，那个果报比你从前的果报还要严重，因为你已经是阿罗汉了，你不如就在天上住吧，人间僧团有事时，你再下来。他遵佛语，就住在天上，无事就不下到人间来，免得众生看见造恶业，以至于佛涅槃离开娑婆世界，他也不知道。这个罗汉是谁呢？就是娇梵波提。因果昭昭不爽，身口意造作的当下，不管善恶，都有记载，都作为业种收存，因缘聚会时，必受果报，大家应该慎护身口意，免遭恶果。</p><p>二、出家的沙弥讥笑出家的老和尚，就得五百世为牛那样大的恶报，如果在家人讥笑出家人，该得什么恶报？如果在家人讥笑出家人讲法，应该得什么恶报？如果在家人诽谤出家人讲法，应该得什么恶报？如果在家人讥笑得道的出家人，应该得什么恶报？如果在家人讥笑得道的出家人讲法，应该得什么恶报？如果在家人诽谤得道的出家人讲法，应该得什么恶报？</p><p>因果不是一般人能思议得了的。如果一个人有慢心，喜欢讥笑他人，不管对方是什么人，都有恶报。如果一个人喜欢撒谎欺骗他人，东说西，西说东，妄言绮语，总是不正说，不管对方是什么人，都有恶报。如果一个人喜欢呵责他人（父母师长除外），无尊卑长幼，显自己聪明才智，也有恶报。</p><p>总之，身口意行的十不善业，都有恶报。所以学佛应该懂因果，应该守戒律，应该守护身口意行，应该识善恶之别，努力断恶修善。心性转变，接近于圣贤人的心性，才能有机缘成为圣贤人。成为圣贤人的先决条件是具有接近于圣贤人的心性，才有资格成为圣贤人。</p><p>三、以佛那样的德，完全可以说阿罗汉圣者是焦芽败种，如果修证水平不如阿罗汉的人，不管他是什么人，都不可以说，说了都有恶报。凡夫的善根不如阿罗汉之一毛，无任何资格诽谤阿罗汉是焦芽败种，有证据也不行，是事实也不行，必有恶报。在家人说普通的出家人也不行，也有恶报。德高的人可以说德低的人，有戒律的人可以说无戒律的人，先受戒的人可以说后受戒的人。戒，就是德，有出家戒就是德，有菩萨戒就是德，敢于出家就是德，能够出家放弃世俗就是德。有修有证，更是德了，修证的高，德就高。德低者不可以说德高者，无德者更不能说德高者，否则恶报不轻。</p><p>四、因果是通三世的，三世就是前世、今世、未来世。那么现在所做的事以及善恶遭遇，也许是果也许是因。所谓的果，就是前世有因，今世收果；那所谓的因呢，就是今世所做的事情作为因，未来世有果。如果别人对你造作了不管是善法也好，是恶法也好，也许是果也许是因，如果是果呢，那么前世你种了因，今世你该得这个果；如果不是果而是因，那么对方就是在你身上种因，未来是他要得果，这就是因果通三世的法则。所以现在的遭遇不一定是果，也不一定是因，只有神通的人或者大智慧的人，才能判断出来，这件事到底是因还是果。</p><p>如果所遇的事情是果，那我们一定要随缘，不要在意。如果是因，我们一定要小心造作，尽量保证对人和对己种好因和善因，将来好得善果。如果尽力了，也改变不了什么，那就随缘。但最基本的我们要保证自己种的都是善因，不要种恶因，以免未来世遭遇恶果。</p><p>五、问：万法皆空，因果不空。为什么师父说\"因果也空\"呢？</p><p>答：空，是不实幻化义，是生灭义。因果也是生灭幻化不实的。如果因果不空，造作了业因，就会永远有果报出现，果报不会结束，众生永远不能消业，永远不能得解脱，这是不合理的。比如说地狱业种现行，地狱业受报完了，以后不会再继续受报了，如果继续受报，众生就不能得人身。众生的生死了了，果报就结束，然后成佛。如果因果没完没了的受，哪个众生也不能成佛，不能脱离六道轮回。</p><p>杀人的业受报结束了，以后不会永远受杀人的业报，这样的因果才合理。你欠我一百元钱，还我就完事了，这件事就结束，难道还要永远还下去不成？没有这样的因果。因果到底空不空？如果不空的话，我就到处撒钱，得到钱的人将要还无量劫也还不完，那我就永远不用再布施修福，坐享其成就行了。这样是不合理的，因此说因果也是空的，来无所来，去无所去，报完就没有因果了。</p><p>六、因果为什么也是虚幻不实的</p><p>果报分为正报和依报，正报是五阴身，依报是宇宙器世间生存环境。因果的实现，主要是通过五阴身来实现的，果报是报在五阴身上的，所以五阴身是正报；而生存环境是依报，也体现了众生的因缘果报。五阴是幻化的、十八界是幻化的、我们生活的宇宙、器世界是幻化的，生存环境是幻化的，果报因果就是幻化不实的。</p><p>既然我们的一切果报都从这些虚妄法上体现出来，果报就是虚妄的。比如你受的善报和恶报，不管是发财也好，生病也好，遇到灾难也好，是不是都在这些虚妄法上来受报？这些虚妄法是虚妄的，果报是不是虚妄？当然都是虚妄的。所有的果报，无非是在五阴身上体现。五阴身虚妄，果报就是虚妄的；而且这些果报是生灭变异的，是无常的，无常的就是虚妄的。所以，一切因果也是幻化的，一切法都是幻化的，除了如来藏，全部是幻化出来的法。</p><p>比如说贫穷的果报、六根不具的果报，还有所有的乐报和苦报，这些果报是不是幻化的？全部是幻化的，都是如来藏依照业种和各种因缘所幻化出来的，都没有实法。再比如你得了善报，升官了发财了，或者亲人团聚了，财色名食睡等等种种的善报，这些报报在哪里？都报在五阴身上了，从五阴身上体现出来。五阴身是幻化的、不实的、虚妄的，那么这些果报更是虚幻的、幻化的、不实的，都不是真实的法！</p><p>再比如善报，今世在世间当了国王，或者上天当了天主，国王、天主的宝座是不是幻化的？生活的宇宙、器世间、宫殿是不是幻化的？锦衣玉食是不是幻化的？所有的仆人、大臣、宰官、身边的侍从，这是不是都幻化的？所有接触的一切，这些都属于善的果报，这些果报哪里来？如来藏根据业种、根据因缘所幻化出来的。所以当国王、天主的善报就是幻化的、不实的。</p><p>再比如说被杀、车祸死亡这些恶果报，这些果报都是由五阴身来承受的，五阴身为什么被杀？为什么被关进监狱？为什么失去那么多的财产和亲人？这些都属于恶报，这些恶报哪里来的？都是如来藏根据业种，根据各种因缘幻化出来的假相，都是在五阴身上体现出来的。受了恶报，觉受就是苦受，这种苦受不是识心的受吗？识心的觉受从哪里来？如来藏幻化出来的，一切法不管善报还是恶报，都是如来藏所幻化出来的。没有如来藏，一切法都没有。</p><p>既然是幻化的东西就是生灭的、不实的、变异的、空的，那就不是我、不是真实的、也不是我所拥有的，就叫作无我。依据如来藏来说，全部是不真实的法，所以全部都是空幻的法。</p><p>七、众生由于贪吃，付出的代价最大，果报最快最明显的是什么？</p><p>在地球形成的最初期，那时还没有众生，没有人类。二禅天的光音天天人，飞行到地球表面，着地以后，看到地球表面厚厚的地肥，就觉得很好吃，由于好奇，每个天人都尝了一尝。结果由于这一口两口的美味，天人身体变得沉重起来，有的不能飞了，有的飞不高不远了，吃的越多身体越沉，越不能飞，于是这伙天人就留在了地球上，回不去天上了。他们人少，害怕寂寞，就喊来了天人其他同伴，同伴到地球上都品尝了地肥，就都飞不回去了。于是，地球上的人类越聚越多，这些人就成为了地球最初的人类。</p><p>欠谁的能行？贪什么能行？结了缘业缘就会连在一起，缘分分不开了。有的人活着的观点就是，能吃就吃，想吃什么就吃什么，不吃白不吃。这样贪的结果是什么呢？由于贪吃，就会被饮食所束缚，不得解脱，在欲界里苦恼无量，因此贪吃得不偿失。</p><p>八、意根无始劫以来的烦恼，熏染六识，使得六识不自觉地就造作业行（是意根指使的），业种又存入第八识，再熏染意根。这样反复地熏，众生真的是没有解脱之日。众生造起业来，不管不顾，天不怕地不怕，让人看了心里直打冷战。菩萨能直接感受到各种业行将会受到什么果报，那些果报受起来真是痛苦，即使地上菩萨也很难承受。</p><p>九、出了三恶道的众生，由于爱欲所生。贪爱的后世果报，大多数去鬼道酬尝业果，贪爱轻微的可以做人，可以升天。贪爱属水性，水往下流，下就是三恶道。楞严经中佛说，可查佛经。有人大肆鼓励学佛人贪爱男女，说是要结缘。缘是结下了，至于善不善，依佛意，没有好结果，六道轮回，生死苦恼。</p><p>有个人出家不久，就被女朋友纠缠回去了，然后再出家，又被纠缠回去，如此反复七次，苦恼极了。你想解脱，她偏要纠缠你，不让你解脱，生死冤家一个。一个人想清净，却被人纠缠不休，那个滋味，太煎熬难忍。有的人会说，菩萨应该慈悯于众生，妻子儿女也是众生，当然更应该慈悯。但是慈悯要适当，要适可而止。如果只单独慈悯自己的家亲眷属和有缘人，把所有的时间精力都耗费在极少的几个人身上，这几个人根器又不够好，以此耽误自己的道业，那就不值得了。这种慈慜就是贪爱，不得解脱，不是佛所提倡的。</p><p>菩萨的慈悯，应该以慈悯大多数人为主，集中精力修持出来，就会利益无量数的家亲眷属和有缘人，就会利益生生世世无量劫的父母妻子儿女，而不应该把主要精力放在当前的一妻一子一父一母上。小爱与大爱相比，微不足道，被小爱摄持，就会影响道业。菩萨的目光应该长远广大，要发愿以自己的智慧之光普照全天下所有众生，大慈大悲的心才是真正的菩萨心，小慈小爱只能障道，应当尽快舍弃。</p><p>十、什么叫作谤</p><p>杂阿含经中记载，有外道或者某居士，向世尊的弟子请教佛法，弟子回答之后，就想：我这样作答，是否符合世尊的法教，不会违背世尊、毁谤世尊吧？于是这位弟子就去请教世尊说：世尊，有外道问我佛法，我是这样作答的，是否毁谤了您呢？世尊就说：你回答的正确，没有毁谤我。从这里我们应该知道，说话或者语言表达只要不符合事实，就是谤。弟子传导的佛法如果不符合佛意，与佛不一致，就是谤佛。如果佛说某种法是如此，弟子说不如此，就是谤佛，也是谤法；对于佛说的法教，说个不字，就已经谤佛谤法了。</p><p>那么谤僧也就很容易了，谤僧又分为谤凡夫僧和谤得道的比丘僧和菩萨僧，前者的罪业还轻一些，后者的罪业就相当大，果报是不可思议的。你只要否定了比丘僧和菩萨僧，说个不字或者不是、不对，而事实不是如此，那么诽谤罪就成立了。众生往往都不在意这些，认为否定别人没有什么过错，轻易地就开口说不对或者不是，而这不仅仅是过错的问题，而是罪业的问题，涉及到根本问题的往往都是地狱罪，后世就要领受自己诽谤胜义僧的极大恶报。当后世真受了恶报时，往往也不知道自己为什么得到这样的恶报，于是糊里糊涂地受报，再糊里糊涂地造业，众生就是这样的愚痴无知。</p><p>十一、破戒的前提应该是已经受了戒，有了戒法，如果没有受过戒就没有破戒之说。破是破坏的意思，没受戒，谈不到破，但是恶业重的也有遮障。如果犯重戒要殷重忏悔，需要见好像才能消除恶业，有必要重新受戒。</p><p>犯重戒可以往生极乐世界，只要临终没有遮障。如果临终一念，恶业的境界出现在心里，随即随着恶业就要受恶报。临终前要把心里的念头清净了，不能有杂念出现，才能不去三恶道。得初果向和初果，也可以灭罪。就怕业障遮障不能得初果向。</p><p>佛给自己犯重戒和重罪的弟子，讲实相，讲五阴的空相，弟子不仅灭罪，也证得了实相。如勇施菩萨开悟之前，犯了邪淫戒和唆使杀人罪，佛讲大乘无生理，就开悟证得实相。阿奢世王杀父，佛给他讲五阴虚幻不实，就灭了阿奢世王的极重罪，得了无根信，没有证得初果向，因为罪太大了。如果不是佛给他讲法，他连无根信都不一定能得到。但是如果阿奢世王杀母，那就不一定能灭罪了，也不一定能得无根信。</p><p>受戒以后犯戒，有个性罪，就是心性罪，还有一个戒罪，违背戒律的罪。没有受戒的，只有性罪遮障，没有戒罪的遮障。但不受戒，戒律不圆满，道业无法增进，障碍证果和明心见性。</p><p>十二、明心见性的菩萨如果造作恶业，果位是否要失去</p><p>菩萨璎珞本业经里，佛说菩萨造作了有违菩萨之业行，三贤十地皆失。地前菩萨因烦恼未断尽，偶尔也会因烦恼而造作恶业行；地后菩萨还有烦恼习气未断尽，也有可能会因烦恼习气而造作些微恶业行，那些烦恼余习很深细，不容易断尽，一旦断尽以后，就进入到八地，成为八地菩萨了。可是八地以上的菩萨还有微细的无明，也就是非常微细的愚痴，对极其深细的佛法还有无知，到佛地才能全部断尽。</p><p>普通众生不断我见，或者我见不断尽者，还会因为我见而入三恶道。众生造业，就是因为“我”，无数烦恼因“我”而来，因此有必要通过修行把我见断尽，并且降伏我执。但是人我执断尽，还有更微细的法我执等着我们都要断尽。烦恼习气也不可轻视，地上菩萨有烦恼习气的现行，也是很难断的，所以地上菩萨难免有过失，有微细的恶业行，如果有违佛戒，其菩萨果位也要失去。</p><p>所以我们学佛修行，每天要反观自己的主要烦恼结缚在哪里，然后着重来观行解决，不能让深重的烦恼障碍自己的修行。依据烦恼断除与否和智慧程度，而分为贤人和圣人，断我见的初果二果人还是贤人，不是圣人，三果四果人和初地以上的菩萨才是圣人，地前菩萨为贤人，因为还有贪嗔痴没有断，所以其德行不足以为圣人，真正的圣人、具足了圣人所有德行的，只有佛一人。</p><p>十三、问：下地狱受惩罚的是第几识？其中有几个识一起去地狱了？</p><p>答：意根与第八识一起下地狱，然后六识马上出生，意识就发现：咦！我怎么下地狱了呢？再然后，身识感觉被刑具惩罚的强烈疼痛，意识感觉无比的痛苦，六识全部感觉苦痛，意识就很无奈的承受各种痛苦的折磨，直到业报尽了，才能出地狱，但不知多少劫的时间过去了。无间地狱里有宽广的大铁床，地狱多大，铁床就多大，地狱是无边广大的，铁床也无边广大；铁床多大，色身就多大，所有的刑具全部同时加在色身上没有空隙，全身各个部位都能感觉到刑具的残酷折磨，痛苦不堪，疼死过去，马上又清醒过来，再接着受折磨，诽谤三宝，就是如此下场。</p><p>诽谤三宝，包括有根诽谤和无根诽谤。有根诽谤，是指其人所说是事实，但是也有罪，所以佛陀为僧人制定的戒律不允许在家人看，就怕在家人知道戒律而去指责出家人犯了戒律，这样就诽谤了三宝。无根诽谤，是根本没有此事说有此事，捏造事实，罪过更大，二者俱有罪过，所以大家不要说三宝的过错，不管有没有其事，都要懂得闭口，果报可怕，惨不忍睹。过去有人诽谤阿罗汉，阿罗汉就召集众人，让造诽谤业的人当众忏悔，以消除那人的罪过，那人就当众向阿罗汉忏悔，以消除自己的罪过。但是命终还是下了地狱受恶报，只是受恶报的时间短一些，如果不忏悔，很难从地狱里出来，在地狱里受的罪也非常重。</p><p>如果三宝中，有证得大小乘果位的圣贤人，对圣贤人造作了诽谤业，那个罪业有不可说之严重，无论是在佛法上的诽谤，还是世俗日常生活的个人行为的诽谤，无论是否是事实，一律都是罪过无边。出家人的身口意行，无论怎样，都不能指责，否则罪业深重，必受恶报，尤其是得道的出家人，更不能指责其身口意行一点点过错。烦恼极重的人，离三宝近住，未必是好事，因为烦恼极重的人，对谁都能造恶业，他不管对方是谁，都是无所顾忌，控制不了自己，因此这样的人，还是离三宝远一点好。</p><p>十四、圣人所为，未得道人不能盲目跟随。智慧不同，用心不同，结果就不同。未明心地之人，不见无相之相，不知无生之理，见法实有，不知究竟。明心之人，知法无生，相本非有，虚妄不实，诳惑人眼。见相实有，即有业行，见相非相，业行也妄。心智不同，业果不同。昔有道人，把诸佛菩萨的名号写满内裤，穿在身上，有一愚人，见已便学，几日之后，吐血而亡。</p><p>圣心不学，单学其相，不知其有独特用心，众生因愚，害己不已。昔有丹霞禅师，为度执相之人，而用独特手段，火烧木佛。道人心中，实证无生，无有四相，也无一切相。木佛非佛，无有舍利，有无舍利，都非真佛。真佛无相，火烧不着，水淹不着，风吹不着，石打不着，山压不着，啼唾谩骂，侮辱诽谤，皆也不着，即使上帝，无奈其何。众生蠢蠢，莫学丹霞，木佛石佛，以像示人，心存恭敬，福即增长，若能礼拜，其福无边，折倒慢幢，摧伏己心。精进修行，早悟无生，识得己心，即是佛心，见性成佛，不由于他。</p><p>十五、末法时期众生心思浮躁，而有的人恰恰要顺应众生浮躁的心理，取悦于众生。如果一点也不与众生的恶习相逆的话，那么如何扭转众生恶习，如何让众生得到解脱？众生不仅贪婪，也愚痴，非要舔刀尖上的那点蜜，最后得到的是什么？没有人去考虑。多数人只顾眼前的一点点所谓的利益，却冒着去三恶道的风险，看似胆大，实则是因为愚痴，目光短浅，不能为未来久远的大利益着想。</p><p>大多数人其实都是为个人利益着想和打算的，做出的事情，却让自己不仅得不到利益，往往还会失去已有的利益。可是却没有人想到这一点，也看不到这一点，因为什么？因为无明愚痴，因为烦恼遮蔽了自己的双眼，看不清自己，看不清真正的利弊得失。</p><p>对于因果，很多人并不真正相信，总是存着侥幸心理，以为因果都会落在别人的头上，不会落到自己身上。所以就为了自己的利益，而说他人如果不听从自己的安排，一定要有某种恶果报，却不知自己的恶果报即将到来，自己正在造恶果报的因。我初学佛读经书时，看了一些因果方面的真实故事，相信因果真实不虚，身口意都小心造作。可是现在的学佛人，根本不读佛经，不知道佛经都在讲什么，因此心盲不懂因果。</p><p>现在网络发达，造恶业比从前要方便得多，手指头动一动，恶业就传播于全国各地，真是令人唏嘘不已。没有人警觉到自己动手指头之后的恶果是什么。无知者才无畏，心被堵塞，盲从他人，不知善恶，造下了大恶业，不知悔恨。有些人造恶业是被人唆使教唆，自己并不知情。比如被人告诉说，你这样去做，没有事，因果由我担着，你只有善果，没有恶果，于是有些心盲者就相信此人所说，以为此人真能替自己承担因果。殊不知因果来临时，各有各的果报，根本不能互相替代，即使是亲生父母，也无可奈何。</p><p>十六、生死流转的业缘就是贪爱</p><p>因果命终显现，犹如秋后算账，当然也有夏天就算账的，业果非常大的时候，果报就会早熟，不到秋天就算账。每个人在临终时，如果内心是贪念，无论是贪家亲眷属，还是贪人间生活，贪财贪情，都要去鬼道受生。如果临终一念是嗔念，无论嗔什么，比较严重的，都有可能去地狱受生。</p><p>所以如果把希望都寄托在临终，以为自己临终能念佛，能保持心地清净，那是非常不可靠的，临终指不定会有什么情况发生，指不定自己是什么心念。如果平时的心念都把握不了，临终四大分解，业障再现前，冤亲债主来讨债，极大多数的人随着业缘起心动念而去三恶道，保证不了不入三恶道，福报非常大的业行例外，可以升天享福。</p><p>能保证不入三恶道的，一是断我见，二是明心见性，三是观无量寿经中地观成就。念佛预知时至都不保靠，到临终时念佛心不专一，诚心不够，佛就不会来迎接。百分之九十多的学佛人，临终时都去了三恶道受生，其中大多数还是去了鬼道，因为百分之百的人都有贪心，都没有断除贪欲。断除贪欲的情况就是断我见之后，生起初禅定，在定中断除贪欲和嗔恚，除此都有贪欲心。但是初果和二果人即使有轻微贪欲心，因为断了三缚结，就不会去鬼道受生了，只能到欲界天或者人中受生再接着贪，或者再慢慢断贪。</p><p>六道轮回就是这样的无情，不讲情面。没有真修实证，命终撇尔随业缘而去，随着贪念而去，没有选择的余地，因为平时没有训练，也没有训练成功。只有断我见之后的人，才是训练成功之人。</p><p>但是没有真正断我见明心之人，仍然没有训练成功，仍然没有断除三缚结，仍然要随着贪念而去鬼道受生，不可避免，尤其是违犯五戒菩萨戒的人。无数学佛人都不自觉，还是每天贪吃贪穿贪住，喜欢享受，喜欢所谓的自在，喜欢风光，喜欢舒适，喜欢琴棋书画各种艺术，这些喜欢就是烦恼结缚，绑缚自己在六道里，就是心病。每个人该享受的都享受了，活一辈子并不吃亏，没有亏待自己，可是后世怎么办？是现在享受重要，还是后世免除三恶道苦受更重要？</p><p>还有一些高大上的修行方法，说吃肉时不作吃肉想，吃肉时真不作吃肉想的，已经转了心地的人，济公和尚算是一人，其他人有几人能做得到？既然对肉不感兴趣了，为什么非要吃肉不可？让畜生少死一只不好吗？临终的时候，肉的主人来讨债，是否有能力不还债？</p><p>十七、因果这个东西，要来的时候，谁也阻挡不住，任他有多强大的势力，谁也对付不了因果。喜爱攻击别人的人，敢诽谤三宝的人，因果来得非常快，如洪水一般势不可挡。明了因果，我们心里太平。</p><p>十八、凡夫也应该如菩萨一样畏因</p><p>因果，因很细小，果会无限大，菩萨懂因果因此畏因，凡夫不懂因果只是畏果。菩萨害怕种下不好的因，以免得大恶果，而凡夫得到大恶果报来临时，才觉得这个命运是可怕的，虽然觉得可怕，仍然不会觉悟，不知道可怕果报是因为自己一个细小的心行造成的。</p><p>十九、一个学佛修行之人，应该善于自责其心，应该常常反观内心，发现不如法之处，就应该自责其心，把心导正，向于正途，远离贪嗔痴烦恼，远离无明。应该常常思惟，究竟是自己的道业重要，还是自己的不如理觉观重要，还是世俗法的贪嗔痴业行重要。应该常常思惟，自己在世俗法上所谓的利益，是不是长久的，是不是真实有的，是不是要消失的，是否真有什么利益。修行人就应该经常自问，自问之后，才能觉悟，才能有定力，才能出生智慧，才能从世俗法中解脱出来。</p><p>搞了无量劫的世俗法，每个人无量劫来在世俗法中究竟得到了什么？无量劫的贪爱，换来的究竟是什么，除了生死苦，还有什么？有智慧者，真应该常常反思反省，之后才能看透生死的本质，不再贪恋生死惑业，才有力量走出生死苦轮。</p><p>二十、为什么学佛人越学越有磨难</p><p>进入佛门学佛的人，都是有善根的人，不是一生一世几生几世才开始学佛修行的，修行时间是按劫计算的。对三宝信心具足，对自身信心具足的人，可能已经修了十万劫之久了，如果进入十住位修行菩萨六度的人，已经远远超过十万劫的修行时间。</p><p>大多数人学佛是有些因缘才进入佛门的，或者身体有病苦，或者诸事不顺利。学佛一段时间以后，病苦减轻，事情顺利，就感觉学佛很好。当对学佛信心具足的时候，会出现各种障缘，各种事情会不顺利，身体出现疾病等等状况。众生无始劫以来一直造业，业障非常深重，刚学佛时，会有护法和菩萨们来护持着，不让严重的业障来阻碍学佛，因为这时候，还承受不了这些业，业报的出现会让众生退失信心。等修了一段时间，能够承受一些业障时，护法就不会再遮挡业障的现行，承受不了的业障还是会遮挡一点的。这样的话，学一段时间就发现，自己的业障现前了。</p><p>不顺利还有一个重要的原因，就是由于修行非常得力时，后世应该受的果报，今世就提前受，提前受就是重罪轻报，恶的果报越提前受，其报越轻，善的果报越往后受，其报越大。这与到银行存款的道理是一样的，存款是有利息的，佛法上叫做孽息。存款提前取，利息就少，恶业就轻，善业也轻，所以要恶业提前受，越提前越好，善业要往后受，越往后越好。如果能过得去，善业尽量往后受，那样果报会非常大，银行存款会越来越多，相当于利滚利。</p><p>众生造业的业种是存在如来藏里的，如来藏就像银行，这个银行，存款利率是相当高的，最低是一百倍，最高是无量倍。所以种一点善法就可以升天享福，种一点恶业就要下地狱受苦。而且如来藏这个银行永远不会倒闭，业种不会丢失，就是说善业恶业的果报谁也偷不去抢不走，只有自己受，别人替代不了。金刚经第十六品佛说一个人受持金刚经以后，先世造的罪业，本来会让他堕落恶道，如果有人轻贱他，他的先世罪业就消灭了，只受到被人轻贱的果报就报完了，这就是重罪轻报。</p><p>所以菩萨明心见性以后，三恶道的业消灭，但还会有各种磨难，都是重罪轻报，在人中受苦，永远不下三恶道受报。那么修行修到一定时候，各种能够承受的业障就会逐渐出现，这是好事，总比后世受更大的业报好得多。这些业报受了以后，障缘减少，以后的修行就很快了。</p><p>这些业障有些是由护法来掌握控制的，他们在照顾着修行人，有时会遮挡业障，有时就不遮挡，或者遮挡一部分，另一部分不遮挡。所以我们学佛修行，每天应该要给我们的护法神回向，希望他们都能明心见性，道业不断增进，护法功德圆满殊胜。我们自身遇到障缘就不要抱怨，也要尽量少享福，少从如来藏银行里提款，那些善款不会丢失，提出来享受就没有了。而且如来藏银行里存款越多，我们越富贵，修菩萨道的资粮就越多，在成佛这条路上，走的就越快。让我们修学佛法的资粮越来越多，道业增进越来越快！</p><p>二十一、什么人能免三恶道业</p><p>只有真正断我见真正明心断三缚结的人，才能保证不去三恶道。如果没有真正断我见，而只是心里认为五阴无我了，三缚结不断，三恶道不免。弘法度众生的心是可贵的，但是自己没有修持出来，也不能把众生度得出离生死，自己的道业也耽误了，一旦烦恼愚痴业种现行出来，直接就是三恶道。因果一个是在于发心，另一个也在于事实。</p><p>自己没有得度先度人者，发的虽然是菩萨心，没有真正的道行，后果也可畏。自己能够免除三恶道了，再出来弘法度众生，牺牲个人的道业，那就无所谓了。有的人会说，我断我见了，我明心了，能免除三恶道了。但是是否真正断我见，是否真正明心，那可不是由自己说了算的，也不是由哪个给印证的人说了算的，因果自有道理。</p><p>有的人说持五戒不犯就能得人身，可是无色界天的天人八万大劫心清净，一丝恶业不造，命终时无始劫以前的恶业成熟，直接下地狱。欲界天的天人色界天的天人也如是。今世不造恶业，无始劫以前都造过大恶业，有极多的恶业还没有受报。命终一旦那些恶业缘熟，即随业流转，根本没有自主能力。只有真正断我见断三缚结，才能消灭三恶道业。但如果再造大恶业，仍然要去三恶道受报。</p></div>"
},{
    "title": "第七章 佛法与外道篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  佛法与外道篇</strong></p><p>一、修行成佛趣向涅槃的两条路</p><p>学佛修行有两条路可行，哪两条路呢？第一条路，如第一尊佛威音王佛一般果敢智慧，勇于探索真理，少依赖不依赖他人的理论，开发自己智慧的潜能，获得智慧的成就；第二条路，在信受现有理论的基础上，努力实证，获得智慧的成就。</p><p>第一尊佛在世间蛮荒的时候，还没有发现任何真理之前，一个人以极大坚忍的毅力，以大无畏的果敢精神，勇于探索真理，开疆拓土，开辟无穷无尽的荒地为十方世界佛国土。也如无佛在世的独觉佛一般，以一念世间法之疑，激发起了自己往世的善根菩提种子，立志去探索众生生命的来龙去脉，寻找到十二因缘法和十因缘法，证得了生命的源头，一个是并不实在的无明，一个是实在的第八识。</p><p>真理就是客观规律，真理就是客观存在的法则，真理就是世间运行的真相，真理就是颠扑不破的事实，真理就是不依任何人意志为转移的定律，真理就是导众生于解脱的指明灯，真理就是载众生到彼岸的航船。真理本来就存在，只是无人去发现。威音王佛以极大的善根和勇气，走上探索真理的艰辛之路，从而发现和证明了世出世间所有真理，为后人开辟了一条通往真理之路，有志于解脱的后人依之路径就能到达解脱的终点。</p><p>威音王佛已经为后人开辟了趣向解脱涅槃之路，后人大可不必自己再独辟蹊径，单独开发成佛之路，但是在跟随已经开发出来的真理之路上，还有一些枝枝叉叉、弯弯曲曲之小路，有可能找不到路头，看不到航标，这就需要每个人效仿威音王佛的探索真理的果敢和智慧，勇于实践和探索，直到突破困境，走上大道。</p><p>佛修行的第二条路，就是在信受诸佛已经发现了的真理的基础上，再去想办法一一证实这些真理确实都是正真之理，都可以实证，可以发现，可以重复。从而智慧解脱等同于首先发现真理的诸佛。为什么信受了真理，了知了真理，懂得了真理，还有去证实呢？第一尊佛是探索并且发现真理的人，在探索过程中，每一次发现就是证明，因而威音王佛发现真理时，就可以宣布此为真理，我已证明。那么第二尊佛以及后世的诸佛，以及未来世的众生们，了解了第一尊佛发现的真理，可不可以说我发现了真理，真理确实如此？当然不可以，信不等于证，不等于也获得了同样的智慧，只有通过再次试验和证明，才能知其所以然，从而也获得智慧，这样才算作掌握了真理，获得了真理。</p><p>确实两个字代表着什么？代表着亲自证明了，代表着实际经历了，代表着实验过了。只有实验过的，符合了所了解的真理，与前提一致，心中不再疑，断除了无明结缚，才能说确实如此。至此，智慧与第一尊佛等同，但所走之路与第一尊佛相同否？付出的代价，经历的艰辛，与第一尊佛相同否？都不相同，开疆拓土者是最辛苦的，付出的代价是最大的，经历的是最多的。</p><p>十方世界无穷际的时空中，只有一尊威音王佛，无二也无三。第一个垦荒者有着怎样的善根、福德、智慧、毅力、果敢、坚强等等，一切常人所不具备的素质。在大的真理上，在宏观的真理上，虽然没有能越过于第一尊佛的，但是在具体的微观的真理上，每个众生完全可以自己去探索和发现，不必事事都要完全依靠诸佛世尊，这也是善根福德智慧深厚的人才能为之。</p><p>释迦佛在娑婆世界留下来的佛法，只有手指甲里的土那么多，还没有留给众生的佛法，却如大地上的土那么多。还有极多极多的真理，需要大心量大智慧的众生去开发，去挖掘，去探索。只要是真理，只要是事实，不管佛说与没说，留下来与否，真理就是真理，事实就是事实，不在于佛的态度。当然佛是永远不会否定真理，忽视事实真相的。</p><p>我们只要学会威音王佛的思惟模式，探索真理的方式，处理问题的方法，以及威音王佛的人格、品格、菩萨格，积累出威音王佛那样的善根福德智慧，再有诸佛及佛法光明的指引，一定可以开发出更微细更细致的真理。信心也是善根福德智慧的体现，有这三者，所向披靡，定会早日证得一切真理。</p><p>二、佛在世时有九十六种外道，他们的修行以苦行为主。放下了世俗法的一切。我们现在学佛是远远赶不上他们的精进以及吃苦的精神。他们远离家乡，住到山中，吃穿住行非常艰苦，甚至吃草吃牛粪，有的故意饥饿自己，弄得骨瘦如柴。这样做无非是为了消业，认为业消了就能脱离轮回，然而这是邪见，是戒禁取见。他们放下的是全部，世俗的心根本没有了，放得再彻底也没有了。可是他们成就了吗？佛说靠苦行消业，那个业能消得完吗？如果外道们那种放下的苦行修行方法能成就的话，释迦佛也不用那么辛苦从常寂光土出来，到人间八相成道，四十九年辛苦度众。</p><p>世尊刚出家时，随从一个外道师父，修学苦行和四禅八定，佛把四禅八定都修成后，发现这不是道，不能出生智慧，不能成佛。然后舍离苦行，菩提树下打坐，思惟佛法。夜睹明星悟道成佛。所以修行是要有正确的理论作指导，不是单纯的放下那么简单的想法就能行得通的。我们要知道为什么放下，放下什么，如何放下。要按照佛所教导的方法去修行，不能依照哪个人所独创的方式和理论方法来蛮干，我们所有的修行理论和法则必须符合佛说才能成就，因为佛是已经成就者，其所教导的方法全部正确无误，其他人的就不是了，那都是摸着石头过河，根本过不了河。离开佛的教导和经典，就会一无所成。佛子们切记！</p><p>三、为什么世尊在世时的外道们，没有皈依、没有受戒，听到世尊讲法时就能证得罗汉果，甚至能够当场入涅槃呢？每尊佛成就佛道度众生，就像演戏一样，要有一个戏班子，一整套人马来配合世尊一起演戏，世尊不能唱独角戏。世尊在没有下到人间之前，在兜率内院就开始布局，派很多人先期生到人间，等候世尊降生。</p><p>他们到人间来出生，分布在各个阶层，各个角落，甚至九十六种外道中都有。他们示现在外道中，带领外道一起修行，作为影响众，世尊会依据因缘示现度脱他们进入佛门，进入佛门后，有的就作为世尊的左膀右臂，协助世尊弘法。有的在世尊快入涅槃时才被世尊度化，这样就影响了一大批外道弟子进入佛门，显现佛法的殊胜。这些外道不仅仅是罗汉示现，也有大菩萨示现，直到最后，世尊才揭示他们的真实身份。所以他们能在世尊讲法度化时，很快证果。</p><p>第二个原因是，那时的外道，都想解脱轮回，出离生死，出离心是很强的，只是没有正确的修行方法。他们多数都是远离世俗，五盖已经修除了，甚深禅定已经发起了，四禅八定都已经具足。所以他们的根性是很好的，虽然没有受五戒，但是身口意行为上根本没有犯戒的现象存在，他们只差最后一个观行智慧没有具足了，这得靠世尊用正确的解脱道理来引导才行。</p><p>基于以上的道理，他们在听世尊讲解脱道时，解脱的智慧就能显发出来，很快证得相应的果位。看来好像很容易，其实他们也修行了很长时劫，付出了很大的代价，世俗法都抛弃了，一心想解脱生死。那我们现在要想证果得解脱，看看我们自己的条件是否具足了，出离心有没有，内心中的世俗法离开多少了，禅定如何，心清净到什么程度了，与外道们相比，还差多少。</p><p>如果自己不如外道的心清净，那么我们就得按照世尊所教导的解脱修行次第，修行三十七道品，这些向法次辅助修行的方法修行好了，然后才能证道。包括皈依三宝，受持清净的戒律，以此来约束自己的身心，使得自心清净，心止得定。我们现在的末法时代，人心浊恶，染污严重，信息繁乱，心缘极重，很难静止，那么修定就很困难。普遍都是定力不足，与世尊在世时的外道不能相比，要想证果真是大难。世尊说过，在正法时期，众生持戒就能成就，得解脱，在末法时期，只有持戒是不能解脱的，何况不受戒不持戒，那就更不解脱了。</p><p>有多少人不仅持五戒、八关斋戒，还严持菩萨戒，就连解脱的影子都见不着。因为这些人不是心持戒，心中没有戒，而只是用身体来持戒，内心还照样贪染世俗法，这样就很难修定，那么就不能有观行的智慧，怎么能够成就呢？所以我们不能看那些外道们没有皈依受戒就证果了，我们也可以不皈依不受戒，不能违背世尊的教导。这样是行不通的，我们的根基是远远比不上那些外道。虽然我们学了佛法的内道，心性是绝然不同，还是应该按照世尊的教导，先修次法、助道之法，严守戒律，皈依三宝，依靠三宝护法龙天的加持，来获得解脱。</p><p>四、世界上的宗教有很多种，但是都不能让众生脱离生死轮回苦，只是一种精神信仰而已，因为那里没有实质的让众生依赖而得以解脱的内涵。佛教就不如此了，佛教是教导众生如实认识生命的实质的教育。佛陀辛苦到这个五浊恶世来，四十九年弘法度众，从各个不同的方面让众生了解生命的实质意义，了解生命的来源和归向。众生依此修学，就能认识到自己以及所有众生的生命意义，认识无量劫以来的生死轮回的根源。</p><p>因此就会觉悟自心，从而去寻找自己生命的来源，以彻底解脱生死苦难，走向究竟的解脱之路，最终会圆满自己的福德和智慧，成为究竟大觉世尊。并且要带领无量亿万众生，同样走出生死轮回，圆满觉悟一切法，证得无上的大涅槃。其他宗教都以引人向善为主，做好人，行好事，与人为善，最终目标是升天享福。但是福享尽了，还要落入三恶道受苦。那些宗教没有涉及到六道轮回，没有揭示给众生有六道的轮回，也不知六道轮回的根源，那么就不能让众生依止以脱离六道轮回生死苦。</p></div>"
},{
    "title": "第八章 出家与在家篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  出家与在家篇</strong></p><p>一、出家与在家的区别</p><p>首先说什么是家，家的概念是什么。家，第一，先有一所房屋，供全家人在一起生活起居；第二，有家人，或者父母，或者是配偶，或者是子女，互相陪伴，互相依赖依靠；三，有共同的俗世生活，比如饮食、起居、娱乐等等；四，有共同财产物质作为共同生活的基础，有经济来源渠道。五，有共同的生活目标和规则。</p><p>这些条件组合在一起，成为一个家庭，这只适应于娑婆世界的欲界人间，因为人间众生的欲望浓重，需要有房屋遮盖其男女欲事，以防他人窥视，被人耻笑。最初娑婆世界人间，就是二禅天人下到地球上来，因为贪食了地肥，身体变得沉重，而不能飞回天宫，不得不留在地球上生活，成为人类，最初的人类就是二禅天人，没有男女相。后来人多了，人类之间生出情感，互相贪爱，人类就分出了男女相。这些男女在一起搞欲事，先是避讳其他人，后来才建立了房屋，逐渐组成了家庭，有了子女从这开始，才有了家庭，家就出现了。</p><p>可见，家离不开男女，离不开男女欲事。如果没有男女欲事，人们之间也就不会组成家庭了，也没有子女。淫欲淡薄的欲界天人没有家庭，乃至于北俱芦洲的人间也没有家庭。色界的所有天人都没有男女相，没有淫欲，都处禅定中，更没有家庭，也不用到处奔波来养家糊口，不用有经济来源。因此说，家只适应于娑婆世界的人间，出家之事，只有娑婆世界的人间有。没有家庭，就不涉及出家与否，再加上不需要经济来源，不需要四处奔波养家糊口，也就不属于在家人了。</p><p>那么佛菩萨所在的佛国土，都是天界环境，甚至比天界的环境更加殊胜，都没有男女相，也没有俗世生活，也不用为生活奔波，没有世俗事业，所作一切都是为了利乐众生，都是佛事。因此佛菩萨没有必要再现与娑婆世界人间一样的所谓出家相，没有必要剃光头，去掉烦恼丝，他们没有烦恼，没有必要穿娑婆世界人间的出家服，色身本身没有系缚，佛菩萨以及众生都不着色身相。他们所现的任何相，都是出家相，不是在家相，因为没有任何在家事。</p><p>我们娑婆世界人间的众生就不能与十方诸佛相提并论，也不能与所有等觉妙觉菩萨相提并论，也不能与十地菩萨相提并论，认为这个五浊恶世的众生不用现出家相，不用出家，就与出家人是一样的。</p><p>事实上，每个人在这个世间生活，出家与在家差距巨大，在家人都被俗世生活所累，无法脱身，在修道上所受的局限非常大，很多人都苦恼于俗世生活的负累，不能专心修道，即使想出家，由于业缘的牵制而不能出家，有的人出家几次都被业缘又牵制回来。这就是娑婆世界人间的真实情况，我们不可不面对这样的现实而不顾，非要说在家与出家一样，没有差别，其实差别大得很，每个人可以扪心自问，不可以给自己戴高帽子，说自己与出家人一样。</p><p>二、出家是隔离世俗法最好的办法</p><p>佛在经里说过，出家人即使在山中成天睡大觉，也好过在世俗法里摸爬滚打。因为什么呢？睡大觉虽然不是修行，但也没有熏染其他世俗法，渐渐的心里对世俗法的攀缘就少了，最后就不想世俗法了，这时再减少睡眠，道业进步就快了。</p><p>这个道理与往生极乐世界住在莲花宫殿里的情形是一样的。在莲花里，由于隔离了世俗法的环境，没有了熏染的机会，心里的攀缘逐渐就会断掉，恶念逐渐减少，恶业种子就会逐渐枯萎，心地清净了以后，莲花开敷，见佛闻法，就能悟道。这个是最笨的方法了，但也好过世俗法的恶熏。</p><p>所以一个人不管怎么样，佛都会接纳他出家，哪管他出家不努力修行，也能减少恶熏。当年佛陀成道以后，把自己家族中能出家的人都劝出家了，不管有没有婚姻的，只留下祂的父亲净饭王和一个将来接管王位的人。其中佛陀对自己的堂弟难陀，就是采取非常手段，骗其出家。难陀由于对妻子非常贪恋，不可能通过正常渠道劝导出家，于是佛陀就强硬的把他带到精舍中，不允许他回家，他的妻子都不知道。最后佛陀带他分别到天宫和地狱走一遭，难陀才安心于修道，没有还俗 ，最后证得四果阿罗汉。可见，出家是多么的重要，佛陀才用各种方法劝人出家，辛辛苦苦成立了僧团，住持在娑婆世界，以接引有缘众生进入佛门。</p><p>佛陀那时候的人如果想出家，有妻子儿女的，不必离婚，也不必征求妻子儿女的意见，直接把妻子儿女送人，安排好以后的生活，于是就出家修道。即使妻子儿女在新的家庭中生活得不好，他们也不会还俗再照顾了，道心非常坚固。</p><p>有人想出家又出不了，那就不用再找什么借口，没有什么借口好找，还是检查自己的内心，贪心难舍世俗，只此一个原因，无二无他。</p><p>总听到有人抱怨出家人如何不修行，如何不如法。如法的人都不想出家，修行的人都不想出家，这部分不修行的人再不出家，僧团不就没人了吗？出家人从哪里来?就从世俗法中来，如果那些优秀的人都不贪恋世俗，都来出家的话，那么出家人就都是如法的，都是有修行的，佛教事业就会蒸蒸日上了。现在很多人都是能在世俗里混，就在世俗里混，能抓取什么就在世俗里抓取什么，只有那些没办法再抓取的人才出家，这样寺院僧团能好到哪里去？</p><p>三、出家僧在一起的羯磨和忏悔，都是不允许他人偷听的，在家菩萨的忏悔内容，也不轻易让他人得知。这是阻止恶法的流传，以避免造成不良的影响。有些违缘也许能促成佛缘，不应该给解开的就不要解。如果解开，佛缘就不成了。包括各种疾病，不该管的就不用管，管了之后，就不入佛门，入佛门的就不精进修行了。世俗法各方面都顺利的，有几个人能正常顺利的出家修道？有佛缘的，逆缘越多越好，就能一心精进修行。把他的逆缘排除了，反而不好好学佛修行了。</p></div>"
},{
    "title": "第九章 依法不依人篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  依法不依人篇</strong></p><p>一、读不懂经典是否真正能依法</p><p>众生没有修行到某种阶段，没有生起智慧时，不可能读懂经典。很多人都以为自己读懂了佛经，实际上都是依文解义而已，与世尊所要表达的思想相去甚远。一个人太相信自己了，往往就自误。</p><p>佛在四十二章经中说：汝意不可信，证阿罗汉果才可信汝意。这是对声闻弟子们说，如果对大乘菩萨弟子们，佛可能就要说：汝意不可信，证得自心本性才可信汝意，或者说：具有唯识种智，入如来家，才能信汝意。因为这时候，已经证得了诸法实相，智慧已经开发出来并且比较深透了。在此之前，众生最起码，应该修到有择法眼的时候，才能辨别一些法的对错，有择法眼，才能有择师眼，二者相依。</p><p>现见大部分众生，没有修到有择法眼的程度，判断的法和师都判断错误了。判断师都是依据名声，依靠外相，不是依据师的智慧。因为自己首先没有智慧，也就看不出师的智慧深浅如何。众生过于自信或者过于信师，都会误己。应该善思法，善别师，正确判断自己的智慧水平。最主要的还是多修福德，福德具足，错误就少，智慧就生。</p><p>二、一部短短的心经，只有260多个字，可是十人读，有十种理解，百人读，有百种解释。都说依法不依人，那么学大乘法首先就要依止于心经，心经是大乘法的总纲，读懂心经，才好证悟菩提。像目前这种状况，一个人理解一个样，怎么来依止心经呢？都以为自己是在依法，对于法的理解是错误的，那怎么能真正依止？都以为自己理解的正确，正确的法只有一种，百人有百种理解，那么可能就有九十九人的理解是错误的，这样怎么能说依止法呢？</p><p>佛处处讲真空妙有，可是一部分人否定真空，一部分人否定妙有，这两种人本来知见是矛盾对立的，可是又能互相融合在一起，互相肯定，奇怪不奇怪？为什么会出现这种情况？原因是众生都不了解自己的知见到底是如何，对于法没有辨别力。所以目前邪见才炽盛，邪法才能广泛流传，众生对此不觉不知。末法时期，众生福薄，甘愿受误导。众生的福德不修持出来，未来正法堪忧，恐怕要快速灭亡，那时众生更要处于热恼当中，不能自拔。</p><p>三、何谓依法不依人</p><p>所谓依法不依人，法是指圣言量，或者是证量，是真理，而非世俗之说，也非错漏之说。符合佛陀所说的解脱之理，符合佛陀所说的真如之理，佛陀所说的三藏十二部经教都是可依之法，与此经教相符契的所有言论也是可依之法，实修出来的符合经教的论，也是可依之法，不管此法是何人所说；即使鬼神能宣说与经教相吻合的法，也是可依之法，不是看鬼神的身份，比如弊衣中有宝，直取宝藏，不取弊衣。</p><p>而依人的人，只能观察人的身份、地位、财色和名声，择取己所喜乐仰慕之人，只要其人有所言说，都视为金口玉言，辨别不了其言说是否符合圣言量，是否符合佛说，其害甚大。能真正依人的人，万里挑一，也是甚难甚难，很难挑选出来！</p><p>如何才能依法呢？首先要懂法才能依法，如果不懂法就没办法依法；不能依法的时候，都是依人。但是众生严重缺少福德，又没有修出相应的择法眼，没有相当好的辨别能力，情执又深重，因此没有能力依法，极大多数人都是依人；尤其是依与自己有缘之人，依有名声之人。</p><p>比如说心经是法，我们要想依止心经修正自己，那就要明了心经的真实义，明了心经的主旨是什么，然后依心经修行，修出般若大智慧，照见五蕴皆空，这样才是真正的依止。可是全世界的学佛人中，有多少人能明了心经般若主旨，依心经这个法修行的？恐怕是极少数，如果不能依整部心经，能依一句话，或者是依不生不灭四个字也很好，可是就这不生不灭四个字，也没有多少人明了其般若内涵，那要如何依止心经修学呢？所以依法说起来容易，做起来是相当困难的，智慧福德不足之故。依般若经典就是这样的困难了，如果要依唯识经典，有多少人能依呢？恐怕千万人里选一，也很难挑出，几乎都是依名声依权势，依不了法，更依不了实际证量。</p><p>如果大家都想要明心开悟，就要把心经中的不生不灭四个字彻底弄清楚，不生不灭到底说的是什么意思，明白这个意思，就能检查出自己和他人所悟的法是生灭的，还是不生不灭的，是否符合心经所说。如果所悟是生灭性质的法，那就是虚妄法，不是不生不灭的真实法，那就悟错了，只有不生不灭的才是真实法，如心经所说。</p><p>我们要知道，悟是悟个什么，悟的对象是什么，悟是什么状态，悟时知见是达到何种程度，身心的状态如何；然后根尘识三者那里运作的情况要知道，五阴的活动运作也要知道，那些话头的内涵秘密也要知道，如来藏的体性更要知道，如来藏的运作情况，也要知道，这样就具有了般若大智慧，才是真真正正的明心开悟。从此以后，才能真正依般若经典，依如来藏法，依般若智慧。</p><p>我们平时就要踏踏实实的修行，不仅要广学多闻，多学理论知识，还要专精实证。有的人学佛之心很是精进，到处学习佛法理论知识，佛法知识倒是很丰富了，可是从来不思考自己所学的知识正确与否，是否能实证，什么时候去实证，这些问题都不考虑，遇到佛法知识就吸收，尤其是谁出名，就专门吸收那些出名的，有名气的人讲的那些法，从来不想辨别一下，因为没有能力辨别。佛经里佛从来没有说过有名气的人，就是大善知识，应该依止，而是一再叮咛要依法不依人。</p><p>平时不修福，遇到佛法，就没有能力辨别是正是不正，只会依个名声，依个公认的。什么叫作公认的？公，就是大众，公认就是大众都认为。可是真理永远是掌握在极少数人手里，大众的智慧还不足以辨别佛法的层次，大众都是无明深重的多，依大众的知见，是绝对靠不住的。任何一个团体，不管是世俗里的还是佛教里的，找一找有智慧的人，能找到几个？万里挑一，也许能挑出一个，也许一个都挑不出来，各个团体里黑压压的一片无知的人，没有几个有智慧的，如果相信公认，就等于相信无明。</p><p>为什么佛陀临涅槃时，告诫弟子要依法不依人？因为依法这样的事情，很难做得到，不懂法又缺少福德的人，根本就依不了法，只能依人；依人依对了，那是自己前世修来的福德，也是因缘成之，大多数人都没有依对人，如果依对人，修行是很快的，不至于一辈子一无所是。</p><p>四、每个人都喊着要依法不依人，可是很少有人能依法的，都是依人的多，因为佛法是这样的难，前世自己善根福德又不足，不懂法，不能如理判断法的正与不正，正的层次和不正的程度，都很难判断出来，要依法，那就非常非常的困难；所以只能依人，依与自己有缘的人，依一些名气大的人，依一些所谓公认的人，众生只能做到这样，很难做到依法，这就是现在佛教里很普遍的现象。如果依人，能依对了人也行，能判断此人讲法的程度，正确的就依过去，这样是既依人，也依法。不懂法的依，是盲目的依，就像撞大运一样，全靠大福德支撑着。</p><p>凡夫确实是很难依法不依人，那么明心以后的人是否能完全依法不依人呢？明心以后的菩萨，会发现自己有更多的法都不懂，以前从来都不知道自己是这样的无知，所以才慢气四溢，经常与人比高低上下。明心以后就知道自己其实很无知，那时就着急赶快修行，日夜精进，思惟探索佛法里的更多的奥秘。所以明心以后因为还有尘沙无明惑，愚痴还甚，也不能完全做到依法不依人，尤其是情执重的，大多都在依人，做不到完全依法。</p><p>所以依法不依人，每个学佛人都要尽量做到，虽然不容易，多修福德，就能依对法，依对人，而依对了人，就等于依法了，所以只要是真正的善知识，我们还是要依止的，这样的依人是依其所说真正佛法，就等于依止于法了。</p><p>五、何谓依法不依人</p><p>只要不搞个人崇拜，不唯任何一个人是尊，能如理如实的观行佛法，那就是依法。依法很难，有些深法，自己禅定力不足，无法观行出来，极大多数人这时候就选择依人，依已经有名望之人，认为这是大多数人已经公认的人，一定没有错。可是我们就不知道大多数人都是什么人，甚至极大多数人都是什么人，娑婆世界铺天盖地的，就是一介凡夫，凡夫的智慧和认知不都那么靠谱，甚至禅定智慧浅的人，其智慧认知也不靠谱，因此圣人和绝对真理不是靠投票选举出来的，依人还是铺天盖地的多，无论佛陀如何告诫我们要依法，智慧福德禅定不足，根本就依不了法，只能依人名气大的人当然风光了。</p><p>六、如何才能做到依法不依人</p><p>法，就是事实真相，一切学人都要依据事实真相。如果自己不知道事实真相是什么，一是选择闭口，不评论，不评价，不表态说是或否。二是要努力寻找发现事实真相，努力去证明某法到底是不是事实真相，在没有证据证明之前，选择沉默。</p><p>这样的话，就能避免了盲目依人的现象。每个人只要不是佛，所讲的法肯定都有缺陷和不足，如果选择依人，那就连缺陷和不足之处都依了，这样后果就不会乐观。即使是佛所讲法，只要不是当面聆听，中间辗转相传，有可能有传错部分，有误传的现象。作为佛弟子，也要尽量去实证，看看辗转相传的法，到底是不是真实的，有没有道理，在没有出生真实智慧的时候，也不要轻易评价。</p><p>七、如果一个学佛人没有理智，没有智慧，有崇拜名人名气的心理，喜欢背名人的文字，而不起自心思惟，那么自己的思惟思路就容易被限碍和阻塞，一直到后世后后世都很难突破这些限碍，徒耽误自身的道业，岂不可惜！</p><p>    八、意识和意根相当于两个人，当一个人不能观察到另一个人心理的时候，不可断然说那个人没有某种心理，没有某种想法情绪等等，这样说是有过失的。因此意识受烦恼的局限，没有转识成智，很难观察到意根的各种功能作用，观察不到时，就不能给意根下定论。</p><p>当定义一个法的标准不明的时候，就不能拿两个法相比较，不能说甲不符合乙，与乙不一致，就说甲是错误的，这样判断过于唐突和无理智。因为乙不一定是标准的，不一定是正确的，那么甲与乙不一致，并不能说明甲就是错误的。</p><p>当一个人智慧高超，既了解甲，也了解乙，又知道正确的标准是什么，那就可以判断和定论甲究竟是否是正确的，也可以定论判断乙是否是正确的，这叫作依法不依人。反之，不知道法的究竟标准是什么，没有智慧判别甲和乙是否符合标准，而一厢情愿的就断定乙就是标准，因为大众公认，甲不符合乙，甲一定错误。那么这种情况绝对属于依人不依法，属于情执心理，属于无明心理。</p><p>    九、依法不依人应该怎么做</p><p>依法就是纯粹依赖佛法本来的真实相而信受，能够如实的判断法对法错，对就依止修学，错就绕开不学，并且辗转相告于同修学侣。如果能判断出法之对错，那么就不要再特别关注于人名是否著名，不要管人如何，只关注法义。如果法义正真，作者标注是波旬，你也不要理会，法义邪见居多，标注是释迦佛的名字，你也不要感兴趣。</p><p>真正想依法不依人而修学无上法的人，如果我们把佛经标上波旬的名字，说是波旬著作的，再把波旬讲的法标上佛陀的名字，当作佛经，你们要如何判断里面的内容？如何对待这两种法义？如果我们把所有的文字文章，著作者的名字全部都打乱，或者都标上无名氏，那么你们应该如何对待这些文字内容？</p><p>十、一切客观存在的事理，并不在于某某众生某些众生全体众生是否有所了解认知，也不在于众生的承认与否，客观事实就是事实。盲者不见天日，并不代表没有天日。所以譬如花的美丽性是否存在，五尘上的表色无表色是否存在等等法，并不以众生的见识和认知而转移。真理客观事实，是需要无知的众生不断的探索和发掘的，没有探索就没有发现，没有发现不代表不存在客观真理。之所以叫作客观，就是因为事实和规律不以众生个人和集体的意志为转移，只能说众生有没有智慧去发现和认知。</p><p>众生都是太把自己的意识当回事了，所以意识愚痴的时候不知道愚痴，而埋怨没有真理。真理就在眼前，用什么样的眼光去见，是一个很大问题。在娑婆世界，全体众生大部分众生都不认识佛法，都不赞同佛法的时候，佛圣者是不会来此世间传法传教的。不想觉醒的众生感召不到光明，即使光明在头顶不断的照耀，仍然会昏睡不醒。</p><p>十一、四依四不依中，有一个依义不依语，义是指什么，语是指什么？佛讲法时，告诉众生要依佛所讲法当中真正的义，不依佛讲法的表面语言。语言是表面的意思，义是暗含的真实意思。那么佛讲法为什么不直接说真实的意思，在表面意思上隐藏着暗藏着自己真实的意思呢？</p><p>语言与意识相应，在浮浅的表面意思。而在语言文字的背后，有深层次的意根想要表达出来的意思。在特殊情况下，有的人说话和写文章不方便、不愿意、很难直接表达自己真正的想法，都是隐含着暗含着来表达，听话者就要去听弦外之音，去理解不在文字语言表面的背后意思。众生理解表面意思稍微容易一些，但毕竟不是真实意思，还不究竟；深层次的意思，众生不容易理解，但那才是说者真正想表达的意思，想要告诉我们的意思。</p><p>所以佛临般涅槃时，告诉弟子要依义不依语，让众生依究竟义，究竟义是佛要表达的真正意思。如果众生只在语言表面理解和做文章，那就没有理解佛的真正意思，曲解了佛的真实义。</p><p>普通人说话，也有明指和暗指，明指就是表面意思，暗指就是真正意思。明指是意识用语言文字表达出来的，暗指是语言文字背后的真正用意。为什么不直接表达出自己的真正想法和用意呢？有些场合，有些想法不能直接表达，一个是顾虑对方接受不了，理解不了，怕对方误解；一个是方法和策略问题，启发人深思，自己经过深细思惟得出的答案，更能接受，智慧更深。</p><p>讲究语言艺术的人，就是这样善巧方便。就连佛讲法，有时也是比较间接，不直接表达心中的真实义。一个是怕众生理解不了，或者生出误会；一个是为了引导众生，更深入的思惟，自己得出结论，从而增长智慧和信心，尤其是不同根基的众生混杂在一起，更不能直接表达深义。</p><p>十二、如今的人都不修定，修不好定，只玩嘴，看两本书，意识理解理解就认为自己悟了，连解悟都不算，就说自己是证悟。因此就有必要让末法时期的众生，了解意根和意识的区别，让大众知道如何是解悟，如何是证悟，以避免众生大妄语。</p><p>末法时期的乱象非常严重，众生情执深重，口里常常说依法不要依人，实际却相反。如果众生都能如理如法修行，真正依法不依人，口号少喊一些，实际事多做一些，尽量做到位。真正去依佛所说，佛也就宽心一些了，不违逆佛，依教奉行，就等于报佛恩了。把情执降伏一点，就会看清一点事实真相，要以道业为重，不要以情执为重。情执救不了人，各人业个人受，谁也不能替代谁。如果心能大一些，精力充沛一些，要以佛教为重，以众生的生死为重。并且首先要懂得佛陀的恩，想办法报佛陀的恩，不要说话做事让佛陀伤心难过。要知道如来藏刹那刹那都在存种子，在我们说话做事，身口意行的每个当下，有如来藏在监督和记录，因此我们一定要敬畏如来藏，敬畏因果。而不是口头高喊，实际却非。</p><p>十三、一切法能够亲自证得，能够现量观察到，这个比什么都重要。即使佛陀亲口所说的话，也应该亲自去观察和实证，最后才能确认无疑。自己亲自证验的理，就是事实，事实比佛陀之言更可靠。而佛陀亲口所说比流传的佛经更可靠，因为佛经已经假于他口和他手，属于转述了。佛经比等觉菩萨的论更可靠，等觉菩萨的论比其他菩萨的论更可靠，其他大菩萨的论比凡夫之言更可靠。归根结底，不管经论多么可靠，都没有实证更可靠。</p><p>可是现在，即使佛陀亲自来传法，所有众生也只能信受佛经，而不能信受佛陀亲口所说，因为不知道是佛陀降临于世，自己又没有智慧辨别法义正真与否，那么所信就是盲信崇信，不是证信，也不是真信，是信佛的名声和威望而已。如果众生是相信佛陀亲自来娑婆世界传法，那么众生就相信现佛陀相貌的佛陀所说，不一定要相信佛经了，即使佛经非常正真。这也说明众生对于佛陀以及所说法是盲信和崇信，而非证信。如果相信有佛陀相貌的人所讲之法，那么波旬现个佛陀像来传法，又该如何对待？那也要完全相信了，然后就被扭转过去，沉沦于生死中，不得解脱。</p><p>所以说，千言万语，只有实证最可靠，只相信事实，只相信真理，是所有人都应该依从的准则。而证得真理，是极难极难之事，需要极大的福德和智慧，所以众生才不得不相信他口所说，这也是无奈之举了。也所以佛陀临走之时，对弟子们千叮咛万嘱咐，一定要四依四不依。可见这个四依四不依肯定是极难做到了，几乎百分之九十九的人都做不到，因为福德、禅定和智慧的欠缺。</p><p>而另一方面，一说要相信实证，就会有一部分我慢深重的人，只相信自己的推论和所解，认为这是自己所实证到的，而不再相信实证者所说，变得越来越慢，以致于自欺欺人，最后还是没有得到法利。末法时期学佛的现象，佛来也难办，众生不是左就是右，不是盲从就是我慢过于自信，智慧不足的人很难拿捏一个合适的尺度，很难把握一个比较合适的度，可以说世医拱手。</p><p>根本之处错得很严重，枝叶对错都无所谓了。不开悟讲唯识，是一种笑谈，开悟的智慧也无法讲好唯识，对唯识没有修证如何讲唯识？现今世界的唯识，如果流传到后世，如果此人有名闻有权威，后世人又会崇拜得五体投地，不知要贻误多少真正修行的广大佛子。世人往往都错会有名闻的大德著作都是正确无误的，能讲唯识的人都是有修证的人，众生无知都在此，无可救药。</p><p>如果宣传和修学这种唯识，宣传得越多，罪责越大，学得越多，越不得解脱。修行路险，各种陷阱都会遇到，多修福德，增长智慧，最为切要。到后世，这些讲法都成了古文，人往往崇古，如果崇拜这种错误的古文，岂不害人？世上有几个人开眼，能辨别出古文的对错是与非?</p><p>十四、生公说法顽石点头</p><p>道生和尚说过一句话：一阐提人也能成佛。由于没有佛经的依据和证明，大家都认为这个说法是错误的，但生公和尚坚持己见，不肯改，于是众人把他赶出僧团。无奈生公就把这个道理讲给石头听，结果石头被感动得点头了。不久大涅槃经从西印度传到中国震旦，里面佛说一阐提人在消除所有无明业障之后，能够成佛，证明了道生和尚所说正确，他才被僧团所接受，重新回到僧团。可见，正真的法，虽然没有佛经作为依据，那也是真理，是正见，真理是不依人们的意志为转移的，也不见得不是佛说的就不是真理。</p></div>"
},{
    "title": "第十章 法义篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  法义篇</strong></p><p>一、什么是法</p><p>法是轨持义，只要是能在世间显现出来的，不管有多么虚妄，不管自己和他人能不能认知到，能不能体会到，只要有影像，就是法。</p><p>比如：人、事、物、理，不管是什么人什么众生，只要存在，就是法。事，不管什么事，吃饭穿衣走路，行走坐卧，言谈语笑，花开花落，人事和合与纠纷，伟大事业和渺小事业，只要在世间存在，不管什么时候存在，不管正在发生，还是内心想象，都是法。内心里想象出来的，幻想出来的，都是法，只要是心里的相，都是法，心也是法。</p><p>物，不管眼前还是背后，不管过去还是现在，不管是想象的还是回忆出来的，不管能不能接触得到，只要有影像，都是法。</p><p>理，世间一切法则，规律，制度，章程，善恶是非，正确与错误，一切的思想观念，一切的念头，一切佛法当中的真理观点，只要能在心中显现出来的，都是法。</p><p>这些法都是心中的影像，都是心中的幻相，都是众生五蕴身运作出来的，十二处和合运作出来的，十八界里辗转所出生的，无穷无尽。最后最究竟的一个法，就是如来藏，不管众生认不认祂，知不知祂，识不识祂，祂都作为一种终极真理而存在着。</p><p>二、什么是法</p><p>法，就是事实真相，就是真理，所以菩萨讲法就要讲事实真相，讲真理。而每个事物的事实真相只有一个，每个人从自身的角度观察，如果观察得准确无误，那么观察出的事实真相都是相同的，也就只有一个事实真相。如果说每个人观察得出的结论不一样，那就说明很多人观察有错误了，没有如实观察。没有观察正确的原因有很多，每个人的原因不尽相同，但共同特点是观察力不足。</p><p>既然讲法是讲事实真相，那么这个事实真相，最好是自己亲自证明了的，这样讲出来是最有说服力最亲切的。如果讲法只能引述他人的言论，那也要有相当好的辨别力，能够辨别和证明他人的言论所说确实是事实真相才行。我们目前只能确定佛所说的都是事实真相，但自己也没有能力去实际证明，只是一种对佛陀圣言的仰信和崇信而已，还达不到正信和真信，真信是需要证量的。那么除佛陀之外的人，要仰信和崇信就要冒一定的风险，只有正信、证信和真信才可靠。但是证信是非常非常困难的，所以末法时期的众生大多数都是仰信、盲信和崇信，不是正信和证信真信。</p><p>三、什么是法界</p><p>法界分为出世间法界和世间法界，世间法界分为十八界、十法界和三界世间。十八界就是众生的六根、六尘、六识界，十法界就是四圣六凡法界。界，就是功能、界限、种子差别，就是分界线。不同的界，功能作用不同，六根的功能与六尘的功能不同，与六识的功能不同。六道众生各有各的界限，四种圣人各有各的界限；十法界各有各的界限；三界就是欲界、色界、无色界，也有界限，也可以说是法界，三界也各自有各自的界限差别。</p><p>出世间法界叫作一真法界，就是真如如来藏，祂不属于三界世间，不在三界里，没有三界世间相，但也非不在三界世间。所有三界世间法以及十方诸佛国土，华藏世界以及世界海都在一真法界里，都不出真如心之外。众生修到妙觉位要成佛之前，要在兜率内院候补，等着因缘成熟，下生人间八相成道。等到人间的众生根性成熟了，妙觉菩萨的成道时节也到了，就要下到人间八相成道。所以諸佛都是到人间来成就佛果的。</p><p>四、什么是功德</p><p>功德就是智慧的受用，有智慧就消业。断我见明心就会消除三恶道的业，智慧性的忏悔也有功德，能消业。修行过程中智慧的增长，都能消除不同程度的业，恶业尽即成佛。</p><p>五、什么是乾慧</p><p>乾慧，乾是干的意思，没有水的意思。乾慧就是没有定水滋润的慧，干巴巴的慧。这样的慧，没有实际指导作用，就像土里没有水，不能成为泥土，没有泥土的粘性，不能抹墙，不能铺地面，不能搞建筑。乾慧也是，说得口干舌燥的智慧，实际上都不是从自己的胸襟里掏出来的，不是实证的，意识学来的推理出来的分析出来的，这只是学语之流，不是真正的智慧。这是修行的最初一个阶段，若只停留在这个阶段，以为究竟，那就止步不前，不能入到真宝山中。</p><p>六、所谓的正法，是能够让众生趣向于破除无明，趣向于解脱的法。真正的正法，是指真如自性之法，真如是世间出世间最正的，是一切法的根，一切法都从之而出；自性又能使得众生依之得解脱，依之证涅槃，依之成就佛道，远离一切苦厄，因此真如自性是正法，有关真如自性的法也都是正法。</p><p>除了佛所说的法，和符合佛所说的关于解脱和般若之法，是正法，其它的比如外道法和世间的善法，不能让众生得到解脱和明心见性破除无明，因此都不是正法。世间的善法能让众生伏恶修善，做个好人和有合格的人，但最多能暂时保住人身或者生天享福，不能趣向于解脱，因此也不属于正法。众生即使修行了世间的善法，也不一定就能让众生产生出离心，产生要求解脱的心，也许还会增加生死系缚。</p><p>佛法与世俗善法并不矛盾，并不互相抵触，相反二者是相辅相成的关系。佛最初讲法也讲人天善法，讲五乘法，但是最后回归到一佛乘，都是成佛之法。世间里的善法是很有必要的，应该大力提倡，这是修学佛法的基础。但是世俗善法毕竟不是佛法，不能代替佛法。如果佛门里的善法多了，把这些善法当作真正的佛法，那就会充斥了真正的佛法，最后真正的佛法就会被冲淡和代替，佛法就会快速的灭亡，然后世俗的善法也不会存在了。</p><p>七、问：内六尘是色声香味触、法处所摄色，法处所摄色是否就是法尘？它的具体定义是什么？五尘与这个法尘的关系，是平等、平行、还是摄属关系？</p><p>答：法处所摄色，就是法尘，是依内五尘另外再次变现出来的法尘，也是由四大微粒组成，摄属物质色法，与五尘和合起来，构成完整的色声香味触。五尘只是色声香味触的一少部分内容，不是完整的五尘色法，法尘是色声香味触的大部分内容，合起来才是完整的色法。如：色尘与色尘上的法尘合在一起，才是完整的内色尘，声尘和声尘上的法尘合在一起，才是完整的声尘。五尘与法尘是平行并列的关系，互相依赖的关系，法尘依五尘而出生和存在。内五尘由五识了别，法尘由意识了别。从这里就看出，单独的五识不能了别色声香味触，单独的意识也不能了别色声香味触，必须是五识与意识和合起来，才能了别完整的色声香味触。</p><p>八、外五尘，是共业众生的如来藏共同变现出来的生存环境，这是必须要有的，如来藏依外五尘才能变现出六识了别的内六尘。外五尘不是单个众生所能独自拥有的，也不是单个的如来藏所能独自变现的。因为有外五尘，我们自己的如来藏才能依据外五尘，在自己的后脑胜义根里变现出与外五尘一模一样的内五尘，内法尘也随同内五尘同时变现出来，然后六根与六尘相触，如来藏出生六识了别内六尘。可是众生都以为了别到的是实有的六尘境界，把自己六识所见闻觉知到的六尘境界当作真实，执著不已，造作各种业行，不知道都是幻化出来的，于是生死轮回不断，苦恼不已。</p><p>九、如何证明有外五尘的存在</p><p>譬如外面的山河大地，就是外色尘，这是很多众生共同拥有的，不是一个人拥有的。所以你能看见山河大地，其他众生也能看见山河大地，当自己睡着昏迷死亡时，自己看不见山河大地，但是其他众生仍然能看见。这就说明了山河大地不是一个人所拥有的，而是所有众生共同拥有的。</p><p>再比如你家的房子，不是你一个人拥有的，你的家人也能享受到房子，也能住在房子里。当你离开家门接触不到房子的时候，房子仍然存在，你的家人仍然住在房子里，房子也属于他们的。当你们全家都离开房子的时候，其他人仍然能看见房子，也可以搬进去住，他们也可以成为房子的主人。</p><p>没有外五尘，就没有内五尘，内五尘依外五尘而有，就像镜子里的影像一样。我们都是活在镜子里的影子里，而影子之外，还有实体，其他众生的如来藏依那个实体还能幻化出影子，让其他众生了别；如果没有实体，就没有影子，镜子不会无缘无故现出影子。外五尘犹如天上的月亮，内五尘犹如水中月，千江有水千江月，都是月亮的影子，而天上的月亮只有一个，就是外五尘之一的色尘境。</p><p>外五尘也是唯心所现，是如来藏变造出来的，虚妄不实，生灭变异，也要消失灭亡，不久住。在我们出生到地球上之前，地球就已经存在了，那么地球是你的心单独变造出来的吗？显然不是，它是共业众生的如来藏共同变现出来的，是外五尘之一，我们死后，地球还照样存在，为其他众生所用。直到所有众生与地球缘尽，众生都死亡后，地球就毁灭。</p><p>十、虚空与色相</p><p>虚空是色的边缘，是一种没有色相的色，这是对虚空的定义，这句话可能不好理解。虚空可以依色显发，但不是依色存在，虚空的来源是如来藏，依如来藏而存在，因为有如来藏才有虚空的显现。色相也是因为有如来藏，才能显现出来，这是一切法的根本来处。它们表面上的虚假现象是，色相依虚空显发出来，虚空依色相显发出来，二者互相衬托。没有色相时，虚空照样存在。宇宙没有形成之前，就是一片空无的虚空，没有一点色相，那就说明了虚空不依色而存在。</p><p>十一、空间与虚空的区别</p><p>空间有时候与虚空等同，有时候并不等同，依于某坐标物而划分。比如房间，有房子才有房子的空间，没有房子，就是虚空。比如说中国的领空，也叫做中国的空间，有中国才有中国的领空，没有中国就没有中国的空间。空间也是众生争夺的目标之一，都想扩大自己的生存活动空间，所以就有争夺。</p><p>人类嫌地球的空间不够用，还要想占领其他星球的空间。没有地球和所有的星球，就没有星球空间，依他而有的法就是依他起性，是虚幻不实的。外宇宙星空是第一次变现，不实如幻；依外星空而变现的内星空是第二次变现，更虚幻不实；依星空色法而衬托出来的内外空间，尤其虚幻不实。</p><p>十二、凡夫众生的六七识都有无明，包括一念无明和无始无明，还有无量无边的尘沙惑。一念无明，就是对自我五阴的贪爱和执著，对三界世间一切法的贪爱执著。由于有一念无明，就有三界的生死轮回苦，要想断除生死轮回苦，就要灭尽一念无明，首先就要断除五阴为我的我见，然后修出初禅，依次断除贪嗔痴慢等等诸烦恼结缚，对自我五阴的贪爱和执著就能断尽，对三界世间法的执著就能断尽，一念无明断尽就能解脱生死轮回苦。</p><p>七识里的无始无明，就是从无始劫以来，众生从来就不知道法界的实相是什么，不知道有诸法的实相心如来藏，是祂出生的三界世间万法，于是就执著世间万法为真，这就是无始无明。证得法界实相心明心见性时，就打破了无始无明。七识认识了诸法实相，有了般若大智慧，以后无始无明都断尽时，七识的无明就灭尽，彻底转识成智，究竟成佛，如来藏就改为无垢识。</p><p>十三、众生共同的部分，就是共同的业力，共同的外界山河大地、宇宙器世间，共同的生活环境，其他就不共同了，都是各自受用各自的五阴十八界和第八识。每个众生都有自己的八个识，都不共用，所以众生才千差万别，心心不同，一个人一个想法，一个人一种作为，一个人一种果报。</p><p>第八识不生不灭，本来就有，谁也不能变现祂。第八识有缘就变现万法，无缘就不变，随缘变现时，自己从来都不改变。</p><p>    十四、所谓的妄念，就是意根攀缘作意，意识生出的念头和想法，有时是七个识和合起念。七个识只要存在，就要起用，七个识起用，必然有念头的出现。八个识都有五遍行心所法：作意、触、受、想、思。思，就是思考、思量、抉择、决定、造作；想就是心上取着了相，认了相，识别了相；受，就是领受、领纳、接受，作意，就是引心到境上，专注于境；触，就是识心接触境界。第八识取的相与前七识不同，思量的内容不同，领纳的对象内容不同，作意的对象不同，触的对象不同，处处都与前七识不同。</p><p>识，就是分别，要想没有分别，就要灭掉识，那就是眼识灭掉不见，耳识灭掉不听，鼻识灭掉不嗅，舌识灭掉不尝，身识灭掉不觉触，意识灭掉不觉不知，意根灭掉不作主，这样万法就随之也灭掉。但是没有修到四果阿罗汉的境界，也不能灭掉意根。如果第八识也灭掉，万事就都废掉，一了万了，佛也灭不了第八识，何况其他人。</p><p>十五、问：圆觉经讲一切众生枉认四大为自身像，六尘缘影为自心像，解开这个谜，佛法也就讲完了，但是多生多劫的爱恨种子怎么除去呢？</p><p>答：身心问题解决了，佛法还没有讲完，还有唯识种智问题极多极广，需要修学。断我见，再明心见性，具有唯识种智入初地，染污种子就会慢慢清除掉了，爱恨种子断尽，就成佛。需要在因缘现前时，清除内心的烦恼习气，就断除染污种子了。</p><p>但是身心问题完全彻底究竟解决了，也就成佛了，佛法就是用来解决身心问题的，身包括内身色身，也包括外身宇宙器世间生存环境；心，就是七个识。七个识都转识成智，身心世界就彻底脱落转变，报身佛和化身佛都成就，世界变成纯净的佛国土。</p><p>十六、圆觉经，全部都是讲佛性的妙用，讲如来藏之性。不是让见闻觉知性的七识妄心也像佛性那样。如果把圆觉经里经义理解为阐述七识的作为，那就误会大了。就如六祖在坛经里都在讲真如自性，无数人却误会为是讲见闻觉知性的七识妄心，误会真是大极了。</p><p>一切法都是如来藏，都是如来藏性，如果没有证得这个理，就不要引经据典来印证自己的见解。引经据典印证自己的不正确的观点为正确的，就是诽谤佛和法，罪过不小。如果你能现前观察到贪嗔痴性，如何就是佛性，如何是究竟觉性觉相，那么才可以说一切淫怒痴即为究竟觉，智慧愚痴通为般若，否则请保持沉默。</p><p>没有证量的时候，还是不要讨论经义很深难懂的佛经和甚深法义。尤其是与自己相差过于遥远的佛地境界，我们选择沉默，我都不谈佛地如何如何，其他人就更不要谈论了，有什么根据可谈？什么叫作高谈阔论？超过自己证量和理解范围的内容，如果要说，就是高谈阔论。</p><p>十七、什么是心不相应行法？</p><p>心不相应所行法，总共有二十四个：得、命根、众同分、异生性、无想定、灭尽定、无想报、名身、句身、文身、生、住、老、无常、流转、定异、相应、势速、次第、时、方、数、和合性、不和合性。</p><p>心不相应行法，是八识心王、五十一心所法和十一色法共同显现出来的。比如，无常这个心不相应行法，是由第八识、第七识、第六识和五识共同和合运作显现出来的，由八个识对万法的作意、触、受、想、思心所法显现出来的，是在十一个色法上显现出来的。在心法上也能显现出无常，也都是八个识和心所法共同运作显现出来的。这些无常法不由七识妄心所决定，不跟随七识的认知而改变其无常性，因此叫作心不相应行法。</p><p>五阴的无常，有八识共同和合运作显现出来的，八识与心所共同出生五阴，生起感受，生起了别，生起各种造作，在眼耳鼻舌身、色声香味触、法处所摄色所和合处显现出来，在六识及心所处显现出来。其它的心不相应行法都是如此显现。不由我们的觉知心所决定，不管我们的心怎么样，如何认知，无常就是无常，不能因为我们的贪爱，五阴世间就变为常，这不是由心来决定的。同理，时、方、数、老等等二十四个心不相应行法，都是八识、心所与十一色法共同显现出来的，不是由七识妄心所决定其存在与否。</p><p>十八、时间是依物质色法显现出来的，物质色法的生灭变异就显现衬托出了时间。物质色法是依心法和心所有法显现出来的，心所有法依心法运行，心法归于第八识。物质色法的次第迁流，幻化出与心不相应的行法时间，时间就是心不相应行法。</p><p>物质色法出现，识心出现，识心就能依物质色法来识别判断时间和空间。没有物质色法，显现不出时间，也显现不出空间。如果没有识心，更无法识别、认知和判断时间空间，有也等于没有。试想，没有太阳，没有树木、房屋和山林，如何能了别出时间？如果连虚空都没有，更没有山林河池、大海和高山，空间要如何划分和界定。那么依着某些法才能显现出来的法，就是与心不相应的行法，比物质色法还要虚妄，比七识心还要虚妄。</p><p>虚空不用物质色法衬托着，与有标的的空间有稍许差别。虚空不是心不相应行法，是如来藏用空大种子生成的与物质色法不同的色法，是没有色相的色法。</p><p>十九、推理，并不一定是证得。比如辟支佛推十二因缘或者是十因缘，推到阿赖耶识那里，就齐识而还，不能过彼（阿赖耶识）。虽然如此，也没有找到和证得第八识，不是实证阿赖耶识者。实证阿赖耶识者是大乘菩萨，是大乘见道，必有大乘善根福德因缘和发心，缺一不可。如果说外道和小乘也有大乘菩萨的发心，那必是大乘菩萨，因为不管菩萨学什么法，都是围绕于大乘，为了度众生和成就佛道。不发菩萨的心愿，其行止和结果必不是菩萨，必不能见道，必不能有菩萨的果德。否则发外道的心也能成佛。佛就没有必要强调众生一定要发大心大愿，发自利利他的菩萨清净大愿，以完成佛道的修证过程，圆满成佛。</p><p>辟支佛尽管把生死的来源推到阿赖耶识这里，最终还是走向涅槃灭度，毕竟没有行菩萨的大道，而利乐众生。这点足以证明辟支佛不是菩萨，没有实证阿赖耶识。种子不正，根不正，如何能有正果？就如有一些人，在悟前把一切法都归于第八识这里，认为其来源都是第八识，其性都是佛性。尽管持这种观点，但毕竟是理解和推理、想象，并没有实证第八识，不属于明心菩萨。</p><p>禅宗有个话头，要大众参究：万法归一，一归何处。无数人都猜测出这个一就是如来藏，万法都归于如来藏，都来自于如来藏。可是尽管如此，仍然不属于大乘见道，不属于破参，还不是真实义的菩萨。因为仍然没有证得如来藏，不知道一归于何处。不知何处，没有找到如来藏在何处，仍然处于无明之中，离证悟不知道还有多远的路程。相似法毕竟是相似法，代替不了真实法，没有真实法的功德受用，说食并不能饱。</p><p>有的人说阿罗汉和辟支佛都实证第八识阿赖耶识了，如果是这样，那就都叫作菩萨好了，何必又叫作阿罗汉和辟支佛，佛法不必分为小乘四圣谛、中乘十二因缘和大乘菩萨六度，都叫作菩萨法，都以明心见性和成佛为根本目的就行了。事实上，根本不是这样，其中的区别很大。</p><p>十九、法法相通，没有说学此法，不通另一个法的。三界唯心，万法唯识，唯识学好了，很多经典都会贯通。学唯识，观行识的运作，是非常有乐趣的，既能了解自己，也能了解他人和世界，能逐渐摆脱愚痴，获得无量智慧。一切法都落实在识上，有识就有一切法，明了识，就能明了一切法，就能成佛。</p><p>二十、略谈色</p><p>色即是色蕴，是五蕴之一，有相貌、形体、色彩，包括显色、形色、表色、无表色，其中后三者就是法处所摄色。显色是青黄赤白；形色是大小方圆长短宽窄；表色是色的形状、姿态，身体的运动和动作、行来去止等等；无表色是色相上所显现的美丽、丑陋、魅力、韵味、气质、学识、修养、平静、愤怒、开朗、热情等等。法处所摄色是色声香味触上面所显现的法尘，与意根相对，是意识所了别。色还包括众生色，男女色相，宇宙山河大地，植物矿物，房屋宫殿无情物等。</p><p>《金刚经》说∶“若以色见我，以音声求我，是人行邪道，不能见如来。”意思是说要想见如来，见法身佛，见真佛，不能以色相、声相求见，有色有声有六尘相的不是真佛，是报身佛应身佛化身佛，有三十二相八十种好，这是化现的有生有灭的佛，魔王波旬因为福力的缘故也能化现佛的相貌。佛涅槃后，四祖优波鞠多就让波旬化现出释迦佛的身相来目睹瞻仰，波旬就真的化现出佛的色相，从树林中走了出来，身后跟着一群弟子，优波鞠多乍一见，以为是真正的释迦佛，情不自禁地礼拜起来，波旬受不住礼拜就现了原形。所以要见如来不能着色相，不能从色相上来见。</p><p>二十一、每个讨论的题目，相当于一篇小论文一样，自己要有论点，然后展开论据，运用譬喻说明，或者举具体事例。</p><p>宗，就是宗旨，就是自己的论点。因，就是证据、论据、事实，用以辅证宗旨。喻，就是贴切形象的譬喻，以说明宗旨。学会这个本事，才能登上论坛，与人辩法，没有这个本事，就不要参与任何辩论。台下练练口才还可以。但是口才好，不等于逻辑思惟好，不等于能说清楚事实，不等于掌握了真理，不等于有大智慧。口才远不及头脑，不及逻辑思辩能力。</p><p>二十二、如来、慧解脱的阿罗汉与俱解脱的阿罗汉其解脱有什么异同</p><p>佛与阿罗汉都能出离三界世间生死缠缚，都能解脱于三界，不受三界的生死系缚。而佛是究竟的解脱，不仅了了分段生死，也了了变易生死，无有一丝无明缠缚自心，因此是究竟解脱。阿罗汉的解脱还不究竟，还有无明，还有变易生死没有了。慧解脱的阿罗汉还要等待世间因缘尽才能出离三界解脱生死，俱解脱的阿罗汉不用待时解脱，随时能出离三界，解脱生死。</p><p>二十三、问：阿罗汉入无余涅槃以后，无余涅槃是三昧境界吗？</p><p>答：三昧境界，里面应该有主人，有入三昧境界者，将来就会有出三昧境界者。而涅槃里没有主人，没有人入涅槃，阿罗汉的五蕴十八界全部灭尽了，意根也灭尽了，那就没有阿罗汉了。既然没有人入无余涅槃，也就没有人出无余涅槃，因此说无余涅槃不属于三昧境界。</p><p>二十四、在娑婆世界，人们把日常生活的常识当作现量认知，可是这些所有的现量认知修到八地菩萨的时候，可能都改变了，不适用了。那时候才发现原来一切都不是那么回事，没有一成不变的东西和法则，山可以不是山，水可以不是水，一切物质色法的虚幻性，决定了物质色法的不稳定和不可靠性。</p><p>我们认为火有燃烧性，能烧灭一切物质色法，到八地菩萨时，就知道不一定，火的性质会改变，也许连一张纸都烧不了，何况菩萨的色身。我们认为水有淹没性，到八地菩萨时就知道不一定，也许连一张纸都侵湿不了，何况菩萨的色身。我们认为石头不能吃，不一定，大修行人完全可以用石头煮着当山芋土豆红薯吃。所以普通众生那些所谓的现量认知，都错了，都是非量，众生不要太自信就对了。</p><p>泥人都是用泥捏出来的，但是没有禅定，只能被捏，普通人能捏什么？捏个生死轮回苦而已。现代人喜乐于学语，喜欢背诵，喜欢学知识，喜欢学富五车，不喜欢禅定中实证。</p><p>二十五、回向是意根愿意把功德送给其他众生，其他众生的意根也愿意接受，两个人的如来藏就会配合做交接工作。蠢动含灵因其无力修福修慧，全靠其他众生诸菩萨们回向，而积聚一些福德，再借这些微薄的福德之力，不断改进其生命质量和层次，无数劫后，才能托生为人。所以我们已经托生为人，并且有机缘学佛修行，应该感谢那些度脱我们的诸佛菩萨和善友，至于如何感谢，应该像诸佛菩萨度脱我们那样度脱众生。</p><p>二十六、牢关，顾名思义还是监牢的关口。什么是监牢？三界是监牢，五阴世界是监牢，出监牢的关口在哪里？在断我见和断我执上，并且对如来藏这个我也不执，心要空净，这是在证得如来藏基础上才能谈得到的，因此说这是禅宗第三关。能做到这点，就能出生死监牢的关口，解脱于三界，解脱于五阴身的束缚。在小乘说来，最起码有三果的解脱功德，心是解脱的，断除了贪爱和嗔恚烦恼，命终断除我执，断除一念无明，就有能力取证无余涅槃。</p><p>禅定上要求有初禅定即可，不需要太高的禅定，当然禅定是越高越好的。但不是像有些人说的非要把五阴身修得像木头一样，或者能灭掉等等，这是几地菩萨甚至是八地菩萨才能修到的。而处于禅宗第三关前后的人，属于十行位和十回向位菩萨，离八地菩萨还很遥远。</p><p>二十七、心清净与否，不在于分别不分别，不是把心灭除不用就清净了。而是在心运行分别的过程中，无有错谬和异想，没有无明和烦恼。有人长年累月睡大觉，不分别不做事，但不代表他心清净，某一天一旦睡醒了，一做事就是贪嗔痴烦恼一大堆。诸佛累劫不停止度众生，可是其心却是绝对清净。如来藏是永远清净，可是祂从来没有停止过运行和分别。</p><p>二十八、菩萨六度</p><p>我们学佛要想证得如来藏，明心见性，成为真正的菩萨，那就要修菩萨应该修的法，菩萨应该修行菩萨的六度波罗蜜。六度波罗蜜，第一度是布施波罗蜜，作为菩萨一定要修布施度，一方面是要与众生结善缘，布施与众生所需，众生就能信服你，跟随你一起来学佛修行；另一方面是要修自己的福德，只有自己的福德具足了，才有机会开悟，成为真实义的菩萨，入得佛门里。</p><p>明心的菩萨就入到佛门里，没有明心的菩萨还在佛门之外，还不是真正意义的菩萨，所以作菩萨首先一定要修布施行，让自己的福德具足；还要和众生结缘，因为和众生结缘，也就有机缘度众生，众生会欢喜成为你的随学弟子，你才能够带着众生，一步一步往上修行，将来成佛时，这些众生都会在你的佛国土里护持佛法，所以布施很重要。</p><p>第二度是持戒波罗蜜，因为持戒，心不越矩，就能清净下来，不犯罪业和过错，也就不受恶业牵累。因为持戒心得清净，才能有禅定；有了定才能够观行和参禅，从而能够明得真理，证得第八识，所以菩萨应该持戒，使心行清净。没有一个菩萨有犯戒的想法，如果故意犯戒，那就不是一个真正的菩萨，说明他的性障还很重，还没有资格入得佛门里，不能成为真正的菩萨。所以要想当一个真正的菩萨，一定要持戒，一开始由被动持戒，变为自动自觉来持戒、守戒，到最后就没有戒可持。因为心已经清净了，没有犯戒的心，一切的行为造作都与自性清净心相应，这个时候不用去主动的持戒，就变为不持而持，时时处处身口意行都符合戒律，符合佛法，与如来藏体性相一致，这就是持心地戒。</p><p>第三度是忍辱波罗蜜，修忍辱也是要心得清净，降伏自己的性障，也是和众生结善缘。虽然众生给我们很多辱境，但是心要忍伏下来，不回报于众生，不嗔恨于众生，那么就和众生化解了冤仇，也结了善缘，自己的心性、性障烦恼也能够得到有效的降伏，这是一个真正菩萨的心行，是作为一个真正菩萨的标志，所以一定要修忍辱波罗蜜。</p><p>第四度是精进波罗蜜，作为菩萨，一定要在佛法上精进用功，而不懈怠。那在哪些方面精进呢？在布施上精进，在修福德与众生结善缘上精进，在持戒上精进，在忍辱上也是精进的，在修禅定上也是精进的，在修自己的般若智慧方面也是精进的，时时处处精进修行，善法就会得以快速的增长，那么就能够快速明心见性，这是精进波罗蜜，能到生死彼岸。</p><p>第五度是禅定波罗蜜，菩萨一定要修禅定，心住一境，既不散乱，也不昏沉，修出定力，才能作各种观行，然后才能证得佛法。这个定一个是四禅八定的定；再一个是心得决定的定，对于大乘法，对于如来藏法，菩萨已心得决定，确信不疑，不会退转。对于明心见性能成为真正的菩萨的法，能成佛的法，对于般若实相法，也心得决定。四禅八定的功夫，尤其是初禅以前的未到地定，一定要修持出来，这是观行参禅的基础，有了这个定才能够很好的观行，才能够证得自心本性，所以禅定是很重要的。有定同时也能生福，叫做定福，最主要的是，有定就能够增长大乘般若智慧，因此修定能到生死彼岸。</p><p>菩萨六度最后一个就是般若智慧。所谓般若是指什么呢？就是指我们的自性清净心如来藏，祂是不生不灭的心体。般若经典主要就是600卷《大般若经》，全部都是围绕着如来藏而宣讲的，《心经》《金刚经》等还有很多般若方面的经典，都是宣讲如来藏般若体性，这些内容我们要修习，要明理，明理以后，修出禅定，就可以参禅。这些六度条件具足了，才有能力参禅，时节因缘具足时，就能够证得自性如来藏，就能明心见性。</p><p>作为菩萨的修行，主要是修这六个方面。最后一条是般若波罗蜜，这是最重要的一个修行内容，一切的修行都是为了获取大智慧，有智慧能成就一切法，依赖于智慧才能得解脱，依赖于智慧才能得度生死和成就佛道。所以我们都应该努力熏修般若智慧，熏修如来藏法。</p><p>二十九、为什么有受皆苦</p><p>苦有三种：苦苦、行苦、坏苦；或分为八苦：生老病死苦、求不得苦、怨憎会苦、爱别离苦、五阴炽盛苦。行苦的行，是指运行和变化的意思，五阴身心一点点发生变化和毁坏，根本停留不住，把握不住，因此五阴就有行苦。坏苦的坏是指破坏、消散、变异，五阴也是把握不住的，因此五阴就有坏苦。一切苦的本身就是一种苦，这就是苦苦的意思。众生不止有三苦、八苦，扩展细分起来有无量之多的苦，可是愚痴众生身在苦中却不知苦，还劳驾佛陀来娑婆开示苦圣谛，开示了以后，众生仍然不能认识苦，也不能断苦。</p><p>受分为苦受、乐受和不苦不乐受，不管是哪种受都是苦。即使是在乐受里，也有行苦，乐受之后是坏苦；乐受的同时，心里也仍然有苦，乐时不是纯乐的，而且众生还要为各种乐受付出一定的代价，因此五阴世间没有真正的无苦的乐受。</p><p>在无色界里，非想非非想天的禅定境界是极快乐的，但是那里也有行苦，时间过得非常快速，定中八万大劫很快就过去了，过去之后就是一切苦恼就现前了。众生在快乐的时候不希望快乐消失，这种希望本身就是苦，属于有所求的苦。众生追求佛法时要付出辛苦代价，这本身也是苦，但是苦中却有乐受，之后一切苦就会渐渐转化为乐受。所以我们要精进修学佛法，不畏困苦和艰难，修到最后都会变成乐受和舍受。不管哪种受都是无常的，无常的就是苦的，所以说有受皆苦。</p><p>三十、舍识用根，这种说法是不对的，如果没有识心，是谁来用根，根是怎么用的呢？除非既是根也是识的意根第七识，离开六识也可以起用，但一般人是做不到的。一切法都是由心来支配，没有心识就谈不到修行。我们学佛修行应该把佛法的基本道理搞清楚，才能下手起修。</p><p>所谓舍识，是把六个识都灭了不用，只用六根来修行应对一切，但是如果没有眼识，眼根就不能见色，如果眼根也能见色，那么死人也能见色，睡着时也能看见色，这样人就没有死亡也没有睡着。六个识如果灭了，人就不能了知一切法，即使有根也不能起作用。根是接收六尘的受纳器，是用来出生六识的，没有识，根就没有用。所以不能说修行要舍识用根。我们用的是识，一切法都是识在起用在分别，没有识的众生就如一块木头，不能思惟、分别、计划、打算、推理和判断。</p><p>如果没有意识，前五识也不能存在，还是了不了根。即使能用，眼识只能见色的粗相，耳识只能听声音的粗相，没有意识心的分析判断推理思惟，什么法也不能了别到。而眼根不能自己用自己，只能靠眼识、意识、意根、第八识和合起来用，耳根、鼻根、舌根、身根都是这样，没有识，根不能有任何的作用。如果意根自己能单独起用，必须有四禅八定和神通，如果甚深禅定，意根还是不能了知六尘境界，也不能修行。</p><p>三十一、音乐是声尘，是四大组成的物质色法。物体撞击发出来的声音，是外声尘，我们如果听到了，是听到的内声尘。音乐旋律依声音而有，属于五尘上的法尘，是法处所摄色。如果是看着乐谱而想象出来的音乐旋律，就是独影境，如果连乐谱也不看，就能凭空想象出来的音乐旋律，就更是独影境，都是四大组成的色法。</p><p>不同的物体撞击，会发出不同的声音，撞击的力度不同，声音也不同，撞击的角度和时间不同，也会发出不同的声音，所以敲打不同的物体，用不同的力度和角度，就形成了一连串不同的声音，有节奏感，这就是所谓的音乐旋律，生灭变异，非常的虚妄，不可执著，不可把捉，所以说喜欢音乐也是愚痴，也是贪爱，不出生死轮回。</p><p>由此想到，能量也是物质色法，四大组成，物质运动产生出来的，也能消耗和递减，生灭变异无常，不可把捉。热是触尘，四大组成，是物质色法，是能量。电子运动，水的运动，都能产生能量，是物质色法，有实际的功用，能被六识感知到。声音也可以说是一种能量，是物体的动能，属于能量。饮食当中有能量，能够让身体有力量，只有物质色法才能让身体有力量，有温度有暖度，能改变身体。</p><p>物质形态的改变，就能产生能量，形态不同，能量就不同。水能发电，就是利用水的运动产生能量的原理。身体能量少，多运动，跑步，就能产生热量，温暖身体。电磁波、磁场是一种能量，能成熟饮食。</p><p>地大也是一种能量，能把人打死，就是地大能量的作用。火大也是一种能量，能活命，能烧死人。水大也是一种能量，能冲垮堤坝，能淹死人，能解渴。能量，也叫作一种力量，四大都有力量，都能形成力量。静止的物体能起阻挡和遮障的作用，也是一种能量。没有力量，就不能起阻挡的作用。土地也是一种能量，能承托众生，承托物体，没有力量，就不能承托。静止的河水也是一种能量，能漂浮物体，托载物体。</p><p>三十二、人分成两段，一段或者两段都死。蚯蚓可以分成七段或更多，都能活，原因是虚空中有很多无福众生，没有身体，总是寻找机会投胎，蚯蚓的色身是低贱无福的，适合这些无身无福众生，蚯蚓分成几段后， 众生的如来藏就马上投到其它几段身体中，蚯蚓的那几段身体就都活了。一段是原来蚯蚓自己的，其余都是无福众生后进去的。虚空当中无身的众生非常多，没有身体可以依赖，都很苦恼。所以各类众生只有遇到能投胎的缘，不管什么胎都会投生过去，考虑不了投胎以后的命运和痛苦。</p><p>大千世界众生太多了，三恶道的苦难众生简直就数不清，光是一个众生身上的细菌就无数，何况所有众生身上的，何况虚空当中的，何况十方世界的。所以我们已经得人身，而且遇到了佛法，应该精进修行，保住人身，不能再下三恶道了。为那么多的众生着想，为自己无始劫的父母亲人着想，也应该精进修行，为怜悯天下众生，应该发心精进修行。一失人身，万劫难复，有幸遇到佛法，多么不容易，一定抓住机会修出来，以后广度无量众。看到那些苦难众生，自己发大誓愿，自利利他，是不难的。</p><p>三十三、众生从无始劫以来，就有无明，心里从来没有明过；如果众生没有无明了，无明断尽了，就是佛。众生从来没有作过佛，如果众生作过佛，永远也不会再变回众生。圆觉经里讲过这段，世尊举例说：譬如金矿提炼出真金，真金永远不会变回金矿。意思就是说成佛以后永远不会变回众生。这也说明众生是从无始劫以来就有无明，这没有什么道理可讲，法尔如是。楞严经第四卷里，阿难也问了世尊无明从哪里来，为什么有无明，世尊说无明没有来处，没有原因就存在着，如果有原因，那就不是无明了。</p><p>三十四、学佛修行的目的是为了成佛，佛是大智慧的成就者。所以我们修行的终极目标是为了获得大智慧，智慧解脱，智慧成佛，一切的方法手段都是为了获得智慧。 有智慧就没有无明，有无明，就没有智慧，破无明得智慧。那么我们修布施波罗密，能获得智慧，到彼岸。持戒波罗密、忍辱波罗密、精进波罗密、禅定波罗密， 都能获得智慧，到达彼岸，获得究竟解脱。</p><p>波罗密就是到彼岸，脱离生死的此岸的意思。我们的本觉心没有无明，没有生死，不在生死的这一岸，也非不在。祂在没有生死的那一岸，也非在那岸，非有那一岸，即是本觉的中道性。我们修行破除所有无明，获得究竟智，就与本觉相应，也没有生死，非不生死，即有佛地的解脱色。即在涅槃，又不入涅槃，就是佛地的无住处涅槃，在在处处无不自在，无不解脱。如果我们的修行方法不能获得智慧，不能得解脱，就没有真实的受用。我们就要重新思考，选择正确的修行方法，以利更快地迈向佛地，获得究竟智。</p><p>三十五、很多心理学者等等社会人士并不信佛学佛，却能把意识和潜意识分得比较清楚。我们这些学佛学唯识的人，却分不清二者的区别，说来真是汗颜惭愧。唯识学者唯识学家专家，其观察思惟智慧，如果还不如一个没有禅定和般若唯识智慧的心理学者，那还算作什么唯识专家学家学者。不知道为什么会出现这样的状况。</p><p>甲：我是这样理解: 有些学者，艺术家，科研人员经常会因为常研究而日思夜想，以致定力较强常进入三摩地状态而不觉，所以能观察细微。</p><p>乙：对，他们有禅定，却不是刻意修出来的，而是有极大的兴趣爱好。因为他们不执着宗教的条条框框。也不执着宗教的是非对错。我看到好多宗教徒反而限制了自己，活在思维概念的世界。这些学者对研究探讨工作有热情，有责任心，于是就能专注一心，其他人事都不感兴趣，就能发现真理和事实。</p></div>"
},{
    "title": "第十一章 种子篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  种子篇</strong></p><p>一、关于业种枯萎的道理，甚深又甚深，有非常深的道种智才能了知此中的深义。每个众生在成佛之前，所有的恶业障都要受完、报完、了尽，一点点都没有了，才能成佛；只要还有一点点的恶业存在着没有消灭，就不能成佛。众生无始劫以来所造作的恶业，在临成佛之时，全部都要受报，才能都消灭掉，这是不可能的。因为无始劫以来造作的恶业实在太多太多了，简直像尘埃一样多，如果都要受报才能消灭，那么三大阿僧祇劫肯定是受不完的，这么长的时劫也报不完，报不尽。可是每尊佛却只修了三大阿僧祇劫，恶业种子都已经消尽了，那么这些业种是如何消尽的呢？</p><p>有些业种由于长期没有现行出来的缘，渐渐的就自己枯萎了，消失了；尤其比较小的恶业种子更容易枯萎消失，太大的恶业种子是枯萎不了的，必须在菩萨地时就受报完了；或者由重业转变成轻业，重罪轻报而灭去了，所有的恶业必须消尽了，才能成佛。有很多的大菩萨在来人间时仍然要受恶业果报，那是避免不了的。另外一方面，菩萨在修行过程中，不断的修集善业，以至于生生世世的善业远远大于恶业，比较小一些的恶业种子出生的缘总是不具足，经过无限长的时间，意根总与善业种子相应，不与恶业种子相应，心地也逐渐清净下来，久远劫前的种子就枯萎消失了。</p><p>有的小一些的恶业种子，如果长期没有现行的机会，业种肯定是要枯萎的；意根的恶习气劣习气，如果长期没有表现的机会，然后又形成了好的善的习性，原来的恶习也就会消失了。能够消灭的那个业种，是指过去生的身口意所造作的行为作为种子，已经存到如来藏里了，将来遇缘就会现行恶果报，果报要到因缘成熟时才能实现。我们所要做的是，通过忏悔消业，做大善业，大于往世的恶业，善业的种子总是现前，恶业就没有机缘现前，让我们总是受善报，不受或者少受恶报，等我们未来有承受能力时再受恶报，那时受恶报就不是很痛苦的事了，也完全能够承受得了。</p><p>二、问：关于业种枯萎的道理，好像与“假使百千劫，所作业不亡；因缘会遇时，果报还自受。”似乎有矛盾，那四句偈语表达的应该是业种坚固，除非受报，否则断不会消亡的意思，该怎样解释呢？</p><p>答：这种业种枯萎的意思是，众生造业的习惯势力，由于长期没有造业的机缘出现，这种势力就会慢慢地减弱，以至于最后没有能力、没有惯性再去造作业行。就像种子长期存放着闲置着，就会失去其生命力，不会再生根发芽一样。造大恶业的人，下品往生极乐世界，最长在极乐世界的莲花里，住十二大劫，在这里熏修佛法，根本就没有一点点造业的机会，到最后心念上的恶也消失，再也不会造业了，这样才能从莲花里出来，面见化身的观世音菩萨闻法，而不解义，这都是由于往昔罪业遮障的缘故。</p><p>因为他在莲花里长久没有业行了，造恶业的惯性没有了，身口意的恶行都不会现起，已经成了习惯，他就不会扰乱极乐世界的清静和安宁。但是他往昔造的恶业，回到娑婆世界的时候，大的恶业缘熟还会受报，只是业报轻微一些，不会太重，不可能再去三恶道受报，只能在人间受些相应的苦报。这说明重罪能够轻报，轻罪就能消失。忏悔也是这样的道理，通过忏悔，把恶业种子消灭或者减轻，众生在以后可以不受恶业果报或者是轻受，业种就消失。所以说，不是所有的业种都是通过受报才能消失，很多是通过其他形式消灭的，否则到成佛时，恶报永远也受不完，那就无法成佛了。</p><p>三、悟前是否能净化种子</p><p>净化业种，一般是在断除烦恼以后，不再造烦恼业了，种子才能清净。在断除烦恼习气时，习气断除一点，业种清净一点。烦恼没有断尽时，身口意还要造恶业行，业种就不能净化。悟前，因为没有证得诸法实相，还有我见，还要执我，还会因我而造作恶业，业种就不能清净。悟后，证得真如，知诸法性空，五阴无我，才能渐渐的降伏烦恼，为我而造作的恶业越来越少。入地以后，才能不再造作明显的恶业，种子开始清净了，但是还有烦恼习气和无明，就免不了还有微细恶业不善业的出现。</p><p>学佛人要养成反观自心的习惯，就可以快速降伏烦恼。之后还要努力断除烦恼，修出初禅定以后，才能开始逐渐断除烦恼。否则只是压伏烦恼，以后遇缘还会造作贪嗔痴业。断我见和明心以后，有初禅定才能有能力断除烦恼，除此都是压伏烦恼，没有斩草除根，根不除，还会生烦恼草。一池污水，想要清净，最起码不再继续往里倒污水了，然后才能想办法清理污水，如果继续倒污水，那就没办法让污水变清净。所以净化种子，是在悟后，悟前只能压伏烦恼，尽量不造作恶业而已。</p><p>四、种子是否实有的</p><p>真正实有的只有如来藏，七大种子是如来藏本有的种子，从来没有生灭过，有真实的出生万法的作用，也可以说是实有的；至于业种，是后天生成的，生灭变异的，那就不是实有的。佛性虽然也是不生不灭，但是无余涅槃里佛性就不起用了，所以也不能说是完全的实。而无余涅槃里七大种子还在，佛性却不在，七大种子就像如来藏的心脏一样，与如来藏同在，因此可以看作是实有，其他都不实。</p><p>五、何者是定业，何者是不定业</p><p>业果实现的因缘还不成熟的，此业即不定，忏悔可消，证果可消，明心见性可消，入地可消，证得任何果位都可消。业果因缘已经成熟的为定业，对于一般人来说，必受报。然对修行有力度者，在业果实现时 也可重罪轻报，也可把业果转化，这都是不一定的。</p><p>对于圣人来说，一切业果都是不定的，可实现可转化而不实现，完全在当人。究竟理地来说，一切业果都不定。如果业果有定，则众生不能成佛，因为众生无量劫的罪业永远灭不完，罪业灭不完，则不能成佛。然现实世界中，十方诸佛无量，罪业都已消尽无余，因此说一切业果都无有定。</p><p>六、修行的目的是把心转变，尤其是把意根转变，恶业种子现前时，心不随恶业流转，恶业就消灭，再存的就是清净业的种子。如果通过修行，心所法改变为清净的了，造业后再存的就是清净种子。心也转变清净以后，恶业种子有的就会消灭，有的要提前受报，重罪轻报，报完即了。比如证果时，三恶道业就消灭，各种佛法的修证，都要相应的消灭一部分恶业种子。大的恶业还是要受轻微的果报。</p><p>在今世的修行中也会影响到往世存的染污种子，否则修行就没有什么用。无量劫的生死业种无量无边之多，修行不能改变前世业种，无量无边的生死业还要去承受，那什么时候能受得完，什么时候才能成佛？</p><p>修行能截断生死众流，没有恶业种子，就没有生死流了。生死为什么流？因为有无明，有业行。为什么有恶报？因为有恶业。什么是恶报？三界生死，六道轮回，由于无明造作的恶业，才有六道轮回，尤其是三恶道生死轮回。灭除三恶道生死苦受，就是要通过修行，灭除心地无明，比如证果时，明心时，入初地时，无明灭除一部分，三恶道业灭除，不再去三恶道受苦。</p></div>"
},{
    "title": "第十二章 修行篇(1)",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  修行篇</strong></p><p>一、供大家参考的修行功课</p><p>早晚各静坐至少半个小时，坐中可以背诵楞严咒或者心经，要慢慢的背诵，摄心的背诵。</p><p>每天能日行一善，如果做不到，每个星期行一善也可以。每天尽量修福，最好天天能供佛。其它的法，随缘随力修行。每天检查自己的戒行和心行，检查自己的起心动念，时常观照自心。读阿含经，明了五阴十八界的概念内涵，每天观行思惟一小段内容。读诵、背诵心经或者金刚经，能思惟一句话也好。行走坐卧时，心能缘于一法，或者背诵楞严咒，或者是心经，或者是念佛。有时间就思惟观行七个识的功能体性，再思惟第八识的功能体性。</p><p>每个人修行的内容和层次都不相同，自己能根据自己的实际情况安排修行内容，不要空过任何一天。每天再回光返照，检查一下内心，看看烦恼是否轻微一点了；心境是否平静，没有波澜了；对世俗的追求和挂念是否减少了；是否不太喜欢享受了；是否渐渐的有了一点出离心；心地是否变得淳厚了；世俗智慧和佛法的智慧，是否增加了；对自己的修行是否信心很大了；每天心理攀缘是否减少了；内心是否清明愉悦了；处理事情是否周全了……</p><p>二、知识不等于证量，现代人知识很丰富，因为缺少福德和禅定，不能证得，也就没有受用，生死问题不能解决。过去人听经闻法实属不易，可是实证却很容易，一但遇到真正的佛法，明心见性的法，就有能力参究，实证很快，很多人都有证量，有佛法的真实受用。菩萨修行的果位，以实际证量为准，不以知识多少来决定。每种观行没有作好，即使学富五车，仍然不是相应的菩萨果位，因为没有证量，没有实际证得。</p><p>相反，即使没有多少文化和学识，没有学过很多的佛法，可是一接触到真正的佛法，就能思惟观行出来，以此为基础，还能观行出来更多的佛法，那他的证量就很了不得，比学富五车的人要高，生生世世都能得到佛法的受益。现在有好多人都说自己证果了，自己明心了，是否真是这样，还是仅仅是理论上的知识，并没有实际证得，自己应该认真仔细的检查一下，生死大事含糊不得。</p><p>三、末法时期大多数众生都是口头禅，对所学的法都是理解的成分多，实证的少。定力不足，很难实证，侃侃而谈也没有用，那不是自己所有的证量。如果自己修不出来的内容，众生不愿意修的内容，都给否定掉，把菩萨六度暗暗的去掉几条，佛法都给掐头去尾，佛教正法灭掉的就快了，众生就会长期处在生死火坑里不能自拔。有的人不考虑佛陀的教诲，不考虑佛教事业的发展前途，只是一厢情愿随顺自己的不正观念，或者是为了迎合众生的心理，讨好众生，不能顺势引导众生如实修证，这样的话，魔王就高兴了。</p><p>现在口头禅还能泛滥，再发展一段时间，连口头禅都没有了，佛教彻底衰微。离佛法彻底灭亡还有八九千年，这么早就把戒定慧三学去掉两个，六度变成了四度，真让人汗毛直竖。我们回头看看佛教的发展历史，兴盛的时候是什么样，为什么兴盛；衰败时是什么样，为什么衰败。有智慧的人应该能看到，符合世尊教导的，完完全全遵守世尊教导的时代，佛法必兴盛。相反违背佛陀教导，断章取义，与佛教的法不一致，甚至相对立，佛教肯定衰微。</p><p>现在的佛法并不强大，如果再违背佛陀的教导，六度只修四度，未来连四度都不能修了；戒定慧三学，只要一学，将来就有可能一学也没有。诸位自己考虑，你是要为佛教添砖加瓦，还是要给佛教拆砖头。浮躁的时代，造就了浮躁的众生，众生的浮躁使得时代更加浮躁。可是有些人偏偏要推动众生的浮躁，究竟为了什么？</p><p>中国震旦的佛法，灭就灭在狂禅里，自以为说的头头是道，天花乱坠，可是里面没有实质的内容，没法实际修证到，也就没有一丝毫解脱的功德受用，智慧方面也只是狂慧和乾慧。可是众生不懂，大多数是外行人，只会看热闹，认为谁讲得天花乱坠，谁就有道，跟随着学习不管多久，也永远是原来的那点知见，不得增进。学习三年五年、十年八年，还在原地踏步的，说明你学的佛法有问题。没有问题的佛法，学习起来日日都有进步，提升很快。</p><p>六祖之前的学人还都讲究个坐禅，六祖之后的学人，手捧着六祖坛经，天天口若悬河，不再坐禅实修，不再参究佛法，好像坛经是自己讲出来的一样，好像自己都已经实证到了一样，自己已经没有什么可修的，只管到处卖弄唇舌，以为这就是道。结果呢，禅宗就这样衰落得没有了踪影。这就是历史，吸取教训吧！记住一点：不管你学了多少佛法，读了多少书，那些都不是自己的，不能作为自己的谈资，到处卖弄，这比乾慧还乾慧，这样不仅能断送自己的前途，也能断送佛教的前途。</p><p>只要自己没有实际证到，就不要认为自己有道了，慢心炽盛，四处辩论，有什么意义？应该掂量清楚，自己到底有多少真实的智慧，能得多大的真实受用，能得到什么程度的解脱。能准确掂量自己，就是智慧，也是降伏自我、降伏慢心的过程。不要再去掂量别人，好好掂量自己才是最重要的。如果都去曲意逢迎众生的缺陷和弱处，佛法就被搞得支离破碎；断枝抽叶的结果，就促使真正佛法灭亡，没有实质了。佛教的前途，也掌握在我们每个人的手上，不要认为跟自己无关，而不管不顾，执意妄为。</p><p>四、对于有些名词概念，我们不用太用心思搞研究，执著名相，徒浪费精力和宝贵时间，只要能把名词的真正意涵弄清楚就行，然后依义不依语，把理和事思惟透彻，讲明白。那些名言词汇的表相表面意思不用太在意，得义亡言，取其根本义，不必在文字词汇上没完没了的纠结，深刻理解佛法的究竟义、真实义，是最重要的。纠结那些词汇名言，类似于搞研究，佛法最忌讳搞研究，实证者闷头作事修行，语言的杂枝杂叶尽量剪除，都不用去理会，修行的思路才能明了，才能快捷入道。</p><p>龙衔海珠，游鱼不顾。把重点主要的法抓住，其他的都不去分神。断完我见，就知道后边那些事了，何必太过研究自己目前还没有用的事。聪明者先入门再说，在门外研究门里事，浪费很多时间。很多人就愿意扯那些语言葛藤，没完没了的缠缚自己，不得出离，实在是没智慧。</p><p>五、很多自以为有智慧的人，在禅宗公案面前，没有办法。也有一些人自以为有道，讲解禅宗公案，全部都落入世俗法里，俗人倒是很喜欢读，不知道那里面究竟有什么滋味。</p><p>有些人学佛法，钻在文字壳里，肢解文字，词语词汇，研究来研究去，好像明白点表面意思，就以为有道了，然后四处粘贴，慢心大发。其实学佛修行，不是钻文字壳，功夫在诗外，在菩萨六度上多用心修行，降伏烦恼，提高心性修养，培养福德，增强禅定，这些方面都用功修行，就能不断完善作菩萨的条件；不是整天埋首于文字堆里，去研究那些文字。如果学佛只是文字功夫，那么研究生博士生，都能成为大乘明心见性的菩萨，事实上却不是这样。</p><p>还有人强调不用三皈依，不用受五戒，只要认真参究文字，就能明心见性。那么外道都是聪明伶俐的人，外道不用信佛，只要研究佛法，就能解悟佛法。然而，他们永远不能成为大乘实义菩萨，即使知道一些答案，也不是大乘菩萨，没有生起智慧，没有菩萨心性之故。聪明伶俐之人到处都是，钻研一阵子佛法，就能明白一些表面内容，然而他们由于不具备菩萨心性，永远不能成为真正的菩萨，不会受到佛菩萨和护法善神的加持和庇护，因此也不能真正证悟。</p><p>六、理论也是实修的一部分，而且是最重要的一部分，不可以把学理当作非实修。学理是获得正知见的主要途径。有了正知见的指导，才好采取正确的方法，走上正确的方向。解脱生死依赖于正知见和正慧，成就佛道依赖于正慧。世尊在世时，只是为弟子们讲法传法，偶尔教些禅定，并不领弟子具体如何修行。弟子们听过法以后，都是一个人找一个清净地方，观行思惟世尊讲的法理。思惟通了，就得法眼净，证果了。有很多人就是在世尊讲法的当下就证果，那是听的同时就思惟。所以世尊讲法前都说：谛听谛听，善思念之，吾当为汝分别解说。</p><p>七、大乘佛法分为般若系和唯识系，般若部分是六百卷般若经，还有其它一些经文，是大乘法的基础，学到初地菩萨基本上就不用学了。大乘法最深的内容就是唯识，唯识全部学完，全部证得，就成佛。唯识上比较深的佛经都是涉及到唯识种智的，都是地上菩萨所修的内容，《解深密经》和《深密解脱经》是比较深的经典，再深的经典，娑婆世界可能就没有了，他方世界里肯定有。</p><p>要系统地学唯识，就要把八个识的体性都弄清楚，然后一一去证，证得以后再历缘对境地去观察这些识心，观察其互相和合运作的关系，这样智慧就能快速的发挥出来。阿含经里把根尘识三者关系讲得很清楚，三者的关系弄清楚，再懂得三者都是第八识所生，那么佛法就有一定的基础了。学大乘法不能轻视小乘，尤其小乘里的观行方法，修禅定的方法，修三十七道品的方法，对于我们修行大乘法帮助是非常大的，学好之后，入大乘见道也能很快。</p><p>八、听到一句话，或看到一个事物，十人有十种观点，百人有百种意见。为什么如此？各人识心不同，认知就不同；认知不同，感受就不同；感受不同，反应就不同；反应不同，言语行为造作就不同。因为识心没有达到一致的认知，各有各的认知程度，对于一件事情，就不可能有共识，没有共识，促成一件事的发展和成功就有很大难度。世间事很难做也在于此吧！</p><p>另一方面说，佛佛道同。为什么道同？因为每尊佛的修行都已经达到圆满了，既然是圆满，就是极尽，都是极尽了，程度肯定是一样的。而且是在任何一方面都是一样的，最主要的是在智慧上相同。那么每尊佛对于任何一件事的看法都是一样的，诸佛之间永远不会有分歧、有争执。那就是说，修行智慧越高的圣人，他们之间分歧的部分越少，共同的部分越多，越能和谐默契，达到共识。</p><p>所以我们修行的目标，是增进自己的智慧，把自己的知见变成见地（得道以后的知见称作见地），并且让见地越来越圆满，那么所有的事情都会变得圆融无碍。</p><p>九、正确的闻思才有正确的修证</p><p>炎热夏季，路人口渴见一水井，水清且深，找寻绳子与水罐，了不可得。无奈只能忍渴，不得清水来滋润，虽有井水，与己了不相干。学佛者也如是，口常说空，没有方法求证，徒喊口号，还在有中。常喊放下，不知放下什么，怎么放下，只能常执着了，只因没有方便的方法和手段。懂得解脱的方式方法很重要，不然就像站在水井边沿而口干舌燥。</p><p>佛法修行，闻思修证。首先多闻，听闻真正佛法，为佛所说，契合佛理。如果不符佛说，越多闻越增生死；其次是思惟，要如理如法正确地思惟，邪思邪解，更增生死。再次是修，按照佛理去修，闻的不正，思的错谬，一修就偏，不上正路；最后是证，闻的正，思的透，修的准，时节因缘具足，才能证得真。证得真才有真实受用，空喊放下，犹如不知目标何在，盲目开枪。多积福，严持戒，常修定，善修慧，解脱大道就在目前。</p><p>十、如何修行一佛乘法</p><p>佛法当中实际上只有一佛乘法，即使小乘解脱道的法义，也是成佛之法，一佛乘法当中的一部分，这是成佛必须要修证的内容之一。小乘法通达，大乘般若法也通达了，才能进入初地，入如来家，成为地上菩萨。那就是说，大根基众生，前世已经断我见证悟很多次了，可以直接修学大乘佛法，悟得甚深的唯识之理，同时也就能通达小乘解脱道法义，不用特意修学小乘法就能达到小乘的无学。</p><p>但是这样的根基是极少见的，一般众生还是应该首先修学小乘解脱道法义，把小乘解脱道的基础打牢固，断我见之后，再求大乘法上的明心见性。小乘断我见以后，修到慧解脱的四果阿罗汉，彻彻底底的证得人无我时，才能通达小乘解脱之理。断我见以后，要想断烦恼，必须降伏五盖，修出初禅定，才能渐渐断除贪嗔痴慢烦恼，成为心解脱慧解脱的阿罗汉。而降伏五盖，不是一件容易的事情，好多人一辈子都降伏不了，即使断我见和明心见性，也没有降伏得了五盖，一旦降伏了五盖，就有能力入初禅定，断除烦恼，也有能力入如来家，这是修行佛法所要走的修行路线。</p><p>十一、明理才能放下</p><p>无色界天人没有色身，常在定中，不出定，他们的识心活动非常微弱，没有思惟思考力，更没有参究佛法的识心活动，心理也没有情绪，没有想象幻想，没有回忆，没有打算，没有烦恼，没有痛苦，没有欢乐，总之，这些心理活动全部都免了。这样的话，他们要想断我见，要想明心，真的是没有门路。有的人就学色界天人和无色界天人的定功，总想入定，学来学去，也只是在无明中流转，不会断除愚痴性，三恶道业仍然免不了。我们有色身就为修证佛法提供了很大的方便，有色身就能有身口意行，就能修证佛法，有色身不好好利用来思惟观行佛法，参禅悟道，却成天喊着放下色身，结果命终就给自己放到三恶道去了，好个放下，真的就放到下边去了。</p><p>很多人手里捧着三藏十二部经，捧着大乘经典，却生各种邪解和误解。读经是为了解经，解经以后，才能证经。有错误知见要及时纠正，只是不要偏执自己所解一定正确才好，就怕自己智慧不足，却死认自己的理，不肯走出误区，还要带他人进入误区。可是现实中，这样的人非常多，打也打不回头，当你劝导这些人时，有的人还要回头反咬一口。从种种迹象来看，娑婆世界众生心里的无明，实在是深重又深重，很多人只能等他的无明减轻一些以后，才能度化。</p><p>十二、修行是生处转熟，熟处转生的过程。我们历劫以来对于世俗法非常熟悉，念念都是世俗的五欲六尘，而对于出世间法熏习很少，很陌生。通过修行，让我们的心从世俗法中渐渐脱离开来，减少对世间法的用心，把重心慢慢转移到出世间法上来。在做世间法中不忘佛法，不脱离佛法，时刻与佛法对号入座，知因达果。使世间法与佛法融合到一起，打成一片。最后就能做到念念是佛法，念念是菩提，用觉悟的心观照一切，再融化觉悟和观照，达到无上觉，正等正觉，圆满菩提果。</p><p>十三、七觉支当中第二个就是择法觉支，修到这时就有择法眼，能知道所接触的法是否正确，所接触的法师是否有道，然后才能做出正确的抉择，不会走错路。这是证果开悟之前应该要具备的觉悟性，否则就不能证果，不能开悟，不能得道。</p><p>还没有修到有择法觉支，没有获得择法眼时，修行还不得力，福德定力智慧都欠缺，不知师有否有智慧，智慧如何，不知法对与错，正与邪，头脑混沌不开，遇正法不知学，遇邪法不知避，以至于不能获得正知见。没有择法眼的一些人，疑盖不除，疑法又疑师，对于法和师都不能确定，这样修学就不会进步和成功。疑心重不是善法，福德欠缺才如此。有能力辨别时，才能除疑，道业才能增进。</p><p>十四、真正通达唯识以后，才能达到弥勒菩萨那种程度，这可不是一朝一夕的事，最基本的也得证得第八识，再以后还要配合禅定的修证，还要断除烦恼，断除烦恼习气，慢慢的一切法就能都证得了，无明就能破尽。瑜伽师地论里的所有法，都是要求实证的，基础的法没有证得，上一层次的法，就不能证得，再上一层次的法，更不能证得。</p><p>所以学唯识，一定要发大心要明心见性，踏踏实实地走菩萨路，内门和外门的菩萨六度，都要修行圆满；要发愿做一个真正能够利益众生的大心菩萨，在佛力的加持下，才能修完唯识学，到达妙觉菩萨的果位，只等成佛。学佛不是只学理论，其中还要学佛的清净大愿，学佛对众生的慈悲喜舍的心量，学佛的戒定慧，学佛的甚深禅定，把佛所具备的一切功德都学来，都做到，我们自己才能成佛佛。</p><p>十五、世尊在世时为弟子传授佛法，都是把目前应该修学的法，讲出来以后就不管了，剩下的事，由弟子独立去完成。那时弟子们都是听完世尊讲法以后，自己找个安静无人打扰处，在定中观行思维。世尊从来没有带领弟子具体修行过，没有带领打过佛七，也没有打过禅七，什么七也没有打过，都是弟子自己思惟观行佛法，独自修行，没有共修过。</p><p>修学佛法，要想受益最大，就得要自己多思惟多观行，尽量不要别人把法讲得太细，如果自己观行的少，受益就小。每个人付出多大的代价，就会得到多大的利益。多观行，多思惟，不要怕出错，错了再回过头来，往其它方向努力，各个方面都观行到了，智慧也就生出来了。观行出智慧，观行是自己的事，最好不让他人代替。要有大志气，不要现成的东西，自己要多花费精力和心血，多思惟，自修自得，他修他得，不修不得。修行实证以后，才能获得大智慧，得到真正解脱的功德受用。</p><p>十六、生活工作修行等等的压力就是心的感受。心每天每时每刻都在感受着，感受苦感受乐感受不苦不乐。压力是一种逼迫感，是一种苦受。所有的受都是根尘接触而产生的，六根触六尘就会有受。佛在杂阿含经中说，要去贪爱，减少受觉，或灭掉受觉，就要减少触或灭掉触。我们不能灭掉触，尽量减少触，最好的办法是观行六尘的虚妄和无常性。</p><p>六尘分外六尘和内六尘，外六尘我们根本接触不到，触到的都是内六尘，它们是外六尘的影子，是自己的如来藏所变现的假象，并不真实。既然是假象，不是实相，我们就要反过来调整自己的心，让我们的心减少对六尘境界的执著性攀缘性，这样把境界看淡了，心里的苦受就减少了，压力就减轻了。</p><p>只有修心，增长智慧，认清境界，没有别的办法。我们娑婆世界就是堪忍世界，处处是苦受，处处是压力，只能不断地调整自己的心，说服自己，认清境界，减少攀缘，这是真修行。外面的境界我们没有能力改变，通过修行改变我们自己的心，从而改变自己的内六尘，让境界能够随我们的心而转，这是地上菩萨的境界。最起码也不能让我们的心总是随着境界而转。修行是我们生生世世的事情，不修行生生世世有苦受，每生每世，我们只抓住了业，什么也没有抓住，结果都是一场梦一场空。善于让压力变成动力，努力修行，好好游戏。</p><p>十七、内心总是有所求而无法清净时，要把追求世俗法的心转向求佛法，不求或者少求世俗法，心就会清净无杂念了，不求五阴在世间的享乐，心就能清净下来，心地染污就能减少。多学习我们的自性清净心，祂在一切法上都是无所求的利益五阴众生，造作无数有为法，心地却无为无漏，我们就应该多多的依止于祂的清净性，心地就能逐渐清净了。</p><p>我们即使有所求时，在世俗法上不能过分，够用就好，贪求越多，越得不到佛法上的利益。即使修出很大的福报，也不要求人天福报，但求早日能得道，道业不断增进，多度有缘。少求世俗法，佛法上的追求却一定要有，而且还要发清净大愿，靠愿力来牵引我们更快的进步。贪求世法会堕落，贪求佛法即为善，这叫作努力精进。菩萨六度当中有一个精进度，精进度不具足，就不能得道。</p><p>十八、我们出生以后，父母教给我们做人的道理，不仅一生受用不尽，后世多生都受用不尽，仅仅教给我们做饭这个本事，作为种子存留，再做人时，一看就会做，而且做得很好，多生多世受用不尽。父母教育我们好好学习，我们下一世就会主动爱好学习，不用督促。那么我们修学佛法，每学一点佛法，都会作为种子存留下来。</p><p>别小看这点种子，未来世它会长成参天大树，星星之火可以燎原。所以我们就不能贪着世俗法，不管怎样，这些世俗法都会灭去的，带不到未来世。过去无量世，我们所追求的世俗法都把我们放弃了，不是我们主动放弃它们，而是实在带不走了。今世也如此，到临终时这些人事物不得不别离，有个不得不的心，就要受生死轮回苦。不如把精力转到修道中来，世俗法过得去就好。不舍世俗的利益，佛法中的殊胜利益就不会得到，我们应该善于思惟抉择，做一个智者。</p><p>十九、我们学佛修行要踏踏实实的从脚下一步步起修，不要用高喊口号模式的，成天把口号挂在口边。那些口号多是十地菩萨圣贤人所修证的内容，如果没有修到相应的位阶，无论怎样喊口号，仍然无法从脚下挪动半步。比如如梦观，是十回向位菩萨所证得的，我们现在无论怎样高喊一切法如梦，如何理解一切法都如梦，内心都做不到看待世俗界一切都如梦幻，等到真正证得一切法如梦观的时候，已经是十回向位的菩萨，快入初地了。</p><p>对于如梦观的理解，如果没有修到十回向位，无论理解到什么程度，终究也是个理解，不是证得。这种理解也叫作慧，如果都追求和满足于这种智慧，那成佛简直太容易了，只要把成佛之前的各种观行理论都拿出来，顺次的学习理解，生起各种理解的智慧，那是不是说我们就有了十地等觉菩萨和佛的智慧了？</p><p>说食不能饱，真正想修行不应该采取空喊口号似的修行方式。语言说得很高大上，实际自己内心很渺劣。何不针对自己内心的实际情况，采取相应的切实可行的修行方法去修行，不要喊那些短时期内甚至长时期内都做不到的口号。佛法是用来实际观行和对治调伏自心的，不是用来玩弄口舌的，不能逞一时的口舌，而不注重实际而真正的修行。</p><p>比如说如来藏的那种无住，让我们七识心也要像如来藏那样对一切法无所住，这简直是太高远了。八地菩萨才能相应一部分，也不能完全相应，初地以上的菩萨才能相应一些，更不能完全相应。地前菩萨和悟前菩萨只能理解，让心不住法很难很难。说归说，做归做，实际没有修行到那个层次，说与做无论如何都不能统一起来，不能一致。因为没有证得，就不能做得到，理解之后能说，证得之后才能做，那时说与做才能统一协调。所以我们如果遇到一些人说一套做一套，那我们就应该知道，他们没有实际证得，不是证悟此法者。</p><p>再比如明心以后最浅的如幻观，如果没有很深的连续的禅定，不能有一丝丝的幻化观感，离开禅定这种感观不可能出现，定浅都不行，何况没有禅定。很多人成天口头挂着一切法如梦如幻，其实根本做不到如幻，理解的如幻毕竟不能真正起作用，事情临头的时候，内心觉受就一点也不如幻，更不会如梦了。我们都应该踏踏实实修行，不要玩口头禅。那些口头禅，作为一个自己修行的座右铭当然很好，作为一个追求的目标当然很好，但是还要一步一个脚印的起修，老老实实修福德和禅定，老老实实完成三十七道品，不要指望能越过三十七道品不修，就能完成大乘的各种观行，这是天方夜谭。</p><p>没有戒和定的慧，都是理解的慧。理解的慧，就像一个凡夫通过学习和情思意解，能讲出十地菩萨等觉菩萨甚至成佛的法，实际上他并没有走过任何一段路，却能告诉你各段路的大略走法，细讲是绝对讲不出来的，除非胡说。那么他人依着他所讲的成佛之路，是否能走得很快，或者是能走否得通，都是一个问题。</p><p>而一个真正走过那段路的人，只要一指路，他人顺指而行，就能快速达到目的地，不走弯路，不用绕行，没有曲折，直线到达。</p><p>二十、正常情况下，修行是要次第修，一个阶段一个修行内容，修行层次不同，修行的内容也不同。凡夫有凡夫的修行方法，贤人有贤人的修行方法，圣人有圣人的修行方法。一个凡夫绝对不能使用圣人的修行方法，差距太大了，根本使不上力。</p><p>凡夫只能观行五蕴的生灭变异无常，观行四圣谛苦集灭道，或者参禅以求明心。凡夫不能观行八地菩萨所证得的境界，比如无所住无所着，比如空却一切法，比如不取相分别，比如任运自然等等。</p><p>凡夫和悟后的贤人，正处于有心和着相修善法阶段，虽然贤人已经初步破了一些相，但层次太浅。这时候就不着在相上，不在相上认知一切法，不仅做不到，还会狂妄自大，拨无因果。比如凡夫看到肉，应该想这是众生肉，出于慈悲心，不应该食众生肉，这是正确的修行方式。这时候不应该把肉看空看成无相，看成真如，然后想吃了也等没吃，于是大口吃起来，同时觉得自己入到真如境界里了，其实是入到贪欲境界里去了，这是错误的修行方法。</p><p>比如说凡夫见到男相女相，不应该说我把男女相空掉，都看成真如一相，于是心里觉得自己好像已经没有了男女相，就无所顾忌的交往，结果定力严重不足，双双走出了轨道。这种修行方法，也可以这叫作恶取空，罪过很大。一个异性如果对自己有特殊要求，而自己却要不执相，不着相，把对方看作空，看作真如的化身，于是就随缘。结果菩萨戒的十重戒犯了，那么地狱肯定是挂号的了。所谓的随缘，你一定要具备随缘的本事，内心证得了空，能真真正正的做到心空、不起心、不着相，没有初禅的定力和初地以上菩萨的智慧，任何人也只是想一想，说一说而已，根本做不到，还是要老老实实的持戒修行，不能跨越修行的界限和次第。</p><p>一个凡夫想要忏悔自己过去造作的罪业，应该取相忏悔自己的恶心恶行，以期改变恶的心行。可是却行大乘无相忏悔，强行自己认为一切烦恼都是菩提，都是真如相，又不能证得无相，这样认为以后，就觉得心安了。但是心安归心安，罪业仍然存在没有消除，果报不饶人。这样搞，就是恶取空，果报丝毫不爽。</p><p>我们学佛修行是有次第有章法的，不可胡来。菩萨能做的事情，凡夫不一定能做，对于异性随缘度化不是凡夫的能力所及，那是有甚深禅定的地上菩萨所为，凡夫也为，必去三恶道。</p><p>现在的佛法简直乱透了，多数人意识心都很聪明，地上菩萨以及佛陀的修行境界也能了解一些，于是就把地上菩萨应该修行的法，挂在口头上，认为自己也能做到，这可能吗？你又不是善财童子，没有善财童子的善根福德，又不肯踏踏实实修定观行。</p><p>我们修行应该改一改口头禅习惯，佛法要实修，然后才能实证，实修实证不是口号式的，要有实修的切实可行的具体方法，如果没有，那就不是实修，也不能实证。我们即使能讲出佛所说的话，也没有什么用，只是喊口号而已，脚下要一步步迈步才能有所希望。</p></div>"
},{
    "title": "第十二章 修行篇(2)",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  修行篇(2)</strong></p><p>二十一、菩萨道修行之路漫长，何必在意一时眼前的快慢，目标的达成在三个无量劫，只要在三个无量劫之时最快速完成佛道，就是优胜者。就像万米长跑，谁个智者在意一百米之内在前在后，根据体能设立长远规划安排，保证优先到达终点才是根本，其它都不重要。</p><p>人无远虑必有近忧，目标越长远，智慧越广大，胸襟越广博，气量越宏伟，志气越高远，脚力越有劲，信心越十足。不要在意一时的快慢和输赢胜负。</p><p>如今末法时代，没有那么多菩萨种性之人，没有那么多好道器，所以绝对不能搞快速证果和明心的速成班。这两年我看到一些现象，有些警醒了，速成班害人不浅，出来的都是伪劣产品，危害佛教正常有序的发展。</p><p>很多人找不到真正修证的入手处，这是正常现象，说明其修证的因缘还不成熟。在他们东碰西撞当中，逐渐成熟自己，逐渐增长其善根福德，以及禅定智慧，完善菩萨条件，培养菩萨心性和德行，最起码要有做人的德行修养，有人的人格，否则如何当菩萨带领众生？把众生都带到泥潭当中，都不觉知，近朱者赤近墨者黑，众生不知不觉都被熏染了恶习，却以为是菩萨行，这后果也很可怕。</p><p>我观察到一些求悟者，人品极其恶劣，根本不会做人，也不想做好人，如果这些人都知道了修证的入手处，都知道最后一个结果，都成为所谓有名无实的菩萨，那么今后的佛教该发展成什么样子？想想真可怕。</p><p>越想快速明心开悟证果的人，越不应该悟，因为有这样急迫的心，都有不纯的目的性，菩萨心性还不足，无所求的心性还没有培养出来。这样的人一旦悟后，会更加的有所求，名闻利养心就控制不住了。所以修行方面的事，应该水到渠成，自然而然。因缘成熟的人，控制都控制不住，一定会自然而悟，自然就是菩萨。</p><p>快速证果和明心，福德累积的不足，业障还没有消除，烦恼还没有降伏，一旦接近证果和明心，业障就会出来遮障，烦恼就会现前阻碍，障碍重重，极容易退失菩提和道心，后续修行无力。所以有些因缘不成熟，绝对不能下手去引导，绝对不能摘取生瓜蛋，以免害人害己害佛教。</p><p>佛教如果搞速成班，只能办心性速成班和道心速成班、人性速成班、禅定速成班，绝对不能搞证果速成班和明心速成班。如果心性不能速成、人性不能速成、道心不能速成、禅定不能速成，证果和明心岂能速成？</p><p>那么多人跟我诉苦说，修行没有下手处，不知如何参禅和明心，不知如何观行证果，现在想来，那就对了，不知是正常的，没有入手处是正常的。千辛万苦的磨练一段时间，因缘成熟，就会什么都知道都懂得了。</p><p>    二十二、主人在房间里观赏鲜花，然后自言自语说：红色的花儿很漂亮。这时身边的鹦鹉听见了，就跟着说：红色的花儿很漂亮。鹦鹉所说是如实语吗？是现量观察吗？证得了花儿的红色和漂亮性了吗？都没有，鹦鹉只是学舌，对这句话的内涵一无所知，甚至可能不知道自己说的是什么。所以不见得是能讲出点什么，就是有修行有实证了。</p><p>佛经上说，十信位的众生学佛就有几大劫了，遇见佛也有好多尊了，一个无量数劫的学佛修行也就修到初地菩萨的层次。开悟明心的住位菩萨，距离初地菩萨还有三分之二的修行时劫，已经走完了成佛之道九分之一的路程，这已经是修学了很久远很久远的时劫，相当不容易了。可见学佛修行，不是很容易的事，道业每进步一个层次，需要付出的时间精力都是无法计算的。所以每个人都不能掉以轻心，认为自己理解理解就成就了一个什么果位，没有这样简单的事。如果没有走过那段路，也看不到前面的路途，凭想象当然就会觉得很简单，成佛很容易；已经成佛的人，才知道成佛这条路究竟怎么样，经历过的事讲出来才靠谱。</p><p>二十三、背课文的同时，一定要理解课文的内涵，知其然，也要知其所以然。学佛的过程是：先读课文，再背课文，接着要理解课文，然后关键点要证得课文所说内涵，再然后依照所知所证去实行。这样，所有的课文都是自己的，不是学来的，从今以后就可以到处广说课文，都是在说自己心里的课文。</p><p>二十四、学佛如果总背书和盲信，道业如何能有进步？智慧如何能增长？好不容易得个人身，遇到了大乘了义法，如果不好好利用自己的头脑，深细思惟，求得实证，就白得一回人身，白白遇到正真的佛法，几十年过去，自己仍然一无所是，岂不可惜？应该尽量把自己不正确不如理的学佛方式，改变过来，不要数宝，要往自己口袋里装宝，替别人数没有用，到头来自己仍然是一场空。一定要修定，在定中观行佛法，离开定理解都不能到位，更何况能证得。只有证得的智慧，才是究竟的智慧，属于自己的智慧，理解的不可靠，何况还理解不到位。</p><p>三藏十二部经背得再熟，意根没有熏成功，在中阴身里这些知识也起不了什么作用。理论知识毕竟是知识，自己没有证得，没有掌握在自己手里，根本不起作用。所以我跟大家总是强调定力和观行，这比知识重要得太多了。而且果位上的事，也与理论知识无关，不管你能背诵出多少佛法，没有证得，就是零果位。证得佛法的人，尽管没有那么多的理论知识，可是实际证量就决定其果位高低。</p><p>二十五、现代人都吃不了苦，于是就找借口说，苦行不是道。苦行虽然不是道，可修道离不开苦行，这代表着一个人有能力摆脱种种贪欲，无贪欲之心之行，心清净修道很快。读释迦佛的本生修行事迹，就可以知道，释迦佛无量世都是苦修行，甚至为了求得半句偈子，而舍身喂罗刹。诸佛菩萨在因地修行当中，都以苦行为主，都不受用贪欲。到如今世间，修行之风逆转，变为苦行不是道，都想要一边享受贪欲，一边追求圣人的名誉和果位。鱼与熊掌能兼得乎？</p><p>有的人因为贪欲重，无法舍离，还要遮掩这种心理，于是就找借口说菩萨是有大福德之人，应该向众生显示自己的福德，才能摄受众生。所以这些人就时时处处讲究享受，好像已经成就了的样子。若如此，释迦佛当年是无福之人，出家之后没办法享受福德？十方诸佛菩萨修行时莫非都是无福之人，在修行时都无法享福，才会那么样的珍惜福德？西天二十八祖东土六祖，过去时代所有禅师大德都是无福之人，都无法享受福德？</p><p> 二十六、有人说吃肉与否，不必执着这件事，就是不执相，摄心为戒才是根本。可是事实和结果、因果不依你任何人执着与不执着，它必然是要出现的，一厢情愿是解决不了什么问题的。</p><p>有摄心的本事才能真正持戒，没有摄心的本事，就不能持戒。什么人能摄心，修到什么程度才能真正摄心，这才是关键，不是自己认为摄心就摄心了，不是自己认为不执相就是不执相了，认为那个东西太不准了，没有什么道理。能够做到不执相，必须证得相应的真理，还要有深禅定，才能不执，才能破相摄心。除此都是口头禅罢了。</p><p>要搞清楚，修到什么程度才能摄心，扪心自问，自己能摄心吗？如果能，那么任何问题都能解决，吃不吃饭也无所谓了。如果说执着吃肉不吃肉的事情是执相，那就是说不执着吃肉不吃肉，就是心已经不执相了。既然已经不执相了，那吃什么应该都可以，不再计较了，只吃白米饭就可以了，或者配一盘咸菜也行，吃没有肉的生菜也行，吃什么都行。不执着吃什么的人，应该是剩饭剩菜什么都可以吃，只要吃饱肚子，能用功办道就可以，其它的都不在乎。真正不执着应该是这样，而不是所说的不必躲避吃肉这件事。</p><p>二十七、真正的修行就是修心，修心就应该在自己的心地上下功夫，就是要空去各种我的心念，排空心中的我，越空越好，把我排得越净越好，直至心中无我。而不是向外用功去修他人，让他人他法随顺于自己的我性。修行的目的，就是要达到各种层次上的无我，越无我越好，越无我越成就，越无我越解脱，越无我越自在，越无我越近于佛，最后彻底无我就成佛。然后把心里装上众生的利益，装上佛教的利益，就是不要自我的利益。最后就会发现自己还是得到了所有的利益，得到了解脱的大利益。这种利益是用无我之心、无我之行换来的，而不是用各种小我行事得到的。</p><p>那么每天从早上睁开眼睛开始，直到晚上心念止息为止，时时刻刻反观自己的内心，反观各种思想念头，如果发现了自己的心念都是我，有我的各种利益，那么就思惟有我的不利因素，就要呵责自己，劝说自己，摆平自己，不让心中的我泛滥而去侵犯他人他法，去顺我排他。</p><p>让心像婴儿一般的单纯、纯洁、洁净、清新、不刚不硬，不染一丝尘埃，这样身心得到滋养，纯净至柔，如来藏就给我们脱胎换骨，一个圣人无我的坯子就成型了，圣人就诞生了，从而圣心成就，圣身自在。这样才能成为欲界之尊，色界之尊，无色界之尊，成为三界之尊，最极殊胜果报不求而得，得也不着不住。</p><p>把众生看成与己一体，生出无我大悲之心，去用无我的心拯救所有世界的苦难众生。我们的未来，只有这一件事可做，没有世俗事，没有世俗利益之争，没有各种权势和名誉地位之争，全部是佛事菩萨事，全部是无我利他之事。既然如此，我们最好就从现在做起，不要等到成为圣贤才开始作，等是等不来圣贤之果的。</p><p>二十八、学佛人的精进应该不输于外道</p><p>佛世时有一个外道叫作长爪梵志，他为了与自己的外甥舍利弗辩论，立志学习外道几大部典籍，发誓不学通达就不剪指甲，人称为长爪梵志。一个外道为了世间无意义的辩论，都能如此用功，无剪爪的时间，长年不剪指甲，我们学佛人都是如何用功的？每天泡泡茶，聊聊天，逛逛街，收拾收拾卫生，吃吃饭，亲人团聚团聚，再养生练练瑜伽气功，道友之间侃侃大山，吹吹牛，再睡足觉，一天下来，有多少时间用在修道上？</p><p>世界上有多少学佛人有外道们修行精进？恐怕很少很少，有多少学佛人如外道一样看破了世间，放下了世俗去修道？恐怕很少很少。三人之中必有我师，我们真应该向外道多学习，学习他们的长处和优点，以及那种放下的精神和精进用功的精神，看淡世俗的精神。如果学佛人能有这种精神，加上法义正确，想不得道都很难。</p><p>那么用功的外道遇到佛就得度，戒行清净，禅定具足，智慧也好，遇到适当的佛法，凝神一思，就证果。那是真正的证，不是解。我们现在的学佛人能行吗？戒无法守持，禅定修不出来，在大乘法群里熏染多长时间，也沾不上证悟的边，顶多解一解罢了。内道与外道的差距有多大？有一些人还看不起外道，那样的外道，我如果能遇到教起来多么轻松，绝不会累心，顶多他们不能发大心而已。学佛人发的大心，也是进进退退，都不保靠。</p><p>二十九、忘失菩提心，修诸善法，即为魔业，如何理解？</p><p>菩提心有两种，一种是先天性的不生不灭的菩提心，能够作为一切众生一切善法的所依止处，这是指自性本心、既有为又无为的第八识；另一种是后天修诸善法所生起来的想要自度度他的菩提心，是七识心依止菩提自性所发出来的，是生灭性的，从有为渐趋于无为。</p><p>众生在最初发起菩提心时往往都是单纯的纯真的，可是在长久的修道过程中，有可能会忘记了自己最初的发心，虽然也在修诸善法，其目的就不纯正了，夹杂了一些私念和私欲，违背了自性菩提和最初的发心。这些私念和私欲表现为目的指向于个人的利益，而不是无私的为了佛教为了众生，自己的私利高于了整体佛教和众生的利益。</p><p>那么以这样的私心而修行的度众生的善法，就含有了魔的性质，因为魔王和魔民都是有强烈贪欲的，他们不见得不做善事，可是做善事的目的不纯，利益在于个人，所以结果往往不善，善的表面隐藏着恶的实质。所以凡是以利益个人和小团体为目的善业都是魔业。</p><p>三十、菩萨永远离不开众生，只要发心立志成佛不入无余涅槃，都会生生世世与众生在一起。菩萨分为不同的层次，首先没有断我见的菩萨，即使想离开众生，也不可能，由于三缚结的绑缚，三恶道不免，与三恶道众生就不能分离，再回到人中天上，与人天众生不可分离。断我见和三缚结之后至地前的菩萨，无论到哪里都与众生在一起，离不开众生。地后菩萨由于发过十无尽愿，受愿力的牵制，不可能入无余涅槃，那就必须还要与众生在一起。</p><p>关键是各个层次的菩萨要与什么样的众生在一起才好，这个问题一定要把握好。如果菩萨发愿，要发什么样的愿才适合自己，要考虑清楚，免得未来后悔。</p><p>每个菩萨的第一任务首要任务，就是必须要断除三缚结，而且是要真正断除，不留余结。然后才能谈得上去度众生，相对而随缘的挑选与自己相应的众生。</p><p>发愿在娑婆世界度众生，在地球度众生，不离地球不离娑婆世界，可是自己的三缚结没有断除命终却随着结缚去了三恶道。明明是发愿度众生，可是自己都没有度得了，还需要其他菩萨来度，何谈度众生？</p><p>无论是学佛，还是行善，还是发愿等等，做一切事都需要相当的智慧，不能凭一腔热血，一冲动想做什么就做什么，不考虑后果是不行的。</p><p>三十一、菩萨的十无尽愿</p><p>诸佛降世普度众生，示现八相成道，内容要牢记：从兜率天宫降生、入胎、住胎、出生、出家、成道、转法论、涅槃。所以佛一定是出家人，属于僧数，不是在家人。佛在华严经中教导菩萨发十无尽愿，其中一个愿，是菩萨一定要有广大的神通，这是必修的内容。没有神通，不但自己不能成就，也不能度化众生。但是神通最好要在入地以后修，开悟以后修也非常勉强，在这之前都不提倡修神通。</p><p>菩萨的心量太小，就无法发这样广大的誓愿，即使发了，也无法做得到。心量有多大，菩萨事业就有多大。我们每个众生未来世只有一件事可做，就是自度和度人，生生世世都是如此事，都是佛事，没有三界世俗方面的任何追求。那我们现在就要训练自己心尽量不着世间相，不追求世间的个人利益，不为了世间的生存利益而与人争夺，包括财色名食睡，色声香味触，包括家亲眷属，一切一切，心里能舍尽量舍，这样心就空净广大了，广大到如来藏那样程度，就达到终极。</p><p>众生界尽，我愿乃尽。众生界能否尽？什么时候尽？记得佛经里有人问佛，众生界是否能尽，众生是否能度尽，佛好像没有回答。不是佛不知道，无法回答，而是众生的数量实在是多得无边无际，不可胜数。每个菩萨的任务极其繁重，即使成佛也要永远忙碌于度众生事业。十方世界的芸芸众生无量无边，没有佛没有菩萨没有佛法的世界也简直太多了，那些世界里的众生非常苦，等着我们这些菩萨们去发心度化。</p><p>我们将来有能力度众生的时候，一切都要为众生考量，不要为个人的私利而互相争夺，菩萨们如果为了各自的眷属问题和名声地位问题而打得头破血流，那些众生怎么办？往昔所发的菩提大愿那里去了？我们现在尽量发大愿，才能免得未来世不忘失菩提心，一切为了成就自己道业，成就众生，不为世俗利益。</p><p>众生的善根福德不成熟，就不能遇见佛法。我们都应该尽量为众生多种植善根，让众生的善根早日成熟。如果众生善根不成熟，缺少福德，即使佛在面前，也没有用。如果众生界尽了，没有众生了，佛还要佛国土干什么用？佛成就无数佛国土就是为了度化众生而用的，没有众生了，佛还留形住世吗？那就不会再留形了，佛国土也没有用了。所以，看看未来的情景，我们现在还有什么好争夺的，一切法都是空的，能临时用一用就行了，没有必要去执著。</p><p>三十二、做一个合格的佛陀弟子</p><p>在学校里，一个合格的学生，一定是德智体全面发展的三好学生。在佛教里，一个佛陀的好弟子应该是戒定慧全面发展六度具足的佛弟子，是才能与心性完美结合的修行人。德才兼备的人是非常难得的人才，非常稀少，如果只有某种能力，而心性不善不调柔，这样的人是不能重用的，如果心性良善，能力不足，还可以勉强用，可以培养，如果能力和心性都不行，坚决不能用。</p><p>心性体现在无我上，没有断我见之前，有的人我性重，有的人我性轻，我性轻微的人当然比我性重的人容易断我见，容易证果。总想驾驭他人的人，就是我性重的人，不愿意被人管理的人不愿意服从领导的人，也是我性重的人，心性不调和，都是我心在作祟。我性轻微的人，比较随意，比较随和，对于一些人事抱着无所谓的态度，不太在意自己的位置和权势。一个团体出现问题最多的就是我性重的这些人，如果没有一个强有力的领导者，这个团体就会乱成一片。</p><p>一个佛教团体，一定有护法神在护持着，每个人的心性护法神都了如指掌，这个人是什么心性，有什么目的，能起到什么作用，护法神都清楚。所以一个人应该在团体里担当什么角色，护法神会管理，有的人私心重，对团体会起到破坏作用，护法神会想办法弄走和隔离。</p><p>三十三、整个世界都在不断的生灭变异着，最后都变成了空无，何况我们小小的肉身，更是不能独自存在，变异得更快，更不能久存。我们每天都那样的执著自己和周遭的一切，真的没有必要。</p><p>每个人早晚要消失灭亡，趁着有生命存在，着眼于生死大事，不要斤斤计较于不重要的小事，吃喝拉撒这些事都不重要，名闻利养这些事都不重要，生活富裕与否顺心与否都不重要。重要的是死后怎么办，来世怎么办。生命一结束，此世一切一切的遭遇，都成了过眼云烟，都没有意义了，什么激烈的纷争，人我是非也都烟消云散，无足轻重了。不如多花时间，用心在自己能带到未来世的东西上，多为自己储备后世的资粮，带不走的就不要再费心思了。</p><p>当你感到生活顺心自在，家庭和乐美满，事业有成，名声权势增长，自己因此而心满意足时，就是贪爱成功时，也是迷失时，追求的方向错了，就失去了重心。当有一天这一切都消失的时候，就会痛苦和怅然若失，就会消沉和失落。莫不如趁好年华，追求道业，不得而得一切，得一切而不得，内心解脱自在，而没有解脱感，没有自在感，这就是极乐。</p><p>三十四、世界之大，佛国土之大，宇宙之大，意识无法想象，我们充其量也就如蚂蚁般。蚂蚁的世界里有什么？蚂蚁的生活有什么可追求、可计较、可自豪的？蚂蚁国里有什么可值得争夺的？每个蚂蚁的五阴身有什么可值得执著贪恋的？</p><p>可是佛看见的蚂蚁群体，真的是太执著自己的五阴身了，七尊佛出世，蚂蚁还仍然是蚂蚁身，这正是蚂蚁愚痴性的体现，执著性的体现。我们与蚂蚁有什么区别？无量尊佛出世了，还仍然是六道众生身，还是那样的愚痴和执著，还是有那么深重的无明。还不羞愧吗？还不自责吗？还没有惭愧二种善心所法吗？</p><p>智慧高于一切，解脱比什么都重要，无论付出多少艰辛去获得都值得，否则就像蚂蚁一样的永远愚痴可怜下去，还以为自己多高大呢!</p><p>不少人学佛那么久了，还对山山水水的感兴趣，四处游玩，贪爱眼前的风景，不知珍惜宝贵的时间来修行。不知道如蚂蚁般的自己能走出多远距离，一群蚂蚁再能行走，日夜不息，也难走出一片沙漠，何况还能走出一个国土。我们即使坐飞机，也难离开地球上的领空，不如打开自心，扩大眼界，包容整个大千世界，探索无穷的宇宙奥秘，让自己无所不知，无所不能，成为一个真正的智者和如佛陀般的能者，拥有无边无际的心量和智慧德能。</p><p>学佛修行，到最后就是证得一切法都是空，连空也空。五蕴是空的，十八界是空的，我是空的，万法是空的，佛法也是空的，成佛也是空的，佛也是空的。心中空去一切法，一切相，空的观念也空去，就像观世音菩萨耳根圆通法门中所讲的那样，能空所空都要空尽，空的法也不留存，就到家了。所以从现在开始，就应该训练自己看空自己，看空与自己有关无关的一切人事物理，只是非常不容易做到。</p><p>一般众生都是顺境起贪爱，在逆境当中容易反思，逆境太多就会起嗔心，个别人会自暴自弃。正常的修行环境应该是，有时顺境有时逆境，逆境比顺境多一些，这样的好处一个是能消除业障，一个是保持心地的觉醒，不容易被顺境所迷惑，道心才能坚固，才能逐渐看空逆境和顺境，去除执著性很快速。</p><p>三十五、鲤鱼跳龙门脱胎换骨成为龙神之前，需要蓄势多久，积聚多少能量和大福德，具有多大的力度，才能猛的一跃，瞬间脱胎换骨？</p><p>很多人并没有积聚出多少力量，没有付出多少代价，急急忙忙就跳，结果跳的不是龙门，也没有成为龙族之一员，还是原来那条鲤鱼。有的甚至磕得鼻青脸肿，毁身丧形，也没有得到一片龙鳞。什么贪欲也不肯舍弃，却妄想着摇身一变成为圣人。这就是现代人最大的贪欲。</p><p>很多人不肯真正毁形出家，放不下世间贪欲，就找借口说，出家是出烦恼家，不在于穿不穿僧衣，不在于剃头不剃头，心出家是真正的出家。这个借口找的太堂而皇之了，完全遮掩了自己放不下世俗贪欲的心理，而非要有出家的身份，也真是大贪。</p><p>三十六、修行人应该习惯于反观自心</p><p>念头本身是识心的作用，是心所法，发现念头，就是识心去发现心所法，这就是反观。聪明人应该都习惯于反观，而不自觉这就是反观。习惯于反观的人都有自制力，能够自我省察，自我督导，自我管理，自我成长，一切都是自动自觉的，不用人看管和督导，这样的人适合做领导，最起码不用被人领导。</p><p>学佛修行的人，应该是有觉悟的人，更应该时时反观自己，返照内心，日日三省吾身，这样才能逐渐改过自新，降伏烦恼。如果不习惯于反观自己，就不会发现自己身口意行不如法的方面，那就不能修正自己、改变自己，也不能提升自己。这样的话，自己心里是佛念多还是杂念多，应该很清楚，反观不费力，关键在于习惯，养成良好的习惯，就会顺理成章自自然然了。</p><p>三十七、菩萨六度里，其中一度是忍辱度。修忍辱是干什么用的？有人说是用来降伏心念的，有人说是用来降伏嗔心的，有人说是用来破相的，有人说是用来积福消业调伏自我的，有人说是用来离相让心无所住的，有人说是用来恒顺众生的，有人说是用来长养慈悲心的，有人说是用来开导引发般若智慧的，有人说用来忍他辱我，修无我行的，有人说是用来破除四相的。</p><p>这些说法都对，应该综合起来说，就全面了。</p><p>三十八、每个人修行到一个关键时刻，障缘就会出现，这正是修行得力的结果。再继续修行，障缘就会褪去。修行不得力时，一般不会出现障缘。所以遇见挫折不要怀疑自己，要勇往直前。</p><p>修行的次第是先广博，后专精。如果一味广博，只能是意识的知识累积，与解脱不相干。应该参禅实证时，就要放下所有的经书，专心参禅。这时再着重读经书，就会障道。过去禅宗祖师，看见参禅的弟子读经书，就会制止呵责。现在没有人敢说弟子什么，不敢阻止人家广学多闻，怕给师父扣帽子。有些人修到七八十岁，心还在广学多闻上，我也不敢说什么，自己生死自己说了算。现代人的最大特点是喜欢知识学问，而不喜欢解脱。</p><p>三十九、要想让思念佛法的心念成为心中的主念，那当然就要以佛法为重，不以其它的世俗人事物为要，所有心思或者是极大部分心思都放在佛法上，尽量旁无他顾。把自己放得低低的，把自我五阴身看作什么也不是，一无是处，无一技之长，处在人群中，可以让人感觉自己有点傻，别的就没有什么印象了。不要向外炫耀夸耀自己如何如何能，有文学艺术修养，会琴棋书画，能歌善舞，文笔隽永，善美工编辑，善诗词歌赋，善谋权势，善于推销策划，某某权贵，一表人才，首屈一指等等等等，把这些都甩一边去，忘记你自己是谁，整天除了佛法，就是浑浑噩噩，做个活死人，能活着就行，世间里一无所爱。这样心念就会都是佛法，主念就明确了，绝对不愁不了道。打得世俗念头死，许汝出世法身活。</p><p>一般人都做不到，佛法就是离俗背俗，有什么办法？一边享受世俗，一边还要有佛法证量，鱼与熊掌兼得，这是不可能的，先出世后才能入世。</p><p>四十、学佛修行学无相法，心要逐渐脱离有相的世俗法，心离俗离相，才能渐渐清净无为，与出世间的无为法相应。如果世俗间一个最普通的节日，也要在意和随流，心与世俗紧紧的绑在一起，不看淡一些，如何得解脱？修行人最后都要超凡脱俗，因此我们不能与世俗法太粘连，深深的陷入世俗界里不知自拔，与道背而驰，何时能走上解脱的大道？</p><p>四十一、我们在思考问题的时候，思路应该尽量打开，不要拘泥于固定的套路，反反复复思惟验证自己的观点，从正方向验证之后，再从反方向验证，任何一方面都验证无误之后，才可以勉强相信自己，但也不一定正确。因为大智慧与夙世善根相连，也就是说要成为一个与众不同的大智者，一定具有夙慧，不是某世无故突然就能出生大智慧。而有夙骨夙慧眼的人，不崇拜权威，不崇拜名声，不拘泥于印刷出来的文字，一定能跳出这些框框的圈定，脱颖而出。</p><p>不搞权威崇拜，才能把心量打开，心量打开以后，视野也会随之开阔起来，所见就广阔，不被已知的固有的理论所圈定，其思惟智慧才能独特而深利广大，这样才能触证到实相，发现本有的事实。</p><p>智慧随着心量走，心有多大，智慧就有多广大，心空如如来藏一般，智慧才能越来越接近如来藏，成佛有期。</p><p>四十二、念佛拜佛，一是修福，二是修定，身体拜佛，折倒慢心，即为有功。修定，不要数量，只要质量，质量就是心住一境，不散不乱。那就要慢慢念，心念，心听，心想，心忆。慢慢拜，身体徐徐，心念集中，或者注意身体动作，或者想佛忆佛，身心一如。气息平缓，似有似无，心念化一，念念不忘。日久自然功成，就可以有能力参究话头，参究自心如来。</p><p>每月都要检查自己的菩萨六度修行程度，布施度修了多少；贪心和吝啬心舍弃了多少；执著自己钱财物的心松动没有；为人大度一些没有；戒律修持如何，是否勉强守戒感觉戒是一种束缚，还是自觉守戒不觉是束缚，还是不用守戒，根本没有犯戒的心，后者是心已得到降伏了，不着外境，回归到内心世界了。</p><p>在忍辱度方面，对一切人事物是否能够容忍了，是否不起争执，内心淡泊，对不合己意的人、事、物，也觉得无所谓了；尤其对法，不懂的深法，是否能够接受、安忍下来，能够慢慢揣摩其内涵。</p><p>在精进方面，检查心里的世俗法，是否在逐渐减少，是否越来越希求于对佛法的向往和修持；在布施、持戒、修定、修慧方面，是否很积极、很努力。</p><p>在修定方面，检查自己的心，沉淀下来没有，攀缘、散乱减少没有；思惟一个义理,能否持续很长时间；对于所修的法，是否有决定性信心，念念不忘。</p><p>在修慧方面，检查自己对于成就佛道所应修行的内容，是否都了解了，每一步骤是否都了解；对于明心见性的内容是否了解；对于解脱之理是否明了；对于真如之理，是否了解得越来越多；如来藏的体性是否都越来越清楚等等。</p><p>四十三、修定也是我们每天必做的功课，修定能让我们身体健康，精神愉快，身心统一，意根减少攀缘，能量不外放，心思集中，定力增强，智慧就得以开发。能量外放，就像一个面积大的木板，放在地上，使劲下压，地面只能压出很浅的痕迹，如果把能量集中，就像锥子只扎一点，锥尖入地就很深。我们的心识也如此，越集中，越能思惟甚深法理，心不散乱，而且思惟程度很深很透彻，从而得出正确结论，开发出智慧的潜能。</p><p>修定包括两种，一种是静定，身口意都不动，收摄身心，闭口不语，心不乱想，气运通身，排除身障，身轻气爽，神宁心定，精力充沛，身体健壮。第二种是动中定，身心每天大部分时间都在活动运动中，应该要好好利用，不能放逸自己，心识攀缘不断，浪费宝贵时光。在活动当中，不仅要做好目前必须要做的事情，同时心念也要缘于正念，所谓正念，就是念佛、念法、念僧、念戒、念经、念咒、参究一个义理、参究一个话头、参究一个公案等等。最初从念佛开始，心念佛，心想佛，心忆佛。行走坐卧，念念与佛打成一片，定力具足，改为参究。那么，每天给自己定课，打坐修定一小时以上，坐中思惟一小时以上。其余时间，全部念佛或者念咒，改变心识，不缘外法。</p></div>"
},{
    "title": "第十三章 证果与明心篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章  证果与明心篇</strong></p><p><span>一、实，在在处处，满目青山无荒草。一茎叶一根草一缕丝，是实无虚，却无踪迹。众里寻他千百度，蓦然回首，灯火阑珊，在在处处，何处不是？从前心盲眼更盲，如今满眼是金光。这是悟道者的感慨。</span></p><p>证果和明心的条件具足，遇到因缘，不管是什么因缘，都能证果和明心。如果遇见佛讲法更能证果和明心见性了，佛的威德和加持力是非常大的，佛讲法的法会磁场效应也是相当大的。况且佛世的修行人普遍都有甚深禅定，心地都很清净，都有出离心，烦恼都轻微，善根福德都深厚，所以一闻法，就能随着佛的音声观行思惟，立即就能证果和明心。</p><p>我们末法时期的众生跟佛世的众生根基没法比，善根轻鲜福又薄，内心浮躁，大都没有禅定，佛法再细，也不能入心，所以都无法真正的实证什么果位，最多理解理解，就很不错了。正因为众生普遍都没有禅定，无法具足禅定，所以就出现一种说法，不用修定直接就可以观行佛法，可是没有禅定如何有观行能力？能观行出什么？能观行多长时间？能观行到什么程度？每个人自己可以试验一下，有禅定之前的观行，与有禅定之后的观行，其效果差别有多大，可以说差别太大了，本质上就不是一回事。</p><p>一个法义，有禅定时思惟和没有禅定时思惟，就是天差和地别。所以很多人思惟佛法，根本不能真正理解，错会误会太多，根本不能理解真实义，要想实际证得和现量观行，那真是太难太难。即使这样，很多人还非常相信自己的理解力，动不动援引一段经文，以证明自己的观点。其实经文的意思和自己的观点并不一致，自己错会很多，也不自知。</p><p>不少研究经典的人，根本不能如实理解透彻经典的真正义理，还觉得自己很能。其实佛法根本不是搞研究能研究得出来的，必须在甚深禅定中如理思惟观行参究，才能真正理解真正实证，研究不能实证。</p><p>一些人往往是看佛经里记载，众生在听佛讲法的当下就证果和明心了，那些人也没有修禅定，直接就证果了，好像是只要能闻法，稍微一思惟就能证果，不用特意修定。这个误会相当大，不知道那些闻法当下证果的人，都已经具足了禅定，善根福德都深厚，只差因缘了，遇见佛讲法这样最殊胜的因缘，当然会非常容易的证果和明心见性了。</p><p>这些人只能看见证果人的最后结果，看不到证果的人已经走过了多长的修行路程，听佛讲法之前是如何用功的，如何发心和行持的，如何努力修禅定的，这些必要条件都不看，专门截取最后证果这一段，这是最严重的断章取义。</p><p>现代人浮躁得都想走捷径，越简单越直接越好，佛所走过的路都不想走，以为自己的办法比佛还实用，还直接，不用那么辛苦。难道说一个凡夫比佛高明，比佛还有智慧吗？佛的修行都是绕弯子，自己走的路最直接，不用打基础，不用付出任何代价，不用辛苦修定降伏自心，研究研究就能取得很大成果吗？研究出的果都是纸糊的，风一吹就散坏了，遇火就化了。如今世间假果太多，盖的都是萝卜印章，抵不住风吹草动，死后果报自知。</p><p>众生因为无明与业力的不同，就会招感不同的果报，就有不同的色身正报和生存环境的依报。业报结束以后，再进入另一个业报之中。由于业报不同，色身不同，大脑组织结构不同，显现出来的智慧不同，行为表现就不同。</p><p>二、悟前最好多消业，悟了以后不至于被业力压垮和转掉，白白悟一回。开悟时福德不足，一旦悟时，业障很快就出现，各种魔障干扰都会出现。定力再不足的，就会被拉下水，退回去，以至于道心退失。即使不退道，色身以及各方面的变故都很大，需要承受的压力可不小。</p><p>开悟要稳稳当当的水到渠成最好，各方面条件都不具足，福德欠缺，着急悟，即使能非常勉强的悟了，魔障纷至沓来，一般人很难承受得了。最可怕的是在强大的压力下退道，再回来就不知道什么时候了。平时应该多修福，多消业，多忏悔，少享福。到关键时刻有福德支撑着，愿力大的有愿力支撑着，有佛菩萨和护法神护持着，才能度过难关。</p><p>三、断我见是第六住位，明心是第七住位，不断我见，就不能明心。不断我见而明心，两个我现前，慢心深重，就要大闹特闹了。</p><p>如果不证得五蕴我的虚妄，怎么能与无我相应？不用证就觉得相应，那就是意识的自认为，没有根据，属于情思意解。意识的错觉，正是我性的表现，不了解自己和实情，就会给自己戴高帽子，很多人都是这样，什么法也没有证得，却认为自己心空了，没有四相了，如梦如幻了，要涅槃了，有相戒不用修了，开始修心地戒了等等，很快就高大起来了。这是对佛法修证的极大误会。</p><p>四、要想法身活，就要消灭五阴为我的邪念，不立五阴我，法身就容易被发现了。但是在寻觅法身的过程中有参究的念头，压伏住了世俗法的贪嗔痴念头，这样努力用功，有朝一日就能见到法身。</p><p>但是没有经过参究过程的悟，究竟算不算悟道，究竟结果如何，佛也说了不算，由因果和阎王说了算。死神最能说明问题，权利最大。如果非常希望自己是证果明心的人，非常希望自己是圣人，而不顾事实真相，这还是很严重的我，我一定是如何如何的，这就是我。如果真断我见无我了，真明心证得五蕴空了，应该充分展现自己解脱的心，自己是什么果位有什么果位都不重要，都没关系，无我了果也无，有我才有果。</p><p>有人会说，断我见和明心都是初果，初果没有断烦恼，烦恼与凡夫一样，是没有解脱功德的。那断我见与不断我见有什么区别？证初果没有一点点解脱的功德受用，明心证得如来藏没有一点点的解脱功德受用，与凡夫一样。那什么叫作果德？一切果都有德，证果以后，没有果德，那就只是一个名称，一个名相，没有任何意义。这个名称即使是佛给的，也不是本来就有的不生不灭的，因此也没有实质的意义。但是实证和妄语，都有各自的因果。</p><p>在真正开始修道的时候就有一定的功德受用，在修三十七道品的过程中，都有不同程度的功德受用，只是那时没有解脱的功德受用，因为没有断我见就没有解脱。但是断我见明心以后，就有不同程度的解脱功德，初果有初果的解脱德，二果有二果的解脱德，三果有三果的解脱德，四果有四果的解脱德。虽然断烦恼是三果以后的事，但是初果人的烦恼与凡夫是有很大区别的，学佛人在修道过程中与没有开始修道的人，其烦恼也有一定的区别。否则学佛修行有什么用？</p><p>那么多人都喜欢果，为什么喜欢果而不注重事实？因为有一个严重的我和我执在作祟。即使佛特意给一个果，而自己的德与这个果并不相应，事实上并没有真正证果，那么自己还非常在意和执著这个果，也是我见和我执，仍然是一个我。这样得个假果，心里还很欢喜，到处宣传，到处耀武扬威，说明我性还是很重，不出生死，这叫作自欺欺人。</p><p>真正修行人，应该不理会什么果的，应该注重内心是否有所改变，是否是真解脱了，修行是否有了功德受用。如果真有了功德受用，即使佛不给证书，所有人都不承认自己得果，实际上你自己还是有果有解脱证量，能得解脱的。反之，如果自己没有功德受用，没有真正的解脱证量，即使佛给发个证书，所有人都恭敬你是大德罗汉菩萨，但实际上自己仍然是凡夫，仍然处于生死业障之中。</p><p>每个人学佛修行求的都是真正的解脱，真正的道业，而不是虚荣，虚荣的东西不可靠，带来的仍然是虚荣，犹如肥皂泡。我们不要看着肥皂泡很美丽，不要喜欢泡影，要求实际，要得真实。说归说，实际做起来很难，只有在证果浪潮过去之后，佛教界才能开始务实，现在属于猛烈的追求果和荣耀时期，真正修行人难遇。繁华褪尽，真实才能显露出来。</p><p>五、二乘行者分为已见道和未见道的行者。已见道的行者因为证得了五阴十八界生灭变异没有真实性，没有我的主宰性，证得无我三昧，破除了四相，没有我相、人相、众生相和寿者相，获得了法眼净，因此心中对四相有空的感觉不真实的感觉，在人我四相上有为法越来越少。由于有道共戒的原因，内心自然贪欲减轻，人我是非减轻，能降伏烦恼。修出初禅定以后，烦恼断除，贪欲和嗔恚烦恼灭尽，这时与异性接触，没有爱欲心，内心是自在无碍的。但是由于有出家的戒律，要为众生示现做榜样，也为了不让众生误会，三四果人在言行举止上都遵守戒律，符合规范，内心却是无拘束的。</p><p>出家人是众生的依止，在外表上要讲究威仪，众生见了才能对三宝心生恭敬，才能种下善根。佛世时世尊创立僧团，一是为了众生离俗得解脱，二是做众生的依止，引导众生离俗归依三宝，种下解脱的种子。每个出家人不管是否见道，都以身作则，模范遵守戒律，言行规范，具诸威仪。他们托钵乞食时，接触的众生多，更应该具诸威仪，免得被众生耻笑，造下恶业得恶果报。所以他们乞食时，走在路上，低头眼视前路，不左右顾盼，也不斜视，不会抬头直视面前众人，遇见斋主，当然也不会去分辨是男是女，是美是丑，接过钵饭转身就走，没有客套话。因为行者们一心想解脱生死，所以心不在六尘境界上，也不在世俗上，这样才能证道，才能保证不被世俗五欲六尘所羁绊。</p><p>声闻人在三果以后，烦恼是断除而不是伏除，因为是断除，才能不被五欲六尘所牵绊，而能脱离三界，得解脱。伏除烦恼是压伏烦恼，是在二果之前，尤其是在见道之前降伏烦恼，三果才能断除烦恼，伏除不能脱离烦恼，不能得解脱。</p><p>而大乘菩萨的修行，也离不开声闻行者所行，离开小乘的修行，不名菩萨，只能是凡夫。菩萨最开始在个人修道过程中，也都像声闻人一样，遵守戒律，具诸威仪，为众生做表率。由于遵守戒律，才能获得禅定，从而见道。菩萨也要从小乘断我见开始起修，不证果就不能大乘见道。小乘的戒定慧和见道得法眼净，大乘菩萨们都不能越过，否则既没有大乘菩萨，也没有小乘行者。</p><p>菩萨们在小乘见道证初果以后，还要继续加修初禅定，以断除五下分结，三缚结加贪欲和嗔恚烦恼。然后才有资格在大乘法中过禅宗三关，以及阳炎关和如梦观，进而有资格入初地。入初地以后，刻意不断尽烦恼，不取阿罗汉那种正性离生，也就是不取证四果阿罗汉的果位，保留极微小的烦恼不断，才能不入无余涅槃中，入无余涅槃就断了佛种。</p><p>菩萨再怎样急着开悟，也不能越过小乘各个关口。如果故意想越过去，那么这个人就不是一个真正修行人，更谈不上大乘菩萨了。一个具足四相和烦恼的菩萨即非菩萨，与凡夫等同。如果菩萨有着急开悟的心行，这个心就是有所求的心，不是无为心。有私人目的的心，一定有四相，有烦恼，那就是凡夫心。与凡夫心相应，就不能成为真正的菩萨。真正的菩萨一定是破相的菩萨，没有我相、人相、众生相和寿者相，也没有证果相和开悟相。有这些相者，即为凡夫。</p><p>六、断我见在先明心其后</p><p>一切法的修证，最初都是从降伏身见，断除身见开始。在众生无始劫以来最初接触佛法时，都是从认识五阴的色阴开始，不知道修了多少劫，善根福德深厚了，才接触到大乘菩萨法，逐渐认识到自身当中有个真心如来藏是自己的本心。但这时仍然没有降伏身见和我见，何况断除。</p><p>断除我见既然在明心之前，那就是菩萨的七住位之前，断除我见假我倒下之后，真心才能被发现，这时明心就是住位的第七住果位。所以一定是断我见在先，证得真心在后。即使大乘菩萨参禅，在参究的过程中，也都是要逐渐的降伏身见和我见，再断除身见和我见。没有明心之后身见我见还仍然存在的道理，如果有这样的现象存在，说明此人并没有明心，没有经过真正的参禅阶段，也没有深入的参究，他的果位来得有些蹊跷，或者说来路不明。</p><p>七、在哪里造业，就要在哪里真诚忏悔，发誓不再犯，在多少人面前造业，就在多少人面前真诚忏悔。如果恶业的影响非常大，学法已经到了相当程度，可以采取实相忏悔。实相忏悔分为两种，一个是按照小乘的无生理忏悔，定中观察五阴的不真实性，五阴所造作的身口意业行的不真实性，证得初果或者是初果向，得到法眼净就能忏悔清净。</p><p>另一个是按照大乘法的如来藏无生理忏悔，观行刚才的身口意行是如何出现的，最后证得自己的身口意行都是如来藏一点点出生的，没有身口意行的真实性，五阴是虚妄的，依五阴而有的身口意行也就是虚妄的，业就消了。当然必须具足未到地定，才有希望实证如来藏，之后才能观察出身口意究竟是如何由如来藏出生的。一旦证得佛法，三恶道业皆消除，包括无始劫以来的三恶道罪业。但是这非常不容易，需要相当好的善根、福德、禅定、智慧，以及因缘。</p><p>八、缺少定力和福德，即使勉强明心了，以后的进步都会很慢，定不足而明心了，觉明时间非常短，后续的禅定就不容易生起，贪嗔痴烦恼不能减轻；因为定力不足，观行的智慧也不容易生起，很多法就观行不到。证果和明心，一定要在极好的定力下去获得，然后禅定就能迅速地生起来，借此机会，不久就能修到初禅，过了这个时候，初禅定就不容易生起，二果三果不容易获得，禅宗二三关就不容易过去，那么今世想进入初地，就没有指望了。</p><p>九、禅宗三关，是智慧增进的关口。第一关证如来藏，第二关见如来藏性也就是佛性，在六尘上都能见到如来藏所起的作用。第三关是牢关，过了这一关，生死大事就能解决，有能力入涅槃。禅宗的参禅了毕，再往下就要学方广唯识了。</p><p>禅宗证悟时就相当于小乘的初果，第三关就相当于小乘的三四果，取大乘果同时就有小乘果，而证小乘果，不一定有大乘果，说明大乘包含小乘。罗汉见空是见人我的空，知道五阴十八界是空，不是我，还没有证得如来藏。菩萨见空，是证得如来藏是真实的，是空性心，同时知道如来藏所产生的五阴十八界法是空，二者都证空，内容不完全一样。</p><p>十、烦恼垢及染污垢，在断我见或者明心见性以后才能修断，在这之前都是压伏烦恼，表面上虽然不现起，其实烦恼还在隐藏着。在断我见或明心见性之后，知道五阴确实不是真实的我，内心的我就松动了，禅定才能现起并且渐渐深入。修出初禅定以后，贪嗔痴烦恼才能一个一个的断除，意根对于自我的执著才能一点点的灭除，心地的烦恼污垢去除以后，心就变得清静了。</p><p>断了我见以后，知道五阴十八界法全部是虚妄的，以后再参禅证真心时，就不再把虚妄法当作真实的，最重要的是不再把意识心的各种细相当作第八识来悟，不会错悟。找到第八识时，就能观察祂是不是生灭的，是不是属于十八界里的法，有没有变异性，有没有无常性，发现祂确实是真实永远不变的，与七个识的体性大不相同；而且还能观察到第八识是如何产生五阴，如何与五阴七识配合产生万法，这样就可以确认这个心就是第八识真心，这才是真正的明心证悟。</p><p>在断我见的当下，是不是一下子就能断除烦恼呢？这不一定，要看断我见之前烦恼降伏的程度禅定的修行程度。如果烦恼还是很重，总是要现行出来，定力又不是很好，烦恼的断除就需一定的时日，因此断除烦恼的时间长短因人而异，不能一概而论。世尊在世时，有人在听世尊讲法之前就已经修到很高的禅定，烦恼已经得到有效的降伏，他们在听法后心中确认五阴非我的当下，所有的烦恼一时全部脱落，当下成为阿罗汉。如果我们修行没有禅定的功夫，即使断了我见成为初果人，断烦恼也需要很长时间，也许一辈子也不能断烦恼，仍然只是个贪嗔痴烦恼具足的初果人。</p><p>十一、真要证得如来藏也是不容易的，因为我们历劫以来，都执着五阴十八界的假相不放，执著七识的功能作用为我，为真实，那就遮蔽了自己的自性，让我们不识真法，只认假相。如果我们能先断我见，再参禅寻觅如来藏，就能比较容易一些。那就要修小乘法《阿含经》，断我见，成为初果、二果以后，把五阴十八界的假相一一排除，然后在这些假相里寻找真相。</p><p>在五阴生灭的虚妄法里，要寻找那颗不生不灭的明珠，断我见以后才能容易找到。因为把假相都排除掉，就能显出真相。在没断我见之前，就容易把五阴这些妄相当作明珠，如果把五阴当作明珠，那个真正的自性如来藏这颗明珠，就不容易找得到，真假混在一起不好辨别。等我们把五阴十八界都排除掉以后，就容易找到自性清净心，很快就进入佛门里了。</p><p>十二、佛的摄受力类似于催眠</p><p>勇施犯重悟无生事，是讲勇施菩萨出家受具足戒以后，犯了杀戒和淫戒两个重戒，命终应该堕入地狱受苦。由于他害怕自己的果报，就去找文殊菩萨救度，文殊菩萨领他去见佛，佛就给勇施菩萨分析，是否有勇施比丘这个人，是否有勇施比丘所杀的这个人，是否有杀人这件事，勇施菩萨当下思惟之后，就明心开悟悟无生，成为真正的菩萨，不仅仅是断我见证初果。勇施菩萨遇见佛是非常幸运的，不但消了业不会下地狱，还证悟成了菩萨，三恶道业都免。</p><p>世尊为勇施菩萨讲无生理的时候，就是用的催眠法。勇施菩萨当时极度恐慌、害怕、羞愧，心乱如麻，佛却能稳定他的心绪，引导他思惟人无我，引导他思惟背后的造作者，最后勇施菩萨的意根确认无我之理，证得了造作者，既断我见又明心。遇见佛为自己催眠，那要有多大的善根和福德。我们都应该多修福，将来遇见佛，给自己催眠，就能成为地上菩萨，成为圣人。</p><p>还有大涅槃经里，世尊为阿奢世王解心结时讲的断我见部分内容，相当的好。阿奢世王杀父以后，受了现世报，内心相当惶恐不安，见佛以后，佛为他消业，就问阿奢世王，你父亲这个人是真正有的吗？你是真正有的吗？有杀父这件事吗？阿奢世王听后思惟，说没有，之后就证得了无根信，没有证初果和初果向，还是因为杀父的业障遮止的缘故。有了无根信也能消地狱业， 命终可以生极乐世界。这也是佛对众生用的催眠法，有福德之人才能遇到。所以说福德是非常非常重要的，有些人只为自己，不愿意修福，自私就是傻，自己不会得利益的。</p><p>十三、唯识的见道是在证三果四果以后</p><p>唯识见道主要是指证得一分唯识种智，小乘的修证是在三果以后，接近四果的时候，大乘的修证是在禅宗三关和如梦观以后。初地菩萨必须是小乘三果人，烦恼断除了，也许还有一点我慢和对五阴或者是三界世间的执著没有断除。</p><p>一般人学唯识法同样可以悟道，而且一旦开悟，其见地深细而究竟。从禅宗那里悟道，智慧稍微粗燥浅薄一些，因为般若智慧没有唯识智慧深细。</p><p>初地以上菩萨至七地菩萨，为了留惑润生，不可以入小乘四果阿罗汉的正位，不可以取证四果，否则必然涅槃。菩萨留一点点贪爱有利于在娑婆继续修行和弘法，其余的就没有任何必要了。</p><p>十四、任何一种理论，自己了解了之后，也理解了，懂得了，知道了，也会运用了，能对答如流了，能讲给他人听了，也能讲得明白了，心里清清楚楚了。</p><p>然，等于实证到了吗？等于是自己的理论、知见，等于是自己的见地吗？达到理论烂熟于心，并不难，对答如流，举一反三，也不难。难的是能走到求证阶段，去一步步的实证，而最难的是能顺利走过实证阶段，真正实证得到。</p><p>十五、众生要证得四果，成为俱解脱的大阿罗汉，非是一件简单的事。一般人能证得初果就已经是可喜的成就了，能免除三恶道业，永远不去三恶道。对于这样的成果，即使付出世间所有一切，都是非常非常值得的。如果用金钱交换这样的果报，无量亿也换不来，这是无价宝。对于在地狱三恶道的众生，他们即使拥有地球所有的资产，也未必能换得来一个人身。一个人无始劫以来的执著，用一生的时间灭去，相当于坐飞机一样，坐飞机也没有这样快。</p><p>断除世间贪执的三四果人学佛之前，在世间里生活往往看不惯世间里的一切，有时感觉很苦恼，自己的行为举止又处处与普通众生不同，好像异类分子一样，往往不理解为什么是这样。学佛以后才能明白，原来自己是与众不同的。如果一个人时时处处的身口意行与其他人没有什么区别，众生贪嗔痴，自己也同样的贪嗔痴，众生的烦恼有多重，自己的烦恼也有多重，那么这个人今世证得初果也难，四果就别想了。</p><p>十六、涅槃有四种：第一种是自性清净心涅槃，菩萨明心时证得。这个涅槃是自性本心的不生不灭性、清净性、寂静性。</p><p>第二种涅槃是有余依涅槃，三四果人证得的，就是说罗汉有色身存在时，还有余苦可依，色身还会有一些苦受，比如病苦、天热之苦、蚊虫叮咬之苦等等，菩萨阿罗汉也能证得这种涅槃。</p><p>第三种涅槃是无余依涅槃，四果罗汉证得，命终时灭掉自己五阴，入涅槃，灰身泯智，再也没有任何苦受，苦就没有可以依赖的五阴身了。菩萨阿罗汉也会证得这种涅槃，但不会入涅槃中，不会永远灭度自己。</p><p>第四种涅槃是无住处涅槃，是佛所证得的。佛不住涅槃，也不住生死，是大解脱，究竟的解脱，有解脱色，因为慈悯于众生，要化现无数色身度脱众生，永远不舍弃众生。</p></div>"
},{
    "title": "第十四章 佛法杂谈篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章  佛法杂谈篇</strong></p><p>一、我们的眼界有限，看不见地球，虽然看不见地球，也知我们自己脚踩在地球上，生活在地球上，靠地球的承载和养育。这种知是现量的直接认知还是理上的认知呢？肯定是理上的认知，因为明这个理，就能判断出我们就是在地球上。佛所讲的许多道理也是，当下很难证得，但靠累世的善根，修到有择法眼时，通过如理的思惟判断，就能知道佛法是正确的，依之能得解脱，能成就佛道。</p><p>比如罗汉们还没有入涅槃，但通过学法思惟，能够了知断我执、断尽三界的贪爱，就能得解脱，心里也肯定这种方法能够解脱入涅槃，虽然还没有入，不必等入涅槃时才知道这种修行方法能入涅槃。这就是从佛所讲的理上来思惟判断，得出一个正确的结论。很多事情不必我们亲身经历才知道有和无，对和错，以智慧性的认知，就会明了许多道理。没有智慧即使亲身经历也不知其然。奉劝诸道友，自己不知的事理，不要轻易说：不是、不对、没有、错误。要时刻掂量自己智慧达到什么程度，能不能做正确思惟推理判断，你所得出的结论不一定正确，尤其是对佛所说的法，判断错误，就是诽谤，诽谤了佛与法，后果很严重。</p><p>二、讲法不仅要对众生根基，还应该要超越于众生根基，引领和提升众生的根基。因为众生根基千差万别，不能只讲低浅层次的法，深法以及更深的法都应该讲出来。讲出来也不一定是为现前的众生而讲，也要为后世的众生，为大根器者而讲。根器不足者，听过就算，不理解就存疑，但不要轻易下定论。</p><p>我讲法首先要作铺垫，三六九等众生都要照顾到，今世后世也要照顾到，更主要考虑整个佛教的发展，因此不能完全照顾到每个众生的具体情况，当然会有一些人甚至很多人不相应，这是正常现象，即使佛在世时讲法也不是每个法都适应所有众生的根基。一切事佛自有安排，释迦佛对娑婆世界的佛法有总体和整体的安排，在背后督导着，我们不知，但只要安住着就好，暂时吸取与自己相应的法，深法暂时搁置不理。</p><p>世尊在娑婆世界刚成道时，为大心菩萨众生讲华严经，无量诸天大众及人中弟子，尤其是声闻弟子，如聋如哑，世尊都知，但是世尊也要讲华严经，把娑婆世界整个的佛法铺垫好，把成佛之路讲清楚，弟子们才清楚整个佛法修行的次第，以做到心中有数。讲完华严经，世尊才开始教导弟子最粗浅的佛法，领大众修行四阿含经，从断我见证初果开始。</p><p>三、自己没有刻度或者尺子太短是否能测量他人他物</p><p>在世间法里要作一个裁判，必须对于所裁判的内容通达了知，就是要懂行，比如评判一个大学教授教学的水平程度，必须要自己的学识程度高于或者至少要相等于那个大学教授，评价一个大学生的论文水平，必须是大学教师。在佛法的修证上，要判断一个人有没有悟，是否见性，自己首先应该是明心见性之人。走过了那段路，熟悉了那段路，才能知道别人走的路是否正确，也能知道别人走到什么位置了。</p><p>对于佛法的判断，最低要求是要有择法眼，最好是对于主要佛法没有太多的疑惑了，再最好是证得了那个法，才能作出比较准确的判断，修到这种程度的人是很少的。判断他人是否证果，首先自己得证果，证初果才能断疑，不疑自己证没证果，不疑师证没证果，不疑法能不能让众生断我见和我执，否则就判断不了他人，自己还没有刻度的时候，是无法测量他物的。</p><p>四、修到什么时候才能做到不分别</p><p>众生七个识的存在，就是起分别作用的，如果要不分别，把识心灭掉的时候就不能分别了；入定以后分别的就轻微，只要是有个知性，有个知的对象和结果，分别就完成了。一般人所说的不分别，是对好坏善恶，你我他她，都不做分别对待，一视同仁；而一视同仁也是分别，否则就不能一视同仁，心里觉得大家平等，才能一视同仁，有觉有视，正是分别，一视同仁是分别的结果，也是过程。</p><p>佛的平等性智，就是对一切众生平等对待，不分善恶，只要因缘成熟，就要去教导和度化。佛陀不会说，我只度善人，不度恶人，不会只怜悯好人，不怜悯恶人。但也许要相反，佛陀可能更要去怜悯恶人，因为怕他们受更多的苦受，所以更用心思度化恶人，观察他们被度化的因缘何时成熟，这是佛陀的大悲心平等性智使然。佛陀不像我们，只关心同情怜悯好人善人，憎恶恶人坏人，佛陀没有这个分别心，佛陀对众生都是一视同仁的；而且往往只看众生的佛性，因为众生的佛性平等，所以佛陀看众生就一律平等看待。</p><p>五、佛在世时有人问佛法，佛为什么不回答</p><p>有些问题，众生的智慧不够时，世尊无论怎样说，众生也理解不了，世尊就不会宣说出来，说了也无意义，反而增加众生的迷茫，于是世尊就不宣说。比如有外道问世尊问题，世尊观他的根基不能理解这个问题的答案，就说你这个问是无记，于是就不予回答。还有的弟子问世间最初的兴起，第一尊佛如何修成的，最后一尊佛没有众生可度，怎么成佛等等，这些问题世尊都不予作答。</p><p>佛法浩瀚无边，世尊在娑婆世界只讲了一点点，其它的都不适合于此世界众生修学，众生接受的能力实在是有限，理解不了的就会谤。所以无量无数的佛法，不是世尊不愿意讲，是在于众生自己的业障太重，福德太薄，智慧太浅。我们应该好好忏悔自己的业障，暂时理解不了的道理不要做评论，下断言，以免造作诽谤的业行，未来世有恶果报。</p><p>六、甘露倒入有毒的杯子中，立刻变成毒药，器不清净的缘故。佛法甘露入众生心中， 众生却生出邪解，智不清净的缘故。邪见的种子在众生八识田中，遇缘即生出邪解，甘露法相被众生的识心扭曲，变出的内相分就不是甘露了，识心触被扭曲的内相分，就生出邪见，邪见种子再种到八识田中，将来开出的还是邪见花，结出邪见果。可不哀哉！剔除意根的染污性，是学佛人的当务之急。这就需要意识心常常正确的思惟正确的法理，常常熏染意根，有一天转变了意根的邪见以后，修行就能走上正路了。</p><p>七、心随境转，外面的境界能够影响到内心，生起波澜，一个原因是定力不够，一个原因是智慧不足，不能正确如理的认知分析面对的境界。人最喜欢的就是随顺自己的心，不管这个心是善还是恶，顺我就高兴，违我就觉苦。因为一个人太注重内心感受了，往往对人事物的判断不正确。同样一个人有时觉得很好，有时就觉得很坏，这是完全从自心感受出发，不是从客观公正的角度出发。这就说明了我们的心识的虚妄性，境界的虚妄性，它们总是处于不断变化的状态，不是永恒不变的。那就是不真实法，不可靠法，我们不能完全依赖这些东西，否则当这些东西灭去时，就要感到无所适从了。</p><p>八、四大不调都有什么样的症状</p><p>四大不调，百病皆生，所有的色身疾病都是四大不调引起的。四大不调的原因一个是业障使然，一个是后天的环境造成的。四大不调和，就是四大种子的成分改变了，身体就要随之发生变化，就要出现各种疾病。单一大不调，就能引起与之相应的疾病，比如水大不调，身体当中的水不是多就是少，而水的成分无论是多了还是少了，都会引起疾病，如浮肿、皮肤干燥、肾病、湿疹、皮炎、血液粘稠、心脑血管病等等这些与水有关的疾病。</p><p>风大不调，能引起与风有关的疾病，如呼吸系统的疾病、风疹、风湿等等。火大不调，能引起与火有关的疾病，如身体的冷热病，寒凉病，高烧、低烧等等。地大不调，能引起与地的坚硬和支撑性有关的疾病，如缺钙、四肢无力、体弱、身弯驼背，浑身疼痛等等。一大不调，百病丛生，何况四大都不调，更是病障重重。总起来说，都是众生无始劫造业所感召的果报，极少数情况是偶尔外界环境改变身体暂时不适应引起的，多数都是业障病。</p><p>无论是业障病，还是偶尔的环境不适引发，其改变，都是如来藏所为，四大种子从如来藏中输送出来，其中的比例成分改变，物质色身就要发生相应的变化。四大种子成分的改变，由如来藏作主决定。如来藏依什么作主决定改变四大种子的输出呢？一个是依业种，如来藏能了别业种，祂的运行必须依业种而行。另一个是依色身所触环境，因为如来藏能了别身根和器世间的环境，如来藏依之，就要不断的随顺环境和身根而改变四大种子的结构。这样身体就不断的处于各种变化中。每个众生的色身都是如此的刹那刹那发生着变化，没有不变化的，都是自己的如来藏所为。</p><p>九、执著佛法到底好不好</p><p>关于执著，对于自我五阴的执著，四果罗汉以前都有；对于佛法的执著，没有修到大乘无学位的菩萨都有，灭了法执就成佛，八地菩萨修行达到无心无为，在佛法修证上还有很多法要修行，也没有断尽法执。</p><p>佛法是灵丹妙药，是众生脱离苦海的指路明灯，是摩尼珠，是大宝聚，是生死海中的航船，是救命稻草，凡是好言都可以用在佛法上。各个佛经里已经说得很多很好很清楚了，也有极多的譬喻，佛法就是渡河的船，到岸才能弃船，众生在生死海中漂泊，如果不紧紧抓着船，掉到海中就会被淹死。没有得道的凡夫众生更应该抓着佛法，救自己的性命，以期离苦得乐。</p><p>凡夫人极大多数是不执著佛法的，执著佛法的人很少，太少了，如果能执著佛法，就不会再执著自我执著世俗法，造成生死轮回不断。执著佛法是好事，都学通达了，贯通了，再把法执断尽，就能登上彼岸。如果还是生死凡夫，就不执著佛法，那肯定是要执著世俗法的，在佛法的修行上就懈怠，一个身体懈怠心也懈怠的人，肯定是不执著佛法的，修与不修无所谓，修什么也无所谓，怎样修也无所谓，毫无疑问是这样。</p><p>最初学佛修行，能执著佛法还是有很多益处的，贪佛法是善贪，能有所受益，能把对自我对世俗的执著转移到佛法中来，把贪五阴自我贪世俗五欲六尘转过来，执著佛法贪佛法，心地就能得解脱，等到佛法通达了贯通了，再一步步去掉对佛法的贪和执著，然后才能成就佛道。</p><p>十、世界在虚空中建立，虚空在如来藏中，如片云点泰清里。娑婆与极乐世界最近，还相隔十万个佛国土，大千沙界该有多么广大。征服自心，就征服了宇宙，征服了十方世界，征服了一真法界。把心掏出来，把里面的法，都弄明白，无量世界就属于你。实际上征服世界就是征服自心，心外本无法。</p><p>我们每天还执著小小的世俗法，为一点小事而起心动念，就显得太渺小了。站在宇宙虚空当中观察，世间什么事能算事？什么时候把自己的心量扩大到与如来藏一样，什么时候就拥有十方世界海。佛说：“譬如澄清百千大海弃之。唯认一浮沤体。目为全潮。穷尽瀛渤。汝等即是迷中倍人。”听到佛说的这句话，我们真应该赶快醒醒，不要再迷执了。</p><p>十一、小乘修行还是以佛讲的阿含经尤其是杂阿含经为准，其他人的论著里都有或多或少的不正确处，其细节与佛说不一致。即使是四果阿罗汉所讲的论著也与佛说的有出入，不可全部都信受。</p><p>小乘那些论著里的错处和争论，比古代唯识的争论还多。那么简单的法，也要争来争去的，意见不一，可见佛法的修行并不容易。由于小乘解脱道的修行层次比较低，著书写论的人才多，内容也比较杂乱，各说各词的也不少。这都是娑婆世界众生的业所感召的，其它世界里就没有这样的情况。</p><p>佛经中说，初果以后，修出初禅定，才能依次断除贪嗔痴等烦恼，之后才能成为慧解脱的阿罗汉。可是那些小乘论著里说慧解脱的阿罗汉不必有初禅，也不必有未到地定。一点禅定不用修，就能断除烦恼，成为四果，这是天方夜谭。</p><p>我们今世如果不精进修行，打好基础，不有所成就的话，后世的佛法演变得更乱，简直无法分辨孰是孰非，很容易就掉进魔王设置的坑里出不来。魔王的招数非常多，防不胜防。所以我们还是发愿皈依三宝，依靠佛力救护，走上解脱正路。这个世间处处是魔障，福德稍微差一点，就被障住，自己不知，知也无力解脱。多修福德，增强定力，降伏业障，是最关键。到时候，业障现前，有能力冲破出去。</p><p>十二、中国的汉字含义，我们要多加以思惟分析研究，才能明白其中的真实义。对文字没有障碍的人，才能容易正确理解佛法，才能有智慧不断的生起。有文字障的人，看一段文字，不能真正理解其实质意义，往往要错解，智慧无法提高。众生之间的交往当中，如果对语言文字有障碍，造成互相不能理解沟通，那么交往起来就苦恼和无奈。善解人意的人，都是少于语言文字的障碍，善于看透他人的心理，容易与人沟通，与人交往就少于障碍。</p><p>每个人对文字的理解程度差异很大，有些人为什么对文字理解的程度很低呢？心粗不细致，缺少定力，没有智慧，福德欠缺，这是最主要的问题所在。文字里明明没有那个意思，可是有些人理解起来就有那个意思，不肯回头反思自己，不肯回光返照，很多人只照别人，不照自己，那就是我重的表现。然后就认为自己理解的正确，毫不犹豫的就去否定他人，与他人辩论。这种冲动性正是缺少禅定的表现，没有智慧，不能反观自己，不能正确的评判自己和他人的结果。一个聪明人，是心非常细致的人，既能如实的观察他人，也能真实的反观自己，没有观察力和反观力，说明定力差，智慧不足。</p><p>十三、在阿含经中的起世因缘经里说，一大劫有四个中劫，一个中劫有二十个小劫，一个小劫是1680万年。地球成住坏空一个周期就是80×1680万年，这是极乐世界的一天， 极乐世界的一大劫等于其它世界的一天；其它世界的一天又等于另一个世界的一天，如此不断，各个佛国土的时间都不相同。</p><p>显无边净土功德经中说，十方世界诸佛国土，娑婆世界的劫最短，在此国土修行是最快速的，娑婆世界成住坏空一个周期，就是一大劫，在极乐世界才一天。一天时间和一劫时间相比，后者所修的内容极多，道业的进步与在其它世界相比非常快速。在各个世界修行都有利有弊，苦的世界劫短，修的快；在乐的世界非常享受，但是劫长，修行相对慢一些。</p><p>十四、每个学佛修行人都会经历各种磨难，这是必然的。与无始劫以来的业力抗衡，相当不容易，即使菩萨再来也是如此，逆缘太多。修行如逆水行舟，需要有在大风大浪中搏击的勇气和顽强的毅力，要有菩萨的大愿，才能不被风浪打压下去。</p><p>道高一尺魔高一丈，只要有向上之心，必受磨难，凡修行上有明显的进功，业障必现前。自己的道心和勇猛精进心是不可思议的，佛力同样是不可思议的。只要发长远精进心，必有佛力护佑，魔障对我们没办法，相信这点，就能克服万难。人无远虑必有近忧，我们只要把眼光放长远，着眼于未来，脚下的路就容易迈出，眼前的难关就容易克服。</p><p>十五、真正的正信，要有现量观察智慧，否则信难免流于偏信和盲信。即使是佛经，真正有智慧的人也应该存疑，并且想办法实际证验，何况非佛所说？</p><p>网络上有不少人，说六祖是佛再来，所说法有佛的证量，六祖已经修成了佛。我真不知道这些人根据什么如此定论六祖。认定一个人是大学教授级别，应该比这个大学教授水平还要高才行，最起码也要水平相当，才能给与对方认证。如今末法众生好像都已经修成佛了，然后以佛的智慧认证六祖已经成佛，具备佛的智慧证量。六祖坛经一本薄薄的册子，估计这些人没有一个能看懂的，否则谁也不敢下此定论。</p><p>十六、众生的业还需要众生自己了，主要是了心，心了业才能了。了心，仅仅靠佛力加持还不行，必须自己主动配合，改变自心，破除无明，这样才能了业。如果你有杀人的业，佛菩萨替你了了，你还有杀心，将来还要造恶业，那能了什么业呢？ 贫穷的业，谁能替你了，福德是个人修的，别人不能替修；禅定是自己修的，别人不能替修；戒律是自己守的，别人不能替你守戒；明心是自己明的，别人不能替你明心见性；佛是自己修成的，别人不能代替你成佛。</p><p>十七、什么人才能随缘</p><p>凡夫如果随缘，每天每年每生每世，都是什么缘分多，随缘能随到哪里去？随缘不变，不变随缘，只有第八识能完全做得到。地前菩萨都做不到，不可能不变。地后菩萨八地菩萨之前也不能完全做得到。只要六七识心还受熏染，就不可能不变而随缘。佛不管随任何缘，心都不改变，因为六七识不受熏染了 。</p><p>外道的禅定是那样的好，八万大劫入定，烦恼都降伏下来了，可是因为没有断除烦恼，后世出生在欲界，还是随缘造作贪嗔痴烦恼业，又流转于恶业苦恼之中。阿罗汉就是害怕被三界世俗的缘熏染，而躲避开三界，入无余涅槃了。凡夫的心，只要随缘了，一定会变，非常不可靠。谁如果把一切希望都依止在凡夫身上，必后悔。</p><p>十八、诸佛的解脱身</p><p>阿罗汉得解脱，出离三界以后，五阴身灭去不再出现了，虽解脱而无身。佛虽然已得究竟的大解脱，却仍然保有色身五蕴，以此利乐无量众生，所以佛的五蕴身叫作解脱色。佛证得的是无住处涅槃，永远都不会灰身泯智，不会舍弃众生不顾而自得其乐。佛在无量世界随缘普度，心中一法也不住，在这个世界里的缘尽了，就在其他的佛国土又现一个色身，再广利众生，所以叫作无住处涅槃。</p><p>佛不管在哪个世界都要现出应化色身，那个色身是为了利他而现，叫作他受用身，佛的五蕴身已得大解脱大自在，没有任何执著和束缚，因此也叫作解脱身。众生成佛以后都有无量的分身和化身，能随意建立无量的诸佛国土，释迦佛的分身佛就有无量无边之多，名字也都不相同。佛的报身只有一个，应身佛化身佛则有无量无边之多。应身佛必须降临人间八相成道，母胎出生，示现与世间人一样；化身佛则不拘于形式，随意化现，不用八相成道，也可以示现如同凡人。据佛经中记载，释迦佛有一百个分身，在一百个佛国土作应身佛，阿弥陀佛就是其中的一尊佛，实际可能还不止这么多，释迦佛的化身有无数之多，散布在十方世界广度无量众生。</p><p>十九、诸佛都入涅槃以后还有世界吗？没有世界了，什么都没有，连空也没有。世界因人而有，因人的业而有，因人的缘而有，因人的愿力而有；如果没有人了，就没有业，没有缘，没有愿力，世界如何能单独存在呢？众生五阴十八界，没有五阴就不会有十八界了。没有世界的时候，空空寂寂，连空空寂寂也没有，因为空代表世间，寂代表状态，没有世界了，就没有空间和状态。</p><p>众生成佛以后，又没有众生可度，诸佛在国土世界干什么呢？无事可做，无心可用，只有入定，长期入定还不如入涅槃，结果都是一样的，没有区别。阿罗汉们就不搞什么世俗事业了，佛还能干什么呢？成天入定中，入定有什么用呢？诸佛无论干什么都没有用，不干什么更没有什么用，入定和涅槃没有区别。众生在一起还能互相斗一斗，成佛后心里绝对的太平了，无事可做。</p><p>成佛以后，只有度众生一件事可做，如果没有众生可度，什么事也没有了，成佛以后什么都是多余的。那我们现在做那么多事干什么？同样是无聊，现在聚在一起，互相争斗还有什么意思，有什么可争可斗的？什么都没有用。我们应该从现在开始约束自己，恶法尽量一个都不做，可以做善法，到最后做善法都是多余的，善法也不做。这样心才能越来越无为，成佛才快。</p><p>二十、为什么佛那么慈悲，在天上却能悠哉悠哉的看着娑婆世界众生在遭受各种苦恼，佛能看得下去吗？</p><p>我在我母亲去世的时候，正好过阳炎关，之前好多年就做好了准备，要如何面对母亲的去世。心里就总是想着母亲是由什么组成的，真的有母亲这个人吗？在办理母亲丧事的过程中，就观察每个人的六七识心，观察所有人的心理状态，于是就证得了阳炎观，一切人在我心里是那样的空幻，我就像一个行尸走肉一样应对着一切，虽然心里还是很难过。</p><p>那么以佛的无量智慧观看众生，众生都是什么呢？宇宙世界，人事物理，都是什么呢？众生的色身是四大微粒，识心是识种子，佛看众生，没有众生，以及其事其理。这是其一，其二，众生自有其受苦的业缘和业力，因缘不到，救也没用，只能看着众生漂流在生死海中，头出头没，因缘成熟时，才能出手相救。</p><p>二十一、众生能否度尽</p><p>一个如来藏对应一个众生，出生一个众生，所以如来藏也叫作众生界。心经中说如来藏不生不灭，众生界不增不减。不增不减就是不变异，不生不灭就是永远不用生不能灭，所以如来藏的数量永远是固定的不变的，而且是无穷无尽之多。因为众生太多，如来藏太多，无法数得清楚，所以才说是无量数。</p><p>这么多数量的如来藏对应这么多的众生，众生是否能被度尽？只要众生界不再增加，佛菩萨越来越多，众生早晚都被度尽，再多也有度尽那一天，只是时间不定，无限长远，不可说不可说的无限长。众生都成佛时，没有可度的众生，诸佛住世也就没有什么必要，没有什么意义了，应该都会涅槃去了。诸佛们没有必要无事找事，十方世界也没有存在的必要。最后成佛的那些众生，修行非常省力，一尊佛护持着一个众生，修行就像做火箭似的。最后一批众生再也没有机会造恶业，无明业种消除非常快，不用度众生就能成佛，因为没有无明时就成佛了。</p><p>二十二、所谓的度众生，不是说非要把烦恼业障深重的众生一次性的度成为圣人，才是度众生。而是把众生的修为相应的提高到一定程度，与从前相比有个大幅度提高就行了，不可能一下子成为圣人。拔苗助长的结果，就是把众生度死，度到三恶道里，佛教被毁灭。成为圣人的因缘不成熟时，只能长期熏习，直到接近于圣人的品格，才能度其超越凡夫，急功近利的度人，只能把人头度下来，心仍然是凡夫，头手分家。</p><p>二十三、菩萨性是如何出现的</p><p>在众生只有七八识没有五蕴身的时候，哪个众生有菩萨性？如果没有菩萨性就不能成佛，十方世界那些佛和菩萨都是从哪里来的？意根无始劫以前没有先天性的菩萨性，但有了五蕴身以后经过后天环境的熏染，看到自己和众生的苦，就会生起菩萨性，最终就能成佛。能发起菩萨性这个行为最为宝贵，能看到众生苦，生起怜悯心最为宝贵，这就是菩萨种性。</p><p>二十四、佛的悲心是否也是虚妄的</p><p>佛的悲心有两种，一种是先天就具有的大悲心，无始劫以来一直慈悲利物，更是利人；虽然此心没有主动生起慈悲的感情，也不知道众生是值得悲悯和可怜的，但是其行为却是无我随顺众生的，其结果却是饶益了众生，关爱了众生。这是佛的如来藏无垢识所具有的悲心。</p><p>佛的另一种是悲心是后天通过修行修出来的，是佛的意识心也就是妙观察智所表现出来的对众生的悲悯心，这种心能够随着佛的意识心妙观察智的出现而出现，随着妙观察智的暂灭而不现，是生灭变化的，不是永远都能存在的，既然不是长存的心，是佛的无垢识出生虚幻出来的，因而是虚妄的。</p><p>佛的两种悲心都不动转，菩萨的意识心的悲心还有动转，凡夫的意识心偶尔的悲心全部随境转，不是随时都有，也不能恒常存在，也不究竟，更不具智慧性。佛生悲心，不随境界流转，不认境界为真，不分对象，真正是无缘大慈，同体大悲，没有你我他它的分别对待，看众生一律平等。</p><p>众生对待人往往是不平等的，以自我为中心点，一点一点地向外扩展，越是外围的人，生起的慈悲心越少，或者根本没有慈悲心；有的人即使是自己最亲近的人，也不生起一丝慈悲心。所以众生私心比较重，我心比较重，很少考虑别人，或者根本不考虑，不能站在他人的立场来考虑问题，与佛的无缘大慈相去甚远。</p><p>二十五、关于即身成佛的问题，无论是即身成佛，还是即生成佛，都是最后身菩萨妙觉菩萨的事，凡夫无分。即身成佛，是像弥勒菩萨那样的妙觉菩萨才能即身成佛，但是也得选择时节因缘，除此再也没有即身成佛的了。</p><p>众生修行都是有次第的，不可能跳跃很高的层次，从凡夫一跃而为佛，除非是已成佛者表法示现；但是也不会在有佛住世之佛国土示现，一国土无二佛故。凡夫众生应该先修阿含解脱之理，证解脱果，然后再修学大乘般若和唯识之理，循序渐进，一辈子能明心见性，已经是相当好的根基了。一般的众生断个我见，证个初果，都已经难上加难，摸不着头绪，即身成佛的事就不要想了。一般众生学个如来藏法，都学不明白，不可能一辈子把如来藏里的所有种子功能作用都证到而成为一切种智。一般的众生连个四禅八定之前的未到地定，都修不出来，何况修出四禅八定和灭尽定，获得无量的神通道力，无量无数的分身，根本是不可能的。</p><p>一般众生连度自己都很难，何况能度无量无边之多的众生，作为自己佛国土里的弟子，更是不可能。不能度众生，就不能有无量数的弟子，没有弟子，一个人不能成就一个佛国土。当国王都有辅佐的大臣和千军万马，来建设和维护国家；作佛就需要更多的大菩萨来辅助弘法度众；没有度过众生，就不会有大菩萨弟子作为左膀右臂来辅助自己弘法。所以娑婆世界的众生还是要脚踏实地的一步一个脚印的修行，不要好高骛远，而耽误自己的道业。</p><p>二十六、修行不是只活在当下，只管当下，最重要的是要考虑未来。让未来不再受轮回之苦，不再迷茫无知，不再有无明。如果只活在当下，心中没有未来，就看不清楚前方，容易走错路。而且这个当下念念生灭，说一个当下，就已经成为过去。哪里有当下呢？过去无数个当下已经消失了，这个当下正在灭亡，以后的当下还没有来。你要哪个当下呢？过去的识心已经灭了，现在的识心念念在灭，未来的识心还没有来，你要得哪个心呢？三心不可得，不可得的那是识心，是无常虚妄的心，能生灭的怎么能得到呢？怎么能抓住呢？</p><p>但有一个心，不是后得的，先天就有。即使你不要祂，祂也不离弃你，你上天随你上天，下地狱也随你去，你到哪里，祂都随从。你受苦受恶报，祂也不嫌弃，从无始劫以来，从来就没有离开过你，这个心有多么好啊！修行就是要证这个心，明了这个心，探索其中的奥秘，才能开发大智慧，有了大智慧才能成佛作祖。</p><p>二十七、所谓的世界，不过是一种感觉罢了。不同的心境，有不同的感觉，不同的人有不同的感觉。那么这些感觉都是什么东西？什么也不是，幻化罢了。那怎么办？改变不如实不如理的感觉，为如实如理的感觉，就回归真实，回归觉性，回归一真，回归涅槃，回归寂静。</p><p>二十八、对于实修的人，不需要特意讲意根，他们就能实证。对于不实修的人，一定要告诉他们解悟与证悟的区别，让大家不要满足于解，一定要实证。这是对末法时期浮躁的众生特殊待遇，众生心极其浮躁，不肯下苦功，不肯持戒，不肯修定，即使想持戒，想修定，由于环境因素，也无法做得到，因此不能观行，不能实证。只能天天看看书，意识理解理解，解到一定时候，对外就说自己证悟了。因此有必要在这特殊时期讲一些特殊的法。对特殊众生要特殊讲法，这才是对应众生的根基，解决众生实际和根本的问题。</p><p>二十九、任何人都有可能错解佛经佛意，但是只要不肯定表达自己的见解，就没有大过失了，也不一定会误导他人。学佛过程中，肯定是一错再错，任何人都难免，关键是对自己的观点抱持着什么态度，到什么程度可以自信自己的观点正确，这个一定要把握好分寸。没有错误的，只有佛一人，弥勒菩萨讲法，佛也不会百分之百肯定。</p><p>开悟的菩萨讲法也会有错，不开悟时讲法错误就会更多，一般性的错误都没关系，关键是最关键之处，不要有错误，因为关键之处涉及到随学的众生能否证悟的大问题，这是众生生命转折点，在这个转折点上，一定不要有错，只要目标方向没有问题，其余的都是小问题，可以纠正扭转。我们学佛，就是要努力勤求证悟，证悟以后，随所学法，随学随得，往往会事半功倍。</p></div>"
},{
    "title": "第十五章 善根福德篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章  善根福德篇</strong></p><p>一、所谓的福，是为他人、为团体做事，付出代价而得来的。只要向外付出，就能得到回报。既然是向外付出，利益了他人，本身就是德，佛法中常常把二者连在一起，但是世俗法和修学佛法上的福德，还是有差别的。比如雷锋修福，为众生做善事，这种福德只能在世俗法中享用。因为他没有在佛法上种善业、种因缘，与佛法还是无缘的，他在佛法上还不能得到利益，没有种子就没有收成。</p><p>而学佛的人，不仅在世俗法上种福，也在佛法上种福，皈依三宝，供养三宝，勤修戒定慧，这既是修福，也是修德。这种福德不仅能在世俗法中享用，也能在佛法上享用。福德使得我们在佛法上的修行非常迅速，道业增进很快。福德是我们成就佛道的基础，是道粮，是资粮。没有福德，学佛修行就一事无成。所以菩萨修行，要修菩萨六度，第一度就是布施修福。开悟前要布施修福，悟后也要布施修福，入初地以后，还要布施修福，道业才能不断地增进，可见福德有多么的重要了。</p><p>二、所谓布施，最主要是布施自己的悭贪心，有悭贪心，必获贫穷的果报。谁最贫穷呢？当然是饿鬼最贫穷，饿鬼肚大如鼓，而咽喉像针眼一样小，一切饮食都不能入口，只能挨饿。口渴了，看见河水，想过去喝，因为福薄的缘故，河水立刻变成火，喝不到口里，只能忍受口渴的煎熬。这样贫穷的果报，怎么能当菩萨，行菩萨道呢？</p><p>菩萨是大福德之人，生生世世在人中、天上做菩萨，果报很殊胜。在人中做人王，在天上做天王，做转轮王，做大鬼王，永远不会下三恶道，除非慈愿力，要度恶道众生。菩萨的果报，都是生生世世累劫布施的结果。那么，悭贪心就不与菩萨心相应，有悭贪心或悭贪心重的人，就不能做菩萨。无论如何参禅用功，也不能明心开悟。所以要当菩萨，首先就要行布施行，修集自己的福德，用福德资粮庄严自己。</p><p>布施行修好的菩萨，心心念念都想利益众生，替对方着想，习惯于布施。如果有哪一天，没有布施众生、利益众生，心里就不安。菩萨即使与众生还没有见面，就会想：“我能带给他什么？”这样的菩萨，就是大福德的菩萨，生生世世物质生活优越，总是做众生的首领。由此看来，修行不能小看布施，不能不做布施，布施就是最实际的修行，名为实修。行菩萨道的人每天都要检查自己是否修布施行了，这样的话，道业就会增进很快。</p><p>三、众生在佛法上只要种了一点点善根，就会作为种子，存在心中，永不消失，直至将来成就佛道。这点种子就像一颗非常大的大树种子一样，种子虽然只是一个微小的颗粒，但种下去以后，慢慢地就会长成了参天大树， 实在是不可思议。</p><p>在佛法中种善根也如是，佛在法华经中说，众生念一句南无佛，乃至一低头、一微笑、一合掌，皆共成佛道。从前有个老人要求出家，阿罗汉们不允许，说他八万大劫中没有种过善根。释迦佛知道后说：这个老人在八万大劫以前种过善根，可以出家修道。阿罗汉的神通观察不到八万大劫以前的事情，那时这个老人是个樵夫，一只老虎追他，他爬上树，就喊了一声南无佛，以此善根，八万大劫以后的今天，就可以出家修道，老人出家以后，精勤修行，不久就得证了道果。</p><p>佛在经中说过，在释迦佛的佛法中种了善根的众生，在将来弥勒佛降生时，生为人身，在弥勒佛的三转法轮中，都能得道。前提条件是得为人身,如果在三恶道，机会就不大了。所以众生不管皈依三宝与否，只要他念了佛、经、咒， 对佛点点头、笑一笑、合十作礼，都已种下善根，都与佛法结缘，将来必定得度。</p><p>但是皈依三宝以后，修行才能快速,尤其是内心中的真正皈依，不是走形式。真正的皈依，是在内心深处，把三宝当作依靠，深心依赖，信受不疑。他的信根已经建立起来了，信行圆满，就会进入住位修行。真正的皈依，也会得到三宝护法的最大加持力，道业进步会很快。</p><p>我们在同事和亲属当中，看到有缘人时要善巧方便地为他们种点善根，种下成佛的种子。如果是小孩子，可以告诉他说：你念一声佛，我就给一颗糖；或者告诉孩子说你拜一拜佛，就能得到什么样的奖赏，这样就能引导孩子们在佛法上种善根，种种子。成人可以在他们遇到挫折和病痛时，稍微讲点因果，要观察对方能接受到什么程度，不能过份，过份反而不好了。</p><p>四、永明延寿禅师曾给自己定课：日行一善。他的一善，要求的标准比较高，我们做不到。但是为了尽快地积累福德资粮，培养菩萨的精神品质，早具菩萨性，早日见道，我们可以把标准定低一些，说一句话利益了他人，让人认识到一个正理、正知见，解决他人心里的疑难、苦恼，这个善行就已经完成了。种子种到了如来藏中，遇缘就受报，不一定要来世。两个人的如来藏分别做记录，两人的意识心不一样，意根的执著不一样，所做记录也有差别。利益他人的心发出来了，本身就有福，何况亲自去做。想做真正菩萨的人每天都应该问自己：我今天利益他人了吗？</p><p>五、检查自己的福德具足不具足，要看自己的修行是不是顺利，有没有什么阻碍；修行能不能随己意愿，有充分的时间和环境条件；自己想做的事情，是否能够做主，不受限制；自己要持戒，是否就能够圆满地持戒，想要精进，是否就能精进，想修定，是否没有障缘；智慧是否在一直增长，所修的法是否得心应手；遇到的深法，能不能堪忍，是否感到意乐，愿意随顺。</p><p>如果菩萨六度的修行都是顺利无阻，那么福德基本上是够用的，可把精力转到其它不足的方面，把六度波罗蜜都具足圆满。如果对于佛，对于真正的如来藏法，对于真正的僧，信心还不具足，内心有疑，不能肯定，信位菩萨的条件还没有满足，还需要修对三宝的信心，具足信根，生起信力，然后就转入十住位修行六度波罗蜜。</p><p>六、舍利弗供养释迦佛，与释迦佛供养舍利弗，谁得的福德大？两个人同样布施一元钱给同一个人，谁得的福大？一个人供养两个人都是一元钱，供养谁得的福大？怎样衡量这些福德？一个人以不同的心境供养同一个人，什么时候得福大？</p><p>布施的时候，心越无为越无所求，得福越大。佛布施的时候，心最空，最无所求，得福最大。虽然舍利弗布施的是佛这个最殊胜的福田，但是也不如心空福大，一切圣贤皆以无为法而有差别。证得小乘法的无为，与证得大乘法的无为，其无为的层次有很大差别。同样证得大乘法，其智慧程度不同，无为的层次也不同。世间的一切差别相，就是心的差别。只要把心修好，一切都不用管，自然而得，越不想得得的越多，越想得得的就越少。</p><p>七、真正有善根的人，因为福德很大，今世有隔阴之迷，不自觉地就享受自己的福报。佛菩萨以及护法神，就会阻止他来享受自己的福报，一是怕他不入佛门修行，二是福享多了，福德受损，就没办法在佛法上有所受益，有很大程度的进步。</p><p>所以我们学佛修行，不能只图快乐，要想办法多培养自己的福德资粮，戒定慧资粮，圆满这些资粮，我们才能够得到相应的道果，得到真正的法益。否则每天都是卖弄自己的口舌，说食不饱。佛法再好也不是你的，即使本来是佛，你也只能当个凡夫，生死轮回不断。</p><p>积累福德不太容易，心里贪吝的惯性势力很大。那么平时多注意不要消耗福德，或者少消耗福德；更要注意，不要损减福德，尽量多为别人付出，不要让别人为你自己付出；多恭敬他人，不要轻视蔑视他人；为人不要处处占上风，要多说柔软语；尤其不要惹父母、师长气恼，多孝顺父母、师长，这样得福又多又快。得福最大的方面就是供佛修福，所以我们每天都应该要坚持供佛、修法、敬僧。</p><p>八、问：梁武帝修建佛寺供僧，达摩祖师说没有功德，那就是福德了，怎样才会有功德呢？</p><p>答：功德是性德，是心性方面所具备的德能，比如降伏烦恼是功德，修到心无漏是功德；获得智慧是功德，戒定慧三者都得到增进，趋向于圆满是功德，或者具足圆满，从而能够自受用，也能够让他人得到利益，这是功德。一般来说，功德是不容易退失的，也是受用不尽的，直至成佛。而福德多数是自受用，能够享尽，能够灭坏，不是究竟的，也不能保证不利用福德而造恶业行。而功德能够让心渐转清静，让福德也会增长。如果福德与功德同时获得，福德就会牢固，不断得到增长。</p><p>虽然如此，也要修福德，福德不够，功德也难出现，二者是相辅相成的。但是修出来的福德不要用在世间法的享受上，不求人天福报，以此福德全部回向成就佛道。要想多修功德，就要勤修戒定慧，熄灭贪嗔痴，广行菩萨道，受持读诵三藏十二部经典，参禅习定，止观双运，定慧等持，断除我见，期求明心证悟，地地增上进修，圆成佛果。这些都是功德，而且是大功德，直至圆满功德，成就佛果。</p><p>九、修行人每天都应该往如来藏这个银行里存款，念经念佛念咒是存款，修定是存款，忍辱是存款，思惟佛法是存款，降伏烦恼是存款，皈依持戒是存款，听经闻法是存款，布施财物是存款，利乐他人是存款，菩萨六度万行都是存款。</p><p>贪图享受是取款，吃喝玩乐是取款，世间一切所需是取款，赚钱经营是取款，为己消耗是取款，违犯戒行是取款，侵犯他人是取款，贡高我慢是取款，与人争利是取款，得他利不思回报是取款，自我夸耀是取款，喜人赞叹是取款，受人供养是取款，不孝父母师长是取款，一切恶行是取款，总之，利己自私就是取款。</p><p>多生多世所修的福德，作一世帝王将相，就全部消耗殆尽，修行所得福德，升天享福一次就消耗无有。存款时心不甘情不愿，以为钱财进了他人私囊，自己吃亏，好不容易勉强存了款，修了福，结果一世半生就耗用殆尽，又成穷光蛋，从头开始集福。真懂修行的人，多存款，少取款，钱财够用就行，不用赚太多。无论赚多少钱，都是从自己的如来藏银行里提款，非从外得，命中本有，才能赚来，命中没有，任你努力，也是劳而无获。有多少怀才不遇的文人墨客，又有多少精明强干的能人，一生潦倒，内心忿忿不平，哀叹命运不公。实则前世未种福德，再有才干，无济于事。</p><p>种福惜福，智者所为，贪图享受，愚人所行。生活只要过得去就好，不与人比豪富，有钱有财用于利人，利人就是利己，一元钱布施出去，至少一千倍的存款进入自己如来藏银行里，布施三宝无量倍的存款进入如来藏银行里，何乐不为。是否富人，不看现世眼前的享受，要看如来藏银行里存款多少。就像有人，住高档房，开豪华车，穿高档衣，花天酒地，银行卡里无钱，不久就会穷困潦倒，此人不名富人。相反，大富长者，紧衣缩食，一切所有，利乐众生，虽不显富，存款无量。智者当思，臭囊一具，有何可乐，一切所行，为成佛道，无我无私，究竟为乐。普劝众生，行菩萨行，心无小爱，大爱无我，利乐众生，早圆佛智！</p><p>十、学佛人福德不够，修行时就有杂事干扰，这是福德不足的表现。这时应该考虑修福，福德不足，修行进展缓慢，事倍功半。在世俗法里生存，福德不足，也会一事无成，学佛修行这种生死事，是天底下最大的，如来藏银行里没有存款，修行就不能顺利。想要办成多大的事，就要有相应多的存款，福德不足，无法实现什么愿望。想要成佛，就需要有佛那样大的福德；想成八地菩萨，就要有八地菩萨的福德；想要成为初地菩萨，就要有初地菩萨的福德；想要明心开悟，就要有十住位菩萨的福德。没有福德，寸步难行。</p><p>十一、修福与菩萨心性</p><p>有菩萨心性的人成就很快，这是多生累世修行的结果。为了修行更快速，我们都应该发大心，修自利利人的菩萨行。菩萨的心性就是无我的，无我与菩提相应，就能快速证得菩提；有我，就是障道的根源。如果一个人心心念念都是为着个人利益而修行，不关心佛教和众生，不关心他人，福德很难累积起来，智慧很难得到增长，修行就非常缓慢。有一些人劝他修福，就是不肯修，结果学了很久，花费了很多精力，知见还是很可怜，上不了正路。修福是学佛的起步，是证得佛法的基础，非常重要。可是还是有人不愿意修福，以为修福就吃亏了，不知道不修福才吃大亏。</p><p>布施修福，选择在什么处修福也是很重要的，想收获粮食，就要在稻田地里种种子，不能在菜地里种水稻的种子。在大乘法中修福，才能证得大乘法；在真正的佛法上种种子，才能收获大小乘法的果实。如果专门修福德的话，就要修布施行，包括财布施、法布施和无畏布施。</p><p>布施不仅仅是供养三宝，包括对众生的三种布施：財布施就是钱财、物品的布施；法布施，如果自己没有证得佛法，可以作间接的法布施，这样积累福德也很快，能让更多的众生了解大乘佛法，自己福德很快就能集聚起来，知见树立得也快，见道就快；无畏布施是解决他人的苦恼和忧愁，让他人没有后顾之忧。这三种布施，做到一定程度，福德就能集聚到足够证果和明心见性，脱离凡夫位。</p><p>十二、菩萨为了道业不能轻易享福</p><p>菩萨不会轻易选择上天去享福，除非是为了度众生的方便。菩萨在人间时，如果是为了度众生的需要，或者是为了护持佛法的需要，才现大富贵身。一般来说，都不现富贵相。因为福报消耗得很快，道业增进得就缓慢。过去悟道的禅师，都可以做国王，可是很少有人愿意当国王，那是怕自己的福报消耗得太快，也不利于修道，道业会受到很大的阻碍。现在的人，当个小科长，慢心就很重，不知道我们菩萨连天主都不愿意当。</p><p>真正的大富贵人，是指如来藏的银行里有数不清的存款，而不轻易从如来藏里提取出来享受。布施三宝、护持佛法除外，这是又往如来藏银行里存款，而且那是极高额利息的存款。如来藏里财富少或者没有财富的种子，也仍然属于贫穷人，尤其是没有善业种子和修持佛法的种子，更是贫穷人。所以学佛人在生活上只要过得去，就应该知足，不要想办法把财富都提取出来；如果不都提取出来，极大部分留在如来藏里，永远属于自己的，任何人都拿不走，而且如来藏银行永远也不倒闭，是世界上最安全的银行。因为祂不在世间里，如果祂在世间里，肯定也有倒闭的危险。</p><p>十三、布施也是报佛恩</p><p>每个人的我执都很重，通过学佛，认识到世间的真实相以后，我执才能慢慢消融。前世有人学佛时间长，有人学佛时间短，使得众生的根基有所不同。然而无论什么样的根基，只要进入佛法当中，都是先于其他众生觉悟的人，应该感到庆幸。我们后边，还有无数又无数的众生，连人身都得不到，更没有机会接触佛法，苦难无边无尽。到我们成佛时，都不知道他们是处于哪种生存方式的众生。所以我们学佛人应该生起悲悯心，不仅怜悯自己，也要怜悯众生，如果能发起救度众生的心，自己修行就会很快了。</p><p>尽量多修福德，福德多了，道业才能进步，智慧才能增长。多少人不重视修福，致使学佛很久，佛法知见还是很浅薄，智慧不得一点长进，根本问题就是福德不足。那些积极修福的人，进步很快，智慧增进得很快。是修福对自己有利，还是不修福对自己有利，请大家三思。</p><p>佛是福慧两足尊，成佛只强调福德和智慧，二者相辅相成，不可缺一。福德和智慧是孪生兄弟，不可分离。每个人修到一定程度，福德不够用时，往往就会被卡在某处，从而停滞不前，有的人还会倒退。这是我对一些学佛人的观察所得。</p><p>修学佛法是有次第的，破相布施、不住相布施、不执著布施的果报，这些凡夫根本做不到。如果怕执著布施的果报，怕着相布施，而不肯布施，那就永远当无福的凡夫。只有明心以后，修到一定的果位，才能慢慢做到无相布施。在凡夫位，布施肯定是要着相的。但是着相不要紧，布施毕竟是能得福，有福德就能得道，这是最重要的。</p><p>我们修学大乘法，不能像阿罗汉一样，自顾自地只管自己，不考虑众生的苦。阿罗汉们都是自了汉。虽然能了自己的苦，有能力出轮回，却被佛呵责为焦芽败种，堕无为坑，不生长佛法根苗。如果都是像阿罗汉一样，这个世界众生谁来解救？我们都是依靠佛菩萨来救度的，阿罗汉不传法，菩萨再不传法，众生就会永远处于生死苦海之中，无有出期。</p><p>我们所得的滴水之恩，都是佛菩萨给的，众生在六道里轮回，都要靠菩萨来解救；如果菩萨不传法度人，我们就不会有得遇佛法的那一天。我们大家都不希望这样，那就应该将心比心，心里总要想着其他众生的苦，总要想办法帮助其他众生，解除苦恼。这才不枉佛菩萨们对自己的关照，不枉遇见能解救自己的佛法，也才能报佛菩萨的恩德。</p><p>十四、放生之后，生死轮回这件事能否改得了？诽谤三宝之后，命终要下地狱，放生能否躲开地狱的果报？欠别人一万元钱，放生之后，是否债消了？放生之后，能否证果和明心见性，能否往生极乐世界？前世今世杀的众生，怨结是否就解开了？</p><p>一种善行不能代替所有的善行，更不能代替清净行。清净行才能使心清净，从而消除染污心，改变染污业种，果报才能真正的改变。无所求是清净行，不贪不嗔不愚痴是清净行，离于无明是清净行。当然放生行善以后，与众生结善缘，福德增加，能支撑戒定慧的增进，心得清净，有助于证果和明心。福德增加，恶业也许暂时不现前，冤亲债主由于敬佩自己的德行，不再加紧追债，也不再障碍，学法修道就顺利了。</p><p>十五、佛法的修证需要极大的善根福德</p><p>佛法之难证难修，需要众生修行三大无量劫。佛法如果容易懂容易修容易证，众生就不会修行三大阿僧祇劫才能圆满成就佛道；佛法如果容易懂，佛就不强调众生要有相当程度的善根福德和戒定慧了。三藏十二部经，有的人读了五遍，佛法的边却不沾，悟道的影子也远远望不到。众生无量劫迷惑颠倒，沉浸在虚妄的世间法里，真的不容易理解甚深的佛法。</p><p>佛讲法四十九年，涅槃时，还有无数众生对佛法一知半解，有的甚至一知半解也没有。阿难就是看到众生的愚痴难度，错解佛法，才不得不在佛涅槃一百年时，自己也离开娑婆世界了，本来依靠禅定力和福德可以住世很久很久，代替佛陀教化众生。佛涅槃后，一个老和尚就教小和尚，把解脱道的法念成水老鹤，阿难让其改正过来，老和尚不改，反而说是阿难老糊涂了，记不清佛讲的法，于是阿难伤心难过，就离开娑婆世界了。</p><p>反反复复强调，让大家多修福，多培养善根福德，可是没有多少人愿意修福培养善根福德的，所以不懂佛法那就太正常了，佛法不是不肯修福的无福人能轻易理解和证得的。证得佛法需要大福德，有大福德才能有大智慧。小根小智，与甚深佛法确实是不相应的。世间法的成就都需要福德，何况出世间有关生死的大事，何况解脱自己无量劫的烦恼大事，更何况成就佛道这样不可思议的极大事。心里只有自己，只想自利的人，怎么能与无我性的如来藏大法相应。</p><p>十六、没有福德，定力很难修持上去，这边一打坐，就会有人事出现来干扰，于是就不得不去处理；这边刚要入定，那边干扰就出现了，还是不得不去了别和处理。反观检查一下，每个人都在哪些方面不断的消耗福德？能反观出来，就要注意不要轻易浪费自己的福德，以使道业快速增进。现代社会物质生活太发达，是不是说明如今众生的福德大，而佛世时众生的福德小？世人轻易的把福德种子套现出来，用来享受，那真是很无智。有智慧的人往往把福德留着用来修道，不套现成为世间法来享受和炫耀。</p><p>很多人都喜欢拿世俗法生灭的东西引以为傲，以此作为炫耀的资本，诸如我是某某高官，我有某某地位权威，或者我是某某，巨富无比，我有某某才华，我有某某过人之处等等。这些都是世间虚幻法，不牢靠，不久即灭，有也是空。世人都难体会到空，只知道有。</p><p>过去禅宗祖师想找个徒弟接自己的宗门，拷问徒弟的见解，观察是否开悟是否有智慧，结果徒弟一开口说话，师父就知道没有悟，说道：你福薄，接吾宗不起。祖师的意思是智慧不足的一个重要原因是福德不足。我们的思维紊乱不清晰，也要经常找一找自己的原因。</p><p>十七、供养三宝的福德是最大的，对佛的供养，一是要每天真诚地供佛素食，别当假像供养，应该当作真佛来供养。这样所得的福德，与供养应化身佛的福德是一样大的。只要是素食，不管生熟，包括蔬菜、粮、油，都可以供佛。</p><p>第二种供养佛，是念佛。念佛的无量功德，不仅是念应化身佛的无量功德，最主要是念法身佛，念自性佛。人人都有自性佛，念外佛总不如念自性佛；求外佛，不如求自己佛，他什么都能提供给你。皈依外佛，不如皈依自性佛，自性佛能带领你走出轮回，到涅槃彼岸。</p><p>只要每天探求真如的体性，学习祂的功德，了解祂，寻觅祂，参究祂，都是念佛，最后就能成就念佛三昧，明心见性。所有的供养无过于此，所有的念佛方法，都没有这种殊胜。念佛成佛，念法身才能成佛；只念外佛，不能成佛。供养法，就是要每天学习、读诵佛的经典，思惟佛经义理，探求真实义，按照世尊教导的去做。一切供养中，法供养最胜。供养僧，僧是和合义，对僧宝身口意行要清净，如理如法地四事供养，听从僧人的正确如法教导，不违出家师父如理之教，维护僧团和合，护持僧团弘扬正法，以利天下大众。</p><p>十八、供养三宝之福无量无边大</p><p>出家人戒律中有个一坐而食，吃饭的时候饭盛好了，要坐着吃，直至吃完为止，吃完就起立走人。如果中间站起来再去盛饭，或者走动一圈回来再吃，就不允许了，不能二次三次的去盛饭吃，只要身体站起来，就表示已经吃完饭了。佛世出家人日中一食，因为乞食很浪费时间，日中一食能节省很多时间来修行。如果每天乞食两次三次，不仅浪费大量时间，也被世人和外道讥笑，说出家人成天乞食吃饭，贪吃而没有修行。三是多吃饭，肠胃经常蠕动消化，心不清静，影响修行，多吃也消耗自己的福德，道业修不上去。综合几个因素，僧团制定日中一食的戒律。</p><p>出家人乞食，同时也为了众生有福田可种，为众生提供修福的机会，得解脱的机会。众生布施的越多，福德越大，得解脱的机会越多，解脱的几率越大。不会因为出家人乞食，就让众生变得贫穷了，恰恰相反，众生会越来越富贵。也不是因为出家人每天都乞食一次，佛教就逐渐灭亡了。佛教灭亡，有众多因素，主要是众生的善根福德越来越少了，众生无福遇到佛法得解脱，加之波旬对于佛教的破坏，佛教必然日趋衰落，最后灭亡。众生布施出家人，佛制不允许拒绝，要让众生种福得福，否则众生无福，永远流落六道贫穷受苦。自己能有福田可种，也应该感谢佛陀和僧人，感谢三宝，要不然何时得解脱？</p><p>佛在经中说，供养佛陀的功德无量无边之大。尤其是在佛陀刚刚成道时第一顿饭和临涅槃时最后一顿饭，如果有机会供养，这个人就能最快速成佛，超越于其他人。佛陀成道后第一顿饭是牧羊女供养的羊奶，佛陀临涅槃时最后一顿饭是一个铁匠纯陀供养的。当时有极多人哀求世尊要供养佛陀最后一顿饭，佛陀都不许，直到铁匠纯陀提出供养的请求，佛陀才点头答应。然后佛陀就授记铁匠成佛之事，这是佛陀前世曾经答应纯陀在佛陀临涅槃时供佛最后一顿饮食。可见能有机缘供养佛陀和三宝，其福不可思量。</p><p>十九、菩萨六度当中什么法是先导</p><p>六度当中，般若为主导，为根本，为中心，布施为先导，福德是基础。世、出世间任何法，没有福德，做不成功。布施是修福，有了福，才能很好地持戒、修定、修忍辱，才能观行成功，才能明心见性。福德是基础，持戒是助缘，禅定是前提。观行是正行，观行才能获得般若智慧。没有福德，想持戒，就有破你戒的，持戒总是阻碍重重，不能圆满。福德具足，修行就没有障碍。福和德总是连在一起的，不为自己就是德，不求世俗法的享乐就是德，利乐众生就是德，有德就有福。</p><p>佛说六度，第一度是布施修福，这个不具足，不可能获得般若智慧。如果先有般若智慧，那我们就不用修行了，还用观照做什么呢？六度的概念、修行的内涵要懂，经常观察自己做到哪一样了，什么还不具足，想办法圆满六度的条件。 佛的另一种是悲心是后天通过修行修出来的，是佛的意识心也就是妙观察智所表现出来的对众生的悲悯心，这种心能够随着佛的意识心妙观察智的出现而出现，随着妙观察智的暂灭而不现，是生灭变化的，不是永远都能存在的，既然不是长存的心，是佛的无垢识出生虚幻出来的，因而是虚妄的。</p><p/><p>佛的两种悲心都不动转，菩萨的意识心的悲心还有动转，凡夫的意识心偶尔的悲心全部随境转，不是随时都有，也不能恒常存在，也不究竟，更不具智慧性。佛生悲心，不随境界流转，不认境界为真，不分对象，真正是无缘大慈，同体大悲，没有你我他它的分别对待，看众生一律平等。</p><p>众生对待人往往是不平等的，以自我为中心点，一点一点地向外扩展，越是外围的人，生起的慈悲心越少，或者根本没有慈悲心；有的人即使是自己最亲近的人，也不生起一丝慈悲心。所以众生私心比较重，我心比较重，很少考虑别人，或者根本不考虑，不能站在他人的立场来考虑问题，与佛的无缘大慈相去甚远。</p><p>二十五、关于即身成佛的问题，无论是即身成佛，还是即生成佛，都是最后身菩萨妙觉菩萨的事，凡夫无分。即身成佛，是像弥勒菩萨那样的妙觉菩萨才能即身成佛，但是也得选择时节因缘，除此再也没有即身成佛的了。</p><p>众生修行都是有次第的，不可能跳跃很高的层次，从凡夫一跃而为佛，除非是已成佛者表法示现；但是也不会在有佛住世之佛国土示现，一国土无二佛故。凡夫众生应该先修阿含解脱之理，证解脱果，然后再修学大乘般若和唯识之理，循序渐进，一辈子能明心见性，已经是相当好的根基了。一般的众生断个我见，证个初果，都已经难上加难，摸不着头绪，即身成佛的事就不要想了。一般众生学个如来藏法，都学不明白，不可能一辈子把如来藏里的所有种子功能作用都证到而成为一切种智。一般的众生连个四禅八定之前的未到地定，都修不出来，何况修出四禅八定和灭尽定，获得无量的神通道力，无量无数的分身，根本是不可能的。</p><p>一般众生连度自己都很难，何况能度无量无边之多的众生，作为自己佛国土里的弟子，更是不可能。不能度众生，就不能有无量数的弟子，没有弟子，一个人不能成就一个佛国土。当国王都有辅佐的大臣和千军万马，来建设和维护国家；作佛就需要更多的大菩萨来辅助弘法度众；没有度过众生，就不会有大菩萨弟子作为左膀右臂来辅助自己弘法。所以娑婆世界的众生还是要脚踏实地的一步一个脚印的修行，不要好高骛远，而耽误自己的道业。</p><p>二十六、修行不是只活在当下，只管当下，最重要的是要考虑未来。让未来不再受轮回之苦，不再迷茫无知，不再有无明。如果只活在当下，心中没有未来，就看不清楚前方，容易走错路。而且这个当下念念生灭，说一个当下，就已经成为过去。哪里有当下呢？过去无数个当下已经消失了，这个当下正在灭亡，以后的当下还没有来。你要哪个当下呢？过去的识心已经灭了，现在的识心念念在灭，未来的识心还没有来，你要得哪个心呢？三心不可得，不可得的那是识心，是无常虚妄的心，能生灭的怎么能得到呢？怎么能抓住呢？</p><p>但有一个心，不是后得的，先天就有。即使你不要祂，祂也不离弃你，你上天随你上天，下地狱也随你去，你到哪里，祂都随从。你受苦受恶报，祂也不嫌弃，从无始劫以来，从来就没有离开过你，这个心有多么好啊！修行就是要证这个心，明了这个心，探索其中的奥秘，才能开发大智慧，有了大智慧才能成佛作祖。</p><p>二十七、所谓的世界，不过是一种感觉罢了。不同的心境，有不同的感觉，不同的人有不同的感觉。那么这些感觉都是什么东西？什么也不是，幻化罢了。那怎么办？改变不如实不如理的感觉，为如实如理的感觉，就回归真实，回归觉性，回归一真，回归涅槃，回归寂静。</p><p>二十八、对于实修的人，不需要特意讲意根，他们就能实证。对于不实修的人，一定要告诉他们解悟与证悟的区别，让大家不要满足于解，一定要实证。这是对末法时期浮躁的众生特殊待遇，众生心极其浮躁，不肯下苦功，不肯持戒，不肯修定，即使想持戒，想修定，由于环境因素，也无法做得到，因此不能观行，不能实证。只能天天看看书，意识理解理解，解到一定时候，对外就说自己证悟了。因此有必要在这特殊时期讲一些特殊的法。对特殊众生要特殊讲法，这才是对应众生的根基，解决众生实际和根本的问题。</p><p>二十九、任何人都有可能错解佛经佛意，但是只要不肯定表达自己的见解，就没有大过失了，也不一定会误导他人。学佛过程中，肯定是一错再错，任何人都难免，关键是对自己的观点抱持着什么态度，到什么程度可以自信自己的观点正确，这个一定要把握好分寸。没有错误的，只有佛一人，弥勒菩萨讲法，佛也不会百分之百肯定。</p><p>开悟的菩萨讲法也会有错，不开悟时讲法错误就会更多，一般性的错误都没关系，关键是最关键之处，不要有错误，因为关键之处涉及到随学的众生能否证悟的大问题，这是众生生命转折点，在这个转折点上，一定不要有错，只要目标方向没有问题，其余的都是小问题，可以纠正扭转。我们学佛，就是要努力勤求证悟，证悟以后，随所学法，随学随得，往往会事半功倍。</p></div>"
},{
    "title": "第十六章 魔障与佛菩萨的加持力篇",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十六章  魔障与佛菩萨的加持力篇</strong></p><p>一、佛法传播和毁灭的真相</p><p>佛法要灭亡的时候，僧团分裂，互相争斗，阿罗汉遭嫉妒，先被活活杀死，最后所有出家僧都被杀死，从此以后就不再有佛法的传播，一切佛法都不存在了。也就是僧宝一灭，三宝就灭，因为娑婆世界是由出家僧宝传佛的法脉，没有僧宝，佛宝和法宝就没有传播者，佛教必灭亡。这是法灭尽经里讲的，我们学佛要多读佛经，佛经里讲的法范围最全，也最准确，多读佛经，就能多了解佛教历史，以及佛教的发展和走向，增益我们的智慧，坚固道心。</p><p>世尊最初到娑婆世界传法，首先度憍陈如等五比丘，建立出家僧团，再度大迦叶等等率领的外道出家众，最后度自己世俗里的家亲眷属，只要能出家的，佛都度化出家。然后一一传法，最初传小乘解脱法，然后传大乘般若，最后传方广唯识。佛灭度以后，嘱咐出家弟子广泛传播佛法，派以大迦叶为首的几个大阿罗汉留形住世，以护持佛法的流传。</p><p>一些大菩萨们包括他方世界的菩萨发誓要在娑婆世界传法，佛没有同意。佛说我娑婆世界有出家僧住世弘法，菩萨们在十方世界都有各自的传法任务，非常忙碌，娑婆世界就以我出家僧为主传法吧。所以从佛建立僧团开始，一直到佛法最后灭亡时，都是以出家僧为主弘法，佛说自己也算出家数。当出家僧团破裂，出家僧被杀之后，佛教马上灭亡，再无传法者。</p><p>末法时期的阿罗汉几乎都是慧解脱，禅定只是初禅定，所以没有神通。即使有神通，业障现前，谁也躲不过，还是能被杀掉。大目犍连的神通是声闻弟子中最大的，可是临终也是被打死的，神通敌不过业力。</p><p>释迦佛的法灭之后，只能等着弥勒佛出世度化众生，三场法会度化接近三百亿众生证果。那时我们属于释迦佛遗留下来的弟子，由于善根福德深厚而被弥勒佛接管度化，所以每个众生都不是只归属于一尊佛，要跟无量尊佛学法，跟无量菩萨一起学佛，才能把所有佛法都修学到手，只跟一尊佛学法是不能成佛的，只跟一个菩萨一个师父修行更不能成佛，所以每个众生都应该发愿供养和护持十方世界所有诸佛菩萨。</p><p>二、问：如来藏和意根的法，究竟哪个更重要？如果波旬想破法，他最想阻碍哪个法的弘传？</p><p>答：如来藏和意根的法都重要，如果非要比较哪个更重要，那就是如来藏法更重要，因为没有如来藏就没有一切法，不证得如来藏，修什么法也没有用，不证得如来藏，就不会有以后的各种观行，也就没有妙观察智去观行意根的各种功能体性，意根的平等性智也不会出生。</p><p>如果波旬要破坏佛法阻碍佛法，他一定是先破坏如来藏法，然后阻碍意根的法。波旬的福德很大，在佛住世弘法时，他就跟在佛的身边，很多法会他都参加，极大多数时候是抱着破法的目的参加的，个别时候在佛力和佛法的感召下，在菩萨的惩治下，不得不在法会仔细听法，而且还护持佛法。他一直都知道佛法非常好非常重要，能让众生得清凉解脱，但是他由于极强烈的眷属欲，希望自己控制的眷属越来越多，而不是越来越少，所以他不希望众生学好佛法，不希望众生心得清凉得解脱，以脱离他的掌控。</p><p>所以波旬在得知世尊要讲某部重要的大乘法时，就要千方百计的想办法阻挠，佛明明知道波旬的诡计，却从来不揭穿他，都由护法菩萨来教训。这样波旬就在佛的法会上听闻了很多佛法，主要是大乘法，他懂得的大乘法也不少，后世由于这个善根福德，就能成为真正的菩萨，将来就能成佛。</p><p>但是在他成为真正的菩萨之前，在下地狱受恶报之前，他还有魔性，还有很强烈的眷属欲，他一定会利用自己所听来的佛法，为众生讲相似的大乘法讲如来藏法，比较接近于佛法。因为他有神通，得知如来藏的大致密意很容易，他讲如来藏的时候，就愿意把密意告知众生，他不怕众生只知道个结果，知道结果没有用，中间修行过程才是最重要的。</p><p>波旬这样做的话，就很巧妙的达到目的，一是让众生崇拜自己，借此就能拉拢众生，二是不让众生真正修行，不能真正得解脱。众生轻易得知密意，再也无法用功修行了，还会生起极重的慢心，造作恶业，这样众生无论如何也逃不出波旬的掌控，波旬就达到目的。所以波旬也不怕众生都学如来藏法，只要学的不如法，多造些恶业，再轻易得知如来藏的密意，更不容易得解脱，这些众生还属于波旬的眷属，由波旬掌控。</p><p>那么我们就知道了波旬一定最怕实修实证了，而学法实修实证，都与禅定和意根有关，具足了禅定，就能熏修到意根，就容易证得佛法，这样离解脱就不远了。波旬对此一定无可奈何，那他就会对于禅定和意根实证之法横加阻碍、百般阻挠，表面维护，暗地破坏。众生看不明白他的招数，还以为他很护法，很有修行，真是菩萨。波旬很诡诈，他表面非常拥护佛法，还会亲自讲法弘法，但绝不会让众生真证得佛法，他暗中做的这些手脚，众生的智慧绝对发现不了，只有善根福德深厚的众生，才能得到诸佛菩萨的加被，不受其蛊惑，而能实证，所以善根福德是非常重要的。</p><p>三、洗脑，是用巧舌如簧的手段，随顺众生的贪欲心理，众生容易相信，从而潜移默化，受了熏染。而正面教育很多时候是与贪欲相逆，众生不容易接受，不容易受熏。魔让众生着魔很容易，佛让众生入佛相当困难，因为众生听骗不听劝。</p><p>四、波旬的福德很大，寿命很长，论劫算。他的福德由于造恶业消耗没有了，寿命才尽，然后直入地狱。在他寿命存在的这么长时间里，他一定要拥有最多的子孙，才满足其贪心。所以众生只要在一劫几劫之内不能离开欲界包括三恶道，都属于他的子孙眷属，几劫之后他就管不着了。所以波旬喜欢布施修福，也喜欢众生布施修福，但不允许众生修行得解脱，不允许众生修禅定，不允许众生到其他佛国土，除此之外，众生愿意干什么就干什么，他就不管了，只要出不去欲界就行。众生越喜欢五欲，波旬越欢喜，因为欲界才有五欲，贪五欲当然出不了欲界，永远属于他的子孙眷属。</p><p>大家观察一下自己，有多少心行是波旬所欢喜和赞成的，有多少习性是符合魔心魔性，容易得到魔力加持的？修行非常懈怠的人，世俗法方面，就很顺利，修行一勇猛精进，上一个台阶，就开始不顺利，出现了魔障。所以修行好的人能把业障修出来，修行还不得力的人，往往顺风顺水，没有阻碍。真正的菩萨，魔越干扰，道心越坚固，禅定越好，智慧越深。魔扰，犹如火上浇油，越魔火越旺，菩萨不怕魔。</p><p>魔王波旬总是接受这些佛法的熏染，包括大乘法，他什么不懂？都能懂得，但不能证得。因为他贪欲炽盛，不想真正修道，更不能想去断我见，降伏自己的烦恼。又因为波旬懂得这些大小乘的法理，他破法就有了更方便的条件，一般众生都没有他懂得多，他一讲法，大多数众生都得崇拜他，然后在讲法偷偷加些生死系缚之法，无人能识别，跟着修行，就会落入魔道。</p><p>波旬经常能见到释迦佛，听释迦佛讲法，经常接触大乘菩萨，听菩萨的教导，经常接触阿罗汉，听阿罗汉的教导，他占尽了佛法上的便宜，种了佛法上善根，应该感谢三宝才是，却想尽办法毁佛灭法，引导众生趣向三恶道，恩将仇报之人。波旬当面对佛陀都是这样的态度，非常不恭敬和蔑视，对待阿罗汉更是蔑视轻视，对待其他众生相当的歧视凌辱，谁挡他的路，他就要毁灭了谁，毫不留情，不可理喻。</p><p>波旬的心量非常小，锱铢必较，一个人都不放过，连佛不在他管辖之内都不高兴，任何人想要远离欲界，他都会忧恼。波旬这一期寿命结束，直接入地狱，从地狱出来，不知什么时候善根成熟悔过自新，开始真正修学佛法，走上正路。他真诚悔过之后，恶业消灭，修行还是很快的，毕竟三宝让他种了那么多的善根福德。</p><p>五、佛为什么不把波旬灭了</p><p>波旬也是众生，有佛性，将来也要成佛。佛心空，慈悲，从来不违逆众生心。魔让佛涅槃，佛把弟子带成熟了，就决定涅槃，满魔的愿，虽然佛可以住世一小劫，却八十年就涅槃了。佛对波旬慈悲，不代表护法神和弟子们不制约波旬的恶行，佛允许菩萨阿罗汉护法神教训制约波旬，避免他破法破教，误导众生。我们一定要擦亮眼睛，不被波旬所蒙蔽，不上他当。</p><p>波旬如果讲佛法，善于抓住众生的心，众生喜欢五欲六尘，他就隐蔽着默容贪欲，引导众生向贪欲，而且表现得天衣无缝，很有道理似的，久修菩萨才能看透波旬的诡计。波旬讲法也默容众生的烦恼，巧妙的纵容众生的烦恼心，不希望众生降伏烦恼断除烦恼。因为巧妙，大多数众生识别不出来，而且波旬不违逆众生的贪心，就会让众生生欢喜，吸引很多众生顺从自己。</p><p>六、学佛修行中所受到的障碍都有哪些</p><p>惑障，是思想观念上的迷惑，也是烦恼障惑。业障，无量劫中造作的无数业行所产生的业报障碍。习障，无量劫中在世俗上的熏染，久已成习，惯性的力量非常大。魔障，有天魔干扰设置的障碍，有心魔烦恼魔的自心所起的障碍，没有能力出离欲界的人，天魔是不会来干扰的，他觉得没有这个必要，往往都是每个人自心所起的烦恼魔障。</p><p>这些障碍时时跟随着学佛人，如果不精进，还不明显，精进用功的时候，道业有所增进的时候，这些遮障就很明显，感觉各种阻力很大。就像用脚走路时，虽然周围有风吹动，感觉也是微风，如果是骑自行车，感觉风力稍微大一些，但没有什么大碍，如果是骑摩托车，风的阻力就大了，速度越快，感觉到的阻力越大，因为物体之间有个撞击力的问题。学佛修行也如此，与自己无量劫以来的习气惯性有个撞击力，越精进所受到的阻碍越大。如果有坚韧不拔的毅力，不畏阻碍，道业则会不断增进，成就又快又大。</p><p>七、有很多这样的事例，学佛因缘成熟的人，还没有开始学佛时，观世音菩萨或者是其他诸大菩萨或者是佛都可能通过梦的方式加持他，以促成他尽快信佛学佛。学佛以后，佛菩萨也会在梦里去加持他。有的人病得很重，躺在医院里，观音菩萨就会给他头顶洒甘露水，第二天病就好了。这样的事情并不奇怪，其中也涉及到缘分的事情。</p><p>感得佛菩萨现前加持，这是前世学佛的善根福德和缘分，这个人不一定修得多么好，也许是初学者，仅仅是信佛而已。菩萨要度众生，会用各种形式和方法，也不一定只度善根福德深厚的，初学者也会度，让他们对佛菩萨起信。</p><p>八、学佛无所求的人很少，无心的人就更少了。所求也就是世俗法上的求，佛法上的修行都是要达到无心无欲无求，才能成就，凡是有心有求，都是还没有成就的人。不管求什么，都是有心，把所求的法当作了真实而去贪着，因此都不对。有的人求眷属多、求威望、求权势、求做主宰、求福德、求政治势力等等，都是错用心思，不是修行人所为。</p><p>金刚齐比丘修行大般若，无所用心，心无所住，魔王波旬窥视一劫，找不到下手处去滋扰，懊恼而归。而那些贪欲炽盛，所求甚多的人，出不了欲界，本是魔眷属，波旬不但不扰乱，还大力的加持和鼓动，让他继续贪、大贪、疯狂贪。真正修行的人，才能经常遇魔障，被波旬扰乱。放逸的人就为魔所控制，是魔眷属，魔就希望所有众生都享受五欲乐，放纵贪嗔痴烦恼，不要降伏自心，越放逸，魔越欢喜。魔王波旬也善于打击众生的修道心，失去修道信心，魔就欢喜，众生上当。</p><p>一个修道人具有正知正见很重要，具有甚深禅定也非常重要，能善辩魔扰，不随魔意，不入魔窟。禅定能成就一切佛法事业，无有禅定，一切事业休废。若阻止人修定者，即为魔眷属，有智慧的人应该善于辨魔。多念咒，多修禅定，就能降魔，没有禅定，只有聪明智慧没有用，抵挡不了烦恼诱惑。真正修行上路时，梦里都在降伏五欲魔，梦境越来越清净，心越来越清明。缺少禅定，总停留在意识心层面，做什么也无济于事，不是真正修行。</p><p>佛在世时，波旬就非常猖狂，幸好修道人都断除了贪爱等等烦恼，心无结缚，具足神通道力，能避魔降魔除魔。如今末法时期，众生善根福德鲜少，没有禅定，没有道力，无智辩魔，稍有善根福德，临欲成就，魔扰更大。可是众生却无觉知，没有一点辩魔之智，不觉悟有魔扰，完全随顺于魔意。</p><p>如今所谓的大乘行人看不起小乘，自认自己是大乘行者，高于小乘，不屑于小乘的戒定慧，独辟蹊径，绕过戒定慧，以为自己有多高的本领，却是泥菩萨一个，沾不得水，过不了河，况能识魔辩魔避魔驱魔？只有束手就擒的份儿。</p><p>九、对于一个出家师父或者是老师，不要用恶知识来形容。所谓的恶真正的恶，应该如波旬那样的用心，故意误导众生，不让众生走正路得解脱。一般人讲法只是智慧不足，修证水平有限，不是故意要带歪众生走歧路，没有恶心。有恶心的只有魔王波旬，害怕和憎恨解救众生的人和有希望得解脱的人。有的人没有智慧却喜欢讲法，是由于自心的烦恼，想要证明自己行，让众生羡慕和崇拜自己。而有不少人是由于看到众生苦，发心要帮助众生解脱烦恼，可是由于智慧有限，自己没有实证，没办法带领众生如实而修。</p><p>只要发心不恶，就不能带上恶知识的帽子。大多数人讲法，还是在各个不同方面能够利益众生的，尽管他们没有明心开悟，基础的佛法还是要靠这些人来传导。娑婆世界没有那么多真正的明心证悟的菩萨从基础开始一步步教导众生，智慧大的菩萨没有这样的精力和耐心，他们要度有相当程度的众生。证量不同的菩萨要度根基不同的众生，菩萨的数量本来就非常少，不可能非得要大材小用，浪费菩萨的资源。</p><p>我们既然已经修学了佛法，就应该像佛学习，不应该出口不逊，要尊重一切法师和老师。至于说他们讲错了佛法，这是不可避免的，只有佛一人讲法不错，所有菩萨都有可能讲错佛法。菩萨的智慧是不断增进的，之所以叫作增进，那就是说从前的智慧肯定是不足的，那么讲法就会出现错误和渗漏。如果说菩萨在智慧增进以后是善知识，那么从前就是恶知识了，这样说是不是所有菩萨包括等觉菩萨都是恶知识了？</p><p>其实真正恶的只有波旬，波旬在佛前已经发誓，要在末法时期混入佛教中来毁坏佛法，让众生都不得解脱。如今波旬来了，伪装成善知识，而且让人感觉特别善，谁能开眼识破波旬的真面目呢？好像都不能。既然不能识破波旬，我们如何判定一个人到底是善知识还是恶知识？</p><p>众生无始劫都堕在烦恼深渊，不能自拔，都在仰仗佛菩萨的威德来拔济。如果一个所谓的善知识不仅不帮助众生消除烦恼，还要故意给众生增加烦恼，让众生不断的贪世俗，不断的执取世俗法，不断增长嗔心，不断的恶斗，之后的结果就是众生越加的不能自拔，沉沦生死，不但不能远离三界烦恼，连欲界烦恼也无法消除和减轻。</p><p>如果有人能有希望出欲界，波旬最感到头疼，就坐不住魔宫了，一定要想办法拖住和障碍这个人，让他出生贪欲，出生嗔恚，造诸罪业，这个人就会继续留在欲界甚至三恶道中，受波旬管制。所以判断一个人是善知识还是恶知识，一个标准是看他是否故意灌输众生贪嗔痴烦恼，让众生广结恶缘，恶业牵缠，就不可能出离欲界和三恶道，波旬的子孙就会越来越多，不会减少。</p><p>恶知识往往要从根本上毁破三宝，坏乱佛教，把三宝连根拔起，不让众生依止真正的三宝。波旬会巧妙的摧毁众生心中三宝的形象，巧妙的贬低佛的形象，贬低僧的形象。再想办法阻止众生修学真正的佛法，阻止众生实修实证，他会巧妙的阻止众生修学菩萨六度，修学戒定慧，让所有众生都无法实证，不能真正断我见，不能真正明心。而且故意让众生造大妄语业，个个都会觉得自己是真菩萨，他人都是魔子魔孙。这样每个众生都会陷于恶业之中，不得解脱，波旬就满意和高兴了。具体内容比照楞严经中五十阴魔部分。</p><p>十、佛陀说法为什么这么多外道和恶魔眷属来捣乱？魔王的本事究竟有多大？</p><p>楞严经后边讲的五十种阴魔，哪一种不是神通广大，众生难以企及，非常羡慕？可是那都是魔境界，普通平凡人是无法入魔的，魔也看不上。被魔看上并且利用加持的，就会神通广大，几乎要到佛境界。众生不知，非常贪执，以为殊胜的不一般的一定是好境界，又有禅定，又有所谓的智慧，又有神通道力。可是这恰恰是魔境界，魔力加持的结果。结果就是这些神通广大的人离不开魔，成为了魔眷属。</p><p>魔为什么有这么大的神力呢？一，他有极大的福德，有禅定，有神通。二，他懂佛法，只是懂，不是证。这个懂就已经不一般了，足以在破坏佛法破坏佛教。佛经中记载，每次佛讲经，佛要讲什么经，波旬都知道，这部经的重要程度也知道，众生听经之后的果报，他也知道。由于他极不愿意众生证得解脱，脱离他的掌控，于是就变化成各种身份和形体去法会上暗中干扰。波旬还会化现神通吸引众生，为众生讲佛法，好像是度脱众生，实际上是诱导众生进入各种烦恼贪欲之中，不得解脱。</p><p>佛陀涅槃一百年后，禅宗四祖优波掬多尊者出世弘法，尊者每次在法会上一讲到关键之处，众生快要断我见证果时，魔王就会暗中捣乱，天降黄金白银等等珠宝雨，吸引众生的注意力，众生受到这样大的干扰就不能断我见证果了。尊者在入定时，魔王为了破坏他的禅定，就化现种种畸形异类，滋扰缠缚尊者，结果都被尊者识破，破了魔王的法力。魔王也曾经多次跟阿罗汉们捣乱，结果都被有神通的阿罗汉所收拾，灰溜溜走人。</p><p>如今末法时期，魔王不管化现什么身份什么形体，众生都无眼力识破，大多都会上当受骗，很难阻止。魔力一来，众生几乎都没有招架之功，乖乖归顺，五体投地，崇拜至极。魔王要扰乱修行人，一定是说一些较高深的法，看似正确，实际则非。只有实证之后的修行人才能辨别魔说，一般人都有可能被魔语所吸引，认为他说法高深。</p><p>大多数人都以为，魔王既然是魔，胡搅蛮缠，一定是不懂佛法的，一定是恶人，不做善事。其实不懂佛法的人，绝对成不了魔，不做善事的人，也绝对成不了魔。不懂佛法的魔，无论如何也干扰不了修行人，破坏不了佛法；不做善事的魔，是薄福的，根本没有福德支撑他做坏事，他也摄受不了众生成为魔子魔孙。魔王之所以要来干扰破坏佛教，能够摄受众生，就是凭借自己的大福德。为了满足自己的眷属欲，不让众生学佛修行脱离欲界，离开自己的掌控。而众生只有修定能脱离欲界，只有证果见道才能脱离欲界，所以魔王就对这两种人实行干扰，领其趣向邪路。其他众生，魔王不会理会，知道他们都属于自己所有，是自己眷属，包括修善法的众生，魔王都不会干扰。</p><p>所以众生在学佛的初级阶段，魔王不会去理会，也不会遇到魔扰。低浅的佛法，魔王也不会用心去搞破坏，只有出离欲界边界的法和人，魔王才会想办法去干扰破坏，在关键处渗入一些邪见，加之一些错误，让众生无法实证，他就达到目的了。</p><p>所以魔王也讲法，而且不会讲低浅的佛法，一定要讲临近解脱方面的佛法，参杂似是而非的错误，撒上一些迷雾，迷惑大众的双眼，大众虽然受学，却不能实证，不能解脱，不能出欲界。大众想去极乐世界，魔业不允许，想些策略迷惑人心，让众生无法往生极乐世界，只能在娑婆世界欲界人间或者三恶道流转生死，被魔王所控制。而众生无知，没有眼力，没有孙悟空那样的火眼金睛，都看不明白，大多数人都会上当受骗，还要无限感激，执迷不悟。</p><p>十一、问:对于现在时代这样根基的大众，如果想引导向上，改变社会整体的发展趋势，我们是选择报道善行，引导大众向善，还是报道恶行，以警觉大众，截断众恶？有人会说两种方法都要用，当然这种是挺好，用得合适，会起到好效果。但是如果二选一，如果两种方法都用没有好效果，那么该选哪种？是以杨善为主，还是以抑恶为主？</p><p>答：以扬善为主，引导大众向善。就是说正面信息更能影响大众向善，负面信息不一定能引起大众警觉而抑恶。电视电影新闻媒体，宣传了那么多反面负面的信息，本来是为了抑恶，可结果呢，有些人了解了作恶的方法手段反而去造恶，是谁之过咎？社会上宣传那些负面信息，大众的恶行并没有减少，社会上那些恶行并没有被止住。众生心里染污业重，与恶业相应，再去宣传恶业负面信息，大众是不容易警觉的，反而受到了熏染，也许就会效仿恶行。所以现在社会上那些宣传手段，在一定程度上起着导恶的作用。</p><p>破斥恶法而能让恶法减少的现象并不多，反倒是扬善更能让大众认识善，从而学善向善，所以还是让大众熏习善业效果更好。佛教和宗教以扬善为主，国家法律政策和民俗风情以抑恶为主。到底是哪个最终把众生引向成佛之路，最终成佛了?还是佛教。宗教的善的引导力量远远大于世俗抑制打击的力量。</p><p>所以度众生一定要多多宣传善法和正法，不要花大精力去抵制什么所谓的恶法和邪法，抵制永远抵制不了的，毕竟力量悬殊，引导才是正道理，才是正确的方便方法。佛教里佛也制定了一些戒律，来避免佛子的不如理过激行为，比如：不说僧过，不说是非等等，而一切人的善业佛从来不禁止宣扬，还鼓励大众多多宣扬赞叹他人的善行善业，以激励大众向善，佛是最有智慧的。</p><p>十二、识心是否在身体里</p><p>色阴尽和受阴尽都没有证得，但从理论上可以解释一下受阴尽的状态。楞严经中说受阴尽时其心离身，意思是说身上没有意识心，身体上就没有受觉了，没有疼痛和轻安舒适的觉受。那时杀剐存留任人宰割没有痛楚，肢解手足头目没有痛觉，身体有如木头一般。那么识心是否在身体里呢？</p><p>识心如果在色身里，把色身一点点的割开，就能找到识心，可是无论如何也找不到，所以识心不在色身里。识心如果在色身外，那就与色身无关，色身就没有五阴的功能作用，因此识心也不在色身外。识心如果在中间，根本也没有中间的概念和处所，如果把身体表面叫作中间，这是不对的，身体表面属于色身；如果把身体表面外挨着身体的处所叫作中间，那属于色身外，因此识心也不在色身的中间。</p><p>那么识心在哪里呢？六识不管了别什么，都是了别的影子，不是外界六尘的原貌，原貌由第八识了别，叫作本质境。</p></div>"
},{
    "title": "后记：学佛修行是技术层面的事情还是心性上的事情",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>后    记</strong></p><p><strong>学佛修行是技术层面的事情，还是心性上的事情</strong></p><p>所谓佛法上的技术修行也就是学理论知识和证理论知识；在技术上精进，也就是打坐修定，努力钻研理论知识，刻苦参究、研究、思考，以期证得或者是得到某种法，得到某种果位和资格、名誉，获得一种结果。</p><p>所谓心性上的修行，就是指观察五阴的无我性，降伏自我，降伏烦恼，心柔性善，具备圣贤人的无我心性，去除私心和我心，降伏凡夫的烦恼习性，从而能够自利且愿意利人。具体就是菩萨六度的切实实行，逐步完善福德的累集、戒律的受持，忍于一切人事以调伏自心，汰换懒惰懈怠心，修习禅定提高自心的观照力，降伏烦恼，熏习般若空性之理，让心逐渐与空性靠近，与圣贤人靠近。</p><p>心性与技术的修行应该相得益彰，心性是眼睛，技术是脚，眼睛决定技术的方向与高度。学佛修行应该把心性与技术互相结合起来修，不能只修一面，不顾另一面，两条腿走路，才能平衡平稳。</p><p>所谓单方面技术层面的修行，就是说只搞理论研究，不降伏我性，理论与实际脱节。佛法本来是让众生降伏自我，证得无我，得到解脱和自在的。可是众生修行无我的目的和结果，却是增长了我性，增长了我执，自我越加的膨胀起来，心性反不如从前，与修行的结果落差极大。这就是不修心性，只修技术的结果。</p><p>只在技术层面修行，不在心性层面修行，其结果就是德不配位，其后大乱。把修行佛法当作一项资本，掌握了佛法的技术以后，就认为自己高于一切人，强于一切人，就可以作一个人上人，就可以以此技术而沾沾自喜，增长我慢，作为压倒其他一切人的资本。这正是严重的我相人相众生相，这是只在技术层面修行的结果，是一个可悲的与佛法背道而驰的恶果。严重者就能以我慢我执而坏乱佛法和佛教，坏乱众生对佛法和佛教的信心。</p><p>修行方法不可能是单方面只搞理论研究的技术活儿，更重要的还是心性上的培养和转变。如果学佛修行只是技术上的用功修行，佛就不会让众生发清净大愿，以愿力来牵引指引自己的修行；如果学佛修行只是技术上的用功修行，为什么有的人日夜埋首于研究经教和各种理论，精进于各种观行，能探讨出常人所不能知的理论，好像学有所得，可是贪嗔痴仍然很炽盛，一辈子也许就在七住位六住位五住位那里停留，尽管学了极多的唯识理论，仍然不能踏前一步。</p><p>如果学佛修行只是技术上的用功，为什么有的人日夜打坐修行三五十年，却仍然不能获得初禅定，而有的人一两年初禅定就现前了；有的人开悟三十年，仍然不见初禅的影子。可是有的人学佛不久，接触理论，稍微一观行，就能证得各种果位，尽管佛法上的很多名相还没有搞清楚，观行智慧却早就生起来了。</p><p>如果学佛修行是技术上的用功，那么菩萨六度，是技术上的修行，还是心性上的修行？布施度，是属于技术层面的，还是属于心性层面的？持戒是属于技术层面的，还是属于心性层面的？忍辱是技术层面的还是心性层面的？禅定是技术层面的还是心性层面的？</p><p>智慧，心性不好的人，是什么样的智慧？这种智慧与菩萨与佛相应吗？精进，有正精进和邪精进，邪精进属于技术层面的，正精进就是修心性。别有用心之人，能否在佛法里得到真实的受用？菩萨真正成就的标志是慈悲喜舍，心性没有转变，永远不会有慈悲喜舍的心行，菩萨的果位永远不能满足。</p><p>阿罗汉和菩萨的心性，谁更好？谁的道业更增上？谁最受佛青睐？谁最先成佛？谁是技术层面的修行，谁是心性层面的修行？搞技术活的，佛是不是骂过他们是焦芽败种，堕无为坑？</p><p>学佛修行最后的结果一定是德才兼备，既有才，更要有德；如果没有德，才只是歪才，也许会用到邪道上去，造作恶业也不知。世界上有才的人很多，但未必都能用之造作善业，用之造恶业的人也很多，如果用来造作恶业，还不如无才。</p><p>学佛修行人，德要占第一位，摆在最前面，有德就不愁没有才。如果一个人只有才，没有德，才再大，也没有正用。而有德无才的人，可以培养成德才兼备的人，以其菩萨心性，佛力加持快速得道。所以说学佛修行不仅仅是技术上的活，最主要的是心性上的修养。一个无我无私的人，才是真正的菩萨，如果内心里只有自己，只有个人的私利，一心只为自己的人，这样的人，不是真正的菩萨。</p><p>技术修行永远比心性修养容易很多倍，技术只要下功夫钻研，下功夫研究，一定能从文字里研究出点东西来，有所收获，再加上聪明伶俐，不少技术都可以搞到手。可是心性呢？一百年未必能降伏得了心性，秉性难移。搞出技术的菩萨，心性没有降伏，仍然不是真正的菩萨，只是名义上的假菩萨，冒充的菩萨罢了，永远起不了菩萨的作用。</p><p>不少人煞费苦心的日夜用功观行、研究、钻研，从来不研究自己的心，无论怎样刻苦的钻研佛法的科学技术，也不能降伏我性好和自私性，不能真正断我见，不能真正的明心证悟。这样的人，不是菩萨，尽管掌握了佛法的科学技术！</p><p>如今这个时代，有多少人学佛只是在搞技术活，从来不在自己的心性上用功夫。技术是搞出来了，可是德不配位，到哪里都哄抬自我，逞自我，最后到哪里哪里乱。学佛就是为了冒头，就是为了逞自我，从来都不是为了降伏自我，不是为了无为，不是为了无我和解脱自心烦恼。越学越高调，越学我越重，越学天下越乱，最后世道都被搞乱了。不少人学佛，就是为了出人头地，踩在别人的肩膀上，从来就没有想过要把自我泯灭，让自我销声匿迹，这是在断我见，还是在增我见？佛教这样发展下去，到最后就要天下大乱。</p><p>所以如果想要把自己真正的修持出来，一定要两手都要抓，既要在心地上多用功，调柔自己，也要在观行参究上多用功，努力实证，成为真正意义上的圣贤。</p></div>"
}]