[{
    "title": "第一章 极乐世界篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  极乐世界篇 </strong></p><p>一、西方极乐世界是否在三界中</p><p>要弄明白这个问题，首先要思考这三个问题：什么叫三界？三界每个界的特征是什么？三界里有什么？三界外有什么？然后再思考极乐世界都有什么特征，与三界里的每一界对号入座，通过比较最后才能得出正确的结论。这样思考顺序是紧扣主题，在学校作文好的学生，写作文都要紧扣主题，尤其是考试的时候，如果跑题了，发挥得再好也不及格，还会得零分。</p><p>问三界的特征是什么，你就要考虑欲界的特征、色界的特征和无色界的特征，然后思考西方极乐世界的特征是什么，和三界的特征对照一下，通过比较就知道西方极乐世界是在三界里还是在三界外。这就是问题的思路，很简单。当然这是比量而知，虽然有可能结果是正确的，甚至有可能是完全正确的，但却不是现量观察而知，不属于实证而知，现量观察不用二者进行比较就能了知。比量而知是用意识比较而知，现量知不仅有意识在禅定中的现前观察，还有意根也随同意识观察，或者单独进行深深的思量，最后得出符合事实的结论，没有禅定，这些就谈不到了。</p><p>欲界的特征是什么呢？首先欲界里的众生有五蕴十八界法，有色法器世间山河大地等等，有心法八个识心，识心有善恶无记心所法，有无明，有贪嗔痴，以贪欲为主，贪着欲界里的所有法。色界的特征是什么呢？色界里的众生有四禅八定，最基本的是初禅定，有色法色身和器世间，有心法八个识或者是七个识、六个识、五个识、四个识和三个识，心所法有善和无记二种，没有恶心所法，恶心所法是降伏和压伏着，不一定断，定心所法比较突出，身心常处于定中，烦恼不现前。</p><p>无色界是什么特征？无色界顾名思义就是无色，没有器世间的宫殿和山河大地等等，也没有色身，只有六七八三个识处于四空定中，心所法不善不恶，一切烦恼都得以降伏，不一定断，定心所法更突出和明显。</p><p>西方极乐世界有什么特征？极乐世界的凡圣同居土里，有超过阿惟越致以上的所有阶位的菩萨，还有阿惟越致以下没有明心、没有证果的凡夫众生。这些众生都有五蕴十八界，有色法色身和宫殿、花草树木、大地河池等等，有心法八个识，心所法都是善和无记，没有恶心所法。菩萨们对于禅定，即使是凡夫众生因为长期处于莲花宫殿中，心识已经转换了，不再有恶，不再散乱了，都有禅定，心处于定中一心思考佛法。菩萨们的贪欲当然都降伏或者断除了，凡夫众生的贪欲虽然不能断除也得到了降伏。</p><p>既然如此，极乐世界有色界的特征也有欲界天界的特征，没有无色界的特征，那么极乐世界就属于三界中的法，不出三界外，只有无余涅槃以后的阿罗汉才在三界外，不在三界中，就连佛菩萨也不出三界外，而且发愿众生不度尽，永远不出三界外，不入涅槃。因为三界外没有任何世俗法了，没有色法，没有七识的心法，五蕴十八界这些法都灭了，只有第八识不灭。诸佛菩萨怎么能灭了自己的五蕴十八界，不用五蕴身去度众生呢，因此极乐世界和诸佛国土都在三界中，诸佛菩萨们也都在三界中，永远与五蕴众生在一起。</p><p>二、往生极乐世界的真相</p><p>明心上品上生的人，证果中品上生的人，到极乐世界即见佛，十方世界随意去，都不用被莲花包裹着，马上见十方诸佛并供养。其余品位的往生，都需要包裹在莲花宫殿里，慢慢降伏烦恼，让恶业种子枯萎，阿弥陀佛最会对治这部分有烦恼有机会就会造作恶业的众生，让他们一个人住在莲花宫殿里，一点造恶业的机会都不给，当然想造善业也不可能了。只能让从前的业种慢慢枯萎萎缩，自己也没有造业的想法了，心就清净了，善根深厚了，这时候就可以出莲花宫殿，面见阿弥陀佛或者是观世音菩萨大势至菩萨，或者是佛菩萨的化身，当面听法，从而明心开悟。</p><p>看看观无量寿经中下品往生的人，都是什么待遇，有智慧的人就会考虑要不要去。即使下地狱再出来修行，都比在极乐世界十二大劫独自一人住在莲花宫殿里快很多倍。地狱虽然是非常苦的，可是出来以后再修行，成佛的速度比在极乐世界快多了。关键在于每个人自己追求的是什么了。</p><p>下品下生在极乐世界的莲花里住十二大劫，不是娑婆世界的十二大劫。拿电脑算一算究竟是多久远劫时间。这么长时间确实非常享受，但是天天吃饺子，也会吃腻的，习惯了就觉得饺子也不是那么的香。</p><p>三、凡夫往生极乐世界为什么会被包裹在莲花台中？</p><p>明心开悟的人，到极乐世界上品上生，不用包在莲花台中，证果的人中品上生，也不用包在莲花台中，而没有证果和明心开悟的人往生极乐世界，一定要包在莲花台中若干劫，这是为什么？</p><p>这个问题应该这样思惟：一、极乐世界与娑婆世界有什么区别？二、极乐世界与娑婆世界里的众生有什么区别？然后再思惟，既然有这样的区别，那么三、娑婆世界的众生都到极乐世界里四处随便活动，会出现什么后果？</p><p>因为凡夫烦恼太重，如果不包裹在莲花苞内，极乐世界慢慢就会变成另一个娑婆世界了。阿弥陀佛为什么建立极乐世界？为什么如此设计极乐世界？为什么还要挑选众生？为什么不大慈大悲把一切人等三恶道众生等都摄受进去？众生总是希望别人对自己大慈大悲，可是真如自己所愿了，结果可能就是恶果，那反倒一点都不慈悲了，众生喜欢的慈悲往往容易出祸害。</p><p>没有证果和明心的人，不能在极乐世界里四处活动，也不能到十方世界供养诸佛，是防止这些众生的烦恼扰乱极乐世界。从这里我们就会知道了，证果和明心的人不会扰乱极乐世界的修行道场，因为他们的粗重烦恼已经得到降伏了，虽然没有断除，但在阿弥陀佛的加持摄受下，也不会现行出来。</p><p>那么在娑婆世界证果和明心的人，一定是降伏了烦恼的人，一定没有严重烦恼现行的人，一定不会滋扰他人的人。如果有严重烦恼现前的人，或者是随便滋扰他人他处者，一定没有证果和明心，自认的证果和明心一定是大误会。</p><p>所以道场应该分为三六九等，各种层次的人不应该混杂在一起，否则道场混乱，烦恼炽盛，一切修行都不得成就，道场也就成为了烦恼的案发地。一个道场如果没有六和敬，一定混乱，见不和的人，就不应该聚在一起，修行层次不同的人一定不要聚在一起，否则一定会有人造作大恶业。</p></div>"
},{
    "title": "第二章 佛菩萨篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  佛菩萨篇</strong></p><p>一、啥叫菩萨的金刚怒目和雷霆手段？</p><p>譬如一个有洁癖的人，与猪关在一起，看见猪在自己的草窝里大小便，这个人忍不住踹了猪一脚，这就是雷霆手段。再譬如心已洁净的菩萨来到五浊恶世，与贪嗔痴众生在一起，看见众生无明深重，造作愚痴业不自觉知，又不受教化，忍不住大声呵责，这就是金刚怒目。有人会问那这样不是让人说菩萨不慈悲吗？其实慈悲不慈悲，从来都不是不由众生下定义，菩萨为众生掏心掏肺，可众生没心没肺，也不识心肺，佛菩萨挨众生骂是免不了的，不挨众生骂在五浊恶世那是不太正常的，否则哪有那些退转菩萨道的人。</p><p>二、菩萨都应明了修行路数</p><p>菩萨对于目前所修法，下一步所修法，以及下下步所修法都是清楚明了的，其智慧可以了知一劫几劫甚至更长时间所应修的法。菩萨既然有智慧，就要对一切法都明明白白的，所有的修行路数都清清楚楚，一步一步如何行持，心里都要清楚。如果不清楚，就是愚痴，那还必须通过修行去除愚痴。每个菩萨都能清楚自己目前处于什么修行层次，什么法成就了，什么法没有成就，下一步需要修什么法，如何修，都清清楚楚。如果不清楚，就是愚痴，当前所应具有的智慧而不具。</p><p>菩萨在开始修行时，临迈腿开步走时，都清楚应该朝向哪个方向开步走，不是稀里糊涂的随便走的，如果随便走，走到邪路都不知道，这样的糊涂人不是菩萨，还没有资格当菩萨。尤其是弘法为人领路的菩萨，心里更是清清楚楚要把众生领向哪里。</p><p>三、菩萨之义</p><p>现在学佛人从自我感觉上分为两类，一类人广学多闻知识多，对于修学信心十足，并有些许慢心贡高，逢人就表白自己不仅是菩萨并且是非一般的菩萨，同参见面寒暄问候都是以某某菩萨开头，互相赞叹一番，内心很满足。另一类人广学多闻不足，知识见识都不够丰富，不知菩萨义，心性有许自卑，不敢称菩萨名，闻有人自称菩萨，以为罪孽不小。</p><p>这两类人都过错，心性都是属于慢，高慢和卑慢都属愚痴。 针对第二类人，我们来说说什么叫作菩萨，譬如说学生这个名号，正在上学和学习的人就叫作学生，包括学各种内容，范围非常规范，甚至都不限制年龄，八十岁也可以叫作学生，只要在学习着；另外有学生证的人更叫作学生了，证就是证明。</p><p>同理，正在走菩萨路，修菩萨行的人，就叫作菩萨；发菩萨心自度并发愿度人的人，就叫作菩萨；学习佛法菩萨法的人，就叫作菩萨；信佛信法信僧的人，就叫作菩萨；皈依三宝的人，就叫作菩萨；修行菩萨六度的人，就叫作菩萨；尤其是受了菩萨戒，有菩萨证的人，发了菩萨的誓愿，有十方诸佛菩萨证明，有了菩萨戒体，就更叫作菩萨了。菩萨包括鬼神、畜生、非人、天人等等所有众生。但不包括定性声闻，不回心大乘的阿罗汉辟支佛们，因为他们没有成佛成菩萨的心，没有利乐众生的心，只想涅槃清净。</p><p>菩萨包括凡夫菩萨和圣贤菩萨，其阶位次第如下：</p><p>（一）信位菩萨，从初信位到十信位，十个阶位都是信位菩萨，都是凡夫菩萨，还没有发心要修菩萨六度，还没有资格和能力修菩萨六度，在培养对佛法的信心。</p><p>（二）住位菩萨，从初住位到第六住位，开始发大菩提心，发心趣向佛道，修行菩萨六度。初住位发心修行布施度，修行圆满，初住位结束，进入二住位；二住位菩萨发心修行持戒度，修行圆满，进入三住位；三住位菩萨发心修行忍辱度，修行圆满进入四住位；四住位菩萨发心修行精进度，修行圆满进入五住位；五住位菩萨发心修行禅定，禅定修行圆满，进入六住位；六住位菩萨发心修行般若度，修行圆满，开悟明心，进入七住位；七住位就是菩萨位永远不退的菩萨，叫作实义菩萨，也是真正的名副其实的菩萨，不仅有菩萨名，也有菩萨的实德。</p><p>（三）行位菩萨，住位十个次第修圆满，进入行位，属于行位菩萨。修行有十个次第，修行圆满进入回向位。</p><p>（四）回向位菩萨，有十个阶位，修行圆满进入初地。</p><p>（五）地位菩萨，初地菩萨在唯识相上见道，转识成智，具有唯识种智，入如来家，成为佛的真佛子。一直修到十地菩萨位，修行圆满，成为等觉菩萨，等觉菩萨之后，如弥勒菩萨一样成为后补佛，也就是妙觉菩萨。</p><p>菩萨的等级，从信位的凡夫菩萨，到贤位的住位菩萨、行位菩萨、回向位菩萨，一直在圣位的十地菩萨、等觉菩萨、妙觉菩萨，一共是五十二个阶位次第。</p><p>每个人自己对号入座，自己是不是菩萨，是哪个阶位的菩萨，应该修什么法，正在修什么法，有没有菩萨的发心，有没有菩萨的戒体，今后应该如何修行。如果你觉得自己连信位的凡夫菩萨都不是，几乎是白丁，那么在这里纯属是浪费光阴。如果你连初住位菩萨的发心都没有，不想修菩萨六度，不想修布施行，那你根本没有一点资格求菩萨的证悟，在这里也是浪费光阴。</p><p>四、菩萨的心行</p><p>菩萨都要修四摄法，爱语同事利乐同行，这样才能有好的众生缘，做什么事都会顺利，如果与众生没有善缘，那就当不好菩萨，度不了众生。世俗界里做事都讲究一个好的缘分，佛法当中更讲究善缘，善缘把大家连在一起，互相帮助，共同进步，自利利人，才能更快的完成菩萨道的修行，从而成就佛道。有意无意的给自己设置障碍，都是无智之人，自己给自己设置绊脚石，自己给自己设置圈套，最后都是自己吃亏和不如意。</p><p>有智者说话做事都会考虑后果，不损害他人的利益和名誉，不自赞毁他，己所不欲勿施于人，这是最起码的做人之道，何况要做菩萨，更要有高于此的法则。菩萨的心行都应该是好事予人，坏事归己，绝对不能颠倒行事，把好事都归自己，坏事都归别人，这就不是菩萨所为了。</p><p>菩萨们之间有事，都要当面鼓对面罗，话讲在当面，有则改之无则加勉，不要背地里两舌挑拨是非。讲是非者容易造下诽谤罪，后果非常不好，有事实说的对叫作有根诽谤，不是事实说错了叫作无根诽谤，最轻的叫作说四众过。四众就是在家男女二众，出家男女二众，其中出家二众又叫作三宝，三宝又分为凡夫三宝和胜义三宝。说四众过和诽谤两种业都不轻，果报很重，希望所有菩萨都能善护口业。有事情当面说清楚，以让对方及时改正，互相监督和扶持。</p><p>所有众生最容易造的业就是口业：妄语、两舌、绮语；恶口，还有挑拨是非、离间、嫉妒、诽谤，也叫作诬陷陷害。戒律里对口业的要求非常严格，因为口业最容易造，造的也最多，还不为人所注意。所以每个人说话时都要想好了再说，不要张口就来，其它的都不管不顾。</p><p>五、佛为什么不去无色界讲法</p><p>无色界天人没有身体，却有意识，有意识就有识阴，虽然有意识，却在禅定中，不能听闻佛法，更不能思惟佛法。如果众生没有身体，就不是人中的人，但却是天界的人，是高级生命。触、作意、受、想、思五遍行心所法，八个识都有，无色界天人也有意识的五遍行心所法，也有意根的五遍行心所法，还有第八识的五遍行心所法。</p><p>佛可以在无色界天给天人讲法，但是色界天人听不到，人间的人听不到，鬼神听不到，无色界天人那么少，又都是外道，成天入定，所以根本没有必要给他们讲法。从另一方面来说，二禅定里就听不见佛法了，何况四禅以上的禅定里，更不能听法和思惟佛法，所以佛不到无色界天讲法。佛讲华严经和地藏经就是在欲界天和色界天讲的，然后再流传到人间。其他经典都在人间讲，这样天人可以下来听法，鬼神和畜生也可以听法，这样度的众生就多了。</p><p>六、为什么诸佛在类似娑婆世界刚成佛时都不愿意留下讲法？</p><p>等你证得了三四果，断除了贪嗔痴烦恼，再看众生时，就会与现在看众生的心境截然不同，很多话你都不会去说了，因为说也没有用，就像大学教授看幼儿园孩子一样，觉得实在不可教。等你成佛时，观芸芸众生，贪嗔痴烦恼一大片，太愚痴了，那时同样会觉得甚深的佛法，讲给这样的众生听，那简直不可想象，还不如对牛弹琴。跟众生层次差不多时，根本不会觉得众生怎么样，一旦脱离那个层次，跳上去往下看，那个心境你们都没法理解，也想象不出来，所以说也没用。诸佛菩萨圣人们是没有知音，很孤独的，众生无法理解，更无法体会圣人的心境。</p><p>七、初地菩萨是否离开了欲界</p><p>大多数菩萨一般都在人间弘法利生，只是禅定各有不同。初地以上菩萨必须具足初禅以上的色界禅定，在人间与众生在一起，少数菩萨在各天界修学和度众生。从禅定的证量和断除烦恼的证量来说，初地以上的菩萨，心都离开了欲界，没有欲界的烦恼和贪着。</p><p>八、诸佛菩萨遇到灾难会如何做</p><p>佛陀遇到琉璃大王领军队灭释迦族人的时候是怎么做的？这次我们学佛人遇到病毒感染灾难，虽然没有像医护人员那样去治病救人，杀死病毒，但是用我们佛教特有的救度众生的方法，比如用念经念佛学法的功德回向，以此推动疫情早日结束，也对国家做出了应有的贡献，也在一定程度上救度了众生。这个程度到底有多大，现在不方便说，只能说这个回向起的作用不算小。那么诸佛菩萨的功德无量，遇到天灾人祸，解决众生的灾难是不是有很多的方便善巧，不用杀生与众生结恶缘的方式，就能化解一切灾难？</p><p>当众生福德智慧不足的时候，解决灾难只能想到杀生和敌对，想不到更好的解决方法。福德智慧足够，一个心念就能化解灾难。所以众生一遇到灾难，自然就会想起诸佛菩萨，因为诸佛菩萨智慧高广，都能不费吹灰之力解决这些问题，只不过要看众生是否有福德受用了。所以每个人还是要努力修行，修行才是硬道理，没有修行永远避免不了造作恶业，然后再受恶报。</p><p>九、佛陀的寿命</p><p>在某些劫里，佛的寿命和众生的寿命都是很长的，按劫计算。一小劫是1680万年，佛的寿命可以示现十二小劫的时间，也可以更长，要看佛在当菩萨时的善业而定，也依众生的业力而定。但这只是示现，佛的实际寿命都是无量寿，可以无限长，没有时间的限制。释迦佛这次在娑婆世界的寿命是八十年，与当时众生百岁的寿命相仿，这由众生的业力决定的，释迦佛可以在娑婆世界住世一劫以上，但是众生无福，不可能感召这样殊胜的果报，佛陀多住世对佛教和众生也无益，所以佛陀随缘示现八十岁寿命。</p><p>    十、佛法上的智慧能离开世间法的智慧吗？</p><p>无明，其义就是不懂，不明了，包括对一切万法的不懂不明了。诸佛断尽一切无明，明了出世间一切法，也明了世间一切法，没有一个法不明了。世俗法中任意一法，去问佛陀，没有佛陀不明了而回答不出来的。所以有世俗法不通达，不会做人做事，就是无明，其佛法也是不通达的。</p><p>诸佛诸地大菩萨，不仅通达佛法，也同时通达世俗法，在世间与众生打交道，都明了众生心，明了世间事，所做抉择不违背世俗而能广度众生，不被众生度。</p><p>在佛法上通达何种程度，相应的就会在世间法上通达到何种程度，佛法与世间法是相辅相成的，没有说离开世间法而能成就佛法的。如果能，那么佛法就与世间法无关，而事实上佛法从来离不开世间法，与世间法紧密相连。佛法能有效的指导世间法，如果有人在佛法上的智慧很高，却在世间法上处处碰壁，那就说明此人佛法上并不通达，没有真正的佛法上的智慧，所谓的智慧只不过是乾慧罢了。</p><p>诸地大菩萨直至佛陀，都可以在世间做宰官大臣君主，以及转轮圣王和各层天的天主，世间法必然通达，否则如何做君主转轮圣王和天主？如何管理治理众生俗界事务？如何服众统领大众？</p><p>智慧是相通的，佛法上的智慧不可能离开世间法的智慧而单独存在，佛法要在世间法上践行，世间法上践行不通，说明佛法也没有通，以至于不能应用于世间法上。佛法上证量都要通过在世间法上的身口意行来体现出来，身口意行没有转变清净，处理事情不圆满，说明此人道行还不行，定力福德力和智慧力都不足，所以没有离开世间法而能显现的佛法。</p><p>十一、念佛法门中的他励具体是指什么？</p><p>他励是指外在因缘的鼓励和激励，可以说是佛的加持力。尤其是念佛的时候，念佛就会感应到佛，佛有感就会知道念佛人的心念和心愿，对念佛人起加持功用，帮助念佛人提升道力。</p><p>佛菩萨的加持一般表现在，成熟众生的五根和五力，五根包括信根、念根、精进根、定根和慧根，依此五根就会生出五力，众生在五种力量的作用之下，道业不断进步，心得清净，就会有所收获，有所成就。</p><p>十二、为什么过去的祖师大德们讲法一般都不引经据典？</p><p>过去的祖师大德都是真有修为、真有修证、真有德行之真开悟菩萨，因此讲法时只讲自己的智慧见地，不求甚解，也没有隐覆，如实而说，如理而论。如果偶尔引经据典，一是为因缘不熟、信根智慧不足者，二是法义深时用佛经作以辅助说明。</p><p>从另一方面来说，古时学人善根比较深厚，福德禅定智慧都比较好，信根足，有择法眼，对于祖师开示有正确的抉择力和信受力。因此祖师菩萨们讲法就会放心的讲自己的智慧证量所知，没有后顾之忧。如今的众生善根轻少，福德禅定智慧都短缺，信根不足，缺少择法眼，很多人听骗不听劝，所以讲法时就要多引经据典来起信。另一方面如果讲法者修行时劫短，没有真实的智慧证量，法义还没有通达，就不得不引经据典。即使引经据典，一是众生不能如实理解，二是讲法者也没有贯通经典，所以仍然免不了误解误会。这是众生的业力所感，业重福薄，修行道路就曲折，进进退退，不知何时是了期。</p><p>十三、雌雄同体的境界</p><p>身心相倚，互相影响，如果意识出现障碍，一定是胜义根出现问题了，胜义根的问题，一是先天业种缘熟现行，业报出现了；一是后天因素使得胜义根出现障碍。跳出身外看色身，整个是一个需要不断填加润滑油才能工作的机器人，真的没有什么可值得贪爱的。一个高尚的有德行的灵魂，比色身价值高太多了，一个有智慧的灵魂比色身的价值高得无计其数。所以我们都应该追求高层次的心灵，追求心灵的智慧和解脱。</p><p>而高层次的心灵一定是转识成智了，定慧具足，足以改变色身，让色身具足相好庄严，既有男相的优点，也有女相的优点，在外貌上既有男性特征，也有女性特征，能把男相和女相完美的融合到一起，达到雌雄同体。禅定功夫可以修出雌雄同体，色身无漏，不需要依赖异性去补充和弥补自身的不足。这样人格独立，自身就会越来越完美，将来可以莲花化生。有初禅以上的禅定，就会知道初步的雌雄同体是怎么回事，但初禅定还不够，还需要长时间的熏修，甚至是长劫的熏修。</p><p>这是从禅定和色身角度论述的雌雄同体，最根本的雌雄同体是指精神上的心灵上的，在精神、毅力、性格、气质、风度、人格、修养、品行等等方面，既具足男性的优点和智慧，也具足女性的优点和智慧，不需要依赖异性去弥补其心志上的不足，因为自己本身具有双重性，已经完美或者接近于完美，优于世人。大菩萨们一般都是雌雄同体，两个性别的优点都具备，包括智慧和身体相貌。佛菩萨在相貌上无法分辨出是男是女，在智慧方面男女都一样，所以称作大丈夫。</p><p>色界天人的相貌不分男女，都有初禅以上的禅定，极乐世界和好多佛国土的人也都不分男女，没有性别之分，色身永远年轻，这是禅定、福德和智慧所感召的果报。没有性别之分的时候，相处起来特别自在，没有违和感，也没有是非，没有烦恼情绪，感觉舒服自在自然。而两个性别在一起相处时，麻烦事多，浪费很多精力和心力。</p></div>"
},{
    "title": "第三章 性障和烦恼篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  性障和烦恼篇</strong></p><p>一、烦恼是禅定发起的最大障碍</p><p>性障烦恼轻微的人，身体素质好的人，气脉运行通畅，容易发动气机，身心轻安愉悦，从而生出禅定。烦恼多的人不容易有愉悦感和身心轻安感，气脉不顺畅，气机发动不起来，禅定不容易出现，即使欲界禅定也不容易生起，色界禅定就更困难了。</p><p>修行还不能上路的人，应该多检查反观自心的烦恼，并且尽量加以降伏和克服。烦恼表现在日常生活中的方方面面，如心量小，心胸狭窄，执拗认死理，见识短浅愚痴，无理辩三分得理不饶人，好斗好争，喜欢争论家长里短小事，喜欢攀比，心机多，造谣生事，妄语两舌恶口，口业、是非心重，好出风头，好表现自我，喜欢权势名利，贪得心重，喜欢追逐财物，嗔恚心重，不舍嗔恼，哀怨不已等等。众生烦恼真是数不尽之多，但无论怎样，想要离苦，不管什么烦恼都要努力降伏和断除，这样修道才有希望。</p><p>二、如何降伏嗔心</p><p>嗔恚心重，有先天性的，生来就是如此，有后天环境熏染的，如身体不健康的原因导致的嗔心重，遇事不顺等等心理情绪方面原因导致的。单纯的后天因素导致的嗔恚心重，就要调整色身和心理情绪，这些障碍消失了，嗔恚心自然就轻微了。对于先天性的嗔恚，遇人遇事处理问题要注意从对方立场来考虑，多站在对方的角度来看待问题，多理解对方，尽量为对方找理由，场景置换，将心比心，这样就会理解和原谅对方。多考虑他人的不容易，多怜悯他人，嗔恚自然就少了轻了。</p><p>每当生起嗔恚的时候，就要仔细观察自己嗔恚的原因和理由，分析其中的原因，找出问题所在，发现自己有不如理的作意和思想观念，就要降伏和克服。如果发现自己我性重，就要思惟五阴无我之理，降伏我性，嗔心就会减少了；如果是太挑剔对方和环境，就要看空所遇人事。每当嗔恚习性现前的时候，心里要知道这是烦恼习气，是不如法的，是要有嗔恚的果报的，久之嗔必减轻减少。</p><p>三、如何才能减少苦恼</p><p>在断烦恼以后，心就会寂静下来，没有那么多烦恼和苦恼了。断我见之后有了初禅定，贪欲嗔恚就会断除，再加初果断除的我见、禁戒取见和疑见三缚结，五下分结断除，人就能自在一些了，但没有四果自在，四果断我慢和我执，几乎一身轻了。</p><p>得寂静自在的菩萨也叫菩萨三果人，过了禅宗三关，有资格入初地，在七地菩萨之前都是三果人，不取四果阿罗汉的果位，留一丝烦恼以留在三界。八地菩萨全部烦恼断尽，我执断尽，法执断除大部分。菩萨三果人再来人间时，烦恼很轻微，虽能受环境熏染，也可能会造一些恶业，但是恶业也非常轻微。学佛以后，一忏悔就消除了，或者明理就消除了，不用忏悔，因为没有根本烦恼心。</p><p>三四果以上的圣人，几乎不愿意与众人混在一起，独处时候多，只有度众生讲法的时候才与众生在一起。过去的大菩萨都是先独处把自己修持出来，然后才出来说法度众生，如果感觉定力不足了，明显慧多定少，就会再独处修行以增进道业，之后再回到众生中说法。就这样一段时间自修一段时间度众生，不是总与众生在一起，如果总与众生在一起，定力会退失，修行会被众生拉回去一部分，道力就不足。</p><p>四、慢心最障道</p><p>学佛路上总会遇到许多沟沟坎坎，暂时越不过去，那都没关系，只要坚持下去，不断努力，最终都能越过知见之坎。只要不认为自己所解都对，内心谦虚，多作观行，仔细思考，并且多忏悔业障，道业就能增进。就怕慢心，慢心是最障道的，而自己还不知道自己有慢心，这就麻烦了。</p><p>当自己的嫉妒心生起的时候，回光返照，分析观察自己因何嫉妒？慢心生起的时候，回光返照，因何会生起这样的慢心？找到原因以后，就要用所学之理说服劝导自己，降伏嫉妒心和慢心。在证果和初禅定之前，只能降伏，不能断除嫉妒心和慢心这些烦恼。一般人生起嫉妒心是因为别人抢了自己的风头，自己那个我没有突出出来，自己没有得到希望中的利益。心中有我有人，才会互相比较，不希望任何人强于自己、比自己好。</p><p>因嫉妒心，任何一个团体都有是是非非，互相排挤打压，互相争夺势力资源，斗争是不可避免的。在三宝团体里，如果不降伏这种嫉妒心，就容易分裂僧团，如果导致僧团分裂，那就是无间地狱罪。</p><p>烦恼这些事，只有证果之后，初禅定出现，成为三果圣人之后，才能断除微细的烦恼，先断贪欲，再断嗔恚，四果断除我执我慢。初果二果人只是降伏烦恼，粗重烦恼不现起，微细烦恼偶尔也会出现。在断我见之前的凡夫位，只能压伏烦恼，有时也压不住。有初禅以上禅定的人，也能够压伏烦恼降伏烦恼，但不能断除烦恼。四果阿罗汉烦恼虽然断除了，但是习气偶尔也会现行出来，有时控制不住，有时也不觉知，需要别人提醒。</p><p>五、烦恼消福德</p><p>知道一言一行，无论善恶皆有业报，说话做事就应该小心谨慎，谨言慎行，不要只在意自己，不管他人。平常为人处事的时候，贪嗔我慢嫉妒，能收敛就收敛，不要算计人，不要用心机排挤这个排挤那个，多为别人着想，多为所处的各个团体着想，为大局着想，心地要厚道，这样一是能消除性障和业障，二是能增加福德。如果心地不清净，而造了染污业，就会消耗很多福德，福德不足了，做什么事也不成就，无论世间上的事，还是修行上的事，无论好事还是坏事，没有福德支撑，一律不成就。</p><p>对于福德比自己大的，智慧禅定比自己深的，戒律比自己守持得好的，各方面能力比自己强的，要心悦诚服，最起码要尊重，不能心生嫉妒心，如果言行有所冲撞，就会消耗不少福德，最后吃亏的是自己。对于不如自己弱于自己的，要心生怜悯，多给与帮助和提携爱护，不能起慢心和欺凌心，这样就会增加自己的福德和慈悲心。</p><p>六、不断烦恼不能证菩提</p><p>佛在菩提树下刚刚成道时说：<strong>“奇哉！奇哉！大地众生皆有如来智慧德相，只因烦恼妄想而不能证得。”佛在大方广如来藏经中说：“佛见众生。如来藏已。欲令开敷。为说经法。除灭烦恼。显现佛性。”“但彼众生。烦恼覆故。如来出世。广为说法。除灭尘劳。净一切智。”“我以佛眼。如实观之。以善方便。随应说法。灭除烦恼。开佛知见。普为世间。施作佛事。”</strong></p><p><strong>“我以佛眼。观诸众生。烦恼糠糩。覆蔽如来。无量知见。故以方便。如应说法。令除烦恼。净一切智。于诸世间。为最正觉。”“我见众生。种种烦恼。长夜流转。生死无量。如来妙藏。在其身内。俨然清净。如我无异。是故佛为。众生说法。断除烦恼。净如来智。转复化导。一切世间。”“如来观察。一切众生。佛藏在身。众相具足。如是观已。广为显说。彼诸众生。得息清凉。以金刚慧。捶破烦恼。开净佛身。如出金像。”  </strong></p><p>以上佛所说，显示出众生是由于烦恼的遮障，而不能见到自己的如来清净宝藏如来藏，需要断除烦恼，消除遮障，如来藏才能显发出来，众生智眼清净才能证得自性清净如来藏。由此可见，我们学佛修行如果不能降伏和断除粗重的烦恼障碍，心不得清净，是不能证得如来藏的，也不能断除我见。如果没有烦恼，心清如水，众生就会只见世间的如来藏性，和一真法界，不会见世间相，认世间相为真为我相和我所相，就没有我执和法执，众生本然解脱，本然是佛，不用学佛修行。</p><p>断我见的深浅与断除烦恼的程度有必然的关系，明心的智慧程度同样与断除烦恼的层次有必然的关系，烦恼断除的越多越深，断我见和明心的智慧越深，果位越高。如果众生学佛只管学理论知识，不管自己的烦恼，认烦恼现行而不想法除灭，就不能有大小乘的见道，只能继续作俱缚凡夫，生死流转不息。所以那些所谓证果和明心的人，如果烦恼还是很深重，毫无疑问并没有证果和明心，只不过有个假名罢了，不值得大众学习和效仿。</p><p>七、学佛的目的</p><p>学习佛法究竟目的就是断尽无明烦恼，烦恼断尽就是无学，也就无需再学习佛法了。小乘的无学位是四果大阿罗汉和缘觉辟支佛，大乘的无学位是佛世尊。小乘无学只是在解脱三界生死上断尽一念无明而无学，还没有断尽一切无明烦恼，所以还是有学。大乘不仅要断尽一念无明，无始无明都要全部断尽才是无学。只要有无明，就是有学，无无明就没有可学的了，都懂得了，都证得了，学习就结束。</p><p>小乘尊者四果阿罗汉周利盘陀伽，因为前世业障，虽然证得了四果阿罗汉，却不会讲法，虽然不会讲法，一念无明断尽，烦恼断尽，能出离三界得解脱，是无学圣者，不用再学四圣谛解脱之理。而大乘无学佛世尊，断尽一切无明，所有佛法张口就来，全部都能宣讲。菩萨们也都会讲法，因为菩萨不离众生，与众生在一起，必然要讲法。因为讲法就聚集了极大的福德，所以菩萨比阿罗汉更善于讲法，更有福德，甚至最初学佛的菩萨即使不懂佛法，也要讲法，讲的不伦不类，自己都不知所云。</p><p>学佛学法的目的明确了以后，我们学佛就不要四处炫耀佛法知识，学知识掌握知识不是目的，是断除烦恼的手段，烦恼断除了，一切知识就都没有用了，除了度众生讲法用得到。所以在学佛过程中，观察自己的无明烦恼，降伏烦恼，断除烦恼是非常重要的，佛学知识就显得不那么重要了。我们就不要本末倒置，不管自己的烦恼，到处学知识。即使知识学得五大车，一旦因为烦恼造作一个恶业，重者无间地狱，轻者畜生道，佛学知识能拯救自己否？带着丰厚的知识去三恶道，还有炫耀的机会和心情吗？</p><p>八、在观行中如何断除淫欲</p><p>在证果之前，淫欲只能降伏和压伏，不能断除，降伏淫欲一是依靠禅定的力量，有禅定身心轻安，内心充盈，念头少，如果修炼到精气满满的，就不再思念淫欲了；二是如理思惟淫欲的种种生死过患，和淫欲的不净，就能减轻淫欲念头；三是转移注意力，把精力用在最有意义的事情上，不给自己闲余时间，欲念就减淡了；四是远离不清净的环境场所，创造清净的修行场所；五是天天念楞严咒，依靠佛菩萨和护法神的加持力，来降伏淫欲。</p><p>九、什么是心解脱</p><p>心解脱是心无烦恼系缚，无烦恼则无苦，无苦则心解脱。苦分为身苦和心苦，身苦不算苦，心苦才真苦。只要心不苦，就是解脱。同样身有苦，不把身苦当回事，心就不苦解脱，如果觉得身苦真苦，心就苦，不得解脱。自愿承受身苦，认为身苦无所谓，或者是有某种意义，必须承受，则心不苦，甚至还会乐。如果是被迫受身苦，不是自愿，则心也苦。苦与不苦在心不在身，在于心对苦的认识，心在意就苦，不在意就无苦。于苦无苦则心解脱，于苦而苦则系缚。</p><p>阿罗汉天天托钵挨家乞食，不觉苦，凡夫做顿饭就抱怨，富楼那乞食不得食牛粪不觉苦，心解脱，富人天天山珍海味，心不乐，烦恼系缚严重。既然苦乐因人而异，则苦乐无定法，既然无定法，则虚妄、无常、空，则苦乐无我。</p><p>十、心不净则相不净</p><p>维摩诘经中说：随其心净则佛国土净。心不净则佛国土也不净，因为见不清净，相就不清净，国土怎么能清净？心不清净如何能有清净的佛国土？确实是只有心清净了，见才能清净，见清净了，相才能清净。凡夫众生心不清净，见就不清净，所见相就不能清净。所以众生见佛，也会把佛看作是和自己一样的有贪嗔痴烦恼，也会挑剔出佛的种种不是，见佛的清净行为污秽行。比如一外道女在佛法会上听法，每次都最后离开，早晨又第一个到法会上，让大家误会此女与佛陀住在一起，几个月后又拿木盆放在肚子上假装怀孕，大家见了，都认为佛陀确实与此女有染，议论纷纷。后来四天王看不下去了，变个老鼠把木盆咬坏掉了出来，大家才恍然大悟。</p><p>如果众生真正了解佛陀，相信佛陀，能有异心怀疑佛陀吗？说到底还是众生内心肮脏污秽，自认为佛陀会做出此事。那些心地清净的弟子，都不会对佛陀有任何异议和不恭，都完全彻底相信佛陀的清净。众生心是什么样的，就会认什么样的相，不会超出自己心的认知范围，所以心染污的人不相信会有人心地非常清净，与自己的行为看法不一致，于是遇事就起疑，甚至都不用起疑，直接确认对方的不是。从这个事例当中，就看出来了众生的心确实是污秽肮脏的，没有正知见的。</p><p>心清净的人遇见事情，不了了之就过去了，不作念想，心不清净的人，种种揣测，种种知见，种种疑虑横亘在胸中，不肯放下，是非风起，矛盾重重。所以世俗界里天天乱七八糟，没有安宁时日。从家庭到社会大大小小各个团体，都是如此，原因就是因为众生的心太肮脏，染污太严重，误会太多，是非就非常多。</p><p>十一、净心才能净土</p><p>一切法生灭无常苦空，一切法如幻如化，一切法如梦如露，一切法如风如影，一切法如泡如沫，无论你怎样的执和取，最后还是空，空，空，除了空就是空。莫不如闲庭静坐，且看风云起，看一切法来，观一切法去；看一切法起，观一切法落；看一切法生，观一切法灭。但你心不要随一切法生随一切法灭，不要随一切法来随一切法去，不要执不要取任何一个法。一切法是一切法，你是你，一切法本不是一切法，所以你要心空。</p><p>娑婆世界有人之处，就有事，有事就有非事，事事非非对于凡夫来说本是正常事，如果觉得不正常，不应该有事事非非，那你就不是凡夫了。凡夫看事事非非就是事事非非，心空之人见事事非非即非事事非非，或见事事非非生灭变异无常苦空，或见事事非非如幻如化，或见事事非非如影如响，或见事事非非如梦如露，或见事事非非即是菩提，或见事事非非即是道，或见事事非非即是真如，或见事事非非即是佛性。这样的话，哪里还有事事与非非？哪里还有祸乱？</p><p>世界本太平，你心不太平，一切法就不太平了，世界大乱由你心而起，你就要对世界大乱负责任，而你搅起了世界大乱，根本就负不起责任，怎么办？修行！净心！灭心的贪嗔痴，灭心的多事，灭心的事非，灭心上的相，灭心的执取，这样还有什么事与非？世界是不是安静了？太平了？空了？净你的心，就净化了一切法，净化了世界，净化了众生，这样是不是度了众生？成就了净土？这就是修行，这就是修行的结果，这就是修行的功德，还求什么？执什么？取什么？</p><p> 十二、戒定慧三无漏学的功用</p><p>漏是指贪嗔痴烦恼漏、种种无明漏，漏掉的是善法、善愿、善心、善根，心善能脱离轮回苦，心善能成就佛道。漏掉善法，就是恶不善法，生死轮回苦不能断，因此就要通过修行达到心地的无漏，去除无明。实现心地的无漏主要有三条渠道，那就是戒定慧三无漏学，通过持戒使心无漏，通过修定使心无漏，通过修慧使心无漏。</p><p>持戒为何能使心无漏？因为能持戒，心就不会违越戒律，不能作恶，不能造作贪嗔痴无漏烦恼业，时间长习惯了以后，心自然就不再想造作恶业了，烦恼就得到了降伏，善法就得到增长，四正勤就修出来了。长期持戒，心得到有效的收摄，不再处处攀缘，禅定就出现了。</p><p>禅定为何能使心无漏？因为心在定中无所作为，不攀缘不散乱，不造作贪嗔痴染污业，就把烦恼降伏下来了，出定之后由于惯性作用，定力也能保持在一定程度，不喜攀缘，心安而不乱造作，仍然能够降伏烦恼。如果未到地定具足，就能断除欲界五品烦恼，成为初果向，现世就有因缘条件证入初果。</p><p>外道们的四禅八定定力更强，不但能降伏欲界九品烦恼惑，也能降伏色界九品烦恼惑，乃至于能够降伏无色界九品烦恼惑，这种降伏不等于断除和断尽，因为还缺少五蕴无我的智慧，如果遇到四圣谛理，依甚深的禅定力，敛念稍一思惟就能证道，烦恼断尽，身心脱落，当证得四果阿罗汉时，须发就会自然脱落，袈裟著身，代表烦恼断尽，自然就是出家人。</p><p>三果以前以为还有烦恼残留，就不能须发自落，袈裟著身，也就不能自然成为出家人。所以如果是在家身的人想不用通过受比丘戒和比丘尼戒，就要成为出家人的话，就要断尽烦恼，须发自落，袈裟著身，不用人剃度，在家身只要有一丝烦恼就是在家人，如果非要说自己是出家人那就是强行盗取出家僧宝身份，混淆僧俗，属于极重罪。</p><p>智慧为何能使心无漏？证得无我的四圣谛理和大乘真理的智慧能破除无明，心中无我就不会再为我而造作，不为我就无私，无私就是善，善能破烦恼，心就无漏，有我即有罪，有我即有烦恼，有我就漏掉善法。这个无漏慧是以戒和定为基础的真慧，没有戒定的慧就是乾慧，没有实用价值。戒定慧三者统一在一起，共同断尽一切烦恼，善法永不再漏却，当善法圆满具足之后，就成佛了。</p><p>十三、什么是道</p><p>问：什么是道？禅师答：吃饭睡觉。问：我也吃饭睡觉，与道有什么不同？禅师答：你吃饭时不好好吃，百种求索，睡觉时不好好睡，种种挑剔，这是贪求色香味触，非修道也。</p><p>在生活中修道是像祖师们那样修的，不是像某些烦恼具足的人所说的，要融入生活当中去，与色声香味触打成一片，被贪嗔痴烦恼所度，结果跳不出五欲羁绊。烦恼具足的人讲法，处处不离烦恼，自己有烦恼，不会教人出离烦恼解脱烦恼，而是希望别人与自己一样的烦恼。他没有解脱烦恼的经验，没有出离烦恼的经历，不可能如法教导他人一步步脱离烦恼深渊，他也不认为烦恼是深渊，贪着享受的缘故。</p><p>有些讲法者也有意无意的灌输一些世俗烦恼，比如灌输如何顶天立地、出人头地，为人处事如何圆滑巧辩、自赞毁他，如何容忍男女欲求和嗔恚争斗，诱导众生种种贪取，甚至教授辩论的话术技巧和诡辩。在佛教里搞的这些世俗烦恼事，最终就会引领和趣向三恶道，受苦无量，难有出期。所以真想好好修道，就要多学学古修道人禅师和祖师们的风范，学学他们的在日常生活中的清心寡欲，学学他们质直无伪、淡泊名利、志气高远、一心为道的道人心。</p><p>现代人不用教导，本来烦恼就重，加之社会生活环境和习俗的熏染，心地染污很厉害，每天都在周遍驰求，六根对六尘色声香味触法，无一法不求，无一法不取，五盖的遮障极重。如果此生真想有一个突破，就应该及早觉悟，时时处处反观自心的烦恼所在，每当有所索求的时候都要心念：我在驰求，我在周遍驰求。不周遍驰求是什么样子的？像古修行人的样子：山中修道，日中一食，少欲知足，心常安乐，除此都有驰求的性质。</p><p>十四、重大渗漏是根据追求的时间长短来判定的吗？</p><p>有人说：想要断掉欲界爱需要花很多时间，而且还有一个很重的造作相，这就是重大渗漏，一个人贪心很重结婚就能解决了，结婚需要的时间短，属于轻微的渗漏，花很多时间去追求的就是重大渗漏，花短时间追求的就是轻微渗漏。此人说法扭曲事实，严重违背佛教四圣谛理和解脱之理。</p><p>如果说花很多时间去追求就是重大渗漏，那么凡夫花三大阿僧祇劫的时间去追求成佛，是不是重大渗漏？如果断除欲界爱是重大渗漏，难道说无量劫保有欲界爱，以至于无始劫以来都在六道里造作无量贪嗔痴烦恼业，受无量生死苦就不是重大渗漏了？解决贪欲心的方法就是结婚，而不是观行苦空无常无我得解脱？难道结婚是解决欲界爱的方法？那么解决嗔心的方法该是什么？是不是应该在一瞬间把嗔恨的人杀了，从此就没有嗔心了？</p><p>凡夫花一瞬间去杀人，所花的时间非常短，这就不是重大渗漏了？顺从贪爱烦恼就不是重大渗漏？这样说来，佛陀到烦恼深重的娑婆世界来讲解脱法是不是没有什么意义了，众生顺从烦恼欲求就解脱了？渗漏重大与否是根据所花的时间来衡量的，还是根据烦恼轻重来衡量的？花极短时间贪欲，难道就不是重大渗漏？解决贪欲的方法就是结婚？解决嗔恚的方法就是杀人？谁不知道结婚正是贪欲的表现，无始劫来众生做人的时候生生世世都结婚，还不是一直都贪欲着？为了这个贪欲生生世世受苦无量，这不是很明显的事实吗？</p><p>看来此人并不真正信受佛法，却高座说法充当善知识，教导众生尽管顺从贪欲，顺从贪嗔痴，怎么享受怎么来，不要修学苦集灭道，不要断除贪欲嗔恚，因为那要花费大量时间，得不偿失，及时行乐为好。是可忍孰不忍，如果是外道们这样说也就算了，毕竟是外道，可是这是个自称善知识和真善知识的人，是个讲解脱道理的人，这明显是想把众生都按在六道里陪自己一起贪欲。每个人所造作的不善业，都是搬起石头砸自己的脚，仰天吐口水都落到自己的脸上。古人一字之差堕入野狐身，此人差错极大极多，果报该如何？</p><p>十五、修定和除五盖是否是有渗漏法</p><p>有人说打坐修定和修除五盖都是取相分别，是与外道相同的修行方法，这是属于主修不了义法，因此不能发起真如三昧，应该当成重大渗漏来处理，应该弃舍掉，不要修。这个观点非常邪乎，严重违背佛教和菩萨教，简直不是佛弟子所应该说的话，这样的知见表明此人根本不懂修道的主要内容，不知道究竟应该修什么和如何修，不知修道次第和过程，不知修道的过渡，又不能直达修行的结果和最终目标，结果什么道也没有，一无所是，空口高谈，腹中空空。</p><p>如果修定和修除五盖是取相分别，修学佛法更是取相分别。如果不取相分别，就连佛法也不应该学，连善法也不用修，不要修四念处、三十七道品、菩萨六度以及戒定慧三学。学佛本身就是在取相分别，要不然为什么不去学气功和基督教？为什么不到基督教堂里去讲法？为什么不成天睡大觉而去工作？什么人能不取相分别？除了佛和如来藏，但是佛度众生是不是取相分别？为声闻人讲四圣谛，为辟支佛讲十二因缘，为菩萨讲六度万行，这些是不是取相分别？不为初基众生讲唯识是不是取相分别？佛陀不把僧团的领导权交给提婆达多是不是取相分别？佛陀舍弃王位、妻和子出家修道是不是取相分别？山中日食一麻一麦是不是取相分别？在鹿野苑度五比丘是不是取相分别？</p><p>除了如来藏，众生和佛都避免不了取相分别。如果取相分别都是渗漏的话，细菌的取相分别最轻微，几乎分别不了什么，没法取那么多的相，因为极度愚痴的缘故，难道说人比细菌的渗漏更多更大？种种取舍就是取相分别，在世俗界和所有佛国土都离不开取舍，没有不作取舍的人，包括诸佛菩萨，只是要如何取舍，涉及到取什么舍什么的问题，善于取舍和分别是极大的智慧，无智慧就无法正确的取舍和分别。</p><p>发起真如三昧，一是纯属禅定性质的三昧，一是禅定加般若智慧的真如三昧，离开禅定任何一点点的三昧都不存在。打坐修定和除五盖是佛所讲的修道必修之法，无论大小乘学人都不能越过不修，不修定就不能证道，不除五盖就不能断除无明烦恼，倡导不修禅定不除五盖，难道是想与佛对立违逆佛陀和佛法，还是认为自己比佛更高明更懂修道？难道希望一直带着散乱心肤浅的思惟推理，带着五盖和一切烦恼无明去成佛？</p><p>如果佛所规定必须修的法是有渗漏的法，那么什么法没有渗漏？如来藏没有渗漏，可你的七识和五阴是如来藏否？如来藏能代表五阴七识否？七识和五阴的渗漏如何处理？用肤浅的散乱心情思意解能处理这么多、这么大的烦恼渗漏？末法时期世俗界和佛教里怪人和怪事相当多，简直超出了人的想象力，就这样还有那么多人追捧，不知道图个什么，岁月如梭，转瞬即逝，还是依法不要再依人了吧？</p><p>十六、熏染的力量</p><p>众生之间有互相熏染的作用，你跟什么人在一起，不知不觉地就会被他的习气、性格、秉性、善恶心行等等熏染了，如果一个人养狗，总跟狗在一起，狗有狗的习性，人有人的习性，时间长了，总看狗的眼神儿、动作、饮食和行走坐卧习惯，不知不觉地会被狗的习性、心性熏染了，而自己并不觉知，就连外貌也可能会非常不明显的被熏染。但是狗更能被人熏染，因为人的力量要强于狗，在互相熏染中狗受的熏染更多更重，所以狗的习性与人接近，在后世容易投胎人身，得人身后，就善解人意，聪明伶俐。</p><p>狗被人熏当然是好事，人被狗熏会是什么结果？物以类聚，人总看狗，外貌也会悄悄的改变，不容易觉察到，今世虽然不改变或者改变一点点，后世熏染的种子成熟时就要改变了。如果你习惯于和狗在一起了，感情深，关系还非常亲密，到了中阴身的时候，就会变现出狗的境界，你就会不知不觉的随着狗去了，投到狗胎里了。</p><p>比如说你总和一个口吃的人在一起，那个人说话不利索结结巴巴的，你一开始虽然觉得无所谓，你也不会变成结巴，可时间长了说话就有障碍了，时间越长障碍就越大，这是慢慢的被熏过去了。被熏的方面有相貌、说话的方式、口气、习惯，包括饮食习惯、行走和坐卧习惯。</p><p>我们现在这个修行阶段很容易被熏，恶法要比善法容易熏成，因为我们的心都是烦恼远远大于善，习惯于烦恼而不习惯于善，对于善法有抵制的情绪，对于恶法反倒容易接纳。比如在人群中遇到说人是非的时候就容易感兴趣，并且也参与进去是非纷争，遇到赞叹他人善处的时候，都不愿意跟随，往往就闭口不说了，与自己关系好的人和自己用得到的人例外，落井下石者常有，雪中送炭者稀有。所以要想修行改变自己，就要选择与善人靠近，远离烦恼重的人，是非之人是非之地都要远离，这样心才会逐渐靠拢于善，远离于恶，烦恼就能得到降伏，不容易造作烦恼业，不留下恶业的种子，后世就轻松，没有烦恼障碍。</p><p>十七、修学如来藏法门有什么意义</p><p>一切佛法的修学，都是为了证得我空和法空，灭除七识的我见、法见和我执法执，消除七识的无明烦恼惑。每个人心里一定要明确这个目标指向，这样修学佛法修学如来藏法才有意义，否则就成了一门学问，修行与学问打成了两截，导致学问是学问，修行是修行，两者不相干。我们应该清楚这点，学问不能断除无明烦恼，还会徒增烦恼和系缚，甚至增加无明生死惑业。</p><p>为什么会出现学问与修行成为两截的现象？根本问题在于缺少禅定和如实观行，缺少与身心世界的对号与联系，其中一个错误观点认为菩萨不断烦恼就是问题的直接根源。由于修行目的不明确，导致学问虽然累积起来了却没有实义。修学如来藏法就是用来断除烦恼的，只要方向方法对路了，烦恼就会一点点消融，想不断也会不知不觉断了。如果方向方法错了，知识学问可以不断增加，而烦恼却不会减少，甚至还有可能烦恼会随着学问的增长而增长，这样学法真是错会了，颠倒了。</p><p>众生由于历劫处于无明烦恼中，导致六道生死轮回种种苦难不断，菩萨是众生中的一份子，同样也是由于无明烦恼而生死轮回，同样需要修行断除无明烦恼，断除生死结缚离苦得乐。只有自身断除了无明烦恼，才有资格当菩萨引导大众也断除无明烦恼，离苦得乐，走向解脱。如果一个菩萨处在烦恼深渊中，怎么能有能力和资格引导众生走出烦恼深渊？</p><p>所以菩萨不用断烦恼也不要断烦恼，这个观点是极其害人的，不断烦恼还要学佛修行干什么？度众生而不让众生断烦恼，那要把众生度成什么样？难道众生一个个都成为学问知识的收集者，成为理论行家才是最终的归宿吗？知识理论学问能抵挡得住生死吗？能当福德当饭吃吗？有烦恼就无德，既没福德也没功德，无福德无功德的众生，就是生死业障凡夫，那还谈什么修行和度众生？</p><p>那些学如来藏法的人，把如来藏分析意解得清清楚楚，可是自身却没有一丝受益，烦恼仍然如故，智慧仍然浅薄，结缚仍然系缚着自心，这样修学到最后都是徒劳无功。不管如来藏如何清净，如何无我，如何具足一切戒定慧，五阴七识不清净，不能无我，没有戒定慧，照样无福无慧，苦恼无边，解脱无望，如来藏照样会把五阴七识变生在三恶道中受苦，在六道苦海里头出头没。</p><p>所以修学一定要如理如法如律，不能偏离正确的目标和航线，要用佛陀的戒律严格要求自己，要严格按照佛所说的戒定慧三无漏学准则去修学，目标是心地无漏，无漏就是要无无明无烦恼，这样才是正确的修行之道，不要再说菩萨不断烦恼了，这是邪见，与修行背道而驰。</p><p>十八、为什么很多人过得很快乐不觉苦？</p><p>众生无始劫漂浮在苦海里早已经习惯了，从来没有享受到真正的乐，没有对比也就没有知觉和觉悟。众生越愚痴越不知苦，也不知自己的愚痴，往往就会以苦为乐。能知苦是修道人的觉悟，修道人的觉悟极大多数又都是佛陀教导出来的。只要知苦了，就会慕灭而修道，早晚有一天就会断尽苦集，从而了脱生死，得到解脱。愚痴是所有烦恼中最重的，愚痴人也是最难度化的，一切教理不进，一切言语不懂，一切劝导无用，一切方便方法手段休废，犹如一块顽石，盐酱不进。由于愚痴其它的烦恼也少，妄想也少，念头也少，更不知出离。人中这样的人，如果修定，也许会很快入欲界定中，没有了杂念，再深的禅定就不能有了，因为愚痴烦恼重，与上界不相应。</p><p>十九、如何才能觉悟自心的心念  </p><p>如果想了解自己，想知道自己的心念究竟是善的还是恶的，是染污的还是清净的，应该如何做呢？为什么很多人能持续不断的随顺自己的染污心行、烦恼心行，去造作染污业行呢？是因为没有觉悟性，没有觉察力，不知道也不考虑自己每个心行心念的结果是什么，会有什么果报，只想把情绪发泄出去，心里感觉舒服就满足了，至于以后可能会非常不舒服极其不舒服，那就管不了了，这就是众生的愚痴无明和短视。</p><p>如何才能觉悟到自己的心行心念？首先要信受因果，然后要明了因果，知一切身口意行都有因果，因缘成熟时一定会受善恶果报，自己对人对事所做的一切最终都要自己来承受，作善受善报，作恶受恶报，这是逃不掉的因果律则。这样的话就会有意的关注自己的身口意行了，但是因为定力和慧力不足，往往还会习惯性造作不善的身口意行，而不自觉知。</p><p> 这就要修定补足定力，提高反观力，让心细致一些，观察力敏锐一些，随时能捕捉自己的心念，并且能够观察到内心最深处的心思和想法，或者是烦恼念头。这样就能做到深透的了解自己。即使不能很快改正不善的心念，不能降伏自己的烦恼，但只要知了，日久天长肯定会慢慢的偷偷的改变了自己，甚至自己都会惊讶自己的变化。</p><p>可以通过定慧齐修、定慧等持的四念处观行，增加自己的定力和慧力，提高自己的觉性。然后在日常为人处事当中反观自己的心念，反观自己内心深处真正的想法，然后问自己这样做对人对己有什么益处？会有什么后果？这个结果对自己是解脱的还是束缚的？这样的结果将来是否愿意承受，是否能承受得了？</p><p> 观察自心和观行四念处是同样的道理，四念处起始于定，终结于慧，目标是慧，慧生起时才能断我见证果解脱。观察自己的心念也是如此，观察的结果是什么？结果是生起了认识自己和认识后果的智慧，有此智慧必然能降伏烦恼断除烦恼，将来享受善业的快乐果报。起心动念决定了一个人的祸福，心念恶不善会招来祸，并损福，心念善会生福免灾祸。很多人遇到种种顺逆境，都不知道到底是因为什么，心粗的人根本也不想是因为什么，认为逆缘逆境是自然而有的，不知道是自己业行招感来的。因为自己恶的导致不善业，福不能长存，祸不能免离，在人生苦海中起波荡漾，逐境沉浮。</p><p>如果不观察自心就没有慧的生起，因为意识不动心念的观，就把法现量的呈现给意根，让意根去如实的面对，面对以后意根就会留意和专注于法，就会有思量，如理思量后就会有一个结果。如果意识不观察，心散乱，意根就不会住于所观法上，就不知法，也不证法。意识没有禅定散乱的观察，意根照样散乱攀缘，不能聚集在所观法上，不能如实观察和思量法，就不知法，不证法。所以过去禅师们和佛世时的弟子们，虽然都不懂意根的法，但照样能明心证果，就是因为他们都有甚深禅定。</p><p>如果不观察自心，六七识就不会在这个法上作意，也没有后面的触受想思心所法的运行，也不会有定心所和慧心所的出现，当然就什么也不知道了。不观察自心，就会随念流转，我就是念，念就是我，身陷其中不能自拔。知之一字很重要，心念如贼，家里面来了贼，要知要觉，看着他，贼知道被发现了，不好意思偷东西，就会灰溜溜的离开。</p><p>所以境界来了要知，心念出现了要知，不跟着境界跑，不让心念流转下去，从而保持正知。以前不知，就愚痴得如狗趁块，见人扔石头就追过去，见声音就狂叫，不知是风吹草动。人与痴狗没什么区别，成天以境界为真，生心动念，人我是非，我高你低，为挣一口食，打得头破血流，众生既可怜又可悲。为了改变自己，就要多做观察自心的功夫。</p><p>二十、分段生死是如何断除的？</p><p>一切生死都是因为无明所致，有无明必有相应的无明业和业种，无明业种必然导致众生有分段生死和变易生死。如果要了分段生死，就要破除无明，心清净以后断除烦恼以及烦恼习气，消除无明业种，这样分段生死就消除了，进入变异生死阶段。</p><p>业种转变的前提是什么？只有心转变了，身口意行转变了，业种才会转变。心转变的前提是什么？破除了无明，断除了烦恼，心就转变了。破除无明的前提是什么？三十七道品的修行、菩萨六度的修行、戒定慧的修行达到一定程度，才会破除无明，断除烦恼。之后心才能转变，身口意行才能清净，业种才能转变。人我执断除断尽，法我执断除，阿赖耶识才能转为异熟识，分段生死转为变易生死。</p><p>修行到哪种程度，就会破除哪种程度的无明，断除哪种程度的烦恼，心就会清净到哪种程度，身口意行就会转变到哪种程度，业种就会转变到哪种程度，果报也会随之转变到哪种程度。所以修行都是有过程的，每个过程都是必要和必须的，时间可长可短，但过程却是必不可少的，没有过程就谈不到果。所以不要妄想具缚凡夫会带着所有的烦恼能证菩提，也不要妄想证菩提之后可以不断烦恼的继续走菩提道，烦恼不是道。</p></div>"
},{
    "title": "第四章 忏悔业障篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  忏悔业障篇</strong></p><p>一、什么是业障</p><p>人人都有业障，首先有无明，因为心内有无明造作了不如法的业行，然后才有了障碍。什么样的业行，障碍什么呢？体现在对哪些方面的障碍？是谁有障碍呢？障碍的原理是什么？如何去除障碍？</p><p>所谓的障碍就是，比如我想修定，却怎么也修不成，每次修定的时候人事物的阻碍就会出现，或者心里攀缘极重，却没办法制止；我想修福，就是修不了，无法采取任何实际行动，每次下决心行动之时，一个念头出现，就想算了吧，以后再说，没有必要这样做，于是懈怠下去；每次想思惟观行佛法，可每次脑子里都是乱糟糟的，思绪不宁，无从下手，一段话都看不明白；乃至于每次想做善事，都会有各种阻碍，总是做不成。总之所有的打算都无法实现，总是下决心，却没有用，丝毫改变不了什么。这一切的阻碍就是障碍，就是业障，是由于前世自己贪嗔痴无明业行所感召的心理障碍和逆缘。</p><p>前世的恶业成为业种，如何能影响到今世的修行？业障也叫作前因后果，因果相关相连，在甲上造作恶业，出现不如法的行为，就要在甲上出现果报，甲事就不成就；同理，在乙上造作不如理的业行，就在乙上现行果报，在乙上做事不成就。比如前世诽谤了三宝，今世遇见佛法僧不生欢喜心，想要亲近三宝就会有遮障和阻力。即使有心想好好修，白纸黑字也是看不懂，佛法不入心，诽谤三宝的恶业就成为今世修行的严重阻碍。</p><p>二、正在消业障的标志</p><p>每个人无始劫以来都造作了极多的恶业，有极多的业障障碍着修道，如果不把障道的主要业障清除，就不可能见道。只有修行比较得力了，修出了一些成效，业障才能消除一部分，障道的因缘才能消除。如何才算修行得力了呢？通过学法，明了善恶之理以后，知道自己有许多烦恼，造作过许多恶业，有许多的业障，出生了悔心，业障就会一点点的消除掉。</p><p>消除业障的渠道和方式有许多，比如受恶报，出现种种的不顺，身体上的疾病，以及受人欺辱和诽谤，受人轻贱和歧视等等。犹如金刚经上所说，因为读诵金刚经的缘故，本来此人会因为前世的恶业堕落恶道，而读诵金刚经就会消业，今世仅仅被人轻贱，恶业就消灭了，不用后世再到三恶道受报了。受人轻贱，是在人中受苦，这个果报比三恶道的果报要轻很多很多，即使丢掉性命，也比三恶道的果报轻很多很多。所以学佛人在现世得到了恶报，受人欺辱打骂，应该感到庆幸，不要再回报给对方，以至于白白的受苦。</p><p>修行得力以后，消业的方式有很多，表明正在消业的标志也有很多。比如有人梦中会吐出很多脏东西，或者是腐肉之类的东西，或者是黑血，或者是黄脓，或者是九孔流出不净臭秽，或者是在厕所里身边都是大小便，没有下脚和转身处，这些污秽物也代表了心里的贪嗔痴，贪嗔痴正在一点点的消除。梦里还会出现一些平日里自己无法接受的很难堪不可想象的现象，那都是消业的征兆。这是通过修行消业的现象，以前吃过众生肉，心里和身体都不清净，明理以后心清净一些的时候，业就消除一些，梦里会显现业障消除的情况。</p><p>梦里也会呈现出心变得清净一些的情况，心里的染污会在梦里通过物质色法表现出来，脏东西从身体里出来，就表示染污出来了。显示出来的脏东西有很多种，每个人的情况会有一些差别。身体里冒出一些难闻的气味，也是消业的一种表现，包括身体出现疾病，各种不顺利，家里工作单位里都会出现种种不如意事，鸡飞狗跳的现象时有发生。</p><p>修行越猛力越得利越快速，脏东西和染污的现象出现的就越快越多，心改变的就越大。没有这些现象，说明自己修行还不太得力，没有触动到意根，也就触动不到业种。心没有明显改变，业障就不能消除，还没有达到实际修行阶段，只是在理论上用心，对理论感兴趣，对如何改变自己还没有过反思。</p><p>有的人心里用力念佛的时候，身体有时候像扬沙机一样，非常多的黑色的污物就会从口里和身体各处排出来，如痰、肉、粉末等等，这是以前吃众生肉显现出来的消业现象。有的人在梦里呕吐，胃里有些类似沙土的东西等等想吐却吐不出来，吐出来的时候还会有连着内脏一起拉出来的感觉，一瞬间会有特别大块的脏东西排出来。这都是从前造作的贪嗔痴恶业，身口意恶业，恶口诽谤等等染污业。</p><p>从这些现象中应该能体会到，确实是念佛一声罪灭恒沙。只要如理修行，就会灭除很多罪业，今生如果不能断我见和明心，只单单能消业就很值得了。要多多消业，业障轻微了才能见道。一定不要再造恶业了，造恶业是非常不值得，非常不划算的，努力修行，消除烦恼是非常值得，非常划算的。</p><p>三、消业的原理</p><p>有人说：业障就像墙壁上的画，如果墙壁消失了，那幅图画也就没有了。五阴身犹如墙壁，业障就是五阴身上的障碍烦恼，如果五阴身心空了，意识意根心空了，业行自然就消除了。业障是奔着五阴身心而来的，附着在五阴身心上，其实是附着在六七识心上，六七识心空了，业障空不空？业障没有附着体，找不到五阴身心就会消失不见了，空了。造业的主人没有了，由谁去受业报？无人受报，报就了了。</p><p>但是要看五阴身心空的程度，心空了多少业障就消除多少，初果的空与二果的空有差别，二果的空与三果的空有差别，三果的空与四果的空有差别，所以业障消除的就不同。但是如果业障太重，是不会心空从而逃避债务的。比如说一个人欠了一百万，往生到极乐世界去了，债主向谁讨一百万？如果一个人欠债一个亿，债主时时刻刻盯着他，他能跑到极乐世界去吗？他肯定去不了远处，一走动就会被债主挡住路，不让他走。只有债务比较轻微了，债主才不会花费精力去时刻盯着他。</p><p>四、众生的业是如何消除的</p><p>众生在无量劫的修行过程，其业障要一点点的消除，业尽才能成就佛道。其业的消除，主要通过自己修行，灭除无明，改变心意消除的，但是最初众生无明重，心力弱，大部分业障还是由佛菩萨加持消除和背负的。每个众生的业，如果不是佛菩萨给背负和消除，谁也不能证道和成佛。佛菩萨替众生消业、了业、背业的方式非常多，众生却都是不觉不知，有时还要去诽谤佛菩萨。众生无知的时候，并不懂佛菩萨的恩德有多大。</p><p>众生的因果就是六道轮回生老病死忧悲苦恼，可是每个众生遇到了佛法，生死业和苦受越来越轻，以至于最后断除了三恶道的业，直至六道轮回的业也消除了，乃至于每个众生有机缘遇到了佛法，不要以为都是众生自己的福德和功德所致，都是佛菩萨的恩德所致。佛菩萨天天发咒愿，愿力普及三恶道众生，三恶道众生在不知不觉混混沌沌中就受到了恩泽，福德日增，最后遇到了佛法，开始了无量劫的学佛修行，业障就开始一点点的消除，直至最后成佛，都是佛菩萨的恩德所致，不成佛谁也不能报得了佛菩萨的恩德。</p><p>佛菩萨的加持和咒愿，都是无形的，为众生消除了无数的业障也是无形的，看不见摸不着，众生无知的时候也感知不到，但是实际上力量大无边。众生不是忘恩负义，而是根本不知道恩义，还无缘无故的种种诽谤，佛菩萨从来不去计较，谁跟无知愚痴众生计较？佛菩萨无论给众生背多少业，讲多少佛法，以及多深的佛法，无知众生都不允许佛菩萨挂一个凡夫菩萨的名讳，罪障深不深？</p><p>五、如何消除罪业</p><p>造作的罪业分为心性上的罪业和行为上的罪业，心性上的罪业叫作性罪，行为上的罪业叫作业罪，两种合一起叫作罪业。如果只有行为上的罪业，而没有心性上的罪业，不是故意而造的行为，就是无心之过，叫作过失。比如过失杀人、过失杀生，主观上无心，客观上因缘所成。这样的过失造业，在世间法上罪责比较轻微，在佛法上的果报也比较轻微。无意杀，无心杀，不会下地狱，但未来世也会被无意杀一次。杀小畜生不至于将来被杀，也有非常轻微的果报。每一种行为不管有意还是无意，都有不同程度的善恶果报。</p><p>如果是因为恶心故意造下的罪业，罪业非常大，果报也非常重。如果只有恶心，心性恶，比如臆想对方如何如何，心里咒骂对方如何如何，而没有实际行动，这种情况只有心性上的恶，属于意业，意业也存种子，这也是罪业，心性也是染污的，贪嗔痴严重，后世随顺恶心而去受报。心是万法的主人，心一动就有业，有业就有业报，果报与业如影随形。</p><p>比如杀鸡这件事，这是主动杀生行为，不是无心而杀，因此既有性罪也有业罪，性罪有性罪的果报，业罪有业罪的果报。性罪的业容易消除，只要诚心忏悔自己的贪嗔痴，发愿以后不再造，心性真的改变了，性罪就会消除，如果心性不改，性罪还在，以后就要受报。但是还有业罪，业罪如何消除呢？那就要采取实际行动，如果没有把众生杀死就作以补偿，直到对方满意为止。</p><p>如果众生死了，这个实际行动真的不好做了，除非在佛法上有所修证，功德福德比较大，可以了这个罪业。比如通过念经念佛念咒给鸡超度，真的把鸡超度到善道了，这个也就了了，将来鸡反过来还会感谢你，报你恩，哪管超度到人间也行，超度成猫狗也行。还可以把自己所修行的所有功德福德都给鸡回向，并且向鸡忏悔，鸡真实得到益处了，那么业罪就会消除了。</p><p>如果罪业不消除，遮障就非常严重，别说成佛了，学佛都不会顺利，日常生活都会有问题。罪业比较大的人，想要念佛躲到极乐世界去，可是临终业障现前，都不会信佛了，别说念佛了。为什么不少人跟着学法，学着学着就掉队了？那是业障遮止，修不上去了，不少人都是学着学着，业障现前，抵抗不住了，就退回来，变成躺尸，什么也不学了。想办法不断的消除自己的罪业遮障，道业才能不断进步，否则业障拦路，就会出现种种变故。导致无法正常学佛修行。忏悔发愿可以消除业障，可以对抗业障，业障减轻以后才能继续前进，否则不进则退。所以不能把希望都寄托在临终，在临终前就要解决好后世的去向问题。</p><p>六、用大乘法参禅是否能消除深重罪业</p><p>有人说既然众生罪业如山，那就参一参是谁在受罪，是谁在造业，这样就可以证得真心，真心不造业不受罪，这样罪业就消了。但是这样消罪的方法非常不妥不如理。其一，由于业障深重，修道的遮障也重，根本无法把菩萨六度修行圆满，不可能达到证悟真心的因缘条件，戒定慧不具足就无法参禅，因此不可能消除深重的罪业。其二，这样做，对于末法业障深重的众生来说，就会拨无因果，逃避恶业，不能反观自心之染污，修来修去，罪业仍然如山，也许还会增加。</p><p>对于初机学人和业障深重的人，正处于修行四正勤断恶修善阶段，需要观察罪报苦受的缘由，从而识因达果，只有惧怕和敬畏因果才能断恶修善，降伏自心烦恼，最后才能脱胎换骨，洗心革面，成为大乘菩萨。业障深重的时候不能用大乘的无相忏悔灭罪法，也不能用大乘参禅的方法来逃避烦恼和罪业，事实上也逃避不了，躲不过去。那么重的罪业遮挡着，怎么能参禅证得第八识从而明心？怎么能达到无相？</p><p>参禅的因缘条件不具足，只能靠推理猜测第八识，臆测出一个第八识对于七识心来说，永远不起作用，没有一丝毫的功德受用，不会消除一点点罪业，三缚结一丝毫都断不了。推理出一个第八识不造恶业，没有恶业不受报，七识恶业有多重还是多重，不会消灭的。第八识代替不了七识，第八识本来就是自性清净的，本来就是佛，可是七识无始劫以来一直都是罪业凡夫，第八识丝毫没有代替过七识受苦，七识丝毫也没有沾到第八识的佛光，而少受一分罪苦。</p><p>第八识从来没有贪嗔痴烦恼，可是七识贪嗔痴却从来没有断绝过，第八识从来都是解脱的，可是七识却从来没有解脱过一丝毫。第八识是佛，七识也从来没有因此就坐上佛的宝座，从来没有享受过佛的待遇，大多数时间都在三恶道中受苦，生死轮转不休，因此说第八识与七识互不相代。第八识遍一切处、一切界、一切法、一切时、一切地，意识稍微聪明点的都会推理，到处都是第八识，想一想就知道第八识大概怎么样，关键是这样想有什么用？凡夫贪嗔痴，想的事情可多了，无始劫以来有多少事如愿以偿了？</p><p>因此说实相忏悔、用参禅的方法灭罪，对于初机学人是非常不现实的，只有业障轻微一些的，菩萨六度修得差不太多的人，才可以用这样的方法证悟消业，但也不能完全有保证，在佛身边可能性是很大的，离开佛的难度确实是不小的。推理容易，实证难，越到末法时期越是这样，所有人都不能存侥幸心理，必须用真功夫实修，不能偷工耍滑走捷径。</p><p>为什么实证第八识以后才能消除罪业呢？因为在实证过程中，能够如理如实的观行五蕴的运作，五蕴在心中越来越空，越来越不实，生灭的现象观察得越来越清晰深透，最后就会断除我见。在证得第八识的时候，再观察五蕴都是第八识出生的，心中更加的无我了空了，当然依五蕴我而造的罪业也是空的，无我无我所了。</p><p>就如心经中第一句话：观自在菩萨行深般若波罗蜜多时照见五蕴皆空。参禅观行的结果就是照见五蕴皆空，这是证悟的功德，五蕴空了无我了。观行的最后结果，就是照见，这个照见就是顿悟，照就是心灯不动，智慧光芒映出五蕴的影像，是真心第八识的影像，没有五蕴，五蕴非五蕴。照见的智慧极不容易生出来，必须广修菩萨的无量功德，接近脱胎换骨的时候，才有可能照见五蕴皆空。照，不是意识的浅思惟，而是意根深细的智慧功能作用，心光发出来了，透过了五蕴，五蕴的真相就显露出来了。</p><p>而不作真功夫，不修禅定，不修三十七道品，不断恶修善，不降伏烦恼，业障遮障着，永远不能出生照的智慧光芒，只能去肤浅的推推理，意解意解，研究研究，只在意识上用用力，意根入不进来，那么意根的凡夫骨头永远换不了，命终该是凡夫胎还是凡夫胎，因为入胎这件事就是意根说了算，由意根和业力决定的，意根就代表着业力。让意根生出智慧，改变意根，才能改变业力，消除罪障。</p><p>六、诸佛菩萨的恩德</p><p>一个人从最初接触佛法开始，直至最后成佛，至少有一半的业障，甚至大部分的业障，是诸佛菩萨给背负和消除的。甚至每个众生有学佛因缘，都是诸佛菩萨加持护念的结果。如果单凭众生个人，那么深重的业障，能遇见佛法就已经相当不容易了，何况修行佛法，何况不走错路，何况能小有成就，更何况得解脱。等觉妙觉菩萨还需要诸佛护念，才能顺利成佛，何况每个凡夫众生，不依靠诸佛菩萨加持护念，每走一步路都是困难重重，荆棘丛生，寸步难行，没有下脚处。</p><p>师恩浩荡，所以我们真应该感恩诸佛菩萨，心常怀有报恩之心，信佛语，尊佛教，守佛戒，诸恶莫作众善奉行，以诸佛菩萨为师，永不背师叛教。发大誓愿，自利利人，消除烦恼，清净自心，以所修一切善行、善愿、善法，回向法界一切众生，以此来回报诸佛菩萨的救度之恩。滴水之恩，当以涌泉相报。可是诸佛菩萨的涌泉之恩，我们能否以滴水回报？那么多人不思诸佛菩萨的恩德，反倒诽谤三宝，违背良师，与益友为仇为对。不知恩义之人，将绝解脱大道，永受三途之苦。</p><p>七、什么人才能替人背负业障</p><p>关于背业这件事，还要看体力，比如一个人摔倒了，需要人搀扶起来，如果是一个三岁孩子，想要过去把那个人拉起来，那是无可奈何的，何况搀扶起来和背起来。比如一个人有五十斤重物需要人帮助抬走，一个弱不禁风的人是无可奈何的，心有余力不足，更重之物，非大力士不可。背负业障也是如此，如果自身业障重重，不堪重负，谈何替别人背负业障？业障凭何被你背走呢？普通人何德何能背负得了别人的业障？都是诸大菩萨在背负众生的业障。</p><p>普通学佛人尽管有善心善愿，想要帮助业障重的人减轻业障，就替人念经念佛回向，祈请诸佛菩萨加持，依赖诸佛菩萨的神力护佑，减轻别人的障缘和苦受；然而这也需要学佛人自身有修为，能感应到诸佛菩萨的暗中加持和护佑，如果自己本身没有修为，那就无法感应到佛菩萨，别人的业障仍旧是原来的业障。</p><p>若留心观察，就会发现，很多学佛人学佛三十年，求人超拔超度了三十年，直到死去，都没有过得了业障关。这是因为做超拔超度的人没有修为，就没有能力减轻业障，没有修为的人是不可能超拔得了他人，没有能力度脱冤亲，只能把冤亲留在身边多些干扰而已。所以想要替别人背负业障，还需要有大雄大力大慈悲。比如说为众生回向，度脱众生，首先需要自己有功德和福德，才能回给别人，功德越大福德越多，别人得到的才会越多。如果自己本身一无是处，拿什么送人礼物？拿什么回给别人？所以修行才是硬道理，没有修行什么也别谈。</p><p>八、如何忏悔消除业障</p><p>最初学佛，都要按照那个发愿文忏悔和发愿，一个是忏悔，一个是发愿，这两项要多做，天天在佛前做，才能消除恶业，发起善愿清净愿，由善愿牵引，修行就会越来越顺利。发愿很重要，忏悔也很重要，不忏悔业障障碍着会很苦恼，天天忏悔消业以后，身心就会越来越轻安，修行越顺利。</p><p>早晚课本上有三皈五戒忏悔文，还有我写的意根忏悔文，这两个忏悔文对照着，在佛前忏悔往世所造的一切恶业，大大小小的恶业不管能不能确定以前造过，一律都要忏悔，在佛前发露出今世所造的业，并发誓永不再造。忏悔发愿都要真诚，发自内心，不流于形式，不走过场，诚心诚意，才能业消心净。心清净一些以后，烦恼习气再扭转一些，然后在清净大愿的牵引下，修行自然就会走上正道。</p><p>九、忏悔只能消除心性上的烦恼恶业</p><p>问：我天天早晚忏悔发愿，身口意比以前清净很多，但有个别时候不自觉还会犯贪业与嗔业，这样的忏悔是不是没有深入意根，属于不如法，还没有消业？</p><p>答：忏悔以后，不见得业障一下就能都消净了，肯定还有余业没有了，还有烦恼障，因为每个人忏悔未必都能彻底和到位。另外忏悔消除的只是一部分性障烦恼业，不大可能把全部性障都消除，而且还有罪障无法消除，这就不可避免的要有罪报，所以有时候还会不自觉的犯贪和嗔业，能做到这点已经很好了，算是如理如法了，也消了很多业。</p><p>在佛世时有个居士诽谤四果阿罗汉，那个阿罗汉马上上堂敲钟集众，告诉那个居士说：我证得阿罗汉果了，你赶快在大众面前跟我忏悔诽谤业，否则就会受地狱果报。那个居士马上就当大众面跟阿罗汉忏悔，阿罗汉说：我原谅你了，愿你消除罪业。但是这个居士命终还是入到地狱受报了。这个故事不是说忏悔不管用，不能消业，而是说忏悔只能消除心性上的罪业，事相上的罪业已经造作，成为了事实，那是无法消除的，只有受报才能消除。那个居士忏悔之后，性障是没有了，但罪障还存在，所以就去地狱受报了，如果不忏悔，性业加罪业在地狱受的苦会更大，很难承受。所以我们都要尽量的小心身口意行，尤其是对三宝，更要谨慎，不要造任何的诽谤业。</p><p>如果烦恼业障全部消净了，那就证果和成佛了，事实是不是那么容易都忏悔清净的。烦恼业障是一点一点减轻的，虽然减轻了，偶尔还会发作出来，这都是正常现象。忏悔深入到意根以后，还要看深入到什么程度，改变到什么程度，肯定是程度不够。如果程度足够了，烦恼就会都断尽了，程度不够，当然还会有烦恼业障，这都是正常现象。只要你比以前进步了，每天都在进步，这就是个好现象了。</p><p>十、如何化解业障</p><p>学佛学到有的时候，有进功了，马上就要上去的时候，业障马上就会在前边挡住。业障这个东西是长眼睛的，专门在关键之处等着你，在上升的路口守着。意志力稍微不坚强的人，就会被卡住，非常不坚强的人，就会倒退，甚至会退回解放前。我见过很多学佛人，不是被卡住，就是倒退，个别的都不信佛了。如果只是不信佛，还说得过去，就怕再诽谤三宝，诽谤从前所修所学，那个后果，想想就觉得非常可怕。</p><p>由于无始劫以来，每个众生经历的都有一些差别，所以意根的性体各有不同。牛鼻子是有，诸佛菩萨有善巧方便牵，或软或硬，或劝或罚，最后都能把众生推上解脱道。期间的过程肯定曲折，道路肯定艰辛，都要经历一番寒彻骨，才能迎来扑鼻的梅花香。学佛这条路非常不好走，因为每个人的业障都重，无始劫的业太多太大，就像逆水行舟一样，不进则退。如果没有佛菩萨和护法神的护持，我们每个人都不能有一点点成就。单单业障那关，自己无论如何都过不去。业障的力量是如此之大，我们都应该极其小心自己的身口意，不要造作恶业，不要太自信。</p><p>业障现前的时候，要如何对付过去？甘心承受是一方面，积极努力改变业障也很重要。业是能转化的，通过持戒、忏悔、智慧观行，都能够转化和减轻业障。众生无始劫以来造作了数不清的恶业，只靠承受无法都能承受得了和受得完，况且在没有断除烦恼的时候，还会接着造作恶业，形成新的业障。如果地狱业障现前，如何能承受得了？辛辛苦苦学佛几十年，命终地狱业成熟了，甘心去地狱受报？涂灰外道为了解脱，消除业障的办法是无限的折磨自己受苦，以为这样业就会消除断尽，然后解脱。佛说无始劫以来那么多的恶业，靠受苦就能都消灭吗？根本不能。所以只被动承受还不是究竟办法，还要积极的用智慧去消除和转化。</p><p>如何用智慧去转化？因为业障是因为愚痴无明而造作出来的，认为五阴为实有的我，为了这个我而造成了业障，现在要消除业障，就要破除愚痴无明，观照五阴无我，我既无，因我而造作的恶业也无，断除了我见，业障就会消除属于三恶道那部分。智慧越大，破除的愚痴无明就越多，消除的业障也越多越大，这样无明越来越薄，业障就会越来越轻微。智慧如热汤，业障如坚冰，只要不断的浇上热汤，坚冰早晚都会化掉。最后还要多修福，福大压人，福小被压，福大业障就会绕着走，学佛这条路就会顺利了。</p><p>十一、僧人总搞超拔超度是否如法？</p><p>凡是经常搞超拔超度的寺院都非常乱，出家人无法安心修行。因为僧人普遍修持不足，修行力度弱，道行还不行，无力超拔众生，那些被超拔的阴界众生根本超拔不出去，然后留在寺院起是非，搞得出家人不是身体多病，就是烦恼事多，互相之间矛盾多，无心修行，正常修行是不可能的了。有个别专门作超拔的寺院因为没有被超拔出去的阴界众生太多，造成寺院混乱不堪，阴界众生都留在寺院里不能投生，越聚越多，又没有足够的香火供养，就在寺院里闹事，最后寺院被迫关门了。</p><p>主要是搞这些事，僧人自己无法安心修道，被业障牵缠，自己的业障也不轻，修行起来都很不容易，还要花费时间精力去替别人背负不应该背负的业障，那怎么能有修行的心境呢？要求僧人超度自己的冤亲债主，为自己背负业障，就是非常无理的要求，即使是给与金钱补偿，那些钱与业障比较起来，无论多少钱，都不成比例。是生死大事重要，还是得那点金钱重要，有智者都能分辨得出来。所以居士们尽量不要去寺院花钱祈求出家人为自己家人超度，给多少钱都是少，关键不是钱的事，这样会增加出家人的业障，阻碍出家人正常修行，无法出离生死苦。佛经上没有讲的，佛世时没有做的，我们就不要强求去做。</p><p>十二、忏悔得轻安</p><p>一个七十九岁老人的忏悔功课：这几天我早五点起来观行，坐着坐着感觉从丹田升起一股强大的气流，把我紧紧的包住了，捆住了腿，气流继续上行，到腰又到头，呼吸都十分困难。我坐在那里开始参我是谁这个话头，结果就大哭起来，顿足捶胸。我就从座位上起来给佛磕头，越磕越哭，心里说：我不就是一个又丑又老的老太婆吗？整天贪吃贪睡，自私自利的家伙吗？种种不堪都是我，真痛恨这个臭皮囊。</p><p>接着我又跪在佛前忏悔说：我就是一个臭皮囊，像我这种人只配去地狱。然后我又回到座位上继续覌行，身体又被牢牢的定住了，就这样不知不觉过去了二个小时，这时我想起来还得给孩子做饭，于是就起座，可是动做非常迟缓，脑也不怎么好用了，机械的做着一些动作，心无杂念无妄想。</p><p>昨天上坐也是这样，想起法师写的意根忏悔文，我对自己说：你为什么忏悔文哪条都有犯？就这样一边打坐一边忏悔，很快又过了两个小时，坐禅其間出了好几次香味，下坐时动作非常慢。今天上座就舒服多了，身体也不痛了。心安稳多了，很快过了一个多小时。 请问法师这样修行可以吗？这是不净覌吗？</p><p>评：这个忏悔的初步效果很好，达到了心清净、身轻安、禅定增长的效果。但是在忏悔中知道自己错了，不必诅咒自己下地狱去三恶道等等，不要有任何的恶咒恶语相加，话出口将来就会兑现，应该发善愿好愿，有改过之心就行，改正恶心恶行就好了，不必太痛恨自己，对其他人也是这样，要有良好的祝愿，不要用恶咒。</p><p>忏悔能消除宿世的恶业，业障消除，遮障就消除，身心都会轻安，得深禅定，观行思惟顺利，修行容易走上正路，并且进展很快。坐禅中闻到的香味，如果是从自己身体里发出来的，说明是自己心清净了，身体也清净了，就有香味出来，有时从鼻孔出来，有时从牙齿中出来，有时从喉咙里出来，有时全身都会冒香气。如果香味是从外边进入鼻孔的，说明是有佛菩萨和护法神在照应着自己，或者有天人来围观你，向你学习。</p><p>从你现在的思想认知，还是应该从观行五蕴断我见开始起修，不要太早参禅，先断我见再参禅就会比较顺利，我见不断，不可能证得真心自性。年纪大了，还要多发清净大愿，以保证命终能往生极乐世界，以后再回娑婆度众生，命终能往生是非常好的归处。</p></div>"
},{
    "title": "第五章 因缘果报篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  因缘果报篇</strong></p><p>一、因果既空也不空</p><p>因果有既空也不空的双面性，在于从哪个角度去看。不空的意思是，从世俗谛的角度来看，有因必有果，因果都是世俗相，比如说一个善业是因，有这个因，一定会有善果，一个恶业也是如此，恶业是因，有这个因，一定会有恶果，不善不恶业是因，有这个世俗法相的因，一定会有世俗法相的不善不恶的果。有因必有果，世俗法相历然存在，这是因果不空的意思。</p><p>而从圣义谛诸法实相和诸法空相这个角度来看，善恶业因和不善不恶的业因，都是如来藏变现和执持的，是生灭变异的，本质是空的，善恶果报和不善不恶的果报也都是如来藏变现和执持的，是生灭变异的，本质也是空的。如果业因不是空的，那就永远有业因，众生要何时解脱？如果业果不是空的，众生就会永远受业果报，果报何时了？众生果报不了，何时解脱成佛？生灭变异则为空，不生灭不变异则为不空，世俗法相全部是生灭变异的，所以全部是空的。</p><p>如果说不生灭不变异则为不空，是为因果不空的原因，那么这个不生灭不变异的法，就是本心如来藏。除了如来藏以外，如果还有不生灭不变异的法，不管这个法是什么，都是不空的。而除了如来藏以外，还真的找不到不生灭不变异的法了。凡是能找到的都是和如来藏本体有关的如来藏的体性。不生灭不变异的如来藏，能现起世俗谛的因，也能现起世俗谛的果，如来藏不空，因果必定会有，所以如来藏就是因果的因，如来藏不空，因果就不空，如来藏空，因果则空。</p><p>从甚深的唯识的角度来看，世俗谛的因，是如来藏的七大种子变现出来的，本质还是如来藏的属性，世俗谛的果同样是如来藏的七大种子变现出来的，本质仍然是如来藏的属性，所以世俗谛全体都是如来藏的属性，归属于如来藏，从世俗谛上应该能看到如来藏的身影。</p><p>二、因缘果报也是幻化不实的</p><p>众生的因缘果报从哪里体现出来？是从五阴身上体现出来的，从色受想行识上体现出来的，从十八界上体现出来的，五阴身是幻化的，十八界是幻化的，宇宙器世界是幻化的，一切人事物理全部是幻化的。既然因缘果报所依赖之体都是幻化的，本身也就是幻化不实的，因缘生因缘灭。种子是五阴身造作落谢的，五阴身虚妄无常，因缘果报就虚妄无常。</p><p>所以一切因果也是幻化的，除了如来藏其余一切都是幻化出来的，是如来藏依照业种和各种因缘所幻化的，都不是实法。比如众生造作的善恶业和所受的善恶报，都是在这些世间虚妄法上来造作和受报，五阴世间虚妄，这些业行和果报当然也都是虚妄的。</p><p>    比如说今世在这世间当了国王，或者上天当了天主，国王和天主五阴身是幻化的，宫殿宝座是幻化的，生存的宇宙器世间是幻化的，锦衣玉食是幻化的，所有的宰官大臣、身边的侍从都是幻化的，国王和天主的一切都是幻化的。再比如说杀人或者被杀这些果报都是五阴来造作和承受的，这些恶报从哪里来的？都是如来藏根据业种和因缘幻化出来的，都体现在五阴身上。受了善恶业报，生出了苦乐等等觉受，这些受也是如来藏幻化出来的，都是生灭变异无常的，既然如此，一切因缘果报就不是我，也不是我所有的，这就叫作无我无一切法。</p><p>知道一切法都是幻化不实的，就应该减少攀缘，减少造作，减少用心，尽量心空，因为你无论怎样造作都是空的，无意义的，都是生灭法，无得无失，何不息心省心？有的人就说既然都是空的，那我何不多造作？我造恶业也是空的，就不必忌惮造恶业。但是如果造作了恶业，心就不能空了，心不空受恶报的时候那是极其苦恼的，到时候苦受也空不了，生不如死的痛苦着，没有人愿意这样，所以心空就不会造恶业，减少一切操作心就逐渐清净，也逐渐空了，这才能了苦得解脱。</p><p>三、众生大多习惯于造不善业</p><p>很多人都是每日精进学习法义，可以说兢兢业业，却偶尔在遇到谤佛、法、僧三宝的言论时赞叹一下，这一个赞就毁了自己修行的大部分福德和功德，以至于无论怎样精进，进功都不大。无明能严重遮障修道，如果不想办法忏悔自己的无明，到最后是善业大还是恶业大，都不好说。那么多人为什么不知道自己的无明很重呢？为什么不知道自己是无智的，在佛法关键部分非要发表自己无知无智的见解呢？这样的修行，到最后的结果是什么，怎么不想一想？什么叫作恶业？诽谤三宝是恶中恶，还有比这更恶的吗？还不如造些杀生的恶业，果报还小一点。</p><p>造恶业很容易，一句话恶业就成就了，甚至是一个字大恶业就成就了，甚至是一个表情一个符号，恶业就造出来了，没有多少人会觉得这样有什么不妥，有什么恶果。等到受恶报的时候，也根本不会联想到是因为什么而得到这样的果报，根本不会去思考分析恶果的来源，更不会去忏悔造过的不善身口意行，甚至很多人都不知道什么样的身口意行是善的，什么样的身口意行是恶的，一般来说都是随顺着自己内心的无明烦恼，从来不会去违逆自己的不善心所，任由自己的烦恼习气显露出来，散发出来。</p><p>大多数人的觉悟性都很差，对于自己的心行不知不觉，没有反观能力，也不想反观，只是一味的随顺和护短。这样随顺的结果是什么？结果就是每个人都有苦恼和苦痛，都有障碍，都不顺心如意，命终会去三恶道受极大苦，从三恶道出来以后仍然不觉悟，以至于恶性循环不已，六道轮转不停。</p><p>造善业其实也很容易，一句话就成就一个善业，甚至是一个字就能成就一个善业，乃至于一个表情一个符号就成就了一个善业，可是很多人却不屑于做这样的善业，因为没有这样的习惯。每日都是不善心所大于、多于善心所的现行，所以每个人都是恶业大于、多于善业，也所以尽管很多人都信佛学佛了，命终仍然会去三恶道受苦，不能保证人身，去三恶道的比例在百分之九十以上，甚至更多。</p><p>四、成为鬼道众生的根本因</p><p>鬼的特征是贪吝，所以有贪吝心的人，命终必生鬼道，不管贪吝什么。贪的范围太广了，众生不仅仅在金钱和财物方面，在五阴世间里不管对什么法贪，都是贪，包括大众都认为很正常的身口意行都是贪，都是当鬼的因。</p><p>饿鬼和恶鬼都属于鬼道众生，饿鬼的心性是非常贪和吝啬的，所以就一无所有，非常贫困，吃不到饮食，喝不到水，近水，则水变成火，非常苦恼；恶鬼的心性是恶的，常常出来祸害其他众生，包括人类。鬼道众生大多数叫作鬼，是普通的鬼，区别于饿鬼和恶鬼。</p><p>有个老太太活着的时候经常与院子里的三个老头打麻将，三个老头相继死去了，最后老太太也死了。她投生鬼道一段时间以后，就给她女儿托梦要一副麻将，她女儿就给她烧去一副纸麻将，后来就托梦告诉女儿说自己还在与三个死去的老头打麻将呢。他们还是比较有福的鬼，生前没造过什么大恶业，只是比较贪玩，死后就在鬼道继续玩。含有生前搞音乐美术艺术的人，死后做鬼，然后又信佛，就附体在信佛人的身上到寺院修福做功德。搞艺术这些人也是贪，对艺术执著有感情，贪执不舍，死后就会做鬼，喜欢琴棋书画等等都属于贪。过去的文人墨客诗人作家散文家等等，大多数死后也做鬼了，都有贪习。喜欢什么就会被什么束缚住，不得解脱。</p><p>还有一种严重的贪，就是贪色贪爱贪感情，死后就做多情鬼和色鬼。很多人把情当作是每个人理所当然应该有的，对其他人生情还觉得很自豪，还要赞叹多情的人，赞叹什么爱情感情之类的。其实情是最严重的贪，也是生死轮回的主因。佛陀在楞严经中告诉我们，情重一定会下堕三恶道，九情一想沉下水轮，就是地狱；七情三想生于鬼道；情想均等，生于人间；情少想多，心能飞升，生于天上。想是代表理智的，心思轻，就会往高飞升，生于善道。情是沉重浑浊的，心思重，必下堕三恶道。</p><p>情从人间法律和道德的角度来说，不管合理不合理，从后果因果上来说都是不合理的，是不应该有的。情就是贪爱，有贪就有水，有水必下流。很多人一有了感情，就会吟诗作画的抒发发达自己的感情，认为很美好很真挚，很浪漫，觉得多情就是善。实际上多情不善，害人害己同堕三途，遭受轮回之苦，遭受多情之苦。很多苦受，是因为有情执才感召的，没有情就没有执，也就不会有苦受了。</p><p>正当的感情都有恶报和苦报，那么不正当的感情，不应该生起的感情，损害他人利益的感情，不道德的感情，他人反感的感情，就更有恶报和苦报了。所谓正当就是法律允许和保护，道德规范也允许，不正当就是相反的，法律不允许不保护的，道德规范也谴责和不允许的。</p><p>我们学佛以后要多看管自己的心，能降伏的贪爱和情执就尽量降伏，能克制的就尽量克制，毕竟贪爱不是善法，是恶法，属于烦恼。有不少人认为多跟人结缘，后世就能度得了，于是就不管不顾的跟异性频繁打交道，生出不正当的感情也不克制，任由其发展，以为这样就结善缘了，可以互相度脱了。实不知，自己在一大劫之内，不一定有能力度脱异性，情感纠葛会让自他堕在恶道受多劫苦受，多少劫从恶道出来以后，还是没有能力度脱异性，因为没有断除贪爱烦恼，必因贪爱而堕恶道。有度众生的心是善，但还要明理和懂法，否则善就变成恶，不仅没度得了众生，还被众生所度，得不偿失。那些拿此当借口的人，更应当悬崖勒马，因果不曾饶过任何人。</p><p>总结起来，在娑婆世界，只要对任何一种法一种境界起贪爱，心喜，欢喜，粘着，不肯舍弃，都属于贪，因此贪一般都要堕落在鬼道以酬尝业果，因果是不虚的，有因必有果。</p><p>五、狱卒和阎罗王是否有果报</p><p>问：万事皆有因缘果报，那么地狱里面每日行刑掌刑的鬼卒得何果报？森罗殿里审判司刑的阎罗王又得何果报？</p><p>答：地狱里狱卒和阎罗等等，都是众生恶业所感召的，都是自己的恶心所现的幻影，没有地狱业的人到地狱里就看不见狱卒，并不会受到狱卒的惩罚，没有恶业的人也遇不到阎罗王对自己的审判。有的众生之所以会成为狱卒和阎罗等等，也是他们自己的业力所致，这并不是一份正业，虽然是伸张了因果和正义，有一定的意义，但作恶众生不喜，缘分就不善。如果能让众生悔恨罪业，能发誓洗心革面时，才与众生结一些善缘。所以很多表面看来的善与恶，实质都是不一定的。</p><p>再比如人间监狱里的狱警管理犯人有罪吗？瑜伽师地论里面讲，狱警不是正业。这样的问题，不是几句话能说明白的，因果的问题是很复杂的问题，一个人做什么样的工作，也是由业力决定的。在任何与众生打交道的工作中，都存在着善业和恶业，完全在于当事人如何正确处理。教师行业非常好，也是度众生，但是就有不少人造作了恶业。讲经说法是度众生的事业，但是就有很多讲法之人造作了地狱业。当医生治病救人，这个职业好不好？这都是不一定的，病人为什么有病呢？极大多数都是业果酬尝，果报而已，这个果报是应该受的，而且确实是还有一些曾经所伤害的众生来追索讨债，可是医生却截断了因果的酬尝，也使得债主不能如愿所得，医生就会背负一定的因果。</p><p>出家僧众给居士们做超拔超度也是一样，善恶都是不一定的。譬如前世甲把乙打死了，今世乙来讨债，要把甲打死，然后你把甲救度了，乙没有讨到债，也没有报仇，这对乙来说是公平的，乙也许会反过来报复。如果超度时也可以顺便超度乙，可是乙不想被超度，就希望甲受恶报，那么超拔超度就干预了因果。譬如甲欠乙一千万元，乙向甲讨债，而你从中加以干预，没让乙讨到债，乙这一千万元加利息该怎么办？他会不会向你讨要？如果为自己的父母亲人超拔和超度，这是自己的本分，是报恩之举，为自己的父母亲人背负业障是应该应分的事，为对自己有恩的人背负业障也是应该应分的事。</p><p>表面的善，实际上是不是善，有没有善果，一般人都不能开眼见证得到，在佛经里记载，超拔超度的事只有一件，那就是佛陀合所有出家人的力量，超度大目健连在地狱中的亲生母亲，再没有第二例。佛经里从来没有记载诸佛菩萨以及阿罗汉辟支佛为众生超拔超度这样的事，也没有记载出家僧众为众生超拔超度这样的事，过去的僧团里从来没有这样的事。过去的寺院里，出家人非常多，从来没有聚集在一起，敲打唱念为居士做超拔超度这样的事，佛的戒律也不允许。那时候的出家众都是以个人修行为主，有能力弘法的人可以讲法，其余的事都不可以做，尤其是涉及到金钱等等世俗利益的事情更不允许做。   </p><p>六、临命终时的觉受</p><p>楞严经讲，一切世间生死相续，生从顺习，死从变流，临命终时，未舍暖触，一生善恶俱时顿现，死逆生顺，二习相交。这里说临命终时未舍暖触，临是接近还没有过去的意思，就是还没有死亡的意思。既然没有死亡，至少有意识和意根的存在。而佛说未舍暖触，那就是还有暖触，就有暖触的觉受，身识也存在。这时候四大还没有分解，或者是刚刚开始分解，色身的一切觉受都存在，都能感知到，六识都在还没有灭去。这时候是什么感受呢？佛比喻众生四大分解时如生龟剥壳，那有多痛苦和疼痛？</p><p>既然这时候有感知，意识没有灭，独头意识也可以现前，独头意识这时候干什么？专门接收如来藏发出来的信息，如来藏把自己这辈子所造作的一切善恶业行，全部都播报出来，像放电影一样，而且是快速的播放，极快镜头，瞬间就能播放完，如来藏导出的速度极快。对于意识来说就像快速回忆一样，也容不得独头意识想什么，只接收就行了，然后意识马上就明白了、知道了自己要随着这些业行去向哪里，但是已经没法告知身边的人了。</p><p>临命终时意识虽然有些昏昏沉沉，但是对于如来藏硬塞给祂的录像内容，仍然能非常清晰的作以了别，清清楚楚，而且还能判断出来自己要到哪道里去受报，不用谁来给自己讲因果报应之理，完全不用了。</p><p>临命终时意识和意根不得不接受后世的果报，这就是业力，一辈子业行的力量，不容意识反抗，也不容意根反抗，二者都要顺从业力的安排和召唤，没有怨言。即使在中阴身里受到阎王爷爷的审判，也不会申辩和诉苦喊冤叫屈。为什么？因为事实就摆在那里，大家都能清清楚楚的看到，不用阎王爷去调查取证。在事实面前，还能有什么话好说？乖乖服从阎王爷的安排，服从命运的安排。命运如何形成的？命由我造，自己造的业，当然要由自己来承受，不然怎么办？谁替你承受？亲爹亲妈亲儿子也没办法替你承受，各人业各人受，谁也替不了。</p><p>要想人不知，除非己莫为。自己一生当中，所做的大大小小的业行，如来藏事无巨细都给记录在案，别的如来藏也都知道，意根依如来藏也会知道，等到别人的意识有神通时，别人就能完完全全知道自己所做所思所想的事情，瞒不了任何人，作恶根本不能瞒天过海。果报之事自然而然，也怨不得任何人，地狱三恶道也是自己如来藏根据自己的恶业来变造，跟别人没关系，别人不能给自己变造出地狱。所以自己的命运完全由自己负责，别人不替受。人要自私，就要为自己负责任，对自己尽量好一些，别为自己去造作任何一点点的恶业，这样的自私，佛也赞成，这是智者的自私。</p><p>为了避免恶报受苦，自己的身口意行都应该严格看管，身行方面不去损害侵犯任何人；口行方面不好听的话、不应该说的话、伤害人的话、侵犯别人利益的话，尤其是诽谤三宝的话都不要说，说出来表面是伤人，实则是伤自己，千万倍无数倍的果报，到时候特别难于承受，一句话完全可以入地狱受苦无量劫，果报就是这样；意行方面不要有贪嗔痴，思想要纯洁单纯。这些因果法则不是佛制定和创造出来的，也不是菩萨和护法神制定和创造出来的，更不是自己的冤亲债主死对头制定和创造出来的，都是自己的如来藏所为。如果要埋怨，就去埋怨如来藏，看如来藏听你抱怨不？</p><p>敢于造作恶业的人，不在乎造作恶业的人，轻易就造作恶业的人，都是无智的愚痴人，越愚痴胆子越大。愚痴的不计后果，不知后果，不畏果报，也考虑不了那么多，只有顺从自己的无明烦恼，心里才舒服，造恶业是为了自己一时的舒服畅快，不管以后有多么不舒服不畅快，智力不足，定力不足，就管不了这些，发作出来畅快就行。一讲因果，烦恼重的人就不愿意听，说是编造的，拿这些吓唬人罢了，佛经里记述的所有真实因果事件都不愿意相信。可是不信归不信，果报照样会出现，不管你信不信。</p><p>七、重罪轻报的原理</p><p>后世罪业今世承受，都属于重罪轻报。修行越好，罪业越提前受，孽息少，非常划算。今世如果出个车祸，你就想：太好了，后世不用下地狱受报了，或者不用突然夭亡不用短寿了。如果有人给你小鞋穿，或者冤枉委屈你，或者打你骂你，你应该这样想：这个人对我真好，以后就不用得癌症等大病，不用出车祸等等事故，那些罪业就这样消受了，多划算。</p><p>修行感召来的小挫折，就会避免后世的大挫折，今世修行感召到的大挫折，就会避免后世更大的挫折和危难病苦死亡三恶道报等等，非常划算。所以不管怎样，请继续努力用功办道。</p><p>八、花报与果报</p><p>花是未成熟之果，是结果之前的状态，当然没有果有营养价值；果是花的升华和结晶，营养价值高于花。佛教里往往用花果来比喻和划分善恶业报，善恶业报分为花报和果报，花报是指现世就受的回报，果报是未来世业缘成熟所受的回报。一种业行，如果有花报，也就有果报，没有花报也有果报，花报越大果报越小，如果没有花报，果报最大。</p><p>回报犹如酿酒，越久越醇厚，也如银行存款，越久利息越高，回报越丰厚。对于善业来说，造作善业的人如果贫穷，就会希望尽快得到花报，越快越好，眼前就能享用得到，因为福德不足，所以要急用回报。有的人是因为无知，或者做善业是抱着有所求的心态，想得到现前的利益，所以只求花报。那么得到花报之后，也许有未来世的果报，但是可能非常微小。</p><p>对于造作恶业的人，花报越快越大，果报越慢越小，如果这个人有良知也明理，就会甘心承受花报，尽快消除恶业的影响，以免后世的果报之苦。只有无知的不信因果之人，才会千方百计的躲避花报，抱着侥幸心理隐藏恶业。当然如果善业非常大，自然会感召到花报出现，不用人求，后世的果报也很大；如果恶业非常大，同样会感召到花报出现，躲避也没有用。善恶都会自然有报，只要时节因缘具足。</p><p>九、怎样得到果报是最划算的</p><p>问：某甲为某乙做了一件好事，某乙得到了某甲的帮助。某甲想要得到某乙的回馈和回报。某甲究竟是现在得到某乙回报划算，还是后世得到某乙的回报划算，还是得到因果的自然回报划算？</p><p>答：以无所求的心，等因果自然偿还的最划算。某甲做了好事，但没想过回报，这是以无回报的心做事，虽然某甲不图报，但因果法则还是会自然产生回报，这时果报最大。以无为心做善事，善报最大；以有为心做恶事，恶报最大。</p><p>以无为心做善事，善报最大，心大，报大。不知道如来藏为什么会有这样的规则。想把善事果报最大化的人，可以钻这个空子。有想钻空子的心，还是有心，有心心就小，无心心最大。想回报，有目的做善事，就有心，有心心就小；不想回报，做善事没有个人目的，没有私心，心就大，心大果报大。为三宝做善事，果报最大。如果其中有私心，为了金钱名利地位权力等等，就会大打折扣。如果是怀着强烈的私心而做善事，拿三宝做买卖，图谋三宝带来的利益，也许就会变为恶事，而有恶报。</p><p>如果烦恼太重，图谋三宝带来利益，图谋未果，而起嗔怨，有可能是地狱果报。一切罪业，都由烦恼而起，一切烦恼都由那个我而来，所以只有断我见之后，烦恼才能变得轻微，甚至能灭除烦恼，让烦恼永尽得解脱。世间所到之处，大到国家之间，中到团体之间，小到个人之间，都能看到众生的贪嗔痴烦恼，可以说烦恼炽盛泛滥，很难救拔。末世毕竟是末世，众生业重障深福薄，罪业远远大于善业，恶报远远大于善报。所以后世会有极多人去向三恶道受报，这是必不可免的，死亡病苦都是小事了。</p><p>十、替人背业也有因果</p><p>问：家里老人腿痛，我每天帮他按摩治疗，三个多月后老人腿好了，可我却发现自己胳膊上出现了和老人腿上一样的症状。有时给同事治疗，同事好了，自己身体就会出现类似症状。为什么会如此呢？</p><p>答：这是因为别人的业障，你给背过来了。业障不是无缘无故就能消失的，需要承受果报然后才能消失。他不承受，就需要你来承受。学佛人总是去给人背业障，就无法修行了，最后谁也没有成就，都处于生死轮回之中。</p><p>医生治病当然也背一定的因果，但那是职业，不是特意想给人消业背业障，医生必须那样做。而特意给人消业，当然会引起冤家讨不着债，心里嗔恨不满。比如说你家人欠债，债主讨债，你把家人保护起来，债主讨不着债，那会怎么样？</p><p>因果法则，需要业种成熟，才能受报。有的冤亲债主附在身体上，就会马上报复。有的是临终报复。如果背负的业障大，即使没有冤亲债主附在身体上，因果来的也快。这里分很多种情况，很复杂，几句话没法说得清楚。有的病人有病不是由于业障，如果没有业种就是环境造成的，或者是不小心造成的，给他治病就不遭报复，没有业障，没有恶报，而有善报。</p><p>十一、愚痴烦恼业的果报</p><p>贪嗔痴烦恼的果报是：贪心生恶鬼道，嗔心生地狱道，愚痴生畜生道，在临命终时贪嗔痴的恶业相现前时，就必去三恶道受报，躲避不了了。为了消除烦恼业，在平时多反观自己的心行，努力用佛法之理来加以降伏，持戒修定，烦恼才能降伏比较快。造作了罪业之后，要想消除就要忏悔，造的罪业比较重大的，需要佛前忏悔见到好像瑞相，比如梦中和定中出现莲花，佛来摸顶安慰等等；一般不太重的罪业，在大众面前真诚忏悔，就可以消除。</p><p>贪心非常重的，在恶鬼道受苦时间就会非常长，如果对于三宝生严重的贪心，那罪过简直太重了；嗔恨心比较严重的，在地狱道受报时间就会非常长，如果是对三宝生嗔恨心，那个罪业更不得了；愚痴严重的，就会造作大的恶业，那就不是畜生道的问题了，先下地狱受报，之后恶鬼道，再之后才是畜生道。一切烦恼全部都由愚痴引起，愚痴是烦恼根源，不愚痴就不会生起贪心和嗔恚心，不会造作烦恼业。在将来断除烦恼的时候，贪心和嗔恚心先断，愚痴最后断，因为愚痴很难办，所以愚痴烦恼最后断。</p><p>从前有居士诽谤阿罗汉，阿罗汉告诉那个居士，我已经证得阿罗汉果了，你必须当众跟我忏悔，否则一定会下地狱。然后阿罗汉撞钟集众上堂，居士当着大众的面前，给阿罗汉道歉忏悔。但是那个居士命终还是下地狱了，为什么？因为诽谤阿罗汉的罪业太大太重了，忏悔之后也不能完全消除，如果不忏悔，罪业更重，在地狱受报的时间会更长久。在地狱里能提前一分钟出来，就是万幸值得欢喜的。罪轻罪重，感得的地狱也不同，受的痛苦也不同。诽谤初果人二果人三果人的罪业也都很重，这个世间里的人烦恼普遍都重，不管对方什么身份什么证量，烦恼一上来通通都诽谤，不管后果，自心发泄才是最重要的。</p><p>学佛人如果不想降伏自己的烦恼，即使学了八地菩萨的理论，造作烦恼业之后，下到三恶道，八地菩萨的法也救不了自己。平时只管随顺自己的烦恼性情，不考虑后果，任己之情，逞己之意，别人爱怎么样就怎么样，随自己心舒服就行。可是果报到来的时候，会是一百万倍的不舒服，舒服与不舒服之间成比例吗？完全不成比例。那时候再想自己当初何苦来哉，太不值得了，只得到恶报，什么也没有得到。</p><p>十二、畜生的杀业是否比人类还重？</p><p>造作恶业杀业是由意根作主，六识造作的。但是意根自己单独的心理活动，也是业行，叫作意业，也存种子，也有果报，就是生死轮回苦。</p><p>身口意三种业行中，以意业为主，意业最重，因为身行和口行直接受意根的意行指挥和控制。意根起贪嗔痴造作的身业口业叫作故作，不是由意根起贪嗔痴造作的业行，叫作无意而作。故意造作恶业，罪业大而深重，有性罪性业；无意造作的恶业，罪业轻微，没有性罪性业。</p><p>畜生们互吃，介于有意和无意之间，只是单纯的为了饥饿，没有杀心和嗔恨心，造业比较小，恶业比较轻微，没有性罪和性业，欠债将来还债就行了。畜生的一期恶业结束，可以托生为人，人再造恶业，就会再去三恶道受报。众生就这样在六道里生死轮回，人身的业行是最主要的决定因素。没有一种业行是没有果报的，所以每个人说话做事千万千万要小心谨慎，不可肆意妄为，张口就胡说，尤其是对于佛法，不能想当然的自己认为怎样就怎样。佛说不证阿罗汉果不要信己意，己意不可信。一旦在佛法上造作恶业，无间地狱的苦，是人间的无量倍，没法承受。</p><p>十三、因果不由心</p><p>如果心中有个严重的我，心想的事就不一定能实现，不想的未必能躲避得了。人类所做的，往往与自己所希望的正相反，比如人都希望长寿健康快乐，可是造作的都是让自己不长寿不健康不快乐的事情，比如杀生吃肉，那结果怎么可能健康长寿快乐呢？人都想自由自在得解脱，可是死死攥着一个我不肯放开，那怎么能自由自在得解脱呢？</p><p>人都希望自己富贵发达，可是却总是有意无意的做一些偷盗抢劫的事，那怎么能富贵发达呢？人总是希望自己被人尊重和看重，却总是傲慢看不起他人，不尊重他人，那怎么能得到他人的尊重呢？人总是想有至高无上的权利，可是总去剥夺他人的权利，自己怎么能拥有权利呢？</p><p>十四、恶取空的果报</p><p>世间有两种断灭空，或者是恶取空，害人不浅，直接导致众生堕落三途，轮转六道。一种是外道的无所有空，认为没有什么前世后世，死后一了百了，没有因果，没有善恶业报，做什么都无所谓，只要自由自在尽情尽兴就好。</p><p>另一种恶取空，是修学大乘如来藏法这些人，虽然承认有因果业报，承认有前世后世，身中有如来藏不灭，但是贪图五欲享乐，又不愿苦修实修，不愿意持戒修定，于是就否认五阴十八界的一切虚妄功能作用，把一切都推到如来藏那里，用如来藏代替五阴一切功能，让五阴无所作为，也不用学佛成佛，如来藏本来就是佛。或者放任五阴胡作非为，说五阴做什么都是如来藏做的，如果是如来藏做的，五阴身就没有因果，没有业报，所以五阴身就随缘自在，不用持戒也不用修定，如来藏本来不犯戒，本来就有定。这两种断灭空恶取空论，性质虽然不同，结果却相似，拨无因果，放浪形骸，不能断恶修善。</p><p>因为执取如来藏为我，也就执取个无相，凡是有相都要摈弃，好像自己已经超越了有相达到无相了。其实无相的是如来藏，五阴身还全部落在有相中，目前来说根本超脱不了，因为没有持戒没有禅定，般若智慧严重不足，心心念念都在相中，如果非要遮掩这些相，那只能恶取空了，等果报到来的时候，必须直面相对，恶报之相再也无法躲避。</p><p>可是那些说已经超越有相，达到无相之人，为什么还要选择吃肉，不着吃肉相，而不去选择吃素，随缘吃剩菜剩饭？既然没有相了，一切都要随缘从简能活着修行就好，为什么还那样挑剔讲究护身养生呢？有相戒不持，专门持无相戒，难道选择饮食吃穿住用行不是相？为什么选择享受的相而不选择吃苦的相？可见无相是假，有相才是真。学大乘非常好，可是不好好学，大乘法也会成为毒药，食之不舍，必死无疑。良药变毒药，谁之过？</p><p>十五、众生的业缘都有哪些</p><p>业缘顾名思义就是身口意业行产生的缘，也是五阴身受善恶业报的缘。有这些业缘，五阴身才能在一切法当中生活、造业和受报。一切法包括周遭的一切人事物理，包括其他五阴身，和生存环境，宇宙器世间所有的自然现象。众生籍此造业和受报。生存方式、生存条件、生存资具就是业缘，家亲眷属、朋友同事就是业缘，有这些缘，才能受善恶果报。</p><p>其中色身是正报业果，也可以是命终之前的色身和后世色身的业因业缘，环境是依报业果，也可以是业因业缘。一个法可以是因，可以是缘，可以是果，法不定，果也不定。</p><p>十六、相貌的秘密</p><p>人的声音能反映出一个人的性格、脾气、秉性和修养，也能够反映出一个人的心性是单纯率真的，还是虚伪狡猾的，是光明的还是阴暗的。一个人的五官相貌也能反映出一个的修为、性格、脾气、秉性、学识、风度等等，甚至骨鄂肌肉形体皮肤等等，都能反映出一个人的性格脾气秉性，是精进还是懒惰，是严谨严肃还是松懈懈怠散漫，是阳光还是阴沉等等。</p><p>每个人都应该对自己的相貌负责任，外在相貌业都属于因果的一部分，是业行的正报，都是自己生生世世修出来的，反映了内心的善恶品质，当相貌不如意的时候，不要埋怨父母或者是老天爷，应该谴责自己。前世那样的傲慢，今世个头矮小，一个人的肌肉那么松弛，这个人可能就很懈怠懒散，思想不严谨，得过且过那类型。身形歪斜不正的人，往往心也不正。正直的人，心正身正，五官都正，皮肤紧致，面容严肃。乃至于眼神都正，目不斜视，心地光明。从面相上也能看得出这个人前世是从哪道过来的，越年轻时看得更准，后世会生到哪道去，年纪越大，看得越准。</p><p>十七、丹霞禅师为何烧木佛</p><p>丹霞禅师开悟证得了自性佛以后，心中不仅破除了四相我相、人相、众生相和寿者相，也破除了佛相，只认真佛，不认假佛，那些木雕石塑的佛像当然就更不是真佛了，烧之何妨？但是没有证得真佛的人万万不可学之，因为没有证真，假相犹存，烧假相就等于烧真相一样，这就有很大的罪过了，毁佛辱佛的果报非常不好。古代曾经就有一凡夫比丘效仿开悟的比丘，把佛菩萨的名字都写在内裤上，结果一两天之内就吐血，是否死亡我就不记得了。还有现代的人把观世音菩萨像丢到河里，回家以后很多年都是浑身湿冷湿冷的，直到忏愧罪业，并且做了一些补救措施，大病才好。</p><p>丹霞禅师宿世善根深厚，开悟以后道行匪浅，心空无相，经常在桥上一卧，悠哉悠哉，无所事事，人常怪之。得道之人，还有什么事，五蕴世间都是空的，无相、无愿、无求，人生就是吃饭睡觉而已，常伸两脚卧再正常不过了，哪有那么多事，整天东求西求，东奔西走，忙里忙外的，有什么可图谋的？直到心空彻底，一切法自然任运，佛陀自然会来授记成佛，还有一法不空，还有一事可求，还想成佛作祖，休想佛陀来授记。那些以度众生为名，图一己私利，搞得佛教乌烟瘴气之人，恐怕不但得不到佛陀授记，还会得到因果的修理，因果可怖。</p><p>有的人会说，我也认为木雕石塑的佛像不是真佛，我烧了也会没事。那你就烧一个试试，看看会不会感得五脏俱焚，痛苦难忍。自己认为的不管用，意识觉得的没有用，如果意根不认的话，因果不爽。那些自认为证果的，自认为明心开悟的，去把佛菩萨的名字写裤头上试试，去烧一烧木佛毁一毁石佛试试，如果没事，可以看作是破相的真悟，有没有人敢这样做，像丹霞禅师一样？</p><p>有的人会说给我印证的人相当有道行，我就是相信，但我说佛是最有道行的，假如佛给印证的与事实不符，如来藏不承认，因果就更不承认了，当然这只是假设，佛陀所印证的当然是绝对符合事实，符合如来藏了。有些人很倔强，说什么都不听，只相信自己的感觉，但是如来藏更倔强，只管事实，因果尤其的倔强，敢跟一切人杠，在事实面前不低头的人，因果就会跟他杠上。</p></div>"
},{
    "title": "第六章 善根福德篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  善根福德篇 </strong></p><p>一、说说福德的事</p><p>学佛人在佛法上所修得的福德，或者为弘法所修出来的福德，都是有定数的，也是有限量的。有限量的福德，如果往世间法里用的多，在佛法修证上用的福德就会少，二者如称两头，低昂等时。比如说在世间法里工作待遇好了，职位升高了，名誉好了，地位高了，有权势了，赚钱多了，人缘好了等等，总之你越来越得意，越来越舒服，家庭关系等等也越来越好，但这些都是动用自己在学佛和弘法当中所修的福。那么福德就从如来藏银行里套现出来了，剩余的就不多了，用在佛法修证上够不够用就不好说了。</p><p>如果学法的福德不够用，修行还是上不去，那就还得再继续修福。如果修出福再往世间法里用，修行需要的时候福还是不够用，这样循环什么时候能把自己修持出来？所以在修福的同时要发愿，这些福用其中的百分之多少用来修道，尽量不往世间法里用，因为不划算，套现出来用完就没有了。钱赚得越多地位越高，福德套现出来的越多，如来藏里存款越少，这样拿什么来支撑道业，修行成道？</p><p>不要以为钱赚的越多越好，权利名声越大越好，除非是为了弘法和利益众生而赚钱，否则自己如来藏银行里的存款越来越少，就没法支撑修行了。聪明有智慧的人，总是保持如来藏银行里有相当程度的存款，而不是套现出来为世间法所用。世间法能凑合过得去就行了，有吃有穿就行了，修行上用的福一定要保证足足的，富富有余，修行才能顺利和快速。</p><p>二、修福与消福的原理</p><p>用来修道的福，众生都不够用，所以一边要不断的修福造福，一边还要尽量节约福。福消失的很快，享受了福就灭去了，自我夸耀毁灭他人，或者得到别人的夸耀，福就消化了，造作了恶业，嗔恨嫉妒诽谤两舌恶口，福就消失了。当然做善业会增加福，利益的他人和团体就增加了福，提升自己的道德品质，心地良善，就增加了福，禅定能增加福德，多闻能增加福德，持戒能增加福德，忍辱能增加福德，当然种种布施更能增加福德。</p><p>也有人比较喜欢多行布施，本来福也不少，却总感觉没有什么福，做什么也不顺利，这是为什么？其实是因为这个人烦恼重，习惯于造恶业，经常爱发脾气，起嗔心，还爱嫉妒人，在工作上总是排挤人，争强好胜，这样就损害了他人的利益，而让他人利益受损，就损害了自己的福德。争强好胜的人不容易积累福德，还会消耗福德，嫉妒排挤别人，损害他人利益，当然都是自损福德之事。</p><p>心善口善身善，是积福之道，反之，烦恼习气重，心地狭隘，口不善，喜欢搬弄是非，身不善喜欢造作恶行，心不善只想利己，这是消福之行。烦恼也叫作漏，烦恼漏，有这个漏，善业难集，福也难积，有点福因为烦恼就会漏出去了，因此福总不够用，动不动就出事，心不安，道不坚。人在遇到病苦，遇到麻烦和灾难的时候，总以为是自自然然发生的，每个人都会这样想，就习以为常，从来不反省因为什么出现病痛和挫折种种不如意，因此就不会吸取教训，来改变自己，那么痛苦苦恼就会一直伴随着自己，做什么也不顺利。</p><p>三、什么是有漏福？什么是无漏福？</p><p>福分为有漏福和无漏福，有漏福不能到解脱的彼岸，无漏福才能护送行人到解脱的彼岸。有所求于世间法而修的福是有漏福，带有世间法功利心而修的福是有漏福，有我的心而修的福是有漏的福，为了得到世俗法回报而修的福是有漏福。无漏福是以无所求无所得的心所修的福，是没有功利心所修的福，是不为自我不为世间回报所修的福。</p><p>有漏福能享尽，在世俗法一享受就会消失了，需要不断的修福才能有福可享；无漏福享不尽，只要修出来了，就能保持到成佛之时，因为无漏福与功德相连，功德不失，福就不失。有漏福与世间烦恼相应，无漏福与成佛度众生的清净大愿相应，愿越大，福就越大，发愿就生福。有漏福会强化一个人的我见和我执，而无漏福则相反，会支撑修行人断除我见，消除我见，提升各种证量和智慧。</p><p>初学佛人都是从有漏善和有漏福开始修起的，心越来越空，越来越无为，越来越无所求，功到自然成，最后才能修出无漏善和无漏福。这是修行的过程，在学佛的最初阶段一定要先修有漏的善和福，因为众生心中有恶不善法，就要用善法对治。当修到相当程度时，心才与空相应，心中的恶不善法才能消失殆尽，这时候就不要再着善法了，有善法心就不空，不与道相应。</p><p>我们现在都处于努力学习四正勤阶段，都在努力断恶修善，等到把恶都断除了以后，善也不用特意修，心中善恶都不着，才是真正的无漏。四正勤：未生善令生善，已生善令增长，未生恶令不生，已生恶令断除。这个阶段人人都要经历的，修行越精勤，四正勤就能越快的修完，从而证得无漏。</p><p>四、福德的差别导致正报依报的差别</p><p>在三界六道中，福德大的众生都在天界享乐，少部分在人中，福德小的众生都在三恶道受苦，一部分在人中受苦。福德越大寿命越长，福德越小，寿命越短，如果是受苦寿命就越长。天人看人类的寿命最多几分钟，一辈子快速灭亡，又快速出生，很无聊。人类看畜生尤其是细菌的生命也是非常快速的。</p><p>蚂蚁蜜蜂辛辛苦苦一辈子，认认真真的活着，团队配合得井然有序，可是在人类看来，有什么意义吗？人类也如是，一辈子辛辛苦苦，认认真真的活着，名利权位，各种第一第二的，可是在天人眼里，有什么意义吗？人类之间的各种争夺，就如蚂蚁之间争夺蚂蚁蛋一样，就如蜜蜂之间争夺花粉花蜜一样。人类觉得自己伟大，蜜蜂蚂蚁也觉得自己了不起。自大都不过如此，都是眼界所局限的，福德限制了众生的生存方式和理想道德。</p><p>福德不足的人都在搞世俗法，一心在世俗法中有所成就。福德大的人，一心搞出世间法，力争出世自在解脱。福德限制了人心和理想行为。有的人给他机会多修福做功德，可是他的福德不够，就不喜欢修福不喜欢做功德。缺的东西，不好弥补，缺福德，不好修福德。</p><p>五、福德的重要性</p><p>福德是佛法修证的基石，如果福德不足，禅定就修不上去，没有禅定或者禅定不足，理解法义就很困难。福德不足，有些事情看着很容易，却怎么也做不到。明明觉得持戒很容易，就是持不了戒，有些法明明觉得很容易理解，就是无法深入观行。没有福德，什么事也不如意，包括在世间法上的种种事业。禅定和福德具足以后，在每一个法上都容易出现观行智慧，让我们证得空，心空无我也无物，解脱自在。修行也是圆满种种见道因缘的过程，只有因缘条件具足了，才能见道得法眼净，证得空三昧。</p><p>六、福报与福德的区别</p><p>众生布施得福，但因布施的心态不同，得福不同。所说的心态就是指是否是以有所得心、自私自利心、有所求心、贪欲心等等，如果有这些心行心态想法而行布施，只得福报，不得福德。德代表心行清净，无我无私，不求回报，没有所求，或者是不为个人私利私欲而求，没有不纯正的目的。一颗纯净的心，就是德，清净无欲的心，就是德，以这样的心行布施，才能得福德，才能成道，才能有道。</p><p>有德，就有波罗蜜，能到智慧的彼岸；无德，就无波罗蜜，不能到智慧的彼岸，修道就不成就。有所求的心量非常小，得福当然就小，无所求的心量非常大，得福也大，德也大。</p><p>所以布施的时候，尽量不要有所求，有所贪欲，有所功利心。不管做什么事情，如果有贪求，有贪欲，有私心，目的不纯，心不清净，就没有功德可言。有所求的心量非常小，得福当然就小，无所求的心量非常大，得福也大，德也大。</p><p>经常修布施行的人，要静下心来反观自己，修布施修福的目的是什么？是否纯正，只为了道业或者是为了众生，如果发现其中参杂了贪欲，就要不断的清净自心，清除染污，去除遮盖。因为这么努力的布施仅得福报，没有波罗蜜，福报消耗完了就什么也没有了，德不存在，道业上无法进功。反之以无所求无所得之心，以利他之心行布施修福就会获得福德，不仅有福，还有德，而德永远属于自己的，不会消失，它是成就道业的资本和资粮。</p><p>七、享乐就是消福</p><p>学佛修道人应该常常反观自己都在哪些方面不断的消耗着福德，反观出来之后就要改正，注意不要轻易浪费自己的福德，以使道业快速增进。现代社会物质生活发达，是不是说明今时众生的福德大，而佛世时众生的福德小？根本不是这样，福德的大小，不看表面的奢华与否，而在于能否把精力和福德用于道业上，用于善业上，能否不断的开启智慧的宝藏，能否把福德都留在如来藏中为后世修道所用，而不空耗在世俗法中。</p><p>世人福德不足时，往往就会生在浮华之世，轻易的把福德种子套现出来，用来享受世乐，用来显示自己的权贵。如果学佛人不觉悟，而随顺世俗享乐，随意的消耗自己的福德，做无益的俗事，不为道业打算，那是无智无善根的表现。有善根有智慧的人，把福德留着用来修道，不套现为世间法的享受和炫耀。很多人总是以拥有世俗的名利和权贵引以为傲，在虚幻的生灭法上计较不停，不知道富贵荣华如空花，不久即灭，有也是空。世人都难体会到空，只知道有，所以才有及时行乐，不为后世着想的心态。</p><p>八、如何获得无为福</p><p>世间人大多能享受有为福，却享受不了无为福，因为大多数人的心都是有为的，不能无为，而无为福极大，远远大于有为福，一般人没有无为的体验，无法体会二者之间的差别。有为的人在世间里心不空，种种生心动念，种种执取，种种造作，动荡不止，不肯停息，非常劳碌，无时无刻不在消耗着身心，虽然能享受到一些劳碌的有为福，但代价大，得不偿失。因此就需要减少妄想，多平复休养身心，渐渐就会获得一些没有祸患的清净的无为福。</p><p>如何平复身心获得无为福呢？多观察五蕴世间一切法的空，少动少做，对一切人事物理少生心动念，少有感触，少有喜怒哀乐这些伤身伤心的情绪。因为都没有必要，生灭幻化无常的法，凭借因缘出现的法，因缘灭法也灭，执取了也是徒劳，结果都是一场空，还消耗极多的时间、精力和心血。大智大心者应该着眼于长久和永久，多做无心的功夫，减少情绪化的反应，不管遇到什么境界，心都要空，没有其他的念想，渐渐的心就平淡清净了，消耗的少了，身心健康，心地无为，道业也进步了。</p><p>心态平和，念想非常少的人，心地比较单纯善良，没有复杂心思，身心健康调和，磁场好，有亲和力，人际关系好，无意间就集聚了无为福。有些人对世间一切法都执取不舍，思想情绪和心境变化无常，身心都有苦，虽然能获得一些有为福，但代价大。所以能做到心空就有无为福，心空就是世间最大的享受，是心地清净的果报。</p><p>九、福与苦的关系</p><p>许多小动物都是夜行众生，白天睡觉半夜出来活动和觅食，因为它们怕光怕人，有光亮时它们就尽量不出来。这是由于它们色身机制决定的，也是由于无福不能自力需要偷食吃决定的，总之就是由业力造成的。小畜生没有福德，就必须怕人，怕比自己福德大的众生。同类众生也是，福大者占据领导地位，居同类之首。</p><p>所以每个人如果把福德消耗没有了，又有三恶道的业，就必须去三恶道受苦，三恶道几乎不需要多少福就能存活，无福必然有苦，福和苦如称两头，低昂等时。如果学佛人也不懂得多修福，少消耗福德，那简直是很遗憾的事，不知道福能消耗没有了，没有福德就受大苦，这是无知和愚痴。一个人不肯修福，甚至举手之劳的利益他人的事都不肯做，绝对不是一个聪明人，心中只有自己的人，都不是聪明有智慧的人。</p><p>十、为什么说德不配位必有灾殃？</p><p>德，包括福德、品德、人格、修养、才能、才干等等可用资源；位，包括地位、权势、名声、名称、眷属、利益等等。用这些资源投资去得到那个位，如果资源不足，就是高利贷，最后资不抵债，倒闭、破产、负债，也有可能家破人亡，以生命去抵债。如果生命也不够抵债的，福德欠缺太大，就会下三恶道，甚至沉到三恶道最底层，再上来就很困难了。</p><p>世间的名声权势人人都觉得好，都想要，可是那个却福德不够，如果耍手段强取豪夺，那么高利贷会让人付出巨大代价，最后发现还不如默默无闻过得踏实和实在。人生在世争个什么，凡是得到手的，都需要消耗相应的福德，福德消耗没有了，做人的资格也就没有了。所以不要追求名闻利养，不要求他人高看自己高抬自己，不要求尊重权贵，不要求受人仰慕，不要不择手段，不要求在人上，在人下者利益更大，谦卑谦让即生福，谨慎即生福。</p><p>反之，当自己种种欲望都实现的时候，即消耗了福德，名声起来的时候，就消耗了福德，志得意满的时候就消耗了福德。消耗福德最大最快的就是做恶事造恶业，犯戒违规都是消耗福德最大的行为，违背五戒十善，杀盗淫妄，贪嗔嫉妒，两舌恶口，做奸逆小人，一切的恶心恶行，都极大的消耗福德。福德殆尽，人间一切事业休废，也就不必再做人了。</p><p>得，即消福；失，即消业。受人尊重，需要消耗福德；被人辱骂，能够消业。所以忍辱为德，忍辱生福，忍辱能成大业，见道成道即为大业，最后成佛，顶业成就，就不需要再修行了，大乐。所以忍辱能成大业和大乐。福不要享尽，辱可以受尽。有福可以不享，有辱一定要受。有大志者谨记。</p><p>十一、福厚沉实福薄轻浮</p><p>在种地之前，先要把种子浸泡一段时间再种到土里，种子事先浸满水，埋在土里发芽快。在浸泡的时候，水面上会漂浮一层种子，这些种子都是不成熟的不饱满的，不能发芽生长作物的瘪子，不能做种子用，所以要把漂浮在水面上的种子剔除过滤掉，剩下的实的沉的才种到土里。这比喻什么呢？一个活人跳到海里可能要被大海淹没，而一个死人在大海里，会被海水托举上来而漂浮在海面上。这比喻什么呢？秋天的时候，高粱地里，成熟的高粱颗粒饱满，压得高粱低下了头，甚至把高粱杆压弯了腰；而不成熟的高粱却腰杆挺拔，迎风漂动摇曳，特别炫耀。这比喻什么呢？</p><p>福薄压不住好冲动的习气，福薄什么也压不住，烦恼习气都会浮出来。为什么不懂装懂非要对人指手画脚的？为什么每天浮躁的语言那么多？厚重的人从来都不多言多语。</p><p>十二、积善得福如何最大化</p><p>行善不被人知就是集阴德，不被人所知得的福大于被人知而恭敬得的福，阴德大于阳德。因为被人知就会被人恭敬赞叹，这样福德就得到了一部分的酬尝，以后得的福就少了。恭敬赞叹羡慕的回报没有什么意义，只能得到自我良好的感觉，增强我心罢了，得到这样的回报不值得。</p><p>做的善事越不让人知，得到的赞叹越少，将来所得的福越大。心越不在意自己的付出，越没有想得福的心，将来得的福越大，心越无为，得福越大。佛说无为福胜就是这个意思，心量越大，福越大，无所求的心量最大，得福就最大。</p><p>十三、小善与大善</p><p>小善有迹可循，容易被人发现和感知；大善则无形，不容易被感知，更不容易被发现，不容易理解，也许还会被错会。小善短期效应，只能照顾眼前；大善着眼于根本和究竟，着眼于长远未来，不管眼前得失。小善容易被当作善，大善也许被当作恶；小善可以伪装，大善不屑人知；小善人人赞扬，大善少有人懂，甚至恶之。总之，无智之人总是颠倒错见，不明正理。若以世人颠倒错见为归，则世间将无善矣！</p><p>若循着世人之指，只能走向毁灭和轮回；若背向世人之指，定会遭世人唾骂。大善难为，大路难行，则是此理，皆为世人之所嶂！世人翳眼生花，而谓他人无珠，横加指责，实是痨病而发。病入膏亡，不信医嘱，难救难治，只有循业受苦。</p><p>十四、主观故意布施的果报是什么？</p><p>主观主动布施，为个人修福，后世的果报当然是得福了。其中也不侵犯、损害他人的利益，也不阻碍其他人得利益，而且布施的对象也得利了，所以结果就是双赢。如果是发心为成佛道而修福，为救度众生而修福，今世后世的福德就会更大。如果什么也不为，什么也不图，只是遇到需要布施的机缘，随缘而做布施，应缘而行的布施，心空，这个福德更大，无为福最大，这是金刚经中佛所说。</p><p>修布施行是有次第的，首先是要为自己得福而修布施，心再广大一点，就会为众生得利益而修布施，这个布施就有波罗蜜，能到解脱的彼岸，心再广大一些，心空无愿，所修是无为布施，能得佛受记。而心的广大与否，都由福德决定，福德小，心量就小，福德大了，心量就会变得广大了。所以能够发菩提心，发大愿，也靠福德的支撑。福德大了，眼光就广阔，看得长远，智慧就广大无碍。</p><p>十五、福大能降魔</p><p>如果不勤修福德、不勤修智慧，信根不具足，善根不具足，修着修着，魔就会附身，其人也不知是魔着。楞严经第九卷讲了很多魔鬼附体的事例，自己多对照对照。魔鬼附体的时候，最开始会给你很多世俗法的好处，让你身心愉悦快乐，让你得禅定，让你得财富，让你病退身体健康，让你似乎有神通，让你觉得自己了不起，其实都是魔力，不是自己的道行。等到魔鬼把你利用完了，你没有利用的价值了，魔心生厌就会抛弃你，然后你是个什么？原形毕露，死后地狱。</p><p>佛说得人身者如指甲中土少，不得人身者如大地土多，佛陀这句话是不是完全确实？观察如今的众生，有善根福德的人太少太少了，即使学佛，也是无数贪嗔痴烦恼附着于心，所以无数学佛者命终仍然三恶道受报，只有真正断我见之人可免三恶道。然而有多少人能真正断我见？极少极少。如果谤佛谤法，就不是一般的三恶道了，那就是无间地狱道，极其漫长的岁月煎熬，无有出期。众生确实可怜，但是其可怜人必有可恨之处。</p><p>当一部分众生精进修学佛法，无明烦恼减轻，福德增加，必然会改变其自心器世间,，同时共业众生的如来藏也会受其感应，会显现出美好富足的器世间，世界看起来就会变得美好，各种资财就变得富足。当世间变得越来越美好富足的时候，与此相应的有善根福德的众生会投生过来，从而影响和带动世间更加的美好光明。而福德不足的众生与此世间不相应，恶业众生越来越少。这是良性循环。反过来就是恶性循环，恶业众生增加，善业众生减少，菩萨都不愿来此世间，这个世间的生活环境就会变得恶劣。</p><p>十六、种善根的重要性</p><p>一阐提断善根，不是指一般的不信有真如心如来藏，而是在不信的同时有恶语相加，诽谤极重，影响非常不好。不信有如来藏的人占大多数，一阐提罪人没有太多，占极少数，否则无间地狱就装不下了。</p><p>文殊菩萨为五百比丘讲大乘法，比丘们在不信的同时，起身离开了，心里有嗔心，尤其是对文殊菩萨讲法的嗔心，这个罪比对一般人起嗔心要大很多倍，所以他们就下地狱受苦去了。这些事文殊菩萨早有预料，舍利弗问文殊菩萨既然知道这个结果为什么还要给他们讲大乘法，文殊菩萨说，虽然他们下地狱了，但是他们善根已经成熟了，到地狱里以后知道忏悔，一念悔心地狱罪消灭，就会升天，然后再回到人间修学大乘法，最后证道。如果不给他们讲大乘法，他们虽然不会下地狱，但是也不会种下善根福德，没有机会修学大乘并且证道。</p><p>所以有些事情暂时看是不善不利，但是从长远来看，会有很大利益。大菩萨的见识广大，目光长远，能看到长远利益，所作都能饶益有情。而普通人只能看到眼前利益，看不了长远，所以目光短浅。</p><p>学佛人既然是学佛，就应该多读佛经，多了解佛的三大阿僧祇劫的修行经历，也要多了解诸大菩萨的修行历程，多了解佛菩萨的大智慧行，对于自身修行就会有极大的指导意义，不会茫无所知。佛经里讲的既全面又究竟，内容丰富详实，多读一定会受益匪浅。为后世打下基础，也有了辨别佛菩萨的慧眼，能识别出各个传法之人是善知识还是邪师，不受人欺瞒，不走邪路，成佛快速。</p></div>"
},{
    "title": "第七章 依法不依人篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p>第七章  依法不依人篇</p><p>一、真正的依法不依人是连佛也不依</p><p>《大宝积经》佛说入胎藏会第十四原文：<strong>佛言。（如来）是知道者。是识道者。是说道者。是开道者。是大导师。如来。应正等觉。明行足。善逝。世间解。无上士。调御丈夫。天人师。佛世尊。世间之人无知无信。常与诸根而为奴仆。唯见掌中。不观大利。易事不修。难者恒作。难陀。且止。如斯智慧境界。汝今应以肉眼所见而观察之。知所见者皆是虚妄。即名解脱。</strong></p><p><strong>难陀。汝莫信我。莫随我欲。莫依我语。莫观我相。莫随沙门所有见解。莫于沙门而生恭敬。莫作是语。沙门乔答摩是我大师。然而但可于我自证。所得之法。独在静处。思量观察。常多修习。随于用心。所观之法。即于彼法观想成就。正念而住。自为洲渚。自为归处。法为洲渚。法为归处。无别洲渚。无别归处。</strong></p><p>释：佛说，如来是深知所修之道的人，是讲说道者，是开发修道之道者，是世间的大导师、如来、应正等觉、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛世尊。世间之人既无知也没有信根，常常作六根的奴仆，只能看见手掌中的小利，看不见更大的利益，修道这样容易的事不去修，生死苦业这样困难的事却永恒的造作。</p><p>难陀，先停下来不要说了，像这样的智慧境界，你现在应该来观察用肉眼所见到的法，就会知道所见到的一切法都是虚妄的，这样就叫作解脱。难陀，你不要信我所说，不要随顺我的想法，不要依着我的语言，不要观察我的相貌，不要随顺沙门所有的见解，也不要恭敬沙门，也不要说沙门乔达摩是我的大师。</p><p>但是你一定要对于我所自证的所得到的法，单独在寂静之处多多思量和观察，要经常的多多的修习，对于所观察的法，如果你能够很用心的修习，就会对于所观察的法观想成就。自己亲自观想成就的法，就是亲自证得的，从此以后就会用正念住在法中，这样的话，你自己就可以做洲河的陆地，你自己就是所皈依之处，你自己所证得的法就是洲河中的陆地，就是所皈依处，没有别的陆地，没有别的可皈依之处。</p><p>这段话佛说的非常精彩，就是告诉弟子一定要实证，依靠亲自证实的法，不要盲目相信和依靠没有实证的外法，不管是什么法，不管是谁说的法，都要拿来观察和检验，观察过后能够实证了，才可以相信和依止。就是连佛自己所说的法，都要不断的对其进行观察和思量，实证之后才可以完全依止。这就叫作依法不依人，连佛陀也可以不依，一定要依法依真理依事实，如果没有经过检验，就是盲目而依，不开智慧。</p><p>于此相对比，末法时代众生福薄无智，一定要依人，只要此人出了名，有了名气，就会无原则的靠上去，以获得归属感，对于法却没有能力加以检择和辨别，完全是情执。那些总是拿着某某论视为绝对真理的人，应该醒一醒了，依着名人的人名而判断法的正误，就是完全的依人，不是正信。正信就是佛陀所说的要去观察和思量，要去检验和实证，如果是事实，才可以当作真理而依，如果检验不了实证不了，那就甚勿开口评判，免得造下谤三宝恶业。</p><p>二、智慧低的人很难真正依教依法</p><p>如果自己的智慧低的话，即使依教，也无法会依，因为看不懂教，不知教法的真正含义和指向，往往会误会教法，错解教法。这样依错解的教法，再去比对其他人所讲，参照物错误，比对出的结果当然就是错误的，就不能如实判断他人所讲正真与否。</p><p>如果智慧低，想依法也没办法依，同样是判断不了法理的真实含义和指向，对于法理不是错会就是朦朦胧胧不懂，对其他人所讲法义看不懂，无法真正理解，这样就无法如实判断其他人所讲正真与否，自己就得不到法益，再喜欢强出头到处评判，就容易造下诽谤业，不仅阻碍自己的道业，还有愚痴诽谤的恶报。所以在自己智慧还不足的时候，埋头学习和修行，不要去评判任何法任何人，做一个明智之人，不造恶业，不受恶报。</p><p>三、依法不依人的问题</p><p>如果有实证，能现量观行，就依靠诸法的事实真相，不依任何一个人。只有事实真相才是真正的法，究竟的法，然而事实真相却不是一般人所能知能证的，一般人只好依着人的言论。然而人的言论都有缺漏和不足，即使佛的言论，也有表面的意思（语）和究竟的意思（义），一般人弄不清楚，那就依不了究竟义。</p><p>总之，只有实证才有办法依一部分事实，将来再逐渐依靠全部事实真相。大智者一定如此，诸佛都是依靠事实真相，尤其是第一尊佛威音王佛全部依靠实证的真理，没有人可依。所以我们还是要想办法修出禅定，在定中观行，争取实证。依着人毕竟是不可靠的，佛告诫过弟子汝意不可信，证阿罗汉果才能信汝意，即使摘引佛经，也不一定正确。如果菩萨的论如瑜伽师地论与佛经不一致，那就以佛经为准。然佛经也分层次，依义不依语也很难，没有实证很难懂得真实义。可见佛临终时嘱咐的四个依，当时该是以一种什么心境讲出来的，内心该有多么担忧？</p><p>如果佛没有印证哪位菩萨是什么证量，可以完全百分之百依止，那就不能完全依止、百分之百依止，毕竟菩萨没有具足佛的智慧，其智慧还有缺漏，即使弥勒菩萨也曾被佛呵责智慧欠缺。所有菩萨所说法，当然都可以依止，但是不能百分之百依止，菩萨论里肯定有一些缺漏和不足，没有法眼的人观察不出来。即使瑜伽师地论，也不是弥勒菩萨本人亲自来人间所讲，而是中间经过了一个菩萨的口转述，这个菩萨的证量如果不是非常高，其转述也会有误。所以一句话，十个人转述，可能就有十个意思。所以每个学人还是要用心于观行断我见，再明心见性比较稳妥。</p><p>四、依法不依人</p><p>依法就是依靠事实和真相，这是极其困难的事，因为智慧不足，无法证得和检验事实，说法能与事实不相冲突，是极其重要的，与佛说不相冲突是非常重要的。实证，就是要证得事实，与事实相符合，这是修行最关键之处。所谓的证据就是你亲自检验过了，确定不移了，才可以信从；如果检验不了或者没有能力检验的法，就不能作为你所依的法和事实。</p><p>依人，就是以有名声的人为主，依人而确立法的是非，不是纯粹从法理法义和事实的角度来判定法的是非，如果把人名遮盖住，对于这个人所说的法，极大多数人就会无所适从，无法抉择，这样依人过失极大。学佛修行要依法依事实，而不是要依人，除了佛陀，其他人都不能百分之百依从，否则佛陀临终交代、谆谆教导的依法不依人，就成了空话，我们就违背了佛陀的教导和良苦用心。</p><p>佛陀如果没有印证哪个人所讲如何如何，或者是百分之百正确，那就要谨慎抉择和判定。只有佛陀一人讲法百分之百正确，可以百分之百依止，其他人包括弥勒妙觉菩萨都不是百分之百正确。每个众生，每个菩萨，都有或多或少的缺陷和错误，没有智慧没有充分的证据时，就不要轻易加以评论，有智慧时就拿出自己的现量观行来说明问题。</p><p>并且不管评论任何一个人，都要证据具足而确凿，说出个一二三四五来，把问题阐述清楚，如果不能，就是没有现量观行，没有证据，那就背后私下用功，提高自己的智慧水平，提高自己的观行智。如果没有证量，没有现量观行智慧，就选择缄默，不作品评，如果非要有所说，由于没有依据容易错评，评论错了，果报也很大。</p><p>如果自己不能现量观行，就不得不依有名声的人的言论，但这是属于依人，不是依法。很多人只相信名声和权威，是不得已的事，因为没有智慧辨别，只能依名声权威。如果有名声权威者法义有错漏，后世人就得永远跟着错漏下去，谁也不能对法义有任何弥补和纠正，佛法就是这样被扼杀停滞下来。世俗科技界学术界，从来不依人，科技总是在飞跃发展，日新月异，可是佛教里搞的这些依人的规则，致使几千年的佛教都无法发展下去。</p><p>五、观察智慧的可贵和稀有</p><p>“很多高智商的人往往更倾向于依赖直觉，而不是理性思考来进行决策。”这句话是世间人的认知，我们众多的学佛人怎么就没有人有这样的观察力和认知呢？包括所有的佛学大师们。</p><p>社会上那些搞哲学和心理学、社会学的人，其观察智慧非同一般，远远高于我们学佛群体中的修行者。为什么佛教团体里的人智慧这么衰呢？各个辩论家们专业非专业的，其思惟观察力惨不忍睹，只知道依人，依不了法，观察力那么弱，如何能依法？如果社会上各类精英都来学佛修行，佛教该是什么情景？</p></div>"
},{
    "title": "第八章 有情与无情篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  有情与无情篇</strong> </p><p>一、有情与无情的区别</p><p>有情与无情的根本区别就在于，有情众生的色身是由众生自己的如来藏单独出生和执持的，并且在色身上有七识的了别作用，因此就有五阴的活动，而无情的色法是由共业众生的如来藏共同产生和执持的，没有七识和五阴。因为七识是单个如来藏输出的识种子生出来的，不可能是众多如来藏共同输出识种子形成的，因此无情物没有七识五阴活动，不是众生。有情众生五阴活动和无情的物质色法活动的根本区别在于有情众生的五阴身有受、想、行、识的功能作用。</p><p>如果众生的意根觉得某个物质色法对自己有用，可以作为自己的色身，他的如来藏和意根就进入或者附着在这个物质色法当中，生起五阴活动，这就是有情众生的附体现象。众生想投胎的原因就是想要有五阴活动，没有色法就没办法进行五阴活动，所以众生都会想办法投胎，实在没有投胎的福报和机缘，就会利用物质色法作为自己的色身，然后在这个物质色法上进行五阴活动，所以在众生的色身上一定有受阴，或者有想阴、有行阴和识阴的功能作用，这几个作用合起来才能形成五阴众生。如果物质色法不能被众生所用，无法产生五阴活动，众生就不附着在在这个物质色法上。</p><p>蚯蚓在被截成两段、三段，或者几段以后，每一段都可能成活，这时每一段身体就成为一个单独的蚯蚓，单独的蚯蚓就是单个的众生，有它自己的如来藏促成单独的五阴活动，其它几段成活的蚯蚓也如此。因为蚯蚓的身体有特殊的再生功能作用，它的身体功能就可以被利用，众生的如来藏和意根投入进去就可以拥有自己的色身，有五阴活动了。其它动物的身体截开以后无法再生，不能再利用为色身，众生就不投入其中，被截断的肢体就会坏灭。</p><p>那些无福无缘投胎的众生会利用一切可利用的物质作为自己色身，大千世界众生的数量太多了，没有色身的处于游离状态的孤魂野鬼类众生非常的多，碰到任何投胎的机会都不放过，想尽办法去投生或附体，以便有自己的五阴活动，没有色身就觉得没有依托，感觉非常苦，能利用色身在世间生活就有了依托，谁也不希望无身。如果温度、湿度等环境条件适合的话投胎附体的众生就特别多，他们可能会变成各种细菌类的众生，或者投到极小的蜎飞蠕动类的众生中。不管投入到哪类众生中，只要能有一个色身作为依托他们都愿意，尽管细菌的生命生住异灭非常快，投了又死投了又死的，他们还是要投，因为无身的感觉真苦。</p><p>二、消灭病毒属于杀生吗？</p><p>病毒就是对人类无益有害的细菌类众生，既然叫作众生，杀之就叫作杀生。但是佛陀所制定的不杀生戒当中，不包括细菌类众生，因为在娑婆世界的人间，任何人都没办法避开细菌而能存活，大神通者例外。</p><p>菌类众生，漫天遍野，根本数不清。身体当中和身体表皮以及空气中到处都是细菌，食品中也都是，发面的面食都是依靠菌类才能把面发起来，各种酵素，腌制的食品等等都依靠菌类，没有菌类，很多饮食人类就享用不到。人类的生存一定要依靠着菌类众生，否则就无法生存。比如饮食的消化吸收和排泄，胃肠的蠕动，都依靠着细菌的帮助，身体当中无处没有细菌，当然菌类包括有益菌和有害菌。有害菌就是能够伤害人类色身的细菌，能致人类生病死亡的细菌，吃药消毒就是对治这部分细菌。这部分细菌死亡，人类身体才能健康，生命才能有保障。</p><p>真正严格说起来，所有人都杀过细菌，包括主动和被动，免疫力强的人体细胞遇到来侵犯的病毒，就会主动吞噬这些病毒，人类并不知道。如果消灭病毒属于杀生，佛陀所制定的戒律没有人能守护得了，也就没有人能得道了。由此可知，消灭病毒不属于杀生，为了保护人类这种高级生命，消灭有害的最低级生命，这是没有办法的事，生命进化就要这样做。但是因果却存在着，未来劫，这些细菌托生为有一些福德的大型畜生和鬼类众生，以及人类众生，就会对人类起嗔心，有嫌隙和怨怼。</p><p>三、细菌将来能变成人类吗？它们如何变成人类众生？</p><p>细菌将来不仅能成为人类，也能学佛修行，也能成就佛道，关键它们是如何变成人类的。能成为哪一道里的众生，一定要与这道众生的福德相应，乃至于成为欲界天人、色界天人、无色界天人，也是要与这些天界众生的福德相应。将来往生到其他佛国土，其福德也要与这些佛国土的众生福德相应，否则就不能生活在一起。既然人类当中一个家庭成员，其福德也要相应，否则就不能成为一家人，或者一家人分崩离析，各奔东西，各凭自己福德生活。一个团体也是这样，福德不同，就不能到一起，不能共同谋事。</p><p>细菌是众生界最低级、最低劣、最微小、最没有福德的众生，它们通过在人类身上以及大一些的畜生身上慢慢集福，为这些众生提供服务，维持这些众生的基本生命活动。福德集聚到一定程度，就会托生为稍微大一些的畜生，畜生们互相帮助时，福德再增加，就会托生为再大一些的自主性强生存力强的大畜生，直至托生为人。如果因缘好遇到了佛法，就会迷信于佛法，最后正信于佛法。</p><p>众生所集聚的一切福德，无不是为其他众生服务而来，所以我们要想拥有更大的福德，就不要再自私自利，只想自己那点事，不肯利益他人。事实是帮人就是帮己，自己修的福德从来都不会落到别人身上去，修福都不是为别人修，尽量让别人得利益，自己才有利益可得。</p><p>四、有害菌和食肉畜生是如何得人身的？</p><p>细菌是如何成为细菌的，如果要追本溯源，就没有实例和证据，也找不到佛经的依据，有害菌是如何成为有害菌的也同样无法追本溯源。但是有害菌只是对一部分众生有害，不一定对所有法界众生都有害，也不一定永远都是有害菌而不改变，生命物种在生死轮回中会发生变异，因为尽管菌类众生非常愚痴，但毕竟还有极其微弱的识心活动，有非常微弱的业行，只要有业行就有果报，生命就会发生变异。至于大型畜生类，其业报结束，就会逐渐投生为人，具体参考楞严经中佛说六道轮回的真相。</p><p>大型食肉畜生一般前世都做过人，因为造作了恶业才投生为大型畜生的，恶业消灭了，当然还会变为人类。人身是一个重要转折点，可上可下，至于人类能不能再投生为最愚痴的细菌，现在还不得而知。</p><p>五、细菌与细胞的区别</p><p>有人说细菌能分灵，当然灵是指识心，七个识。如果细菌能分灵，分出多个意识和多个五识，那就有分身、意生身和化身，那就是大神通了，比人还厉害，既然比人还厉害，还当细菌干什么？细菌是最低劣愚痴的有情众生，有四大构成的色身，还有识心微弱低劣的功能作用，一个细菌拥有一个如来藏来持身。</p><p>细胞是无情物，没有七识的功能作用，也没有如来藏持身，因为细胞不是色身，是众生色身的基本组成部分，是有情色身上的细小微粒，由四大种子构成。细胞分裂是有情众生如来藏的一个最基本的功能作用，是众生色身生灭变异的一个特征，色身的任何变化生住异灭都是有情众生如来藏的功能作用。细菌可以侵入到细胞中破坏细胞，从而使众生生病或者死亡。</p><p>六、情与无情同圆种智的含义</p><p>同圆种智是指智慧圆满无碍，转识成智究竟成佛的意思。情是指有情众生，有情众生成佛的时候，五蕴身三十二相八十种好是正报，无情的器世间环境佛国土是依报，依报随着正报转，佛所在佛国土也变得极其美好殊胜。心改变的时候，周遭的一切法都会随之转变。所谓福人居福地，福地福人居是也！</p><p>植物有生长期，有年轮，它的生命中没有七识八识的活动，因此植物不是众生，不是众生就没有轮回。它是众生生存的依报环境，是众生业力所感召的。众生如果有福，所感得的植物都会富饶而珍贵，否则就荒芜腐败。</p><p>七、四生九有二十五种众生中，细胞属于哪种众生？</p><p>细胞是组成众生生命体的基本组织，由四大种子组成，没有识心，所以不是单独的生命体，不是众生。四大种子的组成和生灭变异是如来藏的功能作用，所以细胞的一切功能作用都是如来藏的运行机制，一切生命的活动都是如来藏的运行机制。这部分内容特别深细，非常难于观察，比观察意根的活动要难上许多倍，这都属于唯识种智范畴，包括观察意根的运行机制，都需要唯识种智。一般人对意根的看法都不是现量观行出来，所以都不可靠，不可以太自信。</p><p>在显微镜下观察细胞的一系列活动，就会知道如来藏的运行机制该有多么细密深密，多么难知难测，也多么神奇，祂是如何构造生命体的，如何让生命体运行的，如何让生命体消失灭亡的？这些都极其深细难知难证。由此可知，整个生命体全部是如来藏的功能作用，所以生命体是属于如来藏的，不是属于意根我的，意根丝毫没有理由把生命体据为己有，成天我我我的，没完没了，没有自知之明，也没有知他之明。一切法都不知，才成天我我我的烦恼不尽，这就是最根本的无始无明。</p><p>八、色蕴和色尘的区别</p><p>色尘是四大组成的物质色法，是无情物，是被识别被作用的对象，没有主动性，没有自我性，没有无明和烦恼，也谈不到清净和不清净。色蕴是色尘上的蕴集作用，色尘本身没有主动性，也就没有蕴集作用，是识心加之于色身上的一种功能作用，有识心推动的色身叫作色蕴。识心作用于色身，色身就是鲜活的生命体，没有识心作用其中的色身就是无情物，是死尸，是色尘之一。识心在色身上的作用，就是身口行，有行就有业，有业就会留下业种，这样就蕴集了业果，后世就有苦果和乐果以及不苦不乐果。</p><p>九、为什么海拉癌细胞可以在体外存活59年不断的分裂生长？</p><p>这种癌细胞其实是细菌，是病毒性细菌，对人体有危害。细胞和细菌有区别，细胞是四大种子组成的物质色法，没有七识，不是有情众生。细菌不仅有四大种子组成的物质色法，还有意根如来藏和意识身识等识心，是有情众生。在身体里的细胞是受自身的如来藏单独执持生住异灭，出了身体之外就会四大分解，就会逐渐散坏灭去。</p><p>而细菌这种众生在身体里由细菌自身的如来藏单独执持生住异灭，出了身体之外仍然由细菌自身的如来藏单独执持生住异灭。各种病毒其实都属于细菌类众生，在体外可以存活，也许可以存活得比较好。所以病毒细菌只要生活环境适宜，无论在体外还是体内，都可以存活和发展。有的癌细胞也是病毒细菌，离开身体仍然可以生存。这两年出现的冠状病毒都是细菌众生，在低温的物质上仍然可以生存，各种物质上在适宜环境条件下都能生出细菌众生，如果环境发生变化，不适宜细菌生存了，细菌就会灭亡。</p></div>"
},{
    "title": "第九章 佛法与外道法篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  佛法与外道法篇</strong></p><p>一、外道们为什么第一次听佛说法就证果甚至是四果</p><p>外道们都修出了四禅八定，降伏和断除了不同程度的思惑烦恼，只差对四圣谛理的观行智慧，见道的条件就满足了，就是俗话说的万事俱备只欠东风了。这个东风就是指见道的因缘，一旦因缘出现，马上就能见道，其见道因缘就是佛陀来宣说四圣谛理。具足初果的条件就证得初果，具足二果的条件就证得二果，具足三果的条件就证得三果，具足四果的条件就证得四果，所以每个人听佛说法，所证的果位是不同的，差别在于见道条件的不同。</p><p>见道好比吃第七个馅饼，外道们已经吃完了六个馅饼，只是七八分饱，还没有完全饱，见到佛陀讲解四圣谛理，就吃了第七个馅饼，一下子就饱了。前六个馅饼是基础，给胃里垫个底，再加上一个馅饼，就把胃填满了。不要看人家最后结果，要看人家修道的辛苦过程和辛勤付出的汗水有多少，如果他们没有付出巨大代价，没有精勤修出的四禅八定，就没有六个馅饼的基础，再给他们六个馅饼，恐怕也不能吃饱见道。有人说佛与弟子一问一答之间，弟子们瞬间就见道了，不过几分钟的事，非常容易，没有那么的辛苦和麻烦。但可知道，这几分钟的见道功德，是佛的弟子们无数善根福德所集聚出来的，各自都用了多长时间吃了那六个馅饼，有多辛苦，前世和今世都付出了多少代价？</p><p>很多人眼馋运动员在比赛场一场比赛就拿到了金牌，国际金牌国家金牌，觉得他们怎么那么幸运，完全看不到他们积年累月的拼搏，流了多少汗水和泪水，舍去了多少休息时间，付出多少体力代价，甚至生命和健康代价，受了多少的委屈，才在比赛场上一举夺取金牌。世出世间哪有那么容易的事，证果像吃大白菜一样？无量劫的生死流转，恶业如山堆积和牵缠，几分钟几小时就能破除多少个无量劫的生死业障，灭除了三恶道的业，这怎么可能？梦里也不会梦见这样的好事，否则怎么会有无边无际的生死众生，而不是无边无际的佛？</p><p>二、佛法与世俗法的区别  </p><p>佛法是指导众生解脱之法，能够让众生解脱生死，世俗法包括种种外于佛道之法，儒家道家之法，这些法不能指导众生走向解脱，不能让众生解脱生死。只有佛法里讲到世间的幻化空，讲实相的空，证得空才能解脱。外于佛道之法，大多讲有，即使有讲空的，也只是一部分空，浅层次的空，世间的空都不究竟，更没有出世间的实相空。空就能解脱，有就是系缚。佛法就是解脱的无所求的空法，外道法就是系缚的有法，有所求之法。</p><p>佛法就是佛法，外道法就是外道法，思想观念不同，如果相同，外道法就不是外道法，也叫作佛法了。有人说老子也是开悟的圣人，但如果老子开悟了，他所传的法也能让众生得解脱，那佛就不必来人间，多此一举了。外道法与佛法的共同之处，就是禅定和世间善，思想观念和境界是不同的，佛法是讲世间虚幻不实，是讲空，外道法是讲有，在有的基础上行禅定和善法，因此无论禅定如何好，心地如何善，都不能证得空，无法解脱五蕴。</p><p>某些世间法中虽然也有本源之类的名词，都是一些浅义部分，是属于世俗性质的本源和起源，源头还是有，并不空，不涉及万法实质的和根本的生死源头。世间法都不是真正觉悟的法，否则世间法就叫作佛法了。</p><p>三、善法不是解脱之法</p><p>问：雷峰断我见没有？他心里还有我没有？舍己为人英勇就义的人断我见没有？心里还有我没有？</p><p>答：佛法就是学佛修行成佛的法，世俗法的善法、人间的善法都不是佛法，外道里也都有善法，只要不明解脱之理，善法也不能让众生解脱，只能得人天福报，报尽仍然不免三恶道的生死流转。要想避免生死流转，也要观行善法的生死系缚，把善法观空，心不执善法，才能得解脱。</p><p>另外得解脱的主体主人是意根，必须把意根对五阴身的一切我见不如实见不如理见全部灭除，不见五阴当中任一法为我为实，才能有希望得解脱。抱着我见而行善法，仍然是生死系缚。须知真正解脱的那个真心自性永远没有善心，不行善法，没有恶心，不行恶法，没有世俗心，不行世俗法，因此就不被这一切法所系缚，那才是一个解脱的心。偏执于善法和任何一个法，都不得解脱。</p><p>四、佛法与外道法有无论的区别</p><p>外道的无论，眼见色法，却说无。既然是无，为什么有言说？外道的有论，明明一切色法是无常空，却说是真实不坏。佛所说的法，不有不无，非有非无，既有既无，非非有非非无。取其中之一，而不论其余，就是外道见。佛法永远是圆通，左说右说，都说得通。而外道论总是不能自圆其说，自相矛盾。</p></div>"
},{
    "title": "第十章 修行篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  修行篇</strong></p><p>一、如何修行才有益处</p><p>修行犹如到苞米地里掰苞米，你的目的是掰苞米，拿回来煮着吃，吃饱肚子，不是为了到苞米地里参观浏览，所以掰苞米才是首要之务。当然在动手掰苞米之前，你可以大致浏览观察一下苞米地里的情况，哪些熟了应该掰，哪些未熟不要掰，然后选择从哪里下手掰。而有的人却不是这样，成天在苞米地里晃来晃去，饿着肚子东摸摸西看看，就是不下手掰，这是蠢人也。</p><p>学佛人也是这样，在大致浏览阅读熏闻了一些佛法之后，你要着手真修实练，选择一个最近的最容易下手之处，扎扎实实的用功办道，能得一点是一点，能证多少算多少，不能长年累月一辈子总是处于多闻熏习阶段，孜孜不倦的学习他人之法，替人数钱，有自己的财宝才是王道，否则就会饿死做个饿死鬼。</p><p>要想有自己的道行，不做饿死鬼，就要从基础开始扎扎实实用功，三十七道品修一点是一点，去恶修善，烦恼降伏一点是一点，心地清净一点是一点，即使没有见道，这些修出来的也可以带到未来世受用，修总比不修有用得多，总比数他人宝强得多。高高兴兴的数别人的钱，沉浸于其中，等到用时，才发现一分钱都不属于自己，那时就悔之晚矣了。聪明有智慧的人，如何学法修行，心里应该很清楚了。</p><p>二、末法学人与古时修行人的区别</p><p>越到末世，众生福越薄，善根越浅，以至于在佛法修证上，逐渐是说理者多，通理者少，明道者多，行道者少，而修行能真正证果者，更是凤毛麟角 。列子说：“大道以多歧亡羊，学者以多方丧生。”学法太杂乱了，由于不能深入，就不见头绪和章法。修行往往是知的越多，证的越少，因为没有禅定，就无法实证，而广闻多学不需要禅定就可以知解很多佛法，但实证就免谈了。现代人没法修禅定，如果再不多为众生讲一些正理，不少人就会到处广闻多学，学一些不如理的理论，如果指导实证的理都不对，那就更无法实证了。</p><p>我们最应该去参学的是古代那些修行者，要探究他们都是如何修道的，如何用功的，是不是都学一大堆理论，然后口若悬河的处处辩论，或者口若悬河的到处说教，当起了人师。自未有修证，焉能教他人修证，为何愿为人师？其中有没有彰显自我那个心？我们看古圣先贤们即使得道了，也都很谦逊和低调继续自修，不会轻易占据山头，或接师父递给的传法之棒，因为无我故，又有自知之明，有多贤圣人弘法，众生足以得度，自己道不坚固，何必非要强出头？而现代人正相反，不管什么道不道的，能出头就好。</p><p>三、古今学佛人的差别</p><p>古时的人根器都比较好，心性单纯务实，肯为修行付出代价，真修真干不计个人私利，能看得开放得下，烦恼轻微，贪欲少，出离心强。现代人浮躁不踏实，眼高手低，空腹高心，嘴比头脑厉害，全部用意识广闻多解，不能定中深入参究，浮在意识表面，不能深入内里，意根的究和意识的解差不多是天壤之别，解的多所以就慢心炽盛，烦恼不消，成为最重的修道障碍。</p><p>古时人佛法基础都牢固，细微之处修的都好，如今的现代人不理会基础佛法，认为四圣谛可有可无，好高骛远贪大舍小，由于没有基础的修行，烦恼不能降伏，心行不能转变，身口意行贪嗔痴烦恼很重，造成业障越来越重，而不是越来越轻微，学佛就没有进功。现代人都瞧不起外道，但除了佛法知见以外，其他任何方面都赶不上外道一半，人家外道都有出离心，心地淳朴单纯，禅定甚深，烦恼极其轻微，严于律己，道德品质等等各方面都优于现代学佛人。</p><p>外道们只是没有接触到真正的解脱法，一但接触到了，都有可能马上证初果到四果。现代人接触佛法一辈子，连个初果的影子都看不到，假证果的除外，怎么能跟外道相比？外道就是智慧不足，没有遇到相应的法，离证果解脱就差那么一点，很多外道遇到佛法，一听佛陀的法音，须发自落，袈裟著身，烦恼断尽。过去时代那么艰苦的生活条件，外道们都不在意，在深山老林里打坐入定，遇见佛陀讲法，就有几万人甚至更多人跟随佛陀出家修道，证果的也极多。</p><p>而我们长年累月的接触佛法，几十年下来八正道都修不出来，最基本的欲界定都没有，心里都是贪嗔痴烦恼，人我是非天天不断，一点苦不肯吃，一点享受不肯舍，财色名食睡样样都抓取，口里的理论能上天，身体所行近恶道。如果所谓的大乘学佛人都是这个样子，就是在辱没大乘法、毁灭大乘法，没有几个人能觉悟到这个事情。</p><p>四、学佛修行不是那么容易的</p><p>学佛修行是相当不容易的，因为无始劫以来的无明烦恼业障相当深重，我执法执相当严重，都解除破除掉相当不容易，非大力大勇大智不能为，非十方诸佛菩萨的历劫加持不能为，非护法神长久护持不能为。如果有人说修行非常容易，只要在某方面做一做，稍微摄入一点，就能成佛了，就能入如来家了，或者就能开悟了，其它的都不用修，不用深入系统的修什么，不用一步一个脚印扎扎实实的打基础，不用持戒，不用修定，不用付出什么代价，不用太辛苦，生活和学佛都快快乐乐的就能成办了。那我们就应该知道这个人根本没有成就什么，因为他肯定没有付出过什么，不肯摆脱世间五欲的束缚，贪爱执着还很严重。</p><p>持戒不行，禅定不行，基础的修行都不行，没有真正修习过什么，肯定也没有真正得到过什么。所以才说修行一生就能成佛，即身成佛，即生成佛，一句佛号往生就能成佛，戒定慧里不用戒不用定，只要般若慧就行，有慧就能直接成佛。对于这些说法，我们都要警惕，不能上当，没有走过那条路的人，往往都会说那条路很好走，真正在路上走的人，会如实了解路上的风景，会对人说如实语。</p><p>把佛法说得很简单，把修行说得很容易的人，我们都要警惕，没有经历过的，凭想象觉得都很容易，比如夜晚看着头上的月亮，觉得离自己很近，自己走到哪里，月亮就能跟到哪里，仿佛伸手可得。可是搭上云梯坐上飞机奔向月亮的时候，就知道无论飞出多远，月亮离自己还是那么远，总是那么远，感觉是很近，感觉毕竟是感觉，朦朦胧胧的，实际与感觉相差太大了。</p><p>学佛修行也是，感觉很容易就能成佛，就能证悟，实际上一旦上路开步走的时候，无明业障牵缠，哪一步都不那么好走，需要我们不断的丢掉一些世俗里的包袱，舍弃世俗里的一些享受，需要付出相应的代价，才能换得来一些成就，不舍不可能得。真正的好东西，没有能便宜得来的。</p><p>五、修道人的习惯是反世俗习气的</p><p>有一句话叫作：道之所珍，俗之所弊，俗之所贵，道之所避。修道正是反世俗的行为，只有反世俗，才能突破世俗的禁锢获得解脱。如果一味的顺从，这不是修道，与世俗无别，就不能脱俗出世。</p><p>修道人由于历劫久修，会养成有别于世俗人习气的特有习惯，比如节俭、勤奋精进、不爱重贪执身体，不贪吃贪喝贪睡贪享受，大多数行为可能都与世俗人相反，很多世俗人就会感到奇怪，看不习惯，认为自己对而修道人非，于是就想去纠正。</p><p>如果习惯于修道人的生活，对于修道人的习性就不奇怪了，而对于世间人的世俗贪婪习气就会奇怪了。反世俗才是正常的，合乎世俗才是不正常的。现在来看，到底谁正常谁不正常呢？什么才是正常呢？</p><p>凡是习惯于世俗生活的人，任何事都能自觉不自觉的随顺于世俗法，其实还是没有修到有反观能力的时候。世俗人贪，自己也随着贪，却不知道是贪；世俗人执，自己也执，却不知道是执；世俗人喜欢享受，自己也喜欢享受，还以为很正常，那就是不正常的。太习惯于世俗法，一点没有违拗的想法，觉得都很自然，这个人离修行还很远很远。与修行人接触，如果觉得修行人不合世俗规范，没有人情味，甚至总想要修行人随顺自己的世俗习气，这个人离修道还很远很远。一个人在修行上稍微上点路，就会觉得世俗法不太对，感觉别扭，这时候才开始有点觉悟了。</p><p>衣带渐解人憔悴，这是古时候形容修道参禅行者的语言。真用功修行，身体上肯定会到影响，少吃少喝少休息，甚至彻夜不眠，精进办道。这样参禅功夫才能连续起来，进展才快，有朝一日才能明心开悟。如今的人都爱惜自己的身体，舍不得让身体受苦，那就只有让心受苦了，而且是生生世世受苦，苦不堪言。</p><p>六、根器不同的人修行进程是不同的</p><p>甲：末法年代，有成果的人，都是乘愿再来的。没有成果的人，只能打好修行基础，建立良好正确的修行习惯，从长计议。</p><p>乙：再来菩萨也得有个几年的修行时间，才能再次出成果。不是再来菩萨需要花费的时间更长，十年二十年三十年，不是短短时间就能出成就的。每个人只能跟自己比，能比自己的现在和过去有一个比较大的进步，修行就是有成效的。不能一口吃个胖子，中间过度阶段，需要圆满种种见道的因缘条件，这是非常不容易的。当然意识见道就非常简单容易了，不需要中间过程，不需要圆满见道条件，只要脑子好使就行了。</p><p>七、借助假相修行才能有所成就</p><p>有人说，既然世间一切法都是幻化的假相，都是无生的，那我们就没必要再去努力做什么了，做什么也没有意义。这样说对不对？这样说当然不对，在假相上努力修行，正是为了证得世间法都是无生的，证得了以后才没有世间法的束缚，才能得解脱，只有借助假相修行才能成就，没有成就之前就需要非常努力的在假相上修行。在学佛路上所做的一切善行，都是为了证道，为了证得无生，为了证得无相和实相，证得之后才真正知道了无生，才能解脱成佛。</p><p>有为是为了无为，所以在有能力无为之前，有意义的有为该做的都要努力去做，做什么都是为自己而做，都是自己得利益，是自己收获无为的果实。表面上好像是自己利益了别人，别人得到自己的帮助，是自己护持了三宝，利益了三宝和众生，实际上还是自己得到了最大的利益。如果三宝不得利，众生不得利，那么自己所做一切都没有利益，都是无用功。所谓的利益，是在利益了三宝和众生的基础上才能出现的，他人没有得到利益，自己就不会得福得功德得智慧。</p><p>比如说布施众生得千倍以上回报，如果对方不接受，一倍的回报也没有，对方没有受益，什么回报也没有。就像布施虚空一万元钱，虚空无受无益，等于自己丢失了一万元钱一样，丢钱有什么回报，自己一分钱的回报都没有，何况千倍万倍的；就像布施大海一万元钱一样，大海无受无益，还会毁坏一万元钱，那么自己等于白白糟蹋了一万元钱，故意毁坏印刷的纸币还有罪；就像布施大火一万元钱，大火烧毁，布施不但无益还有罪。</p><p>有一些人对于自己的布施念念不忘，总觉得自己有恩于人，可实际上正是对方有恩于自己，若不是他人愿意接受自己的惠施，自己凭什么得到千倍万倍的回报？凭什么一点点的累积那么多见道的福德资粮？佛陀为了让众生多积累福德，临涅槃时特意让几个阿罗汉弟子留形住世，接受众生供养，给众生提供培植大福德的机会。那些阿罗汉其实不愿意受人供养，一是嫌麻烦，二是消耗自己的福德。可是自己作为佛陀的弟子，一是要尊重佛陀的安排，二是要利益众生。所以他们才不入无余涅槃而住世。</p><p>有的人做法布施，发个帖子接引有缘人进入正规修学，觉得好像是给师父做事一样，好像是其他人得利益了，自己付出点时间和精力，感觉吃亏了。不懂得自己法布施的结果是什么，有多殊胜，最后会得到多大的利益也许都数不清，算不过来。正因为自己做的这些功德和福德，让自己在今世后世修学过程中，快速成就佛道，免遭无量劫的生死轮回苦。这个果报虚空一样多的财宝都换不来，所得果报不能尽说，而得到自己法布施利益的人，远远不如自己有福德功德和智慧。三宝和众生得到自己布施的利益越大，自己的福德功德就越大，将来智慧就最高。只要目光不短浅，应该作以如实的观察，考虑自己的未来和最大利益。</p><p>菩萨的福德大于阿罗汉万倍亿倍无量倍，因为菩萨生生世世与众生在一起，举手投足之间就可以利益众生，同时就获得了千万倍亿倍无量倍的福德和功德，所以菩萨是大富长者，其富贵世间所有人不能比。福德和智慧圆满具足时时候，就会八相成道成为天人师佛世尊。</p><p>八、现代与古代学佛人的区别</p><p>现代人的特征，所处环境复杂，六尘境界太吸引人，学法容易，知识丰富，意识非常聪明，极其聪明，禅定却不好修，不能修道和得道，所以只能称作是学佛人，很少有修道人。古代人所处环境单一，得法不易，知识少，理论少，心地单纯，禅定容易修，所以修道人多，得道人也多。丰富的知识，最终成为了修道的遮障，变成了所知障，理论充足了，道却不出现，死于理论之下，犹如临海而渴死。</p><p>古人问：你们现代人都是怎么死的？现代人回答：被理论压死的，被知识毒死的，聪明过头死的。还有一种死，是研究死的。</p><p>九、基础打牢才能实证</p><p>每个人学法在把修行所需要的理论知识掌握到一定程度之后，就不要在理论上花费更多的时间精力了，因为理论不管学多少，最终仍然是理论，不能变成自己最真实的智慧，以抵御生死得解脱。只有实证了佛法才能生起大智慧，才能得解脱。而要实证，就必须从基础的四圣谛法一点点起修，一点点实证，不能跳跃式的修行。</p><p>我们现在就应该从基础抓起，基础很重要，一定要把基础打好。因为基础打不好，学再深的法也学不究竟，只能形成一种知见，顶多达到理解的程度，不能实际证得。如果所学的理论证不得，就不会生出真实的智慧，只有亲自证悟的智慧，才能引领我们走出生死泥潭。</p><p>所以我们现在要从四念处观起修，先证得小乘的解脱，然后再用这种方法潜心于大乘的参禅，就可以证悟如来藏。之后观察如来藏的功能作用，再获得别相智，智慧再增长，过牢关以后再参究唯识，熏习如来藏种子的功能作用，具有一分唯识种智道种智，那个智慧就相当了不得了。但这么大的智慧，不是一生几生就能获得的，是生生世世甚至是无量劫的善根福德的积累所成就的，是在最初的佛法基础非常牢固的基础上，一步步实证过来的。</p><p>十、放逸不精进道业就不增进</p><p>如果在修行中放逸了自己，就会在日常琐碎中迷失了自己，以至于道业无法进前，也许不小心还会倒退。能常常把握自己，反观自己，反省自己，反思自己，心无缝隙，烦恼就钻不进去，禅定智慧就会渐渐出生。道业没有往前进，肯定有问题。问题一直摆在那里，自己却发现不了，说明了什么？发现了问题，却不想解决，说明了什么？想解决却解决不了，说明了什么？世事最容易让人沉沦，想摆脱却是最困难的。心力不足，是缺少什么呢？</p><p>十一、如何最快的获得世间法的圆满具足</p><p>每个人几乎都追求世间法，希望自己在世间里最殊胜最美好，最有才干，最富贵，最有智慧，最有德行，最有修养，最受人尊重，一切都最圆满，包括家亲眷属，那怎样做才能达到这个目标，并且最快速的达到呢？那就是来修行，一心一意认认真真的修行，尽量舍弃自我的修行。只有修行一条途径，能够快速而圆满的满足自己的心愿，没有其它途径，其它途径都不能去除贪嗔痴，人的德行修养和世间法都不能得到圆满。只有修行修好了，人的福德智慧才华财富亲眷等等都会具足而圆满美好，包括审美力、语言文字口才、辩才无碍，种种修养都会得到提升。</p><p>佛陀是三界至尊，圆满具足一切法，包括世间法，在世间法里不管什么都是最，都是顶尖，无人过彼。菩萨与佛比不是最，但是与所有一切世间人比，却都是最，都超过于世间人，世间人所希冀和仰慕的，菩萨都具备具足，就看菩萨示现不示现用不用的问题了。我们应该像诸佛菩萨看齐，一定要把心尽量都用在修道上，不要再往世俗法用心了，得不偿失。修行功夫上去了，心会非常细致入微，感觉很灵敏聪慧，做什么都会有灵感，人有灵气，修道是获得殊胜世间法的最大最快捷径。</p><p>十二、闻法之后实修才是王道</p><p>广学多闻，叫作数他人宝，自己没有半钱分，见识了他人宝之后，要想办法得自己的宝，数自己的宝该是什么心境？临渊羡鱼，不如退而结网，不管见到深渊里有多少条鱼，都不是自己的，聪明的人应该回过头来结网，用网去扑捉鱼，你才能享用得到。可这个世间里的人，聪明智慧的人好像不多，只管欣赏他人宝，却不想拥有自己的宝，挨饿也不管。有些人天天津津乐道于闻法，从来不肯用功获得法，看完别人的，应该回头搞自己的，自己拥有该有多实诚？自己有才叫有，别人有怎么能算在你头上？</p><p>古人说学而不思则罔，我们应该说学而不修则罔。因为很多人也思，思的很浮浅，没有禅定，思惟只在法的表面，深入不下去，仅知道个皮毛，就说自己证了证了，浮浅和自傲得可怜。那点思根本不能叫作修，修是修理，修理自己的身心，身心经过修理之后，要有相应程度的改变，才叫作修。如果人还是原来的人，心还是原来的心，该怎样烦恼还是怎样的烦恼，怎么也称不上修，何况还想有修后的果，那是不可能的，自封的果，容易化掉腐烂。</p><p>十三、断除受觉不是修行的首要目标</p><p>有些人总以为断除了受觉，没有觉受了才是证道的依据和标志，其实降伏和断除受觉主要依靠甚深禅定，不管是否证道，只要有很深的禅定就能断除受觉，有四禅八定的外道都可以做得到。有初禅定都断不了受觉，初禅定里的受觉只是乐受，感觉很舒服而已，但还属于觉受的范畴。断除一切受觉需要修到受阴尽的时候，四禅以上的定才能把色阴断尽，之后才能断除受阴，证得受阴尽，再之后才能断除想阴、行阴。</p><p>得解脱是心解脱，不必断除受觉，只要不执著觉受就可以解脱，断除觉受不是我们修行的首要目标，首要目标是断除无始劫以来的错见和邪见，也就是把五阴当作我的我见，我见断除，不被我见束缚，就能初步得解脱，以后的修行就走上正轨了。</p><p>十四、大乘学人的误区</p><p>有一些修大乘法的人不注重基础修行，不注重基础的阿含经解脱道，把大乘与小乘截然的割裂开，认为此是此，彼是彼，互相联系不大，以至于割裂佛法的现象很严重。就像学中学课程的人自视清高，不屑于小学的课程，不知道小学的课程不学完就不能毕业升入中学修习，没有小学的基础，中学的课程就跟不上学不好，中学也不能毕业。</p><p>学大乘的这些人藐视三十七道品八正道等等实修之法，把这些法都当作小乘人修的小乘法，认为可有可无，所以直接越过去而去修如来藏法，因为没有戒定，学了十年二十年甚至更长时间，身心都没有一点转变，没有真实的受益，却像佛油子似的侃侃而谈，学问之高都可以考个状元了。然而所学得的理论，犹如空中楼阁，理在高空，人在地下匍匐，二者不搭界，这样的话如何能顺理成道？好高骛远的结果是哪个法都修不成，徒浪费时间，命终因其无修无证，随业风飘流，不能自主。</p><p>我们都应该静下心来理智的思考一下，大乘学人不应该具足七觉支吗？没有择法觉支犹如盲人摸象，没有喜觉支，说明所学没有入心，不入心心就不生喜，心无喜，身就不轻安，身不轻安，心就不定，心不定就不空，何来的智慧可谈？大乘学人不应该修四正勤吗？恶不断，善不增，心不转变，仍然是一个具缚的业障凡夫，一品烦恼没有断，如何能进趣初果向甚至初果？没有初果，如何大乘明心？</p><p>大乘学人不修八正道吗？没有正见，修什么道？不能正思维何以参禅？没有正语，何以守心守五戒？没有正精进，就会背道而驰；没有正念，何以正心？心不正，如何入道？没有正定何以有正慧？只有身心皆正，才能入于正道，所以说不修行三十七道品的人，修行还没有入门，大小乘人都不算，如今世间能遇到一个修道人很难很难，人心都很浮躁，喜欢走捷径，追求短期效益，众生前世根基浅，福德欠缺所致，再加传法者的煽动，就造成了这样的局面，如果不改良，佛教无人才可出。</p><p>十五、修行的误区  </p><p>学佛修行当中，不知不觉就会陷入误区，有些人会陷入的误区，认为既然都是空的虚幻的，有什么都无所谓，受既然是空的，那受就受吧，苦既然是空的，那苦就苦吧，烦恼既然是空的，那烦恼就烦恼吧，生死既然是空的，生死就生死吧，轮回既然是空的，轮回就轮回吧。</p><p>而有些人就会进入另一个误区里，认为既然修福这件事是空的，那我还修福还布施干什么？既然禅定是空的，那我还修禅定干什么？既然菩萨道是空的，那我还修六度干什么？既然成佛是空的，那我追求成佛干什么？反正都是空的，修不修都一个样。有些人学了如来藏法，就进入另一个误区，认为如来藏从来都不持戒，那我持戒干什么？如来藏从来都不修禅定，那我修禅定干什么？如来藏从来都不修福，那我修福干什么？如来藏从来不轮回，我还怕轮回干什么？如来藏本来就是佛，那我还要成佛干什么？</p><p>这些人却从来都不说，如来藏从来都不贪欲，我还贪欲干什么？如来藏从来都不烦恼，我还烦恼干什么？如来藏从来不杀盗淫妄酒，那我还杀盗淫妄酒干什么？如来藏从来没有无明，我为什么还要有无明？既然认为空了，那就空掉一切法，一个月少给半个月工资，就不要去计较了。为什么要有选择性的空？空掉责任，而不空利益和贪欲，这是什么空？</p><p>十六、一切法都不归我所有</p><p>世间一切法可以为我所用，却没有一样属于我所有，因为我不是这一切法的主人，一切法不是我生出来、变化出来的，我也主宰不了一切法，所有权不在我这里，我只有使用权。所以对于世间一切法就应该抱着随缘的态度，能用则暂时用一用，不能用就不要强求，反正我一无所有，永远都是一无所有，有用的就行了，何必苦苦去追求不属于自己的法。只有不求时，只有心空时，大福德才现前，殊胜的世俗才源源不断而来，但也只为我所用，也不归我所有。</p><p>十七、如何走向解脱</p><p>认一切法为真为有，即被一切法绑缚，遂有生死，不得解脱。所以应当时时处处观察一切法的生灭变异的无常性和空性，法观察得越深细，越会觉得法的现起与灭去，无来无去，无所从来也无所去，无主宰，空，这样解脱智慧就会越来越深，但也没有解脱者。一边造作世间出世间有为法，一边感受有为法的空和无为，心不废有也不着空，既空既有，不空不有，非有非不有，非空非不空，不落断常与一异中，辗转成就佛道。只有心空法空，才能渐渐跳出世间烦恼深渊。心空的同时也不废有，才能逐渐趣向佛法大道，走向解脱的终点。</p><p>只要心与空相应，就已经在解脱的路上了，心越能把法看空，离终点越近，空的法越多越解脱，空的程度越深越解脱，究竟空、彻底空、全部空，就到终点了，究竟涅槃。我空法空，早晚都得空，宁愿早空早成就，不要执有取诸法，不要姑息自己。烦恼早晚都要丢掉，早丢早解脱，晚丢多受苦。</p><p>十八、什么样的人才是合格的佛弟子</p><p>在学校里，一个合格的学生，一定是德智体全面发展的三好学生。在佛教里，一个佛陀的好弟子应该是戒定慧全面发展六度具足的佛弟子，是才能与心性完美结合的修行人。德才兼备的人是非常难得的人才，非常稀少，如果只有某种能力，而心性不善不调柔，这样的人是不能重用的，如果心性良善，能力不足，还可以勉强用，可以培养，如果能力和心性都不行，坚决不能用。</p><p>心性体现在无我上，没有断我见之前，有的人我性重，有的人我性轻，我性轻微的人当然比我性重的人容易断我见，容易证果。总想驾驭他人的人，就是我性重的人，不愿意被人管理的人不愿意服从领导的人，也是我性重的人，心性不调和，都是我心在作祟。我性轻微的人，比较随意，比较随和，对于一些人事抱着无所谓的态度，不太在意自己的位置和权势。一个团体出现问题最多的就是我性重的这些人，如果没有一个强有力的领导者，这个团体就会乱成一片。</p><p>一个佛教团体，一定有护法神在护持着，每个人的心性护法神都了如指掌，这个人是什么心性，有什么目的，能起到什么作用，护法神都清楚。所以一个人应该在团体里担当什么角色，护法神会管理，有的人私心重，对团体会起到破坏作用，护法神会想办法弄走和隔离。</p><p>十九、觉醒之后天下无事</p><p>曾经临在天亮之前做个梦，梦里弄丢了两个很重要的包裹，周围都是混乱的陌生人，就觉得这两个包裹很难找回来了，这时候心里还没有慌乱，反而很镇静很清醒很理智，好像知道自己在做梦，就决定快速醒过来，于是心里一使劲，就把眼睛睁开醒过来了，心里清明得很，很安详的躺了一阵，回想刚才的梦境，就知道梦里丢失了包裹，根本没有这回事，我并没有丢失什么。这个梦很清晰，至今记忆犹新。每个人的梦中尽管什么事都能发生，一旦醒过来，就什么事也没有了，可见清醒没有梦时内心确实舒坦，无挂碍无负担。</p><p>这样的梦很短，容易醒，可是生死大梦却很长很长，不容易醒，人们在梦里往往都在迷茫着、贪嗔痴着，业行不断，都以为一切人事物理都是真实的，悟道觉醒以后才发现，原来都是梦，实际上什么事也没有，能醒过来真好。可是要如何尽快觉醒呢？需要在梦里心地清明，知道是梦，不留恋梦境，有觉醒的发心，有定力，有智慧，有善根，有福德。尽管在梦里暂时还出不来，但一定要多行善业和清净业，不要造恶业，因为恶业对心地遮障很重，使心混沌，辨别不了目前是梦境，就不会发心出离幻梦。</p><p>在生死大梦中，一切法都是幻化出来的，看似真，实质却是假，心不清明的时候，以假为真，造作种种业行，尤其是恶业行多，导致流连于梦境中醒不过来。对于梦里的人绝对是有必要做一些善行清净行，尤其是清净行，能使心清明，看透梦境的本质，不迷执，出离的愿力强，定力足，智慧深，就会迅速觉醒，活在太平盛世中，清心寡欲，云淡风轻，无所事事，一片闲。所以不要无事找事，身心时刻不得闲，贪嗔痴烦恼恶业重重。世间没有什么事可执的，没有什么事放不开的，没有什么事可挂碍的，心里的事都是梦中事，执也没用，财色名食睡一样抓不到手，世间不过一场梦，很多人为了名利忙得不亦乐乎，确实很不值。</p><p>二十、背诵楞严咒的益处</p><p>修行越到关键之处，越有魔来干扰，越殊胜之处，越有魔来干扰，修行层次越高，干扰越大，修行无关痛痒的反倒没有魔来干扰。所以修习越关键的法，修习越深的法，越要小心谨慎。尤其是有人喜欢神通，魔就会给你神通，然后被魔控制，不脱魔掌。楞严咒就是护身符，一定要常常念诵，最好能随时背诵，魔就拿你没办法。学佛人如果都能念诵背诵楞严咒，魔王就会退出娑婆世界，佛法就会延续下去，楞严经不灭。</p><p>楞严咒有加持力，咒中都是诸佛菩萨辟支佛阿罗汉护法神的名字，等于念佛一样，或者比单纯的念佛效力还要大，因为有护法神具体护持和执行。具体表现在加持念咒者戒定慧的修行，和遮挡一部分业障，消除一部分业障，大的不可抵抗的业障不容易着身，使得修行顺利，在不知不觉之间戒律清净了，禅定提升了，智慧增长了，心清净了。念咒越专注效力越大，心越诚效力越大。如果不能专注，在行走坐卧做事情中念咒，心有些分神了，不能专一其心，但只要心诚，加持力仍然很大。即使是散心念咒，也有加持力，只要心里口里念咒了，都能得到护持。</p><p>如果修行不顺利，心散乱不能集中，应该有计划的每天行走坐卧背诵楞严咒。每个人学佛的最初，都应该念诵一定数量的楞严咒，直到修行如顺水推舟一样，才可以停止。这是在依靠诸佛菩萨四圣和护法神的加持力的作用，然后才会生起自己的心力，自力他力相结合，修行才能走上正轨。加持力能促使自己的心性改变，心性改变了，性障就消除。还有过去业行种子的障碍，大的业障由护法神遮止，小的业障自己受点业报无所谓，也是应该受，躲不过去的。大的业障在将来能承受的时候再受，那时就觉得也无所谓了，或者大的业障将来变得不太大了。心越空，对于业报越有承受力，会坦然接受，承担责任，偿还业债那是理所当然的。</p><p>二十一、如何能快速背会楞严咒</p><p>楞严咒的加持作用非常大，能增加福德，戒律圆满守持不犯，心念专一无杂念，精进于佛法的修行，让道心坚固，有择法眼，远离魔扰，具体看楞严经第七卷世尊对持楞严咒的种种益处。因此学佛人在最初学佛的时候，能够每天都诵持背诵楞严咒是非常有必要的，在佛菩萨和护法神的加持下，能省去很多干扰和违缘，转世俗心为修道心，修行进步很快。</p><p>如何能快速背会楞严咒呢？这就在于记忆力如何了，如果在读诵楞严咒的时候，能够专心一意，心无杂念，全部注意力都在楞严咒上，在读熟楞严咒的时候就差不多会背诵了。如果在读咒的时候，念头多，心念不能专一，注意力就会分散，咒语就记不住了，读多久都很难背诵下来。为了不掺杂杂念，可选择快速朗读或读诵，一气呵成。但是这有个弊病，就是容易伤气，短时间可以不受影响，出世间就会有影响。如果真能专注读诵，短时间内是可以背诵下来的。为了集中注意力，可以选择敲木鱼作为辅助方法，没有木鱼的可以用手敲桌子，鼓点要匀，要有韵律，把兴趣引发出来了，注意力就会集中，喜欢读诵，就会很快达到背诵的程度。</p><p>二十二、学佛之人如何回向</p><p>如果是每天都能坚持回向，那就这样回向：以我今天修学佛法所得的善根福德，全部回向给我生生世世的父母师长，历劫以来被我故杀、误杀、错杀、伤害、吃掉和结怨的所有众生，回向给父（姓）氏门中的历代宗亲眷属，回向给母（姓）氏门中的历代宗亲眷属，希望他们能够消除宿世的业障，善根福德智慧都得增长，早具佛缘，早遇佛法，在诸佛菩萨的加持下，早日脱离恶道，往生善道，或者回到人间，跟我一起修学大乘佛法。希望他们早日进入佛门修行，早证菩提，离苦得乐，得大解脱。</p><p>如果不能坚持每天回向的话，最起码要一个星期回向一次，一个月回向一次的话时间有点长，那就要把一个月中所有修行的功德都回过去。如果是总回向，就把今生今世学佛所修行的或所做的功德福德全部都回过去，还有前世修学佛法所积累的福德也都作以回向。如果是给特定的人回向，就要加上这个人的名字，回向给这个人，已经过世的人要回向他早日脱离三恶道，生到善道中，并且有缘遇到佛法，精进学佛修行，给还在世的人回向，希望他善根福德智慧增长，要根据对方正当无害的需求而回向。</p><p>二十三、如何给众生施食</p><p>过年过节的时候可以给自己过世的怨亲债主和家亲眷属施食，也让他们过个欢喜年，也免得他们眼红害你生病，在平时的时候也可以定期施食。吃完饭后，碗底剩的饭粒有七粒米就够了，再加点儿菜汤菜叶就可以施食，施食念诵的咒语，早晚课本上都有。</p><p>施食时，用米饭和馒头碎渣都行，有一小捏儿就够，然后全靠观想力，观想得好，咒语的加持力强，饮食变得就非常多，越多受益的众生越多，结的善缘越大，以后的福德就越大。小手指头大小的米饭加点菜汤也行，或七粒米也够，就这么多东西，剩下都靠观想。</p><p>捏好的饭渣儿放在屋外的平台上，在阳台上也可以，然后口念咒，鬼神们就会来受食了，咒语如下：汝等鬼神众，我今施汝供，此食遍十方，一切鬼神共（一遍），唵，穆力陵，娑诃（七遍）。边念边观想，观想所施的饮食具足色香味，遍娑婆世界、遍所有的大山、遍山脚下、遍河边、遍四大海边，以及须弥山下所有的地方，能观想到的地方越大越好，饮食能变得越多越好，这样救助的众生就越多。念完七遍咒以后三弹指，施食完毕。</p><p>还可以给众生施饭水，饭后刷碗的第一遍水，饭水菜水混合，也可以施给鬼神，念咒七遍，加观想，所有鬼神就能吃饱喝饱了。把洗碗水泼洒在一个平台上，只要不是桃树和石榴树周围就行，咒语如下：以此洗碗水，如天甘露味，施与诸鬼神，悉皆获饱满。然后观想洗碗水像天上的甘露水一样遍满娑婆世界高山大海边，所有的空地上，一边念七遍咒：唵，摩休拉悉娑诃，再一边泼洗碗水，分七遍泼出去。</p><p>身体太弱的人，容易遭鬼欺负，如果观想不好的话，鬼神吃不到会起嗔恨心报复，让你身体难受两天，如果害怕就不要施食，练习一段时间，观想力强了，再施食也可以。</p><p>我们无始劫又无始劫来的父母、家亲眷属不可以数量计的多，他们绝大多数都在三恶道里，主要是在鬼道里，都在受苦，没有饮食没有衣用，我们每天吃的这么好却还浪费，节省下来手指头那么点的饮食就够他们饱腹了。为了那些受苦的广大众生，把每天浪费的饮食布施出去，既利己也利众生，也是对过去世父母师长的孝敬和回报。</p><p>我们自己学佛解脱有了希望，可还有那么多受苦受难的众生，尤其和自己有缘的那些众生，无始劫以来的父母，还有被自己所伤害的那些众生太苦了，我们应该经常给他们回向，尽量多念点经咒多修善回向他们，自己所做的每一点善事都要想着回向他们，等他们福德增加到一定程度，就有机缘脱离三恶道苦海，得个人身就有机缘遇到佛法，修学方法，逐渐走出轮回，这样也等于救度了众生。</p></div>"
},{
    "title": "第十一章 修为篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  修为篇</strong></p><p>一、人至无求品自高是什么思想境界</p><p>一个人无求了，就是对什么法都不刻意去追求，不会想办法去求取，对什么都不用心思，这就是无为。一个内心无为的人，不会采取什么手段去营谋任何事，即使是正当的也不刻意用心去得去争，更不要说不正当的事，用不正当的手段，这是不可能去做的。这样的话，一个人事事不与人争，与世无争，也不与事争，没有争的心，那就更没有抢的心和骗的心以及盗的心，事事无求，随缘度日，那这个人的品德品格是极其高尚的，思想境界也是浑然忘我的。</p><p>一个普通人只能偶尔时候做到这样，只能是在某个事情上这样做，如果这个人能经常这样做，心行总是如此清净淡薄，无欲无求，那么这个人就不是一个普通人了。那是什么人呢？一定是断了我见的人，心中无我，而且还不是一般断我见的初果二果人，一定是断除了烦恼的三四果人。当然阿罗汉们的品格都是高尚的，其德行修养都是人中第一，甚至超过于天人，是人天大众之师，人天应供。</p><p>如果这样的阿罗汉再能够多做利益众生之事，内心时刻怀揣度生之志愿，时刻想着众生苦，时刻想帮助众生超脱于苦难，那么这个阿罗汉就是菩萨摩诃萨，初地至八地。当然八地之前的菩萨心还不能做到任何时刻都是无为的，都是自然而为，都是顺应因缘的，也不能做到任何时候都无欲无求，还有烦恼习气的影响。只有八地以上菩萨的心才是时时刻刻都无为，任运自然，不用刻意造作，心空法空，禅定极深，智慧也极深，能够永远随顺因缘，顺其自然的成就度众生事业，既不执我，也不执法。</p><p>任何一个人的品格品德都与其修证有关系，修证越高的人，心越空，心越空心量越大，越无为，品德越高。修证的结果都体现在世俗法里，其无为的心行也是在世俗法里表现出来，在度众生的过程当中表现出来，在做一切事业当中表现出来。所以一个人有没有修证，有没有道，有智慧的人观其身口意行就可以观察和检验得出来。</p><p>二、受辱不惊才是道器堪受师法</p><p>古语云：凡验人，以辱之骂之而能受者可矣，以抑之挫之求而不予亦能顺受者可矣。先能承其重，则后能享其荣。在佛法的修证上，凡是道器者必能承一切重，受一切辱，因为心空无我，与道相应；总是想顺己意者，非器也，不能用，因为有我心不空，不与道相应。凡事都以己为先为主，他人为后者，都是我重，非道器。大器者，必大量，心量大才能承载一切，宰相肚里能撑船，心胸狭窄者只能装粪秽。对于那些有志愿有担当的大心大量者，有机会就给与磨难，磨练其心性，百炼才能成钢，种种逆境的锻炼和考验都经受住了，器也就炼就出来了，以后一切苦乐境界都奈何不了，心如顽石，将来初禅到来时，魔王来扰乱时心不为动，则初禅关过，证果后必断烦恼。</p><p>有禅定功夫的人定力强，往往心性柔软一些，不计较加之于己的任何屈辱，不叫屈不喊冤，心与空相应。过去修道的人，修到一定程度，师父就会考验他，提升他的耐受力，辱骂屈打，无端的加之罪名，弟子都不会觉得委屈，也不申辩，更不会气跑了。那些打不走，骂不跑的人，才是真正的弟子，才是可度的道器。心空的人不在意任何欺辱，只要有法可学，有道可修，心就得到寄托了，此后不久就会证道，可见道是长眼睛的。</p><p>赵州和尚说，上等人禅床上接，中等人门口接，下等人山门外接。越下等人，心量越小，眼光越窄，我越重，越需要柔软语和爱语，即使错了也不能直接指出，更不能呵责，如果稍微呵责就会跑路甩手不干了，甚至会反观力辱骂和诽谤其师。上等人心量大，我的观念轻微，情少执念少，心在道中，无视道之外的人事物理。所以自尊心越重的人，越需要尊重和包容，语气婉转客气，而内心强大的人，只需要直来直去，劈头盖脸，不必客气，因为器量大。有道无道，有修无修，一目了然。</p><p>三、什么是大乘人应该具有的修为？</p><p>现在很多人都说自己是实修，究竟怎样才算实修？有人说修行戒定慧属于小乘修行，大乘修行则不用拘泥于戒律和禅定，只要有正知正见，就能见道，所谓只重子眼正不重汝行履。这就涉及到了大乘实修的问题，实际就是佛法的实修问题，因为修行佛法，不分大乘和小乘，凡有无明，都必须了断，有一无明，就不能成佛，最初的无明不断，岂能断后续的无明？前无明断，遮障就断，后一无明才能了断，粗浅的无明不断，岂能断深细的无明？</p><p>大乘该如何实修？什么是实？什么是修？大乘是脱离小乘而有的大乘，背离小乘而有的大乘，还是包括小乘才能有大乘，高于小乘才能有大乘？小乘而有的一切修为大乘菩萨都不必有吗？小乘的戒定慧，大乘菩萨都不用修能是菩萨吗？小乘要断烦恼，大乘菩萨不需要断烦恼，带着烦恼能深入修下去，能成佛吗？小乘有定，大乘菩萨都不需要有定吗？小乘人要断恶修善，大乘菩萨不用吗？小乘的人品修为，大乘菩萨都不需要有吗？大乘菩萨比小乘人品修为更差才对吗？</p><p>小乘人具备的品质大乘菩萨应当都具备了，所有的大乘菩萨都是从一步步从小乘修学中走过来的，大乘的实义菩萨因为证得了如来藏，现前观察到了如来藏的体性和运作，所以心行上更加的清净无为，这一点小乘没有证悟的人是无法想象和理解的。学人如果以大乘菩萨自居，那么就应当具备小乘修为，具足戒定慧，降伏和断除了粗重烦恼，一定是具足定慧的，心地是善的，品性修为要绝对高于凡夫和小乘人，否则就无法自圆其说为大乘人，反而是看不起小抓不起大的狂人和愚人。</p><p>四、修学佛法理论的目的是什么</p><p>学法的目的应该是为了解脱于五阴的束缚，解脱于种种法的束缚，是谁解脱？是六七识解脱，是前七个识解脱。因为前七识有五阴我的束缚，有我执，有法的束缚，有法执，所以学法学理论即使要让七识充分完全的认清五阴的虚幻不实，执著的生死过患，充分完全的认清法的虚幻不实和法的束缚，从而挣脱束缚，得到解脱。如果学法就是为了获得理论知识，让意识可以挂在口头上到处张扬和炫耀，以显示博学，这就错用了心思，这是另外一种执著，还是无明和束缚。</p><p>不少人学如来藏法，无论谈什么都往如来藏上套，从来不涉及七识五阴应该如何修学从而得到改变，消除无明和烦恼束缚，从来不知道对照如来藏的清净心行，然后忏悔和消除七识五阴的染污心行，把如来藏清净之理与五阴七识打作两截，如来藏理只是挂在口头上，七识的心行依然故我，热衷于追求理论，不潜心反观自心的无明和烦恼，更不思索如何治理内心的染污。那这样的学法方式就与修行无关，还会增加慢心，以自己懂得多而生慢，傲视于人，结果又增加了无明烦恼，这样做何苦来哉？</p><p>我们都应该明确的懂得，无论如来藏怎么样，都不代表七识的心行，如来藏是皇帝，你七识五阴仍然是下贱人，是布衣百姓，是穷苦人，互相不能代替。只有去学习如来藏的清净性无我性，去除染污，获得了福德和智慧，你才能一步步高升，什么时候福德智慧品行与如来藏不相上下左右了，什么时候才能与如来藏一样成为帝王，尊贵无比。凡是不观自心，不忏悔自心烦恼，不想改变自己的，身心无任何变化的，不实际下手修行戒定慧的，都不叫作修行，与修道不沾边，学的那些理论不成为自己的负担就已经很不错了。所以请不要一边一口一个如来藏，一边贪嗔痴烦恼重重而不自知。</p><p>五、战胜自己才能战胜一切</p><p>凡是有所成就的人，都是非常严格自律的人，无论是世俗间还是佛法上，自律才能成就，才能越过自己，无我的成就高于一切，能成就一切事业。反之有我之人，处处斤斤计较，心量小，容己不容人，很难成就任何事业。只要每个人无私无我的一心为佛教做事情，所获得的福德是相当大的，以此福德就会获得大智慧和解脱。</p><p>每个人同自己的私心斗争完全可以，同自己的贪心斗争完全没问题，同自己的嗔恨心斗争完全可以，同自己的嫉妒心斗争完全没问题，同自己人我是非心斗争完全可以，同自己的争权夺利心斗争完全没问题。总之，跟自己作斗争，斗自己，完全没问题。就是不要去斗别人，不要跟别人争，遇到名利之事可以躲过去，不要去伸头，不要去争抢夺盗，不要去损害他人利益。只要承担责任，不要争权利。</p><p>六、悟后的变化</p><p>禅师们说：悟后犹是旧时人，只是不是旧时行履处。意思是说悟后的人，人从外表看还是原来的那个人，可是他的心行德行等等方面已经不与原来一样了，有了变化，有了改变，当然是变得清净了、变好了，德行修养都提升了，心性变得更良善、纯真无邪了。为什么呢？他证得五蕴无我了，心地通达了，既然无我，那就去除了一部分的私心杂念道德自然高尚许多，情操修养自然提升许多，做事的出发点着眼点格局都会有变化，整个人的心行就不一样了，虽然人还是原来那个人的相貌。</p><p>七、生死轮回最吃亏</p><p>如果学佛能学到傻傻的，像傻子一样不顾及自我私人利益，就无我了，成就了。不知有我在，不知人欺我骂我辱我贬我，对别人的言辞无动于衷，不作任何计较，好像与己无关，那就会得到无我的大果了。人就怕很精明，一点也不傻，种种算计，趋利避害，自私自利，有我的人都不傻，都会算计，都不肯吃亏，结果却被因果算计了，吃了生死轮回的亏。身在六道亏得很，什么殊胜的果实也没得到，怎能不吃亏？</p><p>八、什么是磁场效应？</p><p>磁场，磁就是一种强力，吸引大众聚在一起的力量。场，是场所，道场，处所，依托处。磁场包括物质磁场和非物质磁场，物质磁场是四大种子形成的引力向心力，非物质磁场是识心心所法形成的引力、向心力和熏染力。</p><p>当然磁场也有排斥力，有负能量。负能量就是邪气，磁场效应为负，会吸走你的正能量，让你失去一些正气。远离一些负能量的人群，让自己天天乐观向上。具有负能量弱磁场的人，还是非常多的，如果都处理，也不好办。但是一个人是否是负能量和弱磁场，是相对性的，对一些人是负能量，对另外有些人却是正能量，对一些人是弱磁场，而对另外有些人却是强磁场。这也是缘不同，势不同所导致的差别现象。如果是善缘，磁场就有吸引力，如果是恶缘，磁场就有排斥力。物质磁场有引力波，非物质磁场是靠什么吸引和排斥呢？</p><p>如果有个外道在你对面听你讲法，你立刻就能感觉到强大的压力，道不同，磁场就不同，他的磁场干扰非常大，邪见越大阻碍力越大。你原来准备讲的殊胜佛法，在外道面前讲起来就会别别扭扭的不顺畅。人们之间差别太大就不能在一起，否则就会不愉快，双方都会有压力，严重的就会出现纠纷和矛盾，谁也不好过。婚姻家庭也是这样，门当户对的过得才愉快和谐。一个团体也应该是同类相聚，志同道合，层次大体一致，团体才会和谐，否则就会有纠纷和矛盾，各自都会有心里压力。层次低的人会冲击层次高的人磁场，把层次高的人水平拉低，而层次低的人也会因为攀附不了层次高的人，心中有怨气。互相不容易摆平关系，不能达到磁场平衡。</p><p>佛陀也曾经躲开所有弟子，一个人到森林里静坐，不让弟子到身边来，包括侍者阿难也不能跟在身边。佛陀长期受到比自己弱的众生磁场的冲击，心力体能是会受到影响的。佛陀永远都是被众生需求索求，总是付出，只出不进，心力该有多强大。诸佛为什么孤独？因为没有与之磁场相对应的人，佛陀总是给与施予，别人都是受施者，有差别不等同，所以孤独。菩萨到这世间也是孤独的，没有同等者，都是向外施予救度，磁场是外放不入，时间长了，自己的磁场能量就会消耗掉，能量不足，体能和心力就会弱下来。这也是替众生背业的原理。</p><p>诸佛已经圆满一切法了，大雄大力，为什么还会受众生影响呢？因为有肉体会消耗能量，就需要能量的补充，佛陀离开人群静坐就是补充能量。不是肉体，就不会受影响。佛教史上一切修道者，都是孤独的一个人修，没有陪伴者，有陪伴者就修不出来。因为找不到有相同道行者，互相陪伴，就会削弱磁场，修行不容易成就。</p><p>九、磁场和加持力的原理</p><p>问：如果一个人特别的宁静祥和，周围的人在他旁边也会很快变得安静下来，感觉很舒适。这个人好像也没有什么特别的地方，但就是有一种感染力。这个是为什么呢？</p><p>答：心识宁静德行好的人，有摄受力和加持力，磁场比较好，影响力就好。他身上会发出比较光亮和柔和的光，在身边的人虽然看不见，但能摄取这种清净祥和的光，心境也就会变得愉快舒适祥和，身体也会变得清净和健康。有眼通的鬼神能从人的色身发出的光芒，看出这个人是否有修养和修为，看出这个人的德行好坏，鬼神对于德行好的人自然是尊敬和爱戴，对于德行修养不好的人会看不起，甚至会欺负他。天人和有神通的诸大菩萨更能从人外表的光上看出这个人的修行道行如何。</p><p>有修行的人所使用的物品，有一定的加持力，也能让他人吉祥心得安稳。因为他所接触和使用的物品，有自己心力的作用，他的心就是吉祥安稳的，致使物品就有了吉祥安稳的磁场，修为越高，其磁场力就越大越好，越让人感到安详愉悦。别人与这个物品接触，就会受到吉祥安稳磁场的感染力。每个人使用的东西，都有自己的信号，有自己的信息，好像物品有记忆力一样。有些东西谁用随谁，物理性能都不一样。</p><p>十、磁场效应</p><p>近朱者赤近墨者黑。熏染在无形间，最初染于毛，再次染于皮，再次染于肉，再次染于筋，再次染于骨，最后染于髓。染到骨髓就根深蒂固，不会拔除了，赤黑都如此。所以周围磁场非常重要，与之交往的人最重要，莫要说自己抵抗力强大，就不择善友，不受熏是在八地以上，绝对不受熏在佛地。隔阴之谜的再来人，在迷之阶段仍然会受到轻微的染污，虽然意识受染，很容易就拔除了，但也有影响力。</p><p>为什么一个团体是一种风气？一个家庭是一种习气？传染而致，不知不觉，形成习惯，再不知不觉，习气进入骨髓，就会世世现行，善恶皆如此。希望我们都在好的团体中熏染，近朱而生，不要在有很强的烦恼习气的团体中受熏，离墨而活，这样福德集聚就会很快，自身的磁场改变也会很快。</p><p>十一、总闻到香味是怎么回事</p><p>有的人学佛精进，就会时不时的闻到特殊的香味。这一个是体香，因为心清净了，气脉通，体内香气出来了；再一个是外来的香气，有天人或者护法神跟在身边，是他们带来的天香。你如果能给身边的人讲一些粗浅的法，有可能天人来听，周围就会很香很香，这是天人的香味。经常念咒，会有护法神跟随护法，是他们带来的香味，也是天香。</p><p>天界的香味，在我们人间里没有，找不到。那种香味非常特别，让人心境开朗愉悦，心清净安静敞亮，能消除烦恼。善根好的人，就会有护法神随时跟着护持，进步会非常快。如果守戒严格，护法神也会对你负责任，随时管护你，让你烦恼减轻，改变习气，多造善业，不造恶业。</p><p>所以只要你能力所能及的多做一些福行和善行，最受益的还是自己，表面上看是给别人做的，别人得到好处了，实际上自己得到的好处最大最多。好多人给他修福机会，说什么也不要，好像很吃亏的样子，实际上自己不愿意修福为他人和佛教做事，很多现成的利益都得不到，岂不是自己吃亏吗？</p><p>人如果自私心理不改，只想自己的利益，多大的利益都得不到，只顾着自己不受损失，其实得不到大利益，这就是有所失了，最后自己现有的那点利益也保持不住，守不住。心量太狭窄了，道业无法增进，修行是心空无我，成天守着一个自私的我，还要修无我，有多矛盾？抱着一个我修无我，什么时候能修成无我？应该学着慢慢把自我放下，才能无我。</p><p>十二、学佛人可以玩股票吗？</p><p>八正道里有个正命和正业，正命就是要用合理的不欺人的不损害人利益的方式养活自己和家人，否则所行之道就不是正，而是邪。正业也如是，所做一切行业，都要正，不能做欺骗伤害人利益的邪的业行用邪法，损害人利益的，不是菩萨行，也不是所有修道人所应该行的，那里有因果关系，将来需要酬尝因果。菩萨应该善知因果，恪守因果律则，则无过患。菩萨的心行应该是舍己为人的，所行世俗之业，最基本的行持应该是不伤害众生利益的，最起码要达到共赢，而不是自己赢他人亏。如果不能共赢，宁可自己亏，也不要亏他人。玩股票的心理难道是宁愿自己亏他人赢吗？能达到共赢吗？</p><p>十三、众生只是假佛</p><p>善知识问傻弟子：你是佛不？弟子犹豫，善知识说：怎么还不能担当，难道你不是佛吗？弟子于是恍然大悟：我就是佛呀！怎么不是？善知识您也是佛，我也是佛，我们彼此都是佛。大家在一起互赞，你是佛，我是佛，你是神，我是神，你度众生，我度众生。各自印证了是佛以后，善知识嘱咐说：佛无修无证无得，我们以后也不用修行了，保任即可。于是傻佛们每天高高立于云端，乐呵呵的当假佛，什么也不学不修了，叫作保任。</p><p>有多少人虚荣心炽盛，喜欢被骗，喜欢虚名，只要自己感觉与众不同怎么都行，被骗也值得，他们活的就是那种感觉。慢慢的牛鬼蛇神都出来当善知识度众生，把众生都度到牛鬼蛇神队伍中，这些人偏偏就喜欢牛鬼蛇神之类的，谁有什么办法？三千大千世界如一器中，储百蚊蚋，啾啾乱鸣，鼓发狂闹。</p><p>十四、众生无明病的表现</p><p>众生的无明就是最根本的精神疾病，是六七识的颠倒知见和错乱思想。社会大众的精神疾病我们就不说了，只说学佛人的精神疾病。学佛人的精神疾病都有哪些表现呢？根本由什么而来？精神病分为集体精神病和个人精神病，个人精神病都已经很难对付了，集体精神病发作起来，就连佛也一时半会对治不了。众生在大染缸里痛痛快快的熏染着，不知不觉，就像喝了几坛子老酒似的，没办法叫醒。</p><p>学佛人的精神病表现在对于自我的凸显，根本来源于根深蒂固的我，那个强烈的自我。众生的那个我有多严重举例来说，当年刚流行下海经商创业的时候，社会忽然冒出无数总经理还有董事长，数不清，搞得工商局办理执照的人说：你这个公司也就两三个人，职位写经理就行了，够不上总经理董事长的。可还是满大街都是总经理，天上如果掉块石头，一下子就能砸死二三十个总经理好几个董事长。</p><p>现在学佛队伍里，众生我的表现也是一样，怎么能凸显自己与众不同就怎么搞，善知识、开悟的菩萨、再来菩萨、等妙觉菩萨无数，导师一大堆，满天下都是大圣人。如果天上掉下来一大块石头，就会一下子砸死二十个左右开悟的菩萨，十个左右善知识，五个左右等妙觉菩萨以及三个以上导师。都砸死也好，娑婆世界圣人早已人满为患，让这些圣人赶快到其他佛国土去度众生去吧，娑婆世界用不着这么多人，在一起还打架，不走就强迫离开。</p><p>如果有幸能遇到精神病类的善知识，差不多几天就能被引导开悟，最多不超过一个月。开悟那么个三五天，或者是几个月，就会张罗组织团体说法度众生去了。圣人繁殖得太快，娑婆世界马上就没有众生可度，释迦佛完全可以歇一歇，省省心了。然后再让这些大圣人扩散到他方世界，帮助其他诸佛度众生，也让十方诸佛都歇一歇，省省心。</p><p>以后你们再遇见什么善知识，什么等妙觉菩萨，什么再来人，什么阿罗汉，什么导师之类的，就劝导他们尽量都分散开，到其他没有善知识没有圣人之处去度众生，不要都挤在小小的娑婆世界里乱哄哄的闹人。娑婆世界已经差不多都是圣人了，没有多少众生可度的，不要浪费圣人之才德。以后再遇到哪位跟你们说自己开悟证果之类的，你们就说这已经不是什么稀奇事了，到处都是证果开悟的，有什么可奇怪和炫耀的？到处都是说法度众生的善知识，也根本不是什么稀奇古怪值得炫耀的事了。</p><p>可是却有一件怪事想不明白，随着娑婆世界生产的圣人越来越多，为什么天灾人祸也随着越来越多呢？莫非是这些圣人带来的天灾人祸不成？真想不通！为什么圣人繁殖速度如此之快，像蟑螂繁殖似的？因为众生简直是太愚痴愚蠢了，过于愚痴过于愚蠢了，过于自我主义了，太有所求了。佛经不学，指路明灯不要，情愿当瞎眼猫。眼睛蒙上五块黑布，撞上一个人就认善知识被带走，说什么是什么，就像被深度催眠了一样，动不了脑子，被人灌输什么就是什么，全盘接受。</p><p>这些所谓的善知识比佛陀本人都厉害，把众生摆弄得五体投地，所以开悟是极其快速的，远远超过佛陀的指导水平。佛陀如果到这个世间来，也度不了几个人开悟，这些善知识就能变难为易，奇怪不？为什么那些精神病众生开悟以后丝毫不怀疑自己被骗？愚痴是一方面，最大的一面是我性太强，只要有个开悟的虚名，立刻就觉得自己高大威武起来，超于众人，心里满足感爆棚。而这一切感觉，都是非常严重的我性泛滥，自己丝毫不觉知。</p><p>十五、未证得初果的人能为别人介绍和讲解佛法吗？</p><p>只要自己了解了一些佛法，都可以如实的为人介绍和讲解，但是应该是知道多少讲多少，不能太过格，没有把握的事就不要说，本着知之为知之，不知为不知的原则。同时不要有意无意的让人误会自己有实证，没有证果就不要教导人家如何证果如何明心，更不要逞能强行给人印证，误人子弟。修到哪里就说哪里的话，不越界不过格，诚实的告诉他人自己的实际修行水准，超过的只作为参考，不作为指导，这样就没有过失了。</p><p>没有修行却逞能的人不在少数，这样的人喜欢自我炫耀，喜欢张扬，所以就常常说一些过格的话，都是因为严重的我执，心中的那个我简直能把自己撑爆了，我相众生相都很牢固难破，结果就造下了妄语等等恶业。实际上也并没有得到什么益处，有也不见得得到了别人的羡慕和尊敬，只不过是自我感觉良好而已。众生的烦恼结使就是这样牢牢的系缚着自心，不知解脱滋味，可怜又可悲。</p></div>"
},{
    "title": "第十二章 法义篇",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p>第十二章  法义篇  </p><p>一、弄清名相的重要性</p><p>修学第一步弄清楚名相是很重要的，如果连名相都搞不清楚，佛法的门槛就进不去。等把明相弄清楚以后，在自己心里再去除名相，得其义可以忘言。但是与人交流或者指导大众修行，不用名相还真不好办，别人就会不知道你在说什么。如果都得其义了，那么名相也就没有什么用了，简单的表达，互相都会知道说什么，也不会有什么误会。</p><p>二、唯识法里的概念解释</p><p>五法：相、名、分别、正智、如如；三自性：遍计执、依他起、圆成实；八识：眼识、耳识、鼻识、舌识、身识、意识、末那识、第八识；二无我：人无我、法无我。这些法都可以归于五法中，遍计执归于名，依他起归于相，圆成实归于如如，前七个识归于分别，第八识归于圆成实，二无我归于正智。</p><p>六个识的依他起性也是名，七个识都是名，都有分别性。五阴是名，一切法除第八识都是名，五根六尘是相。七个识是分别，证得佛法以后有正智，第八识属于如如。</p><p>正智也是妄心七识具有的，见道就有正智，只是在于什么程度的正。不颠倒了，就是正。不颠倒的程度不同，就有不同程度的正。</p><p>三、无生忍和无生法忍的区别</p><p>无生忍，忍于五阴身为如来藏所生所执持，忍于五阴身空幻无我，忍于如来藏不生不灭，能生万法，住于五阴身中，生生世世变生自己五阴。按照其证量程度，仅限于三贤位中，未入圣位。</p><p>无生法忍是在无生忍基础上，证入诸法也都无生，证诸法唯识性，降伏我执（未断），始入圣位安住不退。</p><p>四、一念无明和无始无明是什么意思</p><p>一念无明顾名思义，就是其思想观念是无明的染污的，为什么是无明和染污的？因为心中有我，以五蕴十八界为我和我所，不知这个所谓的我是苦空无常无我的，其思想观念全部围绕着我和我所而展开，坚固的执著这个所谓的我，生死也就是坚固的。以有我的思想观念去指导身口意行，当然身口意都是染污业，由此染污业，必然生死轮转不休。所以一念无明能绪诸生死，无法得解脱。</p><p>但是一念无明也是无始无明之一种，无始劫以来一直都存在着的，没有一个开始的时间。如果有开始时间，那么在这个时间之前，就没有一念无明，众生就是阿罗汉，处于无余涅槃中，在涅槃中没有众生，也没有阿罗汉。所有无明都是无始劫以前先天就存在着的，都是无始无明，由于后天环境的熏染，才使得无始无明增加或者减少。</p><p>一念无明断尽以后，还有无始无明需要断尽，才能成佛。无始无明是众生无始劫以来一直以为五蕴世间是真实的，不知道是如来藏幻化出来的假相，不知道是空的，由此才有我执和法执，才有分段生死和变易生死，不能解脱。断除无始无明需要参禅，实证如来藏，实证一切法的真如性，一步步证得一真法界性，所有的一切法都证得了真如法性，就会完全转识成智，成就佛道。</p><p>五、什么是分段生死</p><p>分段生死，是生命分成一段一段的，这一段时间有多长是不一定的，八地菩萨以前都是这样。可以观察畜生们的生命期限，从人间的几个小时几分钟到几千年几万年，鬼道众生的生命期限，地狱众生的生命期限，人的生命期限，各层天的天人生命期限，阿修罗的生命期限，以及各层次菩萨的生命期限，不管能活多长时间，最终却都是要死亡的，不是永远不死的。生命既然是有期限的，就是有段落的，就叫作分段生死。</p><p>分段生死之后是变易生死，八地菩萨至等觉菩萨妙觉菩萨都有变易生死，其生命虽然可以无限期的长，但终有一死，因为还有极其微细的无明没有断尽。无明能感召生灭变易，致使生命不牢固，分段生死中的众生无明最重，生死和苦难也就最重。就像人有念头就会有喘息，就会有息脉，就会有风动，就会感召到风灾，无念头就无风动、喘息、心脏脉搏的跳动，就会远离一切灾难。无明灭尽就不会有任何一种生死，这时就成佛。</p><p>六、什么是证量？</p><p>所谓的证量，通常来说，就是证得大小乘法的程度，实证到或者是观行到大小乘法的程度。证是证得，量是度量和程度、水准的意思。</p><p>修行禅定，也涉及到证量，叫作禅定的证量。学习任何法都有证量之说。没有证得什么，当然就没有证量了。</p><p>七、万法唯识</p><p>世界上任何一个科目，都是唯识科，都是佛科心科；任何一个法门，都是唯识法门，都是佛法心法；任何一个教，都是唯识教，都是佛教心教；任何一个宗，都是唯识宗，都是佛宗心宗；任何一个派别，都是唯识派，都是佛派心派，世出世间一切法都是唯识，都是佛法。</p><p>八、杂思</p><p>一外道与佛辩论，立一论题：我不受一切受。佛说：你不受一切受的受，你还受吗？外道无语。回去路上思量：我无论怎么说都败了，佛是胜者，我应皈依。于是回去找佛剃度出家，随佛学法。</p><p> 有人说：我不取相分别。请问：你这句话是取相分别否？我不取相分别这句话，你还分别否？对方顾左右而言他。败是无疑问的，但却不能勇敢的承认，不如外道诚实。有人说：我本来就是佛。请问：你什么时候坐在供桌上受过世人礼拜供养？你什么时候从供桌上爬下来，何因缘爬下供桌，以至于如今这般落魄？</p><p>从今生追溯无始劫以前，你从来都没有做过佛，一天一刻都没有。无始劫又无始劫以前，你的无明一点都没有破除过，从来都是生死业障凡夫，从来都在六道里生死轮回，没有断绝过，从来都是与纯大苦聚集在一起。所以结论就是：你本来不是佛。圆觉经曰，黄金从金矿中提炼出来以后，不会再融合杂质，变回金矿，黄金永远是黄金。成佛以后，无明灭尽，不会再有无明，而变回众生。成佛永远作佛，不作众生。成佛所依靠的本心，可以说本来是佛，可是你五阴七识却是众生，不是佛，靠着佛当生死业障众生，就如坐在河边却忍受强烈的口渴，不得水喝，怪谁？</p><p>九、为什么会感觉时间有快慢的区别</p><p>专注一件事，旁无他顾的时候，就会觉得时间过得快，如果心散乱，有所顾虑和期盼，就会觉得时间过得慢。觉受依心境而变换，就是不真实的，不可靠的法。痛苦的时候，也觉得时间过得慢，因为希望痛苦快点结束，有所期盼，与时间有关，就感觉时间过得慢。快乐的时候觉得时间过得快，因为心关注在快乐的事情上，专注也是心在所对的事情上，时间就不知不觉的过去了。</p><p>痛苦的时候希望时间快点过去，这是希望停止痛苦，快乐的时候希望时间不要过去，这是希望多享受快乐的觉受。修行的人就希望时间过得慢一些，好多做一些有意义的事情，比如修炼自己，提升自己道业。在定中，时间能停滞下来，没有了时间，真舒服，可是定外的人事还需要照顾，只能出定。要想减少痛苦的觉受，就多 念佛念咒念经，时间就过得快了，多考虑众生苦，自身的苦就会被忽视，时间过得就快了。</p><p>十、什么是气</p><p>气包括心气和物质四大的身气。心气体现的是意根的气息，是意根的心所法，比如心高气傲、心气满满、气宇轩昂、意气风发、骨气、志气、傲气等等。身气包括肾气、肺气、胃气、脾气、肝气、心气，五脏六腑都有气，乃至于全身上下经络里都有气。气能带血运行，叫作血气，身体就靠血气滋养运营，一旦血气供养不上了，六识就无力运行下去，五阴活动就减弱，或者是血气运行乱了，六识就乱，甚至会疯狂。</p><p>心气能带动和影响身气，身气能提升和影响心气，二者互相影响，对禅定的影响也很大，心气不平和，禅定不起，身气不调和，禅定不出现，所以要调理心气和身气。调理心气一靠理，讲道理，让心气平和安稳，二要身体素质好，气血畅通，禅定才能出现。调理身气一是靠供给充足必要的四大养分，二是通过调整呼吸和运动，三是靠心气意念的调理，心气平和，身气慢慢也会平和，这叫心平气和。如果身气乱和不足，心气也会乱和不足，二者相辅相成。</p><p>除了心气和身气之外，还有一个业障气。所谓的业障气其实就是一种过去世业行势力，或者叫业的惯性和力量，这个是最难调理和克服的，多数时候只有被动承受的份儿。如果一个人觉悟性比较强，发现自己的业障所在，发现自己的不良习性，就要想办法扭转和克服，一是通过忏悔的方式，忏除业障，二是通过发愿的方式压过业障，三是要培养新的好习惯。</p><p>十一、离开分别心是否等于是死人</p><p>首先说离开分别心，并不等于死人，因为这个分别心是指意识心，离开意识心的时候，有好多种情况，最平常最普遍的情况就是睡觉的时候没有了分别心，可是人却不死。虽然离开意识分别心不会死亡，很多事情却做不了了，就不会有日常生活，那就耽误事儿了，这种情况比死人也强不了多少，遮障严重。</p><p>很多事情经常做，做得非常熟悉了，可以不用意识心去分析思考，就能快速直接的完成，比如抬腿走路，不用思考先迈哪只脚，吃饭时饭到嘴边就会张嘴吃等等，但没有意识这些事极其熟悉的事都做不了，所以说意识的功能作用对于没有神通的人来说是极其重要的，很多时候意识看似不分别，但了别性却是一直在起用，众生才能有种种的身口意行，才能生存。</p><p>十二、皈依三宝的究竟意义是什么？</p><p>在释迦佛的本生故事经里，有好几个经都记载释迦佛生生世世修行的足迹和轨迹，介绍了释迦佛生生世世的出身、家族情况，以及修行路上的同修道友和众弟子们。其中给我印象最深刻的是，好几部经里都介绍释迦佛与阿弥陀佛等等很多位佛多生多世都是亲眷亲兄弟的关系，或者是同在一个佛国土修道，互相帮助辅佐护佑。还有介绍释迦佛很多世都与今世的十大弟子在一起，是师徒关系，名字相近相似或相同。也介绍了释迦佛今世的妻子与释迦佛前世的因缘，释迦佛的母亲与释迦佛前世后世的因缘。</p><p>这些故事情节说明了什么呢？说明了诸佛之间的缘，佛与弟子之间的缘，佛与家亲眷属之间的缘。人们之间结了善缘，就有了凝聚力，会把这些人凝聚到一起。而有一个非常强大的缘一个极其强大的团体可以依靠，生生世世与这个强大的团体在一起，生死就有了依靠，心中就有了主宰。</p><p>三宝就是救命的稻草，众生只有紧紧抓住这个救命稻草，才能救得了自己的命。除了三宝，众生没有可依的，什么也靠不住，在生死的路上，叫天天不应叫地地不灵，孤单的承受自己的业力。跟诸佛菩萨结缘，生生世世与诸聚佛不离佛。</p><p>法华经上佛给弟子们授记成佛，这些弟子在一起共修结缘，所走的道路大致相同，修行层次也大略相同，成佛时就是前后次第成佛。缘就是这样的重要，有智者一定要抓住三宝的缘，抓住优胜团体的缘，以此缘促成自己生生世世的所依，托着自己步步高升。</p><p>一个好的团队非常重要，团队就是缘，无缘就不要谈什么了，不相关有什么好谈的呢？就像现在的肺病灾疫所死去的近二十万人，他们没有三宝的缘，孤独的死去，再孤单的投生，没有所依，没有所靠，漫无目的，凄凄惨惨，孤孤单单，六道里漂泊，没有出期。是不是很惨烈？所以皈依三宝是非常重要的，三宝不仅是众生生命的依止，也是众生解脱的舟载，在三宝这棵大树才好乘凉，心得寂静涅槃。</p><p>十三、什么时候才能做得到不取相分别</p><p>初果断我见以后才能破除我相、人相、众生相、寿者相，但仍然离不开对众生五阴相的取着和分别，开悟以后不取相也非常难，尤其是禅定退失以后，极大多数时候仍然要取相分别，八地以前的菩萨根本不能做到完全不取相分别。凡夫一个小小的考验都承受不住，无论怎样训练自己不着相不取相，凡夫就是要在相上转。凡夫尽管口中经常说自己要不取相分别，可是每一分钟都在取相分别，根本做不到不取相不分别。</p><p>因为禅定和智慧证量严重不足，想要不取相分别，根本不可能，意识强行压制一分钟也许能行，两分钟就坚持不住了，不取想分别很难很难做得到，想一想是很容易，说一说也容易，可是要做到就一定要证得到所有相都是不实的才行。证得多少才能做到多少，想是没用的，口说更没用，凡夫即使再修一个无量劫，能做到多少程度的不取相分别都不好说。阿罗汉同样也做不到完全不取相分别，因为阿罗汉大乘法都没有证得，因此就不得不取相分别。如果阿罗汉能做到不取相分别，就不会取着娑婆世界的苦，而一心要躲开娑婆世界的境界去取无余涅槃了。</p><p>十四、一切法都有相</p><p>法有色法和心法，有真法和妄法。色法有色法的自相和共相，心法有心法的自相和共相，妄法有妄法的自相和共相。真法有自己本体之相，没有共相。</p><p>色法的共相是四大组成的物质，有质碍性，不空，可传播，可扩散，有磁场效应，可触可见，生灭变异。色法的自相是，色声香味触，各有各的相貌和特征，不能混淆，因此所触所见的根识不同；即使都是同一种类的色法，有各有其相貌特征，各有不同的用，如花草树山，桌椅板凳。</p><p>心法的共相是，都有识别性了别性，都有心所法，都是无形无相的，都是识种子形成的，除了第八识，都是生灭变异的。各个心识各有自己独特的识别对象，各有其对应的法可见。第八识没有共相，才是独一无二的法，才是脱离世俗的，才是不生灭不变异的，不增不减的，才是众生所依止之处。</p><p>十五、七地满心的时候，修一个更殊胜的三昧，有三昧乐，就不会离开三界入无余涅槃了。初地到七地菩萨之间，由于断除了对五蕴世间的贪爱，不喜乐于五蕴世间法，一旦断尽执著，三界世间就没有可系缚意根的法了，于是菩萨就会无余涅槃。所以这个期间，要留一点烦恼惑业，对某些轻微的法保留一丝贪，以此来系缚意根不出三界。</p><p>对佛道锲而不舍，对度众生锲而不舍，就不会入无余涅槃。这也是轻微的执，但暂时必须保留。华严经中有菩萨的十无尽愿，菩萨入初地之前，必须要发这个愿，才能保证永远修学佛道，不弃舍众生，才能不入涅槃，最终成就佛道。</p><p>心离我执和法执，才是自在解脱的，越执心量越小。八地菩萨心无执，无为自在，随愿任运自然，心广大无碍，神通道力也最大，能以菩萨身而现佛身，现佛国土，广度无量众生。</p><p>三果以前，不用发这个愿，也不能入无余涅槃。因为都有贪嗔痴烦恼系缚自己在三界中，对五蕴世间有贪爱，不会离开三界生死系缚，还要受业报的苦恼。贪爱越重，嗔恚越重，愚痴越重，苦恼就越多，生死系缚的越严重。每个人执著自己，贪爱自己，是害自己的罪魁祸首，却不自知，还在不断我我我，实在是可怜可悯。</p><p>十六、讲法不着边际的是什么人</p><p>如梦观观成就以后，直接证得十回向菩萨果位，快入地了，娑婆世界几乎没有这样的人，包括古时候。如幻观修成就，直接就是十住位的菩萨，没有明心能否成为这样的菩萨？耳根圆通法门修成就了，直接证得等觉菩萨位，我这辈子都修不了，好多年别人让我讲，我猜想了一下，讲到一少半，说什么也讲不下去了，总不能胡编乱造吧？其他人要想修这个，那就过一个无量劫再说吧。再说圆觉经的修行方法，没有初地菩萨的证量，根本想都不要想，我都不一定能修出来。</p><p>没有实证过的人，讲法都是跳跃式的，修行也是不着边际的，为什么？没有经验，凭借自己的想象和猜测，凭感觉。修一辈子都摸不着门路，走过的路，才知道具体路线，才有次第。</p><p>十七、汝意不可信</p><p>培根：“只有亲眼见过，才能做判断。”笛卡尔：“只有理性分析过，才能做判断。”休谟：“亲眼见过和理性分析，都不能做判断。”康德：“把亲眼见过和理性分析结合起来，就可以做判断。”</p><p>佛陀：“知道了亲眼见过是错觉，知道了理性分析是戏论，才有可能做出有意义的‘判断’。”众生无始劫以来，亲眼见过数不清的人事物理，哪一样认知对了？如果认知对了，不会再有贪嗔痴烦恼，不会再有生死轮回苦。有多少人具有理性分析的能力？如果理性分析正确无误，怎么可能还有贪嗔痴烦恼和生死轮回苦？佛说：汝意不可信，证阿罗汉果才可信汝意。而即使证得了阿罗汉果，还有那么多的无明，仍然不能完全信汝意。</p><p>无数人都是相信自己意，可是自己那个意，今天是如此，明天是如彼，经常更换自己的意，直到临终时也没有做对过几件事，那他的意可靠吗？相当不可靠，可是自己就是自信，直到死亡为止。多数人学佛，今天看这个好，学几天否定掉，过一阵又看那个好，再学几天，然后否定掉，直到七老八十也没有找到自己满意的法门，却仍然很自信。如果真自信，认可一个就不要再否定，不要再更改，五六十岁还确定不了一种修行法门和路线，这辈子还有什么希望吗？</p><p>十八、我之咒愿</p><p>我已经给大家搭建好了登上佛法高峰的天梯，这个天梯是获得一切大智慧的最直接最秘密的通道，临近日月最近最近，几乎伸手可得。大家在体力心力允许的情况下，自己登上去，居高临下观察佛法的运作情况，就能获得大智慧。在世俗法上我提供了这个秘密通道，我该收取多少专利费和使用费才公平合理呢？其实我无论收取多少费用都嫌少，世界上所有珠宝都给我，我也不够本。既然现在收取多少费用都不合适，况且我也不太会花钱，也用不着那么多钱，那我就要放长线钓大鱼，收取最大最大的利益。</p><p>我现在发个咒愿：凡沾我一滴法恩者，未来三大无量劫步我之履，效我之道，行我之行，不记任何个人利益，行菩萨万行，度脱一切可度之众。三大阿僧祇劫之后，也要不辞辛苦，不记代价，度脱一切可度之众，不得有半点不愿和违逆。</p><p>咒愿已发下，谁也跑不出去，想跑已经晚了，即使是从前跑走的，也逃不脱我这咒愿的威力。一切人等，不管愿不愿，一律在我咒力之中，自觉不自觉的去履行咒愿，不管有多久远劫，都不得逃脱。你可以懈怠一天一年一生一世，但是你不可能在我咒力之下永远懈怠下去，咒力不允许，直至成佛，直至度尽苦众生。</p><p>文殊菩萨不成佛，以菩萨身教导出七尊佛世尊，甚至会再以菩萨身教导出无数佛世尊。但是一旦文殊菩萨成佛之时，祂所在佛国土，覆盖一切诸佛国土，一切诸佛国土都在文殊菩萨佛国土之中。而我现在不想收割，不想得到星点的回报，我要未来最大最大的回报。受我之恩者，必无量劫又无量劫的效我之行，报我之恩，一如我无条件的效佛之行，报佛之恩一样，没有怨言。即使有怨言，抱怨之后，仍然要不记代价，永远辛苦下去，不管成佛之前，还是成佛之后。</p><p>我之咒力，大于魔之咒力百倍千倍万倍，受我之咒，脱魔之咒，永不受魔扰。我之咒力摄伏魔之咒，魔力变佛力，一同加持行人上路，勇敢精进不退转！</p><p>十九、教师节说教育</p><p>无明渗透在世间每个角落，渗透在世俗界的方方面面，渗透在世俗一切法当中。当然也渗透在教育行业里了，没有无明的教育是佛陀的教育，无明非常少的教育是菩萨的教育，再其次是辟支佛和阿罗汉的教育。凡夫的教育当然充满了无明，只是为成就世间法而教育，不知道世间法都是幻化和虚妄的，都是空的，所以世间教育都在指向世间有法，不可能涉及到一点空。</p><p>教育使得无数人不断地适应社会生活，但是越适应越不容易心空，越不容易得解脱，因为世俗教育都是引导众生不断地贪爱，不断地执取。解脱的那些人就不再贪爱和执取世俗法了，内心里与社会格格不入，虽然表面上不得不敷衍。历史上所有的祖师大德，几乎没有人花费很多年的时间去学习世间文化，大多数都是早早的出家修道了，即使不能马上出家的，也是身在家，心在道，机缘成熟还是出家修道了。</p><p>佛教起源于印度，这是为什么？因为那时候的印度人人都想解脱，出家修道的外道非常多，由于不得法，暂时都不能解脱。佛陀看到众生解脱的因缘成熟，才八相成道，来到西印度，把佛种留下。而这个时代，学佛之人那么多，佛法普及面广，信佛学佛蔚然成风，学富五车之人渐渐增多，可是佛陀为什么不来度化？因为现在根本没有多少人真想解脱，真想心空的，都是着于世俗有的人，看着根器不错，实质上并不是。</p><p>佛法越泛滥，邪法越会趁机而入，众生分不清正邪，以邪为正的人可不在少数。佛法繁荣的背后是凋零，越繁荣根基越浅，营养都跑到表面上来了，根就会越来越枯萎。细水流长，才会源源不断。佛教也是，只有慢慢的稳稳的发展，才会久远，众生才会真受益，流入到佛教里的才是真人才，才是缘分深厚者，才是善根成熟者，才是佛教栋梁。鱼龙混珠，极大多数都是那个鱼，却沾沾自喜的以为自己是龙，错会太大。明明应该鲤鱼跳龙门，结果却是游过去的，还是鱼的身子骨，没有一点龙的影子。</p><p>二十、堕落的天使</p><p>最初地球空旷无人               </p><p>天使降落谗食了地肥</p><p>身重不能起飞羽翼被折</p><p>地球上遂有人类成为鼻祖</p><p>所以我的祖先是堕落的天使</p><p>而我并非天使</p><p>我是纯种的人类</p><p>是堕落天使的后代</p><p>经过了世世生生的轮回</p><p>早已经没有了天使的名号</p><p>更没有天使的尊容和神通力</p><p>因此我也是堕落的</p><p>为何天使们会堕落</p><p>只因贪吃地球上的地味</p><p>从此就在地球上生息繁衍</p><p>初时身轻如云心离欲念清净</p><p>后时贪欲渐染变化出男女二性</p><p>因此遂有后代繁衍</p><p>代代繁衍部落族群家国</p><p>遂有族长和王侯治理族国</p><p>人类的习俗渐渐形成固有化</p><p>耕田织布婚姻嫁娶财色名食睡</p><p>欲染炽盛贪求不过人中的物事尔</p><p>身陷囹圄何时再当天使</p></div>"
},{
    "title": "第十三章 关于南传佛教对大乘法的诽谤",
    "author": "生如法师",
    "date": "2021年12月27日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章  关于南传佛教对大乘法的诽谤</strong></p><p>一、佛陀最原始的佛法就是三藏十二部经</p><p>所谓的原始应该是佛陀四十九年当中发布的所有法，包括大中小三乘，小乘阿罗汉、中乘辟支佛的解脱道和大乘般若唯识法的成佛之道，当然中小乘也是成佛之道的一小部分，也是最初那部分，是大乘佛法的一部分。整个成佛之道以真如佛性如来藏贯穿始终，仅仅是阿含经只能证得小乘的阿罗汉，获得解脱三界世间的智慧，不能获得佛陀的一切种智。</p><p>阿含经以及阿罗汉果还不究竟，在此基础上继续修学般若唯识才能不断增进道业，最终成佛。所以佛陀最原始的佛法就是三藏十二部经，也没有原始和后来，佛陀在其他佛国土的原始佛法不仅仅是娑婆世界三藏十二部这么少，这三藏十二部犹如手指甲里的土，超越于这三藏十二部的佛法犹如大地上的土，所以凡是成佛之法都是佛说，没有必要把完整的成佛之法搞得支离破碎。</p><p>可是有一部分人说只有阿含经才是佛陀原始佛法，其它大乘都不是佛说，是后人编造的。可是如果一个教派收集一些东西，成为这个教派的历史，各有各的历史记载，然后传承下去。那谁证明某个教派的历史传承是正真的，而别的传承不是正真的呢？凭什么相信一个教派考证的就是真正的历史，符合当时所发生的事实呢？有神通，还是有巨大的智慧？考证的人是历代大修行者极具慧眼法眼？如果不是，凭什么相信自己的判断呢？</p><p>如果不是历代大修行者，不具慧眼法眼，凭什么判断这是南传佛教是最原始佛说的，其它的大乘经典三藏十二部不是佛说的呢？凭什么这样诽谤佛陀四十九年辛辛苦苦传导下来的最珍贵的宝藏？如果佛陀四十九年只讲了阿含经，佛陀凭什么成佛？难道只靠修习阿含经这样极其粗浅的法，就能成佛了吗？这样粗浅的法，何用佛陀反反复复讲四十九年？谁能证明佛陀四十九年只讲阿含经，大乘法都没有讲？谁开眼见证了佛陀当年教化的整个历史背景和过程？</p><p>诽谤大乘法否定大乘法的人，传播抵触大乘法的南传佛教法义者，罪过滔天，如果有人曾经传播南传佛教来抵制大乘法者，赶紧公开忏悔，否则地狱因已成不可更改，恶报必然加身，躲避不了。诽谤大乘者，是世间最大的恶人，在一切恶法中罪最重，超过杀人放火十恶不赦者。</p><p>诽谤大乘者就是蒙蔽众生眼目者，诽谤大乘者是在断众生求取解脱之路。断众生解脱路者，自己也必将生生世世堕于无间地狱。愚痴无智者竟然抵制佛陀大乘佛法，恶报来临之际，只能感受无尽的痛苦折磨，不得不承受那些承受不了的痛苦。协助传播诽谤大乘法者就是如此下场，头脑清晰一点的人，赶紧忏悔，否则恶业定型，再无悔改机会。</p><p>众生都想做人，来世还想做人，都害怕三恶道苦，都想解脱三恶道免离三恶道，都想断我见断三缚结，都想证果，可是自己每天都在干些什么？身口意行都与三恶道相应，明明想依赖佛陀的教法得解脱，却有意无意的诽谤佛陀的教法，这不是愚痴是什么？自己每天依赖着清净的河水过活，却有意无意的往那条河里泼污水，这不是愚痴是什么？一切病都容易救治，唯独愚痴病难治。所以佛陀在人道和天道讲法度众，不去畜生道讲法。</p><p>二、六识论者是否能证果</p><p>六识论者只承认有五识和第六识，不承认有第七识和第八识，本质上属于断灭空论。如果不承认有第七识，是自己的作主识，就无法去观行第七识的作主性，以及作为六根之一的根性，就不能理解何以有一个法既是根又是识的，因为不解，就会否定第七识意根的存在，那么十八界就会缺少一界，我见不能完全断除，就不可能证果。</p><p>南传佛法就是六识论，佛所讲的阿含经，涉及到了第七识和第八识，讲过众生都有自洲，有法住，有众生依，这就是指第八识，也讲过有六根之一、十八界之一的意根。只是南传部落派那些人看不懂阿含经里所讲的真实义，只能看懂六识，所以就只承认六识，成为六识论者。如果不承认有个轮回的主体识，并且加以否定，就等于谤法，而谤法就等于谤佛，谤佛谤法之人不能证果。</p><p>众生一旦谤佛谤法，不但三皈五戒不成就，比丘比丘尼戒也不成就，菩萨戒就更不能成就了。真正的菩萨，闻谤佛谤法之声如三百矛刺心，如何还能亲口诽谤大乘佛法和菩萨藏？所以真正的菩萨不可能愿意与谤佛谤法之人或者团体共住共修，何况还会去赞叹和宣传谤佛谤法之人之团体的法义？真菩萨不会这样做，这样做的人不会成为真菩萨。真菩萨都会努力护持三宝佛教，关注佛教整体的发展趋势和变动，关注自身和众生能否得解脱，不会只在意个人某种利益。</p><p>三、大乘法是否是佛说</p><p>关于大乘是否是佛说，网络论坛里总是在争论不休，非常激烈。其中否定大乘是佛说的一方，是修学南传佛教的那些小乘人。他们主要以修学阿含经为主，兼修持戒修定。但是如果不相信大乘是佛亲口所说，当然也就否定了如来藏法，也就间接的否定了因果和轮回。因果从哪里来？当然由如来藏实现，六道轮回为什么会出现？当然有如来藏不灭，如来藏带着业种，与意根一起去往后世，现起后世的果报身。</p><p>大乘是不是佛说，有善根福德有智慧的人根本不用去考证，法之对与错，阅读两遍，思考一下就非常清楚了。还用去考证吗？坚持去考证的人，都是智慧非常低的没有善根福德的人。两千多年以来，也没有能考证出结果，拿出证明说大乘不是佛说而是后人编造出来的。哪个后人能编造出这样殊胜的佛法，智慧就与佛等齐，非常了不起了。</p><p>修习南传佛教学巴利文阿含经的人，普遍来说比我们汉地的人勤奋刻苦，真修实干，但是如果否定大乘，否定有如来藏，其善根福德就非常低，无论怎样修行，也不会证果。因为不信佛说，对三宝没有充分的信心，对佛没有足够的信，三皈五戒不成就，不能证果。如果这个南传没有证果之人，传承有误，后边的人包括汉地的人随之修学，也不能证果。</p><p>虽然南传很讲究戒律和禅定，如果否定大乘，其戒律就有缺漏，禅定也不会有多高。再说否定大乘，不会有诸佛菩萨的加持力，靠个人的力量，无论怎样修，也不会有成就。在佛世有外道们后来非常信受佛陀以及佛陀所讲的法，因为对三宝有信，三皈五戒成就，再加上他们禅定高，听闻佛陀讲法就能证果，甚至是四果，而否定大乘的小乘人，却不能证果。</p><p>否定大乘和如来藏的南传人，其智慧确实拙劣，思惟分析一下自己五阴身的由来，就能知道如果没有一个不灭的如来藏，如何有生生世世，如何有生死轮回？如果没有一个不灭的法，一辈子所修还有什么意义？修行的种子存在哪里？没有存种子的处所，后世怎么能有修行的果报？</p><p>有些人觉得南传佛教好，就去跟着学。在禅定和戒律方面，南传佛教是挺不错，但是从总体上来说，在佛法里没有一个强有力的支柱，没有一个实在的法支撑，犹如空中楼阁，修之无用。不仅修之无用，还会在阿赖耶识心田里种下断灭空的恶业种子，未来世种子发芽，还是个断灭空者，沉沦三恶道受苦无尽。所以跟随南传佛教学习的人，要擦亮眼睛，仔细思惟其中的弊病和后果，赶快退出来，以免后世苦。如果宣传否定大乘法的断灭空南传佛教，影响其他人，其罪过极大，有可能是地狱业，因果真的非常可畏，慎之慎之。</p><p>那些人看大乘法，都解读不了佛法的真实义，都是一头雾水，不知佛都在说什么。他们因为看不懂，就极力的否定又否定，愚痴又可怜，就是因为缺少善根福德。如果他们看不懂大乘法，那么小乘法也不能完全懂，所以他们不能证果。小乘法里世尊也讲了有第八识如来藏，只是用语比较隐晦，不是很直白的表达。他们否定大乘，也就间接的否定了小乘，佛戒就不成就，解脱无望。那些人都说自己禅定如何如何高，不少人都说有四禅定，其实初禅定都不大可能有。但是他们确实讲究修行，很努力，男众比我们汉地的一些人好的多，都很精进。我们汉地的男众有些人太懈怠了，经常搞超拔超度，业障就加重，无心修行，精进修行的不多。</p><p>所以谁再去寺院求超拔超度，不仅是害出家比丘，也是害整个佛教，出家人没有修行，佛教就会灭亡。超度以后，他们怎么会有精力和心境在佛法上用功？都说现在出家人不如以前，寺院修行风气不好，可是这样的后果是谁造成的？是谁把世俗的风气和烦恼习气带进寺院的？是谁污染了寺院的修道环境？是谁剥夺了僧人修道的时间和精力？</p><p>四、佛法历来都是一佛乘法</p><p>佛法历来都是一乘道，一佛乘，一切佛法都是成佛之法中的一法，大小乘在佛法当中，从来都是不可分割的，一个是基础，一个是提高和转进，是进阶，为什么要分开？</p><p>南传他们把阿罗汉当作佛，把佛当作阿罗汉，谤佛很严重，所以不能有戒体，也不能证果。他们既然不信大乘是佛说，把楞严经拿出来也没有用，信为道元功德母，没有信就是没有信根，也没有善根，修行不能成道。跟着他们学多少劫也是徒劳。如果帮助他们宣传，助长他们的势力，就会助长谤佛毁佛教的势力，就会加速佛教和大乘经的毁灭，罪过简直是非常大的，无间地狱罪。</p><p>再以后魔王会利用学佛人的愚痴，再去假装考证，然后再弄出东传和西传，让佛教四分五裂，任何人都不要修成就，全部在波旬掌下生死轮回。谁有什么资格和智慧去考证佛时代的弘法历程和真实事件？除非有唯识种智的佛时代的菩萨再来者，跟佛在一起修学过，有那时候的种子。但是如果菩萨真有唯识种智，看看佛经就能很快判断出来，哪个是佛说，哪个不是佛说，不会糊涂辨别不清楚。而一个凡夫凭什么本事考证古时佛教历史？还有的是业余佛教爱好者去考证，真是滑天下之大稽！</p><p>贪心可以度，嗔恚可以度，唯有愚痴，佛也无奈。嗔恚入地狱，地藏王菩萨在地狱度，贪心生饿鬼，有诸佛菩萨去饿鬼道度，愚痴细菌类畜生类谁也没办法度，听不懂佛法，人语不懂。</p><p>他们误会禅定也很严重，有不少人都大妄语，说自己和其他人都有四禅定，其实他们那是未到地定过暗境界，在这样的定中，也没有什么想念，好像自己不存在一样，他们就误会为四禅。那样的团体没有证果的人，根本带不出来证果有成就者，跟在后边只能造些业罢了，得不到什么好处。有些人却喜欢南传否定大乘的说法，有什么办法？佛教毁灭，大河水干，岂能有小河水？大乘法灭，佛教就灭，佛教灭还有什么南传北传？还有什么解脱？还不如去学外道法，最起码不会谤佛谤法，没有地狱业。</p></div>"
}]