[{
    "title": "第一章 意根部分",
    "author": "生如法师",
    "date": "2022年01月20日",
    "html": "<div class=\"B1_text\"><p><strong>第一章 意根部分</strong></p><p>一、意根是现识的含义</p><p>意根的现识是现量识的意思，是现量的见法，现量的识别法的意思，或者是现量的呈现法的意思。有的人把意根的现识理解为意根有如镜现像的功能，有像镜子一样显现法像的功能作用，这是极大的误会。镜子和像之间的关系是生与被生的关系，能生者一定是不生不灭的法才行，被生者却是生灭变异的，而意根恰恰是生灭变异的，是被生法，因此意根并非如镜子一般显现众像，恰恰是如来藏如镜子一般显现着众像，意根也是众像之一。</p><p>为什么说意根是现量识呢？因为意根见法是见的现前存在的法，见的是如实的法，没有比量和非量见法的功能，如来藏幻化出法的第一刹那意根就能见得到，这是带质境，接近于本质境，比较真实可靠。意根见带质境以后，如果想要进一步详细的了别，才把法传递给六识见，那么六识所见的就不是比较真实的带质境了，见的是已经经过变异了的法，其显现出来的法离本质境和真实境又隔了一层，比意根所见的法更虚幻了。况且意识见法还有比量和非量，其所显现出来的法可信度低了许多。</p><p>如果比照现识的内涵，如来藏见法更是现量的见，比意根见的更加的真实可靠。如来藏不管见什么法都是自己现前所出生和执持的法，与法没有一丝的隔碍，生什么法就见什么法，执持什么法就见什么法，不生则不见，不执持则不见，更没有比量和非量见法的情况发生。对于如来藏来说，根本没有过去的法，也没有未来的法，都是当下的法，即使是无量劫以前的法也是当下的法，但对于六识来说就不是当下的法了，其实六识是见不到当下的法的，不管见什么法都是已经变异了的法，都是过去的法。</p><p>二、意根遍触一切法</p><p>意根与如来藏捆绑在一起，如来藏现什么法，意根就触什么法见什么法，但是意根的了别也是分重点和层次的，祂所注重的法如果自己了别不清楚，就会作意和抉择，六识就会出来了别。如果意根自己能了别清楚的法，但是无法处理，就会作意和抉择让六识出来了别并且处理。</p><p>意根自己能够了别清楚不需要处理的法有极多，意识都不知道，意根触的法不需要六识了别的也极多，意识都不知道。意根触和了别清楚的法也极多，想让意识知道并且处理的也极多，可是意识因为智慧不足却无法知道，稀里糊涂的，甚至对于意根的提示暗示还感觉莫名其妙，最后不了了之了。</p><p>如来藏把六尘境界现出来，六尘最初出现的时候，是意根先触先了别，意根对六尘了别不清楚，六识就出来仔细了别，六识刚了别的时候，对六尘没有可对比的，也了别不清楚，意识就感觉模模糊糊的，等了别了几刹那之后，前后六尘有可对比的了，尘境连贯起来了，意识才知道六尘是什么。比如写字，写出第一笔，别人不知道是什么字，写出第二笔，也不知道是什么字，写出第三笔，能模模糊糊猜测出是什么字，写出第四笔，就知道是什么字了。</p><p>三、双重人格是意根的多格</p><p>一个人有双重人格，究竟是意识和意根各有一个人格，还是意根有两个人格？第一个人格现起的时候，身口意行是一个样，第二个人格现起的时候，身口意行是另一个样，两个人格不同，或者是截然相反，好像是两个人似的。</p><p>为什么会出现多重人格的现象？因为意根有多个想法和意愿，互相兼顾不了，就出现了多重人格，以满足不同的意愿，或者是展现多个性格。也就是说自己不能满足自己的意愿了，多个性格不能和谐相处了，多种经历不能重叠糅合和在一起了，没办法就形成了多重人格，以满足各个意愿和自我。意根太纠结了，化解不开矛盾，就强行地把自己一分为二，一分为多。</p><p>从多重人格的现象上，可以提前体会到诸佛菩萨的化身和报身。报身是意根现起的身，化身是分身，是由意根的意愿化现的六识的分身。双重人格各自的身口意行不同，相当于个分身六识的造作不同，诸佛菩萨的化身身份不同，造作也不同，观世音菩萨的愿力是众生应以何身得度，就现何身而说法。何身就是无数化身，是以意根度众生的意愿所化成的。一个菩萨，用化现两个或多个身份来到世间，各个色身有可能都不相知。</p><p>诸佛菩萨的愿力广大而弘深，一个色身没办法实现这么多、这么大、这么深的愿力，就要化现无数分身去实现众多愿力。意根是作主识，祂只要福德、禅定、身体、愿力足够，就会作主分身，变现众多的六识身，一套六识身有一套身口意行，众多套六识身有诸多身口意行，身口意行各个不同，都摄属于同一个意根和如来藏。而多重人格的人格，摄属于同一个意根的不同侧面，不同性格，不同意愿或者是不同心愿。</p><p>大家学完唯识，应该能成为心理咨询师，或者是心理学者，或者是心理辅导师，从事心理研究和导引者。别人的心理一看就知，谁也瞒不了你们，谁也骗不了你们，而能掌握别人心理，对人循循善诱。世间人无非都是贪嗔痴，都是执取五阴我，看不透现象界，当然就解决不了心理问题了。多思惟观行，就会把各个法义贯穿在一起，就会清晰的看到未来的走向，对佛法修证的前景感到乐观，感觉前途光明。</p><p>四、心动和能量之间的关系</p><p>我们仔细观察，当心动的时候，身根是不是在跟着一起动？心动了色身是否发生变化？意根动了大脑神经系统是否发生变化？意根动念的时候，肯定伴随有脑电波的产生。当心动的时候，比如生贪了，这时候身体上就有水产生出来了，生嗔了就会怒发冲冠、脸红脖子粗，也就说心一动身根就有变化，实际上身体上的这些变化，都是由于意根的贪嗔所引起的。当识心感觉不好意思的时候，色身也会发生变化，比如出现脸红心慌乱等，当意识的心行影响到意根的时候，色身就要出现某些反应，所以才说身心是互相依赖、互相影响的。</p><p>意根本身也是识心，也有感觉、有思想、有念头，思想念头一活动，就产生脑电波，有脑电波就会散发出能量和热量，就会脸红发热、浑身发热、躁动不安、热血沸腾、全身颤抖、手舞足蹈等等。意根心念动的时候，在大脑里就会产生脑电波，大脑里有如电流一般的波动就是一种能量，会像电流一样迅速地扩散到全身各处，这种能量类似于动能，是物质色法，所以意根心动能牵动全身都动，能量能遍及全身。</p><p>心怎么能引起物质色法的能量生起呢？这是个非常大的秘密了。物质能量的生灭变异归根结底还是三能变识的功德，第八识是第一能变识，具体提供四大种子和五大种子，生成色法能量，包括热能、势能和动能，这些能量是色法中的分子、原子、电子、离子等等四大微粒生灭变异聚集成的，如果种子不是刹那刹那的出生和灭去，则不能聚集出微粒中的动能，其中空大种子形成微粒中的空间，方便微粒按照一定的轨道来进行生灭运动，正是这些种子的生灭和微粒的运动，才产生了动能、势能和热能。这些能量可以瞬间周遍全身，流经到全身的毛细血管和经络。</p><p>第八识为什么要产生这些能量呢？因为第二能变识意根的心动，第八识随意根心所法的变动而变化四大种子，色法能量就随之产生和变化流转，由大脑中枢神经系统传遍全身。意根的指令也就由中枢神经系统发布到全身，第三能变识六识生起，意行出现，身行和口行运转，意根的指令得以瞬间完成，神不知鬼不觉，非常迅速。这其中的运作无限的神秘，无限的复杂，无限的精密，无限的快速，无限的虚幻，可以说幻网交织，神秘莫测。</p><p>心还能引起非物质色法的能量生起，叫作精神力量，比如心力强大、坚强不屈、坚毅不拔、勇敢顽强、精神振奋、斗志昂扬、跃跃欲试、蠢蠢欲动、百折不挠、热情高涨、精神百倍等等。这些精神力量能使人战胜一切困难，是完成一切事业的无价宝。色法的能量可能是有价的，而精神的力量却是无价的，它能开发出物质上的能量。所以识心活动能促使色身生发出能量，最初产生的能量就是脑电波，含有动能和热能以及势能。</p><p>能量在色身上的表现比如头胀、脸红、脖子粗、发热、发冷和身体运动，从这些状态上能看出来意根有思想活动了，有念头了，有思择了，意根一动色身就跟着动，身心相倚、互相依赖、互相影响的表现就在这里。七识本身是识种子刹那刹那生灭相连接起来形成的，识种子的生灭现象也能产生非物质能量，能让七识不停的流转造作，心所法不断地出生，喜怒哀乐、悲欢离合、沉思冥想，产生信心信念，从而带动色法能量的生住异灭。这里有非常多的奥秘需要观察和探索，定慧不足就观察不出来。</p><p>而六尘是四大种子刹那生灭形成的现象，种子生了灭灭了生就是一种推动作用，推动出六尘的流转和变化，让六尘具有物质属性，有能量作用。种子就像海中的波浪一样，由生灭的波浪推动着大海的流动不止，这样就产生了动的能量。能量是由生灭的现象所产生的，一生一灭一灭一生就是动，动就有能量，四大种子总是在极其快速的生灭着，前仆后继不断绝，生灭变化的非常快，而且是沿着一定的轨道生灭流转的，这样就产生了能量波。</p><p>能量就是一种力量，包括心的力量和物质的力量，物质的力量就是微粒子快速运动产生的，物质运动本质是四大种子的生灭变化，再有外力的加入使得四大种子的生灭变化沿着一定的轨迹运行。力的产生是由生灭现象所散发和反映出来的，没有生灭就没有力，有力就代表世间一世法都是生生灭灭的，无穷尽的生灭下去，或者是在一段时间内的生灭现象，所产生的能量，这些现象就是现代科学量子力学研究的方向。</p><p>五、意根的思和意根的知</p><p>意根与意识一样都是识，都有思心所法，都能思惟思考思量，因为极大部分人观察不到意根的思，就认为意根与意识的思有差别，把意识的思称作思惟，把意根的思称作思量，认为思惟不是思量，思量不是思惟，若说意根思惟思考，就认为不对，是意识的思惟思考；若说意根的心理活动，不少人就说不对，那是意识的心理活动。所以观察不到意根的心理活动而还要学唯识，内心还很执拗，就很麻烦。</p><p>为什么很多人都说意根的思很深沉很隐密，难于观察呢？究其原因是因为众生都是以意识的知为知，意识知什么，众生就知什么，而意识所不知的，就不知什么。意识如果智慧不足，不知意根的心理活动，不知意根所知，那么众生就不知意根的心理活动，不知意根所知，就觉得意根的心理活动很深沉很隐密很微妙。其实是应该责怪意识的无知才对，当意识有智慧的时候，智慧无碍的时候，能现前观察到意根的心理活动了，就不觉得意根很深奥难懂了，不觉得意根很隐密难知了，也就不会误会意根的心所法了。</p><p>如果众生都以意根的知为知，情形会怎么样呢？如果众生都以意根的知为知的话，意根所不知的就不知了，意根如果不知意识所知的，不管意识知什么，知多少法，意根都不知，那就是众生不知了，所以意识所学的那些理论就没有多少用处了；意根更不知第八识，要想开悟就更困难了。这时候众生就会说：意识的心理活动深细难知，很隐秘，难于窥探，第八识更是深沉隐密难知，行相微细。实际上诸法隐密不隐密，显白不显白，在于识的智慧，不在于法的本身。有智慧的时候，任何法都是显白易知易懂的，无智慧的时候，再显白的法，也觉得深沉隐密。所以六七识转识成智以后，意识就能现前观察到意根的心行以及第八识的心行，并不觉得很困难。佛观察一切法都很轻松，甚至不用观察就能知一切法，对于一切法都是了然于胸。</p><p>众生如果是以意根的知为知，就会有神通了，互相之间也许就没有秘密了，前世后世都会了然。这样就能知因识果，也许为了少受恶报，会少造恶业。但还是有不少的人我执重，明知道自己因为造恶业受了很多苦，可还是不断的造恶业，屡次进监狱的人就是这样，死不改悔。但意根因为没有意识明显的引导作用，单纯幼稚，情执会更重，我性会更重，意识很难制约祂，造恶业的几率就会更大了，断我见就更困难了。</p><p>众生如果都是以第八识的知为知是怎么样情形呢？第八识不知不见世间法，不知人我他她，不见色闻声，不知六尘境界，这样的话，众生就无法生存了，六根关闭，处于涅槃状态。这样好不好？有人会说这样菩萨就无法度众生了，但是这个时候，还有哪个众生不处于涅槃状态，还需要佛菩萨去度化？如果众生都是以第八识的知为知，那就不用学佛学法了，也没有佛和众生的区别了。</p><p>如果众生都是以五识的知为知的话，那就无法生存了，五蕴世间就不能作出运转了。因为五识只了别粗重的五尘，不了别细微的五尘，更不了解心法，不知意识，不知意根，不知第八识，除了粗重的五尘境，什么也不知。如果连意识也不知的话，那怎么还能知五尘的粗境？五识必须与意识配合了别，才能知五尘的粗重相，但只知五尘的粗重相，不知五尘的细相 不知法尘，不知心法，是断然活不了的。总之，要想知一切法，以哪个识的知为主，哪个识都必须有大智慧，转识成智，用智识才能知一切法。</p><p>六、意识的心所法与意根心所法的关系</p><p>问：“识种子出生形成七个识以后，心所法伴随着运行，识心才有的善恶无记三性。\"这个心所法是属于意根的心所法吧？因为意根里有俱生和分别习气，而前六识由识种子出生形成时应该都是清净的，受意根心所法影响后才有了三性，这么理解是否正确？</p><p>答：哪个识运行，就有哪个识的心所法伴随着。因为意识受意根调控和指挥，意识运行起来以后，祂自己的心所法现起是必然受意根的心所法影响的，受意根调控的。意根想行善，善心所法现起以后，必然带动意识的善心所法出生，以完成意根的指令。恶心所法和无记心所法现起都是这样。</p><p>意根要布施，必然要指挥六识去具体操作，这样六识的出生就是用来配合意根的，是要执行布施这件善事的，所以意识的心所法一出生必然是善的，与意根的心所法一致。意根要布施，必然要指挥六识去具体操作，这样六识的出生就是用来配合意根的，是要执行布施这件善事的，所以意识的心所法一出生必然是善的，与意根的心所法一致。如果意根不想布施，那么在布施这件善事上，就没有意识以及意识的心所法出生和运行。那就是说只要识心的心所法运作，就会出现三性，所以要清净识心，只要把根源的意根心所法清净了，其余识心也就跟着清净了。</p><p>意根想要杀人放火，就会出生六识来完成这件恶事，因为杀人放火的具体操作必须有六识才能完成，意根无法操作，所以六识一出生，心所法必然是恶的，与意根的心所法一致。所以意根具足一切善恶无记心所法，才能让六识具足一切心所法去操作身口意行，不像某些人说的意根只有一部分心所法，如果意根的心所法不全，很多事意根就无法作主造作了，意根不作主的事，六识如何操作？</p><p>意识的心所法一开始与意根是一致的，但是通过思惟之后如果觉得事情不对，也会改变心所法，回头来说服熏染意根。意识也有违背意根的时候，比如意根想做坏事，可是意识犹豫不决，不实行，改变想法之后也可以改变意根的想法，这就是意识的熏染作用。改变意根都是通过意识的熏染，经历某件事，意识都会思考利弊，这样意根就会知道利弊，以后做事就会有取舍。只不过意识熏染有快有慢，这在于意识的智慧善巧。</p><p>七、如何调伏意根减轻烦恼</p><p>净和的观行：我最近对意根的体会也有一点小收获，就是感觉意根的”动作“是分层的，祂在五俱意识产生之前主要是疑性，在五俱意识产生之后才表现出明显的贪、嗔等性。在日常生活中一般要到贪、嗔等习气产生后才能反醒过来，在坐中尽量是在五俱意识产生之初就反醒反观。但这个反醒放下的过程，一般都要用意识来做一些引导，并不能做到反醒后马上就放下（这就是意根对五蕴的空性还没有完全认同），现在苦恼的就是这个。</p><p>评：意根最初的疑，是对法的不确定性，所以还不能作出抉择，一旦内心确定不疑了，就会有一个抉择，抉择之后六识出生按照意根的想法去造作。在造作过程中，意识会对法进行观察，观察中会发现自己有贪嗔痴，这个自己就是指意根。意根的贪嗔痴要通过六识的造作反映出来，这时独头意识是有观察力或者是反观力的。一般来说，独头意识觉悟不太强的时候，都是在身口意行造作完成之后才观察到自己的贪嗔痴习气，这就晚了一步。如果独头意识觉悟力强，在要决定造作的的时候，就发现自己有贪嗔痴，要造作的是贪嗔痴业行，并且决定不造作，这个决定反馈给意根，意根再作自己的抉择，最后结果怎么样就看意根的觉悟了。</p><p>如果意根觉悟性不强，习气重的话，还是会坚持自己的抉择，不想改变身口意行，让烦恼继续现行。但是即使这样，独头意识的反观仍然是有效果的，给意根埋下了一个种子，让意根知道这种行为是贪嗔痴，是不好的，不应该做的，下次意根再想现行烦恼的时候，心里就有了迟疑和障碍，烦恼的力度会减轻。意识多次的阻止和劝导，意根的心意就会改变，不再延续烦恼的造作。所以修行不是一朝一夕的事，意识的每一次反观，都会埋下消除烦恼的种子，这些种子早晚都会生根发芽，开花结果。意根累生累世的烦恼堆积如山，不是短时间就能改变的，有耐心的熏修是必要的，应该经常保持觉悟。</p><p>八、意识烦恼的来源</p><p>意根是意识出生的俱有依，也是意识心地染污和清净的所依，意识是在意根和法尘相接触之后，意根抉择造作才产生出来的。意识的烦恼是由那里来的呢？一个来源处是由意根调控和熏染而来，另外一个来源处是由周遭的染污环境熏染而成。</p><p>意根是如何调控和熏染意识的呢？当意根接触六尘境界的时候了，大致能判断出尘境不可心，意根心里先起烦恼，并且想要对治尘境，于是意识出生，意识根据意根的指令，对当前的法尘了别，采取身口行动的时候就带着烦恼，身口就是染污的，这是意识受意根调控的结果。熏染的意思是，意根的烦恼每次出现的时候，都能熏染意识，意识渐渐受熏，就有了与意根相同的烦恼。比如说婴儿刚出生，意识没有烦恼，时间长了意根先天的烦恼就左右了意识的心行，意识越来越与意根烦恼一致，就是被意根所熏了。意识有觉悟的时候，才能减轻一些烦恼，并且能反过来控制意根的烦恼。</p><p>意识烦恼的第二个来源，就是尘境的熏染，常处同类人种种烦恼当中，日积月累地熏习，心里就出现了烦恼。意识的烦恼再反过来熏染意根，让意根也具有了同样的烦恼。断了烦恼以后的意根就不容易受熏，即使偶尔起烦恼，也是意识的临时烦恼，过后就会消除，不会长久下去。</p><p>九、无上妙法只可意会不可言传</p><p>意会是意根的实证，言传是用意识语言的解说。无上的妙法是最高最妙的如来藏法，这是需要每个人亲证实证的，其他人用语言的开导和提示，都代替不了自己的实证。实证需要诸多因缘条件，戒定慧和福德都要具足，而且已经发起了深深的疑情，能够念兹在兹的参究，功夫做到意根这里，然后才能实证如来藏妙法。言传只能够先落到意识心里，意根的功夫没有做到位，就不能触动意根，所以言传代替不了意根的思量和参究，终究无法亲证。</p><p>禅定和参究的功夫不够深的时候，要专心做功夫，不要听别人的见解，不要参考佛经和别人的理论知识，因为这会障碍亲证实证。修行这样的事，都是自己的事，犹如吃饭谁吃谁饱，佛法谁参究谁亲证，不参不证，听来的法等于窃取来的，不属于自己的，三昧境界只能自己发起，智慧由自己心中生，学三藏十二部，永远不如自己悟。修行人应该如大丈夫一样，勇于行持，亲力亲为，摒绝一切偷机取巧。</p><p>无上妙法不可言传，还有一层意思，如来藏这个微妙甚深法，不能用语言表达出来，不管怎么说，说出来的都不是祂，无说无示，指出来的也都不是祂，不管怎么样，祂就是不出头不现身不说话不作为，低调无我，也没有调。对于这样的法怎么办？只有实证亲证亲悟才能见得祂的真面目，听来的看来的都不是，任何人传法都传不出来，那你还要听别人的指示吗？</p></div>"
},{
    "title": "第二章 如来藏部分",
    "author": "生如法师",
    "date": "2022年01月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  如来藏部分</strong></p><p>一、第八识能生一切法的真实义</p><p>第八识能生一切法，这个一切法是指众生自身七识所能缘、能触、能见的一切法，众生自身七识缘不到触不到的一切法，就不一定是自身的第八识所出生的法。但是只要是自身的七识所能缘、能触、能见得到的一切法，无一不是众生自身的第八识所亲自出生和托显的法。自身的第八识如果不生法不显法，自身的七识就缘不到触不到法，更见不到法，就不能知法的存在。</p><p>自身七识所能缘能触能见的一切法，一部分是自身第八识用自心中的七大种子所生，一部分是自身第八识不能用七大种子出生，是其他众生的第八识用他身第八识中的种子出生了法以后，自身第八识去缘，然后再托显出来，自身的七识才能缘、触和见。比如说七识见到对方的五蕴身，对方的五蕴身是对方第八识用种子出生的，自身的第八识不可能去出生，但自身的第八识可以缘和触，再把对方的五蕴身呈现出来，自身的七识就见到了对方五蕴身。</p><p>自身的七识所能缘能触和能见到的一切法，包括有别于自身的其他众生的五蕴身，以及三界器世间，包括有道种智时证得的真如法性、第八识的运行行相、七个识的运行行相、八个识的心所法，当然也包括其他众生八个识的心所法，种种心行。这一切法，总体来说，包括七识的亲所缘缘，和疏所缘缘，包括第八识亲自用七大种子所生的法，和第八识单纯照见的其他众生的第八识所亲自出生的法，其他众生的第八识所亲自出生的法这部分不是自己的第八识用自体中七大种子所生的法，而是间接显现、托显出来的法。</p><p>总而言之，第八识出生一切法，这一切法是有前提的，是与自身的八个识有关联的法，无关联的法就不在自身的第八识所生的一切法范围之内。第八识不是被出生的法，所以自身的第八识不能出生自身第八识，也不能出生他身的第八识，以及他身第八识的心所法、运行行相，他身的第八识及心所法只能是自身的第八识所显法，只能照见托显出来，不能生。他身五蕴也是如此，只能照见和托显，不能生。自身的第八识照见托显以后，自身七识才能缘才能触才能见，见的都不是有实质的法。有实质的法是自身的第八识用七大种子或者是五大种子出生的法。</p><p>二、一切法平等义</p><p>说一切法平等不二，不是依靠理解出来的那种平等，也不是从小乘法方面来理解的平等，而是从大乘法的角度来说的平等。虽然小乘法也讲一切法空，在空的意义上说一切法是平等的，但是这种平等不是真正意义上的平等，是不究竟的平等。因为小乘法都立足于世俗法相来说一切法生灭变异无常空，说生灭现象不是永远存在的，最后都消失了，消失了以后一无所有，从结果上看都是平等的，但是世俗法相在世俗谛上是不空的，有种种的相，这些相有高低不平之分，有善恶美丑之分，有生有灭之分，有色相和心相之分，既然有分别，就是不平等的。</p><p>大乘法的平等是从一切法的本质上来说的，是说一切法本质上都是如来藏的性质，但是如来藏的不生不灭的种子属性，尽管如来藏用七大种子变幻出一切法的不同世俗法相，实质都是如来藏的属性是如来藏整体当中的一部分，本质还是不生不灭不变异的，本质也都是空的，了不可得的。一切法不管如何演变，都是如来藏的七大种子的功能作用，七大种子永远都不变，不生不灭不变异，那么一切法就不生不灭不变异，所以一切法都是平等不二的。从如来藏这个角度来看一切法都是平等的，都是如来藏性和如来藏相，如来藏是一相不二相，一切法就是一相不二相。</p><p>只有在证得了唯识种智以后，才能现前如实地观察一切法的性质和属性，观察一切法的实质，才能知道一切法都是如来藏内的种子变现出来的，种子在如来藏里是不生不灭的，是本来就存在的，没有高低上下之分，所以种子形成的法也是平等的，没有高低上下之分，都是平等无差别的。但是从世俗法的现象上看一切法有不平等性，是在相上表现出来的不平等，和佛法上讲的平等这二者是辩证统一的关系。</p><p>三、禅宗不立文字是什么意思</p><p>禅宗也叫作宗门，佛法之宗是真心如来藏，禅宗就是参禅证悟真心如来藏的法门。如来藏虽然没有语言文字和声音，但是整个参禅过程也是不用语言文字和声音的，用语言文字传达出来的都不是真心，所以在参禅的时候，传法者和受法者的语言文字和声音就没有用了，所有的书籍理论没有用了，参禅者心里也不用念念有词、絮絮叨叨、哼哼哈哈的了，剥离了可对比的外缘参照物。</p><p>这样就没办法海阔天空、情思意解，比量非量地尽情发挥，意识没有发挥余地了，老老实实的全凭意根现量的思和究。虽然辛苦，彻夜难眠，但成果丰厚，能挖掘出内心意根的潜能和智慧，一旦挖出自家宝藏，从此就会过上自由富裕的日子，再也不用流离失所地乞讨度苦日子了。</p><p>这时候外面的文字和心里的文字，都不管用了，使不上力了，唯有依靠自身的智慧，这样才能开发出自己本身的大智慧，什么推理，什么分析，什么整理，什么归纳，什么拆分，什么整合，什么臆测，什么想象，什么比对，什么教量，什么理论，什么知识，什么学问，全都用不上了，意识歇下来，不用忙碌了。这时候负责任的禅师会告诉你，把佛经拿开，禁止读经看书，违犯者戒尺伺候。一旦参到关键时刻，挨打是绝对的好事，虽然语言文字都用不上了，但还可以挨打，被打的时候照样没有语言文字和思惟，但却能触动意根的灵感。</p><p>在师父给棒子的时候，如果意识很活跃，就会立刻思惟分析说这个可能就是，但结果是：错！意识又分析推理说：真妄和合，这个没错，但结果还是：错！你又进一步用排除法推断臆测说：这个不是眼识，不是耳识鼻识和身识，也不是意识和意根，一定是第八识，但最后结果仍然是：错！你敢动意识，无论怎样都是一个字：错！三个错之后，你再不觉悟，禅师就会给你推出禅堂，甚至会给你推出禅院禅寺，不要你了，因为你还不是道器，没资格参禅。当然具格的禅师是不会乱打棒子的，一定会看准了参禅者的心理状态，在最恰当的时机给棒子，这叫作当机一棒，抛掉一切尘境和情怀，现量识得非尘境非情怀的那个。</p><p>过去祖师大德总说，偷心不死不能悟道，贼心不死不能悟道。偷心和贼心都指什么心？偷什么不能悟道？是谁偷？偷什么了？参禅的时候，怎么去除偷心？参禅时候的偷心，也可以说是投机取巧的心，走捷径的心，是直接把别处的知识理论拿过来当实证当亲证的心。因为不是意根自己亲证的，意识投机取巧拿过来的名为偷。过去常常用一句话来形容有真实证量的祖师们讲法，说是这些法都是从自己心窝子里陶出来的，意思是说祖师们所讲的法，都是自己实证出来的，是自己的智慧结晶，不是意识从别处搬弄过来的现成理论知识，或者是把学来的理论进行整理归纳加工一下，改头换面变成是自己的，因为这样不算作悟道，也会耽误悟道。</p><p>什么叫作自心现量？从自己胸襟里掏出来的才叫作自心现量，胸襟心窝子都是指深深的意根主人那里。与此相反的，是意识不费力的解出来的，不用修戒定慧和三十七道品解出来的，是与学来的理论知识和别人的见解作比对参考推测出来的，这差不多就是白白拿过来的。意识这样的做法差不多就是偷了，偷心不死，意根不能思量参究，就不能证道。意识学了大量的法，实质上都属于偷，因为不是胸襟里的，不是自家的，都是别处的法，是耳入口出的法和现学现卖的法，都不是自家宝藏。</p><p>四、凡夫是否应该执如来藏</p><p>问：深信有一个如来藏，这个算不算一个微细法执呢？就是认可如来是无形无像，可还是执这个无形无象。可能有人会说：我是为表达需要不得不说这样一个名词，其实没有一个名字，也没有”一个没有名字的意象“。</p><p>答：关于我执与法执的问题，现在暂时都不用考虑，我执是四果阿罗汉才有能力断除的，凡夫离四果的距离还很遥远，我见破除都很困难了，何谈破除我执？尤其是法执，那是地上菩萨才能一点点破除的，没有明心和证果，根本破不了法执，凡夫离地上菩萨的距离几乎是一个无量劫的时间，这么早谈破法执于事无补。</p><p>在破牢关之前，执如来藏是正常的，也是应该的，毕竟执如来藏远比执五阴要清净得多，那就不如执如来藏。证得如来藏之后，才能一点点的不执如来藏，现在还没有证得如来藏，也谈不到执，只要能认如来藏是真，就已经非常好了。如来藏本身是没有我性的，但六七识把如来藏当作是真正的我，在破牢关之前，这都是好现象，是正常的和应该的。</p><p>五、三能变识现像作用的区别</p><p>意根犹如明镜现像，与如来藏犹如明镜现像有很大的区别，如来藏现像的时候，如来藏与像之间是生与被生的关系，而意根现像的时候，意根与像之间没有生与被生的关系，虽然意根是第二能变识，这个变不是无中生有的生的意思，是显现的意思，是促成的意思。</p><p>意识和五识是第三能变识，也有现像和显像的功能作用，但意识的现像不如意根现像如实，能显现出错误、错位和变异的像，所以就不起单纯的照见诸法的作用，是对像做了加工的显现。当然意根现像也不是完全如实的显现，也有了一定的扭曲和变异，只是没有意识扭曲的严重，而如来藏现像就完全如实，不扭曲，不变异，忠实于法的原貌，所以如来藏现像才真正是如镜现像。这是三能变识现像的区别。</p><p>六、心空无病及第归</p><p>六七识无形无相，做的梦也是无形无相的，梦里的人事物如何是有形有相的？为什么能见到有形有相的人事物？无形无相的梦如何能承载有形有相的人事物？无形无相与有形有相二者应该是不相容的，既然不相容，梦里如何能有人事物？</p><p>同理，如来藏是无形无相的，七大种子是无形无相的，业种是无形无相的，出生的一切法如何是有形有相的？一切法都不出如来藏之外，无形无相的如来藏如何能承载有形有相的一切法？无形无相的如来藏如何能与有形有相的一切法相容？</p><p>因此说，一切法相，落眼成翳，落耳成病，落鼻成翳病，落舌成病，落身成翳病，落意成病，七识成病，才见了法，七识无病，哪里有一切法？因此说，修行就是去翳病，去相去执，心空病才愈，心空及第归。</p><p>每当你见到法相的时候，就要觉悟自己，这是翳病所见，翳病所见，我有病了，我在病着，我要治病，我要去翳。如此下去，早晚有一天，翳病去除，不再见相，恢复正常。原来我们都不是正常人，原来所以为的正常即非正常，是名正常，恢复正常以后的正常也非正常，是名正常，正常以后的解脱，即非解脱，是名解脱。修行路数即如此，不如此者即非修行，是名修行，假修行。</p><p>不要以为学佛修行，是要获得什么，而是要去除什么，与从前的认知正好相反。想获得法，获得果，获得荣誉，获得大千世界，获得美好的生活，获得殊胜的正报和依报，不管想获得什么，都是痴心妄想，应该灭去有想，空去一切想。</p><p>七、大小乘空的区别</p><p>万法皆空的空有两方面含义，一方面是从小乘法的角度所讲五蕴世间皆空的含义，层次比较浅，范围比比较窄，不包括一切法；另一方面是从大乘法角度所讲五蕴世间皆空和一切法空的含义，层次也越来越深，是根本上的空，实质上的空，究竟意义上的空，以至于最后达到完全彻底的空，范围则包括了一切法，没有一丝遗漏。小乘法讲五蕴世间的苦、空、无常、无我，这个空是指生灭变异无常的法，只要有生就会变异甚至灭去，不能常住不能久长，有生有灭的法，是无我性的法，这是小乘的空。</p><p>大乘法的空是证得如来藏以后，现量观察五蕴世间和一切法都是如来藏所变现出来的，所以都是空的，这些法也是生灭变异不真实的。很显然，大乘的空更根本更究竟更透彻，把空的理讲明了。从地上菩萨唯识种智来讲，眼前所见的物都是心所变现的，被变生的法就是幻化的不真实的。就像魔术师凭空变一束鲜花，这束鲜花虽然在现象上是存在的，但实质是空的、不存在的，存在是一种假相。大乘法阐述世间一切法的空、假、中，而小乘的空比较浅，没有假，也没有中，只是观察世间法无常变异不住，没有被幻化的那种假，没有抓住法的实质，观察智慧比较浅。</p><p>无论是大乘还是小乘的修行，都是破除七识五阴的无明，让七识五阴具有空的智慧。如果熏习了很多法，理论很丰富，能写出诸多辩论论文，可是心却不空，把所学理论都当作实有的法，这是学知识，而不是修行，与修行背道而驰。</p><p>尤其是学大乘法，如果沉迷于深奥有趣的理论当中，不断吸取知识，孜孜以求的探索和研究，整理和归纳，条分缕析，把如来藏幻化的一切法当作有法来执取，执有而不空，这都不是修行。修行是依据理论证空而破除无明，改变心行和心性，心性只有心空了才能改变，心性改变，心行才能随之改变，果报才能由恶报变为善报。每个学人都要牢记学佛的宗旨是要达到心空，心空及第归，修行不是搞学问，不是累积知识研究理论，所以不能执理废事，要理事统一，理事圆融无碍。</p><p>八、大小乘的区分以心为根本</p><p>有一句话叫作：正人用邪法，邪法也正，邪人用正法，正法也邪。关键是人心和人的智慧。以菩萨心修小乘，小乘也是大乘，以自私心修大乘，大乘也是小乘。大小乘的区分，以心为准，不以法为准。法无大小，心量有大小，所修的法大小就立判了。</p></div>"
},{
    "title": "第三章 小乘及唯识部分",
    "author": "生如法师",
    "date": "2022年01月20日",
    "html": "<div class=\"B1_text\"><p>第三章  小乘及唯识部分</p><p>一、时间与心不相应</p><p>时间是什么法？是类似于物质的实有法吗？时间不是物质色法，也不是心法，非色非心，是与心不相应的行法。时间为什么与心不相应呢？因为心变现出来的法，一定与心相应，三能变识和合变造出来的法与三能变识相应，生灭变异增减，随心所变。而时间这个假法不是三能变识变造出来的，是心法、色法和心所法和合显示出来的假法，因此不能随心所变，不能生不能灭，不能延长不能缩短，不能得不能失。时间不是如物质一样的实有法，物质色法是四大种子形成的，是实法，而时间不是由任何种子形成的，是由物质相对变化所显现出来的，因此是非实有法，是假法，犹如龟毛兔角，看不见，摸不着，抓不住。</p><p>时间的作用是什么呢？时间没有实质的作用，假法不能拿来用。因为时间是假法，没有用处，因此也不能互相赠予和侵夺。有人会说：你占用了我的时间，你浪费了我的时间。其实根本没有这回事，谁也没办法占用和浪费时间。比如说，我现在应该吃饭，你过来了，我不得不配你谈话，解决你的事情，于是饭就没有吃上。这其中涉及到时间吗？无论吃饭还是谈话，解决事情，里面都没有时间这个法，从头到尾都是人、事和物的运转，是人事物三者和合在一起运行，这个过程的长短就把时间显示出来了。</p><p>心法和色法的运行过程，显示过程的长短，叫作时间，物质变化过程的长短叫作时间。比如说婴儿出生一个月以后，叫作满月，一个月是时间，其实是婴儿生长发育的其中一个过程，没有时间之说。婴儿生长发育一年、十年、一百年，一秒钟、一分钟、一个小时、一天，都是指婴儿生长过程，没有时间这个法，时间是被动显示出来的。有人说现在时间好像停止了，不动了，其实是心不动了，不分别了，没有时间之说，说时间动与不动都是戏论，就像谈论龟毛兔角如何如何，都是戏论。</p><p>我们看时间，是看钟表，钟表上秒针、分针和时针组合起来，显示出时间，没有这些指针就没有时间，有这些指针也同样没有时间。时间最根本的是依天空中的太阳运行的位置来显示，没有太阳就没有时间，有太阳同样也没有时间。太阳从地平面生起的时候，人类定义这个状态为一天的早晨，同时温度比较低，就定义朝阳生起这个状态叫作早晨；太阳升到头顶上空，人类定义为一天的中午时间；太阳落下来到地平面以下的状态，人类定义为一天的晚上。这样太阳运行一周，人类定义为一天时间。再统计太阳运行周期的多少，分别定义为十天半个月，一月至十二月，一年两年等等。所有的长短时间都是依据物质色法才能显示出来，并没有什么真实的法叫作时间。</p><p>如果有人求我办一些事，我就说没有时间，实际上谁也不拥有时间，只是每个人都有自己的事情要做，不能去做其他的事情，假名为没有时间。做任何事情，都是与心法和色法有关，而心法是识种子形成的生灭变异的法，也是不实有的，虽然比时间真实一些。物质色法都是四大种子形成的法，同样不是实有的，只不过比时间真实一点。心法色法都是虚妄的法，二者和合起来所显示的时间，更是虚妄的法。</p><p>如果有人希望自己活的时间长一些，不是把时间拉长了，而是让自己的色身五阴运行的流程拉长了，有的人活的时间短，不是把时间缩短了，而是五阴身运行的流程短，没有时间这个相和这个法。有些人喜欢制定时间表，其实不是时间表，不是时间上的安排，而是处理人事物的流程表，是人事物的安排流程。在生命里没有时间相了，心里能解脱多少束缚？从前因为有时间的观念，给自己多少的约束？增加多少执念？</p><p>譬如做一场梦，一场大梦，长长的梦，梦里活了一辈子，活了几劫时间，酸甜苦辣，悲欢离合，颠沛流离，醒来之时，发现仅仅是一场梦而已，什么事也没有发生，什么人也没有出现，什么东西也没有得到没有失去，自己安然无恙。梦里没有人事物，也没有时间，全部是虚幻的，醒过来就从梦里解脱出来了。同理，一切众生都在生死大梦里流离失所，困苦不堪，这个生死大梦与晚上做的梦是一样的，没有什么真实的人事物，没有时间和空间，什么都没有，虚幻的。醒过来时，就发现自己竟然无得无失，无挂无碍，了然无事，这时候就大解脱，究竟成佛了。从生死大梦中醒过来时，发现众生成佛只在刹那间，没有三大阿僧祇劫的时间跨度。我们所有的努力都是为了梦醒，所以不要再做梦了。</p><p>二、用唯识解释量子力学原理</p><p>量子力学描述：一个静止的粒子衰变，产生两个光子，分别相反方向跑极远距离，测量或者碰触其中一个光子，另一个光子就有相应的反应。这是为什么？</p><p>因为两个光子同源，来自同一个粒子。这个粒子是由一个如来藏的四大种子组成，四大种子之间有密切的关联，不管之间距离有多远。实际上两个光子之间的距离是虚空，虚空是空大组成的，空大本没有，空大没有距离，什么也没有，那么两个光子之间根本就没有距离之说。不管在世俗物理界相隔多远，本质上还是同属于一个粒子，同属于一个如来藏，有同样的功能作用。所以一个改变，另一个就会有同样的改变，同源故。</p><p>而整个世界的物质，是共业众生的四大和合组成的，当然互相之间都有密切的关联，可能会牵一发动千钧。这个密切，远远不如同一个粒子上的光子关的联密切。既然虚空空间没有其事，没有其法，那么还有时间吗？我们每个人其实再努力使一使劲，就空到家了。这个劲怎么就使不出来呢？什么时候能使出来呢？</p><p>三、菩萨的因明学叫作宗因喻，宗就是宗旨观点，因就是要阐述的理论，喻就是譬喻事例事实。宗因喻如何运用，举例而说。</p><p>有人说意根是六根之一，同五根一样是有色根。我们在如理如法的逻辑思惟之后，加以论证阐述，意根不是有色根，而是无色根。首先论证的题目也就是观点观念和宗旨就是：意根是无色根。宗旨提出来以后，要加以全面完整的论述阐述，提出论据论理，理念阐述清楚以后，再加以实例举证，用事实来说话。这样，理论论据紧扣宗旨，实例紧扣论证和理念，一环扣一环，严实合缝，没有空隙，说服力最强，即使有人反对，也说不出一二三，为反对而反对，为辩论而辩论，反对和辩论就无效。</p><p>当然如果没有严密的逻辑思维，智慧力不足，论据就不足，就没有强大的理论支撑，所论述的内容就说明不了宗旨的正确性。如果思惟不严密，阐述不全面，就有缝隙和漏洞，没有说服力不足以说服人。如果所举的事例很牵强，不能辅助说明论据的正确合理性，论据的说服力也会大大的降低，不能折服人。逻辑思辩力，能体现出一个修行人的智慧层次，智慧越强大，思惟越慎密，思辩力越强大，越有说服力，度众生的能力越强。行菩萨道的人，遇到问题就应该深细思惟观行，不断的提高自己的逻辑思惟观察力，当然前提要有很深的禅定，需要思惟的时候，就会摒弃一切干扰，全力以赴的深思。</p><p>四、瑜伽五十五卷：云何名为戒现观？谓圣所爱戒。于恶趣业、已得决定不作律仪故。</p><p>二解 瑜伽七十一卷三页云：问：戒现观、有何相？答：若有成就戒现观者；终不复能乃至故心断傍生命，不与而取，习欲邪行，知而妄语，饮米等酒诸放逸处。问：戒现观、何自性？答：圣所爱身语业为自性。或此俱行菩提分法为自性。问：戒现观、当言作何业？答：戒现观、解脱恶趣众苦为业。又云：戒现观亦无量种。谓随远离十种不善性罪业道差别多种。又随相续，亦有多种。谓预流身、乃至阿罗汉身、独觉、菩萨、如来身等，无量差别。</p><p>三解 显扬十七卷三页云：问：戒现观、以何为体？答：以圣所爱身语等业为体。或彼俱行菩提分法为体。问：戒现观、有何相貎？答：若有成就戒现观者；乃至畜生、终不故害其命；及不与取行邪佚行，知而妄语，饮窣罗迷隶耶末陀放逸处酒。</p><p>四解 成唯识论九卷十一页云：三、戒现观。谓无漏戒。除破戒垢，令观增明，亦名现观。</p><p>五、大脑决定意识功能的强弱</p><p>梦里的独头意识和梦外的独头意识有什么区别？在睡眠当中，气血运行弱下来了，大脑当中的气血运行也就弱下来了，六识是依靠大脑胜义根出生和运行的，在梦里独头意识出生以后，由于胜义根的问题，意识心功能比较弱，意识在梦里了别的就不够清楚和细致，记忆的就不牢固。如果意根觉得梦境非常重要，对其刺激很大，印象就会深刻，就会让独头意识加深印象。醒过来以后，意识就能记忆犹新，很清楚的回忆出梦境。</p><p>由于外力原因，损伤了大脑，造成了昏迷，六识消失。醒过来以后，有的人就会失忆。这是因为大脑受损，阻碍意识功能作用的发挥，意识对于信息的整合功能紊乱或者变弱，导致回忆不出某段时间的人事。一旦给与大脑强刺激，意识有可能会恢复记忆，回忆出从前的人事。儿童和幼年时期的记忆不牢固，就是因为大脑发育不完全，导致意识功能作用弱，记忆不牢固。老年人的意识普遍比年轻时候的意识功能弱，了别不细致，心思粗糙，就是所说的老糊涂。</p><p>气血运行不畅通，会损伤大脑，人会变得愚痴呆傻。所以六识是依他起性，是因缘所生法，是极其虚妄的，不可以依赖的，六识就不是我，也不是我所。在中阴身里，意识的功能作用更是微弱，因为中阴身是临时生起的，四大粗劣，远远比不上人身，严重阻碍意识的功能作用。所以在中阴身里，以意根的心行为主，意识无法有效的调控意根，意根的本性就决定了后世的趣向。所以意识证果，就是纸糊的果。</p><p>六、意识的地位</p><p>意识四五个月才出现，变造色身这事没有意识参与，即使意识出生了，也没有祂多少事。意识的地位顶多排个老三，很多重大的事情，都不必有意识参与。由此可见，如来藏和意根和合起来，能创造宇宙器世间和五阴世间，很了不得，不用意识出谋划策，不用意识提供任何建议。世间创造出来以后，意识才出来享受和受报。</p></div>"
},{
    "title": "第四章 小乘部分及禅定部分",
    "author": "生如法师",
    "date": "2022年01月20日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  小乘部分及禅定部分</strong></p><p>一、如何才能有初禅定</p><p>有人说每天坚持打坐几个小时，就能证得初禅定了。这是不一定的，进入初禅定，不在于打坐时间有多久，而在于心能否舍欲界的贪欲。很多人即使能入定一年半载不吃不喝的，也不能入初禅定，因为欲界的贪心重，不能舍离欲界法。欲界的法，能舍离多少就舍离多少，舍的越多，禅定越深。</p><p>初禅定与色界初禅天相应，心是初禅天人的心，才能有初禅定。既然要有色界天人的心，那么心里就不能有欲界的种种法，每天都努力舍离欲界的法，远离欲界的法，心就会与色界天的境界相应了，这时候必然会有初禅定，初禅定不请自来。要想舍离欲界里的法，就要思惟哪些法是属于欲界里的，欲界里都有哪些法，如何舍离？</p><p>二、如何判断是否断我见</p><p>如果小乘三十七道品没有满足就不能断我见，禅定不足，无法现前观行，只能推理想象；喜觉分、猗觉分、定觉分、舍觉分不具足，或者根本没有出现，离断我见还很远；如果四正勤断恶修善还没有修，恶还继续善还没有生起，烦恼没有减轻，心没有改变，就不能断我见；如果八正道还没有完全具足，身口意行还有不正之处，也无法断我见，如果还贪恋世间法，出离心不强，同样无法断我见；如果心中还有我相，时时处处以我为主为中心，还有人相、众生相、寿者相，四相宛然，那就没有断我见。</p><p>在修三十七道品的过程中，随着身心不断的改变，种种吉祥梦境，都在昭示烦恼在逐渐的脱落，业障逐渐的消除，心逐渐的清净，身逐渐的无障碍，禅定逐渐的加深，世俗法逐渐的远离。断我见时，法眼清净，见五蕴都空无我，有定慧等持的三昧境界出现，身心皆清净处于三昧之中，身心觉受非常。如今众生的根基都比较浅薄，这样的三昧非常不容易证得，戒定慧也不容易修满足，所以断我见非常困难。目前来看，很多自认为断我见明心的人，都没有这些现象出现，那就不是实证了。</p><p>断我见和明心的时候，已经脱胎换骨，鲤鱼跳龙门了，如果粗重烦恼没有消除，心不清净，骨头就还是原来那个，胎就不会改变。如果降低种种见道的条件，三十七道品菩萨六度都不具足不圆满，那就是爬着过龙门的，本质还是鲤鱼，没有变成龙。在证果和明心这个佛法修证最关键之处，如果很随意，不严谨，在临终的时候种种恶相就会现前，恶道就不可避免了，死后发现自己处于阴森恐怖之处，就悔之晚矣了。</p><p>三、解脱的人是什么心态？</p><p>解脱是断除了烦恼，心空无我，对五蕴十八界不执不取，不取着色蕴，不取着受蕴，不取着想蕴，不取着行蕴，不取着识蕴，不取着色，不取着声，不取着香，不取着味，不取着触，不取着法，不取着财色名食睡，不取着名闻利养，不贪世间法，随缘应物，没有功利心，没有计较心，不求回报，不为权势和名声。既不趋炎附势，也不自高自大；既不争奇斗艳强取豪夺，也不喜展露自我；既不尔虞我诈，也不工于心计，一切法无所用心。因为五蕴世间毕竟空，无所系缚，无所挂碍，取与不取都了不可得，枷锁不着心，自在无碍。</p><p>四、舍觉支与行捨的区别</p><p>舍觉支是七觉支当中最后一个觉支，念觉支、择法觉支、精进觉支、喜觉支、猗觉支、定觉支、舍觉支。舍是舍弃了一切身心负担和累赘，不管是善的还是恶的，苦的和乐的，任何觉受都舍去，内心清净无为。</p><p>行捨，也叫作不害，是舍去恶不善的行为造作。比如原来想报复某人，现在不想报复了，舍去了报复的行为；原来嫉妒于人，想加害于人，现在不嫉妒了，也不想加害人了。舍弃恶行，内心清净，或者住于善中。其觉受不一定能舍去，心里可能有喜乐，有轻安，或者有其它觉受。与舍觉支有所不同。</p><p>五、杂阿含经262</p><p>原文：<strong>佛教摩诃迦旃延：世人颠倒依于二边，若有、若无，世人取诸境界，心便计着。</strong></p><p><strong>迦旃延！若不受、不取、不住、不计于我，此苦生时生、灭时灭。</strong></p><p><strong>迦旃延！于此不疑、不惑、不由于他而能自知，是名正见，如来所说。所以者何？</strong></p><p><strong>迦旃延！正观集灭，则不落有无二边。</strong></p><p><strong>如实正观世间集者，则不生世间无见。</strong></p><p><strong>如实正观世间灭，则不生世间有见。</strong></p><p><strong>迦旃延！如来离于二边，说于中道，所谓此有故彼有，此生故彼生，谓缘无明有行，乃至生、老、病、死、忧、悲、恼、苦、集；所谓此无故彼无，此灭故彼灭，谓无明灭则行灭，乃至生、老、病、死、忧、悲、恼、苦灭。</strong></p><p>释：佛说：世间人都是颠倒的，心常依世间法有或者依世间法无，然后执取世间法有境界，或者执取世间法无境界，于是内心便计着为有，或者计着为无。</p><p>如果世人不受世间有，也不受世间无，不取世间有，也不取世间无，不住世间有，也不住世间无，不计世间有为我，也不计世间无为我，那么世间的苦生出来就生出来，世间苦灭时就灭了，与我了不相干。</p><p>对于这些道理，心里不生疑问，没有迷惑，不由于另外什么道理自己就能明了其义，就是正见，这是如来所说的法。</p><p>为什么这样说呢？如果你能正确的观行世间的集起和世间的坏灭，你的知见就不会再落于有和无的两边了。能够如实的观照世间集起的人，就不会生起世间是无的见解；能够如实观照世间坏灭的人，就不会生起世间是有的知见。</p><p>如来能够离于有无两边，说世间不有不无既有也无的中道法，就是所谓的此法有就会引生彼法有，此法生就会引起彼法生，也就是十二因缘法：无明缘行，乃至于有缘生老病死忧悲苦恼，世间的集起。</p><p>中道法也就是所谓的此法无导致彼法无，此法灭导致彼法灭，就是所谓的无明灭导致行灭，乃至于有灭导致生老病死忧悲苦恼灭。</p></div>"
}]