[{
    "title": "第1560部 华严原人论解",
    "author": "圆觉 译",
    "html": "<div class=\"B1_text\"><p>　　No. 1032-A 华严原人论解序</p><p>　　长安大开元寺讲经论<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>　圆觉　撰</p><p>　　三圣立言殊途妙契群贤著述随教异宗致令执指之徒竞成龃龉至若寻流讨本而得其归趣者盖亦鲜矣有唐圭峰禅师悯之于是稽外内之圣心赜半满之幽致制斯雅论目曰原人文启四门义该众美将使息其异见示彼真归不假他求直捷令悟观其抑扬研核引证会通辩而不华周而不比精深切当简妙严明??畎浍以距川导江河而注海诚谓生灵妙本之指南矣自非高明圆畅深造圣贤之阃阈能如是乎裴相国尝云如来为说教之主吾师为会教之人信哉裴公既序之于前屏山李君复题之于后万松禅老又开九对十八重以赞其说三贤皆达道之士不妄许可自非理归至当岂君子亦党乎窃尝考诸圭峰笺注经论诠示<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>逮百十余卷唯华严圆觉金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>等章疏盛行于世独恨斯文之未有以发明者余曩在长安尝以讲诵之暇采摭诸说聊为训解初欲附于文下然恐与论注相滥故别书之藏诸箧笥自备观览暨抵京师因学徒咨请辄复叙其梗概于篇首文虽淟涊义似有宗欲知吾人之所以为人者得不留神于是书。</p><p>　　旹至治壬戌四月既望叙于京师万安之东轩</p><p>　　No. 1032</p><p>　　华严原人论解卷上</p><p>　　长安大开元寺讲经论沙门　圆觉述</p><p>　　△将解此论大分为四初题目次撰人三叙引四本文显目复二初解正题后解并序今初正题。</p><p>　　华严原人论</p><p>　　华严二字所宗之经原人论者正显所造所宗经者具云<a href=\"/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">大方广佛华严经</a>清凉大师云大方广所证之法佛华严能证之人所证法中具三大故大者体大方者相大广者用大能证人中有因有果华严是因佛是果故华即普贤万行严即文殊大智谓以大智为主运于万行严大方广本有之法成毗卢遮那十身<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>故经之一字即能诠教义不异常具释此题广如本疏今论题中所以标者以是此论之所宗故下五教中一乘显性即此经故不全标者非释经故。</p><p>　　原人论者原者推究其本之谓也徐铉说文解云原者泉之本也后人从水而以原为原隰之原今所不取谓今欲穷究人之本始故曰原人人者<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>云多思虑故名人又人者身口柔软又人者名有憍慢又人者名破憍慢释曰多思虑言为总谓人中念虑<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记种种不同念念差别故云尔也身口柔软别语善人破憍慢言约<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者反此为有又杂心论云意寂静故名人释曰此拣恶道众苦逼迫无寂静时亦约性说如<a href=\"/ctwh/jing/13j/liji.html\" class=\"keylink\" target=\"_blank\">礼记</a>云<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>而静天之性也问<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>常言<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>通五趣等何故此论但标原人答论主约人是我同类故序云我今得此人身而不自知(云云)又<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>中其余五趣苦乐不均不堪修行故偏劝人故曰原人裴相国圆觉序曰生灵之所以往来者六道也鬼神沉幽愁之苦鸟兽怀獝钺之悲修罗方瞋诸天正乐可以整心虑趣<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>唯人道为能耳三世诸佛皆于人中<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>盖为此也下文有义可检叙之知人之源则四圣六凡类可知矣。</p><p>　　论谓评议假立宾主问答征通研究深旨教诫学徒故名曰论若合释者原通能所论为能原人为所原是人之原原人即论依主持业次第可知或原即人原人之论二释反上望上所宗即华严之原人论也或取大经之目以成本论之题即分有财得华严号解正题竟。</p><p>　　△后解并序。</p><p>　　并序。</p><p>　　并者兼及之义序者由也引也引后正文为由绪故以论并序作自一人故不别立序题但附论题之下而以并序故小书别之异正文故若望总题六离合中相违释也。</p><p>　　△二撰人。</p><p>　　终南山草堂寺圭峰兰若沙门宗密述。</p><p>　　终南至兰若即所依处于中终南山乃所依之总名地属三秦东西磐礴八百余里终南之山拣余山故草堂已下别指所居泛说终南境则宽漫故复举此然草堂即后秦逍遥园自罗什入秦诏于此园译经创草堂以居之因改为寺寺者司也国置九寺以立九卿由汉代腾兰初届馆于鸿胪尔后僧居因名曰寺即始于洛阳之白马也圭峰兰若者圭峰乃终南之别峰以其山如王者所执之圭故以名焉梵云阿兰若此云寂静处<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>所居要离諠?故此土好略但云兰若草堂之寺圭峰之兰若皆依主释然草堂圭峰相去不远论主平居或在草堂或在圭峰若裴相国序云论主北游清凉山回住于??县之草堂寺未几复入寺南圭山故双举耳草堂寺望圭峰兰若作邻近释或相违释望终南山总别依主释所依处竟。</p><p>　　沙门等者即能述人沙门二字义如常释宗密二字论主别讳俗姓何氏果州西充人幼业儒典遇荷泽和尚之孙圆和尚于遂州<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>有契遂从剃染学该内外宗说兼通造华严圆觉等诸经论疏钞着禅源诠并行于世广如本传沙门望宗密通依主持业二释望上终南山等能依所依作释可了述之一字陈功业也先德云叙理名述先来有故作故名造今新起故此论创制理应名造良以论主蕴穷源之妙慧畅博达之宏才布之以名句文身着之于翰墨简牍诱邪迷于正道斥边徼于大方有功不伐但云述耳述通能所作释可知释撰人竟。</p><p>　　△自下第三序引分三初通显大意次别叙诸宗后正明造论初文亦二初就所原以标宗于中二初顺明。</p><p>　　万灵蠢蠢皆有其本万物芸芸各归其根。</p><p>　　万灵者羽毛鳞介昆虫之属其类不一咸具觉知故曰万灵蠢者出也尔雅云作动也昆虫之类遇冬则蛰逢春而动故字从春及?今论文中且举?虫蠢动之微以况于人其实该于卵胎湿化也言皆有其本者本即因缘瑜伽释众生云思业为因壳胎湿染为缘有<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>生圆觉云若诸世界一切种性卵生胎生湿生化生皆因淫欲而正性命当知<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>爱为根本又俱舍颂云倒心趣欲境湿化染香处楞严云卵唯想生胎因情有湿以合<a href=\"/remen/ganhua.html\" class=\"keylink\" target=\"_blank\">感化</a>以离应金刚论云受生摄依壳而生曰卵动类也含藏而出曰胎欲类也假润而兴称湿湿以合感趣类也不由父母但自想合无而忽有曰化化以离应假类也化亦自想悬想胜处<a href=\"/remen/qingai.html\" class=\"keylink\" target=\"_blank\">情爱</a>彼境即便化生故云离应故知众生之类无问巨细皆以爱染而为其本耳此举有情为例也。</p><p>　　万物者百谷草木之类芸芸者繁茂之状此文借老子彼云夫物芸芸复归其根归根曰静静曰复命(云云)彼意谓万物皆自道之所生还归于道是复其本根也今意但取物各有根然后方得枝叶茂盛此举无情为例也。</p><p>　　△二反结。</p><p>　　未有无根本而有枝末者也。</p><p>　　广韵云一在木下为本根株之谓也一在木上为末枝叶之谓也若无根本那有枝末。</p><p>　　△后正显所例。</p><p>　　况三才中之最灵而无本源乎。</p><p>　　况谓比况上明?虫草木尚有因缘比拟于人亦当如是安得不穷其本致乎言三才者天地人也才谓才能谓天有运动之才地有生成之才人有鉴虑之才古人云天生万物唯人最灵既曰最灵是胜于万物者也可无本乎。</p><p>　　△后就能原以立理二初先立理。</p><p>　　且知人者智自知者明。</p><p>　　此二句文全取老子明皇注云智者役用以知物明者融照以鉴微智则无所不知明则无所不照彼疏释云知识察也言役心生智识察前人之美恶可谓之智若反照内察了观其心不生知法是谓明了今文则用之意则不止如此如下显真源处了性同佛方是此宗真实智明以本该末亦无遗矣。</p><p>　　△后正明能原二初反显须原。</p><p>　　我今禀得人身而不自知所从来曷能知他世所趣乎曷能知天下古今人事乎。</p><p>　　我者论主自指五蕴假我盖举自己以激劝他人也禀谓禀受如<a href=\"/ctwh/jing/13j/xiaojing.html\" class=\"keylink\" target=\"_blank\">孝经</a>云身体发肤受之父母谓有所禀受而得此身也所从来者即前世所禀依内教说即过去业惑展转乃至本觉真如是也曷者何也他世即后世也趣谓趣向谓舍此身已当生何道天耶狱耶或升或坠意云既不知生从何来又焉知死所趣向乎如夫子云未知生焉知死此之谓也天下古今人事者天下横约处古今竖约时人事者如运祚兴亡风俗美恶礼乐成坏刑政得失之类是也然知所从来及他世所趣即前自知之事天下古今人事即前知人之事盖原身为本天下古今为末必先究其本然后穷其末则不失其序矣若夫终日论天下古今至于此身而不知究则是弃本而事末矣如马迁修史而不免于烦刑杨雄著书而竟终于投阁谓之明智可乎诗云既明且哲以保其身斯之谓欤。</p><p>　　△后顺成得旨。</p><p>　　故数十年中学<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>师博考内外以原自身原之不已果得其身。</p><p>　　学无常师者言不但师于一人也清凉云益我为友人皆友焉博谓广博巧谓巧究内即佛教宗说之旨外则儒老百氏之书其志在于穷究自身之本非为于禄求名之学也夫子云古之学者为己今之学者为人原之不已者已者止也有所未至心不止也功成必致故得其本故论主圆觉疏序云髫专鲁诰冠讨竺坟禅遇南京教逢圆极又云行诣百城坐探群籍皆其事也。</p><p>　　△二别叙诸宗五初叙外教。</p><p>　　然今习儒道者秪知近则乃祖乃父传体相续受得此身远则混沌一气剖为阴阳之二二生天地人三三生万物万物与人皆气为本。</p><p>　　明教大师云(宋高僧契嵩禅师作辅教编闻于朝廷仁宗许编入藏赐号明教大师下文多引用之矣)道教与儒教同源出于三皇五帝故今从古相合以明儒即儒教孔子为主成氏南华注云儒姓郑名缓篇韵训云儒者柔也道即道教老子为主其后列御[冠-寸+文]庄周皆宗之后世张陵之徒杂以邪说非老氏之本旨今言道教但取老庄言乃祖乃父(云云)者传约从本流末续谓以末继本谓祖传父父传孙世世不绝子续父父续祖展转乃至高曾远祖故孝经云父母生之续莫大焉远则下展转推穷则自混元一气(云云)谓天地之前唯一元气混然不分故曰混沌剖谓剖判即混沌既分之后阳气轻清故上升阴气重浊故下沉升者为天沉者为地二气和合人生其中是为三才从此渐有万物道经云道生一一生二二生三三生万物明皇注云一者冲气也言道动出冲和妙气于生物之理未足又生阳气阳气不能独生又生阴气积冲气之一故云一生二积阳气之二故曰二生三阴阳含孕冲气调和然后万物阜成故曰三生万物又<a href=\"/ctwh/jing/13j/zhouyi.html\" class=\"keylink\" target=\"_blank\">周易</a>云易有太极是生两仪两仪生四象四象生八卦八卦定吉凶吉凶生太业又钩命诀云易有五太一曰太易气象未分也二曰太初元气萌也三曰太始形之端也四曰太素形变有质也五曰太极形质已具也从此渐生天地万物论中双合二家之意为文该上诸说虽小不同皆以气为初始渐有人及万物故。</p><p>　　论结云万物与人皆气为本。</p><p>　　△二叙内教。</p><p>　　习<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者但云近则前生造业随业受报得此人身远则业又从惑展转乃至阿赖耶识为身根本。</p><p>　　此虽总言佛法意乃别指权小近则下指人天教远则下一句小教阿赖耶识即<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>教于此三中前不兼后后必兼前中间云乃至者谓惑又从执而起然惑与执各有二种惑二种者一<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障二所知障执二种者一<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>二法执谓五蕴等从众缘生本无实性众生不了计以为实名曰法执由执法故于诸理事世出世法不能通达名所知障此五蕴中法尚难得况主宰者众生于中妄计实我名为我执由执我故烦恼障生尘劳竞兴业报不息由此轮转苦果无穷而二乘人但除我执烦恼障未断法执所知障菩萨双断二执<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>然此二执二障于赖耶识皆有种子从种生现起惑造业推穷其本则自赖耶故云乃至广如下明。</p><p>　　△三总非。</p><p>　　皆谓已穷其理而实未也。</p><p>　　如上所说皆是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>权渐之谈非究竟了义之旨恐人执滞故总非之意在责人非斥法也。</p><p>　　△四通妨。</p><p>　　然孔老释迦皆是至圣随时应物设教殊途内外相资共利群庶。</p><p>　　恐有难云如前所说元气阴阳业惑识变皆是孔老释迦至圣所说何得非之故今通云自是学人不达圣意岂孔老释迦之过欤然则圣意若何论云然孔老(云云)此乃总出三圣立教之意也言随时应物者孔老之时此方人根未熟尚未堪闻<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>之说况<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>了义之谈故孔老先以仁义<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>而渐诱之旦指元气阴阳为本西方佛出世四十年前人根未熟未堪闻于佛性了义之旨是故大觉且随二乘五性之机说业识变等至四十年后方说一乘故<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>云久默斯要不努速说皆显随时应物也言殊途者谓殊异路途即指前所说元气业惑等立教不同故曰殊途言内外相资等者资者藉也助也谓虽设教不同然亦互相资赖道并行而不悖也盖佛教藉儒老为诱物之始儒老藉佛教为成物之终如目足相资方能全济又震旦之机宜以仁义道德而化故孔老以是化之余方之机宜以业惑等化故大觉以业惑等化之众生不一故曰群庶。</p><p>　　△五蹑迹重通二初总明权实二初纵。</p><p>　　?勤万行明因果始终推究万法彰生起本末虽皆圣意。</p><p>　　恐人难曰三教圣人利物之心既同则应三教皆可原人何故此中偏宗佛教故复答云利物之心三圣虽同权实之用三圣则异儒道一向是权佛教兼于权实今取实教了义故偏宗佛迷于权实岂达圣意言?勤万<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>?谓?发万行者且言行门之多不但说施戒等至于<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>缘生十善<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>四禅八定儒老五常道德等皆在其中细详文意自可见矣因果始终唯明佛教修因为始感果为终或约一人先后为始终也万法至本末亦通三教儒道以气为本释教以业惑<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>真如为本随宗不同末则可知从上?勤万行下至虽皆圣意纵也。</p><p>　　△后夺。</p><p>　　而有实有权二教唯权佛兼权实。</p><p>　　应再问云三教之中何权何实故下句云二教(云云)言权实者权谓权假亦曰权宜秤锤曰权言能酌量轻重以喻圣人方便分别事宜随器授道孔子所谓可与立未可与权是也实者果之核取其坚也亦确乎不可拔之谓也然则二教之权与佛教之权可得闻乎答曰冥显有异二教之权即冥权也佛教之权乃显权也何以言之明教大师云权也者有显权有冥权显权则为浅教为小道冥权则为异道为他教释曰浅教<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>相破相小道如二乘人天此之三乘如化城之喻是佛随宜之说故曰显权冥权者无方妙用潜兴密应或为异道之师以化正彼类或为他教之主用他教法以利于世如<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>云或持牛狗及鹿戒或着坏衣奉事火等又清净法行经云吾遣<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>以为老子又遣净光童子示为仲尼故知孔老皆大觉冥权也总明三教权实竟。</p><p>　　△后别明权实之用二初纵。</p><p>　　?万行惩恶劝善同归于治则三教皆可遵行。</p><p>　　亦应先难云前明教有权实唯宗实教则应权教皆无用耶答曰是何言欤夫圣人设教各有攸当或权或实随器所宜故此一科即显权教之有用也初句如前已解惩恶劝善有惩者戒也止也即止恶兴善也儒教三纲五常老氏保雌守弱释教三学<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>莫不皆使人止恶兴善而已泛常所说三教大同者此之谓也<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>云为善不同同归于治今借用之明教云神农志百药虽异而同于愈疾也后稷标百谷不同而同于养人也圣人为教不同而同于为善也证此可知遵者依也所归既同依行皆可是故依儒教则为成德之君子遵老氏则为清净之真人禀释教则出三恶而往人天乃至究竟证三乘而圆二果者矣。</p><p>　　△后夺。</p><p>　　推万法穷理尽性至于本源则佛教方为决了。</p><p>　　此即显实教之用也亦应问云既三教皆可遵依又何必偏遵实教故今夺云推万法(云云)大意前言三教皆可遵行者但顺圣人随宜益物治已成之人身非欲穷究所以成人之源本欲穷其本则非了义教莫能尽之言推万法穷理尽性者推谓寻其本致穷谓极其根源尽谓竭其蕴底万法即色心等世出世法然穷理尽性语出周易彼系辞云穷理尽性以至于命昔者圣人之作易也将以顺性命之理彼注云理谓理数性谓性能命者生之极穷理则尽其能若穷其理数尽其性能则顺性命之理又儒宗以天所赋为命今佛教亦说理性故借彼文取意则异理谓道理真理性谓法性心性不取天赋故不言命谓真如一法横对诸事曰理广也竖贯一法曰性深也然在无情曰法性在有情曰心性亦曰佛性亦名本觉亦曰如来藏即下显性经中所说真性是也谓色心等法从缘而生无实<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>全是真如<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>所成故此万法皆以真如而为本源故论主圆觉疏序云万法虚伪缘会而生生法本无一切<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>识如幻梦但是一心心寂而知目之圆觉此推万法至本源之谓也唯识亦云此诸法胜义亦即是真如常如其性故即诸法实性亦此义也言至于本源者非离真性之外别有本源但约教诠浅深之异故有至不至尔起信云心真如者即是一法界大总相法门体所谓心性不生不灭乃至云唯是一心故名真如又立义分云摩诃衍者总说有二种一者法二者义所言法者诸众生心是心即摄一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>出世间法依于此心显示萨诃衍义故明教大师云人者天者圣人者孰不自性而出所以出者固其本也此本则万法之大本也注云人天与佛等三乘圣人谁不从此一性所出则知性者为万法之本源矣华严经云云何说诸蕴诸蕴有何性蕴性不可灭是故说无生分别此诸蕴其性本空寂空故不可灭此是无生义众生既如是诸佛亦复然佛及诸佛法自性无所有则知不生不灭真如妙性实诸法之本源矣非一乘了义何以臻此言决了者谓决定了义亦决断显了也此言佛教别指显性。</p><p>　　△三明造论二初总显余宗未了为造论之缘由三初总明。</p><p>　　然当今学士各执一宗。</p><p>　　此言学士即通指习三教者士即人也各执一宗谓习儒者唯执天命习老唯执自然等更不复博究圆畅。</p><p>　　△次别明。</p><p>　　就师佛者仍迷实义。</p><p>　　或执业惑或执识变不信一乘实教设谈佛性定拣阐提纵说真如但云不变有所未悟故曰仍迷其犹众盲摸象岂识象之全躯坐井观天宁见天之无际。</p><p>　　△后结责。</p><p>　　故于天地人物不能原之至源。</p><p>　　问此科与前别除诸宗何异答前就学人所知以显教之权实今约学人所执为造论之发端向使学人无封执之情则论主可以亡言矣。</p><p>　　△二正明造论分三初先叙所凭。</p><p>　　余今还依内外教理推穷万法。</p><p>　　余者我也论主自称之词还依内外教理则见解<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>而无偏局之弊与夫未尝读<a href=\"/remen/foshu.html\" class=\"keylink\" target=\"_blank\">佛书</a>而辄议佛者相去远矣夫子云盖有不知而作之者我无是也论主之谓欤。</p><p>　　△次别示。</p><p>　　初从浅至深于习权教者斥滞令通而极其本后依了教显示展<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>起之义会偏令圆而至于末(末即天地人物)。</p><p>　　言从浅至深者即指论初二门斥迷执偏浅也于中前前浅而后后深斥滞令通者即破执情而显圆解也极其本者指第三门显真源也极者至也后依了教下即指第四门显示展转等者即第四门中用显性了义会前所斥同一真理也。</p><p>　　△后结名。</p><p>　　文有四篇名原人也。</p><p>　　可知。</p><p>　　△大门第四释本文中分二初标列章门。</p><p>　　斥迷执第一　斥偏浅第二　直显真源第三　会通本末第四。</p><p>　　四门次第如向已说。</p><p>　　△二正释四初释初章二释第二斥偏浅三释第三直显真源四释第四会通本末初中复二初牒门名。</p><p>　　一斥迷执(习儒业者)。</p><p>　　斥者排摈义唯韵云逐也远也谓驱逐令远去也迷谓惑而不悟执谓固守不移。</p><p>　　△儒道下二正指儒道三就彼诘难四结显未了就次章中文分三段初正明所本二宗合辨。</p><p>　　儒道二教说人畜等类皆是虚无大道生成余育。</p><p>　　二宗合辨其义如前小有不同随文当示言皆是大道生成养育者即老氏意道经云有物混成先天地生寂兮寥兮独立而不改周行而不殆可以为天下母吾不知其名字之曰道强为之名曰大明皇云以通生表其德字之曰道以包含目其体故名曰大母者取其生育义也老氏意云我见一物混然而成出于自古非声非色卓然挺特不逐物移遍万物中安然坥荡众妙由之而出宜其为之母也故为强立名字曰大道焉又德经云道生之德畜之物形之势成之彼疏云道降冲和之气陶冶万物万物得之以生故云道生之德得也畜养也谓万物得道用而能畜养斯形则约道畜养之处而受德名故云德畜之道生德畜品物流形故曰物形之道为万物作天时地利阴阳之势而物资之以成故曰势成之又云故道生之畜之长之育之成之熟之养之覆之彼疏云始之为生养之为畜令增进曰长字抚为育辅相曰成遂终曰熟资给曰养荫庇曰覆上之八字皆道德功用之谓也。</p><p>　　△二明生起次序。</p><p>　　谓道法自然生于元气元气生天地天地生万物。</p><p>　　道法自然一句全是道经彼云人法地地法天天法道道法自然注云人谓王也为王者先当法地安静既尔又当法天运用生成既生成已又当法道清净无为令物自化人君能尔即合道法自然之性也又云自然者妙本之性性非造作故曰自然道者妙本之用道与自然体用之称非谓道法效于自然也今论正用道法自然一句者不取人君法则之义但明自然之道在天地之先而已恐欲知源故具引之言生于元气者取道经意彼德经云道生一一生二二生三三生万物如前序中已引但今论中生于元气即彼道生一元气生天地即彼一生二二生三天地生万物即彼三生万物盖变其文势贵异前耳而意则同然前叙中混沌即儒者之说此言大道即老氏之意前后互举显二宗之大同也。</p><p>　　△三约人显本二初约从本起末。</p><p>　　故愚智贵贱贫富苦乐皆禀于天由于时命。</p><p>　　愚谓诸情暗钝智谓慧解高明贵谓名位尊荣贱谓身职卑下贫谓资生阙乏富谓财用富饶苦谓逼迫心形乐谓诸根适悦然愚智约性贵贱约位贫富约资苦乐约受亦应言吉凶寿夭妍[媏-而+(乏-之+虫)]病健等触类可推矣此皆人中品类不同言皆禀于天由于时命者儒宗泛说多止天命时与命皆数也<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>云死生有命富贵在天孟子云莫之为而为者天也莫之致而至者命也。</p><p>　　△后约原始反终。</p><p>　　故死后却归天地复其虚无。</p><p>　　天地者儒宗所归虚无者老氏所复道经云夫物芸芸复归其根归根曰静静曰复命(云云)言万物既禀天地元气而生如草木依根而得荣茂死则复其本始如草木凋落精脉还其本根是复其所禀之性命从天地生复归天地者如邵子云上天生我上天死我一听于天有何不可此之谓也。</p><p>　　△四明立教大旨。</p><p>　　然外教宗旨但在乎依身立行不在究竟身之元由所说万物不论象外。</p><p>　　言外教者谓佛法之外也言依身立行者儒宗五常百行老氏保雌守弱皆以修饰其身而已大学云自天子达于庶人一是皆以修身为本孝经云立身行道扬名于后世老子云名与身孰亲身与货孰多等不在究身之元由者不言此身因何而有何故得为人何故为畜等纵若说者不过大道元气而已言象外者象谓物之形象易系辞云夫象圣人以以见天下之颐而拟诸其形容象其物宜是故谓之象如乾卦三连以象天纯阳坤卦六段象地纯阴亦如丹青图画肖物形容故唐太宗圣教序云二仪有象显覆载以含生又世俗说天圆地方则知天地皆有形象也今世教所谈至大者不过天地而已而人畜万物皆在天地之中故其所论不出天地之外故云所说万物不论象外<a href=\"/ctwh/zi/djjd/zhuangzi.html\" class=\"keylink\" target=\"_blank\">庄子</a>云六合之外圣人存而不论则知天地之外孔老非实不知但以世人智浅未足与议论语云夫子之言性与天道不可得而闻也况象外乎。</p><p>　　△五释通妨难二初正释通妨难。</p><p>　　虽指大道为本而不备明顺逆起灭染净因缘。</p><p>　　恐有问言彼宗亦说大道元气等生成万物大道元气即是身本那言不究故今释云虽指大道(云云)论文略举且言大道实兼元气天命父母等也然元气父母等但是生身之具而非即是身本譬如孩稚见母笼甑取饼啖之便知是饼笼甑所成后来索饼即指笼甑岂知笼甑但是成饼之具岂是饼之所本哉今元气天地等笼甑之谓也执为身本孩稚之见而已而不备明下正显所迷顺逆起灭者谓内教所说<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>迷则从无明起行展转乃至有生老死即顺<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>起动而成<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>也悟则从生死逆观乃至无明遂起智断无明由明明灭故行灭乃至生老死灭即证圣果此明逆生死而还灭也此十二支通大小乘义门繁广非略可尽言染净因缘者有二一约小乘其说又二一者如前十二有支由无明缘行乃至生缘老死是染因缘由无明灭行灭乃至老死灭是净因缘二者约苦集灭道四谛谓苦集是世间因果灭道是出世间因果由造集谛因感苦谛果名染因缘由猒苦故起道谛智断彼集因苦果不生证灭谛理名净因缘故净名云从痴有爱则我病生众生病愈我病亦愈二约大乘亦二一约法相宗谓藏识法尔包摄三乘及三性名言种子而一切众生有无不同若有三乘种子者遇缘熏习修行断障当得三乘圣果名净因缘(此且三乘总说应别明之)若无三乘种子但有有漏三性等种即造三种业(福非福不动)<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>流转名染因缘二约法性宗真妄和合成黎耶识若迷之时染法有力净法无力向缘下转沉沦三界名染因缘悟时净法有力染法无力背缘上转成四圣位名净因缘广如下引此等法义外教岂知况能备明。</p><p>　　△后约人显宗。</p><p>　　故习者不知是权执之为了。</p><p>　　孔老所说但是权宜不执则为入道之缘固执则为障道之损圭峰云儒资<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>道助禅那此其缘也入难之中世智辨聪反成为难此其损也宜自择焉。</p><p>　　△二就彼诘难二初总标。</p><p>　　今略举而诘之。</p><p>　　△后别难有四初难道生二初牒彼所立。</p><p>　　所言万物皆从大道而生者。</p><p>　　此唯老氏所执诘者问也假立宾主难疑答问论之式也所言万物至而生者此句牒彼所立下皆准知。</p><p>　　△后正申难二初道常物亦应常难二初按定。</p><p>　　大道即是生死贤愚之本吉凶祸福之基。</p><p>　　彼以长生久视为道故作此难之初二句按定基谓基址亦曰镃基尔雅云基初也。</p><p>　　△后正难。</p><p>　　基本既其常存则祸乱凶愚不可除也福庆贤善不可益也。</p><p>　　道既是常物亦应常如世子孙还类父母则祸乱应常祸乱非人力可以剪除福庆应常福庆非积善可能增益故李思慎云老以生与死命也悉是道之所为圣与不肖性也但是天之所与天与不可逃道为不可捍知天道之不可逃捍者则能安处长生守金性情(云云)。</p><p>　　△后反质破。</p><p>　　何用老庄之教耶。</p><p>　　恐云设如祸福不可增损复有何过故今难云如此则孔老设教遂成无用良以圣人见善有益可以致福故劝令为善见恶有损可以致祸故教令远恶则知吉凶祸福由我致之既道使然于我何预勉之修善曾何所图。</p><p>　　△二祸福倒置非尊难。</p><p>　　又道育虎狼胎桀纣夭颜冉祸夷齐何名尊乎。</p><p>　　育谓鞠育胎谓含孕互举为文虎狼害人之兽岂道畜之而使害人桀纣暴虐之君岂道孕之而使虐民必曰道生道何不道桀者有夏十七世君名履癸谥法云贼虐多杀曰桀刘恕通鉴外纪云桀为无道暴戾顽很贪虐荒淫残伤百姓天下颤怨伊尹佐汤伐之桀战不胜奔于三朡之国汤又伐之放于南巢而死纣者殷三十世君帝乙之子名受谥法云残义害善曰纣外纪云智足以拒谏言足以饰非因宠妲己作酒池肉林为长夜之饮用炮烙之刑剖比干囚箕子周武王举兵伐之纣不胜遂自焚而死夭短折也颜即颜回字子渊冉即冉耕字伯牛皆孔子<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>四科中<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>科也论语云贤哉回也不迁怒不贰过不幸短命死矣又伯牛有疾子问之自牖执其手曰亡之命矣夫斯人也而有斯疾也(云云)先儒谓伯牛有恶疾将死夫子叹之夫以二子之贤而不享年故曰夭颜冉祸谓凶祸夷齐谓伯夷叔齐先儒云孤竹君之二子也父丧兄弟让国不绍武王伐纣二子谏之不从耻食周粟饿死于首阳山下以夷齐之贤而致饿死故云祸也若云万物皆是道之所为者道乃富愚夫而祸贤士何足敬哉且世有好贤恶不肖人必谓之君子妒贤嫉能人必谓之小人君子也人皆敬之小人也人皆鄙之道经云万物莫不尊道而贵德使道之所为诚如前说则不足敬也故曰何名尊乎。</p><p>　　△二难自然二初牒彼立义。</p><p>　　又言万物皆是自然生化非因缘者。</p><p>　　亦道教所执儒宗亦执天为自然若内教说一切万法从因缘生谓亲能发起为因疏能助起为缘然一切万法不出内外外者如草木等从种子生名曰亲因水土人时名曰疏缘内则人畜等从业惑生名曰亲因父母二气名曰疏缘若委细说具如下文今对外宗且略叙又谓彼儒道既执自然则不推因缘故庄子云不知所以然而然名曰自然又云[鴳-女+隹]不日浴而白乌不日黔而黑言皆自然也儒宗执者如司马君实无为赞云治身以正保躬以静进退有道得失有命守道在己功成则天天复何为莫非自然。</p><p>　　△后正申难二初自然即应无端难。</p><p>　　则一切无因缘处悉应生化谓石应生草草应生人人生畜等。</p><p>　　谓既不待因缘则石非草等因缘应能生草草生人人生畜等以皆非缘故论略举以例其余故置等言即等一切非缘之事如火应生草木木生鱼鸟凡是一切不应生处皆能生也正取人不待父母缘忽自生人等如西方无因外道亦作此计瑜伽第七云何因缘故彼诸外道起如是见立如是论答谓见世间无有因缘或时歘尔大风卒起于一时间寂然止息或时忽尔暴河弥漫于一时间顿即枯竭或时[鬱-山+止]尔花木敷荣于一时间飒然衰悴由如是故起无因见立无因论清凉云与此方儒老所计颇同又<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>中衲衣梵志求佛论议佛问云汝宗何故知非因缘彼云我见牛生便能??乳龟生便能入水知非因缘佛言若言??乳非因缘者俱非因缘何不??角若言入水非因缘者俱非因缘何不入火梵志辞屈投佛出家。</p><p>　　△后自然不应缘习难二初正难二初总约情非。</p><p>　　又应生无前后起无早晚。</p><p>　　△后别约有情。</p><p>　　神仙不藉丹药太平不藉贤良仁义不藉教习。</p><p>　　前后早晚约时时乃疏缘中一事通内及外如春兰秋菊社燕宾鸿等各因其时人须十月方乃诞生非自然也神仙已下别约有情神仙要须宿禀寡欲之资炼药服气为缘方能长生不老天下太平必藉忠臣良士武以定乱文以经世君臣相济然后民安国泰时和俗淳人有才德之美皆资训诲之力习与性成未有不学而自成者孟东野诗云击石方有火不击元无烟人学始知道不学非自然信矣刘子云心受典诰而五性通焉故知仁义必由教习执自然者不亦乖乎。</p><p>　　△后结责。</p><p>　　老庄周孔何用立教为轨则乎。</p><p>　　外应问曰设依我宗自然而成不藉教习复有何过答便有圣人立教无益之过既贤者自然而贤不由教习愚者自然而愚教亦无益圣人立教便成无用轨谓车辙则谓法则如世行车必遵轨辙为法则也然老氏上士下士之说孔圣上智下愚之论在吾教中盖宿习力故谓多生熏习纯熟今得为人诸识聪利人一己百闻道勤行孔老于此谓之生知上智上士故白乐天生而识字世呼为三生人若宿世从异中中来未曾熏习或因秘吝不肯教人今得人身诸情暗钝倥侗颛[蒙-卄+((并-(前-刖))-一)]诲而不学闻道大笑孔老于此呼为下愚其中人者昔虽曾熏然未纯熟故于今世学之则成不学则殆由此观之虽愚钝之资苟能自勉于学纵未偕于上达亦自胜于不学者矣况中人乎圣人知学问有益可以革愚成智故垂典诰以为轨则斯则因缘之理明矣而曰自然未敢闻命。</p><p>　　△三难元气二初牒彼所立。</p><p>　　又言皆从元气而生成者。</p><p>　　此儒道皆执。</p><p>　　△后正申难三初气变不应缘习难二初正难。</p><p>　　则歘生之神未曾习虑岂得婴孩便能爱恶骄恣焉。</p><p>　　歘暴起也言歘然而生也神谓人之精神言初生之子八识虽具七情未彰良由创与境逢未知染着若渐长大惯习力故爱恶滋彰所谓习以性成非由元气使之然也论云岂得反质之辞言婴孩者小儿之称女曰婴男曰孩爱谓染着恶谓憎嫌骄谓矜傲恣谓纵肆皆言情也。</p><p>　　△后蹑迹转难二初牒彼救词。</p><p>　　若言歘有自然便能随念爱恶等者。</p><p>　　恐有救言且如孩子初生便能餐乳不得则啼岂待习虑故曰自然便能随念爱恶。</p><p>　　△后正难。</p><p>　　则五德六艺悉能随念而解何待因缘学习而成。</p><p>　　若尔五德六艺亦应自解不待习虑何故不尔言五德者即仁等五常或父义母慈兄友弟恭子孝六艺谓礼乐射御书数然人生便知饮乳啼号者无始以来惯习力故与心俱生如前牛不??角龟不入火皆因缘也岂是元气使之然也。</p><p>　　△二气灭应无鬼神难三初申难二初按定。</p><p>　　又若生是禀气而歘有死是气散而歘无。</p><p>　　△后正难。</p><p>　　则谁为鬼神乎。</p><p>　　儒者皆执气聚为<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>散为死故今难云若尔气散断灭应无鬼神盖鬼神之说儒宗许有故彼所知以难之然依儒典训神者伸也鬼者归也阳魂曰神阴魄曰鬼然论语云子不语怪力乱神者盖以鬼神理幽常人智浅故但令敬而远之恐生惑著然岂谓之无鬼神乎易曰精气为物游魂为变故知鬼神情状谓百骸四体男女构精之所成故曰精气为物彼云游魂为变者即如佛教所说<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>由无质碍任运能往故曰游魂意谓游魂与精气合而为人精气有灭而游魂不灭故为鬼神若内教说三品九类之中有福德者为神无福德者为鬼胜劣虽异皆鬼趣摄。</p><p>　　△二引事证成二初举知<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>证非禀气。</p><p>　　且世有鉴达前生追忆往事则知生前相续非禀气而歘有。</p><p>　　言鉴达前生事等者如羊祜之识金环(晋羊祜字叔子幼年尝牵乳母至李宅门外祜树穴中得金环一枚谓乳母曰此吾先世为李家子戏所藏也吾年七岁堕井而死事出本传)崔咸之征墨志(唐崔咸父锐为泽潞节度使李抱真从事有客卢老者自言学道于隋朝云际寺李先生每往来泽潞锐常善待之终谓锐曰吾当与君家作子以口傍墨痣为验及生咸果如其言出本传)房管剖松下之书(唐房管字次律开元中宰桐庐尝与道士刑和璞过夏口入一废寺坐古松下和璞使人凿地得瓮中所藏娄思德与永禅师书笑谓管曰颇忆此耶管帐然悟前世之为永禅师也出明皇杂录东坡有诗云殷勤古松下为剖瓮中书)唐绍刺灯前之犬(唐绍者开元中为给事中尝与对门中郎李邈善每厚待之妻尝谏曰勿友非类绍曰非尔所知后因骊山讲武绍摄礼部尚书玄宗援桴击鼓时未三合张说遽令绍奏举神武赫怒拽兵部尚书郭元振坐于纛下欲斩之张说跪奏元振有社稷之功免死乃斩绍先一日绍谓妻曰吾前生为杜氏女适霸陵王氏子十七岁常灯下运针昏睡犬入房触油污衣心怒遂以剪刀刺犬剪一股折而犬犹活复换一股犬方毙吾十九而亡犬者今李貌是也明日行刑必貌翌日果如所言初一刀头未落再换一刀头方落出李吉甫异闻记)圆观峡中之旧约(唐李证之子原老与道人圆观友善相约自峡入蜀路逢女子浣纱观谓原曰此吾寄托之所也盖业缘不可逃明年某日君自蜀还可相临以一笑为信又云吾已三生作<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>云云已而观果死明年原如期至女子家则儿生三日已原使抱临明檐儿果一笑却后十二年原至孤山月下闻扣牛角而歌者曰三生石上旧精魂赏月吟风不要论惭愧情人远相访此身虽异性常存依夜话引)东坡陕右之梦游(苏子由谪南安与云庵及聪禅师交游一夕云庵梦同子由聪公出城迓五祖戒禅师明日以语子由语未卒聪公至具言所梦与云庵同三人方谈笑间忽东坡书至曰已抵奉新旦夕可相见三人大喜共出城二十里至建安寺而东坡亦至因举梦语坡坡曰轼年七八岁时尝梦身为僧往来陕右又先母方孕时梦一僧托宿颀然眇一目云庵惊曰戒公陕右人后失一目暮年弃五祖来游南安终于大愚逆数五十年而坡时四十九矣出冷斋夜话)卢女忆贩羊之宿冤(昔长安城南卢叔伦家女子桑间逢僧乞食问得食处女曰村东二里王家饭僧遂往果得斋王氏问僧所从僧以实告既而王氏翁媪俱至女家女闭户不出问女母曰我家设斋人无知者女何知耶女自房出呼曰某年月日贩羊胡父子何在翁媪惊趍出母问女曰汝适何故女曰我前世为夏州贩羊客姓胡宿其家彼杀我父子羊尽为所有我后于其家作子十五得病二十而终医药之资已过所劫犹每岁与我作斋虽然命债尚须偿也出逸史)西山决弑亲之疑狱(宋理宗初真西山帅长沙日市民程二者有子年二十谋弑厥父密语其友恐事泄相涉遂首于官即呼其子问之子不讳及问其父并邻人皆不知所以问其子谋弑父故亦无可言者真察其事暗昧乃齐沐请祷一夕梦人报曰但问其父二十年前曾作何事即知之矣翌日真私问其父曰此事我已知汝但勿讳汝二十年前曾作何事父曰二十年前有沩山行者将钱一千缗欲买度牒中夜杀行者瘗于厨下以其钱营产业焉真复私问其子吾欲释汝欲以钱一千缗惠汝从汝所之汝若得钱当何所作子曰诚如所言当买度牒入沩山出家真知行者之怨遂籍其父产业计一千缗以付其子将其父配五百里外出江湖纪闻)若此之类今古实多以此验知舍身受身自类相续非禀气也。</p><p>　　△二举鬼有知证非断灭三初唯约理量破。</p><p>　　又验鬼神灵知不断则知死后非气散而歘无。</p><p>　　泛言鬼神者多是古圣先贤忠臣义士功流后世泽被斯民正直无私英灵不昧或镇山川社稷或司福善祸淫国旌祀典之荣民遂祷祈之应者谓之正神其有木怪山精强魂厉鬼或乘人之衰耗或附物以传通恐惧闾阎邀求祭祷者谓之淫祀正邪虽异皆俱灵知若谓死而气散则其神者为谁故东坡文集中多载鬼仙诗词良可证矣。</p><p>　　△二引教及事破二初引教破。</p><p>　　故祭祀求祷典籍有文。</p><p>　　言典籍有文者引教破如尚书金縢篇谓武王有疾周公作册书祷于大王王季文王请以身代文云维尔元孙某遘厉虐疾(遘者遇也言遇此暴病也)若尔三王(谓大王王季文王是也)是有丕子之责于天(言三王奉上天欲责武王之罪)以旦代某之身云云公归乃纳册于金縢之匮中翌日乃瘳(既祷卜之重吉次口武王果愈)又如礼记祭法祭义祭统礼运皆言祭祷之事又蔡氏月令云九月中气日在氐命有司合秩刍以养牺生以供皇天上帝名山大川四方之神以祭宗庙社稷之灵为民祈福等皆其文也。</p><p>　　△后引事破。</p><p>　　况死而苏者说幽途事或死后感动妻子仇报怨恩今古皆有耶。</p><p>　　说幽途事多关释典恐彼儒者尚未信之今引儒者一说证之宋吏部侍郎葛立方字常之所撰韵语阳秋云欧阳永叔素不信释氏之说既登二府一日被病亟梦至一所见十人冠冕环坐一人云参政安得至此宜速反舍公出门数步复往问曰公等岂非释氏所谓十王者乎曰然因问世人饭僧造经为亡追福果有益乎答曰安得无益既寤病良已又如崔子玉之掌冥府事韩擒虎之为阎罗王虞太博之为更生佛席相公之为皮场神皆幽途事之证言感动妻子仇报怨恩者如<a href=\"/ctwh/jing/13j/cqzz.html\" class=\"keylink\" target=\"_blank\">左传</a>宣公十五年晋大夫魏颗其父武子有爱妾武子疾谓颗曰当嫁之既疾笃乃令殉葬武子死颗嫁之亲族难之颗曰吾从治命(治谓疾未甚时甚则心狂语乱)后颗与秦将杜回战于辅氏见老人结草以御杜回踬而颠获之(杜回坠马颗生擒得)夜梦老人曰余余而所嫁妇人之父也尔用先人治命余以是报又成公十年晋景公疾梦大厉(大鬼也)被发及地搏膺而踊曰杀余孙不义余得请于帝矣六月丙午公薨(前二年晋景公以无罪杀臣赵同赵括言帝者即冥府十王也以事关幽途故)又江湖纪闻载南宋卫州人郑朝议从子某幼旷达能文娶会稽陆氏女亦姿媚明爽伉俪情至郑生尝语陆氏曰万一不幸汝无再醮汝若先丧我亦如之陆氏曰要当齐眉何不祥如是相处十年生二男一女及郑生疾且死方释服陆氏尽携其资适苏州曾公曹成婚方七日曾生奉漕檄考试他郡行信宿陆氏晚步厅屏间有急足呼于庭曰郑官人有书命婢取之视外题但有示陆氏三字笔札宛然前夫手泽也视急足已不见启缄读之其辞曰十年结发<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>一生祭祀之主朝连暮以同欢俸有余而共聚忽大幻而长往慕何人而轻许遗弃我之田畴移资财而别户不恤我之有子不念我之有父义不足为人之妇慈不足为人之母吾以诉诸上苍行理对乎幽府陆氏叹恨三日而亡其书朝议男甸者得之。</p><p>　　△三蹑迹通妨二初设难。</p><p>　　外难曰若人死为鬼则古来之鬼填塞巷路合有见者如何不尔。</p><p>　　外人闻说人死为鬼则谓人人死已尽皆为鬼不知有六道轮回转受后身故作此难言合有见者如何不尔者论中假作不信有鬼之问故且如是其实见鬼之事古今有之不能具引。</p><p>　　△后通释。</p><p>　　答曰人死六道不必皆为鬼鬼死复为人等岂古来积鬼常存耶。</p><p>　　言人死六道者谓或有生天或还为人或作禽畜或堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>前言鬼者但一趣耳言鬼复为人者谓鬼业尽已或复为人或转余趣岂古来下讥其胶柱如梁高僧传说后汉建和间沙门安世高舟行至洪亭湖泊舟岸上有湖神祠焉神降曰舟中沙门吾神宿世道伴为我请之安至祠中神泣诉曰吾与师曾为道友以嗔心故堕此趣中幸相悯救师请现本身神曰本身丑恶恐相惊骇安曰无虑忽有大蟒出于床后引首向安安抚之以<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>语<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>化导蟒泣谢曰幸闻<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>今脱苦矣以绢千疋黄白之资付安令作<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>安为建寺于豫章(夜话云今洪州大安寺是)已而见后山有大蟒死于草泽中自是庙不复灵此鬼趣转生之例也今俗子无识谓佛菩萨同鬼神者吁可悲哉。</p><p>　　△三禀气不应有知难二初正难。</p><p>　　且天地之气本无知也人禀无知之气安得歘起而有知乎。</p><p>　　谓气无分别岂人得之而有分别乎若人因禀气而有分别则草木等亦应有分别以所禀同故论亦应言且天地之气本无贤愚贵贱之异岂人同禀之而有贤愚贵贱之异乎而儒者皆执禀气谓禀淳和之气则为圣为贤禀浑浊之气则为愚为不肖孰不知天地之气本无差别自吾人宿习之不同尔其犹管籥之音随窍发异故有清浊高下之殊而吹者之气曷尝异哉若谓吹者之气有异则何藉竹管之殊窍乎又李白桃红姚黄魏紫无乃春风之各异乎何不辩其物性而责于气耶。</p><p>　　△后举例难。</p><p>　　草木亦皆禀气何不知乎。</p><p>　　亦应云禽兽亦皆禀气何飞走之不同盖天地之气犹炉冶甑?之谓但能成物非物所本故炉冶虽能范金不能变铜铁为良猿甑爨虽能熟食不能变糠秕为珍馐天地之气虽能成物不能使草木为人庸愚作圣良以草木各有根人畜各有本故也。</p><p>　　△四难天命二初牒彼立义。</p><p>　　又言贫富贵贱贤愚善恶吉凶祸福皆由天命者。</p><p>　　此多儒者所执先儒解云命犹令也彼宗但以清气上升至高无上曰天文中先牒义。</p><p>　　△后正难三初祸福多少不平难二初申难。</p><p>　　则天之赋命奚有贫多富少贱多贵少乃至祸多福少。</p><p>　　谓天道至公至平无偏无党何故而有贫富贵贱贤愚祸福多少之异又复于中贫贱祸夭者多富贵寿康者少世途目击岂不然哉奚者何也。</p><p>　　△后结难。</p><p>　　苟多少之分在天天何不平乎。</p><p>　　天实尔者则公平安在。</p><p>　　△二祸福倒置非理难二初正诘。</p><p>　　况有无行而贵守行而贱无德而富有德而贫逆吉义凶仁夭暴寿乃至有道者丧无道者兴。</p><p>　　无行而贵如桀纣为君守行而贱如仲尼无位无德而富如景公有马千驷何曾日食万钱有德而贫如原宪黔娄之类逆吉义凶者如奸邪得志忠良遇害之类仁夭暴寿如颜冉短折盗跖永年云有道无道者如世善人动辄坎轲强梁贪暴触事利宜自古迄今此事屡有世俗每谓天不平或云天不开眼故邓攸无子人谓天不道斯之谓也。</p><p>　　△后辨违三初牒彼所宗。</p><p>　　既皆由天。</p><p>　　△次蹑迹正难。</p><p>　　天乃兴不道而丧有道。</p><p>　　△后显过。</p><p>　　何有福善益谦之赏祸淫害盈之罚焉。</p><p>　　上句即彼所宗天乃下蹑迹正难文中且举兴不道丧有道一句意该前文无行而贵等何有下显过即显彼宗执天命者自违其教耳谓书云天道福善祸淫言下民之善恶天实司其祸福之柄作善者降之以福作恶者降之以祸淫过也此与伊训云作善降之百祥作不善降之百殃洪范享用五福威用六极意同易谦卦云天道亏盈而益谦地道变盈而流谦鬼神害盈而福谦论中参用书易之文故云尔也又坤卦云积善之家必有余庆积不善之家必有余殃意亦同此大抵皆谓天道昭然祸福不忒今见无道兴而有道丧则似书易之说无验何则且如忠良遇害则福善益谦之赏全乖奸邪得志则祸淫害盈之罚相反按其文而考其实全成龃龉故云何有良以不推业理但执天命故祸福有时而倒置也。</p><p>　　△三立教归罪不当难二初按定。</p><p>　　又既祸乱反逆皆由天命。</p><p>　　△后正难。</p><p>　　则圣人设教责人不责天罪物不罪命是不当也。</p><p>　　先按定谓世人见说古今治乱等事莫不皆谓天数今难之曰若由天者经书所说只合责天如何但责人耶如桀纣幽厉诗书所讥乱臣贼子春秋所贬曾何不云天命乎其由狼虎伤人麋鹿受殃故曰不当。</p><p>　　△三结责非理。</p><p>　　然则诗刺乱政书赞王道礼称安上乐号移风岂是奉上天之意顺造化之心乎。</p><p>　　若由天命则诗书礼乐惩恶劝善使人远祸就福以承天休者则成空言尔何则祸福由天不在人为天乃自然之理不容增损故也言诗刺乱政者刺讥讽也乱政如人伦废坏风俗浇漓之类然诗有国风雅颂其风雅中有善则美有恶则刺今举一端但言刺尔尚书有典谟训诰誓命之异皆明二帝三王治世化民之道故曰书赞王道赞者明也扬也孝经云安上治民莫善于礼移风易俗莫善于乐谓礼别尊卑使君臣父子各正其位而不敢僭越故曰安上乐音歌咏风俗美恶故能移薄俗以就淳风故曰移风皆所以规人心于善导格皇天之休庆也书曰惠迪吉从逆凶惟影响惠者顺也迪者进也言以顺而进则合于天道故为吉苟逆于天心则为凶故云奉上天(云云)而论云岂是者反破之词也世人不知感召之端实由乎我一向归之天命不但违佛教因缘之说亦失周孔诗书礼乐之本意故云岂是言造化者天之异名亦曰造物谓能造作变化万物也然前书易等语皆明作善得善作恶得恶此则因果之理明矣而但就一世为论未推宿习故影响之报或时相反况执天命转见乖张至下会通方能尽理。</p><p>　　△三结成未了。</p><p>　　是知专此教者未能原人。</p><p>　　华严原人论解卷上</p><p>　　卍续藏 第 58 册 No. 1032 华严原人论解</p><p>　　华严原人论解卷中</p><p>　　长安大开元寺讲经论沙门圆觉述</p><p>　　△第二释第二斥偏浅分三初标牒章门。</p><p>　　二斥偏浅(习佛不了义经者)。</p><p>　　偏浅之义如下文自释。</p><p>　　△二标列五教二初标。</p><p>　　佛教自浅之深略有五等。</p><p>　　△后列。</p><p>　　一人天教二小乘教三大乘法相教四大乘破相教(上四在此篇中)五一乘显性教(在第三篇中)。</p><p>　　此五种教圭峰约义分判由所被机有五乘之异故能被教有此五种言五乘者一人天乘二声闻乘三缘觉乘四菩萨乘五佛乘(此依华严二地及圆觉<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>章意从所求法以立乘名耳)今合声闻缘觉而开菩萨故立此五若依法相宗说五种种性者一声闻乘性二缘觉乘性三菩萨乘性四不定乘性五者无性就不定中复有四类一声闻菩萨性二缘觉菩萨性三声闻缘觉性四声闻缘觉菩萨性其无性者谓总无前三乘种性今人天教收彼无性小乘教收彼声闻缘觉二性后三教收彼菩萨性其不定性中间三教摄之若依贤首五教者一小乘教同此第二二大乘始教当此三四三终教四顿教五圆教当此第五良以贤首后三皆约一乘故圭峰合之贤首约同教别教历位无位开成三异而彼始教双收西域空相二宗以俱未尽大乘法理故合为初(初即始也)圭峰依西域仍为二或开或合各有攸当不可一准万松老师于此论中立九对十八重总该贤首圭峰二种五教之义一苦乐对(以三途对人天)二人天对(以人对天)三定散对(欲界为散上二为定)四色空对(以四禅对四空)五凡圣对(前四皆凡后三乘圣)六大小对(声闻缘觉小始教去皆大)七始终对(法相为始法性为终)八顿渐对(始终历位顿教不立)九偏圆对(贤首前四皆偏华严独为圆教)是则于贤首小教中曲开前五对收此论义可谓辞简而理尽矣。</p><p>　　△三正释自四初人天教二小乘教三大乘法相教四大乘破相教初中复四今初牒名。</p><p>　　一人天教者。</p><p>　　△二叙彼立义三初总明大意。</p><p>　　佛为初心人旦说三世业报善恶因果。</p><p>　　初心人者所被机也对后三乘故曰初心一向方便故云且说三世业报者谓过去造业今世受报今世造业来世受报故曰三世业即能招之因报即所招之果然业与报皆通善恶故曰善恶因果如下广明。</p><p>　　△二别叙二初叙恶因果。</p><p>　　谓造上品十恶死堕地狱中品饿鬼下品畜生。</p><p>　　言十恶者谓身三杀盗淫语四妄言两舌恶口绮语意三贪嗔邪见言上品者泛说善恶皆有三品三位明之一约境且如<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>杀人为上杀畜为中蚊蚋为下不杀反此谓不杀人为上不杀蚊蚋为下二约心不论善恶但猛利心作为上泛尔心作为下庸庸为中三约时若善若恶但三时无悔为上二时无悔为中一时为下言地狱等者梵云捺洛迦此云苦器即众生受苦之器也今言地狱约义立名有云地者底也狱者局也地下有狱故名地狱总有四类谓八热八寒近边孤独言八热者一曰等活谓刀剑剉斩成千万段以叉拨聚唱言活活彼即便活活已复斩斩已复活故曰等活以四王天寿五百年为一日一夜如是积数至五百岁二曰众合众山四合碎罪人身犹如微尘以忉利天寿一千年为一日一夜积此岁月寿一千岁三曰黑绳如世解木绳抨锯解以夜摩天二千年寿为一日一夜寿二千岁四曰号叫以兜率天寿四千年为一昼夜寿四千岁五大号叫以化乐天八千年寿为一昼夜寿八千岁六曰炎热以他化天一万六千年寿为一昼夜寿一万六千岁七曰极炎热寿半中劫谓从人寿八万四千岁等百年减一岁减至十岁名半中劫为此狱寿八曰阿鼻此云无间有五义故立无间名一者作业无间约治罚说二者受报无间约<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>说三者受苦无间约楚痛说四者<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>无间无中夭故五者身量无间谓众生自业各各自见身满狱中间无空处故曰无间此狱寿命一增减劫言八寒者正云遏部昙此翻为疱寒苦触身如疮疱故二曰疱裂身冻裂故(此二皆约苦相立名)三蝎螫沾四虎虎几五吓吓几(此三约受苦声立名)六青莲华七红莲华八大红莲华(寒苦触身变如是色)然此八寒寿量二说不同依俱舍说比前更长若准瑜伽说八寒寿量较于八热次第减半如按部陀减于等活之半乃至大红莲华较阿鼻亦尔依此则是八寒轻于八热也三近边狱者八热四门各有四狱一曰煻煨沸灰齐膝下足焦烂举足如故二曰尸粪粪泥齐膝中有毒虫下足食尽举足还复三曰锋刃刀剑等刃布为道路履则割伤四曰灰河沸热灰汁或煮或煎皮肉溃烂四孤独狱者处所不定或山间树下旷野城隍等处依瑜伽说近边孤独寿命不定随业长短言饿鬼者谓长受饥饿故曰饿鬼轻重不同凡有九类以人间二十日为一日一夜彼还以三十日为一月十二月为一年寿五百岁上依俱舍有云鬼趣寿命不定极长者七万岁言畜生者畜者养也人所畜养如牛马犬豕之类此名则局或云傍生傍行而生通一切飞走之类此名则宽别而言之羽毛鳞介蠢蠕飞潜其类繁广于中最福德者如龙及金翅皆通四生然畜趣寿命长短不定极长者寿一中劫广如别章(此依圭峰<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>章引)今言中品饿鬼下品畜生者圭峰依杂集等论故作此配若依华严二地则以畜生为中饿鬼为下清凉引<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>念处经会云然此三途各有边正正者为重边者为轻正鬼望边畜则鬼重畜轻正畜望边鬼则畜重鬼轻。</p><p>　　△后明善因果三初人乘。</p><p>　　故佛且类世五常之教(天竺世教仪式虽殊惩恶劝善无别亦不离仁义等五而有德行可修例如此国敛手而举土蕃散手而垂皆为礼也)令持五戒(不杀是仁不盗是义不邪淫是礼不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>是信不饮啖酒肉神气清洁益于智也)得免三途生人道中。</p><p>　　△次天乘。</p><p>　　修上品十善及施戒等生六欲天修四禅八定生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>天(题中不标天鬼地狱者界地不同见闻不及凡俗尚不知末况肯穷本故对俗教且标原人今叙<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>理宜具列)。</p><p>　　△后结门。</p><p>　　故名人天教也(然业有三种一恶二善三不动报有三时现报生报后报)。</p><p>　　五戒十善四禅八定等是善因人天等是善果于中分二初人乘言且类者即比类世谓世俗通西域此方不但周孔说五常也言五常者谓仁义礼智信是人之所常行造次颠沛不容离故(注中别会两方世教以显大同亦潜通妨难恐人疑云佛出天竺彼国世教仪式或殊那言类此五常即应是佛教仿效孔老作是附会故为此通云云又龙树释摩诃衍论引道品经此方所无立四法藏一补特伽罗藏经云<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>谛听为汝解说仁藏义藏礼藏智藏信藏并声闻藏及菩萨藏大觉法藏所以者何一切行者渐次转胜次第之法故○言天竺者[葸-十+夕]岭之西有五天竺谓成劫之时光音<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>下生于此故受天名梵云印土或云身毒讹略云竺言世教者谓国王治世之教也西域有佛法处依佛法治国如金光明有王法正论品又轮王以十善化世遵古佛遗教也言仪式虽殊者如正朔衣冠之类随方或殊言惩恶劝善无别者谓与此方大同言亦不离仁等者德行虽多举其大纲不出此五于斯可见天下之理至当归一圣人之心若合符节非周孔特为斯民而创式也亦非如来仿效此方而设教也例如已下举土蕃与中国礼异以况天竺与震旦亦然略举礼之一端以例仁义之四是知诸国礼乐互有不同当论其心勿责其事或者封于一隅互相诮讶岂通论哉)。</p><p>　　令持五戒者若翻前十恶此合云十善故华严二地中说十善通五乘谓下品人因中品天因上品三乘因上上品佛因而佛于<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>中又制近事五戒亦通五乘故知五戒十善大同小异开合随宜其犹大乘六度十度耳(注不杀是仁者下注家以五戒会五常以义同故明教大师云一曰不杀谓当爱生不可以己辄暴一物不止不食其肉也孟子云杀一无罪非仁也故以不杀为仁二不盗者谓不义不取不止攘他物也孟子云非其有而取之非义也三曰不淫谓不乱非其匹偶也而礼别尊??故同不淫四不妄语者谓不以言欺人而信者言无反覆故同不妄五不饮啖者由饮啖故心神浊乱情虑痴狂害于智也故不饮啖智思清洁也然于余说但云不饮圭峰加不啖肉当有所据或方劝人以为止杀之渐也释此五戒全依明教然此五戒依律仪中复有支持具阙之异五皆能持名为支具或但能持四三二等名为支阙尽形寿持名为持具或但能持十年五年下至一日名为持阙支时相望应有四句具阙之义由此有一分少分多分满分优婆塞夷梵云优婆塞此云近事男夷女声也于此五中不杀阙故虽得人身多病短命不盗阙故资财乏少不淫阙故无好眷属不妄阙故言无人受不饮阙故诸情暗钝又此五中前四是性戒谓杀盗等体性是罪故曰性戒饮酒一戒是名遮戒由饮酒乱性犯前四故故佛制此以防前四故曰遮戒)。</p><p>　　言得免三途者所离恶也生人道者所感果也然五戒十善皆依师受三归言下得此戒体或先受三归后受五戒<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>未有不归<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>而得戒者由归佛故不堕地狱归法故不堕饿鬼归僧故不堕傍生今言得免三途盖三归之力也以受五戒必先三归故略不言。</p><p>　　修上品十善者此有二意一者对前五戒为下故曰上品上品即十善也二者影略以明人中十善为下(前不言者含五戒中)故以天中为上品上品之十善拣下品故又于天中十善是总施等为别谓修十善与散心俱兼行施等生六欲天与定心俱生上二界言十善者杀盗淫妄与五戒同五不绮语谓不饰非言六不两舌谓语不背面七不恶口言必善顺八不贪爱谓心常知足于有有具不生染着九不瞋恚谓不以忿恨宿于心十不邪见谓心见正直无诳无谄此后六戒诸教标列或小异同皆不相违又有一经中合语四为三谓不诽谤不欺诳不妄语加不饮酒食肉为四华严于语四中妄言两舌恶口绮语为次此约重轻为先后也嵩公辅教编列意三为嫉恚痴(故前释贪别依唯识)璎珞梵网唯局大乘故此不会然其意三得为业道者清凉大疏依瑜伽释云贪若未决但名烦恼决即名业嗔痴亦然故意三中要具五缘方成业道言五缘者一事(泛言他物他所摄故)二体(所贪物体即金银财宝等)三差别于中有三一不求(始欲名求即他物想)二不愿(希得属己即是乐欲)三不贪(终起夺想为贪)于差别中前二方便后一究竟并前事体即是五缘于此五中若阙究竟但名烦恼善恶相反成业例然。</p><p>　　言及施戒者谓持十善时又广行惠施故感欲天衣食自然宫殿随身眷属围绕如是果报由<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>故天人寿长由持戒故然前云十善此又云戒者此或是近住戒或出家戒等如报恩经中说有一日一夜持近住戒或<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>戒<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>等故别言之而言等者即等取忍进定或余善法谓<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>三宝<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>父母修八<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>等但十善为正因余皆助因而是有漏心修故不免轮回非如菩萨通无漏者言生六欲天等者泛言天者俱舍云光洁<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>神用得名总为三界别为二十八天谓欲界六天色界一十八天无色界四天言欲界者谓饮食睡眠男女情爱故名欲界言六天者一曰四王天寿五百岁以人间五十年为一昼夜阴阳如人世二忉利天此云三十三寿一千岁以人间百年为一昼夜以相抱为阴阳三炎摩天此云时分以莲华开合为昼夜故曰时分寿二千岁以人间二百年为一昼夜以身相近为阴阳四兜率天此云知足于所受乐常知足故居处倍前寿四千岁以人间四百年为一昼夜以执手为阴阳五化乐天谓随心意乐自化乐具还自受用故寿八千岁以人间八百年为一昼夜以相熟视为阴阳六他化自在天谓他化乐具自得受用故寿一万六千岁以人间一千六百年为一昼夜以暂瞬目为阴阳自此已还名为欲界。</p><p>　　言修四禅八定者梵语禅那此云静虑法苑章云静者性离嚣尘沉浮等障虑者专心一志筹度境门然诸无色定有静无虑纯定心故欲界等持有虑无静多散动故唯色界中静虑均平故得此名言四禅者一有寻有伺静虑寻伺亦名觉观对治欲界恶不善法故然寻约粗相伺约细相二无寻无伺静虑离前初禅觉观之心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>故三离喜静虑离前二禅喜心忧喜双忘住于乐受故四离喜乐静虑离前三禅喜乐苦乐双忘故言八定者四禅之后加无色四空定谓一者空无边处定前色界中所有色想今皆超越住无边空处故二色无边处定前色与空皆不离识今皆超越唯住无边识故三无所有处定前有识可住今识亦不可得若心若境皆无所有故四非想非非想处定前能离心识之想今亦无故此与四禅俱名定者以四禅中有一分定义故得定名言生色无色界者由修四禅得生色界谓有五蕴色身故名色界言无色者谓无粗色蕴但有四蕴心及心所依定而住名无色界(注题中下通妨恐有难云此既具明五趣何故题中但标原人不言天等注先牒难界地不同下正答应云界趣不同或笔误耳三途人天类趣各别欲色无色依地有殊言见闻不及者天堂地狱鬼趣孔老不谈俗眼不见故云尔也凡俗已下约所对机言尚不知末者且以天为本人畜为末者世人但知人畜草木依天所生不知人畜从自业招妄谓天生是不知末况能知彼天等果为何物纵若说者不过但云清气上升高明悠久无声无臭以为至极更不信有佛教所说能尽天地之实者故曰况肯穷本岂复能知空生大觉如海一沤者乎故对下结意此二句出立题意今叙下出此文意○故名一句结门可知注中然业有下辨业报差别业以造作为义然体有假实身语是假思是实体然思有三种谓审虑决定动发正取动发方成业道谓动身思是身之实发语思是语之实审决二思但是方便意业有无如法苑章辨注一恶者便前三品十恶是二善者即前五戒十善等是三不动业者即前四禅八定对欲界散动得不动名言报亦有三时等者报以酬因为义现报者现在作善作恶现身受报如服狼虎药立时见效此约极猛利心作业故得现报如琉璃王诛灭释种生陷阿鼻法照和尚专念弥陀生归极乐更不历中有身也二生报者今生作业来生受报如今岁种麦来岁收刈三后报者今生作业隔生方受如负二人债强者先牵善轻恶重则先受恶报恶轻善重则先受善报则以后受者为后报也此约善恶间杂复由轻重分先后耳余经论说此三之外复有不定报对时料拣复有四句谓一时定报不定二报定时不定三时报俱定四时报俱不定等)。</p><p>　　△三总结。</p><p>　　据此教中业为身本。</p><p>　　业为身本者但知此身从业所招而更不推业从何来良由根钝未能穷究此如西方宿作论师所计彼见今世作善而现身受苦作恶受乐便作是思若由士夫现在所作即应颠倒当知由彼宿世业行是故今世作善能坏宿业宿业既尽即得涅槃等。</p><p>　　△三就彼诘难二初总诘造受。</p><p>　　今诘之曰既由造业受五道身未审谁人造业谁人受报。</p><p>　　彼应答云不过是我身心能造故。</p><p>　　△后蹑迹申难于中二初身心各别难于中又二初难身二初牒彼所立。</p><p>　　若是眼耳手足能造业者。</p><p>　　应再诘云汝言身心能造者且汝能造之身不过眼耳手足等而已若此(云云)者牒彼所立。</p><p>　　△后正设难。</p><p>　　初死之人眼耳手足宛然何不见闻造作。</p><p>　　宛然者谓分明之义此以现在例过去也由彼不了身等是假执为实能造故招此难。</p><p>　　△后难心二初总难二初按定。</p><p>　　若言心作。</p><p>　　△后正难。</p><p>　　何者是心。</p><p>　　因前难身彼辞理屈遂别执心故今诘云汝所言心何者是耶然佛教说心凡有四种一肉团心五藏中火也二缘虑心通八种识俱能缘虑自分境故三集起心唯赖耶识集诸种子起现行故四坚实心即如来藏性是也今人天机不知后三故招此难此与世俗言心大同。</p><p>　　△后别诘二初肉心二初正难。</p><p>　　若言肉心肉心有质系于身内如何速入眼耳辨外是非是非不知因何取舍。</p><p>　　言有质者以肉团心属色法故但是心等所依无实作用言如何速入眼耳等者然佛说第六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>有二义用一与五识俱行如眼缘色时意亦缘色分别皂白起殊胜解耳缘声等例亦如之二不与五俱名独头意如前五不缘境时内自思等今人天教不知缘外境者是意识作用执以为心故招此难。</p><p>　　△后结难。</p><p>　　且心与眼耳手足俱为质碍岂得内外相通运动应接同造业缘。</p><p>　　显肉团心无作用也如其有用肺等应然则诸已死应能缘虑。</p><p>　　△后破执情虑二初牒彼救词。</p><p>　　若言但是喜怒爱恶发动身口令造业者。</p><p>　　恐彼救云心能喜怒爱恶发动身口故能造业此乃认情为心不知喜怒等但是意<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>所法也。</p><p>　　△后以理诘责。</p><p>　　喜怒等情乍起乍灭自无其体将何为主而作业耶。</p><p>　　乍起乍灭者谓对顺情境则喜则爱对违情境则怒则恶境来则起境去则灭殊不知心体常恒本无起灭若境去心<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>即断灭谁为主宰而作业也。</p><p>　　△二身心相合难二初先难二初牒彼救词。</p><p>　　设言不应如此别别推寻都是我身心能造业者。</p><p>　　亦蹑前转破也由前身心别破彼遂立身心相合义应先救云不应如此别别推寻都是我身我心总合能造故此牒云设作此说者。</p><p>　　△后蹑迹正诘。</p><p>　　此身已死谁受苦乐之报。</p><p>　　纵言身心相合则身死心灭谁受报耶若许心不灭则无此难。</p><p>　　△后遮彼转救四初牒彼救词。</p><p>　　若言死后更有身者。</p><p>　　△二正申难。</p><p>　　岂有今日身心造罪修福令他后世身心受苦受乐。</p><p>　　恐彼救云前身虽死仍有后身前身造业后身受报复有何过岂有下难意谓若心不威自作自受属于一人于理则可汝今既报身心俱灭则后身心非前身心不应彼作而令此受其犹前官枉法后官被黜安有此理。</p><p>　　△三结成违理。</p><p>　　据此则修福者屈甚造罪者幸甚。</p><p>　　言修福屈甚者谓现身修福而由前身所造恶故令现受苦如现职官清廉有德而以前官枉滥之罪加之不亦冤乎造罪幸甚者今世行恶之人而以前世善故得享其福如现职赃滥而以前官清廉之功赏之不亦幸乎盖不应得而得故曰幸也甚谓过甚。</p><p>　　△四结责。</p><p>　　如何神理如此无道。</p><p>　　神理者即业理也业由心造故得名神业理至公必不如此枉滥但自彼宗不能深究率情而论故似枉也。</p><p>　　△四结显未了。</p><p>　　故知但习此教者虽信业缘不达身本。</p><p>　　既信业报则胜前儒老唯执自然气命等故致虽言但不知业由心造心法<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>自类相续故云不达身本也前后论意皆蹑迹相破如此人天宗于业报业报即是儒道所迷故但举业报足破之矣未达色心从缘等是此教所迷即以小乘复为能破。</p><p>　　△二释小乘教四初牒名。</p><p>　　二小乘教者。</p><p>　　乘以运载为义谓依因缘教悟生空理修自利行取灰断果运载众生出于三界故名曰乘不求大果阙于利他故名曰小小之乘故拣大得名此以大乘贬他立号故尔。</p><p>　　△二正明彼教宗三初总显因缘三初明缘生果。</p><p>　　说形骸之色思虑之心。</p><p>　　形骸之色拣外四大思虑之心即意识也此之色心即缘生果。</p><p>　　△二明生灭相二初法。</p><p>　　从无始来因缘力故念念生灭相续无穷。</p><p>　　△后喻。</p><p>　　如水涓涓如灯焰焰。</p><p>　　言无始者拣于外宗有初始故又但知今世而已因缘力者出生灭所以由内六识为所熏三毒为能熏起惑造业为能招因缘念念生灭者此之身心既是有为之法故有四相迁流前前念灭后后念生相续无穷者谓后后续于前前不断绝故如水下举此二喻以显生灭之相涓涓点滴流注不断而前前非后后如灯焦炷前焰非后焰虽前后不同不妨相续无始至今。</p><p>　　△三明身心相依以立。</p><p>　　身心假合似一似常。</p><p>　　身心假合者互相资持如束芦故谓身心为二而不相离故言似一前后生灭而恒相续故曰似常。</p><p>　　△二别明染净因果二初染五初因迷起执。</p><p>　　凡愚不觉执之为我。</p><p>　　凡愚不觉者无明覆故执之为我者即我执俱生。</p><p>　　△二因执起惑。</p><p>　　实此我故即起贪(贪名利以荣我)嗔(嗔违情境恐侵害我)痴(非理计校)等三毒。</p><p>　　实此我故者即我执分别宝者爱重义故即起已下因执起惑由我执故生烦恼障烦恼障品虽复有多三毒胜故贪者成唯识云于有有具染着为性于顺情境起爱着故嗔者于苦苦具憎恚为性注意可了圆觉又云由于欲境起诸违顺境背爱心而生憎嫉造种种业是故复生地狱饿鬼痴者于诸理事迷暗为性由痴覆故于逆顺境不能了达遂起贪嗔言三毒者从喻得名如毒蛇毒药触必伤人服必丧命此三亦尔能害众生法身慧命故名曰毒。</p><p>　　△三因惑作业。</p><p>　　三毒击意发动身口造一切业。</p><p>　　击者熏动义即以三毒为能熏意识为所熏如风击静水以成波浪言发动身口造一切业者即前十恶等。</p><p>　　△四因业感果二初总示二初二报差别。</p><p>　　业成难逃故受五道苦乐等身(别业所感)三界胜劣等处(共业所感)。</p><p>　　此报有二谓五道等身为正报三界九地为依报由造十恶受三途等苦由修戒善受人天乐故云受五道等(注云别业所感者人天造受不同故)三界胜劣者如以欲界望色界则色界为胜欲界为劣以四王望忉利则忉利为胜四王为劣(注云共业所感者多人同造同感故名曰共)。</p><p>　　△后三道不断。</p><p>　　于所受身还执为我还起贪等造业受报。</p><p>　　<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>疏序云惑业袭习<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>纶轮尘沙劫波莫之遏绝故经论呼人为数取趣谓数数起惑造业受报故中论染染者品云经说贪欲嗔恚愚痴是世间根本乃至云三毒因缘起于三业三业因缘起于三界是故有一切法证此可知。</p><p>　　△后别显果相二初明二报无穷。</p><p>　　身则生老病死死而复生界则成住坏空空而复成。</p><p>　　(△注明四劫状二初广叙成劫三初蹑前标举)。</p><p>　　(从空初成世界者)。</p><p>　　(△二正引俱舍四初总明器界成立始)。</p><p>　　(颂曰空界大风起傍广数无量厚十六洛叉金刚不能坏此名持界风光音金藏云布及三千界［再］如车轴下风遏不听流深十一洛义始作金刚界)。</p><p>　　(△二别明器界成立相二初正示)。</p><p>　　(次第金藏云布［再］满其内先成梵王界乃至夜摩天风鼓清水成须弥七金等滓浊为山地四洲及泥梨咸海外轮围)。</p><p>　　(△后结二初处)。</p><p>　　(方名器界立)。</p><p>　　(△后时)。</p><p>　　(时经一增减)。</p><p>　　(△三辨正报成义)。</p><p>　　(乃至二禅福尽下生人间初有地饼林藤后粳米不销大小便利男女形别分田立主求臣佐种种差别经十九增减)。</p><p>　　(△四总结时数)。</p><p>　　(兼前总二十增减名为成劫)。</p><p>　　(△三会外宗三初总会四初标举)。</p><p>　　(议曰空界劫中是道教指之云虚无之道)。</p><p>　　(△二辨异)。</p><p>　　(然道体寂照灵通不是虚无)。</p><p>　　(△三纵夺会释)。</p><p>　　(老氏或迷之或权设务绝人欲)。</p><p>　　(△四结)。</p><p>　　(故指空界为道)。</p><p>　　(△二别会三初合一气)。</p><p>　　(空界中大风即彼混沌一气故故彼云道生一也金藏云者气形之始即太极也［再］下不流阴气凝也阴阳相合方能生成矣)。</p><p>　　(△二记三才)。</p><p>　　(梵王界须弥者彼之天也滓浊者地即一生二矣二禅福尽下生即人也二生三三才备矣)。</p><p>　　(△三合万物二初正会)。</p><p>　　(地饼已下乃至种种即三生万物也)。</p><p>　　(△后结示)。</p><p>　　(此当三皇已前穴居野处未有火化等)。</p><p>　　(△三遣疑二初明错谬异说)。</p><p>　　(但以其时无文字记载故后人传闻不明展转错谬诸家著作种种异说)。</p><p>　　(△后重释二教不同所以)。</p><p>　　(佛教又缘通明三千世界不局大唐故内外教文不全同也)。</p><p>　　(△后略辨余三三初住)。</p><p>　　(住者住劫亦经二十增减)。</p><p>　　(△二坏)。</p><p>　　(坏者坏劫亦二十增减前十九增减坏有情后一增减坏器界能坏者是火水风三灾)。</p><p>　　(△三空)。</p><p>　　(空者空劫亦二十增减空中无世界及诸有情也)。</p><p>　　△后结无穷二初法。</p><p>　　劫劫生生轮回不绝无终无始。</p><p>　　△后喻。</p><p>　　如汲井轮。</p><p>　　(△注二初对世教辨优劣)。</p><p>　　(道教只知今此世界未成时一度空劫云虚无混沌一气等名为元始不知空界已前早经千千万万遍成住坏空终而复始)。</p><p>　　(△后结功超胜)。</p><p>　　(故知佛教法中小乘浅浅之教已超外典深深之说)。</p><p>　　五蕴初起曰生蕴熟衰变曰老四大增损为病五蕴灭坏为死上释前别业所感界则下释前共业所感界缘辨果曰成暂有所依曰住三灾变灭为坏荡然无物曰空生死相续成坏相仍循还无穷法尔如是(注中别明世界成住坏空之状于中先广叙成劫初句蹑前标举颂曰下正引俱舍颂也空界者前界坏劫之后第二十空劫也又此空界即空轮也梵语洛叉此云亿谓此风轮厚十六亿阿毗昙论云世界空二十劫后将成之时乃有毗岚风鼓之以为风轮最居其下厚九亿六万由旬广十二亿三千四百五十由旬虽数量小有不同大抵皆同风轮居下也风力大故金刚不坏此名一句结风名也此风有持界之用持界即风持业可知言光音金藏云至始作金刚界等者金藏即云之名云色如金注水无穷故曰金藏云升至光音天也遏止绝也若无风止水注无穷北山云大云升空降雨如轴积彼风轮之上结为水轮水轮最上坚凝为金如乳停膜是为金轮俱舍云水轮厚八洛叉又因本经云水聚厚六十万由旬水上别有大风吹转此水于上成金如熟乳上生膏是名金轮厚三洛叉二万由旬论中引颂十一洛叉者通取水轮八洛叉及金轮三洛叉故成十一也此意明金轮依水轮水轮依风轮风轮依空轮空轮最在下金轮最在上○次第金藏云下此明器界成立之相北山云三轮既成雨自空飞注金轮上彼注云雨满如车轴昼夜不息犹如河泻○先成梵王界至滑水成者谓风吹此水清者上升自上至下次第先成色界梵王天及欲界空居四天也须弥七金等一句在清浊之间忉利居须弥顶四王居须弥之半故但举须弥则二天可知矣七金者一逾健陀罗山此云持双二伊沙驮罗山此云持轴三朅地洛迦此云檐木四苏达黎舍那山此云善见五頞湿缚羯拏此云马耳六毗那怛迦山此云象鼻七尼民达罗山此云鱼名此七皆金所成故曰七金须弥居中七金绕之滓浊为山地者滓淀也谓稠泥之属结为土［后］诸山及平地也四洲即东胜身南赡部西牛货北俱卢此四居须弥四畔咸海之中盖汀渚之谓故曰四洲泥犁即地狱名也言咸海者即四洲所依之海其水味咸拣七金山间香海故外轮围者即铁围山在咸海外此等皆前滓浊所成○方名下二句总结上句结处下句结时此总明一大化佛所王一三千界同时成立○言一增减者谓从人寿八万四千岁时百年减一岁减至人十岁时名曰减劫复从十岁百年增一岁增至八万四千岁名曰增劫先减后增合云减增以顺文故但曰增减齐此时量名一增减谓器界成立经尔许时也乃至已下辨正报成义引俱舍等文言二禅等者谓光音天人受天福尽当堕人中此时下生身有光明飞行自在喜乐为食意生<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>是时大海乍增乍减开川原路水所减处有地肥出如细蜂蜜香色美味复生地皮亦名地饼地味尽已复生林藤人皆食之因贪食故遂失<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>光明亦灭世间黑暗菩萨慈悲现作日月星辰照耀起世经云宝意菩萨作日天子宝吉祥菩萨作月天子宝光菩萨作星宫天子林藤灭已后生粳稻朝割暮生由食米故遂有便利分男女形爱欲滋彰人又乃具竞割稻谷畜积自供强弱相凌无能制者集众相议立一智者为土田主众共给之主不能独治故求臣佐等言种种差别者即宫室城郭舟车服用之类经十九劫人理方全兼前下总结时数具如俱舍等论及慈恩劫章颂说议曰下会释外宗所以会者以佛教说从空劫次第有天地万物而儒老亦以从虚无太极等渐生天地人等二宗所说为同为异故须会释以决疑情今初正会议曰者论主评也空界劫中至虚无之道一句正标举亦牒外人疑辞也恐人疑云佛教空劫将非老氏所谓虚无之道乎以虚无之言同空义故亦先天地生似同其时今论意云粗说似同故云尔也然道体下明究实则异谓佛教说空劫对成住坏一向是空非真空妙有之空也道之为物至妙虚通不属空有若以空为道非真道也老氏下纵夺会释先夺以显异详老氏意未必定指空劫为虚无但彼先天地生及道生一等语似当其时恐后人不了便指空劫遂成执着故曰迷之然空劫约时虚无约道体岂得同耶或权设下纵成显同其实道非空有不妨在空同空在有同有今老氏约道在天地先故曰虚无又欲救人之弊以世人著有故老氏云大道虚无曷尝有哉故曰务绝人欲人欲者即著有之见如道经云五色令人目盲五味令人口爽等是也又初章云常无欲以观其妙常有欲以观其徼岂非务绝人欲之谓耶空界中大风即一气者此风即前持界风是风轮也混沌即阴阳未分老氏谓之冲气也故彼下引彼文证言道动出冲和之气故曰道生一也金藏云下会儒门五运之说雨下不流者即前云雨如车轴下风遏不听流论以此为阴气则以金藏云为阳气也即前一气至此转为阴阳虽为阴阳而尚未分散故曰相合犹属一也梵王界下别配三才寻前论文会释可了而论以天地为二三才为三者盖论主高悟与明皇义异可以意得不必守文地饼云云其义易了若会儒宗者梵王已下即太极生两仪地饼已下即四象生八卦等言三皇已前者然依世典说三皇有二顼公纪年缉事引古今说云混沌初分清气上升浊气下沉此时有盘古出治一万八千岁盘古死后形分为物象遂有山川草木日月云雷等自此有天皇氏地皇氏人皇氏此名前三皇各治万八千岁次有巢氏燧人氏此后方有伏牺神农黄帝为后三皇伏牺画八卦造书契神农作耒耜以播种百谷尝药草以愈众疾黄帝制宫室衣服舟车器用定婚嫁丧制之礼等而上古之时茹毛饮血穴居野处人畜无别自有巢氏出教民夏居橹巢冬居茔窟方变穴居野处之风燧人氏兴钻燧出火民始熟食故曰三皇已前至火化等但以其时下遣疑恐有疑云孔老所说与佛教既同何故此方不说四轮及光音天人下生而说盘古等耶故论释云此方上古之时既无文字可考所以不得其详今但据老氏道生一等语及太极五运之说有与佛教略相似理故为会之佛教下重释二教不同所以纵此方有说才肇兴之事不过但知四海九州之内而已而前俱舍等经论所说乃通叙化佛所王之境言三千者俱舍颂云四大洲日月须弥卢欲天梵释各一千说名小千界此小千千倍说名一中千此千倍大千皆同一成坏言不局大唐者论主且约当时云尔即目震旦国也如仁王等经论说此阎浮提有十六大国二千中国十万小国而震旦不在十六之数故知前会儒老且欲接此方之机耳其实内外不得全同然庄子云无极之外复有无极又云六合外圣人存而不论盖以时机未达故孔老存而不言而大雄之化普被三千遍该五性其教网恢张不得不尔然此三千尚约小教方之<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>不啻毫末之于大空尔○住者下略辨余三住劫可知坏劫中言前十九增减坏有情者谓于一减劫末人寿三十岁时饥馑劫起七年七月七日由浸风吹起其方所令时节失度五谷不成故致饥馑人寿二十岁时疾疫劫起由恶鬼神损害于人七月七日而止人寿十岁时刀兵劫起草木皆化刀杖互相杀害唯以刀杖而自<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>七日七夜而止当时世界应无有情此据小教所说云尔言后一增减坏器界者初火灾起坏及初禅由七日轮起于空时大地须弥皆发火焰俱时洞然以其热故吸下水轮水如酥油一切皆尽七度火灾之后有水灾起坏及二禅七度水灾之后有风灾起坏及三禅故论结云能坏者是火水风等三灾空劫可知问彼时既空谁复知其劫数耶答以他界住劫较之可知言劫劫下结无穷上三句法说下一句喻明注中形对世教以辨优劣文相易了故知下结功超胜言浅浅之教者后四教相望前前浅后后深此乃浅中之浅尔若对人天则亦次深然不对彼以人天教未出三界故)。</p><p>　　△五结示二初明轮回所以。</p><p>　　都由不了此身本不是我。</p><p>　　△后释<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>二初标牒。</p><p>　　不是我者。</p><p>　　△后正释。</p><p>　　谓此身本因色心和合为相。</p><p>　　应先问云何故生死轮回不绝答云都由不了云云所以起惑造业生死轮回问何故不是我论牒云不是我者谓此下释圆觉云众生无始妄认四大为自身相六尘缘影为自心相众生不了妄计为我离色心外谁是我者。</p><p>　　△后净二二初假相析法三初粗析三初标。</p><p>　　今推寻分析。</p><p>　　△二释。</p><p>　　色有地水火风之四心有受(能领纳好恶之事)想(能取像者)行(能造作者念念迁流)识之四。</p><p>　　承前起由前云不是我者本因色心和合成故外人问云色心和合即是我身那言不是答妄情执着则似有之观智分析则知本无良以愚法声闻不了即色明空要须假想慧数析法方知是空故云推寻分析也色有等者色以质碍为相然色通形显长短方圆等谓之形色青黄赤白等谓之显色地水火风名为四大此之四法周遍一切有为法中故名曰大<a href=\"/fojing/yuanjuejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">圆觉经</a>云我今此身四大和合所谓发毛爪齿皮肉筋骨髓脑垢色皆归于地淫涕脓血津液涎沫痰泪精气大小便利皆归于水暖气归火动转归风四分分之色在何处心有等者前色蕴名色此四蕴名心蕴者积聚为义积聚多法成一蕴故受以领纳为相别有三受谓苦乐舍想以想像为相攀缘前境追忆往事等行以迁流为相然有与心相应不相应异且相应者小乘心所四十六法中除受想二法余皆是也不相应者有十四种百法论详明识以了别为义小乘唯一意识。</p><p>　　△三通略总结。</p><p>　　若皆是我则成八我。</p><p>　　△二细析二初析色二初标。</p><p>　　况地大中复有众多。</p><p>　　△后释二初约体显。</p><p>　　谓三百六十段骨一一各别。</p><p>　　△后约相显。</p><p>　　皮毛筋肉肝心脾肾各不相是。</p><p>　　论中举三百六十段骨等犹是粗说若从粗至细析者谓四支五根渐渐分析一分析作四分四分析作十六分析至极微名邻虚尘与空无别方名曰空皮毛下论约相显易知内外各举其四各不相是一句总前多法既不相是谁为我者又前水火风大此应例准析之水大易知火风二大虽各是同依根说异如呼吸奔走欠伸之类亦各用别然泛明色蕴有十一法谓五根五境及无表色今但说身故不言境等应例析之。</p><p>　　△后析心二初标。</p><p>　　诸心所等亦各不同。</p><p>　　△后释。</p><p>　　见不是闻喜不是怒展转乃至八万尘劳。</p><p>　　心王所有差别业用故曰心所然小乘心所都有四十六法总成六位有五十一种行相广长具如别释但今论意欲显此中无实我故若欲细辨恐致亡羊言见闻喜怒者见闻易知喜怒即儒宗所谓七情亦不离前心所法等论中别举令俗易知言八万尘劳者即八万四千烦恼略举大数云尔谓依根本十惑一贪二瞋三慢四无明五疑六不<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>七身见八边见九见取十戒禁取然一惑有力复各成十十惑成百计分三品上品重故分上中下即成三百中下不分但各成百总为五百于自五尘总起五百于他五尘总起五百名本一千又于自他五尘一一别起五百即成五千依别迷四谛苦集灭道各有五千故成二万并本一千为二万一千依贪瞋痴及等分行各二万一千故成八万四千取坌污义故扰动义故名曰尘劳广如别释。</p><p>　　△三显无我三初总明。</p><p>　　既有此众多之物不知定取何者为我。</p><p>　　即假设问也。</p><p>　　△二别示二初约即蕴。</p><p>　　若皆是我我即百千一身之主多主纷乱。</p><p>　　出过即有多我之过。</p><p>　　△后约离蕴。</p><p>　　离此之外复无别法。</p><p>　　△三总结。</p><p>　　翻覆推我皆不可得。</p><p>　　即离相待故曰反覆。</p><p>　　△二实智断证二初承前起由。</p><p>　　便悟此身但是众缘似和合相元无我人。</p><p>　　前假观析法以为方便观行成熟实智发生然小乘修行不出四谛谓知苦断集证灭<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>于中苦是世间果先举令知言但是众缘假和合者即前四大五蕴等多法聚集于中无有实主宰者名无我人。</p><p>　　△后正明断证二初四谛。</p><p>　　为谁贪瞋为谁杀盗施戒(知苦谛也)遂不滞心于三界有漏善恶(断集谛也)但修无我观智(道谛)以断贪等止息诸业<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>我空真如(灭谛)。</p><p>　　△后四果。</p><p>　　乃至得阿罗汉果灰身灭智方断诸苦。</p><p>　　为谁贪瞋等者为者与也反前实此我故起贪瞋痴今既知我本空何用贪瞋杀盗施戒如设筵宴以待宾亲严器械以御寇盗无宾则杯盘安设无盗则器械何施(注云知苦谛者苦以逼迫为义谛以审实彰名佛说苦定是苦故名曰实如实知苦即是审义苦谛之体即五蕴身心谓此身心是众苦所依故言众苦者即三苦四苦五苦八苦等言三苦者谓苦爱苦苦乐受坏苦舍受行苦言四苦者谓生老病死五苦者前四苦上加<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>盛苦言八苦者前五之上加爱别离怨憎会求不得三为八苦也)遂不滞心三界等者从喻得名如世漏室不堪居止漏器不堪举用然漏有四种谓欲漏有漏无明漏见漏言有漏善恶者谓依造之思同时王所与漏相应所修善等皆有漏摄拣无漏善非集谛也恶业可知(注云断集谛者集以增长生死为事集谛之体通业惑等)言但修无我观者即人无我其实有无常苦空不净等观及八正道等今但以无我为门摄无常等反前执我故偏说之(注云道谛者道以除患为功正取生空智为体即前无我等观兼摄余行为助伴也)言以断贪等者方蹑前起即以前道谛智为能断贪等为所断三界九地分别俱生烦恼障品皆在等言之中言止息诸业者因惑起业惑既不生业自停寝此断贪等犹属道谛相蹑而起证我空真如者智有二用一能断惑二能证理我空真如者即五蕴等中无实主宰性一分生空理也即小乘三种无为一择灭无为二非择灭无为三<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无为(注中言灭谛者灭以累尽为名即惑苦皆亡大患永灭)言乃至得阿罗汉果者乃至中间含诸位故然小乘断证位次不出道前七贤道后四果言七贤者一五停心观(谓初作五种观想止息妄心也)一多贪众生作不净观(有五不净一种子不净二住处不净三自体不净四自相不净五究竟不净也)二多瞋众生作慈<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>三多痴众生作缘生观四散乱众生作<a href=\"/remen/shuxiguan.html\" class=\"keylink\" target=\"_blank\">数息观</a>二别相念观(别别观察身受心法)谓观身不净(五种不净如前所说)观受是苦(苦受苦苦等亦如前所说)观心无常(念念生灭)观法无我(五蕴假合)四法次第各别观察故曰别相三总相念观(谓随身等即具苦空无常无我四观一时故名总相念也)此上三位名三资粮四暖位(如世钻火暖相初生火之前相圣道将起行相亦然故尔)谓创观欲界四谛各有四相共十六相苦下四者谓苦无常空无我集下四者集因生缘灭下四者灭净妙离道下四者道如行出上二界四谛合观亦有十六共三十二此位之中初起智观五顶位(可动法中此最为胜如人首顶最极尊故)亦观于前三十二行心渐成熟故六忍位(忍可谛理故名曰忍)此忍分三下忍位者印可于前三十二行中忍别作七周减缘二十四周减行如以无常观欲界苦乃至以行观上界道上忍唯一刹那重观欲苦七世第一位(有漏道中最第一故)亦一刹那重观欲苦一行但智胜劣与上忍异(此上明道前七贤也)言道后四果者于中有四向四果谓之八辈初预流向修十六心谓上下八谛各有一忍一智如缘欲界四谛起苦法智忍苦法智集灭道三例然上界四谛名苦类智忍(谓于欲界苦同类故)苦类智等于中八忍名无间道八智名<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道前十五心八无间七解脱名预流向第十六心第八解脱名预流果此位有二行相一正住果未断修惑皆属见道二进修果即属修道断欲界修惑六品六无间五解脱名一来向第六解脱名一来果(但有一度［来欲界故］)断后三品三无间二解脱名不还向第三解脱名不还果(更不来复欲界生故)断上二界七十二品(上二界有八地每地九品故有七十二品也)修惑七十二无间七十一解脱名阿罗汉向(自此已前皆属修道)第七十二解脱名阿罗汉果证五分法身名无学位梵语阿罗汉或阿罗诃此云应应有三义一应已永害烦恼贼故二应不受后有身故三应受人天妙供养故言灰身灭智者肇公公大患莫若于有身故灭身以归无劳形莫先于有智故绝智以沦虚智以形患形以智劳轮转修途疲而不已所以小乘得四果已化火焚身身智俱灭入无为界受寂灭乐依三乘教此处应列辟支佛位论不明者与前声闻同观生空理同断烦恼障证灰断果故不别说。</p><p>　　△三结成所本。</p><p>　　据此宗中以色心二法及贪瞋痴为根身器界之本也过去未来更无别法为本。</p><p>　　大钞云然小乘计生死根本虽有多义略举其三一计色心如正理论第八说经部师计现在色心等法为染净因意云如大乘第八为所熏故二者三毒为因义如大乘能熏故阿含云贪恚愚痴是世间根本等三者合取上二义同大乘有能所熏方流转故若尔焉异大乘然似参经意而不同者但六识为所熏非第八故纵说赖耶但有名字能熏又非七识故全不同过去去未来等者此以现在例余二世同以色心三毒为本不求别法。</p><p>　　△三就彼诘难三初标。</p><p>　　今诘之曰。</p><p>　　△二释二初立理。</p><p>　　夫经生累世为身本者自体须无间断。</p><p>　　此以大乘义破之言自体须无间断者如大乘说第八识故论云恒转如瀑流又摄论云无始时来界一切法等依既言无始时来则知无间断矣。</p><p>　　△后正破。</p><p>　　今五识阙缘不起(根境等为缘)意识有时不行(闷绝睡眠灭尽定无想定无想天)无色界天无此四大。</p><p>　　言阙缘不起者谓大乘说眼识九缘生耳识八缘生鼻舌身三七缘生(注中根即增上缘境即所缘缘略举此二等余缘故随阙一缘即不得起)言意识者即独头意识(注中举五位不行闷绝睡眠二位约下地说无想二定约上地说谓无想定中心想不生此通外道所求之定灭尽定者前六七识一向不生故名灭尽此定唯圣人得二定次第应先无想言无想天者即无想异熟谓此天中是<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>心心所等所不行处此之五位皆意识不行也)无色界无四大者谓此四天都无粗色但有四蕴心心所故得无色名前五识等即是无心此即无色彼计色心为本今既皆无本义何在。</p><p>　　△三结难。</p><p>　　如何持得此身世世不绝。</p><p>　　如大乘中许有第八持种之义则无此难。</p><p>　　△四结显未了。</p><p>　　是知专此教者亦未原身。</p><p>　　华严原人论解卷中</p><p>　　卍续藏 第 58 册 No. 1032 华严原人论解</p><p>　　华严原人论解卷下</p><p>　　长安大开元寺讲经论沙门圆觉述</p><p>　　△第三释大乘法相教二初牒名。</p><p>　　三大乘法相教者。</p><p>　　以具修二利具证二空运载至于菩提涅槃究竟<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>拣异前小故曰大乘广说诸法名数之相名法相教。</p><p>　　△二叙彼所宗二初总标举。</p><p>　　说一切有情</p></div>"
}]