[{
    "title": "第1633部 紫柏尊者全集",
    "author": "德清 译",
    "html": "<div class=\"B1_text\"><p>　　匡山逸叟憨山释　德清　着</p><p>　　太虚寥廓。长风鼓而万窍怒号。殊音众响。皆一气之所宣又奚可。以大小精粗。谓灵根之有闲哉。惟吾 佛以不思议智。流出一切音声陀罗尼。故世谛语言。皆悉显示第一义谛。若夫尘说。刹说。炽然说。即水流风动。皆演圆音。况宇泰定而照群情。触境而发。无思而应若谷响者乎。是以从上诸祖。证无师自然智者。即扬眉瞬目。怒骂讥诃。莫不直示西来大意。又岂可以识情语言。而拟议其形容哉。故达磨西来不立文字。而曹溪则有坛经。及二派五宗。虽直指向上。然皆曲为今时。或上堂入室。示众举扬。机如雷电。凡垂一语。必辑为录。大概聊尔门头。若大慧中峰。至我明楚石皆其类也。盖借语传心。因言见道。言其所绝言耳。今去楚石二百余年。有达观禅师出。当<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>已坠之时。蹶起而力振之。得无师智。秉金刚心。其荷负法门之志。如孛陵之血战。纵张 空拳。犹挥驻日。虽未犁庭扫穴。而一念孤忠。与啮雪吞毡者。未可以死生优劣议也。真末法一大雄猛丈夫哉。然师赋性不与世情和合。至老见客未效一额手。虽未踞华座。竖槌拂。然足迹所至半天下。无论宰官<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>。望影归心。见形折节者。不可亿计。以<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>宗通。故随机之谈。如千钧弩发。应弦而倒。无非指示西来的意。称性冲口。曾无刻意为文也。一唾便休。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>辈笔而藏之者什一。师初往来于金沙曲阿之闲。与于王贺氏诸君子大有夙缘。所闻最多。如庵居士于公执侍甚谨。得片言如宝只字不遗。凡随师杖屦者。必搜而得之。师每至匡庐。必主于江州孝廉邢君来慈长松馆。多有所说。师化后。并属弟子仲櫜。润甫。结集成帙。予久沈瘴海。适为师了末后<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。之双径。先过金沙之东禅。二公以予与师为法门深契。故出其稿。稽首请校而梓之。予三读其言。喟然而叹曰。嗟乎。末法降心。力拔 <a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之根。如一人与万人敌者。予独见师其人也。睹其发强刚毅勇猛之气。往往独露于毫端。如巨灵挥斤。真所谓与<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a> 魔。欲魔。死魔共战。竟能超越死生。如脱敝屣。可谓战胜有功者也。故其所吐。岂可以文字语言音声色相求之者耶。佛说欲为生死根。师凡所举必三致意。痛处札锥。直欲剿绝命根。即此可当金鎞矣。又何庸夫门庭施设哉。昔觉范禅师。妙悟超绝。语工典则。其所著述。自自之曰文字禅。故予题之曰。紫柏老人集。盖非堕于俗数也。观者当具金刚正眼。视之于言外。则思过半矣。　时天启元年岁在辛酉春王上元日书于匡山五乳峰下木石庵中</p><p>　　No. 1452-B 紫柏大师集序</p><p>　　庄生曰。卜梁倚。有<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之才。无其道。吾有圣人之道。无其才。夫圣人矣。又何才与道之别。曰苟非其人。道不虚行。才者人也。予尝披历代祖图于少室。其人无不魁杰有奇表。心窃异之。既而遇紫柏大师。见其旋尺之面。合围之腰。坐若熊蹲。行如象步。士大夫得晋接者。不言而意已消。学徒瞻依者。未施棒喝而魂虑已慑。与向所见图中诸宿。若或睹之。盖真其人哉。</p><p>　　神庙戊子己丑闲。大师驻锡吾地。与先正陆庄简公。先师冯具区先生。深谈不二。因筑精舍。舍于棱严废址。时灌莽极目。而大师<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>如云如雨。东南净信。闻风趋向。施物填委。无何杞梓丹青。峨峨晖焕。不啻还旧观而已。大师偕高足开公。创列规条。期为百世之守。江以南。海以北。诸刹不啻累百。而称清规楚楚。遵蹈不逾尺寸者。必首棱严也。大师涉涛江。礼育王。跻雪栈。瞻峨嵋。蹑冰壑。朝五顶。足迹遍天下。而后之京辇。以弘法故。示灭圜扉。所被显晦大小钝敏。诸机益广。而语言亦益散落。其所说法。触着信口所录以示人。拈着信手绝组。纴蹊线之迹。而波澜横溢。起没<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。吞天沃日之势。日澎湃于方幅之楮也。近代未见其俦。求之于古。妙喜幻住。庶或近之。金沙于润甫大夫。赤心自行。混俗而扶大教。宛古净名庞蕴之流。其于大师参领最深。契谊最笃。遇所摅撝。辄录藏之。迨乎归寂。闻有手笔落人家者。不远千里。必力致之。二十年余。裒然成大帙矣。近则谨书精刻。以宠同学。既而又幡然曰。大师生平所栖托注念。无如棱严。所发弘愿。无如方册法藏为第一事。剞劂之役。近在双径。去棱严不五六舍。是录宜归棱严。俾模印以行。稍取其直。以资刻藏。于大师寂光土中必所欣也。且弘法维人。棱严主者。白法师为大师克家之子。兴废举坠。靡不殚力。是录宜并入荷法担中。乃以今上崇祯辛未嘉平月。舁板于堂。白法师受之。驰告于予。予曰。大夫之意良矣。尝试与子爇一片檀。诣大师影堂相对。翻阅告语之意。必有浮于纸墨之上者。言诚可味。人诚可追也。是以吾贵其合。且也大师之言行。则于法得其纲骨。大师之愿满。令佛 菩萨之言尽行。则于法彻其源底。不可谓非佛日崦嵫时。弩力鲁阳之戈也。师与吾辈其必勉之。无负大夫无负大夫。　　　　就李竹懒居士李日华沐手撰书</p><p>　　No. 1452-C</p><p>　　大师应机说法。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>拈举。不假安排。俱从第一念中流出。惟期与人共明此事。原无意于文字语言。凡所开示人者。即令其人代书。书毕随手携去。大师未尝再一寓目。故其中意旨。或多重复。即累字叠句。亦复不少。惜当时未有专掌书记者。微言妙义。散于四方多矣。兹集仅得之吴江周子介。九江邢来慈。同邑王仲弢。三人所录。大同小异。不肖与二三友人。虚心参订。疑者姑阙。方敢授梓。其他散佚。不能一一访致。凡我同学。思报法乳之恩。普慈航之济。有藏片言半偈。不惮远颁。并收集中。以续传灯。实法门之一快云。时天启丁卯秋弟子三炬盥手谨识。</p><p>　　No. 1452-D 紫柏大师集跋</p><p>　　自法席久尘。祖灯无焰。求其担荷大法。振扬宗风。摧情魔于百战。枯识海于千流者。有明自楚石以后。惟有紫柏大师一人而已。大师洞彻自心。皎皎孤映。语言文字。从心光中自然溢出。一经拈指。本妙见前。至其慈悲热肠。淋漓痛切。无非欲学人积劫无明。当下冰销。究此一大事因缘耳。噫。初祖不立文字直指人心。大师不离文字亦指人心。其揆一也。烺尝见侍者握管旁立。大师冲口而出。侍者奋腕疾书。犹苦不给。一纸既盈。复易一纸。如泉喷地。琅琅不停。自非<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>圆明。了无凝滞。曷至此乎。噫。有文字。有未始有。文字学者。繇文字悟。未始有文字。则妙膳上味。人人充满。如但作文字会也。何异指馔说饱。岂疗枵虚。虽然凡心未鐍。圣解难窥。即请于大师日用着眼。集中拈出毗舍浮佛一颂。谓包括大藏。透彻禅源。持此凡十五寒暑。而精虔不休。自云每触逆顺爱憎之境。必以此颂为前茅。覆军杀将亦不知其几矣。噫。了彻如师。而犹坚锐猛决若此。此所以孤风绝侣。佛意祖髓。在在逢源也。即晚寄圜中。洒然夷适。死生利害。如撼空虚。照用之妙。前齐古德矣。夫人人本有心光。不知照用。以致坠失。而大师慈怜迫切。代为指授。片语单词。皆拭垢还光之助。于此逗得消息。方是紫柏儿孙。至利根男子。略沾涓滴。立见风涌云蒸。腾骧变化。超然默契。迥绝意言。即一部语录。无只字可得矣。亦庵先生。数载讨论。独任流布。使紫柏心光。如日华月彩。注射千古。先生之光。岂不交映互摄融成一片乎。</p><p>　　弟子贺烺熏沐拜书</p><p>　　紫柏老人集目录</p><p>　　·卷之首　　·像赞</p><p>　　·塔铭</p><p>　　·附圜中语录</p><p>　　·卷一之十　　·法语</p><p>　　·卷之十一　　·释<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a></p><p>　　·释<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a></p><p>　　·释棱严经</p><p>　　·卷之十二　　·释毗舍浮佛偈</p><p>　　·释八大人觉经</p><p>　　·释 <a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a></p><p>　　·<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>规矩</p><p>　　·卷之十三　　·缘起</p><p>　　·疏</p><p>　　·卷之十四　　·序</p><p>　　·记</p><p>　　·文</p><p>　　·卷之十五　　·题</p><p>　　·跋</p><p>　　·卷之十六　　·拈古</p><p>　　·卷之十七　　·赞</p><p>　　·卷之十八　　·颂古</p><p>　　·卷十九之二十　　·偈</p><p>　　·卷之二十一　　·杂说</p><p>　　·字说</p><p>　　·卷之二十二　　·杂记</p><p>　　·解易</p><p>　　·铭</p><p>　　·传</p><p>　　·卷二十三之二十四　　·书</p><p>　　·卷二十五之二十八　　·诗</p><p>　　·卷二十九(藏本三十卷即此本首卷圜中语也)　　·歌</p><p>　　No. 1452-E</p><p>　　大师自题</p><p>　　这个阿师　　心直口快　　走遍天下　　圜中自在</p><p>　　万历壬寅夏日。题于赫山会延庆寺之慈标。明年癸卯冬。果圆寂圜中。前知其明验云。</p><p>　　弟子三炬盥手拜书</p><p>　　紫柏大师像赞</p><p>　　法界网裂。其维不张。适生大师。力振其纲。踞狮子窟。斫栴檀树。奋迅未伸。爪牙已露。击涂毒鼓。酾<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>浆。饮之者醉。耳之者狂。寂灭性空。轰霹雳舌。奔雷卷电。触者褫魄。以大地心。竖金刚骨。眼里有筋。胸中无物。临济不死。黄蘖犹生。谁知大师。不受其名。大方阔步。不存轨则。翻身掷过须弥峰。一拳槌碎无生国。</p><p>　　憨山德清赞</p><p>　　山阴钱伯子。持　达观大师小影。索予为赞。时予正病剧。抽思未能。信口作<a href=\"/remen/chanyu.html\" class=\"keylink\" target=\"_blank\">禅语</a>贻之。</p><p>　　呵呵呵。这就是达观。昔日须鬓犹存。今日眉毛不换。相对依然。慈容悲愿。人传此老。示寂圜中。却在这上头。舒来卷去。一从方便。欲识师真。于此窥他颜面。虽然也只得一半。若欲全彰。连这焚却。方得相见。何以故。　大明国内。着不得这汉。</p><p>　　予晤师在癸巳岁。金陵贺氏园中。为驾部郎时。乃予请见。固有年矣。忆先于比部瞿洞观。太常傅太恒二君。共介其徒以往。到而复却。凡几度策马空归。二君遂不复言求见。而予意未已。至是晤焉。师须鬓不剪。顶着樵巾。体干丰伟。坐立如山。晦翁所谓其人皆魁岸雄杰者是已。相见慈容满面。权然如故。室中有数辈儒衣冠者。握笔沉思。肃如试举。予坐定。侍者设席予前。具笔伸纸。予问故。曰请与诸子。同作棱严经中某四句讲义。或偈亦可。予唯然受之不为异。随与大师论他义。一二转未竟。师辄呼侍者曰。周老先生面前纸笔彻过。又论一二转。师曰。硬挣也硬挣。顷之。侍者持客刺来报。乃鸿胪觉斋徐公。一徒起曰。老师今日体倦。徐公见。可俟他时。某请回之。便欲趋出。师曰不可。到即请见。徐公向日与予求见师。知不可得。每侦予所至。则尾之。故今刺得入。以予有人在门。刺得至师前。以予有人在室。其徒请命。以予在座。不然。恐师皆无由知矣。是日与徐公共午斋而散。明日天始辨色。街鲜人行。乃余衙有叩门者。询之为师二徒。余出迓。言大师且来谒。少选手持拄杖。阔步长趋。数徒拥掖而至。盘桓至暮始别。时从行有周叔宗。贺知忍。余名氏已忘。从<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>曰。大师从未谒人。以是施君。异数也。余窃叹是时胸中尚未尽稳。商量不得彻底。嗣后欲载证<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。可恨人言师奇怪。余具睹如此。奇耶易耶。凡初见作难意。皆诸徒所为。予以目击徐公一节可推。虽然。即师何病。世界不宽。时人眼孔不大。竟莫容此老。或以其入都门为病。而悲愿深远。殆不可测。余为钱子题赞词。更为叙相见始末。且更嘘唏及此云。</p><p>　　丙午腊八日剡城周汝登伏块敬书</p><p>　　开脱空口。东语西话。以慈悲法。盲拳瞎骂。冷面热肠。莲花一社。冷债热还。竹篦廿下。鸟去遗音。香飞落灺。真个达师。 僧繇难画。</p><p>　　余久向紫柏师。辛丑入都。而师住西山。忻然欲以瓣香见之。会同学数友。皆短师。心疑而止。后读其遗言。审其生平真证密行。深慈高节。一时<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>踞师席者。诚罕其比。然犹惜师不早去。终以及祸。非明明喆之道。及见吴咸熙氏所寄示遗像。味其自赞语。类谶者。岂师固夙知若二祖。师子尊者耶。常不轻菩萨见人<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。称汝等皆当作佛。人乃相趁打掷呵詈之。袁景倩言。一国中有狂泉。人饮皆狂。独国王汲井以免。而通国狂者。覆以王为狂也。相与捽缚烧灼。不胜苦。趍饮其泉。狂作。国人喜。谓王病已也。始舍之。紫柏视众人为佛。不得不度。众人视紫柏为狂。不得不死。于乎。何足恨哉。</p><p>　　丁未正月上浣日会稽陶望龄敬题</p><p>　　飞扬须眉头颅秃。竖眼控拳坦胸腹。颠翻神妙智具足。天龙人鬼俱降伏。声摇山岳纳空谷。拔剑虎丘埋天目。八面威风画一轴。六六原来三十六。</p><p>　　寓生黄汝亨赞</p><p>　　高挂两眸。颓然双颊。河汉为口。风雷为舌。汲汲波波济度人。大扣小扣俱不竭。忒慈悲。忒豪杰。贤愚终古无休歇。那辨侯王与宰官。少不省时加棒喝。恁般热肠难打叠。这打叠。不可说。休问纸上人。试看径山碣。</p><p>　　长水弟子李培敬题</p><p>　　存日门庭峻厉。没时棒喝交加。一念常观自在。天堂<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>无差。人说因缘<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。我说本分作家。只有逆来顺受。从他幻影空花。</p><p>　　长水姚士慎敬题</p><p>　　昔先庄简。法门金汤。博求龙象。为法津梁。既遇吾师。曰真法王。<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>参请。笃老皇皇。忠得夤缘。巾瓶侍旁。昏衢智灯。<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>慈航。世闲父执。出世导师。近之则畏。远之又思。创见则诧。即之转慈。揭示道要。能觉我迷。我于弹指。悟昔之非。舍海认沤。乃今始知。因师知佛。因佛知儒。灵明廓彻。乃有阶梯。师曰咄咄。阶梯非是。脚下承当。举足便至。每惟深慈。感激涕泗。法乳难酬。有死无贰。岂期缘深。躬承师逝。嗟乎哲人。不可思议。戒慧之光。遇缘益炽。游于福堂。作大法施。历诸苦恼。意地寂然。既展王法。曰了夙缘。合掌跏趺。只履翩翩。六日牢户。露地风尘。屹峙如山。光溢于颧。西原夏瘗。淫涝成川。倾城漂舍。激荡靡坚。意此土封。雨啮风穿。南迁启龛。载觌师颜。相好<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。俨若生前。闻古贤圣。去来如意。定慧力故。结成<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。入火入水。色身不坏。不图愚蒙。睹此奇异。允若师言。验瞑目地。非肉身佛。岂能若是。</p><p>　　陆基忠敬赞</p><p>　　紫柏尊者达观可大师像赞</p><p>　　有大医王。治痴暗病。入泥入水。拍拍成令。唤醒梦宅。接续慧命。为法忘身。高提祖印。</p><p>　　香光居士董其昌赞</p><p>　　不妄视。眼不坏。不妄听。耳不坏。不妄言。舌不坏。不妄动。身不坏。不弄精魂不捏怪。这回方验真持戒。要与人天插个标。何妨地狱还些债。咄。债已还。有甚待。端端坐待老憨来。打破从前旧皮袋。一道神光火电飞。风流铁汉今疏快。</p><p>　　闻闻居士陈继儒赞</p><p>　　No. 1452-F 达观大师塔铭</p><p>　　夫大地死生。颠瞑长夜。以情关固闭。识锁难开。有能蹶起一击而碎之。掉臂而独往者。自非雄猛丈夫。具超世之量者。未易及也。历观传灯诸老。咸其人哉。久不复作。顷于达观禅师见之矣。师讳真可。字达观。晚号紫柏。门人种尊者。重法故也。其先句曲人。父沈连季子。世居吴江太湖之摊缺。母梦异人。授以附叶大鲜桃。寤而香满室。遂有娠。师生五岁。不语。时有异僧。过其门。摩顶而谓其父曰。此儿<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。当为 <a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师。言讫。忽不见。师遂能语。先时见巨人迹。下于庭。自是不复见。师髫年。性雄猛。慷慨激烈。貌伟不群。弱不好弄。生不喜见妇人。浴不许先。一日姊误前就浴。师大怒。自后至亲戚妇女。无敢近者。长志日益大。父母不能拘。尝有诗曰。屠狗雄心未易消。年十七。方仗剑。远游塞上。行至苏州阊门。天大雨。不前。偶值虎丘僧明觉。相顾盻。觉壮其貌。知少年不群。心异之。因以伞蔽之。遂同归寺。具晚餐。欢甚相得。闻僧夜诵八十八佛名。师心大快悦。侵晨。入觉室曰。吾两人有大宝。何以污在此中耶。即解腰缠十余金授觉。令设斋。请剃发。遂礼觉为师。是夜即兀坐达旦。每私语。三叹曰。视之无肉。吃之有味。时觉欲化铁万斤。造大钟。师曰。吾助之。遂往平湖巨室门外趺坐。主人见。进食。师不食。主问何所须。师曰。化铁万斤造大钟。有即受食。主人立出铁万斤于门外。师笑。食毕。径载回虎丘。归即闭户读书。年半不越阃。尝见僧有饮酒茹荤者。师曰。出家儿如此。可杀也。时僧甚惮之。年二十。从讲师受具戒。尝至常熟。遇养斋翁。识为奇器。留月余。之嘉兴东塔寺。见僧书<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>。乃跪看。良久叹曰。吾辈能此足矣。遂之武塘景德寺。掩关三年。复回吴门。一日辞觉曰。吾当去行脚诸方。历参知识。究明大事也。遂杖策去。一日闻僧诵张拙见道偈。至断除<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>重增病。趍向真如亦是邪。师曰。错也。当云方无病。不是邪。僧云。你错他不错。师大疑之。每至处。书二语于壁间。疑至头面俱肿。一日斋次忽悟。头面立消。自是凌跞诸方。尝曰。使我在临济德山座下。一掌便醒。安用如何如何。过匡山。穷相宗奥义。一日行二十里。足痛。师以石砥脚底。至日行二百里乃止。师游五台。至峭壁空岩。有老宿孤坐。师作礼。因问一念未生时如何。宿竖一指。又问既生后如何。宿展两手。师于言下领旨。寻迹之。失其处。师至京师。参遍融大老。融问从何来。曰江南来。又问来此作么。曰习讲。又问习讲作么。曰贯通经旨。代佛扬化。融曰。你须清净说法。师曰。只今不染一尘。融命褫师直裰。施傍僧顾谓师曰。脱了一层还一层。师笑颔之。遂留挂搭。时知识啸岩法主。暹理诸大老。师皆及门。去九年。复归虎丘省觉。乃之淞江掩关百日。之吴县。适聊城傅君光宅为县令。其子利根。命礼师。子不怿。子一日搦二花问师云。是一是二。师曰。是一。子开手曰。此花是二。师何言一。师曰。我言其本。汝言其末。子遂作礼。之天池。遇管公东溟。闻其语。深器之。师因拈蔷薇一蒂二花。问公。公曰。此花同本生也。师分为二。复问公。公无语。因罚斋一供。遂相与莫逆。时上御极三年。大千润公开堂少林。师结友巢林戒如辈。往参叩。及至。见上堂讲公案。以口耳为心印。以帕子为真传。师耻之。叹曰。西来意固如是邪。遂不入众。寻即南还。至嘉禾。见太宰陆五台翁。心大相契。先是有密藏道开者。南昌人。弃青衿。出家披剃于南海。闻师风。往归之。师知为<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。留为侍者。凡百悉委之。郡城有棱严寺。为长水疏经处。久废。有力者侵为园亭。师有诗吊之曰。明月一轮帘外冷。夜深曾照<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>人。志欲恢复。乃属太宰为<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。开公力主其闲。太宰公弟云台公。施建禅堂五楹。既成。请师命一联。师曰。若不究心。坐禅徒增业苦。如能护念。骂佛犹益真修。谓当以血书之。遂引锥刺臂。流血盈碗书之。自是接纳往来。豪者力拒。未完局。后二十余年。适太守槐亭蔡公。竟修复。盖师愿力所持也。师见象季。法道陵迟。惟以弘法利生为家务。念　大藏卷帙重多。致遐方僻陬。有终不闻法名字者。欲刻方册。易为<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。普使见闻。作金刚种子。即有谤者。罪当自代。遂倡缘。时与太宰光祖陆公。司成梦祯冯公。廷尉同亨曾公。冏卿汝稷瞿公等议。各欢然。愿赞佐。命弟子密藏开公董其事。以万历己丑。创刻于五台。属弟子如奇纲维之。居四年。以冰雪苦寒。复移于径山寂照庵。工既行。开公以病隐去。其事仍属奇。协弟子幻予本公。本寻化。复请澹居铠公终其役。始司成具区冯公。意复化城为贮板所。未克。初桐城用先吴公。为仪曹郎。参师入室。<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>及刻藏事。师遽曰。君与此法有大因缘。师化后。吴公出参浙藩。进至方伯。竟复化城。且蠲俸散刻藏数百卷。固吴公信力。亦师预谶云。师先于嘉禾刻藏有成议。乃返吴门。省前得度师觉公。时觉已<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>。以医名。师闻之。意行度脱。时夜觉饭。盂忽堕地裂。其精诚所感如此。乃诈病于小舟中。命请觉眕视。觉至。见师。大惊惧。师涕泣曰。尔何迷至此耶。今且柰何。觉曰。唯命是听。师即命剃发。竟载去。觉惭服。愿执弟子礼。亲近之。师初过吴江。沈周二氏。聚族而归之。时至曲阿。贺孙二氏。率族而礼至敬之。至金沙。于王二氏。合族归礼。愈益重。师于于园书<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。以报二亲。颜书经处。曰墨光亭。今在焉。师以刻藏因缘议既成。闻妙峰师。建铁塔于芦芽。乃送经安置于塔中。且与计藏事未偕。复之都门。乃访予于东海。时万历丙戌秋七月也。是时予以五台因缘。有闻于内。因避名于东海那罗延窟。适遇慈圣皇太后。为保圣躬。延国祚。印施大藏十五部。皇上颁降海内名山。敕僧讽诵。首及东海。予以谢恩入长安。师正携开公走海上。至胶西。值秋水泛涨。众度必不能渡。师解衣先涉。疾呼众。水已及肩。师跃然而前。既渡。顾谓弟子曰。死生关头。须直过为得耳。众心服师。时予在长安。适师弟子于君玉立来访。言师已东行。计其程。旦夕乃入山期也。予闻之。亟促装归。日夜兼程。亦犯横流。赶至即墨。时师已出山。在脚院。诘朝将长发。是夜一见。大欢笑。明发。请还山。留旬日。心相印契。师即以予为知言。许生平矣。师返都门。复潭柘古刹。乃决策西游峨嵋。由三晋。历关中。跨栈道。至蜀礼普贤大士。顺流下瞿塘。过荆襄。登太和。至匡庐。寻归宗故址。唯古松一株。为寺僧售米五斗。匠石将伐之。适丐者怜而乞米赎之。以存寺迹。师闻而兴感。其树根底。为樵者剥斫过半。势将折。师砌石填土。咒愿复生。以卜寺重兴兆。后树日长。寺竟复。其愿力固如此。时江州孝廉邢懋学。礼师延居长松馆。执侍最勤。师为说法语。集名长松茹退。先是邹给谏尔瞻。丁大参勺原。素雅重师。意留驻锡匡山。未果。遂行。过安庆。时有江阴居士赵我闻谒见。不可。适阮君自华。归心于师。因为居士先求得度。未许。阮君请游皖公山马祖庵。师喜其境超绝。即属阮宜建梵刹。居士恳乞出家。遂剃发于山中。詺名曰法铠。是为澹居。其庵今蒙敕赐<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>寺。师复北游。至石经山。晋琬公。虑三灾坏劫。<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>浸灭。乃石刻藏经安于岩穴。师见而感之。时琬公塔院。被力者侵。师志复之。启石室。佛座下。得函贮<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>若干。出时。光烛岩壑。适圣母。闻师至。命近侍陈儒致斋供。特赐紫伽黎。师让之。谢曰。自惭贫骨难披紫。施与高人福更增。因请佛舍利入内。供三日。出帑金重藏于石窟。师重二事。思得予作记。适予闻师西游回。即驰至京。候于上方兜率院。师拉予游。观石经。遂记之。予回寓慈寿。师感遇亦出山见访。同居于西郊园中。对谈四十昼夜。目不交睫。信为生平至快事。时遍融老已入灭。因吊之。有嗣德不嗣法之语。师在潭柘。居常<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>后方食。一日客至喜甚。误先举一食。乃对知事曰。今日有犯戒者。命尔痛责三十棒。轻则倍之。知事惊。不知为谁。顷师授杖知事。自伏地于佛前。受责如数而股如墨。乃云。 <a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>无始习气。如油入面。牢不可破。苟折情不痛。未易调伏也。师与予计。修我朝传灯录。予约师。往浚曹溪。以开法脉。师先至匡山以待。时癸巳秋七月也。越三年乙未。予初以供奉圣母赐<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>。建海印寺成。适以别缘触圣怒。诏逮清下狱。鞫无他辞。送法司拟罪。蒙恩免死。遣戍雷阳。毁其寺。时师匡山闻报。为予许诵法华经百部。冀佑不死。即往探曹溪回。将赴都不救予。闻予将南放。遂待于江浒。是年十一月。方会师于下关旅泊庵。师执予手叹曰。公以死荷负大法。古人为法。有程婴。公孙杵臼之心。我何人哉。公不生还。吾不有生日。予慰之再三。濒行。师嘱曰。吾他日即先公死。后事属公。遂长别。予度岭之五年。庚子。上以三殿工。下矿税令。中使者驻湖口。南康守吴宝秀不奉令。劾奏被逮。其夫人哀愤缳死。师时在匡山闻之曰。时事至此。倘阉人杀良二千石。及其妻。其如世道何。遂策杖越都门。吴入狱。师至多方调护。授吴公毗舍浮佛半偈。嘱诵满十万。当出狱。吴持至八万。蒙上意解。得末减。吴归。每念师辄涕下。师以予未归初服。每叹曰。法门无人矣。若坐视法幢之摧。则绍隆 <a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>者。当于何处用心耶。老憨不归。则我出世一大负。矿税不止。则我救世一大负。传灯未续。则我慧命一大负。若释此三负。当不复走王舍城矣。癸卯秋。予在曹溪。飞书属门人之计偕者。招师入山中。报书直云。舍此一具贫骨。居无何。忽妖书发。震动中外。时忌者乘白简劾师。师竟以是罹难。先是圣上以轮王乘愿力。敬重大法。书金刚经。偶汗下渍纸。疑更当易。亟遣近侍曹公质于师。师以偈进曰。御汗一滴。万世津梁。无穷法藏。从此放光上览大悦。由是注意。适见章奏甚怜之。在法不能免。因逮及。旨下。云着审而已。及金吾讯鞫。以三负事对。绝无他辞。送司寇。先是侍御曹公学程。以建言逮。久在狱。与师问道。有圜中语录。时执政欲死师。师闻之曰。世法如此。久住何为。乃索浴罢。嘱侍者小道人性田曰。吾去矣。幸谢江南诸护法。道人哭。师叱之曰。尔侍予二十年。仍作这般去就耶。乃说偈。语在录中。言讫端坐安然而逝。曹公闻之急趋至。抚之曰。师去得好。师复开目微笑而别。时癸卯十二月十七日也。师生于癸卯六月十二日。世寿六十有一。法腊四十有奇。噫。师生平行履。疑信相半。即此末后快便一着。上下闻之无不叹服。于戏。师于死生视四大如脱敝屣。何法所致哉。师常以毗舍浮佛偈示人。予问曰。师亦持否。师曰。吾持二十余年。已熟句半。若熟两句。吾于死生无虑矣。岂其验耶。师化后。待命六日。颜色不改。及出。徒身浮葬慈慧寺外。次春夏霖雨及秋。陆长公西源。欲致师肉身南还。启之安然不动。适予弟子大义。即奉师龛至。经潞河。马侍御经纶。以感师与李卓吾事。心最恸。因启龛拂面。痛哭之。至京口。金沙曲阿诸弟子。乃奉归径山。供寂照庵。以刻藏因缘。且推沈中丞重建大殿。乃师遗命。以师<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>有偈云。怪来双径为双树。贝叶如云日自屯。以是故耳。时甲辰秋九月也。越十一年乙卯。弟子先葬师全身于双径山后。适朱司成文宁公。礼师塔。知有水。亟嘱弟子法铠启之。果如言。复移龛至开山。乃与俗弟子缪希雍。谋得五峰内。大慧塔后开山第二代之左。曰文殊台。卜于丙辰十一月十九日茶毗。廿三日归灵骨塔于此。予始在行闲。闻师讣。即欲亲往吊。因循一纪。未遂本怀。顷从南岳数千里来。无意与期会。而预定祭日。盖精神感孚亦奇矣。师后事。予幸目击。得以少尽心焉。于戏。师生平行履。岂易及哉。始自出家。即胁不至席。四十余年。性刚猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。律身至严。近者不寒而栗。常露坐。不避风霜。幼奉母训。不坐阈。则尽命。立不近阃。秉金刚心。独以荷负大法为怀。每见古刹荒废。必志恢复。始从棱严。终至归宗。云居等。重兴梵刹一十五所。除刻　大藏。凡古名尊宿语录。若寂音尊者。所著诸经论文集。皆世所不闻者。尽搜出刻行于世。晚得苏长公易解。大喜之。室中每示弟子。必令自参。以发其悟。直至疑根尽拔而后已。然义重君亲忠孝之大节。入佛殿见万岁牌必致敬。阅历书。必加额始览。师于阳羡。偶读长沙志。见忠臣李贲。以城垂陷。不欲死于贼。授部将一剑。令斩其全家。部将恸哭奉命。既推刃。因复<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>。师至此泪直迸洒。弟子有傍侍者不哭。师呵曰。当推堕汝于崖下。其忠义感激类如此。师气雄体丰。而面严冷。其心最慈。接人不以常情为法。求人如苍鹰攫兔。一见即欲生擒。故凡入室不契者。心愈慈而恨愈深。一棒之下。只欲顿断命根。故亲近者希。凄然暖然。师实有焉。师性耽山水。生平云行鸟飞。一衲无余。无住足地。居常悲禅宗凋敝。欲求国初来诸尊宿机缘。续为传灯。未遂本愿。赍志而往。于戏。师岂常人哉。即其见地直捷稳密。当上追古人。其悲愿利生。弘护三宝。是名应身大士。予尝有书答故人。问师何如人。予曰。正法可无临济德山。末法不可无此老也。师每慨五家纲宗不振。常提此示人。予尝叹曰。纲宗之不振。其如慧命何。原其曹洞则专主少林。沩仰圆相久隐。云门自韩大伯后。则难见其人。<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>大盛于永明。后则流入高丽。独临济一派。流布寰区。至宋大慧中兴其道。及自国初楚石无念诸老。后传至弘正末。有济关主。其门人先师云谷和尚。而典则尚存。顷五十年来。狮弦绝响。近则蒲团未稳。正眼未明。则妄自尊称临济几十几代。于戏。邪魔乱法。可不悲乎。予以师之见地。足可远追临济。上接大慧之风。以前无师派。未敢妄推。若据尧舜之道。传至孔子孟轲。轲死不得其传。至宋二程直续其脉。以此证之。则师之不忝为转轮真子矣。姑录大略以俟后之明眼宗匠。续传灯者采焉。以师未出世。故无上堂。普说。示众诸语。但就参请机缘开示。门人缉之。有集若干卷。梓行于世。入室缁白弟子甚多。而宰官居士尤众。师生平行履。不能具载。别有传。乃为之铭。铭曰佛未出世。祖未西来。击涂毒鼓。谁其人哉。鹫岭拈花。少室面壁。只道快便。翻成狼籍。黄梅夜半。老卢窃逃。谁料岭南。有此獦獠。南岳青原。擦脓涕汉。多少痴人。被他诓赚。五家手快。如抚舜琴。南熏倏至。辨者知音。儿孙恶辣。触者先亡。但放一线。其家永昌。门户孤单。命存一丝。有救之者。定是嫡儿。如汉张良。为韩报仇。纵然国破。宗祧可求。是生吾师。如石迸笋。出则凌霄。孰知其本。为法力战。通身汗血。大似李陵。空弮不怯。身虽陷虏。其心不亡。千秋之下。毕竟归王。师金刚心。尽化为骨。逼塞<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。岂在山麓。师不知我。谁当知师。一死一生。春在花枝。</p><p>　　时万历四十四年嘉月朔旦</p><p>　　前海印住山<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>辱教德清稽首撰</p><p>　　祭文</p><p>　　维万历四十四年。岁次丙辰。十一月庚子朔。越十有九日丙戌。前海印沙门辱教德清。谨陈香积之供。致祭于紫柏尊者。达观大师之灵曰。呜呼。惟师之生也不生。乘愿力而来。师之死也不死。顺<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>而去。去来不落常情。生死岂同世谛。以师之住世也。秉金刚心。踞坚固地。三十余年。家常茶饭。脊骨纯钢。千七百则。陈烂葛藤。鼻孔残涕。推倒<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>释迦。不让德山临济。为人极尽慈悲。临机绝无忌讳。誓护法若惜眼睛。求大事如丧考妣。不与世情和合。便是真实行履。晏坐水月光中。独步空华影里。初访予于东海也。顿脱形骸。既再晤于西山也。搜穷骨髓。当予祸之未形也。备告之以隐微。及予难之既发也。将为我以雪洗。且酬夙约于曹溪。将扣阍于帝里。冒炎蒸于道路兮。望影响而进止。乃设法以多方。冀出予于九死。呜呼。师之为法门也。实抱程婴杵臼之心。师之为知己也。殆非管鲍陈雷之比。予荷皇仁之薄罚兮。师之心犹未已。予被放岭表兮。师伫候于江沚。一见欢若更生兮。如九原之复起。予与师作永诀兮。甘为炎方之厉鬼。师嘱予以宁志兮。冀幽扄之再启。予挥涕以临长路兮。师执手含悲而不语。维时关山一别兮。日月若矢。心知师之不我忘兮。每叮咛其无以。师以愿力所持兮。誓不负其本始。乃敛太阿之光焰兮。不顾放身于尘滓。冀和璧之必信兮。不惜隋珠之轻抵。将扣君门兮九重。倏遇飙风兮四起。陆海波腾。龙蛇披靡。玉石俱焚。法幢倾圮。师登八道之康衢兮。忽遇长蛇与封豕。皇天实鉴其衷兮。唯见逞于庸鄙。幸此心之白兮。聊以发其蕴底。师实旷然。何忧何喜。逆顺随宜。死生游戏。何夙负之相寻兮。信前缘之固尔。师悲五浊之不堪。直一行之可恃。乃盥漱以趺坐兮。遂寂然而长往矣。呜呼痛哉。师既不以祸患撄宁。又何以去来为事。故撒手便行。全无拟议。惟师以金刚为心。故留不坏之体。有予弟子奉师以南旋兮。就双径以归止。予闻讣以摧心兮。望长空而殒涕。欲亲礼于龛室兮。柰业系之羁縻。拟生还以慰师灵兮。忽星霜之逾纪。匪此心之暂安兮。第因缘之不我与。顷幸遂其本怀兮。始得陈辞而致诔。呜呼痛哉。师何死兮我何生。我不来兮师不宁。形骸异兮共此心。幽冥隔兮终合并。誓同归兮践深盟。寂光朗兮师安住。我<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>兮展哀慕。陈香积兮洒甘露。师临机兮愿来赴。光明兮照曜。翘勤兮延伫。哀哉尚飨。</p><p>　　举火</p><p>　　性火真空。性空真火。狭路相逢。定没处躲。恭唯紫柏尊者。达观大和尚。偶来人世。误落尘寰。赤力力。脱尽娘生布衫。光烁烁。露出本来面目。荷担正法。纯钢炼就肩头。彻底为人。生铁铸成肝胆。死生路上。直往直来。今事门头。半开半掩。六十余年。松<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>月襟怀。千七百则。兔角龟毛拄杖。饶他末后风流。未免藏头露尾。撇下赃私。谁料落在憨山道人手中。今日特为人天众前。当阳拈出。大众还见么。(以火把画○相云)拄杖挑开双径云。通身涌出光明藏。珍重诸人着眼看。这回始信无遮障。</p><p>　　No. 1452-G 紫柏大师全身<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>颂有序</p><p>　　一切<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>。不离七佛偈以为根本最初。毗舍浮佛偈云。假借四大以为身。心本无生因境有。只这半偈。已将<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>十二部。五千四十八卷。千七百则葛藤。满口道出。更无覆藏。悟之者号祖师禅。证之者即 如来果。紫柏大师。持此半偈。普印众生若干种心。四十年胁不至席。手不停挥。为初学人。谈<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>义。为久习辈。开 <a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>门。为利智根。指 <a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>心。显法界藏。有时雷轰电掣。截断众流。有时带水拖泥。四轮着地。随机赴感。未曾一针锋许。出得半偈道场。谓法友憨山师道。吾持此偈。已得句半现前。更得半句。了了常知。自许一生。参学事毕。后十余年。师以佛知见力。慈善根力。向刀山剑岭。任运游戏。自在<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。戒定余熏。生身不坏。可谓空假泯合。心境一如。用四大分解之尘根。演半偈重玄之妙旨。毗浮舌相。遍覆三千。持与持者。同时寂灭。谁谓师非七佛所遣化人。广瀹。睹面缘悭。闻名种熟。清净明诲。私淑有年。甲寅秋仲。卒业遗教。增上闻思。虽漩澓惊涛。目不得暇。而王印在手。斗柄当天。行布<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>。莫不消归半偈。独恨未能将此半偈枯禅。消归自己。长为穷子。辜负婆心。聊作颂辞。充窣堵波。最下劣供。七金山下。羽毛有同色之奇。两足舌端。毒药化醍醐之味。以此善根。自熏成种。或者他生后世。不烦半偈阿师。眉毛堕地矣。颂曰。</p><p>　　四大是假亦是真　　心境不二亦不一</p><p>　　兼二为一一亦亡　　即假悟真真乃遍</p><p>　　发毛爪齿及涕唾　　暖气动转诸浮根</p><p>　　我说即是金刚王　　幻化空身皆实相</p><p>　　地水火风和合聚　　明闇色空相待摇</p><p>　　<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>吸揽镜上痕　　若亏其一必无两</p><p>　　十方三际本虚玄　　<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无名无有边</p><p>　　一切时处入一尘　　半偈重重罗帝网</p><p>　　紫柏得此<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>门　　从大涅槃示生死</p><p>　　来以口光说半偈　　风林墙壁皆雷音</p><p>　　缶泻云兴文字禅　　一一众生毛孔吼</p><p>　　去以身光说半偈　　常与<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>俱戏论</p><p>　　了知假合即坚固　　皮囊劫火恒宴然</p><p>　　于去来中逆顺行　　梦入他心令觉梦</p><p>　　悲智交<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>教律　　发挥半偈无有余</p><p>　　巍巍双径窣堵波　　师坐其中炽然说</p><p>　　佛偈即师师即偈　　遍在众生心想中</p><p>　　我从遗编获髻珠　　不历百城持<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a></p><p>　　传师半偈即传衣　　一切如来同鼻孔</p><p>　　万历丙辰季秋七日皖舒私淑小子广瀹优婆塞吴应宾和南谨述</p><p>　　No. 1452-H 紫柏老人圜中语录序</p><p>　　圜中语录。录紫柏道人居圜语也。录语者。浙西吴生彦先也。彦先儒者。何慕为此耶。吾儒宗孔孟。辄云辟佛老。非恶其道之尽非也。恶溺于非者。相率而至于灭伦畔道也。苟可以禆性灵。廓闻识。补吾圣教所不及者。即伶人[婺-矛+牙]妇之辞。昆虫草木之变。无往而非道。稗官博士。往往不弃。至采之声歌。以备览观。矧吾儒与二氏分驰。鼎立于当代哉。昔韩昌黎称一世大儒。力排异说。原道一篇。凛凛乎与日月争烈。及居潮时。贻大颠书累幅。至留题留衣。又何两截也。彼其所以非之者。非其流于邪者也。所以是之者。是其近于正者也。故曰通于儒者。始可与谈佛老矣。紫柏道人。字达观。早失恃怙。廿岁出家。不识文字。立禅三年。苦行持戒。一旦顿悟。藏典群书。了然领会。云游遍天下。胁不至席者三十年。像若弥勒。心若寒潭。声若洪钟。口若悬河。静慧玄朗。名倾海内。荐绅贵倨。每折节下之。道人内大慈悲。外严<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。世拟为临济尊宿复出云。于人无贵贱大小。持平等心待之。故贱者小者喜其容。贵者大者目为傲。得其门而入者。靡不归依。不得其门而入者。闲为排诋。道人故以此得名。亦以此贾祸。道人自谓有义命存焉。吾不知有名实也。吾不知有祸福也。此可以概其生平矣。岁庚子。玉芝子。与南康子同系福堂。闲谈名理。南康子喜诵<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。予独不喜诵佛经。每嘲云。即心是佛耶。即口是佛耶。南康子未与道人面。而心严事道人。笔札相往来。尝出其观音赞示予两人。相赓和。道人有当于心也。因了戒子寄予茶。贻予半偈。予酬和之。又为予作石佛渡海记。语语皆明心见性。又赠茶扇香花四偈。各有唱和。恨不一见以偿夙心。无何讹言构。大狱兴。蔓延善类。中外震悚。道人亦以挂误下于理。两人幸相见之晚也。道人拷讯时神色自如。持议甚正。以衰老残躯。备尝笞楚。抵死不屈。有烈士风。时严寒。道人且冻馁。予施一盂饭。一蒲团。一衲衣。道人昼夜跏趺不寐。环匣累系者扣之。随人启迪。无非接引向善。不剿空谈幻语惑人。宜当代贤豪。乐与之游甚广也。癸卯十二月初五日入狱。十七日无疾坐化。寿止六十一。先是道人授彦先偈。若预知其将化者。又与予论朝闻道章。甚有解脱处。化之日说偈若干首。至五鼓语人以圆寂。人莫解。天明户启。呼姜汤净口。作<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>声。出门就地坐。众惊扶坐榻上。闭目不语。众走报道人逝矣。予往视之。大呼道人去得好。记着么。道人复张目视予。自启手扶两足。跏坐而逝。舁出闲地。经六昼夜。旋风曝日。阴翳严霜。飞沙落垢。摧折备至。俨然端坐。神采焕发。现光明状。予与圜中人。靡不目击叹异。焚香顶礼。佛声浩浩。及埋瘗土穴中。七越月。启骸南迁。幻身如生不毁。世未曾有。此平湖陆西源亲历其事者。吁异哉。岂其巨灵呵护。抑道人自护有神欤。江南士人某等嘉其神异。治龛藏魄。归葬初修山寺中。道人逮系。彦先始终周旋曲至。复手录圜中问答语偈。以授旧游者。自谓于道人有夙缘。乞予一言叙之。予惟佛氏不立文字。此录不足为道人有无。生死一大事。乃前知其故。至灭不乱性。留不坏身。踪迹昭然。灵异如此。此非修持于一世者。可得而骤至也。又岂末世缁流。所能仿佛其万一也哉。</p><p>　　玉芝子湘源曹学程撰</p><p>　　紫柏老人圜中语录</p><p>　　示潭柘寺僧众</p><p>　　水缘湿燥。山以高崩。此有因所致。为福致殃。为恶致祥。此何因耶。因自多生。凡夫不觉耳。老朽出山。山门无恙。欲不待请。主先往焉。彼必以余事累汝等。姑待之。汝辈遇境慎勿惊。以因不属汝辈故也。雪寒蔀屋亦不恶。镬汤炉炭。苦痛呻吟。总是意乐三昧。不信请于老朽瞑目地验之。</p><p>　　被逮答檀越</p><p>　　达朽既被逮已。有世智辨聪辈。愤然谓余曰。和尚厌离尘界。宜翛然无累。何载遭白简。犹恋恋京师。致今日之苦耶。曰檀越以何物为尘界。何物为苦乎。深山大泽。虎豹龙蛇居焉。蛇虎未尝不苦人也。然探渊者则得珠。凿山者则获璧。是见珠璧之为利。未尝知有龙蛇虎豹也。吾诸 大乘沙门。以利济为事。方冒难以救援。安知尘劳之可出。无上大宝。失之于穷子。方矢浩劫以追求。乌知分段之可惜。特患衣珠之喻未喻耳。不患衣之频易也。朽乘此解脱其躯壳。岂但解脱鹘臭弊衣乎。内衣之珠。不假外得。夫何苦哉。檀越言苦。异乎朽之为苦矣。</p><p>　　与曹直指夜谈</p><p>　　曹直指。举苏长公罗汉赞曰。右手持杖。左手拊石。为手持杖。为杖持手。宴坐石上。安用杖为。无用之用。世人莫知。尊者曰。入道之机。机则透微。微透则手杖皆离。故曰离微入道之真机。直指曰。东坡东坡。手杖如何。有时用。也有时舍。作什么。尊者曰。撑天拄地。</p><p>　　先以欲钩牵。后令入佛智。此维摩诘所说也。图难于其易。为大于其细。此老氏所说也。皮球子以二氏之说。观其所以然。不过至人照圆。众人照偏。偏则泥。圆则通。既谓之通矣。则事无大小。理无浅深。声入而心通矣。奚疑之有哉。虽然理通始于检名。故名不检。则实不得。实不得。则义不精。义不精。则理不易穷。理不穷。则性命之学。安从而入欤。故有志于性命之学者。倘不知自重。而饮食男女之欲乱其真。即世闲功名事业。尚了不来。况大于此者乎。</p><p>　　(万历庚子师寄圜中南康子。吴中石佛赞云。狱室名福堂。检名实自详。因苦生觉照。觉则物我忘。今所说似重拈此义也。弟子李麟记)。</p><p>　　示吴彦先</p><p>　　观夫名利之来。非无所本也。若以四大观身。前境观心。则身与心何殊焦谷芽。石女儿哉。以众人不知此观。不醉乎名。则醉乎利矣。殊不知缘名利。而逆观乎身心。缘身心而逆观乎身心之前者。名耶。利耶。身耶。心耶。吾不得而知也。</p><p>　　示郢中仇文学</p><p>　　咄咄胡为睡。螺蛳蚌蛤类。一睡一千年。不闻佛名字。此偈释迦老子。为弟子阿那律陀正闻经时。贪睡交眼。警其昏惰而说也。呜呼。 五欲之重。莫重于睡。故睡重者。虽西施唼其唇。春雷奋乎地。不知声色为何物。夫声之与色。此众人之常习也。及乎睡而声色当其前。有眼不见。有耳不闻。由是观之。则睡酒之醉人。较其余醉。其芘大矣。故曰昏魔不斩。散魔不召而集。盖昏之与散。必根乎念。念必根乎感。知念根感。念本<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。我既无我。则受感者谁。知属观。无受属止。观足以铸昏。止足以汰散。昏铸则明。散汰则静。明与静。固有之性德也。以性变而为情。昏散生焉。若然者。明非固有。昏则无源。静非固有。散亦无地。众人不知。以昏散明静为两物。所以情之复性。卒不易也。</p><p>　　警大众</p><p>　　皮球子曰。时不可忽。一忽时则昧心。心昧则何事不昧哉。由忽生怠。怠习一长。则气为主。心为奴矣。故卧薪尝胆。非虚设也。谓勾践能之。我不能此。不知自重耳。若知自重。则天地万物皆末也。我本也。虽然性既变情。则自无待而为有待。有待则物我亢然。顺习则喜。逆习则嗔。此情为政而性隐矣。性则智周万物而不劳。形充八极而无累。故能会万物为一己。一己则己外无物。物外无己。以物外无己。故我用即物用也。以己外无物。故物用即己用也。知周不劳。形充无累。复何疑耶。经又曰。若能转物即同如来。由是论之。我能转物。谓之如来。则我被物转。谓之如去。如去即众人也。如来即圣人也。圣则无我而灵。凡则有我而昧。昧则忽时。忽时之人。忧不深。虑不远。不知自重耳。人为万物之灵。而不知自重。皮球又何言哉(师别号皮球)。</p><p>　　十一月二十九日被逮别潭柘寺偈</p><p>　　寒潭古柘映青莲。野老经行三十年。留偈别来冲雪去。欲乘爽气破重玄。</p><p>　　出潭柘示僧众偈</p><p>　　达观老汉出山去。堂内禅和但放心。头上有天开正眼。当机祸福总前因。</p><p>　　腊月初五日从锦衣卫过邢部偈</p><p>　　大贾闯入福堂来。多少鱼龙换骨胎。恐怖海中重睡稳。翻身蓦地一声雷。</p><p>　　闻柝</p><p>　　匿王问法忽齐年。自谓观河不见迁。我有眼根听夜柝。却沈丰蔀更冷然。</p><p>　　柝声未断铃声续。谁是声兮谁是闻。却忆法堂钟鼓候。古来魂梦更纷纭。</p><p>　　同曹侍御诸文学集吴彦先夜谈</p><p>　　白法剖微尘。翠涛生咽唾。何妨真与俗。两采夜深赌。</p><p>　　一见原来是故人。同心何必在同身。者条担子谁轻重。两道眉毛绰有神。</p><p>　　倾盖白头匪两人。只缘岐念总同身。两闲担子谁堪任。个有生来一点神(曹和)。</p><p>　　示吴彦先</p><p>　　江南知识隔风尘。独影那从暗地亲。长啸一声空界裂。谁知针芥在羁人。</p><p>　　羁人敢必全无罪。要识生机即死机。觑破死生原一贯。羽还走也足还飞。</p><p>　　相逢不必问前因。藻镜离尘万象新。花果故园应自好。溪声山色总宜人。</p><p>　　日高三丈尚憨眠。绝胜云林鼻观禅。却被头陀闲扰醒。梦魂无地更留连。</p><p>　　寄示法密</p><p>　　阎罗可是执金吾。火镬冰山事有无。试问密郎何所解。区区六尺等交芦。</p><p>　　色空偈示杨中涓</p><p>　　闲居徒自伴花眠。谁谓花神解说禅。空色两关留不住。春风幽鸟领三玄。</p><p>　　添数珠偈</p><p>　　一线穿珠百八。偶然一珠堕落。何须物外追寻。即把觉迷添着。</p><p>　　腊月十一日司审被杖偈</p><p>　　三十竹篦偿宿债。罪名轻重又何如。痛为法界谁能荐。一笑相酬有太虚。</p><p>　　坐来尝苦虱侵肤。支解当年事有无。可道竹篦能致痛。试将残[月*坒]送跏趺。</p><p>　　十四日闻拟罪偈</p><p>　　夙业今缘信有机。南中莲社北圜扉。别峰倘有人相问。师子当年正解衣。</p><p>　　忆介公</p><p>　　谁能念尔冲寒去。傀儡提撕岂有神。长别莫谈身后愿。好从当下剖微尘。</p><p>　　忆卓老</p><p>　　去年曾哭焚书者。今日谈经一字空。死去不须论好恶。寂光三昧许相同。</p><p>　　十五日法司定罪说偈</p><p>　　一笑由来别有因。那知大块不容尘。从兹收拾娘生足。铁橛花开不待春。</p><p>　　十六日临化说偈</p><p>　　事来方见英雄骨。达老吴生岂夙缘。我自西归君自北。多生晤语更泠然。</p><p>　　南北经行三十年。钝机仍落箭锋前。此行莫谓无消息。雪夜先开火内莲。</p><p>　　尽称达老鼓风波。今日风波事若何。试向明年看老达。风波满地自哆和。</p><p>　　潭柘双青谩说龙。相依狴犴更从容。主人归去香云冷。好卧千峰与万峰。</p><p>　　幻骨吾知无<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。从来称石总虚浮。夜深寒照吴门月。翻笑生公暗点头。</p><p>　　幽关寂寂锁难开。那道沙门破雪来。饥鼠何妨沾法喜。冻脓早许委黄埃。</p><p>　　夙愿平生未易论。大千经卷属重昏。怪来双径为双树。贝叶如云日自屯。</p><p>　　启龛须记合龛时。痛痒存亡尔即伊。不必燕云重眷恋。此身许石肯支离。</p><p>　　山鬼不必赛。水神胡可解。枯木冷重云。独见田侍者。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>那忽死。死者生之府。法门何所闻。付诸涂毒鼓(谶所知)。</p><p>　　手字致江南诸法属等。各各自宜坚持<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。老朽休矣。不得载见。特此为别。付与小道人持执示览。护持三宝。棱严径山刻藏事。可行则行。不可则止。癸卯年十二月十六日。</p><p>　　No. 1452-I</p><p>　　不佞少事铅椠。从诸名贤游。即闻紫柏尊者德风籍籍。以为肉身大士。竟愧火驰方内。无从快睹劫外青莲也。壬寅岁。彦罹白简。逮系比部狱。明年癸卯冬。圣上以奸书震怒。大索国中。而尊者以弘法来忌。亦挂弹章。比闻难。一众股栗。而师从容笑语如平时。乃以<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>开譬僧众。夷然出山赴诏狱。无何入西曹。彦幸获归依焉。初闻师严冷不易亲。及见则深慈等悲。沁人心髓。彦因炷香求心要。师为拈毗舍浮佛半偈云。假借四大以为身。心本无生因境有。令久久持诵。且为决了其旨曰。是身无从。合由四大。是心无从。起因前境。试推四大及境。更何所从乎。凡夫不知性变为情之旨。随情起执。生死浩然。圣人以理折情。性斯复矣。性复情空。何生死之有哉。彦惟时如后夜闻雷。顾念古人求法。至于立雪断臂。而彦罪累凡愚。沉迷牢户。乃忽闻万劫出苦之因。法乳恩深。即捐顶踵不足明报也。师既居圜久之。彦时时从闲。同曹直指。沈令尹。郢中诸文学。阐抉儒释性命之渊奥。如河决川委。随宜说偈。冲口而成。及被讯。以衰残历诸刑苦。凡侍者皆心欲落。而师云闲水止。了无一事。甫入圜。辄又渠渠以佛法劝发一众。盖其定慧精严。壁立万仞如此。腊月望。合爪说偈。徐语彦曰。道人将去。彦愕然曰。师不念法道。不念众生耶。殷勤启请。而师顾笑曰。去得快。来得快。旋即为吾浙何君说<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>歌。而彦以仓卒未之录也。越二日既曙。圜扉启。师遽出户仰视曰。辰刻矣。因呼姜汤净口。遂地坐。连称毗卢遮那佛数声。众惊扶坐榻上。遂瞑。直指君闻之。仓茫及榻前。大呼去得好。记着么。师乃更微睇直指君。启手敛足。[革*展]然而逝。即十七日辰刻也。随舁坐露地。霜风尘沙。种种摧蚀。经六昼夜。而神采溢发。如未度世。既出狱。以师遗言毋敛。仅周以藟梩。而土掩于西郊。会甲辰京师大水。城关皆崩。四郊如海。诸弟子念师在巨浸中。命田侍者鸣诸当事。得归龛。陆比部西源。于孟秋十三日。躬往视事。七尺之土未干。疑师且水化。及破封而端坐如生。不动不变。一众号呼。叹未曾有。嗟乎。此岂非光明硕大。超格越量。不可思议之肉身大士乎。彦遇师晚。即于宗乘教理未有证入。终日戴天履地。而其高厚非所能知。然其甘祸患如游戏。等生死于往来。其灭度也。则并幻身而不坏。其一息之存也。则困顿刑楚了不入意。而勤勤恳恳。逢人劝诱。必欲出之苦海。有如拯溺救焚。目不及瞬。而手不及援者。如是而曰非大<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人。非真圣贤。则凡古之圣贤。皆不足信也。师入圜中。随地随时随人。横口法施。若决藏海。滔滔滚滚。香象鼷鼠。无不满腹。随人手录。各各携去。而彦所见闻者。则尽此帙中。先以致江南法属授诸梓。而后徐致其余。所恨独少转生歌耳。呜呼。微言未绝。灵光妙音。岂违咫尺哉。</p><p>　　万历甲辰中秋朔竺灵居士吴中彦彦先甫和南记</p><p>　　紫柏老人集卷之一</p><p>　　明　憨山德清　阅</p><p>　　法语</p><p>　　释迦文佛以文设教。故文殊师利。以文字三昧辅释迦文。而用拣择之权。于楞严会上。进退二十五圣。独选择观音当机。无有敢议其私者。观世音虽弥陀辅佐。亦以<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>入。近乎文字三昧。故释迦文佛。亦退三十二亿恒河沙菩萨。独进观世音。岂非此方真教体。清净在音闻欤。若文字三昧。不以音闻为体。是犹花不以春为神。岂真花也哉。盖文字根于音闻。音闻根于觉观。觉观又根于无觉无观者。佛意欲一切众生。因有分别心。入文字三昧。因文字三昧。入音闻之机。因音闻之机。入无觉无观。无觉无观既入。则最初有分别心。至此不名有分别。而名无觉无观矣。夫无觉无观者。所谓正因佛性也。正因佛性既变而为情。苟不以了因契之。则正因终不能会也。了因虽能契正因。若微缘因熏发之。则了因亦不能终自发也。缘因。即文字三昧之异名也。了因。即音闻之机之异名也。学者苟能触类而长之。则文殊文字三昧。与观音音闻三昧。皆不在文殊观音与释迦文佛。在我日用而已。故老庞曰。日用事无别。惟吾自偶谐。神通并妙用。运水及搬柴。柴水即老庞文字三昧也。神通即老庞音闻之机也。惟吾自偶谐。即老庞了因契会正因佛性者也。即此观之。凡<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。不通文字般若。即不得观照般若。不通观照般若。必不能契会实相般若。实相般若。即正因佛性也。观照般若。即了因佛性也。文字般若。即缘因佛性也。今天下<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>者。必欲排去文字。一超直入如来地。志则高矣。吾恐画饼不能充饥也。且文字佛语也。观照<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>也。由佛语而达佛心。此从凡而至圣者也。由佛心而达佛语。则圣人出无量义定。放眉间白毫相光。而为文字之海。使一切众生。得沾海点。皆得入流亡所。以至空觉极圆。寂灭现前而后已。若然者。即语言文字。如春之花。或者必欲弃花觅春。非愚即狂也。有志于入流亡所者。当深思我释迦文。以文设教所以然之意。如其明之。即文字语言可也。离文字语言可也。如其未明。即文字与离文字皆不可也。非即非离亦不可也。</p><p>　　师曰。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>。与十方众生世界。皆根于空。空复根于心。故经曰。空生大觉中。如海一沤发。有漏微尘国。皆依空所生。第众生胶固于根尘之习。久积成坚。卒不易破。故诸佛菩萨先以空药。治其坚有之病。世之不知佛菩萨心者。于经论中见其炽然谈空。遂谓佛以空为道。榜其门曰空门。殊不知众生有病若愈。则佛菩萨之空药亦无所施。空药既无所施。又以妙药治其空病。然众生胶固根尘之习。虽赖空药而治。空病一生。苟微佛菩萨之妙药。则空病之害。害尤不细。世以<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>为空门者。岂真知佛心哉。或以曹溪本来无一物。何处惹尘埃之语。横计于心。便谓我本来无一物。又有何尘埃可染。请自审察。我既本来无一物。人举手揖我。我<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。人以手戟我。我随怒。现前喜怒又何物乎。如此物不能直下爆破。则碍膺长劫有在。敢谓横计者本来无一物。即曹溪之本来无一物乎。佛菩萨说法。如良医用药。如良将用兵。药与兵岂有常哉。但察病人与敌人。情之所在何如耳。苟得其所在之情。则药与兵。如庖丁之解牛矣。故世以佛门为空门。及掠曹溪本来无一物。为自己本来无一物者。皆刀折而牛未解者也。佛菩萨知众生迷心而有空。迷空而有身心。迷身心而有前尘。前尘即世界之属。身心即众生之类。然世界与众生。离空则无有根。空离觉心则亦无根。故佛菩萨教众生。始以解空。终以悟心。心悟则空与世界众生。皆不可得。所谓大觉心者。譬如浮云相尽。不待举目而明月在前矣。浮云则空有之譬。明月乃喻固有之常光耳。或进曰。由尘而达根。由身心而达空。由空而达心。乞师指某甲。只今心在何处。师笑曰。汝若<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。设此问端又是何物。进者罔措。师曰。将心问心。指心不知心。是汝错。是梅西错。曰是学人错。曰汝若果知自错。则汝行里坐里饥里寒里。境缘顺逆是非里。能不忘此错。则空生大觉中。如海一沤发。有漏微尘国。皆依空所生。汝有日自知在。不惟众生国土与虚空。皆在汝心。即大觉心。离汝心亦不可得。进者稽首而退。</p><p>　　夫理。性之通也。情。性之塞也。然理与情而属心统之。故曰心统性情。即此观之。心乃独处于性情之间者也。故心悟。则情可化而为理。心迷。则理变而为情矣。若夫心之前者。则谓之性。性能应物。则谓之心。应物而无累。则谓之理。应物而有累者。始谓之情也。故曰。无我而通者理也。有我而塞者情也。而通塞之势。自然不得不相反者也。如曰性相近也。习相远也。相近则不远复之谓也。相远。则不知复之谓也。不远复。根于心之悟也。不知复。根于心之迷也。故通塞远近悟迷。初皆无常者也。心悟。则无塞而不通。心迷。则无近而不远也。呜呼。心果何物乎。能使人为圣人。又能使人为众人。圣人与众人。亦皆无常者也。顾我善用心。不善用心何如耳。心之为物。不可以内外求。不可以有无测。内求不免计心于身内。外求则不免计心于身外。有求则不免计心于声色形骸。无求则不免计心于寂灭虚空。如是求悟心者。皆不善求者也。故曰离心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>参。若然者。若攀缘心不歇。则情根终不枯。情根不枯。则心意识终不能离。心意识不能离。则神不凝。神不凝。则不一。不一。则不能独立。不能独立。则有外。有外则有待。有待。则物我亢然。故触不可意事。不免勃然而怒。遇可意事。不觉欣然而喜。喜怒交战。寤寐无停。要而言之。不过总为心意识搬弄坏了也。故真参学者。寒不知寒。饥不知饥。劳逸相忘。形如枯木。心如死灰。方此之时。知得心意识无坐地处。如是积久。一旦根尘迥脱。常光现前。至此则心之内外有无。非内外有无。皆凭我说雌说黄。皆自然与修多罗合。所谓闭门造车。出门合辙是也。古德有云。不是死中发活一番。终是药汞银。触火必飞去矣。又曰不是一番寒彻骨。怎得梅花扑鼻香。此皆亲证实悟之样子也。年来<a href=\"/remen/chanxue.html\" class=\"keylink\" target=\"_blank\">禅学</a>与道学之徒。初不知心是何物。便泼口谈禅。孟浪讲学。一涉危疑。便丧胆亡魂。被境风吹坏了。娘生鼻孔。作不得一些主宰。实不如三家村里。一丁不识不知。但种田博饭吃人也。</p><p>　　龙树乃九地菩萨。其破四性。则曰诸法不自生。亦不从他生。不共不无因。是故说无生。如嗜欲浅而天机深者。一闻而能思。思而能精。精而遗闻。闻遗所脱。所脱则能消。能所既荡。虽处于境缘顺逆之中。应而无累。则多生种子现行。日损一日。损之又损。终至于无损。忽然契同。由是观之。则前之所谓根尘既消者。与夫忽然契同者。果一耶二耶。一则前不是后。二则舍前无后。而学者不愧推四性之不精。反疑龙树之偈无验。譬病重而不耐服药。见病不去。遂大怒而骂药无验也。夫治身病。必以神农为药师。治心病。亦必以龙树为药师。舍神农本草。虽华陀扁鹊不能治身病。而学者欲治心病。不以龙树破四性之偈治之。欲其病愈亦未之有焉。此偈予初闻而骇。既而疑。因痛思不已。用之境缘顺逆之际。多败绩。败愈多。战愈力。自是敢战而[拚-ㄙ+ㄊ]死。予始胜。噫。要知盘中餐。粒粒皆辛苦。若是种田人。闻此必泪堕。后生小子。理惑心浮。不知惭愧。业必不消。病难坐愈。加以闻诲生不受善之心。甘作护短之金汤。呜呼哀哉。我知龙树复生。耳提面命。不遭病者之唾骂。无有是处。</p><p>　　夫利刀出匣。光芒耀日。削铁如泥。凡梓楠松柏经其斫削。必皆成器。此善用刀者也。有等痴人。刀虽快利。惟用割泥。泥无所成器。刀刃日损。此不善用刀者也。譬如众生心性本妙。不以定慧观照。惟纵攀缘。奔尘莫返。流浪生死。幻苦愈深。了无出期。此岂善用心者哉。如利根上智。以心性之光。照破根境。两俱无性。定慧功成。即尘劳而得解脱。即情识而达智光。如是用刀。得非剖金削玉。凡所成器坚完不坏。满盛甘露遍洒一切。凡沾滴许。热恼清凉。得无量百千三昧。皆非外来。以心性本有故也。故曰善用其心。 八万四千烦恼。即八万四千三昧。不善用其心。八万四千三昧。即八万四千烦恼。嗟乎刀本无二。善用则无割不成。不善用者。刀日就损。</p><p>　　夫光有真妄。真则照万古而无待。妄则粘六尘而发光。故曰离暗离明。无有见体。离动离静。无有听质。通塞离而恬变丧。则嗅与尝。如粪中香。冰中火。合离离而生灭灭觉之与分别。则有名而无实矣。然尘之与根。必相资而有。相资而无。故因境生心。谓之粘妄发光。不因境生而孤明圆照。始谓之无待之光。无待则内外之情空。有待则内外之情封。情空性复。　情生性迷。故物能转物者。物为入路之资。所以情不烦遣而空也。老庞曰。我见石头。始得目前万境俱融。又曰日用事无别。惟吾自偶谐。盖此老以了知为火。烧空根尘。有待废而无待全。全则无外。无外则更无纤尘。为我障碍者也。曹溪闻客读金刚经。一闻应无所住而生其心。即根尘解脱而灵光圆。此谓之见道未明道也。故曰。尊其所知则高明。行其所知则光大。比来学道失宗。见道与明道。多混谈而不清。甚且不免认情为性。所以长沙岑大悲哀而说偈曰。学道之人不识真。只为从前认识神。<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来生死本。痴人唤作本来人。此实为天下认情为性者。顶门针也。夫夫乃男子之称。有男子之称。而无男子之实。所谓假男子。而实妇人也。如曹溪初本卖柴贫汉。一闻金刚经。便直下无疑。此真奇男子也。夹山回头。船子命断。则子疑父。而父不得不翻船矣。光甫汝既<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>持金刚经。于憎爱荣辱交加之际。若不能以曹溪所悟者痛治现行。则有待之情。终难复性。性不复。则三涂一报五千劫。乃光甫所当忧者。光甫勉之(示光甫)。</p><p>　　汉大傅疏广。上疏乞骸骨。帝赐黄金二十斤。太子赠五十斤。广归里中。日令家供具设酒食。请族人故旧宾客相娱乐。岁余金将尽。广子孙劝立产业。广曰。吾岂老悖。不念子孙哉。顾自有旧田庐。令子孙勤力其中。足以供衣食。今复增益之。以为赢余。但教子孙怠惰耳。况贤而多财则损其志。愚而多财则益其过。且夫富者众之怨也。吾既无以<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>子孙。不欲益其过而生怨。于是族人悦服。又庞德公释耕于陇上。而妻子耘于前。荆州刺史刘表指而问曰。先生苦居畎亩。而不肯受禄。后世何以遗于子孙乎。德公曰。世人皆遗之以危。我独遗之以安。虽所遗不同。未为无所遗也。表叹息而去。二翁皆世谛之贤者。其所见高明如此。吾曹为出家儿。不乞食自活。而贪人供养。横受非礼。究其咎之所自。不过图穿现成衣。吃现成饭耳。夫恶劳好逸。人之常情。衣不天降。饭不地涌。一衣一食。皆必出自劳勤。人劳勤而我安享之。计欲久享。而无患者无有是处。疏仲翁本汉廷老臣。赐金而不敢独享。与族人共之。即其子孙亦不得有。吾曹既处四民之外。乞食以资残喘。则外四民其谁为我檀施哉。檀施虽士农工商之不同。然寸丝粒米。皆出于劳勤也。其劳勤而得之。而欢然惠我者。为欲求忏其罪。与增其利益耳。倘我有僧之名。无僧之实。必不能自利利他。他生异世。须改头换面为畜生身。酬其惠施始得。如阎罗老子。许汝滑稽软顽。瞒得他过。则天堂地狱。五福六极之说。皆<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>也。如来圣人。岂为此妄语诳众生耶。且饮食男女。人之大欲。于此四者之中。果然立得脚跟定。何必避城市居山林乎。此就上一等僧说。盖其佛知见已开。佛悲愿已发故也。如此种僧。岂有供养之而不能雪罪与增利益哉。若佛知见虽未大开。悲愿虽未大发。但能诵佛之言。稍解其义。依解修行。此种谓之中等僧。如但诵佛言。不能解义。惟恐玷法门。勉强守戒。此种谓之下等僧。此三种僧虽浅深不同。皆非有名无实者。若人恭敬供养。必罪消福长。夫复何疑。外此三者。皆髡民。非僧也。汝向来虽祝发。而于僧之实。曾反思无愧否。僧实有愧。则外侮之来。实自取之。故老人特举西汉疏仲翁。东汉庞德公。兼上中下三种僧说以示汝。汝当刳其心。忘其形。痛哭读二三十过。则后来做好僧从今日始。(示隆东华严寺了凡)予读东坡观音赞。乃知东坡非迂儒所能仿佛也。东坡以为一身之微。八难萃聚。何异一丝悬九鼎乎。方此之时。身不待忘而自忘。身忘而世独不忘。无有是处。身世忘。则根与尘齐丧而无偶。根尘无偶。识自成智。智照灵源所忘流入。向所谓火坑刀山猛兽毒药。一切众苦。至此皆我入流之师也。故入流不难。了痛不痛为难。果当痛之际。痛究此痛。果生于根耶。外尘则无根。果生于尘耶。外根则无尘。外尘则无根。根乃尘家之根。根岂我有哉。外根则无尘。尘乃根家之尘。与根无二。无二则一。一则无外。无外则无待。至此唤什么作痛。若了不彻。觉有丝毫之痛。岂真无待哉。但众生于此不彻了。便与无待血脉断绝。无待血脉断绝。则有待血脉自续矣。有待血脉既续。横见心外有法。此非众生以二故。一身受众苦乎。苦极光回。直照无待。无待则无我。况有物耶。物我忘而照不枯。则灵源妙湛。遍洒焦枯。枯沾甘露槁而秀茂。此非若能真不二。即是观世音耶。</p><p>　　死生回环。爱憎为根。故我无心。则梦中天地人物。不烦遣而自空。空待天地人物而名。我无心时。虽空亦无地也。人为万物灵。不知此而他知。则灵者昧焉。所以寒暑迭迁。古今代谢。荣荣辱辱。死死生生。皆能劫我也。如灵不昧则伪心空。伪心空。则彼劫我者。岂待我建旗鼓。然后逃哉。人而知此。则千穷万变。我应之而不劳矣。</p><p>　　夫饥而食。寒而衣。此人之常情也。一旦辟谷而服水。苟非有大于生死者。吾欲求而得之。得之则死生虽烈。而不能祸福于我。如是则水可服也。如食虽辟。水虽服。而情根不枯。忍饥妄想。则服水不若吃饭为愈耳。吾闻服水之源。源于智积菩萨。菩萨以众生不得道者。昏散累之。服水则饥。饥则不能睡。不能睡。则醒多而睡少也。醒多而睡少。心持半偈。志专神凝。而妄想不生。妄想不生。则身心之执受。终将无地矣。故曰月在上方诸品静。心持半偈万缘空。缘空则我无偶。我既无偶。缘岂独有偶哉。噫。至此则固有常光。宁待生心而现前乎。沩山曰。灵光独耀。迥脱根尘。体露真常。不拘文字。文字根尘也。即此观之。辟食服水。初若细事。而收功之大。如未见独者。难与言也(示服水斋)。</p><p>　　佛言。凡三宝之地。办造饮食供养佛法僧之所。谓之香积厨。故办造饮食者。<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>不解。六味不辨。兼自己身口意三业不净。则办食之所。不名香积厨。谓之秽积厨矣。何谓三德。清净柔软<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>是。何谓六味。淡醎辛酸甘苦是。盖奉佛供僧之食。若不精洁。荤秽不拣。便失清净德。若不精细甘和。稍有粗涩。便失柔软德。若不随时措办。制造得宜。忽略纵情。兼未供流涎。便失如法德。又三德若无六味调和。亦不成就。盖淡味为诸味之体。醎味其性润。能滋于肌肤。故味之调者必以盐为首。辛味其性热。能暖脏腑之寒。故味之辣者为辛。酸味其性凉。能解诸味之毒。故味之酢者为酸。甘味其性和。能和脾胃。故味甜者为甘。苦味其性冷。能解腑脏之热。故味啬者为苦。汝等即三德六味。谛审观察。了知德之所以然。与味之所以然之说。加以无我无人无众生无寿者之心。率领六根四肢。勤勇善巧。办造饮食奉佛供僧。此人<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。假使以满虚空七宝。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>无量劫。不生疲厌悭吝之心。与相较量。其功德亦万不及一。何以故。三德无阙。六味无失。此等饮食。若触佛鼻。若入僧口。如嗅旃檀。如饮甘露。五内调和。百毛畅悦。身适心安。显资色力。冥资心力。色力得资则身康健。心力得资则神无扰。身康健则进道有资。神无扰则观智易成。凡饮食不如法。则身多病。心多扰。身心既病且扰。而能精进开悟者。无有是处。即此观之。修行人之性命。实系于厨中人之手。故厨中人三德不辨。六味不精。谓之牛头阿旁。杀人无外。如三德辨。六味精。更以无我无人无众生无寿者之心。率领六根四肢。如法办造饮食。奉佛供僧者。谓之大慈悲菩萨。故曰。三千诸佛。皆出在厨中。又为<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>悭吝。不尊贤敬贵。当来得饿鬼报。为常住破费。不察来处艰难。当来得贫乏报。又办造饮食。六根不谨。九窍放肆。四肢不净。当来得粪蛆臭虫报。如上所述。皆如来所言。若闻若见。当生惭愧。遵而行之。愚痴必破。般若必开。众罪必消。万福必集。现在身心安隐。当来得无上道。登菩萨位。佛言无诳。厨中<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。当体佛心。出苦有分在(示厨)。</p><p>　　夫清净本然。则无方所。云何忽生之后。山河世界列焉。自是则有方所矣。方有东西南北之名。有名则必有实。故西方属兑。东方属震。北方属坎。南方属离。华严善财童子。遍参知识。何故略三方而独询南方。得非南方离卦在耶。盖离中虚。虚则明。明则文。故曰离乃文明之象也。夫文字语言。必本于音声。音声又本于自心之虚灵。华严四十二字。字字包含义理无尽。诚以字本于声。声本于心。心乃我固有之虚灵也。且此四十二字。摄四十二位法身大士。因诸大士。皆处南方。故善财不惮百城烟水。境风逆顺。誓于百尺竿头。更进百步者。盖欲历尽诸大士门庭故也。呜呼。诸大士门庭岂易历哉。苟不能以理折情。则死生祸福之关。诚不易破。即首楞严五十五位真<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>路。自初信以至等觉。金刚道后。于四十二品无明。重重历煆。无明煆尽。而妙觉始圆。亦不出以理折情四字。良以理无我。情有我。善造道者。能以无我折有我。则有我日消。而无我日光。光则明。明则虚。虚则灵。灵则通。既通而灵。则我曹求无上道之能事毕矣。故善财余方不询。而独询南方者。盖离心之譬也。亦心外无法故也。既知心外无法。则目前万境顿融。万境融。而谓我独存者。则此我何异龟之毛。兔之角哉。藏子如荐此。始知问南。非问南也。乃问离也。非问离也。实问心也。噫。心不见心。岂可以心问心耶。悟则勿问。疑则别参○予读长沙岑禅师偈。始知认识神为佛性。以虚空为家乡者。不独近世有之。而季唐时已有之矣。盖此辈。但知日用昭昭灵灵之识神。便为佛性。殊不知唯见性者。识神即佛性也。而未见性者。佛性即识神也。即此观之。识神与佛性。固非两物。若未见性。则识神是识神。佛性是佛性。断不可儱侗而混说也。如混说之。则圣凡不分。悟迷不辨。圣凡不分。而白衣有妄坐龙床之罪。悟迷不辨。则众生邪正不明。是故<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>门中。教有性相。宗有照用。或信性而不信相。终陷断坑。或信相而不信性。必堕常阱。或信照而不信用。则情根难拔。枉逞口解。故沩山诃仰山曰。寂子汝莫口解。脱或信用而不信照。则狂魔入心。灭裂<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。欺视死生。以为知解。绝无毫厘之用。要在行得一分是一分。徒夸知解。于死生关头。终靠他一点不得。殊不知徒夸知解而不能行。固是病。若全无知解。而灭裂横行。则其病更大。故长沙老汉。哀愍是辈而说此偈。偈曰。学道之人不识真。只为从前认识神。无量劫来生死本。痴人唤作本来人。</p><p>　　苏子瞻曰。君子与小人之心皆正。君子与小人之肾皆邪。然君子能以理养心。故心行而肾从之。小人不能以理养心。故肾行而心从之。心行而肾从之。此邪从正也。肾行而心从之。此正从邪也。邪从正。则情消而理渐明。正从邪。则理昧而情渐流。情消而理明。则心将复于性也。理昧而情流。则心渐累于物也。心将复于性。则坤复干有日矣。心渐累于物。则坤终不能复干矣。盖干即理也。坤即情也。心之为物。以理养之则终复性。不以理养之。则渐将流于情矣。情如水。故以坠为性。理如火。故以焰为性。坠则必堕于污暗。焰则必升于高明。故污暗是肾之气分。高明是心之气分。心常近于理。肾常近于情。惟性也。处于理情之间。苟以正学之水浇灌之。则灵苗日茂。不幸以邪学之水浇灌之。则稊稗日长。灵苗。心之譬也。稊稗。肾之喻也。昔人有言曰。取将坎位中心实。点化离宫腹内阴。从此变成干健体。潜藏飞跃尽由心。此诗意谓性变而为情。干变而为离。坤变而为坎矣。则干之一阳。陷于坤之二阴。坤之一阴。处乎干之二阳。离。心之象也。坎。肾之象也。至人知其如此。故穷理尽性。则坎之一阳。可得复而为干也。离之一阴。亦当还其坤也。予以理观之。则坎离既济之说。乾坤反覆之机。本自了然。何必疑滞。而道家者流。或以铅汞名之。至于龙虎梨枣。婴儿姹女。种种名之者。不过劝人于此道。苟有志者。自然不厌其名相琐琐。困而求之。困近忘。忘则驰求心自歇。驰求心既歇。或于真人謦欬之间。一闻千悟。则知性既可变而为情。情独不可变而为性乎。情既可变而为性。则凡人而求为真人。亦非分外事也。自是情习渐除。道心愈固。情习既除。则离中之一阴将还坤矣。道心愈固。则坎内之一阳终复干也。纯阴消尽。纯阳复全。则能入水不溺。入火不焚。金石可以直度。虚空可以游行。故曰。从此变成干健体。潜藏飞跃尽由心。虽然此虽易知。实难行者也。盖众生情习纯熟。如油入面。苟非至明至勇者。欲面之出油。不亦难哉。</p><p>　　夫世界实有。则终不可碎。微尘实有。则终不可合。今则合微尘而为世界。碎世界而为微尘。卷舒无常。而合碎不昧。无常则多一情尽。不昧则合碎机存。情尽则理有而涂穷。机存则情枯而事显。是故大地虽坚。观等轻云。一身固爱。了如聚沫。形遗则神全。神全则念息。念息则心有而无生。形遗则身虚而有用。无生则灵而无我。有用则无我而灵。夫近取诸身。可谓亲矣。远取诸物。可谓疏矣。故衣食亲于房室。房室亲于田亩。田亩亲于众有之地。今迦文老人。呼须菩提而问之曰。碎 <a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>而为微尘。可为多乎。须菩提闻末知本。以为尘虽有多碎之名。初无多碎之实。盖外世界则无微尘。故以世界观微尘。尘本无尘。以微尘观世界。世本无世。呜呼。世界于我可谓疏矣。一身于我可谓亲矣。苟能因疏而悟亲。则饮食男女之欲。岂待宰割身心。竭力排遣。然后清净无累耶。虽然众生自无始以来。计四大假合之躯。必为我有。计四蕴合辏之心。亦必我有。执着不化。坚如大地。如油入面。欲其视坚成脆。观有即无。而天机浅者。固不易也。如徐无鬼一见武侯。便能转其常情。故使武侯炽然五欲之中。无量热恼顿化清凉。此非我忘而物遗。神合而形解者。孰能至于此。然不若点疏而悟亲。方省伤锋犯手之喘。即此观之。天机深浅。则悟有先后。故见过而讼。输于颜氏。又知人者智。自知者明。颜氏非自知之明。则过亦不易见。非力行之勇。则过亦不易讼。吾与二三子。多生有般若之缘。适有此聚。秋风既高。行色摇摇。此别之后。志各坚牢。自度度人。泛舟惊涛。一呼而上。谁非杰豪。三呼不应。我涕沾袍。念其同体。无损秋毫。背本逐末。竛竮悴憔(示弟子)。</p><p>　　夫知废则觉全。知立则觉隐。隐则昧。昧则无往而非障也。至于色之障眼。声之障耳。香臭之障鼻。味之障舌。触之障身。法之障心。所以根尘汩然。常浊而不清矣。呜呼。我之灵台本来空清。以种种障之。自是空者不空。清者不清。空者不空。则于无色处横谓有色。无触处横谓有触。无身处横谓有身。无心处横谓有心。身心备。则死生好恶不召而至焉。此何以故。以知立觉隐故也。夫知也者。已发而昧中者也。觉也者。发而中节。而不昧中者也。昧中则不和。不和则何往而非率情也。情有私而性无我。故率性则何往而非灵。古德曰。无我而灵者性也。既曰无我而灵。所谓色声香味触法。眼耳鼻舌身意。此十二者。果有障乎。果无障乎。有障则有我。有我则不灵。所以根根尘尘。皆成我障。唯见性者。了知性外无心。心外无法。以故种种。凡为我障者。不烦观空而后空。澄清而后清。所谓本来空清者。如天廓云布。未始不昭然者也。觉慈来前。吾语汝。若果能觉。则无往而不慈矣。慈则视物之生。即我之生。不觉则我生非物生。物生非我生。抗然两立。两立则分别起。分别起。则好恶不期私而私矣。私则谓我生可贵。物生可贱。戕物之心。莫知其然而生焉。此心果慈乎。果不慈乎。汝若知此。则觉自全。知自废。觉全则无不照。知废则无不公。公则自然无我。无我而行慈。此所谓觉慈也。觉慈勉之(示觉慈)。</p><p>　　夫众人之与圣人。初非两人也。圣人人也。众人亦人也。然圣人则无往而非率性。众人则无往而非率情。率性则惺寂双流。率情则昏散齐骋。惺寂双流。则根尘空。而不废能所之用。昏散齐骋。则根尘障而昧一真之体。故我永嘉大师。于无门之中。开此十门。门虽次第。理实一条。譬之珠虽有数。线本一条。故心通理达者。门无不历。浅深不同。然其究竟不越乎理即也。天台智者大师。有六即之科。一理即。二名字即。<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>行即。四相似即。五分真即。六究竟即。此六即精而明之。则楞严五十五位真菩提路。不烦遍探。而其要领在我矣。觉皮来前。吾语汝。汝当谛听。此集乃永嘉祖师心髓也。始由读读而诵。诵而持。持而精。精则一。一则独立。独立则物我平等。古今一条矣。嘻。人为万物之灵。不此精而他精。非愚则狂也。觉皮勉之(示觉皮持永嘉集)。</p><p>　　夫般若有三种。所谓文字般若。观照般若。实相般若是也。又此三般若。名三佛性。缘因佛性。了因佛性。正因佛性是也。嗟乎。娑婆教体贵在音闻。有音声然后有文字。有文字然后有缘因佛性。有缘因佛性。然后能熏发我固有之光。固有光开。始能了知正因佛性。在诸佛不加多。在众生不加少。如是了知。谛印于心。然后于境缘逆顺之冲。荣辱交加之际。以此印光。印破诸境。根尘脱而常光现。然后持此常光。普照一切。自利利他。愿轮无尽。则菩萨能事毕矣。即此观之。娑婆界中。苟无文字般若。则观照般若无有开发。观照般若既不开发。则将何物了知正因般若。所以<a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>。五千余言。字字放光。句句日月。又若明灯。日月照不及处。灯能继焉。是故若人能持金刚般若经者。终必见性。如曹溪六祖。本是卖柴穷汉。一闻金刚般若经。应无所住。而生其心。便即开悟。又正因佛性。如木中之火。了因佛性。如火发而能烧木者。缘因佛性。如钻燧木。木虽有火。不因钻燧烟终不生。烟既不生。安能发火。火既不发。将何烧木。木若不烧。终难复土。故木也者。欲升而不能终升之物也。然微土则无木。木因土生。火发而木化。元还于土。此木之终也。噫。性变而为情。犹土生木也。情熏而复性。犹木还土也。觉声知此。痛持此经至千万遍。持熟情消。情消云尽。则性天廓布。岂待觉声瞠眼。然后始见者哉。觉声勉之(示觉声持金刚经)。</p><p>　　眼前世界若果实有。则真如未随缘时。世界众生初皆本无。以初本无故。终亦无有。初始与终。既皆无有。必谓现前独有。此情也。非理也。譬如热时焰日未出与日没。皆无此焰必谓是水。计以止渴。此鹿之痴也。鹿若不痴。安肯奔逐。众生不痴。安肯分别。故法喻同观。两头既无。中间岂有。理如函盖合。现在何分别。分别既不生。光消影亦灭。逆观分别时。能所梦中雪。开眼日在窗。梦雪不可得。量及所量空。根尘初不恶。此理也。非情也(示开先)。</p><p>　　师曰。自一精明。分成<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>合。则眼等与六尘和合。从无始以来。我不能须臾离者也盖开眼与醒中色尘和合。合眼与梦中色尘和合故也。即此观之。则六根与六尘和合。若醒若梦。尘尘相受。自无始以来。至于今日。无有<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>顷。而不和合者明矣。又眼根与色尘和合之见。谓之有待之见。眼根不与色尘和合之见。谓之无待之见。有待之见。必缘明而有。明灭则不能见。无待之见。则不因明而有。处暗室中。不异白日也。故<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>曰。缘见因明。暗成无见。不明自发。则诸暗相。永不能昏　本朝楚石琦禅师。阅楞严经至此。遂大悟。根与尘初不相到。但众生横计未消。于无明暗中。横见明暗耳。教中谓之非量。非比量<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>也。此横见以非量用之者。以<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>。不能检名审实。精义入神。从由尘发知之知。知奔前境。故被好丑所转。如此知。苟能了好丑明暗之影。因根有相。则明暗之影。亦初本无性。既了明暗之影。初本无性。则由尘发知之知。岂独有性哉。行者于日用中能作是观察。以理折情。此方谓之比量也。如是观察久渐成熟。熟则见思爆落。则行者始入相似位矣。此相似位。在藏通二教。皆是佛位。非菩萨罗汉位也。在圆教但名相似位耳。别教即七住位。行者至此位。则眼可以观声。耳可以闻色。鼻舌与身。皆可以互用矣。若然者。则眼耳鼻舌身。五根照境时。若第六识未起。则五根之精。如镜之光。好丑虽明了。无分别也。此无分别者。谓之现量。故永明曰。初居圆成现量之中。浮尘未起。后落明了意根之地。外状潜形。浮尘与意根。皆指第六识而言也。又非量者。恣情横见。不能以理折情之谓。比量者。行者能于缘因佛性之海。检名审实。实审则义精。义精则理通。理通则情不能昧。我得比拟而用之。至此谓之有心观察。乘理折情故。以比量目之。比量即无尘智也。无尘智熟。方得相似无心。未得真无心也。此理稍明教观者。皆能了了。不待老汉雌黄饶舌。虽然如是。老汉此段热肠。自有大阐提知在。又缘见因明之见。虽谓之有待之见。能以由尘发知。因根有相。互夺而痛观之。观之有入。则所不待忘。而所未常有累于见精也。但行者此观不熟。情屈其理。理不能信。所以智通之信不开。故不能出依通之信。恒被情屈也。如善观之。则知明暗自相陵夺。本与见精了无交涉。故永嘉曰。一切数句非数句。与我灵觉何交涉。老汉则曰。一切明暗非明暗。与我见精何交涉。于楞严会上。佛敕罗睺罗。击钟验常。亦此理也。盖闻精初不因钟声生而生。亦不因钟声灭而灭。声尘动静。自相陵夺。亦与闻精初无交涉也。第庆喜计现前能推穷分别之心。未破于见精。闻精卒不能了了故。佛特敕罗睺罗击钟。佛意欲借声尘动静起灭。令阿难即动静起灭处。会无动静起灭者。如香严见沩山时。沩山曰。闻汝一问则能十答。我问汝父母未生前。试道一句看。香严屡答。皆不能凑沩山之机。乃乞沩山代答一语。沩山曰。我道得是。我之三昧。与汝有何交涉。于是香严尽弃所学。涕泣而行。且曰。我终身作个长行粥饭僧罢了。及住庵。粪除瓦砾。适闻击竹声。则所知顿忘。洞契自心。于是向沩山大展而礼曰。当时和尚。若为我说破。安有今日。严有偈曰。一击忘所知。更不假修持。动容扬古路。不堕悄然机。噫。如香严者。所谓从缘荐得。永无退失者也。由是而观。则香严之所知。即庆喜能推穷寻逐之心耳。此心即由尘发知之知。此知不忘。则智通之信终不能入。智通之信既不能入。饶汝谈玄说妙。辩齐佛祖。不过依通之信而已。又由尘发知之知。乃香严未见沩山之时。能所心也。此能所心。虽沩山号称大善知识。卒不能使其忘之。须待严闻击竹声。自忘始得。故此事决不可以情求者也。盖情求不出乎根尘妄想。如能了达根尘无性。则由尘之知。亦自可忘也。又香严谓之自诚而明。若依教理折情治习。而有所入。谓之自明而诚。昔有祖师问僧曰。隔壁闻钗钏声。即是<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。汝作么持戒。僧曰。好个入路。此僧得入。与香严之入。果同耶。果异耶。同则钗钏声。不是击竹声。异则钗钏声。固不是击竹声。然卒无有二也。行者于此辨得雌雄。则一精明。分成六和合。六和合。复成一精明。捏聚放开。任汝施为。若辨不得。古人有一颂。汝辈再咬嚼去。果然咬嚼得破。再来见老汉未晚也。颂曰。不汝还者复是谁。残红留在钓鱼矶。日斜风定无人扫。燕子衔将水际飞(示开先)。</p></div>"
}]