[{
    "title": "第1659部 七俱胝佛母所说准提陀罗尼经会释",
    "author": "宏赞 译",
    "html": "<div class=\"B1_text\"><p>　　七俱胝佛母所说<a href=\"/remen/zhunti.html\" class=\"keylink\" target=\"_blank\">准提</a>陀罗尼经会释卷上</p><p>　　唐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师大广智不空奉　诏译</p><p>　　清[(奥-釆+米)-大+ㄎ]东鼎湖山<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>弘赞　会释</p><p>　　按如来一代<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。教分三藏。所谓修多罗。毗奈耶。苏怛[缆-(罩-卓)]。即经律论也。藏虽分三。而不出显密二门。显则广谈性相。晓悟玄理。<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>法身。密乃但令诵持。不加了知。默登圣位。然悟有顿渐。位有浅深。渐则历诸僧祗。顿即立超十地。浅则声闻缘觉<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。深即现证<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>大乘。今此准提陀罗尼。即<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>密教。默证十身佛果大乘也。或于三藏外。立一杂藏。收诸部陀罗尼。或于三乘外。别立最上金刚乘。即是陀罗尼藏。若据神变疏。则判陀罗尼为大不思议<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a><a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>乘。故此经以大秘密为宗。法界真如为体。不思议为用。三密为门。最上乘为教相。以一切法。皆从金刚陀罗尼乘中流出。如千流万派。发自昆仑石碛之山。三藏十二分教。出乎总持秘密之藏。乃至<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行。莫不从陀罗尼所出。谓<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>一一字。全是<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>法界。而六度万行无不从法界中流出。故云。唵字者。是三身义。亦是一切法本不生义。由一切法本不生故。即得不生灭。由不生灭故。即得相无所得。相无所得。即是无相法界。实则证法界真如。故白伞盖颂云。诵满一万八千遍。遍遍入于无相定。号成坚固金刚幢<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。得名人中佛。又五秘密<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>云。金刚萨埵者。是普贤菩萨。即一切如来长子。是一切如来菩提心。如经所说。金刚萨埵三摩地。名为一切诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。此法能成诸佛道。若离此法。更别无有成佛。欲知金刚者。名为<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。能通达一切佛。无滞无碍。犹如金刚。是故。出生诸佛。若于显教修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。久经三大无数劫。然后证成无上菩提。于其中间。十进九退。或证七住。以所集福德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>声闻缘觉<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。仍不能证无上菩提。若依毗卢遮那佛。自受用身所说。内证<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>圣智法。及大普贤金刚萨埵地。受用身智。乃至应时集得。身中一大阿僧祇劫。所集福德智慧。则为生在佛家。其人从一切如来心生。从佛口生。从佛法生。从法化生。得佛法财。从此已后。受得广大甚深不思议法。超越二乘十地。是知真言秘密之旨。尚非因位菩萨所知。况容凡夫小智能测。兹会众译并诸疏钞。略为互相发明。以便初学持诵。有所措心。非敢曰释。如神变疏云。金刚手方可探其[(厂-一)*臣*页]。莲华眼始能窥其奥。首楞严云。诸佛秘密法。唯佛与佛。自相解了。非是余圣。所能通达。但持诵之。能灭大过。速登圣位。天竺<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>云。上圣方能显密两说。凡人但能宣传显教。不能宣传密教。故非下凡所议。师心可知。今按此准提真言。前后数译。而不空三藏。深得密教之传。由昔金刚萨埵。亲于毗卢遮那牟尼如来前。受瑜伽最上乘义。后数百年。传于<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>。龙树又数百年。传于龙智阿阇黎。龙智传于金刚智法师。金刚智来游震旦。以五部瑜伽。及毗卢遮那经。苏悉轨范。授与不空三藏。及智灭度。三藏奉其遗教。复游天竺诸国。增广其学。于师子国。从龙智阿阇黎。求开十八会金刚灌顶。及大悲胎藏之法。法化相承。自毗卢遮那如来。至于不空三藏。凡六叶矣。空既遍游天竺。复得亲传之旨。故其所译本。真言仪轨。委悉详备。今恐初学未闲<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>印契。由是于诸译中。多取智所译本而会明之。以其师资相承。授受无替故也。</p><p>　　如是我闻。</p><p>　　谓如来如实相理。说是准提陀罗尼法。故云如是。阿难尊者。亲从佛闻如是之法。故云我闻。</p><p>　　一时。</p><p>　　是说此经之时也。</p><p>　　薄伽梵。</p><p>　　此是如来众德至尚之称。具六种义。一自在。二炽盛。三端严。四名称。五吉祥。六尊贵。广如余处释。</p><p>　　在名称大城。</p><p>　　梵言舍卫。</p><p>　　逝多林。</p><p>　　旧云祇树。谓林树是祇陀太子所施也。</p><p>　　给孤独园。</p><p>　　给孤独。是须达长者之别名。园是长者布金所买之地。二人共施。故名合称也。</p><p>　　与大苾刍众。并诸菩萨。及诸天龙八部。前后围绕。</p><p>　　此是听法之众。</p><p>　　愍念未来薄福恶业<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。即入准提三摩地。说过去七俱胝佛。所说陀罗尼曰。</p><p>　　愍念。谓如来悲愍慈念众生也。梵语三摩地。华言等持。谓定慧平等任持者也。俱胝。华言百亿。陀罗尼。华言总持。谓总持一切法门。含摄无尽教理行果。又持善不失。持恶不生。故亦翻为遮持。谓遮二边之恶。持中道之善。别名为咒。元非正翻。既含多义。故非名言所能宣释。究其实。乃毗卢遮那如来诸佛。大不思议秘密心印也。</p><p>　　曩谟飒多(引)南(引)(一)三藐三没?(引)俱(引)胝南(引)(二)怛你也(二合)他(引)(三)唵(四)者礼(五)主礼(六)准泥(七)莎嚩(二合)(引)贺(引)(八)</p><p>　　凡诵真言唵字当引。句须分明。声要不缓不急。详如下释。</p><p>　　此真言八句。上三句。是归敬诸佛说咒之辞。下五句。正是咒体。言引者。谓长引其声。二合者。谓二字合为一音。金刚智译作折[(上/矢)*(入/米)]主[(上/矢)*(入/米)]准提莎嚩诃。其上多字南字。皆有口傍。[(上/矢)*(入/米)]字去声○地婆诃罗译作折戾主戾准提莎婆诃○阇那岌多译作折丽主丽准递莎诃○天息灾译作曩莫飒钵哆喃。三藐讫三没?句致喃。怛你也他。唵。左[(上/矢)*(入/米)][(上/矢)*(入/米)]噂祢。娑嚩贺。莫字入声。钵哆字二合。他字去声。唵字。及两[(上/矢)*(入/米)]字皆引。噂字上声。祢字引。余并同上。法贤译。大同天息灾。初句皆同。次句讫三字二合。祖字尊字无口。此中诸译不同。皆由梵音有轻重之转。故字不一。然既梵音。即取字之音。不取字之义。若其善梵音者。诵上诸译。而无有异。任取一译诵之。但于梵音不讹者皆得也。凡是口傍字者。须弹舌道之。即得其音矣。曩谟。或作娜么。或作纳莫。或作南无。华言归命。亦云<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>。怛你也他。华言所谓。亦言即说。莎嚩贺。译为成就义。亦云吉祥义。亦云圆寂义。亦云消灾增益义。亦云无住义。即是无住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。尽未来际。利益有情无尽期故。</p><p>　　若有修真言之行。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>在家菩萨。诵持此陀罗尼。满九十万遍。<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>造十恶。五逆。四重。五无间罪。悉皆消灭。所生之处。常遇诸佛菩萨。丰饶财宝。常得出家。</p><p>　　十恶者。谓杀。盗。淫。妄言。绮语。两舌。恶口。贪。瞋。邪见。四重者。谓破四禁戒。杀盗淫妄也。五逆者。一弑父。二弑母。三出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。四弑阿罗汉。五破和合僧。若造一逆。即堕阿鼻<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。一劫受苦。具五逆者。故云五无间罪。梵语阿鼻。此云无间。谓堕此狱中。一大劫受苦。无弹指顷间歇也。</p><p>　　若是在家菩萨。修持戒行。坚固不退。诵此陀罗尼。常生天趣。或于人间。常作国王。不堕恶趣。亲近贤圣。诸天爱敬。拥护加持。若营世务。无诸灾横。仪容端正。言音威肃。心无忧恼。若出家菩萨。具诸禁戒。三时念诵。依教修行。现生所求出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>悉地。定慧现前。证地波罗蜜<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。疾证无上正等菩提。</p><p>　　在家菩萨。奉持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。十善。菩萨大戒。故云修持戒行。出家菩萨。俱持<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a><a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a><a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。菩萨木叉。故云。具诸禁戒。出世间悉地者。即定慧现前。乃至证无上正等菩提是也。悉地。此云成。意谓成就世出世间。所求大愿。由含多义。故无正翻。言证地者。释陀罗尼云。瑜伽中。从凡至圣。总为四地。一胜解行地。通目地前。二普贤<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>地。通目十地。三大普贤地。即等觉地。四普照曜地。即成正觉地。亦云成毗卢遮那三身普光地。波罗蜜者。谓<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。及十波罗蜜。大乘宝王等经云。持诵真言行者。日日得具六波罗蜜圆满<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。故诸陀罗尼经。说真言行者。现世能成无上菩提。五字陀罗尼颂云。诸佛本誓力。现成诸圣事。即于一座中。便成最正觉。</p><p>　　若诵满一万遍。</p><p>　　智译云。十万遍。</p><p>　　即于梦中见佛菩萨。即吐黑物。</p><p>　　黑物表恶业。即吐。是罪灭福生之相。故自见口中吐出黑物。或云黑饭。</p><p>　　其人若罪尤重。诵二万遍。</p><p>　　余译云。二十万遍。亦见自口中吐出黑饭。</p><p>　　即梦见诸天堂寺舍。或登高山。或见上树。</p><p>　　不为罪业所累。故能升蹑。成就善因。故见天堂寺舍。</p><p>　　或于大池中澡浴。</p><p>　　涤除罪垢。得清净身。</p><p>　　或见腾空。</p><p>　　不为罪业所缠。故身轻举。</p><p>　　或见与诸天女娱乐。</p><p>　　谓与慈善根力相应。故见与之娱乐。</p><p>　　或见说法。</p><p>　　得示教利喜也。</p><p>　　或见拔发剃发。</p><p>　　拔发。是西国外道之法。拔发剃发。皆表断除<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>根株也。智译云。或见拔发。自身剃头。</p><p>　　或食酪饭。饮白<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。</p><p>　　食酪饭。是成就世间福善。饮甘露。谓得出世法味。</p><p>　　或渡大海江河。</p><p>　　得越<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。</p><p>　　或升师子座。</p><p>　　谓得法王之座。</p><p>　　或见菩提树。</p><p>　　是见道相。</p><p>　　或乘船。</p><p>　　是乘般若船。得登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>之相。苏悉地经云。或见乘师子象牛鹿鹅等。皆是悉地成就之相。</p><p>　　或见沙门。</p><p>　　得离世染。而出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。</p><p>　　或见<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>。以白衣黄衣覆头。</p><p>　　黄表正。白表净。以白净<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。而覆护之。智译云。以衣笼覆其头。</p><p>　　或见日月。</p><p>　　表破无明烦恼暗也。</p><p>　　或见童男童女。</p><p>　　不为贪欲烦恼所染也。</p><p>　　或上有乳果树。</p><p>　　乳者白义。白者善业。谓得世出世间善业<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>也。</p><p>　　或见黑丈夫。口中吐火焰。共彼斗得胜。</p><p>　　谓与瞋烦恼魔共战得胜。</p><p>　　或见恶马水牛。欲来抵触。持诵者。或打或叱。怖走而去。</p><p>　　谓于痴烦恼魔得胜故也。</p><p>　　或食乳粥酪饭。</p><p>　　谓得上味福善成就。</p><p>　　或见苏摩那华。</p><p>　　华言称意华。色黄白。而极香。树高三四尺。下垂如盖。谓表所求善法。必得称意。智译云。或见有香气白华。香表五分法身之香。谓得五分善业。</p><p>　　或见国王。</p><p>　　谓得大人护念。获尊贵胜业也。</p><p>　　若不见如是境界者。当知此人前世造五无间罪。应更诵满七十万遍。即见如上境界。应知罪灭。即成先行。</p><p>　　此令诵七十万遍。上言一万二万疑误。应如余二译云。十万二十万为当。如上所梦境界。皆是行者证验成就之相。苏悉地经云。于其梦中。见真言主。背面而去。或不与语。当应更须起首念诵。如是再三。若梦中见真言主与语。当知此人。不久成就。若无境界。不应诵持。若强念持。恐与人祸。初持诵时。于净密处起首。</p><p>　　然后依法画本像。(谓准提本尊像)或三时。或四时。或六时。依法<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。求世间出世间悉地。乃至无上菩提。皆悉获得。若有修持此陀罗尼。当知未来成就处所。有难无难。悉地迟疾。应于净室。以瞿摩夷。涂一小坛。随力供养。以结界真言。结十方界。(四方四维上下)以香水一瓶。置在坛中。一心念诵。其瓶动转。当知所为所求事成就。若不动转。其事不成。</p><p>　　结界真言。如下结地界。墙界等出。智译云。若于佛像前。或于塔前。若清净处。以瞿摩夷涂地。而作四肘方坛。复以香华。幢盖。饮食。灯明。烛火。随力所办。依法供养。若欲求愿。先须念诵。加持香水。散于八方。上下结界。既结界已。于坛四角。及其中央。各置一香水之瓶。行者面向东方互跪。诵一千八十遍。其瓶即便自转。随意东西。任以上下。诃罗译云。咒香水散于四方上下。以为结界。于坛四角中央。各置一香水瓶。持咒者于其坛中。面向东方胡跪。诵咒一千八十遍。言加持香水者。当诵根本真言三七遍。十方洒之。</p><p>　　又法。取一瓦碗。以香涂。置于坛中。专心念诵。碗若转动。事即成就。若不动。事即不成。</p><p>　　智译云。以净瓦钵。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>熏之。内外涂香。盛满香水。并好香华。置坛中。依前瓶法。而作念诵。其钵即转。与瓶无异。若欲得知一切成就。不成就事。即烧香发启白圣者。愿决心疑。若右转即成就。若左转即不成就。</p><p>　　又法。欲知未来之事。先涂一小坛。令一具相福德童子。澡浴清洁。着新净衣服。以七俱胝真言加持香。涂童子手。又加持华七遍。置童子手中。令童子掩面。立于坛中。又取别华。诵真言加持。一遍一打童子手背。乃至二十一枚。即问童子<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之事。童子皆说。</p><p>　　智译。令取好华。念诵一百八遍。以香末涂童子手。捧华掩面。复自手。更取别华念诵。掷童子身。</p><p>　　又法。取一明镜。置于坛中。先诵真言加持华。一百八遍已。然后又诵真言。一遍一掷打镜面。于镜面上。即有文字现。说善恶事。</p><p>　　智译。或使者即身现镜中。使者即佛母之使者。</p><p>　　又法。欲知事善不善。成就不成就。取苏摩那华香油。诵真言加持一百八遍。涂右手大拇指面诵真言声不断绝。令童子观指面上。现诸佛菩萨形像。或现文字。具说善恶。</p><p>　　智译云。或以朱砂。或以苏摩那华。浸胡麻油中。涂拇指甲。念诵一百八遍。即现天神。及僧菩萨佛等形像。若心有所疑三世中事。一一问皆知。即拇指上自现。</p><p>　　又法。若人患鬼魅病。取杨柳枝。或茅草。诵真言。拂患者身。即得除愈。</p><p>　　诃罗译云。以咒咒茅拂病人。得香茅第一。不得。直茅亦得。智译云。以石榴枝。白茅香等草。念诵鞭拂之。</p><p>　　又法。若患重病者。诵真言一百八遍。称彼人名。以牛乳护摩即瘥。</p><p>　　谓以茅草等捏乳。诵咒作法。掷火中烧之。名为护摩。智译云。以茅草置酥中。念诵七遍。掷着火中烧之。令烟熏病人即愈。所言酥者。谓以牛乳钻炼成酪。酪钻成生酥。生酥钻成熟酥。熟酥钻成醍醐。</p><p>　　又法。若孩子夜啼。令童女右搓线。诵真言加持。结二十一结。系于颈下。孩子即不夜啼。</p><p>　　余译云。令童女合五色缕。一咒一结。满二十一结。与病人。小男女等。颈上系者。恶魔鬼魅等病。即得除瘥。</p><p>　　又法。先加持白芥子。一百八遍。然后取芥子诵真言。一遍一掷打彼鬼魅者。满二十一遍。其鬼魅驰走。病者除愈。</p><p>　　智译云。或以白芥子置酥中。取芥子少许。念诵一遍。一掷火中。如是二十一度。病即除愈。</p><p>　　又法。或有患鬼魅。以瞿摩夷。涂一小坛。以麸炭画地。作鬼魅形。诵真言。以石榴等杖鞭之。彼鬼啼泣。驰走而去。</p><p>　　智译。作法同此。诃罗译。令于病者前。以墨画其病人形。咒杨枝打此画形。亦得除瘥。瞿摩夷。此云牛粪。</p><p>　　又法。若人被鬼魅所著。或复病者身在远处。不能自来。或念诵人。又不往彼。取杨柳枝。或桃枝。或华。加持一百八遍。使人将往病人所。以枝拂病人。或以华。使病人嗅。或以华打病人。鬼魅即去。病者除瘥。</p><p>　　智译云。遣人将去语彼云。汝去。某甲遣将此枝鞭汝。汝若不去。损汝无疑。若不去。鞭之即去。</p><p>　　又法。若被蛇所啮。或拏吉你女鬼所持。旋绕病人。诵真言。其病即愈。</p><p>　　谓绕诵病人数匝。即愈。</p><p>　　又法。若人患痈肿等。及诸毒虫所啮。取檀香汁和土为泥。诵真言七遍。涂疮上。即愈。</p><p>　　智译令取熏睦香和净水土。涂丁疮痈疖癣漏即愈。</p><p>　　又法。若人在路行。诵此真言。不被贼劫伤损。亦离诸恶禽兽等难。</p><p>　　智译云。若在路夜行。念诵不缺。无有贼盗虎狼恶鬼等。怖畏难处。持心念诵。并作护身。彼等诸难。即皆自灭。若乞食时。常持此咒。不为恶人恶狗等类。之所侵害。乞食易得。</p><p>　　又法。若斗诤。言讼论理。及谈论求胜者。诵此真言。强胜。</p><p>　　准提真言。如金刚杵。拟物皆碎。无敢当者。故于诤讼理论。谈说名言法义。无不获胜。</p><p>　　又法。若于江河中行。诵此真言。不被漂?。及水中恶龙。摩竭。鼋。鼍等。伤害。</p><p>　　摩竭。此云鲸鱼。长十余里。或数百里。能吞大舟。等者。谓诸毒虫蛇类也。智译云。或蛇咬。即遣彼人。围绕念诵人数匝。即愈。</p><p>　　又法。若被囚禁系闭者。诵此陀罗尼。速得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。</p><p>　　菩提心体。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>空故。离一切物。犹如莲性。不为垢染。今此陀罗尼。从诸佛菩提心流出。故持诵者。自然速得解脱。</p><p>　　又法。若国中有疾病。十夜以油麻。粳米和酥蜜。作护摩。即得灾灭。国土安宁。</p><p>　　智译云。或国土水旱不调牛马六畜等疫毒流行。应以油麻。大麦。粳米。粟。豆。酥。蜜。乳。酪。白乳木。诸杂香等。皆置一边。烧香发愿。为一切众生除去灾难。即作手契护身念诵。取前诸物。念诵加持。掷着火中烧之。如是七日。日别三时作法。时别一千八十遍。即得满愿。一切安乐。一切<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>悉皆护念。亦能成就一切大愿。诃罗译云。应以酥和胡麻粳米。用手三指。取其一撮。咒之一遍。掷火中烧。或经七日七夜。六时如是相续不绝。一切灾疫。无不消灭。言手契者。谓手结印也。</p><p>　　又法。若求丰饶财宝者。每日以种种食护摩。即得财宝丰饶。</p><p>　　智译云。若求富饶。以粳米油麻置酥酪中。手把少许。发愿念诵七遍。掷着火中烧之。随力七日。乃至七七日。即如其愿。诃罗译云。以酥和稻谷。咒一百八遍。火中烧之。随心所愿。无不成谛。财宝增盈也。言护摩者。即是以前诸物。掷着火中烧之。以为供养。苏悉地经云。于尊像前。作护摩炉。顶方一肘。四面安缘。量深半肘。缘高四指。以牛屎和牛尿涂。用香水洒。或作圆炉。其念诵之处。若在房室。应出于外。望见尊像。而穿作炉。随其事业。依法作之。乳木等物。及以香华。置于右边。护摩器皿。置于左边。坐茅草座。摄心静虑。先诵本尊真言一遍。请安本座。依法供养。愿尊垂纳护摩之食。其护摩木。有十二种。此方无有。可用紫檀。或坚实乳木代之。取其枝端直者。量长两指。或云十指。皆新采湿润者。观其上下。一面置之。香水净洗。细头向外。粗头向身。以乳酪酥蜜揾两头。掷于炉内。如念诵时。置两手在双膝间。护摩时亦应如是。护摩毕。用本真言净水。以手远巡散洒炉中。如是三度。护摩都了。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>发遣。若以酥蜜油作法。当用杓。至娑嚩贺字。余声未尽。即潟炉中。初以一杓满酥。护摩一遍。中间小杓。护摩毕。还以一杓满酥。护摩一遍。重献阏伽。乃至供养。准前重作护身等印。乃至解界。方可发遣。如下所明。</p><p>　　又法。欲令人敬爱<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>者。真言句中。称彼人名。即得欢喜顺伏。</p><p>　　诃罗译云。称彼前人名字。一咒一称。满一百八遍。即便敬念。</p><p>　　又法。若无衣。念诵即得衣。</p><p>　　又法。意中所求。念诵皆得如意。</p><p>　　准提真言。是诸<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>宝。如摩尼珠王。随众生念。故云皆得如意。</p><p>　　又法。若人身体肢节痛。加持手二十一遍。摩触痛处。即瘥。</p><p>　　若自为。若为他。皆得。</p><p>　　又法。若患疟。及头痛。以加持手二十一遍。摩触亦得除瘥。</p><p>　　此等皆谓已成就先行。或长持诵准提真言行人。故得随手应物悉验。若初诵行人。梵音未淳。心不专一。反谤无验。获罪弥深。</p><p>　　又法。涂一小坛。取一铜碗满盛净灰。令童子两手按灰碗上。持诵者。应诵真言。本尊使者。入童子身。其碗即转。即下语。童子即自结三部<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>耶印。诵三部真言。即取滑石。过与童子。童子即于地上书过去未来事。吉凶善恶。及失脱经论。废忘难义。真言印。即得知解。</p><p>　　此中不言遍。应是百八遍。或持至童子自结印咒为限。</p><p>　　又法。两军相敌。于桦皮上。书此陀罗尼。悬于竹竿上。令人手把。诵真言。彼敌即破。</p><p>　　已上数条。余译俱缺。</p><p>　　又法。若女人无男女。以牛黄于桦皮上。书此真言。令带。不久当有男女。</p><p>　　智译云。于桦皮叶上书此陀罗尼。并画童子。以紫彩裹之。念诵一千八十遍。安着?中即孕。或曰诸佛本意。令人断贪瞋等诸烦恼。今何却令人起贪念。求于世事名利等耶。答曰。此是诸佛不思议力。度生方便之妙用。若有众生不肯直求无上菩提。且随其所欲。令持咒求之。尽得遂心。由是神咒不思议力熏。罪业消灭。菩提种成。自然超凡入圣。如此真言。诸佛境界。十地菩萨。尚非其量。况凡夫人。而得思议哉。若具智眼者。须终日求。而无能求所求之相。即与般若相应。故非佛纵众生起贪等烦恼也。</p><p>　　又法。或有女人。夫主不敬重。取一新瓶满盛水。于瓶中着七宝。及诸灵药。五谷。白芥子。以缯帛系瓶项。以真言加持一百八遍。令女人结根本印。安顶上。以水灌顶。即得宠爱敬重。非但敬重。亦得有子息。在胎牢固。</p><p>　　智译云。取净瓶盛满香水。别置净处。以牛粪涂作坛。念诵一百八遍。如是七瓶。皆作此法。于净处。以香华为道场。取瓶内香水洗浴。夫即爱乐。亦得有孕。妇不乐夫。亦如前法。按一<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>中陀罗尼神咒。总为五部。一佛部。谓诸<a href=\"/remen/fozhou.html\" class=\"keylink\" target=\"_blank\">佛咒</a>。二莲华部。谓观自在等诸持莲华菩萨咒。三金刚部。谓金刚手菩萨并诸金刚神咒。四宝部。谓诸天咒。五羯磨部。谓诸鬼神咒。此五部。每一部各有五部。总成二十五部。今此准提真言。总持摄二十五部。故随所用之。无不成就。</p><p>　　又法。行者每念诵时。结大印诵真言。印塔满六十万遍。所求之事。即得满足。观自在菩萨。金刚手菩萨。多罗菩萨。即为现身。所求如意。或作阿苏罗宫中王。或得菩萨地。或得长年药。或得敬爱法成就。</p><p>　　智译云。于大海边。或河渚间。沙滩之上。以塔形像印。印沙滩上为塔形像。念诵一遍。印成一塔。如是数满六十万遍。即睹见圣者观自在菩萨等。随其心愿。皆得满足。或见授与神仙妙药。或见授与菩萨之记。或现前来问。随其乞愿。皆得菩萨等位。若欲求聪明。取石菖蒲。牛黄。各半两。捣作末。以酥和。于佛前作坛。念诵五千遍。服之。即得聪明。持明藏经云。若有行人。欲作最上殊胜成就者。一心专注精勤修习。先于大海岸边。诵准提根本真言。造沙塔六洛叉已。于所求事。必获成就。金刚手。亦名金刚藏。</p><p>　　又法。于菩提道场。于大制底前。诵此陀罗尼。得见圣僧共语。与悉地成就。得共彼同行。即得同彼圣僧。</p><p>　　菩提道场。在中天竺摩竭国。佛坐其中。成等正觉。故以为名。制底。是佛塔也。此塔在菩提场中。智译云。右绕菩提树像行道。念诵一百万遍。即见佛菩萨罗汉。为其说法。欲随菩萨。即得随从。所求如愿。乃至现身成大咒仙。即得往诣十方<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。历事诸佛。得闻正法。又欲得见一切鬼神。取牛黄。念诵令烟火出。即涂目。并服之。即见。持明藏仪轨云。诵一俱胝数满。得阿罗汉现身与语。获大利益。此后与阿罗汉同行。亦同其威德。</p><p>　　又法。于高山顶上。念诵一俱胝遍。金刚手菩萨。即将此人。领五百六十人。同入阿苏罗宫。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>一劫。得见<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨。听闻正法。闻法已。获菩萨地。得不退转。</p><p>　　言一劫者。此当一小劫。计有一千六百八十万年。入阿修罗宫。以待弥勒下生。上生经云。弥勒菩萨。五十六亿万岁。尔乃下生。阿苏宫。其处非一。且如清辩论师所入者。其宫在南天竺安达罗国。城南不远。大山嵓石壁间。论师咒芥子击石壁。豁然洞开。入中待见弥勒菩萨下生。</p><p>　　又法。上毗补罗山。</p><p>　　此山。在摩竭国。又云。但有高山亦得。</p><p>　　有<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>像前念诵。随力以香华供养。乞食以支身命。从月一日。至十五日。诵陀罗尼满三十万遍。取其满日。一日一夜不食。倍加供养。至后夜。即见金刚手菩萨。将行人往自宫中。为行者。则示阿修罗窟门。入窟中。得天甘露。寿齐日月。</p><p>　　金刚手者。手持金刚杵。表内心具大菩提。外摧伏诸烦恼魔。又自体坚固。成金刚智。杵破邪见山。证金刚定。常持于掌中。故名金刚手。菩萨者。具云菩提萨埵。菩提是能觉义。萨埵是有情义。谓自能<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。复住<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>中。觉悟一切有情也。智译不言上山。但云在塔前。或佛像前。或<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>塔前。初言在塔前者。或如来八大灵塔。或法身偈塔。非舍利塔也。</p><p>　　又法。于三道宝阶。从天下处宝塔。行者乞食旋绕。诵俱胝遍。即见无能胜菩萨与愿。为说妙法。示无上菩提道。或见阿利底母。将此人入自宫中。与长年药。还童年少。端正可喜。获得伏藏。大人许可。应广利益三宝。得一切菩萨安慰。示其正道。乃至菩提道场。</p><p>　　若诵此陀罗尼者。乃至未坐道场。一切菩萨为其胜友。故常安慰示以三十七品菩提之道。令其进修。乃至坐菩提树下成等正觉。故云坐道场。阿利底母。即鬼子母。本名欢喜母。伏藏。谓得地中宝藏。诸佛菩萨。许其将以广利群生。供养三宝。不得悭慝自用。三道宝阶。在中天竺僧伽舍国。昔佛升忉利天。为母说法。三月讫。从天来下。天帝化作三道宝阶。中央黄金。左琉璃。右玛瑙。佛从中下。后阿育王。于其处。建立宝塔也。智译云。若于转法轮塔前。或佛生处塔前。或宝阶塔前。或舍利塔前。念诵右绕。满七七日。即见彼二菩萨。随其所愿。皆悉满足。云云。持明藏云。菩萨授与圣药。变行人身。具殊胜相。及得一切菩萨。接引证道。乃至速坐菩提道场。</p><p>　　又法。若人无宿善根。无菩提种。不修菩提行。才诵一遍。则生菩提法芽。何况常能念诵<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。</p><p>　　智译云。若读一遍。即得菩提分<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>芽生。何况诵持。常不懈废。由此善根。速成佛种。无量功德。皆悉成就。诃罗译云。若得闻此大准提陀罗尼法。速疾<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>阿耨多罗三藐三菩提。若人忆持诵念常不懈废此佛母心大准提陀罗尼者。无量善根皆得成就。佛说此大准提陀罗尼法时。无量众生。远离尘垢。得大准提陀罗尼大明咒功德。得见十方诸佛菩萨。诸圣众等。作礼而去。</p><p>　　○七俱胝准提陀罗尼念诵仪轨</p><p>　　智译云。依经梵本。有十万偈。我今略说念诵观行供养次第。若有四辈<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。发菩提心。行菩萨行。求速出离生死者。先须入三摩耶灌顶道场。受持禁戒。坚固不退。爱乐大乘<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>行。于四威仪。修四无量。发四弘愿。求离三途。于一切事业。心不散乱。方可入此秘密法门。</p><p>　　若有修习此陀罗尼求成就者。先须澡浴。应着净衣。</p><p>　　苏悉地经云。三时澡浴。应具三衣。又内衣一日三时浣濯。其衣干燥。香熏<a href=\"/remen/sajing.html\" class=\"keylink\" target=\"_blank\">洒净</a>。别置睡衣。及以澡衣。于此三时替换。内衣日别一洗。干听熏洒。澡浴。洗净。大小便利。皆用真言。和水而洗净之。若不如法洗净。即无灵验。故根本杂事律佛言。若苾刍苾刍尼。邬波塞迦邬波斯迦。以我为师者。咸应洗净。若不洗净。不应绕塔行道。<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>诵经。诸天不喜。所持咒法。皆无效验。若作斋供。书经造像。得福寡薄。云云。其洗净法。备载律中。苏悉地经。洗净并同。但用咒印。及澡洒身有别。其洗浴。洗净。去秽。浣手。各有真言。俱如余处应知。持明藏仪轨云。复诵甘露军茶利菩萨心真言。加持水三掬。用灌自顶。即成沐浴。真言曰。</p><p>　　唵(引)阿蜜哩(二合)帝(引)吽(引)(一句)</p><p>　　复诵二十一遍加持水。用洒净。及遣魔障。然后随意沐浴。所用拭巾。亦濯令清净。又洗二手。作洁净已。却入道场。近于贤圣。又凡结印。当用涂香。涂其二手。</p><p>　　严饰道场。安置本尊。随力所办。其道场法。应择胜地。作四肘坛。掘深三肘。</p><p>　　谓严饰道场。随力所办幡盖香华饮食等。胜地如下所明。智译云。东西南北。各量取四肘。作方坛。掘深一肘。</p><p>　　除去瓦砾。恶土。发毛。及骨。灰。炭。虫蚁等。以好净土填满筑平。掘无恶土。即取旧土填。土若有剩。当知其地是大吉祥。速疾成就。取未堕地瞿摩夷。以香水和净好土为泥。诵无能胜菩萨真言。加持二十一遍。然后泥坛。泥已。复取五净相和。</p><p>　　五净者。瞿摩夷汁。牛尿。酪。乳。酥。余部令取黄牛五净。</p><p>　　以无能胜菩萨真言。加持一百八遍。右旋遍涂其坛。</p><p>　　梵语曼茶罗。华言坛。坛者生也。谓出生无尽功德故。又坛者集也。是无边圣贤会集之处。如是坛法。乃诸佛不思议之神用。勿生疑惑。依法结之。所求必获如愿。</p><p>　　若在山石上建立。或在楼阁。或居船上。一切贤圣得道处。但以五净涂拭。</p><p>　　智译云。若在山中。及好净屋。不须掘地。依前涂拭。即张天盖。四面悬幡。若有俱胝佛母形像。安置坛中。面向西。若无本尊。有诸佛像。舍利。及大乘经典。供养亦得。</p><p>　　面向东坐。结无能胜印按地。诵真言七遍。加持坛中心。又取诸药七宝。并五谷各少分。掘坛中心深一肘。安诸药及七宝。复取旧土填满平治。以右手按。诵地天偈三遍。警觉地天神。偈曰。</p><p>　　汝天亲护者　　于诸佛导师　　修行殊胜行</p><p>　　净地波罗蜜　　如破魔军众　　释师子救世</p><p>　　我亦降伏魔　　我画曼茶罗</p><p>　　诵地天真言曰。</p><p>　　曩谟三满多没?(引)南(引)毕哩(二合)体(佗以切)微曳(二合)娑嚩(二合)(引)贺(引)</p><p>　　地天者。谓夜叉。罗刹。阿修罗。龙。迦楼罗。乾闼婆。紧那罗。摩睺罗伽。部多。毕舍遮。鸠槃茶等。真言。亦曰妙言。谓从诸佛心中流出。乃真实微妙秘密之语。一切诸天魔梵。及因位菩萨。不可得而思议也。</p><p>　　诵偈加持已。然后以檀香。涂九个圣位。如满月。</p><p>　　智译云。磨白檀香。涂作八坛。犹如满月。或似八叶莲华。本译令涂九圣位。即是供养根本九字真言。智译令涂八坛。拟供全咒八句。任意作之。皆得。</p><p>　　以新净供具。金。银。熟铜。商佉。贝。玉。石瓷。木等新器。盛诸饮食及好香华。灯烛。阏伽香水。随力所有。布列供养。</p><p>　　商佉。即螺杯也。苏悉地经。三时涂地。献华香水。种种供养。除去萎华。续置新者。献供钵器。三时洗挑。</p><p>　　若在家出家菩萨。求成就者。每入道场。先应礼佛。<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。劝请。发愿已。应自誓受菩提心戒。</p><p>　　据此。若比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。及在家已受三归五戒八戒者。入道场时。皆须自誓受菩提心戒。苏悉地经云。每日三时澡浴换衣。三时供养<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>忏悔随喜劝请发愿。三时<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>。及作曼茶罗。三时归依<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。三时护身。如是作法。定得成就。智译亦令三时受戒礼佛忏悔随喜。而文缺劝请发愿。今以礼佛忏悔随喜劝请发愿五法。详附于后。</p><p>　　真言曰。</p><p>　　唵冒(引)地止多母怛跛(二合)(引)娜野(引)弭</p><p>　　冒地。亦作菩提。止。亦作唧。又作质。跛。或作么。弭。亦作弥。瑜伽释云。冒地止多。此云觉心。冒字为种子。冒字者。诠一切法无缚义也。若能知自身中菩提之心自性成就。三世平等。犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。离一切相。则能了知一切有情心。及诸佛心。皆如自心。本来清净。则起大悲。深生矜愍。种种方便。令诸有情。离苦解脱。得至究竟。无缚无解。是为广大菩提心也。</p><p>　　菩提心者。离一切<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。远离蕴处界。及离能取所取。于法平等。自心本不生。自性空故。如过去一切佛菩萨。发菩提心。我亦如是。此名自誓受菩提心戒。由诵一遍。思惟胜义谛。获得无量无边无为功德。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>三业。乃至菩提道场。其福无间断。速灭一切<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。真言速得成就。本尊现前。如华严入法界品。慈氏菩萨。为善财童子说菩提心功德。</p><p>　　蕴。即<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。处。即十二入。界。即十八界。如余处释。受菩提心戒仪云。今所发觉心。远离诸性相。蕴界及处等能取所取执。诸法皆<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。平等如虚空。自心本不生。空性圆寂故。如诸佛菩萨。发大菩提心。我今如是发。余如入法界品明。</p><p>　　自誓受菩提心戒已。全加。半加。随意而坐。端身闭目。即结定印。想空中准提佛母。与七俱胝佛围绕。遍满虚空。定中礼一切诸佛及准提佛母。然后以香涂手。应结契印。</p><p>　　先结定印。次结礼佛印。俱如后出。智译云。安心定坐。除一切<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。观<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生。无始以来。生死海中。<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>六趣。愿皆发菩提心。行菩萨行。速得出离。即以涂香摩手而结手印。结印时。以衣覆手。勿令人见。先结三部三摩耶契。次结诸契。</p><p>　　○佛部三摩耶印(即三昧印)</p><p>　　苏悉地经云。先于室内。当置尊容?。或制底。或但置座。入时面向于尊。合掌曲身。口诵真言。入便礼已而供养之。真言曰。</p><p>　　唵入嚩(二合)里多(二合)路者泥??泮吒</p><p>　　七遍诵之。次即应作三部三摩耶印。及真言。</p><p>　　二手虚心合掌。开二头指。屈辅二中指甲下第一节侧。二大指各附二头指根下。即成。当心。诵真言七遍。想于如来三十二相。八十种好。相好分明。如对目前。</p><p>　　智译云。福智手并仰。檀戒忍慧便愿微屈相拄。进力压忍愿上节。禅智附进力侧。即成。苏悉地经。印同智译。檀。戒。忍。进。禅。从右手小指起。慧。便。愿。力。智。从左手小指起。此是十波罗蜜。</p><p>　　真言曰。</p><p>　　唵(引)(一)怛他(引)蘖睹(引)(二)纳婆(二合)嚩(引)野娑嚩(二合)(引)贺(引)(三)</p><p>　　睹或作妒。纳或作娜。智译作唵怛他?睹嚩皤耶娑嚩诃。以契顶上散之。皤字去声。下并同。</p><p>　　由结此印诵真言故。即警觉一切如来。悉当护念加持行者。以光明照触。所有罪障。皆得消灭。寿命长远。<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>增长。佛部圣众。拥护欢喜。生生世世离诸恶趣。莲华化生。速证无上正等菩提。</p><p>　　大宝楼阁经云。或山顶上诵咒。尽目所睹处。五逆十恶诸众生等。皆得灭一切罪。来世生诸佛净土莲华化生。而况持咒行者。不莲华化生。灭一切罪耶。</p><p>　　○莲华部三摩耶印</p><p>　　以二手虚心合掌。散开二头指。二中指。二无名指。屈如莲华形。安印当心。诵真言七遍。想观自在菩萨相好具足。于顶右散。</p><p>　　二小指。二大指相着。余六指散开微屈。如开莲华。观自在菩萨相好。如<a href=\"/fojing/guanwuliangshoujing/yuanwen.html\" class=\"keylink\" target=\"_blank\">观无量寿经</a>说。</p><p>　　真言曰。</p><p>　　唵(引)(一)跛娜谟(二合)(引)(二)纳婆(二合)嚩(引)野娑嚩(二合)(引)贺(引)(三)</p><p>　　跛娜或作钵讷。智译作。唵钵头牟嚩皤耶莎嚩诃。</p><p>　　由结此印诵真言故。即警觉观自在菩萨等持莲华者。一切菩萨。光明照触。所有业障。皆悉消灭。一切菩萨常为善友。</p><p>　　无量寿如来供养仪轨云。由结此印。及诵真言。警觉观自在菩萨。及莲华部圣众。皆来加持行者。获得语业清净。言音威肃。令人乐闻。无碍辩才。说法自在。</p><p>　　○金刚部三么耶印</p><p>　　以左手翻向外。以右手掌背安左手背。以左右大小指。互相钩。如金刚杵形。安于当心。想金刚手菩萨。诵真言七遍。顶左散印。</p><p>　　苏悉地经云。两手中间六指。微令开。如三股杵。此三印。名为大印。诸佛菩萨。犹不能违。况诸魔类等。非但顺教。亦灭诸罪。以除诸难。所求之法。必得顺愿。智译令左覆右仰。大小指相交。然其印成。皆同本译。</p><p>　　真言曰。</p><p>　　唵(引)(一)嚩日嚧(二合)(引)(二)纳婆(二合)嚩(引)野娑嚩(二合)(引)贺(引)(三)</p><p>　　智译作。唵嚩折噜婆皤耶莎嚩诃。</p><p>　　由结此印及诵真言故。即警觉一切金刚圣众加持拥护。所有罪障。皆得除灭。一切<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。终不着身。当得金刚坚固之体。</p><p>　　供养仪轨云。由结此印。及诵真言。警觉金刚藏菩萨。并金刚部圣众。皆来加持行者。获得意业清净。证菩提心。三昧现前。速得解脱。按智译结三部三摩耶印。后即结佛母根本身印。诵佛母真言七遍。今本译。在持珠念诵前结根本印。如欲结者准理无妨。其印如后阏伽印出。</p><p>　　○次结第二根本印(用护身)</p><p>　　智译。以此印在后持数珠念诵前用。而别有辟除一切天魔恶鬼等印咒。本译用此印及心真言护身。后复以无能胜印咒辟除障者。</p><p>　　二手外相叉。二头指。二大指。并直竖。即成。诵佛母心真言。印身五处。所谓额。次右肩。次左肩。次心。次喉。顶上散。真言曰。</p><p>　　唵迦么黎尾么黎准泥娑嚩(二合)贺(引)</p><p>　　结护身印时。起大慈心。遍缘六道四生。愿一切有情。被大誓庄严坚固金刚甲胄。速证无上正等菩提。</p><p>　　大誓庄严坚固金刚甲胄者。谓菩萨以四弘誓。而为庄严。不为邪魔之所沮坏。遇逆顺缘。心无退转。故愿诸有情。皆披如是坚固金刚甲胄。离诸障难。速证无上菩提。如是想已。即成被金刚甲胄。一切诸魔。不敢障难。</p><p>　　○次结地界橛印</p><p>　　二手内相叉。竖二大指。二头指。二小指。各相合。屈左头指如钩。三掣。大拇指指地。印成一掣。诵真言一遍。</p><p>　　智译云。以左右二中指。二无名指。叉入掌。右压左。右头指屈如钩。左头指直竖。二大指二小指。令面相着。</p><p>　　真言曰。</p><p>　　唵准你你。枳(引)逻野娑嚩(二合)(引)贺(引)</p><p>　　智译。唵准你泥枳逻耶莎嚩诃。诵一遍。以印大母指。触地一回。如卓橛势。三度作即休。</p><p>　　由结此印诵真言加持地界故。下至水际。如金刚座。天魔及诸障者。不为恼害。少加功力。速得成就。</p><p>　　地中所有诸秽恶物。由此印咒加持力故。悉皆清净。</p><p>　　持诵者。次应于坛中心。想八叶大莲华上有师子座。座上有宝楼阁。垂诸缨络。缯幡幢盖。宝柱行列。垂妙天衣。周布香云。普雨杂华。奏诸音乐。宝瓶阏伽。天妙饮食。摩尼为灯。如无曼荼罗。但于空<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>想。即成。作此观已。应诵此偈。</p><p>　　以我功德力　　如来加持力　　及以法界力</p><p>　　普供养而住</p><p>　　诵此偈已。即诵大虚空藏菩萨真言曰。</p><p>　　唵(一)誐誐曩(引)三婆嚩(二)嚩日啰(二合)斛(引)(三)</p><p>　　三字去声。婆字去声。誐字或作伽字轻呼。</p><p>　　由诵此真言加持故。所想供养具。真实无异。一切圣众。皆得受用。</p><p>　　按无量寿仪轨诵大虚空藏真言。先令结印。以二手合掌。二中指右押左外相叉。博着手背。二头指相蹙如宝形。想从印流出无量诸供养具。衣服饮食。宫殿楼阁等。行者纵使观念力微。由此印咒加持力故。诸供养物。皆成真实广大供养。又准别部有出生供养印。二手当心合掌。以十指右压左。头相交。复安在顶上。诵出生供养真言二十一遍。即唵字也。由唵字真言及印。不思议力。自然遍法界。出生无尽香华灯烛幢幡宝盖衣服卧具楼阁宫殿音乐呗赞等。种种诸供养具。供养遍法界无边佛法僧三宝等。若无饮食香华等。但对像前结印诵唵字真言。自然有无量供养。遍供法界无尽三宝。是知唵之一字。如摩尼珠。随心所现。亦如本经。所想悉皆成就。又此唵字。是一切真言字母。能生一切真言字义。是故一切真言。皆首宣之。</p><p>　　○次结宝车辂印(车昌遮切。扯平声。辂鲁故切。音路)</p><p>　　二手内相叉仰掌。二头指横相挃。以二大指各捻头指根下。想七宝车辂。佛部使者。驾御七宝车辂。乘空而去。至于<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>顶。阿迦尼吒天。毗卢遮那佛宫殿中。诵真言七遍。</p><p>　　智译云。先以二手向内相义。右压左即仰开掌。二头指直伸头相拄。以二大指拨二中指头来去。即成。心想阿迦尼吒天宫中毗卢遮那如来。十地菩萨围绕。集会中。请准提佛母圣者。乘七宝庄严车辂。上有白莲华座。座上有如所画形像。心中想念。如在目前。阿迦尼吒天。此云色究竟天。是色界最顶天。亦名有顶天。</p><p>　　真言曰。</p><p>　　唵(引)(一)睹噜睹噜吽(引)(二)</p><p>　　噜字转舌呼。智译无吽字。有莎嚩诃字。</p><p>　　由诵真言结印加持故。七宝车辂。至色界顶。准提佛母。并八大菩萨。及诸圣众。眷属围绕。乘七宝车辂。</p><p>　　八大菩萨者。一观自在。二弥勒。三虚空藏。四普贤。五金刚手。六文殊师利。七除盖障。八地藏菩萨。若毗卢遮那佛内心证得三摩地智。则流出十六菩萨。一金刚萨埵。二金刚王。三金刚爱。四金刚善哉。五金刚宝。六金刚威光。七金刚幢。八金刚笑。九金刚法。十金刚剑。十一金刚因。十二金刚语。十三金刚业。十四金刚护。十五金刚药叉。十六金刚拳菩萨。瑜伽分别圣位修证法门云。夫真言陀罗尼宗也。是一切如来秘密之教。自觉圣智修证法门。亦是菩萨具受净戒。无量威仪。入一切如来海会坛。受菩萨职位。超过三界。受<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>敕。三摩地门。具是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。顿集功德。广大智慧。于无上菩提。皆不退转。离诸天魔。一切烦恼。及诸罪障。念念融证。佛四种身。谓自性身。受用身。变<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。等流身。满足五智。三十七等不共佛法。然如来变化身。于阎浮提摩竭陀国。菩提道场。成等正觉。为地前菩萨。声闻。缘觉。凡夫。说三乘教法。或于他意趣说。或自意趣说。种种根器。种种方便。如法修行。得人天果报。或得三乘解脱果。或进或退。于无上菩提。三无数大劫。修行勤苦。方得成佛。王宫生。双树灭。遗身舍利。起塔供养。感受人天胜妙果报。及涅槃因。不同报身毗卢遮那如来。于色界顶第四禅阿迦尼吒天宫云集。尽虚空遍法界。一切诸佛。十地满足诸大菩萨。证明警觉。身心顿证无上菩提。自受用佛。从心流出无量菩萨。皆同一性。谓金刚性。对毗卢遮那如来受灌顶职位。彼等菩萨。各说三密门。以献毗卢遮那佛。及一切如来。便请加持教敕。毗卢遮那佛言。汝等将来于无量世界为最上乘者。令得现生世间出世间悉地成就。若依次说。前后有差。据报身佛。顿证身口意三种净业。遍周法界。于一一法门。一一理趣。一一毛孔身分相好。尽虚空界。不相障碍。各住本位。以成遍照光明毗卢遮那自受用身。他受用身。若依二乘次第而说。若不具修三十七菩提分法。证得道果。无有是处。若证自受用身佛。必须三十七三摩地智。以成佛果。梵本入楞伽偈颂品云。自性及受用。变化并等流。佛德三十六。皆同自性身。并法界身。总成三十七也。以三十七内证无上金刚界分智。威力加持。顿证毗卢遮那之身。从无见顶相流出无量佛顶法身。云集空中。以成<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>。光明遍覆。如塔相轮。十地满足。莫能睹见。冥加有情。身心罪障。悉令殄灭。无能知者。虽不能知。能息诸苦。而生善趣。从光流出十六菩萨。及八方等内外大护。展转出光照触恶趣。以成窣堵坡阶级。卫护诸佛窣堵坡法界宫殿。成为全身。现证金刚界如来毗卢遮那遍照之身也。是知准提佛母。乃从毗卢遮那身流出。而准提真言。即诸佛内心自证之法。故云七俱胝如来所说。以能出生诸佛。故云佛母也。</p><p>　　○次结请车辂印</p><p>　　准前印。以二大指向身。拨二中指头。即成。诵真言七遍。真言曰。</p><p>　　曩么悉底哩(三合)野地尾(二合)迦(引)南(引)(一)怛他(引)蘖多(引)南(引)(二)唵嚩日??(二合)(引)拟(斫以切)你也(二合)(引)(三)羯哩洒(二合)也娑嚩(二合)贺(引)(四)</p><p>　　南。亦作难。??。亦作朗。又作?。拟。亦作祇。蘖多。应作孽跢。你也。亦作娘字。上声羯哩。亦作迦啰。</p><p>　　由诵真言加持故。圣众从本土来至道场空中而住。</p><p>　　智译无此真言印契。唯用后真言印契请之。修真言行者。随准一法。皆成。</p><p>　　○次结请本尊印从车辂下降于道场(本尊。即准提佛母)</p><p>　　准前第一根本印。以二大指向身招。诵真言三遍。</p><p>　　第一根本印。即前佛部印。下言准前根本印。同此。智译云。以二大指来去招之三度。想圣者从宝车上。下来道场中。白莲华座上。苏悉地经请云。今有某甲。为某事奉请。仰惟尊者。以本愿故。降赴道场。愿垂哀愍。受此阏伽。及微献供。当请之时。诚心作礼。再三启白。若不诚心。徒多念诵。乃至真言。亦皆殷勤。加翳醯字。此更秘密。速满其愿。</p><p>　　真言曰。</p><p>　　唵。者礼主礼准泥。翳醯曳呬婆战嚩底(丁以切)娑嚩(二合)贺(引)</p><p>　　婆字去声呼。智译作。唵折[棣-木+(上/矢)]主[棣-木+(上/矢)]准提。噎醯曳醯。薄伽嚩底。莎嚩诃。伽誐揭孽。四字同音。战字疑是戟字。当伽字轻呼。苏悉地经云。奉请已。作如是言。善来尊者。愍我等故。降临道场。复垂哀愍。当就此座坐。受微献供。复起诚心。频兴作礼。而白尊言。大悲垂愍。乘本愿故。而见降临。非我所能。应须办供。先献涂香。次施华等。复献烧香。次献饮食。次乃然灯。如其次第。</p><p>　　○次结无能胜菩萨印辟除障者</p><p>　　二手右压左。内相叉作拳。竖二中指。头相合。即成。绕身右旋三匝。作是思惟。所有障者。毗那夜迦。诸恶鬼神。远走而去。所来圣众。不越本三么耶。大悲而住。愿垂加护。</p><p>　　凡修真言行者。及<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>人。须先以咒印。除诸魔障。故金光明经云。十地菩萨。尚以咒护持。况其凡夫。如首<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>云。若不持咒。而坐道场。令其身心远诸魔事。无有是处。悉地经云。若成就诸余事者。应当发遣诸有障者。若不遣除。后恐伤及。所以先须作遣除法。</p><p>　　真言曰。</p><p>　　曩莫三满多没?(引)南(一)唵(引)(二)户噜户噜(三)战拏(引)里(四)么(引)蹬耆娑嚩(二合)(引)贺(引)(五)</p><p>　　战或作赞。耆或作拟。里作哩。持明藏云。此咒能成就一切事。</p><p>　　○次结墙界印</p><p>　　准前地界印。屈右头指。展左头指。右旋三匝。随心近远。即成金刚坚固之城。诸佛菩萨。尚不违越。何况诸余难调伏者。毗那夜迦。及毒虫。利牙爪者。不能附近。</p><p>　　无量寿仪轨云。想从印流出炽焰。以印右旋绕身三转。随心大小。成金刚光焰。方隅墙界。诸魔。恶人。虎狼。师子。及诸毒虫。不能附近。神变疏云。持咒行者。得诸佛归命。故佛顶偈云。十方世界诸如来。护念归命受持者。然诸佛尚且归命持咒人。而敢有违越者乎。毗那夜迦。此云猪头象鼻。</p><p>　　真言曰。</p><p>　　唵准你儜。钵啰(二合)迦啰耶娑嚩(二合)(引)贺(引)</p><p>　　智译儜字作泥字。诵三遍。以印右挥三匝。</p><p>　　○次结上方网界印</p><p>　　准前墙界印。展左头指。右压左。当中节相交。即成。诵此真言三遍。</p><p>　　智译云。准墙界印。开仰着。右大指捻左头指头。左大指捻右头指头。小指依旧相拄即成。</p><p>　　真言曰。</p><p>　　唵准你儜。半惹啰娑嚩(二合)(引)贺(引)</p><p>　　惹字自攞切。智译儜字。作泥字。啰字。作逻字。诵三遍。以印随日。挥三度。按别部。以印于顶上右旋转。便散。</p><p>　　由诵真言结印加持故。即成金刚坚固不坏之网。</p><p>　　无量寿仪轨云。由印咒加持力故。即于上方覆以金刚坚固之网。乃至他化自在诸天。不能障难。行者身心安乐。三摩地易得成就。</p><p>　　○次结火院密缝印</p><p>　　以左手掩右手背相重。(令无缝)直竖二大指。即成。诵真言三遍。右旋三匝。想金刚墙外有大金刚火焰围绕。</p><p>　　智译云。以左手密掩右手背相重。直竖二大指。相去二寸许。无量寿仪轨云。想从此印流出无量光焰。以印右旋三匝。则于金刚墙外。便有火焰围绕。即成坚固清净火界。</p><p>　　真言曰。</p><p>　　唵(一)阿三莽拟(宜以切)你(二合)吽(引)癹吒(半声)(呼)(二)</p><p>　　三字去声。莽字上声。亦作摩。或作??。又作??引。拟。或作拟。苏悉地经令咽声念之。智译作。唵阿三摩。[口*木*氏]你??莎嚩诃。</p><p>　　由结此印诵真言。成大结护密缝。不被诸魔入。</p><p>　　○次结阏伽印。</p><p>　　阏伽或作遏伽。又作阿伽。此云器。凡供养之器。皆称曰阏伽。谓以[鬱-山+止]金。龙脑。白檀香等水。盛于阏伽妙器中。而奉献之。其器或金。银。宝玉。铜。石。瓦。木。螺杯。及缀莲叶乳树叶。皆得为阏伽供养。有云。法中使熟铜作阏伽器最上。苏悉地经云。作扇底迦法。当用白器。置少小麦。及乳。作布瑟征迦法。当用黄器。应着胡麻。及酪。作阿毗遮噜迦法。当用黑器。当致粟米。及牛尿。或自血。余如下释。</p><p>　　二手内相叉。竖二中指。头相着。以二头指。捻二中指背。二大指侧附二头指根下。即成根本印。准前根本印。微屈二大指入掌。即成阏伽印。诵真言三遍。</p><p>　　智译云。准前根本印。以二大指各捻头指根第一节侧下。即成。</p><p>　　真言曰。</p><p>　　唵者礼主礼准泥遏钳。钵啰(二合)底(引)蹉。婆誐嚩底。(异丁反)娑嚩(二合)(引)贺(引)</p><p>　　智译作。唵折隶主隶准提遏钳薄伽嚩帝。钵啰底槎。莎嚩诃。按此真言与本译同。但后二句相倒。不同耳。本译以钵啰底蹉在先。婆誐嚩底在后。彼以薄伽嚩帝在先。钵啰底槎在后。为别。持明藏经。亦同智译。</p><p>　　行者思惟圣众了了分明。想自身在诸佛圣众足下。手持七宝阏伽器。盛香水。浴圣众足。由献阏伽香水故。行者三业清净。洗涤烦恼垢。业障消灭。</p><p>　　无量寿仪轨云。由献阏伽香水浴圣众双足。令行者三业清净。洗除一切烦恼罪垢。从胜解行地。至十地。及如来地。当证如是地波罗蜜时。得一切如来授与甘露法水灌顶。又五字心陀罗尼云。饮此水者。除诸灾患。</p><p>　　○次结莲华座印</p><p>　　准前根本印。并二大指向身竖。运想。从此印流出无量师子座。奉献一切圣众。是诸圣众。各各皆坐。</p><p>　　智译印咒并同。而印云。并二大指向身开竖之。即成。心想道场中。种种宝钿师子座上开白莲华。安置圣者。即诵真言三遍。</p><p>　　真言曰。</p><p>　　唵(一)迦么逻娑嚩(二合)(引)贺(引)(二)</p><p>　　么亦作摩上声。逻亦作攞。或作啰。</p><p>　　由结座印诵真言奉献圣众故。行者当得十地满足。得金刚之座。</p><p>　　行者亦得三业坚固。犹如金刚。言金刚座者。谓坐金刚座而成等正觉也。今此神咒。是诸佛境界。有不可思议神力。但当生信诵持。自然灭障成德。超凡证圣。故云当得十地满足。得金刚之座。持明藏经云。行人诵真言已。即言。惟愿圣众。处此座已。安住道场。受我供养。</p><p>　　○次结澡浴印</p><p>　　准前根本印。以二大拇指头。捻二中指中节。即成。诵真言三遍。</p><p>　　智译以二大指。各并捻二中指下节侧。</p><p>　　真言曰。</p><p>　　唵者娑嚩(二合)(引)贺(引)</p><p>　　想从此印流出无量光明。一一光明道。有无量七宝贤瓶。想满天妙香水。灌注一切圣众澡浴。复想空中有无量天乐。供养本尊诸佛菩萨一切圣众。由结此印诵真言故。行者不久当得法云地。</p><p>　　法云地。是第十地。谓菩萨修行功满。唯务化利众生。大慈如云。普覆一切也。神变疏云。如余菩萨。为求菩提。虽行难行苦行。如救头然。经无量劫。尚不能得。真言行者。不亏法则。只于此生得菩提也。大教王经云。若不依秘密课诵修行。终不成于无上菩提也。</p><p>　　○次结涂香印</p><p>　　准前根本印。以二大指。傅着右头指下节侧。即成。诵真言三遍。</p><p>　　智译印咒悉同。</p><p>　　真言曰。</p><p>　　唵礼娑嚩(二合)(引)贺(引)</p><p>　　想从此印。流出无量光明。一一光明道。有无量天妙涂香末香云海。供养本尊诸佛菩萨一切圣众。由结此印诵真言故。当证一切如来戒。定。慧。解脱。解脱知见香。</p><p>　　香以熏闻为义。故感证五分法身之香。如余菩萨。由持戒清净。则戒体成就。而得无持无犯。若修习无漏<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。则根尘泯净。而便离诸散乱。若修习无漏智慧。则能断三界烦恼。而出离生死。若不作诸业。则脱诸累缚。而得自在。知即无生智眼。谓照了<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>虚妄分别。则无生之智眼自在明了。今持真言行者不假余修。由真言力故。即越诸阶级。而证得五分法身。理趣疏云。性德力大。密咒功强。解行虽劣。解脱则疾。故成佛心要云。显教圆宗。须要先悟毗卢法界。后依悟修。满普贤行海。得离生死。证成十身无碍佛果。如病人得好药方。要须自知分两。炮炙法则。合成服之。方得除病身安。今密教圆宗神咒。一切众生。并因位菩萨。虽不解得。但持诵之。便具毗卢法界。普贤行海。自然得离生死。成就十身无碍佛果。如病人得合成妙药。虽不知分两。和合法则。但服之。自然除病身安。故大般若经云。总持犹妙药。亦如天甘露。能疗众惑病。服者常安乐。</p><p>　　○次结华印</p><p>　　准前根本印。以二大指。傅着左头指下节。即成。诵真言三遍。</p><p>　　节字下。应有侧字。智译印咒并同。</p><p>　　唵主娑嚩(二合)(引)贺(引)</p><p>　　想从此印。流出无量光明。一一光明道。有无量种种水陆天妙华云海。供养本尊诸佛菩萨一切圣众。由结此印诵真言故。当得大慈三摩地成就。能利乐无边众生。诸灾难不着身故。</p><p>　　大慈即<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>慈也。皆言云海者。云是<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>义。谓此供具。色相显然。而智鉴无性。从法性空。无生法起。能现所现。能现即行愿力。所现即供养具。迥无所依。应用而来。来无所从。用谢而去。去无所至。而能含悲润注法雨益济万物。重重无尽。故如云像。言海者。以表供养称理故深。称事故广。以深广故。喻之如海。如是一一供具称于真理。等虚空界。即以全法之身。游诸佛刹。称真之物。供养诸佛圣众。行者安心观行。于诸供具常称理而成就。以是法施供佛。名真供养也。</p><p>　　○次结烧香印</p><p>　　准前根本印。屈右头指。捻二大指头。即成。诵真言三遍。</p><p>　　智译印咒并同。</p><p>　　真言曰。</p><p>　　唵礼娑嚩(二合)(引)贺(引)</p><p>　　想从此印。流出无量光明。一一光明道。有无量和合俱生天妙烧香云海。供养本尊诸佛菩萨一切圣众。由结此印诵真言故。当得普遍法界三摩地成就。</p><p>　　○次结饮食印。</p><p>　　准前根本印。以左头指。捻二大指头。即成。诵真言三遍。</p><p>　　智译印咒并同。</p><p>　　真言曰。</p><p>　　唵准娑嚩(二合)(引)贺(引)</p><p>　　想从此印。流出无量光明。一一光明道。有无量天妙种种饮食云海。供养本尊诸佛菩萨一切圣众。当得法喜禅悦食。三解脱最胜味。三摩地成就。</p><p>　　以爱乐大法。得法资长道种。心生欢喜。不嗜世味。常持<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。是为法喜食。由得禅定自资。长养慧命。道品圆明。正念现前。心常喜乐。不贪世味。是为禅悦食。苏悉地供养法云。若不办涂香。乃至灯明供养。但诵如上奉涂香等真言。及作手印。亦成圆满供养。次运心供养者。以心运想水陆诸华。无主所摄。遍满虚空。尽十方界。及与人天妙涂香云。烧香灯明。幢幡伞盖。种种鼓乐。歌舞倡妓。真珠罗网。悬诸宝铃。华鬘白拂。微妙磬铎。如意宝树。衣服之云。天诸厨食。上妙香美。种种楼阁宝柱。诸天严身。头冠缨络。如是等云。行者运心遍满虚空。以至诚心。如是供养。最为胜上。是发行者以决定心。而行此法。运心供养。诵真言及作手印。如上所想供养。皆悉成就。苏悉地经云。若香华饮食无可献者。但诵本色真言。及此手印献之。表云。供物无可求得。但纳真言。以真心故。速满其愿。离此之外。有四供养。遍通诸部。一切处用。一谓合掌。二以阏伽。三用真言及慕捺罗。四但运心。此善品中。随力应作。或复长时供养中置。无过运心。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。诸法行中。心为其首。若能标心而供养者。满一切愿。又复应知。不可才闻运心。即便悭贪。不办供养。悉地难成。若能办诸供养。加以真言运心。最为殊胜。故彼经云。持诵之人。不献饮食。违本部者。其人乃着魔障。身无精光。风燥饥渴。恒恶思想。不能成就本尊真言。皆由不献本尊果食。当于六斋等日。广设供养。奉献本尊并诸眷属。当净洗手。??口咽水。次下饮食。若准本部真言。运想香华等供养。皆从印中流出。尤胜以水陆无主香华运想。或恐初学观心未淳。用此助成亦妙。言三解脱者。一空解脱。二无相解脱。三无愿解脱。亦名三三昧。此三。即涅槃门。是诸贤圣所常餐履。一切解脱法中。无过于此。故云最胜味。</p><p>　　○次结灯印</p><p>　　准前根本印。以二头指。各捻二大指头。即成。诵真言三遍。真言曰。</p><p>　　唵泥娑嚩(二合)(引)贺(引)</p><p>　　智译印咒并同。彼云。已上涂香印等。各各印触当色物上供养。按诸部陀罗尼。别有香华饮食等供养印咒。而字句颇繁。今此准提陀罗尼。唯改本印。以本<a href=\"/remen/liuzizhenyan.html\" class=\"keylink\" target=\"_blank\">六字真言</a>。而成六种供养。诚为妙用。不可得而思议者。</p><p>　　想从此印。流出无量光明。一一光明道。有无量种种七宝灯烛云海。供养本尊诸佛菩萨一切圣众。当得般若波罗蜜光明五眼清净。</p><p>　　一肉眼。二天眼。三慧眼。四<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。五佛眼。般若。此云智慧。波罗蜜。此云到彼岸。由献灯故。感智慧光。得五眼净。而登彼岸也。此上作法结界供养真言。与持明藏仪轨经同。唯契印有异耳。彼经云。如是诸印相。行人?心记忆。习令精熟。于作法时。无令误失。若稍疑误。不成印契。不成印契。即贤圣不喜。凡所祈求。不获成就。</p><p>　　七俱胝佛母所说准提陀罗尼经会释卷上</p><p>　　音释</p><p>　　法财</p><p>　　谓三密菩提心教法也。</p><p>　　十二分教</p><p>　　一修多罗。此云契经。二重颂。三授记。四孤起。五无问自说。六因缘。七譬喻。八本事。九本生十方广。十一未曾有。十二论义。</p><p>　　苾刍</p><p>　　旧云比丘。新云苾刍。本香草名。含五义。一体性柔软。喻出家人。能折伏身口粗犷。二引蔓傍布。喻出家人。传法度人。连延不绝。三馨香远闻。喻出家人。戒德芬馥。为众所闻。四能疗疼痛。喻出家人。能断烦恼毒害。五不背日光。喻出家人。常向佛日故。</p><p>　　菩萨摩诃萨</p><p>　　菩萨。如上释。摩诃萨者。摩诃。是大义。萨即萨埵。是有情义。亦名心。亦云勇猛。以勇猛不怯弱故。三大无数劫。积集二种资粮。故名摩诃萨。</p><p>　　八部</p><p>　　一天。谓诸天神也。二龙。谓龙神也。三夜叉。此云勇健。有在地。有在空。有在天者。四乾闼婆。此言香阴。不食酒肉。天帝乐神也。五阿修罗。亦作阿苏罗。此云非天。谓其果报最胜。邻次诸天也。六迦楼罗。此云金翅。即金翅鸟神也。七紧那罗。此云疑神。似人而头有角。是天帝乐神也。八摩睺罗伽。此云大腹行。即地龙。是大蟒神也。</p><p>　　?</p><p>　　同溺。</p><p>　　鼋</p><p>　　音元。似鳖。长一二丈。</p><p>　　鼍</p><p>　　音陀。类鱼。有足。长丈余。甲如铠。</p><p>　　桦</p><p>　　音话。木名。皮可贴弓。</p><p>　　四无量</p><p>　　慈悲喜舍。</p><p>　　四弘愿</p><p>　　众生无边誓愿度。烦恼无尽誓愿断。法门无量誓愿学。佛道无上誓愿成。</p><p>　　砾</p><p>　　音力小石。</p><p>　　剩</p><p>　　与剩同。余也。</p><p>　　钿</p><p>　　音田。金华饰也。</p><p>　　六道</p><p>　　亦名六趣。一天。二人三阿修罗。四地狱。五饿鬼。六畜生。</p><p>　　四生</p><p>　　化胎卵湿。</p><p>　　五智</p><p>　　一通达智。二随念智。三安立智。四和合智。五如意智。谓菩萨起行度生。分别显示。而能觉了通达诸法。忆持不失。建立正教。令他修行。观一切法。随缘和合。随意所欲。无不满足。故有五种之别。详如摄大乘论释所明。</p><p>　　三十七不共佛法</p><p>　　谓佛证四种身。一自性身。二受用身。三变化身。四等流身。梵本入<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>偈颂品云。自性及受用。变化并等流。佛德三十六。皆同自性身。并法界身。总成三十七。是为三十七不共佛法。余一切声闻缘觉菩萨。所不共有也。唐实叉难提译云。自性及受用。变化复现化。佛德三十六。皆自性所成。元魏菩提留支译云。实体及受乐。化复作诸化。佛众三十六。是诸佛实体。</p><p>　　窣堵坡</p><p>　　即佛塔也。</p><p>　　十身</p><p>　　一菩提身。二愿身。三化身。四力持身。五相好庄严身。六威势身。七意生身。八福德身。九法身。十智身。</p><p>　　阏伽</p><p>　　阏音遏。阏伽水真言中遏钳字。亦作阿哩伽(二合)。</p><p>　　阿伽</p><p>　　阿入声。音遏。</p><p>　　蘖</p><p>　　与?孽檗不同。</p><p>　　十波罗蜜</p><p>　　一施。二戒。三忍辱。四<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。五禅定。六慧。七方便。八愿。九力。十智。</p><p>　　药叉</p><p>　　旧云夜叉。</p><p>　　搓</p><p>　　音蹉。娜也。</p><p>　　五分法身</p><p>　　一戒。二定。三慧。四解脱。五解脱知见。</p><p>　　洛叉</p><p>　　此云十万。</p><p>　　凡经律论中。华言梵语。各不同者。良由如来。灭度一百一十余年后。时诸比丘。互执见闻。各引师说。分经律论为五部。致于文言<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>。有详有略。大虽不殊。小则不无其异。然佛在世。曾已预记。我涅槃后。经律论。当分为五部。而皆是如来金口所说。但为闻听不广。故成多部。犹如甘露散于人间。但同餐饮。无不除病延年。随秉一部修行。悉成道果。是以五天竺国。各宗一法。咸获圣证。既知如来先为预记。则无是无非。是故智者。不可于中妄生疑惑。阻自前进。失却千生万劫之殊妙<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>也。</p><p>　　卍续藏 第 23 册 No. 0446 七俱胝佛母所说准提陀罗尼经会释</p><p>　　七俱胝佛母所说准提陀罗尼经会释卷中</p><p>　　唐天竺三藏法师大广智不空奉　诏译</p><p>　　清[(奥-釆+米)-大+ㄎ]东鼎湖山菩提心沙门弘赞　会释</p><p>　　○次诵赞叹</p><p>　　阿嚩??啰左睹啰娜(二合)舍(引)啰?(二合)娑么(二合)啰哩补句致钵啰(二合)拏么跛娜尾呬帝阿者礼怛??娑哩素你祖礼悉??思准泥萨啰(二合)闷底南(引)婆嚩舍么你娑嚩(二合)(引)罕(引)帝萨钵啰(二合)拏吠怛你也(二合)佗(引)讫洒(二合)啰(引)拏蘖帝阿尾你多萨怛嚩(二合)娜么你钵啰(二合)枲(引)那路(引)迦怛啰(二合)野(引)啰佗(二合)迦唎啰讫多(二合)(引)啰尾孕(二合)(引)那戍(引)鼻你播(引)怛啰(二合)迦啰那讫使(二合)??娑普(二合)砧(底浪切)悉体(二合)怛嚩(二合)进底多么啰贪(二合)(去)钵啰(二合)瑟砧(二合)李佉惹曩你尔娜(引)你萨帝(知曳切)曩钵啰(二合)库舞(二合)地晒逻始佉嚟野萨怛梵(二合)(引)啰抳焰(二合)惹闭怛母(二合)你帽(引)你(你夷切)嚩日哩(二合)担枳逻?弥焰(二合)素啰哩补婆嚩喃钵啰(二合)吠奢野底阿引哩野(二合)嚩路(引)枳帝皤悉??底诺僧舍阎萨怛多惹播(引)多(半音)(多语切)旦曩(引)悉底(二合)惹?底紧旨你也(二合)萨怛梵(三合)(引)曩那娜(引)悉薄羯底(二合)毗药(二合)壹底娑迦罗播(引)跛曩(引)舍你婆誐嚩底跛耻多么(引)怛啰(二合)悉地迦哩布啰野么努(引)啰贪冥枲(引)娜底曩怛梵(二合)(引)娑么(二合)囕迦室子(二合)多(半音)婆誐嚩底准泥陀(引)啰尼萨妒(二合)怛罗(二合)萨么跛多(二合)</p><p>　　赞叹者。谓称扬赞叹圣德之美。具足无边福智。能成就众生所求。一切世出世间之乐。然智译缺此赞法。持明藏中虽备。其文尤繁。行者若不能作此梵赞。当知苏悉地经赞偈。苏悉地经云。其赞叹文。应用诸佛菩萨所说叹偈。不应自作。而彼经无赞准提文。今按本经述一偈。以赞本尊。偈曰。</p><p>　　大慈救世尊　　善导一切众　　福持功德海</p><p>　　我今稽首礼　　真如舍摩法　　能净贪瞋毒</p><p>　　善除诸恶趣　　我今稽首礼　　得法解脱僧</p><p>　　善住诸学地　　胜上福德因　　我今稽首礼</p><p>　　大圣准提尊　　哀愍于世间　　成就诸悉地</p><p>　　我今稽首礼　　大<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>自在　　一切佛赞叹</p><p>　　能生种种福　　我今稽首礼　　大力忿怒身</p><p>　　善哉持明王　　降伏难伏者　　我今稽首礼</p><p>　　忿怒身。即明王大威金刚。</p><p>　　○次说本尊陀罗尼布字法</p><p>　　从顶至足。观一一真言字。屈曲分明。流出光明。照六道四生轮回有情。深起悲愍。施与安乐。用陀罗尼九字布列于行者身。即成。以如来印。八大菩萨所加持身。若作息灾。增益。降伏。敬爱。随四种法。所谓白黄黑赤。成办悉地。即结布字印。二手内相叉。二大指。二头指。二小指。相合直竖。即成。</p><p>　　智译云。结此手契成。即想自身犹若释迦如来三十二相。八十种好。紫磨金色。圆满身光。想已。以手契触头上布唵字。触眼中布折字。一一依字次第。乃至两足。皆以契触布之。</p><p>　　想◇唵字安于顶。以大拇指触头上。</p><p>　　次想◇左字。(即者字)两目瞳人上俱。</p><p>　　想◇礼字。复以大拇指触左右眼上。</p><p>　　次想◇祖字(即主字)安于颈上。用大拇指触。</p><p>　　次想◇礼字当心。以大拇指触。</p><p>　　次想◇准字安左右肩。以大拇指触。</p><p>　　次想◇泥字安[〦/(刀*了*(留-刀-田))/肉]上。以大拇指触。</p><p>　　次想◇娑嚩(二合)字安右左两?上。以小指触。</p><p>　　次想◇诃字安右左两胫上。以小指触。</p><p>　　智译。每字皆以偈释。及令观字色相。然其安布与本译略有参差。故不录。如欲知者。下持诵法要当出。又当知。令想九字真言。皆是天竺梵书。非此方之文。故一字顶轮王仪轨云。所言观诸字。唯瞻于梵书。非是随方文。有大神力用。或问曰。何以梵字。皆有不思议神用耶。答曰。谓每一一字。当体即是诸佛菩萨心故。当体即是离相法界故。当体即是教理行果故。是以有不可思议神用也。又天竺梵字。法尔本有。何以故。以世界初成时。梵王传说。不同此方苍颉等创制。若然者。凡天竺梵字。皆有不思议神用。何得偏赞真言中字耶。答曰。以真言中字。由诸佛不思议神力加持。体含多义。法性如然。故偏有神用。即如此方语言文字是一。唯急急如律令等语。咒火不烧。咒汤不热。咒刀不伤。咒毒不中。由作咒语。偏有此神用。非余一切文言。皆有此功力。天竺亦尔。文字虽一。唯真言中字。偏有神力。非余一切字。皆有如是神用也。或曰。咒是诸佛秘密之法。尚非因位所知。何以今解释此九圣字义。答曰。据贤首<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>疏。及神变疏。并密藏诸经。释陀罗尼字意。而有二门。一不可说门。谓咒是诸佛密法。唯佛与佛相传。不通他解。但当持诵。不须强释。二强说门。谓真言中随举一字。或作人。或作法。横竖该罗。自在解脱。以要言之。无尽法门。于一字中。解说都尽。方是陀罗尼字义。就此而言。假使十方诸佛。经恒沙劫。共说真言中一字义。亦不能尽。故庄严宝王经云。六字陀罗尼。是观自在菩萨微妙本心。无量如来。而尚难知。其因位菩萨。云何而能解耶。是知。知者尚难。况其受者。今于一字中。略为解释。即是强说门中。少分一途义耳。谓于真言一字中。或作二义五义十义。乃至百义等解释。名为少分义。若作一义解释。名为一途义。上云。尚非因位能解者。此据密教圆宗。不可说门而言也。其不可说门。义当密教圆宗。离言果海。其强说门。义当显教圆宗。带言因分也。</p><p>　　由想布真言结印加持故。行者身即成准泥佛母身。灭除一切业障。积集无量福德吉祥。其身成金刚不坏体。若能常专注观行。一切悉地皆得现前。速证无上正等菩提。</p><p>　　智译云。如是布字想念已。便成准提胜法门。亦名本尊真实相。能灭诸罪。得吉祥。犹如金刚坚固聚。是名准提胜上法。若常如是修行者。当知是人速悉地。故持明藏仪轨经云。若于准提菩萨法中求成就者。先观准提菩萨根本微妙字轮。安自身分。一一分明。是人先身所造一切罪业。悉得除灭。凡有所求。决定成就。神变疏云。真言行者。能令三业。即同本尊三业。又真言中。每一一字。皆是诸佛全身。故云行者身。即成准泥佛母身。故知此<a href=\"/fozhou/zhuntizhou/42807.html\" class=\"keylink\" target=\"_blank\">准提神咒</a>体即法身圆圆果海。用即不可思议。所以得速证无上菩提。</p><p>　　○次结根本印</p><p>　　如前阏伽印出。持明藏经云。行人结根本印。诵根本真言时。本尊菩萨欢喜顾视行人。</p><p>　　诵根本真言七遍。顶上散印。</p><p>　　智译用第二根本印。诵根本真言。</p><p>　　即取菩提子<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>。具一百八。依法贯穿。即以涂香。涂其珠上。以二手掌中。捧珠当心。诵真言七遍。加持念珠。</p><p>　　苏悉地经云。捧数珠时。微小低头。以至诚心。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>三宝诸佛菩萨。若作阿毗遮噜迦法。应用诸首而作数珠。速成就故。</p><p>　　真言曰。</p><p>　　唵吠嚧(引)遮那(引)么罗娑嚩(二合)(引)贺(引)</p><p>　　此是持珠真言。吠字。无盖切。智译作微字。于么字上有阿字。余悉同。吠嚧遮那。此云遍照。亦云大日。如世间日。唯照昼不照夜。照一世界。不照余世界。不得名大日。如来色身。法身。普周法界。十方世界悉皆照耀。若人称名皈依礼拜。则得法界一切诸佛菩萨贤圣。乃至八部。加持卫护。</p><p>　　加持顶戴。心口作是愿言。我今欲念诵。惟愿本尊诸佛菩萨。加持护念。愿令速得随意。所求悉地圆满。然后以左手无名指大指承珠。右手以大指无名指移珠。手如说<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。</p><p>　　先以珠加持顶载。后方结此持珠印。有云。右手大指捻无名指头。直舒中指。小指微屈。以头指着中指上节侧。此是佛部执数珠印。智译云。二手相去一寸许。余指散开微屈。</p><p>　　当于心前。持珠念诵。其声不缓不急。</p><p>　　此名言音持诵。根本真言。智译云。不得高声。须分明称字。而令自闻。此名声念。一字佛顶轮王念诵仪轨云。字句分明呼。不缓亦不急。不频伸哕嗌。咳??与唾涕。染等心相应。及与缘苦受。如是等过患。皆不得成就。</p><p>　　心专注。不异缘。观自身。同本尊身。相好具足。又于身前坛中。观想七俱胝佛母。与眷属围绕。了了分明对坐。</p><p>　　智译云。所观本尊及身上布字。念诵记数于一念中。并须一时观见。不得有缺使心散乱。苏悉地经云。念诵之时。不作异语。想真言如对目前。如是倾诚。不应散乱。心缘别境。身虽疲极。不纵放之。制诸恶气。世间谈话。皆不思念。不舍本尊。纵见奇相。而不怪之。</p><p>　　每称娑嚩(二合)(引)贺字。同时移一珠。</p><p>　　智译云。诵本尊陀罗尼一遍。以右手无明指捻一珠过。周而复始。</p><p>　　一百八。或一千八十。为念诵遍数。常须限定。若不满一百八。即不克求悉地遍数。</p><p>　　苏悉地经云。依法念诵了。应起诚心。作祈请云。我依本法念诵数满。唯愿尊者。领受为证。于其梦中。为授教诲。正念诵时。若有謦欬昏??欠呿。忌真言字。即起就水。作洗净法已。还从前念被所障隔。为须一一皆从始念掏珠将毕时。申礼一拜。终而复始。数珠一匝。一睹本尊颜。而作一礼。若正念诵时。忽然错误。当诚心忏悔。过由放逸。故致斯误。愿尊舍过。便申顶礼。复须从始。而念诵之。</p><p>　　念诵毕已。蟠珠于掌中。顶戴。发愿。作是愿言。以我念诵功德。一切众生。所修真行。求上中下悉地。速得成就。安珠于箧中。</p><p>　　言上中下悉地者。每地各有三品。共成九品。下三品者。若下品成就。能摄伏一切<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>。凡有所求。举意从心。一切天龙。而来问讯。又能伏一切虫兽。及鬼魅等。若中品成就。能驱使一切天龙八部。能开一切伏藏。或要入阿修罗宫。龙宫。便得入之。去住随心。若上品成就。便得仙道。乘空往来。天上天下。而得自在。世出世间事。无不通达。中三品者。若下品成就。便得诸咒仙中为王。住寿无数岁。福德智慧。三界无比。若中品成就。便得神通。往余世界。为转轮王。住寿一劫。若上品成就。现证初地已上。菩萨之位。上三品者。若下品成就。得至五地已上菩萨之位。若中品成就。得至八地已上菩萨之位。若上品成就。三密变成三身。只于此生。得证无上菩提之果。此是持咒人九品成就。若直求成佛。不须求中下三品等。即当求上三品成就。余如下增益法明。</p><p>　　即结定印。端身闭目。澄心静意。当于胸臆身内。炳现圆明。如满月。皎洁光明。起大精进决定取证。若能不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>专功。必当得见本源清净之心。于圆明中想唵字。余八字右旋于圆明上布列。于定中须见真言字分明。既不散动。得定。即与般若波罗蜜相应。即画圆明月轮。</p><p>　　即结定印者。以两手外相叉。仰于脐下。或以二手仰掌展舒。将右手在左手上。二大拇指甲相拄。安于脐轮下。又无量寿仪轨云。以二手外相叉。二头指背相着。从中节以上直竖。二大指捻二头指。即成。此之三印。随结其一。皆得作此圆明观法。名为瑜伽念诵。故智译云。若求解脱速出离生死。作此三摩地瑜伽观行。无记无数念者。即想自心如满月。湛然清净。内外分明。以唵字安月心中。以折隶主隶准提莎嚩诃字。从前右旋。次第周布轮缘。谛观一一字义。与心相应。不得差互。</p><p>　　圆明布列梵书图</p><p>　　X23076401.gif</p><p>　　持明藏仪轨云。唵字为毗卢遮那佛根本。左字为大轮明王根本。隶字为大忿怒不动尊明王根本。又为马头明王根本祖字为四臂佛身根本。隶字为不空罥索菩萨根本。亦观自在菩萨根本。尊字为大尊那菩萨根本。祢字为金刚萨埵菩萨根本。莎字为伊迦惹吒菩萨根本。贺字为嚩日啰曩佉明王根本。</p><p>　　次应思惟字母种子义。</p><p>　　此九圣字。能生一切字。故云字母。言种子者。是引生义。摄持义。以初一字为种子。而下诸字。所有观智。依所引生。摄入初字。若得唵字门。秘密相应。即得诸佛无尽法藏。则悟一切法本不生。一以普及为言。切以尽际为语。由悟一切法本不生。即达诸法空。以诸法入实相中。故不生不灭。乃至悟一切法言语道断。故无言说。法相平等。如霔大雨。故云平等。于一一字。专注思惟观察。则一切行愿。皆得满足。</p><p>　　唵字者。是三身义。亦是一切法本不生义。</p><p>　　智译云。唵字门者。是流注不生不灭义。复于一切法为最胜义。</p><p>　　左字者。一切法不生不灭义。</p><p>　　智译云。于一切法是无行义。</p><p>　　礼字者。一切法相无所得义。祖字者。一切法无生灭义。</p><p>　　智译云。于一切法是无起住义。</p><p>　　礼字者。一切法无垢义。准字者。一切法无等觉义。泥字者。一切法无取舍义。娑嚩字者。一切法平等。无言说义。诃字者。一切法无因义。</p><p>　　于一切法。是无因寂静无住涅槃义。</p><p>　　由一切法本不生故。即得不生不灭。</p><p>　　由不生不灭故。即得相无所得。</p><p>　　由相无所得故。即得无生灭。</p><p>　　由无生灭故。即得无垢。</p><p>　　由无垢故。即得无等觉。</p><p>　　由无等觉故。即得无取舍。</p><p>　　由无取舍故。即得平等无言说。</p><p>　　由平等无言说故。即得无因无果。</p><p>　　般若相应。无所得。以为方便。入胜义。实则证法界真如。以此为三摩地念诵毕已。</p><p>　　谓由悟一切法本不生故。平等无二。成无分别智。与般若波罗蜜无智无得相应。由此无所得智以为方便。悟入最胜义谛。证法界真如。此法界真如海。不可以言诠。是佛境界。自觉圣智所证。非思量分别所能知。智译云。所说文字义。虽立文字。皆是无文字义。既无文字。须谛观一一义相。周而复始。无记无数。不得断绝。不断绝者。为流注不生不灭最胜义。是故无行。为无行义。乃至云。无因寂静无住涅槃。为无因寂静无住涅槃义。是故不生不灭最胜无断。周而复始。此名三摩地念诵。按诸陀罗尼经。持诵法。亦有多种。今略出其六。一三摩地持。亦名瑜伽持。但想心月中布字。如本经布字法所明。二出入息持。即于出入息中。想有梵书真言字。若息出字出。若息入字入。字字分明。朗如贯明珠。不得间断。如息出时。想自心月轮中九圣梵字。字字连环。皆有五色光明。从自口中流入准提菩萨口中。右旋安布菩萨心月轮内。如息入时。想菩萨心月轮中字。字字连环。皆有五色光明。从菩萨口出。流入自口中。右旋安布心月轮内。如是终而复始想之。三金刚持。急口齿。舌不至?。但口中微动。四言音持。亦名微声持。但令自耳闻之。不缓不急。字字分明称之。五高声持。令他闻之灭罪。此须观时。若有不信者在傍。闻声。反生毁谤。便获重罪。只宜微声持之。六降魔持。内以悲心为本。外现威怒之相。颦眉厉声念之。如后阿毗遮噜迦法。是也。复有二种持诵。一无数持诵。谓不持珠定数。常无间断念之。二有相持诵。谓掏数珠。每日须得限定其数。不得阙少。于上八种持诵。随用其一。依法念诵无有间断。所祈胜果。决定成就。准金刚智所译本。亦出多种持诵。故智译本。次说准提求愿观想法云。若求无分别者。当观无分别无记念。若求无相无色。当观文字无文字念。若求<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>者。应观两臂。若求四无量。当观四臂。若求六神通者。当观六臂。若求八圣道。当观八臂。若求十波罗蜜圆满十地者。应观十臂。若求如来普遍广地者。应观十二臂。若求十八不共法者。应观十八臂。即如画像法观也。若求三十二相。当观三十二臂。若求八万四千法门者。应观八十四臂。如上观念。当入一切如来三摩地门。甚深方广不可思议地。是正念处。是正真如。正解脱。念诵观行了。欲出道场。复须依前次第更结烧香。灯明。饮食等。手契。供养。忏悔。随喜。发愿。即结前第一根本印。诵根本陀罗尼七遍。顶上散之。复结前辂车印云云。</p><p>　　应结根本印。</p><p>　　○次结澡浴印。</p><p>　　○次结五供养印。</p><p>　　○次诵赞叹献阏伽。</p><p>　　○次结阿三摩拟你(二合)印。左转一匝。解界。</p><p>　　谓结前火院印。诵阿三摩拟你真言。左转一匝。解前所结诸界。持明藏仪轨经云。复作供养。赞叹忏谢。某甲上来供养。绝无殊妙。唯愿菩萨<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>欢喜又献阏伽。而作顶礼。作法毕已。发遣贤圣。复作护身。次作阿三摩拟你印。</p><p>　　○次结宝车辂印</p><p>　　此中诸印。准前应结。辂车者。乃大车之总名。此方黄帝始制。天子所乘法车。名曰玉辂。今宝辂。是佛母所乘。上有幰盖。垂诸华缨。四面悬铃。周匝栏楯。七宝间错。种种严饰。</p><p>　　以大拇指向外。拨中指头。奉送圣者还本宫。</p><p>　　准智译。以二大拇指向外。三度拨二中指头。诵真言三遍。</p><p>　　奉送真言曰。</p><p>　　唵者礼主礼准泥。蘖车蘖车。婆誐嚩底。婆嚩(二合)(引)婆(引)嚩南。布娜啰(引)誐么那(引)野。娑嚩(二合)(引)贺(引)</p><p>　　车字。当书何切。蘖车蘖车。即奉送句。前请辂车羯哩洒耶。即迎请句。</p><p>　　○次结三部三么耶印。各诵真言一遍。礼佛。如前忏悔。随喜。劝请。发愿。回向无上菩提。随意经行。转读大乘经典。华严。大般若等经。印塔像。浴舍利。右旋绕。思六念。以此福聚。回向自所求悉地。</p><p>　　智译云。诵大般若。或华严。或无边门。或法华。楞伽。涅槃。大经论等。思惟讲说。或以七俱胝佛像塔印。用印香泥。沙上。纸上。随意印之多少。如念诵有功。如经所说境界。一一分明了知次第。苏悉地经云。为净心故。常持六念。心注一境。而不散乱。一<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>。二念法。三念僧。四念施。五念戒。六念天。前三是念他。后三是念自。以施戒是自因。天是自果。而果有近远。近是生天。远是第一义天。又前三。亦可为念自。谓念一体三宝也。优婆塞戒经云。念佛法僧。名智慧庄严。念施戒天。名福德庄严。然上所修。为欲速得圆满福智。及十波罗蜜。顿出世间。超三无数劫。现生祈克圣果。故须发菩提愿。运大悲心。常欲利乐一切有情。同于准提菩萨。复仗无边诸佛菩萨。以大悲愿。加持护助。使速成就。准此。必须依前选择胜处。为所修坛场。限四月四日为一期。屏绝往来言语。方得三密相应。面向东方。吉祥之位。或复余方。若不能依上如法结坛者。别有一法。亦须择一静处。于准提圣像前。置一净镜为坛。如上向方跏趺。对于圣像。行者先于自顶上。想一◇?字。变成三角火轮。从顶至足。烧尽自己有漏之身。及烧此有为世界。如同劫火。烧尽无遗。但有空寂而已。又想一◇暗字。在自顶门中。此字体。即是诸<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>明法水。用灌<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>之顶。此是秘密灌顶法门也。复想建立无为之坛。于最下方。遍想◇欠字杂色。而为空轮。于空轮上。遍想◇含字黑色。变成风轮。风轮上。遍想◇?字赤色。变成火轮。火轮上。遍想◇[金*(离-禸+ㄆ)]字白色。变成水轮。水轮上。遍想◇阿字黄色。变成金刚地。于金刚地上。遍想有大莲华。一一华上。皆有准提菩萨。饮食幢幡等诸供养具。而为供养。皆对准提镜坛。三密相应。又行者无准提像。并华果饮食等供具。但作此观。亦得吉祥成就。如是想已。一心谛观准提菩萨。具无尽相好光明。于菩萨心月轮中。有九圣字。右旋布列。行者想自心月轮中。亦有九字如前布列。于自身分。从顶至足。亦布九字。次诵唵?净法界真言。并唵齿??护身真言。各二十一遍。然后结根本印。或金刚拳。诵准提真言。无记无数。专精一意。勤策身心。不令懈怠。欲近成就时。或有种种障起。应如后作息灾等法。而降伏之。于一期中。随自根性。必获三昧现前。即于定中见无数佛会。闻妙法音。证得十地菩萨之位。行者欲于此法求成就者。须依前预诵准提真言一万遍。乃至十万遍。而为先行。如苏悉地经云。若不先诵遍满念持。所求下法。尚不得成就。况求上中悉地成就。以是义故。作胜上心。而先念诵。既为先行。便于梦中见诸佛菩萨吐出黑物等。即是罪灭福生成就之相。如念所求。决获果遂。莫生疑惑之心。勿起取舍之念。更须策发三业。加功诵持。亦不得以是境界炫卖于人。唯同道者。不为名利敬赞。方得说之。或曰。见如上相。得无成邪妄耶。曰。今依经持诵。正观成就。胜境自现。非同他修。斥离取相。如不达经各有旨。雷同取谤。毁灭大乘。自陷泥犁。然行者若欲持诵真言。必须求于明师。善晓梵音作法之者指决字句契印。不令讹谬。切勿师心。持诵无验。于咒生疑。自招愆咎。苏悉地经云。若复有人。久至持诵下品真言。纵自无力。于本尊边。转求上品自成。若于上品真言之中。心怀犹预。念持供养。复不精诚。虽于上品真言。彼念诵心轻。致招下品成就。故知持诵。皆由心意。诚心念诵。皆获悉地。若人持诵真言。久无效验。不可弃舍。倍增广愿。转加精进。以成为限。如此之人。速得成就。于其梦中。或于虚空有声告言。汝不应持是真言法。亦不应弃。复不瞋彼。何以故。并是魔故。唯须精进。不应退转。心不恶思。攀缘诸境。纵放诸根。恒常获净而念诵之。故香王陀罗尼经云。日别滤水。香汤洗浴。别着衣裳。大小行来。皆须洗净。入坛之时。须嚼杨枝。然后入坛。一心诵咒。莫思外事。持咒之法。不得<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>身。亦不得近触着女人。若触著者。即无验。</p><p>　　○次说息灾。增益。敬爱。调伏。四种法。</p><p>　　○扇底迦法者。求灭罪转障。除灾害。鬼魅。疾病。囚闭枷锁。疫病。国难。水旱不调。虫损苗稼。五星陵逼本命。悉皆除灭。烦恼解脱。是名息灾法。</p><p>　　扇底迦。义译为息灾。复含上多义。故存梵音而不直翻华言。下三法。准此应知。</p><p>　　作此法时。著白衣。面向北。交胫竖膝。吉祥坐。观本尊白色。供养饮食果子香华灯烛地等。悉皆白色。</p><p>　　交脚竖膝。名为吉祥坐。涂香用白擅。烧香用沉水。灯用酥然。如无酥。用白茶油。本译云。观作白色。智译云。并用白色。下三法亦然。</p><p>　　从月一日。至八日。日三时念诵。夜作护摩。息灾真言曰。</p><p>　　唵者礼主礼准泥(令某甲。若为他念诵。当称彼名)扇(引)底矩噜(二合)娑嚩(二合)(引)贺(引)</p><p>　　智译云。欲作扇底迦等。种种方法。或为自身或为他人。即任依法而作念诵。若欲求息灾。除一切鬼神。及聪明长命。求解脱者。即于道场中。面向北交脚竖膝而坐。乃至日三时念诵。及护摩等法。若念诵时。先诵根本陀罗尼三七遍已。然后但从唵字诵之。妙言曰。唵折隶主隶准提。与彼某甲除灾难。莎嚩诃。</p><p>　　○作此法时。并须于道场坛中。如无场坛。或于准提像前安置镜坛。更须想一白色圆坛。于圆坛中。遍想◇嚩字。或◇[金*(离-禸+ㄆ)]字。尊像供具。并自身。想在圆坛中。或于像前只涂一圆坛亦得。以慈心相应。从月一日初夜起。至月八日。每日三时洗浴。三时换衣。至日满时。或断食。或食三白食。谓乳。酪。粳米饭。</p><p>　　○布瑟置(二合)迦法者。求延命。官荣。伏藏。富饶。聪慧。闻持不忘。药法成就。金刚杵等成就。或作师子象马类。以真言加持三相现。随上中下所求获果。如苏悉地经广说。欲求持明仙。入&lt;</p></div>"
}]