[{
    "title": "第1549部 始终心要",
    "author": "湛然大师 译",
    "html": "<div class=\"B1_text\"><p>　　<strong>始终心要</strong></p><p>　　【唐】天台荆溪大师　湛然（711—782）　述</p><p>　　【附】《始终心要注》北宋永嘉<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>　从义　注　《始终心要解》释谛闲　解</p><p>　　夫“三谛”者，天然之性德也。中谛者，统一切法；<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>者，泯一切法；俗谛者，立一切法。举一即三，非前后也。含生本具，非造作之所得也。</p><p>　　悲夫！秘藏不显，盖“三惑”之所覆也。故无明翳乎法性，尘沙障乎化导，见思阻乎空寂。然兹三惑，乃体上之虚妄也。于是大觉慈尊，喟然叹曰：“真如界内，绝生佛之假名。平等慧中，无自他之形相。但以<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a><a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，不自<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>，莫之能返也。”</p><p>　　由是立乎<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>，破乎三惑，证乎三智，成乎<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。空观者，破见思惑，证一切智，成<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>德；假观者，破尘沙惑，证道种智，成<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>德；<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>者，破无明惑，证一切种智，成法身德。然兹三惑、三观、三智、三德，非各别也，非异时也。天然之理，具诸法故。然此三谛，性之自尔。迷兹三谛，转成三惑。惑破藉乎三观；观成，证乎三智；智成，成乎三德。从因至果，非渐修也。说之次第，理非次第。大纲如此，纲目可寻矣。</p><p>　　始终心要注</p><p>　　【唐】荆溪大师　湛然（711—782）　述</p><p>　　【北宋】永嘉沙门　从义（1042～1091）　注</p><p>　　在因名“始”，至果為“终”。<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>虽殊，諦德无别。圆顿上乘，旨归于此。所以荆溪立于心要。</p><p>　　夫三諦者，天然之性德也。</p><p>　　上句标指，下句发叹。天然者，如天之然，亦名自然。问：此与外道所计何别？答：外道所执，已為<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>所破，那忽谓同圆顿諦理。復次应知，若从破计，须荡自然。破计虽尔，理必自然。是则自行，乃遣执惰，<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>无妨作斯说也。至于下文“含生本具，祕藏不显，由三惑覆”，亦应准今料简显示。举一例诸，无劳委述。</p><p>　　中諦者，统一切法；真諦者，泯一切法；俗諦者，立一切法。</p><p>　　别示解释三諦相也。中者，不偏二边也。諦者，审而无虚也。统者，总也。一切法者，二边之法也。真者，无偽妄也。泯，亡泯也。一切法者，三千之法也。俗者，世俗也。立者，建立也。一切法者，百界之法也。当知此约，三諦别明。若从通说，应云：一中一切中，无真无俗而不中，则三諦皆统理而绝待也；一真一切真，无中无俗而不真，则三諦俱亡泯而<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>也；一俗一切俗，无中无真而不俗，则三諦并建立而宛然也。</p><p>　　举一即三，非前后也。含生本具，非造作之所得也。</p><p>　　上两句，示三諦融即显非纵横之殊异也。下二句，明三諦本具彰无作之妙法也。举一即三者，举其中諦非真非俗，当体泯法，復名真諦常自建立，又為俗諦中諦之一即三。既然真俗之二即三亦尔。准诸祖誥，亦应更云：即三而一，有可相离；即一而三，不可相混；非三非一，三一宛然。会之弥分，派之常合；横之復高，竪之又广。明镜等譬，真好研详。勿见三一相即之故，便乃不许。俗諦世法，真諦亡泯，中諦绝俗，言洋洋岂可诬哉。</p><p>　　悲夫！祕藏不显，盖三惑之所覆也。</p><p>　　三諦微妙，眾生不了称之為祕。法界包用不可尽，目之為藏。性虽微妙，浊成本有。譬如镜天，喻若尘云。今此总明，次文别尔。</p><p>　　故无明翳乎法性，尘沙障乎化导，见思阻乎空寂。</p><p>　　无明者，不了法界，无所明也；尘沙者，譬无知之数多也；见思者，从解等立名也。应知三惑，皆是性具，同体為障，难可了知。文云翳、障、阻者，异其文耳。</p><p>　　然兹三惑，乃体上之虚妄也。</p><p>　　结指惑障都非真实，空华之譬其在兹乎。</p><p>　　于是大觉慈尊，喟然叹曰。</p><p>　　大觉，即妙觉。喟然，叹声也。</p><p>　　真如界内，绝生佛之假名；平等慧中，无自他之形相。</p><p>　　通指三諦以為真如及平等慧，绝名离相。</p><p>　　但以眾生妄想，不自证得，莫之能返也。由是立乎三观，破乎三惑，证乎三智，成乎三德。</p><p>　　眾生在迷，未能復性。是故须明惑观等说，全性起脩，性无所移。全脩在性，脩常宛尔，一家所立。三諦文在《瓔珞》、《仁王》两经，三观文出《瓔珞经》下卷，三惑准《大品》、《大论》而开，三智具如《大品》三智品中，三德备在《大<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>》。</p><p>　　空观者，破见思惑，证一切智，成般若德；假观者，破尘沙惑，证道种智，成解脱德；中观者，破无明惑，证一切种智，成法身德。／</p><p>　　一念无相谓之空无法不备谓之假不一不异谓之中知一切法空寂一相名一切智知十法界诸种差异為道种智知于二边无非中道名一切种智照明為般若解缚名解脱清净名法身皆具常乐我净谓之德。</p><p>　　然兹三惑三观三智三德非各别也非异时也天然之理具诸法故。</p><p>　　上文别示恐谓纵横故兹融即显非别异是故当知三惑一念中破三观一心中脩三智一念而证三德一心而成惑观一如智德无别苟非性具寧免异殊山门教观永异诸家超过眾说良在兹焉。</p><p>　　然此三諦性之自尔。</p><p>　　重叹三諦非作所成。</p><p>　　迷兹三諦转成三惑惑破藉乎三观观成证乎三智智成成乎三德。</p><p>　　自迷之悟展转相由文中五三秪是一三无前无后因果理同。</p><p>　　从因至果非渐修也。</p><p>　　性德之行异乎歷别。</p><p>　　说之次第理非次第。</p><p>　　言不顿显故有前后若论其理实在剎那其理者何三千三諦。</p><p>　　大纲如此网目可寻矣。</p><p>　　諦德宏深故曰大纲诸法广多号為网目华严名法界方等為实相般若称佛母法华号髻珠<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>名佛师三諦是一法佛说种种名龙猛悟之而造论智者得之以开拓荆溪传之為心要是则十方大觉诸祖所传莫不归乎諦德祕藏像末惰浇<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>寡薄如斯法门不能宗重而更别求心要之术良由近代习大乘者杂滥故也。</p><p>　　始终心要注（终）</p><p>　　始终心要解</p><p>　　释谛闲解</p><p>　　登座谈云。举笔载书。一则利于当世。一则益及将来。皆用文字显第一义谛。以声色二尘为正教体也。然则徒以眼见耳闻。若不以言达意。随文入观。不过托之空言。载之简册而已也。须知文犹门也。言犹路也。即文以通其理。由言以了其心。始可谓藉语言以显实相。从文字而起观照。由观照而还契实相也。大经云。诸佛解脱。当于众生心行中求。今之具缚凡夫。谁曰不能用观道使亲见自心佛乎。爰释台宗九祖心要。以供夫<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>者。</p><p>　　先释题</p><p>　　始终心要。</p><p>　　心。即吾人现前一念之心。本非肉团。亦非缘影。以肉团乃色法。缘影即非心。的指圆明寂照<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>真心。所以无有内外中间。过现未来。分剂分隅等虚妄之相也。要。即三谛也。迷之为三惑。见思尘沙无明也。悟之为三因。正因了<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>因也。修之为三止三观。体真止。空观。方便随缘止。假观。息二边分别止。中观也。证之为三智。一切智。道种智。一切种智也。成之为三德。法身般若解脱德也。至果成三身。法身报身应身也。始终二字。赅六即。通迷悟。含<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>。收因果也。以迷悟言。理即为始。以修证言。名字即为始。以因果言。观行即为始。皆以究竟即为终也。言六。以事释。不无迷悟修证因果之殊。言即。以理明。则三惑三因三止三观三智三德三身。皆即三谛。无二体也。然则迷悟本空。修证亦幻。全性起修。全修在性。始终一贯。迷者。悟者。修者。证者。皆三谛也。事则始终宛然。故有六。理则始终不二。故曰即。明于斯。乃知一心之要旨也。释题竟</p><p>　　次入文</p><p>　　夫三谛者。天然之性德也。</p><p>　　首句标。夫。发语之端也。三谛真俗中也。次句叹。谓称性<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。具足河沙之多。虽迷不减。悟亦不增。不假修有。何待证成。故如天之自然受用。吾人日用自不知耳。</p><p>　　中谛者。统一切法。</p><p>　　中。不偏不倚也。谛。审实不虚也。一切法者。一。尽际之辞。切。赅括之语。略则根尘识界。广则百界千如。处中而言。即五位百法也。此等诸法。原无别体。故以中谛而总统之。即<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>之体大也。</p><p>　　真谛者。泯一切法。</p><p>　　真者无伪。即空寂也。泯者泯合。即融会也。意谓一切诸法。原无自性。当体即空。不过缘会则有。缘散则无。称真而观。当处寂然。了不可得。融通会合。本来无相。无相之相。即自性之相大也。</p><p>　　俗谛者。立一切法。</p><p>　　俗者俗有。无法不备也。立者建立。万象森然也。一切法。即前之五位百法。所谓色法十一心法八。五十一个心所法。二十四个不相应。</p><p>　　六个无为成百法。略则内六根。外六尘。中六识。即三六十八界也。广则三千性相。百界千如。数繁不赘。请详教乘法数。称俗而观。不舍一法。事事无碍。相相宛然。即自性之用大也。</p><p>　　举一即三。非前后也。</p><p>　　夫法性无为。不堕诸数。须知三谛。三非定三。约义说三。一非定一。据理说一。说三说一。皆随情耳。从通而言。一中一切中。无真无俗而不中。则三谛都统理而绝待也。一真一切真。无中无俗而不真。则三谛俱泯合而绝相也。一俗一切俗。无真无中而不俗。则三谛并建立而宛然也。所以举一即三而不纵。非前后也。言三即一而不横。非并别也。</p><p>　　含生本具。非造作之所得也。</p><p>　　凡血气之属必有知。故曰含生。凡有知者必同体。故曰本具。此指真净明妙虚彻灵通之心。非一非三。而三而一之谛理。即前所云天然之性德者是也。既云天然。不假造作。迷时无失。悟亦无得。故曰非造作之所得也。</p><p>　　悲夫。秘藏不显。盖三惑之所覆也。</p><p>　　悲夫。叹辞也。谛理非他。是吾人固有之真心。如衣里明珠。不逢亲友指示。其人不知。所谓怀珠作丐。故可叹耳。不知自心之妙曰秘。含于<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>垢中曰藏。从来未悟。虽常现前。迷不自知。故曰不显。三惑。谓见思尘沙无明惑也。盖。小转之辞也。意谓吾人固有灵妙之真心。所以秘藏不现前者。盖是迷此一心三种妙谛。迷即不了也。不了真谛。起见思惑。不了俗谛。起尘沙惑。不了中谛。起无明惑。以迷惑故。虽现前而不知。如眼被翳障。觌面而不相识也。然三惑无体。全依三谛为体。如人迷方。依方故有迷也。问。惑性本空。无相可得。安能覆谛。答。即指以不了为覆。非同物以覆物也。</p><p>　　故无明翳乎法性。尘沙障乎化导。见思阻乎空寂。</p><p>　　此释三惑覆三谛也。法性即中谛。前云统一切法者。言法性也。化导指俗谛。俗谛门中。一切有情为所化导也。空寂即真谛。谓一切法本来寂灭。终归于空也。无明根本惑也。尘沙见思枝末惑也。谓不了中谛。一中一切中。离边无中。空有即中也。不了。即无明之异名词耳。不知俗谛门中一切诸法。能化所化。唯是假名。各无实体。则一假一切假。离真中无假。真中俱假也。此惑数多。如尘若沙。从喻立名也。不解诸法无生。依他而起。当体本空。则一空一切空。离俗中无空。俗中皆空也。以不解故。妄于诸法上起见思惑。执我我所。此惑从谬解立名也。翳障阻三字。即覆之变名词耳。</p><p>　　然兹三惑。乃体上之虚妄也。</p><p>　　然。转语也。三惑无体。唯是假名。如空里狂花。犹梦中幻境。空原无花。花由目病。梦本无境。境由心迷。乃彻底不真。故曰虚妄。体。即三谛也。</p><p>　　于是大觉慈尊。喟然叹曰。真如界内。绝生佛之假名。平等会中。无自他之形相。</p><p>　　无明大梦。虽十地等觉诸大士。睡眠未醒。唯佛一人。可称大觉。乃我本师大慈悲父。称慈尊也。喟然是叹声。曰下是叹词。前是祖叹。今是佛叹也。真如平等。都指真心妙谛。其性不妄曰真。无分剂方隅等虚妄相故。其体不异曰如。无生灭垢净等差别。异故。不高不低。曰平。离圣解凡情见故。无党无偏曰等。情与非情悉周?故。界会二字。指妙谛之范围。范围宽大。横竖赅罗也。众生诸佛。皆假名耳。自己他人。皆妄相也。妙谛性中。都无是事。故曰绝无。经云。妙性圆明。离诸名相。本来无有世界众生。论云。离名字相。离心缘相。毕竟平等。无有变异。此之谓也。</p><p>　　但以众生妄想。不自证得。莫之能返也。</p><p>　　众生乃九界通称。一向在迷。从来未悟。不了真心。用诸妄想。故曰不自证得妄想。指三惑也。谓用见思。不证真谛。用尘沙。不证俗谛。用无明。不证中谛。一向随想<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。不能返妄归真也。随见思流。名六凡众生。随尘沙流。名二乘众生。随无明流。名大道心众生。</p><p>　　由是立乎三观。破乎三惑。证乎三智。成乎三德。</p><p>　　由是承接之辞。承上文接下文故。立乎下。<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>用大乘法药。对治众生之心病也。立观是用药。修观是服药。破惑是除病。证智是成德。乃见效复元也。山家用文。三谛准仁王经。三观准璎珞　经。三惑准智度论。三智准大品般若经。三德准大般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经也。</p><p>　　空观者。破见思惑。证一切智。成般若德。假观者。破尘沙惑。证道种智。成解脱德。中观者。破无明惑。证一切种智。成法身德。</p><p>　　此为不得意者。作次第说耳。其实。圆顿行人。于名字位中。圆悟一谛三谛之理。于观行位中。圆起一观三观之修。全性德而起修德。相似位中。粗垢任运先落。脱四住烦恼也。分证位中。圆破三惑。圆证三智。圆成三德。所谓一悟一切悟。一修一切修。一破一切破。一证成一切证成也。文虽次第。意在一心耳。知诸法无性。而不起分别。于此相应。名空观。达诸法如幻。唯是假名。于此相应。名假观。了诸法非有非无。不一不异。若时若处。无不相应。名中观也。于三止中。空观。即体真止谓体解无性。当体即真故。假观。即随缘止。谓识得假名。到处可随缘故。中观。即息边止。亦名不止止。谓了非有无一异。则二边俱可息灭。不止而止也。一切智者。明知诸法本空。无二相也。道种智者。明知十界种性。差别不同也。一切种智者。明见<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。离四句。绝百非。惑解同源。生佛莫二也。彻照心源名般若。究竟无缚名解脱。一切俱是名法身。各具常乐我净。故三皆称德也。</p><p>　　然兹三惑三观三智三德。非各别也。非异时也天然之理。具诸法故。</p><p>　　此为得意者。作<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>具德说耳。此本旨也。意显迷悟修证。破立同时。不离当念。故非各别。同在<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。故非异时。能破是观。所破是惑。能证是智。所成是德。能所不二。修证一揆。性具一宗。回超诸说者。良在兹焉。</p><p>　　然此三谛。性之自尔。迷兹三谛。转成三惑。惑破藉乎三观。观成证乎三智。智成成乎三德。从因至果。非渐修也。说之次第。理非次第。</p><p>　　此结翻迷成悟。从性起修。成因<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。展转相由也。意谓。迷一心而起三惑。无别有迷。即迷此三谛也。如依方故有迷。惑东谓西也。悟一心而为三因。无别有悟。即悟此三谛也。如悟东西之方。分明不惑也。修一心而为三止三观。无别有修。即依三谛而修也。如人既不迷东西之路。可直道而行也。依真谛而修。</p><p>　　为体真止。名空观。即观一念心当体了不可得也。</p><p>　　依俗谛而修。为随缘止。名假观。即观一念心。当下历历明明也。依中谛而修。为息边止。名中观。即观一念心。当了不可得时。正历历明明。当历历明明时。正了不可得。如是。则能观之观。空假不二。所观之境。真俗不二也。证一心而为三智。无别有证。证此三谛也。成一心而为三德。无别有成。成此三谛也。如人就道而行。得路还家也。<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>是因。智德是果。因果本乎一心。故非渐修。始终不离当处。故非次第。同一三谛之理耳。</p><p>　　大纲如此。网目可寻矣。</p><p>　　大纲指心要。网目指教眼也。教法无量。犹之弥天之网。即以谛观为纲。性修为目耳。三谛原一法。佛说种种名。龙树悟之而造论。智者证之以立宗。佛祖授受。递代相承。莫不教人悟乎三谛。修乎三观。破乎三惑。证乎三智。成乎三德。今则观修谛显。惑破智证。则始终之能事毕矣。故荆溪用之为心要。说之为大纲。纲提目张。观明道悟。俾学者庶免问津泣歧之叹。故曰网目可寻矣。释文竟。</p><p>　　始终心要解终</p></div>"
}]