[{
    "title": "因明入正理论疏 第1840部",
    "author": "窥基大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>因明入正理论疏 卷上</p><p>大慈恩寺<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>基撰</p><p>详夫。空桑启圣。资六位以明玄。苦赖兴仙。畅二篇而显理。岂若智圆十力。陶万像以凝规。悲极三轮。廓五乘而垂范。是以。应物机于双树。至教浃于尘洲。归真寂于两河。余烈光乎沙劫。大矣哉。固难得而名也。暨乎二十八见。蚁聚于五天。一十六师。鵄张于四主。爰有菩萨。号商羯罗。圣者域龙之门人也。既资善诱。实号多闻。挹慧海于深衷。竦义山于奥腑。故乃凿荆岑而采璞。游蛤浦以求珠。秘思优聚。乃制宏论。其旨繁而文约。其理幽而易晓。寔法户之枢机。乃玄关之钤键矣。遂令胜论数论。同峤山之压春卵。声生声显。譬惊飙之卷秋萚。自时厥后。教思波纷。胜躅肇彰。耽玩终广。粤以。金容晈梦。玉牒晖晨。虽至教已隆。而斯典未备。惟我亲教。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>大师。道贯五明。声映千古。嗟。去圣之弥远。慨心冰之未释。遂乃振锡中区。以发觉城之地。寻师西夏。直诣耆阇之山。[車*藺]曩哲之未闻。并苞心极。架前贤之不觌。咸贯情枢。于是。贝叶撰于微言。家邦返以神足。方言既译。道理攸畅。基。谬黍资列。欣夕死于朝闻。恐此道不行。乃略述阅释。示纪纲之旨。陈幽隐之宗。庶明悬智镜者。幸留心而鉴照矣</p><p>今此论中。略以四门分别。一叙所因。二释题目。三彰妨难。四释本文</p><p>第一叙所因者。因明论者。源唯佛说。文广义散。备在众经。故地持云。菩萨求法。当于何求。当于一切五明处求。求因明者。为破邪论。安立正道。劫初足目。创标真似。爰暨世亲。咸陈轨式。虽纲纪已列。而幽致未分。故使宾主对扬。犹疑立破之则。有陈那菩萨。是称命世。贤劫千佛之一佛也。匿迹岩薮。栖虑等持。观述作之利害。审文义之繁约。于时。崖谷震吼云霞变彩。山神捧菩萨足。高数百尺。唱云。佛说因明。玄妙难究。如来灭后。大义沦绝。今幸福智悠邈。深达圣旨。因明论道。愿请重弘。菩萨乃放神光。照烛机感。时彼南印度。案达罗国王。见放光明。疑入金刚定。请证无学果。菩萨曰。入定观察。将释深经。心期大觉。非愿小果。王言。无学果者。诸圣攸仰。请尊速证。菩萨抚之。欲遂王请。妙吉祥菩萨。因弹指警曰。何舍大心。方兴小志。为广利益者。当传慈氏所说瑜伽论。匡正颓纲。可制因明。重成规矩。陈那敬受指诲。奉以周旋。于是。覃思研精。作因明正理门论。正理者。诸法本真之体义。门者。权衡照解之所由。商羯罗主。即其门人也。岂若苏张之师鬼谷。独擅纵横。游夏之事宣尼。空闻礼乐而已。既而善穷三量。妙尽二因。启以八门。通以两益。考核前哲。规模后颖。总括纲纪。以为此论。大师行至北印度境迦湿弥罗国法救论师寺。逢大论师僧伽耶舍。此云众称。特善萨婆多。及因声明论。创从考决。便晓玄猷。后于中印度境摩揭陀国。复遇尸罗跋陀菩萨等。重讨幽微。更精厥趣。披枝叶而穷其根柢。寻波澜而究其源穴。虽前修而桂悟。未烈我师之芳闲。旋踵弘扬。因训初学。庶使对扬邪正。司南有轨。斯乃此论之因起也</p><p>第二解题目者。梵云醯都费陀(次上二字并舌头轻声呼之)那耶钵罗吠奢奢萨怛罗。醯都言因。费陀云明。那耶称正理。钵罗吠奢翻入。奢萨怛罗论也。唐云因明正理入论。今顺此方言。称因明入正理论。依此标名。合为五释。一云。明者。五明之通名。因者。一明之别称。入正理者。此论之别目。因体有二。所谓生了。二各有三。广如下释。今明此因义。故曰因明。所明者因。能明者教。因之明故。号曰因明。依主释也。入者。达解。正理者。诸法本真<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>差别。时移解昧。旨多沉隐。余虽解释。邪而不中。今谈真法。故名正理由明此二因。入解诸法之真性。即正理之入。亦入正理之因明。并依主释也。明体是教。因明即论。持业释也。简藏为名。无重言失。二云。因明者。一明之都名。入正理者。此轴之别目。因谓立论者言。建本宗之鸿绪。明谓敌证者智。照义言之嘉由。非言无以显宗。含智义而标因称。非智无以洞妙。苞言义而举明名。立破幽致。称为正理。智解融贯。名之为入。由立论者立因等言。敌证智起。解立破义。明家因故。名曰因明。依主释也。由言生智。达解法之幽致名入。正理之入。亦入正理之因明。并依主释。三云。因者言生因。明者智了因。由言生故。未生之智得生。由智了故。未晓之义今晓。所晓宗称正理。所生智名为入。因与明异。俱是因名。正理入殊。咸为果称。由言生因故。敌者入解所宗。由智了明故。立者正理方显。应云正理之入。入正理之因明。并依主释也。立论虽假言生。方生敌论之智。必资智义始有言生。敌者虽假智了。方解所立之宗。必藉义言方有智了。故虽但标言生智了。即己兼说二了二生。摄法己周。略无余也。四云。因明者。本<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>之名。正理者。陈那论之称。陈那所造四十余部。其中要最正理为先。入论者。天主教之号。因谓智了。照解所宗。或即言生。净成宗果。明谓明显。因即是明。持业释也。故瑜伽论第十五言。云何因明处。谓于观察义中。诸所有事。所建立法名观察义。能随顺法名诸所有事。诸所有事即是因明。为因照明观察义故。正理。简邪。即诸法本真自性差别。陈那以外道等妄说浮翳。遂申趣解之由。名为门论。天主以旨微词奥。恐后学难穷。乃综括纪纲。以为此论。作因明之阶渐。为正理之源由。穷趣二教称之为入。故依梵语。因明正理入论。依主释也。五言因明正理。俱陈那本论之名。入论者。方是此论之称。由达此论。故能入因明正理也。或因明者。即入论名。正理者。陈那教称。由此因明论。能入彼正理故。或因明者。能入所入论之通名。入正理者。能入所入论之别称。由此因明能入论故。达解所入因明正理。或此应云。因即是明。正者即理。并持业释。此五释中。第一因之明。第二明之因。第三因与明异。第四因即是明。第五属在何教。正理亦五。一诸法真性。二立破幽致。三所立义宗。四陈那本论。一一总通前四。由此一一别配。但为五解。绮互释之。合成二十五释。恐文繁广。故略不述。然依初解。教亦因明。依后四释。教是彼具。亦名因明。论者。量也。议也。量定真似。议详立破。决择性相。教诫学徒。名之为论。依后四释。既是所诠。论者是教。即因明入正理之论。依主释也。欲令随证。因生之明。而入正理。故说此论。如<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>论。或此辨说因明正理之能入。立此论名。如十地经。或依能入正理因明。而说此论。如水陆花。故以为号。商羯罗主菩萨造者。梵云商羯罗塞缚弥<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>萨埵讫栗底。商羯罗者。此云骨琐。塞缚弥者。此云主。菩提萨埵。义如常释。讫栗底者。造。唐音应云骨琐主菩萨造。外道有言。成劫之始。大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a><a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>间化导。二十四相。匡利既毕。自在归天。事者顾恋。遂立其像。像其苦行悴疲饥羸骨节相连形状如琐。故标此像名骨琐天。劫初虽有千名。时减犹存十号。此骨琐天即一名也。菩萨之亲。少无子息。因从像乞。便诞异灵。用天为尊。因自立号。以天为主名骨琐主。即有财释。此论是彼之所造也</p><p>第三明妨难者。一问何故不名宗明喻明。但称因明。答因有三相。名义宽故。又诸能立皆名为因。非唯一相。宗由此立。总名因明。二问真因真明。可说因明。似因似明。应非因明。答举真摄似。或已摄故。或兼明之。非正明故。三问量立量破。可名因明。过破似破。应非因明。答是因明类故。或似真俱因明。名略已摄故。四问立破有言智。可是因明。现比无智言。应非因明。答见因亦明。见因证明。自证亦因。故皆因明。五问智生。智了可名因明。二了。二生非智。应因非是明。答是明之因。或皆顺照成宗义故。六问因喻能立。可说因明。宗非能立应非因明。答由不决定故所立非。从定为名故无有失。又能因能明。正是因明。所因所明。兼亦因明。又今者所立唯宗。能立虽唯因喻。言不违古。宗亦因明。七问何故不名果明。但名因明。答果有果之明。非果皆即明。因有因之明。是因皆即明。果明不定。义亦有滥。因明两定。义亦无滥。故名因明。本欲以因成果义故。不欲以果成因义故</p><p>第四释本文者</p><p>论。能立与能破及似唯悟他<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>与比量及似唯自悟</p><p>述曰。一部之中。大文有二。初颂及长行。标宗随释分。末后一颂。显略指广分。初分有二。前之一颂。举类标宗。后诸长行。随标别释。条贯义类。举标论宗。于前所标。随应释故。初颂之中。谈颂有一。彰悟有二。论句有四。明义有八。一颂四句。文瞩可知。悟他自悟。论各别显。四真四似。即为八义。一者能立。因喻具正宗义圆成。显以悟他。故名能立(陈那能立。唯取因喻。古兼宗等。因喻有二义。一者具而无阙。离七等故。二者正而无邪。离十四等故。宗亦二义。一者支圆。能依所依皆满足故。二者成就。能依所依俱无过故。由此论显真而无妄。义亦兼彰具而无阙。发此诚言。生他正解。宗由言显。故名能立。由此似立决定相违。虽无阙过。非正能立。不能令他正智生故也)二者能破。敌申过量。善斥其非。或妙征宗。故名能破(此有二义。一显他过。他立不成。二立量非他。他宗不立。诸论唯彰显他过破。理亦兼有立量征诘。发言申义。证敌俱明。败彼由言。故名能破也)三者似能立。三支互阙。多言有过。虚功自陷。故名似立(此有二义。一者阙支。宗因喻三。随应阙减。二者有过。设立具足。诸过随生。伪立妄陈。邪宗谬显。兴言自陷。故名似立)四者似能破。敌者量圆。妄生弹诘。所申过起。故名似破(此有二义。一者敌无过量。妄生弹诘。十四过类等。二者自量有过。谓为破他。伪言谓胜。故名似破)文说与字。表多体相违(立破真似。体义有异。说与字者。显体相违)致及似言。显过通能立破(表前能立。有似能立。并显能破。有似能破。举真等似。故称及也)宗义各定(本所解也)邪正难知(未共许故)由况既彰(由因况喻彰谓显也)是非遂着(宗成曰是。不成曰非。著者明也。真似言兴。是非宗晓)功成胜负。彼此俱明(能立能破。由自发言。功既成胜。证敌俱解。似立似破。自功成负。由他指述。证立俱明)故从多分。皆悟他也。理门论云。随其所应。为开悟他。说此能立及似能立。能立悟敌及证义者。由自发言。生他解故。似立悟证及立论主。由他显己。证自解生。故言随应能破似破。准知亦尔。此论下文。能立能破。皆能悟他。似立似破不能悟他。正与彼同。故此颂中。据其多分。皆悟证者。言唯悟他。不言自悟。又真立破。唯悟于他。似虽亦自。从真名唯。五者现量。行离动摇。明证众境。亲冥自体。故名现量(能缘行相。不动不摇。因循照境。不筹不度。离分别心。照符前境。明局自体。故名现量。然有二类。一定位。二散心。定心澄湛。境皆明证。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>何法。皆名现量。一切散心。若亲于境。冥得自体。亦皆现量)六者比量。用已极成。证非先许。共相智决。故名比量(因喻已成宗非先许。用已许法。成未许宗。如缕贯花。因义通被。共相智起。印决先宗。分别解生。故名比量。虽将已许。成未许宗。智生不决。非比量摄)七者似现量。行有筹度。非明证境。妄谓得体。名似现量(散心有二。一有分别。二无分别。诸似现量遍在二心。有分别心。妄谓分明得境自体。无分别心。不能分明冥证境故。名似现量。论据决定。唯说分别。非无分别心。皆唯现量故)八者似比量。妄兴由况。谬成邪宗。相违智起。名似比量(妄起因喻。谬建邪宗。顺智不生。违解便起。所立设成。此彼乖角。异生分别。名似比量)。及似等言。皆准前释。法有幽显(幽微显著也。若现量境。理幽事显。若比量境所立为幽。能立为显)行分明昧(行谓能缘心等行相。真现比于境。幽显俱明。似现比于境。幽显俱昧)。故此二刊定。唯悟自非他(现比<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>唯自智。故二刊定悟自非他)。虽自不晓。无以悟他。理应颂中。后他先自。但以权衡之制。本以利人。故先悟他。后方自悟。辨此八义略以三门。一明古今同异。二辨八义同异。三释体相同异。明古今同异者。初能立中。瑜伽十五。显扬十一。说有八种。一立宗。二辨因。三引喻。四同类。五异类。六现量。七比量。八正教。对法亦说有八。一立宗。二立因。三立喻。四合。五结。六现量。七比量。八圣教。皆以自性差别。而为所立。瑜伽显扬八能立中。三引喻者。总也。同类异类者。别也。于总比况假类法中。别引顺违。同品异品。而为二喻。总别有殊。分为三种。离因喻外无别合结。故略合结而不别开。对法无著八为能立。顺前师故。以因总别。既无离合。喻之总别。何假合离。故总说一不开二喻。离喻既亏故加合结。合结虽离。因喻非有。令所立义。重得增明。故须别立。喻过既说无合倒合。翻立真支。理须有合。合既别立。结亦须彰。由此亦八。古师又有说四能立。谓宗及因同喻异喻。世亲菩萨。论轨等。说能立有三。一宗。二因。三喻。以能立者。必是多言。多言显彼所立便足。故但说三。且喻总别。终是见边。故对法言。立喻者。谓以所见边。与未所见边。和合正说。师子觉释。所见边者。谓已所显了分。未所见边者。谓未所显了分。以显了分。显未显了分。令义平等。所有正说名为立喻。故总说一喻。已令所立见边。何假别开。或三或二。喻中无合。义乃不明。倒合倒成。故说为过。离因及喻。都无胜体。故不说在真能立中。但说因初。喻随其后。合义已明。重说有结。一何烦长。故总略之。立论。者现量等三。疎有悟他。故名能立。敌论者现量等三。亲唯自悟。故非能立。今者陈那因喻为能立。宗为所立。自性差别二并极成。但是宗依未成所诤。合以成宗。不相离性。方为所诤。何成能立。故能立中。定除其宗。问然依声明。一言云婆达喃。二言云婆达泥。多言云婆达。今此能立婆达声说。既并多言。云何但说因喻二法以为能立。答陈那释云。因有三相。一因二喻。岂非多言。非要三体。由是定说宗是所立。陈那以后。略有三释。一云。宗言所诠义为所立。故瑜伽论第十五云。所成立义有二种。一自性。二差别。能成立法有八种。其宗能诠之言。及因等言义。皆名能立。其宗言。因喻成故。虽亦所立。彼于论说。何故先立宗耶。为先显示自所爱乐宗义。故亦所立。非定所立。能成义故。犹如于因。喻所成故。但名能立。宗所诠义。定唯所立。独名所成。二云。诸法总集。自性差别。若教若理。俱是所立。论俱名义。随应有故。总中一分。对敌所申。若言若义。自性差别。俱名为宗。即名能立。虽此对宗。亦是所立能立总故。得能立名。故陈那等宗名所立。与瑜伽等理不相违。瑜伽等不说宗非一向唯能立故三云。自性差别。合所依义。名为所立。能依合宗说为能立。总立别故。非此总宗定唯能立。对敌合申。因喻成故。亦是所立。由非定所立。故得能立名。陈那但以共许因喻。成他未许。他未许者。唯是合宗。宗为所立。自性差别。但是宗依。非是所立。所立之具。所望义殊。不相违也。不尔慈氏无著天亲。岂不解因明。说所为能立。次解能破中。诸论但有显敌过破。无立量破。立量即显彼之过故。显过破中。古师有说八为能立。阙一有八。阙二有二十八。乃至阙七有八。阙八有一。亦有说四以为能立。阙一有四。阙二有六。阙三有四。阙四有一。世亲菩萨。缺减过性。宗因喻中。阙一有三。阙二有三。阙三有一。世亲已后皆除第七。以宗因喻三为能立。总阙便非。既本无体何成能立。有何所阙而得似名。陈那菩萨。因一喻二。说有六过。则因三相六过是也。阙一有三。阙二有三。无阙三者。大师至彼六十年前。施无厌寺。有一论师。名为贤爱。精确慈悲。特以贯世。因明一论。时无敌者。亦除第七。自余诸师。不肯除之。因一喻二。则因三相。虽有申宗。不申因喻。如数论者。执我为思。不申因喻。岂非过也。又虽有言。而三相并阙。如声论师。对<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者。立声为常。德所依故。犹如择灭诸非常者。皆非德依。如四大种。此德依因。虽有所说。三相并阙。何得非似。由此第七亦缺减过。似能立中。且九似宗陈那菩萨理门等论。立有五种。不说后四。谓能.所别.俱不极成.相符极成。以理门说宗等多言说能立。此中唯取随自意。乐为所立说名宗。非彼相违义能遣后之四种既非相违所以略之。天主宗过。不但相违。故申九种。第二释云。陈那菩萨。以能别不成。即是因中不共不定等过。亦是喻中所立不成。阙无同喻等过。所别不成。有法无故。即因过中所依不成过。其俱不极成。即合是二过。相符极成者。凡所立论。名义相违。既曰相符。便非所立。本非宗故。依何立过。如诸俗人不<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>者非受戒类。依何说有持戒<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。是故不说后之四过。今者天主。加能别不成。以宗合取。不相离性方得成宗。若非能别谁不相离。若以因中是不共不定等。亦是喻中所立不成。恐繁重故不须说者。因中已有阙同品。有不共等过。喻中复说能立不成。一何郑重。是故加之。天主复加所别不成者。若以是因所依不成。亦恐重故略不须说者。因中已有异品遍转等不定过。及是异品非遍无过异喻之中。更何须说能立不遣。何废宗过亦为因过。余难同前是故加之。俱不成者。合二为之。要有二种。互相差别。不相离性。方得成宗。彼二并非。何成宗义。是故加之。若此上三不立过者。所依非极。便更须成。宗既非真。何名所立。相符极成者。若以相符本非宗故。依何立过。两俱不成及俱不成。并俱不遣。本非因喻。依何立过。若以因喻有所申述何非过者。宗亦有说。如何非过。是故加之。但陈那影略说。天主委具陈之。非是师资自为矛盾。又陈那以前古师。宗中复说宗因相违过。陈那理门自破之云。诸有说言。宗因相违名宗违者此非宗过。以于此中立声为常。一切皆是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>故者。是喻方便恶立异法。由合喻显非一切故。陈那意言。如声论者立声为常。一切皆是无常故因。是彼外道立宗之喻。方便矫智。恶立异法无常之义非欲成宗所立声常。释所因云。由合喻显非一切故。陈那正云。立声为常。正因应言非一切故。以外道说非常之法。有多品类。种种差别。名为一切。故立声常。非一切因。合喻中云。诸非一切故者。皆体是常。犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。何得乃以一切皆是无常之因。立常宗也。复云此因非有。以声摄在一切中故。陈那意言。此古所引一切皆是无常故因。于其所立常声非有。以声摄在一切皆是无常中故。便是因中两俱不成。共不许因。有法有故。其立声常。非一切因。陈那复云。或是所立一分义故。唯外道许非一切因。于宗中有。内道不许声非一切。因于宗无。即是随一不成因过。故此二徒。皆非宗过。名因过失。亦是异喻倒离之过。一切离法。先宗后因。既立常宗。非一切因。异喻离言。诸无常者。皆是一切。而今说言一切皆是无常故。故先因后宗。故成倒离恶立异法之无常义。由此宗违。非是宗过。是因喻过。陈那既破。天主顺从。故亦不立。若以因过。宗中不立。既是喻过。因应不立。且如相违。及不共不定应非喻中能立不成。今释不然。因有三相体义最宽。但陈其因。有是相违不共不定。未举其喻。过已彰讫。今陈其宗。犹未有过。举因方过。何得推过乃在宗中。不同比量相违。彼但举宗。已违因讫。今此不尔。是故但应如陈那说。外道因明。四不成中。但说两俱及随一过。不说犹预所依不成。此不成因。亦不成宗。立敌或偏所不成故。陈那说言。其理虽尔。因依于宗。或决或疑。宗或有无。既有差别。总合难知。故开为四。理门论中。古亦有说不定有五。除不共因。异品无故。陈那加之。由不共故。此如何等。诸量之中。古说或三。现量。比量。及圣教量。亦名正教及至教量。或名声量。观可信声而比义故。或立四量。加譬喻量。如不识野牛。言似家牛。方以喻显故。或立五量。加义准量。谓若法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>准知必无常。无常之法。必无我故。或立六量。加无体量。入此室中见主不在。知所往处。如入鹿母堂不见苾刍。知所往处。陈那菩萨废后四种。随其所应摄入现比。故理门云。彼声喻等。摄在此中。由斯论主。但立二量。此上略明古今同异。别义所以。至下当知。辨八义同异者。有是能立而非能破。如真能立建立自宗。有释。无此。能立自宗即能破敌。必对彼故。有是能破而非能立。如显过破。有释。无此。但破他宗自便立故。有是能立亦是能破。如真立破他所不成。有释。无此。立谓能申自。破谓就他宗。有非能立亦非能破。谓似立破。有是能立而非似立。谓真能立。有是似立而非能立。除决定相违。所余似立。有是能立亦是似立谓决定相违。有释。无此。此唯似立非能立故。立者虽具言。他智不决故。有非能立亦非似立。谓妄破他所成立义。有是能立而非似破。如无过量。有是似破而非能立。如十四过类等。有是能立亦是似破。如决定相违。有释。无此。此但似破。非真立故。有非能立亦非似破。谓显过破。有释。无此。显他过非。自便立故。能破定非似立亦非似破。真似异故。有是似立而非似破。谓有过量建立自宗。有释。无此。自宗义成。即是真破。自既不立。即似破他。有是似破而非似立。谓妄显他非。十四过类。有释。无此。妄谓破他。即妄立故。有似能立亦是似破。如以过量破他不成。有非似立亦非似破。谓真能立。或真能破。似现似比。总入非量。由此可言现量非比及非非量。比量亦是非非量摄。有是现量非比非量。谓证自相真现量智。有比非量非真现量。即证共相。比量智及诸非量。此依见分。若依心体。见分通比非。自证必现故。是故八义体唯有七。虽就他宗。真能立体。即真能破。有显过破。非真能立。虽似能立则似能破。妄出过破。非似能立。故能立外。别显能破。似立之外别显似破。真现真比。似现似比。智了因摄。二智了故。由斯八义。体唯七种。真似相明。故义成八。释体相同异者。即解论文。辨八体相之同异也</p><p>论。如是总摄诸论要义</p><p>述曰。自下第二随标别释。于中有三。初总绾群机。次依标随释。后且止斯事。方隅略示显息繁文。此即初也。如是者。指颂所说。总摄者。以略贯多。诸论者。今古所制一切因明。要义者。立破正邪纪纲道理。此义总显瑜伽.对法.显扬等说。因明有七。颂曰。论体。论处所。论据论<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。论负论出离。论多所作法。一者论体。谓言生因。立论之体。二者论处。所谓于王家证义者等。论议处所。三者论据。谓论所依。即真能立及以真现比量等。其自性差别义为言诠。亦所依摄。四者论庄严。谓真能破。五者论负。谓似立似破。六者论出离。将兴论时。立敌安处身心之法。七者论多所作法。由具上六能多所作。今此括要。总为一颂。虽说八门即彼四种。第一第三第四第五。但叙纪纲。不彰余理。名摄要义。又世亲所造论轨论式等。法虽全备。文繁义杂。陈那详考。更为因明理门等论。虽教理纶焕。而旨幽词邃。令初习之者莫究其微。天主此论。纂二先之妙。鸠群藉之玄。奥义咸殚。深机并控。匪唯提综周备。实亦易叶成功。既彰四句之能。兼明八义之益。故言总摄诸论要义</p><p>论。此中宗等多言名为能立</p><p>述曰。自下第二依标随释。于中分六。一明能立。二明似立。三明二真量。四明二似量。五明能破。六明似能破。问何故长行。牒前颂文。不依次释。又与前颂。开合不同。答略有三释。一云。前颂标宗。二悟类别。立破真似。相对次用。所以八义。次第如是。长行广释。逐便即牒。性相求之。何须次牒。颂以真似各别。开成八义。长行以体类有同。合成六段。亦不相违。二云。颂中以因明之旨。本欲立正破邪。故先能立。次陈能破。理门论云。为欲简持能立能破义中真实。作斯论故。所申无过。立破义成。所述过生。何成立破。故立破后。次陈二似。虽知真似二悟不同。开示证人。俱悟他摄。刊定法体。要须二量。现量则得境亲明。比量亦度义无谬。故先现量。比量后陈。刊定则虽成。谬妄还难楷准。故当对二真。次明二似。故颂八义。次第如是。长行同于理门所说。以因明法。先立后破。免脱他论。摧伏他论。为胜利故。立义之法。一者真立。正成义故。二者立具。立所依故。真因喻等。名为真立。现比二量。名为立具。故先诸师。正称能立。陈那以后。非真能立。但为立具。能立所须。故能破前先明二量。亲疎能立。皆有真似。以自相明。故真立后即明似立。二真量后。明二似量。此之六门。由是能立及眷属故。理门说上六名真似立故。立义成已次方破他。故后方明能破似破。三云。真立似立。真量似量。各有别体。真立体即无过多言。似立体即有过多言。真量明决之智。似量闇疑之智。各有别故。若真能立。若能立具。皆能立故。先首明之。能破似破虽体即言。境无有异。能破之境。体即似立。似破之境。即真能立。须识立境。方可申破。立已方破。故后明之。开合别明。体类同故。长行与颂。由此不同。初解能立中。大文有三。初举体释义。次示相广陈。后总结成前。简择同异。初中复二。初举体。后释义。此举体也。总举多法。方成能立。梵能立义。多言中说。故理门论陈那。指彼天亲论云。故此多言。于论式等。说名能立。言此中者。理门二解。一起论端义。二简持义。凡发论端。泛词标举。故称此中起论端义。简持有二义。一简去邪宗增减。持取正宗中道。邪增者。增似立为真立。以似破为真破。邪减者。以真立为似立。以真破为似破。中道者。二真为真。二似为似。二云。此论所明总有八义。且明能立。未论余七。简去余七。持明此一。故称此中是简持义。清辩菩萨。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>灯论。释有四义。谓发端标举简持指斥。宗是何义。所尊所崇所主所立之义。等者。等取因之与喻。世亲以前。宗为能立。陈那但以因之三相。同异喻。而为能立。以能立者。必多言故。今言宗等名能立者。略有二释。一云。宗是所立因等能立。若不举宗。以显能立。不知因喻谁之能立。恐谓同古。自性差别二之能立。今标其宗。显是所立。能立因喻。是此所立宗之能立。虽举其宗。意取所等一因二喻为能立体。若不尔者。即有所立。滥于古释。能立亦滥彼能立过。为简彼失故举宗等。二云。陈那等意。先古皆以宗为能立。自性差别二为所立。陈那遂以二为宗依。非所乖诤。说非所立。所立即宗。有许不许。所诤义故。理门论云。以所成立性。说是名为宗。此论亦言。随自乐为所成立性。是名为宗。因及二喻。成此宗故。而为能立。今论若言因喻多言名为能立。不但义旨见乖古师。文亦相违。遂成乖竞。陈那。天主。二意皆同。既禀先贤而为后论。文不乖古。举宗为能等。义别先师。取所等因喻为能立性。故能立中举其宗等。问宗若所立。颂中八义。摄法不尽。答随八所成。即是宗故。又宗所立。随能立中。便次明之。彼所成故。摄法亦尽。又观察义中。诸所有事。名因明故。不举其宗于何观察。故今举宗。显所有事。能立体。问能立因喻有言义智。论何不说。多智多义。名为能立。而说多言名为能立。答立论之法。本生他解。他解照达。所立宗义。本由立者。能立之言。其言生因。正是能立。智义顺此亦得因名。由言生因。生敌证智。敌证智解为正了因。理门论难云。若尔。既取智为了因。是言便失能成立性。此难言因应非能立。彼自释云。此亦不然。令彼忆念本极成故。此释意云。由言因故。令敌证智。了本极成因。解所立宗义。故立论者言。正为能立。敌证智了亦为能立性。若不尔者。相违决定。言支具足。应名能立。既由他智。不生决解。名为似立。故知。通取言生智了为能立体。今此据本。故但标言名为能立。瑜伽亦云。六种言论。是论体性。不说智生义生义了名为能立。言了则言生。故体亦可尔。问何故能立。要在多言。一二之言宁非能立。答理门论云。于论式等。说此多言。名能立故。世亲所造论轨论式。彼说多言名为能立。今不违古。故说多言。彼论复言。又比量中。唯见此理。若所比处。此相定遍。于余同类。念此定有。于彼无处。念此遍无。是故由此生决定解。因之三相。既宗法性。同有异无。显义圆具。必籍多言。故说多言名为能立。又一二之言。宗由未立。多言义具。所立方成。若但说因。无同喻比。义不明显。何得见边。若但同无异。虽比附宗。能立之因。或返成法。无异止滥。何能建宗。设有两喻阙遍宗因。宗法既自不成。宗义何由得立。果宗不决。因比徒施。空致纷纭。竞何由消。故详今古。能立具足。要藉多言</p><p>论。由宗因喻多言开示诸有问者未了义故</p><p>述曰。释能立义。宗义旧定。因喻先成。何故今说为能立也。理门亦云。由宗因喻多言。辨说他未了义。诸有问者。谓敌证等。未了义者。立论者宗。其敌论者。一由无知。二为疑惑。三各宗学。未了立者立何义旨。而有所问。故以宗等如是多言。成立宗义。除彼无知。犹预僻执。令了立者。所立义宗。其论义法。瑜伽等说。有六处所。一于王家。二于执理家。三于大众中。四于贤哲者前。五于善解法义沙门<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>前。六于乐法义者前。于此六中。必须证者。善自他宗。心无偏傥。出言有则。能定是非。证者有问立何论宗。今以宗等。如是多言。申其宗旨。令证义者。了所立义。故者。所以。第五转声。由者因由。第三转摄。因由敌证。问所立宗。说宗因喻。开示于彼。所以多言名为能立。开示有三。一敌者未闲。今能立等。创为之开。证者先解。今能立等。重为之示。二双为言开示其正理。三为废忘宗而问为开。为欲忆宗而问为示。诸有问者未了义故。略有二释。一诸问者。通证及敌。敌者发问。理不须疑。证者久识自他宗义。宁容发问未了义耶。一年迈久忘。二宾主纷纭。三理有百途问依何辙。四初闻未审须更审知。五为破疑心。解师明意。故审问宗之未了义。二应分别。为其证者。论但应言多言。开示问者义故。证者久闲而无未了。为其敌论者。论应说言多言。开示诸有问者未了义故。敌者于宗有未了故。今合为文。非彼证者亦名未了。由开示二故说多言名为能立。问能立有多。何故一言说为能立。答理门解云。为显总成一能立性。由此应知。随有所阙名能立过。阙支便非能立性故</p><p>论。此中宗者</p><p>述曰。自下第二示相广陈。于中有三。一示宗相。二示因相。三示喻相。瑜伽论云。问若一切法自相成就。各自安立已法性中。复何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。建立二种所成立义耶。答为欲令他生信解故。非为生成诸法性相。问为欲成就所成立义。何故先立宗耶。答为先显示自所爱乐宗义故。问何故次辩因耶。答为欲开显依现见事。决定现理。令他摄受所立宗义故。问何故次引喻耶。答为欲显示能成道理之所依止现见事故。问何故复说同类异类。现量比量正教量等耶。答为欲开示因喻二种相违不相违智故。相违谓异类。不相违谓同类。则于因喻皆有现比量等相违不相违。随其所应真似所摄。彼又重言。又相违者。由二因缘。一不决定故。二同所成故。初是六不定。因于同异二喻。或成或违故。后是四不成及四相违。因于宗过名为不成。于二喻中。一向相返名曰相违。本立共因。拟成宗果。因既带似。理须更成。若更成之。与宗莫别。名同所成。似宗二喻亦在此摄。不相违者亦二因缘。一决定故。二异所成故。初是真因真喻。定成宗故。后则是此真因真喻。无诸过失。体能成故。异于所成。其相违者。于为成就所立宗义。不能为量故不名量。谓似因喻。及似现比量名相违。不成宗故不名真量。不相违者。于为成就所立宗义。能为正量。故名为量。谓真因喻及真现比。正成宗故正名为量。今此虽不同彼次第。宗之所依。及宗因喻现比量等。次第生起。亦准彼释。初中复三。初牒章。次示相。后指法。此即初也</p><p>论。谓极成有法极成能别</p><p>述曰。下示相有四。一显依。二出体三简滥。四结成。此显依也。极者。至也。成者。就也。至极成就故名极成。有法能别但是宗依。而非是宗。此依必须两宗至极共许成就。为依义立。宗体方成。所依若无能依何立。由此宗依必须共许。共许名为至极成就。至理有故。法本真故。若许有法能别二种非两共许。便有二过。一成异义过。谓能立本欲立此二上不相离性和合之宗。不欲成立宗二所依。所依若非先两共许。便更须立此不成依。乃则能立成于异义。非成本宗。故宗所依必须共许。依之宗性方非极成。极成便是立无果故。更有余过。若许能别非两极成。阙宗支故。非为圆成。因中必有是因同品非定有性过。必阙同喻。同喻皆有所立不成。异喻一分或遍转过。若许有法非两极成。阙宗支故。亦非圆成。能别无依是谁之法。因中亦有所依随一两俱不成。由此宗依必依共许。能依宗性方非极成。能立成之本所诤故。一切法中略有二种。一体。二义。且如<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。色等是体。此上有漏无漏等义。名之为义。体之与义。各有三名。体三名者。一名自性。瑜伽等中古师所说自性是也。二名有法。即此所说有法者是。三名所别。如下宗过中名所别不成是。义三名者。一名差别。瑜伽论等古师所说差别是也。二名为法。下相违中云。法自相相违因等是。三名能别。则如此中名能别是。佛地论云。彼因明论诸法自相。唯局自体。不通他上。名为自性。如缕贯花。贯通他上诸法差别义。名为差别。此之三种。不定属一门。不同大乘。以一切法不可言说一切为自性。可说为共相。如可说中。五蕴等为自。无常等为共。色蕴之中色处为自。色蕴为共。色处之中青等为自。色处为共。青等之中衣花为自。青等为共。衣花之中极微为自。衣花为共。如是乃至离言为自。极微为共。离言之中圣智内冥得本真故。名之为自。说为离言名之为共。共相假有。假智变故。自相可真。现量亲缘。圣智证故。除此以外说为自性。皆假自性非真自性。非离假智及诠言故。今此因明。但局自体名为自性。通他之上名为差别。准相违中。自性差别。复各别有自相差别。谓言所带名为自相。不通他故。言中不带意所许义。名为差别。以通他故。今凭因明总有三重。一者局通。局体名自性。狭故。通他名差别。宽故。二者先后。先陈名自性。前未有法可分别故。后说名差别。以前有法可分别故。三者言许。言中所带名自性。意中所许名差别。言中所申之别义故。释彼名者。自性差别二名如前。第二自性亦名有法。差别亦名法者。法有二义。一能持自体。二轨生他解。故诸论云。法谓轨持。前持自体。一切皆通。后轨生解。要有屈曲。初之所陈前未有说。迳廷持体。未有屈曲生他异解。后之所陈。前已有说。可以后说分别前陈。方有屈曲生他异解。其异解生。唯待后说。故初所陈。唯具一义。能持自体。义不殊胜。不得法名。后之所陈。具足两义。能持复轨。义殊胜故。独得法名。前之所陈。能有后法。复名有法。第三自性亦名所别。差别亦名为能别者。立敌所许不诤先陈。诤先陈上有后所说。以后所说别彼先陈。不以先陈别于后。先自性名为所别。后陈差别名为能别。若尔。此三名皆有失。其失者何。难初名云。若体名自性。义名差别者。何故下云。如数论师立我是思。我为自性。思为差别。彼文便以义为自性。体为差别。我无我等分别思故。难次名云。若具一义得有法名。若具二义但名法者。如即此师立我是思。何故思唯一义乃名为法。我具二义得有法名。难后名云。若以后陈别彼前说。前为所别。后为能别。如世说言青色莲花。但言青色不言莲花。不知何青。为衣为树为瓶等青。唯言莲花不言青色。不知何花。为赤为白为红等花。今言青者。简赤等华。言莲花者。简衣等青。先陈后说更互有简。互为所别。互为能别。此亦应尔。后陈别前。前陈别后。应互名为能别所别。释初难言。此因明宗。不同诸论。此中但以局守自体名为自性。不通他故。义贯于他。如缕贯花。即名差别。前所陈者。局在自体。后所说者。义贯于他。贯于他者。义对众多。局自体者。义对便少。以后法解前。不以前解后。故前陈名自性。后陈者名差别</p><p>释次难言。先陈有法立敌无违。此上别义两家乖竞。乖竞之义彼此相违。可生轨解名之为法。非所诤竞。彼此无轨。迳廷自体。无别轨解。但名有法。谈其实理。先陈后说皆具二义。依其增胜论与别名。故前陈者名有法。后陈者名法。故理门论云。观所成故立法有法。非德有德法与有法。一切不定。但先陈皆有法。后说皆名法。观所立故。非如胜论德。及有德一切决定。释第三难言。前后所陈互相简别。皆应得名能别所别。如成宗言差别性故。然前陈者非所乖诤。后说于上彼此相违。今陈两诤。但体上义。故以前陈名为所别。后名能别。亦约增胜以得其名。又但先陈。真名自性有法所别。但是后说。皆名差别法及能别。但诤后于前。非诤前于后故。举后方诤。非举前诤故。能立立于后。不立于前故。起智了不由前故。由此得名前后各定。问前陈后说既各三名。何故极成初言有法。后言能别。不以自性差别名显。又复不以法及有法。能别所别相对为名。而各举一有法能别。答初有三释。一云。设致余名必有此难。随举一种。何假为征。二云。有法能有他胜。故先陈举。明必有后法。以释于前陈。能别别于他胜。此宗后陈。必与彼宗后陈义异。以后所说能别前陈。故后举能别。三云自性差别。诸法之上。共假通名。有法能别。宗中别称。偏举别名。隐余通号。亦不相违。答后难言。前举有法影显后法。后举能别影前所别。二灯二炬。二影二光。互举一名相影发故。欲令文约而义繁故。宗之别名皆具显故。摄名已周。理实无咎。问既言极成。何所简别。有几非成。言成简别。答能别定成。且所别中有自不成。有他不成。有俱不成。有俱非不成。前三是过。第四句非。又有自一分不成。有他一分不成。有俱一分不成。有俱非一分不成。前三并非。第四有是。所别定成。能别不成为句亦尔。如是偏句总别合有四种四句。其俱不成全有五种四句。有自能别不成他所别。有他能别不成自所别。有俱能别不成自所别。有俱能别不成他所别。有自能别不成俱所别。有他能别不成俱所别。有俱能别不成俱所别。有俱能别不成俱非所别。如能别不成为首有二全四句。所别不成亦如是。二四句中。其前七句。皆是此过。其第八句是前偏过。虽总有四体唯有二。后则是前更无异故。所以但名二四句。有自两俱不成非他。有他两俱不成非自。有俱两俱不成。有俱非自他两俱不成。前三句非。第四句是。如是合有五种全句。一一离之。为一分句。复有五句。总成十句。复将一分句。对余全句。复将全句。对余一分句。如理应思。恐繁且止。其初有法不成偏句。如下所别不成中解。能别不成偏句。如下能别不成中解。两俱不成诸句。如下两俱不成中解。其两俱全分一分不极成。则宗两俱不成。其自他全分一分不极成。则宗随一不成。义准亦有宗犹豫不成。两俱随一全分一分等过。至似宗中当广分别。二种自性及二差别不极成。此皆总摄。为简彼非。故二宗依皆言极成。问何故宗过有其九种。今极成简但简于三。答此中但以宗不极成。所依须极成。故但简三。非欲具简一切宗过。理门成宗但简五过。由言非彼相违义能遣。此论以彼简五。故但说三随自则简相符极成。简非周备。理门略五。如前已说。亦如喻言显因同品决定有性。不简合结。故此但三。问既两共许。何故不名共成而言极成。答自性差别。乃是诸法至极成理。由彼不悟。能立立之。若言共成。非显真极。又因明法有自比量及他比量能立能破。若言共成应无有此。又显宗依。先须至于理极究竟。能依宗性方是所诤。故言极成而不言共。问宗依须两许言成简不成。因喻必共成。言极简不。极何因因喻不标极成。独于宗依致极成简。答有四义。一宗依极成宗不极。为简不极言极成。因喻依体并须极成。无所简故不说极。二因喻能立皆须极。无不极故不须简。宗是所立非共成。为有所简须言极。因喻之中自比言许。他比言执。而简别之。故无不极。三因喻成中无不成。无滥简故。不言极成宗之中有不成。有滥简故独言极。四因不成等摄非极。从宽为名不名极。宗不成中无别摄。故说极成简不极。因中两俱随一等过。喻中所立能立不成。此等过中已摄不极。两俱等宽。从余为称。有体无体皆此过故。宗过不尔。言极简之。两许有体。便非是过。故于宗内独言极成。然理门云。此中宗法。唯取立论及敌论者决定同许。于同品中有非有等。亦复如是。故知因喻必须极成。但此论略。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>亦言极成六识。随一摄故。如极成余。故知此略</p><p>论。差别性故</p><p>述曰。出宗体。差别者。谓以一切有法。及法互相差别。性者体也。此取二中互相差别不相离性。以为宗体。如言色蕴无我。色蕴者有法也。无我者法也。此之二种。若体若义。互相差别。谓以色蕴简别无我。色蕴无我。非受无我。及以无我简别色蕴。无我色蕴。非我色蕴。以此二种互相差别合之一处。不相离性方是其宗。即简先古诸因明师。但说有法为宗。以法成有法故。或但<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>为宗。有法上法是所诤故。或以有法及法为宗。彼别非宗。合此二种宗所成故。此皆先共许。何得成宗。既立已成而无果故。但应取互相差别不相离性。有许不许以为宗体。问先陈能别唯在法中。何故今言互相差别。答立敌相形法为能别。体义相待。互通能所。对望有异亦不相违。问互相差别则为宗性。何假此中须说故字。答故者所以。此有二义。一简古说。但以能别或但所别。或双以二而为共宗。陈那简之。皆非宗诤。取此二上互相差别不相离性所诤之义。方成宗故。其能别等。彼先共许。非两所诤。皆非是宗。为简古师遂说故字。二释所依。释前有法。及以能别极成之言。但以有法及法互相差别不相离性一许一不许而为宗故。宗之所依有法能别。皆须极成。由此宗中说其故字。不尔所依须更成立哉。或有于此不悟所由。遂改论云差别为性。非直违因明之轨辙。亦乃闇唐梵之方言。辄改论文深为可责。弥天释道安法师。尚商略于翻译。为五失三不易云。结集之罗汉兢兢若此。末代之凡夫平平若是。改千代之上微言。同百王之下末俗。岂不痛哉。况非翻经之侣。但是肤受之辈。诳后徒之幼识。诱初学之童蒙。妄率胸襟。回换圣教。当来慧眼。定永不生。现在智心。由斯自灭。诸有学者。应闲此义。依旧正云。差别性故。问何故但宗说差别性。因喻中无。答宗有一成一不成。故但说宗差别性。因喻唯成。无不成。无简不说差别性。如因三相。虽有差别。不欲取此上不相离性一许一不许成其能立。所依便非。由斯不说差别性故。理门唯云。宗等多言说能立。是中唯随自意乐为所成立说名宗。非彼相违义能遣。不说所别能别极成及差别性。此论独言</p><p>论。随自乐为所成立性</p><p>述曰。此简滥失。随自者。简别于宗。乐为所成立性者。简别因喻。故理门云。随自意。显不顾论宗随自意立。乐为所立。谓不乐为能成立性。若异此者说所成立。似因似喻应亦名宗。凡宗有四。一遍所许宗。如眼见色。彼此两宗皆共许故。二先承禀宗。如<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>习诸法空。鸺鹠<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>立有实我。三傍凭义宗。如立声无常。傍凭显无我。四不顾论宗。随立者情所乐便立。如佛弟子立佛法义。若善外宗。乐之便立不须定顾。此中前三不可建立。初遍许宗。若许立者。便立已成。先来共许。何须建立。次承禀者。若二外道。共禀僧佉。对诤本宗亦空无果。立已成故。次义凭宗。非言所诤。此复何用。本诤由言。望他解起。傍显别义。非为本成。故亦不可立为正论。然于因明未见其过。既于因过。说法差别相违之因。即傍准宗可成宗义。然非正立。今简前三皆不可立。唯有第四不顾论宗。可以为宗。是随立者自意所乐。前三皆是自不乐故。乐为所成立性。简能成立者。能成立法者。谓则因喻。因喻成立自义亦应名宗。但名能立。非所成立。旧已成故不得名宗。今显乐为新所成立方是其宗。虽乐因喻非新成立。立便相符。故不名宗。既尔。似宗似因似喻应得名宗。先所未成应更成故。当时所竞方是真宗。因喻时申故须简别。似宗因喻虽更可成。非是所乐。第二时所可成故。非今所诤。疎故非宗。此上一解。依理门论。唯简于真。不简于似。又解。乐者。贯通上下。随自乐言。简前三宗非随自乐。唯第四宗是意所乐。乐为之言。简似宗等。虽于后时更可成立。非是此时所乐为故。所成立性。简真因喻不可名宗。虽成已义是能成立。先已成故非今所成。今所成立体义名宗。若依后解虽异理门。简真与似略圆备故。问何故因喻无随自乐。宗独有之。答宗两乖诤须随自简。因喻共许。故无随自。因喻二种。如共比量。必先共许方成能立。无遍许失及承禀失。要言所陈方名因喻。不说亦有傍义差别。无义准失。自他比量言亦有简。说许执故随其不顾。故于因喻不说随自。问何故宗中傍有义准。名为差别。因喻便无。答能立本成。成自所立随应之义。立乃乖角共自相违。故于宗中傍有义准。则四相违所违差别。言申决定方成能立。故于因喻不说亦有义准能立。问何故宗内独言乐为。因喻不说。答似宗因喻当更成立可以为宗。今显当时所诤为宗。不以彼为。故言乐为简彼三似宗似因喻。设今及后俱不可说为因。为喻亦尔。若更立之只是宗摄。不说乐为。设更成立以为宗讫。义既成已方为因喻。展转疎成不同于宗。故于因喻不说乐为。又于宗内说乐为言。简似周讫。因喻略之。又宗有诤以更须成。宗义相滥故独言乐为。因喻必须极成。不成便非因喻。无所滥故不言乐为。问何独宗标所成立性。因喻不说能成立也。答宗言所立。已显因喻是能成立。显法已周更不须说。又宗前未说。恐滥须陈。因喻已彰更何须说。又宗违古。言所成立以别古今。因喻不违。不说能立言以简别也。又前标云宗等多言名为能立。先已说讫。后更不须</p><p>论。是名为宗</p><p>述曰。此结成也</p><p>论。如有成立声是无常</p><p>述曰。三指法也。如佛弟子对声论师。立声无声。声是有法。无常为能别。彼此共许。有声及无常。名极成有法。极成能别。为宗所依。彼声论师。不许声上有此无常。今佛弟子合之一处。互相差别不相离性云声无常。声论不许。故得成宗。既成随自亦是乐为所成立性故名真宗。恐义不明。指此令解。瑜伽论云。立宗者。谓依二种所成立义。各别摄受自品所许。摄受者。是自意乐义。品是宗义。故显扬云。各别摄受自宗所许。此中意说。依二所立立论各别。随自意乐自宗所许。故说名宗。此中三释。一者以言对理。取依义能诠。名为各别自宗所许。二者以别对总。取依总之别言及义二。名自所许。三者以合对离。取彼能依不相离性合以之为自宗所许。正与此同。此文总也</p><p>下有十句。分为三类。初二句是宗体。一摄受论宗。二若自辩才。初依自所师宗。对异师敌而立自宗。不尔便为相符极成。后由自辩才立他宗义。随自意乐不顾论宗。唯此二种是正所宗。若遍所许。若二同宗承。若傍义准。非别摄受。非随自乐。故非真宗。立已成故。非本成故。次三句是立宗因缘。一若轻蔑他。二从他闻。三若觉真实而申宗趣。是名因缘。立他义轻他故。立自义从他闻。觉真实自悟故。如次配之。后五句是立宗意。初二句标一切立宗。不过此故。一为成立自宗。二为破坏于他。后三句释。一为制伏于他。释上成立自宗。二为摧屈于他。释上破坏他宗。三为悲愍于他。成自破他皆悲愍故</p><p>论。因有三相</p><p>述曰。上示宗相。下示因相。此相略以四门分别。一出体。二释名。三辩差别。四明废立。初出体者。因有二种。一生。二了。如种生芽。能起用故名为生因。故理门云。非如生因由能起用。如灯照物。能显果故。名为了因。生因有三。一言生因。二智生因。三义生因。言生因者。谓立论者立因等言。能生敌论决定解故。名曰生因。故此前云。此中宗等多言名为能立。由此多言。开示诸有问者未了义故。智生因者。谓立论者发言之智。正生他解实在多言。智能起言言生因因。故名生因。义生因者。义有二种。一道理名义。二境界名义。道理义者。谓立论者言所诠义。生因诠故名为生因。境界义者。为境能生敌证者智。亦名生因。根本立义拟生他解。他智解起本籍言生。故言为正生。智义兼生摄。故论上下所说多言。开悟他时。名能立等。智了因者。谓证敌者解能立言。了宗之智照解所说。名为了因。故理门云。但由智力了所说义。言了因者。谓立论主能立之言。由此言故敌证二徒了解所立。了因因故名为了因。非但由智了能照解。亦由言故。照显所宗名为了因。故理门云。若尔既取智为了因。是言便失能成立义。此亦不然。令彼忆念本极成故。因喻旧许名本极成。由能立言成所立义。令彼智忆本成因喻故名了因。义了因者。谓立论主能立言下所诠之义。为境能生他之智了。了因因故名为了因。亦由能立义。成自所立宗。照显宗故亦名了因。故理门云。如前二因于义所立。立者之智久已解宗。能立成宗。本生他解。故他智解正是了因。言义兼之亦了因摄。分别生了虽成六因。正意唯取言生智了。由言生故敌证解生。由智了故隐义今显。故正取二为因相体。兼余无失次释名者。因者所由。释所立宗义之所由也。或所以义。由此所以所立义成。又建立义。能建立彼所立宗故。或顺益义。由立此因。顺益宗义。令宗义立。是故名因。故瑜伽云。辩因者。谓为成就所立宗义。依所引喻。同类异类。现量比量。及正教量。建立顺益道理言论。问喻既建成宗。亦能顺益。何不名因。答喻谓譬况。正云见边。令所立义见其边际。究竟<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故名见边。虽亦顺益。非是正释宗之所以。亲初建立得此因名。喻疎后成不得因称。是故此因不名见边。说所因时义未成故。至后当知。辨差别者。虽依建立顺益等义。总得因名。有果不同。疎成生了。各类有别。分言义智。体异便成立敌二智。义之与言生了各殊。别开六种。由此应言得果分两。约体成四。据类有三。望义为六。智了因。唯是生因果。而非生因因。智生因。唯是生因因。而非了因果。言义二生因。为智生因果。为智了因因。言义二了因。为智了因因。非为智了果。得为智生果。不作智生因以言望于义。亦成显了因以义望于言。亦成显了果。以义望于言。亦作能生因。以言望于义。亦为所生果。由此应说唯因不是果。谓智生因。为果亦成因。余五果。又为四句。有唯生因而非了因。谓智生因。有是了因而非生因。谓智了因。有是生因亦是了因。谓言义。有非生因亦非了因谓所立宗。明废立者。一问何故一因。喻分二种。答因正建宗。总苞称一。喻有违顺。别离分两。至下喻中当广分别。二问何故一因体分生了。答智境疎宽。照显名了。言果亲狭。令起名生。果既有差。因分生了。同能得果。但总名因。三问何故二因各分三种。答生果照果义用不同。随类有能故分三种。立智隔于言义。不得相从名了。敌智不生立解。无由可得名生。故但分三不增不减。四问何故六因体唯有四。答顺果义别。分成六因。立者义言。望果二用。除此无体。故唯有四。五问何故因中独开三相。宗喻不开。答别名宗喻。通即称因。遍是宗喻二之法故。又因必宽。宗喻性狭。如贯花缕贯二门故。由此开因不开宗喻。示因相中有五。一标举。二征数。三列名。四别释。五示法。此即初也。其言生因。及敌证智所诠之义。各有三相。相者向也。正取言生。正能立故。此生智了。照解宗故。故正因体。言生智了。兼亦义生。能建宗故。宗同异喻各有一体。因相贯三更无别体。由此故说相者向义。故理门云。不共不定。一向离故。阙一相也。又此相者。面也。边也。三面三边。若尔既一因。如何说多言名为能立。其相义多。能诠言一。于三相中致一因言。故一因所依贯三别处。故多相之言名为多言。非言多故名为多言。古师解云。相者体也。初相同此。余二各以有法为性。陈那不许。同异有法非能立故。但取彼义。故相非体</p><p>论。何等为三</p><p>述曰。二征数也</p><p>论。谓遍是宗法性同品定有性异品遍无性</p><p>述曰。三列名也。遍是宗法性。此列初相。显因之体以成宗故。必须遍是宗之法性。据所立宗。要是极成法及有法不相离性。此中宗言。唯诠有法。有法之上所有别义名之为法。此法有二。一者不共有。宗中法是。二者共有。即因体是。理门论云。此中宗法。唯取立论及敌论者决定同许今此唯依证了因故。彼自难云。既尔便失前说言为能成立性。论主解云。由有言生。令彼忆念本极成故。意以因体共许之法。成宗之中不共许法。故此二法。皆是有法之上别义。故今唯以有法名宗。对敌所申因喻成立。虽取二依不相离性以为宗体。有法既为二法总主。总宗一分故亦名宗。理门论云。岂不总以乐所成立合说为宗。云何此中乃言宗者唯取有法。此无有失。以其总声于别亦转。如言烧衣。或有宗声唯诠于法。若以宗中后陈名法。即宗是法。持业为名。总宗之法。亦依主释。具二得名。今因名法。宗之法性。唯依主释性者。体也。此唯义性。非是体性。义相应故。余二亦然。此共许因唯得遍是有法宗性。以宗之法成即宗法故。不遍是法宗之性。因犯两俱不成过故。又不欲成宗有法故。然因明理。有法不成于有法。此亦不成于法。因犯所依不成过故。理门难云。若以有法立余有法或立其法。如以烟立火。或以火立触。其义云何。此义难云。如远见烟立下有火。以有烟故。岂非彼以有法成有法。烟之与火俱有法故。又如见火云定有热。以有火故。热触既是火家之法。岂不以有法成于法耶。陈那释云。今于此中。非以成立火触为宗。但为成立此相应物。谓成山处决定有火。以有烟故。炉中定热以有火故。名为烟火相应之物。非以有法烟。还成有法火。亦不以有法火。而成热触法。彼论又云。若不尔者。依烟立火。依火立触。应成宗义一分为因。还以宗中一分有法而为因故。便为不可。故因乃有所依不成。无所依故。亦不以法成立有法。宗中所陈。后能别前。名为能别。亦名为法。因成于此。不欲以因成前所陈。是所别故。非别后故。理门又云。又于此中。观所成故。立法有法。非德有德。故无有过。前陈名有法。后陈皆名法。非法有法法性决定。如胜论师德与有德。有德谓实。彼决定故。理门颂云。有法非成于有法。及法此非成有法。但由法故成其法。如是成立于有法。谓有法因法二俱极成。宗中之法。敌先不许。但得共许因在宗中有法之上。成不共许宗中之法。如是资益有法义成。可得因在不共许中。许在彼中何所成立。又若共许之因。依不共许法。凡所立因。皆有他随一所依不成过。不说有法而为所依。但以其法而为所依。法非共许。纵唯立许岂定无此过。又如立宗声是无常所作性故。无常灭义。所作生义。声有灭者。以有生故。一切生者。皆有灭故。声既因生。明有果灭。若因所作。不遍声宗。岂得遍在无常上有。一切正因中。应皆有两俱不成。无常之上本无生故。由此故知。因但是宗有法之法。非法法也。问称为宗法。即已是因。何须言遍。初既云遍因义已明。何须复云是宗法性。答若因不遍宗有法上。此所不遍便非因成。有所不立。显皆因立。是故称遍。若但言遍不言宗法。即不能显因是有法宗之法性能成于法。又因于宗过名为不成。于二喻中俱有俱无名为不定。于二喻中有<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违名曰相违。若唯言法性不言遍者。因于宗过即是不成。或两俱不遍。或随一不遍。或犹预不遍。或所依不遍。全分一分等随应有之。为简此失是故言遍。若但言遍不言宗法。不知此因谁家之因。为显是宗有法之因。成于宗法。故言法性。由此应为诸句分别。有宗法而非遍。有是遍亦宗法。有非遍非宗法。必无是遍非宗法句。但遍有法。若有别体。若无别体。并能成宗。义相关故。必是宗法。如萨婆多对大乘者。立命根实。以有业故。如五根等。岂以命根。与业别体。即非正因。故有别体。若无别体。义相关带。必是宗法。皆得说为宗之法性。非无体是。非有体非。初有宗法而非遍者。四不成中皆一分摄。初两俱一分两俱不成者。如胜论师对声生者。立一切声皆是无常宗。勤勇无间所发性因。立敌二宗。唯许内声有勤勇发。外声非有。立敌俱说此因于宗半有半无。故此过是两俱有体一分不成。余无体两俱一分一种不成。若有体若无体。若自若他。合四种一分随一不成。两俱一分。若自若他。合三种一分犹豫不成。两俱有体一分。若他若自。有体一分随一。合三所依不成。如是更有十一。并前十二一分不成。皆如下释。后句非遍非宗法者。四不成中并全分过。如声论师对佛弟子。立声为常。眼所见故。俱说此因于声无故。此是有体两俱全分两俱不成。余无体两俱全分一种不成。有体无体。若自若他。四种全分随一不成。两俱全分。若自若他。三种犹豫不成有体无体两俱全分。有体无体若自若他。随一全分六种所依不成。如是更有十四。并前十五全分不成。亦如下释。此二遍句。并皆是过。唯第二句遍亦宗法。是正因相。为简非句故说遍是宗法性。言同品定有性者。显第二相。同是相似义。品是体类义。相似体类名为同品。故理门云。此中若品与所立法。邻近均等。说名同品。以一切义皆名品故。彼言意说虽一切义皆名为品。今取其因正所成法。若言所显法之自相。若非言显意之所许。但是两宗所诤义法。皆名所立。随应有此所立法处说名同品。以随有无体名同品。由此品者是体类故。若唯言所陈所诤法之自相名为所立。有此法处名同品者。便无有四相违之因。比量相违。决定相违。皆应无四。若全同有法上所有一切义者。便无同品。亦无异品。宗有一分相符极成。非一切义皆相违故。故但取所立有此名同。然下论云。如立无常。瓶等无常名同品者。唯举所陈两宗本诤法之自相名为同品。以余意所许是傍所诤。略而不说。理皆同品。以此释文。应当深义。同品有二。一宗同品。故下论云。谓所立法均等义品。是名同品。二因同品。下文亦言。若于是处显因同品决定有性。然论多说宗之同品名为同品。宗相似故。因之同品名为同法宗之法故。何须二同。因之在处说宗同品。欲显其因。遍宗喻故。宗法随因说因同法。显有因处立法必随故。且宗同品。何者名同。若同有法。全不相似。声为有法瓶为喻故。若法为同。敌不许法于有法有。亦非因相遍宗法中。何得取法而以为同。此中义意。不别取二。总取一切有宗法处名宗同品。故论说言。如立无常。瓶等无常是名同品。有此宗处决定有因。名因同品。然实同品正取因同。因贯宗喻体性宽遍。有此共许因法之处。不共许法定必随故。今明一切有宗法处其因定有。故说宗同。不欲以宗成因义故。非正同品。其因于彼宗同品处决定有性。故言同品定有性也。因既决定有。显宗法必随。理门亦云。说因宗所随。宗无因不有等。依上二相。理门论云。云何别法于别处转。此中问意。如所作因必随附声。与瓶等上所作性别。如何声宗之上别因。于瓶等中别处而转。或所作因。是声有法。宗上别法。云何于彼别瓶处转。而言共相贯在宗喻。遍是宗法。同品定有。陈那释云。由彼相似不说异名。言即是此故无有失。此答意言。由声瓶上共所作性相似而有。总相合说。不说声瓶二异名中。声所作性即喻处所作性。言彼即此故无有失。彼复难云。若不说异。云何此因说名宗法。前难声宗所作性因。云何得于别瓶上转。此难云何瓶所作性说为宗法。既不说彼所作性异总合说者。所作性因既于瓶有。云何此因说名宗法。彼复释言。此中但说定是宗法。不欲说言唯是宗法。此释意言。总因之中但说定遍宗法性。不欲说言唯是宗法。故一总言贯通二处。宗非宗上悉皆得有。其中可有遍是宗法。若别异说。唯声所作唯宗法性。别不容有举喻成宗。又别异说唯瓶所作。亦不得成是宗法性。何所成立。彼复难言。若尔。同品应亦名宗。此意难云。二中所作总贯称因。二上无常应皆宗诤。彼自释云。不然。别处说所成故。因必无异方成比量。故不相似。答难不然。唯别声上有无常义是其所成。共所诤故。非于瓶上。夫立因者。必须立敌宗喻之上两俱无异方成比量。故能立通。所立义局。理不相似。故答不然。问何故此因于宗异品皆说遍字。于同品上独说定言。答因本成宗。不遍成者非立。异喻止滥。不遍止者非遮。成不遍故不成过生。遮不尽故不定等起。成宗不遍。如上已陈。止滥不尽。至下当悉。同喻本顺成宗。宗成即名同喻。岂由喻遍能顺所立方成宗义。但欲以因成宗。因有宗必随逐。不欲以宗成因。有宗因不定有。故虽宗同品。不须因遍有。于异品有。同品半有半无。虽并不定。由因于异有故成过。非因于同不遍为失。即九句内。后三句中初后句是。后三中句正因所摄。于异品中止滥尽故。初后二句不定过收。皆止异品滥不尽故。由此同品说定有性。宗异品中皆说遍也。其九句者。理门论云。宗法于同品。谓有非有俱。于异品各三。有非有及二。言宗法者。谓宗之法。即因是也。于同品者。宗同品也。体即同喻。谓能立因于同品喻成其三种。一有。二非有。三亦有亦非有。彼名为俱。此三种因。于宗异品异法喻上。亦各有三。一有。二非有。三亦有亦非有。彼名及二。且同品有异品三者。谓因于同品有异品亦有。于同品有异品非有。于同品有异品有非有。如是因于同品非有。异品亦三。于同品有非有。异品亦三。故成九句。理门论中示九宗云。常无常勤勇。恒住坚牢性。非勤迁不变。由所量等九。恒住坚牢性及不变。此四皆常义。迁是无常。此四句中。上之三句显示九宗。下之一句结由九因而成九类。其九因者。理门论云。所量作无常。作性闻勇发。无常勇无触。依常性等九言无触者。无质碍义。上之三句显示九因。下之一句结由九宗而成九类。以此上三句成前上三句。一一句中皆有三种。次第配之。即成九也。一同品有异品有。如声论师。立声为常。所量性故。喻如虚空。此中常宗瓶为异品。所量性因于同异品皆遍共有。二同品有异品非有。如胜论师。立声无常。所作性故。喻如瓶等。无常之宗空为异品。所作性因于同品有于异品无。三同品有异品有非有。如胜论师。立声勤勇无间所发。无常性故。喻如瓶等。勤勇之宗。以电空等而为异喻。无常性因。于同品亦有。于异品喻电等上有。空等上无。此是初三。中三句者。一同品非有异品有。如声论师。立声为常。所作性故。喻若虚空。此中常宗瓶为异喻。所作性因于同品空上无。于异品瓶上有。二同品非有异品非有。如声论师对佛弟子。立声为常。所闻性故。喻若虚空。此中常宗瓶为异喻。所闻性因同异品中二俱非有。三同品非有异品有非有。如声论师。立声为常。勤勇无间所发性故。喻若虚空。此中常宗。以电瓶等为异品。勤勇之因。于同品空一向非有。于其异品瓶等上有。电等上无。此是中三。后三句者。一同品有非有异品有。如声论师。立声非勤勇无间所发。无常性故。喻若电空。此非勤宗瓶为异喻。无常性因。于同品电上有空上非有。异品瓶中一向是有。二同品有非有异品非有。如胜论师。立内声无常。勤勇无间所发性故。喻若电瓶。此无常宗空为异喻。勤勇之因。于同品瓶等上有。电等上无。异品空中一向非有。三同品有非有异品有非有。如声论师对胜论师。立声为常。无质碍故。喻若极微及太虚空。此中常宗。以瓶乐等而为异喻。无质碍因。于其同品虚空上有。极微上无。亦于异品瓶等上无。乐受等有。是名九句。然理门论料简此云。于同有及二。在异无是因。翻此名相违。所余皆不定。于同有者。谓能立因于同品有。言及二者。于同品中亦有非有。在异无者。此能立因。于同品有在异品无。及同品中亦有非有于异品无。言是因者。此之二句皆是正因。于九句中第二第八两句所摄。翻此名相违者。翻此二正因即名相违。翻初句云。于同非有于异品有。翻第二云。于同非有于异品中亦有非有。即九句中第四第六两句所摄。皆相违因。是法自相相违因故。摄余不尽。所余皆不定者。余之五句皆为不定。谓九句中。第一第三第五第七第九句。第一句者。共不定摄。第三句者。异品一分转同品遍转。第五句者。不共不定。第七句者。同品一分转异品遍转。第九句者。俱品一分转。此等诸句至下当知。上九宗中。五常。初三初一。中三皆。后三后一。二无常。初后三皆中。一勤。初三后一。一非勤。后三初一。总为四类。问第八句因若正因摄。有比量相违。第八句非正因摄。同品俱故。如第七九。答此有决定相违。量云。第八句因正因所摄。九句因中具三相故。如第二句。不言九句但言具三相。恐有不定过。为如第二句具三相故。此第八句正因所摄。为如决定相违等具三相故。此第八句非正因摄。故言九句中。便无此过。或决定相违不具三相。他智不决定故。问言定有性已显有因。宗必随逐。何须言同品。既云同品。即显有宗。因必随逐。何须复云定有性也。答但言定有不言同品。乃显此因成义不定。非定成宗。但言同品不言定有。亦显此因成相违法等。非本宗义。今显定成宗。及非成异品。故说同品决定有性。由此应为四句分别。有同品非定有。谓宗同品非定有因。即九句中中三句是。第四第六相违过收。第五句者不共不定。有定有非同品。谓定有因非宗同品。于九句中。除二五八。余六句是。第四第六是相违因。余之四句不定过摄。第一句共。第三句者异品一分转同品遍转。第七句者同品一分转异品遍转。第九句者俱品一分转。有亦定有亦同品。谓是宗同品亦定有因。于九句中。除中三句。初后三是。实若无过。唯取第二第八正因。若通有过。即通六句二正因四不定。有非同品亦非定有。谓非宗同品亦非定有因。即异品遍无性。于九句中第二五八三句所摄。二八正因。第五不定。此初三句内。唯第三句少分正因。余皆有过。为简过句显自无过。故说同品定有性也。异品遍无性者。显第三相。异者别义。所立无处即名别异。品者聚类。非体类义。许无体故。不同同品体类解品。随体有无。但与所立别异聚类即名异品。古因明云。与其同品相违。或异说名异品。如立善宗不善违害。故名相违。苦乐明闇冷热大小常无常等。一切皆尔。要别有体违害于宗。方名异品。或说与前所立有异名为异品。如立无常。除无常外自余一切苦无我等。虑碍等义皆名异品。陈那以后皆不许然。如无常宗。无常无处即名异品。不同先古。理门破云。非与同品相违或异。若相违者。应唯简别。谓彼若非无所立处名为异品。要相违法名异品者。应唯简别。是则唯立相违之法简别同品。不是返遮宗因二有。若许尔者。则一切法应有三品。如立善宗不善违害。唯以简别名为异品。无记之法无简别故。便成第三品非善非不善故。此中容品。既望善宗非相违害。岂非第三。由此应知。无所立处即名异品。不善无记既无所立。皆名异品。便无彼过。又难或异名异品云。若别异者应无有因。谓若说言与宗有异即名异品。则应无有决定正因。如立声无常。声上无我苦空等义。皆名异品。所作性因。于异既有。何名定因。谓随所立一切宗法。傍意所许。亦因所成。此傍意许。既名异品。因复能成。故一切量皆无正因。故知。但是无所立处。即名异品。此亦有二。一宗异品。故下论云。异品者。谓于是处无其所立。二因异品。故下论云。异法者。若于是处说所立无。因遍非有。然论多说宗之异品名为异品。宗类异故。因之异品名为异法。宗法异故。何须二异。因之无处说宗异品。欲显其因随宗无故。宗之无处说因异品。显因无处宗必先无。且宗异品。何者名异。若异有法。同法所依有法各别。亦应名异。若异于法。敌本不许所立之法于有法有。一切异法皆应名同。此异品者。不别取二。总取一切无宗法处。名宗异品。故论说言。谓于是处无其所立。又若是常。见非所作。如虚空等。此但略无正诤无常。唯举见常名为异品准理同前。无随所应所立之法。无此宗处定遍无因。名因异品。然虽异品亦取因异。显无宗处因定随无。翻显有因宗定随转。虽复离法先宗后因。彼若不然。便成异法。今显能立本欲成宗。于异品无其宗便立。故正宗异后方因异。其因于彼宗异品处决定遍无。故言异品遍无性也。问言遍无性。已显无因宗必随无。何须言异品。既云异品。即显无宗因亦随无。何须复云遍无性也。答但言遍无不言异品。乃显此因成相违法等。非离于宗返成宗义。但言异品不言遍无。亦显此因成不定等非定成宗。今显此因定成于宗同品定有。于异品上决定遍无。故说异品遍无性也。由此应为四句分别。有异品非遍无。谓宗异品非因遍无。即九句中。除二五八。余六句是。一三七九四是不定。四六相违。如前配释。有遍无非异品。谓因遍无非宗异品。即九句中。第四五六。四六相违。第五不定。有异品亦遍无。谓宗异品亦因遍无。即九句中第二五八。二八正因。第五不定。有非异品亦非遍无。谓非宗异品。亦非因遍无。即九句中。除四五六。余六句是。二八正因。余四不定。如上所说诸句料简。自句他句皆无过者。正因所摄。当句之中虽无其过。他句有过。故应如前一一分别。初三句中。唯第三句少分正因。余皆有过。为简彼过故说异品遍无性也。问此三相中。何故不言遍是宗品性。而云法性。同异二相何故不言同定有法性。异遍无法性。而皆云品。答宗一所立。总说为宗。狭不说品。喻宽能立。皆说品字。以因成宗。非成二品。初相云法。后二不言。问此之三相。为具方成。为阙亦得。若具方成。何故前言阙无异品亦成正因。既不要具。何须三相。答要具三相。止异滥而成因。非关喻依故。阙无而许正。同法本成宗义。无依不顺成宗。异法本止滥非。滥止便成宗义。故同必须依体。异法无依亦成。此说有体成有体宗。故异体无亦具三相。上来三句所说过者。各自句中四句之过。若谈阙过。阙有二种。一无体阙。二有体阙。无体阙者。谓不陈言。但在三支。非在三相。若陈因言。必有体阙。三相既义故非无体。无体阙者。此中相对互说有无亦为四句。有阙因非同异喻。有阙同异喻非因。有阙因亦阙同异喻。有非阙因非阙同异喻。此四句中。初句阙一。第二句阙二。第三句阙三。第四句非过。如是乃至三立皆阙。三皆不阙。有阙皆过。不阙不定。虽有所陈似立生故。三皆阙者。唯陈其宗。不陈余故。如是合有三个四句。一个两句。但名阙过非余过摄。有体阙者。复有二种。一者以因三相而为能立虽说因三相。少相名阙。二者因一喻二三为能立。虽陈其体。义少名阙。且因三相少相阙者。有阙初相非后二。有阙后二非初相。有阙初相亦后二。有不阙初相亦非后二。如是乃至。三相俱阙。三相俱不阙。此中总有三种四句。一种两句。唯阙初相四不成摄。如是二合阙。乃至三合阙。随应唯有不成不定及相违过。皆因过故。若因一喻二陈为能立义少阙者。亦有三种四句。一种二句。且阙因义非后二。四不成过。有阙第二非初后。俱不成摄。有阙第三非初二。俱不遣摄。如是阙二乃至阙三。及三不阙。阙者皆过。不阙非过。随应各有因四不成。同喻俱不成。异喻俱不遣。或具二过。或具三过贤爱论师。陈那菩萨等。不以无体为阙。故唯六句。虽唯陈宗从元无能立。何名能立缺减之过。诸德皆说总有七句。不言有能立以成过。但是阙能立过。故说七阙。问理门论料简九句云。于同有及二。在异无是因。返此名相违。所余皆不定。谓九句中。唯有法自相一违。及五不定。余四不成。一不定。三相违。何故不摄。答以因亲成于宗。所以说其相顺。同异成宗疎远。故但标其顺违。由此余过不摄之尽。上三相中各自为句。及三相对阙。论文虽无次第作处。道理定然。巨细分别更有多种。且以初相三句之中一句为首。对余二相作四句者。有是宗法而非遍。非是同品非定有性。有是同品非定有性。非是宗法而非遍有是宗法而非遍。亦是同品非定有性。有非宗法而非遍。亦非同品非定有性。如是以初相第一句。对第二相四句。有四种四句复以此句对第三相四句。复有四种四句。如是初相第一句。对余二相四句。有八种四句。以初相余二句为首。对余二相各四句亦如是。其初相三句为首。对余有三种八句。总成二十四种四句。以第二相四句。对第三相四句。一一各别有四种四句。复成一十六种四句。如是总成四十种四句。有是有非。恐文繁广略示而已。于前诸句总说颂曰。于宗法三相。各对互随无如应为不成。不定相违等。等言意显诸缺减过。同喻异喻诸所有失。皆此所摄。宗法三相。因三相也。于此三相而释义故。因亲成宗相宽遍故。各对互随无者。此有四类。一者各对。三相一一各对自法为句。初相有三。后二各四。二者互随无。三相更互阙无绮对为句。古今合有多释。今唯取宗法三相。入此颂中有三种四句。有一种两句。三者各对互随无。以初相三句中一一句。各对后二相中各四句一一。更互随有无以为四句及以第二相四句一一。对第三相四句一一。更互随有无以为四句。合有四十种四句。四者各对互随。以因三相。如其所应。初相有过。名为不成。于后二相有过。名为不定。于其二相有相违过。名曰相违。若三支互阙。因阙名不成。同阙名俱不成。异阙名俱不遣。三支虽具。自他各对互随是非名相违决定。是故称等。如是总摄因过皆尽。此中合有四十五种四句。一种三句。一种两句。或阙一有三句。阙二有三等。是名略释宗法三相</p><p>论。云何名为同品异品</p><p>述曰。四别释有二。初问。后答。此问也。何故三相不问释初。答有二释。一者同品异品各各有二。一宗同异二因同异。今说宗同异。恐滥因同异。故偏问之。初相无滥。故不须简。问遍是宗法。宗有别总。义亦有滥。何故不征。答因于有无说宗同异。宗成顺违说因同异。故于宗因同异不定。为简此过。遂别征二。由因但是有法宗法。成于法故。不是总宗及法之法。无滥可遮故不征释。此问二体相成显故。二者宗是有法。上已明之。二品未明。故须征释</p><p>论。谓所立法均等义品说名同品</p><p>述曰。下答前征有二。初同。后异。同中复二。一总出体。二别指法。此初也。所立法者。所立谓宗。法谓能别。均谓齐均。等谓相似。义谓义理。品谓种类。有无法处。此义总言。谓若一物。有与所立总宗中法。齐均相似义理体类。说名同品。是中意说宗之同品。所立宗者。因之所立自性差别不相离性。同品亦尔。有此所立中法。互差别聚不相离性相似种类即是同品。若与所立总宗。相似一切种类之聚名同品者。宗上意许所有别法。皆入总宗。且如异品虚空上无我。与声意许无我相似应名同品。若与所立有<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>似种类之聚名为同品。即一切宗多无同品。如声有法。瓶非同故至下喻中当广建立。为遮此二。总标所立法而简别之。若聚有于宾主所诤因所立法聚相似种类即名同品。由法能别之所别宗因之所成。故举此法以彰彼聚。问若尔。声上无我等义。非因所立应名异品。答彼若不许声有法有亦成异品。宗因无故。若彼许有。为因所成。随意所诤亦名同品。故有有法差别相违</p><p>论。如立无常瓶等无常是名同品</p><p>述曰。此别指法。如立宗中陈无常法聚名宗者。瓶等之上亦有无常。故瓶等聚名为同品。此中但取因成法聚名为同品。故瑜伽言。同类者。谓随所有法望所余法。其相展转少分相似。有五相似。一相状二自体。三业用。四法门。五因果。今此中说法门相似</p><p>论。异品者谓于是处无其所立</p><p>述曰。下解异品有二。一总出体。二别指法。此初也。处谓处所。即除宗外余一切法。体通有无。若立有宗。同品必有体。所以前言均等义品。异品通无体。故言是处。所立谓宗不相离性。谓若诸法处无因之所立即名异品。非别无彼言所陈法。及与有法名为异品。过如前说。此中不言无所立法。前于同品已言均等所立法讫。此准可知。但无所立。义已成故。理门亦云。若所立无说名异品。但无所立即是异品。同品不说处。异体通无故。瑜伽说言。异类者。谓所有法望所余法。其相展转少不相似。故非一切全不相似。但无随应因所成故。与同相违亦有五种</p><p>论。若有是常见非所作如虚空等</p><p>述曰。此别指法。如立其无常宗。所作性为因。若有处所是常法聚。见非是所作。如虚空等。说名异品。此中既说宗之异品。唯应说云谓若是常。如虚空等。复云见非所作者。举因异品。兼释遍无。问何故前说宗之同品不兼定有。此释异品兼解遍无。答有二解。一者影彰同品之中但为简别因之同品。显异亦尔。不要解于定无之相。故文略之异品之中。乘言便故。兼释遍无。显同亦尔。二者同品顺成。但许有因即成同品。易故不解决定有性。异品止滥。必显遍无方成止滥。故解异品。兼解遍无同品因也。为显同异二品别故。问如立无常。龟毛无彼<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>之相亦名无常。于一切时性常无故。亦得名常。何故不立非同异品。答声言无常。性是灭义。所作性者。体是生义。龟毛非灭。亦非有生。既无所立。即入异品。故喻唯二。更无双非。若常宗有亦入异品。若非有品便入同中</p><p>论。此中所作性或勤勇无间所发性</p><p>述曰。五示法也。于中有三。初举两因。次成三相。后显所</p></div>"
}]