[{
    "title": "大乘百法明门论疏 第1837部",
    "author": "大乘光",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>大乘百法明门论疏 卷上</p><p>大慈恩寺<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>大乘光撰</p><p>将欲造文。略以三门分别。第一明造论意。第二释题目。第三随文解释。第一明造论意者。寻夫<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>有情五趣漂溺。循环不息。<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>无替者。莫不以断常空有纷纠于怀。所以菩萨降生垂范利物。为除空有两执故。开空有二门。前明百法有体。为遣执空。后明人法二空。为除有见。所以有体。世谛非无。所以言空。<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>何有。随病说药。病息药亡。执药成病。悟病成药。非空非有。即有即空。既绝百非。又亡四句。然因诠显旨故假论以明。既不说而说。亦听无所听。论之兴也其在兹乎。此即第一明造论意。第二释题目。言大乘百法明门论本事分中略录名数者。大是遮小得名。乘以运载为义。此言大乘。遮诠立号。非是直诠。言遮诠者。简小乘故名曰遮诠。十十名百。广如后释。持<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故名之为法。明者是慧与明为门故曰明门。问答往还称之为论。言本事分中者。即百法明门论本事分中也。本事分中文繁浩博。此论文略故言略录。非义略也。目召诸法。称之曰名。一十百千名之为数。故言大乘百法明门论本事分中略录名数。此即第二释其题目。第三随文解释者。就此文中。义别不同分为三段。第一引经标宗。第二寻经起问。第三依问为通</p><p>论云。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言一切法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>者解云。此初第一引经标宗。明法无我。如佛世尊。诸经皆说一切法中都无有我。故今举教标以为宗</p><p>论云。何等一切法云何为无我者解云。自下第二依经起问。既引圣言。诸法无我未知。何者是一切法。云何为无我</p><p>论云。一切法等者解云。自下第三依问为通。就答文中有二。初答前问。第二言无我者以下答后问。此言一切法者。略有五种。等者。此答初问。就初答中有三。第一牒前问举数列名。第二废立五法前后次第。第三别释五法。就初有二。一举数。二列名。此即第一牒章举数</p><p>论云。一者心法二者心所有法三者色法四者心不相应行法五者<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>者此即第二列五法名</p><p>论云。一切最胜故者解云。自下第二废立五法前后次第。问何故第一明其心法。一切法中心法最胜。是故经言。心净故<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>净。心染故众生染。由此心故。或着<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。或证<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。以胜用强。是故第一明其心法</p><p>论云。与此相应故者解云。何故第二明其心所有法。谓此心法常与心王同依同缘及与同时。若约小乘。更有同行。今依大乘。心法与王不同其行。所以者何。由心法等与王行相各各不同。如缘青色。心王自变心法自变。是故不同。此之心法与其心王各缘诸境。一时相应。心起即起。心无即无。如王左右不离于王。心数相应亦复如是</p><p>论云。二所现影故者解云。何故第三明其色法。谓此色法不能别起。依心及所数之所变生。是彼二法所现影故。是故第三明其色法</p><p>论云。三位差别故者解云。何故第四明心不相应。谓不相应无别有体。总是假立。于前色心及心所有法三法之上分位差别。假施设有。是故第四明心不相应</p><p>论云。四所显示故等解云。何故第五明其无为。无为之<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>难了知。若不约法以明。何能显示。故能依色心心所有法不相应行四法之上显示无为。是故第五明无为法</p><p>论云第一心法者解云。自下第三别解五法。于中有五。第一解心法。第二解心所有法。第三解色法。第四解心不相应行法。第五解无为法。就第一解心法中有三。一牒章。二举数。三列名。此即第一牒章</p><p>论云。略有八种者举数</p><p>论云。一眼识二耳识三鼻识四舌识五身识六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>七末那识八阿赖耶识者解云。自下第三列名。眼识眼根识能了别。谓此之识依于眼根了别色尘。识从所依名为眼识。如眼识既然。耳鼻舌身及与意识随义应知。七末那者。末那<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。此翻为意。意以思量为义。此即随义立名。八阿赖耶识者。阿赖耶识西国梵音。此翻为藏亦名为宅。宅即摄持诸法。藏即贮积无遗。藏宅之名此皆从义立名。上来第一略释其名。今复略以五门料简<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>。第一缘境分别。第二四缘分别。第三四界分别。第四重数分别。第五三性分别。第一缘境分别者。就缘境中有二。初约因位辨。次约果位辨。初因位辨者。眼等五识所缘境界西方诸师有其两释。第一释云。眼等五识唯缘实尘不缘于假。所以者何。眼等五识缘证量尘。不待名言不待此余根境。由长短等诸余假色。要待名言及待此余根境。是故不缘长等假色问曰。五尘之中何者是实何者是假。解云。色尘之中。青黄赤白四种是实。余并是假。声尘之中。因执受大种声。因不执受大种声。因执受不执受大种声此三是实。余并是假。香尘之中。好香恶香平等香。此三是实。余并是假。味尘之中。苦酢甘辛咸淡。此六是实。余并悉假有。触尘之中。地水火风四种是实。余并是假有。问曰。眼等五识既不缘假。何故诸论色尘之中说有长等假色。乃至触尘之中说有滑等假触。解云。所以色尘之中说有假色。乃至触尘之中说有假触者。此文但据摄假从实。是故合说。据实不缘。问曰。若不缘者。犹如阴夜远望树林。唯见长等不见青黄。云何眼识不缘其假。解云。此亦得缘青黄实色。阴夜远望青黄赤白虽非分明。了了至触而见。然亦得缘。是故唯缘青等实色不缘于假。问曰。长等假色眼识不缘。此诸假色何色中摄。答曰。当知此诸假色法处之中遍计所起色摄。问曰。忿等诸惑是贪上假则皆法处中摄。何故长等假色是青等上假非色处中收。解云。忿贪俱意缘。是故法处摄。长等非眼见故非色处收。如色尘中作此分别。乃至触尘分别随义应知。又一释云。眼等五识假实并缘。若缘于假必缘其实。缘实之时不缘于假。所以者何。假依实有。缘假之时其必缘实。实不依假。缘实之时不缘于假。此家所说诸假法等非法处中遍计性摄。如长等假色即色处中收。乃至触尘之中滑等假触处中摄。第六意识缘一切法。如其所应随义应知。第七末那缘境。西方诸德亦有两释。一释云。末那缘阿赖耶识见分为我。缘阿赖耶识相分为其我所。问曰。何一心执阿赖耶识见分为我。复执阿赖耶识相分为其我所。解云。且如眼识。一时尚缘青等种种诸色。一心所缘我我所此亦何过。问曰。诸论并云。末那执阿赖耶识为我我所。不言执其相分。何故今者乃言执其相分以为我所。解云。当知此相不离于见。所以诸论并言缘阿赖耶识为我我所。此亦无过。又一释云。末那执阿赖耶识为我我所。问曰。执阿赖耶识为我。云何复执为其我所。解云。谓此末那先执阿赖耶识为我。后复执此所计之我。是我家所有。故名我所。问曰。若执阿赖耶识相分为我所者。此有何过。解云。诸论中但言执阿赖耶识为我我所。不言执其相分是其我所。末那直执阿赖耶识为我我所。何能复更外执相分以为我所。于义不可。是故不缘。第八阿赖耶识缘于种子五根五尘。问曰。何故不缘六七等识。解云。阿赖耶识缘任运境。六七等识非任运境。是故不缘。问曰。何故<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>得缘诸识。解云。第六识分别用强。是故得缘。第八识无此分别。是故不缘。此即第一约因位辨也。第二约果位辨者。若至果位眼等诸识皆缘诸法。第二四缘分别者。阿赖耶识当体自望。若约粗言但有三缘。约细言之具四缘。约粗言之具三缘者。种子望现行得作<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。前心灭后心生。得作等无间缘。不相障碍故得有增上缘。阿赖耶识前后不相缘故无所缘缘。若约细言之亦有所缘缘。谓一心起时有其四分。所谓相分。见分。自证分。证自证分。此四分中有前后相缘故得有所缘缘。阿赖耶识望末那得有二缘。阿赖耶识生现行末那故得有因缘。不相障碍故得有增上缘。不由阿赖耶识灭故末那得生无等无间缘。阿赖耶识不能缘末那故无所缘缘。阿赖耶识望第六识得有二缘。阿赖耶识生现行六识故得有因缘。不相障碍故得有增上缘。不由阿赖耶识灭故第六识得生无等无间缘。阿赖耶识不能缘六识为境故无所缘缘。阿赖耶识望五识有二缘。阿赖耶识生现行五识故得有因缘。不相障碍故有增上缘。不由阿赖耶识灭故五识得生无等无间缘。阿赖耶识不能缘五识故无所缘缘。第七末那当体自望。若约粗言之有二缘。若约细言之有三缘。约粗言之有二缘者。前念与后念为次第缘。不相障碍有增上缘。约细言之有三缘。二缘者如前。更加所缘缘。谓一心中有其四分。前后相缘故有所缘缘。此之四分如前已说。不烦重列。末那望阿赖耶识得有三缘。谓末那熏阿赖耶识故得有因缘。末那缘阿赖耶识得有所缘缘。不相障碍故得有增上缘。不由末那灭故阿赖耶识生故无等无间缘。末那望第六识得有一缘。谓不相障碍故得有增上缘。不由末那灭故第六识生故无等无间缘。末那不熏第六识故无因缘。末那不能缘六识为境故无所缘缘。末那望五识得有一缘。谓不相障碍故有增上缘。末那不熏五识故无因缘。不由末那灭五识生故无等无间缘。末那不能缘五识为境故无所缘缘。第六意识当体自望得有三缘。谓前后相缘故有所缘缘。前心有开辟义故有等无间缘。不相障碍故有增上缘。从阿赖耶识种子生故无因缘。第六识望阿赖耶识得有三缘。熏阿赖耶识故有因缘。缘阿赖耶识为境故得有所缘缘。不相障碍故得有增上缘。不由第六识灭故阿赖耶识生故无等无间缘。第六识望末那有二缘。谓缘末那为境故得有所缘缘。不相障碍故得有增上缘。不熏末那故无因缘。不由第六识灭故末那生故无等无间缘。第六识望五识得有三缘。谓缘五识为境故得有所缘缘。由有开辟义故有等无间缘。不相障碍故得有增上缘。不能熏五识故无因缘。五识当体自望。若约粗言之有一缘。若约细言之有二缘。约粗言之有一缘者。谓五识前后不相障碍故有增上缘。五识从阿赖耶识种子生故无因缘。五识后必起意识。以间断故自类相望无等无间缘。五识前后不相缘故无所缘缘。约细言之有二缘者。亦得有所缘缘。谓五识起时有四分。前后相缘故得有所缘缘。五识望阿赖耶识得有二缘。谓五识熏阿赖耶识故有因缘。不相障碍故有增上缘。不由五识灭故阿赖耶识生故无等无间缘。五识不能缘阿赖耶识为境故无所缘缘。五识望末那得有一缘。谓不障碍故有增上缘。五识不熏末那故无因缘。不由五识灭故末那生故无等无间缘。五识不能缘末那为境故无所缘缘。五识望第六识有二缘。谓五识望第六识有开辟义故有等无间缘。生时不相障碍故有增上缘。不熏第六识故无因缘。不能缘第六识为境故无所缘缘。第三四界分别者。四界谓欲界。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。及无漏界。问曰。八识几通四界。几通三界。几通二界。几唯一界。答曰。三通四界。三谓意识末那阿赖耶识。三通三界。三谓眼识耳识身识。三界谓欲界色界及无漏界。二识通二界。二识谓鼻识舌识。二界谓欲界及无漏界。此八识中当知无有唯一界者。第四重数分别者。眼等五识及与末那有其三重。谓种子为一重。现行为第二重。第六意识缘为第三重。第六意识有三重。种子为一重。现行为第二重。前后相缘为第三重。阿赖耶识有四重。谓种子为一重。现行为第二重。第六意识缘为第三重。末那缘为第四重。第五三性分别者。三性谓善不善无记。眼等六识通于三性。第七末那通于二性。谓善性无记性。若在因位是无记性。若在果位及入观时当知是善性。第八阿赖耶识亦通二性。谓异熟无记及与善性。若在因位是异熟无记。若在果位即是其善。上来略料简八识讫</p><p>论云。第二心所有法略为六种者自下第二明心所有法。就中有三。第一总牒开章。第二列名举数。第三别牒具陈。此即第一总牒开章。言心所有法者。谓彼心王是其能有。此等诸法数心之所有。故名心所有法。言略有六种者。举心所有法结六位数名</p><p>论云。遍行有五别境有五善有十一<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>有六随烦恼有二十不定有四者此即第二列名举数</p><p>论云。遍行五者一作意二触三受四想五思者此下第三别牒具陈。就中有六。第一解遍行五。第二解别境五。第三解善十一。第四解烦恼六。第五解随烦恼二十。第六解不定四。此即第一解遍行五。言遍<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。于一切时恒相续起。遍八识有名曰遍行。一作意等者。作动于心令心数数外缘诸境名为作意。既作意已令其心王触于前境。名之为触。领纳外尘觉苦知乐。如是取境名之为受。谓于境界取其像貌方圆等相故名为想。令心造作<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记。如是等业称之为思。即第一解遍行讫</p><p>论云。别境五者一欲二胜解三念四三摩地五慧者此即第二解别境五。言别境者。别缘诸境名为别境。何者名别。且如其欲。希望前境名之为欲。不希望境即无有欲。希望之欲与不希望二种有异。名之为别。乃至第五慧数简择诸法。名之为慧。不简择法不名为慧。简择之慧与不简择二种有异。名之为别。言一欲者。于自乐境希望愿求。或善或恶名之为欲。于所缘境心生决定是事必尔名为胜解。过去曾缘所习境界明记不忘。名之为念。于一境界令心不散专住不离名三摩地。三摩地名翻为等持。此即定之异名。持其心王及与数法等至于境名为等持。简择是非分别善恶得决定义。名之为慧。上来第二解别境讫</p><p>论云。善有十一者一信二<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>三惭四愧五无贪六无嗔七无痴八轻安九不放逸十舍十一不害者此即第三解善十一。言善者。不造众恶名之为善。信有<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a><a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>心不生谤。名之为信。心勇不退精勤策励求诸善法名为精进。造诸过恶自羞名惭。造诸过恶羞他名愧。又解云。造诸过恶羞天名惭。造诸过恶羞人名愧。于世荣利财色等法心不耽著名曰无贪。于诸有情心无损害慈愍在怀名曰无嗔。于诸善法心无迷惑如实了知名曰无痴。身心调畅远离粗重适悦安乐名为轻安。耽着五欲名为放逸。远离彼尘名不放逸。离沈离掉处于中庸其心平等名之为舍。损恼有情称之为害。哀愍生故名为不害。上来第三解善十一讫</p><p>论云。烦恼六者一贪二嗔三慢四无明五疑六不<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>者此即第四解烦恼六。言烦恼者。恼乱身心名为烦恼。言贪者。于诸有情及资具等爱乐耽着。名之为贪。于诸有情起诸损害心不安隐。称之为嗔。众财色等而起贡高计己胜他。名之为慢。了其真实名之为明。不了真实号曰无明。于诸谛中心怀犹豫如立衢路。名之曰疑。称境而知名为正见。此见邪僻名不正见。上来第四解烦恼六讫</p><p>论云。随烦恼二十者一忿二恨三恼四覆五诳六谄七憍八害九嫉十悭十一无惭十二无愧十三不信十四<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>十五放逸十六惛沈十七掉举十八失念十九不正知二十心乱者此即第五解随烦恼二十。言随烦恼者。恼乱身心烦劳行者名为烦恼。忿等诸惑随贪等起名随烦恼。又解云。谓此忿等随顺于心不念<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>名随烦恼。言忿等者。于违愤发名之为忿。忿后结怨名之为恨。心恨暴怒称之为恼。隐实过恶目之为覆。谗诈惑乱称之曰诳。憍现恭顺名之为谄。恃荣自举悦豫名憍。无悲无愍损恼称害。妒胜忧戚名之为嫉。蕴财贪著名之为悭。过不自耻名曰无惭。恶不羞他名曰无愧。违正不欲心不清净名为不信。耽乐退善名为懈怠。于恶不防名为放逸。滞境无堪名曰惛沈。心不寂静缘贪欲等名为掉举。谓于所说若法若义无所堪能名为失念。正了诸法名为正知。邪了不达名不正知。驰散外缘其心散乱<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>不息名为心乱。上来第五解随烦恼二十讫</p><p>论云。不定四者一睡眠二恶作三寻四伺者此即第六解不定四。言不定者。谓此四法于三界中不定一处。如寻伺二数色界中有。余二即无。不定相随故名不定。言睡眠等者。略摄于心不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>转越失所作名曰睡眠。于已作未作善不善事心怀追悔名为恶作。于法推求未审细察令心粗转。名之为寻。于所寻法数数推求令心细转故名为伺。上来第二明心所有法讫</p><p>大乘百法明门论疏卷上</p><p>﻿乘百法明门论疏 卷下</p><p>大慈恩寺沙门大乘光撰</p><p>今略以五门料简心所有法。其五门者。第一诸论不同。第二假实分别。第三四界分别。第四三性分别。第五废立六位。第一诸论不同者。若依此论。心所有法有五十一。谓遍行五。别境五。善十一。烦恼六。随烦恼二十。不定四。若依瑜伽有五十三法。五十一同此论。但随烦恼中更加邪欲邪胜解二教。若依显扬论及<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>论。心所有法有五十一。并同此论。无有差别。若依杂集论。心所有法五十五。自余诸数并同此论。唯烦恼六中开不正见为五。谓萨迦耶见。边执。见取。戒禁取。邪见。此即诸论显数不同。问曰。何故瑜伽随烦恼中更加邪欲邪胜解。诸论并无。此有何意。解云。瑜伽论所以更加邪欲邪胜解者。为别境五中念定慧三入随烦恼。当知欲与胜解亦入随烦恼中。又此二数为障义重得入随烦恼中。问既如是者。诸论何故不说。答诸论不说者。为念定慧三五根摄故亲为近障。过失重故。所以入随烦恼中。问曰。欲与胜解五根不摄。何故瑜伽建立此二入随烦恼。若尔。何故遍行五数亦不入随烦恼中。解云。此之二数虽望念定慧三非五根摄为障是稍轻。若望遍行还是其重故。瑜伽论以此二数为障义重得入随烦恼中。问曰。何故杂集论烦恼六中开不正见为五见。诸论并合为一。此有何意。解云。诸论所以合为一者。以此五见同是慧性。对法论所以开为五者。约行解不同开之为五。此亦开合为异。亦无妨难。第二假实分别者。心所有法若依瑜伽论。二十七种是其实有。余是假立。二十七是实者。谓遍行五。别境五。善中八。除不放逸舍不害。当知不放逸舍是无贪无嗔无痴精进四法上假。不害即是无嗔上假故。论云。问是诸善法几世俗有。几实物有。答三是世俗有。谓不放逸舍及不害。所以者何。不放逸舍是无贪无嗔无痴精进分故。即如是法离杂染义建立为舍。治杂染义立不放逸。不害即是无嗔分。故无别实物。烦恼六中五是实有。谓贪嗔痴慢疑。一是假有。谓不正见。论云。根本烦恼六。一贪二嗔三无明四慢五见六疑。问是诸烦恼几世俗有。几实物有。答见是世俗有。是慧分故。余是实物有。别有心法故。随烦恼为假为实者。若依瑜伽决择分中。不定四法亦入随烦恼中。合二十四总名随烦恼分。亦无邪欲邪胜解二法。但本地分中有二十六。更加邪欲邪胜解故。决择分中云。复次随烦恼自性云何。谓忿恨覆恼嫉悭诳谄憍害无惭无愧惛沉掉举不信懈怠忘念放逸散乱不正知恶作睡眠寻伺。如本地分已广宣说。如是等类名随烦恼自性。复次此烦恼几世俗有。几实物有。谓无惭无愧不信懈怠。此四种是实物有。余是假有。谓忿恨恼嫉害五。是嗔分故皆世俗有。悭憍掉举三。是贪分故示世俗有。覆诳谄惛沉睡眠恶作忘念散乱恶慧九法。是痴分故皆是世俗有。放逸是贪嗔痴分。亦是假世俗有。寻伺二种是身语意加行分故。及慧分故。俱是假有。若依瑜伽。二十七是实有。二十四是假有。若依对法论文。二十二是实物有。余并假有。言二十二实物有者。谓遍行五。别境五。善十一中七。是实有。四是假有。故对法论云。无痴者。谓报教证智决择为性。报教证智者。谓生得<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>所生慧。如次应知。决择者。谓慧勇勤俱。故知无痴用慧为性。更无别体。不放逸舍并云依止正勤无贪嗔痴。是故依此四法假立。言不害者。是无嗔善根一分。心悲愍为体。当知不害不离无嗔故亦是假。根本烦恼为有十中。五是实有。谓贪嗔痴慢疑。五是假有。谓五见离慧之外无别性故。随烦恼及不定合二十四皆是假立。故论云。当知忿等是假建立。离嗔等外无别性故。谓忿恨恼嫉害此五是嗔一分。与瑜伽同。悭憍是贪一分。掉举是贪一分。此三是贪分。亦瑜伽同。放逸中依止懈怠及贪嗔痴四法假立。亦瑜伽同。无惭无愧二数是贪嗔痴分假立。不信懈怠二数是痴分并是假立。与瑜伽不同。谓瑜伽说。此四是实物有。今对法言。无惭无愧二数是贪嗔痴分。不信懈怠二数是愚痴分。故不同瑜伽。谄诳二数是贪痴一分。散乱一数是贪嗔痴分。忘念不正知是烦恼中念慧为性。覆睡眠恶作是愚痴分。寻伺二数或是思性或是慧性。谓推度不推度有差别故。大乘瑜伽论中云。随烦恼中九数。谓覆诳谄惛沉睡眠恶作忘念散乱恶慧。并是痴分。今对法中唯覆惛沉睡眠恶作四是愚痴分。余五不同。谓散乱一数是贪嗔痴分。谄诳二数是贪痴一分。失念不正知是烦恼中念慧一分。当知并是作论者意异各说一义。西国诸德并云。随烦恼中七是实有。谓无惭无愧惛沉掉举不信懈怠心乱。此七数并别有体。问曰。无惭无愧不信懈怠。此四有别体者。论有诚文。惛沉掉举散乱三数而有别体。何以得知。解云。为掉举数论判。是其贪分。若此数离贪外无别体者。贪不与嗔痴相应。若尔。别有掉不得与一切烦恼相应过失。既言掉与一切烦恼相应。故知掉别有体。掉既言是贪一分有别体。当知惛沈散乱亦言唯是痴分。故知亦有别体。而准对法文。但随烦恼中放逸是贪嗔痴一分者。则是实有。此随烦恼二十中。唯此无惭无愧惛沉掉举不信懈怠心乱七数。谓是贪嗔痴分。其余十三数。或言一分。或言依止。故知并是假有。不定四数中。睡眠恶作亦言是愚痴分。亦有别体。谓睡眠用想欲为性。离想外无别体故。故显扬论言。梦者欲想所作。此亦多虚。故知睡眠是欲想性。谓是痴分。虽离痴外有别体。然是欲想性故。当知亦是假立。恶作无文。但西国诸师相传云。或是慧。虽言痴分离痴外有别体。然是思是慧性。离思慧外无别体故。故知亦是假立。寻伺两数离思离慧无别性故。亦是假立。西国诸师相传云。无痴善根亦有别体。何以得知。一瑜伽中唯言。善十一中三是假有。谓舍不放逸不害。余是实有。故知无痴亦有别体。又云。大悲用无痴善根为性。与二十二根慧根不言相摄。故知无痴别有体性。问曰。若尔。何故对法论云。无痴者谓报教证智决择为体。释论云。报教证智者。谓生得闻思修所生慧。如次应知。决择者谓慧勇勤俱。此文何以言是慧性耶。解云。无痴善根但对治痴。如无贪无嗔但对治贪嗔。别更无行相。对法论中。就行相以释无痴。非谓无痴善根则是慧性。若从此义。心所有法五十一中三十是实有。余皆是假有。言三十是实有者。谓遍行五。别境五。善八。加无痴。根本烦恼五。除不正见。随烦恼七。合此三十是实有。余是假有。第三四界分别者。四界谓欲界色界无色界无漏界。五十一心所有法中。二十一通四界。谓遍行五。别境五。善十一。十四通三界。三界谓欲界色界无色界。十四谓贪慢疑无明不正见不信懈怠放逸惛沉掉举忘念不生知散乱憍。四通二界。二界谓欲界色界。四数谓谄诳寻伺。十数唯欲界。十数谓嗔忿恨恼覆嫉悭害无惭无愧。第四三性分别者。三性谓善不善无记。于五十一心所有法中。十四通三性。十四者。谓遍行五。别境五。不定四。十六通二性。二性谓不善性无记性。言十六者。谓烦恼中贪慢疑无明不正见。随烦恼中十一。谓谄诳憍惛沉掉举不信懈怠放逸忘念散乱不正知。二十一唯一性。若善十一唯是善性。若嗔忿恨覆恼嫉悭害无惭无愧。此十唯不善。第五废立六位者。依瑜伽论。略以四义废立心所有法。言四义者。一处二地三时四一切。处谓三性。地谓九地。时谓<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>相续。一切谓俱起。今约此四义明具多少。就中有二。先明六位具义多少。后明六位废立所由。先明六位具义多少者。遍行五法具其四。一遍三性。二遍九地。三是相续。四是俱起。别境五法具二阙二。言具二者。一通三性。二遍九地。言阙二者。一非相续。二非俱起。善十一法有一阙三。言有一者。谓遍九地。言阙三者。一非通三性。二非相续。三非俱起。烦恼六者有一无四。言有一者。谓本烦恼性。言无四者。一非通三性。二非遍九地。三非相续。四非俱起。初之一门亦为简随烦恼故。所以更加余之四门。并依瑜伽论。随烦恼二十有一无四。言有一者。谓随烦恼性。言无四者。谓一非通三性。二非遍九地。三非相续。四非俱起。初之一门为简本烦恼性。是以更加余之四门。并依瑜伽论。不定四法有一阙三。言有一者。谓通三性。言阙三者。谓一非遍九地。二非相续。三非俱起。言废立六位所由者。初得后五位对其遍行。以明废立。遍行五法具四义故名遍行。余皆不具非遍行摄。别境五法俱具二义。谓通三性及遍九地。然非相续亦非俱起。阙此二义不名遍行。善十一法俱具一义。谓遍九地。然非遍三性。亦非相续。复非俱起。阙此三义不名遍行。烦恼六法四皆不具。谓非通三性。非遍九地。亦非相续。复非俱起。四义并阙不名遍行。随烦恼法如烦恼说。不定四法俱具一义。谓通三性。然非遍九地。亦非相续。复非俱起。三义阙故不名遍行。第二将余五位对别境位。约义有无。以明废立。具二阙二。入别境中。余则不尔。非别境摄。遍行五法虽通三性及遍九地。但为相续及为俱起。二义不同。非别境摄。善十一法虽遍九地亦非相续复非俱起。但为非通三性。一义有异。非别境摄。烦恼六法虽非相续亦非俱起。但为非通三性非遍九地。二义有异。非别境摄。随烦恼法对其别境废立如烦恼说。不定四法虽通三性亦非相续复非俱起。但为非遍九地。一义不同。非别境摄。第三将余五位对善十一。约义有无。以明废立。具一阙三。入善法中。余则不尔。非善法摄。遍行五法虽遍九地。但为通三性。亦相续复俱起。阙三义故不入善中。别境五法虽遍九地亦非相续复非俱起。但为通于三性。一义不同。非善中摄。烦恼六法虽非通三性亦非相续复非俱起。但为不遍九地。一义不同。不入善中。随烦恼法如烦恼说。不定四法虽非相续亦非俱起。但为通于三性。非遍九地。二义有异。非入善中。第四将余五位对烦恼六。约义有无。以明废立。有一无四。入烦恼中。余法不尔。非烦恼摄。遍行五法但为通于三性。遍九地。亦是相续。复是俱起。亦非本惑。五义并阙。非烦恼摄。别境五法虽非相续亦非俱起。但为通三性。亦遍九地。复非本惑。三义不同。非烦恼摄。善十一法虽非通三性亦非相续复非俱起。但为遍九地。非本烦恼。二义不同。非烦恼摄。随烦恼二十法虽非通三性非遍九地亦非相续复非俱起。但为非本烦恼。一义不同。非烦恼摄。四不定法虽非遍九地亦非相续复非俱起。但为通三性。非本烦恼。二义不同。非烦恼摄。第五将余五位对随烦恼约义有无。以明废立。具一阙四。入随烦恼。余法不尔。非随烦恼。遍行五法但为通三性。遍九地。亦相续。复俱起。复非随惑。五义不同。非随烦恼摄。别境五法虽非相续亦非俱起。但为通于三性。亦遍九地。非随烦恼。三义不同。非随烦恼。善十一法虽非通三性亦非相续复非俱起。但为非遍九地。非随烦恼。二义不同。非随烦恼。烦恼六法虽非通三性非遍九地亦非相续复非俱起。但为非随烦恼。一义不同。非随烦恼。不定四法虽非遍九地亦非相续复非俱起。但为通三性。非随烦恼。二义不同。非随烦恼。第六将余五位对四不定。约义有无。以明废立。具一阙三。名四不定。余法不尔。非不定摄。遍行五法虽通三性。但为遍九地。亦相续。复俱起。三义不同。非入不定。别境五法虽通三性亦非相续复非俱起。但为遍九地。一义不同。非入不定。善十一法虽非相续亦非俱起。但为非通三性。遍九地。二义不同。非不定摄。烦恼六法虽非遍九地亦非相续复非俱起。但为非通三性。一义不同。非不定摄。随烦恼二十法虽非遍九地亦非相续复非俱起。但为非通三性。一义不同。非不定摄。上来略以五门料简心所有法讫</p><p>论云。第三色法者略有十一种一眼二耳三鼻四舌五身六色七声八香九味十触十一法处所摄色者此则第三明色法。就中有二。初牒章。第二举数列名。言第三色法者。此则第一牒章。言色者。质碍之法名之为色。问曰。若质碍故名色者。眼等诸色可名质碍。无作之色云何质碍。解云。无作之色虽非质碍。然从质碍色生故亦名质碍。言略有十一种等者。此则第二举数列名。了别色尘名之为眼。听音乐等故名为耳。嗅沉麝等名之曰鼻。别甘辛等名之为舌。知涩滑等名之曰身。为眼所行名之为色。若依杂集论有二十五种。所谓青黄赤白。长短方圆。粗细高下。若正不正。光影明闇。云烟尘雾。逈色表色。空一显色。为耳所闻名之为声。若依杂集论有十一种。谓若可意。若不可意。若俱相违。若因受大种。若因不受大种。若因俱大种。若世所共成。若成所引。若遍计所执。若圣言所摄。若非圣言所摄。为鼻所嗅名之为香。若依杂集论有六种。谓好香。恶香。平等香。俱生香。和合香。变异香。为舌所尝名之为味。若依杂集论有十二种。谓苦酢甘辛咸淡。若可意。若不可意。若俱相违。若俱生。若和合。若变异。身之所取故名为触。若依杂集论有二十二种。谓滑涩轻重。软暖急冷。饥渴饱力。劣闷痒粘。病老死疲息勇。十一法处所摄色者。谓意识所行无见无对色蕴所摄。略有五种。谓极略色。极逈色。受所引色。遍计所起色。自在所生色。极略色者。谓极微色。极逈色者。谓即此离余碍触色。受所引色者。谓无表色。遍计所起色者。谓影像色。自在所生色者。谓解脱静虑所行境色。上来大文第三明色法讫</p><p>论云。第四心不相应行法者略有二十四种一得二命根三众同分四异生性五无想定六灭尽定七无想事八名身九句身十文身十一生十二老十三住十四<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>十五流转十六定异十七相应十八势速十九次第二十方二十一时二十二数二十三和合性二十四不和合性者此则第四明心不相应行法。就中有二。第一牒章。第二举数列名。言第四心不相应行法者。此则第一牒章。遍行五等与心相应。此得等诸法不与心相应。此名心不相应。言行者。则是行蕴。此明得等诸法是行蕴摄。余心色无为非行蕴摄。言不相应。简别心所有法。言其行者。则简心色无为。故名心不相应行。略有二十四种等者。此则第二举数列名。言一得者。于三性法假立获得。名之为得。先业所感随寿短长住时决定称曰命根。六趣差别各各不同。自类而居名众同分。谓于圣法未得未证。异于圣故号曰异生。灭诸六<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>心数法无有缘虑故名无想定。灭诸六识心心数法及第七一分名为灭尽定。生无想天五百劫中心<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>虑名无想事。谓诠诸行<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>等号称曰名身。聚集诸法名显染净义故名句身。名之与句二种所依名曰文身。本无今有说之名生。发白面皱称之为老。相续不断名之为住。有已还无名曰无常。刹那相续称为流转。<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>各别故名定异。因果相称号曰相应。迅疾流转名为势速。一一不俱称为次第。东西南北号之曰方。过现未来称之曰时。一十百千名之为数。众缘聚会名为和合。诸行缘乖名不和合。上来第四解心不相应行讫。今略作三门料简二十四不相应行法。第一明诸论不同。第二释妨难。第三辨其假相。第一明诸论不同者。瑜伽显扬此论皆有二十四不相应行。对法论有二十三。无不和合。五蕴论中唯有十四。无流转等十。此则诸论显数不同。第二释妨难者。问曰。何故瑜伽显扬此论并同。何故对法论有二十三无不和合。此有何意。一解云。对法论云和合等者。论既言和合等。当知则等取不和合。又一解云。略故不说。问曰。等略何故不略余数但略不和合耶。解云。已说在所说中。所以但偏略不和合性也。言说在所说中者。谓异生性是见道烦恼。假建立。望圣道有不得义故。即是不和合义。不和合中略举一隅。余不和合类亦可知。所以偏略不和合性。瑜伽显扬此论并有二十四者。此据异生外别有不和合名。所以余论中言二十四也。问诸论或言二十四数。或言二十三数。已如上解。何故五蕴论中唯有十四。无流转等十。解云。所以五蕴论不说流转等十也。彼论云。如是等类者则解彼论云。当知如是等类之言亦等流转等十也。此中唯略故不别列名也。第三辨其假相者。二十四不相应行法并是色心心所有法分位假立。问曰。二十四不相应行既并是色心心所有法分位假立者。未知几是色上假。几是心上假。几是心所有法上假。几是通色心心所有法上假。解云。若依对法论。总摄为八位。依八种位建立故。论云。如是等心不相应行法。唯依分位差别而建立故。当知皆是假有。一谓于善不善等增减分位建立一种者。解云。此则是得通于三性色心心所有法上假立。二于心心所法分位差别建立三种者。解云。当知是则无想定灭尽定无想异熟三种也。谓无想定灭尽定。于厌心种子上。分分功能增长边假立为二定体。无想异熟。当知于无想报心种子上。望心不相应行义边。于报心种子上。假立无想异熟。此三通心心所有法上假立。三于性分位差别建立一种者。解云。此是命根。谓依阿赖耶识能持众同分。四大诸根不坏。则于阿赖耶识相应心心所法上假立命根。此则通心心所有法上假。若在欲色二界。通色上假。若在无色界。<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>心所有法上假。四于相似分位差别建立一种者。解云。当知则是众同分。通于色心心所有法上假立。五于相分位差别建立四种者。解云。当知则是四相。通色心心所有法上假立。六于言说分位差别建立三种者。解云。当知则是名句文身三种。通色心心所有法上假立也。问曰。名句文身色上假立。此无有疑。云何于心心所有法上假立。解云。此即意思所缘缘之起解故。通心心所有法上假立。七于不得分位差别建立一种者。解云。当知则是异生性。谓前无漏圣法不得义边假立异生性。则于未得见道已来色心心所有法上假立。八于因果分位差别建立余种者。解云。当知则是余十。谓流转定异相应势速次第方时数和合不和合。当知此十并通色心心所有假。总而言之。当知三通心心所有法上假立。二十一通色心心所有法上假立。言三种通心心所有法上假立者。谓无想定灭尽定无想异熟。言二十一通色心心所有法上假立者。谓得命根众同分异生性名身句身文身生老死无常流转定异相应势速次第方时数和合不和合。此则略料简心不相应行讫</p><p>论云。第五无为法者略有六种一<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>二择灭三非择灭四不动五想受灭六真如者此则第五明无为法。就此文中有二。第一牒章第二举数列名。言第五无为法者。此则第一牒章。略有六种等者。此则第二举数列名。言虚空者。谓无色性容受一切所作业故。故名虚空。谓慧有简择之能故名为择。由择得灭故名择灭。因缘不会诸法不生。非由慧灭名非择灭。第四静虑以上唯有舍受现行。不为苦乐所动故名不动。灭尽定中心心法灭。想受用胜。就强为名故则是此名想受灭。法性本来常自寂灭。不迁动义名为真如。此则第五明无为法。上来说一切法者。以下乃至第五无为答前问讫。自下第二答后问</p><p>论云。言无我者略有二种一补特伽罗无我二法无我者此则第二答后问。就此答中有二。第一牒章。第二举数列名。言无我者。此则第一牒章。略有二种等者。此则举数列名。言补特伽罗者。此地正翻名数取趣。于六趣中数数往还名数取趣。虽复往来都无我人故名无我。二法无我者。谓蕴界处等名之为法。此无人故名无我。此则第二答后问讫</p><p>大乘百法明门论疏卷下</p></div>"
}]