[{
    "title": "大乘百法明门论解 第1836部",
    "author": "玄奘法师 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>﻿大乘百法明门论解 卷上 (本地分中略录名数)</p><p>天亲菩萨造</p><p>唐<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>唐慈恩法师窥基注解</p><p>明鲁庵法师普泰增修</p><p>大者拣小为义。乘者运载得名(名义互言)百数也。法谓世出世之法。故心法八。心所五十有一。色乃十一。不相应二十有四。<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>六。故为大乘百法也。明乃菩萨无漏之慧。以能破暗故。门以开通无壅滞为言。论乃拣择性相教诫学徒之称。本地分中者。乃瑜伽论五分之一。略录名数者。于六百六十法中。提纲挈领取此百法名件数目。此论主急于为人。而欲学者知要也。又会六释云。大乘者。是能诠教。唯声名句。文四法故劣。百法乃所诠事理通一百法故胜。将胜就劣以劣显胜。云大乘之百法。依士释也。又百法是所缘。乃举全数故胜。明是能缘之慧。即别境五中之一法尔故劣。将劣就胜以胜显劣。云百法之明。依主释也。又明是能缘即别境中慧故劣。门是所缘通举百法故胜。将胜就劣以劣显胜。云明之门。依士释也。又门是所诠事理。乃通指百法故胜。论是能诠教唯声名句文故劣。将劣就胜以胜显劣。云门之论依主释也。又论为体。乃声名句文。门为用。于论上有不壅滞之功能。以体就用摄用归体。云门即论。持业释也。又论乃体。则取声名句文四法大乘为用。此论体上有拣小运载二义。故云大乘。以体就用摄用归体。云大乘即论。持业释也。又大乘通教理行果是所诠故胜。论是能诠唯教故劣。将劣就胜以胜显劣。云大乘之论。依主释也。又大等六字是所诠故胜。论是能诠唯教故劣。将劣就胜以胜显劣。云大乘百法明门之论。依主释也(亦可谓带数依主)又大乘等五字。通一百法属所诠故胜。门论二字乃能诠故劣。将劣就胜以胜显劣。云大乘百法明之门论。依主释也(亦带数依主释也)又大乘是能诠教体。门论是用。此教体上有妙旨悟入之义门。决择性相教诫学徒。断恶生善之功用。故名论将体就用摄用归体。云大乘即门论持业释也(作十释竟)</p><p>北<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>富娄沙富罗此云丈夫。国有国师。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>姓娇尸迦。生三子。同名婆薮盘豆。此云天亲。乃帝释之弟毗搜纽天王之后。虽同一名复有别号。长曰阿僧迦。此云无著。乃菩萨根性。季子别名比邻持跋婆此云母儿。盖比邻持此云母。跋婆云子。亦云儿。中子博学多闻遍通坟籍。神才俊朗戒行清白。无与俦匹。兄弟皆兼别号故。法师但名婆薮盘豆。不相滥也。依瑜伽论广造诸论。以释大乘。发挥非空非有中道之教(详于旧藏经甚字函婆薮盘豆传)</p><p>如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言一切法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>如世尊言原为佛说。乃论主推尊法有所自。一切法等者。总标百法及二无我。以为宗旨。乃一论之纲领也。若究所宗。总一代圣教浅深为次。分而为八。一我法俱有宗。此宗摄二十部五部之义。谓犊子部。法上部。贤胄部。正量部。密林山部。或亦取经部。根本一分之义。二法有我无宗。摄三部全。谓一切有部。雪山部。多闻部。更兼化地部。末计一分之义。三法无去来宗。摄七全部。谓大众部。鸡胤部。制多山部。西山住部。北山住部。法藏部。饮光部。兼取化地部。根本一分之义。四现通假实宗。摄说假部。全末经部一分之义。此上四宗唯为小乘。五俗妄真实宗。即说出世部。六诸法但名宗。即一说部。此二通于大小乘。七胜义俱空宗。八应理圆实宗。后二唯大。此论旨趣即第八宗。于深密三时。乃第三时也。言三时者。初四阿含言有。第二时八部<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>言空。第三时即<a href=\"/fojing/jieshenmijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">解深密经</a>空有双彰中道教也</p><p>何等一切法云何为无我问有五种。谓利乐有情问。不解问。愚痴问。试验问。轻触问。此即利乐有情问也</p><p>一切法者略有五种此总标诸法也。称理言之实有无量。以<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>性欲无量。是以瑜伽始五识身。历至法界六百六十等法。今言五位百法。岂非要略乎。故云略有五种。自此至真如无为总答初问</p><p>一者心法二者心所有法三者色法四者心不相应行法五者无为法心法者。总有六义。一集起名心。唯属第八。集诸种子起现行故。二积集名心。属前七。转识能熏。积集诸法种故。或集起属前七。转现行共集熏起种故。或积集名心。属于第八含藏。积集诸法种故。三缘虑名心。俱能缘虑自分境故。四或名为识了别义故。五或名为意等无间故。六或第八名心。第七名意。前六名识斯皆心分也。言心所有法者。具三义故。一恒依心起。二与心相应。三系属于心具。此三义名为心所故。要心为依方得起故。触等恒与心相应故。既云与心相应。盖心不与心自相应故。心非心所故。他性相应非<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。相应之义有四。谓时依所缘及事皆同。乃相应也。触等看与何心生时。便属彼心之触等。故如次为三义也。色法者。识之所依所缘。乃五根五境质碍之色。亦名有对色。以能所造八法而成。乃十有色也。无对色即法处色也。言不相应行法者。行蕴有二。一相应行。即心所法。二不相应行。即始自得终至不和合性。二十四法是也。言无为法者。即不生不灭无去无来非彼非此。绝得绝失简异有为无造作故。名曰无为也</p><p>一者最胜故二与此相应故三所现影故四分位差别故五所显示故言初心法八种造善造恶。五趣轮转乃至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。皆此心也。有为法中此最胜故。所以先言。言与此相应故者。谓此心所与其心王常相应故。望于心王此即为劣。先胜后劣。所以次明所现影故者。即前色法。谓此色法不能自起。要藉前二所变现故。自证虽变不能亲缘故置影言简。其见分亦自证变则非是影。或与自证通为本质故。或简受所引色非识变影。第六缘时以彼为质。质从影摄。前二能变此为所变。先能后所故。次言之。分位差别者。言此不相应行不能自起。藉前三位差别。假立前三是实此一为假。所以第四明之。言所显示者。此第五无为之法。乃有六种。谓此无为体性甚深。若不约事以明无由彰显故。藉前四断染成净之所显。示前四有为此即无为。先有后无。所以最后明也</p><p>如是次第此结答也。由上如是胜劣能所实假有无故。云如是次第。此略结上文。总标五位章门。下乃备列百法名数也</p><p>第一心法略有八种此总标下别列</p><p>一眼识二耳识三鼻识四舌识五身识六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>随根立名。具五义故。谓依发属助。如除根发之识。余四皆依根之识等。依主也。根发依士也。虽六识身皆依意转。此随不共意识名依发等。故五识<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>滥矣。盖兼未<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>位言之尔。或唯依意故名意识。辨识得名心意非例</p><p>七末那识华言意识。如藏识名识即意故。第六意识如眼识名识异意故。然诸圣教恐此滥彼故。于第七但立意名。又以简心之与识。以积集了别劣余识故。或欲显此与彼意识为近所依故。但立意名尔</p><p>八阿赖耶识华言藏识。能含藏诸种故。又具三藏义故。谓能藏所藏执藏也。与杂染互为缘故。有情执为自内我故。由斯三义。而得藏名。藏即识也</p><p>第二心所有法略有五十一种分为六位一遍行有五二别境有五三善有十一四<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>有六五随烦恼有二十六不定有四此举总数以标列章门。下乃随章列名。言遍<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。遍四一切心得行故。谓三性<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>九地一切时俱能遍故。言别境者。别别缘境而得生故。所缘之境则有四。乃所乐之境。决定境。曾习境。所观境。各缘不同故云别境。解现下文。言善十一者。唯<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>中可得生故。此世他世俱顺益故。性离愆秽胜过恶故。言烦恼者。性是根本烦恼摄故。又能生随惑名为根本烦扰也。恼乱也。扰乱有情恒处<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>也。言随烦恼者。随他根本烦恼分位差别等流性故。此亦见下文言不定者。由不同前五位心所。于善染等皆不定故。非如触等定遍心故。非如欲等定遍地故。不立定名也</p><p>一遍行五者此别标下列名</p><p>一作意二触三受四想五思言作意者。谓警觉应起心种为性。引心令趣自境为业。触者。令心心所触境为性想受思等。所依为业。受者。领纳顺违俱非境相为性。起欲为业。能起合离非二欲故。亦云令心等起欢戚舍相(此解词异意同)想则于境取相为性。施设种种名言为业。谓安立自境分齐故。方能随起种种名言。思则于境取相为性。于善品等役心为业。为能取境正因等相。驱役自心能造善等</p><p>二别境五者此别标下列名</p><p>一欲二胜解三念四三么地五慧言欲者。于所乐境希望为性。勤依为业。胜解者。于决定境印持为性。不可引转为业。谓邪正等教理证力于所取境。审决印持由此异缘。不能引转故。若犹豫境胜解全无。胜即是解。念者。于曾习境令心明记不忘为性。定依为业。谓数忆持曾所受境。而不忘失。能引定故。三么地者。此云等持。于所观境令心专注不散为性。智依为业。谓得失俱非境中。由定令心专注不散。依斯便有决定智。生心专注言显。所欲住即便能住。非唯一境。不尔见道历观。诸谛前后境别。应无等持也。言慧者。于所观境拣择为性断疑为业。谓观得失俱非境中。由慧推求得决定故。上言解现下文者。义在此尔(欲益得。其详请阅成<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>第五卷)</p><p>三善十一者此标章下别列</p><p>一信二<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>三惭四愧五无贪六无嗔七无痴八轻安九不放逸十行舍十一不害言信者。于实德能深忍乐欲心净为性。对治不信乐善为业。谓于诸法实事理中。深信忍故。于<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>真净德中。深信乐故。于一切世出世善深信有力。能得能成起希望故。此三种信也。言心净为性者。谓此性澄清能净心等。如水清珠能清浊水。故云心净为性也。言精进者。于<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>品修断事中。勇捍为性。对治<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>满善为业。谓善品修恶品断。勇表胜进。简诸染法捍表精纯。简净无记。又云。勇而无怯捍而无惧。言满善者。圆了善事名为满善。故<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>为作善。此名满善。能满彼故。或曰。唯识论言精进一法在三根后。百法则信后即言何耶。曰唯识乃立依次第。此乃因依次第。盖信为欲依欲为勤依故。此信后而便言勤。勤即精进也。但勤通三性。进唯善性摄也。立依者。谓根依精进立舍等三所依。四法立理须合说故。三根后方说。精进言惭者。依自法力崇重贤善为性。对治无惭止息恶行为业。自法力者。自谓自身。法谓教法。言我如是身解如是法。敢作诸恶耶。言愧者。依<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>力轻拒暴恶为性。对治无愧止息恶行为业。世人讥呵名世间力。轻有恶者而不亲。拒恶法业而不作也。言无贪者。于有有具无著为性。对治贪著作善为业。言有有具者。上一有字即三有之果。有具即三有之因。言无嗔者。于苦苦具无恚为性。对治嗔恚作善为业。言苦苦具者。苦谓三苦。苦具者苦因。无痴者。于诸事理明解为性。对治愚痴作善为业。言轻安者。远离粗重调畅身心。堪任为性。对治昏沉转依为业。离重名轻。调畅身心名安。谓此伏除能障定法。令所依止转安适故。言堪任者。有所堪可有所任受。言转依者。令所依身心去粗重得安隐故。言不放逸者。精进三根。于所修断防修为性。对治放逸成满一切世出世善事为业。防修者。于所断恶防令不起。于所修善法修令增长。言精进三根者。此不放逸即四法防修功能。非别有体。或云信等。亦有防修功能。何不依立。曰余六比四势用微劣故。不依立偏。何微劣非善根故。非遍策故。言行舍者。精进三根。令心平等正直无功用住为性。对治掉举静住为业。言行舍者。乃行蕴中舍简受蕴舍故。言令心平等等者。由舍令心离昏掉时。初心平等。次心正直。后无功用。此初中后差别之位也。此亦即四法者。离彼四法无别相用矣。何知无别。曰若能令静即是四法。若所令静即心等故。或曰既即四法。何须别立。曰若不别立隐此能故。言不害者。于诸有情不为损恼。无嗔为性。能对治害悲愍为业。谓即无嗔于有情所不为损恼。假名不害。无嗔翻对断物命。嗔不害但违损恼物害。无嗔与乐不害拔苦。此二粗相差别理实无嗔。实有自体不害依彼。一分假立为显慈悲。二相别故。利乐有情彼二胜故</p><p>四烦恼六者此别标章下别列名</p><p>一贪二嗔三慢四无明五疑六不<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>言贪者。于有有具染着为性。能障无贪生苦为业。生苦者。谓由爱力取蕴生故。嗔者。于苦苦具憎恚为性。能障无嗔不安恶行所依为业。不安者。心怀憎恚多住苦故。所以不安。慢者。恃己于他高举为性。能障不慢生苦为业。生苦者。谓若有慢。于德有德心不谦下。由此死生轮转无穷受诸苦故。无明者。于诸理事迷暗为性。能障无痴一切杂染所依为业。杂染所依者。由无明起痴邪定。贪等烦恼随烦恼业。能招后生杂染法故。疑者。于诸谛理犹豫为性。能障不疑善品为业。障善品者。以犹豫故善不生也。恶见者。于诸谛理颠倒推度染慧为性。能障善见招苦为业。盖恶见者多受苦故。此见有五。谓身边邪见取戒禁取也。此六即俱生。若开恶见成十。即分别惑也。又十惑中嗔唯不善。余九皆通有覆不善</p><p>大乘百法明门论解卷上</p><p>大乘百法明门论解 卷下</p><p>天亲菩萨造</p><p>唐三藏法师玄奘奉诏译</p><p>唐慈恩法师窥基注解</p><p>明鲁庵法师普泰增修</p><p>五随烦恼二十此别标章下别列名</p><p>一忿二恨三恼四覆五诳六谄七憍八害九嫉十悭十一无惭十二无愧十三不信十四懈怠十五放逸十六昏沉十七掉举十八失念十九不正知二十散乱言忿者。依对现前不<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>境愤发为性。能障不忿执仗为业。执仗者。仗谓器仗。怀忿恨者。多发暴恶身表业故。嗔一分摄。恨者。由忿为先怀恶不舍结冤为性。能障不恨热恼为业。热恼者。结恨者。不能含忍。恒热恼故。恼者。忿恨为先。追触暴恶恨戾为性。能障不恼蛆螫为业。言追触等义。谓追往恶触现违缘心。便恨戾多发嚣暴。凶鄙粗言蛆螫他故。此亦嗔分也。覆者。于自作罪恐失利誉。隐藏为性。能障不覆悔恼为业。言悔恼者。覆罪则后必悔恼不安隐故。贪痴二分。若不惧当苦。覆罪者。痴一分摄。若恐失利誉覆罪者。贪一分摄。言诳者。为护利誉矫现有德。诡诈为性。能障不诳邪命为业。言矫现等。谓矫诳者心怀异谋。多现不实邪命事故。此贪痴分也。谄者。谓罔他故。矫设异仪谄曲为性。能障不谄教诲为业。言罔他等义者。谄曲者为罔[冒-目+月]他故。曲顺时宜矫设方便。以取他意。或藏己失。不任师友正教诲。故亦贪痴分也。矫者。于自盛事深生染着醉傲为性。能障不憍染依为业。言染依义者。憍醉则生长一切杂染法故。此贪分也。不憍者。即无贪也。害者。于诸有情心无慈悲。损恼为性。能障不害逼恼为业。言逼恼之义有害者。逼恼他故。嗔一分摄。若论害与嗔之别义者。害障不害正障于悲。嗔障无嗔正障于慈。又嗔能断命害。但损他此差别也。言嫉者。殉自名利不耐他荣。妒忌为性。能障不嫉忧戚为业。言忧戚义者。嫉者闻见他劳深怀忧戚不安隐故。亦嗔分为体。言悭者。耽着法财不能惠舍。秘吝为性。能障不悭鄙畜为业。亦贪分也。无惭者。不顾自法轻挋贤善为性。能障于惭生长恶行为业。言不顾者。谓于自法无所顾者。轻挋贤善不耻过恶。能障碍惭生长恶行故。无愧者。不顾世间崇重暴恶为性。能障碍愧生长恶行为业。言不顾世间等义者。谓于世间无所顾者。崇重暴恶不耻过非。能障于愧生长恶行故。言不信者。于实德能不忍乐欲心秽为性。能障净心。堕依为业。言堕依者。不信之者多懈怠故。言懈怠者。于善恶品修断事中。懒惰为性。能障精进增染为业。言增染者。以懈怠者滋长染故言放逸者。于染净品不能防修。纵荡为性。障不放逸增恶损善所依为业。此放逸以何为体。曰懈怠三根。不能防修染净等法。总名放逸。离上四法别无体性。或曰。彼慢疑等亦有此能何不依立。曰慢等方四势用微劣故。不依立此之四法。偏何胜余慢等。曰障三善根障遍策故。余无此能。所以不胜。言惛沈者。令心于境无堪任为性。能障轻安毗钵舍那为业。或曰。惛沈与痴何别。曰痴于境迷暗为性。正障无痴而非瞢董。惛沈于境瞢董为相。正障轻安而非迷暗故二不同。言掉举者。令心于境不寂静为性。能障行舍奢么他为业。失念者。于诸所缘不能明记为性。能障<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>散乱所依为业。言散乱所依者。失念则心散乱故。此失念者。有云。念一分摄。是烦恼相应念故。有云。痴一分摄。瑜伽说此是痴分故。痴令失念故名失念。有云。俱一分摄。由前二文影略说故。不正知者。于所观境谬解为性。能障正知毁犯为业。毁犯业者不正知者多毁犯故。此法或云慧一分摄。是烦恼相应慧故。或云痴一分摄。瑜伽说此是痴分故。令知不正名不正知。有云。俱一分摄。由前二文影略说故。散乱者。令心流荡为性。能障正定恶慧所依为业。言恶慧所依者。谓散乱者发恶慧故。或曰。散乱掉举何别。曰散乱令心易缘掉举令心易解。是所别相。前云随其烦恼分位差别。等流性故者义现此尔。盖忿恨等十并失念。不正知放逸。此十三法乃根本家差别分位也。若无惭无愧掉举惛沈散乱不信懈怠。此之七法乃根本家等流性故或云。此七既别有体。何名等流。曰根本为因。此方生故名等流也</p><p>六不定四者此别标下列名</p><p>一睡眠二恶作三寻四伺睡眠者。令身不自在昧略为性。障观为业(即毗钵舍那)谓睡眠位身不自在。心极暗劣不门转故昧。简在定略别窹时令显。睡眠非无体用。有<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>位假立此名。如余盖缠心相应故。言恶作者。恶所作业追悔为性。障止为业(即奢么他)此即于果假立因名。先恶所作业后方追悔故。悔先不作亦恶作摄。如追悔言我先不作。如是事业是我恶作。言有义此二各别有体。与余心所行相别故。随痴相说名世俗有。言寻伺者。寻谓寻求。令心匆遽。于意言境粗转为性。伺谓伺察。令心匆遽。于意言境细转为性。二法业用俱以安不安住身心分位。所依为业。谓意言境者。意所取境多依名言。名意言境。或曰。寻伺二法身假为实。曰并用思之与慧各一分为体。若令心安即是思分。令心不安即是慧分。盖思者徐而细故。慧则急而粗故。是知令安则用思无慧。不安则用慧无思。若通照大师释有兼正。若正用思则急慧随思。能令心安。若正用慧则徐思随慧。亦令不安。是其并用也</p><p>第三色法略有十一种言色者。有质碍之色。有颜色之色。所依之根唯五。所缘之境则六。即二所现影。此别标章下别列名</p><p>一眼二耳三鼻四舌五身六色七声八香九味十触十一法处所摄色言一眼者。照瞩之义。梵云斫刍。此翻行尽。眼能行尽诸色境故。是名行尽。翻为眼者。体用相当。依唐言也。二耳者。能闻之义。梵云莎噜多罗戍缕多。此翻能闻。声数数闻此声至。可能闻处。翻为耳者。体用相当。依唐言也。三鼻者。能嗅之义。梵云伽罗尼羯罗拏。此云能嗅。嗅香臭故。数数由此能嗅香臭故。翻为鼻者。体用兼之。依唐言也。四舌者。能尝义。梵云舐若时吃缚。此云能尝。瑜伽论云。能除饥渴数发言论。表彰呼召谓之舌也。通于胜义世俗二义。翻为舌者。亦兼体用。依唐言也。五身者。积聚依止二义名身。谓积聚大造诸根依止。梵云迦邪。此翻为积聚。身根为彼多法依止。诸根所随周遍积聚故名为身。翻为身者。体义相当。依唐言也。体即是根。此五言根者。皆有出生增上义故。则以能造所造八法为体。乃识所依之根也。言六色者。眼所取故。二十五种谓青黄赤白(此四实)长短方圆。粗细高低(此相状假)正不正光影明暗。烟尘云雾。逈色表色。空一显色(此分位假)此皆方处示现义。颜色之色也。对眼识故。质碍名色。乃色之总名。尔言七声者。四大种所造耳根所取义故。总有五因。摄十二种声。五因者。一相故即耳根所取义。此一为总。余四为别。二损益故者。立初三种声。云可意声(是益)不可意声(是损)俱相违声(通二)三因差别故者。摄次三种。谓因执受大种声(语等)因不执受大种声(树等声)因俱大种声(手鼓等声)四说差别摄三者。有世所共成声。谓世俗语所摄成。所引声者。谓诸圣所说。遍计所执声者。外道所说。五言差别摄三者。圣言量所摄声。即八种圣语圣正也。此八种语不出见闻觉知。该于六根。以鼻舌身皆觉故。如应答于人第一见则言见。乃至第四知则言知。若不见言不见。乃至第八不知言不知。斯圣语矣。若第一见言不见不见言见。乃至第八不知言知。此亦八种非圣言矣。华严钞唯十一种。以唯识加响。以成十二。更俟参考。言八香者。乃鼻之所取可嗅义。故总有六种。谓好香恶香平等香俱生香和合香变易香也。九味者。舌之所取。可尝义。故有十二种。谓苦酸甘辛醎淡可意。不可意俱相违俱生和合变异也。言十触者。身之所取。可触之义。故名为触。有二十六种。谓地水火风轻重涩滑缓急冷暖硬软饥渴饱力劣闷痒粘老病死瘦是也。初四乃实。余皆依四大假立。或曰。余既是假。身识何缘。曰即实缘故。既即实缘。何知轻等五俱意识分别之也。言法处所摄色者。谓过去无体之法。可缘之义。此有五种。谓极逈色。依假想观析。所碍色至极微故。名极逈色。又云。上见<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>青黄等色。乃是显色。若下望之则此显色至远。而为难见故。名极逈色也。言极略色者。亦假想观析。须弥俱碍之色。至极微处故。又云。于色上分析长短形相粗细。以至极微故。言俱碍者。乃根色等明暗等色。乃所碍也。定果色谓<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>定。亦鱼米肉山威仪身等。亦名定自在。所生色定即<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>自在。所生色。谓菩萨入定所现光明。及见一切色像境界。如入火光定。则有火光发现等。受所引色者。谓律不<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。殊胜思种所立无表色也。又受即领受。引即引取。如受诸戒品。戒是色法所受之戒。即受所引色也。遍计所执色者。谓<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>虚妄计度。所变根尘无实作用故立此名。或谓余四名色有可拟议。受之所引何亦名色。盖从所防发善恶之色。以立名尔。此四全一。少分是假。一分乃实</p><p>第四心不相应行法略有二十四种此乃色心分位。盖依前三法一分一位假立。得等之名。以行法有二。此简非心所以立其名。此总标章下。乃别列</p><p>一得二命根三众同分四异生性五无想定六灭尽定七无想报八名身九句身十文身十一生十二住十三老十四<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>十五<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>十六定异十七相应十八势速十九次第二十时二十一方二十二数二十三和合性二十四不和合性言得者。包获成就不失之义。乃色心生起未灭坏来。此不失之相也。命根者。依业所引第八种上连持色心不断。功能假立命根耳。众同分者。类相似故。有人法之别。人同分者。如天同分人同分法同分者。如心同分色同分等。三乘五性依人法类。假立此名。异生性者。<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>种上一分功能。令趣类差别不同。云异生性也。无想定者。想等不行令身安和故。亦名定。或云。此定想等心聚悉皆不行。而云无想者。想灭为首。谓此外道厌想如病。忻求无想以为微妙。立此定名。灭尽定者。令不恒行心心所灭(六识)及染第七恒行心聚。皆悉灭尽。乃此定相。盖修无想则作出离想而灭尽。乃作止息想。又无想唯凡灭尽。唯圣乃二定之差别也。大抵于厌心种上。遮碍转识不生功能。立此二定也。言无想报者。由欲界修彼定故。感彼天果名无想报。乃无想之报(依士释也)名身者。能诠自性单名也。二名已上方名名身。三名已上名多名身。乃诠别名之身。句身者。一句名句。二句名身。三句已上名多句身。单句诠差别多句。则诠别句之身。文身者。文即是字。能为名句。二所依故。如单言斫单言刍。未有诠表名之为字。论不言名与多名。举中以摄广略也。又云。带诠名文。如经书字不带诠者。只名字。若字母及等韵类是也。生者。先无今有。住者。有位暂停。老则住别前后。亦云衰变名老。又云。法非凝然。言无常者。今有后无。死之异名。又诸圣教多合生灭。以为无常。盖生名为有。有非恒有。不如无为灭名为无无。非恒无不如兔角。不同彼无为兔角之常。故曰无常。今唯据死而言流转者。<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>不断相续前后。定异者。善恶因果互相差别。相应者。因果事业和合而起。或曰。此之总名不相应行法。今名相应者何耶。盖名不相应者。简前相应心所而已。此相应者。乃前三法上事业和合之谓。岂相滥乎。势速者。有为法游行迅疾飞行运[這-言+奔]。皆此所摄。次第者。编列有叙令不紊乱。尊卑上下左右前后。有规矩者。皆此摄也。时者。过现未来成住坏空。四季三际年月日夜。六时十二随方制立。故名为时。方者。色处分齐人法所依。或十方上下六合四极。亦随所制。数者。度量诸法之名。或一十百千至不可转也。言和合性者。谓于诸法不相乖反。不和合性者。谓于诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>乖反故。前如相顺因。此如相违因。或曰。此二十四于前三分位。则以何法当前何位。大略而言命根一法。<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>分位第八心种上连持功能故异生性。一唯所分位二障种上令别功能故。二无心定无想异熟。乃王所上假王所灭。已名无想等。余十九种通色及心与心所法。三上假立如众同分乃色。同分心同分所同分。又如势速乃是色心心所迁灭不停。故又如定异色。不是心心。不是所善因恶果定。不互感等。余仿此说</p><p>第五无为法者略有六种此标章下别列</p><p>一虚空无为二择灭无为三非择灭无为四不动灭无为五想受灭无为六真如无为言无为者。是前四位真实之性。故云识实性也。以六位心所则识之相应。十一色法乃识之所缘不相应行即识之分位。识是其体。是故总云识实性也。而有六种。谓之无为者。为作也。以前九十四种乃生灭之法。皆有造作故属有为。今此六法寂寞冲虚湛然<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。无所造作故曰无为。言虚空无为者。谓于<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>离诸障碍。犹如虚空豁虚离碍。从喻得名。下五无为义仿此说。择灭者。择谓拣择。灭谓断灭。由无漏智断诸障染。所显真理立斯名焉。非择灭者。一真法界本性清净。不由择力断灭所显。或有为法缘阙不生。所显真理以上二义故立。此名不动者。以第四禅离前三定。出于三灾八患。无喜乐等动摇身心所显真理。此从能显彰名。故曰不动想受灭者。无所有处想受不行所显真理。立此名尔。真如者。理非妄倒故名真如。真简于妄。如简于倒。遍计依他如次应知。又曰。真如者。显实常义。真即是如。如即无为。上自一切法下至此。乃明百法。以答初何等一切法之问毕矣。此下大分明二无我。以答次问也</p><p>言无我者略有二种此标章下别列</p><p>一补特伽罗无我梵言补特伽罗。唐言数取趣。谓诸有情数数起惑造业。即为能取(因也)当来五趣。名为所取(果也)虽复数数起惑造业。五趣轮转都无主宰。实自在用。故言无我。乃补特伽罗。即无我矣。此所无即我是为我空也。彼凡夫等皆执心外实有诸法。又执此法有实主宰。此说为无无。即彼空无别体也</p><p>二法无我言法者。轨持之义。谓诸法体。虽复任持轨生物解。亦无胜性。实自在用故。言法无我。法即无我应云法无法。从能依说。故云法无我。瑜伽九十三云。复次一切无我无有差别。总名为空。谓补特伽罗无我及法无我。补特伽罗无我者。离一切缘生行外别有实。我不可得故。法无我者。谓一切缘生诸行性非实我。是无常故。如是二种略摄为一(双证二无我理)彼处(指毗昙)说此名为大空。又云。我之执者心得境名。又云。二执者我狭法宽。盖人有迷人必迷法者。迷法未必迷人故。能持自体者为法。有常一用者为人。如二乘<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>已断。法执犹存。则其浅深宽狭可见矣。盖我法者。不出世间及圣教二种我法。谓世间人执我法无体随情名世间假。圣教我法者。有体强设名之为假故。二皆为假故。无我法也</p><p>大乘百法明门论解卷下修补大乘百法明门论后序</p><p>百法者。散于群经。具于瑜伽论。至世亲师始出之以成论。乃逗机之教也。盖教为机设机之色心优劣。暨年数之赊促不齐。致使圣贤施教广略有异。而大旨无殊焉。然而瑜伽总百轴。而于初三轴。翻覆展演。六百六十余法。奚翅二万言。而此论仅一纸。言不满五百。而该括无遗。则词甚简而义愈备。文不华而理愈精。至于入道之门修断之序。染净理事之交陈。则充然大备。于斯非具四无碍辩大总持门者。其能与于是乎。嗟夫。大贤悯物心切。务使人易知易从。而吾人为法者。固不可不知也。至于森然而诸法章。泯然而二我尽。则三乘圣贤之位可阶矣。逗机之教。岂加于是哉。或曰。圣凡天渊。恐不易致。若子之言。不几于大而无返乎。曰予以圣贤之语。原圣贤之道为言耳。圣贤之道。由性而行之者也。圣贤乃尽夫性。凡愚乃具夫性。究尽具之分虽殊。而察尽具之性无异。性既均而不以道。责己责人者。彼己皆欺也。欺己之罪小。欺人之罪大。欺人之罪。又不若欺后多人之罪为尤大。后之人视前人。苟简为说铃。而展转相袭。是使后人复欺后人也。若是则圣贤二利之道而不化。为名言章句者几希。呜呼。予宁[冒-目+月]大言之罪。而避欺人之罪。欲其无罪又何逃乎。按此论注。脱略讹谬大甚。兹略为补正。自备观览。适信官张君杰见而请置诸木。予嘉其笃于乐善。故从而书于纸尾也</p><p>正德辛未岁正月既望普泰书于飞虹官舍</p></div>"
}]