[{
    "title": "梵网经古迹记 第1815部",
    "author": "太贤法师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>梵网经古迹记 卷上</p><p>青丘<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>太贤集</p><p>将释此经七门分别。时处故。机根故。藏摄故。翻译故。宗趣故。题名故。本文故。言时处者。本即卢舍那佛在莲华台藏世界说。末即释迦初<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>时于摩伽陀国寂灭道场说。言机根者。有菩萨性得<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>者。为谤不信不得说故。藏摄故者。通菩萨藏毗奈耶摄。翻译故者。后秦有西域<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>鸠摩罗什。此云童寿。持<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>偏诵此品。与义学沙门三千余人。遂于逍遥园及长安草堂寺翻译经论五十余部。最后因秦主欲受禁戒。别诵译出。慧融等笔受。法藏师云。西域有十万颂六十一品。具译成三百余卷。此经序云。可有一百二十卷。又上代诸德相传云。<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>三藏将菩萨<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>拟来此。时于南海上船。船即欲没。省去余物仍犹不起。唯去律本船方得进。真谛叹曰。菩萨<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>汉地<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。深可悲矣。又昙无谶三藏于西凉州。有沙门法进等。求谶受菩萨戒并请戒本。谶曰。此国人粗。岂有堪为<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>器。遂不与授。进等苦请不获所愿。于佛像前立誓求戒。七日才满梦见。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>亲与授戒并<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>本。并皆诵得。觉已见谶。谶睹其相异喟然叹曰。汉地亦有人矣。则与译出戒本。与进梦诵文义相同。今别行地持戒本首安归敬偈者是。又闻西域诸小乘寺以宾头卢为上座。诸大乘寺以文殊师利为上座。合众共持菩萨戒。羯磨说戒皆作菩萨<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。菩萨律藏常诵不绝。言宗趣者。语之所表曰宗。宗之所归曰趣。此经正以心行为宗。证觉利生以为其趣。言心<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>略有二门。一教正行门。二诫恶行门。教正行者。即经初说三贤十圣内证之行。诫恶行者。即经后说十重四十八轻戒行。经自广说如后应知。所归趣者亦有二门。一如来性门。二发趣相门。所趣能趣如次应知。如来性者即真如性。如经寂灭者名为一心。一心者名如来藏。谓<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心似生无生之性寥为一心之海。似生之相流成<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之波。如不增不减经云。即此法身飘流<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>名为众生。即此法身<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>诸度名为菩萨。即也法身住于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>名为诸佛。此复云何。生死之梦唯有迷心。虚妄习气扰浊心故。或似眼等或似色等。犹如翳眼所见空华。天地山河虽无边际。如梦所见莫据之方。色等境风之所击动。藏识海中转识浪起涌于六处分别六尘。然色声等唯如梦尘。除心行相都无所得。境既即心。心如境空也。迷故生死。悟故<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。是以空性名如来藏。第二发趣门者。如是内有如来性。故闻诸有情同如来藏<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>所飘苦轮无际。生死大海誓为舟楫。不畏其中所受大苦。发不可坏无碍意乐。谓大<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>若可得法。我亦丈夫。三大阿僧企耶虽绝。期之者要可出之。无上正等菩提虽远。誓之者定有至也。盖决无明之[谷-禾+卵]掌融法界之雄。亲近善士。听闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>为母。方便为父。广摄众生为自眷属。空寂为家法喜为妇。慈心为女。至诚为男。虽在居家不着三有。虽现受欲<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>梵行。游于衢路利物为心。欲成他义能舍自命。诣讲论处导以大乘。入诸学堂诱开童朦。风前交友必简其师。月下忘怀影中味道。草系之功自有风云。交游美色亦知其空。大悲<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>之所辅翼。乘不住道至心实际。但于诸心返照<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。明昧位立佛菩萨故。云何名为不住道耶。于空有边不住慧也。谓颠倒缘有<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>相。既颠倒有即离有无。如圣天言。有非真有。故无亦非真无。谓于妄识似有而现。即于证智似无所得。然于胜义非毕竟无。诸胜义无俗亦无故。既离有性。般若证空亦离无性。大悲拔有。拔有之故不住涅槃。证空之故不住生死。不住二边异凡二乘。异凡小故自发菩提。如瑜伽云。于空性相有失坏者。便为失坏一切大乘。是以菩萨行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>时皆无所得以为方便。无所得者即不住道。若唯空有便可得无。而复空空故无所得。无所得故三轮清净。是名究竟修菩萨行。言题名者。梵网经一部都名也。卢舍那佛说心地法门品第十者此品别名也。梵者能净之义。网者摄有情义。谓此经者乃至有顶生死大海拘持有情。终致无上寂灭之岸。无尽<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>诸饥渴类。如世网故。为显此义故。诸梵王持罗网幢供佛听法。佛因此说世界差别犹如网孔。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>门亦如是。世界别者。须弥树形覆世界等遍涉入故。佛教门者。虽一味法蕴界处等法门别故。是则如梵主网孔多网一。法王戒法当知亦尔。虽尘沙门终归一道。万行一门所谓得意。得意而行皆称法性。是故从喻名梵网经。经谓契经。贯持为义。贯义持生不散失故。卢舍那者此云净满。无障不净无德不圆故。法藏师云。梵本皆名毗卢舍那。此云光明遍照。智照法界身应大机故。梵网字下标此名者。为简余品释迦说故。佛谓觉者。三义如常。说谓圆音。巧应生解。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>万德从此生长名为心也。出苦之津入净之户称之法门。文义类别故名为品。此心地品总有二门。一本师说故。二化传说故。初中有五。处众故。警觉故。启问故。见问故。付属故</p><p>经。尔时至心地法品</p><p>述曰。处众之中有三。处所故。大众故。所说故。如文可解</p><p>经。是时释迦至亦生疑念</p><p>述曰。第二警觉中亦有三。放光故。众喜故。疑念故。如文可知</p><p>经。尔时众中至为何等相</p><p>述曰。第三启问亦有三文。起定故。集众故。启问故。玄通华光王者。所证真理名玄。能证真智曰通。能生大果名华。能除闇障名光。三乘中胜名王。彼所起定华光亦尔。众德<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>名大庄严。金刚白云色者。以不可坏无漏清白含众德水故标此色。光明非一故言光光。为何等相者。问所为相</p><p>经。是时释迦至光明座上</p><p>述曰。第四见问中有二。见故问故。此初也。化归本体言还至也。加力见胜如戒本疏。百万亿紫金刚光明宫者。如兜率天弥勒菩萨五百亿宫也。百万莲华者。座莲华也</p><p>经。时释迦至菩萨种子</p><p>述曰。第二问中有二。问故答故。此初也。有云三问。地者问有为行。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>者问无为中行。众生者备上二行众生也。非也。据所居处问彼<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>故。菩萨种子余品广问故今不问(旧疏云。六处殊胜名为种子。如地持说)</p><p>经。尔时至卢舍那佛</p><p>述曰。第二答中有二。果故因故。此答果也。大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>者。见大利故。无分别智名虚空光。照法性空故。正了因体亦名体性。智为正因故。彼所依定名为本原。此能显成常住法身也。佛现此定示大众也。根本因故修行心地以之为因。舍凡夫等举因答果也。成等正觉已下显成佛相也。显正依报及化相故。世界海者。如智论云。数此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>如恒河沙为一世界种。数此种复至恒沙为一世界海。数此海复至十万恒沙为一佛世界。虽在千叶中央台上。而言在于世界海者。如<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>在一阎浮州言在娑婆为一佛土。二身游化量亦尔故。千百亿释迦身土如戒本记释</p><p>经。尔时莲华至智身满足</p><p>述曰。第二答因中有二。略故广故。此初也。疏云。坚信忍者。明习种性解德法门。亦名闻慧。坚法忍中明性种性行德法门。亦名思慧。坚修忍中明道种性行实法门。亦名<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。坚圣忍中明圣种性亲证法门。名出世慧。此中三贤十圣四十后次第解故不释之。蹬者登也。言无为者。非<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>业之所为故。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>者法身故。大满者智身故。常住者自性无间及相续故</p><p>经。尔时至品中已开</p><p>述曰。第二广中有二。请故答故。此初也。诸佛会中有菩萨问。释名准前。凡此经文难可解者。佛佛相对梵语巧妙。犹如此间五言诗等。以汉语翻。失妙难解</p><p>经。尔时至入空<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a></p><p>述曰。第二答中有四。如次广说四十法门故。初亦有十。此发趣中初舍心也。菩萨请者。千佛所加故。今告言千佛谛听。知千佛众未解了故。舍心三文。章门故行相故结成故。言一切舍者。举章门也。次行相中谓国土等。一切舍之。无为无相者。标舍所舍之时离三轮也。无为者人空故。无相者法空故。次释三轮。初施者空。谓即我人知者见者<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>假会合成。故能执彼主者造作之我见者于彼所缘十二<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>无合无散。于境<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>故言无合。而有似我亦言无散。次受者空。谓无受者。以蕴界处一合空相无我我所相故。后施物空。假成诸法若内身等若外财等一切之法空。无自之所舍无彼受故。第三结言。尔时观成如境假会。能观现前</p><p>经。若<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>至一道清净</p><p>述曰。第二戒心。戒者举章。非非戒者。离有无边重言非非。何者。无受者故。及十善戒无师<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。谓无能说宁有所说。受者授者及所受戒不可得故三轮空也。欺盗乃至邪见无集受者。明所防恶体空无集。还属众缘。无定性故。欺者蔑也。蔑中之极谓害命故。慈良等者。明能防戒体性亦空。一慈防杀也。二良防盗也。三清防淫也。四直防妄也。五正防酤酒。六实防赞毁。七<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>防邪见。八舍防悭也。九喜防嗔也。旧疏云。等言等取悲防说过。防十恶时。制止有为无为八倒。有无性离一味清净也</p><p>经。若佛子至不可得</p><p>述曰。第三忍心。忍者举章。有无相慧体性者。总标真俗忍体。次辨行相差别。言空空忍者。缘胜义忍。下此名为无生行忍。一切处忍者。缘世俗忍。下名此为一切处得名如苦忍。遍一切处如俗苦相而忍解故。得名如苦者。耐怨害等随境目故。如是真俗无量行相一一皆名忍者结也。明真俗已。次明三轮。自空无受。彼空无打。法性空故无刀杖无嗔心。三轮一味言皆如如。事事无实言无一一。谛理无二言谛一相。理亦实空名无无相。而俗非无言有无有相。次能所相对门。非非心等明忍空相。谓能忍心非都无故言非非心相。似有缘虑无实缘故言缘无缘相。立住等者空所忍境。能打人等四威仪中染净性空。故言一切法如。既能所空忍相不可得</p><p>经。若佛子至进分善根</p><p>述曰。第四<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>心。苦四威仪一切时行者。以精进行举章门也。行住等位无时不策故。次明行相。伏空假者。伏初二性。空谓遍计。假谓依他。会法性者。会圆成实。伏初事相会真理故。空智德聚名无生山。见有无者。有相名有。无相名无。如龙树论有为名有无为名无。如有者。世俗似有。如无者。胜义似无。已上总观一切法也。大地青黄赤白一切入者。十遍处也。包胜处<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>等故言乃至。已上别观共<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>门也。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>智性者。大乘功德门也。以具三宝摄一切法故。明境界已。次明功德。以一切信上升进道必三三昧空慧为门。无生者无相。相必生故。从胜义观趣世俗。故言起空入世谛法。了真即俗言亦无二相。第三结言续空心通达进分善根者。所有进道皆空为首。故言续前空心。通达而进善根名进心也</p><p>经。若佛子至生一切善</p><p>述曰。第五定心。寂灭无相者举章门也。寂灭散动照无相故。次行相中无相无量行三昧者。生空定也。唯有诸行无实我故。无相无量心三昧者。法空定也。唯有诸识无实法故。并趣真空总名无相。凡夫<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>无不入三昧者。八<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>也。彼二类定得淳熟故言体性相应。于一切行以<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>故诸障灭也。谓我人受者人执也。一切缚者余烦恼也。见性者。且举法执摄所知障也。皆是障定因缘。散风动心者。不生思惟皆心不寂。而灭空空及以八倒无攀缘也。假静慧观者。学观有情法假定慧。由此定慧一切假会苦谛伏灭。能受<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>罪性集灭。言而生一切善者。道资粮也</p><p>经。若佛子至为慧用故</p><p>述曰。第六慧心中空慧者。举第六度。明行相中非无缘者。标有所依缘也。慧亦无性。依他起故。何为所依。谓能知体名之为心。了别一切法假名主者。心王性故。与道通同者。与慧相应故既住圣胎。当入圣等尽是慧心体性功用也。一切能执四倒烦恼皆由染慧性不明故。故对治之以慧为首。修不可说种种闻慧。以为方便入于中道一真谛也。次明障空。谓其无明能障慧者。离众缘合无自相故言非相。不即缘故非来于缘。既无自性故非罪非八倒无生灭也。由此慧明照而乐空。明真实智已。更智方便转变<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>亦智体性所为。以慧用故</p><p>经。若佛子至一切行本原</p><p>述曰。第七愿心。愿愿大求一切求者举章门也。双求二利故言愿愿。求断名大求。求智名一切求。明行相中。以求远果修行因故愿心连也。必由愿心连相续故百劫得佛即灭罪也。百谓多义。罪即生死。灾患聚故。专注连求法空一相。故言求求至心于无生空一。一者一相。所谓无相。乘愿增观而入定照。则无量见缚以求愿心故得解脱。其能证行以求心成。由此菩提无量功德以愿为本。既成佛已圆证法界离有无边。言观一谛中道也。万德相融能照智分所照法界虽无差别。非如二乘灰身灭智。亦言非没。亲圆证已于后得智起无量用。言生见见。然不谓言我有所作。言非解慧。结文可解</p><p>经。若佛子至观法亦尔</p><p>述曰。第八护心之中。护三宝护一切行功德者举章门也。以护所依及自行故。次明行相。初护外道不令娆正信者护三宝也。以无相行伏倒心故。灭我缚见缚无生等者护自行也。伏烦恼障言灭我缚。伏所知障言见缚无生。以何行相如此护耶。谓护根本三宝以无相行护。护自三空门以心慧连慧连等也。二空相资故言慧连慧连。如是相连入无生者。止道观道则明光明光。以伏<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>无挂碍故。如是护观入于空境。俗假相别。故言分分。似我似法妄识中似有。故言幻化幻化所起。俗相性空。空智中似无故言如无如无。以下结云。缘合所起言法体集。还属众缘言法体散。无定自性言不可护。如所观理能观亦尔</p><p>经。若佛子至一切法</p><p>述曰。第九喜心。见他人得乐常生喜悦者举章门也。及一切下明行相也。假谓依他。空谓遍计。遍伏二相言及一切。二相不现名为照寂。不见初二性言不入有为。真如影现言不无寂然。内证乐中境智俱空。故言大乐无合。般若虽证空大悲犹化物攀缘有境。故言有受而化有法而见也。玄假法性等者。见二谛性平等一观心心中行也。玄者胜义。假者世俗。般若大悲而相融故。多闻一切佛行功德等者。多闻果德及因行德。普以无相<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>之智连生<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>而专照也。既一无生佛即我故。以下结云。乐心缘一切法者。离嫉妒等喜悦缘故</p><p>经。若佛子至光品广说</p><p>述曰。第十顶心。是人最上智者举章门也。次释名义。前九心上三义如顶。一灭障如顶。言我轮者。执我为首。<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>烦恼利见疑身。及以钝品嗔等烦恼皆灭无故。胜如顶也。二智胜如顶。最上智连如顶故。三境胜如顶。周遍法界因果<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>如如一道最如顶故。如人顶者。总喻上三也。次明行相。不同身见六十二见。简二类见。故言非非。五众即<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>也。于蕴<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>刹那生灭。谬执神我体常<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。观识蕴空也。多计识蕴为我相故。无受者观受蕴空。无行可捉缚者观余三蕴空也。行即行蕴。无可捉者色蕴空故。无可缚者想蕴空故。<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>缚本故。如契经云。识如幻化乃至色如聚沫。言入内空直道者。即入内门纯一味道。上明般若。次明大悲。刹那刹那于诸众生不见有缘不见非缘。恒以无缘大悲攀缘住顶三昧寂灭定。亦发加行于趣证道。尔时设有性实我人常见八倒生者。则缘<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。性实见者法执也。我人见者生执也。由此不受八难者三途等也。幻化果毕竟不受者。道分善根不造生死引业故。同体大悲离我无化。故言唯一众生。四威仪中灭恶生善。言入道者总句。余三别句。满十解位名为正人。立福智资粮名正智正行。行即福也。下总结言。菩萨达观现前故不受六<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。必不退于佛种姓中也。以背流转向还灭故。生生入佛家者。十住毗婆沙云。以真如为佛家。相应解成故言入也。十天光品者指上品也</p><p>经。卢舍那至体性三昧</p><p>述曰。第二十长养中牒问可知。此初慈心中。常行慈心生乐因已者举章门也。慈与乐故此无缘慈。慈行既成自亦乐俱入所缘法。谓即五蕴大真法中空蕴三相如幻如化真如无二。故则堪当成圣道法轮。言化被已下教他生信。大悲门故。言非实者。谓所利益<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>空故。非<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>果者。谓所安乐乐果空故。言解空体性三昧者结慈行成也</p><p>经。若佛子至起大悲</p><p>述曰。第二悲心中。以悲空空无相者举章门也。有性空故言空。空亦空故言空无相。次明行相。悲缘行道自灭一切苦者标句也。缘谓攀缘。如下有情缘等三故。如何灭苦。先于众生苦中生智。生何等智。谓有三种。一有情缘。如经不<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>缘故。二法缘悲。如经不杀法缘故。三无缘悲。如经不着我缘故。由此于一切众生不恼也。次明行相。夫发大悲心者于空性中见一切法如实性。若失坏空性则失一切大乘故。种性行中生道智心者。出斯位行也。如仁王云。银轮三天。性种性故。父等六善于我为亲。翻彼六恶于我为恶。彼二各有上中下品。欲与上乐而拔苦之且上品。恶随器各得九品乐者。即观果空欲与上乐。而九品别乐还属器。无自性故。乐果空相慈心中现。以一乐行引起大悲也</p><p>经。若佛子至苦故喜</p><p>述曰。第三喜心中。喜悦无生心时者举章门也。喜心观空名无生心。种性体相道智者位体相也。自他空故名为空空。犹随喜他名为喜心。此有二种。一者性空。不着我及所故。二者法空。达流转无集故。出没即流转义。诸缘所起还属众缘。无一定相。故言无集。尔时一切万有入空即观行成。以同体之喜等喜一切。起此空观入有相道。远邪近正。正谓示我好道。及使众生入<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>家。得法在怀。行体怡悦。故言法中常起欢喜。自入法位复于他入正中随喜也</p><p>经。若佛子至常修其舍</p><p>述曰。第四舍心中。常生舍心者举章门也。无造无相空法中三空门也。如虚空者喻于三空无障碍。行于善等中法空人空为大舍。舍谓治染且显治贪。幻等如次喻虚流转及刹那灭。无生心者舍心空故。虽空恒进言常修舍</p><p>经。若佛子至现前行</p><p>述曰。第五施心中。能以施心被一切众生者举章门也。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>行化者。无执着故。达理达施者。了真俗性。言一切相现在行者。施行成就也</p><p>经。若佛子至发起善根</p><p>述曰。第六爱语心中。入体性爱语三昧者举章门也。体性者真性也。粗语耎语皆趣胜义可爱乐。故名爱语也。实谛之中。法语之义实语之言皆顺纯净一语之门能调一切。乃至无诤发语之智法空无缘而生恩爱之心。下总结言常行如心发起善根者称真心也</p><p>经。若佛子至但益人为利</p><p>述曰。第七利行心也。利益心时者举章门也。实智体性者所缘真如也。广行智道者能缘智慧也。集一切明炎法门者。集智资粮故。集观行七财者。集福资粮故。用之益人言前人得利。时还益己法身慧命。言益受身命。言一切意者。作用多故。皆令他人次第行成也。言法种者习种行成故。空种者性种行成故。道种者道种行成故。皆生<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>故言种也。令他人入此三十心中。次云得益者证地上际行故。得乐果者得佛后际果也。形居六道处苦甘心。下结意者但益他人为己利故</p><p>经。若佛子至同法三昧</p><p>述曰。第八同事心中。以道性智同空无生法者举章门也。谓此位智称空理也。次明行相。生无二者生空真如也。智行相应言同于彼。又法空行同最本原法空如相。世间诸法以恒转故言常生常住常灭。于此流转随入事同。虽了法空同而无生及自他我同而无物。犹为益物入同事三昧</p><p>经。若佛子至而不可得</p><p>述曰。第九定心中。复从定心者举章门也。次明行相。从定发慧念念寂照。离戏论故。于我所法者即所遍计十八界也。此文可言我法所法。谓七心界名为我法。多计识蕴以为我故。十根尘色法处色等名为所法。下出体云识界<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。于此不着言不动转。十禅支者。一寻。二伺。三喜。四乐。五心一境性。六内等净。七舍。八念。九正知。十不苦不乐受。以一念智双观二空。一切我人无合散者。观生空故。内外现种无合散者。观法空故。言众生者诸现行也。无一定性言无合。缘合似有言无散。所以者何。众缘集成之所起作。求彼实性不可得故</p><p>经。若佛子至百法明门</p><p>述曰。第十慧心中。作慧见心者举章门也。缠名为结。随眠名患。众苦本故。言顺忍者境顺智故。慧性起光光者运运照故。一炎明明者一体多用故。见虚无受者缘空不执故。总结云其慧方便者。慧<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>巧故。能生此位十长养心也。是心入空理起空道故。杂修智悲堪发无生圣心之因也</p><p>经。卢舍那至名无相信</p><p>述曰。第三十金刚也。初发心趣。次长养已。今不可坏喻金刚故。此初心中。信者举章门也。诸见名著者训释见义。以执着故。结有造业者招苦造集故。于此必不受方入空无为。言三相无者总标三相寂灭。无无生下别破三相。谓生住灭有能所相。今双空故重言无无。遣能所生言无无生。此文可言。无无生故无生之住。无生住故住所住无。住住无故灭灭亦无。言有一切法空者。存法无我真如也。遮减过故。言尽灭异空者。二谛智泯故言尽灭。犹有分见亦言异空。色空者色阴空也。细心心空者四阴空也。三世心空故。二谛信寂灭无体性和合。还属众缘无一定性。故所属缘亦空。故言亦无依。次总结言然主者我人名用者。举实我体名字功能也。三界假我我者。人法二假我也。无得集相者。实我假我无可得一聚集相故。既人法空名无相信</p><p>经。若佛子至亦如是</p><p>述曰。第二念心中作念者举章门也。六念中常觉者<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>也。乃至摄法僧戒三也。言常施者念施也。观彼实性皆言常也。第一义谛者念天也。佛常涅槃果第一义天故。言空无著无解等者。观所念境空无可缚着。况有解脱耶。既空三相之所不动不到去来。以迹绝故。然于作者一合真相还归本际入法界智。运运增明言慧慧相乘。运运会空言乘乘寂灭。念念泯相言炎炎<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。上古传说。慧慧住相名光光。即彼灭相名无无。后后生相名生生。相虽迁流然性不起。熏修力故。转易空道。变舍前劣转得后胜运运增长。本有劣无故言变变。本无胜有故言转化。展转胜生言化化转转。如是后转前变之时。如称两头同时住也。炎炎一相者。念念虽别而恒一相。所谓无相。生灭一时者。生灭虽异融于一念。次例生灭三世亦如是。已变者过去。未变者未来。变者正变即现在也。三世同时故言变化。亦得一受。受谓容受。一念融故</p><p>经。若佛子至心解脱</p><p>述曰。第三深心中深心者举章门也。即<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>心也。期远深故。第一义空者标句。于遍计空智照有中道。谓十二支非常非断名为实谛。执有情等名为俗谛。于此二谛了二空故重言深深。出入相寂言无去来。结中道言。十二因缘幻化受果故离减边。而无实受故离增边。是故伏障心解脱也</p><p>经。若佛子至不可得</p><p>述曰。第四达心中达照者举章门也。忍顺一切实性者。印顺真俗无倒性也。俗性无缚。真性无解。言无碍者总标也。法达等四别出也。如次法义辞辨无碍。无碍名达。所达三世因果所化众生根行。如如不增不减。体性既空。无实法用无假法用无假名用。既无三用故言用用空。彼体用空亦空。故言空空。如处缘空能照亦空。是名通达一切法空。结智行相云空空如如相不可得</p><p>经。若佛子至而不受</p><p>述曰。第五直心中直者举章门也。行无邪曲故名直心。言直照者释直心名。次出境体。言取缘我境入无生理之智名直心也。由无明力所计神我二空中泯。虽其缘二空理之心在无我有在实我无。然不著有无不失坏空理。空理名为佛道种子。如瑜伽云真如所缘缘种子故。不失坏空名大乘故。相似无漏中道一味观而<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>十方。转一切众生者。转凡向圣也。转众生时皆以萨婆若空直直性也。以趣菩提真空性故。二空正性名直直性。次总结言。直行于空故三界缚而不受也。烦恼根本名为主者</p><p>经。若佛子至一道一照</p><p>述曰。第六不退中不退心者举章门也。唯进无虑名不退心。古师云。凡夫有二。习种已前名外凡夫。地前三十心名内凡夫。今不退入于外凡也。不起新长养诸见者。伏分别惑故。不起习因相似我人者。渐伏俱生故。虽入三界业中流转。而亦行空位不退也。又解脱现行障于第一中道境智合行故行不退也。又于本性空正念不退也。证空生解言空生观智也。如如相续如是。如是乘胜心入于不二。结云。常时于空生心一乘纯净。此为不退一道一照也</p><p>经。若佛子至得度<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a></p><p>述曰。第七大乘心中。独大乘心者举章门也。独谓不共义。次明乘行运载功中。解解一空者。双依二空证一真法界故。法界同故。了三乘行皆一乘也。如是菩萨乘一空智双修福智名智乘行乘也。言乘智者。牒上显运。谓乘者牒上所修福智。智者牒上能修空智。言心心者念念也。刹那刹那任载行者任用自利。任载行者任度众生。言度三界河者度苦也。度结缚河者度惑也。度生灭河者度业也。是故行者坐乘如上任用载用智相应心趣入佛海也。故诸众生未得乘用但名乘所得度之海</p><p>经。若佛子至故无相心</p><p>述曰。第八无相心中。无相心者举章门也。次明行相。谓亡相心照实相般若无二。复于一切烦恼业果。如如一谛亦行无生空。自知成佛。了平等故。佛是我性等者。贤圣是我行同者。结言皆同无生空故无相心</p><p>经。若佛子至入一切法</p><p>述曰。第九慧心中。如如慧者举章门也。次举所缘云。无量法界无集因无受生果。亦非生生烦恼所缚。如知胜义境。世俗一切法门三贤所行道十圣所观法亦如是知。非但所知。外化方便皆集心中。达正方便故。外道邪见功用幻化魔说及与佛说差别之中皆分别也。入二谛处。谛故非一。解故非二。非有阴界入即是慧光之所映夺。然慧光照性即入一切法。以证真时思惟一切法故</p><p>经。若佛子至广说</p><p>述曰。第十不坏心者举章门也。次明行相中。堪入圣智近于分别二障解脱。但得圣道方便正门。于此终心开四善根。明得明增故名明<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。伏忍之中极顺空理。八魔者。一苦二空三无常四无我五生六老七病八死。非此八种之所惑乱。传说如此。应厌生死欣小涅槃退菩提心。立为魔也。明自分行已。次明胜分众圣与力。言诸佛劝发者。佛见此人而发悟故。彼受加已入摩顶定得三业加力。初身加力中自身放光。入佛仪神者。传说习佛威仪行也。次意加力与证地心相似无别。而非实证。<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>智道此真门也。又以定力世俗门中见无量土。后语加力现为说法。尔时顶善所依三昧。登所取空平等地中。摄相归识总持满足。心心行空者。下忍之时印所取空故。言空空慧中道无相照者。初空中忍。顺能取空。后空上忍。印能取空。更无余相言无相照。由此世第一法位中双印二空。故言一切相灭。此无间定永无退还言金刚三昧门。从此入圣于一身中修一切行。故言入一切行门。即入初地虚空平等地也。佛华经者指余经也</p><p>经卢舍那言至毛头许事</p><p>述曰。明十地中牒问可知。此初地中举章门。言平等慧体性地者。平等慧者能证智也。体性者所证真也。地即总也。次行相中。真实法者内证门也。真实化者外化门也。具此二利言一切行。真无漏行正感佛果言华。实破闇种名光。遍证法界言满足。四天果者摄报果也。乘用任化者世俗门化。无方理化者胜义门化。于十力等皆得入者。如瑜伽云。初地已上分得百四十不共佛法故。<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>大愿者。堪住他受用土愿故。一切论者五明论也。一切行者。于彼五明多有所作。坐<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>地者。已入大地故。一切障碍分别起障。凡夫因果恶趣北州无想天等。从一佛土入无量土者。不动一国至诸国故。从一劫入<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>者。于一念中摄三际故。或舒一劫为多劫故。不可说法为可说者。堪说内证甚深法故。摄法归智名反照见一切法。常入二谛等者。游照二谛宅心真故。知十地次第者地位也。一一事示众生者地行也。身心不变者会一味故。十恶者杀生等也。虽知黑品住白品故。一智见有无二相者达三性故。分分了起者别别了知色故。别别生起色故。入受色报者。趣入领受有色报故。即不生无色也。而心无缚者。虽住静虑生欲界等。慧光恒照遍满真故。无生理中信忍空慧常现前也。即五忍之第二初故。其中间一切法门者十度也。略出下结初地大海今略出也</p><p>经。若佛子至体性地</p><p>述曰。第二地中有三。章门故地行故指广故。此初举章。言善慧者离犯戒恶故</p><p>经。清净明达至功德本</p><p>述曰。第二地行中有二。总标故别释故。此初也。清净明达一切善根者。举行体也。谓有三种。一慈与乐为最故。二舍离染之本故。或有经本具四无量。三慧证达之原故。一切功德本者。释上善根名义也</p><p>经。从观入至为苦苦苦</p><p>述曰。别释有三。逆次第释惠舍慈故。初亦有二。观察故化导故。此初也。言观入大空慧者。谓初观入于最胜真如大空之慧。从初入心遂起后得巧方便道智中。见诸众生无非苦谛。何以故。皆有识苦之心。三途乃至善趣。苦缘中生识领故。何等为苦。谓有三苦。言如者。相传云。相似如也。指事言故。言身初觉者五识也。从刀杖者外缘也。从身者内缘也。根境并色故言色阴。二缘中生识觉故。此识名为行苦之缘。率尔多分起舍受故。次<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>觉同缘刀杖及身疮等。引生五识相应苦受及自忧根。名苦苦缘。重故苦苦者。释逼迫重名苦苦也。次起第三。追念意识名受行觉。于前所受追缘行故。于前二觉所缘身等会妙坏中。生忧恼故名坏苦缘。是以三位识渐生三苦。故为苦苦苦。此三苦字如次结前行等三苦</p><p>经。一切有心至是初善根</p><p>述曰。第二化导。诸有心者。见是三苦起八苦等之因缘故。此地菩萨入教化道三昧。说诸过患令生厌背。于中入定意业<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。现身六道身业自在。十辩说法语业自在。十者传说。一自相。说事相故。二同相。说理相故。三行相。四说相。五智相。六无我慢相。七大小乘相。八菩萨地相。九如来地相。十作住持相。即古今恒尔相也。(如十地论)。苦识者苦体也。于此且说<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>门故。苦缘者所依也。依自心王及根起故。刀杖缘具者外触境也。苦识行身疮肿发坏者内触境也。以觉苦识所行执受内身触故。刀等破身故具二触。疮等自生故言不具。具所依缘生了别故名为生识。识作思也。识受受也。触识触也。如是一聚合名苦识。以随显胜且举三心所。然此苦谛差别有三。一者苦苦。依根境故言行二缘。由此念念缘身疮等故言心心缘色。此心触对触恼之境领受烦毒为苦苦也。二者行苦。二苦本故处中说。言心缘识者名之差别。初在根发多分率尔觉所缘境名行苦觉。思受及触才觉境触未受毒时。舍受现前名为行苦。三者坏。苦境切生苦如[登*斤]石火。谓由缘逼[登*斤]行苦石。出坏等苦烧身心也。此有二种。刹那生灭即细坏苦。若一期身散坏转变如幻化。识于中了故言识入坏缘也。妻子珍等存名缘集。彼后败坏名为缘散。尔时心苦转增心恼。虽现受念。后散坏缘恋着前存念念不舍是为坏苦。总结上云三界一切苦谛也。次明集谛。谓观无明引集无量善恶之心作一切业。习气相续烦恼习因诸业集因名为集谛。次明道谛。正见因也。解脱果也。空空智道体也。谓二空智以世间正见为因。出世解脱为果。群圣之迹名道。见修等别名心心。总结名以智道道谛。次明灭谛。尽有苦果尽有集因。离障清净一味所照体性。以圣妙智择力寂灭一谛也。慧品具足已下总结初慧善根。起空者俗智。入观者真智</p><p>经。第二观舍至舍品具足</p><p>述曰。逆次第二观舍善根。初总标云。第二观彼舍一切贪障而行平等空之舍也。次明行相。以无缘行观法空际一真如相。又观世俗平等之门。谓观地土吾所已用旧故土等。四大皆然。我今入此地者离垢地也。毕竟不受不净身者。如十住论。初地菩萨于五欲中烦恼作患。上地不然。无始淫爱受胎生身。所弃尸身成大地等。今于五欲不作过患。更不应受胎生身故</p><p>经。第三次观至无量法身</p><p>述曰。逆次第<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>慈善根。妙花三昧者。一乘三昧总摄因也。佛乐果也。后结成言无痴无贪无嗔。如次结前慧舍慈品善根成也。入平等智诸菩萨行本也。现化无量法身者。如水中月法身影故</p><p>经。如一切众生天华品说</p><p>述曰。第三指广。余地准此</p><p>经。若佛子至名一义别</p><p>述曰。第三地名光明者。发光地故。次行相中有二。自利故利他故。初亦有二。知能诠故知所诠故。此初也。三昧解了智者。以依胜定发三慧故。三世佛法门者。十二分教。名句文身遍摄能诠故。重诵者应颂。此不了义。对记别故在前立二。直语者契经。此唯长行。对讽颂偈故次立二。不请说者自说。戒律者因缘。佛界者本生。昔事者本事。方正者方广。未曾有者希法。谈说者论议。言名一者。一种名句文故。义别者。开为十二分故</p><p>经。是名味句至因缘果观</p><p>述曰。第二知所诠也。分分受生者分段生也。初入识于胎即识支位也。四大增长色心者名色支也。名六住于根中起实觉者。堪发识位为六处支故。未别苦乐名触识者触支也。觉苦乐识名三受者受支也。连连觉着受无穷者爱支也。恒着爱故。欲谓欲取。我谓我语取。见即见取。戒即戒禁取。合取支也。善恶有者有支也。识初名生生支也。识终名死死支也。言是十品者。除无明行支故。现在苦因缘果观者。识等五支名现在苦。爱取有三名现在因缘。生老死二名因缘之果。能观察彼名之为观</p><p>经。是行相中至身心则化</p><p>述曰。第二利他也。菩萨念言。于是缘生行相。以中道智我久已离有无著故无自体性。知所证已亦为利他入总持辩。事佛受法现身六道。随应说法。现劫化者。如维摩经一日舒为七大劫等。展转化故言转化百千劫。国土不同身心别化者。随其国欲三业别化</p><p>经。是妙华至三昧品说</p><p>述曰。第三存略指广。如彼二品已广说故</p><p>经。若佛子至寂灭忍</p><p>述曰。第四地行相中有二。自分行故胜进行故。此初也。梵云尔炎即知所义。今配二谛故言尔真炎俗。离增减故言不断不常。如无量劫即是一念。况生住灭一世一时一有。一有者一妙有也。虽真一味因缘不杂。故言种异异。如因缘别。果亦不同。故言现异。既虽无相不坏假名。故言因缘中道也。既无定性名中道故。非一二等。如文可知。然随假相佛与凡等一一差别名为世谛。然胜义智道观。彼无一二。如何等法观彼真耶。故总举言玄道定品也。玄即所缘。道谓慧也。定谓所依。言<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>行者举果显因。初觉定因者初悟空理定即因也。觉之因故。何等名品。谓有十种。初三如次<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>慧。次七证位七觉支也。上觉精进。以上升故。观觉定也。从果名故。倚觉安也。旧翻倚故。乐谓喜也。四地菩萨渐断障时。方便道力念念进入定果觉慧。是人住定起慧炎故。见世俗法行胜义空。若起念定者。定之亲因并举念也。起者出也。出前缘法缘空定者。即入有情缘心定中生慈心爱。以顺道法化生。既爱法乐名法乐忍。持德不退名为住忍。入真名为证忍。出妄名寂灭忍。名之差别也</p><p>经。故诸佛至已明斯义</p><p>述曰。第二胜进行。于彼菩萨所入定中。诸佛现影而起发故。百千起发者精进法门也。着定者释住定也。贪定者释味乐定也。然善法欲非贪烦恼。已断定爱故。发起者觉发也。警彼定品三种相故。菩萨定力超三有故。名为出相。超二乘灭名为进相。向大乘果名去向相。<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>觉发出相之故。菩萨不没生死不退涅槃。觉发进相之故。不堕二乘。觉发去向相故。不住因位。是则定品功德满足。谓摩顶发起名顶三昧法。离没等劣名上乐忍。功德圆备名永尽无余。无量功德品福也。行行皆光明智也。见佛体性常乐我净者。令心解故。余文可解。上日月下指余品也</p><p>经。若佛子至因果分别</p><p>述曰。第五地举章云。慧照者始双照故。地行有二。自分故胜进故。初亦有二。智故通故。此初也。总标云十力生品者。起一切功<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>故。一以一慧至处力品者。处非处智力也。二自业智力。三种种胜解智力。能知六道意乐胜劣故。现行意乐名为果欲。四种种界智力。知种姓故。五根上下智力。六静虑解脱智力。能知凡圣定差别故。正定圣也。七遍趣行智力。能知趣果方便故。谓知乘是因必至果处。及乘是果由乘因道故。如对法云。悟入大小乘教所摄境故。八死生智力。言五眼知一切法者。类举总数。慧<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>等知一切法。以天眼见诸受生故。九宿住随念智力。十漏尽智力。一切受者顺现受等。润生烦恼灭。发业无明灭故</p><p>经。而身心口至下足事</p><p>述曰。第二通力。三业变化自在用故。既从众生现不可议。下地不知觉举足下足事</p><p>经。是人大明智至现在前</p><p>述曰。第二胜进分行。大明智者总举也。惭惭进者加行道也。分分智者无间道也。光光无量无量者解脱道也。不可说不可说法门胜进道也</p><p>经。若佛子至品中说</p><p>述曰。第六地举章云。华光者。般若正因照境破闇故。次地行中初总标已。天眼明下别显十通。十通者。一天眼通。知微尘数大色分成六道众生身。及一一身细分成大亦分分知。二天耳通。言非非音非非声者。传说。并知音声空故。一切法声者余一切声。有说。闻法[彖/虫]等教也。三天身通。即神境通。知一切色及知色之非色等性。于一念中通于十方国土之量三世劫量。随国大小现齐尔所时尘数身故。四天心通。即他心智。五<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>通。知人事故。即宿住智。六天解脱通。即漏尽智。知诸众生解脱方便故。灭灭皆尽者。灭十障故。已后四通皆是他心通之差别。如次知他定慧念愿立为四故。非定非不定者。以上二心体性空故。三十心者地前心也。一切求者。于法非法求修断也。言而尔所者。但明尔所十通明者。于释迦略说也</p><p>经。若佛子至听法故</p><p>述曰。第七地中举章云。满足者功用满故。地行有二。实行故化相故。此初也。言十八圣人智者。以随分得十八不共法故。古有作疏云。初六中身无漏过者。离杀盗淫业及习故。二口无语罪者。离<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>等四罪语故。三念无失念者。离贪离嗔及邪见故。乃至广说。非也。如此十恶前第二地已永离故。今解。身无漏过者身无误失也。口无语罪者无卒暴音也。念无失念者无忘失念也。离八法者无不择舍。罗汉由执世间八法专求自利<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>他事。菩萨远离八法性故。一切法中舍者无种种想也。于生死涅槃无差别想。由住第一大舍故。常在三昧者无不定心也。此六入地之所满足。第二六者。一欲具足。于三界结无所怖畏。堪求所知障清净故。言具足者今云无减也。二精进具足。所求能满故。三念具足。远忆诸法劫人事故。四慧具足。众生者世谛也。一切法者第一义谛也。四重之中且举初故。五解脱具足。知诸解脱未得不退故。六知他解脱足。即定不退也。必由定力知<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>心亦无染故。是人入此中六足中更欲起后满分六故便起智也。一身随六道心行而现。二口辨说法示众生故。三随众生心入定振动。言虚空化花者。以雨花故。能令众生心有所行。上三如次三业随智行也。四以大明具足见过去佛。亦令众生心眼得见。五以无著智见现在佛等。六以神通智见未来佛等。此中大明无著神通者。达三世智名之差别也</p><p>经。住是十八至国土中</p><p>述曰。第二化相中。先观平等慈悲门。次量自力能。后现变化。力能之中。一切功德者福品也。一切神光者智品也。一切佛所行法等者。<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>法门及胜进法门中已入解也</p><p>经。若佛子至入心三昧</p><p>述曰。第八地中有五种行。此初定行。初无功用名入法王位三昧也。其智似果说法定故。虽有所说而于无相无功用住。故言似佛。下内空等十大明慧所入定门。任运流故。诸佛得果除闇教音入菩萨心定也。花能得果。光除闇义</p><p>经。其空慧者至不可说</p><p>述曰。第二慧行。谓内空等如辨中边智论广说。于此第十泯第九也。总结十空性平等地。可以十门假说。而不着故亦不可说</p><p>经。神通道智至一时行</p><p>述曰。第三通行。谓神通智遍知诸事。入无量土神通照境如眼见色。余真实智达事达理。行解深细如意识了。转法度与一切众生者。以己之解授与众生也。菩萨法身示现诸化与果相似。言入佛果。是诸佛数。况是九地十地数也。平等门者。陀罗尼门等所行真如门中。而大自在一念一时而修行也</p><p>经。劫说非劫至佛说非佛</p><p>述曰。第四说行。劫空非劫。然不都无。非劫说劫。余皆准此</p><p>经。而入出至品中已明</p><p>述曰。第五照行。诸佛体性三昧者。传说。果德相应故。反照者还照自故。言顺逆者。如顺逆观缘起。余皆随境。不动已下明智行力。离功用故言不动。永伏染故言不倒。恒证生空言不出。法空不续言不入。永不复受分段生死故言不生不灭也。结文可解</p><p>经。若佛子至出入无时</p><p>述曰。第九地中言佛华严者。具四无碍庄严行故。地行有二。内证故外化故。此初也。现佛威仪定及说法自在王定。恒现前故更无出入别时也</p><p>经。于十方至无量意</p><p>述曰。第二外化。十世界者十方大千故。所现身别相好具足自在无碍与虚空同。无量大悲智慧光明福相智相庄严法身。言一切法外等者。非趣生法而行趣生。转魔界等入佛界等。性平等故说无碍也。光光照者二空故。慧慧者彼后智故。明炎明炎者无间解脱故。备四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>四无量十力十八不共法八解脱等。无住涅槃不住二边。无为一道所知障净。为诸众生作父母等。说法穷劫令得道果。从生死际起者。从初发心至金刚心。所有愿行于一心现。入众生界而教化也</p><p>经。若佛子至名佛界地</p><p>述曰。第十地中举章云。入佛界者受职位故。次地行中有二。行功德故行胜利故。此初也。先出体用言大慧空。然二空用亦复空故言空空复空。复空所取能取。既平等空故言如虚空。性平等智有果德性十德具足。此总标也。十者十号。一者如来。清净法界一相无为。其中法身神虚体一。一切事法泯同法性无所去来名如来故。然经举义末后配名。二者应供。智应顺境。断应不受后有。法身无二应正法养故。三者正遍智。遍覆有情及器世事。周知诸法及有情故。正觉所知名为正知。无所染著名圣解脱智。四者明行足。因行增明已到满故。五者善逝。善逝于三世佛法其所至法同于先佛。佛去世时多有所益言去时善善。来现世时亦有所益言来时善善。名善善者结善逝也。六者世间解。菩萨修行上说五种德行。入世间中教化众生令解脱故。七者无上士。诸行法上入威神似佛所行义形处故。八者调御丈夫。为世间解脱调顺众生刚强烦恼故。九者天人师。彼所咨受法言师故。十者佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。法身无二智身恒时。大满名佛。一切<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>及所尊敬名世尊故。次总结释佛界地名。一切世人受教之处。是故此地是觉地也。下地来入亦名界地。能持群圣<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>处故</p><p>经。尔时至与佛道同</p><p>述曰。第二行胜利。十地菩萨坐莲华上。蒙法身佛授记摩顶。及蒙同见同学赞叹。言法身者。如隔轻縠见报身故。内德已满更得一切佛菩萨请转法轮。饶益世间。所转法轮名虚空藏。周遍容受化导门故</p><p>经。尔时至一心而行</p><p>述曰。第五付属也。不可说数名也。此数为一。积至百千恒沙法门。恒河者。香山顶无热恼池流出四河。此东河。水宽四十余里。梵语应言殑伽。无别正翻。义天堂来。河源山顶人所不见。如俱舍云。无通不能至。但见彼水高澍而下。时俗遂言天堂来也。此一河沙为一数量至百千故。就彼门中。今此第十心地品者如毛头许。佛付属言。三际佛菩萨之所说学。我已多劫修故成佛。放光非一故言光光。告千叶上净秽土佛。汝各转化一切众生。佛等展转说也</p><p>经。尔时千华至世界而没</p><p>述曰。自下大段第二化传说中有二。报恩故别化故。此初也。法可重故</p><p>经。没已至品中说</p><p>述曰。第二别化也。各还本土别化众故。于中有二。传上贤圣内门行故。传初发心外门戒故。初亦有二。经家总序故别释故。此初也。其三昧名如前已释。大小乘机所见不同。菩萨众见初成佛已往第四禅大自在天王宫放光接众。事卢舍那听心地品。还来树下出定而说十世界海。菩提树者毕钵罗树。在伽耶城西南二十四里。金中精窂名曰金刚。可宜金刚体之座也。光中最胜名光王座。妙光堂者。即华严云普光堂也。因佛放光而立名也。在摩伽陀国寂灭道场界。去菩提树三里也。灭生死处名寂灭道场。十世界海者。华严第二云。莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>世界海。次东方有世界海。名净胜光庄严。中有佛刹。名众宝金刚藏。如是十方各说异名。广如彼说。除莲华藏言十世界海。世界海量如前已说。十住十行十回向者。即前所说十发趣等。十禅定者。此文次第当四善根。一向修慧故偏说定。禅那此云寂静。其十者何。如<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>十定品说。善戒经第六禅品中有十寂静清禅。一世法寂静净禅等。彼十何义。颂曰。漏无漏近分。根本与胜进。入住出边际。决择分为十。准此上卷十金刚者即十回向。四天中说。何故色界重说回向。北并州真藏师云。色界所说诸位通行。如华严三十九说。十金刚心。谓菩萨发如是心。我当觉了三世一切诸法悉无有余。是第一发金刚心。乃至广说。十忍者。瑜伽忍品云。清净忍有十。如彼广说。又善戒经忍品说十。十愿者。如华严说。发菩提<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>下当引释</p><p>经。尔时释迦至八千返</p><p>述曰。第二别释。谓有疑云。从初成佛何时说耶。故今释云。此化释迦初莲华界从本佛现。自东来入兜率天宫。说魔受化经已下生入胎。乃至号吾释迦牟尼佛。此举成道也。余诸经云。树下降魔。云何此经魔受化已方始下生。解云。魔众非一。化有前后。如大集经云。魔王有百亿。若一已伏更无余者。佛灭度后谁乱结集。为显力胜时时降魔。如华严云。为显菩萨功德之力不可坏故。下阎浮提者入胎相也。梵云瞻部。此云胜金。如阿含经阎浮提品。阎浮树下有金。厚四十由旬。号曰胜金。金中胜故。即阎浮檀金也。摩诃摩耶此云大术。七岁<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>等者。此经应错。既说娶嫁方出家故。西域传云。诸部见闻不同也。其正义者如金光明记。寂灭道场已下显时。谓成佛已从第四禅事卢舍那受心地法。还来道场说十世界海。如次前说。历十住处。乃至第十摩醯首罗天王宫中说心地时。诸大梵王供网罗幢。因此说法乃至告言。吾今来此世界八千返</p><p>经。为此娑婆至一戒光明</p><p>述曰。大段第二诫恶行门。于中有三。开序故正说故<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>故。初亦有三。时处故劝策故结戒故。此初经家序时处也。为化此娑婆界。从金刚座乃至四禅所化类故说心地竟。复还树下始说。如下菩萨戒本。戒破罪闇名为光明</p><p>经。金刚宝戒至自性清净</p><p>述曰。第二法王劝策。于中有二。策发故劝信故。此初也。佛举戒云金刚宝者。坚牢能持一切功德令不漏失。破诸恶故。因果万德以戒为初。名曰本源。如下广释。佛性种子者戒实性也。意谓那末。识即六识。心谓第八。色即五根。凡有如是情及心者皆入佛性当得作佛。所以者何。当当常有因故。有当当常住法身。三菩提因重言当当。其当果因法尔有故。有当当报化及常住法身。如是<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>出于世界等者。释迦传说出现于世。则是法戒应<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>也。由此显自佛性果故。故今为此大众传说。言一切众生戒本原自性清净者。举戒实性表诸众生皆有佛性故得成佛也</p><p>梵网经古迹记卷上</p><p>梵网经古迹记 卷中</p><p>青丘太贤集</p><p>梵网经卢舍那佛说菩萨心地法门品第十</p><p>后秦三藏法师鸠摩罗什译</p><p>经。尔时卢舍那佛至自性清净已下十一颂半第二劝信。信为入法之本。戒为住法之原。所以说偈更令信戒。然菩萨戒略有三门。一受得门。二护持门。三犯失门。初受得者。六道众生但解师语。要须先发大菩提心。谓誓定取无上菩提穷未来际利乐有情。如瑜伽云。菩提心者决定希求以为行相故。无上菩提一切有情义利为境。发此心已有二种受。一者一分受随其受者意乐所堪。或受一戒或多皆得成戒名为菩萨。不同声闻必总受持若其一分不名<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。谓令现身得阿罗汉。圆满轨则建立学处。十戒具戒各必总受。若凡若圣受学一轨。即由此义简择人器。除有遮难及余趣也。菩萨不尔。随分戒故。谓凡必无现身成佛。要经无数大劫修故。从但解语乃至金刚。随其位力渐渐修满。如成山海尘渧为初。既大菩提无德不摄。欲成彼聚何善非因。即由此义不择趣生。但解师语发心皆得。虽但解语唯受一戒。犹胜二乘一切功德。罗汉功德但为自身。于有情界无有恩分。菩萨一戒为度一切。无一众生不荷恩故。二者全分受。谓三聚戒。摄<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>者断一切恶。恶谓一切应断舍法。从初发心断杀生等。三贤十圣伏断二障。乃至佛舍生死法故。摄善戒者修一切善。善谓一切应<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>法。从初发心随分所学。三贤十圣各十胜行。乃至佛证二转依故。饶益有情者度一切众生。从初发心随分教化。穷未来际度一切故。非诸凡夫即能一切三聚顿誓。渐修满故。如是无碍所发愿行于诸愿行最无上。故随所生处心其中王。然无毕竟堪为其果。唯除无上正等菩提。第二护持者略有十门。一随心门。随其宿习心乐住故。犹如世间随其本色虽一蕰水缘碧等异。故先固一渐具余行。如本业云。若受一戒名一分菩萨。乃至具受名具分菩萨故。然佛所制应渐遍学。由此第二有遍学门。如瑜伽说。声闻自利尚护他心。况诸菩萨利他为先。故应遍护诸讥嫌戒。然智论云。新行菩萨不能一世一时遍行五度。如护三衣不能施等。由此第三有随性门。相违学处现在前时。唯护性戒纵遮戒故。如摄大乘菩萨性罪不现行故。与声闻共相似。遮罪有现行故。与彼不共。然瑜伽云。若有胜利性罪现行。由此第四有隐密门。如摄大乘行十恶故。就中瑜伽但开七非。然其第三但非性罪。于无属女许欲行故。摄大乘论通开邪行。以言十恶见利行故。如杀生等随一摄故。然庄严云。由利群生意起贪不得罪。嗔则与彼违。恒欲损他故。由此第五有顺胜门。爱顺大悲故罪为劣。嗔彼相违。罪为重故。如瑜伽云。是诸菩萨多分应与嗔所起犯。非贪所起。乃至广说。又智论云。菩萨不恼众生为戒。不同声闻求现涅槃。淫欲虽不恼众生系缚心故立为大罪。菩萨不求现世涅槃。往返生死具资粮故。然瑜伽云。若欲断彼生起意乐发勤精进。烦恼炽盛蔽抑其心起嗔盖等。无所违犯。由此第六有意乐门。由意乐力恶无犯故。如十住论。悭心不解不能施时。谢今未熟后当施故。然经亦说。护戒之心如惜浮囊及草系者。由此第七有怖畏门。见微遮罪如性罪故。然涅槃云。于乘缓者乃名为缓。于戒缓者不名为缓。由此第八有成胜门。作善有胜且放止故。然庄严云。虽恒处<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。不障大菩提。若起自利心。是大菩提障。由此第九有护障门。虽有作善护小乘故。如大般若云。若菩萨设殑伽沙劫受妙五欲。于菩萨戒犹不名犯。若起一念二乘之心。即名为犯。解云。虽贪所污。大心不尽。无无余犯。故名无犯。然文殊问经云。若以心分别男女非男女相。是菩萨波罗夷罪。由此第十有究竟门。若取<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>非究竟故。如大般若。应以不护圆满净戒波罗蜜多。犯无犯相不可得故。第三犯失者。谓菩萨戒无无余犯。如有一分受。有一分持故。不同声闻犯一重时。便破一切失比丘性。如本业经。一切菩萨凡圣戒尽心为体。是故心尽戒亦尽。心无尽故戒亦无尽。心谓期心。若不放舍无尽戒愿。无有尽犯。无边戒故。由此<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>。戒亦恒随运运增长乃至成佛。犹如河水日夜不停运运迁流自到大海。唯除故舍大菩提心。彼既心尽戒亦尽故。然犯重戒略有二种。一破二污。若以上品烦恼缠犯。随所犯支失戒律仪。若中下缠唯污不失。如瑜伽云。若诸菩萨毁犯四种他胜处法。数数现行都无惭愧。深生爱乐见是功德。当知说名上品缠犯。非诸菩萨暂一现行他胜处法。便舍菩萨净戒律仪。不同声闻一犯即舍。又上缠犯虽失净戒。经说即忏亦得重受。不同声闻如斩头者现身不能复入僧数。广引教理如宗要释。且止傍论释颂二门。谓初六颂传诵本师门。释迦传诵本师序故。后五颂半末主显扬门。释迦自演戒宗要故。初亦有二种。初五颂显主尊胜门。后之一颂赞戒功能门。初亦有二。初二颂半现身本末门。后二颂半说法本末门</p><p>经。我今卢舍那方坐莲华台</p><p>述曰。现身本末门略有四重。此初他受用身。传说。此身应第二地。戒波罗蜜此经宗故。非自受用。华严等说彼无边故。方者正也。千叶台总成二地菩萨净土。此中台上是身所居。千叶即是所化部落。如仁王云。信忍菩萨百佛千佛万佛国中化现百身千身万身。十地经云。二地菩萨入千世界见千佛故。于此台上别有佛座。此千叶台有说是座。非也。上卷别说卢舍那佛坐百万莲华赫赫光明座上故。既说我住莲华藏世界海。其台周匝有千叶。一叶一世界。我化为千释迦。复有百亿须弥。明知是土。有难。彼土岂狭弥陀圆光。经说彼佛圆光如百亿三千大千世界故。此难不然。佛光不定。释迦亦照无量刹故。或既言如。但比广大。未必量同。如眼喻海。故知百万莲华为座。何故诸佛莲华为座。表佛虽在世如不着水故</p><p>经。周匝千华上复现千释迦</p><p>述曰。第二净土化身。传说。此身应地前机。有说。唯四善根方生净土。理未必然。净土经说余亦生故。净秽同处随业异见。犹如四识等事心异。如说鹙子所见山河螺髻梵王反宝土故</p><p>经。一华百亿国一国一释迦</p><p>述曰。第三秽土化身。言一国者一须弥界。以世界别南洲现故。瑜伽论云一大千有百俱胝界。杂集云一俱胝量当于百亿。何故此中唯言百亿。亿有多种。瑜伽且依十万为亿。此经千万故不相违。此依粗相且说一类须弥世界。据实树形人形倒及侧等。各随其类遍满诸方。异类无碍。如因陀罗网。重重无尽出过思议之表。然皆摄在莲华台藏世界海中。并卢舍那转法轮处</p><p>经。各坐菩提树至卢舍那本身</p><p>述曰。第四举净秽土。机根顿熟一时重化。摄末归本。如上卷云千华上佛是吾化身。千百亿释迦是千释迦化身故</p><p>经。千百亿释迦至十重四十八</p><p>述曰。第二说法本末。卢舍那身虽非凡境。加力见闻接众而至。既贯三际之则。非随时宜所制。故说我诵不言说也。味中之上名为<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。故喻乐中最极涅槃。戒则出苦证乐之门。故言听诵甘露门开也。或说戒经名之为门。所诠之戒名为甘露。教能开理出三界门。对机而显是为开也。凡心易竭。胜影难留。故归本处诵本师戒。此中本师谓即本身。或可戒法名为本师。佛所师故</p><p>经。戒如明日月至由是成正觉</p><p>述曰。此即第二赞戒威力门也。戒破罪闇犹如日月。庄严行者如璎珞珠。如遗教云。惭愧之衣于诸庄严最为第一。或说。性戒明如日月。遮戒庄严如璎珞珠。破性罪闇严性戒故。万行之始以戒为本。万行之终菩提为果。是故三际皆由戒成佛。三聚如应成<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>故。如瑜伽云。如是所集福智资粮更无余果可共相摄。唯除无上正等菩提</p><p>经。是卢舍那诵至转授诸众生</p><p>述曰。自下末主显扬门。此有四门。一展转开化门。二所成戒相门。三能受有情门。四开许广说门。此即初也。谓上六颂本师诵出。如我传诵汝亦应尔。戒手相接佛种即不断也</p><p>经。谛听我正诵至戒品已具足</p><p>述曰。第二门也。世尊所制一切禁戒上乘下乘皆从此出。故言佛法中戒藏也。简定道戒故言波罗提木叉。梵云波罗提。此云别也。若具应言毗木叉。此云别解脱。别出非故名别解脱。又遗教云。戒是顺解脱之本。故名波罗提木叉。若受菩萨戒。谓由此戒我当成佛。犹如释迦由戒已成。便不起余不同分心。尔时名为戒品具足。善思分限名为戒故。如本业云。一切菩萨凡圣戒尽心为体。其心若尽戒亦尽。心无尽故戒亦无尽。此中心者大乘心也。非诸退乘及未发心之所能得</p><p page margintb15></p></div>"
}]