[{
    "title": "法华论疏 第1818部",
    "author": "吉藏大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>法华论疏 卷上</p><p>刻法华论疏序</p><p>法华论疏者嘉祥大师之所撰也。本山实藏具大僧正尝分会本论。兼加校订。许(余)请<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>近者有人<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>其梓行。寄来古本。据之校雠。脱字错误稍稍而在。因举诸格上。傍加国语。付剞劂氏。刻版既成。印生请为之序。因记其颠末云</p><p>旹</p><p>正德甲午孟冬朔</p><p>台山本住<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>(咸润)叙</p><p>胡吉藏撰</p><p><a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a>优婆提舍</p><p>婆薮槃豆(此云天亲)菩萨造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>流支奉诏译</p><p>妙法莲华经优婆提舍。婆薮槃逗造。菩提留支译。婆薮云天。槃逗云亲。其人本是天帝释之弟。释遣其下阎浮提伏修罗。故云天亲。菩提云道。留支曰希。谓道希也。并有别传。今不具叙斯论译之甚久。而不盛传于世者良有二焉。一文旨简略前后似乱。粗寻之不见首尾故也。二昔北土江南多以五时四宗以通斯教。并与论违。讲匠守于旧执背圣信凡。故不传于世也。余讲斯经文疏三种。一用关河睿朗旧宗。二依龙树提婆通经大意。三采此论纲领以释法华。但昔三出经疏犹未解论文。今具释之。使经论焕然可领。但此论有二本。一无前序直云经云归命一切诸佛菩萨。此是集经人请护之辞也。二有归敬此是天亲自作。今具依二文开三分。一归敬<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>申造论意。请威灵加护为缘起分。二牒经解释为正体分。三重牒章门追示分齐为余势分。就初有二。一天亲归敬申造论意。二集经者归敬申集经意。就初有二。前两偈归敬三宝申造论意。次一偈半归敬佛僧请威灵加护。就初又二。一通归敬一体三宝申造论意。次别归敬释迦佛僧申造论意。就初又二。前半偈归敬一体三宝。次半偈申造论意。就初又二。初两字叙能敬之至诚。次八字叹所礼之尊极。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>者第一句也</p><p>顶礼礼有三种。谓下中上。今谓上品礼也。所敬既其尊极。能礼必须最上正觉海下第二明所敬之尊极。问。何以知此是一体三宝。答。既称净法无为僧。即知是明<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>僧。在僧既尔。法佛例然。问。何故敬一体三宝耶。答。既是一乘究竟之经。必明究竟三宝。又以究竟三宝显知一乘。一乘是圆极之经。仍用此言斥北土四宗之说江南五时之教也</p><p>正觉海净法无为僧言正觉海者。一法身佛。遍一切处如海之大。故普贤观云。毗卢舍那一切处也。二深如海。谓七辨不能说。五眼忘其照。故谓深也。三一味如海。平等法身一身如味。四法身具一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。如海之备众珍。余法僧易知为深利智者。第二申造论意又二。初句明教所为人</p><p>为深利智者谓深利智者。一闻即解为利。达至理。所以斯论不盛传者。末世群生既多浅钝。故知知音者希矣开示毗伽典者。上明所为之缘。今明能被之教</p><p>开示毗伽典所为之缘有利有深。能被之论有开有示。即大开与曲示也。毗伽论者。斯文引<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a><a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>所说以叹今法华教也。稚子但教半字之经。长成则训满字毗伽罗论。昔说三乘喻同半字。今明一极谓满字经。亦用斯言斥五时四宗之说。以彼谓涅槃之经独。满法华等教犹半教也。毗伽罗此云字本。毗伽罗论未见翻译。河西朗师云。是大权菩萨之所造也只虔牟尼尊下。第二别敬释迦佛僧。所以须别敬者。三宝具有一体别体。故须通敬别敬也。又释迦当今教主。欲释所说之教。必须敬演敬之人。就文又二。初半归敬佛僧。后半申造论意。两章各二。初章二者。初只虔两字述能敬之至诚。次八字叹所礼之尊极</p><p>只虔只者重也。虔者敬也。前已通礼。今复别敬。故名重也。亦可前明顶礼用震旦之音。此称只虔依<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>之训。犹未详次。别请问译人</p><p>牟尼尊及菩萨声闻令法自利他下。明申造论意。亦开为两。初句申造论意</p><p>令法自利他谓令解此妙法得自利益。谓自<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>也。更传授于他。使他成佛也略出勒伽论者。第二正明造论</p><p>略出勒伽论从首至尾委曲释者。谓为广论。今但折其枢要。震领提纲。如脱犀象之牙甬。擿翡翠之毛羽也。勒伽论者。即摩德勒伽。谓解阿毗昙论。此翻为境界。寻斯论旨能生自他利解。即生解之境界也归命过未世下。第二次明申敬请护。即开为两。半行致敬。一偈请护各两。初二者归命两字明能归之至诚</p><p>归命次之叙所敬之尊极</p><p>过未世现在佛菩萨弘慈降神力愿施我<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>弘慈降神力。使我所说合理称机。无违理伤机之过次半请大悲加护使离彼四魔得三菩提增长</p><p>大悲止四魔护菩提增长初句请所应离者皆离。次明所应得者皆得也经曰归命一切诸佛菩萨者。此第二集经者请护之辞</p><p>经曰归命一切诸佛菩萨前归敬申造论意请威灵加护。此归敬集经者欲出<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。亦请威灵加护。一切众经皆并有于此辞。但随寄一文示存略故也经曰如是我闻。此是第二正明论体。但论略难明。今引二门叙其体例。一辨二经同异。二叙斯论制作之方。二经同异者。即罗什所译经及留支所出带论之经。其文不同。凡有五种。一者旧经略论经广。如旧经叹罗汉德唯有五句。论经有十六句。或可梵本广略不同。或可声闻常众无会不集处处叹之。故罗什略叹其德也。天亲欲示解一经叹德。令讥众经叹德之意。故广说也。二旧经广而论经略。如方便品。旧经为十句。谓如是相如是性等。论经唯有五门。当是天亲以略摄广故也。三二经同无广略。如叹菩萨德。四品次前后。旧经属累在药王之前。论经在普贤之后。罗什依于义意。是故在前。天亲同经常法。所以在后。五名义不同。旧经称六十二亿恒河沙菩萨。论经称六十二亿恒河沙佛。罗什依经文译之。故云菩萨。论取义意叹释其福正等。显初地菩萨得真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身故即是佛。以观音与六十二亿法身不二。故言福平等。所以称佛。次明论制作不同者。如龙树释经。不预开章门。至后追詺于前。天亲释此经凡有二意。一者预开起尽。如初品七分。二至后方陈。如论末云方便品凡有五门。盖是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>适时而用也。天亲大开此经凡有三十二章。所言三十二者。即序品七分方便品五门谓十二也。从譬喻品竟宝塔品。破十种病利益十人即十段也。从药草竟一经明十无上。又有十章。故合成三十二也。问。初从火宅竟于宝塔所破十病。云何更从药草竟一经明十无上耶。答。付法藏经云。婆薮槃陀善解一切修多罗义。修多罗者凡有五义。一者显示。谓显示诸义故。如序品七段方便五门即显示十二种义也。二涌泉。谓义味无尽故。如解譬喻竟于宝塔更从药草竟于一经。释于后竟而追解于前示义味无尽。即涌泉义也。三出生。诸义出生故。如解第十无上胜功德力。叹经广生功德无尽。即出生义也。四者绳墨。裁诸邪显正故。破十病名曰裁邪。显十种义所谓显正。五者结鬘贯穿诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。则三十二章同为显一道唯教一人。如结华鬘令身首严饰也。又释后竟而更追解前者。圣人内有无碍之智。外有无方之辨。故能<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>而译。又从前译向后示鸟目疾转。从后向前如师子返掷。又前译经竟有疑者重问之。故后更释之。如今人义深后章别有料简重也。盖是外国圣人制论之大体也。就释初品大开为二。一者牒经。二者论译。牒经但牒二章。谓序分经众分经。牒序分经始从如是终竟崛山。即牒经序分也</p><p>序品第一如是我闻一时佛住王舍城耆阇崛山中与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>下。第二牒众成就分也。什译经有三。一声闻。二菩萨。三人天众。今但牒前二。以二众有叹德。今欲释之。故牒以人天众无叹德。又易解兼余经已释。故不牒之。就牒二众即二。牒声闻众中旧经有比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。今但牒比丘。比丘众中有二。一显名。二密行。今但牒显名不牒密行。并为易解兼不叹德故也。比丘中有六。一标通号。二唱数。三明位。四叹德。五列名。六总结。今但列初四。不列后二。而论释中不释初一通号及第五列名</p><p>与大比丘众万二千人俱皆是阿罗汉诸漏已尽无复<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>心得自在善得心<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>善得慧解脱心善调伏人中大龙应作者作所作已辨离诸重担逮得已利尽诸有结善得正智心解脱一切心得自在到第一<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>菩萨中亦六门。一通号。二唱数。三明位。四叹德。五列名。六总结。而后论释中不释初一及以后二。至文当显</p><p>菩萨摩诃萨八万人皆于阿耨多罗三藐三菩提不退转皆得陀罗尼大辩财乐说转不退转法轮<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>无量百千诸佛于诸佛所种诸善根常为诸佛之所称叹以大慈悲而修身心善入佛慧通达大智到于彼岸名称普闻无量世界能度无数百千<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>论曰下。第二论释就文为二。第一通释一品。凡为七门。第二别列七门</p><p>论曰此经法门中初第一品示现七种功德成就就初又二句。此法门者一部之通号也。初第一品者一章之别称也。七种皆称功德者。此之七种皆能显道利物故并云功德。一一章中明义具足无余。不可破坏故云成就何等为七下。第二别列七门。就文又二。初列次释文</p><p>何等为七一者序分成就二者众成就三者如来欲<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>时至成就四者依所说法威仪随顺住成就五者依上说因成就六者大众欲闻法现前成就七者文殊师利答成就序分成就者下。第二释七章门。即成七分。初分有五。一如是。二我闻。三一时。四教主。五住处。今但释第五。初分四余经已明。兼复易解故不释也。论曰序分成就者。此牒序分成就义也</p><p>又序分成就者此法门中。示现二种胜义成就应知者。第二释序分成就。就文为二。一正释。二举经示释处。就初又四。一标二种胜义劝知。何等为二下。第二别出二种胜义。如王舍城下。第三正举城山示二种胜义。显此法门最胜义故下。第四正明胜义</p><p>此法门中示现二种胜义成就应知何等为二一者示现诸法门中最胜义成就故二者示现自在功德义成就故如王舍城胜于诸余一切城舍耆阇崛山胜余诸山故问。王舍城云何胜一切城。答。别传云。五天竺国十六大国五百中国十千小国有六大城。而王舍城最大。龙树云。佛灭度后阿阇世王人民减小故更别立一小城。犹胜一切城。何况本王舍城。譬此经于一切经中胜者。凡乘有四种。一是人天即<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>乘。二小乘。三大乘。四一乘。此经正明一佛乘故众中经胜。又说尽理之法畅众圣之心满诸佛之愿。华严等法华前教虽尽理之法未明五乘众生皆成佛。未畅诸佛之心。是故斯经最胜。结束一化始终。是故最胜。如神力品云。如来所有一切诸法。一切自在神力。一切秘要之藏甚深之事。皆于此经宣示显说。余经但当教明义未畅诸佛之心。是故此经最胜。又如论下品云。此经有十七种名显示十七种甚深功德。是故最胜。问。大乘一乘此有何异。答。有同有异。所言同者即一而包故一乘称大。即大无二故大乘名一。故下文云。为诸声闻说大乘经名妙法莲华。亦如胜鬘摄受<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>名摩诃衍。故知一大无二。所言异者。摄论已称小乘大乘一乘。金刚般若云。为大乘者说。最上乘者说。故知大与一异。所言异者大乘未废二。一乘已废二。大乘密废二。一乘显废二。大乘但是因。一乘即是果。如智度论云。是乘从<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>出至萨婆若中住。至佛乘反名一切种智。不复名乘。故知大乘但因。法华明三车一城皆是果位。故知一乘但果。又大乘通<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。如十二门论。诸佛所乘故名为大。大士所乘故名为大。一乘但果如法华说。又法华论云。一乘者谓无上菩提果究竟故。此一徒判。更有余义。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>谓一乘波若首楞严师子吼。若如此文即一乘亦因与大无二。问。何故一乘偏属果。答。昔明三果究竟。至此经即二果非究竟唯<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>是究竟。是故一乘偏属佛果。鹫山胜一切山者。摩伽陀国有五山。于五山中鹫山最胜也。问。如十地等经明十宝山。云何及取鹫山胜一切耶。答。鹫山是三世诸佛常所住处。余山不尔故偏言胜。问。云何是自在义耶。答。既明佛乘。佛即自在。又余经当教明义。此经结束融会一化始终出生收入。故言自在。问。章门中明一胜义二自在义。今辨城山并是胜义。云何是自在耶。答。即此二胜故是自在。又王城取自在。山取其胜也</p><p>显此法门最胜义故如经如是我闻一时佛住王舍城耆阇崛山中故众成就下。七分中第二众成就分文为二。初标次释</p><p>众成就者有四种义成就应知释中初列四种章门。次释四种章门</p><p>何等为四一者数成就二者行成就三者摄功德成就四者威仪如法成就初四章总释。大小乘有此四事也一数成就下。第二别释四章门。即成四别也</p><p>一数成就者谓大众无数故数成就总明大小二众之数。如声闻一万二千菩萨八万之流也。所言无数者。示存略故总云不可说耳二行成就下释第二章也。就文又二。初总释大小二众。凡有四行。次别释行体</p><p>二行成就者有四种一者诸声闻修小乘行二者谓诸菩萨以修大乘行三者谓诸菩萨<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>自在力随时示现能<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>众行如颰陀婆罗菩萨等十六贤士具足菩萨不可思议事而常示现种种形相谓优婆塞优婆夷比丘比丘尼等故四者<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>声闻人威仪一定不同菩萨故四行凡有二。一对大小。二定不定。大小者声闻定修小行。菩萨定修大行。次明定不定者。菩萨虽大行方能示无定无方之行。如十六贤士能示为小乘<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>。即大包小故。大示小行也。次比丘出家声闻定<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。毕定住出家威仪也。问。论何故举十六大士。答。十六是在家菩萨。以对小乘出家明道俗明定不定也皆是阿罗汉下。此第二别释小乘大乘二种行事。又二。初总列大小二功德数次别释二也</p><p>皆是阿罗汉等者有十六句示现声闻功德成就故皆于阿耨多罗三藐三菩提不退转等者有十三句示现菩萨功德成就故小乘十六句功德者。论经广故有十六也。菩萨十三句者。罗什经与天亲论经同也阿罗汉功德成就者。释上章门也。今前释罗汉章门。又开为二。初列三章门。次释三章门</p><p>阿罗汉功德成就者彼十六句示现三种门摄义应知何等三种门一者上上起门二者总别相门三者摄取事门即用此三门以释上十六句经文也上上起门者第二释也</p><p>上上起门者谓诸漏已尽故名为阿罗汉以心得自在故名为诸漏已尽诸漏已尽故名为罗汉以心无复烦恼故名心得自在以善得心解脱善得慧解脱故名心得自在以远离能见所见故名无复烦恼以善得心解脱善得慧解脱故名心善调伏人中大龙者行诸恶道如平坦路无所拘碍应行者已行应到处已到故应作者已作者人中大龙已得对治降伏烦恼怨敌故所作已辨者更不后生如相应事已成辨故离诸重担者已应作者作所作已辨后生重担已舍离故逮得己利者已舍重担证涅槃故尽诸有结者已逮得己利断诸想恼因故善得正智心解脱者诸漏已尽故一切心得自在者善知见道<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>智故到第一彼岸者善得正智心得解脱善得神通无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>等诸功德故大阿罗汉等者心得自在到第一彼岸故众所知识者诸王王子大臣人民帝释天王梵天王等皆知识故又复声闻菩萨佛等是胜智者彼胜智者皆悉善知是名众所知识可就二义释门。一就义释。二依文释。就义释者。学人功德比凡夫功德为上。无学人功德胜于学人功德。故云上上。如下论云。善得正智心解脱名上上功德。唯罗汉方有此功德也。又罗汉有二种。一钝根小罗汉功德为上。今叹大罗汉功德故云上上也。又大罗汉有二功德。一上功德。二上上功德。今十六句叹上上功德也。起者欲生起此上上功德也。依下释之。已云上上即一上为上一上为下。上下互相显释为上上起门也。观下释中都有五意。一以下释上。二以上释下。三以上释上。四以下释下。五以上及下足释一句。以下释上者。谓诸漏已尽故名为阿罗汉。诸漏已尽者。以心得自在故。此亦是以下释上。与前句异者。前是摄次以下释上。今是超句以下释上。以无复烦恼故名心得自在。此以上释下也。善得心解脱名心得自在。此以下释上也。故释心自在一句用两句上下释之。问。云何心得解脱慧得解脱。答。智度论云。属爱尽名心脱。属见惑尽名慧脱。又释云。定障尽名心解脱。慧障尽名慧解脱。依毗昙定是定数。慧是数慧。解脱亦是解脱数。与定相应解脱名定解脱。慧解脱亦尔。以远离能见所见故名无复烦恼者。此当句释。夫起惑要由能见所见生。已远离能见所见即烦恼不起。善得心解脱慧解脱名心善调伏者。此以上释下也。人中大龙者。此当句释也。前明远离能见所见。是当上释上。今是当下释下也。应作者此用上释下。所作已辨者此当句也。如相应事已成就者。与<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>理相应也。离诸重担者。此以上释下。用上二句以释此句也。逮得己利者。用上释下也。尽诸有结者。以上释下。善得正智心解脱者。用上释下。一切心得自在者。当句释也。到第一彼岸者。以上释下。亦当句释也大阿罗汉者。下释经中如是等众所知识大阿罗汉也。用上叹德中心得自在及到彼岸二句释之。以到彼岸是究竟声闻故称大阿罗汉。问。心得自在云何是释大阿罗汉。答。前释心得自在具定慧。两障俱尽名心自在。此必是大阿罗汉。释众所知识中。前明凡众知识。又声闻下明圣众知识。以具凡圣二众所知故称为众也总别门者释第二门。初标章门。皆是阿罗汉等下释总别门。阿罗汉一句为总。漏尽已下十五句为别</p><p>总别相门者皆是阿罗汉者。从此下但释总不释别</p><p>皆是阿罗汉等十六句中初句是总余句别故皆是阿罗汉者彼阿罗汉名之为应有十五种义应知何等十五一者应受饮食卧具供养恭敬等故二者应将大众<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>一切故三者应入聚落城邑等故四者应降伏诸外道等故五者应以<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>速观察诸法故六者应不疾不迟说法如<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应不疲倦故七者应<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>空闲处饮食衣服一切资生不积不聚少欲知足故八者应一向<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>行不着诸禅故九者应行空圣行故十者应行<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>圣行故十一者应行无愿圣行故十二者应降伏世间禅净心故十三者应起诸神通胜功德故十四者应证第一义胜功德故十五者应如实知同生诸众生得诸功德为利益一切诸众故总罗汉或翻不生杀贼无著应供。今天亲直翻为应。十五中释初一句。明应受饮食正是应供义。余十四但称为应。如文所列。第十五云应如实知同生众生得诸功德者。然经云。有二种五种<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。并从佛口生。谓同生众生。一者四果并缘觉为五种佛子。二者四果并法身菩萨为五种佛子摄取事门者。释第三门。就文为二。初总标次别释</p><p>摄取事门者此十五句摄取十种功德应知示现可说果不可说果故此十五句摄取十种功德应知者。明用十五句摄取十种功德也。示现可说果不可说果故者。一解云。有为果可说。无为果不可说。若依之释者。作十功德名者名为可说。不作十功德名者不可说也何等为十下。明别十种功德</p><p>何等为十一者摄取断德功德二句示现如经诸漏已尽无复烦恼故二者三句摄取诸功德一句降伏世间功德如经心得自在故二句降伏出世间学人功德如经善得心解脱善得慧解脱故三者摄取不违功德随顺如来教行故如经心善调伏故四者摄取胜功德如经人中大龙故五者摄取所应作胜功德所应作者谓能依法供养恭敬尊重如来故如经应作者作故六者摄取满足功德满足学地故如经所作已辨故七者三句摄取过功德一者过爱故二者过求命供养恭敬故三者过上下界已过学地故如经离诸重担逮得己利尽诸有结故八者摄取上上功德如经善得正智心解脱故九者摄取应作利益众生功德如经一切心得自在故十者摄取上首功德如经到第一彼岸故一者摄取德功德者二句示现者。问。云何名德功德。答。一切罗汉必应诸漏已尽无复烦恼故说德功德。二者三句摄取诸功德者。问。云何名诸功德。答。三句之中初句降凡。次两句降圣。所以名诸也。摄取过亦三句何不名诸。以初故。又后三云过。此三应三降伏功德。但立名不同耳。三者摄取不违功德者前句明能于下降。此句叹其上顺。谓得罗汉已后方能善顺<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>行故。四者摄取胜功德。谓。诸罗汉中最胜故如人中大龙。五者摄取所应作胜功德。明虽得罗汉为报佛恩更应敬养尊重于佛。前第三叙顺法。此句辨尊人。六者摄取满足功德。学地所作未辨故未满足。今所作已辨。故云满足也。七者三句摄取过功德。前列三过。初二过过凡。后一过过上下界。谓。过学地实过三界。而言上下界者欲界为散。上二界为静。故上下摄三界也。次举三句者。离诸重担释上过爱。重担虽具<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>而爱为其主。逮得己利释过求命供养恭敬。以得涅槃利故不求世间求命敬养利也。尽诸有结释上过上下界。已尽三有之结。故过上下界也。八者摄取上上功德者。问。善得正智心解脱云何名上上功德。答。论前上上起门中云。云何名善得正智心解脱者。诸满已尽故。就义释者意在漏尽。是故漏尽为上上功德。就文释者。诸漏尽者十五功德中最初功德。故云上上也。九者摄取应作利益众生功德。以一切心得自在故。能自在利益于物。十者摄取上首功德。毗婆沙云波罗蜜声闻。此经到第一彼岸。第一彼岸即是波罗蜜也。问。云何名到彼岸。答。一切罗汉诸胜功德。如无诤三昧等皆悉究竟。故名到彼岸。问。罗什经十功德中凡具几耶。答。但三功德。诸漏已尽无复烦恼。即十功德中德功德也。逮得己利尽诸有结。即是第七过功德。论过功德中有三句。今不摄离诸重担。但有逮德己利尽诸有结也。心得自在。即是十功德中第二诸功德。论明诸功德有三句。今但有降伏世间功德。谓心自在。善得心解脱善得慧解脱。此二降伏学人功德。今不摄也菩萨功德成就者。第二次别释菩萨功德。就文有二。初总标</p><p>诸菩萨功德成就者有十三句已下。第二解释又二。初标二门。次释二门。初又二。前总标二门劝知</p><p>有十三句功德二门摄义示现应知何等二门下。此别出二门</p><p>何等二门一者上支下支门二者摄取事门一上支下支。门者。谓总相别相也。总相在前为上支。别相在后为下支也。欲辨总别二义枝条不同。故称为支也。摄取事门者。以十三句摄取菩萨要功德事。故云摄取事门皆于三菩提不退转者是总者。此第二释二门。即成二别。今前释上支下支门</p><p>上支下支门者所谓总相别相比义应知皆得阿耨多罗三藐三菩提不退转者是总相余者是别相彼不退转有十种示现应知一者住闻法不退。此十句之别。即第二释别门亦次第相生也</p><p>何等为十一者住闻法不退转如经皆得陀罗尼故二者乐说不退转如经大辨财乐说故三者说不退转如经转不退转法轮故四者依止善知识不退转以己身心业依色身摄取故如经供养无量百千诸佛故于诸佛所种诸善根故五者断一切疑不退转如经常为诸佛之所称叹故六者为何等何等事说法入彼彼法不退转如经以大慈悲而修身心故七者入一切智如实境界不退转如经善入佛慧故八者依我空法空不退转如经通达大智故九者入如实境界不退转如经到于彼岸故十者作应作所作住持不退转如经名称普闻无量世界能度无量百千众生故初闻法不退谓闻持也。二乐说不退者。内虽闻法不忘外复有乐说辨才也。三说不退者已闻法不忘。复有辨才。然复得为物说法也。四依止善知识不退者。以上三功德皆由善知识所成故须说也。以身心业依色身摄取故者。身心业谓菩萨身心等三业供养百千佛。依色身者。色身即是<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。菩萨依止佛色身种善根也。问。何故不依法身种善根。答。即明供养种善根等事。故须明色身也。摄取者依佛色身种一切善根为摄取也。五断一切疑不退者。虽种善根有疑未了就佛决之。故于三宝得不坏信。已无疑及决了。故为佛叹也。六者为何等何等事说法入彼彼法不退者。已得无疑。便并起慈身口意为物说法。故须上智也。为何等事说法者。所为事不同故重言何等也。入彼彼法者。于种种法门中通达也。七一切智如实境界不退者。上明慈悲今辨智慧。故相须也。问。一切智云何是如实境界。答。佛一切智于菩萨是所入之境界也。八依我空法空不退者。上明有慧今辨空慧。故相须也。问。我空法空何故名大智。答。我空法空是诸法实相。实相理广大。依实相所生故云大智。又小乘但得人空以为小智。菩萨具得二空。故言大智也。九如实境界不退者。上明空有二慧。今辨空有二境。亦可接上空慧。但明空境界谓如实境也。十作所应作不退转者。菩萨已入如实境界。得到彼岸。复欲令物亦到彼岸。故接上也。作所应作者化物也。化物是应作也。以常化物不绝故云住持也。问。化物何故偏言作所应作。答。大品云。大事者所谓救一切众生。此是菩萨常所应作事。智度论云。菩萨得无生忍已后更无余事。唯成就众生净佛国土。此中正明得无生忍菩萨。故唯当应教化众生。所以云作所应作也摄取事门者释第二摄取事门。凡有二周。初周别标章门。次释章门</p><p>摄取事门者所言摄取事者。以十三句摄取菩萨事也示现诸菩萨下。第二释章门。就文有二。初列三门。次释三门。住何等清净地中者。下列三门也</p><p>示现诸菩萨住何等清净地中因何等方便于何等境界中应作所作故清净地明菩萨位也龙树十地论云。地者谓菩萨阶级住处。因何等方便者。列第二章门。即地中所应作胜用名为方便。于何等境界者列第三章门。即行所对境界。于境界中应所作故也地清净者下释三章门。即成三别</p><p>地清净者八地以上三地无相行寂静清净故谓八九十三地无相行寂静清净故者。六地定不净。七地二国中间亦净不净。八地已上名定清净。七地无相有功用故未寂静。八地无相无功用故寂静寂静故清净。又亦得无相为八地寂静为九地。清净者谓十地。以十地于惑智<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>中或障结习缠尽。故名清净方便者下释第二门也</p><p>地方便者有四种一者摄取妙法方便住持妙法以乐说力为人说故二者摄取善知识方便以依善知识所作应作故三者摄取众生方便以不舍众生故四者摄取智方便以教化众生令入彼智故有四种者。总唱方便有四种也。一者摄取妙法方便者。标方便名住持。妙法已下释方便名住持。妙法者即上皆得陀罗尼。以得闻持故。今所闻妙法不失即是住持。以乐说者摄上乐说辨才。为人说者摄上转不退转法轮。故以经三句摄取妙法方便。问云何名此为方便。答。即住持乃至为人说名方便。问。云何名妙法。答。初句皆于三菩提不退转。即以菩提为妙法。二者摄取善知识方便者。标方便名。以依善知识下释方便。又摄经三句。以依善知识即经文无量百千万亿诸佛。所作应作者摄经三句。一摄供养。二摄于诸佛所种诸善根。三摄常为诸佛之所护念。此三并是依善知识。所作应作事。三者摄取众生方便者标方便名。以不舍众生故者释方便。即摄经以大方便。即摄经以大慈悲而修身心。四者摄取智方便者标方便名。以教化众生令入彼智者释方便也。则摄经善入佛慧通达大智也</p><p>境界者易解境界易解者。即释上第三于何等境界中应作所作故。则摄经到于彼岸也。故前论文云入如实境界不退转则到于彼岸。又后文更释三智境界故此文不释复有摄取事门者。第二周重释取事门。初标事门</p><p>复更有摄取事门从示现诸地摄取胜功德下。释门也。即简与前门为异。前门明地位及方便境界。今明摄取地上功德也</p><p>示现诸地摄取胜功德不同二乘诸功德故第八地中无功用智不同下上故不同下者下功用行不能动故不同上者上无相行不能动故自然而行故于第九地中得胜进陀罗尼门具足四无碍自在智故于第十地中转不退转法轮得受佛位如转轮王太子故以得同摄功德义故不同二乘功德者。总明地中功德不同二乘也。第八地中无功用者下。别明三地中功德。不同下上故者。简八地功德也。初标不同上下。从不同下者释不同上下。下功用不能动者。从初地到七地并是功用位。就功用位中开为上下二分。六地已下名有相有功用为一位。七地一地名无相有功用为一位。今登八地不为此上下二功用所动也。自然而行者。则第八地无相无功用也。以无功用故言自然而行也。又大判十地为三位。一有相有功用位。二无相有功用位。三无相无功用位。初地至六地谓有相有功用位。第七地是无相有功用位。八地已上无相无功用位。论云下功用不能动则是初位。上无相行不能动即第二。自然而行则第三位。问。何故云下功用上无相行不能动。答。正释不动地名。所以称不动者不为二功用所动故名不动。唯法华论有此三位。余论所无。问。不同二乘及不同下位释何经耶。答。释上于三菩提不退转。言不退转者。一不退为二乘。则上不同二乘功德谓勉位退也。下功用不能动谓行不退也。上无相行不能动谓念不退也。以勉三退故言于三菩提不退转也。亦得从不同二乘功德竟至自然而行。并是释八地功德。次第八地名为不退转地。以勉三退故也。于第九地中者释九地功德。得胜进陀罗尼则摄上皆得陀罗尼。具足四无碍智摄上乐说辨才。则九地菩萨具足十种四无碍智。于第十地中者简第十地功德。不退转法转者。摄上经文转不退转法轮。以得同摄功德义故者。则摄上善入佛慧已下经文。已云善入佛慧。则与佛同慧名同摄功德。又依仁王经五忍义。第五寂灭忍佛与菩萨同共此忍。下忍为菩萨上忍为佛。故言同摄功德。初位称叹菩萨德者。从初三菩提不退转是叹八地功德。皆得陀罗尼乐说辨才叹九地功德。从转不退转法轮竟能度百千众生。叹十地功德三摄功德成就者众成就有四门。一数。二行已竟。今释第三摄功德门。今详此论文当是通释大小二众功德。前二门别释二众功德竟。今后二门总释大小二众功德。就文为二。初标章</p><p>三摄功德成就者示现依何处下释章门。就文有二。初列五章门。则是问</p><p>示现依何处依何心依何智依何等境界行依何等境界能辨故从依何处下释五章门。即是答</p><p>依何处者依善知识故依何心者我依度众生心教化毕竟利益一切众生故依何智者依三种智一者授记密智二者诸通智三者真实智依何等境界行依何等能辨者即三种智所摄应知夫二乘菩萨所有功德。必依善知识而有故。初明依善知识。依何心者初句明上有所凭。此句明下有所利菩萨正尔。二乘亦得分有之。故前释罗汉。总别门中云。应将大众教化一切故故名为应。乃至第十五句云。应如实知同生众生得诸功德。为利益一切诸众生故。当知二乘亦有下济之心。依何智者释第三智章门。授记是未来冥密之事。故云授记密智。诸通智则是五神通。并以智慧为体。三者真实智谓无漏智及照空智。依何等境界行依何等能辨者。合彼第四五也。即三种智所摄应知者。合释第四第五也。谓智所照境则释境界义。依三智所照境起三智名为能辨。问。论主依何文明此五门。答。还依叹菩萨德中起此五门。前第二周摄取事门叹八九十三地。第十地只释其转不退转法轮。从供养无量百千诸佛至能度无量百千众生。其文未释。今欲释此经文故开为五门。依善知识处起。即供养无量百千万亿诸佛。依何心即是以大慈悲而修身心。依何智则善入佛慧通达大智。依何等境界到于彼岸。依何等能辨即能度无量百千众生。问。若依叹菩萨德中。起此五门者云何释二乘。答。二乘亦有上凭下济之义。故得通明四威仪如法住成就者。释第四。前标章</p><p>四威仪如法住成就者有四种下。释章又二。前释</p><p>有四种示现何等为四一者众围绕二者前后三者供养恭敬四者尊重赞叹次示经处</p><p>如经尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>四众围绕供养恭敬尊重赞叹故此亦通大小二众。问。经云四众围绕。但声闻出家二众。在家二众云何通菩萨耶。答。菩萨亦有在家出家。智度论云。菩萨必随四众中。四众未必随菩萨中如来欲说法时至成就者。释七分中第三欲说时至分。问。今正说无量义经。云何言是欲说成就耶。答。望后说法华故为欲耳。以将欲明法华故前说无量义。则无量义为法华之由序也。就文为二。初标章名</p><p>如来欲说法时至成就者为诸菩萨下。释章名。就文为三门。一示释经处。二正解释。三叙解释之意</p><p>为诸菩萨说大乘经故初如文此大乘修多罗下。第二解释。就文有二。初总标十七种名劝知</p><p>此大乘修多罗有十七种名显示甚深功德应知何等十七下。第二解释。问。论何故辨此经有十七种名耶。答。略明五义。一者天亲作论。多作总别释经。此十七是一经之总目。十七之外是一经之别。二者欲显十七名有十七功德。劝一切众生<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>供养生尊极之心。三者欲定教浅深使读诵之流改邪从正。有人谓法华是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>教。二者谓是覆相明常。三者执定性常住。今具十七种名并破此三说。故下第十二名一切诸佛坚固<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。谓如来真如法身于此修多罗不坏故。已明真如法身。故知非无常非覆相。真如之体言忘虑绝。亦非定性之常也。四者正欲解一经之题。题云妙法莲华。妙法者谓如来净妙法身也。五者从来讲人谓无量义异妙法莲华。今释随义异故立于异名。或名无量义。或名妙法华。就释十七种名则成十七</p><p>何等十七云何显示一名无量义经者成就字义故以此法门方便说彼甚深法妙境界故彼甚深法妙境界者诸佛如来最胜境界故一无量义者标经名。成就字义故者释无量义名也。字则是教。义谓为理明理教无量也。此与无量义经相应。无量义经云。众生根性无量故教无量。教无量故义无量。是故今云成就字义也。以此法门说方便说甚深法妙境界故者。释上字义也。以说方便说甚深。此之二说释上字所说方便及甚深也。释上字故。故云字义。彼甚深妙境界是诸佛如来妙境界。此亦与无量义经相应。彼经云。无量者从一法生。其一法者谓无相也。如是无相无相不相名为实相。故知唯佛与佛乃能究竟。尽诸法实相名为甚深境界。问。说甚深已是佛妙境界。说方便者何等名为方便义耶。答。无量义经具前说于五乘。于中人天及二乘名为方便。说大乘称为甚深。又理实无五。说于五乘皆是方便。又约理教明实方便。教能诠理故以教为理义之方便也。是故论文但释甚深不解方便。当知方便为显于理。若识所显之理即识能显之教。故不释方便也</p><p>二名最胜修多罗者于三藏中最胜妙藏此法门中善成就故二名最胜修多罗者。若对小乘三藏则以此经属菩萨藏。二者于大乘中自有三藏。如摄大乘说。而法华是修多罗藏。胜余二藏</p><p>三名大方广者无量大乘法门随顺众生根住持成就故三名大方广者。方广是大乘通名。即释此经为诸菩萨说大乘经。又大乘文义俱广。故名大方广也。此论文释者正以教广为广。故云无量大乘门。门则教也。随顺众生根住持成就者。释大乘门无量也。以大乘众生根无量故大乘教无量。以教无量以教能显理顺机故名住持</p><p>四名教菩萨法者以为教化根熟菩萨随顺<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>善成就故四名教菩萨法者。至法华时回小入大。及直往菩萨根皆已熟。故下云如来涅槃时到众又清净也</p><p>五名佛所护念者依佛如来有此法故五名佛所护念者。下经云佛自住大乘。故佛常护念此法。今还为众生说大乘。亦众生得住大乘。即众生亦令为佛所护念。又如摄论云。十二部经从法身流出。即是今文依佛如来有此法故也</p><p>六名一切诸佛秘密法者此法甚深唯佛如来知故六名一切诸佛秘密法者。亦如下文云。唯佛能知不妄授名为秘密也</p><p>七名一切诸佛之藏者如来功德三昧之藏在此经故七名一切诸佛藏者。如神力品云。如来所有一切诸法一切自在神力乃至一切甚深之事。皆摄入此经也</p><p>八名一切诸佛秘密处者以根未熟众生等非受法器不授与故八名一切一佛秘密处者。如五千之徒起去。不堪闻故也。亦如四十余年未得演说</p><p>九名能生一切诸佛经者闻此法门能成诸佛大菩提故九名能生一切诸佛者。如法师品云。闻此经一句皆与授记作佛也</p><p>十名一切诸佛道场者闻此法门能成诸佛阿耨多罗三藐三菩提非余修多罗故十名一切诸佛道场者。三菩提道起于此经。故称为场。神力品云。当知此处即是道场。在处已然经岂不尔</p><p>十一名一切诸佛所转法轮者以此法门能破一切诸障碍故十一名一切诸佛所转妙法轮者。药王品云。能破一切不善之闇。亦如下论破决定等三义。余五种惊怖断四种着。乃至破十种人病也</p><p>十二名一切诸佛坚固舍利经者谓如来真如法身于此修多罗不败毁故十二名如前解。此用多宝佛塔意云法身不坏。亦如寿量品中意明如来三身。及用法师品中当知此处有如来全身之文也</p><p>十三名一切诸佛大巧方便经者依此法门成大菩提已为众生说<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>声闻辟支佛等诸善法故十三名大巧方便者。文正以一佛乘为真实。得一佛乘竟于一佛乘说二乘及人天乘名为方便</p><p>十四名说一乘经者以此法门显示如来阿耨多罗三藐三菩提究竟之体彼二乘道非究竟故十四名说一乘经者。此中正以无上菩提果为一乘体。方便品中用真如法身为一乘体。此二不违。就隐而言则以真如法身为体。约显而说即无上菩提果法为体</p><p>十五名第一义住者此法门即是如来法身究竟住处故十五名第一义住者。第一义则是法身。此经能显法身。则是法身住处</p><p>十六名妙法莲华者有二种义何等二种一者出水义以不可尽出离小乘泥浊水故复有义如莲华出泥水喻诸声闻得入如来大众中坐如诸菩萨坐莲华上闻说如来无上智慧清净境界得证如来深密藏故二者华开义以诸众生于大乘中其心怯弱不能生信是故开示诸佛如来净妙法身令生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>故十六名妙法莲华者。正释经题。论主就二义释之一者出水义。二者华开义。就出水中更开为二。一者出水义。此标出水义也。以不可尽出离二乘泥浊故者。释出水也。此经明出离小乘泥浊水法。故言出离小乘泥浊水也。问。但应云出离二乘泥浊水。何故言不可尽耶。答。一者不可究尽。不可究尽者则是实相法身。今说实相法身。故得出离二乘泥浊水也。以实相法身虽在二乘泥浊水中不可令其灭尽。则是有垢真如出成无垢真如。二者三世佛令众生出二乘浊水成佛。而佛乘不可尽。如譬喻品云。以我此物周给一国尚不匮。何况诸子也。三者莲华虽出浊水而不舍泥水。今亦尔。虽令众生出离二乘成佛。常作二乘方便教化众生。亦如药草喻品明。理虽无二<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>说二。及于缘有二。复有义已下第二义。借莲华出水喻二乘人回小入大。得在如来大众中坐。应同菩萨坐莲华坐故与菩萨同闻法华作佛。前义与后义异者。可有二意。初就法释。以此经说就佛法身出离二乘浊水。后约人出二乘浊水。二者前约直往菩萨。后就回小入大也。二者就华开义。喻者就华开而实显如一乘教开一乘理现。开示如来净妙法身令一切众生得生净信也。净妙法身即是经题妙法也</p><p>十七名最胜法门者摄成就故摄成就者摄取无量名句字身频婆罗阿閦婆等舒卢迦(亦云偈)。故十七名法门者。自上来明佛乘。佛乘具足万德。所以辨众德无量。今明德已无量文亦无量也。故下文云。说是<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>如恒沙偈。亦如药王品云。八百千万亿那由他频婆罗等偈。药王品称偈。今明舒卢迦。亦可以偈翻舒卢迦。亦可异名也。此具如法华疏释。外国或名首卢。或名舒卢迦。是彼音不同耳。问。何故云首卢偈。答曰。首卢是通偈。外国数法若长行若偈并名首卢。故不取别偈此十七句法门是总余句是别者。此第三释具十七种名意</p><p>此十七句法门者是总余句是别故如经为诸菩萨说大乘经名无量义如是等故论主所以具十七种名者。总解一部经名。若解此十七种名则识一部法华意尽。盖是慈悲之心。令人闻少而悟于多意也所依说法随顺威仪住成就者。释第四分。初牒章名。次释</p><p>所依说法随顺威仪住成就者牒章门中。云随顺威仪住者。随顺过去佛威仪。如过去说法华时入定动地雨华。今亦如是。二者随顺众生现在威仪故。后文云。为随顺众生示现对治。摄取觉菩提分法故示现依何等法下释章门。就文为二。初问次答。示现何等法说法者。则是问</p><p>示现依何等法说法问意云。佛依何等法用说此法华经耶依三种法故下则是答。初总标依三法。一者依三昧成就故者。别释依三法</p><p>依三种法故就释为二。初别释依三昧。次总释依动地雨华。就释依三昧复开二别。初正释。次举经示释处。正释中初标依三昧</p><p>一者依三昧成就故以三昧成就三种示现。释依三昧所以</p><p>以三昧成就二种法示现何等为二一者成就自在力身心不动故二者离一切诸障碍随自在力故此自在力复有示现二种一为随顺众生不见对治摄取觉菩提分法故二为对治无量世来坚报烦恼故应有问云。今说法华经何故不入法华三昧而入无量义处三昧。是故释云。无量义三昧有二种力。所以依之。一者成就自在力身心不动故者。释自在力以身心不动。是故静极。以静极故所以鉴明也。二者离一切诸障者。依下论释佛入三昧无人能惊悟则是离一切障。又佛入此定说于法华无有外缘为作障碍令不得说。又无有外缘为障碍令众生不得闻也。问。何以知有此力。答。文云离一切诸障。已云一切则无障不离也。随自在力故者释离一切障心。佛随三昧自在力故一切障不能障也。此自在力复有二种下。重释三昧更有二力。一为随顺众生示现对治者。谓随二乘众生四十余年示现对治二乘病法。又如后论随顺十种众生示现十种对治也。摄取觉菩提分法故者。此出能对治法入于三昧。正用无上菩提对治二乘人病名为摄取。而称觉菩提分法者具言应言无上正遍知道。今为存略但称觉菩提。觉则菩提故。菩提以智为体。而言分者正因无上菩提泯于二乘不用余法。故称为分。又大乘道品七觉分八圣道分。今叹七觉泯之。故云觉菩提分也。叙觉菩提犹分菩提耳觉知分也。分之言因。因则是二乘菩提。摄取菩提分者。即二乘菩提入分菩提也。二为对治无量世来坚报烦恼故者。前明知药此叙识病。合而言之无量义定有其四力。一者内。即身心不动。二则外。无障碍谓内外一双。三则识药。四即知病。谓药病一双。以有此力故入无量义定不入法华三昧也。此品与无量义经相应。故无量义经云。是无量义经文理真正尊无过上。三世诸佛所共守护无有众魔。群道得入不为<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>耶见之所坏毁。无量义经已尔。无量义定亦然如经已下。第二示释经处</p><p>如经佛说此经已结跏趺坐入于无量义处三昧等故二者依器世间已下。第二合释动地之与雨华。就文亦二。一者正释。次引经示释处。就初文有二。初双牒二依</p><p>二者依器世间三者依众生世间谓依器世界众生世间从振动已下双释二依</p><p>震动世界及知过去<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>事等故即二也。震动世界释依器世间。以过去佛将说法华地六种动。今亦如是。所以依动地者说大法。破大部故。大利益故。令众生大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>故也。及知过去无量劫事等故者。释依众生世间。过去无量劫佛说法华。时数盛天雨四华大众欢喜。今亦如是。以说第一理之法畅诸佛之心满众生之愿。数盛天雨四华大众欢喜。问。大众欢喜可是众生世间。天雨四华云何是众生世间。答。天则众生数故也如经已下第二列经示释处</p><p>如经是时天雨曼陀罗华乃至欢喜合掌一心观佛故此列经正证众生世间。前明震动世界。已是证器世界竟也依止说因成就者。此第五分。就文为二。初牒章名</p><p>依止说因成就者彼诸大众已下释章名。就文为三。一正释。二者引经示释处。三断简。就初正释又三。初释放光意。次正释放光。三明光中所现事。初释章名。则是解放光意</p><p>彼诸大众现见异相不可思议事如来今者应为我说渴仰欲闻生希有心名依止说因成就是故如来放大光明示现诸世界中种种事故言依止说因者。正是众生内心。言内心者渴仰愿闻法华。虽明入定雨华动地。若无内心渴仰欲闻之心。佛不得说法华也。又上入定动地雨华是其外缘。今渴仰欲闻之心是内因。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>具足方得说教。问。上雨华动地已令众欢喜则是因竟。今云何更辨因耶。答。上虽生欢喜未知欲说大法。今睹佛放光现东方诸佛土事。必知应为我说于大法。是故渴仰欲闻名为因义成就也先示外事者第二正释。放光则是简前后二瑞不同</p><p>先为大众示现外事六种震动等次示现此法门中内证甚深微密法故雨华动地并为外事。佛亲自身放光智炬将辉。故身光前耀。故名内事。内证甚深微密法者。依方便品释则是无上菩提。今说佛所证无上菩提。亦令众生得于此法自解作佛也又依器世间下。此第三释出光中所现事</p><p>又依器世间众生世间。数种种无量种种具足烦恼差别具足清净差别佛法<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>差别示现三宝故复乘差别有世界有佛有世界无佛令众生见修行者未得果得道者已得果故于中略明十事。器世间者东方一万八千佛土也。众生世间者一万八千土中众生也。数种种者释明众生数种种不同也。量种种者明器世界形量不同也。具足烦恼差别者。释<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生不同也。六道不同皆由烦恼上中下差别故也。具足清净差别者。释清净世界差别不同也。佛法弟子差别示现三宝故者。佛东方万八千土中佛。法则是万八千土中佛所说法。弟子谓四众乃至菩萨。复乘差别者。四果为小乘菩萨为大乘。有世界有佛有世界无佛者。东方世界现在佛为有佛。又见诸佛般涅槃后以<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>起七宝塔名为无佛。令众生见者。上明现十事。此明令众生睹见十事。则释经中于此世界悉见之言也。修行者未得果下。上释未尽今重简之。凡释二事。初释四众修行也。未得果者修三学行未得四果。得道者已得四果如经下示所释处</p><p>如经诸修行得道者故数种种者。第二释前数种种示现</p><p>数种种者示现种种观故略说四种观一者食住二者闻法三者修行四者乐种种观者正释数种种。佛放光亦可观者见也。见彼东方菩萨等食及闻法。示现万八千土众生。种种观不同。故名数种种观也。略说四种观者。释种种观也。一者食亦可是禅悦为食。亦可是揣等四食。二明食竟闻法。三者闻法竟修行。四者修行得果为乐如经下第二亦示释处如经尔时佛放眉间白毫相光乃至以佛舍利起七宝塔故行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>者。第三料简前菩萨中种种信解乃至行菩萨道之言也</p><p>行菩萨道者教化众生依四摄取法方便摄取应知如经所说当自推取言四摄法摄取者。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>摄之。今背恶向善为己眷属爱语摄之。今发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>利行摄。令善根增长同事摄之。令其成佛。如经所说当自推取者。前释四众中修行得道者示经处。今释菩萨中行菩萨道不示经处。但云如经所说当自推取也。所以尔者前文略引之易。从后文广引之难也。故经云种种因缘种种信解种种相貌行菩萨道也。每欲示其存略。故出此言自此已下示现大众现前欲闻法成就。此释第六分经。就文为二。前牒章名</p><p>自此已下示现大众现前欲闻法成就问一人者已下。第二解大众疑有二。一者大众疑念。二者<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>发问。今具释此二也。大众疑念中有二。一弥勒疑念。今但释弥勒不释大众。弥勒疑念有三。一问佛何因缘故现瑞。二访决疑之人。三得袟弹之主。则但释初后二也。问。一人者文殊。应是第三释得袟弹之主。而在初则有此释者。斯论大宗明取文意而释经也。弥勒虽有三章之经而意在问于文殊。是故在前释问文殊意也。何故唯问文殊一人者。此是问也</p><p>问一人者问意云。何唯问文殊一人不问余人耶多人欲闻生希有心者。此则是答</p><p>多人欲闻生希有心是故唯问文殊师利如是示现世尊弟子随顺于法不相违故以多人欲闻文殊之答也。是故唯问文殊师利者。结问文殊意也。问。大众不知文殊是能答之人。云何乃言多人欲闻文殊之答。答。弥勒知大众机缘属在文殊。若闻文殊所说必生希有之心故也。如是示现世尊弟子随顺于法不相违故者。释文殊能答之意也。然弥勒位穷补处。遂不能知现瑞之意则唯佛能知。佛入三昧不可得问。虽文殊过去佛但今日示现为世尊弟子耳。故余经言。昔为能人师今作弟子化。二尊不出并故示为菩萨。随顺于法不相违者。此有二义。一者实是前师而示为弟子。盖是随顺于法无所相违。二者文殊能了达法相。不与法相相违故能答问也今佛世尊现神变相者。正释弥勒疑。初问现神变之意也。此初句牒经文</p><p>今佛世尊现神变相为何等义者。释弥勒疑念云以何因缘而有此瑞也。经云以何因缘。今云以何等义。义则是因缘。为现大相因故者。论主释弥勒疑则是答也。就文为二。初标现大相因二章门</p><p>为何等现义为现大相因故为大相已下。释二章门。初释为大相章门</p><p>为现大相者为说妙法莲华经故现大瑞相为欲说大法故。应谓为现大瑞相也为说如来所得妙法不可思议文句者。释上第二因章门</p><p>为说如来所得妙法不可思议等文字章句故以文句即是教教是理因故称为因。又因欲说法华经故现大瑞相。即法华经。故现大瑞相则法华为瑞相因也。详前后文具有三因。一法华教为理因。二法华为瑞相因。三因见瑞相故知说法华。故瑞相为法华因也有二种义所以仰推文殊者。此释第三正问文殊。就文为二。初释问文殊意。次释问文殊经文</p><p>有二种义是故仰推文殊师利何等为二一者现见诸法故二者离诸因缘唯自心成就彼法故问文殊意者。一者文殊是佛了了现见诸法。二者离诸因缘。离诸因缘者。以文殊非推度以类而知。成论云。现见事中因缘无用也。唯自心成就彼法者。释离因缘。以文殊自心明见彼事故。不假余因缘也示现种种瑞相者。第二释问文殊经文</p><p>示现种种瑞相者示现彼彼事故如彼事相现没住灭应知大众文云。必应见此希有之相故。今将示现种种瑞相。此出文殊过去曾见诸佛种种瑞相也。彼彼事者。过去诸佛种种瑞相有为事也。如彼瑞相现没住灭应知者。过去诸佛有现在者有没者有住者有灭尽者。应知者令大众知过去如斯等事。故云应知以文殊能记彼事故。此释经文已曾亲近供养过去无数诸佛之言也。更明文殊有二之义。一者得陀罗尼能记彼事故。二者文殊所作成就因果。成就能现见彼法故。前列二成就章门</p><p>以文殊师利能记彼事故以文殊师利所作成就因果成就现见彼法故所作成就下。释二章门。功德成就智慧成就。释所作章门</p><p>所作成就者有二种一者功德成就二者智慧成就因成就下。释因果章门。前释因。次释果</p><p>因成就者一切智成就又缘因成就者众相具足也释因中有二因。一正因。二缘因。正因者谓一切智。以因一切智能见过去世事相也。又缘因成就谓众相者。释第二缘因也。言众相者。谓动地雨华放光名为众相。由见过去世佛现于众相故现大法。今见释迦现众相亦说大法。故众相为说法之因也果相成就者释第二果相章门</p><p>果成就者说大法也因一切智及瑞相故知欲说大法。故为众相之果种种佛土者。自上已来释弥勒疑念竟。今第二释弥勒发问。大众中问有二章。一问意。二正问。今但释正问不释问意。正问中有二。一长行。二偈颂。今具释二也。释长行中有二。一正释。二举经示释处。正释有二。一释现瑞。二释睹瑞</p><p>种种佛国土者示现彼佛国土中种种差别应知种种佛土者。则释一万八千佛土也。示现彼国土中种种差别应知者。此有二意。一者示万八千土种种差别。二者示现万八千土中十事差别。如前所释净妙国土者。第二释睹瑞</p><p>净妙国土者谓无烦恼众生住处故即释经中悉见彼佛国界<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>文也。二者上通万八千土。今别释<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>如经下第二示释经处</p><p>如经照于东方万八千世界乃至悉见彼佛国界庄严故照于东方万八千世界。示初段所释经处。乃至悉见示第二都瑞经处如来为上首第二释偈。亦开为二。初释偈。二示经处</p><p>如来为上首者诸菩萨等依如来住故以彼如来于彼国土诸大众中得自在故如来为上首者。牒经又睹诸佛圣主师子文也。如来已为众圣之主。故称上首也。诸菩萨等依如来住故者。菩萨有依佛得住于理。故佛为菩萨上首。以彼如来下释师子之言也。以佛于大众中自在。故云师子。问。何故不释偈初文。答。长行已释。故不复释也。问。何故但释为上首等二句。答。此二摄下一切经尽。以佛为上首一切菩萨及二乘众依佛得住理。又佛于一切大小众中自在能化大小等众。下一切经不出斯二事。是以但释二也如经下第二引经云释处</p><p>如经又见彼土现在诸佛如是等故自此已下释第七文殊答问分。就文为二。初总明文殊有能答之德。次别释出经所答之事</p><p>自此已下明圣者文殊师利菩萨以<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智以宿命智者则是能答之德现见已下出所见之事。就文又二。初列三门。次释三门。言三门者一过去因相。二果相。三成就十种事</p><p>现见过去因相果相成就十种事如现在前是故能答弥勒菩萨现见过去因相者下。释三章门。则为三别</p><p>现见过去因相者文殊师利自见己身曾于彼诸佛国土中修种种行事故妙光之前未能为众说法华名为因相现见果相者。释第二章门</p><p>现见过去果相者文殊师利自见己身是过去世妙光菩萨于彼佛所闻此法门为众生说故从妙光闻法华经为众说此称为果相。问。此因果相释何处经文。答。从初语弥勒竟惟忖之言也成就十种事者。释第三章门。就文有二。初标列十种成就。则是标章门</p><p>成就十种事者何等为十一者现见大义因成就二者现见世间文字章句甚深意因成就三者现见希有因成就四者现见胜妙因成就五者现见受用大因成就六者现见摄取一切诸佛转法轮因成就七者现见善坚实如来法轮因成就八者现见能进入因成就九者现见忆念因成就十者现见自身所迳事因成就从大义因成就者。第二释十种章门。则成十数。言大义因成就者。即释经欲说大法之言。故称为大。此大甚深所以名之为义。因则是因缘。欲说八种甚深义之因缘。故现斯瑞。就文又二。初标章牒经</p><p>大义因成就者第二释章经。初又三。初标章总明八句劝知</p><p>八句示现应知从一者欲论大法已下。第二牒经八事</p><p>一者欲论大法二者欲雨大法雨三者欲击大法鼓四者欲建大法幢五者欲燃大法灯六者欲吹大法螺七者欲不断大法鼓八者欲说大法此八句示现已下。第三论主总释</p><p>此八句欲示现如来欲论大法等故何者名为八种大义下。第二释章解经。经无三句。论但有八句也</p><p>何者名为八种大义谓有疑者为断疑故已断疑者增长淳熟彼智身故根淳熟者为说二种微密境界一谓声闻密境界二谓菩萨密境界大法鼓者二句示现以远闻故入密境界者令进取上上清净义故取上上清净义者取一切智现见故令彼进取一切种智得现见者为一切法建立名字章句义故建立名字章句义令入不可说证智转法轮故谓有疑者为断疑故者。此释第一欲论大法。则是无论经欲说大法。自古至今不依论释经者。但案文前后意释此一章经。依天亲释意者就位从浅至深释也。自四十余年旧疑及闻法华新生疑等。欲说大法断此新旧二疑也。故下文殊偈末云。诸求三乘人若有疑悔者。佛当为除断令尽无有余也。已断疑者憎长淳熟彼智身故者。释第二雨大法雨。世间之雨能令物增长成就。一乘法雨令三乘人并入平等大慧。如身子领解中云疑悔永已断安住实智中。根淳熟者为说二种微密境界。释第三欲击大法鼓及第七不断大法鼓也。前已明三乘人智身淳熟。今次授三乘人作佛名记。密境界智度论云。法华经令二乘作佛名秘密法。秘密法者甚深难解故也。又四十余年不明此事。故称密。大法鼓者二句示现者。一是击大法鼓。二是不断大法鼓也。以远闻故者正释法鼓之名。夫击大法鼓令人远闻。今就大法并授三乘人记。令十方远闻。问。何故云不断法鼓。答。夫二乘独善竟无传化。若得受记成佛竟更传化余人亦令成佛。故云不断法鼓也。入密境界者令进取上上清净义故者。释第四欲建大法幢。三乘已得受记。然后行菩萨行。菩萨行远离二边。是中道行故称上上清净。在幢已二门高。故称上上清净义。取清净义者令进取一切种智得现见故者。释第五欲燃大法灯。夫灯有二义。一者破闇。二者显物。令三乘人行行已满破无明闇得一切种智。故能见佛性等法。前之四句令三乘人因行成。今此一句令三乘人果德满。取一切智见者。释第六句欲吹大法蠡。夫吹蠡出语言音声。三乘人得佛果竟更为众生说一切教。故云为一切法建立名字章句也。建立名字章句义者。释第八欲说大法。前第七成佛竟为物演教。今第八说教令悟理。入于理亦得成佛。问。何故云入不可说证智转法轮。答曰。令物得证真实智。时则内外并冥缘观俱寂名不可说。则此智体名为法轮。从彼至此故称为转。今更总释八句。佛说法华凡有二意。一令众生自得作佛。二令众生化他亦使成佛。前六句则是自行。后二句名为化他。此二各两自行中五句辨因一句论果。化他中初句为物演教。次句令物证入。问。何故说法令自行化他。答。二乘之人唯能独善。今已成佛竟化众生亦令成佛也。就五句为二。初句断疑令其惑灭。次四句令其解生。开二。初句十信至十解成就。次句解行纯熟入密境界。故得受记从十行至十<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>。上上清净义从初地乃至十地现见世间名字章句意甚深因成就者。释十章第二。前牒章名</p><p>现见世间名字章句意甚深因成就者如经下示释经处</p><p>如经我于过去诸佛曾见此瑞乃至故现斯瑞故问。名字章句意甚深。正释何处经文。答。释欲令众生咸得闻知一切世间难信之法经文也。夫令三乘作佛正是难信之事。五千起去则难解之事。问。何故云名字章句意甚深。答。夫教为显所诠之理。绝言。诠理之言亦绝。故下云。是法不可示。言辞相寂灭也现见希有因成就者。释第三章经。前牒章</p><p>现见希有因成就者以无量时下释章。前释次举经示释处</p><p>以无量时不可得故不可思议不可称不可量者示现过彼阿僧祇劫不可得故复示现五种劫一者夜二者昼三者月四者时五者年示现彼无量无边劫故释中为二。一者明阿僧祇劫不可说。二者明时不可说。阿僧祇劫不可说者。以有无量阿僧祇故也。复示现五种劫者。此第二明时不可说也。问。昼夜等云何亦名劫。答。外国称劫簸。此翻为分别时节。故劫是时之通名也。但经中取天地始终者。立其通称名为之劫。日月昼夜受其别名。问。章名中何故云现见希有因成就。答。以过去久远时方有说法华之事故名希有如经已下第二示释处</p><p>如经如过去无量无边不可思议阿僧祇劫尔时有<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>日月灯明乃至得阿耨多罗三藐三菩提成就一切种智故此但取经过去无量无边劫示释处。从尔时有佛号日月灯明下。并不释也现见胜妙因成就者。释第四。前牒名</p><p>现见胜妙因成就者言胜妙因者。二万亿佛说法皆七善文为胜妙以诸佛菩萨自受用示现故者。第二解释。前释次示经处</p><p>以诸佛菩萨自受用示现故佛受用七善化物。菩萨亦然。故云受用如经下示经处</p><p>如经次复有佛亦名日月灯明乃至所可说法初中后善故此但取后所可说法初中后善不取前文也。以二万佛说法门具七善故云所可说法初中后善。所以一处合释之也现见受用大因成就者。释第五。前牒章名</p><p>现见受用大因成就者受用大因者。释王子未出家时受胜妙乐。乃至释大众六十劫听法华经受于法乐不生疲倦。故名现见受用大因成就也是时王子第二解释</p><p>是时王子受胜妙乐各舍出家复彼大众于尔许时不生疲倦心故易知如经下示释处</p><p>如经其最后佛未出家时乃至佛授记已便于中夜人无余涅槃故现见摄取一切诸佛转法轮因成就者。第六前牒章名。上来五章明佛化行事竟。四章属能化益物。次一明所化益物。今辨菩萨佛灭度后弘经。即是转法轮不断事</p><p>现见摄取一切诸佛转法轮因成就者言一切佛者。现见一切佛转之于前。菩萨于佛灭后敷之不绝。即令一切佛法转不绝。故言一切也</p><p>法轮不断故如经佛灭度后妙光菩萨持妙法莲华经满八十小劫为人演说故释及列经易知现见善坚实如来法轮因成就者。释第七前牒章名</p><p>现见善坚实如来法轮因成就者而言善坚实如来法轮者。妙光从八十劫已后乃至令八子坚固无上菩提已无量时就。法轮不坏名为善坚实如来法轮</p><p>佛灭度后无量时说故如经日月灯明佛八子皆师妙光乃至皆令其坚固阿耨多罗三藐三菩提故释及列经易知现见进入因成就者。此释八。上第七明妙光能化事。今明八子闻法得益。即是进入因成就也</p><p>现见进入因成就者彼诸王子得大菩提故如经是诸王子乃至皆成佛道故释及列经易知现见忆念因成就者。释第九明妙光忆念</p><p>现见忆念因成就者过去化王子皆得成佛。故名忆念因成就</p><p>为他说法利益他故如经其最后成佛者名曰然灯乃至尊重赞叹故如经者不正释经文。但释经意。明忆念过去化八子成佛。后忆念燃灯化释迦成佛乃至弥勒成佛也现见自身所迳事因成就者。释第十明文殊忆念</p><p>现见自身所迳事因成就者过去为妙光能悟解法华。复能为人演说。即是自身受胜妙乐</p><p>以文殊自身受胜妙乐故如经弥勒当知乃至佛所护念故汝号求名者示现知彼过去事故复示现得彼法具足故如经者下但妙光菩萨岂异。我身是也。直释此一句。汝号求名者。别释知弥勒事。二句。初释弥</p></div>"
}]