[{
    "title": "菩萨戒本疏 第1814部",
    "author": "义寂大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p><a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>本疏 卷上</p><p>重刻菩萨戒本疏序</p><p>梵网经菩萨戒本者。盖三世出兴之鸿规。七众入位之要门也。以故注疏节分殆十有余家。今之存者唯法藏天台明旷太贤也已。余皆成废典。於戏可惜矣。四家之述作兰菊擅美。即世戒子多附贤师也。然彼疏中往往引法藏义寂两疏证义解文。不倦周览之学士不往窥之者盖鲜矣。但恨藏疏虽存寂疏已亡也。予尝就洛东禅林<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>偶拜遗帙。世淹蠹灭不少。传数写脱亦伙焉。访全本于遐迩。无敢报之者。叹息星霜于此。城北有宏源法师者。久传此疏秘为家宝。一时读予之蠹本为补遗文。于兹肇得全本矣。他日剞劂氏袖彼蠹本来曰。子幸补之。我其寿梓。予喜广厥传遂加修补也。密严辨律师寻播旁训。参订诸本以与剞劂氏书成乞序。予<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>之余忘揣鄙陋。辄尔记其始末以赘疏首矣。庶几<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>无壅远传龙华云尔</p><p>旹</p><p>贞享初元龙次甲子季夏布萨之日菩萨戒<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>洞空钦识双丘知足庵</p><p>新罗沙门义寂述</p><p>夫戒德之本道之所由生。所以兴觉种绍隆<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。绝长流登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。[打-丁+升]济含识者。罔弗由兹矣。故如来先在道树。初制菩萨波罗提木叉。寔乃寂累脱缚之基。修因<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>之本。既名制止。无众恶而不截。又称<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>。无诸善而不集。提纲则十支无尽。总目则六八靡漏。照明觉道譬乎日月。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>法身喻之璎珞。兴建之<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>难兴显。但此戒经文义深隐。宜造解释。由致难了。故先科简略标旨归。戒法无量要唯受随。受则业本初畅纳法在身。随则持心后起显缘防护。先辨受有二。初明顺缘得受。后显违缘失受。辨得有四。一简资器。二简师德。三受之方轨。四问答遣疑。初简器者。要具二缘堪为<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>之器。一有感戒之善。二无障戒之恶。感戒之善凡有二种。一菩萨种姓。二发<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>愿。菩萨地云。住无种姓补特伽罗无种姓。故虽有<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>及行加行。定不堪任<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无上正等菩提。若不发心不修加行。虽有堪任。而不速证无上菩提。与此相违当知速证。由此具二方得感戒。故受法中问彼二缘。有说。具三方得感戒。一有胜种姓。二有胜期愿。三有胜行心。初二如前。第三胜行略有十种。一于无上菩提能生深心。二能尽寿离恶知识近善知识。三能尽寿悔过随喜劝请回。向增长佛道。四能尽寿随其力能<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a><a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。五能尽寿读诵书写方等正典为人解说。六能于孤独穷苦若犯王罪。随力救护乃至一念生悲心。七能尽寿舍于<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>发起<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>勤求佛道。八于五尘中生<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>时。能寻制伏。九若于无上菩提生厌退心。于小法中生贪着时。寻除灭。十能舍于一切所有不惜身命。此三即是菩萨三持。胜姓为堪任持。胜愿为行加行持。胜行为大菩提持。前所引文即此证也。故具此三方得感戒。将欲受时。义须具问难。大本中无问第三。而别法中具问三故。胜种姓者。谓具菩萨本性习成。二种种姓广说如论。<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>者。谓于无上果起必<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>心。于一切有情起必救济愿。于此二事发坚固意。更无余缘夺之令转。又察自身含性同佛。而由内外<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>阙故。无始<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>至于今身。未曾一时发胜志愿。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a><a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>出离无日。今若一念发勇猛心。三祇虽长证必有期。悲前喜后汗流泪连。不顾身命作决定誓。生死无边。我必断。群生无数。我必济。愿行无量。我必修。<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>无尽。我必证。如是名为发心相也。障戒恶者不出三障。一烦恼障。二<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。三报障。烦恼障者。菩萨地云。何等名为种姓菩萨自<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>违四随烦恼。谓放逸者。由先串习诸烦恼故。性成猛利长时烦恼。是名第一。又愚痴者。不善巧者依附恶友。是名第二。又为尊长夫主王贼及怨敌等所拘逼者。不得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>其心迷乱。是名第三。又资生有匮乏者顾恋身命。是名第四。论既说此为自法障理。亦应障受戒善也。然受法中不别问者。不决定故。非如七遮定不得戒。业障者有二种。一七逆。二十重。七逆者。一出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。二杀父。三杀母。四杀和上。五杀阿阇梨。六破羯磨转法轮僧。七杀<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。此七别相至文当显。文云。若具七遮即身不得戒。余一切人得受戒。有云。七逆不忏不得受。若忏亦得受。故集法悦经云。遮他陀犯五逆罪为王所掉。是时惊怖即作沙门。在于他国<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>十善坐<a href=\"/remen/chanxue.html\" class=\"keylink\" target=\"_blank\">禅学</a>道。昼夜泣泪经三十年。以五逆罪障故心不得定。于山窟中常举声哭。苦哉苦哉。当以何心去此苦也。彼于一时将欲乞食。悲叹下窟出诣村。时道中得一大钵。钵中见有集法悦舍苦陀罗尼。得此经已。即不乞食欢欣还窟。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a><a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>悲泪叹仰。窟中修习读诵是经。经一年已始得灭罪。以业障故不能得入心。是时即洗浴修行经七日。如童子初学慎不小使。行于七日如是慎无异。心中愁恼不知云何意。故思此陀罗尼字书。经于数反心中忽定。时自欣悦。如人地得百千斤金人无知者。内悦不止。修行数年。飞行无碍。睹见十方三世诸佛。故知逆罪亦得悔灭。虽有此说未为诚证。此经直说经力灭罪。不说得受菩萨戒。故应更详本。十重者。有云。十中前四既是根本性罪事同七逆。现身有此悔与不悔皆悉是障。余六重者。若悔非障。不悔则障。然经文犯十重者<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>得相便得受戒。不尔不得者。此是总语意在后六。有云。前四业重。须悔见相便得受。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>不得戒。后六业轻。虽不忏悔亦得受也。十重须悔者。此是总语意在前四。有云。现犯十重不悔悉是障。若悔皆得受。文无简别。何假曲寻。旧说如此。更有别意。至文当显也。报障者。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>饿鬼及畜生中不解语者。以重苦故不相领。故理无得受。又人趣中北洲余类禀性顽嚚不解<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。志意劣弱无刚决心。如是等类亦为受障。而问遮中不别举者。地狱等相显无滥。不须问。顽嚚等者问愿中简。又依本业经。六趣皆得受。故彼经云。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>受得戒。但解语得戒不失。当知地狱有轻有重。重者不得。轻亦得受。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>中欲色亡言。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>者显则不说。蜜亦无遮。又准在家菩萨受近事戒。更有遮难。应须问答。故受法云。是时<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>应作是言。汝父母妻子奴婢国主听不。若言听者。复应问言。汝不曾负<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧物及他物耶。若言不负。复应问言。汝今身中将无内外身心病耶。若言无者。复应问言。汝不于比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>所作非法耶。如是等事亦是戒障。故须问除简。师德者。要具<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>方堪为师授菩萨戒。一同法菩萨。简异二乘。二已发大愿。简未发心。三有智有力。谓于文义能解能持。四于语表义能授能开。谓言语辩了<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>授人开心令解。又什法师云。具足五德应当为师。一坚持净戒。二年满十腊。三善解<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>。四妙通禅思。五慧藏穷玄。又菩萨地云。又诸菩萨不从一切离听慧者求受菩萨所受净戒。无净信者。不应从受。谓于如是所受净戒。初无信解不能趣入不善思惟。有悭贪者。悭贪弊者。有大欲者。无喜足者。不应从受。毁净戒者。于诸学处无恭敬者。于<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>仪有慢缓者。不应从受。有忿恨者。多不忍者。于他违犯不堪耐者。不应从受。有懒惰者。有懈怠者。多分耽着日夜睡乐倚乐卧乐。好合徒侣乐喜谈者。不应从受。心散乱者。下至不能构牛乳顷<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>一缘住修习者。不应从受。有闇昧者。愚痴类者。极劣心者。诽谤菩萨索怛揽藏及菩萨藏摩怛履迦者。不应从受。此文意者。远离不信及六弊障。具足净信及<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>者。方堪为师。然则受授菩萨戒者。具器为资不易。备德为师甚难。若得能所相会。受授两俱<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>。绍隆觉种扶疏道树。可得有日期矣。受戒方轨略有六门。一显德劝受。二对缘优劣。三七众总别。四大小先后。五正明受法。六校量显胜。显德劝受者。文云。众生受佛戒。即入诸佛位位同大觉。已真是诸<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。本业经云。入三宝海以信为本。住在佛家以戒为本。始行菩萨若男若女初发心<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>欲绍菩萨位者。当先受正法戒。戒者。是一切行功德藏根本。正向佛果道一切行本。是戒能除一切大恶七见六着。正法明镜。又云。佛子受十无尽戒已。其受者过度四魔越三界苦。从生至生不失此戒。常随行人乃至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。若过去未来现在一切众生不受是菩萨戒者。不名有情识者。畜生无异。不名为人。常离三宝海。非菩萨非男非女非鬼非人。名为畜生。名为邪见。名为外道。不近人情。故知菩萨戒有受法而无舍法。有犯不失尽未来际。又复法师能于一切国土中。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>一人出家受菩萨戒者。此法师其福胜造八万四千塔。况复二人三人乃至百千。福果不可称量。其师者。夫妇六亲得互为师授。其受戒者入诸佛界菩萨数中。超过三劫生死之苦。是故应受。有而犯者胜无不犯。有犯名菩萨。无犯名外道。对缘优劣者经云。受戒有三种。一者诸佛菩萨现在前受得真实上品戒。二者诸佛菩萨灭度后。千里内有先受戒菩萨者。请为法师教授我戒。我先礼足。应如是语。请大尊者为师授与我戒。其弟子得正法戒。是中品戒。三者佛灭度后。千里内无法师之时。应在诸佛菩萨形像前胡跪合掌自誓受戒。应如是言。我某甲白十方佛及大地菩萨等。我学一切菩萨戒者。是下品戒。第二第三亦如是说。佛子是三种受戒过去佛已说。未来佛当说。现在佛今说。过去诸菩萨已学。未来诸菩萨当学。现在诸菩萨今学。是诸佛正法戒。若一切佛一切菩萨不入此法戒门。得无上<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a><a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>平等地者。无有是处。七众总别者。三种戒中摄善摄生道俗相多同。摄<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒七众仪各异。今就律仪辨其总别。受律仪戒方轨有二。一与余二总受。二与余二别受。总受方轨七众无别。并牒三戒而总受故。故一羯磨通彼七众。至于随相所持各异。地持受法正就此也。若别受者七众法异。若俗二众受其<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。至于随相。又说六重二十八轻。具如善生优婆塞经。道中具足二众受法。依白羯磨从十众等。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。受世教戒者白四羯磨然后乃得。正就此也。下之三众各随其法法同声闻。大小先后者。于中有二。一先小后大。二先大后小。若先受小后受大者。前小乘戒为舍为在。又不杀等与声闻同。为更新得为即前戒。一云。若回心时小转成大。故前小戒不舍而在。而不可名为小乘戒。以回心故共声闻戒更不新增。若不共戒受时新得。二云。回心新受时。虽不舍前。而由期心异更增离杀等。如受具足时。更得离杀等。先大后小者。若退大入小即失大戒。若不退大随学小者不失前大。虽受声闻戒。不名为小乘人也。正受方法者。依菩萨地。方轨有八。一请师。文云。若诸菩萨欲于如是菩萨所学三种戒藏勤修学者。或是在家或是出家。先于无上正等菩提发弘愿已。当审访求同法菩萨已发大愿有智有力于语表义能授能开。于如是等功德具足胜菩萨所。先礼双足。如是请言。我今欲于善男子所或长老所或大德所。乞受菩萨净戒。唯愿须臾不辞劳倦。哀愍听授。二求力。文云。既作如是无倒请已偏袒右肩。恭敬供养十方三世诸佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>已入大地得大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>得大神力诸菩萨众。现前专念彼诸功德。三乞戒。文云。随其所有功能因力。生殷净心戒小净心。有智有力胜菩萨所谦下恭敬。膝轮据地或蹲跪坐。对佛像前作如是请。唯愿大德或言长老或善男子。哀愍授我菩萨净戒。四长养净心。文云。如是请已专念一境长养净心。我今不久当得无尽无量无上功德藏。即随思惟如是事已默然而住。五问缘。尔时有智有力菩萨于彼能行正行菩萨。以无乱心若坐若立而作是言。汝如是名善男子听。或法弟听。汝是菩萨不。彼应答言是。发菩提愿未。应答言已发。六正受。自此已后应作是言。汝如是名善男子戒法弟。欲于我所受诸菩萨一切学处受诸菩萨一切净戒。谓律仪戒摄善法戒<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情戒。如是学处如是净戒。过去一切菩萨已具。未来一切菩萨当具。普于十方现在一切菩萨今具。于是学处于是净戒。过去一切菩萨已学。未来一切菩萨当学。现在一切菩萨今学。汝能受不。答言能受。授菩萨第二第三亦如是说。能受菩萨第二第三亦如是答。能授菩萨作如是问。乃第三授净戒已。能受菩萨作如是答。乃至第三受净戒已。七启白请证。广如彼文。八礼退。文云。如是已作受菩萨戒羯磨等事。授受菩萨俱起供养。普于十方无边际诸世界中诸佛菩萨。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>双足恭敬而退。授戒方轨众师非一。且依地持。略述如是。诸说有不同。当寻诸本。校量显胜者。如是菩萨所受律仪戒。于余一切所受律仪戒最胜无上。无量无边大功德藏之所随逐。第一最上菩提心意乐之所发起。普能对治于一切有情一切种恶行。一切别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>律仪。于此菩萨律仪戒。百分不及一。千分不及一。数计算喻邬波尼杀昙分亦不及一。摄受一切大功德。问答遣疑者。问声闻受法中不问种姓与愿。何故此中问此二事。答别解脱戒三乘通受。受法虽一随愿通成。由是不应偏问一姓。亦不应总问有三姓不。未必审知随一姓。故既不问姓。问愿亦废。但使无遮难。通望三乘。得后随修行各成果故。问三障皆障戒云何偏问业。答夫问难者必兼两义。一决定为障。二相中有滥。业中七逆具斯两义。一定为障。其过重故。二相有滥。无别标故。四随烦恼非定为障。地狱等无滥。相别可识故。惑报不须问也。问具四五德方堪为师。何故经许夫妇互师。答受在家戒或可如经。出家五众必须具德。问有人言。必先受声闻戒后受菩萨戒。是义云何。答未必然也。何容菩萨必先起小心然后入大乘。然经说云。若言不受优婆塞戒<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>戒<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>得菩萨戒。无有是处。譬如重楼不由初级得第二级。无有是处者。要由律仪为依止故。方得后二。故作是说。自余问答不复更显。违缘失受者。菩萨地云。略由二缘舍诸菩萨净戒律仪。一者弃舍无上正等菩提大愿。二者现行上品缠犯他胜处法。决择分云。又舍因缘略有四种。一者决定发起受心不同分心。二者若于有所识别大丈夫前。故意发起弃舍语言。三者总别毁犯四种他所胜法。四者若以增上品缠。总别毁犯随顺四种他所胜法。由此因缘当知弃舍菩萨律仪。若有还得清净受心。复应还受。问二四舍缘得相摄不。答。一云。得相摄。数有开合体无别故。四中前二分二中初。后二类于二中第二。是故二四得互相摄。有云。不然。不同分心可得摄初缘。发言弃舍云何初缘收。对人弃舍时未必退愿故。谓有先受苾刍等戒复遇因缘舍。作勤策等时。虽不弃舍菩提大愿。而得弃舍先所受故。若不尔者。既舍愿时已得舍戒。何须对人发弃舍言。设便退愿时即发言弃舍。则不应别分为二缘。又四中第四应摄二中后。同说增上缠毁犯他胜故。四中第三不得增上。云何得摄二中后缘。又何者是他胜。何者顺他胜。而言第二摄后二耶。若言第三犯他胜者即本地说四种他胜。第四毁犯顺他胜者即十重中前六重者。本地中云。四种他胜要上缠犯方得舍戒。云何第三缘唯云总别犯。故知四中三非二缘所收。若尔何者是。谓犯杀等前四重时。不待上缠随犯皆舍。若犯后四或后六时。要起上缠方得舍戒。后四或六非性重。故唯于菩萨名重。非余。前四反前。故于一切名重。后四或六虽非性重。顺性重故名随他胜。问如上所引。本业经云。菩萨戒有受法而无舍法。有犯不失。尽未来际。何故论云二四缘舍。此说岂不达经言耶。答约义各别。故不相违。是义云何。言失戒者。舍要期思所薰种上运运增上防摄功能。若论种体。一薰永在。若言功能。或违缘失。以体从功故论言舍戒。以能从体故经云不失。故彼经云。一切菩萨凡圣戒尽心为体。是故心尽戒亦尽。心无尽故戒亦无尽。问若尔声闻戒五缘应不失。答据体实应然。但佛为彼声闻教中。多就功能说戒是色。是故不说永在不失。声闻所受五缘舍者。一命终舍。二二形舍。三断善根舍。四作法舍。五犯重舍。菩萨所受期尽未来际。是故无有命终时舍。二形亦许受菩萨戒。是故无有二形生舍。起不同心便失戒。故不待断善方舍。辨受体讫。又次明随行。随行有二。若上品人从初受后乃至菩提。一向专精无有毁犯。若中下人随缘戒犯。而忆本受犯已还净。此二皆得名随学戒。总说虽然。于中更就三戒别显随相。律仪戒中随行相者。如经中说。成就尸罗善能防护别解脱律仪。轨则所行皆悉圆满。见微细罪生大怖畏。于诸学处善能受学。成就尸罗者。能护净尸罗故。谓<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>净戒相应无缺。故名成就尸罗。善能防护别解脱律仪者。能善护持出离尸罗故。谓为求解脱别别防护所有律仪故名别解脱律仪。由此律仪能速出离生死苦故。轨则所行皆悉圆满者。具净尸罗难为毁责故。轨则圆满者。诸威仪等非聪慧人所呵责故。所行圆满者。远离五种诸比丘众所不行处故。何等为五。谓倡令家淫女家酤酒家王家旃荼罗羯耻那家。见微细罪生大怖畏者。勇猛恭敬所学尸罗故。于遮罪中勇猛恭敬修学护持。犹如性罪。是名见微细罪生大怖畏。于诸学处善能受学者。圆满受学所学尸罗故。谓具足圆满受学学处。是名于诸学所善能受学。摄善法戒随学相者。谓诸菩萨于摄善法戒勤修习时。略于六心应善观察。何等为六。一轻蔑心。二懈怠俱行心。三有覆弊心。四勤劳倦心。五病随行心。六障随行心。若诸菩萨于善法中所有轻心无胜解心及陵蔑心。名轻蔑心。若有懒情憍醉放逸所缠绕心。名懈怠俱行心。若贪欲等随有一盖或诸烦恼及随烦恼所缠绕心。名有覆弊心。若住勇猛增上精进身疲心倦映弊其心。名勤劳倦心。若有诸病损恼其心。无有力能不堪修行。名病随行心。若有喜乐谈论等障随逐其心。名障随行心。菩萨于此六种心中应正观察。我于如是六种心中。为有随一现前耶。为无有耶。于前三心。菩萨一向不应生起。设已生起。不应忍受。若有忍受而不弃舍。遍于一切皆名有罪。勤劳倦心现在前时。由此心故舍善方便。若为暂息身心疲恼当于善法多修习者。当知无罪。若于一切毕竟舍离。谓我何用精勤修习如是善法。令我现在安住此苦。若如是者。当知有罪。病随行心现在前时。于此无有自在。不随所欲修善加行。虽复忍受。而无有罪。障随行心现在前时。若不随欲堕在其中。或观此中有大义利。虽复忍受。而无有罪。若随所欲故入其中。或观是中无有义利。或少义利而故忍受。当知有罪。如是六心前三生已而忍受者一向有罪。病随行心虽复忍受一向无罪。余之二心若生起已而忍受者或是有罪。或是无罪。摄众生戒随学相者。若诸菩萨于作有情利益戒中勤修习时。当正观察六处支摄行。所谓自他财衰财盛法衰法盛是名六处。言财衰者。谓衣食等未得不得得已断坏。与此相违当知财盛。言法衰者。谓越所学于先未闻胜义所摄如来所说微妙法句。不得听闻。如不听闻先所未闻。如是于先所未思惟不得思惟。有听闻障有思惟障。设得闻思寻复忘失。于所未证修所成善而未能证。设证还退。与此相违当知法盛。此中菩萨作自法衰令他财盛。此不应为。如令财盛。法盛亦尔。此中义者。越学所摄及能随顺越学所摄。或于证法退失所摄。当知法衰。又诸菩萨作自财衰令他财盛。若此财盛不引法衰。此则应为。若引法衰。此不应为。如令财盛。法盛亦尔。又诸菩萨作自财盛令他财盛。此则应为。如令财盛。法盛亦尔。又诸菩萨作自法盛令他财盛。此则应为。如令财盛。法盛亦尔。于如是事若不修行名为有罪。若正修行是名无罪(此中律仪文钞对法。余二戒文钞瑜伽七十五卷)。又七十五云。若有于此三种所受菩萨戒中随有所阙。当知非护当言不护。菩萨律仪不当言护。此三种戒由律仪戒之所摄持令其和合。若能于此精勤修护。亦能精勤守护余二。若有于此不能守护。亦于余二不能守护。是故若有毁律仪名毁一切。菩萨律仪并随略说。戒之宗趣其义粗尔。次体相者。体谓戒之<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>即表无表。三业为体。不同声闻唯制七支。三业十支戒各有表无表。广辨业相当详论。相者。戒之种类。谓十重四十八轻。余教出没如理应寻。过事重者。制为重戒。反上为轻。问此经中既说十重。何故善生唯辨前六。菩萨地中唯说后四。答此经中通就七众共所持。故具说十重。善生别约在家二众。故唯前六判为重戒。酤酒说过于在家众罪偏重故。故性重上增二为六。后四于俗过微轻。故于在家众不制为重。准此后四于出家众其过遍重。五六于道其过还轻。是故地持遍说后四。又十中前四大小俱重。第五第六道俗俱重。后之四事唯菩萨重。于声闻中不制重。故唯出家重。于在家或不说重。故有二不共义。故地论遍说。又可佛鉴物机教非一途。当随器学。不当须会。方等二十四戒当更勘之。体相粗尔</p><p>大乘菩萨戒本次释题者。为显宗趣故题略名。为显体相故别广文。言大乘菩萨戒本者。若具存本名。应云梵网经卢舍那佛说菩萨十重四十八轻戒心地品第十。后人为单存戒本故。改云大乘菩萨戒本。先释本名。大本梵网经此地未翻。若翻应有一百二十卷六十一品。唯第十菩萨心地品什法师诵出。融公笔受。凡上下二卷。上卷说菩萨阶位。下卷明菩萨戒法。所以大本名梵网经者。梵网谓梵王网。如因陀罗网。其义相似佛观法门。随机无量其理一统。如梵王网孔虽无量其网唯一。故从喻事名梵网也。此是一部通名。若就戒本释梵网者。如梵王网孔多网一。法王戒法当知亦尔。虽复随事轻重多条。清净尸罗终归一道。是故从喻名曰梵网。又戒为梵行。亦是法网。故云梵网。如云天网恢恢疎而不漏。戒法亦尔。摄诸众生不漏生死故。经说云。张大教网亘生死流。漉人天龙置<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>岸。盖斯谓也。卢舍那佛说者。标教主也。卢舍那此云净满。障垢无不净。众德无不满。故云净满也。上卷心地舍那自说。今此戒本释迦所说。推功在本故云彼说。菩萨十重四十八轻戒者。二百五<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>通三乘。此五十八唯制菩萨。简通取别故标菩萨。十事根本。犯失戒。故制重名。六八枝条。唯垢心行。故立轻称。孝顺制止故称为戒。所言大乘菩萨戒本者。今此十重四十八轻。约法则唯大乘所制。就人则唯菩萨所持。戒本者。今此戒经为戒行本也。又此戒行是菩提本。如经云。戒此无上菩提本。应当一心持净戒。又此略说为广本也</p><p>次随文释者。此经既是抄出无如是等三分。然就文中不无序等。从初至皆名第一清净者为序说。佛告诸佛子至是四十八轻戒三世菩萨已当今诵为正说。余残为流通。初序中有二。初偈颂为劝信序。余长行文为结戒序。所以就二为序者。本业经云。入三宝海以信为本。住在佛家以戒为本。信戒为入住之本故就之为序也。又信为受戒之本故先序信。戒是宗之所明故次序戒。劝信序中有十一行半。分为二意。初五行颂序教主本末。后六行半赞戒法劝受。初中复二。初二行半序现身本末。后二行半显说教本末。序现身本末中。初二句显台中之本体。次二句显华上之应身。次一颂显树下之化形。次半颂覆结本末。问此三重身于三身中当云何配。答异说云云。今述一释。卢舍那者义兼自他二受用身。所以知然。上卷云。吾百阿僧祇劫中修行心地得成卢舍那。故知通自受用。为千释迦所将微尘菩萨众说心地法。故知亦兼是他受用。此则对登地机所现身也。华上千释迦者。是<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>中变<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>也。所以知然。以华为器者非秽土相故。又无性摄论云。变化身百俱昵国各为主者。此是秽土中八相化身。即此所说百亿释迦。故知华上所现身者。非秽土中所现化身。又此偈中对新学云。是卢舍那诵我亦如是诵。故知非是对地上秽。此则应是对彼三贤菩萨所现身也。次百亿释迦者。即是秽土四天下中。为彼凡夫二乘及初发心菩萨所现身也。有人解云。十地经说。二地菩萨于一念间入千世界得见千佛。戒是二地之别行故。是故对彼二地菩萨现千佛身。二地菩萨正对千身之本卢舍那佛。其千释迦即一念间所现化身。或当如是。于理无爽</p><p>我今卢舍那方坐莲华台我今卢舍那者。此是谁言。即千释迦中一释迦言。指自本身故云为我。时非曾当正在今也。方坐者犹正坐也。莲华台者。即莲华中莲实所附处也。其量周围千三千界。此是座量非国土量。华严所说莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>世界者。即是所统之世界也。上有十二佛国土七世界性。九方亦尔。是卢舍那常转法轮处</p><p>周匝千华上复现千释迦周匝千华上复现千释迦者。谓卢舍那所坐莲华台。以千叶华周匝围绕。其一一华量等百亿。于兹华上现千释迦</p><p>一华百亿国一国一释迦各坐菩提树一时成佛道一华百亿国一国一释迦者。谓千华中一一华叶各有百亿四洲国土。亿者即是俱胝数也。百俱胝国为三千界。十百为千。十千为万。十万为落叉。十落叉为一度洛叉。十度洛叉为一俱胝。三千大千为百亿者。单千为小千。千小千为中千。中千即当一度洛叉。千中千为大千。大千即当百俱昵也。然新译者亿当洛叉。此是十万为亿数也。旧译论中亿当俱昵。此是千万为亿数也。若小乘说。一三千界有一释迦。唯此四天下阎浮提中有金刚座实身成道。余天下中无金刚座。非成道处。唯遣化身度可度耳。今大乘说。三千界中有百亿国。百亿国中皆有道树及金刚座。百亿释迦各为主。化此国释迦言。我是本身。余皆我化。余国释迦皆如是言。然则就末论本。百亿皆互为本。就本论末。皆是舍那化也</p><p>如是千百亿卢舍那本身如是千百亿者。谓千个百亿故云千百亿。非是双牒千及百亿。下千百亿皆如是释。卢舍那本身者示其本也。上卷经云。我已百阿僧祇劫修行心地。以之为因初舍凡夫。成等正觉号为卢舍那。住莲华台藏世界海。其台周遍有千叶。一叶一世界。为千世界我化为千释迦。据千世界复就一叶世界。复有百亿须弥山。百亿日月。百亿四天下。百亿南阎浮提。百亿菩萨释迦。坐百亿菩提树下。各说汝所闻菩提萨埵心地。其余九百九十九释迦各各现百亿释迦。亦复如是。千华上佛是吾化身。千百亿释迦是千释迦化身。吾为本原名为卢舍那佛</p><p>千百亿释迦各接微尘众俱来至我所听我诵佛戒<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>门则开是时千百亿还至本道场各坐菩提树诵我本师戒十重四十八说教本末中。初五句显本身说。即千释迦为百亿释迦所将众说。次五句示末身说。即百亿释迦为时众说。甘露门则开者。涅槃之法一飡永存故云甘露。由戒能入故称为门。今说故则开也。还至本道场者。百亿国土各是当分化境。故名本道场。本师戒者。诸佛以戒为本师</p><p>戒如明日月亦如璎珞珠微尘菩萨众由是成正觉是卢舍那诵我亦如是诵汝新学菩萨顶戴受持戒受持是戒已转授诸菩萨谛听我正诵佛法中戒藏波罗提木叉大众心谛信汝是当成佛我是已成佛常作如是信戒品已具足一切有心者皆应摄佛戒众生受佛戒即入诸佛位位同大觉已真是诸佛子大众皆恭敬至心听我诵赞戒劝受中。初一行赞戒德。后五行半劝信受。赞中如明日者。喻律仪戒。能破闇恶犹日光故。如明月者喻摄生戒。大悲摄物同月爱故。如璎珞珠者喻摄善戒。庄严法身如宝珠故。成正觉者。由三种戒成三佛果。谓律仪戒成断德法身。摄善法戒成智德应身。摄众生戒成恩德化身。劝受中初二颂一句就戒教劝诵持。后三颂一句就戒行劝摄受。初中复二。初一颂二句劝受持。次三句劝谛听。次戒行中复二。初二颂三句劝信摄。后二句劝敬听。常作如是信戒品已具足者。谓心常作如上二信即能堪任为受器。故云戒品已具足也。一切有心者皆应摄佛戒者。谓一切众生有成佛<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。皆应摄受诸佛戒也。即入诸佛位者。依占察经。佛位有四。一者信满法故作佛。谓依种姓地。决定信诸法不生不灭清净平等。无可愿求故。二者解满法故作佛。所谓依解行地。深解法性知如来业无造无作。于生死涅槃不起二想心无所悕故。三者证满法故作佛。所谓依净心地。以得无分别寂静法智及不思议自然之业。无求想故。四者一切功<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>满足故作佛。所谓依究竟菩萨地。能除一切障无明梦尽故。今受菩萨戒者必须具信故。得入初信满佛位者言入佛位。恐谓已成佛故。云位同大觉已真是诸佛子。劝信序讫</p><p>尔时释迦牟尼佛初坐菩提树下成无上正觉初结菩萨波罗提木叉孝顺父母师僧三宝孝顺至道之法孝名为戒亦名制止佛即口放无量光明是时百万亿大众诸菩萨十八梵六欲天子十六大国王合掌至心听佛诵一切诸佛大乘戒结戒序中有二。一经家序。二佛自序。经家序中有三。一序结戒。二序放光。三序众集。序结戒中初结菩萨婆罗提木叉者。若声闻戒十二年后随事渐制。菩萨不尔。初在树下一时制。所以然者。声闻根劣。无事预制则讥谤。故随犯缘方渐制也。菩萨根胜闻即随行。无有厌讥。不待犯缘即顿制也。依十地论。成道初七日或自受法乐思惟因缘。故未起说。第二七后方兴言说。今言初结者。应是第二七日中也。孝顺已下略释所结戒之名义。略以二义释其戒名。波罗提木叉者。此云别解脱戒。对法论云。为求解脱别别防护所有律仪。故名别解脱律仪。由律仪能速出离生死苦故。此则别防之。戒能得解脱之果。故从果称名别解脱。又得戒时别别解脱三业之缚。故云别解脱。此别解脱戒若声闻所受唯有制止义。能防非故而无孝顺义。不求摄善及益生故。若大士戒具兼两义。一孝顺义。能摄善等故。二制止义。能离恶法故。孝顺父母者生育世形故。孝顺师僧者长养法身故。三宝者入道胜境故。至道法者得果之本故。略举四处明孝顺也。即口<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>明放光将说戒法现表瑞也。是时百万亿大众下明集众也</p><p>佛告诸菩萨言我今半月半月自诵诸佛法戒汝等一切发心菩萨亦诵乃至十发趣十长养十金刚十地诸菩萨亦诵是故戒光从口出有缘非无因故光光非青黄赤白黑非色非心非有非无非因果法是诸佛之本原行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>之根本是大众诸佛子之根本是故大众诸佛子应受持应读诵善<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>子谛听若受佛戒者国王王子百官宰相比丘比丘尼十八梵六欲天子庶民黄门淫男淫女奴婢八部鬼神金刚神畜生乃至变化人但解法师语尽受得戒皆名第一清净者佛自序中亦有三。一告诵戒法。二释光因缘。三劝受持等。初告诵中半月自诵者。虽果德圆满而不忘因诠。虽一切时诵为新学。故言半月诵。发心菩萨者谓十信也。十发趣者谓十解。亦名十住。亦名习种姓。其十名者。谓舍戒忍进定慧愿护喜顶心也。此十种法初始发心趣入大乘故云发趣。十长养者即十行。亦名性种姓。其十名者。谓慈悲喜舍施好语益因定慧心也。此十习已成性长养圣胎故云长养。十金刚者谓十<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>。亦名道种姓。方便行就不可俎坏故云金刚。其十名者。谓信念回向达圆直不退大乘无想慧不坏心也。十地者亦名圣种姓。十名。谓体性平等地。体性善慧地。体性光明地。体性尔炎地。体性慧照地。体性华光地。体性满足地。体性佛吼地。体性华严地。体性入佛境界地。广说行相如上卷经。是故戒光下释光因缘。有缘非无因者。谓外有时众感法胜缘。内有如来大悲本因。方得现瑞表所说法故。光光者所放光明有多重也。非青黄赤白黑者。以末即本故非五色。非色心者。非碍缘故。非有无者。非凡夫有非二乘无。非因果法者。非苦集法也。诸佛之本原<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>成果之本也。菩萨之根本者成因之本也。大众诸佛子根本者。别举时众也。次劝受持等。应受者从师初受也。应持者受后护持也。应诵者诵文句也。善学者学义意也。若受已下广释受义。余三存略。以初兼后故。国王等者俗等贵族也。比丘比丘尼者。先受声闻<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>者亦兼下三众。十八梵者<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天也。何者十八。一云。下三各三九。第四亦有九。谓无云等三无想五净居。无想既许初后有心。容有发心受菩萨戒。经说净居下来受佛记。故知亦有发心受戒。有云。别有十八梵天。无想五净不入其数。如本业经列色天众。谓梵天。梵众天。梵辅天。大梵天(此四是初禅天)。水行天水微天。水无量天。水音天(此四是二禅天)。约净天。无想天。遍净天。净光明天(此四是三禅天)。守妙天。微妙天。极妙天。福果天。果胜天。大静天(此六是四禅天)。六天者欲界天。无色界者。若就显教。无受法义故不说也。庶民者无官位人。黄门者五种半择迦。畜生乃至变化人者。谓畜生中能变化者。但解法师语尽受得戒者。此所列中若能领解法师语亦能发菩提心。皆得受戒也。又在家戒如上所说。解语皆受。若出家戒则不如是。唯人趣中若男若女无遮难者。方许为受。义同声闻出家受法。又应戒法皆得通受。文无简故。但应遮其比丘等性。如半择迦。许受五戒。但应遮止近事男性。序文已讫</p><p>佛告诸佛子言有十重波罗提木叉若受菩萨戒不诵此戒者非菩萨非佛种子我亦如是诵一切菩萨已学一切菩萨当学一切菩萨今学我已略说波罗提木叉相貌应当学敬心奉持次正说中大分为二。一辨重戒。二明轻戒。辨重戒中有三。一总标数名教令受学。二别叙种相诫令摄护。三覆结得失劝其敬持。初中有十数也。木叉名也。不诵非菩萨等者。显由此相得成菩萨及佛种子。一切菩萨已当今学者。显此戒法三世楷定。木叉相貌者。不诵非菩萨。即戒之相也。三世皆学。即戒之貌也。别叙种相中。十重戒即为十。一一戒中应以五句辨释文义。一制意释名。二具缘成犯。三判业轻重。四学处同异。五就文解释</p><p>佛言佛子若<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>教人杀方便杀赞叹杀见作随喜乃至咒杀杀因杀缘杀法杀业乃至一切有命者不得故杀是菩萨应起<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>慈悲心孝顺心方便救护一切众生而反更自恣心快意<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>者是菩萨波罗夷罪</p><p>第一杀戒</p><p>制意释名者。命是形根有生所贵。凡在含灵莫不宝重。故涅槃经佛诫阇王。虽复人畜贵贱有殊。宝命重死无有异也。然则大士为怀仁慈居先。宁容恣己快心夺彼所重。特违慈行故先制之。又声闻脱缚为先故首制淫。菩萨慈济为上故初禁杀。又此十重七众共持故杀戒在初。释名者。报形相续假名为生。违缘逼害名之为杀。具缘成犯者。成犯之缘通别各五。通缘五者。一受菩萨净戒。二住己自性非狂乱等。三非重苦所逼反此无犯。故菩萨地云。一切处无违犯者。谓若彼心增上狂乱。若重苦受之所逼切。若未曾受净戒律仪。义加二缘。一有忆念。谓<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>时若忆先受随作成犯。若不忆念虽作无犯。二无利生缘。若有利生处许行杀等故。前三及二为通缘五。别缘五者。五十九云。若广建立十恶业道自性差别复由五相。何等为五。一事。二想。三欲乐。四烦恼。五方便究竟。事者。一一业道各别决定所依处事。或有情数或非有情数。随其所应十恶业道依之而转。想者有四。谓一于彼非彼想(如律所云。人非人想)。二非于彼彼想(非人人想)。三于彼彼想(人作人想)。四非于彼非彼想(非人非人想)。欲乐者。或有倒想或无倒想。乐所作欲。烦恼者。或贪或嗔或痴。或贪嗔或贪痴或嗔痴。或贪嗔痴一切皆具。方便究竟者。即于所欲作业随起方便。或于尔时或于后时而得究竟。由此五相成于杀生。乃至邪见诸业道中。随其所应当广建立圆满自性。十种差别论文如是。今依彼意释此犯缘。杀中事者。谓有情数众生为事。此有三品。一上品。谓佛圣人。父母师僧害即犯逆并重。下三果人。一云非逆。涅槃经中入中杀故。毕定菩萨同上杀科。一云是逆。下七逆中唯言杀圣人。不云无学。故杀养胎母。一云犯逆。于菩萨过重故。一云唯重。非生本故。二中品。谓人天害唯犯重。三下品。谓下四趣。一云。若害但犯轻垢。非道器故。文云一切有命者。举轻况重耳。声闻戒中亦云乃至蚁子不应夺命。岂即成重。一云成重。文无简故。声闻戒中初虽总说。下则简别。此中不尔。曾无简别。故知是重。想者。论云。若能害者于众生所作众生想。起害生欲。此想即名于彼众生不颠倒。然想有三。一不倒想。谓如人作人想。即第三句于彼彼想。及非人作非人想即第四句非于彼非彼想。二颠倒想。谓人作非人想。即是第一句于彼非彼想。及于非人作人想即第二句非于彼彼想。三疑想。谓人非人疑非人人疑。论虽不说准律应有不倒。二中人人想犯根本。非人非人想无犯。若望非畜亦犯根本。今就非情故说无犯倒想中二俱不犯本。然应分别。初人作非人想本迷不犯。转想亦犯。后非人人想虽不犯本一向有罪。犯方便故。欲乐者论云。依此想故作如是心。我当害生。如是名为杀生。欲乐此则杀思名为欲。张等。漫者随遇悉害。若漫心者随所遇境皆成根本。若克心者心境相称即成根本。若不相称不遂故轻。烦恼者论云。此能害者或贪所弊。或嗔所弊。或痴所弊。或二所弊。或三所弊。而起作心。是名烦恼。方便究竟者。彼由欲乐及染污心。或自或他发起方便加害众生。若害无间彼便命终即此方便。当于尔时说名成就究竟业道。若于后时彼方命终。由此方便彼命终时乃名成就究竟业道。结犯轻重有三。一方便根本相对分别。方便阙缘不遂故轻。根本缘具畅业故重。二就本中随境轻重。随三品境业轻重故。三就一境中。随心轻重随能起心有轻重故。成业亦尔。染不染犯故。误心异。其义可知。学处同异者。此戒大小俱制道俗亦同。然大小乘不全同也。一轻重异。声闻唯人是重。余皆为轻。大士三境俱重。二开遮异。声闻唯遮无开。大士有益便开。菩萨地云。若诸菩萨安住菩萨净戒律仪。善权方便为利他故于诸性罪小分现行。由是因缘于菩萨戒无所违犯生多功德。谓如菩萨见劫盗贼为贪财故欲杀多生。或后欲害大德声闻独觉菩萨。或复欲造多无间业。见是事已发心思惟。我若断彼恶众<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>当堕地狱。如其不断无间业成当受大苦。我宁杀彼堕那落迦。终不令其受无间苦。如是菩萨意乐思惟。于彼众生或以善心或无记心知此事已。为当来故深生惭愧。以怜愍心而断彼命。由是因缘于菩萨戒无所违犯生多功德。如仙誉王害五百<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。即其事也。制心制色亦不同也。就文有三。一标人。即佛子也。未受菩萨戒非此所制故。如声闻戒若比丘例。二叙犯事。若自杀业是。三结罪名。是菩萨波罗夷罪也。叙犯事中又三。一举不应制不得作。二是菩萨下举所应教令常作。三而自恣心下还举不应成犯事也。初不应中又三。初六句明犯事。次四句辨犯成。后乃至一切有命者。古判举轻况重。今谓结犯分齐也。就犯事中初二易了。方便杀者。如倚拨与药等。赞叹杀者。由我赞叹前人死也。见作随喜者。由我随喜前人死也。乃至咒杀者。谓毗陀罗等咒。由诵此咒前人被死。杀事多种。略余取此故云乃至。如<a href=\"/remen/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>安腹遣使重使等。其类非一。就成犯中。杀业者。于三业中随由一业成杀事也。杀法者。谓杀方法或刀斫或箭射等。杀因者。谓因等起心。杀缘者。谓事想欲乐烦恼方便。如上所说。应事易了。还举不应中。自恣心者。于佛所制无所顾惮。纵自愚情随缘造作。快意杀生者。于内无迷谬。于外无逼切。以了了心行杀生也。结罪名中波罗夷者。此云堕不如意处。亦云他胜处。出家受戒本为制魔。然由犯戒堕在不如之处。故云堕不如处。彼胜我负故云他胜处</p><p>若佛子自盗教人盗方便盗赞叹盗见作随喜乃至咒盗盗因盗缘盗法盗业乃至鬼神有主劫贼物一切财物一针一草不得故盗而菩萨应生<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>孝顺心慈悲心常助一切<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>福生乐而反更盗人财物是菩萨波罗夷罪</p><p>第二盗戒</p><p>制意释名者。财为外命。有待所资自除己我莫不爱护。大士为怀应当助生福乐。而变侵损他物润己长贪。违行处深。故次制也。盗犹不与取之名也。窃取名偷。显夺名劫。盗通二也。具缘犯中。不与取事者论云。谓他所摄物。有人准律唯取人物五钱已上方犯重也。一云不尔。文云乃至鬼神有上物物一针一草不得故盗。故知异声闻也。想者他物他物想也。倒不倒四句准杀应知。欲乐者谓劫盗欲。烦恼者。谓三种中或单或具。方便究竟者。谓起方便移离本处。结犯轻重准杀应知。学处同异者亦准杀也。菩萨地云。又如菩萨见有增上增上宰官。上品暴恶于诸有情无有慈愍专行逼恼。菩萨见已思择彼恶。起怜愍心发生利益安乐意乐。随力所能若废若黜增上等位。由是因缘于菩萨戒无所违犯生多功德。又如菩萨见劫盗贼夺他财物若僧伽物。窣堵波物。取多物已执为己有纵情受用。菩萨见已起怜愍心。于彼有情发生利益安乐意乐。随力所能逼而夺取勿令受用。如是财故当受长夜无义无利。由此因缘所夺财宝若僧伽物还复僧伽。窣堵波物还窣堵波。若有情物还复有情。又见众主或薗林主取僧伽物窣堵波物。言是己有纵情受用。菩萨见已思择彼恶起怜愍心。勿令因此邪受用业。当受长夜无义无利。随力所能废其所主。菩萨如是虽不与取而无违犯生多功德。就文中如前又三。叙犯事中先辨不应犯事有四。第四咒盗成犯四句。后方列。方便盗者如律云。受供比丘语施主云。受汝供养。是阿罗汉等是也。若得供者罪兼二事。谓<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>盗。咒盗者。诵咒令物自来也。无赞喜者。不由赞喜成自业故。鬼神有主物者。谓神庙中物或鬼神即为主。或余为守护主也。劫贼物者。谓官所收劫贼物也。又可劫贼物者。本虽是我物。若劫夺而取即成贼者物也。物无定属随取成其主故</p><p>若佛子自淫教人淫乃至一切女人不得故淫淫因淫缘淫法淫业乃至畜生女诸天鬼神女及非道行淫而菩萨应生孝顺心救度一切众生净法与人而反更起一切人淫不择畜生乃至母女姊妹六亲行淫无慈悲心者是菩萨波罗夷罪</p><p>第三淫戒</p><p>分文如前。制意释名。经云。若不断淫尚障梵天。况得菩提。连羁生死不得离者寔由兹矣。故制之令断。荒色名淫亦名非梵行。诸戒虽皆非梵。此染垢过重故偏目也。具缘中。事者三境皆重。又律中唯女三道男二处是重境。余处非重。若准经文。及非道行淫。故知菩萨于非道亦重。又瑜伽论云。欲邪业道事者。谓女所不应行。设所应行。非支非处。非时非量。若不应理。一切男及不男。若于母等。母等所护。名不应行。除产门外所有余分皆名非支。若秽下时。胎圆满时。饮儿乳时。受斋戒时。或有病时。谓所有病匪宜习欲。是名非时。若诸尊重所集会处。或灵庙中。或大众前。或坚鞭地高下不平令不安稳。如是等处说名非处。过量而行名为非量。不依世礼故名非理。若自行欲。若媒合他。此二皆名欲邪行摄。想者。于彼彼想。若准律文。于道道想。于道非道想及疑。皆成重也。欲乐者。谓乐行之欲。烦恼者。谓三毒或具不具。方便究竟者。谓两两交会。结犯轻重者。随境随心。准前可知。学处同异者。大小同制。出家五众正邪俱禁。在家二众制邪开正。菩萨地云。又如菩萨处在居家。见母邑现无系属习淫欲法继心菩萨求非梵行。菩萨见已作意思惟。勿令心恚多生非福。若随其欲便得自在。方便安处令种善根。亦当令其舍不善业。住慈愍心行非梵行。虽习如是秽染之法。而无所犯多生功德。出家菩萨为护声闻圣所教诫令不坏灭。一切不应行非梵行。文中自淫教人淫者。声闻法中自淫成重。教人非重。大乘法中自他俱重。及非道行淫者。声闻法中女三处男二处行即犯重。非道行者不犯重也。大乘法中道及非道俱犯重也。瑜伽淫业道亦如是说也。余文可知</p><p>若佛子自妄语教人妄语方便妄语妄语因妄语缘妄语法妄语业乃至不见言见见言不见身心妄语而菩萨常生正语<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>亦生一切众生正语正见而反更起一切众生邪语邪见邪业者是菩萨波罗夷罪</p><p>第四妄语戒</p><p>制意释名者。令人虚解。违真之甚。故制之。违想而说故名妄语。事设是实。若违内心。皆名妄语。具缘中事。谓见闻觉知不见不闻不觉不知。想者。谓于见等或翻彼想。翻想有二事。一想事俱翻。如不见事起不见想而说言见。二翻想不翻事。如不见事起见想而言不见。此二俱成妄语也。欲乐者。谓覆藏想乐说之欲。烦恼者如上。方便究竟者。谓时众及对论者领解结犯。轻重者。若随境论。一云。三品境俱重。一云。唯上中结重。对下境唯轻垢也。随心可知。又若准律。唯说上人法。犯重令既无简别。理应通制学处同异者。大小乘俱制。道俗亦同也。又大乘中有益处开。菩萨地云。又如菩萨为多有情解脱命难囹圄缚难刖手足难劓鼻刵耳[剜-夗+死]眼等难。虽诸菩萨为自命难亦不正知说于妄语。然为救脱彼有情。故知而思择故说妄语。以要言之。菩萨唯观有情义利。自非无义利。自无染心。唯为饶益诸有情故。覆想正知而说异语。说是语时。于菩萨戒无所违犯生多功德。释文中余事易解。身心妄语者。身妄语谓由身业表示令人妄解。如由起坐表知是圣等。心妄语者。如说戒时默表清净。虽由二表令他妄解。而所成业语业所摄。故云妄语</p><p>若佛子自酤酒教人酤酒酤酒因酤酒缘酤酒法酤酒业一切酒不得酤是酒起罪因缘而菩萨应生一切众生明达之慧而反更生一切众生颠倒之心者是菩萨波罗夷罪</p><p>第五酤酒戒</p><p>制意释名者。酒是开放逸处失诸善法。如论云。除破僧事若醉酒时余逆法可造。三十六失十种过患律论俱示。若唯自饮过失犹轻。若酤而求利损处甚广。故虽非性恶同制为重。酤者贩博之名也。味浓易耽。虽甘而毒故云酒也。具缘中事者。谓酒体成也。论云。宰罗若迷疑邪未陀放逸处。谷所成宰罗若。余菓成名迷疑邪。简异未成已坏名未陀也。想者律云。酒酒想。酒非酒疑。酒非酒想。皆结正罪。准彼制。此酤亦应尔。又可律就饮说三句皆犯。若就酤说。心境相应。方可结重。欲乐者。欲以酒与人求利心也。烦恼者。三中随一或具二三。方便究竟者。一云。授与人时便犯。不待前人饮与不饮。一云。待前人饮方犯。结犯轻重者。就境言之。律中与亲里贩卖罪轻。以希利心轻故。义准沽酒亦应然。若与上中境人者。是正所制重也。若下品境。事希故应轻也。七众同犯。大小乘俱制。而重轻异。大士过重。声闻唯犯贩卖戒。即第三篇也。释文可解</p><p>若佛子自说出家在家菩萨比丘比丘尼罪过教人说罪过罪过因罪过缘罪过法罪过业而菩萨闻外道恶人及二乘恶人说佛法中非法非律常生悲心教化是恶人辈令生大乘善信而菩萨反更自说佛法中罪过者是菩萨波罗夷罪</p><p>第六说他罪过戒</p><p>制意释名者。同法相护义同昆弟。而反向异道扬彼过短。近则陷没善人。远则损坏正法。其过非轻故制断也。可毁可厌故云罪过。向他显扬故名说也。具缘中事者。谓有戒人所有罪过向无戒人说。七逆十重是正所制。自余轻过亦兼制也。想者。于罪过起罪过想也。欲乐者。欲说罪过之望乐也。此有二。一陷没心。欲令前人失名利等。二治罚心。欲令前人被系缚等。以此二心说他罪过皆犯重也。烦恼可知。方便究竟者。若自说若教他说。前人领解时即成究竟也。结犯轻重者。准之可知。学处同异者。声闻向未受具说他重罪犯第三篇。若说僧残已下皆犯第五篇。菩萨兼济为怀故制重也。文但云说过。不别轻重。下轻戒第十三戒说七逆十重。准彼此亦应尔。但彼向同法说故轻。此向异法故重。又一云。彼说无事故轻。若知无事不能陷没。或治罚故此说有实犯重。释文可知</p><p>若佛子自赞毁他亦教人自赞毁他毁他因毁他缘毁他法毁他业而菩萨应代一切众生受加毁辱恶事自向己好事与他人若自扬己德隐他人好事令他人受毁者是菩萨波罗夷罪</p><p>第七自赞毁他戒</p><p>制意释名者。菩萨应推直于人引曲向己。而今反扬自辱人。违本心之甚。故制断之。赞扬己德毁辱他失。是所防过。从所防为名故云赞毁戒。具缘成犯中。事者有二。一所毁人。二所毁事。所毁人中一云。若毁上中二境犯重。毁下境轻。此戒兼制。一云。上中二境有菩萨戒者方重。恼妨深故。若无戒及下境有戒无戒悉轻。恼妨浅故。后释应准律部。律说毁大比丘方结提罪。故知大乘中毁同法菩萨方结重。今谓前说过戒别标<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>。此毁他戒总云毁他。不别标举。准律简别。理恐不然。所毁事者。准律有七。谓一姓家生。二行业卑。三伎术工巧亦卑。四汝是犯过。五多结使。六盲人。七秃瞎。于此七中随用一事毁皆犯重。想者。倒不倒疑准前释之。欲乐者。扬我抑彼欲求利敬之意乐也。烦恼者。于三毒中或单或二或具三也。然成究竟要由贪心故。菩萨地云。为欲贪求利养恭敬自赞毁他。是名第一他胜处法。方便究竟者。若自作若教人。前人领解赞毁言时便结犯也。律云。毁呰有三。一面骂。二喻骂。三自比骂。面骂者。言汝是旃陀罗家生等。喻骂者。汝似旃陀罗种等。自比骂者。我非旃陀罗种等。此三种骂若了了皆提。若不了皆吉。准此菩萨了了皆重。不了皆轻。又要具赞毁方结重。若毁而不赞。赞而不毁。唯犯轻垢。或先赞后毁。或先毁后赞。俱令运赞毁心备二结重。若先赞后毁。赞时方便轻。毁时成本重。先毁后赞亦尔。如尼八事。一一作时方便故兰。具八事时方结夷罪。若单欲赞或单欲毁。虽前后具二。别结两轻不成重也。如断心数取四钱不成重也。结犯轻重者。若就境论。毁圣毁凡毁道毁俗毁人毁畜业。随前境不无轻重。若就心言。数数现行都无惭愧。深生爱乐见是功德。是上品即失戒也。不具足四。是中下品。犯而不失。学处同异者。声闻犯提。菩萨犯夷。依善生经。于在家菩萨不制为重。若依此经。无别简故七众皆重。文中口自赞毁他者。谓口自发言赞自德毁他失。亦教人自赞毁他者。此有二。一教前人赞彼自得毁他人失。二教前人赞我自得毁他人失。二俱应犯。毁他业者正唯口业。文云自赞毁。故身表意缘。毁赞相隐故非重也。常代众生受加毁者菩萨作心。含垢如海受辱如地。然菩萨地云。不清雪恶声犯罪者。避彼前人讥谤得罪。非谓菩萨过推人也。问菩萨自无恶事。前人实无好事。何得引恶推好。答此有两义。一前人无道毁菩萨时。菩萨作念。如有的箭中。无则无所中。由有我身故众生兴恶。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>身则无由起。起恶由我。恶在我也。是则恶事自向己也。又作是念。由前人毁我故。我得修戒而防。若无前人。我善何缘而生。生善由彼。善在彼也。是则好事与他人也。二彼恶我善是我见耳。若论实理。彼我同体。菩萨应从实理不随妄见。故得引恶向己推善与人。令他受毁辱者是菩萨波罗夷罪者。是结罪名。菩萨地云。若诸菩萨安住菩萨净戒律仪。于他人所有染爱心有嗔恚心。自赞毁他。是名有犯。有所违越。是染违犯。无违犯者若为摧伏诸恶外道。若为住持如来圣教。若欲方便调彼伏彼。或欲令其未净信者发生净信。己净信者倍复增长</p><p>若佛子自悭教人悭悭因悭缘悭法悭业而菩萨见一切贫穷人来乞者随前人所须一切给与而菩萨以恶心嗔心乃至不施一钱一针一草有求法者不为说一句一偈一微尘计法而反更骂辱者是菩萨波罗夷罪</p><p>第八悭惜加毁戒</p><p>大士之坏应不求而施。令乞人现前吝而不与反加毁辱。顿乖化道故制断也。菩萨地中直云不施财法。不言加毁。应名悭不慧施戒。秘吝财法名悭。骂辱前人为毁。从所防过为戒名也。具缘中事者。谓所辱众生及所惜财法。上品境中除佛菩萨。文云贫穷人。故中品境中若非贫穷人为试故来乞。不施亦不犯也。下品境古说非重。今谓有知解非畜。理亦非轻。所惜财法者。文云。乃至一钱一针一草。不为说一句一偈一微尘许法。想者。谓于前二境称境而想。欲乐者。谓秘惜不与之意乐也。烦恼者。既云悭惜。即贫为主。余皆成助。或具不具。方便究竟者。古说前人领解知是悭惜之相。领纳打骂之言。随事随语结重。若准菩萨地。未必前人领解知悭惜相。受骂打苦。方结重也。若决意不施说秘惜言。彼解不解应结重罪。故彼文云。若诸菩萨现有资财。性悭财故。有贫有苦无依无怙正求财者来现在前。不起哀怜而<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>舍。正求法者来现在前。性悭法故。虽现有法而不给施。是名第二他胜处法。而此经云。而反更骂辱者剩显违过之甚也。结犯轻重者。若对境言。有贫苦者重。非贫苦者应轻。若随心言。准上赞毁。古说要具二事方结重。谓悭加毁。若悭而不毁。毁而不悭。皆非重也。学处同异者。声闻唯弟子不教法犯吉。不与财不制犯。尼二岁内不与财法犯提。二岁外不与法犯吉。加毁别结。不合为重。菩萨不简亲疎求者不与皆犯重罪。本誓兼物故七众同犯。依善生经。于俗亦不制为重也。又决定毗尼经云。在家菩萨应行二施。一财二法。出家菩萨应行四施。一纸二墨三笔四法。得忍菩萨行三施。一王位二妻子三头目皮骨。得忍应是十解已上。文中教人悭者亦应有二。一教前人悭财法。二遣前人惜自财法。悭业者意业为主。若现相口说亦身口助成也。悭法者。随说秘惜之方法也。或假托余事而遣。或现威骂辱而去。悭缘如上具五缘也。财中一草法中一尘。盖是极势之言也。四言为句。四句为偈。偈句不满为微法。如欲闻<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>言而不为说。此无常言不成句也。菩萨地云。若诸菩萨安住菩萨净戒律仪。有饮食等资生众具。见有求者来正悕求饮食等事。怀嫌恨心怀恚恼心而不给施。是名有犯有所违越。是染违犯。若由獭惰懈怠放逸不能施与。非染违犯。无违犯者。若现无有可施财物。若彼悕求不如法物所不宜物。若欲方便调彼伏彼。若来求者王所匪宜。将护王意。若护僧制。而不惠施。皆无违犯</p><p>若佛子自嗔教人嗔嗔因嗔缘嗔法嗔业而菩萨应生一切众生善根无诤之事常生慈悲心孝顺心而反更于一切众生中乃至于非众生中以恶口骂辱加以手打及以刀杖意犹不息前人求悔善言忏谢犹嗔不解者是菩萨波罗夷罪</p><p>第九嗔不受悔戒</p><p>菩萨常应仁被一切。而反侵损不受悔谢事。乖诲化之甚故制断也。含毒损人谓之嗔。结恨不舍名不受谢。亦从所防为戒名也。具缘中事谓众生。古说上中境重。下境犯轻。今谓文云于一切众生中乃至于非众生中。故知通结。若如是者。于木石等中嗔亦应结重。答不也。下云前人求悔善言忏谢。故知不通木石。若尔何故云于非众生。今谓圣人名非众生。非处处受生故云非众生。于不应嗔而嗔非如凡人。故别云乃至。想者。谓于所嗔众生称境而想。欲乐者。谓欲结怨不舍之意乐也。烦恼者。以嗔为主。余皆助成。方便究竟者。古云。前人领解知彼不受。被身口骂打结重。随身业口业多小结。今谓不论前人领不领。若决意结怨不受悔谢便结重也。所以知然。嗔即嗔恚业道。骂即粗恶业道。此二业道不以领解为究竟故。决择云。粗恶语究竟者。谓呵骂彼。嗔恚业究竟者。谓损害等期心决定。故知不待前人领解。又菩萨地云。若诸菩萨长养如是种类忿缠。由是因缘不唯发起粗言便息。由忿弊故加以手足块石刀杖。捶打伤害损恼有情。内怀猛利忿恨意乐。有所违犯。他来谏谢不受不忍不舍怨结。是名第三他胜处法。结犯轻重者。嗔不受悔有二。一者前人来触彼还悔谢。而嗔不受彼谢。此唯犯轻垢。一云。亦重彼屈意来。而今嗔隔乖慈心故。二者菩萨触彼彼反悔谢。而怨结不受。正犯重也。学处同异者。菩萨本誓引摄故嗔隔犯重。声闻无期自保。不受悔谢唯犯吉也。依善生经。于俗菩萨不制为重。此经通制道俗。文中乃至于非众生者。若非情名非众生。是深防语。若圣人非众多生死。故名非众生。即齐防制也。以恶口骂辱者。口业损恼。加以手打及以刀杖者。以身业损恼。意犹不息者。意忿不息。前人求悔善言忏谢者。谓被侵损人反求悔谢。犹嗔不解者。不受不忍不舍怨结。菩萨地云。若诸菩萨安住菩萨净戒律仪。于他有情有所侵犯。或自不为彼疑侵犯。由嫌嫉心由慢所执不如理谢而生轻舍。是名有犯。有所违越是染违犯。若由懒惰懈怠放逸不谢轻舍。是名有犯。有所违越非染违犯。无违犯者。若欲方便调伏彼出不善处安立善处。若是外道若彼希望。要因现行非法有罪方受悔谢。若彼有情性好斗诤因悔谢时倍增愤怒。若复知彼为性堪忍体无嫌恨。若必了他因谢侵犯深生羞耻而不悔谢。皆无违犯。若诸菩萨安住菩萨净戒律仪他所侵犯彼还如法平等悔谢。怀嫌恨心欲损恼彼不受其谢。是名有犯。有所违越。虽复于彼无嫌恨心。不欲损恼。然由禀性不能忍故不受谢。亦名有犯。有所违越是染违犯。无违犯者。若欲方便调彼伏彼若不如法不平等谢不受彼谢。亦无违犯。若诸菩萨安住菩萨净戒律仪。于他怀忿相续坚持生已不舍。是名有犯。有所违越是染违犯。无违犯者。为断彼故生起乐欲。广说如前</p><p>若佛子自谤三宝教人谤三宝谤因谤缘谤法谤业而菩萨见外道及以恶人一言谤佛音声如三百鉾[利-禾+夹]心况口自谤不生信心孝顺心而反更助恶人邪见人谤者是菩萨波罗夷罪</p><p>第十毁谤三宝戒</p><p>地论唯云谤菩萨藏。三中谤法过偏重故。佛法僧宝初信之胜境归终之极地。理应承而奉顺反生诽毁。其过非轻故制断也。心言乖宝故名为谤。亦从所防为戒名也。具缘成犯中事者有二。一所对境事。谓上中二境。若向下境结罪则轻。今谓若对有知解者罪亦应重。二所谤境事。谓即三宝。业道门中通云宝有义。今简取胜故唯云三宝。想者论云。于有非有想。此就所谤境辨其想也。欲乐者。谓即如是爱欲欲谤三宝之意乐也。烦恼者。以痴为主。或具或单。方便究竟者。古说。前人领纳邪言随语结重。决择业道中云。究竟者谓诽谤决定。又菩萨地云。若诸菩萨谤菩萨藏。爱乐宣说开示建立像似正法。于像似法或自信解或随他转。是名第四他胜处法。结犯轻重者。凡说邪见有其二种。一损减邪见。拨实有事二增益邪见立实无事。损减有二。一全分。总拨一切因果法。二一分。或执外谤内。或执小谤大。非拨一切都无有也。全分邪见若起即失戒。总拨因果即退菩提。故若发言谤唯得性罪。无戒可犯不名犯戒。此时虽失戒而未断善根未至增上品故。唯可名为退菩提舍。一分邪见中。若由执外谤内法时退菩提心即失戒善。若未退心即犯谤重。若此谤心至增上品。设不退心亦失戒善。即是增上缠犯重舍也。若由执小谤大乘时退菩提心亦即舍戒。若不退大即犯轻中第八戒也。彼云。心背大乘常住经律言非佛说。而受持二乘声闻戒经故又增益邪见。立实无事者。即地论云。爱乐宣说开示建立像似正法。像似正法者。谓五法等相状似正法而非正法故。若谤正法而爱似法即犯重罪。若不谤正而爱似法即犯轻中第二十四。彼云。有<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>律大乘法而不能勤学。修习文学邪见二乘外道俗典等故。古疏邪见义说有四。一上邪见。二中。三下。四杂邪见。上邪见者。谓拨一切因果皆无。即与上说全邪见同。自有两种。一法想。谓心中决定起无因果想。戒善即失。如下邪见成上品善便断。后发言谤。无戒可犯唯得性罪。二非法想。谓内心中起有因果想。唯口中说无戒不失。故随说犯重。犯后失戒。事如前说。今谓若心中起有因果想。此则见不坏。岂名邪见邪又若起非法想谤者。应如破僧是虚诳语。既名邪见谤。故知非妄语。中邪见者。不言都无因果。但说三宝不及外道。此即同上一分邪见中执外谤内者。是亦有二。若起法想即失戒善。非法想说随说犯重。妨难如前。下邪见者。不说三宝不及外道。但执小乘谤毁大乘。如诸部小乘谤大非佛说。此亦有二。若起法想计画未成即犯轻中第八戒也。计画若成即失戒善。计小胜大时即退菩提故。今谓计小胜大未必便退大。谓若有人信小乘中树下成佛。不信大乘文成正觉。而不欲取二乘四果。岂可名为退菩提邪。二非法想说随说犯重。今谓既知大乘胜于小乘。而唯口言劣岂名邪见。谤杂邪见者此复有四。一者偏执。谓执大谤小。或偏执一部。二者杂信。谓虽不背佛家正法。而言外道所说亦有道理。又言鬼神亦有威力。如说儒道佛家三宗齐致。三暂念小乘。谓欲且依小道断惑。然后更修大乘行也。四思义僻谬。谓随声取义起五过等。此四杂见未必犯重。随其所应犯下轻垢。辨轻重说学处同异者。小乘谤法不制为重。如说欲不障恶邪见者。若起见时唯吉。违三谏时方提。如破僧五邪等。若起法想唯兰。非逆若非法想犯逆并兰。今大乘中若谤三宝及菩萨藏。乖违过深故并制重。依善生经。于俗菩萨亦不制重。今此经中通制七众。文中外道者。谓佛法外行异道者。恶人者。谓佛法中起恶见者。愍彼无事起恶坠于无底狂坑。伤此正法被损亏于行人心中。故见一言谤声。痛如三百鉾[利-禾+夹]。见者闻见。余文易了。此谤法戒更无开缘。上来别释十重讫也</p><p>善学诸人者是菩萨十波罗提木叉应当学于中不应一一犯如微尘许何况具足犯十戒若有犯者不得现身发菩提心亦失国王位转轮王位亦失比丘比丘尼位亦失十发趣十长养十金刚十地佛性常住妙果一切皆失堕三恶道中二劫三劫不闻父母三宝名字以是不应一一犯次总结中复三。一对人总结。二诫令不犯。应当于中下是。三劝学指广。诫中复三。一举微况多诫。二显失令厌诫。三示报令怖诫。举微况中。不一一犯如是微尘许者。于一一戒中不应犯如微尘许。才起犯心不至身口。此过轻小故喻微尘。此过虽微积成大恶故不可轻。如经偈云。莫轻小恶。以为无殃。水渧虽微。渐盈大器。何况具足犯十戒者。微过尚不应犯。重罪理在绝言。具足五缘成十根本故云具足犯十戒也。显失厌中。不得现身发菩提心者。谓失根本发心行也。由犯根本重障所缠。于现身中不复堪发真菩提心。亦失国王位等者。谓失傍招增上生也。既退胜因妙报亦失。亦失比丘等者。失胜类也。不复堪入二众数故。下三众亦随类摄。失十发趣等者。失胜法也。因果胜法皆退失也。示报怖中。一切皆失堕三恶道者。犯十重戒一切皆招三恶<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。二劫三劫不闻名字者。一失人身长劫难复。慈名胜字何由得闻。小说五逆不过一劫之果。大言十重亦招多劫之报。权实理殊可不慎乎</p><p>汝等一切诸菩萨今学当学已学如是十戒应当学敬心奉持八万威仪品当广明。佛告诸菩萨言已说十波罗提木叉竟四十八轻今当说汝等下劝持指广如文也</p><p>菩萨戒本疏卷上(终)</p><p>菩萨戒本疏 卷中</p><p>新罗沙门义寂述</p><p>释轻戒中大分亦三。一结起总摽。二次第别释。三说竟总结。就别释中。四十八轻随文所结。凡为五段。段末皆指余文。应有广说。此五段中随文克取皆通三聚。段段皆说离恶摄善益生义。故从宗多论。前十重戒判为律仪。后四十八分为余二。经说摄律仪戒所谓十波罗夷。摄善法戒所谓八万四千法门。摄众生戒所谓慈悲喜舍。化及一切众生。众生皆得安乐。又四十八中。前三十戒多为摄善。后十八戒多为利生也。地持四十四轻戒中。前三十三亦为摄善。后十一戒为利生。故彼此戒相虽有出没。举宗判相亦相似故。又经制教本。论判义条。故经与论不得相异。论辨戒度九种相中。第二一切戒。谓在家分戒及出家分戒。是名一切戒。又即依此二分净戒略说三种。一律仪戒。二摄善法戒。三饶益有情戒。律仪戒者。谓诸菩萨所受七众别解脱律仪即是苾刍戒。至近事女戒如是七种依止在家出家二分。如应当知是名菩萨律仪戒。摄善法戒者。谓诸菩萨受律仪戒。后所有一切为大菩提。由身语意积集诸善。总说名为摄善法戒。此复云何。谓诸菩萨依戒住戒。于闻于思于修<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。于乐独处精勤修学。如是时时于诸尊长精勤修习合掌起迎。问讯礼拜恭敬之业。即于尊长勤修敬事。于疾病者悲愍殷重瞻侍供给。于诸妙说施以善哉。于有功德补特伽罗真诚赞美。于十方界一切有情一切福业。以胜意乐起净信心发言随喜。于他所作一切违犯思释安忍。以身语意已作未作一切善根。回向无上正等菩提。时时发起种种正愿。以一切种上妙供具供佛法僧。于诸善品恒常勇猛精进修习。于身语意住不放逸。于诸学处<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>正知正行防守密护根门。于食知量。初夜后夜常修。觉寤亲近善士依止善友。于自愆犯审谛了知深见过失。既审了知深见过已。其未犯者专意护持。其已犯者于佛菩萨同法者所至心发露如法悔除。如是等类所有引摄护持增长诸善法戒。是名菩萨摄善法戒。云何菩萨饶益有情戒。当知此或略有十一相。何等十一。谓诸菩萨于诸有情能引义利。彼彼事业与作助伴。于诸有情随所生起疾病等苦瞻侍病等亦作助伴。又诸菩萨依世出世种种义利能为有情说诸要法。先方便说先如理说。后令护得彼彼义利。又诸菩萨于先有恩诸有情所善守知恩。随其所应现前酬报。又诸菩萨于堕种种师子虎狼鬼魅王贼水火等畏诸有情类。皆能救护令离如是诸怖畏处。又诸菩萨于诸丧失财宝亲属诸有情类善为开解令离愁忧。又诸菩萨于有匮乏资生众具诸有情类。施与一切资生众具。又诸菩萨随顺道理。正与依止如法御众。又诸菩萨随顺<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。事务言说呼召去来谈论庆慰。随时往起。从他受取饮食等事。以要言之。远离一切。能引无义违意现行。于所余事心皆随转。又诸菩萨若隐若露显示所有真实功德。令诸有情<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>进学。又诸菩萨于有过者。内怀亲昵利益安乐增上意乐。调伏诃责治罚驱摈。为欲令其出不善处安立善处。又诸菩萨以<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力方便。示现那落迦等诸趣等相。令诸有情厌离不善。方便引令入佛圣教欢喜信乐生希有心勤修正行。今案四十八轻戒中。与论所说文互出没开合不同。次第前后亦有不同。经制教本随事别立。论辨义条从类总说。开合立意义须斟酌</p><p>初戒中</p><p>第一敬事尊长戒</p><p>佛言佛子欲受国王位时受转轮王位时百官受位时应先受菩萨戒一切鬼神救护王身百官之身诸佛欢喜既得戒已应生孝顺心恭敬心见上座和上阿阇梨大同学同见同行者应起承迎礼拜问讯而菩萨反生憍心慢心痴心嗔心不起承迎礼拜问讯一一不如法供养以自卖身国城男女七宝百物而供给之若不尔者犯轻垢罪即论所说如是时时于诸尊长精勤修习合掌起迎问讯体拜恭敬之业。即于尊长勤修敬事。夫欲摄善必凭胜缘。若傲于所尊即妨于进善。故制令敬事。具缘成犯理应备论然既非性罪。未必皆具五缘。故轻垢中犯缘存略。然五缘中事想欲乐方便究竟。虽非性罪业道。必应具有。第四烦恼若染犯亦有。不染犯中不必有也。结犯轻重者。故心染犯皆重。不故不染皆轻。诸戒皆尔。不复更论。学处同异者。大小俱制。然声闻离过门中制。菩萨摄善门中制。七众同犯。在家二十八轻戒中第五戒云。若优婆塞受持戒已。若见比丘比丘尼长老先宿诸优婆塞等。不起承迎礼拜问讯。是优婆塞得失意罪。不起堕落不净有作。文中诸戒皆三。谓摽人序事结罪。就序事中。诸戒差降。此戒有三。一劝受戒。二明应敬。三明违之成犯。初劝受中凡举三位。初二唯为俗。第三通道俗。出家菩萨亦有容作僧统等。故立僧统等。虽经所遮。必不获己。事容有故。恐在高位。纵诞行非故制受法令不憍奢。若能受而顺行则神佛喜护。近有安身远能隆法。故劝令受戒。虽先受临事应更受之。为欲敬事故。既得已下明应敬也。孝顺心者。于彼教训从而不敢违也。恭敬心者。于彼德行崇而不敢慢也。上座者。于上无人为上座。和尚此音讹也。若正应云邬波陀耶。此又云亲教。即所从受戒者也。阿阇梨者。若正应云阿遮梨耶。此云轨范。此有五种。一剃发。二出家。三教授。四羯磨。五依止。大同学同见同行者。谓同学等中年岁先者也。又同学大法同习大见同修大行者也。违之成犯中。反生憍心慢心痴心者。不孝顺故憍。不恭敬故慢。不知应敬之处。即是痴心也。以自卖身下引况重诫。尚应舍身。况复不礼敬耶。四十四中第三戒云。若诸菩萨安住菩萨净戒律仪。见诸耆长有德可敬同法者来。憍慢所制怀嫌恨心怀恚恼心。不起承迎不推胜座若有他来语言谈论庆慰请问。憍慢所制怀嫌恨心怀恚恼心。不称正理发言酬对。是名有犯。有所违越是染违犯。非憍慢制无嫌恨心无恚恼心。但由[娕*页]惰懈怠<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>无记之心。是名有犯。有所违越非染违犯。无违犯者。谓遭重病。或心狂乱。或自睡眠。他生觉想而来亲附语言谈论庆慰请问。或自为他宣说说法论义决择。或复与余谈论庆慰。或他说法论义决择属耳而听。或有违犯说正法者。为欲将<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>者心。或欲方便调彼伏彼出不善处安立善处。或护僧制。或为将护多有情心。而不酬对。皆无违犯</p><p>第二不饮酒戒</p><p>若佛子故饮酒而酒过失无量若自身手过酒器与人饮酒者五百世无手何况自饮不得教一切人饮及一切众生饮酒况自饮酒一切酒不得饮若故自饮教人饮者犯轻垢罪酒是放逸处。能造诸过违诸善法故制也。大小乘同七众俱制。二十八中第二戒云。若优婆塞受持戒已耽乐饮酒得失意罪。序事中三。一显失。二不得教下制不应饮。三若故自饮下违之成犯。初显失中。故饮酒者。似开误饮。而律中酒非酒想亦犯。若始终无饮酒心。误迷唯谓饮水。理应开之。若本有饮酒心。虽饮时谓非酒。亦应犯也。而生酒过失无量罪者。虽非性恶而能开性恶故云过失无量。如论中云。若醉酒时除破僧事余一切恶无不造也。又智度论中具显三十六失。四分律中十种过失。佛告阿难。凡饮酒者有十过失。一者颜色恶。二者劣力。三者眼视不明。四者现嗔恚相。五者坏田业资生法。六者增致疾病。七者益斗讼。八者无名称恶名流布。九者智慧减小。十者身坏命终堕恶道。是谓十失。自今以去我师者乃至不得以草木头内着酒中而入口。过酒器者然度酒器也。一云。过有酒器与之令饮。一云。唯过空器与彼令斟。前说遣他饮。后说教他饮。义皆无爽。五百世无手者。谓手执酒器与故得无手之报也。如蚓虫等类。或生人中得无手也。有云。有五五百岁。一五百在醎糟地狱。二五百在沸尿中。三五百作曲蛆虫。四五百作蝇蔚取N逦灏僮魅顺斩畚拗?=裱晕灏倩蚴亲詈笠病V撇挥χ小2坏媒桃磺腥艘?摺N讲坏媒趟?钜?偎?鲎浴B稍啤&gt;普摺D揪凭?拙朴嗝拙拼舐缶啤H粲杏嗑品ㄗ骶普呤恰T泳普摺&gt;粕?葡憔莆恫挥σ?;蛴芯品蔷粕?葡憔莆恫挥σ?;蛴芯品蔷粕?蔷葡憔莆恫挥σ?;蛴芯品蔷粕?蔷葡惴蔷莆恫挥σ?7蔷凭粕?葡憔莆队σ?9闼等绫恕2环刚摺H粲腥缡遣 S嘁┲尾徊睢R跃莆??H粢跃仆看?R磺形薹</p></div>"
}]