[{
    "title": "金刚般若论会释 第1816部",
    "author": "窥基大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>论会释 卷上</p><p>大乘基撰</p><p>一部分三。初敬所师。叙标作意。次科宗义。正释经文。后叹愚深法成隐灭。初中三颂分二。初二颂半归敬所师。后半颂叙标作意。初中复二。初二颂别显<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。后半颂总礼所师。初中复二。初一颂半唯敬法。后半颂敬佛僧。法中分三。初半颂叹<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>神功。出生报化显法身故。次半颂叹法深妙。词理坚贞。群圣迷故。后半颂叹法玄约。文略义广。威势胜故。智者佛也。闻已为我说者。慈氏菩萨僧也。天亲论偈。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨为无著说。无著授与天亲。令造释故。天亲偈云。法门句义及次第。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>不解离明慧。大智通达教我等。即明弥勒亲教无著。无著转教天亲也。归敬<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>理应周普。但说此三者。是经所依及能起故。能说所说。教依义依。各敬胜首。摄余一切</p><p>次科宗义。正释经文分二。初明七句。申正述之宏纲后<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>为何故以寂静者下。重解前文。释玄宗之巨委。初文复二。初标七句彰一部之大旨。后释前文配。经文之所在。所明名义。能诠名句。以教诠义。名为有义句。义之句故。或义是所诠。文为能诠。以文随义。皆有七故。名七义句若文若义。皆有七故。若依天亲法门句义及次第法门句义者。为句之义。名为句义。或唯义故。初标七句中分二。初标列七句。后显七有异。初文有三。初标。次列。后释结。七中前六是所诠义。菩萨事故。第七是能诠句。能诠义句故。二释义句。皆能诠也。前六之中。初三文之次第。分段义意。流三住处所明。其对治是所断边执。不失是所修中道。地是此二法之别位。总名为住处。发大乘心者。所依处故。别名为地。彼位有漏无漏诸法。顺生彼位。各别胜法能持不失。名之为地。总法所依。所止名住。别法能持。能生名地。是二差别</p><p>后释前文。配经文之所在。分七。随前标释故。佛种不断有二义。一者明佛能为善摄善付。善现发请。欣佛为说。令诸菩萨当依修学。得绍佛种姓不断故。论下解。有六因故。善现发问。令佛种不断。二者明佛能为善摄善付。令所摄付诸菩萨等依位而修。由佛能令绍种不断。故论结云。此善摄付嘱二种。显示种姓不断。故经说云。教发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。令佛种不断。即是此也</p><p>文分为四。初标佛种不断。是问答之大纲。玄宗之巨意。二别配文。三逐难释。四结成前难。虽一部经问答之意皆为愿欲令佛种不断。由能问故。方能答生。初从胜名。故次别指。准在问中。此中初标论其实义。故言般若为佛种不断。流行于世</p><p>别配文中。希有世尊。意总标叹。如来以下别显。叹希有有三义。一由能摄付佛成希有余不能故。二时一出现经多劫中不可见故。三福德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>生可度种种<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。无与等故。此中世尊是第十号。如来是初号。举终括始。以略中间。故能断云。乃至如来应正等觉。由举终一。略其中间六。至于初三。余文皆略。无乃至言。十号。如瑜伽八十二释。又此论牒经云。何如来以第一善摄等。云何之言。经本皆无。又此欲叹佛希有摄付。乃言云何。翻成问佛。非是叹词。深为乖角。善摄等者。能断云。言最胜摄受。余文但言善护念等。下文遂开。第一及善。二义有异。最胜之言。其具第一善二义故。此能摄受法下论自解</p><p>逐难释云。于中善摄等者。合经及二论。摄付有六义。一能摄付者。如来唯在果位。瑜伽三十七。能成就有六。一胜解行地菩萨。二净胜意乐地菩萨。三行正行地菩萨。四随决定地菩萨。五决定行地菩萨。六到究竟地菩萨。彼在因位。此说果位。说一切位。极深妙法。非余能故。又此<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>王。彼说佛在世时及佛无后能成熟者。故不相违。二所摄付者。谓诸菩萨虽所成就通有四乘。行二利行。通他三乘。余解不能故。此唯菩萨。此上二种经文自有。三摄付之时。此中论云。于佛证正觉转法轮时。以五义中菩萨乘法。化根已熟。名为善摄。于佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时。亦以五义化。已得摄受菩萨。名善付嘱。四所摄付类。天亲论云。善摄化根已熟。善付化根未熟。此中二时俱化根熟。一解二论义同。此中意说。根熟菩萨佛初成道。佛自摄受。令依教行禀于佛训。佛入灭时。佛化既无。无能摄付。但以佛法。付根已熟。令根未熟。于彼受化。名善付嘱。故此说言。已得摄受菩萨于佛灭时。亦以五义而建立之。非是二时俱以五菩萨法建立已熟名善付嘱。故二论同。由佛若在未熟菩萨。亦自摄付。劣故隐之。或此中付论遇佛皆熟。名善摄受。灭后令度是根未熟。名善付嘱。便无有妨。故<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>经云。善摄受者由无上利益故。善付嘱者由无上教故。二解两论意别。此依二时俱依根熟。已显摄付。佛在所化。当来之世。成能化故。根未熟者。非当能化。故略不说。彼依一时当来。能化所化二类。以分摄付。各圣义别。彼所无者此便解之。五所摄付法。论云。五种义中。菩萨法而建立故。或有解云。谓五乘法中菩萨之法。若尔云何名为五义。不名五乘。既法付五乘。如何言摄付菩萨。今为二解。一云。即下重释前之玄宗之巨委中。释<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>云。自此已后。余住处中。有五种随所相应而解释。一依义。二说相。三摄持。四安立。五显现。即是经中所明。理事二行。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>二门。菩萨修断之法。是佛二时所摄付法。二云。即前七义句中。后五句义所明菩萨行法。前二门问。后五佛答。是正所明能摄付法。天亲释此能摄付法。彼云。护念是此摄受。摄受根熟有二。一与智慧力。令自成就佛法。二与<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>力。即是大悲令摄取<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。付嘱中彼论有二。一总解云。谓根未熟。于得未得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>中。惧其退失。付授智者。二别解云。又得不退者。不舍大乘故。此所付法。谓十住第六住已前所已得法。未得不退。于大乘中。欲令胜进故。此所付法。第七住后所未得法。此中总显根熟菩萨在七住后.不退位中。未熟菩萨在六住前可退位内故。瑜伽论说。能成熟有六种住。又胜解行位亦名能熟。即是此中在七住。后所善摄者。六住已前即是此中所付嘱者。由以位可退令不舍大乘。摄付嘱故。又此意言说。不舍大乘定信。非不舍位。若作此解。十信之中。第六已前名根未熟。专信大乘。犹未定故。第六心已后名根已熟。信决定故。又不论定故。若全未信名根未熟。犹住劫外。若起<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>名根已熟。即入劫内。故瑜伽言。能成就者。通胜解行。上来且说三位二类。初地八地证行二种。有退不退两位二类。亦应分别。上化下故。下禀上故。下文已成就有三品。其所善摄付嘱在此明之二类随应当知。六所摄付相。此卷下文。利乐相应为善摄。第一有六种。第二付嘱亦有六种。自下当解</p><p>上六义中经文有二。一能摄付者。二所摄付者。无著论有二全一少分。二全者。一摄付之时。二所摄付相。一少分者。所摄付法。天亲论有一全一少分。一全者。所摄付类。一少分者。所摄付法。二论但解摄受付嘱。即总言故。合开四总或六义。天亲论以一颂。颂前文义。菩萨地说。菩萨已成就有三品。初劫名下品。第二劫名中品。第三劫名上品。唯三品前名未熟</p><p>二发起行相者。发起了于。行谓般若行解。即慧体名相。以<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>故。非是相状。如十六行慧胜得名。三问皆因慧行相。佛所正答。是慧行相。今为问起。名发起于行相。能起佛说。慧行相故。或此三问皆问所修。行之体状。名为行相。于中<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>虽标总称。而得自名。别名<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。若依前解。虽诸福智有无为等皆所修诸法。慧为般若之体。独得其名。若依后解。唯在有为。无为非行。便成大过。以问有为行。无为自证。亦无有失。以此理微。前解有典据。文有三。初指文。次释。三后结。第二文有二。初总显。后别解。欲者希求。初希也。愿谓思念。复欲也。愿以欲胜解为体。入诸善法。欲为根本。本名正求。次生胜解。名欲思念。欲愿体通闻思二慧。三摩钵底名等至。唯定非散非通有<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。此简唯取无分别定。非散无心。正修慧<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应等至。三慧相应无分别定。正名等持三摩地也。有放逸分别生如实<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。虽住散位非无分别。亦不生执。寻当摄念。通等持位及等至位。名降伏心。下文云。乍观此论。在此文明之。观此文意。初一闻思。次一修慧。后一若放逸生心。寻还入定。制之一处。无事不辨。故下论解经名中。能断者。般若波罗蜜中。<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>所断。如金刚断处而断故。由此.闻思皆折伏名能断。又在修位。学胜慧时。最初<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>心平等性。次后证得明心正直性。最后证得心无功用住性故为三问。经云。第一显前摄道。摄彼彼行故。第二显成熟道。胜修慧位故。第三显不失道。不过故。正解此同。又初是加行道。次是无间<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道。后是胜进道。但在因中非佛位。有信行地中。三皆有漏。八地已前初地已后。通有无漏。八地已上纯是无漏。无勉励加行。有任运加行故。无别发胜进。即于一念外行身语。亦无放逸。故此具三。或一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>真俗并用。刹那刹那皆具三种。任运欣趣内平等观。外起化故。然天亲论中。初住心深念众生。次修行<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心。后降伏厌离有为。又此三问。初恩德因。次智德因。后断德因。即是<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>报身法身因。亦逆次第断恶修善。度脱众生。此初名摄道。摄受众生故。次成熟道。修佛法故。次不失道。离恶尽故。乍观此论。以闻思修解。初二似有别。不离修慧位。有此三种。故不相违。然依菩萨地。初答有三持。谓诸菩萨自乘种姓。为第一堪任性持。以此为依。堪证大菩提故。最初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>为第二行加行持。以此为依。行于能证大菩提行。皆<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故。所修一切菩提分等一切万行。为第三所圆满大菩提持。故无种姓不名为持。其有种姓。虽未发心。望彼为胜。若依天亲论。别答三问。前后文别。由初能持故。可起菩提心。有初住问。由有第二能持故。别起行有第二修行问。由有第三能持故。得大菩提。有第三伏心问。或天亲文与此无别。文中一一皆有三答。据文显相。且就偏说。别配经文。不遮一一文皆具三故。前所解三佛<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>不尔。便与二论相违。三持义别。不次此配文。又初二问能治道。第三问断所障故。但三问不增不减。罗什二问。住中合故。准下解五种相文。从初发心次修行布施等。乃至未入佛地。皆通此三。即胜解行位。有无分别三摩钵底。摄论等文云。寻伺实智<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>观等。皆在决择分位。便与此文相违。解云。别作无相三性观等。在决择分位。总观无相。起无分别修慧。在胜解行。何妨亦得。天亲菩萨明此道理。不得别作无相观故。修行但说散布施等。三轮清净修无相行。不说入等至。无著菩萨以总观作无相观等。说胜解行位。亦作无相等至。即以此理。天亲菩萨住心初发。修行次生。后降心断障。方作无相观。断分别故。初二闻思伏。后方修慧断。故答三问。前后别。文别。修行别。别位故。无著菩萨以总得作无相观。修折伏正断。俱名为断。随应位位皆运得作。故于文文皆答三问。以有二义故。二论主各各别解。各据一义。亦不相违。合二论义方是。由此顺古。无著一周为利根一人。久修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>乐闻凡夫十地及佛三位者说。天亲二周为钝根一人初修者未闻凡夫发心修行断障有疑者说。亦不相违。由不乐闻十地等行。合说二。义方周备故。经然今给审观。天亲论主作两周说。读者自错。应以无著成就天亲。天亲义[门@报]。无著方解。但是舍迷。天亲论颂。弥勒所说。无著菩萨岂与相违。有少不同。至经当释。又依古释。利根一闻即解。钝人再闻方悟。利根初后二时而至。无著一周。天亲两周。两论释别。所望异故。依此释经。全无相合违。文似重昏。乍谓两周。据后释经。全无重相。下自当悉。预解难知</p><p>行所住处者。行谓三问所发起行相。住处谓所依止。彼修行相所依止道理处所。文有二。初说初处。后结已说住处。初中复二。初说十八住处。后说八住处。初中有三。初标名列。次解次第。后别配文。标名列有二。初标名释。次列名。列名有三。一标。二列。三结。解次第中有三。初以七义摄十八处。次解次第。后结成释</p><p>八住处中。前六住处。即此七种次第是。彼后三住处通一切处。后文自解。六中第四合名离障碍。此中开为三。一离障二求教授。据实求教授。亦离无教授障故。八住处中第四合名离障碍处。论下卷初亦言。今说离障处十二种障碍对治。无教授障。亦入障中。今此以外求法为名。名求教授。余说离障。故离障外说求教授。又此名证道。八住处中。名为净心。名异义同。然发心等。皆虽离障。复离障等皆亦有行。各据增上。为名不相违。前十六住处。信行地中分三。一发心住处。是十住位。波罗蜜行欲得色身欲得法身。是十行位。余十二种。是十<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>位。后文牒释中有二名不同。初名智相至得。后名福相至得。此依可乐对智名福。彼依证获。故名至得。又彼依能得所得。通名至得。此总对智。俱总名福。问何故欲得色身。不名欲得法得法身。余名欲法。答四蕴无为名法。不可见故。色蕴可见而守自名。余名少别。及分三位。由相难知。皆至文解。证道中解妙身大身。至得身成就身。得毕竟转依。故名妙身。此意说<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>身名至得身。报化名成就身。或自受用真如。合名至得身。依金光明经。俱法身故能得所得性故。他报化佛为佛形。佛不为佛形。佛皆名成就身。后卷重解中意。明得三身皆妙身故。至彼当知。大身谓一切众生身摄身故。下文由得五平等故。摄一切生。与已无别。摄一切生。以为自体。故名大身。普度故。此中应说。一切道品染品。在证道离慢二中配属。即十障十度。略无十如。但明能证</p><p>求佛地中有三。初标。次曲列释。后别指经。为十地菩萨所求佛地故说后经。故名上求。上求佛位故。此上总显住前前位所起之障。后障后位。因彼位起障后位故。随其所应。俱生分别断之位。次能伏即异前位所起。后位能伏。即佛地障。十地中起。八地以前名起彼故。佛位国土净等通三佛国。如是一一皆当了知</p><p>为<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>不染中有二。初配经。后别解九喻。九喻中有二。初标四有为相。后别解。标四中。天亲论束九为三。一观相。二观受用。<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>受于三世事。束此四中。第二者所住味。第三随顺过失。为一观受用。彼以所受用境能受用身能受用所受用。合为一受用。此以境处为所受用。其身及受为能受。二别分为所味及过失。能味身身受皆过失故。又此论以相为初。以星为喻。以见为次。以翳为喻。彼论以见为初。以星为喻。以相为次。以翳为喻。略有二解。一云。二论望别。亦不相违。二云。此义错彼论正义。准第二观受用中。以所著味境为初。后方说能受。故知观<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>相中亦尔。以相为初。以见为次。故此论初举相。取能见相之见。第二举见。取所见相。翻文有别。亦不相违。前后俱是作者异端。以相通是见识义二相。故初举之。彼论心亦同。彼初皆举境。后方举能。余皆同也。自性相总谈世间外道邪妄一切凡夫法性。见相为妄性。识相为凡性。着所住味。随顺过失。别明二类。不知因生或业。由外五尘为所味着。能依止身。能用之受。因生过失。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>等执为常我等。其能受用顺生三苦。而彼不知。若有受皆苦是经文。下是论解苦受。彼苦生故是苦苦。乐受破灭故。是坏苦。与前二无常不相离。是行苦。欲界具三。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>有二。第四禅已上有一。后说三世喻。随顺出离相。以离三世不生前失。顺二<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。便得出离。以攀缘三世。则知二我无得出离故。由此但说九喻。不增不减。与八喻五喻等有差别。应会释之。然天亲论云。观此九法。得何功德。亦与此同观相及受用。于三世事。于有为法中。得无垢<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。由观此九法依他性。不为<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>恶业所拘。便得胜果。出离自在</p><p>随顺过失。文有二。一标。二释。初中有三。初总释。次引经。若有受皆是苦故。后释义</p><p>顺出离中有三。初标解顺出离。次别解三喻。后结顺出离。初有三。初牒名。次释出离。以二无我为出离体。即是真如灭谛性故。后解随顺。以三世喻。知无实相。便能顺彼出离无我</p><p>上说十八住处。后别说八住处摄经文。或复重摄前十八住处为八。亦无过失。八住处中分二。初说八。后释通局。初中有三。初标。次列。后配释。住处谓初发心摄持<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>摄受菩提。利生功能。波罗蜜净住处行胜善故。净诸障故。净心住处。以无漏名净心。余皆可解。已上求佛地者。佛位果尊位极名上求。或后文名上。自此以后十地等中。求佛地也</p><p>解通局中有三。初标二通。次解通相。后结成通</p><p>四下解对治。上来三相。问答俱有。次下三义唯在答中。对治是障所治金刚。由此经明<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>。或唯所知障法执及三业故。不失是能治金刚地。是阔狭金刚由不失中明中道理智境正是能治体故。对治中有二。初问。后答。答中有二。初标二。后解二。标二中有解。耶行者是法执分别。是菩萨<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。名耶行故。共见正行者。共见是生执。是正行之所对治。由前以标对治之言。列名中略但言共见正行。正行非所治故。耶行即对治。后共见是正行之所对治。法执唯菩萨断。但言耶行。是菩萨耶行。即知法执。其生执三乘通断。故言共见。见是分别。违生空无分别智。名分别非。是俱生分别之惑名为分别。彼义不然。此论后卷上求佛地国土中云。若菩萨言。我成就庄严国土。则非菩萨。此义为共见正行中转。为断彼故。安立第一义等。又云。若言我成就即为人我取。庄严国土者。是法我取。故知二取俱名共见。障于正行。今正解者。耶行者是身语意行。二执所起行。今论多说。是意耶行。生如是心意分别耶行业故。第二住处中应行布施。是耶行对治故。共见正行。对治方是二执。见谓分别故。分别执着。是菩萨烦恼。正是所除。如次前引。后卷中说。此中二种。如第二地说。断二愚误犯三业。即是此中二种对治。耶行对治。于彼彼位。各各因行彼行。方起不名为共。但名耶行。共见正行。见烦恼障及所知障。分别见体。诸位之中共所断故。此解虽通人法二执。准所知障名金刚。不说烦恼障。彼唯佛菩提智之所能断故。复异释如前既说。解二中有二。初总解见义。后配二经文。经文有二依。初二住处。解二治故</p><p>五不失中有二。初征。后显。显中有二。初解不失之义。后指经文。有遍计所执名增益。无依他圆成名损减。此是无著义。依龙树义。执有俗谛名增益。拨无真谛名损减。又真谛中非无非有故。执有为增。执无为损</p><p>于中若说言下指经文配。有二复次。释福聚及佛法二文。即福聚佛法俱是第四住处。欲得法身。第三欲得福相法身文。解佛法中有二复次。解初复次中有三。初配经增损。次解不共相应义。后指通配不共者。不与相应义。谓妄所执佛所说不与相应。相应者相契当故。所说契理故。解不共相应中。初标二。后重解。重解中但解相应。所不相应即是不共。以虽不说亦自知故者。谓依真谛。妄计所执不共之法。佛虽不说。以为真道般若之体。令人修<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>亦自知为无。故无自性。今就世谛说名佛法。由离二边境。断除法执故。能断对治。无分别道。不复更失地文。可解地前胜解行地名信行。以信为首。而起于行。未为证故。又胜解长时。必由斯初信。信于一切功德有故为名。又信自是初住处。行是余住处。合以为目。十地证得无漏智见。得四证净心。分除障名净心地。如来地显。不须别配。即究竟住处故。问何故前问唯问因中发大乘心。初信行地种性发心。次净心地是证发心中三种义。不问佛位及其佛答答如来地。答因中三行。是<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>位。<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>之因。若不答佛三身三德。果位明显。何以劝行。因中三行故。乘言便答佛三身。今前前故趣后后故。又问者问以可修。修通凡圣现当修位。答者答已前所证。证通<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。通现证故</p><p>七立名中有二。初问。后答。答中有三。初解金刚。次解能断并般若体。后重解不共义。初解金刚有二。初显金刚通能治所治二义相。后解能治。金刚如说。入<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>行。入邪见行者。正见谓正定聚。邪见谓邪定聚。<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>恶行。能入彼聚。名彼二.行。或泛指言。如说说善恶二人行善恶。此行入正见聚类。此行入耶见聚类。邪正虽殊。俱名见行。今者能治三慧。所治二障。染善虽殊。俱名金刚。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。金刚极坚。万物不能坏。除白羊角及以龟甲。智障虽坚凡夫俗智二乘菩提智皆不能断。或障虽坚。凡夫智不能断种。二乘真智不能断习。唯发大乘佛菩提心。三慧方能折伏或断。此喻入耶见行。又如玉石性极坚牢。非物所坏。唯除金刚。方能摧破。二障亦尔。性极坚牢。非凡俗智。二乘真智之所摧坏。大乘三慧如彼金刚。方能伏断。究竟断位金刚修慧。故经唯说金刚喻定。此喻正见行。是谓金刚名有二义相。一所破义。二能破义。非是能断亦有二义。非所断故。亦非以金刚及能断。为有二义故。邪正二见喻不相应故。故不可以金刚唯为所断。智因坚细不成故。亦不可以金刚唯为能断。二义相不成故。由此应如此中所解。然文略不解出所治金刚。于能断中。庵含方显。解能治金刚中。标细牢固。以隋时翻国讳坚。遂改为细。智固者种子。不可坏者现行。现行中初是闻思。后是修慧。修慧之中。初是有漏修。后是无漏修。无漏修中。初是十地位。后是如来位。十地中。初加行道。后是无间解脱道。无间解脱道中。初是无间道。后是解脱道。佛位中初是种子。后是现行。能断中。闻思修为能断。观照能断之体。七地已前。初二有漏。后一通二。设前二慧修中通成。虽无文说。然为修慧等。别时起作用。八地已上念念俱能起二用。初二伏或。后一正断。如金刚断处而断者。智如金刚。所断如玉石。二障处而断。又障如金刚。能断为地如白羊角。闻思修能断处而断</p><p>解不共义有二。初标指。如画金刚等。后显五通。依此不共义。初中有三。一标。二指。三结。如画金刚有二。一如画金刚。膊跨则阔。其腰则狭。有动作故。喻令进趣。二如画金刚杵。两头阔其腰狭。极坚胜故。令知深妙在信行地。佛地阔者。此喻文义俱长。净心地狭。文义狭故。所以然者。有二义。以凡夫时。凡所修行。求<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>万行究修。欲愿广大。虽有四善根位欲入见道少别修行。从长时多分广大意乐。故名阔。佛位中通业智见。证达利乐。皆是广大。故说二文。正所广阔。十地菩萨等地皆修一行。进求后地。虽少求佛位。非无分齐而修。故名挟。故随三位。说经阔狭。又今为不定性及定性先未有种性发心者为问。三答有三种。性发心无分别行。令求佛果故。佛果及初位皆文义阔。十地行相彼虽有。而由不能修因言而显。不须广指。非二乘等初发心所行。故略指狭。结云。此显不共义。诸经不尔。不名不共。由此所明理智阔狭故。此文字教。独名曰金刚故。第三金刚称不共义。显五通依不共中意说。下文所说。五种依义。说相摄持。安立显现。皆依此三地。离此地外。无别所明故。此三地各有多行所住处。故名上上依止。以非一故名上上。此中略不解般若。但说三慧。不论实相等。不尽法故</p><p>上来解七句。中正述之宏纲竟。自下正释经文中。第二大段重解前文。释玄宗之巨委中分二。初解序中威仪成就结加趺坐<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>不动。后解正宗。虽行住坐皆可说法。今显<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>于觉说胜。表内心觉安真理外相方说利生。但以一义解之。余义如说法华威仪。安坐中说</p><p>后解正宗分三。初解种姓不断中文。次解何故唯问发行菩萨乘等解发起行相中文。后解以善问故。于上座下。解行所住处中文。初中分三。初解三问意。次解发趣菩萨乘者。菩萨摩诃萨言。后解次前最胜受等义。于经文中。从后向前释。观此论所释上下等文。皆是天亲释弥勒颂中所无文者。方始解释。非是昆季。自知相[矛*牟]楯</p><p>初文有二。初问。次答。答中有三。初标。次解。后结略标中有三。初总标。次别列。后结所为。别列六中。初五为利乐众生。后一为正法久住。前五之中。初二佛法外人心有疑或。不生定信。次二已入佛法。欣佛法者。不解进修。后一已进修者。不能证达。此但问因。是须菩提所欲修故。唯问种性及证发心二所修法。不问佛位十地菩萨己证达者心所欣求出离解脱佛果之位。总显种性不断。有二义。一此中已闻欲令当来佛种不断。二明佛能令佛种不断。以能善摄及付嘱故。此中六因依古所说。合有四解。一云。第一住佛法外。由有疑惑。多生诽谤。今问冀答。以断彼疑。令发信心。不生谤诽。起菩提心。二起信解者。若先虽不疑惑诽谤。但处中位。由不闻解。不能发心。今为于彼闻法起信入十信中前五心位。三若入十信住第六心后。信决定位。名入甚深义位。若先虽发大菩提心。犹在十信前五心位。尚断善根。未信决定。不名入甚深义位。今为令入第六心后得信决定。深识佛法因果理智信智不退屈。由解深义。方无退信。名入深义。四若先虽得信不退屈入甚深义。十住位中入前六位。尚有退作二乘之心。今为彼等无退大意。入第七位。后名不退。五若先虽得入位不退。乃至得入十回向后。得四善根入决定择分位。犹未证达真净法界。不名生如来家。未名住极喜地。未得法苑乐。未证诸相增上喜爱。不名生喜。今为彼等得入十地证得法界入后后道。六由人信学。进趣证达。当来正法。教行果三久住于世。为此六因生<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>故。以发三问。地前地上皆有发心修行断障三义别故。结云。此是问者欲令佛种不断故问。以上一位配。下更三义位配</p><p>次解中有二。初问。后答。答中顺第一解。初人可解。第二有乐福德等者。有先凡位不谤不信佛法三乘。但处中住意。其何在世耶有乐为福德。未发信心。名未成就。今为令彼起信解故得入十信。第三入甚深义。即前二人深达因果得信不退。第四若已得入信不退位。名为已得。不轻贱者。<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>法决定出离。堪当得果。名不轻贱。入位不退。第五已得顺摄。是先根熟。但在位不退后。及净心者。位不退前诸菩萨等。不由于他起根本智。于法自证入。起后得智。于法得见。得入十地后。后亦复如是。生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>故。又第二解。初一人法外令入十信前五心。第二人五心前入信第六心后。信决定名信解。从初人作第二。第三入甚深义。即第二人在六住前者。得入位不退中。第七住后。名入深义。第四人不退转者。已得位不退。得入初地证不退。第五为生喜者。即是次前得入初地。根已就者名为顺摄。展转得入二三地等。若已入位不退。后人名净心者。得入初地。合名生喜。又第三解。初人法外初入十信位。第二人业五心前得入第六信不退后。第三渐入初地。证入甚深真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界。第四证入第八地后行不退后。第五见道已后。证不退后。名顺摄。入八地名净心。得无漏心。恒相续故。皆生欢喜。初地顺摄展转得入佛地。生欢喜。八地净心不久得入佛位。皆生大欢喜。虽有三释。此解似佳。由问但问因中三行今因得证后后胜品乃至成佛。具答三位诸行。从初发心。及至佛果。是前前位所修入故。今细审勘。地前凡夫唯三十心。初住法外令信入法。次在六住已前。令入七住。次在地前。令入初地。次在七地已前。令入八地。后在因中。令入佛地。各随彼位。以释其相。令法久住故。众生可得入前五因。由众生得入前五因故。法成久住故。发问者广为六因。略为二因。余如玄记说</p><p>结略为四。但结前五。所学教理。即法久住。故不说之。其法外人疑者。令见因果等理。发生信心。入佛法内。如已发心乐福德信未定者。能摄受信及胜解定。已信解定成就之人。摄受初地。入甚深义故。今此二名为摄受。摄受信定及证定故。得入初地。知绍佛位。名得不轻贱。欣八地后胜品妙行。令精勤心。不生行退。八地已后无漏观心。念念相续名为净心。得入佛位。令生欢喜。此结次第依行位说。但说净心生大欢喜。前广释中并说顺摄。令生大喜。即入初地。顺可世尊善摄受故。总令作佛。故二合说。若依次第。应依结略。略为四因中。初一因为法外入法。第二人为内凡入圣。第三为七地前入八地。第四为第八后入佛位。说信行地为初人。说净心地为第二第三。说佛地为第四人。上来三解。依位配之。第四解作三问者。初问为初人令发心。次问为第二第三人具修行。后问为第四人令断障。由三人各修自所求行已。净心生喜。乃至作佛。故结略中合第二第三为一摄受。摄受行故</p><p>解种性不断中。自下第二解摩诃萨言。即兼解大乘义中。大义诸译并略无摩诃萨言。大唐及隋并有七大。七大者。一法大。对法第一名境大。缘于广大教法为境。二心大。彼第七名业大。穷生死际。示成菩提。建立佛事。三信解。大彼名智大。即了二无我。四净心大。彼第五名方便善巧大。不住生死及于涅槃。五资粮大。彼第二名行大。行二种行。六时大。彼第四名<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>大。经三大劫。修难行行。七果大。彼第六名证得大。证大功德。彼论意说。缘教起行。达甚深理。精勤长时。不滞二边。证大胜果。穷生死际。建立佛法。故名为大。此论翻倒。或此意说。缘教发愿。建立佛<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。得智达理。不同凡夫二乘有所住着。常行二利。长时精勤。便得胜果。二论意别。前后不同。更勘菩萨地十地论初卷说摩诃萨者有三种大。一愿大。二行大。三利众生大</p><p>第三解摄受菩萨等文中分二。初摄受。后付嘱。前解摄付时初成正觉及入涅槃时及所摄付<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>。天亲云。根熟名摄受。未熟名付嘱。而未解释二种自性。天亲但解所摄付者及摄付之意。即此种姓不断。未释彼自性故。今释之。于中有二。初标问。后别解。此中分二。一善摄。二第一摄。罗什菩提流支真谛并无两文。唯大唐本云。最胜摄受。摄受诸菩萨摩诃萨。最胜付嘱。付嘱诸菩萨摩诃萨。经文但以一最胜言。前文牒经文云。第一善摄摄受所有菩萨等。遂开为二。以最胜言具善摄第一两义故。下解付嘱。唯言第一付嘱。道理定尔。又善摄是总出体。第一是别解义。善摄第一摄为二。第一摄中有三。一标。二列。三解。乐谓与现在利益。利谓与后世益。即差别中世间定是现乐。三乘果是后利。利乐有十义。如唯识疏。此中唯在。第四牢固。谓后益毕竟果体。现益毕竟因体。俱名毕竟。第六异相未净菩萨者。谓地前信行地未得净胜意乐故。于彼菩萨不可善摄中。此善摄法最为胜上。毕竟难坏。能利自他。更无过上。为二世益解付嘱中。亦三。初标问。次列。后解。善友所者。谓将入涅槃时。根熟菩萨为所入处。为根未熟者之善友故。故知天亲依根未熟说后付嘱。付嘱与根熟。无著说在入涅槃时。解不相违。以根未熟为能入者。其根已熟。为所入处。其根已熟。法尔教化。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>根熟。汝既得已。可转教他。由此未熟不失善友所入之处。法尔根熟。悲愍未熟。佛令转教。令根已熟<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>尊重求佛教故</p><p>下解正宗。第二以发起行相总文。初二句问。后二句答。答有三意。一答。由三乘菩提果各差别。唯问大者发大乘心。最胜乘者所趣究竟果故。能广益故。不问余二。二答。以能化法化所化生。后得果时。有三身果别。若问发行菩萨乘者。能以三乘法化所化生。令得三菩提。二乘不能。故不为问。三由三乘者菩提有异涅槃无差别。大乘菩提断二障。证二理。行二利。成二智。唯问趣此不得取余。三问别义如前已解</p><p>下第三段解行所住处中文分二。初解赞印中善哉言。后解正陈。以须菩提问。顺可深理。是五问中。为欲利益有情故问。佛赞其问。故言善哉。重赞叹之。然菩萨行见善说者。施言善哉。今以须菩提问契玄宗深可道理。重言善哉。准十地论第一卷解善哉云。所说法中。善具足故。善哉有三。一所缘谓净慧。二体性谓说诸地未曾说法。三果谓具十力等无障碍。佛菩提故。此亦如是。准彼应说</p><p>正陈之中。大分为三。初明信行地。次后卷中为证道下解净心地。后上求佛地下解如来地。说彼彼地。令住前前下位欣趣。下皆准知。初文分四。初解摄住处在十住位。创则安其心于彼彼法。行犹未胜。故名为住。次自此后。余住处中下第二解波罗蜜多净住处。次为欲得色身住处下第三解欲住处。合欲得色身法身二住处。为一欲住处。此上二住处在十行位。行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>诸行胜故。名之为行。次后卷初已说欲住处竟下第四解离障碍住处。在十回向位。凡所修行皆为回向。立回向名。依前略为八住处中。初六住处说为三地。以彼八住处中.后二住处通诸住处。非别配地故。后卷初云。今说离障碍住处有十二种障碍对治。十八住处中。合十二为第四离障故。前十六住处为信行地。分为四文。初二各一。合二为第三。合余十二为第四故。或分为二。初解摄住处。后解余三住处。以波罗蜜住处文初云自此后余住处中有五种等。合明以下文各以五义解之。故合为一段。初名摄住处。若远解者。亦发大心。远期摄受大菩提故。近解释者。发心已摄受正法。摄众生故。通二解者。发期愿。摄受正法成佛利生。近远二摄皆在中故。前十八住处中名发心。是种性发心。初.所起行相为名。此名摄者。以当成果及能利众生。而为名目。文分为二。初别解四心。后总答三问。依天亲论。初文为四。初解广大心即是初住。次所有众生界施设住施设已者下解第一心即第二住。次如是无量众生入涅槃已者解第三常心。即次四住。何以故若众生相命人相相则不名菩萨下。解第四不颠倒心。即后四住。如中卷释。弥勒天亲总科文意。此中别释</p><p>释彼所无。初文分二。初解总所有众生文。与罗什同。单言一切众生故。后卵生下别解三类。流支重言。所有众生众生所摄。大唐本云。所有诸有情。有情摄所摄。初言有情总谈也。后言有情者。世间有二。一有情。二器。今有情世间类摄之所摄。不是器世间类摄之所摄。又不佛化众生。菩萨观行有五无量。如障广说。一有情界无量。二法界无量。三世界无量。四所调伏界无量。五调伏方便界无量。今总言所有众生。在五无量中。初有情界无量有情.摄所摄。是第五调伏方便界无量。此调伏方便界无量。名为能摄。是诸有情之能摄故。为此有情能摄之心所摄者。即所堪化一切有情。初总欲化度。先观有情。有情无实。唯有诸法。以为自体。彼诸有情必住世界。依彼界处。观察所化性欲胜解所调伏异。然后应彼设调伏方便。由初有情。数非一故。名为无量。故经总言所有诸有情。乃至最后设调方便。亦复非一。故言所有有情摄所摄。初所有言。贯通下人法。人法即是五无量中初后二种。令初发意当成初观。故举初后。以例中三。广大第一等义皆如玄记说。五无量如章说。恐繁不引</p><p>卵生等者。别显三类分三。初总标差别。显前文总。次略举三别。后配别三。受生依止二义可知。境界别者。无所有处已下乃至欲界中。除住无想天二无心定无心睡眠无心闷绝。此五有情外。余皆有粗境。有明利想。名为有想。显五位中无六识故不缘境界。皆名无想。在有顶地。极闇劣故。即以无少所有地法。而为境界。不如于前有想地。境界粗显。心想分明。名非有想。亦不同前五无心位全无心想。名非无想。有少细想。无粗明想。是故双非。想能取境分齐像貌。对境名想。外道多计为生死因。故偏说想。不名有心心所等举想。摄余诸非。色蕴色像之身。相状易知。心以想微隐。故对依止名有色等。不名有心等。死灭为终。生起为始。因初有后无。故依生类。名为卵生等。不名卵死等。此显初心愿意所化。总说一切无不周尽。应依界趣地居止等种种义门分别此三。问何故不明界趣所化。但明此三答受生通<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。总也。依止于五蕴中色非色蕴。以辨差别。境界复依四非色蕴。能有境界。而显差别。从粗至细。展转而谈。亦显界趣。在于中矣。欲令舍生死而得涅槃。故说受生。欲令舍无常色等得常色等。故说依止。欲令断除分别因故。故说境界。心想为分别因故。断此疑想。成无分别智。又外道说想为生死之因。无想为涅槃之果。今说彼俱生死可度。更不说余。故论说言。受生依止境界所摄。问依胜鬘经及瑜伽三十七。有四所化。谓三乘众及无种姓。或依楞伽。说五乘等。此中言总亦摄法尽。何故次须言。我皆令入无余涅槃。无余涅槃三乘众入。非第四故。其胜鬘云。无闻非法众生以人天善根而成就之。善戒经菩萨地亦尔。岂无种性亦入涅槃。经皆令作佛者。说一乘一道皆得作佛。应解佛意。答有三解。一解。若久学行。识知根性。于无种姓人天善化。胜鬘经文云。若初学行。未识根性。但总发意皆令入灭。此经文是亦不想违。二解。望其愿意。皆令入灭。此经文是。据实而论有无姓者人天善根成不得入灭。彼等经是。三解。彼别此总。理不相违</p><p>解第二段第一心中分二。初解所有众生界众生所摄文。后解皆令入无余涅槃。总中罗什全无。流支云。所有众生界众生所摄。此论云。所有众生界。施设住施设已。与能断同。能断云。乃至有情界施设所施设。此中意说。外道尼干说。草木皆悉有命。佛则不尔。于五无量中。彼初说有情界无量是也。此中施设者名也。能诠之名。或名为想。因想起故。或名无体。但是心想之所意解。能起于想。故名为想。或名施设。法本无名。名者皆是假所施设。施设不称法体。非但名。是法上施设。亦是世尊为异外道说草木等以为众生。唯说若有内五蕴者以为有情。能施设者佛也。正施设体名所施设。有情之体皆欲度之。非度外道所说有情诸草木等亦欲令其入涅槃也。是此中意。论云。谓上种种等者。谓上所说三类差别。种种体相在众生界。为世尊施设有情之名。所辨施。以为有情体者。总牒上来所说众生</p><p>下期化度我皆令入无余涅槃分三。初解何故不愿与余法而愿与涅槃。次解卵生湿生等愿得涅槃义。后解唯设令入无余不说令入余义。初文问云。何故愿此乐果体通世间出世间。何故不愿与世乐果。出世有二。一菩提。二涅槃。何故不愿与菩提果。善戒经第一及菩萨地说。发菩提心。愿令众生得大涅槃及如来智。何故此中唯愿与涅槃。依初解。问何故唯愿与此涅槃。不可得义。而不愿与世间之乐可得之果。依第二解。问何故唯愿与此涅槃。而不愿与当菩提果。其不可得义。是答之文摄。依初问解答云。生所摄故无过。以皆是生故者。前说四生。而生有死。以生为苦。灭生为乐。世间乐果。增生不灭。涅槃灭生。故愿与之。故言生所摄故无过。以所度者皆是生摄故。与违生涅槃乐果。依第二问解答者。以菩提者不可得义。二乘定.性不可得菩提。一切种智故。然依所度化者。皆生所摄。故与涅槃。皆是生故为灭其生。与涅槃乐。同<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>初发心愿言乐普令入涅槃故。非三乘者。皆得菩提故。不说与非一切生皆悉得入无余涅槃。此中说者。如前已解。又解。虽菩提智非皆可得。瑜伽初愿。一意乐普广。二由未解故。发愿与之。此文据实故不说与。更有别解。至下当知</p><p>如所说卵生等者下解第二卵湿生等得涅槃义。谓有难言。四生之内。胎化二生人天所摄。可有令得入涅槃义。湿生卵生多分鬼畜。云何能令入涅槃也。境界三中。有想一种可令入涅槃。既住无想及非有想非无想天。云何皆入涅槃也。依彼身现身入圣涅槃义。皆悉不得。故为此问。非是余地先已入圣。后生有顶。不能入涅槃。若依此文。不作此解。即生有顶。无入涅槃者。便与一切圣教相违。又言等者。于依止二。现住有色少分。可令入涅槃。现住无色少分。云何亦令入涅槃也。有色中<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>等。不能入涅槃故。一一义中。皆应疎失。初问意言。如此亦有无性有情不入涅槃。此问略无。以宜闻有。不宜闻无。又初发心宜闻总有。不宜闻别无。故略不问。又彼义谓决定不得。故不须问。答有三义。随应料简。八难处生。待时而济出难。根熟必化之故。如小山<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>鸽鬘比丘顶生王等。卵湿二生皆亦可化。此中据总以为问也。答中以有彼类可化之者。但约难处决定为答</p><p>何故说无余涅槃界等者下解皆令入无余涅槃义有二。初问。次答。前问可知。何故不总言得一切涅槃。而但言无余耶。然涅槃义诸教不同。涅槃经说。具足<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>大般涅槃。大般涅槃具常乐我净四胜德故。摄论但说。一无住处涅槃。又说二声闻之人以小涅槃而般涅槃。大乘之人以大涅槃而般涅槃。十地论说二。谓同相别相。胜鬘说二。有余无余。金光明说三。有余无余及无住处涅槃。又说四。自性净方便净有余无余。唯识旧梁摄论说四。自性净无住有余及无余涅槃。又说三事具足。入大涅槃。具足三事。非是三个涅槃。涅槃亦非三种。体成一涅槃。此中但简世间六行所得彼分涅槃及有余涅槃。不简自性。简中有四。一但简彼分涅槃非择灭者。二但简有余涅槃择灭少分。三自以宿业下双简前二涅槃。四如是涅槃等下结释简不说二涅槃因。初中但总言得涅槃。与佛所说凡夫外道所得世间六行伏或所得非择灭摄彼分涅槃。不异言中滥故。彼是五果中士用果。丈夫力得故。非离系果。体因所得。无佛亦得。由非究竟。故不愿与此。彼分涅槃。亦名方便涅槃。行世间方便因之所得故。无余不尔下第二简不说有余涅槃。前问可知。次答云。彼共果故。彼有余涅槃。有苦所依。身无苦所。依身皆共得之。虽解脱果非如无余。三乘<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>要无苦依。方始能得不共之果。是故偏说令入无余第三双简不说前二涅槃中。自以宿业。又值佛说而得果故。以二因解不说方便涅槃所以。又非一向故。以一因缘。解不说有余涅槃之所由。谓世间得彼分涅槃。不但丈夫力果而非究竟。亦由宿业。数习为因。而得现入。如劫坏时任运而得。又如下地。曾习次上地定。退生次下地。生已彼下地。由宿习力。任运渐习上定现前。岂无余灭亦宿业得。其无余涅槃要由外缘闻法力等。值佛说得。不同彼分方便涅槃不待佛说方便而得。又无余涅槃一得已后。圆满安乐。更无微苦。其有余涅槃。惑业虽尽。苦依未除。而非一向果。身苦有余故。故但说无余。不说二涅槃。此通三乘二涅槃义。若依佛位。有漏身智无名无余依涅槃。无漏身智在名为有余灭。便无是义。上来已说不说彼分有余所由。细料简者。由度三乘。不说令得大般涅槃及无住处及三别相自性清净并大菩提。论中以经说发大心所度令得三乘通化。故但简二。今彼如有余三乘。通得。余非涅槃。论亦自说非究竟第四结释不说二涅槃所以。初牒二涅槃。次别以四因结。后总结是故说无余。一丈夫力果故。二非究竟果故。即前习业果。其究竟果必加行因得故。此二因结释不说方便涅槃。一是共果故。二非一向果故。此二因结释不说方便有余涅槃。总结是故但说无余便无是过。其无住处及大般涅槃。大乘得。二乘定性皆所不得。亦不说与。然菩萨地及善戒经第一卷。初发心愿大般涅槃及大菩提。与此全别。此同华严经初发心位愿得无余。略有三解。一云彼即同此说。大乘无余涅槃胜故。影彰亦得菩提。二云。此依种性。非皆得佛。故得无余。彼说意。想愿作佛亦不相违。三云。初犹未解。彼愿皆得。此依种性。不说菩提。此皆发愿。故略不问。亦不愿得自性清净涅槃。彼已旧成。不须问说。故但简二</p><p>第三段解常心中分三。初解经牒已所度生。次正显常行。后释成常义。初文可知。无有众生得涅槃者下显经常行。初牒经文。问可知。解云。如菩萨自得涅槃。无别众生。虽度入灭。如菩萨身自入涅槃。不见身外别有众生。故是常行。何以故。若菩萨等者第三释成常行。初牒经文。问可知。唯言有众生想。对自明他。故唯说一。不说余名。解云。若菩萨于众生所。起他身想。不作摄他。同已想者。不名菩萨。下解证道等中。由诸菩萨证真智。后得摄诸有情同自性意。令初发心设虽未证亦依此解。由无此彼。不生劳倦。故能常度。若见身外有别众生。无同体意。执生劳倦。便不能度。设度不常。故辨中边十六空中毕竟空云。为常益有情。由观有情毕竟皆空。故能常益。此亦如是。不见身外有众生故</p><p>第四解不颠倒心中有三初牒经文问。次正解。后成之。所牒经中流支何以故下有非字。余三本及此论皆无。由上来再个何以故皆乘前起问。方起下文。此后何以故征。逐有非字。何以故非菩萨。能断之中。初何以故。后所以者何。此本及流支说三。谓众<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>人。罗什本四。增我。能断说八。唯说三者。但说所化别有三世<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>等异。他三界身三世身多异故。不说自我。说有四者。顺上下文。自他总别通说故。四说有八者。依贞观年中玉华所译。杜行顗本说有八故。后显庆年。于玉华寺所翻大般若。勘四梵本。皆唯说四。然瑜伽论摄释分中亦解经八。以此准知。经本自有广略中异。杜顗广本。能断文是略。于阗本罗什文同。中者是<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>本。与真谛流支本同。玉华更译。文亦相似。今于慈恩梵经台。具有诸本。但以前帝敕行能断。未容闰饰已所于代。恐更极谬。遂后隐于玉华复译。所以诸本增减不同。学者知矣</p><p>正释中若以烦恼心。取所度生。起三想者。彼能化菩萨便有自他二种相转。乃起颠倒。云何名为菩萨.也。释成云菩萨于彼不转者。证真菩萨于彼所化不起他身众生想故。由二因缘。不于他身众生想转。一已断我见。得无我故。烦恼无也。得自行平等想故。法执无也。故下论云。得粗恶平等。故能信解自他平等。劝发心者。亦应如是。通结成云。彼菩萨非众生命人取见者者。非者无也。由诸菩萨无众生等执取故。无自他能所化度。是经之义。故不颠倒。若有如是能取见心。乃名颠倒。能断更结。善现是故无有少法名为发趣菩萨乘者。结成无我。所化无故。能化亦无。余本无此。又罗什本。于经文中。但有一文。即非菩萨阙无初结合为文故。其天亲论唯以一颂。配解此经。菩萨地说。最初发心有二奇法不共世间。一摄诸众生。皆为眷属。上来解是。二摄眷属过所不能染。由无增损染违顺故。于彼众生。发生利益。安乐意乐。离恶进善。拔苦与乐故。此最初发生四意</p><p>解摄住处中第二段指答。三问中分二。初指文。后重释次愿。即摄广大第一二文为欲愿。答初问。正求思念故。以常心为等至。答第二问。略无经文。实无众生得灭度者。若依罗什。无初重即非菩萨文。便无此答。正起无分别定。故答修行。后翻不名菩萨。设住散心。无分别。答第三问。文有三。初配文。次释义。后成前。释中尔涅槃者。境界也。定位观诸境相。都无自他故。在散位如在定中住观境界。亦无他相。后却成前修行云。是故无众生得涅槃者。此义得成就</p><p>重释欲愿中有三。初显胜。二显行。三显不说。初文意说。欲说利行。先欲希愿满足。次修正行。修正行者。应于定散一切时位。伏除执障。执障不除。行不能修。行不能修。欲愿不满。故以欲愿。摄诸住处。而为最胜。进善灭恶之胜首故。显行中但行无相无分别定灭诸执障。行诸住处。与定.相应。其所欲愿决定成满。住有分别。不除执障。谓浪自济生随自后生广大欲愿。无由满足。显文不说欲愿胜义。其文可知。若依天亲。上来合是唯答初问云何住。问无著天亲共遣慈氏。内称昆季。外号师资。俱释经文。并为人范。何因弟制两周。别酬先问。兄分三段。总答前征。成依地而渐修。或释疑而显起玄宗。便异粗梗概。以为言识义残文故。不可而言。[矛*牟]盾以为师义。师文固不可而言也。既而[矛*牟]盾。前哲如何华萼。后贤愿辨指南。以骏未悟。为辨指归。以骏来悟。答为谋日积久。应彼道同。入室岁盈。信成风靡。此中三问。第一问弟制两周者。是先德之迷宗。兄分三段者。乃今修之悟旨。无著禀偈于弥勒。天亲受旨于贤兄。何得兄说一周弟分两遍。天亲亦一周而说解者。自迷云。尔有别解。已如前释。又第二问弟别酬先问兄总答前征者。弟随文增以制答。兄逐义具而酬问。又兄随利根以释文。弟逐钝品而解义。又弟逐初学以申宗。兄随久修陈旨。由此不同。不相违也。又第三问。兄依地而渐修弟释疑而显起者听者但随信定。即说进善灭恶之门。闻者有疑生。即逐他情。以陈妙道。兄随前义。依地渐修。弟遂后说。释疑显起。又兄但依宗以释义。弟乃假说。以明生文。二制状似不同。理实非相[矛*牟]盾。大同小异。应释二文。如下当说</p><p>此中发心有二问答。一问或有种性而发大心。或无种性亦发大心。既俱发心。云何应知。当得佛果。二种有异。答菩萨地说。若有六度种性相者。发心得佛。不尔不得。谓有施种性相者。性乐均布广大慧舍。无财惭耻。赞劝随喜。受寄无差。他债不抵。共财无负虽求财位。意乐广大。设得速厌。济拔怖畏。好说无罪。有戒种性相者。性成软品不善三业。不极暴恶。不损恼他。起恶速悔。多行爱受。应敬不慢。所作机捷。善顺他心。先言悦视。知恩质直。如理希求。喜修福业。见苦深愍。过于自身。小罪重怖。如法同事。非法不同。废已成人。爱德谦自。有忍种性相者。性被他害。无返报心。陈谢速受。不久坏怨。遭苦能忍。能印善说。有精进种性相者。性自翘勤。夙兴晚寤。所作勇决。方便究竟。善事坚固。于真理心不怯弱。于求胜果不自轻蔑。难业<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。大事无倦。有静虑种性相者。性思法义。常乐寂静。爱慕出离。缠盖轻微。恶思不扰。见苦深愍。随力拔济。乐施利乐。记法无忘。有慧种性相者。成俱生慧。能入明处。性不顽钝昏昧愚痴。于放逸处。乃能思择。若先有此六度习相。发菩提心。当得佛果。无种性者。无是本习。虽复发心。当不得佛。二问若有种性先成。何故不速作佛。答由四因缘故。不得作佛。一不逢善友说菩提道。二虽遇为说倒执倒学。三虽无此倒。方便慢缓。<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>懒堕。不勤精进。四虽勤精进。善根未熟。资粮未满。亦未长时修菩提分。无此便得。此初发心有五德相。一者最初发心所有正愿。普摄一切。其余正愿。是故发心以初正愿。为其自性。二者谓起愿言。愿我决定。当证无上正等菩提。作能有情一切义利。毕竟安处究竟涅槃及以如来广大智中。是故发心决定希求为其行相。三者以大菩提有情为境。故有所缘。四者此初发心摄诸妙行。能违有情一切恶行。故与一切功德相应。五者此初正愿于诸世间出世间愿。最上第一。此初发心即名趣入无上菩提。在初劫内。预在大乘诸菩萨数。能为无上菩提根本。大悲等流故。分为一切学之所依止。从此已后。或有退屈。或无退屈。明退还修。有退不修。此初发心由四种缘。一见闻佛等有大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力。二听闻宣说菩萨藏教。三见法将灭。念言法久住。能灭众苦。我应当发心。当作是利。四末劫末时见恶众生十烦恼多愚痴等之所恼乱。念言于此发二乘心。尚难可得。况大菩提。我当发心令他学我。复即四因。一具足种性。二善友摄受。三悲愍众生。四难行无怯。摄大乘云。清净增上力坚固心胜进。名菩萨初修无数三大劫。大菩提心以善根而为自体。名清净力。降伏所除障故。以善友为缘。名增上力。以不退屈为策发。名坚固力。虽遇恶友方便阻坏。终不弃舍大菩提心。所修善法运运增长。如此胜进。齐是名为最初发意。从发意后新熏有漏闻思种子。辨所资长无漏种子。合二名为习所成种。于生死海。作出限量。不久定当速证<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。故所修行法名波罗蜜多。所遇善友有四种相应。当了知亲近受学。一聪明点慧不堕恶见。二不教放逸不授彼具。三不教恶行不授彼缘。四不劝舍先所修胜法令修劣者。乃至终不劝舍大乘令修二乘。与此相违。是恶友相。应当远离。广应分别发心住差别因缘功德多少等。皆广如华严经第五十七卷并善戒经第一菩萨地第一等释</p><p>解信行地。大文分三。初摄住处是十住位竟。次二住处是十行位。波罗蜜净住处是初六行。其欲住处是后四行。波罗蜜中初明布施是初五行。不住相想是初六行。欲住处是四行。欲得色身是第七行。欲言说身是第八行。欲智相身是第九行。欲福相法身是第十行。或分四</p><p>上来解摄住处竟。自下第二波罗蜜多净住处。文分为二。初标五义通解下住处。后方解施行或信行地大文分二</p><p>上来已解摄住处竟。自下方解余三住处。文分为二。初标五种通诸住处。后别解三住处。初文分三。一标五种随文与彼五义相应之处。即配解释。次列五名。后释其义。问何故上说摄住处中。不以此五各别配文也。答道理皆有。谓应生如是心依义。显示对治不失心故。我皆令入无余涅槃等。是说相。即此令入无余涅槃。是摄持。摄持心即欲愿。实无众生得灭度者。是安立第一义。若有我相人相众生寿者相。即不名菩萨为显现。是相应<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>及摄散心。但以前问有三。答文皆具三义。初且释配三答。不以五种配文。非前文中无此五义据增说故。如天亲解。初文答初问。施文答第二问。非无余义随增为答。亦不相违。又为影显中间之文。显具五义。影显前文。理亦具五。故略不说。依义对治即所断障住处。安立即所证理。初问欲愿即摄持。后二问相应三昧及摄散心。是显现。即所问行等。总为说相。三问但问能对治行。略无所对治障及所证理并总说相。影显问故。彰理难故。逐易问故。答皆具明。欲令解故。断<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>三。皆具答故。对法等云。真如圣道。烦恼不生。今明因三亦当得彼故。随住应说。释义中解此经所明。诸住处内。此所对治为依义。依其所对治。方说能治行。能治行者即次愿等。故所治者。名为依义。其总所明住处之行。为所说相。所说相者即是欲愿等持摄散三种行也。每欲修行。初生欲愿。为能摄持。能摄持故。所摄持行等持摄散方得成满。住处之内。第一义谛为所安立。内证实际名非安立。今以言说。施设真如胜义谛理。故名安立。前所对治能对治法无分别定。名为显现。正是经中初欲愿心所显。宗趣无分别心。名为显现。摄伏散时亦是此摄。文中略故。准下定体。前说欲愿名能摄持。无分别心摄伏散时。是所摄持。此说等持摄散二位。名所显现。彰前欲愿。是能显现。前后名别。影显胜故。行彼行时。无分别定。名曰相应。所对治障相应之定。是修行者所相应定。亦是无分别智相应定。亦是真境相应之定。名为相应。五瑜伽中摄四或五。能修行者。名曰瑜只</p><p>解波罗蜜净住处经文</p><p>施行中分二。初解五义。以答三问。后何以故菩萨不住相下释此疑难。准天亲论。初明施行答第二问。不住相下答第三问。答第三问中复二。初正答问。何以故下方释此疑。彼随文相增明。以辨答。此随义具以明于答。亦不相违。各据一义。初解五义答三问中。据义具五。论自配文。答问分二。初三不住施答初问欲愿。后不住相答后两问。答初问中。义具四种。三不住者是依义。三行施者是说相。即此行施。是摄持即此不住。是安立。当审寻文。自应悟解。依义文可知。三不住皆依义。皆除住着执故</p><p>解说相中分三。初总配属说相经文。次解唯说施行所以。后彼诸波罗蜜下解不住施行差别。配说相者。三不住中。所行施者。皆所说相。发心已后应修诸行。故以施行为发心后所说之相</p><p>次解唯说施行所以中有二。初总标释。后别显释。谓即有难言。菩萨妙业经陈八万四千。何此中唯说布施。故此总标<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。摄在一切檀那行自性故。此中文倒。应云一切檀那行自性摄六波罗蜜故。此经中唯说施度。一切已周。问此若尔者。乃至般若亦摄六度行。何以故。不但说一慧摄于一切。答施为修行之初。粗而易习。体又广而包总。故唯说此。亦显而包。总标经名。据胜慧而为目。答修行举初业而为名。然观文意。百千诸行唯说施者。以施摄于一切行也。前摄住处是十住位。此波罗蜜净住处等是十行位。说欢喜行等。各各次修一。略故唯说施。摄于六度。不说。施行摄一切行故。又菩萨行有四。一菩提分。二波罗蜜。三诸神通。四成就有情。今举初行。以明摄彼。亦不相违。下当配文别释有二。初标施有三。后随别释。此中三种。天亲论中各别解释。玄记之中亦会同异。应寻揽之。法施中有三。初标列。次显相。后结成</p><p>彼诸波罗蜜有二种果下解经文中三不住施。差别有三。初标列。次随释。后配经。随别释中。施得大<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。谓多<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>增上果。戒得自身释梵等。生尊贵身异就果。忍行得大伴大眷属。精进得果不断。定得身不可坏并增上果。慧得根利。是等流果。多悦乐果有二。一无为离系果。二大众中得自在士用果。现在果有二。一得信。敬<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。是增上等流士用三果。昔施于他。今得他施。位等流果。二得现法涅槃。谓世间六行所得非择灭。似无为等现法涅槃。法谓道理。现世灭粗重。得非择灭理。是士用果故。前说言丈夫力得故。又现法涅槃有五。一现得五欲乐。余四引得色界四静虑现在前。与轻安俱除少粗重。亦名现法涅槃。俱名现在果。随其所应施等所得。配经三不住施中有三。施未来果为一。余五度未来果为一。现在果为一。然色等五尘与法尘别。遂离为二。信敬供养等。五尘摄故。五现涅槃。法尘摄故。解摄持中。经言应行布施者。即上来说三应行布施。解安立中。不住行施者。亦是上来三不住也。文分为二。初属经文。后释初第一义相。以不住故者。无住着是第一义故。如所有事第一义者。即三种施中不住是第一义。如所有事者。谓前说一于事施不住二无所住施三于六尘施不住。如此三种所有事中。皆不住施。名第一义。故论结云。所不住物等。是所有事等言。显示举初事。等取无所住于六尘施。合此三种。名所有事。于此三事等中不住。名第一义谛故</p><p>上来行施。解初四义。下解第五等持及摄散心。文易可知。相者境。想者心。天亲论云。施者受者物等。随应六度三事之相。取此三相。名为相想。即是想倒。谓有七倒。即常.乐.我.净想心。见倒。今明想倒。摄心见等。观三事空。起三轮净。故名不住。能断云。如不住相想。上来欲愿尚不住着。其等至等持摄。散亦尔。应如初不住施也。故有如言。或依真理。性无住着故。应施想如理不住。依天亲解。若降伏心而除障者。如所修行不住相想。障心自断。此随义具总答三问。天亲论主依初行者渐次而修。文相增明。别答三问。如上来说。天亲论中解三不住施。与此差别。云自身及报恩<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>斯不着自身果报是此未来果报。恩者是此现在果。虽大体相似。然所望有别。义出百途。亦不相违也。依此义故。真谛经云。不着已类而行布施。不着所余。行于布施等。上解五义以答三问。解初五行竟后解何以故若菩萨不住相布施下释疑难</p><p>次明第六行。文分二。初征。后释。天亲论云。此中有疑。若离施等相想。云何能成就施福。谓有疑云。三事不空。施可有福。既空三事。施福应无。故此论云。或有菩萨。贪福德故。于此不堪。由贪福德。能行于施。闻此三事空。不能堪忍而行施等。故次征云。何以故。后释经文分三。论中分二。初释法。后解喻。不解法说。解喻中初因不住相施。如空遍满。相无相果皆得依故。住相施不然。不得无相。故非遍满。次因宽旷。无住相施。后得果时。形上下高。无漏之法过三界故。形横旷大。满十方故。住相施不然。后得果时。但在三界。非十方故。或含容故。名为宽旷。后因无尽。顺无相理。广运众生。无穷尽故。住相不然。不顺真理。非遍益故。经结说中。真谛无但应等文。与中天梵本同。余本皆有。此论牒经不解。故知亦无其结。无住相施。福德皆多。诸本同有</p><p>次第三解欲住处。此依八住处解。依十八解。此中有二。初欲得色身是第七行。后欲得法身是后三行。初经文有三。初问。次答。后成。问中有二。依义说相。成中有三。摄持安立显现三种。答中全无。不异初后文义相故。取佛说故。欲得色身住处者。初学菩萨多有相修。乍闻无相三轮净施。便生疑惑。且如释迦佛。身既有生住异灭相然。故知有相施因。还成有相之果故。天亲论云。云何生疑。若不住于法。行于布施。云何为佛菩提行于布施。彼以释迦生灭之身。为菩提依身行有相施得。若行无相不住法因。应还得彼不住相果。云何得彼生灭果耶。今此论中不以有疑。但说行者初修学故。未悟无相。行有相因。希求佛位。释迦有相生灭之身。此是色身相好身故。以此相身。为佛菩提胜所依止。故论说言欲得色身。彼论解意由。因前说无相施因。以生疑虑。为彼破此疑故。有下经正破彼疑。此论意说。由初行者有相施欲得释迦等有相之身。即以化相身。为真身体。得少功德。谓是真身多功德体。故言为欲得色身对治色身之慢。得少有相功德之身。谓得真实多功德身。是增上慢。为破此慢。故有下经。故合两论。今两乘前文。以生或名疑。悕伪相。以为真称慢。为破疑慢二或。故说下经。初修行者。定不定姓。大乘异生疑或。是烦恼障。亦兼所知障。初修行者。圣人发心。便通二障。有学通烦恼。无学唯法执。如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗闻<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。方断疑悔及忧恼等。此亦如是。即由上来所说义故。诸人不悟谓天亲论乖无著说。应审观察。此会同意。实不相违。故天亲云。自此已下一切修多罗示现断。生疑心。故知彼论依因前说初学疑起。生下经文。以破彼疑。此论依于初学希后。非真实功德。而修于行者。为破彼慢。生下经文。不相违也。又彼论依利根初学多生前疑。故说下经。此论依于钝根初学多生后慢。故说下经。又彼论中。依文相增。前后三文以答三问。故别作道理。以生下经。说破疑起。今此论中依义具足。文文之中。皆答三问。故非异道理。以生下经。说为除慢。实不相违。又彼依破不定烦恼初学者疑。以生下经。此依初学。断决定烦恼增上慢故。以生下经。上来四义且依同义。以会二论。依异义者。复有四义。此论依为乐广闻者。故说三地。从凡至佛。皆具说之。文文具答。生慢起文。彼论依为乐略闻者别答三问后皆断疑。又此论依为利根之人一闻即悟。故说三地。一周说经。文文具答。生慢起文。次第不同。彼论依为钝根之人再方闻者解。故两周说。别答三问。余皆破疑。又此论依为初来利根一周而说。故说生慢。彼论依为后来钝根两周而说。故说破疑。又理出百途。何劳一彻。破执生慢。各各不同。一会之中。乐有广略。根有利钝。闻有单重。理有多彻。种种别故。两论解异。不尔。无著受偈于弥勒。下付天亲。命其造释。无著岂乖于慈氏。天亲苟异于贤兄者乎。无著论初归敬偈言。智者所说教及义。闻已转为我等说。故知闻已为我说者。即是慈氏所说偈。天亲论中所释偈。是弥勒作故。天亲颂云。大智通达教我等。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>无比功德身。正与此论叙敬皆同。应会如前解三问中及摄住处。总应说此。以此和会下诸经文。应当决了。下文但当释其文相。更下会释</p><p>论文。准释经文三。初解问文中有二。初属经释依义。后论文解说相。此中具足。即流支成就。义同名异。真谛经云。诸相胜德。成就有为相。佛菩提身故。具足成就是正所翻。胜德者以有为相。为佛胜德之体。是义翻之。下观诸相。谓相好。天亲论解。乃四相相。谓是有为三种相故。不说住相。如唯识说。须菩提悬解佛意。故言不尔也。不可以有为三相成就得见佛之真身。所说有为非法身相。法身相者。无相为相。三有为相是有为相故。行无相因。还得无为无相实法身果。非行无相因而得有为有相假化身报。后佛为成满前征次答之义。故重告之。分三。初凡所有相皆是虚妄。是摄持欲愿。显有为相。是虚妄。翻明异此虚妄无相之相非是虚妄。令其摄持后发生欲愿。非是欲愿摄持有相虚妄之法。有相虚妄非是无分别定修行摄持二。云意欲愿是初行者。妄行有相之恶。欲愿非是般若无相。欲愿般若无相。欲愿求无相。故论所言。欲愿摄持是无相定。摄散二心根本欲愿。故此欲愿是正行者。无相欲愿。次第二云。若见诸相非相。则非虚妄。是安立第一义。相者为虚妄化身。非相为真实法身。见化身诸有为相非法身之无相。则非虚妄。彼以化身有相。为真实身相。故是虚妄</p><p>后第三结。诸化有相。非真无相。则见法身如来。此为显现。正是所说无分别定及摄散时。有相中非是真实法身相见。故见如来。此观见如来。应勘无垢称经观如来品说。下解欲住处。准前十八住处中。文分二。初解欲得言说法身。后解欲得法身。欲得法身。因果虽别。正法身体诸功德法所依止故。佛果三身及因<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>俱是法身所摄言说。声教非是法身。法身之因。亦名法身。如说般若。实相观照正是般若。文字般若能生能显般若。亦名般若。此亦如是文字能显能生法身。故称言说。亦名法身。文字般若从能诠。辨能依作用。以立其名。言说法身从能诠表所依能依体用和合。以立其名。声名等合名言说故。问何故前说欲得色身。名之为慢。今下文说。欲得法身。不名为慢。答欲得色身为真身者。全不顺理。故名为慢。欲得法身不违道理。虽因前说而生疑起。非全不顺。不与慢名。由此欲得色身等已下文。不名离障。但名欲得。非疑极障。故说欲得色身是慢障法。隔欲得法身非慢障法。不与离障之名。天亲论中依为破疑。生下经文。谓前所说不住行施。是因深义。次说法身非有为相。是果深义。因深果远。义旨难知。未来像法欲灭之时。恶世众生。能生信不于前好世正法之时。信不须疑。末法恶生。不信不惑。但问像法欲灭之时能生信不。信经时说。行十法行。非末法故。以有持<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>等行皆非胜故。故作此征。末法更无有三学者。故不为问。彼论依文前说疑起。此论依因欲得言说法身而证得法身之本。当来流行于世。以生后经。故不相违</p><p>文分为三。初配经文。次释问文。后释答文。欲得言说法身者。显经来意。须菩提闻法深妙实相难知。佛在可然。信者极众。时机病行验胜可知。佛无已后颇能信不。时机病行皆非胜故。须菩提欲得此教言说法身现在当来俱流行世故。问来世恶世恶生能信不。望佛答有。难末代尚能深信。况乎今者。何故不信。故言欲得言说法身。此文来也。初文有二。初配经。后释难。释难中。修多罗句说者。谓所有义。句为能诠。七句说是所说之义理也。即流支真谛罗什等云章句。是明义句所明理。此中名说。能断经云。色经典句。色是类义。所诠义类。非但问此金刚般若。大般若等咸在问中。故言色类。经典句者。能诠教也。此义色类能诠经句。当来恶世能生信不。此有二意。初明不信所因。后正兴问。不信所因有二。一时恶。二经深。时恶恶生。经深实相。于此经句。颇生信解。为实相不。为正兴问。故真谛经名为真实相。此及能断云。生实想不。经言称正理。名为真实。于此经中。颇生真实想解以不。想者取像之能信心。取信以为真实之像貌已不。罗什云。生实信不。名异意同。释问文中须菩提以恶代恶生经义深妙无能信者故。为此问</p><p>释问来意。解佛答有二。初总答有。为遮此故。世尊言有也。后别解有义。别解有义分二。初广别解答有义。后释以是义故下解法身要义。初文复二。初广释经。后于中言当生实相者下配五种义。初文分二。初释有时。次释有因。及释由此能生实相。正法欲灭时者。谓修行渐灭时。此释有时。善现总问未来难信。世尊别答修行欲灭于经有信。翻显已前理多信者。有教有行。有得果证。名为正法。有教有行。不得果证。名为像法。有教无余行。名为末法。然依大乘大集经中。以五百岁为配。初五百年解脱坚固。第二五百年<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>坚固。第三五百年多闻坚固。第四五百年福德坚固。第五五百年斗诤坚固。小乘不依五百为配。如记正法住经及传并摩诃摩耶经等。佛所记事但以一百二百而为配故。今依大乘。故此经言。后五百岁。以五百岁为分配故。佛之法教。正像末等皆名正法。非是初时有证解脱。名正法也。时尚解脱。况无信者。故不为答。佛初记别正法一千年像法一千年。末法一万年。由度女人。灭减正法唯五百年。于中两说。一云正法。今者但五百年由度女人。减五百年。岁虽说八敬不减正法。由彼不行正法还灭。故经有说。及萨婆多等宗皆唯正法。俱五百年。若依彼义。此中正法欲灭之时者。谓修行渐灭时。非是前时。初五百岁有解脱故。行盛兴故。亦非后时行已无故。今说修行渐欲灭时。即是第三五百年时。此于像法一千年中。后五百年行方渐灭。当此恶时。尚有于经当生实相。况以前位。而无信者。自此已后。时远人浇。少有生信。故经不说。故能断云。后时后分。后五百岁正法将灭时。分转时。后时者初五百年。后分者第二五百年。后五百岁者。第三五百年。即行正法将灭时也。第二说云。正法一千年。若不说八敬。全无行者。正法欲灭。既有行者。正法依定。大众部等皆作此说。若依彼说。即是第四五百年时。名为修行渐欲灭时。于此恶时。尚生实相。况以前位。而无信者。已后恶时少有生信。故经不说。其能断云后时者。显佛灭后。非但佛在位。言后分者明非正法一千年内即<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>时。言后五百年者。于其像法一千年内行欲灭时。非初五百年行盛兴时。此后分四。一后时。初五百年。二后分。次五百年。三后五百岁。第三五百年。四正法将灭时分转时。第四五百年。即行正法。后将灭时。由有二解。经文不同。流支罗什。总奄合说当来末世。不识三后之深义。故真谛经云。现时及未来世。以此为误矣。不问胜时。问恶时故。又云。于未来世后五十岁。以一当十。五百即五十。亦不相违。算家有此差别门故</p><p>上释有时。下释有因。及释由此当生实相。文复分二。初明有四因故生实相。后别配经。四因者。次前时后佛。为于如是恶时之中显有四因。一久修三学行。二遇佛集胜因。三为佛所摄受。四虽无三学集因摄受。由与福德果报相应。故能生信。即是彼人。于彼无法障。故福会生信。恶世由具四因。故能如是。于实相法中能生实相。天亲论意。由未来世有菩萨者内具三学之德。即此菩萨外遇良缘。于诸佛所。种三种因。当知是人能生实相。故颂说言。于彼恶世时。菩萨三德备。不空以有实。即此菩萨佛。悉知见。有持戒修福德。取生福德。由有智慧。佛悉知见。无人法执。各四八过。经言。有戒有功德者明修行。初配经文。后逐难释。此中三学有四法迹。无贪无嗔是戒学迹。正念是定学迹。正定是慧学迹。由对<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>所说各有异故。但说三学。又戒出恶道因。定出欲界因。慧出三界因。又声闻多学戒。独觉多习定。菩萨多学慧。又戒能离恶因。定能修善因。慧能利生因。又戒得胜自体。定能离恶。慧能摄善因。如是等种种别义故说三学。应勘摄论及瑜伽等。功德者少欲等功德为初。乃至三摩地等。此逐难释。如遗教经。持戒有六。即是瑜伽六支。一持戒。二制心。三知量。四懈愧。五安忍。六直心。皆是戒学所摄。正定亦六。八大人觉中摄初六故。一少欲。二知足。三远离。四精进。五不<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。六正定。正慧摄二。一者智慧。二不戏论。持戒智慧易。不重释。正定相隐。重解之。以功德言。奄含说故。即八大人觉中。少欲为初。等至为后。摄此六法。以为功德。前六后二唯知戒慧。更应勘瑜伽声闻地涅槃经及八大人觉经等以配遗教。具三学者。以经为实教顺理故。能生信心。信心即是真实相也</p><p>二经言已得供养等者下解集胜因。文分二。初配经文。后逐难释。由逢诸佛集二种因。一财供养。二行供养。行供养者种善根是以财供养。经但名为修行供养。供养为十。一现前。二不现前。三现前不现前。四自。五他。六俱。七财敬。八广大。九无染。此上九种经中。名为修行供养。十正行供养。此中名为种诸善根。集是十因。名集因也。逐难释云。一心净信尚得如是业。何况生实相者。此解经中乃至一念净信之言。非唯逢少数之佛即能于经生一念信。翻显由逢千万诸佛供养树善方能于经生一念信。信难生故。故经初非供养少佛。后方显由供养多数佛。如是一念净信之业。尚由前世遍供多佛。何况于经广生实相。不于前世遇供养多佛。以于广经能生实相为首。于经少句。一念净信为终。略去中间修行。不信。故言。乃至乃至一信尚由前遇多佛供养。况生广信</p><p>三经言如来悉知等者下第三解佛所摄受分二。初散解。后配文。显现有异。以明心别。知者知名身。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>知四蕴。见者见色身。五识知色蕴。威仪三业皆知。故言一切。行住所作中知其心。见其依止。天亲释言。佛非见果知。愿智力现见。谓佛非见果。比知由有愿智。现.前见故。言悉知者简非眼见。言悉见者简非比知。为防此二故说知见。然诸本中皆唯二悉知悉见。能断经中乃有三悉。更有悉觉。天亲论具。彼经本略。论云。求供养恭敬。彼人不能说。彼自释云。若人欲得供养恭敬。自称己身有持戒等。彼人不能自说己身能生实相。是人自谓有智。起增上慢故。为简彼故。文言如来悉觉。是人但名有戒等。佛皆善知于此经中能生净信。论既具解。故知经略。唯能断中具此三悉。其流支经下为离寂静味中亦有三悉。准下知上应有悉觉。此等显善友所摄。属配经文</p><p>四经言生取无量福聚等者。解第四摄持福德。初配属经。后逐难释。经中别言生如是取如是。合今牒之。故言生取无量福德。逐难释云。生者福正起时。谓由现行正起福德。取者即彼灭时。摄持种子故。谓由先造福德事故。今虽不起。由有福德种子。随逐现行。灭己身中但有摄持种子。故天亲云。生者能生因故。现行能熏名能生因。取者熏修自体。果义。现行灭已。唯有所熏修种子自体。是现行因所生果义。二论无别。或彼论中翻此说。然观经意。像法欲灭。有持戒等众生。生在彼时。能生实相。即于恶时。有恶众生。不言愿生能生实相。法华经说。于恶时中。行十法行。行于法等。当知此人是大菩萨发愿生。此岂法华经胜此般若。彼愿生持。此实生持耶。答此论像季。彼论末法。又此同彼愿生。彼同于此实作俱出末法像季二时互影显故。两经无别。俱深妙故。又此说一念净信。彼说广能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。若持一句。二俱实生。若能广持。两俱愿生。又此经直深实作。彼经曲深愿生。亦不相违</p><p>经言是诸菩萨等者下解故生实想。文分三。初总配属经。次别解经文。后重释<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。别解经中。由经有二何以故。论亦分二。初何以故征显前说有三学等能生实相之所由。后何以故显有法执我执随逐。初文复二。初明对治五种耶取。别属经文。后此中显了有戒等者。释文来意。初有三。一标。二显。三结。此言五耶取者。初三依人辨取。后二依境辨取。故合为五执。人虽有四。总说一无。故此合说。天亲论中依取行想。以辨差别。故成八义。我执法执各有四故。外道异生多起分别。计三世等。执实有我。故四我执皆称外道。转者起也。执想生故。内道凡夫犹处下位。并声闻等多执法。有一类顿悟菩萨及不定性回向大乘。多执法空。名增上慢。此三依人以辨执取</p></div>"
}]