[{
    "title": "第403部 未来星宿劫千佛名经",
    "author": "开元拾遗附梁录",
    "html": "<div class=\"B1_text\"><p>未来星宿劫千佛名经</p><p>一名集诸佛大<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>山</p><p>夫修善福臻。为恶祸征。明理皎然。而信悟者鲜。既共生此五浊恶世。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a><a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>三毒炽盛。轮转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>无有竟已。昔佛在世时。人民数如恒沙。今渐凋微万不遗一。何以故尔。为善者少作恶者多。死堕三涂悉为鱼虫畜生。不复得人身。故<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>云。三恶道充满<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>众减少。劫尽不久长衰可悲。是以如来随方<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。敦慈尚善不吝躯命。勤行<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>可得勉度。<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>俄顷之劳。能却<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>罪。罪灭福生以致无为。此未来星宿劫中。当有千佛出世。名字如是。若人闻名一心礼事不生<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>必得<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。永离三涂生死之患。安住慈忍具足多闻。若能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>习诵之者。是人则必历值千佛。获灭无量阿僧祇劫生死重罪。得诸佛<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>无碍辩才诸大法门陀罗尼门。一切经书种种<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。随宜<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不自欺诳。离于名利勿怀嫉妒。行<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>敬一心奉持。无失是缘。如是<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。疾得阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。</p><p>南无日光佛南无龙威佛南无华岩佛南无王中王佛南无阿须轮王护佛南无作吉祥佛南无师子慧佛南无宝意佛南无成办事佛南无成办事见根原佛南无种姓华佛南无高雷音佛南无无比辩佛南无智慧<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>佛南无称<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>南无威怀步佛南无福德光明佛南无月摩尼光王佛南无目犍连性佛南无无忧忖佛南无思惟智慧佛南无意智佛南无诸天<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>法佛南无勇悍佛南无无限力佛南无智慧华佛南无强音佛南无欢乐佛南无说义佛南无净怀佛南无师子口佛南无好结佛南无不取诸法佛南无波头摩上星宿王佛南无上弥留幢王佛南无因陀罗幢王佛南无香音佛南<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>光明佛南无栴檀相好佛南无无限高佛南无莲华幢佛南无莲华化生佛南无微细华佛南无阿竭留香佛南无大勇佛南无栴檀相好光明佛南无银幢盖佛南无大海意佛南无旛幢好佛南无梵王德佛南无大香熏佛南无大勇现佛南无宝轮佛南无发行难佛南无无所发行佛南无金宝瓮佛南无天辋佛南无言从佛南无常雨华佛南无大好乐佛南无师子上香佛南无魔天相好佛南无帝释光明佛南无大相好佛南无师子华好佛南无寂灭幢旛佛南无持戒王佛南<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>好翼从佛南无翼从面首佛南无无忧相好佛南无普开莲华身佛南无大地佛南无大力龙翼从好佛南无净行王佛南无大游戏佛南无莲华威佛南无放舍华佛南无常观佛南无法体决定佛南无作直行佛南无不定愿佛南无善住诸愿佛南无无常中上佛南无月威佛南无栴檀色佛南无日空佛南无威相腹佛南无破烦恼佛南无实法广称佛南无<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>喜佛南无宝称佛南无难胜伏佛南无好观佛南无勇兴佛南无翼从树佛南无狸牛威佛南无天中天佛南无师子幢佛南无智慧威佛南无无底威佛</p><p>一百佛竟</p><p>南无德丰佛南无厚德佛南无无念示现诸行佛南无无生佛南无无上光佛南无山德佛南无出现佛南无服德佛南无无量善根成就诸行佛南无大讲佛南无不住奋迅佛南无宝树佛南无普悲佛南无德养佛南无大转佛南无绝<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>疑王佛南无一道佛南无普盖佛南无大盖佛南无最德佛南无千近佛南无宝莲华勇佛南无离世间佛南无旛幢佛南无宝月德佛南无服树王佛南无尊德佛南无普莲华佛南无等德佛南无龙中蜜佛南无大海深胜佛南无无量宝盖佛南无无表识佛南无须弥身佛南无<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>岩佛南无强称王佛南无放光佛南无无染浊佛南无在华聚德佛南无离恐衣毛不竖佛南无无相声佛南无电目眼佛南无宝室佛南无虚空星宿增上佛南无众尊聚佛南无山王身佛南无一盖佛南无能屈服佛南无栴檀宫佛南无波头摩树提奋迅通佛南无光网佛南无红莲华佛南无善现光佛南无慧华宝光灭佛南无散众畏佛南无无垢光明佛南无安王佛南无法空佛南无出千光佛南无过千光佛南无境界自在佛南无出显光佛南无善行佛南无无能屈声佛南无远离怖畏毛竖佛南无宝智佛南无进寂静佛南无无量翼从佛南无世间可乐佛南无住慧佛南无能仁仙佛南无慧称佛南无诸树王佛南无无垢云王佛南无随世间意佛南无宝实佛南无离愚称佛南无德现佛南无宝爱佛南无不唐精进佛南无香熏光佛南无无能屈香光佛南无众强王佛南无出须弥山顶佛南无从宝出德佛南无莲华上佛南无从宝出佛南无香光佛南无称远方佛南无藏香自在佛南无云雷王佛南无无际光佛南无无量慧成佛南无种种无量行佛南无无量德光王佛南无尊聚佛南无觉华剖德佛南无觉华剖上王佛南无宝体佛南无无唐称佛</p><p>二百佛竟</p><p>南无共发意佛南无<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>一切意佛南无盖莲华宝佛南无光轮成王佛南无德王光佛南无过一切德佛南无灯光行佛南无成作光佛南无江仙佛南无宝形佛南无胜护佛南无慧莲华德佛南无梵功德天王佛南无无量颜佛南无无聚会王佛南无宝身佛南无树王中王佛南无罗网手佛南无摩尼轮佛南无无量德铠佛南无世音佛南无须弥山光佛南无过上步佛南无由宝莲华德佛南无作际佛南无众生所喜铠佛南无上宝盖佛南无无量盖佛南无翼从佛南无月现德佛南无以发意能转轮佛南无通达义佛南无离旷野王佛南无日轮光佛南无<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>威德佛南无慧功德佛南无众生王中立佛南无无能屈服佛南无虚空步佛南无俱苏摩通佛南无无比铠佛南无光轮幢德王佛南无<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>助佛南无曼陀罗佛南无净幢佛南无金刚所须用佛南无慧净佛南无善求佛南无善讨铠佛南无胜伏怨佛南无净圣佛南无名称力王佛南无无量光香佛南无须弥山王佛南无种种华佛南无法宝佛南无降化男女佛南无最香德佛南无宝上王佛南无须弥山香王佛南无可喜众生觉见佛南无无想音声佛南无大人佛南无音声无屈碍佛南无一宝无忧佛南无无动勇佛南无种姓佛南无观诸欲起佛南无净宿佛南无现得佛南无虚空庄严佛南无坏众疑佛南无不<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>佛南无善桥梁佛南无广功德佛南无无量幢佛南无清凉佛南无光罗网佛南无遍知佛南无无量德姓佛南无于诸法无所著佛南无普见一切法佛南无于一切众生誓铠无脱佛南无有无量德佛南无慧上光佛南无不可数见佛南无方上佛南无有华德佛南无法光慈悲月佛南无海住持胜智慧奋迅佛南无清净光明宝佛南无离服内解慧王佛南无坏诸欲佛南无行清净佛南无无量宝华光明佛南无常灭度佛南无见一切法佛南无不堕落佛南无栴檀清凉室佛南无法用佛</p><p>三百佛竟</p><p>南无无量慧称佛南无清凉室佛南无无比觉华剖佛南无善住树王佛南无月光中上佛南无阎浮光明佛南无须弥山身佛南无千香佛南无名号兴显佛南无名称友佛南无名称最尊佛南无除忧佛南无莲华上德王佛南无阐华幢佛南无普放香化佛南无最眼佛南无放焰佛南无远方称佛南无降伏一切世间怨佛南无法虚空胜王佛南无火焰佛南无<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>雄勇佛南无光轮佛南无虚空雄巧佛南无穷尽雄佛南无天鼓音声佛南无普雄佛南无一切众生爱见佛南无<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>轮疆界上佛南无善住王佛南无众德聚佛南无诸觉疆界应饰佛南无觉宝德称佛南无慧上德佛南无慧光王中上明佛南无莲华中出现佛南无普法雄佛南无月半光佛南无满足百千德光幢佛南无大如意轮佛南无莲华中现德佛南无执炬佛南无宝上德佛南无栴檀清凉德佛南无宝严慧中上佛南无德尊佛南无不二轮佛南无无量德海佛南无众聚佛南无一切德聚佛南无莲华应德佛南无极上中王佛南无法照光佛南无无量山王佛南无虚空轮上佛南无善住清净功德宝佛南无善住净境界佛南无杂宝色华佛南无最聚佛南无不舍弘誓铠佛南无金华佛南无杂色华佛南无毕竟庄严无边功德王佛南无月轮清净佛南无从莲华出现佛南无华盖佛南无被慧铠佛南无称力王佛南无净音声佛南无俱苏摩国土佛南无无量聚会佛南无一切胜佛南无精进仙佛南无散众步佛南无坏疑佛南无无想声佛南无无量德具足佛南无有众德佛南无莲华上德佛南无宝尊佛南无于去来今无碍铠佛南无喜身佛南无宝山王佛南无日铠中上佛南无炬灯佛南无无比光佛南无善生佛南无长养佛南无无量眼佛南无祉江佛南无诸远方铠佛南无觉华有德剖佛南无宝火围绕佛南无慧国土佛南无寂静佛南无异观佛南无贤药王佛南无开悟菩提智光佛南无喜威德佛南无波头陀智慧奋迅佛</p><p>四百佛竟</p><p>南无善中上德佛南无雄猛佛南无香尊幢佛南无香最德佛南无香幢佛南无善色藏佛南无无量精进佛南无过十方光佛南无觉华剖上佛南无无量雄猛佛南无莲华恐畏过上佛南无宝罗网佛南无善住中王佛南无香中尊王佛南无致诸安乐佛南无一切聚观佛南无不唐弃名称佛南无坏散诸恐畏佛南无能解缚佛南无威德因陀罗佛南无为诸众生致佛南无虚空无际佛南无住清净佛南无虚空幢佛南无尊善中德佛南无在无恐畏华德佛南无无量雄猛形法佛南无得世间功德佛南无大车乘佛南无极最德上佛南无莫能胜幢佛南无离一切嗔恨意佛南无趣向当住佛南无无量最香佛南无月轮称王佛南无尊须弥山佛南无住持多功德通法佛南无胜积佛南<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>菩提华胜佛南无住无量集德佛南无威神王佛南无善思愿自调佛南无净轮王佛南无慧上佛南无慧严佛南无造成远方佛南无会中尊佛南无决断佛南无华鬘色王佛南无慧隐佛南无极趣上德佛南无无量宝佛南无众生意欲所趣勇意视之佛南无无量宝王佛南无于一切诸爱中雄佛南无光无碍佛南无无碍光明佛南无宝莲华剖上德佛南无好坚佛南无一切所趣中觉离见诸觉身佛南无过化音声佛南无莲华尊在诸宝德佛南无海须弥王德佛南无无粗慧佛南无在慧华佛南无极趣上威神聚佛南无寂定佛南无离雄佛南无舍一切步佛南无德不可思议佛南无在于游戏德佛南无趣无畏德佛南无香趣无量香光佛南无云鼓音佛南无在福德佛南无无量勇雄猛佛南无水月光明佛南无最香须弥身佛南无破无明闇佛南无光普见佛南无恐畏佛南无自至到佛南无实谛称佛南无星灯佛南无成熟佛南无极趣上佛南无尊会佛南无金刚肩佛南无慧中自在王佛南无慧力称佛南无最安佛南无德身王德佛南无善思惟发行佛南无世间自在佛南无光明庄严佛南无虚空须弥佛南无十力王佛南无虚空平等心佛南无施丰德佛南无火炎积佛</p><p>五百佛竟</p><p>南无宝华普照胜佛南无贤最德佛南无宝轮光明胜德佛南无宝华佛南无从莲华佛南无普明观称佛南无须弥意佛南无尊思佛南无宝盖佛南无善清净光佛南无无量雄佛南无名称不唐佛南无德不可思议王光佛南无雁王佛南无安隐王佛南无莲华中上德佛南无常自起<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>佛南无不离一切众门佛南无无相<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>佛南无求善佛南无精进力成就佛南无功德多宝海王佛南无照一切处佛南无色声雄佛南无无量虚空雄佛南无见实佛南无超境界佛南无虚空尊极上德佛南无成方土佛南无极趣上须弥佛南无饮<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>佛南无护世间供养佛南无善护诸门佛南无火幢佛南无善无垢威光佛南无不可动佛南无力称王佛南无德光王佛南无慧光王佛南无莲华上有德佛南无宝火佛南无维莲华德佛南无坏散众疑佛南无拘留秦佛南无具足一切功德庄严佛南无幢王佛南无从莲华德佛南无梵声安隐众生佛南无慈氏佛南无莲华光明佛南无尊王法幢佛南无无量勇佛南无海须弥佛南无极志上佛南无金枝华佛南无不唐观佛南无言辩音声无碍佛南无无碍德称光佛南无无称不散誓铠佛南无妙顶佛南无不散心佛南无常来佛南无无垢离度佛南无于三世无碍誓铠佛南无无量华佛南无成就观佛南无平等须弥面佛南无清净功德相佛南无毕竟成就大悲佛南无<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>齐佛南无盖宝佛南无满足意佛南无内外净佛南无善星佛南无光轮场佛南无阿叔迦佛南无极上德佛南无无碍雄佛南无无量雄勇佛南无言音无碍佛南无大云光佛南无罗网光聚佛南无觉华剖佛南无莲华雄佛南无华山王佛南无月聚自在佛南无寂诸根佛南无无障无碍精进坚佛南无离无愚观佛南无顶上极出王佛南无莲华顶上王佛南无无愚称佛南无不唐勇佛南无无唐雄佛南无无愚光明佛南无国土庄严身佛南无娑婆华王佛南无无念觉法王佛南无正觉莲华步佛南无弥留灯王佛</p><p>六百佛竟</p><p>南无禅思盖佛南无智根本华王佛南无栴檀室佛南无化称佛南无一切无尽藏佛南无禅思须弥佛南无无边觉海藏佛南无无垢际佛南无有众宝佛南无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净智佛南无药王声王佛南无一切德佛南无觉剖华中德佛南无妙鼓声王佛南无毗尼称佛南无无过德佛南无宝通佛南无无量誓铠佛南无无量禅德佛南无虚空轮场光佛南无无表识音声佛南无觉王佛南无然法庭燎佛南无观意华出佛南无虚空室佛南无虚空声佛南无在虚空禅师佛南无大眼佛南无在尊德佛南无觉莲华德佛南无梵声王佛南无成就义佛南无师子护佛南无师子颊颐佛南无善中王佛南无静须弥佛南无静眼佛南无无过勇步佛南无不可思议法身佛南无不散佛南无香须弥佛南无大智真声佛南无香岩佛南无能与法佛南无宝须弥佛南无大香行光明佛南无药树胜佛南无净须弥佛南无散华庄严光明佛南无得度佛南无云声王佛南无无过精进佛南无善思惟誓铠佛南无不动月佛南无于诸众中尊佛南无诸尊中王佛南无无量国土中王佛南无精进上中王佛南无舍离疑佛南无善星中王佛南无功德宝胜佛南无造化佛南无普现前佛南无乐说庄严佛南无各成就佛南无帛盖佛南无香盖佛南无性日佛南无不怯弱离惊怖佛南无栴檀德佛南无义成就佛南无无垢喜佛南无厚坚固佛南无世间求佛南无胜步行佛南无无畏离衣毛竖佛南无命威德佛南无住智德佛南无大光明庄严佛南无转化女誓铠佛南无真金山佛南无深智佛南无趣向诸觉身佛南无罗网光中缘起中王佛南无无量趣观诸觉身佛南无成觉剖莲华佛南无罗网光佛南无无量觉华开剖佛南无宝萨梨树佛南无宝洲佛南无即发意转法轮佛南无千光佛南无最后见佛南无胜土佛南无无量光勇佛南无无量辩佛南无圣德佛南无宝海佛南无爱黠慧佛南无胜修佛</p><p>七百佛竟</p><p>南无信如意佛南无金光明佛南无金海佛南无精进军佛南无无量境界佛南无无决断愿佛南无内调佛南无调化无休息佛南无香风佛南无无趣向誓铠佛南无觉虚空德佛南无摄取众生意佛南无成就誓铠佛南无陀罗尼自在王佛南无常精进佛南无摄取光明佛南无毕竟智佛南无善相善铠佛南无善言誓铠佛南无能思惟忍佛南无光造佛南无一藏佛南无一种姓佛南无无量身佛南无大众上首佛南无深王佛南无智慧赞叹佛南无功德梁佛南无无名称佛南无散诸恐怖佛南无远离诸疑佛南无除恐衣毛竖佛南无伏一切怨佛南无成就胜无畏佛南无善思惟胜义佛南无无量执持佛南无无量音声佛南无光严佛南无光德佛南无离轮场后佛南无趣菩提佛南无觉华开剖光佛南无普宝满足佛南无摄受称佛南无决定色佛南无普照十方世界佛南无方便修佛南无胜报佛南无宝华德佛南无在诸宝佛南无月华佛南无一切群萌誓铠佛南无转化一切牵连佛南无无量辩才佛南无无诤无恐佛南无都趣众辩佛南无普香光佛南无堪受器声佛南无须弥香佛南无大贵佛南无香雄佛南无大修行佛南无香室佛南无舍诤佛南无清净庄严佛南无莲华上王佛南无觉雄佛南无世间尊重佛南无无量香雄佛南无极尊佛南无闻德佛南无华盖宝佛南无坚固自在王佛南无波头摩庄严佛南无清净心佛南无香华佛南无须弥王佛南无树提佛南无转化众相佛南无过一切众生誓铠佛南无极迟誓铠佛南无一切宝庄严色住持佛南无无量香佛南无普<a href=\"/remen/kaiguang.html\" class=\"keylink\" target=\"_blank\">开光</a>佛南无普放香熏佛南无住持无障力佛南无在莲华德佛南无最上天王佛南无一界持觉刹佛南无善摄身佛南无香熏佛南无无量慧雄佛南无无量观佛南无<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>眼佛南无难动佛南无初发意佛南无无勇王佛南无无迹步佛南无除一切忧佛南无离忧佛</p><p>八百佛竟</p><p>南无如娱乐在德佛南无安隐王德佛南无尊须弥威香山佛南无大种姓佛南无无垢面佛南无红莲华德佛南无白莲华威德佛南无吼眼佛南无善安众生佛南无无边际光佛南无现月光佛南方远方声称佛南无月自在王佛南无随意光明佛南无香尊须弥佛南无吉祥有德佛南无在月光有德佛南无在无量安隐德佛南无一切以德自在庄严佛南无宝住持庭燎佛南无莫能胜幢幡佛南无尊隐藏光佛南无从威华王佛南无入在无边际佛南无一切尊佛南无普极上佛南无海威佛南无诸宝上德佛南无静天德佛南无无量香象佛南无能降伏放逸佛南无造灯明佛南无莲华尊光佛南无施安隐佛南无<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>不怯弱佛南无平等心明佛南无闻智佛南无大部分佛南无金面光佛南无普光威德佛南无善称德威帝释威幢光佛南无普德光佛南无精进伏怨勇佛南无住持地力进法佛南无无碍药树威德佛南无宝莲华住萨梨树王佛南无求德佛南无日轮场德光佛南无宝莲勇佛南无一宝盖佛南无住持妙无垢位佛南无护根佛南无住禅思勇佛南无宝幢威德佛南无住无量勇佛南无好香尊香熏佛南无思惟尊象德佛南无莲华尊德佛南无日轮场尊上德佛南无兴成佛南无解脱乘佛南无思惟最勇佛南无宝华普光威佛南无住无比勇佛南无无量最中王佛南无华成就佛南无自在转一切法佛南无宝内佛南无宝轮威极上德佛南无了意佛南无胜华集佛南无娑罗威德佛南无离一切忧暗佛南无心勇猛佛南无地威德佛南无清彻光佛南无无垢威德佛南无离恶道佛南无莲华上尊佛南无无垢琉璃佛南无无垢臂佛南无无垢眼佛南无大焰身佛南无虚空轮静王佛南无声音无表识佛南无金刚杵势佛南无波头摩面佛南无总持佛南无宝轮网佛南无天帝幢佛南无善聚光莲华剖体佛南无无量名称德光佛南无阎浮灯佛南无须弥岩佛南无慧灯明佛南无光极明佛南无日威德庄严藏佛南无色幢幡星王佛南无不动光观自在无量命佛南无威德自在王佛</p><p>九百佛竟</p><p>南无正觉中王佛南无尊宝佛南无无边愿佛南无妙法佛南无宝场轮上尊王佛南无瞻婆伽色佛南无无垢慧佛南无信众生佛南无在宝佛南无放天威佛南无胜威德色佛南无施宝光佛南无悲慈意佛南无无诤行佛南无莲华叶眼佛南无得脱一切缚佛南无怀眼佛南无执敷饰佛南无虚空意佛南无能与乐佛南无<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>王佛南无大积佛南无发起一切众生信佛南无至大佛南无十方称名佛南无无对光佛南无龙尊佛南无快见佛南无香上佛南无大怀佛南无不随他佛南无大化佛南无宝回佛南无大车华佛南无美快德佛南无观见一切境界佛南无诸帝释中王佛南无戒味佛南无华威佛南无普威佛南无无量际威佛南无能与眼佛南无香威佛南无上幢佛南无安隐德佛南无金刚遍照十方佛南无发一切众生不断修行佛南无显现佛南无宝威佛南无在德佛南无平等作佛南无无比佛南无普威德佛南无不可量实体胜佛南无华成功德佛南无坚固众生佛南无悦音声佛南无施威佛南无普月佛南无臂月佛南无尊威佛南无不动心佛南无一切法无观佛南无幢旛佛南无俱苏摩成佛南无普丰音佛南无香尊佛南无胜命佛南无能为主佛南无幢威佛南无聚威佛南无日轮光明胜佛南无喻宝佛南无坚精进思惟成就义佛南无迦陵频伽声佛南无大龙威佛南无十力娱乐佛南无善寂成就佛南无称一切众生念胜功德佛南无天帝释净幢佛南无常相应语佛南无栴檀杂香树佛南无喻如须弥山佛南无云中自在灯明佛南无云中自在王佛南无除世畏觉悟佛南无莲华叶净佛南无星王华佛南无贤智不动佛南无力士王佛南无宝台佛南无象鹫师子岩雷难过上佛南无普禅佛南无声满十方佛南无功德成就佛南无波楼那天佛南无十方上佛南无离垢光佛南无威严佛南无须弥相佛</p><p>一千佛竟</p><p>若有族姓<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>。闻是诸佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>名号。欢喜信乐持讽诵读而不诽谤。或能书写为他人说。或能造作立其形像。或能供养香华妓乐。叹佛功德至心作礼者。胜用十方诸佛国土满中珍宝纯摩尼珠积至梵天百千劫中而<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>者。是辈族姓子女。前已曾供养是如来已。其人后生得此功德。至于作佛。而无穷尽。皆当为贤劫中佛之所授决。其人所生之处常遇<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。得生诸佛刹土。六情完具不堕八难。三十二相八十种好疾得具足。若能一过五体投地。而为作礼口自宣言。我今普礼一切十方三世诸佛至千佛过然后乃起。所得福祐如上所说。持此功德。愿共一切五道众生。其无常者。生无量寿佛国。立大誓愿。使诸众生悉生彼刹。生彼刹已。身诸相好智慧辩才。如众世尊阿弥陀佛。所获<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>亦如世尊。</p></div>"
}]