[{
    "title": "第401部 过去庄严劫千佛名经",
    "author": "开元拾遗附梁录",
    "html": "<div class=\"B1_text\"><p>过去<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>劫千佛名经</p><p>三劫三千佛缘起(出观药王药上经)</p><p>宋畺良耶舍译</p><p>尔时释迦牟尼佛。告大众言。我曾往昔无数劫时。于妙光佛末法之中。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>学道。闻是五十三佛名。闻已合掌心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。复教他人令得闻持。他人闻已展转相教。乃至三千人。此三千人异口同音称诸佛名一心敬礼。如是敬礼诸佛<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>力故。即得超越无数亿劫<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之罪。初千人者。华光佛为首下至毗舍浮佛。于庄严劫得成为佛。过去千佛是也。其中千人者。拘留孙佛为首下至楼至佛。于贤劫中次第<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。后千人者。日光佛为首下至须弥相佛。于星宿劫中当得成佛。佛告宝积。十方现在诸佛善德如来等。亦曾得闻是五十三佛名故。于十方面各皆成佛。若有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>欲得除灭四重禁罪。欲得<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>五逆十恶。欲得除灭无根谤法极重之罪。当勤礼敬五十三佛名号</p><p>南无普光佛南无普明佛南无普净佛南无多摩罗跋栴檀香佛南无栴檀光佛南无摩尼幢佛南无欢喜藏摩尼宝积佛南无一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>乐见上大<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>佛南无摩尼幢灯光佛南无慧炬照佛南无海德光明佛南无金刚牢强普散金光佛南无大强精进勇猛佛南无大悲光佛南无慈力王佛南无慈藏佛南无栴檀窟庄严胜佛南无贤善首佛南无善意佛南无广庄严王佛南无金华光佛南无宝盖照空<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>力王佛南无<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>宝华光佛南无琉璃庄严王佛南无普现色身光佛南无不动智光佛南无降伏众魔王佛南无才光明佛南无<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>胜佛南无<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>仙光佛南无善寂月音妙尊智王佛南无世净光佛南无龙种上尊王佛南无日月光佛南无日月珠光佛南无慧幢胜王佛南无师子吼自在力王佛南无妙音胜佛南<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>光幢佛南无观世灯佛南无慧威灯王佛南无法胜王佛南无须弥光佛南无须摩那华光佛南无优昙钵罗花殊胜王佛南无大慧力王佛南无阿閦毗欢喜光佛南无无量音声王佛南无才光佛南无金海光佛南无山海慧自在通王佛南无大通光佛南无一切法常满王佛</p><p>一名集诸佛大功德山</p><p>经云。若有善男子善女人。闻是三世三劫诸佛名号。欢喜信乐称扬赞叹归命<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>。复能书写为他人说。或能画作立佛形像。或能<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>香华妓乐。叹佛功德志心作礼者。胜用十方诸佛国土满中珍宝纯摩尼珠积至梵天。百千劫中<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>者。是善男子善女人等。已曾供养是诸佛已。后生之处历侍诸佛。至于作佛而无穷尽。皆当为三世三劫中佛之所授决。所生之处常遇<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。得生诸佛刹土。六根完具不堕八难。当得诸佛三十二相八十种好具足庄严。若能五体投地作礼口自宣言。我今普礼一切十方三世诸佛。愿三涂休息国丰民安。邪见众生<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>正道发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。持此功德愿共<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>一切众生皆生无量寿佛国。立大誓愿。使诸众生悉生彼刹。身诸相好智慧辩才。如阿弥陀佛。所获<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>巍巍堂堂<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>无量。</p><p>南无华光佛南无人中尊佛南无师子步佛南无能仁化佛南无火奋迅通佛南无曜声佛南无无限光佛南无善寂慧月声自在王佛南无成就佛南无最上威佛南无趣安乐佛南无宝<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>佛南无供养广称佛南无师子音佛南无音施佛南无宝中佛南无电灯光佛南无莲华光佛南无大灯光佛南无净声佛南无除狐疑佛南无无量威神佛南无住阿僧祇精进功德佛南无护妙法幢佛南无喜可威神佛南无散疑佛南无德铠佛南无善见佛南无喜可威佛南无不藏覆佛南无无量藏佛南无光游戏佛南无广称佛南无舍旙佛南无尊悲佛南无普见佛南无云普护佛南无金刚合佛南无智慧来佛南无喜广称佛南无无量像佛南无大悦佛南无美意佛南无不动勇步佛南无动山岳王佛南无焰聚光佛南无住觉佛南无声德佛南无悦<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>佛南无无忧度佛南无普见事见佛南无大乘导佛南无普火佛南无国供养佛南无自在光佛南无说最恭敬佛南无净光佛南无师子奋迅佛南无除疑佛南无无勿成就佛南无无终步佛南无无火光佛南无奉敬称佛南无摄根敬悦声佛南无无能伏运佛南无无终声佛南无思惟众生佛南无神足光佛南无德王佛南无吼声佛南无千云雷声王佛南无广曜佛南无无崖际见佛南无师子香佛南无等善佛南无广施佛南无普现佛南无善像佛南无意称佛南无宝净佛南无上光佛南无广步佛南无金刚齐佛南无决觉佛南无慧幢佛南无无动觉佛南无威仪意佛南无普像佛南无谛意佛南无光音声佛南无成就娑罗自在王佛南无无量火光佛南无喜思惟佛南无藏称佛南无法幢空俱苏摩王佛南无难胜佛南无须弥力佛南无摩尼珠佛南无金刚王佛南无金上威佛</p><p>一百佛竟</p><p>南无美音声佛南无山胜佛南无众生所疑佛南无欢喜藏胜山王佛南无无减出佛南无悦意佛南无美声佛南无梵声龙奋迅佛南无月灯明佛南无法海潮功德王佛南无德净德光佛南无慧事佛南无见有绪佛南无怀见佛南无世间胜上佛南无人音佛南无绵光佛南无戒步佛南无天中尊佛南无敬怀谈佛南无无量光明佛南无德施佛南无大须弥佛南无真悦佛南无贤意佛南无金上佛南无大清净佛南无尊意佛南无意净佛南无莲华体佛南无人乘力士佛南无常胜意佛南无勇猛山佛南无师子声佛南无胜声佛南无喜解佛南无善住诸禅藏王佛南无自光佛南<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>好佛南无无浊利佛南无尊光佛南无成就意佛南无无烦热佛南无除地重佛南无最焰光佛南无决思惟佛南无<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>日佛南无聚集宝佛南无剖华光佛南无尊上自在佛南无名称幢佛南无德悦佛南无法灯明佛南无威光悦佛南无军将敬像佛南无师子游步佛南无离一切染意佛南无海意佛南无散华庄严光佛南无盖聚佛南无萨梨树王佛南无金光明师子奋迅王佛南无解味佛南无灭根佛南无月胜佛南无华香佛南无须弥光明佛南无月明佛南无敏步佛南无政明佛南无法光佛南无戒悦佛南无普照积上功德王佛南无大自在佛南无善住功德如意积王佛南无益天佛南无普解佛南无成就义修佛南无人中光佛南无好德佛南无见精进佛南无名称仙佛南无名称旛佛南无焰面佛南无普悦佛南无身光普照佛南无决散佛南无尊上德佛南无调意佛南无爱怀敬供养佛南无普摄佛南无道悦佛南无思意佛南无出意佛南无山意佛南无杂色光佛南无雷声佛南无火光身佛南无德岩佛南无无垢慧深声王佛</p><p>二百佛竟</p><p>南无无忧怀佛南无天界佛南无师子无量音佛南无<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>海佛南无见敬怀佛南无树王丰长佛南无调幢佛南无普方闻佛南无敬怀明佛南无月幢佛南无<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>施佛南无星王佛南无月中天佛南无光明日佛南无大名称佛南无喜音佛南无说敬怀佛南无名称体佛南无<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>胜奋迅佛南无美悦佛南无妙乐尼佛南无众生眼佛南无怀地佛南无弃威毁恶佛南无慈调佛南无尊中上佛南无广大智佛南无妙药佛南无功德轮佛南无离畏佛南无法界身佛南无虚空灯佛南无见月佛南无诸摩尊佛南无大尊上佛南无光明身佛南无意光佛南无金藏佛南无调益游佛南无光日佛南无现身佛南无常<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>佛南无香感佛南无琉璃华佛南无金色身佛南无日灯明佛南无丰光佛南无说敬爱佛南无善思益佛南无普见善佛南无师子旛佛南无普仙佛南无大游步佛南无曜莲华光佛南无山吼自在王佛南无无量悦佛南无无染佛南无天盖佛南无能作无畏佛南无车乘佛南无龙胜佛南无支味佛南无车光佛南无日眼佛南无无碍眼佛南无共游步佛南无大灯明佛南无盛长佛南无山积佛南无德体佛南无法典佛南无风敬佛南无无畏敬怀佛南无慧幡佛南无威神光明佛南无月施佛南无摄爱择佛南无无垢色佛南无善事佛南无<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>光佛南无光屈佛南无法洲佛南无焰幢佛南无无边精进佛南无宝悦佛南无普思佛南无善思意佛南无护一切佛南无作利益佛南无须弥劫佛南无光音佛南无智山佛南无真正幢佛南无善住意佛南无无量天佛南无尊华佛南无大檀施佛南无大幢佛南无光中日佛南无妙法光明佛</p><p>三百佛竟</p><p>南无照三世佛南无智自在佛南无施天种佛南无见以度佛南无殊胜相佛南无孔雀声佛南无普伏佛南无虚空云佛南无无见死佛南无名称敬爱佛南无善摄佛南无天中悦佛南无智慧灯佛南无大聚佛南无深觉佛南无无量游步佛南无弥留佛南无明聚佛南无大重佛南无大游佛南无胜天佛南无调益游步佛南无月敬怀佛南无愿海光佛南无说悦佛南无慧光佛南无智灯照曜王佛南无华聚佛南无神足光明佛南无不可胜奋迅声王佛南无无量光焰佛南无调体佛南无光称佛南无宝幢佛南无大力光相佛南无日幢佛南无无比慧佛南无多所<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>佛南无世听闻佛南无游神足佛南无最上名称佛南无清净面月藏德佛南无宝正佛南无无能毁名称佛南无快光佛南无满足心佛南无无谄意佛南无独步佛南无一念光佛南无无边功德宝作佛南无大护佛南无天幢佛南无无迷步佛南无妙眼佛南无善悦怿佛南无乐说庄严云吼佛南无施光佛南无怀天佛南无解脱光佛南无持德佛南无润意佛南无道光佛南无海丰佛南无道喜佛南无广大善眼净除疑佛南无乐说山佛南无世主身佛南无法力自在胜佛南无法起佛南无法体胜佛南无无迷思佛南无德上佛南无无谄名称佛南无大净佛南无大众自在勇猛佛南无天光明佛南无悦摄佛南无一切福德山佛南无毗头罗佛南无地悦佛南无众胜解脱佛南无杂光佛南无月敬哀佛南无示现无畏云佛南无法勇猛佛南无开示无量智佛南无名称上佛南无月眼佛南无龙天佛南无摩醯首罗自在佛南无德觉佛南无华上佛南无世敬哀佛南无无尽受光佛南无十力自在佛南无三世华光佛南无净迦罗迦决定威德佛南无十方幢佛南无龙自在王佛南无梵自在王佛</p><p>四百佛竟</p><p>南无说敬哀佛南无寂敬爱佛南无地光佛南无作德佛南无尊光明佛南无善处佛南无天喜佛南无普光明佛南无净音佛南无大能佛南无解脱日佛南无众胜佛南无觉光佛南无德名称佛南无善觉佛南无散异疑佛南无师子渴爱佛南无德步佛南无大亲佛南无现住佛南无天所恭敬佛南无海文饰佛南无敬爱佛南无须弥旛佛南无净王佛南无智慧岳佛南无香施佛南无寂静燃灯佛南无持意佛南无能仙悦佛南无宝灯明佛南无焰光佛南无见众佛南无敬爱住佛南无欢悦事佛南无德调体佛南无悦见佛南无无畏亲佛南无净眼佛南无寂心佛南无不迷步佛南无尊眼佛南无好解脱佛南无<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>本佛南无最上众佛南无散光佛南无自事佛南无寂胜岸佛南无光明名称佛南无光明照佛南无亲展佛南无月贤佛南无焰音佛南无德调佛南无无著胜佛南无相王佛南无无烦热意佛南无尊敬佛南无法台佛南无无尽德佛南无无碍胜佛南无无尽香佛南无寂胜佛南无寂功德佛南无大善日佛南无至无畏佛南无敬慧佛南无无迷意佛南无敏敬佛南无天自在佛南无神足悦佛南无无盖佛南无龙光佛南无威神步佛南无弥留岳佛南无见生死众际佛南无惭愧面佛南无焰色像佛南无宝岳佛南无寂意佛南无月尊上佛南无常禅思佛南无德幢佛南无众生中尊佛南无无畏友佛南无不动眼佛南无胜怨佛南无游光步佛南无调岩佛南无一相光佛南无世所尊佛南无观方佛南无敬戒佛南无世悦焰佛南无师子奋迅游佛南无无浊意佛南无名称悦佛南无决断意佛南无除过佛南无善寂诸根佛</p><p>五百佛竟</p><p>南无德身佛南无因藏佛南无光好喜佛南无直步佛南无杂色佛南无普放光佛南无行胜佛南无常忍佛南无<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>尊佛南无无胜佛南无轮天莲华佛南无坚奋迅佛南无普贤佛南无尊威神佛南无盈利意佛南无护王佛南无莲华眼佛南无思名称佛南无树幢佛南无净护佛南无普照佛南无宝法胜决定佛南无德香悦佛南无智者赞佛南无德度佛南无无畏王佛南无慧灯佛南无威力佛南无普见王佛南无觉喜佛南无胜怨悦佛南无一切敬爱佛南无度众疑佛南无舍净佛南无金刚胜佛南无尊教授佛南无慧悦佛南无持觉佛南无敏音佛南无大龙佛南无普娱乐佛南无普世怀佛南无师子娱乐佛南无破诸军佛南无胜眼佛南无明伏佛南无坚才佛南无坚娑罗佛南无泰调佛南无善眼清净佛南无见宝佛南无尽作佛南无离漂河佛南无持名称佛南无梵天所敬佛南无以敬佛南无大屈佛南无敬智慧佛南无无际愿佛南无舍漫流佛南无好喜见佛南无大华佛南无自成就意佛南无喜光佛南无快解佛南无施宿佛南无坚声佛南无须尼多佛南无毗摩妙佛南无最颜色佛南无思禅思佛南无游戏德佛南无怀最佛南无善毗摩佛南无普观佛南无坚心佛南无敬最上佛南无善住功德摩尼山王佛南无度世佛南无喜德佛南无上宝佛南无善于惭愧佛南无照一切众生光明佛南无师子王佛南无大步佛南无普怀佛南无音声器佛南无怀上佛南无普止佛南无普觉佛南无威德大势力佛南无胜威德佛南无坚固誓佛南无净供养佛南无天所敬佛南无成坚固佛南无最胜佛南无一切功德备具佛南无坚解佛南无寂光佛</p><p>六百佛竟</p><p>南无甘露成佛南无极上音声佛南无欢喜增长佛南无坚勇猛破阵佛南无怀灭佛南无觉步佛南无依最声佛南无成丰佛南无海步佛南无欢喜面佛南无最上光佛南无寂觉佛南无大圣佛南无善宝佛南无谛住佛南无人自在佛南无住寂灭佛南无游入觉佛南无胜友佛南无怀利佛南无最步佛南无人中月佛南无威极上光明佛南无拘邻佛南无最胜王佛南无大庄严佛南无师子奋迅步佛南无怀香风佛南无喜寂灭佛南无大称佛南无人音声佛南无阿[少/兔]律佛南无珠月佛南无怀明佛南无广名称佛南无喜最上佛南无净觉佛南无宝敬佛南无好颜色光佛南无灭怨佛南无胜军佛南无谛觉佛南无无终光佛南无常忍辱佛南无胜月上佛南无象步佛南无怀智慧佛南无怀谛佛南无莲华香佛南无香上自在佛南无不厌足佛南无等誓佛南无最威佛南无大光炎聚佛南无杂种说佛南无度渊佛南无实体佛南无解惭愧佛南无上所敬佛南无杂音声佛南无德游戏佛南无净住佛南无好香熏佛南无月光明佛南无戒分别佛南无觉华佛南无最上意佛南无宜受供养佛南无昙无竭佛南无喜上佛南无月光轮佛南无怀觉佛南无敬老佛南无胜忧佛南无<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>明佛南无普宝盖佛南无敬上佛南无屈名称佛南无那罗延光明佛南无度疑佛南无知时王佛南无聚华佛南无上华佛南无胜斗战佛南无师子乘光明佛南无尼尸陀佛南无怀步佛南无离一切忧恼光明佛南无坚固光明佛南无月天声佛南无云王光明佛南无净光明佛南无除云盖佛南无无垢臂光明佛南无如树华佛南无上声佛南无无终灯佛南无成就义光明佛南无德天佛南无众智自在佛</p><p>七百佛竟</p><p>南无无上妙法月佛南无无恐畏光佛南无等正觉佛南无无为声磬佛南无普照轮月佛南无普轮佛南无听采意佛南无无碍思惟佛南无灭思惟佛南无精进怀佛南无戒恭敬佛南无伏怨佛南无快上怀佛南无觉伏涛波佛南无无灭慧佛南无伏欲棘刺佛南无到究竟佛南无华仙佛南无虚空慧佛南无似思惟佛南无慧力佛南无炎胜海佛南无进巍巍声佛南无普音佛南无碎金刚佛南无无为声佛南无无缺精进佛南无大精进盛光佛南无寂静光明身佛南无胜畏佛南无天所敬德喜佛南无法华佛南无净盛佛南无月喜佛南无怀幢佛南无善意成佛南无无恐畏力佛南无磬音佛南无日华佛南无澄住思惟佛南无爱怀佛南无月盛佛南无无为成佛南无无吾我热意佛南无智照顶王佛南无谛聚意佛南无智日普照佛南无喜乐如见佛南无怀命佛南无怀思佛南无无烦佛南无根本上佛南无大思惟佛南无怀像佛南无大精进怀佛南无无恐畏佛南无名誉音佛南无大声慧无缺失佛南无戒富佛南无威身佛南无安乐光佛南无法行深胜月佛南无以灭光佛南无法光明慈镜象月佛南无波罗罗坚佛南无逮威佛南无月内佛南无常智作化佛南无山王胜藏王佛南无破金刚坚佛南无祠施佛南无谛精进佛南无无量喜光佛南无光威佛南无法华高幢云佛南无怀光佛南无出游泥佛南无捐种姓佛南无法海说声王佛南无大威佛南无法雷幢王胜佛南无德莲华佛南无法轮光明顶佛南无幢光佛南无法智普光明佛南无无为华佛南无大胜光佛南无无为光威佛南无道威佛南无净思惟法华佛南无法云吼王佛南无虚空功德佛南无最如意佛南无须弥最声佛南无自在怀佛南无无为称佛南无法日智转燃灯佛南无无碍普现佛南无帝释幢王佛南无无量香光明佛</p><p>八百佛竟</p><p>南无清净身佛南无月中尊佛南无喜施佛南无相好华佛南无不思议光佛南无普飞广戒坚视佛南无离愿佛南无胜贤佛南无及曜佛南无虚空心佛南无惟大音佛南无决断音佛南无除三涂龙施佛南无云雷佛南无虚空多罗佛南无德思佛南无无垢心佛南无宝味佛南无十光佛南无超越诸法佛南无觉无碍音佛南无天华佛南无等见佛南无月称佛南无大像佛南无不扰佛南无大月佛南无威慈力佛南无月威光佛南无趣怀佛南无住善度佛南无淳精进佛南无光勇欲佛南无宝离慧勇佛南无<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>佛南无成盈利佛南无悦好佛南无行佛行佛南无觉灭意佛南无师子奋迅心云声王佛南无无缚喜像佛南无持慧佛南无德称佛南无须弥山威佛南无快明佛南无诸方天佛南无无量思惟佛南无净戒佛南无善度佛南无端绪佛南无现面世间佛南无善光敬佛南无具足意佛南无世雄佛南无正音声佛南无威喜佛南无善成就佛南无无碍意佛南无无垢月幢称佛南无摩善住山王佛南无朋友光度佛南无慧台佛南无普宝佛南无知众生平等身佛南无大愿胜佛南无快士悦佛南无恬憺思惟佛南无善供养佛南无德聚威佛南无悦相佛南无大焰聚威佛南无光华种种奋迅王佛南无快应佛南无戒度佛南无最视佛南无寂幢佛南无大应佛南无广光明佛南无无为悦佛南无巍巍见佛南无名称十方佛南无降伏魔佛南无慧无涯佛南无如千日威佛南无必意佛南无称悦佛南无上度佛南无可观佛南无无量慧佛南无智炎胜功德佛南无栴檀香佛南无世间灯佛南无不可降伏幢佛南无摄根佛南无思惟解脱佛南无胜威德意佛南无如净王佛南无难过上佛南无忍辱灯佛南无妙见佛</p><p>九百佛竟</p><p>南无聚自在佛南无作诸方佛南无无胜最妙佛南无无为光佛南无无为思惟佛南无过倒见佛南无名称王佛南无胜根佛南无日见佛南无德聚威光佛南无见平等不平等佛南无慧持群萌佛南无自在悦佛南无自在佛南无慧意佛南无德山佛南无以净音意佛南无思最尊意佛南无净德佛南无戒自在佛南无深嗅思惟佛南无拘苏摩奋迅王佛南无寂进思惟佛南无娑罗华上光王佛南无勤群萌香佛南无寂乐佛南无德所至佛南无大精进文佛南无离疑佛南无决偶佛南无须弥山意佛南无净身佛南无无垢眼上光王佛南无能度<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>佛南无毗卢遮那功德藏佛南无慧忖佛南无听彻意佛南无如天悦佛南无思惟度佛南无至大精进究竟佛南无大身佛南无杂华佛南无尊自在佛南无如空佛南无觉善香熏佛南无尊上所敬佛南无欢悦佛南无莲华人佛南无莲华意佛南无自在德藏佛南无人悦佛南无尊意灯佛南无威神所养佛南无谛思惟佛南无解脱慧佛南无除三恶道佛南无泽香忧冥佛南无湍度佛南无摩尼清净佛南无意强自在佛南无无畏娱乐佛南无快觉佛南无离诸欲佛南无胜华聚佛南无大结髻佛南无天自在六通音佛南无威神力佛南无人名称柔佛南无断一切众生病佛南无最音声佛南无坚意佛南无力通佛南无眼如莲华趣无为佛南无快断意佛南无喜音声佛南无天悦佛南无竟见佛南无疆精进佛南无断一切障碍佛南无无垢思惟佛南无聚音佛南无无量怨佛南无功德舍恶趣佛南无无为光丰佛南无娱乐度佛南无一乘度佛南无调辩意佛南无烦教佛南无意车佛南无德善光佛南无坚华佛南无聚意佛南无尼拘类树王佛南无无常中王佛南无色如栴檀佛南无日内佛南无德藏佛南无毗婆尸佛南无尸弃佛南无毗舍浮佛</p><p>一千佛竟</p></div>"
}]