[{
    "title": "摄大乘论 第1592部",
    "author": "佛陀扇多 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>摄大乘论 卷上</p><p>阿僧伽作</p><p>后魏世<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>扇多于洛阳译</p><p>大乘阿毗昙经中。对如来前为欲显发大乘义故。善住菩萨说。所谓依大乘经。明诸佛如来有十种胜妙胜语。何等为十。一者智依胜妙胜语。二者智相胜妙胜语。三者入智相胜妙胜语。四者入彼<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>胜妙胜语。五者入彼修因果胜妙胜语。六者还彼行中差别增上戒胜妙胜语。七者增上心胜妙胜语。八者增上慧胜妙胜语。九者灭除胜妙胜语。十者智胜妙胜语。如是此修多罗句显发。说大乘是佛语。云何显发。如是此说中小乘经不说此十种句。唯大乘中明。所谓阿犁耶识。智依事所说有三种性。一者他性。二者妄分别性。三者成就性。以智相事故。唯记说入智相事者。谓<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。入彼因果事者。谓十菩萨地还彼修彼。差别事中受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>谓增上戒。首楞严虚。空等诸<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>增上心事。说无分别智。谓增上心事说不住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。灭彼果事有三种<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。一者真身。二者报身。三者应身。彼果智事。说如是此十种句。非小乘教故唯大乘中显胜说及胜上故。是故如来依为诸菩萨说。以是义故。依大乘教故。诸佛如来说有十种胜妙胜语应知。云何复此十种相胜妙如来胜语。明显大乘是佛语。及遮小乘是非大乘。是以此十句小乘经所不说。而大乘有说。及此十句能令得大<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>善许不相违。为得一切智智故是。中说偈</p><p>彼依智相依彼因及彼果</p><p>彼<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>差别彼果及除灭</p><p>智及上妙乘至于胜进修</p><p>彼说余处所无有此见胜因上菩提</p><p>佛语说于大乘中十句胜说于此经</p><p>有何义故。此诸十句如是渐次说。是以菩萨从初学已。先应诸法因果依已。应于<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>善巧成。而有于诸缘生法中应相善巧成舍离。横安谤遍善巧故。菩萨如是善学故。于彼善取相中应令证学。是故令诸障中心得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。于后入智相行已前<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>中令修得六波罗蜜。已深净身心故。是以净心所摄。六波罗蜜故。于诸十地中分别修行三阿僧祇劫。于后令满三种菩萨戒。满已令彼果涅槃及证阿耨多罗三藐三菩提。此是诸十句渐次说。然此说中一切大乘略尽。是中初说智依胜妙胜语。如来经中说。谓阿犁耶识。以阿犁耶识语故。作阿犁耶识语说。如来于大乘阿毗昙经偈中说</p><p>无始已来性一切法所依</p><p>有彼诸道差及令得涅槃</p><p>还彼经所说</p><p>一切诸法家彼识一切种</p><p>故说为家识聪明者乘此</p><p>此是经证。然复彼何故名阿犁耶识。有生法者。依彼一切诸染法作果。于彼彼亦依诸识作因故。说为阿犁耶识。或复<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>依彼为我故。名阿犁耶识。彼亦名阿陀那识。此中有何证如相续解脱经中说</p><p>阿陀那识最微深喻如水波于诸子</p><p>我不为凡言说此莫执取以之为我</p><p>彼以何义故名阿陀那识。依一切色相故。及取一切依身事故。如是彼依诸色等根不坏者。乃至命不尽。随顺故。未来取身彼能生取身。是故彼名阿陀那识。彼亦名心。如佛所说心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>尔。是中意有二种依。近作缘事故。近灭识依。与意识作生因。第二意杂四种<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。常共同身见我慢爱身及无明。彼是依识所染生。若以一身所生识第二是染境界识义故。取近义故。及不分别义故明二意。是中有偈</p><p>杂染障无明同法及诸五</p><p>三昧或胜事说中应诚患</p><p>无想而起我生顺行无穷</p><p>近顺起我相一切是不成</p><p>离染<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>事二三是相违</p><p>彼无一切处执成我等义</p><p>心顺正义故常顺不相违</p><p>一切是同行说无明不离</p><p>心及身第三离阿犁耶识更余处无。以是义故。释成阿犁耶识是心事随种子行。彼意及意识。以何义故。说为心种种法。种子习熏聚义故。佛以何义故。小乘经中彼心不说为阿犁耶识及阿陀那识。摄甚微细智义故。彼诸声闻不修学行一切智人智故。是故彼中间释说智。复说释成解脱故不说。诸菩萨者修行一切智人智故。为彼说此识。若不说者离彼识不得解行一切智人智。然复异名。小乘经说彼识。如增一阿含中说。喜乐阿犁耶<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。及着阿犁耶。阿犁耶所成。并求阿犁耶。灭阿犁耶故。<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>时亲近正听起随顺心。许取法及次法。如来出世间时。世间说此希有法故如来出思益经中说。以此义故。小乘经亦异名。说此阿犁耶识。大僧祇增一阿含经中亦说彼为根本。如树依根住故。弥沙塞僧中亦说言。乃至世间阴不断。如是异名亦说彼识。或有时节中色及心断时。非阿犁耶识有断义。彼是种子。是故所有彼智所依阿陀那识事。心事。阿犁耶事。根本识事。乃至世间阴事。说彼阿犁耶识。此阿犁耶识转明胜。如王大道。余者复作是言。心意识是一义唯文异。然彼义不成。意及识中义有见异故。是放逸心亦应有异义成。复有余者言。如来阿含中所说。喜乐阿犁耶世间。如是等句者。谓<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>是阿犁耶。余者复言。同贪等乐受是阿犁耶识。或复言。身见是阿犁耶。然彼于阿犁耶识迷痴故。或从闻及解释故。作如是说。依小乘经教分别安故。然彼者此分别安事不成。彼愚痴故。如是分别已。阿犁耶识转胜。成如是差别说故。云何转胜明。如是彼五阴。于恶道生处一向受苦时厌成。彼既是一向厌故不成。有厌乐事。如是彼常求厌离同贪乐受者。从四禅已上无复成厌离。如是彼众生中依止事不成。身见亦同。此法中信<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>者厌离成。是故此亦彼者依止不成。然阿犁耶识至内身许事受一向苦道处生者。及苦阴并求解脱者。阿犁耶识中皆自身相彼解脱。不应有从第四禅以上生者。虽有同贪乐厌离。阿犁耶识起我相爱等。如是此诸同法信无我者。虽有厌离身见。而阿犁耶识作爱自身相。如是分别阿犁耶识已。转胜明智是阿犁耶。说傍名及异名。分别安事。然复此相分别事云何得知。彼略有三种。一自相差别处。二因事差别相。三果差别相。是中阿犁耶识自相义者。依一切染等法习故。彼有生因相种子摄取义故。是中因事差别义者。还彼染等诸法中。彼阿犁耶识如是一切种子。一切时作因事现成。是中果差别者。阿犁耶识中所有。彼诸染法依。无始以来习生事。何者是习而以习名。说此有何义。依彼法同生灭故。所有彼生相事此是说。所谓如华薰胡麻。同生灭胡麻故生。彼香因事故生。或多贪欲者有贪习。贪等同生灭。有彼心故。彼因相似生。或复多闻者有多闻习。彼闻忆念已同生灭心中。彼说因相事生故。是以有此习义故。说为<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。亦名持法。如是阿犁耶识中亦如是。何者复彼阿犁耶识中染等诸法种子。为当分别住。为不分别。彼非如物分别。彼处住非不分别。然如是生彼阿犁耶识。彼生胜力故。说为一切种子。云何彼阿犁耶识及诸染法。同时见迭互作因事。所谓如灯焰及炷生烧因同时迭互作因。及如苇束迭互人捉故同时不堕地中。此亦如是。迭互作因事。应知亦如阿犁耶识诸染法作因。诸染法与阿犁耶识。如是因缘差别事。不见有余因缘。云何无分别种种习而与有分别种种诸法因成。所谓如种种色染衣已不见种种色。若彼衣浸在器中。尔时彼诸色种种差别见。非一器中故。如是阿犁耶识种种习薰习薰时虽非种种。能生果时向色器已。无量种种相现诸法种种事。此是大乘中甚微最细因缘。有二种。一者性差别二者爱不爱果差别。是中所有依此阿犁耶识生诸法者。此是性差别种种性分别现缘故。是中迷初因缘者。于阿犁耶识中或言性因事。或言本作因事。或言<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>应化因事。或言自身我因相事。或言无因<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>事。第二因缘迷者。复自身计为作者食者。譬如众生盲人彼未曾见象。为彼盲人将示象。诸生盲者或捉象鼻或牙或耳或足或尾或背。彼示已问象何相或说言如犁辕。或言如杵。或言如簸箕。或言如碓臼。或言如苕帚。或言如石山。如是不通达。不知此二种因缘故无明障故如生盲。或计为性或本因或自在或自身或无因或作者。或计为食者。阿犁耶识如象。性相自体不知故。略说阿犁耶识因事及果事报识一切种子性已。是故三界中摄一切身及一切道。是故说五偈</p><p>内外不分明而说相顺事</p><p>彼一切真实说为六种子</p><p>空及同诸大彼亦说随顺</p><p>定而忘诸缘及自果将来</p><p>彼见而无记或顺彼无余</p><p>薰彼非余处然彼是习相</p><p>六无有顺义二别相违故</p><p>诸念无同故生余随顺故</p><p>内外诸种子彼说为生因</p><p>不续取尽故自然坏遍故</p><p>所有余六转顺识。彼一切身道处受<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。应知如中边分别论说</p><p>一是作缘识第二受果报</p><p>分别受报者同发诸心尔</p><p>彼诸识迭互作缘故。大乘阿毗昙修多罗有偈</p><p>一切诸法依如是彼诸识</p><p>迭互作果事一切及因事</p><p>若此诸识迭互作因缘果者。初因缘及彼第二因缘有何缘。谓增上缘。然此六识有几缘所生。增上念次第等缘生。是此余三种因缘。世间者至爱不爱道。及受果报者四缘成。以分别明此阿犁耶识。傍名及相复云何得知。唯是阿犁耶识如是傍名说及如是相。而非是六种转顺识尔。如是中间差别安阿犁耶识已。是故不成染净事烦恼事及业事生染事不成。世间出世间净事不成。云何烦恼染事不成。是以六识身中烦恼染习种子作事不成如是。彼眼识贪烦恼使等同生灭彼。是彼者薰有子。及非与眼识灭已。余识中间以非习。及不见习所依。既无眼识前灭。眼境中间同贪等生无故。是故过去者不成。如过业果报生。然彼眼识贪等同生故习不成。彼贪所依故。及贪不坚。非余诸识别体故。诸识同时生灭无故非<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。余性可有同生灭。如是故。非眼识贪等烦恼及使薰成。非彼识及识所薰。如眼识。如是余六转顺识等如顺释。应知所有非想以上灭已。此处生烦恼染。彼初生识彼亦无种子生同依止。彼习过无故。以生烦恼对治识。彼余一切世间识灭已。中间阿犁耶识烦恼及使种子。彼对治识中。不成于诸烦恼性解脱故。及同生灭无故。后复更生世间识故久灭无已同依彼习应离种子生中间阿犁耶识。是故中间阿犁耶识烦恼染事不成。云何业染不成。行缘识不顺义故。彼无取缘有。亦不顺故。云何生染不成。取后身身不顺义故。不入定地中灭已在中阴。念杂染意识取后身。然彼杂染意识中阴中灭已。彼以歌啰啰故。母腹中托。若唯意识托者。托已彼依力故。母腹中应有依识行。是以二种意识从母胎应有。同有故而非彼所托意识。意识事成。上以杂染身故。及随顺意识念。虽有彼意识托既休托意识。彼为一切种子。为当随彼身依<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。若随彼所托彼是一切种子者。是故唯阿犁耶识。是傍名差别安成依识尔。然若依彼故。一切种子者。彼以何依事作因识者。彼非一切种子。若所依作果事者。彼一切种子此义不成。是故此释成。所有彼托识彼非意识。是报识。彼一切种子故。以取后身以认取余色根。何者报识而认不可见上意。意识及不坚牢固。彼诸余识取色根。无非色可成。是识及灭色迭互相依。如苇束顺义故。行彼亦不成中间报识。食事义故。不成诸大。众生非报识。中间诸六识随所三界中生诸大。众生作食所见从此灭已。虽入生定。以杂染不入定。意识取后身。然彼不入定心。彼地中杂中间报识以种子不成。然生在<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中。中间一切种子报识杂染善根觉者。无有种子。无所可依。得杂染善根心。还彼处现出世间心。诸余世间心谢已。彼行应得回生非有想非无想生者。现不用处出世间心时应得回彼二道。彼出世间识非有想非无想。至所依非有用处行所依。涅槃道所依成。欲舍身时。或造善不善。若上若下渐次依迹。灭毒得清凉。不应成中间有阿犁耶识。是故生染中间一切种子报识中不成。云何世间净事不成。如是离诸欲者。未得<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>心。唯得欲界<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。于欲生厌离。然是欲界中心。后用行色界心不共同生灭。彼不薰此种子者不成。非彼色界心。过去无量生所隔。彼入定心作种子不成。既无彼已释成此所有。彼入定色界心一切种子报识久时转转来。后因缘故。是彼善行习故。彼心增上缘。如是一切厌离地行中随顺如义应知。如是世间净事中间一切种子报识不成。云何出世间净事不成。如佛所说。外闻他声音以内寂静思量。因彼事故得生<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。以闻彼声响音念故。或薰耳识。或薰意识或薰彼二。是中彼诸法寂静思惟忆念故。耳识尔时不行。意识亦余识所隔杂故。若寂静思惟行生时。彼久灭<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>意识闻习所薰同习既无。何处复彼种子心。后时寂静思惟行而生所有。彼寂静思惟修行世间心。彼正见同顺出世间心。或时同生灭。是故彼不薰。以不薰故彼种子不成。是故出世间净中间一切种子报识不成。是中间习者。彼种子摄不顺故。复云何一切种子与报识作染因成。彼对治出世间心种子事不成。出世间心是未曾有。是故彼习本无。既无彼习已有何种子生。彼应说善净法界尽唯以闻习种子生彼所有彼闻习彼为是阿犁耶识性为不。若是阿犁耶识性者。是中云何彼对治种子成。若是非如是性者。是以彼闻习种子有何依身可见。诸佛得菩提已。所有彼闻习随心身现彼共同事。报识中行亦如乳水。然非彼阿犁耶识。彼对治种子故。是中依微习故生中习依中习故上习生。多以<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>顺义故。然彼闻思修种子虽微中上。然是法身种子应知阿犁耶识相违。非阿犁耶识所摄。出世间善净法界因气事故。世间及出世间心作种子。然彼未得出世间心时。现气烦恼对治。随恶道对治。消灭作一切恶对治。随顺亲近诸佛菩萨。世间亦诸新学者法身所摄。应知诸菩萨解脱身所摄。声闻缘觉彼阿犁耶识法解脱身所摄。随所随所微中上渐次增长。如是如是。报识亦微劣身亦转明。一切时身亦转明。一切时转身已。彼报识一切种子离种子成。及一切时灭已。彼复云何。阿犁耶识如乳水。若尔非阿犁耶识。同事而行。一切时坏如鹅水中饮乳。或入世间厌。或入定习灭故。入定习增长。如转身及入诸灭尽定。虽不着识故彼中唯执不离。成非灭尽定。彼对治可取生。非彼起已更复生。报识已断。非余处可取顺成。若复计言。灭尽定有心。彼亦是心善不善。彼无记事故。不生成彼亦不成。若复言色心后生者。诸法种子事分别前未生。亦不生色无色。灭已及从灭尽定起。彼不成。及阿罗汉后心亦不成。除唯次第缘事可成。如是一切种子报识中间无染无净成。是故释成彼无及随所相说。是中说偈</p><p>菩萨净心离诸五识离余转事</p><p>心云何作对治回转无量不成</p><p>因果分别彼灭应顺离子非事</p><p>若取转事彼事二无转事不成</p><p>何者。复此阿犁耶识差别事略有三种。及四种应知。是中三种者。以三种习差别故。一言说习差别。二身见习差别。三因缘习差别。四种习差别。一取时差别。二报差别。三念事差别。四相差别。是中取时差别者。所有诸习生彼无故。行缘识及取缘有不成。是中报差别者。所有行有缘故。诸道受报彼无故。无子后生。诸法生事不成。念事差别者。所有彼意我相念事。彼意无己身念取事不成。是中相差别者。所有彼同相不同相。离受生种子相同。受生种子相同。所有器世间。种子不同者。所有内入种子。所有同者。彼离受生种子对治生。不同者。障灭。及同者。他所<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>分别取见净。诸行人一事中种种信如种见得。是中偈</p><p>难灭证缚说为同事行人乱心</p><p>自念外坏净不相违真实见净</p><p>佛戒清净诸佛见净</p><p>所有不同彼同受生种子。彼无故。器世间众生世间顺胜事不成。复粗涩相安相。粗 涩相者。所有烦恼及使种子。安相者。有漏善法种子。彼无故报作不作胜身中不成。复受不受相。受相者。所有熟报善不善种子。不受相者。所有言道习种子。无量分别顺种子故。彼无者作不作<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业得时不受用义不成。新语言习生事不成。复喻相幻焰梦患目等。彼阿犁耶识彼时无故。虚妄分别种子故。相事不成。彼复同相别相具有缚者同相世间。离欲者坏相。学者声闻及诸菩萨一义一处除相。阿罗汉辟支佛诸如来烦恼障具除相。烦恼障智障及具除相。如顺彼无渐次。烦恼灭事。以何义故。善不善诸法报中不定无记报。如是无记善不善不相违。善不善事迭互相违善不善事烦恼转事不成。是故唯不定无记是报识。已说智依。智相复云何知。彼略有三种。一他性相。二妄想分别相三成就相。是中何者他性相。所有阿犁耶识种子中。虚妄分别所摄识。彼复何等身与受用识。彼所受用识。受用识。时识。数识。方处差别假意识。自他分别善道恶道生灭识。是中所有身与受用识及彼所用识。及受识所有时数分别假识者。彼语言习种子因生故。所有自他分别识。彼身见习种子因故。所有善道恶道<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>者。彼为因缘习种子因故。此诸识一切尘一切道烦恼所摄。说他性相者。虚妄分别现见成。此别现见成。此诸识中所有虚妄分别所摄。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>事非有妄取义依见。此是他性相。是中何者妄分别相。若非有尘唯彼识作尘现取故。是中何者成就相若还彼他性相中微尘相永无有事。是中身与受用识等六内眼等尘应知。彼所受用识者。六外尘色等应知。彼能受用识者。六种眼识等尘应知。此诸识余识差别应知。复此诸识唯识无义故。余处有何见。梦等见应知。所谓梦中离尘唯识。如是种种色声香味触屋宅林地风诸山尘现相事故见。然彼处无尘义如是见者一切唯识。随义通达应知。言等者幻焰鹿渴患目等应知。然彼如梦觉者一切亦如是识。何以故。如梦中唯识意生。如是彼处亦不行。行真实知觉已故行真实。未觉者唯识事云何得知。从阿含及解释顺义中。是中阿含如佛十地经所说。三界<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>作。相续解脱经中<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨问佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。所有彼三昧境界中见像。彼为于心异为不异。佛言。弥勒不异。何以故。彼念唯识所明识我说。世尊。若是彼三昧境界形像心中不异者。云何以彼心而取彼心。佛言。弥勒。无有法而能取法。然彼心如是生。以如是生故如是见。譬如缘像故唯见像而言我见像。以是义中间不离彼像。中间像相似见。如是生彼心。如是中间而言见。如是此阿含将证成。如是入定心时随所青等知所有。见像还见彼心离尘青等。如是顺释已。菩萨于一切识中如是测量取。唯识中无彼青等忆念持识。前已彼念所见闻思修。亦随所忆事识。彼亦念过去故。彼现相唯识。得以此喻证故。菩萨虽真智未觉已应思量唯觉事随此如梦说种种诸识。彼识顺成唯识。眼识等诸识。眼等诸识复有诸色云何得知。唯识事彼亦有。阿含及顺释如前说。若是唯彼诸识者。何故色事及现见相事久住体。行颠倒等烦恼染处因故。余时非尘为尘妄不成。既无彼事烦恼障智障染事不成。彼既无净事不成。是故如是彼顺义成。是中有偈</p><p><a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>及妄想说为诸色识</p><p>及无非色识有彼非余者</p><p>何故时等种种如说者行无时。世间流不绝故。无量众生界因故。无量佛世界因故。无量所作事迭互假名分别因故。无量摄取受用差别因故。无量爱不爱业果报受用差别因故。无量受生死差别因故。云何复此诸识唯识作事成。略说有三种相。一者但彼无义因故。二事同念见识因故。种种事画师所生因故。如是彼一切诸识无尘故。唯如是同见相。眼识等色等念故。及彼识见乃至身识见唯意识。一切眼等法尽识同念意识。识同见分别故。于意识及一切识生现相故。是中有偈</p><p>唯彼二种事行者入意识</p><p>唯入彼心已彼力所成此</p><p>唯彼意识种种行故。得彼名。亦如身口等。余者行一切身中如画师。二种现相行。唯彼尘现相故。及分别现相故。一切处触现相故。行色尘身依故。彼意识彼余色相身依故。是中有偈</p><p>远至独行故无身窟所依</p><p>能调不调心我说为净行</p><p>如说此诸五根。意识境界缘受成。然是彼者意是依止尔。复如说十二入。经中六种识种识是意入尔。若有阿犁耶识。识尘识分别安是中。诸余一切识。彼念想识唯意识识同身彼见应知。彼如是唯念想诸识彼见生因故。如尘现相见彼生同依作事成。如是此诸识唯识住事成。云何有见尘而说无有义成。如佛所说。菩萨成就四法。一切诸识解通无义事。相违识相智故。亦如饿鬼畜生人及诸天等同事中见既别。不念见觉识故。亦如过去未来梦现相念故。加意中间颠倒同顺智故。所谓有尘念。彼念识不颠倒。应得不加真智及随顺三种智知故。如是诸菩萨及得<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>者。得心自在忆持力故。现如是事。及得舍摩他。诸行人观法顺故。唯忆念现见故。及得无分别智。彼处住已现一切义。如是此三种智随顺义故。彼义本四诸相释成无有义。若是唯识义现见依者。他性相云何。他性以何义故说为他性。自习种子生故。缘他性生已<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>后自不住。有力故说他性。彼是妄想分别非性非所依。未曾有尘见故。彼云何妄分别。以何义故彼名为妄分别。无量相妄分别颠倒相生故。妄分别者。无自相唯妄见故。说为妄想。若是成就相者。彼永无自性相彼云何成就。以何义故说为成就。不以义故说为成就。缘净念一切善根妙义因故。亦是上义故名为成就。复有分别及无分别说分别性。是中何者分别。何等分别。何等分别性。意识分别以能分别。然彼自语言习种子及一切识。语言习种子故。是无量诸相分别故。行一切处分别妄想分别故。说为分别。复他性妄想念随所有性。他性妄想者。是彼处妄想自性。以何相以何义故先已释。云何复妄分别以何分别。以何念以何念取。以何慢。以何假名。以何安义名。以念故他性中彼念取见彼慢分别起口业。见等四种世间行故。非有义而言有安故分别妄想。此诸三性为同行为别行为别不别。应说傍义故。他性相他性傍义故。彼亦是妄分别傍义故。彼亦是成就有何傍名义。是以他性他性习种子。生他性因故。有何傍名义。以是彼如是妄分别。及妄分别及诸分别因故。有何义故。随彼如是妄分别。如所分别如是彼永无义故。有几种他相。略有二种。一薰种子他相。二染净性不成他相。如是此二种他相故。说为他相。妄分别性亦有二种一者性分别。二者胜分别故。以为分别。成就性亦有二种。一者性成就故。二者净成就故。分别复有四种。一者性分别。二胜分别。三觉分别四不觉分别。觉分别者解义事善巧故。不觉分别者。不解义事不善巧故。复有五种。一名所依义分别。所谓此名有是义尔。二义所依名性分别。所谓此义有此名尔。三名依名性分别者。所谓不决定义名分别故。四所依义性分别者。未决定名义分别故。彼二依彼分别。所谓此义如是。身如是名尔。摄一切义故。复有十种分别。一根本分别。所谓阿犁耶识二相分别。所谓色等识。三念现相分别。所谓同依眼识等识。四念异分别。所谓老等。乐受贪等。他所恼时转变等。趣及欲界等异故。五念现相异事分别。所谓所说如是等异相。彼异相他所将分别。所谓不闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。及闻正法者所有分别。六不寂静思惟。所谓不闻正法者。谓诸外道。七寂静思惟。所谓闻正法同法者。八妒分别。所谓不正意思量。身见等六十二见。同顺彼分别散分别。谓诸菩萨有十种分别。非事相散故。事相散故。正安散故。毁谤散故。一向事散故。异事散故。性散故。随名义散故。及随义名散故。此诸十句散事中对治故说无分别智。一切诸<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜中说如是彼障及对治。具足般若波罗蜜应知。若是傍名义他性相三种性成。云何三种性无差别不成。随彼傍义他性者。非彼妄分别。非成就随彼傍义妄分别者。非彼他性。非成就。随彼傍名成就者。如是非彼他性。非妄想。云何复知。如他性相。妄分别性事现故。非如是体性尔。本名离慧故。及自灭因故。多名故。多身相违因故。不定名秽身相违因故。是中有偈</p><p>本名无慧故多及不定故</p><p>成彼自多身秽身相违故</p><p>觉见诸<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>及见染净等</p><p>如幻应当知及如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>等</p><p>复以何义故。有如是所说事他性相一切事不成。彼无已成就性及无故。如是一切事不成。他性及成就性无故。染净无事患应见染净。是故非一切无。是中有偈</p><p>他性既无成就一切无事常时</p><p>于诸染净</p><p>所有此诸佛如来大乘方广中说。彼说中云何妄分别性应知。无傍名义说可知。他性相云何知。幻焰梦镜像光明响水中月应化等诸喻应知。成就性云何知有四种净法。说中知四种净法者。性净故。所谓真如空实际<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>真实义及法界。是离垢净所谓如是彼离一切障垢。彼得行净。所谓一切菩提分法及波罗蜜等。彼生因念净。所谓说大乘法。如是彼净因故非妄想。净法界因气故非他性如是此诸四法摄成一切诸净法。于中有偈</p><p>幻等说故生妄计无有说</p><p>于诸四净中说为真实净</p><p>净性离垢行念故。彼净诸摄四种义故。复以何相故。他性相如所说幻等喻中明。余者于他性相中。回妄颠倒取意故。云何复余者于他性相中颠倒疑意成。如是余者作是意。云何无此义。现境界成。为彼除疑回义故说为如幻。云何无义诸心心数顺义成。回疑义说如焰喻。云何无此无义而受爱不爱事。回彼疑义故说如梦。云何无此义而有净不净业爱不爱果顺不顺事。回彼疑故说如镜像。云何无义而有种种识顺事。回彼疑义故说如光。云何无此义而有种种假名语言顺事。回彼疑义故说如响。云何无此义实能取三昧境界顺事。回彼疑意义故说如水中月。云何无此义而诸菩萨故取意不颠倒。作众生益义故受生。回彼疑意义故如应化事。有何义故。如梵王经中说。我不见世间不证涅槃。他相性中妄分别。及成就性因故。说世间及涅槃事。无异事故。如是彼他性相妄分别分故说为世间。成就分故说为涅槃。如佛阿毗昙中说。有三法。是染分净分。彼二分有何义故说。他性中妄想性是烦恼分。成就性是净分。还彼他性彼二分。以此义故说。此义中何者说金藏土示现。所谓如金藏土中有三事可见。一地尘二土三金。是中有地尘故见土及见有金。若入火时不见土唯见金。地尘者见土时非正见。见金时非如实见。是故地尘有二分。如是此无分别智火触彼识已。彼识虚妄分别性事见成就性事故不见。无分别智火触彼识已彼识实成就性事故见。妄分别性事故不见。是故所有妄分别识他性相二分成。如金藏泥地尘尔。如来或说一切法常或说一切法无常。或说非常非无常以何意故说常。他性相成就分别故说常。妄分别故非常。彼二分故非常非无常。以是意故说如。常无常不二。如是苦乐不二。净不净不二。空不空不二。有我无我不二。定不定不二。有性无性不二。有生不生不二。灭不灭不二。永定不永定不二。性灭不性灭不二。世间涅槃不二。如是等句差别诸佛一切密语。以此三种性句随顺应知。如常等诸句中说。于中有偈</p><p>如诸法所无及如见非一</p><p>如是法非法不二义所说</p><p>彼一分事故亦说名为事</p><p>二分不名事非事真实说</p><p>如见非如有是故说为见</p><p>如是彼亦见是故说为无</p><p>自体自无故自事中不住</p><p>取者本亦无故说为无性</p><p>无性义故成上上依义故</p><p>无生亦不灭永寂性灭故</p><p>然有四种意趣故。及有四种密语渐次。一切佛语随顺解释应知。一者法同意趣故。所谓我是无量无边时。号曰毗婆尸正真正觉。二者时节意趣。所谓若称多宝如来名者。即定于阿耨多罗三藐三菩提。如<a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>说。若有众生愿取无量寿世界即生尔。三者义中间意趣。如经所说。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>若干如许恒沙等。供养亲近已得解大乘义尔。四者顺众生心意趣。所谓或有众生赞行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>彼者复谤毁。说如是布施如是持戒。及余者说修事。是以故说四种意趣。四种密语渐次。一者劝发渐次。所谓或声闻乘。或大乘中众生法性胜故。顺世谛理所说。二者相渐次。随所<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>说中示现。三者对治渐次。随所说八万四千众生行。四者发愿渐次。随所异义言音声字义余说随所。有偈</p><p>非实而作实颠倒中善住</p><p>烦恼善染故得无上菩提</p><p>欲解释大乘经者。彼应以三种相差别故。略作解释。一者因缘说。二者因缘所生诸法相说。三者以说闻义故说。是中因缘集说者。如说言习所生法。彼如是还彼报识顺识中迭互缘故生。彼复顺识相诸法。同念见识性。然彼忆持相分别相及法体相。是以此示现三种性相成。如说同念见者。彼知三相尔。云何复彼相解释分别相者。他性中无。成就性中有。彼二有无。有觉无觉有见无见。真实同时。彼他性中依非众生分别众生成就者。行彼觉故彼不觉。如说分别他性中成就。彼处有不觉及觉故。略说彼二边所说义解释。所谓先已说句余句示现彼分别。或<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>增上故。或义增故。功德增者。所谓说佛功德善觉慧。不二行无相法究竟佛行行故。得一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。到无障道。不退转法无障境界。不思住达三世遍一切世界身。一切法无疑。知一切成就慧无疑。诸法知无分别知。一切菩萨正受智。不二佛行得最究竟。不离如来。解脱智尽。至无边中佛地。通达法界最虚空界尽尔。善觉佛者。此句余句所解释应知。如是善说法体成。善觉慧者。此善觉慧诸佛如来十九种诸佛功德摄成应知。智中一向无障无分别功德。事非事二相真如最净说自然佛所作不休息行功德。法身中身心业无分别功德。一切障对治功德。降伏一切外道功德。世间生世间法不能染功德。法住功德。受记功德。一切世界中示现报身应身功德。决疑功德。种种行入功德。未来生法智功德随信示现功德。无量身化众生行功德。同法成波罗蜜功德。异佛世界随信示功德。三种佛身说法不断功德。乃至世间际一切众生助成一切乐及无量功德。因此说故。义增上者。复如经所说。菩萨成就三十二法故名为菩萨。助益乐深心故。于一切众生令入一切智智。称己智灭慢故。淳厚深心故。不作恩爱怨及非怨等心故。永亲故。尽至涅槃美言悦目先应故。不断彼心故。所许之事不休息不疲倦意故。闻义无厌足故。自过见患故。见他作过不说故。一切威仪行菩萨心业故。布施中不求报故一切有道处不着修戒故。不嗔一切众生忍故。聚集一切善根法以<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>故。离无色界禅故。顺方便智故。四摄法所摄方便故。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>持戒不二心故。勤劬闻妙法故。乐住阿兰若故。不乐世间种种事故。不希乐小乘故。于大乘见大利益故。远离恶知识故。亲近善知识故。净四梵行故。五<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>游戏故。依智故。住有行不住有行众生不舍故。一向定言故。重实语故。菩萨心为首故。如是等句初句中差别应知。助乐深心故。于一切众生此助乐深心故。有十六种作事差别应知。是中十六种作事者。转转行作。不退作。他所不劝而自行作。不嗔作。不望报作。三句不望报故。有益无益不嗔喜。乃至后生随逐故。彼相似口业故。有二句苦乐中不二等作事。不怯弱作事。不退转作事方便摄作事。除障作事。二句相续不断念彼心作事。胜至作事。七句六波罗蜜正修行。及摄取行正事。成就行作正事。六句亲近知识。听闻正法。乐兰若。舍恶觉心。<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>功德。二句大乘功德。二句成就作事。三句无量清净得益力得证功德。彼令住作事四。将众功德除疑。教受财法摄取心故。不杂心故。如是等句与初句解释差别应知。如经说。依于初句故句别有功德。依于初句故句别义别尔。如是智相释已</p><p>摄大乘论卷上</p><p>摄大乘论 卷下</p><p>阿僧伽作</p><p>后魏世佛陀扇多于洛阳译</p><p>入智相云何。多闻薰身故。非阿犁耶识所摄。如阿犁耶识种子成。寂静思惟所摄。诸法义现相所生可取事处有见者意言处。是中谁入智相。大乘所薰多闻相续身。无量诸亲近得故。信欲一向故。善集善根故善助功德。智行菩萨何处入还。彼现见法义现相意语处。因大乘法生故。信解地中见道行<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>行。及尽至一切法唯记尔。随顺闻信因故。如是彼分别证因故。一切障对治及离障故。从何处入。善根力持故。三种相心转明。种种庄处灭故。念法义定慧一切时正行。及不放逸故。诸世界无量众生类。无量念念中成阿耨多罗三藐三菩提。初转心者。随所心布施等波罗蜜助集行。彼心我已得。是故我不加用诸波罗蜜。修道能满成。第二转明者。诸禅法成就已。死后寻得随所须一切身事。得有障善根者。况我善修善根得无障善根。寻即一切诸势不成。第三转明者。是中有偈</p><p>人类得菩提于念念中间</p><p>众生无量故至时应舍行</p><p>随心所行施清净无垢心</p><p>彼得心止事勇健布施成</p><p>善者灭身已自势随所心</p><p>善者灭身已彼势云何不</p><p>舍声闻缘觉心灭念故。于大乘中一切有疑无疑故灭疑或。闻思诸法除我相我我所相执故。灭法慢者。前所住及安一切相。不念不分别故。及灭分别者。是中有偈</p><p>在前随所除相念自住处</p><p>智尽不分别得上菩提尔</p><p>以何云何入彼闻习业。寂静思惟所摄法义。现见意言四种求。名义性胜安。求等四种如实知故。名事性胜安性胜。如实知彼不觉见故。如是彼菩萨唯入记故顺修。彼名义现见意言。彼名意言唯正观。彼名所依义唯意言正观。然彼名性胜安唯观。于后唯意言不觉已有名彼义有性胜安有性胜义相不见已。此四种求及四种观。见知已彼名义现相意言中唯记入。彼记事中入已。为当唯入。彼有相见二事及种种事入。名义性胜义。六种相无义故。彼可取能取事现处故。不断种种相义。现相所生故。闇中如见绳谓蛇现相故。所谓如绳蛇不实。非众生故。如是觉义者非有。回蛇意唯住绳意。彼亦微思量色香味触相故。是中依慧绳慧亦回成。如是此诸六种相名现相。意言中如绳慧。六种相实义实处唯记慧。亦思量成就性慧故。如是此菩萨意言现相义相事入。分别性入。成唯主记入故。他性云何成就性入。回唯记想。彼者是诸意言。闻法习者。彼尔时分别义相。菩萨一切义现相生无有余成。是故唯记现相亦不生。是故一切义无分别事名住。已于法界如现见随住。尔时彼菩萨同等念已。生无分别念智。是故此菩萨名为入成就性。于中有偈</p><p>法众生法义同别有性义</p><p>不净净尽至分别名境界</p><p>如是此菩萨智及相唯记入故。名为入成。彼入已名为住<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地。善达法界。及生如来家。得一切众生平等心。得一切菩萨等心。是彼菩萨见道行。佛以何义故。入彼唯记处离法念。彼出世间定慧智。藉得种种相记智同相。一切阿梨耶识因种子灭故。法触种子增长已转身。一切佛法集故。入一切智智。藉彼所得智。一切阿犁耶识相处如幻等见故。性不颠倒行。是故彼菩萨如幻师所作。义处相同因果唯有说一切时不颠倒成。彼以记入中四种禅定所依。四种攒相法云何知。四种求故非不身无义无忍中得光明三昧。暖相依增忍中光明增长三昧。上依四种中如实观知入唯记中。以无义决定心。真实中入一切三昧依顺谛忍。自此后唯记相思量彼。是次第三昧。依世间上法见故。此诸三昧近入地应知。如是入地得见谛道。菩萨唯入记云何行修道。随所分别说十地。摄一切修多罗现事住故。以杂念出世间。及藉彼得定慧智故。无量百千亿习故。如是身转已。为得三种佛身。为得故修行。所有诸声闻证道法。及此诸菩萨此二有何差别。胜声闻证入中。菩萨证入有十。一种胜事应知。一者念胜。念大乘法故。二者淳至胜。大功德助集淳至故三者证胜。众生法无我证故。四者涅槃胜。摄取不住涅槃故。五者地胜。十地尽至故。六者净胜。烦恼习灭佛世界令清净故。七者一切众生同得记心胜。化众生行不断绝故。八者生胜。生如来家故。九者取生胜。佛世界会中一切时取生故。十者果胜。十力四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>十八不共佛法无量功德成就故。是中有偈</p><p>迭互作客事于事名所求</p><p>唯求彼诸事分别二所安</p><p>如实知见故离义分别三</p><p>见彼是非事彼无二所执</p><p>喻若顺分别复有教授偈</p><p>镜像意于后菩萨在诸定</p><p>回彼义想已忆持自想事</p><p>住心如是内知无所可取</p><p>于后无能取无分别知尔</p><p>更复有证道偈。所谓大綖<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>论中说</p><p>助集无边行功德智菩萨</p><p>法思善决定语言达义尽</p><p>彼知正义已说住彼定心</p><p>法界现意故是以离二相</p><p>离心无有余善知心亦无</p><p>知二既是无正住于法界</p><p>不分知力故同时常同行</p><p>彼身窟聚患如象灭诸毒</p><p>牟尼说善法善住意思量</p><p>根本法界处念至知意故</p><p>唯分别正取速得功德处</p><p>如是说入智相已。彼因果说云何知。六种波罗蜜故。谓布施持戒忍辱精进禅定<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>故。云何此诸六波罗蜜唯记入成。云何彼入果六波罗蜜成。是中菩萨于施不着。于戒不毁。于苦不嗔。于修不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。如是此诸乱因不行故。因不行故。一向已寂静思惟诸法。入唯记已依六波罗蜜。及入唯记故。菩萨净深心所摄故。得六波罗蜜。是以中间六波罗蜜行顺说信故。乐求<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>故。得利润离忍。菩萨自大乘中说甚深大。唯分别正觉得无分别智</p><p>欲信净心明本彼觉法流</p><p>十地近菩提不假自然得</p><p>有何义故唯说六波罗蜜。障对治差别安故。一切佛法集句处故。及随顺化一切众生故。不动相对治故。说檀波罗蜜及尸罗波罗蜜。不动相。谓世不着及家不着。动者。回相对治故说。谓羼提波罗蜜及毗离耶波罗蜜。回因相者。世间众生作恶行长受苦。及于修善行法中生疲倦。以发不回失相对治故。谓阇那波罗蜜及般若波罗蜜。失相者。乱心及无智。如是障对治数差别故。四波罗蜜不散相。一波罗蜜不散相成。以散依故。如实法正觉集诸佛法。如是集一切佛法。句处故数差别。以檀波罗蜜益众生。尸罗波罗蜜不作恶。能忍毗离耶波罗蜜作事尽至故。如是益相化众生。化以故调伏。于后不入定心为令入定心。已入定心为得解脱故。数劝故得解脱。如是化一切众生。句处故数差别。应知。然此诸波罗蜜相云何知。以六波罗蜜身最依菩萨心故。彼以最故。遍行不断增上意一切众生助乐故。方便善巧最故。所有无分别知摄取故。发愿最者。阿耨多罗三藐三菩提作愿故净最烦恼智障。修集无障故。所有布施彼亦名波罗蜜。所言波罗蜜。布施非波罗蜜。如是四句如布施中。如是诸余波罗蜜中皆有四句。如顺应知。此诸波罗蜜以此何义故有此渐次说。前波罗蜜后波罗蜜。随顺生故。彼复释。云何知一切世间声闻缘觉布施等。善根中增上到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>故。波罗蜜者。妒吝贫穷破除故。令得大势功德故。布施持戒灭恶道令得善道。三昧戒嗔恨灭除故。他者仿佯住忍。懈怠及诸恶不善法令远离故。增长无量善法出故精进破乱想。内心住将来故。禅定一切见无。智灭除真故。及相别故。知诸法故名智。云何此诸波罗蜜有修事可。知略有五种修事应知。习行因行修事。信欲修事。心正念修事。方便善巧修事。所作事忆持修事。是中四种事如前所作。忆持事修事者。所有诸佛自然作佛事。不断不休息。修诸波罗蜜令满满已。心念修喜乐随喜忆念等心。六种心所摄故。修广心不断心喜心作益心大心及真心。所有菩萨随所阿僧祇劫。得阿耨多罗三藐三菩提。如是等时念念中。舍一切自身及恒河沙等世界七宝。令满已施。诸佛如来乃至未坐道场。而菩萨行布施心无厌足。如是等时念念中三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>满中火时。现四种威仪。虽少一切资用而现作。持戒忍辱精进禅定智慧心。乃至坐道场。如是菩萨不厌修持戒忍辱精进禅定智慧等心。此是菩萨广心。所有彼菩萨此无厌足心。乃至坐道场不断及不舍。是名此身。若彼菩萨喜心故。彼六波罗蜜所作众生益。非彼众生以得此益故。此是菩萨喜心。若彼菩萨作益众生。于六波罗蜜作益摄取。见如己身自身见如众生。此是菩萨作益心。若彼菩萨彼如是六波罗蜜所集善根。回发愿令一切众生得爱果报。此是菩萨大心。若彼菩萨彼如是六波罗蜜修集善根。与一切众生同发愿向阿耨多罗三藐三菩提。此是菩萨真心。如是六种心所摄故。修乐喜心。若彼菩萨六种修心行行者。彼余无量诸菩萨彼善根令随喜。如是菩萨六心所摄随喜心令修。若彼菩萨一切众生六种心所摄。六波罗蜜修事希求如记。六心所摄。六波罗蜜修不离者。乃至坐道场。如是菩萨六种心所摄希求意行修。若此六种心所摄菩萨心修故。闻已发一好心。彼功德量等功德。及一切恶作障消灭。何况菩萨。云何此诸波罗蜜有差别。以三种相应知。法施财施及无畏施。止戒。摄善法戒。作众生益戒。作恶忍羼提忍苦羼提。法思惟忍苦羼提。勇猛精进。行精进。不怯弱不嗔恨喜精进行。现相作忆持。无分别方便行。无分别及有分别。及藉彼得智。云何此诸波罗蜜摄事。应知此诸波罗蜜摄一切善根。彼相彼随顺及彼因气故。云何此诸波罗蜜诸障。一切烦恼摄事知。彼相彼因及彼果。云何此诸波罗蜜有益事可知。世间行时势力所摄同生所摄。眷属所摄大作事行成吉所摄。不恼少尘所摄。一切工巧诸论咒术处细意所摄。增长是无恶。乃至坐道场。一众生现一切义作事。是名菩萨益。云何此诸波罗蜜迭共决定分别事知。或有处一切六波罗蜜布施声说。或有持戒声。或有忍辱声。或有精进声。或有禅定声。或有智慧声说。是中有何意趣。一切波罗蜜行中。彼一切同助至故。是意如是说入因相果已。云何彼修差别事知。谓十菩萨地。何等欢喜离垢明作焰难胜现前远行不动善慧及法云。云何此诸地十事差别。应知十种无明障对治故。如是十种相智中。及法界十种障住故。云何十种相智法界。一切处义故。初地中上义故。第二地中因上义故。第三地中无所取义故。第四地中身心无差别义故。第五地中无烦恼净义故。第六地中种种法无差别义故。第七地中无胜无劣义故。第八地中相自在身义故。及世界自在依义故。第九地中依智自在义故。第十地中依业自在义故。依陀罗尼三昧门自在义故。是中有偈</p><p>上义及因上义故不摄义及身相续</p><p>无烦恼染净义故</p><p>乃至不异义不胜无劣义</p><p>依第四自在法界中无明</p><p>二种及以十十地有障故</p><p>对治说诸地</p><p>然此无明诸声闻不杂。诸菩萨中杂。何故初地名为欢喜。彼初故自益他益。堪能成德义故。何故第二地名为离垢。破戒垢令远作故。何故第三地名为明。作不动三昧三摩拔提依故大法光依故。何故第四地名为焰。菩提分法烧一切障故。何故第五地名为难胜地。超菩提分故。由<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>智与世间智更互相违合此难合令相应故。何故第六地名为现前。因缘智依般若波罗蜜行现作故。何故第七地名为远行。有功用行尽至故。何故第八地名为不动。一切相不动故。何故第九地名为善慧。得上辩才智故。何故第十地名为法云。杂念一切法智一切陀罗尼三昧门藏故。如云如虚空。上烦恼障灭故。法身满故。云何此诸地得智。有四种相。得信地信地行得顺地。十种法行得故。<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>初地中证法界证一切地故。成就得此诸地修尽至故。云何此诸地修事知。此菩萨地地中修舍摩他毗婆舍那已。有五种相修。何等五种所谓杂修。无相修。无功用修转明修。转转修。如是此菩萨此五种修已得五种果。所谓除一切恶。身种种想离得乐法意。一切处无量不作畔在相。法光明现相。知净分别相。彼诸分别念同行。为满法身及成就故。上中上因作摄故。名以十地中十波罗蜜修事成。六中六随所说。有四方便波罗蜜。六波罗蜜所集善根。彼一切众生共故。发愿愿向阿耨多罗三藐三菩提。作愿故。愿波罗蜜者。未来种种愿现相故。波罗蜜缘牵将故。力波罗蜜者。能修力等六波罗蜜。不断同行故。智波罗蜜者。六波罗蜜差别智。法同受报化众生故。然此四波罗蜜。般若波罗蜜无分别智藉得智所摄。然复一切诸地。一切波罗蜜。非不修成波罗蜜藏所摄。此法门几时此诸地修事满成。有五种众生。三阿僧祇劫信行人。初阿僧祇净深心行无相行及有相行。有六地及七地。第二阿僧祇还彼不现相人。自此以上乃至十地。第三阿僧祇修道满足成。是中有偈</p><p>胜上力故坚心胜智菩萨三祇</p><p>发行尽至</p><p>如是说因果修差别已。是中云何增上戒胜事知。如菩萨地持中说。受菩萨戒品中略复有四种胜故。胜事应知。差别胜。同不同戒胜。上胜。及甚深胜。是中差别胜者。谓<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>摄善法戒。作众生益戒故。是中上戒者。二种戒住义故。知摄善法戒集佛法住义故。作众生益戒者。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生住义故。知声闻同戒。诸菩萨性重不同。行不同戒者。制重同行故。彼戒中随所声闻犯。于中菩萨不犯戒。随所菩萨犯戒。是中声闻不犯戒。菩萨防身口心戒。声闻唯防身口。是故菩萨起心犯戒。非诸声闻。略说所有一切众生恶。而有益身口意业。彼一切菩萨应行。及彼中学如是共不共胜。应知上胜复有四种。上故种种无量戒。上故摄取无量功德。上故一切众生助益乐心眷属。上故阿耨多罗三藐三菩提住。上故及得无量功德疾得阿耨多罗三藐三菩提。是中甚深。若菩萨如是方便善巧故。<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>等十种业修行。是以不恶。成得无量功德。速得阿耨多罗三藐三菩提。或应<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>业口业。是甚深戒应知。是以作国王治国。计种种示众生恼事。是以化众生安置善处。示种种生恼。余众生示余益。余者令心以发。发已先化。化已心回。此是菩萨戒甚深胜事。如是四种胜事。略说菩萨上戒胜事应知。如是分别。复有菩萨戒差别无量。亦如比尼响方广修多罗中。如是说增上戒胜已。增上心胜事复云何知。略有六种差别应知。念差别。种种差别。业作事差别。现气差别。业差别。念大乘法故。大乘光明一切功德积聚三昧。三昧王现护首楞严等三昧无量种种故。一切法杂念智显顺故。阿犁耶识一切障诸恶使令除故。禅定乐行已随所生故。处生故。一切世界无障神通现故。动放光遍视异事作。来往略广。一切色身入同行。往上下作自在隐蔽他。神现念与乐。放光现大神通故。摄一切苦行。现十种苦行故。十种苦者。所谓受许苦行。菩提愿许故。不退苦行。世间诸苦不退故。不背向苦行。一切众生恶行苦行中彼现现事故。现苦行。作恶众生中。作一切利益义现故。不染苦行。世间生以世间法不染故。信苦行。于大乘虽无解一切甚大事信故。证苦行。众生法无我证故。顺觉知苦行。诸如来甚深密语所说顺觉知故。不寂静不染苦行。不舍世间彼不染故。行苦行。住一切障解脱诸佛如来乃至世间众生际。自然作一切众生一切义行故可者。复顺觉知苦行。所有诸佛密语说若随彼所觉。所谓云何菩萨布施成。若使无所布施。而彼无量十方世界作布施成云何布施喜心成。若一切布施不喜乐。云何布施信成。若使诸如来信不去。云何布施与意成。若使自身令与布施。云何乐布施成。若使一切时无所布施。云何布施大事成。若于布施起不坚相。云何布施增长成。若使起妒心。云何布施尽意成。若使不住于尽法时。云何布施自在成。云何布施无量成若不住无尽故。如布施如是持戒等乃至般若波罗蜜随顺应知云何杀生成。若使众生世间害。云何偷盗成若使余者未与众生而自取之云何邪淫成若使淫邪而行。云何<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>成。若使如妄语作妄语说。云何绮语成。若使常以空门行而行。云何恶口成若使到智彼岸。云何两舌成若使善知诸法而能诠说云何贪成。若使常与无常禅定法令得故修行。云何嗔心成。若使一切烦恼心中取行。云何邪见成。若使一切处到一切事如实邪见经明甚深佛法。何等法而说甚深。是中有此说。常法佛法。依法身常故。断见法佛法。灭一切障故。生法佛法者。能生应身故。有觉法佛法者。八万四千众生行有对治故。有贪法佛法者。有贪众生取如己故。如是有嗔法佛法。有痴法佛法。见有凡夫法佛法。无染法佛法。真如成就已一切障不能染故。离染法佛法者。生世间而世间法不能染故。以是义故名为甚深佛法。修诸波罗蜜化众生。令佛国清净。现一切佛法故诸菩萨三昧作事差别应知。如是说增上胜心已。增上胜慧复云何知。无分别智中性处身处因处念处相处持处伴处报处因气处出处尽至处。藉彼无分别功用行。等处差别处藉无分别得处。余处持自然作事处甚深处意。无分别智增上慧胜知。是中离五种相。无分别性智故。意离念故。果离有觉有观地故。离想受灭定舍离色性故。真实处舍种种相故。彼无分别智离如是五种相。应知此如所说。无分别智性差别安立中。说偈</p><p>诸菩萨真实远离五种相</p><p>无分别智处真中种种名</p><p>诸菩萨身者善心正是心</p><p>无分别智中义心真实说</p><p>诸菩萨因者同言闻习故</p><p>无分别智中意行同思惟</p><p>诸菩萨念者诸法无诠事</p><p>无分别智中无我及真如</p><p>诸菩萨相者于彼正念处</p><p>无分别智中智处无诸相</p><p>随顺真实义分别无有异</p><p>迭共随顺故彼义顺和成</p><p>离智无言说说中有所行</p><p>以说相违故彼说无有言</p><p>诸菩萨持者彼智无分别</p><p>藉彼得彼行彼到增长处</p><p>诸菩萨伴者说为二种行</p><p>无分别智中五波罗蜜性</p><p>诸菩萨报者诸佛二界中</p><p>无分别智处以得顺行故</p><p>诸菩萨因者上上诸生处</p><p>无分别智中胜到故正说</p><p>诸菩萨出事为得顺义故</p><p>无分别智中解知诸十地</p><p>诸菩萨尽至因三净身得</p><p>无分别智中得上神通故</p><p>如空无有染彼智无分别</p><p>众恶种种上唯信欲为正</p><p>如空无所染彼智无分别</p><p>远离一切障得顺成就故</p><p>如空无有染彼智无分别</p><p>常行世间故而世法不染</p><p>哑义随顺故如哑所觉义</p><p>非如不哑用说为三种智</p><p>如痴所用受如痴所觉知</p><p>非如痴所用说为三种智</p><p>解通五种义如达五种事</p><p>如意识所知说为三种智</p><p>不通论修论如通法义解</p><p>如是渐次知知为行创首</p><p>如人蔽诸目彼智无分别</p><p>彼后得开目彼智藉所得</p><p>如空智亦尔彼智无分别</p><p>彼处色现相彼智藉所得</p><p>如珠伎乐等作事无分别</p><p>如是离住故诸佛业庄严</p><p>非彼及余处有智及无智</p><p>彼智无差别是智无分别</p><p>体性无分别明识一切法</p><p>众生中分别彼智无分别</p><p>是中无分别功用行有三种。因现相取生差别故。无分别智亦有三种。少欲知足不颠倒。无分别无谤故。藉彼得智亦有五种。证得忆念差别离成就时现分别故。释成无分别智义故。复说余偈</p><p>饿鬼畜生人诸天如罗汉</p><p>等同意差别得成诸尘义</p><p>过去如梦等无差亦有二</p><p>非有而作念彼念顺义故</p><p>义及成就义彼智无分别</p><p>彼无即无佛得事即不成</p><p>菩萨得神通彼以信力故</p><p>地等如是无随善者觉见</p><p page margintb15></p></div>"
}]