[
    {
        "title": "佛法八大次第",
        "html": "<div class=\"B1_text\">&#13;佛法八大次第<ignore_js_op><div class=\"tip tip_4 aimg_tip\" id=\"aimg_100783_menu\" style=\"position: absolute; display: none\" disautofocus=\"true\"><div class=\"xs0\"><p><strong>mmexport1548798980514.jpg</strong><em class=\"xg1\">(39.22 KB, 下载次数: 19)</em></p><p><a href=\"http://www.fahua123.com/forum.php?mod=attachment&amp;aid=MTAwNzgzfDk4MzM3OTM5fDE2MTczNzcxMDl8MHwxNTM1OTY%3D&amp;nothumb=yes\" target=\"_blank\">下载附件</a>&#13;&#13; <a href=\"javascript:;\" onclick=\"showWindow(this.id, this.getAttribute('url'), 'get', 0);\" id=\"savephoto_100783\" url=\"home.php?mod=spacecp&amp;ac=album&amp;op=saveforumphoto&amp;aid=100783&amp;handlekey=savephoto_100783\">保存到相册</a></p><p class=\"xg1 y\">2019-3-31 12:57 上传</p></div><div class=\"tip_horn\"></div></div></ignore_js_op>人、天、声闻、缘觉、藏教、通教、别教，圆教。&#13;第一个次第叫「人」，受持三皈五戒，即能得人身。&#13;第二个次第叫「天」，在三皈五戒基础之上，还要修十善业，可以升天道，但限于欲界天以下。如果在色界天以上，还要加四禅八定。但是，即使修到第二十八层天——非想非非想处天，仍然是凡夫外道。&#13;由于邪见横行，导致大部分修行人认为受持三皈五戒、念念佛、拜拜佛……就能往生，这是打妄想。这一部分人来讲呢，你劝他听闻《法华经》，「不行啊！来不及啦！只有一句佛号可以成就！」付诸行动来讲，仍然是懈懈怠怠。还有一小部分人呢自以为会修行，自以为勇猛精进，自以为有智慧……他们修所谓的天道和禅定，很容易开天眼、天耳、宿命通、他心通乃至神足通，并以此执著而拒绝正法。在《楞严经》讲到了「观世音菩萨耳根圆通法门」，观世音菩萨明明是从「闻思修」入，「闻」就是反闻自性，见道继而修证，所以文殊菩萨把它判为第一之法。可是外道呢，「闻」什么？闻海潮音、看天光，心外求法。&#13;第三个次第叫「声闻」，代表作是《阿含经》。以苦、集、灭、道四圣谛为指导思想，修得很苦很苦，可以证到阿罗汉。仅仅从三果罗汉到四果就要修二十万大劫。一个大劫少说几十亿年，多说百亿、千亿年。&#13;第四个次第叫「缘觉」，修十二因缘而证果，高于声闻。声闻从苦、集、灭、道的「苦」开始修起，明白什么是苦。缘觉从「因」起修，研究六道轮回之因。那么根机特别利的缘觉人，在没有佛法的时代，根据自己过去世中的善根，凭宿命通与前世联系起来也能成就，果位是辟支佛。阿罗汉、辟支佛都能了脱六道轮回，但是不能「明心见性」，他只能证到人我空；而法执全在，尘沙烦恼未破。二者被称为佛门内部的外道，仍然是外道。那么进入大乘法呢，分「了义」大乘和「不了义」大乘。「了义」大乘叫「实法」，「不了义」大乘称为「权法」。那权法大乘涉及到「藏、通、别」这三个层次。&#13;那么第五个次第就是「藏教」。它从「有」门而入，相似于修「人道」，执著在事相上来行持。虽不通理，但心量大，发方便菩提心愿意帮助一切众生成佛。由于心量大，也能超越六道轮回，但不能见空性。所以藏教既是小乘法又是大乘法——讲是大乘法因为它心量大，讲是小乘法因为它不能明心见性。代表作有《地藏经》《阿弥陀经》《无量寿经》等等。&#13;第六个次第是通教，也叫禅宗。它从「空门」而入，代表作有《金刚经》《六祖坛经》《六百部般若》，强调破一切相见空性，连诸佛三十二相、八十种随形好统统判为无明。《金刚经》云：若以色见我，以音声求我，是人行邪道，不能见如来。那么这种法门修得非常非常认真，非常非常准确，能够破除一分灭相无明证得空性，叫「摩诃萨」。但是，禅宗五祖弘忍大师在《最上乘论》中讲：「恒河沙数的人难有一个人成就」。&#13;第七个次第是别教。从「亦空亦有」两门而入，代表作是《大方广佛华严经》。它既要见空性，然后从空出有，大作佛事。在某种程度上，它圆融了通教、藏教、小乘、人道、天道。所以《华严经》有无量法门，修得好可以破除十二分无明。而且，这个法门比通教更难成就。往往接触了《华严经》，你心易乱。你要把它读一遍的话，都不知道要读多长时间。&#13;这以上就是对人、天、声、缘、藏、通、别这圆人前七种方便简单概括了一下。也就是佛陀前41年所讲之法，把它说为「戏论法」，也是「结缘法」。&#13;而只有第八次第的「圆教」才能让人当下解脱，才是「成就法」，它的代表作有《妙法莲华经》《大佛顶首楞严经》《心经》等。它是从「非空非有」二门而入，但是这个「非空非有」是「对有说空，对空说有」。它把八大次第圆融为一体，叫「一心三藏」；而别教是讲「次第三藏」。别教还要修三大阿僧祇劫，三大阿僧祇劫啊！阿僧祇在印度里是一百多位的大数：一劫是百万亿年，你算算看多少。可是到了圆教，不可思议啊！哪是三大阿僧祇劫？三世要不了，三年要不了，三天要不了，三个小时也要不了……你当下一念就能成就！一步登天！佛在《法华经》《楞严经》少说十几处，多说几十处都在提醒我们，当下就解脱！&#13;我再告诉大家一个奥秘：当明白了正法，那前七种方便统统都是正法！妙不妙？乃至歪门邪道统统是正法！乃至刮风下雨、山河大地、风云雨雾、泥巴瓦块、树木花草统统都是正法！没有哪一法不正，没有哪一法不是佛，没有哪一法不是我！耳闻目睹身受……你能感觉到的一切，还有感觉不到的那一切的一切，都是我，都是一个念！尽虚空遍法界，十方三世，只有一尊佛，只有一个念，而且当下就是这一个念！这个法妙啊！&#13;所以我们在《法华经》的研讨过程中——万变不离其宗，就是讲这个道理。只要当下明白万法都是由我一念所现，刻骨铭心，深信不疑，而且你知道它怎样变出来的，你当下就解脱无疑！<div>"
    }
]