[
    {
        "title": "《佛法真与假》 ------ 探讨中国特色佛教.之一 印广法师",
        "author": null,
        "date": null,
        "html": "<div class=\"B1_text\"><div><p><strong><p><p>《佛法真与假》 </p></p></strong></p></div><p><strong><p></p></strong></p><p><strong><p>------  探讨中国特色佛教.之一</p></strong></p><p><p><strong>      真者真实，相通于马列主义、毛泽东思想。它从哲学高度、科学层面揭示宇宙人生真理。其代表作为《法华经》、《楞严经》、《心经》所诠一心三藏之理,可简说为实教。唯以一实相印印证万法、否定万法而又同时圆融万法,故又称为圆教——能令行人当下明心见性，了生脱死!故又说为了义法，究竟法。</strong></p></p><p><p><strong>      假者方便，借假之义、因缘之法，而非世间不实之说。相通于儒学、道教等世间善法。它从伦理、道德、文化角度引导人们向善向美。其代表作为《华严经》、《金刚经》、《地藏经》、《唯识》、《坛经》以及净、禅、密、咒等无量经典无量法门，可说为权教——能令行人得人天福报，但极难了生死，不能成佛道;结下法缘、佛缘而己。故又说为方便法，结缘法、不了义法。</strong></p></p><p><p><strong>      权教之法，说满古今，教盖天下，且已日臻完满，几无笔者下口之处;纵有所言，亦是拾人牙慧、鹦鹉学舌。而实教之法却少有宣教，纵有言讲碍于时空之异，文辞艰涩，而鲜为人解。</strong></p></p><p><p><strong>      今逢科学盛世，文明空前。佛教文化几成百花齐放，千家争鸣之势。笔者心有所悟而又不敢贸然自肯，故试以俗事人情而参谈玄说秘之机，粗言卑语而探“捕风捉影”之教。直将千古天书牵强附会于大庭广众，万世秘藏呼呵勾勒于衣食劳缀。所谓依葫芦画瓢，按图像索骥也!说是描龙绣凤也好，道是牵强附会也罢，但能抛砖引玉，兴教正法，强我中华，共和世界也算是对如来家业一个交待，还天地万法一个公道!</strong></p></p><p><p><strong>      虽说恒沙佛典，千差万别;满天法门，各宗其宗。而“阿弥陀佛”万德洪名，却又谁人不晓哪个不知;“如是我闻”开山首炮，更是千经所崇，万论共尊!然其真义，要么被说得俗不可耐;要么被玄成云里雾外。令诸行人，瞎子摸象，莫衷一是!</strong></p></p><p><p><strong>      其实而言，大道至简，真理至易!佛法乃心法，乃生活中法。非宗教，非信仰，非文化，更非迷信，无非一个“真”字!</strong></p></p><p><p><strong>      此以理对。先将二法，互为解释。如者阿也。是者弥也。我者陀也。闻者觉义，佛也。如是我闻，当下阿弥陀佛也!</strong></p></p><p><p><strong>      进以三身，圆融一体。如者阿者法身也。是者弥者报身也。我者陀者化身也。闻者佛者觉也。觉到什么?觉到阿弥陀真实义。觉到如是我真实义。觉即是佛，佛即是觉。</strong></p></p><p><p><strong>      今以事况。此口头禅，寓之于人。开口讲话，讲者能也，话者所也，能所皆由，识所变也。能所识三，未形之前，天然于心。虽具于心，无一形相。虽无一相，其性本具!是故当知，能所陀也，我也。识者弥也，是也。心者阿也，如也。耳闻目睹、鼻嗅身受，亦复如是。鸡飞狗跳、蚊吟蚁啃，又何差异?</strong></p></p><p><p><strong>      进寓于物，地水火风，万物由心。读者不妨自心检验。意念左(右)手，放松令长，数分钟后，长于右(左)手，少则一分，多则数分。此小肉点，名为地大。未长之前，身心本具。若不具者，无孰能有?身心虽具，却无形相。若有形相，岂不癌肿?虽无形相，其性本具。诸如结石，无非当人，妄想所至。《楞严》说为坚固妄想而有地大。</strong></p></p><p><p><strong>      急出大汗，汗者水也。未水之前，身心本具。若不具者，无孰能有?身心虽具，却无形相。若有形相，岂不水肿?虽无形相，其心本具。诸如口水，无非当人，妄想所至。《楞严》说为润湿妄想而有水大。</strong></p></p><p><p><strong>      怒火上冲，面红耳赤。未火之前，身心本具。若不具者，无孰能有?身心虽具，却无形相。若有形相，岂不灼痛?虽无形相，其性本具。诸如烦燥，无非当人，妄想所至。《楞严》说为暖触妄想而有火大。</strong></p></p><p><p><strong>      地水火三，皆由识变，再由心现。变现则动，动则为风。未风之前，身心本具。若不具者，无孰能有?身心虽具，却无形相。若有形相，岂不失控?虽无形相，其性本具。诸如疯癫，无非当人，妄想所至。《楞严》说为动摇妄想而有风大。</strong></p></p><p><p><strong>      当知，此地(石)水(汗)火(燥)风(动)，蕴含无量元素，无非陀义我义。</strong></p></p><p><p><strong>      当知陀者我者，依于弥者是者(识者)所变，陀者我者弥者是者依于阿者如者(心者)所现。</strong></p></p><p><p><strong>      正论天地万法，上自诸佛菩萨，下至天人鬼畜，旁及山河大地、日月星辰、树木花草、风云雨雾，乃及红黄黑白、大小多少、是非长短、香甜苦乐酸臭，此十方三世，百界千类，无非识变心现。 所谓唯识(妄心)所变，唯心(真心)所现也。</strong></p></p><p><p><strong>      识者妄心也。亦谓弥也是也，一味飞思旋念，成智慧妙用。</strong></p></p><p><p><strong>      心者真心也。亦谓阿也如也，虽无任何形相，却为性具本体。</strong></p></p><p><p><strong>      变者现者相也。亦谓陀也我也，盘根错节万法，圆满花花世界。</strong></p></p><p><p><strong>      既云为变，岂可执一?故天地万法，各是其分而不可乱伦。所谓佛法不坏世间法，无分别不妨分别也。</strong></p></p><p><p><strong>      既云为现，岂可不一?故森罗万象，经纬纵横而无非一心。所谓世间法不坏佛法，分别不妨无分别也。</strong></p></p><p><p><strong>复论真心无相。则天心人心、牛心马心、草木风雨、情无情心、无量之心，当共一心!</strong></p></p><p><p><strong>    复论心现识变。则一心所现，无量之法，不二之法!此即是此，彼即是彼，此不异彼，彼不异此，此即是彼，彼即是此。比同数学，等量代换。所谓如来藏为总，万法为别，互为总别，互别为别，事事无碍也。如人在梦，梦境万千。岂关他人?何涉别事?实系梦人一心变现!诸佛如来，良苦用心，无非开导梦中之人当下醒来!正论佛法，万法为一心所现，一心为万法所现。此法为彼法所现，法法为法法所现。真真如性，非空非有、非生非死、非一非多……而随缘现空现有、现生现死、现一现多、……故即空即有、即生即死、即一即多、情即无情……是为不二法门。所谓性相一如、理事无碍、一多圆融者也。</strong></p></p><p><p><strong>    或问：前世来世，凭何而信?&#13;    答：今先一问：行者当处，能否想起，家宅住所?答当肯定。肉身能否，即住家宅?答当否定。当知心识，与之肉身，相对独立。心识穿越，空间束缚，肉身不能。如是当知，肉身终归消亡而灵心不灭。</strong></p></p><p><p><strong>    今又二问：行者当下，过往之事，能想起否?&#13;    答当肯定。肉身能否，重临旧境?答当否定。当知心识，与之肉身，相对独立。心识穿越，时间束缚，肉身不能。如是当知，肉身消亡而灵心不灭。</strong></p></p><p><p><strong>    再又三问:世上有俗话，人老心不老。&#13;    汝可试问七老八十之人，虽老态龙钟之身，而其童心不差以往!当知心识，与之肉身，相对独立。人老心不老，人死心岂死?如是当知，肉身消亡而灵心不灭。</strong></p></p><p><p><strong>    或问：地水火风，无情之物，怎就视同，动物有情?&#13;    答：已知此四，识变心现，即言变现，即心即法，情即无情。又观科学动物克隆，猴血造猴。血者无情，猴者有情。果真无情，岂能造猴?再见人死，四肢僵硬，面目痛苦，念佛超度，四肢回软，面带微笑。死人同于泥巴瓦块，果真无情，岂能微笑?</strong></p></p><p><p><strong>    或问：地水火风，四大本同。为何所造，千差万别?答：食品加工，米面糖油，原料相同，配比各异，味岂一同?思想言语，行为造作，质量数量各不相同。真善美业，人天福报;伪恶丑业，恶报苦报。</strong></p></p><p><p><strong>    或问：众生到底怎个生成?&#13;    答：《楞严》说为，色杂妄想而有众生。亦说色心连持一体，而有生命。识心妄想，原一精明，本具诸德。揽搅四大，地水火风相互作用，和合命体。无情升级而有知觉，一精降级分为六根。一精原本具六功用，降级以后，眼不能嗅，耳不能看，鼻不能吃，舌不能想，身不能听，意不能触。故有众生轮回之苦。诸佛如来，说为命浊。</strong></p></p><p><p><strong>    或问：佛为何意?&#13;    答：佛为觉义。当年世尊开示弟子宇宙人生本来面目，弟子感慨，师父真佛!印度语言，佛为觉义。今之世人，妄解佛义，奉为神明，实为佛门，迷惑悲哀!佛法真义，与共产党圆通一体，皆无神论。佛母生佛，七天病亡，佛不能救!琉璃大王，灭佛故土，佛不能救!故佛声明，佛不度人，唯人自度!如国际歌，从来不靠神仙皇帝，亦无所谓救世之主!自由解放，全靠自己!行人迷信，求神拜佛，致令世间轻我佛门，非佛之过，实乃门中迷徒之咎!</strong></p></p><p><p><strong>    或问：佛法与哲学如何贯通?&#13;    答：哲学对立统一，精神变物质，物质变精神。通于佛法因缘法则，法生心生，心生法生。</strong></p></p><p><p><strong>哲学质量互变，通于佛法随心应量——随众生心，应所知量。众生心有质之真善美与伪丑恶之别，量有大小多少之分，而随心应量之报恰如其分。所谓种豆得豆，种瓜得瓜，多种多得，少种少获，因缘果报，丝毫不爽。《阿弥陀经》说为青色青光，黄色黄光，赤色赤光，白色白光。</strong></p></p><p><p><strong>    哲学否定之否定，通于一心三藏圆顿大教。原始哲学认定，天地万法无非一个否定之否定。谷子发芽，根茎叶花，一次否定;又结新谷，二次否定。类推万法，重迭流变。马恩依此创立原理。原始公有，后而私有，一次否定;再而共产，二次否定。佛法真义，真心迷惑，为如来藏，一次否定;闻而出藏，成就如来，二次否定。世间万法，无不次第，螺旋否定。是故，恩格斯在《世间论》说：“辩证法最初来源于佛教”。又说“只有古希腊人与东方佛教徒处在理性思维的高级阶段”。</strong></p></p><p><p><strong>    或问：佛法与科学如何贯通?&#13;    答：科学以哲学理论为指导，通过实践而认定。佛法亦同!佛讲一切法，皆可修行，皆可证得果位。贪、嗔、痴、慢、疑、杀、盗、淫、妄等种种恶法、邪法易解易行易证。是故三恶道中“人”满为患。</strong></p></p><p><p><strong>念佛、拜佛、坐禅、持咒、布施、持戒、忍辱、精进等种种善法、权法易解易行难证。是故天仙人众寥寥无几。</strong></p></p><p><p><strong>    《法华》《楞严》、入门真法、实法难解难信易证。佛在世时，尚有惊疑，况与后世!传者宣者玄奥难测，听者读者纠结难解。而果真讲得清楚明白，确又易行易证。是故圆顿大教，心地法门，不立阶梯，无修无证，悟即解脱，成佛分真。悟后进修，成佛圆满。</strong></p></p><p><p><strong>    佛法修证贯通于哲学理论和科学实践，有别于哲学理论和科学实验，超越于哲学理论和科学实验。</strong></p></p><p><p><strong>    从心识角度而言，现代哲学和科学尚局限于眼、耳、鼻、舌、身、意六种意识。而佛法反观到末那、赖耶、白净等三种微细心识(笔者将另文解释)。</strong></p></p><p><p><strong>    从物质角度而言，现代哲学和科学尚局限于长、宽、高三维世界、实尘之法，尖端科学虽已涉足量子世界、动物克隆、弦理论、非物质次原子论等科研成果，但仍处在扑朔迷离状态，知其然不知其所以然，乃至列为边缘科学。而佛法普遍多维空间、无量法界。皆可现量亲证!诸佛如来已证!诸修行人分证、将证、比量而知而证!</strong></p></p><p><p><strong>不过，佛法之修证大多不能像科学实践那样明目张胆，和盘托出。佛法大海，唯智能入，唯证乃知。如人饮水，冷暖自知。亦如梦中人事，纵令精明善巧，何能令之显现于前。</strong></p></p><p><p><strong>    我们应该感恩现代科学动物克隆，证实了佛说无情即有情以及无量分身(化身)的真理!天文望远镜证实了佛说大千世界的真理!细菌研究也证实了佛之无量法界的真理!随着科学的发展，会越来越确证佛法的真理性!</strong></p></p><p><p><strong>    毛主席说，马克思主义并没有结束真理，而是在实践的过程中不断地开辟认识真理的道路!我们应纠正千百年来对佛法的误解、迷信和轻慢。面对客观，辩证思维，实践验收。将其精华部分从宗教、信仰、文化、伦理道德中分离出来，别树一帜!结合于哲学、科学并圆融于政治、经济、文化、非文化等一切领域!响应习主席号召，成就中国特色的佛教!从根本上提升国民素质!兴我中华!造福世界!</strong></p></p><p><p></p></p><div><p><p><strong>&#13;         释印广</strong></p></p></div><div><p><p><strong>写于二0一三年十一月十二</strong></p></p></div><p><p><strong>此文已有中央文献出版社出版，见《求是先锋》第四三七页</strong></p></p></div>"
    }
]