[  
  {
    "title": "开经偈释义（流通版）",
    "html": "<div class=\"B1_text\"><div class=\"text-center\"><strong>开经偈释义</strong></div><div class=\"text-center\">——印广门清法师主讲</div><div class=\"text-center\"><strong>无上甚深微妙法 百千万劫难遭遇</strong></div><div class=\"text-center\"><strong>我今见闻得受持 愿解如来真实义</strong></div><strong></strong><strong>【无上甚深微妙法】</strong>。[无上]就是讲我们的真心本来面目，是一个本体，十法界一切万法，就是一个念，心外无法，法外无心，无上亦无下，无外亦无内，更无前后左右，没有空，没有有，什么都不能执着，什么都是。[甚深]表彻法源底，到底了，也就是讲一心三藏这个道理，叫人几句话当下开悟，从总体上、从根本上把握了宇宙人生的真理。[微妙法]就是妙在一朵妙莲华，莲华二字说尽了宇宙人生本来面目，微就微在粗心大意的人他看不懂，一定要小心翼翼，你才能体会出其中的法味，这叫微，大法唯智能入，唯智乃知。<strong>【百千万劫难遭遇】</strong>。佛在《妙法莲华经》讲了，无量国土之无量众生在无量百千万亿亿亿亿亿年中，想听法华之名都不可得；佛还讲，能够受持《法华经》的人，在过去十万亿佛法中积累了善根福德。你看灵山会上开讲《法华经》，还有五千人退席啊。<strong>【我今见闻得受持】</strong>。[我今]就是抓住当下这一念。[见闻]是即见即闻，闻必有慧，明白这个道理。[得受持]，是成就了我的法华三昧，成就了首楞严大定，[得]就是成就，[受]就是认可，这个[持]与定力是一个概念，时时事事处处，念念在道，这是不是三昧啊？这叫持。<strong>【愿解如来真实义】</strong>。这个愿很好玩，繁体字写法中（願），左边一个原，右边一个頁，原是不是表本?左边是不是表根本啊？右边是不是表方便?原页，原页，我们现在看到的这个经，已经不是原来的页，是不是?通过我们现在经书的这页，我们智慧能不能看到原来的页啊？这就是表明心见性。简体字的愿呢，还是一个意思，以我现在妄想心见到我原来的真心。所以[愿解]是什么意思？愿解就是[如来真实义]。[解]就是开智慧。怎么叫如来啊？妄想心见到了真心，是不是[来]见到了[如]啊，原来的心是不是[如]啊？我现在这个心是不是[来]？[如来]这个真实义明白了吗？啊，原来如此啊，法尔如是啊，我就是如来啊，这个茶杯盖就是如来啊，你也是如来啊，大家都是一个如，所有的来都是一个如，是一个如变出来的，要成佛，要了生死就是这么简单，你懂得了如来，你就是如来啊。<div class=\"text-center\">愿以此功德，普及于一切。</div><div class=\"text-center\">我等与众生，皆共成佛道。</div><div>"
  },
  {
    "title": "炉香赞释义（流通版）",
    "html": "<div class=\"B1_text\"><div class=\"text-center\"><div class=\"text-center\"><div class=\"text-center\"><strong>炉香赞释义</strong></div></div><div class=\"text-center\"><div class=\"text-center\">——印广门清法师主讲</div></div><div class=\"text-center\"></div><div class=\"text-center\"><div class=\"text-center\"><strong>炉香乍熱 法界蒙熏 楞严海会悉遥闻</strong></div></div><div class=\"text-center\"><div class=\"text-center\"><strong>随处结祥云 诚意方殷 诸佛现金身</strong></div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【炉香乍熱】</strong>，我们讲《楞严经》《法华经》，是不是在燃烦恼香？冒出香气是不是表大家解决了迷惑颠倒，开了智慧？我们这个肉团、我们整个心，是不是香炉啊？这个炉香就是戒定真香，这叫[炉香乍熱]。</div></div><div class=\"text-center\"><div class=\"text-indent\">佛曾以烧香打比喻，善知识讲经说法，听众明白一个道理，就像烧掉一段香，当整支香烧完了，表你的烦恼习气没有了，你这个肉团身也解脱了。</div></div><div class=\"text-center\"><div class=\"text-indent\">烧香被达摩祖师判为邪法，这是杀生，在佛法里，凡是有火的地方都是杀生，是造业。这个法门是印度婆罗门外道，供养天神的一种宗教仪式。当然，我们现在只能将错就错，也以这种办法，让众生与佛结个法缘，最起码是一念善心啊，可是我们要明白烧香的真正意义是什么。</div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【法界蒙熏】</strong>，这个香不得了啊，一瞬即熏，整个虚空法界无处不遍。[法界]是无量法界，天人鬼畜，泥巴瓦块，一切的法界都在[蒙熏]，[蒙熏]就是受到吉祥的加持，就是佛在《妙法莲华经》第十七品讲的，一念信解如来藏，胜过修布施、忍辱、精进、禅定、持戒等无量法门无量百千万亿年的功德的无量倍。</div></div><div class=\"text-center\"><div class=\"text-indent\">佛还讲，赞叹一句《法华经》，即为供养一切佛，受持一句《法华经》，生一念欢喜心，便蒙佛授记，受持一句《法华经》，胜过七宝满虚空供养无量佛，这是不是都在讲[法界蒙熏]啊？我们一念明心见性就可以供养十法界一切万法，这是佛的金口玉言啊。果真明白万法都是一人一念之所变现，你就是供养一切的万法，是不是[法界蒙熏]啊？</div></div><div class=\"text-center\"><div class=\"text-indent\">你现在想到扬州汽车站，扬州汽车站就蒙熏，你现在想到北京天安门，北京天安门就在蒙熏，你现在想到哪个哪个人，以智慧心、慈悲心想他，他是不是得到蒙熏啊？这是真的。</div></div><div class=\"text-center\"><div class=\"text-indent\">对于诸佛菩萨和天人鬼神，你做梦怎么想他都知道，因为他们有他心通，明白吗？即使没有他心通，他身体能不能感受到啊？都能感受到，所以我们就要明白，一念明心见性，一念开智慧，你多大的功德啊！虽然我们这种比较粗糙的六种意识心感受不到，但你的真实功德诸佛菩萨铭记不忘，他也没有办法忘。它已铭记在虚空世界，这就是我们当下给自己造未来的那个涅槃城。</div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【诸佛海会悉遥闻】</strong>，楞严海会是不是诸佛海会啊，有没有哪一个不是哪一个？都是佛。[悉]就是全部，[遥]是无边无际，没有谁闻不到，这里[闻]表示感受，包括泥巴瓦块。</div></div><div class=\"text-center\"><div class=\"text-indent\">我们在这讲法，泥巴瓦块都得到加持，在将来出现月食、日食的时候，光芒集中力量在某一个时空点，是平时力量的无量百千万亿亿倍，此时的泥巴瓦块、树木花草，比如过去听过《法华经》《楞严经》，有过法缘，这个时候摇身一变，变成天仙鬼怪有情，到了有情，何愁不成佛啊？他总有机会听闻佛法，所以[楞严海会悉遥闻]没有一个不闻的，你就知道我们讲一心三藏是何等的重要！因为我们把一心三藏无量的万法，真实的放在心里。佛在《妙法莲华经·见宝塔品》讲，能够受持一句《法华经》的人，比太空级的大法师讲无量的经典而成就无量的人变成无量的阿罗汉的功德还要大。</div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【随处结祥云】</strong>，解释为当下、身边、周围、方方面面，时时事事处处，念念在道啊，没有何时、何处不是我们成就的道场，皇宫宝殿、垃圾废堆都是吉祥气氛，只看当人怎样用心。[结祥云]就是要成就一种吉祥安和的气氛。我们走到哪里都是播种机，都要把佛法宣传到哪里，到处打成一片，以慈悲心，包容心，来恒顺一切环境，恒顺一切众生。</div></div><div class=\"text-center\"><div class=\"text-indent\">一个真正明白道理的人，他在任何时候、任何地方、任何事情上，他没有任何理由生任何烦恼，他只有快乐、自在、祥和、包容，走到哪里都要有亲和力，都要给人以智慧感、安全感、平和感，你才叫菩萨，这才叫随处结祥云，你不要随处制造矛盾、制造纠纷。</div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【诚意方殷】</strong>，就是[即已食时]，就是[华开莲现]，[诚意]就是明心见性，[方殷]是刚刚开了智慧，[方]是表正，[殷]是表吉祥，表富贵，表诚实，明心见性的人，才真正叫诚意，否则都是虚情，都是假意。</div></div><div class=\"text-center\"><div class=\"text-indent\"><strong>【诸佛现全身】</strong>，有的讲[诸佛现金身]，全就是金，金就是全，这都是表真实，真就是表圆满，你一旦明心见性，过去现在未来，东南西北上下十方一切万法，没有哪一法不是佛，这叫诸佛全身，诸佛就是金身，诸佛就是全身，心外无法，法外无心，一心三藏就是诸佛现全身。</div></div><div class=\"text-center\"><div class=\"text-indent\">《阿弥陀经》讲的妙啊，[诸佛现在其前]，没有讲诸佛来到其前，[现在其前]是不动而至，当下都是佛，如果[来到其前]，可能就是一尊佛跑过来了，所以我们最感恩《阿弥陀经》这个[现]字，不是来到其前。可是我们现在修念佛法门，是不是修一个阿弥陀佛来到其前啊，都是等阿弥陀佛来接啊，你等吧，你等到胡子白也等不到。</div></div><div class=\"text-center\"><div class=\"text-indent\">你自己就是阿弥陀佛，你等谁来接你啊？你不是在做梦啊，是你自己的念变现为国土，变现为佛，所以《金刚经》讲，[若人以色见我，以音声求我，是人行邪道，不能见如来]。你以色相去见阿弥陀佛，以音声去求阿弥陀佛，你是行邪法，谁见你啊？这个《炉香赞》是不是讲了一部《楞严经》啊？是不是讲了一部《法华经》啊？ </div></div></div><div>"
  },
  {
    "title": "180字偈颂",
    "html": "<div class=\"B1_text\"><div class=\"text-center\"><strong>180</strong><strong>字偈颂——印广门清法师主讲</strong></div><div class=\"text-indent\"></div><div class=\"text-indent\">下面这段偈颂无比重要，这是对前面四卷高度的概括和总结。佛的良苦用心就体现在这里，就在这段偈颂里点明、提示。大家务必要认真体会，拿出百分之百的细心。</div><div class=\"text-indent\"></div><div class=\"text-indent\"><strong>真性有为空，缘生故如幻；无为无起灭，不实如空华。</strong></div><div class=\"text-indent\"><strong>言妄显诸真，妄真同二妄；犹非真非真，云何见所见？</strong></div><div class=\"text-indent\"><strong>中间无实性，是故若交芦。结解同所因，圣凡无二路。</strong></div><div class=\"text-indent\"><strong>汝观交中性，空有二俱非。迷晦即无明，发明便解脱。</strong></div><div class=\"text-indent\"><strong>解结因次第，六解一亦亡；根选择圆通，入流成正觉。</strong></div><div class=\"text-indent\"><strong>陀那微细识，习气成暴流；真非真恐迷，我常不开演。</strong></div><div class=\"text-indent\"><strong>自心取自心，非幻成幻法；不取无非幻，非幻尚不生，</strong></div><div class=\"text-indent\"><strong>幻法云何立？是名妙莲华，金刚王宝觉，如幻三摩提，</strong></div><div class=\"text-indent\"><strong>弹指超无学。此阿毗达磨，十方薄伽梵，一路涅槃门。</strong></div><div class=\"text-indent\"><strong>真性有为空：</strong>有为就是不空如来藏，十法界有形有相的万法都要空掉。那个「真性」是把有为法空掉以后，证得人我空和法我空，再把这个「真性」也空掉。所以下面这个「空」等于是三空真如。怎么三空真如呢？把这个真性空、有为空都空掉，也就是圆教的双非法门。</div><div class=\"text-indent\">三空真如有两种理解法：第一呢，把人我空和法我空这两个空给空掉了，是不是第三个空啊？再把空掉前两个空的这第三个空也空掉。第二呢，空掉一个有为法，空掉人我空，再空掉法我空，这是三空真如。也就是「真性有为空」这个「真性」，就是从《大方广佛华严经》到《金刚经》所见的那个空性都要把它空掉，这两部经典是不了义大乘、权教大乘，所以这个空都空掉以后呢，这叫真真如性，这才叫了义法，这就叫一心三藏。把有为法空掉了就见到空性，把空性再空掉，从空出有，又见妙有自性，所以叫一心三藏。</div><div class=\"text-indent\">越是真理越简单。假传万卷书，真传一句话。就是「如是我闻」，如是我，我是如，我如是。所以如是我闻，如也是是，是不是就把如空掉了？是就是如，是不是把是也空掉了？空掉了如的当下是不是是啊？空掉是的当下是不是如啊？这个双非法门叫双遮双照，即遮即照。否定了空当下就是有，否定了有当下就是空。看上去双非，实际上是双即。这第一句偈颂是不是石破天惊呐？应该不应该开悟啊？</div><div class=\"text-indent\">你想一想，「真性有为空」，那佛法剩了多少啊？就剩了一句话，不就是一心三藏吗？明白了一心三藏，因缘法也好，自然法也好，都是戏论，都无实义。你把这句话刻骨铭心地搞明白，当下大解脱。但是这句话你可不要变成断灭空，那是什么都空，什么都没有了。空掉了有，当下空性是不是现前？空掉了空性，当下妙有是不是现前？所以真心本来面目非虚妄非真实，它可以随缘现虚妄现真实。所以虚妄是不是我？你把虚妄破掉了，连这个真也是虚妄；你说这个虚妄是妙有，好，这个真也是妙有。要明白这个道理。</div><div class=\"text-indent\"><strong>缘生故如幻：</strong>「缘生」这是讲有为法。「故如幻」，「故」，此处通「固」，本来、原来之义。因缘法、有为法固然是幻。为什么固然？你可不知道，那个无为法、那个不生不灭的法也是幻。所以下面跟着就是「无为无起灭」。</div><div class=\"text-indent\"><strong>无为无起灭：</strong>「无为」就是灭尽定。怎么灭尽定呢？也就是灭受想定，包括通教菩萨在内的连佛的三十二相都灭，这就包括人我空、法我空在内。「无起灭」就是无生灭；「无为」，就是无起灭，无起灭就是无生灭；「无起灭」，是讲人我空、法我空，要破一切相见空性。</div><div class=\"text-indent\"><strong>不实如空华：</strong>如果解释成「不实故如幻」，是不是一个意思啊？「空华」就是「幻」呐！所以前面佛讲「缘生故如幻」的言外之义：你可不知道呀，缘生法固然是幻，而那个无为法，那个不生不灭的法也是「如空华」呀。「空华」，前面已经解释过多次了，是随缘变现出来的虚幻。前面不是破相见真性吗？而在这里见的这个真性还是空（虚幻）的啊！</div><div class=\"text-indent\">那么前面佛把它说为虚幻，到了这里我们就明白，这个虚幻是不是都是我啊？都是真的。再次告诉大家，我们的真心本来面目非生非灭，非不生非不灭。它可以随缘显现生显现灭，显现不生显现不灭。所以显现的话，不仅无生法忍是我，有生法忍是不是也是我？由此看来，《楞严经》就是讲心法。</div><div class=\"text-indent\">要明白佛的良苦用心。从七处征心到十番显见就是破有为法，首先来见一精之明；等见到一精之明以后，就告诉我们这个一精之明、这个见性也是空华；等我们明白了见性是空华以后，那个所谓的能变现出一精之明的真，到这里也变成空华了。那我们就知道，那个见精是由真变出来的吗？那个十方的万法是由真变出来的吗？不是啊，是「真真如」变出来的。</div><div class=\"text-indent\"><strong>言妄显诸真：</strong>佛讲三藏十二部经是不是在显真啊？显了个什么真啊？显了《金刚经》的真，显了《华严经》的真。下面更有意思了。</div><div class=\"text-indent\"><strong>妄真同二妄：</strong>显得那个真还是妄。为什么讲显得那个真还是妄啊？因为还有能显真的那个真，那才是真，我们的真心非真非妄，它可以显真显妄。既然这个真被所显出来，必然还有能显的那个东西，所以「假传万卷书，真传一句话」，帮我们找到本来面目。这段偈颂我历来强调要背得滚瓜烂熟，要时时提起观照啊！既然「妄真同二妄」，那么真妄是不是同二真啊？妄当下是不是都是真？妄也好，真也好，都是我们的真真如性显现出来而已。</div><div class=\"text-indent\"><strong>犹非真非真，云何见所见：</strong>从根本上解决问题，无形无相的空如来藏都不是我们的真性，而依靠这个所谓的真来显出这个见那个见——「见」就是我们的能见、见性，「所见」是我们见到的万法，你还讲什么长短？这是不是龟毛兔角的事？</div><div class=\"text-indent\">那么讲真也好，非真也好；见也好，所见也好，都是由我们的真真如性所变现。那既然是变现，真和妄与我们的真真如性是不是一回事？真也好，非真也好，真真如性也好，就是一个东西。要记好，能与所都是一个东西，讲平等都是方便说。这个法重要得要老命呐！你别看我讲得这么轻描淡写呀，你不知道有多重要啊！你们要观照啊！所以这里实际上还是讲一句话，明白了万法都是一念之所变现，还讲什么真？还讲什么妄？还讲什么见？还什么能见？还讲什么所见？无非戏论法，都无实义。</div><div class=\"text-indent\"><strong>中间无实性，是故若交芦：</strong>所讲的真也好，妄也好；能也好，所也好，它中间没有一个实实在在的东西。前面打了交芦的比喻，交芦生出两根茎来，一个代表真，一个代表非真，真与非真之间——交芦下面一个根是空的，它没有一个结，破掉一个，那另外一个也会同时破掉。就是前面讲的双非双即，非一切即一切。那个双非双即呢，这两个东西当下是一个东西。所以「中间无实性」，就是没有一个东西能把它分成两个独立的东西，谁都不能单自个别地独立，它是互相依赖。</div><div class=\"text-indent\"><strong>结解同所因，圣凡无二路：</strong>前面首先讲了宇宙人生真理，讲出了真真如性，下面解决一个修门、行门的问题。从「是故若交芦」往上是十句话，是概括悟门，概括「奢摩他」这个法理法义。这里往下就是讲「三摩提」，讲修证的法门。证门呢，还在后面五十五个妙菩提路。这里是介绍修门。</div><div class=\"text-indent\">「结解同所因」，「结解」就是修行的法门，首先看到结和解，这是两个概念。前面的「结」是转圣成凡，后面的「解」就是转凡成圣。这个结和解就分别表现了两种状态。「同所因」，是一个因。叫我们六道轮回的是这个因，叫我们了生脱死成佛成圣的还是这个因。「圣凡无二路」，也就是讲「结解同所因」。做凡夫的是这个东西，做圣人的还是这个东西。没有第二条路，这条路是不是在我们六根上做文章啊？轮回生死的是六根，叫我们出流攀缘，结果在名闻利养里执著；而叫我们了生脱死、成佛成菩萨的还是它。成佛成菩萨、做凡夫六道轮回，就是一念迷与悟。悟了当下成佛，迷了当下是凡夫。这就是如来藏心修法门，不历阶梯，一步登天，无修无证。</div><div class=\"text-indent\"><strong>汝观交中性，空有二俱非：</strong>这个交芦，你讲它空的话，它这两个东西交芦之相宛然现前；你讲它有的话，它里面什么也没有，中无实体，一无所有。所以你不能讲它是空，也不能讲它是有，它就是宛然现前。</div><div class=\"text-indent\"><strong>迷晦即无明，发明便解脱：</strong>怎么「迷晦」呀？六道凡夫执相昧性，执事昧理，他只是在事相上执著；小乘人以及不了义大乘执空昧有，执性昧相，执理昧事，他就执著这个空性。小乘执著人我空，大乘执著法我空，这叫「迷晦」，你当下这就叫无明——无明无明，你失去了大光明。</div><div class=\"text-indent\">「发明便解脱」，厉害不厉害呀？明白这个道理当下解脱。《妙法莲华经》第十七品记载，无量百千万亿的修行者听佛讲了〈如来寿量品〉这一品，半个小时而已，当下证到阿罗汉、辟支佛、住位菩萨、行位菩萨，乃至地上菩萨、十地菩萨、等觉菩萨，乃至像龙女那样一步登天，成为妙觉极果如来。这是不是讲「发明便解脱」啊？就像舍利弗、憍陈那，听佛讲了苦集灭道四圣谛，当下证四果罗汉。是不是发明便解脱？他们修了没有？证了没有？</div><div class=\"text-indent\">就像《阿弥陀经》所讲，即以食时，还到本国。这句是以吃饭打比喻，我这个嘴巴吃到巧克力是甜嘴巴，吃到辣椒是辣嘴巴，吃到榨菜就是咸嘴巴，吃到臭豆腐就是臭嘴巴。这是以此来比喻我们这个心，你明白了人心你就是人，明白了天心你就是天，你明白了佛心就是佛。当我们凡夫的心、妄想的心明白了真心——原来如此啊，原来尽虚空遍法界就是一个人一个念变出来的——你这就是阿弥陀佛。「还到本国」，就是成佛了，「本国」就是我的本来面目。</div><div class=\"text-indent\">所以祖师大德讲《阿弥陀经》是法华秘髓，而今却被有些人讲得天花乱坠。佛临终遗嘱之一就是依法不依人，依义不依语。不要看他讲得好听跟写文章一样，我们又不是考状元、考进士，而是考极乐世界。当然我希望我的弟子们不能像我这样，我是个大草包，讲话就是狂呼乱叫、拍桌子打板凳，没有其它本事。现在是拨乱反正的时候，所以讲话也不在文字上修饰，有时还讲许多土话，有时甚至还要讲脏话。但是希望我的弟子们在第二代人要把这个法讲得文明一点，就拜托各位弟子大众，阿弥陀佛！这个法靠你们去圆融圆满，我在这里是开路先锋，先把这种沉闷的气氛打破再说，然后我们再慢慢地圆满。任何一个法一开始都不可能很圆满，大家要理解。如果一开始没有这么一个横眉竖眼的人，就不能打开局面，所以脸皮子还要厚一点，不要怕人家骂，不要怕人家诽谤。</div><div class=\"text-indent\"><strong>解结因次第，六解一亦亡：</strong>这里也是方便说。为什么要「因次第」啊？因为佛在前面引导大家的时候，已经从「无明不觉有三细，境界为缘长六粗」引导过了，是不是有个九相无明的次第呀？九相无明从开始到中间、到最后，它有一个过程。所以我们解的时候是不是也要这个过程啊？后面观世音菩萨讲耳根修证法门，就涉及到解六结。「六解一亦亡」，这六个结解了以后，还有没有一了？一是对六而言。亡到哪里去了？亡到无量万法里去了。一即是无量，无量即是一。</div><div class=\"text-indent\"><strong>根选择圆通，入流成正觉：</strong>六根之中，你选哪一根最圆通？这个「入流」仍然在体现出前面的「发明便解脱」。明心见性的人当下入大光明流。</div><div class=\"text-indent\"><strong>陀那微细识，习气成暴流：</strong>这个「陀那」就是阿赖耶识，也就是第八识。所以我们从前面虽然把这个七识跟八识都说成是意根，进入第七识以后，我们感觉到第八识好像是如如不动；但在这一识再进一步加功用行，再进一步心变细就会发觉第八识还是动的，而且动得特别特别特别快，又是第七识的无量倍。所以「微细识」就动得更快。「习气成瀑流」，这里的习气就是我执。一念嗔恨心，即可以叫我们下地狱；一念明心见性，即当下成佛。「暴流」具有双重性，无论是受苦报，还是受福报，它都是平等的。你修什么样的心，就得到什么样的果报。命自我立，自己去权衡利弊。</div><div class=\"text-indent\"><strong>真非真恐迷，我常不开演：</strong>这是佛讲到他的良苦用心，一会讲真，一会讲妄。讲到「真」的时候，有些人把真就当成真了，叫做执性昧相、执理昧事、执真昧妄。有些人讲《楞严经》、讲《法华经》时，说真佛无相，是不是他迷真了——除了真心以外什么也没有。讲到「非真」的时候呢，有些人就变成执相昧性、执事昧理——对啊，我们还是念佛好啊，还是来行善积德好啊！他不懂得那个无形无相的真心也是我。「迷」就是迷在某一端，要么执性昧相，要么执相昧性。</div><div class=\"text-indent\">「我常不开演」，佛实际在这里是讲了个软话，我都不随便讲这个法，这个法可难讲了。所以我经常跟大家讲，古今中外没有几个人能把这个法讲清楚。所以我们就要理解这几千年以来，为什么求道者多如牛毛，得道者凤毛麟角？所以佛并不是讲叫我们不要开演，而是告诉我们这个法非常重要，不开演不得了；但是又不容易讲好，是不是我们要发心把它讲好啊？你不能因为他容易迷惑就不开演，那就永远没有人成佛。讲经的人要发心讲这个经，听经的人要护持，要理解。这部经很难得，很难讲。</div><div class=\"text-indent\"><strong>自心取自心，非幻成幻法：</strong>所以我们的心出流攀缘，是不是在取相啊？我们相互之间，我去骗你的钱，我去供养你，是不是都是「自心取自心」啊？没有骗、供养之别，只是无分别不妨分别来引导而已。明白这个道理，是不是一切东西都是多余的？谁骗谁啊？谁供养谁啊？你要想开呀。我们一切的所为是不是「自心取自心」啊？你在吃大米的时候，是不是「自心取自心」？这就是观照。脚踩大地，头顶蓝天，顶的是自心，踩的是自心。时时事事处处，无非我，无非诸佛，这叫念念在道。越是这样观照，你这个定力越深，品位越高。你不是要知道怎样修行吗？这就是修行。</div><div class=\"text-indent\">「自心取自心」，是不是还是在悟中修啊？事情照做，用心不一样。去给老板打工，是不是「自心取自心」？把老板当成佛，我来供养你，老板再去解决更多人的就业问题。有了这个心，你就是在行菩萨道。这个修是不是还是悟啊？这个时候叫养悟，提升定力。</div><div class=\"text-indent\">「非幻成幻法」，这是迷惑颠倒啊！一切的十法界万法都是我们一念真心随缘变现，随净缘而变现为诸佛菩萨，随染缘变现为天人鬼畜、泥巴瓦块……虽然是这样千变万化，是不是都是我自己啊？都是我自己的非幻呐！可是我们却把它当成是泥巴瓦块，认为他是佛，我是凡夫，这是牛，那是马，这是我的老爸，那是我的冤亲债主……是不是成为幻法了？种种分别，也就是说认己为物。本来一切东西都是我啊，他就是自心取自心，他就是非幻成幻法。</div><div class=\"text-indent\"><strong>不取无非幻：</strong>「不取」就是不打妄想，不分别，不执著，不造业。首先不造意业，言为心声，行为心使，身为心役。「无非幻」，非幻是真，不造业连真、连佛都没有，连菩萨都没有，没有了这种妄想心就不造业。这里的没有佛是指没有十法界里的那种方便说的佛，比如释迦牟尼、阿弥陀佛、观世音、地藏王，是没有那种佛。但没有那种佛的时候，你是不是当下就是一真法界的那个佛啊？要明白，所以不造业连佛都没有。</div><div class=\"text-indent\"><strong>非幻尚不生：</strong>连真都没有，连佛、菩萨都没有。</div><div class=\"text-indent\"><strong>幻法云何立：</strong>哪里还有天、人、鬼、畜？哪里还有六道轮回之苦啊？哪里还有山河大地种种障碍呀？你是不是当下得大自在？你的心与天地万法同在，自在无碍，妙用无穷。</div><div class=\"text-indent\"><strong>是名妙莲华：</strong>《楞严经》是不是《法华经》？我常讲这两本经是一本经，《楞严经》是详细解释《法华经》，《法华经》是高度概括《楞严经》。互为表里，互为本末，互为深浅。《妙法莲华经》无非就是把一朵莲华搞明白，这一朵莲华就是「如是我闻」，就是「阿弥陀佛」。</div><div class=\"text-indent\"><strong>金刚王宝觉，如幻三摩提：</strong>「金刚王宝觉」是赞叹「首楞严大定」不可思议的妙用。明白这个「一心三藏」的道理，你就叫「发明便解脱」，你叫「华开莲现」，你叫「一念授记」，太厉害了。这个「首楞严大定」就是「宝觉」呀，无上至宝。「金刚」是表坚固，「王」是表自在。</div><div class=\"text-indent\">「三摩提」就是讲禅定功夫，怎么「如幻」呢？看不到他修。我们一般看到的修禅定一定是两条腿盘在那里，而且还振振有词，你看诸佛菩萨是不是都盘腿盘在这里啊！其实这是诸佛菩萨成佛以后示现庄严相来传法，这是表果地庄严，并不表因地修行。祖师大德讲，修禅定到哪里修啊？到百货公司，到超市，到最热闹的地方去修禅定。衣、食、住、行，无非是禅定。这里听经闻法是不是禅定啊？怎么如幻呢？明白这个道理以后，你不管到哪里，不管做什么，都是修禅定。楞严大定叫自性本定，也叫性定。明白这个道理，即吃了秤砣铁了心，他定也定，不定也定，他没有办法不定。我们平时修的种种禅定叫对境定，也叫事定——是事相上的定，这种定经不起风吹浪打。不像我们的性定，吃饭、穿衣、走路都在定中，这叫「如幻三摩提」。「如幻如幻」，你说他修吧，没有看他怎么修法；你说不修吧，他都在定中。</div><div class=\"text-indent\"><strong>弹指超无学，此阿毗达磨：</strong>是不是还是「发明便解脱」，是不是讲华开莲现呢？一弹指四分之一秒的工夫，他就超过了四果罗汉。你一念信解如来藏，当下超过四果罗汉，乃至到十地、等觉。谁去修了？谁去证了？所以自古以来祖师大德讲，如来藏心地法门无修无证，一步登天。为什么我们不敢相信？还一定要把这个功劳归功于印广法师，说印广法师讲的。我可承当不起呀！这是佛的金口玉言！你抬举我也不能抬举到这样子。</div><div class=\"text-indent\">也就是印光大师所讲，「法华奥典」是不是也是「楞严奥典」呢？「妙冠群经，闻即往生」。一闻是不是一念呐？「位齐等觉」，不是超无学了？无学也可以是八地以上的菩萨，他是无功用道。所以「弹指超无学」，超八地，超十地。他无功用道了，就是因为明白这个道理。所以我们每听一堂课，每听一分钟，我们的定力都在提升。不管你承认不承认，他都在提升。</div><div class=\"text-indent\">「阿毗达磨」，翻译成汉语叫无比法，作双重观照。所有的法中，法华三昧、首楞严大定是第一大定，是禅定之王。第二重观照，这个无比法把万法归宗都是一个自己，谁跟谁比啊？它是全性起修，一修一切修。</div><div class=\"text-indent\"><strong>十方薄伽梵，一路涅槃门：</strong>「薄伽梵」，是佛的另外一个通号，具足六义——自在、炽盛、端严、名称、吉祥、尊贵。「涅槃」就是大成就、圆满成就。只有这一条路，没有第二条路，这就是首楞严大定，这就是法华三昧；要想成佛，除了先明心见性，没有第二个法门，这就是「一路涅槃门」。</div><div>"
  },
  {
    "title": "圆解「普贤十大愿王」",
    "html": "<div class=\"B1_text\"><p style=\"line-height:29px;text-indent:nullem;text-align:center\"><img id=\"aimg_n4lDQ\" onclick=\"zoom(this, this.src, 0, 0, 0)\" class=\"zoom\" file=\"http://www.fahua123.com/data/attachment/album/202009/09/160331xy0zibe9x8v9zlxx.jpg\" onmouseover=\"img_onmouseoverfunc(this)\" lazyloadthumb=\"1\" border=\"0\" alt=\"\" /></p><div class=\"text-indent\">下面我们把「普贤十大愿王」在这里作一个简单的开示。</div><div class=\"text-indent\">首先，十大愿王我们要理解这个「十」。「十」是个圆融圆满之数，十全十美，十方法界，「十」是包含无量。无量之愿包含在这十大愿之中，这十大愿是无量愿之王。你把这十个愿，发好了，你得自在。「王」就是解脱。</div><div class=\"text-indent\">我们以前讲过，中华民族汉字结构，尤其是近代汉字改革，是诸佛菩萨的心血结晶，体现了诸佛菩萨对我们古汉字、新汉字情有独钟。所以中华民族汉字的结构以及近代的改革，这都是诸佛菩萨有备而来。在全世界所有的文字结构中，唯有中国的汉字结构能够直观地表达出宇宙人生真理，许多汉字结构与佛良苦用心分不开。</div><div class=\"text-indent\">你看那个「大」字，一字加一个人，是不是？一个人在宇宙间是不是很渺小啊？字形是渺小，字义呢，比况大。这就是表「一即是一切，一切即是一」；一和多非一非二，一多是不二法门。所以这个「大」就是表我们的真心本来面目，比如《大乘妙法莲华经》《大佛顶首楞严经》。</div><div class=\"text-indent\">在佛法里，这个「大」字司空见惯。师父在讲《心经》的时候，从四种不同的角度来观照这个「大」字。我们可以从时间，从空间，从万法，从数量，从空有等，种种不同的角度来研究它。</div><div class=\"text-indent\">再看这个「愿」字，上面是个原，下面是个心，以我们当人当下这个凡夫的妄心，而见到我们的真心本性，见到我们原来的心，这叫「愿」。也就是说，明白一切的万法都是我们一个人一个心一个念之所变现，无量的法无量的念都是一个念，这叫妄心见到了真心。所以这个「愿」是见道之说，是明心见性之说。</div><div class=\"text-indent\">这个「十大愿王」是明心见性的菩萨自性流露，否则你发不了这十个大愿。你即使发这十个大愿，你是打妄想而已，口头禅而已，唱高调而已。你根本就不知道什么叫「愿」，什么叫「十」，什么叫「大」，连什么是「王」你都不知道！你把「王」看成第一，可这个「王」是表自在。我们自性流露出这种真实的愿望，你得大自在。</div><div class=\"text-indent\">其实我们把十大愿王解释清楚了，这下面的十个愿就已经解释清楚了。要注意，下面的这十个愿，没有哪一个愿不是哪一个愿，十个愿，愿愿次第圆融。</div><div class=\"text-indent\"><strong>一者「礼敬诸佛」。</strong></div><div class=\"text-indent\">「礼敬」恭敬有礼。把一切万法看成是自己，是不是最恭敬，最有礼啊？所以这里的诸佛就是我们常讲的「一心三藏」。过去佛，现在佛，未来佛叫「诸佛」。这个诸佛不是仅仅指过去的老古佛，老古佛、现在佛、未来佛，只有一尊佛，只有一个念；未来世的佛、天人鬼畜、泥巴瓦块、风云雨雾，都是一尊佛。</div><div class=\"text-indent\">所以这里的「礼敬诸佛」，就是我们常讲的礼敬一切。耳闻目睹身受，有情无情，一切的万法，皆是当人当下一个念。</div><div class=\"text-indent\">你果真明白这个道理，你就是「礼敬诸佛」。这是佛在《法华经》金口玉言。佛怎么讲啊?你赞叹一声《法华经》，等于供养一切佛；你「一念信解」，比那个修无量法门修无量劫的功德还要大无量倍。</div><div class=\"text-indent\">所以这个「礼敬诸佛」乃见性之说。我们讲《阿弥陀经》「常以清旦，各以衣裓,盛众妙华」「供养他方十万亿佛」。那个「衣祴」就是你这个肉团身，「盛众妙华」就是你的恭敬心。供养他方十万亿佛，一念而已。不是像有些人讲得那么天真，一大早供养了无量诸佛再回来吃饭。</div><div class=\"text-indent\">所以圆顿大法叫「全性起修，一修一切修，一恭敬一切恭敬」，只看你懂不懂！</div><div class=\"text-indent\"><strong>二者「称赞如来」。</strong></div><div class=\"text-indent\">「称赞如来」就是弘法利生，就是向众生开示「如来藏」。「称」者，度量衡天平之义。你讲这个法是正法，你的心必须跟这个正法半斤对八两是平等的。也就是说，你讲的这个法真正契合「如来义」，叫「称」，这叫平等了，否则你沾不上边。所以讲经说法必须是称性之说，不是讲口头禅，夸夸其谈。</div><div class=\"text-indent\">你不明白「如来」真实义，按照祖师大德讲，你纵讲得三藏十二部经，无非歪魔邪说，你自己先称一称，你明白了没有。</div><div class=\"text-indent\">「赞」是我们语言表达的能力，带有美好殊胜之义。对于宇宙人生的真理，你要讲得娓娓动听，让大家感到一种殊胜美好的气氛，这也是表吉祥之义。</div><div class=\"text-indent\">「如来如来」，诸佛出世无非讲「如来」二字。每一部经前面加「如是我闻」就是讲「如来」，或者讲「如来我闻」。「如来」就是「阿弥陀佛」。「如」就是「阿」，「来」就是「弥陀」。所以二者称赞阿弥陀，称赞如是，称赞如去，称赞如大，称赞如小，行不行啊？所以言简意赅，「如来」二字说尽了宇宙人生本来面目。</div><div class=\"text-indent\">称——你见到了如来真实义，赞——你在开示如来真实义。所以「称赞如来」是不是礼敬诸佛啊？礼敬诸佛是不是就是「称赞如来」啊？一个意思，从各种不同的角度来开示。</div><div class=\"text-indent\"><strong>三者「广修供养」。</strong></div><div class=\"text-indent\">这个「广」包含两种含义：第一个是供养的对象。大光明藏中，如来心中「不漏一人，不舍一法」叫「广」；以「无缘之慈」，以「同体大悲」之心，供养一切万法叫「广」。所以首先你把供养的对象搞明白了，就已经供养了，明白吗？你已经以心供养！</div><div class=\"text-indent\">第二个是你怎么供养。观照「如来藏」是供养，讲经说法是供养，建道场是供养，助印经书流通是供养，财产布施，健康布施，笑容布施，爱语布施都叫供养。我们有些人连话都不会讲，好好的话，到他嘴里就变味了，这些人真可怜。连一个笑容也舍不得给人家，他就那么吝啬。</div><div class=\"text-indent\">特别是我们出家人作为人天师表，时时事事处处要注意庄严我们的形相。人会看到，天人、鬼神都会看到。那么我还没有讲到的那些供养，你们想到了没有啊？只要你用心真，你一言一行都在供养。包括你走路，走得规规矩矩，庄庄严严，你都是在供养众生，是不是啊？让人家心里生起好感，生起庄严感。修行人活着就是为了让别人快乐，你不要总是想着去找人家的短处，想着去让人家生烦恼。</div><div class=\"text-indent\">但是我们要注意，一切供养中，法供养为最！弘扬正法，帮助众生开智慧！</div><div class=\"text-indent\">所以我告诉大家，弘扬这个「如来藏」大法，与文化高低没有绝对的关系，一字不识的大老粗，你可以把「如来藏」讲得天花乱坠，因为这是我们的自性本心。弘扬这个法，便宜给你占光了。唯有这个法将我们自性本心，如数家珍，娓娓道来。</div><div class=\"text-indent\"><strong>四者「忏悔业障」。</strong></div><div class=\"text-indent\">这「忏悔业障」，我们有些人可会忏悔了，跪在佛菩萨面前，一把鼻涕一把泪：老佛爷，我做错了什么事，请你饶恕我啊！是不是啊？你完蛋了。你傻瓜，你忏悔一次，就增加一次罪过，你还不知道吗？这就是《法华经》《楞严经》的秘诀。我们这个阿赖耶识大仓库里，就像一面镜子一样，你现什么相，它马上就跟刻光盘一样，给你刻下来。</div><div class=\"text-indent\">你忏悔一次那个罪过，罪过就在你的阿赖耶识里增加一个种子，明白吗？这种忏悔是对那些穷凶极恶的人，吓唬吓唬他们，让他们不要再造罪，有一定的功德。对于真心求解脱的人，你这种修持，是愚痴法，帮你的倒忙。你以为流几滴眼泪，就把你罪过忏悔得了？忏悔不了！越忏悔，罪越大。</div><div class=\"text-indent\">无量劫以来，我们一切的善恶、业障种子一点点都不会消失，它生生世世跟我们「如影随形，不相舍离」。所以我们修行人修清净心，你去忏悔，是不是打妄想啊?本来错一次了，你还错二次，三次……</div><div class=\"text-indent\">所以有些法师讲啊：真正的忏悔叫「不二过」。</div><div class=\"text-indent\">这些话是对的，可是很难做得到。因为我们习气，这个惯性，你很难控制它。「真正的忏悔——明心见性」 这是佛金口玉言！在《楞严经》倒数第二页佛讲了，有一个人犯了五逆四重十波罗夷之罪，刹那间就要下无间地狱，地狱相已经现前，这个时候他能一念明白「如来藏」的道理，所有的罪过当下消除，变地狱为佛土。你们看《楞严经》倒数第二页，是不是这样?</div><div class=\"text-indent\">唯有明心见性之人，明白道理，所有的罪过当下消除。为什么？你明白了一切的万法都是我，功德也是我，罪过也是我，你受谁的报应啊？明白吗？以此你知道一切万法都是我，再叫你去害他，你敢不敢害？你愿不愿害？这个时候才真正做到「不二过」。</div><div class=\"text-indent\">这个法妙啊！天大的罪过对于明心见性的菩萨而言，一风吹平，没有那回事了。但没有那回事，也有那回事。怎么办？过去造下的种种业障，当下转为教化众生的因缘、法缘，明白吗？为什么我们修行人往往投生各种各样的家庭，不是老公固执，就是爷爷奶奶来诽谤，因为我们前世欠他们的。你今生今世学佛，你就已经把他们度来。为什么？只要他们在释迦牟尼佛佛法中有一念善根，在弥勒佛龙华三会统统得度，就是因为你在这个家庭中，他们知道你学佛，就已种下善根，明白吗？你是来成就他们的！不管他们现在承认不承认，在五十六亿七千万年以后他们统统解脱。</div><div class=\"text-indent\">龙华三会第三会，就是在释迦牟尼佛末法中，凡是与佛门结下一念善根的人统统得度。所以你在这个家庭里，不管他们多顽固，在五十六亿七千万年以后，谁也跑不了，都上了佛船，是不是？要明白这个道理！所以我们修行人在哪里，都是打起一杆红旗，打起一杆佛旗，尽可能把我们的影响更好地扩大！</div><div class=\"text-indent\"><strong>五者「随喜功德」。</strong></div><div class=\"text-indent\">这个「随喜功德」很妙。有些人很穷，你看到有人布施一万块钱，你没有钱布施，你生随喜心：这个人真好，供养了佛！妙了！你的功德跟布施者一样大！知道吗?有些人不是的，他还生嫉妒心：有钱？哎呀，谁不会供养啊。你就完蛋了。是不是啊？</div><div class=\"text-indent\">所以修行全靠我们怎样用心。你如果认为师父讲经讲得真好啊！我的功德你全部有。我再说一句：哎呀真好！好了！又有功德了！所以我们一定要懂得「随喜功德」。</div><div class=\"text-indent\">你这个「随喜功德」不仅要知其然，而且要知其所以然，明白吗？为什么随喜功德跟他一样？大家明白吗？你一念欢喜心就是对整个尽虚空遍法界的吉祥加持。冷水跟热水掺在一起，冷水升温，热水降温，是不是热水对冷水的加持啊？</div><div class=\"text-indent\">这个世界上无非是佛知佛见与邪知邪见，是不是？你转入了佛知佛见，你就是「入流圣人」，你已经进入了大光明藏流，就是这个功德。我们要懂得用好我们的心：随喜一切人的功德！特别是要随喜冤亲债主的功德，随喜好朋友的功德不足为奇。</div><div class=\"text-indent\"><strong>六者「请转法轮」。</strong></div><div class=\"text-indent\">我们在这里是不是「转法轮」啊？所以第一个观照：我们作为修行人，要想办法组织法会，广度众生——这是最大的「转法轮」。</div><div class=\"text-indent\">第二个观照：我们自己也不择时机对家人、对朋友，乃至为一人讲一句法。你讲法华之法，你的功德比虚空级大法师，讲无量经典，成就无量人成为阿罗汉的功德还要大。因为这个法，你讲一个人，就成就一个人，这是成佛，不是成阿罗汉、辟支佛。</div><div class=\"text-indent\">第三个观照：破除我执，破除我们的烦恼习气就是「转法轮」。用一心三藏这个道理来观照，自然而然就消除我们种种的烦恼习气。「转法轮」啊，就跟那轮胎在地上转，把地碾平了一样。转佛法的法轮，是不是成就我们的平等心啊？所以这个「请」字啊，带有主观能动性，我们自己请自己的心来转这个法轮。</div><div class=\"text-indent\"><strong>七者「请佛住世」。</strong></div><div class=\"text-indent\">作双重含义。第一种含义，从方便法讲：我们请善知识来教化众生，要与善知识结法缘。佛在《金刚心总持论》讲修行人没有明师指导不能成就。但是要请「真佛」住世，而不是请「邪师」住世。</div><div class=\"text-indent\">第二种含义，从究竟义讲：你明白了什么是佛，你必须要依教奉行，把这个真佛请出来，主宰当人当下，主宰周边环境……。一切的一切，按佛的教诲，按照「如来藏，一心三藏」，调整心态，历事练心。如同《楞严经》讲「心能转境，即同如来」。你这是「请佛住世」。</div><div class=\"text-indent\"><strong>八者「常随佛学」。</strong></div><div class=\"text-indent\">关键在一个「常」字，这个「常」就是时时事事处处，念念在道。这个道，讲来讲去就是「一心三藏」，万法万相一人一念而已啊！所以你知道不知道？有道无道自己知道。知道这话可不是随便用的，「知道」是佛法特有专用名词，是表示你已经明心见性，你已经是得道真人。但是被滥用为世间法以后变味了：变成了，你晓不晓得，是不是？所以这个「常随佛学」啊，我们以此来检点一下我们修行中的漏洞。</div><div class=\"text-indent\"><strong>九者「恒顺众生」。</strong></div><div class=\"text-indent\">通常讲横来正对，逆来顺受。一切法，从第一义谛来讲都是我；从第二义谛来讲，都是我过去世生生世世的父母儿女，至亲骨肉。当然我们有些人可能连父母都不恒顺，那又当别论。我们这是对修行人而言。修行人如果对父母都不恭敬的话，你白修了。父母就是住世的活佛。</div><div class=\"text-indent\">所以这个「恒顺众生」是建立在明心见性的前提之下，这是修行人很敏感的问题啊！须菩提坐虚空，变成了：须菩提示现神通，坐在云头上，像孙悟空一样腾云驾雾。不是的！他怎么坐虚空啊？一切唯他人是从。你说须菩提坐这儿干什么？碍事。他一股脑站起来，没有什么事情，他想不起来坐下。另外一个人再来说：你这个人站在这里碍事。他一屁股就坐下去，他根本就不问是非长短。如果是我们可能眼睛一瞪：怎么了？！我站这儿碍你什么事啊？大路朝天，各走半边，少跟我来这套！是不是？他还跟你拼命。我们修行人就是要破除我执。</div><div class=\"text-indent\"><strong>十者「普皆回向」。</strong></div><div class=\"text-indent\">我讲一句话，你们不要伤心，我们修圆顿大法就是「不回向法门」，念佛法门就是「不回向法门」。</div><div class=\"text-indent\">回向给谁啊？一切万法都是我们自己，有什么好回向的，明白吗？所以这个「普皆回向」就是不回向。「普皆回向」就是大家都回向！为什么非要回向给张三？回向给李四？说回向给张三，回向给李四，是方便引导，让人生欢喜心，懂不懂啊？一切都是一个人，一个念而已。这个法妙不妙啊？</div><div class=\"text-indent\">所以你们看一看，这「十大愿王」，有没有哪一个愿王不是哪一个愿王？它是从十种不同的角度，来讲一句「阿弥陀佛」，来讲一句「如是我闻」。（摘自印广门清法师讲记）</div><div>"
  },
  {
    "title": "印广法师开示：密宗吃肉问题",
    "html": "<div class=\"B1_text\"><div class=\"text-indent\"></div><div class=\"text-indent\"><div class=\"text-center\"><strong>印广法师开示：密宗吃肉问题</strong></div></div><div class=\"text-indent\">我们要知道密宗在我们这个宗教法门里，祖师大德曾经把它说为是最高修行法门。怎么最高呢？密宗它是八地以上菩萨进修的法门。 密宗历代祖师都是受持弘扬《妙法莲华经》。密宗的祖师莲华生大士在西方极乐世界，专门负责安排莲花台、莲花座。比如阿弥陀佛、观音菩萨要接引众生，要多少多少莲花座，他亲自安排，那么从我们现在的情况来看啊，我们对密宗不是太了解。当今世界，所以说有非常非常大的一部分菩萨都是愿身化身示现在密宗队伍里，我们千万不可以轻慢。藏地现在据说一个大的寺庙，几百、几千、几万人都有。这些人绝大部分都是非常认真、非常精进、非常正直的修行人。修苦行、修清净心，而且在有些密宗道场也是讲《法华经》，讲一心三藏。我也听到过一些菩萨到藏地去。有些是去治病的，也有这样一些密宗和尚，对众生有无比的慈悲心。不论钱财给人治病，包括癌症在内。他可以用自己的嘴巴，靠神通把癌症毒血吸出来，实实在在的行菩萨道。许多回小向大的阿罗汉也好，通教菩萨也好，别教菩萨也好 ，乃至圆教菩萨，都扎扎实实的来到这个世界，认真的修行。据说这里浙江有个多宝讲寺，几年前我就知道，出家人一个月十块钱的单钱，吃饭吃菜油都没有，枯菜皮。我早就发心去供养他，一直机缘没有成熟 ，所以我们对密宗这个宗派，我们应该相信，应该生起信心。但是现在来讲，根据我们现在得到的信息来讲，大张旗鼓，弘扬法华楞严的，我们还没有发现。我们要创造这样的机缘，把如来藏的道理弘扬广大，这是在藏地。在我们汉地我所了解有一个叫龙称法王，他从扬州的弟子那里得到了师父的《过五关斩六将》的光盘，当下下令要收集印广法师所有的讲经光盘，而且把他自己的在家弟子（现在叫当扬）送到师父这里来剃度。在南京还有三四个密宗小弟子，也叫他们到慈航净苑来参学。一个人来看了一次，可能不大满意，没有再来。因为我们那里生活条件很艰苦。龙称法王去年也是在扬州，我们一起吃饭。人非常直爽，发心还要把师父的《过五关 斩六将》这个光盘用藏语来流通。当时我跟他请法，我说：“龙称法王，你们这个藏地叫法王、叫活佛是怎么回事？”他哈哈大笑，说：“你和能度法师你们就是法王，你们就是活佛。我们藏地叫法王叫活佛，就是你们汉地讲的方丈、住持这一类。我这个法王是我舅舅给的。” 不是佛给的。因为他舅舅的寺庙给他的，他就叫法王。把密宗叫成法王、叫成活佛是汉地人自作多情，误解。误解成在我们佛门里那种所谓的法王活佛。有一些不法分子利用这种习俗，利用这种误解，被所谓法王活佛诈骗佛法。从佛门内来讲，不允许什么，谁是法王，谁是活佛，否则你是大逆不道。而且还挂牌经营法王、活佛，所以我们要明确的认识。在藏地来讲，讲法王、活佛无非是方丈、住持之意，没有其他的特别的含义，这是汉族人的误解，有些坏人以此诈骗佛法。在汉地流串的那些所谓的法王和活佛，龙称法王跟我讲说，百分之九十九点九九九都是假的。他连方丈住持都不是，是冒牌货，我们也要搞明白。那么这些冒牌货呢，我们也要具体分析。有些是一般的参学的和尚，有些来讲他还行善积德做好事，所以对什么都不能一概排斥。但是也有极少数坏透了，寺庙不住，住在居士家里，要钱、要吃、要喝，还要你的身体。这些人一般的我们可以把他看成是强盗土匪，是败类，应该把他送交政府，绳之以法。可是这些人逍遥法外，利用一点所谓的神通、邪咒来害人。也有些能帮助你做些善事、帮你治好病、帮你解决什么问题。讲你什么前十八年前二十年 ，什么什么事情，以此作为资本来诈骗钱财、诈骗感情、诈骗人身，这些强盗土匪伤害了许多善良的修行人，把他们逼得神魂颠倒、痛不欲生，但我们不能以此把整个密宗看的一团漆黑，要搞明白。乃至有些密宗道场，虽然他有吃肉的习惯，但是不能把他们说为是坏人，这是密宗一千多年以来的习气。再加上没有一个很好的老师来指导，只要有一个很好的老师来指导，这些人马上都能改邪归正。他们除了吃肉，其他方面修行很精进。吃肉也不是大吃，有些众生供养，他也不限制，这些具体情况我们要具体分析。关于密宗的吃肉呢，它有个缘起。 在一千多年以前，由于当年印度国内发生动乱，佛弟子流亡到西藏。当年的西藏跟印度一样，也是盛行修行的国土，百分之九十五的人都有种种宗教信仰。 但是大多是邪门外道 ，这个邪门外道可不要害怕，都是行善积德之人，一定不是讲地方上的那种邪门外道。世间人讲邪门外道，特指强盗土匪，坏人坏事。佛门内部的邪门外道恰恰相反，他都能行善积德，他仅仅是不究竟，说为外道。佛弟子经过与方方面面的沟通，与其中一个教派达成协议。什么协议？就是说吃肉不可避免。这一点虽然意见不同，但佛教徒只有认可。因为当年的西藏只长草不长五谷，长了草喂动物，人以动物为食，要搞五谷杂粮谈何容易啊？第二个，西藏属于高寒地区，没有足够的动物脂肪，不足以解决生命的能量、热量。第三个，西藏的习俗叫天葬。人死了以后， 不是像我们内地人棺葬、火葬，怎么葬呢？一死，他用刀砍碎了，扔到荒郊野外喂食动物，当生债务，当生了。第四是最根本，佛弟子如果不这样没有办法生存，没有办法生存就没有办法弘扬正法，所以规定佛弟子可以吃肉。但是当时就规定离开藏地，到内地不可以吃肉。那么在现在来看，即使在藏地的密宗，也不可以吃肉。可是我们现在有些在藏地还吃肉，到汉地还要吃肉。有些居士把那些喇嘛养在家里，陪着他吃肉，还大言不惭『酒肉穿肠过、佛祖心中坐』，我们要赶快悬崖勒马呀！你说『佛祖心中坐』，可以呀，你把一个泥巴瓦块吃进去，我允许你吃肉，我顶礼你。你以为佛祖是那么好做啊？当年莲池大师呵斥那些所谓的狂慧之人，说酒肉穿肠过，好嘛，你去吃一口大便，吃进去我许你吃肉。在现量证道位的菩萨，他喝老鼠药跟喝甘露水没有区别。鸠摩罗什大师吃钢筋混凝土跟吃木耳豆腐没有区别，他吃肉功德无量，他吃谁，他就度化谁。你以为这些大话可以随便讲啊。所以我们今后看到这样的修行人，我们不要把他看成是密宗和尚，那是强盗土匪。你就不会造业。你说：「密宗和尚吃肉」，你就造业了。你诽谤佛法，那不是密宗和尚，那是假和尚，要搞明白。   如果说净土的和尚吃肉，那也是假和尚，他不是真修行人，否则你要遭罪。许多和尚都在偷偷的吃肉，我们看了以后心里不要受污染，要生慈悲心。「阿弥陀佛、上帝不要惩罚他」，帮助他消业障；也不要生嗔恨心、不要生轻慢心，懂不懂？一定不可以。我们不可以轻慢假和尚，即使吃肉喝酒，怎么样长，怎么样短。他在这个时代到道场来种下一点善根，在将来弥勒菩萨出世的时候，第三场法会，他照样得度。 不管怎么样他种了善根了。但是我们的假和尚，你也不要以此，那行啊，到那时成佛也行。五十六亿七千万年，地狱之苦、饿鬼之苦、畜生之苦，你要受啊。五十六亿七千万年，在地狱里一天最少是两千七百年，也就是说地狱里的感受是两千七百年的五十六亿年的感受啊，苦不堪言啊！因为师父这个讲法是要向全世界流通的，我不怕得罪人，我也没有办法不得罪人。 有些人讲，那个印广师我知道，胆子最大， 什么都敢讲。其实我胆子最小，我是不敢不讲，别人敢不讲，我不敢不讲，因为这是佛法，你必须讲出真理。我没有办法回避，大家明白吗？你回避不了。要得罪人，也是硬着头皮去得罪啊。情愿得罪人，不能得罪佛菩萨、三宝和一切众生是不是？我是权衡利弊。所以今后来讲，在我们居士家里不允许住出家人。除了很特殊的情况，两个人以上，而且是特殊的情况。僧人一个人不可以住到居士家里，但往往这些人都是一个人，住到居士家里，搞得人家家庭也不和。也有些汉地的密宗，他们在四川地区。在我们这个一般的中原地区也有些，他住在寺庙里，往往住在寺庙里这些人来讲，基本上来看都还比较正规。他们修行的法门，他就是那个法门。我们有机缘的可以去引导他们，但是我们要提高警惕。对那些莫名其妙的密宗和尚，你要当心，你一旦给他缠住了，他给你没完没了。他一定会：你来做我的弟子，怎么样怎么样。要么就威胁你，这个大家要注意。特别是涉及到男女双修，在佛门里决不允许。这是下无间地狱的勾当，这是邪教。所谓在密宗里一些法门里，就参杂着一些婆罗门外道。还有些人讲：「哦，佛门里这个男女双修，密宗是正常的」。这是邪道、邪教。密宗课程里不泛有婆罗门外道这些东西。那么男女双修即使在外道里，在婆罗门教，也把他视为是劣等法门、下等法门、下品，是有这回事。如果这个事情搞起来的话，你这是伤风败俗。所以今后发现，有这样的所谓的密宗和尚，我们要检举、要报告政府，而且一些所谓的咒语，一般除了早晚功课本，除了我们正常流通的，《法华》《楞严》《华严》《阿弥陀经》往生咒等等，那些来路不明的咒语你不要学。这些咒语很可能就是些外道邪咒，你学了以后会走火入魔。我们已经有来龙去脉的那些咒文足以成就我们。而且还要讲到三密相应，当然三密相应不可能的。但是你最起码用了以后不会有坏处。所以关于这个密宗，我们要有正确的看法。不要一概的否定，或者一概的肯定。现在我们在网上也有许多修行人，在揭发这些强盗土匪，在我们所亲身经历的发生这样的事例不少啊，到最后走到威胁弟子，威胁修行人这种地步。</div><div>"
  },
  {
    "title": "阿难明心生信偈",
    "html": "<div class=\"B1_text\"><i class=\"pstatus\">本帖最后由 当捷 于 2014-6-20 16:25 编辑 </i><div class=\"text-indent\"><strong>【妙湛总持不动尊】。&#13;方便解释,这个『不动尊』就是佛。佛啊！你真是『妙湛总持』啊！说的法很妙,你集中体现了一切的智慧,你也帮我们解释了奇妙的智慧。究竟说为﹕「妙湛、妙总、妙持」。一个『妙』,贯通三个字。『湛』是表法身功德,所以在佛经里讲,叫「清净佛法僧,湛然应一切」呀！『湛』带有清清楚楚、明明白白的含义。我们能够看到、听到的以及我们还没有看到和听到的都是我们自己的法身。这里已经不是讲那个无形无相的法身。一定要注意,圆顿大法里,法身、报身、化身当下是一。所以解释的时候一定要次第圆融。『总』呢,这里是作为动词来用。总理,总理,总理万机呀！这是讲我们报身功德的妙用,总法身、总化身。『持』,在这里方便说为是化身功德。任何一法总有它一定的形相特征,这叫『持』,否则不足以叫化身。化身一定要有所依,有所靠,有所持。&#13;注意！这里的『妙湛总持』，首先讲我们的本来面目的三种功德。那么再怎么『妙』呢？湛：即湛、即总、即持。总：即总、即湛、即持。持：即持、即总、即湛。没有哪一个不是哪一个,叫次第圆融。&#13;『不动』,不动是对动说不动。相上来讲,我们千变万化；性上来讲,变来变去还是一个东西。动就是不动,不动就是动。比如说,我这个拳头变现为手掌,相上是不是动了？性上动了没有啊？手掌是不是还是拳头啊？所以这个就是对动说不动。『动』,按照世间法来讲,它一定是越过了本位,那我们这个『动』它有没有越过本位啊？没有。我们在世间法里,在个别的局部的空间看到它在动, 在整个的全局的范围他动了没有啊？（没有）。所以我们到哪里都是不动而至。「而至」就是动,所以「不动而至」就是不动动,动而不动,不动而动！&#13;这里的『尊』方便说为释迦牟尼佛；究竟说为,我们的本来面目就是一个尊。这一个『尊』,你不能讲他是一,也不能讲他是无量,又不能讲他不是一,又不能讲他不是无量。唯此为『尊』。&#13;这是不是第一句话就帮助我们明心见性呐？所以阿难这第一句话一出来,祖师大德评判这个偈颂是八地菩萨以上的境界了,八地的菩萨才能见到这种境界,所以你不能讲他是次第三藏。&#13;【首楞严王世希有】。&#13;这是表成佛由法化生。通过法来化,由了义法来化生,也就是叫我们依法不依人,依了义法不依不了义法。&#13;『首』是表第一,也可以讲『首』就是脑袋。人缺胳膊少腿了还能活,缺了脑袋还能不能活啊？（不能）。所以讲一切的万法,唯以『楞严』为首。『楞』是表坚固,无坚不摧。它能破一切邪法,一切邪法和一切方便法没有办法动他。它压倒一切,又包容一切,他又成就一切。它把你打死的当下,你的法身就活了。明白吗？打得念头死，许汝法身活！他把你判为牛屎狗粪的当下,你即已变成跟它一样的首楞严王。大家明白这个道理吗？&#13;『严』这是表装饰、装潢,这个『严』在圆顿大法里是表圆融圆满圆通。『严』是严密,表全性起修。一修一切修,一证一切证,一见一切见。你懂得了我们的眼性周遍法界,你马上就懂得眼睛所对的色尘也是周遍。耳朵的能听、所听等,没有一法不是周遍。这叫闻一悟千,以此为『严』叫庄严。『王』表自在,懂得了『首楞严』这个法,你当下得到自在。&#13;『世希有』,整个世间出世间希有。如果叫我来讲的话,不是世希有,而是世独有、世仅有！或许在翻译的方面出了岔子,这个『世希有』的『希』字来讲呢,不尽如人意。因为三藏十二部经只有《楞严经》独露天机！&#13;【销我亿劫颠倒想,不历僧祇获法身】。&#13;这就是讲「华开莲现，即悟即证」！其它方便法中,藏教修无量劫不能明心见性,修通教别教恒河沙数的人难有一个人成就,无量百千万亿劫也难得成就。唯有《法华经》《楞严经》之『一心三藏』,来一个成就一个,来两个成就一双,百分之百,千分之千,万分之万！而且成就高,下可保底不落六道轮回,上不封顶直到十地等觉,乃至像龙女那样成为究竟圆满之佛！就是成就率百分之百,成就的品位高！成就的时间呢，你可以一生成就,也可以一个月成就,也可以一天成就,也可以一时一念成就！&#13;所以观照这段经文,就消除我无量劫以来的颠倒妄想啊！有哪些颠倒妄想呢？时间上颠倒：时间上有过去、现在、未来。空间上有颠倒：东南西北上下十方（其实都是一念）。佛法上、世间法上有颠倒：认为什么法门都能成佛。种种的相貌上颠倒：有你我他。所以这个『颠倒』呢,我们从时间、空间、佛法、万法之相这四个角度来观照。&#13;这么多颠倒啊,</strong><strong>『不历僧祇获法身』呐！不需要经过无量百千万亿年而『获法身』,也就是说我当下就已经见到了法身,获得了法身。圆顿大法这个『获』视同于『证』。圆顿大法只愁悟,不愁证！在见道位所见到的真如与在证道位所证到的真如无二无别,你明心见性的当下就是如如佛。这是讲《楞严经》它的妙用不可思议！ &#13;昨天讲到【销我亿劫颠倒想,不历僧祇获法身】。&#13;『颠倒想』,哪些叫颠倒想啊？过去执着在时间是过去、现在、未来,是不是？那现在明白就是当下一念；过去执着十方虚空无穷大,现在知道都是当下自己一念心；过去太阳、月亮、山河大地、树木华草是无情；牛马猪羊、张三李四是他,现在知道都是自己一个念。没有哪一法不是哪一法。过去认物为己,认己为物；现在来讲,己也是物,物也是己。大光明中谁非谁？这些颠倒想一颠就颠过来,无始以来的颠倒想当下一念就明白。这叫「一灯能除千年暗,一智能灭万年愚」！下面的【不历僧</strong><strong>祇</strong><strong>获法身】是重复解释上面一句话,一念明白过来了,削去颠倒想了,叫「知妄即真,华开莲现,当下成佛」！&#13;所以别教菩萨从空出有,在通教禅宗的基础上从空出有,还要修三大阿僧祇劫！三大阿僧祇劫只能证到二行位的菩萨,也叫佛。比圆教佛还要低三十个等级,更何况别教以下，通教、藏教、小乘法更不用谈。可是到了圆教,成分真即佛,乃至到地上菩萨、十地菩萨、等觉菩萨都可以一生成就。一生就是我们这个人一生短短几十年。几十年就能成就,也可以一个月成就,可以一个时辰成就,甚至可以一念就成就,这叫【不历僧</strong><strong>祇</strong><strong>获法身】。&#13;『僧</strong><strong>祇』，</strong><strong>是从别教往前讲,就不知道哪个猴年马月才能成就。圆顿大法是无量无量劫的功德，成就于一生一时一念当下,这是不可思议的大法呀！这里的『获』就是「悟」,就是证得。所以有些受方便法影响的人,把这个『获』看成是见道,他把见道和证道分开。对于方便法而言,见道以后要修要证,因为他那种见道还有漏,没有见全,见的是有或者见的是空,或者见的是亦有亦空,都不圆满。那种见道,那种所谓的悟解,必须要解行并重。所以他那种说法把『获』说成见道、悟解并且还要修还要证并没有错,因为他见得不圆满。对于圆顿大法,见道即是修道、即是证道。所以圆顿大法「不历修证,不历次第,无修无证,即见即修即证」。这是一步登天的大法,这里必须要搞明白。&#13;所以这个解行并重啊,在佛门内部也是这几千年以来困扰我们的一个问题。有些人开口就是解行并重,解行并重,他不懂得《法华经》《楞严经》圆顿大法无修无证,华开莲现,当下成佛！他不懂得听经闻法当下成佛，这里必须反复强调！乃至有些人以此来挖苦讽刺,说山西来了个和尚讲听经马上就成佛啊！讲得很轻飘飘的！他不知道这是在谤佛谤法！&#13;佛在《法华经》《楞严经》就是这么讲啊！摩登伽女是个下九流的坏女人,听佛讲几句话当下证三果罗汉，再听文殊菩萨讲了几句偈颂,当下证四果罗汉；舍利弗和</strong><strong>喬</strong><strong>陈那听佛讲了一遍苦集灭道,当下证四果罗汉。这还是讲小乘法呀！讲大乘法,八岁的龙女听文殊菩萨讲了《法华经》,当下成为妙觉位的佛—圆满之佛！《法华经》《楞严经》里这样的例子很多啊！无量百千万亿的众生听佛讲一段经、一品经乃至半个小时的开示,当下无量的人成为阿罗汉、辟支佛、住位菩萨、行位菩萨、回向位菩萨、地上菩萨、直至十地、等觉位。&#13;印光大师是近代高僧，我们现在有些人讲，「就是印光大师叫我们念佛的」，把印光大师的糟粕当成精华！印光大师一世的精华就是四句话：「法华奥典，妙冠群经，闻即往生，位齐等觉」!《楞严经》从头到尾几乎都是在讲，成佛就是当下的事！当下！&#13;要成佛，首先要开悟；要开悟，非读《法华经》《楞严经》不可!佛在《楞严经》第一卷是不是这么讲的?不明心见性,「虽终日行, 枉入诸趣!」你就一天到晚在修行,你都在六道里轮回,何况有几个人能做到一天到晚都在修行啊?!我们这里有没有一个人整天在修行的?整天在修行的,有没有啊?你就是整天在修行,你都是六道轮回!佛讲得多么的恳切、多么地斩钉截铁！不要以为自己会修行—我会念佛，我会拜佛，我会拜忏……我唱赞唱得呱呱叫，敲鼓敲得咚咚响。&#13;这两句话,我们要把眼睛瞪得大大的,耳朵拉得长长的，你看看想想师父讲错了没有？阿难讲的这句话特别亲切！特别真实啊！为什么啊？阿难跟佛，同年同月同日同时在空王佛座下剃度，佛成佛以来已经是多久了？在《法华经》讲「五百万亿恒河沙」!注意：五百万亿恒河沙国土化成微尘，以此微尘，一个微尘为标记，由此往东每隔五百万亿那由他恒河沙国土才下一个点，不是每个国土下一个点呐！要隔五百万亿恒河沙的国土下一个点,然后把下点做标记的和没有下点做标记的这么多国土化为微尘,我释迦牟尼佛成佛以来还是这个数字的五佰万亿那由他恒河沙倍。佛成佛成了多长时间呢？光到我们娑婆世界来示现已经是第八千次！每次示现和再示现,中间相隔少说是几十亿年,多说百亿千亿万万亿年！可是与他一起修行的阿难还是个初果罗汉!&#13;所以阿难讲这个话是字字血声声泪啊!</strong><strong>「我搞到现在才搞到个明心见性，就是因为才听了《楞严经》」，你说他无量劫在干啥呀？是不是盲修瞎练呢！他幸亏是个大慈悲的人,大慈悲心呐！他什么事情都想到别人,所以没有落三恶道已经很侥幸！好人能不能当师父啊？不能啊！他自己都保不住自己! 何况再好,他能像阿难这样好？阿难起心动念都是为别人,他都不能成就！因为行善积德不能成佛、不能了生死！但是他能得到大福报！他能生生世世行善积德,生生世世得大福报,但是永远不能明心见性！&#13;修行要见真，不是见善! 见善是世间善法,多得是! 所以好人不能做师父,可以做大姑、大姨、姥姥、姥爷。如果是没有血缘关系的,可以做干姥姥干姥爷、干爹,但是一定不能做师父! 我跟你讲：做师父的人没有一个「好人」! 我最坏,骂人骂得吹胡子瞪眼睛！打人打得噼啪响！我可是真的! 我不会像其他人：「阿弥陀佛！哎呀,你修的真好啊」!我会说:「你懂得什么? 你讲给我听听」！我说你一句都不懂、一个字都不懂！你不相信你讲给我听！我就这么狠！过去祖师大德也是一样的,他才不做什么好人呢！而且还不识抬举。怎么不识抬举啊？人家来看他,他来一句「你来干什么？」「我来看师父」。「滚！ 师父有什么好看的」？是不是？是不是不识抬举啊？我跟你讲,可是这样的人能做师父！因为他能帮助你成佛！&#13;佛法从一开始起,就是在斗诤中产生,在斗诤中成长,在斗诤中巩固！这几千年以来,就是我们没有斗诤！在互相赞！都赞到六道轮回里去了！佛法里不是搞互相在那里贴福字,讲几句吉祥语,要明白这个道理！&#13;所以阿难这两句话充满着感恩，终于有了今天！有没有哪一个菩萨说读了《金刚经》、读了《地藏经》、读了《无量寿经》，出来讲「啊，销我亿劫颠倒想，不历僧祇获法身」</strong><strong>？有没有啊？有没有读其它一部经，有这种讲法啊？都没有啊！所以一个人如果没有读《法华经》《楞严经》,他一开口都是错的！师父是广告天下,我这个光盘要向全世界流通！因为我把道理搞明白了。   &#13;【愿今得果成宝王,还度如是恒沙众】。&#13;这两句话要做两种观照：一种呢,作为方便菩提心来解释。我希望我赶快成佛,成为究竟圆满之佛啊！然后成佛以后,再回过头来度众生,这叫方便菩提心,一般人都是这样讲。第二种观照,叫究竟菩提心、真实菩提心。『愿今』,我现在明白了这个道理啦！『愿』,现代字体,上面一个原,下面一个心。义为，我现在看到我的真心了,看到原来的心了。你现在看到原来的心,你现在是不是就是原来的心呐?繁写体的願字,左边一个原,右边一个页,原页原页。比如一篇文章,复印出了许多许多页,那是不是成了不空如来藏啊？可是所有的那么多页是不是都从原页而来啊？原页是不是空如来藏啊？所以在许许多多的页中看到原来的页,是不是表明心见性了？&#13;所以我们当下明白了佛,我们就是佛。所以祖师大德讲啊：一念回光,当下即如如佛！这是圆顿大法的心地法门,一步登天！与前面的「不历僧</strong><strong>祇，</strong><strong>一念销除亿劫颠倒妄想」是一致的！这就是讲「华开莲现」,我当下已成佛了！明白这个道理。&#13;【还度如是恒沙众】。&#13;当下成佛,当下就已经度化恒沙众。为什么？心里真正明白一切的万法都是我,你就已经开始度化他,大家知道为什么吗？我们经常打一个比方：冷水跟热水和在一起,是不是冷水升温,热水降温啊？比如冷水是众生,热水是佛,当下那个热水是不是加持了冷水啊？这个世界上无非是佛知佛见与邪知邪见这两种心在较量。我们原来是邪知邪见，当我们转邪知邪见为佛知佛见的时候，以这个气球手套为例：邪知邪见是只看到手指头,我的手指头、他的手指头;转变为佛知佛见以后,是不是转到这里来了？(观照：大手套的大手掌)这里当下是不是大光明流啊？（观照：大手套的大手掌）。所以我们当下就是大光明流在教化众生！当下明心见性是不是当下就是加持法界啊？&#13;这是一种抽象的道理,那么再讲真实的道理。师父在讲《过五关斩六将证菩提》的时候,讲了第六个问题「无情也是情」，是不是？我们的心念是不是跟无情都能感应啊？人与人之间是不是在进行心电感应啊？牛顿那个「万有引力」讲万法相互之间都有吸引力, 那明心见性了, 我们是不是用大光明藏的力量在吸引万法啊？<u>所以</u>我们讲有情之间存在心电感应,有情与无情之间也存在心电感应。&#13;在没有成佛的时候, 我们有一个恶念,有一个恶语,有一个恶行,也是在污染整个尽虚空遍法界,在污染整个恒沙众; 一念转正,反过来是不是加持恒沙众啊?所以这个【还度如是恒沙众】,明心见性的人当下是不是就是【还度如是恒沙众】啊? &#13;佛在《妙法莲华经》怎么讲的？你一念信解如来藏,一念信解,一念而已啊,胜过修无量百千万亿年布施、持戒、忍辱、精进、禅定无量法门呐！你就知道一个明心见性的人他对整个尽虚空遍法界的功德贡献有多大！不比不知道,一比怎么了,吓一跳！跳到哪里去了？比孙悟空跳的还凶,是不是？要明白这个道理。所以我们来听闻《法华经》《楞严经》何等重要!不仅你自己成就,而且供养了尽虚空遍法界恒沙众!大法跟小法能不能比啊?（不能）所以我们看看《楞严经》这样讲，《法华经》那么样讲,我们该做如何感叹啊! 佛在《法华经》这样的论说还多得很啊！受持一句《法华经》，胜过金银七宝满虚空供养无量诸佛如来、大菩萨、阿罗汉、辟支佛！你看〈药王菩萨本事品〉是不是这样讲的？！&#13;所以这两句话要做双重观照,按方便菩提心和真实菩提心来观照！&#13;【将此深心奉尘刹,是则名为报佛恩】。&#13;这里同样做双重观照：一种是方便菩提心。虽然没有明心见性,藏教菩萨、通教菩萨都有为一切大众服务的心！这也叫「报佛恩」。一种作究竟说：不见一心三藏之理,不可谓『深心』！深心深心,一定是一人不舍,一法不缺,视尽虚空遍法界为当下当人一念,此谓『深心』！明白了这个心,你当下就是奉尘刹。『奉』是供养供奉。『尘刹』作双重观照：第一种观照,像微尘数一样无量的数不清的佛土,这个佛土包括这个太阳、月亮、星球、天人鬼畜；第二重观照,小至一点点的微尘,大至像太阳、地球这么大的天体,小大统统包含在内。讲到底,两种观法都是表十法界无量万法。这就是圆顿大法的平等心！所以要成佛,要成佛,我们就是要为众生服务！这才是成佛的心！&#13;【是则名为报佛恩】。两种观照都是讲我们的心,是不是？发了心即为报佛恩！所以圆人论心不论事。他并没有讲「将此身心行万行」，是不是？他有没有讲行万行啊？要明白啊！所以《楞严经》后面还要讲「修心」,它没有讲「修行」。但我告诉大家,没有说修心的人就不修行,大家明白吗？你不要错用了心！修了心以后你一切的行都叫「修心」。心没有修好,一切的行—佛在《华严经》讲是「魔业」；佛在《楞严经》讲是六道轮回, 「虽终日行,枉入诸趣」</strong><strong>！所以不修行不是叫你不要修行,心修好了以后,修一切的行都是修「心」！所以圆顿大法,明心见性修了心就是功德圆满。&#13;【伏请世尊为证明,五浊恶世誓先入。】&#13;也同样是双重观照：一种是方便菩提心。没有明心见性的人,不懂得《法华经》《楞严经》一心三藏的人,往拜垫上一磕他心里就来了,拜倒在佛下,战战兢兢。「佛啊！你印证我啊！证明我啊！我发了大愿我要为众生服务啊！众生最苦的时候我一定出来」。这种心也是好心也是真实心,是不是？叫方便菩提心。甚至喘气喘得很粗,甚至眼泪都要流出来,</strong><strong>「老佛爷啊！我老老实实地为众生服务啊」!这种心也很难得啊！他能得到很大的人天福报啊！可是不能了生死。来世可能当总统,当国王,是不是？他确实是好人啊！他能做一个好的国王,但是不能了生死。&#13;第二种观照为究竟观照。当我们明白了万法都是我的时候,你已经是【伏请世尊为证明】。在早晚功课本前面那个小字里面注意看,有几种拜佛。有一种拜佛没有功德,有的拜佛还有罪过。拜什么佛有功德？拜虚空佛、拜法界佛！你看到前面的太阳、月亮、山河大地、风风雨雨、牛马猪羊、黄金白银、臭狗屎、垃圾堆统统都是世尊,叫作拜虚空法界佛,当然也有诸佛在那里。一个明心见性的人,或者他拜下来,什么也不知道,什么也没有,就拜下来,他知道一切都是我。明心见性的人他跪下来也好,站在那里也好,都是【伏请世尊为证明】。这个道理大家转明白了没有？这就是【伏请世尊为证明】,好好想一想。我心里包容了整个尽虚空遍法界,所以菩萨到了这样的境界,越是困难的时候越是要去。 &#13;【五浊恶世誓先入】。&#13;我们现在正是『五浊恶世』。『五浊』本来我应该另外讲,因为《楞严经》专门有一段讲五种浊,所以我们在这省略,到后面讲得更加具体。人均寿命进入两万岁的时候,这个世界就进入五浊世。人均寿命进入一百岁的时候就进入五浊恶世。我们这一个时空点人均寿命是七十岁,所以在法华会上那些阿罗汉发愿在佛灭度以后,在末法时代,他们要弘扬《妙法莲华经》,但是他们不愿意到娑婆世界,他们要到其他世界!为什么?因为娑婆世界的这些东西太坏,阿罗汉他不敢来。他怕遭到人家诽谤、刁难,等等等等。所以那些大菩萨看不过,个个摩拳擦掌,发愿要到娑婆世界,到最困难的地方度众生。&#13;所以我们就知道,今天在这里能够听闻《楞严经》的这些菩萨,你要知道你自己是什么人,不要忘记了我们的本愿、我们的本誓!法华会上没有发过愿的人,我告诉你,你今天不会来这里听经闻法！好好把《法华经—见宝塔品》回去读个十遍八遍,你再来悟你是谁,自己检点自己。你现在就知道自己愿不愿意把我的一切的一切来供养如来家业,供养一切众生。&#13;凡是再来的菩萨,即使他从来没有听到佛法,从来没有听到过佛,他一听到国际歌他就热血沸腾,就想冲锋陷阵,就想保家卫国,这样的人一定是菩萨再来!你们信不信?有些人听了《国际歌》无动于衷,有些人听到《国际歌》、听到《国歌》他就热血沸腾！这都是菩萨再来！你们去检验去！还有他们听了那个《解放军进行曲》：向前向前向前,我们的队伍像太阳……是不是？凡是再来的菩萨,听到这些歌,一定是心潮澎湃！你叫他马上上前线,他都干!你以为怎么样? 人与人天地之别啊!&#13;因为许多菩萨都是带着隔阴之谜而来的,所以我们只有从他的习气中来检验他是什么人!弥勒菩萨就曾发了一个愿：在人均寿命十岁的时候，他一定是要百千万亿化身，帮助一切众生！菩萨愿身再来，同样有痛苦的感受啊！因为他带着肉团身来啊！当然讲弥勒菩萨是百千万亿化身,是不是？这个化身已经包括肉团身了。&#13;【如一众生未成佛,终不于此取泥洹】。&#13;这里既可以解释为方便菩提心,又可以解释为真实菩提心。方便菩提心就是说大家都成佛,我最后成佛。只要有一个众生没有成佛,我就不成佛！他发的愿是不是跟地藏王菩萨一样啊？这是方便菩提心。究竟菩提心是「如一如一」。如来,如是表一 ,来是表无量,是不是？阿弥陀,阿是表一,弥陀是表无量,是不是？在这里的『如一』,怎么『如一』啊？尽虚空遍法界就是一尊佛。我告诉你,这是一个『一』；第二个,这个『一』双重解。一尊佛他显现出无量的化身佛,化身佛有悟中的化身佛,有迷中的化身佛。&#13;只要有一个迷中的化身佛 ,只要有一个人,哪怕是一条狗,哪怕是一粒泥巴,一滴雨都还没有解脱,那么释迦牟尼佛也好,阿弥陀佛也好,他们解脱了没有?谁都没有解脱! 所以从这个意义上来讲,地藏王是谁呀？没有哪一尊佛不是地藏王,没有哪一个明心见性的菩萨不是地藏王。只要有一粒泥巴一滴水没有成佛,你想成佛你也成不了!&#13;这个法我是2004年开始在那个太原南十六那个地方,我搞火力侦查,我想了半天不敢讲,唉,讲了以后没有想到那些傻瓜个个都赞成！这是不是老佛爷加持啊！当时大概道场也只有二三十个人。后来我就坚定信心,众生没有一个不是大根基,而且都是一个根基,关键的关键就是要有一个好的老师!只要有好的老师,他走到哪里都能度一大片!所以这个法我们传了十年以来,经得起调查啊！不管在哪里都是萍水相逢！开始几年认可的人数大概占百分之七八十,后来达到百分之九十五、九十九,乃至许多场合少说有五六个场合达到百分之百,人家都能认可,自己印证自己成佛了!&#13;我这个叫人家举手很苛苦的,你不懂装懂来拍马屁你还受报应,我就这么硬,我不在乎你来拍马屁来恭维,师父每次法会是不是这么讲的? 吓唬你,我可没有包红纸包,唉,到时候给我举手啊！咱不干这个事！但是你如果懂装不懂,你轻慢正法也要受果报。我叫你进也进不得,退也退不得,老老实实拜倒在真理的脚下。讲到底真理是不可战胜的！『泥洹』翻译成汉语叫城堡，城，也叫涅盘城涅槃呐！进入大光明藏呐！享天福啊！&#13;【大雄大力大慈悲,希更审除微细惑。】&#13;这两句话我们一般地以方便解,肉身佛当前这是我们众生的福报,要亲近,要向他请法,【大雄大力大慈悲】是对肉身佛的赞叹。三个『大』都是表究竟圆满,表证得法报化三身圆满的如来果位。所谓『大雄』,非破无明之惑而不可谓大雄!无明妄想没有破除,你雄不起来、神不起来！用世间人的话讲:你拽不起来！『大力』,非拔无明根而不可称为大力！拔无明根就证得涅槃断德；破无明惑就证得菩提智德,称『大雄大力』。&#13;『大慈悲』就是大慈大悲,这里的慈悲不是世间的那种小慈小悲、小恩小惠。你就是钱财供养了一个地球,你都不能称为大慈大悲！你就是七宝满虚空供养无量人仍然不可以称为大慈大悲！所以我们这个大慈大悲,不可以轻易地恭维人。对于我们受持《法华经》的菩萨,无论在家出家可以称『大慈大悲』。&#13;曾经有人问我,「师父啊，什么叫法师？什么叫大法师啊」？我说讲法的人就是法师嘛！读法的人就是法师嘛！什么叫大法师啊？我说读《法华经》的人、讲《法华经》的人、写《法华经》的人都是大法师！因为《法华经》是大法呀！并不是说你这个人兵强马壮、钱多位重、名高，就是大！那是世间法里的「大」！那是假洋鬼子，不是大法师！这样解释对不对呀？（弟子们一致回答：对！）&#13;这个解释是谁讲的？是佛在《妙法莲华经—见宝塔品第十一》讲,懂不懂啊？能够读一句《法华经》、写一句《法华经》、更不用说还问一句《法华经》、更不用说讲一句《法华经》,你比站在最高的天上对无量的人讲无量的经,把这无量的人都培养成阿罗汉的法师的功德还要大，还要殊胜！那这是不是大法师啊？那个太虚空级的大法师,我们地球上有没有这样的大法师啊？没有！大家明白这个道理了吗？我们听了好像是害怕,好像是不敢承担,可这是佛讲的。佛就是叫我们受持《法华经》的人不要自暴自弃。&#13;所以『大慈悲』啊，涉及到大法师，受持《法华经》的人可以叫「大法师」！可以叫『大慈悲』！但是在这个『大雄大力』上,我们受持《法华经》的人暂时还不敢这样称,是不是？他那个『大雄大力』是指圆满极果如来，但「大法师」可以称！但是一般地我们不要这样称,防止别人造口业,我们懂得就行,是不是？所以佛法不坏世间法,因为众生有本能的嫉妒心、下劣心。你讲你是大法师啊,他要纠集几十几百几千人来诽谤你来攻击你！与你没有关系,他会下地狱！所以我们是出于慈悲心保护众生,叫恒顺世间法,但是心里必须明白。心里明白你就知道你肩上的担子,明白这个道理,是要我们发心来教化众生。你不要有愧于你自己的价值！不要把自己混同于小法师,是不是？&#13;所以这个大慈大悲,</strong><strong>『慈』是给予快乐,</strong><strong>『悲』是解除苦难。那么圆顿大法的『大慈』是让你成佛了生脱死,给你究竟之乐！『大悲』是让你超越六道轮回,解除分段生死、变异生死这两种生死,从根本上给你拔苦！这是从他的深度来讲。从范围来讲呢,</strong><strong>『大慈』叫无缘之慈。世间人讲究有血缘、亲缘、恩缘、友缘、同事同学这种缘,他帮你,跟他没有缘的他不帮你,跟他有恶缘的他还要报复你。所以『一心三藏』之缘叫无缘,无缘就是一切缘都不讲。实际上无缘是不是都是有缘啊？大家都是亲缘,都是恩缘,都是我,这叫「无缘之慈」。『大悲』叫同体大悲。怎么同体啊？万法都是我一个人,拔别人的苦就是拔我的苦,不是把他当成他就是他！必须要刻骨铭心明白这个道理！&#13;【希更审除微细惑】。&#13;这里呢,就是阿难他毕竟还没有成圆满如来,是不是？所以他【希更审除微细惑】,我们可以笼统地来解释。他求佛指导指正自己的无明微细烦恼。虽然见道了,但是现量的习气还在,即使证到等觉位的菩萨都还有微细惑。如果我们稍微讲细一点,这个『惑』啊,在佛法里有三种等级的迷惑。&#13;第一种：属于六道、三界之内比较粗重的见思烦恼,像贪嗔痴。这个东西一讲我们都能知道、都能明了，叫「粗惑」。粗惑使得我们不能出六道轮回,也叫「界内粗惑」</strong><strong>。破除了贪嗔痴这三种粗惑,主要是贪嗔痴,细讲有九品贪嗔痴慢疑,还有种种说法。九种烦恼,九种烦恼对应于九地：欲界是一地,四禅天是四地,四空天是四地。九地,每一地都是这九种烦恼,但他表现出来的特征不一样。破除了「粗惑」,即证得阿罗汉。&#13;第二种：证得了阿罗汉果位以后,他法执全在。怎么法执呢？首先还有我执啊，首先还有我之外的山河大地这些无情物啊！他都把它当成真实存在,这也叫「尘沙烦恼」,也叫「细惑」。打个比方,怎么叫细惑呢？我们平时好吃好发脾气,这叫「粗惑」。比如说好吃,好吃肉,好吃鱼,我们戒掉了,不吃了,可是闻到肉香呢,心里还想吃,虽然不吃,但心里想吃,这叫「细惑」,叫「习气」,这叫「尘沙烦恼」。那破除了这种细惑,这是打比方,你不要当真哦！闻到肉味不想吃了就破除了尘沙烦恼,破除了尘沙烦恼可以称为明心见性，叫灭除了一分灭相无明。&#13;第三种：那么到了明心见性的菩萨还要破除微细烦恼,叫「微细惑」。粗惑、细惑、微细惑,怎么叫微细惑呢？还以吃肉为例：明心见性的菩萨他闻到肉味了,是不是？但他已生不起想吃肉的念头来了,但是他还能闻到,这就叫『微细惑』。所以慢慢地到最后连肉味现前,他都闻不到肉味了,就到无分别心了,大家明白吗？你成究竟圆满如来！我们通过打比方把这三种惑的等级在这里做个观照,一定要注意,比喻不可以当真！你可别说,「我现在闻不到肉味了,我已经是佛了」！是不是？哈哈哈！&#13;【令我早登无上觉,于十方界坐道场。】&#13;这也是发的方便菩提心。意思是使得我早日登上究竟菩提、究竟涅槃、究竟如来这个果位。&#13;『早登无上觉』,这个『登』是究竟圆满成就,</strong><strong>『无上觉』不可以解释为最高觉、第一觉。『无上』,无上无下,无前后左右内外,无空无有。心外无法,法外无心。所以这个『无上』也可以解释为阿弥陀佛—「无」就是『阿』,「上」就是『弥陀』,「无」是无相之实相,「上」是有相之实相啊；以一法代万法,也是讲『如是我闻』—「无」就是「如」, 「上」就是「是」；也可以解释为「虚妄」—「无」就是「虚」,「上」就是「妄」。虚无虚无,无形无相,上妄上妄,上和妄用别教来讲,当下就是无就是虚的体现。&#13;【于十方界坐道场】,这是究竟如来的果位。它不是今天在这里坐道场,明天在那里坐道场,成了佛以后当下一念是不是就在十方坐道场啊？明心见性的人在见道位是不是也比同于在十方坐道场啊？知道十方万法都是我,你就是在坐道场,就是在教化众生。所以佛在《法华经》讲：赞叹一句《法华经》,即为供养一切佛。即为供养一切佛是不是即为十方坐道场啊？一切佛包括佛菩萨、天人鬼畜、一切众生,供养是不是就教化他们呀？要明白这个道理。&#13;【舜若多性可销亡,烁迦罗心无动转。】&#13;『舜若多性』这是讲虚空,虚空之性都可以销亡。按照世间法呢,虚空是不可以销亡的,是不是？这是打比方。即使虚空可以销亡,我成佛度化众生的心都不会动转,当然在事实上,虚空也是由我们的心变化出来的。你不能讲它销亡,也不能讲它不销亡,是不是？我们要现就现,要销就销。在世间法来讲,虚空不可以销亡,谁也不能咬他一口,谁也不能踢他一脚,是不是？&#13;后面讲的「舜若多神」</strong><strong>,众生位如果讨厌有形有相的肉团身,想要证虚空身,那就是虚空神。他有个灵体在这里,没有形相,可他就是在！所以舜若多性呢,我们把他分开区别。还有个「虚空藏菩萨」,那是菩萨在读懂了《法华经》《楞严经》,明心见性以后,他也跟虚空神一样证得虚空身,外形都是一样,可是里面境界不一样。舜若多神他证到虚空身也是福报啊,他不受苦了！他福报满了以后还要往下落,所以舜若多神是有福报的鬼王之类的。但虚空藏菩萨他只会往上升,究竟成佛！他不会往下落。四空天的天人也可以视为舜若多神、天神。『烁迦罗』翻译成汉语是「坚固」的意思。『烁迦罗心无动转』,我坚固的菩提心不会动摇！</strong></div><div>"
  },
  {
    "title": "文字版｜九观解读《心之力》（全集）",
    "html": "<div class=\"B1_text\"><div class=\"text-center\"><strong><strong>科学开路，九观解读《心之力》之一</strong></strong></div><div class=\"text-center\"><strong>——印广门清法师主讲</strong></div><div class=\"text-indent\">这次法会的主题，是宣讲毛主席写的一篇论文，叫《心之力》。我们要从九种不同的角度来解释毛主席的这篇旷世之作。为了体现我们法华道场一贯的讲经原则，我们从哲学、科学的角度，把佛法、道家、儒家、耶稣、马列主义、毛泽东思想，以及日常生活，通通圆融，通通贯通。这是佛的教导，佛讲依法不依人；也是我们共产党和共和国的原则，以法治不以人治。</div><div class=\"text-indent\">今天第一课，我们不讲佛，不讲菩萨，不讲马克思，不讲毛泽东，就以科学、哲学开头，把佛怎么讲的、毛主席怎么讲的、儒家怎么讲的、道家怎么讲的，贯通起来。每一个环节你们都要举手表决，投赞成票或反对票。投反对票的同修也功德无量，你们是帮助我们了解情况，改进教学方法。所以不要有顾虑，修行人直心是道场。如果你不懂装懂，你要受报应；如果你懂却装不懂，你也要受报应。我们必须老老实实。大家要有这个思想准备。</div><div class=\"text-indent\">今天讲课的主题——从「波粒二象性」看宇宙本来面目。现代科学进入量子力学以后，科学家通过对物质的分解而发现波粒二象性。我们通过桌面这些道具来展示说明什么叫波粒二象性。（桌面上依次排开四个茶杯、四个茶杯盖）：</div><div class=\"text-indent\">第一个茶杯，代表的是诸佛菩萨、天人鬼畜、牛马猪羊、小爬虫、乃至细菌，也就是所谓的动物界，有情界；</div><div class=\"text-indent\">第二个茶杯，代表的是树木花草，植物界；</div><div class=\"text-indent\">第三个茶杯，代表的是山河大地，矿物界。地水火风，水包含在河里面，火与风包含在物质里面；</div><div class=\"text-indent\">第四个茶杯，代表粒子，是一切物质的基本组成单位。</div><div class=\"text-indent\">科学家从粒子开始研究，把粒子最基础的组成单位，概念为分子。第一个茶杯盖代表分子；分子又分成原子，用第二个茶杯盖表示；越分越细，到第三个茶杯盖，把电子、质子、中子通通包含在里面；第四个茶杯盖，表示中微子，夸克。</div><div class=\"text-indent\">科学家在研究中微子的时候，突然电脑屏幕上一片空白，接着出现了波动性，这叫波粒二象性。就相当于，科学家看电脑屏幕时发现怎么粒子没有了呢？人家（以一根晃动的绳子代表波动性）说：我在这里呢！也就是说，这些无情的固体物出现了波粒二重性。粒子是无情的，是不动的，就跟一粒微尘一样，叫粒子性；变成波动性，没有粒子了，只是看到一种光在波动，是这两重性。当科学家一愣神的时候，粒子性隐蔽，而波动性显现；当科学家回过神来发现，粒子怎么变成波动性了？好了，当下波动性隐蔽，又显现为粒子性。它就好像在捉弄、调戏科学家一样，随着科学家的心在变化。所谓「屏幕波动，粒子即隐。粒子再现，波动即隐。时隐时现，捉弄我人。」</div><div class=\"text-indent\">这个波粒二象性，问世已经一百多年，科学家只知其然，不知其所以然。胆小的要吓出神经病来，胆大的给它做了个结论，叫边缘科学。什么叫边缘科学？你不能讲它是科学，也不能讲它不是科学。你讲它是科学的话，传统的科学不承认物质是精神；你讲它不是科学，那它的精神活动是在科学实验室发现的。也有的把它叫做非物质次原子论。你不能讲它非物质，也不能讲它是物质。讲它是物质的话，它确实有精神活动；讲它非物质的话，它又是物质。讲次原子论也是一样的，不能讲它是原子，也不能讲它不是原子，叫次原子。</div><div class=\"text-indent\">其实，科学家到这里已经解决了一个问题，也就是在粒子象与波动象之间，他愣是什么也看不见，那这是什么象？是不是就是空象啊？就是空象啊。但是你说仪器上出现的空象，科学家是不会承认的。</div><div class=\"text-indent\">我们再从哲学层面来辩证看待这个问题。我们刚才（看这些排列好的茶杯和杯盖），从前面四个茶杯到后面四个茶杯盖，一个一个按顺序来观照：前面四个茶杯是谁生的？是第一个茶杯盖生的；第一个茶杯盖是第二个茶杯盖生的；第二个茶杯盖是第三个茶杯盖生的......一步一步依次来看，是不是后后生前前，前面是后面生出来的？是的。</div><div class=\"text-indent\">前面都有老爸老妈，那到了波粒二象，有没有老爸老妈？有！其实科学本身已经解决了这个问题，只是不承认而已。不承认没关系，我们用哲学来推论，波粒二象应该有源头对不对？如果没有源头的话，哲学推理就不能成功。</div><div class=\"text-indent\">没有米能不能做饭？没有源有没有流？没有树根有没有树木？如果讲波粒二象没有源头的话，哲学通不过，科学也通不过。谁能煮无米之炊？谁能取无源之水？谁能生无本之木？这是不可能的事情。所以，我们可以顺藤摸瓜、顺水推舟，推断出波粒二象的源头就在这里（用一个保温杯表示）。这个保温杯代表什么也没有，代表空、真空。</div><div class=\"text-indent\">那么到了（保温杯）这里，根据我们自然而然的推论，叫波粒三象性，这就是空性。虽然科学家不承认，但是我们通过哲学推理出这个空，把它作为波粒第三象，叫波粒三象性。我们再想一想，前面茶杯、杯盖和绳子，代表一切的万法，是不是都是这个保温杯（空性）变出来的？既然都是空性变出来的，那能不能说那些东西都是这一个保温杯（空性）？</div><div class=\"text-indent\">认为能的人举手，好，扣五分！</div><div class=\"text-indent\">认为不能的人举手，好，也扣五分。</div><div class=\"text-indent\">认为也能也不能的人请举手，好，扣十分！</div><div class=\"text-indent\">它当下就是能，当下就不是能；当下就是，当下就不是。前面的三种说法都是错误的。所以啊，天上天下，千古以来，障碍就障碍在这里。</div><div class=\"text-indent\">既然是它（空性）变出来的，变就是千变万化，你不能讲就是空性，无分别不妨分别；那变来变去都是空性现出来的，你也不能讲不是空性。当下就是，当下就不是。所以波粒二象性也好，波粒三象性也好，讲当下就是一个东西，已经是双重含义。</div><div class=\"text-indent\">比如说印广法师就是话筒，这句话当下是双重含义：你不能讲我不是话筒，也不能讲我就是话筒；也不能讲，话筒也是我，我也是话筒。只能讲，我当下就是话筒，我当下就不是话筒。这四种境界，分别代表大乘佛法「藏、通、别、圆」，我们要搞清楚。</div><div class=\"text-indent\">由此我们知道，万法都是空性变现而有。因为是变，所以不能讲就是空性；因为是现，也不能讲不是空性。要把这个道理刻骨铭心地搞明白，这就叫波粒四象性。波粒四象性把前面三象全部圆融在一起。</div><div class=\"text-indent\">我们这是讲科学、讲哲学推理，不涉及到佛法、道法、天主......也都不涉及。只需要自性智慧的认可。一定要相信，真理就在生活中，真理就在我们心里，真理就是我们的自性，我们的自性就能认识真理。谁认识真理，谁就是真理的化身！</div><div class=\"text-indent\">告诉大家，我们讲佛法是真理，讲马列主义是真理，讲毛泽东思想是真理，绝对不是因为它是佛讲的，是马克思讲的，是毛泽东讲的，而是因为他们讲对了！因为这个真理经得起科学的验证，经得起哲学的推理，更重要的是能被我们的自性智慧所认可。</div><div class=\"text-indent\">接下来，我们把这个理论与各党各教各派来一一对号入座。学过佛法的人都知道，这里的空性，就是阿弥陀佛的「阿」，就是如是我闻的「如」；这里的波动性，就是阿弥陀佛的「弥」，如是我闻的「是」；到了粒子，从中微子、中子、质子、电子、原子、分子，到泥巴瓦块、山河大地、树木花草、诸佛菩萨，这些东西，就是阿弥陀佛的「陀」，如是我闻的「我」。波粒二象性实际上就是我们的真心本来面目，在各个不同的时空点，来帮助我们认识真理。</div><div class=\"text-indent\">如果没有这样的认知，认为肉团身就是我，这就是我执。明白了这个道理，知道「陀」是通过「弥」变，通过「阿」现的，也就是明白了「阿弥陀」，在佛法里，就叫解脱了。为什么解脱了？你把我执破除了。</div><div class=\"text-indent\">你原来在执着这个「陀」，就知道我我我，是不是内心很纠结、很沉重？就像结实的泥巴球、铁球、铜球，这些实心球能不能往上飞？明白了这个道理，原来都是这个「阿」现出来的，也就是明白了「空」的道理，是不是就把这个我执化掉了？化掉了就像气球一样，飞到天上，甚至成圆满佛了。</div><div class=\"text-indent\">有人说打坐成佛，打坐能成佛吗？那还是个鬼呀！圆顿大法叫坐鬼窟窿。当然，证得了「阿」，这个鬼也是解脱了的鬼，但还是自了汉。明白这个道理以后，还要从「空」出来，回空向有，行菩萨道，这个时候才是阿弥陀佛！这是与佛教对应起来。</div><div class=\"text-indent\">我们再看《心之力》，与毛泽东思想来对应。《心之力》第一段就是讲：「宇宙即我心，我心即宇宙。微细至发梢，宏大至天地，皆为思维心力所驱使。」这里全部都对应起来了。从中微子开始，反推到山河大地、天人鬼畜，是不是宇宙啊？「宇宙即我心」，心在（保温杯）这里，这是真心，都是它现出来的。怎么现出来的？「皆为思维心力所驱使。」是它（波动性）变出来的。这是第一段。</div><div class=\"text-indent\">《心之力》后面还有一段：「佛曰：心生种种法生，心灭种种法灭。」当我们观照到空性这里的时候，它是不是寂灭啊？它是没有任何形相的寂灭，所以说「心灭种种法灭」，过去的种种妄想分别都没有了。「心生种种法生」，怎么法生呢？——哦，我还要出来，还要为人民服务。叫做菩萨从空出有，愿身再来。</div><div class=\"text-indent\">跟主席的话来对照。主席讲：「我将无我，不负人民。」从前面的茶杯、茶杯盖、波动（统称弥陀）到了空性（阿）这里，是不是「我将无我」啊？「不负人民」，就是出来度众生。当到了「我将无我」的时候，就证到了空性，即使是个自了汉，也已经解脱，再也不用六道轮回了。再从空出有的时候，就是菩萨出来度众生，成为圆满佛。</div><div class=\"text-indent\">与道家来对照。道家叫「大道无形」，是不是在空性「阿」这里？那「道生一，一生二，二生三，三生万物」是不是就是「弥陀」？</div><div class=\"text-indent\">与儒家来对照。大家知道王阳明四句教吗？「非善非恶心之体」，是不是在空性「阿」这里？善也没有、恶也没有，这是心的本体；「有善有恶意之动」，是不是「弥陀」？「知善知恶是良知」，知善知恶是不是开智慧了？致良知了；「行善断恶是格物」，行善断恶就是从空出有，为人民服务。</div><div class=\"text-indent\">再有张载四句教。</div><div class=\"text-indent\">第一句「为天地立心」。古人讲天是在上面的，地在下面。那「为天地立心」，立在哪里啊？就立在空性「阿」这里。为天地立心，不是仅为所有的人立心、为畜生立心，不是的，是为天地万法立心。天地万法的心到底从哪里来的？就是「阿」变出来的。</div><div class=\"text-indent\">第二句「为生民立命」。生民就是有情，生民的命立在哪里？必须立在天地间。不能把这个基础丢了，不然我们的命就像那个浪打浮萍一样没有根。把这个前提丢了，就变成世界观、人生观，变成人我是非了。自古以来，伟人、圣人都是从宇宙本体来认识世界的。</div><div class=\"text-indent\">第三句「为往圣继绝学」。「往圣」，过去凡是被称作圣人的，一定是认识了宇宙本体的规律。那什么是绝学呢？这些道理早就被讲出来了，释迦牟尼佛讲了，中国的老子也讲了，汉朝的董仲舒也讲了，孔老夫子也讲了，但现在却被束之高阁。圣人、伟人关于整个宇宙天地万法的哲学理念被丢开了，变成了世界观、人生观，变成了人文关系，连畜生都不认。我们现在知道了，畜生也好，泥巴瓦块也好，是不是我们多生多世的父母尊长儿女啊？是！我们丢下生生世世无量的父母儿女，只认今生今世的父母儿女，是不是自己自绝于自己啊？这个问题很严重啊！这样天下能太平吗？这不是一个两个人这样讲，而是所有的     圣人都讲得很清楚。这是张载讲的「继绝学」，我们这里每个人都要发心来当张载。</div><div class=\"text-indent\">我们把他的「继绝学」拿出来，我们没有创造，但是有发明、发现。我们发现了老祖宗的理论，要把它拿出来，我们不敢不拿。我们要把这个法，向党和政府汇报，要推向全中国全世界。不要在乎别人对我们怎么挖苦讽刺，什么邪师啊，魔头啊，胡说八道啊，疯僧啊，妖言啊......我们都不要计较，相反地我们还要理解他们、同情他们，并且更加感到我们肩上的担子任重道远，是不是？</div><div class=\"text-indent\">我们只想把真理赶快向全国全世界，向天上天下宣扬。不要在乎人家怎么样讲我们，怎么样对待我们，都不重要。那些讲我们的、障碍我们的人是谁啊？都是我们自己！他们在迷中，我们在悟中，我们不能以牙还牙。如果那样的话，我们怨恨了他，伤害的是谁啊？还是我们自己。因为这个「弥」在动啊，动来动去，首先受到感染的就是我们自己的皮肉筋骨。</div><div class=\"text-indent\">所以，任何人可以对我们不仁，我们不可以对任何人不义！我们要把他当成我们的父母儿女，对不对？不对！不是当成！本来就是！一个明白道理的人，他的这种觉悟、他的快乐、他的自在，是那些还没有明理的人，无法想象也无法认可的！别人认可不认可不重要，我们自己认可自己就行！</div><div class=\"text-indent\">张载第四句话「为万世开太平」。这个「万世」是无量的世。这个「世」字我们怎么解释的？三个十一横，每一个十，一横一竖。一竖，表纵向看世界，过去现在未来，无穷无尽；一横，表横向看世界，东南西北上下十方。一横一竖组成立体坐标，不是平面坐标。立体坐标在空间森罗万象，盘根错节天地万法。为什么「世」是三个十？我们今生今世是三世十方，来生来世、前生前世是不是都是三世十方？</div><div class=\"text-indent\">这个「世」字奇妙无比啊！我问一下，唐朝来的人请举手；三皇五帝时代的人请举手；九百八十万亿年前的那个人请举手；九万年前的那个乌龟王八蛋请举手；三千九百万亿年前的那个风啊、雨啊、雾啊，请举手......好，放下。所以过去现在未来、东南西北上下十方、天地万法、天人鬼畜、牛马猪羊、泥巴瓦块是不是当下就是一个东西啊？这叫无量寿，这叫无量光。现在你们真正明白什么叫无量寿佛、无量光佛了吧？可不是指头顶上发出的万丈光芒，这在《楞严经》上叫走火入魔；也不是指马上就能腾云驾雾了，鬼都会腾云驾雾，是不是？那不是真正的解脱。真正的解脱是开智慧、明理，明白我是谁，他是谁。我们首先要解脱，成圆满佛还要修百千万亿年，要破除习气。</div><div class=\"text-indent\"></div><div class=\"text-indent\"><div class=\"text-center\">^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</div></div><div class=\"text-indent\"><table cellspacing=\"0\" class=\"t_table\" style=\"width:98%\"><tr><div class=\"B1_text\"><div class=\"text-center\"><strong>科学开路，九观解读《心之力》之二</strong></div><div class=\"text-center\"><strong>——印广门清法师主讲</strong></div><div class=\"text-indent\">再与天主教对应。天主教说的圣父、圣灵、圣子，圣父是不是就是这里的「阿」？圣灵是不是就是这里的「弥」？圣子是不是就是这里的「陀」？耶稣教和天主教，是一个派系的，我们也要做如是观照。通过分别到无分别，去解决我们自身的解脱；再通过无分别到分别，菩萨利他，悟后进修，提升品位，圆满到究竟极果如来佛位。</div><div class=\"text-indent\">马克思在《马克思恩格斯全集》第一卷，叫《黑格尔哲学法的批判导言》里有讲：宗教是这个世界的总的理论，是它的包罗万象的纲领......这是不是就是万法的纲领啊？但是在马克思时代，因为地球人的觉悟，还不可能从宇宙本体论来全面铺开。他讲《共产党宣言》，是在十法界里的人道来宣传，在人道里他讲相对真理。毛主席讲《心之力》以后，又变成《毛选五卷》的「为人民服务」了。但是他们都是把理论基础放在前面，所以我们学习的时候一定不能把他们的理论基础丢开。</div><div class=\"text-indent\">佛当年跟他们不一样，佛当年是先讲分别法、小法，然后回到大法。所以圣人出世，也是要根据国情来确定自己的讲学方针。那到了现代，现代科学、哲学、精神文明、物质文明空前发展，给我们创造了一个机遇，是时候把古今中外圣人的研究，理顺贯通。这个任务就在我们法华人的肩上。</div><div class=\"text-indent\">因为大多数的国民，执着于圣人伟人，我们也是没有办法的办法，入乡随俗。我刚才已经讲了，真理，绝不因为是伟人圣人讲出来的，才成为真理，而是他们讲得符合实际情况，能够经得起我们自性智慧的认可。把这个法，通过与圣人伟人的理论相结合，叫返璞归真，回到本源上来看。回到本源，就是我们当时当地，我们现在，用我们的自性智慧，来认可这个真理！</div><div class=\"text-indent\">好，拜托大家鼓一下掌。鼓掌这个有形有相的动作，叫「陀」，包括有形有相的动物、植物、矿物、言语动作都在「陀」这里，表万法万象。鼓掌要不要通过脑袋指挥啊？要。就在「弥」这里，表思维心力。那在鼓掌之前，思维还没有动之前，鼓掌这个动作在不在？在哪里？就在「阿」这里，表空性。鼓掌是这样，吃饭、穿衣、唱歌、跳舞、打人、骂人，是不是都是这样？有没有不是这样的？没有。</div><div class=\"text-indent\">比如这个电灯光发出来的光是不是就在「陀」这里？电灯一开要不要电流？要，那就在「弥」这里。电流没有通，开关没有开的时候，没发出来的那个光和这个电流在不在？在，就在「阿」这里。我们知道在电里，但是那个电是怎么样的你知道吗？不知道。它任何痕迹都没有。</div><div class=\"text-indent\">一只狗汪汪汪地叫，是不是在「陀」这里？狗叫要不要思维啊？要，那就是「弥」。那没有叫的时候，汪汪汪的叫声在不在？在哪里？在「阿」这里。</div><div class=\"text-indent\">天地万法是无量的，思维也是无量的，这个空性「阿」既没有量，也没有数；没有形，也没有相，什么也没有。我们强词夺理把它叫做「一」。其实它不是「一」，可是不这样说，我们没有办法开口。所以天地万法「陀」，无非是由无量的「弥」在变，由「阿」显现。万法没有显现的时候，到底在不在啊？在。不在的话，它显现不出来。「阿」就是「如」，「弥」就是「是」，「陀」就是「我」，阿弥陀佛，如是我闻。你闻了没有？</div><div class=\"text-indent\">那么我们短短的这么几句话，通过我们现场来认证，再通过我们自性智慧，大家能不能认可阿弥陀佛、如是我闻？能不能认可宇宙即我心，我心即宇宙？能！所以说，假传万卷书，真传一句话。越是真理越简单！这句话是谁讲的？我们也不知道是谁讲的，已经成为老生常谈了，反正自古以来就这么讲的。我们不是用这句话来传法，只是用我们的体会来证实这句话是对的。不管是谁讲的，哪怕是鬼讲的，都是真理。明白这个真理以后，你还要去管是谁讲的吗？</div><div class=\"text-indent\">我想问大家，现在真正听懂天地万法都是一真之人、一念变现而已，深信不疑的人请举手！好，请放下！还没听懂，乃至还有疑惑的人，也请举手！有没有？没有。我们讲课要经得起十方三世一切有情无情、天地万法的共同验证！我们肩负重任啊！这个地球上几千年以来，枪炮连天，众生受了那么多的苦难，原因就在于迷惑颠倒。</div><div class=\"text-indent\">告诉你们，这个世界上，没有哪个特别地好，也没有哪个特别地坏。再坏再坏的人，他也不至于坏到——我要把全世界都消灭掉，就剩我一个人当老大。没有这样的人。人们相互之间的误解，仅仅是因为迷惑颠倒造成的。他不是真心要杀你，他是用迷惑颠倒来杀你，明白吗？所以我们想一想，如果我们把这个真理，向全世界宣传，人人都明理，怎么会有贪污腐败？怎么会有战争？</div><div class=\"text-indent\">那么明白这个道理了，你能证到什么果位？先用释迦牟尼佛的话来讲：明白这个道理，且生一念欢喜心，怎么一念呢？天地万法就是一个真人变出来的，蒙佛授记。你解脱了！毛主席讲，「精神一到，何事不成？」《心之力》上就有这句话。你们精神是不是到了「阿」这里？还有什么事不成啊？！王阳明讲，明白了这个道理，你「内圣外王」啊。   「内圣」，解脱的圣人；「外王」，你成为了伟人，今生你去教化众生。所以王阳明讲，天下的事情都可以谦虚，唯有明白这个道理，当下内圣外王，你不要谦虚！</div><div class=\"text-indent\">所以我们对照佛的标准答案，对照毛主席的教导，对照王阳明的理念，根据自己此时此地，你对这个宇宙的认识，能够毫不含糊、毫不犹豫，且认为自己已经解脱了的人请举手！好，请放下。认为自己还没有把握解脱的人，也请举手！好，有一个。</div><div class=\"text-indent\">首先，我要恭喜各位清净大海众菩萨，阿弥陀佛！这就是佛所讲的一步登天之法，无修无证，当下成就！但是我也要告诉大家，我们要成圆满究竟的佛果，还要修百千万亿年，还要不断地克服习气，我们现在只能是超越六道轮回。刚才有一位菩萨举手了，她说没有把握。我能不能请你告诉大家，你已经明白这个道理了，为什么还没有把握肯定自己解脱了呢？你告诉我们，功德无量，不要有任何的顾忌。</div><div class=\"text-indent\">请法者：阿弥陀佛！感恩师父！师父讲的法，我能听明白这个意思，但是我领会不了这个精神！我不知道自己......我自己不确定......</div><div class=\"text-indent\">师父回答：如果这样的话，你没有必要提问。因为你没有听懂，是不是？我说的是听懂的人，有没有把握解脱，对不对？我解释给你听。</div><div class=\"text-indent\">其实没有听懂的人，她也解脱了。为什么？因为第七识解脱了！你今天就是在这里打呼噜睡觉，把死人抬过来，都解脱了！我还要告诉你，这里的天花地板、桌椅板凳，通通都解脱了！</div><div class=\"text-indent\">下面，我来给大家解释为什么听闻如来藏大法，心里明白，生欢喜心，就解脱。刚才讲的，这是佛的教诲，是毛主席的教诲，是王阳明的教诲。但是这些伟人、圣人，他们并没有详细具体地回答为什么明白道理，无修无证，就当下解脱。不是没有回答，是没有具体回答。印广法师的回答仍然是根据他们的提纲来回答的，没有我自己的创造，我仅仅是来给他们帮腔而已。</div><div class=\"text-indent\">所以我们今天，不仅要懂得自己解脱了，还要懂得，为什么我没有修没有证，就这么嘻嘻哈哈就解脱了？你把这个道理搞明白，品位就在提升。我们大家都知道，气球能够把东西往上面带是不是？茶杯盖这么大的气球能不能把茶杯这么大的铁块带上天？不能。那么换一个像讲堂这么大的气球，能不能把这个铁块带上去？（能），回答正确！从无始到今生到现在，我们所造的诸恶业，再大再大，就算比天大、比地大，是不是总是个定量？可是我们的心是定量还是变量？是变量。我们的心随大现大，随小现小，随亮现亮，随暗现暗。我们的定业再大，就算是百千万亿个恒河沙数的大千世界那么大的业，它也是定数，是不是？定数再大，跟无限大的心量相比，是不是就是小不点啊？是。我们的心是无限大的，好好想一想。你仅仅回答一句「对啊」，你就解脱了。为什么？你的心已经随文入观，心量已经变大了。就像无限大的气球能不能把这个有限的小不点带走？能。</div><div class=\"text-indent\">当我们没有从波粒二象性、三象性，到四象性，到如来藏，到毛泽东思想中明白真理之前，我们的心量是不是就只有茶杯盖这么一点大？最多就是——我要做个好人，做个泥巴球；我要做个好市长，好省长，做个铁球；我要做个好总统、好国王，做个银球；我要当地球长，做个金球。即使是金球能不能往上飞啊？（不能）所以我们要懂得方便法再好再好，也只能得人天福报，当铜球、金球，仍然不能解脱。</div><div class=\"text-indent\">懂得方便法不能解脱，还要懂得为什么不能解脱。因为有我执啊！我要当一个好的地球长，我要让地球人都过好日子，好，你是金球，但你不能解脱。那个很平常的人，乃至是个强盗土匪，佛讲了，杀佛杀父杀母之人，坏得不能再坏的人、王八蛋，他一下明白这个道理——原来是这么回事啊！他心大了，当下把这个东西（实心球）是不是空掉了？我执是不是破除掉了？心大了的人，他想不成佛，有没有办法呀？没有办法。为什么？心大了，由不了你了。这个时候就是身不由己，由什么？由心，上去了。这就叫带业往生！</div><div class=\"text-indent\">再打一个比方。一个人从小生下来，到十岁、二十岁、一百岁，都是关在一个房间里。这个房间大小总是有限的，是不是？他的心是不是就这么点大呀？房间既没有窗户也没有门，他的心是不是暗的？有一天开门开窗，他往外面看一看，出去走一走，是不是眼睛一下子看到阳光了？而且还感到，原来天是这么大的呀！心量是不是大了？当他再被关进房间里的时候，还是这么大的房间，还是没有窗户没有门，这个时候眼睛看不到阳光，心能不能看到光？能！虽然身体受到很大的局限，心有没有被局限住？没有！这就叫菩提不退！</div><div class=\"text-indent\">所以有些人问：师父啊，我听你讲的时候是心开意解啊！可我回家以后，面对那些情况时该怎么办？这也就相当于，你听了印广法师讲课以后，心亮了；然后回到家里，等于从外面光明的地方再被关进房间里了，你的心是不是还是亮的？</div><div class=\"text-indent\">有些菩萨来问难，你说你们成佛了，怎么不腾云驾雾给我们看一看？怎么不千变万化给我们看一看呐？我们首先要告诉他们——成佛的标准不是腾云驾雾，不是千变万化，《楞严经》讲那些鬼魔都会。成佛的标准是解决心态的问题。比如我过去喜欢吃肉吃鱼，现在看到肉啊鱼啊不吃了，不吃就是证果了。证果没有什么特别的。我们知道对泥巴瓦块都要恭敬，这不就是证果吗？</div><div class=\"text-indent\">如果要讲神通的话，告诉你们，十法界里，人的神通最大，神仙鬼怪都不能跟我们比。比如说这杯水，我们人喝的是水，鬼看的是火，天上人看的是石头，神仙看的是琉璃，它到底是什么？什么也不是。把它看成是水，是我们地球人的同分妄见；把它看成是火，是鬼道众生的同分妄见。地球人跟天人是两个天体，地球人把地球当成地，把天当成天；天人呢，把他们的天当成地，把我们的地当成是天。所以我们看到天上人在飞，天上人看到我们也在飞。有些人就害怕那些个天人啊、神啊、仙啊，认为他们神通那么大，其实不是的。当然他们那里也有坏人，一个转身就可以把我们消灭掉。</div><div class=\"text-indent\">所以，各种不同法界的众生都用不同的同分妄见在保护对方，用各自的别业妄见来成就自己的化身，要明白这个道理。</div><div class=\"text-indent\">当然，如果有些人非要执着什么神通变化，像鬼神那样变化，我们也好解释。他非要执着这就是成佛的标准，那好，就算是成佛的标准，那么佛法里有一条：定业不可转。什么定业？你修了一百岁的寿命就是定业，不能转。为什么不能转？皮肉筋骨是劣质产品，它不是可以随便转的。将来往生的时候，我们的灵体当下离开这个肉团身，当下就出生在佛土。谁也不会像傻瓜一样留在这里，除非是愿身再来的菩萨，又当别论。那个时候不是六道轮回，而是愿身再来教化众生。将来肉身解体往生到极乐世界，我请问你，你是在这里成佛的，还是到了极乐世界再成佛的？（这里），回答正确！</div><div class=\"text-indent\">虽然你们鼓掌了，可是不能稀里糊涂地鼓掌，这个道理还要讲明白。比如说我们在座不少人都会游泳，你能不能到讲台上来游泳给大家看看？不能。那下午到游泳池去游泳，你们能不能？能。那我问你，你会游泳是在这里就会了，还是跑到游泳池才会的？在这里就会。</div><div class=\"text-indent\">所以修行证果，佛经上都是讲当下证果，是活人证果，是不是？有没有哪一尊佛、哪一部经讲，当佛宣布这些人成佛以后，一个个哗地全部死过去咯！有没有啊？没有！有没有哪一尊佛讲，当佛宣布这些人证果了，一个个地腾云驾雾千变万化？没有啊！可是我们现在把示现神通当作成佛的标准，把死了以后作为成佛的指望，这是不是佛法呀？这不是佛法，这叫魔法！</div><div class=\"text-indent\">还要解决一个问题。刚才讲说天花地板、小木鱼这些东西都解脱了，你们敢不敢相信？不仅相信，还要讲清楚为什么相信。我们还用现代科学来解释。</div><div class=\"text-indent\">前面讲了波粒二象性，这些粒子有没有精神？既然有，它有没有第七识？有。动物克隆，一滴猴子血能造猴子，猴子血有没有第七识？这些天花地板、桌椅板凳有没有第七识？有！第七识没有国界，它是通的。不管你承认不承认，它都是客观存在。所以为什么讲有磁场，还说磁场有好有坏？就是这个道理。你以什么样的心态对待人事环境，你就跟它结下了什么样的不解之缘，生生世世不相舍离。</div><div class=\"text-indent\">一个明白道理的人，他的第七识是光亮的，任何明心见性的人都是这样。你站在这里，这里解脱；风吹到身上，风解脱；阳光照到你，阳光解脱；雨点掉到你身上，雨点解脱；牛马猪羊看到你，牛马猪羊解脱。明心见性的人，走到哪里度到哪里！</div><div class=\"text-indent\">你们回去以后可以做个小实验。用两组苹果或者两组橘子，一组三四个。赞美其中一组：你真美呀！我真喜欢你！白马王子啊！我们生生世世在一起，肝胆相照……说尽好话。然后谩骂另外一组：你这个王八蛋，你这个扫帚星，你怎么不死啊，我的眼中钉肉中刺，你个王八蛋，快滚吧......怎么恶毒怎么来。用语言沟通，每天不少于三次，每次不少于15分钟乃至半个小时。一个礼拜以后来看这两组物品。受吉祥加持的，一定仍然保持光泽不坏；受恶语中伤的，一定霉变腐烂。或者把两份米饭分别放在两个房间里，贴上不同的标签，用不了一个月就会发生不同的变化。通过我们自己的实验证明，无情也是有情。</div><div class=\"text-indent\">科学实验也已经解决了这个问题。把一本书撕碎或者烧成灰，在科学的实验室里，通过这本书的一粒灰尘、一个碎片，就能把所有的内容全部还原出来。这就是芥子包虚空、虚空包芥子。这是从科学的角度来证实：我们讲了正法以后，天地万法都能得度。</div><div class=\"text-indent\">我们再回到佛的经典上。《法华经·见宝塔品》，说宝塔里面有一位多宝如来，然后释迦如来入其塔中，二如来在宝塔中结跏趺坐，是不是？佛在这品经讲，受持法华经的人，走到哪里，宝塔就建到哪里；在哪里讲法，就是在哪里建宝塔。如果我们依文解字的话，现在这么多受持法华经的人，那这个世界上光建宝塔都没地方建了！你们现在明白什么叫《见宝塔品》了吗？这个茶杯现在懂得了波粒二象性、波粒三象性、波粒四象性，懂得了毛泽东思想，懂得了「心生种种法生，心灭种种法灭」，这个金刚种子它是不是接受了？这就是它的多宝如来，明白了吗？这个茶杯当下就是释迦牟尼化身如来。</div><div class=\"text-indent\">有些人可能还要问难：行啊，你这个印广真了不起啊！叫茶杯讲法给我听一听嘛。茶杯它能不能讲啊？能讲。但是我们和茶杯是不同的法界，我们没有办法沟通，没有办法沟通不等于它不能讲，这是第一。第二，虽然能讲，它只能对它那个依报世界的众生讲。那么将来，它也转变成有情世界。什么时候转变呢？比如说一万年以后，它的业报身转掉了，不管是变成灰还是变成什么，这个时候日月薄蚀精气，这些已经结过如来藏法缘的无情泥巴瓦块、树木花草，「出生国土」，《楞严经》是不是有这段话呀？那么再对照我们前面讲游泳的道理，它（茶杯）是一万年以后解脱的，还是现在解脱的？（现在），回答正确！</div><div class=\"text-indent\">所以我们要懂得、要珍惜，一个明心见性之人，他的价值、他的地位是多么不可思议！明心见性之人就是真理的化身，他担负着教育天地万法的重大历史使命！</div><div class=\"text-indent\">我们再来研究怎样由解脱到成就圆满究竟如来，这就决定了我们生生世世的修行，涉及到怎么样修、怎么样证的问题，是不是要深究啊？我告诉你们，要把你们乐死了——无修无证！</div><div class=\"text-indent\">有些人就问了：你这不是天方夜谭吗？我们要当一个省长、县长，当一个车间主任，都要费九牛二虎之力，成佛比登天还难，你说无修无证让人家怎么理解呀？是不是有必要讲解这个问题？首先我再三强调，记好：无修无证不是不修不证，而是最好的大修大证！无修无证叫无师自通，不用老师教的，叫无功用道——他没有用功夫、看不到用功夫，但他时时在用道。我前面讲过，看到一只狗来了，你不吃它、尊敬它，是不是证果了？是。并不是说，你要「南无狗菩萨，南无狗菩萨」地念，要不要念？要不要拜啊？要不要观照：嗯，这条狗八千年前是我老爸，九万年前是我老舅，生下我的时候怎么怎么……需要不需要？不需要！那是作秀，那是无病呻吟，那是故弄玄虚！</div><div class=\"text-indent\">不要说同事同修，即使过去伤害你的人、向你开枪的人，过一段时间以后，你想恨都恨不起来了，有没有这个现象？这就是证果！不少同修就是这样跟我讲，说师父啊，我现在怎么想恨人都恨不起来了？他是不是不知不觉就证果了？他成佛了他都不知道！所以明白道理的人，不是不修不证，而是自性流露，时时修、时时证，自己不着任何痕迹，是这个意思，大家明白吗？</div><div class=\"text-indent\"><div class=\"text-center\"><div class=\"text-indent\">好，上午的法会到此。</div></div></div><div></tr></table></div><div class=\"text-center\">^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</div><p style=\"line-height:nullpx;text-indent:0em;text-align:center\"><strong>科学开路，九观解读《心之力》之三</strong></p><p style=\"line-height:nullpx;text-indent:0em;text-align:center\"><strong>——印广门清法师主讲</strong></p><div class=\"text-indent\">下午我们继续研究怎样学习《心之力》。师父一共讲了五次《心之力》，每次都有新的发现、新的体会。每次讲解，我都感到心里非常激动。感慨毛主席，感慨中华民族的古圣先贤！人啊，真是不点不明啊。</div><div class=\"text-indent\"></div><div class=\"text-indent\">佛门内部有一句常话，叫做「菩萨下位不知上位，凡夫自位不知他位」。你只管传你的法，不要去管别人的闲事。就跟吃自助餐一样，饭店里几十种甚至上百种自助菜品，不管你去多少人，有没有看到过有两个人拿的饭菜一模一样？比如都是拿了几粒花生米、一勺黄豆，一块豆腐，半根香蕉，有没有？既然没有，每个人肯定都认为自己拿的最好吃，别人的不好吃，是不是？这就是我执。</div><div class=\"text-indent\"></div><div class=\"text-indent\">告诉大家，几千年以来，天上天下的悲哀就在这里！天上天下，古今中外，绝对没有两个人同时从妈妈肚子里出来，同时开腿走路，一二一，先左脚上前，然后右脚上前；绝对不会这一辈子走的都是同一条道路，吃的同样的东西，是不是？每一个人经历的社会环境、历史环境，自然环境、人事环境都是不一样的。生活在各种不同的时空点，我们要从各种不同的角度去看问题。</div><div class=\"text-indent\"></div><div class=\"text-indent\">而我们的特点都是「我觉得、我认为」。前一阵子我还跟禅宗的一位修行人探讨，他满嘴都是「我觉得、我认为」，我说，我跟你讲老实话，你再讲「我觉得、我认为」，我们就免谈。告诉大家，印广法师没有一句话是「我认为」！也没有一句是「我觉得」！要讲道理啊！明天我们要讲法华道场整顿改革，就要涉及到这些问题，要把毛主席的「调查研究」正式搬到台上来。千古以来天上天下，都是在搞「我觉得、我认为」，形成了无量自以为是的各种帮派。</div><div class=\"text-indent\"></div><div class=\"text-indent\">我经常讲，我们要学会调查研究，要懂得换位思考，要从全局看问题，透过现象看实质；在一个点看到全面，不是从某一个点来看问题。这种现象在我们法华道场内部也是越来越厉害，有些人狂妄得很啊！特别是学了如来藏大法的人，他特别容易狂妄，这个毛病要克服。学了如来藏大法的人更加应该谦卑，不要用百分之百绝对的眼光去看待一切的人！你不要去想象别人怎样怎样。天上天下，自古到今，悲剧就在这里。</div><div class=\"text-indent\"></div><div class=\"text-indent\">记得我父亲讲过一个笑话：有一个人请客，请了四个人，来了三个，主人讲「哎呀，该来的没来啊。」其他三个人如果「没有来就算了，我们吃吧。」这样不就啥事也没有了吗？结果其中一个人就多心了，说「我这个不该来的来了嘛。」说完屁股一拍走了。剩下两个人，这个主人又讲了一句话「哎呀，真是好玩，不该走的走了。」剩下的这两个人，其中一个人又讲「那我是该走的没走呢。」也走了。看他走了，主人就更着急了，说「我讲的不是你啊。」剩下最后一个人「对，不是讲的他，是讲我呢。」这样最后一个人也走了。</div><div class=\"text-indent\"></div><div class=\"text-indent\">所以我们今天在讲毛主席《心之力》的时候，首先要跟我执作斗争，把我执放下。可能你们都知道，凡是闹是非、闹矛盾，到我这里来告状的人，我没给任何人一个好脸色，不会说什么「你太了不起，那人是王八蛋，别跟他计较。」凡是到我这里来讲理的，都是没道理的，都是王八蛋。我们学如来藏大法的，你是谁？他是谁啊？当你感到你有理的时候，你就没有理，懂吗？</div><div class=\"text-indent\"></div><div class=\"text-indent\">这是没有道理的，印广法师是不讲道理的师父，我是不讲道理的道理。你只要跟我讲道理，你就没有理，你就忏悔去，好玩了是不是？你讲张三，张三跟你什么关系啊？他就是你！不是把他当成你，他就是你！你把他看成一团黑暗的时候，你已经黑暗了。我们的第七识是没有国界的。你有了别人不好的这个念，即使没有讲出来，你就已经在犯罪，为什么？你在污染其它第七识。《楞严经》讲「六交报」是不是啊？你看到人家犯错误，你要受报应；你听到人家讲坏事，你也要受报应；你自己起心动念都要受报应。这个法很厉害啊！但是反过来，也非常妙——你只管生欢喜心，那你一下就变成欢喜人；你只管把别人想得很好，你当下就好了；你总把人看成佛菩萨，你就是佛菩萨。他有没有成为佛菩萨与你没有关系，但你成佛了，懂吗？</div><div class=\"text-indent\">所以讲《心之力》就是这个力，既有正力，也有反力。成佛成菩萨靠你的心，下地狱也靠你的心，与别人是没有关系的！修行人只看自己，不看别人。要看别人的时候，你必须充满了无限的慈悲，无限的关爱，想着要帮他。虽然他在背后捅我刀子，可他来世怎么办？我要劝他，用各种办法来引导他。为什么？因为他就是你！讲第二义，他也是你以前多生多世的父母儿女，是不是啊？要明白啊！我们许多的讲经法师，特别要注意这个问题。</div><div class=\"text-indent\"></div><div class=\"text-indent\">那我们下午在正式开讲毛主席《心之力》这篇论文之前，首先做这么一个开堂白，来扫除一下我们的思想障碍。因为时间关系，我们只能简明扼要、提纲挈领，从九种不同的角度来研究这篇论文。</div><div class=\"text-indent\"></div><div class=\"text-indent\">第一个角度，从科学的角度来研究，也就是九观解读《心之力》的第一观，叫科学观。《心之力》的第一段话「宇宙即我心，我心即宇宙。细微至发梢，宏大至天地。世界、宇宙乃至万物皆为思维心力所驱使。」好好想一想这段话，我们上午在讲波粒二象性的时候，是怎么样对照的？</div><div class=\"text-indent\"></div><div class=\"text-indent\">（以四个茶杯来打比方）第一个茶杯代表有情，诸佛菩萨，天人鬼畜，小爬虫；第二个茶杯代表树木花草这些植物；第三个茶杯代表山河大地；第四个茶杯，代表从这些物质中提取出来的一个粒子，然后在科学实验室里进行分解。粒子由分子组成，分子由原子，原子由电子，电子由质子，质子由量子，量子由中子组成，然后到中微子，还有夸克。科学上有中微子和夸克的说法，我们把它们归纳为一个东西。这些都是有形有相的东西，这就是《心之力》所讲的「宇宙」。</div><div class=\"text-indent\"></div><div class=\"text-indent\">那么科学实验到达波粒二象性的时候，由中微子到波动性，科学就停止在波动性这里。哲学的特点就是逻辑推理，就是思维辩证，通过哲学的原理来辩证。哲学离不开生活，必须符合人之常情。我们用后后生前前，妈妈生儿子这个道理来打比方。波动性之前，我们都能找到它的源头；但是到了波动性这里，它的源头在哪里？一会是粒子，一会是波动性，它的源头在哪里？哲学和科学是来源于生活的，如果它没有源头的话，那就变成了无米之炊、无本之木、无源之水，变成了无母之子。无母之子可不是讲孤儿，孤儿也有母亲，而是说这个人不知怎么来的，这在生活中能不能讲得通？讲不通。这就是哲学推理，他一定有母亲。那么根据哲学和科学的原理，科学没有发现的东西，你不能讲它不存在，如果讲没有发现的东西就不存在的话，那科学永远不会有发明。</div><div class=\"text-indent\"></div><div class=\"text-indent\">5000多年前，中华民族，乃至世界还没有文字。大家知道文字是从哪里来的吗？（观众：心现出来的），你太伟大了！这么高深的问题，你一下就答出来了。回答很正确！但是这样回答，那些不信佛的人可要说我们胡说八道。从历史上来说，文字是那些文字专家创造出来的。远古时代，人类没有文字，靠结绳记事。要办什么事情，结一个绳打一个结，就记住了。</div><div class=\"text-indent\"></div><div class=\"text-indent\">最早是我们的老祖宗伏羲开始创造文字。中国最早的文字，就是伏羲八卦图，只是一个「一」，一长一短，这样排列。我们想一想，现在的百科全书、哲学科学、天文地理、语文数学、诗歌散文、唱歌跳舞、这个宗那个派、这个主义那个主义，都是从那个八卦图来的，后来到了周文王年代，周文王在牢房中演化周易，从那里又变现了许多道理出来。</div><div class=\"text-indent\"></div><div class=\"text-indent\">再比如动物克隆，如果在科学没有进行动物克隆实验之前，我们99%的人是不会相信的。你说猴子血能变猴子，别人会说你胡说八道。所以懂得哲学和科学思维的，都是大根基之人。人与人是不能相提并论的，永远都不要用「我认为、我觉得」去框别人。大家明白这个道理吗？可我们的特点，就喜欢用「我觉得，我认为」去框别人，这就是众生的悲哀。那么根据哲学辩证，以及科学实践的检验，我们推论出粒子和波动以外一定有个东西。</div><div class=\"text-indent\"></div><div class=\"text-indent\">幸亏我们的老祖宗在无量百千万亿亿年前就解决了这个问题。这个波粒二象性问世才一百多年，《道德经》是两千多年，儒家的理论问世是千儿八百年，毛泽东《心之力》问世也是一百多年，而佛法在无量百千万亿亿年前就指出来了。佛法讲这个东西就是「空」，是无形无相的东西，我们以这个保温杯来表示，你不要看这是个保温杯，它代表的是无形无相，要不然我们不好说明问题。佛讲这个，就叫「真如」，叫「真」，叫「如」，叫「自性」，叫「阿」，叫「空」，道家叫「大道无形」。我们看那个太极图就是表示大道无形，就是空的。</div><div class=\"text-indent\"></div><div class=\"text-indent\">毛主席讲「宇宙即我心」，「心」就是这里的空。不要以为「宇宙即我心」是在心脏这里。心、心脏、思维心、真心，我们要分别清楚。「宇宙即我心」，就在「空」这里；「细微至发梢」，粒子比头发丝还小，我们头发丝的万分之一可能达到中微子，这只是大概；「宏大至天地」，天地里就包括天人鬼畜等等等等，所有一切万物都包括了；「皆为思维心力所驱使」都是它（波动性）变出来的。所以《心之力》这第一段，我们注意不要把「宇宙即我心」的心，与思维心力混为一谈，一定要严格地区别开来。</div><div class=\"text-indent\"></div><div class=\"text-indent\">从物质讲到这里，是讲科学观；然后「皆为思维心力所驱使」，思维、辩证、驱使，这些是哲学的范畴，这就是第二观，哲学观。马克思也好，毛泽东也好，他们的科学社会主义原理，都是通过哲学辩证而来。恩格斯怎么讲的？「辩证法最初来源于佛教」。佛教问世是无量百千万亿年，我们想一想看，世界上的各种主义、各种思想，能够坚持多长时间？苏联人不信佛教，那苏联现在还有没有了？没有了。</div><div class=\"text-indent\"></div><div class=\"text-indent\">我们非常感恩毛主席，把这个宇宙人生的真理解释出来了。后面我们讲到佛教观的时候，还会提到《心之力》具体怎样来赞叹佛法。我们现在讲的科学观、哲学观，和毛泽东思想能不能挂上号啊？都对上去了吧？「宇宙即我心」对应粒子，表万法万象，「皆为思维心力所驱使」，对应波动性，这是波粒二象性；那么到了「空」这里，已经是波粒三象性了；而整体来讲，就是波粒四象性。三象性这里是真如，四象性是什么？就是真真如。「宇宙即我心」，是四象性；「我心」是三象性，「宇宙」跟这个波动是二象性。二象性、三象性、四象性，全部圆融在一起。</div><div class=\"text-indent\"></div><div class=\"text-indent\">所以到了「空」这里，是不是科学啊？这是超科学的科学，超哲学的哲学。不需要谁来给我们判定对不对，也不需要科学家来认可。需要他们来认可吗？不需要！我们自性的智慧就是这回事，你怎么样也跳不出如来佛的手掌心。科学家如果能够明白这个问题，这是人类最大的福报；科学家一旦明白这个真理，他就成为佛学家了。其实我告诉你们，科学家的老祖宗是真正的佛学家啊。</div><div class=\"text-indent\"></div><div class=\"text-indent\">爱因斯坦说：「如果世界上有一个宗教不但不与科学相违，而且每一次的科学新发现都能够验证它的观点，这就是佛教。」「如果有一个能够应付现代科学需求，又能与科学相依共存的宗教，那必定是佛教。」爱因斯坦在自传中还谈到，他不是一名宗教徒，但如果是的话，他愿成为一名佛教徒。可是现在的科学，却把科学与如来藏真理对立起来，认为信佛教就是信迷信，信科学就是正信。他们不知道科学的老祖宗就是佛教徒。这是在科学层面、哲学层面来研究这个问题。</div><div class=\"text-indent\"></div><div class=\"text-indent\">我现在检查一下，认为毛主席《心之力》完全符合哲学和科学的人请举手，好，请放下。我们是按照人类的一种习惯，从科学和哲学上来肯定一种主义，一种真理。《毛选五卷》停留在波动性这里，它用世界观、人生观来解决问题。所以毛主席《心之力》这篇论文特别重要，把究竟与方便圆融为一体。太伟大了！</div><div class=\"text-indent\"></div><div class=\"text-indent\">以前《心之力》并没有被拿出来研究，大家想一想啊，现在好不容易发现了《心之力》，我们应不应该向党和人民汇报啊？有些人担心我，说《毛选五卷》就已经是毛泽东思想，你这样提有没有政治风险？意思呢，胆子不要太大了。我跟他讲，你讲反了，我是最胆小的人，我是胆小鬼，当我明白这个道理的时候，我不敢不讲！如果不讲，我这一辈子都睡不着觉啊！他老人家的书就在这里，我们从哲学、科学上来研究，今天上午还从生活中的日常情理中来研究是不是？吃饭穿衣、唱歌跳舞，哪一样不是波粒二象性、三象性、四象性？哪一样不是「宇宙即我心，我心即宇宙」？如果讲细了，不是九观、十观，甚至十一观都有，你们自己去发挥。谁都不能够把一个真理，给讲绝了。</div><div class=\"text-indent\"></div><div class=\"text-indent\">我们要感恩主席啊！主席怎么讲？——要积极开展教义阐释，做好解经工作，注重宣讲最新解经成果。深入挖掘，跟那个挖掘机一样，深入挖掘教义教规中符合社会和谐，有利时代进步，健康文明的内容。对教义教规要做出符合当代中国进步发展要求，符合中国优秀传统文化的解释。也就是说，主席讲，对佛教经典、道教经典，马列毛等经典，都要重新解释。标准是，是否利于社会和谐，是否利于时代进步，是否有利于健康文明？就这个标准。</div><div class=\"text-indent\"></div><div class=\"text-indent\">我前面讲了，从远古那个八卦图这么简单的道理，演出了无量的东西，我们现在通过哲学的推断是不是很合理？还有人讲「你这个不该讲，那个不该讲」，什么该讲不该讲啊？只看讲得有没有道理，对党和人民有没有利，是不是？看到过主席这个理论的人请举手，这是千真万确啊！</div><div class=\"text-indent\"></div><div class=\"text-indent\">第三观叫宇宙观。宇宙观还是《心之力》第一段话，天地万法皆是我们的心变现的，大的小的、红的绿的，包括黄金白银、臭狗屎，这些东西有没有在宇宙之外？可是我们有些人连「牛屎狗粪无非诸佛法身真常，牛屎狗粪无非诸佛如来」都不敢认同。</div><div class=\"text-indent\"></div><div class=\"text-indent\">还有人讲：哎呀，那个印广法师邪都不知邪到哪里去了，这么庄严的事情讲得这么恶心。释迦牟尼佛在《楞严经》里讲泥巴瓦块、地水火风，皆如来藏妙真如性！泥巴瓦块是不是牛屎狗粪啊？讲得不客气一点，我这个肉团是不是牛屎狗粪啊？那么多的牛屎狗粪无量的，到哪里去了？都在这里（拍身体），懂吗？哪一个不是牛屎狗粪请举手。无量无量劫以来，那么多人鬼畜生的尸体、脓血大便、狗屎，到哪里去了？都在这里（指桌子、天花地板等）！天花地板，天人鬼畜，哪一个不是啊？我们无量的生生世世都是在天人鬼畜、牛屎狗粪中轮回。我们现在仅仅是感到如果变成牛屎狗粪太苦了，太糟糕了，变成牛马猪羊太苦了，所以我们要做个解脱了的人，做佛、做菩萨。</div><div class=\"text-indent\"></div><div class=\"text-indent\">那么做佛、做菩萨的原材料在哪里？就在「空」这里，真心本性！做佛、做菩萨、做鬼、做畜生、做黄金、做白银、做臭狗屎，原料都在这里。它没有任何形相，是性具功德。我们来世是变成佛菩萨，是变成黄金白银，还是变成牛屎狗粪呢，在波动性这里，思维心力。原料在真心本性，配方在思维心力，我们都在搞配方。你老想着真善美、光明，生欢喜心，那就变成佛菩萨、圣人、伟人、好人；你老想着贪嗔痴，起嫉妒心、怨恨心，那就变成牛马猪羊、牛屎狗粪，就是这个道理。这就叫我们开智慧，这就是破天机啊！我们眼睛里看的是牛屎狗粪，它是牛屎狗粪吗？说不定它看你才是牛屎狗粪呢。</div><div class=\"text-indent\"></div><div class=\"text-indent\">从毛主席这第一段话，我们就要明白，既然天地万法、宇宙世界，无所不包，谁敢把牛屎狗粪丢掉啊？为什么小法不能成就，小法修行人只知道「阿弥陀佛身金色」，有没有哪个讲「牛屎狗粪无等伦」？他把我们的命本丢了，牛屎狗粪是不是我们的命本啊？是。他丢了，所以不能成就。念佛法门不能成就是谁讲的？是《楞严经》里文殊菩萨讲的：大势至啊，你那念佛法门，「云何获圆通」？记好，你们不能加在印广头上来啊！印广仅仅是给文殊菩萨做帮腔。文殊菩萨为什么讲念佛法门不能成就？因为你只知道阿弥陀佛身金色、无等伦，你就不知道牛屎狗粪就是俺印广，是不是？大家明白这个道理了吗？</div><div class=\"text-indent\"></div><div class=\"text-indent\">我们都用水供佛吧？是佛要喝水，所以我们要用水供佛，对不对？如果佛喝水还要我们来供的话，他不是佛，我们才是佛呢。为什么要供水？大家看这一杯水是不是平的？我把茶杯放倾斜了，水还是平的。因为要修平等心，所以我们才供水。</div><div class=\"text-indent\"></div><div class=\"text-indent\">《楞严经》从最基础的泥巴瓦块讲起，我们供佛、供水就是要修恭敬心、平等心，要搞明白啊！特别是修念佛法门的同修们，你们不要烦恼。印广不是个坏人，不是来咒你们，是来劝你们，我们要懂得什么是佛才好念佛。佛是觉悟的意思，觉悟了什么？觉悟了波粒二象性、三象性、四象性，觉悟到毛主席讲的《心之力》，觉悟到天地万法、黄金白银、牛屎狗粪都是我们的心变现的，都是我们的真心本性。</div><div class=\"text-indent\"></div><div class=\"text-indent\">科学已经证实，无情也是有情。牛屎狗粪是不是有情啊？都是啊。这是一种爆炸性的、跳跃性的思维。当你明白这个道理的时候，叫一步登天！无量法门都是讲真善美，却不知道伪丑恶也是我。无量法门都是说要真善美，我们不要伪丑恶，我们要把它灭掉、断掉，能灭得掉吗？灭不掉的，都是我们的本性啊！我们仅仅是按真善美或者伪丑恶来搞配方，搞比例的问题，不存在灭谁不灭谁。——这是讲宇宙观。</div><div class=\"text-indent\"></div><div class=\"text-indent\">那么既然是这样，都是这一个空性变出来的，数学上有个叫等量代换，A=B，B=C，所以A=C。那么这个鬼等于空，他是空变出来的；人也等于空，大家都是空，那么人等于不等于鬼啊？等于。所以宇宙观就是讲万法不仅平等，而且都是一个本体。明白了这个道理，谁还忍心去伤害别人？你伤害了别人，是不是伤害了你自己啊？是。近水楼台先得月，你想伤害张三的时候，还没有伤害到张三，自己已经受到伤害，今生今世就有花报，来生来世是重报。今生今世你的生活怎么样都不会光明，一定是充满了黑暗，一天到晚想着算计别人。为什么今生今世得花报？近水楼台嘛，你这个意念发出来的时候，是不是要经过你的五脏六腑、皮肉筋骨，然后才传到对方？在对方还没有受到伤害的时候，你就已经受到伤害了，所以我们不能迷惑颠倒啊！</div><div class=\"text-indent\"></div><div class=\"text-indent\"><div class=\"text-center\">^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</div></div><div class=\"text-indent\"><div class=\"text-center\"><p style=\"line-height:nullpx;text-indent:0em;text-align:center\"><strong>科学开路，九观解读《心之力》之四</strong></p><p style=\"line-height:nullpx;text-indent:0em;text-align:center\"></p><p style=\"line-height:nullpx;text-indent:0em;text-align:center\"><strong>——印广门清法师主讲</strong></p><div class=\"text-indent\"></div><div class=\"text-indent\"></div><div class=\"text-indent\">我上午强调，学习法华如来藏的人，天下人都可以对我们不仁，我们不能对天下人不义！我想起了三国时的刘备，他的处世哲学：「宁愿天下人负我，我不负天下人。」他是不是菩萨再来示现？刘备看起来什么本事也没有。打仗，不像关羽、张飞那么勇猛善战；治国治军，不像诸葛亮那样足智多谋。但是，他有平等心，他与人为善，他这种磁场就团结了一大批精兵良将。所以读懂历史的人，他容易开智慧；读懂历史的人，对现实中的一切问题，他一看就知道。现实中发生的一切事情，都是历史的重演。所以我们讲「法眼净」，看到一件事情，就能够知道它的来龙去脉。这种功夫，是多生多世修来的。那么今生今世如果你能够真正读懂历史，你也能够成就个七不离八。</div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-indent\">我们大部分法华人对历史知识很贫乏，仅仅是学了印广法师的几句口头禅，就在那里拽，你拽啥呀？这种情况到最后形成什么局面呢？讲口头禅差不多，问具体问题的时候，狐狸尾巴就露出来了。这不是真印广，是假印广。所以我劝各位，特别是讲经的老师，在研究佛法的时候，要研究一点国学，研究一点中国历史，比如《春秋战国》《孙子兵法》《史记》《资治通鉴》，还有《三国演义》《红楼梦》《水浒》《西游记》，这四部名著，都要看看。这些书没有几个人看得懂，很多都是来看热闹的。把这几部书读懂了，你不成佛，也成仙。我是讲看懂，不是叫你看热闹。你看热闹不行，那要下三恶道去。</div><div class=\"text-indent\"></div><div class=\"text-indent\">《心之力》第一段，就解决了科学观、哲学观、宇宙观这三观。这三观打基础，三观打天下呀！这三观决定后面的六观，不管是佛教、道教、儒教，谁也离不开这三观，这叫依法不依人，依法不依佛，不依老子，不依伟人，不依贵人，不依圣人，只依法。佛是这样教导我们。我们今天在这里，是不是搞实践啊？从我们自己的、现前的身口意来实践开始，启发大家认知。</div><div class=\"text-indent\">真正的圣人、伟人，都要我们追求真理，依法不依人，不要搞迷信。如果搞迷信，现个好人，你得福报；现个恶人，把你害死了。不管你出身的好坏，只看你讲的话对不对，能不能经得起我们的自性智慧来验证。我们从科学观、哲学观、宇宙观，能不能验证毛主席讲的这段话就是真理啊？是绝对真理。我们要想在全世界实现共产主义，非毛泽东思想不可，非科学观、哲学观、宇宙观总结出来的这个颠扑不灭的真理不可！</div><div class=\"text-indent\"></div><div class=\"text-indent\">我们的根本就在这前三观，下面六观有没有都无所谓的，前三观就奠定了我们的世界观、人生观。后面的这几观，是为了满足一些人的好奇心，一些执著，也防止一些不同意见的人来问难我们，所以提出来研究。</div><div class=\"text-indent\"></div><div class=\"text-indent\">第四观，从世界观来研究这篇论文。在论文的第12页到15页，有比较详细的论述。前面讲了宇宙即我心，讲了宇宙世界，也提出世界观的问题，那么在第14页论述得比较具体，这段论文我们一读就懂，我们就提纲挈领地说说。《心之力》的世界观就是天下为公，要公平，要帮助弱小的民族，而不是欺负他们。宇宙之间为公的、为劳苦大众的，一定是光明的、正义的，否则就是邪恶的、黑暗的。他讲了外国人怎么样来欺负中国人，特别强调，邪不压正，正义一定会战胜邪恶，被压迫的民族和人民要敢于斗争。  </div><div class=\"text-indent\"></div><div class=\"text-indent\">以汉族为主体的中国人，自古以来都是安分守己的。一些少数民族打到我们家门口来了，我们才采取措施。我们汉族人这种不欺负人、安分守己的品德，是最优秀的。汉族人虽然不欺负人，但是只知道享乐，不会去居安思危，把一切人想象得非常单纯，所以在历史上屡屡吃大亏。唐朝那么强大，却被安禄山这个少数民族发动的安史之乱，搞得狼狈不堪。宋朝最富，富敌全球，北宋、南宋先后因为几个游牧部落的侵扰而灭亡，宋朝汉人被杀了将近1个亿啊。后来的日本人更加猖狂，到中国来杀人就像割韭菜一样，完全没有人性！</div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-indent\">我再三强调的是，我们要居安思危，我们要担负起教化众生的责任！这也是涉及到我们世界观的问题，不要欺负人，但是防人之心不可无。有些人讲，你是佛家呀，讲慈悲为怀啊，你怎么还在讲种族矛盾、什么你杀、我杀的？这个法能不能讲啊？能！佛家也是支持正义的战争的。如果外国人来侵略我们，我这个70岁的老人带头上前线。为什么？我们不能当佛呆子，我们用战争反对战争，就会保护更多的人免于战争。你不能做佛呆子：哎呀，我前世欠你的嘛，来，砍脑袋吧！不能这样。你那样也叫还债？那叫以一还一。你要杀我，我把你砍掉，防止你杀更多的人，这叫以万还一，我还为你积了功德，帮你减少了罪报，大家明白吗？</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">学佛法要懂得辩证法，我杀一个人是为了活更多的人，这是不是讲世界观？否则大家都不去抵抗，跟那汉奸卖国贼一样，那你生生世世给人家做牛做马，人家想杀你就杀你，你对得起祖宗、对得起儿女吗？对得起如来家业吗？</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">第五观，用人生观来解读这篇论文。我们打开《心之力》第34页到35页。看第一段，「男者为国家肌体」。这句话意味深长啊！你就是国家的栋梁，国家靠男人撑起来呀！不是仅为了自己养家糊口，那是小人。男人男人，就意味着你要把这个天撑起来，让我们的祖国强大起来，让广大的人民安居乐业。在座的男子汉们有没有这样的雄心壮志？你有了这个雄心壮志，就基本成就了，问题是你是不是真有？</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">范仲淹小时候，有一次叫人家给他算命看相，说你看看我能不能当宰相啊？那个相面先生：去！这么大的小孩儿口出狂言！他以为范仲淹不知道天高地厚。范仲淹又讲，你不要发脾气啊，我没有其它想法，那你看我能不能当一个医生啊？这位算命先生感到很奇怪：这么个小孩儿，一会儿气壮如牛，一会又胆小如鼠，就问，你到底怎么回事？你讲给我听一听。范仲淹说，我没事，我如果能当宰相的话，我一定要让全国的劳苦大众过上好日子；如果当不上宰相，我能当一个医生的话，我要尽量让那些受苦的人不要受苦。这位算命先生听了，拍拍他的肩膀说，你的命不要算了，你将来一定是帝王将相！范仲淹就是发的这个心，他只是为人民好。所以他一生出将入相，把自己一生的工资专门来供养三百户平民百姓，自己每餐吃一点玉米糊加几个咸菜豆。这就是我们的宰相！</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">范仲淹是苏州人，那时宋朝的首府在开封。等他告老还乡的时候，人家船夫不给他开船过江，说他什么行李也没有，这风大浪高的，船怎么过江啊？还是范仲淹自己有智慧，搬来许多石头压住船才过了江。他临死的时候，棺材都买不起啊！还是左邻右舍出钱把他安葬了。我老家如皋就有一个范公祠，有塑像在那里。这样的人生生世世得到人民的爱戴。</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">读过《岳阳楼记》的人举手。《岳阳楼记》是谁写的？范仲淹。其中许多话非常感人。在庙堂之上，他一定想的是劳苦大众；在荒山野外，他一定想的是朝廷，为什么？考虑朝廷的这个政策是不是有利于人民。「先天下之忧而忧，后天下之乐而乐」，这两句话千古传颂啊！你说他不是菩萨，他是谁啊？我们不能忘记老祖宗！他们走的时候都没有留一分钱的存款、没有置一寸的房产给后人。修行人，特别是我们法华人，对照对照范仲淹，我们作何感慨？！</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">作为修行人，我现在给你们提出来，你们现在就要考虑：你能不能做到，你临走的时候所有的钱财全部都供养了三宝、供养了劳苦大众？不要等到以后你明白过来的时候，就已经迟了。你把钱财留给人民大众，你要感恩人民大众；留给三宝，你要感恩三宝，而不是人民感恩你，也不是三宝感恩你。为什么？你是种自己的福田。这个道理你们要搞明白啊！搞不明白你是自己害自己。</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">我们讲波粒二象性，到最后是不是都是这一个「空」啊？都在这里（指代表空性的保温杯），从空出来的时候，天人鬼畜、小爬虫、泥巴瓦块、伟人圣人、佛菩萨……都有啊！你要当什么，就在于你现在！抓住当下！现在抓住当下，你无量生生世世的福报，现在就搞定！</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">所以我们现在法华道场内部真的要整顿啊！出家人也好，在家人也好，在我们法华道场，搞名闻利养、搞山头主义的有的是！你将来害了谁呀？害你自己！如来家业不差你几百、几千、几万乃至几百万，可是你就差这么多功德。我们要叫劳苦大众解脱，首先自己要解脱！</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">这就是世界观。从《心之力》论文，再加上范仲淹这些豪言壮语以及范仲淹一生的传奇，都在印证一个问题：真正的佛菩萨，他一定是言行一致的正人君子！有些人，即使他为劳动人民做出了贡献，可以成为人民英雄，但是不能成为人民领袖，不能成为佛菩萨，明白吗？一般来说，人生观跟世界观分不了太清楚。世界观决定人生观，人生观决定世界观，二者是这样的辩证关系。</div></div><div class=\"text-center\"><div class=\"text-indent\"></div></div><div class=\"text-center\"><div class=\"text-indent\">第六观，叫外交观。怎么样去搞外交？你们打开看《心之力》第18到29页。外交观，就是强调在外交的过程中要坚守国家的尊严，要爱国，不要当卖国贼。</div><div class=\"text-indent\">第七观，是革命观。现在我们有些人一听到斗争，一听到革命就很反感。我们重点看看《心之力》第35页，这一段讲得非常慷慨激昂：「天之力莫大于日，地之力莫大于电，人之力莫大于心。阳气发处，金石亦透。精神一到，何事不成？改朝换代，为民谋福，惩治贪墨汉奸，又有何难！」革命很简单，轻而易举，特别是革我们自己的命，你当下就能把它革掉，当下就能把一个自私自利、很无用的人变成一个顶天立地的英雄、佛菩萨。所以说「阳气发处，金石亦透。精神一到，何事不成？」这是不是就是无修无证啊？</div><div class=\"text-indent\">释迦牟尼在法华会上说，弥勒菩萨，你看这么多人听我讲了十来分钟的《如来寿量品》，就有多少人证到罗汉，多少人证到住、行、向位菩萨，多少人证到十地、等觉菩萨，有没有啊？十来分钟，谁修了？谁证了？现在许多人还以无量劫以来传统的那种习气来看待革命、看待修行，认为这怎么可能啊？可是佛是这样讲，毛主席也是这样讲，儒家的圣哲也是这样讲。这个世界上，伟大的就是精神。精神一变，什么都变。用王阳明的话来讲，叫「格物」。「格物」，就是革命。正确的理论一定会成就的！</div><div class=\"text-indent\">讲如来藏大法，自古以来都是命若悬丝。传这个法的人，命都保不住的。佛当年在世就有5000人退席。我们今天已经发展到这个局面，我们正在向全中国、全世界宣传弘扬真理。想想我们的前辈老佛爷，他开始传法的时候，当年只有五个比丘。佛在灭度的时候讲啊，我灭度2500年以后，如来正法才能在喜马拉雅山北部震旦国现前！震旦国是哪个国家呀？中国。2500年是什么时候啊？当下。而且他讲，如来正法在中国现前以后，很快就会席卷西方，整个地球到达佛法顶点！到达佛法顶点是干什么？地球人实现共产主义！</div><div class=\"text-indent\">今年是佛历2563年，减去佛在世80年，是2483年，距离佛讲的「灭度后五百岁」还有17年。按照《心之力》讲，精神一到，金石为开，何事不成？我们不是从现在开始的，我们传这个法已经18年了。如果按照老佛爷后五百岁的预言，我们应该在17年之后实现共产主义！</div><div class=\"text-indent\">所以我想问一问在座各位：你们这次来干什么的？来参加晚会的吗？来听印广吹大白牛的是不是？各位想一想，我们都是当年法华会上再来人！你们信不信？我们是带着老佛爷的遗嘱，带着我们的担当，我们都是禀天命而来！我们在今后的17年，记好，还有17年，我们一定要实现共产主义！</div><div class=\"text-indent\">我们不仅要感受到老佛爷和《心之力》的鼓舞，而且要理解《心之力》讲的何事不成啊！问题你精神到了没有？我们今天讲的波粒二象性、三象性、四象性，你们说精神到了没有？</div><div class=\"text-indent\">第八观，留学观。这个本来讲不讲无所谓的，但现在我们的留学很成问题，所以必须要讲一讲。我们看第23页第一行：「留洋者志不可晦。」留洋的人，你心里啊不能含含糊糊的，不能黑暗，你是要有使命感的。干什么？去把外国的那些先进的科学技术，你要好好地学回来。学回来不是要打人家，而是要让我们强大起来。论文这里是不是讲得很清楚？</div><div class=\"text-indent\">同时也要学习西方优秀的传统文化，不是一无可学啊！现在物欲横流、世风日下，我们应该尽我们的责任，对我们的儿女、对亲朋好友、对社会要起到正能量的教育。希望我们每一个人都要对党、对共和国、对人民、对领袖无比忠诚、无比热爱，要爱我们的国家，要爱我们的人民、爱我们的党，好不好？（好）。我们不能麻木啊！希望我们法华人个个都要像印广法师一样，对党、对国家、对人民无比地忠诚！</div><div class=\"text-indent\">第九观，宗教观。我们看第一段，是不是讲的如来藏？因为大家都是学佛的，这里就不多讲佛法。那么涉及到其它宗教观，道家讲的「大道无形」，是不是就是「我心即宇宙」中的「我心」？「我心」没有形。「道生一，一生二」，是不是自己的思维心力？「二生三，三生万法」，是不是这里讲的「宇宙」？对上号了没？</div><div class=\"text-indent\">跟耶稣教、天主教对应，「我心」是不是「圣父」？「思维心力」是不是「圣灵」？「宇宙」是不是「圣子」?</div><div class=\"text-indent\">与王阳明心学对照，「我心」是不是「非善非恶」？「思维心力」是不是「有善有恶」啊？「至善至恶」是不是觉悟？「行善断恶是格物」，「行善断恶」是不是就是毛主席讲的革命？</div><div class=\"text-indent\">再与张载横渠四句教相对应：「为天地立心」，是不是「宇宙即我心」的「心」？天地是不是宇宙？宇宙即心；「为生民立命」，就是上面讲的世界观，叫我们要怎么样怎么样正义啊！「为往圣继绝学」，对应这句话的后面就更多了，我们《心之力》论文第30页，第一句话就是：「千古圣人教化为根」。千古圣人是不是往圣啊？教化为根是根本；再看第37页，第二段倒数第二行，「佛曰：心生则种种法生，心灭则种种法灭」。这是不是为往圣继绝学？这个绝学我们哪个朝代继下来了？「替万世开太平」，是不是实现共产主义？是不是进入佛土啊？</div><div class=\"text-indent\">我们现在还叫佛教吗？全国人民从上到下都知道，佛教佛教，佛教我们不要贪钱财，要奉献劳苦大众，那还需要我讲吗？谁不知道啊？可是谁都这样睁一只眼闭一只眼，装聋作哑！我们想一想，现在叫佛教吗？叫全国人民来判别到底是不是佛教！大家都能判别，可都在装聋作哑，都在明知故犯！出家人为了钱财、为了官位，你还叫出家吗？出家出家，没有家，家都没有，你还要什么钱？还要什么官？你还想解脱吗？</div><div class=\"text-indent\">佛教还有正教与权教之别。权教也讲行善积德，它能安定社会，但是不能觉悟众生。权教讲的是伦理、道德、信仰的问题。正教讲哲学、科学、真理从真实的角度揭示天地万法来龙去脉。</div><div class=\"text-indent\">我们平心而论地想一想，如果都按照释迦牟尼佛的如来藏法，按照王阳明的四句教，按照张载的四句教，按照《心之力》，中国，乃至世界，怎么可能有贪污腐败？这个世界上怎么可能有战争啊？这是我们救命的法宝！</div><div class=\"text-indent\">好，法会到此圆满。谢谢大家！</div><div class=\"text-indent\">我们还是在《红梅赞》的歌声中结束，唱这首歌要用心来唱。</div><div class=\"text-indent\">以下为《红梅赞》歌词：</div><div class=\"text-indent\">红岩上红梅开，千里冰霜脚下踩。</div><div class=\"text-indent\">三九严寒何所惧？一片丹心向阳开。</div><div class=\"text-indent\">红梅花儿开，朵朵放光彩，昂首怒放花万朵，</div><div class=\"text-indent\">香飘云天外。唤醒百花齐开放，高歌欢庆新春来。</div><div align=\"right\"><div class=\"text-indent\"><div align=\"right\">2019年10月2日</div></div></div><div align=\"right\"><div align=\"right\">讲于江阴普照寺</div></div><div align=\"right\"></div></div></div><div>"
  },
  {
    "title": "一心三藏的奥秘心想事成",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>一心三藏的奥秘心想事成/strong></h2><div>一心三藏的奥秘心想事成。一般世人能悟透这个成语的道理，大都明白，一切事物的出现，无非先从心想生。想都不曾想过的，想也不敢想的，永远也不会有任何成就。人们常常讽刺挖苦很多人对一些事情痴心妄想，殊不知痴心妄想也会产生相应的境界与结果。人的心念，想法是非常可怕，有意思的一件事情。佛家说，十法界依正庄严，皆是心变识现。现在科学已经证明了，追溯到物质的最小成份，就是无形无相的波动，而这种神奇的波动，竟然就是念头！佛早在一部《般若波罗密多心经》中揭示了宇宙的真相：五光十色，纷纷扰扰的大千世界，不过是一场电影。我们的真心就像电影的屏幕，它本身是不生不灭，不垢不净，不增不减的。绝不会因为因为电影情节里的潮起潮落，沧海变桑田，斗转星移或者是大火，爆炸，流血，山崩地裂而实有生死，污染与大小变化。这就是诸法空相，色空不二的含义。但是遗憾的是大多数人会为境界所转，不知道自己本来面目如如不动。人生的悲欢离合，得失荣辱，生老病死都是电影的镜头，虚妄的情节而已。所谓说缘起性空，本来就没有这些东西。但众生的烦恼和痛苦就在于太执着这些随缘合和，缘起缘灭的妄想形成的电影。不明白我们的真心本来面目中的空性法义。这里有一点很重要。我们心里所变现出来的十方法界，天地之间的万事万物又离不开这种空性。这就是空而不空。空而又不空才是我们的真心，才是我们的本来面目。如来藏，如来藏，就是这样。故说凡夫执有，邪禅执空。执空执有，都是有漏。般若智慧告诉我们，我们不能被有形有相，有情有义的事物迷惑，因为被迷惑就有痛苦，就有烦恼，就有轮回的折磨;也不能执着于自性空相，因为你也无法安住在空相中，你这种执着去苦证所谓的空相也是一种折磨。万法空而不空，是也不是。你悟性打开了，明白了，天地万法就是一个人一个念所变现。空也是你，不空也是你，空不空都是你，才是真理。佛所开示的一心三藏的三个法义：空，不空，空不空。你需要用心去观照这种智慧：一个“心”字，心上有三个点，一个代表空性实相，一个代表色蕴之有，一个代表空有不二。三个小点诠释三个不同的伟大法义，当下又是一。哪个也不可分割，不可抛弃，不能否定。这就是我们的真心，就是如来藏。汉字历来神秘，字音藏义，字形藏理，你看，这个“心”生动地解读了一心三藏的奥妙。如此，你彻底明白了如来藏的道理之后，正所谓古诗词中描写的那样：前不见古人，后不见来者，念天地之悠悠，独怆然而涕下。这个涕下，在这里是表示你会感慨不已。原来天地万法就是我一个人瞎折腾！世间所有的烦恼，仇恨，战争，疾病，灾难;所有的敌人，冤家;一切杀盗淫妄酒，种种无穷无尽的痛苦，彻法源底，都是自己给的，都是内心种种的无明分别，无始劫以来的执着中变现，感召的。如果很唐突地告诉你，天地万法都是你，哪有别人？都是自己。打死你都不会相信。小偷之所以成为小偷，是因为他认为，别人就是别人。只有拿了别人的，才能成就自己的;菩萨之所以成为菩萨，是因为菩萨懂的，众生与我，同体大悲，自一无二。所以佛家说，智慧不起烦恼，慈悲没有敌人。这些话，说得很简单，也许是苦涩无味。但真理就是这样。既然你相信了心想事成，你相信了一切都是心所变现。那么我们把心量扩大，圆其心智，将心之念力频率调到佛菩萨的正能量轨道上来。当你不再执着于无明昏暗，生命不会低端;当你断然抛开了浅见，无穷无尽的宇宙空间，和诸佛净土之奥秘，都会现前！阿弥弥佛！</div></div>"
  },
  {
    "title": "心识是一切物质的基础——现代科学印证如来藏真理",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>心识是一切物质的基础——现代科学印证如来藏真理</strong></h2><div><i class=\"pstatus\">本帖最后由觉悟当教于2015-5-13 09:37编辑</i><div class=\"text-center\"><div class=\"text-indent\"><strong>大纲：</strong></div><div class=\"text-indent\"><strong>一、量子论</strong></div><div class=\"text-indent\"><strong>二、超弦理论</strong></div><div class=\"text-indent\"><strong>三、全息理论</strong></div><div class=\"text-indent\"><strong>四、意识能量级</strong></div><div class=\"text-indent\"><strong>五、宇宙是众生的同分妄见和别业妄见</strong></div><div class=\"text-indent\"><div class=\"text-indent\"><strong>六、印广法师开示如来藏和弦理论</strong></div></div><div class=\"text-indent\"><strong>一、量子论</strong></div></div><div class=\"text-center\"><strong>【视频】量子科学家发现：心念时刻都在改变世界，你怎么对待世界，世界怎么对待你，世界本来是一体，一切都是自作自受</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=b0151kt3n8p&amp;attstart=0&amp;attend=338&amp;exid=k0&amp;showend=1&amp;title=%E9%87%8F%E5%AD%90%E7%A7%91%E5%AD%A6%20%E4%BD%9B%E6%B3%95&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><strong>从动物克隆技术，由猴血造猴，羊血造羊，从物质的分子到原子，再由质子、中子、电子和夸克，物理学家在最后观照到夸克的时候，原先坚固的物体已经显现为一种波动，而且这种波动很奇怪——当物理学家想观测它的波动性的时候，它就呈现出波动性。当物理学家，想观测它的粒子性的时候，它就呈现出粒子性。也就是说，这无情的物质能随着人的心来攀缘。所以这些法使我们想起佛当年所讲的“无情也是有情”。有情无情可以互相交换，而有情无情、天地万法就是一个人一个念变现出来的。</strong><div class=\"text-center\"><strong><img id=\"aimg_LB99F\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203104ca9daaa0am9m606f.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203104ca9daaa0am9m606f.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"343\"height=\"503\"style=\"\"></strong></div><strong>佛法、科学，其实只是两个名相，因此，你可以说佛陀说法</strong><strong>49</strong><strong>年，讲述的是全宇宙（十法界）的“科学”，也可以说爱因斯坦的老师、量子理论之父——普朗克博士，讲述的是现代人易懂易信的物质的“佛法”。当量子理论诞生之后，科学和佛学在我们这个时代微妙地会合。我们已知的世界真实存在吗？还是它仅仅只是我们用意识创造出来的虚拟空间？这看起来很像是唯心论的论调，但这却是很多前沿科学家将人类神经科学和量子力学结合起来后提出的问题，为了解答这个问题，科学家创立了生物中心论，虽然这个理论还没有被主流思想所接受，但不能质疑的是，它为我们认识自身和所生活的这个世界提供了一个独特的视角。【生物中心论：神经科学与量子力学的结合】视频地址<a href=\"http://url.cn/RfRtcx\"target=\"_blank\">http:<p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>普朗克：世界上根本没有物质存在</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>爱因斯坦的老师、量子理论之父——马克斯·普朗克博士，1918年获得诺贝尔物理学奖。他感叹道：“我对原子的研究最后的结论是——世界上根本没有物质这个东西，物质是由快速振动的量子组成！”他进而剖析说：“所有物质都是来源于一股令原子运动和维持紧密一体的力量，我们必须认定这个力量的背后是意识和心智，心识是一切物质的基础</strong><strong>。”</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>为真理献身，令人肃然起敬的科学家！</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>普朗克本人是一个不情愿的革命者。其成就的深远影响在经过多年以后才得到大家的公认，他的学生爱因斯坦对此起了最为重要的作用。20世纪20年代以来，普朗克成为德国科学界的中心人物。他的公正、正直和学识，使他在德国受到普遍尊敬，具有决定性的权威。纳粹政权统治下，他反对种族灭绝政策，并坚持留在德国尽力保护各国科学家和德国的物理学家。为此，他承受了巨大的家庭悲剧和痛苦。他凭借坚忍的自制力一直活到89岁。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong><img id=\"aimg_c85S7\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203113r4gdl28gzp222da9.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203113r4gdl28gzp222da9.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"354\"height=\"353\"style=\"\"><img id=\"aimg_xmWg5\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203118wgvvshycc5gaix77.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203118wgvvshycc5gaix77.jpg\"lazyloaded=\"true\"style=\"\"_load=\"1\"width=\"349\"height=\"443\"></strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong>【图：普朗克年轻、年老时照片】</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>这与佛陀的论述的“一切唯心所现”不谋而合。《楞严经》云:“诸法所生，唯心所现，一切因果，世界微尘，因心成体。”“不知身色，外洎山河，虚空大地，咸是妙明，真心中物。”没有物质，只有心的振动、觉性的频率！心识决定了物质的构成！这是多么伟大的科学发现！普朗克博士发现：振动频率高的成为无形的物质，如人的思想、感觉和意识（佛法里叫高级有情）；振动频率低的成为有形物质，如看得到的桌子、椅子、泥巴瓦块等等（佛法里叫低级有情）。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>要说哪一种现代科学理论最神秘莫测，“量子论”假如排第二的话，没人敢排第一。</strong></p><div class=\"text-indent\"><strong>量子论研究的是微观粒子世界中的现象。这一理论的核心内容，主要包括海森堡的“不确定性原理”、波恩的“概率解释”以及玻尔的“互补原理”。它们都是如此的诡异，能彻底颠覆你对世界的认知。</strong></div><div class=\"text-indent\"><strong></strong></div><div class=\"text-center\"><strong>text-indent:2em;<img id=\"aimg_1694\"aid=\"1694\"src=\"forum.php?mod=attachment&amp;aid=MTY5NHw4NWM5ZmZhMHwxNjE3Mzc0NzUzfDB8NTE5&amp;noupdate=yes\"zoomfile=\"forum.php?mod=attachment&amp;aid=MTY5NHw4NWM5ZmZhMHwxNjE3Mzc0NzUzfDB8NTE5&amp;noupdate=yes&amp;nothumb=yes\"file=\"forum.php?mod=attachment&amp;aid=MTY5NHw4NWM5ZmZhMHwxNjE3Mzc0NzUzfDB8NTE5&amp;noupdate=yes\"class=\"zoom\"onclick=\"zoom(this, this.src, 0, 0, 0)\"width=\"575\"inpost=\"1\"onmouseover=\"showMenu({'ctrlid':this.id,'pos':'12'})\"lazyloaded=\"true\"_load=\"1\"initialized=\"true\"style=\"\"><div class=\"tip tip_4 aimg_tip\"id=\"aimg_1694_menu\"style=\"position: absolute; z-index: 301; left: 737.5px; top: 3668px; display: none;\"disautofocus=\"true\"initialized=\"true\"><div class=\"xs0\"><p><strong>QQ图片20140827203408副本.jpg</strong><em class=\"xg1\">(140.92 KB,下载次数:442)</em></p><p><a href=\"http://www.fahua123.com/forum.php?mod=attachment&amp;aid=MTY5NHw4NWM5ZmZhMHwxNjE3Mzc0NzUzfDB8NTE5&amp;nothumb=yes\"target=\"_blank\">下载附件</a>&nbsp;<a href=\"javascript:;\"onclick=\"showWindow(this.id, this.getAttribute('url'), 'get', 0);\"id=\"savephoto_1694\"url=\"home.php?mod=spacecp&amp;ac=album&amp;op=saveforumphoto&amp;aid=1694&amp;handlekey=savephoto_1694\">保存到相册</a></p><p class=\"xg1 y\">2014-9-7 16:14上传</p></div><div class=\"tip_horn\"></div></div>text-indent:2em;</strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>玻尔说，粒子的状态非常奇特。它有时候是粒子，有时候会变成波，这叫“波—粒二重性”。</strong><strong>转换的关键在于意识，当你观察它时，它就变成粒子呈现在你面前；当没人观察它时，它就变成波弥漫于整个空间。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>这段话要怎么理解呢？波是虚无飘渺的东西，不是实体，而粒子却是实在的点状物体。“互补原理”的意思是说，当没有人看粒子的时候，它就不是实在的东西，而是幽灵般的波；但当你一睁开眼睛，所有的幻影立刻消失，它马上变成一个实在的粒子，让你能够看到它。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>我们眼中的宏观世界是由粒子组成的。如果每一种粒子都是有人观察时才是实在的，没人观察时就只是一种虚幻的波，那么由它组成的整个世界应该也是如此。世界是意识显现的吗？</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>“唯物论”在19世纪曾一度成为公认的主流世界观，但现在已经被物理学家们广泛怀疑。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong><img id=\"aimg_UMTMF\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203132dsxr11g9sv1rhvqh.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203132dsxr11g9sv1rhvqh.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"226\"height=\"200\"style=\"\">&nbsp;&nbsp;<img id=\"aimg_e879F\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203139j2ux67adzztk8um2.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203139j2ux67adzztk8um2.jpg\"lazyloaded=\"true\"style=\"\"_load=\"1\"width=\"226\"height=\"282\"></strong></p><div class=\"text-center\"><div class=\"text-indent\"><strong>在早期人们提出“物质”概念的时候，认为它是实在的东西，所以才会用“质量”来衡量它的多少，言下之意是：质量大物质就多，质量小物质就少，没有质量就没有物质。</strong></div></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>但后来这种观念被彻底打破了。首先是物质可以转化为能量，能量也可以转化为物质，而能量是虚无的；然后又发现有些粒子没有质量，比如光子、夸克、胶子。这样一来，物质的实在性就已经很值得怀疑了。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>近代的科学也印证了能量和物质间的关系，最有名的就是爱因斯坦的E=mc2（E是能量，m是质量，c是光速）。科学早已揭示出，宇宙间万物的本质是能量，一切都靠能量的转变而运作。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>量子论进一步加深了人们对于物质实在性的怀疑。“不确定性原理”说，粒子是不确定的，假如它是实在的东西，怎么可能没有确定的状态？“互补原理”说，在你看的时候，它是粒子，不看的时候，它会变成虚无缥缈的波，实在的东西可能这样么？</strong></p><div class=\"text-indent\"><strong>宇宙大爆炸理论更是直接否定了唯物论。在宇宙诞生之前什么也没有，没有时间、空间，也没有物质和能量。假如物质是真实的，那么在宇宙诞生之前它们到哪里去了呢？怎么可能凭白无故变出个真实的宇宙来？（</strong><strong>参见文献《现代科学十大未解之谜》）</strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong>视频:量子论MV&nbsp;&nbsp;霍金参演</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=g0151ixxyia&amp;attstart=0&amp;attend=207&amp;exid=k0&amp;showend=1&amp;title=%E9%87%8F%E5%AD%90%E8%AE%BAMV%E9%9C%8D%E9%87%91%E5%8F%82%E6%BC%94&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></strong></p><div class=\"text-indent\"><strong>二、</strong><strong>超弦理论</strong></div><div class=\"text-center\"><strong>【视频】科学家首度发现人类的灵魂是超弦</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=z0139ngyi1b&amp;attstart=0&amp;attend=288&amp;exid=k0&amp;showend=1&amp;title=%E7%A7%91%E5%AD%A6%E5%AE%B6%E9%A6%96%E5%BA%A6%E5%8F%91%E7%8E%B0%E4%BA%BA%E7%B1%BB%E7%9A%84%E7%81%B5%E9%AD%82%E6%98%AF%E8%B6%85%E5%BC%A6&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>弦理论是理论物理的一个分支学科。弦论的一个基本观点是，自然界的基本单元不是电子、光子、中微子和夸克之类的点状粒子，而是很小很小的线状的“弦”。弦的不同振动和运动就产生出各种不同的基本粒子。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>虽说弦理论是物理学上的学说，但我们用佛法仍然可以将弦理论解释清楚，这显然说明佛法与物理学息息相关。在我们看来，物理学上将弦理论解释的让人难以理解，佛法简单几句话让人大彻大悟，这正是佛法的奇妙之处。</strong></p><div class=\"text-center\"><strong><strong><img id=\"aimg_msQYu\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203146mphst4tty0mz47wt.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203146mphst4tty0mz47wt.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"268\"height=\"300\"style=\"\"><img id=\"aimg_Ff8TU\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203147n4sm4fmf53l4ff53.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203147n4sm4fmf53l4ff53.jpg\"lazyloaded=\"true\"style=\"\"_load=\"1\"width=\"200\"height=\"199\"><img id=\"aimg_hdFU5\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203151ax7bu363xk0saxax.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203151ax7bu363xk0saxax.jpg\"lazyloaded=\"true\"style=\"\"_load=\"1\"width=\"200\"height=\"133\"></strong></strong></div><strong></strong><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>根据弦论，如果你用一架超级显微镜来窥探基本粒子的内部，那你所看到的将是空空如也的景象。如果你能再把放大倍数提高十亿个十亿倍，你就会看到在中心处有一根振动着的弦。如果用力弹拨这根弦，它的振动就会发生变化。质子说不定会变成一个中子。再弹拨一下，它说不定会变成一个电子。事实上，如果用适当的力度来弹拨它，它会变成任何一种已知的亚原子粒子。组成物质世界的所有的基本粒子，都是宇宙弦的不同振动模式或振动激发态。正如小提琴上的弦,弦理论中的宇宙弦可以作某些模式的振动，弦的不同频率的振动对应于不同的质量和能量的。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>&nbsp;&nbsp;</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>“宇宙是由宇宙弦组成的大海。基本粒子就像是水中的泡沫,它们不断在产生,也不断在湮灭。我们现实的物质世界,其实是宇宙弦演奏的一曲壮丽的交响乐。”(参见B.</strong><strong>格林著《宇宙的琴弦》）</strong></p><div class=\"text-center\"><strong>&nbsp;&nbsp;<img id=\"aimg_Z0WtF\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201409/07/164603slvav84bbiyijqbg.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201409/07/164603slvav84bbiyijqbg.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"500\"height=\"400\"style=\"\"></strong></div><div class=\"text-indent\"><strong>那么再反过来，也就是说，这一切的固体是不是由振动产生的？正反是不是一个道理？，因此就帮助证明了佛讲的，天地万法都是一个人一个念变现的。</strong></div><div class=\"text-indent\"><strong>我们这个念不就是振动吗？所以我们种种的妄想心，思想在动态，最后成就为天人鬼畜、风云雨雾、泥巴瓦块、太阳、星星、月亮、山河大地。但是科学家他只知其然，他不知其所以然。那么科学家认为就是一种振动，振动出了天地万法。他们这种设想是很有道理的，可惜他不能用佛法的心法来理解。</strong></div><div class=\"text-indent\"><strong>那么我们还要研究，这个振动之前它在不在？也就是说这个振动之前，没有发生振动的时候，振动在不在？这个就要靠智慧推断。肯定是在，如果不在的话，它怎么能振起来？！我们常说，“巧媳妇难为无米之炊”，“水必有源，末必有本”。那么振动在没有振动的时候振动就在，虽然在，它却没有振动，虽然没有振动，它是真实存在，这就是我们的心；振动了就是识，意识的识，佛法的一个基本规律叫“识变心现”。</strong></div><div class=\"text-indent\"><strong>用阿弥陀佛来讲，就是阿弥陀佛的“阿”（没有振动，却真实存在），振动就是“弥”，“弥”就是意识心在振动。一振动呢，这个无形无相的“阿”因为振动，就变现出“陀”，这个“陀”就是天地万法、佛菩萨、天人鬼畜、泥巴瓦块，一切有形有相的东西都叫“陀”；“陀”是通过“弥”振动出来的。振动，是没有振动之前它就存在，通过振动把无形无相的那种“阿”，变现出有形有相的“陀”。所以现在科学家的这种研究方法，他倒过来从“陀”开始研究，分分分分……小小小小……最后发现“陀”变成了一种“弥”,就是振动。</strong></div><div class=\"text-indent\"><strong>所以我们应该感恩现代科学，帮助我们明心见性。因为这个真理是佛发现的，如果是鬼发现的就叫鬼法，如果是牛发现的，叫牛法。不能因为是佛讲出来的它就是真理，而是因为佛发现了真理。真理是客观存在的，真理就是真理，不管谁发现的，它都是客观存在的。所以我们追求真理必须人人平等，佛菩萨、天人鬼畜、妖魔鬼怪、科学家、牛马猪羊、都要平等。所以现代科学、科学家，如果能把佛法研究起来，我们这个世界的发展，会大大地加快。</strong></div><div class=\"text-center\"><strong>【视频】意念让手指变长的新闻报道(凤凰卫视)</strong></div><div class=\"text-center\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=g0151ahjkhz&amp;attstart=0&amp;attend=90&amp;exid=k0&amp;showend=1&amp;title=%E6%89%8B%E6%8C%87%E9%95%BF%E9%95%BF%E7%9A%84%E5%AE%9E%E9%AA%8C(%E5%87%A4%E5%87%B0%E5%8D%AB%E8%A7%86)&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong>超弦其实就是意识</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>有人会说,把物质世界看是宇宙弦演奏的一曲交响乐,不正是与物质的对立面-意识有些相同了吗？是的。按照当前流行的观点，意识是完全基于物质基础(我们的脑)而存在，但意识不是一种具体的物质实在,因为没有人在进行脑科手术时在颅骨内发现过任何有形的“意识”的存在。我们都知道贝多芬的交响乐,可以用一套乐器把它们演奏出来。但这套乐器本身并不是交响乐。意识是大脑演奏的交响乐。这个图像为理解“心物一元”,即意识和物质的统一,开辟了新途径。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>有人还可能说,无论宇宙弦多小,无论人们能否观察到它们,宇宙弦总归是客观实在,它们是组成物质世界的基本单元,因此物质世界也应该是客观实在。此话不准确。组成物质世界的基本单元是宇宙弦的各种可能的振动态，而不是宇宙弦自身，就像组成交响乐的单本单元是乐器上发出的每一个音符，而不是乐器自身一样。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>在弦论之前，物质的实在性体现在组成客观世界的砖块是上百种原子，这些原子都是由质子、中子和电子等基本粒子组成。这些基本粒子都被当作是物质实体，都是组成物质世界的“超级砖块”，因而可以把物质世界看作是物质实体。在弦论之中，情况发生了根本变化。过去认为是组成客观世界的砖块的基本粒子，现在都是宇宙弦上的各种“音符”。</strong></p><div class=\"text-center\"><strong><img id=\"aimg_dFM07\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203218m1xli3ozfpg3l3po.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201406/30/203218m1xli3ozfpg3l3po.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"380\"height=\"285\"style=\"\"></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>有人会想：天啊，物质都不是客观实在了,那么世界上还有什么东西是实在的吗?回答是,有的。事物之间的关系就是实在的。我们根据二十世纪自然科学的进展,可以用关系实在来取代绝对的物质实体,即主张事物不是孤立的、由固有质构成的实体，而是多种潜在因素缘起、显现的结果。每一存有者都以他物为根据，是一系列潜在因素结合生成的。“现象、实在和存有被限定在一组本质上不可分离的关系结构中”（参见中科院院士朱清时《物理学步入禅境:缘起性空》）</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong>超弦理论证明意识不灭，灵魂就是超弦，人没有生死</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>据英国《每日邮报》报道，美国和英国的两位著名科学家提出了一项引人注目的理论，认为构成灵魂的量子物质离开神经系统而后进入宇宙时便会出现濒死经历。根据他们的理论，意识是大脑内一台量子计算机的程序，即使人死后，这个程序仍可以在宇宙中存在。这种现象可以解释一些人出现的濒死经历。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>这项类宗教理论由美国亚利桑那州大学意识研究中心负责人和麻醉学与心理学系教授斯图亚特-哈默罗夫博士提出，是基于他与英国物理学家罗杰-彭罗斯爵士提出的一项与意识有关的量子理论。根据他们的理论，人类的灵魂存在于脑细胞内被称之为“微管”的结构内。他们指出人类的意识活动是这些微管内量子引力效应的结果。这种理论被称之为“调谐客观还原理论”(Orch-OR)</strong><strong>。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>根据他们的理论，人类的灵魂是大脑内神经元细胞之间的交互作用。它们由宇宙内的基本物质构成，可能在时间诞生后就已经存在。这种观点与佛教和印度教的观点类似，即意识是宇宙的一个组成部分。此外，与西方的哲学唯心主义也有相似之处。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>哈默罗夫认为，在濒死经历中，微管失去了它们的量子态，但里面的信息并没有遭到破坏。也就是说，灵魂离开肉体，重回宇宙。哈默罗夫在纪录片《科学频道-穿越虫洞》中表示：“心脏停止跳动，血液停止流动，微管失去了它们的量子态，但微管内的量子信息并没有遭到破坏，也无法被破坏，离开肉体后重新回到宇宙。如果患者苏醒过来，这种量子信息又会重新回到微管，患者会说‘我体验了一次濒死经历’。如果没有苏醒过来，患者便会死亡，这种量子信息将存在于肉体外，以灵魂的形式。”</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>人类真的有灵魂？千百年来，这是人们一直都在争论的问题。科技发展到今天，我们已经由看得见的物质研究到了看不见的原子、质子、夸克到中微子。现在又发现了比中微子更小物质--超弦。科学家说，人类的灵魂就是超弦</strong><strong>。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>超弦是一种物理学理论，科学家们认识它不久。1968</strong><strong>年，嘉博略尔发现了弦的图形。此后，理奥纳特博士进一步理解为一小团类似橡皮筋那样可以扭曲抖动的有弹性的线段。后来科技界有了超弦理论。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>现在科学家们普遍认为，物质世界是由超弦的震动产生的。超弦是宇宙具有独立生命意识的最微小的生命体。人类的灵魂其实就是其中一种超弦。科技界终于触及到了灵魂的环节。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>超弦和灵魂学都揭开了物理科学神秘的一面。触及灵魂和多维空间，让我们可以到达一个全新的世界。或许可以通过超弦和灵魂学更加了解人类本身（参见文献《灵魂：超弦理论中的意识空间》）</strong></p><strong>三、全息理论</strong><div class=\"text-center\"><strong>【视频】心念与山河大地一体，一荣俱荣一损俱损</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=f0151ebmj7g&amp;attstart=0&amp;attend=435&amp;exid=k0&amp;showend=1&amp;title=%E5%B1%B1%E6%B2%B3%E5%A4%A7%E5%9C%B0%20%E4%B8%80%E8%8D%A3%E4%BF%B1%E8%8D%A3%20%20%E4%B8%80%E6%8D%9F%E4%BF%B1%E6%8D%9F%20%E5%90%8C%E4%B8%80%E6%9C%AC%E6%80%A7&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><strong>事物之间的关系就是任何一个事物当下就是宇宙全体，小即是大，大即是小，每一个事物当下即是另外的每一个事物，没有哪一个不是哪一个！</strong><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>在一九八二年时，一件惊人的事发生了。在巴黎大学由物理学家Alain Aspect所领导的一组研究人员，他们进行了一项也许会成为二十世纪最重要的实验。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>Aspect和他的小组发现，在特定的情况下，次原子的粒子们，例如电子，同时向相反方向发射后，在运动时能够彼此互通信息。不管彼此之间的距离多么遥远，不管它们是相隔十尺或十万万里远，它们似乎总是知道相对一方的运动方式，在一方被影响而改变方向时，双方会同时改变方向。这个现象的问题是，它违反了爱因斯坦的理论：没有任何通讯能够超过光速。由于超过了光速就等于是能够打破时间的界线，也就是时空不存在了。</strong></p><div class=\"text-center\"><strong><img id=\"aimg_wZtqs\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201409/07/164433tmewy4sei8wkkmhm.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"src=\"http://www.fahua123.com/data/attachment/album/201409/07/164433tmewy4sei8wkkmhm.jpg\"lazyloaded=\"true\"_load=\"1\"width=\"408\"height=\"417\"style=\"\"></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>这个骇人的可能性使一些物理学家试图用复杂的方式解释Aspect的发现。但是它也激发了一些更有革命性的解释。例如，伦敦大学的物理学家David Bohm相信Aspect的发现是意味着客观现实并不存在，尽管宇宙看起来具体而坚实，其实宇宙只是一个幻象，一个巨大而细节丰富的全像摄影相片。（参见文献《宇宙为雷射幻像》）</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>这一现象如佛陀证悟的：举心动念法界皆知，万法同体牵一而动全身。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>一切的诸佛菩萨、天人鬼畜、泥巴瓦块,按照《楞严经》讲,一粒微尘、一根草芥、一根草丝、一片草叶,尽足为一真法界,这个法不得了,石破天惊啊！一粒微尘,一棵草,它当下都是整个的无量的佛,无量的菩萨就是它！</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>基本粒子能够彼此保持联系，而不管它们之间的距离多远，不是因为它们之间来回发射的信号有多么“神秘”，而是因为它们的分离是一种幻觉，在现实下面更深的层次里，这样的粒子并不是分离的两个单独的个体，而是每个粒子当下即是整体全部！</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>全息理论为我们引出了一个新的视角，世界的每一个局部都是包含了整个世界。如：细胞克隆技术利用一个细胞复制出与原来同一动物，而每一细胞都包含了这个动物的全部遗传信息；一根磁棒折断成几段，每个磁棒南北极特性依然不变，每个小段都是它整体的全息缩影。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>事实上，佛教很早就发现并利用全息规律。宇宙全息具足于当下一念。佛教开悟经典《楞严经》云：“一为无量，无量为一。小中现大，大中现小。”</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>“於一毛端现宝王刹。坐微尘里转大法轮。”</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>毛端指一根毫毛的顶端，“现宝王刹”可以显现整个宇宙和无量无边的佛世界，这就是说最小的当下即是最大的，局部当下即是整体全部！</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>微尘就是现代科学所指的量子，极其微小的粒子，这么微小的量子里头，还有无量世界，佛还在里头讲法华经，转大法轮，教化里面无量众生。以前人们读到类似经文认为这是神话，直到现代科学“全息理论”问世，才知道这是事实，芥子确实可以纳须弥！一张全息照片，分为100份，无数份，每一份碎片都可以使整张照片内容复原，都包含整张照片内容。佛说的:任何物质里头你都见到遍法界，虚空界，就是极其微细的念头里头，都有遍法界虚空界的信息，一个都不少！这个现象简直没法想象，可是是事实，自性里头，法尔如是，本来就是这样子的，小大不二，一多互容，一即是多，多即是一，整个宇宙十法界，有情无情，就是一个不可分割的整体，一个不可分割的“生命共同体”。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>宇宙的真相就是没有哪一个不是哪一个，局部当下即是整体，你伤害一个众生的当下即是伤害自己，当下即是伤害整个宇宙。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>《楞严经》讲，所有的佛菩萨，天人鬼畜、牛马猪羊、泥巴瓦块、风云雨雾，都是一个人，都是一个念。所以我们互相之间，却搞种种的误解、执着、是非，都是自己跟自己过不去，《楞严经》叫【自心取自心】。为什么说受持《法华经》《楞严经》如来藏大法的人，佛在《法华经》讲【我独无所畏】啊，他把自己的命也供养给一切的万法，你说你是怎么样，你跟我有仇有冤，你就是要我的命，我也给你，这个东西也是我的，也是你的，我马上换一个命来。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>佛在《楞严经》讲六交报，你这个摄像机，摄受到真善美，你就是真善美。如果摄受到假丑恶，你就是假丑恶。世间法里一人做事一人当，你看到别人杀人放火，你受不到法律的惩罚，与你无关。在佛法里，你看到别人做坏事，听到别人说坏话，甚至怀疑别人做坏事，你还要受惩罚，就等于是你自己在说在干，《楞严经》六交报就是这么讲的。所以我们经常告诫修行人，千千万万不要把别人往坏处看，不要把别人往坏处想，不要把别人往坏处说，你说了以后不仅自己受报，听你说的人还要受报，你罪加三等。&nbsp;&nbsp;你只管把别人，往好处想，是随喜。别人未必给你想好的，被你说好的，可是你自己把自己想好了、说好了，叫随喜功德。我们现在包括修行人内部，总是喜欢搞人我是非，要明白，因为我们这六根就是六个摄像头，摄进去，善有善报，恶有恶报，《楞严经》就是传这个法，我们要好自为之啊。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>《法华经》《楞严经》『如来藏』的核心,就是说整个虚空世界,过去现在未来,上自诸佛菩萨,下及天人鬼畜,旁及山河大地、树木花草、风云雨雾,一切的一切,我们能够耳闻目睹身受,我们还有看不到听不到,那些真实存在的一切的一切,都是一个人一个念之所变现。打个比方，就如同我们在梦中,梦中的境界千千万万,万万千千都是做梦的一个人一个念变现而已,这就是《法华经》《楞严经》的真谛。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong></strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>四、意识能量级</strong></p><div class=\"text-center\"><strong>【视频】科学发现，水能随着念头的变化而变化，外在的形象、环境与心念息息相关</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=q0151e1uve9&amp;attstart=0&amp;attend=865&amp;exid=k0&amp;showend=1&amp;title=%E6%B0%B4%E7%BB%93%E6%99%B6%E5%AE%9E%E9%AA%8C&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>大自然有意识吗？</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>日本的江本胜博士在研究水结晶时发现，水具有意识，它能听、能看。他用高速摄影技术来拍摄水结晶照片，在装水的瓶壁上贴不同的字或照片让水看，不管是哪种语言，看到“谢谢”的水结晶非常清晰地呈现出美丽的六角形；看到“混蛋”或者“烦死了”的水结晶破碎而零散。</strong></p><div class=\"text-center\"><strong><img id=\"aimg_eLKSd\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203257fm9n966mbmfpptm9.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong></div><div class=\"text-center\"><strong><img id=\"aimg_ch7Db\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203302cxtt22sexqeqqx82.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong><strong><img id=\"aimg_157\"aid=\"157\"src=\"static/image/common/none.gif\"zoomfile=\"forum.php?mod=attachment&amp;aid=MTU3fGI0ZTMxMmY0fDE2MTczNzQ3NTN8MHw1MTk%3D&amp;noupdate=yes&amp;nothumb=yes\"file=\"forum.php?mod=attachment&amp;aid=MTU3fGI0ZTMxMmY0fDE2MTczNzQ3NTN8MHw1MTk%3D&amp;noupdate=yes\"class=\"zoom\"onclick=\"zoom(this, this.src, 0, 0, 0)\"width=\"600\"inpost=\"1\"onmouseover=\"showMenu({'ctrlid':this.id,'pos':'12'})\"><div class=\"tip tip_4 aimg_tip\"id=\"aimg_157_menu\"style=\"position: absolute; display: none\"disautofocus=\"true\"><div class=\"xs0\"><p><strong>p111111111111111sb.jpg</strong><em class=\"xg1\">(71.57 KB,下载次数:1025)</em></p><p><a href=\"http://www.fahua123.com/forum.php?mod=attachment&amp;aid=MTU3fGI0ZTMxMmY0fDE2MTczNzQ3NTN8MHw1MTk%3D&amp;nothumb=yes\"target=\"_blank\">下载附件</a>&nbsp;<a href=\"javascript:;\"onclick=\"showWindow(this.id, this.getAttribute('url'), 'get', 0);\"id=\"savephoto_157\"url=\"home.php?mod=spacecp&amp;ac=album&amp;op=saveforumphoto&amp;aid=157&amp;handlekey=savephoto_157\">保存到相册</a></p><p class=\"xg1 y\">2014-6-30 20:54上传</p></div><div class=\"tip_horn\"></div></div></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>美国心理学教授发现无情物也有意识，这与《楞严经》讲的无情也是有情不谋而合。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>大卫·霍金斯：人类意识的能级水平</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>基于普朗克的发现，美国著名的心理学教授、精神科医师大卫·霍金斯花了30</strong><strong>多年研究，发现存在于我们这个世界的隐藏的图表：一个有关人类所有意识的能级水平的图表。</strong></p><div class=\"text-center\"><strong><img id=\"aimg_xD4Yq\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203331yqjqthhzh3rjvhw4.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>他将普朗克发现的秘密更进一步的透露：所有存在的一切都有一定的意识水平和能量水平。不论是书籍、食物、水、衣服、人、动物、建筑、汽车、电影、运动、音乐等等统统都有一个确定的能量级。</strong></p><div class=\"text-center\"><strong><img id=\"aimg_TWu31\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203340uh30ddbuvb2n6l44.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong></div><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>那么如何提升个人的能级呢？或许你也猜到了，就是放弃低能级的东西，和高能级的“东西”呆在一起、保持共振。这包括接触具有更高能级的人，如佛门中强调的亲近善知识；去到高能级的能量场，如在佛教的庙宇道场中熏修；接触高能级的书籍、音乐、电影、画像、工艺品等，如阅读佛陀和高僧大德留下的经典论著《法华经》《楞严经》、瞻仰佛菩萨像、念佛持咒等。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:left\"><strong>大卫·R.·霍金斯博士遇到过的最高频率是700，是他研究德蕾莎修女（1910-1997,获1997年诺贝尔和平奖）的时候出现的：当德蕾莎修女走进屋子里的一瞬间，在场所有人的心中都充满了幸福，她的出现使人们几乎想不起任何杂念和怨恨。</strong></p><p style=\"line-height:22px;text-indent: 2em;text-align:center\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img id=\"aimg_ztk0w\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201406/30/203353tbkhhhf8uq1n5k2p.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong></p><strong>努力维持身体粒子的能量振动频率在200之上，可使正面意识和能量能互相传递而良性循环，不仅可以帮助自己，也可以帮助身边那些频率低的人，意识越正则能量越强大，就越容易修复自己和帮助别人，心存善念、相信自己的善念可以改变自己的人生，最终境随心转。</strong><strong>改变命运的关键在于“转”，以变数改变定数。</strong><strong>根据大卫·霍金斯博士的研究成果显示，一个人的能量层级的提升就可以带动大批低能级的人类意识开始提升，可以从所在居住地点辐射出去，甚至波及全球。每1点的意识能量等级的上升会标志着正能量的10倍加强。生命正能量与意识能量等级呈对数关系。生命正能量等级越高的人，对周围环境的影响力越大。意识层级提升，意味着把低频能量提升成高频能量。这在佛法里叫用变数改变定数。</strong><strong>这在佛法里叫用变数改变定数，心能转境则同如来。</strong><div class=\"text-indent\"><strong>近朱者赤，近墨者黑，跟什么样的人在一起，你就是什么样的人。亲近善知识，远离诸恶趣。</strong></div><div class=\"text-indent\"><strong>佛在《楞严经》讲六交报，心就好比一个摄像机，你这个摄像机，摄受到真善美，你就是真善美。如果摄受到假丑恶，你就是假丑恶。灵知心是一个超级电脑，凡事好坏不分，全部储存到阿赖耶识仓库里，储存进来就是你的业障。所以我们听到别人说坏话，你也要受报应，所以说坏话的人是双重报应。看到别人做坏事你受报应，负面信息储存进来，将来在一定时空点它就出来造业——所以佛讲，看到别人做坏事，听到别人说坏话，做为菩萨呢，屁股一转就逃跑了，不要参与。</strong></div><strong>现代医学、灵修理论中所谓的“疗愈”，其实就是透过“共振”来转换人的电磁场中低频能量状态，这表示我们是可以经由一些方法来调高我们自己的能量，把粗糙笨重、密度大的能量，转化升华成精细轻快、密度小、振频高的能量。</strong><strong>共振可应用在人体的各个层次上，在细胞层次上来说，我们可以将人体内堆积过多的自由基转换成为阴离子；在肉体上，可以将高度浓缩的肿瘤转换成密度较小的健康肌肉；在情绪上，我们可以将比重大的痛苦升华成比重小的快乐；在认知上，可以将负面的批判转换成正面的欣赏，将悲观的看法转为乐观的态度。在灵性上，可以将人的意识从原本只认同有形的肉体，提高到也能感觉无形灵体的状态，从而唤醒我们的灵性意识，重新和自性本体联结，最后达到和宇宙合为一体的状态。（参见《科学证实意识决定身体粒子的能量振动频率》）</strong><strong>我们来看一下老吴的真实故事。几个星期来，老吴感到胸部不适、咳嗽，而且有点呼吸困难，吃药也无多大改变，随即住进大医院接受检查。结果诊断出是一个快速发展的恶性肿瘤，医师预测他只剩下一、两个月的寿命。这个悲惨、可怕、难以接受的坏消息，震撼了老吴和他的家人。得到「癌症」两天后，老吴便开始恶化。他感到非常虚弱，体重迅速下降。他开始无法离床，家人都认为，能够度过这个星期已属幸运。没想到医院打来一通电话。一个带着歉意的声音告诉老吴的太太，老吴根本没得到癌</strong><strong>症！那个很窘的声音解释说，是医院报告弄混了。获知实情之后，老吴在二十四小时内立即离床。他的食欲恢复，疼痛也消失，而且行动自如。他的衰弱完全不见，留下的只是刚开始的症状：咳嗽与呼吸困难。</strong><div class=\"text-center\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;震撼视频！北京医院用意念3分钟彻底治愈癌症，治疗过程完全公开</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=n0151rldxa5&amp;attstart=0&amp;attend=878&amp;exid=k0&amp;showend=1&amp;title=%E5%8C%97%E4%BA%AC%E5%8C%BB%E9%99%A2%E7%94%A8%E6%84%8F%E5%BF%B53%E5%88%86%E9%92%9F%E5%BD%BB%E5%BA%95%E6%B2%BB%E6%84%88%E7%99%8C%E7%97%87&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><strong>五、宇宙是众生的同分妄见和别业妄见</strong><div class=\"text-center\"><strong>心即是一面镜子，你想什么，镜子里就现什么相，你就是那个东西，你应你自己的供养，【即因即果】，【花开莲现】，《楞严经》云【自心取自心】。</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=v0151glocdg&amp;attstart=0&amp;attend=169&amp;exid=k0&amp;showend=1&amp;title=%E7%9B%B8%E7%94%B1%E5%BF%83%E7%94%9F&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><strong>“看了一个叫跟踪美国的一个原始森林的土著人治病，怎么治病呢，一个人摔下来这个骨头断了，骨头冲出皮肉这么长，这个土著人就在那里对着骨头讲话，就慢慢的跟它沟通，沟通以后骨头恢复了，这是真的，这是美国人跟踪土著人科学记录，这种东西是我们人的本能，但由于现代人文明人过分的依赖于医学依赖于科学，使我们的本能丢失，我们真正会治病的话，真正明白我们人的妙用的话，你哪里痛你可以跟哪里沟通，腿痛跟腿沟通，肝痛跟肝沟通，肝啊，我们都是一个本体，我们好好维持这个肉身来念佛，我们要和睦相处是不是啊，大家互相调理，你就以此心慢慢的跟它们沟通，不急不躁，你病就能好，大家明白这个道理吗？山上的野狗野猪野狼哪里碰伤了以后，它稍微在那里休息休息，通过用心沟通，伤口很快就会痊愈，所以现代科学的高度发明利弊双重，讲到利不需要我讲，你们比我都懂，弊就是使我们人越来越依赖于科学，使我们自性的本能丧失，所以佛在《楞严经》讲到十种仙，我们就凭这个肉身，我们修得都可以飞到天上去，我们就有这个能力，可我们现在不会用了，迷失，那么既然是这样，我们自己能成佛能成菩萨，我也不成仙也不升天，我就要成佛，一了百了是不是啊，为什么有许多外道啊，外道他都是利用自己的本能，能做鬼能做神能飞天能怎么样能怎么样，他懂得自己有这种能量，然后苦苦地执着地就用这个心，比如说哎呀那个孔雀太美了，我一天到晚在这想孔雀，脑子里就是观孔雀，要不了十年八年，你就是一只美丽的孔雀腾空而起，然后儿子就，哎呀我老妈变成孔雀飞走了，这是真的可不是假的，只看你会用心，你想什么你就能变什么，想风变风想火变火想水你就变水，因为我们这个心永远不会死，它随着我们的妄想心来变化。”（参</strong><strong>见印广法师《法华经》第16讲）</strong><div class=\"text-center\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;<img id=\"aimg_S4tkq\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201409/07/173642szdg6kc37j7mnkto.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\">&nbsp;&nbsp;</strong></div><strong>“在梦中，比如说你被狗咬了一口，正当咬了一口马上就醒来的时候，那个脚后跟痛不痛啊？肯定是痛。在梦中也痛，醒来以后还感觉到痛。那其实梦中狗咬了你没有啊？没有，是不是？所以我们平时这个手搞个针刺一下，哎呦一声，是皮肉痛还是你心痛啊？我们自己都被自己糊弄了。其实如果我们放下我执，放下烦恼习气，证到这种境界的时候，把你这个肉割下来，你一点都不痛，他马上就会长出来。</strong><strong>外国人做心理实验，两个罪犯张三、李四对面坐，当着李四的面，捡这么大一块火炭往张三手上一放，张三哇地一下子手被烫烂了，烫了一个大血泡；然后把李四的眼睛蒙起来，搞了这么大的一个冰块往李四手上一放，李四哇地一下手上也烫了个大血泡。如果李四睁着眼睛，放一冰块在他手上，会不会烫一个大血泡啊？不会的。所以皮肤上的大血泡是被烫出来的，还是心里变出一个大血泡啊？都是心变出来的。《楞严经》里讲：毕陵伽婆蹉在路上遇到了一根毒刺，疼得不得了啊！然后他入定观照，叫心静下来，“我们的肉身是无情的，它怎么会痛啊？这是我的意识心在作怪”，他老是这样观照，一点都不痛。</strong><strong>还有一个心理实验，是两个死囚犯，张三李四，当着李四的面把张三的动脉割开，好，半个小时以后张三死了，叫安乐死；现在轮到李四了，把李四的眼睛蒙起来，然后用保险刀的刀背轻地割一下子，没有割破，明白吗？再用三十六度的热水啊，顺着他的手腕滴答滴答往下流，半个小时以后，李四也死了。李四是他死的还是自心死的？是心死的。他认为跟张三一样他也会死，大家明白吗？所以我们明白这个道理啊，就能战胜疾病，我不愿意死，怎么了？你就不死，但是你必须持之以恒，以这种心念来调整你这个身体，我要命令我所有的细胞都在这里飞快地调整。因为我们这个生命体啊，每隔七年它是一次大调整，每隔七个月、七天、七个小时是中调整、小调整。只要我们用心它就在调整，我们的这个心可以叫肉身飞天，可以叫肉身化成一股风，化成一团火，化成一滩水，把一个小小的病治了算什么？我们一些人一天到晚只</strong><strong>知道吃药吃药，变成药罐子了。我们的心就能主宰我们的命。”（参见印广法师《心经》第3讲）</strong><div class=\"text-center\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img id=\"aimg_PF9Q9\"onclick=\"zoom(this, this.src, 0, 0, 0)\"class=\"zoom\"file=\"http://www.fahua123.com/data/attachment/album/201409/07/164200vkr0i0zox4zc1sc4.jpg\"onmouseover=\"img_onmouseoverfunc(this)\"lazyloadthumb=\"1\"border=\"0\"alt=\"\"></strong></div><strong>“这一杯水,人道的人喝的是甘露水,天上的人看到是块石头,鬼道的众生看到是一团火,你说这到底是什么？2005年我到山西阳曲县传法,一位69岁的老居士向我请法。他说：“师父,有一件事我到现在都想不明白。有一天晚上我按照墓林僧划道道,念阿弥陀佛念到9点多,清楚明白。老婆回来叫了一声,黑咕隆咚的你在干什么？老婆一叫,我两个眼睛什么也看不到了,在此之前清楚明白”。所以我们想一想,白天黑夜都是假的。</strong><strong>翻译《妙法莲华经》的大师鸠摩罗什,七岁随母到寺庙拜佛,自己把一个千斤宝鼎一只手拿着玩（别业妄见），其他人看了惊叹不已：“这个千斤宝鼎我们十个人都抱不起来。这个小孩力气这么大呀！”他头脑里有了重量的概念以后,那个宝鼎唰地一下落地,两个手怎么样推,纹丝不动（同分妄见）</strong><strong>。</strong><strong>七岁的鸠摩罗什当下开悟。连白天黑夜、轻重多少,都是我们在打妄想。</strong><strong>我们人自以为这是一个肉团,皮肉筋骨要吃好、要玩好，可是《楞严经》里讲的菩萨在禅定中,火头金刚修火观,在定中这是一团火；月光童子修水观,在定中变成一滩水；琉璃光法王子修风观,在定中变成一股风；虚空藏菩萨修空观,在定中肉团身就是一个虚空,什么也看不到。五百个阿罗汉跟他对话,“虚空藏菩萨,我们听得到你的声音,看不到你的人。为了表示你的存在,我们每人供养你一件衣服,请你收下。”虚空藏菩萨说好吧,当下五百件衣服不见了。还有些歪门邪道修牛观、马观、孔雀观,最后就变成牛神马神,是不是？我们的心法不可思议（别业妄见）。</strong><strong>现代心理学他懂得,人与人之间可以进行心电感应,我们与佛菩萨之间不言而喻。你说我们怎么想,佛菩萨知道不知道？是不是？可是佛怎么怎么想,我们知道不知道？我们是知而不知。你是装糊涂而已啊！不要说佛与众生之间，众生与众生之间都有心电感</strong><strong>应，到底是谁在感应,我们要搞明白。就是我们的第七识在感应。我们同修之间、朋友之间,如果说相互之间有些隔阂,有些误解,你有时候你浑身是嘴你讲不清楚,你越讲还越糊涂,越讲这个误解还越大,你不妨换一个方式。你只管心里暗暗地对你的这个冤亲债主生欢喜心,要是起真实的欢喜心,天天为他祈祷,消灾祈福,乃至把他的照片或者立上牌位,在家里礼拜他,不是玩假的,是玩真的。一年半载以后,你莫名其妙地真欢喜他,他也真欢喜你,就是这个道理。你不信你去试试看！</strong><strong>我们讲人与人之间就是这样,那我们再讲人与畜生之间能不能勾通。南昌起义失败以后,刘伯承带着两个警卫员,逃跑到深山老林里看到一只老虎,刘伯承讲,“没有关系,我们只要高高兴兴地非常和平地在这里,老虎不会伤害我们。”果然他们三个人心情放松,老虎看看他们就走了。如果你心里产生恐惧心理,产生敌对心理,老虎非要来跟你拼命。所以一定要知道,我们这个心里一动,就有一种信息,有一种光波,向外发射,所以叫命自我立。</strong><strong>人与动物、有情是这样,那与植物是不是这样呢？也是一样啊！外国心理学家做过一个实验,分别对两棵树采取不同的方式,对一棵树天天来给它拳打脚踢,用不好的语言来污染、诽谤；对另外一棵树用吉祥的语言来跟它勾通，给它修枝给它浇水然后再通过仪器的测量,发现每次走到那个吉祥加持的树那里,它这个信息非常得吉祥；走到那个受到伤害的树那里,信息非常糟糕,那个树直抖。我以前在无锡工商联为一些企业家说法,提了这个法。我讲我们从华市去请一棵文竹,很小的那种树,你每天都跟它勾通,“文竹,我们交个好朋友怎么样？我最喜欢你啊！我的心肝宝贝啊！白马王子啊！”嘴巴讲也行,心里欢喜也行,一个礼拜以后你会发现那文竹一见到你就会点头微笑。有一个叫朱斌的老总,他听完了我的法以后,第二天早晨跟他的儿子浇华的时候,父子两个约好了,我们一定要生欢喜心跟这个华勾通,结果每一朵华都跟他们点头,当下打电话告诉我，“哎呀,还有这样的法！”这是真的！他在那个会场也跟大家讲了,这是真理。天地万物都是有情，都可以跟我们道交感应。由此我们得出一个结论，十法界一切的万法，都叫『应供』，没有哪一法不叫『应供』。应谁的供？自己应自己的供，你对你</strong><strong>自己、对别人、对一切的外界环境，你怎么想、怎么看、怎么说、怎么做，你就受自己的这种想法、说法、做法的供养，这就是「因果报应」。你把一切万法都看成自己一念变现，你就是妙觉如来；你把别人看得很黑暗，你这个心就是黑暗的心，你就是凡夫，这是真的。</strong><strong>我们最关心的是无情,它有没有心？有没有灵性？我们也可以自己回去做一个实验：你在一个透明的玻璃杯里,用线悬一个铜板,办法是一样的,你对它生欢喜心,一个礼拜以后,那个铜板一看到你就会摇头晃脑；或者用两组馒头,也跟鲜华一样,用分别心对待它,一个礼拜以后,这一堆馒头仍然很亮很香,另一堆馒头已经发枯发霉。我们想象一下,同样的两间房子一起建成,如果这间房子里一直有人住,那一间房子里一直没有人住,哪间房子容易坏啊？一定是没有人住的房子破旧得快。”（参见印广法师《阿弥陀经》第2讲）</strong><div class=\"text-center\"><strong>【视频】无情也能感知心念，试想一下，我们的想法会对自己造成什么？</strong></div><div class=\"text-center\"><iframe frameborder=\"0\"src=\"https://v.qq.com/txp/iframe/player.html?vid=j0151dggvj6&amp;attstart=0&amp;attend=96&amp;exid=k0&amp;showend=1&amp;title=%E6%B0%B4%E5%AE%9E%E9%AA%8C&amp;&amp;auto=0\"style=\"width:100%;height:500px; margin:10px 0;\"></iframe></div><div class=\"text-indent\"><strong>六、印广法师开示如来藏和弦理论</strong></div><div class=\"text-indent\"></div><div class=\"text-indent\"><strong>从动物克隆技术，由猴血造猴，羊血造羊，以及现代物理学所达到的那种境界——从物质的分子到原子，再由质子、中子、电子和夸克，物理学家在最后观照到夸克的时候，原先坚固的物体已经显现为一种波动，而且这种波动很奇怪——当物理学家想观测它的波动性的时候，它就呈现出波动性。当物理学家，想观测它的粒子性的时候，它就呈现出粒子性。&#65279;也就是说，这无情的物质能随着人的心来攀缘。所以这些法使我们想起佛当年所讲的“无情也是有情”。有情无情可以互相交换，而有情无情、天地万法就是一个人一&#65279;个念变现出来的。&#65279;</strong></div><div class=\"text-indent\"><strong>现代科学需要进一步地来研究、突破，而佛法理论早就有了，就是现成的。那么我们再从现代哲学这个角度来看，也可以与佛法相沟通。那么在传统哲学上讲，精神变物质、物质变精神。在精神方面，它只涉及到眼耳鼻舌身意这六种意识心，而佛法已经涉及到第七种心、第八种心、第九种心乃至第十种心。那么在一开始，把有形有相的存在说成是物质。当磁场和光波理论被发现后，列宁又把物质定义为客观存在。就列宁的这个定义来讲，它就为佛法与现代哲学的沟通铺设了一条道路。既然是客观存在，我们顺着六种意识心往后，在佛法里叫回光返照，在哲学里叫逻辑推理。列宁是这样概念，我们就可以把哲学圆融一下。哲学里面讲物质和精神，而在佛法里面，它其实还有一个能变现出物质和精神的幕后者，这个东西在佛学上叫“真空”，叫“性”。</strong></div><div class=\"text-indent\"><strong>在偶然的一个机会，我到朋友家里去玩。他拿了一本《法华经》，后来又拿了一本《楞严经》。我恍然大悟，原来真正的佛法就是《法华经》和《楞严经》讲的“如来藏”的道理。这个道理把天地万法统统说为，就是一个人一个念变出来&#65279;的。</strong></div><div class=\"text-indent\"><strong>我当时一看，我就接受了这个理论。原来诸佛出世他讲的无量的法门，无量的经典，那都是世间善法，是佛没有办法的办法，用它来引导。到佛最后要离开世界的时候，硬着头皮讲也得讲，不讲也得讲，讲出了这个宇宙人生的真理,因为这个真理一讲出来人家很难接受。所以我从此呢，对佛法就是另眼相待。这个佛法它不是什么宗教，也不是什么信仰，不是什么精神寄托，更不是什么迷信这些东西，它就是讲真实，就是讲真理。</strong></div><div class=\"text-indent\"><strong>那么后来，我又进一步学习了现代科学的一些研究。比如现代科学从动物克隆，一滴猴子血在实验室里能够造出猴子来，就更加帮助我理解和深信，佛讲的无情也是有情。连泥巴瓦块、树木华草、风云雨雾，都能变现出有情的天啊、仙啊、鬼啊、神啊、怪啊、人啊……</strong></div><div class=\"text-indent\"><strong>同时我又通过现代物理学，那种所谓的弦理论，物理学家把这个无情的钢筋水泥，泥巴瓦块这些固体物，通过实验仪器把它化解到分子、原子、电子、质子、中子乃至再往下化解到夸克。到了夸克呢，就出现了奇迹，固体物就变成了一种振动。</strong></div><div class=\"text-indent\"><strong>那么再反过来，也就是说，这一切的固体是不是由振动产生的？正反是不是一个道理？，因此就帮助证明了佛讲的，天地万法都是一个人一个念变现的。</strong></div><div class=\"text-indent\"><strong>我们这个念不就是振动吗？所以我们种种的妄想心，思想在动态，最后成就为天人鬼畜、风云雨雾、泥巴瓦块、太阳、星星、月亮、山河大地。但是科学家他只知其然，他不知其所以然。那么科学家认为就是一种振动，振动出了天地万法。他们这种设想是很有道理的，可惜他不能用佛法的心法来理解。</strong></div><div class=\"text-indent\"><strong>那么我们还要研究，这个振动之前它在不在？也就是说这个振动之前，没有发生振动的时候，振动在不在？这个就要靠智慧推断。肯定是在，如果不在的话，它怎么能振起来？！我们常说，“巧媳妇难为无米之炊”，“水必有源，末必有本”。那么振动在没有振动的时候振动就在，虽然在，它却没有振动，虽然没有振动，它是真实存在，这就是我们的心；振动了就是识，意识的识，佛法的一个基本规律叫“识变心现”。</strong></div><div class=\"text-indent\"><strong>用阿弥陀佛来讲，就是阿弥陀佛的“阿”（没有振动，却真实存在），振动就是“弥”，“弥”就是意识心在振动。一振动呢，这个无形无相的“阿”因为振动，就变现出“陀”，这个“陀”就是天地万法、佛菩萨、天人鬼畜、泥巴瓦块，一切有形有相的东西都叫“陀”；“陀”是通过“弥”振动出来的。振动，是没有振动之前它就存在，通过振动把无形无相的那种“阿”，变现出有形有相的“陀”。所以现在科学家的这种研究方法，他倒过来从“陀”开始研究，分分分分……小小小小……最后发现“陀”变成了一种“弥”,就是振动。</strong></div><div class=\"text-indent\"><strong>所以我们应该感恩现代科学，帮助我们明心见性。因为这个真理是佛发现的，如果是鬼发现的就叫鬼法，如果是牛发现的，叫牛法。不能因为是佛讲出来的它就是真理，而是因为佛发现了真理。真理是客观存在的，真理就是真理，不管谁发现的，它都是客观存在的。所以我们追求真理必须人人平等，佛菩萨、天人鬼畜、妖魔鬼怪、科学家、牛马猪羊、都要平等。所以现代科学、科学家，如果能把佛法研究起来，我们这个世界的发展，会大大地加快。</strong></div><div class=\"text-indent\"><strong>那么至于到底怎么样变出来的，我们打比方，油盐米面这四种原料做点心，原料相同，但是投放的比例不一样，味道一样不一样？所以，以我们人来讲，我们来生来世是做人、做鬼、做畜生、做佛做菩萨，还是做穷人、还是做富人、还是做圣人、还是做贱人，就在于我们自己来做自己的点心。</strong></div><div class=\"text-indent\"><strong>比如我们都是皮肉筋骨、血液、水分、温度，是不是？原料都是一样的。但是由于我们研究的理论不一样，我们世界观不一样，我们想的不一样，吃的不一样，看的不一样，我们习气不一样，爱好不一样，就决定了我们来生来世是做人、做鬼、做畜生、还是做佛菩萨、还是做富人、还是做穷人，把握在我们自己手里，而且直接决定今生今世，你是长寿还是短命，高矮胖瘦，血压高低，血液的比例，都不一样，这个道理非常非常简单，而且我们最后还要明白，这些无情的东西都是有情，都是一个心变出来的。</strong></div><div class=\"text-indent\"><strong>为什么猴子血能变成猴子？猴子血我们看是不是无情啊，它怎么能变出猴子来？那么人血能不能变人？这个仅仅是早晚的问题，将来科学家一定会成就这个研究。其实在无量百千万亿年之前，诸佛如来已经讲清这个问题。所以佛在《楞严经》讲，一只鸟把这泥巴块放在怀里跟它沟通，泥巴块就能变成一只鸟。既然能变成鸟，鸟能不能成佛啊？我们不要看这泥巴块是无情，它也是有情，它仅仅是灵性稍低，意识心没有我们强而已。</strong></div><div class=\"text-indent\"><strong>打比方来讲，我就是这个手掌，是不是？其实这个手掌，是不是拳头变出来的？可是现在你能不能看到拳头？虽然看不到拳头，拳头在不在？心看到那个拳头叫性具功德。所以那个拳头是不是变出了手掌？这是什么？这是个锤子、剪子、扫把、木排、布、兔子的耳朵，这样变那样变，是不是无量的？所以我们千万不要以为看不到听不到，无形无相的就不存在，在佛法里那是“真”，叫“真如”，而我们这有形有相的东西来讲叫“相”，也叫阿弥陀的“陀”。那么现在眼睛看到手掌，心看到拳头，那个拳头叫“阿”，它没有任何形相叫，“离一切相”。但是来讲，这一切相又是这个拳头变出来的，所以“即一切法”。“离一切相，即一切法”,就这个道理。所以我们从这个手掌，这个拳头，就能明白这个道理。</strong></div><strong>真理太简单了，越是真理越简单。“假传万卷书，真传一句话”。我们看到是金碧辉煌，锦绣江山，花花世界，森罗万相，千变万化，男女老少，蹦蹦跳跳，是不是？其实最简单，就是一堆烂泥巴在变现。由烂泥巴变出来，再回到烂泥巴去，而这个烂泥巴本身就是心。哪有烂泥巴呀！</strong><strong>你说烂泥巴是不是都是人血、狗血这些东西堆积起来的？那现在知道猴子血能变猴子，它是烂泥巴吗？这在我们佛法里叫“同分妄见”。怎么“同分妄见”呢？比如说这杯水，我们人喝的是水，鬼呢，看到是火，天上的人看到是石头，这是我们用心不同。</strong><strong>附：</strong><strong>台湾大学校长严密的科学实验彻底颠覆唯物主义世界观</strong><strong>台湾大学校长李嗣涔教授，美国斯坦福大学电机工程博士。李嗣涔教授在台湾进行了十多年的特异功能研究，并在台大电机系开设“人体潜能专题”课程。通过多年实验开展手指识字、心电感应、念力等研究，训练7至14岁的小孩。结果大约有10%到40%的青少年可以成功开发出天眼，手指识字的特异功能，看到肉眼看不到的真实存在的世界。李嗣涔科研团队证实了在人类所处的时空之外，还有所谓“信息场”的存在，也就是俗称的“灵界”--包括“佛和神”。</strong><div class=\"text-center\"><strong>李嗣涔教授的科学研究报告【人体身心灵科学】</strong></div><div class=\"text-center\"><strong><span id=\"flv_AKj\"><embed width=\"500\"height=\"375\"allownetworking=\"internal\"allowscriptaccess=\"never\"src=\"http://www.tudou.com/v/HCNwGVHzGWk\"quality=\"high\"bgcolor=\"#ffffff\"wmode=\"transparent\"allowfullscreen=\"true\"type=\"application/x-shockwave-flash\"></span><script type=\"text/javascript\"reload=\"1\">$('flv_AKj').innerHTML=(mobileplayer()?\"<iframe height='375' width='500' src='http://www.tudou.com/programs/view/html5embed.action?code=HCNwGVHzGWk' frameborder=0 allowfullscreen></iframe>\":AC_FL_RunContent('width','500','height','375','allowNetworking','internal','allowScriptAccess','never','src','http://www.tudou.com/v/HCNwGVHzGWk','quality','high','bgcolor','#ffffff','wmode','transparent','allowfullscreen','true'));</script></strong></div><strong>【档案：马克斯·普朗克】</strong><strong>马克斯·普朗克（Max Planck，1858~1947），德国物理学家，量子论的奠基者，二十世纪两大最重要的物理学家之一。大约1894年起，他开始研究黑体辐射问题，发现普朗克辐射定律，并在论证过程中提出能量子概念和常数h（后称为普朗克常数），成为此后微观物理学中最基本的概念。1900年12月19日，普朗克在德国物理学会上报告这一结果，成为量子论诞生和新物理学革命宣告开始的伟大时刻。普朗克因此获得了1918年的诺贝尔物理学奖。</strong><strong>爱因斯坦：如果有一个能够应付现代科学需求，又能与科学相依共存的宗教，那必定是佛教。</strong><strong>憨山大师:不读法华，不知如来救世之苦心；不读楞严，不知修心迷悟之关键。</strong><strong>藕益大师:《楞严经》诚一代时教之精髓，成佛作祖之秘要，无上圆顿之旨归，三根普被之方便，超权小之殊胜法门，摧魔外之实相正印也。</strong><strong>以下视频《过五关度六将证菩提》高度概括《法华经》《楞严经》之精髓，简述宇宙万法来龙去脉，告诉我们如何用变数改变定数，进而改变生生世世的命运<a href=\"http://www.fahua123.com/forum.php?mod=viewthread&amp;tid=333&amp;fromuid=10\"target=\"_blank\">http:<strong>《楞严经精华168字》详解时间空间、山河大地、日月星辰、牛马猪羊、天人鬼畜、泥巴瓦块一切万法如何产生，让您当下契入诸法实相。</strong><strong><a href=\"http://www.fahua123.com/forum.php?mod=viewthread&amp;tid=91&amp;fromuid=10\"target=\"_blank\">http:<strong>大卫·R.·霍金斯发现善念，比如诚实、同情能增强一个人的意志力，改变身体中粒子的振动频率，进而改善身心健康，请看《科学证实意识决定身体粒子的能量振动频率》</strong><a href=\"http://www.fahua123.com/forum.php?mod=viewthread&amp;tid=524&amp;fromuid=10\"target=\"_blank\"><strong>http:</div></div>"
  }
]