[
    {
        "title": "听经闻法当下成就！原来开悟就这么简单！",
        "author": null,
        "date": null,
        "html": "<div class=\"B1_text\"><p>听经闻法当下成就</p><p>——印广门清法师开示 </p><p>为什么说听经闻法能够当下往生?当下成佛?这是我们在修行中碰到的很敏感的问题。这个问题不讲清楚,会使许多修行人从根本上误解乃至动摇如来正法。</p><p>要解决这个问题,我们首先要明白这么几个方面的问题:</p><p>第一、什么叫【往生】?什么叫【成佛】?</p><p>第二、要解决【听经闻法当下往生当下成佛】是谁说？是佛说？还是菩萨说？还是魔说？还是老师说？是《法华经》《楞严经》说？还是三藏十二部经所说？要明白这个问题。</p><p>第三、解决【为什么】。为什么听经闻法当下就能了生死，就能成佛？</p><p>首先我们来看：什么叫『成佛』？什么叫『往生』？现在有些人把『成佛』和『往生』分开说成两回事,认为往生就是死了以后出生到极乐世界去，成佛也好、成菩萨也好、成凡夫也好，反正生到极乐世界去了。而成佛呢，就是释迦牟尼佛坐在菩提树下，成究竟圆满之佛。也有一种把成佛和往生说成一回事。成佛也是往生，往生也是成佛。成佛也是死了以后成佛，往生也是死了以后往生，这是种糊涂认识。所以正确的定义：第一、『成佛』就是『往生』，『往生』就是『成佛』。所谓『往生』，就是妄想心见到了真心本性，妄想心就往生到真心本性，凡夫身就往生到佛菩萨愿身。这个『成佛』还有分真即佛与究竟圆满之佛之别。</p><p>同样『往生』也存在这个问题,是圆满的往生？还是部分的往生？也可以分别说为：先往生到佛土，在佛土再成究竟圆满之佛。往生到佛土，即是分真即佛，就是那种不圆满的往生。所以这个道理我们从佛的经典就可以看得出来。那个《无量寿经》是不是讲往生啊？明白了《阿弥陀经》、明白了《无量寿经》的真实义，当下多少多少菩萨往生到极乐世界是不是？《无量寿经》有没有讲往生的人当下烧出了舍利子、舍利花啊？《法华经》《楞严经》讲一场法会多少人证到什么什么果位，有没有讲当下这些人全部送到火葬场去，有没有啊？所以我们第一个概念，要确信往生和成佛，就是当下活生生的事情，绝对不是说死了以后，身体柔软了，露出了笑容，烧出了舍利花……哦,往生了！有没有这个说法？没有这个说法。《法华经》《楞严经》也没有讲，法会以后，无量的大卡车把那么多菩萨送到火葬场去，然后接着烧出舍利花，烧出了舍利子。多少人是住位，多少人是十地，多少人是等觉，有没有这个说法啊？可是我们现在很可怜呐！一提到往生一提到成佛一定是死。</p><p>现在第一个问题搞明白：往生也好，成佛也好，都是活生生的事情。与什么死了以后、死的之前没有关系的，我们现在就活生生地往生、活生生地成佛。</p><p>第二个内容我们要确定，听经闻法当然是听《法华经》《楞严经》『如来藏』大法，当下能够明心见性、当下能够成佛、了生死，这个是佛说！而不是魔说，也不是菩萨说，也不是天说，也不是人说。非佛而不能说，因为佛是过来的人。把这个道理要搞明白，除了佛，谁也没有资格说，我们在这里都是现买现卖。这个问题搞明白，我们读《法华经》，《法华经》整个从头到尾，少说有五六处，多说十几处、几十处乃至一百多处，总有这么几段经文，讲修行人听佛讲了一段什么经，当下证到什么法眼净、总持陀罗尼、阿罗汉、辟支佛、十地等觉，这些经文是不是很多？但是有没有讲说：听佛讲了这一段经以后，经过几年拜佛，几年念佛，几年盘腿打坐，有的人证到什么什么等级?有没有这些节外生枝？</p><p>在这要特别强调有一个【时】。听佛说《观音菩萨普门品》【时】、听佛说《如来寿量品》【时】……我们好好想一想是不是很多？不是一处两处，不是偶尔，而是佛故意地反反复复咬住不放，就好像拽着耳朵、捏着眼皮子，你好好看，是不是这样讲的？是不是这种气氛呐？所以《法华经》是这样讲。在《楞严经》讲摩登伽女，听佛几句话证三果罗汉是不是啊？再听文殊菩萨几句偈颂，证四果罗汉是不是？佛在《楞严经》讲【发明便解脱】【当业轮转，当处出生】。『当处出生』，是不是当下这个凡夫当下就成佛啊？『当业轮转』，我们这个意业是根本之业，明心见性为佛业，是不是当下就随佛业成佛啊？在《楞严经》倒数第二段，佛讲啊，有一个无恶不作的坏人，一瞬间、眨眼睛的功夫，就要下无间地狱，他明白了如来藏的道理，所有罪过一笔勾销，变地狱为佛土。所以从记载法会的事实是这样，从佛的金口玉言也是这样。</p><p>按照《法华经》就是说【一念欢喜心，蒙佛授记】，讲一句《法华经》的功德，胜过太虚空级的大法师讲无量的经典成就无量的阿罗汉。那么太虚空级的大法师是不是比阿罗汉还要高啊？那你比太虚空级的大法师还要高，你是不是最起码是阿罗汉？是不是了生死了？《法华经》讲『一念信解如来寿量品，胜过修布施、持戒、忍辱、精进、禅定，无量法门无量劫功德无量倍』，有这无量的功德你成不成佛啊？一念赞叹《法华经》，即为供养无量佛，即为供养一切佛。一个供养一切佛的人他会不会落六道轮回？如果这样的人落六道轮回的话，那诸佛就成了忘恩负义了。好好把这些道理想明白。</p><p>《阿弥陀经》是一切佛法的总纲，它是「法华秘髓、华严小本」，这更是言简意赅、法味无穷。【即已食时，还到本国】就跟吃饭一样，尝到了甜的巧克力你就是甜嘴巴，尝到了阿弥陀佛的味你就是阿弥陀佛，是不是【即已食时还到本国】？所以《阿弥陀经》讲【已发愿已往生；今发愿今往生；当发愿当往生】。可是我们现在变成：已发愿者，经过五十年念佛，大家送往生，今往生；今发愿者经过十八年拜，经过大家助念,当往生；当发愿者，怎么样怎么样，再当当当往生；现在是不是形成这种气氛？这种气氛是不是《阿弥陀经》的原汁原味啊？不是的。所以我们要坚信听经闻法,听闻『一心三藏』这个大法而明心见性的人，当下不用离开讲堂、不用离开桌椅板凳，就当下了生死、就成分真即佛。这个法重要啊。</p><p>老佛爷金口玉言、诸佛如来金口玉言，尽被我们修行人当成耳旁风。古今中外有几个人这样拍桌子打板凳、狂呼乱叫「听闻大法当下成佛」?悲哀啊！佛门悲哀啊!佛语不信,那些魔语、鬼语你们却把它当真，而且你们不要以为就是《法华经》《楞严经》这样讲，三藏十二部经都是这样讲啊。那个初果罗汉是不是直接通过「听经闻法」来证果啊？证到初果罗汉就不落三恶道。舍利弗、憍陈那、摩登伽女是不是通过听经闻法直接证四果罗汉？他修了没有、证了没有？连小乘法证小果，他都懂得听经闻法当下成就。小经证小果，但证不到明心见性的菩萨。因为它的教理只有那么大明白吗？</p><p>我们现在有几个人相信啊？太浮躁。讲经说法的人这些问题也讲不清楚。有些是打马虎眼回避或者轻描淡写，讲得有气无力……所以现在有些人诽谤师父诽谤大法，他不敢谤佛法。「啊呀,山西来了个和尚说:听经闻法当下就能成佛,快去听啊!嘿嘿……」，阴阳怪气,显得自己那么清高、那么潇洒、那么鄙夷不屑!这些众生可怜!可怜到极点!何必这么抬举我?这不是我讲的，这是诸佛如来金口玉言，而且讲这些话根本都不需要理解,不需要讲解，一目了然,你却看不懂，是何道理？</p><p>你们好好把《法华经》《楞严经》看一看，凡是涉及到当下成佛不离板凳，当下成佛，根本不需要解释，为什么视而不见？读经的人明明读到这一点，但是连他的心也出卖了，出卖给歪门邪道了，他明明读到这一点,但他不往那处想，这就是悲哀。我们都要生惭愧心，不能光怪邪门歪道。我们应该能看懂啊！你们好好看一看是不是这样？是啊。这些东西我们就应该看懂啊，哪要师父讲啊，根本不要师父讲。所以谣言可以杀人，他就瞪着眼睛撒谎,蒙蔽人，这就是利用众生的下劣心、愚痴心。所以把这第二个问题搞明白，我们对问题又解决了三分之一，加起来是不是解决了三分之二？解决了三分之二，其实我们心就已经稳定了，你信也信，不信也得信，为什么？佛在《法华经》《楞严经》讲的法，你如果不相信，祖师大德讲「三藏十二部经都可以一笔勾销!无量法门都可以一概否定」。你不要去做现世宝，法王在经王所讲是金口玉言，你都不能相信，你还信什么佛？你还信什么法？</p><p>下面我们解决第三个问题：为什么讲听经闻法、明白道理以后，当下就能成佛、当下就能往生？</p><p>我们来打第一个比方。这个茶杯，比方是茶杯盖子大还是茶杯大？茶杯大是不是？如果以茶杯盖大的气球能不能把茶杯这么大的铁块带上天？不能。如果把大殿这么大的气球能不能把这个茶杯带上天？这就是比方我们无量劫以来，我们造的种种的业障不管心量大心量小，这么大的业障少不掉是不是？它不会变，这是固定的。我们业障你没有办法叫它变大变小，但是我们心量能不能叫他变大变小？当我们心里只有我、只有家庭，或者只有这个地球或者西方极乐世界那个阿弥陀佛的时候，我们的心量就是茶杯盖大的气球，明白吗？当我们的心量，知道尽虚空遍法界、过去现在未来、无尽虚空都是我，都是阿弥陀佛的时候，你这个时候的心量是不是就有大殿这么大？是不是这个道理啊？所以我们这个时候心量到了大殿这么大的时候，能不能把我们的业障带到极乐世界去？能不能带走啊？能。这就叫带业往生。如果不带业往生，我告诉你谁都不能成佛，包括阿弥陀佛，他都不能成佛。我们带着业往生到佛土去，然后再成究竟圆满之佛。一定要搞明白这个道理。</p><p>我再打一个比方给大家看。比如说指甲盖大的一块老鼠药，如果放到茶杯里融化以后，人喝下去，是不是会当下一命呜呼啊？如果我把这么大的一块药放到太平洋里去，放到太湖、黄河里去或者放到长江里去，我们再喝江水、湖水、海水,人会不会毒死？不会。为什么？它已经稀释掉了是不是？那么换句话来讲,我们无量劫以来造的种种业，不管你心量大、心量小，这个业能不能变大变小啊？不能。可是我们的心量能不能变大变小啊？可以。心里只有我，只有家庭，只有极乐世界那个阿弥陀佛，我们就是茶杯大的心量。你必然要六道轮回里受苦，是不是？我们心量是尽虚空遍法界都是我，这个心量是不是大海啊？大海是不是把我们这一点业障全部消掉啊？不管是实病、虚病，业障是不是全部消除掉？ </p><p>再打第三个比喻。有一个很坏很坏的坏蛋，他懂得电路。他到配电房去，怎么样捣鼓他会不会触电死亡？不会。有一个非常非常好的正人君子、劳动模范、非常慈悲,是大好人，可他不懂得电路，他跑到配电房去捣鼓是不是不想活了啊？所以明心见性的人即使他再坏再坏，他掌握了这一门活计，这一门手艺，他得救了，明白这个道理了吗？成佛了生死是讲真实,不是讲善恶。你这个技术你掌握了没有了？知道真理的人他当下即是善，但是他不可能做到尽善尽美，习气还难免。</p><p>我们再打第四个比方。比如驾驶员开汽车。如果说一个刚才讲的那个正人君子、大好人、大善人他不会开汽车，他去开汽车是不是会车毁人亡？强盗土匪、杀人犯、潜逃犯逮着一部汽车开地忽忽转，他会不会出事啊？同样是讲我们掌握一门技术的问题。我们掌握了生死之技术，自在无碍，在佛法是讲真不是讲善，不是讲恶。所以现在以善、以第二义谛来冒充佛法,罪过无量，比强盗土匪还要坏。强盗土匪害人止于一人一次，好人害人他可以害无量的人，害你这一个人的无量的生生世世。而且这个好人，还是真好人，他想许多人都成佛。正因为他是真正的好人，所以才能害人明白吗？所以最慈悲的姥姥、姥爷、爷爷、奶奶不能当老师，慈悲的母亲也不能当老师。严父、严父，做老师的搞不好给你瞪一个眼睛，几个耳巴子打上去了，他才能当半个老师。真正的老师是学校里的老师教你学技术,学做人，可是我们往往拜好人为师，这是一种悲哀。讲到这个法是不是不通人情啊？正法是不讲道理的道理，是无情的慈悲。</p><p>第五个比喻。仍然以开汽车为例。驾驶员碰到紧急状况，急刹车。虽然急刹车，是不是仍然往前滑行几公尺啊？虽然滑行几公尺，他会不会车毁人亡？不会。因为他掌握了技术。虽然掌握了技术，虽然急刹车，它还要往前滑行，这就是汽车的惯性，这就比喻我们已经明心见性的人，虽然明白万法都是我，但是境界现前、烦恼现前的时候，我们仍然会破戒、犯戒，这就是我们的惯性，明白吗？虽然有惯性，它影响不影响我们往生成佛？它不影响的。我们主体上已经能把握自己。所以那个惯性是不是烦恼习气啊？因为我们无量劫以来已经形成了这些习气，境界现前的时候，很难一下克服。</p><p>我们再来打第六个比喻。比如说我们掉到水里去了，掉到水里去的时候，你眼睛敢不敢睁开？不敢睁。管它是死是活，眼前亏不能吃,是不是？鼻子通的，眼睛闭得紧紧的是不是？这个时候六道轮回的危险并没有解除，当我们一旦眼睛看水的时候，你还有没有生命危险了？没有了。虽然没有，眼睛看到水的时候，人是不是还在水里啊？还在水里就证明你还在烦恼中。也就是说我们明白『一心三藏』道理的人，他已经明心见性,就见水离水、知妄即真。虽然还在水中，那是我们的烦恼习气，但见水，我们已经离开水了,已经离开了危险。大家明白这个道理了吗？乃至上到岸上以后，衣裳还是湿的，仍然是烦恼习气，以后衣服干了换上新衣服了是不是就成佛了？这个道理大家能不能搞明白啊？</p><p>我们再打第七个比喻。从我们这心力速度来看，比如说从这里到百丈镇是五公里的路，我们一念是不是就到百丈镇啊？那从这里到杭州，比如说是一百公里,那么我们一念把杭州想起来是不是也是一念？假使说我到百丈镇五公里，这个距离一念是一秒钟的话，那么我一念到杭州的时间需要不需要二十秒钟啊？不需要。可杭州一百公里啊是五公里的二十倍啊，我这一念也不要二十秒钟，两秒钟要不要？也不要。一点一秒钟要不要啊？也不要，都是一秒钟。那我这一念到美国、到太阳、到无量无量的太阳系之外的太阳，比如说那个地方，我曾经去过，是不是也是一秒钟啊？</p><p>这里就有文章可作啊。时间相同，所走的距离不等，是不是距离越长速度就越快？速度越快，那个力量是不是越强？那个光是不是越亮啊？天上有的那卫星一飞，看到后面留下的白光，是不是刺激的发光啊？如果天上卫星跟拖拉机一样「突突突突......」它会不会发出光来？这就妙了。所以在我们生命的过程中，比如说我们生了什么病，你心发得很大,力量是不是很强啊？把那些有病的细胞是不是在震动的过程中，就把它震掉了？自行车骑得快是稳还是骑得慢稳啊？骑得快的它就不会倒，骑得慢的它就会倒了是不是？那么心力越快，速度越亮的时候，那有病的细胞、阴暗的细胞是不是给亮就化掉了？所以解决一个治病健身的问题，用好我们的心。所以心情开朗的人是不是脸上很光亮？那就是健康的标志。</p><p>那么涉及到我们在断气往生的时候，如果下三恶道:一方面是因为我们心里本身的黑暗，沉重而下去；另一方面,是不是我们冤亲债主找我们的麻烦呢？那么因为心力速度快了、亮了,他们能不能来得及看到我们呢？他眼睛都睁不开。因为我们心很亮速度很快，所以从这个角度来讲，如果我们心只想到我或者只懂得有个极乐世界，有个阿弥陀佛这个速度是不是很慢？我知道整个尽虚空遍法界都是我，那个距离、速度叫什么速啊？叫无量速。我们心叫无量速,随时等待着你来开发。你一念就能开发，一念就能把无量速开发起来。所以你就想一想,佛为什么在《法华经》《楞严经》讲一个长、讲一个多、讲一个大，用五百万亿恒河沙那由他阿僧祇阿萨婆恒河沙国土化微尘做标记，然后每隔五百万亿那由他阿僧祇恒河沙国土下一点做标记，再把它化成微尘数,然后这个数字还是这些数的五百万亿那由他阿僧祇恒河沙倍数，目的在哪里？就是在拓宽我们的心量。为什么告诉我们无量的十方三世一切万法都是我一个念之所变现呢？就是要拓宽我们的心量。就跟开电视机、开空调，把它调整到最佳状态，明白吗？</p><p>所以《法华经》《楞严经》实际上就是在调控我们的心，调色、调光、调音、调性，调到最佳状态。所以【听经闻法】是不是在调啊？调心、在调理啊？就是这么简单。所以我们想一想佛为什么在《楞严经》讲【决定成佛，譬如以尘扬于顺风，有何艰险？何籍劬劳，肯綮修证】？讲得雄赳赳气昂昂、斩钉截铁、毫不拖泥带水，讲这句话，我们是不是感到喜气洋洋啊、洋洋自得啊？就是这样啊。所以我们讲《法华经》讲《楞严经》讲《过五关度六将证菩提》，其实就是在拓宽我们的心量，把我们的心放大，把我们的心亮堂。打这七个比喻是不是叫七菩提分啊？这也是七菩提分。</p><p>那么我们现在打了这七个比喻，再结合佛的金口玉言，我们一定要深信不疑:「听经闻法，明白了一心三藏道理当下就成佛、当下了生脱死、当下就是愿身菩萨」这个法。我们还可以依样画葫芦，你们从各种不同的角度来打比方。所以以自己本能的智慧，我们就能判别就能印证一种法它是不是真理，就是我们自己印证自己。</p><p>这个专题开示我们就讲到这里。</p><p>请大家合掌。</p><p>愿以此功德，普及于一切。我等与众生，皆共成佛道。</p></div>"
    }
]