[
    {
        "title": "印广门清法师开示：【如是我闻真实义】（文峰寺）",
        "html": "<div class=\"B1_text\"><div class=\"text-center\"><div class=\"text-indent\"><strong>印广门清法师开示：【如是我闻真实义】</strong></div></div><iframe frameborder=\"0\" src=\"https://v.qq.com/txp/iframe/player.html?vid=g0311qyhwfg&amp;vuid24=Qgb4n0DHuwFznFFxIVoZKg%3D%3D&amp;url_from=share&amp;second_share=0&amp;share_from=copy&amp;auto=0\"></iframe><p><strong>通知：</strong>此《如是我闻真实义》(第五次文字修订版)于2020年7月发布，此前一切网上或网下流通之同名《如是我闻真实义》文字版，与此版本内容有出入之处，以此为准。</p><div align=\"right\"><strong>法华论坛</strong></div><div align=\"right\"><strong>2020.07.24</strong></div><div class=\"text-center\"><strong>如是我闻真实义</strong></div><div class=\"text-center\"><strong>（第五次修订本）</strong></div><div class=\"text-center\">印广门清法师主讲</div><div class=\"text-center\">        目录</div><p>▍如来遗嘱.........................2</p><p>▍妙法真义.........................5</p><p>▍心体法用.........................8</p><p>▍融会贯通.........................9</p><p>▍圆教正脉........................10</p><p>▍以喻助解........................15</p><p>▍佛之知见........................16</p><p>▍后五百岁........................17</p><p> </p><p> </p><p></p><p>    ▍ 如来遗嘱</p><p> </p> 尊敬的各位法师、各位居士、各位大德、各位菩萨，大家好！今天我为大家做一个特别的专题开示——《如是我闻真实义》。<p></p><p>    大家知道，佛法里三藏十二部经，每一部经开宗明义第一句就是「如是我闻」。在世间法里，往往一篇文章的题目就是这篇文章的灵魂和纲领。正文就是围绕这个纲领而展开，这叫纲举目张。三藏十二部经，每部经都有标题，且千差万别；可是诸经之首却千篇一律。换而言之，「如是我闻」是一切经典的总标题。所以它非同小可啊！真正明白「如是我闻」，就贯通了三藏十二部经；不仅如此，你也贯通了一切的世出世法，也贯通了整个十法界森罗万象一切万法。所以「如是我闻」这句话，对于修行人来说，举足轻重。</p><p>  </p><p>    我在几年前，曾着重从三个角度来论述净土法门修行的纲领和次第：第一，唸佛不能成佛，唸佛不能往生；第二，念佛一定成佛，念佛一定往生；第三，念佛当下成佛，念佛当下往生。之所以提出这样的说法，就是依据「如是我闻」。概括地讲就是：</p><p>    「如」者「阿」也，「是」者「弥」也，「我」者「陀」也，「闻」者「佛」也。「如是我闻」者，「阿弥陀佛」也。如是我闻，万法皆成；如是我不闻，万法皆不成。</p><p></p><p>    这是根据《楞严经》而提出。很多同修第一次听到这样的说法，一时不能理解，不能接受。不妨暂且放下这种疑惑，来看经文。《法华经》云：<strong>如是妙法，诸佛如来时乃说之，如优昙钵华，时一现耳！</strong>又云：<strong>此法华经能令众生至一切智，一切世间多怨难信，先所未说，而今说之</strong>。又云：<strong>是法华经于无量国中，乃至名字不可得闻，何况得见受持读诵？</strong>又云：（佛）<strong>所说经典无量千万亿，已说、今说、当说，而于其中，此法华经最为难信难解</strong>。</p><p> </p><p>    如是妙法，就是「一心三藏」。「如」就是真如，是「空如来藏」；「是」就是万法，是「不空如来藏」。「如」就是「是」，「是」就是「如」。心经云：<strong>色不异空，空不异色；色即是空，空即是色</strong>。优昙钵华是一种天上的华，三千年开一次；而天上一天又等于人间的几百年甚至几千年。你就明白，仅仅能够听到《法华经》《楞严经》的名字是有多难，何况又能受持读诵。诸佛出世都不轻易讲这部《法华经》，其中《法华经·见宝塔品第十一》中出现的多宝如来，有一世因为没人请法，便直接入涅槃，所以没有讲《法华经》。在我们娑婆世界，因为人均寿命较短，几乎一个大劫就有一尊佛出世。一个大劫就是几十亿年。在别的佛土，诸佛出世可能要几百亿年几千亿年才会示现一次。</p><p>    即使是释迦牟尼出世，也是一直到72岁才讲《法华经》。而这72年当中又有多少人当面错过？《法华经》是佛的临终遗嘱啊！你能受持这部经典，必定是成正觉，而且不需要三大阿僧祇劫！龙女听文殊菩萨讲一部《法华经》，当下证得圆满佛果。不可思议！这是圆教，是醍醐灌顶，只看你能不能接受。</p><p></p><p>    当年法华会上，弥勒菩萨、舍利弗刚刚请法，佛还没开讲，五千弟子当下退席。当时法会现场也就两万人，直接四分之一的弟子给佛难堪。正因为如此，才更加显示出《法华经》殊胜之处。因为《法华经》在无边无际的佛法大海中，是第一难信、第一难解、第一难遇的妙法。不管是不是五千人退席，佛都要讲《法华经》。因为诸佛出世就是为了这一件事：由宣讲《法华经》，而开众生佛之知见，示众生佛之知见，令众生悟佛知见，令众生入佛知见。一旦讲完，佛便入涅槃。对于这部经的分量，暂且说到这里。我们该以怎样的态度来面对？下面言归正传。</p><p>    圆瑛大师讲：如是之法，按本经（楞严经），如来藏妙真如性为如，如者不动之义，藏性遍满虚空，充塞法界，湛然凝然，如如不动。一切事究竟坚固为是，是者无非之称，将一切事相之法，悉心穷究，究到毕竟之处，即所谓彻法流之源底，全事即理，全相皆性，坚固不坏，无一物不是我心，无一法不是我体。</p> &#13;    注：圆瑛大师，民国高僧之一，祖籍福建古田，九次被当选为中国佛教界首席会长，研究《楞严经》五十余年，著有《楞严经讲义》留世，被世人称为「楞严座主」「楞严王」「楞严独步」。 再看阿弥陀佛，是由梵语音译而来，意译呢，「阿」是「无」，表空，也就是无形无相的真如；「弥陀」是「量」，表色，也就是无穷无尽的万法；「如」就是「阿」，「是」就是「弥陀」，「我」就是「佛」，「如是我」就是「阿弥陀佛」。<p></p><p>    这个法传出以后，在教内震动很大。事实上，如前人所说：石破天惊说法华，风起云涌演楞严。如果这个法传出去无声无息，这是失败的。今天，我针对诸多同修的要求，具体从五个方面来解释「如是我闻」。</p><p>首先，「如是我闻」的最初出现，起到了四个作用:</p><p>    第一，断除众疑。阿难尊者无量劫以来为佛侍者，法相庄严，心地慈悲善良。佛有三十二大人相，而阿难就有三十。所以当结集经典时，阿难当众复述佛陀四十九年所讲之法，大家会以为：佛不是灭度了吗？怎么又出世了？或者认为现在阿难成佛了吗？是不是又有他方佛到我们这里来示现？所以阿难把「如是我闻」一讲出来，大家都知道，这是佛的「临终遗嘱」。</p><p>    第二，秉佛遗嘱。当年佛在世讲经49年，任何一场法会，任何一部经典，从未提到「如是我闻」，包括《法华经》《楞严经》。在佛即将入灭之时，阿难还有情执，悲痛欲绝。由阿那律陀尊者（佛的堂弟，四王八子之一）提醒，阿难最后向佛请法：一、佛在世我等依佛而住，佛灭后我等依谁而住？二、佛在世我等依佛为师，佛灭后我等依谁为师？ 三、佛灭后结集经时一切经首，当安何语？四、恶性比丘，佛灭后如何处之？佛答：一、依四念处住。二、以戒为师。三、当来结集经时，一切经首当安如是我闻、一时，佛在某处，与某某大众俱。四、恶性比丘，默而摈之。</p><p>    第三，息除诤论。参加收集整理经典的都是证四果的大阿罗汉，乃至很多法身大士。若论资排辈，有很多人的道业都远在阿难之上。因为阿难是过目不忘，入耳成诵，同时阿难身为佛的侍者、佛的法藏，依佛的教诲讲「如是我闻」，然后再把佛在各个时空点所讲之法复述出来，这是理所当然。</p><p>    第四，区别外道。有些人读经时，他首先要看这是哪一派的经典。所以这个「如是我闻」让大家一目了然，知道这是佛法经典。那些自然外道，以「有」为宗的，每一部经开头必然用「忧」；以「空」为宗的，它一定是用「阿」。而佛法是诠释宇宙人生的真理，当然不可以混同于外道。所以佛恒顺世间法，用「如是我闻」作为佛经的开头语。</p> &#13;  注：四王八子：一，净饭王生二子：第一子，梵语名悉达多，即释迦牟尼佛也。第二子，梵语名难陀，也就是孙陀罗难陀。二，白饭王生二子：第一子，梵语名调达，也就是提婆达多。第二子，梵语名阿难，佛的侍者。三，斛饭王生二子：第一子，梵语名摩诃男，从佛出家，即于鹿苑中最初得度五比丘之一。第二子，梵语名阿那律，天眼第一。四，甘露饭王生二子：第一子，梵语名婆娑，从佛出家。第二子，梵语名跋提，即于鹿苑中最初得度是也。这八个王子全部出家，以及佛的儿子罗睺罗——在十大弟子中是「密行第一」；佛的妻子耶输陀罗、姨母摩诃波舍波提以及数百释迦宫女等成为僧团的第一批出家女众。在佛72岁那年，邻国的琉璃大王率兵血洗佛的故土迦毗罗卫国，释迦族遭到惨重的大屠杀，几乎亡种。而琉璃大王被佛的威德所震慑，不敢对僧团下手，并和他的军队七天之后在海上被大火烧死，下无间地狱。  ▍妙法真义 讲它的真实义，「如是我闻」这四个字说尽了宇宙人生真理，讲透了真心本来面目。它对整个十法界一切万法的来龙去脉、相互之间的关系，作了高度概括和总结，不是世间法可以来妄计测度的。讲到底，它是「明心见性」之说。<p></p><p>    万法就是「一个我」，「我」就是万法，就是我们「一个念」，这是讲无分别法。但这么笼统地讲，众生不能开智慧啊！所以，还要按照藏、通、别、圆的分别法来开示：</p><p>    「如」是我们的自性本心，它没有任何的形相、大小、动静，但它却是真实的存在——它对应为「空如来藏」；而「是」是讲万法万相，大小多少、高矮胖瘦、红黄黑白、有情无情，总之我们能够耳闻目睹、身受心想所涉及的一切的范围通通包括在内——它对应为「不空如来藏」；「我」就是把「如」和「是」圆融圆满圆通为一体——它对应为「空不空如来藏」。</p>&#13;  注：圆瑛大师讲：实相有三，即三如来藏：一、无相之实相：无一切妄法差别之相，只有一真平等实相，即空如来藏，空诸一切，虚妄染法之相，并非本体而全无也，乃藏性不变之体。二、无不相之实相：并非无相，而能随缘现一切相，即不空如来藏，具足十界诸法，非无诸相也，乃藏性随缘之用。三、无相无不相之实相：若言其无，则不舍一法；若言其有，则不立一尘，即空不空如来藏，真空不碍妙有，妙有不碍真空，乃藏性体用双彰。 细说呢：这个「如」，是我们的真心本性，「法尔如是」。这个「如」，没有过去、现在、未来，没有东南西北上下十方；但它又是无穷无尽、无边无际，其大无外，其小无内。在山河大地、日月星辰、诸佛菩萨、天人鬼畜等一切的万法出现之前，它就是真实存在；在显现出山河大地、日月星辰、诸佛菩萨、天人鬼畜以后，它仍然是个无形无相的真实存在，灵明不昧。它不现一相，不现一法，但是万法万相皆依它而有。好好观照，这个法很难讲。它不现一相，但万法是不是都由它现的？这叫什么？现而不现，不现而现。过去、现在、未来，它始终保持这种如如不动之心。<p></p><p>   「是」，表十法界一切的万法——从日月星辰、山河大地、树木花草、风云雨雾，到诸佛菩萨、天人鬼畜，一切的有情，种种的妄想、分别、执着、造作，一切的生、住、异、灭，万法、万相，都叫「是」。那么这十法界万法怎么来的呢？就是由这个「如」变现而有。在《楞严经》讲，我们的真心本来面目「离一切相」，这就叫「如」；「即一切法」，这就是「是」。「如是如是」，这就是我们的真心本来面目。</p><p>    我们把真心本来面目说为「如」和「是」，说为「性」和「相」，是为了方便理解；而这个「性」和「相」呢，不是说合在一起才是「一」、才是「我」——这个性当下就是相，相当下就是性。你讲它是一嘛，它有性和相这两种概念；你讲它是二吧，它当下就是一。「闻」就是见道了。「如是我」，这是一个本体，不管你闻也好，不闻也罢，都是一个「如是我」。下面我们再通过打比方来观照这个道理。什么叫「如是我闻」？</p><p>    比如，我在这里讲「歇即菩提」四个字，讲出来的话，在空气中有振动，这是不是有声音相啊？那么「歇即菩提」，当讲出来以后，眼睛是不是能看到﹙银幕上现出这些字﹚？这是文字相。那么这个「歇即菩提」还有字义。所以，我刚才讲出的这句话，可以笼统地称为「相」，称为「如是」的「是」。</p><p>    我问大家，在我没有想没有讲、你们没有听到之前，「歇即菩提」这几个字的字形、字义、字相在不在啊？它一定在，是不是？如果不在的话，你怎么样想都想不起来，就更不用说讲出来；讲不出来就更不会听到、看到了。这就是「如」，虽然在，你能不能看到？听到？闻到？嗅到？或者尝到？不能。一旦看到、听到或者想到，它已经变质了，变成了「是」。</p><p>    世间人很固执，他认为眼见为实、耳听为虚。你讲这个无形无相真实存在的东西，他很难相信。六道凡夫可怜就可怜在这里——「执相昧性」，他执着在眼、耳、鼻、舌、身、意六根上，心往外攀缘色、声、香、味、触、法六尘，而做种种的妄想分别。你把这个念念生灭的妄心当成了真心，不停地攀缘，不停地妄上加妄，不知道妄到哪里去了。不仅是凡夫，大部分修行人也不懂得真心是什么。在《楞严经》第一卷，佛问阿难心在哪里，并一一破除阿难的七个邪知见，阿难的回答几乎代表了所有众生所执着的妄见。经云：<strong>无始生死根本，则汝今者与诸众生，用攀缘心为自性者。</strong></p><p>    那再看无情物。随便举一茶杯盖，看它是不是「如是我」。首先，它是一块铁，就是「是」，毫无疑问。这块铁是怎么来的？在形成铁之前，它虽然在，你能不能看到这个形相？不能，因为铁是从矿石中提炼出来的，矿石又来自泥土；那这个泥土是从哪里来的？心变出来的，这就是「如」。</p><p></p><p>    我在讲《过五关度六将证菩提》的过程中经常带大家做一个实验：双手合掌，三分钟打妄想，让左手比右手长1cm甚至更多。在这个实验里，这1cm的指头在长出来之前，它在不在心里啊？虽然在，有没有任何形相？没有，那就是「如」。以此类推，这个世界上，从有情到无情有没有哪一法不是「如是」？没有。从有情到无情都是这个「如是」。</p><p>    我们再来思维，我的这个「如」和你的那个「如」，和牛马猪羊的「如」、泥巴瓦块的那个「如」，能不能分出「张三如、李四如、土如、牛如」？不能分。因为这个「如」无形无相，没有边界。是不是只有一个「如」啊？是。一切有情无情，一切万法，其本来面目就是一个「如」。经云：<strong>诸有智者，要以譬喻得解。</strong>我们要善于打比方，帮助不同根机众生体悟圆教大法。</p><p>    比如拳头是「如」，手掌为「是」；在拳的当下，心能不能看到掌？眼看拳，心见掌，这就是「明心」——明白从「如」现「是」，心现万法；展开拳头后，眼睛看手掌，心能不能看到拳？能。这就是「见性」——明白「是」由「如」现，万法由心所现。明白这个道理，就是「别教」的明心见性。别教以「次第三藏」为宗。它回到「相」上就能见到「性」；它回到「性」上就能看到「相」。明白这个道理，就是「别教」的明心见性。</p><p>    那么圆教的修法，在当下「任何一法」同时见到「一切万法」之「性」，「一修一切修，一证一切证」。比如手套大法，在指头这个「相」能看到这里（气球手套的空心）的「空性」，同时看到无量的指头。这个指头就是全体，这三个指头又是这一万个指头，这就是圆顿大法见的「如是」，这叫「如来藏为总，万法为别，互为总别」——「别」就是「总」，「总」就是「别」；还有「互别为别」——没有哪一个不是哪一个，没有哪一部分不是哪一部分。把这个道理搞明白，就是「圆教」的明心见性。</p><p>    以做梦来打比方，可以更深一步地观照「如是我闻」。我们梦中是不是出现父母、儿女、姥姥、姥爷、同事、同修，也有很讨厌的冤亲债主啊？是不是也梦到牛、马、小猫、老鼠？还梦到桌椅板凳、花瓶、沙发、起风下雨、日升月落，乃至牛屎狗粪，是不是？那么，梦中这一切与梦外的境界有没有关系啊？没有。所以都是我们一个念变出来的。</p><p>曾经有人提出反对。他说：「怎么没有关系？如果我没有老妈，怎么会梦到老妈？」我再问他：「你有没有梦到过你从来没有见到、听到的东西？」他说有。所以梦中的境界很复杂，不能强词夺理；而且有的提前梦到未来，是不是？</p><p>那在做梦的当下，你能不能看到、听到、想到或者知道那个正在一边做梦一边打呼噜的人啊？不能。虽然不能，那个做梦的人（那个念）在不在？在。如果不在的话，你这个梦没办法做，是不是？做梦的那个人就是「如」。梦中的境界就是「是」。其实，做梦就是真人通过种种蛛丝马迹来帮助我们开智慧。</p><p>    既然梦中的一切都是由一个念变出来的，梦中的老妈是不是梦中的老爸？梦中的老爸是不是梦中的那台电视机？梦中的电视机是不是梦中的一只小花猫？有没有哪一样不是哪一样啊？这就是圆顿大法的「如是我闻」——从诸佛菩萨到天人鬼畜、再到刮风下雨一切的万法，都是由我们一个人一个念变现出来的。</p>&#13;   ▍心体法用 那么好好一个念，怎么会变出了万法万相呢？方便说，真心为「本体」，万法为「妙用」。体为用所依，用为体所现。正所谓，体用不二。下面举几个例子。<p>    地球人三分钟，手能长出来这么多；而天人不用三分钟，也不用半秒钟，只要一个念，一下即可冲到九霄云外，还能变出无量的化身，就像孙悟空那样。《法华经》也有讲妙音菩萨、观音菩萨三十二应身。因为地球人烦恼习气重，对名闻利养太执着，所以心力很小，已经是强弩之末。那什么时候心力大呢？</p><p>    比如，有时候在梦中想方便，厕所马上现前。如果我在这里（讲经堂）想方便的话，能不能马上现一个厕所？不能，为什么？因为我们白天心乱，而梦中眼、耳、鼻、舌、身五根对外五尘停止攀缘，停止妄想，只有一个梦中「独头意识」起作用，这时心力爆发，不可思议。如果你能定下心来，要不了十年八年，你穿墙越壁，都无障碍。你也可以入定变成虚空，变成一团火。然后你一出定，这团火又变回你这个人。一切都是由我们的心所变化。</p><p></p><p>    2005年我到山西阳曲县，有一位六十几岁的老居士向我请法，说：「师父，有一件事情，我到现在都想不明白啊。有一天晚上，我在按照墓林僧画道道念阿弥陀佛，画到九点多，清清楚楚明明白白，眼前一片光明。这个时候老婆从外面进门叫了一声说，黑咕隆咚干什么？吓我一跳。当下一片漆黑，这是为何啊？」所以我们专心致志时，这个心是明亮的。由此推断，白天、黑夜、红太阳、黑月亮都是假的，都是我们的同分妄见。</p><p>    当年鸠摩罗什大师，七岁随母进寺庙拜佛。他自己跑到外面来，把庙门口的千斤宝鼎一个手指举在手里玩。别人看到很惊奇，说这个千斤宝鼎他们十个人都抱不起来，一个六七岁的孩子就举起来了。话一出口，宝鼎唰地落地，小鸠摩罗什再用劲推，却纹丝不动，一刹那间，判若天地。所以是不是这个心在作怪？在此之前他没有重量的概念，抱千斤宝鼎跟玩纸团一样；而有了这个概念以后再推，宝鼎却不动了。要明白，一切的一切都是心在作怪。上天堂，下地狱，全凭自己把握，这叫「命自我立」。</p>&#13;   ▍融会贯通 下面，把「如是我闻」与种种经教所涉及到的一些名相概念互相贯通。<p>以拳头表「空」，表「如」，表「空如来藏」；手掌表「不空」，表「是」，表「不空如来藏」。拳头当下即是手掌，所以「真空不空」，叫做「空不空如来藏」；手掌当下即是拳头，所以「不空即空」，叫做「不空空如来藏」，调换一下，也是「空不空如来藏」。所以，「空如来藏」「不空如来藏」「空不空如来藏」当下就是一个东西。这叫「一心三藏」。</p><p>    对照「阿弥陀佛」，「阿」是「无」，也就是「如」；「弥陀」是「量」，也就是「是」，「我」就是「佛」，「如是我」就是「阿弥陀佛」。</p><p>   《心经》里有句「是诸法空相」：「空」即是「如」；「相」即是「是」。</p><p>   《法华经》提到「一实相印」：「一」就是「佛」，就是「我」；「实相」的「实」就是「如」；相就是「是」；也可以叫「一如是印、一阿弥陀印」。</p><p>   《楞严经》讲「离一切相，即一切法」：「如」即是「离一切相」，「是」即是「即一切法」，「一切法」当下即是「如」。</p><p>    再对照「一多无碍」。「如」即是一，「是」即是多，「一多」即是「如是」。</p><p>对照「理事不二」：「理」就是真心、本体，就是「如」；「事」就是妙用，就是如是的「是」，所以「如是我」是不是「理事不二」？</p><p></p><p>    打个比方，孙悟空摇身一变为茶杯，你知道茶杯当下即是孙悟空，这叫「见性」；知道孙悟空当下也是茶杯，这叫「明心」。孙悟空当下具备三德：法身德、化身德、报身德。孙悟空是「法身德」，茶杯是「化身德」，变化是「报身德」。</p><p>   「如是我闻」对应「三身功德」。「如」者，即性之说，「法身」义，「法身功德」也；「是」者，从性起用，「报身」义，「报身功德」也；「我」者，况相而论，「化身」义，「化身功德」也；「如是我」，真真如性，「正身」义；「闻」者，明心见性，「觉身」义；「如是我闻」，妙真如性，「净身」义。</p><p></p><p>    再对照「阿弥陀佛」：「如」就是「阿」，「是」就是「弥」，「我」就是「陀」，「闻」就是智慧，就是「佛」，「如是我闻」就是「阿弥陀佛」。</p><p></p><p>    学法贵在举一反三。你随便变动一个名词术语，就可以使听经闻法的众生生起欢喜心、好奇心。「如是我闻」就是「阿弥陀佛」。我们是不是天天念阿弥陀佛啊？是不是天天念「南无如是我」啊？你怎么样讲都是对的。圆教法中，没有哪一法不是哪一法。那你明白了「如是我闻」，你念「如来我闻」行不行？你念「阿弥陀我闻」行不行？都是一样。所以这个如是我闻，你说简单，就简单得要死；你说复杂，就复杂得要命。听者要随文入观，你得放下怀疑心、逆反心，这样才能入道。</p>&#13;   ▍圆教正脉 千经万论，处处指归，「如是我闻」是佛法的命脉，是佛法的总纲领，又是一切万法的灵魂、本体。不管是佛法、世间法、正法、邪法，你离开「如是我闻」，无从谈起。不管你承认不承认，不管你是行善还是行恶，是不是由本心在起作用？要明白。<p></p><p>    《法华经》就是讲「如是我闻」。那佛为了开示这个法讲了八年，都是讲《法华经》怎么重要；受持《法华经》得到什么福报；听闻《法华经》有什么功德；倘若你怀疑《法华经》，是得什么什么罪报……百分之九十九都是在讲这个法的重要性，是不是？无非是让我们以十分的重视来受持这部至高无上的经王，以期早日成就圆满佛果。</p><p>    《楞严经》无非是讲一个「如是我闻」，无非是讲一句「阿弥陀佛」，这点我们要刻骨铭心、深信不疑。「如是我闻」就是「楞严大定」、就是「法华三昧」。《楞严经》从前面的七处破妄、十番显见、八还辨见，无非告诉我们生死轮回的根本和成就涅槃的根本，再到第三卷讲的四科七大，一一皆是「如来藏妙真如性」。简单说，不懂楞严大定，以致轮回；懂得楞严大定，必取涅槃。道理非常简单。再到《楞严经》的中间几卷内容，详细讲解「一念不觉有三细，境界为缘长六粗」，由此产生世界相续、众生相续、业果相续——这是整部《楞严经》的重中之重。（详解看《一六八字讲记》）那么，「狂心顿歇，则三缘断，歇即菩提。」如来开示发觉初心二决定义：一是以因同果，二是从根解结。后文殊菩萨受佛敕命，从二十五圣圆通法门中，独选观音耳根圆通法门——这是从根本起修、全性起修、速得菩提的第一法门，初机众生必须按照这个法门来修，才能成就。反反复复就是讲这个「自性本定」，也是一切三昧之王。再到《楞严经》后半部分，讲如何修如何证以及五十种阴魔，仍然是以戒助定、以慧助定而已。</p><p>    《法华经》就是从正面肯定的方式来赞叹「如是我闻」，《楞严经》是全面由浅至深解释「如是我闻」。《楞严经》是详细地对《法华经》展开开示，《法华经》是对《楞严经》提纲挈领，高度概括和提炼。所以，从始至终，就是讲「如是我闻」，你「闻」了没有？闻者，当下明心见性，转凡夫业报身为菩萨愿身，果位是「分真即佛」，也叫「分证即佛」，部分地证到了圆满佛的境界。</p><p>    要用心体会，佛在遗嘱中为什么要规定每一部经以「如是我闻」开头。佛当年讲法49年，没有一部经提到「如是我闻」，包括《法华经》和《楞严经》，但里面有「如是等」，是不是？「如是等」是不是「如是我闻」？那么佛规定每部经以「如是我闻」开头，良苦用心就是说：我灭度以后，修行人必须以「如是我闻」作为指导纲领。明白了「如是我闻」，等于读懂了《法华经》《楞严经》。</p><p></p><p>    那明心见性以后，境界由浅至深；浅者不落三恶道，深者直到地上菩萨、等觉菩萨，乃至像龙女那样当下成圆满之佛——只用两只耳朵听而已，不离开讲经堂，你即已成就了。这个法称为「心地法门」，叫「全性起修」，跟其它法门不一样。权教还要「解行并重」，因为它那个道理不彻底，似是而非。所以佛把《法华经》《楞严经》以外一切的经典统统说为方便法、不圆满、不究竟之法，就是为了要我们坚信「如是我闻」。</p><p>    你果真闻得明白，就是「如来」！你现在还没有明白，你叫「如来藏cáng」，因为你心还没有解脱，那个「如来」自在的妙用还藏在迷失的妄想心中。自己给自己对号入座，现在是「如来」，还是「如来藏cáng」？</p><p></p><p>    注意，我们判教的依据不是根据天台宗，不可与天台宗的「六即佛」概念混淆一谈。智者大师在世时，听说自己创立的三观和《楞严经》的主旨非常相似——是相似、而非等同于《楞严经》的主旨，于是建造拜经台，向西求了十八年；遗憾的是，一直到圆寂，都没有见到《楞严经》。《楞严经》是在智者大师圆寂以后将近一百年才传到中土的。《楞严经》经题讲全了，叫做《大佛顶如来密因修证了义诸菩萨万行首楞严经》，什么是「如来密因」？什么是「修证了义」？什么是「自性本定」？这个「自性本定」和天台「止观」有根本的区别。不学《楞严经》，这些道理是无法透彻的。所以这就决定了天台三大部不是非常圆满的，还差一点点。希望我们本着实事求是的态度来面对一切的问题。我们的依据是交光大师所著的《楞严经正脉疏》和圆瑛大师的《楞严经讲义》。这两部大作在历代祖师所作《楞严经》的注解中，是最为权威、无可争议的。两位祖师在注解中，对天台三观有非常明确的评价。</p><p>    但是，智者大师被后人尊称为「东方小释迦」，这是毫无疑问的。如果不是智者大师对天台宗的继承和发展，以及历代天台祖师的薪火相传，我们今天弘扬《法华经》会更难。而且，天台历代祖师中，也有很多受持《楞严经》。每一个祖师大德都有自己的使命和法缘。佛法是不断继承和发展的，我们要实事求是。</p><p></p><p>    大家看《妙法莲华经·分别功德品》第十七：</p><p><strong>    尔时大会，闻佛说寿命劫数长远如是，无量无边阿僧祇众生，得大饶益。</strong></p><p><strong>    于时，世尊告弥勒菩萨摩诃萨：阿逸多，我说是如来寿命长远时，六百八十万亿那由他恒河沙众生，得无生法忍；复有千倍菩萨摩诃萨，得闻持陀罗尼门；复有一世界微尘数菩萨摩诃萨，得乐说无碍辩才；复有一世界微尘数菩萨摩诃萨，得百千万亿无量旋陀罗尼；复有三千大千世界微尘数菩萨摩诃萨，能转不退法轮；复有二千中国土微尘数菩萨摩诃萨，能转清净法轮；复有小千国土微尘数菩萨摩诃萨，八生当得阿耨多罗三藐三菩提；复有四四天下微尘数菩萨摩诃萨，四生当得阿耨多罗三藐三菩提；复有三四天下微尘数菩萨摩诃萨，三生当得阿耨多罗三藐三菩提；复有二四天下微尘数菩萨摩诃萨，二生当得阿耨多罗三藐三菩提；复有一四天下微尘数菩萨摩诃萨，一生当得阿耨多罗三藐三菩提；复有八世界微尘数众生，皆发阿耨多罗三藐三菩提心。</strong></p><p></p><p>    注意，佛跟弥勒菩萨讲，我讲如来寿命长远时——当年佛讲这一品2000多字，最多用半个小时——仅仅半个小时，修行人证果了。六百八十万亿，这个数字大不大呀？现在地球人有多少啊？连七十亿都没有，更没有八十万亿；那由他是六百八十万亿的一百多倍，后面还跟着恒河沙，又是个天文数字——得「无生法忍」。「无生法忍」是什么？不见少法生，不见少法灭。这最低是阿罗汉果位，超越六道轮回。</p><p>    看这里，佛有没有讲，我说是如来寿命长远时，大众又回去修了一百万年，然后又有多少人证什么果？有没有啊？是不是当下证果啊？下面呢，<strong>复有千倍菩萨摩诃萨，得闻持陀罗尼门</strong>，这往后我不全读了，也就是说千倍这样的人证到「初住位」的菩萨，微尘数倍这样的人证到「回向位」的菩萨，无量倍这样的人证到「地位」菩萨，乃至「十地」「等觉」。</p><p>    最后两句，<strong>复有一四天下微尘数菩萨摩诃萨，一生当得阿耨多罗三藐三菩提</strong>，这是「等觉位」。哪一四天下呀？就是一个太阳系，这么大国土的太阳、地球、月亮、星星、树木花草，化成微尘数，多不多啊？这么多证到十地等觉，中间七地、八地、七信位、八住位多得很，这些是不是圣位菩萨呀？</p><p></p><p>    《法华经·法师品第十》讲：<strong>又如来灭度之后，若有人闻妙法华经，乃至一偈一句一念随喜者，我亦与授阿耨多罗三藐三菩提记。</strong>《楞严经》讲：<strong>发明便解脱</strong>，是不是明白道理就成佛了？《心经》讲：<strong>照见五蕴皆空，度一切苦厄。</strong>「度一切苦厄」是不是成佛了？「照见五蕴皆空」是不是明白道理啊？明白道理了就成佛了。《佛说阿弥陀经》讲：<strong>已发愿已往生，今发愿今往生，当发愿当往生。</strong>有没有讲已发愿者，经过三年唸佛今往生；今发愿者，经过四年拜佛当往生；当发愿者，经过五年持戒当当当……往生？有没有？</p><p></p><p>    再看《法华经·譬喻品第三》：<strong>闻佛柔软音，深远甚微妙，演畅清净法，我心大欢喜，疑悔永已尽，安住实智中，我定当作佛，为天人所敬，转无上法轮，教化诸菩萨。</strong>这里是不是舍利弗自己给自己授记的？</p><p>除了舍利弗，其他声闻弟子无一不是这样。《法华经·信解品第四》第一段：<strong>尔时，慧命须菩提、摩诃迦旃延、摩诃迦叶、摩诃目犍连，从佛所闻未曾有法，世尊授舍利弗阿耨多罗三藐三菩提记，发希有心，欢喜踊跃，即从座起，整衣服，偏袒右肩，右膝着地，一心合掌，曲躬恭敬，瞻仰尊颜，而白佛言……我等今于佛前，闻授声闻阿耨多罗三藐三菩提记，心甚欢喜，得未曾有。不谓于今忽然得闻希有之法，深自庆幸，获大善利，无量珍宝，不求自得。</strong>这是不是自己给自己授记啊？是。怎么样自己给自己授记呢？我听到了稀有之法！我听到了稀有之法，我就清楚自己，无量珍宝，不求自得，是不是成佛了？</p><p>  </p><p>    成佛不成佛自己知道，在佛法里叫「解脱知见」，是「五分法身功德」（戒、定、慧、解脱、解脱知见）之一。不是等佛来授记，你才解脱了！你现在把《法华经》《楞严经》读懂，明白了一心三藏，你知道自己生生世世都解脱了！</p><p>《楞严经》的经题讲全了，叫做《大佛顶如来密因修证了义诸菩萨万行首楞严经》。「首楞严」是什么？一切事究竟坚固，不动不坏，不生不灭。心外无法，法外无心。你能坏得了谁？你能灭得了谁？「六度万行」等无量法门是不是包括在「楞严大定」里啊？你与一切的万法已经圆融为一体，与任何万法没有对立。不贪即是「布施」，不染即是「持戒」，不嗔即是「忍辱」，不懈即是「精进」，不动即是「禅定」，不昏即是「智慧」。「一乘寂灭场地」在哪里？是不是「当下一念」？所以圆顿大教是「全性起修」，一修一切修。我们听经闻法开智慧当下成就「分真即佛」，然后继续加功用行，深入观照，念念入智慧海，成佛不遭歧路。千万不可以断章取义，否则没有一个法是圆满的。</p>&#13;    ▍以喻助解 明白这个道理，无修无证，当下成「分真即佛」，而出六道轮回。虽然是佛金口玉言，虽然经典记载有许多案例，但是，为什么明白了「如是我闻」，当下成佛？我们打几个比方。<p>  </p><p>    第一个：有花生米大的一粒老鼠药放在茶杯里，我把这水喝下去，会不会被毒死啊？一定会。如果把它放到运河里，你再喝运河里的水会不会被毒死？不会。为什么？因为化解了，是不是稀释了？当我们的心量只知道有我，只知道西方极乐世界有一个阿弥陀佛的时候，我们的心量就是茶杯盖那么大，你能不能把你这个「我执」化成「如来」啊？不能。当我知道：不管是西方极乐世界的阿弥陀佛，还是道旁的小爬虫，他方世界的一个小乌龟，以及一切的十方的万法，都是一个阿弥陀佛……这种心量是不是很大了？那我的我执是不是化掉了？是不是成佛了？不就是解决这个「心量」的问题吗？</p><p></p><p>    第二个比方：这只气球能不能把茶杯带到天上去啊？不能。当我执着只有西方极乐世界有阿弥陀佛，我是凡夫，心量是不是这么大的气球啊？我的业障就是这个茶杯，那我能不能带业往生啊？不能。当我明白整个尽虚空遍法界都是佛、都是我、都是一个念，心量就是虚空大的气球，能不能把业障（茶杯喻之）带上去啊？叫「带业往生」。如果不带业往生的话，谁都成不了佛。</p><p></p><p>    第三个比方：从这里到扬州火车站假设是五公里，那我一念能不能把火车站想起来？这里到北京火车站不是五公里，假设是五百公里，是前者的一百倍，我一念能不能把北京火车站想起来？能。那么这一念到北京火车站需不需要一百秒啊？不需要。同样只用一秒。别说到北京火车站，就是到恒河沙数银河系之外之外的宇宙，都是一个念，都是一秒，是不是？那么时间相等，距离不一样，速度是不是大啊？我原来只知道有个西方世界阿弥陀佛，这个心量好比到扬州火车站；当知道一切的万法都是我，心量无穷增大，随之心力增大，心里很光亮，还会不会往下沉啊？不会。</p><p>    当年，菩萨（释迦如来在因地的称呼）的母亲逼着他出海打渔，他不想杀生，所以不去，然后为此踢了他母亲一脚，因为这个嗔恨心而下地狱。然而当他看到小鬼被抽筋剥皮，怜悯心油然而生。正想开口讲话说——我来替这个小鬼受苦吧，还没开口，身体不由自主飞到天上去了。大家明白吗？因为他的心与地狱的气氛不相适应。所以，「命自我立」。你怎么样用心，你这种气氛就与哪一个国土的气氛相适应。所以明白了「如是我闻」，明白什么是「佛」，明白宇宙人生的真理，当下即已往生！并不需要等明天，也不需要等晚上，更不需要等来世。那有些人会讲，那为什么我明白了，却不能飞到天上去啊？因为肉团身这个无明壳在障碍我们，所以在中阴身期间当无明壳解体以后，现量功德自然现前。这就是圆顿大法！不立阶梯，一步登天！</p><p></p><p>    好，经过这段开示，现在还有不明白，没有把握的同修也不要怕，不管你举手不举手，承认不承认，你的真如本性都不动，都是佛！</p>&#13;    ▍佛之知见 经云：<strong>诸佛世尊，欲令众生开佛知见，使得清净故，出现于世；欲示众生佛之知见故，出现于世；欲令众生悟佛知见故，出现于世；欲令众生入佛知见道故，出现于世。舍利弗，是为诸佛以一大事因缘故，出现于世。</strong><p><strong>欲令众生开佛知见，使得清净故，出现于世：</strong>「开佛知见」这一个「开」字，石破天惊，佛并没有讲「欲令众生得佛知见」。为什么讲「开」不讲「得」啊？因为众生本来就是佛啊！这个佛迷失在我们的妄想颠倒中，佛帮助打开你的「佛知佛见」，你就是佛，你悟不悟？</p><p><strong>    欲示众生佛之知见故，出现于世：</strong>「开」了以后，我往里一看，是不是当下现前了？叫「示」。非「开」而不能「示」。「示」是表信用，表真实。</p><p><strong>    欲令众生悟佛知见故，出现于世：</strong>「悟」，这就带有修证之义。当一「开」，看到全体是我的时候，他必然来回光返照自己，否定自己过去的知见，这就叫「悟」。</p><p><strong>    欲令众生入佛知见道故，出现于世：</strong>入佛知见，是无功用道，自然成佛。</p><p>    开、示、悟、入，看上去是四步，对于大根机者来讲，可以成就于一时——即开即示即悟即入。明心见性的菩萨四十二位法身，或者讲六十个圣位，其实每一分每一位它都有无量的等级。但是你可不要害怕，无量的等级按圆顿大法来修，成就于一时，成就于一念，叫「一步登天」。你从这个「开」起，可以证到初果罗汉，一直往上，乃至可以证到等觉位；当然像龙女那样的大成就也不是没有，但毕竟是极少数极少数。</p><p>    什么是「佛知佛见」？「佛知佛见」就是「一心三藏」。「一心三藏」说透了天地万法之来龙去脉及其相互关系，《楞严经》概括为「真真如性」。无量法界，上自诸佛菩萨，下至天人鬼畜，旁及无情万类，上层建筑，经济基础，总括为空与不空，及空不空，无非「真真如性」，一真之「人」，一「心」变现而已。</p>  &#13;    提示：法华经王、首楞严王乃是诸佛世尊金口告敕，毋容置疑。「成佛的法华、开悟的楞严」亦是千古共守、万圣共尊，无可变更。既是王，既是悟，就应当是入门课、基础课。我们听经闻法而当下解脱为分真即佛，在此基础之上，进修无量法门而成为圆满之佛。这个次第一定要明白，不可颠倒。     ▍后五百岁 讲到这里，这个开示基本算是圆满了，不知道大家有没有意犹未尽的感觉。在这样一个时代，我们能遇到正法，弘扬正法，不是普通的缘分。越是在这样的五浊恶世，菩萨越是要出世度化众生。佛经上经常提到「后五百岁」，就是我们现在。我想再回顾一下，使大家对我们佛法的历史和现状有一个更深的认识。后五百岁是第五个五百年。<p></p><p>    第一个五百年叫「解脱坚固」。如来灭度以后的最初五百年，正法气氛尚浓，解脱比较普遍；第二个五百年叫「禅定坚固」。也就是一千多年以前啊，农业社会的竞争不是那么激烈，人心纯朴，修禅定容易成就。你一个晚上就可以跟天人沟通信息。现在不行，到处车水马龙，气氛紧张得不得了；第三个五百年叫「多闻坚固」。「多闻」就是贪多求全，读的经典越多越好，修的法门越多越好。所以众生已经在形相上执着，只求「多闻」，不求解义，已经远离正法大道；第四个五百年叫「塔寺坚固」。兴建寺庙，求人天福报等等，佛法一片繁荣，这都已经变成似是而非；第五个五百年，就是现在，叫做「斗诤坚固」。当然，越往后越是「斗诤坚固」。也就是说，不通过斗诤，正法不能占领阵地，不能生存。</p><p>    因为《法华经》《楞严经》很难传啊。即使佛肉身在世，「尤多怨嫉」。即使当着他老人家的面都还有五千四众弟子当面给他难堪，退席。真正的四众弟子，承担着拨乱返正、挽救佛法的历史使命。那就是佛在〈见宝塔品〉大会上，登台点将：谁能在末法时代受持《法华经》？你当着诸佛菩萨的面站出来，给我讲一声！经云：<strong>诸善男子，于我灭后，谁能受持，读诵此经。今于佛前，自说誓言。此经难持……读持此经，是真佛子，住淳善地。佛灭度后，能解其义，是诸天人，世间之眼。</strong>又云：<strong>于未来世，若有善男子善女人，信如来智慧者，当为演说此法华经，使得闻知，为令其人得佛慧故。若有众生不信受者，当于如来余深法中，示教利喜。汝等若能如是，则为已报诸佛之恩。</strong></p><p></p><p>    好，法会圆满，祝大家吉祥如意！</p> &#13; 佛历二五五四年 扬州文峰寺  <strong>附</strong> 交光大师所著的《楞严经正脉疏》和圆瑛大师的《楞严经讲义》对天台三观的评价：<p>    交光大师《正脉疏》云：结心虽譬中道，然非兼彼空有，合成中道，亦非离彼空有，别立中道，乃是悟此根性，体自在而无系，本不属有，不迷为有而已，更不劳于观空破有也；达此根性，用遍现而互融，本不属空，不晦为空而已，更不劳于观有破空也。如后耳根圆通，既不执有，亦不观空，惟一反闻，亡尘顿入，由是三空渐证，妙体现而有自破也；俱空不生，大用起，而空自离也。是则反闻自性，即是结心，双超空有之中道也。前人不达，强以别安三观，其说支离，真蛇足也。</p><p>    圆瑛大师《楞严经讲义》说：如来以舍识用根，为修楞严要旨，所以三番破识，全破其妄；十番显见，极显其真；二决定义，一决定以因同果，不可以生灭识心，为因地心；二决定从根解结，必宜取真常根性，入涅槃门。此皆如来金口所宣，学者未可抗违。天台止观固善，但以经旨不合，故不可以止观，解释三定（妙奢摩他、妙三摩、妙禅那）别名。台宗先哲，解释本经，以如来藏为体，不生灭因果为宗，此解极好。若以止观释定名不特与经旨有违，与此体宗，亦复相背矣！</p><p>    又：权教多重事相，必假修成，实教则重性具，贵在了悟。未悟之先，法身本自现成，圆觉经云：‘一切众生，本成佛道，倘能一念回光，便同本得，但离妄缘，即如如佛。’岂同权渐之教，必历僧祗，方获法身耶？</p><p>    又：不修首楞严大定，无漏之静虑，即无有出世间，真正之智慧。</p> <div>"
    }
]