[
    {
        "title": "念佛能不能往生",
        "html": "<div class=\"B1_text\"><div class=\"text-indent\"><div class=\"text-indent\">尊敬的各位法师、各位居士、各位大德、各位菩萨大家好！</div><div class=\"text-indent\"></div><div class=\"text-indent\">今天为各位做一个专题开示，叫作《念佛能不能往生》。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我们今天这个专题的内容，是从诸佛菩萨教诲，并且结合我们日常生活来分析这个法它能不能成立。所以我们把今天这个专题的内容归纳为下面三句话：</div><div class=\"text-indent\"></div><div class=\"text-indent\">第一层含义，『唸佛不能成佛，不能往生』；</div><div class=\"text-indent\"></div><div class=\"text-indent\">第二层含义，『念佛一定成佛，一定往生』；</div><div class=\"text-indent\"></div><div class=\"text-indent\">第三层含义，『念佛当下成佛，当下往生』。</div><div class=\"text-indent\"></div><div class=\"text-indent\">所以明眼人一看便知，实际上我们是在【念】字上做文章。   </div><div class=\"text-indent\"></div><div class=\"text-indent\">   本师释迦牟尼佛没有在任何一部经典上，说『唸佛能够往生』。我遇到好多好多的念佛人，有的是整批整批的念佛人。我说：「唸佛啊，不把佛搞明白，不把阿弥陀搞明白，你唸了没有用啊」！所以不少的人他不服气，「你这个讲法不对，佛就是讲唸佛能够往生啊」！我说：「哪一部经讲唸佛能够往生啊」？有的人拿出《阿弥陀经》来，我说：「《阿弥陀经》我看了少说也有一万遍了，我怎么就没有看到佛讲唸佛能够往生啊」？这里首先讲清楚，《阿弥陀经》我最多读也没有读过十遍，哪有一万遍，我故意引起他的震惊。你读一万遍，还没有看到这句话，他感到很奇怪啊。我说：「你找给我看一看」，他很快就找出这一段经文，【善男子善女人……执持名号……】。我说：「对啊，佛讲善男子善女人唸佛能够往生呐，他没有讲男子女人唸佛能够往生啊」？讲到这句话，他震住了。我说：「你知道什么叫善吗」？他说：「善就是行善积德嘛」。我说：「不对，佛法里有我即是恶，无我方为善。要见无我之我，非如来藏之理之义而不可见。所谓如来藏之法，乃万善之最，你见了没有？就拿世间法里的善男子善女人，你做到纯善没有？你断了一切恶没有」？当然我们还是讲【如来藏】之善。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   也有人拿出《无量寿经》来讲，不仅念佛能够成佛，而且十念就能成佛。我说你翻出来给我看。一看，上面有个前提【所有功德回向极乐世界，十念必生】。我说：「对啊，所有功德回向极乐世界的人，哪有念佛不能往生的，没有这个道理啊，你是不是全部回向了」？你自己给自己评价一下。有没有百分之七十？有没有百分之五十？有没有百分之三十？「全部全部」，不见『如来藏』之道，谁都做不到全部。唯有「见之真性，见之本性，心外无法，法外无心」，方可称为『全部』。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   佛法里每字每句含义深刻，我们不可以粗心大意而过啊。也有人拿出《法华经》来讲，说《法华经》讲【若人散乱心，南无一声佛，皆以成佛道】，怎么讲念佛不能成佛啊？我说：「对啊，那《法华经》第一句是什么话啊」？他不用你讲，他也知道是【如是我闻】。我说：「对啊，在如是我闻前提之下，若人散乱心，一句佛号皆以成佛道。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   如是我不闻的话，你怎么样念也不能成佛。这个『如』，这个『是』，这个『我』，就是『一心三藏』。『如』就是空如来藏，『是』就是不空如来藏，『我』就是空不空如来藏，这三个如来藏次第圆融。每一个如来藏当下都是三个如来藏，你明白这个道理吗? 【如是我】就是【阿弥陀】,『如』就是『阿』, 『是』就是『弥陀』, 『我』就是『阿弥陀』。这个道理明白之下，念佛也能成佛。那个罗睺罗，谁也看不到他在修行什么法门，他也成佛。他明白这个道理，他修也是佛，不修还是佛。所以那个法华会上的佛菩萨，没有离开道场听佛讲了一段经，多少多少人证得果位：阿罗汉、辟支佛、菩萨、地上菩萨、等觉菩萨。罗睺罗虽然没有见他修什么行，他听经闻法敢不敢不参加啊？不敢的。所以不懂得修行的人，他只把修行看成是有形有相的有为功行，他认为听经闻法完全是明明理而已，他不懂的听经闻法可以直接证道、证果。所以我们从佛的这个角度，你们也可以发表言论，你们有没有看到佛在哪一部经，有哪一句话讲唸佛就能往生？就能成佛？</div><div class=\"text-indent\"></div><div class=\"text-indent\">   第二个我们再看从菩萨说法来看。文殊菩萨和普贤菩萨化现寒山和拾得两位和尚，讽刺国清寺的和尚。因为国清寺的和尚当时提出：「大声见大佛，小声见小佛」，所以这两位菩萨装的疯疯傻傻，一边鼓掌一边说顺口溜：「口念弥陀心散乱，扯破喉咙也枉然」。把喉咙念破了都没有用。心怎么散乱呢？他没有见到『一心三藏』，所以就散乱了。唯其见『一心三藏』法义之人，他心不乱。他知道虚空世界山河大地、风云寒暑、树木花草、佛菩萨、天人鬼畜、牛马猪羊、香甜酸辣、大小多少、长短好坏就是一个心呐，明白了这个法叫一心不乱。你真正果真明白了，你一心不乱。所以文殊普贤仍然是强调，见『如来藏』，见【阿弥陀佛】。明白【如是我闻】，在这个前提之下万法皆可成就，否则万法皆不可成就。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   禅宗第五祖弘忍大师在《最上乘论》讲：你把西方阿弥陀佛当成佛，把东方的凡夫当成凡夫，念佛求往生，你这是歪门邪道，你不能往生，这是菩萨说法。再从我们历史上修行次第来讲，有一个公案，几乎念佛人家喻户晓。我们的初祖慧远大师，当年在庐山结庐123人念佛，百分之百往生。所以在净土法门把这个公案，把它炒得天花乱坠，可是我发现许多人讲这个公案违背事实真相。这大概是我前年在讲《六祖坛经》的时候发现这个问题，《六祖坛经》是禅宗通教修行的法门，讲到什么问题呢？当年达摩祖师到中国来传法，首先派了两位大弟子前来侦查，考察中国人当时的根机。可是所有的人都不认可这两位菩萨，慧远大师接待他们，说「你们到底传的是什么法呀」？这两位菩萨中国话讲得不是很流利，讲得半土不洋，并且配合打手势(拳头阿，手掌弥陀)，慧远大师当下就明白这个法门很快。这是什么法门呢？就是『一心三藏』。拳头表空，手掌表有、不空是不是？由拳头变现出手掌，这个手掌代表十法界，过去现在未来、东南西北上下十方、佛菩萨、有情无情一切众生都在这个手掌中。众生执着在十法界，执着在这个手掌上，他并不知道手掌之前那个拳头。拳头虽然变现成了手掌，拳头在不在啊？   </div><div class=\"text-indent\"></div><div class=\"text-indent\">   那么我们再来全面的解释。当这个拳头没有变现成手掌的时候，他是不是手掌啊？所以这个时候手掌就是性具功德，这个时候手掌是不是藏在拳中呢？所以叫「来藏在如」中，叫如来藏是不是？「有藏在空中，掌藏在拳中」。所以你如果修禅宗的人，不回空向有，他就执着在空性上，是不是也叫执着啊？当我们拳头变成了手掌，这个手掌当下是不是拳头啊？可是我们看不到啊，所以这是不是「拳藏在掌中，如藏在来中」啊？所以这个不空如来藏当下是不是就是空如来藏？那么那个拳头是空如来藏，当下是不是就是不空如来藏呢？所以这两样（一个拳头和一个手掌）都是一样东西，是不是空不空如来藏？所以这两个菩萨就是传『一心三藏』这个法。以此比喻我们众生都执着在这个手掌上而不见拳。执着在有上而不见空性。那么有一部分人好不容易破有归空，他又执着在空性上，他不愿意回空向有。所以这个拳是不是就是阿弥陀的『阿』？这个掌是不是就是阿弥陀的『弥陀』？这拳和掌是不是就是『阿弥陀』？我们要懂得什么是【阿弥陀】。那么当这个拳表空的时候，我们每个人都会用拳掌来表示是不是？那拳头表空的时候，每个人都有空是不是？这个空有没有形相区别啊?没有的。所有的小空都是一个空，这都是方便说，没有什么小空、大空，没有办法，只有这样说。所以这两位菩萨是庐山结庐123位菩萨中的两个人。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我们想一想看，如果没有这两个菩萨传『一心三藏』的道理，也就是说在【如是我不闻】的前提之下来念阿弥陀佛， 123人能往生吗？这两个菩萨的名字分别叫佛驮和耶舍。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   那我们再从世间法来打比方。我们要想当医生，我们要想当汽车司机，你天天在那里唸南无医生、南无司机，能不能当医生和司机啊？不能是不是？那你唸佛能不能成佛？能不能往生呐？不能呐。你把那个医书或者是开车原理你背诵得滚瓜烂熟，你能不能当医生、当司机？也不行。也就是说，你读经、诵经，但是你不懂经，你能不能往生？能不能成佛？不能成佛。必须把医书看懂，还要临床实践你才能当医生，就这个道理。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我们看到一大堆食品，你并不知道这个食品是苦是辣、是香是臭、是甘露还是老鼠药，你在那儿「南无食品、南无食品......」，即使能吃，你唸唸能不能把肚子念饱啊？你不能唸饱啊。所以唸食唸不饱，唸佛能不能成佛啊？也不能呐。再者，你对着食品知道什么东西是维生素A、什么东西是蛋白质......可是在蛋白质、维生素食品现前的时候，你却没有办法分别，没有办法分辨你敢不敢吃啊？你不敢吃。你能不能成佛啊？所以不把经读懂，也还是不能往生、不能成佛。这些道理其实很简单。佛当年出世的时候，如果说唸佛、拜佛能够往生，那佛那么多弟子还听佛讲经说法干什么啊？每个人见佛，佛在那一坐，大家都来唸、拜，大家都成就了吗？佛度化他的母亲摩耶夫人也还专门讲了《地藏经》。佛的父母把佛生下来，他们都不能成佛，你以为唸一句佛、拜一次佛就能成佛？古今中外哪有这么便宜的事儿啊。所以我们一定要明白这个道理，如果唸佛、拜佛能够成佛的话，那么我们的佛也太不慈悲了，他从天上飞下来，随时现出这个肉身相来，不要太高了，几百米高就足以摄受人了是不是？我们唸一唸、拜一拜，就统统地往生了。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   可世界上没有这么便宜的事儿啊。诸佛如来到这个世界上来，都是在讲经说法。不仅是讲经说法，而且最后讲《法华经》，才能究竟圆满。其它一切法都是佛讲方便法，即使在方便法中，佛都没有讲唸佛能够往生。我们这个唸佛能够往生，这个法从何而来，连方便法都没有。这个法我们真不知道怎么来的。所以这个法，你们看一看佛的一本经叫《佛藏经》，在最后倒数五页左右，佛讲：【恶魔及诸眷属皆大忧恼，如堕十六种火坑，大啼哭言：「瞿昙沙门（佛）知我觉我，我常长夜。愿佛灭后，破持戒者，助破戒者，欲令诸恶比丘不知佛法，但知读诵我欲于佛法中破安隐心......】。也就是说魔王、魔子魔孙要披着出家人的外衣，混入寺庙来毁我正法。毁我正法的方式方法就是叫修行人，只要去读只要去诵，不要懂。所以我们末法时代，我们修行人很可怜啊。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   所以佛在《楞严经》讲【末法时代邪师说法如恒河沙】。再如佛在《金刚经》也讲：【凡所有相皆是虚妄】。所以我们在当前的修行人，都还没有突破藏教的境界。我们佛法的次第藏、通、别、圆，藏是最低层次，我们还在执着。所以佛在《楞严经》讲：「因缘、自然皆戏论法」。因缘法是佛当年为破自然外道之论所讲方便之法。自然法是当年的自然外道法。佛把自己讲的一切的因缘法，亦说为世间善法，与外道的自然法等同、并列，共同列为外道法、戏论法，为方便引导，作为过渡的桥梁、舟船。依之能得人天福报。但不能了脱生死。你们怎么可以当真呢？我们念佛，用嘴巴念、用耳朵听、用心里想是不是因缘法啊？西方是极乐世界，东方是我这个凡夫，西方、东方，佛与众生是不是都是讲因缘呐？那么佛讲因缘法，他是迫不得已啊！因为众生只有那个根机，在两千五百年之前，众生的素质，根本不能跟我们现在相比。在佛降世之前，印度流行九十六种外道，根本没有大乘佛法的气氛。在这个时候，佛根本没有办法开口讲『如来藏』之法。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   再来给大家讲一个越南的故事。在一百多年前的越南，国王派了一位全国学问最高的人，就我们中国人所谓的状元，叫他到西方国家去考察。那么这位状元考察回来以后，向国王汇报。第一个是讲自来水，「啊,这个西方国家这个水，不是从水井里用绳子往上吊，而是是从墙上来，一拧，水哗哗地就下来了」。这国王听了以后，就很不高兴，认为「你是个最有学问的人，却回来打妄语」。他哪里相信水可以从墙上流出来，怎么可能啊？然后讲第二件事。「西方的牛是铁的，那个人坐在牛上，脚一踩，这个什么一转，呼地就飞出去了」，这是讲的汽车。国王听了还是不高兴。他又讲第三件事说，「西方人讲话很奇怪啊，不需要面对面，不管多么远，拿个什么东西，一根线牵着，两个人讲话，讲的跟真的一样」。所以国王听他讲的越来越不像话，讲的都是莫名其妙的事情，一怒之下给他定了个杀头之罪。当年那个哥白尼说出地球围着太阳转，是不是给教会活活地烧死啊？</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我记得我开始研究佛法以后，我俗家的一个四叔，他也是老干部，他很不以为然。他说：「你是我们倪家最聪明的一个小孩子，你怎么信这个东西啊」？我没有正面给他回答，我说，「假如五十年前，比如说电视机一开，北京在唱歌、南京在跳舞，我说你相信不相信呢」？他不吭声。「再比如说，在二十年前，我说给猪配种，用针打一打就能生效，这两件事你相信不相信呢」？他不做声了，他想了想，你讲的也还有道理。我说：「毛主席也讲，要知道李子的滋味要先尝一尝啊!你给我讲老实话，你看过佛法没有」？他说我没有看过。我讲这个法，我们要理解佛的良苦用心。他之所以讲了那么多的因缘法，他是迫不得已是不是？为了引导众生。可是我们永远执着在这个上面来讲，你不能成就。这是佛讲的因缘法，属于愚痴法，是恒顺众生，慢慢地引导。你可不要把它当究竟。所以佛讲了，「不讲第一义法，非我弟子」。你连佛的弟子的资格都没有。你怎么能成佛啊？所以我们为什么苦口婆心劝各位到道场来听经闻法？这我们先概括地、笼统地从这几个方面来看这一句佛号到底能不能成就？</div><div class=\"text-indent\"></div><div class=\"text-indent\">   那么我们后面怎么讲『念佛一定成佛，念佛一定往生』呢？而且『当下成佛、当下往生』呢？注意，这个『念』不是那个「唸」。这个『念』是「见真」。你看这个『念』，「今」字下面一个「心」，就当下这一『念』。在佛法里，十法界无非一念，过去现在未来无非一念，东南西北上下无量空间、无量万法无非一念，而且是当下一念。诸佛之所以是诸佛，诸佛活在当下一念，又融于十方三世天地万法。凡夫之所以是凡夫，凡夫活在过去现在未来活在东南西北上下十方，活在森罗万象、千变万化种种分别之中。所以我们把他讲清楚。而我们几千年来，我们所执着的那个念是「妄念」，没有见到「真」。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   法华会上修行人，听佛一段经、一篇经，当下证果。从罗汉、菩萨、十地菩萨、等觉菩萨，乃至像龙女那样，当下成佛。大家要注意啊，修行人没有离开道场就证果，这什么道理啊？听经闻法见到了道，无非是见到了这个『念』—「当下这一个心」。楞严法会上，摩登伽女听佛一段话，当下证三果罗汉，再听一段话又证四果罗汉。没有离开道场啊！所以圆顿大法称为「一步登天、不历阶梯」。明白了佛、见到了佛，你就是佛。就这么简单，没有什么好拖泥带水的。所以这个『念』，一定成佛，而且当下成佛，不是当生成佛。你现在明白了，你现在就成佛，现在就往生。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   同样一句佛号，你会不会念啊？所以我常问念佛的同修，「你怎么念啊」？他们说就那样掐着念珠，一句一句念。还有的人讲一天到晚唸佛就能成佛、往生。「一天到晚唸佛」就是什么事情也不做啊，这句话很重要啊！「一天到晚掐着念珠唸佛」，几乎就是所谓念佛三昧。所谓的「念佛三昧」，有的人把念佛三昧当成了这个念佛，一个妄想都不打，当然从事相上来讲，这也是一种三昧。但是这种三昧，很少有人成就，即使成就也是下品下生。真正的念佛三昧，必须是见道，叫理一心不乱，叫理念佛三昧。我们再反过来讲，一天到晚在唸佛，我们要讲老实话，我们有没有哪一个人一天到晚在掐着念珠唸佛？你们有没有发现有一个人是一天到晚掐着念珠唸佛？一天到晚就24小时，白天到晚上有没有啊？都没有。我们自己掂量一下，从早到晚一句佛号，不可以有其它的事，不能有油盐柴米、不能有老爸老妈、不能有夫妻儿女......有的话就不是「从早到晚一句佛号」。我们谁能做到？你们有没有看到有谁能做到？有没有？</div><div class=\"text-indent\"></div><div class=\"text-indent\">   所以一句佛号到底行不行？行。这是绝对真理，一点点都不错。可是谁能做到？那么往往讲这种法，是对于引导初入门的人，叫他专心念佛，会有一定的作用。你如果作为成就的法门来讲，你在误导众生。六年前我记得我在江苏讲《法华经》，其中有所谓念佛团体，专门派一个人来捣蛋。我们在讲经、休息的时候，他又在传法。所以居士们告诉我，我就向他请教，他也很坦率。他说：「我们认为不需要讲经说法，我们只要一天念20万佛号、拜一千拜佛，就能往生」。我说：「你们讲的太对了、太正确了，这一定能往生」。所以我又问他：「你一天念多少万声佛号？一天拜多少拜佛」？他不做声了。「你们那个念佛团体，有没有一个人能坚持一天20万声佛号、一千拜佛呢？有的话，我现在带领我们这里所有的同修去给他顶礼」，他也不做声。你想一想：一天20万的佛号，我记得我记过数，四字，很快很快，就跟开机关枪一样，大概一个小时也只能念六千声，20个小时才能念12万声是不是？一天念20万声佛号，你怎么念下来啊？而且还拜一千拜。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我们修行人应该忠诚老实，不能轻浮狂躁。就是那样，即使往生，按照莲池大师讲也在末品，下品下生。所以这个法，当前是我们修行中最敏感的问题。这几十年以来困惑着国内外大部分修行人，特别是念佛人。难怪其他人根本就看不起念佛人。不能怪人家看不起我们呀。为什么？他不知道佛是怎么回事，好玩一样。我也参加过几个佛七，我在安徽的一个地方，念阿弥陀佛，怎么念的，就跟文化大革命时：『下定决心、不怕牺牲』那个气势，那也叫念佛？这是法会上的念佛。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   我也看到一位比丘念佛，紧皱眉头，机关枪一般，一句佛号一摇头，「阿弥陀佛、阿弥陀佛……」，我说，「你干什么啊？跟阿弥陀佛在吵嘴呀」？真是千奇百怪，这也叫念佛？以烦恼心、浮躁心、轻慢心念佛有罪过。有的人拜佛急急忙忙，赶快拜，拜完回去上班，就这个意思，敷衍了事，任务是来拜佛。这种拜佛，你可不能拜，有罪过的。你情愿不拜或者少拜，你拜一次佛，恭恭敬敬，最起码有福报，但也不能往生。明白如来藏道理的人，你怎么修都能往生、都能成佛。何况拜佛是不是？他一拜他知道拜的是自性佛，他知道是拜整个尽虚空遍法界，这个时候他就道交感应。明理与不明理这个行持上天地之别啊。世间人讲磨刀不误砍柴工，好好把这个道理听明白，你再下手不迟啊。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   《法华经》《楞严经》字字句句讲什么是佛。我这个人怎么来的？来干什么的？从哪里来的？从妈妈肚子里来的？妈妈肚子从哪里来的？是你先来的还是你老爸老妈先来的？是先有鸡还是先有蛋？讲这个法。我们身上每一块皮肉筋骨怎么来的？怎么回事？我剪一个废指甲，我剃一根废头发，这根废头发、这个废指甲跟我是什么关系？谁大谁小？还是一样大？还是一回事？为什么？不是打口头禅，必须要讲出为什么。日月星辰、山河大地、树木花草、风雨寒暑、酸甜苦辣、地水火风从何而来？佛菩萨、牛马猪羊从何而来？互相之间是什么关系？为什么？你们好好想一想，其它三藏十二部经都是在教我们怎么样修怎么样行。唯独《法华经》《楞严经》以权显实，权实并重。有直接、间接说微妙之法，告诉我们宇宙人生这个真理。这些法本来是我们做人最基本的法则。可是无量劫以来，众生在迷惑颠倒之中，他不明白。其实这个法最好懂、最简单、最方便。因为我们在迷惑颠倒中把《法华经》《楞严经》看的难的不得了。其实《法华经》《楞严经》最简单。我们做人最基本的法则，我们把他忘记了。所以「假传万卷书，真传一句话」。这一句话就是『如来藏』，这一句话就是【阿弥陀】。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   其实我们如果把它颠倒过来啊，人家讲这个《法华经》《楞严经》最难懂，应该是其它经最难懂，是不是？《阿弥陀经》也好、《无量寿经》也好、《金刚经》也好、《地藏经》也好、《楞伽经》什么什么经也好，他们都难懂为什么呢？这些经中是不是都是讲『如来藏』呢？可是你从文字的直接含义上来讲，你找不到『如来藏』的影子。除非你把《法华经》《楞严经》所讲之『如来藏』道理读懂了，你才能间接地讲出它的真实含义。所以我们那些自以为《地藏经》《金刚经》《阿弥陀经》一读就懂的人，其实他不一定读懂了，是自认为读懂，到头来一场空。这就是几千年以来我们修行人的悲剧。「求道者多如牛毛，得道者凤毛麟角」。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   好几年之前我曾经遇到一位自称读了十八年《金刚经》的同修，他很自负。我说你《金刚经》懂不懂？他说懂啊，一读就懂。我说：「你真不简单，你能不能讲讲我听一下」？他说：「这怎么讲」？我说：「不管，随便你怎么讲，你认为你最懂的一句，哪怕是一个字，你讲给我听」，我叫讲他自己认为自己最懂的一个字。如果我给他提一个字，就好像我故意刁难他、考他。他讲了，「比如说，我就是我嘛」。我说，「不对啊，这个我，我看的祖师大德不是这样解释的啊」。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   所以我把这个道理讲给他听了以后，他说那照你这个说法，我这个《金刚经》一个字都不懂啊？我说不是，他还高兴了一下，认为还懂了一些。没有想到我讲了一句话，他更伤心，我说「你连一撇一捺一点你都不懂，你把一撇一点搞懂了，三藏十二部经你全部懂。你一撇一点不懂，一个字不懂，你三藏十二部经一点点都不懂。你把他的一撇一点、来龙去脉，你给我讲清楚那一笔一点与你是什么关系，与佛是什么关系，与过去现在未来又是什么关系？你给我讲明白」。所以『如来藏』之法叫「一通一切通、一见一切见、一修一切修、一证一切证」，妙啊！你明白这个道理，一切功德当下圆满。有道无道自己知道，我们自己去衡量。</div><div class=\"text-indent\">  </div><div class=\"text-indent\">   你把『如来藏』的道理搞明白了没有。天主教、耶稣教、旁门左道，乃至没有文字的天花地板、风雨寒暑、一粒泥巴瓦块都是《妙法莲华经》，没有哪一法不是真经。当明白我不是我的时候，你真明白我不是我的时候，当下就是我，是不是知妄即真？佛讲无量法往往还对那些歪门邪道，还讲的咬牙切齿是不是？叫大家远恶人，近善知识。可是在《法华经》呢，对那些鬼说法赞叹善哉善哉。在菩萨出场的时候，把婆罗门外道还排在四众弟子前面，你们注意看《法华经》是不是在圆融呢？好人坏人谁啊？都是我们一个心而已。你如果搞妄加分别和执着，你出不了六道。但是我们在起步修行，可以以行善断恶，远恶人近善知识作为方便引导，一定要明白这个方便引导。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   所以防止有些人讲，「我们讲《阿弥陀经》，我们讲《无量寿经》也行嘛」，也行也不行。你把《阿弥陀经》《无量寿经》能够讲成《法华经》《楞严经》『一心三藏』，完全行。换句话讲，你不讲『一心三藏』，即使讲《法华经》《楞严经》也不行，你必须把道理讲出来。一定要讲出『如来藏』这个法。所以我在江阴讲《阿弥陀经》的时候，有的居士提出来说：「师父，你为什么讲《阿弥陀经》不按照其它一些讲法讲，非要把它讲成《妙法莲华经》呢」？我告诉他们，「因为《阿弥陀经》就是《妙法莲华经》，我不敢不把它讲成《妙法莲华经》，这是佛的教诲」。所以当我们搞明白《阿弥陀经》就是「法华秘髓」的时候，哪只它是「法华秘髓」啊？《地藏经》《金刚经》是不是「法华秘髓」呢？耶稣教的《圣经》是不是「法华秘髓」啊？那个天文地理、语文数学是不是「法华秘髓」啊？那个泥巴瓦块、风雨寒暑、香甜苦辣是不是「法华秘髓」啊？没有一法不是「法华秘髓」。</div><div class=\"text-indent\"></div><div class=\"text-indent\">   佛法不讲善不讲恶，只讲一个真。这个真不是世间法讲的真。有的人讲我认真听，不分心，不是讲的这个真懂不懂？不是讲专心。认真认是认定，真就真心本来面目。就是『如来藏』的道理。世间法讲的真，这支笔是白金，价值一百万亿，这是讲假话是不是？这不是真。哦，这笔是塑料笔，这就是真是不是？佛法里讲的真是从整个宇宙人生，从根本上、全局上、从整体上来认来知，这才叫「真」。真心大光明藏，「不漏一法、不舍一法，不少一时，不缺一事」。这个真从『一心三藏』这个角度来观照。所以我们千万不要用世间的逻辑推理，世间人的心态来观照不可思议的佛法。</div></div><div>"
    }
]