[
    {
        "title": "正修行路.答疑（修订版1—409）",
        "author": null,
        "date": null,
        "html": "<div class=\"B1_text\"><td class=\"t_f\" id=\"postmessage_1023868\"><div><p>1.《楞严经》中阿难尊者多次哭泣，恨无始来一向多闻而未全道力，从阿难这个悲剧可以给我们修行人哪些启示？</p></div><br><div><p>答:很简单，阿难尊者作为楞严法会的当机者，是（示现）善根魔。他善根太好了，好到什么程度啊？无量诸佛讲无量经典，他是过目不忘，入耳成诵，可是不开圆解不能成就啊！因遇摩登伽难，阿难始知多闻无功，甚至等于不闻。阿难尊者这个多闻是依文解字，虽然也是辩才无碍，可他是讲小法，强词夺理，所以遭到佛的多次呵斥。尊者在楞严会上，多次痛哭流涕，一再忏悔表白。尊者有几个重要的表法，我们要用心体会：</p></div><div><p>第一，佛问阿难出家的原因，阿难回答说因为被佛的三十二相所摄受。这是阿难首先以眼根为能见，以眼识为真心所犯的第一个错误。当然也不是错误，这种攀缘心是有功德的。但是，于真心而言，这是颠倒的。所以在七处破妄中，佛一一破斥阿难的邪见。真正能见的是我们的见性，不是眼根；眼识是离尘无体的，是六识之一，这是攀缘心，是生死轮回的根本。经云：无始生死根本，则汝今者，与诸众生，用攀缘心，为自性者。</p></div><div><p>而《楞严经》的核心就是楞严大定，这是自性本定，自性本明，也就是一心三藏。经云：由诸众生，遗此本明，虽终日行，而不自觉，枉入诸趣。</p></div><div><p>第二，阿难尊者多闻第一，却从来不知回光返照。所以佛讲，汝以缘心听法，此法亦缘。就是说，不管佛讲什么法，哪怕是第一义，如果你听到以后不知道向内观照，而是在文字相上分别，那任何法讲出来只是成为你阿难的法尘而已。耳根是阿难的本根，而娑婆世界众生也是耳根最利。所以文殊菩萨在后面二十五个菩萨圆通法门之中，独选观音耳根法门作为初机众生的唯一入门之法，也是直达涅槃彼岸的究竟法门。观音菩萨耳根法门怎么修的？就是一个观字。能观者是谁？所观者是谁？念念回光返照，一直证得圆满如来。具体要看《楞严经·卷六》的讲解。</p></div><div><p>圆瑛大师讲：（在楞严会上）佛举手擎拳，要阿难向眼根见处，回光返照，识取真心，无奈阿难，只知合尘，不知合觉。如是如来，换一方针，以阿难惯用耳根遂乃振威一喝，欲令向耳根荐取，能闻闻性，果能于此，妄心死得了，自然可许法身活得来。阿难非特妄心不死，下文反与如来，争辩不休。</p></div><div><p>又：若对多闻之阿难，一向惯用耳根，但令不顺流闻声，而逆流照性，便可就路还家；顺流闻声，即是结缚之元，乃为生死本。逆流照性，即是解脱之要，可入涅槃门。文殊菩萨讲：十方薄伽梵，一路涅槃门。</p></div><br /><div><p><br /></p></div><div><p>2.《法华经》五次提出「后五百岁」，《药王菩萨本事品第二十三》提出两次，《普贤菩萨劝发品第二十八》提出三次，现在离后第五个五百年结束还有24年，这24年对我们意味着什么?</p></div><p><br /></p><br /><div><p>答：佛在世时把他灭度以后的最初两千五百年分为五个五百年，每个历史阶段都有不同的特点。第一个五百年是「解脱坚固」，第二个五百年是「禅定坚固」，第三个是「多闻坚固」，第四个是「塔寺坚固」，第五个五百年是「斗诤坚固」——坚决的斗诤才能成就。</p></div><div><p>但是在《法华经》中，佛对前四个五百年只字不提，死死咬住第五个五百年。今年是佛历二五五六年，减去佛陀住世八十年，还有二十四年就结束「后五百岁」。好好想一想，佛的良苦用心在哪里？挽救如来家业，中兴正法的担子就在诸位肩上，明白吗?这是我们的责任。</p></div><div><p><br /></p></div><div><p>3.请师父开示「四依四不依」。</p></div><p><br /></p><br /><div><p>答：第一个是依法不依人。这么多年来，很多修行人都是依人不依法——谁地位高，谁的名气大，他就依谁，讲什么都是对的。那么依法不依人，什么身份都不重要，只依法，只看你讲得对不对。</p></div><div><p>第二，就依法来讲，还要依了义法不依不了义法。什么是了义法啊？《楞严经》是了义之法，《法华经》是诸经之王，这是第一义谛，这叫一实相印。符合一实相印才是圆教了义。</p></div><div><p>在《妙法莲华经》中，有三段重要的论述。第一段，日月灯明佛在世时候讲了无量的经典，灭度之前只讲《法华经》，而其继承人妙光菩萨只讲《法华经》，没有讲其他任何经;第二段，大通智胜佛住世时宣讲了三乘诸法，临终前只讲《法华经》，灭度以后十六个王子，包括阿弥陀佛和释迦牟尼，统统只讲一部《法华经》；第三段，释迦牟尼在灭度之前召开天上天下无量诸佛菩萨大会，专门登台点将——我灭度以后，谁能受持弘扬《法华经》，现在对天发誓，对诸佛菩萨发誓，有没有讲其它任何一部经也来发过誓，有没有?就从这三段来看依了义法不依不了义法。</p></div><div><p>只要认真读了《法华经》的人一看就懂！《法华经》是诸经之王，「唯此一事实，余二则非真」。好好搞明白。佛为什么要灭度?就是通过九牛二虎之力好不容易把大家归宗到《法华经》，然后开路了，接下来就看你们的，是不是这个意思？</p></div><div><p>第三，依义不依语。祖师大德讲了，你不把如来藏搞明白，不把阿弥陀佛道理搞明白，即使宣讲三藏十二部经，口若悬河，天花乱坠，无非歪魔邪说。达摩祖师在《血脉论》讲：若不见性，说得十二部经教，尽是魔说。魔家眷属，不是佛家弟子，既不辨皂白，凭何免生死？反之，即使讲得吞吞吐吐、拖泥带水，你功德无量，只要你能讲对。即使文盲，他都能讲。真理是三根普被的，谁都能懂，每个人都能讲啊！我们不要以下劣心、嫉妒心、门户之见来看待别人，所有人都是一个人一个念，要善护三业。</p></div><div><p>第四，依智不依识。识就是妄想分别心，表现在眼耳鼻舌身意六根对六尘产生六种意识心。什么叫智呢，这六种意识心在现形作用之前它在不在？在哪里，在心里。在心里有没有任何形相？没有。那就是智慧，根本智。那我们就知道那个意识心妄想心也是根本智变出来的，你明白了这个道理，意识心当下就转为智慧，叫方便智。所以依智不依识，依根本智慧和方便智慧，而不要去打妄想。</p></div><div><p><br /></p></div><div><p>4.请师父开示「万法平等」。</p></div><br /><div><p>答：讲第一义，万法平等都是方便说；有情无情一切万法都是一个念变现出来的，是不是？有没有哪一法不是哪一法啊?这叫万法平等，是这个平等。谁跟谁平等呀？都是自己。</p></div><div><p>讲第二义，无分别不妨分别，《法华经》是经王。在没开悟之前就是不平等，等你明心见性之后，有没有哪一部经不是《法华经》啊?《地藏经》《华严经》是不是《法华经》？《圣经》《伊斯兰经》是不是《法华经》？天文经、语文经、物理经、化学经、牛经、马经、苹果经、金戒指、金耳环经、牛屎经、狗粪经是不是《妙法莲华经》啊？这叫万法平等。这个不是讲口头禅啊。</p></div><div><p><br /></p></div><div><p>5.我在杭州读大学，学佛多年，自从去年五月份听了《过五关度六将证菩提》以后，感觉一层窗户纸捅破了。请师父开示，乘愿再来的不是已经出离三界了吗？不存在五行中了吗？</p></div><br /><div><p>答：乘愿再来的菩萨已超出三界，不在五行之中，但他是带着隔阴之迷愿身再来，仍然借三界五行这片国土，与众生结法缘，在佛法里叫「和光同尘」。</p></div><div><p>所谓和光同尘，他跟我们一样啊，也有眼睛、鼻子、耳朵，也有贪嗔痴慢，佛陀当年都还示现贪嗔痴慢。讲得不客气一点，女人一大堆，还跟提婆达多去争老婆。为什么示现？给众生生起信心，他跟我们凡夫一样的，修成佛了。</p></div><div><p>另外一种愿身再来是说，薄地凡夫一旦明白如来藏，当下转凡夫业报身为菩萨愿身。以后的任务，就是要更好地度化更多的众生。</p></div><div><p><br /></p></div><div><p>6.请法师开示，修净土的临终有阿弥陀佛来接引，修圆顿大法的临终谁来接引？怎么办？</p></div><br /><div><p>答：这个提问本身就有问题。你明白圆顿大法，现在就已经是佛土的公民，你是成佛以后去死，不是死后成佛。所以《阿弥陀经》讲「现在其前」，没有讲「来到其前」。你需要佛接吗？阿弥陀佛就是你自心变现的，极乐世界也是自心变现的。</p></div><div><p>在《妙法莲华经》第十七品，佛对弥勒菩萨讲：我讲了半个小时《如来寿量品》，六百八十万亿那由他恒河沙众生得无生法忍，还有微尘数菩萨证到等觉菩萨。一字不提谁来接，接到哪里去啊？有没有听说佛授记以后，这么多菩萨一个个腾空而起啊，有没有啊？好好把《法华经》第十七品读懂，你就已经是愿身再来的菩萨，在这里教化众生；将来一断气，当下就是佛土。你也不要去，阿弥陀佛也不要来，你当下就跟阿弥陀佛在一起。</p></div><div><p><br /></p></div><div><p>7.《法华经》中八岁龙女是怎样修成佛的？</p></div><br /><div><p>答：龙女是听文殊菩萨传了一部《法华经》，当下成极果如来，可以说是独一无二的。《法华经》上没有讲他成佛后还要深入禅定。成佛了就是成佛了，如果深入禅定那是示现，是另外一回事。示现给人家看是利他，并不是要自利。</p></div><div><p><br /></p></div><div><p>8.请师父慈悲开示「万法归一」。</p></div><br /><div><p>答：万法归一。我刚才讲经半个小时，是不是包括很多内容？光字数已经上万，每个字都有各自的形相和意义，是不是？而且有声音，这是不是好多法呀？</p></div><div><p>我在没想、没讲这个法的时候，这么多法在不在我心里？在。有没有形相？既然没有形相，是不是一个念啊？蜡烛点亮了是不是有火光啊？在点亮之前，火光在不在？（众答，在）。在哪里？（心里）。没有点亮的时候有没有形相？那火光之心跟我讲的这个法的心都没有形相，能不能分这是印广法师的法心，那是蜡烛的火心，能不能分呀？（众答，不能）。既然不能分，那火心、法心，牛心、马心、狗心、泥巴心、风心、雨心能不能分啊？（众答，不能）。万法就是一个心变出来的。</p></div><div><p><br /></p></div><div><p>9.请问如何发愿？</p></div><br /><div><p>答：请你把我讲的有关开示，比如《过五关度六将证菩提》《如是我闻真实义》《普门品讲记》《一六八字讲记》等等以及四部经（《法华经》《楞严经》《心经》《佛说阿弥陀经》）的光盘讲记，你随便看其中哪一段，明白了万法都是一念变现，这就是发愿。「发」是爆发，既成事实；「愿」是不是原来的心啊？能变现万法的一念就是原来的心，这叫真实发愿。真实发愿得菩提不退，你没有办法退，想退也退不了。那你不明白这个道理，你发心——我一定要弘扬佛法，我一定要往生，这叫方便菩提心；方便菩提心能够与佛结缘，能够得到福报，但是不能开智慧，不能了生死。</p></div><div><p><br /></p></div><div><p>10.我是助念团的，我想知道什么样的助念是真正有利于亡者的？</p></div><br /><div><p>答：明白阿弥陀佛真实义，能讲出一心三藏，方可利益亡者。因为亡者在中阴身期间的智慧是在世时的九倍，其实九倍是无量倍，你一点他就明白，此时听闻如来藏正法，他当下往生；有神足通可以直接去极乐世界。</p></div><div><p>有些弟子不理解，说：师父啊，您是讲经法师，怎么也搞经忏呢？我说《法华经》就是最大的经忏。你看法华会上，佛讲一品经文，随即就有无量百千万万万亿亿亿亿……一直到华盛顿，都要打个省略号——众生当下了生死，往生到佛土，请问当时地球上有几个人啊？佛讲经说法是不是天仙鬼神、妖魔鬼怪最多啊？很多经忏的仪轨，都是讲如来藏道理啊！</p></div><div><p><br /></p></div><div><p>11.亡者的头顶发热，全身柔软但冰凉，是不是真正的往生？</p></div><br /><div><p>答：如果发现这样的情况，我们一定要把他作为往生来宣传，方便接引那些不信佛法的人，明白吗？而且我们要积极地开展送往生、助念——在四十九天之内，我们只要开展助念，往生的把握性非常非常非常大。我们只管用如来藏的道理给他讲开示，并辅助念佛号。</p></div><div><p><br /></p></div><div><p>12.如果有人看到一些境界是亡者的事情，是否走火入魔？</p></div><br /><div><p>答：很难讲。既可能是佛菩萨来示现，也可能是亡者示现，也可能是妖魔鬼怪来糊弄人，不要执着。明白如来藏道理，你可以跟他沟通。十法界很复杂的，因为妖魔鬼怪也会变现阿弥陀佛，也会示现人相；但也有佛菩萨来示现、接引。讲到底，都是我们一念在变现。亡者也好，生者也好，只有明心见性才能背离迷惑颠倒。</p></div><div><p><br /></p></div><div><p>13.请问往昔的恶习种子翻腾该怎么办？</p></div><br /><div><p>答：不要理它。只要把如来藏道理搞明白，翻腾照翻腾，它翻腾累了就停了。这有一个潜移默化的过程，你不要刻意地去怎么样，你越这样它反而越那样。我女儿小时候很调皮，你越哄她她越作人来疯，你门一关拍屁股走，从窗户偷偷看，她一下老老实实坐在那里自己玩，就是这样。你只管反复观照如来藏，恶习种子由它来去。烦恼是不是也是菩提啊？如果为此烦恼而烦恼：哎呀，怎么习气还这么多啊？这就已经破除了一半，这就是功德啊。</p></div><div><p><br /></p></div><div><p>14.到临命终时要如何印证我不会下三恶道呢？</p></div><br /><div><p>答：到临命终你自己就会知道，你不下三恶道。哎呀，怪不得《法华经》讲听经闻法当下成就。这个法叫「华开莲现」。</p></div><div><p><br /></p></div><div><p>15.在闻到《法华经》之前，一家人经常争吵；学习《法华经》之后，一家人和睦欢乐，是不是共证菩提了啊？</p></div><br /><div><p>答：如果是明白一心三藏，热热闹闹也好、磕磕绊绊也好，都已经了生死。否则，即使快快乐乐也不一定证到了菩提，明白吗？那是人天福报。</p></div><div><p><br /></p></div><div><p>16.如果我们国家的人民，闻到《妙法莲华经》，也明白心中弥陀妙法正能量，再也没有斗争、贪习执着、放下，和平相处，是不是就是共产主义国家，是不是就是极乐世界？</p></div><br /><div><p>答：对的。如果明白如来藏道理，团结一致，天地光明，生活快乐，这就是共产主义，这就是极乐世界。天人行善积德，天界就是共产主义，但不能叫极乐世界，而是凡夫天。</p></div><div><p><br /></p></div><div><p>17.遇见阴险小人，在无法度化他们的情况下我们是远离他还是任他欺负呢？</p></div><br /><div><p>答：如果你是为了度化更多的众生，就远离他，别浪费时间；否则就继续做他的功课，他也是有良心的，他欺负你时他一定知道在欺负你，你对他总是逆来顺受，总是怀着感恩的心，他会被感化的，明白吗？因为他有第七识。你诚心实意地把他当成自己，把他当成自己的姥姥姥爷老爸，他能感受到；就怕我们好为人师，受不了半点委屈——我都已经这样了，你还那么样对我；你要懂得委曲求全，没有度化不了的人。如果有想要杀我的人，我都愿意度化他，但是我没有更多的时间在这个上面执着。</p></div><div><p><br /></p></div><div><p>18.「闻在本识」包括畜生吗？</p></div><br /><div><p>答：一般来讲，看畜生的灵性高低，不能一概而论。龙族是不是畜生道啊？八岁龙女当下成佛，但蚂蚁虫子就很难讲了。</p></div><div><p><br /></p></div><div><p>19.对七十八十多岁的老人来说，当下如何来念佛较为合适？</p></div><br /><div><p>答：有这个能力的，你不是教他念佛，要告诉他什么是佛，把《过五关度六将证菩提》讲给他听；他不耐烦的话，趁他睡觉的时候放给他听，他也受益，明白吗？因为他的真人不睡觉，这就是妙法，一定要做这项工作。</p></div><div><p>盲目地念佛拜佛不能了生死，不能往生，这谁讲的？是不是文殊菩萨讲的？看《楞严经》第六卷，我们再也不能装聋作哑了，不管谁地位有多高，名气有多大，我们都要以《法华》《楞严》「一实相印」来印证，而不是小乘三法印。达摩大师《血脉论》讲：若不见性，念佛、诵经、布施、持戒、精进，广兴福利，是有为法，是轮回法，不免生死，不能成佛道。</p></div><div><p><br /></p></div><div><p>20.《佛说阿弥陀经》里「为诸众生说是一切世间难信之法」，是指什么法？</p></div><br /><div><p>答：这个难信之法就是「如是我闻」，就是「阿弥陀佛法」，就是「妙法莲华，教菩萨法」。讲到底，就是「青色青光，黄色黄光」，「即已食时，还到本国」。</p></div><div><p><br /></p></div><div><p>21：「舍利弗，当知我于五浊恶世，行此难事，得阿耨多罗三藐三菩提」，难事指什么？</p></div><br /><div><p>答：讲《阿弥陀经》是难事，这个法很难讲。讲得太隐晦了人家听不懂，讲得太明白了又暴露了天机。《阿弥陀经》千古以来被称为「法华秘髓」。所以难事难事，这就理解佛的良苦用心啊，诸佛都在讲这个《阿弥陀经》最难讲，《法华经》又是第一难信第一难解之法。</p></div><div><p><br /></p></div><div><p>22.佛讲经时很多人当下证果，现在我们听经也能当下证果吗？怎样证？自己是否能知道证果了？</p></div><br /><div><p>答：《法华经·法师品第十》讲，又如来灭度之后，若有人闻妙法华经，乃至一偈一句一念随喜者，我亦与授阿耨多罗三藐三菩提记。如果佛不在世我们听经就不能成就，那把《法华经》烧掉，要它干什么？是不是？依法不依人。</p></div><div><p>成佛是从佛口生，从法化生。《法华经》是不是佛说出来的？是佛口生，我们把《法华经》搞懂，是不是从法化生啊？佛讲，在末法时代，能够受持《法华经》的人，是如来使，不要怀疑。经云：若是善男子善女人，我灭度后，能窃为一人说法华经，乃至一句。当知是人则如来使，如来所遣，行如来事，何况于大众中，广为人说？</p></div><div><p><br /></p></div><div><p>23.我们长期学习有相之法，但却不知道无形之理，这句话是否正确？</p></div><br /><div><p>答：这句话是对的。修藏教法门，他执相昧理，不见性。比如说只看到手指手掌，只看到锤子，只看到剪子，只看到扫把、布皮，只看到兔子耳朵（打手势表示），他看到这些东西（喻无量万相），就是看不到拳头（喻无相真心），但拳头在不在啊？当下是不是拳头啊？锤子、剪子、兔子的耳朵有没有哪一样不是拳头啊？是不是看不到无形之理啊？既然都是拳头，那锤子是不是剪子？剪子是不是兔子的耳朵？若不见性，只是执着六根所见所闻，是不是？</p></div><div><p><br /></p></div><div><p>24.如何有效地用如来藏的道理开示于将要往生和刚往生的菩萨当下明心见性，往生净土？</p></div><br /><div><p>答：特别是对已经断气的人，最好开示。第一句：老朋友，现在明白了吗？人没有生死吧？一下把他点醒，真是没有生死。我们讲死活人，活死人，死了的人自然知道没有生死。然后继续讲：你还不赶快请阿弥陀佛救你？再把圆教的道理跟他讲一讲，只要没有逆反心理，往生没问题。</p></div><div><p><br /></p></div><div><p>25.您在《楞严经·168字》讲到「生相无明」。因为一念业相无明，将真心晦昧成虚空，形成我看虚空，虚空看我这种现象，可无论是生相无明，业相无明还是虚空都是一心所现，都是那颗心怎么会形成对立呢？</p></div><br /><div><p>答：我们的真心本来面目非生相无明，非业相无明，非虚空非不虚空，非对立非不对立，可以随缘显现对立跟不对立，这都是我们的智慧妙用。</p></div><div><p><br /></p></div><div><p>26.众生与我是一不是二，众生是我一个念变现，那我成佛后，众生为什么不能与我一起成佛？我再也不做梦出来玩了，都是我自己变现出来的境界，我成佛后收回不行吗？为什么众生还要信解《法华经》才能成佛呢？</p></div><br /><div><p>答：好，分两个问题来讲。将来成佛之时，包括我们过去打的种种的妄想以及皮肉筋骨细胞，乃至在我们身上附体的一切众生，统统成佛，这就是《法华经》讲的无量分身佛，这是第一。</p></div><div><p>第二，一切的泥巴瓦块，它们不能因为我成佛而成佛。无分别不妨分别，这是它们自己的执着，就像在做梦的时候，梦中的人、事、物，是不是一念啊？可能还在争来争去。一旦我们成佛回到了大光明藏，虽然你那时会知道这一切众生都是你，可是你是单相思。</p></div><div><p>这个法很难表述，唯智能入。不要着急，说不定晚上做一个梦就明白了，为什么？你的真人懂了。</p></div><div><p><br /></p></div><div><p>27.既然一切都是我，为什么还有那么多苦难众生呢？一个人一个心无量念变现无量众生，无量众生无量心怎么就是一个念呢？</p></div><br /><div><p>答：这就是我们智慧的妙用。我们自己能变化无量，既能变有福报的天人，有智慧的佛菩萨，也能变愚痴下劣的六道凡夫，这是妙用。如果我们的真心本来面目不能变坏，不能变苦，只能变好，它妙不妙啊？不妙啊。</p></div><div><p>还要问你自己，既然是你一个人，为什么梦中还那么复杂？梦中被狗咬了一口，那条狗是谁啊？是不是你自己啊？你总不能说既然都是我自己，为什么狗还咬我呢？那只有问你自己，这就是我们的迷惑颠倒。迷惑颠倒是不是妙用啊？是不是也是智慧啊？是不是好玩啊？</p></div><div><p><br /></p></div><div><p>28.等觉菩萨的最后一品无明是什么？那这最后的一品无明也是自己破吗？</p></div><br /><div><p>答：等觉菩萨最后的生相无明要靠诸佛如来加持才能破。一般的是这样，具体的我也没办法讲，只有等我成了等觉菩萨以后再给你们讲。</p></div><div><p><br /></p></div><div><p>29.既然阿难尊者善根深厚，而《楞严经》中又说「决定成佛，譬如以尘扬于顺风」，为什么阿难尊者听完《楞严经》没有证得分真佛呢？难道是阿难尊者没有真正听懂佛的开示吗？</p></div><br /><div><p>答：谁讲他没证到分真佛了？阿难尊者已证到十地菩萨，但是肉团在，定业不可转，至于他变成四果罗汉，那是一种现量的境界，是实修实证。阿难尊者的偈颂怎么说的？妙湛总持不动尊，首楞严王世稀有。销我亿劫颠倒想，不历僧祇获法身；同时，尊者在法华会上已经蒙佛授记了，未来的佛号是山海慧自在通王佛。</p></div><div><p><br /></p></div><div><p>30.我去过天津杨柳青的西嘴念佛堂，感觉挺好，但是对于赵凤霞老师的身份还有疑虑，她说自己是释迦牟尼佛再来，我应该相信吗？弟子中也有佛当年的弟子，比如阿难等。</p></div><br /><div><p>答：现在没有办法来下结论，请原谅。我不能因为她讲是释迦牟尼就相信，我也不能因为其他人说不可以自称是释迦牟尼就否认她。我没有这些执着，我只看他能不能讲出一心三藏。如果可以讲明白，不要说他是人，他就是一头猪，我都给他顶礼。</p></div><div><p><br /></p></div><div><p>31.恭请师父开示《弟子规》与「如来藏」。</p></div><br /><div><p>答：《弟子规》就是「如来藏」。弟子弟子，父与子，弟与兄，父从何来，子往何去，讲清楚了就是如来藏；归于何处？把「弟子规」三个字讲清楚，下面的文章不要你讲了，他统统明白了。</p></div><div><p><br /></p></div><div><p>32.我们这里有很多老菩萨都是习惯听闽南话，想把您的开示翻译成闽南话，由我们居士代为翻译刻录成DVD并且流通，这样是否可以？</p></div><br /><div><p>答：可以，功德无量。</p></div><div><p><br /></p></div><div><p>33.每个修行人都有护法神，护法神的品位是否随修行人的品位提升而提升呢？</p></div><br /><div><p>答：是，回答正确。你很有智慧，因为护法神有他心通。不要说护法神，就是附体——有些人被附体搞得遑遑不可终日，他学大法以后没有了，为什么？和解了，变成他的护法了；或者说附体离开你了。</p></div><div><p>所以解决对附体的困扰，不可以用仇恨心、对抗心、轻慢心，应该是感恩心、慈悲心、善心、平等心。来了就是缘份，一起来学大法，一起成佛。所以，在宣讲如来藏的法会，「求道多如牛毛，得道凤毛麟角」的这种局面就会结束。也就是，求道者多如牛毛，得道者多如马毛。马比牛大，怎么多起来啦？附体多起来啦，明白吗？一个人承担两个众生，有个人身上附三千，他同时有上千附体往生，就这个道理。</p></div><div><p><br /></p></div><div><p>34.不同修行人之间的护法神相遇，是否会为了所护持人的知见而产生纷争呢？</p></div><br /><div><p>答：会，但人不一定知道。</p></div><div><p><br /></p></div><div><p>35.请师父开示，证得偏真涅槃时，灵体从哪里出人体？</p></div><br /><div><p>答：从哪里都可以出，全身无处不丹田。当全身放松以后，你才能体会得到。即使练气功，也有大法与小法之分。</p></div><div><p><br /></p></div><div><p>36.《法华经》是《楞严经》的高度概括，但目前从经书的表面文字中没有悟出精髓。</p></div><br /><div><p>答：《法华经》就是讲一朵妙莲华，把莲华搞明白，你懂得了什么叫妙。而《楞严经》的五个经题，其中一个经题叫「大方广妙莲华王」。</p></div><div><p>整个《楞严经》就是讲一心三藏。以莲华比喻妙法，其中一个原因，是华开莲现。《楞严经》讲，发明便解脱。莲华在污泥中出生是不是很香啊？这是表大乘佛法要入世修行，转烦恼证菩提。</p></div><div><p>其实，把《法华经》中「莲华」两个字听清楚了，你已经成就。佛从各个角度讲莲华怎么怎么好，讲听了《法华经》怎么样当下就成就，这是佛的良苦用心。越是真理越简单，就是一朵莲华，看你懂不懂。</p></div><div><p><br /></p></div><div><p>37.既然说梦境是自己变现的，可又有人说梦里的事物和本人过去未来都有联系。那么梦境究竟是真实还是幻觉，还是亦真亦幻？</p></div><br /><div><p>答：梦境都是真的，一真一切真。心外无法，法外无心。我之前讲了十种梦境。往往梦中的事情几天几个月几年后实现了，他把它当真了；有许多东西它未来不能实现啊，他就认为它是假的。不是这回事。今天由于时间关系不能再详细解释了。</p></div><div><p><br /></p></div><div><p>38.弟子修行，在什么样情况下表示已经进步了，已经是证果了？</p></div><br /><div><p>答：当听到如来藏的道理，你们现在还会不会恐惧死亡？凡是不再恐惧的人是因为明白了人没有死，懂得了有过去、现在、未来，懂得了修行，这就是证果；第二，我们有时候想起来某个人这么害我，而自己现在想恨都恨不起来了，这就是证果；你过去舍不得拿钱来帮助别人，现在能布施了，而且很高兴，这就是证果；心情变得平缓了，不容易发脾气、发牢骚了，这就是证果。证果，就是把不好的习气变成好的习气，不好的习气是证恶道之果，好的习气是证善道之果。</p></div><div><p><br /></p></div><div><p>39.科学实验证明每个人的心念吸引同心念的人，也是磁场相同的会有吸引力，正如佛讲的命自我立，有什么样的心就感召什么样的环境。真是很神奇！</p></div><br /><div><p>答：这个宇宙真理就是「应供」。每个众生都受自己对自己、对别人、对外界的那种行持而自受其报，叫应供。一切万法相互之间都有心电感应，在佛法里叫回向；在牛顿那个说法叫万有引力。这个世界上没有人吃亏，也没有人会占便宜，真想明白了，你没有办法生烦恼。有些人总看到别人怎么样，这个环境对我怎么样，环境是谁啊？别人为什么对你这样啊？懂得了应供，你会安心于道。</p></div><div><p><br /></p></div><div><p>40.大师所讲，让我心惊肉跳。大师可是佛？如此评判经典实在难受，岂可一概否定，唯有法华？万般相对看待，相对修持，哪有一步登天之法？即使明心见性，只是知道了还没有做到还需要当下行。</p></div><br /><div><p>答：好，法师是佛、是魔、是天、是鬼，不重要，你看法师所说之法根据何在。你看《妙法莲华经》第十七品以及《楞严经》最后一页所讲，听经闻法几分钟、几句话，不离讲堂当下成就——当然这是分真即佛，从阿罗汉、辟支佛到十住、十回向、十地、等觉，都可以在讲经堂当下成就。这是佛讲，而非印广法师自创。历代祖师对这个圆教多有开示。如圆瑛大师所讲：苟能顿悟本有，当下回光返照，一念熏修，则生死情关，忽然隳裂；正如千年暗室，一灯能破，更不别求方便耳。吾人有志出生死者，舍此决无舟筏矣！</p></div><div><p><br /></p></div><div><p>41.我们都是从清净中来，这个清净是否指佛性呢？如是，那么因一念无明沦落为众生，而后修行成佛又回到那个清净的源，会不会又一念无明又成众生呢？如说不会，那么此本源和彼本源是不是一个？如是，都皆清净本源，前者为何有无明呢？</p></div><br /><div><p>答：打两个比方。第一，你把手伸到火里一烫，还敢不敢再往火里去了？（众答，不会）。第二，你的种子下地以后变成了植物，开花结果，种子就是原来的佛，植物是众生，当植物再结出种子的时候，还是不是原来的种子啊？不是。既然不是，我们会不会再堕落为众生啊？第三，从矿石中提炼出黄金，黄金还能不能再成为矿石啊？</p></div><div><p>我们不妨把最初的佛说为原始佛，原始佛堕落为众生以后，吸收了经验教训，再成就的佛叫究竟佛；两者看似相同，其实经过了否定之否定，已发生了质的变化。</p></div><div><p><br /></p></div><div><p>42.菩萨道是从小乘向大乘而来，还是看根性直接走大乘成正果呢？</p></div><br /><div><p>答：既可以从小乘而来，也可以从零起步，从不定凡夫起步，大乘佛法是平等法。不论你是六道众生，还是不同层次的菩萨，你只要学这个圆教，不管根机深浅，早晚上床，一起天亮。在某种意义上，可能六道凡夫当下成就的果位会超过老修行，全在于你能不能把持住当下这一念。</p></div><br /><div><p><br /></p></div><div><p>43.在《文殊师利所说摩诃般若波罗蜜经》中讲到众生界不增不减，因为众生实不可得，无相无形，众生定相不可得度。既然如何度也度不完，菩萨还一直度什么？何不学小乘做个自了汉，反正世界都是一个人。</p></div><br /><div><p>答：所以把这个分别法和无分别法要区别开来。无分别不妨分别，分别不妨无分别。拳头变成了手掌，变成了剪子，变成了锤子，变成了什么什么，数量上这样多，本来是一个拳头相。变成了这许许多多，剪子、锤子增加了没有啊？不能讲它增加，也不能讲它不增加。知道它没有增加，你明心见性，自利；知道它有了增加，你就利他度众生。懂得无分别法才能了生脱死自利，懂得分别法我们才能度化众生。</p></div><br /><div><p><br /></p></div><div><p>44.佛不转定业，佛都不能超度目犍连尊者的母亲，为什么现在有些法师或在家居士可以将鬼道或地狱道里的众生超度到极乐世界去呢？</p></div><br /><div><p>答：经上讲了，凭借十方众僧威德之力，目连之母得脱一劫恶鬼之苦，当下升于天道。有很多高僧大德都非常有德行，超拔三途众生往生极乐，不是难事。主要看两个：第一，法师是否明心见性；第二，众生是否愿意接受帮助。如此便可。</p></div><br /><div><p><br /></p></div><div><p>45.顶礼恩师，明白了如来藏道理，万事万物万法都是一个人一个念变现出来的，我们时时事事处处念念都应反观自性，这就是念念在道修心，对吗？</p></div><br /><div><p>答：对。</p></div><div><p>为了调整色身需要打通三脉，这与修心有矛盾吗？</p></div><div><p>答：没有。</p></div><div><p>能不能圆融？</p></div><div><p>答；能圆融，明白了如来藏的道理，吃饭、穿衣、走路、拳打脚踢、呵祖骂佛，皆是修行。</p></div><br /><div><p><br /></p></div><div><p>46.我们现在每天都在听法师们开示《楞严经》《法华经》，基本明白了如来藏道理，想提升自己的品位，我们该怎么做呢？</p></div><br /><div><p>答：反复看光牒和讲记，每看一次就会提升品位，提升境界；没时间看的时候，看什么就观照什么，这就是度化众生。走在路上，是天大地大还是我大，为什么啊？不知不觉你的烦恼习气没有了，就这么观照。</p></div><br /><div><p><br /></p></div><div><p>47.请问第一念生相无明是怎么来的？</p></div><br /><div><p>答：没有来也没有去，法尔如是。随时变现，没有过去现在未来，但它可以显现过去现在未来。</p></div><br /><div><p><br /></p></div><div><p>48.明白了如来藏，居士如何修行，在日常生活中如何观照？</p></div><br /><div><p>答：刚才已经讲过了，反复提起观照——吃大米的时候，是我吃大米还是米吃我啊？我抱碗还是碗抱我啊？碗跟我是什么关系啊？一想就明白，你不要去考虑，但要知道这个事。当与别人发生矛盾的时候，他是谁啊，我是谁啊？人家骗你一百万，一百万是谁啊，骗子是谁啊，你是谁啊？生不带来，死不带去，没有人吃亏，也没有人沾光。别人骂你，污蔑你，伤害你，冤枉你……怎么对待？他是谁，我是谁，他是在帮我消业障还是在帮我加业障，你要懂得感恩啊。</p></div><div><p>凡是我们受到不公正的待遇，都是在给你消业障，你都是在给自己还债。始终要记住，没有人吃亏，也没有人沾光，要会善待其心。你认为自己躲得了清净，这样我好用功，其实错了，你那个时候就已经产生执着，就已经是给自己制造障碍。你所认为的终于清净了其实并没有清净，这就是我执，这叫对待法。楞严大定叫自性本定；换一个境界就怎么样，那叫对待定。</p></div><br /><div><p><br /></p></div><div><p>49.恭请师父开示怎样观机逗教？</p></div><br /><div><p>答：吃饭时满头大汗，你知道这个水怎么来的？汗水没流之前在不在啊？在的，在心里。有没有形相啊？没有。流出的汗水是不是「弥陀」（译作「量」，表万法）？没流出来之前在心里，是不是叫「阿」（译作「无」，表真如）？是不是阿弥陀（色不异空，空不异色）？这就叫逗机观教。</p></div><div><p>每个人都要学会这一手，有时候几句话，你叫人家了生死，功德无量啊！所以佛在《法华经·见宝塔品第十一》讲，你讲一句《法华经》，比站在最高的天上对无量众生讲无量的经典，而且把无量众生都培养成阿罗汉，这样的太虚空大法师没有你的功德大。懂了一心三藏，你怎么样讲都是《妙法莲华经》。</p></div><br /><div><p><br /></p></div><div><p>50.当我念佛诵经时老是在打妄想，请问师父怎么能不打妄想呢？</p></div><br /><div><p>答：妄想就是菩提啊，不要怕，不要管它，不要刻意去断。一切都是在无功用道，你只管学如来藏大法去观照。打妄想让它打个够，越打越高兴，没有什么了不起，知道是妄想的时候你就已经是真的了。</p></div><br /><div><p><br /></p></div><div><p>51.佛法为什么是难信之法，为什么信佛的人这么少？</p></div><br /><div><p>答：因为众生的习惯，是执着六根，不断攀缘，在五欲六尘中迷惑颠倒的时间太长了，忘记了回家的路，所以好好看《楞严经·168字》。其实最难信之法是指《法华》《楞严》，是见性之说。</p></div><br /><div><p><br /></p></div><div><p>52.我以前法门的老师讲，他不开示《法华经》的原因是：「悟而不修会落空，没有用」。请师父开示，如何理事圆融？</p></div><br /><div><p>答：《法华经》《楞严经》是圆教经典，这个法门无修无证，不立阶梯，一步登天。我们悟的当下既已是分真即佛，已经了生脱死，不能用圆人前七种方便来混淆。</p></div><div><p>这个理事圆融，往往是修行人用小乘法、方便法来误解大法的借口。《楞严经》讲「发明便解脱」，叫你修了吗？《心经》讲「照见五蕴皆空，度一切苦厄」，要你修了吗？《佛说阿弥陀经》讲「已发愿已往生，今发愿今往生」，叫你修了吗？《法华经》讲「一念信解，蒙佛授记」，叫你修了吗？</p></div><br /><div><p><br /></p></div><div><p>53.《楞严经》里所讲的真真如性，以及真心如何变现万法。真真如性是指第九识吗？</p></div><br /><div><p>答：不是。第九识是真，是如，是性，或者也叫真如，或者叫本心。真真如包括九个识，包括天地万法，叫真真如性，或者叫真真真，或者叫如如如，或者叫真如如，你必须要三个在一起，是一个意思。真的、妄的、半真半妄的、有形有相的，统统都是我们的本体，叫真真如性。讲真讲如，是《金刚经》《华严经》那种不了义大乘法、分别法要讲一个真，讲一个如，那么真如智慧的相，被称为是妄。到了《法华经》《楞严经》，既然妄也是真变出来的，妄当下是不是真啊？就是真真如，就叫空如来藏、不空如来藏、空不空如来藏，你懂了这三个是一体，三个真，三个如，你怎么讲都行。</p></div><div><p>问：空如来藏对应是是第八识，还是第九识？</p></div><div><p>答：空如来藏对应的是第九识，用分别法对应的是第九识，用究竟法来讲，空如来藏是不是对应一切万法呀？有没有哪一法不是空如来藏啊？眼识、耳识等前面的六种意识心，是不是空如来藏啊？第八识是不是啊？用究竟法来讲，没有哪一法不是哪一法；用分别法讲，它只对应第九识。</p></div><br /><div><p><br /></p></div><div><p>54.一般的明心见性有神通，能看得见，有境界了，或者预见什么事情；那么现在你讲的这个明心见性，和神通现象好象挂不上，一般的还不服。</p></div><br /><div><p>答：果真听懂并且深信万法都是一念之所变现——诸佛菩萨、天人、泥巴、瓦块，有情无情、万法万相都是一个人一个念变现——这就是明心见性。至于神通，鬼神都有五种神通，二十八层天的人都会腾云驾雾，排山倒海，千变万化，道家的老子、吕洞宾肉团身飞到天上去了，不过是凡夫外道。佛在《大般涅槃经·如来性品第四之三》里讲，阿罗汉的那种慧眼都是肉眼，阿罗汉的神通是不是比28层天的神通更大呀？都是凡夫肉眼，而受持《法华》《楞严》的人，肉眼就是佛眼。必须要从这个误区中走出来，否则将来必定走火入魔。</p></div><div><p>五种神通是我们本有，不需要修。你多吃点肉，多干点坏事，多搞点阴谋诡计，死了以后就是鬼，就有神通，要修他干什么？有福不会享，这是我们本来的那个功能，不需要修，死了就有，包括做狗做猫都有神通。</p></div><br /><div><p><br /></p></div><div><p>55.我想给我们这里的寺庙结缘一些光盘，可是他们说他们结缘给信众的方式要由他们说了算，我是想叫他们免费结缘给信众，但又怕他们收费，该怎么办？</p></div><br /><div><p>答：看具体情况。能够亲自结缘就亲自结缘，不能亲自结缘，就给寺院结缘，他们即使收费了，只要得到光盘就能成就人，还是值得的。</p></div><br /><div><p><br /></p></div><div><p>56.那入世修行和在寺院修行，会有什么不同？</p></div><br /><div><p>答：这个不能一概而论。有些人在家修行比出家修行还要好。如果家人给你障碍太大，你要发大心，想尽一切办法来度化他们。如果在家能够统领大众修行，你比出家更好。只看你在承担如来家业中所起的作用而定，不要在出家在家这个相上执着。当然，出家也有非常殊胜之处。要看个人的发心和福报。</p></div><br /><div><p><br /></p></div><div><p>57.若藕在泥中生长，越发清香，可喻入世修行；那么藕在清水生长，是否可比喻在寺院里修行？</p></div><br /><div><p>答：也不能一概而论，诸佛是逗机说法。有些人在烦恼中修行，他提升特别快，对于他人误解诽谤，他只说「阿弥陀佛」，满心欢喜；有人打他一拳，他高兴得不得了，正好检验忍辱程度。像这种人，烦恼越重，环境越恶劣，他成就越快。有些人心量很浅，你一个脸色给他看，他就受不了，这种人可能躲起来修行，或者在寺院修行，相对而言比较好。即使在寺院修行，也不一定各个都如他的意，这种人好像把路走的竖起来了，处处不合群。还问师父啊，我到底在哪里修行好？我说你最好到极乐世界去吧，这个地方没有清净的地儿。他认为只有他一个好，别人都是坏蛋。</p></div><div><p>我们的心很奇妙，随大现大，随小现小，随烦恼现烦恼，随菩提现菩提，你自己要会把握。真正会修行的人，到哪里都随顺环境，包容人事。《佛说阿弥陀经》里面的七宝，其中有一宝叫什么？赤珠，是不是？修行人要像赤珠一样，随遇而安。赤珠是滚到哪里，滚不动了就安在哪里，是不是？它绝对不会生烦恼：怎么把我放在这个鬼地方啊？你一骨碌它就滚，表随缘去度人，不能滚的地方，就安心自利。有缘就利他，没有缘就自利。环境没有好坏，好坏是你的一颗心。</p></div><div><p>越是受到委屈，他越是能够成就自己，佛怎么讲的？忍之为德，为布施、持戒、精进、禅定诸功德所不能及。现在修行人往往脸皮很薄啊，总是喜欢听恭维的话，赞叹的话。顺我者昌，逆我者亡。你这样还能成就？！我们修法华楞严，是包容天下，一定要团结一切可以团结的力量。</p></div><br /><div><p><br /></p></div><div><p>58.没有皈依者，在家人，在网络听师父讲一心三藏，能否成佛？</p></div><br /><div><p>答：能成佛。成佛重在觉悟，不在形式。如果形式上皈依，却不学如来正法，没有用！懂得了一心三藏，是真皈依。皈依觉，皈依正，皈依净，皈依自性三宝，是真皈依。但是呢，形式上的皈依，在一定的时间、一定的场合，它能起到很大的促进作用，我们也不能忽视；而且呢，众生还执着这个形式，护法神明也还执着这个形式，我们为了恒顺众生，不妨做一个形式上的皈依，但根本的根本，我们要皈依真理。</p></div><br /><div><p><br /></p></div><div><p>59.请问师父怎么样才能快点得到辩才无碍的智慧？</p></div><br /><div><p>答：真正看懂《楞严经》，你们都能辩才无碍。</p></div><br /><div><p><br /></p></div><div><p>60.弟子上次在大佛寺提问，说《法华经》只能开示大根机之人，《法华经》里面没有说初学者经由《法华经》成佛，这个问题是诽谤了《法华经》，弟子很后悔，而且弟子现在脸上长了白班，也请大家相信《法华经》，真的是有果报啊！阿弥陀佛。</p></div><br /><div><p>答：你现在要忏悔，向大家忏悔，这是教训！这是对《法华经》误解、怀疑的果报。法华会上许多有学声闻，有学声闻是不是初学者啊？无学的是老修行，有学声闻是初学者，是不是蒙佛授记了？《法华经》《楞严经》既是经王，又是基础课，是公共课。</p></div><br /><div><p><br /></p></div><div><p>61.通过这几天学习大乘妙法和《过五关度六将证菩提》，我们开智慧了，但还有两个问题：家里的老人有学佛的，有不学佛的，有念佛的，如果往生了，后事如何处理，还要助念吗？</p></div><br /><div><p>答：要助念！即使他是菩萨往生，我们也要助念。助念的目的有多个：防止他还没有明心见性而堕落恶道；其次给他提升品位；还可以通过助念影响鬼神大众以及影响左邻右舍等社会大众，给他们种下金刚种子。但是我们不能把成佛这个目标就指望在助念上。有些地方以助念为由，拒绝受持正法，拒绝听闻正法，这是走了邪路，要注意，一种倾向掩盖着另外一种倾向。</p></div><br /><div><p><br /></p></div><div><p>62.若想佛法兴，唯有僧赞僧。这句话如何解释？</p></div><br /><div><p>答：这句话呢，不能一概而论。对于讲解如来正法的修行人，我们一定要赞叹，不管是在家出家，赞他就是赞如来正法。但是，佛法从诞生起，就是在斗诤中成长。特别是末法时代，现在是后五百年，是斗诤坚固时代，你不斗诤，如来正法就要灭亡。</p></div><br /><div><p><br /></p></div><div><p>63.站在一心三藏的角度来讲，如何看待因果？成佛后还看因果吗？弟子对这个问题比较迷惑。</p></div><br /><div><p>答：万法皆空，因果不空。有三藏之因，必成三藏之果；成佛要有佛因，成菩萨有要菩萨因，成天人鬼畜，就有天人鬼畜之因，因果是不空的。所以《佛说阿弥陀经》讲「青色青光，黄色黄光」，就指因果不空。「既已食时，还到本国」，就是即因即果。《楞严经》讲「发明便解脱」，发明就是因，解脱就是发明之果。千万不可以含糊，凡夫因成凡夫果，圣人因成圣人果。成佛后当然要看因果，我们就是以成佛之因，来结众生成佛之果。</p></div><br /><div><p><br /></p></div><div><p>64.一真一切真，一假一切假，万法唯心所现，唯识所变。既然变现一切东西……</p></div><br /><div><p>答：既然是变，是不是有无量的东西啊？天人鬼畜、泥巴瓦块各有特征；既然是现，是不是就一个东西啊？如果讲释迦牟尼是佛，泥巴瓦块是不是佛啊？如果猪八戒是凡夫，那释迦牟尼、观世音是不是也是凡夫啊？因为大家都是一个东西变出来的。那么同样一真一切真，大家都是佛，在释迦牟尼佛起了妙用，那猪八戒有没有起到妙用啊？没有，虽然没有起到妙用，他是不是释迦牟尼啊？仅仅是因为不懂，所以佛来告诉大家，你就是我，你懂了当下就是我，你也起妙用，是表这个法。</p></div><br /><div><p><br /></p></div><div><p>65.佛即众生，众生即佛，没有明心见性的人说此话，是不是造业？</p></div><br /><div><p>答：说这个话，也叫造业，叫造口头禅的业，是不是？我们任何一个念、一句话，都在造业；但这个业呢，你不能讲是恶业，最起码这个话是对的。</p></div><br /><div><p><br /></p></div><div><p>66.不信因果的人，能真信一心三藏吗？</p></div><br /><div><p>答：你这个问得没有道理，不信因果的人，他怎么能信一心三藏呢，是不是？他既然能信一心三藏，就已经信了因果。</p></div><br /><div><p><br /></p></div><div><p>67.听说文殊菩萨在《楞严经》否定了念佛法门？</p></div><br /><div><p>答：这个提问是不对的。大势至菩萨是念佛成就的，不可否认。但是，在《楞严经》第六卷，释迦牟尼佛敕令文殊菩萨对二十五位菩萨所证的法门进行评判，选出一个适合阿难的初机众生修行的法门。文殊菩萨把前面二十四位菩萨的法门统统否定，其中包括大势至菩萨的念佛法门，他讲了四句话：</p></div><div><p>诸行是无常：有形有相的天地万法都是无常的，生生灭灭；念性元生灭：大势至菩萨那种念佛的本质是生灭法，怎么个生灭法呢？阿--弥--陀--佛，似生似灭，是不是啊？「阿」生了，你念「弥」的时候，「阿」灭了，「弥」生了，你念「陀」的时候，「弥」灭了「陀」生了，你念「佛」的时候「陀」灭了，「佛」生了，你再念「阿」的时候，「佛」灭了，「阿」生了，是不是生灭法啊？而一心三藏讲天地万法生生灭灭、不生不灭，都随着我们的真心本来面目随缘显现，全性起修；因果今殊感：因和果不同，差别太大了，怎么个差别大呢？这种着相念佛法门用的是生灭识心，而成佛之法是非生非灭、非不生非不灭，一样不一样啊？用生灭之因只能求生灭之果，怎么能求到不生不灭的佛果啊？云何获圆通：怎么能够圆通啊？你没有把圆通法门、基础法门学好，你怎么能学高级法门去成佛啊？这是不是否定啊？要这样理解。</p></div><div><p>懂得了「阿弥陀佛」这个法，我们已经成为分真即佛，然后再用念佛法门锦上添花，成为圆满之佛，这个次第要搞明白。所以，《法华》《楞严》如来藏，表面是否定一切法，其实是包容一切法，其实仅仅是几句话的功夫，它是来帮助一切法成就的。我们要相信，念佛法门是高级法门，高级到什么程度啊？高级到你几天、几夜、几年都不打一个妄想才能成就，很难达到啊？</p></div><br /><div><p><br /></p></div><div><p>68.既然念佛不能往生，慧远大师的一百二十三个同修是怎么样往生的？</p></div><br /><div><p>答：我在什么时候讲念佛不能往生？我曾经有三段法语：唸佛不能往生、唸佛不能成佛；念佛一定往生、念佛一定成佛；念佛当下往生、念佛当下成佛。不可以断章取义。慧远大师一百二十三个人是怎么样往生啊？提起这个事情我们感慨万分。当时印度来了一位法师叫佛陀耶舍，就是传一心三藏，无人理睬，然后慧远大师请法，佛陀耶舍举手示意，佛（拳头），众生（手掌）……慧远大师当下慧眼识真人，这就是一心三藏，以此指导念佛，百分之百往生。</p></div><div><p>那我们想一想，一百二十三人全部往生，是活着往生，还是死了以后往生啊？（众答，活着）。一定是活着往生。慧远大师是净土初祖，这个法门为什么没有传下来?大势至菩萨的净土是不能成就初学的，文殊菩萨和释迦牟尼佛已经批判过了。现在竟然有人打着《大佛顶首楞严经》的旗号，讲〈大势至菩萨念佛圆通章〉是佛提倡的，是不是错解《楞严经》啊？</p></div><br /><div><p><br /></p></div><div><p>69.听闻《法华经》后明心见性，当下能否证入十地等觉菩萨？怎样理解悟后起修和悟后进修?</p></div><br /><div><p>答：如果是其它的法门和经典，是悟后起修，因为那个方便悟不能了生死，要解行并重才能了生死。读《法华经》，悟即已了生死，进修是锦上添花成圆满佛。所以，进修和起修要分清楚。</p></div><div><p>能否证入十地等觉菩萨这个不能一概而论，要看各人发心大小。当年法华会，佛讲了一品〈如来寿量品〉，有些人证到阿罗汉，有些证到住位菩萨、行位菩萨、有些证到向位菩萨、地上菩萨，有些证到八地、九地、十地、等觉位菩萨。而印光大师讲：「法华奥典，妙冠群经，闻即往生，位齐等觉」，全凭信心大小、发心大小来决定品位高低。</p></div><div><p>打比方说，你第一天来听了这个如来藏道理，既已了生脱死了，是阿罗汉或者住位菩萨；你第二天来听，越听越法喜充满，你就已经到了行位了；我还要劝更多的人来修行，这个法门太好了，你就到了回向位；捐出更多的钱财来流通法华的讲记、光碟或者印书，你有可能就到了地位菩萨；你桌子一拍，「我什么也不顾了，我倾家荡产，这一生一世就是弘这个法」，八地菩萨；这是真的。（众鼓掌）。龙女听了一品《法华经》便成为圆满佛！大部分人最低保障线不落六道轮回、往上不封顶直至十地、等觉菩萨，全靠我们信心的程度、发心的大小。</p></div><div><p>每一个人都要有责任感，我们是法华道场的主人翁，我们就是如来家业的主人翁，你不明白还情有可原，我们没有任何理由来懈怠，我安能忍心不把这样的妙法传给更多的人？要发心。不说一天度一个人，哪怕是两天度一个人，三天度一个人都很好，明白吗？一传十，十传百，百传千千万，是不是很快就传遍天下了？我们不是把自己关起门来赞叹自己：这样太好了，终于解脱了。我们要使整个地球人都解脱，实现共产主义，地球人解脱了，没有人杀牛、杀马、杀狗，那些众生是不是也解脱了？都解脱了。要这样来修行，这样来弘法。那些牛马猪羊是谁啊？是不是我们自己啊？是不是我们过去世的父母儿女啊？你明白这个法你不去解救他们，你于心何忍啊？要解救他们向他们传法是不可能的，要向人传法，要更多的人来明白真理。</p></div><br /><div><p><br /></p></div><div><p>70.弟子已明白一念生万法……</p></div><br /><div><p>答：一念生万法，是《大方广佛华严经》的境界，也是弥勒菩萨唯识的境界，不完全正确。到了《法华经》《楞严经》圆顿大法，是一念变现万法，也是万法变现一念，还讲万法变现千法，百法变现一法，没有谁不能变谁。</p></div><div><p>圆瑛大师讲：此大乘了义，是佛常说，亦各随机解。如一切唯心造，凡小解为业造，权教解为识造，圆顿之机，直了真心所现，真所谓，「佛以一音演说法，众生随类各得解」。</p></div><div><p>现代科学克隆技术能从一滴猴子的血造出猴子来，但这还是皮毛。一滴猴子的血足以变现出一只猴子或者一只羊，或者无量的天人鬼畜、泥巴瓦块，没有谁不能变现谁。狗屎能变成黄金，黄金能变成白银，只在于心力的妙用。因为我们烦恼习气很重，心力已经到了强弩之末。天人要一个飞船要一个卫星，他还需要制造吗？他一念就有，一念就能变现出飞船火箭来，他变化黄金白银牛屎狗粪是不是易如反掌啊？都是我们心的妙用。</p></div><br /><div><p><br /></p></div><div><p>71.佛弟子是否可以从事买卖含有动物成分的保健品？</p></div><br /><div><p>答：不可以。</p></div><div><p>问：如果从事这些工作是否造业？</p></div><div><p>答：是造业。</p></div><div><p>送给人吃好不好？</p></div><div><p>答：也不好，买的人吃的人都要受报应。</p></div><br /><div><p><br /></p></div><div><p>72.我两个女儿都三十多岁了还没有成家，我压力也很重，她们不理解当母亲的心情，我应该如何接受这个现实？</p></div><br /><div><p>答：世间法里有这么两句话，「儿女自有儿女福，莫为儿女作马牛」。今生今世命中有定，你不必过多焦虑。或者她们婚期比较晚，或者她们根本就没有成家的这个缘分，都是自己的造化。你急也没有用，是白着急。如果她们能学佛法，这未必不是大福报。</p></div><div><p>那些真正想修行的人，明白真理以后，已经有了夫妻儿女甚至第三代，现在都还要挣脱家庭，冲出牢笼。当然你们已经成家的同修也不必为此焦虑。明心见性的人在家出家都是一样。菩萨出世各有各的责任，不是说非出家不可。任何境界都要善待自己，不必悲观丧气。过去世造的业我们要认命，今生世如果你学佛，可以用变数改变定数。</p></div><br /><div><p><br /></p></div><div><p>73.家里人都是大手大脚花钱，这方面我不能接受，我该怎么办？</p></div><br /><div><p>答：好好劝导。我们不能强迫人家来学佛，学佛与不学佛都受到国家法律的保护，只要他不障碍你就行。</p></div><br /><div><p><br /></p></div><div><p>74.是否可以把汉字用如来藏解释（具有学说的特征），从源头上做起，全面传播普及如来藏法义？</p></div><br /><div><p>答：当然可以。</p></div><br /><div><p><br /></p></div><div><p>75.昨天有师兄给我说《无量义经》《法华经》和《观普贤菩萨行法经》，可我只读过《法华经》与《楞严经》，请问要去读那些经吗？</p></div><br /><div><p>答：《无量义经》是《法华经》的前奏，《观普贤菩萨行法经》我没有看过，不好回答。一般把《法华经》《楞严经》真正读懂就可以！像《无量义经》《涅槃经》《心经》《阿弥陀经》等等，可以说为一个法脉。</p></div><br /><div><p><br /></p></div><div><p>76.我们在念佛的时候应该观想吗？如果观想，按《金刚经》上所说：「若以色见我，以音声求我，是人行邪道，不能见如来」？</p></div><br /><div><p>答：明心见性的人观想也行，不观想也行，怎么样修都行。没有明心见性的人，如果你勇猛精进地观想，有百分之九十九要走火入魔！《金刚经》讲：凡所有相，皆是虚妄。着相是行邪道。</p></div><div><p>《金刚经》对于破除执相昧性，有它的进步性。然而在圆教的《心经》讲：「色不异空，空不异色，色即是空，空即是色」，相和性是一个东西。讲如来藏大法，我们看到的、听到的都是真的，不需要去观，不需要想，你也不需要破，你破它干什么？天地万法都是一个人一个念变现。真心本来面目既不是色，也不能讲不是色；既不是空，也不能讲不是空。</p></div><div><p>一旦明白了什么是阿弥陀佛，怎么样见都行——以色也行，不以色也行。你如果不明心见性，你以色见也见不到，你不以色见也见不到，见的都是假的！什么色，什么性，讲白了就是一个念变现。这个法我反复强调多少遍了。</p></div><br /><div><p>77.「心体本净，自性元成，大悲周遍，随缘显现」，这四句话中，「自性元成」的「元」怎样理解？</p></div><br /><div><p>答：这四句话是不折不扣的一心三藏。</p></div><div><p>心体本净：心就是「阿」，体就是「弥陀」，阿弥陀。心就是「如」，体就是「是」，如是我闻。本净本净，本来就清净。不从他来，不从后来；没有开始，没有结束，本来就是这样。怎么净呢？这里的「净」不要解释为「干净」，心外无法，法外无心。清一色，都是一个念变现的，千差万别是我们的同分妄见所成。</p></div><div><p>自性元成：仍然是心体本净，元就是本来，本来就成就的。按照圆顿大法，色不异空，空不异色。性就是相，相就是性，所以元成元成，法尔如是，原来如此。</p></div><div><p>大悲周遍：大就是表我们的真心本来面目啊！大慈悲心怎么周遍？周遍十方三世天地万法，随缘显现。缘也是我，因也是我，显也是我，现也是我，能现是我，所现也是我。真心本来面目非心非体，非色非相，非如非是，而是随缘现心现色，现如现是，现境现相。</p></div><br /><div><p>78.依止师父后早晚课上什么？</p></div><br /><div><p>答：依止也好，不依止也好，要懂如来真实义。懂了以后，你上早晚课也好，不上早晚课也好，都能成就。如果是在道场修行，仍然要遵守常住安排。</p></div><div><p>但是最好的修行是什么呢？要注意！文殊菩萨虽然讲明心见性以后怎么样修都行，但因为你是我的依止弟子，你有责任和义务，帮助更多同修了脱生死。许多弟子到处奔走呼号，香包一背就出发，装着书和光碟，见有缘人就散发，劝他们受持。我们还可以组织法会，请相关法师传如来正法。</p></div><br /><div><p>79.《楞严经》中七处征心，怎样契入如来藏之理？</p></div><p><br /></p><br /><div><p>答：这个法太长，简单来说——心不在中、不在内都是佛的方便说；他无处不在，哪有中？哪有内外？可是呢，阿难说在内、说在中，佛一概否定。为的是逼着阿难回头，看看你阿难还能狡辩到哪里去。</p></div><div><p>所以佛讲不在内、不在中，是以妄制妄。如果不是阿难，而是目犍连，佛就不会这样说了。为什么呢？目犍连神通很大，如果说心在内，佛问目犍连能不能看到五脏六腑啊？目犍连就能看到啊，这就不方便解释了。</p></div><div><p>《楞严经》呢，是后后破前前，前面立后面破。就像我们拉拖把一样，一边往后走一边把前面的脚印拖掉。至于怎样契入如来藏之理，如果已经明心见性了，心在内，心在中，对不对啊？那统统都对。所以对于没有明心见性之前，来探讨这个问题是错误的，那错误的道理是不是如来藏啊？是不是我们的心变现出来的啊？要这样来领会。</p></div><br /><div><p>80.请师父用如来藏解释，「道可道，非常道，名可名，非常名」。</p></div><p><br /></p><br /><div><p>答：这句出自《道德经》。道可道，非常道：万事万物的真理（指第一个「道」）不可以用语言表示出来，讲出来就已经变味了，不是原来的那个道。按圆顿大法来讲，「道可道」，当下就是常道。那个不能讲的道，你知道了当然就可以讲了，怎么样讲都行。名可名，非常名：「名可名」呢，是因缘所生法；「非常名」呢，他自认为破因缘法，其实破不了。「常名」就是永恒，就是自然。因缘法是不是自然，是不是也是本性？都是的。</p></div><div><p>比如说我们被称为「人」，而不是鬼。明心见性后，这个人既不是人，又是人；既不是泥巴，又是泥巴……这时候你再讲这个人是人，对不对啊？就对了，讲人也是对的，讲鬼也是对的。</p></div><div><p>所以要懂得圆融，谁是谁，谁又不是谁啊！这个法很难讲，你能绕过来就千幸万幸。一定要看好自己的心。我在这里可不是堵塞言语，并不是吓唬你们不敢讲话，甚至要保护你们的功德，大家能理解我的良苦用心吗？当年发现了如来藏的真理，我感慨万分，废寝忘食也要把这个真理公诸天下，让大家都来成就……菩萨教化众生，舍生忘死，直心是道场。</p></div><br /><div><p>81.世间人过年过节送礼，一般都喜欢用烟酒，受菩萨戒后不能用烟酒送礼了，怎么恒顺众生？别人送来烟酒应该怎么处理？</p></div><p><br /></p><br /><div><p>答：有好多都可以代替烟酒作为礼物，人参、佛珠、电子产品……至于人家送的香烟可以做为垃圾处理掉，尽量不要用火烧，火烧了就是杀生。酒呢，可以适当地每天喝一点调理身体。为什么呢？你送给别人是不是叫人家造业啊？至于那些带有动物性的肉鱼类的食品以及皮草等，你送给人家也是造业，你扔到水里埋到地里也还是造业，这些问题处理很困难。数量不大的你可以自己吃，发心与它们结缘。这都是权宜之计，是没有办法的办法，尽量减少对别人的伤害，要受伤害就让自己来承担。</p></div><br /><div><p>82.我听了《法华经》《楞严经》，可烦恼习气还常出现，这样能往生净土吗？</p></div><p><br /></p><br /><div><p>答：首先你听懂了没有？天地万法都是一个人一个念之所变现，大光明藏中谁是谁，谁又不是谁？有道无道，自己知道。真正听懂了并且深信不疑，有烦恼习气不影响你往生净土，但是品位不高。</p></div><br /><div><p>83.有两个人，一个没了一条腿，一个是疾病染身，不能行走，就在家念阿弥陀佛，很认真，但是不学法，不懂道，年纪也大了，就知道念佛，请问这样的修行能成佛去西方极乐世界吗？</p></div><p><br /></p><br /><div><p>答：不能。没有任何可能，因为不懂得佛。你可以去他家里讲如来藏的道理。</p></div><br /><div><p>84.为中阴身念《地藏经》管用呢？还是念《法华经》管用呢？</p></div><p><br /></p><br /><div><p>答：佛讲的，你能够读一句《法华经》，写一句《法华经》，念一句《法华经》，讲一句《法华经》，胜过大法师讲无量的经典，教化无量的众生都成为阿罗汉。</p></div><br /><div><p>85.学生考试，其它寺院都在做法会，我们自己也时常念楞严咒管用吗？</p></div><p><br /></p><br /><div><p>答：要看你自己有没有道行，有没有功德。如果你是一个全心全意为人民、为众生服务的人，你别说念楞严咒，你念南无一二三四五也管用。一个心地坦荡光明的人，他能够感化周边环境乃至天上天下有情无情。把周边环境理顺好了，所以那些冤亲债主不去干扰你的小孩子，他会手下留情。但这个只能保证学生考试正常发挥，并不等于说他不要用功就可以考好。</p></div><br /><div><p>86.如果学法之后，自己能够明白看破，那么先前造的业还会得到果报吗？</p></div><p><br /></p><br /><div><p>答：会得到果报，但是可以重罪轻报，大事化小，小事化了。</p></div><br /><div><p>87.慧远大师庐山结庐一百多个人往生，怎么知道他们往生了？</p></div><p><br /></p><br /><div><p>答：慧远大师是懂得一心三藏的。远公与鸠摩罗什法师、道安法师都是一个时代的，而且慧远大师也曾经讲《法华经》。现在好多东西都被扭曲了，但是呢，有根基的同修可以去看《慧远大师文钞》，就会明白，慧远大师的净土思想就是这个一心三藏。这是不可思议的。远公大师结庐念佛而往生，那是后话。因为明白一心三藏已经当下成就。作为修持《法华经》《楞严经》的同修，我们当生就能印证自己往生了没有。这个法奇妙无比啊，当年在法华会那些修行人，也都是自己根据佛提出的标准答案，自己印证自己往生了，然后佛给他们授记。</p></div><br /><div><p>88.无始之初沦落为众生后，我们现在是靠如来藏大法成就的，那十法界的第一尊佛是如何成就的，是如何明心见性的？</p></div><p><br /></p><br /><div><p>答：我们本来就是佛，我们的本性可以显现出觉悟的佛和迷惑的众生。当我们的自性现出无量众生的时候，那显现出智慧的佛的本能还在不在啊？在，是不是？所以当我们显现了无量的众生以后，在外面迷惑颠倒了，把回家的路忘记了，那么还有那些没有显现出迷惑颠倒的众生，也就是那些佛也就出来教化。你说的是威音王佛，是十法界第一个由众生位成佛的。</p></div><div><p>其实哪有第一第二啊，我们自己的本性就是佛，大家明白吗？自心本性可以现出无量的全部的佛，无量的迷惑颠倒的众生。所以无始以来，没有开始，没有结束，不要以为我们一开始这个世界全部变成了迷惑颠倒的众生，那第一个佛怎么出来的？这就钻入牛角尖了。一定要懂得，再强调一遍，并不是我们自心本性全部显现出迷惑颠倒。我们仍然还有无量的没有显现出迷惑颠倒的觉悟的如来，明白吗？</p></div><br /><div><p>89.是否可以把汉字用如来藏解释，（具有学说的特征），从源头上做起，全面传播普及如来藏法义？</p></div><p><br /></p><br /><div><p>答：当然可以。</p></div><br /><div><p>90.大圆满法是密宗黄教，如何用一心三藏来解释？</p></div><p><br /></p><br /><div><p>答：这个教法我没有研究。</p></div><br /><div><p>91.有位老和尚说只有死了才知道是否成佛，请开示？</p></div><p><br /></p><br /><div><p>答：成佛是活生生地当下就知道，《法华经》《楞严经》有金口玉言为证。</p></div><br /><div><p>92.唐山能出现和您一样讲《法华》《楞严》的人吗？</p></div><p><br /></p><br /><div><p>答：能，非常多。我第一天到这，有一位菩萨来下战书，这位菩萨将来是一位非常好的讲经法师，会超过印广法师十倍……我还听说过有两位退休的老人，可能还是干部，夫妻两个是研究《楞严经》的，他们提出些疑惑和质问，能有这样的胆量提出来，他们将来一定是大成就者，阿弥陀佛！小疑小悟，大疑大悟，但是要把握好自己的心态，必须端正追求真理的态度！</p></div><br /><div><p>93.唐玄奘当年取经的时候，《楞严经》在不在世间？龙树菩萨什么时候从龙宫取出来的?又什么时候成为印度国宝的?</p></div><p><br /></p><br /><div><p>答：这些历史问题我没有研究，也没有时间研究，也没有必要研究，对于我们来讲没有多大意义，我们不是研究佛法历史的。</p></div><br /><div><p>94.大师，怎么样把吃肉习气给消除？</p></div><p><br /></p><br /><div><p>答：权衡利弊，你如果怕来世下三途，自然就不会吃。别人没办法改变你的习气。当然要把《楞严经》看懂，真正明白一心三藏的道理，你吃的肉是谁？今天正好是母亲节，你是吃你过去世的父母，明白吗？你能吃得下去吗？</p></div><br /><div><p>95.往生去西方极乐还是去弥勒内院有什么不同吗？</p></div><p><br /></p><br /><div><p>答：对于明心见性的人没有什么不同，你到了极乐世界，到了弥勒内院，你都不会在那里安心。你只有回到娑婆世界，来帮助我们生生世世的父母，你才感到快乐，这就是菩萨！</p></div><br /><div><p>96.我和母亲、妻子都诵持楞严咒，有什么特殊的因缘吗？</p></div><p><br /></p><br /><div><p>答：没有什么特殊的因缘。但是持诵楞严咒如果做不到「三密相应」，也无济于事。</p></div><br /><div><p>97.我想问一下关于皈依和依止有何区别？</p></div><p><br /></p><br /><div><p>答：居士们到寺庙里皈依佛法僧三宝，需要出家人办理手续，举行皈依仪式，证明你从此就是佛的弟子。所以办三皈依的师父，叫皈依证明人；你要出家，给你落发的师父叫剃度证明人。这两个证明人，不管他有没有道行，都不影响居士的皈依功德和剃度功德，当然他要依法办事，要有完整的仪轨仪式才能生效。当然，在家人不可以作皈依证明人、剃度证明人。</p></div><div><p>而依止师父是依止这一个人作为自己的指导老师。选依止师父呢，要选择、考查——这个人有没有道行？能不能帮助我开智慧？选好了你得益，选不好你受牵连！依止师父跟依止弟子也是相互考查。那么依止师父呢，在家人可以拜出家人，出家人也可以拜在家人，男可以拜女，女可以拜男，师兄弟之间也可以拜，而且剃度证明人、皈依证明人可以拜他剃度的弟子，或者受皈依的弟子为依止师父。上人可以拜下人，老人可以拜年轻人，只有一个标准——双方愿意，我觉得他能帮助我成就。当然，如果你的皈依证明人、剃度证明人也能帮助你成就，你也可以拜他为依止师父。</p></div><br /><div><p>98.吃鸡蛋是荤吗，吃了得什么是果报？</p></div><p><br /></p><br /><div><p>《印光法师文钞》多次讲到这个问题：蛋不可食！邪见之人云：无雄卵之蛋可食，切勿听信。又蛋有毒，以鸡常食毒虫故；昔一人好食鸡蛋，久则腹中余毒，生许多鸡卵及小鸡。诸医不识其病，张仲景令煮蒜食之，则吐出许多鸡子，及已有毛并无毛之鸡。令一生勿再食，食则无法可治。可知鸡卵之祸大矣！</p></div><div><p>第二呢，吃蛋容易长肿瘤，这是真的！另外，现在鸡蛋用各种各样的化学原料混在里面，吃了有害人体健康。而不怕受果报的，不妨多吃。</p></div><br /><div><p>99.修行人可以炒股吗？</p></div><p><br /></p><br /><div><p>答：不可以，那是搞投机买卖，落风险；当然还要看你发心。如果把炒来的钱是搞名闻利养，果报很重；你来帮助别人，没有果报，就是有也很小。大乘佛法论心不论事，但是我们要考虑对外界的影响，防止人家种种误解和造口业，所以还是以不干为好。</p></div><br /><div><p>100.请问一个人一个念怎样对应一心三藏？</p></div><p><br /></p><br /><div><p>答：一般来说，这一个念是我们的第七识。因为他在动，有动相就是不空如来藏，那你这一个念没有起来之前，在不在啊？（众答，在）。在没有起灭的时候，那就是空如来藏，所以起来以后，是不是还是原来那个东西啊？所以就是空不空如来藏。</p></div><div><p>佛为了教化众生，硬是一分三来说，虽然是三，但没有谁是前，谁是后，谁是中间，都是一个东西。你说一个念是空如来藏显现的，我说空如来藏还是一个念显现的呢，是不是一样啊？一定要圆融到这个阶段，上升到这个阶段。一个念是两个念显现的，八万个念是九千个念显现的，一念是无量念显现的，无量念是一个念显现的，这个没有谁先谁后，谁大谁小，谁上谁下。</p></div><br /><div><p>101.请问人是从哪里来的？山河大地从何而来？</p></div><p><br /></p><br /><div><p>答：可能没有谁不知道人是从哪里来的吧。不是从母亲肚子来的，难道还是从天上掉下来的吗？我说还是从地缝里钻出来呢，从狗屎里爬出来的，对不对？</p></div><div><p>这个问题讲过好几次了，现代科学克隆，能把猴子的血变成猴子，羊血变羊，那人血能不能变人？一本书撕碎了，只要一小片，通过全息技术就能把整本书全部内容还原。</p></div><div><p>其实这些尖端科学才达到了佛法的皮毛而已。按照佛经所讲，一粒微尘就具足十方法界一切功德。而现代科学的成果，能符合佛法的理论。我们可以大胆推断，一滴猴子血，一粒狗屎，能不能变现出诸佛菩萨、天人鬼畜、泥巴瓦块，一切的一切，能不能？（能）。就这么简单，你们自己要知道，科学也是通过推断来预知未来。</p></div><div><p>在佛法里，有其理必有其事，有其事必有其理。我们能想象，一粒狗屎能变现成人、变现成佛，如果它不能变现，你想都想不出来！道理就这么简单，科学再进一步发展，也会再进一步证明佛法真理是不可战胜的！</p></div><div><p>你说一滴猴子的血跟一堆泥巴、一滴水、一粒狗屎有什么差别啊？中国地质大学人体科学研究所的孙储琳教授能够让炒熟的花生米重新发芽。同理，把人烧成灰烬，仍然能成活人、活鬼、活畜生。为什么？天地万法都是我们一个念变现的，有没有谁不是谁呀？当然，这个法不是一般的科学，不是几代人的科学所能成就的，但在通过禅定功夫，可以实现。</p></div><div><p>历史发展到今天，现代尖端科学可以帮助我们修行人明心见性，可以帮助佛法与时俱进。佛在当年没有讲的这么具体，但是从佛的基础理论，完全可以推导出我刚才描述的这种境界。</p></div><div><p>宇宙山河大地从何而来，需不需要解释啊？都是由我们的心所变现，无量的人就是一个心变现，没有哪一个人不是哪一个人。具体解释看《楞严经》第四卷。</p></div><div><p>你彻悟如来藏道理了，还有什么贪嗔痴？还有什么人我是非？当然，贪嗔痴也是有的，佛菩萨最贪、最嗔、最痴。怎么贪呢？他贪所有的人马上都成佛。怎么嗔呢？他为众生迷惑颠倒，却不听教诲而发脾气——也许发一回脾气，可以令百千万亿众生成佛；而在那里慢条斯理的讲话，就可能一百个人也未必有十来个人能成就。狮子吼，就是要一种特种的方法让人当下猛醒！</p></div><br /><div><p>102.听您的讲法很受益，只是这些法都是您自己悟出来的，什么时间才能变成我们自己的呢，要怎么做？</p></div><p><br /></p><br /><div><p>答：现在就能变成你们自己的。明白了就是你的，你明白了什么就是什么。你听明白了，现在回去讲跟人家听，一开始可能有点颠三倒四，讲了三天两天还零零散碎，但很快就能熟练流利。反反复复，读、阅、听印广法师的讲经。每一个专题都是讲如来藏，都能教我们当下了生死，开智慧。要非常非常珍惜这个妙法。</p></div><br /><div><p>103.在同修闲谈中提到九华山的肉身佛，在某次搬家中，原来搬不动的肉身佛，突然能搬动了，这种情况是什么原因？请师父在这里开示，以使大家破迷开悟。</p></div><p><br /></p><br /><div><p>答：现在讲肉身佛的传闻很多。这个与了生死、开智慧、成佛道，没有必然关系。至于肉身舍利是不是佛菩萨示现，我们不能肯定，也不能否定。没有哪一尊佛在灭度的时候，示现肉身不烂；即使肉身团不烂，即使飞到天上去了，像中国的道家老子、吕洞宾肉身都飞到天上去，都不过是个外道。对于那些不信佛的人，我们可以方便把它说为「佛菩萨」，接引众生，无可非议；但是把它作为一个盲目的信仰，这就是邪道。</p></div><div><p>肉身不烂有好几种原因：</p></div><div><p>有些人这一辈子不吃五谷杂粮，只是采日月之光华来维生，他就可以肉身不烂。把它作为方便引导，让人家来行善积德有一定的进步意义；但不能以此代表正法修行。我们的心是不可思议的，修外道的人都能站着走，坐着走，笑着走。可那个与成佛了生死没有关系，死得很痛苦的人不一定就没有成佛了生死。</p></div><br /><div><p>104.人有业障都要还，人死后要烧元宝，这些做法是否如法？</p></div><p><br /></p><br /><div><p>答：债是要还的，烧元宝，在鬼道里就是钱，这是真的。我有一个弟子姓马，她过去不信佛，全家谁都不信佛。有一天吃晚饭的时候，她母亲嗓音突然变很粗，大家都说很奇怪，说：「妈，怎么了？」她妈说：「我不是你妈，我是你爸。」一想爸爸已经过世一年多了，怎么借妈妈的嘴巴讲话啊？就问：「爸你怎么了？」「怎么了？我死的时候，你们也没给我买一双鞋呀？」我弟子说：「不是买了吗？」「买了，可是长太多，你们为什么糊弄我？」他们想起来了，以前从来不相信这些事。可能原来家里经济也比较困难，随便用一双鞋糊弄一下死人，可是能糊弄得了吗？然后当场给他用纸折成衣服，糊了楼房，还叠了元宝、寄了纸烧给他。然后她爸爸又说：「我要喝水！」喝了半杯水，走了。然后呢，妈妈睁开了眼，儿女问她：「刚才怎么了？」她妈妈说：「刚才迷糊了一会儿。」此事千真万确，但我们在烧化冥币的时候，尽可能缩小起火空间，可以减少杀生。</p></div><br /><div><p>105.念《地藏经》是否能消业障？</p></div><p><br /></p><br /><div><p>答：这个问题我昨天就说过了，念一句《法华经》胜过你念无量的经典，当然包括《地藏经》。看来这位菩萨对《地藏经》特别执着。《地藏经》念的不好，会引来鬼上身，为什么？《地藏经》里的那些护法神大部分都是鬼神。就像人道一样，有些人很和善慈悲，有些人很古怪呀。他（那些鬼神）看到你有一点不如法的地方，给你难堪，你也受不了。即使没有这样的现象，你也不如读一句《法华经》。《法华经》说的很清楚啊，你写一句《法华经》，来世就在天上。懂得了一句《法华经》，成佛了生死。这些功德利益难道不想分享给你过去世的亲人吗？</p></div><br /><div><p>106.有什么方法尽快明心见性？</p></div><p><br /></p><br /><div><p>答：短则几句话，长则几个小时几天，再长也不会超过一年半载。我曾经三句话就使一个人明心见性。</p></div><div><p>大概是前年，我们到三河灵山寺讲经，刚到就有居士请法，请我开示「无生法忍」。我伸出手掌问：「拳头变现为手掌，手掌生了没有？拳头灭了没有？」话音刚落，有一位居士闭目打坐，马上下座，跪下来磕头了，说：「师父啊，这个法……我从小随父母就学佛，这么多年没找到答案，你这三句话，我恍然大悟了。」</p></div><div><p>在末法时代，人心浮躁，我们萍水相逢，你总不能肯定这一辈子可能会跟这个人再见第二次面，即使有一面之缘，你都要发心把他度过来，知道吗？几句话就把他度过来，方法太多太多。</p></div><br /><div><p>107.每天很高兴来听法，但有时候很想睡觉。</p></div><p><br /></p><br /><div><p>答：睡觉的时候也能开大智慧，我们那个真人（方便说为真人，其实还是假人，是我执，是我们的灵魂）他没有睡觉。到了某个时空点，他会来告诉你这是什么法。当然尽可能不要睡觉，影响别人也不好。如果不睡觉，假人和真人一起懂，不是更高兴吗？但即使睡觉了你也没有白睡。</p></div><br /><div><p>108.有人说在家居士们要受菩萨戒，否则不能讲经，即使学习讲经也不如法，这种说法是否正确？</p></div><p><br /></p><br /><div><p>答：不正确。不管你是不是受戒，不管你是强盗土匪、牛马猪羊、妖魔鬼怪，都可以讲法，而且都可以讲《妙法莲华经》。这是佛在《妙法莲华经》里的教诲。现在各种概念、各种说法非常盛行；还有人讲女众、尼姑不能讲法，还有人讲半路出家的人不能讲法，种种奇谈怪论。</p></div><div><p>维摩诘是什么人？是不是居士啊？文殊菩萨带着佛的弟子们去求维摩诘居士传法。李炳南老居士、南怀瑾、元音老人、赵朴初不都是居士吗？所以不管你是谁，只要你讲的是正法，哪怕是妖魔鬼怪，只要传正法，诸佛都赞叹。佛当年还用自己的肉身生命供养魔鬼说法，如果你讲的是邪法，不了义之法，即使你有三十二相，你都要受果报，佛法里依法不依人。</p></div><br /><div><p>109.在家居士如果被请去讲经，可以去吗？是否要获取师父的批准？</p></div><p><br /></p><br /><div><p>答：具体情况，具体分析。</p></div><br /><div><p>110.在网上群里，女人辩法是否背负因果？难免有人轻蔑大法，是否要下地狱吗？是否还要继续与他辩论？</p></div><p><br /></p><br /><div><p>答：对法理法义的争辩，在佛法里是正常的，但是不要伤了和气，有理好讲。如果对受持《法华经》的人诽谤轻慢，是一定要受到果报的，这是佛讲的。现在是「斗诤坚固时代」，不斗诤，正法就会灭亡。</p></div><br /><div><p>111.阿罗汉为什么不能往生极乐世界？</p></div><p><br /></p><br /><div><p>答：首先，我们要懂得什么是极乐世界。天地万法都是一个人一个念所变现的，没有谁不是谁。阿罗汉自以为是阿罗汉，别人是凡夫，我是有情，泥巴瓦块是无情，他的真心不适应极乐世界的气氛，并没有谁不让他去。并不是说，阿罗汉没有念佛，所以阿弥陀佛不接引，不是这回事，是他自己的心量问题。</p></div><br /><div><p>112.弟子修学了大乘佛法以后，成就的佛是因地的佛还是果地的佛？今生还是当下就能成就果地的佛？</p></div><p><br /></p><br /><div><p>答：在大乘佛法里即因即果，在小乘佛法里先因后果。比如说我们现在明白了如来藏的道理，我们在因地就是佛，但不能腾云驾雾，不能千变万化，为什么呢？定业不可转。只有在将来肉身销毁，灵体解脱了，当下无量色身三昧现前，那个时候叫果地的佛。我们现在成因地的佛，死后变成果地的佛，某种意义上是不是即因即果啊？不是说成佛以后马上就能腾云驾雾，鬼都能腾云驾雾，那个与成佛没有关系。腾云驾雾没什么了不起啊，都是我们的本能。</p></div><br /><div><p>113.《法华经·提婆达多品第十二》说：「女身垢秽，非是法器，云何能得无上菩提？佛道悬旷，经无量劫，勤苦积行，且修诸度，然后乃成」。又云，「龙女答谢，把宝珠献给世尊，急速成等正觉，即往南方无垢世界」。人家龙女有佛珠可献佛陀，人身有啥宝物可献佛陀，可自证菩提呢？人有珠吗？</p></div><p><br /></p><br /><div><p>答：你把这段经文再好好读一读。舍利弗认为女身业重，不能成佛，不能当菩萨，这是用不了义法来对抗佛讲的了义法，本身就是个错误，是不是？龙女呢，用事实来说话。问到，我把宝珠摘下来送给佛，这个速度快不快呀？大家都知道，快！那继续说，我成佛比这个还快，你信不信？当下摇身一变，就成佛了。</p></div><div><p>这与有没有宝珠有没有关系啊？再把《法华经》读一读，不要在宝珠上做文章，不要把它说得神乎其神。一定要注意，是龙女明白了一心三藏的道理而成佛，并不是因为龙女贡献了宝珠才成佛！</p></div><br /><div><p>114.《法华经·五百弟子授记品第八》：「示众有三毒，又现邪见相，我弟子如是，方便度众生。」请问众生因迷未得慧眼，众生着相，见后起分别念，甚至造口业，种下三恶道的种子，弟子怜悯众生，但众生愚昧，我们在修行过程中，如何增长智慧，有慧眼鉴别，也就是说有正法眼？</p></div><p><br /></p><br /><div><p>答：自古以来讲「开悟的楞严，成佛的法华」，而且佛在《楞严经》《法华经》里反复讲，为什么我们就不花点时间来读《法华经》《楞严经》呢？你没有读懂这两部经典，你一开口就错了。</p></div><br /><div><p>115.人临终后，给他开示一下如来藏，可以往生吗？</p></div><p><br /></p><br /><div><p>答：一般问题不大。先给他点破——你现在终于知道了人没有生死吧？他生前根本不相信人死了还接着轮回，可是他现在明白了，还看到你们在哭。所以我经常讲，这叫死活人——死人变活人了，他知道确实没有生死；活死人——活人还没经历死亡，他看到别人停止呼吸了，就认为人死了。接下来开示，还不赶紧念阿弥陀佛，求佛来接引。首先用智慧打开他的心灵，以防他还有其它情执，再慢慢地讲《过五关度六将证菩提》，天地万法呀，都是一个人一个念变现的啊，明白吗？</p></div><br /><div><p>116.请问淫心不除，能带业往生吗？佛陀在《楞严经》上讲：「淫心不除，尘不可出」，如果法华在家弟子没有断淫，戒律不清净，即使了悟如来藏，能否脱离六道轮回？成分真即佛？</p></div><p><br /></p><br /><div><p>答：对于没有明心见性的人，淫心不除，他天大的本事都不能往生，不能了生死，而且要还债，为什么？一次男女生活会杀害七万八千个风虫。但是《楞严经》，它是「后后破前前」，把这个事情说得非常严重，然后来一个风云突变，石破天惊！你看《楞严经》倒数第二段，一个人犯四重十波罗夷大罪无恶不作，就剩一口气要下无间地狱了，但明白了如来藏，都能当下了生死、成佛道！何况你们呢？</p></div><div><p>淫心不除，能不能往生啊？一定能。但是，第一，品位不高；第二，来世还要还债。怎么还债呢？什么癌症啊，车祸呀等等，少不了的。一生还不了，多生多世来还，糖尿病、高血压……够你受的。一个癌细胞就是一个冤亲债主，但是他死了以后，仍然回到佛土，他的菩萨身来还债。放纵自己，为所欲为，终要付出沉重的代价。</p></div><div><p>而出家来讲呢，出家人可以受到环境的监督，会极大极大减少淫欲，即使偷偷摸摸的，也是极其有限。因为这个道理明白了，不管你是佛是菩萨，你需要还债。任何人都跑不掉的，要严格要求自己。五十岁以后，最好就把它断掉了，年轻夫妇也要克制。舍利弗还是外道修行的时候，夫妻俩是名义夫妻，结婚几年都是坐在床铺上打坐，从没有沾染过男女生活。</p></div><br /><div><p>117.弟子听师父讲经，心中就完全相信师父讲的，无任何疑问，即使在心里有疑问也是先反省自己，哪一点听错了，哪一点和佛性不符合，只有反省自己，希望改正。可是师父，都讲小迷小悟，大迷大悟，弟子提不出大的疑问，是不是弟子就很难开悟啊？</p></div><p><br /></p><br /><div><p>答：不是。「小迷小悟，大迷大悟」有两种情况：第一种情况，它属于心态正常，思维特别活跃的人；第二种是有逆反心理的人，讲「小迷小悟，大迷大悟」，是为了鼓励他们，赞叹他们的善根，只要他们回头，进步特别快。</p></div><br /><div><p>118.请开示有生法忍。</p></div><p><br /></p><br /><div><p>答：六道轮回，生生死死，是不是有生法忍？而无生法忍是小乘法证的人我空，以及《金刚经》的法我空。讲第一义，真心本来面目非无生非有生，而随缘现无生现有生。</p></div><br /><div><p>119.请开示人我执、法我执。</p></div><p><br /></p><br /><div><p>答：人我执呢，众生因为无明，而执着五蕴之肉团身为「我」。阿罗汉破除了人我执，证得了人我空，知道这肉团不是我。法我执呢，固执一切诸法，以为实有，把一切外在的事物都当真，不知一切事物都是随着客观条件的变化而变化。由于执著于「我」，便成烦恼障，招感六道流转的分段生死。由于执著于「法」，便成所知障，招感三界的变易生死。那么大乘菩萨，包括《金刚经》《华严经》讲，风云雨雾、泥巴瓦块都是我们一念心变现的，也就是真空变现的，就破除了法执，证得了法我空。</p></div><div><p>那么到了圆教呢，人我执是我，人我空也是我；法我执是我，法我空也是我。我们的真心既不是人我空，也不是人我执，他可以随缘变现人我空、人我执，随缘变现法我空、法我执。这四样没有哪个不是哪个。这叫圆顿大法。大法就是小法，小法就是大法，《地藏经》《华严经》《圆觉经》也是《楞严经》，泥巴经瓦块经、狗屁经都是《妙法莲华经》，就圆融了。那不圆融的法呢，就是执着我是《法华经》，你是《楞严经》，他是《阿弥陀经》，他是《地藏经》，这样讲法呢，是各执一端。</p></div><br /><div><p>120.为了让父母信佛，显示神通给父母看，这种想法对吗？</p></div><p><br /></p><br /><div><p>答：对待个别人是可以的，但现代有些人变得信鬼信神的，就很麻烦。示现神通让人升起一点好奇心来修行佛法，与了生死开智慧没有关系。佛出世都是讲经说法讲道理的，在极其个别的场合示现一下神通也是敲边鼓，把他引过来，「哎呀，佛是真的存在……」然后再给他讲道理，是不是？所以神通呢，是一种方便之法，与开智慧没有关系。</p></div><br /><div><p>121.我家先生不知从什么地方听说，有的寺庙的和尚有不规矩的行为，他就不允许我听经，跟他讲不明道不清，又不能跟他争……</p></div><p><br /></p><br /><div><p>答：如果这位先生很固执，就不要跟他顶着来，你可以在家上网，在网上看看讲经法师的视频。要慢慢引导他，不要道听途说。是有些出家人不规矩，但并不是都是这样，不要怀疑心太强。出家人是这样，在家人也是这样啊！哪里都有好的，哪里也都有坏的，不可以一概而论。中国历史上出了那么多高僧大德，不都是我们的榜样吗？</p></div><br /><div><p>122.二六时中不动念，做一切事情，包括男女之间正淫、邪淫不为过。做一切事不动念不为过，请问：佛弟子做这类事如法吗？</p></div><p><br /></p><br /><div><p>答：这「不动念」是一种方便说，是禅宗的一种说法，什么事都不想，连佛号也不准提，心不想，口不念，身不行。不动念，他是为了破除藏教的「执相昧性」。而圆顿大法是转识为智，历事练心转境界，时时动心起念，要变成智慧来教化众生。</p></div><div><p>那么说什么只要不动念，做一切事情包括一些男女之间的正淫、邪淫都不为过，这是一种外道修行法！即使在外道里也要经过严格考验，怎么考验啊？拿出一盆硫酸，你要有这个能力把硫酸吸到肚子里，并且男女二根不被烧烂，你可以搞男女双修，那是真正做到了不动念。即使你能做到都仍然是外道，何况还做不到！只作这种口头禅，你不是害人啊？</p></div><br /><div><p>123.我的老父亲现在九十多岁了，耳朵不好，也不学佛，我和他相隔千里，我在他乡用意念给他讲一心三藏，他能接受到吗？</p></div><p><br /></p><br /><div><p>答：他应该能够接受。这个第七识它是没有时间没有空间的隔阂的，他来世一定能够得到真实的利益，等于给他种下金刚种子。</p></div><br /><div><p>124.身边很多师兄诵《法华经》，但是发现根本不懂一心三藏，这些诵经的人是不是只是能得到人天福报，种了一个金刚种子而已，但是今生无法成就？</p></div><p><br /></p><br /><div><p>答：是的，一定要懂一心三藏。但是诵《法华经》的福报非常非常非常之大。阿弥陀佛！</p></div><br /><div><p>125.龙华三会是弥勒佛才开示的，有的居士现在正在规划龙华三会，这个如法吗？</p></div><p><br /></p><br /><div><p>答：我不知道他们怎样规划。我不能讲如法，也不能讲不如法。如果说我们为了迎接龙华三会，现在受持《法华经》《楞严经》，把如来藏普遍全国，普遍天下，迎接弥勒佛下世，这也是规划龙华三会呀！我们不允许在弥勒菩萨出世前五十六亿七千万年成为灭法，你把这灭法转为正法就非常如法，看你怎么规划法。</p></div><br /><div><p>126.为什么现在叫末法时期？有末法还有正法？这个年代是怎样划分的？</p></div><p><br /></p><br /><div><p>答：佛把从自己灭度以后到弥勒出世之前的时期分了正法、像法、末法、灭法四个阶段。佛灭之后的一千年叫正法时期，灵山法会俨然未散。再过一千年，修行人开始慢慢迷惑颠倒，外道开始混入佛法，是在像法时期——人们把讲经说法变成崇拜偶像，把雕刻佛像、建设寺院、烧香念佛当成一种正修行，这是迷信，似是而非。</p></div><div><p>接下来是一万年末法时期。《楞严经》第六卷讲，「末法时代，邪师说法，如恒河沙」。末法时期结束后，到弥勒菩萨当来下生，之间还有五十六亿七千万年，这期间叫做灭法时期。彼时，《大佛顶首楞严经》首当其冲被灭掉，因为这部经是讲真理的，包括佛讲的其它三藏十二部经都要灭亡。大家要知道佛讲的这个法是他的良苦用心，是激将法，从哪里可以看出来？我们现在还没有到灭法时代，那些邪师就来攻击《楞严经》，是不是啊？我们只要把《法华经》《楞严经》传下去，只要有一个人把一心三藏的道理讲清楚，这个世界就有正法住世！</p></div><br /><div><p>127.「想升情坠」的「想」是怎么理解？</p></div><p><br /></p><br /><div><p>答：「想升情坠」出自《楞严经》。一个人如果对名利地位、世俗利益看得很淡薄，像那些思想家、哲学家、文学家，比如老子、吕洞宾、王阳明，李白、杜甫，他有浪漫主义的想象，这么一想，心是不是就开朗了？即使不学佛，他一定带着飞扬的这种气势，自然往上升。如果一个人没有文学爱好，没有科学爱好，只知道吃喝玩乐，总是想着儿女情长、天伦之乐，有这个情执是不是感到心里很沉重啊？是不是往下坠啊？叫想升情坠。</p></div><div><p>前面讲的这个想，如果再明白了如来藏，是不是如虎添翼啊？他永远升华，生生世世升华。否则福报满了以后还要往下落。</p></div><br /><div><p>128.圆顿法讲的明心见性与六祖明心见性相同吗？</p></div><p><br /></p><br /><div><p>答：不同。六祖讲的见性——本来无一物，是见到空如来藏之性。但是六祖在后期，已经升华到一心三藏。而圆顿大法的见性，是见真真如性。禅宗把一切有形有相统统破除掉，而《心经》讲，「色不亦空，空不亦色」，你把色破掉的同时，是不是把空也破掉了？所以到了《楞严经》，把《金刚经》所谓的见性，也说成是妄。</p></div><div><p>言妄显诸真，妄真同二妄：「言妄显诸真」就是六祖讲的的破妄见真，后面的这句「妄真同二妄」，是说你见的那个真还是妄，为什么？圆顿大法认为手掌就是拳头，是不是？但禅宗非要把手掌破掉来看拳头，，把手掌砍掉还有没有拳头了？所以圆顿大法，在手掌就能见到拳头，在相就能见性。所以祖师大德还有一句话，把破妄见真说为「妄想原来本自真，除时更起一重尘」。</p></div><div><p>《金刚经》《华严经》讲的那个见真，叫真，或者叫如、真如，而《法华经》《楞严经》讲的这个真叫真真如，或者叫真真真、或者叫如如如、或者叫真如如，一定要三个。</p></div><br /><div><p>129.风雨雷电怎样区分地大、水大、火大、风大？</p></div><p><br /></p><br /><div><p>答：我们现在能够感受的地、水、火、风叫浮尘四大，那胜义四大呢，我没有办法讲清楚，可以打比方。比如说你脑子里想的那个西瓜，别人能不能看到啊？不能。别人看到的西瓜是浮尘，你想的西瓜叫胜义西瓜（胜义尘），但是现在高倍电子仪器能看到，知道你脑袋在想西瓜，开了天眼的人能看的到你脑袋看了西瓜。</p></div><br /><div><p>130.当国王修行功德大吗？还是现僧人相度化众生功德大？</p></div><p><br /></p><br /><div><p>答：不能一概而论。有时候现国王相度众生功德大，有时候现出家相或居士相功德大。</p></div><br /><div><p>131.给老板打工属于还债吗？</p></div><p><br /></p><br /><div><p>答：在某种意义上也可以这样讲，是还债。</p></div><br /><div><p>132.请开示众生本来就是佛，这个佛是分真佛吗？</p></div><p><br /></p><br /><div><p>答：不是。泥巴瓦块、天人鬼畜就是一念变出来的，他们本来就是佛，不仅是分真佛，而且是全体佛，全妄即真，没有谁不是谁。阿弥陀佛是你，那个假装迷惑颠倒的猪八戒佛、白骨精佛也是你，没有哪一样不是哪一样。</p></div><div><p>众生迷妄，故受轮回之苦。若能开悟，便可成佛了生死。</p></div><br /><div><p>133.肉团心、缘虑心、灵知心与六识、七识、八识来对照解释？</p></div><p><br /></p><br /><div><p>答：肉团心就是我们的心脏，缘虑心就是我们思想打妄想。灵知心，比如说我今天要吃饭，这是不是我的妄想啊?我今天要吃饭，我没有打妄想的时候，「我今天要吃饭」的这个念在不在啊？（在），虽然在，但有没有形相啊？这就是灵知心。</p></div><div><p>灵知心就是第七识，缘虑心就是第六识，也包括眼、耳、鼻、舌身这五识。这五识怎么来的？眼睛看到光，眼睛有了第一念的直觉刺激，叫眼识。如果感觉这个光怎么这么强啊，光的颜色是白色，这就成了第六识，大家明白了？</p></div><div><p>所以我们的灵知心第七识，佛在《楞严经》方便说为，注意啊，是方便说为真人，等我们到灵知心那里，你就知道了灵知心还不是真人，或者灵知心还有思维，灵知心由我们的空如来藏第九识显现出来，第九识和第七识合为第八识，叫真妄和合之心。</p></div><br /><div><p>134.为什么说别人造了口业，旁边听到的人也要跟着受果报呢？那像这样的问题我们要怎样解决呢？怎样做更圆满呢？</p></div><p><br /></p><br /><div><p>答：这是《楞严经》讲的六交报。灵知心是一个超级搬运工，凡事好坏不分，全部储存到阿赖耶识仓库里，储存进来就是你的业障。所以我们听到别人说坏话，你也要受报应，所以说坏话的人是不是双重报应啊？</p></div><div><p>看到别人做坏事你受报应，负面信息储存进来，将来在一定时空点它就出来造业——所以佛讲，看到别人做坏事，听到别人说坏话，做为菩萨呢，屁股一转就逃跑了，不要参与，也不要拉长耳朵：「什么事啊？告诉我，我保证不跟别人讲。」结果屁股一转你就跟别人讲，「你不要跟别人讲啊」。他叫别人不讲实际叫人家去讲。不要做「包打听」，大家明白吗？听到讲人我是非，你一句「阿弥陀佛」，这表示拒绝，同时也在度化他。</p></div><br /><div><p>135.请开示「厚德载物」。</p></div><p><br /></p><br /><div><p>答：「厚德载物」，如来藏是不是最大最厚的德啊？它包容一切万法。不管世间出世间法，你有多大的心量，就能成就多大的事业。如来藏不仅成就今生今世，不仅成就地球，还成就十方三世一切众生。</p></div><br /><div><p>136.对过年过节朋友送到家里面的活螃蟹、活虾怎么处理？怎样如理如法的做？都说从事养殖业的业障重，怎么劝他从事正业？</p></div><p><br /></p><br /><div><p>答：送来的活螃蟹、活虾很简单，如法放生。至于家人怎么劝，你没有智慧劝，就把《过五关度六将证菩提》推荐给他，慢慢引导。</p></div><br /><div><p>137.家里人障碍上香，受什么果报？家里人造口业怎么办？另外把家里的房子做法华道场，也受家里人反对，家里人受果报吗？受何种果报？有人发心长期供养师父纯植物健康食品，请师父接纳。</p></div><p><br /></p><br /><div><p>答：这样叫我不好讲话呀。我还想在这个世界上多活几年教化众生，是不是啊？你们应该明白这些道理呀！至于供养师父，我心领了，但是尽量不要破费这些钱财，我将来通过自己可以调心、调色来长寿。供养师父的钱财尽可能用来印讲记，让更多的人明白这个法，这是最好的供养。</p></div><br /><div><p>138.利用《法华经》搞名闻利养，或者骗财、骗色以及婚外堕胎受什么果报？我们指责这样的人有罪过吗？</p></div><p><br /></p><br /><div><p>答：利用《法华经》来搞名闻利养，骗财以及婚外堕胎，这种人必下无间地狱。指责这样的人你功德无量，你没有罪过，他是触犯了法律，破根本大戒。</p></div><br /><div><p>139.请开示「缘起性空」与一心三藏对应关系。</p></div><p><br /></p><br /><div><p>答：「缘起」就是不空如来藏，「性空」就是空如来藏。缘起当下就是性空，性空当下就是缘起，就是空不空如来藏，三个如来藏是一个东西，叫缘起性空。</p></div><br /><div><p>140.什么是实相无相？</p></div><p><br /></p><br /><div><p>答：实相无相，只是空如来藏。那么到圆顿大法讲「实相无相」呢，这实相不能局限哪一种相，所以讲，「实相无相无不相」这样就比较圆满，是真正的实相。</p></div><div><p>圆瑛大师讲：实相有三，即三如来藏：一、无相之实相：无一切妄法差别之相，祗有一真平等实相，即空如来藏，空诸一切，虚妄染法之相，并非本体而全无也，乃藏性不变之体。二、无不相之实相：并非无相，而能随缘现一切相，即不空如来藏，具足十界诸法，非无诸相也，乃藏性随缘之用。三、无相无不相之实相：若言其无，则不舍一法；若言其有，则不立一尘，即空不空如来藏，真空不碍妙有，妙有不碍真空，乃藏性体用双彰。</p></div><br /><div><p>141.请开示无生法忍。</p></div><p><br /></p><br /><div><p>答：阿罗汉的无生法忍是证到人我空，他不现肉团相，保持一个灵体。通教、别教菩萨的无生法忍是证到法我空，他知道自己跟天地万法都是一个空如来藏，叫无生法忍。当我们从空出有，知道空如来藏就是不空如来藏就是有生法忍，无生法忍跟有生法忍都是我们随缘变现。</p></div><br /><div><p>142.念佛修行好的人是否全身都有佛光？这个佛光和头顶上有光束有什么区别？</p></div><p><br /></p><br /><div><p>答：念佛修行好的人，言谈举止很有气质，你就本能地被他摄受，这就是佛光普照。有些人练气功，修外道，身上能发光，头顶上有红光，这是色身调整，与有没有道行没有关系。当年老子紫气东来，也是外道。有的人用心专门采日月精华，他的色身能够得到调整，你看到他红光满面，仔细看他还有蓝光，说明这个人在调整色身上下了功夫，他能得到健康、长寿，但这个与开智慧了生死毫无关系。</p></div><br /><div><p>143.有一种念佛法能让头顶出光束，不知师父是否听说过？</p></div><p><br /></p><br /><div><p>答：外道邪法确实能让不明道理的人念到腾云驾雾，但这些都是外道，你得明白什么是佛才是正修行。</p></div><br /><div><p>144.世间万法哪一法不是因果？只在于你能不能看得开而已。果真刻骨铭心地明理，在地狱里也像在极乐。其实万法就是那么一个东西，只是在于我们怎样正确看待问题，是这样吗？</p></div><p><br /></p><br /><div><p>答：是。地狱里一定有佛菩萨化身去加持地狱众生。没有明心见性的人在地狱里就是受苦，明心见性的人化身到地狱去，那里也是极乐世界。</p></div><br /><div><p>145.请问什么是念佛三昧？</p></div><p><br /></p><br /><div><p>答：真正念佛三昧就是首楞严大定，就是法华三昧，就是一心三藏！三表纠正，昧是表颠倒，把颠倒正过来，这是真正的念佛三昧。</p></div><div><p>在净土宗说念佛，阿弥陀佛，阿弥陀佛……一心不乱，真正能念到一心不乱，叫「事一心三昧」。但是这样的一心三昧是不能达到的，除非像势至这样的菩萨。我们讲的一心三藏叫「理一心三昧」，把道理搞明白，当下就是三昧。</p></div><br /><div><p>146.出家人与居士发生了冲突，出家人打人，请问和尚应不应该打人？</p></div><p><br /></p><br /><div><p>答：按照世间法来讲不应该骂人，不应该打人，但是看他为什么事骂，为什么事打，要看和尚的起心动念，不能一概而论。因为菩萨教化人既可以示现善相，还可以示现恶相。</p></div><br /><div><p>147.佛魔为什么不能相容？生活当中真的有魔，我们应该怎样处理？有人说佛魔是相容的，这样说对吗？</p></div><p><br /></p><br /><div><p>答：佛和魔，从究竟义来讲，天地万法都是一个人一个念变化的，但无分别不妨分别。我们可以认为，迷惑颠倒的众生就是魔，包括天道的、人道的、鬼道的。其实鬼和魔还怕人呢！</p></div><div><p>我们生活在各种法界里。有些人容易被鬼神附体，这与他过去世学的歪门邪道都有关系，他喜欢观照，就容易着魔。从分别法来讲，就是魔也能被度化；你传如来正法，他比你成就的还要快，他有他心通，你成就了他一样跟着成就。</p></div><br /><div><p>148.地震是灾难，地震是天意还是人为？</p></div><p><br /></p><br /><div><p>答：地震都是众生自己的业报。你讲天意也好，讲人为也好，都是我们自己的心，以下犯上不知天高地厚，这就是搞地震！你看现在比古时候地震更多，是不是？现在是上不上，下不下，爷爷当孙子，老子当儿子，人人搞贪嗔痴。再一个，现在杀生太厉害了，所以天怒人怨，导致地震啊。</p></div><br /><div><p>149.「万法皆空，因果不空」怎样解释？</p></div><p><br /></p><br /><div><p>答：成佛要修佛业，成人修人业，在八大次第已经解释了，作佛作菩萨都必有其因。</p></div><br /><div><p>150.有位师父让弟子诵莲池大师的《西方发愿文》，还有位师父让弟子诵其它经典，弟子觉得迷茫。</p></div><p><br /></p><br /><div><p>答：法华楞严一心三藏，看懂了以后，你诵什么都可以。</p></div><br /><div><p>151.既然睡觉的时候，我们的真人也能听法，那我们的父母没法现场听法在他们睡着后，给他放讲经视频，对他有用吗？</p></div><p><br /></p><br /><div><p>答：有用。</p></div><br /><div><p>152.听过《过五关度六将证菩提》却不信，这样的人也能了生死吗？</p></div><p><br /></p><br /><div><p>答：不能，他是带着逆反心里来听的。</p></div><br /><div><p>153.为什么有的人当生证神通？而有的人不能？怎样能证得神通呢？</p></div><p><br /></p><br /><div><p>答：有的人在过去世生生世世修神通，但神通与了生死毫无关系。反过来讲，你死了之后，如果是做鬼，马上就有五种神通，你学它干什么？</p></div><br /><div><p>154.南方有一居士往生，弟子去助念，念佛的过程中脑子就出现中品中生。请问师父，这位往生的居士是中品中生吗？</p></div><p><br /></p><br /><div><p>答：有可能。可能是护法的正神告诉他，也可能是邪神告诉他。就包括护法神，若不明心见性，也不知道什么是往生不往生，佛菩萨这个时候一般不会示现这些相。</p></div><br /><div><p>155.「情与无情，同圆种智」如何理解？有人讲小草大树不能成佛，对吗？</p></div><p><br /></p><br /><div><p>答：不对，小草大树、泥巴瓦块都能成佛，无情的树也能转变成有情，在《楞严经》有讲。</p></div><br /><div><p>156.没有定力的人如何变得很有定力呢？</p></div><p><br /></p><br /><div><p>答：叫他读《法华经》《楞严经》，看看《过五关度六将证菩提》，当下就自性本定，就有定力。</p></div><br /><div><p>157.学佛一段时间后，会开始会出现许多仙道护法，那么弟子学法的时候，会不会扰乱弟子呢？</p></div><p><br /></p><br /><div><p>答：这些仙道护法这是好事，他们也想求解脱，但是仙道和人道由于发心不一样，会给你身体带来一些不舒服。你自己权衡利弊，他们不会害你的。</p></div><br /><div><p>158.未成家的年轻人学过大法，以后是该成家还是一个人好呢？</p></div><p><br /></p><br /><div><p>答：不能一概而论。</p></div><br /><div><p>159.过去世中可能没修好财布施，今世工作事业都不顺利，请问师父该如何改进？</p></div><p><br /></p><br /><div><p>答：你现在尽力去布施，在佛前许愿：我把我挣到的百分之多少多少——或者百分之三十、五十、七十，供养正法道场！你看看发财不发财。</p></div><br /><div><p>160.按照我理解的「自性流露」，写了一段文字，请师父开示：一真一切真，真真是颗心，其心无所住，无来亦无去。</p></div><p><br /></p><br /><div><p>答：这个写的比较含糊，心性无所住，同时无所不住；无来亦无去，同时亦来亦去，即来即去才圆融。</p></div><br /><div><p>161.如何快速观照一心三藏？</p></div><p><br /></p><br /><div><p>答：耳闻、目睹、身受的万事万物都是我一个念变现的，一念回光返照。历事练心，随缘起念。</p></div><br /><div><p>162.无始当初那个灵体到底怎么理解？后来怎么变现成万法的呢？</p></div><p><br /></p><br /><div><p>答：无始当初那个灵体，法尔如是。凡夫心的总认为有个开始。真心没有开始，从来就是这样。比如说拳头是那个灵，怎么变现万法的？随意变现。也可以一下变成手掌，也可以一下变成那个锤子、剪子，也可以一下锤子、剪子、扫把、兔子耳朵。因为我们的心是万能的。这个法根本没有办法解释，不能用世间凡夫的心态来打破砂锅问到底，只有智慧才能够理解。</p></div><div><p>所以怎么样变现啊？可以一下突现山河大地、日月星辰、诸佛菩萨，巨变、多变，也可以慢慢进化变，中等变。一个人自己入定变化自己，从下面一层天往上升，或者定力减退后由上往下降，这个好玩得很呢！也可以像孙悟空那样，一根毫毛一吹，变无量的孙悟空。克隆技术可以把一滴血变成一只羊出来，你们知道我们的心法多么奇妙，这叫开智慧呀！</p></div><div><p>为什么我们现在不能变呢？其实我们现在也在变，你是不是在变夫妻儿女呀？是不是在变小别墅小轿车？是不是在变这个金耳环，金戒指？变工厂、变县长、变局长、变老板、变人民币……不也是神通吗？我们现在被名闻利养、被贪嗔痴缠住了，不能像天人一变几万丈，是不是啊？天上很美啊，因为烦恼轻。</p></div><br /><div><p>163.如果我出家是不负责任吗？离婚不要老婆孩子。</p></div><p><br /></p><br /><div><p>答：如果你这样做的话，也是不负责任，也是负责任。在世间法里来讲，你没有把这个家庭很好地圆满；从佛法里来讲，这是最大的负责任。我是对这个家庭生生世世负责任，当然这是指真心出家，因为我们还有生生世世的父母儿女、夫妻感情。</p></div><div><p>我世俗姓倪，出家以后曾经跟同事逗笑话：</p></div><div><p>老倪啊，我真佩服你，你真能看破放下呀，放下家庭不管。我说，我真惭愧，不能跟你比呀，你才能真正看破放下呀！我不过放下了今生今世的家庭、父母儿女；你呢，放下了生生世世的父母儿女的生生世世，你比我能放下。</p></div><div><p>如果一个人真正出家，他是对生生世世的父母负责，如果一个人对整个山河大地，包括对牛马猪羊都很慈悲，这个人必然对父母儿女慈悲。从来没有出家人是家里敲锣打鼓放鞭炮送到寺院的，大部分都是硬着头皮出家的，但是呢，我们要尽可能把家里理顺。</p></div><br /><div><p>164.对其他法师讲解的不究竟的佛法书籍，如何处理？</p></div><p><br /></p><br /><div><p>答：如果这些法师有他的信徒，你可以送出去，也不要浪费。或者以恭敬心，顶礼三拜，在干净的地方烧掉。</p></div><br /><div><p>165.宣化上人开示什么时间都可以念《楞严经》？说现在念就是早上，那么美国对应的时间是什么时间是呢？晚上。因此我想是供佛要不过午，或者过午，这两者是不是一样的道理呢？为什么念楞严咒？</p></div><p><br /></p><br /><div><p>答：供佛随时都可以，但要正确理解供佛。既然大家都能够皈依，我们不妨入乡随俗，就不要过午，避免别人造口业，是不是啊？佛需要你供吗？是培养我们的恭敬心。如果佛需要受你供养的话，你成了佛，他成了凡夫，佛需要我们供养吗？都是表法的。用苹果供佛是表什么？提醒我们做事情要圆满圆融圆通。用水供佛是表什么？平等心、清净心。烧香呢，提醒我们要把经读懂，要破烦恼习气，要开智慧。</p></div><br /><div><p>166.什么叫反闻闻自性，什么叫反闻？什么是自性？怎么做叫反闻呀？和一日三省吾身意思是一样吗？</p></div><p><br /></p><br /><div><p>答：我现在讲12345，大家是不是想，哦，12345，后面肯定是67890，这叫往外闻。怎么叫反闻呢？比如我在讲12345之前，12345在不在这里？在。一定在我的心里，如果心里不想12345，嘴里能不能讲出来？不能。在心里，它有没有什么任何形相啊？没有。有了任何形相，就已经变成了意识心，变成了法尘。虽然没有任何形相，它在不在？在，这就叫真心，叫自性。这是反闻闻自性。</p></div><div><p>我的这个自性没有任何形相，你的自性有没有任何形相啊?火的自性有没有形相？泥巴瓦块的自性有没有形相？既然都没有形相，性是不是就一个东西啊！性是无分别自性。由此可知，由无分别的自性而变现出无量的有分别之相，这叫反闻闻自性。可是凡夫心往外看、往外听，谁知道往里看吶？所以，我们的自性就叫「阿」，而自性现出来的法尘和声尘就叫「弥陀」。</p></div><div><p>与「一日三省吾身」不一样。他是往外攀缘，看自己今天做的事情哪些对，哪些不对。这并不能明心见性。但是呢，可以帮助你修身，而且能够做到这一点的人很少很少。可是如果是个明心见性的人，他不需要一日三省吾身了，起心动念皆是自性流露，无非正法。</p></div><br /><div><p>167.对于乘愿再来，各人有各人的想法，要是不想回来怎么办呢？不回来了，修成正果以后不来了行不行？</p></div><p><br /></p><br /><div><p>答：不回来在那儿睡觉呗！怕是三天你就住不下去了，极乐世界有什么好玩的？</p></div><div><p>在那儿修行不就行了吗？</p></div><div><p>答：在那儿能修行吗？</p></div><div><p>我在那里永远不来行吗？</p></div><div><p>答：行啊行啊，好吧！你就不要来，你永远不要来了。你永远做阿罗汉就行了。</p></div><div><p>我真不来，回来还受罪啊。</p></div><div><p>答：就你这样的心，你还能往生吗？</p></div><br /><div><p>168.有人对我讲想要登台，就必须有证道位的功夫，没有修证，讲得再好，也是瞎耽误功夫，往生不了。请师父开示，是这样的吗？</p></div><p><br /></p><br /><div><p>答：不一定，要看你都修什么法门呢。把《法华经》《楞严经》搞懂了，开悟了，即悟即证。悟道就是证道，见道就是证道。这样的人可以登台讲经。他就是讲得颠三倒四，只要把道理讲明白就是成功的。不懂《法华经》《楞严经》，你讲得天花乱坠，妙语连珠都是不究竟。圆顿大法，即悟即解即修即证。讲信解行证，是圆人前七种方便法，修人道、天道、罗汉道、辟支佛道、藏教菩萨道、通教菩萨道、别教菩萨道这七种方便法，必须要解行并重，悟后起修，要证；唯有圆顿大法，悟即是证。所以我走到哪里就鼓励大家讲课，锻炼我们的胆量。对于初登台来讲课的同修，要包容，要鼓励。</p></div><br /><div><p>169.我已发愿生生世世弘扬《妙法莲华经》，但当前的时机，大多数佛弟子认为必须经过无量劫的苦修苦证才能成就，请问师父：佛在讲《妙法莲华经》时，有五千四众弟子离开，末法时代传这个法会不会更难？</p></div><p><br /></p><br /><div><p>答：必须经过无量劫苦修苦证才能成就，这种说法由来已久。有些人认为现在的众生根机差，这是片面的。时代是发展的，人的智慧是越来越利的。</p></div><div><p>有些观点是消灭佛法。如果我们都认为一代不如一代，佛法只有走向灭亡。当年佛讲《法华经》，有五千人退席，印广法师讲的现在一场法会，最多也就几十个人退席，为什么？佛法与时并进，这些人多多少少在过去世中都是有修行的人。</p></div><div><p>今人讲法，应该比当年前人讲的更好（更加适合现代众生理解），后来人更要超越我们。这是肯定的！不能抬出死人来压活人。只承认过去有佛，过去有菩萨，现在没有了——这是众生本能的下劣心、嫉妒心。</p></div><br /><div><p>170.在家修行怎么做功德呀？不做功德也可以成佛？是吧？</p></div><p><br /></p><br /><div><p>答：学懂了《法华经》，就是最大的功德。但是，当我们知道了所有的人都是我们生生世世的父母儿女，你怎么能够在家里无动于衷？你真正懂得没有啊！比如，你有些钱财，你放在那里留着干什么？你也知道放着钱财给父母儿女贪嗔痴，他们要受果报，那你自己坏透了。为什么不用来助印经书、光盘，帮助建设道场？</p></div><br /><div><p>171.明心见性的心和性是什么关系？如果心和性是一个，为什么不说明心见心，还要说明心见性呢？</p></div><p><br /></p><br /><div><p>答：你讲得很对，心和性是一个东西，讲明心见性，明性见心，明心见心，明性见性都是一样的。但是，无分别不妨分别，一般呢，心是表本体，性是表妙用。</p></div><div><p>比如说：12345这个相在没有讲没有想之前，它在不在心里啊？在。虽然在，有没有形相啊？没有，虽然没有形相，可真实存在，所以心是本体，那么我这个心的本体怎么样变出相来了？就是性在起作用，懂不懂啊？所以我们在讲心的时候，如果只有一个心，要解释为心和性；如果只有一个性，也一样解释；有时心和性同时出现，心表体，性表用。明心见性，既懂得我们的本体叫明心，又懂得我们本体的妙用叫见性。</p></div><div><p>再打个比方：拳头变成手掌，当变成手掌的时候，我们只看到手掌之相，是不是啊？这个时候，眼睛没有看到的拳头，那就是体，那就是心。明白了吗？心为什么能看到拳头啊，这就是智慧妙用，这就是性。没有性能不能见到心啊？</p></div><br /><div><p>172.有位佛友会顶神算命，但不明白为什么他会算命。</p></div><p><br /></p><br /><div><p>答：算命也是一种启蒙法门，可以帮助我们相信有来世，相信有鬼神。但这个法门由于有少数人利用它来搞人我是非，诈骗钱财，所以造成两种极端：一种呢，把这类人一棒子打死，统统是歪魔邪道；一种呢，把他当作佛菩萨。算命顶神既有修正神，修菩萨道，也有修歪魔邪道，对这些人要正确评论，而且这些人来认真学佛法，他容易开悟。至于为什么会算命，一种就是在今生今世学会；第二种呢，他从前世带来的灵通。</p></div><br /><div><p>173.万法为一人一念之所变现，一念是否可以把它理解为生相无明，一念也就是无量念，是吗？也可以增加我们定力？</p></div><p><br /></p><br /><div><p>答：一念就是无量念，无量念归究到那一个念，这都是佛的方便说。生相无明自古以来几乎没有人解释，等觉位菩萨有老古佛来帮助破除生相无明。我打比方也是讲个大概，但是也别把它太当认真。</p></div><div><p>比如，有时候什么也没有想，谁也没有问，好端端的突然就想起了三年前的什么事，想起了半年前的什么事，什么也没有想的时候，那个叫作第九识，可以把它比喻为真心本来面目；你什么也没有想，突然冒出一个念，那就叫业相无明，它本来就有的；在未现之前，就叫生相无明。如果你什么也没有想，别人叫了你一下，或者你看到人家的妈妈，想起了自己的妈妈，这就不叫生相无明，叫枝末无明。</p></div><br /><div><p>174.《楞严经》讲，不将如来不了义之法，回为已解，以误初学。这是不是告诉我们修行人唯有了义之法才是我们最基础课程？</p></div><p><br /></p><br /><div><p>答：对，《楞严经》就是基础课程，其它任何法都不能代替。</p></div><br /><div><p>175.有时会不经意有一些恶的念头，甚至很下劣的念头迸发出来，这个时候就会想，怎么会有这样想法呢？赶紧忏悔，可已经在阿赖耶识里，这个将来会得果报吗？</p></div><p><br /></p><br /><div><p>答：开悟的人不会受果报，但凡夫逃不过的。同样是恶念，明心见性的人叫戒坏见不坏。这个恶业不能减少，更不能破除，但是我们心量可以扩大呀——我们本来这个心里只有老爸老妈，夫妻儿女；或者我这个心就是佛在天上，我在地下，心量就这么大。当我知道过去现在未来、东南西北上下十方，没有哪一法不是我——我的心是不是无量大了？能不能把恶业带走啊？能。</p></div><div><p>善恶其实都是一个东西，只在转念。</p></div><br /><div><p>176.佛陀临终遗嘱，修行人要四依法，依了义不依不了义，请师父开示，如何区别了义法与不了义法？</p></div><p><br /></p><br /><div><p>答：了义法在《法华经》《楞严经》讲的很清楚。《法华经·方便品第二》讲，「唯此一事实，余二则非真」，「十方佛土中，惟有一乘法，无二亦无三」。这几千年，乃至当今世界全地球，因为把正法、了义法忽略了，你现在讲正法，反而遭到别人用不了义法来混淆。</p></div><br /><div><p>177.什么情况能够识别自己是在依智？</p></div><p><br /></p><br /><div><p>答：依智，比如说：你出门自行车给人家偷掉了，这个时候开始诅咒，他不得好死啊……这就是依识，是不是？你认为这是我前世欠你的，就要还债啊，这都小智，明白吗？谁是谁啊？自行车也是我，贼也是我，都是我，我自己偷自己的东西，有什么好计较的？这就是依大智。</p></div><br /><div><p>178.师父常讲，持咒需三密相应才得受用，才能成就，有些信众持咒未三密相应，但也能够使心静下来，调身体，理疾病，这样他可以继续持咒吗？会不会走火入魔啊？</p></div><p><br /></p><br /><div><p>答：认真持咒也能调病，也能降魔。但是，持这些咒如果思想动机不纯，就是持楞严咒都会走火入魔，可要当心。</p></div><br /><div><p>179.《法华经》中，舍利弗讲：世尊何因何缘，殷勤称叹诸佛第一方便。请师父开示，为何把《法华经》说为第一方便？他与41年所讲之方便区别在哪里？</p></div><p><br /></p><br /><div><p>答：第一方便，指《法华经》是第一义法，是基础法，你不把这个法门学好，修其它什么法门都不能成就。其他法门是第二方便、第三方便、第四方便……是悟后进修的法门。</p></div><br /><div><p>180.有位法师在回答西方极乐世界是否存在时，回答说自性无，仍然有，这个回答究竟吗？</p></div><p><br /></p><br /><div><p>答：自性无就是仍然有，仍然有就是自性无。色不异空，空不异色，色即是空，空即是色。</p></div><br /><div><p>181.分真佛可不可以理解成从道理上明白了什么是佛，理即佛？</p></div><p><br /></p><br /><div><p>答：是。但是在智者大师的理即佛里还达不到这个境界。智者大师被称为东方的释迦牟尼，他没有读到《楞严经》，所以天台三大部还有一层窗户纸都没捅破。这是智者大师最大的遗憾。</p></div><br /><div><p>182.弟子出家好几年，找到明师，找不到合适的道场，又找不到合适的同修……</p></div><p><br /></p><br /><div><p>答：弘扬《法华经》的正法道场很多。哪里都是道场，为什么不合适呢？老佛爷当年在大树下面，在坟堆旁边，在山洞里，都是道场；跟妖魔鬼怪在一起都是道友。真修行人无时，无处不是道场。</p></div><div><p>修行人不管走到哪里，要适应道场，包容人事，而不是道场适应你，也不是别人来包容你，要把自己放到最低。</p></div><div><p>我也有几个这样的弟子，他眼里就没有一个好人，就他一人好。我说你想一想，你从小到大，你有没有尊重过任何人？你眼睛里有没有一个好人？包括你的父母、兄弟、姐妹，有没有一个好人？第二，你每到一处，有几个人喜欢你？你心里知道不知道？他不吭声。</p></div><div><p>为什么你找不到道场？因为你不喜欢道场，不喜欢别人，所以谁也不喜欢你。</p></div><br /><div><p>183.顶神却谎称菩萨附体，与人画符治病赚钱，以后会受怎样的果报？</p></div><p><br /></p><br /><div><p>答：凡是收钱，将来都会有果报。像癌症呐，车祸呐……别看发财发得高兴，到时候都要还的，跑不了。</p></div><br /><div><p>184.可同时依止多位师父吗？</p></div><p><br /></p><br /><div><p>答：不可以。依止师父，你必须要认定这个人有智慧，有法传给你，帮你了生死。拜师必须是拜明师。如果你已经开悟，你以拜师为名，来度化人，另当别论。你这样做功德无量，而不是盲目地搞情执。</p></div><br /><div><p>185.网络转播分布在全国各地，每台电脑上都显示出法会现场的盛况，每一台电脑就是一个道场，其作用与现场有多大的差异？</p></div><p><br /></p><br /><div><p>答:没多大差异，我们是依法不依人，不依相。</p></div><div><p>如果每台电脑前的菩萨发心护持道场，能产生怎样的效果呢？也就是指在网络上护持道场。</p></div><div><p>答：这与我传法的效果一样。不管是什么人，不管用什么方法方式，只要能恰如其分地把正法传出去，这个信息的能量是不可思议的。即使他当时听不懂，也已经在他阿赖耶识种下金刚种子。</p></div><br /><div><p>186.请您慈悲宣讲您修苦行的事情，以此唤醒弟子的虔诚、慈悲与柔软心，可以吗？弟子叩谢。</p></div><p><br /></p><br /><div><p>答:自从我传这个圆教正法以来，就有不少人误解，因为圆顿大法讲无修无证呐，所以有人就认为我不讲修行。其实，我是很讲修行的，而且，我是真正修苦行过来的人，首先要破我执。先开始捡烂菜皮回来吃。当时，捡烂菜皮比做小偷还难，心里都直抖呀！主食都是麦麸、豆腐渣。街道委员会主任还疑惑，后来听人讲，我一个老干部怎么还捡菜皮吃？不相信呐！当时我本来在安徽工作，后来直接回到老家江苏，照顾母亲。母亲走后，我更是这样，从来不锁门。客厅门不锁，小房门不锁，厨房门不锁。人来人住，狗来狗住，猫来猫住，所以到我家调查很简单，而且我常不在家。他们揭开我厨房一看，什么麦麸啊、豆腐渣呀之类的。后来街道书记打电话给我，让我赶快写报告吃基保。我有工资，怎么还吃基保呀？我不要！后来他们强行给我办了基保，还在人事局给我弄了个特贫补助，一般是给那些丧失劳动能力、患癌症、无儿无女的人。</p></div><div><p>遗憾的是，苦行留下了后遗症，这个指甲凹在这里，营养不足。我那时到晚上11点还在研究经典，冬天很冷很冷。本来就不吃晚饭啊，中午也是吃的豆腐渣什么的；有时候出去弘法，就带几个生红薯和咸菜啃一啃。我不吃人家饭，白吃白喝我不甘心。给人家钱，我算算也划不来！所以到了晚上，身体就饿得直抖。有一次在一家面馆前来回走了三趟，最后还是忍住没吃。当时一碗面也就块把钱，我省下来买了饼干、大米供养水陆众生，解决很多问题。后来当我明白身体的重要性时候，我就不修苦行了，吃三餐甚至吃四餐，还想吃点营养好的。</p></div><div><p>有一次，人家顺风往我脸上吐三下口水，我停下来，对他说:「您顺风吐口水可要当心啦！」他瞪眼睛训我:「那你怎么不注意啊？」我当下意识到，可能自己先有一口唾沫飞别人脸上了。我马上合掌，说:「我谢谢你的教诲。」诶，他感到很难为情。否则的话，两个人不是要打起来了？你别看我打人骂人、暴跳如雷，我也看什么人。一般好欺负的人，我使劲欺负他。如果我欺负不了他，那他是老子，我是儿子，我赶快投降。</p></div><div><p>暂且就吹到这里吧。你以为我不念佛呀？我一边给人家传法，一边讲故事的时候，我心里还在念阿弥陀佛，你们信不信？你们谁都没有我念佛精进。我走路去老房间洗澡，脱衣服的时候才知道，心里的佛号停止了，我这样念佛。你们以为怎么样？非得念给你们看才叫念呐？明心见性的人，更要勇猛精进，时时进行观照。你以为我反对念佛啊？我反对那些不懂什么是佛，却在那三心二意地念佛。一定要懂得什么是佛，你再念佛，越精进越好。</p></div><br /><div><p>187.师父常讲，念佛必须明白往生到哪里，在助念中也会遇到这样的问题。为逝者讲一心三藏的道理，要劝他到哪里去，是要往生到真心本性大光明藏吗？大光明藏是不是一心三藏呢？是不是可以观照为我们的灵魂不再执着我们的肉体和家亲眷属、冤亲债主，无限扩大和宇宙和虚空万法万相圆融为一体，直至扩大回到业相未生之前的状态呢？</p></div><p><br /></p><br /><div><p>答：开示大光明藏就是一心三藏。明白这个道理，再劝他求生极乐世界。</p></div><br /><div><p>188.一心三藏可否理解为物质与精神的统一体吗?比如说不空如来藏是物质，空如来藏是精神，就像我们讲一个灵体(灵性)与一个纯物质的东西合二为一，才构成一心三藏。是这样吗？</p></div><p><br /></p><br /><div><p>答：不是。我们所讲的精神也是不空如来藏。在不空如来藏里，精神与物质的关系应观照为作用与反作用，叫报身佛，是智慧妙用；空如来藏，它没有精神和物质可言，这是分别法讲。从究竟法来讲，它们就是一个东西。</p></div><br /><div><p>189.师父讲过，明白一心三藏以后，不管做什么都是修行，是否要时刻感知自己的真心，让自己的意识心与宇宙虚空万法万相或与当前做的事看的物合二为一呢？这样是否如法呢？是否保持在第一义谛吗？有时诵经持咒，特别是有些经咒有特别的含义和目的，是否需要回到第二义谛呢？</p></div><p><br /></p><br /><div><p>答：是的！如法！是第一义谛，心能转境。回到第二义谛也没问题，叫回向。回空向有，回有向空；回第一向第二，回第二向第一。可以成就我们的分别智，而且以此影响周围的环境和众生。</p></div><br /><div><p>190.弟子有时看到某个人或者某个人群时就会不自觉地流眼泪打喷嚏，或接到别人电话就头皮发紧或浑身无力或感到一身凉气。</p></div><p><br /></p><br /><div><p>答：这个就是众生浊。一个是慢我，无量劫来因「慢我」，而跟众生结下特殊因缘，在这个时空点，里面的灵魂习气相互之间的感应。第二个就是「见我」，今生今世与周边环境，由于各人能量级别不一样，在相当悬殊的时候，它会有个磨合期，一开始也有感应。你从历史的我、现在的我、乃至未来的我，这三个角度来看，他们在相接触时，也会有磨合的过程，不要大惊小怪，没什么大事！</p></div><br /><div><p>191.有出家师父带领居士超度冤亲债主，是否如法？超度众生是否得度？</p></div><p><br /></p><br /><div><p>答：得度不得度，如法不如法，在于主法人的道行和发心。道行高的人很如法，就是能超度。明心见性的人，你跟鬼道的亡灵见个面——不管你是出家还是在家，因为你的心是亮的，同时鬼道众生又有他心通——很容易把他度走。</p></div><br /><div><p>192.信愿行证是否一定要证到才是自己的法？否则不是自己的法，不能成就，是吗？证道一定要在禅定中得到吗？</p></div><p><br /></p><br /><div><p>答：信、愿、行、证，是从小乘法角度而言。大乘法不一样，明白这个道理了，即信即行即证，（发明便解脱，当下就是证！）在大乘法里还有了义大法和不了义大法。修不了义大乘法，必须信、愿、行、证；而了义大乘法中，信即是愿，即是行，即是证。现在许多人往往把权教大法与实教大法混为一谈，强调解行并重。而《法华》《楞严》圆教了义大乘，无修无证，即信即愿即行即证！明白了就是证！</p></div><div><p>证道，一定要在禅定中得道吗？是的。但禅定有两种禅定，一种禅定叫性定，自性本定，这种定不需要打坐，明白道理当下就是证，这是最高级的禅定。这种定包括打人骂人，呵佛骂祖、焚经毁像都是禅定，只看你懂不懂！现在我们执着的一种禅定，就是两条腿盘在那里观照，这叫境定，被一些祖师讽刺为坐鬼窟窿，修臭骨头！窥基大师前世在雪山里坐了几千几万几亿年，不吃不喝不睡，谁也不知道他坐了多少年，都不能成就。</p></div><div><p>你现在能坐几天、几个月有什么了不起呀？！这个对修行人误导太深。乃至禅定开了天眼天耳，那也是凡夫天人境界。凡夫禅定六关，你第一关还没破，那是动关。把天眼天耳都闭上了，才进入第二关，叫静关！静关什么也没有，修得不好的还自杀呢！然后才是根关、觉关、空关、灭关（也叫六结：动结、静结、根结、觉结、空结、灭结），全部通过你才能明心见性——但也只是禅宗的见一份空性而已。不要自以为有什么修行！即使到了阿罗汉的那种禅定也是凡夫，这是释迦牟尼在《大般涅槃经·如来性品第四之三》讲，阿罗汉的天眼也是肉眼，唯有受持大乘经典的修行人，肉眼即是佛眼。</p></div><br /><div><p>193.佛土菩萨是什么样的？也有五脏六腑吗，也睡觉吗？</p></div><p><br /></p><br /><div><p>答:等我回到佛土以后，回来再给你们讲哈！我下次来的时候争取带着宿命通来。听说，在现量佛土，菩萨成就了色身三昧，他需要身体的时候就随意变现，不需要的时候就是一朵妙莲华在那里，或者其它形式的化身都可以。若是到我们这里来，也是穿中装或西服。</p></div><div><p>就凡夫天人而言，欲界天人还有眼耳鼻舌，还有男女欲望，但是比地球上的人高级多了。第一层天的天人还过夫妻生活，但是他没有脏东西出来，只有一股风，跟地球人一样，两个人抱在一起睡觉。第二层天人拥抱一下就可以怀孕。第三层天人手拉一下就能生育，所以在第三层天搞计划生育可要小心，不要轻易拉手！到第四层天两个人笑一笑，小孩就生出来了。第五层天的人两眼相互对视几秒，小孩就生下来了。第六天眼睛瞟一下，就多了一个户口。这说明，越往上人的生命层次越高越文明，而且他们夫妻生活的质量也非常高。</p></div><div><p>我经常跟一些修行人开玩笑，他说：「师父呀，我什么都能放下，就是夫妻生活放不下。」我说：「你这个人真没出息，天上一个人有好几万个老婆。人世间几十年咬咬牙就过去了，到了天上可以有几千年、几万年、几亿年的寿命。你怎么想不开呀！」当然这是讲笑话。为什么？天外还有天呐！到了第七层天以上的禅天，禅定生活比夫妻生活快乐一万倍，谁还要老婆呀？谁都愿意打光棍！有色界的天人身体都是琉璃，五脏六腑是个摆设。四空天的天人没有肉身了，他更加自在。到了佛土的话，就无法形容那种自在、快乐。</p></div><br /><div><p>194.修法华的弟子可以求人天福报财富吗？为了更好的弘法利生也需要世间财富。得到的是命中有的，还是随着你的发心一切福报都在变化？</p></div><p><br /></p><br /><div><p>答：可以。求得的福报有些是前世定下的也不一定知道，有些呢，就是你今生发大心，变数可以改变定数，可以增加财富，增加寿命啊。没有人天福报，在家居士怎么生活？如果说发心求得来的财富，拿出一部分来建设正法道场，功德更大，那么这个福报有可能是前世就定下来的，也有可能通过发心，变数可以改变定数。比如说你前世修了一百万的财富，今世由于你发了菩提心，就可以变成两百万、一千万啊，要发大心。</p></div><br /><div><p>195.在念阿弥陀佛的时候，就观照阿就是空如来藏，弥陀就是不空如来藏，佛就是我。如在不念阿弥陀佛的时候，就观照虚空法界是我一人一个念变现的，就是我一个人，这跟念佛一样吗？还是需要念佛呢？</p></div><p><br /></p><br /><div><p>答：这是最好的念佛，始终知道万法都是我，提起观照。在佛法里，叫养悟——即量变引起质变，培养自己的悟性，提升定力。明白一心三藏，你永远不落六道轮回。你经常提起观照，可以从住位、行位、回向位、地位等级提起观照，提升定力！</p></div><br /><div><p>196.在日常生活中可能会对家人的一些毛病习气视而不见，家人生烦恼怎么办？</p></div><p><br /></p><br /><div><p>答：生烦恼啊？是不是讲提起观照的时候，人家从你面前走了，你都没有觉察到，是不是？如果人家生烦恼，你可以跟他解释一下，我们修行人往往提起观照，不觉得你走了，我不是有意的。人家真正生烦恼，我们也没办法，权衡利弊。是不是？修行不要浮躁。修大法的人一定要圆融随和，入世修行，谈笑风生。这难道影响你的观照吗？视而不见的人，一般是修枯定——见山不是山，见水不是水；而且从他面前走，他也不知道是谁。这种修行很容易走火入魔，给外魔钻空子。尽量不要这样修！</p></div><br /><div><p>197.有位居士身体有病，很虚弱，请师父开示能不能用三净肉暂时调理身体，身体好了就立即停止呢？</p></div><p><br /></p><br /><div><p>答：不可以，我们不能用众生的命来救自己的命。若要调养身体，方法很多。真正的修行人只能用自己的命来救众生。这位居士的做法是不可以的，而且也不科学，反而补坏了！现在，肉的毒素很多，就算没有毒素，肉类的蛋白质含量也比不上豆类。</p></div><br /><div><p>198.如果在路上遇到钱，我们能不能捡，如果捡了算不算贪财呢？</p></div><p><br /></p><br /><div><p>答：你如果捡起来供养三宝、供养乞讨者、供养灾区，你捡得越多越好！是不是？你如果想捡起来去给自己买点好吃好喝的，那就不要捡。不在捡不捡，在于你捡了干什么！</p></div><br /><div><p>199.请问财色名食睡没有断尽，可否往生？</p></div><p><br /></p><br /><div><p>答：二者没有必然关系，只在于明理不明理。若能断尽烦恼，往生的品位就比较高。</p></div><br /><div><p>200.静坐的时候可否念六字大明咒？</p></div><p><br /></p><br /><div><p>答：可以，静坐帮助调理身体和提高定力。不是说通过静坐来成就不可思议的事情。所以你只要放松，念阿弥陀佛，念大明咒都行，什么也不念也行。</p></div><br /><div><p>201.时时提起观照是要我们观照什么，怎么观照？</p></div><p><br /></p><br /><div><p>答：走路的时候，想想走路的是谁？是我还是你？头上的天大还是我大？什么东西都是我自己，这就是观照！不观而观，不照而照，一念闪过，知道就行。</p></div><br /><div><p>202.有人说看破了就是放不下，请问为什么看破比放下容易？</p></div><p><br /></p><br /><div><p>答：看破说容易就是很容易，一念就看破，世界观的转变是根本的转变。世界观不转变的话，你无量劫都看不破。放下属于习气、属惯性。打个比方，开汽车的人看见前面有危险，可以立即刹车，但是车子仍然要向前滑行。是不是看破很容易，放下很难啊？！他虽然放下难，但不会翻车，不会再堕六道轮回。</p></div><br /><div><p>203.老年人听经有些听不懂，是继续听经好还是念佛好？</p></div><p><br /></p><br /><div><p>答：听不懂，是你六根不懂。里面的真人能听懂。不管如何，我们都要听经。至于念佛，你在听懂以后，要勇猛精进念佛，念得越多越好！</p></div><br /><div><p>204.如何祭祖更如法？</p></div><p><br /></p><br /><div><p>答：明白如来藏道理以后，第一，把这个功德回向给祖先，使他们超生上界。第二，观照一下，过世的祖先都跟我去学法。这是最好的祭祀祖先！第三，在父母生日或已故父母祭日，唱诵一百零八遍报父母恩咒。第四，在正法道场给他们做些功德，供养三宝，并把此功德回向给祖先，这也是祭祖。</p></div><br /><div><p>205.明白如来藏道理以后，遇到一些事情以后，还是控不住要发脾气，请师父开示如何处理这种脾气？</p></div><p><br /></p><br /><div><p>答：脾气照发，发了也没事！明白如来藏道理以后，坏脾气会慢慢地减少。过一年半载，你会发现，想发脾气都发不起来了。这事潜移默化，把你脾气改了你还不知道！</p></div><br /><div><p>206.为什么有些寺庙不允许照相？在我看来，照相也是众生了解佛的一种方式。</p></div><p><br /></p><br /><div><p>答：小乘法认为，对佛像拍照有失恭敬，我们要入乡随俗。</p></div><br /><div><p>207.家里祖上就有一个顶神的，他们可不可以成佛？</p></div><p><br /></p><br /><div><p>答：明白了如来藏道理，不管是顶神、顶鬼、顶妖还是顶仙，都能成佛。</p></div><br /><div><p>208.看到路上的流浪狗流浪猫还有快死的动物，捡回去养也不实际，有什么好的解决办法吗？</p></div><p><br /></p><br /><div><p>答：尽量捡回去养！或者不能养的话，你就劝能抚养的人养！或者最起码给他们点吃的。</p></div><br /><div><p>209.我们经常梦见在天上飞、烧香拜佛、还会梦到金色阿弥陀佛以及有好多人在听师父讲经，请师父开示，梦和人的生活有什么关系？</p></div><p><br /></p><br /><div><p>答：梦中情况很多，不能一概而论。有些是过去世的事情在梦中再现，有些是未来事在梦中呈现，有些是佛菩萨在梦中加持，有些是亲朋好友在梦中攀缘，有些是冤亲债主在梦干扰你。有些是你听经闻法没懂的问题在梦中突然明白，因为梦中心比较清净；有些是因为你学佛有功德，在梦中重罪轻报；有些是你修行出现漏洞，总做坏事，在梦中警告你。情况比较复杂，不能一概而论。对于那些刻骨铭心不能忘记的梦，要注意分析，根据自己的修行研究。周公解梦，那种办法有些片面。</p></div><br /><div><p>210.如何对待婚外情？按因果分析，有因就有果，有些事情必须要经历。是不是我们精进修行，有些事就可以改变呢？这符合因果吗？</p></div><p><br /></p><br /><div><p>答：婚外情一定要克服，否则受报应！凡是婚外情，既有前世之因，也有今世之缘，但不能以此作为借口！今生今世的作为，会造成来世的果报！</p></div><br /><div><p>211.没学佛的朋友家里有人过世了，已经火化，还在头七，我该怎么帮助和度化朋友呢？</p></div><p><br /></p><br /><div><p>答：你可以在他的牌位前面啊，给他讲如来藏的道理，特别是讲过五关度六将，如果你不能讲的话呢，就开印广法师的光碟，跟他讲来一起听经闻法，他们都能得到好处。</p></div><br /><div><p>212.有人一遇大法就欢喜，有人还是不信，各人根机还是有不同，这样说对吗？</p></div><p><br /></p><br /><div><p>答：我们不要这样说。所有人共一个根机，就是一个念变现的，就是一个如来藏。《金刚经》云，是法平等，无有高下。它就是指这个根机，众生本具一个根机。只是由于他生生世世周边的环境不一样，造成了今生今世的狂妄自大和固执，或者是今生今世的环境很好，造成了他非常平和为人慈悲，所以缘分非常重要。你多花点时间劝导他，一样可以回心转意。所谓的根机呢，都是方便说，只能作为参考。那些过去世什么修行都没有的，就像《楞严经》所讲的，十恶不赦的坏人，他哪有什么修行呀？在特殊环境之下，他还可以一念明白如来藏大法，当下解脱。</p></div><br /><div><p>213.我母亲80岁得了脑血栓，有时候不会动不会说，头脑看上去很清醒，但有时候不清醒，好像有众生在她身上。针对这种情况，我们应该怎么办？</p></div><p><br /></p><br /><div><p>答：让她念阿弥陀佛，并把《过五关度六将证菩提》的光碟给她看。她不愿意听的话，就等她睡觉的时候放给她听。</p></div><br /><div><p>214.我有一朋友，家里供养观音菩萨。他还挺虔诚，初一十五还上香。前天，我喊他来听经闻法。可他很不高兴，说对这种事情不感兴趣。我感到很好笑，就说他，你不感兴趣还供菩萨。像他这种情况很明显是供菩萨求财。请问师父，菩萨会满足他们要求给他们钱财吗？</p></div><p><br /></p><br /><div><p>答：看具体情况，有的供佛发财，其实并不是因为供养佛像才发财，而是他前世修来的。求佛菩萨给钱，他才不会给你钱的。他们不会培养你的贪心。钱财是从布施得。</p></div><br /><div><p>215.有人说寺庙多到没人住，可《地藏经》上说，若未来世，有诸国王至婆罗门等，与先佛塔寺，或至经像，毁坏破落，乃能发心修补......更能与塔庙前发回向心，如实国王乃及诸人，尽成佛道，以此果报无量无边。</p></div><p><br /></p><br /><div><p>答：供养修庙、修佛像，我们发的是好心，能得人天福报！但是不能了生死。</p></div><br /><div><p>216.悟后起修是在闹市修行好还是在清净处好呢？</p></div><p><br /></p><br /><div><p>答：悟后起修没有时间空间的限制，只看你自己的习惯！</p></div><br /><div><p>217.密宗法门是否适合汉人修行？</p></div><p><br /></p><br /><div><p>答：不能一概而论。当然这是讲修真正的密宗。你们自己得量力而行。但是无量法门，必须以《楞严经》为指导，必须明白如来藏，明心见性。不明心见性，修什么都不能成就。而且，真正修密宗的人，修得非常艰苦。我很佩服这种人，值得学习。</p></div><br /><div><p>218.弟子在医院遇到一个生病严重的患者，当时就发心念佛加倍回向他，念佛时感觉到像光又像电的感受，不知道这感应是好还是坏？</p></div><p><br /></p><br /><div><p>答：这是好事，说明你发的慈悲心。</p></div><br /><div><p>219.我昨晚梦见我为己故的父亲、母亲讲一心三藏，请教我父母是否受益？</p></div><p><br /></p><br /><div><p>答：受益，受大益。</p></div><br /><div><p>220.常讲某人是佛菩萨再来，他本人知道自己的身份吗？</p></div><p><br /></p><br /><div><p>答：有时讲某人是佛菩萨再来，他自己也不知道。有些有宿命通、天眼通的人知道，因为许多佛菩萨是带着隔阴之迷来的。但他一定会从自性流露出慈悲、智慧、坚定等各种各样的一般人不具备的优良品德。但是当这种人读了《法华经》《楞严经》，再对照自己从小到大的种种行为，他就会知道自己是佛菩萨再来。所以《法华经》《楞严经》是菩萨发心的经。</p></div><br /><div><p>221.既然万法都是一个人一个念变现的，那在这个念前面是什么呢？</p></div><p><br /></p><br /><div><p>答：这个念没有前面，也没有后面。万法当下一念，我们的真心来面目非一念非万法，而是随缘现一念现万法，他无始无终。</p></div><br /><div><p>222.《法华经》《楞严经》是否一定要背熟呢？</p></div><p><br /></p><br /><div><p>答：不一定。无论是否背诵，你只要真正懂得其中一个字一句话就有用。</p></div><br /><div><p>223.弟子刚入佛门，在家诵《普门品》《阿弥陀经》《琉璃光如来功德经》、大悲咒，如果弟子还想诵《法华经》，应该如何安排这些呢？如果加诵《法华经》的话，时间可能不够了？如果前面那些经都不诵，只读《法华经》，佛菩萨会不会很生气呢？</p></div><p><br /></p><br /><div><p>答：佛菩萨高兴都来不及，怎么会生气呢？！读一遍《法华经》就等于读无量的经典；《法华经》讲的很清楚，一念信解如来藏，胜过修无量法门功德无量百千万亿倍。</p></div><br /><div><p>224.供酥油灯会伤害众生吗？供电灯呢？</p></div><p><br /></p><br /><div><p>答：供油灯、电灯都会伤害众生，因为有火。因此，我们要把不必要的杀生控制在最低限度，只要有火就会杀生。特别是逢年过节，不要放鞭炮，它会搞得无量的众生血肉模糊啊！佛前供灯只是一种形式，大家不要执着。</p></div><br /><div><p>225.吃素食是为了慈悲，那我们可否吃葱姜蒜、香菜等呢？</p></div><p><br /></p><br /><div><p>答：这些东西生吃会增加嗔恚心，熟吃会增加淫欲，也容易引起鬼魔附体。二者吃了嘴会很臭，邪鬼邪神会来舔你的嘴巴，护法的天人天神等众因鼻根特别灵，就会躲避，而不来护法了。所以，这些东西尽量不吃。</p></div><br /><div><p>226.请师父开示自杀问题。</p></div><p><br /></p><br /><div><p>答：已经自杀的人我们也没办法，他已经下地狱，除非很殊胜很殊胜的因缘才能救出来。如果家里有自杀的人，就如法供养三宝，并把功德回向给他们。这样可以改善他们在地狱里的痛苦。为什么自杀会下地狱？因为我们的身体里不是你一个人，它有无量的众生。自杀也杀害了无量的众生。我们在这里，将这次法会的功德回向给因经济危机导致的自杀或者其它种种原因导致自杀的人，愿他们早日超生。阿弥陀佛。</p></div><br /><div><p>227.假若造罪过山嶽，不需妙法两三行，请回答。</p></div><p><br /></p><br /><div><p>答：假使造了很多罪，比山都高，不需要《法华经》两三行，只需要《法华经》一句话，你把它搞懂了，所有的罪过当下消灭。就是这个意思。</p></div><br /><div><p>228.怎样悟后进修？</p></div><p><br /></p><br /><div><p>答：先讲自利，反复多看讲记，越看就越懂，在日常生活中历事练心，吃饭穿衣，吃的是谁？谁吃谁？谁穿谁？走在路上，谁走谁？是我走路还是路走我？你跟路是什么关系？提起观照。养成习惯以后你不要观照，随时都在观照之中。</p></div><div><p>比如说，你知道了你是妈妈生的，你需要不需要随时观照——我是妈妈生的？那就叫楞严大定，戒定慧是一体，即戒即定即慧。然后在跟妈妈处理问题的时候，妈妈说：「儿子，老妈没有钱了，拿100块钱过来。」你需不需要想：「哎，这个老太婆，她把我生下来，这100块要不要给她？」要不要想啊？自然想都不要想，钱拿出来——老妈，给你！这就叫自性流露，明白了吗？这种修行，自在不自在啊？这就叫全性起修，叫如幻三摩提；如幻，谁也看不到修，但是成佛了。这叫无修无证，都是自性流露。</p></div><div><p>怎么利他呢？把这个法越快、越多、越好地传给更多人。懂得了一心三藏，利他到最后是利谁啊？还是利自己。</p></div><br /><div><p>229.为什么说当下一刻即是永恒？</p></div><p><br /></p><br /><div><p>答：唐朝人来了没有？（众答：来了）。秦朝人来了没有？（众答：来了）。未来百千万亿年的人在不在这里？（众答：在）。这当下是不是永恒呐？既是永恒，又不是永恒，是不是？当下就是当下，但当下又是永恒，这是帮助我们开智慧。人老心不老，是不是永恒呐？（众答：是）。</p></div><br /><div><p>230.好多出家师父说，男女二部僧众不能在一起听经闻法？</p></div><p><br /></p><br /><div><p>答：第一，按照小乘法，你们四众弟子就不能在一起听课，有严格规定。男众对女众传法，超过第五句话，你就是破戒。男人跟女人说话，要相隔100步。</p></div><div><p>第二，按照大乘法，《法华经》《楞严经》里，是不是四众弟子在一起欢欢喜喜呀？摩诃迦叶夫妻二人一起在佛前请法，释迦牟尼佛跟他的老婆，跟他的姨母是不是都在一起开法会？</p></div><div><p>所以，既不要用大乘法来讽刺小乘法，也不要用小乘法来误解大乘法，要圆融！</p></div><br /><div><p>231.有人说，白衣不能登台讲法，如果白衣讲法，佛法会走向灭亡。</p></div><p><br /></p><br /><div><p>答：我问一问大家，李炳南老居士是不是白衣啊？再想想，维摩诘是白衣还是黑衣？维摩诘居士讲法，还教化佛的弟子，像弥勒菩萨、阿难、舍利弗，都曾受他教化。</p></div><div><p>佛确实曾有这样的说法：出家人不说法，白衣登台说法，佛法要早灭亡五百年。言下之意，在家人讲经说法，就是因为你出家人不登台讲经说法啊！所以这个罪过是因为出家人不讲经说法，而不是因为白衣登台讲经说法！如果出家人不讲经说法，白衣也不讲经说法，佛法当下灭亡！</p></div><div><p>所以同样一句话，智慧不一样，用心不一样，讲的就不一样，你们转过来没有？佛既是批评出家人，又是赞叹在家人，是不是？</p></div><br /><div><p>232.我们想在本地弘扬法华，不知如何做更圆满、圆融？</p></div><p><br /></p><br /><div><p>答：这个方法很多，最根本的你自己要懂得，然后通过自己的嘴巴，首先把自己的亲朋好友劝起来，这个方法太好了。第二种呢，可以把讲记、光碟呐、书本呀，有组织、有计划、有步骤地在各大道场来散发。第三，通过网上积极地吸收新的朋友，要开更多的群，把这个法弘下去。第四呢，在各地尽可能组织大、小法会，我可以派老师去讲课，机缘成熟呢，我还会亲自去。</p></div><div><p>因为这个如来藏大法呀，是救国家、救民族、救世界、救地球的无上法宝啊！现在地球上那么多原子弹，足以把几十个地球毁灭！如果美国人、日本人都懂得如来藏的道理，都懂得我们过去世互为父母儿女，都懂得所有的人都是一个人，你说他们能做坏事吗？所以面对现代物质文明高度发展，也给我们带来了危险，现在要刻不容缓，像抗日救国一样，把这个大法尽快向全国来传遍，希望大家都发心，功德无量！修行人不是为了自己能成佛成菩萨，是为了我们生生世世的父母啊、至亲骨肉、所有的众生都要成佛成菩萨，让他们先成就，一定要有这样的胸怀！</p></div><br /><div><p>233.万法唯心造，说明了一心二法的密切关系。这句话对不对呢？再请师父开示：学佛人应如何时时事事处处降伏其心？如何用好这个心？如何达到「外不着相，内不动心」的境界？</p></div><p><br /></p><br /><div><p>答：早晚功课本里说：「若人欲了知，三世一切佛，应观法界性，一切唯心造」，这是《华严经》的境界。按照圆教的境界，叫一切唯心现。「现」和「造」不一样。比如说，这个茶杯是孙悟空造的，叫有二法门；这个茶杯是孙悟空变的，这叫不二法门。</p></div><div><p>至于修行人怎么修，什么「外不着相，内不动心」，搞得那么紧张啊？要「不动」干什么？不动就变成冷水泡石头了。修行是非常轻松的，没有那么复杂，《阿弥陀经》怎么讲的？饭食经行。吃饭穿衣都是修行，就看你懂不懂。</p></div><div><p>是你穿衣服还是衣服穿你？衣服怎么来的？你怎么来的？你跟衣服是什么关系？就跟儿子是妈妈生的一样，我讲妈妈还是儿子生的，信不信？是谁生谁啊？没有谁生谁，都是自己一个东西变出来的。在圆顿大法叫无功用道，自性流露啊！</p></div><br /><div><p>234.《妙法莲华经》是诸经之王，是成佛之道，百千万劫难遭遇，我们能遇能闻是缘分和福分，但要深入广泛弘扬难度不小。因为末法众生其性刚强，难调难伏，疑心重，无耐心，且不少人无知且无畏，一开口、一起心动念马上堕落，要做到两全其美，弘法和护法都要注意哪些细节？</p></div><p><br /></p><br /><div><p>答：菩萨论心不论事，我们只管多传如来藏的光碟和讲记。你这种看法也有点悲哀，这十几年来，我们走到那里，几乎场场爆满，到会的信众几乎都是百分之九十以上乃至百分之百举手认可，众生觉悟越来越高，所以我们应该充满信心，是吧？！而且许多人、从来不信佛的人，他听了如来藏大法，当下都能了生死。只怕他不看，那你没有办法。</p></div><br /><div><p>235.在家受持八关斋戒是否必须按照仪轨？或者佛前禀告佛菩萨就可？</p></div><p><br /></p><br /><div><p>答：第一，我们懂得了《法华》《楞严》，一门深入就好。第二，在家受持八关斋戒，你持不了这个戒，反而还造罪。「二十四小时之内不能睡觉，打盹都不能打」，谁能做到？不仅不能睡觉，二十四小时之内你还不能打妄想。一个人能做到这点，你其他戒通通都有了，哪要八关？能做到这一点，你即了生死。</p></div><br /><div><p>236.假若没有地方供佛，该如何办？</p></div><p><br /></p><br /><div><p>答：没有地方供佛，那就不要供佛，不要拘泥于这样的形式。重要的是你要懂得《法华经》《楞严经》。</p></div><div><p>比如说，你走路的时候，观照这个路就是我，是不是供佛啊？你吃饭的时候，知道饭就是我，在《楞严经》叫「自心取自心」，是不是供佛啊？虽然我吃的米也是我，也是佛，但是我不吃就不能修道，就不能度众生，但我们修行的功德就足以还债。时时事事处处，你正念就是功德。</p></div><br /><div><p>237.如果有人不信因果，并且无恶不作，他也能一时开悟，也能当下成佛吗？</p></div><p><br /></p><br /><div><p>答：是的，无恶不作的人，只要懂得一心三藏，当下就成佛，《楞严经》最后一页是不是这么讲啊？不信因果的人，你劝他看相关讲记，只要看了就有救。</p></div><br /><div><p>238.宣化上人说，可以用三昧真火来烧贪嗔痴，怎样理解？</p></div><p><br /></p><br /><div><p>答：天地万法都是一个人一个念变出来的，这是第一义。即使讲第二义，一切天地万法、牛马猪羊、亲朋好友、冤亲债主，是不是也是我们过去世的父母儿女啊，至亲骨肉啊？以此就可以减轻烦恼，乃至消除，这是不是三昧真火把烦恼烧掉了，是不是啊？</p></div><br /><div><p>239.在我未闻到如来藏大法之前，是学的现世因果教育，两者之间是否有误解？</p></div><p><br /></p><br /><div><p>答：没有误解。学懂了如来藏大法你更加懂得因果，就更加会遵循因果的规律，来修佛因，成佛道，是不是？而且因果就讲行善积德，真正明心见性的人，哪一个人不行善积德啊？圆顿大法是根本上行善啊。</p></div><br /><div><p>240.梦中的事情变为现实了，以后遇到这种情况如何解决？</p></div><p><br /></p><br /><div><p>答：梦中的事情遇到变成现实了，就帮助你认识佛法，一真一切真，我们梦中的事情变成现实是真的，梦中的事情没有变成现实也是真的，没有变成现实的，或者是反映你过去世的事情啊，或者是反映你未来世的事情，它一下得不到证实，但你不能讲它是假的，所以一真一切真，梦中的一切都是真的，要搞明白，帮助我们理解佛法。</p></div><br /><div><p>241.成佛之后，佛也不可得，哪还有什么可证？</p></div><p><br /></p><br /><div><p>答：这种说法是错误的，你就变成了断灭论。什么是不可得？如果不可得，我们还修它干什么？</p></div><br /><div><p>242.听闻如来藏大法后，如何实相念佛？</p></div><p><br /></p><br /><div><p>答：实相念佛就是观照，你吃的大米是谁啊？米当下就是你，就是阿弥陀佛，为什么？在相见性，那么大米是这样，橙子是不是这样？那么大米是不是橙子？那橙子是不是西瓜？那么张居士是不是就是李和尚？李和尚是不是释迦牟尼？释迦牟尼是不是猪八戒？大光明藏中谁非谁，谁又不是谁呀？</p></div><div><p>走在地上，躺在床铺上，坐在饭桌边，触目菩提，随手拈来，无非如来正法。拿什么讲什么，拿起眼镜就是阿弥陀佛，你得讲清楚为什么它就是阿弥陀佛。不能口头禅。</p></div><br /><div><p>243.是不是只有出家才能圆满佛道？</p></div><p><br /></p><br /><div><p>答：不是。龙女没有出家，听《法华经》当下成就圆满佛。龙宫里的龙子龙孙、虾兵蟹将，没有出家，听《法华经》当下了生脱死。但是在人道的众生，相对而言，出家更有利于专心修行。他可以断绝或者最起码减少男女生活，来世少受众苦恶。万恶淫为首，不管你是正淫还是邪淫。男女生活就是杀生，所以在家居士要尽可能克制，最好断绝。</p></div><br /><div><p>244.无修无证与悟后进修两者的关系是什么？怎样「悟后进修」？</p></div><p><br /></p><br /><div><p>答：明白道理了就了生脱死，这叫无修无证。你修了吗？你也没有打坐，也没有念佛，没有做什么事情。你不就把耳朵带了了嘛？！耳朵在那里修了吗？你耳朵听我讲经也是听，不听我讲经也还要听别的。</p></div><div><p>分真即佛就是无修无证，然后在此基础上，有修有证，礼佛、拜佛、修禅、持戒，或者继续修行一心三藏，只管观照，最后就圆满了。总的来讲，就是修心，增强自己的定力！宇宙万法都可以修，也可以什么都不修；看上去什么都不修，他遇到境界就能转过来！这叫无功用道；如果有功有道的话，也是示现这个形相来影响别人，但对于自己来讲，你怎么修都自在了！刚才讲了，吃饭的时候可以观照——第一，是你吃饭还是饭吃你？第二，是为了什么吃饭？如果为了保持色身而度化众生，你吃饭就是菩萨道。</p></div><br /><div><p>245.在佛像面前念经时情绪控制不住想哭，是怎么回事？</p></div><p><br /></p><br /><div><p>答：三种情况：一种是因为法喜，过去世中佛缘很深，过去世就曾修持这部经典，或者还没有看懂，或者已经看懂了；第二种情况呢，可能是受到魔界众生的干扰；第三，也可能触动了伤感的事情。</p></div><div><p></p></div><div><p>246.请问出家人能不能哈哈大笑啊？</p></div><p><br /></p><br /><div><p>答：圆顿大法，连打佛骂佛都可以，怎么就不能哈哈大笑啊？修行是很快乐自在的事，各位要晓得。</p></div><br /><div><p>247.明心见性到底是什么境界？那为什么有很多同修还是跟凡夫一样，爱打闹，脾气暴躁，没有耐心，难道这就是明心见性吗？</p></div><p><br /></p><br /><div><p>答：也可能是，也可能不是。明白了一心三藏的道理，这就是明心见性。有些人明心见性以后，往往很平和；有些人明心见性以后，还是会发脾气，打人骂人，不过这还得看他用的是什么心。如果心用对了，那么拳打脚踢，焚经毁像，无非证道。</p></div><div><p>别人打你，你还要感恩，这是成就你的平等心，清净心。你非得问他有没有明心见性啊，你是自寻烦恼。如果这个人确实带有情执，发脾气，可以分为两种情况：一种是他确实没有明心见性，必有果报；一种是他确实明心见性了，只是习气还没有改掉，不影响他成佛，但是成就的品位不高，来世要还债。</p></div><br /><div><p>248.现在糖尿病、高血压、心脏病等疾病的患者很多，应该怎样帮助他们呢？让他们听师父讲经好，还是别的方法呢？</p></div><p><br /></p><br /><div><p>答：可以听师父讲经。明白道理，打开心量，首先解除对死亡的恐惧，解除对痛苦的烦恼，这点能做到，病就好了一半；有的还能全部好。然后，结合吃药、打针、理疗等等，我们不要偏执某一法，每一种法都有它的作用，有的病不是药的问题，是心理问题。心力的作用不可思议。</p></div><br /><div><p>249.您在定中见过佛吗？</p></div><p><br /></p><br /><div><p>答：你不要非要把佛搞成三十二相，那就是走火入魔了。没有哪一法不是佛。佛在《法华经》讲：舍利弗，有人听见你讲《法华经》就是见佛——并没有说，舍利弗，有人见到你就是见舍利弗，见到释迦牟尼就是见佛，是不是呀？茶杯是不是佛啊？《金刚经》讲，若以色见我，以音声求我，是人行邪道，不能见如来！</p></div><br /><div><p>250.信奉「一句佛号就成佛，持一部《无量寿经》就成佛」的大有人在，怎样度化？</p></div><p><br /></p><br /><div><p>答：如果他是念佛人，推荐看《佛说阿弥陀经讲记》；修禅修密宗的人，推荐《心经讲记》《楞严经168字》；不学佛的人，推荐他看《过五关度六将证菩提》。要根据不同根机来引导。</p></div><div><p>你可以这样问：《无量寿经》是经王，这是谁讲的？他会说是某某法师讲的。你再问他，那么佛有没有没讲呢？</p></div><div><p>你再问，一句佛号就能往生，这话是哪部经讲的？他肯定说是《阿弥陀经》讲的，而且他还肯定能找出来——若善男子，善女人，闻说阿弥陀佛，执持名号，若一日……那你再说，没错，善男子善女人一句佛号一定成佛，但你知道什么叫善男子善女人吗？在佛法里，「有我就是恶，无我方为善」，你能算得上善男子善女人吗？后面还有讲到，「受持」，注意啊，是「受持」一句佛号，不是「念诵」一句佛号。只有懂了才能真正受持。</p></div><div><p>也有人讲《无量寿经》说，十句佛号就能往生啊——好！把《无量寿经》翻给我看一看，第十八愿讲了：所有功德，念念回向极乐世界佛国，不往生者，我阿弥陀佛誓不成佛。看清了吗？「所有功德念念回向」给极乐世界才能往生哦，你所有功德回向了没有？百分之八十回向了没有？百分之五十回向了没有？三分之一回向了没有？</p></div><br /><div><p>251.《一切如来心秘密全身舍利宝箧印陀罗尼经》和《法华经》一样吗？</p></div><p><br /></p><br /><div><p>答：也一样，也不一样，你读懂了就是一样，读不懂就不一样。这部经呢，因为它短小，在有些地方还形成了主流，把那些咒念来念去的，有什么用呢？念咒要做到「三密相应」，口密音要准，身密要会打手印，意密要会观照，谁能做到？</p></div><br /><div><p>252.在《大佛顶首楞严经》104页倒数最后一行讲：「岂非随所沦，旋流获无妄，阿难汝谛听，我承佛威力，宣说金刚王，如幻不思议，佛母真三昧」。这部分怎么理解？</p></div><p><br /></p><br /><div><p>答：岂非，是带有感慨之义。岂非随所沦：难道不是因为我们眼睛执着地向外看，向外攀缘，所以我们才随着自己造的业在流转吗？旋流获无妄：旋流，是回光返照不往外看，往内看；获无妄，是见真、见性。要往内看，能看能听能想的这个心怎么回事呢？是不是由第七识产生的？</p></div><div><p>阿难汝谛听：阿难啊，你好好地认真听，你好好地从真实义来听，随着我的话来转。我承佛威力：释迦牟尼佛在当场加持我，给我助阵。文殊菩萨受佛的委托传法。</p></div><div><p>宣说金刚王：《金刚经》是不是胜义法呀？《楞严经》叫什么？胜义中真胜义，是不是金刚王啊？如幻不思议：如幻，就是如是我闻，就是阿弥陀佛，就是如来。如来不思议，或者一心三藏不思议。不思议，就是不能按照凡夫的心态、按照世间语言、按照世间的逻辑推理来打妄想，要靠智慧来领略观照。懂得了不思议，当下就可思可议。如果不可以思，不可以议，诸佛到这个世间来，一个个都是哑巴佛，站在这里大眼瞪小眼，对不对？成天说这个不可说，那个不可说，还要你佛干什么来？虽说不可说不可说，说了三藏十二部经，最后还要讲《法华经》。佛母真三昧：佛母，是成佛之母，成佛之因；真三昧，是真的不是假的。昧，是表迷惑颠倒；三，是表纠正，拨乱反正，把颠倒的东西再把它颠倒过来。</p></div><br /><div><p>253.请问师父到底应该怎么念佛？佛经上说得很明白，「善男子善女人」，「信」只要一至七天当生极乐国土，佛没有妄语，我很惊异。</p></div><p><br /></p><br /><div><p>答：应该怎么念佛，懂得了阿弥陀佛就叫念佛。什么是「善男子善女人」？在佛法里，有我就是恶，无我方称善，你达到了无我没   有？一至七天当生极乐世界，佛没有打妄语。明心见性的人，「若一日、若二日」……在佛法里，有时间必有空间，有空间必有万法。也就是说，一个人果真明白阿弥陀佛真实义，他时时事事处处，念念在道，念念都是阿弥陀佛，时间是阿弥陀佛，空间是阿弥陀佛，万法都是阿弥陀佛，这叫「若一日、若二日」，这个是「一心不乱」，你没有办法乱，天地万法都是我一个人一个念，一心不乱。</p></div><br /><div><p>254.对胆小自卑的人应该怎么度化呢？他有时候会身体僵硬、神情慌张。</p></div><p><br /></p><br /><div><p>答：你不能贡高我慢，要显得比他还糟糕。你喊他：「走，我们去听《法华经》！」他说：「不行，我文化太低了，我不能，我斗大的字也识不得两箩筐啊！」你要说：「那我比你还笨啊，我都听得懂，你更能听得懂。」</p></div><br /><div><p>255.我现在学这个大法觉得很好，但是原来学过的一些心理学也觉得很好，不能专下心来学这个大法，两个之间抉择困难。</p></div><p><br /></p><br /><div><p>答：我劝你学大法，花不了你多少时间。你根机好，看一遍《过五关度六将证菩提》就明白了，充其量用三个月的时间足矣，把我所有的视频看完，你再去研究心理学。</p></div><br /><div><p>256.我们现在已成分真即佛，那往生后怎样再来度众生，会因隔阴之迷而忘记自己今生所学授记的《法华经》与《楞严经》吗？</p></div><p><br /></p><br /><div><p>答：愿身再来，如果你怕忘记，可以不要隔阴之迷；但是我劝你，还是带隔阴之迷比较好，为什么？如果带五种神通、六种神通而来，不利于你修行历境，不利于在人间闻法。虽然你带着隔阴之迷，其实你是愿身再来的菩萨，就有诸佛菩萨护法神明在冥中加持引导，让你能在一定的时空点再次遇到正法，遇到明师，来进修佛道，度化众生。即使你遇不到正法——有时正法不现前啊，你自己又没有足够的力量来承担正法——凡是再来的菩萨，在本质上，他会从小到老表现出善良慈悲、正直光明，你已经间接地度化了你的家人、亲朋好友、左邻右舍，而且在特别的时候，你一听到《法华经》《楞严经》，就会法喜充满。</p></div><div><p>愿身再来的菩萨，会因为今世的贪嗔痴而落到三恶道吗？</p></div><div><p>答：不可能。愿身再来，你是明知山有虎，偏向虎山行。即使犯贪嗔痴，破戒犯戒，那么来世你会在人道天道还债。</p></div><br /><div><p>257.佛讲往生极乐要降服烦恼，心能转境；那我们在明心见性后，习气还是很重，又做很多坏事，不能转恶念，能往生吗？</p></div><p><br /></p><br /><div><p>答：能够往生，但品位不高，你所做的恶事来世还要报应，但是在人、天道报应，不在三恶道。任何佛、任何菩萨，都不可能一下子就把所有的恶业消尽以后才能成佛。《楞严经》最后一段，那么大一个坏人，他听了楞严法门，一念就往生，他怎么可能把所有的业转尽、除尽？这怎么可能啊，但是他往生了。我们明白道理，只是分真即佛，还要继续破除烦恼习气成圆满佛。你到底有没有明白，自己要知道；如果还有恶念的时候，要怀疑自己到底明白了没有。</p></div><br /><div><p>258.菩萨从明心见性到圆满成佛要经历哪几个阶段？</p></div><p><br /></p><br /><div><p>答：明心见性从初信位菩萨开始到成圆满佛，有分为42个阶段，有分为55个阶段，有分为60个阶段。《楞严经》上有讲，今天没有时间细讲。</p></div><div><p>有些人明心见性后，一下子到十地、等觉都有，看你悟解得深刻不深刻，看你发心大不大而已。虽然有那么多阶段，你可以一念突破几个、十几个、几十个。</p></div><br /><div><p>259.菩萨再来是愿力和业力共同的作用吗？</p></div><p><br /></p><br /><div><p>答：回答正确。愿力就是我要度众生，他知道天地万法都是我们生生世世、多生多世的父母，他不愿意在佛土享清福，而愿意到下地、凡尘来领众修行。同时也是业力。为什么？我们在无量的生生世世中有无量的生生世世的父母，但我们有隔阴之迷，互不相认，就是依靠业力把我们缘分聚到一起。所以，佛也好，众生也好，到这个世界上来都是酬业，佛、菩萨既酬真理业、菩萨业，也酬凡夫业，就是示现肉团身这个相来还债。</p></div><br /><div><p>260.狱卒在地狱里不也是果报吗？</p></div><p><br /></p><br /><div><p>答：是果报，也很苦，但他比地狱道里受苦的众生，相对而言，是轻松的。他前世修了一点福报，虽然在地狱道，但是不受皮肉之苦；当然也有的是菩萨再来，示现在地狱道里帮助教化众生，这又当别论。</p></div><br /><div><p>261.怎样修观世音菩萨闻思修法门？</p></div><p><br /></p><br /><div><p>答：先把《法华经》《楞严经》读好，读懂「如来藏」的道理以后，你再去修，像观世音菩萨那样过六关，解六结。</p></div><br /><div><p>262.怎样反闻闻自性？</p></div><p><br /></p><br /><div><p>答：我们平时眼睛向外看、耳朵向外听、鼻子向外嗅、舌头往外尝，都是向外攀缘。现在要懂得，我们能够向外攀缘分别的那个东西是什么，这叫「反闻闻自性」。我开口讲话之前，能讲的这个东西在不在？在哪里？心里。有没有任何形相？既然没有，我的这个心跟你的那个心，跟佛心、天心、人心、鬼心能不能分开？这叫反闻。</p></div><div><p>比如说（示之以气球手套），佛在这里（大拇指），天在这里（食指），我在这里（中指），牛马猪羊都在这里（无名指），我们都往外看——这是佛，在天上；这是猪，在圈里；这是我，住在小别墅里。往内看，里面（气球手套的空心）是不是通的？这么多指头是不是一个东西变出来的？为什么我们不自在，而佛自在？因为佛既往外看又往内看，而凡夫众生只往外看。</p></div><div><p>修禅宗呢，只往内看。凡夫众生是执相昧性，禅宗是执性昧相，而修圆教的菩萨「色即是空，空即是色」，没有哪一法不是哪一法，相当下就是性。一方面，佛是佛、我是我、他是他；另一方面，佛也是我、我也是佛、他也是我。这个「一」是不是就是无量啊？一片风是不是一团火啊？一滴水是不是观世音菩萨啊？有没有哪一样不是哪一样啊？</p></div><div><p>昨天遇见一位菩萨，他修《六祖坛经》，我讲一句法，他要讲十句。我说你不是来请法的，你是来传法的。我最后问他佛是什么，狗屎就是佛，对不对？他说我不敢这样讲。我说：「那恕我直言，你还没有见性，是不是？」他认为佛就在天上，人就在地下，是不是？天地万法都是一个人一个念变现而已。这叫反闻闻自性，明白了吗？</p></div><br /><div><p>263.智者大师被称为「小释迦」，为什么他讲了止观，要解行并重？</p></div><p><br /></p><br /><div><p>答：第一，智者大师被称为「小释迦」，根据何在？是哪一尊佛讲的？是哪一部经讲的？我们没有办法判定真假。</p></div><div><p>第二，我们常讲，明心见性以后要念佛、拜佛、修禅定，不就是叫你们去修去证吗？你明心见性以后可以去修止观啊。要明白，智者大师生前，《楞严经》还没有传到中国，他老人家造了拜经台，面朝西方拜了十八年，想求《楞严经》都没有如愿。在没有《楞严经》前提之下，智者大师把《法华经》几乎讲到登峰造极的地步。我们不能责备前人，也不能盲目地恭维前人，要客观地评价。</p></div><br /><div><p>264.人往生时，需不需要助念？</p></div><p><br /></p><br /><div><p>答：不能一概而论。当下开悟，当下就能往生了。但是呢，不管是谁往生，我们都尽量为其助念。</p></div><div><p>第一：防止他/她在世时，道理明白得还不深；</p></div><div><p>第二：助念可以提升品位；</p></div><div><p>第三：可以引导其他不信佛法的人，让他们种一颗种子。</p></div><br /><div><p>265.皈依多年，有一些人夫妻生活断不了，能受菩萨戒吗？</p></div><p><br /></p><br /><div><p>答：能受。在家菩萨戒是断邪淫，不断正淫。但不管你受戒不受戒，正淫、邪淫都是要受果报的，这是心戒。你来世果报非常非常苦，而且要多生多世的还。</p></div><br /><div><p>266.虚空、山河大地、人华草树木这些东西，被真空包含着？还是真空当下即这些东西，这些东西当下即真空呢？</p></div><p><br /></p><br /><div><p>答：真空当下即是这些东西，《心经》里讲「色不异空，空不异色」。这个墙当下是不是虚空？鬼神从这边穿过去需不需要在这里打洞啊？我们把它当成墙，这是我们的同分妄见。你不能讲这是茶杯，也不能讲它不是茶杯。你讲它是茶杯呢，它当下即是佛，是水，是火，是不是啊？你讲不是茶杯，它当下就是茶杯啊，火也是茶杯，鬼也是茶杯，人也是茶杯，这就是如来藏妙法。</p></div><br /><div><p>267.请法师再讲一讲第七识怎么理解。</p></div><p><br /></p><br /><div><p>答：方便说呢，每一个人都有一个第七识，无量众生就有无量的第七识。所有的第七识合起来是第八识。</p></div><div><p>其实呢，每一个人具有无量的第七识。这个法在《楞严经》第九卷会讲到，禅定功夫到了一定阶段，自己可以召开大法会，比如鼻子菩萨说法，眼睛菩萨、耳朵菩萨、肝菩萨、胆菩萨作为听众，每个细胞都是一个菩萨。所以佛为什么有无量的分身啊，这就是妙法。</p></div><br /><div><p>268.第七识是真人，第八识是阿赖耶识的种子仓库，等仓库里的种子成熟，果报就现前，现前完了是否成真空？就是无痕迹了？否则种子仓库就装不下了。</p></div><p><br /></p><br /><div><p>答：法界是无量的，你不要担心装不下。至于什么成了真空就无痕迹了，不是的。真空当下就是万有，万有当下就是真空，明白吗？无痕迹怎么教化众生啊？就是要示现各种形相，现人、现鬼、现畜生，当老师教化众生，要明白，现痕迹是不是当下仍是真空啊？不管你承认不承认，你当下都是个真空。</p></div><br /><div><p>269.十法界唯有佛是一真法界吗？</p></div><p><br /></p><br /><div><p>答：十法界总体就是一真法界，一真法界就是十法界，十法界表无量法界，没有内没有外，可以现内现外。十法界的佛就是释迦牟尼佛，阿弥陀佛在某种意义上来讲可以叫个体佛，众生通过修佛法完全解脱了就成佛了。那么完全解脱的佛和还没有解脱的六道众生，当下就是一个东西，这叫一真法界。个体佛是真实存在的，一真法界的佛也是真实存在，只要这个一真法界里还有一条狗、一只猫、一片风、一滴雨、一块泥巴没有成佛，我们这个一真法界的佛就不圆满，</p></div><br /><div><p>270.众生无量，怎么度得完呢？</p></div><p><br /></p><br /><div><p>答：众生虽无量，但佛也是无量，有无量佛来度化无量众生，为什么度不完呢？</p></div><br /><div><p>271.假如我不小心杀了一个众生，而这个众生没有怨恨心。如果不找我报复，是不是我就没有报应？</p></div><p><br /></p><br /><div><p>答：它不可能不找你的，你杀他的时候，那个信息就已经存到你的第八识里了。他不报复你，将来你也会自己报复自己。</p></div><br /><div><p>272.「成佛的法华，开悟的楞严」出自哪里？</p></div><p><br /></p><br /><div><p>答：自古以来都是这么传的，真实不虚。具体请看《法华经·方便品第二》《法华经·法师品第十》《法华经·药王菩萨本事品第二十三》等等。在《楞严经》里，从阿难的每次请法中就可以体会出这是一部开悟的经典。</p></div><br /><div><p>273.不修早晚课改诵《法华经》是不是更好呢？</p></div><p><br /></p><br /><div><p>答：在家居士读《法华经》更好。如果在道场，要服从集体管理。</p></div><br /><div><p>274.第七识一秒钟有一千二百八十万亿亿次生灭，不是没有生灭吗？</p></div><p><br /></p><br /><div><p>答：谁说没有生灭的？我们真心本性非生非灭，非不生非不灭，可以随缘现生现灭，现不生现不灭，是不是？</p></div><div><p>讲不生灭，是通教的无生法忍；圆教不能讲是无生法忍，也不能讲是有生法忍。无生法忍就是有生法忍，有生法忍就是无生法忍，我们随缘显现，明白了没有？为什么《楞严经》说「言妄显诸真，妄真同二妄」？通教的那个真，是空如来藏，他以为是不生不灭的；那么，有生有灭当下是不是不生不灭变现出来的？不生不灭当下是不是有生有灭当下变现出来的？这就是我们真心本性的特征。</p></div><br /><div><p>275.日常生活中无意看见其它法界的众生，怎么对待？</p></div><p><br /></p><br /><div><p>答：某个时空点看到其它法界的众生，看到了也是正常的，不要大惊小怪，不管你自己是否知道，我们第七识也会认识的。</p></div><br /><div><p>276.生病了，有人会说要调节心量大了，病就会好得快，对吗？</p></div><p><br /></p><br /><div><p>答：对。连凡夫都知道，你生病了，你想开点啊！想开点是不是就能好的快啊？</p></div><br /><div><p>277.是不是心量大的人就不会生病，而生病的都是小心眼的人呢？</p></div><p><br /></p><br /><div><p>答：这是不对的。病有多种，有虚病、业病、实病。佛在世的时候还生病呢，你能说佛心量不大吗？明心见性的人，能把握自己的命运，但色身毕竟是低级产品，你如果太劳累不注意保养，也会短命。</p></div><div><p>不能以有病、无病来衡量一个人的道行，以长寿、短命来衡量一个人到底是佛还是凡夫。心量小的人也不一定都生病，明白吗？他如果专门想着保养自己，其它什么也不想，这种人最能长寿。另外还有一种心量小的人，专门搞人我是非，那就是短命鬼。</p></div><br /><div><p>278.观世音菩萨的耳根圆通法门是否也要经过无量劫的修持才成道？</p></div><p><br /></p><br /><div><p>答：不需要！凡是悟后进修，任何法门都不需要无量劫，但是时间可能有长有短，最快的还是按照《法华》《楞严》这个法门进修。您看龙女，八岁的龙女听闻《法华经》，当下成圆满之佛！如果没有明心见性的人，修无量劫也不能成就，除非用《法华经》《楞严经》来开悟。《楞严经》怎么讲哪？如果不明心见性，「虽终日行，枉入诸趣」！《大方广佛华严经》也说：「忘失菩提心，修诸善法，是名魔业。」</p></div><br /><div><p>279.《妙法莲华经》哪一品的几句经文，经常念能治眼病的？</p></div><p><br /></p><br /><div><p>答：出自《法华经·观世音菩萨普门品第二十五》：无垢清净光，慧日破诸暗，能伏灾风火，普明照世间。</p></div><br /><div><p>280.真空怎样变成虚空？</p></div><p><br /></p><br /><div><p>答：真空本来就是虚空，虚空本来就是真空。只是因为我们迷惑颠倒，不知道而已。真空就是妙有，妙有就是真空。茶杯就是佛，佛就是苹果，苹果就是大米，大米就是张居士，张居士就是李和尚，没有哪一样不是哪一样。每个人当下就是虚空，当下就是真空，明白了吗？当下就是，只看你懂不懂。懂也是你变的，即使不懂，也是你变的。</p></div><div><p>看我的手掌，变成拳头的时候它是不是当下就是手掌啊？非要变成手掌才是手掌吗？它变也是手掌，不变也是手掌，就是这么简单，所以圆顿大法无修无证，就在这里。</p></div><br /><div><p>281.很多人讲自性无一法可得，一切法，毕竟空，不可得。</p></div><p><br /></p><br /><div><p>答：自性无一法可得，这是禅宗的概念。自性非得非不得，可以现得现不得，这才是如来正法。</p></div><br /><div><p>282.供佛的果品，有人说不能吃，对吗？</p></div><p><br /></p><br /><div><p>答：不对，供佛以后当然可以吃，供了鬼神的东西都可以吃，不要糟蹋浪费。我们这次做水陆法会，把大量的馒头、大米倒到桶里，那是一种浪费啊。</p></div><br /><div><p>283.有人说执著任何一部经，执著任何一个法都是不究竟的，如何理解？</p></div><p><br /></p><br /><div><p>答：这是不对的。你执著一部《法华经》，执著一部《楞严经》，执著一部《心经》，究竟不究竟呢？因为这一部经听懂以后，能包容一切经、一切法门，明白吗？《法华经》是如来全身，法身、报身、化身全部都有了，执著它怎么不好啊？真心本性非执著非不执著，该执著的时候一定要执著，要坚持真理，祛邪扶正。</p></div><br /><div><p>284.我是青州居士当娟，从前看文字一直都离不开放大镜，听了两天《法华经》，现在不用放大镜了，多年胃病也有好转，我太高兴了，感恩师父，阿弥陀佛！</p></div><p><br /></p><br /><div><p>答：这就是我们的心在起作用，来改变健康状况！《法华经》是一部不可思议的经典，一门深入，必有大成就。</p></div><br /><div><p>285.「成佛的法华，开悟的楞严」，是不是叫「一佛乘」？</p></div><p><br /></p><br /><div><p>答：是的，圆教一乘。有的人把《华严经》也叫做是一乘，要搞清楚，《华严经》是别教一乘。</p></div><br /><div><p>286.有一位发心讲经的菩萨，经常耳边有擂鼓的声音，吵得睡不着觉，这是属于什么情况？</p></div><p><br /></p><br /><div><p>答：他没有把一心三藏的道理搞明白，受到魔的干扰。</p></div><br /><div><p>287.三界唯心，万法唯识，用分别法来理解的话，这个「心」是指哪一个心？</p></div><p><br /></p><br /><div><p>答：是指空如来藏，是指阿弥陀佛的阿，是分别法的真心本来面目。唯识的识应该就是阿弥陀佛的弥，这个识包括第八识，第七识，一二三四五六识，都包括，就是我们妄想心和半真半妄的妄想心，在思量、分别而造出口业、身业，造出花花世界，十法界。</p></div><br /><div><p>288.现在很多师兄们说，一天24小时能够播放恩师的讲记，非常殊胜，不知晚上睡觉的时候将师父的讲记放在旁边听，会不会对法不恭敬？</p></div><p><br /></p><br /><div><p>答：不会。如果放到床头听的话，感觉到影响睡觉可以关掉，以身体健康为要。那么在有的情况下，假如其它法界的众生比较多一点，你可以把播放声音调小，放在厨房等不影响你睡觉的地方。</p></div><br /><div><p>289.上卫生间时能不能念佛？</p></div><p><br /></p><br /><div><p>答：统统都能。大乘法跟小乘法不一样，牛屎狗粪都是诸佛如来，你有什么好分别的，在什么地方都养成我们的习气，这个习气就是禅定。</p></div><br /><div><p>290.你说的每句话都是有凭有据的，这个我肯定相信，不然我也不会遇上恩师，师父说世界万法即是一个人一个念变现出来的，这是一句真理，这个依据在哪里？</p></div><p><br /></p><br /><div><p>答：就在《楞严经》。无始之初，从我们的真心跑出一念业相无明，然后再转相现相，然后再六粗，是不是现出天地万法呀？是不是一个人一个念造出来的？你再想一想，一滴猴子血能造猴子，那么一只猴子是不是无量的血啊？是不是能造出无量的猴子？你一个人当下就是无量的人啊。那么我的这个念、你的那个念，能不能分开是谁的念啊？是不是所有的念都是一个念？再看《楞严经》讲，泥巴瓦块都能变成鸟，鸟能不能成佛啊？所以佛、天、人、鬼、畜、泥巴、瓦块是不是就是你一个人一个念变出来的？</p></div><br /><div><p>291.请问我在看您讲经的光盘时，意念我的母亲也来听经，能否超度她？</p></div><p><br /></p><br /><div><p>答：能起到作用，有意念你的母亲我们这个人这个第七识啊，它这个没有时间、没有空间、没有任何障碍，但有缘份，你一念力你母亲呢，你跟你母亲两人第七识就得到道交感应，所以呢，她能得到好处，能帮她种下金刚种子。比如说将来如果什么时,候，她读到《法华经》的时候，哎呀，以前从来没有读过呀，怎么现在一看就好象读过呀——这就是你的功德，你读《法华经》的时候引她过来了，要懂得如来心法不可思议。</p></div><br /><div><p>292.请师父开示当下一念？</p></div><p><br /></p><br /><div><p>答：念字，上今下心，当下就是你自己的心。上次不是问了？这里唐朝人来了没有啊？（众答：来啦）秦朝人来了没有啊？（众答：来啦）一百万亿亿亿国的人来了没有啊？（众答：来啦）是不是当下这一念？你当下这个人是不是过去人、现在人、未来人？谁死过没有啊？那我再问，美国人来了没有啊？（众答：来啦）太阳上的人来了没有啊？乌龟王八蛋来了没有？我们当下就是天地万法，哪一样没有做过？我们现在就是那个东西，明白了吗？这是当下一念。</p></div><br /><div><p>293.现在听您讲法，似有所悟，心生法喜，特别看了您的放生开示，所说非常精辟。我是一个厨师，放弃了高薪，从荤食制作而改做素食制作已经有三年了。在制作过程中，为了满足客人的要求和口味需要，加点葱蒜，但是往往受到学佛之人的指责。素食馆是个放生池，应该让众生欢喜，让更多的人慈悲茹素。能否开方便之门，希望他们欢喜护持而远离杀生？</p></div><p><br /></p><br /><div><p>答：葱蒜属于五辛，生吃容易使人脾气暴躁，熟吃增加人的淫欲。同时嘴巴污染了以后，护法正神会离你而去；而邪鬼邪神会来舔你的嘴唇，与你结缘。所以葱蒜一般不要放，当然，可以征求人家意见，自己把握一下就行。</p></div><br /><div><p>294.家里以前的经书（《法华经》和《楞严经》除外），以及其他法师的讲经，要如何处理？</p></div><p><br /></p><br /><div><p>答：凡是佛经，要以恭敬心加以保管。至于其他法师所讲的光盘和讲记，你们自己看着办。你认为哪一位讲的好的，可以保存下来。</p></div><br /><div><p>295.缘起性空与如来藏的区别在哪里？性空是不是本来空？毕竟空，是没有一个所谓的本体？</p></div><p><br /></p><br /><div><p>答：缘起性空，这就是一心三藏。有的法师讲成了空如来藏，或者断灭空，这是不完整的。讲它是一心三藏，缘起就是弥陀、天地万法；性空就是空如来藏，就是阿。怎么缘起呢？我们这个六种意识心以及第七识、第八识都叫能缘，外面的山河大地、日月星辰、树木华草，无情的万法都是所缘。所缘除了无情物，还包括有情物。比如张三李四都是能缘，张三对着李四，李四就变成张三的所缘，所缘包括无情有情一切万法。能缘特指我们的根性，然后进行分别妄想，成就了十法界花花世界；然后又形成一种固定的意识心，就是《楞严经》上讲的识大；识大就是眼识、耳识、鼻识、舌识、身识、意识、七识、八识。</p></div><div><p>这八种识呢，大家注意，分能缘和所缘。比如说：我眼睛看着这个灯，眼根是能缘，灯是所缘，然后产生的这个刺激就是眼识。天地万法就是个能缘、所缘、所缘缘。能缘的根对着所缘的天地万法打妄想就变现出新的天地万法，这种变现形成了我们的感觉，就比如识——眼识、耳识、鼻识、身识、意识等等，储存在我们的阿赖耶识里面而成为花花世界的种子。种子是根据因缘果报的规则再变现为天地万法，这是讲缘起。缘起就是十法界。那变来变去，没有变之前它在不在呢？一定在。虽然在，没有变的时候它没有任何形相，这就是性空。万法都是缘起性空。那么性空当下是不是缘起啊？天地万法当下是不是性空啊？这就是缘起性空。</p></div><br /><div><p>296.什么是化身、报身、法身？</p></div><p><br /></p><br /><div><p>答：刚才这个鼓掌响出来了，有了声音，有了形相，这是不是化身啊？那么鼓掌之前是不是法身啊？鼓掌要通过思维，这就是报身，而且鼓掌的动作也是报身。如果对照阿弥陀佛，阿就是法身，陀就是化身，弥即是报身又是化身，他还有思维和动作，这样圆融起来。</p></div><br /><div><p>297.怎样大力弘扬《法华经》？</p></div><p><br /></p><br /><div><p>答：虽然说明心见性以后修什么法门都能成就；那在《观无量寿经》讲，有人成佛是一个大千国土，有人成佛是十个八个大千国土，有人成佛是百千万个大千国土，而阿弥陀佛是无量百千万亿的大千国土——也就是说成佛还有大小之别；同时，佛在《法华经》讲，修行人明心见性以后，有的要修百千万亿年，还有的修万万万万亿亿年才能成圆满佛——因为我们明心见性只是分真即佛，所以从《法华经》来看，是不是成佛还有快有慢啊？讲方便有多门，仅仅是讲你快也好，慢也好，反正能成佛，早晚的问题。你大也好，小也好，反正总有个佛位与大小的问题。</p></div><div><p>如果想做大佛，做快佛，应该怎么办呢？大力弘扬《法华经》《楞严经》，劝更多的人修行。至于怎样做好这个工作呢？要注意用智慧。</p></div><div><p>对自己的亲朋好友，话怎么讲都可以的。你以至诚心告诉他：哎呀！印广法师讲的太好了，叫我听得感慨万分，当下成就！你一定要看，什么事情都要放下来，要看。</p></div><div><p>至于那些交情不是太深而且执著比较重的人，你讲：昨天我看那个印广法师传法有点道理，我也还有迷惑，你看看能不能帮助我解释下什么意思——有些人好为人师，对这些人你千万不要讲我们过去学的是错误的，你也是盲修瞎练，你赶快看印广法师的法。</p></div><div><p>对家人，比如说夫妻之间啊，他过去一直对你学佛耿耿于怀的，你可以这样跟他讲：我真要向你忏悔，我太惭愧了。正如你过去所讲的，我过去就是搞迷信，我惭愧的都无地自容，不过我现在看到印广法师讲法，他从哲学的角度，从科学的角度讲万法的来龙去脉、相互关系，我建议你看一下。</p></div><div><p>另外，在初一、十五、佛菩萨圣诞日，可以带着光碟和讲记到各个寺院、道场去发，但是要遵守常住的规矩。如果能放到法物流通处，那是最好了。但是非宗教场所我们不要去，那是违法的，明白吗？</p></div><div><p>逛超市，串亲戚时，用一个透明的塑料袋装一本《妙法莲华经》，走到哪里就传到哪里，人家看到《妙法莲华经》种下金刚种子，就有功德。看到小孩过来，你明明认识字也装不认识：过来小朋友，这是什么字啊？妙-法-莲-华-经，是不是？给小孩子也种下金刚种子。家里请人吃饭，你捧一本《妙法莲华经》在那看，但是千万不要拿倒了，要闹笑话。</p></div><div><p>在太原有个居士，第一次看到《过五关度六将证菩提》，非常法喜，他当下就发愿，每一天至少劝一个人来看光盘，三天以后打电话再问感觉如何。其实，一天中度一个人，并不是没有可能。你两天度一个人行不行？三天度一个行不行？真正你度了一个人，他还度其他人，是不是？要发这个心。</p></div><br /><div><p>298.年纪大了，又没有文化，该怎么学习《法华经》？</p></div><p><br /></p><br /><div><p>答：老菩萨们集中起来，请有文化的人读给你们听，讲给你们听，就是读讲记也很好，更何况你家里总有懂文化的。叫你的儿子、孙子过来读一段，听一听，一方面度你，一方面也度他们呀。</p></div><br /><div><p>299.念佛时看到一尊菩萨，是好事还是坏事？</p></div><p><br /></p><br /><div><p>答：非好非坏。我们佛来佛度，魔来魔度。你是阿弥陀佛也好，观音菩萨也好，我跟你沟通，你看印广法师讲的《楞严经》，跟他聊。如果自己没有明心见性，你不要理睬他，既不要害怕，也不要攀缘，就当没有这回事一样，但是能做到这一点的人，几乎就没有；讲起来好听，行起来就走火入魔。《楞严经》讲的非常清楚，五十种阴魔境界代表无量种阴魔境界。</p></div><br /><div><p>300.学佛后睡眠几个小时比较好？</p></div><p><br /></p><br /><div><p>答：有些人一天睡10个小时，有些人3-2个小时，还有人长期不睡，所以要解除一种思想顾虑，睡多睡少并不是病，各人情况不一样。想睡就睡，不想睡就办道。</p></div><br /><div><p>301.小孩子还吃肉，可以看《法华经》吗？</p></div><p><br /></p><br /><div><p>答：没有关系，可以看。看懂了就不吃肉了。</p></div><br /><div><p>302.追求修行的次第和提升品位，与妄想是什么关系？</p></div><p><br /></p><br /><div><p>答：追求修行的次第和提升品位，这是妄中之正。在佛法里把凡是起心动念都判为妄，无念为真，在这妄里面有烦恼与菩提，有正与邪。我们的任务是把妄想转烦恼为菩提，转识成智，识和智、烦恼和菩提都叫妄想，要明白，跟世间讲的妄想可不一样。佛法里有动有行就是妄，它是作为因缘和合之物。</p></div><br /><div><p>303.父母生我之前的我，和我死了以后的我，是一个我吗？</p></div><p><br /></p><br /><div><p>答：也是，也不是。你说不是的话，这个心前八百年是我，后八百年是不是还是我？你要是的话，前八百年是个将军，一样不一样啊？记好一句口头禅，「是不是」。人不人、鬼不鬼、没上没下，象世间骂人的这些话歪打正着，都是真理。其实每一个人都是没上没下的。上就是下，下就是上。人不人鬼不鬼，你讲我是人的话，我也做过鬼，我将来还要成佛，是不是？你别讲我是人，你也不能讲我不是人。</p></div><br /><div><p>304.学习《法华经》法喜充满，我身上的有缘众生既然是一，它也应该法喜充满，为什么它还不离开？</p></div><p><br /></p><br /><div><p>答：你是不是真正刻骨铭心的法喜充满？有道无道，自己知道。如果你刻骨铭心地把天地万法都看成是自己，那么你怎么还有这个心——它怎么还不走呢？你这是不是自相矛盾呢？你只要有一个想让它走的念，你就不是法喜。无缘不聚——既然来了，我在学印广法师讲记，你跟我一起学讲记，你愿意在我身上也行，我就是痛苦一点，吃苦了苦，是不是？</p></div><br /><div><p>305.弥勒菩萨破一份生相无明就圆满，是不是还没有明白一心三藏？</p></div><p><br /></p><br /><div><p>答：不对。明白一心三藏的人，即使证到等觉位菩萨，一分生相无明还没有破；不仅如此，更多的是几分甚至十几分、几十分无明没有破，但是已经了生死了。</p></div><br /><div><p>306.从空如来藏变现为不空如来藏，从拳头变现为手掌时，那个变现到底是什么东西？</p></div><p><br /></p><br /><div><p>答：那个变现就是我们的智慧妙用，就是我们的报身功德。拳头是法身，手掌是化身，拳头变成手掌是不是变化啊？这就是报身，就是我们的智慧，三身功德具足。</p></div><br /><div><p>307.无定无不定是楞严大定，那么师父以前讲：观照我们的身体与房间乃至山河大地是何关系，我和一切人乃至一切万法是同一本体，是否这样观？何况我在梦中，等等。我这样观照有感应，但这时又生了有为法了，弟子把握不住，应该怎么办？怎么想？</p></div><p><br /></p><br /><div><p>答：我们真心本来面目当下即是有为法，当下即是无为法。我坐了板凳，板凳就是我，我就是板凳，板凳也是板凳，我也是我。板凳就是我，我就是板凳，这叫无分别法；板凳就是板凳，我就是我，这叫有分别法；对于真人来讲，非有为非无为，非自非他、即自即他。要好好观照。</p></div><div><p>你看气球手套，这个是大拇指，这个是小拇指，这叫无分别不妨分别，那么大拇指代表全体，小拇指也代表全体。那么大拇指就是小拇指啊？这叫分别不妨无分别，就是我们的妙用。所以，禅宗只是见一个空性，行无分别法，，把这几个都要破掉；藏教呢，讲这是观世音（大拇指），这是阿弥陀佛（食指），一个人只成一尊佛，他看不到全体；别教呢，认为亦空亦有，观世音菩萨就是有，文殊菩萨也是有，是不是啊？他们每一样都是一个真心生出来的、造出来的，一切唯心造啊。而圆顿大教呢，讲观世音，当下就是观世音；讲文殊，当下就是文殊；观世音当下就是文殊，文殊当下就是观世音，即空即有，事事无碍。</p></div><br /><div><p>308.我老伴用医保卡拿药给我吃了算犯戒破戒了吗？</p></div><p><br /></p><br /><div><p>答：这是犯盗戒。因为医保卡里面的钱，是全国十四亿人民的，不该你的你吃了，将来十四亿人都是你的债主，要还债的。</p></div><br /><div><p>309.我们学如来藏的人，这个肉团身死了以后，这个第七识到哪里去了？怎么去呢？我问了好几个人答案都不一样。</p></div><p><br /></p><br /><div><p>答：第七识到哪里去了呢？还在这里，也在那里，等你断气了以后，你知道，「哎呀，第七识从来没有离开过我，我就是第七识，第七识就是我啊，现在才知道没有死啊!」为什么啊？肉团身在那里，家人哭得死去活来；你在那里着急，我又没有死，你们哭什么？第七识就是你，你在哪里它就在哪里，还来问我啊？</p></div><br /><div><p>310.佛说实无众生可度，佛不度人，唯人自度，那为什么佛还要度众生呢？</p></div><p><br /></p><br /><div><p>答：实无众生可度，是破一切相见空性。怎么无众生可度啊？都是佛在自己度自己。只要这个世界上还有一个人或者一条狗、一个苹果、一片泥巴没有成佛，一真法界就不圆满。一真法界最圆满的时候，连一块泥巴都已经回归大光明藏。</p></div><div><p>至于佛不度人，唯人自度呢，佛把道理讲出来，信不信由你，信者得度。所以，不能讲佛度人，要靠你自己发心；也不能讲佛不度人，佛不把道理讲明白，你能不能自度啊？也不能。大家都知道，佛出世七天，他的生母就因为风寒而死，就算是说佛才七天，那么老古佛为什么见死不救啊？当年琉璃大王大军血洗迦毗罗卫国，二十多万人死于非命，佛三次劝说琉璃大王，最终悲剧还是发生。肉身佛在世，何况还有无量的佛在虚空法界，都没有制止佛的故乡本土遭到灾难。</p></div><br /><div><p>311.佛入涅槃中，若度众生这一念生，是否从涅槃中出来？</p></div><p><br /></p><br /><div><p>答：涅槃非动非不动、非生非死、非不生非不死，明白吗？生生死死都叫涅槃，这个是无住大涅槃。昨天讲了四种涅槃，要区分清楚。</p></div><br /><div><p>312.什么是实相忏悔？</p></div><p><br /></p><br /><div><p>答：不懂得一心三藏，天天跪在那里，一把鼻涕一把泪：佛啊，对不起啊，我昨天吃了一口肉啊，前天还吃了一只鸡啊……好了，本来你吃了一口肉，这么一忏悔，就变成吃两口肉了，明白吗？这是大乘佛法，因为第八识就是一面镜子，你加一个吃肉的念，这里增加一个烦恼种子。为什么讲小乘法不能成就啊？有些人一天到晚自以为会忏悔，你越忏悔，罪过越大！真正的忏悔是明心见性，一忏一切忏。方便忏悔是不二过，别老在那儿唠唠叨叨的。如果再吃就再忏，你变成老油条啦！</p></div><br /><div><p>313.有师兄做梦，在梦中问师父：哪种人讲经讲得好？师父说发心大的讲得好。请问师父是否属实？</p></div><p><br /></p><br /><div><p>答：属实。每一个人当下都有无量的化身，在特定的时间、空间，我们相互在一起。我跟你们都是平等的，那么你梦中梦到父母亲戚呀，这些事情都是真的，不要怀疑！</p></div><br /><div><p>314.为何会有的发了心事业就一帆风顺、心想事成，有的仍然有一定阻力？</p></div><p><br /></p><br /><div><p>答：这个问题要讲清楚。有些人确实真正发了菩提心，但事业不顺利，在佛法里有四个字，注意，叫：可允则允。也就是你虽然发的是真心，但你事业发展起来以后，其中会遇到重重障碍，起到反作用，但是我们在凡夫位不知道。这个时候，我们一定要坚固信心，不要怀疑！</p></div><div><p>在民国时候，有一位在家居士发心，求观音菩萨帮忙，要到一艘轮船上当一个会计，当时能谋到这一份工作也不简单呐，他没有求到，给个坏人求到了，所以他怎么也想不通：我一生行善积德，求观音菩萨帮忙，没有帮到。你不给我给个好人也行啊，怎么让一个坏人占了这个位置？当轮船开出到晌午的时候沉没了，他当下赶快向观音菩萨忏悔。你发了这个心，就有功德，不一定事情成了才有功德。不在今生就在来世，不在明天就在后天，不在这件事就在那件事，一定要深信不疑！</p></div><br /><div><p>315.有法师说：即使懂法了，也要出家，不然生死难了，就是生死了了，品位也不高，请问是这样吗？</p></div><p><br /></p><br /><div><p>答：半对半不对。把如来藏大法听懂了，就能了生死，不一定要出家。有些人在家护法比出家弘法功德还要大，不能一概而论。</p></div><br /><div><p>316.如何理解万法皆空，因果不空？</p></div><p><br /></p><br /><div><p>答：这个万法皆空，是说万法都没有它的自性，这是方便说。因果不空这是真实说，成佛要学佛，做人就学人，修人因得人果，修佛因得佛果，修菩萨因得菩萨果。</p></div><br /><div><p>317.过去所学法门讲记、光盘等如何处理比较如法？</p></div><p><br /></p><br /><div><p>答：你可以送到一些寺庙去，让有缘人去看。它最起码也是劝人行善积德，也有功德。如果已经损坏不能继续流通的，你以恭敬心，在清净处用火把它焚化掉。火呢，越小越好，减轻杀生。</p></div><br /><div><p>318.有的同修学了一心三藏，认为天下就是一家人，你的也是我的，我的也是你的，穿鞋不分你我，吃饭不分你我，用东西不分你我，这样行为好不好，对不对？</p></div><p><br /></p><br /><div><p>答：好不好，对不对。（众笑）看你怎么样用心，是不是啊？要是现在我的东西给你，大家都是一家人，就对了，是不是啊？噢，你的东西给我，这里的别墅归我了——这个就不好，是不是？佛法不坏世间法。你别给人家造成烦恼，要会用心！</p></div><br /><div><p>319.如果一个人不清净，总是有无形的众生给他现不好的景象，该如何对治？</p></div><p><br /></p><br /><div><p>答：自己发大心发光明的心，它想来找你都找不到。你不管在任何环境之下，佛来佛度，魔来魔度。讲一句不见外的话：凡是有附体的人，大都心量很小，别看他讲经天花乱坠，实际习气很重。要自己忏悔，跟众生和解。</p></div><br /><div><p>320.附在法华弟子身上，吸食精气的果报真的在地狱吗？</p></div><p><br /></p><br /><div><p>答：真的。所以这些附体的鬼神仙类的众生，百千万亿年修行能得到这种功能，是一种人天福报，可是种瓜得瓜，种豆得豆，你将来要偿还。希望这些众生，能听法师的开示，尽快离开你所附的众生，随观音菩萨、韦驮菩萨去修行，或者随我修行，我走哪里你们跟哪里，不缺吃喝。</p></div><br /><div><p>321.《楞严经》上有多次讲到「本如来藏妙真如性」。</p></div><p><br /></p><br /><div><p>答：天地万法都是一个人一个念变出来的。用分别法来讲，那一个念就是空如来藏变出来的；用圆顿大法来讲，没有哪一法不是哪一法，非分别非不分别，非无分别非不无分别。大家注意看啊，现手掌，你心能不能看到拳头啊？拳头当下就是手掌，手掌就是拳头，这就是圆教的妙真如性。一见一切见，明白了吗？</p></div><br /><div><p>322.我们在修净土时曾发愿要弘扬《无量寿经》和《地藏经》，现在我改学《楞严经》《法华经》，发心要弘扬《法华经》《楞严经》，这样算违愿吗？</p></div><p><br /></p><br /><div><p>答：这样就是更好地弘扬《无量寿经》和《地藏经》，回小向大，回少向多，回不了义向了义。</p></div><br /><div><p>323.我们每次超度亡灵，不知有用吗？</p></div><p><br /></p><br /><div><p>答：不能一概而论。我们做三时系念，有无量的天仙鬼神大众随阿弥陀佛「开路」。在座的同修，要尽自己的一份能力，为我们的历代宗亲、冤亲债主写个牌位。为什么呢？有些天仙鬼神大众，不需要牌位，叫他来他就来，一听就往生；有些跟人一样，非常爱面子，看到没自己的牌位，头一摇就走了。</p></div><br /><div><p>324.人的俗名也是因缘吗？有人说会对一生都有影响，是吗？</p></div><p><br /></p><br /><div><p>答：是的，都有因缘。而且你的名字，不全是你父母起的，或者师父取的，冥冥中就有种力量在加持！打个比方，现在这里五百多人听课，我们会不会同一时、同一分、同一秒往厕所里挤？过去不会，现在不会，将来永远也不会。比如说，太仓有一百万辆汽车，他会不会在同一时、同一分、同一秒，通通同时从市政府门口经过，会不会？不会。这就是在冥中还有一种力量在调控我们。</p></div><br /><div><p>325.当地的水陆法会、地藏法会，能参加吗？</p></div><p><br /></p><br /><div><p>答：不能一概而论，要看主法的和尚有没有道行，很重要。</p></div><br /><div><p>326.最好的修行心态是什么？</p></div><p><br /></p><br /><div><p>答：放下我执，听闻一心三藏。时刻用一心三藏来待人接物，来调理我们周边的环境。到哪里我们要适应环境，而不是环境适应我；包容人事，而不是人事来包容我，这是最好的心态。</p></div><br /><div><p>327.请师父深入开示定数和变数。</p></div><p><br /></p><br /><div><p>答：所谓定数，前世之因，今世必受果报，这是定数。我们今生今世有多大寿命，获得多少财产，是健康还是多病，能过30岁还是50岁还是1岁，这有定数。95%的人逃不过定数，怎么也逃不了。该你今生得100万，昨天晚上发了1000万，可能明天早上一下子就莫名其妙地会丢掉，不要以为到手的钱就是你的。这就是定数。该你死在水里，你绝不会死在岸上，这是真的。</p></div><div><p>我们村里一家人，儿女好几个。看相的跟女主人讲，别看你子女多呀，你死的时候谁都见不上面，而且是死在水里。家人听了，心里暗暗好笑，我们这么多儿女，妈妈还会死在水里？还见不上儿女？怎么可能呀？结果呢，30年以后，妈妈在房间里洗澡，儿女在外面打麻将，她死到洗澡间了，谁都不知道。</p></div><div><p>什么叫变数呢？你们今天在这里听了一心三藏，把你们无量劫以来的定数推翻！算命的人，他只能看到定数，他看不到变数。</p></div><div><p>想发财的人，跪在佛面前发愿：我要把今生得来的百分之三十、百分之五十、乃至百分之七十供养正法道场——你本来这一生只能发几百万，结果呢，几千万、几个亿都有可能，你信不信？有些人本来今生今世是个短命鬼，当下桌子一拍：我要剃头，出家修行！他就变成长寿，这是真的。举头三尺有神明，人在做天在看，明白吗？能修行是智慧。没有智慧的人，他修的是恶行，一天到晚想的贪嗔痴，越修寿命越短、病越多、钱越少，来世更加糟糕。这就是定数和变数。</p></div><br /><div><p>328.请开示：若诸比丘，心如直弦，一切真实，入三摩提，永无魔事。</p></div><p><br /></p><br /><div><p>答：怎么「心如直弦」呢？天地万法都是一个人一个念变现出来的，中间没有一点点歪曲，真就是真的，没有一点点妄。你不明白这个道理，你总是弯弯曲曲的，什么真呀、善呀、恶呀、大呀、小呀、多呀、少呀，无数的分别执著。明心见性的人，真善美、美丑恶、大小多少、红黄黑白，是不是都是一个人一个念变现出来的？这叫直弦。一真一切真。</p></div><div><p>「入三摩地，永无魔事」，这是性定，自性本定。佛来佛度，魔来魔度，天来天度，鬼来鬼度。而且呢，还是度而不度，你度谁呀？他就是你自己，是不是？真正明心见性了，你就是身上有几百个附体，你会不会生烦恼呀？就是痛苦也要生欢喜心，正好一起学《法华经》；我一个人成佛了，你们也成佛了。</p></div><div><p>如果我身上有一百个魔的话，将来这都是我的学生，都是我的弟子。这个世界上没有人会吃亏，也没有人会沾光。一万个魔附在你身上，你肯定感到不舒服，但吃苦就了苦，积点功德。</p></div><div><p>你可不要这样——师父呀，你赶快把我身上的魔去掉吧！念咒把他赶走吧！或者做法会把他赶走吧！——你赶不走的，你越赶他走，他越跟你作对。你越生欢喜心，慢慢地你的心量开了，他也开了，你就不会感到难受，当下他们都会变成你的护法，明白吗？要用好自己的心，处理好与各种附体的关系。他没有这种缘份，不会上你的身。</p></div><br /><div><p>329.弟子每一次听恩师讲经，都觉得明白了，可是一转身又忘记了？</p></div><p><br /></p><br /><div><p>答：明白了是我们的自性，忘记了也是我们的自性。不要说你会忘记，我比你还要会忘记呀。这么多弟子，我一见熟得很，一转眼都忘记了，如果不忘记的话，我还能活吗？听经，你听明白了就好，将来你一看到极乐世界就懂。</p></div><br /><div><p>330.有一个老太看师父光盘一段时间，结果在没有任何人送往生的情况下自然往生，身体柔软，皮肤柔软。请问师父，这个老太是看懂如来藏当下往生的，还是后来往生的？</p></div><p><br /></p><br /><div><p>答：这个人是往生以后去死的，她看懂了光盘即已往生。</p></div><br /><div><p>331.出家后在寺院里感觉不自在，越修越有烦恼、不开心，在世间和山河大地在一起，再苦也开心，就那么自在，这是什么原因？</p></div><p><br /></p><br /><div><p>答：这就是你的业障。在寺院感觉越不开心的时候，就越是成就你的时候。当没有人管你，没有矛盾现前的时候，你那种自在就是一种苦果。刚才讲了，我们要包容人事，恒顺人事，忍辱这一关你过也过、不过也过，你没有办法不过，你回避不了的！</p></div><br /><div><p>332.若在修行、打坐或在梦中，见到金光或是佛菩萨显相，该如何辨别其形相是真实的还是由妄我来变现的？</p></div><p><br /></p><br /><div><p>答：如果你是明心见性的人，这都是真实。佛来佛度，魔来魔度，鬼来鬼度，天来天度；如果你是没有读《法华经》《楞严经》，没有明心见性的人，佛来佛斩，魔来魔斩，你不要理睬他。否则，你会走火入魔。</p></div><br /><div><p>333.《法华经.方便品第二》，世尊明明说：佛曾亲近百千万亿无数诸佛，尽行诸佛无量道法。就是说觉悟的人都是从为人民服务的实践中来。从阿弥陀佛十劫于五浊恶世发四十八大愿，到普贤菩萨发愿「誓于五浊恶世尽行菩萨道」；从世尊为迦叶授记，到为五百弟子授记，都表明世尊的本怀，揭示真理的唯一目的，是让一切众生都发大乘菩提心，大家一道沿着成佛的道路去实践落实。你怎么可以大言不惭，当下明白就成佛呢？如此戏论真理，非为正信！</p></div><p><br /></p><br /><div><p>答：好好看看《法华经》《楞严经》。佛再三讲，明白道理当下成佛。《楞严经》讲「发明便解脱」；《法华经》讲「一念信解，蒙佛授记」；《心经》讲「照见五蕴皆空，度一切苦厄」；《阿弥陀经》讲「已发愿已往生，今发愿今往生，当发愿当往生」。《法华经分别功德品第十七》一开头，释迦牟尼佛就告诉弥勒菩萨，我讲了《如来寿量品》十五分钟，五百万亿那由他恒河沙众生证无生法忍，十倍这样的菩萨证到初位菩萨，百倍千倍证到行位菩萨、向位菩萨，一个太阳系一个银河系微尘数的菩萨证到八地菩萨、九地菩萨乃至等觉菩萨……印光大师讲：法华奥典，妙冠群经。闻即往生，位齐等觉。这是谁在戏论真理啊？</p></div><br /><div><p>334.既然万法万物都是一真之人一念所随缘变现的假象，那为何说真人变现出来的梦境又是真的呢？</p></div><p><br /></p><br /><div><p>答：我们生活在无量法界，梦法界、醒法界、半梦半醒的法界，都是我们一念变现。既然是变，就有无量百千万种形形相相，做人做鬼做畜生，做梦不做梦，你是你，我是我，他是他，梦是梦，醒是醒！既然是现，就没有哪一个不是哪一个，一真一切真，一假一切假。变就是森罗万相、天地万法，无分别不妨分别；现就是一，没有谁不是谁，分别不妨无分别。这是辩证的统一。</p></div><br /><div><p>335.明白了如来藏，一切法都是《法华经》，是否一切法都是我们的一真之人变现的？并不是说明白了如来藏，《阿含经》也变成了《法华经》，对吗？</p></div><p><br /></p><br /><div><p>答：也对也不对。心现识变，既然讲识变，就有无量啊，有《法华经》《楞严经》《阿含经》，有《圣经》《道德经》、儒经，黄金白银经、吃饭经，还有西瓜经、苹果经、戒指经、耳环经，牛屎狗粪经、狗屁经、马屁经，都有；你不能讲都是一，这是变嘛。不要忘记了还有现，变来变去都是一个东西现的，既然现，你就不能讲不是一，这个时候，你讲《阿含经》，西瓜经，苹果经，都是《法华经》。你不能讲是，也不能讲不是。但是明白道理的人，能把任何经讲成《法华经》，又当别论。问题是，你明白道理了没有？</p></div><br /><div><p>336.请开示，「知见立知，即无明本，知见无见，斯即涅槃」；如何入首楞严大定，如何保持首楞严大定？</p></div><p><br /></p><br /><div><p>答：「知见立知」，这个知见，是我们的真心本来面目，它本来就是明的，由于无明妄想出来一个念，这个念就开始带妄显真，把真正的知见隐蔽起来，虽然隐蔽起来了，蛛丝马迹，它仍然能带妄显真，叫知见立知。立见的知，就是无明本。「知见无见，斯即涅槃」，把那个见去除了，你就了生死。</p></div><div><p>比如说，我在2005年到山西省阳曲县传法，69岁的老居士说：「师父，有个事情我到现在都想不明白。有一天晚上，我一边念阿弥陀佛，一边画道道，画到晚上9点多，清清楚楚，明明白白。老婆一开门，叫起来，‘黑咕隆咚，你在干什么？’当下我两眼什么也看不到了。」当我们专注一处不打妄想的时候，我们的心本来就是亮的。当有了妄想，心一下子就变黑了。</p></div><div><p>有什么妄想呢？地球人的同分妄见，认为到了晚上9点多一定是黑的，所以这就是黑的，是不是？有了灯才能亮的。我们的心本来就是亮的，那认为一定要借灯才能亮，那个借灯的念就是无明。这是打比方，也是传正法。明白这个道理，你就入首楞严大定。</p></div><br /><div><p>337.我们既然都是一个东西，为什么各人因果各人了呢？</p></div><p><br /></p><br /><div><p>答：这属于还没有听懂。我们既是一个东西，又不是一个东西，明白吗？分别不妨无分别，无分别不妨分别。要悟进去。</p></div><br /><div><p>338.听说中阴身期间，有一个意生身，同样有六识的各种作用。那么如果一个明心见性的人，意志不坚定，到了中阴身，请问，他如果生前什么都没有改好，这个时候会不会跟意生身的习气相应，然后不由自主地随业力轮转？</p></div><p><br /></p><br /><div><p>答：不会。而没有明心见性的人，一定是随业力轮转。</p></div><br /><div><p>339.没开悟的人，做遗体器官捐献，可以吗？</p></div><p><br /></p><br /><div><p>答：可以，行善必得善报。</p></div><div><p>中阴身期间，解剖死者遗体，他会不会生烦恼？</p></div><div><p>答：中阴身期间得到佛力特别加持，他不会生烦恼。</p></div><br /><div><p>340.众生均在定中，只是妙用不同，这句话对吗？</p></div><p><br /></p><br /><div><p>答：对。禅定有无量，真善美禅定、贪嗔痴禅定、佛定、菩萨定、天定、人定、鬼定、畜生定，定就是我们的习气而已。能做鬼、做畜生，能四条腿爬，是不是妙用啊？两只翅膀一张飞起来，是不是妙用啊？只是我们选择而已，你觉得做猪做狗的那个妙用不快乐，你就选择做人呐。做人这个妙用也不长久，来世可能也要做狗做马，那就选择做菩萨呗。想做佛菩萨，就选择楞严大定；你选择做人做天，就选择行善积德这种定；你想做鬼做畜生，选择贪嗔痴这种定。各人自在选择。</p></div><br /><div><p>341.既然我们是佛，为什么沦落为众生还回不去？</p></div><p><br /></p><br /><div><p>答：在没有明心见性，没有解脱的时候，我们是愚痴的佛。等我们明白了道理了，成了智慧的佛，就可以上去。上和下是方便说，没有上、没有下。你现在明白了，现在就是快乐的佛！</p></div><div><p>佛是一种智慧，是心态的改变！一个真正把自己的生命、财产，发愿来供养一切众生、供养如来家业的人，他在哪里不快乐？懂得了如来藏的道理，首先解除了对死亡的恐惧感，是不是最大的快乐？减轻了对烦恼的执著，减轻了对人我是非的执著，是不是很快乐？</p></div><div><p>回不去——你要回哪去啊？这里就是极乐世界，极乐世界就在你肚子里，信不信？在你耳朵里，信不信？《楞严经》讲，芥子包虚空，你以为这个世界有多大？要讲大，无穷无尽、无边无际，要讲小，一个芝麻皮都没有那么大，明白了吗？我们这个心，想大就大，想小就小啊！在你的眼睫毛里，就有无量国土的如来在开大法会，这是真的！要解脱，就是靠我们的智慧！</p></div><br /><div><p>342.大乘佛法如何与传统文化圆满？</p></div><p><br /></p><br /><div><p>答：大乘佛法与一切文化、非文化都能圆融，何况是传统文化呀！很简单，传到哪里，统到哪里！传到哪里？传到一心。统到哪里？统到天地万法！如果没有大乘佛法，他仅仅传到自己老爸老妈，统到左邻右舍，是不是？他不会统到牛马猪羊，就这样来圆融。</p></div><br /><div><p>343.在家修行和出家有什么区别？</p></div><p><br /></p><br /><div><p>答：不能一概而论。有些人在家修行更加有利于弘法；有些人适应于出家修清净心。</p></div><br /><div><p>344.追求神通的有些师父被外道迷惑，如何挽救他们。</p></div><p><br /></p><br /><div><p>答：度化这些人比较困难，劝多少算多少。</p></div><br /><div><p>345.写在牌位上的亡灵，通过明天的超度，以后还要再超度吗？</p></div><p><br /></p><br /><div><p>答：要看情况。有些能直接到极乐世界，有些能超生到天界，有些能转世到人道。即使往生极乐世界，再次超度的功德也给他提升品位。无量的天仙鬼神大众都是我们过去世的父母尊长，你不会花冤枉钱。</p></div><br /><div><p>346.如果精进容易着魔，懈怠又容易堕落，那日常生活中如何把握自己呢？</p></div><p><br /></p><br /><div><p>答：要学懂《楞严经》。明心见性了，精进也好、懈怠也好，怎么样修都能了生死。</p></div><br /><div><p>347.请问我们明白了一心三藏圆顿大法，用不用每天忏悔和发愿呢？</p></div><p><br /></p><br /><div><p>答：不需要。你明心见性了，当下就已经回向了天地万法。</p></div><br /><div><p>348.一位上师说，只有大根器之人才能在家修行成就，一般人得出家才行。</p></div><p><br /></p><br /><div><p>答：这个对小乘法来讲是需要的，对于大乘法来讲，没有这个条件，在家出家都能成就。</p></div><br /><div><p>349.成佛究竟是什么样的过程？</p></div><p><br /></p><br /><div><p>答：明白这个道理就成分真即佛，然后再勇猛精进，修各种法门成圆满之佛，就是这个过程。</p></div><br /><div><p>350.请问法师，「一实相印」是什么？</p></div><p><br /></p><br /><div><p>答：一实相印，你知道天地万法、过去、现在、未来，东南西北，上下十方，都是当人当下一念变现，就是观世音的「世」，就是十劫的「十」。一时就是无量时，一处就是无量处，一人就是无量人，这叫一实相印。</p></div><br /><div><p>351.有小孩要考试的时候，我们在家念什么样的经好？念了有好处吗？</p></div><p><br /></p><br /><div><p>答：念《法华经》，并回向给孩子能够正常发挥，不要受到干扰，只能起这个作用。</p></div><br /><div><p>352.佛预言：将来《楞严经》会从娑婆世界消失，师父却要求弟子生生世世受持此经，那岂不是违背了佛的预言？</p></div><p><br /></p><br /><div><p>答：没有，佛高兴还来不及呢。要知道佛的良苦用心，佛是激将法！佛法已经进入末法时代，佛在《法华经》五次提出在第五个五百年（就是我们现在这个历史阶段）有菩萨来弘扬《法华经》，天上天下，诸佛如来、菩萨天人、护法神明要全体出动来护法，〈药王菩萨本事品〉两次提出，〈普贤菩萨劝发品〉三次提出，此经要成为必修课！</p></div><br /><div><p>353.想听经闻法，却又脱不开世俗家庭，该如何是好？</p></div><p><br /></p><br /><div><p>答：这样也很好啊，随缘度众生，把你家庭变成道场；像常不轻菩萨一样，把你身边的亲人都度过来，一次不行两次，两次不行三次，至百次、千次。在家里照样可以度众生，首先成就自己，为什么度不了众生？因为我们自己在搞迷信！</p></div><div><p>其实众生都好度。我在很多地方，把那些从来不信佛、坚决诽谤佛法的人，让他当下信佛，当下印证自己成佛。打铁首先要本身硬，几十年来度不了家人，就是因为你在搞迷信，不懂得什么是佛法。只要我们正信佛法，没有度不来的道理，好好想一想。当然也有极个别的人，你怎么样讲也不相信，那是万万分之一而已。</p></div><br /><div><p>354.学这个法如果没有条件，在家没有人时播师父的讲座，那些鬼神会听到吗？</p></div><p><br /></p><br /><div><p>答：会听到。不仅鬼神，连泥巴瓦块也能听到，风云雨雾能听到，要深信不疑。这些无情接受了佛法，以这种潜移默化的功德，它能在一定的时间空间里由无情转为有情。包括水果、桌椅板凳都能接受正法的熏陶。要深信不疑呀！</p></div><div><p>为什么佛说，你赞叹一句《法华经》，即为供养一切佛？这个「一切佛」就包括泥巴瓦块有情无情万法，这是真的。这些无情的众生听到佛法，最起码感到轻松愉快，它的磁场也会给你正能量。</p></div><br /><div><p>355.愿身再来的菩萨有可能前世是畜生道吗？</p></div><p><br /></p><br /><div><p>答：有可能。畜生道、鬼道、神道众生，包括亡灵妖魔鬼怪统统在内，这些无形的众生，他们都有五种神通，一旦接触正法，很容易当下成为明心见性的菩萨。或者到佛土去，或者愿身到人间。</p></div><br /><div><p>356.假如听到有人过世或是出了车祸，是不去理会，还是从心里想让出事的人去道场听经呢？</p></div><p><br /></p><br /><div><p>答：应该持第二种心态，加意念让他来道场听课就行。</p></div><br /><div><p>357.请师父用「拳掌大法」给众弟子开示双遮双照？</p></div><p><br /></p><br /><div><p>答：有智慧的人，眼睛看手掌，心能不能看到拳头？这叫一遮一照。手掌变现为拳头，也是此理。这叫双遮双照。藏教菩萨执相昧性，也就是眼见掌而心看不到拳；通教菩萨执性昧相，他连三十二相都判为无明相，只知空性，不知有性，在佛法里说为偏空涅槃，到了《楞严经》把它说成邪法，即「言妄显诸真，真妄同二妄」。特别是通教的要注意，垃圾堆、乌云、毒药水是不是大光明藏啊？也是大光明藏。</p></div><div><p>最近有菩萨在家里看到佛给他讲话，看到大光明藏，看到满天霞光，就是没有看到满天毒雾，臭气烘天。他把这些东西给排斥在外，这就是一种邪法。最多只能不落三恶道而已，何况是没有明心见性之人呢？</p></div><div><p>《楞严经》要好好看，是非好坏，香甜苦辣，都是我们一念变现。不要只执著于所谓的好东西，不理会所谓的坏东西。《法华经》有月光三昧，那个月牙，大半月亮是不是月亮？那么初一、三十没有月亮，黑月亮是不是月亮？跟白月亮是不是一个东西？白月亮有没有多一丝一毫？黑月亮有没有少一丝一毫？这就叫宿王戏三昧。这叫双遮双照，在相见性，在性见相。真心本来面目，非相非性，现性现相，非遮非照，现遮现照，遮照同时。</p></div><br /><div><p>358.如来藏大法是很好，好比站在高山之顶，再也没有比这个法门更高了，但现在有的人学法先入为主，执著一个法门，是不是众生根机问题？我们怎么对待？</p></div><p><br /></p><br /><div><p>答：其实并不是众生的根机问题，只有习气问题。</p></div><div><p>第一，请看气球大手套。天人鬼畜，不管是没有根机的众生，还是有根机的众生，是不是都在这里（无量的手指头）？佛菩萨、祖师大德讲根机，那都是方便说，其实众生都是一个根机。</p></div><div><p>第二，经过我们十多年来的验证，即使不信佛的人，或是迷信佛法之人，只要听了如来藏大法，当下就能成佛。我们有许多光盘，可以检验。</p></div><div><p>所以没有什么根机好坏之别，只是习气问题，这些人把自己封闭住了，他不愿意听没办法；如果不愿意听，根机再大都没有用。对这种人，佛也不度，由他去，没有必要过分求他。</p></div><div><p>我们无量劫以来浪费了百千万亿年的时间，今生今世浪费了多少年多少月，就这几天，即使我在讲邪法，你来听一听，我错在哪里？你们以慈悲心来帮助教育我，难道不行吗？难道舍不得吗？我们自己要放下烦恼习气，放下我执，山外有山，天外有天！不要自己障碍自己！</p></div><br /><div><p>359.去别人家吃饭，人家硬要夹荤菜给你怎么办？我们心想着这等同于吃我们身上的肉，专心念佛让它们往生西方净土，可以吗？</p></div><p><br /></p><br /><div><p>答：可以，这叫开戒，不是为了满足自己的口腹之欲，而是为了不让别人生烦恼造业。我们在特定的时空情况之下，可以吃肉边菜，乃至吃一块肉，喝一点酒，没有大碍，但你用心要真。有道无道，自己知道。</p></div><br /><div><p>360.《楞严经》里佛说的「虚空方圆」，怎么理解呢？</p></div><p><br /></p><br /><div><p>答：以金为器，器器皆金。虚空方圆，你看方器里虚空是方的，圆器里的虚空是圆的，其实虚空哪有方圆？是众生在相上执著而已啊。万法都是一个念变现来的，哪有佛？哪有鬼？哪有人你我他？我们不能执著这是天人鬼畜，那是泥巴瓦块，但是你也不能讲这个就是假的，他也是真心变现的。但没有无分别法你就不能开悟；没有分别法你就不能度化众生，不能增上品位。要明白，真心本来面目非空非圆，可以现空现圆。</p></div><br /><div><p>361.明知道修行在于修心，但对于情执就是难以割舍，内心矛盾对抗。</p></div><p><br /></p><br /><div><p>答：多看讲记，多观照，就会慢慢看淡这些。</p></div><br /><div><p>362.在日常生活中怎样认真对照，充实自己，圆满自己？怎样彻底明心见性？有时遇境界又会被转过去，对自己做法也不满意，但又很矛盾，该怎么办？</p></div><p><br /></p><br /><div><p>答：由他去，别管他，真正明白如来藏道理的人该吃就吃，该睡就睡，习气能在潜移默化中改掉。当然，严格要求自己，会改得快一点。改得越彻底，品位提升得越快，提升越高。</p></div><br /><div><p>363.念佛应该怎样观照才算是如理如法？</p></div><p><br /></p><br /><div><p>答：念佛，你懂得万法都是你，拜法界佛，拜虚空佛，这就有功德；你认为佛只是在天上，认为极乐世界仅仅在西方，这样拜有福报，没有功德，不能往生；以轻慢心拜佛，就算磕头如捣蒜，走路都喘气，这是轻慢佛，没有功德，也没有福报，这是罪过。</p></div><div><p>自己要把持好，没有时间就不拜佛，一切佛就是一个念，这就是最好的念佛，最好的拜佛，是时时提起观照，端起饭碗是我吃饭还是饭吃我？这就是念佛，大米是谁？这就是念佛拜佛。圆顿大法，触目菩提，大至佛刹，小至微尘，无非诸佛法身常！看到一条狗，看到一只鸡，阿弥陀佛。这就是念佛，这就是拜佛，看到在杀猪宰羊，那个肉鱼琳琅满目，你在那里念阿弥陀佛，给他回向，这就是念佛，这就是拜佛。</p></div><br /><div><p>364.有两个人，一个缺了一条腿，一个是疾病染身，不能行走，就在家念阿弥陀佛，很认真，但是不学法，不懂道，年纪也大了，就知道念佛，请问这样的修行能成佛去西方极乐世界吗？</p></div><p><br /></p><br /><div><p>答：不能。没有任何可能，因为不懂得佛，这样的人你可以去给他讲如来藏的道理。</p></div><br /><div><p>365.听其他法师说，人死如生龟剥壳，动一下都很疼痛，并且生嗔恨心，因嗔恨心故，此人死后会下地狱，是这样吗？如果是这样，死后捐献身体或器官不是不妥吗？</p></div><p><br /></p><br /><div><p>答：明心见性的人是已经成佛以后去死，又当别论。没有明心见性的愿意捐助器官，就是疼痛下地狱，到了地狱门口他仍然还会回到天上来。释迦牟尼佛当年因为嗔恨心踢他母亲一脚，死后下地狱，本来有慈悲心，见到地狱里抽筋剥皮又生慈悲心——我能代替他们受苦就好了——还没有开口讲话，就飞到天上去了。因为他的心与地狱的气氛不融合。</p></div><br /><div><p>366.动物是不是和人一样都有隔阴之迷呢？包括鬼道、地狱道、天道。</p></div><p><br /></p><br /><div><p>答：不一样。有些动物没有隔阴之迷，还有宿命通；鬼道、神道的宿命通也根据各自修行不同而层次不一样。有些外道一念可以知道八万大劫之内的事情，有些鬼神能知道前三世、前一百世、前一千世的事情；就是菩萨位，宿命通和天眼通因人而宜，等级也不一样。</p></div><br /><div><p>367.有很多同修得不到清净心，各说各有理，这恐怕误导人家。如来藏大法这么好，正法住世是我们目前的头等大事吗？</p></div><p><br /></p><br /><div><p>答：对，这个世界上只要有一个人能把如来藏道理讲清楚，就是正法住世，就会得到天上天下龙天护法。我们要用好自己的功，还要帮助众生，关心地球这片国土。劝更多的人不要杀生！减轻众生与众生之间的这种命债，地球周围的大气层、风啊、云啊，雨啊，雾啊，都是我们的心在变现，懂得这个道理至关重要！至于如来藏的道理，我们要大力宣传。这是我们的责任，这是我们的任务。</p></div><br /><div><p>368.睡觉时心马上进入另一个空间另一个世界，梦境有时在道有时不在道，这对明心见性的人来讲有没有影响呢？对中阴身有没有影响呢？</p></div><p><br /></p><br /><div><p>答：没有影响。明心见性的人当下已经成佛，他没有中阴身，我们把它方便说为中阴身。如果他自己愿意要一个中阴身又当别论，他不愿意直接到极乐世界去，先到天道看看老朋友们，到地狱道鬼道再看有没有亲人给他们帮点忙，那就又当别论。因为梦境也是我们六种意识心，所以断气以后六种意识心，包括梦里的心没有了，解体了，他没有办法干扰我们。</p></div><br /><div><p>369.有人发愿说：弟子特别羡慕师父吃苦耐劳的道力，而自己的德行不好，道力不深，来世在极乐世界肉身佛身边继续进修到圆满佛，再出来讲《法华》《楞严》普度众生，这样想可以吗？能满愿吗？</p></div><p><br /></p><br /><div><p>答：不能满愿。不可能，因为你不到娑婆世界来与众生了缘，你就不能圆满成佛。讲的不客气点，愿身再来其实是不得不来。这是方便说，真正到了那个情况之下，不要人劝你，你就知道来；你在阿弥陀佛身边能吃能睡，搞上三天你就会很无聊，这是真的。你在佛土现无量色身三昧，给谁看呀？人家比你不差，给自己看，两三天就无聊了；才想起来开了天眼，开了慧眼，那么多人过去都是我的缘份，有好有歹，去帮帮他们，劝劝他们，自然就来了，明白吗？到时候不要人劝，你到了佛土自然就会愿身再来。</p></div><br /><div><p>370.一位菩萨遇到这样一件事，合同未到期，房东反悔了，无故不租房了，而且房东还诬告他，租这个房子是开工厂的，这样一来就严重影响各位菩萨的生计了，他有些想不通。</p></div><p><br /></p><br /><div><p>答：这个应该懂得，有前世的过节。这个世界上没有人吃亏，也没有人占便宜，要想得开。即使你前世不欠他，他这样对待你，他来世要还你，不必为此而怨天尤人。今生今世该有多少寿命，该做多大官，该发多大财，前世已有定数。他这种做法并不能改变你今生今世的财产，但是今生今世真发愿在佛前许愿，乃至明确规定百分之几十供养正法道场，变数可以改变定数。发财靠发心，靠布施，自然就有护法神明暗中调理。</p></div><br /><div><p>371.当我们到人家家里送往生，看到一个人死了，他们用两根香火对牢一看，就说他已到西方极乐世界，难道他们有这么大的本事吗？</p></div><p><br /></p><br /><div><p>答：不能讲他们有，也不能讲他们没有。菩萨下位不知上位，这个世界上各种法门都是真实，他有的就可以通过香火看到信息，我亲眼验证过。</p></div><br /><div><p>372.有一批居士听到某某领头人说，来不及了，只要念一句佛号就可以到西方极乐世界了，其它戒律佛法都不要学，这是原则问题，对不对？</p></div><p><br /></p><br /><div><p>答：这是原则问题。但我看了那么多一句佛号的人，没有一个人让我感到来不及的气氛——来不及的话，你应该吃饭、穿衣、走路都在念佛，其实不是那样，这是借口。这一句佛号能不能往生，不能一概而论。懂得了一句佛号，你就能往生。</p></div><br /><div><p>373.人在临终时，被别人动了身体，会产生嗔恨心堕入地狱，这样的人我们给他开示如来藏法义还有作用吗？</p></div><p><br /></p><br /><div><p>答：如果他已经入了地狱，可能效果有限，所以人在临终的时候不要轻易碰他。</p></div><br /><div><p>374我们把一心三藏的真实法义给水陆众生讲明白了，它们能离苦吗？能成就西方极乐世界吗？</p></div><p><br /></p><br /><div><p>答：在畜生道的众生比较复杂。因为智力障碍太大，语言没有办法沟通。有些有修行的众生灵性高，特别是乌龟、王八、蛇、狐狸这类众生，他往往比人成就还要快，低等智力的众生就很麻烦。</p></div><br /><div><p>375.大家都说念佛能治病，那我现在有个邻居也信佛，浑身有病，胃病、心脏病、糠尿病，请问此人是否要看医生呢？还是只要听闻如来藏大法，老实念佛就能好呢？</p></div><p><br /></p><br /><div><p>答：这要看他会不会用心。明白如来藏大法，会用心，还要有耐心，就能好。我们这个心能叫肉身飞起来，病怎么就不能好啊？对于有些人来讲，还是要到医院去看，他没有这个信心。</p></div><br /><div><p>376.密法中有本《中阴听闻救度法》，书中讲了中阴七个周期49天，其中前两个周期，每天都有佛菩萨来接引，现化出双身像和种种光，现已拍成影片，请问师父，真能如说示现吗？真能这样救度吗？在佛教发展史上有没有修双身而成就的佛呢？</p></div><p><br /></p><br /><div><p>答：至于讲的中阴身期间的情况，我们不能肯定，也不能否定。这个道理应该是存在，至于他有没有这个功能，又当别论。因为在中阴身期间，他处于自由生命时期，那么我们以真诚心、恳切心，与诸佛菩萨沟通，诸佛菩萨就会慈悲加持。问题是助念的人有没有道行，他是不是一心一意的，这点很重要。</p></div><div><p>至于双身修法也是成就的一种法门，但即使是外道邪道，也把他作为下等劣法，这是很无聊的法。双身修法有严格的检验，男女二根放进剧毒毒液里，你能经受考验把它吸进去再放出来，并且毫发无伤，在烦恼没有烦恼，那你去练。可是有些不法之徒借助这种很无聊的法门来行贪嗔痴，吃喝嫖赌，必下无间地狱。要吃肉的，如果你没有分别心，能把钢筋混凝土吃进去，你肉照吃，我买给你吃。一些修行人以为修密法又可以吃肉喝酒，加嫖赌，还能成佛，想得太美了，没有这个道理，许多居士到最后成了神经病。</p></div><br /><div><p>377.有人说：一个歌妓开口就是兰花香，她前世也是修《妙法莲华经》的，但她这生还是一个歌妓。不是说听佛讲几个小时，几十分钟，乃至几句《法华经》就能蒙佛授记吗？</p></div><p><br /></p><br /><div><p>答：你怎么知道她不是菩萨再来呀？菩萨再来可以示现佛相、菩萨相、人相、鬼相，畜生相。或者，也许她前世没有把《法华经》读懂。</p></div><br /><div><p>378.家里人经常吃葱蒜，我已皈依，吃常年素，家里经常说我不吃肉，吃素一定要吃些葱蒜，对身体好；我不吃他们就不高兴，有时也吃一点，这样算破戒吗？</p></div><p><br /></p><br /><div><p>答：这个并没有破根本戒，对于一个明心见性的人而言，可以忽略不计。</p></div><br /><div><p>379.请法师慈悲开示，「当来世恶人，闻佛说一乘，迷惑不信受，破法堕恶道」。</p></div><p><br /></p><br /><div><p>答：不能信受《法华经》的人要下三恶道。除非你最后再把《法华经》看懂了，可以弥补罪过。</p></div><br /><div><p>380.一个神经病人，什么也不知道，如让他知道如来藏大法，他能往生吗？还有一个人临终时昏迷，给他开示如来藏在法，能往生吗？如何才能临终不昏迷呢？</p></div><p><br /></p><br /><div><p>答：能往生。《地藏经》讲得很清楚，「闻在本识」。他第六识不能听，第七识能听到，所以他能成就。</p></div><br /><div><p>381.我们在宣扬佛法时，会有一些人说如果大家都出家修行了，那地球上不就人类繁衍不下去了吗？没有后代了吗？为什么好多人修行而地球上人口却越来多了？还有佛法宣扬不吃肉，为什么动物会越来越多呢？</p></div><p><br /></p><br /><div><p>答：如果大家都出家的话，地球上没人了，那不正好嘛！成了天人了，怎么不好呢？还担心地球没有人吗？我们可以在各种空间里生存啊。你这个提法就没有道理啊。如果说地球上的人都不吃肉了，那还有可能外星的众生来投胎，是不是啊？天人往下落，三恶道的往上升，而你只看到人道众生越来越多，看到动物越来越多。</p></div><br /><div><p>382.我做了2次手指实验，3分钟后我其中一只手变长了大概2厘米多，但过了一会儿，就自动恢复原来的一样长了。请问师父，我没有任何的心念想它恢复，为何它就自动恢复了呢？</p></div><p><br /></p><br /><div><p>答：这个是因为我们的同分妄见，因为我们的同分妄见啊，它让我们手只能这样长，不能乱变化，那我们在一个特定的情况下，我们第六识特别的强烈，也可以长出来。你如果长期这样坚持的话，比如说你一天24小时当中起码有10个小时这样想坚持「长，长，长…」，那么一般地来讲你要注意，到了第二天来讲比如长了一公分，第二天可能缩回去九分还增长一分，每天这样坚持的话，它一步一步都会增长，这是我们的一种本性。</p></div><br /><div><p>383.我们新入门，应该怎么一门深入呢？</p></div><p><br /></p><br /><div><p>答：你们应该把如来藏这个法搞明白，这叫一门深入。天地万法都是一个人一个念变现出来的，既然是变你就不能讲是你，天人鬼畜、佛菩萨、泥巴瓦块无量无量，既然是现，那又不能讲不是你，都是一个东西变出来的是不是，还是一个东西呀。所以如来藏道理最重要，把这个道理搞明白了以后，你修起来任何法门都能成就，这叫一门深入。</p></div><br /><div><p>384.广州化州南山寺的仁焕法师皈命念佛法，就是靠阿弥陀佛本愿力把自己百分之百的舍命全交给阿弥陀佛，在那里通过皈命念佛法，通过法师的愿力可以把求往生者百分之百送到西方极乐世界，这种说法正确吗？</p></div><div><p>学了法华、楞严后有些疑惑，但又觉得靠佛的本愿力，还有靠法师和大家百分之百信阿弥陀佛的功德和心念，也是可以百分之百往生西方的，因为这个舍命全交也算是一种心法和心念，恳请师父解答。</p></div><p><br /></p><br /><div><p>答：这个问题呢很复杂，我不能讲他是真，也不能讲他是假。佛门有规距，下位不知上位，自位不知他位。《法华经》《楞严经》一心三藏，是基础法门。为什么呢？经典上讲的很清楚，这是初心修行人必经之路，这是凡夫起修或坏人救命的法宝，也是文殊菩萨讲的「十方薄伽梵，一路涅槃门」。</p></div><div><p>如果你是今生今世把法华、楞严搞懂了，你念佛求往生，那是肯定的，不用怀疑。而明理当下就已经往生，那么念佛求往生呢，他就提升品位。那么有些人虽然今生今世他没有修法华、楞严，你不能肯定他前世没有修过，或者他前世修过了，今生今世具有这样的根基，他念佛、拜佛就是能往生。</p></div><br /><div><p>385.行人有问:何谓禅茶一味？</p></div><p><br /></p><br /><div><p>答曰:禅者，弥也。茶者，陀也。一味者，阿也。弥陀万法，禅茶其中。无非一味，心现识变。</p></div><div><p>明得此理，在圣不增，在凡不减，空有不二，性相一如，当知世出世间唯一一阿弥陀也，当下证得万法皆阿弥陀佛也。</p></div><br /><div><p>386.师父好！是不是您讲的四部经典都得听吗？还是一修一切修？</p></div><p><br /></p><br /><div><p>答：我讲的这四部经典是圆顿大教的一个法脉。如果求自己成就的话，你看懂其中一部经典，乃至这部经的其中一段、一句话、一个字都会成就。如果想度化人，做一个合格的老师，或者想提升品位，那你当然把四部经学得圆融、圆满、圆通就更好，看自己的发心。</p></div><br /><div><p>387.每天晚上我都连续播放《法华经》视频给那些众生看，请问还需要在心里请那些有缘众生来听经吗？</p></div><p><br /></p><br /><div><p>答：那不需要的。那个视频一放，就代表你的心，他们都会来的。</p></div><br /><div><p>388.经常听出家师父讲一句「出家人四大皆空」，这个「四大皆空」该怎么理解呢？</p></div><p><br /></p><br /><div><p>答：这个四大皆空啊！就是讲禅宗的境界，四大是指地水火风。那我们人呢，就是由我们的心跟那个地水火风连持而为生命。那这四大呢，都是由我们的心变现出来的，因为我们迷惑颠倒，把这个四大当成自己的生命，贪着名闻利养，所以就在六道里轮回。为了解脱这轮回呢，修行人把这四大看破放下，叫四大皆空。</p></div><div><p>那么作为圆教菩萨呢，我们知道这个见空是真空，真空当下就是妙有。真正明白这个道理来讲，我们不需要把它放下，把它提起来，利用肉团四大这个法体来教化众生，就很好。</p></div><br /><div><p>389.身边很多师兄诵《法华经》，但是发现根本不懂一心三藏，这些诵经的人是不是只是能得到人天福报，种一个金刚种子而已，但是今生无法成就。</p></div><p><br /></p><br /><div><p>答：对，不读懂不能了生死。不懂《法华经》，你读了以后跟其它经也是一样，六祖慧能讲过：读经不解义，你怎么能成就啊？</p></div><br /><div><p>390.我们发愿随师父生生世世弘法，佛菩萨来世间自己知道吗？法华弟子的修证果位是直到生命结束到中阴身期间，现量功德现前才知道吗？</p></div><p><br /></p><br /><div><p>答：发愿弘扬《法华经》，自己是不是菩萨来到世间，自己应该知道，也会知道。在佛法里叫五分法身功德之一，叫解脱知见功德。怎么样知道，根据都在《法华经》。你听了《法华经》生欢喜心能受持，佛就讲了，你是在十万亿佛法中经历的老修行；你读懂了《法华经》，佛就给你授记，已经成分真即佛。</p></div><div><p>至于我们的果位在中阴身期间现量现前，我们在活着的时候就知道这个功德，这个叫比量功德。在比量功德的当下呢，我们就解脱了对死亡的恐惧，就减轻了乃至消除了一些烦恼，这本身就是现量功德。</p></div><div><p>那么最圆满的现量功德，比如千变万化的色身三昧，在中阴身期间必然现前，但是我们现在就知道它必然会现前。就比如说我们在房子里听到外面鸡叫了，打个比方，没有开悟的人，没有听懂《法华经》的人，他认为是飞机在叫。开了悟的人，听懂《法华经》的人，他知道是鸡在叫，他走到外面看到的就是鸡叫。所以圆顿大法呀，在见道位所看到的真如与在证道位所看到真如无二无别。所以在某种意义上，比量功德几乎等同于现量功德，无非是等了几天、几个月、几年最多几十年，你断气以后——哦，原来就是这样。</p></div><br /><div><p>391.我们无量众生都是来自最初的大光明藏，那我们修行的最终目标就是回到最初的光明藏吗？</p></div><p><br /></p><br /><div><p>答：不对。现代哲学讲「否定之否定」，我们从「原始佛」的位置堕落到「众生」，然后由众生，就是众生对我们自性本性的第一次否定，当我们再进行修行又回到自在佛的位置，这是第二次否定，否定之否定。看上去跟原始佛一样得到了自在，其实他中间经过了六道轮回，经过了无量的时间、空间，无量的因缘，他又增加了新的内容。就跟一粒种子一样，一粒种子比如说就是「原始佛」，经过它发芽、生根、开花后来变成了众生了，是不是这个植物对种子的否定啊？那到最后结出了许多种子，一粒种子变成十粒、二十粒，看样子跟原来的一样，其实一样不一样啊？</p></div><div><p>第一，数量变化了，第二，它经过了土壤、水分、阳光，一些人的种种劳动就是种种因缘。看样子像原来的，当然他已经不是原来的。所以当我们再证得佛的果位的时候，我们把他方便说为究竟佛，把原来那个佛的位置方便说为原始佛。这种说法是开方便门，既不可以当真，也不可以把它当假，只在于帮助我们开悟。</p></div><br /><div><p>392.怎样从由浅到深理解万法就是当人、当下、一念？</p></div><p><br /></p><br /><div><p>答：那我们想一想你现在这个人，是不是无量百千万亿年前的那个人？是不是？我们就是不生不灭啊！我们过去世中做过人，做过鬼，做过铁，做过乌龟王八，做过泥巴瓦块，那到现在我们是不是还是那个东西？那么再到未来，是不是？我们未来做鬼，做畜牲，做佛，做菩萨，是不是还是这个人？所以过去现在未来从时间上来讲是不是当下这个人，从天人、鬼畜、泥巴瓦块来讲当然它是不是只有你一个人？那么你是这样，他是这样，有没有哪个不是这样？我们大家都是一念变出来的，我的这个念，你的那个念，分开了，又不能分开，是这样理解，天地万法当下一个人一个念。那就从我们自己开始你自己就考虑往前往后想，往前多长时间，往后多长时间，往前你做过些什么什么什么东西，信不信？当然这个比方来讲啊，我讲到明天，我讲一百万年都讲不完。这个例子太多了，你们可以自己去依样画葫芦，这个问题也非常妙，其实也很简单。</p></div><br /><div><p>393.万法都是一念变现，如家人身体有病，那是不是也是我有这方面的问题？我怎么样念头能转换消除家人的病痛吗？</p></div><p><br /></p><br /><div><p>答：你不能。万人都是一念变再现，你记好，「变」和「现」两个字，既然讲「变」，你就不能讲，你就是我，我就是他，我就能叫他怎么样。因为它变了，变无量了，千变万化，无分别不妨分别啊！如果讲所有人都是一个人，那释迦牟尼佛一个人成佛大家都能成佛，释迦牟尼佛一个人没有变，其它任何人都没有变，这是不可能，因为在变。第二个讲「现」，既然讲现，你也不能讲不是一个人，如果不是一个人的话，那释迦牟尼佛成佛，我们谁也不能成佛。所以真正的佛法，它讲变和现，你不能讲它是一，也不能讲它不是一。所以真正佛法，你就是你，我就是我，他就是他，这是第一，无分别不妨分别；第二，你就是我，我就是他，他就是你，泥巴就是瓦块，瓦块就是苹果，没有谁不是谁，把这两点要圆融在一起。</p></div><div><p>所以你讲得也对，你念头一转，你也不能叫他病就好，即使他自己念头转了，他也不一定能好。为什么？我们三世因果报应，我们要受种种的自己过去世中自己业障的报应，当然这念头强烈会用念头的人有的能减轻病果，有的甚至能完全变好，但不是所有人都能这样。有些人念念佛，听经闻法包括晚期癌症不治而愈，痊愈了，可是有些人怎么念佛，怎么样他都好不了。这要看你以什么样的心念，还要看你发心怎么样，你能不能把经念懂，这点很重要。所以天地万法，千差万别，我们不可以说强说为一，也不可能说不是一，这个问题我们要把握一下。</p></div><br /><div><p>394.众生或者修行人在往生后，其它人如何通过一些表象判断是否成佛？是否去了善道？像身体柔软，空中出现瑞相，或者烧出了舍利子。这些可以做为判断的标准吗？</p></div><p><br /></p><br /><div><p>答：不能。往生不往生严格地来讲只有他自己知道。如果没有读懂《法华经》《楞严经》，甚至连他自己都不知道，别人怎么能知道？我们只有活着的时候，读懂了《法华经》《楞严经》，就能印证了自己有没有往生了极乐世界。开悟的人是往生了以后，成佛了以后去死，而不是死了以后往生或成佛。我们读了《法华经》就知道，在第十六品法会上，无量的人听佛讲了十分钟「如来寿量」，当下了生死，小则阿罗汉，大则十地等觉。</p></div><div><p>经上并没有讲，佛宣布了他们往生了以后，马上就把他们送到火葬场去烧了，不是这回事。但是我们在送往生的过程中发现身体柔软，烧出了舍利子、舍利花，不管是不是往生，我们都应该宣传为住生。这是方便引导，劝那些不信佛法的人生起欢喜心让他来信佛。即使烧出舍利子面带笑容并不证明他往生，没有烧出舍利子，没有笑容，硬硬的，也不能证明他没有往生。往生不往生我们活着的时候就已经做了定论。但是在中阴身期间，往生的可能性也非常非常大，所以我们也要积极地做好送往生，把这关系要把握好。</p></div><div><p>至于舍利子，一般有禅定功夫的人他可以烧出舍利子。有些人从事摘花啊，或者在寺庙里打扫卫生，天天看到都是些庄严的、红红绿绿的、金光闪闪的东西，他烧出来的骨灰也可能是红红绿绿的，这都是我们与这些外界信息感应所致。道家的象老子、吕洞宾肉身飞天，他也还是凡夫，还不能算是菩萨往生，这是很敏感的问题。至于出现些瑞相，既可能是佛菩萨来接引，也可能是冤亲债主来诈骗。</p></div><br /><div><p>395.如果是畜生道的众生，在生前一直听师父的讲经说法，和《法华经》《楞严经》，那么它能成佛吗？</p></div><p><br /></p><br /><div><p>答：不能一概而论。那个牛啊，闻了一下《法华经》来世就当官了，它听到《法华经》，一定能得到福报。如果它听懂了，也能了生死。在楞严会上，鸟王、蛇王啊，那都是畜生道的，这个要看它过去世的根机，还要看它今生今世的习气，多方面的原因。</p></div><br /><div><p>396.听很多菩萨讲，人在临终时冤亲债主可以化现成任意一个东西来接引，就是不能化现阿弥陀佛来接引？</p></div><p><br /></p><br /><div><p>答：这个话没有根据。冤亲债主在鬼神道的众生他可以变化出各种各样的形象，更主要的是我们肉身凡夫啊，对阿弥陀佛到底是什么形象，你也很难判别，它表演得比他差一点，你还不容易识别。鬼神道的众生有这种能力，有这种神通，他能化现阿弥陀佛。那么你可以考他，请你讲讲一心三藏什么道理——你讲这个话的时候，一般的来讲他当下就没有了，为什么？因为他不懂，如果他懂的话，他就是真的了。</p></div><br /><div><p>397.我们从明白如来藏到成圆满佛，要经过多少时间，是否由自己的发心和修行决定，但不管多长时间，是否就是一念间？</p></div><p><br /></p><br /><div><p>答：我们明白如来藏就已经成为分真即佛，或者是为明心见性的菩萨。那么成这个佛呢，几句话、几个小时、几分钟，在《法华经》《楞严经》写得很具体。那么如果说要成圆满佛的话，那么就还要修行，那修行百千万亿年，万万亿亿年都说不准。佛在「法华经授记品」里就看出来，要修圆满佛时间很长。当然是由自己的发心和修行决定的。这个是肯定的，发大心，修大行，勇猛精进成就就快些。这个是不争的道理。但不管多长时间是否就是一念，你不能讲是一念，也不能讲不是一念，你时间再长再长再长再长，它都是一念变现的，所以一念既可以变现一年，也可以变现百千万亿年，所以你讲这个一念，讲这个真心本性那一念，那就是了。不管你多长的时间，多大的空间都是一个念。所以分别不妨无分别，可以讲是一念间，也可以是讲无量百千万亿年。但不管多长时间，我们都一定会成圆满佛。</p></div><br /><div><p>398.是否活着的时候已经明白了一心三藏的道理，并读诵受持《法华经》，但死了以后既不出现身体柔软，也没有瑞相，存在这种情况吗？</p></div><p><br /></p><br /><div><p>答：存在。如果死了以后没有人送往生，或者自己没有成圆满佛的人他还有烦恼习气啊，也可能会出现些不好的恶相，这种情况与往生不往生是没有关系的。因为你活着的时候就已经往生，死了以后身体能柔软与往生是没有关系的。但是，受持《法华经》的人尽可能给他送往生，最好出现瑞相，防止别人造口业，造成误解。</p></div><br /><div><p>399.为什么我开始听师父的法一听即懂，现在修学时间比以前多了，这段时间反而又迷惑，觉得自己退步了，这是为什么？</p></div><p><br /></p><br /><div><p>答：你这个觉得自己退步了这就是进步啊，要不然你不会知道自己退步了。如果开始听法一听就懂，比如说知道天地万法是一个人一个念变现的，你现在怀疑了没有呢？如果以前没有怀疑，以前相信的，现在怀疑了，就说明你退步了或者说也没有退步，以前是假懂。菩提不退，一旦明白了你没有办法退的，所以你自己来好好思维。如果觉得自己退步了或者量上退步了，没有过去那么，如果讲得稍微活泼一点的话，没有过去那么狂喜狂热了，这个是很正常的，时间长了以后我们的心会逐渐平静下来。</p></div><br /><div><p>400.因果定律是法界的自然定律，佛祖只是揭示了因果的真相，而不会介入众生的因果。可是看到很多经书里面说，如果谤佛谤法等等因都会有堕地狱的果报。这里为什么呢？</p></div><p><br /></p><br /><div><p>答：谤佛谤法堕地狱与佛没有关系，佛不介入因果。你堕地狱是你自己报应自己，因为你的心是黑暗的心。所以黑暗的心、顽固的心，与地狱的那种气氛相适应，是你自己「应供」。谤佛谤法的人，一般心地非常固执，固执就跟那个胆结石、肝结石一样，结实的东西是不是往下掉啊？认真修行的人，一般心地宽宏，宽宏的心是不是跟气球一样往上飞啊？在楞严经讲叫「想升情坠」。</p></div><br /><div><p>401.小孩子现在诵《法华经》不懂经文之意，也能一样受益，明白一心三藏吗？</p></div><p><br /></p><br /><div><p>答：不能明白。读懂了以后可以种下金刚种子，能得到很大的福报。但是不听懂经意，不能了生死。不管是谁光读不解，只能得人天福报，不能了生死。</p></div><br /><div><p>402.请问恩师：那些不学法华楞严的佛弟子在诽谤受持《法华经》的法师或者弟子后，如果后面又因某些机缘学习并明白了如来藏的法理法义，其前面所造的口业之果报会因此减小或者说重罪轻报吗？</p></div><p><br /></p><br /><div><p>答：会的。不管多大的罪，他以后明白了如来藏的道理，都能一笔勾销，但来世报应是重罪轻报，不会落三途。《楞严经》最后一页讲的这个公案，我们要深信不疑。我们要帮助那些曾经有口过的人，耐心的劝导，他也是我们前世的父母尊长啊。</p></div><br /><div><p>403.出家僧众的戒坏见不坏，这个法理法义还是有点模棱两可。</p></div><p><br /></p><br /><div><p>答：如果真正是戒坏见不坏的人，见不坏是他明心见性了，戒坏是他破戒了。这些人能够往生佛土，但是品位不高，来世在人道天道里还债，是跑不掉的。如果他见本来就是坏的，却借口说戒坏见不坏，是罪加一等，必下三途。另外来讲，他戒坏见不坏，是出于方便示现，因为菩萨教众生，既可以示现善相，也可以示现恶相。对于这些人呢，我们尽量不要按照自己的心态去看待，只管把人家往好处想。</p></div><br /><div><p>404.不学法华楞严念佛能往生的也有，这些人都是菩萨再来，怎样判定我活着就是为了别人快乐，为了奉献的，你不学如来藏念佛也能成就？</p></div><p><br /></p><br /><div><p>答：我活着就是为了让别人快乐，是你自己判定自己，有道无道，自己知道。这样的人不学如来藏，他念佛也能成就，不念佛也能成就——起码不落三恶道。</p></div><br /><div><p>405.我家小儿子今年11岁，之前在修地藏七和般舟。期间经常能看到无形众生。开始接触如来藏大法之后。就很少看到了。对孩子来说应该是好事情吧？这是什么原因呢？</p></div><p><br /></p><br /><div><p>答：这个当然是好事情。那么学了法华、楞严以后呢，他受到正能量的加持，那些无形的众生在这种佛光的强度下不适应，就离开了他，他就看不到了。</p></div><div><p>另外呢，小孩子在11岁的时候，他这个天眼——也叫松果体，一般是没有关闭的。许多孩子都是这样，但是他们想不起来讲，因为他认为他能看到的东西，别人也能看到，所以他从来不讲；不讲不等于他们没有。</p></div><br /><div><p>406.有的人呢，因为他以前不学佛，不明白尊重出家人，说了不尊重出家人的话，现在明白了并以忏悔过，还有罪吗？</p></div><p><br /></p><br /><div><p>答：忏悔了以后是不仅有罪，而且增加了一层罪。这是按照《楞严经》来讲，因为我们的第八识就是一面镜子，你重复一次，它就增加一次信息。修小乘法的一天到晚忏悔，是增加你的罪过啊，你知道吗？因为在你的阿赖耶识里重复种下了烦恼的种子，就跟刻光碟一样，把它全部刻进去了。所以真正的忏悔，叫「不二过」，就不再有这个事情就行了，这是一。</p></div><div><p>第二，你明白了如来藏的道理，所有的罪过一念忏悔掉了，即使来世报应，也是重罪轻报，要明白。明心见性是最大的忏悔，不忏而忏，忏而不忏。</p></div><br /><div><p>407.我们的业障是否只有依靠佛力消除？现在一般的法师都这样开示的，只有多念佛、拜佛等才能消除业障。</p></div><p><br /></p><br /><div><p>答：业力大于佛力，愿力大于业力。消业靠我们自己的明心见性，靠我们自己发愿。佛不度人，唯人自度。佛出世七天，他母亲就风寒而死；佛在七十多岁的时候，他的故乡本土，被邻国波斯国王几十万大军血洗。佛能救人吗？佛只是把这个法告诉人们，让人们自己救自己。所以我们要晓得自己的业力，只有通过读懂《法华经》，明心见性，自己的愿力才能把业消除掉。</p></div><br /><div><p>408.听您开示中讲，您曾经练气功，也是有神通的，后来请师父关闭了，从这个问题中，弟子感觉很多修行的人有神通，这个神通并不是念佛就能开启的，确实本自具足，只要清净就自在现前了，我们如何做能开启比如他心通呢？</p></div><p><br /></p><br /><div><p>答：想学他心通的人啊，我五分钟就教给你，但是学费很昂贵，要一百万美元。其它我不收钱，就教神通是要收钱。好不好啊？</p></div><br /><div><p>409.师父，第一次听完您讲法，当下就欢喜无比相信自己成分真即佛，心里再无恐惧害怕自己今生不能往生极乐，请问这是狂妄自大吗？</p></div><p><br /></p><br /><div><p>答：这不是狂妄自大，这是一种法喜，是一种解脱功德。我刚才讲了，在五分法身功德里，第五种叫解脱知见——自己知道自己解脱了。</p></div><br /></br></td></div>"
    }
]