[
  {
    "title": "观世音菩萨真实义",
    "html": "<div class=\"B1_text\"><i class=\"pstatus\">本帖最后由 当捷 于 2014-7-25 23:36 编辑 </i><div class=\"text-center\"></div><div class=\"text-center\"><strong>观 世 音 菩 萨 真 实 义</strong></div><div class=\"text-center\"></div><div class=\"text-center\"><strong>印广法师主讲</strong></div><div class=\"text-indent\">尊敬的各位法师、各位居士、各位大德、各位菩萨以及在网上的诸位佛友，大家好！阿弥陀佛！</div><div class=\"text-indent\">今天啊！是观世音菩萨圣诞日，又是我们北京圣泉寺〈百七三时系念〉一周年纪念日。那么，我今天在这里给各位作一个专题开示，开示《观世音菩萨名号真实义》。</div><div class=\"text-indent\"></div><div class=\"text-indent\">讲到【真实义】，大家就要起个疑惑：真实义？那还有假义啊？有！我们平时把观世音菩萨当成天上的一个菩萨、当成是阿弥陀佛的一个首座和尚、当成是我们救苦救难的救世主，这叫假义、方便义。佛法里讲的假，不同于世间人所讲的假。世间人所讲的假，是根本没有这回事；佛法里讲的假，是一种方便因缘、引导之法。按照假义，我们来念观世音菩萨，也能得到人天福报；也能帮助我们消灾免难。但是，极其有限！它不能帮助我们开智慧,不能帮助我们了生脱死。一旦明白了【观世音菩萨】的真实义,不仅能帮助我们解决今生今世的烦恼习气,帮助我们去病、健康长寿；更主要更根本的是，它能帮助我们生生世世开大智慧、修大福报、了生脱死。</div><div class=\"text-indent\">由于时间关系，我们今天讲这个开示要长话短说。虽然是简明扼要，但是要达到一个目的：今天凡是到会的同修，都能开智慧,都能了生死。这个开智慧、这个了生死，在师父讲完这个开示以后，你们自己就能印证！自己就能给自己授记！为什么？因为我们自己每一个人就是观世音！</div><div class=\"text-indent\">今天这个开示啊，师父从三个角度来展开讲。第一个角度，是从【观世音】这个名相概念来讲，与我们在以往所碰到的佛法专业术语来进行对照；第二个角度，我们从【观世音】三个字的字型和字架结构来观照它的真实义；第三个角度，把它与日常生活来对照、来勾通。怎么样叫作【观世音】？观到了什么？怎么样观法？会观了以后，我们得到了什么果位？</div><div class=\"text-indent\">下面呢，我们先从第一个角度来对照。【观世音】三个字的核心是一个【观】。那有的人会讲，观世音，【音】是声音，应该耳朵来听啊！应该讲听世音啊！【观】，如果你勉强来对照，它也只能是看啊！应该叫看世色。要么叫听世音，要么叫看世色......怎么讲【观世音】？这里我们先简而言之。此【观】乃是指透过现象看实质，是明心见性之观。怎么观法？我们先简单地带一带。</div><div class=\"text-indent\">比如说，我把这个拳头变现为手掌，大家看到了什么？看到了手掌，是不是？这叫看，不叫【观】。如果有的讲看到了拳头，这就叫【观】。眼见手掌而心能看到拳头，这叫【观】。</div><div class=\"text-indent\">那么这个【观】字呢,在佛法其它的术语里就是【如是我闻】的【闻】。【闻】到了什么？闻到了真心本来面目。在《般若波罗蜜多心经》里，叫【照】，【照见五蕴皆空】,用眼睛看是看不到的。在净土法门里就是念佛的【念】。这个niàn不是嘴巴在唸，嘴巴的niàn是加一个口字旁,叫『唸』。我们净土法门现在念佛、念佛，变成了嘴巴在唸佛。可是，佛讲《阿弥陀经》不是这样唸啊！那么在禅宗来讲，这个【观】就叫【禅】，【禅】就是思维，也叫『打坐』。『打坐』可不是两条腿一盘，『打』就是打听，打听是不是研究啊？『坐』在古汉语里是表「因」，因就是表真理。打坐就是观照宇宙人生真理。我们从哪里来啊？又到何处去啊？这是我们从第一个角度呢，大概这么勾通圆融一下。</div><div class=\"text-indent\">所以这个【观】呢，它是我们佛法里的一个基础法门。什么基础法门呢？先观照、先明白道理以后你再下手，修行任何法门都能成就，这就是悟后起修。没有悟的人，你怎么样修都不能成就！我佛世尊在《大佛顶首楞严经》第一卷金口玉言—若不明白道理，你去苦修苦行，佛讲了八个字—【虽终日行，枉入诸趣】！这两句话的意思就是说：你没有观照明白、没有懂得什么是佛，你一天到晚在那里修行，你也是在六道轮回啊！</div><div class=\"text-indent\">佛还在《阿弥陀经》讲【从是西方】。【是】，就是观照明白阿弥陀佛真实义，明心见性了；然后呢，【过十万亿佛土】，不断地破除烦恼习气，过无量的无明之土，而到达究竟圆满的胜义净土—极乐世界！</div><div class=\"text-indent\">第二个角度：从【观世音】这个名相概念的字架结构来观照。在此，我简单提醒各位：诸佛出世弘法，首先要在第四层天兜率陀天观察四千年。第四层天一天等于我们人间四百年，兜率陀天四千年是我们人间多少年啊？五亿七千六百万年，然后他再下到娑婆世界来传法。那依佛的智慧，他提前五亿七千六百万年知道不知道将来佛法会由印度传到中国？肯定知道！所以呢，诸佛在兜率陀天观察四千年其中一个重要的任务，就是策划我们中国汉字的字架结构。所以你们看汉字的字架结构，许许多多字都能从一种侧面来开示出宇宙人生真理。这个法很有意思。这是诸佛如来对我们中华传统文化情有独钟！我们要感恩！</div><div class=\"text-indent\">下面呢，我们就这个【观】字的字架结构来看。大家看【观】字，它是一个左右结构。左边一个「又」，右边一个「见」，又见又见。我们凡夫看一样东西，就是一见而已。我们见到这是个肉团身的人，是不是？可是【观】呢，叫「又见」，怎么个「又见」法？你这个人从哪里来的？观到什么？这个人是人吗？它就是地水火风因缘和合而有。所以这个又见又见，即是见不见之见。这还没有见地水火风又是怎么出来的，这个我下一步再给大家解释。所以这种『见』，是用智慧来见。</div><div class=\"text-indent\">怎么又见又见呢？大家看这个，眼睛看到的是佛像，对不对？观的话来讲，它就是一块泥巴。可是我们众生就只是以肉眼见，认为这就是佛像、认为这就是人、这就是茶杯......而有种种的分别妄想：这是我、那是你、那是他......就难免在六道轮回受苦报；可是【观】的话呢，一切的一切都是一个人、一个念变现而已啊！这叫【观】。</div><div class=\"text-indent\">那么再看，有的人讲这个繁体的【观】不是这个结构啊!它是左边一个『雚』，右边是一个『见』,是不是啊？那更好解释。左边是个雚，我们眼睛看到雚，但能不能看到雚子里面的东西啊？所以心可以看到雚子里面一定是空的。所以这就是智慧！见到什么？见到里面的空性，是表这个法。</div><div class=\"text-indent\">所以，我们刚才从这个字架结构、从与佛法有关的术语来对照，就得出一个结论：这个观就是闻，就是照，就是念，就是禅。那下面我们是不是应该问：你观到了什么？闻到了什么？照到了什么？禅到了什么？念到了什么？</div><div class=\"text-indent\">下面解释第二个字，【世】。（世，古同卋shì）你看到了什么？卋界的卋，大家知道：三个十，是不是啊？上面一个十，下面再两个十，然后下面一横。那么这个卋界的卋，每一个十都是一横一竖。竖，表纵向。怎么纵向呢？过去、现在、未来这个时间无穷无尽。横，即表横向。怎么横向呢？东、南、西、北、上、下......无量的方位。这个世界是不是这样组成的？时间和空间组成万法。所以，这个十方三卋从时间上来讲，过去、现在、未来无穷无尽;从空间上来讲，无量的方位也是无量无尽！是不是啊？</div><div class=\"text-indent\">那么，在佛法里有时间、有空间必有万法。就如同这个木头块—有长、有宽、有高，方成一体。是不是？那么，「十」是表十方三卋。这是从总体上来讲。为什么要用三个十呢？过去卋是不是也有十方三卋啊？现在卋，是不是也有十方三卋啊？未来卋，是不是也有十方三卋啊？表三个十。</div><div class=\"text-indent\">我们当下就离不开十方三卋，是不是？我当下这个话讲完了，已经成为过去了；我现在正在讲话就是现在；我下面还有话讲，是不是就是未来啊？我讲话的当下这个位置，这是不是前方？这是不是我们的左右方？后方、上方、下方？不管过去、现在、未来、东、南、西、北、上、下十方......一念万法！万法一念！都没有离开十方三卋。所以这个『卋』，三个十下面是个一，是不是表十方三卋当下就是我们这一个念呐？你一个念能不能当下把十方三卋全部包容起来？你现在就可以想到过去，现在就可以想到未来，现在就面对现在。是不是？所以这个『卋』呢，是表十方三卋万法离不开当人、当下一念！</div><div class=\"text-indent\">我们现在在这里的同修，有没有清朝的人呐？把手举给我看一看。好！有没有唐朝的？唐朝的人举手看一看；秦朝的人举手看看；大通智胜佛时代的人把手举给我看一看；盘古开天辟地以来的人把手举给我看一看......这老古董不多啊！其实，告诉各位：我们在座的都是老古董，无始以来谁都没有死过。十方虚空、天地万法，我们当下具足啊！要这样来观照这个【世】。十方三世万法都是一念。</div><div class=\"text-indent\">那么，现代汉字『世』的写法，它是把三个十连在一起，是不是啊？三竖一横、下面两个小横，是不是啊？两个小横里面的一小横是表我们第七识，这个小横是小世界；下面一大横是表第八识阿赖耶识—我们每一个菩萨、每一尊佛、每一个天人鬼畜、每个泥巴瓦块它都有一个第七识，这就是我执，它执着这个肉团身就是我，无量的第七识、无量的我执其实是共一个念，那就是第八识。</div><div class=\"text-indent\">所以观到什么？禅到什么？念到什么？哎呀！天地万法都是一个人、一个念变现啊！所以，怎么样变现出时间？怎么样变现出空间？怎么样变现出万法？《楞严经》就是专门咬住不放讲这个问题。师父有个光盘就是专门讲解《楞严经》的精华时概括的168个字。其中佛详细给我们解释了时间、空间、万法它的来龙去脉。那么，观到了天地万法怎么样就是我们心变出来的，这叫怎样【观】。我们随便拿哪一法，都可以解释这个问题。</div><div class=\"text-indent\">它怎样变出来的呢？时间、空间、万法、有形有相......我们用《楞严经》【如来藏】的法理法义来对照。《楞严经》把一切有形有相的万法包括时间、空间、天、人、鬼、畜、诸佛、菩萨、刮风、下雨......统统说为「不空如来藏」，不空就是有啊！所以，我们眼睛看到、耳朵听到是不是都是「不空如来藏」啊？凡夫都是在有形有相上执着，这是「不空如来藏」。一讲大家都能知道，是不是？</div><div class=\"text-indent\">比如，师父从一开始讲到现在，可能讲了有半个小时的话了，是不是啊？大家听到这些话有文字的形相；有声音震动的大小；有文字的道理、意义，是不是？这在佛法里都叫「不空如来藏」。那么我们想一想，在师父没有开口讲话之前，这一大堆的道理在不在？在哪里？在谁心里？在谁心里啊？在我们大家的心里！是不是啊？师父心里没有这些东西能不能讲出来？你们心里没有东西，你能不能听出来？</div><div class=\"text-indent\">这就是佛在《法华经》讲：诸佛出世本怀，就是令众生开示悟入佛知佛见。为什么开啊？因为你心里本来就有这些东西。如果没有这些东西，给你开是不是空的？一开，什么也没有啊！大家明白吗？所以师父讲的这个法既是师父心里的，也是你们心里的。所以诸佛菩萨出世的目的即在于把众生本有的智慧告诉大家—我们大家都是一个念，都是一个本体。</div><div class=\"text-indent\">那大家知道，虽然在我心里，同时也在你心里，那在我们没有起心动念之前它虽然在，它有没有形相？有没有一点点味道？有没有一点点颜色？什么也没有。所以，虽然在，它没有形相。这是什么？在《楞严经》叫「空如来藏」，也叫『真空』，也叫『性』。性，即没有任何形相，但它是真实存在。</div><div class=\"text-indent\">比如说，这个木头块代表孙悟空，是不是啊？孙悟空摇身一变变成了茶杯，那么大家想一想，当下这个茶杯是不是就是孙悟空啊？是不是就是木头块啊？那么，在孙悟空没有变现茶杯之前，这个木头块当下是不是就是茶杯啊？所以茶杯跟木头块有没有区别啊？都是一个东西，都是我们一个念变现出来的，明白吗？茶杯就是木块，茶杯就是孙悟空。</div><div class=\"text-indent\">我们现在来看，茶杯是不是不空如来藏啊？孙悟空是表空的，这个空当下是不是就是空不空啊？所以，空如来藏、不空如来藏、空不空如来藏当下是不是一个东西啊？是不是一念变化的？这就是【观】到了什么，它是怎么样来【观】的。</div><div class=\"text-indent\">那于佛的三身功德来讲，有形有相的不空如来藏是不是叫化身佛？也叫应身佛？无形无相的那个性具功德、那个空如来藏在分别法里叫什么身啊？叫法身佛。我们现在来讲已经知道法身佛就是化身佛，化身佛就是法身佛。那我们怎么样来明白这个道理呢？是不是要观照啊？这个【观】就叫报身佛，叫智慧妙用。所以，【观世音菩萨】的【观】，第一个【观】就是表智慧妙用，就是报身佛。报身佛观到什么？观到化身佛就是法身佛，法身佛就是化身佛！</div><div class=\"text-indent\">孙悟空（真空）既然能变茶杯，它能不能变一张纸啊？能不能变这个灯啊？能不能变这个毛巾啊？那它变的一切的东西是不是就是一个孙悟空啊？这个真空是讲我们法身功德、讲本性，在分别法讲性；圆顿大法非性、非相、非一切，但是即性、即相、即一切！没有分别法，我们不能悟到无分别法。但是，我们不能执着在分别法上。既然心无大小、无分别，那能不能分佛心、菩萨心、天心、人心、狗心、牛心、马心、泥巴心、狗屎心、白银心、人民币心......能不能分？既然不能分，诸佛菩萨、天、人、鬼畜、泥巴瓦块是不是就是一个东西啊？大家好好悟啊！</div><div class=\"text-indent\">诸佛如来出世的本怀就是叫众生明白这个道理啊！越是真理越简单！简单到什么程度啊？假传万卷书,真传一句话,真传一个字,真传一个点......把这个点搞明白了，你现在了生死！明白这个道理，不用离开讲经堂、不用离开板凳,佛就宣布你成佛！你了生死了！《法华经》《楞严经》都有佛的金口玉言为证！这是我们从字架结构来观照这个【观】。</div><div class=\"text-indent\">第三个字叫【音】。这个【音】字呢，我们从两个方面来解释，首先从字架结构来讲。『音』字上面是个『立』，是不是？下面一个『日』，日能破暗，是帮助我们开智慧、破迷开悟。立于日头是立足于智慧，转识成智来观照万法。这是【观世音】！刚才我们已经明白了这个【音】从哪里来的。我没有发音之前，这个音在不在我心里啊？在。那么现在呢，从第三个角度，也就是从我们日常生活中来学会观照。随便拣哪一法，你就能证明那就是【观世音】。</div><div class=\"text-indent\">我们听到外面狗叫的声音，你心里能不能看到狗的形相？听其音而知其形。家里老爸老妈叫你开门，或者亲朋好友叫你开门，你听到了声音，知道不知道是谁啊？好！耳朵听到了，心里就能看到形相，是不是代替了眼睛了？</div><div class=\"text-indent\">这种【观】，是表我们眼、耳、鼻、舌、身、意这六根在用中相背，而在性中相知。同样，我们看到一个熟人时，他没有开口讲话，虽然没有讲话，你就知道这个人声音非常洪亮、非常会唱歌，是不是眼睛起到耳朵的作用了？可是，我们由于烦恼习气重啊！所以还不能圆满地使六根相互代用。一般地修到二禅天以上的功夫，更不用说阿罗汉、诸佛菩萨了，我们六根都能通用。</div><div class=\"text-indent\">这在《楞严经》讲得很清楚，叫『命浊』。怎么『命浊』啊？我们本来一念可以起无量的作用。现在眼睛能看不能听，耳朵能听不能吃饭。可是,当我们了脱了生死以后，在现量佛土、现量境界，我们自在无碍。</div><div class=\"text-indent\">好，我们再来打比方。我们今天从家里到这里来听课，是不是要抬腿走路啊？能走路的那个力是不是不空如来藏？你没有走路之前，能走的力在不在？在，那就是空如来藏。你这样观照叫【观世音】。那么，我们讲这个茶杯，它是不是观世音？这个茶杯在没有出现之前，它在不在？如果茶杯没有出现之前它不在的话，它永远不会有茶杯出来。所以，茶杯的这种形相和功能在没有出现之前是不是就在我们心里啊？如果不在的话，你不可能发明创造出茶杯来。</div><div class=\"text-indent\">第二个，你从茶杯的这个质量上来看，它是一个铁块，那这个铁块没有出茶杯之前，这个铁块在不在啊？在哪里？有的人讲，肯定在泥巴里呗！用泥巴这个原料把它炼出来了，是不是啊？那泥巴在哪里？泥巴是不是在我们心里啊？你们知道泥巴怎么变出来的吗？这个茶杯是不是坚固的物体啊？这个茶杯、这个铁块有没有水分啊？它本身就是水分啊！它是不是由铁水炼成以后而有的？它有没有温度啊？它有没有风啊？明白吗？那么这个茶杯一百年以后，它是不是要腐烂啊？那它是一百年以后突然腐烂了？还是从现在开始，每一分、每一秒、每一念都在腐烂啊？就是每一分、每一秒、每一念都在动。动，是不是就是风啊？所以这个茶杯是不是地、水、火、风啊？</div><div class=\"text-indent\">所以这个【观】啊，它要一层一层地观。在佛法里叫『假名』和『实体』。怎么叫『假名』和『实体』呢？这个茶杯本身就是假名，是不是？实体是什么？是一个铁块。这铁块来讲啊，又变成假名;还要看它实体，这铁块呢，哦 ，是地水火风，那到地水火风又是假名；再看地水火风的实体在哪里，这是不是就彻法源底了？我们现在来看一看它的实体在哪里，要分开来解释。首先，它是坚固的物体，是不是？好，我们看这个坚固物体，在《楞严经》叫「地大」。我们现在先研究这个地大怎么来的，好不好？</div><div class=\"text-indent\">大家现在来做一个实验，做什么实验呢？把我们两个手的纹路对一下，你先比一比，看看是不是一样长。一样长还是不一样长并不重要，而是为了和我们做完这个实验以后，来比较看变化了没有。是一样长的，等会儿叫它不一样长；是不一样长的，等会儿叫它一样长或者更加不一样长。</div><div class=\"text-indent\">好，现在大家把心用在右手，左手不要管它。右手怎么样放自在就怎么样放，放在腿上也好，放在哪里也好。眼睛呢，半闭不闭，不要东张西望，也不要看师父。让右手放松，首先，体会一下放松的感受：吸一口气，然后再慢慢地呼；或者很快地呼，在呼气的过程中，那就是放松的感受。好，大家吸一口气，体会放松的感受。把我们的心用在右手、右肩放松......右臂、右侧放松......右手、手掌、手背、五指放......松......右手，放......松......右肩放......松......放......松......右肩、右臂放......松......就像半睡不睡的样子，就是放松自然。把右手放松得像一个气球袋子一样，我们能感受到脉搏的跳动。右肩、右臂、右掌、掌心、掌背胀鼓鼓的，放.......松......松.......让我们的右手长长，长得比左手很长、很长、很长......放......松.......长长、长得很长、很长......放......松.......松......长长......长得很长、很长......</div><div class=\"text-indent\">好，大家比较一下，看看长长了没有？长长了的同修把手举起来看一看，举高一点，好，放下。没有长长的同修，不要不好意思啊，也把手举起来看一看，一个、两个、三个、四个、五个、六个、七个......十四。好，这十四个同修，你们右手虽然没有长长，那看到这么多人长长了，你们相信不相信啊？应该相信，是不是？主要是你们自己的心没有放松，没有很好地用心。回去以后自己再试验一下，好不好？</div><div class=\"text-indent\">现在大家回答我的问题：在我们没有用心让手长了这么长之前，这么长的东西在不在？（在）。在哪里？（心里）。虽然在心里，在心里有没有这么大的东西啊？（没有）。千万不能有，有就麻烦了，赶快到医院做搭桥手术，是不是啊？所以长出了这么长，就叫不空如来藏。没有起心动念之前，在心里就有，但它没有相，叫空如来藏。长出了这么长，在佛法里也叫假名。而在心里的时候，它无形无相，就叫实体。用《华严经》讲：长出了这么长叫事造功德；没有长之前，在我们心里叫性具功德。</div><div class=\"text-indent\">通过我们起心动念叫它变，这就是我们的智慧功德，它可以千变万化。所以这个法呢，在世间法里没有办法解释。世间法里眼见为实、耳听为虚，在佛法里叫真空妙有。一切的有都是由无形无相的真空变现而已。这是不是叫【观世音】啊？那我们把观世音不叫观世音，刚才长了块肉团，是不是？我说观世肉，行不行啊？观世音菩萨就是观世肉菩萨，明白吗？</div><div class=\"text-indent\">我们来看这个茶杯，它本身就是水，是不是？把一个铁块放炉子里加热了，是不是变成铁水啊？如果它不是水的话，它能不能变成铁水啊？炼钢在铁炉里是不是铁水啊？那么我们看一般的人讲，哦，地怎么来的？是自然而有。在佛法里这叫自然外道。它是自然的吗？同样，我们再来看水是怎么来的。有的人讲，水从天上下的嘛！这就是邪知见。我们有时一急，急得满头大汗，汗是不是水啊？水从哪里来啊？一样的道理是不是？也是心变出来的。所以心里没有动念之前，它虽然在心里，但有没有水啊？如果有的话，你就变成水肿了，是不是？那就是病了。</div><div class=\"text-indent\">那么讲到这里，还有火，是不是啊？茶杯是不是也有温度啊？火从哪里来啊？有时我们急得满脸通红，本来体温是三十六度，这时候可能就变成四十度了，是不是？那火从哪里来的，是不是也是心变出来的？</div><div class=\"text-indent\">既然我们的心能变固体、变液体、变热体，它能变是不是在动啊？那是不是就是风啊？那个风在心里，没有风的时候它动不动啊？千万不能动，如果动的话，你一天到晚惶惶不可终日，是不是啊？所以动即是不动，不动即是动，就看我们怎么样用心来把握。</div><div class=\"text-indent\">好，今天在这里师父就出一个题目考大家一下。哪一位同修自告奋勇？你能讲出哪一个法，说它怎么叫观世音菩萨呢？（某同修讲灯光）好，我们讲这个灯光。灯光是一个假名，它的实体是什么？是不就是电啊？我在讲话的音响，音响是不是假名啊？它实体是不是还是电啊？如果搞电风扇在这里动，电风扇的这个动是个假名，它实体是不是还是电啊？灯光能亮、音响能响、电风扇能动是不是都是个电呐？那么在电瓶里的那个电有没有任何的形相啊？没有，是不是？那是不是实体啊？但是电是不是仍然还是假名啊？电是不是就是我们里面的热量啊？刚才讲了，是不是也是由我们真心变出来的？所以假名与实体一层一层往下追，实体跟假名是不是一个东西啊？这是打比方。</div><div class=\"text-indent\">所以我们今天懂得了【观世音菩萨】，那我们叫「观世光菩萨」行不行？叫观世风行不行？叫观世水、观世香、观世臭、观世苦、观世辣行不行？这就叫无量色身三昧。为什么现在我们不能千变万化啊？为什么啊？我们现在就在千变万化，明白吗？你同时搞名闻利养是不是千变万化啊？一动念变成人民币、变成了部长、变成了省长、变成了大富翁、变成穷光蛋、变成劳犯......是不是无量色身三昧啊？如果我们的心只能变佛、变菩萨而不能变鬼、不能变马，它妙不妙啊？它就不妙了。那么我们现在觉得变牛、变马太苦了，我想变佛、变菩萨......它都是随你的变，是不是啊？你要想变佛、变菩萨，那你要看破放下，心往真处想、往好处想。这是佛在《楞严经》讲的，叫【随众生心,应所知量】。看你怎么样想、怎么样看、怎么样做来决定你来世是变人、变鬼、变佛、变菩萨。</div><div class=\"text-indent\">就跟我们食品加工厂造饼干和点心一样，同样都是面粉，同样有水、有糖，同样有盐、有牛奶，如果这五种原料配备的比例不一样，那造出的食品味道一样不一样？所以我们修行的人就是要配备地水火风空见识这七种原料的比例。这是变数，变数靠我们自己把握。所以成佛、成菩萨,命自我立!佛不度人，佛只是把这个配备的秘方给各位，把一切原料的来龙去脉告诉给各位，然后我们自己来把握。这在《楞严经》讲得非常详细。</div><div class=\"text-indent\">话讲到这里，现在明白了【观世音菩萨】的名号、听懂了并且深信不疑「天地万法都是由一个人、一个念变现出来的」，你永远不落三恶道！至于怎样变现出来，只在于我们怎么样看、怎么样听、怎么样想、怎么样干......来决定我们来世是做人、做鬼、成佛、成菩萨，还是变成泥巴瓦块。大家一定要明白，无情物是方便说，其实都是我们的心。在《楞严经》讲十二类众生，第十二类叫无想众生，就是讲泥巴瓦块......这些无情也是有情。也是佛的方便说，其实都是一个念。</div><div class=\"text-indent\">那现在明白了「种瓜得瓜，种豆得豆」这个道理并且深信不疑的同修，把手举给我看一看，举高一点，好，请放下。还有不太明白的同修，也把手举给我看一看，一个、两个、三个、四个，好，请放下。大家想不想知道，明白这个道理且深信这个道理，你们证到了什么果位啊？想不想啊？（想）。但是师父是个凡夫啊！师父不知道，也没有慧眼通。不过师父有办法叫你们知道，怎么知道呢？我们采取以标准答案来对号入座的方法。怎么标准答案呢？学生高考结束以后，对照标准答案，「哎呀！考了700分」，再对照各大院校招生录取分数线，假设北大清华是700分、南大是600分、西安大学是590分。请问，这位学生他录取志愿书是填北大清华？还是填南大西安大学啊？（北大清华）。</div><div class=\"text-indent\">现在就有个标准答案，给你们去对号入座。佛在《妙法莲华经》多处提出—读一句《法华经》，生一念欢喜心，蒙佛授记。也就是说，你懂得了「万法都是一个人、一个念变现」的当下，你就超越六道轮回。佛在《妙法莲华经—分别功德品第十七》一开头那几页，告诉修行人说：弥勒菩萨呀，这么多人听我讲了一个〈如来寿量品〉，半个小时而已啊！明白了万法都是一念变现，680万亿那由他恒河沙（就是无量无量）众生证到无生法忍；还有微尘数无量百千万亿亿亿菩萨，证到七地八地九地十地；乃至等觉位菩萨。这是一个标准答案。听佛讲半个小时的开示，没有离开讲堂，没有离开板凳成佛了。</div><div class=\"text-indent\">佛在《楞严经》倒数第二页讲：有一个无恶不作的大坏人—杀佛、杀菩萨、杀阿罗汉、杀父、杀母、吃喝嫖赌、偷盗邪淫，就剩一口气就要下无间地狱，这个时候有人给他讲了【如来藏】的道理，「万法皆是一个念变出来的啊，都是你一个人呐」！这个人当下所有的罪过一笔勾销，变地狱为佛土。佛在《楞严经》还讲：【发明便解脱】，发明发明，意思是明白道理就解脱了。佛的许多弟子跪下请法，佛讲了几句话就给他们授记：「哦！成佛了」！就这么简单。</div><div class=\"text-indent\">佛还在《阿弥陀经》讲，【即已食时，还到本国】。怎么【即已食时】啊？我们这张嘴巴，吃苹果就是甜嘴巴；吃辣椒是辣嘴巴；吃臭豆腐是臭嘴巴。你吃什么东西就是什么味，来比喻我们这个心：你明白了人你就是人；你明白了鬼你就是鬼；你明白了佛你就是佛。也就是《阿弥陀经》讲【青色青光】，青的颜色是不是就发出青的光啊？【青色青光，黄色黄光】。佛在《阿弥陀经》还讲【已发愿已往生；今发愿今往生；当发愿当往生】，他没有讲已发愿今往生；今发愿当往生；当发愿当当当......往生, 有没有这样讲啊?</div><div class=\"text-indent\">所以我们要注意啊,圆顿大法见性成佛,【发明便解脱】，不历阶梯，没有台阶、一步登天。这就是佛在「开悟的楞严，成佛的法华」教给我们的标准答案。所以祖师大德讲啊，你不读《法华经》《楞严经》，三藏十二部经都可以一笔勾销。为什么自古以来，几千年以来，「求道者多如牛毛，得道者凤毛麟角」？你不把《法华经》《楞严经》【如来藏】道理读懂，你修无量法门都是盲修瞎练。</div><div class=\"text-indent\">文殊菩萨在《楞严经》第六卷讲得很清楚：【归元性无二，方便有多门】。【归元】就是成佛；【性无二】，【性】就是明心见性。除了这个法门，没有第二个法门可以成就。明白这个道理以后呢，方便有多门，那么多方便法门是帮助我们圆满果位。明心见性的人已经成为分真即佛，最低保障线不落三恶道；或者不落六道轮回；往上不封顶。但一般地来讲，像龙女那样直接听经闻法，就成妙觉如来的很少。所以我们要明心见性，悟后起修，用无量方便法门来究竟圆满如来果位。</div><div class=\"text-indent\">所以我们根据刚才举手的大部分同修已经明白了万法都是一念之所变现的，再根据老佛爷教给大家的标准答案，大家现在把前面那个录取志愿书再想一想：我是填在极乐世界的国土，还是在娑婆世界这个六道轮回？想好以后我们举个手，来摸一下底好不好？好，现在对照佛的标准答案，认为自己现在就已经了生死成佛道、成明心见性的菩萨的同修，把手举给我看一看，举高一点，我告诉大家：你如果不懂装懂，你要受报应；但是你懂却装不懂，你也要受报应。前者不懂装懂是打诳语，后者你懂装不懂你是轻慢正法。所以你必须老老实实！再举高一点。我们要善于肯定自己，也要善于否定自己，是与不是都要举手，只有直心是道场！好，请放下。</div><div class=\"text-indent\">感到自己没有把握的同修也把手举起来看一看，举高一点我好确认，因为对你们还要有第二轮开示。一、二、三、四、五......三十六。好，刚才先举手的同修，你们是自己给自己授记了，是不是啊？你们已授记的我不管。但是这三十六个同修—认为自己没有把握往生的，我给你们授记：你们已经往生！已经成佛！阿弥陀佛！但是呢，你们不要高兴得太早，我还要告诉为什么给你们授记。</div><div class=\"text-indent\">禅宗有一个公案，叫作「二人同喝一杯水」，是不是啊？这一杯水，两个人能不能同喝啊？这是叫我们观照：人的嘴巴是秃的，两只鸟、两只鸡可以同饮一杯水，是不是啊？它们嘴巴是尖的。这个「二人同饮一杯水」就是说，今天在这里听课的每一个同修都是双重人格—一个假人、一个真人，可是我们一般只知道假人。</div><div class=\"text-indent\">大家想不想跟我们的真人见见面呐？（想）。好，今天跟你们义务介绍一下。比如说，我们经常有这样的事情：第二天早上要到上海去，那么就跟家里人打个招呼，明天早晨五点半叫我一下子；或者把闹钟手机调整一下子，到五点半响一响，是不是？有没有这样的情况？因为好睡懒觉，没有人叫不行。可是往往到了第二天早上，五点二十五的时候，也没有人叫，也没有等闹钟响就醒过来了，是不是啊？那是谁叫你们醒的啊？（真人）。就是真人叫你醒的！</div><div class=\"text-indent\">有时候我们信口开河，讲出一句不知天高不知地厚的话来，一讲了以后就后悔了：哎呀！把自己心里的秘密给暴露了；哎呀！讲这些话不得罪人吗？开始后悔的那个人是不是就是假人啊？那个信口开河的是不是就是你的真人？大家明白这个道理了吗？</div><div class=\"text-indent\">所以告诉各位，你今天就是在这里睡觉、打呼噜都能成佛！你就是把死了的人抬过来，他今天都成佛！根据呢，就是佛在《地藏菩萨本愿经》讲的，叫什么？【闻在本识】。明白了吗？是根本识明白了，这是解除一种顾虑。第二种顾虑呢，有些同修讲：我现在烦恼习气很重，我就是明白这个道理，但是我一点不像菩萨的样子啊！所以我不相信我已经成了佛。我告诉大家，当断气以后，我们这个肉团身（在佛法里称为无明壳）它就不再束缚我们了。既然肉团身不再束缚，眼、耳、鼻、舌、身、意这六根会不会再起作用了？这个时候轮到我们的第七识做人来风，是它做主它也做主，不是它做主它也做主。第七识从来不睡觉，这个时候它会不会再去投六道轮回啊？不会啊！</div><div class=\"text-indent\">那么我们想一想，死了以后再不受六道轮回了，成佛了，那他是死了以后成佛的？还是现在成佛的？明白了吗？所以我们现在这种境界叫比量功德、叫有余依成佛、有余依往生，还余了个肉团这个无明壳，但是我们里面的真人他已经成佛！大家明白这个道理了吗？</div><div class=\"text-indent\">好，我们再打一个比方：比如苹果这么大的气球把它充气以后，是不是能把东西吊起来啊？而这么大的气球能不能把水杯这么大的铁块带起来？（带不起来）。气球还没有铁块大，怎么能带起来啊？那么如果是一个讲经堂大的气球，能不能把这个铁块带到天上去？（能）。我们无量劫以来所造的种种的业就是这个铁块，它是一个定数不能改变，是不是？可是我们的心量能不能改变呐？（能）。如果我们原来只知道佛在天上、极乐世界在西方，那我们的心量只有苹果大，它不能把我们带业往生。你念死了都没有用，你越念情执越重!我要成佛、我要成佛......都在造业呐！只有一个你，别人怎么办?别人是谁啊?你说极乐世界那个佛他是佛，那牛、马、猪、羊是什么？你是不是心态情执越重，你就越带不走啊？当我们知道天地万法都是一个人、都是一个念、就是一尊阿弥陀佛的时候，我们的心量是不是讲经堂这么大啊？是不是把我们这个业障都带走了？</div><div class=\"text-indent\">在《楞严经》叫【想升情坠】。【想】，思想，是表空旷。是不是啊？ 我们知道尽虚空遍法界都是我，是不是想啊？因为这个想啊，我们就往上升。【情坠】，情往下落。一执着我要成佛，那个阿弥陀佛是佛、这是牛、那是白骨精、那是猪八戒，你就是情执把你往下坠。所以文殊菩萨和普贤菩萨化身寒山和拾得，对于没有明心见性的人怎么讲啊？叫『口唸弥陀心散乱，扯破喉咙也枉然』。你心散乱，怎么散乱呢？就是在搞人我是非、搞情执，喉咙唸破了都没有用。首先，解除一部分同修的心理障碍—我觉得我现在人还很坏，我还搞名闻利养。可是，我就是知道大家都是一个念变出来的，我怎么就成佛了？道理即在此。</div><div class=\"text-indent\">比如说，你学会了开汽车，遇到紧急的事情，是不是就刹车了？能够刹车，这就是你明心见性、见道了。既然刹车了，你会不会翻车啊？（不会）。那么毕竟它要向前滑行几步，这就是烦恼习气。是不是虽然滑行几步，它不影响你的安全？大家明白这个道理了吗？一个很坏很坏的坏蛋，他进配电房，但是他懂得电的知识和技术，再怎么样搬弄，他会不会触电啊？一个劳动模范、人大代表、优秀党员、三八红旗手，人非常非常好，可是他不懂得电，你叫他到配电房拨弄，是不是找死啊？所以明白【如来藏】道理，是一门高超的技术。不论你是好人坏人，你把握了这个技术，你就能往生成佛！</div><div class=\"text-indent\">再打一个比方，我们掉到水里的时候，眼睛敢不敢睁开啊？不敢睁开，是不是?为什么?不吃眼前亏。因为眼睛一睁就痛啊，当你眼睛看到水的时候，你还有没有危险啊？已经看到水了，叫见水离水。尽管身子还在水里，尽管衣服还是湿的，你还有没有生命危险了？那个在水里衣服是湿的，就是你的烦恼习气。尽管还很坏，但是你已经离开了六道轮回。大家明白这个道理了吗？</div><div class=\"text-indent\">如果哪一个人非要把习气全部克服完了才能成佛，我告诉你们，古今中外没有一个人能成佛。任何人都是带业往生。因为我们这个肉团身叫劣质产品，它不可避免带有无量劫以来的习气，要想全部改正，谈何容易！所以《法华经》《楞严经》就是妙法！把我们的心点亮了。这个灯点亮了，尽管旁边有许多虫子在飞、灰尘在遮，能不能影响它的光明啊？它始终是亮的。这是妙法啊！所以你看法华会、楞严会那么多人，没有离开板凳就成佛了！谁修了？谁证了？你说哪一个烦恼习气没有啊？我怕离开讲堂以后，他还会搞贪、嗔、痴，是不是？有标准答案在前，我们又通过日常生活中的这个道理，我们自己就能明白。</div><div class=\"text-indent\">好，我讲了这段开示以后，刚才这三十六位菩萨，还有人现在不明白的吗？把手举起来看一看，举高一点，一、二、三、四、五...十八。这十八罗汉啊，我们在下面讲《阿弥陀经》的时候，希望你们来进一步进修。不管你们承认不承认，你们今天已经成佛！而且是不动地的菩萨！阿弥陀佛！</div><div class=\"text-indent\">好，请大家合掌。愿以此功德，普及于一切。我等与众生，皆共成佛道。</div><div>"
  }
]