[
    {
        "title": "一则禅宗公案的启示：学禅，原来是这样的！",
        "author": null,
        "date": "2017-07-07",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x4E00;&#x5219;&#x7985;&#x5B97;&#x516C;&#x6848;&#x7684;&#x542F;&#x793A;&#xFF1A;&#x5B66;&#x7985;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF01;\" src=\"https://www.liaotuo.com/uploadfile/2017/0624/20170624093637941.jpeg\" style=\"width: 484px; height: 300px\" title=\"&#x4E00;&#x5219;&#x7985;&#x5B97;&#x516C;&#x6848;&#x7684;&#x542F;&#x793A;&#xFF1A;&#x5B66;&#x7985;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF01;\" /></p>\n<p>　　儿子大学毕业，在一家台资公司找到了工作。当他第一次将试用期工资1300元交到我手上时，我是心如蜜甜。但转正后的工资却不好拿了。他必须通过推销医疗器械的提成来获得。</p>\n<p>　　他回家找我这个妈，因为他知道我的亲戚朋友中有高官者，还有所谓“脚路广”者。问我能否找这些人帮他拉上买家关系。而现实是，这种设备的购入都要通过政府采购。他说，你不是认识某君吗？他可以打通这中间的关节吧？现在政府采购也不是滴水不漏的。</p>\n<p>　　我望着他一双祈盼的眼睛，心中好痛。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>之路的起步，对他们“80后”这一代人来说也是如此艰辛，其竞争的剧烈不亚于我们当年的知青回城。在心痛的同时，又心生忧虑。因为，如果不帮他走好人生如启帆远航的这第一步，怕他从此落下心理阴影。但如帮他，将这样一些正常的人际关系不正当地去运用，甚至行贿也在所难免，这等于是将他往邪路上引，也害了别人……</p>\n<p>　　习惯中，遇到烦心事，我摸起案上的《<a href=\"/chanzong/gongan/36276.html\" class=\"keylink\" target=\"_blank\">禅宗故事</a>全集》，有一句没一句地溜着……突然，眼前一亮，心头阴云仿佛被清风吹去。我知道我该如何“行“了，更知道教儿子如何”行“了。</p>\n<p>　　第二天晚饭，边吃边聊，这也是我与儿子交流的习惯。</p>\n<p>　　“虎子，还记得你上初三时，看我的《<a href=\"/chanzong/gongan/\" class=\"keylink\" target=\"_blank\">禅宗公案</a>故事》吗？星期天，你拿着书，看了半天，然后跑到阳台上来对我说：妈妈，这本书我怎么看不懂呀？我当时怎么对你说的，还记得吗？”</p>\n<p>　　“不记得了。”</p>\n<p>　　我说：“你认识书中的每一个字，但每个故事的意思你却感到莫名其妙，不知所云，是这样的吧？你点头说，是这样。然后我对你说：这种书就是这样写的。按你现在的年龄你也确实看不懂。我给你说了你也会不明白。但为什么世上会有这样的书呢？那是因为这样的书是要人一辈子慢慢去读的。你现在读不懂不要紧，你过十年再来看，就会觉得懂了一点点。再过十年八年去读，会觉得懂得更多一些。妈妈就是这样读的，而且有很多地方，妈妈现在也没看明白。这样的书不是读一次两次就可以了，要常读，这是好书，你可以读到七十岁八十岁，那时，你就可能都明白了。”</p>\n<p>　　儿子笑了，说记起来了，你是这样说的。不过，他心里肯定不明白，好好地吃饭，我给他说这陈年烂谷子的事干嘛？又要暗笑我人老啰嗦了。</p>\n<p>　　我说：“你还记得书中有这样一个故事吗？讲一个小鬼和一个和尚，都因为触犯了各自的门规被清理出了门户。鬼就给和尚出了个“鬼点子”，说，你站在我左肩上，我肩着你在空中走路，人是看不见我这个鬼的，只看见你这个和尚在天上行走，肯定会认为你法力无边，不该被赶出<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>。这样，你的名誉就恢复了。这样做的条件是，你得了<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>要先给我享用。于是，这两个家伙就合起来骗人了，真得了不少好处。不过，这样的好景不长。因为碰到阎王巡视，小鬼吓得躲到山洞里去了，和尚自然也就摔死了。”</p>\n<p>　　儿子听了，哈哈一笑，说，这真是个鬼点子。</p>\n<p>　　“这点子不好吧？”我及时发挥了：“其实这个故事告诉我们一个做人做事的道理。人要凭自己的真才实学，吃苦耐劳，真诚待人，才能有成就。如果仅凭各种关系，投机取巧，甚至行贿受贿，那就像这个和尚站在鬼肩上，等到鬼跑掉了，各种关系垮了，自己不是跟着垮吗？你看看周围，这样的和尚和鬼不少吧？我可不希望你像那个和尚，也别碰上那样的鬼。”</p>\n<p>　　儿子认真地看着我，给了我一个会心的笑，说：“老妈，你别担心，我不会这样的。”</p>\n<p>　　之后的发展证明，儿子真的让我放心了。不过当时，我是不放心的，毕竟他的人生路很漫长。作为过来人，我得多准备些<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>故事等在他的途中……</p>\n<p>　　实际上，也是儿子的际遇让我读懂了这些故事。学禅，原来是这样的！我还得像儿子小时候，我对他说的那样，慢慢读下去，不离不弃……因为，人的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>里程有多长，禅的故事就有多长，它对应着我生命中的每一个或悲或喜、或怨或怒、或哀或惧、或明或暗、或短或长的现实故事——它早已等在我的人生途中。</p>\n</div>"
    }
]