[
    {
        "title": "梅子熟了 禅机亦熟",
        "author": null,
        "date": "2017-03-02",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x6885;&#x5B50;&#x719F;&#x4E86; &#x7985;&#x673A;&#x4EA6;&#x719F;\" src=\"https://www.liaotuo.com/uploadfile/2017/0302/20170302112118812.jpeg\" style=\"width: 484px; height: 300px\" title=\"&#x6885;&#x5B50;&#x719F;&#x4E86; &#x7985;&#x673A;&#x4EA6;&#x719F;\" /></p>\n<p>　　明州大梅山法常禅师初参大寂（马祖），问：“如何是佛？”大寂云：“即心即佛。”师即大悟。大寂闻师住山，乃令一僧到问云：“和尚见马师，得个什么，便住此山？”师云：“马师向我道：‘即心即佛’我便向这里住。”僧云：“马师近日<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>又别。”师云“作么生别？”僧云：“近日又道：‘非心非佛。’”师云：“这老汉惑乱人，未有了日。任汝非心非佛，我只管即心即佛。”其僧回，举似马祖，祖云：“大众，梅子熟也。”（《景德传灯录》卷七）</p>\n<p>　　这个公案是关于马祖的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>明州大梅山法常禅师的一个故事，我把它大致解释一下。</p>\n<p>　　法常禅师第一次到马祖门下，问：“如何是佛？”马祖告诉他：“即心即佛。”法常禅师马上就开悟。后来他就离开马祖，到大梅山开法度<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>去了。马祖听<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>常禅师已经开山了，就派了一个<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>僧人去大梅山向法常禅师试探虚实。</p>\n<p>　　僧人到了大梅山便问：“听说和尚您是曾经参访过马祖，您在马祖门下究竟得到什么了，所以到这里来开山传达法呢？”</p>\n<p>　　法常禅师回答说：“因为马祖向我说‘即心即佛’，我就到这里开山了。”</p>\n<p>　　这个僧人又告诉法常禅师说：“你可知道，马祖最近说的佛法又跟过去不一样罗。”</p>\n<p>　　法常禅师就问：“怎么个不一样啊？”</p>\n<p>　　僧人回答法常禅师说：“最近马祖又改口说‘非心非佛’了。”</p>\n<p>　　法常禅师听了以后便给了一个评语说：“这个老头儿真是会迷惑人了，要到那一天才不迷惑人呢？不管它什么非心非佛，我只管它即心即佛。”</p>\n<p>　　这个僧人回到马祖门下，告诉马祖，他到大梅山见了法常禅师，法常禅师是如此跟他讲的。因此马祖就宣布说：“大众啊！你们知道吗？梅子已经熟了。”</p>\n<h2>机锋不在字面</h2>\n<p>　　这段公案在<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>非常有名，因为法常禅师听到马祖说“即心即佛”就开悟，然后就自己做师父接引徒众去了，马祖要试探法常禅师究竟悟到什么程度，所以派了一个弟子去，告诉他上一次讲的是“即心即佛”，你开悟了，现在讲的是“非心非佛”，看看法常禅师有何反应。可是法常禅师不为所动，他说：不管它什么“非心非佛”，我听到的还是一句“即心即佛”，所以不管它。</p>\n<p>　　因此，马祖听了就很赞叹地说：“梅子熟了。”意思是大梅山的法常禅师已经成熟了，可以做禅师了。</p>\n<p>　　听到即心即佛就能开悟，非心非佛就觉得是惑乱人、迷惑人。那么“即心即佛”、“非心非佛”这两句话，究竟那个才对？这是个大问题。</p>\n<p>　　依禅法来讲，“即心即佛”错，而“非心非佛”对；依开悟经验来说，因人而异，听到“即心即佛”可能开悟，听到“非心非佛”也可能开悟，这跟开悟本身并无一定之关系。</p>\n<p>　　说“即心即佛”就是开悟吗？不一定。诸位！现在我们也念了“即心即佛”诸位开悟了吗？但是法常禅师的确因为听到“即心即佛”就开悟；他悟的是“即心即佛”吗？错！他悟的不是“即心即佛”，只是听到这句话而开悟，不要认为开悟就是悟得“即心即佛”的道理。</p>\n<p>　　那么“非心非佛”又错了吗？如果有人听到这句话而开悟，那是因为这句话帮他的忙，并不是因为懂了“非心非佛”这句话的意思就是开悟，或是悟了“非心非佛”这句话的道理。这个观念，诸位要了解清楚。</p>\n<p>　　开悟与文字字面的意思，没有一定的关系，但也是有关系。所谓没有一定关系，是说“悟”，并不是悟那句话的含意，但的确因那句话而开悟。譬如有人看到树上桃花而开悟，其悟境即是悟得“桃花开”吗？不是！只是因看到桃花开，他就开悟了。又如<a href=\"/remen/xuyun.html\" class=\"keylink\" target=\"_blank\">虚云</a>老和尚，因为在吃茶的时候，茶杯拿在手上，人家倒开水进去，好汤！一不小心，茶杯掉在地上打碎了，因此而开悟。是不是他的悟境就是悟得“茶杯打破了”呢？当然不是，若茶杯打破就能开悟，那给你一个茶杯打打看，你开不开悟？</p>\n<p>　　祖师们开悟的经验并非就是悟了那个东西，可是当机缘成熟，他的心被一拨一点，突然间就开悟了，不是因为那么一句话，或那个动作，或那个现象使他开悟，而是因为<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>用功的那个人，已经用功到这个程度达个火候，遇到这个情况在他面前发生，他就开悟了，这是禅的悟境。</p>\n<p>　　昨天台北市发生这样一桩车祸：有一男一女两个人骑摩托车在慢车道上行驶，结果摩托车倒下来，两个人的头颅被大卡车压碎不见了，只剩下身体，惨不忍睹。大卡车是谁开的？不知道，已经开走了。听起来真可怜，也很可怕。</p>\n<p>　　怎么会发生这种事？这跟开悟看似没有关系，为什么要讲这个案子？那也是一个案子——无头案。并不是因为骑著摩托车而掉下头来，也不是因为骑摩托车在慢车道上行走而头掉下来，更不是因为卡车经过而头掉下来。就是正好碰得巧，碰到一起，头就掉下来被压碎了！我们不能说：“从此以后不能有一男一女，骑著摩托车在慢车道上行驶，否则头就可能被卡车压掉。”每天车祸案子层出不穷，因有各种各样的车祸，所以会有各种各样的死亡情况。</p>\n<p>　　开悟，也是一样，不过开悟的人，并没有像如今发生车祸的案件那么多。每天几乎都有人因车祸而死亡，却未听说每天几乎都有人因参禅而开悟。所以这里说“即心即佛”、“非心非佛”，并不是这两句话有什么古怪或魔术。“即心即佛”使法常禅师开悟，是因为法常禅师见了马祖，马祖说了这句话。若不是法常禅师见马祖，当时也不会有人因马祖说这句话而开悟。恰到好处，在这个时间，说这样的话，这个人就开悟啦！</p>\n<p>　　当然马祖大师能够识得：什么<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>的人，在什么样的情况下，该说什么话，就能让他得到开悟的消息。</p>\n<h2>即心即佛</h2>\n<p>　　“即心即佛”，是说我们的心本来就是佛的心。佛是什么呢？佛是彻悟、大觉；是<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>、觉他、觉满的意思。什么叫做“觉”？大梦已醒即是觉。大梦又是什么？就是<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>梦。什么是“烦恼生死梦”？就是在烦恼生死之中，把烦恼当成自己所要追求的目标，把生死当成自己旅游的乐园。人在生死中，佛称为<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。什么是苦海？就是生老病死苦、怨憎会苦、求不得苦、<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>炽盛苦、爱别离苦。在苦中还念念不忘，舍不得这样那样，而所追求的，都是生死环境中的种种人我、是非、利害、得失，把生死过程中，所遇到的苦因苦果，当成追求的目标，一生又一生，了无已时，那是在做生死苦海的大梦。</p>\n<p>　　求不到觉得很苦，求到的觉得不稀奇，再换一个去追求，再想、再求，到死为止。到要死亡的时候，尚觉得有许多事物没有追求到，这种种的舍不得、放不下，就是苦。在生死之中，苦中受苦，还觉得很喜欢这个生死的环境，还觉得苦得很有意思，牢牢的抓著它不放，这叫做“做大梦”。</p>\n<p>　　“觉”是从生死的梦中醒来，不再追求任何东西。因此，我们的心如果不为烦恼所困扰，就是觉。不但自己<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>，还要帮助他人觉悟，就是自觉、觉他；自己已经彻底觉悟，则是觉满。所以自觉、觉他、觉满，便叫做佛，称做大觉<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。</p>\n<p>　　众生的心，本来跟佛的心是相同的，<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>中说：“心、佛、众生，三无差别。”<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>和众生心，是同一个心，佛心就是众生心。为什么说“三无差别”？因为佛心是<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>心，智慧是由众生的烦恼心转成清净的佛心；不清净的众生心是烦恼心，清净的佛心是智慧心。此心与彼心，心心相印相同，只是在众生未悟时，此心是睡著的，一旦醒悟过来，则知众生心就是佛心，所以即心即佛没有错。</p>\n<h2>非心非佛</h2>\n<p>　　“非心非佛”是什么意思？如果把我们的心当<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>的心，或不当成佛的心，都是有问题的。如果认为凡夫有一定的心叫烦恼心，而佛有一定的心叫清净心，那凡夫永远不能成佛。所以“非心”是不要认为有一个心是众生的心，或者是有这么一个心叫做佛的心。即不是佛的心，也不是众生的心，那么有众生也应该有佛罗？没有不变的众生，也没有定相的佛！为什么？因为众生不会永远是众生，如果众生永远不能改变的话，那就没有人能成佛了。众生能成佛，所以众生不是真的；众生的心能变成佛的心，所以众生的心不是真心。如果真有一个众生的心，众生就不能成佛了。反之，亦不能说佛也有一个心，佛亦不是真正有一个什么固定的心，叫做佛的心；成佛之后，法身遍在，即<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>也<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。</p>\n<p>　　所以，众生<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>心，否则众生不能成佛；佛也是无心，如果有心，那不是佛，那叫有相、有执著、有我，岂能算是佛。</p>\n<p>　　那有没有众生呢？没有！为什么？若有固定的众生，这个众生就完了，没有希望成佛了。相同的，如果执著有一个佛，那众生成了佛，就成为永远不变、永恒存在。如果到处都遍在，那就变成泛神论了；永远现<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>，那就变成多神论，而<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>乃是无神论的。因此，佛只有无尽<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，没有固定形象。佛是无相的，处处在，也处处不在，所以叫做如来如去。所以不能讲“有佛”，说“有佛”是毁谤佛。但也不能说“无佛”，否则又成了断灭见的唯物论。因此讲“非心非佛”是对的，因为佛心无相；众生有相，但众生不是真的；有相的佛不是真的佛。佛是无心、无相的，却有其悲智的功德作用，所以说“非心非佛”。</p>\n<h2><a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>十足</h2>\n<p>　　大梅山法常禅师听到了“即心即佛”而开悟，各位现在也听到了，然而你们听到以后却没有开悟。那就是说“即心即佛”这句话，对你们立即的开悟，完全没有用，但也并不等于是句废话。</p>\n<p>　　再说，马祖去考验法常禅师时，是用“非心非佛”来考验他，结果法常禅师说：“管他什么非心非佛，我只知道是即心即佛。”这是什么意思呢？</p>\n<p>　　这是否表示法常禅师执著？牢牢的执著他听到的那句“即心即佛”？不是！请诸位不要中圈套，如果他执著这么一句话，能算开悟吗？其实，他是以平常心来处理这样的一个考验。所谓“平常心”就是：“我当时开悟，就是听到这句话，我的经验是如此，至于马祖大师又说非心非佛，那是他跟另外的人讲，和我没有关系。”所谓惑乱人、迷惑人，意即是说：这个老和尚的花样、手段满多的，对这个人这样说，对那个人那样说，如果头脑不清楚，就跟著被他弄得眼花撩乱；今天讲这个，明天说那个，究竟什么意思啊！没有开悟的人，这样一听就混淆错乱啦！可是马祖大师真的用这两句帮助两种不同的人。法常禅师得到的帮助，就是“即心即佛”这句话，“非心非佛”则也许真的帮助了其他的人，然而对法常禅师来讲，他只经验到“即心即佛”。</p>\n<p>　　为什么马祖说法常禅师“熟”了呢？因为他已经信心十足，已经不受外边眼花撩乱的情况动摇了。法常禅师若非真的开悟，听到马祖又说出另外一句话时，或许会觉得很惊奇，以为他当时听到的、经验到了，可能有问题吗？如果真的如此，他当时就不是真的开悟。由于法常禅师对自己的经验，非常坚决的肯定，所以马祖说他“成熟”了。</p>\n</div>"
    }
]