[
    {
        "title": "大颠和尚叩齿 破俗见求解脱",
        "author": null,
        "date": "2017-07-07",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x53E9;&#x9F7F;&#x53E4;&#x5BFA;\" src=\"https://www.liaotuo.com/uploadfile/2017/0624/20170624095659366.jpeg\" style=\"width: 484px; height: 300px\" title=\"&#x53E9;&#x9F7F;&#x53E4;&#x5BFA;\" /></p>\n<p>　　“叩齿”二字，来源于<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>上的一个典故，这个典故版本有好多个，内容大同小异，《五灯会元》相关记载如下：</p>\n<p>　　韩文公一日相访，问师：“春秋多少？”师提起数珠，曰：“会么？”公曰：“不会。”师曰：“昼夜一百八。”公不晓，遂回。</p>\n<p>　　次日再来，至门前见首座，举前话问意旨如何。座扣齿三下。及见师，理前问，师亦扣齿三下。公曰：“元来<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>无两般。”师曰：“是何道理？”公曰：“适来问首座亦如是。”师乃召首座：“是汝如此对否？”座曰：“是。”师便打趁出院。</p>\n<p>　　“扣齿”也即“叩齿”。这段典故后来变成了一个<a href=\"/chanzong/gongan/\" class=\"keylink\" target=\"_blank\">禅宗公案</a>。</p>\n<p>　　<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>公案是佛教史上的一朵奇葩，许多的公案其实都只是禅师们教育方式的记录而已。而禅宗公案往往多义费解，是<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>者的指示和思考对象。公案不同于哑谜，哑谜有迹可循，代表着某一特定意义，而公案的意义指向却是朦胧的，不可说破的，这点也正是禅宗公案的魅力所在。</p>\n<p>　　大颠和尚，生于唐开元末年，大历年间与药山惟俨一同在西山师事惠照禅师，后来又参谒石头希迁，贞元六年，大颠和尚回到潮阳，开辟牛岩，第二年，又创立<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>寺，卒于长庆四年，享年93岁。著有《<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>》、《<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>》释义。</p>\n<p>　　大颠和尚对佛教文化在潮汕地区的流传影响深远，现存大颠和尚相关的资料比较少，不过他遗留下来的相关古迹和传说却比较多，其中叩齿古寺尤为著名。</p>\n<p>　　叩齿古寺也叫叩齿庵，据清乾隆《潮州府志。卷十五。寺观》载曰：“叩齿庵，在城南道后，韩文公招大颠来潮之日住此。”“叩齿”二字，来源于佛教上的一个典故，这个典故版本有好多个，内容大同小异，《五灯会元》相关记载如下：  韩文公一日相访，问师：“春秋多少？”师提起数珠，曰：“会么？”公曰：“不会。”师曰：“昼夜一百八。”公不晓，遂回。</p>\n<p>　　次日再来，至门前见首座，举前话问意旨如何。座扣齿三下。及见师，理前问，师亦扣齿三下。公曰：“元来佛法无两般。”师曰：“是何道理？”公曰：“适来问首座亦如是。”师乃召首座：“是汝如此对否？”座曰：“是。”师便打趁出院。</p>\n<p>　　“扣齿”也即“叩齿”。这段典故后来变成了一个禅宗的公案，禅宗公案是佛教史上的一朵奇葩，许多的公案其实都只是禅师们教育方式的记录而已。禅宗的教育方式历来可以分成两种：一种是语言上的，如驳斥问话、反问、答非所问、顺口歪曲、重复问话等等，大颠和尚第一次回答韩愈的问题就是采用答非所问的教育方式。而另外一种是动作行为上的，如喝、沉默、棒打、竖拂子、弹指、吐舌、展手、顶坐具、掀禅床、作女人拜、画圆相等等。</p>\n<p>　　禅宗两种方法的共同点都是消解了语言的直接表意功能，直指人心，强调直觉领悟。禅的妙境在破执传心，破比立更为重要，而执念往往来自语言文字，因此破执首先就要取消语言文字的功用。机锋公案的不可解大部分是因为动作语言的表面意义与佛理毫无关系，无法找到契合点，比如南泉斩猫便是典型例子。</p>\n<p>　　禅宗中有“不立文字”、“直指人心”的<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>拈花微笑，亦是以动作神态来传道。而禅宗传道又必须依赖语言文字，语言文字后来成为了禅悟的束缚，让很多人都挣脱不了。《金刚经》里说“应无所住，而生其心”，如果悟道困于文字，也就“死于文字之下”。禅宗的本心与语言文字可以说互相排斥，又相互依存，就像天敌一样，有彼无此，但是真的少了一方的话，那么彼此也就都不存在了。这个悖论可以说是中国禅宗史上最耐人寻味的一点。</p>\n<p>　　大颠和尚延续禅宗的思想，在回答韩愈的问题时，并不直接给出答案，而是先用答非所问的方式，然后第二次才用叩齿的动作来消除语言的意义，倘若直接说出答案，那么韩愈也就不会引发一些思考，大颠和尚正是以不答为答。叩齿的动作，不能从动作语言的意义内涵入手来理解，而恰好要取消语言的影响，消除观念在于取消语言，倘若语言还在，那么观念也就自然而然产生了，当观念产生时，也就有了观念障，这个道理不宜用语言来表达，因为如果表达出来了，也就成为了另一个观念障，学习禅宗语录的人十分在意这一点。</p>\n<p>　　韩愈从大颠和尚和首座的相同叩齿动作中以为佛法无两般，而同样是叩齿，大颠和尚与首座的境界却有高低，大颠和尚稍微一试探，便知道首座并未完全理解叩齿的真正内涵在于以不答为答。公案中最忌讳说破玄机，用语言说破禅机的，其实正是破坏禅机。大颠和尚当着韩愈的面询问首座是否叩齿回答，首座不答还好，一旦答“是”就破坏了禅机，自然要遭到大颠和尚的杖逐了。</p>\n<p>　　大颠和尚的叩齿，其实应该视为一种表达观点的动作，通过动作表达观点的好处就在于看似迂回，其实最为直接。禅宗公案的离奇难解正是为参禅悟入做好铺垫，直接说破玄机的教育方式远远比不上启发思考的教育方式好，歌德《浮士德》曾说过：“能贯通的最高真理，决不能对孩子们直接说明。”亦是此理。</p>\n<p>　　大颠和尚曾与石头希迁对答中云：“禅是扬眉瞬目”。扬眉瞬目，都是面部表情动作而已，但是在特定的语境中，这两个动作就是所谓的“禅”。大颠和尚叩齿的动作在本质上与扬眉瞬目，吐舌弹指的原理是一样的，也是行不言之教，强调内心直觉领悟。</p>\n<p>　　禅悟的目的在于破俗见求<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，机锋公案的存在意义不在于给出一个确实的答案，而是促使读者去深入思考。倘若答案是固定的，那么也就没有了<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>力，这点类似于朦胧诗。朦胧诗的美正在于它的多义与争议，不可解也不必刻意去解，而禅宗公案的美也在于可解不可解中。</p>\n<p>　　叩齿只为破执，这种执千变万化，但只要是执念就可以采用无意义的动作来消解。大颠和尚的叩齿，只是一个信号，一个促使韩愈悟入的途径，叩齿本身的内涵正在于此。韩愈当时因为谏迎佛骨，而被贬潮州，他对佛家是明显存在着偏见的，季羡林曾说：“最著名的辟佛者是韩愈，他就是肤浅的典型。”这样的论断诚然是有失偏颇的，但是韩愈早年确实在哲学层面上没有彻底了解佛教，只是从政治层面来认识佛教的弊端而已，到潮州之后的韩愈通过与大颠和尚的交流，逐渐对佛教有了新的理解，这也是他前期辟佛而后期却开始转变对佛教态度的原因。</p>\n<p>　　当时韩愈在《与孟<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>书》云：“潮州时，有一老僧号大颠，颇聪明，识道理，远地无可与语者，故自山召至州郭，留十数日。实能外形骸，以理自胜，不为事物侵乱。与之语，虽不尽解，要自胸中无滞碍，以为难得，因与来往。”韩愈与大颠和尚对话，“虽不尽解，但胸中无滞碍”，这句话的潜台词十分丰富，至少看得出大颠和尚是对韩愈产生一定的影响的，甚至可以说大颠和尚的言行在某种程度上改变了韩愈对佛家思想的偏见。假如大颠和尚当时只是直截了当地回答了韩愈的提问，那么韩愈应该不会觉得大颠和尚有何独特之处，后来也不会有这段叩齿公案，从这个角度来看，叩齿之妙岂止是在禅悟里面？</p>\n</div>"
    }
]