[
    {
        "title": "指月录卷之一",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p>　　吴郡天池山人严澄道澈甫较</p><p>　　后学梅岩释开慧捐资重梓</p><p>　　后学释义行重阅</p><p>　　七佛</p><p>　　▲毗婆尸佛(过去<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>劫第九百九十八尊)</p><p>　　偈曰。身从<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>中受生。犹如幻出诸形象。幻人<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>本来无。罪福皆空无所住。</p><p>　　长阿含经云。人寿八万岁时。此佛出世。种刹利。姓拘利若。父槃头。母槃头婆提。居般头婆提城。坐波波罗树下。<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a> 三会。度人三十四万八千。神足二。一名骞茶。二名提舍。侍者无忧。子方膺。</p><p>　　▲尸弃佛(庄严劫第九百九十九尊)</p><p>　　偈曰。起诸善法本是幻。造诸恶业亦是幻。身如聚沫心如风。幻出无根无实性。</p><p>　　长阿含经云。人寿七万岁时。此佛出世。种刹利。姓拘利若。父明相。母光曜。居光相城。坐分陀利树下。说法三会。度人二十五万。神足二。一名阿毗浮。二名婆婆。侍者忍行。子无量。</p><p>　　▲毗舍浮佛(庄严劫第一千尊)</p><p>　　偈曰。假借四大以为身。心本无生因境有。前境若<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>亦无。罪福如幻起亦灭。</p><p>　　长阿含经云。人寿六万岁时。此佛出世。种刹利。姓拘利若。父善灯。母称戒。居无喻城。坐婆罗树下。说法二会。度人一十三万。神足二。一扶游。二郁多摩。侍者寂灭。子妙觉。</p><p>　　▲拘留孙佛(现在贤劫第一尊)</p><p>　　偈曰。见身无实是<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。了心如幻是佛幻。了得身心本性空。斯人与佛何殊别。</p><p>　　长阿含经云。人寿四万岁时。此佛出世。种<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。姓<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。父礼得。母善枝。居安和城。坐尸利沙树下。说法一会。度人四万。神足二。一萨尼。二毗楼。侍者善觉。子上胜。</p><p>　　▲拘那含牟尼佛(贤劫第二尊)</p><p>　　偈曰。佛不见身知是佛。若实有知别无佛。智者能知罪性空。坦然不怖于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。</p><p>　　长阿含经云。人寿三万岁时。此佛出世。种婆罗门。姓迦叶。父大德。母善胜。居清净城。坐乌暂婆罗门树下。说法一会。度人三万。神足二。一舒槃那。二郁多楼。侍者安和。子导师。</p><p>　　▲迦叶佛(贤劫第三尊)</p><p>　　偈曰。一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>性清净。从本无生无可灭。即此身心是幻生。幻化之中无罪福。</p><p>　　长阿含经云。人寿二万岁时。此佛出世。种婆罗门。姓迦叶。父梵德。母财主。居波罗奈城。坐尼拘律树下。说法一会。度人二万。神足二。一提舍。二婆罗婆。侍者善友。子集军幻寄曰。始予录指月录。七佛第书其偈。阿含化迹皆削焉。既见世之人。粗闻即心即佛者。率多拨无报化。乃悟昔人载此之妙密。盖偈阐法身之极致。阿含示化迹之大略。可谓断常俱遣。事理两融者矣。传灯成于道原。而裁定于杨大年。其旨不苟也。因具录之。此录稍录<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>亦以此。</p><p>　　▲释迦牟尼佛(贤劫第四尊)</p><p>　　姓刹利。父净饭王。母摩耶。刹利氏。自天地更始。阎浮洲初辟已来。世为王。佛历劫<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。值然灯佛授记。于此劫作佛。后于迦叶佛世。以菩萨成道。上生睹史陀天。名护明大士。及应运时至。乃降神于摩耶。当此土周昭王二十四(正宗作九)年甲寅。四月初八日。自摩耶右胁诞生。生时放大智光明。照十方世界。地涌金莲花。自然捧双足。一手指天。一手指地。周行七步。目顾四方曰。天上天下惟吾独尊。</p><p>　　云门云。我当时若见。一棒打杀。与狗子吃。贵图天下太平云峰悦云。云门虽有定乱之谋。且无出身之路琅玡觉云。云门可谓。将此深心奉尘刹。是则名为报佛恩僧问九峰虔云。承闻和尚有言。诸圣间出。只是传语人。是否。曰是。曰<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>一手指天。一手指地云。天上天下惟吾独尊。为甚么却唤作传语人。峰曰。只为一手指天一手指地。所以唤作传语人。</p><p>　　自降生后。种种神异。具如经言。至四十二(正宗作二十七)年。年十九。二月八日。欲求<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。而自念言。当复何遇。即于四门游观。见生老病死四等事。心有悲喜。而作思惟。此老病死终可厌离。于是夜子时。有净居<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。于窗牖中。叉手白言。出家时至。可去矣。于是诸天捧所乘马足。超然凌虚逾城而去。曰不断八苦。不成无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。不转法轮。终不还也。净饭王思甚。遣其臣劝谕还宫者万计。确然不回。入檀特山<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。始于阿蓝迦蓝处。三年学不用处定。知非便舍。复至郁头蓝弗处。三年学非非想定。知非亦舍。又至象头山。同诸外道。日食麻麦。经于六年。世尊自思曰。今此苦行非正<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。吾当受食而后<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。即沐浴于尼连河。天为之偃树。世尊援之而出。受牧牛氏女所献乳糜。寻诣毕钵树下。天帝化人。撷瑞草以藉坐。景云祥风四起纷披。天魔念。世尊道成。且受折抑。率众作难。穷现可怖可欲诸境。世尊泊然不动。以指按地。地大震。魔皆颠仆。于是降之。故经云。以无心意无受行。而悉摧伏诸外道。先历试邪法。示诸方便。发诸异见。令至菩提。乃於穆王三年癸未(正宗作昭王三十三年戊寅)岁。二月七日之夕。入正<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。至八日明星出时。廓然大悟。成等正觉。乃叹曰。奇哉一切众生。具有如来<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>德相。但以<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>执著不能<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。时年三十矣。(或云成道于腊月八日。以周正二月。乃夏正腊月也)成道后六年。归为净饭王说法。王大喜。遣其族五百贵子。从之出家世尊一日升座。大众集定。文殊白椎曰。谛观法王法。法王法如是。世尊便下座。</p><p>　　芭蕉彻云。忙忙者匝地普天雪窦颂云。列圣丛中作者知。法王法令不如斯。会中若有仙陀客。何必文殊下一椎幻寄曰。于斯荐得。则华严论所谓。未离兜率已降王宫。未出母胎度人已毕。十世古今。始终不离于当念。无边刹境。自他不隔于毫端。是顾虎头画人影。虽得其神。而终是画。香严上树话。雪峰望州亭与汝相见了也话。玄沙三种病人。亡僧面前触目菩提。深山岩崖<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。高峰见雪岩。岩问睡著未梦主人。都是依样画猫儿。咦。此俱是画。如何是真。咄。不见云门云。且道非非想天。今有几人退位。过此更参三十年。</p><p>　　世尊一日升座。默然而坐。阿难白椎曰。请世尊说法。世尊云。会中有二<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>犯律行。故我不说法。阿难以他心通。观是比丘。遂乃遣出。世尊还复默然。阿难又白。适来为二比丘犯律。是二比丘已遣出。世尊何不说法。世尊云。吾誓不为二乘声闻人说法。便下座。</p><p>　　南堂静云。前箭犹轻。后箭深。</p><p>　　世尊一日升座。迦叶白椎曰。世尊说法竟。便下座世尊在忉利天为母说法。优填王思佛。命匠雕栴檀像。及世尊下忉利天。像亦出迎。世尊三唤三应。乃云。无为真佛实在我身。</p><p>　　咦。在那一个身。</p><p>　　世尊在忉利九十日。及辞天界而下。<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>八部。俱往空界奉迎。有莲花色<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。作念云。我是尼身。必居大僧后见佛。不如用神力变作转轮圣王。千子围绕。最初见佛。果满其愿。世尊才见乃诃云。莲花色比丘。汝何得越大僧见吾。汝虽见吾色身。且不见吾法身。须菩提岩中宴坐。却见吾法身。</p><p>　　荐福怀云。莲花色比丘。被热谩且致。还知瞿昙老人性命在别人手里么。</p><p>　　世尊示随色摩尼珠。问五方天王。此珠所作何色。时五方天王。互说异色。世尊藏珠复抬手曰。此珠作何色。天王曰。佛手中无珠。何处有色。世尊曰。汝何迷倒之甚。吾将世珠示之。便强说有青黄赤白色。吾将真珠示之。便总不知。时五方天王。悉自悟道世尊因黑氏梵志。献合欢梧桐花。佛召仙人。<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>著。梵志放下左手一株花。佛又召仙人。放下著。梵志又放下右手一株花。佛又召仙人。放下著。梵志曰。吾今两手俱空。更教放下个甚么。佛曰。吾非教汝放舍其花。汝当放舍外六尘内六根中六识。一时舍却。无可舍处。是汝放身命处。梵志于言下悟无生忍世尊因普眼菩萨。欲见普贤。不可得见。乃至三度入定。遍观三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。觅普贤不可得见。而来白佛。佛曰。汝但于静三昧中起一念。便见普贤。于是普眼才起一念。便见普贤向空中乘六牙白象。</p><p>　　云居舜云。诸仁者。且作么生会。云居道。普眼推倒世尊。世尊推倒普眼。你道普贤在甚处。</p><p>　　世尊因五通仙人问。世尊有六通。我有五通。如何是那一通。佛召五通仙人。仙人应诺。佛曰。那一通你问我。</p><p>　　雪窦显云。老胡元不知有那一通。却因邪打正琅玡觉云。世尊不知。可谓因正而打邪。五通不知。因邪而打正云峰悦云。大小瞿昙。被外道勘破了。有旁不肯底出来。我要问你。作么生是那一通翠岩芝云。五通如是问。世尊如是答。要且不会那一通宝叶源颂云。那一通你问我。口是祸门。招因带果。惭愧慈悲大法王。丙乙离壬不属火断桥伦颂云。那一通你问我。玄关倒插无须锁。等闲一掣掣得开。三个老婆相对坐妙喜云。今时有一种弄泥团汉。往往在那一通处。错认定盘星。</p><p>　　世尊一日敕阿难。食时将至。汝当入城持钵。阿难应诺。世尊曰。汝既持钵。须依过去七佛仪式。阿难便问。如何是七佛仪式。世尊召阿难。阿难应诺。世尊曰。持钵去世尊因有比丘问。我于世尊法中。见处即有。证处未是。世尊当何所示。世尊曰。比丘某甲当何所示。是汝此问世尊因耆婆善别音响。至一冢间。见五髑髅。乃敲一髑髅。问耆婆。此生何处。曰此生人道。又敲一曰。此生何处。曰此生天道。又别敲一问耆婆。此生何处。耆婆罔知生处世尊因七贤女游尸陀林。一女指尸曰。尸在这里。人在甚处去。一女曰。作么作么。诸姊谛观。各各契悟。感帝释散花曰。惟愿圣姊。有何所须。我当终身供给。女曰。我家四事七珍悉具足。惟要三般物。一要无根树子一株。二要无阴阳地一片。三要叫不响山谷一所。帝释曰。一切所须。我悉有之。若三般物。我实无有。女曰。汝若无此。争解济人。帝释罔措。遂同往白佛。佛曰。憍尸迦。我诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>大阿罗汉。不解此义。唯有诸大菩萨。乃解此义世尊因地布发掩泥。献花于然灯佛。然灯见布发处。遂约退众。乃指地曰。此一方地。宜建一梵刹。时众中有一贤于长者。持标于指处插曰。建梵刹竟。时诸天散花相赞世尊尝于阿难行次。见一古佛塔。世尊便作礼。阿难曰。此是甚么人塔。世尊曰。过去诸佛塔。阿难曰。过去诸佛是甚么人弟子。世尊曰。是吾弟子。阿难曰。应当如是世尊因自恣日。文殊三处过夏。迦叶欲白椎摈出。才拈椎。乃见百千万亿文殊。迦叶尽其神力。椎不能举。世尊遂问迦叶。汝拟摈那个文殊。迦叶无对。</p><p>　　昭觉勤云。可惜放过一著。待释迦老子道你欲摈那个文殊。便与一椎。看他作么合杀云居元云。一家有事百家忙。</p><p>　　城东有一老母。与佛同生。不欲见佛。每见佛来即便回避。虽然如此。回顾东西。总皆是佛。遂以手掩面。乃至十指掌中。总皆是佛。</p><p>　　雪窦显云。它虽是个老婆。宛有丈夫之作。既知回避稍难。不免吞声饮气。如今不欲见佛。即许你。切忌以手掩面。何故。明眼底觑著。将谓雪窦门下。教你老婆禅。</p><p>　　世尊因文殊至诸佛集处。值诸佛各还本处。唯有一女人。近于佛坐而入三昧。文殊乃白佛。云何此人得近佛。而我不得。佛告文殊。汝但觉此女。令从三昧起。汝自问之。文殊绕女人三匝。鸣指一下。乃托至梵天。尽其神力。而不能出。世尊曰。假使百千文殊。亦出此女人定不得。下方过四十二恒河沙国土。有罔明菩萨。能出此女人定。须臾罔明大士。从地涌出。作礼世尊。世尊敕罔明出。罔明却至女子前。鸣指一下。女子于是从定而出。</p><p>　　五云逢云。不惟文殊不能出此定。但恐如来也出此定不得。只如教意。怎生体解翠岩真好问僧文殊是七佛之师。因甚出女子定不得。罔明从下方来。因甚却出得女子定。莫有能对者。独英劭武。方其问时。以手掐其膝而去。真笑曰。卖匙箸客未在洪觉范曰。教中有女子出定<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>商略甚众。自非道眼明白。亲见作家。未能明也。大愚芝禅师每问僧曰。文殊是七佛之师。为甚出女子定不得。罔明菩萨下方而至。但弹指一声。便能出定。莫有对者。乃自代云。僧投寺里宿。贼打不防家。予滋爱其语。作偈记之曰。出定只消弹指。佛法岂用工夫。我今要用便用。不管罔明文殊。云庵和尚见之。明日升座。用前话乃曰。文殊与罔明。见处还有优劣也无。若言无。文殊何故出女子定不得。只如今日<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>击动法鼓。大众同到座前。与罔明出女子定。是同是别。良久曰。不见道。欲识<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>义。当观时节因缘。大众总是祖师门下客。参玄上士。试谛观看。若见得。出家事毕。解脱安乐。世俗尘劳不用闲观。喝一喝下座。云庵亦有偈曰。佛性天真事。谁云别有师。罔明弹指处。女子出禅时。不费纤毫力。何曾动所思。众生总平等。日用自多疑妙喜云。有一种商量古人公案。谓之针线工夫。又谓之郎君子弟禅。如商量女子出定语云。文殊是七佛之师。为甚么出女子定不得。云文殊与女子<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。罔明是初地菩萨。为甚么出得女子定。云与女子有缘。下语云。冤有头债有主。又有商量道。文殊不合有心。所以出女子定不得。罔明无心。所以出得。下语云。有心用处还成错。无意求时却宛然。又有商量道。文殊为甚么出女子定不得。杓柄在女子手里。罔明为甚么出得。如虫御木。又云因风吹火。又云争奈女子何。邪解甚者。至于作女子入定势出定势。推一推。弹指一下。哭苍天数声。伏惟尚飨。拂袖之类。冷地看来。惭惶杀人。妙喜颂云。出得出不得。是定非正定。罔明与文殊。丧却穷性命圜悟勤颂云。大定等<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。廓然谁辨的。女子与瞿昙。据令何条直。师子奋迅兮摇荡乾坤。象王回旋兮不资余力。孰胜孰负。谁出谁入。雨散云收。青天白日。君不见。马驹踏杀天下人。临济未是白拈贼尼妙总颂云。金不博金。水不洗水。两既不成。一何有尔。罔明文殊。靴里弄指天衣怀颂云。文殊托上梵天。罔明轻轻弹指。女子黄面瞿昙。看他一倒一起宝峰照颂云。拂拭瑶琴月下弹。调高雪曲和应难。五侯费尽平生志。从此诗书懒更看石门易颂云。坐拥群峰覆白云。莺啼深谷不知春。岩前花雨纷纷落。午梦初回识故人佛灯珣颂云。瞿昙身心如泥。女子肝肠似铁。文殊贪寻锅子。罔明由来著楔。历观大地众生。不解闭门作活。不动干戈建太平。雨过青山如黛泼佛照光颂云。一亩之地。三蛇九鼠。仔细看来。是何面嘴。</p><p>　　殃崛摩罗。因持钵至一长者门。其家妇人正值产难。长者曰。瞿昙弟子。汝为至圣。当有何法能免产难。殃崛语长者曰。我乍入道。未知此法。待我回问世尊。却来相报。乃返具事白佛。佛告殃崛。汝速去报言。我从贤圣法来。未曾<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。殃崛奉佛语。疾往告之。其妇得闻。当时分娩。</p><p>　　径山杲禅师游方时。以此因缘。请益湛堂准禅师。堂曰。正爬著我痒处。这话是金矢法。不会如金。会得如矢。山曰。岂无方便。堂曰。我有个方便。只是你刬地不会。山曰。望和尚慈悲。堂曰。殃崛云。我乍入道未知此法。待问世尊。未到佛座下。他家生下儿子时如何。佛言我从贤圣法来。未曾杀生。殃崛持此语未到。它家已生下儿子时如何。山当时理会不得。及见圆悟。后过虎丘。阅<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>。至菩萨登第七地证无生法忍云。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。菩萨成就此忍。即时得入菩萨第八不动地。为深行菩萨难可知无差别。离一切相一切想一切执著。无量无边一切声闻辟支佛所不能及。离诸喧诤。寂灭现前。譬如比丘具足神通。得心<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。次第乃至入灭尽定。一切动心忆想分别悉皆止息。此菩萨摩诃萨亦复如是。住不动地。即舍一切功用行。得无功用法。身口意业念务皆息。住于报行。譬如有人。梦中见身堕在大河。为欲渡故。发大勇猛。施方便故。即便寤[寤-吾+告]。既寤[寤-吾+告]已所作皆息。菩萨亦尔。见众生身在四流中。为救度故。发大勇猛。起大<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>故。至此不动地。既至此已。一切功用靡不皆息。二行相行皆不现前。此菩萨摩诃萨。菩萨心<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a><a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>心。尚不现起。况复起于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之心。山于是豁然打失布袋。湛堂所说方便。忽然现前。山后尝颂此因缘。其颂曰。华阴山前百尺井。中有寒泉彻骨冷。谁家美人来照影。不照其余照斜领。鼓山圭公亦同颂云。月里仙娥不画眉。只将云雾作罗衣。不知梦逐青鸾去。犹把花枝盖面归。</p><p>　　世尊一日。因文殊在门外立。乃曰。文殊文殊。何不入门来。文殊曰。我不见一法在门外。何以教我入门。</p><p>　　报慈遂征云。为复是门内语。门外语。沩山喆代云。吾不如汝。黄龙新云。文殊恁么道。入得门入不得门。若入得门。冰消瓦解。</p><p>　　无边身菩萨。将竹杖量世尊顶。丈六了又丈六。量到梵天。不见世尊顶。乃掷下竹杖。合掌说偈云。虚空无有边。佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>亦然。若有能量者。穷劫不可尽世尊因乾闼婆王献乐。其时山河大地皆作琴声。迦叶起作舞。王问。迦叶岂不是阿罗汉诸漏已尽。何更有余习。佛曰。实无余习。莫谤法也。王又抚琴三遍。迦叶亦三度作舞。王曰。迦叶作舞。岂不是习。佛曰。实不曾作舞。王曰。世尊何得<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。佛曰。不妄语。汝抚琴。山河大地木石尽作琴声。岂不是。王曰是。佛曰。迦叶亦复如是。所以实不曾作舞。王乃信受。</p><p>　　修山主问澄源禅师。乾闼婆王奏乐。直得须弥岌峇海水腾波。迦叶作舞。作么生会。源云。迦叶过去世。普作乐人来。习气未除。修云。须弥岌峇海水腾波。又作么生。源休去。幻寄云。有底道。世尊以药去病。澄源以病去药。梦也未梦见乾闼婆王在。</p><p>　　世尊在第六天。说大集经。敕他方此土人间天上一切狞恶鬼神。悉皆辑会。受佛付嘱。拥护<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。设有不赴者。四天门王飞热铁轮。追之令集。既集会已。无有不顺佛敕者。各发弘誓。拥护正法。唯有一魔王。谓世尊曰。瞿昙。我待一切众生成佛尽。众生界空。无有众生名字。我乃发菩提心。</p><p>　　天衣怀举云。临危不变。真大丈夫。诸仁者。作么生下得一转语。与黄面瞿昙出气。寻常神通妙用智慧辨才。都使不著。尽阎浮大地人。莫不爱佛。到这里。何者是佛。何者是魔。还有人辨得么。良久云。欲识魔么。开眼见明。欲识佛么。闭眼见暗。魔之与佛。一时穿却鼻孔。妙喜曰。天衣老汉。恁么批判。直是奇特。虽然如是。未免话作两橛。若向何者是佛何者是魔处休去。不妨使人疑著。却云开眼合眼。郎当不少。又云。拄杖一时穿却鼻孔。雪上加霜。妙喜却为黄面老子。代一转语。待遮魔王如此道了。只向他道。几乎错唤你做魔王。此语有两负门。若人检点得出。许你具衲僧眼。</p><p>　　世尊因调达谤佛。生身入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。遂令阿难问。你在地狱中安否。曰我虽在地狱。如三禅天乐。佛又令问。你还求出否。曰我待世尊来便出。阿难曰。佛是<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>导师。岂有入地狱分。调达曰。佛既无入地狱分。我岂有出地狱分。</p><p>　　翠岩真云。亲言出亲口湛堂准颂云。好笑提婆达多。入捺落十小劫波。虽然得三禅妙乐。吹布毛须还鸟窠松源岳颂云。地狱天堂八字打开。谁知无去亦无来。若言已得三禅乐。未免将身自活埋。</p><p>　　世尊因文殊。忽起法见佛见。被世尊威神摄向二铁围山。</p><p>　　五云逢云。甚么处是二铁围山。还会么。如今人有起法见佛见。五云与烹茶两瓯。且道是赏伊罚伊。同教义不同教义白云端云。大众。世尊当时无大人相。如今若有向承天这里。起法见佛见。承天终不敢教动著他。何谓如此。但得雪消去。自然春到来。五祖演云。白云则具大慈悲。遂拍手云。曼殊室利普贤大士。不审今后更敢也无。自云。一度被蛇伤。怕见断井索。</p><p>　　世尊因<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>会上。五百比丘得四<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。具五神通。未得法忍。以<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智通。各各自见杀父害母及诸重罪。于自心内。各各怀疑。于甚深法不能证入。于是文殊承佛神力。遂手握利剑。持逼如来。世尊乃谓文殊曰。住住不应作逆。勿得害吾。吾必被害。为善被害。文殊师利。尔从本已来。无有我人。但以内心见有我人。内心起时。我必被害。即名为害。于是五百比丘自悟本心。如梦如幻。于梦幻中无有我人。乃至能生所生父母。于是五百比丘同赞叹曰。文殊大智士。深达法源底。自手握利剑。持逼如来身。如剑佛亦尔。一相无有二。无相无所生。是中云何杀。</p><p>　　天童杰云。为人须为彻。杀人须见血。文殊费尽腕头气力。且不知此剑来处。带累释迦老子。通身是口。也分疏不下。五百比丘恁么悟去。入地狱如箭射。忽若踏翻大海。踢倒须弥。云门扇子[跳-兆+孛]跳上天。筑著帝释鼻孔。东海鲤鱼打一棒。雨似盆倾。又作么生商量。良久云。自从舞得三台后。拍拍元来总是歌。</p><p>　　世尊因外道问。不问有言。不问无言。世尊良久。外道叹曰。世尊大慈大悲。开我迷云。令我得入。作礼而去。阿难白佛。外道得何道理。称赞而去。世尊曰。如世良马见鞭影而行。</p><p>　　雪窦显云。邪正不分。过犹鞭影。又云。迷云既开。决定见佛。还许它同参也无。若共相委知。则天下宗师。并为外道伴侣。如各非印证。则东土衲僧。不如西天外道。又颂云。机轮曾未转。转必两头走。明镜忽临台。当下分妍丑。妍丑分兮迷云开。慈门何处生尘埃。因思良马窥鞭影。千里追风唤得回。唤得回。鸣指三下。圜悟勤云。鸣指三下。是点破。是撒沙。径山杲云。邪正两分。正犹鞭影百丈恒举此。请益<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。语未终。法眼云。住住。汝拟向世尊良久处会那。丈从此悟入。</p><p>　　世尊因波斯匿王问。胜义谛中有世俗谛否。若言无。智不应二。若言有。智不应一。一二之义。其义云何。佛言。大王。汝于过去龙光佛时。曾问此义。我今无说。汝今无听。无说无听。是为一义二义。</p><p>　　翠岩真云。波斯匿王善问。不善答。世尊善答不善问。一人理上偏枯。一人事上偏枯。翠岩当时若见。点一把火。照看黄面老。面皮厚多少荐福怀云。诸仁者。大王分明问。世尊分明答。宾主历然。作么生说个无说无闻底道理。</p><p>　　世尊因外道问。昨日说何法。世尊曰。说定法。外道曰今日说何法。曰不定法。外道曰。昨日说定法。今日何说不定法。世尊曰。昨日定今日不定。</p><p>　　五祖戒云。何得将别人物。作自己用沩山喆云。世尊大似看楼打楼。大沩即不然。待问昨日说定今日何说不定。但云非汝境界荐福怀云。黄面老。被外道拶著。出自偶然。虽然如此。邪正未分。若人辨得。许你顶门具眼。</p><p>　　世尊因有异学问。诸法是常耶。世尊不对。又问诸法是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>耶。世尊亦不对。异学曰。世尊具一切智。何不对我。世尊曰。汝之所问。皆为戏论世尊尝在尼俱律树下坐次。因二商人问。世尊还见车过否。曰不见。还闻否。曰不闻。莫禅定否。曰不禅定。莫睡眠否。曰不睡眠。商人乃叹曰。善哉善哉。世尊乃觉而不见世尊因长爪梵志索论义。预约曰。我义若堕。当斩首以谢。世尊曰。汝义以何为宗。志曰。我以一切不受为宗。世尊曰。是见受否。志拂袖而去。行至中路有省。乃叹曰。我义两处负堕。是见若受。负门处粗。是见不受。负门处细。一切人天二乘。不知我义堕处。惟有世尊诸大菩萨。知我义堕。回至世尊前曰。我义两处负堕。故当斩首以谢。世尊曰。我法中无如是事。汝当回心向道。于是同五百徒众。一时投佛出家。证阿罗汉。</p><p>　　天衣怀颂云。是见若受破家门。是见不受共谁论。匾担蓦折两头脱。一毛头上现乾坤。</p><p>　　世尊一日坐次。见二人舁猪过。乃问。这个是甚么。曰佛具一切智。猪子也不识。世尊曰。也须问过。</p><p>　　大阳玄云。不因世尊问。洎乎忘却地藏恩云。瞿昙老汉。也是无端。大似节目上更生节目。忽被二人呵呵大笑。舁猪便行。一场懡[怡-台+羅]。</p><p>　　世尊在灵山会上拈花示众。是时众皆默然。唯迦叶尊者破颜微笑。世尊曰。吾有正法眼藏涅槃妙心。实相无相微妙法门。不立文字教外别传。付嘱摩诃迦叶。</p><p>　　白云端云。迦叶善观风云别气色。虽然如是。还觉顶门重么。复颂云。尽说拈花微笑是。不知将底辨宗风。若言心眼同时证。未免朦胧在梦中僧问云峰悦。灵山拈花。意旨如何。悦云。一言已出。驷马难追。迦叶微笑意旨如何。悦云。口是祸门。</p><p>　　世尊至多子塔前。命摩诃迦叶分座令坐。以僧伽黎围之。遂告曰。吾以正法眼藏。密付于汝。汝当护持。并敕阿难副贰传化。无令断绝。而说偈曰。法本法无法。无法法亦法。今付无法时。法法何曾法。尔时世尊说此偈已。复告迦叶。吾将金缕僧伽黎衣。传付于汝。转授补处。至慈氏佛出世。勿令朽坏。迦叶闻偈。头面礼足曰。善哉善哉。我当依敕恭顺<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>世尊临入涅槃。文殊大士。请佛再转法轮。世尊咄曰。文殊。吾四十九年住世。未曾说一字。汝请吾再转法轮。是吾曾转法轮耶。</p><p>　　雪峰空云。且道世尊从文殊请。不从文殊请。</p><p>　　世尊于涅槃会上。以手摩胸告众曰。汝等善观吾紫磨金色之身。瞻仰取足。勿令后悔。若谓吾灭度。非吾弟子。若谓吾不灭度。亦非吾弟子。时百万亿众。悉得契悟。</p><p>　　云峰悦云。然膏肓之病。不足以发药。云峰今日且作死马医。汝等诸人。皮下有血么。</p><p>　　尔时世尊至拘尸那城。告诸大众。吾今背痛。欲入涅槃。即往熙连河侧娑罗双树下。右胁累足。泊然宴寂。复从棺起。为母说法。特示双足。化婆耆。并说无常偈曰。诸行无常。是生灭法。生灭灭已。寂灭为乐。时诸弟子。即以香薪竞茶毗之。烬后金棺如故。尔时大众即于佛前。以偈赞曰。凡俗诸猛炽。何能致火爇。请尊三昧火。阇维金色身。尔时金棺从座而举。高七多罗树。往反空中。化火三昧。须臾灰生。得<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>八斛四斗。即穆王五十二(正宗作三十六)年壬申岁。二月十五日也。自世尊灭后。一千一十七年。教至中夏。即后汉永平十年戊辰岁也世尊涅槃日。迦叶最后至。世尊乃于椁中。露双趺示之。</p><p>　　佛鉴勤颂云。未出王宫已涅槃。何须双足露金棺。致令迦叶双眉皱。庆喜门前倒刹竿。</p><p>　　诸师拈颂诸经语句</p><p>　　▲经题[米-木+八]字</p><p>　　僧问地藏堔。以字不成。八字不是。未审是甚么字。藏曰。看取下注脚。径山杲颂云。以字不成八字非。烁迦罗眼不能窥。一毛头上重拈出。愤怒那吒失却威。幻寄曰。有以沤和二字释此者。是以柏树子话。为三界<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。同一鼻孔。座主见也。</p><p>　　华严论</p><p>　　未离兜率已降王宫。未出母胎度人已毕。</p><p>　　径山杲颂云。利刃有蜜不须舐。蛊毒之家水莫尝。不舐不尝俱不犯。端然衣锦自还乡。</p><p>　　<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a></p><p>　　若为人轻贱。是人先世罪业。应堕恶道。以今世人轻贱故。先世罪业则为消灭。</p><p>　　雪窦显颂云。明珠在掌。有功者赏。胡汉不来。全无伎俩。伎俩既无。波旬失途。瞿昙瞿昙。识我也无。复云。勘破了也。圆悟勤云。且道雪窦勘破瞿昙。瞿昙勘破雪窦。具眼者试定当看。</p><p>　　<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>相无人相。</p><p>　　庞<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>问讲金刚经座主云。无我相无人相。阿谁讲阿谁听。主无对。士示偈云。无我亦无人。作么有疏亲。劝君休历座。何似直求真。金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>性。外绝一纤尘。我闻并信受。才是假名陈。</p><p>　　文殊所说般若经</p><p>　　清净行者不入涅槃。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>比丘不入地狱。</p><p>　　此山应颂云。饮官酒卧官街。当处死当处埋。寒山逢拾得。抚掌笑咍咍径山杲颂云。壁上安灯盏。堂前置酒台。闷来打三盏。何处得愁来高峰妙颂云。涅槃地狱本无差。只为从前被眼遮。三脚驴儿才[跳-兆+孛]跳。镬汤罏炭是吾家。</p><p>　　<a href=\"/fojing/yuanjuejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">圆觉经</a></p><p>　　居一切时不起<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。于诸妄心亦不息灭。住妄想境不加了知。于无了知不辨真实。</p><p>　　径山杲颂云。荷叶团团团似镜。菱角尖尖尖似锥。风吹柳絮毛毬走。雨打梨花蛱蝶飞。师答林少瞻云。但将此颂。放在上面。却将经文移来下面。颂却是经。经却是颂。如此做工夫看。莫管悟不悟。心头休要忙。亦不可放缓。如调弦之法。紧缓得其所。则曲调自成矣琅玡觉禅师。尝问讲僧曰。如何是居一切时不起妄念。对曰。起即是病。又问。如何是于诸妄心亦不息灭。对曰。息即是病。又问。如何是住妄想境不加了知。对曰。知即是病。又问。如何是于无了知不辨真实。对曰。辨即是病。觉公笑曰。汝识药矣。未诚药中之忌也。宝觉禅师则为之偈曰。黄花熳熳。翠竹珊珊。江南地暖。塞北春寒。游人去后无消息。留得云山到老看。</p><p>　　一切障碍即究竟觉。</p><p>　　雪堂行颂云。枯树云充叶。凋梅雪作花。击桐成木响。蘸雪吃冬瓜。长天秋水。孤鹜落霞。</p><p>　　裴休为圆觉叙。有云。终日圆觉而未尝圆觉者凡夫也。具足圆觉而住持圆觉者如来也。</p><p>　　宋径山慈辨禅师宝印。别其语曰。具足圆觉。住持圆觉者凡夫也。终日圆觉。未尝圆觉者如来也。<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>录。</p><p>　　<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a></p><p>　　五法三<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>二无我。</p><p>　　径山杲颂云。陕府铁牛白癞。嘉州大象耳聩。两个病痛一般。咄哉漆桶不快。</p><p>　　维摩经</p><p>　　须菩提持钵入维摩舍乞食。时维摩诘。取钵盛饭谓言。汝能于食等者诸法亦等。诸法等者于食亦等。如是行乞。乃可取食。乃至彼外道六师是汝之师。彼师所堕。汝亦随堕。乃可取食。入诸邪见。不到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。住于八难。不得无难。同于<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。离清净法。汝得无诤三昧。一切众生亦得是定。其施汝者不名<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>汝者堕三恶道。为与众魔共一手。作诸劳侣。汝与众魔及诸尘劳。等无有异。于一切众生而有怨心。谤诸佛。毁于法。不入众数。终不得灭度。汝若如是。乃可取食。</p><p>　　妙喜颂云。独坐许谁知。青山对落晖。花须连夜发。莫待晓风吹。</p><p>　　<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a></p><p>　　佛谓阿难。见见之时。见非是见。见犹离见。见不能及。</p><p>　　竹庵圭云。落花有意随流水。流水无情恋落花径山杲颂云。春至百花开。秋来还落叶。黄面老瞿昙。休摇三寸舌海印信颂云。见不及处。江山满目。不睹纤毫。花红柳绿。白云出没本无心。流水滔滔岂盈缩。</p><p>　　汝等一人发真归元。此十方空。皆悉销陨。</p><p>　　尼无著颂云。一人发真归元。十方虚空消陨。试问杨岐栗蓬。何似云门胡饼。</p><p>　　诸可还者。自然非汝。不汝还者。非汝而谁。</p><p>　　竹庵圭云。常恨春归无觅处。不知转入此中来。喝一喝云。三十年后。莫道能仁教坏人家男女天目礼颂云。不汝还兮复是谁。残红落满钓鱼矶。日斜风动无人扫。燕子衔将水际飞。咄咄。是无等等咒。</p><p>　　阿难复白佛言。若此妙明真净妙心。本来遍圆。如是乃至大地草木。蠕动含灵。本元真如。即是如来成佛真体。佛体真实。云何复有地狱饿鬼畜生。</p><p>　　卍庵颜颂云。双剑峰前古寺基。天尊元是一牟尼。时难只得同香火。莫听闲人说是非。</p><p>　　佛告阿难。吾不见时。何不见吾不见之处。若见不见。自然非彼不见之相。若不见吾不见之地。自然非物。云何非汝。</p><p>　　雪窦显颂云。全象全牛意不殊。从来作者共名模。如今要见瞿昙老。刹刹尘尘在半途。湛堂准颂云。老胡彻底老婆心。为阿难陀意转深。韩干马嘶芳草渡。戴嵩牛卧绿杨阴。</p><p>　　若能转物。即同如来。</p><p>　　白云端颂云。若能转物即如来。春至山花处处开。自有一双穷相手。不曾容易舞三台。</p><p>　　<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a></p><p>　　是法住法位。世间相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。</p><p>　　朴翁铦颂云。世间相常住。黄莺啼绿树。真个可怜生。动著便飞去。</p><p>　　佛放眉间白毫相光。照东方万八千世界。</p><p>　　圆极岑颂云。蛮奴赤脚上皇州。卖尽珍奇跨白牛。贪著市朝人作市。又随歌舞上官楼。多意气好风流。月冷珠帘挂玉钩。分明忘却来时路。百尺竿头辊绣毬。</p><p>　　诸法从本来。常自寂灭相。</p><p>　　昔有僧诵此。忽起疑。日夕不置。忽闻莺声。顿然开悟。遂续前语为偈曰。诸法从本来。常自寂灭相。春至百花开。黄莺啼柳上。</p><p>　　假使满世间。皆如舍利弗。尽思共度量。不能测佛智。</p><p>　　破庵先颂云。雪子落纷纷。乌盆变白盆。忽然日头出。依旧是乌盆。</p><p>　　如来如实知见三界之相。无有生死若退若出。亦无在世及灭度者。非实非虚。非如非异。不如三界现于三界。如斯之事。如来明见无有错谬。</p><p>　　圆极岑颂云。岣嵝峰头神禹碑。字青石赤形模奇。无目仙人才一见。便应抚掌笑嘻嘻。云暗苍龙化葛陂。就中一句是正颂。有人检点得出。许你具一只眼。</p><p>　　大通智胜佛。十劫坐道场。佛法不现前。不得成佛道。</p><p>　　径山杲颂云。燕坐道场经十劫。一一从头俱漏泄。世间多少守株人。掉棒拟打天边月。</p> </div>"
    }
]