[
    {
        "title": "指月录卷之七",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p>　　▲泗州塔头侍者。及时锁门。有人问。既是<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>大师。为甚么被<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>锁。侍者无对。</p><p>　　<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>代云。弟子锁。大师锁法灯代云。还我锁匙来又老宿代云。吉州锁。虔州锁。</p><p>　　▲或问僧。承闻大德讲得肇论。是否。曰不敢。曰肇论有物不迁义。是否。曰是。或人遂以茶盏就地扑破曰。这个是迁不迁。无对。</p><p>　　法眼代抚掌三下。</p><p>　　▲有道流。在佛殿前背坐。僧曰。道士莫背佛。道流曰。大德本教中道。<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>充满于法界。向甚么处坐得。僧无对。</p><p>　　法眼代云。识得汝。</p><p>　　又有一<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。随法师入佛殿。行者向佛而唾。法师曰。行者少去就。何以唾佛。行者曰。将无佛处来。与某甲唾。法师无对。</p><p>　　沩山云。仁者却不仁者。不仁者却仁者仰山代法师云。但唾行者。又云。行者若有语。即向伊道。还我无行者处来。</p><p>　　▲台州六通院僧。欲渡船。有人问。既是六通。为甚么假船。无对。</p><p>　　天台韶代云。不欲惊众。</p><p>　　▲圣僧像被屋漏滴。有人问。既是圣僧。为甚么有漏。</p><p>　　天台韶代云。无漏不是圣僧。</p><p>　　▲死鱼浮于水上。有人问僧。鱼岂不是以水为命。曰是。曰为甚么却向水中死。无对。</p><p>　　天龙机代云。是伊为甚么不向岸上死。</p><p>　　▲江南相冯延巳。与数僧游钟山。至一人泉。问一人泉许多人争得足。一僧对曰。不教欠少。乃别云。谁人欠少。</p><p>　　法眼别云。谁是不足者。</p><p>　　▲有施主妇人入院。行众僧随年钱。僧云。圣僧前著一分。妇人曰。圣僧年多少。无对。</p><p>　　法眼代云。心期满处即知。</p><p>　　▲偃台感山主。到圆通院相看。第一座问曰。圆通无路。山主争得到来。无对。</p><p>　　归宗柔代云。不期又得相见。</p><p>　　▲有僧入冥<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>藏菩萨。地藏问。是你平生修何业。僧曰。念<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。曰止止不须说。我法妙难思。为是说是不说。无对。</p><p>　　归宗柔代云。此回去敢请<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。</p><p>　　▲鹞子趁鸽子。飞向佛殿栏干上颤。有人问僧。一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>在佛影中常安常乐。鸽子见佛。为甚么却颤。无对。</p><p>　　法灯代云。怕佛。</p><p>　　▲官人问僧。名甚么。曰无拣。官人曰。忽然将一碗沙与上座。又作么生。曰谢官人<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。</p><p>　　法眼别云。此犹是拣底。</p><p>　　▲广南有僧住庵。国主出猎。人报庵主。大王来请起。曰非但大王。佛来亦不起。王问。佛岂不是汝师。曰是。王曰。见师为甚么不起。无对。</p><p>　　法眼代云。未足酬恩。</p><p>　　▲僧问圆通和尚。一尘才起。大地全收。还见禅床么。圆通曰。唤甚么作尘。又问法灯。灯曰。唤甚么作禅床。</p><p>　　东禅齐云。此二尊宿语。还明伊问处。不明伊问处。若明伊问处。还得尽善也未。试断看。忽然向伊道。你指示我更要答话。又作么生会。莫道又答一转子。</p><p>　　▲有僧与童子上经了。令持经著函内。童子曰。某甲念底著向那里。</p><p>　　法灯代云。汝念甚么经。</p><p>　　▲先净照禅师。问楞严大师。经中道。若能转物。即同如来。若被物转。即名凡夫。只如升元阁。作么生转。严无对。</p><p>　　汾阳代云。彼此老大。</p><p>　　▲有僧到曹溪。守衣钵僧提起衣曰。此是大庾岭头提不起底。曰为甚么在上座手里。无对。</p><p>　　云门云。彼此不了。又云。将谓是师子儿。</p><p>　　▲昔高丽国来钱塘。刻观音圣像。及舁上船。竟不能动。因请入明州开元寺供养。后有设问。无刹不现身。圣像为甚么不去高丽国。</p><p>　　长庆棱代云。现身虽普。睹相生偏法眼别云。识得观音未。</p><p>　　▲有人问僧。点甚么灯。僧曰长明灯。曰甚么时点。曰去年点。曰长明何在。无对。</p><p>　　长庆棱代云。若不如此。知公不受人瞒法眼别云。利动君子。</p><p>　　▲有官人。入镇州天王院睹神像。因问院主曰。此是何<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。曰护国天王。曰只护此国。遍护余国。曰在秦为秦。在楚为楚。曰腊月二十九日。打破镇州城。天王向甚处去。主无对。</p><p>　　▲老宿有偈曰。<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>山头一段空。同门出入不相逢。<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来赁屋住。到头不识主人公。</p><p>　　有老宿云。既不识他。当初问甚么人赁。</p><p>　　▲有僧持钵到长者家。偶为犬伤。长者指<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>曰。龙披一缕。金翅不吞。大师全披法服。为甚却被狗咬。</p><p>　　▲宋太宗幸相国寺。问看经僧曰。是甚么经。曰仁王经。曰既是寡人经。因甚却在卿手里。无对。</p><p>　　雪窦代云。皇天无亲。惟德是辅。</p><p>　　幸开宝塔。问僧。卿是甚人。曰塔主。曰朕之塔。因甚卿作主。无对。</p><p>　　雪窦代云。阖国咸知。</p><p>　　僧朝宗。问甚处来。曰庐山卧云庵。曰朕闻卧云深处不朝天。因甚到此。无对。</p><p>　　雪窦代云。难逃至化。</p><p>　　僧入对次。奏曰。陛下还记得么。曰甚处相见来。曰<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>一别直至如今。曰以何为验。无对。</p><p>　　雪窦代云。贫道得得而来。</p><p>　　京寺回禄藏经毁。僧乞宣赐。召问。昔日摩腾不烧。如今为甚却烧。无对。</p><p>　　雪窦代云。陛下不忘付嘱。</p><p>　　宗尝梦神人报曰。请陛下发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。因早朝宣问左右街。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心作么生发。无对。</p><p>　　雪窦代云。实谓古今罕闻。</p><p>　　▲茶陵郁山主。不曾行脚。因庐山有化士至。论及宗门中事。教看僧问法灯。百尺竿头如何进步。灯曰恶。凡三年。一日乘驴度桥。一蹋桥板而堕。忽然大悟。遂有颂云。我有神珠一颗。久被尘劳关锁。今朝尘尽光生。照破山河万朵。因兹更不游方。师为白云端禅师得度师。</p><p>　　▲唐朝因禅师。微时尝运椎击土次。见一大块。戏椎猛击之。应手而碎。豁然大悟。</p><p>　　▲楼子和尚。不知何许人。亦不知其名氏。一日偶经游街市间。于酒楼下整袜带次。闻楼上人唱曲云。你既<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>我也休。忽然大悟。因号楼子焉。</p><p>　　▲神照本<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>师。尝以经王(此字应讹)请益四明尊者。者震声曰。汝名本如。师即领悟。作偈曰。处处逢归路。头头达故乡。本来成现事。何必待思量。</p><p>　　▲临安府上竺圆智证悟法师。台州林氏子。依白莲仙法师。问具变之道。莲指行灯曰。如此灯者。离性绝非。本自空寂。理则具矣。六凡四圣所见不同。变则在焉。师不契。后因扫地诵法华经。至知法常无性佛种从缘起。始谕旨告莲。莲然之。师领徒以来。常患本宗学者。胶于笔录。至以天台之传为文字之学。南宗鄙之。乃谒护国此庵元禅师。夜语次。师举东坡宿东林偈。(坡偈溪声便是广长舌。山色岂非清净身。夜来八万四千偈。他日如何举似人)且曰。也不易到此田地。庵曰。尚未见路径。何言到耶。曰溪声便是广长舌。山色岂非清净身。若不到此田地。如何有这个消息。庵曰。是门外汉耳。曰和尚不吝。可为说破。庵曰。却只从这里。猛著精彩觑捕看。若觑捕得他破。则亦知本命元辰落著处。师通夕不寐。及晓钟鸣。去其秘蓄。以前偈别曰。东坡<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>太饶舌。声色关中欲透身。溪若是声山是色。无山无水好愁人。(这汉思量了。一夜却寱语。东坡门外汉。这汉未及门)持以告此庵。庵曰。向汝道是门外汉。(且道是赏伊罚伊。莫错好)师礼谢俄有化马祖殿瓦者。求语发扬。师书曰。寄语江西老古锥。从教日炙与风吹。不是儿孙无料理。要见冰消瓦解时。此庵见之笑曰。须是这阇黎始得。</p><p>　　▲公期和尚。因往罗汉。路逢一骑牛公子。师问。罗汉路向甚么处去。公拍牛曰道道。师喝曰这畜生。公曰。罗汉路向甚么处去。师却拍牛曰道道。公曰直饶恁么。犹少蹄角在。师便打。公拍牛便走。</p><p>　　▲福州山东云顶禅师。有居士问。洞山道。有一物上拄天下拄地。未审是甚么物。师曰。担铁枷吃铁棒。曰天地黑山河走。师曰。阎老殿前添一鬼。北邙山下卧千年。曰快活快活。师曰。也是野狐吞老鼠。</p><p>　　▲昔有一老宿。一夏不为师僧说话。有僧叹曰。我只恁么空过一夏。不敢望和尚说<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。得闻正因两字也得。老宿闻乃曰。阇黎莫嘶速。若论正因。一字也无。道了扣齿云。适来无端。不合与么道。邻壁有一老宿闻曰。好一釜羹。被一颗鼠粪污却。</p><p>　　雪窦代云。谁家釜里无一两颗。</p><p>　　又一老宿。畜一童子。并不知轨则。有一行脚僧到。乃教童子礼仪。晚间见老宿外归。遂去问讯。老宿怪讶。遂问童子曰。阿谁教你。童曰。堂中某上座。老宿唤其僧来。问上座傍家行脚。是甚么心行。这童子养来二三年了。幸自可怜生。谁教上座教坏伊。快束装起去。黄昏雨淋淋地被趁出。</p><p>　　法眼云。古人恁么显露些子家风甚怪。且道意在于何。</p><p>　　▲昔有二庵主。旬日不相见。忽相会。上庵主问下庵主。多时不相见。向甚么处去。下庵主曰。在庵中造个无缝塔。上庵主曰。某甲也要造一个。就兄借取塔样子。下庵主曰。何不早说。却被人借去了也。</p><p>　　法眼云。且道是借他样。不借他样。</p><p>　　▲昔有一老宿曰。祖师九年面壁。为访知音。若恁么会得。吃铁棒有日在。又一老宿曰。祖师九年面壁。何不惭惶。若恁么会得。更买草鞋行脚三十年。</p><p>　　琅玡觉云。既不然。且道祖师面壁意作么生。良久云。欲得不招无间业。莫谤如来<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>轮。</p><p>　　▲昔有一老宿。因僧问。师子捉兔亦全其力。捉象亦全其力。未审全个甚么力。老宿曰。不欺之力。</p><p>　　法眼别云。不会古人语。</p><p>　　▲昔有婆子。供养一庵主。经二十年。常令一二八女子送饭给侍。一日令女子抱定曰。正恁么时如何。主曰。枯木倚寒岩。三冬无暖气。女子举似婆。婆曰。我二十年只供养得个俗汉。遂遣出烧却庵。</p><p>　　▲昔有婆子临斋。入赵州法堂云。这一堂师僧。总是婆婆生得底。唯有大底孩儿。五逆不孝。州才顾视。婆便出去。</p><p>　　▲昔有跨驴人。问众僧何往。僧曰。道场去。其人曰。何处不是道场。僧殴之曰。这汉没道理。向道场里跨驴不下。</p><p>　　▲肇法师在姚秦。临刑时说偈曰。四大元无主。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>本来空。将头临白刃。犹似斩春风。</p><p>　　玄沙云。大小肇法师。临死犹寱语。</p><p>　　▲双溪布衲如禅师。因嵩禅师戏以诗悼之曰。继祖常吾代。生缘行可规。终身常在道。识病懒寻医。貌古笔难写。情高世莫知。慈云布何处。孤月自相宜。师读罢举笔答曰。道契平生更有谁。闲卿于我最心知。当初未欲成相别。恐误同参一首诗。投笔坐亡。六十年后。塔户自启。真容俨然。</p><p>　　▲处州法海立禅师。因徽宗革本寺作神霄宫。师升座谓众曰。都缘未彻。所以说是说非。盖为不真。便乃分彼分此。我身尚且不有。身外乌足道哉。正眼观来。一场笑具。今则圣君垂旨。更僧寺作神霄。佛头添个冠儿。算来有何不可。山僧今日不免横担拄杖。高挂钵囊。向无缝塔中安身立命。于无根树下啸月吟风。一任乘云仙客。来此咒水书符。叩牙作法。他年成道。白日上升。堪报不报之恩。以助无为之化。只恐不是玉。是玉也大奇。然虽如是。且道山僧转身一句。作么生道。还委悉么。掷下拂子。竟尔趋寂。郡守具奏。诏仍改寺额曰真身。</p><p>　　又汝州天宁明禅师。改德士日。登座谢恩毕。乃曰。木简信手拈来。坐具乘时<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>。云散水流去。寂然天地空。即敛目而逝。</p><p>　　▲幽栖禅师。因僧为师造寿塔毕。师乃领众看塔。即入塔内端坐云。一客不烦两主人。便告寂。众僧竞唤云。和尚许多年住世。不可便即恁么去。遂舁归。主事办斋了。师复上堂告众曰。不得唤作是。不得唤作非。汝唤作甚么。时有僧出。承闻和尚有言。不得唤作是。不得唤作非。未审唤作甚么。师便珍重告寂。</p><p>　　▲魏府老洞华严。尝示众曰。佛法在日用处。行住坐卧处。吃茶吃饭处。语言相问处。所作所为处。举心动念又却不是也。又曰。时当缺减。人寿少有登六七十者。汝辈入我法中。整顿手脚未稳。早是三四十年。须臾衰病至。衰病至则老至。老至则死至。前去几何。尚复恣意。何不初中后夜纯静去。文潞公镇北京。洞老来谒别。文潞公曰。法师老矣。复何往。对曰。入灭去。潞公笑谓其戏语。归与子弟。言其道韵深稳。谈笑有味。非常僧也。使人候之。果入灭矣叹异久之。及阇维亲往视火。以琉璃瓶置座前祝曰。佛法果灵。愿<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>填吾瓶。言卒烟自空而降。布入瓶中。烟灭如所愿。潞公自是竭诚内典。恨知之暮也。</p><p>　　▲太瘤蜀僧。居众尝叹佛法混滥。异见蜂起。乃曰。我<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>若得真正知见。当不惜口业。遂发愿礼马祖塔。长年不辍。忽一日塔放白光。感而有悟。后遍至<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。勘验老宿。过雪窦山前云。这老汉。口里水漉漉地。雪窦闻其语。意似不平。及太见雪窦。窦云。你不肯老僧那。太云。老汉果然口里水漉漉地。遂摵一坐具便出。直岁不甘。中路令人殴打。损太一足。太云。此是雪窦老汉使之。他日须折一足偿我。后果如其言。太后至都下。放意市肆中。有官人请居家供养。太屡告辞。官人确留愈加敬礼。每使侍妾馈食。一日见官人至。故挑其妾。官人以此改礼。遂得辞去。不数日闹市中端坐而化。</p><p>　　▲欧阳文忠公。昔官洛中。一日游嵩山。却去仆吏。放意而往。至一山寺。入门修竹满轩。霜清鸟啼。风物鲜明。文忠休于殿陛。旁有老僧。阅经自若。与语不甚顾答。文忠异之。问曰。道人住山久如。对曰甚久也。又问诵何经。对曰法华经。文忠曰。古之高僧。临<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之际。类皆谈笑脱去。何道致之耶。对曰。定慧力耳。又问。今乃寂寥无有何哉。老僧笑曰。古之人念念在定慧。<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>安得乱。今之人念念在散乱。临终安得定。文忠大喜。不自知膝之屈也。</p><p>　　谢希深。有文记其事。</p><p>　　▲盐官会下。有一主事僧。忽见一鬼使来追。僧告曰。某甲身为主事。未暇<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。乞容七日得否。使曰。待为白王。若许即七日后来。不然须臾便至。言讫不见。至七日后。觅其僧了不可得。后有人举问一僧。若被觅著时。如何抵拟他。</p><p>　　洞山代云。被他觅得也。</p><p>　　▲昔有官人。作无鬼论。中夜挥毫次。忽见一鬼出云。汝道无。我聻。</p><p>　　五祖演云。老僧当时若见。但以手作鹁鸠嘴。向伊道谷呱呱。</p><p>　　▲昔有古德。一日不赴堂。侍者请赴堂。德曰。我今日在庄上吃油糍饱也。侍者曰。和尚不曾出入。德曰。汝去问庄主。者方出门。忽见庄主来谢和尚到庄。</p><p>　　径山杲颂云。和尚不赴堂。庄主谢临屈。一字入公门。九牛拔不出颂古指为南泉事。会元列鹅湖孚章中。</p><p>　　▲昔有外道。问一入定僧云。轮王众生种。非佛非罗汉。不受后有身。是甚么义。僧便入定以问<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>。却出定述弥勒语答云。譬如陶师埏埴成器。</p><p>　　▲唐僧元晓者。海东人。初航海而至。将访道于名山。独行荒陂。夜宿冢间。渴甚。引手掬于穴中得泉甘凉。黎明视之髑髅也。大恶之。尽欲呕去。忽猛省大叹曰。心生则种种法生。心灭则髑髅不二。如来大师曰。三界<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。岂欺我哉。遂不复求师还海东。疏<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>。</p><p>　　林间录曰。玄沙备禅师。薪于山中。旁僧呼曰。和尚看虎。玄沙见虎顾僧曰。是你。灵润法师山行。野烧迅飞而来。同游者皆避之。润安步如常。曰心外无火。火实是心。谓火可逃。无由免火。火至而灭。严阳尊者。单丁住山。蛇虎就手而食。归宗常公刈草。见蛇芟之。傍僧曰。久闻归宗。今日乃见一粗行<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。常曰。你粗我粗耶。吾闻亲近<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。有四种验心。谓就理。就事。入就。出就。事理之外。宗门又有四藏锋之用。亲近以自治。藏锋之用以治物。</p><p>　　▲唐修雅法师。听诵法华经歌。山色沉沉。松烟幂幂。空林之下。盘陀之石。石上有僧。结跏横锡。诵白莲经。从旦至夕。左之右之。虎迹狼迹。十片五片。异花狼籍。偶然相见。未深相识。知是古之人今之人。是昙彦是昙翼。我闻此经有深旨。觉帝称之真妙义。合目冥心子细听。醍醐滴入焦肠里。佛之意兮祖之髓。我之心兮经之旨。可怜弹指及举手。不达目前今正是。大矣哉甚奇特。空王要使群生得。光辉一万八千土。土土皆作黄金色。四生<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>一光中。狂夫犹自问弥勒。我亦当年学空寂。一得无心便休息。今日亲闻诵此经。始觉驴乘匪端的。我亦当年不出户。不欲红尘沾步武。今日亲闻诵此经。始觉行行皆宝所。我亦当年爱吟咏。将谓冥搜乱<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。今日亲闻诵此经。何妨笔研资真性。我亦当年狎儿戏。将谓光阴半虚弃。今日亲闻诵此经。始觉聚沙非小事。我昔曾游山与水。将谓他山非故里。今日亲闻诵此经。始觉山河无寸地。我昔心猿未调伏。常将金锁虚拘束。今日亲闻诵此经。始觉无物为拳拲。师诵此经经一字。字字烂嚼醍醐味。醍醐之味珍且美。不在唇不在齿。只在劳生方寸里。师诵此经经一句。句句白牛亲动步。白牛之步疾如风。不在西不在东。只在浮生日用中。日用不知一何苦。酒之肠饭之腑。长者扬声唤不回。何异聋何异瞽。世人之耳非不聪。耳聪特向经中聋。世人之目非不明。目明特向经中盲。合聪不聪。合明不明。辘轳上下。浪死虚生。世人总识师之音。谁人能识师之心。世人总识师之形。何人能识师之名。师名医王行佛令。来与众生治心病。能使迷者醒狂者定。垢者净邪者正凡者圣。如是则非但人恭敬。亦合龙赞咏鬼赞咏佛赞咏。岂得背觉合尘之徒。不稽首而归命。</p><p>　　▲僧文通慧者。河南开封府白云寺僧也。其师令掌盥盆。偶有市鲜者。濯于盆。文恚击之。遽陨。因潜奔华州总持寺。久之为长老。盖二十年余矣。一日忽语其徒曰。二十年前一段公案。今日当了。众问故。曰日午当自知之。遂趺坐以俟时。张浚统兵至关中。一卒持弓矢。至法堂瞪目视文。将射之。文笑曰。老僧相待久矣。卒曰。素未相面。今见而恚心不可遏。即欲相戕何耶。文语以昔故。卒遽说偈曰。冤冤相报何时了。劫劫相缠岂偶然。不若与师俱解释。如今立地往西天。视之已立化矣。文即索笔书偈曰。三十三年飘荡。做了几番模样。谁知今日相逢。却是在前变障。书毕泊然而化(一统志)。</p> </div>"
    }
]