[
    {
        "title": "指月录卷之二",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p>　　▲文殊菩萨</p>\n<p>　　一日令善财采药曰。是药者采将来。善财遍观大地。无不是药。却来白曰。无有不是药者。殊曰。是药者采将来。善财遂于地上拈一茎草。度与文殊。殊接得示众曰。此药能杀人。亦能活人。</p>\n<p>　　首山念云。文殊大似掩耳偷铃琅玡觉云。文殊可谓诚实之言。要且额头汗出。口里胶生天童华云。大小文殊。被善财换却眼睛石田薰颂云。采药与用药。相逢一会家。杀人活人不眨眼。白玉无瑕却有瑕。</p>\n<p>　　文殊问庵提遮女曰。生以何为义。女曰。生以不生生为生义。殊曰。如何是生以不生生为生义。女曰。若能明知地水火风四缘。未尝自得。有所和合。而能随其所宜。是为生义。殊曰。死以何为义。女曰。死以不死死为死义。殊曰。如何是死以不死死为死义。女曰。若能明知地水火风四缘。未尝自得。有所离散。而能随其所宜。是为死义庵提遮女问文殊曰。明知生是不生之理。为何却被<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之所<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。殊曰。其力未充。</p>\n<p>　　进山主问修山主。明知生是不生之理。为甚么却被生死之所流转。修曰。笋毕竟成竹去。如今作篾使还得么。进云。汝向后自悟去在。修云。某甲所见只如此。上座意旨如何。进指云。这个是监院房。那个是典座房。修乃礼谢简翁敬颂云。问处分明答处端。当机觌面不相瞒。死生生死元无际。月上青山玉一团。</p>\n<p>　　文殊大士。尝谓善住意天子云。汝今若能违背诸佛。毁谤法僧。吾即将同汝如是梵行。天子云。大士。今何故复如是语。大士云。天子。如汝意者。以何为佛。天子云。如<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界。我言是佛。大士云。天子。于汝意云何。如如法界可染著乎。天子云。弗也。大士云。以是义故。我如是说。汝今若能背毁<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧。吾将同汝如是梵<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>住天子(准上应有意字。此或另是一天子)而白文殊。可共俱往如来之所。咨受未闻。亦同此时如法问难。文殊云。尔莫分别取著如来。天子云。如来今在何所。令我莫著。文殊云。只在目前。天子云。若如是者。我何不见。文殊云。尔若一切不见。是名真见如来。天子云。若见在前。云何戒我莫取著如来。文殊云。尔今见前何有。天子云。有<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>界。文殊云。如来者虚空界。是故虚空界者即是如来。此中无有一物可分别者。</p>\n<p>　　大小文殊。趁著天子脚跟转。天子却惺惺。文殊未具眼。</p>\n<p>　　▲天亲菩萨</p>\n<p>　　从<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>内宫而下。无著菩萨问曰。人间四百年。彼天为一昼夜。弥勒于一时中。成就五百亿天子。证无生法忍。未审说甚么法。天亲曰。只说这个法。祗是<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>清雅。令人乐闻。</p>\n<p>　　荐福怀云。弥勒已是错说。天亲已是错传。山僧今日将错就错。与你诸人注破。良久云。谛听谛听。向下文长。付在来日。</p>\n<p>　　▲维摩会上。三十二菩萨。各说<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。文殊曰。我于一切法。无言无说无示无识。离诸问答。是为菩萨入不二法门。于是文殊又问维摩。仁者当说。何等是菩萨入不二法门。维摩默然。文殊赞曰。乃至无有语言文字。是菩萨真入不二法门。</p>\n<p>　　雪窦举此。至仁者当说何等是菩萨入不二法门。不举维摩默然。便云。维摩道甚么。又云勘破了也。复颂云。咄这维摩老。悲生空懊恼。卧疾毗耶离。全身大枯槁。七<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>师来。一室且频扫。请问不二门当时便靠倒。不靠倒。金毛师子无处讨。圜悟勤云。如今禅和子便道。无语是靠倒。且莫错认定盘星白云端颂云。一个两个百千万。屈指寻文数不办。暂时放在暗窗前。明日与君重计算。</p>\n<p>　　▲善财</p>\n<p>　　参五十三员善知识。末后到弥勒阁前。见楼阁门闭。瞻仰赞叹。见弥勒从别处来。善财作礼曰。愿楼阁门开。令我得入。寻时弥勒至善财前。弹指一声。楼阁门开。善财入已。阁门即闭。见百千万亿楼阁。一一楼阁内有一弥勒。领诸眷属。并一善财。而立其前善财因无著菩萨问曰。我欲见文殊。何者即是。财曰。汝发一念心清净即是。无著曰。我发一念心清净。为甚么不见。财曰。是真见文殊。</p>\n<p>　　▲须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>尊者</p>\n<p>　　在岩中宴坐。诸天雨花赞叹。者曰。空中雨花赞叹。复是何人。云何赞叹。天曰。我是梵天。敬重尊者善说<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。者曰。我于般若未尝说一字。云何赞叹。天曰。如是尊者无说。我乃无闻。无说无闻。是真说般若尊者一日<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>次。帝释雨花。者乃问。此花从天得耶。从地得耶。从人得耶。释曰弗也。者曰。从何得耶。释乃举手。者曰。如是如是。</p>\n<p>　　云门偃云。帝释举手处。与你四大<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。释迦老子。是同是别妙喜曰。须菩提解空第一。生时家室尽空。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>才升座。须菩提便出众云。希有世尊。且道见甚么道理。便恁么道。天亲菩萨作无量偈。只赞希有二字。圜悟禅师云。一句是一个铁橛。故六祖闻应无所住而生其心。便悟去。</p>\n<p>　　▲无厌足王</p>\n<p>　　入大寂定。乃敕有情无情。皆顺于王。若有一物不顺于王。即入大寂定不得。</p>\n<p>　　紧那罗王。奏无生乐<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。佛乃敕有情无情。俱随王去。若有一物不随王去。即去佛处不得。</p>\n<p>　　▲<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗尊者</p>\n<p>　　因入城。遥见月上女出城。舍利弗心口思惟。此姊见佛否。知得忍不得忍否。我当问之。才近便问。大姊往甚么处去。女曰。如舍利弗与么去。弗曰。我方入城。汝方出城。何言如我恁么去。女曰。诸<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>当依何住。弗曰。诸佛<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>依大<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>而住。女曰。诸佛弟子既依大涅槃而住。我亦如舍利弗与么去舍利弗问须菩提。梦中说<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。与觉时同异。提曰。此义深远。吾不能说。会中有弥勒大士。汝往彼问。舍利弗问弥勒。弥勒云。谁是弥勒。谁名弥勒舍利弗问天女曰。何以不转女身。女曰。我从十二年来。求女人相。了不可得。当何所转。即时天女以<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力。变舍利弗。令如天女。女自<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>如舍利弗。乃问言。何以不转女身。舍利弗以天女像而答言。我今不知云何转面而变为女身。</p>\n<p>　　▲鸯崛魔罗尊者</p>\n<p>　　未<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>时。外道受教。为憍尸迦欲登王位。用千人拇指为花冠。已得九百九十九。唯欠一指。遂欲杀母取指。时佛在<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>。以天眼观之。乃作<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。在鸯崛前。鸯崛遂释母欲杀佛。佛徐行。鸯崛急行。追之不及。乃唤曰。瞿昙住住。佛告曰。我住久矣。是汝不住。鸯崛闻之。心忽开悟。遂弃刃投佛出家。</p>\n<p>　　▲宾头卢尊者</p>\n<p>　　因阿育王内宫。斋三万大阿罗汉。躬自行香。见第一座无人。王问其故。海意尊者曰。此是宾头卢位。此人近见佛来。王曰。今在何处。者曰。且待须臾。言讫。宾头卢从空而下。王请就座礼敬。者不顾。王乃问。承闻尊者亲见佛来。是否。者以手策起眉曰。会么。王曰不会。者曰。阿耨达池龙王。曾请佛斋。吾是时亦预其数。</p>\n<p>　　翠岩真云。且道甚么处见。直饶雪天缥缈。湖光澹荡。且莫说梦。</p>\n<p>　　▲障蔽魔王</p>\n<p>　　领诸眷属。一千年随金刚齐菩萨。觅起处不得。忽一日得见。乃问曰。汝当依何而住。我一千年觅汝起处不得。齐曰。我不依有住而住。不依无住而住。如是而住。</p>\n<p>　　<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>云。障蔽魔王不见金刚齐即从。只如金刚齐。还见障蔽魔王么。妙喜曰。既觅起处不得。一千年随从底是甚么。金刚齐云。我不依有住而住。不依无住而住。互相热谩。法眼道。障蔽魔王。不见金刚齐即且从。只如金刚齐。还见障蔽魔王么。恁么批判。也是看孔著楔。即今莫有知得妙喜起处底么。随后咄云。寐语作么。</p>\n<p>　　▲那吒太子</p>\n<p>　　析骨还父。析肉还母。然后现本身。运大神力。为父母说法。</p>\n<p>　　▲广额屠儿</p>\n<p>　　于涅槃会上。<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>屠刀。立便<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。自云。是贤劫千佛一数。</p>\n<p>　　东山觉拈云。今时<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。将为广额是过去一佛。权现屠儿。且喜没交涉。又谓广额是杀人不眨眼底汉。飏下屠刀立便成佛。且喜没交涉。又道广额飏下屠刀曰。我是千佛一数。这一佛多少分明。且喜没交涉。要识广额么。夹路桃花风雨后。马蹄何处避残红文殊思业禅师。世为屠宰。一日戮猪次。忽洞彻心源。遂弃业为<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。述偈曰。昨日夜叉心。今朝菩萨面。菩萨与夜叉。不隔一条线。往见文殊心道禅师。道佛鉴法嗣也。殊曰。你正杀猪时。见个甚么。便乃剃头行脚。师遂作鼓刀势。殊喝曰。这屠儿。参堂去。师便下参堂。住文殊日。上堂。举赵州勘婆话乃曰。勘破婆子。面青眼黑。赵州老汉。瞒我不得。</p>\n<p>　　▲秦跋陀禅师</p>\n<p>　　问生法师。讲何经论。生曰。大般若经。师曰。作么生说色空义。曰众微聚曰色。众微无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>曰空。师曰。众微未聚。唤作甚么。生罔措。师又问。别讲何经论。曰大<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。师曰。如何说涅槃之义。曰涅而不生。槃而不灭。不生不灭。故曰涅槃。师曰。这个是如来涅槃。那个是法师涅槃。曰涅槃之义岂有二耶。某甲只如此。未审禅师如何说涅槃。师拈起如意曰。还见么。曰见。师曰。见个甚么。曰见禅师手中如意。师将如意掷于地曰。见么。曰见。师曰。见个甚么。曰见禅师手中如意堕地。师斥曰。观公见解。未出常流。何得名喧宇宙。拂衣而去。其徒怀疑不已。乃追师扣问。我师说色空涅槃。不契。未审禅师如何说色空义。师曰。不道汝师说得不是。汝师只说得果上色空。不会说得因中色空。其徒曰。如何是因中色空。师曰。一微空故众微空。众微空故一微空。一微空中无众微。众微空中无一微。</p>\n<p>　　高僧传。作佛驮跋陀罗。问鸠摩罗什语。佛驮跋陀罗。乃佛大先弟子也。</p>\n<p>　　▲宝志禅师</p>\n<p>　　金陵东阳民朱氏之妇。上巳日。闻儿啼鹰窠中。梯树得之。举以为子。七岁依钟山大沙门僧俭出家。专修禅观。宋太始二年。发而徒跣。著锦袍往来皖山剑水之下。以剪尺拂子拄杖头。负之而行梁武帝诏问。弟子烦惑未除。何以治之。答曰十二。帝问其旨如何。答曰。在书字时节刻漏中。帝益不晓帝又问。弟子何时得以静心修习。师曰。安乐禁。</p>\n<p>　　幻寄曰。志公安乐禁。及十二。其旨与达磨之不识。德山棒。临济喝。皆自灵山拈花一脉相承。如涂毒鼓。如太阿剑。闻之者丧。婴之者断。不可以心思意解者。而或者谓。十二乃<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。治惑药也。其在书字时节刻漏中。乃书之在十二时中也。安乐禁。禁者止也。至安乐时乃止耳。此所以为修习也。是以赵州庭柏。为<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a><a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。沩山拂子。为附物显理者。同道座主奴也。何足以语此或者语出传灯录。梁武未识达磨。举朝亦不识志公。</p>\n<p>　　帝尝诏画工张僧繇。写师像。僧繇下笔。辄不自定。师遂以指剺面门。分披出十二面观音。妙相殊丽。或慈或威。僧繇竟不能写。他日与帝临江纵望。有物溯流而上。师以杖引之。随杖而至。乃紫栴檀也。即以属供奉官俞绍。令雕师像。顷刻而成。神彩如生师尝数日不食无饥容。时或歌吟。词如谶记。灵迹炳著。士庶皆共事之。初齐建元中。武帝谓师惑众。收付建康狱。既旦。人见其入市。及检狱如故。建康令以事闻。帝延之于华林园。忽一日重著三布帽。亦不知于何所得之。俄豫章王文惠太子相继薨。齐亦以此衰矣。由是禁师出入。至梁乃下诏褒师令勿复禁师问一梵僧。承闻尊者唤我作屠儿。曾见我<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>么。曰见。师曰。有见见。无见见。不有不无见。若有见见。是凡夫见。无见见。是声闻见。不有不无见。是外道见。未审尊者如何见。梵僧曰。你有此等见耶。</p>\n<p>　　汾阳曰。不枉西来。</p>\n<p>　　师垂语曰终日拈香择火。不知身是道场又曰。京都邺都浩浩。还是菩提大道。</p>\n<p>　　法眼别云。京都邺都浩浩。不是菩提大道。</p>\n<p>　　又曰。如我身空诸法空。千品万类悉皆同。</p>\n<p>　　云门云。你立不见立。行不见行。四大五蕴不可得。何处见有山河大地来。是你每日把钵盂噇饭。唤甚么作饭。何处更有一粒米来。</p>\n<p>　　大乘赞十首大道常在目前。虽在目前难睹。若欲悟道真体。莫除声色言语。言语即是大道。不假断除<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。烦恼本来空寂。妄情递相缠绕。一切如影如响。不知何恶何好。有心取相为实。定知见性不了。若欲作业求佛。佛是生死大兆。生死业常随身。黑闇狱中未晓。悟理本来无异。觉后谁晚谁早。法界量同太虚。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>智心自小。但能不起吾我。涅槃法食常饱。(一)妄身临镜照影。影与妄身不殊。但欲去影留形。不知身本同虚。身本与影不异。不得一有一无。若欲存一舍一。永与直理相疏。更若爱圣憎凡。生死海里沉浮。烦恼因心有故。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>烦恼何居。不劳分别取相。自然得道须臾。梦时梦中造作。觉时觉境都无。翻思觉时与梦。颠倒二见不殊。改迷取觉求利。何异贩卖商徒。动静两忘常寂。自然契合真如。若言众生异佛。迢迢与佛常疏。佛与众生不二。自然究竟无余。(二)法性本来常寂。荡荡无有边畔。安心取舍之间。被他二境回换。敛容入定<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>。摄境安心觉观。机关木人<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。何时得达<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。诸法本空无著。境似浮云会散。忽悟本性元空。恰似热病得汗。无智人前莫说。打你色身星散。(三)报你众生直道。非有即是非无。非有非无不二。何须对有论虚。有无妄心立号。一破一个不居。两名由尔情作。无情即是真如。若欲存情觅佛。将网山上罗鱼。徒费工夫无益。几许枉用工夫。不解即心即佛。真似骑驴觅驴。一切不憎不爱。这个烦恼须除。除之则须除身。除身无佛无因。无佛无因可得。自然无法无人。(四)大道不由行得。说行权为凡愚。得理返观于行。始知枉用工夫。未悟圆通大理。要须言行相扶。不得执他知解。回光返本全无。有谁解会此说。教君向己推求。自见昔时罪过。除却五欲疮疣。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>逍遥<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。随方贱卖风流。谁是<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>买者。亦得似我无忧。(五)内见外见总恶。佛道魔道俱错。被此二大波旬。便见厌苦求乐。生死悟本体空。佛魔何处安著。只由妄情分别。前身后身孤薄。<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a><a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>不停。结业不能除却。所以流浪生死。皆由横生经略。身本虚无不实。返本是谁斟酌。有<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>自能为。不劳妄心卜度。众生身同太虚。烦恼何处安著。但无一切希求。烦恼自然销落。(六)可笑众生蠢蠢。各执一般异见。但欲傍鏊求饼。不解返本观面。面是正邪之本。由人造作百变。所须任意纵横。不假偏耽爱恋。无著即是解脱。有求又遭罗罥。慈心一切平等。真如菩提自现。若怀彼我二心。对面不见佛面。(七)<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>几许痴人。将道复欲求道。广寻诸义纷纷。自救己身不了。专寻他文乱说。自称至理妙好。徒劳一生虚过。永劫沉沦生老。浊爱缠心不舍。清净智心自恼。真如法界丛林。反作荆棘荒草。但执黄叶为金。不悟弃金求宝。所以失念狂走。强力装持相好。口内诵经诵论。心里寻常枯槁。一朝觉本心空。具足真如不少。(八)声闻心心断惑。能断之心是贼。贼贼递相除遣。何时了本语默。口内诵经千卷。体上问经不识。不解佛法圆通。徒劳寻行数墨。头陀阿练苦行。希望后身<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。希望即是隔圣。大道何由可得。譬如梦里渡河。船师渡过河北。忽觉床上安眠。失却渡船轨则。船师及彼渡人。两个本不相识。众生迷倒羁绊。往来三界疲极。<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>生死如梦。一切求心自息。(九)悟解即是菩提。了本无有阶梯。堪叹凡夫伛偻。八十不能跋蹄。徒劳一生虚过。不觉日月迁移。向上看他师口。恰似失奶孩儿。道俗峥嵘聚集。终日听他死语。不观己身<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。心行贪如狼虎。堪嗟二乘狭劣。要须摧伏六府。不食酒肉五辛。邪眼看他饮咀。更有邪行猖狂。修气不食盐醋。若悟上乘至真。不假分别男女(十)十四科颂十四首菩提烦恼不二众生不解修道。便欲断除烦恼。烦恼本来空寂。将道更欲觅道。一念之心即是。何须别处寻讨。大道只在目前。愚倒迷人不了。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>天真自然。亦无<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>修造。不识三毒虚假。妄执浮沉生老。昔时迷日为晚。今日始觉非早持犯不二丈夫运用无碍。不为<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>所制。持犯本自无生。愚人被他禁系。智者造作皆空。声闻触途为滞。大士肉眼圆通。二乘天眼有翳。空中妄执有无。不达色心无碍。菩萨与俗同居。清净曾无染世。愚人贪著涅槃。智者生死实际。法性空无言说。缘起略无人会。百岁无智小儿。小儿有智百岁佛与众生不二众生与佛无殊。大智不异于愚。何须向外求宝。身田自有明珠。正道邪道不二。了知凡圣同途。迷悟本无差别。涅槃生死一如。究竟攀缘空寂。惟求意想清虚。无有一法可得。翛然自入无余事理不二心王自在翛然。法性本无十缠。一切无非佛事。何须摄念坐禅。<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>本来空寂。不用断除攀缘。智者无心可得。自然无诤无喧。不识无为大道。何时得证幽玄。佛与众生一种。众生即是世尊。凡夫妄生分别。无中执有迷奔。了达贪嗔空寂。何处不是真门静乱不二声闻厌喧求静。犹如弃面求饼。饼即从来是面。造作随人百变。烦恼即是菩提。无心即是无境。生死即是涅槃。贪嗔如焰如影。智者无心求佛。愚人执邪执正。徒劳空过一生。不见如来妙顶。了达淫欲性空。镬汤罏炭自冷<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>不二我自身心快乐。翛然无善无恶。法身自在无方。触目无非正觉。六尘本来空寂。凡夫妄生执著。涅槃生死本平。四海阿谁厚薄。无为大道自然。不用将心画度。菩萨散诞灵通。所作常含妙觉。声闻执法坐禅。如蚕吐丝自缚。法性本来圆明。病愈何须执药。了知诸法平等。翛然清虚快乐色空不二法性本无青黄。众生谩造文章。吾我说他<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。自意扰扰颠狂。不识圆通妙理。何时得会真常。自疾不能治疗。却教他人药方。外看将为是善。心内犹若豺狼。愚人畏其<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。智者不异天堂。对境心常不起。举足皆是道场。佛与众生不二。众生自作分张。若欲除却三毒。迢迢不离灾殃。智者知心是佛。愚人乐往西方生死不二世间诸法如幻。生死犹若雷电。法身自在圆通。出入山河无间。颠倒妄想本空。般若无迷无乱。三毒本自解脱。何须摄念禅观。只为愚人不了。从他戒律决断。不识寂灭真如。何时得登彼岸。智者无恶可断。运用随心合散。法性本来空寂。不为生死所绊。若欲断除烦恼。此是无明痴汉。烦恼即是菩提。何用别求禅观。实际无佛无魔。心体无形无段断除不二丈夫运用堂堂。逍遥自在无妨。一切不能为害。坚固犹若金刚。不著二边中道。翛然非断非常。五欲贪嗔是佛。地狱不异天堂。愚人妄生分别。流浪生死猖狂。智者达色无碍。声闻无不恓惶。法性本无瑕翳。众生妄执青黄。如来引接迷愚。或说地狱天堂。弥勒身中自有。何须别处思量。弃却真如佛像。此人即是颠狂。声闻心中不了。惟只趁逐言章。言章本非真道。转加斗争刚强。心里蚖蛇蝮蝎。螫著便即遭伤。不解文中取义。何时得会真常。死入无间地狱。<a href=\"/remen/shenshi.html\" class=\"keylink\" target=\"_blank\">神识</a>枉受灾殃真俗不二法师说法极好。心中不离烦恼。口谈文字化他。转更增他生老。真妄本来不二。凡夫弃妄觅道。<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>云集听讲。高座论义浩浩。南坐北坐相争。四众为言(疑嫌)为好。虽然口谈<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。心里寻常枯燥。自己元无一钱。日夜数他珍宝。恰似无智愚人。弃却真金担草。心中三毒不舍。未审何时得道解缚不二律师持律自缚。自缚亦能缚他。外作威仪恬静。心内恰似洪波。不驾生死船筏。如何渡得爱河。不解真宗正理。邪见言辞繁多。有二比丘犯律。便却往问优波。优波依律说罪。转增比丘网罗。方丈室中<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>。维摩便即来诃。优波默然无对。净名说法无过。而彼戒性如空。不在内外娑婆。劝除生灭不肯。忽悟还同释迦境照不二禅师体离无明。烦恼从何处生。地狱天堂一相。涅槃生死空名。亦无贪嗔可断。亦无佛道可成。众生与佛平等。自然圣智惺惺。不为六尘所染。句句独契无生。正觉一念玄解。三世坦然皆平。非法非律自制。翛然真入圆成。绝此四句百非。如空无作无依运用无碍我今滔滔自在。不羡公王卿宰。四时犹若金刚。苦乐心常不改。法宝逾于须弥。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>广于江海。不为八风所牵。亦无<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a><a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。任性浮沉若颠。散诞纵横自在。这(应是遮)莫刀剑临头。我曰(应是亦)安然不辨迷悟不二迷时以空为色。悟即以色为空。迷悟本无差别。色空究竟还同。愚人唤南作北。智者达无西东。欲觅如来妙理。常在一念之中。阳焰本非其水。渴鹿狂趁匆匆。自身虚假不实。将空更欲觅空。世人迷倒至甚。如犬吠雷叿叿十二时颂平旦寅。狂机内有道人身。穷苦已经<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>。不信常擎如意珍。若捉物入迷津。但有纤毫即是尘。不住旧时<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>貌。外求知识也非真日出卯。用处不须生善巧。纵使神光照有无。起意便遭魔事娆。若施功终不了。日夜被他人我拗。不用安排只么从。何曾心地生烦恼食时辰。无明本是释迦身。坐卧不知元是道。只么忙忙受苦辛。认声色觅疏亲。只是他家染污人。若拟将心求佛道。问取虚空始出尘禺中巳。未了之人教不至。假使通达祖师言。莫向心头安了义。只守玄没文字。认著依前还不是。暂时自肯不追寻。旷劫不遭魔境使日南午。四大身中无价宝。阳焰空华不肯抛。作意<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>转辛苦。不曾迷莫求悟。任你朝阳几回暮。有相身中无相身。无明路上无生路日昳未。心地何曾安了义。他家文字没亲疏。不用将心求的意。任纵横绝忌讳。长在人间不在世。运用不离声色中。历劫何曾暂抛弃晡时申。学道先须不厌贫。有相本来权积聚。无形何用要求真。作净洁却劳神。万(应是方)认愚痴作近邻。言下不求无处所。暂时唤作出家人目入酉。虚幻声音不长久。禅悦珍羞尚不餐。谁能更饮无明酒。勿可抛勿可守。荡荡逍遥不曾有。纵你多闻达古今。也是痴狂外边走黄昏戌。狂子施功投暗室。假使心通无量时。历劫何曾异今日。拟商量却啾唧。转使心头黑如漆。昼夜舒光照有无。疑人唤作波罗蜜人定亥。勇猛精进成懈怠。不起纤毫修学心。无相光中常自在。超释迦越祖代。心有微尘还质(应作窒)碍放荡长如痴兀人。他家自有通人爱半夜子。心住无生即生死。生死何曾属有无。用时便用无文字。祖师言外边事。识取起时还不是。作意搜求实没踪。生死魔来任相试鸡鸣丑。一颗圆光明已久。内外推寻觅总无。境上施为浑大有。不见头亦无手。天地坏时渠不朽。未了之人听一言。只这如今谁动口。</p>\n<p>　　洪觉范曰。志公十二时歌。大明佛祖要妙。然年代寖远。昧者多改易其语。以狥其私。其大害意者。如曰夜半子。心住无生即生死。心法何曾属有无。用时便用没文字。乃作生死何曾属有无。言则工矣。然下句血脉不贯。既曰生死不属有无。又曰用时便用。何哉幻寄曰。觉范于文字转接处。求志公语脉。既其华未既其实。使生死不属有无。不可用时便用。则心法不属有无。又何可用时便用。且知生之未尝生。死之未尝死。翛然而来。翛然而往。非生死不属有无。而用时便用乎。见有生死则有心法。见无生死则无心法。不见古人道。生死中无佛则无生死耶。生死心法同一幻泡。未可若是分别也。志公诸赞咏。拔善恶刺。裂凡圣网。苟会其旨。则踏毗卢顶[寧*頁]上行。一以情求。则入地狱如箭射。真龙象蹴踏。非驴所堪也。</p>\n<p>　　天监十三年冬将卒。忽告众僧。令移寺金刚神像。出置于外。乃密谓人曰。菩萨将去。未及旬日。无疾而终。举体香耎。临亡然一烛以付后阁舍人吴庆。庆以事闻。帝叹曰。大师不复留矣。烛者其以后事嘱我乎。因厚礼葬于钟山独龙阜。仍令开善精舍。敕陆倕制铭于冢内。王筠立碑于寺门。处处传遗像焉。</p>\n<p>　　幻寄曰。可惜一枝烛。分付不著人。却作后事会。咦。若作佛<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>。便好与梁武。一坑埋却。因述颂云。达磨只履。携归[葸-十+夕]岭。志公一烛。梁宫摇影。青阳已谢行人远。落花满阶月华冷。银河西横玉漏残。梦破辘轳鸣露井。</p>\n<p>　　▲善慧大士者</p>\n<p>　　婺州义乌县人。齐建武四年丁丑五月八日。降于双林乡傅宣慈家。本名翕。年十六。娶刘氏女名妙光。生二子普建普成。二十四。与里人稽亭浦捷鱼。获已沉笼水中曰。去者适。止者留。人或谓之愚。会有<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>僧嵩头陀曰。我与汝。毗婆尸佛所发誓。今兜率宫衣钵现在。何日当还。因命临水观影。见圆光宝盖。大士笑谓之曰。炉韛之所多钝铁。良医之门足病人。度生为急。何思彼乐乎。嵩指松山顶曰。此可栖矣。大士躬耕而居之。有人盗菽麦瓜果。大士见。即与篮笼盛去。日常营作。夜则行道。见释迦金粟定光三如来放光袭其体。大士乃曰。我得首楞严定。天嘉二年。感七佛相随。释迦引前。维摩接后。惟释尊数顾共语。为我补处也。其山顶黄云盘旋若盖。因号云黄山梁武帝请讲<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>。士才升座。以尺挥案一下。便下座。帝愕然。圣师曰。陛下还会么。帝曰。不会。圣师曰。大士讲经竟又一日讲经次。帝至。大众皆起。士端坐不动。近臣报曰。圣驾在此。何不起。士曰。法地若动。一切不安大士一日披衲顶冠靸履朝见。帝问是僧耶。士以手指冠。帝曰。是道耶。士以手指靸履。帝曰。是俗耶。士以手指衲衣○有偈曰。有物先天地。无形本寂寥。能为万象主。不逐四时凋又曰。夜夜抱佛眠。朝朝还共起。起坐镇相随。语默同居止。纤毫不相离。如身影相似。欲识佛去处。只这语声是。</p>\n<p>　　保宁勇云。大众。傅大士此颂。古今不坠。一切人知。向此瞥地者固多。错会者不少。玄沙云。大小傅大士。只认得个昭昭灵灵。洞山聪云。且道衲僧家。日里还曾睡也无。此两转语。谁言世上无仙客。须信壶中别有天。保宁亦有一颂。要眠时即眠。要起时即起。水洗面皮光。啜茶湿却嘴。大海红尘飞。平地波涛起。呵呵阿呵呵。啰哩啰啰哩。</p>\n<p>　　又曰。空手把锄头。步行骑水牛。人在桥上过。桥流水不流。</p>\n<p>　　断桥伦颂云。狗走抖擞口。猴愁搜搜头。瑞岩门外水。自古向西流张无尽见皓布裈。举大士此颂。皓曰。此颂得法身边事。颂不得法身向上事。无尽曰。请和尚颂。皓遂应声颂曰。昨夜雨霶亨。打倒葡萄棚。知事普请。<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>人力。拄底拄。撑底撑。撑撑拄拄到天明。依旧可怜生。</p>\n<p>　　心王铭曰。观心空王。玄妙难测。无形无相。有大神力。能灭千灾。成就万德。体性虽空。能施法则。观之无形呼之有声。为大法将。心戒传经。水中盐味。色里胶青。决定是有。不见其形。心王亦尔。身内居停。面门出入。应物随情。自在无碍。所作皆成。了本<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>。识心见佛。是佛是心。是心是佛。念<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>心。<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>念佛。欲得早成。戒心自律。净律净心。心即是佛。除此心王。更无别佛。欲求成佛。莫染一物。心性虽空。贪嗔体实。入此法门。端坐成佛。到彼岸已。得波罗蜜。慕道真士。自观自心。知佛在内。不向外寻。即心即佛。即佛即心。心明识佛。晓了识心。离心非佛。离佛非心。非佛莫测。无所堪任。执空滞寂。于此漂沉。诸佛菩萨。非此安心。明心大士。悟此玄音。身心性妙。用无更改。是故智者。放心自在。莫言心王。空无体性。能使色身。作邪作正。非有非无。隐显不定。心性离空。能凡能圣。是故相劝。好自防慎。<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>造作。还复漂沉。清净心智。如世黄金。般若法藏。并在身心。<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>宝。非浅非深。诸佛菩萨。了此本心。有缘遇者。非去来今陈太建元年己丑。有慧和法师。不疾而终。嵩头陀亦于柯山灵岩寺入灭。大士悬知曰。嵩公兜率待我。决不可久留也。时四侧花木。方当秀实。歘然枯瘁。四月二十四日。示众曰。此身甚可厌恶。众苦所集。须慎三业。精勤<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。若坠地狱。卒难得脱。又曰。吾去已不得移寝床。七日有法猛上人。持像及钟来镇于此。弟子问灭后形体若为。曰山顶焚之。又问不遂何如。曰慎勿棺敛。但垒甓作坛。移尸于上。屏风周绕。绛纱覆之。上建浮图。以弥勒像镇之。又问。师之发迹可得闻乎。曰我从第四天来。为度汝等。次补释迦。及传普敏文殊。慧集观音。何昌阿难。同来赞助。故大品经云。有菩萨从兜率来。诸根猛利。疾与般若相应。即吾身是也。言讫趺坐而终。世寿七十有三。寻猛师果将到。织成弥勒像。及九乳钟留镇之。须臾不见。大士道具十余事现在。</p>\n<p>　　士于太清二年。誓不食。取佛生日焚身供养。至日白黑六十余人。代不食烧身。三百人剃心沥血和香。请大士住世。土愍而从之。士尝遣弟子。致书梁武。中有云。上善略以虚怀为本。不著为宗。亡相为因涅槃为果。中善略以治身为本。治国为宗。天上人间<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>安乐。下善略以护养众生。胜残去杀。普令百姓俱禀六斋。梁武问。从来师事谁耶。曰从无所从。来无所来。师事亦尔。昭明问。大士何不论义。曰菩萨所说。非长非短。非广非狭。非有边非无边。如如正理。复有何言。梁武又问。何为<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。曰息而不灭。武曰。若息而不灭。此则有色。有色故钝。若如是者。大士不免流俗。曰临财毋苟得。临难毋苟免。武曰。大士大识礼。曰一切诸法不有不无。武曰。谨受大士来旨。曰<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>所有色象。莫不归空。百川丛注不过于海。无量妙法不出真如。如来何故于三界九十六道中。独超其最。视一切众生有若赤子。有若自己。天下非道不安。非理不乐。武默然。大士辞退。</p>\n<p>　　▲南岳慧思禅师</p>\n<p>　　姓李氏。顶有肉髻。牛行象视。少以慈恕闻于闾里。常梦梵僧劝出俗。乃辞亲入道。及禀具。常习坐。日唯一食。诵法华等经。满千遍。又阅妙胜定经。叹禅那功德。遂发心寻友。时慧闻法师。有徒数百。(闻阅<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>论。发明禅理。故遥禀龙树)乃往受法。昼夜摄心。坐夏经三七日。获宿智通。倍加勇猛。寻有障起。四支缓弱。不能行步。自念曰。病从业生。业由心起。心缘无起。外境何状。病业与身都如云影。如是观已。颠倒想灭。轻安如故。夏满犹无所得。深怀惭愧。放身倚壁。背未至间。豁尔开悟法华<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>最上乘门示众曰。道源不远。性海非遥。但向己求。莫从他觅。觅即不得。得亦不真偈曰。顿悟心源开宝藏。隐显灵通现真相。独行独坐常巍巍。百亿化身无数量。纵令逼塞满虚空。看时不见微尘相。可笑物兮无比况。口吐明珠光晃晃。寻常见说不思议。一语标名言下当○又偈曰。天不能盖。地不载。无去无来无障碍。无长无短无青黄。不在中间及内外。超群出众太虚玄。指物传心人不会尝以道俗所施金字般若法华二经。为众随文发解。复命门人智顗代讲。至一心具万行有疑请决。师曰。汝所疑乃大品次第意耳。未是法华圆顿旨也。吾昔于夏中。一念顿发。诸法现前。吾既身证。不劳致疑。顗即咨受法华行。三七日得悟陈光大六年六月二十三日。自大苏山。将四十余僧。径趋南岳。乃曰。吾寄此山。止期十载。已后必事远游。吾前身曾履此处。巡至衡阳。值一处林泉胜异。师曰古寺也。吾昔曾居。俾掘之。基址犹存。又指岩下曰。吾此坐禅。贼斩吾首。寻得枯骸一具。自此化道弥盛。陈主屡致慰劳供养。目为大禅师因志公令人传语曰。何不下山<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。目视云汉作么。师曰。三世诸佛。被我一口吞尽。更有甚众生可教化。</p>\n<p>　　玄觉征云。且道是山头语。山下语。</p>\n<p>　　师习慈忍行。奉菩萨三聚戒。衣服率用布。寒则加之以艾将顺世。谓门人曰。若有十人不惜身命。常修法华般舟念佛三昧。方等<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。期于见证者。随有所须。吾自供给。如无此人。吾即远去矣。时众以苦行事难。无有答者。师乃屏众泯然而逝。小师云辩号叫。师开目曰。汝是恶魔。吾将行矣。何惊动妨乱吾耶。痴人出去。言讫长往。时异香满室。顶暖身软。颜色如常。即太建九年六月二十二日也。</p>\n<p>　　▲天台山修禅寺智者禅师</p>\n<p>　　讳智顗。荆州华容人。姓陈氏。诞生之夕。祥光烛邻。幼有奇相。肤不受垢。七岁入果愿寺。闻僧诵<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a><a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>。即随念之。忽自忆记七卷之文。宛如宿习。十五<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>像。誓志出家。恍焉如梦。见大山临海际。峰顶有僧招手。复接入一伽蓝云。汝当居此。汝当终此。十八丧二亲。于果愿寺。依僧法绪出家。二十进具。陈乾明元年。谒光州大苏山慧思禅师。思一见乃谓曰。昔灵鹫同听法华经。今复来矣。即示以普贤道场。说四安乐行。师入观三七日。诵法华经。至药王品曰。是真精进。是名真法供养如来。于是悟法华三昧。获旋陀罗尼。见灵山一会俨然未散。宿通潜发。以所证白思。思曰。非汝弗证。非我莫识。此乃法华三昧前方便初旋陀罗尼也。纵令文字之师千万。不能穷汝之辩。汝可传灯。莫作最后断佛种人。</p>\n<p>　　妙喜云。智者悟旋陀罗三昧。见灵山一会俨然未散。或者谓之表法。惟无尽居士。阅首<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>。至是人始获金刚心中处。忽思智者当时所证。见灵山一会俨然未散。非表法也。尝语余曰。当真证入时。全身住在金刚心中。李长者所谓。无边刹境自他不隔于毫端。十世古今始终不离于当念。智者见灵山一会俨然未散。惟证是三昧者。不待引喻。默默自点头矣。又曰。而今未获旋陀罗尼者。还见灵山一会否。若见。以何为证。若不见。是真精进是名真法供养如来。只恁么念过。却成剩法矣。</p>\n<p>　　太建元年辞思。住金陵阐化。凡说法不立文字。以辩才故。昼夜无倦。七年谢遣徒众。隐天台山佛陇峰。有定光禅师。先居比峰。谓弟子曰。不久当有善知识。领徒至此。俄尔师至。光曰。还忆畴昔举手招引时否。师即悟礼像之征。悲忧交怀。乃执手共至庵所。其夜闻空中钟磬之声。师曰。是何祥也。光曰。此是犍椎集僧得住之象。此处金地。吾已居之。北峰银地。汝宜居焉师尝谓。法华为一乘妙典。荡化城之执教。释草庵之滞情。开方便之权门。示真实之妙理。会众善之小行。归广大之一乘。遂出玄义。曰释名。辨体。明宗。论用。判教相之五重也。名则法喻齐举。谓一乘妙法。即众生本性。在无明烦恼。不为所染。如莲花处于淤泥。而体常净。故以为名。此经开权显实。废权立实。会权归实。如莲之华有含容开落之义。华之莲有隐现成实之义。亦谓从本垂迹。因迹显本。夫经题。不越法喻人单复具足。凡七种(单三复三具足一)摄一切名。妙法莲华。即复之一也。(法譬为复)名以召体。体即实相。谓一切相离实相无体故。宗则一乘<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。开示悟入佛之知见。可尊尚故。用则力用。以开废会之义。有其力故。然后判教相者。以如来一代之说。总判为五时八教。五时者。一佛初成道。为上根菩萨。说华严时。二为小机。说阿含时。三弹偏折小。叹大褒圆。说方等时。四荡相遣执。说般若时。五会权归实。授三乘人及一切众生成佛记。说法华涅槃时。八教者。谓化仪四教。即顿渐秘密不定也。化法四教。即藏(生灭<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>)通(无生)别(无量)圆也。(无作四谛。惟法华圆理。乃至治生产业。一色一香。无非实相)该三世如来所演。罄殚其致。(四正三接。广如本教)舍此皆魔说故。教理既明。非观行无以复性。乃依一心三谛之理。(真俗中)示三止观。一一观心。念念不可得。先空次假后中。离二边而观一心。如云外之月者。此乃别教之行相也。尝云。破一切惑。莫盛乎空。建一切法。莫盛乎假。究竟一切性。莫大乎中。故一中一切中。无假无空而不中。空假亦尔。即圆教之行相。如摩醯首罗天之三目。非纵横并别故。(第十四祖<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>偈云。因缘所生法。我说即是空。亦名为假名。亦名中道义。斯与楞严圆觉说。奢摩他三摩钵底禅那<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>。名目虽殊。其致一也。达磨大师。以心传心。不滞名数。直为上上根智。俾忘筌忘意。故与此教同而不同。智者禅师。穷理尽性。备足之门。故与<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>异而非异也)三观圆成。法身不素。即免同贫子也。尚虑学者昧于修性。或堕偏执。故复创六即之义。以绝斯患。一理即佛者。十法界众生。下至蟭螟。同禀妙性。从本以来<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>清净。觉体<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。一理齐平故。(执名相者。不信即心即佛。睹此而生信也)二名字即佛者。虽理性坦平。而随流者。日用不知。必假言教外薰。得闻名字。生信发解故。(起信论云。以有妄想心故。能知名义。自此以下。简暗证者)三观行即佛者。既闻名开解。要假前之三观。而返源故。(圆教外凡也。圆观<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。为不思议境。即五品位。大师示居此位。别教十信及藏通教。皆名资粮位)四相似即佛者。观行功深。发相似用故。(内凡也。圆伏无明。入十信铁轮位。不断见思惑。至七信以去。见思惑自陨。得六根清净。如经云。父母所生眼。悉见三千界云云。思大禅师示居此位。若别教。乃地前三十心也。藏通皆名加行位。楞严经<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>论。三十心后。别立四加行。名位虽同。诠旨迥异。唯通悟者。善巧融会)五分真即佛者。三心开发。得真如用。位位增胜故。(发圆初住。即铜轮位也。如龙女一念成佛。现百界身。从此转胜。至等觉位。凡四十一心。尽目真因。分位虽殊。圆理无别。若别教。即名十地。藏通皆言见道位)六究竟即佛者。无明永尽。觉心圆极。证无所证故。(妙觉也。起信论云。始本不二。名究竟觉。仁王名寂灭上忍也。别教权佛摄。对圆行第二位耳。藏通二教佛可知)如上六位。既皆即佛。(不屈不滥)通具法报化三身为正。(<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a><a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。属对交络。乃至十种三法。含摄无遗。偈云。道识性般若。菩提大乘身。涅槃三宝德。一一皆三法)随居四土为依。四土者。一常寂光。(法性土也。法身居之。身土相称)二实报无障碍。(摄二受用也。自受用土。报佛自居。他受用土。登地菩萨所居)三方便有余。四净秽同居。(并为应化土也。地前菩萨二乘凡夫所居)其实则非身非土。无优无劣。为对机故。假说身土。而分优劣。师得身土互融。权实无碍。故三十余年。昼夜宣演。生四种益。具四悉檀。(悉遍也。檀翻名施。禅师之法。遍施有情。随根得益如云。世界悉檀。生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>益云云)门人灌顶。日记万言。而编结之。总目为天台教隋开皇十七年。十一月十七日。帝遣使诏师。将行乃告门人曰。吾今往而不返。汝等当成就佛陇南寺。一依我图。侍者曰。若非师力。岂能成办。师曰。乃是王家所办。汝等见之。吾不见也。(师初欲建寺于石桥。禅寂中见阜帻绛衣三神人。语曰。所欲建寺。今非其时。三国既一。当有大施主建之。寺建而国清。宜名曰国清。至隋开皇十八年。诏司马王弘。依师所图。建国清寺)二十一日。到剡东石城寺百尺石像前不进。二十四日顾侍者曰。观音来迎。不久应去。时门人智朗请曰。不审何位何生。师曰。吾不领众。必净六根。损己利他。获预五品耳。(五品弟子。即法华三昧前方便之位。与思大禅师昔语冥符)命笔作观心偈。唱诸法门纲要讫。趺坐而逝。寿六十。腊四十。弟子等迎归佛陇岩。大业元年。诏使者送弟子智璪。及寺额入山。赴师忌斋。到日集僧。开石室。唯睹空榻。时会千僧。至时忽剩一人。咸谓师化身来受供。师始受禅教。终乎灭度。常披一坏衲。冬夏不释。居天台二十二年。建大道场一十有二所。国清最居其后。及荆州玉泉寺等。共三十六所。度僧一万五千人。写经一十五藏。造金铜塑画像八十万尊。事迹甚广。具如本传。</p>\n<p>　　▲泗州僧伽大师</p>\n<p>　　唐高宗时。至长安洛阳行化。历吴楚间。手执杨枝。混于缁流。或问师何姓。即答曰我姓何。又问师何国人。师曰。我何国人。</p>\n<p>　　乌龙长老。访冯济川话次。云昔有官人。问泗州大圣何姓。云姓何。官云住何国。云住何国。此意如何。龙云。大圣本不姓何。亦不是何国人。冯笑云。大圣决定姓何。住何国。往返数次。遂致书妙喜。乞断此公案。喜云。有六十棒。将三十棒打大圣。不合道姓何。三十棒打济川。不合道大圣决定姓何。若乌龙长老。教自领出去。</p>\n<p>　　宿州民贺跋氏。舍宅为伽蓝。师曰。此本佛宇。令掘地。果得古碑。云是香积寺。齐李龙建所创。又获金像。众谓然灯如来。师曰。普光王佛也。因以为寺额。景龙二年。诏迎住大荐福寺。中宗称弟子。三年三月三日示灭。敕就荐福寺。漆身起塔。忽臭气满城。上祝送师归临淮。言讫异香腾馥。</p>\n<p>　　宝月问冰壶。慈云无不覆。为甚么大圣不就荐福。壶云。不见道君子爱财。月云。此是洞山底。长老分上作么生。壶云。你还觉髑髅痛么。月云。恁么则是处是慈氏。壶云。矢臭气。</p>\n<p>　　中宗问万回。僧伽是何人。回云。观音化身。</p>\n<p>　　万回法云公。虢州阌乡张氏子。贞观六年五月五日生。弱龄笑傲如狂。一日令家人洒扫云。有胜客来。是日<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>玄奘。自西国还访之。公问印度风境。了如所见。藏作礼围绕称是菩萨。有兄万年。久征辽左。母程氏思其音信。公曰。此甚易耳。乃告母而往。至暮而还。及持到书。人因呼曰万回。其他灵迹甚多。不及录。</p>\n<p>　　▲天台丰干禅师</p>\n<p>　　不知何许人。居天台国清寺。剪发齐眉衣布裘。尝诵唱道歌。乘虎入松门。众僧惊畏。本寺厨中有二苦行。曰寒山子拾得。二人执爨。终日晤语。潜听者都不解。时谓风狂。独与师相亲。一日寒山问。古镜未磨如何照烛。师曰。冰壶无影像。猿猴探水月。曰此是不照烛也。更请师道。师曰。万德不将来。教我道甚么。寒拾俱<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>师欲游五台。问寒拾曰。汝共我去游五台。便是我同流。若不共我去游五台。不是我同流。山曰。你去游五台作甚么。师曰。礼文殊。山曰。你不是我同流。师寻独入五台。逢一老人。便问莫是文殊么。曰岂可有二文殊。师作礼未起。忽然不见。(赵州因<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>举此。州代干云。文殊文殊)后回天台山示灭师凡有人问佛理。止答随时二字初闾丘胤。出牧丹丘。将议巾车。忽患头痛。医莫能愈。师造丘。以咒水喷之立差。胤异之。乞一言。师曰。到任记谒文殊普贤。曰此二菩萨何在。师曰。即国清寺寒山拾得也。胤后既至任。即入寺问师所在。及寒拾踪迹。僧道翘对曰。丰干旧院。在<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>后。今阒无人矣。寒拾二人。现在僧厨执役。胤入师房。惟见虎迹。复问翘师。在此作何行业。翘曰。惟事春榖供僧。闲则讽咏。乃入厨访寒拾。如下章叙之。</p>\n<p>　　▲寒山子</p>\n<p>　　本无氏族。始丰县西有寒明二岩。以其于寒岩中居止得名也。容貌枯瘁。布襦零落。以桦皮为冠。曳大木屐。时来国清寺。就拾得取众僧残食。及菜滓食之。或廊下徐行。或望空噪骂。寺僧以杖逼逐。拊掌大笑而去众僧炙茄次。将茄串向僧背上打一下。僧回首。山呈起茄串曰。是甚么。僧曰。这风颠汉。山向旁僧曰。你道这僧费却我多少盐酱赵州游天台。路次相逢。山见牛迹。问州曰。还识牛么。州曰不识。山指牛迹曰。此是五百罗汉游山。州曰。既是罗汉。为甚么却作牛去。山曰。苍天苍天。州呵呵大笑。山曰。作甚么。州曰。苍天苍天。山曰。这厮儿。宛有大人之作闾丘入厨见山。同拾得围罏语笑。丘致拜。二人连声咄叱。且笑曰。丰干饶舌。二人即相携出松门。闾丘又至寒岩礼谒。送衣服药物。二人高声喝之曰。贼贼。便缩身入岩石缝中。唯曰。汝诸人各各努力。其石缝忽然而合。闾丘哀慕。令僧道翘寻其遗迹。得所书林间叶上。及村墅屋壁辞颂。共三百余首。后曹山寂禅师。为之注释。谓之对寒山子诗。行于世。</p>\n<p>　　▲拾得者</p>\n<p>　　不言名氏。因丰干禅师山中经行。至赤城道侧。见儿孤啼。拾归国清。故名。后沙门灵熠摄受。令知食堂香灯。忽一日登座。与佛像对盘而餐。复于憍陈如上座塑形前呼曰。小果声闻。灵熠怒。因罢斥。令厨内涤器。每滤食滓。以筒盛之。寒山来。即与负去一日扫地。寺主问汝名拾得。因丰干拾得汝归。汝毕竟姓个甚么。拾得放下苕帚叉手而立。寺主再问。拈帚扫地竟去。寺主罔测。寒山捶胸云。苍天苍天。拾得却问。汝作甚么。山曰。不见东家人死。西家助哀。二人作舞哭笑而去国清寺半月念戒众集。拾得拍手曰。聚头作想那事如何。维那叱之。拾得曰。大德且住。无嗔即是戒。心净即出家。我性与你合。一切法无差僧厨食为乌所啄。拾得以杖抶伽蓝神曰。汝食不能护。何能护伽蓝。是夕神示梦合寺僧曰。拾得谴我。由是著异。呼曰贤士。未几与寒山隐石岩而逝。道翘纂寒山诗。得偈亦附焉。</p>\n<p>　　▲明州奉化县布袋和尚</p>\n<p>　　未详氏族。自称名契此。形裁腲脮。蹙额皤腹。出语无定。寝卧随地。常以杖荷一布囊。凡供身之具。尽贮囊中。入廛肆聚落。见物则乞。醯醢鱼菹才接入口。分少许囊中。时号长汀子。布袋师也。尝雪中卧。雪不沾身。人以此奇之。或就人乞。其货则售。示人吉凶。必应期无忒。天将雨。即著湿草履。途中骤行。遇亢阳。即曳高齿木屐。市桥上竖膝而眠。民以此验之有一僧在师前行。师乃拊僧背一下。僧回头。师曰。乞我一文钱。曰道得即与你一文。师放下布袋叉手而立白鹿和尚问。如何是布袋。师便放下布袋。问如何是布袋下事。师便负之而去。</p>\n<p>　　先保福和尚问。如何是佛法大意。师放下布袋义手。保福曰。为只如此。还更有向上事。师负之而去。</p>\n<p>　　师在街衢立。有僧问。和尚在这里作甚么。师曰。等个人。曰来也来也。(归宗柔和尚别云。归去来)师云。汝不是这个人。曰如何是这个人。师曰。乞我一文钱师有歌曰。只个心心心是佛。十方世界最灵物。纵横妙用可怜生。一切不如心真实。腾腾自在无所为。闲闲究竟出家儿。若睹目前真大道。不见纤毫也大奇。万法何殊心何异。何劳更用寻经义。心王本自绝多知。智者只明无学地。非圣非凡复若何。不强分别圣情孤。无价心珠本圆净。凡名异相妄空呼。人能弘道道分明。无量清高称道情。携锡若登故国路。莫愁诸处不闻声又有偈曰。是非憎爱世偏多。仔细思量奈我何。宽却肚肠须忍辱。豁开心地任从他。若逢知己须依分。纵遇冤家也共和。若能了此心头事。自然<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>六波罗。(此应是一偈。下章应别是一偈。灯录并作一偈。恐非)我有一布袋。虚空无挂碍。展开遍十方。入时观自在。吾有三宝堂。里空无色相。不高亦不低。无遮亦无障。学者体不如。来者难得样。智慧解安排。千中无一匠。四门四果生。十方尽供养。吾有一躯佛。世人皆不识。不塑亦不装。不雕亦不刻。无一滴灰泥。无一点彩色。人画画不成。贼偷偷不得。体相本自然。清净非拂拭。虽然是一躯。分身千百亿又偈曰。一钵千家饭。孤身万里游。青目睹人少。问路白云头梁贞明三年丙子三月。师将示灭。于岳林寺东廊下。端坐磐石。而说偈曰。弥勒真弥勒。分身千百亿。时时示时人。时人自不识。偈毕安然而化。其后复现于他州。亦负布袋。四众竞图其像。</p>\n<p>　　▲法华志言大士</p>\n<p>　　寿春许氏子。弱冠游东都。继得度于七俱胝院。留讲肆久之。一日读云门录忽契悟。未几<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>遂通。独语笑。口吻嗫嚅。日常不辍。世传诵法华。因以名之丞相吕许公。问佛法大意。师曰。本来无一物。一味却成真集仙王质问。如何是祖师西来意。师曰。青山影里泼蓝起。宝塔高吟撼晓风。又曰。请法华<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>。师曰。未从斋戒觅。不向佛边求国子助教徐岳。问祖师西来意。师曰。街头东畔底。徐曰。某甲未会。师曰。三般人不会僧问。世有佛否。师曰。寺里文殊有问师凡耶圣耶。遂举手曰。我不在此住庆历戊子十一月二十三日将化。谓人曰。吾从无量劫来。成就逝多国土。分身扬化。今南归矣。言毕右胁而逝。</p>\n<p>　　宋仁宗始不豫。国嗣未立。大臣请择宗室贤者居京师。仁宗夜焚香默祷曰。翊日化成殿具斋。虔请法华大士。俯临无却。左右莫闻也。清旦道衣凝立而待。俄侍卫奏言。法华自右掖门。直趋寝殿。禁兵呵止不得。仁宗笑曰。吾请之来耳。及至竟升御榻而坐。仁宗以储嗣为问。索笔大书十三十三数行。掷笔去。至英宗即位。乃濮安懿王第十三子也。</p>\n<p>　　▲扣冰澡先古佛</p>\n<p>　　建宁新丰翁氏子。母梦比丘风神炯然。荷锡求宿。人指谓曰。此辟支佛也。已而孕。生于武宗会昌四年。香雾满室。弥日不散。年十三求出家。父母许之。依乌山兴福寺沙门行全为师。咸通乙酉。落发受具。初以讲说为众所归。弃谒雪峰。手携凫茨一包酱一器献之。峰曰。包中是何物。师曰凫茨。峰曰。何处得来。师曰。泥中得。峰曰。泥深多少。师曰。无丈数。峰曰。还更有么。师曰。转有转深。又问。器中何物。曰酱。峰曰。何处得来。曰自合得。峰曰。还熟也未。曰不较多。峰异之曰。子异日必为王者师初居温岭。继居将军岩。二虎侍侧。神人献地为瑞岩院。学者争集。尝谓众曰。古圣修行全凭苦节。吾今夏则衣楮。冬则扣冰而浴。故人号为扣冰古佛后住灵曜。上堂。四众云臻。教老僧说个甚么。便下座有僧。烧炭积成火龛曰。请师入此修行。曰真玉不随流水化。琉璃争夺众星明。曰莫只这便是么。曰且莫认奴作郎。曰毕竟如何。曰梅花腊月开天成戊子。应闽王之召。王敬礼。谢茶次。师提起橐子曰。会么。曰不会。曰人王法王各自照了。留十日。以疾辞。至十二月二日。沐浴升堂。告众而逝。王与道俗。备香薪苏油茶毗之。祥曜满山。获五色舍利。塔于瑞岩正寝。</p>\n<p>　　▲千岁宝掌和尚</p>\n<p>　　中印度人。周威烈十二年丁卯。降神受质。则左掌握拳。七岁祝发乃展。因名宝掌。魏晋间。东游此土。入蜀礼普贤。留大慈。常不食。日诵般若等经千余卷。有咏之者曰。劳劳玉齿寒。似迸岩泉急。有时中夜坐。阶前神鬼泣。一日谓众曰。吾有愿住世千岁。今六百二十有六矣。故人以千岁称之。旋游五台。复南历衡岳黄梅匡庐。寻入建业。会达磨入梁。就而扣请。悟无生忍。武帝高其道腊。延供内庭。未几如吴。述偈曰。梁城遇导师。<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>了心地。飘零二浙游更。尽佳山水。遂遍探两浙名山。后居浦江之宝严。与朗禅师友善。每通问。遣白犬驰往。朗则使青猿。故有题朗壁者云。白犬衔书至。青猿洗钵回云。显庆二年正旦。手塑一像。至九日成。谓门人慧云曰。此肖谁。云曰。与和尚无异。即澡浴易衣趺坐。谓云曰。吾住世已一千七十二年。今将谢世。听吾偈曰。本来无生死。今亦示生死。吾得去住心。他生复来此。又嘱曰。吾灭后六十年。有僧来取吾骨勿拒。言讫而逝。入灭五十四年。有刺浮长老。自云门至塔所。礼曰冀塔洞开。少选塔户果启。非骨连环若黄金。浮即持往秦望山。建窣堵波奉藏。以周威烈丁卯。至唐高宗显庆二年。实一千七十二年。其在此土。盖历四百余岁云。</p>\n<p>　　▲懒残</p>\n<p>　　唐天宝初。衡岳寺执役僧也。退食即收所余而食。性懒而食残。故号懒残。邺侯李泌微时。在寺中读书。李固异人。能识微。察残所为。知不凡。每谓人曰。残师中宵梵唱。恒响彻山林。其音先凄惋而后喜悦。必谪堕之人。时将去矣。一夕李潜往道名瞻拜。师大诟曰。是将贼我。李拜益恭。师拨牛粪火。中出一芋。以半授李啖之。李捧食再拜谢。师曰。慎勿多言。领取十年宰相。后德宗使人召之。师寒涕垂膺。使者见而笑令拭涕。师曰。我岂有工夫为俗人拭涕耶。竟不能致。刺史将祭岳祠方修磴道。中夜风雷一峰陨巨石。当道横卧。修磴者以十牛挽之。而又以数百人助挽。屹不动。师笑曰。无烦多力。遂履石。石盘旋而动。声若震雷。疾下路遂开。人如神之。寺门外虎豹忽成群。师语众僧曰。为尔尽驱彼。授我棰。众以棰授。师才出寺。一虎遽衔师去。而虎豹亦随绝踪。师有歌曰。兀然无事无改换。无事何须论一段。直心无散乱。他事不须断。过去已过去。未来犹莫算。兀然无事坐。何曾有人唤。向外觅工夫。总是痴顽汉。粮不畜一粒。逢饭但知[嗎-(烈-列)+廾]。(陟立切)世人多事人相趁浑不及。我不乐生天。亦不爱<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。饥来吃饭。困来即眠。愚人笑我。智乃知焉。不是痴钝。本体如然。要去即去。要住即住。身披一破衲。脚著娘生裤。多言复多语。由来反相误。若欲度众生。无过且自度。莫谩求真佛。真佛不可见。妙性及灵台。何须受薰炼。心是无事心。面是娘生面。劫石可移动。个中无改变。无事本无事。何须读文字。削除人我本。冥合个中意。种种劳筋骨。不如林下睡。兀兀举头见。日高吃饭从头[打-丁+聿]。将功用功。展转冥蒙。取即不得。不取自通。吾有一言。绝虑忘缘。巧说不得。只用心传。更有一语。无过直与。细如毫末。大无方所。本自圆成。不劳机杼。世事悠悠。不如山丘。青松蔽日。碧涧长流。山云当幕。夜月为钩。卧藤萝下。块石枕头。不朝天子。岂羡王侯。生死无虑。更复何忧。水月无形。我常只宁。万法皆尔。本自无生。兀然无事坐。春来草自青。</p>\n<p>　　▲法顺大师</p>\n<p>　　姓杜氏。世传文殊化身也。降灵于雍州万年县。神迹炳著。不可胜纪。有患聋者投师。师呼之则聋愈。有患哑者投师。师与之言则哑愈。武功县僧为毒龙所魅。众掖以请师。师端拱面之坐。龙遂附病僧曰。大师所向。义无复留。寻即释然。师大弘华严圆顿之旨。作法界观。文简理尽。天下宗之。尝作法身颂曰。嘉州牛吃草。益州马腹胀。天下觅医人。灸猪左膊上。义学莫能窥其旨。余具如本传。</p>\n<p>　　▲清凉澄观国师</p>\n<p>　　姓夏侯氏。山阴人。才供二笔。撰华严疏钞。穷圆顿之旨。神异种种。有识咸戴。化后。门人见有金甲神人。空中翩然西逝。门人拜问神何为。曰取华严菩萨牙归供养耳。门人异之。遂启塔户视之。师容貌如生。而失二牙。以是知师为华严菩萨也。师有答皇太子问心要书。传灯载之。而妙喜<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼藏亦具载焉。其词曰。至道本乎一心。心法本乎无住。无住心体。灵知不昧。性相寂然。包含德用。该摄内外。能深能广。非有非空。不生不灭。无终无始。求之而不得弃之而不离。迷<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>则惑苦纷然。悟真性则空明廓彻。虽即心即佛。惟证者方知。然有证有知。则慧日沉没于有地。若无照无悟。则昏云掩蔽于空门。若一念不生。则前后际断。照体独立。物我皆如。直造心源。无智无得。不取不舍。无对无修。然迷悟更依。真妄相待。若求真弃妄。犹弃影劳形。若体妄即真。犹处阴影灭。若无心忘照。则万虑都捐。若任运寂知。则众行爰起。放旷任其去住。静鉴觉其源流。语默不失玄微。动静未离法界。言止则双忘知寂。论观则双照寂知。语证则不可示人。说理则非证不了。是以悟寂无寂。真知无知。以知寂不二之一心。契空有双融之中道。无住无著。莫摄莫收。是非两忘。能所双绝。斯绝亦寂。则般若现前。般若非心外新生。智性乃本来具足。然本寂不能自现。实由般若之功。般若之与智性。翻覆相成。本智之与始修。实无两体。双亡证入。则妙觉圆明。始末该融。则因果交彻。心心作佛。无一心而非佛心。处处成道。无一尘而非佛国。故真妄物我。举一全收。心佛众生。浑然齐致。是知迷则人随于法。法法万差。而人不同。悟则法随于人。人人一智。而融万境。言穷虑绝。何果何因。体本寂寥。孰同孰异。惟忘怀虚朗。消息冲融。其犹透水月华。虚而可见。无心鉴象。照而常空矣。</p>\n</div>"
    }
]