[
    {
        "title": "指月录卷之十一",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p>　　六祖下第四世</p><p>　　▲福州长庆大安禅师</p><p>　　造百丈。礼而问曰。学人欲求识佛。何者即是。丈曰。大似骑牛觅牛。师曰。识得后如何。丈曰。如人骑牛至家。师曰。未审始终如何保任。丈曰。如牧牛人执杖视之。不令犯人苗稼。师自兹领旨。更不驰求同参祐禅师。创居沩山。师躬耕助道。祐归寂。众请主法。上堂。汝诸人总来就安。求觅甚么。若欲作佛。汝自是佛。担佛傍家走。如渴鹿趁阳焰相似。何时得相应去。汝欲作佛。但无许多颠倒攀缘。<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>恶觉垢欲不净。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>之心便是初心正觉佛。更向何处别讨。所以安在沩山。三十年来。吃沩山饭。屙沩山矢。不学沩山禅。只看一头水牯牛。若落路人草。便把鼻孔拽转来。才犯人苗稼。即便鞭挞。调伏既久。可怜生受人言语。如今变作个露地白牛。常在面前。终日露迥迥地。趁亦不去。汝诸人各自有无价大宝。从眼门放光。照见山河大地。耳门放光。领辨一切<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>音响。如是六门。昼夜常放光明。亦名放光<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。汝自不识取。影在四大身中。内外扶持。不教倾侧。如人负重担。从独木桥上过。亦不教失脚。且道是甚么物任持。便得如是。且无丝发可见。岂不见志公和尚云。内外追寻觅总无。境上施为浑大有。珍重师室中每问僧有句无句如藤倚树。子意何如。</p><p>　　罗山道闲禅师在禾山。因清贵上座说话次。贵云天下无第一人。大小沩山犹输他道吾。闲云。有甚么语输他。贵举石霜辞沩山才<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>起。沩山问有句无句如藤倚树。子意如何。霜无对。却到道吾。吾问甚处来。霜云沩山来。吾云有甚么言句。霜遂举前话。吾云汝何不道取。霜云只为道不得。吾云汝为我看庵。待我与你报仇去。吾往沩山。山泥壁次。忽回首见道吾在背后。山便云智头陀因何到在此。吾云某甲不为别事来。只为和尚问诸道者。有句无句如藤倚树。还是也无。沩云是。吾便问树倒藤枯时如何。沩山呵呵大笑。被道吾捺向泥里。沩山总不管。贵上座举了云。这个岂不是沩山输与他道吾。罗山云。上座三十年后。若有把茅盖头。切忌举著这个话。贵不肯。却与道吾作主。被罗山擒下地云。白大众各请停喧。某甲今日与清贵上座。直为沩山雪屈话。且须侧聆。贵云。知也知也。便礼拜。罗山云。何不早道。你还识道吾么。只是馆驿里本色撮马粪汉。</p><p>　　问。此阴已谢。彼阴未生时如何。师曰。此阴未谢。那个是大德。曰不会。师曰。若会此阴。便明彼阴问。黄巢军来。和尚向甚么处回避。师曰。<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>山中。曰忽被他捉著时如何。师曰。恼乱将军。</p><p>　　▲福州古灵神赞禅师</p><p>　　本州大中寺受业。后行脚。遇百丈开悟。却回受业。本师问曰。汝离吾在外。得何事业。曰并无事业。遂遣执役。一日因澡身。命师去垢。师乃拊背曰。好所佛堂。而佛不圣。本师回首视之。师曰。佛虽不圣。且能放光。本师又一日在窗下看经。蜂子投窗纸求出。师睹之曰。世界如许广阔。不肯出。钻他故纸驴年去。遂有偈曰。空门不肯出。投窗也太痴。百年钻故纸。何日出头时。本师置经问曰。汝行脚遇何人。吾前后见汝发言异常。师曰。某甲蒙百丈和尚指个歇处。今欲报慈德耳。本师于是告众致斋。请师<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。师乃登座。举唱百丈门风曰。灵光独耀。迥脱根尘。体露真常。不拘文字。心性无染。本自圆成。但离妄缘。即如如佛。本师于言下感悟曰。何期垂老得闻极则事。师后住古灵。聚徒数载。临迁化。剃浴声钟告众曰。汝等诸人还识无声三昧否。众曰不识。师曰。汝等静听。莫别思惟。众皆侧聆。师俨然顺寂。塔存本山。</p><p>　　▲大慈寰中禅师</p><p>　　上堂。山僧不解答话。只能识病。时有僧出。师便归方丈。</p><p>　　<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>云。众中唤作病在目前不识玄觉云。且道大慈识病不识病。此僧出来是病不是病。若言是病。每日行住不可总是病。若言不是病。出来又作么生雪窦拈云。大凡扶竖宗乘。须辨个得失。且大慈识病不答话。时有僧出。便归方丈。雪窦识病不答话。或有僧出。劈脊便棒。诸方识病不答话。有僧出必然别有长处。敢有一个动著。大唐天子只三人虚堂愚颂。轻如毫末重如山。地角天涯去复还。黄叶陨时风骨露。水边依旧石斓斑。</p><p>　　赵州问。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>以何为体。师曰。般若以何为体。州大笑而出。明日州扫地次。师曰。般若以何为体。州置帚拊掌大笑。师便归方丈僧辞。师问甚么处去。曰江西去。师曰。我劳汝一段事。得否。曰和尚有甚么事。师曰。将取老僧去得么。曰更有过于和尚者。亦不能将去。师便休。僧后举似洞山。山曰。阇黎争合恁么道。曰和尚作么生。山曰得。</p><p>　　法眼别云。和尚若去。某甲提笠子天童云。大慈合伴不著。这僧不如独行。也须是恁么始得。直饶大慈古佛。也不奈这担板汉何。且道别有甚么长处。</p><p>　　山又问其僧。大慈别有甚么言句。曰有时示众曰。说得一丈。不如行取一尺。说得一尺。不如行取一寸。山曰。我不恁么道。曰和尚作么生。山曰。说取行不得底。行取说不得底。</p><p>　　云居云。行时无说路。说时无行路。不说不行时。合行甚么路洛浦云行说俱到即本分事无。行说俱不到。即本分事在。</p><p>　　▲天台平田普岸禅师</p><p>　　访茂源和尚。源才起迎。师近前把住云。开口即失。闭口即丧。去此二途。请师别道。源以手掩鼻。师放开云。一步较易。两步较难。源云。著甚死急。师云。若非是师。不免诸方点检僧参。师打一拄杖。其僧近前把住拄杖。师曰。老僧适来造次。僧却打师一拄杖。师曰。作家作家。僧礼拜。师把住曰。是阇黎造次。僧大笑。师曰。这个师僧今日大败也临济访师。到路口。先逢一嫂在田使牛。济问嫂。平田路向甚么处去。嫂打牛一棒曰。这畜生。到处走到。此路也不识。济又曰。我问你平田路向甚么处去。嫂曰。这畜生。五岁尚使不得。济心语曰。欲观前人。先观所使。便有抽钉拔楔之意。及见师。师问。你还曾见我嫂也未。济曰。已收下了也。师遂问。近离甚处。济曰。江西黄檗。师曰。情知你见作家来。济曰。特来礼拜和尚。师曰。已相见了也。济曰。宾主之礼合施三拜。师曰。既是宾主之礼。礼拜著。</p><p>　　▲瑞州五峰常观禅师</p><p>　　因僧辞。师曰。汝诸方去。莫谤老僧在这里。曰某甲不道和尚在这里。师曰。汝道老僧在甚么处。僧竖起一指。师曰。早是谤老僧也。</p><p>　　▲潭州石霜山性空禅师</p><p>　　僧问。如何是祖师西来意。师云。如人在千尺井中。不假寸绳出得。此人即答汝西来意。僧曰。近日湖南畅和尚出世。亦为人东语西话。师唤<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。拽出这死尸著。</p><p>　　沙弥即仰山。山后问耽源。如何出得井中人。源曰。咄痴汉。谁在井中。山复问沩山。沩召慧寂。山应诺。沩曰出也。仰山住后。常举前语谓众曰。我在耽源处得名。沩山处得地。</p><p>　　▲广州和安寺通禅师</p><p>　　<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>次。禅者问。座主礼底是甚么。师曰是佛。禅者乃指像曰。这个是何物。师无对。至夜具威仪礼问。今日所问。某甲未知意旨如何。禅者曰。座主几夏耶。师曰十夏。禅者曰。还曾<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>也未。师转茫然。禅者曰。若也不会。百夏奚为。乃命同参马祖。及至江西。祖已圆寂。遂谒百丈。顿释疑情。师住后。一日召仰山。将床子来。山将到。师曰。却送本处著。山从之。师召慧寂。山应诺。师曰。床子那边是甚么物。山曰枕子。师曰。枕子这边是甚么物。山曰无物。师复召慧寂。山应诺。师曰。是甚么。山无对。师曰去。</p><p>　　通禅中毒。旁及仰山。</p><p>　　▲洪州东山慧禅师</p><p>　　同大于南用到茶堂。有僧近前不审。用曰。我既不纳汝。汝亦不见我。不审阿谁。僧无语。师曰。不得平白地。恁么问伊。用曰。大于亦无语那。于把定其僧曰。是你恁么累我亦然。便打一掴。用大笑曰。朗月与青天大于侍者到。师问。金刚正定一切皆然。秋去冬来且作么生。者曰。不妨和尚借问。师曰。即今即得。去后作么生。者曰。谁敢问著某甲。师曰。大于还得么。者曰。犹要别人点检在。师曰。辅弼宗师。不废光彩。侍者礼拜。</p><p>　　▲百丈山<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>和尚</p><p>　　一日谓众曰。汝等与我开田。我与汝说大义。众开田了归。请说大义。师乃展两手。众罔措。</p><p>　　▲赵州观音院真际从谂禅师</p><p>　　曹州郝乡人也。姓郝氏。童稚于本州扈通院披剃。未纳戒。便抵池阳参南泉。值泉偃息。而问曰近离甚处。师曰瑞像。泉曰。还见瑞像么。师曰。不见瑞像。只见卧如来。泉便起坐问。汝是有主沙弥无主沙弥。师曰。有主沙弥。泉曰。那个是你主。师近前躬身曰。仲冬严寒。伏惟和尚尊候万福。泉器之许其入室。他日问泉曰。如何是道。泉曰。<a href=\"/fjrw/hcrw/syfs/105216.html\" class=\"keylink\" target=\"_blank\">平常心是道</a>。师曰。还可趣向也无。泉曰。拟向即乖。师曰。不拟争知是道。泉曰。道不属知。不属不知。知是妄觉。不知是无记。若真达不疑之道。犹如太虚廓然荡豁。岂可强是非耶。师于言下悟理。乃往嵩岳琉璃坛纳戒。仍返南泉一日问泉曰。知有底人向甚么处去。泉曰。山前檀越家。作一头水牯牛去。师曰。谢师指示。泉曰。昨夜三更月到窗。</p><p>　　云峰悦云。若不是南泉。洎被打破蔡州。</p><p>　　师在井楼上打水次。见南泉过。便抱柱悬却脚曰。相救相救。南泉上胡梯曰。一二三四五。师少顷却去礼谢曰。适来谢相救师在南泉时。泉牵一头水牯牛。入僧堂内巡堂而转。首座乃向牛背上三拍。泉便休去。师却将一束草。安首座面前。首座无对南泉上堂。师出问。明头合暗头合。泉便下座归方丈。师曰。这老和尚被我一问。直得无言可对。首座曰。莫道和尚无言好。自是上座不会。师便打一掌曰。此掌合是堂头老汉吃师到茱萸。执拄杖于法堂上。从东过西。萸曰。作甚么。师曰。探水萸曰。我这里一滴也无。探个甚么。师以杖倚壁便下。</p><p>　　琅玡觉云。势去奴欺主时衰鬼弄人大慧杲云。钩在不疑之地。</p><p>　　到道吾。才入堂。吾曰。南泉一只箭来也。师曰看箭。吾曰过也。师曰中。</p><p>　　或作茱萸上堂曰看箭。师亦曰看箭云云雪窦云。二俱作家。盖是茱萸赵州二俱不作家。箭锋不相拄。直饶齐发齐中。也只是个射垛汉。</p><p>　　到黄檗。檗见来便闭方丈门。师乃。把火于法堂内叫曰。救火救火。檗开门捉住曰道道。师曰。贼过后张弓。</p><p>　　雪窦显云。直是好笑笑须三十年。忽有个衲僧问雪窦笑个甚么。笑贼过后张弓。</p><p>　　师行脚。见二庵主。一人作丫角童。师问讯。二人殊不顾。来日早晨。丫角童将一铛饭来。放地上分作三分。庵主将席子近前坐。丫角童亦将席近前相对坐。亦不唤师。师乃亦将席子近前坐。丫角童目顾于师。庵主云。莫言侵早起。更有夜行人。师云。何不教诏这<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。庵主云。他是人家男女。师云。洎合放过。丫角童便起顾视庵主云。多口作么。丫角童从此入山不见师到投子处对坐斋。投子将蒸饼与师吃。师曰不吃。不久下胡饼。投子教沙弥度与师。师接饼却礼沙弥三拜师到云居。居云。老老大大何不觅个住处去。师云。作么生是某甲住处。居云。山前有个古寺基。师云。和尚自住取。又到茱萸。萸云。老老大大何不笕个住处。师云。甚么处是某甲住处。萸云。老老大大住处也不知。师云。三十年弄马骑。今日却被驴子扑师到一庵主处问。有么有么。主竖起拳头。师曰。水浅不是泊船处。便行。又到一庵主处问。有么有么。主亦竖起拳头。师曰。能纵能夺能杀能活。便作礼。</p><p>　　瞎堂远颂云。换手捶胸哭老爷。棺材未出死尸斜不如掘地深埋却。管取来年吃嫩茄圜悟勤云。<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>命脉。列圣钳锤。换斗移星。经天纬地。有般汉未出窠窟。只管道舌头在赵州口里。殊不知自己性命已属他人。若能握向上纲宗。与二庵主相见。便可以定龙蛇别缁素。正好著力。还知赵州落处么。切忌颟顸姜山爱云。赵州只见锥头利。不见凿头方云居舜云。赵州当时甚生意气。要且鼻孔在二庵主手里。</p><p>　　僧问师。学人乍入<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。乞师指示。师云。吃粥了也未。云吃粥了也。师云。洗钵盂去。其僧因此大悟。</p><p>　　云门云。且道有指示无指示。若言有。赵州向伊道个甚么。若言无。这僧为甚悟去云峰悦云。云门不识好恶。恁么说话。大似为蛇画足。云峰则不然。这僧恁地悟去。入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>如箭射妙喜曰。云门老汉。大似阿修罗王。托动三有大城诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>海。随后喝云。寐语作甚么。复云。云峰虽善背手抽金镞。翻身控角弓。争奈蹉过云门何。又云。赵州与这僧。若不得云门。一生受屈。而今诸方有一种。瞎汉。往往尽作洗钵盂话会了雪窦显云。我不似云门为蛇画足。直言向你道。问者如虫御木。答者偶尔成文。虽然与么。瞎却衲僧眼。作么生免得此过。诸仁者要会么。还尔赵州吃粥也未。拈却这僧吃粥了也。雪窦与你拄杖子归堂湛堂准颂云。之乎者也。衲僧鼻孔。大头向下。禅人若也不会。问取东村王大姐。</p><p>　　师示众云。此事的的。没量大人出这里不得。老僧到沩山。见僧问如何是祖师西来意。山云与我过床子来。若是宗师。须以本分事接人始得。时有僧问。如何是祖师西来意。师曰。庭前柏树子。曰和尚莫将境示人。师曰。我不将境示人。曰如何是祖师西来意。师曰。庭前柏树子。</p><p>　　后法眼问光孝觉曰。近离甚处。曰赵州。眼曰。承闻赵州有柏树子话。是否。曰无。眼曰。往来皆谓赵州有此语。上座何得道无。曰先师实无此语。和尚莫谤先师好径山杲云。若道有此语。蹉过觉铁嘴。若道无此语。又蹉过法眼。若道两边都不涉。又蹉过赵州。直饶总不恁么。别有透脱一路。入地狱如箭射。毕竟如何。举起拂子云。还见古人么。喝一喝五祖演云。如何是祖师西来意。庭前柏树子。恁么会。便不是了也。如何是祖师西来意。庭前柏树子。恁么会。方始是。径山杲云。要识五祖师翁么。脑后见腮。莫与往来云居祐举柏树子话云。奇哉古圣。垂一言半句。可谓截断圣凡门户。直示<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>眼睛。今昔无坠。众中异解多涂。商量非一。埋没宗旨。错判名言。或谓青青翠竹尽是真如。郁郁黄花无非般若。或谓山河草木物物皆是真心显现。何独庭前柏树子乎。尘毛瓦砾都是一法界中重重无尽。理事<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>。或谓庭前柏树子。才举便直下荐取。觌体全真。拟议之间早落尘境。须是当人作用临机相见。或棒或喝。或擎起拳头。衣袖一拂。这个眼目。如石火电光相似。或谓庭前柏树子。更有甚么事。赵州直下为人。实头说话。饥来吃饭。困即打眠。动展施为。尽是自家受用。如斯见解。如麻似粟。皆是天魔种族。外道邪宗。但取识情分别。用心取舍。强作知见。何不游方遍历。求善知识。决择身心。略似个衲僧。古来自有宗门师范。我<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>宗。释梵诸天拱手敬信。三贤十圣罔测其由。乃举拂子云。若向这里悟去。山河大地与汝同参。复顾左右云。道林争敢压良为贱佛日才颂。赵州庭柏。说与禅客。黑漆屏风。松椤亮槅叶县省和尚。因僧请益柏树子话。省曰。我不辞与汝说。还信么。曰和尚重言争敢不信。省曰。汝还闻檐头雨滴声么。其僧豁然不觉失声云[口*耶]。省曰。汝见个甚么道理。僧以颂对云。檐头雨滴。分明历历。打破乾坤。当下心息真如院方禅师。参琅玡。惟看柏树子话。每入室陈其所见。不容措辞。尝被喝出。忽一日大悟。直入方丈曰。我会也。琅玡曰。汝作么生会。方曰。夜来床荐暖。一觉到天明。琅玡可之雪窦显在大阳时。有客举光孝觉语问曰。觉赵州侍者。眼问柏树<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。乃言无。此语而眼肯之。其旨安在哉。显曰。宗门抑扬宁有轨辙乎。时有苦行。名韩大伯。侍其旁辄匿笑去。显诘其笑故。韩曰。笑知客智眼未正。择法不明。显曰。岂有说乎。韩对以偈曰。一兔横身当古路。苍鹰才见便生擒。后来猎犬无灵性。空向枯桩旧处寻。显阴异之。因结以为友。后显得法于智门。唱导于雪窦。称云门中兴。尝经行植杖。众衲环之显问。有问云门树凋叶落时如何。门曰体露金风。云门答这僧耶。为解说耶。有称宗上座者曰。待老汉有悟处即说。显惊视之曰。非韩大伯乎。曰老汉瞥地也。显因集众乞升座说法焉。</p><p>　　师一日于雪中倒卧曰。相救相救。有僧便去身边卧。师便起去。</p><p>　　翠岩芝云。此僧在赵州圈缋里。有人出得么。</p><p>　　师问新到。曾到此间么。曰曾到。师曰。吃茶去。又问僧。僧曰。不曾到。师曰。吃茶去。后院主问曰。为甚么曾到也云吃茶去。不曾到也云吃茶去。师召院主。主应诺。师曰。吃茶去。</p><p>　　僧到睦州。州问。曾到赵州么。僧云曾到。州云。有何言句。僧举吃茶话。州云惭愧。却问。赵州意作么生。僧云。只是一期方便。州云。苦哉赵州被尔将一杓屎泼。便打。州却问沙弥。尔作么生。沙弥便礼拜。州亦打。僧问沙弥。适来和尚打尔。意作么生。弥云。若不是我和尚。不打某甲雪窦举云。这僧克由叵耐。将一杓屎泼他二员古佛。诸上座。若能辨得。非惟赵睦二州雪屈。亦乃翠岩与天下老宿无过。若辨不得。到处泼人卒未了在。</p><p>　　问。狗子还有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>也无。师曰无。曰上至诸佛下至蝼蚁皆有佛性。狗子为甚么却无。师曰。为伊有业识在。又僧问。狗子还有佛性也无。师曰有。曰既有。为甚么入这皮袋里来。师曰。知而故犯。</p><p>　　妙喜恒举此则。语至无字。令学者参云。佛语祖语诸方老宿语。千差万别。若透得个无字。一时透过。不用博量。不用注解。不用要得分晓。又云。不得作有无商量。不得作真无之无卜度。不用向开口处承当。不用向举起处作道理。不用堕在空寂处。不用将心等悟。不用向宗师说处领略。不用掉在无事甲里。但行住坐卧时时提撕。狗子还有佛性也无。无提撕得熟。口议心思不及。方寸里七上八下。如生铁橛没滋味时。切莫退志。得如此时。却是个好底消息。忽然打失布袋。不觉拊掌大笑矣。又云。茶里饭里。喜时怒时。净处秽处。妻儿聚头处。与宾客相酬酢处。办公家职事处。了私门婚嫁处。都是第一等做工夫提撕举觉底时节。又云。既有个趋向狗子无佛性话。冷地里慢提撕则个。若道知是般事便休。我说此人智眼未明在。妙喜虽似平地起风雷。然亦不出雪峰道底。</p><p>　　师因侍者报。大王来也。师云。万福大王。者云。未到在。师云。又道来也。</p><p>　　黄龙南云。头头漏泄。罕遇仙陀。侍者只解报客。不知身在帝乡。赵州入草求人。不觉浑身泥水。</p><p>　　秀才问。佛不违众生所愿是否。师曰是。曰某甲欲觅和尚手中拄杖得否。师曰。君子不夺人所好。曰某甲不是君子。师曰。我亦不是佛僧问。如何是道。师曰。墙外底。曰不问这个道。师曰。你问那个道。曰大道。师曰。大道透长安问。如何是佛。师曰。殿里底。曰殿里者岂不是泥龛塑像。师曰是。曰如何是佛。师曰。殿里底问。和尚姓甚么。曰常州有。问甲子多少。曰苏州有问。如何是赵州。曰东门西门南门北门问。如何是祖师意。师敲床脚。曰只这莫便是否。师曰。是即脱取去问。如何是毗卢圆相。师曰。老僧自幼不曾眼花。曰岂不为人。师曰。愿汝常见毗卢圆相官人问。和尚还入地狱否。师曰。老僧末上入。曰大善知识。为甚么入地狱。师曰。我若不入。阿谁<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>汝问。久向赵州石桥。到来只见略彴。师曰。汝只见略彴。且不见石桥。曰如何是石桥。师曰。度驴度马。曰如何是略彴。师曰。个个度人师因与文远行。乃指一片地曰。这里好造个巡铺。文远便去路旁立曰。把将公验来。师遂与一掴。远曰。公验分明过师与文远论义曰。斗劣不斗胜。胜者输果子。远曰。请和尚立义。师曰。我是一头驴。远曰。我是驴胃。师曰。我是驴粪。远曰。我是粪中虫。师曰。你在彼中作甚么。远曰。我在彼中过夏。师曰。把将果子来师在东司上。见远侍者过。蓦召文远。远应诺。师曰。东司上不可与汝说<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>问菜头。今日吃熟菜吃生菜。头拈起菜呈之。师曰。知恩者少。负恩者多师示众云。今夜答话去也。有解问者出来。时有僧出作礼。师曰。比来抛砖引玉。却引得个墼子。</p><p>　　法眼举问觉铁嘴。先师意作么生。觉云。如国家拜将。乃问甚人去得。或有人出云某甲去得。须云汝去不得。法眼云。我会也长庆棱问觉铁嘴。那僧才出礼拜。为甚么便指为墼子。觉云。适来那边亦有人恁么问。庆云。向伊道甚么。觉云。亦向伊恁么道。</p><p>　　师因二僧相推。不肯作第一座。主事白师。师曰。总教作第二座。事曰。第一座教谁作。师云。装香著。事曰。装香了也。师曰。戒香定香慧香<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>香。</p><p>　　天童华云。赵州下一槌。不妨惊群动众。子细点检将来。也是泥里洗土块。若是荐福门下。不用相推。第一座也有人。第二座也有人。第三座也有人。虽然如是。不免从头注破。第一座铁眼铜睛觑不破。第二座阳春白雪无人和。第三座真实身心同达磨。且道与赵州是同是别。若也会得。许你具一只眼。若也不会。也许你具一只眼。有个衲僧出来道。总不恁么时如何。对他道。切忌向鬼窟里作活计。</p><p>　　师示众曰。才有是非。纷然失心。还有答话分也无。有僧出拊侍者一下曰。作不只对和尚。师便归方丈。后侍者请益。适来僧是会不会。师曰。坐底见立底。立底见坐底。</p><p>　　<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>范颂曰。坐底见立底。立底见坐底。咄哉老赵州。白日眼见鬼。</p><p>　　有僧。举才有是非话。似洛浦。浦扣齿。又举似云居。居曰何必。僧回举似师。师曰。南方大有人丧身失命。曰请和尚举。师才举前语。僧指旁僧曰。这个师僧吃却饭了。作恁么语话。师休去示众。佛之一字。吾不喜闻。</p><p>　　幻庵觉拈云。诸人切忌恁么会。既不恁么会。又作么生会。乃颂曰。佛之一字不喜闻。去年依旧今年春。今年春间降大雪。陆墓乌盆变白盆。</p><p>　　因僧侍次。遂举火问曰。这个是火。你不得唤作火。老僧道了也。僧无对。复筴起火曰。会么。曰不会。师曰。此去舒州有投子和尚。汝往礼拜问之。必为汝说。因缘相契。不用更来。不相契却来。其僧到投子。子问。近离甚处。曰赵州。子曰。赵州有何言句。僧举前话。子曰。汝会么。曰不会。乞师指示。子下禅床行三步。却坐问曰。会么。曰不会。子曰。你归举似赵州。其僧却回举似师。师曰。还会么。曰不会。师曰。投子与么不较多也僧问。二龙争珠。谁是得者。师曰。老僧祇管看。</p><p>　　雪窦显云。看即不无。争即不得。且道扶这僧扶赵州。</p><p>　　上堂。至道无难。唯嫌拣择。才有语言。是拣择是明白。老僧不在明白里。是汝还护惜也无。时有僧问。既不在明白里。护惜个甚么。师曰。我亦不知。僧曰。和尚既不知。为甚道不在明白里。师曰。问事即得。礼拜了退。</p><p>　　雪窦显拈云。赵州倒退三千。复颂云。至道无难。言端语端。一有多种。二无两般。天际日上月下。槛前山深水寒。髑髅识尽喜何立。枯木龙吟消未干。难难。拣择明白君自看。</p><p>　　僧问。至道无难唯嫌拣择。是时人窠臼否。师曰。曾有人问我。老僧直得五年分疏不下。</p><p>　　雪窦显云。识语不能转。死却了也。好与二十棒。这棒须有分付处。若辨不出。且放此话大行天童觉颂云。五年分疏不下。一句元无缝罅。只知推过商量。谁信分明酬价。玲珑底相知。卤莽底相讶。宁可与晓事人相骂。不可共不晓事人说话。</p><p>　　问。至道无难唯嫌拣择。才有语言是拣择。和尚如何为人。师曰。何不引尽此语。僧曰。某甲只念到这里。师曰。至道无难唯嫌拣择。</p><p>　　白云端颂云。驱山塞海也寻常。所至文明始是王。但见皇风成一片。不知何处有封疆。</p><p>　　问。至道无难唯嫌拣择。如何是不拣择。师曰。天上天下唯我独尊。曰此犹是拣择。师曰。田库奴甚处是拣择。僧无语。</p><p>　　无庵全颂云。当门一脉透长安。游子空嗟行路难。不是人前夸俏措。金锤击碎万重关法宗禅师参雪窦。窦令参至道无难唯嫌拣择。于此有省。一日雪窦问宗。至道无难唯嫌拣择。意作么生。宗云。畜生畜生。后隐居投子。常以<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>裹草鞋经文。僧问。如何是道者家风。宗曰。袈裟裹草鞋。曰意旨如何。宗曰。赤脚下桐城圜悟勤云。人多错会道。至道本无难。亦无不难。只是唯嫌拣择。若恁么会。一万年也未梦见在。</p><p>　　师与官人游园次。兔见惊走。遂问。和尚是大善知识。兔见为甚么走。师云。老僧好杀问院主。甚么处来。主曰。送生来。师曰。鸦为甚么飞去。主曰。怕某甲。师曰。汝十年知事。作恁么语话。主却问。鸦为甚么飞去。师曰。院主无杀心僧辞。师问甚处去。曰闽中去。师曰。彼中兵马隘。汝须回避始得。曰向甚处回避。师曰恰好僧游五台。问一婆子曰。台山路向甚处去。婆曰。蓦直去。僧便去。婆曰。好个师僧又恁么去。后有僧举似师。师曰。待我去勘过。明日师便去问。台山路向甚处去。婆曰蓦直去。师便去。婆曰。好个师僧又恁么去。师归院谓僧曰。台山婆子。为汝勘破了也。</p><p>　　雪窦显到曾学士处。曾问。尝与清长老。商量赵州勘婆话。端的有勘破处么。窦云。清长老道个甚么。曾云。又与么去也。窦云。清长老且放过一著。学士还知天下衲僧出这婆子圈缋不得么。曾云。这里别有个道处。赵州若不勘破婆子。一生受屈。窦云。勘破了也真净云。赵州若点检来。也好吃婆手中棒。且道赵州过在甚么处。若知赵州过。方解不受人谩。归宗门下莫有不受人谩底么。喝一喝下座玄觉云。前来僧也恁么道。赵州去也恁么道。甚么处是勘破婆子处。又云。非惟被赵州勘破。亦被这僧勘破径山杲颂。天下禅和说勘破。争知赵州已话堕。引得儿孙不丈夫。人人点过冷地卧蒙庵岳颂。本是山中人。爱说山中话。五月卖松风人间恐无价。</p><p>　　问如何是玄中玄。师曰。汝玄来多少时耶。曰玄之久矣。师曰。阇黎若不遇老僧。几乎玄杀问。万法归一。一归何所。师曰。老僧在青州。作得一领布衫。重七斤。</p><p>　　雪窦颂。编辟曾挨老古锥。七斤衫重几人知。而今抛向西湖里。下载清风付与谁。</p><p>　　僧写师真呈。师曰。且道似我不似我。若似我。即打杀老僧。不似我。即烧却真。僧无对。</p><p>　　玄觉云。留取<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。</p><p>　　师托起钵曰。三十年后若见老僧。留取供养。若不见即扑破。别僧曰。三十年后敢道见和尚。师乃扑破师问僧。曾看<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>么。曰曾看。曰衲衣在空闲。假名阿练若。诳惑<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>人。尔作么会。僧拟礼拜。师曰。尔披衲衣来么。曰披来。师曰。莫惑我。曰作么得不惑去。师曰。莫取我语。</p><p>　　雪窦举云。大小赵州龙头蛇尾。诸人若能辨得。便乃识破赵州。如或不明。个个高拥衲衣。莫惑翠峰好。</p><p>　　问。初生孩子还具六识也无。师曰。急水上打毬子。僧却问投子。急水上打毬子。意旨如何。子曰。念念不停留埽地次。僧问。和尚是大善知识。为甚么扫地。师曰。尘从外来。曰既是清净伽蓝。为甚么有尘。师曰。又一点也问。恁么来底。师还接否。曰接。曰不恁么来底。师还接否。曰接。曰恁么来者从师接。不恁么来者如何接。师曰。止止不须说。我法妙难思有一婆子。令人送钱请转藏经。师受施利了。却下禅床转一匝。乃曰。传语婆转藏经已竟。其人回举似婆。婆曰。比来请转全藏。如何只为转半藏。</p><p>　　径山杲云。众中商量道。如何是那半藏。或云再绕一匝。或弹指一下。或咳嗽一声。或喝一喝。或拍一拍。恁么见解。只是不识羞。若是那半藏。莫道赵州更绕一匝。直饶百千万亿匝。于婆子分上只得半藏。设使更绕须弥山百千万亿匝。于婆子分上亦只得半藏。假饶天下老和尚。共如是绕百千万亿匝。于婆子分上也只得半藏。设使山河大地森罗万象。若草若木。各具广长舌相。异口同音从今日转到尽未来际。于婆子分上亦只得半藏。诸人要识婆子么。良久云。鸳鸯绣出从君看。不把金针度与人。</p><p>　　问。承闻和尚亲见南泉是否。师云。镇州出大萝卜头。</p><p>　　圜悟勤云。有者道。镇州从来出大萝卜头。天下皆知。赵州从来参见南泉。天下皆知。这僧更问。所以道镇州出大萝卜。且得没交涉。江西澄散圣判。谓之东问西答。唤作不答话。不上他圈缋。若恁么会争得。远录公云。此是旁瞥语。收在九带中。若恁么会。梦也未梦见在。更带累赵州去。</p><p>　　官人问。丹霞烧木佛。院主为甚么眉须堕落。师云。官人宅内变生作熟。是甚么人。云所使。师云。却是他好手马大夫问。和尚还<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>也无。师云。老僧若修行即祸事。云和尚既不修行。教甚么人修行。师云。大夫是修行底人。云某甲何名修行。师曰。若不修行。争得扑在人王位中喂得来。赤冻红地无有解出期。大夫乃下泪拜谢问。作何方便即得闻于未闻。师云。未闻且置。你曾闻个甚么来问。不离言句如何得独脱。师云。离言句是独脱。云适来无人教某甲来。师云。因甚么到此。云和尚何不拣出。师云。我早个拣了也师问僧。甚处来。曰江西来。师曰。赵州著在甚么处。僧无对问。不见边表时如何。师指净瓶云。这个唤作甚么。云净瓶。师曰。大好不见边表有僧问。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>二路是同是别。师以颂答云。道人问生死。生死若为论。双林一池水。朗月耀乾坤。唤他句上识。此是弄精魂。欲会个生死。颠人说梦春洞山问僧。甚处来。曰掌鞋来。山曰。自解依他。曰依他。山曰。他还指阇黎也无。僧无对。师代云。若允即不违保寿问。胡钉铰。汝莫是胡钉铰么。曰不敢。寿曰。还钉得<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>么。曰请和尚打破虚空来。寿便打。胡曰。和尚莫错打某甲。师曰。向后有多口阿师。与你点破在。胡后到师处举前话。师曰。汝因甚么被他打。胡曰。不知过在甚么处。师曰。只这一缝尚不奈何。胡于此有省。师曰。且钉这一缝。</p><p>　　雪窦显举云。我要打这三个汉。一打赵州。不合瞎却胡钉铰眼。二打保寿。不能塞却赵州口。三打胡钉铰。不合放过保寿。蓦拈拄杖云。更有一个。大众一时退。击禅床一下。</p><p>　　师问新到。离甚么处。云雪峰。师云。雪峰有甚么言句。云雪峰寻常道。尽十方世界都来是<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>一只眼。你等诸人向甚么处屙。师云。阇黎若回。寄个锹子去师问僧。甚处来。曰摘茶来。师曰闲。</p><p>　　云盖智颂。道著不著。何处摸索。背后龙鳞。面前驴脚。反身筋斗。孤云野鹤。阿呵呵。</p><p>　　新到参。师曰。甚处来。曰南方来。师曰。佛法尽在南方。汝来这里作甚么。曰佛法岂有南北耶。师曰。饶汝从云居雪峰来。只是个担板汉。</p><p>　　崇寿稠云。和尚是据客置主人。</p><p>　　师闻沙弥喝参向侍者曰。教伊去者乃教去。沙弥便珍重。师曰。沙弥得入门。侍者在门外师问一婆子。甚么处去。曰偷赵州笋去。师曰。忽遇赵州又作么生。婆与一掌。师休去。</p><p>　　瞎堂远颂云。去若丘山重。来如一羽轻。去来无别路。倾盖白头新。</p><p>　　师因有老宿问。近离甚处。师云滑州。宿云。几程到这里。师云。一跶到。宿云。好个捷疾鬼。师云。万福大王。宿云。参堂去。师应喏喏师一日到僧堂后逢一僧。乃问。大德总向甚处去。僧云。普请去。师遂于袖中取刀度与云。老僧住持事繁。请上座为我折倒却。便引颈向前。其僧便走僧辞。师曰。甚处去。曰诸方<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>法去。师竖起拂子曰。有佛处不得住。无佛处急走过。三千里外逢人不得错举。曰与么则不去也。师曰。摘杨花摘杨花。</p><p>　　径山杲颂云。有佛处不得住。生铁秤锤被虫蛀。无佛处急走过。撞著嵩山破灶堕。三千里外莫错举。两个石人相耳语。恁么则不去也。此话已行遍天下。摘杨花摘杨花。唵嚤呢哒哩吽[口*發]吒。</p><p>　　尼问。如何是密密意。师以手掐之。尼曰。和尚犹有这个在。师曰。却是你有这个在问十二时中如何用心。师曰。汝被十二时辰使。老僧使得十二时。乃曰。兄弟莫久立。有事商量。无事向衣钵下坐穷理好。老僧行脚时。除却二时粥饭。是杂用心处。除外更无别用心处。若不如是。大远在又谓众曰。你若一生不离丛林。不语五年十载。无人唤你作哑汉。已后佛也不奈你何。你若不信。截取老僧头去上堂。金佛不度罏。木佛不度火。泥佛不度水。真佛内里坐。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>涅槃真如佛性。尽是贴体衣服。亦名烦恼。实际理地甚么处著。一心不生。万法无咎。汝但究理坐看三二十年。若不会。截取老僧头去。梦幻空华徒劳把捉。心若不异。万法一如。既不从外得。更拘执作么。如羊相似。乱拾物安向口里。老僧见药山和尚道。有人问著。但教合取狗口。老僧亦教合取狗口。取我是垢。不取我是净。一似猎狗专欲得物吃。佛法在甚么处。千人万人尽是觅佛汉子。于中觅一个道人无。若与空王为<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。莫教心病最难医。未有世界早有此性。世界坏时此性不坏。一从见老僧后。更不是别人。只是个主人公。这个更向外觅作么。正恁么时。莫转头换脑。若转头换脑。即失却也。僧问。承师有言。世界坏时此性不坏。如何是此性。师曰。四大<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。曰此犹是坏底。如何是此性。师曰。四大五阴。</p><p>　　法眼云。是一个两个。是坏不坏。且作么生会。试断看妙喜曰。军营里大王雪窦颂。泥佛不度水。神光照天地。立雪如未休。何人不雕伪。金佛不度罏。人来访子湖。牌中数个字。清风何处无。木佛不度火。常思破灶堕。杖子忽击著。方知孤负我。</p><p>　　示众云。兄弟若从南方来者。即与下载。若从北方来者。即与装载。所以道。近上人问道即失道。近下人问道即得道。兄弟。正人说邪法。邪法亦随正。邪人说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。正法亦随邪。诸方难见易识。我这里易见难识又云。此事如明珠在掌。胡来胡现。汉来汉现。老僧拈一枝草作丈六金身用。将丈六金身作一枝草用。佛即是烦恼。烦恼即是佛。</p><p>　　又僧问。未审佛是谁家烦恼。师曰。与一切人烦恼。曰如何免得。师曰。用免作么。</p><p>　　又云。老僧此间。即以本分事接人。若教老僧随伊根机接人。自有三乘十二分教。接他了也。若是不会。是谁过欤。已后遇著作家汉。也道老僧不孤负他。但有人问。以本分事接人师自受南泉印可。乃归曹州。省受业师。亲属闻师归。咸欲来会。师闻曰。俗尘爱网无有了期。已辞出家。不愿再见。遂携瓶锡遍历诸方。常谓。七岁儿童胜我者。我即问伊。百岁老翁不及我者。我即教他。及往赵州观音院。燕赵二王同至院见师。师端坐不起。燕王问曰。人王尊耶法王尊耶。师曰。若在人王。人王中尊。若在法王。法王中尊。二王闻之欢然敬服。乃同供养。师志效古人。住持枯稿。僧堂无前后架。旋营斋食。绳床一角折。以绳系残薪支之。屡有愿为制新者。师不许也。住持四十余年。未尝以一书告檀越。唐乾宁四年十一月二日。右胁泊然而寂。寿一百二十岁。谥真际大师。</p><p>　　▲湖南长沙景岑招贤禅师</p><p>　　上堂。我若一向举扬<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>。法堂前须草深一丈。事不获已。向汝诸人道。尽十方世界是沙门眼。尽十方世界是沙门全身。尽十方世界是自己光明。尽十方世界在自己光明里。尽十方世界无一人不是自己。我常向汝诸人道。三世诸佛法界众生。是摩诃般若光。光未发时。汝等诸人向甚么处委悉。光未发时。尚无佛无众生消息。何处得山河国土来。时有僧问。如何是沙门眼。师曰。长长出不得。又曰。<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>成祖出不得。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>出不得。僧曰。未审出个甚么不得。师曰。昼见日夜见星。曰学人不会。师曰。妙高山色青又青。</p><p>　　妙喜曰。熟处难忘。</p><p>　　师与仰山玩月次。山曰。人人尽有这个。只是用不得。师曰。恰是倩汝用。山曰。你作么生用。师劈胸与一蹋。山曰。[囗@力]。直下似个大虫。自此诸方称为岑大虫。</p><p>　　长庆云。前彼此作家。后彼此不作家。乃别云。邪法难扶。</p><p>　　游山归。首座问。和尚甚处去来。师曰。游山来座曰到甚么处。师曰。始从芳草去。又逐落花回。座曰。大似春意。师曰。也胜秋露滴芙蕖。</p><p>　　雪窦著语云。谢答话。复颂云。大地绝纤埃。何人眼不开。始随芳草去。又逐落花回。羸鹤翘寒木。狂猿啸古台。长沙无限意。咄。</p><p>　　有秀才。看千佛名经。问曰。百千诸佛但见其名。未审居何国土。还化物也无。曰黄鹤楼崔颢题后。秀才还曾题也未。曰未曾。曰得闲题取一篇好。</p><p>　　黄龙新颂云。黄鹤楼前法战时。百千诸佛竖降旗。问渠国土归何处。赢得多才一首诗。</p><p>　　问。本来人还成佛也无。师曰。汝见大唐天子。还自种田割稻么。曰未审是何人成佛。师曰。是汝成佛。僧无语。师曰会么。曰不会。师曰。如人因地而倒依地而起。地道甚么问。向上一路请师道。师曰。一口针三尺线。曰如何领会。师曰。益州布扬州绢僧问师同参会和尚曰。和尚见南泉后如何。会默然。僧曰。和尚未见南泉已前作么生。会曰。不可更别有也。僧回举似师。师示偈曰。百尺竿头不动人。虽然得入未为真。百尺竿头须进步。十方世界是全身。僧便问。只如百尺竿头如何进步。师曰。朗州山澧州水。曰不会。师曰。四海五湖皇化里。</p><p>　　妙喜曰。要见长沙。更进一步。若有人问如何是遮一步。待我款款地。与你葛藤。</p><p>　　竺<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>问。蚯蚓斩为两段。两头俱动。未审佛性在阿那头。师曰。莫妄想。曰争奈动何。师曰。会即风火未散。书无对。师唤尚书。书应诺。师曰。不是尚书本命。曰不可雕却即今只对。别有第二主人。师曰。唤尚书作至尊得么。曰恁么总不只对时。莫是弟子主人否。师曰。非但只对与不只对时。无始劫来是个生死根本。示偈曰。学道之人不识真。只为从来认识神。无始劫来生死本。痴人唤作本来人。</p><p>　　灯录作两则。风火未散上作一则。师唤尚书下又作一则。语亦小异。此从宗门统要正法眼藏。妙喜曰。即今只对者既不是本来人。却唤甚么作本来人。良久曰。我恁么道。且作死马医又皓月供奉问师。蚯蚓断为两段。两头俱动。未审佛性在阿那头。师曰。动与不动是何境界。曰言不干典。非智者之所谈。只如和尚言动典不动是何境界。出自何经。师曰。灼然言不干典。非智者之所谈。大德岂不见首楞严云。当知十方无边不动虚空。并其动摇地水火风均名六大。性真圆融。皆如来藏。本无生灭。复示偈曰。最甚深最甚深。法界人身便是心。迷者迷心为众色。悟时刹境是真心。身界二尘无实相。分明达此是知音。</p><p>　　问。如何转得山河国土归自己去。师曰。如何转得自己成山河国土去。曰不会。师曰。湖南城下好养民。米贱柴多足四邻。僧无语。师示偈曰。谁问山河转。山河转向谁。圆通无两畔。法性本无归问。南泉道三世诸佛不知有。狸奴白牯却知有。为甚么三世诸佛不知有。师曰。未入鹿苑时犹较些子。曰狸奴白牯为甚么却知有。师曰。汝争怪得伊问。和尚继嗣何人。师曰。我无人得继嗣。曰还参学也无。师曰。我自参学。曰师意何如。师示偈曰。虚空问万象。万象答虚空。谁人亲得闻。木义丱角童示众。若心是生。则梦幻空华亦应是生。若身是生。则山河大地万象森罗亦应是生问。教中说幻意是有耶。师曰。大德是何言欤。曰恁么则幻意。是无邪。师曰。大德是何言欤。曰恁么则幻意是不有不无邪。师曰。大德是何言欤。曰如某三明。尽不契于幻意。未番和尚如何明教中幻意。师曰。大德信一切法不思议否。曰佛之诚言那敢不信。师曰。大德言信。二信之中是何信。曰如某所明。二信之中是名缘信。师曰。依何教门得生缘信。曰华严云。菩萨摩诃萨以无障无碍<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。信一切世间境界是如来境界。又华严云。诸佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>悉知世法及诸佛法。性无差别。决定无二。又华严云。佛法世间法。若见其真实。一切无差别。师曰。大德所举缘信教门甚有来处。听老僧与大德明教中幻意。若人见幻本来真。是则名为见佛人。圆通法法无生灭。无灭无生是<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>华严座主问。虚空为是定有。为是定无。师曰。言有亦得。言无亦得。虚空有时但有。假有虚空无时但无假无。曰如和尚所说。有何教文。师曰。大德岂不闻首楞严云。十方虚空生汝心内。犹如片云点太清里。岂不是虚空生时但生假名。又云汝等一人发真归元。十方虚空悉皆销殒。岂不是虚空灭时但灭假名。老僧所以道。有是假有。无是假无问。如何是文殊。师曰。墙壁瓦砾是。曰如何是观音。师曰。音声语言是。曰如何是普贤。师曰。众生心是。曰如何是佛。师曰。众生色身是。曰河沙诸佛体皆同。何故有种种名字。师曰。从眼根返源名文殊。耳根返源名观音。从心返源名普贤。文殊是佛妙观察智。观音是佛<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>大慈。普贤是佛无为妙行。三圣是佛之妙用。佛是三圣之真体。用则有河沙假名。体则总名一薄伽梵问。南泉迁化向甚么处去。师曰。东家作驴。西家作马。曰学人不会。此意如何。师曰。要骑即骑。要下即下三圣令秀上座问曰。南泉迁化向甚么处去。师曰。石头作沙弥时。参见六祖。秀曰。不问石头见六祖。南泉迁化向甚么处去。师曰。教伊寻思去。秀曰。和尚虽有千尺寒松。且无抽条石笋。师默然。秀曰。谢和尚答话。师亦默然。秀回举似三圣。圣曰。若恁么。犹胜临济七步。然虽如此。待我更验看。至明日三圣上问。承闻和尚昨日答南泉迁化一则语。可谓光前绝后。今古罕闻。师亦默然问亡僧迁化甚么处去也。师示偈曰。不识金刚体。却唤作缘生。十方真寂灭。谁在复谁行。</p><p>　　林间录曰。长沙岑禅师因僧亡。以手摩之曰。大众。此僧却真实为诸人提纲商量。会么。乃有偈曰。目前无一法。当处亦无人。荡荡金刚体。非妄亦非真。又曰。雪峰和尚亦因见亡僧作偈曰。低头不<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>。仰面不见天。欲识金刚体。但看髑髅前。玄沙曰。亡僧面前正是触目菩提。万里神光顶后相。有僧问法眼。如何是亡僧面前触目菩提。法眼答曰。是汝面前。又问。迁化向甚么处去。答曰。亡僧几曾迁化。进曰。争奈即今何。答曰。汝不识亡僧。天衣怀云。亡僧面前即且置。只如活人背后底是甚么。近代尊宿不复以此旨晓人。独晦堂老师时一提起。作南禅师圆寂日偈曰。去年三月十有七。一夜春风撼筹室。三角麒麟入海中。空余片月波心出。真不掩伪。曲不藏直。谁人为和雪中吟。万古知音是今日。又云。昔人去时是今日。今日依前人不来。今既不来昔不往。白云流水空悠哉。谁云秤尺平。直中还有曲。谁云物理齐。种麻还得粟。可怜驰逐天下人。六六元来三十六。</p><p>　　皓月供奉问。天下善知识证<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>涅槃也未。师曰。大德问果上涅槃因中涅槃。曰问果上涅槃。师曰。天下善知识未证。曰为甚么未证。师曰。功未齐于诸圣。曰功未齐于诸圣。何为善知识。师曰。明见佛性。亦得名为善知识。曰未审功齐何道。名证大涅槃。师示偈曰。摩诃般若照。解脱甚深法。法身寂灭体。三一理圆常。欲识功齐处。此名常寂光。曰果上三德涅槃已蒙开示。如何是因中涅槃。师曰。大德是。</p><p>　　进山主问修山主曰。明知生是不生之理。为甚么为生死之所<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。修曰。笋毕竟成竹去。如今作篾使还得么。进曰。汝向后自悟去在。修曰。某所见只如此。上座意旨又如何。进指曰。这个是监院房。那个是典座房。修即礼谢。</p><p>　　初师久依南泉。有投机偈曰。今日还乡入大门。南泉亲道遍乾坤。法法分明皆祖父。回头惭愧好儿孙。泉答曰。今日投机事莫论。南泉不道遍乾坤。还乡尽是儿孙事。祖父从来不出门。</p><p>　　▲鄂州茱萸山和尚</p><p>　　上堂。擎起一橛竹曰。还有一虚空里钉得橛么。时有灵虚上座。出众曰。虚空是橛。师便打。虚曰。莫错打。师便下座。</p><p>　　云门偃云。矢上加尖。有僧云。和尚适来与么道那。门云。捶钟谢响得个虾蟆出来。</p><p>　　▲衢州子湖岩利踪禅师</p><p>　　于门下立牌曰。子湖有一只狗。上取人头。中取人心。下取人足。拟议即丧身失命。临济会下二僧来参。方揭帘。师喝曰。看狗。僧回顾。师便归方丈或有人问子湖狗。师曰嗥嗥。僧无语。师便归方丈刘铁磨参。师曰。汝是刘铁磨否。曰不敢。师曰。左转右转。曰和尚莫颠倒。师便打与胜光和尚锄园次。师蓦按钁回视光曰。事即不无。拟心即差。光便问。如何是事。被师拦胸踏倒。光从此有省僧问。自古上贤还达真正理否。师曰达。僧曰。真正理作么生达。师曰。霍光当时卖假银城。与单于契书。是甚么人作。僧无语示众。诸法荡荡。何绊何拘。汝等于中自生难易。心源一统。绵亘十方。上上根人自然明白。不见南泉道。如斯痴钝。世且还稀。历历分明。有无不是。只少个丈夫之志。致见如斯疲劳。汝欲得易会么。自古及今。未曾有一个凡夫<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>出现汝前。亦无有一善语恶语到汝分上。为甚么故。为善善无形。为恶恶无相。既已<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。把甚么为善恶。立那个是凡圣。汝信否。还保任否。有甚么回避处。恰似日中逃影相似。还逃得么。今之既尔。古之亦然。今古齐时。汝还讳得么。佛法玄妙。了得者自相策发。无为小缘妨于大事。汝不见道。宁可终身立法。谁能一旦忘缘。仁者要得会禅么。各归衣钵下看示众。幸自可怜生。苦死向人前。讨些子声色唇吻作么。我且问你。声色两字作么生讨得。还会么。我道声色如泡。为复为你说破。为复为你讨声色。试商量看。莫生容易。志刚用心。若了根源。终非他物。譬如圆镜。男来男现。女来女彰。乃至僧俗青黄山河万物。随其色相。一镜传辉。不可是镜有多般。但能映物而露。仁者还识得镜未。若不识镜。尽被男女青黄山河类等碍汝光明。有甚么出气处。若识镜去。乃至青黄男女。大地山河。有想无想。四足多足。胎卵情生。天堂地狱。咸于一镜中。悉得其分剂长短劫数。若色若空并能了之。更非他物。汝岂不闻诸法如义。光阴箭速。莫漫悠悠。大事因缘决须了取。僧问。如何是大圆镜。师云。一切物著不得。进云。为甚么一切物著不得。师云。汝是一切物。还著得汝否仁者。本自具足。本自周备。直教无纤尘法碍你眼光始得。若有微尘底不尽。不是一生半劫赚汝皮囊。汝性命根境法中。造诸妖怪。山精鬼魅。附汝行持。得少为足。鼓弄片皮。于佛法却为毒害。讥礼塔庙。毁彼持经。师子身中虫。自食师子身中肉仁者岂不见。目前太虚。还有纤毫欠少处么。若也于中体得这个消息。不妨出得凡圣境界。了得世间出世间之智。一法既尔。万法亦然。仁者还乐也无示众。天上人间轮回六道。乃至蠢动含灵。未曾于此一分真如中。有些子相违处。还信么。还领受得么。大凡行脚。也须具大信根作个丈夫始得。何处得与么难信。他古人只见道个即心是佛。即心是法。便承信去。随处茅茨石室。长养圣胎。只待<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>成熟。汝今何不效他行取。仁者可煞分明。并无参杂。治生产业。与诸实相不相违背初子湖山下有陶家。无子。夫妇日夕焚祷。师一日过而问曰。尔何所祈。陶告之故。师曰。汝施我竹。我施汝子。陶遂施竹。其夕感异梦。随举一男。众因号师神力禅师广明中无疾归寂。塔于本山。</p><p>　　▲荆南白马昙照禅师</p><p>　　常曰快活快活。及<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>时。叫苦苦。又曰。阎罗王来取我也。院主问曰。和尚当时被节度使抛向水中。神色不动。如今何得恁么地。师举枕子曰。汝道当时是如今是。院主无对。</p><p>　　法眼代云。此时但掩耳出去。</p><p>　　▲终南山云际师祖禅师</p><p>　　初参南泉问。摩尼珠人不识。如来藏里亲收得。如何是藏。泉曰。与汝往来者是。师曰。不往来者如何。泉曰亦是。曰如何是珠。泉召师祖。师应诺。泉曰。去。汝不会我语。师从此信入。</p><p>　　雪窦显云。百尺竿头作伎俩。不是好手。这里著得只眼。宾主互换。便能深入虎穴。或不恁么。纵饶师祖悟去。也是龙头蛇尾汉圜悟云。南泉一期垂手。收放擒纵则不无。要且未见向上事在。只如尽大地是如来藏。向甚么处著珠。尽大地是摩尼珠。向甚么处著藏。若明得有转身处。许你具一只眼。</p><p>　　▲邓州香严下堂义端禅师</p><p>　　僧问。某甲曾辞一老宿。宿曰。去则亲良朋附善友。某今辞和尚。未审有何指示。师曰。礼拜著。僧礼拜。师曰。礼拜一任礼拜。不得认奴作郎。</p><p>　　▲池州灵鹫闲禅师</p><p>　　上堂。是汝诸人本分事。若教老僧道。即是与蛇画足。时有僧问。与蛇画足即不问。如何是本分事。师曰。阇黎试道看。僧拟再问。师曰。画足作么。</p><p>　　▲日子和尚</p><p>　　因亚溪来参。师作起势。溪曰。这老山鬼。犹见某甲在。师曰。罪过罪过。适来失只对。溪欲进语。师便喝。溪曰。大阵当前不妨难御。师曰是是。溪曰。不是不是。</p><p>　　赵州云。可怜两个汉。不识转身句。</p><p>　　▲苏州西禅和尚</p><p>　　僧问。三乘十二分教则不问。如何是祖师西来的的意。师举拂子示之。其僧不礼拜。竟参雪峰。峰问。甚么处来。曰浙中来。峰曰。今夏甚么处。曰西禅。峰曰。和尚安否。曰来时万福。峰曰。何不且在彼<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>。曰佛法不明。峰曰。有甚么事。僧举前话。峰曰。汝作么生不肯伊。曰是境。峰曰。汝见苏州城里人家男女否。曰见。峰曰。汝见路上林木池沼否。曰见。峰曰。凡睹人家男女林木池沼总是境。汝还肯否。曰肯。峰曰。只如举起拂子。汝作么生不肯。僧乃礼拜曰。学人取次发言。乞师慈悲。峰曰。尽乾坤是个眼。汝向甚么处蹲坐。僧无语。</p><p>　　▲池州甘贽行者</p><p>　　一日入南泉设斋。黄檗为首座。行者请施财。座曰。财法二施等无差别。甘曰。恁么道争消得某甲嚫。便将出去。须臾复入曰。请施财。座曰。财法二施等无差别。甘乃行嚫。</p><p>　　翠岩真云。甘贽行者黠儿落节。黄檗施财何曾梦见。妙喜举翠岩语云。一等是随邪逐恶。这云居罗汉较些子。</p><p>　　又一日入寺设粥。仍请南泉念诵。泉乃白椎曰。请大众为狸奴白牯念摩诃般若波罗蜜。甘拂袖便出。泉粥后问典座。行者在甚处。座曰。当时便去也。泉便打破锅子。</p><p>　　妙喜云。心不负人。面无惭色。颂云。南泉打破闲家具。浩浩诸方作话看。今日为君重举过。明明历历不颟顸。</p><p>　　▲洪州双岭玄真禅师</p><p>　　初问道吾。无<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>菩萨。为甚么足迹难寻。吾曰。同道者方知。师曰。和尚还知否。吾曰不知。师曰。何故不知。吾曰。去。你不识吾语。师后于盐官处悟旨焉。</p><p>　　▲福州芙蓉山灵训禅师</p><p>　　初参归宗问。如何是佛。宗曰。我向汝道。汝还信否。曰和尚诚言安敢不信。宗曰。即汝便是。师曰。如何保任。宗曰。一翳在眼。空华乱坠。</p><p>　　法眼云。若无后语。有甚么归宗。</p><p>　　师辞。宗问。甚么处去。师曰。归岭中去。宗曰。子在此多年。装束了却来。为子说一上佛法。师结束了上去。宗曰。近前来。师乃近前。宗曰。时寒途中善为。师聆此言。顿忘前解。</p><p>　　▲汉南高亭和尚</p><p>　　有僧自夹山来礼拜。师便打。僧曰。特来礼拜。何得打某甲。僧再礼拜。师又打趁。僧回举似夹山。山曰。汝会也无。曰不会。山曰。赖汝不会。若会。即夹山口哑。</p><p>　　▲新罗大茅和尚</p><p>　　上堂。欲识诸佛师。向无明心内识取。欲识<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>不凋性。向万物迁变处识取。</p><p>　　▲五台山智通禅师(自称大禅佛)</p><p>　　初在归宗会下。忽一夜连叫曰。我大悟也。众骇之。明日上堂众集。宗曰。昨夜大悟底僧出来。师出曰某甲。宗曰。汝见甚么道理。便言大悟。试说看。师曰。师姑原是女人做。宗异之。师便辞去。宗门送与提笠子。师接得笠子戴头上便行。更不回顾。后居台山法华寺。临终有偈曰。举手攀南斗。回身倚北辰。出头天外看。谁是我般人。</p><p>　　▲镇州普化和尚者</p><p>　　不知何许人也。师事盘山。密受记莂。而佯狂出言无度。暨盘山顺世。乃于此地行化。或城市或冢间。振一铎曰。明头来明头打。暗头来暗头打。四面八方来旋风打。虚空来连架打。一日临济令僧捉住曰。总不恁么来时如何。师拓开曰。来日大悲院里有斋。僧回举似济。济曰。我从来疑著这汉。</p><p>　　五祖演举云。若是五祖即不然。有人问总不恁么来时如何。和声便打。是他须道五祖盲枷瞎棒。我只要你恁么道。何故。一任举似诸方。</p><p>　　凡见人无高下。皆振铎一声。或将铎就人耳边振之。或附其背。有回顾者。即展手曰。乞我一钱师见马步使。出喝道。师亦喝道作相扑势。马步使令人打五棒。师曰。似即似。是即不是师尝于阛阓间。摇铎唱曰。觅个去处不可得。时道吾遇之。把住问曰。汝拟去甚么处。师曰。汝从甚么处来。吾无语。师掣手便去临济初开堂。师首往赞佐。唐咸通初将示灭。乃入市谓人曰。乞我一个直裰。人或与披袄。或与布裘。皆不受。振铎而去。临济令人送与一棺。师笑曰。临济厮儿饶舌。便受之。乃辞众曰。普化明日去东门死也。郡人相率送出城。师厉声曰。今日葬不合青乌。乃曰明日南门迁化。人亦随之。又曰。明日出西门方吉。人出渐稀。出已还返。人意稍怠。第四日自擎棺出北门外。振铎入棺而逝。郡人奔走出城。揭棺视之已不见。惟闻空中铎声渐远。莫测其由。</p><p>　　▲寿州良遂禅师</p><p>　　参麻谷。谷见来。便将锄头去锄草。师到锄草处。谷殊不顾。便归方丈闭却门。师次日复去。谷又闭门。师乃敲门。谷问阿谁。师曰良遂。才称名忽然契悟。曰和尚莫谩良遂。良遂若不来礼拜和尚。洎被经论赚过一生。谷便开门相见。及归讲肆。谓众曰。诸人知处良遂总知。良遂知处诸人不知。</p><p>　　▲虔州处微禅师</p><p>　　僧问。三乘十二分教体理得妙。与祖意是同是别。师曰。须向六句外鉴。不得随声色转。曰如何是六句。师曰。语底默底不语不默总是总不是。汝合作么主。僧无对问仰山。汝名甚么。山曰慧寂。师曰。那个是慧。那个是寂。山曰。只在目前。师曰。犹有前后在。山曰。前后且置。和尚见个甚么。师曰。吃茶去。</p><p>　　▲金州操禅师</p><p>　　请米和尚斋。不排坐位。米到展坐具礼拜。师下禅床。米乃坐师位。师却席地而坐。斋讫米便去。侍者曰。和尚受一切人钦仰。今日坐位被人夺却。师曰。三日后若来。即受救在。米三日后果来。曰前日遭贼。</p><p>　　▲湖南上林戒灵禅师</p><p>　　初参沩山。山曰。大德作甚么来。师曰。介胄全具。山曰。尽卸了来。与大德相见。师曰。卸了也。山咄曰。贼尚未打。卸作甚么。师无对。仰山代曰。请和尚屏却左右。沩山以手指曰。喏喏。师后参永泰。方谕其旨。</p><p>　　永泰灵湍。马祖法嗣。</p><p>　　▲五台山秘魔岩和尚</p><p>　　常持一木叉。每见僧来礼拜。即叉却颈曰。那个魔魅教汝出家。那个魔魅教汝行脚。道得也叉下死。道不得也叉下死。速道速道。学徒鲜有对者。霍山通和尚访师。才见不礼拜。便撺入怀里。师拊通背三下。通起拍手曰。师兄。三千里外赚我来。三千里外赚我来。便回。</p><p>　　▲湖南祇林和尚</p><p>　　每叱文殊普贤皆为精魅。手持木剑。自谓降魔。才见僧来参。便曰魔来也魔来也。以剑乱挥归方丈。如是十二年。后置剑无言。僧问。十二年前为甚么降魔。师曰。贼不打贫儿家。曰十二年后为甚么不降魔。师曰。贼不打贫儿家。</p> </div>"
    }
]