[
    {
        "title": "大和尚“绝情”度贫母",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x5927;&#x548C;&#x5C1A;&#x201C;&#x7EDD;&#x60C5;&#x201D;&#x5EA6;&#x8D2B;&#x6BCD;\" src=\"https://www.liaotuo.com/uploadfile/2017/1204/20171204092948856.jpeg\" style=\"width: 484px; height: 300px\" title=\"&#x5927;&#x548C;&#x5C1A;&#x201C;&#x7EDD;&#x60C5;&#x201D;&#x5EA6;&#x8D2B;&#x6BCD;\" /></p>\n<p>　　有一个老妪，儿子幼时<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，现在她很老了，连讨饭都走不动路。她获悉儿子当了庙里的方丈，好像这个庙还很有钱。她就心想，这么多人居住，也不缺我一口吃的，回去找儿子吧，法师都是慈悲的。</p>\n<p>　　老太太这就去找儿子。庙的确很大，庙门开着，却有师父把门。正想进去，这个师父就问，老施主您从哪来？做什么事啊？老太太说：“找我儿子，他在里面当方丈，”并叫他儿子的乳名。这把门的小师父也不知方丈过去的小名叫什么，和老太太说：“您稍等，我去请示一下方丈。”小师父给方丈一<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>，把经过一说，方丈一听赶紧叫了进来。</p>\n<p>　　老太太一进就叫他的乳名说：“儿子，你现在很好了，可你的母亲现在没饭吃了，我实在是没办法了，讨饭连道也走不了。我来这里没别的要求，你每天能给我口饭吃，有个睡觉的地方就行了。”</p>\n<p>　　方丈一听就说了：“我是你儿子，你是我母亲，这是实实在在的。你知道，现在我住的这个地方是庙，是寺院，是十方大众<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的道场。我现在吃的饭不是我自己的，我也不种地，也不做买卖，这个饭是大众的<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。这供养我能吃，为什么我能吃？我每天念经<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>，给一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>消灾，祈福，为弘扬<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>来普度众生，做这些工作才可以吃众生的这碗饭。你说你在这里吃住，又不会念佛，又不会弘扬佛法，又不会念经给人家消灾。我可不敢留你，这可是错<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>的事。”</p>\n<p>　　老太太一听，这儿子太绝情了，太不像话了，这庙这么大住了几百号人，哪天的剩饭我也吃不了，怎么说这话，莫名其妙。<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>地说：“不管怎么样，我生你一场，也抚养到你好几岁，在以前讨饭的时候，你走不动路我背着你抱着你，好饭尽你吃。你现在行了，当了方丈了，我现在讨饭不行了，跟你要一口饭吃你都不愿意。”老太太骂了一阵，生了一阵气。</p>\n<p>　　方丈如如不动，还是如此：“母亲啊，你不知道，儿子是不孝，怕你造业。实在没办法，你这一生穷，是你前生没有修福，所以你讨了一生的饭。这个因果关系是丝毫不差的，希望母亲能谅解。”母亲一看儿子一直是这样说，她对这里的因果关系不是十分明了。世界上的老百姓，只知道善有善报，恶有恶报，她不懂得这细节上的道理，哪里有儿子不给母亲吃饭的。</p>\n<p>　　后来母亲又跟儿子慢慢商量说：“那你说怎么办，我走不动路，总不能让我冻死、饿死、累死吧！你总得给我想个办法呀。”她这么一说，儿子就开话了：“办法不是没有，但就有那么一线小路，我怕你不同意，如果你同意了，就能办成，不同意就不行！”</p>\n<p>　　母亲说：“你说吧，只要能给我口饭吃，叫我怎么办，能办得到我就办。”儿子说：“决定能办到，就看你办不办，你每天坚持念阿弥陀佛。心里只有一个念头念阿弥陀佛，求生西方<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>，这就行了。你念一句阿弥陀佛，我给你一粒米，你一天只念了这一句，行了，你就吃这一粒米。你念一万句给你一万粒，你说同意不？”他妈一听叫念佛，这行，念一句给一粒，念一天说不定就够吃，就答应了。</p>\n<p>　　方丈就派了一个小和尚在那发米，监督她，念一句给一粒。刚开始很不习惯，因为她没有这个<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，累得不得了，没过几天，瘦得皮包骨头。几天一过，风声就传遍了寺院。师父、<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>议论纷纷：方丈一丁点人情味也没有，怎能这样对待自己的母亲？太绝情了！<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>是最慈悲的，这个事情要是让信众知道了，不知道影响有多坏，整个寺院的名声就毁掉了，也断了别人信佛的<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，唉，这可如何是好！</p>\n<p>　　监督老太太念佛的小和尚也觉得大和尚不像话，一点<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>，慈悲心也没有。心想，这我不能不管，我得照顾老太太。偷偷抓了一把米，放在了老太太的碗里。这边刚刚<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>去，那边大和尚就派了侍者来问这个小和尚：“你刚才做了什么？”小和尚辩道“师父我什么也没做。”“你有没有抓一把米放在老太太的碗里？”他一看瞒不住了，就老实交待：“是，我看老太太太可怜了，就抓了一把米偷偷放到碗里，希望大和尚慈悲。”“好，我是不慈悲，但你现在就离开这个寺院。”小和尚被迁单了。“你不守我的清规，我指定你的工作你不去完成，结果来个假慈悲，坏了我的道法。”</p>\n<p>　　把小和尚一迁单，全寺的人就都公开地骂大和尚。大和尚也知道，但他是悟道的人啊！他不做辩论，只是又派了一个小和尚去监督他的母亲。每天就这么念，时间长了，也顺了，这一念就是三年，有一天，老太太对监督她的小和尚说：“小师父，你去叫大和尚来，我有话要和他说。”这时她也不叫儿子小名了。</p>\n<p>　　小师父一看老太太今天精神饱满，和往常不一样，跑到大和尚那一顶礼：“师父，老太太有话要和您说。”大和尚一听，就过去了。</p>\n<p>　　老太太恭恭敬敬跪在地上磕了三个头：“感谢大和尚度了我，感谢法师慈悲，彻底地度了我，我今天是跟大和尚辞行了，阿弥陀佛已经通知我，今天就走，去西方！”大和尚满面笑容地说：“我知道了。”</p>\n<p>　　这么一说一答，小和尚还在床边发愣呢，老太太就把腿一盘，掌一合，念了两声阿弥陀佛，就走了。</p>\n<p>　　老太太这样一走，全寺的人就传开了，好多人都跑到大和尚那里来求<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>：“我们这几年一直在骂您，说您不是个好方丈，甚至不是个人。这一下我们才真正的了解到，我们的方丈是大慈悲，不是一般的小慈悲，是真正的慈悲！”方丈微微一笑：“难怪呀，只要你们以后能<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>的修行就好了，我怎么能会计较你们呢，只要你们能认真地修行，在这一生定能<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>！”</p>\n<p>　　这个公案一直流传到现在。这是告诫我们<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>人，要以真正的慈悲心来弘扬佛法，来对待佛法，依照佛法去修行！</p>\n</div>"
    }
]