[
    {
        "title": "云岩昙晟禅师",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center;\"><img alt=\"\\\" src=\"https://www.liaotuo.com/uploadfile/2016/0115/20160115030203532.jpg\" style=\"width: 350px; height: 365px;\" /></p>\n<p>　　钟陵建昌王氏子(高僧传。生有自然胎衣。右袒犹缁服)少<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>于石门。参百丈海禅师。二十年。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>不契。后造药山。山问。甚处来。曰百丈来。山曰。百丈有何言句示徒。师曰。寻常道。我有一句子。百味具足。山曰。咸则咸味。淡则淡味。不咸不淡是常味。作么生是百味具足底句。师无对。山曰。争奈目前<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>何。师曰。目前无生死。山曰。在百丈多少时。师曰。二十年。山曰。二十年在百丈。俗气也不除。他日侍立次。山又问。百丈更说什么法。师曰。有时道三句外省去。六句内会取。山曰。三千里外且喜没交涉。山又问。更说什么法。师曰。有时上堂。大众立定。以拄杖一时趁散。复召大众。众回首。丈曰是什么。山曰。何不早恁么道。今日因子得见海兄。师于言下顿省。便<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。</p>\n<p>　　一日山问。汝除在百丈。更到什么处来。师曰。曾到广南来。曰见说广州城东门外有一片石。被州主移去。是否。师曰。非但州主。阖国人移亦不动。山又问。闻汝解弄师子是否。师曰是。曰弄得几出。师曰。弄得六出。曰我亦弄得。师曰。和尚弄得几出。曰我弄得一出。师曰。一即六。六即一。后到沩山。沩问。承闻长老在药山弄师子。是否。师曰是。曰长弄有置时。师曰。要弄即弄。要置即置。曰置时师子在什么处。师曰。置也置也。</p>\n<p>　　师煎茶次。道吾问。煎与阿谁。师曰。有一人要。曰何不教伊自煎。师曰。幸有某甲在。</p>\n<p>　　师问石霜。什么处来。曰沩山来。师曰。在彼中得多少时。曰粗经冬夏。师曰。若恁么即成山长也。曰虽在彼中却不知。师曰。他家亦非知非识。石霜无对。</p>\n<p>　　道吾闻云。得恁么无<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>身心。</p>\n<p>　　住后僧问。二十年在百丈巾瓶。为什么心灯不续。师曰。头上宝华冠。曰意旨如何。师曰。大唐天子及冥王。</p>\n<p>　　后僧举问九峰虔曰。大唐天子及冥王。意旨如何。虔曰。却忆洞上之言。</p>\n<p>　　上堂示众曰。有个人家儿子。问着无有道不得底。洞山出问曰。他屋里有多少典籍。师曰。一字也无。曰争得恁么多知。师曰。日夜不曾眠。山曰。问一段事。还得否。师曰。道得却不道。</p>\n<p>　　问僧。甚处来。曰添香来。师曰。还见佛否。曰见。师曰。什么处见。曰下界见。师曰。古佛古佛。</p>\n<p>　　道吾问。大悲千手眼。那个是正眼。师曰。如人夜间背手摸枕子。吾曰。我会也。师曰。作么生会。吾曰。遍身是手眼。师曰。道也太煞道。只道得八成。吾曰。师兄作么生。师曰。通身是手眼。</p>\n<p>　　雪窦显颂云</p>\n<p>　　遍身是。通身是。拈来犹较十万里。</p>\n<p>　　展翅鹏腾六合云。搏风鼓荡四溟水。</p>\n<p>　　是何埃壒兮忽生。那个毫厘兮未止。</p>\n<p>　　君不见。</p>\n<p>　　网珠垂范影重重。棒头手眼从何起。</p>\n<p>　　咄。</p>\n<p>　　扫地次。道吾曰。太区区生。师曰。须知有不区区者。吾曰。恁么则有第二月也。师竖起扫帚曰。是第几月。吾便行。</p>\n<p>　　玄沙备云。正是第二月。长庆棱问玄沙云。被他倒转扫帚拦面摵又作么生。沙休去。</p>\n<p>　　罗山闲云。噫两个汉不识好恶。云岩个汉缚手脚。死来多少时也。</p>\n<p>　　云门云。奴见婢殷勤。</p>\n<p>　　真如云。将勤补拙。</p>\n<p>　　<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼藏举此则语。及玄沙云门真如三师语云。此三句语。一句可以定乾坤。一句可以验衲僧。一句可以接初机。诸人还拣辨得么。若拣辨得出。许汝亲见慧光。若辨不出。莫道慧光山势险。隔江遥望碧云闲。</p>\n<p>　　问僧。甚处来。曰。石上语话来。师曰。石还点头也无。僧无对。师自代曰。未语话时却点头。</p>\n<p>　　师作草鞋次。洞山近前曰。乞师眼睛得么。师曰。汝底与阿谁去也。曰良价无。师曰。设有。汝向什么处着。山无语。师曰。乞眼睛底是眼否。山曰非眼。师便喝出。</p>\n<p>　　僧问。一念瞥起。便落魔界时如何。师曰。汝因什么却从佛界来。僧无对。师曰会么。曰不会。师曰。莫道体不得。设使体得。也只是左之右之。</p>\n<p>　　院主游石室回。师问。汝去入到石室里许。为只恁么便回。主无对。洞山代曰。彼中已有人占了也。师曰。汝更去作什么。山曰。不可人情断绝去也。</p>\n<p>　　裴大夫问僧。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛佛还吃否。僧曰。如大夫祭家神。大夫举似师。师曰。有几般饭食。但一时下来。师却问神山。一时下来后作么生。神山曰。合取钵盂。师然之。</p>\n<p>　　会昌元年辛酉十月二十六日示疾。命澡身竟。唤主事令备斋。来日有上座发去。至二十七夜归寂。茶毗得<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>一千余粒。瘗于石塔。</p>\n</div>"
    }
]