[
    {
        "title": "东印请祖",
        "author": null,
        "date": "2014-07-23",
        "html": "<div class=\"B1_text\">\n<p>　　示众云。劫前未兆之机。乌龟向火。教外别传一句。碓嘴生花。且道。还有<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵分也无。</p><p>　　举。东印土国王。请二十七祖<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>多罗斋(往往偿口债去也)王问曰。何不看经(无功受禄寝食不安)祖云。贫道入息不居阴界。出息不涉众缘。常转如是经。百千万亿卷(上来讲赞无限胜因)。</p><p>　　师云。二十七祖初名璎珞童子。因二十六祖不如蜜多。与东印土坚固王同辇。问童子曰。能忆往事否。对曰。我忆往劫与师同居。师演摩诃般若。我持甚深修多罗。以相代正化故。俟师于此。祖告王曰。此非小圣。大势至之应身也。王命登辇至宫<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。以至披削。祖取般若修多罗事。命名般若多罗。梁朝以达磨为观音。西国以祖师为势至。唯阿弥陀佛至今无下落。良久云。丰干饶舌。后因皇家展会。尊者主席。这老汉显异惑众。当时好与掀倒。打断葛藤。直待问尊者何不看经。果然放不过。这老汉也无大人相。把葫芦马杓翻腾一上王便<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。识甚痛痒。万松道。国王贪他一粒米。尊者失却万年粮。只知铁脊撑天。不觉脑门着地。若要扶起。除是天童。颂云。</p><p>　　云犀玩月璨含辉(暗通一线文彩已彰)</p><p>　　木马游春骏不羁(百花丛里过一叶不沾身)</p><p>　　眉底一双寒碧眼(不曾趁蛇蜉队)</p><p>　　看经那到透牛皮(过也)</p><p>　　明白心起旷劫(威音前一箭)</p><p>　　英雄力破重围(射透两重关)</p><p>　　妙圆枢口转灵机(何曾动着)</p><p>　　寒山忘却来时路(暂时不住如同死人)</p><p>　　拾得相将携手归(须是当乡人)</p><p>　　师云。破题两句。颂不居阴界。不涉众缘已了。且藏教法数。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>十二处十八界。唤作三科。尊者略举首尾。摄其中间。梵语安那般那。译云出息入息。其法有六。一数二随三止四观五还六净。具如天台<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。预备不虞者不可不知。沩山警策道教理未甞措怀。玄道无因契悟。宝藏论可怜。无价之宝。隐在阴入之坑。何时得灵光独耀逈脱根尘去。天童云犀玩月灿含辉。<a href=\"/ctwh/shici/gushi/\" class=\"keylink\" target=\"_blank\">古诗</a>有犀因玩月纹生角。好言语可惜。折合向文才情思上。木马游春骏不羁。此颂出息不涉众缘。可谓善行无辙迹也。眉底一双寒碧眼。洛浦道。单明自己<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>未明。此人只具一只眼。若要双眼圆明。除是不居阴界不涉众缘。无影林中。高悬日月。不萌枝上。暗辨春秋始得。看经那到透牛皮。长庆云。眼有何过。<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>云。汝今谛观此会圣众。用目循历。其目周视。但如镜中无别分析。这里蹉过。药山道。底牛皮也须穿透。万松道。却具金刚眼。明白心超旷劫。三祖道。但不憎爱洞然明白。一念万年受持不尽。鹿门道。遍大地是学人一卷经。尽乾坤是学人一只眼。以这个眼。读如是经。千万亿劫常无间断。万松道。看读不易。英雄力破重围。后汉王莽遣弟王寻王邑。至昆阳。围光武数十重。光武兵弱而欲降寻邑。邑不肯。光武乃益坚诸将。出兵却战。寻邑大败。尊者文武双全。出将入相。阴界众缘。非但重围也。妙圆枢口转灵机。尔雅枢谓之椳。郭璞注云。门扉枢也。流水不腐。中枢不蠧。言其活也。尊者未点先行。不拨自转。这边那边无可不可。天童披沙拣金。分星擘两。花判了也。末后两句更有余才道。寒山忘却来时路。拾得相将携手归。此颂国筵海众钻纸穿窓。尊者老婆略与。钩帘归乳燕。穴纸出痴蝇。用寒山诗。若合符节。诗云。欲得安身处。寒山可长保。微风吹幽松。近听声愈好。下有斑白人。唠唠读黄老。十年归不得。忘却来时道。闾丘胤访后与拾得相携。出松门更不还寺。有本云。喃喃读黄老。此颂弱丧忘归与迷人指路也。后唐庄宗皇帝。请华严休静禅师。入内斋。大师大德总看经。唯师一众默然。帝问何不看经。静曰。道泰不传天子令。时清休唱太平歌。帝曰。师一人不看即得。徒众何亦不看。静曰。狮子窟中无异兽。象王行处绝狐踪。帝曰。大师大德为甚么总看。静曰。水母元无眼。求食须赖鰕。帝大悦。况祖师尊者从远劫来。号大势至。诵甚深修多罗。因此从师名般若多罗。元来习气也不除。输他华严却有衲僧巴鼻。万松到此不觉失笑。且道。笑个什么。云居罗汉披襟处。巩县茶瓶接嘴时。</p> </div>"
    }
]