[{
    "title": "三国遗事 第一卷",
    "author": "一然大师",
    "html": "<div class=\"B1_text\"><p>三国遗事 第一卷</p><p>校订三国遗事叙</p><p>三国遗事。继金氏<a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a>而作。收录新罗高句丽百济三国遗闻逸事者。高丽忠烈王时。僧一然所撰也。书凡五卷。分为九门。初无序跋。冠以三国年表。所纪神异灵妙。专主崇佛弘法。论者谓荒诞不经。不足取信。然流风遗俗。往往散见于其中。矧州县都市。地势沿革。历然有征。苟欲讲三国旧事。采葑采菲。宁容遗之哉。其书以元至元大德间成。后二百余年。迨明正德七年壬申再刊。庆州府尹李继福跋其后云。吾东方三国。本史遗事两本。他无所刊。而只在本府。岁久勅薄R恍锌山饨鏊奈遄帧R蛴?目?9闱笸瓯尽T氖?瓴坏醚伞P侵菽潦谷ü?N庞嘀?蟆G蟮猛瓯舅陀唷8窃倏??佟3鲇诩谈!6??酵瓯菊摺R喾钦嫱瓯尽?帚谒鹦幢疽选N野钏??卸?尽R辉谖仓莸麓ê睢R徊啬芯羯裉锸稀2⑾嫡?略倏?N淖置?狻B秤阊陕怼B嗜云渚伞I踉蚩罩酵岩丁N亩弦寰?4?豢啥痢S谑窃??也乇尽&gt;萑??芳恰8呃鍪贰6?┰蛹恰6????N南妆缚肌S叩厥だ馈:6?鹗?贰t吆和晾??肥椤N饔蚯蠓ǜ呱??L菩?呱??取2位ゼ旌恕6┢涠镡丁2蛊溷诼?;钭钟⌒小R怨?谑馈V猎?嘟窳?儆嗄辍T?骱霰亓抑谜鞫? R愿呃鑫?肌@纯苡谖抑?稀U蛭髦罹?骷咧?U桨苤?唷@鲋髦劣??迳?渚?椤6?蝗灰愿呃鋈恕3L矻著书于其间。惜不使其笔当时曲折。取信于天下后世。抑三韩与我关系。邈在往世。此书所载。有间及我者。且书中插入乡歌者。多系新罗语。乡歌犹谓国风。新罗古言已亡。才存乡歌十余首。实为沧海遗珠。则匪直核新罗旧事。亦足以参我古言。考古之士。讨其源而究其委。庶几乎其有所资焉。明治三十五年壬寅九月上浣</p><p>例言</p><p>一斯编。本无目次。今据编中标题补之。又第一卷靺鞨渤海条阙二叶。第三卷南月山条阙一叶。伯严寺石塔<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>条阙二叶。其他或佚标题。或脱篇名。共不可考者。姑阙疑</p><p>一年表。首阙二叶。今不可补焉。编中文字阙失。或断烂不能读者。缩摹以存疑。倘以意拟定文字。则加( )分之。其属阙失者。以□□标识之</p><p>一干支数字。时或有差。及行文中有误脱。断做纰缪者补正之。间或辩其是非于鳌头</p><p>一假借音通字。不敢改之。标出其由于鳌头。避字亦然。但省画字。如建作[肂-、]武作正则改之。建系高丽太祖讳字。武则惠宗讳字。并以其难通读也。苏轼云。前辈不敢妄改古书。故文字属别体者。务存其旧形供博古一端。然活字印刷。乌焉易讹。览者谅焉</p><p>三国遗事目次</p><p>年表</p><p>卷第一</p><p>纪异第一</p><p>古朝鲜 魏满朝鲜</p><p>马韩 二府</p><p>七十二国 乐浪国</p><p>北带方 南带方</p><p>靺鞨 渤海 □□□□</p><p>卞韩 百济 辰韩</p><p>四节游宅 新罗始祖 赫居世王</p><p>第二南解王 第三弩礼王</p><p>第四脱解王 金阏智 脱解王代</p><p>延乌郎 细乌女 未邹王 竹叶军</p><p>奈勿王 金堤上 第十八实圣王</p><p>射琴匣 智哲老王</p><p>真兴王 桃花女 鼻荆郎</p><p>天赐玉带 善德王知几三事</p><p>真德王 金庾信</p><p>太宗春秋公 长春郎 罢郎</p><p>卷第二</p><p>□□□□</p><p>文虎王法敏 万波息笛</p><p>孝昭王代 竹旨郎 圣德王</p><p>水路夫人 孝成王</p><p>景德王 忠谈师 表训大德</p><p>惠恭王 元圣大王</p><p>早雪 兴德王 鹦鹉</p><p>神武大王 阎长 弓巴</p><p>第四十八景文大王 处容郎 望海寺</p><p>真圣女大王 居陀知</p><p>孝恭王 景明王</p><p>景哀王 金傅大王</p><p>南扶余 前百济 北扶余</p><p>武王 后百济 甄萱</p><p>驾洛国记</p><p>卷第三</p><p>兴法第三</p><p>顺道肇丽 难陀辟济</p><p>阿道基罗 原宗兴法 厌髑灭身</p><p>法王禁杀 宝藏奉老 普德移庵</p><p>东京兴轮寺金堂十圣 <a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛宴座石</p><p>辽东城育王塔 金官城婆娑石塔</p><p>高丽灵塔寺 皇龙寺丈六</p><p>皇龙寺九层塔</p><p>皇龙寺钟 芬皇寺药师 奉德寺钟</p><p>灵妙寺丈六</p><p>四佛山 掘佛山 万佛山</p><p>生义寺石<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a> 兴轮寺壁画普贤</p><p>三所观音 <a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>寺 柏栗寺</p><p>敏藏寺 前后所将舍利</p><p>□□□□</p><p>弥勒仙花 未尸郎 真慈师</p><p>南白月二圣 努肹夫得 怛怛朴朴</p><p>芬皇寺千手大悲 盲儿得眼</p><p>洛山二大圣 观音 正趣 调信</p><p>鱼山佛影 台山五万真身</p><p>溟州五台山宝叱徒太子传记</p><p>台山月精寺五类圣众 南月山</p><p>□□□□□□□□</p><p>鍪藏寺弥陀殿 伯严寺石塔舍利</p><p>卷第四</p><p>义解第五</p><p>圆光西学 宝攘梨木</p><p>良志使锡 归竺诸师</p><p>二惠同尘 慈藏定律</p><p>元晓不羁 义湘传教</p><p>蛇福不言 真表传简</p><p>开东枫岳钵渊薮石记 胜诠髑髅</p><p>心地继祖 贤瑜珈 法华严</p><p>卷第五</p><p>神咒第六</p><p>密本摧邪 惠通降龙</p><p>明郎神印</p><p>感通第七</p><p>仙桃圣母<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>佛事 郁面婢<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>西升</p><p>广德 严庄 憬兴遇圣</p><p>真身受供 月明师兜率歌</p><p>善律还生 金现感虎</p><p>融天师彗星歌 真平王代</p><p>正秀歌救冰女</p><p>避隐第八</p><p>朗智乘云 普贤树 缘会逃名 文殊岾</p><p>惠现求静 信忠挂冠</p><p>包山二圣 永才遇贼</p><p>勿稽子 迎如师 布川山 五<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a> 景德王代 念佛师</p><p>孝善第九</p><p>真定师孝善双美 大城孝二世父母 神文王代 向得舍知割股供亲 景德王代 孙顺埋儿 兴德王代</p><p>贫女养母 跋</p><p>三国遗事目次(终)</p><p>三国遗事王历第一</p><p>前汉宣帝 五凤(甲子)四新罗第一赫居世 姓朴卵生年十三甲子即位理六十年俅娥伊英娥英国号徐罗伐又徐伐或斯罗或鸡林之讹至脱解王时始置鸡林之号</p><p><a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>(戊辰)四 黄龙(壬申)元帝初元(癸酉)五 永光(戊寅)五 建昭(癸未)六新 罗高 丽甲申筑金城第一东明王甲申立理十九年姓高名朱蒙一作邹蒙坛君之子</p><p>成帝建始(己丑)四 河平(癸巳)四 阳朔(丁酉)四 鸿嘉(辛丑)四永始(乙巳)四新 罗高 丽百 济第二琉璃王一作累利又□留东明子立壬寅理三十六年姓解氏第一温祚王东明第三子圭第二癸卯立在位四十五都慰礼城一云蛇川今稷山</p><p>元延(乙酉)四哀帝二哀帝建平(乙卯)四丙辰移都汉山今广州</p><p>元寿(己未)二平帝元始(辛酉)七第二南解次次雄父赫居世母阏英姓朴氏妃云帝夫人甲子立理二十年此王位亦云居西干</p><p>孺子初始(戊辰)二癸亥(移都国内城亦云不而城)</p><p>新室建国(己巳)五 天凤(甲戌)六第三大虎神王名无恤一作味留姓解氏琉璃王第三子戊寅立理二十六年</p><p>地凤(庚辰)三第三弩礼一作弩尼叱今父南解母云帝妃辞要王之女金氏甲申立理三十三年尼叱今或作尼师今</p><p>更始(癸未)二后汉虎帝 建虎(乙酉)三十一新 罗高 丽百 济驾洛国一作伽耶今金州第四闵中王名邑朱姓解氏大虎之子甲辰立理四年 第五慕本王闵中之兄名爱 一作忧戊申立理五年 第六国祖王名宫亦云大祖王癸丑立理九十三年后汉传云初生开目能视后逊位子母弟次大王第二多娄王温祚第二子戊子立理四十九年首露王壬寅三月卵生是月即位理一百五十八年因金卵而生故姓金氏开皇历载</p><p>中元(丙辰)二第四脱解一作吐解尼叱今 昔氏父琓夏国含达婆王一作花夏国王母积女国王之女妃南解王之女阿老夫人丁巳立理二十三年王崩水葬末□疏井丘中塑骨安东岳今东岳大王</p><p>明帝永年(戊午)十八 章帝建初(丙子)八第五婆娑尼叱今 姓朴氏父弩礼王母辞要王之女妃史肖夫人庚辰立理十二年第三己娄王 多娄子丁丑立理五十五年</p><p>元和(甲申)三 章和(丁亥)二和帝永元(己丑)十七殇帝 元兴(乙巳)安帝 延平(丙午) 永初(丁未)七第六只磨尼叱今 一作只味姓朴氏父婆娑母史肖夫人妃磨帝国王之女□礼夫人一作爱礼金氏壬子立理二十三年是王代灭音质国今安康及押梁国今□山</p><p>元初(甲寅)六 永宁(庚申) 建光(辛酉) 延光(壬戌)四顺帝 永建(丙寅)六第七逸圣尼叱今 父弩礼王之兄或云只磨王妃□礼夫人日知葛文王之父□□礼夫人只磨王之女母伊刊生夫人或云□□王夫人朴氏甲戌立理二十年第四盖娄王巳娄子戊辰立理三十八年</p><p>阳嘉(壬申)四 永和(丙子)六 汉安(壬午)二 建康(甲申)冲帝 永嘉(乙酉)帝本初(丙戌)第七次大王名遂国祖王母弟丙戌立理十九年</p><p>桓帝 建和(丁亥)三 和平(庚寅) 元嘉(辛卯)二 永兴(癸巳)二第八阿达罗尼叱今</p><p>永寿(乙未)三乙巳国祖王年百十九岁兄二王俱见弑于新王</p><p>延熹(戊戌)九又与倭国梖岭第八新大王名伯固一作伯句乙巳立理十四年第五肖古王一作素古盖娄子丙午立理五十年</p><p>永康(丁未)立岘个弥勒大院东岭是也</p><p>灵帝 建宁(戊申)四 熹平(壬子)六 光和(戊午)六第九故国川王 名男虎或云夷谟己未立理廿年国川亦曰国坏乃葬地名</p><p>中平(甲子)五第九伐休尼叱今</p><p>洪农又献帝 永汉(己巳) 初平(庚午)四 兴平(甲戌)二 建安(丙子)第十奈解尼叱今第十山上王第六仇首王一作贵须肖古之子甲午立理二十年第二居登王首露子母许皇后己卯立理五十五年姓金氏</p><p>曹魏文帝 黄初(庚子)七明帝 大和(丁未)六第十一助贲尼叱今第十一东川王</p><p>青龙(癸丑)四第七沙泮王一作沙□□□□仇首之子立即废</p><p>景初(丁巳)三齐王 正始(庚申)九第十二理解尼叱今 一作詀解王昔氏助贲王之同母弟也丁卯立理十五年始与高丽通聘第八古尔王肖故之母弟甲寅立理五十二年</p><p>嘉平(己巳)五第十二中川王</p><p>高贵乡公 正元(甲戌)二 甘露(丙子)四第三麻品王父居登王母泉府卿申辅之女言今贞夫人己卯立理三十二年</p><p>陈留王 景元(庚辰)四第十三未邹尼叱今 一作味昭又未祖又未召姓金氏始立父仇道葛文王母生乎一作述礼夫人伊非葛文王之女朴氏妃诸贲王之女光明娘壬午立理二十二年</p><p>西晋虎帝 泰始(乙酉)十第十三西川王 名药卢又若友庚寅立理二十年</p><p>咸宁(乙未)五 大康(庚子)十一第十四儒礼尼叱今一作世里智王昔氏父诸贲母□召夫人朴氏甲辰立治十五年补筑月城第九责稽王古尔子一作责替误丙午立治十二年</p><p>惠帝 元康(辛亥)九第十匹烽上王 雉葛王名相夫壬子立治八年</p><p>永宁(辛酉)第十五基临尼叱今 一作基立王昔氏诸贲王之第二子也母阿尔夫人戊午立治二十年第十汾西 王责稽子戊午立治六年第四居叱弥王 一作今勿父麻品母好仇辛亥立治五十五年</p><p>大安(壬戌)二第十五美川王 一云妙禳名乙弗又瀀弗庚申立理三十一年</p><p>永兴(甲子)二第十一比流王 仇者第二子 沙泮之弟也甲子立治四十年</p><p>光熙(丙寅)丁卯年是国号曰新罗新者德业日新罗者网罗四方之民云或系智证法兴之世</p><p>怀帝 永嘉(丁卯)六第十六乞解尼叱今 昔氏父于老音角干即察解王第二子也庚午立治十六年是王代百济兵始来侵</p><p>愍帝 建兴(癸酉)四东晋中宗建虎(丁丑) 大兴(戊寅)四明帝 永昌(壬午) 大宁(癸未)三显宗 咸和(丙戌)九己丑始筑碧骨堤周□万七千二十六步□□百六十六步水田一万四千七十第十六国原王 名钊又斯由或云冈上 □辛卯立理四十年甲午增筑平壤城壬寅八月移都安市城即丸都城</p><p>咸康(乙未)八康帝 建元(癸卯)二第十二契王汾西元子甲辰立理二年</p><p>孝宗 永和(乙巳)十二第十七奈勿麻立干一作□王金氏父仇道葛文王一作未召王之弟未仇角干母休礼夫人金氏丙辰立理四十六年陵在占星台西南第十三近肖古王 比流第二子丙午立理二十九年第五伊品王父居叱弥母阿志丙午立理六十年</p><p>升平(丁巳)五哀帝 隆和(壬戌) 兴宁(癸亥)三废帝 大和(丙寅)五简文帝 咸安(辛未)二第十七小兽林王 名丘夫辛未立理十三年辛未移都北浦山</p><p>烈宗 宁康(癸酉)三第十四近仇首王 近肖古之子也乙亥立理九年</p><p>大元(丙子)二十一第十八国壤王 名伊速又于只支甲申立治八年第十五枕流王 近仇首子甲申立理二年</p><p>安帝 隆安(丁酉)五第十九广开王 名谈德壬辰立治二十一年第十六辰斯王 枕流王弟乙酉立治七年第十七阿莘王 一作河芳辰斯子壬辰立治十三年</p><p>元兴(壬寅)三第十八实圣麻立干一作实主王又宝金王父未邹王弟大西知角干母礼生夫人昔氏登也阿干□也妃阿留夫人壬寅立治十五王即鸱述之父第十八腆支王 一作真支王名映阿莘子乙巳立治十五年</p><p>义熙(乙巳)十四第十九讷只麻立干 一作内只王金氏父奈勿王母内礼希夫人金氏未邹王女丁巳立治四十一年第二十长寿王 名臣连癸丑立治七十九年第六坐知王一云金吐王父伊品母贞信丁未立治十四年</p><p>恭帝 元熙(己未)宋武帝 永初(庚申)三第十九久尔辛王 腆支子庚申立治七年第七吹希王一云金喜父坐知王母福辛酉立治三十年</p><p>小帝 景平(癸亥)文帝 元嘉(甲子)二十九丁卯移都平壤城</p><p>世祖 大初(癸巳)第二十毗有王 久尔辛子丁卯立治二十八年第八铚知王 一云金铚□□希母仁德辛卯立治三十六年</p><p>孝建(甲午)三 大明(丁酉)八第二十慈悲麻立干 金氏父讷只母阿老夫人一作次老夫人实圣王之女戊戌立治二十一年妃巴胡葛文王女一作□叱希角干一作□□角干女第二十一盖卤王 一云近盖卤王名庆司乙未立治二十年</p><p>大宗 泰始(乙巳)八后废帝 元徽(癸丑)四始与吴国通己未年倭国兵来侵始筑明活城入避来围梁州城不克而还</p><p>顺帝 升明(丁巳)二第二十二文周王 一作文明盖卤子乙卯立移都熊川理二年 第二十三三斤王 一作三乞王文周子丁巳立理二年</p><p>齐太祖 建元(己未)四第二十一毗处麻立干一作知王金氏慈悲王第三子母未欣角干之女己未立理二十一年妃期宝葛文王之女第二十四东城王 名牟大一云麻帝又余大三斤王之堂弟己未立理二十六年</p><p>武帝永明(癸亥)十一废帝第二十一文咨明王 名明理好又个云又高云壬申立理二十七年第九钳知王父铚知王母邦媛壬申立理二十九年</p><p>高宗 建虎(甲戌)四 永泰(戊寅) 永元(己卯)二第二十二智订麻立干一作智哲名又智度路王金氏父讷只王弟期宝葛文王母乌生夫人讷只王之女妃迎帝夫人俭揽代汉只登许作角干之女庚辰立理十四年</p><p>和帝 中兴(辛巳)已上为上古已下为中古第二十五虎宁王 名斯摩即东城第二子辛巳立理二十二年<a href=\"/ctwh/shi/24s/nanshi.html\" class=\"keylink\" target=\"_blank\">南史</a>云名扶余隆误矣隆乃宝藏王之太 子详见唐史</p><p>梁高祖 天监(壬午)十八第二十三法兴王 名原宗金氏册府元龟云姓募名秦父智订母迎帝夫人法兴谥谥始乎此甲午立理二十六年陵在哀公寺北妃巴丑夫人<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>名法流住永兴寺始行律令始行十行日禁杀度为僧尼第二十二安藏王 名兴安己亥立理十二年第二十六圣王 名明秾虎宁子癸巳立理三十一年</p><p>普通(庚子)七第十仇冲王钳知子母□女辛丑立理十二年中大通四年壬子纳土投罗自首露王国除壬寅至壬子合四百九十年国除</p><p>大通(丁未)二罗丽济第二十三安原王 名宝迎辛亥立理十四年</p><p>中大通(己酉)六建元(丙辰)是年始置年号始此</p><p>大同(乙卯)十一第二十四真兴王名彡麦宗一作深金氏父即法兴之弟立宋葛文王母只召夫人一作息道夫人朴氏妃忠刁夫人英失角干之女剃发为尼庚申立理三十六年第二十四阳原王 一云阳岗王名平成乙丑立理十四年戊午移都泗泚称南扶余</p><p>中大同(丙寅) 大清(丁卯)三简文帝 大宝(庚午)侯景 大始(辛未)开国(辛未)十七</p><p>承圣(壬申)三敬帝 绍泰(乙亥)第二十七威德王 名高又明甲戌立理四十四年</p><p>大平(丙子)陈高祖 永定(丁丑)三文帝 天嘉(庚辰)六第二十五平原王 一作平冈名阳城动之云高□己卯立理三十一年</p><p>天康(丙戌) 光大(丁亥)二大昌(戊子)四</p><p>宣帝 大建(己丑)十四鸿济(壬辰)十二 第二十五真智王 名金轮一作舍轮金氏父真兴母未氏尼干之女一作色刁夫人朴氏妃如刁夫人起乌公之女朴氏立治四年治衰善北 第二十六真平王 名白净□□东语父太子母立宗葛文王之女万呼一云万宁夫人名行□尼妃摩耶夫人金氏名福肹□后妃僧满夫人孙氏己亥立</p><p>至德(癸卯)四建福(甲辰)</p><p>祯明(丁未)三隋文帝 开皇(庚戌)十一第二十六婴阳王一云平阳名元一云大元庚戌立治三十八年第二十八惠王 名季一云献王威德子戊午立</p><p>仁寿(辛酉)四炀帝 大业(乙丑)十二第二十九法王名<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>又宣惠王子己未立</p><p>恭帝 义宁(丁丑)第三十武王 或云武康献丙或小名一耆筛德庚申立治四十一年</p><p>唐太祖 武德(戊寅)九第二十七荣留王名又建成戊寅立治二十四年</p><p>太宗 贞观(丁亥)廿三第二十七善德女王 名德曼父真平王母麻耶美人金氏圣骨男尽故女王立王之匹饮葛文王壬辰立治十六年 仁平(甲午)立治十四第二十八宝藏王 壬寅立治二十七年第三十一义慈王 武王子辛丑立治二十年</p><p>高宗 永徽(庚戌)六第二十八真德 王 名胜曼金氏父真平王之弟国其安葛文王母阿尼夫人朴氏奴追□□□葛文王之女也或云月明非也丁未立治七年 大和(戊申)六(已上中古圣骨已上下古真骨)第二十九太宗武烈王 名春秋金氏真智王子龙春卓文兴葛文王之子也龙春一作龙树母天明夫人谥文贞太后真平王之女也妃训帝夫人谥文明王后庾立之妹小名文熙也甲寅立治七年</p><p>现庆(丙辰)五庚申国除自温祚癸卯至庚申六百七十八年</p><p>龙朔(辛酉)三 麟德(甲子)二罗丽第三十文武王 名法敏太宗之子也母训帝夫人妃慈义一作讷王后善品海于之女辛酉立治二十年陵在<a href=\"/remen/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>幸东海中</p><p>干封(丙寅)二 总章(戊辰)二戊辰国除 自东明甲申至戊辰合七百五年</p><p>咸亨(庚午)四 上元(甲戌)二 仪凤(丙子)三 调露(己卯) 永隆(庚辰) 开耀(辛巳)罗第三十一神文王金氏名政明字日昭父文虎王母慈讷王后妃神穆王后金运公之女辛巳立理十一年</p><p>永淳(壬午)虎后 洪道(癸未) 文明(甲申) 垂拱(乙酉)四 永昌(己丑)周 天授(庚寅)二 长寿(壬辰)二第三十二孝昭王 名理恭一作洪金氏父神文王母神穆王后壬辰立理 十年陵在望德寺东</p><p>延载(甲午) 天册(乙未) 通天(丙申)神功(丁酉) 圣历(戊戌)二 久视(庚子) 长安(辛丑)四第三十三圣德王 名兴光本名隆基孝昭之母弟也先妃陪昭王后谥严贞元 大阿干之女也后妃占勿王后谥昭德顺元角干之女壬寅 立理三十五年陵在东村南一云杨长谷</p><p>中宗 神龙(乙巳)二 景龙(丁未)三睿宗 景云(庚戌)二玄宗 先天(壬子) 开元(癸丑)廿九第三十四孝成王 金氏名承庆父圣德王母昭德大后妃惠明王后真宗角干 之女丁丑立理五年法流寺火葬骨散东海</p><p>天宝(壬午)十四第三十五景德王 金氏名宪英父圣德母昭德大后先妃三毛夫人出宫无 后后妃满月夫人谥景垂王后垂一作穆依忠角干之女壬 午立理二十三年初葬顷只寺西岑炼石为陵后移葬杨长 谷中</p><p>肃宗 至德(丙申)二 乾元(戊戌)二 上元(庚子)二 宝应(壬寅)代宗 广德(癸卯)二 永泰(乙巳)第三十六惠恭王 金氏名干运父景德母满月王后先妃神巴夫人魏正角 干之女妃昌昌夫人金将角干之女乙巳立理十五年</p><p>大历(丙午)十<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>宗 建中(庚申)四第三十七宣德王 金氏名亮相父孝方海干追封开圣大王即元训角干之子 母四召夫人谥贞懿大后圣德王之女妃具足王后狼品角 干之女庚申立理五年</p><p>兴元(甲子) 贞元(乙丑)二十第三十八元圣王 金氏名敬慎一作敬信唐书云敬则父孝让大阿干追封明 德大王母仁□□一云知鸟夫人谥昭文王后昌近伊 已之女妃淑贞夫人神述角干之女乙丑立理十四年陵在 鹄寺今崇福寺有也或远所立碑</p><p>顺宗 永贞(乙酉)第三十九昭圣王 一作昭成王金氏名俊邕父惠忠大子母圣穆大后妃桂花 王后夙明公女己卯立而崩第四十哀庄王 金氏名重熙一云清明父昭圣母桂花王后辛卯立理 十年元和四年己丑七月十九日王之叔父宪德兴德两 伊干所害而崩</p><p>宪宗 元和(丙戌)十五第四十一宪德王 金氏名彦升昭圣之母弟妃贵胜娘谥皇娥王后忠恭 角干之女己丑立理十九年陵在泉林村北</p><p>穆宗 长庆(辛丑)四敬宗 宝历(乙巳)二第四十二兴德王 金氏名景晖宪德母弟妃昌花夫人谥定穆王后昭圣 之女丙午立理十年陵在安康北比火壤与妃昌花合葬</p><p>文宗 大和(丁未)九 开成(丙辰)五第四十三僖康王 金氏名恺隆一作悌颙父宪贞角干谥兴圣大王一作□ 成礼英匝于子也母美道夫人一作深乃夫人一云巴利夫 人谥顺成大后忠行大阿干之女也妃文穆王后忠孝角干 之女一云重恭角干丙辰年立理二年第四十四闵(一作敏)哀王 金氏名明父忠恭角干追封宣康大王母追封惠忠王之女 贵巴夫人谥宣懿王后妃无容皇后永公角干之女戊午 立至己未正月二十二日崩第四十五神虎王 金氏名佑征父均贞角干追封成德大王母贞□夫人追 封祖礼英惠康大王妃贞从一作继大后明海□□ 之女己未四月立至十一月一十三日崩第四十六文圣王 金氏名庆膺父神虎王母贞从大后妃昭明王后己未十 一月立理十九年</p><p>虎宗 会昌(辛酉)六</p><p>宣宗 大中(丁卯)十三第四十七宪安王 金氏名谊靖神虎王之弟母昕明夫人戊寅立理三年</p><p>懿宗 咸通(庚辰)十四第四十八景文王 金氏名膺廉父启明角干追封义(一作懿)恭大王即僖康王之 子也母神虎王之女光和夫人妃文资皇后宪安王之女辛 巳立理十四年</p><p>僖宗 乾符(甲午)六第四十九宪康王 金氏名晸父景文王母文资皇后一云义明王后乙未立 理十一年</p><p>广明(庚子) 中和(辛丑)四第五十定康王 金氏名晃闵哀王之母弟丙午立而崩</p><p>光启(乙巳)三第五十一真圣女王 金氏名曼宪即定康王之同母妹也王之匹魏弘大角干追 封惠成大王丁未立理十年丁巳逊位于小子孝恭王十 二月崩火葬散骨于牟梁西卉一作未黄山</p><p>昭宗 文德(戊申) 龙纪(己酉) 大顺(庚戌)二罗后 高 丽后 百 济弓裔 大顺庚戌始投北原贼良吉屯丙辰都铁圆城(今东州也)丁巳移都松岳郡</p><p>景福(壬子)二甄萱 壬子始都光州</p><p>乾宁(甲寅)四第五十二孝恭王 金氏名峣父宪康王母文资王后丁巳立理十五年火葬师子寺北骨藏于仇知堤东山胁</p><p>光化(戊午)三 天复(辛酉)三辛酉称高丽</p><p>景宗 天祐(甲子)三甲子改国号摩震置元虎泰</p><p>朱梁 开平(丁卯)四第五十三神德王 朴氏名景徽本名秀宗母贞花夫人夫人之父顺弘角干追谥成虎大王祖元邻角干乃阿达王之远孙父文元伊干追封兴廉大王祖文官海干义父锐谦角干追封宣成大王妃资成王后一云懿成又孝资壬申立理五年火葬藏骨于箴岘南</p><p>乾化(辛未)四末帝 贞明(乙亥)六第五十四景明王 朴氏名升英父神德母资成妃长砂他大尊角干追封圣僖大王之子大尊即水宗伊干之子丁丑立理七年火葬皇福寺散骨于省等仍山西甲戌还铁原 太祖 戊寅六月裔死太祖即位于铁原京己卯移都松岳郡是年创法王慈云王轮内帝释舍那又创天禅院(即普膺)新兴文殊通地藏□□□□前十大寺皆是年所创庚辰乳岩下立油市故今俗利市云乳下十月创大兴寺或系壬午壬午又创日月寺或系辛巳甲申创外帝释神众院兴国寺丁亥创妙寺己丑创龟山庚寅安</p><p>龙德(辛巳)二后唐 同光(癸未)三第五十五景哀王 朴氏名魏膺景明之母弟也母资成甲申立理三年</p><p>明宗 天成(丙戌)四第五十六敬顺王 金氏傅父孝宗伊干追封神兴大王祖官□角汗封懿兴大王母桂娥康王之乙未纳土归于陵在□□东向洞</p><p>长兴(庚寅)四闵帝末帝 清泰(甲午)二自五凤甲子至乙未合九百九十二年</p><p>石晋 天福(丙申)八丙申统三韩乙未萱子神釰篡父自立是年国除自壬子至此四十四年而亡</p><p>前汉高惠小文景虎昭宣元成哀平孺</p><p>后汉光明章和殇安顺冲质桓灵农献</p><p>魏晋宋齐梁陈隋</p><p>李唐大高则中睿玄肃代德顺宪穆敬文虎宣懿僖昭景</p><p>朱梁后唐石晋刘汉郭周</p><p>大宋</p><p>纪异卷第一</p><p>叙曰。大抵古之<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。方其礼乐兴邦。仁义设教。则怪力乱神。在所不语。然而帝王之将兴也。膺符命。受图箓。必有以异于人者。然后能乘大变。握大器。成大业也。故河出图。洛出书。而圣人作。以至虹绕神母而诞羲。龙感女登而注炎。皇娥游穷桑之野。有神童自称白帝子。交通而生小昊。简犾吞卵而生契。姜嫄履迹而生弃。胎孕十四月而生尧。龙交大泽而生沛公。自此而降。岂可殚记。然则三国之始祖。皆发乎神异。何足怪哉。此纪异之所以[仁-二+斩]诸篇也。意在斯焉</p><p>古朝鲜(王俭朝鲜)</p><p>魏书云。乃往二千载有坛君王俭。立都阿斯达(经云无叶山。亦云白岳。在白州地。或云在开城东。今白岳宫是)开国号朝鲜。与高同时。古记云。昔有桓因(谓帝释也)庶子桓雄。数意天下。贪求人世。父知子意。下视三危太伯可以弘益人间。乃授天符印三个。遣往理之。雄率徒三千。降于太伯山顶(即太伯今妙香山)神坛树下。谓之神市。是谓桓雄天王也。将风伯雨师云师。而主谷主命主病主刑主<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。凡主人间三百六十余事。在世理化。时有一熊一虎。同穴而居。常祈于神雄。愿化为人。时神遗灵艾一炷。蒜二十枚曰。尔辈食之。不见日光百日。便得人形。熊虎得而食之。忌三七日。熊得女身。虎不能忌。而不得人身。熊女者无与为婚。故每于坛树下咒愿有孕。雄乃假化而婚之。孕生子。号曰坛君王俭。以唐高即位五十年庚寅(唐尧即位元年戊辰。则五十年丁巳。非庚寅也。疑其未实)都平壤城(今西京)始称朝鲜。又移都于白岳山阿斯达。又名弓(一作方)忽山。又今弥达。御国一千五百年。周虎王即位己卯封箕子于朝鲜。坛君乃移于藏唐京。后还隐于阿斯达为山神。寿一千九百八岁。唐裴矩传云。高丽本孤竹国(今海州)。周以封箕子为朝鲜。汉分置三郡。谓玄菟乐浪带方(北带方)。通典亦同此说(<a href=\"/ctwh/shi/24s/hanshu.html\" class=\"keylink\" target=\"_blank\">汉书</a>则真临乐玄四郡。今云三郡。名又不同何耶。)</p><p>魏满朝鲜</p><p>前汉朝鲜传云。自始燕时常略得真番朝鲜(师古曰战国时□国始略得此地也)。为置吏筑障。秦灭燕。属辽东外徼。汉兴。为远难守。复修辽东故塞。至浿水为界(师古曰。浿在乐浪郡)。属燕。燕王卢绾反入凶奴。燕人卫满亡命。聚党千余人。东走出塞。渡浿水。居秦故空地上下障。稍役属真番朝鲜蛮夷。及故燕齐亡命者王之。都王俭(李曰。地名。臣赞曰。王俭城在乐浪郡浿水之东)。以兵威侵降其旁小邑。真番临屯皆来服属。方数千里。传子至孙右渠(师古曰。孙名右渠)。真番辰国欲上书见天子。雍阏不通(师古曰。辰谓辰韩也)。元封二年。汉使涉何谕右渠。终不肯奉诏。何去至界。临浿水。使驭刺杀送何者朝鲜裨王长(师古曰。送何者名也)即渡水。驭入塞。遂归报。天子拜何为辽东之部都尉。朝鲜怨何。袭攻杀何。天子遣楼。舡将军杨仆。从齐浮渤海。兵五万。左将军荀彘出辽讨右渠。右渠发兵距崄。楼舡将军将齐七千人先到王俭。右渠城守。规知楼舡军小。即出击楼舡。楼舡败走。仆失众遁山中获免。左将军击朝鲜浿水西军。未能破。天子为两将未有利。乃使卫山因兵威往谕右渠。右渠请降。遣太子献马。人众万余持兵。方渡浿水。使者及左将军疑其为变。谓太子已服。宜毋持兵。太子亦疑使者诈之。遂不渡浿水。复引归。报天子诛山。左将军破浿水上军。乃前至城下。围其西北。楼舡亦往会居城南。右渠坚守。数月未能下。天子以久不能决。使故济南太守公孙遂往正之。有便宜将以从事。遂至。缚楼舡将军并其军。与左将军急击朝鲜。朝鲜相路人。相韩陶。尼溪相参。将军王唊(师古曰。尼溪地名。四人也)相与谋欲降。王不肯之。陶唊路人皆亡降汉。路人道死。元封三年夏。尼溪相参使人杀王右渠来降。王俭城未下。故右渠之大臣成已又反。左将军使右渠子长。路人子最。告谕其民。谋杀成已。故遂定朝鲜。为真番 临屯 乐浪 玄菟四郡</p><p>马韩</p><p>魏志云。魏满击朝鲜。朝鲜王准率宫人左右。越海而南至韩地。开国号马韩。甄萱上大祖书云。昔马韩先起。赫世勃兴。于是百济开国于金马山。崔致远云。马韩。丽也。辰韩。罗也(据本纪。则罗先起甲子。丽后起甲申。而此云者。以王准言之耳。以此知东明之起。已并马韩而因之矣。故称丽为马韩。今人或认金马山。以马韩为百济者。盖误滥也。丽地自有邑山。故名马韩也)四夷 九夷 九韩 秽貊<a href=\"/ctwh/jing/13j/zhouli.html\" class=\"keylink\" target=\"_blank\">周礼</a>职方氏掌四夷九貊者。东夷之种。即九夷也。三国史云。溟州。古秽国。野人耕田得秽王印献之 又春州古牛首州。古貊国。又或云。今朔州是貊国。或平壤城为貊国。淮南子注云。东方之夷九种 <a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>正义云。九夷者 一玄菟 二乐浪 三高丽 四满饰 五凫臾 六素家 七东屠 八倭人 九天鄙 海东安弘记云九韩者 一日本 二中华 三吴越 四[尤-尢+乇]罗 五鹰游 六靺鞨 七丹国 八女真 九秽貊</p><p>二府</p><p>前汉书。昭帝始元五年己亥。置二外府。谓朝鲜旧地平那及玄菟郡等为平州都督府。临屯乐浪等两郡之地置东部都尉府(私曰朝鲜传则真番玄菟临屯乐浪等四。今有平[郡-口]无真番。盖一地二名也)</p><p>七十二国</p><p>通典云。朝鲜之遗民分为七十余国。皆地方百里。<a href=\"/ctwh/shi/24s/houhanshu.html\" class=\"keylink\" target=\"_blank\">后汉书</a>云。西汉以朝鲜旧地初置为四郡。后置二府。法令渐烦。分为七十八国。各万户(马韩在西。有五十四小邑。皆称国。辰韩在东。有十二小邑称国。卞韩在南。有十二小邑。各称国)</p><p>乐浪国</p><p>前汉时始置乐浪郡。应邵曰。故朝鲜国也 <a href=\"/ctwh/shi/24s/xintangshu.html\" class=\"keylink\" target=\"_blank\">新唐书</a>注云。平壤城。古汉之乐浪郡也 国史云。赫居世三十年。乐浪人来投 又第三弩礼王四年。高丽第三无恤王伐乐浪灭之。其国人与带方(北带方)投于罗。又无恤王二十七年。光虎帝遣使伐乐浪。取其地为郡县。萨水已南属汉(据上诸文。乐浪即平坏城。宜矣。或云乐浪中头山下靺鞨之界。萨水今大同江也。未详孰是)又百济温祚之言曰。东有乐浪。北有靺鞨。则殆古汉时乐浪郡之属县之地也。新罗人亦以称乐浪。故今本朝亦因之而称乐浪郡夫人。又太祖降女于金传。亦曰乐浪公主</p><p>北带方</p><p>北带方。本竹覃城。新罗弩礼王四年。带方人与乐浪人投于罗(此皆前漠所置二郡名。其后僭称国。今来降)</p><p>南带方</p><p>曹魏时始置南带方郡(今南原府)故云。带方之南海水千里曰瀚海(后汉建安中以马韩南荒地为带方郡。倭韩遂属。是也)</p><p>靺鞨(一作勿吉)渤海</p><p>通典云。渤海。本栗未靺鞨。至其酋柞荣立国。自号震旦。先天中(玄宗王子)始去靺鞨号。专称渤海开元七年(己未)柞荣死。谥为高王。世子袭立。明皇赐典册袭王。私改年号。遂为海东盛国。地有五京。十五府。六十二州。后唐天成初。契丹攻破之。其后为丹所制(三国史云。仪凤三年。高宗戊寅。高丽残孽类聚。北依太伯山下。国号渤海。开元二十年间。明皇遣将讨之。又圣德王三十二年。玄宗甲戌。渤海靺鞨越海侵唐之登州。玄宗讨之。又新罗古记云。高丽旧将柞荣。姓大氏。聚残兵。立国于大伯山南。国号渤海。按上诸文。渤海乃靺鞨之别种。但开合不同而已。按指掌图。渤海在长城东北角外) 贾耽郡国志云。渤海国之鸭渌南海扶余橻城四府。并是高丽旧地也。自新罗泉井郡(地理志。朔州领县有泉井郡。今涌州)至橻城府三十九驿 又三国史云。百济末年。渤海靺鞨新罗分百济地(据此。则鞨海又分为二国也)罗人云。北有靺鞨。南有倭人。西有百济。是国之害也 又靺鞨地接阿。瑟罗州 又东明记云。卒本城地连靺鞨(或云今东真)罗第六只麻王十四年(乙丑)靺鞨兵大入北境。袭大岭栅过泥河 后魏书靺鞨作勿吉 指掌图云。挹屡与勿吉皆肃慎也 黑水 沃沮 按东坡指掌图。辰韩之北有南北黑水 按东明帝立十年灭 北沃沮。温柞王四十二年南沃沮二十余家来投。新罗又赫居世五十二年东沃沮来献良马。则又有东沃沮矣。指掌图。黑水在长城北 沃沮在长城南</p><p>伊西国</p><p>弩礼王十四年。伊西国人来攻金城 按云门寺古传诸寺纳田记云。贞观六年壬辰伊西郡今郡村零味寺纳田。则今郡村今清道地。即清道郡古伊西郡一</p><p>五伽耶(按驾洛记赞云。垂一紫缨。下六圆卵。五归各邑。一在兹城则一为首露王。余五各为五伽耶之主。金官不入五数当矣。而本朝史略。并数金官而滥记昌宁误)</p><p>阿罗(一作耶)伽耶(今咸安)古宁伽耶(今咸宁)大伽耶(今高灵)星山伽耶(今京山玄)碧珍小伽耶(今固城)又本朝史略云。太祖天福五年庚子改五伽耶名。一金官(为金海府)二古宁(为加利县)三非大(今昌宁恐高灵之讹)余二阿罗星山(同前星山或作碧珍伽耶)</p><p>北扶余</p><p>古记云。前汉书宣帝神爵三年壬戌四月八日。天帝降于讫升骨城(在大辽医州界)乘五龙车。立都称王。国号北扶余。自称名解慕漱。生子名扶娄。以解为氏焉。王后因上帝之命。移都于东扶余。东明帝继北扶余而兴。立都于卒本州。为卒本扶余。即高句丽之始祖</p><p>东扶余</p><p>北扶余王解夫娄之相阿兰弗。梦天帝降而谓曰。将使吾子孙立国于此。汝其避之(谓东明将兴之兆也)东海之滨。有地名迦叶原土壤膏腴。宜立王都。阿兰弗劝王移都于彼。国号东扶余。夫娄老无子。一日祭山川求嗣。所乘马至鲲渊。见大石相对侠流。王怪之。使人转其石。有小儿金色蛙形。王喜曰。此乃天赉我令胤乎。乃收而养之。名曰金蛙。及其长为太子。夫娄薨。金蛙嗣位为王。次传位于太子带素。至地皇三年壬午。高丽王无恤伐之。杀王带素。国除</p><p>高句丽</p><p>高句丽即卒本扶余也。或云今和州又成州等皆误矣。卒本州在辽东界。国史高丽本记云。始祖东明圣帝姓言氏讳朱蒙。先是北扶余王解夫娄。既避地于东扶余。及夫娄薨。金蛙嗣位。于时得一女子于太伯山南优渤水。问之。云我是河柏之女。名柳花。与诸弟出游。时有一男子。自言天帝子解慕漱。诱我于熊神山下鸭绿边室中知之而往不返(坛君记云。君与西河河伯之女要亲。有产子名曰夫娄。今按此记。则解慕漱私河伯之女而后产朱蒙。坛君记云产子名曰夫娄。夫娄与朱蒙异母兄弟也) 父母责我无媒而从人。遂谪居于此。金蛙异之。幽闭于室中。为日光所照。引身避之。日影又逐而照之。因而有孕。生一卵。大五升许。王弃之与犬猪。皆不食。又弃之路。牛马避之弃之野。鸟兽覆之。王欲剖之而不能破。乃还其母。母以物裹之。置于暖处。有一儿破壳而出。骨表英奇。年甫七岁。[山/(敲-高+止)]嶷异常。自作弓矢。百发百中。国俗谓善射为朱蒙。故以名焉。金蛙有七子。常与朱蒙游戏。技能莫及。长子带素言于王曰。朱蒙非人所生。若不早图。恐有后患。王不听。使之养马。朱蒙知其骏者。减食令瘦。驽者善养令肥。王自乘肥。瘦者给蒙王之诸子与诸臣将谋害之蒙母知之。告曰。国人将害汝。以汝才略。何往不可。宜速图之。于是蒙与乌伊等三人为友。行至淹水(今未详)。告水曰。我是天帝子河伯孙。今日逃遁。追者垂及。奈何。于是鱼鳖成桥。得渡而桥解。追骑不得渡。至卒本州(玄葂郡之界)遂都焉。未遑作宫室。但结庐于沸流水上居之。国号高句丽。因以高为氏(本姓解也。今自言是天帝子。承日光而生。故自以高为氏)时年十二岁。汉孝元帝建昭二年甲申岁。即位称王 高丽全盛之日。二十一万五百八户。珠琳传第二十一卷载。昔宁禀离王侍婢有娠。相者占之曰。贵而当王。王曰。非我之胤也。当杀之。婢曰气从天来。故我有娠。及子之产。谓为不祥。捐圈则猪嘘。弃栏则马乳。而得不死。卒为扶余之王(即东明帝为卒本扶余王之谓也。此卒本扶余。亦是北扶余。之别都。故云扶余王也。宁禀离乃夫娄王之异称也)</p><p>卞韩百济(亦云。南扶余。即泗泚城也)</p><p>新罗始祖赫居世即位十九年壬午。卞韩人以国来降。新<a href=\"/ctwh/shi/24s/jiutangshu.html\" class=\"keylink\" target=\"_blank\">旧唐书</a>云。卞韩苗裔在乐浪之地 后汉书云。卞韩在南。马韩在西。辰韩在东 致远云。卞韩。百济也 按本记。温祚之起。在鸿嘉四年甲辰。则后于赫世东明之世。四十余年。而唐书云。卞韩苗裔在乐浪之地云者。谓温祚之系出自东明故云耳。或有人出乐浪之地。立国于卞韩。与马韩等并峙者。在温祚之前尔。非所都在乐浪之北也。或者滥九龙山亦名卞那山。故以高句丽为卞韩者盖谬。当以古贤之说为是。百济地自有卞山。故云卞韩。百济全盛之时。十五万二千三百户</p><p>辰韩(亦作秦韩)</p><p>后汉书云。辰韩耆老自言。秦之亡人来适韩国。而马韩割东界地以与之。相呼为徒。有似秦语。故或名之为秦韩。有十二小国。各万户。称国。又崔致远云。辰韩本燕人避之者。故取涿水之名。称所居之邑里。云沙涿。渐涿等(罗人方言。读[泳-永+豕]音为道。故今或作沙梁。梁亦读道)新罗全盛之时。京中十七万八千九百三十六户 一千三百六十坊 五十五里 三十五金入宅(言富润大宅也) 南宅 北宅 [百-日+ㄎ]比所宅 本彼宅 梁宅 池上宅(本彼部) 财买井宅(庾信公祖宗) 北维宅 南维宅(反香寺下坊) 队宅 宾支宅(反香寺犯) 长沙宅 上樱宅 下樱宅 水望宅 泉宅 杨上宅(梁南) 汉岐宅(法流寺南) 鼻穴宅(上同) 板积宅(芬皇寺上坊) 别教宅(川北) 衙南宅 金杨宗宅(梁官寺南) 曲水宅(川北) 柳也宅 寺下宅 沙梁宅 井上宅 里南宅([百-日+ㄎ]所宅) 思内曲宅 池宅 寺上宅(大宿宅)林上宅(青龙之寺东方有池) 桥南宅 巷叱宅(本彼部) 楼上宅 里上宅 椧南宅 井下宅</p><p>又四节游宅</p><p>春。东野宅 夏。谷良宅 秋。仇知宅 冬。加伊宅 第四十九宪康大王代。城中无一草屋。接角连墙。歌吹满路。昼夜不绝</p><p>新罗始祖赫居世王</p><p>辰韩之地。古有六村。一曰阏川杨山村。南今昙严寺。长曰谒平。初降于瓢岩峰。是为及梁部李氏祖(奴礼王九年置。名及梁部本朝太祖天福五年庚子。改名中兴部。波替东山彼上东村属焉)。二曰突山高墟村。长曰苏伐都利。初降于兄山。是为沙梁部(梁读云道。或作涿。亦音道)郑氏祖。今曰南山部。仇良伐麻等乌道北回德等南村属焉(称今曰者。大祖所置也。下例知)。三曰茂山大树村。长曰俱(一作仇)礼马。初降于伊山(一作皆比山)是为渐梁(一作涿)部。又牟梁部孙氏之祖今云长福部。朴谷村等西村属焉。四曰觜山珍支村(一作宾之又宾子又氺之)长曰智伯虎。初降于花山。是为本彼部崔氏祖。今曰通仙部。柴巴等东南村属焉。致远乃本彼部人也。今皇龙寺南味吞寺南有古墟。云是崔侯古宅也。殆明矣。五曰金山加利村(今金刚山柏栗寺之北山也)长曰只沱(一作只他)初降于明活山。是为汉岐部。又作韩岐部斐氏祖。今云加德部。上下西知乃貌等东村属焉。六曰明佸山高耶村。长曰虎珍。初降于金刚山。是为习比部薛氏祖。今临川部。勿伊村仍仇[方*尔]村阙谷(一作葛谷)等东北村属焉。按上文此六部之祖。似皆从天而降。弩礼王九年始改六部名。又赐六姓。令俗中兴部为母。长福部为父。临川部为子。加德部为女。其实未详。前汉地节元年壬子(古本云建虎元年。又云建元三年等。皆误)三月朔。六部祖各率子弟。俱会于阏川岸上。议曰。我辈上无君主临理蒸民。民皆放逸。自从所欲。盖觅有德人。为之君主。立邦设都乎。于是乘高南望。杨山下萝井傍。异气如电光垂地。有一白马跪拜之状。寻捡之。有一紫卵(一云青大卵)马见人长嘶上天。剖其卵得童男。形仪端美。惊异之。俗于东泉(东泉寺在词脑野北)身生光彩。鸟兽率舞。天地振动。日月清明。因名赫居世王(盖乡言也。或作弗矩内王言光明理世也。说者云。是西述圣母之所诞也。故中华人赞仚桃圣母。有娠贤肇邦之语是也。乃至鸡龙现瑞产阏英。又焉知非西述圣母之所现耶)位号曰居瑟邯(或作居西干。初开□之时。自称云。阏智居西干一起。因其言称之。自后为王者之尊称)时人争贺曰。今天子已降。宜觅有德女君配之。是日沙梁里阏英井(一作娥利英井)边有鸡龙现。而左胁诞生童女(一云龙现死。而剖其腹得之)姿容殊丽。然而唇似鸡觜。将浴于月城北川。其觜拨落。因名其川曰拨川。营宫室于南山西麓(今昌林寺)奉养二圣儿。男以卵生卵如瓠。乡人以瓠为朴。故因姓朴。女以所出井名。名之二圣。年至十三岁。以五凤元年甲子。男立为王。仍以女为后。国号徐罗伐。又徐伐(今俗训京字云徐伐。以此故也)或云斯罗。又斯卢。初王生于鸡井。故或云鸡林国。以其鸡龙现瑞也。一说。脱解王时得金阏智。而鸡鸣于林中。乃改国号为鸡林。后世遂定新罗之号。理国六十一年。王升于天七日。后遗体散落于地。后亦云亡。国人欲合而葬之。有大蛇逐禁。各葬五体为五陵。亦名蛇陵。昙严寺北陵是也。太子南解王继位</p><p>第二南解王</p><p>南解居西干。亦云次次雄。是尊长之称。唯此王称之父赫居世。母阏英夫人。妃云帝夫人(一作云梯。今迎日县西有云梯山圣母。祈旱有应)前汉平帝元始四年甲子。即位。御理二十一年。以地皇四年甲申崩。此王乃三皇之弟。一云。按三国史云。新罗称王曰居西干。辰言王也。或云。呼贵人之称。或曰。次次雄。或作慈充 金大问云。次次雄方言谓巫也。世人以巫事鬼神尚祭祀。故畏敬之。遂称尊长者为慈充。或云。尼师今。言谓齿理也。初南解王薨。子弩礼让位于脱解。解云。吾闻圣智人多齿。乃试以饼噬之。古传如此。或曰麻立干(立一作袖)金大问云。麻立者。方言谓橛也。橛标准位而置。则王橛为主。臣橛列于下。因以名之。史论曰。新罗称居西干。次次雄者一。尼师今者十六。麻立干者。四罗末名儒崔致远作帝王年代历。皆称某王。不言居西干等。岂以其言鄙野不足称之也。今记新罗事。具存方言亦宜矣。罗人凡追封者称葛文王。未详。此王代乐浪国人来侵金城。不克而还。又天凤五年戊寅。高丽之裨属七国来投</p><p>第三弩礼王</p><p>朴弩礼尼叱今(一作儒礼王)初王与妹夫脱解让位。脱解云。凡有德者多齿。宜以齿理试之。乃咬饼验之。王齿多。故先立。因名尼叱今。尼叱今之称自此王始。刘圣公更始元年癸未。即位(年表云。甲申即位)改定六部号。仍赐六姓 始作兜率歌。有嗟辞词脑格 始制黎耜及藏冰库。作车乘。建虎十八年。伐伊西国灭之。是年。高丽兵来侵</p><p>第四脱解王</p><p>脱解齿叱今(一作吐解尼师今)南解王时(古本云壬寅年至者谬矣近则后于弩礼即位之初。无争让之事。前则在于赫居之世。故知壬寅非也)驾洛国海中有船来泊。其国首露王与臣民鼓噪而迎。将欲留之。而舡乃飞走。至于鸡林东下西知村阿珍浦(今有上西知下西知村名)时浦边有一妪。名阿珍义先。乃赫居王之海尺之母。望之谓曰。此海中元无石岩。何因鹊集而鸣。孥舡寻之。鹊集一舡上。舡中有一樻子。长二十尺。广十三尺。曳其船置于一树林下。而未知凶乎吉乎。向天而誓尔俄而乃开见。有端正男子并七宝奴婢满载其中。供给七日乃言曰。我本龙城国人(亦云正明国。或云琓夏国琓夏或作花厦国。龙城在倭东北一千里)我国尝有二十八龙王从人胎而生。自五岁六岁继登王位。教万民修正性命。而有八品姓骨。然无栋择。皆登大位。时我父王含达婆娉积女国王女为妃。久无子胤。祷祀求息。七年后产一大卵。于是大王会问群臣。人而生卵。古今未有。殆非吉祥。乃造樻置我。并七宝奴婢载于舡中。浮海而祝曰。任到有缘之地。立国成家。便有赤龙护舡而至此矣。言讫。其童子曳杖率二奴登吐含山上作石冢。留七日。望城中可居之地。见一峰如三日月。势可久之地。乃下寻之。即瓠公宅也。乃设诡计。潜埋砺炭于其侧。诘朝至门云。此是吾祖代家屋。瓠公云否。争讼不决。乃告于官。官曰。以何验是汝家。童曰。我本治匠乍出邻乡。而人取居之。请堀地检看。从之。果得砺炭。乃取而居为。时南解王知脱解是智人。以长公主妻之。是为阿尼夫人。一日吐解登东岳。回程次令白衣索水饮之。白衣汲水。中路先尝而进。其角杯贴于口不解。因而啧之。白衣誓曰。尔后若近遥不敢先尝。然后乃解。自此白衣詟服。不敢欺罔。今东岳中有一井。俗云遥乃井是也。及弩礼王崩。以光虎帝中元六年丁巳六月。乃登王位。以昔是吾家取他人家故。因姓昔氏。或云。因鹊开樻。故去鸟字姓昔氏。解樻脱卵而生。故因名脱解。在位二十三年。建初四年己卯崩葬疏川丘中。后有神诏。慎埋葬我骨。其髑髅周三尺二寸。身骨长九尺七寸。齿凝如一。骨节皆连琐。所谓天下无敌力士之骨。碎为塑像。安阙内。神又报云。我骨置于东岳。故令安之(一云崩后二十七世文虎王代。调露二年庚辰三月十五日辛酉。夜见梦于太宗。有老人貌甚威猛。曰我是脱解也。拔我骨于疏川丘。塑像安于工含山。王从其言。故至今国祀不绝。即东岳神也云)</p><p>金阏智脱解王代</p><p>永平三年庚申(一云中元六年。误矣。中元尽二年而已)八月四日。瓠公夜行月城西里。见大光明于始林中(一作鸠林)有紫云从天垂地。云中有黄金樻。挂于树枝。光自樻出。亦有白鸡鸣于树下。以状闻于王。驾幸其林。开樻有童男。卧而即起。如赫居世之故事。故因其言。以阏智名之。阏智即乡言小儿之称也。抱载还阙。鸟兽相随。喜跃跄跄土择吉日。册位太子。后让故婆娑。不即王位。因金樻而出。乃姓金氏。阏智生热汉。汉生阿都。都生首留。留生郁部。部生俱道(一作仇刀)道生未邹。邹即王位。新罗金氏自阏智始</p><p>延乌郎细乌女</p><p>第八阿达罗王即位四年丁酉。东海滨有延乌郎细乌女。夫妇同居。一日延乌归海采藻。忽有一岩(一云一鱼)负归日本。国人见之曰。此非常人也。乃立为王(按日本帝记。前后无新罗人为王者。此乃边邑小王。而非真王也)细乌怪夫不来归寻之。见夫脱鞋。亦上其岩岩亦负归如前。其国人惊讶。奏献于王。夫妇相会立为贵妃。是时新罗日月无光。日者奏云。日月之精。降在我国。今去日本。故致斯怪。王遣使求二人。延乌曰。我到此国。天使然也。今何归乎。虽然朕之妃有所织细绡。以此祭天可矣。仍赐其绡。使人来奏。依其言而祭之。然后日月如旧。藏其绡于御库为国宝。名其库为贵妃库祭天所名迎日县。又都祈野</p><p>末邹王竹叶军</p><p>第十三末邹尼叱今(一作末祖又末古)金阏智七世孙赫世紫缨仍有圣德。受禅于理解始登王位(今始称王之陵为始祖堂。盖以金始始登王位。故后代金氏诸王皆以末邹为始祖。宜矣)。在位二十三年而崩。陵在兴轮寺东。第十四儒理王代。伊西国人来攻金城。我大举防御。久不能抗。忽有异兵来助。皆珥竹叶。与我军并力击贼破之。军退后不知所归。但见竹叶积于末邹陵前。乃知先王阴胗泄ΑR蚝糁裣至辍T饺???阑莨?醮?4罄??哪昙何此脑隆:鲇行?纭4訌C信公冢起。中有一人乘骏马如将军仪状。亦有衣甲器仗者四十许人。随从而来。入于竹现陵。俄而陵中似有振动哭泣声。或如告诉之音。其言曰。臣平生有辅时救难匡合之功。今为魂魄镇护邦国。攘灾救患之心暂无渝改。往者庚戌年。臣之子孙无罪被诛。君臣不念我之功烈。臣欲远移他所。不复劳勤。愿王允之。王答曰。惟我与公不护此邦。其如民庶何。公复努力如前。三请三不许。旋风乃还。王闻之惧。乃遣工臣金敬信。就金公陵谢过焉。为公立<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>宝田三十结于鹫仙寺。以资冥福。寺乃金公讨平壤后。植福所置故也。非末邹之灵。无以遏金公之怒。王之护国不为不大矣。是以邦人怀德。与三山同祀而不坠。跻秩于五陵之上。称大庙云</p><p>奈勿王(一作那密王)金堤上</p><p>第十七那密王即位三十六年庚寅。倭王遣使来朝曰。寡君闻大王之神圣。使臣等以告百济之罪于大王也。愿大王遣一王子表诚心于寡君也。于是王使第三子美海(一作末吐喜)以聘于倭。美海年十岁。言辞动止犹未备具。故以内臣朴娑览为副使而遣之。倭王留而不送三十年。至讷祗王即位三年己未。句丽长寿王遣使来朝云。寡君闻大王之弟宝海秀智才艺。愿与相亲。特遣小臣恳请。王门之幸甚。因此和通。命其弟宝海。道于句丽。以内臣金正。谒为辅而送之。长寿王又留而不送。至十年乙丑。王召集群臣及国中豪侠。亲赐御宴。进酒三行。众乐初作。王垂涕而谓群臣曰。昔我圣考诚心民事。故使爱子东聘于倭。不见而崩。又朕即位已来。邻兵甚炽。战争不息。句丽独有结亲之言。朕信其言。以其亲弟聘于句丽。句丽亦留而不送。朕虽处富贵。而未尝一日暂忘而不哭。若得见二弟。共谢于先主之庙。则能报恩于国人。谁能成其谋策。时百官咸奏曰。此事固非易也。必有智勇方可。臣等以为歃罗郡太。守堤上可也。于是王召问焉。堤上再拜对曰。臣闻主忧臣辱。主辱臣死。若论难易而后行。谓之不忠。图死生而后动。谓之无勇。臣虽不肖。愿受命行矣。王甚嘉之。分觞而饮。握手而别。堤上帘前受命。径趋北海之路变服入句丽。进于宝海所。共谋逸期。先以五月十五日归。泊于高城水口而待。期日将至。宝海称病。数日不朝。乃夜中逃出。行到高城海滨。王知之。使数十人追之。至高城而及之。然宝海在句丽。常施恩于左右。故其军士悯伤之。皆拔箭镞而射之。遂免而归王既见宝海。益思美海。一欣一悲。垂泪而谓左右曰。如一身有一臂一面一眼。虽得一而亡一。何敢不痛乎。时堤上闻此言。再拜辞朝而骑马。不入家而行。直至于栗浦之滨。其妻闻之。赤马追至栗浦。见其夫已在舡上矣。妻呼之切恳。堤上但摇手而不驻。行至倭国诈言曰。鸡林王以不罪杀我父兄。故逃来至此矣。倭王信之。赐室家而安之。时堤上常陪美海游海滨。逐捕鱼鸟。以其所获每献于倭王。王甚喜之而无疑焉。适晓雾蒙晦。堤上曰。可行矣。美海曰。然则偕行。堤上曰。臣若行。恐倭人觉而追之。愿臣留而止其追也。美海曰。今我与汝如父兄焉。何得弃汝而独归。堤上曰。臣能救公之命。而慰大王之情则之矣。何愿生乎。取酒献美海。时鸡林人康仇丽在倭国。以其人从而逸之。堤上入美海房。至于明旦。左右欲入见之。堤上出止之曰。昨日驰走于捕猎。病甚未起。及乎日昊。左右怪之。而更问焉。对曰。美海行已久矣。左右奔告于王。王使骑兵逐之。不及。于是囚堤上问曰。汝何窃遣汝国王子耶。对曰。臣是鸡林之臣。非倭国之臣。今欲成吾君之志耳。何敢言于君乎。倭王怒曰。今汝已为我臣。而言鸡林之臣。则必具五刑。若言倭国之臣者。必赏重禄。对曰。宁为鸡林之犬豚。不为倭国之臣子。宁受鸡林之棰楚。不受倭国之爵禄。王怒。命屠剥堤上脚下之皮。刈蒹葭使趋其上(今蒹葭上有血痛俗云提上之血)更问曰。汝何国臣乎。曰鸡林之臣也。又使立于热铁上。问何国之臣乎。曰鸡林之臣也。倭王知不可屈。烧杀于木岛中。美海渡海而来。使康仇丽先告于国中。王惊喜。命百官迎于屈歇驿。王与亲弟宝海迎于南郊。入阙设宴。大赦国内。册其妻为国大夫人。以其女子为美海公夫人。议者曰。昔汉臣周苛在荣阳。为楚兵所虏。项羽谓周苛曰。汝为我臣。封为万禄侯。周苛骂而不屈。为楚王所杀。堤上之忠烈。无怪于周苛矣。初堤上之发去也。夫人闻之追不及。及至望德寺门南。沙上放卧长号。因名其沙曰长沙。亲戚二人。扶腋将还。夫人舒脚。坐不起。名其地曰伐知旨。久后夫人不胜其慕。率三娘子上鸱述岭。望倭国痛哭而终。仍为鸱述神母。今祠堂存焉</p><p>第十八实圣王</p><p>义熙九年癸丑。平壤州大桥成(恐南平壤也。今杨州)王忌惮前王太子讷祗有德望。将害之。请高丽兵而诈迎讷祗。高丽人见讷祗有贤行。乃倒戈而杀王。乃立讷祗为王而去</p><p>射琴匣</p><p>第二十一毗处王(一作昭智王)即位十年戊辰。幸于天泉亭。时有乌与鼠来鸣。鼠作人语云。此乌去处寻之(或云神德王欲行香兴轮寺。路见众鼠含尾怪之而还占之。明日先鸣乌寻之云云。此说非也)王命骑士追之。南至避村(今壤避寺村在南山东麓)。两猪相斗。留连见之。忽失乌所在。徘徊路旁。时有老翁自池中出奉书。外面题云。开见二人死。不开一人死。使来献之。王曰。与其二人死莫若不开但一人死耳。日官奏云。二人者庶民也。一人者王也。王然之开见。书中云射琴匣。王入宫见琴匣射之。乃内殿焚修僧。与宫主潜通而所姧也。二人伏诛。自尔国俗每正月上亥上子上午等日。忌慎百事。不敢动作。以十五日为乌忌之日。以糯饭祭之。至今行之。俚言怛忉。言悲愁而<a href=\"/foxue/changshi/153461.html\" class=\"keylink\" target=\"_blank\">禁忌</a>百事也。命其池曰书出池</p><p>智哲老王</p><p>第二十二智哲老王。姓金氏。名智大路。又智度路。谥曰智澄。谥号始于此。又乡称王为麻立干者。自此王始。王以永元二年庚辰即位(或云辛巳则三年也)王阴长一尺五寸。难于嘉耦。发使三道求之。使至牟梁部。冬老树下见二狗啮一屎块如鼓大。争啮其两端。访于里人。有一小女告云。此部相公之女子洗浣于此。隐林而所遗也。寻其家检之。身长七尺五寸。具事奏闻。王遣车邀入宫中。封为皇后。群臣皆贺</p><p>又阿瑟罗州(今溟州)东海中。便风二日程有[百-日+ㄎ]陵岛(今作羽陵)周回二万六千七百三十步。岛夷恃其水深。憍傲不臣王命伊餐朴伊宗将兵讨之。宗作木偶师子。载于大舰之上。威之云。不降则放此兽。岛夷畏而降。赏伊宗为州伯</p><p>真兴王</p><p>第二十四真兴王。即位时年十五岁。太后摄政。太后乃法兴王之女子。立宗葛文王之妃。终时削发被法衣而逝。承圣三年九月。百济兵来侵于珍城。掠取人男女三万九千。马八千匹而去。先是。百济欲与新罗合兵谋伐高丽。真兴曰。国之兴亡在天。若天未厌高丽则我何敢望焉。乃以此言通高丽。高丽感其言。与罗通好。而百济怨之。故来尔</p><p>桃花女鼻荆郎</p><p>第二十五舍轮王。谥真智大王。姓金氏。妃起乌公之女。知刀夫人。大建八年丙申即位(古本云。十一年己亥。误矣)。御国四年。政乱荒淫。国人废之。前此。沙梁部之庶女。姿容艳美。时号桃花娘。王闻而召致宫中。欲幸之。女曰。女之所守。不事二夫。有夫而适他。虽万乘之威。终不夺也。王曰。杀之何。女曰。宁斩于市。有愿靡他。王戏曰。无夫则可乎。曰可。王放而遣之。是年。王见废而崩。后二年其夫亦死。浃旬忽夜中王如平昔来于女房曰。汝昔有诺。今无汝夫可乎。女不轻诺。告于父母。父母曰。君王之教。何以避之。以其女入于房。留御七日。常有五色云覆屋。香气满室。七日后忽然无踪。女因而有娠。月满将产。天地振动。产得一男。名曰鼻荆。真平大王闻其殊异。收养宫中。年至十五授差执事。每夜逃去远游。王使勇士五十人守之。每飞过月城。西去荒川岸上(在京城西)率鬼众游。勇士伏林中。窥伺鬼众。闻诸寺晓钟各散。郎亦归矣。军士以事来奏。王召鼻荆曰。汝领鬼游信乎。郎曰然。王曰。然则汝使鬼众成桥于神元寺北渠(一作神众寺。误一云荒川东深渠)荆奉敕。使其徒炼石。成大桥于一夜。故名鬼桥。王又问。鬼众之中。有出现人间。辅朝政者乎。曰有。吉达者可辅国政。王曰与来。翌日荆与俱见。赐爵执事。果忠直无双。时角干林宗无子。王敕为嗣子。林宗命吉达创楼门于兴轮寺南。每夜去宿其门上。故名吉达门。一日吉达变狐而遁去。荆使鬼捉而杀之。故其众闻鼻荆之名。怖畏而走。时人作词曰</p><p>圣帝魂生子鼻荆郎室亭</p><p>飞驰诸鬼众此处莫留停</p><p>乡俗帖此词以辟鬼</p><p>天赐玉带(清泰四年丁酉五月。正承金傅献镌金妆玉排方腰带一条长十围。镌銙六十二。曰。是真平王天赐带也。太祖受之。藏之内库)</p><p>第二十六白净王。谥真平大王。金氏。大建十一年己亥八月即位。身长十一尺。驾幸内帝释宫(亦名天柱寺。王之所创)踏石梯。□石并折。王谓左右曰。不动此石。以示后来。即城中五不动石之一也。即位元年。有天使降于殿庭。谓王曰。上皇命我传赐玉带。王亲奉跪受。然后其使上天。凡郊庙大祀皆服之。后高丽王将谋伐罗。乃曰。新罗有<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>不可犯。何谓也。皇龙寺丈六尊像一。其寺九层塔二。真平王天赐玉带三也。乃止其谋。赞曰</p><p>云外天颁玉带围辟雍龙衮雅相宜</p><p>吾君自此身弥重准拟明朝铁作墀</p><p>善德王知几三事</p><p>第二十七德曼(一作万)谥善德女大王。姓金氏。父真平王。以贞观六年壬辰即位。御国十六年。凡知几有三事。初唐太宗送画牧丹三色。红紫白以其实三升。王见画花曰。此花定无香。仍命种于庭。待其开落。果如其言。二于灵庙。寺玉门池。冬月众蛙集鸣三四日。国人怪之问于王。王急命角干阏川弼吞等。炼精兵二千人。速去西郊问女根谷必有贼兵。掩取杀之。二角干既受命。各率千人问西郊。富山下果有女根谷。百济兵五百人。来藏于彼。并取杀之。百济将军[百-日+ㄎ]召者藏于南山岭石上。又围而射之殪。又有后兵一千二百人来。亦击而杀之。一无孑遗。三王无恙时。谓群臣曰。朕死于某年某月日。葬我于忉利天中。群臣罔知其处。奏云何所。王曰。狼山南也。至其月日王果崩。群臣葬于狼山之阳。后十余年文虎大王创四天王寺于王坟之下。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>云。四天王天之上有忉利天。乃知大王之灵圣也。当时群臣启于王曰。何知花蛙二事之然乎。王曰。画花而无蝶。知其无香。斯乃唐帝欺寡人之无耦也。蛙有怒形兵士之像。玉门者女根也。女为阴也。其色白。白西方也。故知兵在西方。男根入于女根则必死矣。以是知其易捉。于是群臣皆服其圣智。送花三色者。盖知新罗有三女王而然耶。谓善德真德真圣是也。唐帝以有悬解之明。善德之创灵庙寺。具载良志师传详之 别记云。是王代。炼石筑瞻星台</p><p>真德王</p><p>第二十八真德女王。即位自制太平歌。织锦为纹。命使往唐献之(一本命春秋公为使往。仍请兵。太宗嘉之。许苏廷方云云者。皆谬矣。现庆前春秋已登位。现庆庚申非太宗。乃高宗之世。定方之来。在现庆庚申。故知织锦为纹。非请兵时也。在真德之世。当矣。盖请放金钦之时也)唐帝嘉赏之。改封为鸡林国王。其词曰</p><p>大唐开洪业巍巍皇猷昌</p><p>止戈戎威定修文契百王</p><p>统天崇雨施理物体含章</p><p>深仁谐日月[打-丁+旡]军迈虞唐</p><p>幡旗何赫赫铮鼓何锽锽</p><p>外夷违命者剪覆被天殃</p><p>淳风凝幽现遐迩竞呈祥</p><p>四时和玉烛七曜巡方方</p><p>维岳降辅宰维帝任忠良</p><p>五三成一德昭我唐家皇</p><p>王之代有阏川公。林宗公。述宗公。虎林公(慈藏之父)。廉长公。庾信公。会于南山[百-日+ㄎ]知岩议国事。时有大虎走入座间。诸公惊起。而阏川公略不移动。谈笑自若。捉虎尾扑于地而杀之。阏川公膂力如此。处于席首。然诸公皆服庾信之威。新罗有四灵地。将议大事。则大臣必会其地谋之。则其事必成。一东曰青松山。二曰南[百-日+ㄎ]知山。三曰西皮田。四曰北金刚山。是王代始行正旦礼。始行侍郎号</p><p>金庾信</p><p>虎力伊干之子。舒玄角干。金氏之长子曰庾信。弟曰钦钝。姊妹。曰宝姬。小名阿海。妹曰文姬。小名阿之。庾信公以真平王十七年乙卯生。禀精七曜。故背有七星文。又多神异。年至十八壬申。修釰得术为国仚。时有白石者。不知其所自来属于徒中有年。郎以伐丽齐之事。日夜深谋白石知其谋。告于郎曰。仆请与公密先探于彼。然后图之何如。郎喜。亲率白石夜出行。方憩于岘上。有二女随郎而行。至骨火川留宿。又有一女忽然而至。公与三娘子喜话之时。娘等以美果馈之。郎受而啖之。心诺相许。乃说其情。娘等告云。公之所言已闻命矣。愿公谢白石而共入林中。更陈情实。乃与俱入。娘等便现神形曰。我等奈林穴礼骨火等三所护国之神。今敌国之人诱郎引之。郎不知而进途。我欲留郎而至此矣。言讫而隐。公闻之惊仆。再拜而出。宿于骨火馆。谓白石曰。今归他国忘其要文。请与尔还家取来。遂与还至家。拷缚白石而问其情。曰。我本高丽人(古本云百济。误矣。楸南乃高丽之。士。又逆行阴阳亦是宝藏王事)我国群臣曰。新罗庾信是我国卜筮之士楸南也(古本作春南。误矣)国界有逆流之水(或云雄雌。尤反覆之事)使其卜之。奏曰。大王夫人逆行阴阳之道。其瑞如此。大王惊怪。而王妃大怒。谓是妖狐之语。告于王。更以他事验问之。失言则加重刑。乃以一鼠藏于合中。问是何物。其人奏曰。是必鼠。其命有八。乃以谓失言。将加斩罪。其人誓曰。吾死之后。愿为大将必灭高丽矣。即斩之。剖鼠腹而视之。其命有七。于是知前言有中。其日夜大王梦楸南入于新罗舒玄公夫人之怀。以告于群臣。皆曰。楸南誓心而死。是其果然。故遣我至此谋之尔。公乃刑白石。备百味祀三神。皆现身受奠。金氏宗财买夫人死。葬于青渊上谷。因名财买谷。每年春月。一宗士女</p></div>"
},{
    "title": "三国遗事 第二卷",
    "author": "一然大师",
    "html": "<div class=\"B1_text\"><p>三国遗事 第二卷</p><p>文虎王法敏</p><p>王初即位。龙朔辛酉。泗泚南海中有死女尸。身长七十三尺。足长六尺阴长三尺。或云。身长十八尺。在封干二年丁卯</p><p>总章戊辰。王统兵。与仁问钦纯等至平壤。会唐兵灭丽。唐帅李绩获高臧王还国(王之性高。故云高臧。按唐书高记。现庆五年庚申。苏定方等征百济。后十二月大将军契如何)为浿道行军大总管苏。定方为辽东道大总管。刘伯英为平壤道大总管。以伐高丽。又明年辛酉正月。萧嗣业为扶俆道总管。任雅相为浿江道总管。率三十五万军以伐高丽。八月甲戌。苏定方等及高丽战。于浿江败亡。干封元年丙寅六月。以庞同善高临薜仁贵李谨行等为后援。九月。庞同善及高丽战败之十二月己酉。以李绩为辽东道行台大总管。率六总管兵以伐高丽。总章元年戊辰九月癸巳。李绩获高臧王。十二月丁巳献俘于帝。上元元年甲戌二月。刘仁轨为鸡林道总管。以伐新罗。而乡古记云。唐遣陆路将军孔恭水路将军有相兴新罗金庾信等灭之。而此云仁问钦纯等无庾信。未详。时唐之游兵诸将兵有留镇而将谋袭我者。王觉之。发兵之明年。高宗使召仁问等让之曰。尔请我兵以灭丽。害之何耶。乃下圆扉。炼兵五十万。以薜邦为帅。欲伐新罗。时义相师西学入唐来见仁问。仁问以事谕之。相乃东还上闻。王甚惮之。会群臣问防御策。角干金天尊奏曰。近有明朗法师入龙宫。传秘法而来。请诏问之。朗奏曰。狼山之南有神游林。创四天王寺于其地。开设道场则可矣。时有贞州使走报曰。唐兵无数至我境。回椠海上。王召明朗曰。事已逼至如何。朗曰。以彩帛假构宜矣。乃以彩帛营寺。草构五方神像。以瑜珈明僧十二员。明朗为上首。作文豆娄秘密之法。时唐罗兵未交接。风涛怒起。唐舡皆没于水。后改创寺。名四天王寺。至今不坠坛席(国史大改创在调露元年己卯)后年辛未。唐更遣赵宪为帅。亦以五万兵来征。又作其法。舡没如前。是时翰林郎朴文俊随仁问在狱中。高宗召文俊曰。汝国有何密法。再发大兵无生还者。文俊奏曰。陪臣等来于上国一十余年。不知本国之事。但遥闻一事尔。厚荷上国之恩。一统三国。欲报之德。新创天王寺于狼山之南。祝皇寿万年。长开法席而已。高宗闻之大悦。乃遣礼部侍郎乐鹏龟使于罗审其寺。王先闻唐使将至。不宜见兹寺。乃别创新寺于其南待之。使至曰。必先行香于皇帝祝寿之所天王寺。乃引见新寺。其使立于门前曰。不是四天王寺。乃望德遥山之寺。终不入。国人以金一千两赠之。其使乃还奏曰。新罗创天王寺。祝皇寿于新寺而已。因唐使之言。因名望德寺(或系孝昭王代。误矣)王闻文俊善奏。帝有宽赦之意。乃命强首先生作请放仁问表。以舍人远禹奏于唐。帝见表流涕。赦仁问慰送之。仁问在狱时。国人为创寺名仁容寺。开设观音道场。及仁问来还。死于海上。改为弥陀道场。至今犹存。大王御国二十一年。以永隆二年辛巳崩。遗诏葬于东海中大岩上。王平时常谓智义法师曰。朕身后愿为护国大龙。崇奉<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。守护邦家。法师曰。龙为畜报何。王曰。我厌<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>荣华久矣。若粗报为畜。则雅合朕怀矣王初即位置南山长仓。长五十步。广十五步。贮米谷兵器。是为右仓。天恩寺西北山上是为左仓。别本云。建福八年辛亥筑南山城。周二千八百五十步。则乃真德王代始筑。而至此乃重修尔。又始筑富山城。三年乃毕。安北河边筑铁城。又欲筑京师城郭。既令真吏。时义相法师闻之。致书报云。王之政教明则虽草丘尽地而为城。民不敢踰。可以洁灾进福。政教苟不明。则虽有长城。灾害未消。王于是正罢其役。麟德三年丙寅三月十日。人家婢名吉伊。一乳生三子。总章三年庚午正月七日。汉岐部一山级干一作成山何于。婢一乳生四子。一女三子。国给谷二百石以赏之 又伐高丽。以其国王孙还国。置之真骨位 王一日召庶弟车得公曰。汝为冢宰。均理百官平章四海。公曰。陛下若以小臣为宰。则臣愿潜行国内。示民问徭役之劳逸。祖赋之轻重。官吏之清浊。然后就职。王听之。公着缁衣。把琵琶为<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>形。出京师。经由阿瑟罗州(令溟州)牛首州(今春州)北原京(今忠州)至于武珍州(今海阳)巡行里辍V堇舭布??且烊恕Q?缕浼摇&gt;∏楣┮凇V烈拱布?狡捩??嗽弧=褡仁趟蘅途邮空咧丈碣衫隙?拊弧D?徊⒕印:我杂谌送?蕖F湟黄拊弧9?粜碇丈聿⒕印T虺忻?印4又?Z档┚邮坑?切惺薄T黄途┦θ艘病N峒以诨柿?适ザ?轮?洹N崦?宋缫</p></div>"
},{
    "title": "三国遗事 第三卷",
    "author": "一然大师",
    "html": "<div class=\"B1_text\"><p>三国遗事 第三卷</p><p>兴法第三顺道肇丽(道公之次。亦有法深义渊昙严之流。相继而兴教。[烈-列+秋]古传无文。今亦不敢编次。详见僧传)</p><p>高丽本记云。小兽林王即位二年壬申。乃东晋咸安二年孝武帝即位之年也。前秦符坚遣使及僧顺道。送佛像经文(时坚都关中。即长安)。又四年甲戌。阿道来自晋。明年乙亥二月。创肖门寺以置顺道。又创伊弗兰寺以置阿道。此高丽<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之始。僧传作二道来自魏云者误矣。实自前秦而来。又云肖门寺今兴国。伊弗兰寺今兴福者亦误。按丽时都安市城。一名安丁忽。在辽水之北辽水一名鸭渌。今云安民江。岂有松京之兴国寺名。赞曰</p><p>鸭渌春深渚草鲜白沙鸥鹭等闲眠</p><p>忽惊柔橹一声远何处渔舟客到烟</p><p>难陀辟济</p><p>百济本记云。第十五(僧传云十四误)[杵-十+匕]流王即位甲申(东晋孝武帝大元九年)。胡僧摩罗难陀至自晋。迎置宫中礼敬。明年乙酉。创佛寺于新都汉山州。度僧十人。此百济佛法之始。又阿莘王即位大元十七年二月。下教崇信佛法求福。摩罗难陀。译云童学(其异迹详见僧传)。赞曰</p><p>天造从来草昧间大都为伎也应难</p><p>翁翁自解呈歌舞引得傍人借眼看</p><p>阿道基罗(一作我道。又阿头)</p><p>新罗本记第四云。第十九讷祗王时。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>墨胡子自高丽至一善郡。郡人毛礼(或作毛禄)。于家中作堀室安置。时梁遣使赐衣着香物(高得相咏史诗云。梁遣使僧曰元表。宣送溟檀及经像)。君臣不知其香名与其所用。遣人赍香遍问国中。墨胡子见之曰。此之谓香也。焚之则香气芬馥。所以达诚于神圣。神圣未有过于<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。若烧此发愿。则必有灵应(讷祗在晋宋之世。而云梁遣使。恐误)。时王女病革。使召墨胡子。焚香表誓。王女之病寻愈。王喜厚加赉贶。俄而不知所归。又至二十一毗处王时。有我道和尚。与侍者三人。亦来毛礼家。仪表似墨胡子。住数年。无疾而终。其侍者三人留住。讲<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>律。往往有信奉者(有注云与本碑及诸传记殊异。又高僧传云西竺人。或云从吴来)。按我道本碑云。我道高丽人也。母高道宁。正始间。曹魏人我(姓我也)。崛摩奉使句丽。私之而还。因而有娠。师生五岁。其母令<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。年十六归魏。省觐崛摩。投玄彰和尚讲下就业。年十九又归宁于母。母谓曰。此国于今不知佛法。尔后三千余月鸡林有圣王出。大兴<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。其京都内有七处伽蓝之墟。一曰金桥东天镜林(今兴轮寺。金桥谓西川之桥。俗讹呼云松桥也。寺自我道始基。而中废。至法兴王丁未草创。乙卯大开。真兴王毕成)。二曰三川岐(今永兴寺。与兴轮开同代)。三曰龙宫南(今皇龙寺。真兴王癸酉始开)。四曰龙宫北(今芬皇寺。善德甲午始开)。五曰沙川尾(今灵妙寺。善德王乙未始开)。六曰神游林(今天王寺。文武王己卯开)。七曰婿请田(今昙严寺)皆前佛时伽蓝之墟。法水长流之地。尔归彼而播扬大教。当东向于释祀矣。道禀教至鸡林。寓止王城西里。今严庄寺。于时末雏王即位二年癸未也。诣阙请行教法。世以前所未见为嫌。至有将杀之者。乃逃隐于续林(今一善县)毛禄家(禄与礼形近之讹。古记云。法师初来毛禄家。时天地震惊。时人不知僧名。而云阿头彡么。彡么者乃乡言之称僧也。犹言<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>也)三年。时成国公主疾。巫医不效。敕使四方求医。师率然赴阙。其疾遂理。王大悦。问其所须。对曰。贫道百无所求。但愿创佛寺于天境林。大兴佛教。奉福邦家尔。王许之。命兴工。俗方质俭。编茅葺屋。住而讲演。时或天花落地。号兴轮寺。毛禄之妹名史氏。投师为尼。亦于三川岐。创寺而居。名永兴寺。未几。末雏王即世。国人将害之。师还毛禄家。自作冢。闭户自绝。遂不复现。因此大教亦废。至二十三法兴大王。以萧梁天监十三年甲午登位。乃兴释氏。距末雏王癸未之岁二百五十二年。道宁所言三千余月验矣。据此。本记与本碑。二说相戾。不同如此。尝试论之。梁唐二僧传。及三国本史皆载。丽济二国佛教之始。在晋末大元之间。则二道法师。以小兽林甲戌到高丽明矣。此传不误。若以毗处王时方始到罗。则是阿道留高丽百余岁乃来也。虽大圣行止出没不常。未必皆尔。抑亦新罗奉佛非晚甚如此。又若在末雏之世。则却超先于到丽甲戌百余年矣。于时鸡林未有文物礼教。国号犹未定。何暇阿道来请奉佛之事。又不合高丽未到而越至于罗也。设使暂兴还废。何其间寂寥无闻。而尚不识香名哉。一何大后。一何大先。揆夫东渐之势。必始于丽济而终乎罗则讷祗既与兽林世相接也。阿道之辞丽抵罗。宜在讷祗之世。又王女救病。皆传为阿道之事。则所谓墨胡者非真名也。乃指目之辞。如梁人指达摩为碧眼胡。晋调释道安为柒道人类也。乃阿道危行避讳。而不言名姓故也。盖国人随其所闻。以墨胡阿道二名。分作二人为传尔。况云阿道仪表似墨胡。则以此可验其一人也。道宁之序七处。直以创开先后预言之。两传失之。故今以沙川尾跻于五次。三千余月未必尽信书。自讷只之世抵乎丁未。无虑一百余年。若曰一千余月。则殆几矣。姓我。单名疑赝难详。又按元魏释昙始(一云惠始)传云。始关中人。自出家已后。多有异迹。晋孝武大元年末。赍经律数十部。往辽东宣化。现授三乘立以归戒。盖高丽闻道之始也。义熙初复还关中。闻导三辅。始足白于面。虽涉泥水。未尝沾湿。天上咸称白足和尚云。晋末。朔方凶奴赫连勃勃。破获关中。斩戮无数。时始亦遇害。刀不能伤。勃勃嗟叹之。普赦沙门。悉皆不杀。始于是潜遁山泽。修头陀行。拓拔焘复克长安。擅威关洛。时有博陵崔皓。小习左道。猜嫉释教。既位居伪辅。为焘所信。乃与天师寇谦之说焘。佛教无益。有伤民利。劝令废之云云。大平之末。始方知焘将化时至。乃以元会之日。忽杖锡到宫门。焘闻令斩之。屡不伤焘自斩之亦无伤。饲北园。所养虎亦不敢近。焘大生惭[怡-台+翟]。遂感疠疾。崔寇二人相次发恶病。焘以过由于彼。于是诛灭二家门族。宣下国中。大[弓*几]佛法。始后不知所终议曰。昙始以大元末到海东。义熙初还关中。则留此十余年。何东史无文。始既恢诡不测之人。而与阿道。墨胡。难陀。年事相同。三人中疑一必其变讳也。赞曰</p><p>雪拥金桥冻不开鸡林春色未全回</p><p>可怜青帝多才思先着毛郎宅里梅</p><p>原宗兴法(距讷祗世一百余年)厌髑灭身</p><p>新罗本记。法兴大王即位十四年。小臣异次顿为法灭身。即萧梁普通八年丁未。西竺达摩来金陵之岁也。是年。朗智法师亦始住灵鹫山开法。则大教兴衰。必远近相感。一时于此可信。元和中。南涧寺沙门一念撰髑香坟<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>结社文。载此事甚详。其略曰。昔在法兴大王垂拱紫极之殿。俯察扶桑之域。以谓昔汉明感梦。佛法东流。寡人自登位。愿为苍生欲造修福灭罪之处。于是朝臣(乡传云。工目谒恭等)未测深意。唯遵理国之大义。不从建寺之神略。大王叹曰。於戏。寡人以不德丕承大业。上亏阴阳之造化。下无黎庶之欢。万机之暇。留心释风。谁与为伴。粤有内养者。姓朴字厌髑(或作异次。或云伊处。方音之别也。译云厌也。髑顿道睹独等皆随书者之便。乃助辞也。今译上不译下。故云厌髑又厌睹等也)。其父未评。祖阿珍宗。即习宝葛文王之子也(新罗官爵凡十七级。其第四曰波珍餐亦云阿珍餐也。宗其名也。习宝亦名也。罗人凡追封王者。皆称葛文王。其实史臣亦云未详。又按金用行撰阿道碑。舍人时年二十六。父吉升。祖功汉。曾祖乞解大王)挺竹柏而为质。抱水镜而为志。积善曾孙。望宫内之爪牙。圣朝忠臣。企河清之登侍。时年二十二。当充舍人(罗爵有大舍小舍等。盖下士之秩)瞻仰龙颜。知情击目。奏云。臣闻古人问策刍荛。愿以危罪启咨。王曰。非尔所为。舍人曰。为国亡身。臣之大节。为君尽命。民之直义。以谬传辞。刑臣斩首。则万民咸伏。不敢违教。王曰。解肉枰躯。将赎一鸟。洒血摧命。自怜七兽。朕意利人。何杀无罪。汝虽作<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。不如避罪。舍人曰。一切难舍。不过身命。然小臣夕死。大教朝行。佛日再中。圣主长安。王曰。鸾凤之子。幼有凌霄之心。鸿鹄之儿。生怀截波之势。尔得如是。可谓大士之行乎。于焉大王权整威仪。风刀东西。霜仗南北。以召群臣。乃问卿等于我欲造精舍。故作留难(乡传云。髑为以王命传下。兴工创寺之意。群臣来谏。王乃责怒于髑刑以伪传王命)于是群臣战战兢惧。[偬-囱+公]侗作誓。指手东西。王唤舍人而诘之。舍人失色。无辞以对。大王忿怒。敕令斩之。有司缚到衙下。舍人作誓。狱吏斩之。白乳涌出一丈(乡传云。舍人誓曰。大圣法王欲兴佛教。不顾身命。多却结缘。天垂瑞祥。遍示人庶。于是其头飞出。落于金刚山顶云云)天四黯黪。斜景为之晦明。地六震动。雨花为之飘落。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>哀戚。沾悲泪于龙衣。冢宰忧伤。流轻汗于蝉冕。甘泉忽渴。鱼鳖争跃。直木先折。猿猱群鸣。春宫连鏕之侣。泣血相顾。月庭交袖之朋。断肠惜别。望柩闻声。如丧考妣。咸谓子推割股。未足比其苦节。弘演刳腹。讵能方其壮烈。此乃扶丹墀之信力。成阿道之本心。圣者也。遂乃葬北山之西岭(即金刚山也。传云。头飞落处。因葬其地。今不言何也)内人哀之。卜胜地造兰若。名曰剌楸寺。于是家家作礼。必获世荣。人人行道。当晓法利。真兴大王即位五年甲子。造大兴轮寺(按国史兴乡传。实法兴王十四年丁未始开。二十一年乙卯大伐天镜林。始兴工梁栋之材。皆于其林中取足。而阶础石龛皆有之。至真兴王五年甲子。寺成。故云甲子。僧传云七年误)。大清之初。梁使沉湖将<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。天寿六年。陈使刘思并僧明观奉内经并次。寺寺星张塔塔雁行。竖法幢。悬梵镜。龙象释徒。为寰中之<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。大小乘法。为京国之慈云。他方菩萨。出现于世(谓芬皇之陈那浮石宝。盖以至洛山五台等是也)西域名僧。降临于境。由是并三韩而为邦。掩四海而为家。故书德名于天[金*具]之树。影神迹于星河之水。岂非三圣威之所致也(谓我道法兴厌髑也)降有国统惠隆法主孝圆金相郎大统鹿风大书省真怒波珍餐金嶷等建旧茔。树丰碑。元和十二年丁酉八月五日。即第四十一宪德大王九年也。兴轮寺永秀禅师(于时瑜伽诸德皆称禅师)结凑斯冢。礼佛之香徒。每月五日。为魂之妙愿。营坛作梵。又乡传云。乡老每当忌旦。设社会于兴轮寺。则今月初五。乃舍人捐躯顺法之晨也。呜呼。无是君无是臣。无是臣无是功。可谓刘葛鱼水。云龙感会之美欤。法兴王既举废立寺。寺成。谢冕旒披方袍施宫戚为寺隶(寺隶至今称王孙。后至太宗王时。宰辅金良图信向佛法。有二女曰花宝莲宝。舍身为此寺婢。又以逆臣毛尺之族。没寺为隶。二族之裔至今不绝)主住其寺。躬任弘化。真兴乃继德重圣。承[褒-保+公]职处九五。威率百僚。号令毕备。因赐额大王兴轮寺。前王姓金氏。出家法云。字法空(僧传与诸说亦以王妃出家名法云。又真兴王为法云。又以为真兴之妃名法云。颇多疑混)册府元龟云。姓募。名秦初兴役之乙卯岁。王妃亦创永兴寺。慕史氏之遗风。同王落彩为尼。名妙法。亦住永兴寺。有年而终。国史云。建福三十一年。永兴寺塑像自坏。未几。真兴王妃<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>卒。按真兴乃法兴之侄子。妃思刀夫人朴氏。牟梁里英失角干之女。亦出家为尼。而非永兴寺之创主也。则恐真字当作法。谓法兴之妃巴刁夫人为尼者之卒也。乃创寺立像之主故也。二兴舍位出家。史不书。非经世之训也。又于大通元年丁未。为梁帝创寺于熊川州。名大通寺(熊川即公州也。时属新罗故也。然恐非丁未也。乃中大通元年己酉岁所创也。始创兴轮之丁未。未暇及于他郡立寺也)赞曰</p><p>圣智从来万世谋区区舆议谩秋毫</p><p>法轮解逐金轮转舜日方将佛日高</p><p>右原宗</p><p>徇义轻生已足惊天花白乳更多情</p><p>俄然一釰身亡后院院钟声动帝京</p><p>右厌髑</p><p>法王禁杀</p><p>百济第二十九主法王讳宣。或云<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>。开皇十年己未即位。是年冬。下诏禁<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。放民家所养鹰鹯之类。焚渔猎之具。一切禁止。明年庚申度僧三十人。创王兴寺于时都泗泚城(今扶余)始立栽而升遐。武王继统。父基子构。历数纪而毕成。其寺亦名<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>寺。附山临水。花木秀丽。四时之美具焉。王每命舟。沿河入寺。赏其形胜壮丽(与古记所载小异。武王是贫母与池龙通交而所生。小名薯蓣。即位后谥号武王。初与王妃草创也)赞曰</p><p>诏宽[狂-王+羽][狂-王+戌]千丘惠泽洽豚鱼四海仁</p><p>莫道圣君轻下世上方兜率正芳春</p><p>宝藏奉老普德移庵</p><p>高丽本记云。丽季武德贞观间。国人争奉五斗米教。唐高祖闻之。遣道士送天尊像来。讲<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>经。王与国人听之。即第二十七代荣留王即位七年武德七年甲申也。明年遣使往唐。求<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>老。唐帝(谓高祖也)许之。及宝藏王即位(贞观十六年壬寅也)亦欲并兴三教。时宠相盖苏文。说王以儒释并炽。而黄冠未盛。特使于唐求道教。时普德和尚住盘龙寺。悯左道匹正。国祚危矣。屡谏不听。乃以神力飞方丈。南移于完山州(今全州也)。孤大山而居焉。即永徽元年庚戌六月也(又本传云。干封二年丁卯三月三日也)。未几国灭(以总章元年戊辰国灭则计距庚戌十九年矣)。今景福寺有飞来方丈是也云云(已上国史)。真乐公留诗在堂。文烈公着传行世。又按唐书云。先是隋炀帝征辽东。有裨将羊皿不利于军。将死有誓曰。必为宠臣灭彼国矣。及盖氏擅朝。以盖为氏。乃以羊皿是之应也。又按高丽古记云。隋炀帝以大业八年壬申。领三十万兵。渡海来征。十年甲戌十月。高丽王(时第三十六代婴阳王立二十五年也)上表乞降。时有一人密持小弩于怀中。随持表使到炀帝舡中。帝奉表读之。弩发中帝胸。帝将旋师。谓左右曰。朕为天下之主亲征小国而不利。万代之所嗤。时右相羊皿奏曰。臣死为高丽大臣。必灭国。报帝王之仇帝崩后生于高丽。十五聪明神武。时武阳王闻其贤(国史荣留王名建武。或云建成。而此云武阳。未详)征入为臣自称姓盖名金。位至苏文。乃侍中职也(唐书云。盖苏文自谓莫离支。犹中书令。又按神志秘词序云。苏文大英弘序并注。则苏文乃职名。有文证而传云。文人苏英弘序。未详孰是)金奏曰。鼎有三足。国有三教。臣见国中。唯有儒释无道教。故国危矣。王然之。奏唐请之。太宗遣叙达等道士八人(国史云。武德八年乙酉遣使入唐永佛老。唐帝许之。据此。则羊血自甲戌年死而托生于此。则才年十余岁矣。而云宠宰。说王遣请。其年月必有一误。今两存)王喜以佛寺为道馆。尊道士坐儒士之上。道士等行镇国内。有名山川。古平壤城势新月城也。道士等咒敕南河龙。加筑为满月城。因名龙堰城。作谶曰。龙堰堵。且云千年宝藏堵。或凿破灵石(俗云都帝岩。亦云朝天石盖。昔圣帝骑此石朝上帝故也)盖金又奏筑长城东北西南。时男役女耕。役至十六年乃毕。及宝藏王之世。唐太宗亲统以六军来征。又不利而还。高宗总章元年戊辰。右相刘仁轨。大将军李绩。新罗金仁问等攻破国灭擒王归唐。宝藏王庶子率四千余家投于新罗(与国史少殊。故并录)大安八年辛未。祐世僧统到孤大山景福寺飞来方丈。礼普圣师之真。有诗云。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>方等教传受自吾师云云。至可惜飞房后。东明古国危。跋云。高丽藏王感于道教。不信佛法。师乃飞房。南至此山。后有神人。现于高丽马岭。告人云。汝国败亡无日矣。具如国史。余具载本传与僧传。师有高弟十一人。无上和尚与<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>金趣等创金洞寺。寂灭义融二师创珍丘寺。智薮创大乘寺。一乘与心正大原等创大原寺。水净创维摩寺。四大与契育等创中台寺。开原和尚创开原寺。明德创燕口寺。开心与普明亦有传。皆如本传。赞曰</p><p>释氏汪洋海不穷百川儒老尽朝宋</p><p>丽王可笑封沮洳不省沧溟徒卧龙</p><p>东京兴轮寺金堂十圣</p><p>东壁坐庚向泥塑 我道 厌髑 惠宿 安含 义湘</p><p>西壁坐甲向泥塑 表训 蛇巴 元晓 惠空 慈藏</p><p>塔像</p><p><a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛宴坐石</p><p>玉龙集及慈藏传与诸家传纪皆云。新罗月城东龙宫南有迦叶佛宴坐石。其地即前佛时伽蓝之墟也。今皇龙寺之地。即七伽蓝之一也。按国史。真兴王即位十四开国三年癸酉二月。筑新宫于月城东。有皇龙现其地。王疑之。改为皇龙寺。宴坐石在佛殿后面。尝一谒焉。石之高可五六尺。来围仅三肘。幢立而平顶。真兴创寺已来。再经灾火。石有拆裂处。寺僧贴铁为护。乃有赞曰。惠日沈辉不记年。唯余宴坐石依然。桑田几度成沧海。可惜巍然尚未迁。既而西山大兵已后。殿塔煨烬。而此石亦夷没。而仅与地平矣。按阿含经迦叶佛。是贤劫第三尊也。人寿二万岁时。出现于世。据此以增减法计之。每成劫初。皆寿无量岁。渐减至寿八万岁时。为住劫之初。自此又百年减一岁。至寿十岁时为一减。又增至人寿八万岁时为一增。如是二十减二十增为一住劫。此一住劫中有千佛出世。今本师释迦是第四尊也。四尊皆现于第九减中。自释尊百岁寿时。至迦叶佛二万岁时。已得二百万余岁。若至贤劫初第一尊拘留孙佛时。又几万岁也。自拘留孙佛时。上至劫初无量岁寿时。又几何也。自释尊下至于今至元十八年辛巳岁。已得二千二百三十矣。自拘留孙佛历迦叶佛时至于今。则直几万岁也。有本朝名士吴世文。作历代歌。从大金贞祐七年己卯。逆数至四万九千六百余岁。为盘古开辟戊寅。又延禧宫录事金希宁所撰大一历法。自开辟上元甲子至元丰甲子。一百九十三万七千六百四十一岁。又纂古图云。开辟至获麟。二百七十六万岁。按诸经。且以迦叶佛时至于今。为此石之寿。尚距于劫初开辟时为儿子矣。三家之说尚不及兹儿石之年。其于开辟之说。疏之远矣</p><p>辽东城育王塔</p><p>三宝感通录载。高丽辽东城傍塔者。古老传云。昔高丽圣王按行国界次。至此城见五色云覆地。往寻云中。有僧执锡而立。既至便灭。远看还现。傍有土塔三重。上如覆釜。不知是何。更往觅僧。唯有荒草。掘寻一丈。得杖并履。又掘得铭。上有梵书。侍臣识之云是佛塔。王委曲问诘。答曰。汉国有之。彼名蒲图王(本作休屠王祭天金人)因生信。起木塔七重。后佛法始至。具知始末。今更损高。本塔朽坏。育王所统一阎浮提洲。处处立塔。不足可怪。又唐龙朔中有事辽左。行军薛仁贵行至隋主讨辽古地。乃见山像。空旷萧条。绝于行往。问古老。云是先代所现。便图写来京师(具在若函)按西汉与三国地理志。辽东城在鸭绿之外。属汉幽州。高丽圣王未知何君。或云东明圣帝。疑非也。东明以前汉元帝建昭二年即位。成帝鸿嘉壬寅升遐。于时汉亦未见具叶。何得海外陪臣已能识梵书乎。然称佛为蒲图王。似在西汉之时。西域文字或有识之者。故云梵书尔。按古传育王命鬼徒。每于九亿人居地立一塔。如是起八万四千于阎浮界。内藏于巨石中。今处处有现瑞非一。盖真身舍利。<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>难思矣。赞曰</p><p>育王宝塔遍尘寰雨湿云埋藓缬班</p><p>想像当年行路眼几人指点祭神墦</p><p>金官城婆娑石塔</p><p>金官虎溪寺婆娑石塔者。昔此邑为金官国时。世祖首露王之妃许皇后名黄玉。以东汉建武二十四年甲申。自西域阿踰陀国所载来。初公主承二亲之命。泛海将指东。阻波神之怒。不克而还。白父王。父王命载兹塔。乃获利涉。来泊南涯。有绯帆茜旗珠玉之美。今云主浦。初解绫裤于冈上处曰绫岘。茜旗初入海涯曰旗出边。首露王聘迎之。同御国一百五十余年。然于时海东未有创寺奉法之事。盖像教未至。而土人不信伏。故本记无创寺之文。逮第八代铚知王二年壬辰。置寺于其地。又创王后寺(在阿道讷只王之世。法兴王之前)至今奉福焉。兼以镇南倭。具见本国本记。塔方四面五层。其雕镂甚奇。石微赤班色。其质良脆。非此方类也。本草所云点鸡冠血为验者是也。金官国亦名驾洛国。具载本记。赞曰</p><p>载厌绯帆茜旆轻乞灵遮莫海涛惊</p><p>岂徒到岸扶黄玉千古南倭遏怒鲸</p><p>高丽灵塔寺</p><p>僧传云。释普德字智法。前高丽龙冈县人也。详见下本传。常居平壤城有山方。老僧来请讲经。师固辞。不兑。赴讲<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>四十余卷。罢席至城西大宝山岩穴下禅观。有神人来请。宜住此地。乃置锡杖于前。指其地曰。此下有八面七级石塔。掘之果然。因立精舍。曰灵塔寺以居之</p><p>皇龙寺丈六</p><p>新罗第二十四真兴王即位十四年癸酉二月。将筑紫宫于龙宫南。有黄龙现其地。乃改置为佛寺。号黄龙寺。至己丑年周围墙宇。至十七年方毕。未几海南有一巨舫。来泊于河曲县之丝浦(今蔚州谷浦也)捡看有牒文云。西竺阿育王。聚黄铁五万七千斤。黄金三万分(别传云。铁四十万七千斤。金一千两。恐误。或云三万七千斤)。将铸释迦三尊像。未就。载舡泛海而祝曰。愿到有缘国土。成丈六尊容。并载摸样一佛二菩萨像。县吏具状上闻。敕使卜其县之城东爽垲之地。创东竺寺。邀安其三尊。输其金铁于京师。以大建六年甲午三月(寺中记云。癸巳十月十七日)铸成丈六尊像。一鼓而就。重三万五千七斤。入黄金一万一百九十八分。二菩萨入铁一万二千斤。黄金一万一百三十六分。安于皇龙寺。明年像泪流至踵。[泛-之+友]地一尺。大王升遐之兆。或云。像成在真平之世者谬也。别本云。阿育王在西竺大香华国。生佛后一百年间。恨不得<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>真身。敛化金铁若干斤。三度铸成无功。时王之太子独不预斯事。王使诘之。太子奏云。独力非功。曾知不就。王然之。乃载舡泛海。南阎浮提十六大国。五百中国。十千小国。八万聚落。靡不周旋。皆铸不成。最后到新罗国。真兴王铸之于文仍林。像成。相好毕备。阿育此翻无忧。后大德慈藏西学到五台山。感文殊现身。授诀仍嘱云。汝国皇龙寺。乃释迦与迦叶佛讲演之地。宴坐石犹在。故<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>无忧王。聚黄铁若干斤泛海。历一千三百余年。然后乃到而国。成安其寺。盖威缘使然也(与别记所载符同)像成后。东竺寺三尊亦移安寺中。寺记云。真平五年甲辰。金堂造成。善德王代。寺初主真骨<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>师。第二主慈藏国统。次国统惠训。次厢律师云。今兵火已来。大像与二菩萨皆融没。而小释迦犹存焉。赞曰</p><p>尘方何处匪真乡香火<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>最我邦</p><p>不是育王难下手月城来访旧行藏</p><p>皇龙寺九层塔</p><p>新罗第二十七善德王即位五年。贞观十年丙申。慈藏法师西学。乃于五台感文殊授法(详见本传)文殊又云。汝国王是天竺刹利种。王预受佛记。故别有因缘。不同东夷共工之族。然以山川崎崄故。人性粗悖。多信邪见。而时或天神降祸。然有多闻<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>在于国中。是以君臣安泰。万庶和平矣。言已不现。藏知是大圣变化。泣血而退。经由中国太和池边。忽有神人出问。胡为至此。藏答曰。求<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>故。神人<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。又问。汝国有何留难。藏曰。我国北连靺鞨。南接倭人。丽济二国。迭犯封陲。邻寇纵横。是为民梗。神人云。今汝国以女为王。有德而无威。故邻国谋之。宜速归本国。藏问归乡将何为利益乎。神曰。皇龙寺<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>龙。是吾长子。受梵王之命。来护是寺。归本国成九层塔于寺中。邻国降伏。九韩来贡。王祚永安矣。建塔之后设八关会。赦罪人。则外贼不能为害。更为我于京畿南岸置一精庐。共资予福。予亦报之德矣。言已遂奉王而献之。忽隐不现(寺中记云。于终南山圆香禅师处。受建塔因由)贞观十七年癸卯十六日。将唐帝所赐经像<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>币帛而还国。以建塔之事闻于上。善德王议于群臣。群臣曰。请工匠于百济。然后方可。乃以宝帛请于百济。匠名阿非知。受命而来。经营木石。伊于龙春(一云龙树)干蛊。率小匠二百人。初立刹柱之日。匠梦本国百济灭亡之状。匠乃心疑停手。忽大地震动。晦冥之中有一老僧一壮士。自金殿门出。乃立其柱。僧与壮士皆隐不现。匠于是改悔。毕成。其塔刹柱记云。铁盘已上高四十二尺。已下一百八十三尺。慈藏以五台所授舍利百粒分安于柱中。并通度寺戒坛。及大和寺塔。以副池龙之请(大和寺在河曲县南。今蔚州。亦藏师所创也)树塔之后。天地开泰。三韩为一。岂非塔之灵荫乎。后高丽王将谋伐罗。乃曰。新罗有三宝。不可犯也。何谓也。皇龙丈六。并九层塔。与真平王天赐玉带。遂寝其谋。周有九鼎。楚人不敢北窥。此之类也。赞曰</p><p>鬼拱神扶压帝京辉煌金碧动飞甍</p><p>登临何啻九韩伏始觉乾坤特地平</p><p>又海东名贤安弘撰东都成立记云。新罗第二十七代。女王为主。虽有道无威。九韩侵劳苦。龙宫南皇龙寺建九层塔。则邻国之灾可镇。第一层日本。第二层中华。第三层吴越。第四层托罗。第五层鹰游。第六层靺鞨。第七层丹国。第八层女狄。第九层獩[狂-王+百]。又按国史及寺中古记。真兴王癸酉创寺后。善德王代。贞观十九年乙巳。塔初成。三十二孝昭王即位七年。圣历元年戊戌六月。霹雳(寺中古记云圣德王代误也。圣德王代无戊戌)第二十三圣德王代庚申岁。重成。四十八景文王代戊子六月。第二霹雳。同代第三重修。至本朝光宗即位五年癸丑十月。第三霹雳。现宗十三年辛酉。第四重成。又靖宗二年乙亥。第四霹雳。又文宗甲辰年。第五重成。又宪宗末年乙亥。第五霹雳。肃宗丙子。第六重成。又高宗十六年戊戌冬月。西山兵火。塔寺丈六殿宇皆灾</p><p>皇龙寺钟芬皇寺药师奉德寺钟</p><p>新罗第三十五景德大王。以天宝十三甲午铸皇龙寺钟。长一丈三寸。厚九寸入。重四十九万七千五百八十一斤。施主孝贞伊王三毛夫人。匠人里上宅一典。肃宗朝。重成新钟。长六尺八寸。又明年乙未。铸芬皇药师铜像。重三十万六千七百斤。匠人本彼部强古乃未。又舍黄铜一十二万斤。为先考圣德王欲铸巨钟一口。未就而崩。其子惠恭大王干运。以大历庚戌十二月。命有司鸠工徒。乃克成之。安于奉德寺。寺乃孝成王。开元二十六年戊寅。为先考圣德大王奉福所创也。故钟铭曰圣德大王神钟之铭(圣德乃景德之考典光大王也。钟本景德为先考所施之金。故称云圣德。钟尔)朝散大夫前太子司议郎翰林郎金弼粤奉教撰。钟铭文烦不录</p><p>灵妙寺丈六</p><p>善德王创寺。塑像因缘。具载良志法师传。景德王即位二十三年。丈六改金。租二万三千七百硕(良志传作像之初成之费。今两存之)</p><p>四佛山掘佛山万佛山</p><p>竹岭东百许里。有山屹然高峙。真平王九年甲申。忽有一大石。四面方丈。雕四方如来。皆以红纱护之。自天坠其山顶。王闻之命驾瞻敬。遂创寺岩侧。额曰大乘寺。请比丘亡名诵莲经者主寺。洒扫供石。香火不废。号曰亦德山。或曰四佛山。比丘卒既葬。冢上生莲</p><p>又景德王游幸柏栗寺。至山下闻地中有唱佛声。令掘之。得大石。四面刻四方佛。因创寺。以掘佛为号。今讹云掘石 王又闻唐代宗皇帝优崇释氏。命工作五色氍毹。又雕沉檀木与明珠美玉为假山。高丈余。置氍毹之上。山有巉岩怪石涧穴。区隔每一区内。有歌舞伎乐列国山川之状。微风入户。蜂蝶翱翔。燕雀飞舞。隐约视之。莫辨真假。中安万佛。大者逾方寸。小者八九分。其头或巨黍者。或半菽者。螺髻白毛。眉目的攊。相好悉备。只可仿佛。莫得而详。因号万佛山。更镂金玉为流苏幡盖庵罗薝葍花果<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。百步楼阁。台殿堂榭。都大虽微。势皆活动。前有旋绕比丘像千余躯。下列紫金钟三[竺-二+虚]。皆有阁有蒲牢。鲸鱼为撞。有风而钟鸣。则旋绕僧皆仆。拜头至地。隐隐有<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。盖关棙在乎钟也。虽号万佛。其实不可胜记。既成。遣使献之。代宗见之。叹曰。新罗之巧。天造非巧也。乃以九光扇加置岩岫间。因谓之<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>。四月八日。诏两街僧徒。于内道场礼万佛山。命<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>不空念赞密部真诠千遍以庆之。观者皆叹伏其巧。赞曰</p><p>天妆满月四方裁地涌明毫一夜开</p><p>妙手更烦雕万佛真风要使遍三才</p><p>生义寺石弥勒</p><p>善德王时。释生义<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>道中寺。梦有僧引上南山而行。令结草为标。至山之南洞。谓曰。我埋此处。请师出安岭上。既觉。与友人寻所标。至其洞掘地。有石弥勒出。置于三花岭上。善德王十二年甲辰岁。创寺而居。后名生义寺(今讹言性义寺。忠谈师每岁重三重九烹茶献供者。是此尊也)</p><p>兴轮寺壁画普贤</p><p>第五十四景明王时。兴轮寺南门。及左右廊庑灾焚。未修。靖和[弓*几]继二僧募缘将修。贞明七年辛巳五月十五日。帝释降于寺之左经楼。留旬日。殿塔及草树土石皆发异香。五云覆寺。南池鱼龙喜跃跳掷。国人聚观。叹未曾有。玉帛梁稻施积丘山。工匠自来。不日成之。工既毕。天帝将还。二僧白曰。天若欲还宫。请图写圣容。至诚供养。以报天恩。亦乃因兹留影。永镇下方焉。帝曰。我之愿力不如彼普贤菩萨遍垂玄化。画此菩萨像。虔设供养而不废宜矣。二僧奉教。敬画普贤菩萨于壁间。至今犹存其像</p><p>三所观音<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>寺</p><p>新罗古传云。中华天子有宠姬。美艳无双。谓古今图画鲜有如此者。乃命善画者写真(画工传失其名。或云张僧繇。则是吴人也。梁天监中为武陵王国侍郎直秘阁知画事。历右将军吴兴太守。则乃中国梁陈间之天子也。而传云唐帝者。海东人凡诸中国为唐尔。其实未详何代帝王。两存之)其人奉敕图成。误落笔污赤毁于脐下。欲改之而不能。心疑赤志必自天生。功毕献之。帝目之曰。形则逼真矣。其脐下之志乃所内秘。何得知之并写。帝乃震怒。下圆扉将加刑。丞相奏云。所谓伊人其心且直。愿赦宥之。帝曰。彼既贤直。朕昨梦之。像画进不差则宥之。其人乃画十一面观音像呈之。协于所梦。帝于是意解赦之。其人既免。乃与博士芬节约曰。吾闻新罗国敬信佛法。与子乘桴于海。适彼同修佛事。广益仁邦。不亦益乎。遂相与到新罗国。因成此寺大悲像。国人瞻仰。禳祷获福。不可胜记。罗季天成中。正甫崔殷諴久无胤息。诣兹寺大慈前祈祷。有娠而生男。未盈三朔。百济甄萱袭犯京师。城中大溃。殷諴抱儿来告曰。邻兵奄至事急矣。赤子累重不能俱免。若诚大圣之所赐。愿借大慈之力覆养之。令我父子再得相见。涕泣悲惋。三泣而三告之。裹以襁褓。藏诸猊座下。眷眷而去。经半月寇退。来寻之。肌肤如新浴。貌体嬛好。乳香尚痕于口。抱持归养。及壮聪惠过人。是为氶鲁。位至正匡。氶鲁生郎中崔肃。生郎中齐颜焉。自此继嗣不绝。殷諴随敬顺王入本朝为大姓。又统和十年三月。主寺释性泰跪于菩萨前。自言弟子久住兹寺。精勤香火。昼夜匪懈。然以寺无田出香祀无继。将移他所。故来辞尔。是日假寐。梦大圣谓曰。师且住无远离。我以缘化充斋费。僧忻然感寤。遂留不行。后十三日。忽有二人。马载牛驮到于门前。寺僧出问何所而来。曰。我等是金州界人。向有一比丘到我云。我住东京众生寺久矣。欲以四事之难缘化到此。是以敛施邻闾。得米六硕盐四硕。负载而来。僧曰。此寺无人缘化者。尔辈恐闻之误。其人曰。向之比丘率我辈而来。到此神见井边曰。距寺不远。我先往待之。我辈随逐而来。寺僧引入法堂前。其人瞻礼大圣。相谓曰。此缘化比丘之像也。惊叹不已。故所纳米盐追年不废。又一夕寺门有火灾。闾里奔救。升堂见像。不知所在。视之已立在庭中矣。问其出者谁。皆曰不知。乃知大圣灵威也。又大定十三年癸巳间。有僧占崇。得住兹寺。不解文字。性本纯粹。精勤火香。有一僧欲夺其居。诉于衬衣天使曰。兹寺所以国家祈恩奉福之所。宜选会读文疏者主之。天使然之。欲试其人。乃倒授<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>。占崇应手披读如流。天使服膺。退坐房中。俾之再读。崇钳口无言。天使曰。上人良由大圣之所护也。终不夺之。当时与崇同住者。处士金仁夫传诸乡老。笔之于传</p><p>柏栗寺</p><p>鸡林之北岳曰金刚岭。山之阳有柏栗寺。寺有大悲之像一躯。不知作始。而灵异颇着。或云。是中国之神匠塑众生寺像时并造也。谚云。此大圣曾上忉利天。还来入法堂时。所履石上脚迹至今不[利-禾+(亢-几+儿)]。或云。救夫礼郎还来时之所视迹也。天授三年壬辰九月七日。孝昭王奉大玄萨餐之子夫礼郎为国仙。珠履千徒。亲安常尤甚。天授四年(□长寿二年)癸巳暮春之月。领徒游金兰。到北溟之境。被狄贼所掠而去。门客皆失措而还。独安常追迹之。是三月十一日也。大王闻之。惊骇不胜曰。先君得神笛传于朕躬。今与玄琴藏在内库。困何国仙忽为贼俘。为之奈何(琴笛事具载别传)时有瑞云覆天尊库。王又震惧使检之。库内失琴笛二宝。乃曰。朕何不予。昨失国仙。又亡琴笛。乃囚司库吏金贞高等五人。四月。募于国曰。得琴笛者赏之一岁租。五月十五日郎二亲就柏栗寺大悲像前禋祈累夕。忽香卓上得琴笛二宝。而郎常二人来到于像后。二亲颠喜。问其所由来。郎曰。予自被掠为彼国大都仇罗家之牧子。放牧于大乌罗尼野(一本作都仇家奴牧于大磨之野)忽有一僧容仪端正。手携琴笛来慰曰。忆桑梓乎。予不觉跪于前曰。眷恋君亲。何论其极。僧曰。然则宜从我来。遂率至海壖。又与安常会。乃批笛为两分。与二人各乘一只。自乘其琴。泛泛归来。俄然至此矣。于是具事驰闻。王大惊使迎。郎随琴笛入内。施铸金银五器二副各重五十两。摩衲袈裟五领。大绡三千匹。田一万顷纳于寺。用答慈庥焉。大赦国内。赐人爵三级。复民租三年。主寺僧移住奉圣。封郎为大角干(罗之冡宰爵名)父大玄阿餐。为大大角干。母龙宝夫人为沙梁部镜井宫主。安常师为大统。司库五人皆免。赐爵各五级。六月十二日。有彗星孛于东方。十七日。又孛于西方。日官奏曰。不封爵于琴笛之瑞。于是册号神笛为万万波波息。彗乃灭。后多灵异。文烦不载。世谓安常为俊永郎徒。不之审也。永郎之徒。唯真才繁完等知名。皆亦不测人也(详见别传)</p><p>敏藏寺</p><p>禺金里贫女宝开有子名长春。从海贾而征。久无音耗。其母就敏藏寺(寺乃敏藏角干舍家为寺)观音前克祈七日。而长春忽至。问其由绪。曰。海中风飘舶坏。同侣皆不免。予乘只板归泊吴涯。吴人收之俾耕于野。有异僧如乡里来。吊慰勤勤。率我同行。前有深渠。僧掖我跳之。昏昏间如闻乡音与哭泣之声。见之乃已届此矣。日晡时离吴至此才戌初。即天宝四年乙酉四月八日也。景德王闻之。施田于寺。又纳财币焉</p><p>前后所将舍利</p><p>国史云。真兴王大清三年己巳。梁使沉湖送舍利若于粒。善德王代贞观十七年癸卯。慈藏法师所将佛头骨佛牙<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>百粒。佛所著绯罗金点袈裟一领。其舍利分为三。一分在皇龙塔。一分在大和塔。一分并袈裟在通度寺戒坛。其余未详所在。坛有二级。上级之中安石盖如覆镬。谚云。昔在本朝相次有二廉使。礼坛举石镬而敬之。前感修蟒在函中。后见巨蟾蹲石腹。自此不敢举之。近有上将军金公利生庾侍郎硕。以高庙朝受旨指挥江东。仗节到寺。拟欲举石瞻礼。寺僧以往事难之。二公令军士固举之。内有小石函。函袭之中贮以琉璃筒。筒中舍利只四粒。传示瞻敬。筒有小伤裂处。于是庾公适蓄一水精函子。遂奉施兼藏焉。识之以记移御江都。四年乙未岁也。古记称百枚分藏三处。今唯四尔。既隐现随人。多小不足怪也。又谚云。其皇龙寺塔灾之日。石镬之东面始有大班。至今犹然。即大辽应历三年癸丑岁也。本朝光庙五载也。塔之第三灾也。曹溪无衣子留诗云。闻道皇龙灾塔日。连烧一面示无间。是也。自至元甲子已来大朝使佐本国。皇华争来瞻礼。四方云水。辐凑来参。或举不举。真身四枚外。变身舍利。碎如砂砾。现于[获-禾+石]外。而异香郁烈。弥日不歇者比比有之。此末季一方之奇事也。唐大中五年辛未。入朝使元弘所将佛牙(今未详所在。新罗文圣王代)后唐同光元年癸未。本朝太祖即位六年。入朝使尹质所将五百罗汉像。今在北崇山神光寺。大宋宣和元年己卯亥(睿庙十五年)入贡使郑克永李之美等所将佛牙。今内殿置奉者是也。相传云。昔义湘法师入唐。到终南山至相寺智俨尊者处。邻有宣律师。常受天供。每斋时天厨送食。一日律师请湘公斋。湘至坐定既久。天供过时不至。湘乃空钵而归。天使乃至。律师问今日何故迟。天使曰。满洞有神兵遮拥。不能得入。于是律师知湘公有神卫。乃服其道胜。仍留其供具。翌日又邀俨湘二师斋。具陈其由。湘公<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>谓宣曰。师既被天帝所敬。尝闻帝释宫有佛四十齿之一牙。为我等辈请下人间。为福如何。律师后与天使传其意于上帝。帝限七日送与。湘公致敬讫。邀安大内。后至大宋徽宗朝。崇奉左道。时国人传图谶曰。金人败国。黄巾之徒讽。日官奏曰。金人者佛教之谓也。将不利于国家。议将破灭释氏。坑诸沙门。焚烧经典。而别造小舡。载佛牙泛于大海。任<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>流泊。于时适有本朝使者至宋。闻其事。以天花茸五十领。纻布三百匹。行赂于押舡内史。密授佛牙。但流空舡。使臣等既得佛牙来奏。于是睿宗大喜。奉安于十员殿左掖小殿。常钥匙殿门。施香灯于外。每亲幸日开殿瞻敬。至壬辰岁移御次。内官匆遽中忘不收捡。至丙申四月。御愿堂神孝寺释蕰光请致敬佛牙。闻于上。敕令内臣遍捡宫中。无得也。时柏台侍御史崔冲命薜伸急征于诸谒者房。皆未知所措。内臣金承老奏曰。壬辰年移御时。紫门日记推看从之。记云。入内侍大府卿李白全受佛牙函云。召李诘之。对曰。请归家更寻私记。到家捡看。得左番谒者金瑞龙佛牙函准受记来呈。召问瑞龙。无辞以对。又以金承老所奏云壬辰。至今丙申五年间。御佛堂及景灵殿上守等囚禁问。当依违未决。隔三日。夜中瑞龙家园墙里有投掷物声。以火捡看。乃佛牙函也。函本内一重沉香合。次重纯金合。次外重白银函。次外重琉璃函。次外重螺钿函。各幅子如之。今但琉璃函尔。喜得之入达于内。有司议。金瑞龙及两殿上守皆诛。晋阳府奏云。因佛事不合多伤人。皆免之。更敕十员殿中庭特造佛牙殿安之。令将士守之。择吉日。请神孝寺上房蕰光。领徒三十人。入内设斋敬之。其日入直承宣崔弘上将军崔公衍李令长内侍茶房等侍立于殿庭。依次顶戴敬之。佛牙区穴间。舍利不知数。晋阳府以白银合贮而安之。时主上谓臣下曰。朕自亡佛牙已来。自生四疑。一疑天宫七日限满而上天矣。二疑国乱如此。牙既神物。且移有缘无事之邦矣。三疑贪财小人。盗取函幅。弃之沟壑矣。四疑盗取珍利。而无计自露。匿藏家中矣。今第四疑当之矣。乃放声大哭。满庭皆洒涕。献寿至有炼顶烧臂者不可胜计。得此实录于当时内殿焚修前只。林寺大禅师觉猷言亲所眼见。使予录之。又至庚午出都之乱。颠沛之甚过于壬辰。十员殿监主禅师心鉴亡身佩持。获兑于贼难。达于大内。大赏其功。移授名刹。今住冰山寺。是亦亲闻于彼。真兴王代天嘉六年乙酉。陈使刘思与释明观。载送<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>论一千七百余卷。贞观十七年。慈藏法师载三藏四百余函来。安于通度寺。兴德王代大和元年丁未。入学僧高丽释丘德赍佛经若干函来。王与诸寺僧徒出迎于兴轮寺前路。大中五年。入朝使元弘赍佛经若干轴来。罗末普耀禅师再至吴越。载<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>来。即海龙王寺开山祖也。大宋元祐甲戌。有人真赞云。伟哉初祖。巍乎真容。再至吴越。大藏成功。赐衘普耀。凤诏四封。若问其德。白月清风。又大定中。汉南管记彭祖逖留诗云。水云兰若住空王。况是神龙稳一场。毕竟名蓝谁得似。初传像教自南方。有跋云。昔普耀禅师始求大藏于南越。洎旋返次。海风忽起。扁舟出没于波间。师即言曰。意者神龙欲留经耶。遂咒愿乃诚兼奉龙归焉。于是风静波息。既得还国。遍赏山川。求可以安邀处。至此山忽见瑞云起于山上。乃与高弟弘庆经营莲社。然则像教之东渐实始乎此。汉南管记彭祖逖题寺。有龙王堂。颇多灵异。乃当时随经而来止者也。至今犹存。又天成三年戊子。默和尚入唐。亦载大藏经来。本朝睿庙时。慧照国师奉诏西学。市辽本大藏三部而来。一本今在定惠寺(海印寺有一本许参政宅有一本)大安二年。本朝宣宗代。祐世僧统义天入宋。多将天台教观而来。此外方册所不载。高僧信士。往来所赍。不可详记。大教东渐。洋洋乎庆矣哉。赞曰</p><p>华月夷风尚隔烟鹿园鹤树二千年</p><p>流传海外真堪贺东震西干共一天</p><p>按此录义湘传云。永徽初。入唐谒智俨。然据浮石本碑。湘武德八年生。丱岁出家。永徽元年庚戌。与元晓同伴欲西入。至高丽有难而回。至龙朔元年辛酉入唐。就学于智俨。总章元年。俨迁化。咸亨二年。湘来还新罗。长安二年壬寅。示灭。年七十八。则疑与俨公斋于宣律师处。请天宫佛牙。在辛酉至戊辰七八年间也。本朝高庙入江都壬辰年。疑天宫七日限满者误矣。忉利天一日夜当人间一百岁。且从湘公初入唐辛酉。计至高庙壬辰。六百九十三岁也。至庚子年。始满七百年。而七日限已满矣。至出都至元七年庚午。则七百三十年。若如天言。而七日后还天宫。则禅师心鉴出都时。佩持出献者。恐非真佛牙也。于是年春出都前。于大内集诸宗名德。乞<a href=\"/sheli/fo/36639.html\" class=\"keylink\" target=\"_blank\">佛牙舍利</a>。精勤虽切。而不得一枚。则七日限满上天者几矣。二十一年甲申。修补国清寺金塔。国主与庄穆王后幸妙觉寺。集众庆赞讫。右佛牙与洛山水精<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>如意珠。君臣与大众皆瞻奉顶戴。后并纳金塔内。予亦预斯会。而亲见所谓佛牙者。长三寸许。而无舍利焉无极记</p><p>弥勒仙花末尸郎真慈师</p><p>第二十四真兴王。姓金氏。名彡夌宗一作深夌宗。以梁大同六年庚申即位。慕伯父法兴之志。一心奉佛。广兴佛寺。度人为僧尼。又天性风味多尚神仙。择人家娘子美艳者。捧为原花要。聚徒选士。教之以孝悌忠信。亦理国之大要也。乃取南毛娘峧贞娘两花。聚徒三四百人。峧贞者嫉妒毛娘。多置酒饮毛娘。至醉潜舁去北川中。举石埋杀之。其徒罔知去处。悲泣而散。有人知其谋者。作歌诱街巷小童唱于街。其徒闻之。寻得其尸于北川中。乃杀峧贞娘。于是大王下令。废原花累年。王又念欲兴邦国须先风月道。更下令选良家男子有德<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。改为花娘。始奉薛原郎为国仙。此花郎国仙之始。故竖碑于溟州。自此使人悛恶更善。上敬下顺。五常六艺。三师六正。广行于代(国史。真智王大建八年庚申始奉花郎。恐史传乃误)及真智王代。有兴轮寺僧真慈(一作贞慈也)每就堂主弥勒像前发原誓言。愿我大圣化作花郎。出现于世。我常亲近睟容。奉以□周旋。其诚恳至祷之情。日盆弥笃。一夕梦有僧。谓曰。汝往熊川(今公州)水源寺。得见弥勒仙花也。慈觉而惊喜。寻其寺行十日程。一步一礼。及到其寺。门外有一郎。侬纤不爽。盼倩而迎。引入小门。邀致宾轩。慈且升且揖曰。郎君素昧平昔。何见待殷勤如此。郎曰。我亦京师人也。见师高蹈远届。劳来之尔。俄而出门。不知所在。慈谓偶尔。不甚异之。但与寺僧叙曩昔之梦兴来之之意。且曰。暂寓下榻。欲待弥勒仙花何如。寺僧欺其情荡然。而见其勤恪。乃曰。此去南邻有千山。自古贤哲寓止。多有冥感。盍归彼居。慈从之至于山下。山灵变老人出迎曰。到此奚为。答曰。愿见弥勒仙花尔。老人曰。向于水源寺之门外。已见弥勒仙花。更来何求。慈闻即惊汗。骤还本寺。居月余。真智王闻之。征诏问其由。曰郎既自称京师人。圣不虚言。盍觅城中乎。慈奉宸旨会徒众。遍于闾阎间物色求之。有一小郎子。断红齐具。眉彩秀丽。灵妙寺之东北路傍树下婆娑而游。慈迓之惊曰。此弥勒仙花也。乃就而问曰。郎家何在。愿闻芳氏。郎答曰。我名未尸。儿孩时爷娘俱没。未知何姓。于是肩舆而入见于王。王敬爱之。奉为国仙。其和睦子弟。礼义风教。不类于常。风流耀世几七年。忽亡所在。慈哀坏殆甚。然饮沐慈泽。昵承清化。能自悔改。精修为道。晚年亦不知所终。说者曰。未与弥声相近。尸与力形相类。乃托其近似而相谜也。大圣不独感慈之诚款也。抑有缘于兹土。故比比示现焉。至今国人称神仙曰弥勒仙花。凡有媒系于人者曰未尸。皆慈氏之遗风也。路傍树至今名见郎又俚言似如树(一作印如树)赞曰</p><p>寻芳一步一瞻风到处栽培一样功</p><p>幂地春归无觅处谁知顷刻上林红</p><p>南白月二圣努肹夫得怛怛朴朴</p><p>白月山两圣成道记云。白月山在新罗仇史郡之北(古之屈自郡今义安郡)峰峦奇秀。延袤数百里。真巨镇也。古老相传云。昔唐皇帝尝凿一池。每月望前。月色滉朗中有一山岩石。如师子隐映花间之影。现于池中。上命画工图其状。遣使搜访天下。至海东见此山有大师子岩。山之西南二步许有三山。其名花山(其山一体三首。故云三山)与图相近。然未知真伪。以只履悬于师子岩之顶。使还奏闻。履影亦现池。帝乃异之。赐名曰白月山(望前白月影现。故以名之)然后池中无影。山之东南三千步许有仙川村。村有二人。其一曰努肹夫得(一作等)父名月藏。母味胜。其一曰怛怛朴朴。父名修梵。母名梵摩(乡传云雉山村。误矣。二士之名方言。二家各以二士心行腾腾苦节二义名之尔)皆风骨不凡。有域外遐想。而相与友善。年皆弱冠。往依村之东北岭外法积房。剃发为僧。未几闻西南雉山村法宗谷僧道村有古寺可以栖真。同往大佛田小佛田二洞各居焉。夫得寓怀真庵。一云壤寺(今怀真洞有古寺基。是也)朴朴居琉璃光寺(今梨山上有寺基。是也)皆挈妻子而居。经营产业。交相来往。栖神安养。方外之志。未常暂废。观身世<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。因相谓曰。腴田美岁良利也。不如衣食之应念而至。自然得饱暖也。妇女屋宅情好也。不如莲池花藏千圣共游。鹦鹉孔雀以相娱也。况学佛当<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。修真必得真。今我等既落彩为僧。当脱略缠结。成无上道。岂宜汨没风尘。与俗辈无异也。遂唾谢人间世。将隐于深谷。夜梦白毫光自西而至。光中垂金色臂。摩二人顶。及觉说梦。与之符同。皆感叹久之。遂入白月山无等谷(今南薮洞也)朴朴师占北岭师子岩。作板屋八尺房而居。故云板房。夫得师占东岭磊石下有水处。亦成方丈而居焉。故云磊房(乡传云。夫得处山北□□洞。今复名。朴朴居山南法精洞磊房。与此相反。以今验之。乡传误矣)各庵而居。夫得勤求弥勒。朴朴礼念弥陀。未盈三载。景龙三年己酉四月八日。圣德王即位八年也。日将夕。有一娘子年几二十。姿仪殊妙。气袭兰麝。俄然到北庵(乡传云南庵)请寄宿焉。因投词曰。行途日落千山暮。路隔城遥绝四邻。今日欲投庵下宿。慈悲和尚莫生嗔。朴朴曰。兰若护净为务。非尔所取近行矣。无滞此处。闭门而入(记云。我百念灰 今。无以血襄见试)娘归南庵(传曰北庵)又请如前。夫得曰。汝从何处犯夜而来。娘答曰。湛然与大虚同体。何有往来。但闻贤士志愿深重。<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>高坚。将欲助成菩提□。因投一偈曰。日暮千山路。行行绝四邻。竹松阴转邃。溪洞响犹新。乞宿非迷路。尊师欲指津。愿惟从我请。且莫问何人。师闻之惊骇谓曰。此地非妇女相污。然随顺众生。亦菩萨行之一也。况穷谷夜暗。其可忽视欤。乃迎揖庵中而置之。至夜清心砺操。微灯半壁。谓念厌厌。及夜将艾。娘呼曰。予不幸适有产忧。乞和尚排备苫草。夫得悲矜莫逆。烛火殷勤。娘既产。又请浴。弩肹惭惧交心。然哀悯之情有加无已。又备盆槽。坐娘于中。薪汤以浴之。既而槽中之水香气郁烈。变成金液。弩肹大骇。娘曰。吾师亦宜浴此。肹勉强从之。忽觉精神爽凉。肌肤金色。视其傍忽生一莲台。娘劝之坐。因谓曰。我是观音菩萨。来助大师。成大菩提矣。言讫不现。朴朴谓肹今夜必染戒。将归听之。既至。见肹坐莲台。作弥勒尊像放光明。身彩檀金。不觉扣头而礼曰。何得至于此乎。肹具叙其由。朴朴叹曰。我乃障重。幸逢大圣而反不遇。大德至仁。先吾着鞭。愿无忘昔日之契。事须同摄。肹曰。槽有余液。但可浴之。朴朴又浴。亦如前成无量寿。二尊相对俨然。山下村民闻之。竞来瞻仰。叹曰。希有希有。二圣为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>要。全身蹑云而逝。天宝十四年乙未。新罗景德王即位(古记云。天鉴二十四年乙未法兴即位。何先后倒错之甚如此)闻斯事。以丁酉岁遣使创大伽蓝。号白月山南寺。广德二年(古记云大历元年。亦误)甲辰七月十五日。寺成。更塑弥勒尊像。安于金堂。额曰。现身成道弥勒之殿。又塑弥陀像安于讲堂。余液不足。涂浴未周。故弥陀像亦有斑驳之痕。额曰。现身成道无量寿殿。议曰。娘可谓应以妇女身摄化者也。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>摩耶夫人善知识。寄十一地生佛如幻<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>门。今娘之桷产微意在此。观其投词。哀婉可爱。宛转有天仙之趣。呜呼。使娘婆不解随顺众生语言陀罗尼。其能若是乎。其末联宜云。清风一榻莫予嗔。然不尔云者。盖不欲同乎流俗语尔。赞曰</p><p>滴翠岩前剥啄声何人日暮扣云扃</p><p>南庵且近宜寻去莫踏苍苔污我庭</p><p>右北庵</p><p>谷暗何归已暝烟南窗有蕈且流连</p><p>夜阑百八深深转只恐成喧恼客眠</p><p>右南庵</p><p>十里松阴一径迷访僧来试夜招提</p><p>三槽浴罢天将晓生下双儿掷向西</p><p>右圣娘</p><p>芬皇寺千手大悲盲儿得眼</p><p>景德王代。汉岐里女希明之儿。生五稔而忽盲。一日其母抱儿诣芬皇寺。左殿北壁画千手大悲。前令儿作歌祷之。遂得明。其词曰</p><p>膝肹古召[方*尔] 二尸掌音毛乎支内良 千手观音叱前良中 祈以支白屋尸置内乎多 千隐手 叱千隐目肹 一等下叱放一等肹除恶支 二于万隐吾罗一等沙隐赐以古只内乎叱等邪阿邪也 吾良遗知支赐尸等焉 放冬矣用屋尸慈悲也根古</p><p>赞曰</p><p>竹马葱笙戏陌尘一朝双碧失瞳人</p><p>不因大士回慈眼虚度杨花几社春</p><p>洛山二大圣观音正趣调信</p><p>昔义湘法师始自唐来还。闻大悲真身住此海边崛内。故因名洛山。盖西域宝陀洛伽山。此云小白华。乃白衣大士真身住处。故借此名之。斋戒七日。浮座具晨水上。龙天八部侍从引入崛内参礼。空中出水精念珠一贯给之。湘领受而退。东海龙亦献如意宝珠一颗。师捧出。更斋七日。乃见真容。谓曰。于座上山顶双竹涌生。当其地作殿宜矣。师闻之出崛。果有竹从地涌出。乃作金堂塑像而安之。圆容丽质。俨若天生。其竹还没。方知正是真身住也。因名其寺曰洛山。师以所受二珠镇安于圣殿而去。后有元晓法师。继踵而来。欲求瞻礼初至于南郊水田中。有一白衣女人刈稻。师戏请其禾。女以稻荒戏答之。又行至桥下。一女洗月水帛。师乞水。女酌其秽水献之。师覆弃之。更酌川水而饮之。时野中松上有一青鸟。呼曰休醍□和尚。忽隐不现。其松下有一只脱鞋。师既到寺。观音座下又有前所见脱鞋一只。方知前所遇圣女乃真身也。故时人谓之观音松。师欲入圣崛更睹真容。风浪大作。不得入而去。后有崛山祖师梵日。太和年中入唐。到明州开国寺。有一沙弥截左耳在众僧之末。与师言曰。吾亦乡人也。家在溟州界翼岭县德耆坊。师他日若还本国。须成吾舍。既而遍游丛席。得法于盐官(事具在本传)以会昌七年丁卯还国。先创崛山寺而传教。大中十二年戊寅二月十五日。夜梦昔所见沙弥到窗下。曰。昔在明州开国寺。与师有约。既蒙见诺。何其晚也。祖师惊觉。押数十人到翼岭境。寻访其居。有一女居洛山下村。问其名。曰德耆。女有一子年才八岁。常出游于村南石桥边。告其母曰。吾所与游者有金色童子。母以告于师。师惊喜。与其子寻所游桥下。水中有一石佛。舁出之。截左耳类前所见沙弥。即正趣菩萨之像也。乃作简子卜其营构之地。洛山上方吉。乃作殿三间安其像(古本载梵日事在前。相晓二师在后。然按湘晓二师尔□于高宗之代。梵日在于会去之后。相昌一百七十余岁。故今前却而编次之。或云梵日为相之门人。谬妄也)后百余年。野火连延到此山。唯二圣殿独免其灾。余皆煨烬。及西山大兵已来。癸丑甲寅年间。二圣真容及二宝珠移入襄州城。大兵来攻甚急。城将陷。时住持禅师阿行(古名希玄)以银合盛二珠。佩持将逃逸。寺奴名乞升夺取。深埋于地。誓曰。我若不免死于兵。则二宝珠终不现于人间。人无知者。我若不死。当奉二宝献于邦家矣。甲寅十月二十二日城陷。阿行不免。而乞升获免。兵退后掘出。纳于溟州道监仓使。时郎中李禄绥为监仓使。受而藏于监仓库中。每交代传受。至戊午十一月。本业老宿祇林寺住持大禅师觉猷奏曰。洛山二珠。国家神宝。襄州城陷时。寺奴乞升埋于城中。兵退取纳监仓使。藏在溟州营库中。今溟州城殆不能守矣。宜输安御府。主上允可。发夜别抄十人率乞升。取于溟州城。入安于内府。时使介十人各赐银一斤米五石。昔新罗为京师时。有世逵寺(今兴教寺也)之庄舍。在溟州奈李郡(按地理志。溟州无奈李郡。唯有奈城郡。本奈生郡。今宁越。又牛首州领县有奈灵郡。本奈巳郡。今刚州。牛首州今春州今言奈李郡。未知孰是)本寺遗僧调信为知庄。信到庄上。悦□守金昕公之女。惑之深。屡就洛山大悲前。潜祈得幸。方数年间。其女已有配矣。又往堂前怨大悲之不遂已。哀泣至日暮。情思倦惫。俄成假寝。忽梦金氏娘容豫入门。粲然启齿而谓曰。儿早识上人于半面。心乎爱矣。未尝暂忘。迫于父母之命强从人矣。今愿为同穴之友故来尔信乃颠喜。同归乡里。计活四十余霜。有儿息五。家徒四壁。藜藿不给。遂乃落魄扶携。糊其口于四方。如是十年。周流草野。悬鹑百结。亦不掩体。适过溟州蟹县岭。大儿十五岁者忽餧死。痛哭收瘗于道。从率余四口到羽曲县(今羽县也)结茅于路傍而舍。夫妇老且病。饥不能兴。十岁女儿巡乞。乃为里熬所噬。号痛卧于前。父母为之歔欷。泣下数行。妇乃□涩拭涕。仓卒而语曰。予之始遇君也。色美年芳。衣裤稠鲜。一味之甘得与子分之。数尺之暖得与子共之。出处五十年。情钟莫逆。恩爱绸缪。可谓厚缘。自比年来。衰病岁益深。饥寒日益迫。傍舍壶浆人不容乞。千门之耻重似丘山。儿寒儿饥未遑计补。何暇有爱悦夫妇之心哉。红颜巧笑草上之露。约束芝兰柳絮飘风。君有我而为累。我为君而足忧。细思昔日之欢。适为忧患所阶。君乎予乎奚至此极。与其众鸟之同餧。焉知只鸾之有镜。寒弃炎附。情所不堪。然而行止非人。离合有数。请从此辞。信闻之大喜。各分二儿将行。女曰。我向桑梓。君其南矣。方分手进途而形开。残灯翳吐。夜色将阑。及旦鬓发尽白。惘惘然殊无人世意。已厌劳生。如饫百年辛苦。贪染之心洒然冰释。于是惭对圣容。忏涤无已。归拨蟹岘所埋儿冢。乃石弥勒也。灌洗奉安于邻寺。还京师免庄任。倾私财创<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>寺。勤修白业。后莫知所终。议曰。读此传。掩卷而追绎之。何必信师之梦为然。今皆知其人世之为乐。欣欣然役役然。特未觉尔。乃作词诫之曰</p><p>快适须臾意已闲暗从愁里老仓颜</p><p>不须更待黄梁熟方悟劳生一梦间</p><p>治身臧否先诚意鳏梦蛾眉贼梦藏</p><p>何似秋来清夜梦时时合眼到清凉</p><p>鱼山佛彰</p><p>古记云。万鱼寺者古之慈成山也。又阿耶斯山(当作摩耶斯。此云鱼也)。傍有呵啰国。昔天卵下于海边。作人御国。即首露王。当此时。境内有玉池。池有毒龙焉。万鱼山有五罗刹女。往来交通。故时降电雨。历四年五谷不成。王咒禁不能。稽首请佛说法。然后罗刹女受<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>而无后害。故东海鱼龙遂化为满洞之石。各有钟磬之声(已上古记)又按。大定十二年庚子。即明宗十一年也。始创万鱼寺。栋梁宝林状奏所称山中奇异之迹。与北天竺诃罗国佛影事符同者有三。一。山之侧近地梁州界玉池。亦毒龙所蛰是也。二。有时自江边云气始出来到山顶。云中有音乐之声是也。三。影之西北有盘石。常贮水不绝云。是佛浣濯袈裟之地是也。已上皆宝林之说。今亲来瞻礼。亦乃彰彰可敬信者有二。洞中之石凡三分之二皆有金玉之声是一也。远瞻即现。近瞻不见。或见觅等是一也。北天之文具录于后。可函观佛<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>经第七卷云。佛到耶干诃罗国。古仙山薝葍花林毒龙之侧。青莲花泉北罗刹穴中阿那斯山南。尔时彼穴有五罗刹。化作女龙。与毒龙通。龙复降雹。罗刹乱行。饥馑疾疫已。历四年。王惊惧。祷祀神祇。于事无益。时有梵志。聪明多智。白言大王伽毗罗净饭王子。今者成道号释迦。文王闻是语。心大欢喜。向佛作礼曰。云何今日佛日已兴。不到此国。尔时如来敕诸比丘。得六<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>者。随从佛后。受那干诃罗王弗婆浮提请。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>顶放光明。化作一万诸天化佛。往至彼国。尔时龙王及罗刹女五体投地求佛<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。佛即为说三归五戒。龙王闻已长跪合掌。劝请世尊常住此间。佛若不在。我有恶心。无由得成阿耨菩提。时梵天王复来礼佛。请婆伽婆为未来世诸众生。故莫独偏为此一小龙。百千梵王皆作是请。时龙王出七宝台。奉上如来。佛告龙王。不须此台。汝今但以罗刹石窟持以施我。龙欢喜(云云)。尔时如来安慰龙王。我受汝请。坐汝窟中。经千五百岁。佛涌身入石。犹如明镜。人见面像。诸龙皆现。佛在石内。映现于外。尔时诸龙合掌欢喜不出其地。常见佛日。尔时世尊结伽趺坐在石壁内。众生见时。远望即现。近则不现诸天供养佛影。影亦说法。又云。佛蹴岩石之上。即便成金玉之声。高僧传云。惠远闻天竺有佛影。昔为龙所留之影。在北天竺月支国那竭呵城南古仙人石室中(云云)。又法现。西域传云。至那竭国界。那竭城南半由旬有石室。博山西南面佛留影。此中去十余步观之。如佛真形。光明炳着。转远转微。诸国王遣工摹写。莫能仿佛。国人传云。贤劫千佛皆当于此留影。影之西百步许有佛在时剃发剪爪之地(云云)。星函西域记第二卷云。昔如来在世之时。此龙为牧牛之士。供王乳酪。进奏失宜。既获谴啧。心怀恚恨。以金钱买花供养。授记宰堵婆。愿为恶龙破国害王。特趣石壁投身而死。遂居此窟为大龙王。适起恶心。如来鉴此。变神通力而来至此。龙见佛毒心遂止。受不杀戒。因请如来常居此穴。常受我供。佛言。吾将寂灭为汝留影。汝若毒忿。常观吾影。毒心当止。摄神独入石室。远望即现。近则不现。又令石上蹴为七宝(云云)。已上皆经文大略如此。海东人名此山为阿那斯。当作摩那斯。此[番*(匕/匕)]为鱼。盖取彼北天事而称之尔</p><p>台山五万真身</p><p>按山中古传。此山之署名真圣住处者。始自慈藏法师。初法师欲见中国五台山文殊真身。以善德王代贞观十年丙申(唐僧传云十二年今从三国本史)入唐。初至中国太和池边石文殊处。虔祈七日。忽梦大圣授四句偈。觉而记忆。然皆梵语。罔然不解。明旦忽有一僧。将绯罗金点袈裟一领。佛钵一具。佛头骨一片到于师边。问何以无聊。师答以梦所受四句偈。梵音不解为辞。僧译之云。呵啰婆佐曩。是曰了知一切法。达[口*((上/示)*聿)]陊佉嘢。云<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>无所有。曩伽呬伽曩。云如是解法性。达[口*((上/示)*聿)]卢舍那。云即见卢舍那。仍以所将袈裟等付而嘱云。此是本师释迦尊之道具也。汝善护持。又曰。汝本国艮方溟州界有五台山。一万文殊常住在彼。汝往见之。言已不现。遍寻灵迹。将欲东还太和池龙现身请斋供养七日。乃告云。昔之传偈老僧是真文殊也。亦有叮嘱创寺立塔之事。具载别传。师以贞观十七年来到此山。欲睹真身三日。晦阴不果而还。复住元宁寺。乃见文殊。云至葛蟠处。今净岩寺是(亦载别传)后有头陀信义。乃梵日之门人也。来寻藏师憩息之地。创庵而居。信义既卒。庵亦久废。有水多寺长老。有缘重创而居。今月精寺是也。藏师之返新罗。净神大王太子宝川孝明二昆弟(按国史。新罗无净神宝川孝明三父子明文。然此记下文云。神龙元年开土立寺。则神龙乃圣德王即位四年乙巳也。王名兴光。本名隆基。神文之第二子也。圣德之兄孝照名理恭。一作洪。亦神文之子。神文政明字日照则净神恐政明神文之讹也。孝明乃孝照一作昭之讹也。记云孝明即位。而神龙年开土立寺云者。亦不细详言之尔。神龙年立寺者乃圣德王也)到河西府(今溟州亦有河西郡是也。一作河曲县。今蔚州非是也)世献角干之家留一宿。翌日过大领。各岭千徒到省乌坪。游览累日。忽一夕昆弟二人密约方外之志。不令人知。逃隐入五台山(古记云。太和元年戊申八月初王隐山中。恐此文大误。按孝照一作昭。以天授三年壬辰即立。时年十六。长安二年壬寅崩。寿二十六。圣德以是年即位。年二十二。若曰太和元年戊申。则先于孝照即位甲辰已过四十五岁。乃太宗文武王之世也。以此知此文为误。故不取之)侍卫不知所归。于是还国。二太子到山中。青莲忽开地上。兄太子结庵而止住。是日宝川庵向东。北行六百余步。北台南麓亦有青莲开处。弟太子孝明又结庵而止。各勤修业。一日同上五峰瞻礼。次东台满月山。有一万观音真身。现在南台麒麟山。八大菩萨为首一万地藏。西台长岭山无量寿如来为首一万大势至。北台象王山释迦如来为首五百大阿罗汉。中台风庐山亦名地卢山。毗卢遮那为首一万文殊。如是五万真身一一瞻礼。每日寅朝。文殊大圣到真如院今上院。变现三十六种形。或时现佛面形。或作宝珠形。或作佛眼形。或作佛手形。或作宝塔形。或万佛头形。或作万灯形。或作金桥形。或作金鼓形。或作金钟形。或作神通形。或作金楼形。或作金轮形。或作金刚柝形。或作金瓮形。或作金钿形。或五色光明形。或五色圆光形。或吉祥草形。或青莲花形。或作金田形。或作银田形。或作佛足形。或作雷电形。或来涌出形。或地神涌出形。或作金凤形。或作金乌形。或马产师子形。或鸡产凤形。或作青龙形。或作白象形。或作鹊鸟形。或牛产师子形。或作游猪形。或作青蛇形。二公每汲洞中水煎茶献供。至夜各庵<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。净神王之弟与王争位。国人废之。遣将军四人到山迎之。先到孝明庵前呼万岁。时有五色云七日垂覆。国人寻云而毕至。排列卤薄。将邀两太子而归。宝川哭泣以辞。乃奉孝明归即位。理国有年(记云在位二十余年。盖崩年寿二十六之讹也。在位但十年尔。又神文之弟争位事。国史无文。未详)以神龙元年(乃唐中宗复位之年圣德即位四年也)乙巳三月初四日始改创真如院。大王亲率百寮到山。营构殿堂。并塑泥像文殊大圣安于堂中。以知识灵卞等五员长转华严经。仍结为华严社。长年供费。每岁春秋。各给近山州县仓租一百石净油一石。以为恒规。自院西行六千步至牟尼岾。古伊岘外柴地十五结。栗枝六结。坐位二结。创置庄舍焉。宝川常汲服其灵洞之水。故晚年肉身飞空。到流沙江外蔚珍国掌天窟停止。诵随求陀罗尼。日夕为课。窟神现身白云。我为窟神已二千年。今日始闻随求真诠。请受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>。既受已。翌日窟亦无形。宝川惊异。留二十日乃还五台山神圣窟。又修真五十年。忉利天神三时听法。净居天众烹茶供献。四十圣腾空十尺。常时护卫。所持锡杖一日三时作声。绕房三匝。用此为钟磬。随时修业。文殊或灌水宝川顶。为授成道记莂。川将圆寂之日。留记后来山中所行辅益邦家之事云。此山乃白头山之大脉。各台真身常住之地。青在东台。北角下北台南麓之末。宜置观音房。安圆像观音及青地画一万观音像。福田五员昼读八卷金经仁王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>千手咒。夜念观音礼忏。称名圆通社。赤任南台。南面置地藏房。安圆像地藏及赤地画八大菩萨为首一万地藏像。福田五员昼读<a href=\"/fojing/dizangjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">地藏经</a>金刚般若。夜□察礼忏。称金刚社。曰方西台。南面置弥陀房。安圆像无量寿及白地画无量寿如来为首一万大势至。福田五员昼读八卷法华。夜念弥陀礼忏。称水精社。黑地北台。南面置罗汉堂。安圆像释迦及黑地画释迦如来为首五百罗汉。福田五员昼读佛报恩经涅槃经。夜念涅槃礼忏。称白莲社。黄处中台。直□院中安泥像文殊不动。后壁安黄地画毗卢遮那为首三十六化形。福田五员昼读华严经六百般若。夜念文殊礼忏。称华严社。宝川庵改创<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>寺。安圆像毗卢遮那三尊及大藏经。福田五员长门藏经。夜念华严神众。每年设华严会一百日。称名法轮社。以此华藏寺为五台社之本寺。坚固护持。命净行福田镇长香火。则国王千秋。人民安泰。文虎和平。百谷丰穰矣。又加排下院文殊岬寺为社之都会。福田七员昼夜常行华严神众礼忏。上件三十七员斋料衣费。以河西府道内八州之税充为四事之资。代代君王不忘遵行幸矣</p><p>溟州(古河西府也)五台山宝叱徒太子传记</p><p>新罗净神太子宝叱徒。与弟孝明太子。到河西府世献角干家一宿。翌日踰大岭。各领一千人到省乌坪。累日游玩。太和元年八月五日。兄弟同隐入五台山。徒中侍卫等推觅不得。并皆还国。兄太干见中台南下真如院[土*基]下山末青莲开。其地结草庵而居。弟孝明见北台南山末青莲开。亦结草庵而居。兄弟二人礼念<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。五台进敬礼拜。青在东台满月形山。观音真身一万常住。南台麒麟山。八大菩萨为首。一万地藏菩萨常住。白方西台长岭山。无量寿如来为首。一万大势至菩萨常住。黑掌北台相王山。释迦如来为首。五百大阿罗汉常住。黄处中台风炉山。亦名地炉山。毗卢遮那为首。一万文殊常住。真如院地。文殊大圣每日寅朝化现三十六形(三十六形见台山五万真身传)。两太子并礼拜。每日早朝汲于洞水。煎茶供养。一万真身文殊。净神太子弟副君在新罗。争位诛灭。国人遣将军四人到五台山。孝明太子前呼万岁。即是有五色云。自五台至新罗。七日七夜浮光。国人寻光到五台。欲陪两太子还国。宝叱徒太子涕泣不归。陪孝明太子归国即位。在位二十余年。神龙元年三月八日。始开真如院(云云)。宝叱徒太子常服于洞灵水。肉身登空。到流沙江。入蔚珍大国掌天窟修道。还至五台神圣窟。五十年修道(云云)。五台山是白头山大根脉。各台真身常住(云云)</p><p>台山月精寺五类圣众</p><p>按寺中所传古记云。慈藏法师初至五台。欲睹真身。于山麓结茅而住。七日不见。而到妙梵山创净岩寺。后有信孝<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>者。或云幼童菩萨<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。家在公州。养母纯孝。母非肉不食。士求肉出行山野。路见五鹤射之。有一鹤落一羽而去。士执其羽遮眼而见。人人皆是畜生。故不得肉。而因割股肉进母。后乃出家。舍其家为寺。今为孝家院。士自庆州界至河率。见人多是人形。因有居住之志。路见老妇。问可住处。妇云。过西岭有北向洞可居。言讫不现。士知观音所教。因过省乌坪。入慈藏初结茅处而住。俄有五比丘到云。汝之持来袈裟一幅今何在。士茫然。比丘云。汝所执见人之羽是也。士乃出呈。比丘乃置羽于袈裟阙幅中相合。而非羽乃布也。士与五比丘别。后方知是五类圣众化身也。此月精寺慈藏初结茅。次信孝居士来住。次梵日门人信义头陀来。创庵而住。后有水多寺长老有缘来住。而渐成大寺。寺之五类圣众九层石塔皆圣迹也。相地者云。国内名山。此地最胜。佛法长兴之处云云</p><p>南月山(亦名甘山寺)</p><p>寺在京城东南二十许里。金堂主弥勒尊像火光后记云。开元七年己未二月十五日。重阿餐全忘诚。为亡考仁章一吉于亡妃观肖里夫人。敬造甘山寺一所石弥勒一躯。兼及恺元伊餐第恳诚小舍玄度师。姊古巴里。前妻古老里。后妻阿好里。兼庶族及漠一吉餐一幢萨餐聪敏。亡舍妹首肹置等。同营兹善。亡妣肖里夫人。古人成之东海攸反边散也(古人成之以下文未详其意但存古文而已下同)弥陀佛火光后记云。重阿餐金志全。曾以尚衣奉御。又执事侍郎年六十七。致仕闲居。奉为国主大王。伊餐恺元。亡考仁章一吉于。亡妃亡弟。小舍梁诚。沙门玄度。亡妻古路里。亡妹古巴里。又为妻阿好里等。舍甘山庄田建伽蓝。仍造石弥陀一躯。奉为亡考仁章一吉于古人。成之东海攸反边散也(按帝系金恺元乃太宗春秋之弟太子恺元角干也乃丈熙之所生也诚志全乃仁章一吉于之子东海攸反恐法敏葬东海也)</p><p>天龙寺</p><p>东都南山之南。有一峰屹起。俗云高位山。山之阳有寺。俚云高寺。或云天龙寺。讨论三韩集云。鸡林土内有客水二条。逆水一条。其逆水客水二源。不镇天灾。则致天龙覆没之灾。俗传云逆水者州之南马等乌村南流川是。又是水之源致大龙寺。中国来使乐鹏龟来见云。破此寺则国亡无日矣。又相传云。昔有檀越。有二女曰天</p><p>女龙女二亲为二女创寺因名之。境地异常。助道之场。罗季残破久矣。众生寺大圣所乳崔殷諴之子承鲁。鲁生肃。肃生侍中齐颜。颜乃重修起废。仍置释迦万日道场。受朝旨。兼有信书愿文留于寺。既卒。为护伽蓝神。颇着灵异。其信书略曰。檀越内史侍郎同内史门下平章事柱国崔齐颜状。东京高位山天龙寺残破有年。弟子特为圣寿天长民国安泰之愿。殿堂廊阁。房舍厨库。已来兴构毕。具石造泥塑佛圣数躯。开置释迦万日道场。既为国修营。官家差定主人亦可。然当遆换交代之时。道场僧众不得安心。侧观入田稠足寺院。如公山地藏寺入田二百结。毗瑟山道仙寺入田二十结。西京之四面山寺各田二十结。例皆勿论有职无职。须择戒备才高者。社中众望。连次住持。焚修以为恒规。弟子闻风而悦。我此天龙寺亦于社众之中。择选才德双高大德。兼为栋梁。差主人镇长焚修。具录文字。付在刚司。自当时主人为始。受留守官文通。示道场诸众。各宜知悉。重熙九年六月日。具[衔-金+缶]如前署。按重熙乃契丹兴宗年号。本朝靖宗七年庚辰岁也</p><p>鍪藏寺弥陀殿</p><p>京城之东北二十许里。暗谷村之北有鍪藏寺。第三十八元圣大王之考大阿干孝让追封明德大王之为叔父波珍餐追崇所创也。幽谷迥绝。类似削成。所寄冥奥。自生虚白。乃息心乐道之灵境也。寺之上方有弥陀古殿。乃昭成(一作圣)大王之妃桂花王后为大王先逝。中宫乃充充焉皇皇焉。哀戚之至。泣血棘心。思所以幽赞明休光启玄福者。闻西方有大圣曰弥陀。至诚归仰。则善救来迎。是真语者岂欺我哉。乃舍六衣之盛服。罄九府之贮财。召彼名匠。教造弥陀像一躯。并造神众以安之。先是寺有一老僧。忽梦真人坐于石塔东南冈上。向西为大众说法。意谓此地必佛法所住也。心秘之而不向人说。岩石巉[山*(〦/(坐-土+十))]。流涧邀迅。匠者不顾。咸谓不臧。及乎辟地。乃得平坦之地。可容堂宇。宛似神基。见者莫不愕然称善。近古来殿则坏圮。而寺独在。谚传太宗统三已后。藏兵鍪于谷中。因名之</p><p>伯严寺石塔舍利</p><p>开运三年丙午十月二十九日。康州界任道大监柱贴云。伯严禅寺坐草八县(今草溪)。寺僧侃游上座年三十九。云寺之经始则不知。但古传云。前代新罗时。北宅厅基舍置兹寺。中间久废。去丙寅年中沙木谷阳孚和尚改造住持。丁丑迁化。乙酉年曦阳山竞让和尚来住十年。又乙未年却返牺阳。时有神卓和尚。自南原白岩薮来入当院。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>住持。又咸雍元年十一月。当院住持得奥微定大师释秀立。定院中常规十条。新竖五层石塔。真身佛舍利四十二粒安邀。以私财立宝。追年供养条。第一当寺护法敬僧严欣伯欣两明神及近岳等三位前。立宝供养条(该传严欣伯欣二人舍家为寺因名曰伯严仍为护法神)金堂药师前。木钵月朔遆米条等。已下不录</p><p>灵鹫寺</p><p>寺中古记云。新罗真骨第二十一主神文王代。永淳二年癸未(本文云元年误)宰相忠元公。苌山国(即东莱县亦名莱山国)温井沐浴。还城次到屈井驿桐旨野驻歇。忽见一人放鹰而逐雉。雉飞过金岳。杳无踪迹。闻铃寻之。到屈井县官北井边。鹰坐树上。雉在井中。水浑血色。雉开西翅。抱二雏焉。鹰亦如相。恻隐而不敢攫也。公见之恻然有感。卜问此地云可立寺。归京启于王。移其县于他所。创寺于其地。名灵鹫寺焉</p><p>有德寺</p><p>新罗大夫角于崔有德。舍私第为寺。以有德名之。远孙三韩功臣崔彦撝。挂安真影。仍有碑云</p><p>五台山文殊寺石塔记</p><p>庭畔石塔。盖新罗人所立也。制作虽淳朴不巧。然甚有灵响。不可胜记。就中一事。闻之诸古老云昔。连谷县人具舡沿海而渔。忽见一塔随逐舟揖。凡水族见其影者。皆逆散四走。以故渔人一无所得。不堪愤恚。寻影而至。盖此塔也。于是共挥斤斫之而去。今此塔四隅皆缺者以此也。予惊叹无已。然怪其置塔稍东而不中。于是仰见一悬板云。比丘处玄曾住此院。辄移置庭心。则二十余年间寂无灵应。及日者求基抵此。乃叹曰。是中庭地。非安塔之所。胡不移东乎。于是众僧乃悟。复移旧处。今所立者是也。余非好怪者。然见其佛之威神。其急于现迹利物如此。为<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>者讵可默而无言耶 时正丰元年丙子十月日白云子记</p></div>"
},{
    "title": "三国遗事 第四卷",
    "author": "一然大师",
    "html": "<div class=\"B1_text\"><p>三国遗事 第四卷</p><p>义解第五圆光西学</p><p>唐续高僧传第十三卷载。新罗皇隆寺释圆光。俗姓朴氏。本住三韩。卞韩辰韩马韩。光即辰韩人也。家世海东。祖习绵远。而神器恢廓。爱染篇章。校猎玄儒。讨仇子史。文华腾翥于韩服。博赡犹愧于中原。遂割略亲朋。发愤溟渤。年二十五。乘舶造于金陵。有陈之世。号称文国。故得咨考先疑。询猷了义。初听<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>旻公<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>讲素沾世典。谓理穷神。及闻释宗。反同腐芥。虚寻名教。实惧生涯。乃上启陈主。请归道法。有敕许焉。既爰初落采。即禀具戒。游历讲肆。具尽嘉谋。领牒微言。不谢光景。故得成实<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>蕰括心府。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>释论遍所披寻。末又投吴之虎山。念定相沿。无忘觉观。息心之众。云结林泉。并以综涉四含。功流八定。明善易拟。筒直难亏。深副夙心。遂有终焉之虑。于即顿绝人事。盘游圣迹。摄想青霄。缅谢终古。时有信士宅居山下。请光出讲。固辞不许。苦事邀延。遂从其志。创通成论。末讲<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。皆思解佼彻嘉。问飞移。兼[糸*柔]。以绚采。织综词义。听者欣欣会其心府。从此因循旧章。开化成任。每法轮一动。辄倾注江湖。虽是异域通传。而沐道顿除嫌郤。故名望横流。播于岭表。披榛负槖而至者。相接如鳞。会隋后御宇。威加南国。历穷其数。军入杨都。遂被乱兵。将加刑戮。有大主将望见寺塔火烧。走赴救乏。了无火状。但见光在塔前被缚将杀。既怪其异。即解而放之。斯临危达感如此也。光学通吴越。便欲观化周秦。开皇九年来游帝宇。值<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>初会。摄论肇兴。奉佩文言。振绩。微绪。又驰慧解。宣誉京皋。绩业既成。道东须继。本国远闻。上启频请。有敕厚加劳问。放归桑梓。光往还累纪。老幼相欣。新罗王金氏面申虔敬仰若<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。光性在虚闲。情多泛爱。言常含笑。愠结不形。而笺表启书。往还国命。并出自胸襟。一隅倾奉。皆委以治方。询之道化。事异锦衣。请同观国。乘机敷训。垂范于今。年齿既高。乘舆入内。衣服药食。并王手自营。不许佐助。用希专福。其感敬为此类也。将终之前。王亲执慰嘱累遗法。兼济民斯为说。征祥被于海曲。以彼建福五十八年少觉不悆。经于七日遗诫清切。端坐终于所住皇隆寺中。春秋九十有九。即唐贞观四年也(宜云十四年)当终之时。寺东北虚中音乐满空。异香充院。道俗悲庆。知其灵感。遂葬于郊外。国给羽仪。葬具同于王礼。后有俗人儿胎死者。彼土谚云。当于有福人墓埋之。种胤不绝。乃私瘗于坟侧。当日震。此胎尸掷于茔外。由此不怀。敬者率崇仰焉。有弟子圆安。神忘机颖。性希历览。慕仰幽求。遂北趣九都。东观不耐。又西燕魏。后展帝京。备通方俗。寻诸经论。跨轹大纲。洞清纤旨。晚归心学。高轨光尘。初住京寺。以道素有闻。特进萧瑀奏请住于蓝田所造津梁寺。四事供给无替六时矣。安尝叙光云。本国王染患。医治不损。请光入宫。别省安置。夜别二时为说深法。<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a><a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。王大信奉。一时初夜王见光首。金色晃然有象。日轮随身而至。王后宫女同共观之。由是重发胜心。克留疾所。不久遂差。光于辰韩马韩之间。盛通<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。每岁再讲。匠成后学。之资。并充营寺。余惟衣钵而已(载达函)</p><p>又东京安逸户长贞孝家在古本殊异传载。圆光法师传曰。法师俗姓薛氏。王京人也。初为僧<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>法。年三十岁思静居<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。独居三岐山。后四年有一<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>来。所居不远。别作兰若。居二年。为人强猛。好修咒述。法师夜独坐诵经。忽有神声呼其名。善哉善哉汝之<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。凡修者虽众。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>者稀有。今见邻有比丘。径修咒术而无所得。喧声恼他。静念住处。碍我行路。每有去来。几发恶心。法师为我语告。而使移迁。若久住者。恐我忽作罪业。明日法师往而告曰。吾于昨夜有听神言。比丘可移别处。不然应有余殃。比丘对曰。至<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>为魔所眩。法师何忧狐鬼之言乎。其夜神又来曰。向我告事。比丘有何答乎。法师恐神嗔怒而对曰。终未了说。若强语者。何敢不听。神曰。吾已具闻。法师何须补说。但可默然见我所为。遂辞而去。夜中有声如雷震。明日视之。山颓填比丘所在兰若。神亦来曰。师见如何。法师对曰。见甚惊惧。神曰。我岁几于三千年。神术最壮。此是小事。何足为惊。但复将来之事。无所不知。天下之事。无所不达。今思法师唯居此处。虽有自利之行。而无利他之功。现在不扬高名。未来不取胜果。盍采佛法于中国。导群迷于东海。对曰。学道中国。是本所愿。海陆迥阻。不能自通而已。神祥诱归中国所行之计。法师依其言归中国。留十一年。博通三藏。兼学儒术。真平王二十二年庚申(三国史云。明年辛酉来)。师将理策东还。乃随中国朝聘使还国。法师欲谢神。至前住三岐山寺。夜中神亦来呼其名曰。海陆途间。往还如何。对曰。蒙神鸿恩。平安到讫。神曰。吾亦授戒于神。仍结生生相济之约。又请曰。神之真容可得见耶。神曰。法师若欲见我形。平旦可望东天之际。法师明日望之。有大臂贯云接于天际。其夜神亦来曰。法师见我臂耶。对曰。见已甚奇绝异。因此俗号臂长山。神曰。虽有此身。不免<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>之害。故吾无月日舍身其岭。法师来送长逝之魂。待约曰往看。有一老狐黑如枈。但吸吸无息。俄然而死。法师始自中国来。本朝君臣敬重为师。常讲大乘经典。此时高丽百济常侵边鄙。王甚患之。欲请兵于隋(宜作唐)请法师作乞兵表。皇帝见以三十万兵亲征高丽。自此知法师旁通儒术也。享年八十四入寂。葬明活城西。又三国史列传云。贤士贵山者沙梁部人也。与同里帚项为友。二人相谓曰。我等期与士君子游。而不先正心持身。则恐不免于招辱。盍问道于贤者之侧乎。时闻圆光法师入隋回。寓止嘉瑟岬(或作加西。又嘉栖。皆方言也。岬俗云古尸。故或云古尸寺。言岬寺也。今云门寺东九千步许有加西岘。或云嘉瑟岘。岘之北洞有寺基是也)二人诣门进告昌。俗士颛蒙无所知识。愿赐一言以为终身之诫。光曰。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>有<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>其别有十。若等为人臣子。恐不能堪。今有世俗<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。一曰。事君以忠。二曰。事亲以孝。三曰。交友有信。四曰。临战无退。五曰。<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>有择。若行之无忽。贵山等曰。他则既受命矣。所谓杀生有择特未晓也。光曰。六斋曰春夏月不杀。是择时也。不杀使畜。谓马牛鸡犬。不杀细物。谓肉不足一脔。是择物也。此亦唯其所用。不求多杀。此是世俗之善戒也。贵山等曰。自今以后。奉以周旋。不敢失坠。后二人从军事。皆有奇功于国家。又建福三十年癸酉(即真平王即位三十五年也)秋。隋使王世仪至。于皇龙寺设百座道场。请诸高德说经。光最居上首。议曰。原宗兴法已来津梁始置。而未遑堂粤。故宜以归戒灭忏之法开晓愚迷。故光于所住嘉栖岬。置占察宝以为恒规。时有檀越尼纳田于占察宝。今东平郡之田一百结是也。古籍犹存。光性好虚静。言常含笑。形无愠色。年腊既迈。乘舆入内。当时群彦。德义攸属。无敢出其右者。文藻之赡。一隅所倾。年八十余。卒于贞观间。浮图在三岐山金谷寺(今安康之西南洞也。亦明活之西也)唐传云。告寂皇隆寺。未详其地。疑皇龙之讹也。如芬皇作王芬寺之例也。据如上唐乡二传之文。但姓氏之朴薛。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>之东西。如二人焉。不敢详定。故两存之。然彼诸传记。皆无鹊岬璃目与云门之事。而乡人金陟明谬以街巷之说润文作光师传。滥记云门开山祖宝壤师之事迹。合为一传。后撰海东僧传者。承误而录之。故时人多惑之。因辨于此。不加减一字。载二传之文详矣。陈隋之世。海东人鲜有航海问道者。设有。犹未大振。及光之后。继踵西学者憧憧焉。光乃启途矣。赞曰</p><p>航海初穿汉地云几人来往挹清芬</p><p>昔年踪迹青山在金谷嘉西事可闻</p><p>宝壤梨木</p><p>释宝壤传。不载乡井氏族。谨按清道郡司籍载。天福八年癸酉(太祖即位第二十六年也)正月日。清道郡界里审使顺英大乃末水文等柱贴公文。云门山禅院长生南阿尼岾。东嘉西岘(云云)。同薮三刚典主人宝壤和尚。院主玄会长老。贞座玄两上座。直岁信元禅师(右公文清道郡都田帐传准)又开运三年丙辰。云门山禅院长生标塔公文一道。长生十一阿尼岾。嘉西岘。亩岘。西北买岘(一作面知村)。北猪。足门等。又庚寅年。晋阳府贴五道按察使。各道禅教寺院始创年月形止。审检成籍时。差使员东京掌书记李僐审检记载。王丰六年辛巳(大金年号。本朝毅宗即位十六年也)九月。郡中古籍裨补记准清道郡前副户长御侮副尉李则桢户在右人消息及谚传记载。致仕上户长金亮辛。致仕户长旻育。户长同正尹应前其人珍奇等与时上户长用成等言语。时太守李思老户长亮辛年八十九。余辈皆七十已上。用成年六十已上(云云次不准)罗代已来。当郡寺院。鹊岬已下中小寺院。三韩乱亡间。大鹊岬。小鹊岬。所宝岬。天门岬。嘉西岬等五岬皆亡坏。五岬柱合在大鹊岬。祖师知识(上文云宝壤)大国传法来。还次西海中。龙邀入宫中。念经施金罗<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>一领。兼施一子璃目。为侍奉而追之。嘱曰于时三国扰动。未有归依佛法之君主。若与吾子归本国鹊岬。创寺而居。可以避贼。抑亦不数年内。必有<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>贤君。出定三国矣。言讫。相别而来。还及至兹洞。忽有老僧。自称圆光。抱吊樻而出。授之而没(按圆光以陈末入中国。开皇间东还。住嘉西岬。而没于皇隆。计至清泰之初。无虑三百年矣。今悲叹诸岬皆废。而喜见壤来而将兴。故告之尔)于是壤师将兴废寺而登北岭望之。庭有五层黄塔。下来寻之则无迹。再陟望之。有群鹊啄地。乃思海龙鹊岬之言寻掘之。果有遗塼无数。聚而蕴崇之。塔成而无遗塼。知是前代伽蓝墟也。毕。创寺而住焉。因名鹊岬寺。未几太祖统一三国。闻师至此创院而居。乃合五岬田束五百结纳寺。以清泰四年丁酉。赐额曰云门禅寺。以奉袈裟之灵荫。璃目常在寺侧小潭。阴敕ɑ?:鲆荒暝?怠L锸呓归隆H离妨?啃杏辍R痪掣孀恪L斓劢?锊皇读?扛婕庇谑ΑJΣ赜诖蚕隆6碛刑焓沟酵ァG氤隽?俊Jχ竿デ袄婺尽D苏鹬??咸臁@婺疚?荨A?е?此</p></div>"
},{
    "title": "三国遗事 第五卷",
    "author": "一然大师",
    "html": "<div class=\"B1_text\"><p>三国遗事 第五卷</p><p>国尊曹溪宗加智山下麟角寺住持圆境冲照大禅师 一然 撰</p><p>神咒第六密本摧邪</p><p>善德王德曼遘疾弥留。有兴轮寺僧法惕。应诏侍疾。久而无效。时有密本法师。以<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>闻于国。左右请代之。王诏迎入内。本在宸仗外读<a href=\"/fojing/yaoshijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">药师经</a>。卷轴才周。所持六环飞入寝内。刺一老狐与法惕。倒掷庭下。王疾乃瘳。时本顶上发五色神光。睹者皆惊。又承相金良图为阿孩时。忽口噤体硬。不言不遂。每见一大鬼率群小鬼来。家中几有盘肴。皆啖尝之。巫觋来祭。则群聚而争侮之图虽欲命撤。而口不能言。家亲请法流寺僧亡名来转经。大鬼命小鬼。以铁槌打僧头仆地。呕血而死。隔数日。遣使邀本。使还言。本法师受我请将来矣。众鬼闻之皆失色。小鬼曰。法师至将不利。避之何幸。大鬼侮慢自若曰。何害之有。俄而有四方大力神。皆属金甲长戟。来捉群鬼而缚去。次有无数天神环拱而待。须臾本至。不待开经其疾乃治。语通身解。具说件事。良图因此笃信释氏。一生无怠塑成兴轮寺吴堂主。弥陀尊像。左右菩萨。并满金画其堂。本尝住金谷寺。又金庾信尝与一老<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>交厚。世人不知其何人。于时公之戚秀天久染恶疾。公遣居士诊卫。适有秀天之旧名因惠师者。自中岳来访之。见居士而慢侮之曰。相汝形仪。邪佞人也。何得理人之疾。居士曰。我受金公命。不获已尔。惠曰。汝见我<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。乃奉炉咒香俄顷五色云旋绕顶上。天花散落。士曰。和尚通力不可思议。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>亦有拙技请试之。愿师乍立于前。惠从之。士弹指一声。惠倒迸于空。高一丈许。良久徐徐倒下。头卓地。屹然如植撅。旁人推挽之不动。士出去。惠犹倒卓达曙。明日秀天使扣于金公。公遣居士往敕。乃解。因惠不复卖技。赞曰</p><p>红紫纷纷几乱朱堪嗟鱼目诳愚夫</p><p>不因居士轻弹指多小巾箱袭碔砆</p><p>惠通降龙</p><p>释惠通。氏族未详。白衣之时。家在南山西麓银川洞之口(今南。涧寺东里)一日游舍东溪上。捕一獭屠之。弃骨园中。诘旦亡其骨。迹血寻之。骨还旧穴。抱五儿而蹲。郎望见惊异。久之感叹蹰躇。便弃俗<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。易名惠通。往唐谒<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>请业。藏曰。嵎夷之人岂堪<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。遂不开授。通不堪轻谢去。服勤三载。犹不许。通乃愤悱立于庭。头戴火盆。须臾顶裂声如雷。藏闻来视之。撤火盆。以指按裂处。诵神咒疮合如平日。有瑕如王字文。因号王和尚深器之。传印诀。时唐室有公主疾病。高宗请救于三藏。举通自代。通受教别处。以白豆一斗咒银器中。变白甲神兵。逐崇不克。又以黑豆一斗咒金器中。变黑甲神兵。令二色合逐之。忽有蛟龙走出。疾遂瘳。龙怨通之逐已也。来本国文仍林。害命尤毒。是时郑恭奉使于唐。见通而谓曰。师所逐毒龙归本国害甚。速去除之。乃与恭以麟德二年乙丑。还国而黜之。龙又怨恭。乃托之柳。生郑氏门外。恭不之觉。但赏其葱密。酷爱之。及神文王崩。孝昭即位。修山陵除葬路。郑氏之柳当道。有司欲伐之。恭恚曰。宁斩我头。莫伐此树。有司奏闻。王大怒。命司寇曰。郑恭恃王和尚神术。将谋不逊。侮逆王命。言斩我头。宜从所好。乃诛之。坑其家。朝议。王和尚与恭甚厚。应有忌嫌。宜先图之。乃征甲寻捕。通在王望寺见甲徙至。登屋。携砂瓶研朱笔而呼曰。见我所为。乃于瓶项抹一画曰。尔辈宜各见项。视之皆朱画。相视愕然。又呼曰。若断瓶项。应断尔项如何。其徒奔走。以朱项赴王。王曰。和尚神通。岂人力所能图。乃舍之。王女忽有疾。诏通治之。疾愈。王大悦通因言。恭被毒龙之污滥膺国刑。王闻之心悔。乃免恭妻孥。拜通为国师。龙既报冤于恭。往机张山为熊神。惨毒滋甚民多梗之。通到山中。谕龙授不杀戒。神害乃息。初神文王发疽背。请候于通。通至咒之立活。乃曰。陛下曩昔为宰官身。误决臧人信忠为隶。信忠有怨。生生作报。今兹恶疽亦信忠所祟。宜为忠创伽蓝。奉冥祐以解之。王深然之。创寺号信忠奉圣寺。寺成。空中唱云因王创寺。脱苦生天。怨已解矣(或本载此事于真表传中误)因其唱地。置折怨堂。堂与寺今存。先是密本之后有高僧明朗。入龙宫得神印(梵云文豆娄。此云神印)。祖创神游林(今天王寺)屡欀邻国之寇。今和尚传无畏之髓。遍历尘寰。救人化物。兼以<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>之明创寺雪怨。密教之风于是乎大振。天磨之总持岩。母岳之咒锡院等皆其流裔也。或云。通俗名尊胜角干。角干乃新罗之宰相峻级。未闻通历仕之迹。或云。射得豺狼皆未详。赞曰</p><p>山桃溪杏映篱斜一径春深两岸花</p><p>赖得郎君闲捕獭尽教魔外远京华</p><p>明朗神印</p><p>按金光寺本记云。师挺生新罗。入唐学道。将还因海龙之请。入龙宫传秘法。施黄金千两(一云千斤)潜行地下。涌出本宅井底。乃舍为寺。以龙王所施黄金饰塔像。光曜殊特。因名金光焉(僧传作金羽寺误)师讳明朗。字国育。新罗沙干才良之子。母曰南涧夫人。或云。法乖娘苏判茂林之子金氏。则慈藏之姝也。三息。长曰国教大德。次曰义安大德。师其季也。初母梦吞青色珠而有娠。善德王元年入唐。贞观九年乙未来归。总章元年戊辰。唐将李绩统大兵。合新罗灭高丽。后余军留百济。将袭灭新罗。罗人觉之。发兵拒之。高宗闻之赫怒。命薜邦兴师将讨之。文武王闻之惧。请师开秘法禳之(事在文武王传中)因兹为神印宗祖。及我太祖创业之时。亦有海贼来扰。乃请安惠朗融之裔。广学大缘等二大德。作法禳镇。皆朗之传系也。故并师而上至龙树为九祖(本寺记三师为律祖未详)又太祖为创现圣寺。为一宗根柢焉。又新罗京城东南二十余里有远源寺。谚传。安惠等四大德与金庾信金义元金述宗等同愿所创也。四大德之遗骨皆藏寺之东峰。因号四<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>祖师岩云。则四大德皆罗时高德。按[土*(穴/?/ㄆ)]白寺柱贴注脚载。庆州户长巨川母阿之女。女母明珠女。女母积利女之子。广学大德大缘三重(古名善会)昆季二人。皆投神印宗。以长兴二年辛卯随太祖上京。随驾焚修。赏其劳。给二人父母忌日宝于[土*(穴/?/ㄆ)]白寺。田沓若干结云云。则广学大缘二人。随圣祖入京者。安师等。乃与金庾信等创远源寺者也。广学等二人骨亦来安于兹尔。非<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>皆创远源。皆随圣祖也详之</p><p>感通第七仙桃圣母<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>佛事</p><p>真平王朝。有<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>名智惠。多贤行。住安兴寺。拟新修佛殿而力未也。梦一女仙风仪婥约。珠翠饰鬟。来慰曰。我是仙桃山神母也。喜汝欲修佛殿。愿施金十斤以助之。宜取金于予座下。妆点主尊三像壁上。绘五十三佛。六类圣众。及诸天神。五岳神君(罗时五岳。谓东吐含山。南智异山。西鸡龙。北太伯中父岳。亦云公山也)每春秋二季之十日。丛会善男善女。广为一切含灵。设占察<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>。以为恒规(本朝屈弗池龙托梦于帝。请于灵鹫山长开药师道场。□平海途。其事亦同)。惠乃惊觉。率徒往神祠座下。堀得黄金一百六十两。克就乃功。皆依神母所谕。其事唯存。而<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>废矣。神母本中国帝室之女。名娑苏。早得神仙之术。归止海东。久而不还。父皇寄书系足云。随鸢所止为家。苏得书放鸢。飞到此山而止。遂来宅为地仙。故名西鸢山。神母久据兹山。镇祐邦国。灵异甚多。有国已来。常为三祀之一。秩在群望之山。第五十四景明王好使鹰。尝登此放鹰而失之。祷于神母曰。若得鹰。当封爵。俄而鹰飞来止机上。因封爵大王焉。其始到辰韩也。生圣子为东国始君。盖赫居阏英二圣之所自也。故称鸡龙鸡林白马等。鸡属西故也。尝使诸天仙织罗。绯染作朝衣。赠其夫。国人因此始知神验。又国史史臣曰。轼政和中尝奉使人宋。诣佑神馆。有一堂设女仙像。馆伴学士王黼曰。此是贵国之神。公知之乎。遂言曰。古有中国帝室之女。泛海抵辰韩生子。为海东始祖。女为地仙。长在仙桃山。此其像也。又大宋国使王襄到我朝。祭东神圣母女。有娠贤肇邦之句。今能施金奉佛。为含生开香火作津梁。岂徒学长生而囿于溟蒙者哉。赞曰</p><p>来宅西鸢几十霜招呼帝子织霓裳</p><p>长生未必无生异故谒金仙作玉皇</p><p>郁面婢<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>西升</p><p>景德王代。康州(今晋州。一作刚州。则今顺安)善士数十人志求西方。于州境创弥陀寺。约万日为契。时有阿干贵珍家一婢名郁面。随其主归寺。立中庭。随僧念佛。主憎其不职。每给谷二硕。一夕舂之。婢一更舂毕。归寺念佛(俚言己事之忙。大家之舂促。盖出乎此)日夕彻怠。庭之左右竖立长橛。以绳穿贯两掌。系于橛上合掌。左右游之激励焉。时有天唱于空。郁面娘入堂念佛。寺众闻之。劝婢入堂。随例<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。未几天乐从西来。婢涌透屋梁而出。西行至郊外。捐骸变现真身。坐莲台放大光明。缓缓而逝。乐声不彻空中。其堂至今有透穴处云(已上乡传)按僧传。栋梁八珍者观音应现也。结徒有一千分明为二。一劳力。一精修。彼劳力中知事者不获戒堕<a href=\"/remen/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>。为浮石寺牛。尝驮经而行。赖经力转为阿干贵珍家婢。名郁面。因事至下柯山。感梦遂发道心。阿于家距惠宿法师所创弥陀寺不远。阿干每至其寺念佛。婢随往。在庭念佛云云。如是九年。岁在乙未。正月二十一日。<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>拨屋梁而去。至小伯山堕一只履。就其地为<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>寺。至山下弃其身。即其地为二菩提寺。榜其殿曰勖面登天之殿。屋脊穴成十许围。虽暴雨密雪不沾湿。后有好事者。[竺-二+(尃*几)]金塔一座。直其穴。安承尘上以志其异。今榜塔尚存。勖面去后。贵珍亦以其家异人托生之地舍为寺。曰法王。纳田民。久后废为丘墟。有大师怀镜。与承宣刘硕小卿李元长同愿重营之。镜躬事土木。始轻材。梦老父遗麻葛屦各一。又就古神社。谕以佛理。斫出祠侧材木。九五载告毕。又加臧获。蔚为东南名蓝。人以镜为贵珍后身。议曰。按乡中古传郁面乃景德王代事也。据征(征字疑作珍下亦同)本传。则元和三年戊子哀庄王时也。景德后历惠恭宣德元圣昭圣哀庄等五代。共六十余年也。征先面后。与乡传乖违。然两存之阙疑。赞曰</p><p>西邻古寺佛灯明舂罢归来夜二更</p><p>自许一声成一佛掌穿绳子直忘形</p><p>广德严庄</p><p>文武王代。有<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>名广德严庄二人友善。日夕约曰。先归安养者须告之。德隐居芬皇西里(或云。皇龙寺有西去房。未知孰是)蒲鞋为业。挟妻子而居。庄庵栖南岳。大种刀耕一日。日影施红。松阴静暮。窗外有声。报云。某已西往矣。惟君好住。速从我来。庄排闼而出顾之。云外有天乐声。光明属地。明日归访其居。德果亡矣。于是乃与其妇收骸。同营蒿里。既事乃谓妇曰。夫子逝矣。偕处何如。妇曰可。遂留夜宿。将欲通焉。妇靳之曰。师求<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。可谓求鱼缘木。庄惊怪问曰。德既乃尔。予又何妨。妇曰。夫子与我同居十余载。未尝一夕同床而枕。况触污乎。但每夜端身正坐。一声念阿弥陀<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>。或作十六观。观既熟。明月入户。时升其光。加趺于上。竭诚若此。虽欲勿西奚往。夫适千里者。一步可规。今师之观可云东矣。西则未可知也。庄愧赧而退。便诣元晓法师处。恳求津要。晓作铮观法诱之。藏于是洁己悔责。一意修观。亦得西升。铮观在晓师本传。与海东僧传中。其妇乃芬皇寺之婢。盖十九应身之一德。尝有歌云</p><p>月下伊底亦 西方念丁去赐里遣 无量寿佛前乃 恼叱古音(乡言云报言也) 多可支白遣赐立 誓音深史隐尊衣希仰支 两手集刀花乎白良愿<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>愿往生 慕人有如白遣赐立阿邪 此身遗也置遣 四十八大愿成遣赐去</p><p>憬兴遇圣</p><p>神文王代。大德憬兴。姓水氏。熊川州人也。年十八出家。游刃三藏。望重一时。开耀元年。文武王将升遐。顾命于神文曰。憬兴法师可为国师。不忘朕命。神文即位。曲为国老。住三郎寺。忽寝疾弥月。有一尼来谒候之。以<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>中善友原病之说为言曰。今师之疾。忧劳所致。喜笑可治。乃作十一样面貌。各作俳谐之舞。巉岩成削。变态不可胜言。皆可脱颐。师之病不觉洒然。尼遂出门。乃入南巷寺(寺在三郎寺南)而隐。所将杖子在帧画十一面圆通像前。一日将入王宫。从者先备于东门之外。鞍骑甚都。靴笠斯陈。行路为之辟易。一居士(一云沙门)形仪疏率。手杖背筐来。憩于下马台上。视筐中干鱼也。从者呵之曰。尔着缁。奚负触物耶。僧曰。与其挟生肉于两股间。背真三市之枯鱼。有何所嫌。言讫起去。兴方出门。闻其言。使人追之。至南山文殊寺之门外。抛筐而隐。杖在文殊像前。枯鱼乃松皮也。使来告。兴闻之叹曰。大圣来戒我骑畜尔。终身不复骑。兴之德馨遗味。备载释玄本所撰三郎寺碑。尝见普贤章经<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨言。我当来世生阎浮提。先度释迦末法弟子。唯除骑马<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>不得见佛。可不警哉。赞曰</p><p>昔贤垂范意弥多胡乃儿孙莫切瑳</p><p>背底枯鱼犹可事那堪他日负龙华</p><p>真身受供</p><p>长寿元年壬辰。孝昭即位。始创望德寺。将以奉福唐室。后景德王十四年。望德寺塔战动。是年有安史之乱。罗人云。为唐室立兹寺。宜其应也。八年丁酉。设落成会。王亲驾办供。有一比丘仪彩疏陋。局束立于庭。请曰。贫道亦望斋。王许赴床杪。将罢。王戏调之曰。住锡何所。僧曰琵琶岩。王曰。此去莫向人言赴国。王亲供之斋。僧笑答曰。陛下亦莫与人言<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>真身释迦。言讫。涌身淩空。向南而行。王惊愧驰上东冈。向方遥礼。使往寻之。到南山参星谷。或云。大碛川源石上置锡钵而隐。使来复命。遂创释迦寺于琵琶岩下。创佛无寺于灭影处。分置锡钵焉。二寺至今存。锡钵亡矣。智论第四云。昔有罽宾三藏。行阿兰若法。至一王寺。寺设大会。守门人见其衣服粗弊。遮门不前。如是数数。以衣弊故。每不得前。便作方便。假借好衣而来。门人见之。听前不禁。既获诣坐。得种种好食。先以与衣。众人问言何以尔乎。答曰。我比数来。每不得入。今以衣故得此座。得种种食。宜以与衣尔。事可同按。赞曰</p><p>燃香择佛看新绘办供斋僧唤旧知</p><p>从此琵琶岩上月时时云掩到潭迟</p><p>月明师兜率歌</p><p>景德王十九年庚子四月朔。二日并现。挟旬不灭。日官奏。请缘僧作散花<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。则可禳。于是洁坛于朝元殿。驾幸青阳楼望缘僧。时有月明师行于阡陌时之南路。王使召之。命开坛作启。明奏云。臣僧但属于国仙之徒。只解乡歌。不闲声梵。王曰。既卜缘僧。虽用乡歌可也。明乃作兜率歌赋之。其词曰</p><p>今日此矣散花唱良巴宝白乎隐花良汝隐直等隐心音矣命叱使以恶只 弥勒座主陪立罗良</p><p>解曰。龙楼此日散花歌桃送青云一片花殷重直心之所使远邀兜率大仙家 今俗谓此为散花歌。误矣。宜云兜率歌。别有散花歌。文多不载。既而日怪即灭。王嘉之。赐品茶一袭。水精<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>百八个。忽有一童子。仪形鲜洁。跪奉茶珠。从殿西小门而出。明谓是内宫之使。王谓师之从者。及玄征而俱非。王甚异之。使人追之。童入内院塔中而隐。茶珠在南壁画慈氏像前。知明之至德与至诚。能昭假于至圣也如此。朝野莫不闻知。王益敬之。更赆绢一百疋。以表鸿诚。明又尝为亡妹营齐。作乡歌祭之。忽有惊飙吹纸钱。飞举向西而没。歌曰</p><p><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>路隐 此矣有阿米次肹伊遣 吾隐去内如辞叱都 毛如云遣去内尼叱古 于内秋察早隐风未 此矣彼矣浮良落尸叶如一等隐枝良出古 去奴隐处毛冬乎丁 阿也 弥陀刹良逢乎吾道修良待是古如</p><p>明常居四天王寺。善吹笛。尝月夜吹过门前大路。月驭为之停轮。因名其路日月明里。师亦以是著名。师即能俊大师之门人也。罗人尚乡歌者尚矣。盖诗颂之类欤。故往往能感动天地鬼神者非一。赞曰</p><p>风送飞钱资逝妹笛摇明月住姮娥</p><p>莫言兜率连天远万德花迎一曲歌</p><p>善律还生</p><p>望德寺僧善律。施钱欲成六百<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。功未周。忽被阴府所追至冥。司问曰。汝在人间作何业。律曰。贫道暮年欲成大品经。功未就而来。司曰。汝之寿箓虽尽。胜愿□□。宜复人间毕成宝典。乃放还。途中有一女子哭莅拜前曰。我亦南阎州新罗人。坐父母阴取金刚寺水田一亩。被冥府追检。久受重苦。今师若还古里。告我父母速还厥田。妾之在世。胡麻油埋于床下。并藏致密布于寝褥间。愿师取吾油点佛灯。货其布为经幅。则黄川亦恩。庶几脱我苦恼矣。律曰。汝家何在。曰沙梁部久远寺西南里也。律闻之方行。乃苏。时律死已十日。葬于南山东麓。在冢中呼三日。牧童闻之来告于本寺。寺僧归发冢出之。具说前事。又访女家。女死隔十五年。油布宛然。律依其谕作冥福。女来魂报云。赖师之恩妾已离苦得脱矣。时人闻之莫不惊感。助成宝典。其经秩今在东都僧司藏中。每年春秋。披转禳灾焉。赞曰</p><p>堪羡吾师仗胜缘魂游却返旧林泉</p><p>爷娘若问儿安否为我催还一亩田</p><p>金现感虎</p><p>新罗俗每当仲春。初八至十五日。都人士女。竞绕兴轮寺之殿塔为福会。元圣王代。有郎君金现者。夜深独绕不息。有一处女念佛随绕。相感而目送之绕毕。引入屏处通焉。女将还。现从之。女辞拒而强随之。行至西山之麓。入一茅店。有老妪问女曰附率者何人。女陈其情。妪曰。虽好事不如无也。然遂事不可谏也。且藏于密。恐汝弟兄之恶也。把郎而匿之奥。小绕有三虎咆哮而至。作人语曰。家有腥膻之气疗饥何幸。妪与女叱曰。尔鼻之爽乎。何言之狂也。时有天唱。尔辈嗜害物命尤多。宜诛一以征恶。三兽闻之。皆有忧色。女谓曰。三兄若能远避而自惩。我能代受其罚。皆喜俯首妥尾而遁去。女入谓郎曰。始吾耻君子之辱临弊族。故辞禁尔。今既无隐。敢布腹心。且贱妾之于郎君。虽曰非类。得陪一夕之欢。义重结褵之好。三兄之恶天既厌之。一家之殃予欲当之。与其死于等闲人之手。曷若伏于郎君刃下以报之德乎。妾以明日入市为害剧。则国人无如我何。大王必募以重爵而捉我矣。君其无[怯*力]。追我乎城北林中。吾将待之。现曰。人交人彝伦之道。异类而交盖非常也。既得<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>。固多天幸。何可忍卖于伉俪之死。侥幸一世之爵禄乎。女曰。郎君无有此言。今妾之寿夭盖天命也。亦吾愿也。郎君之庆也。予族之福也。国人之喜也。一死而五利备。其可违乎。但为妾创寺。讲真诠资胜报。则郎君之惠莫大焉。遂相泣而别。次日果有猛虎。入城中剽甚。无敢当。元圣王闻之。申令曰。戡虎者爵二级。现诣阙奏曰。小臣能之。乃先赐爵以激之。现持短兵入林中。虎变为娘子。熙怡而笑曰。昨夜共郎君缱绻之事。惟君无忽。今日被爪伤者。皆涂兴轮寺酱。聆其寺之螺钵声则可治。乃取现所佩刀。自颈而仆。乃虎也。现出林而托曰。今兹虎易搏矣。匿其由不泄。但依谕而治之。其疮皆效。今俗亦用其方。现既登庸。创寺于西川边。号虎愿寺。常讲梵网经。以导虎之冥游。亦报其杀身成己之恩。现临卒。深感前事之异。乃笔成传俗。姑闻知因名论虎林称于今。贞元九年。申屠澄自黄冠调补汉州。什方县之尉。至真符县之东十里许。遇风雪大寒。马不能前。路旁有茅舍。中有烟火甚温照灯下就之。有老父妪及处子。环火而坐。其女年方十四五。虽蓬发垢衣。雪肤花脸。举止妍媚。父妪见澄来。遽起曰。客甚冲寒雪。请前就火。澄坐良久。天色已暝。风雪不止。澄曰。西去县尚远。请宿于此。父妪曰。苟不以蓬荜为陋。敢承命。澄遂解鞍施衾帏。其女见客方止。修容靘妆自[竺-二+惟]箔间出。有闲雅之态。犹过初时。澄曰。小娘子明惠过人甚。幸未婚。敢请自媒如何。翁曰。不期贵客欲采拾。岂定分也。澄遂修子婿之礼。澄乃以所乘马载之而行。既至官俸禄甚薄。妻力以成家。无不欢心。后秩满将归。已生一男一女。亦甚明惠。澄尤加敬爱。尝作赠内诗云。一官惭梅福。三年愧孟光。此情何所喻。川上有[元/鸟]鸯。其妻终日吟讽。似默有和者。未尝出口。澄罢官罄室归本家。妻忽怅然谓澄曰。见赠一篇。寻即有和。乃吟曰。琴瑟情虽重。山林志自深。常忧时节变。辜负百年心。遂与访其家。不复有人矣。妻思慕之甚。尽日涕泣。忽壁角见一虎皮。妻大笑曰。不知此物尚在耶。遂取披之。即变为虎。哮吼拏攫。突门而出。澄惊避之。携二子寻其路。望山林大哭数日。竟不知所之。噫。澄现二公之接异物也。变为人妾则同矣。而赠背人诗。然后哮吼拏攫而走。与现之虎异矣。现之虎不得已而伤人。然善诱良方以救人。兽有为仁如彼者。今有人而不如兽者。何哉。详观事之终始。感人于旋绕佛寺中。天唱征恶。以自代之。传神方以救人置精庐讲佛戒。非徒兽之性仁者也。盖大圣应物之多方。感现公之能致情于旋绕。欲报冥益耳。宜其当时能受禧佑乎。赞曰</p><p>山家不耐三兄恶兰吐那堪一诺芳</p><p>义重数条轻万死许身林下落花忙</p><p>融天师彗星歌真平王代</p><p>第五居烈郎。第六实处郎(一作突处郎)第七宝同郎等三花之徒。欲游枫岳。有彗星犯心大星。郎徒疑之。欲罢其行。时天师作歌歌之。星怪即灭。日本兵还国。反成福庆。大王<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。遣郎游岳焉。歌曰</p><p>旧理东尸汀叱 干达婆矣游乌隐城叱[月*(夸-大+八)]良望良古 倭理叱军置来叱多烽烧邪隐边也薮耶 三花矣岳音见赐乌尸闻古 月置八切尔数于将来尸波衣 道尸扫尸星利望良古 彗星也白反也人是有叱多 后句 达阿罗浮去伊叱等邪 此也友物比所音叱彗叱只有叱故</p><p>正秀师救冰女</p><p>第四十哀庄王代。有沙门正秀。寓止皇龙寺。冬日雪深。既暮。自三郎寺还。经由天严寺门外。有一乞女产儿。冻卧滨死。师见而悯之。就抱。良久气苏。乃脱衣以覆之。裸走本寺。苫草覆身过夜。夜半有天唱于王庭曰。皇龙寺沙门正秀宜封王师。急使人捡之。具事升闻。上备威仪迎入大内。册为国师</p><p>避隐第八朗智乘云普贤树</p><p>歃良州阿曲县之灵鹫山(歃良。今梁州阿曲一作西又云求佛。又屈弗。今蔚州置屈弗驲。今存其名)有异僧。庵居累纪。而乡邑皆不识。师亦不言名氏。常讲法华。仍有通力。龙朔初。有<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>智通。伊亮公之家奴也。出家年七岁。时有乌来鸣云。灵鹫去投朗智为弟子。通闻之寻访此山。来憩于洞中树下。忽见异人出。曰我是普大士。欲授汝戒品。故来尔。因宣戒讫乃隐。通神心豁尔。智证顿圆。遂前行路。逢一僧。乃问朗智师何所住。僧曰。奚问朗智乎。通具陈神乌之事。僧莞尔而笑曰。我是朗智。今兹堂前亦有乌来报。有圣儿投师将至矣。宜出迎。故来迎尔。乃执手而叹曰。灵乌惊尔投吾。报予迎汝。是何祥也。殆山灵之阴助也。传云。山主乃辨才天女。通闻之泣谢。投礼于师。既而将与授戒。通曰。予于洞口树下。已蒙普贤大士乃授正戒。智叹曰。善哉汝已亲禀大士满分之戒。我自生年来。夕惕殷勤。念遇至圣。而犹未能昭格。今汝已受。吾不及汝远矣。反礼智通。因名其树曰普贤。通曰。法师住此其已久。如曰法兴王丁未之岁。始寓足焉。不知今几。通到山之时。乃文武王即位元年辛酉岁也。计已一百三十五年矣。通后诣义湘之室。升堂睹奥。颇资玄化。寔为锥洞记主也。元晓住磻高寺时。常往谒智。令着初章观文及安身事心论。晓撰讫。使隐士文善奉书驰达。其篇尾述偈云。西谷沙弥稽首礼。东岳上德高岩前(磻高在灵鹫之西北。故西谷沙弥乃自谓也)吹以细尘补鹫岳。飞以微滴投龙渊(云云)。山之东有大和江。乃为中国大和池龙植福所创。故云龙渊。通与晓皆大圣也。二圣而抠衣师之。道迈可知。师尝乘云往中国之清凉山。随众听讲。俄顷即还彼中僧谓是邻居者。然罔知攸止。一日令于众曰。除<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>外。别院来僧。各持所居名花异植。来献道场。智明日折山中异木一枝归呈之。彼僧见之。乃曰。此木梵号怛提伽。此云赫。唯西竺海东二灵鹫山有之。彼二山皆第十法云地菩萨所居。斯必圣者也。遂察其行色。乃知住海东灵鹫也。因此改观。名著中外。乡人乃号其庵曰赫木。今赫木寺之北岗有古基。乃其遗趾。灵鹫寺记云。朗智尝云。此庵址乃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛时寺基也。堀地得灯缸二。隔元圣王代。有大德缘会来居山中。撰师之传行于世。按华严经第十名法云地。今师之驭云。盖<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>屈三指。元晓分百身之类也欤。赞曰</p><p>想料岩藏百岁间高名曾未落人寰</p><p>不禁山鸟闲饶舌云驭无端泄往还</p><p>缘会逃名文殊岾</p><p>高僧缘会。尝隐居灵鹫。每读莲经修普贤观行。庭池常有莲数朵。四时不萎(今灵鹫寺龙藏殿。是缘会旧居)国主元圣王闻其瑞异。欲征拜为国师。师闻之。乃弃庵而遁。行跨西岭岩间。有一老叟今尔耕。问师奚适。曰。吾闻邦家滥听。縻我以爵。故避之尔。叟听曰。于此可贾。何劳远售。师之谓卖名无厌乎。会谓其慢已。不听。遂行数里许。溪边遇一媪。问师何往。答如初。媪曰。前遇人乎。曰有一老叟侮予之甚。愠且来矣。媪曰。文殊大圣也。夫言之不听何。会闻即惊悚。遽还翁所。扣颡陈悔曰。圣者之言敢不闻命乎。今且还矣。溪边媪彼何人。斯叟曰。辩才天女也。言讫遂隐。乃还庵中。俄有天使赍诏征之。会知业已当受。乃应诏赴阙。封为国师(僧传云。宪安王封为二朝王师号照咸通四年卒。与元圣年代相示未知孰是)师之感老叟处。因名文殊岾。见女处曰阿尼岾。赞曰</p><p>倚市难藏久陆况囊锥既露括难禁</p><p>自缘庭下青莲误不是云山固未深</p><p>惠现求静</p><p>释惠现。百济人。小出家。苦心专志诵莲经为业。祈禳请福。灵应良稠。兼攻三论。染指通神。初住北部修德寺。有众则讲。无则持诵。四远钦风。户外之履满矣。稍厌烦拥。遂往江南达拏山居焉。山极岩险。来往艰稀。现<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>求忘。终于山中。同学舆尸置右室中。虎啖尽遗骸。唯髅舌存焉。三周寒暑。舌犹红软。过后方变紫。硬如石。道俗敬之藏于石塔。俗龄五十八。即贞观之初。现不西学。静退以终。而乃名流诸夏立传。在唐声着矣。夫又高丽释波若入中国天台山。受智者教。观以神异。间山中而灭。唐僧传亦有章颇多灵范。赞曰</p><p>鹿尾传经倦一场去年清诵倚云藏</p><p>风前青史名流远火后江莲舌带芳</p><p>信忠挂冠</p><p>孝成王潜邸时。与贤士信忠围棋于宫庭柏树下。尝谓曰。他日若忘卿。有如柏树。信忠兴拜。隔数月。王即位赏功臣。忘忠而不第之。忠怨而作歌。帖于柏树。树忽黄悴。王怪使审之。得歌献之。大惊曰。万机鞅掌。几忘乎角弓。乃召之赐爵禄。柏树乃苏。歌曰</p><p>物叱好支柏史 秋察尸不冬尔屋支堕米 汝于多支行齐教因隐 仰顿隐面矣改衣赐乎隐冬矣也 月罗理影支古理因渊之叱 行尸浪 阿叱沙矣以支如支 儿史沙叱望阿乃 世理都 之叱逸乌隐第也 后句亡</p><p>由是宠现于两朝。景德王(王即孝成之弟也)二十二年癸卯。忠与二友相约。挂冠入南岳。再征不就。落发为沙门。为王创断俗寺居焉。愿终身立壑。以奉福大王。王许之。留真在金堂后壁是也。南有村名俗休。今讹云小花里(按三和尚传有。信忠奉圣寺。与此相混。然计其神文之世。距景德已百余年。况神文与信忠乃宿世之事。则非此信忠明矣。宜详之)又别记云。景德王代有直长李俊(高僧传作李纯)早曾发愿。年至知命须出家创佛寺。天宝七年戊子。年登五十矣。改创槽渊小寺为大刹。名断俗寺。身亦削发。法名孔宏长老。住寺二十年乃卒。与前三国史所载不同。两存之阙疑。赞曰</p><p>功名未已鬓先霜君宠虽多百岁忙</p><p>隔岸有山频入梦逝将香火祝吾皇</p><p>包山二圣</p><p>罗时有观机道成二圣师。不知何许人。同隐包山(乡去所瑟山。乃<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。此云包也)机庵南岭。成处北穴。相去十许里。披云啸月。每相过从。成欲致机。则山中树木皆向南而俯。如相迎者。机见之而往。机欲邀成也。则亦如之。皆北偃。成乃至。如是有年。成于所居之后。高岩之上。常宴坐。一日自岩缝间透身而出。全身腾空而逝。莫知所至。或云。至寿昌郡(今寿城都)指骸焉。机亦继踵归真。今以二师名命其墟。皆有遗趾。道成岩高数丈。后人置寺穴下。大平兴国七年壬午。有释成梵。始来住寺。敞万日弥陀道场。精勤五十余年。屡有殊祥。时玄风信士二十余人岁结社。拾香木纳寺。每入山采香。剪折淘洗。摊置箔上。其木至夜放光如烛。由是郡人项施其香。徒以得光之岁为贺。乃二圣之灵感。或岳神攸助也。神名静圣天王。尝于迦叶佛时受佛瞩。有本誓。待山中一千人出世。转受余报。今山中尝记九圣遗事。则未详。曰。观机。道成。搬师。[打-丁+牒]师。道义(有柏岩基)子阳。成梵。今勿女。白牛师。赞曰</p><p>相过蹯月弄云泉二老风流几百年</p><p>满壑烟霞余古木低昂寒影尚如迎</p><p>搬音般。乡云雨木。[打-丁+牒]音牒。乡云加乙木。此二师久隐岩丛。不交人世。皆编木叶为衣。以度寒暑。掩湿遮羞而已。因以为号。尝闻枫岳亦有斯名。乃知古之隐伦之士。例多逸韵如此。但难为蹈袭。子尝寓包山。有记二师之遗美。今并录之</p><p>紫茅黄精[祝/土]肚皮蔽衣木叶非蚕机</p><p>寒松飕飕石荦确日暮林下樵苏归</p><p>夜深披向月明坐一半飒飒随风飞</p><p>败蒲横卧于憨眠梦魂不到红尘羁</p><p>云游逝兮二庵墟山鹿恣登人迹稀</p><p>永才遇贼</p><p>释永才性滑稽。不累于物。善乡歌。暮岁将隐于南岳。至大岘岭。遇贼六十余人。将加害。才临刃无惧色。怡然当之。贼怪而问其名。曰永才。贼素闻其名。乃命□□□作歌。其辞曰</p><p>自矣心米 貌史毛达只将来吞隐日远鸟逸□过出知遣 今吞薮未去遣省如 但非乎隐焉破□主次弗□史内于都还于尸朗也 此兵物叱沙过乎好尸曰沙也内乎吞尼 阿耶 唯只伊吾音之叱恨隐[泳-永+善]陵隐安支尚宅都乎隐以多</p><p>贼感其意。赠之绫二端。才笑而前谢曰。知财贿之为<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>根本。将避于穷山以饯一生。何敢受焉。乃投之地。贼又感其言。皆释釰投戈。落发为徒。同隐智异。不复蹈世。才年仅九十矣。在元圣大王之世。赞曰</p><p>策杖归山意转深绮纨珠玉岂治心</p><p>绿林君子休相赠地狱无根只寸金</p><p>勿稽子</p><p>第十奈解王即位十七年壬辰。保罗国。古自国(今固城)史勿国(今泗州)等八国。并力来侵边境。王命太子奈音将军一伐等率兵拒之。八国皆降。时勿稽子军功第一。然为太子所嫌。不赏其功。或谓勿稽曰。此战之功唯子而已。而赏不及子。太子之嫌君其怨乎。稽曰。国君在上。何怨人臣。或曰。然则奏闻于王幸矣。稽曰。伐功争命。扬已掩人。志士之所不为也。励之待时而已。十年乙未。骨浦国(今合浦也)等三国王各率兵来攻竭火(疑屈弗也。今蔚州)王亲率御之。三国皆败。稽所获数十级。而人不言稽之功。稽谓其妻曰。吾闻仕君之道。见危致命。临难忘身。仗于节义。不顾死生。之谓忠也。夫保罗(疑发罗今罗州)竭火之役。诚是国之难。君之危。而吾未曾有忘身致命之勇。此乃不忠甚也。既以不忠而仕君。累及于先人。可谓孝乎。既失忠孝。何颜复游朝市之中乎。乃被发荷琴入师彘山(未详)悲竹树之性病。寄托作歌。拟溪涧之咽响。扣琴制曲。隐居不复现世</p><p>迎如师</p><p>实际寺释迎如。未详族氏。德行双高。景德王将邀致供养。遣使征之。如诣内斋罢。将还。王遣使陪送至寺。入门即隐。不知所在。使来奏。王异之。追封国师。后亦不复现世。至今称曰国师房</p><p>布川山五比丘景德王代</p><p>歃良州东北二十许里有布山川。石窟奇秀。宛如人斲。有五比丘。未详名氏。来寓而念弥陀求西方几十年。忽有圣众自西来迎。于是五比丘各坐莲台。乘空而逝。至通度寺门外留连。而天乐间奏。寺僧出观。五比丘为说<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦空之理。蜕弃遗骸。放大光明。向西而去。其捐舍处。寺僧起亭榭。名置楼。至今存焉</p><p>念佛师</p><p>南山东麓有避里村。村有寺。因名避里寺。寺有异僧。不言名氏。常念弥陀。声闻于城中。三百六十坊。十七万户。无不闻声。声无高下。琅琅一样。以此异之。莫不致敬。皆以念佛师为名。死后泥塑真仪。安于敏藏寺中。其本住避里寺。改名念佛寺。寺旁亦有寺名让避。因村得名</p><p>孝善第九真定师孝善双美</p><p>法师真定罗人也。白衣时隶名卒伍。而家贫不娶。部役之余。佣作受粟。以养孀母。家中计产。唯折脚一铛而已。一日有僧到门。求化营寺铁物。母以铛施之。既而定从外归。母告之故。且虞子意何如尔。定喜现于色曰。施于佛事。何幸如之。虽无铛又何患。乃以瓦盆为釜。熟食而养之。尝在行伍间。闻人说义湘法师在太伯山<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>利人。即有向慕之志。告于母曰。毕孝之后。当投于湘法师。落发学道矣。母曰。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>难遇。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>大速。乃曰毕孝。不亦晚乎。曷若趁予不死。以闻道闻。慎勿因循。速斯可矣。定曰。萱堂晚景。唯我在侧。弃而出家。岂敢忍乎。母曰。噫为我防出家。令我便堕泥黎也。虽生养以三牢七鼎。岂可为孝。予其衣食于人之门。亦可守其天年。必欲孝我。莫作尔言。定沉思久之。母即起罄倒囊储。有米七升。即日毕炊。且曰。恐汝因熟食经营而行慢也。宜在予目下。餐其一。槖其六。速行速行。定饮泣固辞曰。弃母出家。其亦人子所难忍也。况其杯浆数日之资。尽裹而行。天地其谓我何。三辞三劝之。定重违其志。进途宵征。三日达于太伯山。投湘公剃染为弟子。名曰真定。居三年。母之讣音至。定跏趺入定。七日乃起 说者曰。追伤哀毁之至。殆不能堪。故以定水涤之尔。或曰。以定观察母之所生处也。或曰。斯乃如实理荐冥福也。既出定以后。事告于湘。湘率门徒归于小伯山之锥洞。结草为庐。会徒三千。约九十日。讲华严大典。门人智通随讲。撮其枢要成两卷。名锥洞记。<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>于世。讲毕。其母现于梦曰。我已生天矣</p><p>大城孝二世父母神文代</p><p>牟梁里(一作浮云村)之贫女庆祖有儿。头大顶平如城。因名大城。家窘不能生育。因役佣于货殖福安家。其家俵田数亩以备衣食之资。时有开士渐开。欲设六轮会于兴轮寺。劝化至福安家。安施布五十疋。开咒愿曰。檀越好<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。天神常护持。施一得万倍。安乐<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长。大城闻之。跳踉而入。谓其母曰。予听门僧诵倡。云施一得万倍。念我定无宿善。今兹困匮矣。今又不施。来世益艰。施我佣田于法会。以图后报何如。母曰善乃施田于开。未几城物故。是日夜国宰金文亮家有天唱云。牟梁里大城儿今杔汝家。家人震惊使检牟梁里。城果亡。其日与唱同时有娠生儿。左手握不发。七日乃开。有金简子雕大城二字。又以名之。迎其母于第中兼养之。既壮。好游猎。一日登吐含山捕一熊。宿山下村。梦熊变为鬼。讼曰。汝何杀我。我还啖汝。城怖懅请容赦。鬼曰。能为我创佛寺乎。城誓之曰喏。既觉。汗流被蓐。自后禁原野。为熊创长寿寺于其捕地。因而情有所感。悲愿增笃。乃为现生二亲创佛国寺。为前世爷娘创石佛寺。请神琳表训二圣师各住焉。茂张像设。且酬鞠养之劳。以一身孝二世父母。古亦罕闻。善施之验可不信乎。将雕石佛也。欲炼一大石为龛盖。石忽三裂。愤恚而假[穴/(爿*未)]。夜中天神来降。毕造而还城方[木*尤]起。走跋南岭。爇香木以供天神。故名其地为香岭。其佛国寺云梯石塔雕镂石木之功。东都诸刹未有加也。古乡传所载如上。而寺中有记云。景德王代。大相大城以天宝十年辛卯始创佛国寺。历惠恭世。以大历九年甲寅十二月二日大城卒。国家乃毕成之。初请瑜伽大德降魔住此寺。继之至于今。与古传不同。未详孰是。赞曰</p><p>牟梁春后施三亩香岭秋来获万金</p><p>萱室百年贫富贵槐庭一梦去来今</p><p>向得舍知割股供亲景德王代</p><p>熊川州有向得舍知者。年凶。其父几于饿死。向得割股以给养。州人具事奏闻。景德王赏赐租五百硕</p><p>孙顺埋儿兴德王代</p><p>孙顺者(古今作孙舜)牟梁里人。父鹤山。父没。与妻同。但傅人家得米谷养老娘。娘名运乌。顺有小儿。每夺娘食。顺难之。谓其妻曰。儿可得。母难再求。而夺其食。母饥何甚。且埋此儿以图母腹之盈。乃负儿归醉山(山在牟梁西北)北郊。堀地忽得石钟甚奇。夫妇惊怪。乍悬林木上。试击之。舂容可爱。妻曰。得异物殆儿之福。不可埋也。夫亦以为然。乃负儿与钟而还家。悬钟于梁扣之。声闻于阙。兴德王闻之。谓左右曰。西郊有异钟声。清远不类。速检之。王人来检其家。具事奏王。王曰。昔郭巨瘗子。天赐金釜。今孙顺埋儿。地涌石钟前孝后孝。覆载同鉴。乃赐屋一区。岁给粳五十硕。以尚纯孝焉。顺舍旧居为寺。号弘孝寺。安置石钟真圣王代。百济横贼入其里。钟亡寺存。其得钟之地名完乎坪。今讹云枝良坪</p><p>贫女养母</p><p>孝宗郎游南山鲍石亭(或云三花述)门客星驰。有二客独后。郎问其故。曰芬皇寺之东里有女。年二十左右手抱盲母相号而哭。问同里曰。此女家贫。乞啜而反哺有年矣。适岁荒。倚门难以借手。赎赁他家。得谷三十石。寄置大家服役。日暮槖米而来家。炊饷伴宿。晨则归役大家。如是者数日矣。母曰。昔日之糠秕。心和且平。近日之香粳。膈肝若刺。而心未安。何哉。女言其实。母痛哭。女叹已之但能口腹之养。而失于色难也。故相持而泣。见此而迟留尔。郎闻之潜然。送谷一百斛。郎之二亲亦送衣裤一袭。郎之千徒敛租一千石遗之。事达宸聪。时真圣王赐谷五百石。并宅一廛。遣卒徒卫其家。以儆劫掠。旌其坊为<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>之里。后拾其家为寺。名两尊寺</p><p>吾东方三国。本史遗事两本。他无所刊。而只在本府。岁久勅薄R恍锌山饨鏊奈遄帧S辔┦可?故馈@?壑钍贰F溆谔煜轮温倚送觥S胫钜旒!I杏?┦丁?鼍邮前睢2恢?涔?隆?珊酢R蛴?目?9闱笸瓯尽T氖?夭坏醚善湓?毙杏谑馈H宋匆椎眉??芍?艚癫桓摹T蚪??Т??酵?隆:笱Ь鼓?胖??商疽惨选P椅崴刮男侵菽潦谷ü</p></div>"
}]