[{
    "title": "往生集 第2072部",
    "author": "袾宏大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p><a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>集 卷上</p><p>往生集序</p><p><a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>始成正觉。为诸有情普演佛乘。既而机难尽投。由是于一乘中示三乘法。而复于三乘中出<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>一门。今去佛日远情尘日滋。进之不能发神解超圣阶。退之伥伥乎有沦坠之险。而匪仗此门。其何从疾脱<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。大矣哉。可谓起末世沉痾必效之灵药也。顾古之效多今之效鲜。其咎安在。则亦口净土心娑婆。而坚勇明悟不及前辈云尔。闻昔有传往生者。岁久灭没不可复睹。而断章遗迹班班。互载于内外百家之书。予随所见辄附笔劄。仍摘其<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>昭灼者。日积之成编。殆存十一于千百而已。今甲申窃比中峰廛居。掩关于上方。乃取而从其类后先之。又证之以诸圣同归。足之以生存<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>。计百六十有六条。而间为之赞。以发其隐义。题曰往生集。俾缁素之流观于是书将指而曰。某也以如是<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>而生。某也以如是纯一而生。某也以如是精诚之极感格而生。某也以如是大悲大愿而生。某也以如是改过不吝转业于将堕也而生。某如是上生。某如是中生下生。庶几乎考古验今为净业者左倦。而客有过我者。阅未数传。勃然曰。净土<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。心外无土。往生净土寓言也。子以为真生乎哉。宁不乖于无生之旨。予俟其色定。徐而谓曰。谈何容易。如以无生而已矣。一切断灭不应尚有唯心。果悟无生则生亦奚碍。生既本无故终日生而未尝生也。且尔已尽漏心否乎。对曰不能。噫漏心未尽则生缘未休。生缘未休则托质有所。茫茫<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>大<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>中。不生净土而生何土。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之匍匐。九品之逍遥。利与害天渊矣。抑未之思欤。饰虚论而争高。吾亦能之。所以弗为者。夫亦惧生于识法耳行矣。尔诚不以予言为非。即净土而之佛乘。盖未尝间隔丝毫。而奚乖之有。客悚然从坐而作。惘然而自失不觉。其汪然泣下而悲且咽也。整衣庄诵之终卷。亟拜亟请梓焉。梓既成。道其始末如此</p><p>万历十二年夏日杭<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>袾宏识</p><p>往生集目录</p><p>第一卷沙门往生类</p><p>第二卷王臣往生类处士往生类尼僧往生类妇女往生类恶人往生类畜生往生类</p><p>第三卷诸圣同归类生存感应类</p><p>古杭云栖寺沙门袾宏辑</p><p>沙门往生类</p><p>远祖师</p><p>晋慧远。雁门楼烦人。博综六经。尤善庄老。闻安法师讲<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经。豁然大悟。因剃染事之。太元六年过浔阳。见庐山闲旷。可以息心。遂感山神现梦。一夕雷雨。林木自至。刺史桓伊。乃为建殿。名曰神运。以慧永先住西林。故远所居号东林焉。远住东林。三十年迹不入俗。克志西方。高僧钜儒。凡百四十人。共为净社。莲漏六时禅诵不辍。澄心系想。三睹圣相而沉厚不言。后十九年七月晦夕。于般若台。方从定起。见阿弥陀<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>满<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。圆光之中。无量化佛。观音势至。左右侍立。又见水流光明。分十四支。洄注上下。演说妙法。佛言。我以本愿力故。来安慰汝。汝七日后。当生我国。又见<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>耶舍。慧持。慧永。刘遗民。在佛之侧。揖曰。师志在先。何来之晚耶。既知时至。谓门人曰。吾始居此三睹圣相。今复再见。当生净土必矣。至期端坐入寂。时义熙十二年八月六日也</p><p>赞曰。晋以前。净土之旨。虽闻于震旦。而弘阐力行。俾家喻户晓。则自远师始。故万代而下。净业<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。推师为始祖。可谓。释迦再说西方。弥陀现身东土者也。厥功顾不伟欤。予昔游庐山。酌虎溪之泉。瞻三笑之堂。徘徊十八贤之遗迹。见其规模弘远。足称万僧之居。而殿阁尘埃。钟鼓閴寂。寥寥然户异其扃。室殊其爨矣。哲人云亡。芳躅无继。嗟夫</p><p>慧永</p><p>晋慧永。河内人。十二<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。既而与远公。同依安法师。太元初。驻锡庐山。刺史陶范。舍宅为西林以居之。绝志尘嚣。标心安养。后义熙十年示疾。忽敛衣求屣欲起。众惊问。答曰。佛来迎我。言讫而化。异香七日方灭。唐玄宗。追谥觉寂大师</p><p>赞曰。永初入道。与远师伯仲。而创净社。以为万世法。亦远祖而永宗矣。至于命终之际。见佛来迎。先后如出一辄。证往生之瑞。当以二师为准则焉</p><p>昙顺</p><p>晋昙顺。黄龙人。幼从罗什法师。讲释群经。什叹曰。此子奇器也。后入庐山修净业。时宁蛮校尉刘遵孝。创寺江陵。延顺经始。盛弘<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。宋元嘉二年。别众坐逝。异香满室焉</p><p>僧睿</p><p>晋僧睿。冀州人。游学诸方。远历<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>。还关中。从罗什法师。禀受经义。后预庐山莲社。宋元嘉十六年。忽告众曰。吾将行矣。面西合掌而化。众见睿榻前一金莲花。倏尔而隐。五色香烟。从其房出</p><p>昙恒</p><p>晋昙恒。河东人。童孺依远公出家。内外典籍。无不通贯。自入庐山。专志念佛。义熙十四年。端坐合掌。厉声念佛而化</p><p>道昉</p><p>晋道昉。颖川人。幼师远公。通经律。言与行合。念佛三昧。究心无间。义熙十四年。豫章太守王虔。入山谒敬。请绍远师之席。众咸宗仰。元嘉十二年。集众念佛。就座而化</p><p>赞曰。言行合一。所谓心口二俱念佛者也。听其言则是。稽其行则非。而欲冀往生。将谁欺乎</p><p>昙诜</p><p>晋昙诜。广陵人。幼师远公。勤修净业。兼善讲说。注维摩经行于世。元嘉十七年。趺坐念佛而逝</p><p>道敬</p><p>晋道敬。琅琊人。祖凝之刺江州。因从远公出家年十七。博通经论。日记万言。笃志念佛。蚤夜弗替。宋永初元年。谓众曰。先师见命。吾其行矣。端坐唱佛而化。众见光明满室。弥时方灭</p><p>赞曰。冲年高才。鲜不自恃。而笃志念佛。非宿植净因者乎。今<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>略涉经论。我慢放逸。白首而无归。不得已而谈西方晚矣</p><p>佛驮跋陀罗</p><p>晋佛驮跋陀罗。此云觉贤。迦维卫国人。<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>饭王之裔也。年十六博学群经。深达禅律。姚秦沙门智严至西域。要师达长安。演法东宫。与罗什法师上下论议。后以悬指海舶遭摈。入庐山预远公莲社。译出观佛三昧诸经。宋元嘉六年。念佛而化</p><p>僧济</p><p>晋僧济。入庐山从远公学。达叹曰。绍隆大法。其在尔乎。后疾笃。诚期净土。远遗烛一枝曰。汝可运心安养。济执烛凭几。停想无乱。又集众讽净土经。五更济以烛授弟子元弼。令随众行道。顷之。觉自秉一烛。乘空而行。见阿弥陀佛。接置于掌。遍至十方。欻然而觉。且悲且慰。自省四大。了无疾苦。明夕。忽起立。目逆虚空。如有所见。须臾还卧。容色愉悦。谓傍人曰。吾行矣。右胁而逝。时方炎暑。三日而体不变。异香郁然</p><p>赞曰。济以圣师指示。而生净土。然则<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>助念。孰曰无功乎。而留龛溽暑。体发异香。梵行之精坚验矣</p><p>慧恭</p><p>晋慧恭。豫章酆城人。与慧兰僧光等同学。兰光系念净土。临终皆有奇应。又五年恭病笃。雨泪叩头。誓心安养。念不少间。见阿弥陀佛。以金台前迎。恭乘其上。又见兰等。于台上光明中。告曰。长老受生已居上品。吾等不胜喜慰。恨五浊淹延。相依之晚耳。恭欣然奋迅而逝</p><p>慧虔</p><p>晋慧虔。少出家戒行精确。义熙年中。投山阴嘉祥寺。苦身率众后寝疾。属想安养。祈诚观音。北寺有净严尼者。宿德笃行。夜梦观音从西郭门入。清辉妙状。光映日月。幢幡华盖。七宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。尼惊异作礼。问大士何往。答云。往嘉祥迎虔公耳。虔疾虽困。神色如常侍者皆闻异香。泊然而化</p><p>赞曰。临终见佛。或疑纯是自己想心。今他人亦见之何也。当知感应道交。不可思议。慎哉言乎</p><p>僧显</p><p>晋竺僧显。南游江左。遇疾属缘西方。虔苦不替。见阿弥陀佛。光照己身。所患皆愈。即起沐浴。为傍人说所见。并陈诫因果。辞意剀切。明晨端坐而化</p><p>赞曰。<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a><a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。遇有疾则曰。吾力且惫。待平复已。然后念佛。不知念佛。为度老病。有疾念佛。今正是时。而显以念力。既愈其疾。复得往生。贤哉</p><p>慧通</p><p>晋慧通。从凉州慧绍禅师。咨受禅法。祈心安养。微疾。于<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>中。见一人形甚端严。语通云。良时至矣。俄而见阿弥陀<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>明烨然。定起以告同学。安然而化。异香三日乃歇</p><p>法琳</p><p>晋法琳。临邛人。专精戒品。止成都灵建寺修净业。常持弥陀观音二经。转诵之时。辄见一伟貌沙门。屹然在前。建武二年寝疾。注念西方。礼忏不息。见诸贤圣皆集空中。合掌而逝</p><p>赞曰。琳诵经有沙门现前。盖诚感耳无足为异。其生西方。不系乎是。修净业者。毋取相希慕焉</p><p>昙鉴</p><p>宋昙鉴。平生片善。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>西方。誓愿见佛。一日定中。见阿弥陀佛。水洒其面。曰涤汝尘垢。浴汝心念。及汝身口。皆悉严净。又于瓶中。出莲花一枝授之。定起乃与寺僧叙别。夜渐深。独步廊下念佛。至五鼓。其声弥厉及明。弟子依常问讯。趺坐不动。就而视之。逝矣</p><p>僧柔</p><p>齐僧柔。学方等诸经。惟以净业为怀。卒之日见化佛千数。室内外俱闻异香。西向敬礼而化</p><p>慧光</p><p>齐慧光。居洛阳。着华严<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>十地等疏。妙尽权实之旨。一日有疾。见天众来迎。光曰。我所愿归安养耳。已而净土化佛。充满虚空。光曰。惟愿我佛摄受。遂我本愿。即弹指罄咳。言气俱尽</p><p>赞曰。天多欲乐。兼有女人非解脱处。古谓。假饶修到非非想不若。西方归去来。是以赞净土者。谓上品即发<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。下生犹胜天宫。今光于命尽之际。而详审坚固所愿确然。可谓明且勇矣</p><p>慧进</p><p>齐慧进。居高座寺。誓诵法华。造经百部。愿回此业得生安养。后闻空中告曰。汝愿已足。必得往生。无病而卒</p><p>道珍</p><p>梁道珍。住庐山修净业。梦有人乘船海中。问之。云往弥陀佛国。珍乞随行。船人云。汝未营浴室。及诵弥陀经。未可也。觉而浴僧诵经。历年不辍。忽房内池面。降白银台。因默记其事。书经函中。命尽之夕。半山以上。如烈火千炬。交相辉映。邑人遥见。谓是诸王礼觐。及旦乃闻珍卒。后检经函。知珍瑞应。宜生净土久矣</p><p>赞曰。远公三睹圣相而不言。珍公池降银台而默记。古德之厚重类如此。彼浅丈夫者。才有少异。晓晓自鸣。小则失其所有。大则增其魔事矣。可弗慎诸</p><p>神鸾</p><p>后魏昙鸾。少游五台。感灵异出家。而性嗜长生。受陶隐君仙经十卷。后遇<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>流支。乃问曰。佛有长生不死术乎。支笑曰。长生不死。吾佛道也。乃授十六观经曰。学此则三界无复生。六道无复往。其为寿也。河沙劫石。莫能比焉。此吾金仙氏之长生也。鸾大喜。遂焚仙经而修净业。寒暑疾痛曾无少懈。魏主号为神鸾。一夕室中见梵僧。谓曰。吾龙树也。久居净土。以汝同志故来相见。鸾自知时至。集众教诫曰。劳生役役。其止无日。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>诸苦。不可以不惧。九品净业。不可以不修。因令弟子高声念佛。西向稽颡而终。众闻天乐自西而来。良久乃已</p><p>赞曰。黄冠者恒言曰。释氏有死。神仙长生。今支公谓佛有长生。仙无长生。此论痛快简当。高出千古。鸾法师舍伪归真。如脱敝屣。岂非宿有正因者哉</p><p>智者大师</p><p>隋智顗。号智者大师。颖川人。孩幼之时。见像即礼。逢僧必拜。十八出家于果愿寺。后礼南岳思大禅师。弘法缘毕。在剡东石城寺。将入灭谓弟子曰。吾知命在此。不复前进。辍斤绝弦于今日矣。唱观无量寿<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>题竟。复曰。四十八愿。庄严净土。华池宝树。易往无人。火车相现。一念改悔者。尚得往生。况戒定熏修。圣行道力。功不唐捐矣。智朗请云。未审大师证入何位。没此何生。师曰。吾不领众。必净六根。损己利人。但登五品。汝问何生者。吾诸师友。侍从观音。皆来迎我。言讫唱<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>名。如入三昧</p><p>赞曰。大师<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>崇重一家教观。万代宗仰。而舍寿之际。惟西方是归。乃至疏观经。着十疑论。恒于此谆谆焉。意可知矣。或曰。疏称心观为宗。净土其非实欤。噫大师谓。约心观佛。不谓无佛。如其无佛。心观何施。正报既然。依报亦尔。学台教者审之</p><p>法喜</p><p>隋法喜。常行方等忏法。忽一雉索命。有神人呵曰。法师当往生净土。岂偿汝命。后于病中。发愿以一生行业。回向西方。至心念佛。即见佛菩萨来迎。端坐而化</p><p>赞曰。经称假使百千劫。所作业不忘。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>会遇时。<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>还自受。喜恶得以生净土不偿雉命。良由一生净土。永绝<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。因缘何从而得会遇。若其忍悟无生。入尘利物。纵有报偿。则所谓将头临白刃。一似斩春风者矣。岂与凡夫六道等耶</p><p>章安</p><p>隋灌顶。章安人。智者大师弟子也。日以念佛为事。临终室有异香。遗诫弟子竟。忽起合掌。称阿弥陀佛二大士名。奄然而化</p><p>慧成</p><p>隋慧成。居枝江。诵弥陀经。修西方观三十年。常坐不卧。每入定见净土莲台宝树。临终之夕。人梦成坐莲花。隐隐西去</p><p>道喻</p><p>隋道喻。居开觉寺。念阿弥陀佛。日夜不废。造像仅三寸。后于定中。见佛谓曰。汝造我像何小。喻曰。心大即大。心小即小。言讫见像。身遍满虚空。告曰。汝当澡浴清净明星出时。我来迎汝。至时果见佛来。光明满室。遂坐而化</p><p>赞曰。心大即大。心小即小。然则心秽即秽。心净即净审矣。而喻见一佛遍空。前僧柔慧光。见多佛遍空。盖一即多。多即一。非有优劣也</p><p>智舜</p><p>隋智舜。入庐山踵远师净业。大业初。讲观经毕。即示疾。见鹦鹉孔雀。念<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧。出微妙音。告弟子曰。我今日往生矣。安然而逝</p><p>慧海</p><p>隋慧海。住江都安乐寺。善经论。精诚念佛。有僧道铨者。至自齐州。赍阿弥陀佛像。微妙工巧。世所未有。问之则云。此天竺鸡头摩寺五通菩萨。乘空往彼安乐世界。图绘而来。海感庆逢遇虔笃礼敬。乃睹神光昭烁。于是模写恳苦。愿生彼国。后微疾。夜忽起。依常面西礼竟。跏趺至晓而逝。俨然如生</p><p>赞曰。<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>过此十万亿佛土。亦非乘空所可到者。慧海之精诚感佛。彼道铨安知。非净土之贤圣乎</p><p>法智</p><p>隋法智。髫年出家。晚岁闻径直之门。莫如念佛。乃谓人曰。我闻。经言。犯一吉罗。历一中劫。入地狱可信。又言。一称阿弥陀佛。灭八十亿劫生死重罪。则未之信。有明者示云。汝大邪见。俱是佛言。何得不信。遂于国清寺兜率台。昼夜精勤念佛。忽辞道俗云。某生西方去也。中夜无疾而化。时有金色光明。照数百里。江上渔人谓是天晓。迟久方明。始知智之往生云</p><p>赞曰。佛云吾言如蜜。中边皆甜。悉宜信受。是故信少恶入地狱。而不信一念生西方。此诚可谓邪见矣。近世喜持咒者。见陀罗尼所说<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。能易山海役鬼神。满种种求愿。则跃然而信。见净土所说功德。能直入圣阶。立超三界。则恬然不介意。其为邪见等耳。可慨也夫</p><p>善导和尚</p><p>唐善导。贞观中。见西河绰禅师九品道场。喜曰。此真入佛之津要。修余行业。迂僻难成。惟此法门。速超生死。于是勤笃精苦。昼夜礼诵。激发<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>。每入室互跪。念佛非力竭不休。出则为人演说净土。三十余年不暂睡眠。好食送厨。粗恶自奉。凡有嚫施。用写弥陀经十万卷。净土变相三百壁。修营废坠。燃灯续明。三衣瓶钵。不使人持。行不共众。恐谈世事。从其化者甚众。有诵弥陀经十万至五十万遍者。有念佛日课万声至十万声者。得念佛三昧。往生净土者。莫能纪述。或问。念佛生净土耶。师曰。如汝所念。遂汝所愿。乃自念一声。有一光明从其口出。十至于百。光亦如之。其劝世偈曰。渐渐鸡皮鹤发。看看行步龙钟。假饶金玉满堂。岂免衰残病苦。任汝千般快乐。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>终是到来。惟有径路<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。但念阿弥陀佛。忽谓人曰。此身可厌。吾将西归。乃登柳树。向西祝曰。愿佛接我。菩萨助我。令我不失<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>往生净土。言已投身而逝。高宗皇帝知其事。赐寺额曰光明云</p><p>赞曰。善导和尚。世传弥陀<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。观其自行之精严。利生之广博万代而下。犹能感发人之<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。脱非弥陀必观音普贤之俦也。猗欤大哉</p><p>智钦</p><p>唐智钦。专习禅业。又礼念万五千佛名。乃至百遍。后于柳州阿育王塔前。燃一臂求生净土。弟子僧护。夜半见庭前光照异常。因问。何人秉炬。凡三问。空中声曰。来迎钦禅师耳。护急启窗。见佛身光明。旛华宝盖满虚空中。钦随佛冉冉而去</p><p>赞曰。烧身烧臂。大乘经中屡开。然此得忍大士所为。非初心境界也。求西方者。当学钦公之习禅<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。不必效其燃臂。若能用燃臂之精虔勇猛。以治其恶习则所燃亦多矣。古云。善学柳下惠。不其然欤</p><p>五会法师</p><p>唐法照。大历二年。止衡州云峰寺。慈忍戒定。为时所宗。尝于钵内睹五色云。有梵刹曰大圣竹林寺。后诣五台见异光。果得竹林寺。入讲堂则文殊在西。普贤在东。万众围绕而为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。照作礼问曰。末代凡夫。未审修何法门。文殊告曰。诸修行门无如念佛。我以念佛得一切种智。又问当云何念。曰此世界西。有阿弥陀佛。彼佛愿力。不可思议。汝当继念毋令断绝。决定往生。后腊月朔。在华严院净业道场。方忆二大士记我往生。乃一心念佛。忽见梵僧佛陀波利。谓曰。汝华台已就。后三年华开矣。至期谓众曰。吾行矣。端坐而逝。师尝于湖东寺。开五会念佛。感祥云宝阁。睹阿弥陀佛及二菩萨身满虚空。又于并州五会念佛。感代宗皇帝宫中闻念佛声。遣使追寻。乃见师劝化之盛。遂诏入京。教宫人念佛亦及五会。号五会法师</p><p>赞曰。感梦于前。睹境于后。其可信明矣。然则诸修行门。无如念佛。文殊口授也。顾不足信欤。三载之前。花台预就。所谓信心才起。莲蕊标名。随其勤惰而或鲜或萎。又不足信欤。噫冥现灵踪。预符圣记。化行五会。音彻九重。岂非乘悲愿而生者哉</p><p>台岩康法师</p><p>唐少康。缙云仙都人。十五通法华楞严。贞元中因诣洛阳白马寺。见殿中文字放光。探之则善导和尚。西方化导文也。师祝曰。若于净土有缘。当更放光。言已光明闪烁。师曰。劫石可磨。我愿无易矣。遂至长安光明寺善导和尚影堂。瞻礼忽见遗像。升空谓曰。汝依吾教广化有情。他日功成。必生安养。乃适新定。乞钱诱小儿念佛。念佛一声与钱一文年余。无少长贵贱。见师者皆称阿弥陀佛。念佛之声盈满道路。又于乌龙山建净土道场。每升座高声唱佛。众见一佛从其口出。十声则有十佛。师曰。汝见佛者必得往生。时众数千。有不见者。悲伤自责。因倍<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。后二十一年十月三日。嘱道俗曰。当于净土起欣乐心。于阎浮提起厌离心。汝曹此时。见我光明。真我弟子。遂放异光数道而逝。塔于台子岩。号台岩法师</p><p>赞曰。或疑佛从口出。似涉怪异。噫世尊逢醉象时。手五指端。出金光狮子。其言曰。我何有心于御象哉。以我<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来。修慈忍力。自然而有狮子现焉。我亦不知也。今康公现佛。亦无量劫来。归敬之所致耳。何怪之有。世有魔师。教人黑夜习坐。于香烟上注观佛现。以为感应。较此邪正实霄壤焉。修净业者。不可不辩</p><p><a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a></p><p>唐自觉。住真州。常发愿。愿因观音。得见阿弥陀佛。于是铸观音像。高四十九尺。既成祝愿。夜三更。忽有金光二道。阿弥陀佛。自光中而下。二大士左右随之。佛垂手摩觉顶曰。守愿勿易。利物为先。宝池生处。孰不如愿。后十一年七月望夕。见一人形似天王。云间现身。谓觉曰。安养之期至矣。即于观音像前。趺坐而化</p><p>善胄</p><p>唐善胄。瀛州人。武德三年病革。谓门人曰。吾一生正信。不虑净土不生。即令拂拭房宇<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>严待。病久委卧。忽起坐合掌。语侍人曰。安置世尊令坐。又自陈<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。良久曰。世尊去矣。低身似送因卧曰。向者阿弥陀佛来。汝等还见否。不久吾当去耳。少顷而逝</p><p>神素</p><p>唐神素。安邑鸣条人。讲演为业。与道杰齐名。一生行业。属想西方。贞观二年众请主栖岩。十七年二月二十三日召大众与别。趺坐正容令诵观音<a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>二遍。自称阿弥陀佛又令一人唱。余人和中夜端坐俨然而逝。肌肉虽尽骨坐如初</p><p>慧璇</p><p>唐慧璇。出家襄川。尝弘三轮大经。贞观二十三年四月八日。夜见山神告曰。法师房宇不久当生西方。至七月十四日。讲<a href=\"/fojing/yulanpenjing/\" class=\"keylink\" target=\"_blank\">盂兰盆经</a>竟敛手曰。生受信施今须通散。一毫以上。舍入十方穷独乞人。并诸异道。言已终于法座</p><p>赞曰。昔生公说法将竟。众见麈尾坠地。凭几而化。如入禅定。璇之事亦类是矣。呜呼匪平生道力。可勉强于临时耶</p><p>怀玉</p><p>唐怀玉。台州人。布衣一食。常坐不卧。诵弥陀经三十万遍。日课<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>五万声。天宝元年。见佛菩萨满虚空中。一人持银台来迎。玉曰。吾一生念佛。誓取金台。何为不然。圣众遂隐。玉弥加精进。三七日后。向擎台者来云。师以精进得升上品。宜趺坐以俟。三日后异光满室。曰弟子曰。吾生净土矣。含笑而逝。郡太守叚公。作偈赞曰。我师一念登初地。佛国笙歌两度来。惟有门前古槐树。枝低只为挂金台</p><p>赞曰。或谓银台至而复隐。金台誓而重来。何得果报无凭。由人拣择。通曰。此正谓万法由心随感而应者也。且火车已现。十念而得往生。天众来迎。矢心而归净土。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>圣凡之相。隔尚可转业须臾。况金银几希间耶</p><p>道昂</p><p>唐道昂。魏郡人。师灵裕法师。常于寒陵山寺。讲华严地论。稽洽博诣。志结西方。愿生安养后自知命极。预期八月。人未之测也。至八月朔日无所患。问斋时至未。即升高座。身含奇相。炉患异香。引四众受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>。词理切至。听者寒心。昂举目高视。见天众缤纷。管弦嘹喨。告众曰。兜率陀天迎我。然天道乃生死根本。由来非愿常祈心净土。如何此诚不果遂耶。言讫天乐还灭。便见西方香花伎乐。充塞如云。飞涌而来旋环顶上。举众皆见。昂曰。今西方灵相来迎事须愿往。但见香炉坠手。即于高座而逝。足下有普光堂等字。遐迩惊叹</p><p>赞曰。却天宫而求净土。前有光公。后有洪公及昂。盖三人焉而时逼须臾。犹能导四众以毗尼。据高座而归寂。灵相纷然骇人心目。呜呼异哉</p><p>道绰</p><p>唐道绰。并州汶水人。十四出家。习经论。晚事瓒禅师学禅。又笃志神鸾净土之业。有僧定中。见绰数珠如七宝大山。平居为众讲无量寿观经。将二百遍。人各掐珠。口称佛号。或时散席。向弥林谷。六时礼敬。初不废缺。念佛日以七万为限。贞观二年四月八日归寂。闻而赴者。满于山寺。见化佛住空。天花下散焉</p><p>宝相</p><p>唐宝相。雍州长安人。十九出家。头陀自静。六时礼忏。垂四十年。夜分诵弥陀经七遍。念佛六万声。病既革。诵念不舍。嘱道俗曰。念佛为先。勿虚度世。当于西方相待。又曰。烧散吾尸。不劳铭塔。言讫而逝</p><p>赞曰。玉念佛日。记五万绰七万。相今六万。三老者皆高僧。而日课有常数。今人忽之曰。此愚夫妇所作也。独何欤</p><p>惟岸</p><p>唐惟岸。并州人。约净土为真归之地。行方等忏。服勤无缺微疾。见观音势至二菩萨现于空中。岸召画工。无能画者。忽有二人。自言能画。画毕不见。岸乃告诸弟子曰。吾今往生。谁偕<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。有童子愿往。岸令辞父母。父母谓为戏言未信也。顷之沐浴更衣。入道场念佛而化。岸抚其背曰。小子何得先吾行耶。因索笔赞二菩萨。有愿以慈悲手。提奖共西行之句。赞毕长逝</p><p>赞曰。岸之事无惑矣。彼童子非久积净业。胡脱化之神异噫。尔不见十念成功乎。不然则宿世善根熟耳。修净业者。或今身不克往生。观此可以自慰</p><p>僧炫</p><p>唐僧炫。并州人。初念慈氏。期上生内院。年九十遇道绰禅师。得闻净土。始回心念佛。日礼千拜。一心无怠。后有疾。告弟子曰。阿弥陀佛授我香衣。观音势至示我宝手。吾其行矣。言讫而逝。七日异香不散。时有启芳圆果二法师。目击斯事。乃于悟真寺。共折杨枝于观音手中。誓曰。若于净土有缘。当七日不萎。至期益茂。芳果庆忭。昼夜观念不舍。忽觉临七宝池。入大宝帐。见佛及二大士。坐宝华台光明辉映。芳果作礼。佛云。念我名者皆生我国。又闻释迦世尊。与文殊菩萨以<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>声。称赞净土。复见三道宝阶。其一白衣。其二道俗相半。其三唯僧也。云皆至心念佛者。得生此土耳。后五日。忽闻钟声曰。钟声我辈事也。俱时化去</p><p>赞曰。耄耋之年。始修净业。而尚得往生。少壮可知矣。彼芳果闻风兴起。终获灵应。见贤思齐。其此之谓乎</p><p>怀感</p><p>唐怀感。居长安千福寺。入念佛道场。三七日不睹灵瑞。自恨障深。欲绝食毕命。善导大师不许。劝令精虔三载感如所教。后见佛金色玉毫。得念佛三昧。制决疑论七卷。临终合掌云。佛来迎我。遂卒</p><p>赞曰。谚有之。惟贵功深。杵可作针。吾于感有征矣。画地自限者思之</p><p>德美</p><p>唐德美法师。于会昌寺西院。造忏堂行般舟三昧。终夏不坐卧。或止口过三年不言。或行不轻。七众通礼节衣减食。断绝世想。专念西方。口诵弥陀。终其身不辍。后一时入室称佛。倏然而化</p><p>赞曰。断绝世想则染缘尽。专念西方则净缘成。先民有言。爱不重不生娑婆。念不一不生净土诚哉言乎</p><p>辩才</p><p>唐辩才。襄阳人。潜修净土二十年。未尝自称。独与护戎任公善。谓之曰。才必生净土。期在十年。一日令弟子报任公曰。向所期已。及任公至。才曰。吾去矣。趺坐而化。众闻仙乐西来。异香散漫</p><p>寿洪</p><p>唐寿洪。汾阳人。常念佛。虔求净土将亡。见兜率天童子来迎。洪曰。我期西往。不生天上。即令众念佛。遽云。佛从西来。言讫而化</p><p>法祥</p><p>唐法祥。住杨都大兴国寺。三十年修安养之业。凡有<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>。必用回向。因疾弟子。闻祥称佛声甚厉。又见房西壁有光若镜。现净土相频伽鼓翼。乃倏然而化</p><p>赞曰。祥见频伽。前智舜见鹦鹉孔雀。不见佛而见众鸟何耶。经云。是诸众鸟。皆阿弥陀佛变化所作。故知。正报依报。俱净土相也。幸无疑焉</p><p>大行</p><p>唐大行。居泰山修普贤忏法三年。感大士现身。晚岁入大藏。陈愿随手取卷。得弥陀经。昼夜诵咏。至三七日。睹琉璃地上。佛及二大士现身。僖宗皇帝闻其事。诏入内赐号常精进菩萨。后一年琉璃地复现。即日而终。异香经旬。肉身不坏</p><p>赞曰。琉璃地上下明彻。净德所感也。而慧永僧炫异香七日。慧通三日。行今浃旬。孰非梵行之芬芳也哉</p><p>明瞻</p><p>唐明瞻。晚岁克志安养。或讥其迟暮。瞻曰。十念功成。犹得见佛吾何虑乎。后因疾。于兴教寺具斋。别道俗。时仆射房玄龄杜如晦皆与焉。日过午。整威仪念佛。遽曰。佛来矣。二大士亦至。竦身合掌而化</p><p>永明寿禅师</p><p>钱氏吴越延寿。杭州余杭人。依四明翠岩禅师出家。参天台韶国师。发明心要。尝行法华忏。中夜见普贤。莲花忽然在手。因思宿愿未决。登智者岩。作二阄。一曰。一心禅定。一曰。万行修净土。冥心精祷。七拈皆得净土。于是一意专修。后住永明。日课一百八事。夜往别峰行道念佛。旁人时闻螺贝天乐之音。忠懿王叹曰。自古求西方。未有如此之专切者也。乃立西方香严殿。以成其志。在永明十五年。弟子千七百人。常与众授菩萨戒。施鬼神食。放诸<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。皆悉回向庄严净土。时号慈氏下生。开宝八年二月二十六日。晨起焚香告众。趺坐而化。后有僧来自临川。经年绕其塔。人问故曰。我病入冥。见殿左供一僧像。王勤致礼敬。密询其人则曰。此杭州永明寿禅师也。凡死者皆经冥府。此师已径生西方上上品矣。王重其德。故礼敬耳</p><p>赞曰。永明佩西来直指心印。而刻意净土。自利利他广大<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>。光昭于万世。其下生之慈氏欤。其再生之善导欤</p><p>志通</p><p>石晋志通。凤翔人。因见智者大师净土仪式。不胜欣忭。自是不向西唾。不背西坐。专心念佛。后见白鹤孔雀成行西下。又见莲花开合于前。通云曰。白鹤孔雀净土境也。莲花光相。受生处也。净土现矣。乃起礼佛而终。茶毗有五色祥云。环覆火上。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>鳞砌于身</p><p>赞曰。唾必西避。坐必西向。系念如斯。何事不办。今以轻心浅心。而欲往生难矣。或曰。不已着乎。噫谛观落日。经有明文。智者大师。始生而面西趺坐。乃至净业诸贤。西向坐脱者。不着而能之乎。耽心浊境。终世安然。才念净邦。便忧其着。颠倒乃尔。嗟乎异哉</p><p>晤恩</p><p>宋晤恩。姑苏常熟人。年十三闻诵弥陀经。遂求出家。终日一食。不离衣钵。不畜财宝。卧必右胁。坐必跏趺。每布萨涕泗不止。遍诲人以西方净业。及一乘圆旨。有疑不逗机者。答曰。与作毒鼓之缘耳。雍熙二年八月朔日。夜睹白光自井而出。谓门人曰。吾将逝矣。绝粒禁言。一心念佛。梦一沙门。执金炉焚香。三绕其室。自言灌顶。来此相迎。梦觉呼门人至。犹闻异香二十五日。说<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>指归及观心义毕端坐而化。人闻管弦铃铎之音嘹亮空中。渐久渐远。自西而去</p><p>赞曰。财食不贪。廉洁心也。坐卧不苟。敬慎心也。衣钵不离。持重心也。布萨垂泣。诚信心也。四心皆净因。宜其往生矣。至于诲人。则西方净业。与一乘圆教并施。恩其深入<a href=\"/remen/nianfofamen.html\" class=\"keylink\" target=\"_blank\">念佛法门</a>者乎</p><p>圆净常法师</p><p>宋省常。钱塘人。七岁出家。淳化中住南昭庆。慕庐山之风。乃刺血书<a href=\"/fojing/huayanjing/jxp.html\" class=\"keylink\" target=\"_blank\">华严经净行品</a>。易莲社以净行。士大夫预会者。称净行弟子。而王文正公且为之首。一时公卿伯牧百二十人。比丘千人焉。翰林苏易简。作净行品序。至谓予当布发以承其足。剜身以请其法。犹尚不辞。况陋文浅学而有惜哉。天禧四年正月十二日端坐念佛。有顷厉声唱云佛来也。泊然而化</p><p>赞曰。始远公。次善导。既而南岳五会。永明台岩。终于法师。号莲社七祖。劝化之盛。盖耀古弥今矣。虽然核其自修。则罔不精勤刻励。如所以示人者。今沙门知劝人。而不知劝己。欲窃附于前辈。不几狂乎</p><p>净观</p><p>宋净观。住嘉禾寂光庵。修净土忏法十余年。谓弟子曰。我后二十七日行矣。至期二日前。见红莲花。次日又见黄花满室。皆有化生孩儿。坐于花上。仙带结束。三日入龛端坐。命众念佛。顷之脱去</p><p>赞曰。念佛人预知时至。盖娑婆缘尽。净土缘成。自然圣境冥现。如远公七日。今观二十七日之类是也。世<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>无实德。死欲效嚬。扭掜妆点。取笑于识者。甚则生身活焚。摇动远迩。不知附鬼着邪。流入恶趣。尤可怜悯。复使无眼之徒。欣羡而希则之。其为害也大矣。我集往生。何无一人活焚其躯者。愿智人观此。普以告世。救诸愚民</p><p>慈云忏主</p><p>宋遵式。台州临海县人。学行高古。名冠两浙。专志安养。尝行般舟三昧。九十日苦学呕血。入道场两足皮裂。以死自誓。忽如梦中。见观音垂手指其口。引出数虫。又指端出甘露。注其口。觉身心清凉。疾遂愈。着净土决疑行愿。及净土忏法。行于世天圣间。将化之日。炷香礼佛。愿诸佛证明。往生安养。至晚坐脱。人见大星陨于灵鹫峰。时号慈云忏主云</p><p>赞曰。克勤忏法。自行而垂宪万世。古今一人而已。至于宝手出虫甘露灌口。非精诚之极畴能然乎</p><p>宗坦疏主</p><p>宋宗坦。潞州黎城人。五十年名播讲林。晚于唐州青台镇。专求净土。三业四仪。曾无暂忘。政和四年四月二十七日。梦阿弥陀佛。谓曰。汝说法止六日。当生净土。觉而白众。至五月四日。集众告曰。因缘聚散。固当有时。净土胜缘。惟凭时刻。愿众念佛助我往生。言已坐脱。满空雷鸣。白云覆地。三日方歇。所持玛瑙数珠。盘于指上。众取之。竟不能得。感应事繁。具如别说</p><p>赞曰。雷者法音之吼。云者慈荫之深。手珠不脱。念力之牢强见矣</p><p>慈照宗王</p><p>宋子元。号万事休。平江昆山人。少习止观。定中闻鸦声悟道。颂曰。二十余年纸上寻。寻来寻去转沉吟。忽然听得慈鸦叫始信。从前错用心。于是利他心切。普劝念佛。代为法界<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。礼佛忏悔。祈生安养。创白莲忏堂。述四土<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>。选佛图。开示莲宗眼目。逆顺境中。未尝动念。高宗皇帝召见。赐号慈照。后于铎城。三月二十三日。告众曰。吾<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>已毕。时当行矣。言讫合掌示寂。荼毗舍利无数。敕赐最胜之塔</p><p>法持</p><p>宋法持。居化度寺。修弥陀忏。愿促阎浮之寿。早生安养。后小疾。雨泪悲号。祈垂接引。厉声念佛不绝。忽见佛身丈六。立于池上。即自言曰。我已得中品生。西向而化</p><p>赞曰。人情莫不欲寿。促算而求安养。非欣厌之极乎。虽然发愿可也。赴海投崖。而叠薪自烬。则魔矣</p><p>本如</p><p>宋本如。号神照。住东山承天寺。与郡守张郇。结社一日升座说法。与众诀别。退而坐逝。时江上渔人。见云端有僧西去。明年启塔。颜貌如生。莲花产于塔前</p><p>基法师</p><p>宋基法师。学于宝云。住太平兴国寺。精意念佛。一日示疾。为弟子广谈玄旨。众忽见。西方现光。空中奏乐。师曰。阿弥陀佛与二大士俱至。即右胁西向而化。门人梦阿弥陀佛授记。为超世如来。或梦师坐青莲花台者。法智禅师叹曰。卧病谈玄。临终见佛。是可敬也</p><p>赞曰。或疑。基曷为即得授记。噫亲见如来无量光。见前授我菩提记。子知之乎</p><p>若愚</p><p>宋若愚。居云川仙潭。建无量寿阁。劝道俗念佛。精勤三十年。与道潜则章二师为友。潜能诗近名。愚与章惟务实行。将顺世。梦神人告曰。汝同学则章。得普贤行愿三昧。已生净土。彼正待汝。愚乃沐浴更衣。命众讽观经。端坐默然忽云。净土现前。吾当行矣。书偈而化。偈曰。本自无家可得归云边有路许谁知。溪光摇落西山月。正是仙潭梦断时。又曰。空里千花罗网。梦中七宝莲池。踏得西方路稳。更无一点狐疑</p><p>赞曰。愚与潜章为友。而潜以耽诗。亲名失净土之利。黜世智疏世缘。求西方者。当书诸绅</p><p>守真</p><p>宋守真。永兴人。讲起信论法界观。常于中夜。结无量寿佛往生秘密印。系念西方。一夕天晓。自觉身登净土。举目见佛。因俯伏像前。忽曰。四十八愿。能度我者。乃持香花。入殿<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。就坐而化</p><p>知礼</p><p>宋知礼。号法智。居南湖。述妙宗钞。大彰观心观佛之旨。每岁二月望日。建念佛施戒会。动逾万人。又撰融心解。明一心三观。显四净土之义。后于岁旦。建光明忏。至五日召大众说法。骤称佛号数百声。奄然坐逝</p><p>赞曰。礼述妙宗。说净观。大弘台教。而临终念佛坐逝。岂腾口说者。可同日语耶</p><p>有严</p><p>宋有严。住台州赤城崇善寺。依神照学天台教。晚年结茆樝木之下。号曰樝庵。平生笃修净业。有怀安养故乡诗。为时所传。建中靖国元年夏四月将终。见宝池大莲花。天乐四列。乃作饯归净土诗示众。后七日跏趺而化。塔上有光如月。三夕方隐</p><p>赞曰。前法祥镜光。现于壁端。今严公月光。现于塔上。皆身心莹彻之明验也。乃至光明满室者。金光弥亘江上数百里者。呜呼。是可以伪为乎哉</p><p>慧明</p><p>宋慧明。号晦庵。学于慧光。晚依蓄山常照寺。修净业。日课法华楞严圆觉。持弥陀圣号万数。庆元己未春示疾。谓弟子曰。吾学大乘。求生净土。今果遂矣。累足坐逝。众闻天乐西来。徘徊顶上。荼毗五色舍利无数</p><p>师赞</p><p>宋师赞。雍州人。为僧童。年十四。念佛不绝。忽遇疾暴亡。俄而复苏。谓师及父母曰。阿弥陀佛来此。儿当随行。邻人见空中宝台。五色异光。向西而没</p><p>二沙弥</p><p>隋汶州二沙弥。同志念佛。长者忽亡。至净土见佛白言。有小沙弥同修。可得生否。佛言。由彼劝汝。汝方<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。汝今可归。益勤净业。三年之后。当同来此。至期二人。俱见佛来。大地震动。天花飃舞。一时同化</p><p>了然</p><p>宋了然法师。号智涌。住白莲寺二十四年。梦二龙戏空中。一化为神人。袖出简云。师七日当行。既寤集众说法。大书曰。因念<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>。得生乐国。凡汝诸人。可不自勉。即沐浴更衣。令众诵弥陀经。至西方世界处。倏然而化。能仁寺行人。皆闻天乐之音。祥光上烛天表</p><p>思照</p><p>宋释思照。研究<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>。专心净业。每四更即起。称诵佛名。懈怠比丘。不遑安寝。效法藏四十八愿。结僧俗系念净会三十年。一日感疾。梦丈六金身。集众念佛。忽厉声同众称念。屈指作印坐逝。阇维齿及数珠不坏</p><p>智廉</p><p>宋智廉。居上虞化度寺。初遍参宗门。晚节一意西方。庆元改元秋八月。别众曰。我梦中见阿弥陀佛。大众围绕说法。佛云。诸善人等。当须专心净业来生我国。我见胜相。往生必矣。乃书偈曰。雁过长空。影沈寒水。无灭无生。莲花国里。书毕回身。向西结印而逝</p><p>智深</p><p>宋智深。号慈川。学于海月。归嘉禾。开长堂供众二十年。专志念佛。常以净业化人。得往生者甚众。忽示疾。客至问安。谈论如常时。客方出门。即迁化。人见紫云。向西而没焉</p><p>法因</p><p>宋法因。住四明广寿寺。三十年冥心净土。后有疾。集众讽观经。称佛号者三夕。谓门人曰。吾将行矣。或请留偈。乃书曰。我与弥陀本无二。二与不二并皆离。我今如此见弥陀。感应道交难思议。挺身端坐而逝</p><p>赞曰。以我心而念彼佛。则生佛宛然。即凡心而见<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。则生佛何别。何别故离二。宛然故离不二。离二故不从他觅。离不二故不碍求生。又离二故凡情斯尽。离不二故圣解俱亡。如此见佛者。终日娑婆。终日净土。念念释迦出世。时时<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>下生。可谓真见弥陀者也。其或不然觌面相逢。白云万里</p><p>智仙</p><p>宋智仙。号真教。住白莲寺。讲道十三年。西向礼念。未尝少废。一夕微疾。请观堂行人。诵弥陀经。卷未终而坐脱。邻住能仁寺僧。皆闻天乐和鸣。黎明乃知师亡</p><p>宗利</p><p>宋宗利。居新城碧沼。修念佛三昧者十年。后入道味山。筑庵名曰一相。越十五年。忽谓弟子曰。吾见碧莲花。遍满空中三日。复曰佛来矣。即书偈云。吾年九十头雪白。世上应无百年客。一相道人归去来。金台坐断。乾坤窄。奄然而化</p><p>齐玉</p><p>宋齐玉。号慧觉。初于霅川宝藏寺。建净土会。后住上竺。夜半顶弥陀像行道念佛。一日谓首座曰。床前多宝塔现。非吾愿也。所欲则净土耳。可为我集众念佛。首座鸣钟。僧至将百余。玉云。今已见佛。瞑目端坐而逝</p><p>赞曰。多宝塔亦佛国也。玉何以不愿。昔韦提希。遍观净土而独求安养。盖非专修。功弗克就。知此可与言西方矣</p><p>圆照本禅师</p><p>宋宗本。常州无锡人。初参天衣怀禅师。念佛有省。后迁净慈。奉诏入东京慧林寺。召对延和殿称旨。平居密修净业。雷峰才法师。神游净土。见一花殊丽。问之曰。待净慈本禅师耳。又资福曦公。至慧林礼足。施金而去。人诘其故。曰。吾定中见金莲花。人言以俟本公。又莲花无数。云以待受度者。或有萎者。云是退堕人也。有问。师传直指。何得莲境标名。答曰。虽在宗门。亦以净土兼修耳。后临终安坐而逝。谥圆照禅师</p><p>赞曰。昔中峰天如。谓禅与净土。理虽一而功不可并施。今曰兼修者何。盖兼之义二。足蹑两船之兼。则诚为不可。圆通不碍之兼。何不可之有。况禅外无净土。则即土即心。原非二物也。安得更谓之兼</p><p>大通本禅师</p><p>宋善本。试华严得度。奉诏住法云。赐号大通。后归杭州象坞寺修净业。定中见阿弥陀佛示金色身。一旦告门人曰。止有三日在。至期趺坐念佛。西向而化</p><p>灵芝照律师</p><p>宋元照。住灵芝。弘律学。笃意净业。念佛不辍。一日令弟子。讽观经及<a href=\"/fojing/puxianxingyuanpin/yuanwen.html\" class=\"keylink\" target=\"_blank\">普贤行愿品</a>。趺坐而化。西湖渔人。皆闻空中乐声</p><p>清照律师</p><p>宋慧亨。住武林延寿寺。初依灵芝习律。专修净业。六十年。每对人必以念佛为劝。建宝阁立三圣像。最称殊特。有江自任者。忽梦宝座从空而下。云亨律师当升此坐。适社友孙<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>。预启别亨。即在家作印而化。师往炷香。归而谓其徒曰。孙君已去。吾亦行矣。乃集众念佛。为说偈曰。弥陀口口称。白毫念念想。持此不退心。决定生安养。端坐而化。号清照律师</p><p>赞曰。六十年专修净业。临终瑞应何疑焉。世有以少时之力。而咎净土之无征。谬矣</p><p>思敏</p><p>宋思敏。依灵芝律师增<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>法。专心念佛二十年。后有疾。请众讽观经者半月。越三日。见化佛满空。临终念佛。声出众外。酷暑留龛七日不变。香满室中</p><p>晞湛</p><p>宋晞湛。山阴人。少为儒生。忽厌世出家。与莹行人。建无量寿佛殿于阮杜。专修净业。坐不背西。久之常见佛及二菩萨相。一夕面西念佛。正坐凝然作印而化</p><p>登法师</p><p>隋登法师。讲<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>于并州兴国寺。来听经者。普劝念佛往生。开皇十二年命终。异香满空。及殡光明香云。遍诸聚落</p><p>僧厓</p><p>释僧厓。住益州多宝寺。笃心净业。焚五指供西方三圣。或问痛否。答曰。心既无痛。指何痛焉。临终天花如雨。人见厓班衲锡杖。与五六百僧。乘空而没</p><p>藏法师</p><p>宋僧藏。汾州人。一生不受道俗<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。专修净土将终。天乐次第来迎。皆不赴。及西方佛至。别众而化</p><p>孤山圆法师</p><p>宋智圆。居西湖孤山。广解诸经。刻心净土。造弥陀疏及西资钞。劝发往生将终。以陶器合瘗。后十五年。积雨山颓。启视陶器。形质俨然。爪发俱长</p><p>赞曰。传称没后如故。不说临终往生何也。据没所现。征存所修。正其白业坚固。所感决定往生何疑</p><p>元净</p><p>宋元净。杭人。十二出家。后居龙井寺。时贤赵清献公。苏文忠公辈。咸重之将终。入方圆庵。谓人曰。吾七日无障。所愿遂矣。七日出偈示众。吉祥而逝</p><p>喻弥陀</p><p>宋思净。姓喻氏。钱塘人。自号净土子。早侍瑛法师。讲法华。后专念佛。暇则画佛像。凡画必于净室寂想。见弥陀光明乃下笔。绍兴丁巳岁。端坐七日。一心念佛。漠然化去</p><p>赞曰。画佛观佛。善用者颇类。盖画能置人马腹。岂不能置人佛国耶。然则画工画佛。何以不往生。噫问渠还室必净。想必寂否。况画工杂绘群形。喻老惟专一佛。专则观也。非画也。丹青者流。毋假口于此</p><p>蒙润</p><p>释蒙润。字玉岗。得法于古源禅师。晚居风篁岭之白莲庵。杜门念佛。临终化佛来迎。异香满室</p><p>云屋</p><p>元善住。字云屋。苏人。掩关六时念佛。病久不易。终时异香满室。有安养传谷响集行世云</p><p>旨观主</p><p>元旨观主。字别宗。杭人。戒德甚严。创观室于龙山之阳。修行念佛三昧。虽避兵窜逐。亦不暂废。临终无疾。沐浴端坐而化。芝云仁法师行业集。载之甚详</p><p>昙懿</p><p>宋昙懿。居钱塘。以医为业。晚年修念佛三昧。出平时所蓄。供佛饭僧。造像设浴。如是二十年。后微疾。屏药石。延七僧念佛。次日见莲花大如屋。又一日。见梵僧临榻问讯。夜半众闻念佛声低。视之泊然长往矣</p><p page margintb15></p></div>"
}]