[{
    "title": "释氏稽古略 第一卷",
    "author": "觉岸大师",
    "html": "<div class=\"B1_text\"><p>释氏稽古略 第一卷</p><p>释氏稽古略序吴兴有大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。曰宝洲岸公。博学通古今。尝考释氏事实上下数千载。年经而国纬著书一编。曰稽古手鉴。既又以为未备。复因其旧辑而广之为稽古略。至正十四年秋九月。太原刘尧辅为之持其书。请于余为序以冠其编首。因取而阅之。盖自有佛以来。凡名师大德之行业出处。以及塔庙之兴坏。<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>之众寡。靡不具载。本之内典。参之诸史。旁及于传记。而间以事之着显者为之据。将以侈历代之际遇而寓劝戒于其间。岁月先后。考核精审无所遗阙。可谓瞻且详矣。然犹以略名之宝洲自谦也。窃尝怪夫佛之为教。自身毒万里。远至于中国。愈久益盛。根本深固而不可摇拔。其故何也。岂非扶植其教者代有其人与。若是编之所记。往往皆英伟魁杰之才。自重不屈。卓然有立。而使王公卿大夫向慕崇信奔走之不暇。则其扶植之功为何如。此师所以加之纂述表而出之之意也。传之言曰。道不同不相为谋。佛氏之书非余之所学。余特嘉其闻见之博用心与力之。勒道虽不同而不可以不序。呜呼观其书而见其教之盛。知彼之扶植为有人。则亦可以有感也夫中山李桓序大明嘉靖癸丑岁姑洗月甲申日句曲天王寺后学<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a> 昌腹 重刊余尝略涉三教之书。道虽不同而理则一。松江南禅宝洲岸公。博通古今考传记。以释氏出处之迹。褒集成书。凡四帙。名曰稽古略。夫稽古二字始于唐虞。其来尚矣。予恭守是邦。得观宝洲以古史之说而名其书。备述<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>西来之意。浩浩瀚瀚端有源委。呜呼自非慧性通彻深蕴佛之奥者。孰能若是哉。后之学者。苟能以宝洲之心为心。何患不到见性<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>之境耶。噫至正乙未孟夏吉旦洛阳崔 (思诚)谨题</p><p>稽古略序先师古今和尚承祖席之遗。主海潮寺凡二十有四年。兴废举坠。宏畅宗风。四方来归依者踵趾相接。咸丰壬子。先师谢事退休。传之于清道。顾以根业浅薄。未能仰承付莂之重。复丁庚辛之难。寺毁于火。同治三年甲子。清道就旧址。结茅募缘。思为得尺得寸之计。辱海内檀越争先布舍。遂以次规复佛宇。增建禅堂。俾云游缁素得所栖息。清道不敢自诩其功能。实先师慈芘有以默相之也。复念寺众群集。晨夕焚修。不有经典。如灭烛夜行。曷窥宗旨。而浙中五山十刹诸道场。备蒙列 圣宠颁 龙藏。悉付劫灰无一存者。光绪辛巳。锐意北行上书。政府达之 宸听。得旨颁赐龙藏全部。仪卫副焉。敬谨捧归建阁尊藏。以为山门之宝。时清道世腊已七十矣。朽钝如昔。因退居别院。以承先师之遗意。重念先圣<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>密谛。实儒者之经传。景德传镫高僧圣僧列传。佛祖通载诸书实。儒者之史鉴。名贤语录笺疏。实儒者之子与集。<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>渐顿即儒者之体用。<a href=\"/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>与中庸之澈上澈下同其功用。苟不潜心搜索。何以超入上乘。元至正初。觉岸禅师撰释氏稽古略四卷。实竺典之叵编。吾人之宝筏。箸录于四库全书。而世少传本。末学后世无从窥测。法徒宝藏此书。后附明僧大闻续略三卷。惜多损剥。复假钱塘丁氏八千卷楼藏本。斠勘精审。循翻雕古书之例。不更写样。以原书重付手民。敬列 钦定提要。辨之简端。所以广布 皇仁昭示来学。不学如清道者。藉得附名编末。实深幸焉光绪十二年太岁在丙戌四月八日衲清道谨识</p><p>国朝图(本五运纪)┌──伍龙纪─┐┌──有巢氏─┐┌──神农──┐┌───高辛─┐┌──天皇氏─┐│┌─────┘│┌─────┘│┌─────┘│ ┌────┘┌─┐│││└─摄提纪─┐│└─燧人氏─┐│└─黄帝──┐│ └─唐尧─┐│混││┌─────┘│┌─────┘│││││ ┌────┘│沌│盘古王─┘└─地皇氏─┐│└─合熊纪─┐│┌─────┘│┌─────┘│ └─虞舜─┐└─┘││┌─────┘│││││ ┌────┘┌─────┘│└─连遥纪─┐│└─虙牺氏─┐│└─少昊──┐│ └─夏──┐└─人皇氏──┘┌─────┘│┌─────┘│┌─────┘│ ┌────┘└─肆姓纪──┘└─女娲氏(伏牺妹)─┘└─颛顼───┘ └─商──┐┌────────────────────────────────────────────────┘│┌─郑魏─吴─┐ 泰伯弟虞│││ 仲之后武│├─曹─┐│ 王求之得││┌──┘韩│ 周章封焉┌─吴───┐│├┴宋│ 后为越灭││││││││├─晋赵│││││││││├─卫││││││││└─○周─┼─秦【图】 秦【图】├─秦○西汉─王莽─更始─刘盆子─○东汉○─┼─魏───┴───────┐│││ ││├─齐││ └─┐││齐││││├─燕│││││││││├─鲁燕││││││└─蜀─┘│├─蔡│ 夏王少康││楚│ 封少子无│├─楚│ 越┬┘ 余于会稽││└──┘号曰於越│└─陈后为楚灭│┌───────────────────────────────────────────────────┘│┌─前凉────┐┌──后燕北燕─┐┌─西魏────┐││││┌─西秦││││├─前燕────┼─前秦─┤└────┐ 大夏─┼─北魏─┤├─周─┐││││南凉─┘││││└─○晋─┼─前赵─后赵─┘└──西凉───北凉─┘└─东魏─北齐─┘├─○隋──┐│││├─后蜀─┐后凉──后秦──┐┌─后梁────┤││ ┌──┘┌─南燕┌──────────────┘│││└─东晋──┴───────○宋──────○齐──────○梁─┴────○陈─┘│┌───────────────────────────────────────────────────┘│┌─吴越││┌──────────泉南───────┐│├───闽──┤│宋徽宗重││└──殷──┐│和元年阿│├─吴──────────┼──────南唐─────┤ 金 骨打称帝││││九主一百│├───楚(马氏)─────┘│十七年灭││││├─赵──┐│││││└─○唐─┼─○梁─┤├─○宋归附○大元│││├─秦──┼─○后唐─┬─○晋───○汉─┬─○周──┤│││││├─燕──┤│└汉(大原)─┤││││梁均王贞├─蜀──┘└───后蜀──────────┤明二年阿││ 辽 保机称帝├───楚(高氏)───────────────────┤九主二百九││年金灭之└─汉(广州)─────────────────────┘</p><p>释迦文佛宗派祖师授受图略(本正宗记)┌───────┐ ┌─优罗陀───┐ ┌─净饭王──┐┌─释迦文佛─┘┌─摩诃男│ └──────┐│ │││┌┤│ ┌─懿师摩──┘│ │└┤│└─阿那律│ └──────┐│ │ 斛饭王──┐└─难陀尊者 ││○大善生王─┘│ │└───────┘│ ┌───────┘┌┤│ └─瞿罗───┐ ││┌───────┐┌─跋提尊者 │ ┌──────┘ ││ <a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>饭王─┘┌─调达│││ └─尼浮罗──┐ ││┌┤└┤ 提沙尊者 │ ┌──────┘ ││││││ └─师子颊────┘└─白饭王──┘└─阿难尊者└─甘露味女 │┌─────────────────────────────────┘└ 一祖摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>尊者二祖阿难尊者三祖商那和修尊者四祖优波鞠多尊者五祖提多迦尊者六祖弥遮迦尊者七祖婆须密尊者八祖<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>难提尊者九祖伏驮蜜多尊者十祖胁尊者十一祖富那夜奢尊者十二祖马鸣大士十三祖迦毗罗大士(台宗初祖)十四祖龙树大士 十五祖迦那提婆大士十六祖罗睺罗多大士十七祖僧迦难提大士十八祖伽耶含多大士十九祖鸠摩罗多大士二十祖阇夜多大士二十一祖婆修盘头大士二十二祖摩那罗大士二十三祖鹤勒那大士二十四祖师子尊者二十五祖婆舍斯多尊者二十六祖不如蜜多尊者二十七祖<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>多罗尊者二十八祖<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>达磨尊者二十九祖(东土二祖)慧可尊者 三十祖(东土三祖)僧粲尊者 三十一祖(东土四祖)道信尊者 三十二祖(东土五祖)弘忍尊者三十三祖(东土六祖)慧能尊者────────────────────────────────────────┐ ┌─────────────────────────────────────────────────────┘ │┌───────────┐ │┌─南岳让─┘┌────龙潭信─┐ └─────马祖一─┐┌────赵州谂┌────大沩忠─┐ └┤│┌─────┘┌──────┘││┌─────┘└─青原思─┐│└─德山鉴─┐│┌─南泉愿────┘┌───汾阳昭─┐│└─普庵肃┌─────┘│┌─────┘└┤│ ┌─────┘│└─石头迁─┐│└─雪峰存 ─┐└─百丈海─┐│ └─石霜圆─┐│┌───应庵华─┐ ┌──────┘│┌──────────┘┌───────┘│ ┌─────┘││ ┌─────┘ │┌─天皇悟──┘│┌─○云门偃─┐│┌──黄蘖运 ─┐│ └─杨岐会─┐││ └─密庵杰─┐ └┤││┌─────┘└┤││ ┌─────┘││ ┌─────┘└─药山俨─┐ ││└─巴陵鉴─┐└─○大沩祐─┐││ └─白云端─┐││ └─灵隐岳┌───────┘ └┤┌─────┘┌─────┘││┌──────┘│││┌──船子诚─┐│└─双泉宽└─仰山寂─┐│││┌─五祖演───┐ ││ ┌─天童全││┌─────┘│┌─────┘││└┤│ ││ │││└─夹山会─┐└──玄沙备─┐└─南塔涌││ └─琅琊觉 │ ││ │ 育王光└┤┌─────┘┌─────┘┌─────────┘│┌────────┘ ││ │ │└─上蓝超└─罗汉琛─┐└─○临济玄─┐││┌─佛眼远─────┘│ │ 东林颜 │┌──────┘┌─────┘││││ │ └──云岩晟─┐└─○<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>益─┐└─兴化奖─┐│└┤ <a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>勤─┐│┌┤ 大禅明 ┌──────┘┌──────┘┌─────┘│ │││││ └─○洞山价─┐│┌─天台韶─┐└─南院颙─┐│ └─佛鉴勤 ││││ 有○者┌─────┘└┤│┌─────┘│┌──────┘│││└─曹山寂─┐└─永明潜 │└─风穴沼─┐││┌─虎丘隆──────┘││ 禅分五┌─────┘┌─────┘┌─────┘│└┤││└─鹿门真└─永明寿└─首山念─────┘ └─大慧杲───────┘└─宗之始</p><p>释氏稽古略</p><p>乌程职里宝相比丘释 觉岸 宝洲(编集再治)</p><p>三皇太昊庖牺氏</p><p>风姓。以木德王。都宛丘(今汴梁路陈州郡名淮阳。禹贡豫州之域)。上古之人捕逐禽兽。食肉衣皮难以致之。太昊教民作网罟。以佃以渔豢养六畜。且以牺牲享神祇故。曰庖牺氏。后世曰伏牺氏。始画八卦造书契。由是文籍生焉。以龙纪官。在位一百一十六年。易曰。伏牺刳木为舟。剡木为楫。琴操曰。伏牺作琴修身理性。反其天真也。通历曰。伏牺作二十五弦之瑟。以制<a href=\"/remen/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>之礼。图经曰。庖牺生陕西巩昌路秦州成纪县。母曰华胥。禹贡雍州之域也。晋宁路河中府霍州有伏牛台。伏牺伏牛乘马之所。女娲墓在焉(冀州之域)淮西庐州有女娲古庙</p><p>女娲氏 共工氏 大庭氏 柏皇氏 中皇氏 栗陆氏 骊连氏 赫胥氏 尊卢氏 混沌氏 昊英氏 朱襄氏 葛天氏 阴康氏 无怀氏</p><p>宋哲宗元祐五年二月。诸葛深绍运图曰。已上十五氏。合一万七千七百八十七年</p><p>社稷神 风俗通曰。共工氏之子曰修。好远游。舟车所至。足迹所达。靡不穷览。故祀以为社神。<a href=\"/ctwh/jing/13j/cqzz.html\" class=\"keylink\" target=\"_blank\">左传</a>曰。共工氏有子曰勾龙氏。平水土故祀以社。<a href=\"/ctwh/jing/13j/liji.html\" class=\"keylink\" target=\"_blank\">礼记</a>曰。共工氏之霸九州也。其子曰后土。能平九州。故祀以为社。又厉山氏之有天下也。其子柱能植五谷。故祀以为稷。蔡邕独断曰。周弃播殖百谷。以稷为百谷之长。因以稷名。其神弃周后稷也</p><p>炎帝神农氏</p><p>姜姓。继伏牺氏。王火德。都鲁。今东平路禹贡兖州之域。时人茹草饮水。食木实肉禽兽。多疾病。炎帝求可食之物。教以火食。时天雨粟。乃教民播种五谷。作陶治斤斧耒耜锄鎒。以垦草莽。而五谷兴故曰神农氏。又尝百草。一日遇七十毒。以一人不足为养。日中为市乃通有无。以火纪官。在位一百二十年。桓谭新论曰。神农氏削桐为琴。绳丝为弦。以通神明之德。广雅曰。神农氏琴长三尺六寸。上有五弦。曰宫商角徵羽。周文王增二弦。曰少宫少商也</p><p>帝承 帝临 帝明 帝宣 帝厘 帝哀 帝榆 帝冈 已上八帝皆神农氏。合五百一十年。末年诸侯相伐。归之黄帝</p><p>黄帝有熊氏</p><p>公孙姓。轩辕名。有熊国君少典之子。神农氏为天子。诸侯相侵伐。神农氏弗能征。诸侯侵陵。最强暴者惟蚩尤。轩辕修德治兵。与炎帝氏战而胜之。擒蚩尤于涿鹿杀之(今大都路涿州郡名范阳豫域)。于是诸侯咸归轩辕。推轩辕代神农氏为天子。黄帝元年丁亥始立制度。天下不顺者从而征之。其土地东至于海。西至于崆峒(今甘肃省肃州路雍州域)。南至于海。北逐獯鬻。邑于涿鹿之阿。迁徙<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。以兵师为营卫。以云纪官。有土德之瑞。举风后力牧犬山稽常先大鸿得六相。而天地治神明至。帝受河图。见日月星辰之象。于是始有星官之书。命大挠探五行之情。占斗纲所建。于是始作甲子。命容成造历。命隶首作算数。命伶伦造律吕。命车区占星气。容成兼而总之。为文章以表贵贱。作舟车以济不通。画野分州得百里之国万区。八家为井。井一为邻。邻三为朋。朋三为里。里五为邑。邑十为都。都十为师。师十为州。设左右大监。监于万国。举封禅之礼。作咸池之乐远夷之国莫不入贡。黄帝二十五子。得姓者十四人。为十二姓。姬酉祁已縢箴任荀僖姞儇休。正妃二子一曰玄嚣二曰昌意。皆得为诸侯。黄帝崩。人以为仙去。帝在位一百一十年(<a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a>)。皇甫谧曰。黄帝生陕西巩昌路秦州寿丘。冢在宁州桥山(雍州之域)。黄帝上升之地鼎湖(今淅东道处州路仙都山阳域)。蚩尤冢(今东平路阚乡)高七丈。民常十月祀之。有赤气出。如疋绛帛。民名为蚩尤旗</p><p>易干凿度曰。昔燧人氏仰观斗极以定方名。庖牺因之而画八卦。黄帝受命。使大挠造甲子。容成次历数。五行九宫之说自此而兴。故说卦云。阳数九者。立天之道曰阴与阳阴。二阳一则天有三焉。立地之道曰柔与刚。柔二刚一则地亦有三焉。立人之道曰仁与义。义二仁一则人亦有三焉。三三合九。阴阳相包以成万物</p><p>指南车 黄帝蚩尤战。蚩尤为大雾。军士皆迷。黄帝作指南车以示四方。遂擒蚩尤杀之 有熊国 今河南新郑是也(史记)</p><p>五帝少昊金天氏</p><p>巳姓。黄帝子。字青阳。王金德。都穷桑(今济宁路兖州曲阜)。有凤凰之瑞。因之以鸟纪官。在位八十四年。寿终一百岁</p><p>颛顼高阳氏</p><p>昌意之子。黄帝孙也。以水德。都帝丘(今东昌路濮州兖域)。生八才子。谓之八凯。少昊氏之衰。人民杂糅。民渎于祀。祭享无度。帝平九黎之乱。神人不杂。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>侵渎。作历以孟春为元。故帝为历宗也。土地东至蟠木。西至流沙。南至交趾。北至幽陵(今燕京也)在位七十八年。海外经曰。东海中有山名曰度索。上有大桃树。屈蟠三千里。地里志曰。流沙在甘肃省甘州路。郡名张掖</p><p>帝喾高辛氏</p><p>蟜极之子。黄帝曾孙也。王木德。都西毫(今河南府路偃师县也。古洛州像域)。帝生而神圣。自言其名。顺天之义。知民之急。仁而威。惠而信。取天地之财而节用之。抚教万民而利诲之。推日月而迎送之。明鬼神而敬事之。日月所照。风雨所至。莫不服从。生八才子谓之八元。在位七十年。寿终一百五岁。崩葬今大名路开州秋山(兖冀二州之域)。子挚(音至)立在位九年。而不善。禅于唐侯(尧也)</p><p>帝尧陶唐氏</p><p>帝喾子。挚之弟也。挚立封尧为陶侯。改封唐故曰陶唐氏。伊祁姓也。尧既受挚禅。以火德。都平阳(今晋宁路冀州之域)。茅茨不剪。土阶三尺蓂荚生于庭蓂草也。一日生一荚。至十五日成十五荚。十六日落一荚。至三十日落而尽(月小连落二荚)。更生更落。帝自奉甚薄。赋役甚寡是时有大风猰(苦八反)貐(音俞)封豨(胡鬼反)修蛇。皆为民害。帝乃使羿缴大风于青丘之泽(东方泽名)杀猰貐。断修蛇于洞庭。擒封豨于桑林。民乃悦。洪水为灾。四岳举鲧(禹之父也)。治水九年弗成。帝之子丹朱不肖求贤德可以逊位者。群臣举舜。帝以二女妻舜。历试诸难。纳于大麓(今顺德路)。烈风雷雨不迷。使之摄位。又二十八年帝崩。尧在位通舜摄共九十八年。寿一百九十八岁。尧作乐曰大章。舜避尧之子丹朱于河南(今汴梁地)。天下朝觐讼狱者不归丹朱而归舜。舜乃即天子位(史记) 书尧典曰放勋。蔡氏沈曰。放勋者总言尧之德业也</p><p>帝舜有虞氏</p><p>曰重华。称都君。黄帝八代孙。黄帝生昌意。昌意生颛顼。颛顼生穷蝉。穷蝉生康敬。康敬生句芒。句芒生蟜牛。蟜牛生瞽瞍。瞽瞍生舜。姚姓。舜母死。继母生象。父母及象。常欲杀舜。舜尽孝悌之道事父母。待其弟尤恭。耕于历山(河东)。渔于雷泽(兖州)。陶于河滨(今济阴定陶西南陶丘亭)。所居成聚。二年成邑。三年成都。二十以孝闻。年三十尧以二女妻之。将逊以位。舜举高阳氏高辛氏之子八凯八元。凯主后土。元布五教于四方。尧于是使舜摄位。帝鸿氏有不才子。号曰浑沌。欢兜也。少皡氏有不才子。号曰穷奇。共工氏颛顼氏有不才子。号曰梼杌。鲧也。缙云氏有不才子。号曰饕餮。三苗也。是谓四凶。仕于尧。尧未能去。舜皆投诸四裔。举禹以治水。舜摄尧位二十八年。尧崩舜即天子位。以土德王。都蒲阪(今晋宁路河中府也)。弹五弦琴歌南风。璇玑玉衡以齐七政。正历数闰余成岁。作乐曰九韶。苗民逆命。敷之德舞干羽于两阶七旬。有苗来格。子商均不肖。舜荐禹于天。使之代己位。在位五十年。南巡狩崩于苍梧之野(今广西道梧州路郡名苍梧荆州域)。寿一百一十岁。禹避舜之子商均于阳城。天下之人不归商均而归禹。禹遂即天子位。国号夏 舜欲造漆器。遇谏而止(又见唐太宗贞观十七年)</p><p>瑞诞 大星如虹下流。华渚女节感而生少皡(史记)。有星如虹感女枢而生颛帝(书疏)。舜母感大虹而生舜(帝王世纪)</p><p>少皡之前。天下之号象其德。颛顼以来。天下之号因其名。若高阳高辛。皆所兴之地</p><p>宋神宗元丰三年。秘书丞刘恕字道原著外纪曰。六经惟春秋及易彖象文言说封序卦杂卦仲尼所作。诗书仲尼所删定。皆不称三皇五帝三王。易下系曰。古者包牺氏之王天下也。包牺氏没神农氏作。神农氏没黄帝尧舜氏作。继世更王而无三五之数。或以包牺至舜为五帝。孔子未尝道。学者不可附会臆说也。<a href=\"/ctwh/zi/djjd/guanzi.html\" class=\"keylink\" target=\"_blank\">管子</a>称。明一者皇。察道者帝。通德者王。谋得兵胜者霸。孔颖达曰。管子书或是后人所录。非本书也。<a href=\"/ctwh/zi/djjd/zhuangzi.html\" class=\"keylink\" target=\"_blank\">庄子</a><a href=\"/ctwh/zi/djjd/liezi.html\" class=\"keylink\" target=\"_blank\">列子</a>皆寓言诞妄。秦汉学者宗其文辞论议。故竞称三皇五帝。而不知古无其人。仲尼未尝道也。梁武帝以伏牺神农燧人为三皇。黄帝少皡帝喾帝挚帝尧为五帝。舜非三王。亦非五帝。与三王为四代其指不通。历世纷纷莫知定论也。太史公曰。学者多称五帝尚矣。然<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>独载尧以来。而百家言黄帝。其文不雅驯。荐绅先生难言之。孔子所传。宰予问五帝德及帝系姓。儒者或不传。余尝西至崆峒。北过涿鹿。东渐于海。南浮江淮矣。至长老皆各往往称黄帝尧舜之处。风教固殊焉。总之不离古文者近是。索隐曰。古文即帝德帝系二书也近是。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之语子观春秋国语其发明五帝德帝系姓章矣。顾第弗深考。其所表见皆不虚。书缺有间矣。其轶乃时时见于他说。非好学深思心知其意。固难为浅见寡闻道也。余并论次择其言尤雅者。故着为本纪书首</p><p>夏</p><p>帝禹 王启 太康 仲康 王相 少康 王杼 王槐 王芒 王泄 不降 王扃 王廑 王孔甲 王皋 王发 履癸(桀也) 帝禹</p><p>姓姒氏。黄帝之孙。颛顼生鲧。鲧生禹。当尧之时洪水滔天。尧命鲧治水无功殛之死。舜摄位举禹续父业。劳身焦思。居外十三年。过家之门不入。陆行乘车。水行乘船。泥行乘橇(充苪反)。山行乘梮(拘玉反)。行相地所有以贡及山川之便利。于是水害皆息。九州攸同。四隩可居。尧于是锡禹玄圭。告其成功。舜即正位。使禹为司空。以宅百揆。天锡洪范九畴。彝伦攸叙。天与禹洛出书。神龟负文列于背。有数至于九。禹遂因而第之以成九类。舜之子商均不肖。舜荐禹于天使代己位。舜崩。天下之人不归商均而归禹。禹即天子位。国号夏。以金德都韩。今汴梁路钧州阳翟也。豫域仍有虞以建寅月为岁首。十寸为尺。色尚黑。牲用玄。以黑为徽号。作乐曰大夏。夏大也。言能大尧舜之德也。悬钟鼓磬铎鞀(音挑)而以待四方之士。曰教寡人以道者击鼓。谕以义者击钟。告以事者振铎。语以忧者击磬。有狱讼者摇鞀。初舜分天下为十二州。禹复为九州。收天下美铜铸为九鼎。以象九州。昔黄帝作车。少皡加牛。奚仲加马。禹命奚仲为车。正建旌旗斿旐。以别尊卑等级。古有醴酪。禹时仪狄作酒。禹饮而甘之。遂疏仪狄绝旨酒曰。后世必有以酒亡国者。禹任皋陶益以国政。禹娶涂山氏女生子启。禹南巡狩会诸侯于涂山。承唐虞之盛。执玉帛者万国。又致于会稽。防风氏后至。禹戮之。有典则以贻子孙。禹尝荐益于天。七年禹崩。在位九年。寿一百岁。益避位于箕山。天下之人不归益而归启。启乃即天子位 文命蔡沈曰。即禹贡所谓东渐西被朔南暨声教者是也</p><p>神龟出洛。今河东山西道怀孟路孟州之孟津。周武王伐纣。师会盟津者是也。冀域涂山氏之国。今淮西安丰路临濠府会稽。今浙东道越州绍兴路也。并扬域禹崩于会稽橇。孟康云。形如箕行泥上。梮谓以铁为。如锥头长半寸。施之履下。上山不跌</p><p>王启</p><p>禹之子。母涂山氏女。在位十年崩</p><p>太康</p><p>启子荒逸畋猎洛水之表。十旬弗归。有穷后羿因民之困距之于河。厥弟五人作歌以怨之。尚书也。在位三十年。失国不得归。后羿立太康之弟仲康</p><p>仲康</p><p>太康弟。羿立之。微弱义和湎淫。政出于羿。在位十四年</p><p>王相</p><p>仲康子。为羿所逐失国居商丘。今河南府路归德府也。依同姓斟灌斟鄩氏。羿自立号有穷。后羿自锄迁于穷石。因夏氏代夏政。不修民事淫于原兽。弃贤不用。信用伯明氏之谗子寒浞。行媚于内。施赂于外。愚弄其民。复愚于羿。羿趋田家。众杀羿而烹之。以食其子。其子不忍食杀于穷门。羿在位八年。寒浞因羿室。不改有穷之号。生浇及豷。浞使浇杀斟灌氏及斟鄩氏灭夏王相。相后乃有仍国君之女方娠。逃自窦归于有仍生少康。浞处浇于过。处豷于戈。少康既长为仍牧正。浇求之。逃奔有虞为庖正。虞君妻以二姚。而邑诸纶有田一成(十里也)。有众一旅(五百人也)。布德收夏众。有夏遗臣曰靡自有鬲氏。收二国之余民以灭浞。而立少康。少康使其臣女艾灭浇于过。使其子季杼灭豷于戈。有穷遂亡。浞在位三十二年。史记司马贞索隐曰。左传魏庄子曰。帝相既被篡杀。中间经羿浞二氏。盖三数十年而此纪总不言之。直云帝相崩少康立。疏略之甚。相在位二十八年</p><p>少康</p><p>帝相子灭浞还旧都复禹之迹。夏道复兴民安。在位二十一年</p><p>越</p><p>少康封少子无余于会稽。号曰於越。自后二十世。周敬王时勾践称王。与吴王战败吴于[木*嶲]李(今淅西道嘉兴路秀州也。扬域)。复灭吴吴败越于夫椒(吴郡太湖中椒山也)。勾践用臣范蠡大夫种等谋计。周元王三年遂乃灭吴。越后为楚所并(图经)</p><p>勾践世家 史记曰。夏后帝少康封庶子于会稽。以奉守禹之祀。文身断发。披草莱而邑焉。后二十余世至允常。允常之时与吴王阖庐战而想怨伐。允常卒子勾践立。是为越王。元年吴王阖庐闻允常死。方兴师伐越。越王勾践袭击吴师。吴师败于[木*嶲]李。射伤吴王阖庐(杜预曰。吴郡嘉兴县南有[木*嶲]李城)。阖庐且死。告其子夫差曰。必毋忘越。三年勾践闻吴王夫差日夜勒兵。且以报越。越欲先吴未发往伐之。范蠡谏曰不可。臣闻兵者凶器也。战者逆德也。争者事之末也。阴谋逆德好用凶器。试身于所末上帝禁之。<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>不利。越王曰。吾已决之矣。遂兴师。吴王闻之悉发精兵击越。败之夫椒(杜预曰。夫椒在吴郡吴县太湖中椒山是也)。越王乃以余兵五千人保栖于会稽(杜预曰。上会稽山也)。吴王追而围之。越王谓范蠡曰。以不听子故至于此。为之奈何。蠡对曰。持满者与天(韦昭曰。与天法天也。天道盈而不溢)。定倾者与人(虞翻曰。人道尚<a href=\"/remen/qianbei.html\" class=\"keylink\" target=\"_blank\">谦卑</a>以自牧)。节事者以地(韦昭曰。时不至不可强生。事不究不可强成)。卑辞厚礼以遗之不许而身与之市(韦昭曰。市利也。谓委管籥属国家以身随之)勾践曰诺。乃令大夫种行成于吴。膝行顿首曰。君王亡臣勾践使陪臣种敢告下执事。勾践请为臣妻为妾。吴王将许之。子胥言于吴王曰。天以越赐吴勿许也。种还以报勾践。勾践欲杀妻子燔宝器触战以死。种止勾践曰。夫吴太宰噽贪。可诱以利请行告之。于是勾践乃以美女宝器令种间献吴太宰噽。噽受乃见大夫种于吴王。种顿首言。曰愿大王赦勾践之罪。尽入其宝器。不幸不赦。勾践将尽杀其妻子燔其宝器。悉五千人触战必有当也。噽因说吴王曰。越以服为臣。若将赦之此国之利也。吴王将许之。子胥进谏曰。今不灭越后必悔之。勾践贤君。种蠡良臣。若反国将为乱。吴王弗听。卒赦越罢兵而归。勾践之困会稽也。喟然叹曰。吾终于此乎。种曰汤系夏台。文王囚羑里。晋重耳犇翟。齐小白犇莒。其卒王霸。由是观之。何遽不为福乎。吴既赦越。越王勾践反国。乃苦身焦思置胆于坐。坐卧则仰胆。饮食亦尝胆也。曰汝忘会稽之耻邪。身自耕作。夫人自织。食不如肉。衣不重裘。折节下贤人。厚遇宾客。振贫吊死。与百姓同其劳。欲使范蠡治国政。蠡对曰。兵甲之事。种不如蠡。镇抚国家亲院百姓。蠡不如种。于是举国政属大夫种。而使范蠡与大夫柘稽行成为质于吴。二岁而吴归蠡。勾践自会稽归七年。拊循其士民。士民欲用以报吴。大夫逢同谏曰。国新流亡。今乃复殷给缮饰备利吴必惧。惧则难必至。且鸷鸟之击也必匿其形。今夫吴兵加齐晋。怨深于楚越。名高天下。实害周室。德少而功多。必淫自矜。为越计莫若结齐亲楚附晋以厚吴。吴之志广必轻战是。我连其权三国伐之。越承其弊可克也。勾践曰善。居二年。吴王将伐齐。子胥谏曰。未可。臣闻勾践食不重味。与百姓同苦乐。此人不死必为国患。吴有越腹心之疾。齐与吴疥癣也。愿王释齐先越。吴王弗听。遂伐齐败之艾陵。虏齐高国以归让子胥。子胥曰。王毋喜。王怒。子胥欲<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>。王闻而止之。越大夫种曰。臣观吴王政骄矣。请试尝之贷粟以卜其事请贷。吴王欲与。子胥谏勿与。王遂与之。越乃私喜。子胥言曰。王不听谏。后三年吴其墟乎。太宰噽闻之乃数与子胥争越议。因谗子胥曰。伍员貌忠而实忍人。其父兄不顾。安能顾王。王前欲伐齐。员强谏已而有功用是反怨王。王不备伍员。员必为乱。与逢同共谋谗之王。王始不从。乃使子胥于齐。闻其托子于鲍氏。王乃大怒曰。伍员果欺寡人欲反。使人赐子胥属镂剑以自杀。子胥大笑曰。我令而父霸。我又立若。若初欲分吴国半予我。我不受已。今若反以谗诛我。嗟乎嗟乎一人固不能独立。报使者曰。必取吾眼置吴东门。以观越兵入也。于是吴任噽政居三年。勾践召范蠡曰。吴已杀子胥。导谀者众可乎。对曰未可。至明年春。吴王北会诸侯于潢池。吴国精兵从王。惟独老弱与太子留守。勾践复问范蠡。蠡曰可矣。乃发习流二千教士四万人君子六千人(韦昭曰。君子王所亲近有志行者。犹吴所谓资良齐所谓士也。虞翻曰。言君养之如子)诸御千人伐吴。吴师败遂杀吴太子。吴告急于王。王方会诸侯于潢池。惧天下闻之乃秘之。吴王已盟潢池。乃使人厚礼以请成越。越自度亦未能灭吴。乃与吴平。其后四年。越复伐吴。吴士民罢弊轻锐尽死于齐晋。而越大破吴。因而留围之三年。吴师败已。越遂复栖吴王于姑苏之山。吴王使公孙雄(虞翻曰吴大夫)肉袒膝行而前请成越王曰。孤臣夫差敢布腹心。异曰尝得罪于会稽。夫差不敢逆命。得与君王成以归。今君王举玉趾而诛孤臣。孤臣惟命是听意者亦欲如会稽之赦孤臣之罪乎。勾践不忍欲许之。范蠡曰。会稽之事天以越赐吴。吴不取。今天以吴赐越。越其可逆天乎。且夫君王蚤朝晏罢非为吴耶。谋之二十二年。一旦而弃之可乎。且夫天与弗取反受其咎。伐柯者其则不远。君忘会稽之厄乎。勾践曰。吾欲听子言。吾不忍其使者。范蠡乃鼓进兵曰。王已属政于执事(虞翻曰。执事蠡自谓也)。使者去。不者且得罪。吴使者泣而去。勾践怜之。乃使人谓吴王曰。吾置王甬东君百家(杜预曰。甬东会稽句章县东海中州也)。吴王谢曰。吾老矣不能事君王。遂自杀乃蔽其面曰。吾无面以见子胥也。越王乃葬吴王。而诛太宰噽。勾践已平吴。乃以兵北渡淮。与齐晋诸侯会于徐州。致贡于周。周元王使人赐勾践胙命为伯。当是时越兵横行于江淮东。诸侯毕贺号称霸王。范蠡遂去自齐。遗大夫种书曰。蜚鸟尽良弓藏。狡兔死走狗烹。越王为人长颈鸟喙可与共患难不可与共乐。子何不去。种见书称病不朝。人或谗种且作乱。越王乃赐种剑曰。子教寡人伐吴七术。寡人用其三而败吴。其四在子。子为我从先王试之。种遂自杀。勾践卒。子王鼫与立。又五世王无强伐楚。楚威王伐越。杀王无强就除(史记)</p><p>王杼</p><p>少康子。在位十七年</p><p>王槐</p><p>杼子。在位二十六年</p><p>王芒</p><p>槐子。在位十八年。索隐曰。芒音亡。邹诞生。音荒放反</p><p>王泄</p><p>芒子。六夷服从。始加爵命之制。在位十七年</p><p>王不降</p><p>泄子。在位五十九年</p><p>王扃</p><p>不降弟。在位二十二年</p><p>王廑</p><p>扃子。在位二十年</p><p>王孔甲</p><p>廑子。不务修德。诸侯多叛。在位三十二年</p><p>王皋</p><p>孔甲子。在位十一年</p><p>王发</p><p>皋子。在位十三年</p><p>王履癸</p><p>发子。是为桀。自孔甲以来。诸侯多叛。桀暴戾无道。百姓患之。伐有施氏娶其女妹喜宠之。桀自恃天命。指日曰。日亡吾乃亡。关龙逢黄图陈谏桀杀之。汤使人哭之。桀怒囚汤于夏台。既而释之。汤修德。诸侯畏服。桀起九夷之师伐汤。九夷之师不至。伊尹佐汤伐桀于鸣条。今晋宁路解州。桀战不胜。奔于三朡之国。汤又从而伐之。放于南巢而死。在位五十一年。夏氏亡</p><p>右夏十七主合四百三十二年。天下归商(史记注四百七十八年)</p><p>按<a href=\"/ctwh/jing/13j/zhouli.html\" class=\"keylink\" target=\"_blank\">周礼</a>自尧已前未有郡县。舜巡五岳始见州名。尚书禹贡已来方陈州号。春秋之时县大郡小。以郡属于县。汉高已来以县属郡。典诰所明九州禹迹百郡秦并是也</p><p>商</p><p>帝汤 外丙 仲壬 太甲 沃丁 大庚</p><p>小甲 雍己 太戊 仲丁 外壬 河亶甲</p><p>祖乙 祖辛 沃甲 祖丁 南庚 阳甲</p><p>盘庚 小辛 小乙 武丁 祖庚 祖甲</p><p>廪辛 庚丁 武乙 太丁 帝乙 受辛(纣也)</p><p>帝汤</p><p>黄帝之后。初帝喾次妃简狄。见玄鸟堕卵。取而吞之生契(音薛)。契仕事唐虞为司徒。教民有功封于商。赐姓子氏。契生昭明。昭明生相土。相土生昌若。昌若生曹圉。曹圉生冥。冥生振。振生微。微生报丁。报丁生报乙。报乙生报丙。报丙生主壬。主壬生主癸。主癸生天乙。是为成汤。为夏方伯。葛伯不祀仇饷。汤始征之。是时伊尹耕于有辛之野。汤使人以币聘之。因说汤伐夏以救民之事。汤进伊尹于桀。桀不能用。伊尹复归汤。桀之贤臣费昌亦归于汤。汤出见张网四面。汤为解其三面。更其祝曰。欲左者左。欲右者右。欲高者高。欲下者下。不用命者入吾网。汉南诸侯闻之曰。汤德及禽兽。归之者四十余国。桀暴虐万姓。伊尹相汤伐桀。费昌为御战于鸣条(解州也)桀师败绩。汤放桀于南巢。诸侯大会。汤退就诸侯之位曰。天下惟有道者可以处之。可以治之。三让。诸侯皆推汤。于是即天子位。以水德都亳(今河南府路偃师县是也)。除桀之邪虐。以宽治民。民喜远近归之。改正朔。夏之前皆以建寅之月为正月。汤既革夏命。乃以建丑之月为正月。十二寸为尺。色尚白。牲用白。以白为徽号。服旱冠而缟衣。初置二相。以伊尹仲虺为之。作乐曰大濩。在位十三年崩。寿一百岁。太子太丁早卒。次子外丙立</p><p>外丙</p><p>汤次子在位二年 古史考伊尹生于空桑。今汴梁路陈留有空桑故城是也</p><p>仲壬</p><p>外丙弟在位四年</p><p>太甲</p><p>汤太子太丁之子。既即位不明厥德。颠覆汤之典刑。伊尹放之桐宫(汤墓所也)。伊尹乃摄政当国以朝诸侯。太甲居桐三年。自怨自艾处仁迁义。伊尹乃以冕服奉太甲。复归于亳。太甲增加修德。诸侯咸归。保惠庶民。不敢侮鳏寡。号为太宗。在位三十三年</p><p>沃丁</p><p>太甲子。在位二十九年</p><p>太庚</p><p>沃丁弟。在位二十五年</p><p>小甲</p><p>太庚子。在位三十六年</p><p>雍己</p><p>小甲弟。商道寖衰。诸侯或不至。在位十四年</p><p>太戊</p><p>雍己弟。以伊胛?唷Y裼邢樯9裙采?诔?荒捍蠊按笪煳视谝岭。朐弧Q?皇さ隆&gt;???溆秀陟!L?煊谑切尴韧踔??C餮?现?瘛T绯?掏恕N始驳跎ァH?斩?榭菟馈H?暝斗街匾搿6?琳咂呤???S邢统嘉紫坛检璧裙哺ㄗ糁?I痰栏葱恕:懦浦凶凇T谖黄呤?迥</p></div>"
},{
    "title": "释氏稽古略 第二卷",
    "author": "觉岸大师",
    "html": "<div class=\"B1_text\"><p>释氏稽古略 第二卷</p><p>乌程职里宝相<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>释 觉岸 宝洲(编集再治)</p><p>东晋(司马氏都建康)</p><p>元帝 明帝 成帝 康帝 穆帝 哀帝 海西公 简文帝 武帝 安帝 恭帝</p><p>中宗元皇帝</p><p>讳睿。琅琊王觐之子。宣帝曾孙也。年十五嗣封琅琊王。怀帝永嘉元年为安东将军镇建业。愍帝建兴四年长安不守。愍帝蒙尘。王乃出师北征。丁丑年二月即晋王位于建康。始备百官立宗庙建社稷。大赦。改元建武。十二月愍帝遇害。戊寅年三月凶问至建康。王斩衰居庐。既而即皇帝位。大赦。改元大兴。立王太子绍为皇太子。是时承丧乱之后。江东草创。刁协久宦中朝谙练旧事。贺循为世儒宗明习礼乐。凡有疑议皆取决焉。帝在位六年。四十七岁</p><p>帝于建康造瓦棺龙兴二寺集丹阳建业千僧(弘明集) 武建(一)太兴(四)永昌(一)</p><p>丁丑 晋 建武元年汉刘氏 麟嘉二年大成李氏玉衡七年前凉 张寔慕容代平文帝郁律元年戊寅 大兴元年聪卒刘曜立光初元年玉衡八年康凉代 二年</p><p>汉主刘聪。至是戊寅年卒。太子粲即位。为靳准所杀。丞相刘曜即皇帝位。年曰光初。还都长安。改国号曰赵。石勒进爵为赵王(刘聪载记)</p><p>己卯 晋 大兴二年赵刘曜 光初二年成 玉衡九年后赵石勒元年前凉前燕慕容廆督东夷代 三年庚辰 大兴三年光初三年玉衡十年二年前凉燕代 四年辛巳 大兴四年光初四年玉衡十一年三年前凉 张茂袭位燕代贺 [仁-二+辱]元年壬午 晋永昌元年七年帝崩光初五年玉衡十二年四年前凉前燕代 二年</p><p>孔雀经 <a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>尸黎蜜多罗(此云吉友)尊者让王位<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>(如吴之太伯也)西晋怀帝永嘉中到华夏。至是抵建康止建初寺。丞相王导见之曰。我辈之人。太尉庾亮.光禄周觊.廷尉桓彝。一时名公皆造门结友。声名著搢绅间。善<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>要。时人呼为高座法师。又善咒诵作梵呗。清响凌云。译孔雀等诸经(本传)</p><p>肃宗明帝</p><p>绍。元帝长子。幼而聪哲。年数岁属长安使来。帝因问曰。汝谓日与长安孰近。对曰。长安近。但闻人从长安来。不闻从日边来。元帝异之。明日宴群僚。又问之。对曰。日近。元帝失色曰。何乃异间者之言乎。对曰。举目即见日。不见长安。由是益奇之。立为皇太子。性至孝有文武才略。钦贤爱客。雅好文辞。当时名臣自王导庾亮温峤桓彝阮放等。咸见亲待。习武艺善抚将士。于时东朝济济远近属心焉。永昌元年春正月。王敦于武昌上疏。罪状刀协刘隗。元帝劝协隗避祸。协行为人所杀。送首于敦。隗奔后赵石氏。官至太子太傅而卒。敦进兵据石头。元帝以敦为丞相。敦谋废太子不果。遂不朝天子而还武昌。十一月元帝忧愤成疾崩。太子即位。改元太宁。三月王敦谋篡位再兴兵。帝出师讨敦。二年五月敦疾甚。王含战败。敦寻卒。敦党秘不发丧。裹尸以席。蜡涂其外。埋于江宁厅事中。敦党既平。有司发敦瘗。出尸焚其衣冠跽而斩之。帝在位三年。寿二十七岁 帝崇斋兴福。造皇兴道场二寺(义楚六帖) 太宁(三)</p><p>癸未 晋 太宁元年赵刘曜 光初六年成 玉衡十三年后赵石勒五年前凉前燕代拓跋氏三年甲申 太宁二年光初七年玉衡十四年六年子骏袭位代王贺[仁-二+辱]四年乙酉 太宁三年七月帝崩光初八年玉衡十五年七年代炀帝纥那元年</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>竺法乘。神悟超绝。玄鉴过人。师于法护。护甚嘉之。后到炖煌立寺。延其学侣。大化于西者乘之力也(高僧传)</p><p>二十五祖婆舍斯多尊者 罽宾国人也。姓<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。父寂行。母常安乐。胜冠从师子尊者出家。受具既得法。欲诣南印度。初至中天竺国。其王曰迦胜。礼迎之。时王宫殿俄有异香。尊者肃然曰。我师谢矣。遂北面作礼。寻辞王。王曰。尊者少留容有所问。此苑有泉热不可探。愿为决之。祖曰。此为汤泉。有三缘所致。其一神业。其二鬼业。其三热石。热石者其色如金。其性常炎故。其出泉如荡。鬼业者谓其鬼方出罪所游于人间。以余业力煎灼此泉。以偿其夙债。神业者谓神不守其道妄作祸福。以取飨祀。恶业贯盈冥罚役之。亦使煎灼此泉以偿滥祭。王曰。幸尊者验之三缘。此果何者而致之。尊者曰。此神业所致也。即命爇香临水。为其<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。须臾濒水现一长人。前礼尊者曰。我有微祐得遇尊者。即生人中故来辞耳。已而遂隐。后七日其水果清冷如常泉。尊者辞王。王躬罗御仗以送之。至南印度。其王曰天德。逆而礼之。王有二子。一名德胜。二名不如蜜多。后德胜嗣位。信向外道致难于祖。遽问祖曰。予闻师子比丘不免于戮。何能传法。祖曰。我师难未起时授我信衣法偈以显师承。王曰。其衣何在。祖探囊中出衣示王。王命焚之。五色相鲜薪烬如故。王即敬礼曰。师子真嗣。王弟不如蜜多遂求出家。侍祖六年。于王宫受具。羯磨之际大地震动。祖命之曰。吾已衰朽。安可久留。汝当善护<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼藏普济群有。听吾偈曰。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>说知见。当境无非是。我今悟真性。无道亦无理。不如蜜多闻偈已。启祖曰。法衣宜传授邪。祖曰。此衣为难故假以为证。汝身无难。何假其衣。化被十方人自信向。祖乃现于神变。化<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>火自焚其身。平地<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>可高一尺。德胜王创浮图而秘之。当此东晋明帝之世也(正宗记)</p><p>显宗成帝</p><p>衍。明帝长子。太宁三年八月即帝位。年五岁。庾太后临朝。咸和二年冠军苏峻拒命谋逆。三年四月苏峻劫帝幸石头。京城宫室悉皆煨烬。独太宁殿壁明帝手画佛像屹然不坏。人皆嗟美称其神异。陶侃温峤攻石头。峻战坠马。斩首脔割之焚其骨。峻余众立峻弟逸为王。闭门自守。四年二月诸军攻石头。建威长史腾含击苏逸大破之。西军获逸斩之。滕含部将曹据抱帝奔温峤船。群臣见帝号泣请罪。是时宫阙灰烬。以建平园为宫。温峤欲迁都豫章。三吴之豪欲迁会稽。二论纷纭未决。司徒王导议之不复迁都。咸康元年正月庚午朔帝加元服。大赦改元。八年五月帝不豫。帝二子丕奕皆在襁褓。中书监庾冰自以兄弟秉权日久。恐易世有间。每说帝以国有强敌宜以长君。请以同母弟琅邪王岳为嗣。帝许之。六月帝崩。二十二岁。在位十七年</p><p>帝造中兴鹿苑二寺。集翻经义学千僧(六帖) 咸和(九)咸康(八)</p><p>丙戌 晋 咸和元年赵 光初九年成 玉衡十六年后赵石氏八年前凉前燕代 二年</p><p>飞来峰 西天竺国惠理法师。是年来游震旦。至浙西杭州。见山岩秀丽曰。吾国中天竺灵鹫山之一小岭。不知何年飞来。佛在世时多为仙灵所隐。今此亦复尔耶。有洞旧有白猿遂呼之。白猿应声而出。人始之信飞来。由是得名。师即地建两刹。先灵鹫后灵隐。师宴坐之岩号理公岩。今瘗塔存焉(寺记碑刻)</p><p>丁亥 晋 咸和二年赵 刘氏 光初十年成 李氏 玉衡十七年后赵石勒九年前凉张氏前燕代三年戊子 咸和三年刘耀石勒灭之合二十六年玉衡十八年石氏据中原太和元年前凉前燕四年</p><p>汉赵</p><p>汉刘渊。字元海。新兴匈奴人。汉以宗女妻冒顿。故子孙冒姓刘氏。西晋惠帝甲子永兴元年立成都王司马颖为皇太弟。颖表匈奴左贤王刘渊为冠军将军。监五部军事。将兵在邺(今彰德路郡名邺郡冀域)渊子聪骁勇绝人。博涉经史。善属文。弯弓三百斤。弱冠游京师。名士莫不与交。颖以聪为积弩将军。渊从祖右贤王刘宣。谓其族人曰。自汉亡以来。我单于徒有虚号无复尺土。今吾众虽衰犹不减二万。奈何敛手受役奄过百年。左贤王英武超世。天苟不与兴匈奴。必不虚生此人也。今司马氏骨肉相残。四海鼎沸。复呼韩邪之业此其时也。乃相与谋推渊为大单于。使其党呼延攸诣邺告渊。渊白颖请归会葬。颖弗许。及王浚东嬴公腾讨颖。渊说颖曰。请为殿下还说五部以赴国难。颖悦拜渊为北单于参丞相军事。渊至左国城。刘宣等上大单于号。二旬之间有众五万渊。都左国城。谓群臣曰。昔汉有天下恩结于民。吾汉氏之甥。乃建国号曰汉。即汉王位。年曰元熙。以右贤王宣为丞相。晋怀帝永嘉二年。汉王渊取山西。平阳(今晋宁路古晋州也)太守宋抽弃郡走渊。徙都平阳蒲子上郡即皇帝位。改元永凤。晋永嘉四年七月渊寝疾。以楚王聪为大司马大单于。安昌王盛.安邑王钦.西阳王浚.皆领武卫将军。分典禁兵。渊卒。太子和即皇帝位。西昌王锐耻不预顾命。乃相与谋说和曰。先帝不惟轻重之势。使三王拥强兵于内。大司马拥十万众屯于新郊。陛下宜早为之计。和召盛告之。盛曰。陛下信谗夫之言以疑兄弟。锐怒命左右刃之。帅兵攻楚王聪于单于台(今西京路即大同路也。郡名云中。汉高困白登是也。冀域)聪反攻西明门克之。杀和于光极西堂。收锐枭首于衢。聪即皇帝位。改元光兴。以北海王乂为皇太弟。封其子粲为河内王。以石勒为并州刺史(太原也。今改冀宁路)辛未汉嘉平元年。聪遣前军大将军呼延晏始安王刘曜王弥石勒。攻洛阳克宣阳门。晋怀帝出欲奔长安。汉兵追执之。迁帝及六玺于平阳。聪以帝为特进左光录大夫。封平阿公。壬申聪之嘉平二年。封怀帝为会稽郡公。次年二月怀帝遇害。四月怀帝凶问至长安。晋愍帝即位。改元建兴。建兴四年九月汉大司马刘曜攻长安。十一月晋帝曰当忍耻出降以活士民。曜送晋帝至平阳。汉主聪以晋帝为光禄大夫。封怀安侯。丁丑年十二月愍帝遇害。戊寅年汉主聪卒。太子粲即位。为靳封所杀。丞相刘曜即皇帝位。年曰光初。还都长安。改国号曰赵。以单于为祖。石勒进爵为赵王。至是东晋成帝咸和三年赵主曜围守洛阳。十一月石勒引兵救洛阳。战擒赵王曜。载以马舆至襄国杀之。己丑年正月赵太子熙闻曜被擒。遂帅百官走上邽(音圭郏西巩昌路古邽戍地也)关中大乱。将军蒋英辛恕据长安。遣使降于石勒。九月后赵中山公石虎大破赵兵于义渠。乘胜追击执赵太子刘熙及其将王公卿校以下三千余人皆杀之。秦陇悉平。汉赵刘氏。起自晋惠帝大兴甲子。终成帝咸和己丑。二十六年</p><p>己丑 晋 咸和四年成 玉衡十九年后赵 太和二年前凉前燕代翳槐元年追尊曰烈帝庚寅 咸和五年玉衡二十年石勒即帝位 建平元年二年辛卯 咸和六年玉衡二十一年建平二年三年壬辰 咸和七年玉衡二十二年建平三年四年癸巳 咸和八年玉衡二十三年勒建平四年七月卒燕慕容皝立代五年甲午 咸和九年玉衡二十四年 雄卒海阳王弘立延熙元年六年乙未 咸康元年汉改成曰汉期玉恒元年虎立 建武元年七年丙申 咸康二年玉恒二年建武二年八年丁酉 咸康三年玉桓三年建武三年前燕皝称王代 后元年戊戌 咸康四年李寿立 汉兴元年建武四年拓跋什昱徤建国元年追尊曰成帝</p><p>学箴 晋司徒王导以李充为丞相掾。充以时俗崇尚浮虚。乃着学箴。以为老子云。绝仁弃义民复孝慈。岂仁义之道绝。然后孝慈乃生哉。盖患乎情仁义者寡而利仁义者众。将寄责于圣人而遣累乎陈迹也。凡人见形者。众及道者鲜。逐迹逾笃。离本逾远。故作学箴。以祛其蔽曰。名之攸彰。道之攸废。乃损所隆。乃崇所替。非仁无以长物。非义无以齐耻。仁义固不可远。去其害仁义者而已(<a href=\"/ctwh/shi/24s/jinshu.html\" class=\"keylink\" target=\"_blank\">晋书</a>李充传)</p><p>晋光禄勋颜含以老逊位。致仕二十余年。至是十月卒。寿九十三岁。郭璞尝过含欲为之筮。含曰。年在天位在人。修己而天不与者命也。守道而人不知者性也。自有性命。毋劳耆龟</p><p>己亥 晋 咸康五年汉李氏 汉兴二年后赵石氏建武五年前凉张氏前燕代 建国二年</p><p>晋司徒王导卒。导有弟曰道宝。辞荣为僧。以学行显(高僧传)</p><p>庚子 咸康六年汉兴三年建武六年三年辛丑 咸康七年汉兴四年建武七年四年壬寅 咸康八年六月康帝即位汉兴五年建武八年五年</p><p>康帝</p><p>岳。成帝母弟。自琅琊王即帝位。在位二年。寿二十三岁。亮阴不言。委政庾冰封。成帝子丞为琅琊丕。奕东海王 建元(二)</p><p>癸卯 建元元年汉兴六年建武九年六年甲辰 建元二年九月帝崩执 太和元年建武十年前凉前燕代 七年</p><p>孝宗穆帝</p><p>聃。康帝太子。二岁即位。褚太后临朝。中外无事。升平元年正月朔帝加元服。太后归政。寿十九 永和(十二)升平(五)</p><p>乙巳 年在位一十七年 永和元年李执 太和二年建武十一年前凉称王前燕 皝代丙午 永和二年嘉宁元年建武十二年重华立代丁未 永和三年桓汤灭之 合四十五年建武十三年代</p><p>大成改曰汉 李持巴西人。少仕晋。西晋惠帝太安二年据益州(四川西道成都路也。梁州之域郡名锦城)国号曰成。年曰建初。特卒子雄。晋惠帝永与元年十月。雄即成都王位。改元建兴。以其叔父骧为太传。追尊父特为成都景王。晋惠帝先熙元年。成都王雄即皇帝位。年曰晏平。国号大成。尊特曰景皇帝。东晋成帝咸和九年雄卒。太子班即位。其弟安东将军李期谋作乱。因班夜哭弑之于殡宫。期即皇帝位。谥雄曰武皇帝。庙号太宗。晋成帝咸康元年。幽公期改年曰玉恒改国号曰汉。晋咸康四年。汉中穆文帝李寿杀期自立。改元汉兴。晋咸康七年。汉主寿以其子执领大将军录<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>事。晋康帝建元二年李执立。年曰太和。至是晋永和二年。汉年曰嘉宁十一月。晋安西将军桓温伐汉。晋永和三年三月。温兵至成都。纵火烧其城门。汉人惶惧无复斗志。执自称洛阳李执诸军门降。温送执及其宗室十余人。时建康封归义侯国灭。成起自西晋惠帝太安二年癸亥。终于东晋穆帝永和三年丁未。五主合四十五年</p><p>戊申 晋 永 四年后赵石氏 建武十四年前凉张氏前燕慕容皝卒隽立元年代</p><p>佛图澄和尚 天竺国人也。西晋怀帝永嘉四年至洛阳。自言百岁余。服气自养。积日不食。善诵咒役使鬼神。腹旁有孔以绵塞之。夜则拔绵出光以自照。每临溪从孔出肠胃洗濯。还纳腹中。会洛阳寇乱。潜伏草野。时石勒屯葛陂多残杀。澄杖锡谒勒。勒命试以道术。澄取满钵水咒之。俄青莲华生钵中。勒神敬之延于军中。东晋成帝咸和三年刘曜围守洛阳。勒自救之扣澄。澄曰。佛塔无风。一铃独鸣。曰秀支替戾冈仆谷劬秃当此羯语也。军出获刘曜。勒战果获曜。载之襄国。咸和五年勒称大赵天王。行皇帝事。奉澄弥如笃敬。号曰大和向。勒爱子斌病死将殡。勒叹曰。朕闻虢太子死。扁鹊能生之。今可得效乎。乃令告澄。澄取杨枝沾水洒之。执斌手曰可起矣。斌乃稣遂起。自是勒诸子多在澄寺中养之。晋咸和八年七月勒殂。弟虎字季龙袭位。徙都邺(今彰德路冀州之域)尤倾心事澄。至是晋永和四年澄将去世。诣辞季龙。惊曰。大和尚遽弃我国有难乎。澄曰。出生入死道之常也。修短分定无由增损。但道贵行全德贵不怠。苟<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>无玷。虽死如生。咸无焉千岁尚何益哉。然可恨者。国家存心佛理。建寺度僧当蒙福祉。而布政猛虐。赏罚交滥。特违圣典。致国祚不延也。季龙号恸呜咽。十二月八日澄安坐而逝。寿一百七十岁。入道一百九年。度<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>道安法师等七千余人。自大教东来至澄而盛(僧传)</p><p>己酉 晋 永和五年后赵大宁元年 虎殂国乱前凉前燕慕容 隽元年代</p><p>后赵</p><p>石勒上党人(今晋宁路潞州郡名上党冀域)初与八骑归汉刘氏。西晋怀帝永嘉四年。汉主刘聪即皇帝位。以勒为并州刺史(并州太原也。今曰冀宁路冀州之域)勒杀汉将王弥。聪大怒然犹加勒镇东大将军。东晋元帝大兴元年汉主聪卒。丞相刘曜即皇帝位。进勒爵为赵王。大兴二年勒据燕蓟号襄国称元年。晋成帝咸知三年勒年曰太和。赵主刘曜围守洛阳。十一月勒救洛阳。曜为勒将石堪所执。舆至襄国杀之。晋咸和五年。勒称大赵天王。行皇帝事。九月即皇帝位。改元建平。建平二年四月勒如邺将营新营。建平四年七月勒卒。太子弘即位。是为海阳王。改元延熙。夜以勒丧潜瘗山谷莫知其处。备仪卫虚葬于高平陵。谥曰明帝。庙号高祖。八月赵主弘以中山王虎丞相魏王加九锡。总摄百揆。为弘在位一年。明年九月赵魏王虎立。改元建武。都于邺。至是晋帝永和五年正月赵主虎改元太宁。既而病卒。太子世(虎之少子也)即位。彭城王遵(虎之长子也)废世为谯王寻杀之。遵即位。以义阳王鉴为侍中。武兴公闵都督中外诸军事。初赵主遵许以武兴公闵为太子。十月遵立太子衍闵益恨望。十一月闵帅甲士。执遵于南台杀之。立义阳王鉴。以闵为大将军。封武德王。晋永和六年正月武德王冉闵即皇帝位。改元永兴。国号大魏。后赵始东晋元帝大兴二年己卯。终穆帝永和七年辛亥。六主合三十三年(石勒载记)</p><p>闵大名路滑州内黄县人。本姓冉。赵主勒获之。命弟虎养以为子。闵至是复姓冉。庚戌年三月后赵石只闻冉闵篡位于邺。乃即帝位于襄国。改元永宁。十月冉闵伐襄国。明年辛亥石只将刘显杀只自立称帝。壬子年冉闵攻杀刘显。闵在位三年。前燕慕容隽进兵攻闵获之国灭。冉魏不在十六国占据之列(冉闵载记)</p><p>庚戌 晋 永和六年秦符洪赵将也据长安魏冉闵 永兴元年前凉张氏前燕慕容氏代</p><p>二月有佛金像现于荆州。司马桓温迎之不动。时江陵滕畯舍宅为寺。命法师昙翼主之。翼率众拜请捧之。飘然轻举安奉本寺(<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>传并图经)</p><p>辛亥 晋 永和七年洪卒子徤称天王 皇始元年永兴二年代壬子 晋 永和八年徤即皇帝位皇始元年一永兴三年前凉前燕隽即帝位元玺元年代</p><p>方外交 法师支遁。字道林。业精<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。时谢太傅安王右军羲之与之厚善。谢安守吴兴。日书抵遁。略曰。思君日积比辰尤甚。知欲还剡自治为之怆然。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>如寄耳。自顷风流得意事殆磨灭都尽。唯终日戚戚迟君一来。以晤言消遣之。一日千载也。东晋哀帝兴宁二年十月。沙门竺潜辞阙还剡山。诏遁继讲法于禁中。一时名士殷浩郗超孙绰桓彦表王敬仁何充王坦之袁彦伯并与结方外交。天下想见其标致也。晋废帝太和二年。遁杭表辞阙还山。有诏资给。敦遣诸公祖饯于征虏亭。投迹越之剡山。于沃州小岭立寺行道。僧众禀学。时有惰者。遁着铭以勖之。有曰勤之勤之。至道非弥。茫茫<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。渺渺长羁。谨守明禁。抗志无为。云云。有遗其马者。畜之曰。吾爱其骏耳。有遗其鹤者。纵之曰。冲天之物。岂耳目玩哉。君子多其达。后出山阴讲维摩经。许询为都讲。难义数反。听者钦服寿五十三入灭。戴逵过其塔叹曰。德音未远。而拱木已繁计。神理绵绵不与气运俱尽也(本传)</p><p>癸丑 晋 永和九年 越阑亭序前秦符氏皇始三年前凉祚立和平元年前燕二年代甲寅 晋 永和十年前秦符氏皇始四年前凉称王和平二年前燕 元玺三年代</p><p>沙门帛法桥。诵经乏声忏悔七昼夜。祷<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>以求显报。至七日喉内豁然。自是昼夜讽咏声彻里许。年踰九十。声通婉响(本传)</p><p>乙卯 永和十一年徤卒生立 寿光元年靓立 建兴元年元玺四年丙辰 永和十二年寿光二年建兴二年元玺五年丁巳 升平元年 帝加坚立元服生卒 永兴元年建兴三年迁都子邺 光寿元年代戊午 升平二年永兴二年建兴四年光寿二年己未 升平三年<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>元年建兴五年光寿三年庚申 升平四年甘露二年建兴六年隽卒讳立 建熙元年代辛酉 升平五年 五月帝崩甘露三年玄靓奉晋正朔建熙二年</p><p>哀帝</p><p>丕。成帝长子。封琅琊王。穆帝无嗣。皇太后以王奉大统即位。饵长生药。药发不能亲政。褚太后临朝。寿二十五 隆和(一)兴宁(三)</p><p>壬戌 帝在位四年 隆和元年甘露四年建熙三年代癸亥 兴宁元年甘露五年天锡建熙四年甲子 兴宁二年甘露六年建熙五年乙丑 兴宁二年 二月帝崩建元元年建熙六年代</p><p>晋王坦之舍园宅为安乐寺。释慧受化之也(弘明集寺记)</p><p>废帝</p><p>奕。哀帝母弟。哀帝无子。太后命之为嗣即位。桓温畜不臣之志讽褚太后。废帝为东海王。又封海西公。寿四十五岁 太和(五)</p><p>丙寅 帝在位六年 太和元年前秦 建元二年前凉前燕暐 建熙七年代</p><p>十诵戒本三部 秦西域沙门昙摩持(此云法海)译出(<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>本传)</p><p>丁卯 晋 太和二年前秦符氏建元三年前凉张氏前燕慕容氏建熙八年代</p><p>沙门竺道猷。即帛道猷也。初止剡之石城山。是年又移台州。始丰赤城山(今台州天台山)<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>石室。有群虎蹲于前。猷诵经。一虎独睡。猷以如意扣其头。云何不听经。轻毕虎皆去。寻有大蛇十围。竟来环绕举头向猷。半日而去。一日有男子来前曰。弟子夏帝之子。居此二千余年。今往寒石山。辄推室以相奉。遂鸣鞞改角凌云而去。猷于东晋武帝太元八年入寂(本传)</p><p>戊辰 太和三年建元四年前凉前燕 建熙九年代</p><p>释慧常译<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>传六卷 晋安西将军桓温主簿王珣及弟玟舍宅为寺。平江路虎丘山是也(图经寺记)</p><p>医术 沙门于法开。是年入寂。开兰公弟子也。善放光般若经。尤精医法。穆帝尝召之。视脉知其不起乃不医。或问曰。师高明刚简。何以医术经怀。开曰。明<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>以除四魔之病。调九候以疗风寒之疾。自利利人不亦可乎(本传)</p><p>己巳 太和四年建元五年前凉建熙十年庚午 晋 太和五年前秦 建元六年前凉前燕暐 建熙十一年国灭代</p><p>晋辛未年十一月。桓温自广陵诣建康。讽褚太后请废帝立丞相会稽王昱。诏进温丞相大司马留京师辅政。温乃辞仍请还镇姑孰(帝纪)</p><p>前燕</p><p>慕容廆(户贿反)昌黎鲜卑人。世受晋封号。东晋元帝大兴二年廆都督东夷置僚属。晋成帝咸和八年慕容皝(胡广反)立。至丁酉年皝称王。皝雅好文学。亲临庠序。讲授考校。晋穆帝永和四年十一月皝卒。世子隽即位。遣使诣建康告丧。晋帝诏遣谒者陈光拜隽为燕王。隽以戊申岁称元年。壬子年隽灭石赵。十一月隽即皇帝位。称元玺元年。丁巳年隽迁都邺(彰德路古相州冀域)即石虎之都也。改元光寿。庚申年正月昭帝隽卒。大司马慕容恪受遗诏。辅太子暐即位。改元建熙。暐曰幽帝是也。己巳建熙十年燕太傅上容王慕容评忌吴王慕容垂威名。又与评廷争怨隙。太后可足浑氏与评密谋诛垂。垂与子弟侄俱奔秦。秦王符坚大喜郊迎。乃以垂为冠军将军封宾从侯。初晋攻燕。燕求救于秦。许割虎牢以西赂秦。晋兵既退。燕人悔之。秦主坚大怒。帅兵伐燕。十二月进攻洛阳。建熙十一年正月。燕荆州刺史武威王筑。以洛阳降秦。六月再伐燕。燕败。十一月秦主坚入邺。燕主暐出降。十二月秦主坚迁慕容暐及燕后妃王公百官于长安。封暐为新兴侯。其余封授各有差。廆起自晋惠帝太安二年癸亥。终东晋废帝太和五年庚午。四主合六十八年</p><p>太宗简文帝</p><p>昱。元帝少子也。封会稽王。康帝崩。太后诏王总万机。进位司徒丞相录尚书事。桓温废海西公以太后命。王入承大统。桓温擅权。帝以仁恕处之。寿五十三岁 帝造佛像立寺建斋度僧。建康长干寺建佛塔壮丽(弘明集) 咸安(二)</p><p>辛未 晋十一月帝立改曰咸安元年前秦符氏奄有中原 建元七年前凉张氏代</p><p>晋沙门竺法汰。止建康瓦棺寺。帝深敬重。请讲放光般若经。帝亲临幸。公卿毕集。缁素钦敬。武帝太元十二年汰入寂。寿六十八。武帝诏曰。汰法师道播八方。奄尔丧逝。可赙钱十万。丧事有司悉办(本传)</p><p>壬申 咸安二年 七月帝崩前秦 建元八年前凉代</p><p>晋许询。字玄度。帝重敬甚。每与清谈。询后身为僧名昙彦。浙东绍兴建塔。彦寿一百二十岁(本传塔记)</p><p>烈宗孝武帝</p><p>曜。简文第三子。即位年十一。太元元年正月朔。帝加元服。太后归政。在位二十四年。寿三十五 宁康(三)太元(二十一)</p><p>癸酉 晋 宁康元年秦 建元九年前凉代</p><p>七月南郡宣武公桓温疾笃。以弟冲领其众薨。冲称温遗命。以少子玄为嗣。时方五岁。袭封南郡公。冲代温居任尽忠王室。八月太后复临朝摄政</p><p>甲戌 宁康二年建元十年前凉代</p><p>敕葬沙门 法师竺法潜。哀帝兴宁二年诏讲般若经于禁中。潜着屐至殿中。人聚观叹道德高风之盛。帝尝强以衣冠。潜不允辞还剡山。其后支遁寓书求买沃州小岭以归隐。潜答曰。欲来当给。未闻巢由买山而隐也。至是年入寂。武帝下诏曰。法师理悟虚远。风鉴清高。弃宰辅之荣。袭染衣之素。山居世外。笃勤匪懈方。赖宣道以济苍生。奄从迁谢。用痛于怀。其赐缗钱十万。助建茔塔。凡中国敕葬沙门自潜而始也(僧传)</p><p>乙亥 晋 宁康三年前秦 建元十一年前凉代丙子 晋 太元元年正月朔帝加元服前秦符 氏建元十二年前凉张氏秦灭之合七十四年代拓跋圭是年筑城邑</p><p>前凉</p><p>张轨。字士彦。安定人(今陕西庄浪路泾州雍州之域)仕晋为散骑常侍。惠帝永宁元年正月为凉州刺史。轨以时方多难。阴有保据河西之志。故求为凉州。癸亥年据之。愍帝建兴二年轨称凉州牧西平公。建兴四年张寔袭位。东晋元帝大兴四年弟茂袭位。晋明帝太宁二年子骏袭位。晋穆帝永和元年称王。永和二年五月西平忠成王张骏薨。官属上世子重华为凉州牧西平公假凉王。永和九年十一月西平敬烈公张华卒。世子曜灵才十岁。右长史赵长等建议立长宁侯祚。重华庶兄也。废曜灵为凉宁侯。立祚为凉州牧。改元和平。晋永和十年正月张祚自称凉王。置百官郊祀天地用天子礼乐。永和十一年冲公靓立。年曰建兴。至晋哀帝兴宁元年。凉绰公张天锡杀靓而自立。至是武帝太元元年符秦灭之。合七十四年</p><p>凉州隶今甘肃省。雍州之域</p><p>丁丑 晋 太元二年前秦 建元十三年晋书曰至是九州之地秦有其八晋唯东南一隈耳代</p><p>庐山西林寺 晋释慧永。初与远公法师同依道安法师。至是永公先至浔阳。刺史陶范留之憩庐山。舍宅栖止之。乃创寺曰西林。岭上一室曰香谷(本传)</p><p>戊寅 晋 太元三年前秦 建元十四年代</p><p>都维那 沙门竺道壹从竺法汰学晋简文帝俱深敬重壹后止平江虎丘山又适越州若耶溪顷之郡守王荟建嘉祥寺请居僧首时号九州都维那(孙绰赞传) 毗奈耶律十卷 是年竺法念法师译之成</p><p>己卯 晋 太元四年前秦 建元十四年 秦取晋襄阳得道安法师并习凿齿代庚辰 太元五年建元十六年代</p><p>沙门竺法义。王道孔敷。承风敬友。帝尝遣使征请殿中。讲说经典。武帝每从而听。是年入寂。帝赐钱十万。营塔葬新亭冈。今天安寺也(本传)</p><p>辛巳 太元六年正月帝立精舍殿内延诸沙门讲道建元十七年代壬午 晋 太元七年建元十八年吕光据姑臧即凉州也代</p><p>前秦主坚遣左将军吕光伐龟兹。迎鸠摩罗什法师。吕光遂据于姑藏(即凉州也)。号后凉</p><p>癸未 晋 太元八年前秦 建元十九年吕光代拓跋圭甲申 太元九年建元二十年后秦姚苌白雀元年西秦乞伏国仁据金城吕光后燕慕容垂元年代</p><p>雁门远公法师。是年抵江州路庐山</p><p>乙酉 太元十年坚遇弑子丕立太平元年白雀二年西秦 建义元年吕光垂据中山建兴元年代圭丙戌 太元十一年丕卒登即位陇东 太初元年苌入长安即位建初元年建义二年三河王吕光太安元年建兴二年圭即魏王位 登国元年丁亥 太元十二年太初二年建初二年建义三年麟嘉元年建兴三年魏王圭 登国二年戊子 太元十三年太初三年建初三年建义四年麟嘉三年建兴四年登国三年</p><p>二十六祖不如蜜多尊者 南印度天德王之次子也。既得度受法至东印度。彼王名坚固。奉外道师长爪梵志。王睹白气贯于上下。王曰。此何瑞也。梵志曰。魔来之兆。即集其徒曰。不如蜜多将入都城。谁能挫之。其弟子曰。我等各有咒术。可以动天地入水火。何患哉。祖至。王曰。师何为来。祖曰。将度<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。王曰。以何法度。祖曰。各以其类度之。时梵志即以幻法化大山于祖上。祖指之还压其众。梵志怖惧投祖。祖愍之再指化山。山随指灭。祖为王演说法要。俾趣真乘。时有婆罗门子年二十许。不知名氏。或自言璎珞。人故谓之璎珞童子。王与祖同辇而出见璎珞。祖指谓王曰。此童子大势至菩萨也。此圣之后复出一人。一人化南印度。一人缘在震旦。以昔因故名般若多罗。吾今以正<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>藏付之。偈曰。真性心地藏。无头亦无尾。应缘而化物。方便呼为智。付法已辞王曰。吾归寂灭。愿王于最上乘毋忘外护。即跏趺而逝。化火自焚。王为收舍利建塔瘗之。当此东晋武帝之世也(正宗记)</p><p>己丑 晋 太元十四年前秦符氏太初四年后秦姚氏建初四年西秦干归太初元年吕氏 麟嘉三年后燕 垂 建兴五年魏王 登国四年</p><p>释道安法师 常山扶柳卫氏子。世业儒。早失恃怙依表兄。年十一出家师事佛图澄。读书日记万言。才辩无敌。性聪而貌丑。时语曰漆道人惊四邻。及澄卒率徒众渡河依陆浑山。木食涧饮。至是武帝宁康元年于襄阳立檀溪寺。建浮图铸铜佛像。武帝闻安名诏曰。法师以道德照临<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。使大法流行为苍生依赖。宜日食王公禄。所司以时资给。安固辞不受。己卯晋太元四年二月。秦主坚攻取襄阳。得安而喜。谓左右曰。吾以十万师取襄阳。得一人半耳。左右问为谁。曰安公一人。习凿齿半人也。安至长安。沙门万数各随其师为姓。安曰师莫如佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>也。应沙门宜以释为氏。及增一阿含经至乃云。四河入海无复异名。四姓出家同称释氏。与经符合。世益重之。己丑年正月晦日命门徒具浴。忽有异僧出入隙中。安以生处问之。僧指西北。云即开见楼阁如幻出。曰彼兜率天也。是夕有数百小儿皆就浴而去。识者以为应真之侣也。二月八日跏趺而逝。安每疏经义必求圣证。安左臂有肉方寸隆起如印。时号印手菩萨。着僧尼轨范及法门清式二十四条。世遵行之(本传) 秀紫芝编年论曰。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>之盛由佛图澄而得安。由安而得远公。是三大士化仪全伟</p><p>庚寅 晋 太元十五年前秦苻氏太初五年后秦姚氏建初五年西秦乞伏太初二年吕氏 麟嘉四年后燕 建兴六年魏 登国五年</p><p>庐山<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a><a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a> 始起此年详见远法师下</p><p>辛卯 太元十六年太初六年建初六年太初三年麟嘉五年建兴七年登国六年壬辰 太元十七年太初七年建初七年太初四年麟嘉六年建兴八年登国七年癸巳 太元十八年太初八年长卒太子兴立太初五年麟嘉七年建兴九年登国八年甲午 太元十九年符崇灭 延和元年后秦兴 皇初元年太初六年麟嘉八年建兴十年登国九年</p><p>前秦</p><p>符健。略阳氐人。父洪仕后赵为都督。因石氏之乱据有关右。东晋穆帝永和六年洪卒。十一月第三子健入长安。秦雍夷夏皆附之。次年正月健即天王位。国号大秦。称大单于。建元皇始。分遣使者问民疾苦。搜罗俊异。宽重敛之税。罢无用之器。凡赵之苛政民不便者皆除之。壬子年正月健即皇帝位。甲寅年东海王雄卒。雄子坚袭爵。坚至孝博学多能。乙卯年六月健卒。谥曰景明皇帝。庙号高祖。太子生即位。改元寿光。生暴虐饮酒无昼夜。乘醉视事多所杀戮。群臣得保一日如度十年。丁巳年六月太史令康权言于生曰。昨夜三月并出。孛星入太微连东井。将有下人谋上之祸。生怒以为妖言。扑杀康权。生夜对侍婢曰。阿法兄弟亦不可信。明当除之。婢以告坚及坚兄清河王法。法与特进梁平老及特进强汪帅壮士数百。潜入云龙门。坚与尚书吕婆楼帅麾下三百人鼓噪继进。宿卫将士皆舍仗归坚。坚兵引生置别室。生犹醉寐。废生为越王寻杀之。谥曰厉王。坚以位让兄法。法曰。汝嫡嗣且贤宜立。坚乃去皇帝之号。称大秦天王。改元永兴。追尊父雄为文桓皇帝。母苟氏为皇太后。世子宏为皇太子。以兄清河王法都督中外诸军事。丞相录尚书事诸王皆降爵为公。弟融为阳平公。子丕为当乐公。举异才修废职。课农桑恤困穷。礼百神立学校。旌节义继绝世。秦民大悦。己未年改元甘露。己丑年改元建元。癸未东晋武帝太元八年秦建元十九年也。大举攻晋。坚大败而归。乙酉年五月西燕慕容冲攻长安。坚自督战。飞矢满体流血淋漓。冲纵兵暴掠关中。道路断绝千里无烟。坚出奔五将山。后秦王姚苌遣骁骑将军吴忠执坚。谥之于新平(邠州也)佛寺。坚子丕自邺奔长安至晋阳。始知长安不守坚已死。乃发丧即皇帝位。改元太平。追谥坚曰宣昭皇帝。庙号世祖。丙戌年九月燕之慕容永遣使于丕假道东归。丕弗许。丕永战于襄陵。丕败谋袭洛阳。时为扬威将军凭该自陕邀击杀丕。十一月秦南安王符登。为丕发丧行服即皇帝位。改元太初。谥丕曰哀平皇帝。至是甲午年实晋武帝太元十九年也。七月后秦主姚兴自陕西泾州如泾阳。与登战于山南。执登杀之。登太子崇奔湟中。即皇帝位。改元延和。谥登曰高皇帝。崇为后秦姚氏所灭。合四十五年</p><p>乙未 晋 太元二十年后秦姚氏皇初二年西秦乞伏太初七年三河王吕光 麟嘉九年后燕慕容 建兴十一年魏 登国十年丙申 晋 太元二十一年 六月帝被弑皇初三年西秦乞伏后凉即大王位龙飞元年慕容宝 永康元年魏建天子旌旗 皇始元年</p><p>安帝</p><p>讳德宗。武帝太子。大元二十一年九月即位。在位二十二年。寿三十七岁 隆安(五)元兴(三)义熙(十四)</p><p>丁酉 晋 隆安元年南燕 慕容德南凉秃发乌孤后秦姚氏皇初四年西秦乞伏西凉李高后凉吕光龙飞二年后燕 永康二年北凉沮渠神玺元年魏 皇始二年戊戌 隆安二年武帝德 元年据广武 太初元年皇初五年西秦西凉 据箴后凉吕氏龙飞三年后燕盛 建平三年北凉 神玺三年魏即帝位天兴元年</p><p>魏</p><p>太祖下诏曰。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之兴其来远矣。济益之功冥及存没。神踪遗法信可依凭。敕有司于京城建饰容范修整寺舍。令信向之人有所依止(魏史)。太祖于虞地造十五级浮图。又造开泰定国二寺。写<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>论。造千金像。每日法集三百名僧(弘明集)</p><p>己亥 隆安三年据广固南凉 太初二年后秦隆帝号称王 弘始元年西秦乞伏西凉后凉篡 咸宁元年后燕长乐元年北凉 天玺元年魏 天兴二年庚子 隆安四年南燕即帝位建平元年南凉利鹿孤建和元年后秦 弘始二年西秦乞伏西凉暠元年后凉 咸宁二年后燕 长乐二年北凉 天玺二年魏 天兴三年辛丑 晋 隆安五年南燕 建平二年南凉 建和二年后秦姚氏弘始三年西秦乞伏西凉暠二年后凉隆 神鼎元年后燕熙 光始元年北凉蒙逊永安元年魏拓跋 天兴四年</p><p>后凉</p><p>吕光。略阳氐人。仕符秦为左将军。东晋武帝太元十一年元有将曰王穆。据肃州酒泉。自称凉州牧。光进攻酒泉克之。光即三河王位。建元太安。据姑臧(甘肃省凉州也雍域)。改年曰麟嘉。晋太元二十一年六月。三河王光即天王位。是为武帝。国号大凉。改元龙飞。以世子绍为太子。至是晋隆安三年十二月光卒。太子绍即位。大原公纂杀之。纂即天王位。是为灵帝。改元咸宁。纂嗜酒好猎。隆安五年吕超杀之而立吕隆。改元神鼎。明年隆降于后秦。姚氏三主合一十七年</p><p>鸠摩罗什法师 龟兹国人。初东晋武帝太元七年。前秦主符坚遣骁骑将军吕光伐龟兹国取师。光回闻秦乱。遂据姑臧。至是后秦主姚兴灭吕隆而迎师。师少时日诵三万二千言。随母出家遍游西域。淹贯群籍尤善大乘。在龟兹日。邻国诸王会同。每请师说法。必跪伏座前。命师践其肩而登座居后秦。大阐经论。秦主以师为国师。奉之如神。亲帅群臣及沙门。听师讲经。又请师翻译西域经论。凡震旦宣译师出者三百八十卷。大营塔寺。坐禅者常以千数。公卿以下率皆奉佛。州郡化之。癸丑晋帝义熙九年秦弘始十五年也。四月十三日师入灭。寿七十岁。师之弟子曰生.肇.融.睿。谓之什门四圣。加昙影.慧严.慧观.僧[契-大+石].道常.道标谓之什门十哲。又有僧导.僧因。皆当世名匠也。师入灭日谓众曰。所译唯十诵律未及删繁。若义契<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。焚身之日舌不焦坏。言讫而逝。阇维舌果不坏若红莲色。师名鸠摩罗什。翻曰童寿(高僧传)</p><p>山神请戒 释昙邕。初仕符秦为卫将军。坚南败。遂从道安法师出家。次事庐山远公。后于庐山之西营立茅茨。偕弟子昙果沉思禅门。忽有男子丰姿端雅从者二十人。来请<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。邕知是山神。乃为秉炉授之三归五戒。为说法要。神嚫邕外国七筯<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>辞别。倏忽不见。三归者归依佛归依法归依僧。五戒者不杀不盗不淫不饮酒不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>也(高僧传)</p><p>壬寅 晋 元兴元年南燕 建平三年南凉[仁-二+辱]檀 弘昌元年后秦 弘始四年西秦乞伏西凉暠三年后燕 光始二年北凉 永安二年魏 天兴五年癸卯 晋 元兴二年南燕 建平四年南凉 弘昌二年后秦 弘始五年西秦乞伏西凉四年后燕 光始三年北凉 永安三年魏 天兴六年甲辰 晋 元兴三年南燕 建平五年南凉 弘昌三年西秦 弘始六年西秦乞伏西凉五年后燕 光始四年北凉 永安四年魏 天赐元年</p><p>晋隆安三年。南郡公桓玄(大司徒温之子)豪横既克荆雍。表求领荆江二州。朝廷不能违。元兴元年朝廷以尚书令元显镇北将军刘牢之谯三尚之。将兵讨玄于江陵。玄大惊。长史卞范之为玄定议。整兵至新亭。元显兵溃。玄入京。总百揆斩元显等。二年二月以玄为大将军。九月侍中殷仲文散骑常侍卞范之阴撰九锡文及册命。命玄相国总百揆封十郡为楚王。加九锡。十一月诏楚王玄行天子礼乐。卞范之为禅诏。使临川王宝逼帝书之。司徒王谧奉玺绶禅位于楚帝。出居永安宫。百官诣姑孰(江东道太平路扬州之城)劝进。十二月玄即皇帝位。国号楚。建元永始。封帝为平固王。玄入建康宫登御座床忽陷侍中殷仲文曰将由圣德深厚地不能载。玄大悦。玄迁帝于浔阳(江州也)。元兴三年二月下邳太守刘裕何无忌刘毅。青州主簿孟昶兴复晋室。进兵罗落桥。玄潜使殷仲文具舟于石头。浮江南走。裕入建康。帅百官奉迎乘舆。诛玄宗族在建康者。玄至浔阳逼帝西上。四月刘毅何无忌袭破浔阳城。玄挟帝单舸西走入江陵欲奔汉中。城内乱。玄仅得至船。荆州别驾王康彦奉帝入南郡府舍。太守王腾之帅文武为侍卫。玄入蜀至枚回洲。遇宁州刺史毛璠丧迎玄战。矢下如雨。益州督护凭迁抽刀击玄斩之。义熙元年二月留台备法驾。迎帝于江陵至建康。以刘裕都督中军事。刘毅左将军。何无忌豫州刺史。刘道规荆州刺史。四月裕旋镇京口。义熙十二年十二月诏以刘裕为相国。总百揆扬州牧封十郡为宋公。备九锡之礼。裕不受</p><p>乙巳 晋 义熙元年南燕超 太上元年南凉 弘昌四年后秦 弘始七年西秦乞伏西凉李暠 建初元年后燕 光始五年北凉 永安五年魏 天赐二年</p><p>僧正悦众僧录后秦法师道[契-大+石]罗什弟子。奉律精苦。秦主重之。自什公入关僧尼以万数。遂置僧正诏曰。大法东流于今为盛。僧尼[穴/浸]多。宜设纲领宣授远规以济颓绪。[契-大+石]法师早有学諠。晚以德称。可为国僧正。给与吏力资侍中秩。传轺羊车各二人。又以僧迁禅慧为悦众。以法钦慧斌为僧录。班秩有差。日加亲信。仗身白从各三十人(僧史略)</p><p>丙午 义熙二年太上二年弘昌五年弘始八年西秦乞伏建初二年夏赫连 龙升元年后燕 光始六年北凉 永安六年魏 天赐三年</p><p><a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a> 天竺北印度罽宾国尊者佛驮跋陀(此云觉贤)来游华夏。至是丙午岁抵长安。鸠摩罗什倒屣迎之。以相得迟暮为恨。秦太子姚泓。延至东宫。对什公论法。什公问曰。法云何空。答曰。众微成色。色无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。故色即空。又问。既以极微破色空。复云何破一微。答曰。以一微故众微空。以众微故一微空。沙门宝云译出此语不省其意。皆谓跋陀所计微尘是常。更申请之。跋陀曰。法不自生。缘会故生。缘一微故有众微。微无自性则是空矣。宁当言不破一微乎。不契。跋陀既渡江入匡山。见远公议论远高之请出禅数诸经。义熙十四年戊午。因适江陵。宋王刘裕请归京都止谢司空道场寺。三月吴郡内史孟顗等请尊者于寺译华严经成六十卷。宋高祖永初元年庚申六月毕。译经之时。感二青衣童子每且自庭沼中。出炷香添瓶水不离座侧。暮则潜入沼中。译经毕绝迹不现(秀紫芝编年华严感应记)</p><p><a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a> 是年五月。罗什法师译出成七卷。什又出维摩经三卷。华手经十三卷。又于草堂寺译出梵网经二卷(译传)</p><p>丁未 晋 义熙三年南燕 太上三年南凉 弘昌六年后秦 弘始九年西秦乞伏西凉 建初三年夏勃勃 龙升二年后燕云 正始元年北凉 永安七年魏 天赐四年</p><p>后燕</p><p>慕容垂。前燕主慕容皝第五子。在燕封吴王。聪敏智勇。威名日振。太傅慕容评与垂廷争怨隙。太后与评密谋诛垂。东晋废帝太和四年垂与子弟侄俱犇秦。秦主符坚大喜郊迎。以垂为冠军将军。封宾从侯。东晋武帝太元八年。秦主坚为晋败归至渑池。垂言于坚曰。北鄙之民闻王师不利。轻相扇动。臣请奉诏书以镇慰安集之。垂至安阳(邺郡古相州也)。潜与燕之故臣谋复燕祚。会丁零翟斌叛秦。次年正月斌等奉垂为盟主。乙酉年吴王垂始定都真定中山府(古定州也冀域)。即皇帝位。建元建兴。是时拓跋魏叛燕侵逼附塞诸部。丙申晋太元二十一年也。三月燕主垂亲伐魏。四月卒于上谷之沮阳。还至中山乃发丧。太子宝即位。曰闵帝。改元永康。戊戌年武帝慕容盛即位。年曰建平。次年改曰长乐。辛丑年昭帝熙光始元年。至是丁未年懿帝高云。年曰正始。国乱为凭跋篡灭之。合二十四年。凭跋号北燕</p><p>天竺佛驮耶舍(此云觉明)尊者 至姑臧(今肃州路雍州之域)。后秦弘始九年遣使请至长安。秦主郊迎别创院处之。供设如王者。尊者一无所受。时至分卫一食而已(自行乞而食也)善毗婆沙论而髭赤。时号赤髭毗婆沙。后至晋游匡山。为远公所重。甲寅晋安帝义熙十年也。尊者躬自负铁于紫霄峰顶铸塔。以如来真身舍利藏其中。是时佛驮跋陀尊者。亦以<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>五粒建塔于庐山东林寺北之上方。逮今皆存焉(高僧传庐山记)</p><p>戊申 晋 义熙四年南燕 太上四年南凉 嘉平元年后秦 弘始十年西秦西凉 建初四年夏赫连 龙升三年北燕北凉 据昌黎永安八年魏 天赐五年</p><p>律师 天竺尊者名卑摩罗叉(此云无垢眼)。至秦数年。今出游关左。盛阐毗尼。鸠摩罗什所译十诵戒本律藏大<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>叉之力也。其所制内外禁轻重二卷今行于世。叉为人眼青。时号青眼律师(本传)</p><p>己酉 晋 义熙五年南燕 灭南凉 嘉平二年后秦 弘始十一年西秦乞伏 更始元年西凉 建初五年夏赫连 龙升四年北燕凭跋 太平元年北凉 永安九年魏 嗣 永兴元年</p><p>南燕</p><p>丁酉年(晋安帝隆安元年也)南燕慕容德。前燕主皝之少子也。据广固(古汴日今青州)。戊戌岁称元年。庚子年德更名备德。即皇帝位(武帝也)。年曰建平。乙巳年南燕主超太上元年己酉年(晋义熙五年也)。晋徐州刺史刘裕抗表伐南燕。明年正月燕尚书悦寿说超降。超不从。悦寿开门纳晋师。超走追获之送建康。南燕平。合十三年</p><p>魏</p><p>太祖道武帝圭。为少子绍弑之。太宗明元帝嗣立。敕于京邑四方建立佛像。仍令沙门敷导民俗(魏史)</p><p>庚戌 义熙六年嘉平三年弘始十二年更始十二年建初六年龙升五年太平二年永安十年永兴二年辛亥 义熙七年嘉平四年弘始十三年更始十三年建初七年龙升六年太平三年永安十一年永兴三年壬子 义熙八年嘉平五年弘始十四年炽盘 永康元年建初八年龙升七年太平四年迁都 元始元年永兴四年</p><p>古树<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a> 释慧持。庐山远法师之弟也。当晋隆安二年。辞远公入蜀。止嘉州龙渊寺。白黑恭敬。升持之堂者皆号登龙门。至是义熙八年壬子垂诫门徒。遂入定于龙渊龛树。至宋政和三年风折其树。持乃出定。徽宗有赞偈三首。见政和年(僧传并系年录)</p><p>癸丑 晋 义熙九年南燕 嘉平六年后秦 弘始十五年西秦乞伏 永康二年西凉 建初九年夏赫连 凤翔元年北燕 太平五年北凉 元始二年魏 永兴三年</p><p>竖石听讲 罗什法师弟子道生。初<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>后品未至。生熟读久之曰。阿阐提人自当<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。此经来未尽耳。于时文字之师交攻之。诬以为邪说。于律当摈。生袖手来晋入平江虎丘山。竖石为听徒讲<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>经。至阐提有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>处曰。如我所说义契佛心否。群石皆首肯之。后游匡山居销景岩。闻昙谶在北凉重译涅槃后品。至南京。果言阐提皆有佛性。生喜慰不胜(本传)</p><p>甲寅 义熙十年南凉 灭弘始十六年永康三年建初十年凤翔二年太平六年元始三年神瑞元年</p><p>南凉</p><p>秃发乌孤。河西鲜卑人。至是晋帝隆安元年据广武(今陕西巩昌路兰州。古雍州之地也)。号南凉。戊戌年乌孤建元太初。庚子年利鹿孤建和元年正月欲称帝。安国将军鋀勿嵛曰。吾国上世以来被发左衽无冠带之饰。逐水草迁徙。无城廓室庐。故能雄视沙漠抗衡中夏。利鹿孤从之。乃更称河西王。改元建和。以广武公[仁-二+辱](奴笃切)檀为都督中外诸军事凉州牧。壬寅年景王[仁-二+辱]檀立。年曰弘昌。戊申年四月后秦王姚兴欲取[仁-二+辱]檀。使尚书郎韦宗往岘之。论当世大略纵横无穷。宗退叹曰。奇才英器不必华夏。明智敏识不必读书。吾乃今知九州之外五经之表。复自有人也。归言于兴。凉州未可图也。兴不听遣兵袭[仁-二+辱]檀。后秦兵大败。十一月[仁-二+辱]檀称凉王。大赦改元嘉平。置百官。甲寅晋义熙十年也。[仁-二+辱]檀为西秦乞伏炽盘所杀。南凉灭。三主一十八年</p><p>乙卯 晋 义熙十一年后秦 弘始十七年西秦 永康四年西凉 建初十一年夏 凤翔二年北燕 太平七年北凉 元始四年魏 神瑞二年</p><p>庐山远法师 讳慧远。出雁门(今去同路)贾氏。少为儒生。博极群书。尤邃<a href=\"/ctwh/jing/13j/zhouyi.html\" class=\"keylink\" target=\"_blank\">周易</a>庄老。尝与其弟慧持造道安法师。闻出世法。而悦之叹曰。儒道九流特秕糠耳。遂出家焉。安时门徒数千。远居第一座。安尝曰。使道流东国其在远乎。晋武帝甲申太元九年也。前秦国乱来游于晋。抵江西见庐山爱之。乃止江州龙泉精舍。次寓慧永之西林寺。复于山东建东林寺。经营之际山神降灵。愿加资助信宿风雷夜作晦冥。大雨明发。就观良木殊材骈罗其处。时晋将军桓伊。初临此牧惊其神异。奏立寺焉丙戌年寺成。时晋天下奇才多隐居不仕。闻庐山远公之道。皆来从之。庚寅年师谓刘程之等曰。诸君倘有心净土之游。当加勉励。遂同发志于无量寿佛前。建斋立誓期生净土。由是僧俗凡一百二十三人。慕道同盟。栖心物外。谢灵运于东林凿二池以栽莲华。远公每送客不过虎溪。庚戌义熙六年也。道士陆修静偕陶渊明。入山见师送之执手共话不觉过虎溪。三人相顾大笑。今人图之为三笑图。渊明嗜酒入山久之。以山无酒攒眉而去之。至是乙卯岁八月初六日。远公合掌面西而逝。寿八十四岁。谢灵运制碑。社众数千人。名迹尤著者十八人焉(高僧传)</p><p>莲华漏 远公之门有僧慧要。患山中无刻漏。乃于水上立十二叶芙蕖。因波而转。以定十二时。晷景无差。今曰远公莲华漏是也</p><p>丙辰 义熙十二年泓立 永和元年西秦 永康五年西凉散嘉兴元年夏 凤翔四年北燕 太平八年北凉 元始五年魏 太常元年丁巳 义熙十三年永和二年灭永康六年嘉兴二年凤翔五年太平九年元始六年太常二年</p><p>后秦</p><p>姓姚氏。名苌。字景茂。赤亭羌人弋仲第二十四子。兄襄既战死。苌率诸弟降秦为秦将。东晋武帝大元八年。秦主符坚攻晋。以兖州刺史姚苌为龙骧将军。督益梁州诸军事。坚败。慕容垂谋复燕绪。次年三月秦北地长史慕容泓叛奔关东。秦以左将军窦冲为长史。龙骧将军姚苌为司马。讨泓。又讨平阳太守慕容冲。秦兵大败。苌惧奔渭北。马牧天水尹纬尹详南安庞演等。纠扇羌豪帅其户口归苌者五万余家。推苌为盟主。苌自称后秦王。建元白雀。丙戌(东晋大元十一年也)四月。苌自陕西凤翔庄浪路泾州入长安。即皇帝位。改元建初。国号大秦。史以后秦别之。立子兴为皇太子。置百官。癸巳建初八年十二月苌卒(晋大元十八年也)。太子兴秘不发丧。自称大将军。帅众伐秦。秦主符登大败。次年五月兴始发丧即皇帝位。年曰皇初。谥苌曰昭皇帝。己亥年(晋安帝隆安三年也)九月。兴以灾异屡见降号称王。改元弘始。丙辰弘始十八年正月兴卒。太子泓即帝位。年曰永和。晋伐秦。晋帝义熙十三年五月泓将妻子群臣降于晋。后秦三主合三十四年</p><p>戊午 晋义熙十四年十二月弑帝西秦乞伏 永康七年西凉 嘉兴三年夏 昌武元年北燕 太平十年北凉 元始七年魏 太常三年</p><p>恭帝</p><p>讳德文。字德文。安帝母弟也。封琅琊王。义熙十四年十二月。宋公刘裕矫遗诏奉王即位。在位二年。禅于宋。寿三十七岁 元熙(二)</p><p>己未 元熙元年永康八年嘉兴四年真兴元年太平七年元始八年太常四年</p><p>沙门法果。魏太宗敬之。前后授以辅国宜城子忠信侯。号曰僧统。果固辞不受。太宗幸其居。以其门巷狭小更广大之。至是己未年入灭。八十三岁。太宗三临其丧。追赠老寿将军赵胡灵公(魏书僧传)</p><p>七月宋公裕进爵为王。次年帝禅位于宋王。裕奉帝为灵陵王。后使人杀之。西东晋凡一十五帝合一百五十五年</p><p>右东晋十一主。合一百三年归于宋</p><p>南北朝宋</p><p>刘姓。都建康</p><p>高祖武皇帝 少帝 太祖文帝 武帝 废帝 太祖明帝 废帝 顺帝 八主禅于齐 高祖武帝</p><p>讳裕。字德舆。彭城人(徐州也)汉楚元王交之后。庚申年六月受晋禅。在位三年。寿六十七岁。永初(三)</p><p>庚申 宋 永初元年 六月改元西秦太祖 建始元年西凉恂 永建元年夏 真兴二年北燕 太平十二年北凉沮渠 元始九年魏 太常五年辛酉 永初二年建始二年永建二年真兴三年太平十三年元始十年太常六年壬戌 永初三年 五月帝崩少帝即位建始三年永建三年灭真兴四年太平十四年元始十一年太常七年</p><p>西凉</p><p>李暠。字玄盛。丙申年(晋武帝大元二十一年)据姑臧(今甘肃省西凉州也)。庚子年(晋安帝隆安四年)暠称元年。乙巳年(晋安帝义熙元年)西凉公暠。徙都酒泉(今甘肃省肃州路也)。年曰建初丙辰年(晋义熙十二年)凉主歆立。改元嘉兴。宋高祖永初元年。凉主李恂。永建元年。至永建三年为北凉灭之。合二十二年。暠尝手令戒诸子。以为从政者当审慎赏罚勿任爱憎。近忠正远佞谀。勿使左右窃弄威福毁誉之来。当研核真伪。听讼折狱必和颜任理。慎勿逆诈亿。勿轻视声色。务广咨询勿自专用。吾莅事五年。虽未能息民。然含垢匿瑕。朝为寇仇。夕委心膂。粗无负于新旧。事任公平。坦然无类。初不为怀有所损益。计近则如不足。经远乃为有余。庶亦无愧前人也(载记)</p><p>少帝营阳王</p><p>义符。武帝长子。居丧无礼。司空徐羡之等废而弑之。在位一年。寿十九岁 景平</p><p>癸亥 宋 景平元年西秦 建始四年夏赫连 真兴五年北燕 太平十五年北凉 元始五年魏筑长城太宗殂</p><p>魏</p><p>嵩山道士寇谦之。修张天师之术。自言。尝遇老子降。授以辟谷轻身之术及科戒二十卷。使之清整道教。谦之奉其书献于魏主。朝野未之信。左光禄大夫崔浩独师事之。从受其术。且上书赞明其事。魏主欣然。使谒者奉玉帛牲牢祭嵩岳。迎致谦之(北史)</p><p>太祖文帝</p><p>义隆。武帝第三子。封宜都王。少帝既废。徐羡之等遥奉王即位于江陵。在位三十年。寿四十七岁(帝纪) 元嘉(三十)</p><p>帝造禅灵寺供千僧(弘明集)。沙门杯渡。丙寅年九月入灭。葬建康覆舟山。渡初出冀州。阐化四十余年(高僧传)</p><p>甲子 宋 元嘉元年三十西秦 建始五年夏赫连 真兴六年北燕 太平十六年凉 元始十三年魏焘立 始光元年</p><p>八月吐谷浑威王阿柴卒。有子二十人。疾病召诸子弟谓之曰。我死汝曹当奉慕瑰为主。瑰阿柴母弟也。又命诸子各献一箭取一箭授其弟慕利延使折之。又取十九箭一束使折之不能折。阿柴谕之曰。孤则易折。众则难摧。汝曹当戮力一心。可以保国安家。言终而卒。慕瑰抚纳秦凉失业之民。部众转盛。续<a href=\"/ctwh/shi/24s/hanshu.html\" class=\"keylink\" target=\"_blank\">汉书</a>曰。阿柴羌三苗姜姓之别种也</p><p>乙丑 宋 元嘉二年西秦 建始六年夏昌 承光元年北燕 太平十七年北凉 元始十四年魏太武帝始光二年丙寅 元嘉三年建始七年承光二年太平十八年元始十五年始光三年丁卯 元嘉四年建始八年承光三年太平十九年元始十六年始光四年</p><p>靖节先生 陶元亮在晋名渊明。在宋名潜。世号靖节先生。侃之曾孙也。宅边树五柳。着五柳先生传。以自况。为彭泽县令。是年卒。寿六十三岁。居江州路德化县柴桑山近栗里。尝着搜神录载佛灵迹。有子五人。俨俟份佚佟祖茂武昌太守父姿城太守史逸其名</p><p>戊辰 宋 元嘉五年西秦篡末永弘元年夏昌 定胜元年北燕 太平二十年北凉 承玄元年魏太武帝神麚元年</p><p>西秦</p><p>乞伏国仁。鲜卑人。仕符秦。东晋武帝癸未太元八年七月。秦主坚攻晋。以国仁为前将军。会国仁叔父步颓反于陇西。坚遣国仁还讨之。国仁步颓共僭一方众至十余万。甲申年国仁据金城(陕西巩昌路兰州也)。乙酉年建国号秦(西秦)。年曰建义。己丑年西秦武元王干归。年曰太初。晋安帝己酉义熙五年。西秦年曰更始。壬子年西秦主太祖炽盘。年曰永康。宋高祖永初元年。西秦年曰建始。至是元嘉五年纂末年曰永弘。为赫连夏所灭。四主合四十五年</p><p>大夏</p><p>匈奴左贤王之后曰勃勃。丙午年(东晋安帝义熙二年也)据朔方号大夏。明年建元曰龙升。癸丑年夏主勃勃乃以吒干阿利领将作大监。发岭北夷夏十万人。筑都城于朔州(隶河东山西道西京路郡名马邑冀州域)曰朕方统一天下君临万邦。宜名新城曰统万。改年曰凤翔。勃勃自谓其祖从母姓为刘非礼也。古人氏族<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>改姓赫连氏。谓帝王系天为子。其徽赫与天连也。至宋元嘉二年(乙丑年也)昌立。年曰承光。承光三年元魏奚斤与夏平原公定相持于长安。戊辰年昌改元定胜。魏帝寿乘虚攻统万。夏主昌兵溃。昌奔上邽(音圭)。魏主入统万。获夏公卿后妃宫人以万数。马匹。牛羊数千万头。府库珍宝不可胜计。至是宋元嘉五年二月。魏平北将军尉(纡勿切)眷攻昌于上邽擒之。送昌至平城(魏都)魏主馆昌于西宫门内。器用给乘舆之副。以妹初平公主妻之赐爵会稽公。夏合二十四年国灭。赫连氏即屈丐也</p><p>己巳 元嘉六年北燕 太平二十一年北凉 承玄二年魏 神麚二年庚午 元嘉七年太平二十三年承玄三年神麚三年辛未 元嘉八年北燕弘 大雅元年北凉 义和元年神麚四年</p><p>宋帝诏促求那跋摩尊者(中印度人)赴京。至是正月至建康引对。文帝迓劳殊勤问以佛道。一日问曰。寡人常欲持斋不杀。以身应物不获所。愿师幸教之。尊者曰。道在心不在事。法由己不由人。且帝王所修与匹夫异。匹夫倘不克己苦节。何以为用。帝王以四海为家。万民为主。出一嘉言则士庶咸悦。布一善政则人神以和。刑不夭命。役不劳力。则风雨时若百谷滋繁。以此持斋。斋亦大矣。以此不杀。利亦多矣。安在辍半日之餐至一禽之命然后为弘济耶。须贻勤俭尔。帝抚几叹曰。俗迷远理。僧滞近教。如师之言可论天人之际矣。帝自是尊之为师。命居祇洹寺供给隆厚继。于寺讲法华经并十地品。帝率公卿日集座下以听法。法席之盛前此未有也(弘明集)</p><p>壬申 宋 元嘉九年北燕 大雅二年北凉 义和二年魏太武帝延和元年癸酉元嘉十年 宋谢灵运死大雅三年牧犍 承和元年延和二年甲戌元嘉十一年大雅四年承和二年延和三年乙亥元嘉十二年大雅五年承和三年太延元年丙子元嘉十三年大雅六年灭承和四年太延二年</p><p>北燕</p><p>凭跋。冀州人(燕南河北道真定路冀州郡名信都。禹贡九州之一)仕后燕。丁未年(东晋安帝义熙三年)后燕国乱。跋遂篡灭之。乃据昌黎(今平栾路郡名北平冀域)。号北燕。己酉年曰太平元年。至是宋帝元嘉八年。北燕昭帝弘立。年曰大雅。大雅六年为元魏所灭。合二十八年</p><p>丁丑 元嘉十四年北凉 承和五年魏 太延三年戊寅 元嘉十五年承和六年太延四年</p><p>宋</p><p>文帝谓其臣丹阳尹何尚之曰。适见颜延之宗炳著论。发明佛法甚为名理。并是开奖人意。若使率土之滨皆感此化。朕则垂拱坐致太平矣。夫复何事尚之因进曰。夫百家之乡。十人持五戒则十人淳谨。十室之邑。百人修十善则百人和睦。持此风教以周寰区。编户亿千则仁人百万。夫能行一善则去一恶。去一恶则息一刑。一刑息于家万刑息于国。则陛下之言坐致太平是也(帝纪何传)</p><p>己卯 元嘉十六年北凉 承和七年灭太延三年</p><p>北凉</p><p>叚蒙胡人。东晋安帝丁酉隆安元年据张掖。号北凉。称河西王。年曰神玺。己亥年改元天玺。辛丑年武宣王沮渠蒙逊立。改元永安。壬子年迁都姑臧。改年曰元始。戊辰年改元承玄。庚午年蒙逊遣贡于元魏。辛未年改元义和。壬申年元魏遣安西将军李顺使凉还。魏主问以凉事。顺曰。蒙逊经涉艰难。粗识机变。然礼者德之兴。敬者身之基也。蒙逊无礼不敬。以臣观之不复年矣。癸酉年蒙逊卒。子炖煌太守牧犍即河西王位。改元承和。牧犍虽外修臣礼。内实乖悖。己卯年三月魏主讨凉。六月魏主至姑臧。九月牧犍兄之子万年帅所领降魏。姑臧城溃。牧犍帅其文武五千人面缚请降。魏主释其缚而礼之。三主合四十三年。张掖今甘州路也。姑臧凉州也。炖煌凉州路也。并隶甘肃省。雍州之域(图经)</p><p>庚辰 宋 元嘉十七年魏世祖太武皇帝焘 大宗长子癸亥年立 太平真君元年辛巳元嘉十八年太平真君二年壬午 元嘉十九年西域献帝火浣布<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>帝时自衣之太平真君三年癸未元嘉二十年太平真君四年甲申 元嘉二十一年太子率更始令何承天撰元嘉新历太平真君五年乙酉元嘉二十二年太平真君六年毁残佛教丙戌元嘉二十三年太平真君七年丁亥元嘉二十四年太平真君八年戊子元嘉二十五年太平真君九年己丑元嘉二十六年太平真君十年庚寅元嘉二十七年太平真君十一年 族司徒崔浩等辛卯元嘉二十八年正平元年 正平二年二月太武遇弑</p><p>白足沙门 讳昙始。一曰惠始。魏书佛老志云。沙门惠始清河张氏子。始师鸠摩罗什法师。晋刘裕灭后秦。复为夏赫连屈丐追取长安。道俗被坑戮。而始接刃无伤。屈丐大怒召始于前。以佩刀自击之。又不能害。乃惧而谢罪。百姓赖始慈力。免诸酷毒。魏太武平赫连昌。白足归魏。初魏太平真君六年。太武讨盍吴之乱至长安。见僧寺有兵仗。武怒。司徒崔浩因而劝太武。尽诛沙门毁诸经像。太平真君十一年。崔浩自恃才略撰国史。书魏之先世事列于衢路。刊石立于郊坛。北人无不忿恚。太武以浩暴扬国恶大怒。使有司按浩及秘书郎吏等罪状。凡一百二十八人皆夷五族。是时白足谒太武。武怒命斩之不能伤。武自抽佩刀斩之。又不能伤。投诸虎槛。虎皆弭服。武惊延始上殿悔谢归敬。先是景穆太子为政精察。中常侍宗爱性憸恶多不法构扇太子。太子以忧卒。大武徐乃知之。追悼不已。宗爱惧诛。正平二年二月弑太武。尚书源贺陆鹿勒兵诛爱。奉皇孙浚即帝位。改元(魏书)白足跣行泥滓不染故名(高僧传)</p><p>壬辰 宋 元嘉二十九年魏高宗文成皇帝浚景穆太子之子 兴安元年</p><p>魏兴安元年。群臣多请复释氏之教。诏曰。夫为帝王者。必只奉明宪显彰仁道。其能惠着生民济益群品。虽在往古犹序其风烈。是以春秋喜崇明之礼。祭典载功施之族。况释教如来功济大千。惠流尘境。寻<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>者叹其达观。览文义者贵其妙门。助王政之禁律。益仁智之善性。排拨群邪。开演正觉。故前代已来莫不崇尚。亦我国家常所尊事。今制诸州郡县众居之所。各听建佛图。其有好乐佛法欲为沙门者听出家。大州五十人小州四十人。于是曏所毁佛图。率皆修复(魏书又僧史略)又敕有司。于五级大寺为太祖已下五帝铸铜佛像。各一丈六尺。帝亲为沙门师贤等五人下发。以师贤为道人统(魏书僧史)</p><p>癸巳 元嘉三十年二月太子劭谋逆帝殂武陵王讨劭斩之魏 兴安二年</p><p>世祖孝武帝</p><p>骏。文帝第三子。封武陵王。刺江州。三月王会兵讨元凶劭。四月王即帝位于新亭。在位十一年。寿三十五岁。帝博该学问。省读书奏七行俱下(宋书帝纪) 孝建(三)大明(八)</p><p>甲午 孝建元年 正月改元魏 兴光元年</p><p>宋分扬州浙东五郡。置东阳州治会稽。分荆湘江豫州之八郡。置郢州治江夏(宋书)</p><p>乙未 孝建二年诏沙门道猷为安镇寺法主 僧传太安元年丙甲 孝建三年太安二年</p><p>华严经释疏 释元畅。魏灭教。归宋来扬州。止明因寺。作华严经释疏传讲迄今。畅其始也(僧传)</p><p>丁酉 大明元年魏 太安三年</p><p>二十七祖般若多罗尊者 东印度人也。得法已行化至南印度。王名香至。崇奉佛乘。迎祖尊重<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。施以宝珠。王有三子。曰月净多罗。曰<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>多罗。曰<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>多罗。祖以施珠问三王子。此珠圆明有能及否。第一第二王子同曰。此珠七宝中尊固无踰也。第三王子菩提多罗曰。此是世宝未足为上。于诸宝中法宝为上。此是世光未足为上。于诸光中智光为上。此是世明未足为上。于诸明中心明为上。此珠光明不能自照。要假智光光辩于此。既辩此已即知是珠。既知是珠即知其宝。若明其宝宝不自宝。若辩其珠珠不自珠。珠不自珠者要假智珠。而辩世珠宝不自宝者。要假智宝以明法宝。然则师有其道其宝即现众生有之。心宝亦然。祖叹其辩慧。乃复问曰。于诸物中何物<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。曰于诸物中不起无相。又问于诸物中何物最高。曰于诸物中人我最高。又问于诸物中何物最大。曰于诸物中法性最大。适香至父王厌世。众皆号绝。维菩提多罗于柩前入定七日而出。遂求出家。既受具戒。祖告之曰。如来以正法眼付大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。如是展转乃至于我。戒今嘱汝。听吾偈曰。心地生诸种。因事复生理。果满菩提圆。华开世界起。祖付法已。即于座上起立。舒左右手各放光明二十七道。三色晃耀踊入<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>高七多罗树。化火自焚。空中舍利如雨。取以建塔。当此宋孝武帝之世也(正宗记)。尊者尝因东印度国王请斋。王问曰。诸人尽转经。师何不转经。尊者曰。贫道出息不随众缘。入息不居蕴界。常转如是经百千万亿卷。不但一卷两卷</p><p>戊戌 宋 大明二年魏 太安四年 禁酒犯者斩凶吉二事容酿 北史己亥大明三年太安五年庚子大明四年 路昭皇太后造普贤像成和平元年辛丑大明五年和平二年壬寅大明六年和平三年癸卯大明七年和平四年甲辰大明八年 五月庚申帝崩太子即位和平五年</p><p>废帝</p><p>宋太子讳子业。即皇帝位年十六岁。改元景和。又改永光。乙巳年十一月。主衣阮佃夫姜产之等弑帝(前废帝也)。在位一年。湘东王彧即位</p><p>太宗明帝</p><p>彧。文帝第十一子。封湘东王。寿寂之等既弑废帝。奉王即位。在位七年。寿三十四岁 泰始(七)泰豫(一)</p><p>乙巳 宋 泰始元年十一月改元即废帝永光年也魏 和平六年五月帝殂帝度僧尼三万余人兴佛教修旧寺 北史丙午 泰始二年显祖献文皇帝弘高宗长子即位年十二凭太后临朝天安元年 六月开酒禁</p><p>湘东王既即帝位。袁顗奉表劝晋安王子勋即大位。建牙于桑尾。移檄建康。至是刘琬帅将佐上尊号。晋安王子勋即皇帝位于浔阳(江州)。改元义嘉。四方贡计皆归浔阳。朝廷所保唯丹阳淮南等数郡。朝廷以建安王休仁都督征讨诸军事。沈攸之为浔阳太守。将兵讨子勋。既而刘琬为荆州前军长史。张悦诈而杀之。诸军至浔阳。斩晋安王子勋。传首建康。子勋年十一岁</p><p>宝公大士 讳宝志。世称宝公。尊之也。手足鹰爪。初建康东阳民朱氏之妇。闻儿[口*帚]鹰巢中。梯树得之。举以为子。七岁依钟山僧俭出家。专修禅观。至是显迹。以剪尺拂扇挂杖头。负之行聚落。尝遇食鲙者。从而求食。啖者遗而薄之。志即吐水中皆成活鱼。今江中回鱼是也。居多神异。至梁武帝天监十三年十二月六日入灭。寿九十三岁。梁武皇帝以金二十万易建康钟山之独龙冈葬之。建浮图五级于其上。敕王筠勒碑。葬之日车驾亲临祭奠。道俗奉祀。奇瑞显应为天下第一。凡大士所作偈句。多着<a href=\"/ctwh/shi/24s/nanshi.html\" class=\"keylink\" target=\"_blank\">南史</a>。为学者述大乘赞十篇科颂十四篇并十二时歌。盛行于世。宋太宗太平兴国七年。帝遣使致斋钟山。亲洒制文赞敬。诏曰。自今宜显尊异。赐号道林真觉菩萨(碑记)。法师昙宗入灭。宋武帝大明二年正旦谓宗曰。朕何罪劳卿忏。宗曰。舜称子违尔弼。禹曰万方有罪在予一人。陛下宁得有异。帝大悦(统纪)</p><p>丁未 泰始三年皇兴元年</p><p>魏丁未年。凭太后还政。魏主始亲国事。改元勤于为治。赏罚严明。拔清节黜贪污。魏国称治。于长安北台起永宁寺。塔七级高。三十丈。又于天宫寺作佛像。四十三尺。用铜七万斤黄金六百斤(北史帝纪)</p><p>戊申 泰始四年 帝造湘宫寺成皇兴二年己酉 泰始五年皇兴三年庚戌 宋 泰始六年魏 皇兴四年辛亥 泰始七年魏 高祖孝文皇帝宏献文长子五岁受禅位 延兴元年</p><p>魏辛亥年六月。显祖献文皇帝弘。聪慧夙成。刚毅有断。雅好黄老浮图之学。常有遗世之心。欲禅位于叔父中都大官京兆王子推。任城王云子推之弟也。对曰。父子相传其来久矣。若授旁支。恐非先帝之意。乃奉皇帝玺绶。传位于太子宏。太子生五岁。改元延兴。群臣奏曰。昔汉高祖称皇帝。尊其父为太上皇。明不统天下也。今皇帝幼冲。万机大政犹宜陛下总之。谨上尊号曰太上皇帝。徙居崇光宫。宫在北苑中。建鹿野浮图于苑中之西山。与僧居之时谈禅理(魏书帝纪)</p><p>壬子 泰豫元年 四月帝崩太子立方十岁延兴二年 上皇讨蠕蠕破之柔然也</p><p>宋明帝。尝造佛丈六金像。旦食常斋。日诵般若。爰感舍利。造弘普寺(六帖)</p><p>苍梧王</p><p>昱。明帝太子。生十岁即位。在位五年。数出游行。小有忤意。即加屠剖。一日不杀则惨然不乐。殿省忧惶食息不保。丁巳年七月戊子夜。帝令左右扬玉夫伺织女渡河。见当报我。不见将杀汝。是夕玉夫伺帝熟寝。与扬万年弑帝。寿十五岁。右卫将军萧道成以皇太后令追封昱为苍梧王。迎安成王准即皇帝位。时年九岁 元徽(五)</p><p>癸丑 元徽元年魏 延兴三年甲寅 元徽二年延兴四年</p><p>魏囚狱或积年。群臣颇言之。上皇曰。滞狱诚非善治。不犹愈于仓猝而滥乎。夫人忧苦则思善故。智者以囹圄为福堂。朕特苦之。欲其改悔而加矜恕耳(北史)</p><p>乙卯 元徽三年延兴五年丙辰 元徽四年承明元年 二月太上皇崩冯太后复临朝</p><p>魏显祖献文皇帝。云中造建明寺。四方诸寺一千余所。度僧尼七万七千人(北史并弘明集)</p><p>顺帝</p><p>准。字仲谋。明帝第三子。封安成王。即位年九岁。以萧道成为司空录尚书事。在位三年。寿十二 升明(三)</p><p>丁巳 宋 升明元年 元徽五年也七月改升明魏 太和元年戊午升明二年太和二年</p><p>升明二年。右长史王俭知萧道成意。乃唱议使中书舍人虞整作诏。进道成假黄钺大都督中外诸军事太傅领扬州牧</p><p>已未年三月。以太傅萧道成为相国。总百揆封十郡为齐公。加九锡。四户进爵为王。诏禅位于齐王。帝不肯出宫。王敬则勒兵殿庭。以版舆入迎帝。帝泣而禅。誓曰。愿后身世世勿复生天王家。宫中大哭。帝乘画轮车出就东邸。司空褚渊等奉玺绶诣斋宫。劝进齐王即皇帝位于南郊。奉宋顺帝为汝阴王。筑宫丹阳置兵守卫。卫士杀王以疾闻</p><p>右宋八主合五十九年禅于齐</p><p>齐(萧姓都建康)</p><p>太祖高皇帝 武帝 郁林王 海陵王</p><p page margintb15></p></div>"
},{
    "title": "释氏稽古略 第三卷",
    "author": "觉岸大师",
    "html": "<div class=\"B1_text\"><p>释氏稽古略 第三卷</p><p>乌程职里宝相<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>释 觉岸 宝洲(编集再治)</p><p>唐</p><p>李姓。以土德。都长安。玄宗改长安曰京兆府。至肃宗改曰上都</p><p>高祖 太宗 高宗 则天 中宗 睿宗 玄宗 肃宗 代宗 德宗 顺宗 宪宗 穆宗 敬宗 文宗 武宗 宣宗 懿宗 僖宗 昭宗 景宗曰哀宗 濮王 朱全忠立之。又鸩之。在位一年。曰天寿元年。本纪不载濮王一年事</p><p>高祖</p><p>讳渊。字叔德。陇西成纪人。其祖虎与李弼等八人佐西魏。皆为上柱国。周闵帝受西魏禅。追封唐国公。虎生昉。昉生渊。皆袭封唐公。渊仕隋。至炀帝大业九年。帝以卫尉少卿李渊为弘化郡留守。关右十三郡皆受征发。十二年正月。诏以右骁卫将军唐公李渊为大原留守。十三年十一月。李渊克长安立恭帝。戊寅年三月。隋恭帝诏唐王。置丞相以下官。加九锡。隋炀帝江都凶问至长安。五月恭帝禅位于唐。唐玉即皇帝位。在位九年。寿七十岁武德(九)</p><p>戊寅。武德元年五月改元 罢郡置州。以太守为刺史</p><p>五月。帝于朱雀门南衢建道场。设无遮大会。六月命僧道各六十九人。太极殿七日行道。散日设千僧斋供(辩正录)</p><p>八月。金城薛举卒。太子仁杲立。唐秦王世民以兵围之。仁杲出降。薛氏灭</p><p>九月。李密降于唐。初密据山东之地国号魏。至十二月复叛去。熊州行军总管盛彦师邀击之。斩密及正伯当</p><p>燕高开道据渔阳郑 王世充夏窦建德称王 五凤元凉李轨 安集二年梁萧铣称帝秦薛仁杲定扬可汗天兴二年吴梁梁氏 二年楚朱氏</p><p>己卯武德二年</p><p>燕郑 开明元年夏 五凤二年凉 唐灭之梁萧氏秦仁杲 唐灭之定扬 吴兴三年吴 明政元年梁 三年楚</p><p>庚辰武德三年</p><p>燕高氏郑王世充开明二年夏 五凤二年梁萧铣定扬可汗 唐灭之吴杜伏成 元年梁梁氏 永隆四年楚朱氏</p><p>帝造灵仙寺。敕庶子李百药撰碑。敕造佥昌胜业慈悲<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>四大集仙尼寺。书经造像。舍晋阳旧第为兴圣寺。并州造义兴寺。为太祖元皇帝元贞皇太后造栴檀像三躯。于慈悲寺制十大德。统举僧尼(辨正录)</p><p>辛巳。武德四年 行开元通宝钱。学士欧阳询撰文并书。其文回环可读也</p><p>燕郑 唐灭之夏 唐灭之梁 唐灭之汉东王 刘黑闼吴杜氏 二年梁楚</p><p>六月。太史令傅奕上废<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>事十一条。法师法琳对诏论之。奕状遂寝(辨正录)</p><p>壬午武德五年</p><p>燕汉 天造元年吴 三年梁楚 张善安</p><p>癸未。武德六年</p><p>燕汉 唐灭之吴 四年梁 唐灭之楚 唐灭之</p><p>甲申。武德七年</p><p>燕 唐灭之吴 唐灭之</p><p>武德七年二月。改大总管为大都督府。三月初定令以太尉司徒司空为三公。次<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>门下中书秘书殿中内侍为六省。次御史台次太常至太府为九寺。次将作监次国子学次天策上将府次左右卫至左右领卫为十四卫。东宫置三师三少詹事及两坊三寺于率府。王公置府佐国官。公主置邑司。并为京职事官。州县镇戍为外职事官。自开府仪同三司至将仕郎二十八阶为文散官。骠骑大将军至陪戎副尉三十一阶为武散官。上柱国至武骑尉十二等为勋官。四月庚子朔颁新律令。比隋开皇旧制增新格五十三条。初定均田租庸调法。凡民赀业分九等。百户为里。五里为乡。四家为邻。四邻为保。在城邑者为坊。田野者为村。食禄之家无得与民争利。工商杂类无预士伍。男女始生为黄。四岁为小。十六为中。二十为丁。六十为老。岁造计帐。三年造户籍(唐书)</p><p>乙酉武德八年二月。帝释奠于国学。置三座拟叙三宗。召三教学者云集。释慧乘高张义网辩论。王臣悦服。举朝属目</p><p>丙戌武德九年二月。太史令傅奕构道士李仲卿上十异九迷论贬量佛圣。前后凡七上疏以毁教。宰相萧瑀庭斥傅奕。四月帝以奕疏颁示诸僧。有法师释明概。作决破傅奕谤佛毁僧事八条。法师法琳着十喻九箴。破李仲卿十异九迷之说。门下典仪李师政着内德论三篇。盛陈佛化之益。五月诏下兼汰二教之滥者(唐书旧史)</p><p>六月四日。秦王世民以府兵平内难。帝以秦王为皇太子。大赦。停前沙汰二教。诏八月帝逊位太子。太子即皇帝位于东宫显德殿。高祖称太上皇帝(本纪)</p><p>太宗文皇帝</p><p>讳世民。高祖第二子。在位二十三年。寿五十二 贞观(二十三)</p><p>丁亥贞观元年春正月。帝命京城僧尼。并各于当寺七日行道。斋供所须有司准给。散斋之日。总就大兴善寺<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>(辨正录)</p><p>帝谓傅奕曰。佛道徼妙。圣迹可师。且<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>显然。屡行征验。卿独不悟其理何也。奕对忤旨。帝恶之。自是终身不齿(唐旧史)</p><p>断屠置寺 帝是年舍终南山太和旧宫。为高祖置龙田寺。后为翠微寺。帝以释明瞻善识治方。诏入内殿赐斋。对诏广陈帝王制御之术。叙释门慈救为宗。帝大悦。因下敕年三月六日普断屠杀。于行阵之所皆置佛寺(辨正录)</p><p>戊子二年三月。帝追念初平天下诛戮多人。乃以御服施诸寺僧忏礼荐度。诏曰。自隋末创义心存拯溺。北征东伐凡所伤殪难可胜纪。手所诛剪将近一千。切以如来圣教深尚仁慈。禁戒之科杀害为重。受命有司京城诸寺。为建斋行道七日七夜。竭诚礼忏。所有衣服并用檀舍。冀三涂之难因斯<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。万劫之苦藉此弘济(唐史)。九月帝诏曰。今百谷资茂。万宝将成。犹恐风雨失时。子养无寄。敢藉聪明外慈多祉。宜为溥天亿兆。仰祈加祐。可于京城及天下诸州寺观僧尼道士等七日七夜转经行道。每年正月七月例皆准此(辨正录)</p><p><a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a> 法师玄琬。是年帝诏入宫。为妃嫔及皇太子诸王等授<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>。琬入灭于贞观十年十二月。遗表曰。圣帝明王恭敬<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>或者犯法不应与民同科。乞付所属以僧律治之。并上安养论<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>论。帝嘉纳之。有诏伤悼。遣太子临吊。敕有司给葬具。唐敕葬沙门由琬始也。仍于葬所建佛塔一区。敕庶子李伯药撰碑(高僧传)</p><p>已丑三年正月。帝敕京城僧尼于当寺每月二七日行道。转仁王大云等经以为常式(辨正录) 三月诏大兴善寺创开传译。沙门玄谟等译语。崛多律师证译。法琳慧月等执笔承旨。慧乘等证义。敕仆射房玄龄给事杜正伦尚书李孝恭参助诠定。光禄大夫太府卿萧璟总知监护。百司供给(释教录) 六月诏密州明净禅师入京祈雨。有旨度僧三百人(统纪) 诏以通义宫皇家旧宅宜为尼寺。兴圣为名(弘明集) 十一月敕胜光寺主僧珍。就宫迎释迦佛菩萨圣僧金刚绣像。供养于胜光寺。六年正月。命诸寺大德四十九人三七日行道。庆诸绣像散日斋供千僧。王公行香(辨正录)</p><p>建寺 闰十二月。帝念隋氏以来幽魂滞魄。诏曰。有隋失道。九服沸腾。朕亲总元戎致兹明罚。切恐九泉之下尚沦鼎镬。八难之间永缠冰炭。所以树立<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>济其魂魄。可于建义以来交兵之处。为义士凶徒殒身灭阵者各建寺刹。招延胜侣。望法鼓所震变炎火于青莲。清梵所闻易<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>于<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。所司量定处所并立寺宇。具为事条。以闻称朕矜哀之意(旧史) 次年壁垒咸置伽蓝。破薛举幽州立昭仁寺。破王世充洛州立昭觉寺。破刘武周汾州立弘济寺。破宋金刚晋州立慈云寺。破霍老生吕州立普济寺。破窦建德郑州立等慈寺。破刘黑闼洛州立昭福寺。敕虞世南李伯药褚遂良颜师古岑文本许敬宗朱子奢分撰新寺碑志。贞观二十年帝征辽回。为阵亡荐度。幽州创闵忠阁寺(大典录)。庚寅。帝谓常服未有差等。八月诏自今三品以上服紫。四品五品服绯。六品七品服绿。八品服青。妇人从其夫色(唐书)</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>玄奘法师 贞观三年冬往西域。取未至<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。诣阙陈表。帝不允。师私遁自原州出玉关。抵高昌叶护等国而去。贞观七年至中印度。遇大乘<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>受瑜伽师地。入王舍城。止那兰陀寺。从上方戒贤论师受瑜伽<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>宗旨。留十年。归自王舍城。贞观十九年正月丙子至京师。长安留守房玄龄表闻。壬辰法师如洛阳(东都也)三月己亥见于仪鸾殿。帝曰。师去何不相报。曰当去时表三上不蒙谅许。乃辄私行。帝曰。师能委命求法惠利苍生。朕甚嘉焉。师因奏西域所护梵本经论六百五十七部。乞就洛阳嵩山少林寺为国宣译。帝曰。朕顷为穆太后创弘福寺。可就彼翻译。敕平章房玄龄专知监护。资备所须一从天府。贞观二十二年六月。帝制法师新译经大唐三藏圣教序。时皇太子治睹圣序遂撰述圣记。诏皇太子撰菩萨藏经后序。八月帝赐法师百金磨衲并宝剃刀。法师奉表谢。略曰。忍辱之服彩合流霞。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>之刀铦逾切玉。谨当衣以降<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>之魔。佩以断尘劳之网。高宗永徽三年。法师于慈恩寺将建大塔奉安西取经论梵本。表奏。敕赐大内及东宫掖庭等七宫亡人衣物助师营办。法师授以西域制度。塔成高二百尺。显庆四年十月制以玉华宫为寺。追崇先帝诏法师居之。次年师于玉华译<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经。麟德元年二月。法师命<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>大乘光抄录所译经论凡七十五部一千三百三十五卷。又召门人造像设斋与众辞决。令左右念<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>如来。初五日中夜右胁安卧而逝。寿六十五。帝辍朝三日。敕敛以金棺银椁。四月塔于浐东原。弟子神泰栖元会隐慧立明浚义褒大乘光皆法门龙象。法师以西域戒贤论师处所得瑜伽师地唯识宗旨授窥基(本传)</p><p>牛头山 法融禅师。润州延陵人也。姓韦氏。年十九学通经史。寻阅大部般若晓达真空。忽一日叹曰。儒道世典非究竟法。般若正观出世舟航。遂隐茅山。投师落发。后入建康牛头山幽栖寺北岩之石室宴坐观心。有百鸟献华之异。虎狼围所居。四祖摄度之(传灯录)</p><p>辛卯五年。帝为穆太后于庆善宫造慈德寺。及于昭陵立瑶台寺。敕法师玄琬。于苑内德业寺为皇后写佛藏经。又于延兴寺更造藏经。并委琬监护。壬辰六年。诏以太原旧第为天宫寺。追奉穆太后。于台城西真安城内为穆太后又造寺。亦名弘福(辨正录) 癸巳七年敕禁堰寨取鱼者。并断屠杀。度僧尼三千人(辨正录)</p><p>贞观九年四月。太上皇崩。十一月诏曰。三乘结辙济度为先。八正归依慈悲为主。流智慧之海膏泽群生。剪烦恼之林津梁品物。任真体道理协至仁。妙果胜因事符积善。朕钦若金轮恭膺宝命。至德之训无远不思。大圣之规无幽不察。欲使人免盖缠家臻仁寿。比缘丧乱僧徒减少。华台宝塔窥户无人。绀发青莲栉风沐雨。眷言凋毁良用怃然。其天下诸州有寺之处。宜度僧尼数以三千为限。其州有大小。地有华夷。当处所度多少。有司详定务取德业精明。其往因减省<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>。及私度白衣之徒。若行业可称通在取限。必无人可取亦任其阙数比闻多有僧徒溺于流俗。或假托鬼神妄传妖怪。或谬称医巫左道求利。或灼钻肤体骇俗惊愚。或造诣官曹嘱致赃贿。凡此等类大亏圣教。朕情在护持。必无宽贷。自今宜令所司依附内律参以金科明为条制(唐书旧史)</p><p>丙甲贞观十年。皇太子承干问张士衡曰。事佛营福其应如何。对曰。事佛在清净仁恕。如贪惏(力南反)骄虐。虽倾财事之无损于祸。且<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>必报若影赴形。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之言备矣。为君明。为臣忠。为子孝。则福祚永。反是则祸至矣。士衡以此言矫太子心。太子承干终于失德。贞观十七年废承干为庶人。立晋王治为皇太子</p><p>氏族志 贞观十二年正月。吏部尚书高士廉黄门侍郎韦挺礼部侍郎令(卢丁反)狐德棻中书侍郎岑文本撰氏族志成。以黄门侍郎崔民干为第一。帝不允。乃更命刊定。专以今朝品秩为高下。于是以皇族为首。外戚次之。降崔民干第三凡二百九十三姓。千六百五十一家。颁于天下(唐书)</p><p>杜顺和尚 名法顺。生壅州杜氏。少时隋文帝敬重给月俸供之。至是帝素敬重。常引入宫奉之如佛。顺集华严法界观。弟子智俨传其教。贞观十四年五月顺示寂(本传)</p><p>壬寅贞观十六年五月。帝为太穆皇后追福于弘福寺。手疏愿文曰。圣哲之所尚者孝也。仁人之所爱者亲也。朕幼荷鞠育之恩。长蒙教养之训。蓼莪之念何日云忘。罔极之情昊天匪报。兴言永慕但切深哀。欲报靡因唯凭冥助。敬以绢二百疋奉慈悲大教。倘至诚有感。冀消过往之愆为善有因。庶获后缘之庆(弘明集)。又敕为穆太后写佛<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>。敕选法师十人挍正</p><p>癸卯贞观十七年二月。帝问谏议大夫褚遂良曰。舜造漆器谏者十余人。此何足谏。对曰。奢侈者危亡之本。漆器不已。将以金玉为之。忠臣爱君必防其渐。若祸乱已成无所复谏矣。帝曰。然朕有过。卿亦当谏其渐。帝曰。人主唯有一心。而攻之者甚众。或以勇力。或以辩口。或以謟谀或以奸诈。或以嗜欲。辐辏攻之。各求自售以取宠禄。人主少懈而受其一则危亡随之。此其所以难也(帝纪)</p><p>凌烟阁 帝命图画功臣赵公长孙无忌赵郡元王李孝恭莱成公杜如晦郑文贞公魏征梁公房玄龄申公高士廉鄂公尉迟敬德卫公李靖宋公萧瑀褒忠壮公段志玄夔公刘弘基蒋忠公屈突通郧节公殷开山谯襄公柴绍邳襄公长孙顺德郧公张亮陈公侯君集郯襄公张公谨庐程知节永兴文懿公虞世南渝襄公刘政会莒公唐俭英公李世绩胡壮公秦叔宝于凌烟阁(忠义传)</p><p>丰干禅师寒山拾得 丰干垂迹天台山国清寺。庵于藏殿西北隅。乘一虎游松径。见一子可年十岁。扣之无家无姓。师引之归寺养于厨所。号曰拾得。有一贫士。从寒岩来。曰寒山子。三人相得欢甚。是年丰干云游。适闾丘胤来守台州。俄患头风。丰干至其家。自谓善疗其疾。闾丘见之。师持净水洒之即愈。问所从来。曰天台国清。曰彼有贤达否。干曰。寒山文殊拾得普贤宜就见之。闾丘见之。三日到寺访丰干遗迹。谒二大士。闾丘拜之。二士走曰。丰干饶舌弥陀。不识礼我何为。遁入岩穴。其穴自合。寒拾有诗散题山林间。寺僧集之成卷。版行于世(国清寺记碑刻)</p><p>遗教经 贞观十八年。帝敕曰。如来灭度以末代浇浮付嘱国王大臣护持佛法。然僧尼<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>戒行须备。若纵情放逸触途烦恼。关涉人间动违经律。既失如来玄妙之旨。又亏国王受付之义。遗教经是佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>所说。戒勒弟子甚为详要。末俗缁素并不崇奉。大道将隐微言且绝。永怀圣教用思弘阐。宜令所司差书手十人。多写经本务尽施行。其京官五品以上及诸州刺史各付一卷。若见僧尼业行与经文不同。宜公私劝勉必使遵行(见唐书旧史并文馆辞林)</p><p>十九年二月。帝自将伐高丽不克。九月班师。二十年三月车驾至长安。释智则者止辩才寺。房居萧然众呼为狂者。智则曰。道他狂者不知自狂。出家离俗只贪衣食。行住遮障锁门锁柜。种种聚敛役役不安。此而非狂更无狂者。乃抚掌大笑遽然而去(僧传)</p><p>风泾高王 释法聪<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>于浙西之苏杭嘉兴县。有神曰高王。降其祝曰。为我请聪法师来。受菩萨戒。居人依其言而请之戒讫。又降祝曰。自今以往酒肉五辛一切悉断。后若祈福可请僧众在庙设斋行道。历二年。秀州海盐县神曰。鄱阳府君因常祭降祝曰。为我请聪法师讲<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。众乃迎师就讲。神又降祝曰。神道<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>多有苦恼。自听法来身鳞甲内已息细虫啖苦。愿为我请师更讲大品。师复为讲之。神降祝谢(高僧传)</p><p>贞观二十二年。帝自伐辽而还气力不逮。乃留神大教。八月问玄奘法师曰。欲植法门之益。何所宜先。奘曰。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>寝惑非慧莫启。慧芽抽植法为之资。弘法须人度僧为最。帝曰。赐奘磨衲衣并宝力。奘表谢具前本传下。九月乙卯诏曰。隋季失御。天下分崩。四海涂炭。八埏鼎沸。朕属当戡乱亲履兵锋。亟犯风霜宿于马上。顷加药饵犹未痊除。比日以来方遂平复。岂非福善之致耶。京城及天下诸州寺各度僧五人。时天下寺三千七百余所。度僧凡一万七千余人(唐旧史)</p><p>皇太子治居春宫。适天时阴晦体倦凄感。追念母仪昊天罔极。慈恩无际。遂鸠材择地创大慈恩寺。为文德皇后追崇冥福。至是十二月成。又建浮图。诏选京城宿望五十大德。各度侍者六人居新寺。是月丙辰太子备宝车五十乘迎诸大德。并彩亭宝刹数百具。奉安新得梵夹诸经及瑞像<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>等。敕太常九部乐及长安万年音乐京城诸寺华幡导引入寺。帝御安福门楼执罏致敬。经像过尽始罢。皇情大悦。高宗既即位。亲制大慈恩寺碑(唐典)</p><p>己酉贞观二十三年。夏四月。帝有疾。五月崩。六月大子即位。八月葬文皇帝于昭陵。庙号太宗(本纪)</p><p>高宗</p><p>治。字为善。太宗第九子。初封晋王。在位三十四年。寿五十六岁 永徽(六)显庆(五)龙朔(三)麟德(二)干封(二)总章(二)咸亨(四)上元(二)仪凤(三)调露(元)永隆(一)开耀(一)永淳(一)弘道(一)</p><p>庚戌永徽元年辛亥二年</p><p>四祖道信大师尊者 姓司马氏。世居河内。徙居蕲州广济县。今淮西也。生而超异。幼慕空宗诸解脱门。宛如宿习。既嗣祖位。胁不致席仅六十年。唐高祖武德七年住蕲之破头山。今双峰山也。贞观中太宗闻其风三诏。尊者不起。又诏之。帝谓使臣曰。今复不从吾命即取首来。使道上意。师引颈待刃。使者还奏之。帝嘉叹慰谕甚厚。至是尊者居山已二十载矣。一日往黄梅县。路逢一小儿。可七岁许。问之曰。汝何姓。儿曰姓即有非常姓。祖曰。是何姓。儿曰是<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。祖曰。汝无姓耶。儿曰姓空故无。祖默识其<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。令侍者至其母所。乞令出家。母以其宿缘故遂舍之。祖为剃度名弘忍。其后乃命曰。昔如来传<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>眼转至于我。我今付汝并于衣钵。听吾偈。曰。华种有生性。因地花生生大缘与信合。当生生不生。至是永徽二年闰九月四日。诫门人曰。一切诸法悉皆解脱。汝等各各护念流化未来。言讫安坐而逝。寿七十二。塔于本山。明年四月八日塔户自开。仪相如生。代宗大历中谥曰大毉禅师。塔曰慈云(正宗记)。尊者尝至建康牛头山。摄融禅师列派曰旁出</p><p>甲寅永徽五年。帝特旨度<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>窥基为大僧。入大慈恩寺。参译经正义。基鄂忠武公尉迟敬德犹子也。居长安。初玄奘法师就其父求之出家。基每览疏记过目成诵。义亦顿解善大小乘。从奘师受瑜伽唯识宗旨。著论凡百部。时号百本论师。性豪侈每出必治三车。经书食馔。时呼之曰三车法师。永淳元年入灭。寿五十一。有诏伤悼。御制画像赞。敕葬樊川北渠。近奘法师之茔。京兆终南山宣律师持律精严感天厨供养。每薄基三车之玩。基访律师。日过午天馔不至。基辞去天乃来。律师责以后时。天曰。适大乘菩萨在此。翊卫严甚故无自而入。律师闻之大惊。于是遐迩增敬。基公启宗曰慈恩(本传)</p><p>慈恩教 初<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国无著大士。频升知足天宫。咨参慈氏唯识宗旨。及其弟天亲菩萨生西度罗阅国。发明大乘。遂相与制论。天竺代有圣贤出弘其教。至正法藏戒贤论师。西天中印度人。年一百有三岁。居王舍城国之那兰陀寺。会三藏玄奘至。贤遂以瑜伽师地唯识宗旨授。奘东归。奘以授窥基。基乃网罗旧说广制疏论。学者宗之。谓之三车<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>显理宗慈恩教</p><p>乙卯永徽六年十月。帝命司空李绩赍玺绶。册宸妃武氏为皇后。废王皇后。初贞观二年。太宗召荆州都督武士[获-禾+(寻-口+几)](郁缚反)女入后宫为才人。时年十四。太史奏有女主之兆出之。于感业寺为尼。永徽五年帝召之入宫为昭仪。今册为皇后</p><p>丙辰显庆元年。五月。敕天下僧尼有犯国法者。以僧律治之。不得与民同科。十一月天后生子。号曰<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>王。即中宗也。十二月五日为佛光王度僧七人。仍请玄奘法师。为佛光王剃发为出家(唐书旧史)</p><p>千岁宝掌和尚 西竺中印度人也。生而拳左手。七岁祝发乃展。因名宝掌。东汉献帝建安二十四年来至此土。魏晋间东逝。西入蜀礼普贤。留大慈日诵般若等经。有咏之者曰。劳劳玉齿寒。似迸寒泉急。有时中夜坐。阶前鬼神泣。一日谓众曰。吾有愿住世千岁。故以千岁称之。次游五台。徙居祝融峰之华严.黄梅之双峰.庐山之东林。寻抵建康会达磨入梁。掌就扣其旨而有悟。武帝高其道腊。延之内庭。未几如吴。有偈曰。梁城遇导师。<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>了心地。飘零二浙游。更尽佳山水。顺流东下。由千顷至天竺。往鄮峰登太白。穿雁宕盘礴于翠峰七十二庵。[竺-二+面]赤城憩云门法华诸暨渔浦赤符大岩。太宗贞观十五年。返杭之飞来峰栖止之。今中天竺寺也。有行尽支那四百州此中偏称道人游之句。后居浦江之宝岩。至是丁巳显庆二年正旦。手塑一像九日像成。问其徒慧云曰。肖谁。云曰与和尚无异。即沐浴趺坐谓云曰。吾住世已□千七十二年。今谢世。听吾偈曰。本来无<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。今亦示生死。我得去住心。他生复来此。言讫而逝。后五十四年。刺浮长老自云门至塔所。礼曰。冀塔户开少选塔户果启其骨连环若黄金。浮即持往秦望山建塔焉。玄宗开元中。慧云门人宗一者。尝勒石识其行实云(传灯录)</p><p>戊午显庆三年六月十二日。帝创西明寺成。十三日帝出绣像长幡送寺次奉。寻召僧道各七人入百福殿。共谈名理以相启沃。复各赐坐论议。全文备载南山宣律师论衡。七月诏迎玄奘法师入居西明寺。四年十月。帝以玉华宫为寺。追崇先帝。诏奘法师居之。五年帝幸东都。敕召僧义褒慧立等赴洛京。见帝于合壁殿。叙论称旨。留住东都<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>寺(僧传)</p><p>辛酉龙朔元年九月。帝幸高祖旧第天宫寺。设斋<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>(方志)</p><p>释彦悰撰大唐京寺录传十卷。铺述三宝灵迹焉(弘明集)</p><p>明解 长安普光寺僧明解者。姓姚氏。性聪敏。琴诗书画为时独绝。每欣俗网不乐道门。殢酒荒情。显庆三年帝造西明寺成。敕灵润法师择人居之。时有僚采数人。共荐明解。润法师曰。公等宜求<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>学增长福田。何乃酒客画师以当洪寄。官采愧退。明解怀憾。俄而帝征四科。不问道俗。明解应诏。自举射策升第。喜不自胜。遂乃归俗颇有余言。未几染疾。见数十人执猛炬迎解。明解大怖言未终而卒。是年八月也。后托梦于相州净土寺僧智整曰。明解宿无福业。不遵内教。今受大罪非常饥乏。傥有故人之情。颇能惠一餐否。智整许诺。及寤遂为设食。至夜才卧。即见明解来愧谢之。逾二年。又托梦于画工张生曰。我以不信佛法。今大受苦痛。努力为我写三二卷经。执手殷勤。赋诗言别。教画工读十八遍令记之。寤乃忆其诗曰。握手不能别。抚膺还自伤。痛矣时阴短。悲哉泉路长。松林惊野吹。荒隧落寒霜。言离何以赠。留心内典章。其画工素不识字。乃倩人录之示明解知友。皆曰。是明解文体不惑。见闻者莫不测然哀感(见法苑珠林并冥报录)</p><p>壬戌龙朔二年。二月改百官名。以门下省为东台。中书省为西台。尚书省为中台。侍中为左相。中书令为右相。仆射为匡正。左右丞为肃机。尚书为大常伯。侍郎为少常伯。其余二十四司御史台九寺七监十六卫。并以义训更其名。职任如故(唐书)</p><p>并州大像 并州是太原路。今改冀宁路。帝及后初幸并州童子寺。大像高十七丈。七月遣使送<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>于像。像放光明。帝悦(法苑珠林)</p><p>善导和尚 入京化人修净士业。念阿弥陀佛。说法光明寺。是年入灭</p><p>泗洲僧伽大士 初自碎叶国游于西凉。是年显化洛阳。或问师何姓。士曰姓何。曰何国人。士曰何国人。则天万岁通天元年。诏番僧有乐住者。所在配住。时大士不欲异凡。乃隶名楚州(今淮安路)龙兴寺。澹如也或宴坐于深房。或振锡于长路。中宗景龙二年。诏大士自准寺入宫。帝称第子。三台问法。百辟归心。馆于荐福寺。在京数月。天时忽大早。帝请大士内殿祈雨。甘泽随沾。帝为度慧俨慧岸木叉三人为侍者。帝为书大士所居寺额。曰普光王。先送归淮。睿宗景云元年三月。大士示寂。寿八十三。敕奉全身归泗洲普光王寺。塑身建塔。帝问圣士万回曰。僧伽何如人。回曰观音大士<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>耳。大士初三十年在于本国。五十三年行化此方。显应度缘凡二十七处。神迹灵异人共瞻仰。殿宇塔庙在处供养(本传碑志)</p><p>乙丑麟德二年。益州法聚寺有张僧繇所画地藏菩萨像。至是七月寺僧传本放光。展转图者悉放光明(大藏法苑珠林)</p><p>九世同居 麟德二年十月。车驾幸东都(洛阳也)。祀昊天上帝于泰山。十一月至筹张。幸张公艺宅。公蓻九世同居。北齐隋唐皆旌表其门。帝问所以共居之故。公蓻书忍字百余以进。帝善之乃赐以缣帛(唐书)。寿张隶大原。今冀宁路也</p><p>终南山宣律师 丁卯干封二年十月初三日。律师入灭于长安西明寺。律师讳道宣。生京兆钱氏。父吏部尚书申。母梦月轮贯怀而孕。又梦梵僧语之曰。所孕者梁之祐律师也。及长出家以律自持。感天送馔侍卫。暮年以戒坛未合律躬白负土准律新之。律师行道中夜临砌蹶且仆。有少年介胄拥卫之。律师问汝为谁。曰弟子博叉天王子张琼也。以师戒德故来给卫耳。律师问以<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在世及灭度时事。琼一一为言之。及别授律师以佛牙饵药修合之方。今市肆天王补心圆是也。忏筵行人日用之。天神降灵不一传流问答。律师集之。题曰感天侍应传。律师撰内典录三宝<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>录.佛道论衡.释迦谱.四分羯磨.续高僧传.广弘明集.八部八十一卷。并行于世。律师示寂。高宗有诏伤悼。敕天下寺图形塑像。以为标范奉祀。穆宗制赞曰。代有觉人。为如来使。龙魔归降。岳神奉事。声飞五天。辞惊万古。金乌西沈。佛日东举。稽首归依。肇<a href=\"/remen/lvzong.html\" class=\"keylink\" target=\"_blank\">律宗</a>主。懿宗咸通十一年。谥号曰澄照律师(本传)</p><p>南山教 始自优婆离尊者。于世尊灭后。集四部众结集毗尼藏。优婆离口诵圣言十番。众证无差。然后宣布。三国魏邵陵厉公嘉平二年。西竺沙门昙柯罗至洛阳。始出僧祇戒本。东晋安帝义熙三年。天竺沙门<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>耶舍尊者以十诵律来。自是中夏<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>始备。拓跋魏聪律师等世禀传之。至是宣律师持守奉谨。诸天送食护卫。弘其仪度<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>。遂赫奕天下。谓之行事防非止恶宗</p><p>弘道之师。中印度优婆离尊者。南天竺昙柯罗尊者。中印度佛陀耶舍尊者。聪律师。光统律师。云晖愿律师。乐洪云律师。隋洪遵律师。文帝师之。智首律师。南山宣律师。文纲律师唐光州人。道岸律师中宗尊之。图形林光宫。御制赞语见景龙三年。太亮律师昙一律师南阳张氏唐道澄律师。德宗赐号曰大圆律师。慧钦律师洪州徐氏</p><p>戊辰总章元年 己巳二年</p><p>庚午咸享元年 辛未二年</p><p>水陆仪文 咸享二年三月。长安法海寺英禅师有异人来谒曰。弟子知有水陆斋。可以利益幽冥。自梁武殁后。因循不行。今大觉寺有吴僧义济。藏此仪文。愿师往求。以来月十五于山北寺<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>修设。苟释狴牢敢不知报。英寻诣义济果得仪文。即以所期日山北寺如法修设。次日曛暮向者。异人与十数辈来谢曰。弟子秦庄襄王也。指其徒曰。此范睢。此穰侯。此白起。此王剪。此张仪。此陈轸。皆秦臣也。各坐本罪幽囚阴府。大夜冥冥无能救护。昔梁武帝于金山寺设此斋。时前代纣王之臣皆免所苦。弟子尔时亦暂息苦。然以狱情未决不得出离。今蒙吾师设斋。弟子与此徒辈并列国诸侯众等。皆乘善力将生人间。虑世异国殊故此来谢。言讫遂灭。自是仪文布行天下。作大利益([(厂-一)*臣*责]禅师苇江集)</p><p>万回法云公 太宗贞观六年五月五日。生虢州阌乡张氏。至是咸享四年帝度之为沙门。回幼时致兄书六千里外。朝往暮回。因号万回。则天垂拱四年。太后延回入宫。赐以锦衣。令宫女给侍。长安二年回所至显化。玄宗在藩邸。尝私谒回。回抚其背曰。五十年太平天子可自爱。中宗神龙二年。赐回号法云公。睿宗景云二年十月。诏回入宫馆于集贤院。给二美人奉事之。十二月忽求阌乡河水。左右不可得。回曰穴堂前地可得也。回饮水毕湛然而逝。寿八十岁。赐司徒虢国公。敕图形集贤院(本传)</p><p>甲戌上元元年。帝称天皇。后称天后。秋八月敕文武官。三品以上服紫金玉带。四品服深绯金带。五品服浅绯金带。六品服深绿。七品服浅绿并银带。八品服深青。九品服浅青并[石*俞]石带。庶人服黄铜铁带。自非庶人不听服黄(唐者车服志)</p><p>五祖弘忍大师尊者 蕲川黄梅县人也。先为破头山栽松道者。尝请于四祖曰。法道可得闻乎。祖曰。汝已老。脱有闻其能广化邪。傥若再来吾尚可迟汝。道者去行水边。见一女子浣衣揖曰。寄宿得否。女曰。我有父兄可往求之。道者曰。诺。我则敢往求。女首肯之。道者回策归山而化。其女周氏季子辍孕。父母大恶逐之。女无所归。日庸纺里中夕止众馆下。已而生一子。以为不祥。抛浊港中。明日溯流而上。大惊遂举之。成童随母乞食。里中逢一智者。叹曰。此儿缺七种相不逮如来。后遇四祖得度。受其传法。嗣化于破头山。至是咸亨二年有一居士卢慧能者。自新州来参祖。问曰。何来。卢曰岭南。祖曰。欲须何事。曰唯求作佛。祖曰。岭南人无佛性若为得佛。曰人有南北。佛性岂然。祖呵曰。着槽厂去。卢礼而退。便入碓坊。服劳杵臼间经余八月。祖知付授时至。令众各随意见以述一偈。时会下七百余僧。上座神秀者学通内外众所尊仰。咸推称曰。若非尊秀畴敢当之。神秀闻誉书一偈于廊壁曰。身是<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树。心如明镜台。时时勤拂拭。莫使惹尘埃。祖见之赞叹曰。依此<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>亦得胜果。卢闻之乃曰。美则美矣。了则未了。至夜卢躬秉烛请张日用别驾。书一偈于秀偈之侧曰。菩提本无树。明镜亦非台。本来无一物。何处惹尘埃。祖见偈已潜往碓坊问曰。米白也未。卢曰白也未经筛。祖以杖三击于碓。卢即以三鼓入室。祖告之曰。诸佛出世以大事<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故随机大小而引导之。遂有十地三乘顿渐等旨。为之教门。然以无上微妙秘密圆明真实正<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>藏付于上首大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>尊者。展转传授二十八世至菩提达磨祖师。乃以东来。东之益传适至于我。我今以是大法并其所受僧伽黎衣宝钵皆付于汝。善保护之。无使法绝。听吾偈曰。有情来下种。因地果还生。无情既无种。无性亦无生。卢受法已。作礼问曰。法则闻命。衣钵复传授乎。祖曰。昔达磨来自异域。恐世未信其师承。故以衣钵为验。今天下已知信矣。可止于汝矣。且当远隐俟时行化。所谓受衣之人命如悬丝也。卢曰当往何所。祖曰。逢怀即止遇会且藏。卢礼足已即夕去之。众疑祖三日不上堂扣之。祖曰。吾道行矣。问曰。衣钵谁得耶。祖曰。能者得之。众议卢名能。必彼得而往矣。祖付衣法已复经四载。当上元二年告众曰。吾今事毕。时可行矣。入室安坐而逝。寿七十四。建塔于黄梅之东山。代宗谥号曰大满禅师。塔曰法雨(正宗记)</p><p>丙子仪凤元年 己卯调露元年</p><p>庚辰永隆元年 辛巳开耀元年</p><p>壬午永淳元年。隐士孙思邈卒。孙善庄老阴阳医药之术。尤尊释典。称孙真人</p><p>癸未弘道元年。十二月。帝有疾。丁巳崩。甲子中宗即位。尊天后为皇太后。政事咸取决焉 中宗立而废之。太后称制</p><p>佛顶尊胜陀罗尼 西域北印度罽宾国沙门佛陀波利尊者。此云觉护。初仪凤元年来五台清凉山逢一叟。问之曰。尔何为来。曰欲礼文殊。叟曰。曾持佛顶尊胜咒来否。曰未也。叟曰。此土众生犯杀盗淫妄四业者多。能回取咒以流此土作大利益。弟子当示师文殊所在。言已忽不见。波利乃返本国取咒至是。弘道元年至长安。有旨命杜行顗及日照三藏翻译讫。波利又将梵本。访西明寺僧顺贞。贞奏闻共译之。名尊胜陀罗尼。乃第三出也。与杜令译者大同小异。比诸众译此最弘布。波利继入五台。后不知其所终(高僧传)</p><p>法苑珠林 凡一百卷。赐入<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>流行。法师玄晖所撰。晖字道世。至是弘道元年入寂</p><p>则天</p><p>讳[昍/(宋-木+生)](之少反)姓武氏。高宗后。生中宗睿宗太平公主三人。高宗崩中宗立。尊为皇太后。中宗元年二月戊午。后废中宗为庐陵王幽于别所。己未立豫王旦(睿宗也)为皇帝。政事决于太后。居帝于别殿。夏四月迁庐陵王于房州。又迁均州。九月甲寅赦天下。改元光宅。旗帜皆从金色。八品以下旧青者更服碧色。东都(洛阳也)改为神都。宫名太初。又改尚书省为文昌台。左右仆射为左右相。六曹为天地四时六官。门下省为鸾台。中书省为凤阁。侍中为纳言。中书令为内史。御史台为左肃政台。增置右肃政台。其余省寺监率之名悉以义类改之。太后称制二十一年。寿八十一岁(唐史) 光宅(一)垂拱(四)永昌(一)天授又改曰载初(二)长寿(二)延载(一)天册万岁又改证圣(一)万岁通天又改万岁登封(一)神功(一)圣历(二)久视(一)长安(五)</p><p>甲申正月。中宗年曰嗣圣。二月豫王立。年曰文明。九月甲寅改年曰光宅 光宅元年</p><p>乙酉垂拱元年。丙戌二年。泉州黄守恭宅园桑树忽生白莲华。因舍其宅为寺。今开先寺是也(图经)</p><p>垂拱三年。天竺沙门地婆诃罗此云日照。高宗仪凤初至长安。译密严等经。至是共译十八部凡三十四卷。太后亲制序(本传)</p><p>己丑永昌元年 庚辰天授元年</p><p>国号周 天授元年九月。侍御史傅游蓻帅关中百姓诣阙上表。请改国号周赐皇帝姓武氏。太后可之。乃御则天楼赦天下。以唐为周。改元。上尊号曰圣神皇帝。以皇帝且为皇嗣赐姓武。立武氏七庙于神都。十一月庚辰朔日南至太后享万象神宫赦天下。始用周正。以永昌元年十一月为载初元年正月。以十二月为腊月。夏正月为一月。秦宗客改造天地等十二字以献。丁亥行之。太后自名瞾。改诏曰制。二月辛酉太后策贡士于洛城殿。贡士殿试自此始。至久视元年冬十月。制复以正月为十一月。一月为正月。中宗神龙元年二月。复国号唐。郊庙社稷陵寝百官旗帜服色文字。皆如永淳以前故事。复以神都为东都。北都为并州。新造十二字者。照为瞾。天为西。地为[永/土]。日为[○@乙]。月为囝。星为○君为[了-(丁-一)+(夙-歹+(王/口))]。臣为惠。载为风。年为[十/((坐-(人*人)+(刀*刀))-土+十)]。初为[夙-歹+熏]。正为缶 令宰相撰时政记。月送吏馆。时政记自此而始(唐书)</p><p>壬辰长寿元年。四月。诏仁俭禅师入见。师视太后。良久云。会么。后云不会。师云。老僧持不语戒。言讫而去。翌日进短歌十九首。后览而嘉之。厚加锡赉。今唯了元歌一首存传灯玉英集。师即腾腾和尚也。嗣嵩岳慧安国师。国师嗣五祖(传灯)</p><p>宝积经 南天竺国沙门达磨流支。此云法希。初高宗闻其风。开耀元年因西域使者诏敦请之。至是来长安。太后召见。为改其名菩提流志。此云觉爱。敕于佛授记寺译经一十九部凡二十八卷。中宗神龙二年。志遂驾还京。敕于西崇福寺译宝积经。帝亲笔受。睿宗景云元年。帝复于北苑白莲花亭别开宝积会首。帝亦亲躬笔受。王[王*晋]贺知章等润色。中书陆象先魏知古监护。御笔制序标于经首。玄宗开元元年。志以所译宝积经并旧译合成一部百二十卷功毕。志不复译经。专持诵修习禅观。开元十五年入灭。寿一百五十六岁。葬之日特给卤簿羽仪。塔于龙门西原。追赠鸿胪大卿。赐谥曰开元一切遍知三藏。名德之重古未有也。志前后译经五十三部合一百一十八卷(旧唐史具载之)</p><p>甲午延载元年</p><p>乙未天册万岁元年。正月辛巳。太后加号慈氏。改元证圣。又加号天册金轮大圣皇帝。改年曰万岁通天(唐书)</p><p>法师义净 讳义净。字文明。茫阳(涿州也)张氏子。髫龀出家为僧。弱冠具戒。高宗咸亨二年。三十七岁往西域求佛经。孤征二十五年。历三十余国。至是乙未五月还至河洛。得梵本经律论近四百部合五十万夹。金刚座真容一铺。舍利三百粒。太后亲迎于上东门外。奉安佛授记寺。敕令翻译。初与实叉难陀翻<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>。长安三年译金光明最胜王等经百一羯磨等。成均(大学名)助教许观监护。太后制新翻圣教序。中宗神龙元年。于东洛内道场译孔雀王等经。帝制序。号大唐龙兴三藏圣教序。二年随驾回长安。敕于大荐福寺别置翻经院。译一切<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>王等经。兵部侍郎崔湜给事中卢粲润文正字。秘书监附马都尉杨慎交监护。中宗景龙二年。召师入内同翻经。僧九旬坐夏。帝念居房州时祈念药师。乃命法师于大佛光殿译<a href=\"/fojing/yaoshijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">药师经</a>二卷。睿宗景云元年。师留大荐福寺。译浴像等经论二十部凡八十八卷。学士李峤张说等润色。仆射韦巨源苏瑰监护。玄宗开元元年七月法师入寂。寿七十九。僧腊五十九。敕给葬事。塔洛京龙门北之高原。法师前后译经律论五十六部凡二百三十卷。又别撰仪传等九卷。师虽遍翻三藏。而偏攻律部教授学者(本传)</p><p>是年敕沙门明佺等刊定经目撰录十五卷。随大藏流行(本传)</p><p>华严经 太后闻于阗国有梵本华严大经。遣使往求之。并请善梵学者一人随经。于是于阗国主以尊者实叉难陀此云觉喜。妙善<a href=\"/remen/huayanzong.html\" class=\"keylink\" target=\"_blank\">华严宗</a>旨遣应旨太后大悦。是年三月。诏入大遍空寺。同菩提流志复礼法师等翻译。次移佛授记寺。太后时幸其寺。亲究笔削。施供食馔。至圣历二年十月译新经成八十卷。太后亲制序文。御太极殿宣示百官。长安四年。实叉难陀出<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>七卷。比之诸本尤为详明。难陀总译经论一十九部凡一百七卷。辞还于阗。诏遣御史霍嗣光送还本国(并见唐书旧史)。至中宗景龙二年。再诏难陀至京。帝亲迎劳备法仪。送止荐福寺讲演经旨。睿宗景云元年十月师入灭。阇维舌根不坏。诏送归于阗建塔(本传)</p><p>丙申万岁通天元年腊月甲申改元万岁登封贤首教 释法藏号贤首。姓康。康居国人。风度奇正利智绝伦。来长安寻应名僧义学之选。属玄奘法师译经始预其间。后因笔受证义润文见识不同而出译场。初炖煌杜顺法师。隋文帝笃敬之。传华严法界观与弟子智俨。此晋译华严也。藏侍俨尽得其教。至是传译。藏首登其数。实叉难陀译于阗华严梵夹。藏同义净法师复礼法师皆预焉。万岁通天元年。诏沙弥法藏于太原寺开示新译华严宗旨。白光自口而出。有旨命京域十大德为藏授满分戒。赐号贤首。诏入大遍空寺参译。长安元年。诏贤首于东都佛授记寺讲新华严经。至<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>世界品大地震动。即日召对长生殿问帝网十重六相之义。藏敷宣有绪。夫天帝网义十重玄门海印<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>门六相和合义门普眼境界门。此诸义章皆是华严总别义网。太后于此茫然未决。藏乃指镇殿金狮子为喻。因撰义门径捷易解。号金狮子章。列十门总别之相。太后遂开悟其旨。藏又为学不了者设巧方便。取鉴十面八方安排。上下各一相去一丈余。面面相对。中安一佛像。燃一炬以照之。互影交光。学者因晓刹海涉入无尽之义。藏尝着般若<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>疏。为时所贵。天下流行。又号康藏国师。清凉大统国师澄观。以命世亚圣之才追宗贤首。着华严疏论凡数百万言。圭峰宗密嗣之。是为华严五祖。大法渊源。沛然洽于天下。目为一念<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>具德宗贤首教(高僧传)</p><p>清凉国师。法名澄观。姓夏侯氏。越州山阴人也。年十一依今应天山宝林寺霈禅师出家。诵<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。十四岁遇恩得度。隶名宝林。肃宗乾元中。依润州栖霞寺醴律师学相部律。依昙一隶南山律。诣金陵玄璧法师传关河三论。三论之盛于江表师之力也。代宗大历中。于瓦棺寺传起信涅槃。又于淮南法藏受海东起信疏义。温习华严覆寻三论。仅二十年。就苏州从湛然法师习天台<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>法华杂摩等经疏解。又谒牛头山忠禅师。径山钦禅师。洛阳亡名禅师。咨决南宗禅法。复见慧云禅师了北宗玄理。以至翻习经传子史小学苍雅.天竺悉昙.诸部异执四韦五明秘咒<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>篇颂书踪。一皆博综。大历十一年。礼文殊于五台。往峨眉拜普贤。却还五台居大华严寺。专行方等忏法。慨华严旧<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>繁义约。惙然长想。况文殊主智。普贤主理。二圣合为毗卢遮那。万行兼通。即大华严之义。遂撰疏成二十卷。德宗贞元七年。河东节度使李自良。请师于崇福寺讲新疏。德宗闻其风。降中使李辅光宣诏入都。与罽宾三藏般若译乌茶国所进华严后分四十卷。次年五月。遣中使霍仙鸣传宣催入。德宗敦重延居译场刊正。又诏令造疏。编成十卷进呈。顺宗在春宫。尝接师言。请述了义一卷心要一卷并食肉得罪因缘。师疏义纲要富有著作。弟子传法者一百许人。又见宪宗元和十二年并文宗开成三年(赞宁僧统宋高僧传)</p><p>终南山圭峰禅师宗密。果州西充人。姓何氏。世业儒。宪宗元和二年。将赴贡举。偶造遂州圆禅师法席味其道法。遂求披剃。当年取具。一日随众僧斋于府吏任灌家居末座。以次授经得圆觉十二章。未终轴而感悟。归告于圆。圆曰。汝当大弘圆顿之教。此诸佛授汝耳。行矣无自滞于一隅。遂奉命辞去。谒荆南忠禅师洛阳照禅师。皆蒙记莂。抵襄汉因病僧付华严疏。即上都澄观大师之所撰也。览之欣然曰。吾禅遇南宗。教逢圆觉。一言之下心地开通。一轴之中义天朗耀。今复得兹绝笔。寻诣上都礼见清凉国师。未几复入终南圭峰兰若。文宗太和中。征入内赐紫衣。帝累问法要。朝士归慕。唯相国裴休深入堂奥。受教为外护。师以禅教学者互相非毁。遂着禅源诸诠。写录诸家所述诠表禅门根源道理文字句偈。集为一藏。以贻后代。武宗会昌元等正月六日。于兴福院诫门人。令舁尸施鸟兽。焚其骨而散之。言讫坐灭。道俗奉全身于圭峰。茶毗得舍利。藏之石室。宣宗追谥定慧禅师。塔曰青莲。寿六十三。嗣遂州圆。六组下五世荷泽派也</p><p>诏嵩岳慧安禅师并神秀禅师至都。肩舆入殿。太后亲加跪礼。奉于宫禁。朝夕问道。尊安为国师。时王公已下闻风来谒。望尘拜伏(传灯录)</p><p>北宗秀禅师 讳神秀。五祖旁出之嗣。生开封李氏。少业儒。博综多闻忽思出家。至蕲州双峰寺遇五祖。乃叹服而事之。樵汲供役以求其道。祖乃度之。五祖入灭。师住江陵当阳山。太后闻之召至都下。同慧安国师于内道场供养。特加钦礼。命于当阳山置度门寺以旌其德。中宗既立。尤加礼重。大臣张说尝闻法要执弟子礼。师示众曰。一切佛法自心本有。将心外求舍父逃走。中宗神龙二年二月入灭于东都天宫寺。谥大通禅师。敕葬龙门。葬日给羽仪卤簿。帝送至便桥。敕中书令张说为制碑文。师生于隋末百有余岁。僧腊八十。时岐王范及征君卢鸿一皆勒碑制诔。<a href=\"/ctwh/shi/24s/jiutangshu.html\" class=\"keylink\" target=\"_blank\">旧唐书</a>有传。赐僧谥号自师而始。门人普寂义福等皆嗣袭师位(僧传)</p><p>嵩岳安国师 讳慧安。荆州枝江卫氏子。幼年出家披剃。隋文帝开皇十七年遁居山谷。炀帝大业中开济渠丁夫之饿殍也。师为乞食以活之。炀帝闻而征师。不赴潜入太和山。登衡岳行头陀行。太宗贞观间至蕲州黄梅谒五祖。遂得心要。高宗麟德元年。游终南山石壁因止焉。高宗诏之不起复至嵩少。乃云是吾终焉之地也。禅者辐辏。太后遣使召师入见。偕北秀禅师同膺钦礼。太后尊师为国师。至中宗神龙二年赐紫袈裟。为度弟子二七人。延入禁中供养。是时中宗遣内侍薛简诏六祖。祖不赴诏逾三年。中宗又赐师磨衲僧衣。辞归嵩岳。景龙三年三月三日。嘱门人曰。吾死矣将尸向林中。待野火焚之。至八日偃身而寂。春秋一百二十八。门人遵旨。果野火自然阇维。得舍利八十粒。内五粒大而紫色。进留宫禁。睿宗先天元年门人建塔焉。世称老安国师。嗣法弟子仁俭破窖堕嵩岳圭(传灯录)</p><p>丁酉神功元年 戊戌圣历元年</p><p>皇嗣(睿宗也)固请逊位于庐陵王。九月立庐陵王哲为皇太子。复名显大赦天下 己亥圣历二年</p><p>庚子久视元年冬十月。制复以正月为十一月。一月为正月</p><p>辛丑长安元年 壬寅二年 癸卯三年 甲辰长安四年</p><p>中宗</p><p>讳显。高宗第七子。立为皇太子。初高宗崩太子即位。正月尊天后为太后。立妃韦氏为皇后。擢后父韦玄贞豫州刺史。帝以玄贞为侍中。裴炎固争不从。炎白太后密谋。二月戊午废帝为庐陵王迁房州。又迁均州。流玄贞钦州。则天圣历元年。复立为皇太子。至是乙巳年正月乙巳天后传位太子。丙午帝即位。丁未太后徙居主阳宫。帝帅百官上尊号曰则天大圣皇帝。十一月壬寅崩。神龙元年二月复唐国号。郊庙社稷旗帜百官皆如永淳以前故事。以神都(洛阳也)为东都。北都为并州。帝在位六年。寿五十五岁 神龙(二)景龙(四)</p><p>乙巳神龙元年四月。帝降御札召曹溪六祖入京。其辞曰。朕延宗秀二师宫中供养。每究一乘二师并推让云。南方能禅师密受忍大师衣法。可就彼问。今遣内侍薛简驰诏迎请。愿师慈念速赴上京。祖表谢辞以疾。简曰京城禅德皆云欲得会道当习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。若不因禅定而得解脱者未之有也。未审师所说法如何。祖曰。道由心悟岂在坐耶。简曰。弟子回朝主上必问。愿师指示心要令得明道。祖曰。道无明暗。简曰明喻智慧。暗况烦恼。倘不以智慧照破烦恼生死凭何出离。祖曰。若以智慧照烦恼者。此是二乘小机。简曰何谓大乘见解。祖曰。明与无明其性无二。无二之性即是实性。实性在凡不减。在圣不增。住烦恼而不乱。居禅定而不寂。性相如如名之为道。简曰师说不生不灭何异外道。祖曰。外道将灭止生。以生显灭。灭犹不灭。生说无生。我说本自不生。今亦无灭。所以不同外道。汝欲知心要。但一切善恶都莫思量。自然得入清净心体。湛然<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>妙用恒沙。简礼辞归阙表上祖语。帝咨美久之。寻遣使赐祖磨衲袈裟鉼钵绢五百匹。谕天子向慕之意(传灯)</p><p><a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a> 天竺沙门般剌蜜谛此云极量。是年至广州居制止道场。五月于灌顶部中诵出一品。名楞严经。弥伽烁法此云云峰。译成一部十卷。宰相房融笔受。融时贬流高州。因得以寓于译所。沙门怀迪证译。传经事毕。朝廷责以私译。蜜谛遂泛舶携梵夹归天竺(译记)。丙午神龙二年僧范等加五品阶(唐旧史)</p><p>试经度僧 八月诏天下试童行经义。挑通无滞者度之为僧。试经度僧从此而始(唐旧史)</p><p>沙门智严。于阗国王之子。幼年来唐。早居荣禄。授大将军封郡公。是年五月请舍宅为寺。敕允其请。又固请出家。十二月二十四日墨制云。人之情也莫不贪禄惜位。卿之愿也乃欲弃俗出家。忽省来奏。差赏兼怀。特遂所祈。式成高志。仍请住终南山至相寺。多预翻译(释教录)</p><p>丁未景龙元年二年三月朔方道大总管张仁愿。筑三受降城于河上。属丰州</p><p>岳神乞戒 嵩岳元圭禅师。生伊阙李氏。幼岁出家。高宗永淳年间受具戒隶闲居寺习毗尼。谒安国师顿悟玄旨。遂庐于嵩岳之庞坞。是年一日有异人。峨冠裤褶(音习)而至。从者极多伟甚称谒大师。师睹其非常乃谕之曰。善来仁者胡为而至。彼曰师宁识我耶。师曰。吾观佛与众生等。吾一目之岂分别邪。彼曰我此岳神也。能生死于人。师安得一目我哉。师曰。吾本不生。汝焉能死。吾视身与空等。视吾与汝等。汝能坏空与汝乎。苟能坏空及汝。吾则不生不灭也。汝尚不能如是。又焉能生死吾邪。神稽首曰。我亦聪明正直于余神。讵知师有广大之智辩乎。愿授以正戒令我度世师曰。汝既乞戒即既戒也。所以者何。戒外无戒。又何戒哉。神曰此理也。我闻茫昧止求师戒。我身为门弟子。师即为张座秉炉正几曰。付汝<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。若能奉持即应曰能。不能即曰否。神曰谨受教。师曰汝能不淫乎。曰我亦娶也。师曰。非谓此也谓无罗欲也。曰能。师曰汝能不盗乎。曰何乏我也焉有盗取哉。师曰非谓此也谓飨而福淫不供而祸善也。曰能。师曰。汝能不杀乎。曰实司其柄焉曰不杀。师曰非谓此也谓有滥误疑混也。曰能。师曰。汝能不妄乎。曰我正直焉有妄乎。师曰非谓此也谓先后不合天心也。曰能。师曰。汝不遭酒败乎。曰能。师曰如上是为佛戒也。师又曰。以有心奉持而<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>拘执。以有心为物而无心想身。能如是则先天地生不为精。后天地死不为老。终日变化而不为动。毕尽寂默而不为休。信此则虽娶非妻也。虽飨非取也。虽柄非权也。虽作非故也。虽醉非惛也。若能无心于万物则无戒。无戒则无心。无佛无众生。无汝及<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。孰为戒哉。神曰我<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>亚佛。师曰。汝神通十句五能五不能。佛十句七能三不能。神悚然避席跪启曰。可得闻乎。师曰。汝能戾上帝东天行而西七曜乎。曰不能。师曰。汝能夺地祇融五岳而结四海乎。曰不能。师曰。是谓五不能也。佛能空一切相成万法智。而不能即灭定业。佛能知群有性穷亿劫事。而不能化导<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。佛能度无量有情而不能尽众生界。是为三不能也。定业亦不牢久。无缘亦是一期。众生界本无增减。廓无一人能主其法。有法无主是谓无法。无法无主是谓无心。如我解佛亦无神通也。但能以无心通达一切法尔。神曰我诚浅昧。未闻空义。师所授戒我当奉行。今愿报慈德效我所能。师曰。吾观身无物。观法<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。块然更有何欲邪。神曰师必命我为<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>事展我小神功。使已<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>初发心未发心不<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>必信心五等人自我神踪知有佛有神有能有不能有自然有非自然者。师曰。无为是无为是。神曰佛亦使神<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。师宁堕叛佛邪。愿随意垂诲。师不得已而言曰。东岩寺之障莽然无树。北岫有之而背非屏拥。汝能移北树于东岭乎。神曰已闻命矣。然昏夜必有喧动。愿师无骇。即作礼辞去。师门送而且观之。见仪卫逶迤如王者之状。岚霭烟霞纷纶间错。幢幡环佩凌空隐没焉。其夕果有暴风吼雷奔云掣雷栋宇摇荡宿鸟声喧。师谓众曰。无怖无怖。神与我契矣。诘旦和霁。则北岩松栝尽移东岭。森然行植。师谓其徒曰。吾没后言莫及之。若为口实人将妖我。至玄宗开元四年。师嘱门人曰。吾始居寺东岭。我今入灭。可置吾骸于彼。言讫而化。师嗣慧安国师。国师嗣五祖大满禅师(传灯录)</p><p>己酉景龙三年。年召道岸律师入宫。为妃主受归戒。图戒形林光宫御制赞曰。戒珠皎洁。慧流清净。身局灵篇。心融入定。学妙真宗。观通实性。维持法务。纲纪德政。律藏冀其传芳。像教因而光盛。玄宗开元五年师入灭</p><p>睿宗</p><p>讳旦。高宗第八子。初封豫王。又封相王。景龙四年六月。中宗遇弑。韦后秘不发丧。立温王重茂为皇太子。发丧即位。年曰唐隆。相王子隆基平内难。奉相王辅少帝。少帝寻逊位于相王。相王乃即帝位。在位三年。立隆基为皇太子。玄宗开元二年七月重茂薨。谥曰殇皇帝。寿二十岁。开元四年六月睿宗崩。寿五十五岁 景云(二)先天(一)</p><p>庚戌六月。改元景云元年。八月以左武卫大将军薛讷兼幽州都督节度使。节度使之名始自讷也。百官赐爵。普度僧道万数(旧唐史)</p><p>壬子先天元年七月。帝传位于太子</p><p>玄宗</p><p>讳隆基。睿宗第三子。初封楚王。改封临淄王。景云初立为皇太子。先天元年八月即位。在位四十三年。寿七十八。尊睿宗为太上皇 开元(二十九)天宝(十四)</p><p>癸丑开元元年 秋七月帝与岐王范薛王业郭元振及王毛仲高力士等。诛宰相谋废立恶逆者。曰萧至忠窦怀贞岑羲崔湜常元楷李慈等。赏功臣官爵。宦官之盛自始于此。十二月赦天下改尚书。左右仆射为左右丞相。中书省为紫微省。门下省为黄门省。侍中为监。雍州为京兆府。洛州为河南府。长史为尹。司马为少尹</p><p>六祖慧能大士尊者 俗姓卢氏。名能。其先本籍范阳(今豕州也冀域)。父行[啖-口+王]高祖武德年谪官新州生能。遂为新兴人也。甫三岁而父丧母守节育之。及长家益贫。祖乃采薪鬻而供母。一日过市[邱-丘+(厂@墨)]。闻客<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>应无所住而生其心。问客曰。此法得于何人。客曰。此名<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>。得于黄梅忍大师。祖遽告其母。即趋。五祖抵韶州。尼无尽藏者读涅槃经。尼问经字。祖曰。字则不识。义则请问。尼曰字尚不识。曷能会义。祖曰。诸佛妙理非关文字。尼惊异之。谓人曰。能是有道之人宜供养之。近处宝林古寺旧基。众请营茸而延居之。<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>云集俄成宝坊。祖念大法。直造黄梅之东山。即高宗咸亨二年也。既得法已。机语列于五祖章下。丙子仪凤元年正月八日。回届南海法性寺。二僧论风动幡动。祖曰。不是风动不是幡动仁者心动。印宗法师闻之竦异。遂邀祖扣其所自。乃知其为卢居士也。正月十五日会诸名德为祖剃落。二月八日法性寺就智光律师受具戒。既得戒遂开东山法门。明年二月八日归宝林寺。韶州刺史韦据请于大梵寺转妙法轮。并受<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>心地戒。门人纪录目为坛经。后返曹溪雨大法雨。中宗神龙元年四月。帝遣内侍薛简诏师不起。简以所资法要回奏。帝叹美诏赐磨衲袈裟钵绢。十二月十九日敕改韶州古宝林为中兴寺。丁未十一月十八日又敕韶州刺史重加崇饰。赐额为法泉寺。祖新州旧居为国恩寺。睿宗先天元年一日。忽谓众曰。吾忝于忍大师处受其法要并及衣钵。今为汝等信根纯熟。但说法要无有疑者。衣钵不须传也。听吾偈曰。心地含诸种。普雨悉皆生。顿悟华情已。菩提果自成次年七月一日吾返新州国恩寺。至是度人说法已。四十年八月三日。沐浴跏趺而化。寿七十六。十一月十三日归塔于曹溪。今南华寺是也。前刺史韦据碑之(正宗记)。肃宗上元元年。帝慕祖之道。遣使诏取其所传西竺衣钵。就内瞻礼。代宗嗣位。承泰元年五月五日。帝梦祖请衣钵还。帝即遣使驰送曹溪。宪宗元和十年。南海经略。马总以曹溪六祖未有谥请于朝。帝赐谥曰大鉴禅师。塔曰灵照。总又请柳子厚为师撰行业碑(传灯录。又子厚文集)</p><p>帝问佛恩 开元二年。帝宣问左街僧录神光法师曰。佛于众生有何恩德。致舍君亲妻子而师事之。说若有理朕当建立。说若无理朕当削除。神光曰。佛于众生。恩过天地明踰日月。德重父母义越君臣。帝曰。天地日月具造化之功。父母君臣具生成之德。何以言佛并过此乎。光曰。天能盖不能载。地能载不能盖。日则照昼不照夜。月则照夜不照昼。父只能生不能养。母则能养不能生。君有道则臣忠。君无道则臣佞。以此而推德则不全。佛于众生恩则不尔。言盖则四生普覆。论载则<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>俱承。论明则照耀十方。论朗则光辉三有。论慈则提拔苦海。论悲则度脱幽冥。论圣则众圣中王。论神则六通<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。所以存亡普救。贵贱皆携。唯愿陛下留心敬仰。帝悦曰。佛恩如此。非师莫宣。朕愿回心生生敬仰(唐旧史) 甲子十二年 开元十三年</p><p>破窖堕 破窖堕禅师。不称名氏。得法于慧安国师。隐居嵩岳。山坞有庙。灵甚。殿中唯安一窖。远近祭祀不辍。师一日引侍僧入庙。以杖敲窖三下曰。咄此窖只是泥瓦合成。圣从何来。灵从何起。恁么烹宰物命。又打三下。窖乃倾堕。须臾一人青衣峨冠设拜师前。师曰。是甚么人。曰我本此庙窖神。久受业报。今日蒙师说无生法。得脱此处。生在天中。特来致谢。师曰。是汝本有之性非吾强言。神再拜而没。由是时人呼师曰破窖堕和尚(传灯录)</p><p>律至日本 开元十四年。日本国沙门荣睿等至扬州。奉僧伽黎衣十领。其上缀以山川异物之状。盖其国主附之。以施中国沙门。时鉴真律师受其衣。叹外国人有佛种性。欲往化之。会睿等劝请。律师遂附舶而东至日本。彼王枉驾迎劳。馆于毗卢殿。未几请真授归戒。夫人群臣皆以次禀受。日本自是始有律宗焉(本传)</p><p><a href=\"/fojiaogushi/fojing/44092.html\" class=\"keylink\" target=\"_blank\">一行禅师</a> 高僧传曰。释一行。俗姓张。钜鹿人也(今顺德路冀州之域)。本名遂。则太宗朝郯国公公谨之支孙也。丱岁不群博于记诵。读书不再览。遇禅师普寂于嵩山。乃悟世幻。遂礼之为师出家剃染。隶中岳嵩阳寺。专勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。久之往荆州当阳山。依慧悟律师习毗尼。抑详究于阴阳谶纬之书。寻访算术。未至天台国清寺。得尽寺僧之所蕴。自此声名籍甚。睿宗景云二年三月。诏之赴阙。辞疾不行。玄宗开元三年八月。帝遣礼部郎中张洽赍诏诣当阳山。起之至京。帝谓曰。师有何能。对曰。略能记览。帝命中官取官籍示之。师周览方毕。覆其本记唱数幅。帝不觉降榻稽首曰。师实圣人也。叹嗟久之。留光泰殿。诏对无恒。占于灾福若指于掌。开元九年四月。朝廷以麟德历不验。诏师改撰新历。师推大衍数立术以应之。曰开元大衍历五十二卷。编入唐书历律志。邢和璞者道术人也。谓尹愔曰。一行和尚真圣人也。汉洛下闳造太初历云。八百岁后当差一日。则有圣人定之。今年观毕矣。属大衍历出正其差谬。则洛下闳之言可信。非圣人孰能预于斯矣。师学陀罗尼秘印于金刚智三藏。开元十一年十月。师制水运浑天黄道仪成。古未之有也。帝悦亲为制铭。诏安武成殿以示百官</p><p>浑天黄道仪 其仪准圆天之像。具列宿赤道度数。注水激轮令其自转。一昼夜而天运周。外络二轮缀以日月令得运行。每天西行一周。日东行一度。月行十三度。以木匮为地平。以仪半在地下。晦明朔望有准。立木人二于地平。其一前置鼓。候至一刻则自击之。其一前置钟。候至一辰则自撞之(见唐旧史)。帝于大明宫<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>问师社稷运祚。师曰。銮舆有万里之行。社稷毕终得吉。安禄山反。帝幸蜀至万里桥成都而还。僖宗崩。皇弟吉王长而贤。群臣属望。中尉杨复恭请立其弟寿王杰。梁移其祚。师言验也。开元十五年十一月八日。师更衣端坐而逝。春秋四十五。帝哭之哀甚辍朝三日。停龛三七日。颜容怡然。敕葬铜人原。出内库钱五十万建塔。谥大慧禅师。帝亲制文立碑。书之于石。敕东宫已下京官九品以上并送至铜人原。设斋蓝田。开元十六年三月。驾幸温汤。道由师之塔所。驻跸令品官告以出豫之意。赐帛五十匹令莳塔前松柏。师嗣嵩山普寂禅师。寂嗣北宗神秀。秀五祖旁出之嗣也。宋赞宁僧统撰师传曰。师随驾幸新丰。驾前辞帝东来嵩山。谒礼本师寂禅师。入灭于罔极寺(唐旧史并僧传)</p><p>春游 开元十八年二月。始令百官于春月旬休选胜行乐。自宰相至员外郎凡十二筵。各赐钱五十缗。帝御花萼楼。邀其归请留饮。迭使起舞尽欢而去。是时天下奏死罪止二十四人(唐书)</p><p>经卷 沙门智升撰开元释教录二十卷。诠次佛经律论凡五千四十八卷。升又撰续内典录一卷续译经图记一卷续佛道论衡一卷。帝御花萼楼。召释道二教论义。法师道氤与道士尹谦对辩。谦义负。有旨编所论入藏。题曰开元佛道论衡(唐旧史)。法师道氤。俗姓长孙。长安高陵人也。父容殿中侍御史。母马氏。开元十八年于华萼楼对御定二教优劣。氤雄论奋发河倾海注。道士尹谦对答失次。理窟辞殚论宗乖舛。帝再三叹羡赐绢五百匹充法施。另集对御论衡一本。盛传于代。开元二十八年有疾上遗表入寂。帝览表恻怛。遣中使内给事贾文瑰。将绢五十匹就院吊赠。俗寿七十三。僧腊五十三。以其年八月十三日葬终南山阴逍遥园侧(唐旧史并本传)</p><p>注经 开元十九年。御注金刚经颁行天下(大藏流行众经目录)</p><p>太公庙 三月始令两京诸州各置太公庙(吕望也)。以张良配飨。选古名将以备十哲。每岁二月八月上戊日致祭如孔子礼。肃宗上元元年追谥望为武成王(唐书)</p><p>秘密教 西天此土传流凡七世。初金刚萨埵于毗卢遮那前亲受瑜珈五部苏悉轨范。萨埵传龙猛大士。龙猛传龙智阇黎。住世皆数百年。龙智传金刚智跋日罗菩提也。金刚智始来东土。传之不空三藏。不空玄宗开元间复往天竺入师子国。从普贤阿阇黎受十八会金刚灌顶及大悲胎藏建坛之法。天宝五载还至京师。以所得法授慧朗法师。由朗而下南方厥嗣寖微降及末代。特所谓瑜珈佛事者存焉</p><p>金刚智 籍洛阳广福寺。梵名跋日罗菩提。此云金刚智。天竺南印度摩赖耶国人也。父<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>善五明为建支王师。智生数岁。日诵万言。年十五开悟佛理。遂出家随师中印度那兰陀寺学阿毗达磨等。洎登坛法律听十八部律。又诣西印度学小乘诸论。十余年全通经律论三藏。闻支那(此东土时事也)佛法崇盛。乃泛舶而来。开元七年达于广府。次年至京。敕迎舍大慈恩寺广弘秘密。建曼荼罗法。寻徙荐福寺。大智(道也)氤大慧(一行也)二禅师。不空三藏皆师事之。智所译经一行多预焉。一行尝禀其坛法仪制。开元二十年八月十五日于洛阳广福寺命门人曰。白月圆时吾当去矣。遂礼毗卢遮那佛旋绕七匝。退归本院焚香发愿。顶戴梵夹并新译教法付嘱讫。寂然而化。寿七十一。腊五十一。十一月七日葬龙门南伊川之右。弟子不空奏。奉敕谥灌顶国师。敕中书侍郎杜鸿渐撰纪德碑(唐旧史并赞宁僧统僧传)</p><p>不空三藏 籍京兆大兴善寺。梵名阿目佉跋折罗。华言不空金刚。北天竺婆罗门族。幼孤随叔父观光东国。年十五师事金刚智。蒙授教法。洎登具戒仪范。善解一切有部。金刚智入寂已。开元二十五年十二月。携弟子三七人。附昆仑舶返五天印度。历彼诸国。广求密藏及诸经论五百余部。天宝五载还京。奉敕权止鸿胪。六载诏入内立坛为帝灌顶。赐号智藏国师。移居净影寺。夏祈雨有应。帝自持宝箱赐紫袈裟。洛阳北邙山有巨蟒。毒气远喷。闻者立死。帝召师咒而毙之。天宝十二载。西番大石康居三国兵围凉州。帝请空祈阴兵救之。空结坛诵仁王密语。帝亲秉炉。有神介胄而至。帝视之问曰。此何神也。空曰北方毗沙门天王长子也。空诵密语遣之。四月二十日西凉奏报。二月十一日城东北三十许里。云雾间神兵长伟。城北门楼有光明天王。怒视番帅。鼓角凌云而至。西番畏惧卷甲遁去。帝览奏。因敕诸道城楼置天王像此其始也。肃宗乾元中诏空入内建道场护魔法。为帝受转轮王位七宝灌顶。上元末空表请入山。李辅国宣敕令于终南山智炬寺修<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。代宗立思渥弥厚。永泰元年诏译密严仁王二经。帝为制序。十一月一日制授特进试鸿胪卿。大历三年诏空大兴善寺建坛。为近侍大臣及诸镇将帅悉授灌顶。帝亲署加号太广智三藏。大历六年空进所译经凡一百二十卷七十七部。九年示寂。上表辞帝。敕使劳问赐医药。加开府仪同三司封萧国公食邑三千户。固让不已。且曰。白月<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>吾当逝矣。奈何<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>更窃名位。乃以五股金刚铃杵先师之所传者以银盘置菩提子水精数珠留别。附中使李宪诚进。六月十五日香水澡浴。东首倚卧北面瞻望阙庭。以大印身定中而寂。享年七十。僧腊五十。弟子慧朗次绍灌顶之位。余知法者数人。帝辍朝三日。赐绢布杂物钱四十万。造塔钱二百余万。敕功德使李元琮知护丧事。七月六日茶毗。诏朝品刘仙鹤就寺置祭赠司空。谥太辩正广智三藏。收舍利数百粒。以八十粒进内。其顶骨不坏。中有舍利一颗半隐半现。敕于本寺别院起塔。御史大夫严郢为碑。徐浩书树于本院(唐书旧史续高僧传)</p><p>宋(赞宁僧统)系传曰。传教相轮者。东夏以金刚智为始祖。不空金刚为二祖。慧朗为三祖。自后岐分派别。咸曰。传瑜珈大教多则多矣。而少验者何。亦犹羽嘉生应龙应龙生凤凰凤凰已降生庶鸟。矣欲无变革其可得乎</p><p>癸酉开元二十一年分天下为京畿都畿关内河南河东河北陇右山南东道山南西道剑南淮南江南东道江南西道黔(音琴)中岭南凡十五道。各置采访使。方士张果老自言。已数百岁。帝召之至阙。恳辞归山。制赐银青光禄大夫号通玄先生入常山不知所终</p><p>华严合论 开元二十二年。太原李长者。名通玄。日食一柏叶枣小饼。因呼枣柏大士。初开元七年。太原孟县高仙奴馆之斋中造论。逾三年迁马氏古佛堂侧。阅十年负经书而去之。山行二十里偶一虎。长者抚之曰。吾着华严论。能为择栖止处否。即以经囊负其背。行至神福山原下土龛前驻止。长者乃于龛著论。每夕口出白光以代灯烛。日有二女子汲水炷香。每食时具馔。斋毕撤而去。如是五载。长者著论毕。遂灭迹不见也。论成四十卷。开元二十八年三月长者卒。寿九十五岁。又着决疑论.会释.十门玄义.缘生解.迷十明等论.十玄六相.百门义海.偈赞语等。并传于世</p><p>药王 姓韦氏。名古。字老师。疏勒国人。开元二十五年至京。纱巾毳袍杖藜而行。腰悬数百葫芦。普施药饵。以一黑犬自随。凡有患者。古视之即愈。帝敬礼为药王菩萨。皇后图其形而供养之(出本草序及神仙传)</p><p>开元二十六年。诏天下州郡各建一大寺。以纪年为号。额曰开元寺。六月立皇太子玙改名亨(唐书)</p><p>文宣王 二十七年八月。追谥孔子为文宣王。先是祀先圣先师。周公南向。孔子。东向。制自今孔子南向被王者服。追赠弟子皆为公侯伯(唐书)</p><p>青原 吉州青原山静居寺行思禅师。本州安城刘氏子。幼岁出家得法于六祖。归住青原。至是开元二十八年十二月十三日升堂告众跏趺而逝。僖宗谥弘济禅师。塔曰归真。嗣六祖尊者</p><p>普寂禅师 京都唐兴寺普寂禅师。旧唐史云。寂生河东马氏。少时遍参高僧学经律。师事神秀凡六年。秀奇之尽以道授之。秀入京因荐之于则天得度为僧。秀殁天下好释氏者咸师事之。中宗闻其高行。特下制令代神秀统其法众。玄宗开元十三年有旨移居都城。时王公士庶争来礼谒。寂严重少言。难见其和悦之容。远近尤以此重之。至是开元二十八年入寂。有敕赐号大照禅师。葬日河东尹裴宽及其妻子并衰麻列于门徒之次。士庶倾城哭送。市易几废。师嗣秀。秀嗣五祖。嗣子惟政一行</p><p>南岳 禅师。讳怀让。金州杜氏子。年十五辞亲往荆州玉泉寺。依弘景律师出家。受具戒习毗尼。诣曹溪参六祖。逾八年乃领法要。祖谓师曰。西天二十七祖般若多罗谶汝足下出一马驹踏杀天下人。师侍祖一十五年。睿宗先天元年往衡岳居般若寺。至是开元中接马祖道一。付偈曰。心地含诸种。遇泽悉皆萌。三昧华无相。何坏复何成。天宝三载八月十一日圆寂于衡岳。寿六十八。敕谥大慧禅师。塔曰最胜轮之塔。师嗣六祖 天宝三年改年曰载。至肃宗乾元元年复称年</p><p>祠部牒 天宝五载五月制天下度僧尼。并令祠部给牒。今谓之祠部者始起于此</p><p>戊子天宝七载。大将军高力士于西京建宝寿寺成铸洪钟。办斋以庆之。举朝毕集。约以击钟一杵。施钱百缗。有乐施者至二十杵(唐旧史)</p><p>庚寅天宝九载五月。赐安禄山爵东平郡王。唐将帅封王自禄山始。安禄山者本营州柳城胡。初名阿荦山。突厥所谓斗战神者是也。本姓康。母阿史德。为觋居突厥中。祷子于干荦山。及禄山生有光照穹庐。野兽皆鸣。望气者言其祥。父死。母携之再适突厥安延偃。会其部落破散。与延偃兄子思顺俱逃来唐。故冒姓安氏名禄山也。又有史宰(苏骨反)于者。以禄山同里赕缬挛拧@塾鼋??兔?济鳌W院缶惴</p></div>"
},{
    "title": "释氏稽古略 第四卷",
    "author": "觉岸大师",
    "html": "<div class=\"B1_text\"><p>释氏稽古略 第四卷</p><p>乌程职里宝相<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>释 觉岸 宝洲(编集再治)</p><p>宋</p><p>赵姓。以土德王。都汴。今汴梁路</p><p>太祖 太宗 真宗 仁宗 英宗 神宗 哲宗 徽宗 钦宗 高宗(南渡) 孝宗 光宗 宁宗 理宗 度宗 幼主</p><p>太祖</p><p>讳玄朗。初名光胤。曰匡胤。西京洛阳人。赵姓。仕周至归德军节度使殿前都点简。受周禅。年三十四岁。即皇帝位。以二月十六日为长春节。在位十六年。寿终五十岁。帝屡造佛寺。每岁度僧八千人(系年录)。系年录者(上<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>寺讲经首座慧鉴之所编也) 建隆(三)乾德(五)开宝(八)</p><p>庚申建隆元年 大辽应历十年迁郑王(周帝也)居西京(洛阳也)。开宝六年正月殂于房州。谥曰恭帝</p><p>赵北汉刘钧天会四年凤翔吴越荆南高氏保勖立唐蜀 广政汉鋹 天宝三年</p><p>九月帝征李重进于淮南。十二月诏于广陵(今扬州)战地造寺。额曰建隆。赐田四顷。拔荐战亡军士。命<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>道晖主之(系年录)</p><p>辛酉建隆三年 大辽应历十一年</p><p>赵北汉承钧凤翔吴越荆南高氏唐炬立蜀南汉 天宝四年</p><p>春二月十六日圣诞。罢三教论讲。始自开宝已后。乃召三学僧入殿庭试义。凡自京师普天之下岁遇圣诞节。则命僧升座<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>祝圣。递代传流之实本于试义也(宋僧史略容斋三笔)</p><p>壬戌建隆三年 大辽应历十二年</p><p>赵北汉凤翔吴越荆南高氏兄子继冲立唐蜀南汉 天宝五年</p><p>诏僧门童行。每岁经本州考试入京师。执政重监试。所业其<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a>七卷。通者奏名下祠部给牒披剃。若特诏疏恩。如建隆太平兴国普度僧尼。不限此例也(系年录)</p><p>癸亥乾德元年 大辽应历十三年。荆南高继冲奉表纳土归宋。合五十七年国除</p><p>赵北汉刘氏承钧凤翔吴越荆南国除唐蜀孟昶南汉鋹 天宝六年</p><p>甲子乾德二年 大辽应历十四年</p><p>赵北汉吴越唐蜀南汉 天宝七年</p><p>乙丑乾德三年 大辽应历十五年</p><p>赵北汉吴越唐蜀灭南汉 天宝八年</p><p>丙寅乾德四年 大辽应历十六年</p><p>北汉吴越唐南汉 天宝九年</p><p>诏。秦凉既通。遣僧百人往西域。求<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>法(宋僧史略)</p><p>丁卯乾德五年 大辽穆宗应历十七年</p><p>北汉承钧吴越唐南汉 天宝十年</p><p>戊辰十一月改开宝元年 大辽穆宗被弑。景宗立保宁元年</p><p>北汉继元立 广运元年吴越唐南汉十一年</p><p>九月二十七日诏成都府造金银字佛经各一藏。敕兵部侍郎刘熙古监视。冬十一月郊祀毕。肆赦改元</p><p>北汉</p><p>秋七月。承钧寝疾。召平章事郭无为。执继恩手付以后事。继恩嗣位。谧承钧曰孝和皇帝。经六十余日。九月侯霸荣郭无为弑继恩迎继元而立之。改元广运。初汉主刘旻壻曰薛钊。甚贤生子曰继恩。而钊卒。其妇再适何氏生子曰继元。何氏夫妇卒。定王承钧无子。旻以二子命承钧养之。至是弑继恩而立继元(纪载)</p><p>大辽</p><p>穆宗末年残忌猜忍。人人屏息虞祸。会醉索食不得。欲斩庖人。掌膳者恐祸及。因捧食以进。挟刃弑帝于黑山下。九月也。谥曰天顺皇帝。庙号穆宗。景宗立。讳明记。更名贤。世宗元欲子也。初世宗被弑之时。帝年九岁。御厨尚食刘解里以毡束之藏于积薪中得免。至是即位。婴风疾多不视朝。壬午乾亨九年十二月崩。谥孝成皇帝。庙号景宗</p><p>己巳开宝二年 辽景宗保宁二年</p><p>北汉继元 广运二年吴越唐南汉</p><p>春二月十六日。帝长春节。诏许四海僧上表入殿庭比试三学。下开封府<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>使差僧证经律论义十条。全通者赐紫衣。号手表僧。至太宗大平兴国四年。功德使奏。天下一家不须手表。自此皇帝诞日宰辅亲王监司刺史各荐所知三学僧。惟两街僧录所荐者。是日入内授门下牒。谓之帘前师号。仍给紫衣。谓之帘前紫衣。分赐讫便同赐斋。自余王侯荐者。间日方出。节制廉问。牧守则又转降而赐焉(僧史略)</p><p>庚午开宝三年 辽保宁三年</p><p>北汉 广运三年吴越唐南汉 鋹降</p><p>南汉 岭南广也。刘鋹举国降宋。鋹鋹恩赦侯合六十七年国除。是岁敕修京师旧封禅寺为开宝寺。前临官街。北镇五丈河。屋数千间。连数坊之地极于钜丽(李焘长编皇朝事实)</p><p>辛未开宝四年 辽保宁四年</p><p>北汉 广运四年吴越唐</p><p>六月十一日敕成都再造金字佛经一藏(宋僧史略并系年录)</p><p>壬申开宝五年 辽保宁五年</p><p>北汉 广运五年吴越唐</p><p>帝自用兵平列国。前后凡造金银字佛经数藏。今年敕雕佛经印一藏。计一十三万版(北山录外信篇)</p><p>癸酉开宝六年 正月周辽恭帝殂 保宁六年</p><p>北汉继元 广运六年吴越南唐李氏</p><p>甲戌开宝七年 辽乾亨元年</p><p>北汉 广运七年吴越唐</p><p>帝命曹彬与潘美曹翰征江南(南唐也)。十一月济师。彬尝面奉帝旨毋杀人。明年冬攻之垂克。彬称疾不视师。潘美帅诸将省之。彬曰。予病非药石能治。须诸公共誓。城破不杀人则自愈矣。诸将诺。共焚香为誓。是日拔金陵(建康也)。李氏降。城中按堵。彬位至使相。父子配食清庙。贵盛累世。实不杀之<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>也(李焘长编东都曹彬本传)</p><p>乙亥开宝八年 辽乾亨二年 三月往聘宋。宋乃初通使于辽</p><p>北汉 广运八年吴越南唐李[火*且]降宋封违命侯合三十九年而国除</p><p>丙子年夏四月。上幸西京。有事于南郊。是岁十二月二十二日。改为太平兴国元年(容斋续笔)</p><p>太宗</p><p>讳炅。太祖母弟。封晋王。开宝九年太祖崩。帝即位。年三十八。偃武修文。改讲武殿为崇政殿。选用贤良谨择刺史。谓刺史最为亲民。苟非其人民受其祸。求言纳谏。风俗醇厚。在位二十一年。寿五十九岁。崩以十月十七日。为乾明节 太平兴国(八)雍熙(四)端拱(二)渟化(五)至道(三)</p><p>丙子十二月改太平兴国元年 辽乾亨三年</p><p>北汉 广运九年吴越</p><p>丁丑太平兴国二年 辽乾亨四年</p><p>北汉 广运十年吴越</p><p>京师旧龙兴寺。周世宗废之为龙兴仓。至是主僧击登闻鼓诉复寺。帝感叹诏复之。赐名太平兴国寺仍为营葺。极宏壮之制(皇明事苑)</p><p>戊寅太平兴国三年 辽乾亨五年</p><p>北汉 广运十一年吴越奉表入朝纳土</p><p>三月。吴越忠懿王钱俶上表归宋入朝。尽献十三州之地</p><p>四月。陈洪进奉表献漳泉两郡。秋八月十三日翰林学士知制诰李昉(妃两反)中书舍人扈蒙直史馆李穆宋白郑邻几徐铉奉敕表进太平广记。帙成五百卷。录<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者列三十卷</p><p>沙门赞宁随吴越王入朝。帝赐号通慧大师。敕住左街天寿寺。命修僧史。明年诏宁乘驿。进明州阿育王山释迦文佛真身<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。入禁中<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。得舍利一颗。因之以开宝寺西北阙地造浮图十一级。下作天宫以葬之(皇朝事苑)。太平兴国七年十月。敕宁编修大宋高僧传。听归浙东秉笔。初梁武帝天监十八年。嘉祥寺沙门慧皎作高僧传。始后汉明帝永平十年至天监成十四卷。唐太宗贞观十九年。终南山西明寺道宣律师作续高僧传。始天监之来迄贞观成三十卷。宁作始自唐贞观二十年至此端拱元年成三十卷。用梁唐义例开十科。一译经科。二慧解科。三<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>科。四<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>科。五<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>科。大感通科。七遗身科。八读诵科。九兴福科。十杂科声德。正传者五百三十三人。附见者一百三十人。端拱元年冬十月。遣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>显忠智轮诣阙上表以进。玺书赐帛奖谕。敕入大藏<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。十一月诏宁赴阙。淳化元年奉旨着鹫岭圣贤录一百卷。淳化二年。诏宁充史馆编修(帝王年运诠要)。至道二年。诏除宁掌洛京教门事(宋僧传后序)。戊戌真宗咸平元年。诏擢宁汴京右街僧录。主管教门公事。次年进左街。己亥咸平二年春二月。东京左街僧录史馆编修主管教门公事通慧大师赞宁归寂。寿八十二。三月葬全身于天寿寺。己巳仁宗天圣七年。宁曾孙宗盛启塔荼毗之。收遗骸舍利。归葬钱塘故里。宁生杭州临安县。后唐明宗天成中<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>杭州祥符寺。潞王清泰初入天台具探律部。博通<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。吴越忠懿王补宁两街僧统。号明义宗文大师。所作僧史僧传并行于世(钱塘塔记)</p><p>己卯太平兴国四年 辽乾亨六年</p><p>北汉五月太原刘继元降宋封彭城公合二十九年国除</p><p>庚辰太平兴国五年 辽乾亨六年</p><p>译经 河中府传显密教沙门法进。请西域法天三藏译经于蒲津。诏入京师。初兴译事。诏童子五十人习梵学(译经总录)</p><p>辛巳太平兴国六年 辽乾亨八年</p><p>诏立右街副僧录。诏致祭建康钟山宝志大士。赐号道林真觉菩萨(大士碑记)</p><p>壬午太平兴国七年 辽乾亨九年。十二月帝崩。治十五年。谥孝成皇帝庙号景宗</p><p>诏立译经传法院于东京太平兴国寺之西。如唐故事。以宰辅为译经润文使。设官分职。西天中印度惹兰陀罗国密林寺天息灾三藏。与法天施护等译大乘<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>宝王经帝制大宋新译三藏圣教序。诏普度天下童行为僧。不限有司常例。自太平兴国元年至八年度僧一十七万余人(僧史略)</p><p>大辽</p><p>圣宗立。讳隆绪。景宗长子。年十二即位。改元统和。尊母萧氏为承天太后。临朝种制凡二十七年。乃归政于帝。癸丑改元开泰。复国号大契(音乞)丹。太平十年六月三日崩于上京。谥曰天辅皇帝。治四十九年</p><p>癸未太平兴国八年 辽圣宗立。统和元年</p><p>御赞舍利 初太祖迎洛阳。唐高宗显庆年间。大沙门宣律师天王太子所献<a href=\"/sheli/fo/36639.html\" class=\"keylink\" target=\"_blank\">佛牙舍利</a>。于东京相国寺灌顶院安奉。至是帝亲以烈火煅试。晶明坚固光彩五色照人。帝制赞曰。功成积劫印文端。不是南山(宣律师本传)得恐难。眼睹数重金色润。手擎一片玉光寒。炼时百火精神透。藏处千年莹彩完。定果熏修真秘密。正心莫作等闲看。改灌顶院为法华院。建重阁。以智照大师慧温主香火(南山舍利碑)</p><p>甲申雍熙元年 辽统和二年</p><p>春三月日本国僧奝然入朝。因言其国传世八十。历年三千二百矣。帝谓辅臣曰。中国自唐末五代分裂。不但其君朝成夕败。臣亦诛死相寻。朕兢兢求治。冀上穹鉴祐为子孙长久计。卿等亦保世禄(出十三<a href=\"/remen/chaosheng.html\" class=\"keylink\" target=\"_blank\">朝圣</a>政录)。诏修泗州僧伽塔。加谥大圣二字。寺曰照普(本传)</p><p>十月诏隐士陈抟入见。赐号希夷先生。寻请归华山</p><p>乙酉雍熙二年 辽统和三年</p><p>丙戌雍熙三年 辽统和四年</p><p>秋八月二十五日。秀水高僧晤恩端坐面西而逝。初<a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>。元自唐德宗建中三年荆溪尊者灭后五传而至清竦。竦有二弟子。曰羲寂。曰志因。寂以教观正脉传义通。通传知礼(四明尊者)遵式(下竺忏主)。源源授受。志因传晤恩。恩名著僧史。恩传洪敏源清。清传智圆(孤山法师)庆昭。昭传继齐咸润。境观解行各师其说。四明知礼辞而辟之。衡岳家世斥之为山外宗(天台教部)</p><p>丁亥雍熙四年 辽统和五年</p><p>十月。天台教荆溪尊者下六世螺溪传教定慧院净光法师羲寂入寂。义通嗣之(本传)</p><p>四川西路益州(成都路也)香林院禅师名澄远。二月入灭。师生西川汉州绵竹上官氏。嗣云门偃禅师(传灯)</p><p>戊子端拱元年 辽统和六年</p><p>义通法师 传天台教。是年十月十八日入寂于明州宝云院。通本高丽王种。初出家传华严起信有声。石晋天福中渡海来谒螺溪羲寂。顿悟开显十法界<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>之旨。嗣法流通。逾二纪得知礼遵式高弟。益大其传(塔记)</p><p>己丑端拱帝建开二年宝寺成 辽统和七年庚寅淳化元年 辽统和八年</p><p>诏参知政事苏易简。撰三教圣贤事迹。易简奏。天寿寺通慧大师赞宁。大乙官道士韩德纯分领其事。通慧赞宁着鹫岭圣贤录一百卷</p><p>辛卯淳化二年 辽统和九年</p><p>壬辰淳化三年 辽统和十年</p><p>癸巳淳化四年 辽统和十一年</p><p>首山 汝州首山禅师。名省念。莱州狄氏子。受业本郡南禅寺。才具戒遍游丛席。常密诵<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。众目之曰念法华。受风穴沼禅师记莂。开法首山为第一世。次住汝州叶县广教及宝应。于昨淳化三年十二月四日午时上堂说偈曰。今年六十七老。病<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>且遣日。今年却记来年事。来年记着今朝日。至今年十二月四日辞众上堂。仍说偈曰。白银世界金色身。情与非情共一真。明暗尽时俱不照。日轮午后示全身。言讫泊然而逝。荼毗收舍利建塔。师嗣风穴延沼。沼嗣南院慧颙。颙嗣兴化存奖。奖嗣临济义玄禅师。其嗣师之法道者。汾阳善昭叶县归省神鼎洪諲谷隐蕴聪广慧元琏丞相王随公等凡一十二人。省传浮山法远。远传净因道臻等。法道昌盛于后(僧传)</p><p>甲午淳化五年 辽统和十二年</p><p>乙未至道元年 辽统和十三年</p><p>御制 秘藏诠二十卷。缘识五卷。逍遥咏十卷。命两街僧笺注。入释氏大藏颁行(大藏目录)</p><p>丙申至道二年 辽统和十四年</p><p>丁酉至道三年三月帝崩 辽统和十五年</p><p>真宗</p><p>太宗第三子。讳恒。二十九岁即位。务从简易。作文武七条以赐臣僚。转运知州并带劝农事。东封泰山。西祀汾阴。以文理太平治二十五年。寿五十四岁。以十二月二日为承天节 咸平(六)景德(四)大中祥符(九)天禧(五)乾兴(一)</p><p>戊戌咸平元年 辽统和十六年</p><p>己亥咸平二年 辽统和十七年</p><p>庚子咸平三年 辽统和十八年</p><p>夏大旱。浙东天台讲宗知礼(四明尊者)遵式(下竺忏主)同修护国金光明<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>忏三日乃雨。明州太守苏为以碑颂其德(忏主行业记。四明教行录)。浙西自春涉夏亦不雨。给事中知杭州张去华率僚属具旛盖鼓吹。迎天竺圆通大士祷于梵天寺。继时雨霔四境沛足。此<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>出应民望慈悲灵感之始也(上竺纪实灵感传)</p><p>辛丑咸平四年 辽统和十九年</p><p>天竺三藏朝散大夫试光禄卿明教大师法贤进新译经帝制序(<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>驱字函)</p><p>壬寅咸平五年 辽统和二十年</p><p>西天译经三藏朝奉大夫试光禄卿传法大师施护译给孤长者女得度<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。经请帝制继圣教序(天竺教藏荐字函)</p><p>癸卯咸平六年 辽统和二十一年</p><p>帝敕右街僧录。备仪仗音乐华旛。迎大相国寺佛牙舍利。供养于开宝寺塔。下帝制赞曰。西方有圣释迦文。接物垂慈世所尊。常愿进修增胜果。庶期<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>富黎元(三朝御赞舍利序)</p><p>甲辰景德元年 辽统和二十二年</p><p>传灯录 吴僧道原集释迦<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>初祖<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>以至东土<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>传嗣诸祖机缘。为景德传灯录三十卷进呈。帝览之嘉赏。敕翰林学士杨亿等刊正。撰序颁入大藏。天下流行(经目)</p><p>日本国僧寂照。赍本国禅师源信所陈经论义目二十七条。问疑于四明法师知礼。受教归国(教行录)</p><p>四明大法师知礼着十不二门指要二卷。开明南岳天台所证一心<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>之妙(教行录)</p><p>乙巳景德二年 辽统和二十三年</p><p>丙午景德三年 辽统和二十四年</p><p>丁未景德四年 辽统和二十五年</p><p>戊申大中祥符元年 辽统和二十六年</p><p>冬十月帝东封泰山祀上帝。十一月朔幸曲阜祭孔子。加谥曰玄圣文宣王。追谥齐太公曰昭烈武成王。周文王曰文宪王。各立庙。寻以圣祖讳改玄圣为至圣。己酉年二月诏许曲阜先圣庙立学(帝纪)</p><p>己酉大中祥符二年 辽统和二十七年</p><p>禅师名遇贤。姑苏长洲林氏子。七岁出家依嘉兴永安可依大德。年三十剃落圆具。往参龙华球禅师。发明心印。回居明觉院。唯事饮酒。醉则成歌警世道俗。号之酒仙。歌曰。扬子江头浪最深。行人到此尽沈。吟。他时若到无波处。还似有波时用心。曰。金斚又闻泛。王山还报颓。莫教更漏捉。趁取月明回。曰。一六二六其事已定。一九二九我要吃酒。长伸两脚眠一寤(音忽)。起来天地还依旧。曰。门前绿树无啼鸟。庭下苍苔有落花。聊与东风论个事。十分春色属谁家。曰。秋至山寒水冷。春来柳绿花红。一点动随万变。江村烟雨蒙蒙。有不有空不空。箍篱捞取西北风。曰。生在阎浮世界。人情几多爱恶。秖要吃些酒子。所以倒街卧路。死后却产娑婆。不愿超生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。何以故。西方净土且无酒酤。至是祥符二年上元日。师凌晨索浴罢就室。握拳以右举左张其口而化(平江域东禅院)。师嗣龙华彦球。球嗣长庆棱。棱嗣雪峰存禅师。存嗣德山鉴禅师(五灯录)。诏诸州路置天庆观(帝纪)</p><p>申国长公主。太宗第七女。生不茹荤。至是恳求为僧。进封吴国。赐名清[示*谷]。号报慈正觉大师。都城西为建崇真资圣禅院。嫔御三十人。诏两禁送之入寺。赐斋申国。俗寿三十八。尼夏十六而入灭(皇朝事苑)</p><p>庚戌大中祥符三年 辽统和二十八年</p><p>冬十月。有旨改明州保恩院为延庆院。敕改华亭陆机别业大明寺额曰普照。敕改义兴函亭乡禅林院。额曰圣感禅寺。传十方住持。奉祠山祀典神祇(寺记碑文)</p><p>辛亥大中祥符四年 辽统和二十九年</p><p>诏译经润文使参知政事赵安仁翰林学士杨亿撰大藏目录(皇朝类苑)</p><p>壬子大中祥符五年 辽统和三十年</p><p>天竺酤兰古国刹帝利种沙门觉称至京师馆于译院。年始四十许通四十余本。经论润文使丁晋公(名谓)嘉其敏慧。遣译者导之见。杨翰林亿(名也)设茗果与之语。觉称曰。愿至五台山拜文殊即还本土。入此国见屠杀猪羊市肆悬肉。痛不忍观。西竺举国不食肉。他日晋公问。数万里远来更何所为。曰并欲礼宣律师塔耳(皇朝类苑若杨文公谈苑)</p><p>癸丑大中祥符六年 大契丹开泰元年</p><p>春三月帝赐御制法音集。付传法院笺注(藏经目录)</p><p>帝赐译经院修心偈曰。初祖安心在少林。不传经教但传心。从人若悟真如性。密印由来妙理深(明教正宗记第十二卷)</p><p>大辽复号大契丹。以幽州为析津府。改元曰开泰。至丙午咸雍二年。复称大辽</p><p>甲寅大中祥符七年 大契丹开泰二年</p><p>天竺三藏朝散大夫试鸿胪卿传教大师法天译金刚大教宝王经。冬十一月。京师建王清昭应宫成。起自大中祥符二年四月。至是年十一月毕工。总二千六百一十区。丁晋公(名谓)为修宫使。土木金石丹漆之用搜材选胜于天下。沈存中笔谈曰。温州雁宕山诺矩罗尊者所居。前世人所不见。因昭应采木。此境始露(洪迈容斋三笔)</p><p>乙卯大中祥符八年 大契丹开泰三年</p><p>大法师遵式。讲于天台东掖山十有二年矣。至是始西渡居杭州古<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>寺(今下天竺)。初西晋天竺慧理法师居焉。隋高僧真观讲法华之地。唐道标继成之。至僖宗时为寇所毁。西岩有桧枯株。存于焚败之余。法师以水洒而祝之。枝叶重荣。力行四种三昧。建金光明忏堂。一椽一甃。必诵<a href=\"/fozhou/dabeizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">大悲咒</a>七遍。殿宇全备。奏蒙朝廷赐天竺灵山寺额传天台教观(忏主衍业记)</p><p>丙辰大中祥符九年 大契丹开泰四年</p><p>丁巳天禧元年 大契丹开泰五年</p><p>诏天下立<a href=\"/remen/fangsheng.html\" class=\"keylink\" target=\"_blank\">放生</a>池。明州大法师知礼。自丙辰春偕十僧。誓修法华三昧。三年满。如药王故事烧身供养妙法莲华经以生净土。翰林学士杨亿闻知。邮置长书坚请住世。仍委郡守李夷庚保护。天禧四年宰相寇。准翰林杨亿以知礼行业及遗身事奏闻。帝曰。但传朕意请留住世。特赐师号法智大师(教行录)</p><p>秋七月太尉文正公王且薨。公在政府十八年。病革。嘱翰林学士杨亿曰。吾深厌<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。愿未来世为苾刍林间宴坐。观心为乐。至易箦时。君为我剃须发。着坏色三衣。用火葬礼。营骨塔于先茔之侧。亿曰。公三公也。敛赠公[褒-保+公]岂可加于僧体乎。与诸孤议。但以三衣置柩中。不藏宝玉而已(文莹湘山录)</p><p>戊午天禧二年 大契丹开泰六年</p><p>己未天禧三年 大契丹开泰七年</p><p>庚申天禧四年 大契丹开泰八年</p><p>辛酉天禧五年 大契丹开泰九年</p><p>诏殿头俞源清。往明州延庆院为国修忏三昼夜。法智大师知礼着修忏要旨一卷(教行录)。壬戌乾兴元年。二月帝崩 大契丹太平元年</p><p>帝特赐杭州天竺寺法师遵式号慈云大师。章献明肃皇后刘氏遗使至天竺为国修忏。法师着护国金光明三昧仪一卷上进(忏记)</p><p>春二月。杭州西湖孤山法慧法师智圆号中庸子。十七日自作祭文挽诗。十九日入灭。圆撰通经十疏。处士林逋和靖为邻。天竺法师遵式为友。寿四十七岁。腊三十九。葬以陶器(缶也)。仁宗景祐三年。因积雨山颓启其封。全体如生爪发俱长。唇红微开齿如珂雪。为袭新衣散众名香瘗之。高宗绍兴中。孤山建四圣观。迁师塔于北山玛瑙坡(孤山闲居编忏主行业记)</p><p>仁宗</p><p>祯。真宗第六子。年十三即帝位。帝务仁厚。裁抑侥幸。委任贤良。专置谏官六员。纳谏不倦。置学校创广惠院以处穷民。自奉甚薄利泽施民。号为极治。以四月十四日为乾元节行崇天历。在位四十一年。寿五十五岁天圣(九)明道(二)景祐(四)宝元(二)康定(一)庆历(八)皇祐(五)至和(二)嘉祐(八)</p><p>癸亥天圣元年。行崇天历 大契丹太平二年</p><p>甲子天圣二年 大契丹太平三年</p><p>临济下五世汾阳太子院禅师。名善昭。太原俞氏子。剃发受具。杖策游方。所至少留随机叩发。历参知识七十一员。后见首山念禅师。契悟玄旨。游衡湘及襄氵间。每为郡守以名刹致师。凡历八请。师皆不赴。洎首山没。西河道俗遣僧契聪迎请住持。师<a href=\"/remen/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>高卧。聪排闼而入。让之曰。佛法大事靖退小节。先师弃世今何时而欲安眠哉。师曰。非公不闻此语乃赴其请。至是天圣二年。龙德府尹李侯致师住承天。价三返不起。价再至辟函。师曰。老病业已不出山。借往当先后之。价曰。唯师所择。师令具馔且趣装曰。吾先行矣。停筯而化。阇维收舍利建塔。师嗣首山念禅师。有曰十智同真者。师之语也(本传)</p><p>乙丑天圣三年 大契丹太平四年</p><p>丙寅天圣四年 大契丹太平五年</p><p>诏天台教部入大藏流行。初天竺寺僧思悟求教藏流行。自乙丑春祷于大<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>音。至是<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>克遂。乃焚身于日观庵前。用报佛恩(天竺别集)</p><p>丁卯天圣五年 大契丹太平六年</p><p>九月光禄大夫太子少傅文元公晁迥撰法藏碎金十卷。皆理性自得之学也</p><p>戊辰天圣六年 大契丹太平七年</p><p>春正月五日明州法智尊者知礼趺坐集众而言曰。吾建延庆道场。誓在流通法华三昧。尔等莫作最后断佛种人。生必有死犹旦暮然。精修无间世世生生相逢有在。语毕骤称阿弥陀佛而寂。露龛二七日。爪发俱长。仪容如生。阇维(火北也)舌根不坏。舍利五色莫知数。资政殿大学士兼太子少保清献公赵捵欧ㄊπ幸当</p></div>"
}]