[{
    "title": "释迦方志 第2088部",
    "author": "道宣大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>释迦方志 卷上 封疆统摄中边遗迹</p><p>释迦方志序</p><p>终南太一山释氏</p><p>惟夫大唐之有天下也将四十载。淳风洽而浇俗改。文德修而武功畅。故使青丘丹穴之候。并入堤封。龙砂雁塞之区。聿遵声教。英髦稽首。显朝宗之羽仪。输賝奉贽。表怀柔之盛德。然则八荒内外前史具舒。五竺方维由来罕述。岂非时也。虽复周穆西狩止届昆丘。舜禹南巡不踰沧海。秦皇画野近袤临洮。汉武封疆关开铁路。厥斯以降遐讨未详。所以崆峒问道局在酒泉之地。昆仑谒圣。实惟玉门之侧。至于弱水洞庭。三危九陇。烟然龙勒。沙障黎河。具历夏书。咸图雍部。及博望之寻河也。创闻大夏之名。轩皇之游梦也。初述华胥之国。贰师之伐大宛。定远之开铁门。由余入秦。日磾仕汉。声荣覆于葱岭。帝德亘于耆山。赫奕皇华其徒繁矣。而方土所记人物所宜。风俗之沿革。山川之卓诡。虽陈之油素略无可纪。岂不以经途辽远。游诣之者希乎。以事讨论纵有传说。皆祖行人信非躬睹。相从奔竞虚为实录。何以知其然耶。故积石河源西瞻赤县。昆仑天柱东顾神州。呜砂以外咸称胡国。安用远筹空传缃简。是知身毒之说重译臻焉。神异等传断可知矣。自<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>道东荣光烛汉。政流十代年将六百。輶轩继接备尽观方。百有余国咸归风化。莫不梯山贡职望日来王。而前后传录差互不同。事迹罕述称谓多惑。覆寻斯致宗归译人。昔隋代东都上林园。翻经馆<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>彦琮着西域传一部十篇。广布风俗略于佛事。得在洽闻失于信本。余以为八相显道三乘陶化。四仪所设莫不逗机。二严攸被皆宗慧解。今圣迹灵相。杂沓于华胥。神光瑞影。氤氲于宇内。义须昌明形量动<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>灵。泉贞观译经尝参位席。傍出西记具如别详。但以纸墨易繁阅镜难尽。佛之遗绪释门共归。故撮纲猷略为一卷。贻诸后学序之云尔</p><p>释迦方志一部八篇封疆篇第一统摄篇第二中边篇第三遗迹篇第四游履篇第五通局篇第六时住篇第七教相篇第八</p><p>仰寻。诸佛之降灵也。不可以形相求之。随机显晦故得以言章述矣。然学教者统举为先。傍穷枝叶终非远致。故于篇首摽其致焉</p><p>释迦方志封疆篇第一</p><p>佛之所王土也。号曰索诃世界。即古翻经为娑婆矣。经中所谓忍土者也。谓此土人强识力念。能忍苦乐堪任道器。故佛王之。案此封疆。周轮铁山山外是空空不可测。山下是地地下是金。金下是水水下是风。其风坚实逾于金刚。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心力同业所感。能持世界不令倾坠。自风以外即是<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。约此周轮从下而上。至无色穷名为有顶。论其画界从广所经。卒非里数之所度也。且如智度论。从<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天下一大石。经一万八千三百八十三年方始至地。约此上下方维。名为一佛所王土也(即以大千铁围而为封疆之域)</p><p>释迦方志统摄篇第二</p><p>案。索诃世界铁轮山内所摄国土则万亿也。何以知之。如今所住即是一国。国别一苏迷卢山。即经所谓须弥山也。在大海中据金轮表。半出海上八万由旬。日月回转于其腰也。外有金山七重围之。中各海水具八<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。其外碱海广于无际。海外有山是铁所成。四周绕之海中可居者。大略有四。即约苏迷山用分方面。东洲名毗提诃。南洲名赡部。西洲名瞿陀尼。北洲名拘卢也。此之四洲亦名四有。人之所居佛之所王。准此傍及铁围海内惟有四洲。苏迷山已上二十八天。并一日月为一国土。即此为量数至一千。铁围都绕名小千世界。即此小千数至一千。铁围都绕名中千世界。即此中千数至一千。铁围都绕名为<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。案此三千大千世界。其中四洲山王日月。乃至有顶则有万亿之所。皆为佛之统摄。俱遵声教</p><p>释迦方志中边篇第三</p><p>惟夫法王所部则大千之内摄焉。若据成都则此洲常为所住故。此一洲则在苏迷山南之海中也。水陆所经东西二十四万里。南北二十八万里。又依论说。三边等量二千由旬。南边三由旬半。是则北阔而南狭人面象之。又依凡记。人物所居则东西一十一万六千里。南北远近略亦同之。所都定所则以佛所生国迦毗罗城应是其中。谓居四重铁围之内。故经云。三千日月万二千天地之中央也。佛之威神不生边地。地为倾斜故。中<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国如来成道树下。有金刚座用承佛焉。据此为论约余天下以定其中。若当此洲义约五事以明中也。所谓名里时水人为五矣</p><p>所言名者。咸谓西域以为中国。又亦名为中天竺国。此土名贤谈邽之次。复指西宇而为中国。若非中者凡圣两说不应名中。昔宋朝东海何承天者。博物著名群英之最。问沙门慧严曰。佛国用何历术而号中乎。严云。天竺之国。夏至之日方中无影。所谓天地之中平也。此国中原景圭测之故有余分。致历有三代大小二。余增损积算时辄差候明非中也。承天无以抗言。文帝闻之乃敕任豫受焉</p><p>夫以八难所标边地非摄。出凡入圣必先中国。故大夏亲奉音形。东华晚开教迹。理数然矣</p><p>二言里者。夫此一洲大分三量。二分以北土旷人希。獯狁所居无任道务。一分以南尽于三海。人多精爽堪受圣化。故约道胜大圣都焉。故成光子云。中天竺国东至振旦国五万八千里(振旦即神州之号也。彼人目之)南至金地国五万八千里。西至阿拘遮国五万八千里。北至小香山阿耨达池五万八千里。观此通摄取其遐迩。齐致以定厥中。其理易显</p><p>三言时者。谓雪山以南名为中国。坦然平正冬夏和调。卉木常荣流霜不降。自余边鄙安足语哉</p><p>四言水者。此洲中心有一大池。名阿那陀答多。唐言无热恼也。即经所谓阿耨达池。在香山南大雪山北。居山顶上非凡所至。池周八百里四岸宝饰。正南当于平地<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>所居。故金刚座东僻至五千里。又池正南当洲尖处。其北当谜罗川即北。又当葱岭北千泉也。上空定约当北辰星。今望第五似如西欹。且天上一寸地下一千。千泉去京八千余里焉。约天无一尺矣。其池北去钵露罗国减千里。东南屈露多国。酉南罽宾国。各千余里。然四海为[坚-臣+(虍-七+(一/谷))]水趣所极。故此一池分出四河。各随地势而注一海。故葱岭以东水注东海。达儭以南水注南海。雪山以西水注西海。大秦以北水注北海。故地高水本注是其中此居海滨边名难夺。又<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>宏大通举事周。博见圣贤义非妄委。于上所列咸符地图。然此神州所著书史。寓言臆度浮滥极多。时约佛经更广其类。都皆芜秽试为举之。水经云。无热丘者即昆仑山 又扶南传云。阿耨达山即昆仑山 又<a href=\"/ctwh/gdxs/smzg/shj.html\" class=\"keylink\" target=\"_blank\">山海经</a>云。南流沙滨。赤水后黑水前。有大山名昆仑丘 又云。钟山西六百里。有昆仑山出五水 案穆天子传云。舂山音钟。又云。海内昆仑丘。在西北帝之下。方八百高万仞。又十州记云。昆仑陵即昆山也。在北海亥地去岸十三万里。此约指佛经苏迷山也</p><p>又东海中山名方丈。亦名昆仑</p><p>又云。西王母告周穆云。山去咸阳三十六万里。高平地三万六千里</p><p>又周穆传述西王母云。去宗周瀍涧一万一千一百里 神异经。昆仑山有铜柱。其高入天围三千里。荣氏注云。柱洲昆仑山东南万二千里有无外山 <a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a>云。昆仑山去嵩高五万里高万一千里郭璞云。高二千五百余里 淮南云高万一千一百里十四步二尺六寸 道经造立天地记云。昆仑山高四千八百里。又转形济苦经云。高万九千里。又云。此山飞浮 又云。昆山南三十里。次第有千昆山。名小千世界</p><p>化胡经云。昆山高九重。相去各九千里 又云。高万万五千里</p><p>已前儒道两说。虽形量差异莫越昆仑。寻昆仑近山。则西凉酒泉之地。穆后见西王母之所。具彼图经。若昆仑远山。则香山雪山之中也。河源出焉。故尔雅云。河出昆仑墟。郭璞图赞云。昆仑三层号曰天柱。实惟河源水之灵府。案禹贡云。导河自积石者。但据伏流所出处而名之。若讨本源诚有由矣 故佛经云。此无热池东。有银牛口出殑伽河。即古所谓恒河也。右绕池匝流入东南海。南有金象口出信度河。即古辛头河也。右绕池匝流入西南海。西有琉璃马口出缚刍河。即古博叉河也。如上绕池入西北海。北有颇胝师子口出徙多河。即古私陀河也。如上绕池入东北海。案河图云。昆仑山东方五千里名曰神州。亦名赤县。又依书云。河源东北流出葱岭岐沙谷。分为两水。东北支流经于阗南山于国西北出。又东流大河经朅盘陀城东南。又经疏勒国西。又东北至城下。又回流国南五百余里至乌铩国南。又东北至疏勒国北。六百一十里至乌孙界赤谷城。又东二百七十里经姑墨国南。又东六百七十里经龟兹国南。又东三百五十里经乌垒国南。此即汉时都护所治也。西南去疏勒二千一百一十里。东南去鄯善国。千七百八十五里。东北去乌耆国四百里。河又东南三百四十里经渠梨国南。又东二百四十里经黑山国南。此东去玉门关二千六百六十里。河又东经连城注宾城南且末国北合支水。河又东经娄兰地。又东经鄯善国城南。过东北数百里入蒲昌海。其海东面少北去玉门一千三百里。又东北去阳关三百里。此河于蒲昌伏流南而少西数千里。入积石山在羌烧瓽中。书云。积石去昆仑丘。千七百四十里。或云。伏流万三千里。斯诸臆说难以究详。河出积石西南流九屈。东北合流经析支地是为河曲。又东北入塞。过炖煌张棭南。是为河源矣。案此实录以寻河源。穷至无热池所。方为讨极。然此池神居非人所及。又是北天雪山之域。南接中土佛生之地。以处高胜故非边矣</p><p>五谓人者。不出凡圣。凡人极位名曰轮王。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>极位名曰法王。盖此二王不生则已。生必居中。又山川国邑人之依报。人胜则依胜。故此二王居焉。又轮王有四王约统四洲。金轮王者则通四有。银轮三方除北一洲。铜轮二方除西北方。铁轮在南除于三有。言赡部者。中梵天音。唐言译为轮王居处。言四轮王通局。乃殊住必南有也。古翻此洲。云好金地。谓阎浮檀金。在洲北岸海中。金光浮出海上。其傍有阎浮树林其果极大。得<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>者方至于彼。今言此洲轮王得名两设其致耳。又一此洲四主所统。雪山已南至于南海名象主也。地惟暑湿偏宜象住故。王以象兵而安其国。风俗躁烈笃学异术。是为印度国。然印度之名。或云贤豆。或云天竺。或云身毒。天笃等。皆传之讹僻耳。然以印度为正。唐无以翻。雪山之西至于西海名宝主也。地接西海偏饶异珍。而轻礼重货是为胡国。雪山以北至于北海。地寒宜马名马主也。其俗凶暴忍杀衣毛。是突厥国。雪山以东至于东海名人主也。地惟和畅俗行仁义。安土重迁是至那国。即古所谓振旦国也。上列四主且据一洲。分界而王以洲定中。轮王为正居中王边古今不改。此土诸儒滞于孔教。以此为中余为边摄。别指雒阳以为中国。乃约轩辕五岳以言。未是通方之巨观也。又指西蕃例为胡国。然佛生游履。雪山以南名<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>国。与胡隔绝书语不同。故五天竺诸婆罗门。书为天书语为天语。谓劫初成梵天来下。因味地肥便有人焉。从本语书天法不断。故彼风俗事天者多。以生有所因故也。胡本西戎无闻道术。书语国别传译方通。神州书语所出无本。且论书契可以事求。伏羲八卦文王重之。苍颉鸟迹其文不行。汉时许慎方出说文。字止九千以类而序。今渐被世文言三万。此则随人随代会意出生。不比五天书语一定。上以五义。以定中边。可以镜诸。余如隋初魏郡沙门灵裕圣迹记述</p><p>释迦方志遗迹篇第四</p><p>自汉至唐往印度者。其道众多未可言尽。如后所纪。且依大唐。往年使者则有三道。依道所经具睹遗迹。即而序之。其东道者从河州西北。度大河上曼天岭。减四百里至鄯州。又西减百里至鄯城。镇古州地也。又西南减百里。至故承风戍是随互市地也。又西减二百里。至清海。海中有小山。海周七百余里。海西南至吐谷浑衙帐。又西南至国界名白兰羌。北界至积鱼城。西北至多弥国。又西南至苏毗国。又西南至敢国。又南少东至吐蕃国。又西南至小羊同国。又西南度呾仓去关吐蕃南界也。又东少南度末上。加三鼻关东南入谷。经十三飞梯十九栈道。又东南或西南。缘葛攀虅。野行四十余日。至北印度尼波罗国(此国土吐蕃约为九千里)其中道者。从鄯州东川行百余里。又北出六百余里至凉州。东去京师二千里。从凉西而少北四百七十里至甘州。又西四百里至肃州。又西少北七千五里。至故玉门关。关在南北山间。又西减四百里至瓜州。又西南入碛三百余里至沙州。又西南入碛七百余里至纳缚波故国即娄兰地亦名鄯善。又西南千余里至析摩陀那故国。即咀末地。又西六百余里至都罗故国。皆荒城耳。又西入大流沙行四百余里。至 瞿萨呾那国东境(即汉史所谓于殿国也。都护所居汉之所守。东去长安九千六百七十里)其关名尼壤城彼土自谓于遁国也。周四千余里。沙碛太半寺有百余。僧出五千大乘学者。从关至媲摩川二百余里。有媲摩城中有栴檀立像高二丈余。极多灵异光明。疾者随痛以金薄帖像上便愈。其像本在憍赏弥国。是邬陀衍那王所造。凌空至此国。北曷劳落迦城有异罗汉。每往礼之。王初不信以沙土坌罗汉。乃告敬信者曰。却后七日沙土满城。于后二日乃雨宝满街。至七日夜果雨土填城。略无遗人。其先告者。预作地穴从孔而出。东趣媲摩像亦同至。有记云。法灭之时像入龙宫也。其曷劳城今为大堆王欲掘宝必遭风变。又于媲摩城西行三百三十里。方至国城王都。南十里有大寺先王所立。西南十余里寺有夹纻立像。从屈支国来。昔此有臣于彼礼敬。臣还本国遥念无已。像遂夜至乃舍宅为寺。都城西三百余里勃伽夷城。有坐像高七尺相好无比。首有宝冠光明时现。都城西百六十里。路中大碛惟有鼠壤形大如猬毛金银色。昔凶奴来寇。王祈鼠灵乃夜啮人马。兵器断坏自然走退。都城西五里许寺有浮图高百余尺。多现光相王感<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>数百粒。罗汉以右手举浮图。安之函内。乃下之无倾动也。都城西南十余里有瞿室[饥-几+夌]伽山(此云牛角)有寺像现光明佛曾游此为<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a><a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。记其建国崇学大乘。山岩石室有一罗汉。入灭心定待慈氏佛。数百年前崖崩塞户。其国南界接东女国。从国城西越山谷。行八百余里至</p><p>斫句迦国(即沮渠也)南境其国周千余里。佛寺十余僧徒出百。学大乘者。国南有山立多罗塔。松泉流茂石室深净。有三罗汉现入灭定。须发恒长僧常剃之。五印度僧有<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>者。多止此室。又北减三百里方至都城。周十余里山阜连属临带两河。又于国西北。上大沙岭度徙多河。五百余里至</p><p>佉沙国(即疏勒也)周五千余里寺数百僧数万。习小乘有部。地多石碛其俗生子押头匾[匚@虎]。从此南行山野石碛。五百余里至</p><p>乌铩国。周千余里都城周十余里。南临徙多河信<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。寺十余僧减千人习小乘学。城西二百余里至大山。岭上有塔。数百年前山崖自崩。中有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>冥目而坐。形甚伟大须发下垂。覆于肩面。国王以酥油灌之击揵捶。比丘高视曰。我师<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>波也。今始乃闻已<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>耶。又问释迦佛出世耶。告云已灭度矣。即升空化火焚身。其土出白瑿青玉等。从国城西度河登葱岭。东岗八百余里至福舍。其地在四山之中方百余顷。无树木有细草。缘如别说。又西南踰大岭至</p><p>朅盘陀国。周二千余里都城周五十余里。北背徙多河敬佛法。寺十余僧五百余。人小乘有部。其国东南大石室二口。各一罗汉入灭心定。经七百余岁。其须发生年别为剃。又西北行三百余里。方至王都。东南临徙多河山岭连属。又西少南登山。冰雪五百余里至波谜罗川。东西千余里南北百余里。或狭无十里。据南北大雪山间。地碱卤多石。草木希少绝无人住。川南越山有钵露罗国。此川在大葱岭上。赡部一洲地最高也。中有大龙池。东西三百余里。南北五十余里大卵出焉。其水西流至达摩悉帝国东界与缚刍河合。故此已西水并西流。东出一流。东北至佉沙国西界。与徙多河合。自此诸水皆东流也。龙池正南当无热池。北当千泉川。南当池大岭。名婆罗犀罗。南北三四百里。山地极高。池北即大葱岭也。水经云。高可千余里两边渐下。南北竖岭行数极多百余条矣。多有山葱崖险葱翠。因以名焉。岭南接大雪山。北至千泉。应有二千五百许里。东极乌铩西达活国。应三千余里。又从川西南入山险。七百余里至</p><p>商弥国。周二千六百里。土出雌黄国人信佛寺有二所僧亦少耳。北越达摩悉帝大石山。至</p><p>尸弃尼国。周二千余里山碛连野。又南越山河</p><p>至达摩铁悉帝国(一名镬侃国一名护密国)即睹货罗之故地也。在两山间。东西一千五百里。南北减百里。或狭不踰十里。东临缚刍河。寺有十余僧数盖少。城寺石像上。悬金铜圆盖众宝饰之。人有旋绕盖亦随转。人止便止。四周石壁莫测其然。有说圣力使之。或谓机关之秘。又西南登山入谷五百余里。至</p><p>屈浪拏国亦故地也。周二千余里少有信向。又西北踰岭三百余里。至</p><p>淫薄健国亦故地也。周千余里都城十余里。又西北山谷行二百余里。至</p><p>钵铎创那国亦故地也。周二千余里。都城山崖上周六七里。寺有四所僧亦少耳。山谷西行二百余里。至</p><p>呬摩呾罗国亦故地也。周三千余里山川相半。坚城数十。西越山谷三百余里。至</p><p>讫栗瑟摩国亦故地也。东西十余里南北三百里。都城周十五里。北至</p><p>钵利曷国亦是故地。广百余里南北三百余里。都城二十余里。又从讫栗国西越峻入洞。经川城三百余里至</p><p>瞢健国亦是故地。周四百余里都城周十六里。北度河至 阿利尼国亦故地也。周三百余里带缚刍河两岸。大城周十五里。东渡河至 遏罗胡国亦故地也。北临前河周二百余里。大城周十五里。又从瞢健国西行百余里。出葱岭西头也寻山而下至。于活国亦是故地。周二千余里王城周二十余里。其王突厥也。铁门已南诸小国多属突厥。地安平俗多信佛。寺十余僧数百。大小兼学。西至</p><p>縳曷国四五百里。东南越山谷诸城三百余里至</p><p>阔悉多国亦是故地。国周减千都城十余里。山多川狭极风寒。僧寺三所众亦少耳。东南入谷越岭度诸小城四百余里。至安呾罗缚国亦是故地。周三千余里。王城周十五里属突厥。寺有三所僧有数十。有育王一塔。山阜连属极寒厉也。从此西南上大雪山。婆罗犀罗岭东头。经三日行又至极顶。通望赡部一洲。诸山并皆四下。又寻岭下行亦三日。极峻曲谷凿冰而度。西经迦毕式国边城小邑数十。又西南数百里方至王都。又西少南一千三百里。越山川至 弗栗恃萨傥那国。广二千余里南北千余里。王城周二十余里信佛法。从此南行五百余里至</p><p>漕矩吒国(亦曰早利)周七千余里王城周三十余里。山川相半寺有百数。僧徒数万皆学大乘。育王塔十所。天祠数十计多外道也。土宜郁金香草。出兴瞿草生罗摩。印度川南境[禾*苗]那呬罗山。王城东南二千余里。至西印度伐刺拏国。方合北道南趣佛国</p><p>其北道入印度者。从京师西北行三千三百余里至瓜州。又西北三百余里至莫贺延碛口。又西北八百余里出碛至柔远县。又西南百六十里至伊州。又西七百余里至蒲昌县。又西百余里至西洲。即高昌故地。汉时宜禾都尉所治处也。后沮渠凉王避地于彼。今为塞内。又西七百余里至</p><p>阿耆尼国(即乌耆也)东西六百余里。南北四百余里。都城周六七里。僧寺十余。二千余人。并学小乘说一切有。戒行精勤食三净肉。从此黑岭胡类群分。重财轻义无礼无敬妇尊夫卑良贱一等。吉素凶皂以为服制。又西南行二百余里。踰一小山越二大河。川行七百余里至屈(居勿反)支国(即丘慈也)东西千余里南北六百里。城周十七八里。寺有百余僧五千余。并学小乘说一切有。如上三净俗大信佛。王城民宅多树像塔不可胜记。东境大城中有天祠。池龙时出。与牝马合而生龙驹。初生[怡-台+龙]悷子方驯驾。故国多善马。近王名金花者。感龙驭乘王。欲终时鞭触其耳因即潜隐。与人妇通生子骁勇。王构突厥杀此城人故令空荒。城北四十余里东昭怙厘寺。佛堂中有玉石方二尺。上有佛足迹。长尺八寸广六寸。斋日放光。王城西门外路左右。有立佛各高九十余尺。于此建场五年一会。西有阿奢理贰寺唐言奇特也。昔王外游观礼圣迹。母弟留守因自割势为防谗构。王深异之弟后遇人犍五百牛遂愍赎之。慈善根力男形欻生遂不入宫。王讶奇特故因置寺。又西经小碛六百余里至</p><p>跋禄迦国(古名姓墨又名函墨)东西六百余里。南北三百余里。王城周五十里。寺数十僧千余人并小乘学。西北行三百余里。度石碛至凌山。即葱岭北原也。水多东流。此路不得赭衣持瓠及声叫。有犯者龙能飞风雨沙。遇必皆没。山行自西四百余里至大清池(又名热海亦名碱海)周千余里东西长。四面有山行人祈福。又西北五百余里至素叶水城。周六七里商胡杂居。已西数十孤城亦尔。又西四百余里至千泉。泉涌多出方二百余里。南面雪山三垂平陆。又西百五十里至呾逻私城。又西南二百余里至恭敬城。又南五十里至</p><p>笯(奴故)赤建国。周千余里。又西二百余里至赭时国(唐言石国)周千余里西临叶河。又东南千余里至悚(敷世)捍国。周四千余里山周四境。又西行千余里至窣睹利瑟那国。周千四百里东临叶河。叶河出葱岭北。西北流又西北入大碛。应五百余里至飒末建国(唐言康国)周千六百余里南北狭。都城周二十余里处极险固。自此东南至弭末贺国(米国也)周绕四五百里东西狭。又西北至劫布咀那国(曹国也)周千四五百里东西长。又西三百余里至屈霜儞迦国(何国也)周同曹国而东西狭。又西二百余里至喝捍国(东安国也)周千余里。又西四百余里至</p><p>捕捍国(中安国也)周千七百余里东西长。又西四百余里至伐地国(西安国也)周四百余里。又西南行行五百余里至货利习弥国。顺缚刍河两岸东西可三十里。南北五百余里。又从飒魅建国西南行。三百余里至</p><p>羯霜那国(云史国也)周可千五百里。又西南二百余里入大山。山路绝险又少人物。东南山行三百余里至铁门关。左右石壁其色如铁。铁固门扉悬铃尚在。即汉塞之西门也。出铁门关便至</p><p>睹货逻国(古云吐出罗也)之故地也。南北千余东西三千余。东拒葱岭。西接波斯。南大雪山。北据铁门。缚刍大河中境西流。其中自分二十七国。僧以十二月十六日安居。由温热多雨故也。顺河北下至呾密国东西六百余。南北四百余。王城周二十余里。寺十数僧出千人。大有窣睹波(即古塔之别名如偷婆等)佛像灵异。又东至赤鄂衍那国。东西四百南北五百余。王城周十余里。寺五僧少。又东至忿露摩国。东西百余南北三百余。王城周十六七里。寺有二所僧百余耳。东至愉(朔俱)漫国。广四百余从百余里。王城周十余里。寺二所僧亦不多。西南临缚刍河。便至鞠和衍那国。广二百余从三百余。王城十余里。寺三所僧百余。又东至镬沙国广三百余从五百余。王城周十六七里。又东至</p><p>珂咄罗国。广从千余里。王城周二十余里。东接葱岭至拘谜陀国。广二千余里从二百余里。据大葱岭之中。王城周二十余里。西南临缚刍河国。南接尸弃尼国。南度此河至达摩悉帝等国。如前中道所引也。又从铁门南而少东。五百余里至(缚喝国。一道拘谜西南至)嚩伽浪国。广五十余里从二百余里。都城十余里。又南至纥露悉泯健国周千余里。都城周十五里许。又西北至忽懔国周八百余里。都城周十五里余。寺十余僧五百。又西至缚喝国广八百余。从四百余。北临缚刍河王城周二十余里。俗美其国詺为小王舍城。寺有百余僧二千余人。并小乘学。城外西南有纳缚(此云新也)寺在雪山北。作论诸师赞重此寺基业不替。像蓥名珍毗沙门像卫之。突厥叶护欲袭寺取宝。屯军寺侧夜梦天王长戟贯胸。可汗心痛因尔便死。堂中有佛澡灌受可升余。杂色炫耀金石难名。又有佛牙长寸余广八九分。色黄白而光净。佛扫帚者用迦奢草。长二尺余围可七寸。杂宝饰柄。三物斋日。法俗所感放大光明。有大浮图高二百余尺。金刚泥涂以宝庄之。有<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>时放神光。又诸罗汉入涅槃者示通立塔。虽有证果不现通者则不封树。王城西北五十余里有提谓城王城正北四十余里有波利城。各有浮图高三丈许。即释迦开元献糗长者发爪之所建也。佛以僧伽胝郁多罗僧僧却崎。又覆钵竖锡杖次第安布。立塔仪式令依崇建王城西七十里。迦叶波佛时所建浮图高二丈余。又从大城西南入雪山河三十余里。至锐末陀国广五六百里。纵百余里。王城周十余里。又西南行三百里至胡寔建国。广五百余从千余里王城周二十余里多山川。又西北至呾刺健国。广同前从五十余里。王城十余里西接波刺斯国界。又缚喝国东至忽懔国。于此东南至纥露悉泯健国。千余里于此北近缚伽浪国。东西五十余里。此国东北接活国。又从缚喝国南百余里至揭职国广五百余从三百余。都城周五里许。寺十余僧三百余人。并小乘学。陵阜相连东南入大雪山。六百余里出睹货罗故地。又至梵衍那国。广二千余从三百余里。在雪山中城依岩险。寺有数十僧数千人。学小乘出世部。王城东北山阿有大石佛。高一百五十尺。金宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。又东寺左有鋀石释迦立像。高百余尺。分身别铸合成。立之城东三里。寺有涅槃卧素佛。长千余尺亦金宝庄之。东南二百余里度大雪山东。寺有佛齿及劫初独觉齿。长五寸余广减四寸。又有金轮王齿长三寸广二寸。又有商诺迦缚娑(即商那和修传法第三师)大阿罗汉铁钵。受九升许。并九条僧伽胝绛赤色。设诺草皮之所绩成。以其先世于解夏日。持此草施僧福力所被。五百中阴身生恒服之。从胎俱出逐身而长。阿难度时变为法服。受具已后又变为九条。其齿钵等并金缄之。罗汉证灭入边际定智愿力故。留<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>待遗法尽。方乃变坏今已少损。信有征矣。大雪山东至小川泽东入雪山。踰黑岭至迦毕试国。周四千余里。北背雪山三垂黑岭。都城周十余里。寺有百余。僧六千余人。多学大乘。其王信佛岁造丈八银像自修供之。天祠数十异道千余人 王城东三里北。山下有大寺佛院。东门南大神王像。右足下有大宝藏。近有外王逐僧欲掘。神冠中鹦鹉鸟像奋羽鸣呼地动。王军皆仆起谢而归。寺北岭上有数石室。亦多藏宝。欲私关者。药叉变为师子蛇虫。来震怒之。室西三里大岭上有观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>像。诚愿者像示妙身。安言<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。城东南三十余里。曷逻怙罗寺。大臣所造以名目之。浮图高百余尺。昔臣夜梦令造浮图。从王请舍利也。及旦至宫。有人持舍利瓶。臣留舍利令人先入。乃持瓶登塔覆钵自开。安舍利讫。王使追之石已合矣。斋日放光流出黑油。夜闻音乐。城西北二百余里。大雪山顶有龙池。山下为龙立寺。塔中有佛骨肉舍利升余。有时烟起或如火猛焰。渐灭之时方见舍利。状如白珠绕柱入云还下塔中 城西北大河南岸。古王寺中有佛弱龄龀齿长一寸余 又此东南往古王寺。有<a href=\"/remen/fodinggu.html\" class=\"keylink\" target=\"_blank\">佛顶骨</a>一片。广寸余色黄白。发孔分明佛发青色。螺旋右萦。引长尺余卷可寸许</p><p>又西南古王妃寺。金铜浮图高百余尺。佛舍利升余。每十五日夜放光绕盘晓入塔中</p><p>城西南比罗婆络山(云象坚也)顶。盘石上起塔高百余尺。舍利升余。山北岩泉是佛受山神饭已。漱口嚼杨枝。因生今为茂林。寺号杨枝也。又从龙池东行六百余里。越雪山度黑岭。至北印度界。已前诸邑并名胡国。至此方合中间道也。其地名曰 滥波国(北印度所摄也。入天竺婆罗门地也)其五印度之境。周匝九万余里。三垂大海北背雪山。北广南狭如半月也。七十余国同一王命 滥波国者。在无热池西。倚北胡活国。东南三垂黑岭。北约雪山都城周十余里。寺十余僧数亦少。多学大乘。天祠数十异道特多。东南百余里踰大岭大河。至那伽罗曷国(属北印度古花氏城)广六百余长二百余里。山周四境都城周二十余里。寺多僧少。天祠五所。异道百人</p><p>城东二里有石塔高三百尺。编石突起雕镂非常。此即昔时值然灯佛。敷鹿皮衣发布掩泥之地也。经劫犹存。无忧王重法建此石塔以志之。每于斋日天辄雨花大众集观。西有佛寺次南小塔。是掩泥处。王避大路遂僻建立。城内大塔故基旧有。佛齿别塔高三丈余。云从空来既非人工。寔多灵异。城西南十余里有塔是佛自中印度陵空来降迹处。次东有塔。是昔值然灯佛买花处 城东南二十余里小石岭上塔高二百余尺。西南深涧瀑布飞流悬崖。东岸石壁大洞穴是龙王所居。门径狭闇。昔佛于此化龙留影。焕若真形。至诚请者乃暂明现。窟外方石有佛足迹轮相发光。窟西北隅塔者佛经行处。又侧发爪塔。又说蕰界塔。窟西大盘石上。有濯袈裟文。城东南三十余里有醯罗城。四周险固中有重阁。上安佛顶骨。周尺二寸其色黄白。发孔分明欲知<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。香泥印之随心而现。有佛髑髅状如荷叶。色同顶骨。有佛眼睛大如奈许。清白映彻。并七宝小塔盛前三迹。又以宝函盛而缄封。有佛大衣细毡黄色置宝函中。微有坏相。中有佛锡杖白铁作环栴檀为笴。宝筒盛之。近王恃力将入宫中。寻复故处斯五圣迹。王令五净行者执侍掌护。有须见者税一金钱。请仰税五科宝乃重观礼弥繁阁西北塔小而多灵。人以手触其上。铃震动。自此东南山谷中行五百余里至健陀逻国(北印度也)广千余里长八百里。东临信渡河。都城周四十余里。少空荒寺有十余。天祠百所异道杂居 城内东北故基是佛钵宝台经数百年。今在波斯王宫<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。城东南八九里卑钵罗树。高百余尺枝叶蒙密。昔四佛座下见有坐像。传云。贤劫诸佛皆坐其下。昔释迦如来于此坐已告阿难曰。后迦腻色迦王集吾骨肉在此。王后在南建塔基周一里半。金铜相轮二十五重。或云。四十层者举高五百五十尺。有舍利一斛。初有化牧牛人。林间造三尺小塔。王掷弃之。乃于大塔第二级下。石基之侧半现小塔。疾者归愈。其大塔东面石陛上。昔有金色蚁大如指如麦。相从啮石壁文如镂。厕以金砂作二加趺佛像。高四五六尺。又于南面石陛。画佛丈六之形。昔有二贫人。各施一金钱共画一像。请现神变。像即现胸以上。分为两身。下合为一。次南百余步白石佛像高一丈六尺。面北放光夜出绕塔。贼欲盗物像出迎之。贼退像还。大塔左右小塔数百。庄工极巧香音两异。仙圣旋绕。佛记此大塔。七烧七立佛法方灭。已烧至三今现营构。西有故寺并前王所立。诸大论师世亲菩萨。如意论师胁尊者等。造毗婆沙处。寺东北五十余里渡大河。至布羯逻伐底城。周十四五里。东有四佛说法塔。无忧王建之。高数百尺雕镂希世城北五里故寺东塔高数百尺。即菩萨舍千眼处。东有石塔高百余尺。梵释初作妙珍蓥饰。佛灭宝变金为石也 又西北行五十余里塔者。是佛化鬼子母处 又北五十余里塔者。是商莫迦菩萨(此云睒也)被王射处。又东南约二百里。跛鲁沙城北东二十余里。弹多落迦(即檀特也)山岭上塔。是苏达拏(云善牙也)栖隐之所。婆罗门捶男女处。流血涂地。今诸草木皆同绛色。岩间石室妃习定处 又西北行百余里。越小山至大山。南有一寺塔。僧学大乘。昔独角大仙为女乱处。沙城东北五十里大山。有大天祠。祠东南行百五十里。至乌铎迦汉荼城。周二十余里。南临信渡河。从此城北越山行六百里至</p><p>乌仗那国(北印度之正国也。古谓乌长)山谷相连周五千里。昔日轮王苑也。土宜郁金香。夹苏婆窣堵河。王城周十四五里。寺有一千四百僧有一万八千。并大乘学。今多荒少其习大乘。统文略义<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>传训有五部焉。一法密部。二化地部。三饮光部。四说一切有部。五大众部。天祠十余异道杂居 王都瞢揭厘城。其东五里大塔多瑞。是佛昔作忍仙为羯利(此云斗诤)王支解之处。城东北二百六十里。入大山至阿波逻龙泉。即前河源也。派流西南春夏合冻晨夕飞雪佛昔化暴龙。金刚以杵击崖。龙怖归依。请佛放雨乃许之。令人收粮。十二年一雨水灾。又泉西南三十余里。水北岸大石上佛伏龙已。留迹示之随心长短。顺流三十余里。有佛濯衣石袈裟文如镂。城南四百余里。醯罗山谷寻水逆流。东上花果缘崖。或闻諠话音乐声。方石相接。是佛昔闻半偈舍身处。城南二百余里。大山侧有摩诃伐那寺(此云大林)佛昔为萨缚达罗王(即一切施也)失国避地为贫人。故令缚送处。寺西北下山四十余里。有寺塔高百余尺。侧方石上佛足迹相放光照寺。为天说本生处塔下有石黄白津腻。是佛昔为闻法折骨写经处 又西七十里塔。是佛昔为尸毗迦王(此云舆也)割身代鸽处 又西二百余里。珊尼罗闇川萨裒杀地(言蛇药也)寺塔高八十尺。佛昔为帝释身作大蟒僵死。以施贫疫处</p><p>侧有苏摩塔。是佛变为苏摩蛇啖者病愈事。川北崖塔病求多愈。又侧有涌泉。佛昔为孔雀王。[此/束]啄而出用救疾处 城西南七十里大河东。塔高六十尺。是嗢呾罗犀那(言上军也)王所造。佛令以舍利与王分在河滨立塔。王以白象负归象变为石。城西五十余里渡大河。有卢醯呾迦塔(言赤也)高五十余尺。佛昔为慈力王。刺血饮五药叉处 城东北三十里。遏部多(言奇特也)石塔高四十尺。佛为人天说法。塔从地出现即存焉 又西渡大河四十里寺精舍有阿缚虑枳抵(云观也)伊湿伐罗(云自在也)菩萨像(即观世音者)感灵远照此西百五十里山岭。龙池周三十余里。王城东北踰山谷。逆上信渡河。途路极险。乘緪栈梁锁杙蹑蹬。千有余里至达丽罗川。鸟仗那旧所都也。大寺中有刻木梅呾丽耶(古云<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>唐言慈氏)菩萨像。金色晃朗高百余尺。末田底迦(即末田地)阿罗汉所造。以通力引匠升睹史多(即兜率也)天。三返观相乃成其好。自有此像法方东流也。东行越岭逆信渡河。履险飞梁五百余里渡河。又东渡缚刍河登危至</p><p>钵露罗国。周四千里大雪山中。东西长寺数百。僧数千。学师戒行多滥。其国非印度所统。多冰雪其土出金如火色。北对婆罗犀罗大岭。还从健驮逻国。乌铎迦城南。渡信渡河。广四里许。西南流清澄如镜。毒龙恶狩窟穴其中。有持舍利宝花者船多沉没。渡河至呾叉始罗国(北印度也)周二千余里。都城周十余里。寺多增少并大乘学</p><p>城西北七十余里。有伊罗钵龙池。周百余步。池东南三十里。两山间塔高百余尺。佛昔记慈氏兴世。四大藏者此地出一。故有振动。斯周百步曾无一摇。有欲发者地振人仆。城北十二里塔于斋日常放神光。仙花天乐。近有癞者。塔于礼忏除秽涂香。不久便愈身又香洁。昔佛为战达罗钵刺婆王(云月光也)以头施处。凡经千施即塔。名月光也 城东南山塔高十丈许。决目王所治育王所造。又东南越山谷七百余里。至</p><p>僧伽补罗国(北印度也)周三千五百里。西临信渡河。大城周十四五里。城东五十里。有石塔高二十余丈佛所游处。池沼十余。四色莲花弥覆其内</p><p>从此南返至呾叉始罗国北界。渡信渡河东行二百余里。渡大石门。是摩诃萨埵王子舍身饭虎处。东有寺僧百余。又南百五十里石塔者。萨埵以竹自刺血啖兽处。地及草木今犹绛色。次北石塔高二十余丈。放光开信病归多愈。又东五十余里。孤山有寺塔高二百余尺。僧徒二百人并大乘学。佛昔化药叉不食肉处。又东南山行五百余里。至</p><p>乌剌尸国(北印度也)周二千余里。山阜相属。都城周十八里。不信佛法。属迦湿弥罗。有佛塔高二十余丈。育王所造。有寺僧少学大乘教。又东南登山铁桥千余里至</p><p>迦湿弥罗国(北印度也古曰罽宾)周七千里四面负山。虽有门径狭而劣通。城西临大河。长十三里广四里许。寺百余僧五千余人。土出龙种马郁金火珠。有四浮图各有舍利一升余。佛灭后第四百年。胁尊者年八十方<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>证无学。将五百罗汉来此造十万颂。邬波弟铄释素呾缆藏(即优婆提舍论。修多罗藏。异名也)次造十万颂毗奈耶毗婆沙论。次造十万颂阿毗建摩论。凡六百六十万言。备释<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。新城东南十余里故城北大山阳寺塔。僧徒三百人佛牙长寸半。色黄白斋日便放光。又南十五里有观自在菩萨立像。有愿见者断食便睹。王城西北二百余里至商林寺</p><p>城西五百十里大河北接山。有寺僧百余人。从此西南越山行七百余里至。半笯蹉国(北印度属罽宾)周二千余里。寺有五所多山川。东南行四百余里至遏逻阇补罗国(非正北印度乃荒服国也)周四千余里。都城周千余里。寺十所僧甚少。天祠一外道甚多。自滥波达此形体鄙薄。非印度之正境也。从此下山东南行。并是大川达远无畔。惟以河国而分界部。虽有小山并是孤住。自此以北通连雪山。东达神州凉部以南诸雪山也。案此山亦即赡部之巨镇地者。于此城东南下平。渡水行七百余里。至</p><p>磔迦国(北印度也)周万余里。东据毗播奢河。西临信渡河。都城周二十余里。俗少信佛多事天神。寺有十余天祠数百。城西南十五里奢羯罗故城。寺塔高二十余丈。昔四佛说法经行处。又西北六里许。塔高二十余丈。亦四佛说法处 新都城东北十余里。石塔高二十余丈。多有舍利斋日放光。东行五百余里至</p><p>那仆底国(北印度)周二千余里。都城周十四五里。寺十天祠八。城东南五百余里。至阇林寺周二十余里。佛<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>数百千区。并石室等。僧有三百人。学小乘说有部也。<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>清高小学之博。贤劫千佛并此说法。释迦灭后第三百年。迦多衍那(迦栴延也)于此造发智论。寺塔高二十余丈。有四佛行坐迹处。从此东行百五十里至阇烂达那国(北印度也)东西千余。南北六百里都城周十余里。寺有五十。僧二千余人大小专门。天祠三所外道五百人。东北越山七百余里至</p><p>屈露多罗国(北印度也)山周四境。都城周十四五里。寺二十余僧千余人多大乘学。天祠十五异道杂居。出火珠雨石。俗瘿且尰。城内有塔记佛曾游于此说法。自斯北行近二千里。山路危险至洛护罗国(北印度也)又北山行二千余里。雪寒更甚。达秣逻娑国(又名三波诃北印度摄)又从窟露罗南行七百余里。越山济河至</p><p>设多图卢国(北印度也)周二千余里西临大河。都城十七八里。佛法大盛城内外寺十所僧亦少耳。城东三里塔高二十余丈。育王所造。傍有四佛行坐迹。自此西南行八百余里。至波狸夜呾罗国(入中印度也)周三千里都城周十五里。寺有八所僧亦少耳。俗信外道。天祠十所异道千余。土有稻种六十日收。东行五百余里至</p><p>秣菟罗国(中印度也古云摩偷罗)周五千余里都城二十余里。寺二十余僧二千余人。大小兼学。天祠五所异道杂居。土植庵没罗果。小者生青熟黄。大者始终青色。城中三塔。四佛遗迹甚多。及<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>。没特伽罗子(谓目干连也)满慈子(富娄那也)优婆厘(优波离也)阿难陀。罗怙罗。曼殊室利等诸塔。每三长月六时。诸僧尼集阿毗达磨众。供养舍利弗塔。习定众供目犍连塔。诵经众供满慈塔。毗奈耶众供优波厘塔。尼众供阿难塔。未具众供罗怙罗塔。大乘众供诸菩萨塔。寻斯诸塔不必遗身。但立像设供用呈心造。如罗怙文殊未取灭度则可知矣。城东六里有山崖寺。是尊者乌波鞠多(云近护也)之所造也。有佛指爪塔。寺北石岩室高二丈广三丈。细筹四寸填之。近护导<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>俱证罗汉者。送一筹乖此不在室记。又室东南二十余里。大涸池侧有塔。佛曾游此有猕猴持蜜施佛。佛令水和遍众同饮。猴喜堕坑而死。便生人中。池北林中四佛经行处。大有遗迹。又东北五百余里至萨陀泥湿伐罗国(中印度也)周七千余里都城周二十余里。寺有三所僧七百人。皆小乘者。天祠百余异道甚多。城西北四里塔高二十余丈舍利一升时放大光。城南百余里至佛寺。又东北四百余里至</p><p>窣禄勒那国(中印度也)周六千余里。少荒东境临殑伽河(即古恒河)北接大山城东南阎牟挪河。从国西北山中出中境而流。都城周二十余里东临阎牟河。寺有五所僧千余人多小乘学。天祠百余异道甚多。河西大寺东门外塔。佛曾于此说法度人。其侧有佛发爪塔。阎牟河东八百余里至殑伽源。广三四里。东南入海广十余里。水色沧浪味甘沙细随水而流。俗谓福水有沐除罪。或有轻命自沈。云生天受乐。有僧伽罗国提婆菩萨。化外道受<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>处。渡河东至</p><p>秣底补罗国(中印度)周六千余里都城周二十余里。不信佛而敬天。寺有十余僧八百人多小乘者。天祠五十余异道杂住。国西北境殑伽东岸。摩裕罗城周二十余里。出鋀石水精。城侧临大河。有大天祠多有威灵。有池编石为岸引河为浦。五印度以为殑伽河门生福灭罪处。常有百千人澡濯。从摩裕北行三百里。至</p><p>婆罗吸摩补罗国(北印度)周四千余里山周四境。都城周二十余里寺五僧少。天祠有十异道杂住。国北大雪山有苏伐剌拏瞿呾罗国(言金氏也)出上黄金。东西地长即东女国。非印度摄。又即名大羊同国。东接土蕃西接三波诃。北接于阗。其国世以女为王。夫亦为王不知国政。男夫征伐种田而已。又从末底补罗国东南行四百余里至</p><p>瞿毗霜那国(中印度)周二千余里都城十四五里。寺二所僧百余人而习小乘。天祠三十余异道杂住。城固险峻。其侧古寺塔高二十余丈。佛曾于此一月说法。有发爪二塔各高丈余。旁有四佛坐迹。又东南行四百余里。至垩醯掣呾逻国(中印度)周三千余里。都城周十七八里。寺十余所僧有千余。习小乘正量部。天祠有九外道三百余人。城依险固其外池侧。佛为龙说法七日处。立塔侧有四佛行坐迹。立塔表之。又南二百七十里渡殑伽河。西南至毗罗删拏国(中印度)周二千余里都城周十余里。信外道少敬佛法。寺二所僧徒三百人皆大乘学。天祠五所。城中寺塔高十余丈。佛曾于此七日说蕴界法。四佛行坐遗迹尚存于此。东行二百余里至</p><p>劫比他国(中印度古僧伽舍也)周二千余里。都城周二十余里。寺有四所僧千余人。天祠十所同事大自在天。皆作天像。其状人根形甚长伟。俗人不以为恶。谓诸众生从天根生也。城东二十余里大寺中僧数百人。净人数万头皆宅寺侧。大垣内有天帝造<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>阶。中阶黄金。左以水精。右用白银。南北而列东面下地。是佛从逝多林(即只陀林)升天善法堂。为母三月说法下降处。百年前阶尚在。今并没尽。后王仿之。犹高七十余尺。上起精舍 侧有石柱光润映现。随其罪福影出柱中。育王所造阶侧浮图。四佛行坐迹也。佛澡浴处立塔。其所有佛入室精舍。又其侧佛经行石基。长五十步高七尺。足所履处皆莲花文。基左右小塔梵王所造</p><p>次前是莲花尼化为轮王先见佛处。佛告尼曰非汝先也。有苏部底(须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>也)宴坐石室。知诸法<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>吾法身。次东南池有龙居焉。恒护圣迹不可轻犯。从此西北减二百里至</p><p>羯若鞠阇国(中印度曲女城也)周四千余里都城西近殑伽河。长二十余里广四五里。邪正相半寺百余。僧徒盈万大小兼学。天祠二百余所。异道数千人。即统五印度之都王也。号尸罗逸多(言戒日也)吠奢姓。初欲登位。殑伽岸有观自在像。乃请之。告曰。汝本此林兰若比丘。金耳月王既灭佛法。王当重兴愍物在怀。方王五境慎勿升师子座及称大王号也。王乃共童子王。平殄外道月王徒众。又约严令。有啖肉者当截舌。<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>当斩手。乃与寡妹共知国事。于殑伽侧建千浮图。各高百余尺。城邑乡聚达巷交衢。立精舍储食。止医药惠羁贫。圣迹之所皆为立寺。二十年来五年一会。倾及府藏拯济群有。惟留兵器用备不虞。初作会日集诸国僧。三七日中四事供养。令相论议。若戒行贞固<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>优洽者。升师子座王便<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。清净无学示有崇仰。秽行彰露者。驱出国界。诸有王臣植福无怠者。携手同坐。异此不顾。王巡省方俗不常其居。行必四兵导引严设。泛舟乘象击鼓吹螺。象军八万以威四远惟两三月不外游行。宫中每日饭诸沙门。僧有千人婆罗门五百。日分三时一时理务。两时营福。又绝血食。日例一顿。于河西寺东起宝台高百余尺。中有等身金像。次南起宝坛浴佛像处。于此东北十五里许。别筑行宫从寺至宫。夹道为阁穷诸雕饰。乐伎不移递奏而已。又以三尺隐起金像。载以大象宝幰其上。王为帝释像执宝盖左侍。有迦摩镂波国拘摩罗王(言童子也)作梵王像执拂右侍。各五百象军被铠同卫。前后各百大象。乐人于上鼓奏音声。戒日王又以真珠杂宝金银诸花随出四散供养三宝。其五印度尼寺稀少。纵有尼者与僧同门。食亦同处无亏戒约。然童子王刹帝利姓。语使人李义表曰。上世相承四千年。先人神圣从汉地飞来。王于此土。城西北塔育王所造。昔佛于此七日说法。其侧有发爪塔。四佛行坐迹。又南临殑伽河。三寺同垣异门。佛像严丽。佛牙长寸半。光色变改宝函盛之。远近瞻者日有百千。守者烦挠重税金宝。而乐礼者不辞重货。斋日便出置高座上。散花虽积牙函不没。寺僧清肃净人数千户。寺前左右精舍高百余尺。石基甎室中像宝庄或纯金银 次东南大精舍。石基甎室高二十余丈。是佛六月说身<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦空不净处。又有四佛行坐迹。在城东南六七里。殑伽南岸上。城东南百余里。有纳缚提婆城。据殑伽河东岸。三寺同垣异门。周二十余里 次前二百余步。塔高二十余丈。佛曾七日说法处。中有舍利时放光明。其侧四佛行坐迹。寺北四里临殑伽岸。塔高二十余丈佛曾七日说法。四百饿鬼解悟生天。其侧又有发爪塔。次侧又有四佛行坐迹。又东南行六百余里渡殑伽河南至</p><p>阿输陀国(中印度)周五千余里都城周二十余里。寺有百余僧三千余人。大小兼学。天祠有十异道少耳 城中故寺是伐苏畔度菩萨(言世亲也)数十年中作大小乘论处。城北五里殑伽岸。大寺中塔高二十余丈。佛为天人三月于此说法。侧有佛塔四佛行坐迹。寺西五里有佛发爪塔。城西南五里。大庵没罗林中故寺。是阿僧伽菩萨(云无著也)夜升天宫。于慈氏所受瑜伽庄严大乘经论及中边等。晓为众说。林西北百余步佛发爪塔。自此东行三百余里。度殑伽北至</p><p>阿耶穆佉国(中印度)周二千五百里。都城临河周二十里。寺五所僧千余人习学小乘。天祠十所异道杂居 城东南临殑伽。塔高二十余丈。佛曾三月说法处。有发爪青石塔。有四佛行坐迹。又东南行七百余里渡殑伽河。南阎牟那河北至</p><p>钵罗伽耶国(中印度)周五千余里都城据两河交。周二十余里寺二僧少。天祠数百异道特多。城西南临阎牟河曲二三千里。东北流合间有瞻博迦花。林中塔高十余丈。佛曾于此降外道处。有发爪塔经行迹。又有提婆菩萨作广百论处 城中天祠堂前大树枝叶蒙密。食人鬼依之。左右遗骸为[廿/积]。人至祠中无不轻命。上树投下为鬼所诱 城东两河间交广十余里。土地平垲细<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>布。古今王豪诸有舍施莫不止焉。号大施场。戒日大王亦修此业。场东合流口。日数百人自溺而死。彼俗名为生天所也。有欲行法七日于此绝粒。自沈中流远近相趣。乃至山猿野鹿。群游水滨绝食沉水。当戒日王行施之时。有二猕猴雌为狗杀。雄者负尸掷此河中。其又自饿累日而死。自此西南大林野行。五百余里至憍赏弥国(中印度)周六千里都城周三十余里。寺十余僧三百余人。天祠五十外道众多。城内故宫大精舍。高六十余尺。刻檀佛像上悬石盖。即邬陀衍那王(古优陀延也唐云出爱)之所造也。灵光间起。诸王以力欲举。终莫之移。昔佛为母上天说法。王请目连神力接工。就天摸相。及佛下天像便起迎。佛慰喻曰方为佛事。舍东百余步。四佛行坐迹。佛浴室井今犹充汲。城内东南隅具史罗长者宅。有佛精舍发爪塔。其大塔侧又有四佛行坐迹 城西九里石窟。佛曾游此伏毒龙也。侧有大塔高二十余丈。旁有佛经行迹及发爪塔。病求多愈。释迦遗法灭在此国。贵贱入境自然感伤。窟东北大林中行七百余里。度殑伽北岸至迦奢布罗城。周十里许。是<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>菩萨伏外道处。塔高二十余丈。佛曾于此六月说法。有经行迹及发爪塔。自北行一百八十里至鞞索迦国(中印度)周四千余里。都城周十七里。寺二十僧三千人。天祠五十外道巨多。城南道左右。寺塔高二十余丈。佛曾于此六年说法。侧有奇树高七十尺。春冬不改是佛齿木弃而茂生。诸邪见者竞来残伐寻生如故。侧有四佛行坐迹并发爪塔。基角相连林池交影。自此东北五百余里。至 室罗伐悉底国(中印度即舍卫也)周六千余里都城荒毁。故基周二十余里。寺数百僧徒少。天祠百余外道甚众 荒城故殿东基上小塔。是钵罗犀那恃多王(古云波斯匿唐言胜军也)为佛造堂处。次侧故基上塔。是王为佛姨母钵罗阇钵底(古云波阇波提此云生主)<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>造精舍处。次东塔是苏达多(云善施也)之故宅也。侧有大塔。是鸯寠利摩罗(言指鬘也)舍邪处也。城南六里许逝多林。是给孤园太子所造寺也今荒废尚有石柱。高七十余尺育王造之。甎室一存余并湮没。室中有为母说法金像。东北有佛洗病僧塔。西北有目连举身子衣塔。不远并塔佛所汲用。又舍利弗与佛经行道说法处并有表塔。灵药异香常降其所。又外道杀女以谤佛处。立塔表之。寺东百步大深坑。是调达欲毒害佛生陷处。南有大坑。是瞿伽离比丘毁佛生陷处。又南八百步大深坑。是战遮婆罗门女毁谤佛生陷处。此三坑皆洞达无底。洪雨大注终无停偃 寺东七十步精舍名曰影覆。高六十尺中有东面坐像。与外道论处 次东天祠量同精舍。初日影西不蔽佛舍。晚日荫东遂覆天祠</p><p>又东四里大涸池。是毗卢释迦王(旧云流离也)陷入地处。后人立塔记之 又有身子初造寺时与外道捔处。亦立塔记</p><p>寺西北四里有得眼林。中有佛经行迹塔。其缘胜军王抉五百贼眼。闻佛慈力一时平复。舍扙遂生。城西北六十里故城。是人寿二万岁时。迦叶波佛本生处。其北有塔。即此佛全身舍利之所。育王造塔表之 又东南行五百余里。至</p><p>劫比罗伐窣堵国(中印度古云迦毗罗也)周四千余里空城十数并无人住。宫城周十五里许。以甎成之。故寺千余宫城一。寺僧三十余。天祠二所外道杂住。城内正殿基上。精舍中作王像</p><p>其侧是摩诃摩耶(言大术也)夫人寝殿基上。精舍作夫人像。其侧精舍中作菩萨像。神降之相彼执不同。上座部云。当唐国五月十五日。诸部又云。当此五月八日。此盖闻见之异耳。其侧有仙相塔。城南有塔。是太子捔力掷象。越城堕地为大坑处。侧有精舍作太子像及受业像 其傍精舍是妃寝处。作耶输陀罗并罗怙罗像 别本云。太子初夜开城北门出去。又城东南隅精舍中。作太子乘白马凌空踰城处 四城门各有精舍。作老病死沙门像。城南四里尼拘卢林塔。佛得道与天人说法之所 城南五十里故城中塔。是人寿六万岁时。迦罗迦村驮佛本生城。城东南塔即此佛遗身也。无忧王于前建石柱高三丈余</p><p>又东北三十余里故城中塔。是人寿四万岁时。迦诺迦牟尼佛本生城。城东北塔即此佛遗身也。无忧王为建石柱铭记之。高二丈余 城东北四十余里。有太子坐树下塔。大城西北数百千塔。是诛释子塔。有四释子拒军。城人不受被放出境。一为乌仗王。三为梵衍等王。至今不绝 城南尼拘律树塔。是佛初来见父王处 城南门外塔。是捔射处。东南三十余里。是太子射矢没地因涌泉流。俗傅箭泉病饮多愈。或持泥傅额随苦皆愈。又东北九十里腊伐尼林。释种浴池花水相映。其北二十五步无忧花树。今已枯悴<a href=\"/remen/fodan.html\" class=\"keylink\" target=\"_blank\">佛诞</a>处也。有说云。当此三月八日者。上座部云。当此三月十五日者 次东有塔二龙浴太子处。初佛生已不扶而行四方各七步。所蹈之处出大莲花。既右胁生天帝衣接。四王捧之置金几上。凡施四塔并立石柱表之。旁有小河东南而流。俗号油河。是太子产已。天化此地光润令沐。以除风虚今变水河。尚腻如油。从此东行二百余里。荒林中至</p><p>蓝摩国(中印度)多空城。东南佛塔减百尺。昔初八分之一舍利也。灵光时起侧有清池。龙变为蛇出绕其塔。野象采花以散之。无忧王欲开龙护不许</p><p>又东大林百余里大塔。是太子至此解宝衣中末尼珠。付阐铎迦还父王处 又东有赡部树枯株尚在。有小塔是太子以余衣易鹿皮处。其侧塔者剃发处。年自不定或云十九。二十九者 又东南野行百九十里。尼拘陀林塔。高三丈余。昔人于佛焚地。收余灰炭于此起塔。病者祈愈。有四佛行坐迹。塔高百余尺。左右数百小塔。又东北大林路险五百里。至</p><p>拘尸那揭罗国(中印度)城颓荒人物少也。内东北角塔是准陀故宅。其井犹美营供所穿。城西北四里。度阿恃多伐底河。此云有金也。近西岸娑罗林。两林间相去数十步。中有四树特高。大甎精舍中。作佛涅槃像。北首而卧。旁塔高二百余尺。前有石柱记佛灭相。有云。当此土三月十五日者。说有部云。当此九月八日。诸部异议云。至今贞观二十年。则经一千二百一十二年矣。此依菩提寺石柱记也。或云。千三百年。或千五百余年。或云。始过九百未千年者。精舍侧有佛。昔为雉王救火及鹿救生。各立一塔次西塔者。是苏跋陀罗(言善贤也)灭证处。次有一塔是执金刚神躄地处。次侧一塔是停棺七日处 次侧一塔是阿泥楼陀上天。告母降来哭佛处 城北度尼连禅那河。三百步塔者。是佛涅叠般那(言焚烧也)处也。地今黄黑土杂灰炭。有祈感者咸获舍利。次侧一塔佛为大迦叶波现双足处。次又一塔前立石柱。刻记八国分舍利事。此西南行二百余里至大邑。又大林行五百余里。至</p><p>婆罗痆(女黠)厮国(中印度古波罗奈也)周四千余里都城西临殑河。长减二十里广六里许。人居盛满多信外道。寺三十余僧三千余并小乘正量部。天祠百余外道万余。多事大自在天根也。大城中天祠二十所。天根高百余尺。城东北婆罗痆河。西塔育王造。高十余丈。前立石柱碧藓现佛 河东北十余里鹿野寺也。区界八分连垣周堵。层轩重阁僧徒一千五百人。并小乘正量部。有佛精舍高二十余丈。甎龛四合节级百数。皆隐起金像鋀石佛等。次西南塔高百余尺。前有石柱高七十余尺。洞澈清净诚感像现。随其善恶。即成道已。初转法轮处 其侧三塔。即昔三佛行坐处。傍有诸塔。五百独觉入灭处。又侧一塔。慈氏菩萨受记处。又西一塔是佛过去。为护明菩萨。迦叶波佛授今<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>处 次南四佛经行处。长五十步高七尺。青石积成上作释迦经行像。像形特异肉髻上髾。发头抽出神而有征。寺迹极多精舍浮图。乃数百事不可具也。寺西清池周二百步佛尝盥浴 次西小池佛尝涤器 次北小池佛尝浣衣。三池龙止味甘且净。有慢触者。金毗罗兽即而害之。侧有方石。上有佛袈裟文迹。外道凶人有轻蹈者。池龙辄兴风雨</p><p>侧有浮图。佛曾作六牙象王。见猎者被法衣故拔牙与处 侧又一塔。佛昔为鸟与猕猴象相问谁大处 又大林中塔。佛与调达昔为鹿王。佛代孕鹿命处。鹿野之号因而生焉 寺西南三里。大塔高三十丈基峙壮丽。侧又一塔。是五人迎佛处。大林东三里塔者。佛昔为兔与诸兽聚。自知形小烧身馈之。因感天帝下赞。故使月轮有兔像现。寺东顺殑伽河三百余里。东至战主国(中印度)周二千余里。都城临殑河周十余里。人盛满寺十所。僧减千人并小乘。天祠二十所异道杂居。城西北寺塔佛舍利一升。昔佛于此七日说法。并四佛行坐迹。有慈氏菩萨像。形小而威德大。城东北二百余里至阿避陀羯赖拏寺(云不穿耳)<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>北方僧也。寺东南渡殑河百余里至大邑。河北岸那罗延天祠重阁甚严。又东南三十余里有降鬼塔半已陷地。前建石柱高二丈余。即佛为啖人鬼说法处。鬼置石座千数。茂林清池不远。数寺皆有僧住学大乘者。又东南渡河百余里塔者。即分舍利瓶及余舍利也。每斋日放光。又东北渡殑伽河百五十里。至</p><p>吠舍厘国(中印度古云毗舍离也)周五十余里。邪正兼半寺数百。现存五三僧少耳。天祠数十露形多之。城已颓毁故基周七十许里。宫城周五里许。少人居住。宫城西北六里。寺塔是说净名处</p><p>又东身子证果塔 又东大塔是王得一分舍利一斛许。无忧王取九升。均造余塔。后更有王欲开。地震遂止。西北有塔石柱高六丈。次南猕猴为佛穿池。池西群猴持佛钵。上树取蜜处 池南猴奉蜜处。各有塔记。寺东北四里许塔。是净名故宅基尚多灵神。其舍叠甎。传云积石。即说法现疾处也。近使者王玄策以笏量之止有一丈。故方丈之名因而生焉。并长者宝积宅。庵罗女宅。佛姨母入灭处。皆立表记 寺北四里塔。佛将往拘尸天人送立处 次复一塔。是佛最后观城邑处</p><p>次南是庵罗女以园施佛处。其侧一塔。是佛三告阿难住寿涅槃处 又侧一塔。是千子见父母处。即贤劫千佛也 东故重阁讲堂基塔。时放光明。是佛说普门经处</p><p>城西北六十里大塔。是佛别栗呫婆子处</p><p>大城西北减二百里故城塔。佛说本生。曾于此为大天轮王事</p><p>国城东南十五里大塔。是七百贤圣重结集处 又南减百里。大寺层台重起。僧学大乘四佛行坐迹 侧又一塔。是佛南趣摩揭陀。北顾吠舍厘城中息迹处 寺东三十里。殑伽河南北岸各一塔。是阿难陀分身与二国处。从北岸东北行五百余里。至</p><p>弗栗恃国(北印度也人谓三伐恃)周四千余里。东西长。寺十余僧减千人大小通学。天祠数十外道众矣。故宫城中有三千家。殑伽东北岸塔高二丈余。南望长流。佛度五百渔人处。由捕得大鱼十八头。头各两眼 又东北百余里故城西。塔高百余尺。佛尝六月说法度人。又北百五十里佛发爪塔。又西北千五百里。入山谷至</p><p>尼波罗国(北印度)周四千余里在雪山中。都城周二十余里。杂信寺及天寺极多。僧二千余人。大小兼学王纯信佛。城内有阁高二百余尺。周八十步上容万人。面别三叠叠别七层。俳徊四厦刻以奇异。珍宝饰之</p><p>城东南不远有水火村。东一里许有阿耆波沴水。周二十步。早涝湛然不流常沸。家火投之遍池火起。烟焰数尺。以水洒火火更增炽。碎土以投。亦即燃尽。无问投者并成灰烬。架釜水上煮食立熟云。此水中先有金柜有国王将人取之。柜已出泥人象挽之不动。夜神告曰。此是慈氏佛冠。下生拟着不可得也。火龙所护。城南十余里孤山特秀。寺居重叠状若云霞。松竹鱼龙随人驯附。就人取食犯者灭门。比者国命并从此国而往还矣。今属吐蕃又从吠舍。南百五十里渡殑伽河至摩揭陀国。即常所谓摩竭提王舍城也</p><p>释迦方志卷上</p><p>释迦方志 卷下</p><p>终南太一山释氏</p><p>遗迹篇之余游履篇通局篇时住篇教相篇</p><p>释迦方志遗迹篇第四之余</p><p>摩揭陀国(中印度也古者讹耳)周五千余里。城少人居邑落极多。寺五十余。僧徒出万多大乘学。天祠数十异道甚多。故城在王舍城山北。倚东二百四十里北临殑伽河。周七十余里人寿多岁。时号拘苏摩补罗城。言香茅华宫也</p><p>人寿数千岁时。更因波吒厘树名波吒厘子城。古名巴连弗者讹也。故宫北石柱高数丈。无忧王作地狱处。佛涅槃后第一百年。有阿输迦王(言无忧也)即频毗婆罗王之曾孙。自王舍城迁都此城。重筑外郭。出异种稻。粒大而美光色奇异。名供大人米也。宫北临殑伽河小城千余家见存其狱石柱。南大塔宝饰覆钵石作栏槛。即八万四千之一也。安佛舍利一升。时有光瑞即无忧遇近护罗汉。役使鬼神所营。其侧精舍中有大石。是佛欲涅槃。北趣拘尸南顾摩揭。故蹈石上之双迹也。长尺八广六寸。轮相华文十指各异。近为羯罗拏苏伐刺那言金耳国。设偿迦王言月也。毁坏佛迹凿已还平文采如故。乃捐殑河中寻复本处。次侧有四佛行坐塔</p><p>故宫北大石室。即育王为弟所造。次有大水槽育王饭僧者。宫西南小石山。周岩涧谷数十石室。育王为近护罗汉役鬼所为。傍有石池俗名圣水。饮者病愈。山西南五塔面各数百步。育王建八万四千塔已。尚余五升舍利更造此塔。灵异间起。有王将此作难陀王五藏兴军掘之。地震山倾塔中大呼。士卒僵仆。故城东南屈屈吒阿滥摩寺(言鸡园也)昔有论议屈于外道。十二年来不击犍捶。有南印度那伽阏刺树那菩萨(此言龙猛或云龙树)来至伏诸外道始击犍捶。故塔名击犍捶也</p><p>次北有鬼辩塔马鸣事</p><p>城西南隅二百余里。古寺塔中四佛行坐迹。又寺西南百余里。大寺僧徒千数并学大乘。合有四院。观阁三层崇基重户。中间三精舍金铜隐起。中有立像高三丈。左多罗菩萨右观自在。并鋀石铸成。三所各有舍利一升光相时起。寺西南百里。大山上石塔高一丈余。佛于大盘石上入定。经宿诸天雨光以感慕。故起宝塔高一丈许。今变为石。惟遥望见烟霞。止居灵圣龙蛇窟穴鸷鸟猛兽。古今无人达者。山东岗塔佛于此立观摩揭国处。山西北三十余里。山寺负岭疏崖置阁。大乘学瞿摩末底菩萨。唐言德慧。伏外道处。今有僧五十余人</p><p>又西南二十余里孤山寺。有论师尸罗跋陀罗。唐言戒贤。今见在初伏外道得邑舍而造之。其处竦一危峰。如浮图形置佛舍利</p><p>又西南五十许里。度尼连禅河有伽耶城。少人物婆罗门千余家住。仙人之胤也。王所不臣众咸加敬。城北三十余里清泉。俗传圣水。饮濯之者罪消也</p><p>城西南六里许。伽耶山也。溪谷杳冥世谓灵岳。自古君王登封告成也。顶有石塔高百余尺。时放奇光。佛于此说宝云等经</p><p>山东南尼连河减二里许。至钵罗笈菩提山。言前正觉也。佛将证先登因名也</p><p>佛自东北岗上顶。欲入金刚定振地投山神惧告。佛又至西南半崖中面涧坐石。地山又震。净居天告曰。此西南十五里近苦行处。毕钵罗树下金刚座处。是菩提座三世诸佛咸此成觉。佛方就之。仍为石室龙留影也。今或有见者。及无忧兴世。于诸灵迹皆表浮图。雨诸天华。每竟安居。法俗同往登山供菩提树。其菩提树周垣甎叠以崇固之。东西阔周可五百四十步。奇树名华连阴列植。正门东开对尼连禅那河。南门接大华池西阨险固。北门通大寺。其壖院内圣迹诸塔精舍星张相布。树垣正中金刚座者。贤劫初成与大地俱。大千界中。下极金轮上至地际。金刚所成周百余步。千佛同坐入金刚定。故因号焉。即证道之所也。又曰。道场大地震时独无摇也。佛证觉后自入末法。沙土弥覆不见本质。传佛说耳。遂以两躯观自在菩萨。南北标界面南而坐。记云。此像身没佛法当灭。南隅象者今没胸臆</p><p>佛在世时。菩提树高数百尺。枝黄叶青冬夏不改。佛涅槃至叶凋寻复。后为无忧王伐截。于西数十步聚而烧之。用以祠天。烟焰未止忽生两树。猛火之中茂叶同荣。因谓灰菩提树。王睹信生以香乳灌余根者。至旦树生如本。王妃忿之又夜重伐。王重所请以乳灌之不日还生。垒石周垣其高丈余。近为金耳国月王又伐此树。掘至泉水不尽根抵。乃纵火焚之。又以甘蔗浇之。令焦烂绝其本也。数月之后为补刺拏伐摩王。此言满胄。即无忧王之玄孙也。闻树被诛举身投地。请僧七日经行绕树。大坑以数千牛乳灌之。经六日夜树生丈余。恐后剪伐。周峙石垣高二丈四尺。树今出于石壁上二丈余。围可三尺</p><p>树东青甎精舍高百六十余尺。基广二十余步。上有石钩栏绕之高一丈。层龛皆有金像四壁。四壁镂诸天仙。上顶金铜阿摩勒迦果。即此所谓宝瓶及宝台也</p><p>东南接为重阁三层檐宇特异并金银饰镂。三重门外龛中。左观自在右慈氏像。并铸银成高一丈许。无忧王造也。精舍初小后因广之。内置成道像。有婆罗门应募造之。惟须香泥及一灯内精舍中。六月闭户作之乃成。尚余四日僧咸怪之。因开观觅见像俨然。东面加坐右足加上。左手敛右手垂。不见作者。坐高四尺二寸。广一丈二尺五寸。像高一丈一尺五寸。两膝相去八尺八寸。两肩六尺二寸。相好具足。惟右乳上图饰未周。更填众宝遥看其相。终似不满。有僧梦匠者云。我是慈氏。恐工拙思故自写之。言垂手者。像佛语魔指地为证。近被月王伐树。令臣毁像王自东返。臣本<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>乃于像前横施甎障。心愧闇故置灯于内。外画自在天像。功成报命。月王闻惧举身生疱。肌肤皆裂。寻即丧没。大臣驰返即除壁障。往还多日灯犹不灭。今在深室晨持镜照乃睹其相。见者悲恋敬仰忘返。佛以唐国三月八日成道。上座部云。当此三月十五日成道。时年三十者。或云。三十五者。斯之差互彼自不同。由用历前后故有此异。犹神州历元各各不同。三代定正延缩不等。何足怪也。且据一相取悟便止</p><p>佛成觉已七日寂定。至于树北七日经行。南北往来十余步许。异华随迹有十八文。后人甎垒为基高三尺余。俗云。圣迹基也。表人命之修短者。先发诚愿以绳度之。随寿短长增减有验。此北道左磐石上大精舍。作佛上望仰观树相。为报恩像。当时七日目不暂舍。树西大精舍鋀石像。东面立饰奇珍。前有青石奇文异彩。初成道日梵王起七宝堂。帝释起七宝座。佛据上七日思惟放光照树。今宝为石。树南浮图高百余尺初佛于河沐已将坐念草。帝释化人以姑尸草(言吉祥也)以奉佛处。育王造塔表之 次东北塔。是证果时。青雀来绕群鹿呈祥处</p><p>树东大路左右各一塔。是魔王娆佛衰退处 树西北精舍中。迦叶波佛时放光明。俗云。至诚七绕生得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智。又垣西北塔。郁金香泥高四丈余。树垣东南隅。尼拘卢树侧有塔。精舍中有座。佛初证果时。大梵王请转法轮处 垣内四隅皆有塔。初佛受草趣树。先至西南地动。又向西北又东北。又东南并地为震。即西北至树下。东面坐金刚座上。地方安静故立塔记。垣外西南二牧牛女宅处其侧煮糜处。又侧佛受糜处。皆立表塔。树南门外大池。周七百余步清澄鱼龙所宅。次南池者帝释所造。为佛濯衣</p><p>池西大石。天帝雪山将来。为佛晒衣。侧塔是佛纳故衣处</p><p>次南林中塔。佛受贫母施故衣处。化池东林龙池清黑味甘。岸西小精舍中像。佛初成道此坐七日入定。龙王绕佛七匝。化多头盖佛处。龙</p></div>"
}]