[{
    "title": "释鉴稽古略续集 第2038部",
    "author": "幻轮",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>释鉴稽古略续集 (一)</p><p>续刻释氏稽古略序古可稽乎。曰乌乎可。古不可稽乎。曰乌乎不可。威音以后今日以前。成住坏空。有而不有。日月光华。旦而复旦。日劫无凭。何况今古矣。其中圣贤隐现。应缘示感。如月在水。了不可执。乃有人焉。追往烈。订遗踪取已散之尘。而编之而续之。是绘梦也。是图影也。然而纪往开来。阐微昭信。俾古德之迹。炳然如天汉之昭回。而其所以迹者。繇是而可悟焉。未易忽也。往参真寂先师。授予以宝洲稽古略曰。法门源流尽在斯矣。予受而卒业。约而不遗。核而有则。释氏之紫阳漂水也。然而流行勿远渐就晦翳。恒惧遗文湮没。致昔人编摩叙述之苦心。若存若亡隐而勿着。名山之藏讵能无慨乎哉。戊寅春王。构小庵于古杏溪。延幻师主之。雨晨月夕。相与沉吟。梵册寄怀。恺乐陶陶如也。一日偶理前说。幻师谓。宜重加绣黻。以待来者。初以传述旧闻。已乃兼举未备。附以胜国暨 皇明法苑事迹。勒成一书。宝洲之业复光着若发蒙矣。后之揽此者。应化之殊祥奇表。往哲之妙道奇功。以迨我 皇祖列宗冥苻玄契。显扬正觉。以不思议之理。成大有为之运。开卷厘然。昭兹云日。俾夫怀疑者起信。论世者可征。考事者寻微。览迹者悟本。所以嘉惠来学。匪曰小补之矣。而岂徒掇叙事之华。增多闻之障。云已渡而摹其悠扬。波已逝而貌其翻涌乎哉崇祯戊寅岁朱明月佛出世日。蘧庵<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>严尔圭谨序</p><p>续集稽古略叙尝言。为僧而不兼外学。懒而愚。非博也。难乎其高。为儒而不究内典。庸而僻。非通也。乌乎其大。株守而弗移。自画而无进。空腹高心拘墟朿教。终贻笑于大方也已矣。试观古昔之博硕钜公渊宏开士。谁不出入于内外典章。<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>淹贯。张天觉云。吾因<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>然后知儒。妙莲经云。治世语言皆顺<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。群茸酿蜜众味和[羔/火]。匪能博涉而通研。宁识殊岐而一诣哉。然古今传记之作。各有所专。国史则遗<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。禅编则略世缘。无怪乎。二宗学者之非博非通也。有元名衲华亭念常。所集<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>通载。兼系历朝纲纪。继此职里高僧宝洲。释鉴稽古一书。备列皇王政治贤圣风规佛祖源流法门轨则。编年叙世一贯无遗。俾夫简阅之者。其犹瞻象阙而躔度详明。探龙宫而珠玑毕聚。富哉此书。无分儒释。宜家贮而户蓄。枕宝而袖珍者焉。奚特名山藏为哉。杏溪 大参蘧庵严翁。乘大愿轮不忘付嘱弘通之莂。抽资重刻。冀广流传。(不慧)寓幻其庐。备员校订。因并缉辑元世 熙朝两代事迹。缵承其后。庶见古今上下之道脉。连持世与出世之宗猷。踵接拟兹续貂之尾。盖不欲为最后断佛种之人。绘空摹影。以俟来哲观感兴起。联辉续焰。以无穷焉耳时 皇明崇祯龙。集着雍摄提格。月届蕤宾。敦牂令节寿光<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>大闻薰沐撰</p><p>归安杏溪蘧庵比丘大闻 幻轮 汇编蘧庵居士 严尔圭 较梓</p><p>元</p><p>自太祖成吉思皇帝。于宋宁宗开禧二年丙寅岁。法天启运。称圣武年号。建大蒙古国号。都和林云上都。至理宗绍定二年己丑。太宗嗣位。至淳祐六年丙午定宗嗣位。至淳祐十一年辛亥。宪宗嗣位。至开庆元年己未。庆宗嗣位。至景定元年庚申岁。世祖登基称中统。至甲子改元至元。历六世五十九年。今从世祖甲子元年叙起</p><p>世祖 成宗 武宗 仁宗 英宗 泰宗 明宗 文宗 宁宗 顺宗</p><p>世祖</p><p>名忽必烈。宪宗同母弟也。以庚申岁嗣位。己卯岁灭宋。袭统一十六年。寿八十而崩 帝仁明英武屡立大功。好征远夷。连年用兵。悉皆臣服。遂混一区宇。文臣如许衡姚枢等。谋谟庙堂。武将如伯颜董文炳等。攻城略地大阐嘉猷。制礼作乐民物阜康。古未有也(<a href=\"/ctwh/shi/24s/yuanshi.html\" class=\"keylink\" target=\"_blank\">元史</a>)</p><p>甲子至元元年 大宋景定五年 秋七月彗出柳。其光烛天长数十丈。自四更见东方。日高始灭 是岁八月。刘秉忠请定都于燕。世祖从之。诏修营宫室城池。以燕京为中都。改元大赦设会度僧。诏请国师扮弥达癹思。登座授秘密戒 八月拜光禄大夫太保。参领中书省事。制曰。长生天气力皇帝圣旨咨尔。刘秉忠气刚以直学富。而文虽晦迹于空门。每潜心于圣道。朕居藩邸卿实宾僚。侧闻高谊余二十年。出从遐方几数万里。迨予嗣服。须汝计安。不先正名。何以压众。宜崇师位兼总政机。可特授光禄大夫太保。参领中书省事。卿其勉辅朕躬。率先乃属察朝夕之勤惰。审议论之是非。凡有施为并听裁决。伫看成绩别示宠章准此(通载) 以伯颜为中书左丞相。伯颜凝重寡言诸曹白事。有难决者。伯颜一二语断之。省中詟服以为真宰辅(元史)</p><p>乙丑至元二年 大宋咸淳元年 去年十月理宗崩。度宗嗣位。事迹见于前书兹不录</p><p>春正月朔日有食之 五月刘秉忠参领中书省事。既入拜以天下为己任。知无不为。世祖咨以治天下之大经养民之良法。秉忠条上祖宗旧典。参以古制之宜于今者。世祖善之。命下之日纲举目张。一时人材咸见录用。文物灿然一新(元史) 召许衡至命中书省议事。丞相安童时年二十一素闻衡名心慕之。及见于行馆既还叹服日访以政事(元史)世祖闻张德辉之名召见。参议中书省事。辉以圣贤<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>之奥。修身治国之方。古今治乱之繇。详陈于帝。俾教胄子学官。内外焕然一新</p><p>丙寅至元三年 宋咸淳二年 佛教东被震旦。至此已一千二百年矣</p><p>丁卯至元四年 宋咸淳三年 宋帝诣太学谒孔子。行舍菜礼。以颜回曾参孔伋孟轲配享。升颛孙师于十哲 许衡陈时务五事。一曰立国规模。二曰中书大要。三曰为君难以践言。四曰农桑学校。五曰慎微上嘉纳之。乞归乡里许之(史)</p><p>佛国禅师 师讳至温。字其玉。号全一。谥佛国普安。刑州郝氏子也。礼辨庵讷公披剃。佐无还富公于万寿。参万松为侍者。既而太保刘公为世祖知遇。荐师召语大悦将授以官。弗受曰。天下<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a><a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。臣僧之愿富贵非所望也。宪宗命海云主释教。诏天下作资戎会。师持旨宣布中外。而辅成之。刘公卫承制锡师兹号。总摄诸路僧尼之事。师锐意卫教。僧众赖之。后纳印辞职。是年五月十一日。以疾终于桓州之天宫。西向右胁而化。当暑仪容如生。更有异香。火浴心口牙不坏。掊地数尺犹得<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。寿五十一。腊四十。学士虞集撰碑(通载)</p><p>戊辰至元五年 宋咸淳四年 元阿术刘整围宋襄阳。知府吕文焕告急 谢枋得论云。官为宰相。可以生杀废置人。官为台谏。可以弹驳荣辱人。官为国子监。可以考校去取人。此三等谓之系籍圣贤也(史)</p><p>己巳至元六年 宋咸淳五年 二月帝师癹思巴。制蒙古字成颁行天下。宋之常州鸡翼生距</p><p>庚午至元七年 宋咸淳六年 诏请胆巴金刚上师。住持仁王寺普度僧员</p><p>帝师 苾刍癹思巴。说根本有部<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>羯摩<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>。亲制序曰。原夫赡部嘉运。至第四佛释迦文如来遗教利见也。大元御世。第五主宪天述道仁文义武大光孝皇帝登极也。天资<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>谛信内乘。普使万邦咸归一化。虽敷天垂拱而至治无垠。眷支那弘道。而在躬不息。欲以自佛相承师资继踵。迄今不替正戒仪轨。为从善行人一一恒持。精练三业坚守四仪。此实圣皇匡正佛法之睿旨也云云(通载) 廉希宪立朝谠正。世祖令受帝师僧八思马戒。希宪对曰。臣已受孔子戒。上曰。汝孔子亦有戒耶。对曰。为臣当忠为子当孝。是也</p><p>辛未至元八年 宋咸淳七年 十一月始建大元国号。取易乾元之义。始兴蒙古学校。从太保刘秉忠请也 以许衡为学士。衡每谓书中无疑看得有疑。有疑即看得。无疑方是有功。衡之教人也。必因其所明。开其所蔽。而纳诸善时其动息。而弛张之慎其萌蘖。而防范之日渐月渍。不自知其变也。日新月盛不自自知其化也。又为学者。治生最为先务。又言。士君子当以农桑为生</p><p>壬申至元九年 宋咸淳八年 宋少傅叶梦鼎辞归秦。愿励精寡欲收人心固邦本。又云。廉耻事大。死生事小。扁舟径返</p><p>盘谷禅师 号丽水。海盐人。师貌不扬。而志气超迈博览经史。性耽山水之乐。至元中游五台峨嵋伏牛少室名山胜地。尝云。足迹半天下。诗名满<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。时附马高丽沈王。闻师德望具书聘。讲华严大意于杭之慧因寺。师展四无碍辩。七众倾伏。王大悦。声价益重。后至松郡精舍勤修净业。日课弥陀<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>。年七十余。无疾预告以时。端坐而寂。有游山诗集三卷。行世(高僧传)</p><p>癸酉至元十年 宋咸淳九年 元围襄阳日久。二月破樊城。都统范天顺叹曰。生为宋臣。死当为宋鬼。即所守处缢死 许衡还至怀孟。简绝人事。常居山下。勤以自治。公爱兼尽不严而整。闺门之内若朝廷。然夫妇相待如宾。丧祭一遵古制。怀孟化之(史)</p><p>甲戌至元十一年 宋咸淳十年 七月宋度宗崩。太子少帝嗣立年四岁。八月大霖雨天目山崩。水涌溺死无算 是年八月刘公薨。赠仪同三司太傅谥文贞。制曰。臣以忠孝而事上贵输献纳之诚。上以礼义。而遇臣思笃始终之爱。视死之日犹生之年。故光禄大夫太保刘秉忠。学窥<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>识贯今古。邃冲而有守。安静而无华。昔侍潜藩稔闻高论。适当三接之际。恳上万言之书。盖将举天下而措诸安。以戒为人主者过于杀。朕服嗣而伊始。卿尽力以居多。盖得卿实契于朕心。而朕悉知于卿意。事皆有验。人匪他求。周旋三十年不避其艰。剀切数百奏。各中其理。共成庶政。方图任于旧人谁谓旻天。不整遗于一老。兴言及此。何日忘之。载惟台辅之尊。厥有泉扃之贲。是用锡之纶命。峻一品之尊阶。遂以衮衣。蹑三槐之正位。复加显号允答殊勋。惟尔英灵识予哀宠。可赠太傅谥文贞(通载)</p><p>刘文贞公 讳秉忠。字仲诲。瑞州刘季村人。礼天宁虚照禅师披剃为僧。后游云中住南堂寺。同海云禅师北觐。谒世祖於潜邸。一见应对称旨。自是屡承顾问公献书。陈时事所宜者数十条。凡万余言率皆尊主庇民之事。上嘉纳之。从上征伐方便救护。全活甚众。及上正位宸极。创定朝仪立官制。改元建号。一切所当施设。时物之宜皆公所草定。公斋居蔬食终日澹然。是年八月壬戌端坐而薨。享年五十有九。自幼好学至老不衰。虽位极人臣不异平昔。上谓左右曰。秉忠事朕三十年。小心慎密。其阴阳术数之精。占事知来若合符契 帝命史天泽伯颜。帅师南征。召谕之曰。古之善取江南者。惟曹彬一人。汝能不杀是吾曹彬也 史天泽真定人。身长八尺音如洪钟。善骑射。出入将相五十年。柱石四朝师表百辟。为开国元臣。人方郭子仪曹彬云。年七十四。谥忠武</p><p>乙亥至元十二年 宋德祐元年 宋恭宗改元德祐在位二年。元兵执之北行殂于沙漠 江西提刑文天祥起兵勤王。其友止之。天祥曰。国家养育臣庶三百余年。一旦有急征天下兵。无一人一骑赴者。吾深恨之故。不自量欲以身狥。庶天下忠臣义士。将有闻风而起者。义胜者谋立。人众者力济。如此则社稷可保也。天祥性豪华自奉甚厚。至是痛自抑损。尽以家资为军费。每与宾僚语及时事。辄抚几流涕言曰。乐人之乐者忧人之忧。食人之食者死人之事。闻者莫不为之感动 湖南提刑李芾遣兵入援。发壮士三千人使将将之。勤王后谥忠节 行人郝经。使宋被留一十六年。撰集诸书。至是归燕卒。谥文忠 宋诏张世杰总督诸军。后与陆秀夫陈宜中。航海以狥国难溺死 有二星斗于中天。一星陨 六月朔日有食之。既昼晦如夜</p><p>丙子至元十三年 宋德祐二年 五月宋端宗立。改元景炎后。航海崩于岭南之岗州</p><p>二月日中有黑子。大如鸡卵。相荡久之 丞相文天祥常言。国亡与亡此男子心。元人以天祥北去 钱塘江潮三日不至。时元军分驻江沙上。杭人方幸之。而潮汐不至 三月元伯颜。入临安建大将旗鼓。受宋帝及太后庶僚。趍赴京入觐 姚枢仁恕恭敬。未尝疑人之欺。凡有与谋者必忠告。人莫不敬之。时以为翰林学士。宋侍从之臣及士子。至上都皆令枢随学行而官之</p><p>丁丑至元十四年 宋景炎二年 封宋主为瀛国公。令往脱思麻路。习学梵书西番字经 全后于正智寺为尼</p><p>建大圣万安寺 廉希宪官至平章。伯颜谓之宰相中真宰相男子中真男子。世以为名言。至是卒</p><p>戊寅至元十五年 宋祥兴元年 宋帝昺立改元祥兴。在位二年后航海至厓山。张世杰与元战败。陆秀夫抱之沈海 正月朔旦。广设大会以斋僧众。大赦天下。玉泉等五老蒙恩得度 有大星。南流陨海中。小星千余随之。声如雷。数刻乃止</p><p>己卯至元十六年 二月宋亡。宋自太祖起至帝昺。通三百二十年</p><p>文文山 姑苏人。讳天祥。为宋状元丞相封信国公。有忠孝大节。被执目击厓山。有诗哀悼(不录)又歌曰。飓风起兮海水飞噫。文武尽兮火德微噫。鹰鹯相击兮靡所施噫。鸿鹄欲举兮将安归噫。棹歌中流兮任所之噫。独抱春秋兮莫我知噫 又正气歌曰。天地有正气杂然赋流形。末云。顾彼耿耿在。仰视浮云白悠悠。我心忧苍天曷有极。哲人日已远。典刑在宿昔。风檐展书读古道照颜色 零丁洋诗。辛苦遭逢起一经。干戈落落四周星。山河碎碎水漂絮。身世浮沉风打萍。惶恐滩头说惶恐。零丁洋里叹零丁。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>自古谁无死。留取丹心照汗青 过金陵草舍离宫。转夕晖孤云飘泊欲何依。山河风景原无异。城郭人民半已非。满地芦花和我老。旧家燕子傍谁飞。从今别却江南路。化作啼鹃带血归 后至<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a><a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>谓吏卒曰。吾事毕矣。南向拜而死。年四十七。其衣带中有赞曰。孔曰成仁。孟曰集义。惟其义尽所以仁至。读圣贤书所学何事。而今而后庶几无愧 平生作文未尝属草。有指南集吟啸集。有集杜诗百首等行世 建司天台于大京 立安乐堂。疾者医之。饥者廪之。死者葬之</p><p>庚辰至元十七年六月。新历成赐名授时。明年始颁行天下。遣使穷黄河之源。由星宿海至昆仑山。始抵其地 窦默为人乐易。平居未尝一言方人。官至学士至是卒。谥文正</p><p>帝谕真金太子曰。伯颜文武全才。汝勿以常人遇也 许衡临终语其子曰。我平生为虚名所累。不能辞官。是年卒。谥文正</p><p>帝师入寂 癹思八为大元帝师。是年十一月二十二日示寂。年四十二岁。上闻不胜震悼。追怀旧德建大窣堵波于京师。实藏真身舍利。轮奂金碧无俦。学士王磐奉敕述行状曰</p><p>皇天之下。一人之上开教宣文辅治大圣至德普觉真智裕国。如意**法王。西天<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。大元帝师。班弥怛拔思癹帝师。乃土波国人也。生时诸种瑞应具详家谱。初礼伯父萨师加哇为师。秘密伽陀一二千言。过目成诵。七岁演法。辨博纵横犹不自足。复遍咨名宿。钩玄索隐尽通<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。年十五。世祖皇帝龙德渊潜。师知真命有归。驰驿径诣王府。世祖官闱东宫。皆秉授戒法。特加尊礼。年二十。释道订正化胡经。宪宗皇帝诏师剖析是非。道不能答。自弃其学。上大悦。年二十二。世祖登极。建元中统尊为国师。授以玉印。任中原法主。统天下教门。辞帝西归未[其/月]月召还。年三十一。时至元七年。诏制大元国字。师独运摹画作成。称旨即颁行朝省郡县。遵用迄为一代典章。升为帝师。更赐玉印。统领诸国释教。旋又西归。至元十一年。专使召之抵京。王公宰辅士庶。离城一舍结大香坛。设大净供罗拜迎之。万众瞻礼若一佛出世。为真金太子。设彰所知论五篇。存藏行世</p><p>彰所知论 帝师为太子。说佛智大师沙罗巴译初器世界品。备载大地及水火风轮妙高七金四洲轮围日轮月轮星宿宫<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>诸天等。次情世界品。备列<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>饿鬼旁生人道修罗天道成住坏空四劫始终之相。及释迦祖承历代轮王之事。后<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>无为五法等</p><p>辛巳至元十八年十月。命僧道二家辨析。特奉圣旨云云。除道德经是老子真实经旨。其余皆后人造作。差官尽行烧毁</p><p>壬午至元十九年。处士刘因天资绝人。日记千百言。过目成诵。爱诸葛孔明静以修身之语。表其扁曰静修。征为赞善不受</p><p>癸未至元二十年</p><p>甲申至元二十一年正月六日。大赦天下。并下轻刑之诏</p><p>乙酉至元二十二年。圣旨焚毁诸路伪造道藏经。书事于石。碑记甚悉。圣旨禁断道藏伪经下项。见者悉应便宜收取</p><p>化胡经 犹龙经 圣纪经 西升经 出塞经 明真辨伪经 九天经 赤书经 上清经 南斗经 玉纬经 十二虚无经 纪胜赋 辨仙论 龁邪论 三破论 太上实录 青阳官记 玄九内传 帝王师录 三天列记 十异九迷论 历代应现图 佛道先后论 钦道明证论 辅政除邪论 谤道释论 十山论 辟邪归正论 藏天隐月经 赤画度命经 历代帝王崇道记 三教根源图 混元生三清经 混元实录 灵宝四十二生经 高上内传楼观先生内传 五公问虚无经(通载)</p><p>圣旨就大都大愍忠寺。焚烧道藏伪经。命大都报恩禅寺林泉长老下火。谢恩毕拈香云。<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>天子愍<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。恐堕三涂邪见坑。个里了无偏党处。就中朱紫要分明。所以道圣鉴无私。天机莫测。既来颂德敢不酬恩。此香端为祝延当今皇帝云。伏愿金轮与法轮并转福越三祇。舜日共佛日齐明寿延亿劫。次举火云。忆昔当年明帝时。曾凭列焰辨妍媸。大元天子续洪范。显正摧邪谁不知(文长不悉)。遂以火炬打一圆相。云诸仁者只如三洞灵文。还能证此火光<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。也无。若也于斯会得。家有北斗经。枉教人口不安宁。其或未然。从此灰飞烟灭后。任伊到处。觅天尊。急着眼看。林泉长老从迈。奉敕下火(通载)对道士持论师德。一十七名</p><p>圆福寺从超奉福寺德亨</p><p>药师院从伦法宝寺圆胤</p><p>资圣寺至温大名府明津</p><p>甘泉山本琏上方寺道云</p><p>开觉寺祥迈传教寺了询</p><p>法华寺庆规龙门县行育</p><p>延寿寺道寿仰山寺相睿</p><p>资福寺善朗</p><p>绛州祖圭蜀川元一</p><p>丙戌至元二十三年。大都道者山云峰禅寺住持如意祥迈长老。奉 敕撰辨伪录五卷</p><p>辨伪录 其篇目云。妄立天尊伪。创立劫运年号伪。开分三界伪。随代为帝王师伪。老子出灵宝三洞伪。游化九天伪。偷<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>教伪。老君结气成字伪。周文王时为柱下史伪。前后老君降生不同伪。三番作佛伪冒名僭圣伪。合气为道伪。偷佛神化伪。辨说渊博具如通载</p><p>如意禅师 讳祥迈。博通内外典章。洞彻渊微理致。住持名都巨刹。应旨撰辨伪录五卷。制伏允惬有弘传序注。载法华要解</p><p>丁亥至元二十四年</p><p>戊子至元二十五年正月二十一日大赦天下</p><p>云峰和尚 师住径山。初江淮释教都总统杨辇真迦。集江南禅教诸僧。朝觐登殿对御论禅。宣上竺僧问讲何经。答云。<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。次问仙林僧讲何经。奏云。百法论。次问师云。禅以何为宗。奏对曰。禅也者净智妙圆体本空寂。非见闻觉知之所可知。非思量分别之所能解(备谈本末)又云。夫禅与教本一体也。禅乃佛之心。教乃佛之语。因佛语而见佛心。譬之百川异流同归于海。到海则无异味(云云)谢恩赐馔</p><p>吉祥禅师 镇江普照寺<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>普喜号吉祥。山东人。精究慈恩相宗。研习唯什师地因明等论。是年世祖创立江淮御讲之所。普照居一。诏师主之。升座外日诵华严大经。以十卷为常课。后入寂茶毗舍利甚伙。建塔丹徒。镇江之民多有图像祠之。称为吉祥古佛云</p><p>玉岗法师 杭州下竺蒙润子玉岗海盐人。古源清法师之甥。竹堂传法师之高足也。生时母感异梦。礼伽蓝土偶皆仆。修观音忏而心疾即愈讲法华。而屠沽易业居风篁岭。专精<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>修法华光明大悲<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。以七七为期甚多。后示<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a><a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>安心之法。称佛而逝</p><p>己丑二十六年正月。抄数天下户计</p><p>庚寅二十七年秋九月日大赦天下</p><p>谢叠山 枋得。天资严厉雅负奇气风岸孤峭。而以植世教立民彝为任。官至招谕使。宋亡以卜自隐。时征见用力辞书云。大元制世民物一新。宋室孤臣只缺一死。所以不死。以九十三岁之母在堂耳。至燕不食。将行有友张子惠诗。云此去好。凭三寸舌再来。不值半文钱。枋得会其意竟死于驿。平生无书不读。文章高迈奇绝自成一家。读其辞见其心。慷慨激烈可使顽夫廉懦夫立志云。有文章轨范</p><p>王文忠公 王磐。字文炳。广东人。世业农。岁得麦万石。号万石王家。公大肆力于学搜罗经史百氏。文辞宏放荡无涯涘。受业者尝数百人上疏言。天子官门不应入。而入者谓之阑入。由第一门至第二门轻重有差。官至翰林学士卒。时九十三。赠太傅国公。谥文忠</p><p>辛卯二十八年。平阳地震坏民居。万有八百二十六区。压死百五十人。全太后为尼。瀛国公为僧。有地三百六十顷。例免征租</p><p>壬辰二十九年。杨恭懿奉元人。初与许衡俱征不起。太子真金令有司。以汉聘四皓故事聘之。考正历法授集贤学士。至是卒</p><p>癸巳至元三十年。刘文靖。因性不苟合不妄交隐居。教授师道尊严年四十五卒。赠学士谥文靖。所著有四书精要诗集五卷云。皇孙铁木耳总兵北边。召伯颜居大同。皇孙举酒饯之曰。公去何以教我。伯颜举所酌酒曰。可慎者惟此与女色耳</p><p>云峰入寂 杭州径山第四十三代云峰禅师。讳妙高。句之长溪人。从云梦泽公受具戒。首参痴绝冲禅师。次见无准于径山。又见偃溪于育王入室掌藏钥。一日溪举。譬如牛过窗棂。头角四蹄都过了。因甚尾巴过不得。师划然有省。答曰。鲸吞海水尽露出珊瑚枝溪可之。出世南兴大芦。迁江阴劝忠及霅川何山寺。云衲四来三堂皆溢。朝命升蒋山。至元庚辰迁径山两遭回禄。克苦重兴。随觐趍京对御论禅。皇情大悦。赐食寝殿。是年六月初小参训饰学者。十七日说偈而逝。寿七十五。腊五十九。塔于寺西之居顶庵</p><p>回回孛可献大珠。邀价钞数万锭。帝曰。珠何为当留此钱以周贫者。十月彗星入紫微垣抵斗魁。光芒尺余。凡一月乃灭</p><p>甲午至元三十一年春正月壬子朔。帝不豫免朝贺。癸酉帝崩于紫檀殿。号世祖圣德神功文武皇帝</p><p>世祖潜龙时出征西国。好生为任。迷径遇僧。开途受记。由是光宅天下统御万邦。大弘密乘尊隆<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。迎旃檀瑞像归内宫。安奉万岁山仁智殿。为现世之宝。仍建大圣寿万安寺。供奉令一切人俱得瞻礼 定光佛塔毫光发现。帝命开视内有舍利。光耀人目。由是重建宝塔。帝命写金字藏经。轴前图像未定。帝云。此经是释迦如来所说止画说主。庶看诵者知有所自</p><p>帝诏遍天下。每一岁中。行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>度僧。读<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>。随处放光现瑞祯祥不一 诏讲华严大德。于京城大寺开演。以彰如来之富贵 帝设大会七处。放光显示华严七处玄旨 帝以金为泥。命僧儒缮写大藏经。一藏贮以七宝琅函。祈流传万世 帝以宋朝镇库旃檀方圆丈余。刻为佛像和益人天 帝赐讲经僧红<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>。令<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>人与佛无异 帝日持数珠。课诵自奉施食</p><p>帝诏东昌大师演教听之。大悦赐以宝玉柱杖 帝颁玉音诏昊天讲主云。因朕在世戒约学徒。究明佛法母令减灭 帝命逸林上师。译药师坛法仪轨。为天下消八苦之灾。增无量之寿 帝设十万僧会。令十师对御说法。赐白金十锭玉柱杖十根 帝诏十高僧内殿<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。帝端居不动。诸大德亦复默然。帝乃云。此是真实<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a></p><p>帝命高僧。重整大藏。分大小乘。再标芳号遍布天下 帝命诸山师德。校补弘法寺久远藏经。鼎新严饰以传无穷 帝印大藏三十六藏。遣使分赐。归化外邦。皆令得瞻佛日</p><p>帝印造<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>本千部。流通散施。普令大地众生皆奉如来宝戒 帝令诸路高僧。俱赐红黄大衣。传授大戒 帝以清凉为真佛境界。建立五大寺为最上<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a> 帝每斋日。以南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>佛盂。置百味珍羞。澄心观想广修供养</p><p>帝以如来舍利宝塔。统御刹中一十九所。各颁钱帛广加严饰。大陈供养 帝见僧人有过。不加王法。只令阅教<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a></p><p>帝以天下寺院田产二税。尽行蠲免。普令缁侣安心办道 天下寺院山林树木。遍谕玉音严加护持。毌令斫伐。以严佛圣境界</p><p>帝告群臣云。朕以本觉无二真心。治天下国家 帝闻五教义曰。顿教即心是佛。诸佛境界。凡夫不修。如何得到 帝命两土名德。对辨经教一一无差。帝曰。积年疑滞今日决开 帝颁圣旨谕一切僧人。不拣甚么差役休当。遵依释迦佛道子行持</p><p>宋太后削发为尼。诵经<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。帝深加敬仰四事供养。宋主以王位来归学佛<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。帝大悦。命削发为僧。讨究大乘明即佛理。宋室宫人皆祝发为尼。帝曰。三宝中人也。命归学佛修行。供送衣粮</p><p>帝问帝师。施食至少。何能普济无量幽冥。帝师云。佛法<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>力犹如饮马珠 帝命帝师斋竟。天雨金花缤纷而下。帝曰。何故有此祥瑞。帝师曰。陛下心花内发。天雨金花赞叹</p><p>蜀僧元一游西天回朝。献玉石佛像贝多叶经。帝问云。西天佛有么。元一奏云。当今东土生民主。何异西天悉达多 帝问元一。道家徒众何以少。如来徒众何以多。元一云。富嫌千口少。贫恨一身多 帝问元一云。和尚还涉世缘否。奏云。不知法故犯。知法了应无</p><p>帝问拣坛主云。何处有佛。拣奏云。我皇即是佛。帝云。朕如何是佛。拣云。杀活在于手。乾坤掌上平 帝年八十岁乃云。与释迦如来同寿不为天矣 帝崩。灵驾经宣德。现大圆光周遍天界合境。僧俗悉皆瞻礼。盖显古佛示现之作用耳(以上出弘教集具见佛祖通载)</p><p>夏四月。皇孙铁木耳即位得玉玺。其文曰。受命于天既寿永昌 宋处士铉翁年逾八十。诏赐金币皆不受。至是卒 伯颜深沉有谋略善断。诸将仰之若神明。可谓一代之良将。世祖崩。百官总已以听。握剑立殿陛。陈祖训宣顾命。述所以立帝之意。辞色俱厉诸王股憟。趍拜位具大臣之风节。至是卒。官至开府仪同三司太傅。录军国重事。封淮安王谥忠武</p><p>成宗</p><p>名铁木耳。世祖之孙。太子真金第三子也。世祖崩诸王立之。在位一十三年。寿四十二崩 帝承天下混一之后垂拱而治。可谓善于守成。末年连岁寝疾。内则决于宫阃。外则委于大臣。致贼虏等反时有小警。然不至于废坠者。去世祖未远。以成宪具在故也。改元二</p><p>乙未元贞元年四月。兰州河清上下三百余里。六月江西天水陕西旱饥赈之</p><p>高峰禅师 讳原妙。苏之吴江人。姓徐氏。受业乌戌之密印寺。得法于雪岩钦禅师之门。生于宋嘉熙戊戌。十五出家。十七受具戒。十八习天台教。二十更衣入净慈立死限。三年二十一。请益断桥参雪岩于北涧。住双径得悟。后隐龙须迁双髻至元己卯上天目西峰。入张公洞扁死关。不越户者十五年。学徒参请无虚日。僧俗<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>者几数万人。开山师子大觉二刹。是年乙未腊月朔。焚香说偈告众坐亡。世寿五十七。僧腊四十三。度弟子几百人。塔全龛于死关之内。从治命也。祖雍识师有语录。盛行于世云 断桥禅师</p><p>雪岩禅师 讳法钦。五岁出家。十六剃度。十八行脚。十九灵隐。挂塔移单过净慈。一日在天目。殿上行。抬眼见一株古柏。触目省发。从此不疑生不疑死。不疑佛不疑祖。后住道林南明仙居湖州光<a href=\"/remen/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>场仰山北涧诸刹。为无准之嗣。乃高峰之师有语录二卷。行世</p><p>丙申元贞二年。授嗣汉三十八代。天师张与才为太素凝神广道真人。领江南诸路道教</p><p>丁酉大德元年春正月。太后幸五台山。初为太后建寺于五台山。至是成。太后因临幸之。为兆民求福 二月改元大赦</p><p>戊戌大德二年。诏以水旱量免租税</p><p>己亥三年。诏遣使问民疾苦。九月夜有流星如雷</p><p>庚子大德四年。不忽木。初世祖每闻其言。必叹赏之。以白璧赐之。官至学士平章。至是卒。家贫赐葬。赠鲁国公。谥文贞</p><p>辛丑大德五年八月。有星孛出东井。历紫微垣天市垣。四十六日灭 十月有星大如杯。光烛地自北起分二星。没于危宿</p><p>三垣 天象之开有三垣。一曰紫微垣十五星。在太乙之中。二曰太微垣十星。在轸翼之北。三曰天市垣二十二星。在房星之北</p><p>壬寅大德六年三月。诏以旱溢为灾。赦天下免其差税三年 六月建文宣王庙于京师</p><p>真觉国师 讳文才。号仲华。清水杨氏子。少孤事母。孝性捷敏。于书无所不读。尤邃于性理之学。好古作善吟咏。所禀敦朴若无所知。至于谈接。辞辨莫窥其涯。遍游讲席尽得贤首宗旨。尝曰。学贵宗通言欲会意。以意逆志则得之矣。语言。文字糟粕之余也。岂能开人慧目哉。初隐成纪。筑室树松将欲终焉。故人称曰松堂和尚。世祖降旨令主洛阳白马寺。学者汇至声誉日隆。成宗建大万圣祐国寺于五台。诏求开山第一代住持。帝师迦罗斯巴荐之成宗。即铸金印署师。为真觉国师。师辞曰。越分以居不祥。不肖而行不明。帝师曰此上命也。于是不得已而行。大弘清凉之道。至老无怠。是年九月朔示疾而逝。年六十二。塔于东台之麓。有慧灯集悬谈详略肇论疏等(通载)</p><p>癸卯大德七年 金刚上师讳功嘉葛剌思(此云普喜名间)又名胆巴(此云微妙)西土番人。初侍法王上师。咒诵如流。经科咒式等靡不洞贯。世祖时至此土见上问答。允称中间往返灵应非一。成宗时奏蠲僧家粮税。诏住名刹。宠赉无过。是年五月十八日西逝(通载)</p><p>金履祥 兰溪人。屏居金华山中。作通鉴前编。四书五经各有注疏。授徒许谦以传。抱道自乐不求闻达。学者称仁山先生。谥文安</p><p>甲辰大德八年二月。有星孛于室度。入紫微垣。约一丈。凡七十六日灭</p><p>乙巳大德九年四月。大同地震有声如雷。坏庐舍五千余间。压死五千余人。地裂涌水尽黑。漂出松柏朽木。遣使赈之</p><p>丙午大德十年正月。罢江南白云宗都僧录司。二月暴风大雪雨沙。雨雹如卵</p><p>丁未十一年正月丙寅朔。帝大渐免朝贺。癸酉帝崩于玉德殿。号成宗完者笃钦明广孝皇帝 五月武宗即位</p><p>武宗</p><p>讳海山。顺宗答剌麻八剌之长子也。初封怀宁王总兵北边。屡立战功。成宗崩。诸王立之在位五年。寿三十一而崩 帝当富有之业。慨然欲创治改法故。其封爵太盛而遥授之。官众赐赉太隆而泛赏之恩溥。至元大德之政。于是稍有变更矣</p><p>夏六月。以母弟爱育黎拔力八达为太子。追尊考曰顺宗</p><p>萧[奭*斗]陕西人。力学三十年不求进。擢为太子谕德。疾辞归卒。谥贞敏</p><p>加封孔子。为大成至圣文宣王 诏曰。盖闻。先孔子而圣者非孔子无以明。后孔子而圣者非孔子无以法。所以祖述尧舜。宪章文武。仪范百王。师表万世者也。朕纂承丕绪敬仰休风。循治古之良规。举迨封之盛典。加号大成至圣文宣王。遣使阙里祝以太牢。於戏父子之亲。君臣之义。永惟圣教之尊。天地之大。日月之明。奚罄名言之妙。尚资神化祚我皇元 翰林承旨阎复之辞</p><p>戊申至大元年 旃檀瑞像。至是计二千三百年矣</p><p>天台佛陇修禅寺释可。号宜行。博综台宗。精修止观。听雨偈曰。檐前滴滴甚分明。迷处众生听作声。我亦年来多逐物。春宵一枕梦难成</p><p>己酉至大二年。敕赐佛国普安禅师塔铭。奎章阁虞集撰(略见世祖丁卯)敕赐乞台萨里神道碑。翰林赵子昂为文云(通载)</p><p>临济正宗 内翰赵孟俯。奉敕撰碑记。其略曰。佛以大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>破一切有。以大圆觉摄一切空。以大慈悲度一切众。始于不言而至于无所不言。无所不言。而至于无言。夫道非言不传。传而不以言。则道在言语之外矣。是惟佛法最上上乘。如以薪传火。薪尽火传不穷</p><p>海云大宗师简公。性与道合。心与法宜。细无不入。大无不包。住临济院。能系祖传以正道统佛法。盖至此而中兴焉。又云</p><p>西云大宗师安公。能嗣其业。据师子座为众演说。闻者赞叹。信者乡风。得者如宝。悟者如空。皇帝万年。正法永传。尚迪后人。弗昧其原(通载)</p><p>阿沙不花。见帝容色日悴进曰。八珍之味不知御。万金之身不知爱。惟麯蘖是好。姬嫔是耽。是犹两斧伐孤树。未有不颠仆者。帝喜拜相</p><p>庚戌 辛亥四年正月庚申。帝崩于玉德殿。号武宗曲律仁惠宣孝皇帝</p><p>三月庚寅。皇太子即皇帝位于大明殿。大赦天下。赐高年帛 革罢僧道衙行。论曰。望五位以升阶。转二依而就果者。上乘菩萨也。以四向一坐而证成。三生百劫而彰号者。缘觉声闻也。圣贤品级教有明文。惟妙悟自心。入佛知见者千圣尚不为。何阶级之有。末云 朝廷尚行于爵秩。释子乃兢于官阶。官阶无尽期。贪爱无满分。胡不养其妻子跪拜君亲。何异织女七襄牵牛负轭者哉。识达于此无取焉。不空三藏深于大教有功。授宫犹愧滥污。今何人欲假名器哉</p><p>仁宗</p><p>讳爱育。黎拔力八达顺宗次子。武宗同母弟也。武宗以帝为皇太子。武宗崩遂嗣位。在位十年。寿三十六 帝天性慈孝聪明恭俭。通达儒术爱养民力。孜孜为治一。遵世祖成宪。为盛德守文之主</p><p>壬子皇庆元年。帝论曰。御史台是一时公论。国史院是万世公论也 五月禁诸王。毌得以农时出猎扰民。至十月方许猎</p><p>癸丑皇庆二年。帝曰。善人乃可为宝善人用则百姓安。兹国家所宝 帝以久旱宫中焚香默祷。遣官分祷诸祠。甘雨大注 承旨李孟言。人主之柄在刑赏。赏一善而天下劝。罚一恶而天下惩。又言。僧道既为出世法。何与官府罢僧道官 御书秋谷二字以赐。建崇文阁于国子监。以宋儒周敦颐程灏程颐张载邵雍司马光朱熹张栻吕祖谦及故中书许衡。从祀孔子庙庭</p><p>甲寅改元延祐元年诏科场。以经义取士。庶得真儒之用。而治道可兴也。敕各省专意访求遗逸。苟得其人。先以名闻。后致之</p><p>佛智法师 沙罗巴观照。依癹思巴帝师薙染。习诸部灌顶法。又从着赤上师学大小乘。时刺温卜善秘密教。为世所称。投之尽得其道。所以善吐番音。兼解诸国文字。后因迦罗思巴帝师荐于世祖。命译中国未备显密诸经各若干部。辞旨明辨。特赐大辨广智之号。后加弘教佛智三藏法师之称。授师为江浙等处释教都总统。帝亲劳送之。皇太子诸王尝问法要。所译之经朝廷皆刊行。是年十月五日示疾。赐钞万缗。敕太尉沈王视医药。谢却之竟面佛坐逝。帝悼之赐给葬。遣使驰驿。送归故里建塔(高僧传通载)</p><p>普觉法师 姓赵氏。讳英辨。号普觉。弱冠受具戒。得慈恩宗于柏林潭法师。出世于秦州景福寺。其道大振声驰四表。摧伏异见树正法幢。而其资性真纯。如玉含璞不加雕绘。人爱重之。致于悍卒武夫亦能敬其。为无佛世之佛也。世祖闻其高风。降旨旌异。是年六月庚戌无疾辞众坐寂。焕异景于易箦之夕。标奇迹于火化之余。塔于普觉寺之后。阅世六十有八。腊六十有一(佛祖通载) 十一月京师旱疫。帝问弭灾之道。学士程钜夫举汤禳桑林事以对。帝曰。此实朕之责也。赤子何罪。明日大雪。以西僧作佛事。疏放罪囚</p><p>乙卯延祐二年正月。诏遣宣抚使。分十二道。问民疾苦。黜涉官吏 五月秦州山移十一月彗见紫微垣 赦天下</p><p>丙辰延祐三年。礼公哥罗斑藏卜为帝师</p><p>赖禄孙负母避乱。盗至守母不去。事闻特赐旌表</p><p>敕建旃檀瑞像殿 翰林承旨。程钜夫撰记。其略曰。盖闻。道非有像作易者。必拟诸形容。法本皆空。度世者暂资于色相。谓如指空为镜。不若以镜而谕空。即树占风。将使识风以忘树。是以双林付嘱舍利。以凡圣而遍分。千辐经行足迹亘古今而常在。非炫<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>于幻境。实开方便于迷津。所谓由佛以念心。即心而即佛者也。旃檀瑞像佛之真像也。其犹万影沉江。如如不异。孤光透隙。一一皆圆。夫岂择地而容。盖以<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>而应。望梅林而止渴。靡不同沾。泛竹叶以言归。谁堪共载。惟我圣天子。道跻先圣。慈等觉王。祝长乐之春秋。恒依佛地企如来之岁月。坐阅人天 瑞像本末。具载前集宋宁宗嘉泰三年录中。爰自西土龟兹凉州至上京等处。二千三百七年也</p><p>敕封普庵禅师嘉号 诏曰。上天眷命皇帝圣旨。朕闻。佛氏以空寂为宗。则凡学所遵者。宁欲建名号殊称谓。以示天下后世哉。而国家非此。无以昭尊德乐道之意也。朕自即位以来闻。袁州路南泉山慈化禅寺。普庵寂感妙济真觉昭贶大德惠爱禅师。绍临济之绪。超华严之境。德映当代。泽被方来。其道甚尊显。心窃慕之。既累赐大谥。惟塔号未称可加定光之塔。曰定光灵瑞之塔云云</p><p>丁巳延祐四年。敕加东林远法师。号妙觉寂光宏辨大师。都省咨文 四月不雨。帝露香祷天既而大雨。左右进雨衣不受</p><p>福元讲主 讳德谦。姓杨氏。字福元。宁州定平人。幼为勤策嗜诵<a href=\"/remen/foshu.html\" class=\"keylink\" target=\"_blank\">佛书</a>。稍长遍历名邦。咨访先德受<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>于宁公。习瑞应于忠公。受幽赞于仙公。学圆觉于一公。究唯什俱舍于頙公。听楞严四分于闻公。而数公并以识法解义。声名远着。师皆亲熏炙之。必臻其道。后京都受华严于万安拣公。初诏居万宁寺。次迁慈恩前后十祀。道德简于宸里。声光扬于海外未尝以荣显宠遇改其志。尝曰。畦衣之上抗于世表。苟不愧于朝闻夕死。尚何慕焉。乃让席幽居。括囊一室处世。而遗世者也。是年正月日示寂。赐缗旌幢津送塔于城之南隅云</p><p>光教律师 讳法闻。陕西严氏子。十五薙染。二十受具戒。从温公学法华般若唯什因明及四分律。温托以弘传之寄。尝对佛像灼肌然指。庸表克诚。刺血书经。以彰重法。隐于台山不踰阃者六载。读藏经五千卷者三番。帝师命师讲说。顾谓其徒曰。孰谓汉地乃有此僧耶。天子闻之征至阙庭。诏居太原寺。授荣禄大夫。次迁大普庆寺。加开府仪同三司银章一品。王公大臣仰止高风。犹景星凤凰之瑞于明时也。后赐实相圆明光教律师之号。赐辽世金书戒经。求戒者无算。是年三月日。跏趺而逝。赐币以葬。有司仪卫旌幢送之(通载)</p><p>戊午延祐五年正月。懿州地震 二月和州地震秦州山崩 四月德庆地震。南土山崩。压死居民。给粮赈之</p><p>特赐国师 达益巴。师事大萨思述帝师十有三年。听言论于左右。观道德于前后。陶熏滋久郁成美器。凡大小乘律论。及秘密经籍部以十数。皆耳于口授。目于手示得乎理之所归。行之所趋。是以誉延两京道重三朝。事二圣於潜邸。竭勤逾纪赐赉以千万计。归以所赐大厥梵宇。加赐金印。驰纽封号弘法普济。三藏佑圣国师。是年五月十六日化于京师。给乘骑归葬成纪。年七十有三云(通载)</p><p>栽桑图说 八月司农苗好谦撰进。帝曰。农桑衣食之本此图甚善。命刊印千帙。散之民间。又印大学衍义。赐朝臣</p><p>己未延祐六年 径山虎岩禅师讳伏 本源禅师讳达 晦机禅师讳熙 虚谷禅师有谥 建大永福寺(即青塔)</p><p>佛护大师 讳本无。号我庵。台州黄岩人。幼从方山宝公薙染进具戒。次依寂照于中天竺即有省处。更衣见湛堂澄公。精研教部。寂照惜之。寄以偈曰。依教入禅今古有。从禅入教古今无。一心<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>门虽别。水满千江月自孤。师后出世祝湛堂寂照二香。初主四明延庆。后迁杭之上天竺。最久一日无疾端坐。而蜕白云堂。赐谥佛护宣觉宪慈[匚@于]道大师云(高僧传)</p><p>妙文讲主 九岁出家。十八受具。依大德圆和尚。学圆顿教。始升猊座纵无碍辨。若峡倒川奔。及乎闲居简默言不妄发。其涵养冲挹。无欲速不躁进。大类如此。年四十八。住蓟之云泉。勤俭节用。老者怀其德。少者严其教。故众睦而寺治。廪有余粟以赈饥民。蓟人称之。世祖召见顾谓侍臣曰。此福德僧也。诏居京师大宝集寺。自尔教乘法席益盛。性相并驱僧俗溥济。斯时海内讲席纷纷。方胶固于名相凝滞于殊涂。师独大弘方等。振以圆宗。使守株者通于寂默之外。龙象蹴蹈兢驾一乘。年逾八十。专修念佛三昧。是年月日结印而终</p><p>庚申延祐七年正月朔日。有食之。帝斋居损膳 帝崩。谥仁宗文英武章皇帝 三月太子即位大赦</p><p>英宗</p><p>讳硕德八刺仁宗嫡子也。在位四年。为御史太夫铁失等弑于行幄。年二十一 帝天性至孝。仁宗不豫。每夜焚香泣告于天。愿以身代。及崩哀毁过礼。寝服于地日歠一粥。至嗣位用法无私。果于诛杀。奸党畏罪。遂构大变。谥格坚皇帝</p><p>辛酉至治元年正月。帝服衮服享太庙曰。岁必亲祀终朕之身议赦。帝曰。恩可常施。赦不可屡下。使杀人获免。死者何辜 二月初建西山佛寺 九月驻跸兴和。左右以寒请还。上曰。兵以牛马为重。民以稼穑为本。盖欲马得刍牧民得刈获。何计乎寒</p><p>立帝师殿 诏各路立帝师殿。释源宗主法洪。奉敕撰碑。其略曰。皇元启运北天。奄荒区夏。奋神武之威。致混一之绩。思所以去杀胜残跻生民于仁寿者。莫大释氏。故崇其教以敦其化本。以帝师拔思癹有<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之道。屈万乘之尊尽师敬之节。咨诹至道之要。以施于仁政。是以德加于四海。泽洽于万邦。实赖帝师之助。铭略曰。佛道弘大洋海无际。滔天沃日并育万类。于彼将圣象罔得一。舍厥绪余以[匚@于]王国。烈烈皇祖草昧天造奠是南纪。功格苍具云云。追谥皇天之下一人之上云云(见至元十七年行状文中)赵孟俯书丹。元明善篆额</p><p>弘教大师 讳了性。号大林。武氏子。初依安和尚薙发。登具岁诸讲席。精究三藏。遇真觉国师启迪厥心。如柏林潭关辅怀南阳慈诸公。皆以贤首之学著称一时。悉造其门领其玄旨。北游燕蓟晦迹魏阙之下。悠悠如处江海之上。与世若相忘焉。成宗征居万宁寺。声价震荡内外。大后创寺于五台山。曰大普宁寺。延师为第一代。师不求合于时。不屈于人。识者高其风节。是年九月卒。谥弘教大师云</p><p>壬戌至治二年。有言佛教可治天下。帝问拜住。对曰。清净寂灭自治可也。若治天下。舍仁义则纲常乱矣</p><p>幻堂讲主 讳宝严。字士威。成纪康氏季子。因罹丧乱。与弟同薙发为僧。后参真觉得传贤首宗旨。而嗣其道。为人淳朴无伪。方寸之地。湛若止水。值真觉三坐道场。师与弟皆从而佐之。真觉入灭乃继其席。无何奉诏住持大玉山普安祐国二寺。是年七月日逝世</p><p><a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>大师 讳志德。号云岩。东昌人。十二受经于海闻和尚。习慈恩宗旨于法照禧公。尽得其蕴。至元间。世祖召见赐宴并紫方袍。命主天禧旌忠二刹日。讲法华华严唯什金刚等疏。特赐佛光大师之号。与七众授戒。必令其立誓无犯。遇岁俭煮糜粥。以食饿殍数万人。居天禧三十余年。一衲一履终身不易。<a href=\"/remen/guowubushi.html\" class=\"keylink\" target=\"_blank\">过午不食</a>。夜则危坐以苦诵丧明。忽梦梵僧迎。居内院高座。空中散花因示疾。是年二月二十七诵之不辄。顷之辞众安坐而化。世寿八十八。龛留三七颜貌红润如生。阇维舍利无数。塔于张家山。赵孟俯为记</p><p>癸亥至元三年。敕写金字藏经。学士吴澄为序曰。主上写经为民祈福。甚盛举也</p><p>吴澄 字幼清。抚州崇仁人。经传悉通贯用力圣贤之学。元明善以文学自负。闻澄易诗书春秋奥义叹曰。与吴先生言如探渊海。董士选曰。吴先生天下士也。澄尝为学者言。朱子于道。问学之功居多。陆子静以尊德性为主。问学不本于德性。其弊必偏于言语训释。故学以德性为本。又谓。为善者死则上通神明。其极品与日月齐光。为恶者死则下沦污秽。其极下与沙虫同类 八月帝崩于行幄卧所</p><p>中峰禅师 讳明本。号中峰。钱塘孙族。生有异征。为儿童时。嬉戏必为佛事。稍长闻经教。燃指臂求佛甚切。昼夜弥励。困则以首触柱。自儆期必得乃已。及入死关。密扣心要诵<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>。至荷担如来处。恍然开悟。自谓所证未极。后观流水乃大发明。自是说法无碍。著书若干卷行于世。仁宗闻而聘之不至。制金纹伽黎衣赐之。并谥号佛日广慧普应国师。是岁卒。寿六十一。腊三十五。化于本山天目</p><p>断崖禅师 讳从一。湖州德清汤氏子。幼不茹荤。姿貌巍然。师高峰参一归何处发悟。呈偈曰。大地山湖一片雪。太阳一照便无踪。自此不疑诸佛祖。更无南北与西东。峰印可之曰。后据孤峰绝顶扬声大叫。在后改名了义。赐号佛慧圆明正觉普度大师云</p><p>泰定帝</p><p>名也孙铁水儿。显宗之长子。裕宗之嫡孙也。初封嗣晋王。及英宗遇弑。以支庶入继帝统。在位五年殂于上都 帝在位灾异迭见。然守成法以行天下无事。称治平焉。改元者二。泰定致和 帝曰。凡事防之于小则易。救之于大则难。明告于众。俾知所慎</p><p>甲子泰定元年 乙丑</p><p>丙寅三年。禁西僧驰驿扰民</p><p>丁卯 帝师公哥罗入寂</p><p>戊辰至和元年七月帝崩。不立庙谥 九月文宗袭立。改天历元年。礼公哥卜文国公为师。设广教总管府。统摄僧众</p><p>明宗</p><p>名和世[王*束]。武宗长子。初封周王出镇云南。泰定帝崩。文宗遣使迎帝。帝正位于和宁之北。立文宗为皇太子。未几暴崩仅半年 张养浩自幼有行义勤学业。官至中丞尝著书三卷。一曰朝堂忠告。二曰风宪忠告。三曰牧民忠告。至是卒。赠平章。谥文忠</p><p>文宗</p><p>名图帖睦尔。武宗次子。明帝之弟也。初封怀王出居建康。以致和元年九月袭皇帝位。改元天历二年。迎明宗于沙漠。明宗殂即位</p><p>己巳天历二年。建龙翔集庆寺于建康 建崇禧万寿寺于蒋山 命奎章诸臣。辑经世大典 改建康为集庆路 以西僧辇真吃剌思为帝师。师至上命朝臣一品以下。咸郊迎大臣俯伏。进觞师不为动。惟国子祭酒孛木鲁[羽*申]举觞立进曰。帝师释迦之徒。天下僧人师也。予孔子之徒。天下儒人师也。请各不为礼。帝师笑而起。举觞卒饮。众为之栗然</p><p>庚午至顺元年。加封孔子父叔梁纥。为启圣王。母颜氏。启圣夫人。颜子复圣公。曾子宗圣公。子思述圣公。孟子亚圣公</p><p>慧光 释融照。字慧光。受业<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>修习天台教观。后从渊叟湛法师。居华亭延庆。力精教乘勤修<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。然膏继晷旦夕无间。故学由志臻。表于丛席职跻众祐四十余祀。名闻京师上嘉奖赐号。师每岁元旦。率众修金光明忏。祝厘圣寿。说法之外力礼忏摩。与诸众生扫除尘翳。摄入善根。既老弥勤。得其法者三人。僧传曰居简。曰宗矩。曰宗权。皆法门之龙象也</p><p>范椁。字德机。清江人。天资颖异。虽臞然清苦。若不胜衣。卓然自树于流俗外。吴澄志以为特立独行之士。可方东汉之君子。盖非虚美云</p><p>辛未至顺二年。翰林学士吴澄卒。有易春秋<a href=\"/ctwh/jing/13j/liji.html\" class=\"keylink\" target=\"_blank\">礼记</a>纂言。及校定皇极经世书大戴礼等书。赠临川郡公。谥文正</p><p>壬申至顺三年。四月天宁地震。五月京师地震有声。白虹并日出竟天。八月天鼓鸣于东北 京师陇西地震 帝崩于上都</p><p>宁宗</p><p>名懿璘真班。明宗次子也。初封鄜王。文宗殂遗命传位于帝。帝年七岁。在位两月而殂</p><p>临坛大德 讳惠汶。姓张氏。归德人。依耆宿釭公出家二十进具。从大德温公受菩萨戒。嗣法坛主恩公。既而行业日隆。闻望日着。从者益众。师斋戒既严。护衣惟谨。虽途行旅宿三衣一钵必与身俱。终日干干惟佛是念。缁素相率而求戒者。接迹于途。承一训言莫不欢心感戴。说法数十余年。升坛授戒四十余会。大臣接以师敬之礼。从化者盖以万数。是年十一月二十二日殁。年七十有三云(佛祖通载)</p><p>顺宗</p><p>名妥欢帖睦尔。明宗长子也。文宗时被谗出居广西。宁宗崩登大宝。在位三十六年。会 大明兵入京城。走于应昌府。一年崩</p><p>癸酉元统元年六月。初八日登位。改元者三。元统(二)至元(六)至正(二十七)礼请公哥儿监臧班臧卜为帝师</p><p>天竺法师 讳真净。字如庵华亭。姚氏子。母朱氏梦月堕怀而娠。诞时瑞光满室。有异僧。指谓其母曰。此儿海月法师之再来也。九岁依明静志公学法华经。历耳成诵。十六得度搏究诸乘。谒云梦泽公无极度公。尽得其学。大德间住海盐德藏。至治间迁松江超果。泰定间居下竺。辟寺前之径高大其门。书佛国山以揭之。至顺间上竺湛堂澄公举师自代。殚心弘法。众逾千指。上慕其道。赐以佛心弘辨之号。及金纹紫伽黎之服。师课法华寒暑不辍。是年示疾。书偈而逝。寿七十二。腊五十六。阇维舌根顶骨不坏。舍利五色。塔于本山(僧传)</p><p>甲戌元统二年元旦。汴梁雨血。着衣皆赤</p><p>三月彰德雨毛如线而绿。民谣云。天雨线。民起怨。中原地。事必变 水旱交洊 七月流星如杯。色赤有光 八月京师地震。鸡鸣山崩。陷为池百里</p><p>乙亥改元至元元年</p><p>丙子二年。宿松地震山裂 秦州山崩 黄州蝗 江浙自春至八月不雨。民大饥赈之</p><p>丁丑至元三年四月有星。孛于王良。至七月没于贯索 星名订议房星主马。又名天驷。王良善识马故名之 五月民间讹言。朝廷采童男童女。一时嫁娶殆尽 彗星见于东北 七月武涉县有蝗。尹张宽仰天祝曰。宁杀尹毋伤百姓。黑鹰啄蝗。尽命刊金履祥所著论孟考证行之。门人许谦序之</p><p>许谦 字益之。东阳人。学于金履祥。告之曰。吾儒之学理一而分殊。理不患其不一。所难者分殊耳。谦由是致其辨于分之殊。而要其归于理之一。又曰。圣人之道中而已矣。谦由是事事求夫中者而用之。自谓吾非有大过人。惟为学之功无间断耳。其教以五性人伦为本。以开明心术变化气质为先。以为已为立心之要。以分辨义利为处事之制。尝曰。已或有知使人亦知之。岂不快哉。是年卒。年六十八。门人号之白云先生。所著有四书丛说诗名物钞读书传观史等书。后谥曰文懿</p><p>同时休宁陈栎婺源胡一桂。皆以讲明道学重于时</p><p>太白 上公大将军之象。出东当伏东。出西当伏西。过午为经天。谓昼见于上也。太白少阴之星以己未为界。经天为不臣兵起也</p><p>戊寅至元四年正月。以地震赦天下 四月雨雹如拳。环玦狮象等形 信州山震 邵武雨水深二丈 巩昌山崩压死人民</p><p>己卯至元五年夏四月。加封孝女曹娥。为慧感灵孝昭顺纯懿夫人 六月汀州水高三丈余。没庐坏田 太白屡经天</p><p>宗周法师 讳子文。字宗周。四明人。得法于北溪闻公。出主宝云寺。教观淹博律规甚严。寻常对人则讷。升座讲演则滔滔。如建瓴之水。莫之御也。临终时讲十六观经。罢即欲就座别众入灭。有启曰。和尚后事未曾分付。奈何遽尔告寂耶。师曰。僧家要行便行。莫做俗汉伎俩为儿女计而有后事。众[怡-台+(恳-心)]益切。于是下座。复归方丈一一条书之。即合掌称西方四圣号。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>发愿毕遂寂。阇维舍利无数(僧传)</p><p>庚辰至元六年处士吴莱论作文如用兵。有正有奇。正者法度。如部伍分明是也。奇者不为法度所缚。千变万化元不曾乱</p><p>天如禅师 讳惟则。号天如。得法于中峰国师。住姑苏师子林。有楞严会解<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>语录净土或问十法界图说等书。行世</p><p>元粹法师 苕溪人。有<a href=\"/fojing/yuanjuejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">圆觉经</a>集注等书。行于世</p><p>休耕法师 讳逸。云门三高之一。有诗文集</p><p>辛巳至正元年。帝阅宋徽宗画称善。学士[山*(廿/(止*白*匕)/ㄆ)][山*(廿/(止*白*匕)/ㄆ)]进曰。徽宗多能惟一事不能。其身辱国破。皆由不能为君所致。人主贵能为君</p><p>元叟禅师 讳行端。号元叟。族临海何氏出家化城院。参径山藏叟得旨。大德庚子出世湖之资福。名闻京师。特旨赐慧文正辨之号。平章张闾公。举中天竺迁居灵隐。有旨设水陆斋于金山。命师说法峻事入觐。奏对称旨。加佛日普照之号。南归退处西庵。至治壬戌众请补处径山。玺书金斓三被人以为荣。师宴如也。先是宋度宗设醮秦章天庭遇上帝。为定径山四十八代住持事。四十四代虎岩。谓住持岂苟然哉。皆预定之天庭。师闻颇心非之。及师适当其次云</p><p>愚庵禅师 讳超智。字以中。族姑苏。得法于元叟端公。历住于隆教普慈二刹。帝赐以明辨正宗广慧禅师之号。已而升净慈遂主径山。四据高座敷[改-己+易]佛法。以耸人天龙鬼之听。缁素相从如云归岫。弟子集其四会语录。宋文宪序之。极其赞颂起人之敬信也</p><p>梅屋禅师 讳念常。世居华亭。黄姓。母杨氏祷观音大士梦庞眉老僧托宿而娠。生时神光照室异香袭人。出家平江圆</p></div>"
}]