[{
    "title": "释门自镜录 第2083部",
    "author": "怀信",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>释门自镜录 卷上</p><p>释门自镜录序</p><p>蓝谷<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>怀信述</p><p>余九岁<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。于今过六十矣。至于逍遥广厦。顾步芳阴。体安轻软。身居闲逸。星光未旦十利之精馔已陈。日彩方中<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>之珍羞总萃。不知耕获之顿弊。不识鼎饪之劬劳。长六尺之躯。全百年之命者。是谁所致乎。则我本师之愿力也。余且约计五十之年。朝中饮食。盖费三百余硕矣。寒暑衣药。盖费二十余万矣。尔其高门邃宇。碧砌丹楹。轩乘仆竖之流。机案床褥之类。所费又无涯矣。或复无明暗起。邪见横生。非法弃用。非时饮啖。所费又难量矣。此皆出自他力。资成我用。与夫汲汲之位。岂得同年而较其苦乐哉。是知大慈之教至矣。大悲之力深矣。况十号调御以我为子而覆之。八部天龙以我为师而奉之。皇王虽贵。不敢以臣礼畜之。则其贵可知也。尊亲虽重。不敢以子义瞻之。则其尊可知也。若乃悠悠四俗。茫茫九土。谁家非我之仓储。何人非余之子弟。所以提盂入室。缄封之膳遽开。振锡登衢。弛慢之容肃敬。古人以一餐之惠犹能效节。以一言之顾尚或亡躯。况从顶至踵。皆如来之养乎。从生至死皆如来之荫乎。向使不遇<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。不遇出家。方将晓夕犯霜露。晨昏勤陇亩。驰骤万端。逼迫千计。弊襜尘絮。或不足以盖形。藿茹[(歹*又)/食]食。或不能以充口。何暇盱衡广殿。策杖闲庭。曳履清谈。披襟闲谑。避寒暑。择甘辛。呵斥童稚。征求捧汲。纵意马之害群。任情猿之矫树也。但三障云耸。十缠萦结。拟爱乱心。狂愚患恼。自悔自责。经瞬息而已迁。悲之恨之。历旬朔而俄变。或复升堂致礼。耻尊仪而雨泣。对格披文。惭圣教而垂泪。或鹑衣木食。困辱以治之。损财去友。孤穷而苦之。竟不能屈慢山。清欲火。舍粗弊之声色。免镬汤之深诛。岂不痛哉。岂不痛哉。所以常惨常啼酸辛而不极。空藏地藏救接而无方。余又反覆求己。周旋自抚。形容耳目不减于常流。识悟神情参差于名辈。何福而生中国。何善而预出家。何罪而戒捡多违。何衅而刚强难化。所以萦纡日昊。伫叹中宵。莫识救之之方。未辩革之之术。然幼蒙庭训。早沾释教。颇闻长者之遗言。屡谒名僧之高论。三思之士假韦弦以是资。九折之宾待箴铭而作训。故乃详求列代。披阅群篇。采同病之下流。访迷津之野客。其有蔑圣言。轻业累。纵逸无耻。顽疏不捡。可为惩劝者。并集而录之。仍简十科。分为三轴。朝夕观览庶裨万一。若乃坐成龙报。立验蛇身。牛泣登阪。驼鸣绕寺。或杖楚交至。遍体火然。或戈戟去来应时流血。或舌销眉落。或失性发狂。或取把菜而作奴。或侵束柴而然足。寄神园木割肉酬施主之恩。托迹圜扉变骨受谤人之罚。昔不见而今见。先不知而始知。号天扣地莫以追。破胆摧肝非所及。当此时也。父母百身而无赎。亲宾四驰而不救。货赂委积而空陈。左右抚膺而奚补。向之欢娱美乐为何在乎。向之朋流眷属为何恃乎。呜呼朝为盛德唱息于长廊。夕为殇子哀恸于幽房。匪斯人之独有。念余身兮或当。傥百年兮一遇。将耻悔兮何央。可不怆乎。可不惧乎。故编其终始。备之左右。伫勖书绅之诫。将祈战胜之功。其有名贤雅诰。哲人殊迹。道化之洿隆。时事之臧否。亦附而录之。以寄通识。古人云。百年影徂。千载心在。实望千载之后。知余心之所在焉</p><p>释门自镜录条目</p><p>卷上业系长远录一勃逆阐提录二轻毁教法录三妒贤嫉化录四忿恚贪鄙录五俗学无裨录六懈慢不勤录七</p><p>卷下害物伤慈录八饮啖非法录九悭损僧物录十</p><p>十科所收凡七十三条(雅诰二章。事迹七十一人。附见十四人)</p><p>业系长远录一</p><p>西域圣者达磨蜜多五百世作狗身事</p><p>佛灭度后罽宾山中。有圣<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。名达磨蜜多。才慧超绝<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>第一。蜜多住处有三重窟。时有二僧。远闻胜名故往<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。见尊者獘衣丑露。于下窟窖前为欲调伏身心为僧然火。是时二僧问言。长老达磨蜜多为在何处。答曰。在彼重窟最上房中。彼便往寻。尊者以神足力欻还本房。二人既见咸生疑怪。曰大德<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>威名满阎浮提。何故自屈为僧然火。蜜多曰。子今当知。我念<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>受苦长远。若使头手可得然者。吾当为僧而并然之。况余身分及以然火。何足为难。吾念往昔。五百世中常为狗身饥饿穷困。虽经多身唯两得饱满。一者有人饮酒大醉道侧反吐。我行遇见获一饱。又曾为贫家作狗。<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>煮粥以器盛之。有事暂行。我以饥故内头器中食之。得饱拔头不出。人来见之。大起嗔心。便以利刀斩断吾头。自念狗身五百度受。虽逢二饱而失身命。是故思惟。生死长久周旋五道。随所生处。无不受苦。故吾今者不惮劬劳。何辞为僧而然火也</p><p>西域圣者阇夜多遇见鬼及乌叹生死久远事(出付法藏传)</p><p>昔传法圣者阇夜多。将诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>入城。至门惨然不悦。小复前行路见一乌。忽然微笑。弟子怪问。因而答曰。初于门下见饿鬼子。饥急困弱自言。母生我已。入城求食。自别已来。经五百年。饥虚穷乏命不久远。及见其母。具述儿意。母曰。我辞入城经久求食不得。设得少唾强鬼所夺。始于今日值一人吐。边无余鬼。将欲与子。然又门下多有鬼神畏所夺。故不敢持出。愿尊者慈荫将我出城。所赍涕唾与子共食。吾又问言。生来几时。答曰。我见此城七返成坏。吾闻彼言深悼生死无有边际。是以嚬蹙惨然不乐。又于过去九十一劫。我于尔时为长者子。至愿出家厌离尘欲。我若出家必断众结成阿罗汉。但为父母不见从志。强为娉妻冀求继嗣。既不获免。娶妻生子。又求出家。儿年六岁。父母教儿。汝父辞我欲出家者。汝可抱足语父。曰若舍我去谁当活我。先当见杀然后可去。我见儿抱遂生爱恋。便语子言。我今为汝不复出家。由是儿故。不得道证。九十一劫<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>五道。以生死身。未曾相遇。今以道眼。见生乌中。愍其婴愚。由是故笑耳</p><p>西域圣者离越辟支佛曾谤人偷牛得报事</p><p>昔月氏国城西有大山。是离越辟支住处。猛上去此。不远有人失牛。寻到此山。值此辟支然火染衣。宿业力故。当于尔时钵变为牛头。法衣变为牛皮。染汁变为血。染滓变为肉。柴变为骨。其迹既尔。遂为牛主执入狱中。弟子推觅莫知所在。从是荏苒年经十二。后遇<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>知在狱中。便向王说。我师在狱愿王放赦。王问狱典有僧否。狱典曰无僧。弟子白王愿唤狱中沙门者出。我师自出。狱典寻唤辟支佛即出。此辟支佛在狱既久。发长衣坏沙门形灭。诸弟子等礼而问曰。师何在此。师于尔时答以上事。弟子复问。宿世造何因。今令致此。师答曰。吾于昔时谤他人偷牛。致使如此耳</p><p>晋沙门慧达死入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>并宿世犯戒事(出冥祥记等)</p><p>释慧达俗姓刘名萨荷河西离石人也。在家时长于军旅。不闻佛法。尚武器好畋猎。年三十一暴病而死。体且温柔。家未敢殓。至七日而苏。说云。将尽之时。见两人执缚将去。向西北行。行路转高。稍得平衢。两边列树。见一人执弓带剑当衢而立。指语两人将荷向西。见屋舍甚多。俄见两沙门。谓荷曰。汝识我否。荷答。不识。沙门曰。今宜归命释迦文佛。荷如言发念。因随沙门俱行。遥见一城。类长安城而色甚黑。盖铁城也。见人身甚长。大肤黑如漆。头发曳地。沙门曰。此狱中鬼也。其处甚寒。有冰如石飞散。着人头头断。着脚脚断。着臂臂断。二沙门云。此寒冰地狱也。荷乃内自克责便识<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。知两沙门往维卫佛时并其师也。于时得作沙门时。以犯俗罪不得<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。虽世有佛竟不得见。从此已来再得人身。一生羌中。今生晋地。次见刀山地狱。次第经历观见甚多。狱狱异域不相杂厕。人数甚多。不可称计。楚毒科法略与经说相符。俄有金色晖明皎然。一人长二丈许。相好严华。举体金色。左右曰。观世音大士也。皆起迎礼。有二沙门形质相类。并行东西。萨荷作礼毕。菩萨具为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。出千余言。又云。汝应历劫备受罪报。以尝闻经法生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>心。今当见受轻报一过便免。汝得济活可作沙门。萨荷又遇见。有人谓曰。在襄阳时何故杀鹿。荷跪答曰。他人杀鹿。我加枪耳。又不啖肉。何缘受报。时即见襄阳射鹿之地。草树山薮宛然在目前。所乘黑马并皆能言。悉证荷杀鹿年月时日。萨荷惧然无对。须臾有人。以叉叉之。投镬汤中。自视四体溃然烂碎。有风吹身聚水岸边。忽然不觉还复全形。人复谓曰。汝又射雉亦尝杀雁。言已叉投镬汤。准前糜烂。受此罪已乃遣萨荷去。去入一大城。有人居焉。谓荷曰。汝受轻报。又得还生。是福力所扶而今已后不复作罪。乃遣人送萨荷。萨荷遥见故身。意不欲还。送人推引。久乃附形。而得苏活。奉法精勤。遂即出家。其后禅悟妙化。别有传记</p><p>唐沙门道光多生求度不得官名事(出新录)</p><p>释道光。并州人也。俗姓张氏。家风静退。耻居名官。光童年迈俗。夙知斋戒。十岁辞亲。周求问道。因自剃落飘寓关中。后事道宣律师。行解尤着。轮诚历思。晓夕咨承。至于<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>温清。邈绝俦伍。宣以其情礼兼到。弥加诲诱。精学数纪遂成洪器。然永徽嗣历留意释门。频有度人。光每缘差不预。中心愧恨恒怀怏怏。至麟德年中。宣以戒德。忽感天神往来。累朔共谈名理。从过去数佛。已来行坐时处莫不缕悉。宣因问经律开遮圣迹由绪。乃着通记一部十卷。又<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>之暇。问天神曰。宣有弟子道光。孝爱淳至不知。何业遂能如此。神曰。光与律师为父子门徒。已历三百余生也。恩狎绵久故致其然。残报余缘今犹未尽。又问。光频求度戒。竟不遂心。复何业所致。神曰。光昔毗婆尸佛时。曾为寺主时。有一僧。戒行多阙。寺主忿之。送令<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>。缘此业故。生生入道不得官名。此业余殃今由未尽。宣亡之后。光择木东西。因止河北。至上元二年。天皇为孝敬皇。重修白马寺。寺主崇义备尽搜寻。光以声闻夙昭。应兹嘉选。奏名入内。光因染疾。敕下魏州。身已殂逝。验天言信矣。有抱谅禅师。与光周旋数载。屡承光说默记在心。及闻名就身亡。方知其业命如此。向余具说</p><p>勃逆阐提录二</p><p>宋北多宝寺道志偷相珠受苦事(尼智通附)</p><p>道志未详何许人。少出家。住宋北多宝寺。尝典知殿塔。幽窃帐盖等物。后遂偷像眉间相珠。既而开穿垣壁。若外盗者。故僧众不能觉也。积旬余日而得病。便见异人以戈矛刺之。时来时去来辄惊叫。应声流血。初犹日中两度如此。其后弥甚刺者渐。数伤痍遍体。呻呼不绝。其寺僧颇疑其有罪。欲为忏谢。始问犹讳而不言。将尽二三日乃具自陈列。泣涕请救。曰吾愚勃昧道。谓无涂炭。失意作罪。招此殃酷。生受楚栲。死婴刀镬。已麋之身唯垂哀愍。别无余物。唯衣被毡履或充足一会。并须请故旧为吾<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。昔偷像相珠二枚。一枚已属妪人。不可复得。一枚以质钱。在陈照家。今可以赎取。言终而卒。既赎相殊。并设斋忏。初工人安珠。展转回旋终不谐合。众僧复为礼拜<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>乃得着焉。年余而同学等。于昏夜闻空中有语。详听即道志声也。云自死已来。备婴痛毒。方累年劫未有出期。赖蒙众僧哀怜救护赎相珠故。于苦酷之中。时有间息。<a href=\"/remen/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>罔己。故暂来称谢。言此而已闻其语。时腥腐臭气不可言。言终稍歇。即泰始末年也</p><p>尼智通。少出家。住京师简静寺。信道不笃。元嘉九年师死。罢道嫁为魏郡梁犀甫。为妻生男。六七岁家甚贫穷。无以为衣。通为尼时有数卷素无量寿法华等经。悉练捣之以衣其儿。居一年而得病。恍惚惊悸竟体剥烂状若火疮。有细白虫。日出升余。惨痛烦毒昼夜号叫。闻空中语云。坏经为衣。得此剧报。旬余而死</p><p>北齐晏通盗钱耻像现身着癞地陷事(出关中风俗传记)</p><p>晏通不知何许人也。虽厕道门。志多愚鄙。倚托<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。以祈润沃。尝铸一大铜像。光趺侍卫并悉阙之。所得施财辄以自入。而号像为出课奴焉。后时经久片无所得。通便执杖谓像曰。奴何不出课。将欲笞之。未举手间。忽见一人。长二丈被戈甲怒目直前曰。无赖竖子何忍于佛像如斯乎。便提颈离地数尺。铁杖鞭之。从首至足遍身流血。通叫呼求哀。声闻里外。道俗观者莫不寒心。十日以外杖疮之下。更生癞疮。大如桃杏。脓泄流溢。遍体红赤。状若火然。去之数步。热气傍及。通但晓夜号叫宛转脓血。经百余日。其房乃地陷数尺。于是而终</p><p>唐思礼折像盗绢被神压打事</p><p>思礼未详其氏。雍州蓝田人也。立性庸浅志规苟利。虽复缁衣未洽真化。以咸亨年中。于蓝谷悟真寺夏日安居。于时众徒数十率多精炼。礼偷形滥吹每怀不轨。乃于殿内窃像里绢。数日诸僧觉之。莫知谁盗。递相推鞠人怀疑惑。愧悔者多各欲驰散。时上座法藏对众言曰。传闻此寺灵迹极多。今既有人毁折像。护伽蓝神岂当默尔。三日之内愿示其事。令僧众得安。言讫各归。礼于钟楼下所住房昼寝。遂见白衣大神。陷礼于床壁之间。垂首向下以石压之。至明旦诸僧既不见礼。就房访觅。其房坚闭甚牢开竟不得。经一宿怪之逾甚。遂凿穴户扉。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>礼在床间。像里之绢叠在身上。遂共提举致于门外。见其面色如漆气息不通。僧等为之忏悔。久乃稍稣。自陈<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>。至夜而遁。莫知所终</p><p>轻毁教法录三</p><p>西域无垢友论师谤大乘五舌重出事(西域传于阗沙门附)</p><p>昔西域论师。名毗末罗蜜多。唐言无垢友。迦湿弥罗国人。于一切有部而出家焉。博综小乘声驰五印。将归本国途。次众贤论师之塔也。拊而叹曰。惟论师雅量清高抑扬大义。方欲挫异部立本宗业也。如何降年不永。我无垢友猥承末学。异时慕义旷代怀德。世亲虽没宗学尚传。我尽所知当制诸论。令赡部洲诸学人等绝大乘称灭世亲名。说是语已。心发狂乱。五舌重出热血流涌。知命必终裁书。悔曰。大乘教者佛法之中究竟说也。名味泯绝理教幽玄。轻以愚昧驳斥先进。<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>皎然灭身宜矣。敢告学人厥鉴斯在。各慎尔志无得怀疑。即大地为震命遂终焉。当其死处地陷为坑。时有罗汉。一见死处而叹曰。惜哉苦哉。今此论师任情执见。毁恶大乘堕无间狱矣</p><p>于阗沙门跋折斯罗那。此名金刚军。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>小乘<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>学。不信大乘。每斗诤诽谤。两目因之失明。经十余年。盲无所见。后闻师子友诲。乃未能全信。且诫诵<a href=\"http://www.gming.org/fozhou/guanyinzhou/\" class=\"keylink\" target=\"_blank\">观音心咒</a>。便即两目明彻。因大<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>归信大乘。舍于小学</p><p>宋京师东安寺释慧严神诫事(僧嵩僧渊附)</p><p>释慧严。姓范豫州人。理识清博学者所宗。时大<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>初至宋土。文言致善而品数疏简。初学难以措怀。乃共慧观谢灵运等。依泥洹本加之品目。文或过质颇亦治之。删四十卷者为三十六卷。始有数本流行。因寝寐之间忽见一人。身长二丈仪形甚伟。谓之曰。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>尊经何以轻加斟酌。严觉已惕然不悦。犹有意以立。未有改心。至明夕复见昨人。状有怒色。曰若执本图寻令君知之。严惊失声。乃更集僧收前本。随得而禁之。识者谏曰。此盖欲诫励后人耳。若必不应何容今始梦耶。严虽以为然终怀惧矣</p><p>又太始之中。中兴寺僧嵩明数论。末年僻执谓佛不应<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>之日舌根先烂</p><p>又梁代彭城僧渊诽谤涅槃。即舌根斯须消烂</p><p>齐邺下大觉寺僧范布萨见神责竖义事</p><p>释僧范。姓季氏平乡人。二十九出家。学行兼富。为时所尚。尝讲<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>。辄有一僧。毁云。竭斗何所解。当即有神。特加打楚。死而复稣。又经宿他寺。正逢布萨。有僧升座将欲竖义。乃曰。竖论<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>深会圣言。何劳说戒。僧常闻耳。忽见一神。形长丈余貌甚雄峻。来到座前问竖义者。今是何日。答是布萨日。神即以手搭之。拽于座下委顿垂死。次问上座搭拽同前。范自是至终竟无说欲。乃至疾重舆而就僧。所以重兹戒日乐见法身也</p><p>齐邺下宝明寺僧云废布萨被神害事</p><p>释僧云。不知何许人。聪辨辞令备闲大小乘。住宝明寺襟带僧伦。以四月十五日。临说戒时。僧并集堂。云居上首。乃白众曰。戒本防非人人诵得。何劳烦众数数闻之。可一竖义令后生开悟。气格当时无敢抗者。咸从之讫于夏末常废说戒。至七月十五日。将升草座。失云所在。大众以新岁未受。交废自恣。一时崩腾四出追觅。乃于寺侧三里许古冢内得之。遍体流血。如刀割处。借问其故云。有一丈夫。执三尺大刀。厉色嗔云改变布萨妄令竖义。刀脍身形。痛楚难忍。因扶接还寺。云竭情忏悔。乃经十载说戒。布萨读诵众经。以为常业。临终之日。异香迎之。神色无乱。欣然而卒</p><p>唐襄州神足寺慧眺谤三论拔舌三尺事(孝慈神肪信行附)</p><p>释慧眺。姓庄氏。少出家。以小乘为业。驰誉江汉。承象王哲公讲三论。心生不忍曰。三论明空讲者着空。言讫舌出三尺。鼻眼两耳并皆流血。七日不语。有汰律师闻之。曰汝大痴也。一言毁经罪过五逆。可信大乘方得免耳。乃令忏悔舌还收入。便舆往哲所誓听大乘。后每讲法华华严。用陈忏谢。尝在松林坐禅。见有三人形服都雅。请受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>。受讫白。曰禅师大利根。若不改心信大乘者。千佛出世犹在地狱。闻此语重属。涕泗交流大哭还寺。在哲房前宛转呜咽。不能得语。又劝化俗士造华严大品法华维摩思益各百部。终时感林树变白。可谓过而能改焉</p><p>慈门寺僧孝慈。年可五十。幼少已来依信行禅师。说三阶法。以修苦行。常乞食为业。六时礼忏着粪扫衣。随所住处。说三阶佛法。劝诱朦俗。并说三阶佛法时常言。不合读诵大乘经。读诵者入十方阿鼻地狱。急须忏悔。后于一时在岐州。说三阶佛法。于时有一优婆夷。持法华经。又劝有缘。同持法华经。其禅师劝彼持法华经优婆夷等言。汝等持法华经。不当根机。合入地狱。劝令舍诵。遂有数个优婆夷。舍持法华经。于禅师处众中。忏悔持法华经罪。其元首劝持法华经。优婆夷情中不忍。遂于大斋日。禅师为众说三阶佛法。当此之时座下万人已来。其优婆夷于大众中烧香发愿言。若某乙持法华经不称佛意。愿某乙见身着恶病。令大众共知持法华经得此罪报。又愿生身陷入地狱。愿众同见。若某乙持法华经称顺佛意。愿禅师亦尔。当此优婆夷发愿之时。其禅师被神打。失音不语。西高座上唱集录者。亦失音不语。更有五个老禅师。亦失音不语。其先舍诵法华经数人。因此便<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>诵法华经。更生殷重</p><p>慈悲寺僧神昉。少小已来听学十轮经。精勤苦行特异常人。着粪扫衣。六时礼忏。乞食为业。每讲十轮经。常说<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>不合读诵大乘经。读诵者堕地狱。毕至命终时。生身被地狱火烧。傍身有黑烟气。于时济法寺僧思简。亲见此事信知。断学<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>必有恶征见身立验</p><p>神都福先寺僧某乙。于一时中忽然命终。遂于业道中。见信行禅师作大蛇身。遍身总是口。又见学三阶人死者。皆入此蛇身口中莫知去处。其僧即活。因此故来向京。报僧静禅师。僧静不信。遂即却归向都</p><p>妒贤嫉化录四</p><p>齐相州道秀变作蛇身事</p><p>道秀少出家专精学。问咸称神俊。学徒云萃。宗匠当时。有同学慧懿。年卑数岁而超悟过之。戒素自居高谈出众。于是名振邺都道俗倾仰。遂来与秀对寺开讲。秀心怀妒嫉。专思折辱。而懿声闻转高无由一启。秀以暴连祸将有异图。营卫既繁卒无得醒。后与弟子出城。止一树下秀睡卧。忽旋风勃起来。蒙秀身双足俄变合成蛇尾。如此稍上至胸。悲号谓弟子曰。我以恶心转炽欲害懿师。毒害内蒸变成蛇身。业报如此。悔之无益。可取房中衣物为我作福。并谢懿师<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>欢喜。言讫忽变为蛇。长二三丈许。须曳草中数百小蛇竞来迎接。于是而去。远近闻之。莫不为其伤叹也</p><p>隋杨州自塔寺道契神打杀事</p><p>道契姓陈氏。颖川人也。容貌最陋。言情鄙僻。虽造净居志婴羁绁。然薄闲医诊。不好明法。为浅识所知由斯。矜诞轻陵宿少。寺有沙门德邻。器业通瞻。妙解毗尼。兼<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>慧。劳谦退静风被遐迩。与契年腊肩随而誉望隆重。契恶其光价。恒加谤黩。邻每虚受逊辞承候颜色。润之以<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。诱之以慈仁。契乃含毒内烝日月弥盛。怀奸诈斗伪。遂相诬告。时县宰刘义。与契周旋信其谗说。备加非理。诡结占辞。断邻还俗。邻不胜悲恨。顶戴<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>。对众垂泣。将心自誓。于是举众哀痛咸增愤结。指契而私祝者盖难量矣。经数日契居房昼寝。忽见四神长百尺。各将部众从。直至其前。中有一神。怒目言曰。我毗沙门故来取汝。汝能贼害善人使如此邪。命鬼卒扑之倒提出。契惊号彻叫声闻闾巷外。诸僧犇竞往观见。契去地数尺。头手下垂耳目口鼻并皆流血。冉冉空行似有持者。至门外都街。忽然堕地气绝复稣。才辩数言而卒。于时道俗浑合怪喜相趋。排贤嫉德者莫不革诚迁虑矣。刘公目睹妖征。披肝悔过。请邻归寺。敷弘宝训。邻广化导有缘。写法华百部般若千卷。设万人会。为契陈忏愿消怨障</p><p>唐并州石壁寺僧吐蛇改悔事</p><p>并州石壁寺有僧。失其姓名。妒忌善人多行诡道。寺僧明寂者。戒行贞肃诚在住持每。欲与众共修禅慧。此僧动为励恶压绝正法。视寂如怨万途毁谤。不胜恚毒。操刃拟之。僧有尊师。业理高素对众诃责罚令恭立。虽从师命忿意弥坚。少长开谏确然不拔。立经二日寂及诸僧反从悔谢。但嗔目忿气姿容转恶。暨三日房中僵卧而死。寂乃其师僧众等慨怪哀痛。恨不识物情。就其尸边悔过自责。复为铸像转经代其忏洗。至暮目闭气续乃吐一蛇长尺余。走出户外俄便稣活。于是追悔前愆。奉行慈忍。敬寂如师。遂成胜士</p><p>唐衡州衡岳寺慧期患目苦死事</p><p>慧期晋州人也。流寓出家。住衡州衡岳寺。而道志殊寡。妒贤尤剧。外持威仪。内多腐败。有寺主义本。高行名僧。携诱四方敷弘万善。以载初元年四月八日。于衡岳寺般若台。为僧受戒。期年卑德浅。不预十师之数。勃然怀忿。将起异图。七日暮间来到山寺云。有人告此处反逆。掩兵寻至。何得纷纭浪为聚集。时寺主义本语期云。汝欲作恶缘破他<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。若不急悔使汝两目失明。或当着癫。期气愤色变。逡巡返路。未经月余往襄州市易。因患两目疼痛。数日而终</p><p>西域须陀洹人得恶病身虫口臭事</p><p>昔西域传法罗汉优波笈多。将一弟子。乞食至旃陀罗舍。有旃陀罗子。得须陀洹果。身有恶病。一切身体为虫所食。口气臭秽。弟子问言。何缘须陀洹人而受此报。笈多答言。此人先世出家。其为维那时众中有一罗汉。居此恶病。搔刮作声。维那语。虫食汝而作此声。即牵臂出言。汝入旃陀罗室去。罗汉语言。汝当<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。莫往来生死受苦。于是维那即便忏悔。悔竟得须陀洹果。今此小儿是也</p><p>忿恚贪鄙录五</p><p>西域<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>贪味怀恨现身变作龙事</p><p>昔西域健驮罗国有阿罗汉。常受大雪山顶池中龙王请入宫<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。每至中食以<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力。并坐绳床。凌虚而往。有侍者沙弥。密于绳床之下。攀援潜至龙宫。龙王因请留食。以天<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>饭。供养罗汉。以人间味。而馔沙弥。罗汉饭已沙弥涤器。器有余粒。骇其香味。即恨师忿龙。便起恶愿。愿所有福力。于今悉现断此龙命。我自为王。沙弥发是愿时龙王已觉头痛矣。龙虽悔谢沙弥不受。既还至伽蓝。更至诚发愿。恶业所致。是夜命终为大龙王。威猛奋发遂来入池。杀龙王居龙宫。有其部属。以宿愿故兴暴风雨。摧拔树木。欲坏伽蓝。时迦腻色迦王怪而发问。其阿罗汉具以白王。王即为龙。于雪山下立伽蓝。并起塔高百余尺。龙每坏之。王恒修复。凡成坏七返。王耻之将填龙池。龙惧而谢曰。我以恶业受身为龙。龙性猛暴不能自持。今若更立伽蓝。不敢摧毁。可每遣一人候望山顶。黑云若起急即鸣钟。我闻其声。恶心当息。至今不绝焉</p><p>汉洛阳安世高同学法行受蟒蛇身事</p><p>释法行。本安息国人。与神僧安世高为同学。性多嗔恚。分卫道次施主不称每辄怼恨。高骤止之。罔有悛心。如此二十余年。高将别行辞诀。我当往广州毕宿世之对。卿明经精勤不在吾后。而性多恚怒。命过当受恶形。我若得道必当相度。行既亡便为[邱-丘+共](居颙切又作宫)亭湖神。高既得道。便往其庙。庙旧有威灵。商旅舟人。特怀敬惮。高与三十余船奉牲请福。神乃降祝曰。船中有沙门。可更呼上。客还惊愕请高入庙。神告曰。吾昔外国与子俱出家学道。好行布施。而性多嗔恚。今为庙神。周回千里。并吾所治以布施故珍玩甚丰。以嗔恚故堕此神报。今见同学悲忻可言。寿尽旦夕。而丑形长大若于此舍命秽污江湖。当度山西泽中。此身灭后恐堕地狱。吾有绢千匹。并杂宝物。可为立寺营塔使生善处。高曰。故来相度。何不出形。神曰。形甚丑异众人必惧。高曰。但出众不怪也。神从床下出头。乃是大蟒蛇悲泪如雨。须臾还隐。高即取绢物。辞别而去。舟侣扬帆。蟒出身登山而望。众人举手然后乃灭。高达豫章以物造寺。俄而神即命过。报云。得生善处。后人于山西泽中见死蟒。头尾数丈余。今浔阳县有大蛇村是也</p><p>宋西镇寺昙遂死作庙神事</p><p>竺昙遂。不知何许人。少游放荡。不修戒行。而矜傲自持长于奸宄。或一言致犯便积年怀恚。同寺长少莫不被其嗔憾也。尝一夕梦。妇人来语。君应作青溪庙神。后遇疾将终。谓同学曰。我平生多忤少于质直。更以福德浅薄。当受鬼神之身为青溪庙主。诸君有缘可垂访也。及死果闻庙所有新神。诸道人往至庙中与相酬对。音响言笑犹若平生。乃请僧转经。有慧觐沙门。旧恒读诵。因为作数契。每讫吟沈。亦辄唱菩萨面。悲不自胜。皆为之流涕。因言。今受恶身非常丑秽。艰辛剧苦何可复言。弟子旧房户限下有钱五千。可为追福。庶离斯苦。于是而别。僧为忏悔设齐。庙遂寂无神迹也</p><p>齐青州道携悭财频得重病事</p><p>道携。俗姓王。不修戒行。广营田业。积布绢绫绮。动盈万计。而贪惜鄙吝不拔一毛。后忽得重病。隐处合便利不通。命将欲终。此寺有一法师。来为说法。心少开悟。遂舍所有三分之一。遍施才讫其病立即轻愈。病寻差已数日间。捡挍阁上见空无物。追忆财帛遂尔成狂。专唱贼云。诸寺众僧来劫我物。同侣开谏初无醒窹。法师乃遍告诸寺令还财物。携见已叫声方止。一两日间旧病还发。困苦更剧。复请法师。重求改悔。法师诃责劝喻。令舍悭贪还施前物。病又再愈。既差之后。追忆钱物常怀恚恨。数日而卒。卒时目大如盏。遍体红赤</p><p>齐宋州昙亮悭惜变作蛇身事</p><p>昙亮。俗姓傅氏。幼出家微听习。籍以先福利养。丰委积聚绵绢数出万余。而悭愚自蔽身不衣食。有北州严禅师。戒行素立僧。每年常请名德转藏经。一遍闻其富有。从行告乞。亮乃反发致嗔骂云。尔自有衣何故相恼。或有贫人从乞。亦复骂言。汝堕不勤致贫困。自少迄老不舍毫厘后遇患。困笃寺僧往问。悬见即嗔云。终无好心。只须我物。三五日后寂无人省候。又于合瞑便即闭门。卧于柜上数日。诸僧试觇之。乃见变或一蛇长二丈蟠在柜上。便遣人送之。送已还返。后置深坑。遂绝不见</p><p>齐齐州道慧钱夜移走事(昙慧附出)</p><p>释道慧。俗姓张。戒行多阙。专求帛货。数十年成二千五百贯。纯用麻绳手自穿系文文相向。背背相压。期满三千贯方将费用。后梦见一僧。来语曰。汝悭惜钱财不肯作福。襄州有李德胜。大营功德。今将汝钱送乞其人。令修福业。梦觉捡钱如言不见。遂懊恼吐血。明旦不出。比房往问。慧具陈其事。众嗟怪之。慧遂往襄州寻李德胜。胜曰。诚有之。弟子夜闻声如两石斗。至晓寻觅。于草[廿/积]下得一千五百贯文。竹丛下得一千贯。虽然师钱以何为记。慧以实告之。德胜将自捡验果然不异。胜曰。财属吾家。先用者得。师既不用。天神夺之见。送弟子令修福业。胜乃对慧分散一千五百贯。以营功德。一千贯与慧劝布施。告曰。若更悭惜不久还来。慧得钱亦即檀舍不敢留也</p><p>渤海沙门昙慧。有钱百贯文。面各两两相合。柜内盛之。慧在别舍梦失其钱云。是并州檀坊人姓名将去。寤而开柜视之则无钱矣。依梦往造其门乞食。主人云。贫无饭。昙慧曰。新得百贯文何为也。主人惊曰。实始得钱。此将与君。慧辞云。天以此钱与君。贫道不得取也</p><p>隋相州大慈寺僧纲不好供养神被责事</p><p>北齐释僧纲。少以习禅为业。与沙门洪献同房。献戒行精着。每感一神。自称般若。来从受戒。数数谈话。纲性多悭。般若取其衣物。辄以施献。献告纲终不信。神遂发彻纲房。衣物被案狼藉满庭。竹扇称尺并皆摧折数段。神于空中语曰。僧纲不好设斋会供养<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。我会祸汝未央。纲无奈之何。但恐迫不已。便私费财物营诸斋福。般若曰。既能行福今相放矣</p><p>唐济州灵光寺僧惜钵暴亡变作蛇身事</p><p>济州灵光寺。有一老僧失名。净修戒行。常持一钵。数十余年未尝遣人执捉。后因遽务令沙弥洗之。手误坠破此钵。老僧闻之惊呼失声。恨惜之甚遂偃卧而死。弟子送葬于野。经数日化作大蛇。缠绕沙弥从足至顶。屈头向下将欲吞之。僧徒惊咒愿曰。缘一钵之故。悭嗔毒恶死作蛇身。不悔往愆。又欲吞杀弟子。甚大罪业何故如斯。广说<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。为之忏悔发愿。良久蛇乃解身而去。沙弥迷闷痴騃旬日渐醒</p><p>唐京师胜光寺僧智保死作塔神事</p><p>释智保。河东人。少出家。以戒行驰誉。英猷茂实僧传具之。而立性刚毅寡于慈顺。及将终告友人慧满曰。余欲死矣。而来报精神不得超胜。似作守寺之神而止于西院佛殿。余频以法遣之。卒不能离。言讫便绝。自尔西院佛殿。人罕独登。时辄须开。无不栗然毛竖。及后百余日尝有老姥。内怀酒食将遗一僧。行至寺门忽遭神害。身死委地器物流离。寺众惮之知其有征也</p><p>唐新罗国兴轮寺僧变作蛇身事(一尼附录)</p><p>新罗国大兴轮寺第一老僧。厥名道安。自小出家即住兹寺。又薄解经论。为少长所宗。然于饭食偏好拣择。一味乖心杖楚交至。朝夕汲汲略无宁舍。众虽患之莫能救止。后因抱疾更剧由来。骂詈嗔打挥掷器物。内外亲邻不敢觇视。经数日遂变作蛇身。长百余尺。号吼出房径赴林野。道俗见闻。莫不伤心而诫矣彼又有一尼。性亦多嗔。死后数日现形。告师云。生恶处作毒蛇身居在城南。泣涕辞去。后果于城南数里有一蛇。头大如斗。身长三丈。行则宛转逢人必逐。遇之多死。希有免者。人畜往来深以为诫矣</p><p>俗学无裨录六</p><p>西域波尔尼仙造声论后身无业事(西域传)</p><p>昔如来去世垂五百年。有阿罗汉。自迦湿弥罗国。至健驮罗国婆罗邑。见一梵志捶训童稚。问何苦此儿。梵志曰。令学声明业不时进。罗汉[这-言+(占@口)]尔而笑。梵志曰。沙门者慈悲为情愍伤物类。仁今所笑愿闻其说。罗汉曰。汝颇尝闻波尔尼制声明论垂训于世乎。曰具闻之。罗汉曰。汝子即是彼仙。犹以强学玩习世典。唯谈异论不究真理。神智唐捐流转未息。昔南海之滨有一枯树。五百蝙蝠于中穴居。时有商侣止于树下。既属风寒。人皆饥冻。聚[廿/积]樵薪蕴火其下。烟焰渐炽枯树自然。时商侣中有一贾客。夜分已后诵阿毗达磨藏。彼请蝙蝠虽为火困。爱好法音忍而不去。于是命终随业受生俱得人身。舍家修学乘闻法音聪明利智并证圣果。迦尼色迦王与胁尊者。招集五百贤圣。于迦湿弥罗国作毗婆沙论。斯并枯树之中五百蝙蝠也。余虽不肖是其一数。斯则优劣良异飞伏悬殊。仁今爱子可放出家。功德之大不能详述。时阿罗汉说此语已。示神通事因忽不见。梵志深生惊异。遂放子出家也</p><p>宋彭城寺慧琳毁法被流目盲事(慧休附)</p><p>慧琳姓刘氏。秦郡人。善诸经及庄老。诽谐好语笑长于制作。故集有十卷。而为性傲诞颇自矜伐。其师道渊学行僧也。宋文帝甚器之。渊尝诣傅亮。琳先在坐。及渊至不为致礼。渊怒之彰色。亮遂罚杖二十。琳后着白黑论诋诃释教。颜延之及宋炳难驳琳论。各万余言。琳既自毁其法被斥交州。因患目盲。数岁愤结而卒。其论备在梁沙门僧祐弘明集具之</p><p>慧休字茂远。俗姓汤。住长干寺。流宕倜傥嗜酒好色。轻释侣慕俗意秉笔造牍。文辞斐然。非直黑衣吞音。亦是世上杜口。于是名誉顿上才锋挺出。清艳之美有逾古歌。流转入东。皆良咏纸贵赏叹绝伦。自以微贱不欲罢道。当时有清贤胜流。皆共赏爱之。至宋世祖孝武始敕令还俗。补杨州文学从事。意气既高。甚有惭愧。会出补勾容令。不得意而卒。出沈约宋书</p><p>梁伪沙门智棱罢道毁法失音舌卷事(道学传王斌附)</p><p>智棱俗姓贾。幼出家事沙门道乘。为师聪悟过人。长于谐谑。善涅槃净名。尤攻数论。庄老二书弥所留意。后值寇还俗。生计屡空。而为道士孟悉达往来提诱给以资费晨夕晓喻使作黄巾。棱愧其为惠因从之。既夙有声闻。便为道宗。解西升妙真及诸大义皆棱之始也。而道家诸经略无宗指。棱遂参<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>为之润色。武帝未舍道时频引棱。于五明殿竖义。棱暮年于妙门馆。为诸道士讲西升经。在席者数百人。而盛引<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>剖析符会。抗辞正气欣然自得。俄而失音。舌卷下唇齿相去数寸。但流泪而已。遂死于<a href=\"/remen/jiangzuo.html\" class=\"keylink\" target=\"_blank\">讲座</a>焉。识者闻之以为破法之验也</p><p>又有王斌者。亦少为沙门。言辞清辩兼好文义。然性用躁诞多违戒行。体奇性异为事不伦。常着草屦来处上座。或着屧逍遥衢路既频忤僧众。遂反缁向道。以藻思清新乃处黄巾之望。邵陵王雅相赏接。号为三教学士。所著道家灵宝大旨总称四玄八景三洞九玄等数百卷多引佛经。故有因缘法轮五道<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>天堂地狱饿鬼宿世十号<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>十方三十三天等。又改六通为六洞。如郁单之国云弃贤世界。亦有大梵观音三宝六情四等<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>三业三灾九十六种三会六斋等语。又撰五格八并为论难之法</p><p>唐京师普光寺明解罢道身死托梦求福事</p><p>明解字昭义。姓姚吴兴武康人也。童幼出家住西京普光寺。为性聪敏。少有文藻。琴书丹青时无与竞。颇种三绝。然矜名浅识。滞酒荒情。盖为文侠者所知。贞淳者所弃。每见无学问僧多号之驴子。显庆五年天皇大帝造西明寺。搜集龙象以居之。其取一人令弘福寺灵闰法师详择可否。时有僚宰数人。俱来闰所。共荐明解。闰曰。公等国器名臣出言不易。宜求<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>学增长<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。何乃举酒客画师以当洪寄。官等失色流汗逡巡俯退。明解因其致憾。尤轻法化。俄而上征四科。不间道俗。解应诏自举射策升第。喜谓友人曰。解今得舍驴子皮而复人身矣。因致酒欢会。述志为诗曰。一乘本非有。三空何所归。幸得金门诏。行背玉毫晖。未能齐物我。犹怀识是非。赖尔同心契。知余志不违。幕齐云叶。卷酒度榴花。飞寄语绳床执。辞君匡坐威。因题壁曰。老母在堂。袈裟去体。前途暗漆。浪称明解。解恶之。未几染疾自见。数十人形容诡异各执猛矩迎解。解大怖流汗。言未终而卒于东都择善里。即龙朔元年八月也。后托梦于相知洛州<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>寺僧慧整曰。明解为不遵内教今大受罪。非常饥乏愿有故念赐惠一餐。慧整梦中诺觉已设食。其夜才睡。即见明解来愧谢之。至二年秋间。又托梦于画工。我以不信佛法耽好外书。今大受苦。努力为我写三二卷经。执手殷勤赋诗言别。教画工读十八遍令记。觉乃忆之。其为诗曰。握手不能别。抚膺还自伤。痛矣时阴短。悲哉泉路长。松林惊野吹。荒隧落寒霜。离言何以赠。留心内典章。画工先不识字。忽觉乃倩人录之。将示明解本生故旧。皆曰是明解文体也。莫不恻然</p><p>懈慢不勤录七</p><p>晋沙门支法衡见铁轮受苦事(冥祥记)</p><p>释法衡。未详氏族。虽怀慕道不甚精勤。后得病旬余亡。经三日而稣活说。死时有人将去。见如官曹舍者数处。不肯受之。俄见有铁轮轮有铁爪从西转来。无持引者而转驶如风。有一吏呼罪人。当轮立。轮转来轹之。翻还如此。数人碎烂。吏呼衡。道人来当轮立。衡恐怖自责悔。不精进今日当此轮乎。乃至心<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>。吏曰。道人可去。又以衡付船船官使衡持柁。复遇群狗争欲啮衡。衡大惧渴欲饮水。乃堕水中因便得稣。于是昼夜精思。为至行沙门</p><p>宋沙门僧规见称量罪福事(冥祥记)</p><p>释僧规未详何许人。少出家颇以化物为务。而轻犯小戒。多游俗家。时京兆张瑜常请僧规在家供养。永初元年十二月五日。无病忽暴亡。二日而稣自说云。五日夜二更中。闻门巷间晓晓有声。须臾见有五人秉炬火执信幡迳来入屋。叱咀僧规规因顿卧恍然。五人便以走绳缚将去。行至一山都无草木。土色坚黑有类石铁。山侧左右白骨积填。过山数十里。至三岐路。有一人甚长壮。被铠执仗问五人曰。有几人来。答曰。正一人耳。五人又将规入一城。城外有屋数十。悉筑壤为之。屋前有立木长十余丈。上有铁梁。形如桔槔。左右有土籄。大小数品。有一人衣帻并赤。语规曰。汝生时有何罪福。依实说之勿<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>也。规惶怖未答。赤衣人语一人如局吏者云。可开簿捡其罪福也。有顷吏至长木下。提一籄土悬铁梁上称之。如觉低昂。吏谓规曰。此称量罪福之称也。汝福少罪多。应先受罪。俄有一人衣冠长者。谓规曰。汝沙门也。何不念佛。我闻悔过可度八难。规于是一心称佛。衣冠人谓吏曰。可更为此人称之。既是<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>幸可度脱。吏复为上籄称之。称乃正平。既而将规至监官前辨之。监官执笔观簿迟疑未决久。之又有一人。朱衣玄冠佩印绶执玉版来曰。算簿上未有此人名也。监官愕然命左右收录云云。须臾见反缚向者五人来。监官曰。杀鬼何以滥将人来乃鞭之。须臾有使者。称天帝命唤道人来。既至帝宫。经历所见略皆金宝精光晃煜。帝左右朱衣宝冠。帝曰。汝是沙门何不勤业而为小鬼横收捕也。规稽首祈恩。帝曰。汝命未终今当还生。宜勤精进勿屡游白衣家也。使者送规至瑜家而去也</p><p>宋龙华寺法宗不勤修造得病事(出冥祥记)</p><p>释僧妙。居于江陵上明村。妙至大明年初。游乞零陵。因居郡治龙华精舍贩货。蓄聚米至数千斛大明八年卒。龙华寺灾焚荡尽。妙临终以财物付弟子法宗。令造讲堂僧房。法宗立堂毕颇弛懈未时建房。至泰始三年正月。被疾甚笃。时有道猛比丘。随泉陵令高阳许静慧在县。县即郡治之邑也。猛往看宗疾。入寺数步见一沙门着桃花布裙衣单黄小被。行且骂云。小子法宗违我处分。不立僧房。费散财物云云。既而回见道猛。如惊羞状以被蒙头。入法宗房。猛常往来此寺。未尝见此沙门。不欲干突之。先告法超道人。说所闻见。超疑诈妄。捡问形状音气猛具言之。超曰。即法宗之师也。亡来数载。共叹怅之。其夕即灵语使急召法宗。宗既至数骂甚严。犹以僧房为言。音声气调不异平生。法宗稽谢毕问。和尚今生何处善恶云何。妙曰。生处复粗可耳。但应受小讁。二年方可得免。兼有小枉横。欲诉所司。为无袈裟不能得行。可急为制也。法宗曰。袈裟可辨未审和尚云何得之。妙曰。请僧设供以袈裟为嚫我即得也。法宗如言饭僧嚫衣。道猛时在会。又见僧妙倚于堂户之外拱手听经。饭嚫既毕。猛即见袈裟已在妙身。仍进堂中。欲依僧次就坐。问猛年腊。猛曰。吾忘其年。是索虏临江岁之二月也。妙云。与吾同腊见大一月耳。乃坐猛下。猛即狭膝空一坐位。妙端默听经。至坐散乃不复见。时一堂道俗百余人。零陵太守羊阐亦预法集。自猛与妙讲论往反。众但闻猛独言。所以咸知验实者。猛与妙不相识。说其形色举动年腊宿少。莫不符同。法宗始疾危。困始命至灵语日。沉疾即愈。灵语所著盖是弱僮而声气音词。听者莫辨其殊。故并信异之。初阐不甚奉法。因是大兴敬悟连建福集。即其年设讲于此寺持斋布施</p><p>宋沙门知达被神责及受罪事</p><p>释智达。未详何许人也。虽预道门行颇留俗。以永徽三年六月病死身暖不殓。遂延二日气息稍还。至三日而能言。自说始困。时见两人皆着黄布裤褶。一人立于户外。一人迳造床前。曰上人应去可下地也。达曰贫道体羸不堪涉道。此人曰。可乘舆也。寻而舆至。达既升之。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>恍然不复见家人屋舍及所乘舆。四望极目但睹荒野途迳艰危。二人驱之不得休息。至于朱门墙闼甚华。达入至堂下。堂上有一贵人。朱衣冠帻据傲床座。姿貌严远甚有威容。左右兵卫百许。人皆朱衣柱刀列直森然。贵人见达乃敛颜正色曰。出家之人何宜多过。达曰。有识以来不忆作罪。问曰。诵戒废不。达曰。初受具戒之时实常诵集。比逐斋讲恒事转经。故于是有亏废。复曰。沙门时不诵戒此极非法。贵人敕向录达人曰。可送置恶处。勿令大苦。二人引达将去行数十里。稍闻轰磕其声沸天。而前路转闇。次至一门高数十丈。色甚坚黑盖铁门也。墙亦如此。达心自念。经说地狱此其是矣。乃大恐怖悔在世时不修业行。及入门里挠声转壮。久久静听方知是人叫呼之响。时有火光乍灭乍扬。见数人反缚趋进。后有数人执叉刺之。流血如泉。入门二百步许。见有一物。形如米囤。可高丈余。二人执达掷置囤上。囤里有火焰烧达身。半体皆烂。痛不可忍。自囤坠地。闷绝良久。二人复将达去。见有铁镬十余。皆煮罪人。人在镬中随沸出没。侧有人以叉刺之。或有攀镬出者。两目溃突舌出尺余。肉尽折烂而犹不死。诸镬皆满。唯一尚空。二人曰上人即时应入此镬。达闻其言肝胆涂地。乃请之曰。君听贫道暂时<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。便至心稽首愿免此苦。伏地食顷祈悔特至。既而四望无所复见。唯睹平原茂树风景清明。而二人犹导达行至一楼下。楼形高小上有人。谓曰。沙门受轻报殊可欣也。达于楼下忽然不觉还就身时</p><p>后魏崇真寺僧慧嶷王前见判五僧事(洛阳伽蓝记)</p><p>崇真寺僧慧嶷。死经七日时。与五比丘阎罗王所阅过。嶷以错召放令还活。具说王前事。意如生官莫异。其五比丘者亦是京邑诸寺道人。与嶷同簿而过。一比丘云。是宝明寺僧智聪自云。生时坐禅苦行为业得升天堂。复有比丘云。是般若寺僧道品自云。诵涅槃经四十卷亦升天堂。复一比丘云。是融觉寺僧昙谟最称。注讲涅槃<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>二部恒领众千人解释义理。阎罗王曰。讲经众僧我慢贡高心怀彼我骄己凌人。比丘之中第一粗行。昙谟最言贫道立身已来实不骄慢。唯好讲经敷演义理。王言。付司即有青衣十人。送最向于西北。入门屋舍皆黑侣非好处。复有一比丘云。是禅林寺僧道弘自言。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>四辈檀越造一切经人中金像十躯阎王曰。沙门之体必须摄心道场。志念禅诵不预世事。勤心念戒不作有为。教化求财贪心即起。既怀贪心则三毒不灭。付司依式还有青衣送。与昙谟最同入一处。又一比丘云。是灵觉寺宝真自云。未出家之前。曾作陇西太守。自知苦空。归依三宝。割舍家资。造灵觉寺。寺既得成。舍官入道。虽不禅诵。礼拜不阙。阎罗王曰。卿作大守之日。曲情枉法劫夺民财。以充己物。假作此寺非卿之力。何劳说此。亦付司准式。青衣送入黑门。似非好处。慧嶷以错召不问。放令还活。具说王前过事。时人闻之奏胡太后。太后闻之以为异事。遣黄门侍郎依慧嶷所陈。访问智聪等五寺。并云有此死来七日。生时行业如嶷所论也</p><p>唐玄法寺僧玄真破斋受罪事</p><p>行真俗姓邵。蓝田人也。幼奉名师。早怀识悟。尤攻转读。有声里邑。尝为患热过中至极。频犯破斋。未遑改肃。至永徽三季。于胜光寺听闰法师讲涅槃经。到五月十七日。忽于昼寝之间。冥若殒逝。遍身稍冷。气息渐微。傍人候之不敢惊触。经一宿乃稣。流汗战栗自说云。见冥责破斋罪。令应受饿鬼之身。真悲恨无计。答云。苦患热病非是故心。若蒙恩泽。当为设施百僧会。从今已往不敢破斋。因尔得还罄舍衣资。如言设会。后经岁月雅志不全。以显庆五年八月。闰法师又于玄法寺讲涅槃经。真被摄如先冥官嗔责问。汝敢再来邪。令二人将向北。乃有坑涧数重荆棘繁密。二人驱之使从中过。血肉流离略无完处。既度坑棘见千饿鬼。形容憔瘦针咽刺毛争食脓血。旋睹己身其状如彼。真惊悔投地不觉称佛。起未卒间了无前相。二人还引向王前王曰。所见如何。真叩头自责。誓永修改。于是放归更无退转</p><p>新罗国禅师割肉酬施主事(新录)</p><p>隋末新罗国有一禅师。失其名。景行精着多在一檀越家。偏受供养。往来不绝。可向十年。檀越信力坚深家途丰渥。朝夕四事身心俱尽。禅师年老致终依法埋殡。不盈数日其家园中枯木忽生软菌。家人采以为臛。味同于肉。大小欢庆日日取之。遍木随生给用无尽。岁月稍久亲邻咸悉。后西邻一人踰垣夜窃以刀割取。忽闻木作人声云。谁割我肉。我不负君。其人惊问。汝是谁耶。答曰。我是往某禅师。缘我道行轻微受主人重心供养业不能消。来此偿债。君能为我乞物。还主人吾即得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。邻人先忆识之。故怪叹呜呼。即告主人。主人闻此崩号殒绝对木忏悔。谢愆誓相免放。邻人为乞一百硕米。来与主人。于是园中不复生也。有新罗僧达义。年将八十。贞诚恳到托迹此山。余敬其德时给衣药。义对余悲泣具述此由云。余来亦割肉还师也</p><p>唐相州辩圭弘亮求福事(出新录)</p><p>相州李思一。永徽三年五月内死。经一宿而稣。说云。以年命未合即死蒙王放归。于王前见相州滏阳县法观寺僧辩圭。又见会福寺僧弘亮及慧宝。三人并在王前答辨。冥官云。慧宝死时未至。宜放归修功德。辩圭弘亮今岁必死。后果如言。寺僧令一巫者就弘亮等房召二僧问之。辩圭来曰。我为破斋今受大苦。语弟子等。为我作斋救拔苦难。弟子等即为设斋。巫即报云。已得免罪。弘亮来云。我为破斋兼说人好恶长短。今被拔舌<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。不能多言</p><p>唐西京胜业寺僧慧约见诸僧受苦事(出新录)</p><p>释慧约树果二人。俱少小出家。住京胜业寺。以垂拱三年。俱为内库直岁。忽于五月中被冥官捉将见王。王问。汝等生时作何业行。约答曰。诵法华经三四卷。王合掌敬之云。且放还。遣人将观受苦之处。行向西南到一大门。北院见一行长舍。以板为墙。东西相当。作孔如枷孔无异。孔孔之中皆有僧头当。见同寺僧大谅。身犹见在头出孔中。即见约果。啼哭惊唤不可具言。其大谅尝捡挍修葺殿中三大像。私用像物故被追摄。每孔边皆有狱率。形状可畏。执刀刎之。血污狼籍。狱率安头唱活还即头出孔中。如是不久乃经一二十度。次西行。又见<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>食肉受罪之处。无数众僧被割截。声呼难堪被害。所食众生咸来索命。分啖食血。又见同寺寺主僧智感都维那阿六。被缚极急。勘当食肉用僧物罪。约果忽然被推着深黑坑中。俄而稣活。遍体流汗心魂无主。后不盈月日。谅即身死。感亦暴亡。极受辛苦。阿六发心忏悔不出户。读一切经昼夜勤恳。数见冥司使二黄衣人骑白马来取。到阿六门内一人云。大大发心日夜不舍读一切经故当可放。凡三四度来。于是阿六并亲见勤忏不已。遂得无他</p><p>南齐竟陵文宣王净住子略(新录)</p><p>南齐萧子良。撰净住子二十卷。中有检挍三业门。今略云尔。次复捡挍弥增悚恧。何谓捡挍。我此身从旦至中。从中至暮。从暮至夜。从夜至晓。乃至一时一刻一念一顷。有几心几善几恶。几心欲摧灭<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。几心欲降伏魔怨。几心念三宝<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。几心念报父母恩育。几心愿代众生受苦。几心发念<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>意。几心欲布施持戒。几心欲忍辱精进。几心欲禅寂念定。几心欲显<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>智。几心欲慈悲救摄。几心欲广度五道。几心欲奖策劝励行所难行。几心欲超求胜果辨所难辨。几心欲捍劳忍苦建立佛法。几心欲舍身命护持三宝。几心欲绍继佛种使不断绝。几心欲化诸外道使入正法。几心念诸声闻所作已办。几心念诸菩萨行地功德。几心专念求如来智。几心自念我当作佛。几心运想缘诸净刹。几心发意观地狱苦。次复捡口。从旦已来次第时刻。已得演说几句深义。已得披读几卷经典。已得理诵几许文字。已得几回叹佛功德。已得几回称菩萨善。已得几回称赞<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。次复捡身。如是时刻从旦已来。屈躬俯仰礼佛。几拜乃至法僧其数多少。已得几回扫塔涂地。已得几回然灯散华。已得几回入佛堂殿。已得围绕几十匝。已得几回拂除尘垢。已得几回整列供具。已得顶戴几许幢幡。已得焚烧几许妙香。试作如是捡察故知。会理甚少。违道极多。白净之业裁不足言。烦恼重障森然满目。闇蔽转积解脱何由。若回世俗语言戏朋聚游适作此捡挍。恶何由起唯得自救无暇。岂复议及于人。若复不作此捡挍。亦复言我功德不少有许斥善。便自谓人不能作而我能作人。不能行而我能行。若作如是捡挍者。便可立知善恶浅深轻重多少。如来大悲愍念众生。欲令远苦得安隐乐故。阐无量法门。开人天正路。而触念违经历心背律。书礼箴诫弃舍不从。顺恶逆善念念增盛。而欲以纤毫微福望免大苦。岂得免乎。今捡挍已毕。实知恶重丘山善轻毛发。便应各各责心口相训。心语于口。汝常言法。莫说非法。口还语心。汝常思法。莫思非法。心复语身。汝勤行法。莫行非法。如是我心自制我口。我口自制我心。我心自制我形。我形随顺我口。更相制勤。岂不为美。何复劳他心口。制我心口。若劳他心口。制我心口者。我宁不自愧我心口乎</p><p>释门自镜录卷上</p><p>﻿门自镜录 卷下</p><p>害物伤慈录八</p><p>晋襄阳竺法慧被害并门人折足事</p><p>竺法慧姓张。贤直有戒行。颇有神迹。恒语弟子法照云。汝过去曾折一鸡脚。其殃寻至。汝好慎之。照忽出行。误为人所掷。遂折一脚。照方信悟。语门人曰。我有宿债。今当受之。俄为征西庾稚恭所害</p><p>晋霍山僧群折鸭翅见受报事(冥祥记支遁附)</p><p>释僧群。未详何人。清贫守节。蔬食诵经。后居藿山。山孤在海中。上有石盂。径数丈许。水六七尺。常有清流。古老相传。群仙所居。饮水不饥。因绝粒。群庵舍与盂隔小涧。常以一木为梁。由之汲水。后时忽有一折翅鸭。舒翼当梁头就唼。群欲即举锡杖拨之。忽忆少年时经折一鸭翅。自验以为见报。乃绝饮而终。临终向人具说而已</p><p>支遁字道林。俗姓蔺。陈留人也。少出家神俊超悟千载唯一。而以为。鸡卵受气未足。谓非有命。言食之无罪。其师戒素之僧恒常诲励。遁快辩直言师莫能屈。师既亡后忽复见形。取鸡卵对遁掷地。乃有鸡雏从卵而出飞翔饮啄。遁意稍疑。未能全革。后复欲食之。遂梦有夫妇二人。胡跪遁前云。有子三十。明日供厨食。从师乞命。愿垂矜救。乃衔鸡子从遁前扣破。皆有白衣儿。从内而出觉已深自悔责蔬食终身</p><p>宋江陵四层寺竺慧炽食肉生饿狗地狱事(冥祥记)</p><p>竺慧炽。新野人。住江陵四层寺。永初二年卒。弟子为设七日会。其日将夕烧香竟。沙门道贤。因往视炽弟子。至房前忽见暧若人形。详视乃慧炽也。容貌衣服不异生平时。谓贤曰。君且食肉美不。贤曰美。炽曰。我坐食肉今堕饿狗地狱。道贤惊悚未及得答。炽复语言。汝若不信试看我背后。乃回背示贤。见三黄狗。形半似驴。眼甚赤。光照户内。状欲噬炽而复止。贤骇怖闷绝。良久乃苏具说其事。因兹悛悔</p><p>齐令才啖肉入喉苦死事</p><p>令才俗姓赵。东阳人。虽身预道门。行同流俗。聚集饮啖曾无愧心。尝在吴之豪士顾霈。送客于升平亭坐。见牵一羊。将充厨膳。才以贪网覆心。曾无谏止。俄而羊挽绳断走入才膝下。穿头入袈裟下。欲以求救。才然无言。羊即被牵将去。须臾刳剔既毕焚炙而行。才先食一脔始入咽喉。肉遂从上走下冲心以攻腹。绞戾苦痛不复可堪。起伏呻吟酸切左右。霈即命医针之。炙犹摇动。乃破皮出之。故脔肉耳。才得病作羊鸣吐沫还寺。少时便死。远近闻者为之诫肃</p><p>陈杨州智慎为王诫劝事(征验传)</p><p>智慎未详其氏。言行多秽。沉迷嗜欲。每啖鲜鱼以甘口腹。乃于房穿池。广二丈多养鲜鱼。用备朝夕。又图画阎罗王像。置之虚座。鳝[榷-木+月]先熟以先献之。有问其故。慎曰。阎罗王幽狱之主。摈罚由其笔端。脱或相遇恕其宽赦耳。同侣讥诲莫之能止。后卒病而绝。遂见阎罗王。语云。弟子比来数蒙供养。虽倾厚意。终令弟子罪累更深。愿师勿尔也。杀命事重不可复赊。命狱典。引慎令观受苦之处。观已可将师还。慎前行见大铁城。猛火腾炎未至数百步。星火飞迸乱及于慎。慎惊不肯复前。王曰。师所见如何。慎悲泣请悔乞暂放还以修功德。王曰。狱外尚尔狱里可知。自作自受斯言不谬。比日蒙恩。今以此为报也。遂得再生深加改励。晓夕精勤遂成高行僧焉</p><p>唐神都太平寺僧威整害蜘蛛事(新录)</p><p>释威整。未详氏族。少出家<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>解。精勤听习略无弃日。住神都太平寺。常讲数部大乘。深有弘益。忽于床后壁上见一蜘蛛。以杖狭之。遂误断一脚。遣人送却。至明日还来整见。又遣人送送向水南经宿。又来整乃以指剔其所患之脚。遂被咬其手指。又遣人送极远之处。他日不觉。复来重咬其指。乃虽小疮痛不可忍。又令更送。自尔不来。疮后稍增渐遍身体。体觉渐微痒。以手搔之随手作疮。疮中有蜘蛛丝。出疮皆渐大二三寸许。晓夕苦痛难言难忍。经二年间。涕唾小便皆有小蜘蛛子出。至今不差。百方推问莫之能疗。合寺徒众时时来集为其求佛。即觉小可罄舍衣资。于龙门山造一万五千像一铺。像今欲成其疮稍敛。岂非宿殃不请之所致耶</p><p>饮啖非法录九</p><p>晋天台山竺昙猷在胎经涉辛地被圣驱事</p><p>竺昙猷。或云法猷。炖煌人。少居苦行习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。神迹妙悟未暇详举。居赤城山。山岩与天台连属。而天台悬崖峻峙。古老相传云。上有精舍。得道者居之。然有石桥跨涧。而横石断人。且莓苔青滑。自终古已来。无得至者。猷行至石桥所。闻空中声。曰知君诚笃。今未得度。却后十年自当来也。猷心怅然。夕留中宿。闻行道唱萨之声。且后欲前。见一人发眉皓白。问猷所之。猷具以意答。曰公居生死。罪身何可得去。吾是山神故。相告耳。猷乃退还停少时。洁斋累日。因复更往见横石洞开。度桥少许睹精舍神僧。果如所说。因烧香中食。食毕神僧告曰。君有葱韭之气。未应住此。却后十年当来耳。猷曰。自生已来不识辛秽。何况口啖而言气乎。神僧曰。汝在胎时汝母经历葱韭之地。猷惭而退。顾看横石。还合如初。后卒于山。而举体绿色</p><p>宋新寺沙门难公饮酒被讁事(冥祥记)</p><p>蒋小德江陵人也。少而信向精谨过人。大明末得病而死。夜三更将敛。便苏活云。有使者称王命召之。小德随去既至。王曰。君精勤小心虔奉大法。被帝释指。以君专至。宜速生善地。而君年算犹长故。令吾特相召也。今日将受天中快乐。相为忻然小德喜诺。王曰。君可且还家所欲嘱寄及作功德。速作之七日复来也。小德受言而归路。由一处有小屋殊陋弊。逢新寺沙门难公。于此屋住。前既素知识具相问讯。难公云。贫道自出家来未曾饮酒。且暂就兰公兰公苦见劝逼饮一升许。今被王召问此故也。贫道若不坐此当得生天。今乃居此弊宇。三年之后方得上升耳。小德还家欲验其言。即夕遽遣人参讯难公。果以此日于兰公处睡卧。至夕无疾而亡。小德既愈七日内大设福供。至期奄然而卒。兰难二僧并居新寺。难道行尤精云云</p><p>齐邺下大<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>寺圆通饮酒被圣驱责事</p><p>释圆通。不知氏族。少出家研讽涅槃文旨。建德四年夏中。讲下有一客僧。忽来寄止。而身婴重病。臭气郁蒸。诸僧莫之齿也。通引至房中。为经理汤药。虽有秽污。初无轻惮。曾于中夜持春酒一盏云。客人寄患服此为佳。客人良久为之。嚬眉饮一咽便止。夏了病愈。便辞通去。临别执通手诫曰。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>不欺闇室。况酒为不善诸恶之本。法师前去赐之。恐伤来意。从今已往此事请断。小僧住下舍小寺。正在鼓山石窟寺北五里。当绕涧泽来。即竹林寺也。有缘念相访耳。通闻竹林是贤圣所止。敬谢前诫当必往展。至明年往石窟夏坐。乃与数人赍香华。寻路而进。至寺北五里山谷。东出升于山阜。见一老翁。手巾袹额执钁。开荒二十余亩。见群僧放一马骂曰。去年官寺放马啖我生苗。我儿遮护被打几死。今复将面目来耶。拽钁来逐。诸僧驰返而独不逐通。语云。是尔干健放令餧饿虎。通出东寻小涧闻岭上讽诵之声。通问竹林所在。应声答曰。岂非通法师乎。通应之果是旧僧。披林踰崄就通欢叙。因相命进数里。忽见双阙。高门长廊。复道修竹干云。青松蔽日。乃立通门左。告曰。须前咨和尚。须臾引入讲堂西轩廊下。和尚坐高床。侍者五六十人。和尚可年七十。状类梵僧。通礼谒却立。乃令安置。将巡礼拜。见两房僧各坐宝帐。交络众饰映夺日光。语引僧云。彼是何酒客辄敢来此。振手遣去。通有惭色僧乃将入己房。并设中食。通因陈愿在此常共扫洒。僧曰。须咨和尚。和尚固遣。送出门首。通顾慕流泪。自伤先罪。执僧手而别。西行百步。回望犹见门阙俨然。步步返望。更四里许。欻见峰[山/口/咢]巉岩。非复寺宇。行至开荒之地。了无踪绪。但榛林耳。识者云。老翁言去年官寺放马者。诸僧如马也。但念水草。不求圣道也。啖我生苗者。言通劝客僧之酒损其道芽也。我儿遮护者。客初护戒不肯饮也。被打几死者。言被劝一咽几亡圣道也。逐诸僧者。独进有缘也。通莫悟此言。而不返加勤悔。驱之令出不亦宜乎</p><p>齐梁州薛寺僧道远饮宴眉毛堕落事</p><p>释僧道远。不知何人也。住梁州薛寺。为性疏诞不修细行。好随饮宴为任。武平三年忽梦。大人切齿责曰。汝是出家面目如此。遽纵造恶。何不取镜自照。远惊觉汗流。至晓以盆水自映。乃见眼边乌点。谓是垢污。便洗拭之。眉毛堕落。因自悔责。念此殃谴。遂改革常习。反形易志。弊衣破履一食长斋遵奉<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。昏晓行悔。非泪交注。经一月余又梦。前人含笑谓曰。知过能改是为智乎。赦汝前愆勿更相续。远惊喜而觉流汗遍身。面目润泽眉毛渐出。远频钟报信知三世。竭情奉法。为练行僧也</p><p>隋也西陏兴寺法四饮酒醉被阎王劝诫事</p><p>释法四。戒虽多违犯。每怀崇向。年少时尝与二三间。宵命酌。夜久而散仅出户。忽有三人。围绕前后。四问曰。汝是何人。答是阎罗王使。遣追唤寻即挽撮。四极力共诤。曰我有何罪而见擒捉。才得入房倚倒而绝。阖寺惊愕皆来守视。至晓还稣。因悲泣具陈所见云。往见阎罗王。问造何罪。四曰。少蒙入道。多亏戒行。余衅尚轻。唯饮酒为频耳。王即命左右。酌酒与四。左右驰取之。既至以酒一盏与四。大可升许。四受之。入手忽变作沸铜。腾焰数丈。惧而掷之。不能去也。王催令速饮。四哀号乞救。王曰。生作何福。四曰。常诵戒经夜则一遍。言讫所执酒盏忽然离手。王曰。戒为行本。既诵须持。勿复空言徒丧其气。诵持之力亦微消障累也。放师且还宜思自悔。若欲更饮当念沸铜。遂见一胡僧。引之将出。四后不遵冥悔。重遭追摄。于是改革。遂得无他</p><p>唐泽州清化寺玄鉴破酒器及异僧被鬼诫事</p><p>释玄鉴姓焦。泽州高平人也。十九出家投诚释种。酒肉荤辛天然自厌后住清化寺。依止远公。博釆经论。于大涅槃深得其趣。而正性敦直言行相依。凡值饮酒非法。莫不碎其酒器。故诸俗士聚集饮宴。闻鉴来至并即驰散。时清化寺修营佛殿。泽州官长长孙义颇怀奉信。闻役工匠其数甚众。乃送两舆酒以致之。鉴时见此。破其酒器。狼籍在地。吾之功德乍可不成。终不用此非法物也。义闻之大怒。明欲加害。夜梦有人。以刀临之。既忽惊悟。即便归依忏悔。又时遇疫气死亡。非一投鉴悔之。令断酒肉。痊复者众矣。乡人李迁者性偏嗜酒因疾请忏。俄然除差。自斯厌舍尝无言及。尝谓友人曰。自见鉴师已来酒气如毒。尚不喜闻。况当见也。其戒节感人皆此之类。及武德六年。当部护泽县李录事死。经七日来报其妻云。吾得为人间游魂鬼也。未然之事。皆悉知之。与人交言事。同生者。但以物自翳不现其形。鬼时往景业寺。听维摩经。有余法师。时或饮酒谓鬼曰。今讲此经感何人听。答曰。自人头已上便是鬼神。上及诸天。重级充满然都讲。唱文皆敛容倾耳。法师解义皆回面而听。闻酒气故也。此定须断。若其不然宁不讲也。非唯此会。一切皆然耳。僧愧自断焉</p><p>梁高祖断酒肉文(本文繁广今少略)</p><p>弟子萧衍敬白诸大德等。夫匡正佛法是黑衣事。乃非弟子白衣所急。但经教亦云。佛法寄嘱俗人。是以弟子不得无言。今诸大德僧尼开意听受。勿生疑闭。凡出家人。所以异于外道者。正以信因信果。信经所明信是佛说。经言。行十恶者受于恶报。行十善者受于善报。今出家人。犹嗜饮酒啖食鱼肉。是则为行同于外道。外道者执断常见。无因无果无施无报。今佛弟子酣酒嗜肉。不畏罪因不畏苦果。即是不信因。不信果。与无施无报者复何以异。此事与外道见同而有不及外道。外道各信其师。师所言是弟子言是。师所言非弟子言非。涅槃经言。今日制诸弟子。不得食一切肉。<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>言。饮酒犯波逸提。今诸僧尼饮酒食肉。此事违于师教。是一不及外道。又外道虽邪。持牛狗戒。既受戒已。后更不犯。今出家人既受戒已轻慢毁犯。是二不及外道。又外道虽复五热炙身投渊赴火。未必啖食众生。今出家人啖食鱼肉。是三不及外道。又外道异学虽不当理。各习师法无有覆藏。今出家人啖食鱼肉。于所亲者乃自和光。于所疏者则皆隐避。如是为行是四不及外道。又外道各重其法。乃至云不如我道真也。于诸异人无所忌惮。今出家人啖食鱼肉。或避同学。或避弟子。或避白衣。或避寺官。怀狭邪志。崎岖覆藏。此五不及外道。又复外道直情迳行能长自己徒</p></div>"
}]