[{
    "title": "龙树菩萨传 第2047部",
    "author": "鸠摩罗什 译",
    "html": "<div class=\"B1_text\"><p><a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>传</p><p>姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师鸠摩罗什译</p><p>大师名龙树菩萨者。出南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>梵志种也。天聪奇悟事不再告。在乳哺之中。闻诸梵志诵四韦陀典各四万偈。偈有四十二字。背诵其文而领其义。弱冠驰名独步诸国。世学艺能天文地理图纬秘谶。及诸道术无不悉练。契友三人亦是一时之杰。相与议曰天下义理可以开神明悟幽旨者。吾等尽之矣。复欲何以自娱骋情极欲。最是一生之乐。然诸梵志道士势非王公何由得之。唯有隐身之术斯乐可办。四人相视莫逆于心。俱至术家求隐身法。术师念曰。此四梵志擅名一世。草芥群生今以术故屈辱就我。我若咒法授之。此人才明绝世所不知者唯此贱法。若得之便去不复可屈。且与其药使日用而不知。药尽必来求。可以术屈为我<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。各与青药一丸告之曰。汝于静处用水磨之以涂眼睑。则无有人能见汝形者。龙树菩萨磨药闻气。便尽知药名分数。多少锱铢无失。随其气势龙树识之。还语术师此药有七十种。分数多少尽如其方。药师问曰汝何由知。答曰药自有气何以不知。师即叹伏。顾斯人者闻之犹难。而况相学。我之贱术何足惜耶。即具授。其四人得术隐身<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>入王宫中。宫中美人皆被侵陵百余日。后宫中人有怀妊者以事白王。王大不悦。此何不祥为怪乃尔。召诸智臣以谋此事。有旧老者言凡如此事应有二种。或鬼或术。可以细土置诸门中。令有司守之断诸术者。若是术人足迹自现可以兵除。若其是鬼则无迹也。鬼可咒除人可刀杀。备法试之见四人迹。即闭诸门令数百力士。挥刀空斫斫杀三人。唯有龙树敛身屏气依王头侧。王头侧七尺刀所不至。是时始悟欲为苦本。厌欲心生发<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>愿。若我得脱。当诣<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>求出家法。既而得出入山诣佛塔出家<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。九十日中诵三藏。尽通诸深义。更求诸经都无得处。雪山中深远处有佛塔。塔中有一老<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。以摩诃衍经与之。诵受爱乐虽知实义未得通利。周游诸国更求余经。于阎浮提中遍求不得。外道论师沙门义宗咸皆摧伏。即起憍慢心。自念言世界法中津涂甚多。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>虽妙以理推之故未尽。未尽之中可推。而说之以悟后学。于理不违于事无失。斯有何咎。思此事已。即欲行之立师教诫更造衣服。今附<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>所别为异。方欲以无所推屈表一切智相。择日选时当与诸弟子。受新戒着新衣便欲行之。独在静室水精地房。大龙菩萨见其如此。惜而愍之即接入海。于宫殿中开七宝藏发七宝函。以诸方等深奥经典无上妙法授之龙树。龙树受读九十日中通练甚多。其心深入体得实利。龙知其心而问之曰。看经遍未。答言汝诸函中经甚多无量不可尽也。我所读者已十倍阎浮提。龙言如我宫中所有经典。诸处此比复不可知。龙树即得诸经一箱。深入无生三忍具足。龙还送出。时南天竺王甚邪见承事外道毁谤<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。龙树菩萨为化彼故躬持赤幡在王前行。经历七年王始怪问。此是何人在我前行。答曰我是一切智人。王闻是已甚大惊愕而问之言。一切智人旷代不有。汝自言是何以验之。答言欲知智在说王当见问。王即自念我为智主大论议师。问之能屈犹不足名。一旦不如此非小事。若其不问便是一屈迟疑良久。不得已而问之。天今何为耶。龙树言天今与阿修罗战。王闻此言譬如人噎。既不得吐又不得咽。欲非其言复无以证之。欲是其事无事可明。未言之间龙树复言。此非虚论求胜之谈。王小待之须臾有验。言讫空中便有干戈兵器相系而落。王言干戈矛戟虽是战器。汝何必知是天与阿修罗战。龙树言构之虚言不如校以实事。言已阿修罗手足指及其耳鼻从空而下。又令王及臣民<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>众。见空中清除两阵相对。王乃稽首伏其法化。殿上有万婆罗门。皆弃束发受成就戒。是时龙树.于南天竺大弘<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。摧伏外道广明摩诃衍。作优波提舍十万偈。又作<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛道论五千偈。大慈方便论五十偈。令摩诃衍教大行于天竺。又造<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>论十万偈。于无畏中出中论也。时有婆罗门善知咒术。欲以所能与龙树诤胜告天竺国王。我能伏此比丘王当验之。王言汝大愚人。此菩萨者明与日月争光。智与圣心并照。汝何不逊敢不推敬。婆罗门言。王为智人何不以理验之。而抑断一切。王见言至为请龙树。清旦共坐政德殿上。婆罗门后至便于殿前咒作大池。广长清净中有千叶莲华。自坐其上而诃龙树。汝在地坐如畜生无异。而欲与我清净华上大德智人抗言论议。尔时龙树亦以咒术化作一六牙白象。行池水上趣其华坐以鼻缴拔高举掷地。婆罗门伤腰委顿。归命龙树我不自量毁辱大师。愿哀受我启其愚蒙。有一小乘法师。常怀忿嫉。龙树问之言汝乐我久住世不。答言实不愿也。退入闲室经日不出。弟子破户看之遂蝉蜕而去。去世已来始过百岁。南天竺诸国。为其立庙敬奉如佛。其母树下生之。因字阿周陀那。阿周陀那树名也。以龙成其道故以龙配字号曰龙树也(依付法藏经即第十三祖三百余年任持佛法)。</p><p>龙树菩萨传(终)</p></div>"
}][{
    "title": "龙树菩萨传 第2047部",
    "author": "鸠摩罗什 译",
    "html": "<div class=\"B1_text\"><p><a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>传</p><p>姚秦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>鸠摩罗什译</p><p>龙树菩萨者。出南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>梵志种也。天聪奇悟事不再告。在乳餔之中。闻诸梵志诵四围陀典各四万偈。偈有三十二字。皆讽其文而领其义。弱冠驰名独步诸国。天文地理图纬秘谶。及诸道术无不悉综。契友三人亦是一时之杰。相与议曰。天下理义可以开神明悟幽旨者。吾等尽之矣。复欲何以自娱。骋情极欲最是一生之乐。然诸梵志道士势。非王公何由得之。唯有隐身之术斯乐可办。四人相视莫逆于心。俱至术家求隐身法。术师念曰。此四梵志擅名一世草芥群生。今以术故屈辱就我。此诸梵志才明绝世。所不知者唯此贱法。我若授之。得必弃我不可复屈。且与其药使用。而不知药尽必来永当师我。各与青药一丸告之曰。汝在静处以水磨之。用涂眼睑汝形当隐。无人见者。龙树磨此药时闻其气即皆识之。分数多少锱铢无失。还告药师向所得药有七十种分数。多少皆如其方。药师问曰汝何由知之。答曰。药自有气何以不知。师即叹伏。若斯人者闻之犹难。而况相遇。我之贱术何足惜耶。即具授之。四人得术纵意<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。常入王宫。宫中美人皆被侵淩。百余日后宫中人有怀妊者。懅以白王庶免罪咎。王大不悦。此何不祥为怪乃尔。召诸智臣以谋此事。有旧老者言。凡如此事应有二种。或是鬼魅或是方术。可以细土置诸门中。令有司守之断诸<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。若是术人其迹自现。可以兵除。若是鬼魅入而无迹。可以术灭。即敕门者备法试之。见四人迹骤以闻王。王将力士数百人入宫。悉闭诸门。令诸力士挥刀空斩三人即死。唯有龙树敛身屏气依王头侧。王头侧七尺刀所不至。是时始悟欲为苦本众祸之根。败德危身皆由此起。即自誓曰。我若得脱当诣<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>受<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>法。既出入山诣一佛塔出家<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。九十日中诵三藏尽。更求异经都无得处。遂入雪山山中有塔。塔中有一老<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。以摩诃衍经典与之。诵受爱乐虽知实义未得通利。周游诸国更求余经。于阎浮提中遍求不得。外道论师沙门义宗咸皆摧伏。外道<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>白之言。师为一切智人。今为<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。弟子之道咨承不足将未足耶。未足一事非一切智也。辞穷情屈即起邪慢心。自念言。世界法中津涂甚多。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>虽妙以理推之故有未尽。未尽之中可推而演之。以悟后学于理不违。于事无失斯有何咎。思此事已即欲行之。立师教戒更造衣服。令附<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>而有小异。欲以除众人情示不受学择日选时当与。谓弟子受新戒着新衣。独在静处水精房中。大龙菩萨见其如是惜而愍之。即接之入海。于宫殿中开七宝藏。发七宝华函。以诸方等深奥经典无量妙法授之。龙树受读九十日中通解甚多。其心深入体得宝利。龙知其心而问之曰。看经遍未。答言。汝诸函中经多无量不可尽也。我可读者已十倍阎浮提。龙言。如我宫中所有经典。诸处此比复不可数。龙树既得诸经一相深入无生二忍具足。龙还送出于南天竺。大弘佛法摧伏外道。广明摩诃衍作优波提舍十万偈。又作<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛道论五千偈。大慈方便论五千偈。中论五百偈。令摩诃衍教大行于天竺。又造<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>论十万偈。中论出其中。时有<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。善知咒术欲以所能与龙树诤胜。告天竺国王。我能伏此比丘。王当验之。王言。汝大愚痴。此菩萨者。明与日月争光智与圣心并照。汝何不逊敢不宗敬。婆罗门言。王为智人何不以理验之。而见抑挫。王见其言至为请龙树。清旦共坐政听殿上。婆罗门后至。便于殿前咒作大池广长清净。中有千叶莲华。自坐其上而夸龙树。汝在地坐与畜生无异。而欲与我清净华上大德智人抗言论议。尔时龙树亦用咒术化作六牙白象。行池水上趣其华座。以鼻绞拔高举掷地。婆罗门伤腰。委顿归命龙树。我不自量毁辱大师。愿哀受我启其愚蒙。又南天竺王总御诸国信用邪道。沙门释子一不得见。国人远近皆化其道。龙树念曰。树不伐本则条不倾。人主不化则道不行。其国政法王家出钱雇人宿卫。龙树乃应募为其将。荷戟前驱整行伍勒部曲威不严而令行。法不彰而物随。王甚嘉之。问是何人。侍者答言。此人应募既不食廪又不取钱。而在事恭谨闲习如此。不知其意何求何欲。王召问之。汝是何人。答言。我是一切智人。王大惊愕而问言。一切智人旷代一有。汝自言是何以验之。答言。欲知智在说王当见问。王即自念。我为智主大论议师问之能屈。犹不是名一旦不如此非小事。若其不问便是一屈。迟疑良久不得已而问之。天今何为耶。龙树言。天今与阿修罗战。王闻此言。譬如人噎既不得吐。又不得咽。欲非其言复无以证之。欲是其事无事可明。未言之间。龙树复言。此非虚论求胜之谈。王小待之。须臾有验言讫。空中便有干戈兵器相系而落。王言。干戈矛戟虽是战器。汝何必知是天与阿修罗战。龙树言。构之虚言不如校以实事。言已阿修罗手足指。及其耳鼻从空而下。又令王及臣民婆罗门众见空中清除两阵相对。王乃稽首伏其法化。殿上有万婆罗门。皆弃束发受成就戒。是时有一小乘法师。常怀忿疾。龙树将去此世。而问之曰。汝乐我久住此世不。答言。实所不愿也。退入闲室经日不出。弟子破户看之。遂蝉蜕而去。去此世已来至今。始过百岁。南天竺诸国为其立庙敬奉如佛。其母树下生之。因字阿周陀那。阿周陀那树名也。以龙成其道。故以龙配字。号曰龙树也(依付法藏传。即第十三祖师也。假饵仙药现住长寿二百余年。住持佛法。其所度人不可称数。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>藏说)</p><p>龙树菩萨传</p></div>"
}]