[
    {
        "title": "第一讲",
        "author": "虚空先生",
        "html": "<p align=\"center\"><b><span>分享《心经》</span></b></p><p><span>《般若波罗密多心经》全篇一共<span>260</span>个字，加上标题八个字一共<span>268</span>个字。我讲的不是佛经，也没有那么高的智慧和能量去讲佛法，名不正，言也不顺，也不是出家人。我讲的也不是佛法，只是把《心经》当中的一两层意思拿出来和各位朋友分享。可以指导我们的修行，让我们看一看《心经》里面都在讲什么样的智慧。按照《心经》里面的智慧去修正自己让自己可以变得更自在，变得更从容，变得更有智慧，所以我讲的实在也不是佛法，如果按照佛法的讲解会过于高深，我们绝大多数朋友也都听不懂，所以我往生活化了讲。如果有佛法更高深的朋友，你也不要去挑剔和指责我，因为实在是水平有限，所以我们只来讲一讲《心经》如何在生活当中去修正我们自己的行为，让绝大多数的朋友，让没有那么深的佛法基础的人都能听懂《心经》在讲什么。我们也不要把《心经》过于神话，当我们把《心经》过于神话的时候，我们往往更不容易理解它在讲什么。佛陀本身也是觉悟的人，观世音菩萨也是觉悟的人，所以我们把他当成人给我们讲的话再来理解《心经》，这样它才能变得简单，而不是那么复杂和难以理解，所以我也只能讲讲《心经》最浅最浅最浅的解释，其中的一层，两层，所以我也讲不全面，也讲不到那么高的境界。《心经》是《大般若经》其中的一段，《大般若经》一共<span>600</span>卷，这是其中的一段的精华。心经的版本有很多，流通的范围最广的版本是唐三藏玄奘法师所翻译的版本，所以我们来分享也是分享玄奘法师所翻译的这个版本。</span></p><p align=\"right\"><span>——虚空济</span></p><p align=\"center\"><b><span>《般若波罗蜜多心经》</span></b></p><p>”<b><span>般若</span></b>”译为<span>智慧</span>，这里讲的是<span>出世间的智慧。</span></p><p><b>智慧，第一层叫世间的智慧，也叫“世智辩聪”。第二层叫（超）出世间智慧。</b></p><p>它是用来做什么的呢？可以让我们在红尘中、尘世间生活的更富裕。</p><p><b>什么叫世间智慧？</b></p><p>比如说，我们会开车、我们会做饭、我们懂得生活的道理、我们知道该如何去工作等等。无非是有的人更聪明一些，有的人没有那么聪明，有的人看事情更通透一些，而有的人没有那么通透。</p><p><b>什么叫超世间的智慧？</b></p><p>比如说，因果报应。当我们明白因果，可能有了<span>20%</span>的出世间的智慧，知道了不好的行为、不好的事情，是不能做的。因为做了要违背因果，要自己承担业力的等等。</p><p>超世间智慧又分为三层。第一层叫<b><span>文字般若</span></b>，第二层叫<b><span>观照般若</span></b>，第三层叫<b><span>实相般若</span></b><b><span>。</span></b></p><p><b>文字般若是什么呢？</b></p><p>通过学习圣贤的文化，佛经，视频讲解，书籍等等文字类的都是文字般若。通过文字般若可以让我们明白更多的道理。</p><p><b>观照般若是什么呢？</b></p><p>通过观照自己的起心动念，观照自己身边所发生的事情。比如说，现在每天用的朋友圈，看到别人的分享。通过观察自己的生活，看自己身边所发生的事情，悟到一些道理。这个悟到就是自己观照而来的智慧，看问题也开始变得通透。</p><p><b>实相般若是什么呢？</b></p><p>学习儒释道传统文化，并运用于生活。使之自己不停地观察生活当中的事情，观察别人，观照自己的念头和行为。不用刻意而为之，自然就会生出实相般若。（<span>文字般若，观照般若二者为因实相般若为果</span>）</p><p><b><span>往往我们世间的智慧越多。反而离出世间的智慧越远。</span></b>如何让生活的更好，如何可以赚到更多的钱，如何可以学习更多的技能，这个时候反而离出世间的智慧越来越远了。</p><p>出世间的智慧每个人都有，只不过还没有那么深。可以通过不断的学习传统文化，通过文字般若再通过观照般若，生出实相般若，明白更多的人生无常。这个时候出世间的智慧就会不停的增长。</p><p>人很容易产生两种见解。一个是<b><span>断见</span></b>，一个是<b><span>常见</span></b>。</p><p><b>什么叫断见呢？</b></p><p>说我们这一生过去了，就没有了，只把当下活好就好了，人死如灯灭，管他什么来世呢？也不一定有。这个就是断见了。</p><p><b>什么叫常见呢？</b></p><p>老百姓经常讲一句话，没关系，<span>18</span>年以后依然是一条好汉。等来世我再好好做人。就是我们认为我们可以一直是做人的，这个叫常见的。（来世我们能不能做人不一定的。佛家是讲六道轮回的？如果我们这一生，做的都是恶业，来世不一定可以投胎做人的）</p><p>生活当中发生的事情，我们总认为它是固定不变的。说我今天跟一个人有感情，认为她生生世世都不会变，起码这一生当中是不会发生变化的；今天的事业是顺利的，我就认为这一生都是顺利的。当我们身边的事情发生变化的时候，就开始苦不堪言，抱怨；痛苦。当我们自己没有学习那么多出世间的智慧，我们开始下断言，这个一定就是对的。其实都是自己的主观臆断。所以<b>断见，和常见，都会让我们产生痛苦</b>。</p><p>出世间的智慧，只有通过不断的学习文字般若，才能懂得更多。出世间的智慧才能增加，才懂得去观照（观照也是对照观察自己）自己的行为，观察身边的事情，是不是和我们学的文字般若相对照。这个时候我们才能从里面生出实相般若，所以<b>实相般若是通过文字般若和观照般若不断的总结体悟而得到的实相。</b></p><p><span>“</span><b><span>波罗蜜多</span></b>”就是<span>到彼岸</span>。</p><p><b>彼岸，我们有多少个彼岸呢？是不是人生会有很多彼岸呢？</b></p><p>每一件事情都有每一件事情的彼岸，我们为什么要到彼岸去呢？说明当下在某件事情上是生活在苦海当中的。</p><p>这个彼岸有无数个。有的人修行的境界高一点，到达的是<b>了脱生死的彼岸；</b>再高一点的，达到<b>佛的彼岸（彼岸成佛）。</b></p><p>有的人说，我当下因为感情痛苦我需要度脱当下的痛苦，那就过我们当下的这个彼岸；有的人因为事业痛苦，生活在这个痛苦的河流苦海之中，那这就是我们当下所要过的彼岸，当下所要过的河，要到达的彼岸。</p><p>一个小故事：</p><p>有一个小女孩，有一天呢，走到一个海边。这个小女孩儿呢，她无依无靠的。她觉得特别的无助，不知道自己怎么就到了这里。发现身边也没有朋友，也没有人。自己很痛苦，很无助。这个时候啊！来了一条鲨鱼，对小女孩讲话。</p><p>问小女孩，“你来自哪里啊？你想要去哪里呢？”</p><p>这个小女孩就看着那个鲨鱼说，“为什么你长的那么大，而我长得这么小呢？”</p><p>鲨鱼说，“因为每个人当下所呈现的都不一样啊！你当下所呈现的就是你现在该有的那个样子啊”。又问小女孩，“你要去哪里呢？”</p><p>小女孩说，“我也不知道我要去哪里啊”。</p><p>然后这个鲨鱼就对她讲，“我要把你留在岸上呢，你又没有地方可去。可是我要带着你去海里，你也生活不了啊。要不然这样吧，我知道海的另外一边有很多人生活在那里。那个地方很好‘’。</p><p>小女孩说“那个地方有多远呢”？</p><p>鲨鱼说“很远，可能要走很久。但是那个地方我觉得特别好。”</p><p>小女孩说“那你觉得好，未必我也觉得好啊”。</p><p>鲨鱼说“对啊，我觉得那里的人们生活的很快乐，很幸福，可是你未必那样觉得，所以说我给你两个选择，要不你留在这里，要不你跟我去到那里。”</p><p>小女孩说“我不想去。我也不知道走多久，我也害怕，我不能去。”</p><p>鲨鱼说“如果你要实在不去，我就自己走了”。</p><p>小女孩想了想说“要不然我去吧，因为我在这里确实也很无助，如果你也走了，我也不知道要去哪，我也不知道在这里要待多久”。</p><p>这个小女孩就跟着鲨鱼去了，他们走了很久。到了一个地方，小女孩看到这里有很多人（高矮胖瘦男女美丑），但是她看到这里的人好像都很快乐。也没有人来欢迎小女孩，仿佛所有的人都看不见她，但是这个小女孩，却感受到这里是快乐的。然后呢，她无形当中就融入到这里，她也变成了快乐的一份子。这个时候她似乎忘记了她是从哪里来的？也忘记了那条鲨鱼。她就继续往前走，开始了她新的生活。在这里她很快乐，很平静。这个时候那条鲨鱼就默默的走开了，又来到了海边。这个时候又出现了一个小女孩。这个小女孩依然重复着那个话题，“你是谁啊？我在这里很无助啊，能不能告诉我？我能去哪里呢？”鲨鱼又开始重复着做的事情，这个故事讲完了。</p><p><b>为什么是鲨鱼呢？</b>鲨鱼看上去是凶恶的，看上去是那么不被人喜欢的。</p><p><b>为什么是小女孩呢？</b>当我们无助的时候，当我们痛苦的时候，谁又不是那个小女孩呢？无论我们的脾气有多么暴躁。无论我们表现在有多么强悍。无论我们长的是好看的还是不好看的，无论我们是男还是女，但你最脆弱无助的那个时候，你生活在苦海的边缘的时候，谁又不是那个无助的小女孩呢，所以生活才会有苦难，才会有感情的挫折，才会有事业的不顺，才会有世事无常的变化。当这些变化来临的时候，我们都是那个无助的小女孩，我们都想找那个丑陋的鲨鱼，甚至我们平时都想远离它。可是这个时候，我们是无助的，是无奈的。我没有请求它帮忙。可是它看上去是那么的吓人，但凡我们有一点办法，我们都不想跟它去到<span>彼岸</span>，但是我们实在无助，好像它也成为了最后的那根救命的稻草。</p><p>当我们如果早点觉醒的时候，早点去探访一下那个彼岸，我们就能减少一些无助，就能减少一些痛苦。</p><p>当我们<b>以人的眼睛</b>去看人的时候，就会有丑陋、美丽、强大、弱小等等。</p><p>你要<b>以鲨鱼的眼睛</b>去看人呢？无论你是男的、女的、高的、矮的、胖的、瘦的；无论你表现的有多么强大，你都是弱小的，无助的。</p><p>那如果我们学习佛法<b>以佛心、以佛眼</b>再看人呢？无论你当下是快乐的、是痛苦的、是强大的，还是脆弱的，你都是那个无助的众生！你都需要到彼岸去，因为你在这个人世间一定会有痛苦、苦恼、无助的时候。所以我们为什么不能早点去探索一下那个彼岸呢？</p><p><b><span>般若波罗蜜多，</span>如何才能探索那个彼岸呢？</b></p><p>我们要学习出世间的智慧。不要苦苦的执着在，自己当下所拥有的。我们追求<b>世间的智慧</b>越多，我们就看不到<b>出世间的智慧。</b>所以这个小女孩，为什么最后会跟着鲨鱼走了呢？太痛苦了，太无助了，这个时候才想着去彼岸。我们今天的很多人不是一样的吗？到了最无助最痛苦的时候才想着去彼岸，无论何时都不晚，越早明白越快脱离苦海。</p><p>佛法，天天都在给我们讲要放下身边的这一切，要明白世事的无常，要增加出世间的智慧，要到达彼岸去。彼岸，有很多，让我们痛苦的事情也有很多，我们要不停的去增加自己的智慧，自己去度过每一条，让我们痛苦的河流，到达每一件事情的彼岸，无论有多少种智慧，无论有多少条痛苦的河流，最后都要归到自己的心。所以，叫<b><span>心经，</span>经是什么呢</b>，<b>就是方法，就是道理。</b>所以我们要学习的是智慧的，可以到达，可以过每一条河流到达彼岸的心里的方法。所以经题叫《般若波罗蜜多心经》。</p><p>我们要修心的，我们每个人都有一颗“<b><span>妙明真心</span></b>”。<b>心经指的不是妙明真心，是我们当下的这颗虚妄之心</b>，我们当下有烦恼、嫉妒、嗔恨、贪婪、索取、快乐的心，那我们不停的去学习智慧，就是让我们这颗动的心，不停的随着世事变化的心，不停地让我们产生痛苦的心，去往妙明真心的路上。我们不停的学习智慧，不停的过每一个苦海的河流到达的每一个彼岸就是我们不停的<b>明心</b>的过程。我们不停的增加智慧，不停的明心，我们才能见性，所以叫明心见性。</p><p>“<b><span>见性</span></b>”那个性，就是我们本有的那个妙明真心。所以说修佛就是修心，从我们当下的这颗心开始修，我们原本的那个妙明真心都是一样的，都是与佛没有差别的。只不过我们当下所选的心不同，我们当下是人就是人心；我们当下如果是神仙就是神仙的心；我们当下是那个小女孩就是小女孩儿的那个心；我们当下如果是那个鲨鱼就是鲨鱼的那个心。我们身边还有很多的动物，比如说那个猪就是那个猪心，那个小狗就那个狗心。可是那个心终究要回到妙明真心，回到那颗佛心，它是一样的圆满。所以这个就是我们不断的修行的过程，所以无论我们当下在哪里，我们当下有多么的无助，我们要知道唯一的路只有我们不停的去增加智慧去过每一条苦难的河流，到达那个对岸，不停的让自己回到那颗妙明真心。所以整个心经就是指导我们的方法。</p>"
    },
    {
        "title": "第二讲-观自在菩萨",
        "html": "<p><b><span>观自在菩萨，行深般若波罗蜜多时</span></b></p><p><b>观自在菩萨</b>是指一个人一位菩萨（观世音菩萨）。菩萨有很多的圣号。佛有很多的圣号。每一个圣号表的都是一种法，所以是一个名字也是一个法。在表什么法的时候，就会用什么样的圣号。</p><p>《心经》的开篇，观自在菩萨，表的是如何自在的法？<b>何为自在呢？不被万事万物所束缚，叫做自在。</b></p><p>比如说：当我们被绳子捆住的时候，我们会觉得自在吗？把一只小鸟放在一个笼子里面，有吃有喝，也可以跳来跳去。但是它想要飞出去是不可能的，所以你看小鸟它自在吗？不是很自在吧。</p><p><b><span>观自在</span></b>我们要学会观<b>自己自不自在，看看自己哪里不自在？</b>鸟有可能被鸟笼所困不自在。那我们自己会被什么所困而不自在呢？人都是被自己的念头所困。当我们被自己的念头困住的时候就开始变得不自在。</p><p><span></span><b>为什么叫心经？</b></p><p><b>困住我们的是心念</b>。比如说当我们想要更大的房子，想要一个东西没有达到我们的满意，求而不得，就会很痛苦。我们当下想让自己清净一点，可是清净不了就会产生不自在，就会痛苦。所以整个这些让我们束缚的，都是我们的念头，都是由我们的心念所产生的。</p><p>所以我们自己来观哪里是自在的？哪里是不自在的？哪里不自在我们就要修哪里。哪里不自在我们就要放下哪里。</p><p>观自在菩萨，菩萨他是大自在的。他是自由自在的。<b>自在是一种境界，是一种状态</b>。那我们反观自己，我们达不到自在的境界，那我们就观不自在，我们哪里不自在？我们就去修正哪里，被什么念头所困，我们就舍弃掉什么念头。</p><p><b><span>这个念头要如何舍弃呢？</span></b></p><p>你得舍掉那个<b>欲望</b>。我们生而为人已然不自在了，因为我们有色身。我们需要吃、穿、喝，我们还需要那么多复杂的欲望，<b>财色名食睡</b>，样样都想要。所以已然变得不自在了。</p><p><span></span><b>观自在菩萨这个境界。不想吃的时候就可以不吃，不想喝的时候就可以不喝</b>。</p><p>不吃饭，我们饿；不喝水，我们渴，所以这是我们人的最基本的欲望，除了这个以外的欲望都会让我们产生不自在<b>。</b></p><p><b>修行为什么要不断的减少欲望呢？</b></p><p>只有我们的欲望变得越少，我们才相对变得越自在，我们的欲望变得越多，我们苦苦地向外寻求，越求越不自在，被束缚的就越多。起码我们做人可以达到的那个自在的状态，就是我们的欲望极其少，生活非常的简单。当以简单作为自己行为的标准，所有在得来的你会发现都是可以享用的、享受的<b><span>（知足常乐）</span></b>。我们自己的心念，只要吃饱就可以了，只要有衣服穿就可以了，这个时候，你会发现我们已经拥有的很多了。</p><p><b>我们为什么会不自在呢？</b></p><p>我们的期望总是过高，而现实好像达不到我们期望中的那个样子，就产生了念头、痛苦。当我们对自己的标准要求如此低的时候，只要满足我们最基本的生命的需求状态就可以了，这个时候你会发现，你的自在，就会变得多一点。当修到一定的境界的时候，这些我们可以舍掉（我们的肉身都可以舍掉）。</p><p><b><span>佛法说“四大皆空”</span></b>，<b>我们的身体都是假合而成，当我们把身体空掉的时候才能入圣贤之流，才能达到观自在菩萨的境界</b>。</p><p>我们的烦恼皆是因为欲望太多，欲望就是囚禁我们的牢笼。鸟是被鸟笼所囚，我们自己是被自己的心牢所囚。念头，让我们变得不自在。所以我们看以前修佛法的人，是不是一无所有，<b>“一钵千家饭，孤身万里游”</b>只要吃得饱，能保证生命的存活，其它的都不需要。这个才是大自在的境界。儒家和道家的人也同样如此。道家的人什么都不需要，<b>何其潇洒飘然物外。</b>儒家也是一样的，孔子说，“<b>曲肱而枕”</b>有粗茶淡饭，乐就在其中，说颜回：<b>“一箪食，一瓢饮，人不堪其忧，回不改其乐。</b>”一碗水，一碗饭足矣啊！现在就是因为我们的欲望太多了才让我们不自在的，我们想要的东西越多我们就越不自在。</p><p>当我们把自己的欲望和期望值放的那么低的时候，你会发现并不是你不要了，而是你不被物所缚，不执著在其中，这个时候你才能自在。</p><p><b><span>观</span></b>，观字很重要啊！</p><p>观自在，观不自在。看看自己哪里不自在就修哪里，哪里不自在就舍哪里。</p><p><b>那观自在用什么观呢？要用心观</b>。</p><p>用心去观我们的念头、思维、感受哪里不自在。比如说：我们对面坐一个人，他说有很多的烦恼，很多的痛苦，很多的不自在。你用眼睛可以看到这个人的不自在吗？看不到吧。你要跟他聊天，通过他表述他的生活现状，他为什么而痛苦和烦恼，这个时候，你才能观到他的不自在，并且去给他方法。那我们观自己更是如此，观自己哪里自在，哪里不自在，我们都是被自己的心念所缚。那个心念才是我们的牢笼，所以我们不停的去观自己的心念、思维变化。被什么事情所束缚，我们就修掉或者舍掉什么事情，才能得自在。</p><p><b>我们可以去观我们的念头去了哪里？去追一个衣服，一个更大的房子，一个车子，一些票子等等，他去了哪里，那就是我们的念头，让我们不自在的地方。</b></p><p>我们的念头，每天都是杂念纷飞的。为什么有<span>84000</span>烦恼，因为我们有<span>84000</span>个念头在飞，有<span>84000</span>个念头，再跑，这些念头让我们不自在，所以当我们懂得止住自己的念头的时候才能变得自在，否则就是杂念纷飞的。我们这个心就是静不下来，所以首先要学会观。</p><p><b><span>观自在菩萨，菩萨是什么呢？</span></b></p><p>菩萨叫菩提萨埵，“菩提”是觉的意思觉悟觉醒，“萨埵”是有情有情众生的有情，所以菩提萨埵是觉有情。菩提萨埵还有另外一个理解道理是一样的，菩提是佛道，萨埵是成就众生。所以什么叫菩萨呀，用佛道成就众生的人叫做菩萨。</p><p><b>观自在菩萨。不是一个人，</b></p><p><b>是一种精神，</b></p><p><b>是一种境界，</b></p><p><b>是一种状态，</b></p><p><b>是自觉以后再去觉他，是用佛道成就众生这一类人叫菩萨。</b></p><p>我们每个人都可以是<b>观自在菩萨</b>，先观自己自不自在，自己自在了再去觉醒他人，让他人也变得自在，这个就叫做菩萨。比如说：我们在生活当中是不是有人经常用“菩萨”来形容他人，说我身边有一个什么样的朋友像菩萨一样，说明他在不停地帮助他人，在救人慧命。自己觉醒了，再帮助他人觉醒，正在行菩萨道，所以我们每个人都可以是菩萨。</p><p>我们生而为人，我们未必能做到，样样自在。可是我们哪里自在了，我们就可以用我们自在的这个方面去帮助他人，让他人也变得自在。</p><p><b><span>行，深般若波罗蜜多时。</span>首先要观。观以后要要行，所以叫修行</b>。</p><p>行，深般若波罗蜜多时。说回想当初，这个是时间概念。行深“深”是指达到了一定的境界，（<b>般若是智慧，波罗蜜多是到彼岸）</b>，我们再行深到达彼岸智慧的时候。照见五蕴皆空，度一切苦厄。</p><p><b>在什么时候能照见五蕴皆空呢？</b></p><p>行深到彼岸的智慧那个时候达到了一定的境界，自然就出现了那个果叫照见五蕴皆空。</p><p>刚开始<b><span>观</span></b>是不够的，自己哪里不自在？要去修哪里？要去行。行，深般若波罗蜜多时，行到了一定的境界的时候照见五蕴皆空。发现原来五蕴都是空的，一切都是空的。这个时候度一切苦厄，这个时候你才能解脱度脱一切苦厄。</p><p><b>很多人经常问，我如何才能没有烦恼？</b></p><p>先观后行，行到一定的程度的时候才能照见五蕴皆空。突然发现五蕴都是空的，世间所有的一切都是幻想，这个时候你才能度一切苦厄。</p><p><b>我们为什么会有那么多的苦厄？</b></p><p>执着于所有的事情、所有的东西；执着于房子，车子不了解它是空的；执着于感情，不了解它是无常的；执着于世界万事万物，认为它是永恒不变的。所以才产生了痛苦！</p><p><b>如何才能得自在呢？</b></p><p>首先得了解这些空性智慧。你要知道，<b>凡所有相皆是虚妄</b>，你把这些虚妄的相都破掉的时候，你再回到当下，这个时候你会发现你的念头，才会变少。所以只有观，是不够的。你要不停地去行深般若波罗蜜多时（行的是到彼岸的出世间智慧，不是世间智慧）。</p><p>世间的智慧，你行得越多陷得越深，更不得自在，人们总是认为我拥有了更多，就自在了，幸福了，开心了。实则不是这样的，你拥有的越多，越难放下，也就越不自在。行的，越多，我们的智慧自然也就在不断的增加，你的境界也就在不断的提高。我们的自在自然就会多一分。我们到达彼岸的智慧，自然也就多一分，我们就多照见了一层空性直至圆满为止。</p>"
    },
    {
        "title": "第三讲-五蕴皆空",
        "html": "<p><b><span>照见五蕴皆空，度一切苦厄</span></b>。<b>照见五蕴皆空</b>是一个“果”，“因”是<b>行深般若波罗蜜多时。</b></p><p>当我们去行，到达彼岸的智慧到一定的程度的时候，出来的结果就是照见五蕴皆空。这个时候，<b>五蕴皆空</b>又成了“<b>因”</b>，<b>度一切苦厄</b>又成了<b>“果”。</b>当我们照见五蕴皆空的时候，自然就度一切苦厄，就没有了所有的苦厄和痛苦。</p><p><span></span><b>什么叫五蕴皆空？</b></p><p>我们暂且把五蕴称为念头。当我们的念头都空掉的时候，就没有痛苦和烦恼，念头不好理解所，以佛法把它分为五蕴。<b>蕴就是集合，念头的集合成为蕴</b>。把它分为五种念头的集合，也就是五蕴。<b>五蕴有色受想行识。</b></p><p><b><span>色蕴</span></b>在佛教当中，有狭义的和广义的。</p><p>狭义的解释，我们能看到的都称为色，所以六尘还叫色声香味触法，那里的色就是指的狭义上的。我们能看到的一切美好的事物；能看到的一切相都成为色。</p><p>广义上的色，我们看到的、听到的、闻到的、尝到的、身体所触碰到的，都成为色，这里的色是指的广义上的色。六根的五根（眼耳鼻舌身）。都是来取色相的。比如说；我们眼睛看到的、耳朵听到的、鼻子闻到的、身体通过触觉所感受到的都是色。所以广义上的色我们看得到的，看不到的，只要是取回来的相都是色。</p><p><b>那我们用什么取着相呢？</b></p><p>金刚经有句话<b>“若心取相，即著我，人，众生，寿者”</b>，这里的心是第六<b>意识心</b>。<b>眼耳鼻舌身意，统称为六根</b>。这个“意”是来取相的，意来支配我们的眼睛、耳朵、鼻子、身体、舌头。我们看到一个东西，首先是不会产生任何的想法的。比如说，看到一朵花，它只是一朵花。这个时候我们的意识开始分别，它是红色的、白色的还是紫色的，我们的意识开始分别，我喜不喜欢这个颜色；当我们听到别人一句辱骂的话语，首先这是耳朵的功能听到，意识接下来再去分别，他说的话是好听的还是不好听的，让我产生了高兴还是不高兴的，所以意识来支配我们的眼耳鼻舌身的。</p><p><b><span>色</span></b>指的是眼耳鼻舌，所取回来相就是这些色相。<b>六根，对应着叫六尘。耳鼻舌身意叫六根，色声香味触法叫六尘。六根也叫六入</b>。</p><p><b>为什么叫六入呢？</b></p><p>所有的尘都是从六根入的，六根就是六个根本。说我们有眼睛，这是一个根本。有眼睛这个工具才能看到。有耳朵这个工具才能听到，有鼻字这个工具才能闻到，有身体才能产生触觉。所以六根对应的是六尘。眼睛对应的是色，看到的色相。耳朵对应的是声音听到的声音。鼻子闻到的是香臭好闻，或者不好闻；舌头尝到的是味道好吃，或者不好吃。身体对应的是触觉，所碰到东西舒服不舒服（冷热软硬等等）。</p><p><b><span>意产生的是法</span></b>。当我们的意识学到了一个什么东西，接触了一个什么新鲜事物就产生了法。举例。我们看到一朵花，不认识这朵花的时候我们是没有法的，不知道它叫什么。这个时候有人告诉我们说，这个叫做玫瑰花。我们意就产生了，法。从此以后我们就知道，它叫玫瑰花，所以<b>意，对应的是，法。</b>什么叫六识呢？眼耳鼻舌身意六根。对外面的色声香味触法六尘，中间的功能叫六识。所以合起来又叫做十八界。</p><p>五蕴的色，我们能听到的、看到的、闻到的、身体触觉所产生的一切相和一切物质都称为色。色受想行识。有了色，我们就会产生受。我们取回来的相，就会产生感受了，比如说看到了一朵花，就产生了感受（花真漂亮）；听到了一句不好听的话就产生了感受（不舒服，他为什么要骂我呢）；’听到了一句赞美的话，就产生了感受<span>(</span>很高兴<span>)</span>；触碰到了冷就产生了感受<span>(</span>好冷好不舒服）。所以受是应色而生的。</p><p><b><span>受又分为苦受，乐受和舍受。</span></b>比如，别人说了一句不好听的话我觉得很痛苦，这个就是苦受；我看了一个美好的景色，我很快乐很高兴，这个就是乐受；舍受就是无苦无乐的，比如，生活当中经常有这种感受，发生了一件什么事情，你是没有感受的。没有什么高兴的，也没有什么不高兴的，这个就叫舍受（无苦无乐）</p><p><b>色受想，取了色相有了感受，接下来就有想法了，这个时候想法就是思维。</b>开始有了思维，开始思考了。举例，我们看到了一朵花，这是色相。感受它很漂亮，这个时候有了受。接下来就要产生想法了，我想把它摘下来。想法就出来了。他刚才说了一句不好听的话，这个是相。感受我很不舒服，接下来就开始产生想法了，我恨他，我讨厌他，我要找机会报复他，或者我当时我就要骂回去，这都是“想”’，思维开始出来了。</p><p><b>色受想行，接下来就到了“行”</b>。行，这个时候，是心念心行，我们讲的五蕴都是心法，所以这里的行，不是行为是心行，一个念头接着一个念头不停叫做，行。比如说，刚才我们看到的这朵红色的花，我们产生了想法想把它摘下来，这个时候我们就产生行。下一个念头好像，【不好啊。摘下来，别人看到了不好啊，算了，我管它呢，我把它摘下来再说嘛。】你看这个时候一个念头，一个念头开始不停，他刚才说了一句，不好听的话，让我觉得很难受，我心里很怨恨他，我也想骂回去，这个时候行就是更深一步的心行。我要骂回去，不行？他对方人多，我骂回去万一打不过他怎么办？哎呀，他是那样没有素质的人，我又何必骂他呢？可是不骂他，我也很生气，等我以后有机会我一定报复他。<b>我们心上的想法，念头一个接一个的不停，这个时候我们就产生痛苦了，这个叫做行。</b></p><p>行，也是造业的前身。我们先开始心上行，心上行产生了一系列的想法和念头，接下来就产生了行为。比如说，我们要产生一个善的行为，我们要去帮助他人，就有善业了。比如说，他不停的骂我，我要想办法去报复他，这个时候，我们的行为就会产生恶业，所以，行也是业的前身，当我们不停地在心上行的时候。行到一定的程度，我们就会变得愤怒，我们就会变得有所行动，这个时候就开始产生业力了。当我们思考一件事情的时候，不会一个念头起就会止住的。比如说，我们现在想象一下。下午要发生的事情是不是，不是一下就想完了，一个念头接着一个念头不停的去想，这个就叫行。</p><p>色受想行识。这个时候就产生了识。这个识就是我们能思考的能思维的，所得出来的法中间的那个功能就叫做识。我们是有意识的，这就叫识。如果没有意识的人，就是植物人了，他是不能思考不能思维的就是没有意识的。</p><p><b><span>识</span>分为八识（眼识耳识鼻识舌识身识意识这是前六识）</b>，我们绝大多数的朋友都知道眼耳鼻舌身意。眼耳鼻舌身这是五根不是识。对应的色生香味触那叫六尘。中间起作用的这个叫做识。比如说我们的眼根看到一朵花，我们觉得它是好看的，或者觉得它是不好看的，这个功能叫做识。</p><p><b>眼耳鼻舌身，如果在一个企业当中眼耳鼻舌身就相当于员工，意识这个意就相当于领导，这个领导是支配着员工的</b>。比如说，我们眼睛看到一个东西，是通过意识来告诉我们它是一朵花、是一个草、是一个杯子、是一个房子。比如说，我们的耳朵听到一个声音，是意识再告诉我们，这个声音好听还是不好听；是赞美我的还是辱骂我的。没有意识的人，成为植物人。植物人，他的眼睛还在，他懂得分别是什么东西吗？是不是不懂的；他的耳朵还在，他知道你是骂他的，还是赞美他的，他是不知道的，因为没有意识去分别和分辨。所以意识是支配着我们，前五根所产生作用的。</p><p><b>我们每个人的意识，又是不相同的。</b>举个例子，有的人看到花，觉得它好看，有的人觉得它不好看；有人喜欢红色，有人喜欢白色，有的人喜欢粉色。当发生一件事情的时候，每个人所思考出来的法也是不一样的。每个人的意识都是有差别的，这个差别从哪里来呢？从我们的生存环境，生活环境，以及学习所得到的认知不同。我们学习和没有学习的人，同样面对一件事情所有的法是不同的。学习过的东西不一样所产生的法就不同。我们每个人从小生活的环境不同，接触到的思想，接受到的社会，接受到的认知不同，就会导致我们每个人的意识不同，所得出来的法不同，所以当我们遇到一件事情的时候，我们每个人都有不同的想法，不同的法。比如说，在一个企业当中同样碰到一件事情，你会发现，事情是一样的。基层员工和部门经理还有董事长来解决这件事情的方法，是不是不一样啊。是不是越高境界的人看这个事情越小，解决起来越容易为什么呢？意识不同，思维不同，所得出来的法就不同，所以这个意识是通过我们自己的认知，不断的学习，所建立起来的。</p>"
    },
    {
        "title": "第四讲-五蕴皆空",
        "html": "<p><b><span>第七识叫末那识，第八识阿赖耶识</span></b>。</p><p><b>眼耳鼻舌身意这六识是我们平常都要用的到的。第七识和第八识是我们用不到的，也看不见的。</b></p><p>学佛有一句话叫自性圆满，人人都有一颗妙明真心。人人皆具佛性，众生皆可成佛，我们每个人，每个众生都是有佛性的，都是有佛心的，这个称为自性。</p><p><b>自性一体两态两种形态，迷的时候叫阿赖耶识，不迷的时候叫自性，它是圆满成佛的。</b>我们被迷住的时候就是阿赖耶识，所以说自性是一体两态。好比说，是水。水在它原本的状态下，它叫水，冻冰以后它叫冰。这个时候你能说冰不是水吗？是水，但是你也不能说冰就是水，因为它不是原来的那个水。所以自性也是一样的，觉悟的时候就是佛，就是自性圆满的，迷住的时候就是阿赖耶识。这个时候阿赖耶识要随着业力去轮转投胎了，所以当我们众生被迷住的时候，那个自性的另外的一面，一体两态叫阿赖耶识它就出现了，我们就开始投胎入轮回了。</p><p>比如，我们把原本的那个自性比作是面粉，原本那个自性是通透的，是圆满的。那个就是佛。是佛性是佛心，它就是面粉。当有水进来的时候，面粉就成了面团。当这个面粉成了面团就是迷住的状态，迷住的状态就叫做阿赖耶识就是我们例子当中的面团。当我们成为这面团儿的时候，下一步就是要投胎的。那投胎到哪里去？是根据每个众生的业力不同，所投胎的地方就不同。<b>佛家讲六道众生都是随业力所转。</b>比如说，我们这个面团，就是那个阿赖耶识，这个时候我们成为面团就是迷了。我们投到六道当中就要产生不同的形态。比如说，要想做成饺子，这个面团就要成为饺子皮儿；要想成为包子，就会成为包子皮儿；要想成为面条，就会被擀成一条一条的。我们下一步就成了饺子包子面条，这个时候我们成为了，包子、饺子还有面条，就是第七识末那识。</p><p><b>我们的第八识的状态像一个面团还没有成型，但是接下来要去投胎了，当我们投胎成为一个固定的形态。比如说面条包子水饺，这个时候我们就是有了第七识叫末那识。</b>比如说，我们从阿赖耶识投胎到人、投胎到动物、投胎到天人道、投胎到饿鬼道。这个时候我们就有了第七识成为末那识。当我们有了第七识末那识的时候，有了自己的形态。比如说，人道动物道。比如说，成为包子成为水饺，这个时候我们的第七识，就产生了也就有了我们平时所讲的先天的习性。比如说，有的人天生就聪明；有的人天生就愚笨；有的人天生的脾气就暴躁，有的人天生就比较勤奋，这个时候就是我们先天的习性。我们之所以投到人道、畜牲道，或者天人道，是由于我们阿赖耶识的业力不同，我们所产生的形态就不同。同样身为人，我们每个人先天的习性又不同。比如说，我们刚才举了这些例子是告诉我们每个人先天的习性就不同。为什么会不同呢？它跟我们阿赖耶识里面的业力是相关联的，所以学佛，有一句非常著名的话，<b><span>万般带不走唯有业随身。</span></b>我们这一生，所有的东西都是带不走的，无论我们有多少金钱，我们有多少房子，我们有多少产业，都是带不走的，但是唯有业随身，只有你的善业和恶业是跟随着你的。我们所造下的这些善业和恶业，决定了我们阿赖耶识。里面所储存的业力决定了，我们下一世投胎到哪里去，决定了我们同样生而为人，我们天生的习性和性格不相同。<b>所以我们修行的第一步是止恶扬善</b>。不让去做恶业，先去做善业，这样我们下一世的投胎才能变得好一点。即使同样生而为人，我们的福报，更多一点，智慧更高一点，我们的习性更好一点，我们天生更良善一点，这些都是由我们自己的业力所轮转的。</p><p>当我们有了第七识的时候就有了先天的习性，接下来开始我们人开始出生，随着我们的出生就有了前六识。眼耳鼻舌身意我们是有眼睛、耳朵、鼻子、舌头、身体的，这里的意是能思考能思维。第六意识心是生而为人，他就有的。</p><p>这个时候我们从自性产生了业力开始，从第八识阿赖耶识准备开始投胎了，从第八识要投胎的时候得转化一个形态又产生了末那识，随着末那识，我们要开始出生就产生了眼耳鼻舌身意再加上末那识阿赖耶识统称为<b>八识</b>。</p><p><b>那为什么说人人皆可成佛呢？</b></p><p>比如说，我们成为了水饺、包子。那我们水饺和包子当中有没有原本的自性的那个面粉呢？是不是都有。可是它又不是面粉，就像我们现在有了眼耳鼻舌身意。那我们这里面有没有自性啊？还是有的自性，只不过它被迷住了。就像水饺和包子，虽然里面还有面粉，但是它还掺杂了很多其他的东西，所以这个时候就见不到自性。就好比，我们是一个水饺，是一个包子，我们这个时候见不到面粉本身。</p><p>所以修行，就是不断的去掉，我们眼耳鼻舌身意所取的相。我们不取相不造业，让自己回归本来清明的状态，也是明心见性的过程才能见到本来的那个自性。</p><p><b>那我们了解了自性，有什么好处呢？</b></p><p><b>我们了解的第八识，第七识是为了做什么呢？</b></p><p><b>让我们知道眼耳鼻舌身意前六识都是假的。</b>都是我们被迷住的众生才用眼耳鼻舌身意，所以我们要知道，我们所有的取回来的相都是假的，我们明白这个道理告诉我们不要执着。当我们以饺子的眼光去看包子就会说，你肚子怎么这么大，你怎么那么富有啊，为什么我不能变得那么大；我们是饺子又看到了面条，你怎么那么苗条啊，你怎么可以那么长啊，你怎么可以那么好看呢，为什么我不能如此的苗条呢。</p><p>当我们以这些假相，以我们的前六识去看待这个世界，就会生出来这样的想法和攀比之心，但实则它都是假的。我们回归到原本的状态都是自性的状态，人人皆是佛，本来都是那个面粉。所以演化而成的，他当下变成包子，他当下变成面条，只不过是和我们的业力不相同而已。再比如说，我们现在是个矿泉水瓶、饮料水瓶、塑料杯子，那我们原本的那个状态都是一摊塑料。当这些杯子瓶子被回收的时候，它又重新变成了一堆塑料。那下一步这个塑料，可能原本是瓶子的变成杯子，是杯子的又变成瓶子了，所以我们人也是一样的，都是随着自己的业力所轮转。今生是瘦的来世可能变胖；今生是人来世可能变猪；今生是人来世也可能变成神仙，都是随着我们自己的业力所轮转。所以说<b>万法皆空唯因果不空，所有的法都是空的，都是方便法，都是告诉我们这些道理和智慧的。</b>但是，因果是不空的，造了什么样的因，就会得什么样的果。我们经常听到一句话<b>，佛眼看世界众生都是平等的，无善无恶无美无丑什么都没有，但是我们用肉眼看世界，就有高矮胖瘦美丑善恶</b>。</p><p><b>为什么佛眼看世界？他是平等的，无差别的一切都是空的呢？</b></p><p>因为佛眼看世界用的是自性，我们如果明心见性，用那个自性看世界，他也是空的，一切也是平等的，什么都没有，所以告诉我们照见五蕴皆空度一切苦厄，当我们行深般若波罗蜜多时，到一定的境界的时候所呈现出来的果就照见了五蕴皆空，什么都是空的，色受想行识，都是空的，所以这个时候就回到了自性的状态，就是我们所称的<b><span>觉者</span></b>。</p><p>当觉悟的时候回到自性的状态，他本来就是圆满的，度一切苦厄，没有一切的苦和恶。照见五蕴皆空度一切苦厄，圆满成佛了。那当我们做不到照见五蕴皆空的时候，我们可以往下一层讲，按照我们接地气的，<b>如何在生活当中用？可以不入色声香味触法</b>。我们修不到无，我们可以不入。</p><p>比如说，听到他骂了我一句。我知道了，这件事情的本质，我可以不生气，不愤怒，不烦恼。比如说他骂了我一句，本质是什么呢？本质，骂的这句话它只是一个声音。骂的这句话和赞美的那句话和鸟叫和猪叫和狗叫，和外面过去一个汽车的声音，它的本质都只是一个声而已。这个时候我们意识不去分别，分辨的时候，他说的一句话，就是一个声音，他赞美的话，又是一个声音，我不会因为这个声音而产生烦恼和痛苦，这个就是不入。当我们懂得不入的时候，我们生活当中的烦恼痛苦就会变少，我们少取色相这个时候我们的烦恼就会少一层，所以我们去看修持佛法的人，有一定的修为是不是看什么事情都是淡然的。看到一个美丽的事物也不贪著，看到一个别人觉得不顺眼的事情自己也很淡然，听到了一句不好听的话自己，呵呵一笑了之。这都是不入的表现和境界，当我们达到不入的时候，我们的烦恼也会变少，所以这是我们生活当中，关于不入的用处。</p><p>我们一下达不到五蕴皆空，但是我们可以次第而行，从不入到空。比如一朵花也是一样的，我看到一朵花。它的本质就只是一朵花，没有什么好看和不好看，这个时候我们不起贪著之心，不取相，也就没有那么多烦恼。当我们觉得花非常漂亮的时候，特别喜欢一朵花的时候，你会发现就会起贪著之心，当它凋零了，我们就会痛苦，我们特别喜欢这个东西的时候，如果它丢了我们就会痛苦。我们特别喜欢一个人的时候，当他离开我们了，就会产生痛苦，就是因为我们入的太多了，所以烦恼和痛苦自然就会多。</p><p><b>反过来讲，那不贪著是不是我就不要了呢？</b></p><p>不是的，是我们要，但是我们并不贪著于要，这个就是不迷的状态。如果贪著就是迷，举个例子。我们喝茶，如果你很贪著，必须要喝红茶，喝别的茶，我就不高兴、不开心，产生苦恼这个叫迷。什么叫不迷呢？我可以喝茶，有红茶就喝红茶，没红茶就喝绿茶，又有什么区别。有没有茶都一样，我喝水，也是可以的，这个就是不迷。比如说，我们平时在做事情当中也是一样的，有的人做事情只为了追求利益、名望，这个时候就是迷在里面的。因为迷，你就会产生很多过激的行为就会造业。</p><p>积极努力的去做事情，有财富、名望，都可以要。但我不是为了追求名望和财富而去做事情，我是为了把因种好，把事情做好，既来之则安之，这个时候你就是不迷的状态。</p><p>五蕴皆空，度一切苦厄，当我们还不能五蕴皆空的时候，我们可以循序渐进地去修行，所以我们了解了五蕴，了解了八识，就是为了让我们次第而行，一步一步来。我们行得一分，行深，行得一分到达一个境界，我们就减少一层苦恼。</p>"
    },
    {
        "title": "第五讲-度一切苦厄",
        "html": "<p><b><span>度一切苦厄，“度”是救度脱离。</span></b></p><p>先讲“苦”，苦有无量无边的苦，太多了，说不清楚。我们简单的来讲，它又分为三苦和八苦。三苦呢？有<b>苦苦、坏苦和行苦</b>。</p><p><b><span>“苦苦”</span></b>，比如说，疼或者身体的痛、冷或者热，这都是苦苦。</p><p><b><span>“坏苦”，</span>是乐过之后的苦叫做坏苦。</b>比如说，我们特别喜欢这个杯子，这个杯子丢了；我们特别喜欢一个人，这个人离开我们了；我们特别喜欢一件衣服，这件衣服不能穿了，都是坏苦。</p><p>任何事情都是相对的，有乐就有不乐；有我们喜欢的事情就有不喜欢的事情；有让我们高兴的事情就有让我们不高兴的事情。当我们喜欢赞美的时候，当他不再赞美我们了，就开始产生坏苦了。所以，生活当中这样的苦太多了。我特别喜欢一个人，当时是很快乐的，突然他有一天不喜欢我了，你当时有多快乐，现在就有多痛苦。我喜欢这个杯子，你有多喜欢过后就会有多痛苦。所以这是坏苦。</p><p><b><span>“行苦”</span>事物不停的变迁所带来的苦叫行苦。</b>比如说，我们随着年龄越来越大了，我不再年轻了，做很多事情力不从心了；我们原本是富有的，开始变得贫穷了；我们原本生活在繁华的都市，现在回到了冷清的小镇；我们原本的生活状态是很安逸的，很潇洒，很自在的，我突然还是工作了，压力变得很大，每天变得很忙碌。所有的随着事物变迁所来的苦。都称为行苦。</p><p><b>人生最大的行苦是不停的轮回</b>。今生做人，下一世有可能做天人，有可能做阿修罗，有可能去畜生道，有可能去恶鬼道，不停的轮转，不停的轮回，这是最大的行苦啊，</p><p><b><span>八苦</span>生、老、病、死、求不得、爱别离、怨憎会、五阴炽盛</b></p><p><b><span>生，生苦。</span></b>比如说，我们是一个胎儿刚开始入胎的时候在母亲的腹中就开始受苦了。母亲吃了凉的，我们会不舒服，吃了热的我们也会不舒服。母亲弯腰的时候，我们觉得不舒服。被碰到的时候，我们也觉得不舒服，所以从生开始就有苦！</p><p><b><span>老苦。</span></b>当我们随着年龄不断的增长，我们的身体机能在不断的退化，我们的精力也开始变得不好，被各种病痛，所折磨。到老了，还不一定有人照顾你，即使有人照顾我们，我们也是难受的，也是痛苦的，很多事情想做也不能去做了。所以到老了也是苦的。</p><p><b><span>病苦</span></b>，我们这一生当中有各种疾病围绕着我们，即使是一个小小的感冒，我们也是很不舒服的。况且到了这个时代，随着人们阅历不断的增长，各种疾病变得越来越多，各种癌症变得越来越多，所以我们要承受病痛的折磨病苦。</p><p><b><span>死苦</span></b>，当我们面临死亡的那一刻。还有诸多的放不下，还有诸多的恐惧，临死之时，犹如扒皮剥骨，所以也是很痛苦的。</p><p><b><span>求不得</span></b>，当我们有贪欲得不到满足的时候，而产生的痛苦。我们这一生，不停地向外，去追逐，想吃的更好，想穿的更好，求而不得就会痛苦。我特别喜欢一个人，但是对方不喜欢我，或者由于种种原因，得不到，求而不得就会产生痛苦，求升官，求发财，爱一个人爱而不得，都会痛苦。所以有求则苦！</p><p><b><span>爱别离。</span></b>当我们爱一个人不得不分开的时候，痛苦；亲人离世，痛苦；我们有一个很好的朋友两地分开，痛苦；我们有一个心爱的宠物丢了，也会痛苦！所以我们这一生要承受诸多的爱别离，只要是相爱的人，爱人，亲人，友人，我们喜欢的物品和我们产生了分离，产生了别离都要痛苦的。</p><p><b><span>怨憎会</span></b>，我们讨厌一个人的时候，讨厌一件事情的时候，我们很讨厌一个人还不得不和她在一起工作的时候，都是痛苦。在婚姻当中，明明不爱一个人了，还不得不生活在一起，痛苦！我明明不喜欢一个工作，不行啊，我得赚钱养家，痛苦；我现在的这个房子，我住的不开心。太小了，太破了，我想要一个更大的房子。可是没有办法，我实现不了，痛苦。</p><p><b><span>五阴炽盛，</span>“五阴”照见五蕴皆空的五蕴</b>。五阴炽盛像火焰一样燃烧，五阴炽盛也是我们一切痛苦的根源。被迷住了，不停的颠倒妄想，任妄为真。每天活在颠倒里面，是整个我们的身心都是被迷住的，被五蕴所颠倒的，每天沉浸在五蕴的色受想行识当中才产生了，诸多的苦恼和痛苦。</p><p>所以我们去学《心经》就是让我们迷途知返，不再颠倒，知道我们现在所看到的一切都是假的，告诉我们原本还有一个自性，一个妙明真心。我们要去学习出世间的智慧去到达那个成佛回归自性的彼岸。我们不能一下到彼岸的时候，我们要懂得次第而行，去过我们生活当中一条一条的苦海，过每一条彼岸，我们的烦恼痛苦才能少一分。</p><p>我们现在所讲的三苦和八苦。不足以总结我们众生无量无边的苦。这八苦和三苦是我们在日常生活当中，在我们的人生当中经常遇见的，所以也只能是举例说明告诉我们。还有诸多的苦，只有我们自己懂得不断地去修行，让自己不断的去增加智慧才能到达那个彼岸。</p><p><b><span>度一切苦厄，“厄”</span></b>，就是灾难。比如说，自然现象。地水火风，地震、水灾、火灾、台风等等除了自然现象以外，我们生活当中也会有很多的灾难发生，有很多的意外发生，所以越是不顺利的人，会讲我的生命当中真的是多灾多难。所以我们生而为人，就是有这些苦厄的，只有我们照见五蕴皆空圆满成佛，回归到那个自性，我们才能度一切苦厄，自然也就没有了人世间的苦厄，自然也就没有了六道众生的苦。</p><p>我们讲苦和恶又讲到灾难。众生最大的灾难就是不得闻正法，一直在颠倒妄想当中无有出期，这是众生最大的难，我们在今天这个时代还能去听闻正法，说明我们是有福报的，说明我们是有善根的。所以我们要懂得珍惜，要懂得不停的去修持正法，让我们回归原本的那个佛性，回归原本的那个圆满，才能度一切苦厄。我们不停的去学习正法，通过不停的学习正法，我们不停地观照自己的心念行为，不停地观照生活当中所发生的事情，通过观照自己，所体悟到的智慧，生出实相般若。</p><p>我们做一个总结。有一个人叫观自在菩萨。先观自己自不自在，自己自在了以后，去觉悟有情众生。观自在菩萨。行深般若波罗蜜多时。自己行持到一定深度的时候照见了五蕴皆空。原来五蕴都是空的，人人都有一个自性，它是圆满的，人人皆可成佛，度尽了一切苦厄。没有了人世间的苦厄，没有了六道的苦厄。</p><p>观自在菩萨，这个时候，自己自在了，用佛道来成就众生，又来告诉我们，行深般若波罗蜜多时，我就是这样行持的。我把它告诉给众生，大家也要这样去行持，当你也行持到一定的境界的时候，也会照见五蕴皆空。自然和我一样度尽一切苦厄。这个时候都回归自性的时候，没有你，我之分，人人皆可成佛，自性本然圆满。</p>"
    },
    {
        "title": "第六讲-色不异空",
        "html": "<p><b><span>舍利子，色不异空，空不异色，色即是空，空即是色。受想行识亦复如是。</span></b></p><p><b>有一女子眼睛明亮长相端庄叫做舍利。生子叫做舍利子，亦叫舍利弗，是佛陀的十大弟子之一，以智慧著称智慧第一。</b>《心经》是大般若经的精华部分，是舍利子问观世音菩萨，如何到彼岸的智慧，如何究竟解脱的智慧。有智慧的人才会问出来有智慧的问题。观自在菩萨开始，是阐述性的话语，这里开始是对话的模式。</p><p><b>观世音菩萨在对舍利子讲话，色不异空，空不异色，色即是空，空即是色，我们想把这两句话听懂。先听懂两个概念，一个概念叫色，一个概念叫空。</b></p><p><b><span>什么叫色呢？</span></b>从狭义的解释眼睛看到的叫色。从广义上来解释眼耳鼻舌身。看到的、听到的、闻到的、所接触到的、有形的、无形的都称为色。</p><p>这个世界上有我们很多看不到的东西，也有很多我们听不到的东西，但是不代表它不存在，看得到的看不到的，都称之为色。我们再往广义上来讲眼耳鼻舌身意，<b><span>意</span></b>，我们所思考出来的东西，我们所起的念头，也称为色。我们再往广义上讲。<b>五蕴色受想行识皆为色，</b>这里的识，包含了前六识、第七识“末那识”、第八识“阿赖耶识”，只要是我们被迷住的那部分自性，随着阿赖耶识开始轮转，我们所有产生的一切意识形态的也都称之为色。我们众生都是迷住的那个自性变现出来的，就是我们之前所举的例子（面粉），本来我们的自性，就相当于那个面粉，但是我们被迷住了，开始随着阿赖耶识轮转。变成了包子水饺面条。我们所有被迷住的，这些都称为色，所以说我们是被迷的。众生觉悟的时候就圆满成佛回归自性，所以我们的念头也是色。</p><p>所以我们再来讲一个词，<b><span>“一念一世界”</span></b>，这个世界是由我们的念头形成的，所有的色相，也是由我们的念头形成的。举个例子，今天发生了一件事情别人得罪到我了，这个时候，如果我一念是宽容的，这个事情，算了吧，他也是无意之失，他正在情绪当中，我不与他计较，这个时候它是一个世界，他发生的事情会不同；如果我当时的情绪也是暴躁的，我就产生了更激烈的行为，可能两个人，就开始了打架、斗殴，甚至产生更严重的后果，这是所产生的另外一件事情的发展，也就是另外一个世界。</p><p><b>所有的事情都是我们的念头形成的</b>，比如说，这个杯子也是由于我们的一面形成的。是我们从某个地方，从互联网也好，从我路过哪一个店铺也好，我看到了这个杯子，我喜欢上它，我着于这个色相，这个时候就会把它买回来，这个杯子就成为了我的杯子，所以它是由于我的念起而成为我的杯子。那有的人说了，如果这个杯子是别人送的呢，别人送的，也是我们的念头所产生的，别人送这个杯子，我们无论出于什么原因，把这个杯子留下了，这个念头起，这个杯子就成为我们的了。比如说，当下住的房子车子都是一样的，我们当下住的这个房子，是我们想要买这样一个房子念头起了，然后我们看到了这个房子，我们觉得条件都合适我们就购买了，这个时候房子就成为我们的了，从源头起都是一念所形成的。比如说，我们的身体也是四大假合而成，当我们由于因缘合合来到了这个<b>娑婆世界</b>，父精母血，本来我们是没有的，没有我们这个人的存在啊。只有一个阿赖耶识在随着业力轮转，有了父精母血，我们才产生了这样一个身体，后来经过母亲的十月怀胎，我们生出来了。我们出生了以后才有了这个身体叫四大假合，所以我们都听过一句话叫<b><span>四大皆空</span></b>。</p><p>这四大就指着<b><span>地水火风</span></b>。当我们身体临终的那一刻。四大就开始散去了，最先散的是风，我们没有了呼吸，这个人就不在了；接下来是火，我们没有了体温；接下来是水，身体的水分没有了肌肉开始萎缩；再接下来是地，我们的头发皮骨会随着时间的推移尘归尘土归土就开始消散了，所以他是空的。</p><p><b>本来他就是从空当中生出来的，最后还要归于空</b>。比如说，这个杯子本来它不叫杯子，本来它可能是一堆玻璃，经过因缘和合而成的杯子；比如说，有工人、有生产线、有玻璃、有胶水。那比如说，这个杯子，如果碎了呢？它因缘不合了，碎掉了，它就不叫杯子了，我们就管它叫玻璃，可能就扔掉了。如果有回收的呢，它又回到了什么都没有的状态，那可能它再做成物品的时候，有可能就变成了一个瓶子或者一个盘子。所以什么叫空啊，无自性，故空它是不长久的，它是随着因缘和合而变化的，所以叫空。再举例子说，我们面前有一本书，这本书也是空的，空的不是说它没有，不存在，是因为它不长久，无自性。这本书它的前身是没有书的。它只是纸张，再加上了印刷的技术，再加上了墨水，然后装订而成，因缘和合成了一本叫做书，那接下来如果这个书，损坏了，被烧掉了，或者被扔掉的时候，就把它当成垃圾了。它这个时候，就不叫做书。如果再被回收回去，它又打破了原来的状态。所以你看我们的人，轮回投胎亦是如此，都是<b><span>从空到有，又归于空</span></b>，这样一个过程。</p><p><b>我们再往大了讲，山河大地亦是如此。</b>山河大地亦属微尘，它也是有寿命的，包括我们讲地球也是有寿命的，沧海桑田也是会发生变化的，四季也是轮转的，所有的东西都不是永恒不变的，都会随着因缘的聚散而聚散，所以说一切皆空都是没有自性的都是不长久的。我们在讲回生活当中也是一样的，一个人的富有，他也不会一直富有，包括两个人的感情，他也不会一直感情如胶似漆。时好时坏，时而顺利，时而不顺。我们的身体也是一样的要承受着生老病死。从出生那一刻就意味着你要死亡的，这是万事万物发展的必然规律，所以才要明白无常的道理。所以告诉我们这一切都是空的，都不会久住。那我们又何须执着，所有的只不过是色相而已。如梦幻泡影，如露亦如电；所有的物质，所有的色相都是如梦幻泡影如露亦如电的，所以你看梦幻泡影露电是不是都是不长久的？所有的事情都是不长久的，都会发生变化的，都会从无到有，从有又归于无，所有的事情都是在发生变化的，所以佛家告诉我们这一切都是空的，你又何须去执着呢。</p><p>比如说海浪。有风的时候，它就形成了浪。风走了以后开始变得风平浪静，浪就不在了，那你说，浪到底是在还是不在呢？当有风的时候，在涨潮的时候浪就在。退潮了，风停了，浪就不在。所以说它是空的，它是不长久的，就好比我们的身体也是一样的，你说它不在吗？它在呀，它真真实实的在啊。可是呢，你要知道它也是因缘和合，从什么都没有开始，到现在实实在在的有这个身体，但是随着岁月的流失，我们将要老去，四大（风水火土）开始消散尘归尘土归土，它就不在了。包括一个杯子，一本书都是同样的道理。</p><p><b>那我们的身体都是假合而成的，何况伴着我们身体而来的那些东西，它也终究会消散的，包括我们那些想法，那些烦恼，那些痛苦它即将不复存在，所以一切都是空的。</b></p><p>了解了空性的智慧是减少我们的执着和痛苦，不要在梦幻泡影当中苦苦外寻、苦苦追求、苦苦的执着，而不得解脱，所以照见五蕴皆空的时候，就度了一切苦厄了。我们这只是明白了空性。即使我们的身体消散了，我们这一世结束了，我们下一次开始轮回的时候，我们的识还在。五蕴（色受想行识），我们身体没有了。<b><span>识</span></b>，还在随着我们的业力轮转。又来到了下一世，所以照见五蕴皆空，是所有的念头都没有了，识也没有了，就是我们被迷住的那个自性，叫阿赖耶识，就是我们成为面团儿的那个东西，它还在。只要它还在，还会随着业力不停的轮转，什么时候它也空掉了，就回归自性圆满成佛了，所以这个时候才是照见五蕴皆空。</p><p>让大家明白空性，我们还没有证到空性的时候，你也要看空，你对于当下的生活和整个生命的状态才能减少执着，痛苦和烦恼，所以了解了空性智慧把我们的眼界放长。你站在前世今生的视角在看当下是不是生命就变短了？人生就变短了，是因为你的眼界放长了。<b><span>在佛家叫解脱见。在道家叫高见。</span></b>当你站在高处再往下看的时候，你的事情就变小了，烦恼就变少了。我们的身体都是从空中而来，最后回到空中而去。<b><span>无所从来，亦无所去。</span></b>所以你看看烦恼，痛苦迷茫，不是一样的吗？我们生活当中的烦恼是因为<b>因缘生，因缘灭</b>。今天我的痛苦是因为他说了一句让我不高兴的话，是不是因缘生，随着这件事情过去，我的痛苦就消失不见了，只不过有的痛苦长有的痛苦短，最长的痛苦在我们的认知内，莫过于跟随我们一生，但是它终究会幻灭消散到空中去。所以我们越是懂得空性的智慧，你会发现人生哪有什么可执着的呢？所以我们老百姓总讲一句话，<b><span>人生在世，除了生死都是小事。</span></b>如果我们要听得懂心经。生死也是小事啊，本来就无声无死。</p><p>我们所谓的生死只不过换了一种形态而已。那这个时候我们再看，我们这一生还有什么放不下的，还有什么可执着的呢。<b>万般带不走，唯有业随身</b>，今生我们所追求的外在的所有的东西，都将幻灭，我们都是带不走的，你带不到下一世你带不到你的阿赖耶识。只有你的善业和恶业存在那里，决定了你下一世去哪里。那我们如果再往高一个境界善业恶业都没有。这个时候才能回归自性，圆满成佛。不着任何相。</p>"
    },
    {
        "title": "第七讲-空不异色",
        "html": "<p>我们了解了什么是色，我们又了解了为何叫空，这个时候告诉我们色不异空啊！色和空是一样的，没有区别呀，所以叫色不异空。只不过我们是执着于色中，执着于吃喝玩乐，执着于财色名食睡。当我们了解了它都是空的。都是不长久的，这个时候我们才能享受在当下呀，说我吃还是吃，可是这个时候我已经不执着于吃啦，我喝还是喝，可是这个时候我已经不执着于喝了，这个时候就不迷在其中。所以色不异空，色和空是一样的，是一体两态、一体两面。这就好比是道家讲的有无相生啊，色不异空，色和空是一样的，前后皆空，色只是中间的过程啊，所以说色唯一空。那接下来我们再上升一个境界叫空不异色，我们现在已然是有色了，我们色身已经来到这里了，那空不异色什么意思呢？我们色身已然存在，我们就从容应对，但不执着于色身。这个杯子因我们念头而生，它已然存在，我们就从容地去用这个杯子，而不执着于这个杯子。比如说我们很多学佛的朋友啊！一定要注意这里有一个误区，很多人执着于顽空，那个是假的。比如说我执着于放下，我听说了空。我执着于空，举例啊！说我感冒了，我身体是空的，四大假合不用吃药，我念佛就行了，不行的。因为你的身体已然存在了。我们不执着于这个身体，但是不代表，感冒了不吃药。所以不要落入这个<b><span>假的和顽空</span></b>。</p><p><b><span>怎么区分呢？</span></b></p><p>假的和顽空无法用，不能用。<b>而空是可以用的，它是有妙用的，所以空中妙有</b>。你先空的时候你才能有妙用。举例子，还是感冒。什么叫空中妙有呢？我知道身体是四大假合而成，我知道人要经历生老病死。那我当下生病了感冒了，我知道前后皆空。我为什么会感冒呢，往前推，昨天受风了，没盖好被子，穿的少了或者中暑了，才感冒。之前它是空的，那当下已然感冒了，那我就吃药啊，但是我并不痛苦，也不怨恨。感冒这么难受，感冒了怎么办，那我吃药就好了，它终究会过去归于空，就归于感冒之前的状态，前后是皆空的。</p><p><b><span>什么叫顽空</span></b>。有的人经历了生活的磨难，就开始抱怨。这都是我的业力，都是我上辈子没做好事，造了什么孽，今生才承受这样的负担，今生这么多的苦难，我就忍受吧，我忍受就是消业，我来世要有好的去处，这都叫顽空。</p><p><b><span>什么叫空呢</span></b>，空是有妙用的，我了解了因果。我当下经受的苦难，原来佛告诉我们，是由于我们过去的业力所导致的，那我知道了，这个事情我要懂得安住当下，努力的修行，自己去种善因自然就会得善果。告诉我们一切都是空的，那我当下的苦难也是空的，所谓的当下的苦难只不过是当下所显的一个相，在这之前是空的，在那之后也将归于空，所以我没有什么抱怨的，我不恨世界，也不抱怨自己，也不颓废，努力的去种因，安住在当下，这个有妙用，这个时候才是空，所以一定不要执着于求空。越求空越不空，落入那个顽空。人就很容易消极和抱怨。</p><p>为什么有的人会误解佛法？说佛法是消极的，告诉你一切都是空的，不用努力了，那是顽空，不是真空，当你懂得真空是懂得安于当下积极努力的去种因，这个时候才是真空，空中才能妙有，这个时候你是有妙用的。<b><span>色不异空，空不异色。</span></b>我们不执着于色。不执着于空，不落于色，也不落于空。就是这样一种感受和状态。执着于色，执着于空，就会落入顽空，所以告诉我们色和空都是一样的，空和色是没有区别的。</p><p><b>这个时候我们就上升了一个境界叫做空中妙有</b>。相当于是把我们的思维带出去，看一下再回来，<b><span>如来说世界非世界，是名世界</span></b>。异曲同工之妙，但是不完全是空不异色的意思。放在这里引用是为了大家更好的理解，如来说世界非世界，如来告诉我们这个世界不是你想象的世界，不是你肉眼所见到的这个世界。但是接下来重点又来了，如来说世界非世界，是名世界。又告诉你回归当下，你生活在这个世界上，你就要按照这个世界的规律和法则回到当下，但是这个时候你的眼界不同了。你已经不迷在其中了，你知道了这个世界原来不是我想象的我过去的肉身的这个认知的世界。当明白这个道理的时候还要再回到当下的是名世界。好比是，我们生活在这个村子里。我们出去看过世界，增长了很多见闻，这个时候我们再回到这个村子。你会发现境界是不是不一样了？虽然同样还在这个村子里面，可是你已经增加了很多的见闻，增长了很多的智慧，看到了世界的不同样子，这个时候你再回来安住当下的时候，你的境界眼界不同了，你就不迷在其中了。所以告诉我们，色不异空，空不异色。是我们懂得了这些道理，不落于色，落于色就不执着执迷于其中，但是也不能落于空，落于空，相当于是我们回到这个村子里生活，我们满脑子想的还是外面的世界，这个时候落入顽空，就会痛苦不堪，所以再回来是名世界。</p><p>从色，告诉你一切都是空的，所有的色都是从空中来，最后要回到空中去，这个时候我们要，空中妙有，活在当下的这个世界，但是不执着。我们知道了什么该做什么不该做。我们往哪个方向去修行？这个时候又回来了，色即是空，空即是色。又来告诉我们了，色即使空，色就是空，空即是色，这是一体两态。我们迷住的时候叫色，不迷住的时候就叫做空。比如说水，水也可以是一体两态。液态的时候叫做水，冻住了以后呢？它叫做冰。但是你能说冰不是水吗？它也是水，但是你能说冰就是水吗？它也不是水。迷住了叫冰，未迷叫水。所以这里也是一样的。迷住的时候叫阿赖耶识那个面团。不迷的时候叫自性，它是圆满的。色即是空，空即是色，也同样的道理。迷住的时候叫着于色相，不迷住的时候叫做空，但是呢，它本为一体两种不同的形态而已，所以告诉我们色即是空，空即是色是一样的。当我们没有迷住的时候，是那个自性是那个面粉就是空的。被迷住的时候就展现出来各种形态，包子水饺面条。就是被迷住了。那我们被迷住了，就会呈现各种色相，天人、阿修罗、人道、畜牲道、饿鬼道、地狱道，呈现出来不同的形态就是色。被迷住了产生了四大假合的身体。所以破迷开悟的过程就是回归自性的过程，当你不被迷住的时候，就是空。但是空之后我们还存活于红尘之中，我们还在娑婆世界。那么接下来就要上升一个境界叫空中妙有了。</p><p><b><span>一心三藏。不空如来藏，修的是色法。</span></b>举例，放生做善事积累功德，帮助他人。这都是修的，不空如来藏，见色，不见空。做了很多善事，让我们自己变得更好，这叫不空如来藏，修行的次第也是如此的。</p><p>刚开始修佛法的朋友们都要去修色法，说我要积德行善，要放生，多去帮助他人。你在不停的积累善业的时候，随着你的智慧的增长，你就进入了<b><span>第二个境界叫空如来藏</span></b>，这个时候你了解了，所有的事情都是空性的，都是无自性的，都是不长久的，这个时候我们就落在了一个空上。落在了空上，我们才能增长智慧。</p><p><b>佛家有一个词叫福慧双修</b>，<b>我们在修色法的时候不停的积累善业积累功德。修的是福。空性智慧修的是慧，所以叫福慧双修</b>。</p><p>我们既要修不空如来藏，去修色法行善是积功德，这是增福，又要修慧懂得空性的智慧，只有智慧才能让我们没有烦恼，减少痛苦。你说我做了很多善事，我去放生，可是我依然痛苦，那个是福不是慧，所以我们只有不停的去增长智慧，了解一切都是空性的，不可执着，一切都是从空到色，<b><span>色</span></b>，只是短暂的因缘和合，又回归于空，所以这个时候我们不再对世间的一切产生执着，你才能减少痛苦，这叫<b><span>慧</span></b>，所以福慧双修。这就到了第二层境界叫空如来藏。</p><p>佛家就是讲空性智慧的。其实呢，还不究竟？到了空性智慧的时候还有第三层境界，因为你到了空没法用啊，你空怎么能用呢？所以就到了第三层境界叫<b><span>空不空如来藏，亦是空中妙有</span></b>。因为空，你是没有办法用的，这个时候你进入了空不空的境界，这个时候你要入世的，空是没有办法做事情的，但是空中妙有的境界，你才可以去做事情。那我们去看一看佛，菩萨不是在普渡众生吗？是不是也在做事情，那如果都空掉了，就不要做事情了，做事情干嘛呢？这个时候是到了空不空的境界，是空中妙有的境界，所以才有倒驾慈航，千百万亿化身来度脱众生，自己是不迷在其中的，是空的。这个时候，空的状态才能产生妙有，返回来又开始度脱众生，所以别人看到的我们在做事情，说你也没有空，空了不就不做事情了蛮，只是看到了第二层，没有进入第三层的境界是空中妙有。比如说，我们去看看，历代的高僧大德，难道不在做事情吗？儒家的圣贤难道不再做事情吗？道家的人难道不在匡正天下之事吗？都在做事情，但是他已经到了空不空如来藏的境界。</p><p>比如说，我们都看过西游记，孙悟空有<span>72</span>般变化。孙悟空想要变成一头牛，原本这里有两头牛在这里吃草，这个时候孙悟空也变成了一头牛。悟空，他悟到了空性，才有了<span>72</span>般变化，佛菩萨为什么有千百万亿化身呢？因为是空的，才可以无限变化才有无限的化身？所以这个时候悟空变成了一头牛和这三头牛一起在这里吃草。那我们体会一下这个时候，孙悟空的境界和另外两头牛的境界是不是不一样的。它们两个是用牛眼看世界，而孙悟空是用空性的眼睛在看这个世界。所以看到的世界也是不一样的，这两头牛在吃草的时候，可能念头纷飞，胡思乱想，一会儿还要耕地的。不好好努力，要被卖掉的。我的牛生太痛苦了。但是这个时候的孙悟空是不是不一样了，它吃草的时候很享受。那既然我化成一头牛，我就好好的吃草，让我去耕地，这没体验过，很好非常好。所以这个时候就是空中妙有了。他不迷在牛的世界当中。这就是不空如来藏和空不空如来藏的区别。</p><p>所以觉悟的人，他也生活在这个红尘之中，也和我们一样在做事情，只不过他不再痛苦，不再迷茫，不再执着。在比如说，这个时候孙悟空从牛这里离开了，他又开始去变化了，他变成了一个凡人来到了这个世界。你会发现和刚才的案例一样，悟空和我们看到的世界是不一样的，他不会执着于当下的得失，不会执着于当下别人对自己的看法，不会执着于这些痛苦和烦恼当中，所以这个时候看似是一样的，实则境界已然不同。所以我们都说过一句话呀，以心去看这个世界，以佛眼去看这个世界，你看到的世界是不同的样子。</p>"
    },
    {
        "title": "第八讲-受想行识亦复如是",
        "html": "<p><span></span><b>受想行识亦复如是。色不异空，空不异色，色即是空，空即是色。把五蕴又分开来讲，所以说受想行识亦复如是。受想行识也是一样的，如果要展开来讲，就是受不异空，空不异受，受即是空，空即是受。想不异空，空不异想，想即是空，空即是想。行不异空，空不异行，行即是空，空即是行等等。</b></p><p>所以展开来就是这样来讲的。都是一样的呀。都是本然一体两态两种作用。为什么这里开始？色不异空，空不异色展开讲。受想行识不需要展开讲了呢？五蕴的受想行识都是因为见色而起。</p><p>讲五蕴皆空，因为取了色相，才有了受想行识。当空和色不起相，不执着的时候，自然也就没有了受想行识一切归于空。比如说，我们陪孩子玩捉迷藏。当你陪孩子玩捉迷藏的时候，你是不迷在其中的，你不会因为找不到孩子着急。甚至它就藏在那里，你还假装看不见。并说，“这孩子真会藏，藏哪去了，怎么找不到你呢？你要藏好了，我找了半天都没有找到你啊”！你看，你是不是就不迷的状态？然后你找了一会儿，突然找到了，你显得很高兴的样子，你是因为找到他，才高兴的吗？不是吧，是你陪着他玩，你看着他高兴，你才高兴的。这个时候你就是不迷的状态。再比如说，现在是网络时代，我们大家都听过一个词叫水军。有一群水军受雇于人，说你去黑某一个人，我们告诉你几个关键点几件事情，你们围绕着这个事情随意发挥随意喷就好了。那你看这个时候的水军。他有情绪吗？没有吧，雇我的，让我骂，我就骂。他是不带任何的感情色彩的，他是没有恨的。他只是受雇于人，来做这件事情，所以针对于这件事情来讲，这些水军是不迷在其中的。当然，这件事情是违背道德的，只是让大家明白这个道理。</p><p><b>何为迷，何为不迷</b>。再比如说，当你真正恨一个人的时候，你再骂他。你迷没迷在其中，迷了吧，你是有情绪的，你是愤怒的，你是真的恨他，你恨的咬牙切齿，你在骂他的时候痛苦的，却是你自己。而水军在骂他就不痛苦，这就是迷和不迷的区别。所以我们如果迷在一段感情当中的时候，就很痛苦；我们不迷在一段感情当中的时候，同样也在有着这段感情。可是我们不执着，我们懂得在没有这段感情之前，它是空的，终究它也会归于空。那所有的事情不是一样的吗？我当下正在经历了人生的苦难，我的生意失利了，赔钱了，本来这些钱在这之前就是空的呀，他是属于你的吗？你出生的时候自己扛着麻袋背着钱来了吗？没有吧，你什么都没穿呢，连衣服都是父母给的，那我们活到今天我们所有的东西都是众生给的。车子，众生的钱给买的，或者父母的钱或者朋友的钱那不都是众生的钱吗。你住的房子，你用的杯子，你现在的手机，你看看是不是都是众生给的？在你走的时候你能带着手机走吗？说“怕我下一世没有手机用，我带了一个去。不行，拿俩”。能走得了吗？带不走吧，所以终归还要归于空的。那只不过当下所呈现的一个相，说我现在贫困，失意了。那失意了以后，我们就活在当下，努力的奋斗，努力的种因就好了，这就是迷和不迷的区别。</p><p>再比如说，我是做企业的。今天公司当中发生了一些事情。我一看，这些人不努力工作，我再不发点脾气镇不住了。那这个时候开会。那发了脾气。那你会发现在这种状态下发脾气，自己真的生气吗？没有吧，它是一种手段和方法，这个时候你就不是迷在其中的。所以发完脾气该干嘛干嘛。但是迷在其中是什么样子呢，真的生气了，发完脾气了，员工没怎么着，自己气的直哆嗦，这就是迷在其中。</p><p>那你看看你的生活是不是如此。孩子写作业不听话，孩子没怎么着？把自己气够呛。在生活当中，发生一个小事情，自己迷住了，感情上发生一个小事情，自己迷住了。事业上发生一个小事情，自己迷住了，走到大街上，小狗冲我叫了两声，迷住了，这给我气的，不是它有毛我就去咬它去。所以你看这种状态就是你迷在其中的痛苦不堪。</p><p>了解何为迷何为不迷？我们才能减少生活当中的痛苦和迷茫，不要那么执着，前后皆空。<b>空不异色，色不异空，空即是色，色即是空</b>。终归要归于空的。<b>人生不满百，常怀千岁忧。</b>。所以淡然的从容的去面对，我们的人生不要事事都迷住，这个时候我们才能变得轻松自在，从容一点。当我们知道了一件事情的来龙去脉。是不是就不容易迷住？所以我们学心经就是了解来龙去脉。了解了空性又了解了一切色相都是假合而成，又懂得了空中妙有。在一件事情上，我们知道来龙去脉的时候。我们就不迷茫，不痛苦不困惑。那对于修行也是如此，我们了解了事情的来龙去脉。我们就减少执着，所以佛说众生的痛苦皆因无明，都是因为不明白啊！</p><p>我们在用一个字来总结。迷和不迷的区别是什么呢？在一个<b><span>觉</span></b>字！时刻保持独觉的状态才能淡然处事。觉是其中的妙用，当我们懂得时时刻刻有觉在，就不容易被迷，当一件事情发生了，我们及时的觉知到了，我们被迷的就少一点。比如说，我们现在正在发脾气了，可是发的脾气，我突然意识到了，不该发脾气，这个时候，觉知了，然后及时的收住了，就被迷的少一点。</p><p>照见“<b><span>照</span></b>”。<b>觉是过程，在这个事情的发生念头的发生的过程叫做觉，说我正要发脾气，或者已经发脾气了，但是我意识到了这个过程叫觉，结果叫照</b>。当我们保持觉的妙用在其中的时候就不容易迷。虽然我们不能一下修回自性，但是我们了解了整个八识的作用，就是减少在生活当中的迷和执着。<b>八识之间的关系</b>。比如说，我们在一个办公的场景，一共有八排座位。坐在第八排，更容易看见全貌。当你坐在第八排坐在最后一排的时候，你往前看。末那识，你的意识。身舌鼻耳眼这个时候，你坐在第八排，再往前看，是不是看的更清晰？看的更清楚，这个时候你才能保持觉。少取色相少执着。这个时候你自然就减少了痛苦，少迷在其中。所以我们要学会这样的方法去站在第八识往前看，这个时候我们就能觉察到自己的眼耳鼻舌身意的变化。我们情绪起了，我们就知道，当我们因为一件事情开始产生迷惑了，我们及时的保持觉知，就减少痛苦。我们听到一个不好的声音，要开始产生痛苦了，我们就保持觉知，我们看到一个我们不喜欢的人，要产生情绪了，我们就保持觉知，当我们知道，一个我们不喜欢的味道，刚要发脾气的时候，我们保持觉知，在生活当中，反复的练习，反复的应用，这个时候就会减少我们的迷，减少我们的痛苦。</p><p>所以举这样一个例子是为了让大家在生活当中更好地去应用和修行实践。如果从心经的角度是要五蕴皆空的，但是我们绝大多数人都做不到，所以讲了这样一个方法，我们自己去减少我们的迷，减少我们的执着时刻保持觉在其中。</p><p>朋友们，课程录制现场问答环节到了：这是谁跟谁的对话呀？观世音菩萨和智慧第一的舍利弗他们两个之间的对话，所以他这么简短就行了。况且那个时候的人都能听得懂。那我们现在再举例子，这个杯子，或者我们举例子面粉、水饺、包子。再过一千年以后呢？比如说过了一千年以后，人们研究这段话，包子是个什么东西？因为那个时候他们可能没有包子呢，他们就研究查呀，在二零二零年那个时候包子是有馅儿、有皮儿和成的，是不是他们就得反复的去找，那个时候的杯子是什么意思？什么叫杯子？那个时候可能人家叫盆儿了，所以他就会研究这杯子是什么。其实在这个时候是很好懂的，同样在那个时代，他们之间的对话很好懂的，只不过隔得久远，我们现在觉得他难懂。你想一想当时他在讲法的现场，能不能讲的话大家都听不懂。不会吧？所以他讲法一定是与会大众，起码绝大多数人都能听得懂，所以他讲的是那个法。是因为我们离那个东西太远了，离那个智慧太远了，为什么越往后是越难修行？欲望越来越重，欲望越来越多，诱惑越来越大，所以听不懂了。不是人家的东西难。你像那个时候，比如说咱们学论语，那你说子路来问如何侍君？孔子告诉他了，勿欺瞒，不要欺瞒他，而犯之。勿欺之而犯之。你不要欺瞒他，但是你可以直言相劝，是不是很简单一句话，他能不能说：子路问完之后，孔子说了半天，子路没听懂，没了。不会吧？那不是对话，那也不更不是智者的对话。所以那个时候论语之间的对话就是孔子和弟子之间的日常聊天，就像我们现在聊天是一样的，它一定是大家都能听得懂的。</p>"
    },
    {
        "title": "第九讲-是诸法空相",
        "html": "<p><b><span>舍利子，是诸法空相，不生不灭，不垢不净，不增不减。</span>诸法空相，到了心经的中心思想</b>。从开篇开始讲。有一位观自在的菩萨，行深般若波罗蜜多时到了一定的深度和境界，照见了五蕴皆空，度一切苦厄。再给我们讲方法。再讲到彼岸的智慧和方法。当照见五蕴皆空的时候，就度尽了一切苦厄。又告诉我们一个方法和一种智慧。色不异空，空不异色没有区别，又告诉我们色即是空，空即是色，是一体两态。迷的时候叫色，不迷的时候叫空。给我们讲了五蕴的智慧，讲了色受想行识，亦复如是。它都是空的，但是呢，空中又有色，色中又有空，一体两态。那些都属于法，方法。出世间的方法。智慧都是法的范畴。这个时候又开始给我们破法相了，所以接下来又说舍利子诸法空相。</p><p><b><span>什么叫“诸”</span></b>。<b>所有的，很多很多，无量无边的叫诸，很多的意思</b>。</p><p><b><span>什么叫法呀？</span>分为世间法和出世间的法。</b>比如说<b>世间的法</b>，我们学会了做饭，学会了如何吃饭，学会了很多工作的技能，生活的技能等等，让我们生活更好的方法都称为世间的法。<b>出世间的法</b>。我们要增长到彼岸的智慧。我们知道了，照见五蕴皆空就能度一切苦厄，照见五蕴皆空的五蕴、六根、六尘、六识；学习佛法，孔子的思想儒家文化，老子道家文化都是法。所以告诉我们诸法空相。所有的法都是空的。都是方便法。都是为了让我们到达彼岸的出世间法都是空的。世间法也是一样的，我们学习了这么多生存的技能和生存的方法都只是为了让我们在这个地方生活的更好而已，它都是因缘生因缘灭，都是因为事情而生的法。</p><p>我们现在很多人学会了包包子，这也是法。那怎么出来的包包子呢？在远古时代不需要会包包子，因为也没有包子，甚至没有面粉。那后期是因为有了小麦，有了面粉，人们一代代的发展和变化，会包包子。你看是不是因缘而生的，是因为事情而生的法。</p><p>那我们学儒释道的文化同样如此。我们在哪一个阶段需要去做什么样的事情，需要提升自己的某一方面，这个时候去找到了相应的法，所以都是因缘而生，当我们学会了这个法，以后要懂得把法放下的。</p><p>我们吃饭的时候，用的是会吃饭这个方法；那我们在工作的时候，需要用的是工作的技能；我们需要开车的时候，需要的是开车的技能。可是我们开完车，要懂得把方法放下，我们吃完饭，要懂得把筷子这个方法放下，我们工作了以后要懂得把工作的，这个方法放下，而用的时候它自然就出来了。所以这个时候告诉我们诸法空相，是告诉我们所有的法亦是空的，不要执着于任何的方法，当我们执着任何的方法的时候，就会产生法执，依然会痛苦。</p><p>比如说，我们吃饭这件事情是为了吃饱，我们干嘛要执着方法呢？举个例子，我们只有吃馒头才能吃饱吗？吃米饭、吃面条、吃包子、吃面包也都可以吃饱。那我们这件事情的彼岸就是吃饱，用什么方法吃，吃什么东西，又有什么区别呢？当我们懂得这个道理的时候，你才不生执着，才不痛苦，否则就会不停的执着，妄想和颠倒，我只能吃米饭，我只爱吃水饺，我只能吃馒头，你会发现这个时候你就是不懂得空的，你就开始痛苦。</p><p>修行是不是也一样的？可有人说了。佛法才究竟，别的法都是外道。金刚经告诉我们修一切善法即是佛法，你只执着于佛法才能让你觉悟吗？佛法也是空的。有的人说了，我只学习儒家文化，其他的形而上的我不学，那个都是不对的，都是迷信色彩。那是你认为的，难道只有学习儒家文化才能让我们觉悟吗？所以发现当我们那件事情的止很明确的时候，你就会想无尽的方法去解决它，切莫执着于法，你把法空掉的时候会发现，你会生无量法。</p><p>你只有把法空掉？你才能生无量法你执着于某一法，你就不会生出来更多的法。比如说，做饭是不是一样，很多人做饭，我就会煮方面。我就会炒西红柿鸡蛋。（对，你就会。）你不会去做更多的东西，因为你破不掉你只会西红柿炒蛋这个法，你要把这个法忘掉你会发现你可以会做那么多东西。<b><span>一个人的止很明确，我就要做，这就很厉害了。</span></b></p><p>做任何事情都是一样的，当你的止很明确，我就要把这件事情做好，你把你当下的法破掉，你才可以生无量法，如果你当下的法不能破掉，你生不出来更多的法。所以，为什么很多人一辈子就会做那点事情，出不来他的思维框架，就是破不了自己的法执。只按照自己的那个方法去做事情。现在很多人跟不上时代的发展了。开始抱怨。要回去过去那个时代多好，你说我们那个时候，人们多努力，你会发现就是他执着于他过去的那个法</p><p><b>法是怎么来的？意对着法。眼耳鼻舌身意对色声香味触法。</b></p><p><b>法是什么？是你的意识所得出来的认知的那个结果叫法</b>。</p><p>你的意识得出来的那个东西叫做法，所以它停留在过去的那个认知当中出不来了。所以产生痛苦开始抱怨了。时代是回不去的，时代是在发展的，社会是在进步的，天道是唯新的，它是往前走的。所以这个时候如果你的法不能破掉，你还在执着于过去的法，你就跟不上，你就开始产生痛苦，所以要懂得把自己的那个法破掉，你才可以生无量的法。</p><p>就好比，我们自己不是一样的吗？让讲什么法，我们就讲什么法，跟随我们一起修行的朋友是什么样的根气，我们就尽量讲他们能听懂的法。这个时候你不局限于任何法，这个时候你才能生出无量法，所以这个是很重要的。那你们在做事情的过程当中切记如此，当你这个法行不通的时候，你要换法的，说我这样做，不行，结果不好。那你就要懂得换法，你要把你自己那个法再破掉，你才能生出更多的法。你会发现这个时候，人的思维是进步的，你的认知是前行的，你才可以生出更多的法。所以其实生活当中的法执会让我们痛苦。工作当中的法执是让我们无法前进，修行当中的法执让我们难以解脱。所以任何一个法都可以到达彼岸的，不拘泥任何一个法，所以告诉我们是诸法空相所有的法最后皆归空。</p>"
    },
    {
        "title": "第十讲-是诸法空相",
        "html": "<p>所以人就是因为不懂的诸法也是空的，所以才不停的执着、妄想和颠倒，让我们深深地迷在其中，无法自拔。就是不了解一切都是空的，包括心经讲给我们的五蕴也是方法也是要归于空的，我们讲一切法都是<b><span>渡海之舟筏</span></b>，我们是为了到达彼岸去，中间用什么去，怎么会那么重要呢。可是往往我们把它沦为望月之手指，我们手指指月是为了看向月亮的，可是呢。我们产生法执的时候忘了看月亮，而盯着手指不停的看。所以产生这种执着，生了法执很难觉悟的。</p><p>比如说，我们从北京出发，要去上海。到达上海那个彼岸是不是有很多方法？我们这个时代有飞机，火车，汽车，也可以骑行，也可以走路去。这个时候有的人说了，坐飞机多快！那是你觉得坐飞机快，可能他没有那么多钱坐不了飞机；还有可能他恐高坐飞机就不舒服，所以他由于种种原因不能坐飞机！这个时候有的朋友又说了，你坐火车，又经济又实惠，可是有的人又说了，我没有那么多的时间去做火车。你可以坐动车，价格也适中，还快。动车对我来讲也贵，坐不起。那我可能只能坐火车前往。那有的人说了，我心诚，我不着急走的那么快，我要步行去上海。</p><p>所以你看在讲什么呢？是不是所有的法都可以到达彼岸？并且因人而异，每个人当下的状态不同，你的条件不同，慧根不同，所以你选择的方法自然就不同了。但是呢，所有的方法都是空的，都是了无自性的，不要执着于任何一种方法。</p><p>修成，成就的法门也是多种多样的无量无边的。比如说《楞严经》里所讲的<span>25</span>圆通法门，每位菩萨觉者，所修的法门都不相同。我们熟知的观世音菩萨，修的是耳根圆通法门。<b><span>25</span></b><b><span>圆通法门眼耳鼻舌身意六根。色声香味触法六尘。眼识耳识鼻识舍识身识意识这六识，称为十八界</span></b>。<b><span>再加上七大。地水火风空见识</span></b>一共<span>25</span>圆通法门。通过这<span>25</span>圆通都可以修到觉者，修到菩萨，都可以有所成就。<b>观世音菩萨耳根圆通得以成就。虚空藏菩萨空大圆通得以成就。观到虚空无量无边大证到了空性智慧得以成就。心经里所讲的舍利佛眼识圆通得以成就。金刚经里所讲的须菩提意根圆通得以成就。弥勒菩萨识大圆通得以成就</b>。一切法唯心识所现。通过识大得以成就。普贤菩萨通过耳识圆通得以成就。楞严经也在给我们表法。讲了<span>25</span>圆通法门。通过不同的方法。都可以得以成就，菩萨的果位是一样的，菩萨的圣号却不同。代表着他所修行的方法和某一法门，但是都可以达到菩萨的那个果位，所以告诉我们出世间法到达彼岸的智慧也是无量无边的。那楞严经里也只是列举了<span>25</span>个法门，还有无量无边的法门数不胜数。就好比是吃饭，我们只学习了几种方法，但是其实吃饭的方法也是无量无边的。那我们工作也只是学习了需要的那个工作技能就可以了，工作的方法也是无量无边的。但是最后所有的法都要归于空，所以诸法空相，所有的法，无量无边的法，最后都是空的，都是因缘生因缘灭，所以不要执着于法。当我们执着于法的时候就会产生了我执和法执，只认为我认为的，我听说的，我知道的那个方法才是正确的，其他人都是错的。这个时候很容易，又开始着相，开始产生痛苦。</p><p>比如说，修六度佛家讲六度具足万行，<b><span>布施、持戒、精进、忍辱、禅定、般若</span></b>从六度的任何一门也可以得以成就，有的人说我就修布施我不停地舍；有人说我就修持戒，我不停的持戒；有的人说我就不停的修忍辱；也有人说就不停的修精进，都是可以得成就。</p><p>所以佛法也有一句话叫<b><span>“闻贵多行贵简</span></b>”一门深入同样可以成就。这就好比是我们生活在这个红尘之中，娑婆世界，我们想要过上更富足的生活，我们多赚点钱，难道只有一种方法才能赚钱吗？是不是每个人赚钱的方法都不一样啊？因为每个人所处的境界不同，身份不同，地位不同，所擅长的不同，所以只要能满足自己的生活所需。用什么方法有那么重要吗？所以你要做的是达到你的目的，赚到钱那件事情，而不是必须执着于用什么方法去赚到钱，所以我们修到彼岸的智慧，亦是如此。所以不要去执着任何一种法，执着就会产生痛苦。</p><p>有很多学佛的朋友特别容易走入这个误区，我开始学了一点佛法以后，别人讲的都不对，只有我学的才是对的，只有佛法才是好的；学禅宗的只有禅宗的法才对，其他的都不对；学净土法门只有净土才是对的，其他的都不对。都开始落入了法执。</p><p><b><span>“相”，什么叫相呢？</span></b></p><p>我们常说的<b>色相。法相。人相，我相，众生相，寿者相</b>都是相。我们那个见解、认知所得出来的那个结果叫相。<b>金刚经讲“我相、人相、众生相、寿者相”这个相又叫见（我见、人见、众生见、寿者见）</b>。这个见解所得出来的，叫做相。也就是我们认知的那个结果，所得出来的那个结论称之为相。</p><p>比如说，我们看到一朵花。感叹这朵花真美，这个叫相。我去到一个地方，这个地方真破，这个叫相。我看到一个人长的真好看，这叫相。我又看到一个人这个人真讨厌，这也叫相。为什么呢？那是你的见解所得出来的结论。你觉得这个人好看的时候，可能有的人觉得不好看；你觉得这个人真讨厌，可能有的人正好就喜欢这个人，你觉得很破的地方那是你对比所得出来的破。如果再更破的地方待过的人，到这个地方，他会觉得很好了。所以我们所得出来的那个见解都成为相。</p><p>我们的身体也是色相，也是因缘和合而生的。比如说，我们坐在这里有的人我们觉得很帅，有的人觉得我们长得很难看，有的人觉得我们很白，有的人觉得我们很黑，哪来的呢？对比来的。他比你还黑的人觉得你白，他比你白的人觉得你黑。那你就坐在这里讲话，有的人觉得你讲话太慢了，有的人觉得挺快的。因为大家的认知不同，所得出来的结论不同，所以这些都是相。为什么呢？空相啊，最后它都是空的，都是从你的认知里来的，所以认知里的是什么呀？是法。你认为她好看，那是你的法，你认为它不好吃，那也是你的法，诸法都是空的，你所得出来的相也是空的。所以我们讲色相是空，法相是空。</p><p><b><span>什么叫我相？</span>执着于我的认知而产生的傲慢。</b>比如说，只有我认为的才是对的。我的发型才是最帅的，我选择的衣服才是最有眼光的，我才是最聪明的，我的口才才好，我是很有能力的时候，你会发现我执重的时候就会产生傲慢心，瞧不起其他人，其他事情都不如我。还有觉得一切都是我的，你是我的，衣服是我的，房子是我的，工作是我的，朋友是我的，闺密是我的，我执越重越痛苦。当无常到来的时候就开始痛苦了。他不跟我好了。他不爱我了，老板不器重我了，我的财富变少了，我喜欢的衣服坏了，我的自尊心受到伤害了，那都是我相。所以我执重的人非常痛苦。</p>"
    },
    {
        "title": "第十一讲-不生不灭",
        "html": "<p><b><span>人相，分别心</span></b>。区别于我相之外的叫做人相。比如说，他那么低级，我怎么会理他呢。他长的那么丑，我不跟他玩。他那个智慧，我怎么会和他一般计较。既有我相又有人相。看向自己的时候叫我相，我比他聪明，这个时候是我相，他不如我，这个时候变成了人相。我比他有智慧，既有我相又有人相。<b><span>对内的时候是我相，对外的时候是人相</span></b>，所以这个时候就很容易产生区别对立，认为别人不如我有智慧，别人不如我长的好看，别人不如我懂得多，这个时候就有区别了，有分别心。故而痛苦。</p><p>我们生活当中的很多痛苦就是源于分别心，不光对人的分别，对物的分别也是一样的。比如说，我只喝红茶，绿茶不好喝。我只吃馒头，米饭不好吃，我只吃水饺，包子不行。我只吃肉，不吃素菜，我只吃黄瓜，不吃西红柿。所以你会发现分别就会产生痛苦，因为你喜欢红茶的时候不一定时时都能喝的到红茶。当出现绿茶的时候，你就不高兴了。我只吃馒头，不能吃米饭，当没有馒头的时候，你就不高兴了。</p><p>所以我们怎么能做到随遇而安呢？我们怎么能做到物来则应呢？破除我相和人相很难。但是呢，我们也要一点一点的去破除，当我们的分别少一点，我执少一点，我们的痛苦自然就减少一分。所以我们从生活当中不断的去修行减少分别心，减少对人的分别，减少对食物的分别，减少对事情的分别，这个时候我们才能坦然、淡定、从容地看着身边的一切。所以我们去看看，我们身边的那些智者和谦和的人，是不是很随意，“<b>喝什么啊，什么都行，今天中午吃点什么好，吃什么都可以啊，我们到哪里去玩啊，都可以呀，大家去哪里高兴我们就去哪里”</b>。这个时候你会发现智者的行为通常都是这样的。因为他自己是没有过多的欲望和分别的所以随顺大家就可以了，我们在生活当中减少一点执着，减少一点分别，减少一点我相，减少一点人相，这个时候我们的痛苦自然也就随之而减少。</p><p><b><span>当破了我相和人相的时候，就进入了<u>众生相的阶段</u></span></b>。说我对人和我没有那么多的分别心没有那么多的执着了，这个时候还有众生相。比如说，我还会觉得佛菩萨高高在上。我还会觉得猪和狗是不如我聪明的。这都是众生相。这个时候很多朋友又说了，你这样讲不合适，你上比佛菩萨中间拿我们自己比，下面又说猪狗，大不敬啊，这就是众生相。佛说众生是平等的。那个自性都是圆融的，人人皆具佛性，我们原本都是那个佛都是自性圆满的。猪和狗亦是如此。只不过我们当下被迷住了，畜牲道的也是被迷住了，而佛菩萨觉悟了而已，所以这个就是众生相。当我们都能真正的明白众生平等的时候，这个时候你才能破掉众生相。</p><p><b><span>寿者相。</span>一层一层的在扩大。我相是执着于我，人相是执着于我和其他人，众生相是执着于所有的众生。</b><b><span>什么叫寿者呀？</span>所有有生有灭的都成为寿者。</b>山河大地也是有寿命的，沧海桑田也会发生变化。包括我们说的地球也是有寿命的。所以告诉我们破寿者相。所有的一切本来皆是空的。我是空的，人是空的，众生是空的，寿者是空的，这里讲的寿者包含了天地万物都是有寿命的，都是有生灭的。所以无我相、无人相、无众生相、无寿者相，本体都是空的。</p><p><b><span>是诸法空相，不生不灭，不垢不净，不增不减。</span></b>举了六个相，生灭垢净增减这六个相，因为这六个相是我们在生活当中最容易着的相。生灭，我们总是认为任何事情有生有灭。包括我们人来到这个世间，从出生开始，我们兴高采烈到一个人灭亡，一个人去世的时候，我们痛苦流泪，我们认为它是有生有灭的，故而才痛苦。可是佛法告诉我们，它是没有生灭的，不生不灭，我们人来到这个世间只是有了肉身，这样一种形态而以，当我们去世以后，并不意味着我们所认知的死亡，它只是换了一种形态，又去其他的地方轮回了，它随着阿赖耶识的业力，所流转又换成了一种形态去轮回而已，所以它是没有生命的。</p><p>比如我们讲，沧海桑田的变化，亦是如此，它随着因缘合合的产生，大海可能变成高山，高山可能变成河流，河流又可能变成高山，陆地也可能变成海洋，它只是沧海桑田的变化，实则它本性是空的，无声无灭。我们不空的是，原本的那个自性，除了自性以外，所演化出来的所有的形态都是空的，不生不灭。</p><p>比如说，孙悟空会<span>72</span>变，我们假设它的本体，我们只能用假设这是方便说是为了我们大家理解的说假设它的本体是孙悟空，这个人或者说这个猴子他会<span>72</span>般变化。这个时候注意啊，它变成了一头牛。那他的本体变没变，本体是不是还是那个猴子它又变成了一条狗？他又变成了众多的猴子猴孙。注意啊，那他本体有生灭吗？是不没有啊，他是不生不灭的。不增不减呢，比如说她化身变成了<span>100</span>只猴子，他的本性有增减吗？没有吧，还是那只猴子，它千变万化，变化出那么多猴子变化出来了牛，变化出来了房子变化出来了小狗而已，他的本性还是不生不灭不增不减的。我们自己的那个自性亦如此。所有事物的空性的那个本体亦如此。他都是不生不灭的，所以孙悟空那个性没有变。那我们也是一样的，我们那个本性那个自性并没有变，只不过被迷住的时候，随着业力不停地轮回展现出来，不同的形态而已，但是实则那个本性不生不灭，不垢不净。不增不减。</p><p><b><span>不垢不净。</span></b>水晶球上面布满了灰尘。无法显露，我们本来的光明和自性。这个时候我们不停的去修正，不停的去擦拭，让它露出来，本来的光明。这个时候是不是已经有了垢净之分了？所以六祖坛经之中所讲，神秀大师所作的四句偈，<b><span>身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。</span></b>写完这个偈子之后，五祖看到了这个偈子就明白了，神秀大师并未彻底觉悟啊！为什么呢？时时勤拂拭，勿使惹尘埃，还落在了垢净之上，落在了垢净就还是落在了有之上。所以这个时候六组慧能大师有说<b><span>“菩提本无树，明镜亦非台，本来无一物，何处惹尘埃”。</span></b>本来无一物，何处惹尘埃，本来它就是空的，哪有尘埃呢？这个时候你看不垢不净，说的是究竟法门。所以五祖把衣钵传给了六祖慧能大师！所以神秀大师还落在垢净就是落在了有子之上。</p><p>无神秀不慧能，因为我们很多人不是顿悟的根气，所以时时勤拂拭，勿使惹尘埃，就是这里的，还有垢和净，但是究竟法门是，本来无一物何处惹尘埃，没有垢净，这个时候是落在空上的。所以六祖坛经之中也会讲，当神秀大师说了，时时勤拂拭，勿使惹尘埃，五祖说了一句话，让众师弟，按照神秀所说的去修行，不堕恶趣。就是你时时勤拂拭勿使惹尘埃，你虽然落在有字上，你修的是色法，但是不堕恶趣。却把衣钵传给了六祖慧能大师。因为悟到了不生不灭，不垢不净！不增不减，没有任何的增和减，它本来就是空的，哪来的增和减呢？刚才举例说，孙悟空，它千变万化变化出很多小的猴子变化成牛，它自己的这个本性，它依然是不增不减的，本然就是空的，又何来生灭垢净增减呢？</p><p><b>所以这里只是给我们举了六个相。告诉我们生灭垢净增减，如果我们不断地延伸，可以举很多例子。比如说，是诸法空相不黑不白不高不矮不胖不瘦不丑不美不善不恶。</b></p><p>生活当中的诸法空相好理解。比如说，我们现在要准备吃午饭了。这个时候做饭的人是不是开始要考虑做什么？吃饭的人是不是要考虑吃什么？我想吃什么，我喜欢吃什么？比如说，你不怎么饿了，有人问你，你想吃什么，你是不是说“什么都不想吃，吃什么都一样，吃饱就行了”，你看这是吃饱的人讲的话。没吃饱的人，是不是就执着。可是你还没有吃饱之前，你还是在执着。</p><p>所以我们听听那些觉者讲的话，<b>本来无一物，何处惹尘埃</b>。观世音菩萨，所告诉给我们的，<b>诸法空相，不生不灭不垢净不增不减</b>，何必执着。我们听听佛陀所讲的话，<b>无我相无人相无众生相无寿者相若见诸相非相则见如来。</b>所以我们听听，吃饱的人所讲的话。不要听你自己的那个我执和法执，因为你还没吃饱，你还没有到达彼岸，所以听觉者讲话听智者讲话听佛菩萨所讲的话，听圣贤告诉给我们那些道理，因为人家是到达彼岸又回来度化，我们的人。所以不要执着你当下的想法，因为你在执着于当下的那个法，所以才有了我执和法执。</p>"
    },
    {
        "title": "第十二讲-是故空中无色",
        "html": "<p><b><span>是故空中无色。无受想行识。</span>空中无色告诉我们空中本来是没有色受想行识。</b>刚开始告诉我们空不异色，色不异空又告诉我们空即是色，色即是空，这里又开始告诉我们。空中无色。这是讲的三个阶段和三个境界讲给不同阶段，不同境界的人所听的。</p><p>开篇告诉我们照见五蕴皆空，度一切苦厄。告诉我们五蕴原本都是空的。为什么要告诉我们照见五蕴皆空，这是讲给我们这些迷在色当中的人。给你讲空，说五蕴是皆空的，是针对我们迷途的众生所讲<b>。没有迷之前叫自性是如来藏，被迷之后叫阿赖耶识</b>，然后我们开始有了第七识“末那识”开始随着我们这个报身，我们有了四大假合的身体，开始有了眼耳鼻舌身意，因为这个时候已经是着于色相。故而告诉我们照见五蕴皆空，回归本性的时候度一切苦厄。告诉我们色不异空，空不异色，色和空本然是一体的没有区别。</p><p>接下来第二个境界又开始告诉我们色即是空，空即是色，空色本来就是一体两态。被迷住的时候叫做色，不迷的时候叫做空，但是本然一体又告诉我们空和色是一样的。再往后告诉我们，诸法空相，五蕴也是方便法。告诉我们照见五蕴皆空是让我们通过五蕴，日常最常用到的色受想行识把这个给空掉，所以告诉我们诸法空相。</p><p>了解了诸法空相之后，接下来告诉我们不生不灭，不垢不净，不增不减，因为它回归自性的状态，回归如来藏的状态，它本然就是空的，故而不生不灭，不垢不净，不增不减。是故空中无色，无受想行识，因为不迷的状态，它本然就是空的，那个空中自然就是无色的。<b><span>五蕴是因为心取了色相，而起的，感受，想法，心行，识。</span></b>当我们不取色相的时候，无色自然也就无受想行识，所以一切本然空的状态。</p><p>这里讲了三层境界，<b><span>第一层境界，就是色</span></b>，在色相里面。我们最初级的时候，是迷于色相的，我们整个人一出生就已经是迷在色相之中，所以第一层的境界，告诉我们，色不异空，空不异色。色和空是没有区别的。</p><p>当我们到了第二层境界，了解了色原本是空的，让我们了解了空性的智慧以后，又告诉我们第二层境界，色即是空，空即是色，它本然一体两态，当我们懂得，色和空，本然是一体不同的两种形态，<b>迷的时候称为色，不迷的时候称为空。</b></p><p>我们了解了这层空性智慧以后，又上了第三层境界告诉我们，诸法也是空相的。告诉你们的<b><span>五蕴，色即是空，色不异空</span></b>都是方便法，这些法也是空的。当把这些法也空掉的时候就来到了第三层境界，也就是我们最原始的状态，自性它本然就是圆满的，本然就是空的，什么都没有。</p><p>我们来延伸，诸法空相。接下来，不生不灭，不垢不净，不增不减，是故空中无色，无受想行识。我们再延伸一层好理解，<b>是故空中无法。连法也没有</b>，因为本然就是空的，何来法呢？是我们投胎到人世间着了色相才生了万法。告诉我们<b>五蕴皆空是方便法</b>。可是我们在不迷之前在自性的那个状态本然它就是空的。又何来的法呢？所以空中连法也没有，所以佛说本没有佛法可讲。所讲出来的一切法都只是方便法，讲给迷途中的众生所听。可是你回到原本自性的状态本然就是空的，什么都没有，无眼耳鼻舌身意，无色声香味触法。无眼界，乃至无意识界。整个这一段合起来称为<span>18</span>界。每一法都是一届。所以一共有<span>18</span>种法成为十八届，。</p><p><b><span>什么叫法呢？</span></b></p><p>比如说，我们的眼、身、舌、鼻都是法。这称为六根六根对应着外面物理世界叫做六尘（<b>色声香味触法）。</b>我们讲的眼耳鼻舌身意用医学的角度来讲，这是生理的功能，比如说，<b>眼睛、身体、鼻子、舌头、耳朵、意就是脑，能思考的大脑，这是生理。对应的外在的六尘就是物理世界这是<span>12</span>种法</b>。当我们的六根和外面的六尘产生作用的那个功能。识别的那个系统叫做识？眼识鼻识耳识舌识意识身识一共<span>18</span>个法，所以又称为十八届。</p><p>这一段告诉我们无眼耳鼻舌身意，无色声香味触法无眼界，乃至无意识界。从眼界开始一直到意识界，都是没有的，所以我们回头再来看这句话，本然是在自性圆满的那个状态，本然是在如来藏的那个状态，又哪有色声香味触法，连五蕴都没有。十八届，自然也就没有。比如说我们的眼睛，是不是随着我们的报身而来，我们大脑能思维的那个意识是不是也随着我们的报身而来？如果连身体都没有，这些是不是自然就没有的？比如说外界的六尘也是一样的，我们如果没有来到这个世界上，怎么能感受到这个世界的冷暖？怎么知道这个杯子好看还是不好看，所以它都是不存在的。</p><p><b><span>何为六根呢？</span>眼耳鼻舌身意被称为六根</b>。</p><p>根就是根本的那个东西。可以生长的那个东西。比如树有树根。树是因为有了树根才能生长，那我们的六根也是用来摄取和生长万物的。我们把眼睛想成一个摄像头。眼耳鼻舌身意都是如此，它是摄取外界的物理的工具。比如说眼睛，我们才能看到这个世界上的人，事和物；有耳朵，我们才能听到这个世界的声音；有身体我们才能触碰到这个世界的冷，热，硬或者软；有鼻子，我们才能闻到这个物理世界的气息，味道；有舌头，我们才能尝到酸甜苦辣。所以六根是摄取的工具。也叫六入。</p><p><b><span>为什么叫六入？</span></b>六尘对应着色声香味触法，我们眼睛看到才会取色，耳朵听到才会取声，鼻子闻才会取香，舌头尝到才会去味，身体碰到才会起触，意识有思维才会取法。所以六入是对应着六尘的。</p><p>我们眼睛看到了这个杯子。我们只是看到了这个杯子，这个时候我们还不知道它叫杯子，什么时候会知道它叫杯子，这个时候发生作用的是眼识。所以又叫六识。我们看到了这个杯子杯子是尘，是外在物理世界的一个东西叫做尘。当我们的眼根看到外面物理世界的这个色相这个杯子，这个时候我们是不知道它叫杯子的。什么时候知道呢？这个时候旁边有一个人告诉你这个叫做杯子，它是白色的，这个时候我们的眼识开始发挥作用，它是杯子，它是白色的。下次我们再看到相同的类似的物品，我们就知道了，它是白色的，它叫做杯子。这个时候那个识，是让我们分别它叫什么样的物品。</p><p>比如说，刚出生的小孩子是不知道它叫做花的。这个时候有人告诉这个叫玫瑰花，这个叫百合花，这个叫牡丹花，然后你会告诉他颜色这个是红色，这个是蓝色这个是白色。这个时候他开始摄取了外界的信息。摄取的这个功能叫做识。<b>有眼识、耳识、鼻识、舌识、身识还有意识，我们前五识只是起到了摄取识别的功能。这个时候意识开始产生。</b>比如说我喜欢红色的花，我讨厌白色的花，她喜欢蓝色的，不喜欢红色的，这个时候意识开始产生分别。我喜欢听他赞美的声音，我讨厌他辱骂我的声音，我喜欢听音乐，我不喜欢听狗的叫声，这个时候意识开始产生分别。这个时候我们的眼识和耳识，都起到一个入和输出的作用，入，就是摄取，<b><span>六入。</span></b></p><p>比如说，他告诉我这个杯子是白色的，它叫做杯子，这个是入，当我们又一次看到的时候，我们可能会告诉别人，或者不告诉别人，我们自己也知道了，它是白色的，它叫杯子，这个时候就在输出。然后我们的意识是在什么时候起作用呢？我喜欢这个杯子或者我不喜欢这个杯子，这个时候意识开始起作用了，当我们的意识起作用的时候就开始分别是非对错就开始起贪念了。</p>"
    },
    {
        "title": "第十三讲-无眼耳鼻舌身意",
        "html": "<p>当我们的意识起作用的时候，就开始分别是非对错，就开始起贪念了。比如说，我们面前放了一个黄色的东西，原本我们并不认识它。这个时候有人告诉我们这个黄色的东西叫黄金。价值连城。这一小块就可以换取很多的财富。那这个时候是不是我们通过眼识知道了，它叫黄金。通过耳识听到了别人的讲解，知道了它价值连城。这个时候我们的意识开始分别，我喜欢黄金，是不是开始就要去贪念了。那我们下次再逛街的过程当中，看到了那个柜台里面有黄金，我就想让身边的人买给我，如果他没有买，我可能就起情绪了。这个情绪从哪里来？从你意识的贪念而来，这个时候如果我的老公没有给我买，我就开始抱怨，你看看你是如此的无能。我要一块黄金你都不能给我买，你看看别人家某某老公是怎么样做的，这个时候你的意识，由于贪念就开始产生了情绪，接下来有可能要开始造业了。一个是你在不停的去抱怨他；第二个，他如果没有满足你的贪念，你有可能就会去想其他的办法，或者说，当他受到了你的这番侮辱，他有可能对你产生不好的行为，或者是他想证明自己就开始去做一些其他违法的行为。这一系列都是由于我们意识的那个贪念所起的。</p><p>所以在生活当中也是一样的，本来我们看到这个杯子，看到一朵花，只是前五识发生作用，这个时候是不产生念头和行为的。但是，第六意识心，这个时候开始介入，就要开始产生念头和行为了。我贪恋一朵花，我就想要拥有；我贪恋财富，可能走的是不正当的行为，可能要做损害他人的事情，可是抵不住钱的诱惑；我贪恋一个人的美色，有可能去走极端。所以这个时候<b><span>心为王。</span></b></p><p>第六意识心主宰着我们的前五根，去贪恋这个世界的外尘。我们常常讲的，<b><span>财色名食睡，</span></b>这个时候就要开始产生不好的行为了。<b>这里是在分享六根、六尘，六识，是如何产生作用的，只有我们了解它是如何产生作用的，我们才能知道要如何去修正，如果按《心经》来讲这些都是没有的。</b></p><p>无眼耳鼻舌身意，无色声香味触法，无眼界乃至无意识界，因为它自性是圆满的，本然就是空的，自然都没有。可是呢，我们已经降临在这个娑婆世界，红尘之中，已然着了色相，所以我们要明白它的原理，要知道色不异空，空不异色，你贪恋的那个黄金，你喜欢的那朵花，你追求的财富，你暗恋的某一个人，终究要归于空，所以告诉你，色不异空，空不异色，所有的都是不长久的，都是短暂的，终究要归于空性，都是没有的。</p><p>前五识只是起了一个记忆的作用，它不起分别的作用。那比如说，眼识或者耳识，因为它有的时候会同时用。比如说，别人告诉这个杯子，是不是你耳识和眼识同时起作用。可是它们起的作用只是记忆功能。白色的杯子这个时候意识不进来的时候，你是不贪著的，也不会分别，它好看还是不好看，它就是个杯子，白色的，它只是它原本的样子。</p><p><b>大家不断地减少欲望是不是越来越自在，没有那么多的分别。</b>你说喝水，用什么杯子，又有什么区别呢，有哪个就用哪个；泡茶也是，泡什么茶就喝什么茶；吃饭也是，吃什么又有什么区别呢，饱肚子就好了。这个时候，你是不是就不起贪着。如果你只爱吃肉，你是要杀生吧，杀生，是不是就造业。</p><p>很多人说，我想要更多的财富，我贪恋更多的美色。那是不是你要付出行动，付出行动就是在造业，所以它的根源都是那个意识。意识所起的那个贪念，这个贪念开始让我们做出来很多不好的行为。是恶性就开始造恶业。</p><p>这是对外在的，还有的人对其他的。比如说，我总是看不上什么样的人，什么样的人这也是你的意识在分比如别；我只喜欢什么样的人，不喜欢什么样的人，这都是你的意识在产生分别，所以产生分别，你就产生痛苦。我看他不顺眼你就烦。我看到他，我就特别高兴我每天很开心。你看到他很开心有一天他不在的时候，你就不开心了所以最后还是苦的。所以无论你喜欢什么还是不喜欢什么最后的结果都是苦的。因为你喜欢他，他不可能永远在你身边，他也不可能永远那么好看，他会老的。就像我们喜欢一朵花喜欢花的，刚开始那两天好看，过几天你看着就不好看，它要枯萎的。</p><p>所有的事情都会发生变化的。你喜欢一个东西不是一样吗，我就喜欢这个杯子别的杯子不能喝水，那它丢了，它要坏了，你是不是就极其愤怒痛苦。你看现在很多人丢个小狗，哭的死去活来痛不欲生，就是因为贪恋了。</p><p>当我们不去贪恋这些事情的时候，我们不贪恋这个杯子难道我们不用了吗？只是你不再贪恋它，只是一个杯子；我们难道不要吃饭了吗？<b><span>圣人为腹不为目</span></b>，只要吃饱肚子就好了，目的不重要。这个时候你会发现，你是不是就没有那么多的执着和痛苦了。比如说，特别想吃桃子，你们家没种，可能买。有一下，你买不到，那么合适的当下，你是不是就偷别人家的桃子了？是我对它没有贪着，有我就吃，没有我就不吃，这个时候你是不是意识不动，你的行为就不产生。你的贪恋起了，你的那个贪念就指使你的行为去做不好的事情。可你要没起那个贪念，你怎么会去摘人家的桃子。可是他不起贪念不代表他不吃，有我就吃，没有我就不吃，这个时候就不痛苦。所以都是被我们的意识主宰的。</p><p>比如说，你看我们的意识就是我们的这个心。这里讲的，就是第六意识心，我们的这颗心，我们的这个意识，主宰我们好色，我们是不是会产生很多好色的行为，它就指使我们的眼睛，到处去看美色，然后看到一定程度，它就指导我们的身体要去触碰。那我们贪婪财富不也是一样的吗？也是这颗贪婪的心，意识去主导我们去看更多的关于财富的事情，接下来看着看着看着不行了，看已经不能满足我了，所以接下来就要产生更多的行为了。所以你看都是这颗意识心。它在主导着牵引着我们的五根不停的造业。这就是痛苦的来源，所以你这颗心不在动的时候，你不再起分别和贪念的时候，你就不痛苦。</p><p>修行有很多种方法，比如说我们刚才所讲的十八届，我们可以从断六尘开始，也可以断六根也可以断六识。刚才所讲的是断六识，当你的第六意识心不再起分别，不再贪著的时候，你自然就不产生不好的行为，<b>色声香味触法叫断六尘</b>。</p><p>佛家的出家人。说出家的师父是远离红尘的。是不是在断六尘？不睡高广大床，不让自己住的那么舒服是断触；我们吃素断味道，不要对味道起贪著；我们在山上修行是断色，这个色是广义的，就是少被物质的东西诱惑。这就是断六尘的方法。</p><p>刚开始我们修行，为什么要守戒？说你要吃素，要过午不食，不要贪恋更多的衣服，不需要每天都在化妆，这都在干嘛，都在断尘。就是我们少一些，被这些尘世间的这些物欲所干扰，这个时候，你会发现你的心会跟着变清净（第六意识心）。当你通过戒的行为，不断地去断外在世界的尘，这个时候我们的心，第六意识心，就会变清净。变清净你是不是自然少起分别，少起贪著，妄念起的就少。所以越修行，你对生活的要求越来越简单了，因为你已经离开了那么多的尘。自然你的贪著就会变少。</p><p>古人修行为什么容易成就。那个时代的欲望少，没有那么多的干扰，而我们现在这个时代的欲望太多了，人们不停的索取和贪求。所以导致我们的意识牵引着我们的前五根（眼耳鼻舌身）不停地向外贪取不停的去贪著，所以人们离智慧越来越远越来越远了，很难回到最初原本清净的那个状态。<b><span>儒释道的文化都在教给我们修行要减少欲望，道德经也讲为学日益为道日损，损之又损以至于无为，无为而无所不为</span></b>。学习，为学日益，益就是增加，要不断的去增加自己的学识自己的学问，为道要日损的。说你要修道，欲望要不断的减少减少，才能反璞归真，去欲还本，回到你自己原本最初的那个状态。《中庸》开篇讲<b><span>天命之谓性，率性之谓道，修道之谓教</span></b>，也在告诉我们同样的道理。我们本来每一个人都有的那个天性，就是道。我们那个天性丢失了，这个时候怎么办呢，修道之为教，所以你按道的规律去不断的修正自己。</p><p>都在告诉我们要减少欲望。可是，我们到了这个时代，我们没有学习出世间的法，我们就会不停的增加，不停地向外求，不停地贪取，这个时候你会发现，我们六根不得清静。所以这个时候我们通过戒的方法对外面的尘少起贪著的时候，我们的心才能变得清净，我们的意识才能变得清净，意识减少了贪著分别就不再牵引六根去不停的摄入。这个时候叫六根清净，你六根是清净的，你的烦恼自然就是少的。</p>"
    },
    {
        "title": "第十四讲-无眼界",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    },
    {
        "title": "第一讲",
        "html": "虚空先生"
    }
]