[{
    "title": "第一讲《立命之学》路遇孔先生（免费）",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>第一讲《立命之学》路遇孔先生</strong></span></p><p><span>    《了凡四训》作者袁了凡先生，明代人，距现在四百多年的历史，他以他自己一生的亲身经历，来写了这样一部家训。为什么叫四训呢？他整个分了四篇，从第一篇开始讲，就是立命之学，第二篇是改过之法，第三篇是积善之方，第四篇是谦德之效。一共写了这样四篇，告诉我们怎样改命，怎样积德行善的过程。</span></p><p><span>从一开始讲他自己的人生经历，他被一个道人，算到了他的生死的年龄，算到了他无儿子，后来遇到了云谷禅师，对他的一些指点，从此以后，他开始改变自己的心性，改变自己的行为，不停地去积累善行，最后达到了改命的这样一个效果。</span></p><p><span>整个这部书，就是讲他自己的一个经历，很适合我们刚开始学习文化，或者刚开始进入修行，想要去修身，想要去立德，想要去立业的人来学习、来借鉴。从第一篇立命之学，这本书离我们的年代比较近，一共四百多年的历史，所以读起来其实很简单，也毫不费力，他的语言也更接近于我们现在。</span></p><p><span>    第一篇立命之学，<strong>“余童年丧父”，</strong>我童年我的父亲就不在了，<strong>“老母命弃学举业学医”</strong>，举业是什么呢？以前读书人都要考取功名的，这叫举业。我的父亲去世以后，我的老母亲不让我去走这条路了，让我学医。“<strong>谓可以养生”，</strong>对我说学医可以保证自己的生活，生养自己是没有问题的。<strong>“可以济人”，</strong>同时又可以救济和帮助他人，<strong>“且习一艺以成名，尔父夙心也”，</strong>并且学这样一个艺还可以成名，这个也一直是你父亲多年来的心愿。不让他上学了，说你去学医吧，又可以养生，还可以成名，还可以救济他人，并且他也是你父亲一直都心愿，对了凡先生讲了这样一段话。</span></p><p><span>这个时候了凡先生<strong>“后余在慈云寺”，</strong>后来在一个地方叫做慈云寺，<strong>“遇一老者，修髯伟貌，飘飘若仙”，</strong>说在慈云寺看到一个老者，这个人长相留着长须，飘飘若仙的感觉，就是我们看到的想象当中的，道家人的那个样子。“余敬礼之”，我对他很礼敬，然后他对我讲了一番话，<strong>语余曰：“子仕路中人也，明年即进学，何不读书？”</strong>是不是一个高人，告诉我说，你现在没读书，同时又知道了明年就能考上进士，为什么现在不读书了呢？这个是一个高人啊，一看到他就知道了。</span></p><p><span><strong>“余告以故”，</strong>把这件事情的缘故告诉了老者，<strong>“并叩老者姓氏里居”，</strong>叩请，说叩清老者很尊敬的问老者，哪里人啊？叫什么名字？怎么称呼？老者跟他讲<strong>曰：“吾姓孔，云南人也，得邵子皇极数正传，数该传汝。”</strong>老者对他讲：“我是云南人，姓孔，我自己得了邵子皇极数。”邵子是北宋人，他曾经写过《皇极经世》一书，是北宋很有名的哲学家和易学家，被人们称为是内圣外王之人，他写过这样一本推算的书。孔先生就得了这个数的正传，并且跟他说这个书是该传汝的，告诉袁了凡先生，其实这个数是应该传给你的。</span></p><p><span><strong>“余引之归，告母”，</strong>我就把这位老者请到了家里，告诉了我的母亲。<strong>母曰：“善待之。”</strong>说你一定要善待这位老者。</span></p><p><span><strong>“试其数，纤悉皆验”，</strong>后来我们试他推算的皇极之数，纤是什么意思？就很细微的、很小的事情，都能灵验。<strong>“余遂起读书之念”，</strong>一看他算的很多事情都很准，想起来了说我要读书啊，我是官场中人，并且明年就能中进士，就又重新起了读书之念。</span></p><p><span><strong>“谋之表兄沈称”，</strong>说我和表兄沈称相商量，我要去上学，我要去学习，言，这时候表哥对他讲<strong>“郁海谷先生，在沈友夫家开馆，我送汝寄学甚便”，</strong>郁海谷是教书先生，沈友夫是一个人名，说有一位先生叫郁海谷，在沈友夫家里开馆，就是授学，开这种学堂，说我可以送你到那里读书。</span></p><p><span><strong>“余遂礼郁为师”，</strong>接下来，我就开始拜郁海谷先生为老师，去学习。</span></p><p><span><strong>“孔为余起数”，</strong>接下来这位孔先生，就开始为我推算后面的命数了。<strong>“县考童生 当十四名，府考七十一名，提学考第九名”，</strong>讲的多详细，以前什么叫童生呢？通过县试和府试都过的叫童生，童生考试，也要考县试和府试的。所以这里就告诉他了，县试的时候，得十四名，府试的时候，得七十一名，提学考第九名，就是省考能得第九名。</span></p><p><span><strong>“明年赴考”，</strong>第二年奔赴考试，果不其然，<strong>“三处名数皆合”，</strong>全对了，算得极准。<strong>“复为卜终身休咎”，</strong>所以进一步，为我卜了这一生的吉凶善恶。</span></p><p><span>言：“某年考第几名，某年当补廪。”说哪一年呢？考什么试？考到第多少名？哪一年当补廪？补廪生是什么意思，当补廪生的时候，就可以食朝廷的俸禄了。“某年当贡”，哪一年当贡生，贡是什么，整个那个时候的科举制度，在县在州在府，选一些优秀的读书人去当贡生，贡生就进入国子监重点培养，将来是为天子物色人才的，所以叫贡生。</span></p><p><span><strong>“贡后某年，当选四川一大尹。”</strong>贡后某一年，会当四川的一个知县，<strong>“在任三年半，即宜告归”，</strong>在任三年半，就应当回家了，为什么呢？<strong>“五十三岁八月十四日丑时，当终于正寝”，</strong>要回家准备后事吧，快结束了，挺惨的吧，在任三年半，做了三年半官，就意思你要回家准备后事了，时间跟他说的很详细，五十三岁八月十四日丑时，<strong>“惜无子”，</strong>可惜啊，命中还无子。<strong>“余备录而谨记之”，</strong>所以我把他写下来了，并且牢牢的记在心中。</span></p><p><span><strong>“自此以后，凡遇考校”，</strong>就是所有的考试，<strong>“其名数先后，皆不出孔公所悬定者。”</strong>就是都逃不出孔公所预算的，完全一样。<strong>“独算余食廪米九十一石，五斗当出贡”，</strong>唯独有一件事情算错了，就是我应该领的是九十一石五斗米，结果领的七十余石，其实他心里已经开始活动了。</span></p><p><span>大家想一想，如果是我们被这样算定的，是不是总想找一个事情去反驳，突然有一个事情算不准了，他就觉得希望来了。别忘了给他算定的才活到五十三岁，还没有孩子，所以这个时候，他觉得好像来了一线生机，这个时候我们可想而知，了凡先生的生命状态，其实是蛮低沉的。</span></p><p><span>我们去想一想，如果我是被算定了，知道自己什么时候走，然后所有的事情，都跟他算的一模一样，是不是有点心如死灰的感觉？这个时候其实他内心，可能是燃起一线希望的，说这件事情算得不准，是不是以后都不准了。</span></p><p><span><strong>“屠宗师即批准补贡”，</strong>说我没有领到那些米的时候，屠宗师是一个职称，开始就批准我，可以去当贡生了，那个时候的宗师是做什么呢，就是从食廪生去当贡生，是经过他们筛选和批准的，说我没有领到那些粮食，就让我去当贡生了，<strong>“余窃疑之”，</strong>我私下就开始怀疑了，说他可能算的不准了，不准也就说明后面的事情也不会发生。</span></p><p><span><strong>“后果为署印杨公所驳”，</strong>后面批准他去当贡生，果然被一个署印杨公，署印就是代理的意思，还有一个人代理这件事情，他给我驳回来了，意思还不够当贡生的，等于就没去了。</span></p><p><span><strong>“直至丁卯年（公元1567年），殷秋溟宗师见余场中备卷。”</strong>又过了一段时间，到了丁卯年，殷秋溟是一个人名，宗师还是刚才的职称，殷秋溟宗师见我在场中的备卷，就是考试的试卷，见到考试的试卷以后，<strong>叹曰：“五策即五篇奏议也。”</strong>感叹曰，五策是一种文体，有问有答的叫策。说五篇奏议也就如同五篇奏折一样，这个时候他在说什么呢？袁了凡先生讲的这个特别好，说的这个特别好，写的这个特别好，就好像给皇上写的奏折一样，文采极佳。</span></p><p><span><strong>“岂可使博洽淹贯之儒，老于窗下乎。”</strong>博洽就是博学的意思，淹贯就是深通，怎么能让这样一个又博学又深通的人，老于窗下呢？怎么能不让他去做事情，不让他去为官，怎么能不给他一条出路呢？就是不能埋没人才，“遂依县申文准贡”，依据这些事情，让县里面去给他申请，让他去当贡生，人生又遇到了这样一个贵人，破格推荐他，让他去当贡生。<strong>“连前食米计之，实九十一石五斗也”，</strong>这段时间，再加上之前所领过的，正好是孔公所悬定的那个数量。</span></p><p><span>希望又破灭了，太准了，经历来经历去还是那些事情，还是那些米。“余因此益信进退有命”，从此以后就更加的相信，进退有命，什么功名富贵，包括我的生死，包括我这一生的浮浮沉沉，都是注定的。“迟速有时”，什么时候发生，都是注定的时间。“澹然无求矣”，从此以后开始变得很淡然，什么都不求了，认为求什么都没用了，我也改变不了自己的命运了。</span></p><p><span><strong>“贡入燕都”，</strong>现在批准他去当贡生了，燕都就是北京，进了北京以后，留京一年，因为当贡生在这里学习。<strong>“留京一年，终日静坐，不阅文字”，</strong>什么都不做了，就一天天在这静坐，也不读书了，为什么呢？读了也没有用啊，反正每一年发生什么事情，都是注定的，包括我哪一年走，都是注定的，我还来读书做什么呢？</span></p><p><span><strong>“己巳归”，到了己巳年，又开始回来了。回来以后“游南雍”，</strong>这个南雍，南就是南京，雍是什么呢，以前国家建立的大学堂，这种国子监要称为雍，所以又回到了南京的国子监，开始继续做他的贡生。</span></p><p><span><strong>“先访云谷会禅师，于栖霞山中”，</strong>这个时候开始去栖霞山访云谷会禅师，他所有的命运的转折点，从这就开始了。为什么说了凡先生这一生改变命运呢，其实改变命运就是从遇到云谷会禅师开始的。<strong>“对坐一室，凡三昼夜不瞑目”，</strong>说两个人对坐啊，三天三夜没合眼，这不是一般人的境界。</span></p><p><span><strong>“云谷问曰”，</strong>这个时候云谷禅师也很纳闷，这个人很厉害，有极高的修为啊，能在这里和我对坐三昼夜不合眼。所以接下来问：<strong>“凡人所以不得作圣者，只为妄念相缠耳。”</strong>凡夫之所以不能做圣贤，都是因为妄念相缠耳。</span></p><p><span>这里面告诉我们，妄念相缠，什么叫缠呢？很多念头在一起才叫缠啊，我们所有的凡夫都一样，不能超凡入圣，都是因为妄念太多，都是因为心思不定，太多的念头起。<strong>“汝坐三日，不见起一妄念，何也？”</strong>说你能坐三日，而不起一个妄念，为什么会这样呢？</span></p><p><span><strong>“余曰，吾为孔先生算定，荣辱死生，皆有定数，即要妄想，亦无可妄想。”</strong>我说：“我被孔先生算过了，荣辱死生，皆有定数。我也想妄想啊，我也想起一些妄念呢，可是我即使想妄想，也没有什么可想的，没有用。”可以想象一下，他这时候是个什么样的心态，就像我们在经历了很多人生的悲伤是不是就这样的？说想想快乐的事情，有什么可想的，哪有什么是快乐的？就是杂念都不起了，所有的希望都开始破灭了。</span></p><p><span>所以想一想，他跟云谷禅师，两个人对坐看似一样，境界实则完全不同。云谷禅师也是三日三夜，不合眼，他也是一样，可是他是心如死灰的状态，人家是不起杂念的状态，完全是两种境界。</span></p><p><span><strong>云谷笑曰：“我待汝是豪杰，原来只是凡夫。”</strong>云谷禅师听到他说这些，笑着说他：“我还以为你是豪杰，圣贤之列呢，原来只不过一凡夫耳”，袁了凡先生一听，何故啊？“问其故”。为什么您要这么说啊？禅师说这个时候禅机来了。</span></p><p><span><strong>曰：“人未能无心，终被阴阳所缚，安得无数。”</strong>说人呢，未能无心，所以才被阴阳所缚，怎么会没有定数呢？人为什么会被阴阳所缚呢？都是被这些念头所缚啊，只要有对立，有阴阳，就会被所缚。</span></p><p><span>比如说任何事情有好，是不就有坏？有让我们高兴的事情，是不是就有让我们不高兴的事情？如果因为一个事情高兴了，就会因为另外一件事情不高兴，是不是我们的妄念就会不停地起啊？我们因为一个事情快乐了，就会有事情出现让我们不快乐。</span></p><p><span>为什么修行要不喜不悲的？没有什么事情我们是大喜的，自然就没有什么事情是大悲的；念头越多，痛苦越多；一会因为这个事情高兴，一会就会因为那个事情不高兴；他今天说句话好听了，我高兴，他说一句话不好听，就会让我不高兴，都是妄念太多了。我喝这个茶，要产生喜欢，是不是喝那个就会不喜欢？</span></p><p><span>每天被这些好与不好，开心与不开心，快乐与不快乐，都是被这些东西所缚的。每天纠结于对或错当中，今天他说这句话是对的，明天他说什么就是错的，他这个行为我认为是对，他那个行为我认为就是错，所以才被这些阴阳所缚。</span></p><p><span>那再往大了讲，天地日月都是阴阳，好坏善恶都是阴阳，我们要认为这个好，就会认为那个坏；要是喜欢白天，就不喜欢黑夜，只要还有这些心在，就会被阴阳所缚。</span></p><p><span>安得无数啊，所以才被这些命数所束缚着。同样是心，凡夫的是妄心，是攀缘心，那圣贤有没有心呢？有啊，他那个叫“妙明真心”，他找到的是他的自性，也就是阳明先生讲的良知，大学讲的明德，就是本有的光明的那个东西，圣贤的那颗心是不动的，没有这些分别心的，没有这些妄念的，没有这些喜悲的，没有这些对错的。</span></p><p><span>我们为什么会有这么多的痛苦和烦恼？都是因为这些妄念所产生的对立，故而被阴阳所缚，所以大家去观察啊，越是有修为的人，包括我们去看一些古之圣贤，他们的表情波动都很小的，越是上蹿下跳的人，被束缚的越厉害，越是情绪波动的人，越容易产生痛苦。</span></p></div>"
},{
    "title": "第二讲《立命之学》福泽己中求",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第二讲《立命之学》福泽己中求</strong></span></p><p><span><strong>“但惟凡人有数；极善之人，数固拘他不定；极恶之人，数亦拘他不定。”</strong></span></p><p><span><strong>“但惟凡人有数”，</strong>但是只有凡人是有定数的。<strong>“极善之人”，</strong>极其善良，大善之人。<strong>“数固拘他不定”，</strong>大善之人，数对他是没有用的。<strong>“极恶之人，</strong><strong>数亦拘他不定”，</strong>如果这个人很坏，做了很多坏事，数也不是固定的。为什么呢？</span></p><p><span>无论是大善还是大恶，都会改变整个命运的走向，经常去积德行善的人，做了很多好事情的人，命运就会随之发生变化。同样要是不停地做坏事，也会发生变化的，因为不停地去做损耗自己德行的事情，损耗自己福报的事情，过早地消耗了，就会出问题的。</span></p><p><span>古人常告诉我们，福向俭中求，我们生活在这个时代的人，一定要懂得节俭的，要不然自己的福报，如果过度消耗的时候，晚年要吃苦的，所以大家要非常注意这个事情。</span></p><p><span><strong>“汝二十年来，被他算定，不曾转动一毫，岂非是凡夫？”</strong>说这二十年呢，都被孔先生所算定。一点都没有改变，难道还不是凡夫吗？其实这个时候开始，了凡先生的内心，已经开始燃起希望了，听云谷禅师这一讲，原来命运是可以改变的。</span></p><p><span>其实我为什么要讲《了凡四训》，因为更适合很多刚开始修行的朋友来听，就是因为我们很多人都会有这个疑惑，命运到底能不能改变？整个《了凡四训》，以他自己的经历，就是告诉我们改命的，如果从修行的角度来讲，《了凡四训》讲的并不究竟，可却是适合我们绝大多数人改命的方法。</span></p><p><span>那么接下来，了凡先生开始问了。<strong>余问曰：“然则数可逃乎？”</strong>难道命是可以改的，我可以不被命数所困吗？<strong>曰：“命由我作，福自己求。”</strong>云谷禅师说，命运我们是可以自己做主的，是可以靠自己的行为改变的，福要向自己求的，看自己的行为。刚才不是告诉我们了，极善之人，数是拘他不定的。</span></p><p><span><strong>“诗书所称，的为明训。我教典中说：‘求富贵得富贵，求男女得男女，求长寿得长寿。’夫妄语乃释迦大戒，诸佛菩萨，岂诳语欺人？”</strong>诗书所称，的为明训，诗书上所讲的这些话，确实是通达的、明达的对我们的训诫。我教典当中不会讲假话的，诸佛菩萨怎么能讲假话欺人呢？</span></p><p><span>所以讲了这样一段话，就是告诉了凡先生，这句话是真真实实的，是真实不虚的，我们回过来再看，怎么就求富贵得富贵，求男女得男女，求长寿得长寿呢？我们要怎么求呢？不是让我们去求谁，求自己啊，都向己求。我们要想得富贵，通过自己的行为去积德行善，去努力做事情啊。无论去求什么都一样，要懂得向内求的，不是向外求。</span></p><p><span>比如说大家做视频，我们想做视频怎么办？求己啊，别人只能告诉我们一个方法，那叫外因，有的人说了我想改变命运，可以啊，《了凡四训》也只是外因，告诉我们一个方法，得向自己求啊，得自己身体力行地去践行，否则把它读得再懂也没有用。当我们想要什么的时候，不会的时候，就去找别人学，学完了要靠自己努力的，要懂得向内求的，向外求是没有任何作用的。</span></p><p><span><strong>余进曰：“孟子言‘求则得之’，是求在我者也。</strong>道德仁义可以力求，功名富贵，如何求得？”接下来了凡先生又继续讲，孟子言‘求则得之’，孟子也说，求则得之。“是在求我者也”，说求这件事情是在我。道德仁义可以力求，功名富贵，如何求得？这时了凡先生开始有疑问了，说孟子也说‘求则得之’，求这件事情是在我，道德仁义我可以向自己求。比如说我不会我可以学习，我的道德不够我可以修，我的学识不够我可以学，这些东西可以力求，功名富贵，如何求得？</span></p><p><span>功名富贵我要怎么求？其实这是不是很多朋友的疑问？很多朋友跟着学习很长时间，在直播当中也会经常问，说我修行学习传统文化，可以让我变得更从容更开心，我要想赚更多的钱，我要想做更多的事情，那怎么能行啊？说我学这个东西是不是没有用啊？实则不是的，接下来告诉我们答案了。</span></p><p><span><strong>云谷曰：“孟子之言不错，汝自错解了。”汝不见六祖说：“一切福田，不离方寸；从心而觅，感无不通。”</strong>云谷禅师说，孟子说的没有错，求则得之，只不过你理解错了。方寸是什么呢？就是心呢，我们经常用一个词，叫方寸大乱，是我们自己的心乱了。</span></p><p><span>《西游记》里面孙悟空去拜师，在方寸山斜月三星洞，都是在悟心的那点事情。一切福田，不离方寸，都在心里那点事情。从心而觅，感无不通，只要向内求，从心里面去寻觅，感无不通。感是什么意思呢？有感有应，我们想要感化，或者想要什么事情，就得努力地去种因，说我想感化他，怎么才能感化他，不停地给予，付出给他，这叫感化。</span></p><p><span>我们想求得什么事情，也要不停地种因。比如说我现在工作当中，某一件事情不会，怎么才能通？不停地种因，不停地努力，不停地积极向上，它就通了。但是要向心而觅的，向内在求的，不要向外求。</span></p><p><span>整个这段都告诉了凡先生，无论是内在的道德修养，还是外在的功名富贵，我们要懂得向心求，所有的事情都可以得到的，这古之圣贤，肯定不会诳我们，而且不断地学习，不断地去修正，我们去观察身边的事情，他也是实实在在的。</span></p><p><span><strong>“求在我，不独得道德仁义，亦得功名富贵，内外双得，是求有益于得也。”</strong>求在我，不独得道德仁义，亦得功名富贵，所以说我要懂得向内求的时候，不是只有道德仁义，可以力求的，功名富贵，也可以力求。“内外双得，是求有益于得也”，当我们不停地向心求的时候，是可以内外双得的，既得道德修养，道德仁义，又得外在的功名富贵，都是可以的。</span></p><p><span>重点来了，“若不反躬内省，而徒向外驰求，则求之有道，而得之有命矣。”“若不反躬内省”，如果我们不懂得向内自省，不停地去提升自己，不停地向内求，“而徒向外驰求”，向外求还不算，向外驰求，什么叫驰？快速地奔跑叫驰，我们说驰骋、奔驰，是不是快速的求啊？</span></p><p><span>很多人都会问，我现在负债累累了，就告诉我怎么快速地赚钱，我现在生意不好，就告诉我，怎么快速地把生意做好吧，这都是向外驰求，结果会发现越做越不好，越忙越乱。如果我们不懂得向内求，而向外驰求，“则求之有道，而得之有命矣”，求虽然有方法，但是能不能得到就看我们的命。</span></p><p><span>所以我们这里引伸《中庸》里一句话，“君子居易以俟命，小人行险以侥幸。”君子居易，君子把最简单的，最容易的事情做好，并且同时增加自己的道德修养，增加自己的智慧，以等待天命; 小人是行险以徼幸的，就是我们不停地向外求，能不能获得就看徼幸，看命吧。</span></p><p><span>但是君子不是这样做事情的，君子做事情是不停地种因的，当那个因种够了，果是自然而然出现的，所以君子做事情才坦荡啊，小人做事情，是不是长戚戚的？经常忧虑，像赌博一样能不能得到，我也不知道，我等着看吧，所以说我们要懂得向内求的时候，内外双得。如果要向外驰求，能不能得，看命、看徼幸。</span></p><p><span><strong>“内外双失，故无益。”</strong>我们如果不停地向外求，终有一天会内外双失，是没有益处的，整个这段都在告诉我们一个道理，就是不停地向内求，所以我们一定要懂得从思维上的转变，我们想改变命运也是一样的，我们想增加自己的学识也是一样的，我们想让自己变得更快乐，也是同理，要想把当下的工作做得更好，我们也得不停地向内求啊，只靠着别人帮忙，能行吗？</span></p><p><span>今天他帮，明天他帮，终究自己也成长不起来，所以每天我们就生活在忧虑当中啊，因为自己不坦荡啊，因为因种得不够，哪来的从容？所以做生意也是一样的，所有的事情都告诉我们这个道理，要不停地向内求，不要向外驰求。</span></p><p><span><strong>因问：“孔公算汝终身若何？余以实告。”</strong>因问，因为这个事情，云谷禅师继续问，孔公算汝终身若何？孔公算你这一生会怎么样呢？余以实告，了凡先生把整个孔公给他算定的这一生，所有的事情，据实相告。</span></p><p><span><strong>云谷曰：“汝自揣应得科第否？应生子否？”</strong>这段话非常非常重要，这时云谷禅师告诉他，那你自己想一想，你是否应该得科第呢？你是否应该生子呢？其实我们每一个人，都应该学会反思啊，当我遇到一个事情的时候，我们能不能停下来反思呢？</span></p><p><span>有的人说了，我想要生意做得更好，那我们自己想一想，我们应不应该得到更好的生意呢？有的人说了，我现在感情不顺利，那我们自己思考一下，我应不应该感情顺利呢？没人重视我，我说的话都没人在意，那我们去反思一下，说的话应不应该得到别人的在意和尊重呢？经常有的人又说了，我想让自己的心静下来，我想让自己变得更有智慧，那问一问，以我们现在的所学所修，是否应该得到那些智慧？</span></p><p><span>前两年不是流行一句话吗，如果我们是老板，去思考一下，我们会不会用这样的员工？我们就知道问题所在了，比如说夫妻关系，不也是一样吗？当出现关系不好的时候，停下来想一想，我应不应该得到对方更多的爱护呢？</span></p><p><span>上述的这些问题，都停下来思考一下，问自己凭什么，就知道自己做得够不够了。这段话其实是很重要的，是让我们懂得反思的，懂得看看自己当下的问题，还有哪些是不足的？</span></p><p><span><strong>余追省良久，曰：“不应也。”</strong>说我反省考虑了很长时间，自己说不应该啊。就像我们自己，反思一会儿，想想是这么回事，我确实不该得，我现在的努力，也不能拥有更多的财富啊，我现在付出的也不够，凭什么让别人都得在意我。</span></p><p><span><strong>“科第中人，类有福相，余福薄，又不能积功累行，以基厚福。”</strong>接下来开始总结了，中科第的那些人，都是有福相的，而我福薄。什么叫福相呢？这里不是指的说，这个人长的有没有福相，不是的。这里的福相是指的什么呢？是外在的行为所做的事情，所表现出来的，让他人看到的外在的那个叫相，说我做的太少了。说我福薄，本身做得就少，又不懂得去积功累行，去不断地积累自己的福德。</span></p><p><span><strong>“兼不耐烦剧，不能容人，时或以才智盖人，直心直行，轻言妄谈。”</strong>并且事事不耐烦，动不动就急躁，都是福薄的表现。又没有容人的雅量，遇事不耐烦，平时做得又少，又不能去积功累行。偶尔还觉得自己很有才华，很有才智，还很高傲很傲慢。说话做事直心直行，经常伤害别人还不自知，牙尖嘴利。</span></p><p><span>“轻言妄谈”，谈的很多话都是妄语，因为我们只要是直心直行，说的很多话必然是伤害别人的，必然是不顾后果的，所以咱们学习是不是每天都讲，苛责他人的话、埋怨他人的话、指责他人的话少讲；赞美他人的话、鼓励他人的话多讲。</span></p><p><span><strong>“凡此皆薄福之相也，岂宜科第哉。”</strong>看我这些外在的种种行为，都体现出来了，都是做得不好，做得不足，做得不够的地方。我现在这样的行为、这样的努力、这样的付出，怎么能中科第？</span></p><p><span>其实这段自省非常重要，如果我们在生活当中，在工作当中，在学习当中，在修行当中，懂得反躬自省，就会不停地去进步。自省一定不是自怨自怜，而是自我修正的过程，自怨自怜是消极的。当我们自省，看到了自己的不足，是为了让自己去修正的，所以如果每天我们能懂得停下来，去反观自身，去看看自己的不足，其实对于提升自己，是非常有帮助的。</span></p><p><span>《论语》里面有曾子曰：“吾日三省吾身。”曾子说我每天都是三次来反省自己的，那看我们呢？能不能做到每日都反省自己？，起码要做到什么，遇事情的时候先不要抱怨，先不要向外求，停下来去思考一下，我现在的努力和我想要的那个东西，是否匹配啊？就像了凡先生这样，停下来思考，他自己思考，是不是他就找到问题所在了，所以这段话其实特别的重要。</span></p></div>"
},{
    "title": "第三讲《立命之学》务积德和爱",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第三讲《立命之学》务积德和爱</strong></span></p><p><span><strong>“地之秽者多生物，水之清者常无鱼，余好洁，宜无子者一。”</strong>这个时候开始自我反省，自我总结，为什么不能登科第？为什么命里无子呢？他自己开始总结，有哪些原因导致，我没有子嗣的。</span></p><p><span>当一个人一旦开始反思，开始反省的时候，其实无论有没有关联的事情，自己都会联想。总结的第一个原因：地多秽所以才能生物，水之清者常无鱼，而他自己太好洁净了，洁净不只是说他好干净，而是他不懂得藏污纳垢，太洁身自好了，有点高傲才会这个样子。一个人如果太过于高傲，他身边的气数并不旺，一个人他过于洁净的时候，不会滋养很多东西。</span></p><p><span>之前我经常讲一个故事，管仲这个人，诸葛亮对他很赞扬，“自比管仲、乐毅”，管仲是春秋时代的一个名相，当时齐桓公想要找一个相的时候，找到了鲍叔牙，他是齐桓公的老师，让他做相。</span></p><p><span>鲍叔牙跟管仲是很好的朋友，他就讲了这样一番话，他说如果想治理好我们这个诸侯国，我是可以做相的，但是如果想在春秋争霸，我是做不了的，他说那谁可以？他说管仲可以。为什么管仲可以？</span></p><p><span>鲍叔牙说因为管仲这个人可以藏污纳垢，而我这个人善恶太过于分明，眼里不容沙子，所有能做领导的人，都是懂得藏污纳垢的。藏污纳垢不是贬义词，他是形容一个人可以包容很多事情，可以看懂很多事情，但是他是大智若愚的，看懂而不说破，他懂得包容一个人和一些事情不好的那一面，而去用他好的那一面，这点极其重要。</span></p><p><span>如果一个人，太洁身自好的时候，会发现他容不下很多东西，不会滋养万物。这里面形容地之秽者多生物，看看大地是不是这样的，什么东西都能承载，比如养花的人都会有这样的经历，养花要想养得好，要用很多污秽的东西的。比如说米汤，比如说粪水，用这些东西花长得好，但是太过洁净的人，会嫌那些味道不好，花反而就养不好。</span></p><p><span>在做事情当中是不是一样的，如果这个人太过于善恶分明，看不得那些不好的事情，看不得那些人身上不好的缺点，无法做成事情的，非常难。</span></p><p><span>所以有的时候我们看电视的时候，是不是总在吐槽？明明那个人就是坏蛋，怎么君王就是看不到？不是看不到，而是他能看到那个人好的一面，他用的是好的那一面，他包容的是他不好的那一面，所以会发现只有这样的人才能生育万物的。</span></p><p><span>了凡先生自己总结说，这方面自己是有缺陷的，是有缺点的，是不足的。这里的包容是指的什么呢？只有能容纳那些不好的事情，不好的人的存在，才能生育万物，他的性格跟他没有子嗣是有关联的，了凡先生深深地认识到了这一点，这是他没有子嗣的第一个原因。</span></p><p><span><strong>“和气能育万物，余善怒，宜无子者二。”</strong>没有子嗣的第二个原因是什么？说我性格是善怒的，而和气能育万物。即使是一个植物、花草树木，包括我们种的庄稼，都是需要微风、细雨、暖阳，都是需要和气的这些东西，才能孕育万物。包括我们总讲一句话，和气生财，如果不是在一个和气的、平静的这样的状态和氛围当中，怎么能生起财物呢？</span></p><p><span>我们现在在企业当中也是一样的，即使在一个家庭当中也是一样的，一个家庭的氛围，如果是和谐的、是和气的，每个人在这个地方才能滋养身心。在一个暴躁的、急躁的环境下，人的身心怎么能舒适呢？怎么能生长万物呢？</span></p><p><span>比如说我们静下心来去感受啊，有的企业也好，某一个公司也好，或者是一个家庭，当我们的心静一点的时候，到那个场当中，能不能感受那里的氛围？</span></p><p><span>比如说这个地方好像就弥漫着一种急躁的气息，我到这里就会觉得特别压抑，而有的地方就觉得很舒适、很清静，其实都是和的那个气在。这个气虽然看不到摸不到，但是其实我们是可以感受得到的。</span></p><p><span>这里又开始总结了，只有这种和气的地方、和气的环境、和气的性格，才能育养万物，但是我善怒，没有和气在，所以不能滋养万物，自然也就是我没有子嗣的第二个原因。</span></p><p><span><strong>“爱为生生之本，忍为不育之根，余矜惜名节，常不能舍己救人，宜无子者三。”</strong>开始总结第三个原因，说爱为生生之本，爱是什么呢？就是仁爱别人，帮助他人。忍为不育之根，这里的忍是指的残忍，仁爱的另一面，是不是就是残忍呢？</span></p><p><span>有仁爱之心，另一面对应的就是残忍之心，说我自己太矜惜自己的名节了，太洁身自好，而不懂得舍己为人，不懂得舍己救人，不懂得多去帮助他人。没有仁爱之心， 没有仁爱之心的另一面，就是还有残忍之心，所以说我缺少爱，缺少生生之本，这是我没有孩子的第三个原因。</span></p><p><span>我们从生长万物的角度来讲，不光是孩子，对于其他的事情是不是一样，越是懂得仁爱他人，所拥有的就会越多，包括我们之前讲慈心于物啊，我们疼惜一个花朵，这个花就会反馈给我们，包括我们用这个杯子，我们为什么要讲慈心于物？比如说用它是轻拿轻放的，对它是慈爱的，它就可以回馈给我们啊。</span></p><p><span>生活当中有很多人，是不是用一个东西都是摔摔打打的？一关门啪一下，拿个东西哐一下，当这样做的时候，就能看出来这个人的性情，他是不平和的，这样对待东西，东西就是这样回馈给他的，用完了这个东西，发现它坏了，还是自己要花钱重新去买啊。</span></p><p><span>比如说我们要去注意用东西的时候，会发现手机我们用完两三年，看着跟新的一样，因为爱惜它，我们用每个东西都是一样，当我们懂得爱惜它的时候，它其实也反过来是爱惜我们的，我们用哪个东西都是这样的。</span></p><p><span>这是生生之本，我们要仁爱身边的每一个人，仁爱所有的事情，仁爱每一件东西，会发现这是万物生长的根本。他说我缺少仁爱之心，所以不够生生之本，导致没有孩子的第三个原因。</span></p><p><span><strong>“多言耗气，宜无子者四。”</strong>说我多言耗气，讲话讲的太多了，然后耗气，所以导致我没有子嗣。多言一定耗气吗？不一定，什么样的多言会耗气呢？带有情绪的讲话耗气。我们去想一想，跟一个人发脾气，发了半个小时，讲半个小时的话 耗不耗气？但如果是和风细雨地讲半个小时，耗气吗？不耗气。</span></p><p><span>我们思考，比如说一个人哭，很痛苦，哭半个小时，耗不耗气？哭半小时饿得不行了。但是小孩子哭半个小时没事，为什么呢？孩子哭只是表达一种诉求，就相当于我们说话是一样的，因为他不动情绪，哭是饿了，我又没法表达明白，所以哭，或者尿床了哭，哭只是表达我尿床了或者我饿了，这时候大人一看，喂他点东西，他就不哭了，他的哭是没有情绪的。所以我们只要发脾气，所讲出来的话，就是耗气的。</span></p><p><span>《道德经》讲：“心使气曰强。”只要我们太过用力，带着情绪的就耗气，如果是不带情绪的情况下，是不耗气的。咱们跟着修行时间长的人，为什么一天可以吃一顿饭呢？有的人吃两顿，因为情绪动的少，杂念动的少，故而没有那么大的消耗，情绪动的越多，需要从食物上，补充的能量就越多。</span></p><p><span><strong>“喜饮铄精，宜无子者五。”</strong>铄精就是喝酒，这个人总是喝酒，喝酒就会导致身体不好，这是没有孩子的第五个原因。所以我们现在也是，为什么说计划要孩子的时候，要少喝酒少吸烟呢？就是保持身心健康的这样一种状态。</span></p><p><span><strong>“好彻夜长坐，而不知葆元毓神，宜无子者六。”</strong>说他经常彻夜长坐，而不懂得保养自己的元气，孕育自己的精神，再加上他每天的情绪又比较大，不停地去耗气，耗他的元神，耗他的元气，这是他没有孩子的第六个原因。</span></p><p><span><strong>“其余过恶尚多，不能悉数。”</strong>说其实啊，除了这些还有很多的过失、罪恶和过错，数不完，说不清楚，太多太多了。这个时候的了凡先生有点是走向修行，明白了命运是改变的前期的心理活动。</span></p><p><span>很多朋友跟着学习一段时间，是不是都有这种感受？原来觉得自己哪都很好，学习了一段时间后，突然发现其实身上真的有很多不足，好像总结不完，实在是太多太多了。其实这个时候开始就走上自我修正的路了，他突然反思到其实自己有很多的问题，才导致自己不能登科第，不能有子嗣，他自己反思也觉得这是远远不够的，这个时候开始是反省的时候，当反省过后，也是他自己改变命运的开始。</span></p><p><span>接下来云谷禅师又开始说了，<strong>云谷曰：“岂惟科第哉。世间享千金之产者，定是千金人物；享百金之产者，定是百金人物；应饿死者，定是饿死人物。”</strong>云谷禅师说岂止是考科第这件事情啊，一个人当下所拥有的，都是和我们的福报和德行相匹配的，所以命数里面、命运里面，福德是够千金之产的，定然可以得到这些千金之产，如果不是，应该是饿死的人物，说明福报和德行都是正好匹配的。</span></p><p><span><strong>“天不过因材而笃，几曾加纤毫意思。”</strong>天不曾加诸给我们，任何人一丝一毫，他给我们的都是和当下相匹配的、正合适的。同时告诉给我们两个道理：第一个道理是我们不需要去抱怨天道的不公，他所给我们的都是没有丝毫添加的，都是和我们当下正好相匹配的，但同时又告诉我们不是固定的，不是固定的是什么呢？是我们通过自己的德行和善行，去改变我们的福报。</span></p><p><span>所以《道德经》有一段话：“天道无亲，常与善人”，天道是没有亲疏贵贱的，他所给予的都是善人，只要是善的就是合天道的，他就会多给我们，但是那个多给并不是天加诸于的，而是自己的德行、自己的善行所感召而来。无论我们现在拥有的多或者是少，不需要任何的抱怨，也不需要向外去求索，都是和我们当下相应的，要想改变也很简单，不断地提升自己的德行，不断地去做一些善行，就可以了。</span></p><p><span><strong>“即如生子，有百世之德者，定有百世子孙保之，有十世之德者，定有十世子孙保之，有三世二世之德者，定有三世二世子孙保之。”</strong>刚才说了，岂惟科第，现在又说关于子嗣这件事情，也是一样的，如果我们是有百世的德行的，会发现就有百世的子孙来保自己的产业，来保自己的盛名；如果有十世也是同样的，有十世的孙来保我们的盛名，保我们的德行。</span></p><p><span>《周易》开篇讲：“积善之家，必有余庆；积恶之家，必有余秧。”积恶之家，说明什么？我们所积累的善恶，不光是能改变我们自己的命运，会福泽子孙的。比如说我们再往大了讲一点点，我们说的孔夫子也好，我们说的老子也好，我们说的阳明先生也好，这些古之圣贤，我们现在这些人，都是尊人家为师为父的，所以我们看到有多少人在保他的文化，在保他的思想呢？那是说明人家自己的德行足以感通天地，所以告诉我们，所有的事情都是自己的德行和善业积累而来的。</span></p><p><span><strong>“其斩焉无后者，德至薄也。汝今既知非，将向来不发科第，及不生子之相，尽情改刷。”</strong>说无后啊，说明曾经积累的太少，福太薄了、太少了。今天既然知道了自己的过失和过错，那么就把自己总结的那些不登科第和没有子嗣的原因，进行改刷，改变洗刷，去重新修正就可以了。刚才袁了凡先生总结了那么多自身的不足，不能登科第和没有子嗣的原因，只要尽情地去改刷，尽情地去修正就可以了。</span></p><p><span>所以我们讲，每个人每天自我反省很重要，如果没有自我反省，不知道自己的问题出在哪里？我们又如何修正？我们讲什么叫修行？不就是不断地修正自己的心念、思维、行为吗？如果觉得我自己是骄傲自满的状态，我每天都是很厉害的，我已经做得很好了，又如何去修行，如何去修正自己呢？</span></p><p><span><strong>“务要积德，务要包荒，务要和爱，务要惜精神。”</strong>务，就是一定要。积德、包荒、和爱、惜精神，对应的是了凡先生自己所总结的，不是说自己积累的德行少吗？所以现在一定要去积德；一定要包容不好的那些事情，这叫包荒。自己也说我太好洁，不能包容一些不好的事情，现在一定要懂得去包容这些事情，才能和气，和气才能育万物。务要和爱，一定要有仁爱之心，多去救济他人；一定要爱惜自己的精神，不要常发怒，不要常带情绪，才能葆元毓神，让自己的精气神变得更好，他说自己彻夜长坐，又爱讲话，所以耗气。</span></p><p><span>我们想象一下，如果我们讲话是喊着讲一个小时的、讲半个小时的，累不累？但是如果讲话是绵绵若存的，累不累？所以完全不是一个状态，大家去观察，其实越是往上修行的人，他的性格一定是越和气的，一定是讲话和风细雨的，所以去观察，这是完全相反的两个方向。</span></p></div>"
},{
    "title": "第四讲《立命之学》言力行善事",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第四讲《立命之学》言力行善事</strong></span></p><p><span><strong>“从前种种，譬如昨日死；从后种种，譬如今日生”。</strong>这句话被晚清第一名臣曾国藩拿去用了，曾国藩给自己起了个名字，重新改了叫涤生，就是根据这句话来的，就是洗涤过去自己的不足，重生的意思。以前所发生的事情，相当于全部已经死去了。从后种种譬如今日生，从今天开始我要修正，要改过，要开始新的人生，要重新去立命了，今天是我们重生的日子。</span></p><p><span>其实我们每个人听到这里都一样，过去无论有多少的不足，有多少的过失，那么都是过去的事情，我从今天立正开始，修正自己，开始改过，开始重新的安身立命，那么今天就是我们每一个人重生的日子。</span></p><p><span><strong>“此义理再生之身也。夫血肉之身，尚然有数；义理之身，岂不能格天。”</strong>这里开始总结说了，这是义理再生之身，义理之身指的是什么？我们的精神状态，我们的心性，我们的思维开始重生了，我们这个血肉身躯是不变的，还是我们这个身体，只不过从现在开始，我们的思维不同了，我们的心性不同了，我们的精神状态不同了，所以说今天是我们重生的日子。</span></p><p><span><strong>“夫血肉之身，尚然有数。”</strong>说我们的血肉之身，还有一定的定数在，义理之身，岂不能格天，可是我们的精神状态，我们的心性，我们的思维，这些义理之身，是可以格天的。格是什么意思呢？就是和天地相感应，和天地是相通的，只要我们的精神状态开始重新思维，我们的心性开始变化，我们就会感动天地，和天地相应，这是我们重生的日子。我们的思维变了，心性变了，行为自然就会跟着发生变化，那么命数也会自然跟着发生变化。</span></p><p><span><strong>太甲曰：“天作孽，犹可违；自作孽，不可活。”</strong>太甲是《尚书》里面的一篇，告诉我们什么呢？天作的孽是可以避开的，所谓的天给我们的定数、给的命数，我们是可以避开可以改变的；但是自己的过错是躲不掉的，所做那个事情，注定了那个结果，这个是不可避开的，因为是自己做的行为所感召的结果。</span></p><p><span><strong>《诗》云：“永言配命，自求多福。”</strong>《诗经》上说了，永言配命的意思是我们永远要懂得明白一个道理，我们自己当下拥有什么都是和我们当下的行为相匹配的，我们越是明白这个道理，就要自求多福，要懂得自修、自求、自正，要懂得我们无论现在拥有什么，都是和自己的福报、福德相匹配的。</span></p><p><span>我们越是懂得这个道理，就要向内求，而不是向外求，所以叫自求多福。自古以来这些圣贤的道理都告诉我们如此。无论从《尚书》、《诗经》、《礼记》，所有的四书五经都在讲这个道理。</span></p><p><span><strong>“孔先生算汝不登科第，不生子者，此天作之孽，犹可得而违。”</strong>所以孔先生给你算定的，不登科第，不生子者，这些事情对不对呢？也对，算的也准，但是要知道，这是天作之孽，也就是上天注定的，这些事情是可以违的，是可以改变的，不是不可改变的，怎样改变？整个《了凡四训》讲的就是这个道理，那么接下来要继续说了。</span></p><p><span><strong>“汝今扩充德性，力行善事，多积阴德。”</strong>说你今天要怎么办？不断地扩充自己的道德，扩充自己的行为，扩充自己的天性，这叫扩充德性。性，是一个属性，只是把德加大。举个例子，我们经常说一个人，这个人很有惰性，其实形容的是什么？是我们太懒惰了，形成的一个惰性。我们说一个人身上都是痞性，性是一个形容词，是一种属性，它形容的是痞，总是痞痞的坏坏的样子，我们扩充自己的德性啊，就让自己内在的德行变得更好，行为更符合德，更懂得厚德载物，所以这叫德性。</span></p><p><span><strong>“力行善事”，</strong>就是我们要身体力行地去做善事，多积阴德。什么叫阴德？不被人知的，别人看不见的叫阴德，看得见的叫阳善，“积阳善享世名，积阴德天报之”。做这个好事情，阳善都是被别人看见的，所以就享世名，别人都说这个人好；但是积阴德天报之，天会回报给我们的。</span></p><p><span><strong>“此自己所作之福也，安得而不受享乎？”</strong>我们不断地身体力行，不断地去扩充自己的德性，这是我们自己所作之福，怎么会自己不享受呢？告诉我们天作之孽啊，那个是可以改变的，但是如果自己通过修正自己的行为，让自己变得更好，去积累更多的德行，我们是可以改变自己的命运，自己去享受的。</span></p><p><span><strong>“《易》为君子谋，趋吉避凶。”</strong>《易经》是为君子谋划事情的。“趋吉避凶”，就是可以走向吉，避开凶的。自古以来的圣贤都去学《易经》，为什么呢？就是可以趋吉避凶。《易经》实在是包罗万象，但是圣人君子用《易经》来做什么呢？为自己谋划吉凶，作为自己的行为准则，他是一门告诉我们如何做圣人的学问，实在是包罗万象。</span></p><p><span>所以圣贤都是按着《易经》的道理告诉自己的，约束自己的行为的，告诉我们“《易》为君子谋”。所以《易经》这部书是不是很有意思？齐家治国平天下可以用，圣人按照《易经》的规律去做，就可以成为圣人。用之不完，取之不尽，只不过我们从里面取了什么拿来用，这里都是修行之人讲的都是趋吉避凶的道理。所以说《易》是为君子谋划事情的，我们要懂了《易经》，我们自己到了哪一步，甚至接下来要发生什么事情，里面告诉我们的清清楚楚。</span></p><p><span>所以用《道德经》的话，<strong>“其未兆易谋”，</strong>未发生的事情我们容易谋划，为什么咱们做很多事情的时候都会提前讲一些事情，即将发生的事情还没发生，我们就开始修正了，这都是《易经》教给我们的道理。</span></p><p><span><strong>“若言天命有常，吉何可趋，凶何可避？”</strong>如果说天命一定是固定的，那还怎么趋吉避凶呢？这告诉我们不是固定的，所以《易经》才为君子谋划，是可以趋吉避凶的，告诉我们所有的事情是可以改变的。</span></p><p><span>开章第一义，便说：“积善之家，必有余庆。”汝信得及否？余信其言，拜而受教。这里指的是《易经》开章第一义就讲，积善之家，必有余庆，你是不是信得过？我相信了云谷禅师所讲的话，所以拜谢而受教 。</span></p><p><span><strong>“因将往日之罪，佛前尽情发露，为疏一通，先求登科，誓行善事三千条，以报天地祖宗之德。”</strong>说跟云谷禅师对话以后，我相信云谷禅师讲的话，拜而受教。从今天开始我要去改正，于是做了一个书文，表达自己的诚意，告诉我过去做的这些不足，接下来我想求的事情，我先求登科。之前不是说他命里不能登科第吗？</span></p><p><span>这里的关键点来了，人家也在求，我们有的时候也在求，但是求和求不同，我先求科第，但是誓行善事三千条。我们看人家是怎么求的呢？不是求完就可以了，很多人是不是只忏不悔，什么叫悔？是重新改正叫悔。夫妻吵架是不是也这样的？吵完之后“我后悔了，我以后再也不干这样的事情。”说完了还干呀，这就是只忏不悔。</span></p><p><span>修行当中很多人是不是也是这样的？“我错了，我知道我的不足，我有很多问题。”自己说的还很乐呵，这是一种什么心态？我说自己的不足好像是一个很光荣的事情，不觉得惭愧吗？</span></p><p><span>如果觉得惭愧，要知道说出来自己的不足，我真的是要悔过的，要去修正的，而不是去乐呵呵，自己每天说天天说，自己都已经不当回事情了，我也不去修正了，那不行的。</span></p><p><span>所以这里面不光求啊，“我誓行善事三千条”，说白了是我拿行善的这个事情，我是向内求的，我是行为要发生变化的，而不是求完就可以了，不是求完就回家等结果去了。</span></p><p><span><strong>“云谷出功过格示余，令所行之事，逐日登记，善则记数，恶则退除。”</strong>云谷禅师给他一个功过格，就是一个表格形式的格子，告诉他用来记录自己的善恶，行善就记上一个，行恶就去除一个。</span></p><p><span>今天我做了三件善事，做了一件恶事，就相当于做了两件。认真地把每天的行为，都实实在在地记录下来，以警示自己，时刻提醒自己的善恶和行为。</span></p><p><span><strong>“且教持准提咒，以期必验。”</strong>同时教给他一个咒，叫准提咒，希望以后可以灵验这件事情。准提咒是什么？是得清静的一个咒语，当一个没有修行过的人，我们的心里有很多的念头，是不清净的，我们持这样一个咒，其实是为了让自己的心念变得更清静。因为只有我们的念头更清净，情绪动得才越少，这个时候我们看自己的行为才越清晰，当情绪上来的时候，还能看到善恶吗？看不懂了，我们发脾气还觉得那是善的，所以这里教给他的咒，是为了让他自己的心变得更清静的咒。</span></p><p><span><strong>语余曰：“符箓家有云，不会书符，被鬼神笑。”</strong>符箓家就是画符的人，说一个符箓家，如果不会画符，是要被鬼神耻笑的。“此有秘传，只是不动念也。执笔书符，先把万缘放下，一尘不起。”说画符咒的秘法，秘传是什么？不动念头，把万缘都放下，一尘不起，就是一念不生，画的符才灵，如果中间是动念的，画符是不灵的。</span></p><p><span><strong>“从此念头不动处，下一点，谓之混沌开基。”</strong>如果念头是不动的，是一尘不起的，当下笔的这一刻，这一点是打开混沌的根基和基础，那混沌是什么状态呢？就是模糊一片的，分不清楚的状态叫混沌。</span></p><p><span>只有把万缘放下，才能理清头绪，这一刻是清净的，才能画符。其实我们做任何事情是一样的，为什么我们前期要经过很多的方法，做这些方法都在干嘛呢？是让我们的念头得片刻清静。</span></p><p><span><strong>“由此而一笔挥成，更无思虑，此符便灵。”</strong>这一笔画成之后啊，没有任何的思虑，符才灵，如若不然，符是不灵的。“凡祈天立命，都要从无思无虑处感格。”通过符箓这件事情，告诉我们这个道理，凡是祈天立命也是一样的，都要从无思无虑处感格，都要万缘放下，念头不起，这个时候和上天才是相感应的。</span></p><p><span>包括我们学儒家文化也好，去看道家文化也好，或者看电视也好，看古代的那个时候的祭祀天地是不是也是这样的？都提前要斋戒，然后自己要清静一段时间，这个时候才能祈天立命的，其实都是为了把那些杂乱的、琐碎的念头和情绪放下，保持清静的状态，这个时候才是管用的。</span></p></div>"
},{
    "title": "第五讲《立命之学》修身以俟命",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第五讲《立命之学》修身以俟命</strong></span></p><p><span><strong>孟子论立命之学，而曰：“夭寿不贰。”</strong>孟子讲的立命之学，告诉我们夭寿不贰，夭是什么？就是短命。寿是长寿，告诉我们其实短命和长命没有区别，为什么会这个样子？</span></p><p><span><strong>“夫夭寿，至贰者也，当其不动念时，孰为夭，孰为寿？”</strong>本来夭和寿是两个方向，为什么我们会觉得夭和寿有区别？是我们的念头在动啊，所以才觉得有区别，如果我们的念头不动处，夭和寿又有何区别呢？为什么会有好吃和不好吃的分别？是我们的念头在动；为什么有善和恶的标准？是我们的念头在动。</span></p><p><span>阳明先生讲：“无善无恶心之体”，心的本体是没有善恶的，“有善有恶意之动”，意就是念头啊，是我们的念头在动，所以才有了善恶的标准。</span></p><p><span>举个例子，我们人是不是都喜欢蜜蜂啊？因为它采蜜，这是从我们人的角度，我们喜欢蜜蜂，我们猜蜜蜂喜不喜欢人呢？为什么喜欢人呢？（因为人喜欢它啊~）关键点来了，我们喜欢它，它就一定喜欢我们吗？人家蜜蜂辛辛苦苦地采蜜，都被我们霸占了，它还喜欢我们啊？我们念头动处，因为我们喜欢它，是因为它可以带来蜜，它不喜欢我们，是我们剥夺它的蜜。人和蜜蜂的念头不同，是不是喜欢和不喜欢，善恶就不同。</span></p><p><span>再举个例子，大多数人是不是都喜欢花？猜猜花喜欢我们吗？花开的正艳，我们就据为己有了，拿到家里几天开始枯萎了，哪来的善恶好坏，喜欢和不喜欢，只是念头不同而已。我们放在人身上、放在事身上不是一样吗？为什么我们那么多的痛苦？我喜欢他，他就一定要喜欢我，否则我就痛苦，不一定的，大家念头不一样。</span></p><p><span>我们喜欢吃这个他喜欢吃那个，执着的人就会怎么样？我喜欢这个才是好的，我喜欢这个才是对的。</span></p><p><span>谁不爱美？就有人不爱美。谁不爱喝红茶？就有人喜欢喝绿茶呀。都是我们这些念头在动，所以才分出来那么多的善恶、好坏、是非、高兴与不高兴，开心与不开心，当我们的念头不动的时候，哪有对立？夭和寿又有什么区别呢？没有区别的。</span></p><p><span>孟子说：“夭寿不贰。”庄子说：“万物一体。”其实都一样，圣人讲的都是至真、至纯的道理，只不过我们的念头不停地在动，所以我们才认为有分别。当我们念头不动处，是没有分别的。</span></p><p><span><strong>“细分之，丰歉不贰，然后可立贫富之命。”</strong>接下来往细的讲，丰是什么意思？是富足的意思，歉就是贫乏、不够、不足。所以细分之啊，其实丰歉也没有区别。当我们明白这个道理，念头不动处，念头不起分别，富足和贫乏是没有区别的，是不贰的，是一样的。接下来我们才可立贫富之命，什么概念？</span></p><p><span>孟子说：“夭寿不贰。”下面还有一句，“修身以俟之，所以立命也。”说夭寿是不贰的，没有区别，但是我们要怎么办，修身以俟之，俟就是等待的意思，所以立命也。懂得夭寿不贰这个道理是为了什么呢？是为了不起分别心、不起情绪，那么接下来，修身以俟命，以等待天命，所以这个叫立命之学。</span></p><p><span>当我们懂得富足和贫乏，是没有区别的，当我们有了这个思维以后，就会明白这个道理了。无论当下的贫或富，都是和自己的当下相匹配的。我们明白了这个道理，才能“素富贵行乎富贵，素贫贱行乎贫贱”，这是《中庸》里的话。</span></p><p><span>当我们有这个思维，不起情绪的时候，才能踏踏实实地种因和努力。当我们每天的情绪在动，每天都生活在抱怨当中，说：“他为什么条件那么好？他不上班怎么还有钱花呢？她不就是因为长得好看，找了一个好的老公吗？”我们每天的念头，都在这些杂乱的事情里面相缠缚，又怎么能安身立命？</span></p><p><span>我们如果不懂得把自己的身安下来，不懂得踏踏实实地努力，修正自己的德行，又如何立命呢？所以先告诉我们一个道理，要先明白不贰，什么叫不贰？是我们的念头不动，故而不贰。当明白不贰以后，情绪没动，才能懂得把身安下来，踏踏实实地去努力。</span></p><p><span><strong>“穷通不贰，然后可立贵贱之命”，</strong>道理是一样的，无论我们是穷困的还是发达的，其实我们念头不动，是没有区别的。当我们念头不动，情绪不起的时候，这个时候才可立贫贱之命。</span></p><p><span>这个贫贱指的是什么？是内在的品格，有的人说我很贫穷，我就没有自信了，是不是还是我们的念头自己认为的呀？要懂得情绪不动的时候，其实是没有区别的，这个时候才能安身立命，我们才懂得素其位。</span></p><p><span>比如说，关于有钱没钱，不也一样吗？当我懂得其实贫富无贰，没有区别，这个时候我有钱，我就多花一点，没钱我就少花一点，我也不低人一等。</span></p><p><span>看到比我没钱的，我也不笑话人家，看到比我好的，我也不比他差什么，就是不卑不亢的境界。当我们懂得这个道理的时候，是不是才能安静得下来，自己不停地去努力。</span></p><p><span>我没有他过得好说明什么？我自己的德行和善行不够，那我就踏踏实实地去积累德行、积累善行就好了。那我看到他过得不如我，我也不笑话他，他当下的福报就是到了这个层级的，那我能帮助的，就去帮助一下，我还能把这个道理告诉给他，这个时候情绪是不起的。</span></p><p><span>要不然人们每天都在情绪当中，每天都在念头当中，看到比自己优秀的就没有自信，看到比我们不优秀的就产生傲慢之心，这一段整个从《孟子》里面延伸出来的，实在是一个修行极妙的点。</span></p><p><span>夭寿不贰，然后可立生死之命，所以夭寿不贰，他是可以立生死之命的，当我们明白念头不动，夭寿是没有区别的，不需要向外去求任何事情的，这是安身立命之本。</span></p><p><span>人生世间，惟死生为重，<strong>曰：“夭寿，则一切顺逆皆该之矣。”</strong>人生在世，惟有生死是大事。我们老百姓是不是常讲这句话？这里面会发现，当我们一旦听懂了，连生死都是小事，哪有那么多的执着、痛苦和困扰呢？</span></p><p><span>我很喜欢的一句古诗，里面有两句话：<strong>“人生不满百，常怀千岁忧”，</strong>所以为什么我们那么多的烦恼和痛苦？人生还不满百岁，好像把一千年的事情都要忧虑，都要操心，每天那些妄念相缠，故而产生了那么多的烦恼痛苦，导致身心都不健康。</span></p><p><span>当我们把生死都看淡的时候，会发现一切顺逆都包括在内了，皆该之矣，该是包括的意思，我们把生死已经不在乎了，夭寿都已经不贰了，我们能安身立命、踏踏实实地做好当下，还有什么事情呢？</span></p><p><span>一切顺逆都在其中，遇到顺境的时候，我们也不用过于骄傲，为什么呢？它都是我们当下所得，还要再接再厉，遇到逆境的时候也同样了，不要有什么困苦抱怨，还是我们当下积累不够，那就踏踏实实地去积德累行就好了。</span></p><p><span>“至‘修身以俟之’，乃积德祈天之事。”至于修身以俟命这件事情，乃是积德祈天之事，什么叫俟？就是等待，当我们念头不动处，不停地去积累因，不停地让我们的行为变得更好。以俟之是等待，至于结果，顺其自然。我们每天不停地去修正自己，不停地做着好的事情，至于结果顺其自然就好了，这个时候每天做事情，就没有所求，我们才能淡定从容的。</span></p><p><span><strong>“曰修，则身有过恶，皆当治而去之。”</strong>说什么叫修呢？我身上有很多的过错，罪恶和不足的时候，皆当治而去之，治就像治病一样，说我们身上有过错，有不足，好比是我们身体得病了，马上要把它治，把它去除，这叫修。</span></p><p><span>绝对不是我意识到了自己的不足，还是保持那个样子，就好像我们身体得病了是不是要去治？要接着去治的，不是发现我有病，然后就这样了，不会。修行不也一样吗？我们有过失有不足的时候，我们接下来就去治，去修正就好了。</span></p><p><span>“曰俟，则一毫觊jì觎yú ，一毫将迎，皆当斩绝之矣。”俟是等待，怎么等待？ 一毫觊觎 ，就是一点非分之想都没有，这叫俟。一毫将迎，就是急着想要就将迎。举个例子，现在外面要来一个人，这个人来我们很在意他、很重视他，是不是就将迎的状态，就好像我等着他快点到、快点来吧。</span></p><p><span>我们看做一件事情的结果是不是一样的？说我今天做了一个好事，就在那将迎，结果怎么还不来，怎么还不到啊？很多人都会问这种话：“老师，我都读了一本书，我怎么还没有改变命运呢？”这就叫将迎，所以一点急着想要的这种心态都没有，这个叫俟。只要有非分之想和急着想要的这种心态，皆当斩绝之，就把这些念头都要断掉，这个才叫俟。</span></p><p><span>我特别喜欢《中庸》里的一句话：“君子居易以俟命，小人行险以徼幸”，孟子所讲的这段话，跟《中庸》的这段话，是类似的道理。俟是什么，一点都不将迎，一点非分之想都没有。我们不停地去努力积累自己的德行，积累自己的学识，积累自己的智慧，等待天命就好了，没有一丝的非分之想，也不急着想要。只有这样，我们每个人才能变得淡定从容，当我们做一点事情的时候，就期盼着结果，痛不痛苦？</span></p><p><span>我们的念头不停地动，付出一点东西的时候就想要回报，看看，痛不痛苦？我们会发现，每天都是这些妄念在动，所以才导致我们那么多的烦恼痛苦，然后我们的期盼一旦产生，就会产生失望的情绪，期望越多失望就会越大。</span></p><p><span>“到此地位，直造先天之境，即此便是实学。”到了这个地步啊，就达到了先天，就是最初的状态，这个叫真才实学，也才叫修行。所以我们一直在讲，是踏踏实实地用功夫修正自己的心念、思维和行为的，这个才叫真才实学。也只有不断地通过我们的身体力行，我们的人生才会发生变化，我们的智慧才会增长，这也是为什么要讲《了凡四训》这本书的意义。因为他通过自己的经历，是不断地去修正，去身体力行的。</span></p><p><span>“汝未能无心，但能持准提咒，无记无数，不令间断。”说了凡先生现在还未能无心，就是他的念头还在一直动，所以怎么办？教给他准提咒，是为了安心的，让念头不要乱跑，然后无记无数，不要记数，只要有时间就持，只要有时间就持，不要间断。</span></p><p><span>现在会发现我们的杂念是不是已经很少了？做事情就是做事情，但是一开始做不到的，每天有不少的念头起，就是这里讲的未能无心，所以持咒就是以一念灭万念，但是我一开始就说过，终究非究竟的法门，只是那个阶段的方法而已。</span></p><p><span>“持得纯熟，于持中不持，于不持中持，到得念头不动，则灵验矣。”所以持到什么程度呢？于持中不持，于不持中持，就是当我们持到一定的程度，坐在这里，心里面自然而然地就在持咒，这叫心念耳闻。</span></p><p><span>就是心里在不停地持咒，耳朵自己能听到，但是别人是不知道的，甚至自己都不知道自己在持咒，这个状态就到纯熟了。一旦到这个状态，念头动的就少了，这个时候开始则灵验矣，这个是一种什么概念呢？</span></p><p><span>跟大家举个例子，比如说我们在做饭的过程当中是一样的，一旦做到纯熟，就会达到什么境界？不需要记着下一步做什么，自然而然的感觉就在里面，就像开车一样，一旦开着纯熟了，会发现不需要记得步骤的，甚至我什么时候换的档，什么时候踩刹车，我都不知道，浑然一体。</span></p><p><span>这个时候就到纯熟的境界了，就像我们讲东西不也一样吗？当我们讲到纯熟的境界，随便讲，要是不纯熟就得按套路讲，这个讲完必须得讲那个，那个讲完必须得讲那个，其实不用的。</span></p><p><span>武林高手，一旦修为和内功达到一定境界的时候，他这个招式翻过来、正过来都能用，怎么都能用。别人就很纳闷，说华山剑法还能这么用？可以啊，还能倒着练，因为他的境界达到了一定修为，就是这个样子。所以加倍地努力，不停地用行动去修正自己不足的地方就够了。</span></p></div>"
},{
    "title": "第六讲《立命之学》善行皆遂缘",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第六讲《立命之学》善行皆遂缘</strong></span></p><p><span><strong>“余初号学海，是日改号了凡；盖悟立命之说，而不欲落凡夫窠臼也。”</strong>从这里才开始改名字的，说之前叫学海，现在号了凡，为什么呢？接下来说，明白了立命之说，以前我理解的是不对的，现在我了解什么叫安身立命了，这个时候怎么办呢？</span></p><p><span>不想落进凡夫的窠kē臼jiù ，这个窠是什么？就是我们以前说的鸟巢，臼是以前有点像盆，倒米用的那个东西，鸟巢和窠臼长的都差不多，就是意思不想落入俗套，所以为什么叫了凡呢？就是想了脱凡夫的境界，不想被这些命运、这些俗套的东西，捆绑得死死的，所以才改号了凡。</span></p><p><span><strong>“从此而后，终日兢兢，便觉与前不同。”</strong>说从此以后，我每天开始小心谨慎的，便感觉跟从前不同了。记不记得他从前是什么样子？开篇就讲了，终日静坐，不做文字，心灰意冷的状态，就是放弃了，放弃抵抗了，我的命运就是这样的，就是在那个窠臼里面，说我已经牢牢地捆在这里了，即使有妄想也没有用，我也什么都不想了，我也不努力了，连学习都不学了。</span></p><p><span>所以这个时候会发现，从此以后叫了凡先生，要了脱凡夫的窠臼。我们想一想一个人，原来是心如死灰的状态，现在对人生、对未来、对生命充满了希望，自然是不同的。</span></p><p><span><strong>“前日只是悠悠放任，到此自有战兢惕厉景象。”</strong>说以前都是悠悠放任的，就是很放纵自己啊，每天什么都不做，每天很消极的状态。现在开始不一样了，每天很恭敬、很惧怕、很谨慎，因为讲了这些，他明白原来命运都是自己造的，福都是自己求的，开始变得小心谨慎，开始变得对什么事情都有恭敬之心，开始变得有敬畏之心了。这时候也懂得开始约束自己的行为了。</span></p><p><span>以前是不是他不懂得约束自己的行为的？一个是终日静坐，还善饮酒，经常喝酒，总善怒，还总苛责他人，还高傲自大。从这开始，每天都是很恭敬的样子了。</span></p><p><span><strong>“在暗室屋漏中，常恐得罪天地鬼神。”</strong>即使在暗室，没有人的地方啊，也很注意自己的行为，怕得罪天地鬼神。所以我们老话常讲：“举头三尺有神明。”就是我们做的事情都是被天地所知的，因为我们的福报、业果，都是和自己当下的行为所产生和匹配的，即使在没人的时候，也很注意自己的行为。用儒家的话讲：“十目所视，十手所指，其严乎”。就是我们的行为是被很多人看着的，所以儒家告诉我们修慎独啊，是不是了凡先生也在修慎独啊。</span></p><p><span><strong>“遇人憎我毁我，自能恬然容受。”</strong>即使遇到很多人诋毁我、讨厌我，我也能安然自得、很坦然地去接受。这时人就有一定的境界了，比如说别人不喜欢我、很讨厌我，我也很坦然地去接受，为什么呢？</span></p><p><span>第一层来讲，别人还讨厌我们，就说明我们身上还有这个问题；第二层，别人即使讨厌我们，与我又有何干呢？为什么会讨厌我？只是我现在的说话方式，或者我们的某一个行为，是他不喜欢的而已，我们又不可能做到人人都喜欢我们。有的人说了，他为什么长这么胖？有的人又说，他怎么长那么瘦？真讨厌。</span></p><p><span>只是不合他的标准而已，我们又有什么可烦恼和痛苦的呢？有的人说：“你说话好慢，说话快点。”那我要说快了，又有人说我说话好快，宝宝到底要怎么做嘛？所以要懂得这个道理就好了。</span></p><p><span>第一层刚才说了有人讨厌我们，说明我们有这样的问题，我们可以努力地去修正，第二层又告诉我们，其实我们也不用过于执着，只要自己做事情问心是无愧的，合道德就好了。当合了道德，说话快慢不是错，胖瘦不是问题，所以是两项的。</span></p><p><span>一个我们要自省，就是我们这方面是不是真的有问题的；第二个是什么？只要自己是无愧于心的，不违道德的、不违良善的就够了。这个时候了凡先生开始无论遇到什么事情，都很坦然地去接受了，以前不是，他是善怒的。</span></p><p><span><strong>“到明年礼部考科举，孔先生算该第三，忽考第一。”</strong>从这开始命运改变了，这说明什么呢？他只修了一年，命运就开始发生变化了，第二年考试的时候，原来算定我应该考第三，突然考第一。可以想象他这种心情，这么多年，二十几年，命运终于改变了。之前二十年不曾改变丝毫，这一年，整个命运开始发生变化了，所以行善积德、修正自己的力量该有多大。</span></p><p><span><strong>“其言不验，而秋闱中式矣。”</strong>这个时候开始，孔先生算的不对了、不准了，那是不对和不准吗？他算得很对、很准，只不过了凡先生通过他的行为，把命运改变了。所以说，其言不验，秋闱就是秋天的乡试，他考中了举人。</span></p><p><span>这个时候开始自我总结，“然行义未纯，检身多误”，但是我自己反思反省了一下，我做事情还有点勉强，检查自己的时候，还有很多的错误和过失，他修了一年以后，会发现反思自己的问题，更深、更准了。</span></p><p><span>接下来自己说，都哪些不足呢？“或见善而行之不勇，或救人而心常自疑”，有的时候见善行起来，还是不勇敢，不够干脆；有的时候，救了人以后，还常常自我怀疑，常常后悔。</span></p><p><span>举个生活当中的例子，我今天做了一个什么事情，明明看到谁不太好，我去帮了一下，帮了之后我又开始自我怀疑、自我犹豫，是不是我不该帮他？帮完又后悔了，是不是不帮他好了？今天帮他之后，他可能过后不一定感激我，是不是我帮错了？还有这么多的念头在动。</span></p><p><span><strong>“或身勉为善，而口有过言。”</strong>这个是我们常犯的问题，有时我们身体的善行，虽然做了，但是口上还是喋喋不休。有很多家庭当中是不是这样的？我明明自己很辛苦把这个事情也做了，然后一边说一边叨叨，尤其是我们母亲那一代的人，常常这样，明明好事做了，可是嘴上说个不停，还犯很多过错。所以，了凡先生也这个样子。</span></p><p><span><strong>“或醒时操持，而醉后放逸。”</strong>这时了凡先生还在饮酒，说我清醒的时候，还在行善事，可是喝醉了以后呢，就开始放纵自己了。所以为什么说人要少饮酒，不能饮醉，因为醉后是无德的，喝酒后容易冲动，就开始失了德行。</span></p><p><span><strong>“以过折功，日常虚度。”</strong>说我这些功过相抵啊，还是浪费了很多时间的，都虚度了。想一想我们有多少时光都是虚度的？需要我们每个人自己去反思的。</span></p><p><span><strong>“自己巳岁发愿，直至己卯岁，历十余年，而三千善行始完”，</strong>这里说的己巳岁，是一五六九年， 到了己卯年呢，一五七几年了，已经经历了十余年，说三千善事始完，就是十年做了三千件善事。</span></p><p><span>好比是人们现在常讲的日行一善，十年正好三千多件。因为他做的是功过格啊，其实他做的善事，不止三千件，过错的地方，他还在往下减，一共例行十年，才把三千件善事做完。这时了凡先生自己讲，其实很多光阴还是虚度了，从这开始，他更加的对自己严格起来。</span></p><p><span><strong>“时方从李渐庵入关，未及回向。庚辰南还，始请性空、慧空诸上人，就东塔禅堂回向。”</strong>李渐庵是个人名，跟这个人从关外回来，没有来得及回向，就是把自己所做的功德、善行、智慧回向给某些特定的众生，或者某一个人。这个时候从北京往南又回来，回来以后请了两位上人，什么叫上人？就是有道德、有修为的出家人，然后帮助他在东塔禅堂这个地方去回向。</span></p><p><span><strong>“遂起求子愿，亦许行三千善事。辛巳，生男天启。”</strong>开始发新的愿了，想求子，因为之前不是说过，他命中无子嗣吗？同样许下了善行三千，这时才生了个儿子，取名天启。因为是家训，是给他的儿子讲。</span></p><p><span><strong>“余行一事，随以笔记；汝母不能书，每行一事，辄用鹅毛管，印一朱圈于历日之上。”</strong>每行一件善事，就拿笔记录下来。你的母亲不识字，她每做一件善事，就用鹅毛管蘸着红色的墨，在日历上去画一个圈，以做记录。人家做善事，是多么诚心，能记的用笔记，不能用笔记的，她用鹅毛管在画圈做记号，“心诚求之，虽不中不远矣”。</span></p><p><span><strong>“或施食贫人，或买放生命，一日有多至十余圈者，至癸未八月，三千之数已满。”</strong>他们每天做事情，或施食那些贫困的人，给他们一些吃食或放生，买放一些生命，有的时候一天可以画十余圈，就说明一天可以做十余件善事善行。做三千件善事，之前用了十年，这次做了三千件善事，只用了三年，这个速度在大大地提升。</span></p><p><span><strong>“复请性空辈，就家庭回向。九月十三日，复起求中进士愿，许行善事一万条，丙戌登第，授宝坻知县。”</strong>我又请性空上人到家里，把这些三千善行去回向，因为之前不是说，他不能登科第，没有子嗣，这时他已经有了子嗣，但是呢，他不能登科第，他开始想求登科第，这次许了善事一万件。</span></p><p><span><strong>“丙戌登第，授宝坻知县。”</strong>丙戌年是一五八六年，我们会发现这次更快，三年又做了一万件善事，他就开始做宝坻知县了。现在天津有个宝坻区，要是有天津的朋友应该知道，那个时候叫宝坻县，很富裕的一个地方。</span></p></div>"
},{
    "title": "第七讲《立命之学》了凡悟立命",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>第七讲《立命之学》了凡悟立命</strong></span></p><p><span><strong>“余置空格一册，名曰‘治心编’。晨起坐堂，家人携付门役，置案上，所行善恶，纤悉必记。”</strong>就找一个本，起名叫治心编，用来记录自己的善恶，记录自己的行为。因为那个时候，已经开始做宝坻知县了，每天去朝堂的时候，都把治心编带着，身边的下人携付门役是带到公堂之上，交给那里的衙役，自己放在办公的案子上。所有自己所做的这一天的善恶，都把它记录下来，无论大小，这是白天所做的事情。</span></p><p><span><strong>“夜则设桌于庭，效赵阅道焚香告帝。”</strong>到了晚上的时候，摆一个桌子在自己的庭院，赵阅道是人名，宋朝的，当时人称‘铁面御史’，那时他也是焚香告帝，就是祈祷上天，告诉我自己的行为是端正的，天地可鉴。所以可见他这时候的诚心。有人的时候，让其他的人来监督，没有人的时候自己祈祷上天，说我的心、我的行为，是天地可鉴的，做的堂堂正正。</span></p><p><strong><span>汝母见所行不多，辄颦蹙曰：“我前在家，相助为善，故三千之数得完。”</span></strong><span>虽然他每天记录自己的善恶，可是这个时候，说你的母亲啊，见我所行不多啊，经常眉头紧皱、很着急的样子、很忧愁的样子，为什么忧愁呢？每天所做的善行还不够，说我以前在家，会经常帮助做一些善事，所以三千件善事做完了。</span></p><p><strong><span>“今许一万，衙中无事可行，何时得圆满乎？”</span></strong><span>说你的母亲为什么每天很忧愁呢？以前在家还好，我还能帮助去做一些善事，今天又许了一万件，可是我在衙中，实在没有什么事情可做，没有去行善的机会，这什么时候才能做圆满？</span></p><p><strong><span>夜间偶梦见一神人，余言善事难完之故。神曰：“只减粮一节，万行俱完矣。”</span></strong><span>说晚上做梦，梦见了一个神仙，我就告诉他了，为什么这一万善事不好完成，原因之前已经说了。晚上做梦的时候，神仙对他讲，只减粮这一件事情啊，一万件已经做完了。因为减粮这件事情，实在是利益了很多人民的事情。</span></p><p><strong><span>“盖宝坻之田，每亩二分三厘七毫，余为区处，减至一分四厘六毫，委有此事，心颇惊疑。”</span></strong><span>这个时候他说，确实有这件事情，是我到了这里做宝坻知县的时候，给人们减少了很多税收，这件事情确实是有的，就是了凡先生这个时候心里自己也有疑虑，疑虑是什么呢？</span></p><p><span>说这件事情我确实是做了，但是他怎么就变成一万件善行了呢？这个时候他还不觉得自己做这件事情的功德有多大，就做了这样一个梦，是不是日有所思，夜有所梦？</span></p><p><span>白天他还在想善事什么时候能做完？许了这么多件，晚上就梦到了这个事情。</span><span>这就是心诚的感应啊，感应是相通的，因为他心很诚，很虔诚。</span></p><p><strong><span>“适幻余禅师自五台来，余以梦告之，且问此事宜信否？”</span></strong><span>正好这个时候，有一位幻余禅师，从五台山到这里来，我就把整个梦里的这件事情，问了禅师，这个事情可信吗？</span></p><p><strong><span>师曰：“善心真切，即一行可当万善，况合县减粮，万民受福乎？”</span></strong><span>说一个人做事情，当善心真切的时候，一行即可当万善，何况全县减粮这样大的事情，所有的人民都跟着受益的，说白了当然是可信的。因为他的善心本身就真切，又做了这么多利民的事情，这么大一件利民的事情。梦到的是对的，一万件善行，到此已经圆满了。</span></p><p><strong><span>“吾即捐俸银，请其就五台山斋僧一万而回向之。”</span></strong><span>说我把自己的俸禄，布施给了幻余禅师，让他回五台山去斋僧一万，把这些一万件善行，再去做回向。</span></p><p><span>了凡先生这一路走来，他是至真至纯的，无论他的心念、他的行为都是很真切的，他的命运才会得到极大的改变。这里面有个非常关键的词，叫善心真切。说他的善心即真又切，切是什么意思，急切，他的善心又真又很着急，很愿意很虔诚地去做事情，善心真切是会产生非常大的力量。</span></p><p><strong><span>“孔公算予五十三岁有厄，余未尝祈寿，是岁竟无恙，今六十九矣。”</span></strong><span>当时孔公算定我五十三岁，寿终正寝，我并没有祈请自己的年龄，我并没有求长寿，竟然无恙，今天已经六十九了。我们再深一层讲，当他没有所求的时候，没有求寿，反而他的功德更大了，包括减粮这件事情。</span></p><p><span>大家要明白，这里有一个非常玄妙的点，他并没有认为，我给人民减粮会有这么大的功德，故而他才有了那么大的功德。到这里我们再上升一个台阶，上升一个思维高度，之前了凡先生在做善行的时候，心心念念的是想着回报的，是想着改命的，可是到这里他已经不再着相了，做善事已经不觉得有那么大的善行了，甚至自己没有祈寿，却得了长寿。当我们做事情越是这样的，我们越不求回报，反而回馈是更大的。</span></p><p><span>《书》曰：“天难谌chén ，命靡mí常。”《尚书》有云，这个谌是什么意思呢？是相信的意思。命靡常，靡常就是不固定的，天是难以相信的，命运也是不固定的，这里他指的难以相信。我们常常听到一句话：“上天有好生之德，万事留一线生机。”告诉我们天命实则也不是固定的，我们也不要完全去相信天命，他是可改变的，是可以靠自己的德行、靠自己的行为、靠自己的修行，去可以改变天命的运行规律的。</span></p><p><strong><span>又云：“惟命不于常，皆非诳语。”</span></strong><span>同时《尚书》又说了，命运虽然无常，但是他有迹可循，这个迹就是善，当我们不停地去行善的时候，天命自然有所归。一样的，如果我们不停地去做恶事，去做损害他人的事情，消耗的也是自己的福德、福报，就是这些话都不是骗我们的。</span></p><p><strong><span>“吾于是而知，凡称祸福自己求之者，乃圣贤之言。若谓祸福惟天所命，则世俗之论矣。”</span></strong><span>这时了凡先生自己总结出来一个天命的道理，告诉我们福祸都是可以自己求的，可以自己改变的，这都是圣贤之言。如果告诉我们命运都是定的，是不可更改的，这是世俗之论。</span></p><p><span>整个《了凡四训》告诉我们的都是改命的方法，不要再抱怨自己的生活如何如何的不好，不要抱怨自己的功名富贵不够，不要再去抱怨为什么我找不到好的伴侣，我身边没有好的朋友，没有贵人……都是我们可以自己求得的，都可以向内求的。</span></p><p><strong><span>“汝之命，未知若何？”</span></strong><span>从这段开始，告诉他的儿子天启，说：“你未来的命，我不确定是什么样子的。”接下来对他儿子所讲的这番话非常重要，其实对每个人，我们自己的行为和处事的态度，都是一种约束和警醒，也可以作为我们做人、做事的准则。</span></p><p><strong><span>“即命当荣显，常作落寞想。”</span></strong><span>即使我们的生活很好、很显贵，也要经常当作落寞的样子。</span></p><p><strong><span>“即时当顺利，常作拂逆想。”</span></strong><span>即使很顺利，也经常要当不顺去思维的。</span></p><p><strong><span>“即眼前足食，常作贫窭想。”</span></strong><span>即使我们当下是丰衣足食的，也要当自己贫困去思维的。告诉我们要节俭，就是不能过度的消耗，即使我们的生活很富足，也不能过度的消耗，福向俭中求。诸葛亮也说过：“静以修身，俭以养德”，一个人的德行，怎么会变得更好啊？就是要节俭，不去过度地消耗，不去过度地浪费。</span></p><p><strong><span>“即人相爱敬，常作恐惧想。”</span></strong><span>即使有很多人爱我们，有很多人尊敬我们，自己也要很谨慎，不可骄傲自满的。</span></p><p><strong><span>“即家世望重，常作卑下想。”</span></strong><span>即使家世很望重，很兴盛，我们也要懂得处下，也要谦逊有礼地对待每一个人，而不能去做那个孤高、孤傲之人。</span></p><p><strong><span>“即学问颇优，常做浅陋想。”</span></strong><span>即使我们的学识很好，也要懂得谦逊之道，也要认为自己是浅陋的、自己是不足的，只有这样的思维，我们才能不断地成长，如果一个人认为自己的学识很厉害，认为自己很博学，这时就很难再进步了。</span></p><p><span>整个这段其实都是告诉我们处事的态度和行为，这适合我们每个人引以为戒的，我们一条一条去对照，我们自己常犯的是哪一些问题，我们从态度，从行为上，都去修正自己。</span></p><p><strong><span>“远思扬祖宗之德，近思盖父母之愆。”</span></strong><span>说往远了思考，我们要弘扬祖上的德行，扬就是弘扬，我们要弘扬祖上的德行。这个愆是什么意思？是过失，就是父母的过失和不足，盖就是弥补和隐藏的意思。往远了要思考弘扬祖上的德行，往近了我们要思考去隐藏和弥补父母所犯的过失和过错，而不是抱怨他们。</span></p><p><span>现在我们很多生活当中，其实都是在抱怨父母，为什么给我的更少？为什么没有给我创造更好的条件？为什么没有让我去更好的学校？为什么没有给我更多的东西，没有给我更多的财物？</span></p><p><span>整个其实都反了，父母能生育我们到这个世界上已然很好了，剩下的何尝不是我们自己的命数？我们要懂得自己的命数要靠我们自己的福德去改变的，而不是抱怨父母。这里告诉我们不光不要抱怨父母，还要去弥补父母的过失和过错，这才是该为人之子要行的道。</span></p><p><strong><span>“上思报国之恩，下思造家之福。”</span></strong><span>往上，我们要懂得报国家的恩德，去为国家做贡献，去为这个时代、为这个社会去做贡献；下思造家之福，要想着对自己的家庭创造一些福德，让他们过更好的生活，让他们的衣食变得更富足。</span></p><p><strong><span>“外思济人之急，内思闲己之邪”。</span></strong><span>我们对外要多考虑救济他人，多去帮助他人，对内闲是什么意思？一个是督促，第二个是防范的意思，说自己独处的时候，也要防止自己的邪念和邪行。那么一个是外用，一个是内修。对外的时候，要想着如何救济和帮助他人，对内的时候要懂得克己，要懂得不断地修正自己的心念和行为，有没有不是正道的地方。</span></p><p><strong><span>“务要日日知非，日日改过。”</span></strong><span>所以一定要日日知非，日日去改过，每天都要知道自己的不足，每天都要去修正。这个好比是我们《大学》里所讲的：“苟日新，日日新，又日新。”我们每天都要保持进步的这种心态和行为。</span></p><p><strong><span>“一日不知非，即一日安于自是；一日无过可改，即一日无步可进。”</span></strong><span>如果这一天，不知道自己的过失和不足，那么这一天就是自以为是的状态，就是骄傲自满的状态；如果这一天，我们没有发现自己的不足，没有去改正，那么今天就是不能进步的，就是停滞不前的状态。</span></p><p><strong><span>“天下聪明俊秀不少，所以德不加修、业不加广者，只为因循二字，耽搁一生。”</span></strong><span>说天下聪明、俊秀的人非常多，这个社会上从来都不缺乏聪明的人，这样的人很多，但是德不加修，不懂得去修自己的德行，不懂得去明自己的德。“业不加广”就是善业不能变得更多、更广。</span></p><p><span>因循二字是什么意思呢？就是延续之前的行为不停地循环，比如说以前一直是拖延的，那么延续了拖延的习惯；比如说以前是喜欢发脾气的，也不知道修正，就延续了自己发脾气的习惯，依然是那个样子。因此荒废了时光，耽误了一生。</span></p><p><span>整个最后这一段就开始总结整个《了凡四训》的立命之学了，“云谷禅师所授立命之说，乃至精至邃、至真至正之理，其熟玩而勉行之，毋自旷也。”告诉我们说云谷禅师，整个所讲的这一段立命之说至精至邃。精就是很精通，邃就是很深远、很深奥的意思，至真，很真实的；至正，很正确的道理。</span></p><p><span>云谷禅师讲的立命之说是很通达的，是很深奥的，很真实的，非常正确的道理。一定要努力地勉励行之，一定要很努力很积极地去做，一定不要自我荒废，这样的话整个的一生才不虚度。</span></p><p><span>了凡先生之前也会讲，由于自己之前没有认识到立命之说，没有真正身体力行地去做，在做的过程当中又行义未纯，检身多误，导致很多光阴虚度，他在讲给他儿子听的时候，告诉他一定不要自我荒废，虚度时光。</span></p><p><span>其实我们每个人都是一样的，修行是我们一生的事情，当我们越是明白这个道理的时候，我们越要懂得时刻地约束自己的行为，让自己每天都保持进步的状态，不要光阴虚度。</span></p></div>"
},{
    "title": "第八讲《改过之法》行善先改过",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><strong><span>第八讲《改过之法》行善先改过</span></strong></p><p><strong><span>“春秋诸大夫，见人言动，亿而谈其祸福，靡不验者，《左》《国》诸记可观也。”</span></strong><span>春秋，指的是一个时代，包括我们的孔圣人、老子，都是出自于春秋时代的。春秋是一个乱世，周王朝衰落，诸侯国四起，也是一个比较动荡的时代。</span></p><p><span>春秋那个时代的很多大夫，基本上通史做官的，能在乱世做官，说明这个人是颇有一些智慧、学识和才能的。那个时代的很多大夫，看到一个人讲话的言语，一个人的行为，就可以猜想、推测一个人的福或者祸，这个是为什么呢？</span></p><p><span>就像我们现在也是一样的，当我们颇有一些学识和有一些智慧的时候，看到一个人讲话，他的言谈、他的行为，就可以看到接下来他要发生的事情。<strong>“靡不验者”，</strong>没有不灵验的。《左传》和《国语》，诸记可观也，这些历史的书籍都有记载这些大夫的行为。</span></p><p><span>其实我们到现在也是一样的，当我们通过一个人的行为，一个人的言语，就可以看到他的心念，他的心念、行为就会导致接下来所做的事情，发生的那个结果是福是祸，清清楚楚地可以看得到，是有迹可循的。</span></p><p><strong><span>“大都吉凶之兆，萌乎心而动乎四体。”</span></strong><span>接下来告诉我们，一个人所做的事情、所动的念头、所讲的话，吉凶之兆都是有痕迹的，是萌乎于自己的心念，动乎四体，就是从行为就可以看得出来。</span></p><p><span>我们之前讲《大学》的时候说过，“诚于中，形于外”，我们内在有多少诚意，心念是什么样子的，别人可能看不到我们心里的变化。</span></p><p><span>但是通过行为就知道我们的心念在想什么，通过我们的言语，就知道我们心里在想什么，以及接下来所要发生的事情，别人看得是清清楚楚的。</span></p><p><span>就像孔子带着弟子们周游列国的时候一样，他走到哪一个国家，看到一个国君的行为，所做事的风格、所讲的话，大臣们的行为和百姓的行为，他就知道接下来这个国家会发展成什么样子，其实一点都不玄幻，他只是掌握了事物的发展规律。</span></p><p><span>为什么那个时代出现的圣贤之人会比较多？越是在动荡的时代，越能历练一个人的品格，越是这种乱世往往越出英雄，越是那种动荡的时代，往往越出一些圣贤。</span></p><p><span>其实我们这个时代也是一样的，因为我们这个时代人们更多的缺乏的是内在的精神食粮，缺乏的是内在的清静、祥和，缺乏的是内在的从容和淡定，所以当我们不断地去学习圣贤的文化，不断地去修正自己的时候，反而在这个时代是容易脱颖而出的。</span></p><p><span>当我们越从容、越淡定、越有智慧，再去观察身边的人和事，清清楚楚、显而易见的。</span></p><p><strong><span>“其过于厚者，常获福，过于薄者，常近祸。”</span></strong><span>过于就是过分的，过度的，当我们做事情很厚道、很厚德，我们自然就可以得到一些福报，如果做事情过于薄，就是太少了，这样我们自然就常近祸。</span></p><p><span>这里指的是什么呢？我们的德行更深厚，做人更厚道，就会得福德，反过来如果更少，就不得福报，就会接近于祸端。</span></p><p><span>任何事情圣贤之道都告诉我们，他是有迹可循的。比如说我们常常讲到一个词叫厚道，什么叫厚道呢？就是我们所做的事情，厚就是多，更加的合于道，合于德，合于善。</span></p><p><span>说这个人很仗义，做事情很厚道，是他更多的合于道，所以我们都愿意跟这样的人交往，我们都愿意去帮助这样的人，都喜欢跟这样的人做事情。</span></p><p><span>同样天道也是这样的，“天道无亲常与善人”，他做的事情更厚道，就更加的合于道，所以自然就得福啊，反之自然就得祸。因为都有迹可循的，他是有规律可言的。</span></p><p><strong><span>“俗眼多翳，谓有未定而不可测者。”</span></strong><span>俗眼就是我们凡夫俗子，多翳就是有毛病，被遮盖住了，被遮掩了。被什么遮盖住？被欲望，被情绪这些东西遮盖住了，当遮盖住的时候就会讲什么话？</span></p><p><span>一切都有定数，我们是逃不出命运的束缚的，是改变不了任何事情的，我们认为任何事情都是不可预测的，这是俗眼。</span></p><p><span>当我们不断地学习，不断地修行，拥有一些智慧的时候，会发现其实很多事情都可以预测到的，这里的预测并不是指的要推算、去算卦，不需要的，我们看到那个事物的发展规律，就自然知道那个事情了。</span></p><p><span>但是我们怎么才能看到事物的发展规律？我们得多学习，得懂得更多的道理啊，如果我们连善恶都不明，如何看到事物的发展规律？</span></p><p><span>所以《论语》讲：“不践迹，亦不入于室。”如果我们不踏着圣贤的足迹，学问是学不到家的。入于室，到了家，升堂入室，踏着圣贤的足迹去学习更多的文化，不断地去修正自己。</span></p><p><span>当我们自己变得更有智慧，掌握了更多事情的发展规律，所以很多事情摆在面前，清清楚楚是可以看到的。</span></p><p><strong><span>“至诚合天，福之将至，观其善而必先知之矣。”</span></strong><span>当我们是至诚的，自然就合了天道，自然就懂得事物的发展规律了。</span></p><p><span>《大学》里有讲过诚意，“诚其意者，勿自欺”，我们是不自欺欺人的，对于善恶的了解是至诚的，对于修正自己是至诚的，就会越来越接近于天道，就懂得天道的规律都在讲什么。</span></p><p><span>比如说仁、德、善，这些都是天道所赋予给我们的规律，所以我们对这些事情越是至诚，就掌握了事物的发展规律。</span></p><p><span>“福之将至”，我们就知道了，什么样人快得福报了。我们经常看他做好事，经常帮助他人的，就知道这个人的福快来了。</span></p><p><span>“祸之将至，观其不善而必先知之矣。”一个人要得到祸，要有不好的事情发生，也是一样的。因为看到那些不好的行为，那些不善的行为，我们自然就知道他接下来要发生一些不好的事情在他身上。</span></p><p><span>举个例子，我们在生活当中，总能看到一些脾气暴躁的人，见到谁都和人争吵，这个时候智者就说，他这样下去一定会出问题的。</span></p><p><span>比如说谁家的孩子特别狂妄，有的老人是不是就讲了，这样下去一定会惹祸的，这不都是事物的发展规律嘛？其实当我们作为一个旁观者，我们是淡定的、有智慧的，是了解这些智慧的，会发现看什么事情极其简单和清晰。</span></p><p><span>我们修了这么长时间也是一样的，还有很多咱们一起学习的朋友，我们这边直播的时候，如果声音大了，他们是不是就讲了，说今天是谁在那里啊？那么没有礼貌，声音为什么那么大？会发现他们就会很清楚。</span></p><p><span>为什么我们天天讲这些道理？我们天天讲慈心于物，我们天天讲心目中有别人，是不是他就懂得这个规律了？他拿懂的这个道理再去看所有的事情，是不是就清晰了？其实很简单的事情。</span></p><p><strong><span>“今欲获福而远祸，未论行善，先须改过。”</span></strong><span>我们想要得到更多的福报和福德，先不要讲行善，先改过。我们常讲，我们修行的第一件事情是干吗？是指止恶扬善，先止住自己那些恶的、不好的行为、不好的语言、不好的念头，然后不断地去增加我们的善念、好的行为。</span></p><p><span>我们想要止恶扬善，首先得学习先知，何为善恶，比如说讲《了凡四训》不是知善恶的吗？我们得先知善恶，才能止住什么样的行为，才能弘扬什么样的行为，行善之前先改过，先改掉自身的不足，会发现其实在改过的过程当中，已然就在行善了，已然就不做恶业了。</span></p><p><span>比如说以前讲的话语、行为是伤害他人的，而犹不自知，当我们不断学习的时候，就会更加地谨言慎行。很多时候我们恶语伤人自己是不知道的，我们的一个行为，给别人带来了很多困扰，我们是不自知的。</span></p><p><span>所以要懂得先改过，先不断地去修正自己。那么接下来，把自己修正得更好，就是咱们大学讲的明德的过程，下一步就是亲民，也就是这里讲的行善了。</span></p><p><span>“但改过者，第一，要发耻心。”从这开始讲改过的三心，就是三种心，第一种心，就是要发耻心。什么叫耻？就是有羞耻之心。</span></p><p><span>《中庸》里面讲：“好学近乎智，力行近乎仁，知耻近乎勇。”也讲到耻，知耻的人，才是最勇敢的人。什么叫知耻？就是知道自己的过错和不足，愿意去改正，这叫知耻。</span></p><p><span>知耻有一个很重要的一点，是要懂得向内求的，而不是发生了什么事情，都怨天尤人的。比如说没有耻心的人，发生任何事情都是怪别人的，都是他人的问题，而不懂得反观自省的。第一件事情，要懂得发羞耻之心，才能愿意去改自己身上的过错和不足。</span></p><p><strong><span>“思古之圣贤，与我同为丈夫，彼何以百世可师？我何以一身瓦裂？”</span></strong><span>这时开始感叹，我思考，想想这些古代的圣贤，他们为什么可以流芳百世？而我一身瓦裂。瓦都见过，摔碎了，裂的满地都是，扶不起来，很破碎的样子，形容自己的状态，说我为什么就不能流芳百世呢？自己开始自言自语。</span></p><p><strong><span>“耽染尘情，私行不义。”</span></strong><span>都是因为被这些尘情所耽染，这里的尘情指的是什么？就是我们讲的七情六欲里的七情，喜、怒、忧、思、惊、恐、悲这些情绪，都是被这些情绪所干扰、所耽误了。</span></p><p><span>我为什么不能成为圣贤呢？是因为我每天被这些情绪所困扰，一会儿愤怒，一会儿喜悦，一会儿哀思，一会儿惊恐，都是被这些情绪所干扰。有这些情绪以后，私行不义，就是私自、私下的行为，很多是不合道义的，做了很多不好的事情。</span></p><p><strong><span>“谓人不知，傲然无愧。”</span></strong><span>还以为别人不知道，自己还不懂得羞愧，不懂得愧疚，不以为然的样子。我们很多人做事情是不是这样的？自己私下做了很多不好的事情，还以为别人都不知道，甚至有的人知道自己做的不好，依然大言不惭的，不但自欺，又欺人，这是了凡先生讲凡夫和圣人的区别。</span></p><p><strong><span>“将日沦于禽兽而不自知矣。”</span></strong><span>在不久的将来，就要沦为禽兽了，而自己还不知道。通常我们在生活当中，形容一个人禽兽，是不是说这个人无德、没有德行、不知耻？做了很多不好的事情，依然很大言不惭，傲然无愧的样子。</span></p><p><strong><span>“世之可羞，可耻者，莫大乎此。”</span></strong><span>说世间之人呢，最羞耻的事情，莫过于此了。</span></p><p><strong><span>孟子曰：“耻之于人大矣。以其得之则圣贤，失之则禽兽耳。”</span></strong><span>孟子说，关于羞耻这件事情，对于我们人来讲是非常重大，非常重要的事情。我们要懂得羞耻之心，就会越接近圣贤。为什么呀？只有我们懂得羞耻之心，我们才能内省，我们才能看到自身的不足，我们才能去修正，所以才能接近圣贤。但是反之呢？</span></p><p><span>我们不知羞耻的时候，遇到任何事情，我们看不到自身的不足，就开始怨天尤人。现在流行一句话：“怼天，怼地，怼空气”，都是别人的问题，反正不是我的错，这样下去就会沦为禽兽，就是没有德行的那种人。</span></p><p><span>所以《了凡四训》这本书，虽然是入门的经典，但是包含的内容却很庞杂，既有儒家的文化，又有道家的文化。“此改过之要机也”，这是改过非常重要的一个环节，一个契机，一个关键点。</span></p></div>"
},{
    "title": "第九讲《改过之法》改过发畏心",
    "date": "2022-07-09",
    "html": "<div class=\"B1_text\"><p><strong><span>第九讲《改过之法》改过发畏心</span></strong></p><p><span>“第二，要发畏心”，改过的第二点要发畏心，畏心就是敬畏之心。当我们学习一段时间的朋友，越是跟着修行一段时间的朋友，敬畏之心就很重。就像《论语》里面所引用《诗经》的话：“战战兢兢，如履薄冰，如临深渊。”为什么？是因为我们心里有了敬畏之心，为什么我们做事情的时候会更加得严谨？不就是因为我们有敬畏之心吗？</span></p><p><span>我们敬畏每一个人，怕人家看到了不舒适，怕人家听不明白，怕我说话的语气伤害到了谁，怕我走路的声音大影响到了谁，怕我倒水的声音大导致录音里面出来的效果不好，这不是敬畏之心吗？所以没有敬畏之心的人，是不是走路乒乒乓乓的？用东西摔摔打打的？对人讲话呼来喝去的？</span></p><p><span>越有敬畏之心的人，是敬畏所有的人、事、物的，这个时候我们对待每一个人就不一样，甚至对待我们每一个用的东西都不同，对待我们所做的事情是有诚意的，这些都是敬畏之心，一个没有敬畏之心的人，很难做成事情的，也很难做好事情。</span></p><p><span>没有敬畏之心的人是不是特别容易抱怨呢？抱怨、牢骚就会特别多。当有敬畏之心的时候，会发现整个人的行为都是端正的，说话的语气都是注意轻缓的，做事情都在思考，会不会给他人带来不便和麻烦，整个人的修为就会往上提升一大截，所以畏心是非常重要的一件事情。</span></p><p><span>比如我们要是敬畏因果的人，就不种恶因；要是敬畏他人的人，就思考着我讲话不能伤害他人。敬畏会让我们减少很多的过错和过失，这是非常重要的。</span></p><p><strong><span>“天地在上，鬼神难欺。”</span></strong><span>天地在上，鬼神是不可欺的，都看得清清楚楚，就像我们常讲的：“举头三尺是有神明的”，天地皆知。以前古代的人很有意思，他们做任何事情的时候，都开始祭祀天地鬼神。就是告诉说：“我做的是什么样的事情，我做了不好的事情，也祈请原谅，从此以后去改正。”因为古之圣贤都明白这个道理。</span></p><p><strong><span>“吾虽过在隐微，而天地鬼神，实鉴临之。”</span></strong><span>我所做的事情，虽然过错在隐微之处，隐是什么意思？就是隐蔽的地方，别人看不见的，微就是那些很细小的事情和行为。虽然我做的很多事情很隐蔽，甚至可能很细微很微小，但是实则天地鬼神，就好像降临在我身边，都可以清清楚楚地看到。当我们有这种敬畏之心的时候，我们做任何事情都很注意自己的行为，注意自己的言语，这时敬畏之心就起来了。</span></p><p><strong><span>“重则降之百殃，轻则损其现福。”</span></strong><span>说我做很多不好的事情，不好的过错，如果很重的就会降之百殃，就是很多很多的灾祸，轻的就会损我现在的福报。比如说我可以过得更好，但是做了很多不好的、有过失的、但是很轻的事情，就会差一些，就会在现有的福报当中去减损去减少。</span></p><p><span>比如说，命里我们该有两个孩子的，有可能一个孩子了；可能说命里面我们能赚两千万的，有可能我们不停地去做损福报的事情，赚了一千万；可能我们命里是可以做成更大的事业的，但是我们做了不好的事情，而减少了我们事业成功的长度。</span></p><p><span>只不过这些事情我们看不到，他讲的一定是道德规律，我们看不到不代表他不在，所以《了凡四训》同样告诉我们的这些道理，让我们自己一定要有敬畏之心。</span></p><p><strong><span>“吾何可以不惧。不惟是也。闲居之地，指视昭然。”</span></strong><span>我怎么能不惧怕呢？不仅是如此，我自己独处的时候叫闲居，即使我独处的时候，也指视昭然的，昭然是被看得明明白白，清清楚楚。指视这两个字出自于《大学》：“十手所指，十目所视，其严乎？”所以叫指视昭然。</span></p><p><span>大家想一想，我们做事情都是被十目所视，十手所指的，多严格啊。无论在生活当中，还是在工作当中，我们的行为都被身边的人看着。比如说我们每天的言行，所做的事情别人看不出来吗？其实清清楚楚，这个人是真得很努力，到底有没有诚意？</span></p><p><span>事情做成什么样子，是不是心口一致的，大家看不看得出来？是不是看得清清楚楚？所以其实是指视昭然的。而我们以为自己做的事情别人看不清楚罢了，实则别人看得清清楚楚。为什么生活当中，总是出现一些抱怨的？</span></p><p><span>举例：我有一个很好的朋友，平时关系特别铁，可是人家做事情的时候，却不跟我一起合作，那我们不想想为什么吗？平时的言行举止都在人家眼里，只是人家不讲罢了。</span></p><p><span>同样在工作当中不是一样的吗？有人说我很努力，做了三年，为什么不给我提升？为什么不给我涨工资，却给那个人涨工资了呢？因为我们的言行举止，所做的事情，别人看得清清楚楚，只是我们以为别人不知道罢了。</span></p><p><span>所以指视昭然，无论是我们从天地鬼神的角度，清清楚楚，还是从周围人的视角，看得明明白白的。</span></p><p><span>所以儒家一直在不断地强调，让我们修慎独，就是自己独处的时候，也是这个样子的。我们只有独处的时候，也保持这个样子，才能“诚于中，形于外”。当我们碰见事情的时候，我们第一个念头出来的，和第一个行为出来的，就是潜意识里最真实的那个东西。</span></p><p><span>不发生事情还好，发生事情的时候那个东西瞬间就出来，出来的那个东西才是最真实的。当我们慎独，自己独处的时候就是这个样子。当诚于中，我们外面的行为表现出来的，自然而然就是那个样子的。这是我们不断修行内在的一个非常重要的原因。</span></p><p><strong><span>“吾虽掩之甚密，文之甚巧，而肺肝早露，终难自欺。”</span></strong><span>虽然我可能做了不好的事情，我把它掩藏的很隐秘。文之甚巧是什么意思呢？就是我做了错的事情，我用言语来不停地去修饰它。</span></p><p><span>比如我们做错了一件事情，无论言辞怎么去修饰、怎么去解释，别人看得清清楚楚，反而内心还在嘲笑我们：做错了事情还不停地辩解，还不停地去解释。我们还不如坦然一点，“不好意思，这个事情我做得不对，我做错了。”反而别人欣赏我们这种行为。</span></p><p><span>所以越是掩饰，其实别人看得越明白；越是解释，说明自己内心越是那个样子的，早已经暴露在别人面前了，就像看自己的肝和肺是一样的，清清楚楚，终难自欺。即使我们掩盖过去了，别人不与我们计较，自己心里清不清楚？自己清楚还能坦然吗？</span></p><p><span>想一想我们每一天，只要我们做了不好的事情，只要做了自己认为不对的事情，就很怕别人发现，我们每天的内心，就是很忐忑不安的，怎么来平静？怎么来定力？智慧从哪里来？</span></p><p><strong><span>“被人觑破，不值一文矣，乌得不凛凛？”</span></strong><span>说一旦被别人看明白、看破的时候，一分钱都不值了。乌是个感叹词，怎么能不让我自己内心畏惧？</span></p><p><span>这个时候，我们把道理明白得越深刻，就越有敬畏之心，对什么事情都是畏惧的，才懂得不断地去修正自己的身心，直到自己内外都是光明的，我们才有那么多的坦然。</span></p><p><span>“不惟是也。一息尚存，弥天之恶，犹可悔改。”但是大家也不要恐惧，不要担心，因为事情还不只是这个样子，只要我们还有一息尚存，即使有弥天之恶，依然可以悔改的。我们还有机会，只要懂得改过就好了，只要知道我当下是不足的，我的善行是不够的，从当下去改过就可以了。</span></p><p><strong><span>“古人有一生作恶，临死悔悟，发一善念，遂得善终者。”</span></strong><span>自古以来都有这样的人，可能一生做的都是坏事，但是临终之时，我一念幡然悔悟，所有的罪恶都没有了，也可以得一个善终。</span></p><p><span>曾子曾经说过这样一段话：“人之将死，其言也善”，人在将死的那一刻，讲出来的话都是善良的，为什么？因为人临死的时候，没有欲望，什么东西都不在乎了，什么东西都放下了，所以那个时候讲出来都是善良的话。</span></p><p><span>阳明先生说：“人人都有良知”。为什么良知没有了，就是被那些欲望盖住了，所以才看不到自己的良知，王阳明先生提出“致良知”，致就是修正的过程，通往良知的过程。</span></p><p><span>我们看人将死那一刻，所有的欲望都放下了，什么东西都变得不重要了，这个时候他的良知就开始显现了，所以讲的话就是善良的。</span></p><p><span>我们看电视是不是经常也这么演，可能一个人很坏，但是临死那一刻，他突然明白了，他可能给谁挡了一刀、挡了一箭。那个时候，他都是悔悟的，讲的话都是善良的，因为没有了欲望了，不再争名夺利了，所以就不再做残害他人的事情。那我们整个修行的过程，其实就是致良知的过程。</span></p><p><strong><span>“谓一念猛厉，足以涤百年之恶也。”</span></strong><span>一念猛厉就是非常勇猛的心，非常至诚的决心和态度。有这样的态度、有这样的决心，足以涤百年之恶，百年是说我们一生不过百年，就足可以洗涤我们这一生的不足和不好的地方。</span></p><p><span>这段话是勉励我们的，不要纠结于过去的不足，有很多朋友反复都会问这个问题。“老师，我过去做了很多不好的事情，要怎么办？”“我突然明白了，通过这段时间的学习和修行，看到了过去很多的不足，我很懊悔怎么办？”其实大可不必，今日不是我们重生的日子吗？</span></p><p><span>今天是义理之身重生的日子，所以从今天开始，我们懂得去修正之前的事情，我们不再做就好了，所以没有必要懊恼和懊悔的。</span></p></div>"
},{
    "title": "第十讲《改过之法》改过发勇心",
    "date": "2022-07-09",
    "html": "<div class=\"B1_text\"><p><span><strong>改过之法篇--改过发勇心</strong></span></p><p><span><strong>“譬如千年幽谷，一灯才照，则千年之暗俱除”。</strong>好比是千年的幽谷，一灯过来了，所有的黑暗就消失了。想象一下，比如说我们外面的路上，本来是漆黑一片的，可能漆黑了很多年，但是突然有一天，路灯接到这里的时候，是不是就有光亮了，有了这个光亮，过去的黑暗就没有了。</span></p><p><span>其实我们的修行也是一样的，当我们不断地学习，不断地修行，过去可能我们有很多的忧虑、痛苦、烦恼，当我们一念即转的时候，过去的烦恼就不再了，瞬间就消失了。所以一灯可灭千年暗，不用去担心，我们过去有多么不足，我们过去有多么不好，当我们开始学习，开始修行的日子，就是我们踏上新的旅程的时候。</span></p><p><span><strong>“故过不论久近，惟以改为贵”。</strong>无论过错发生了多长时间，是远还是近，最近发生的，还是几年前发生的，不是最重要的，什么最重要，当下改正这件事情，才是最重要的，我们很多的烦恼和忧虑，都是来自于对过去发生的事情，紧紧抓着不放。</span></p><p><span><strong>“但尘世无常，肉身易殒，一息不属，欲改无由矣”。</strong>但是我们自己要时刻警醒，因为世事是无常的，我们的生命也是无常的，一旦我们的身体消亡，一息不在，停止呼吸了，即使我们再想去改正，也没有办法了。都是给我们讲无常，让我们自己要时时的警醒自己。</span></p><p><span>很多朋友会讲，他说：“没事，我再做两年坏事，我就做好事去了”；有的人说：“我现在没时间学习，等我再忙完这几年，我就学习了”；“老师，我现在没有时间修行，等我退休以后我再去修行”。我们会发现这样的想法，都是虚度光阴的。</span></p><p><span><strong>“明则千百年担负恶名，虽孝子慈孙，不能洗涤”；</strong>从明处看，我们看得到的地方，会担负千百年的骂名。很多人是不是这样的，包括我们看电视，看书，是不是还在骂那些曾经做了很多不好事情的人，背负了千百年的骂名，虽然有好的子孙，很贤德的很孝顺的，他依然不能洗涤清白，还有可能受连累，导致后面的整个家族，都抬不起头来。</span></p><p><span>反之也是一样的，那些做了很多好事情的人，我们现在仍在歌颂，我们仍在学习他的精神，甚至他的后代，都跟着一荣俱荣的。所以我们做任何事情，不光是在给自己积累功德，给自己积累善行，还在福泽子孙，反之就是在殃及子孙。所以我们不得不引以为戒。</span></p><p><span><strong>“幽则千百劫沉沦狱报，虽圣贤佛菩萨，不能援引”。</strong>幽是什么？就是看不见的地方，我们人们看不到的地方，千百劫受了地狱的果报。经常做不好的事情，经常做损害他人的事情，会沦落到地狱的千百劫。</span></p><p><span>这个劫是时间概念，这个劫是非常长的，一小劫将近1600万年，1599.8万年，二十小劫为一个中劫，四个中劫为一个大劫，这个时间是非常长，永无出期，形容时间太长了。</span></p><p><span>所以说无论从明还是从暗，做了那么多不好的事情，都是要受到果报的，不能不生敬畏之心的。所有的圣贤文化，都是告诉我们向善，都是告诉我们向着阳光的，都是告诉我们要积德累行的，他讲的道理是一样的，规律是一样的，所以一定要有敬畏之心。</span></p><p><span>我们再去观察身边的人和事，越是优秀的人，越是生活富足的人，是不是他的信仰，也有说我信善良，这是不是信仰？我别的都不信，但是我知道做人不能做坏事，我不能坑害他人，这是不是一种信仰？我要自强不息，这是不是一种信仰？</span></p><p><span>中华文化上下五千年，从上古时期开始，比如说，我们讲女娲补天，后羿射日，夸父追日，愚公移山，精卫填海，都是告诉我们自强不息的，要靠自己。后羿多厉害，太阳不服射下来，天漏了补上，中国的精神就是这么顽强。</span></p><p><span>我们小时候学习乌鸦喝水，连乌鸦都懂得靠自己的道理，不靠自己喝不上水的。我们现在难道不懂得这个道理了？所以这不是我们骨子里的信仰吗？我们流淌的血液，就是自强不息的。越是优秀的人，是不是越有信仰？</span></p><p><span>反之去看，比如说各个方面不太出色的人，他只信自己，发现没有？别跟我说那些没有用的，我就信我自己，谁跟我说什么大道理，我也不信，什么古之圣贤那些东西，我也不听，我就信我自己。</span></p><p><span>越是这样的人，越信自己；越是优秀的人，越信天道循环的规律，越是优秀的人，越信善良，越信福德。所以人和人的差距，就是思维的不同，心念的不同，导致行为的不同。如果做了那么多不好的事情，虽然有圣贤和佛菩萨的出现，也无法救助和接引。“乌得不畏？”怎么能不敬畏呢，这些古之圣贤，对我们后人的启迪，可谓苦口婆心，我们怎么能不畏惧？</span></p><p><span><strong>“</strong><strong>第三，须发勇心。”</strong>就是勇猛之心，无论做任何事情，都得有勇猛之心，勇猛是一种非常大的决心，可以战胜任何困难，碰到问题是不退缩的。中华五千年的文明，是不是都有勇猛之心？天漏了我补天，太阳热了，我把它射下来，山堵在我家门口，凭什么搬家搬走把山搬走，就这精神就这么厉害，所以这个精神了不起。</span></p><p><span>我们做事情是不是这样的？不服就盘它，必须得有这种劲头。如果没有这种劲头，会发现很难进步的。改过不是如此吗？修行不是如此吗？跟着学习过来的很多朋友，是不是也在讲，有的人每天很精进，很勇猛；有的人就不是，走走停停，走两步退三步，走三步退两步，跟小时候跳皮筋一样，会发现那个状态，他很难进步的，因为没有勇猛之心。</span></p><p><span><strong>“人不改过，多是因循退缩”。</strong>人不能敢过，多是因为延续了之前的行为习惯，比如说之前是拖延的，现在还是拖延的，之前做事情是优柔寡断的，现在还是优柔寡断的，这叫因循退缩。走着又退回来了，我太难了，为什么讲太难了？这不是之前的行为和思维习惯吗？</span></p><p><span><strong>“吾须奋然振作，不用迟疑，不烦等待”。</strong>要奋然振作。大家想想那种精神，我奋然振作，我一定要努力，我一刻都不能等待，我一刻都不能迟疑。这种状态，这就是勇猛之心，说我现在发现身上的过错了，一刻都不能等待，我等不及，我马上就得改，不能等到明天，这个错怎么能留到明天呢？</span></p><p><span>有的人做事情，就有这个魄力，说我当下做错不行，我马上必须把这个事情搞定，搞不定我是不睡觉的。这样的人，都成为了社会上的优秀人士。做文化，修行不是吗？</span></p><p><span>如果我们少了这种尽头，很难有建树的，碰到一个问题，“哪天再说的吧，过几天再改，又不差这两天”，日复一日，还是那个样子，这不都是因循退缩吗？不停地迟疑。接下来给我们举例了，举例是为了让我们更好得明白。</span></p><p><span><strong>“小者如芒刺在肉，速与抉剔”；</strong>说小的过错，就好像手里扎了一个刺一样，想一想，我们手里扎了一个刺，舒不舒服？不舒服吧，不能等到三天以后，再拔出来。会不会像犯了一个过错，“不着急，扎就扎着吧，扎三天我再拔出来”。我们是不是速与抉剔，马上就给它拔出来，改正自己身上小的过错，也要像如此的勇猛，发现了马上就去修正。</span></p><p><span><strong>“大者如毒蛇啮指，速与斩除”，</strong>大的过错，就好像是毒蛇咬了我们的手指一样，我们得马上把手断掉的，要不然毒血攻心，慢了之后，整个就身亡了。我们身上的那些大的过错，不是如此吗？</span></p><p><span>只是我们不明白，这件事情的重要性，我们很多不好的行为，我们还不停地去延续，会造成更大的不好的苦果，无论从明还是暗，都是很严重的，只是我们不清楚而已，所以才不引以为戒。</span></p><p><span><strong>“无丝毫凝滞，此风雷之所以为益也”。</strong>丝毫都不停，风雷为益，风和雷组合在一起，卦象叫益卦，这来自于《周易》的上巽震为雷，下震巽为风，就是风雷组合，形容势头很猛。我们做事情要乘势而上，顺势而为，雷厉风行，我们做任何事情，不是一样的吗？</span></p><p><span>比如说，我们做线上课的事情，是不是要顺势而为，这个就像一个高速旋转的东西，一旦停下来，再起来是很费劲的。就像我们开车，跑到120迈的时候，会发现要突然停下来，再起步就很慢，所以我们做事情都讲顺势而为的，这是风雷组成的卦，是对人有益的。</span></p><p><span>如果有人去摇了一个卦，出来的是益卦，形容什么呢？对这个人是有利的，做事情是雷厉风行的，正在势头上要顺势而为。</span></p><p><span>我们改过不也是一样吗？我们学习不也是一样吗？我们修行不也是一样吗？我们做事情不也是一样吗？一定要雷厉风行，发勇猛心，顺势而上，逆水行舟不进则退，所以修行越好的人，他都是一直向前的。用《大学》的话：“一直向内明的”。</span></p><p><span>改过，这三心必不可少。第一个就是耻心，要懂得羞耻，才能看到自己的过错；那么第二个要发畏心，要懂得敬畏万事万物，懂得敬畏，才懂得约束自己的行为；第三个心就是发勇心，有了羞耻之心，看到自己的过错，能敬畏约束自己的行为，勇猛，快速，雷厉风行，顺势而为，不断地去修正自己过错，我们的光阴才不虚度。</span></p></div>"
},{
    "title": "第十一讲《改过之法》改过先明理",
    "date": "2022-07-09",
    "html": "<div class=\"B1_text\"><p><span><strong>改过之法篇--改过先明理</strong></span></p><p><span><strong>“具是三心则，有过斯改，如春冰遇日，何患不消乎？”</strong>只要具备了以上的这三种心，则有过斯改，马上立刻就‘去改变，就好像春天春暖花开的时候，阳光普照的时候，冰自然会消散，有什么可忧患的？</span></p><p><span>当我们看到了，自身的那么多的不足，一定不要自怨自怜，就好像春天到了，太阳出来的时候，无论我们过去的冰有多厚，其实很快就可以消散的，不需要去忧患和担心。</span></p><p><span><strong>“然人之过，有从事上改者，有从理上改者，有从心上改者”，</strong>但是改过有这样三种方式，一种是从事情上改，一种是从理上改，要明白道理，还有一种是从心上改，这里面了凡先生告诉我们，改过分为三个层次，三种境界，三种功夫。</span></p><p><span>从事上改，就是从戒上改，我们要约束自己的行为，所以叫戒。当发生了一件事情，我们知道这件事情是不好的，是不应该做的，但是我们做不到的时候，怎么办？就要靠戒来约束我们的行为。</span></p><p><span>如果从儒家讲叫礼，“非礼勿视，非礼勿听，非礼勿言，非礼勿动”，也是来约束我们自己的行为。</span><span>从礼上改，就要通过不断的学习，去明白事情的道理，当我们懂得了很多事情是不应该去做的。</span></p><p><span>比如说，我们懂得了是不该发脾气的，我们懂得了很多事情，是不如法的不如理的，他是会伤害到别人的，需要我们不断地去学习，当越学习越明理的时候，很多事情就会消弥于无形。在事情未发生之前，我们明白这个道理，就不再去做那个事情，自然也就不会去犯过。</span></p><p><span>还有一种是从心上改，其实就是一个智慧的结晶，比如说我们不断地学习，明白更多的道理，当积累到了一定的程度，心念就会发生变化，很多过错自然就不会发生，这个是通过不断地学习，所得到的果。</span></p><p><span>到了心的层面，其实就是内化的功夫，是不断的从外在学来的，那些道理不断地明理，然后内化，转成我们自己智慧的过程，修行到最后是要修心的，因为当我们的心念是正的，心念是不起的，很多行为上的事情，自然就不发生。过，自然就无从生起。</span></p><p><span><strong>“</strong></span><strong>工夫不同，校验亦异”。</strong><span>因为我们所下的工夫不同，境界不一样，所产生的结果，自然就是不一样的，所以我们修行也好，学习也好，改过也好，一定是从次第而来的，刚开始我们做不到，从心上让那件事情不发生怎么办？</span></p><p><span>我们就要不停地去学理，要懂得更多的道理，明白更多的圣贤文化，懂得更多的修身之道，明白很多道理的时候啊，念头虽然还在升起，但是起码能及时制止住自己的行为，那么有的时候，依然制止不住自己的行为，就需要用戒了。</span></p><p><span>强烈的约束自己的行为，不让自己去做一些事情，然后通过约束自己的行为，理会更明，以达到以行治心的目的，所以一定是一步一步来的，但是我们一定要明白这三种境界，三种功夫不同，那么所收到的效果自然就不同。</span></p><p><span><strong>“如前日杀生，今戒不杀”，</strong>如同以前是杀生的，但是现在还做不到从心上不起杀生的念头，不起吃肉的念头怎么办呢？就用到戒了，今戒不杀来约束自己的行为。</span></p><p><span>比如说我做不到，让自己事事不发脾气，我做不到让自己事事不生抱怨，那怎么办呢？当抱怨起的时候，我要用戒的方式约束自己的行为，告诉自己不要去抱怨，在发怒的时候，我们要及时制止自己的行为，这叫戒。也是从事情上改，从事情上来禁止。</span></p><p><span><strong>“前日怒詈，今戒不怒”，</strong>怒詈，怒是发怒，詈是责骂的意思。说我之前总发怒，总责骂和苛责他人，我今戒不怒，约束自己的行为。</span></p><p><span>当自己还在责骂他人的时候，哪怕是话已经说出口，我们要懂得其实这个是不对的，我一定要时时刻刻地注意自己的言行，不能这样去对待他人，这叫戒。也是最初级的，从事情上去改正，一点一点地去修正。</span></p><p><span><strong>“此就其事而改之者也”。</strong>这个就叫就事而改，发生了事情的时候，我才意识到自己，这样是不对的，这样是不应该的，那么我就从这件事情上，去不断地改正，不断地修正自己。</span></p><p><span><strong>“强制于外，其难百倍，且病根终在”，</strong>从事情上改，就是从外面的行为强制的，但是很难，要不停地去改变才行，当我们不停地强制自己的行为的时候，刚开始一定是很难的，并且刚开始，我们一定是不自在的，像我们以前做事情。</span></p><p><span>比如说那么随心所欲，想做什么就做什么，这个时候我们用了戒的方法，就需要不断地强制自己的行为，约束自己的行为。</span><span>但是病根一直都在的，因为我们的心念，还没有发生变化，但是这是我们每个人修行也好，学习也好，改过也好，这是必经之路。</span></p><p><span>一开始我们都要用戒的方法，用礼的方法来约束自己的行为，但是这个一定不是最终的目的，最终是达到不戒而戒的，当我们养成一个新的习惯，新的思维的时候，就不需要用戒的方法了。</span></p><p><span>比如说我们现在遇事就发怒，遇到一件事情就开始抱怨，遇到一件事情就推脱，遇到一件事情就开始指责，这是我们原来多年的习惯和习性，就是因循所产生的。</span></p><p><span>同样，当我们改成一个新的习惯的时候，比如说遇到事情的时候，温和地处理，遇到事情的时候，智慧地处理，会发现就不累了，也不难了，所以戒只是我们刚开始，每个人必然要经历的初期。</span></p><p><span>举例子说，我们开车是不是一样的，我们刚开始在驾校，跟教练学习开车的时候，要必须按照教练所教的，每一个步骤去开车，会发现开车是个很繁琐，很难的事情。</span></p><p><span>一会要看后视镜，一会要1档2档 3档，4档，5档才能挂，红绿灯停的时候，还得从5档4档，3档一点一点的下来，然后靠边停车，这个过程是很难的，而且过程也很繁琐，但这个是我们的必经之路。</span></p><p><span>一旦开熟练了，我们会发现教练教的方法，根本用不上的，因为我们学会了自己的方法，开始变得贯通。</span></p><p><span>其实做任何事情都一样，好比是做一个工作岗位，也是一样的，刚开始到一个企业去工作，到一个团队当中去工作，我们都需要按部就班地学习，人家教给的方法，会觉得其难百倍，会觉得过程很繁琐。</span></p><p><span>但是一旦我们养成了新的习惯，新的思维方式，熟能生巧的时候，自然而然就是那个状态，一点都不累的。所以这是我们每个人，必须要经历的过程而已。</span></p><p><span><strong>“东灭西生，非究竟廓然之道也”。</strong>我们从事情上改，用这些戒的方法，东灭西生，什么意思？这个事情我们会发现，刚开始禁止了，用戒的方式，那个事情又发生了，刚把这个事情禁止住，会发现那个事情，依然还存在。</span></p><p><span>刚告诉自己不要发脾气，又发了，但是控制住了。我们会发现，碰到一个事情，我们就开始去责骂别人，碰到一个事情，就开始去抱怨别人，不停地东灭西生，就是这样一个过程，所以非究竟廓然之道也。</span></p><p><span>不究竟就是不彻底，廓然就是还不能尽除，这样终究不是究竟的彻底的解决方法，只是我们修行当中的一个阶段，但也是我们每个人成长路上，所必经之路。</span></p><p><span>好比我们现在小孩子成长走路也是一样的，比如说我们现在大人走路，可以很随意的就走了，但是刚开始现在的孩子们，是不是要用学步车，要用学步车去代步，会推着学步车走。</span></p><p><span>但那个是他必经之路，当他走稳了以后，推步车就可以不要了。我们修行改过也是如此的，当我们懂了更多的理，当我们的心念发生变化，会发现，是自然而然的状态，那个才是究竟之法，所以这个只是中间的过程。</span></p><p><span><strong>“善改过者，未禁其事，先明其理”。</strong>开始给我们递进，深入了一个层，刚才讲的是从事上改，是从戒上修。这个时候告诉我们了，比这个更善于改过的人，是要先明其理的，事情还没有发生，我就先明白这个道理，自然我们那个行为就不会产生。</span></p><p><span>开始举例了，<strong>“如过在杀生，即思曰：“上帝号生 物皆恋命，杀彼养己，岂能自安？”</strong>比如说我们的过错在于杀生，这个时候我们就开始思考，思考什么？</span></p><p><span>我们懂得这个道理，我们去思考上天是有好生之德的，所有的有生命的物体，都很珍惜很爱恋自己的生命。我们难道不是一样的吗？我们不爱惜自己的生命吗？哪怕小猫小狗，它不爱惜自己的生命吗？</span></p><p><span>我们看新闻，会有很多这样的例子，比如说我们要杀牛，还有羊，还有猪，有的都是流泪的，为什么流泪？它也悲伤，所以叫有情众生。它也是有感情在的，如果我们懂得，上天有好生之德，所有的生命，只要不是自愿被杀害，它都有怨气，它都是悲伤的，它都是痛苦的。</span></p><p><span>思及如此的话，还会因为一口吃食，一时的口腹之欲，而去伤它的性命吗？我们的心岂能安呢？当这个道理明白得越深刻，会发现，我们再吃肉杀生的行为，自然而然就不发生了，所以这叫从理上去明。</span></p><p><span><strong>“且彼之杀也，既受屠割，复入鼎镬，种种痛苦，彻入骨髓”。</strong>不光是我们杀害它的生命，并且杀害的时候，要受屠宰、受屠割，并且还要接受我们的烹饪。鼎镬，就是古代烹饪的两种器具，我们现在用锅。尤其大家想一想，吃那些海鲜都活着就下锅了，我们去看看不残忍吗？</span></p><p><span>如果我们懂得换位思考的时候，我们是一个有生命的一个物体，有生命的有情众生，如果被扔在那个锅里，以前古代是不是有酷刑？把人扔在油锅里炸，我们去想一想不痛苦吗？不但要受人宰割，还要在那个里面炸的，炸完了再去吃，想一想我们于心何忍？</span></p><p><span>而我们只是为了口腹之欲而已，我们吃它，也是这么活着，不吃它，我们也能生存，可是我们拿来的，却是对方生命的代价。</span></p><p><span><strong>“己之养也，珍膏罗列，食过即空”，</strong>那说我们杀这些生，为了什么呢？是为了养活自己的生命，蓄养自己的身体。很多山珍海味的东西，珍贵的东西，罗列在我们面前，可是食过即空。</span></p><p><span>想一想，今天我们吃再多的山珍海味，吃再多的活物，吃完了之后它也是空的，到了我们身体里，我们还要把它消化掉，还要把它排泄掉，吃完了其实什么都没有。</span></p><p><span><strong>“蔬食菜羹，尽可充腹，何必戕彼之生，损己之福哉？”</strong>所以告诉我们粗茶淡饭，其实完全可以充饥的。《道德经》里讲：“圣人为腹不为目”，说圣人只吃饱肚子就好了，不需要格外的特殊目的。</span></p><p><span>比如说我们吃不是一样的吗？我们吃饱肚子就可以了，不挨饿就可以了，粗茶淡饭也可以办的到，又何必戕彼之生？戕是什么意思？就是杀害。</span></p><p><span>以前古人说：<strong>“勿要自戕”，</strong>就是不要自杀，我们不要去杀害生命，来填饱肚子，并且损己之福，得不偿失，我们杀害这些物命，是损害自己的福报的。</span></p><p><span>刚才讲过了，上天都有好生之德，我们再去看看这些古之圣贤，哪个圣贤是不好生的？哪个圣贤是不慈悲万物的？所以我们也是一样的，越慈悲的人，才越合天道。</span></p><p><span>这个道理就是在告诉我们，要是明了这个理，自然就不会产生那个行为，在生活当中，其他的事情也是一样的。</span></p><p><span>比如说，我们要是深刻地明白，我发脾气，不但不能解决问题，只会让事情变得更糟糕，我苛责他人，不但不会解决当下的问题，反而让自己产生怨恨，让他人产生痛苦和烦恼。这个道理明白的越深刻，自然就不去发脾气了，自然就不去责骂他人了，这就叫从理上改过。</span></p></div>"
},{
    "title": "第十二讲《改过之法》理明过自止",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>第十二讲《改过之法》理明过自止</strong></span></p><p><span><strong>“又思血气之属，皆含灵知；既有灵知，皆我一体。”</strong>我们又要去思考，凡是有血、有肉、有灵的，皆我一体，跟我们其实都是一样的。</span></p><p><span><strong>“纵不能躬修至德，使之尊我亲我，岂可日戕物命。”</strong>纵使我不能躬修自己的德行，让这些有情的生命尊我、亲我，我怎么还能去杀害他？我们在生活当中经常看到这样的例子，比如说我们去有的地方旅行，如果这个地方的人都是文明的，都是有素质的，鸽子见人都不飞的。</span></p><p><span>前几天新闻还在讲，云南昆明的一个地方原来有鸽子，人去逗它玩耍，给它东西，它是落在人的身上吃的。后来有一个人抓鸽子，被曝光了。为什么这些鸽子不飞呢？因为这里的人不伤害它，所以它才不飞。如果这里的人，鸽子到这里，就是抓它的、就是打它的、就是伤害它的，它会不飞吗？</span></p><p><span>比如说，我们在山里碰到的很多鸡，我们都说这是修行的鸡，它不仅不慢地走，因为它知道我们不伤害它，假如说我们路过一次打它一次，路过一次打它一次，再有人来它就跑，为什么？因为伤害过它。</span></p><p><span>所以这里告诉我们说，我们不能躬修至德，让这些有情的生物、动物，尊敬我们、亲爱我们， 即使我们做不到，我们也不能去杀害它，告诉我们这样一个道理。</span></p><p><span>其实我们要懂得慈悲之道的，比如说家里养小狗的，都是一样，养这个小狗的时候，如果家里有一个男主人，或者是谁，见狗就打，会发现狗见着我们就躲起来，但是有的人很喜欢狗，见狗就摸摸它，抱抱它，只要我们一回家，它就蹭在我们身边，这是不是就是亲我、尊我？</span></p><p><span>跟人相处不是这样的道理吗？这个人是和蔼的，这个人是可亲的，这个人是有德行的，别人才愿意跟我们接触。反之，见着我们就躲着走，生活当中有这样的人吗？</span></p><p><span>“千万可别来找我，看到他的电话都头疼，他怎么又给我打电话？”为什么？这个人的德行实在是不够，我们看到所有跟他有关系的东西，都想逃避。我们对所有的东西不是一样的吗？</span></p><p><span>动物也是有感知能力的，比如说咱们院子里那些小鸟，因为没人去赶它，它有时间就往这里落，如果落一次我们赶一次，落一次赶一次，我们会发现，它是不靠近这里的。看看现在我们，只要有人类居住的地方，很难有动物生存，因为我们伤害它。</span></p><p><span>但是我们想一想小时候，身边动物是不是很多？八零后的这代孩子，小的时候是不是很多动物？现在还有吗？都跑掉了，因为我们不停地在伤害它们，所以它们只能不停地往深处走，即使我们不能让这些有生命的物体都来尊重我们，但是我们也不能伤害他们。</span></p><p><strong><span>“使之仇我憾我，于无穷也？”</span></strong><span>让它们仇恨我，一直没有尽期。看动画片是不是看过这样的场景？动物会讲话，狼群、熊族或者狐族都会说：“看没看见有灯火的地方，不要去，那里住着人类，如果去到那里，他们会伤害我们的。”</span></p><p><span>看没看过《大鱼海棠》？椿的母亲就跟她讲：“一定不要跟人类接触，他们看似很美，只要一接触，他们会伤害我们的，就回不来了。”为什么这样讲？因为有前面发生过的事情。</span></p><p><span>我们看动画片，是不是都这么教育孩子的？其实在告诉孩子善良，告诉孩子不要去伤害这些动物，它们是知道的，它们也是有感情的，它们有它们的思维，它们有它们的语言。即使我们不能爱它们，我们也不要去伤害它们，让它们愁我恨我，这个道理明白得越深刻，那个行为自然就不发生。</span></p><p><span>每当我们要吃肉的时候，每当我要伤害动物的时候，就想起来，我们学《了凡四训》的这段话，是不是我们的行为自然就不那样去做了？我们看其他的事情也是一样，我们还做那么多不好的行为，就是因为我们不明理，我们学的东西太少了。</span></p><p><span>我们不懂得上天好生之德，我们不懂得那些善良的事情，我们不懂得天道循环的规律，所以多学习才能明理，明理我们的行为才能发生变化。</span></p><p><strong><span>“一思及此，将有对食伤心，不能下咽者矣。”</span></strong><span>我一思考到这里，即使面对这些美食，就是指的有生命的，我是难以下咽的，我怎么能吃得下去呢？很多朋友，我们在学习的过程当中，大家在直播都在问：“老师为什么要吃素？”</span></p><p><span>《了凡四训》这里讲了，为了不伤害更多的生命，为了不需要那么多的欲望，我们只是为了吃饱，吃点素食不好吗？身心还健康。</span></p><p><span>大家跟着学习儒家文化之前，我们不认为很多东西是错的，当我们认为的时候，会发现，自然就开始去修正。我们刚才讲的这段道理，是生的慈悲心，慈悲心从哪生？从明理上生。</span></p><p><span>理从哪来？从我们学习上来，是只有不断地多学习，才能明理，那个慈悲心、仁爱之心自然就出来了。就像大家天天跟着一起学《论语》的时候，我们就懂得里仁为美了，如果不学，怎么懂得？</span></p><p><span>我们讲每天的行为，大家懂得居敬而行简，是不是这个道理我们越明白的时候行为自然就发生变化了？如果不懂得居敬，会发现我们做事情就是没有灵魂的。</span></p><p><span>同样说一杯水，我们给别人倒水的时候，是含着敬意的，他能不能感受得到？是不是感受得到？“来，喝水喝水，喝就行。”（随意、轻慢的态度）什么感觉？</span></p><p><span>我们心里就看不起这个人了，心里就是傲慢的，觉得他不如我，所以我给他倒水就是这个状态。倒水是个很简单的行为，但是我们居敬而行简还是居简而行简，就是完全不同的状态和境界。</span></p><p><span>我们做事情不是一样吗？我们做当下那个事情要是满怀敬畏之心的，看看做出来那个事情，就很严谨很细致。如果不是，做那个事情就很粗糙、很不用心，做得非常不好。</span></p><p><span>包括用一件东西，我用一个手机，用一个电脑，我看一本书，如果我们是对它有敬意的，就会爱护这个书，就会爱护这个手机，就会爱护这个电脑。</span></p><p><span>否则电脑如果会讲话都不想跟着我们，都会来找老板：“能不能给我换个人，我不想跟他干了，太苦了，老摔打我，它都影响我心情了，为什么我的转速这么慢？” 想一想是不是这样的？因为我们不爱惜它、不敬畏它，它又如何敬畏我们？</span></p><p><span>我们开车是不是一样的？我们要是很爱惜车的人，车就被我们保养得很仔细，它就不出问题，它不出毛病，很多人用东西摔摔打打的，我不对它敬，它就不对我敬了，其实万物都一样。</span></p><p><span>我们再往深一点讲，我们对这个杯子敬，我们对手机敬，我们对电脑敬，我们敬重他人，那到底是敬重谁？是自己。是我们自己心怀敬意，是我们自己心怀仁慈之心，我们明白上天有好生之德，这是自己尊敬自己，不是他人，不是这个杯子，不是那个电脑。</span></p><p><span>所以我们要懂得这个道理会发现，做事情就是平缓的，就不会对电脑拍拍打打，就不会拿个东西乒乓直响，就不会关个门都是哐哐的，对吧？走个路就像地震一样，我们在那路过之后，所有人都在想，刚才过去是谁？</span></p><p><span>一会我看看这个人怎么那么没有素质。过去一个人如果那么大的声音，我们的心里潜意识当中是不是这样想的？</span></p><p><span>我们一定要懂得不断地去修正自己的行为，我们这些学来的文化越多、道理越明，我们的行为就自然发生变化。要是不明白这些道理，我摔摔打打杯子那些东西，我摔它不是正常吗？</span></p><p><span>我买来就是摔的。那我这个电脑买来不就是用的吗？我爱惜它干嘛呢？我凭什么尊敬它，它都没先尊敬我，我为什么要先尊敬它呢？</span></p><p><span>这是我们没学习以前就是这个状态的，当我们有了更多仁爱之心，明白了更多的理，我们的行为自然而然就会发生变化。更深一层是从理上改过，就不只是事情发生的时候再改过了，那个是最初级的阶段了。</span></p><p><span>如前日好怒，必思曰：“人有不及，情所宜矜。”又开始举例子了，比如说以前总发怒，这个时候就开始思考了，人人都有不及，人无完人，任何人都不是最完美的，都是有所不及的。</span></p><p><span>我要懂得同情和哀怜别人，当别人发生了一个错误，发生了一个事情，我想要发怒的时候，我就想其实人人都不完美，他今天做错一个事情，只是他这方面还不懂，所以我尽量地去包容他，我又何必生气？我告诉他，让他下次做得更好就行了。</span></p><p><strong><span>“悖理相干，于我何与？”</span></strong><span>干是什么意思？就是干扰，侵犯到了我。即使有的人违背了道理，冒犯到了我，干扰到了我，于我何与？与我又有什么关系？这里我们延伸一下，要不然可能不好理解。</span></p><p><span>比如说我们走在大街上，有的人不尊重我们，用眼睛横我们一下、瞪我们一下，我们要明白一个道理，这个人，这样是他的一种习惯和习性，他不光瞪我们，他谁都瞪，即使看到一只羊，他也瞪眼，因为那是他的行为习惯。</span></p><p><span>比如说有的人爱发怒，有的人愿意骂人，他谁都骂，他不只是骂我们。现在流行一个词叫——网络喷子。他喷我两句，何必在意呢？他不是只喷我，他谁都喷。有的人就是这个样子的，怼天，怼地，怼空气，没有他不怼的东西。只要出现在他的世界当中的全怼，那是他的习惯，与我何干？</span></p><p><span>要明白这个道理就懂了，我们再反过来讲也是一样的。有的人赞美了我们，也不要太过于高兴，得意忘形，为什么？赞美也是他的习惯，不光懂得赞美我们，他也懂得赞美其他人，因为那个人的内心是良善的，赞美只是他的习惯，我们何必得意忘形。</span></p><p><span>所以我们要懂得这个道理，就不会在意那么多事情，是不是我们的行为就不会发生？在生活当中到处都是这样的事情，我们只有更加地明理，我们才过得淡定从容，生活当中才会少烦恼、少是非。</span></p><p><span>比如说举个很简单的例子，现在我们经常开车，这两年全民的素质都在提高，已经好多了。开车在路上的时候，跟一个人不小心发生了剐蹭，甚至没有发生剐蹭，有的人脾气暴怒的，上来就骂，这个时候我们要再去回骂，只会招惹更多的是非，也耽误他的时间，也耽误我们的时间。</span></p><p><span>但是有的人不起情绪的，“不好意思，刚才我实在没注意，耽误您的时间了。”会发现当我们这样一说，通常对方都怎么说？“没关系没关系，算了，都不是有意的。”</span></p><p><span>就好比是走路，我在机场，有的时候去高铁站，经常碰到这种事情，比如走路有的时候，可能不小心踩了人家一下，或者有的人不小心踩了我们，有的人怎么说：“不好意思，大哥，真的不好意思，我没注意，我着急赶车，实在抱歉。”大哥怎么说？“没事的，快走吧，抓紧时间快走吧！”</span></p><p><span>想一想？如果我们踩了别人一下，或者别人踩了我一下，说：“怎么走路的？”他说：“你怎么走路的。”“你怎么走路的？”两台复读机，就越吵声越大，最后就沾染了很多是非，自己也惹了一肚子气，对方也惹了一肚子气，何必呢？这样的人都是还不懂得自我修养，所以才会这个样子的。</span></p><p><span>要知道每个人平时都有他自己的习惯和习性，懂得这个道理，就不爱与人计较，碰到事情才能淡定从容，我们的情绪不起，很多事情就不发生，行为自然就没有过，这是改过从理上改的妙处。</span></p><p><strong><span>“本无可怒者。”</span></strong><span>其实有什么可能怒的？为什么会怒？就是不明理，所以怒的。</span></p><p><strong><span>“又思天下无自是之豪杰，亦无尤人之学问，行有不得，皆己之德未修，感未至也。”</span></strong><span>所以我又开始思考，天下是没有自以为是的豪杰的，看看哪个圣贤、哪个豪杰是自以为是的？</span></p><p><span>“碰到事情都是我对，别人都是错的。”</span><span>碰到事情都是别人的问题，都是指责和抱怨他人的，都是自以为是，自己都是对的。看看哪个圣贤是这样讲话？是这样思维的？越是优秀的人，人家越谦德、越谦虚、越随和。</span></p><p><span>碰到事情，“其实还是我做得不够好，还是我的德行不够，我自己还需要努力，我才能去影响帮助更多的人。”豪杰、圣贤都是这样讲话的。越是不好的人都怎么讲话？</span></p><p><span>碰到问题手指就往外指。我们会发现，往外指的时候，大部分还是回内的，这几个手指是不都是回来告诉自己的？当我们不断地学习，我们就懂得这样讲话了，就懂得往自己这里指了，这也是一种思维意识和习惯。</span></p><p><span>我们去观察，往往越是优秀的人、谦逊的人讲话，指向自己讲的多，通常举例子的时候，讲话的时候都是指着自己讲的。而指责他人的人，习惯这样思维，碰到事情就是往外指的，就是对别人指指点点的。所以我们去观察他们讲话时的手势，就知道一个人的思维习惯。</span></p><p><span>尤：怨恨，抱怨。没有一个文化是告诉我们抱怨和怨恨他人的。看看哪个圣贤的文化是告诉我们抱怨、怨恨他人的？所有的文化都在告诉我们“行有不得，反求诸己”，这是孟子讲的。当我们做得不够好的时候，我们要知道，还是自己的德行不够，还是自己的行为不够，不是他人的问题。</span></p><p><span>《中庸》的作者，子思子讲：“正己而不求于人，则无怨，上不怨天，下不尤人。”《论语》讲：“三人行，必有我师，择其善者而从之，其不善者而改之。”三个人在一起，也一定有我的老师，告诉我们要懂得谦虚、谦逊。</span></p><p><span>“择其善者而从之”，他身上有好的地方，我们就学来。“择其不善者而改之”，如果他身上有不好的地方，我要引以为戒，不要向他学习，只有我们通过不断地去学习，不断地去修正自己，我们的理才会更明，当明了理，我们的行为自然就减少过错。</span></p><p><strong><span>“吾悉以自反”，</span></strong><span>我把所有的事情，都开始用来自我反省，当我发生所有的事情，都是向内反省自己，而不是自以为是地指责、抱怨他人的。讲到这里，这是了凡先生他一生的经历，这个时候他开始跟儿子语重心长地讲这番话，告诉我们做人的道理，告诉我们改过的方法。</span></p></div>"
},{
    "title": "第十三讲《改过之法》心善正念先",
    "date": "2022-07-18",
    "html": "<div class=\"B1_text\"><p><span><strong>第十三讲《改过之法》心善正念现</strong></span></p><p><span><strong>“则谤毁之来，皆磨炼玉成之地，我将欢然受赐，何怒之有？”</strong>他说当我懂得所有的事情，开始自我反思的时候、自我反省的时候，所有的毁谤、所有的伤害、所有的误解，都是来成就我的。这里的“玉成之地”就是指的促成、成就我的。所有事情的发生，其实都是来促成我往更好地去修正自己，都是为了成全、成就我的，我应该欢然受赐。</span></p><p><span>我们经常讲一个词——感谢赐教，我们要懂得这个道理，生活当中所有发生的、我们原本认为不如意的那些事情，不都是来教化我们的吗？我们应该欢然受赐。每件事情都是来让我们成长的，就是因为我们生活当中发生了那么多我们认为不如意的、不圆满的事情，那些事情才会真正地让我们去成长。</span></p><p><span>我们每个人的人生不是如此吗？往往遇到了一些品行不好的人，往往遇到一些磨难之事，那个所给我们的教训和教育意义是不是往往更大？所以那些事情，都是来磨练我们的，都是来成全我们的，何怒之有？</span></p><p><span><strong>“又闻谤而不怒，虽馋焰熏天，如举火焚空，终将自息。”</strong>我又听说，如果接受了一些别人误解的、毁谤的语言，而不发怒，这个时候很好玩，结果是什么样的？结果就是“虽馋焰熏天，如举火焚空”，好比是什么？举着火焰对着天空点燃，因为天空是虚空的，他是虚无的状态，他不理我们，人家也不生气，我们终将自息。</span></p><p><span>好比是我们遇到了一个很怨恨的人、吵架的人。夫妻之间是不是都这样？如果一方发火、一方愤怒，那一方不理他，他自己吵着吵着就不吵了。但是如果两个人对着吵，这个事情就没完没了。如果他只有自己一个人在那吵，终将自息，没人理会，他自己就灭掉了。</span></p><p><span>生活当中到处不都是这样的事情吗？当我们总是和身边的、我们认为的那些小人计较，会发现两个人就没完没了。当我们和他计较的时候，我们又能比他高明到哪里去？</span></p><p><span>我们在直播的时候，每天基本上都会遇到这种情况，每天都会出现有人骂我们，每天都出现有人不理解我们，如果我们不停地跟他计较，会发现我们两个人的水平实则差不多。</span></p><p><span>我经常讲一个例子，当我们自己三十岁的时候，还会跟一个六岁的孩子争吵？不会吧。“孩子，你说的都对，我的错，我有问题，你说的对。”我们根本就不理，可是什么样的人会跟六岁的孩子不停地争吵？我们在七岁或者八岁的时候，比他大不了多少才和他吵架，如果是三十岁的人，我们会跟一个几岁的孩子争吵吗？母亲培养孩子写作业不算。</span></p><p><span>经常吵是因为我们起情绪了，所以才吵。我们是不会和别人家的孩子五六岁吵架的，但是和自己家的孩子不一定。所以生活当中到处都是这样的事情，刚才我们只是用了一个年龄的差距来举例，是为了让我们听明白这个道理，从思维上何尝不是如此？</span></p><p><span>如果我们的境界更高，就不会和一般人去见识。这个世界上的那些优秀的人们，他会和普通人一般见识吗？人家根本就不理会，我们想跟人家吵架人家都不理我们，哪有那个时间？他看着是一件很可笑的事情。当我们的境界够高的时候，看别人跟我们争吵，不觉得很可笑吗？我们懒得跟他多说一句话。</span></p><p><span><strong>“闻谤而怒，虽巧心力辩，如春蚕作茧，自取缠绵。”</strong>如果我们听到很多不好的语言，就开始生气，开始发怒，费尽心力地去辩解，其实自取缠绵，无非是作茧自缚。</span></p><p><span>在生活当中是不是也一样？当我们碰到了一个事情，我们正在做着一个事情，别人不理解我们的时候，我们是不是开始不停地解释？不停地跟对方讲我在做什么，我做这个事情有多好，我现在决定有多么正确，会发现越解释越黑，越描越不清楚，他不理解我们的时候，无论我们怎么讲，他都不理解。</span></p><p><span>我们不要去埋怨任何人，别人为何不理解我们？是因为我们做得还不够好，所以他才不理解，当我们让自己变得更好，我们做出一些成绩来的时候，别人就理解了，不需要去解释那么多，无非是作茧自缚罢了，只会让自己变得更烦恼，只会和它缠绕在一起，所以叫自取缠绵。</span></p><p><span>比如我们跟一个人吵架，如果他吵我们不吵，就是淡定地看着，如果我们和他一起吵，是不是就自取缠绵呢？所有的事情都缠绕在一起，乱的像一锅粥一样，从当中理不出思绪的。所以我们要懂得明更多的理，不断地修正自己的行为，让自己变得淡定从容，遇到事情的时候能飘然物外，这个时候我们的感受都不同了。</span></p><p><span><strong>“怒不惟无益，且有害也。”</strong>我们发怒，不光是没有艺术，而且是有害的，怒是不是伤肝？然后怒还伤身。当怒了还起情绪的时候就会产生不好的行为，还损我们的德行。本来一件事情如果我们不发怒还不错，一旦发怒，行为开始有失偏颇，还损耗自己的德行，败坏自己的名声，所以发怒实在是有很多害处的事情。</span></p><p><span>不伤生命这一段，有的朋友听到可能会说：“我不吃这些动物的生命，我不吃这些肉，我的营养跟不上，我怎么养生？我怎么保养自己？”其实最大的养生是什么？是不起情绪，没有情绪才是最大的养生，如果每天都是被情绪所困扰，我们吃什么又能管用吗？</span></p><p><span>当我们很悲伤很痛苦的时候，即使有那么多好吃的放在面前，我们是不是有一种食之无味的感觉？好像吃起来什么味道都没有，甚至一边吃一边流泪，为什么呢？因为我们的情绪是处于伤感的状态的呀，所以最好的养生是不被情绪左右。</span></p><p><span>当我们的情绪是喜悦的，当我们的情绪是如如不动的、是不悲不喜的，气色自然就好。遇到一个好久不见的朋友，怎么讲话？最近肯定心情不错，为什么？气色很好。我们会发现心情好，气色就好，整个身体的状态就好，我们的精气神就好。</span></p><p><span>所以最好的养生是情绪，绝非我伤害了什么物命，绝非是我们外在拥有了什么东西，那个不会让身心真的安泰，情绪才是最好的方法，所以要懂得控制自己的情绪，少发怒、少生气、少抱怨，多向上、多向善、多向着阳光，自己的身心才会更加得健康。</span></p><p><span><strong>“其余种种过恶，皆当据理思之。”</strong>之前只是给我们举了两个例子，杀生和发怒的，接下来告诉我们，还有种种的过恶。生活当中到处所做的那些过失和不足的地方，都应该据理思之，所以我们要懂得不断地学习，明更多的理，才能更好地改过。</span></p><p><span><strong>“此理既明，过将自止。”</strong>这个理越明，那个行为自然就不发生，所以过将自止，自动就止住了。我们看武侠剧，那些武林高手，即使他内功相当深厚、纯熟，就好比是一个人天生就忠信，生而知之，可是他要不要学招数？不学招数内功是发挥不出来的，总不能拿内力打。</span></p><p><span>我们得学方法，那个时候的方法就是拿来用的，他学什么招式都管用。随便教我两招剑法，照样拿出这两条剑法随意挥洒，因为他内功深厚。生而知之的人，内心本性就是纯良的人，本来就是有智慧的人，可以什么方法都不会，现学都来得及，拿过来就用，这就是区别。</span></p><p><span>但是不学招式是不行的，而不是说我就会一套剑法，必须得练我这套剑法，世界上只有我这套剑法是最好的，高手有这么讲话的吗？高手都是无招胜有招，哪个门派都有自己的看家本领，没有不好的功夫，看谁用，一个很普通的功夫，在一个高手手里，马上就变得不同。</span></p><p><span>所以通过一个人的思维方式，就看到这个人境界在哪里了，看看有没有很多这样的人？我学了点东西，只有我学的是最好的，别人学的都不对，只要听到跟我学过的讲的不一样就会说：“他们那个不究竟，他们讲的都不对，只有我这个才是对的。”我们就知道这个人的我执和法执有多重。</span></p><p><span>越是有成就的人，越是有智慧的人不是那样讲话的，也不是那样做事情的。什么样人这样做事情？“就我懂，你们都不懂。”比如说做个电脑，“就我明白，你们根本就不明白。”这样的人基本上就走到头了。</span></p><p><span>我们去观察，生活当中到处都是这样的人。做生意，“你们懂什么？我已经做了二十年了。”结果呢？二十年还不如别人做两年的。但是他不懂这个道理，认为是运气不好，“做两年能做好的无非是赶个好时候，我做二十年那个时候，你不知道我那时候有多艰难。”</span></p><p><span>他不懂的是这个道理，做了这么多年依然做不好是有问题的，思想是有局限性的，只是他不明白，他认为是社会的问题，是时代没有给他机遇，实则不是的，是思维压根就没出去，这是一个很大的症结所在，卡在那个地方了。</span></p><p><span><strong>“何谓从心而改？过有千端，惟心所造。”</strong>讲到第三层了，讲到从心上去改过了，无论过错有多少，千是一个数词，量化的概念词，可能还有万端，八万四千烦恼、过错可能也有八万四千种，所以只是一个数字，告诉我们一个概念。即使有千万种过错，都是唯心所造，都是我们的心念起，所以才有的过错。</span></p><p><span><strong>“吾心不动，过安从生？”</strong>如果我们的心念是不动的，过又怎么能升起呢？我们这些心是从哪些事情上升起的？我们的心升起来的念头，都是因为欲望。</span></p><p><span>接下来开始给我们举例了，“学者于好色，好名、好货、好怒，种种诸过，不必逐类寻求。”说我们自己心念动，都是因为这些欲望所产生的，比如说有好色，这个好色，不只是男女之间的色情，还指我们所有能看见的，都叫色。比如说我们喜欢一个什么颜色的东西，我们喜欢一个什么能看得见的物质的东西，都叫好色。就是喜欢这些美好的东西，都想占为己有。</span></p><p><span>好名，很在意我们的名声，很在意我们自己的名望。我们再往小了讲，比如说，太在意别人对我的看法，太在意别人尊不尊重我，都是好名。太好自己的脸面，这都是名。</span></p><p><span>为什么我们要在意别人赞不赞美我？或者他是不是误解我？都是好名所导致的，都是被我们这个名字，被我们脸面所控制、所束缚了，所以才产生了那么多的情绪和那么多不好的心念。</span></p><p><span>如果我们是不好名的，他误解我或赞美我，又有什么区别？没有什么区别，都一样，他赞美我也好，误解我也好，我还是我，只不过是我们好了这个名，好了自己的脸面，活在自己执着的相里了。</span></p><p><span>好货：就喜欢那些好的东西，喜欢那些财物。好怒：容易发脾气，容易暴怒。因为人的这种本性，就是好怒的，但是这个不是天性，天性是本善的，人性是本怒的。为什么会产生这些怒？因为人的本性会产生生存的欲望，有了这些生存的欲望，在争夺这些欲望的过程当中，就会发怒，就会起情绪。</span></p><p><span>比如为什么会和对方发怒？总想证明我自己是对的，总想我去压倒他，或者为了得到一个什么东西，有可能是为了得到一些钱财，有可能是为了得到名声，也有可能是为了得到虚荣的那一面，认为必须要证明我比他厉害。</span></p><p><span>这些都是引起我们发怒、起情绪的原因。种种诸过，太多了，以此类推太多太多的过错了，但是我们不需要一项一项的去追寻，为什么不需要一项一项去追寻？下面给了我们答案。</span></p><p><span>“但当一心为善，正念现前，邪念自然污染不上。”只要我们一心向善，正念现前的时候，所有不好的念头自然消失。我们经过一段时间的学习，经过一段时间的修行是不是这样的？我们不需要每件事情都要明理，我们的心只要是善的，只要是怀着仁德的，只要是懂得为他人考虑的，我们会发现很多邪念自然就不产生了。</span></p><p><span>这里讲一个例子让大家好理解，比如，看我们种地是不是都是一样的原理？我们种地叫田地，还有一个词叫什么？叫心田。比如说我们那块田地荒废的状态下是不是杂草丛生？这个时候要怎么办呢？</span></p><p><span>要懂得种心田，要在田地上种庄稼，当懂得种庄稼的时候，是不是杂草就会变少？种庄稼的同时呵护着庄稼的成长，有杂草的时候，就不断地把它拔除，是不是庄稼就会越长越好？杂草自然就会越来越少。</span></p><p><span>同样我们的心田怎么种？我们不停地去种正念，不停地去种善念，不停地去学习更多圣贤的文化，让光照进来，让善良照进来，那些邪恶的、不好的念头，是不是自然就此消彼长，自然就会越来越少。</span></p><p><span>所以说不要每天纠结于我们那些不好的念头、不好的情绪，而是要懂得通过不断地学习让心种满阳光，让心种满良善，让心种满正面的种子，这个种子在逐渐地发芽的过程当中，那些杂草和不好的念头，自然就会一点一点地消散。</span></p><p><span>从心上改一定是最后的阶段，我们要从事上改，用戒来约束自己的行为，我们要从理上改，去学习更多的文化，学习更多的修身之道，逐渐的苗子、种子越长越高，越长越好，这个时候不好的念头自然就会变少。</span></p><p><span>当那些念头变少，我们不用明理，行为也自然就会变得好，因为我们早已经明过理，自然而然就在心性上。</span></p><p><span><strong>“如太阳当空，魍魉潜消，此精一之真传也。”</strong>这好比是太阳当空照，所有的魑魅魍魉（chī mèi wǎng liǎng）自然消散，只要是太阳出来了，所有见不得光的东西自然就会消散。我们也是一样的，当我们的心田照进来光的时候，天光普照。</span></p><p><span>光明进来的时候，所有阴暗的、见不得光的东西，自然就开始逐渐消散了。所以我们去种植善良、种植阳光，让我们的内在充满仁爱就好了，所以“此为精一之真传也”。</span></p><p><span><strong>“过由心造，亦由心改，如斩毒树，直断其根，奚必枝枝而伐，叶叶而摘哉？”</strong>所以我们的这些过错，是由心所造作的，自然由心上去改，就好比是斩一棵毒树，我们直接连根斩掉就可以了，何必每个树枝、每个树枝的去砍？</span></p><p><span>何必去把中毒的叶子一片一片摘落？就是告诉我们这个“精一之真传也”，是从心上改过的，这才是最好的最上的方法。</span></p><p><span>不需要再从理、从事上逐步地去改变，从理上去改，就好比这里指的枝枝而伐，从事上去改就是叶叶而摘，从根上去解决这个事情，这样就是最有效、最快速的精一真传之方法也。</span></p><p><span><strong>“大抵最上治心”，</strong>这里了凡先生还是很谦虚的，大抵是什么意思？大概、差不多。这是大概是最上乘、最高明的方法了，就是治心。</span></p></div>"
},{
    "title": "第十四讲《改过之法》奋发勿自误",
    "date": "2022-07-18",
    "html": "<div class=\"B1_text\"><p><span><strong>第十四讲《改过之法》奋发勿自误</strong></span></p><p><span><strong>“当下清净，才动即觉，觉之即无。”</strong>治心的方法是当下就可以清静的，<strong>“才动即觉，觉之即无”，</strong>什么意思呢？也就是当我们懂得觉察心里的念头时，当一个念头一起，我们就觉察到了，当一觉察这个念头，灭掉，后面的思维和行为都不会产生，这才是最上乘的方法。</span></p><p><span><strong>“苟未能然，须明理以遣之。”</strong>如果我们做不到这个样子，那就需要什么？先明理以遣之，就像刚才我们讲的，当我们懂得这个道理，就懂得控制自己的行为，让那个行为不发生。</span></p><p><span><strong>“又未能然，须随事以禁之。”</strong>如果从理上依然做不到，那怎么办呢？事情发生的时候，我们要懂得及时约束自己的行为，就戒了。</span></p><p><span><strong>“以上事而兼行下功，未为失策。”</strong>以上事兼行下功，我们懂得治心的道理、治心的目标，同时又用理上去修正、事上去约束自己行为的方法，这不算失策。也就是说，我们要懂得以治心为最终的目的，我们要懂得先从心上修正，如果做不到，再从理上和事上，这叫兼行下功。就是我们还不能完全治心的时候，这几个方法是可以并行的，但是我们要知道我们最终要修炼成治心的。</span></p><p><span><strong>“执下而昧上，则拙矣。”</strong>但是我们如果只是执着于下等的方法，就是只有从戒或者从事上干，这个就拙了，太愚笨了，因为这个方法是治标不治本的。我们总不能每次有事情的时候就念紧箍咒，每次有事情就念紧箍咒，而且那个是痛苦的。</span></p><p><span>就好比《中庸》讲的困而知之，有的人就是困而知之，只有碰到困难了、碰到磨难了，我才知道才去改变。就好比是我因为发脾气，已经造成了很多严重的后果——我发脾气，客户不跟我合作了；我发脾气，我的另一半跟我解除婚约了；我发脾气，工作丢了。这都叫困而知之，所以这个就显得笨拙了。</span></p><p><span><strong>“顾发愿改过，明须良朋提醒，幽须鬼神证明。”</strong>我们要懂得发愿改过的时候，在明处要找到一个好的朋友，他可以每天监督我，指出我身上的不足和过错，只有这样，我才能更好地勉励自己前行，用现在的话叫善知识，所以身边有个善知识，是多么难能可贵的事情。当我们有不足、有过错的时候，有别人指出我们的问题，可以让我们不断地去修正自己。</span></p><p><span>“幽则鬼神证明”，这句话告诉我们举头三尺有神明，无论我们做任何事情，其实天地鬼神都是能看得到的。这句话用来警醒我们，要时刻勉励自己，不要以为别人看不到，其实都清清楚楚的。</span></p><p><span> <strong>“一心忏悔，昼夜不懈。”</strong>我们要懂得一心一意地忏悔，黑白不停，每天都是保持不停的精进的状态，不停地改过的状态，我们才能让自己变得更好。</span></p><p><span><strong>“经一七、二七，以至于一月、二月、三月，必有效验”。</strong>一七，就是一周的意思，一个星期七天，经七天十四天，乃至一月二月三月必有效验，说经过时间的积累，我们就能看到很明显的效果了。</span></p><p><span>我们修正自己的过程不就是这样的吗？包括我们积累自己学识的过程也是一样，从小长大不是这样的吗？都是一天两天，用时间积累过来的。这段告诉我们不要着急，一点一点的往前累积，当功夫到达一定程度的时候，自然会有效果。</span></p><p><span>《道德经》讲：“合抱之木，生于毫末；九层之台，起于垒土；千里之行，始于足下。”告诉我们所有的事情都是一点一滴积累过来的，当我们经历了时间的积累，有一些效果和表象，还有象征，我们是可以知道的。通过什么知道呢？这里了凡先生给我们举了正反和两个例子。</span></p><p><span>第一个，正面的，当我们改的过错越多的时候，当我们自身修为越高的时候，当我们的心性越好的时候，就会有如下的这些体验：“或觉心神恬旷”，突然有一天的时候会发现，我的心神是愉悦的，我的精神是愉悦的，我突然好像变得豁达了，心胸变得宽广了。实则是我们改了更多的过，我们变得更有智慧了，这个时候就是我们的正念现前了。</span></p><p><span>“或觉智慧顿开”，想一想，我们不断学习、不断修行的过程，就是这种感受的，突然有一天我们会觉得，碰到事情的时候怎么变得很有智慧了？我看问题好像看得比以前更精准了，这就是智慧开了。怎么开的呢？是我们不断地修正自己，不断地改正自己的过失，不断地积累智慧的过程，所积累而得来的果。</span></p><p><span>“或处冗rǒng沓tà而触念皆通”，冗沓是什么意思呢？就是纷乱和繁杂的事情当中。当我们处在这些纷乱和繁杂的事情当中，“触念皆通”，就是当我们念起的时候，我们的思路是非常清晰的，处理很多事情突然就开始变得通达了，即使很多烦乱的事情、琐碎的事情在我们面前，生活在这些琐碎当中，我们处理事情依然是淡定从容的、思路清晰的。</span></p><p><span>当我们不懂得修行自己，没有那么高的智慧，也没有那么好的心性的时候，是不是事情一杂乱就开始也跟着乱了？事情一多就开始跟着烦躁了？这个都是因为我们身上还有很多的业障，所以当我们不停地修行的过程当中，我们的正念现前的时候、智慧提高的时候，就是这里所说的这种境界。</span></p><p><span>无论事情再多，我们都可以从容地应对，我们都可以思路清晰地去面对。所以我们去看一看，现在和古往今来的智者都是这样的，同样发生一个事情，人家都是能淡定从容的。只有淡定从容，才能从这些纷杂的事情当中，找到快速解决问题的方法。</span></p><p><span><strong>“或遇怨仇，而回嗔作喜。”</strong>碰到了很多让我们不高兴的事情，甚至是别人对我们的误解、指责或者是抱怨，嗔是什么意思？就是生气，我们不但不生气，反而内在是有一种喜悦在的。其实大家学习一段时间、修行一段时间的朋友，都会有这种感受，碰到那些我们觉得原本不太顺心的事情，现在反而不会动情绪，甚至是很喜乐自在的，能恬然容受的状态。</span></p><p><span>因为我们自己内在的正念、良善、阳光都在不停地增加，我们会发现这个时候内在是美的，看到什么都是美的。别人看到的那些不好的、让我们不高兴的事情，但是我们自己心念转变的同时，却能看到美好的那一面，这就是修行的妙处。</span></p><p><span><strong>“或梦吐黑物，或梦往圣先贤提携接引。”</strong>这两种都是一种吉兆，也就是我们梦境的一些好的象征，为什么会梦到这些？日有所思，比如我们白天不停地去学习圣贤的文化，我们到晚上就能梦到。</span></p><p><span>同样，如果白天都是抱怨的、都是生气的、都是发怒的，会发现做梦也在生气，做梦也在担忧、也在忧虑，其实就是“日有所思，夜有所梦”的一种象征。我们白天的心念是美好的，梦也是美好的，和我们的念头相关联。</span></p><p><span><strong>“或梦飞步太虚，或梦幢幡宝盖。”</strong>或者梦到在太空漫步的感觉，何其潇洒，何其自在，是因为自己觉得身心很愉悦、很轻松的状态，才会有这种梦境的出现。幢幡是一种旗帜，一种旗子，宝盖是形容庄严的。我们看电视，以前的帝王在走路的时候，有用珠宝做的盖子，是显得一种庄严相。</span></p><p><span>“<strong>种种胜事，皆过消罪灭之象也。”</strong>当我们梦到这些美好的梦境，这些象征都在预示着说我们的过错在逐渐得变少，我们的良善在逐渐得变多，我们的心性正在变得光明，所以才有这些梦境的出现。</span></p><p><span>接下来重点来了，很多人是不是我做了很多美好的梦，开始过于执着我自己美好的梦境，恨不得梦到什么见人就讲，见人就说，接下来给我们提醒了，“然不得，执此自高，画而不进”，但是一定不要以这个成为我们一种炫耀的资本，开始变得自高自大，我有什么样美好的梦境，好像这件事情就变得有多了不起了，不要那个样子，一旦我们骄傲自满的时候就很难再进步了。</span></p><p><span>接下来告诉我们，一旦我们执此为高，就开始画而不进了，开始画地自限。当有这些美好的梦境，我们自己要清楚的知道是因为我们在不停地进步，不停地去修正自己的心念所出现的象征，但是不要自满，我们要继续前进，砥砺前行，让自己变得更好、更从容、更自在。</span></p><p><span><strong>“昔蘧伯玉当二十岁时”，</strong>有一个人叫蘧伯玉，是春秋时代的，和老子和孔子是一个时代的人，这个人是当时魏国的一个大夫，侍奉三代魏国国君，寿命一百岁。很长寿，他是以贤德和无为所著称的，和孔子是挚友，孔子去魏国，前后长达九年的时间，据说有两次是住在蘧伯玉家里的，两个人是挚交好友，经常在一起是探讨学问。</span></p><p><span>我们的孔夫子，有一位很著名的弟子叫子贡，这位蘧伯玉是子贡的外公，子贡是他最喜欢的一个外孙，从小子贡就受他的影响，后来他引荐子贡拜的孔子为师。</span></p><p><span>这里开始举例，“已觉前日之非而尽改之矣，至二十一岁，乃知前之所改未尽也”。在二十岁的时候，就已经能觉知到自己身上的不足、自己身上的过失，然后开始加以改正，到了二十一岁的时候发现还有很多的不足，也就是说之前到二十岁的时候，修正得还不够。其实我们每天学习、每天修行的人，会深有感触，甚至每天都会发现自己很多新的问题、新的不足，然后再去不停地去修正。</span></p><p><span><strong>“及二十二岁，回视二十一岁，犹在梦中。”</strong>到二十二岁也是一样的，回顾过去的经历，仿佛还是在梦中，自己依然有很多的问题，很多昏沉的时候。</span></p><p><span><strong>“岁复一岁，递递改之，行年五十，而犹知四十九年之非，古人改过之学如此”，</strong>一岁又一岁，逐步地、循序渐进地去改正，到了五十岁的时候，再看过去的四十九年，其实还是有很多的问题，自己还是不足的。古人改过的学问，如此心态坚定，如此严格，如此认真，我们现在讲什么？要日日知非的，我们每天不停地学习，不停地反观自省的时候，每天都能看到自己昨天的不足，每天仿佛都在重生。</span></p><p><span>比如说，尤其是跟在身边的，其实回忆的时候，会特别深有感触，我们去看上个月，甚至去看昨天，会发现自身依然有很多的不足需要去修正，为什么每天要大量的学习？只有通过不断地学习，我们才能看到过去的不足。</span></p><p><span>否则会发现自己就是骄傲自满的状态，认为自己好像什么都懂，自己也好像很了不起，可是我们越学习的时候，越发现自己身上真的有很多的过失和不足，我们需要时刻的谨记，时时刻刻地懂得去调整自己、去修正自己，让自己变得更好。</span></p><p><span><strong>“吾辈身为凡流，过恶猥集。”</strong>如此圣贤之人，还在日日知非，不停地去修正自己身上的不足，何况吾辈凡流呢？我们身上的过失和罪恶特别的多，猥集是什么呢？刺猬的身上刺，它是非常集中、非常多的。这句话在比喻众多，说我们身上的过错非常的多。</span></p><p><span><strong>“而回思往事，常若不见其有过者，心粗而眼翳也。”</strong>当我们不断地去学习圣贤的文化，我们在回顾从前的时候，好像不觉得自己身上有问题。看看我们不学习之前、不懂得修行之前，是不是这个样子的？</span></p><p><span>那个时候回顾自身，觉得自己很厉害，因为那个时候我们的眼睛看到的都是他人的不足，都是看到自己骄傲自大、自满的状态，就好像眼睛生病了一样，看不到自己的问题，看到的都是他人的问题。</span></p><p><span>可是一旦我们学习了更多的文化，一旦懂得修行的时候，才能看到自身的不足和过失，所以我们讲：“未论行善，先行改过。”若想先改过，我们得知善恶，我们得多学习的。</span></p><p><span><strong>“然人之过恶深重者，亦有效验。”告</strong>诉我们，其实我们身上有很多过错和罪恶比较多的情况下呢，也是有表象的，也是有征兆的。刚才举例子说了，当一个人通过不断地修行、不断地改过，会有一些吉兆出现，同样我们身上如果有很多的过错的时候，也会有不好的现象出现。</span></p><p><span><strong>“或心神昏塞，转头即忘。”</strong>接下来这段话，我们每个人都要自省的，如果我们身上还有这些状态，是说明我们身上还有很多的过失，所以我们不停地去修正，就好了。“心神昏塞”，精神是很昏沉的状态，别人跟我们说一个什么事情，说完就忘记了，我们常说的就是什么？记忆力特别的不好，其实都是有过失的象征。</span></p><p><span><strong>“或无事而常烦恼”，</strong>没有事情的时候也很烦恼。看我们生活当中是不是经常出现这样的问题？说有什么事情吗？没有，但是我就是很烦恼、很不开心的样子。</span></p><p><span>《西厢记》里面有一句话：“落花水流红，闲愁万种，无语怨东风。”说闲愁万种，每天特别惆怅，没有事情的时候还怨东风。看看东风真讨厌，把花叶子都吹落了。每天我们生活当中是不是到处这样的事情？没有什么事情的时候也愁，找点什么事情就要开始去抱怨，其实都是有过失的象征，还是我们身上的业力颇重。</span></p><p><span><strong>“或见君子而赧然消沮”，</strong>赧然是什么？难为情，不好意思的样子。消沮就是提不起精神，比较沮丧，比如说我们看到那些谦谦君子，或者看到那些德行比较好的人、比较优秀的人，我们是很难为情的，不好意思跟人家讲话的，见到这样的情况，是提不起精神的，是很沮丧的样子。</span></p><p><span><strong>“或闻正论而不乐，或施惠而人反怨。”</strong>或者听到正法，别人讲的那些美好的东西，我们不觉得有意思，也不觉得快乐，或者明明去帮助了别人，别人不但不感激我们，好像还怨恨、还指责，就像我们老百姓常讲的话：“明明我帮助他了，他为什么还怨恨我呢？”说明我们身上还有很多的过失，障碍住了我们的福德，所以才显得这种相。</span></p><p><span><strong>“或夜梦颠倒，甚则妄言失志，皆作孽之相也。”</strong>做梦的时候都是颠倒，每天做梦很累，做的都是负能量的、都是不好的梦，睡了一晚上起来依然很辛苦，其实都是这些症状的出现。</span></p><p><span>失志是失了心智，更有甚者失了心智，讲话语无伦次、颠三倒四的，自己的思路也很不清晰。以上所说的这些种种，都是我们身上有很多的业障，都是我们曾经做过很多不好的事情所导致的，障碍住了我们的福德，智慧不起，没有清明，不得清静，就是这样的状态。</span></p><p><span><strong>“苟一类此，即须奋发，舍旧图新，幸勿自误。”</strong>如果有这类的情况出现，一定要奋发图强，我们一定要懂得，当出现了这些事情，我们更要快速地前行，更要懂得去不断地修正自己，不断地去学习，让自己明更多的理，不断地去修正自身的过错，否则这种情况只会不断地去延续。</span></p><p><span>其实古之圣贤，把我们整个人所要面临的现状、所会出现的问题，其实给我们罗列得清清楚楚，我们只需要按照这些圣贤文化所教给我们的，对应着去修行就好了，所以最后勉励我们“幸勿自误”，希望我们一定不要再光阴虚度了，不要再耽误我们自己的慧命。</span></p></div>"
},{
    "title": "第十五讲《积善之方》故事系列一",
    "date": "2022-07-19",
    "html": "<div class=\"B1_text\"><p><span><strong>第十五讲《积善之方》故事系列一</strong></span></p><p><span><strong>《易曰》：“积善之家，必有余庆。”</strong>昔颜氏将以女妻叔梁紇hé。颜氏，孔子母亲的姓氏，孔子的母亲叫颜征在，嫁给了孔子的父亲叔梁紇。当时颜氏看到了孔子的父亲，以此推断，所以把女儿嫁到他们家去，他到底推断了什么呢？根据《易经》来说，积善之家，必有余庆。</span></p><p><span><strong>“而历叙其祖宗，积德之长，逆知其子孙必有兴者。”</strong>颜氏为什么把他的女儿嫁给了孔子的父亲？因为看到了他们祖上一代又一代的积累了很多的功德，所以说逆知，就是预知到了，他们家的子孙一定会有兴盛者。</span></p><p><span>颜氏是不是很有智慧、懂得道的规律的人呢？他要不懂得道的规律，他看不明白的，这都是《易经》教给我们的道理，这都是中华文化教给我们的道理。一看人家祖上历代都是积德之人，所以他就知道了，后面一定会有子孙兴旺，所以他把颜氏就嫁给了叔梁紇。颜氏生了孔子，我们到今天还在感叹这样一位伟大的母亲。</span></p><p><span>在生活当中也是一样的，我们首先自己是要有智慧的，懂得天道循环的规律，懂得“天道无亲，常与善人”的，这个时候会发现，我们看到一个人的语言行为是善是恶，接下来就会知道他该发生的事情是什么样子的。其实很简单，只是我们明白了这个事情的规律而已，所以整个这一篇都是告诉我们如何积德行善的。</span></p><p><span><strong>“孔子称舜之大孝，曰：‘宗庙飨xiǎng之，子孙保之。’”</strong>孔子称赞舜帝的大孝的时候讲过，“曰：‘宗庙飨xiǎng之，子孙保之。’”我们到现在是不是一样的？很多地方还有舜祠，还有尧祠，很多地方还供奉着圣人。</span></p><p><span>比如说我们去曲阜孔庙、孔林，都在供奉着至圣先师，还有现在全世界都在研究孔子文化，都在供奉着孔子，这些圣人是不是都是一样的？都在告诉我们，他们的福德是功照千秋的。</span></p><p><span>我们到现在还在受着人家的益处，还在接受着人家的文化，所以说“皆至论也”，这些都是至真至纯的道理。以此我们就知道了，孔子在赞叹舜帝，我们现在是不是在赞叹孔子？包括我们现在在学《了凡四训》，我们也在赞叹了凡先生。</span></p><p><span><strong>“试以往事征之”，</strong>这时了凡先生又讲了，我在尝试着以往事证明和验证这些积德行善所得到的福德。接下来就讲了十个故事，十个积德行善的故事。</span></p><p><span><strong>“杨少师荣，建宁人。”</strong>他的名字叫杨荣，福建人，少师是他的官位，少师是位列三公的，是辅佐太子和天子读书育德的人。我们经常听一个词叫位列三公，三公里面，比如说大家常知的有太师，有太傅，有太保，还有少师，少傅和少保，这里面少师是他的官职，是副一品的，太史是正一品的。</span></p><p><span><strong>“世以济渡为生，久雨溪涨，横流冲毁民居，溺死者顺流而下，他舟皆捞取货物，独少师曾祖及祖惟救人，而货物一无所取，乡人嗤其愚”。</strong>少师杨荣，世世代代都以摆渡为生，济渡就是做摆渡的，划船的，在港口渡人的。久雨，就是下了很久的雨，雨水在暴涨，发洪了。横流，正常水是不是都是顺流的？但是暴雨到了一定的程度，它就横流。</span></p><p><span>横流的时候就会冲毁很多的民居，这个时候老百姓就开始受灾了，有很多淹死的人都顺流往下飘，其他的人都在捞取货物，唯有少师家的祖上不捞取货物，只救人，所以叫惟救人。不去抢那些财货，而专想着去如何救人。其他的乡人说：“他太愚了，这么愚笨，有这种情况，不去获取一些财物，怎么只知道救人？这对他有什么好处？”反而遭到了别人的嘲笑。</span></p><p><span><strong>“逮少师父生，家渐裕，有神人化为道者，语之曰：‘汝祖父有阴功，子孙当贵显，宜葬某地。’”</strong>等到少师的父亲出生的时候，整个家庭就开始变得宽裕了，开始变得富裕了。这个时候有个神仙化成了一个道人，跟他们家讲说：“你们家的祖父做了很多阴德。”</span></p><p><span>以前我们讲过什么叫阴德，就是别人看不见的、默默地做的很多事情，阴德天报之，天道会给我们回馈的。所以以前老人是不是都教给我们，不要亏了阴德，要多做好事，给自己积阴德。会发现以前的老人，虽然没有学过那么多的知识，但是他们往往讲出的话却是合天道的。</span></p><p><span>因为那个年代的人本性纯良，所以他讲的话都是善良的，都是让人向善的，都告诉我们不要占人家便宜，一定要多做好事，不要做坑害他人的事情。“子孙当贵显”，就是会有做大官的人出现，因为祖上积功德、积阴德了，说比较适宜埋藏在某一个地方，以前都是很讲风水的，当埋葬在某一个地方的时候，会让后代的子孙跟着受益的。</span></p><p><span><strong>“遂依其所指而窆之，即今白兔坟也。后生少师，弱冠登第，位至三公”，</strong>就是按照道者所指示的，下葬在那个地方（就是今天的白兔坟），后面就生下了少师杨荣，也就是这个故事的主人公。“弱冠登第”。</span></p><p><span>以前古人二十岁的时候，是要行弱冠礼的，行完这个礼就是成人了。二十岁的时候就登第了，就是中了进士了，还有一个词叫什么？叫及第。我们通常看电视也会看到，说中了状元。状元，榜眼，探花，这是前三名的名次，到前三名叫及第。像这种没入前三名的叫登第，是中了进士，位至三公。</span></p><p><span><strong>“加曾祖、祖、父，如其官。子孙贵盛，至今尚多贤者。”</strong>同时加封他的曾祖和祖父，和他的官位是一样的，那个时候的少师是副一品，太师是正一品，官职很大的，后来的子孙也都很兴盛，到今天还有很多贤德的人。</span></p><p><span>那个时候指的是到今天，是到明朝，了凡先生那个时代。因为这个故事，我们现在听起来好像离我们挺遥远，是陌生的，但是那个时候了凡先生在给他的儿子天启，讲这个故事的时候，他们是一个时代的，很容易就能听得明白，加以论证。</span></p><p><span>好比说我们现在讲一个当代的故事，人人皆知的故事是一样的。整个故事都在告诉我们，他是积了很多的阴德的，救了很多人的性命，而没去贪取一些人们所看到的那些财物，后面的子孙才显贵。所以我们一定要懂得去多做善事，多积累功德，不光是给我们自己积福，给我们的子孙后代也是积福的，所以叫“积善之家，必有余庆”。</span></p><p><span><strong>“鄞人杨自惩，初为县吏，存心仁厚，守法公平。”</strong>鄞是个地名，鄞县其实就是今天的宁波，他的名字叫杨自惩，初为县吏，这个县吏是什么呢？县令身边的书办，这个人存心是非常仁厚的，守法非常公正。</span></p><p><span><strong>“时县宰严肃，偶挞一囚，血流满前，而怒犹未息，杨跪而宽解之。”</strong>当时的县令，特别地严肃正直，但是脾气比较大。有一次在打一个囚犯的时候，已经血流满地了，可是怒气依然未息，这时杨自惩跪在那里帮着求情：“太残忍了，不要再打了。”因为刚才也提到了，他存心仁厚，是很仁德的、很仁心的，所以看不得这样的场景，就在帮助他求情，去劝解这件事情。</span></p><p><span><strong>宰曰：“怎奈此人越法悖理，不由人不怒。”</strong>这个县令说：“不是我非要打他，他做的事情实在是违法背理的，我怎么能不生气呢？我怎么能不怒呢？”</span></p><p><span><strong>“自惩叩首曰：‘上失其道，民散久矣，如得其情，哀矜勿喜，喜且不可，而况怒乎？’”</strong>杨自惩叩头对县令说，朝廷这个时候是黑暗的、腐败的，已经失了天道了，民心早都已经散了，我们看到了一些案情，知道了一些情况，他为什么会违法？</span></p><p><span>我们应该同情和他怜悯他，而不要有喜色，什么意思呢？比如说一个有仁慈的做官的人，他每办一件案子，定一个人的罪，他不是高兴的，是悲伤的。</span></p><p><span>我们看电视是不是经常看到这样的画面？说这个人虽然违了法，悖了礼，可是找到他犯罪的理由，我们会为他感到叹息的，这个时候他不应该是高兴的，应该是很同情他的。我们看有仁慈的人都是这样的思维的，所以说“喜且不可”，喜悦的心情都不能有，怎么还能去发怒呢？ </span></p><p><span>学《论语》有一句话：“子曰，观过斯知仁矣。”当一个人犯了一个事情，犯了一个过错，我们观过，是看到他为什么犯了这个错误？这个时候才是有仁德的体现。比如说我们看王阳明先生一生的经历，充分地能说明这个道理。</span></p><p><span>当时阳明先生去剿匪的时候，其他的官员在之前去那里剿匪的官员，到那里就开始剿匪，而阳明先生不是的，他到那里就开始考察民情，后来他说这个地方离朝廷这么远，很多人吃不上饭。</span></p><p><span>所以才去做了山贼，做了土匪，这些人其实是情有可原的，我不能上来就派兵诛杀，不能上来就派兵围剿，我要让他们重新回归家园，去给他们更多的安居乐业的生活，然后我们去给他们讲文化，去教化他们，这是圣贤之人的思维。</span></p><p><span>他看到一个人的过错，他为什么会发生这样的事情？怎么能上来就用刑法，所以这里面充分的说明，杨自惩是一个非常有仁慈之心的人。</span></p><p><span><strong>“宰为之霁颜。”</strong>这个时候县令，霁就是舒展了面容，开始变得和缓了，也就是说这件事情就过去了，就没有继续再去打囚犯。</span></p><p><span><strong>“家甚贫，馈遗一无所取，遇囚人乏粮，常多方以济之。”</strong>杨自惩的家，其实是很贫困的，馈遗是什么？就是别人赠送他的东西，是一无所取的，所以他的家庭才会贫困，如果是一个贪官，他不就就不贫困了吗？</span></p><p><span>别人送的东西他要都留，他不就是富裕了。但是这个人刚才提到他存心仁厚，并且守法公正，还是不收这些东西的，所以才导致家并不富裕。有的时候他看到囚犯缺少粮食吃，经常去救济，把自家的粮食给他们吃。</span></p><p><span><strong>“一日，有新囚数人待哺，家又缺米，给囚则家人无食，自顾则囚人堪悯，与其妇商之。”</strong>说有一日很多新来的囚犯，待哺就是饿了，没有饭吃。这个时候，他自己家里的米也不多，因为自己家里也没有米，如果说给了囚犯吃，家人就没有吃的了，但是如果说自己吃了，看到这些囚犯又觉得特别可怜，所以这个时候，和他的妻子相商。</span></p><p><span><strong>“妇曰：‘囚从何来？’曰：‘自杭而来，沿路忍饥，菜色可掬’。”</strong>就问他囚犯是从哪里来的？说从杭州来的，已经一路饥饿走到了这里，菜色可掬是形容他的面貌的，我们经常说一个人都没有血色了，他的脸色就像菜叶子有青有红的，就形容他们是非常憔悴的，吃不饱饥饿的样子。</span></p><p><span><strong>“因撤己之米，煮粥以食囚。”</strong>因而把自己家的米，拿出来煮粥给囚犯吃，食囚这是食，但是这里读si，食是动词，就是给别人吃的意思，当食物讲的时候是做名词的。</span></p><p><span><strong>“后生二子，长曰守陈，次曰守址，为南北吏部侍郎，长孙为刑部侍郎，次孙为四川廉宪，又俱为名臣；”</strong>后来生了两个儿子，长子叫守陈，次子叫守址，为南北吏部侍郎，吏部侍郎仅次于尚书。</span></p><p><span>那个时候叫六部，有吏部、有户部、有兵部、有礼部、有刑部、有工部，每一个部都有尚书，这个侍郎是仅次于尚书的副职，他的两个儿子都是吏部的侍郎，孙子是刑部的侍郎，整个家里面都是显贵的后代。廉宪又叫按察司，是主管整个省级司法的，是不是子子孙孙都是做官的？</span></p><p><span>“今楚亭、德政，亦其裔也。”楚亭和德政都是人名，都是他们家的后代，到了我们现在的明朝，这些人都是他们家的后代。是不是福泽子孙的？整个故事在讲什么？我们的主人公杨自惩先生，他是一个非常仁德的人，对每一个人都是慈爱的。</span></p><p><span>很多人对囚犯是不是就没有那么仁慈？认为他犯了罪就应该受到惩罚，可是一个有仁德的人不是这样思考问题的，他在思考囚犯也是人，即使他犯了错，也有可能是被逼的，我们有能力的时候也尽量相帮，起码不能让他们挨饿，不能让他们再忍受身体被鞭打的这种痛苦，所以他才有了那么大的仁德，那后面的子孙，都开始变得兴盛。</span></p></div>"
},{
    "title": "第十六讲《积善之方》故事系列二",
    "date": "2022-07-19",
    "html": "<div class=\"B1_text\"><p><strong><span>第十六讲《积善之方》故事系列二</span></strong></p><p><strong><span>“昔正统间，邓茂七倡乱于福建，士民从贼者甚众。”</span></strong><span>正统是年号，是明朝的第六代皇帝的年号，叫正统年间。邓茂七倡乱于福建。倡乱：就是造反，一个土匪的首领造反了。</span></p><p><strong><span>“士民从贼者甚众士。”</span></strong><span>士：就是指的读书人。民：指的老百姓。很多读书人和百姓已经从贼了，就是很多人都从贼了，跟着一起造反了。</span></p><p><strong><span>“朝廷起鄞县张都宪楷南征，以计擒贼。”</span></strong><span>鄞县是一个地名，就是今天的宁波。然后这个人的名字叫张楷，都宪是官职，启用张楷去南征。“以计擒贼”，说用计谋擒贼了，就把叛乱平息了。</span></p><p><span>这个时候这篇故事的主人公，刚刚开始登场。<strong>“后委布政司谢都事，搜杀东路贼党。”</strong>在剿匪平叛过后，再委任谢都事，都事是一个官职，姓谢，搜杀残余的党匪。</span></p><p><strong><span>“谢求贼中党附册籍，凡不附贼者，密授以白布小旗。”</span></strong><span>这个时候他的内心是非常地仁德的，他开始找寻这些叛乱的残党当中的名册，为什么要找这样一个名册？他是为了不想滥杀无辜。</span></p><p><span>所以这个时候，<strong>“凡不附贼者”，</strong>就是这些人只要不是当时在名册当中的人，他就授以白色的小旗，白旗就是投降的意思。给他们白色的旗，其实是为了官兵再来捕杀的时候，免受牵连。</span></p><p><strong><span>“约兵至日，插旗门首，戒军兵无妄杀，全活万人。”</span></strong><span>约定在官兵来的时候，把这个小旗插在门口，这样不会再去误杀他们，并且禁止他们的军队和兵妄杀无辜，因此全活了一万人。</span></p><p><span>我们看这是多大的功德、多大的福德啊，多大的仁慈之心。如果是一般为官的，是不是为了省事情就不要这么麻烦？一律赶尽杀绝就好了，可是我们会发现，他不是那样做事情的，他是心怀仁爱的，所以救了这么多人的性命。</span></p><p><strong><span>“后谢之子迁，中状元，为宰辅。”</span></strong><span>后面他的儿子叫谢迁，中了状元，同时做了宰相。“孙丕pī，复中探花。”他的孙子谢丕，又开始中了探花。他救了这么多的人命，他这么多的仁爱之心，又让后面的子孙昌盛。</span></p><p><strong><span>“莆田林氏，先世有老母好善，常作粉团施人，求取即与之，无倦色。”</span></strong><span>莆田是一个县，福建的。说莆田有这样一个人家，叫林氏。说林家有一位老母亲经常做善事，用粉团施舍，布施给没有饭吃的人。</span></p><p><span>只要有人来求取，就开始给。并且重要的是什么呢？无倦色，就是不会出现厌倦和不耐烦的表情。我们现在有的时候，给别人东西的时候，是不是有倦色的？是不耐烦的？虽然给了，但是还是不太高兴的样子，还是很烦的样子。</span></p><p><strong><span>“一仙化为道人，每旦索食六七团。”</span></strong><span>说这个时候有神仙化成了一个道人，旦：就是早晨的意思。每天早晨都来索要六七团粉团。</span></p><p><strong><span>“母日日与之，终三年如一日，乃知其诚也。”</span></strong><span>每天都给，三年如一日不停地去给。这个时候这个道人就知道了，她实在是至诚之心。我们去想一想，我们能去布施三年，三年如一日，并且无倦色。看看人家母亲的这种德行，和人家母亲的这种仁爱之心，常去布施给穷人饭吃。</span></p><p><strong><span>因谓之曰：“吾食汝三年粉团，何以报汝？府后有一地，葬之，子孙官爵，有一升麻子之数。”</span></strong><span>因此道人就对她讲了：“说我吃了你三年的粉团，我要怎样报答你呢？你的府地后面有一块地，我告诉你这个地方。</span></p><p><span>当你百年以后，让你的子孙把你葬在这个地方，后面你的子孙就会为官，并且非常多，一升麻子之多。”想一想数量得有多少？</span></p><p><strong><span>“其子依所点葬之，初世即有九人登第。”</span></strong><span>那么她的儿子就依照道人所指点的，把他的母亲葬在了那个地方。第一代就有九人登第，老人家实在是做了太多的善行。</span></p><p><strong><span>“累代簪缨甚盛，福建有无林不开榜之谣。”</span></strong><span>簪缨：就是古代达官贵人的冠饰。这句话来形容什么呢？她后代的人，做官的人甚盛，特别多。甚至福建有无林不开榜的传说，就是开榜考试的时候，如果没有林家的人来，不考试。</span></p><p><span>所以我们去想一想，她后面的子孙该有多少人读书，该有多少人为官，该有多么贤德。皆因这位老母亲，这位老人家不停地去积德行善，不停地去救他人性命。</span></p><p><span>整个每一段故事，都去告诉我们，积德行善背后能给我们自身和子孙带来的福德，这是我们看到的明处，还有看不到的暗处，还给自己积累了很多福德。</span></p><p><strong><span>“冯琢庵太史之父，为邑庠xiáng生。”</span></strong><span>这篇故事讲的是冯琢庵太史的父亲，当时是一个秀才，邑庠生是秀才的意思。“隆冬早起赴学，路遇一人，倒卧雪中。”冬天的早晨，去赴学的过程当中，碰到了一个人，这个人倒在冰天雪地里面。</span></p><p><strong><span>“扪之，半僵矣。遂解己绵裘衣之，且扶归救苏。”</span></strong><span>用手摸了摸，这个人的身体已经半僵硬了。“遂解己绵裘衣之”，这里的衣，动词，读衣（yì），就是穿上的意思。这个时候他把自己的衣服脱下来，给这个人穿上，并且带回家中救醒。苏：是醒的意思。把这个人救醒过来了。</span></p><p><strong><span>“梦神告之曰：‘汝救人一命，出至诚心，吾遣韩琦为汝子。’及生琢庵，遂名琦。”</span></strong><span>做了这样一个梦，有一位神仙告诉他：“你救人一命，出自至诚之心，（他的心多诚，在冰天雪地当中，碰到了一个人，把自己的衣服脱下来给他，并且把他带回家中，多至诚的心。）我让韩琦投胎做你的儿子。”</span></p><p><span>韩琦是宋朝人，当时是一位进士，和范仲淹是齐名的。这个时候他就生了他的儿子，叫冯琢庵，名琦。</span></p><p><span>很简短的一个小故事，也在告诉我们一个道理，一个是他救人之性命，第二点是什么呢？救人性命的时候，他出自的是至诚之心。所以后面他才得了一个好的福报，天降之一子，并且可以为官的，可以走上仕途的。</span></p><p><strong><span>“台州应尚书，壮年习业于山中。夜鬼啸集，往往惊人，公不惧也。”</span></strong><span>台州是个地名，有位应尚书，在壮年的时候在山中学习。晚上这里聚集了很多鬼，在呼啸，但是应公也不怕，也不恐惧。</span></p><p><strong><span>“一夕闻鬼云：‘某妇以夫久客不归，翁姑逼其嫁人。明夜当缢死于此，吾得代矣。’”</span></strong><span>说有一天晚上听到鬼在讲话：“有一个妇人，由于她的丈夫一直在外不回。（翁姑就是公婆），公婆以为儿子经常不回来，以为不在了，想逼其改嫁其他人。”</span></p><p><span>鬼这个时候说：<strong>“明夜她会在这里上吊自缢，这个时候我得以代。”</strong>经常我们听故事都会讲到说，鬼是需要找替身的。这个时候说：“我终于有了替身了。”它是很高兴的，讲了这样一段话。</span></p><p><strong><span>“公潜卖田，得银四两，即伪作其夫之书，寄银还家。”</span></strong><span>应公听到了这段话，回家偷偷把自己家的田卖了，得了四两银子。然后写了一封家书，寄给了这个妇人，以她丈夫之名所写的，并且把这四两银子，一起寄了回去。</span></p><p><strong><span>“其父母见书，以手迹不类，疑之。”</span></strong><span>父母看到了这份家书，觉得和我的儿子写的笔迹不同，所以有一些怀疑，这个家书是不是假的？是不是不是儿子写回来的呢？</span></p><p><strong><span>“既而曰：‘书可假，银不可假，想儿无恙。’”</span></strong><span>接下来又说：“家书有可能是假的，别人仿冒而写，但是银子不会假，其他人又怎么可能寄银子给我们呢？所以想想儿子应该是无恙。”他想到儿子无恙，就不会再逼他的妻子，改嫁他人。</span></p><p><strong><span>“妇遂不嫁，其子后归，夫妇相保如初。”</span></strong><span>后来他的儿子果然回到了家中，夫妻之间相爱有加，又继续过他们的生活。</span></p><p><span>所以整个这一段，应公听到了这样一段话，把自己家的田地卖掉了，为了救人一命。并且他做的是阴德，任何人都不知道是他做的，甚至他连自己的名字也不需要留，其心至诚、至真的。</span></p><p><strong><span>“公又闻鬼语曰：‘我当得代，奈此秀才坏吾事。’”</span></strong><span>这个时候他又听到了：“我本来终于找到一个代替我之人，奈何这个秀才坏了我的好事。”其实也是愤恨不平的。</span></p><p><strong><span>“傍一鬼曰：‘尔何不祸之？’”</span></strong><span>这个时候身旁有另外一个鬼对它讲：“既然他坏了你的好事，你为什么不去祸害他？不去伤害应公呢？”</span></p><p><strong><span>“曰：‘上帝以此人心好，命作阴德尚书矣，吾何得而祸之？’”</span></strong><span>说：“这个人因为好心得到了上天的眷顾，积了很多的阴德，他后面命该做尚书的，我怎么能害得了呢？我也近不了身，也害不了。”</span></p><p><span>所以古话不是常讲吗？平时不做亏心事，半夜不怕鬼敲门。当一个人不断地去积累善行，积累阴德的时候，是不用害怕任何的妖魔鬼怪的，根本无法伤害到我们。</span></p><p><strong><span>“应公因此益自努力，善日加修，德日加厚。”</span></strong><span>说应公听到他们之间的这番对话，更加地努力刻苦地修正自己的德行，增加自己的善行，不停地去积累自己的福德，更加勉励地去做好事情。</span></p><p><strong><span>“遇岁饥，辄捐谷以赈之。”</span></strong><span>谷：是粮食的意思，米谷、粮食。遇到这种荒年的时候，就把自己家的粮食拿出来，去救济没有饭吃的那些人。</span></p><p><strong><span>“遇亲戚有急，辄委屈维持；遇有横逆，辄反躬自责，怡然顺受。”</span></strong><span>碰到亲戚、亲人有急的时候，委屈维持，委屈这两个字我们是很难做到的，想办法去帮助别人，并且委屈的是自己。当我们帮助一个人的时候，宁可自己受委屈，也要想尽办法去帮助他人，这个是很难做到的。</span></p><p><span>每当有横逆，就是不如意的事情，当碰到不如意的事情，甚至别人对他的辱骂和苛责，他都怎么做？都反躬自省、自责。都看一看，遇到不如意的事情，是不是还是我自己本身做得不够呢？是不是还是我的行为引起了别人的反感呢？是不是还是我的德行不够呢？</span></p><p><span>所以当他这样反躬自省的时候，反而能够怡然顺受。怡然顺受，就是很心平气和的样子，遇到很多不如意的事情，他也很能心平气和地去接受，然后还是不断修正自己的行为，增加自己的品德、德行。</span></p><p><strong><span>“子孙登科第者，今累累也。”</span></strong><span>说他后面的子孙登科第，考中进士的人非常之多，累累就是众多之意。</span></p><p><span>所以整个这段故事，第一点跟我们讲要积阴德。因为积阴德天报之，他做了很多好的事情是默默的，不为人知的。</span></p><p><span>那么第二点，他能做到委屈自己，去帮助他人，才有了后面得到的那么多的功德。包括他自己，他后面的子孙，是有很多人中了科第，并且可以去为官，可以去为民请命的。</span></p><p><span>每一篇故事，都在告诉我们一个道理：“积善之家，必有余庆。”不光自己可以得到好的福德福报，还可以善及子孙。</span></p><p><span>《论语》里面有一句话——子曰：“获罪于天，无所祷也。”说你自己的行为，如果是有罪恶的，是有过失的，“获罪于天，无所祷也。”我们去和谁祈祷都没有用的。</span></p><p><span>我们反过来讲也是一样的，如果我们自己的德行够，我们的善行够，我们是不需要向任何人去祈祷的。因为我们自己本身的品行就是符合天道的，天自然就会回馈给我们。所以说——积阴德，天报之。</span></p></div>"
},{
    "title": "第十七讲《积善之方》故事系列三",
    "date": "2022-07-19",
    "html": "<div class=\"B1_text\"><p><span><strong>第十七讲《积善之方》故事系列三</strong></span></p><p><span><strong>“常熟徐凤竹栻，其父素富，偶遇年荒，先捐租以为同邑之倡，又分谷以赈贫乏。”</strong>徐栻是名，凤竹是字，字凤竹。他的父亲本来就是很富贵的，遇到年荒的时候（年荒就是灾年），有很多人这个时候会吃不上饭的。他就会先把家里所收到的租金，拿来去帮助他人。</span></p><p><span>接下来不够的情况下，他又会把自己家的粮食拿出来，以赈这些灾民、吃不上饭的人。倡：就是榜样。当他自己先把自己家里的租金拿出来救济灾民，去给他人做榜样。不够的情况下，又把自己家的粮食拿出来，分给这些没有粮食吃的贫困之人。</span></p><p><strong><span>“夜闻鬼唱于门曰：‘千不诓，万不诓，徐家秀才，做到了举人郎。’”</span></strong><span>晚间的时候，他就听到鬼在吟唱（这个诓就是说谎的意思）：“千也不说谎，万也不说谎，徐家的秀才，快要中了举人郎了。”</span></p><p><span>因为那个时候有等级考试的，首先就是秀才，接下来才是举人，再接下来才是进士。就唱了这样一首歌，告诉他们家快中举人郎了。</span></p><p><strong><span>“相续而呼，连夜不断。”</span></strong><span>整晚一直都在吟唱，都在呼喊这件事情。“是岁，凤竹果举于乡，其父因而益积德，孳zī孳不怠。”后面凤竹，果然在乡试当中中了举人。从此以后，他的父亲更加地去积德行善，勤勉自己，毫不厌倦，毫不懈怠。</span></p><p><strong><span>“修桥修路，斋僧接众，凡有利益，无不尽心。”</span></strong><span>修桥修路，是有利于人民，有利于百姓的事情。斋僧就是供养很多出家的僧人。接众，就是去帮助救济很多贫苦之人、贫困之人。凡是对他人有利益的事情，无不尽心尽意。</span></p><p><strong><span>“后又闻鬼唱于门曰：‘千不诓，万不诓，徐家举人，直做到都堂。’</span></strong><strong><span>”</span></strong><span>说晚上的时候又听到在吟唱：<strong>“千也不说谎，万也不说谎，徐家的举人一直能做到都堂。”</strong></span></p><p><strong><span>“凤竹官终两浙巡抚。”</span></strong><span>后面凤竹果然官至浙江巡抚。两浙巡抚，那个时候分为浙东和浙西，两浙巡抚，就是做整个浙江省的巡抚。巡抚的职责，是巡行天下，抚君安民。</span></p><p><strong><span>“嘉兴屠康僖公，初为刑部主事，宿狱中，细询诸囚求情状，得无辜者若干人，公不自以为功，密疏其事，以白堂官。”</span></strong><span>康僖是谥号。刚开始的时候，是做刑部主事的，每天住在狱中。后面他细细地询问每一个犯人，每一个囚徒实际详细的情况，后面他发现有很多无辜之人。</span></p><p><strong><span>“公不自以为功，密疏其事，以白堂官”，</span></strong><span>他看到了这些事情，发现了这些无辜的罪犯，他并不以自己来居功，把这些事情秘密地奏报给了堂官，去上奏表明这些事情。堂官就是那个时候的尚书，整个把这些发现的无辜的案情，直接就奏报了给刑部的尚书。</span></p><p><strong><span>“后朝审，堂官摘其语，以讯诸囚，无不服者，释冤抑十余人。”</span></strong><span>朝审就是那个时候的秋审，在秋天行刑之前，还会经过一次秋审，以示对生命的尊重，不要误杀。</span></p><p><span>这个时候在秋审的时候，堂官摘其语，就是之前所呈报上来的那些，细询过犯人的内容。这个时候所有的囚犯，无不服者，大家都说是真实的，都是服气的。这个时候释放了很多被冤枉的十几人。</span></p><p><strong><span>“一时辇下咸颂上书之明。”</span></strong><span>辇是什么呢？是皇帝坐的叫辇，车辇。辇下：就是指的皇帝的脚下，也就是京城。说当时在京城，很多人都去歌颂、赞美和赞扬尚书的贤德之名，说他明察秋毫。</span></p><p><span>实则是屠公所做的事情，但是他并未自己居功，而是把这些功德，把这些事情都奏明了尚书，让尚书来做这些事情，所以尚书才得到了很多别人的赞美。</span></p><p><strong><span>“公复禀曰：‘辇毂之下，尚夺冤民，四海之广，兆民之众，岂无枉者？宜五年差一减刑官，核实而平反之。’”</span></strong><span>这个时候继续跟尚书开始上报了，说什么呢？说：“皇帝京城脚下，都有这么多被冤枉之人，那看看整个四海之内，要有多少人被冤枉？”</span></p><p><span>（这个时候的恻隐之心、慈悲之心都在。）“我们应该上报朝廷，每五年去找一个减刑官，去安排到各地，去核实这些情况，看看有没有受冤枉的，如果有受冤枉的，我们要给平反。”</span></p><p><strong><span>“尚书为奏，允其议。时公亦差减刑之列。”</span></strong><span>这个时候尚书就帮忙把这个事情上奏皇帝，那么皇帝允其议，同意了这件事情。这个时候他也去做了减刑官，去每个地方细细地去审查，有没有受冤之人。</span></p><p><strong><span>“梦一神告之曰：‘汝命无子，今减刑之议，深合天心，上帝赐汝三子，皆衣紫腰金。’”</span></strong><span>这个时候他晚间做了一个梦，梦到一个神仙对他讲话：“本来你的命里是无子的，但是你今天减刑这一个建议身合天心。</span></p><p><span>上天都是有好生之德的，你这样一个建议，由于你的仁德之心，让很多人免于牢狱之灾和屠戮，所以这件事情做的深合天意，上天给了你三个儿子。”</span></p><p><span>衣紫腰金是什么意思？以前三品以上的官员，穿着紫袍，腰间系的是金鱼带，形容都是做大官的。“你做了这么多好的事情，积了这么多的阴德，那么上天赐你三子，并且三子以后都是可以做大官之人。”</span></p><p><strong><span>“是夕夫人有娠，后生应埙、应坤、应峻，皆显官。”</span></strong><span>说这一天晚上夫人怀了身孕，后面生了三个孩子，都是做大官的，官位显赫。</span></p><p><span>所以这个故事告诉我们一个道理，往往我们一个好的念头，一个善念，一个至诚的念头，可能只是一个建议，但是这个建议，却是让很多人受益的。尤其是那个时候为官的，他一旦是为民请命的，去做了一件好的事情，就可以利益很多的百姓。</span></p><p><span>包括我们看了凡先生自己也是一样的，只是减粮一件事情，就惠及了千万百姓。这篇故事里的主人公也是一样的，他这样一个建议，让很多囚犯免于牢狱之灾，实在是积了很大的功德。</span></p><p><strong><span>“嘉兴包凭，字信之，其父为池阳太守，生七子，凭最少，赘平湖袁氏，与吾父往来甚厚，薄学高才，累举不第，留心二氏之学。”</span></strong><span>嘉兴是地名，包凭是人名，字信之。说他的父亲是池阳的太守，生了七个儿子。包凭是家里最小的孩子，这个时候入赘了平湖的袁氏，去做女婿。</span></p><p><span>说与我的父亲往来甚厚，关系很亲密，经常来往。这个人非常的博学，并且很有才华，但是经常考举也中不上。他非常有兴趣的是二氏之学，二氏指的是佛道。</span></p><p><strong><span>“一日东游泖湖，偶至一村寺中，见观音像，淋漓露立，即解橐（tuó）中得十金，授主僧，令修屋宇，僧告以功大银少，不能竣事。”</span></strong><span>有一日在游湖，偶然走到了一个村寺当中，看到了一尊观音像，每日被雨淋。</span></p><p><span>橐tuó：就是口袋的意思。这个时候他把口袋里的十两银子，拿了出来，给了这个寺院的主僧，告诉他去修屋宇，以免观音像在外面淋雨。这个时候僧人对他讲，工程太大了，银子太少，这个事情是无法完成的。</span></p><p><strong><span>“复取松布四匹，检箧中衣七件与之。”</span></strong><span>从这个时候从家里又取了四匹布，然后从自己的衣箱当中，又取了七件衣服，整个都交给了这位主僧。</span></p><p><strong><span>“内紵（zhù）褶，系新置，其仆请已之。”</span></strong><span>紵：是麻布的衣服。褶：就是夹衣，也就是里面有棉的。这句话的意思就是说七件衣服当中有单的，有棉的，都是新的衣服，还没有穿过。这个时候他的仆人就在劝，说给了银子，给了布匹就好了，这些衣服还没有穿过，衣服就不要给了。</span></p><p><strong><span>“凭曰：‘但得圣相无恙，吾虽裸裎何伤？’僧垂泪曰：‘舍银及衣布，犹非难事。只此一点心，如何易得？’”</span></strong><span>包凭说：“如果观音圣像是无恙的，不被雨淋，我即使没有衣服穿，又能如何？”</span></p><p><span>这个时候僧人流着泪说：“舍一些布匹，舍一些衣物，舍一些银两，不是什么难事，但是这一点心，实在是太难得了。”我们看他所讲的话“只要圣相无恙，我有没有衣服穿又何妨呢？”所以实在是至诚至信。</span></p><p><span> <strong>“后功完，拉老父同游，宿寺中。”</strong>后面工程结束的时候，他带着他的老父亲一起来到寺中，晚上住在了寺中。</span></p><p><strong><span>“公梦伽蓝来谢曰：‘汝子当享世禄矣。’”</span></strong><span>这个时候晚上梦到伽蓝菩萨，也就是寺庙的护法，这个时候对他讲了一段话：“你的孩子世世代代，都会享受官禄的。”</span></p><p><strong><span>“后子汴，孙柽芳，皆登第，作显官。”</span></strong><span>后面儿子、孙子都登第，做了显赫的高官。</span></p><p><span>整个这篇故事，又告诉我们一个行善的道理，当我们一心行善，至诚之心，不求回报的时候，其实福德会非常的大。</span></p><p><strong><span>“嘉善支立之父，为刑房吏，有囚无辜陷重辟，意哀之，欲求其生。”</span></strong><span>嘉善是个地名。支立，人名。说在嘉善这个地方，支立的父亲是在行房里做书办的。有一个囚犯是被冤枉的，将得到极刑。重辟就是极刑、死刑的意思。他的心里很哀伤，在想办法，想为他求情，想为他平反。</span></p><p><strong><span>“囚语其妻曰：‘支公嘉意，愧无以报，明日延之下乡，汝以身事之，彼或肯用意，则我可生也。’”</span></strong><span>这个时候囚犯对他的妻子讲，说：“支公的好意，我实在是无以为报。明天请支公下乡的时候，我们也无以为报，以身事之，这样支公可能会更用心用意，这样我才有生还的机会。”</span></p><p><strong><span>“其妻泣而听命。”</span></strong><span>妻子也没有办法，虽然心里也极不愿意，很伤心，但是也没有办法，只能泣而听命，哭着就答应了这件事情。</span></p><p><strong><span>“及至，妻自出劝酒，具告以夫意。支不听，卒为尽力平反之。”</span></strong><span>及至，待到支公来的时候，他的妻子出来劝酒，并且把丈夫的意思，如实地告诉了支公。支不听，我也不需要，但是依然为他尽力地平反。</span></p><p><span>因为这里的支公为他平反，并不是为了得到什么好处，也并不是为了某一个人。他只是站在正义的一方，站在法理的一方，认为他是冤枉的，我要义无反顾地为他平反，并不需要给我任何的回报，所以他做人是堂堂正正的君子之风。</span></p><p><strong><span>“囚出狱，夫妻登门叩谢曰：‘公如此厚德，晚世所稀，今无子，吾有弱女，送为箕帚妾，此则礼之可通者。’”</span></strong><span>后面被平反，这个囚犯出了狱，夫妻二人登门叩头去感谢。这个时候说：“公如此厚重的德行，在现在这个时代实在是少有。今天支公您没有孩子，（弱女是谦词）我家里有一个女儿，送给您扫扫地，做这样的一个小妾。</span></p><p><span>那个时候的纳妾，都是负责来照顾对方的，如此这个道理是可以说得通的。说：“我为了感谢您，把家里的女儿去给您做妾，给您扫扫地，照顾您的生活起居，这个道理说得通的。”</span></p><p><strong><span>“支为备礼而纳之，生立，弱冠中魁，官至翰林孔目。”</span></strong><span>这个时候支公同意了这件事情，也就纳了这个妾。后面生了立，也就是支立，生了一个儿子。而且弱冠之年中魁，二十岁就中了举人，中魁就是举人的第一名，后面官至翰林孔目，就是在翰林院掌管书籍的。</span></p><p><strong><span>“立生高，高生禄，皆贡，为学博。禄生大纶，登第。”</span></strong><span>后面支立又生了支高，支高又生了支禄。都是贡生，并且都去做了学博。（学博：那个时候的公办教师）后面支禄又生了儿子，叫做大纶，而且中第，中了举人。</span></p><p><span>这篇故事支公依然是和之前的故事主人公一样，都是不断地积累自己的德行，去做善事，并且是不图任何回报的，每一件事情都是发自自己的至诚之心，有很多事情也是不需要被他人知道的，都是在不停地积累阴德。</span></p><p><span>所以我们在生活当中，在工作当中，做事情也是一样的。当我们默默地去做着一些善行，并不需要任何人来感激我们，也不需要任何人看得见，这个时候我们积的才是阴德，会给自己和后面的子子孙孙积累更多的德行和福报。</span></p><p><strong><span>“凡此十条，所行不同，同归于善而已。”</span></strong><span>其实之前我们所讲的这十篇故事，都是告诉我们要去积德行善。因为任何故事，都有它的时代背景，比如说那个时候在明朝年间，人们是比较信奉鬼神的，是比较相信这些事情的。</span></p><p><span>到了我们这个时代，这些故事，我们就当成故事来听就好了。我们要学的并不是故事的这个内容，而是故事背后给我们带来的道理。我们要去懂得积德行善。</span></p><p><span>这件事情是可以让我们自己变得更好，是可以让我们变得更有智慧，是可以让我们自己和后代变得更有福德。所以说：“积善之家，必有余庆。”</span></p></div>"
},{
    "title": "第十八讲《积善之方》中峰辨善恶",
    "date": "2022-07-19",
    "html": "<div class=\"B1_text\"><p><strong><span>第十八讲《积善之方》中峰辨善恶</span></strong></p><p><strong><span>“凡此十条，所行不同，同归于善而已。”</span></strong><span>以上咱们讲的这十个故事，虽然所行的事情不同，所行善的方向不同，但是同归于一个善字。</span></p><p><strong><span>“若复精而言之，则善有真，有假；有端，有曲。”</span></strong><span>若复是什么意思？就是又、再。“精而言之”，精就是精细，更加深入地说明。</span></p><p><span>这句话如果我们再往细、往深入了讲，善的行为，善的事情却有真、有假。端是直的意思，曲就是弯的。都是告诉我们对立的，任何一件事情都是有真、有假，有端、有曲。</span></p><p><strong><span>“有阴，有阳；有是，有非；有偏，有正；有半，有满；有大，有小；有难，有易。皆当深辨。”</span></strong><span>深辨是什么？是细细地辨别。同样我们一个行为产生了，一件事情发生了。看似表面是一样的，实则里面有很多的不同，有大小之分，有阴阳之分，有真假之分，有端曲之分，都要细细地去辨别。</span></p><p><strong><span>“为善而不穷理，则自谓行持，岂知造孽，枉费苦心，无益也。”</span></strong><span>为善而不穷理，是不懂得考究善行背后的原理。则自谓行持是什么意思？持，是一直不停的去做。</span></p><p><span>如果我们不懂得看每件事情，每个行为背后的深刻的道理和规律，我们自己觉得在做善事，其实很多时候是造孽的，只不过自己不自知而已，所以枉费苦心，无益也。</span></p><p><span>整个这段话是告诉我们，我们要去学什么？细细地去分别、去分辨每件事情背后的道理和真假，阴阳，端和曲。</span></p><p><strong><span>“何谓真假？昔有儒生数辈，谒中峰和尚，问曰：‘佛氏论善恶报应，如影随形。”</span></strong><span>什么叫真假？真假到底是怎么分辨呢？数辈：几个。有几位读书人去拜见中锋和尚，这个时候问中峰和尚说：“佛家讲善恶报应，如影随形的。”</span></p><p><span>佛家有句话：“万般带不走，唯有业随身”。我们这一生，其实什么都带不走，能带走的只有善业、恶业和无记业。这些事情都是如影随形，就像自己的影子一样，是摆脱不掉的。</span></p><p><span>它生生世世都会跟着我们，所以叫三世因果。三：只是一个概念词，前世、当下和后世，指的是生生世世，我们的善恶都是如影随形的。</span></p><p><strong><span>“今某人善，而子孙不兴；某人恶，而家门隆盛。佛说无稽矣。”</span></strong><span>佛家不是说善恶之报，如影随形，可是人们看到的不一样。明明某人是善的，可是他的家门却不兴盛；有的人我们看到的是恶，可是他的家门却很隆盛，这是什么情况？</span></p><p><span>我们现在是不是也经常会问这种问题，明明看一个人好像在作恶，他怎么那么富有？我心地很善良，为什么我过得不好？“佛说无稽矣”，我们经常说一个词叫，无稽之谈，什么叫无稽之谈呢？没有根据，无可考证的。这时候的儒生，对中峰和尚讲这番话，是表示怀疑的，跟我们看到的不一样。</span></p><p><strong><span>“中峰云：‘凡情未涤，正眼未开，认善为恶，指恶为善，往往有之。’”</span></strong><span>中峰和尚讲：“我们凡情未涤，正眼未开，看不到真相。看似善，实则可能是恶；看似恶，但是它背后可能是善。”</span></p><p><span>凡情未涤是什么意思呢？说我们世俗之人，都是被情绪所扰的，都是世俗的偏见。当我们看到一些行为发生的时候，是不是愤愤不平地去看待这件事情，这都是情绪。</span></p><p><span>当我们有喜、怒、哀、乐的情绪在里面的时候，我们是看不到真相的。我们都是被自己的情绪所左右，被自己的心念所左右，所以叫正眼未开。看不到背后真实的真相。我们看到的都是因为自己的情绪所起的，而且我们看到的只是当下呈现的表象，而背后的东西我们并不懂得细加分辨。</span></p><p><strong><span>“‘不憾己之是非颠倒，而反怨天之报应有差乎？’众曰：‘善恶何致相反？’中峰令试言其状。”</span></strong><span>我们不去遗憾，自己凡情未涤，正眼未开，看到的这些事情是非颠倒，我们不去遗憾自己修得不够，没有智慧看清真相，怎么反而去抱怨天道有差？</span></p><p><span>众人不解：“怎么可能呢？善恶怎么会相反？明明是我看到的。”这个时候中锋和尚说：“具体说说事情吧，我们用事情来加以分辨，加以解答。”</span></p><p><strong><span>“一人谓：‘詈（lì）人殴人是恶，敬人礼人是善。’中峰云：‘未必然也。’一人谓：‘贪财妄取是恶，廉洁有守是善。’中峰云：‘未必然也。’众人历言其状，中峰皆谓不然。因请问。”</span></strong></p><p><span>詈：是骂人的意思。有人说：“骂人、打人就是恶，敬人、礼人就是善。”中峰说：“不一定。”又一个人说了：“贪财、妄取，取得的那些不义之财，这就是恶；廉洁守正就是善，这个人很清廉，很守正道，守自己的德行，这就是善。”</span></p><p><span>绝大多数人是不是都是这样认为的？都是通过一个人的行为，开始判定他是非和善恶。中峰说：“不一定。”这些儒生，每个人都去讲了一些具体的事情，中峰和尚都说不一定，所以这些人开始问因，为什么呢？</span></p><p><strong><span>中峰告之曰：“有益于人，是善；有益于己，是恶。”</span></strong><span>如果做的这个事情，我们先不看行为，看什么？看自己心里动的念头，如果我们做的这件事情，是有益于他人的，是善；如果是为了一己私欲，就是恶。</span></p><p><strong><span>“有益于人，则殴人詈人皆善也；有意于己，则敬人礼人皆恶也。”</span></strong><span>我们经常说一个词叫——当头棒喝。甚至有的人是很严厉地指责、苛责他人的。如果我们的发心是为了他好，自古以来，有很多老师对学生，是不是都是这样的？师父对弟子是不是都是这样的？我们的发心如果是为他好的，这就是善。</span></p><p><span>可是如果我们表面上看似敬爱一个人，对一个人彬彬有礼，可是背后想的是获取他的利益，我们假装对他的尊重，而是有所图的呢？所以中峰和尚讲得多么透彻，不能看表面的，难道表面对一个人恭敬有礼的，就一定就是善吗？不一定。背后还有不可告人的秘密呢，还有一己私欲呢。</span></p><p><span>所以不能看表面，看似有个人可能踢了对方两脚，可是我们不知道他背后的发心可能是为了他好的。当然我们不鼓励这样的行为，只是告诉大家这样的道理。大家要明白，看背后发心是在做什么，是对他人有益的，还是为了一己之私的。</span></p><p><strong><span>“是故人之行善，利人者公，公则为真；”</span></strong><span>公：是大家、别人叫公。一个人行善做事情，我们是为了别人好的，是利益他人的，这叫公。公则为真，要真正地发心去利益他人的，这个时候才是真的善，而不是假的。虽然用了很多方法，甚至是利詈人、殴人的方法，但是发心为他好的，这个才叫真善。</span></p><p><span>我们不能去看外面一个人的行为，要去看他的发心是什么？回到修行上来讲，我们每一个行为的背后，我们去观察自己的发心。我们做这件事情，是不是真的对他人有益的，自己最清楚，如果是，那就是真的，如果只是表面上做事情，这个就叫假。</span></p><p><strong><span>“利己者私，私则为假。”</span></strong><span>如果我们做这件事情，是为了利己的，这个东西是自私的，就是假的。当我们讲的每一句话，每一个行为，做的每一件事情的背后，我们自己去反观自心，看看是利他还是利己的？如果利己的就是假的，就是做给别人看的。</span></p><p><span>超话当中，有一个朋友分享得特别好，她说去了一个新的幼儿园上班、工作，然后看到了什么呢？这些老师们在监控下表现的都是和蔼可亲的。在没有人的时候，都是怒目圆睁的。我看到了这样的环境，就不想待在这里了。这样的环境下，怎么能教出来好孩子？真假是不是一下就看出来了？</span></p><p><span>这个朋友为什么她能看到真假的？因为她学习了这么长时间，她不停地去修行，他他懂得分别了。是不是跟世俗的眼光不太一样？一般人去看这个地方看什么？工资高不高、我能在这待多长时间、有没有发展潜力、有没有发展空间？</span></p><p><span>可是现在看问题的角度不一样了，看这些人是不是真的在做事情，看他们的行为是真是假，看有没有利益孩子的心？如果没有，我在这样的环境待下去，又有什么意义？我好不容易修点良善的东西，到这里又给我泯灭了，全不都给我抹黑了么？</span></p><p><span>所以我们要懂得去观察一个人的行为的时候，去看看他自己的发心是什么样的。一个人的发心，根本掩藏不住的。我们《大学》讲：“诚于中，形于外。”我们通过他的行为，一定能看到他的发心的。</span></p><p><span>我们要懂得去观察别人，又要懂得反思自己，我们不要以为我们自己的发心别人看不见。通过我们的言语、通过我们的行为，点点滴滴都在透露着。</span></p><p><span>所以去看看自己是真是假，是真的很努力地做事情？是真的有利他之心？还是只是大家都在讲利他之心，我不得不跟着讲；大家都在努力地做事情，我不得不做。</span></p><p><span>真和假不一样，我们要懂得反观自省的，而不是我们口上每天说一说的：“我要利益他人。”那有什么用？又没有任何的行为产生，那不是假的吗？那不是说给别人听的吗？</span></p><p><span>当这样说给别人听的时候，并没有真正的行为去做，别人知不知道？别人就一笑而过，我们以为自己讲得很好，其实别人心里清楚得很，真假立判。只要我们有一些智慧的时候，就判明白了，但没有的时候我们就是看不懂。</span></p><p><span>就像刚才那位朋友讲的话，当她学习一段时间，会发现她就懂得分别了。如果她没学习的时候，她可能还不懂得分辨，觉得大家表演得都挺好，所以真假是不同的。</span></p><p><strong><span>“又根心者真，袭迹者假。”</span></strong><span>根心：就是发自内心的，这个是真。“袭迹者假”，袭迹就是什么？沿袭他人的行径，叫袭迹。</span></p><p><span>举个生活中的例子好理解，比如说很多人结婚，或者开业有随礼的。随礼就是这样的，他跟我是很好的朋友，他跟你也是很好的朋友，这个店要开业了，我去随礼，什么样叫真心？</span></p><p><span>就是我看我跟他的友谊，我该去帮他什么，我是不是提前要帮帮忙？有没有哪里需要我的？我去随多少合适？凭我自己的真心。</span></p><p><span>什么叫沿袭？他来问我了，你随多少钱？你去不去帮忙？他是不想去帮忙的，但是你们都去了，那好吧，都是朋友，你看关系都很好，你要去了我不得不去，我不得不随，这就叫袭迹。</span></p><p><span>很多人做事情都是这样的，先打听干不干这个事情，他去不去、他怎么样，这就不是真心。</span><span>比如说谁要开业，我们的朋友来，他是真心的还是袭迹的，我们能不能感受得到？一定感受得到。</span></p><p><span>比如说送礼不也是一样的，从送礼的形式上去看，有的人是不是真心的，能不能感受得到？而有的人是不是不得不送，他们都送了，我不送，好像不好，不好意思。会发现这个时候，接受礼物的那个人，能不能感受得到？其实一清二楚，只不过我们以为对方不知道。</span></p><p><span>所以看生活当中的道理，我们会发现比比皆是。包括大家在一起做事情，谁是真的努力，谁是袭迹的，我们看不出来吗？每个人都看得出来，一点都隐藏不了，只不过被蒙在鼓里的我们觉得能掩藏，其实别人看得清楚着呢。</span></p></div>"
},{
    "title": "第十九讲《积善之方》辨真假端曲",
    "date": "2022-07-20",
    "html": "<div class=\"B1_text\"><p><span><strong>第十九讲《积善之方》辨真假端曲</strong></span></p><p><span><strong>“又无为而为者真，有为而为者假。”</strong>无为而为是什么？不露痕迹，不刻意地去做事情，这个叫无为而为。有为而为是什么？做给别人看的。</span></p><p><span>生活当中是不是到处都是这样的事情？领导来了，或者有人看的时候，我开始努力干活、努力表现；没人看的时候，扔一边就不干了。</span></p><p><span>就像刚才那个朋友分享的幼儿园的例子，是不是这样的？再举例，网络时代很多流行这样的事情，我做点善事、做点善行，是为了拍一下给别人看的，这个就叫有为而为了。</span></p><p><span>无为而为是什么呢？举个例子，有的人也在做善事，但是他是不经意的被别人拍到的，不一样。他并不是刻意地去露痕迹的、想要刻意地表现什么，想要去做什么，它是完全两个概念。</span></p><p><span>我们会发现，假的时候，自己的内在是不会发生变化的，只是在表演而已，像在演戏一样，我们内在的德行不会真正地发生变化。可是，当我们不是为了做而做、不刻意地做事情的时候，久而久之，养成的是自己的品德和行为习惯，还有心念和思维的形成方式。</span></p><p><span>所以大家一定要懂得，我们做任何事情，一定不是给别人看的，所以为什么要修慎独？有人没人的时候，我都是这样做事情，我都是这样思考问题的。久而久之，我们就越接近圣贤，接近这里讲的“真”。</span></p><p><span>否则会发现我们越做越假，当我们做一些假的行为的时候，其实别人都感受得到。所以说大家一定要懂得，从这里面去分辨真和假。</span></p><p><span><strong>“皆当自考。”</strong>都要懂得自我考究的，都要懂得自我“穷其理”，尽量让自己保持至真，保持至纯，保持至正，这个非常重要。因为天是不可欺的，欺天就是欺己。</span></p><p><span>我们觉得自己做了很多，但只是表面功夫，是为了给别人看的。久而久之，我们得到的是什么？就只会做表面功夫。</span></p><p><span>你看这个人的思维习惯和行为习惯，不就养成这个样子了吗？其实最后坑害的还是自己，只不过我们的认识不够深刻而已。</span></p><p><span>所以我们在生活当中也是一样的。比如说我们在一个企业工作的时候，不要以为是给别人干的，都是在给自己做；比如说我们的学习也是一样，不要认为是在给别人学习，是在给自己学。</span></p><p><span>所以我们要懂得这个道理以后，我们教育孩子何尝不是这样的？很多孩子现在都怎么讲话？“我一定给你考个好成绩。”看看，他是这样的思维，难道做父母的没有责任吗？</span></p><p><span>很多人做事情、做个家务：“你看我每天多辛苦，我就知道照顾你父母，我就天天照顾孩子！”不停地抱怨。那我们做家务又是给谁做的呢？要懂得什么是真，什么是假。我们要明白做家务，那不是份内的事情吗？既然做了，有什么可抱怨的呢？</span></p><p><span>很多男人是不是也这样？出去赚了点工资，回家怎么说：“你看你的包，不是我给你买的吗？你看你的鞋子，不是我给你买的吗？没有我，你们能吃上饭吗？”看看，当你这样去抱怨的时候，你会发现对方不但不感激你，反而会生怨恨。你去工作，那不是你自己的事情吗？</span></p><p><span>所以我们要懂得，这个“真”是修给自己，不是做给任何人看的，我们也不需要任何人来给我们表扬，给我们鼓励和赞叹，因为我们都是对自己真。你对自己真的时候，别人一定感受得到。</span></p><p><span>我们再去讲这个例子，一个男人在外面工作，对方说：“你辛苦了。”我们要是说：“真的不辛苦，这不是我该做的事情吗？这不是我该承担的责任吗？”我们越是这样，对方怎么想？“这个人的脾气真的好，不枉我跟他在一起过日子。”</span></p><p><span>一个女人做家务不是一样的吗？做了点家务，本来是挺好的事情。可是你这一抱怨，所有的功德没有了，所有的好处，别人不看在眼里了。你要说：“没事，我也不累，这不是我该做的事情吗？”你看对方怎么讲：“娶了个好老婆，真的贤德，无怨无悔。”这是“真”。</span></p><p><span>所以大家养成这个“真”的习惯就知道，我们从自己做事情发心就正，我们不是给任何人做的，我们是对自己也很真。</span></p><p><span>当你对自己很真的时候，别人感受到的就是你对他很真、对这件事情很真。久而久之，我们做事情就是坦坦荡荡的，内心就是光明、善良的，无所畏惧。</span></p><p><span>你要是假的，你就担心败露。你看你想一想，你做了很多事情，一旦是造假的，你就害怕别人看到、担心别人知道。你越担心，别人就越知道。因为通过你的行为，就表现出来了，很清晰的。</span></p><p><strong><span>“何谓端曲”，</span></strong><span>端：就是直。你看所有的都在对立，真假，端曲。</span></p><p><strong><span>“今人见谨愿之士，类称为善而取之，圣人则宁取狂狷。”</span></strong><span>谨：是谨慎。愿：是诚实。说我们现在的人，看事情看表面。看到一个谨慎诚实的人，我们都会认为他很好。而圣人不是的。</span></p><p><strong><span>“圣人则宁取狂狷”，</span></strong><span>狂狷是什么意思？就是志向远大，不拘一格的那些人，那样的人叫狂狷之人。但是这些人，虽然狂妄不羁，可是他的行为又是有理的。</span></p><p><span>所以圣人宁愿喜欢这样的人，为什么呢？谨慎和诚实。我们先来讲这两个词，比如说从表面上看，似乎是一个好的事情，我们再往下讲，再讲发心就不一样了。</span></p><p><span>有的人的谨慎是为了什么呢？我做一件事情要很谨言慎行。为什么谨言慎行？我怕伤害到他人；我怕我这句话说出去，怕对他人造成伤害；我怕我的这一个行为去影响他人。你会发现这个好不好？这个叫端。</span></p><p><span>可是还有的人，为什么谨慎呢？我得谨慎点，不能得罪人。万一我说话不好听了，他看不上我怎么办？万一我不说点好听的，他因此不给我涨工资怎么办？万一我说错话了，他觉得我没有义气怎么办？同样是谨慎，是不是完全不同？这个就叫曲。</span></p><p><span>同样诚实，有的人说：“我们对人要诚实，不去欺骗别人，不轻许诺言。”好不好？好。但是两军打仗你被俘虏了，还能诚实吗？你主帅在哪里？你有多少兵力？后面还有多少粮草？这个时候你说我要做一个诚实的人，那是怕死。你看这个时候诚实，是不是就变了味道了？</span></p><p><span>你要知道谨慎和诚实的背后，你要去看他为了什么。你要很谨慎，那叫胆小怕事。换一种你的谨慎，是怕伤害别人。你看是不是完全不同？</span></p><p><span>所以圣人为什么宁愿去选择那些狂狷之人呢？比如说你看我们看电视，是不是经常有这样的情况？说一个昏君当道的时候，或者一个忠臣，我们都会说什么：“他听不进去，你就别说了，你忍一忍不行吗？”他忍不了。</span></p><p><span>为什么呢？他是很正直的人，看到不合适的地方，我就是要讲的，不讲不行的。所以为什么忠言逆耳？</span></p><p><span>你看狂狷之士都是这样的，他都是不拘一格的。但是他不讲理吗？讲理。比如说你去看这些圣贤之人，包括这些伟大的诗人，没有几个不被贬的。你看王阳明不被贬吗？你看孔子不是被逐出去了吗？你看苏东坡数次被贬。</span></p><p><span>为什么？这些人说话直。就是我看到不好的，我一定要讲的，得罪你我也得讲，这叫直。所以为什么圣人取这样的呢？而我们看的都是什么？谨言慎行的才好。这个时候你会发现，我们看问题的价值观，是不是不同了？</span></p><p><span>所以中锋和尚开篇就讲了：<strong>“凡情未涤，正眼未开。”</strong></span></p><p><span>所以你看我们跟圣人看到的是不是不一样？你能看到什么，取决于你的心念是什么样子的，取决于你的所学是什么，你再看到事情就不一样了。</span></p><p><span>再回来我们的工作当中也是一样的，包括我们生活当中一样，你要学了这个道理，你再去观察事情，就很了然，就会很明达。</span></p><p><span>一个人是诚实的，是谨慎的，那你去看他背后，他为什么谨慎？他的谨慎是怕得罪人，对自己带来伤害，还是他的谨慎怕伤害到他人。是不是一目了然？所以你就知道什么是端，什么是曲了。</span></p><p><span>所以大家懂得看背后原理的时候，你再接待的时候就不一样了，你再接电话的时候就不一样了。你通过他的言语，你马上就能分辨出，他背后的心理和动机是什么，清清楚楚，一目了然。所以你说不学习能行吗？</span></p><p><span>为什么给你《了凡四训》呢？反复地读，你只有反复地读，你才有分别能力。你有了分别能力，不是让你表现出来的，不是让你分辨完了以后，你对他产生分别，说这个人这样发心不好，那个人那样好。不是那个概念，是你懂得分辨，你看到正确的原理了，你才能加以引导，这样你做事情才有方向。</span></p><p><span>你像很多人坐到这里，跟咱们谈事情不是吗？他聊了几句话之后，你就知道他想要的真正是什么，而不会听他说什么。</span></p><p><span>为什么叫“凡情未涤”呢？你要不停地不被这些情绪所掌控，不被这些心念所掌控，不被他表面的行为和话语所影响和左右的时候，你就看到里面的东西了，别人看我们也一样。所以大家一定要懂得这个道理。</span></p><p><strong><span>“至于谨愿之士，虽一乡皆好（hào），而必以为德之贼。”</span></strong><span>一个乡里的人，有很多人都是好（hào）的，但是是因为大家看不明白，看不清楚。“而必以为德之贼。”那圣人为什么宁愿喜欢狂狷之士呢？因为有的时候，我们过于谨慎和诚实，我们都是为了一己私欲的，这个叫德之贼，就是有损德行的。</span></p><p><span>就像刚才咱们举的那几个例子，为什么这些自古以来的圣贤都会被贬呢？我们看电视也会说：“为什么他就不能不讲吗？”如果他不讲，那叫德之贼，他认为我是有亏道德的。</span></p><p><span>再来讲谨慎和诚实，对什么诚实啊？对德诚实。我不能亏了仁德，不能亏了道德，我们诚的是德，诚的不是一己私欲。</span></p><p><span>那就像刚才，我们再回到刚才那个例子的时候，你说你是一个俘虏被抓了，这个时候你说我要诚实，我要报告我后方的情况，详细地都说给对方。你说你那叫诚实吗？我们诚实的是自己的德。你砍了我吧，我也不说，因为我说了，我就是德之贼。</span></p><p><span>你说这些狂狷之士也是一样的，他明明看到了这些问题，如果他不说，这是德之贼。我是有损德行的，哪怕我被贬了，哪怕我受惩罚了，我也得讲，因为我不能失了德，我对德是有诚实的。</span></p><p><span>所以你看我们每天都在讲，无论我们去做每件事情，我们要诚于什么呢？诚于自己的德行。你自己觉得有没有亏这件事情，如果是没有亏的，那叫诚实。而不是说随便地去改变自己的，没有原则了，那不叫诚实。</span></p><p><strong><span>“是世人之善恶，分明与圣人相反。”</span></strong><span>世人所看到的善恶和圣人看到的是反的。《道德经》也讲这样的话：“反者道之动，弱者道之用。”又讲什么：“正言若反。”老子说了：“我说的是正言，但是你们听着就像反了一样。”</span></p><p><span>因为他和世人看到的善恶不一样，跟世人看到的真假、端曲不同。就是我们是被情绪所掌控，都看不到那个事情的本质。</span></p><p><span>大家学习的时间越长，修行得越久，我们再看问题的角度，开始变得不同了，就懂得去看背后的那个东西到底是什么。</span></p><p><span>所以我们要懂得不停地去修正自己的身心，让自己的心正、身正、行为正。这个时候会发现，我们再看问题的角度就不一样了，别人所做的事情，在我们面前，无所遁形。</span></p><p><strong><span>“推此一端，种种取舍，无有不谬。”</span></strong><span>通过这一件事情去推理，世人种种取舍，都是有偏差的，都是有差错的。我们一般世人的取舍是为了什么呢？财、名、权、利，你看这些都是利己的。</span></p><p><span>圣人的取舍是什么？是仁、是德、是天道循环的规律。他看事情是看合不合道的，合不合德的，合不合规律的，合不合天道，合不合天命。取舍不同，看到的事情就不同。</span></p><p><span>你说这些圣贤之人，难道没要名没要利吗？没要。但是没要，他是把那个事情做好了，它随之而来的。就像我们每个人做事情，你说不要钱我怎么养家？谁不让你要钱了？你是把事情做好，名和利随之而来，它是自然所产生的，这个就叫无为而为。</span></p><p><span>可是你为了求名、求利、求权，你的行为就会出现偏差，这个是失于德的，最后得不偿失，反而出问题了。所以大家一定次序不要颠倒。</span></p><p><span>《道德经》还有一句话：“圣人正是以其无私也，故能成其私。”这些圣贤没想要名，这个名传了两千多年，咱们还在学习人家的东西。了凡先生一个家训四百多年了，我们还在学。正是因为他的无私，才成其私了。</span></p><p><span>比如说比较优秀的企业家，你看怎么讲话：“我真的不在意钱，我不是为了自己，我是为了让员工变得更好，我是为了对这个国家、对这个社会有价值。”那些人真的是那样思考问题的，所以反而他成其私了。天天想着我要赚钱，我都是为了自己的利益，会发现最后反而得不到。</span></p><p><span>所以这个顺序不要反。当我们把那个事情做好了，当我们是真的，当我们是直的，当我们是有德行的，名利是伴随而来的，而不是求来的，是不刻意、不露痕迹。</span></p></div>"
},{
    "title": "第二十讲《积善之方》辨阴德阳善",
    "date": "2022-07-21",
    "html": "<div class=\"B1_text\"><p><span><strong>第二十讲《积善之方》辨阴德阳善</strong></span></p><p><span><strong>“天地鬼神之福善祸淫，皆与圣人同是非，而不与世俗同取舍。”</strong>天地鬼神之道，他是降福于善人的，降祸于恶人的。“皆与圣人同是非”，天地之道跟圣人的是非是一样的，跟世俗的是非不同，取舍不一样。</span></p><p><span>所以为什么我们要学圣人的文化呢？因为圣贤所讲的文化，他更合天地之道。我们接近圣人的思想，就是在接近天地之道，我们会发现这个时候，天就会降福于我们；而我们做了很多不好的事情，就会降祸于我们。</span></p><p><span>什么叫修行？就是不停地学习，不停地修正自己，让自己的心念，让自己的行为，更合圣贤的文化。让自己的行为更合天之道，自然给我们降福，反之自然给我们降祸。</span></p><p><strong><span>“凡欲积善，决不可徇耳目，惟从心源隐微处，默默洗涤。”</span></strong><span>说我们要是积善行，怎么办呢？绝不可顺从耳目。徇：是顺从的意思。因为耳目给我们带来的都是欲望和情绪，我们只要顺从耳目，是不是都是欲望？</span></p><p><span>我喜欢好看的东西，我要据为己有；我看到好吃的东西，把它吃到嘴里；我看到一个不顺眼的事情，我要开始动情绪了。所以顺从耳目的都是欲望。</span></p><p><span>要怎么办呢？“惟有从心源隐微处，默默洗涤。”我们要从内心最隐藏的那个部分，别人看不到的那个部分，默默地洗涤，就是清洗内心，让自己的内心更光明，让自己的内心更良善，让他变得更清澈。只有这样我们才能真正的给自己积累善行，积累德行。</span></p><p><span>所以《道德经》也讲：“为腹不为目。”说圣人吃饱肚子就好了，没有那么多多余的目的和欲望。当我们没有那么多的欲望，我们的行为才正；我们的行为正了，天才会给我们降福。</span></p><p><span>所以我们世人，是不是都活反了？都想着拼命地要、拼命地索取才是对的。当你拥有了你不该拥有的事情，你贪取的过多的时候，是不是就降祸了？意外就发生了，生意失败了，哪里哪里破散了，开始出问题了，都是这样的。</span></p><p><span>可是没有办法，我们大多数人都看不明白，迷失在这个世界和欲望当中。然后人家那些生活比较好的，比较有智慧的人，比较有钱的人，企业做的比较好的，人家讲话我们又不信。他说不在乎钱，你说不可能；他说我想为社会做贡献，你说那怎么可能。因为你是那样想的，你认为不可能。</span></p><p><span>然后有人又说了：“儒家培养的都是伪君子。”因为你是伪君子，所以你以为人家培养的都是伪君子。因为你的心念就是如此，你看到的就是这样的，你就认为别人说的那样的是不对的，因为他不符合你的逻辑和你的想法。</span></p><p><span>越是优秀的人，越信天道循环的规律，越讲我要做善事，我要对他人有益；越是不优秀的人怎么讲？只信自己，我只信钱，只信人民币，其他的都没有用。</span></p><p><span>所以你去看，你听他讲话，你就会知道他背后的思维逻辑和心念是什么样子的了，清清楚楚都摆在那里了。</span></p><p><span>所以圣人的想法和我们是相反的。为什么我们现在的人学圣贤的文化，这么不入，这么不理解？你认为他讲的不对，你都认为他讲的是反的。对，反的才对。</span></p><p><span>如果我们一看就懂，说明什么呢？我们本来的心念和思维，就更接近天地之道，更接近圣贤文化。</span><span>所以为什么要修行啊？不停地去修正我们的心念和思维，你才能越来越读得懂。</span></p><p><span>所以我们学习一定不能着急，大家一定慢慢学。哪怕我每天只听半个小时，听一个小时，我真正听懂了，我一点点去修正自己，让自己行为变得更接近。而不是你听了多少，你听了多少一点都不做，没有用的。</span></p><p><strong><span>“纯是济世之心，则为端；苟有一毫媚世之心，即为曲。”</span></strong><span>说你自己很纯粹，都是济世之心，救济帮助他人，这就是直。“有一毫媚世之心，即为曲。”如果你还有一毫的媚世之心，即是弯的，即是曲的。</span></p><p><strong><span>“纯是爱人之心，则为端；有一毫愤世之心，即为曲。”</span></strong><span>说你做事情纯是爱人的，都是对他人好的，这个就是端。想一想，其实这一条很难做到。</span></p><p><span>《中庸》有一句话：“嘉善而矜不能。”这个叫爱人。嘉善，就是我们鼓励、赞美那些善行的人、优秀的人。“而矜不能”，矜：是同情的意思。而同情那些不好的人、不善的人，而不是去怨恨他，而不是去抱怨他。</span></p><p><span>要懂得去包容他、同情他，带着他一起往上走，这个才叫爱人之心，不是嫌弃他。如果你还有一毫愤世之心，这个即是曲了。</span></p><p><span>生活当中，常常犯这样的事情，就是明明我们帮了人，是不还怀有怨恨之心？这个你会发现就不是端的。很多人说了：“那不对，我明明帮人了，我有一些愤世之心怎么了？”不怎么。</span></p><p><span>可是你要想修自己，让自己变得更好，你就要把自己修得非常的光明，你都是爱人之心。你只有这样的话，我们才能更接近圣贤的文化。</span></p><p><span>我们修行不是说我帮了他，他怎么样，那个不重要。我们帮他是我们自己的行为，我们修到了哪里。当我们还有愤世之心的时候，说明我们还是不够端，所以我们要继续修的是端正自己的行为。我帮过，就过去了，而不是帮完了之后，还有很多的抱怨，很多的埋怨。</span></p><p><span>你看很多人到这里来讲话，是不是这样？说我曾经帮过谁，他很忘恩负义。你会发现，这个时候痛苦的是谁啊？痛苦的是你自己。人家过得越好，你越痛苦。</span></p><p><span>帮来帮去的，你会发现对方反而不感激你，你自己反而越来越痛苦。所以这个就是曲，是弯的，不端正。不端正，受害的还是自己。</span></p><p><strong><span>“纯是敬人之心，则为端；有一毫玩世之心，即为曲。”</span></strong><span>如果我们做事情、做人，是很敬畏人的，不光敬畏人，还有敬畏事，敬畏万物，这个时候就是端。</span></p><p><span>比如说你看我们刚才还讲到，要不要敬畏书籍？要不要敬畏我们自己的杯子？要不要敬畏我们当下做的每一件事情？要不要敬畏每一个人？这个就是端。</span></p><p><span>玩世之心跟敬畏就是反过来的，做事不认真，不敬畏。我不敬畏这本书，我也不敬畏这个杯子，我也不敬畏自己所做的事情。</span></p><p><span>所以你看什么样的人做事常出错啊？缺少敬畏之心。你不知道你的出错，会给别人带来麻烦和烦恼吗？你不知道耽误别人的时间吗？如果你要知道，你会变得很谨慎，这个时候做出来的事情不一样。</span></p><p><span>所以有敬畏之心，敬畏万物，这个就是端；如果做事情不认真，对人不认真，这个就是曲。</span></p><p><strong><span>“皆当细辩。” </span></strong><span>以上的这些事情，端和曲都要懂得细细地去分辨。</span></p><p><strong><span>“何为阴阳？凡为善而人知之，则为阳善。”</span></strong><span>什么是阴，什么是阳呢？说只要你做善事情，别人是知道的，这个就是阳善了。</span></p><p><strong><span>“为善而人不知，则为阴德。”</span></strong><span>说你做了很多善行，做了很多善事，但是别人是不知道的，这个就叫阴德。</span></p><p><span>以前老人常讲这句话，尤其是我们爷爷奶奶那一代人，其实他们是很善良的。而且我们会发现，现在学习了圣贤的文化，去看那些老人家讲的话，真的很合道的，只不过他们可能没有那么多的文化，不能表述的那么清楚。所以叫什么？话糙理不糙。他讲的道理是对的。</span></p><p><span>那时候老人都告诉我们：“你一定要多做好事情，不要做损害他人的事情，一定要给自己积阴德。”无论别人看不看得见，你都要去做好事，而不是做给别人看的，这个就叫阴德。</span></p><p><strong><span>“阴德，天报之；阳善，享世名。”</span></strong><span> 如果你做了很多不为人知的善事、好事，你不需要图任何人的回报，天会报给你的。</span></p><p><span>所以经常做好事情的人、心善的人，会发现很有意思，在这一生当中只要你碰到困难，总有贵人相助；在每个看似你都解决不了的问题面前，你会发现总有那么一个人，莫名其妙地出现就帮助了你。</span></p><p><span>这个是天报之，是你自己的福德所致。因为你曾经也做了很多善行，不为人知的。所以你会发现，当很多人出现帮了你，人家甚至连姓名都不留，甚至需要你回报都不需要，那是天报给你的。</span></p><p><span>如果我们这一生当中，没有出现很多人莫名其妙地帮助过我们，你就要反思了，你也没不留名地帮助过他人，你也没做过不为人知的善事。</span></p><p><span>所以我们要懂得反思，而不是抱怨天道不公。天道是公平的，不会多加给我们每个人一丝一毫，你有多善就报给你多少善，你有多恶就报给你多少恶。</span></p><p><strong><span>“阳善，享世名。”</span></strong><span> 说你做了很多别人看得见的事情，好事、善事，是不是你就享了世名了？别人都知道你了，知道你做了很多好事，你就有好的名声了。</span></p><p><strong><span>“名，亦福也。”</span></strong><span> 说有好的名声，也是一种福。“名者，造物所忌。”好的名声是造物者、造物主、天命、命运所忌讳的东西。为什么呢？</span></p><p><strong><span>“世之享盛名而实不副者，多有奇祸。”</span></strong><span>世上的人，如果你得了很好的名声，但是如果你实际的德行不够，我们为什么讲名副其实呢？如果不够，是不相符的，多有奇祸。</span></p><p><span>这个世界上，这样的事情还少吗？有很多人享了盛名，可是你自己的德行不足够的时候，多有奇祸，各种各样的事情、问题、灾难就开始出现了。历史上也好，现在这个社会也好，比比皆是。所以享世名，真的好吗？不一定。</span></p><p><span>所以我们要懂得修行之道，怎么办呢，一旦还有很多人赞美你、夸奖你的时候，你要引以为戒，要时时刻刻警醒自己的行为，去看看我们自己做得真的够吗？不够怎么办？补，赶紧去补齐。所以你只有名副其实，才不出奇祸。</span></p><p><span>所以为什么我常讲《道德经》的一句话：“宠辱若惊，贵大患若身，宠为下。” 不要觉得天天别人赞美我是好事，别人天天打电话告诉你：“老师讲得真好！”不，不，是你自己修得好，也确实是人家修得好，人家听懂了。如果我们要是骄傲自满了，要出问题的。</span></p><p><span>比如说别人夸你们也是一样的：“这个小姐姐真好！”夸你的时候，你干嘛呢？你要明确的知道，我享了好的名声了，我得加紧修行自己，哪里有漏，补啊，你不要等着出问题。</span></p><p><span>我们要反过来思维。因为有一些世名，你没有办法。你做的事情越多，你一定享受到了。所以享受到的时候，我们不是沾沾自喜，我们要深刻地引以为戒，看哪里不足，要时时刻刻注意自己的言行。</span></p><p><span>所以《诗经》上讲：“战战兢兢，如临深渊，如履薄冰。” 当你享了世名的时候，你是战战兢兢的状态，仿佛走到深渊的边缘了，仿佛走在薄冰上，要化的，你要掉下去的，很危险的。</span></p><p><span>这个时候，我们更要懂得慎独的重要性了，绝不能骄傲自满，否则必有奇祸！这样的案例数不胜数，我们一定要懂得谦虚，要懂得谨慎，要懂得处下，要懂得多去看自身的问题。越是受到别人的赞美，我们越要严格要求自己，否则要出问题的！</span></p><p><span>所以你看圣贤的思维是这样的，是不是跟我们世人的思维是反的？别人夸我是好，夸我真好，夸我太美妙了，夸我证明我很优秀。不是这样的。</span></p><p><strong><span>“人之无过咎而横被（pī）恶名者，子孙往往骤发。” </span></strong><span>横：就是白白的，突然的。被是什么？就是担了恶名。一个人你要是没有那么多的过错，而突然担上了恶名，往往子孙骤发，子孙忽然就兴盛了。是因为你承担了你不该承担的东西，所以会发现，反而你会拥有得更多，因为那是天报之的。</span></p><p><span>当很多东西明明不是我们的问题，或者是我们更慈悲的时候，我们就修了忍辱。会发现一个人越修忍辱，越有智慧；越修忍辱，福报越大。</span></p><p><span>越是智者和古之圣贤，遇到了被别人侮辱、误解的事情，不太解释的，他都会懂得反观自省，我自己有没有亏了我自己的德行，我是否是问心无愧的。如果是的，你会发现，不需要去解释。你越是这样，反而你的德行越好，反而你的智慧越高。</span></p><p><span>越是智者，越是坦荡的人，越不解释。什么样人才解释？你心里有亏，你才解释。不停地解释、反复地解释，结果越解释越黑、越描越黑。所以我们懂得这个道理就好了。</span></p><p><strong><span>“阴阳之际微矣哉。”</span></strong><span> 际是什么？就是边界。说阴阳的边界是很微妙的，我们一定要懂得，细细地去分辨。</span></p></div>"
},{
    "title": "第二十一讲《积善之方》圣贤是非观",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇-圣贤是非观</strong></span></p><p><span><strong>“何谓是非？鲁国之法，鲁人有赎人，臣妾于诸侯，皆受金于府，”</strong>这一段告诉我们，怎么样去细细地分辨是非。在春秋时候，鲁国曾经有一条法令，鲁国的人，只要从其他的诸侯国，赎臣妾回来，那个时候被别人抓走的，奴役的、奴隶的男称为臣，女子成为妾，也就是被俘虏的，被抓去当奴隶的人，称之为臣妾。</span></p><p><span>鲁国的人，只要从其他的诸侯国，把这些做臣妾的人赎回来，赎到鲁国，皆受金于府，就是去政府那里可以领奖赏的金银的。</span></p><p><span>因为我们去其他的国家赎人的时候，也需要花钱的，只要赎回来，到鲁国的政府这里，就可以领到赎金，领到奖赏，有这样一条法令。这条法令就是鼓励更多的鲁国人，去救助那些被奴役的臣和妾，也就是男人和女人。</span></p><p><span><strong>“子贡赎人而不受金。孔子闻而恶之曰：‘赐失之矣，’”</strong>孔子的弟子，子贡这个人，我们经常讲大家也都知道，能做官又比较富有。他去其他的诸侯国赎人回来，而不领奖赏，孔子知道了这件事情，不太高兴的样子，讲了这样一段话。</span></p><p><span>子贡这件事情，做的是不对的，是有失的，为什么？按正常我们的想法，子贡赎回来的人不要政府的奖赏，应该是好事，可是孔子却不高兴了，说子贡这件事情，做的是不对的，为什么呢？</span></p><p><span><strong>“‘夫圣人举事，可以移风易俗，而教道可施于百姓，非独适己之行也，’”</strong>圣人做事情，不是适合自己的就好了，因为子贡自己比较有钱，比较有势，他可以不在乎这些赏金，但是圣人做事情不是这样子的，圣人做事情要干嘛呢？可以移风易俗，可以使风气变得更好，变得更正，这是圣人做事情的出发点，而教道可施于百姓，因为圣人所举事，不单要移风易俗，去引导社会的风气，并且还要教育和引导百姓的，让百姓去效仿的。</span></p><p><span><strong>“‘今鲁国富者寡而贫者众，受金则为不廉，何以相赎乎？’”</strong>今天的鲁国，富有的人少，贫穷的人多，如果子贡，去赎了这样一个人，而不受金，那以后社会的风气会是什么样子的？如果别人赎了人，拿了政府的赏金，就会被认为不廉洁，那以后谁还能去其他的诸侯国赎人。圣人的思维，是不是跟我们完全相反的，他不是在考虑自己的得失和这件事情适不适合，而是要考虑做这件事情，给整个社会和人民带来的影响。因为子贡在鲁国，是一个名人，是有社会地位的人，越是有社会地位的人，越要注意自己言行，给别人所带来的影响。</span></p><p><span><strong>“‘自今以后，不复赎人于诸侯矣。’”</strong>从今以后不会再有人，去其他的诸侯国赎人了，他做了这样一件事情，孔子很不高兴，说我们做这个事情，实在是不符合圣人的行为。我们今天这个社会，不是一样的吗？</span></p><p><span>为什么大家对公众人物的要求，会比较苛刻，因为是引领着社会风气的，是受人瞩目的，所以做事情就要格外的谨慎，不光要谨慎，不是为了自己的个人的得失和荣辱，要去考虑社会的风气，就好比是子贡这件事情，看似是好的，说我赎人我也不在乎这点赎金，那么我什么都不要，别人都按照这样去效仿，谁又敢去赎人呢？</span></p><p><span>因为去其他的国家赎人，是要花钱的，这样就会阻挡了很多人，不去做这件事情，圣人的是非观，和我们的是不同的，我们的是非，只考虑自己适不适合就好了，说我不在乎钱，我就不要了，不要了，别人如果都效仿，别人要怎么生存呢？别人要怎么生活，是非是怎么判断的？是看给别人带来的影响是什么，而不是自己觉得怎么样。</span></p><p><span><strong>“子路拯人于溺，其人谢之以牛，子路受之。孔子喜曰：‘自今鲁国多拯人于溺矣。’”</strong>又举了一个例子，另外一个弟子子路，救了一个快要被淹死的人，那个人感谢他的时候，送给子路一头牛，子路接受了。孔子听了这件事情很高兴，说孔子为什么高兴？子路做得好，孔子说了，从今以后会有很多，救人于溺水之中的人，这件事情，给别人带来的影响是好的。</span></p><p><span>如果我们从表面上来看，似乎是子贡更好，救人而不拿赎金，子路救了个人，还要人家一头牛，可是孔子却很高兴，为什么？因为给百姓带来的影响和表率作用是好的，我们回头再来讲这一件事情，比如说子路在水里面救人的时候，他是不是为了一头牛去救的，不是吧？</span></p><p><span>到了我们社会也是，但凡救人于危难之中，一定不是为了回报的，他当下那一刻，脑子里想的都是救人，我们现在是不是有很多救水的英雄，救火的英雄，或者发生一些意外灾害的，有很多这种善良的人，有品行的人去舍己救人。</span></p><p><span>当时他想的一定不是好人，要是计较得失他就不救了，所以说当他这样去做的时候，他是在鼓励善行，是给整个社会的导向，带来好风气，所以孔子很高兴，这个就是引导和影响的力量。</span></p><p><span>我们再往小来讲，即使是回归到一个家庭一个团队，是不是如此，一个人做事的行为，会影响着家里其他的成员的。举例子，家里的某一个人，尤其是一家之长，如果我们是乐善好施的，孩子性格是不是变得跟我们一样，如果父母性格是斤斤计较的，遇事情就抱怨的，孩子慢慢地受我们的影响，变得一模一样。</span></p><p><span>这就是长期影响的力量，所以为什么说，什么样的家庭会培养出什么样的孩子呢，注意，不是我们刻意教的，是平时的言行举止，就带有这样的导向。</span></p><p><span>我们在团队当中，是不是一样的，一个人的言行举止，潜移默化地影响着，身边的每一个人，不知不觉当中，就会随着我们的变化而变化。大家每天讲的，都是如何帮助他人，一次，两次，三次，一天，两天，三天，身边的人，是不是都受影响了？</span></p><p><span>如果大家满脑子碰到事情，都是指责，都是抱怨，一天，两天，三天，所有的人都是抱怨的，水滴石穿的力量很大，所以圣人在做事情，都在干嘛？都在严格地要求自己，每件事情的出发点，论证的是和非，都不是以自己为考虑的，而都是在考虑他人会怎么样，会给别人带来什么样的影响。</span></p><p><span><strong>“自俗眼观之，子贡不受金为优，子路之受牛为劣，孔子则取由而黜赐焉。”</strong>如果用我们世俗的眼光看，好像子贡更好，子路不好，这个黜是什么意思？责备。孔子却赞扬子路的行为，而去责备子贡的行为，为什么？下面给了我们更详细的说明。</span></p><p><span><strong>“乃知人之为善，不论现行而论流弊；”</strong>人的行善不是仅仅只看当下的善行，所以叫不论现行而论流弊，流弊就是流传下去所产生的作用。因为子贡这样的行为，流传下去会产生不好的作用，会让别人不敢，也不愿意去其他的诸侯国，再赎人回来。而子路这件事情，看似他接受了一头牛，可是穷人多，这个时候，别人就会更愿意去救人，所以说流传下去的风气是好的。</span></p><p><span><strong>“不论一时而论久远；不论一身而论天下。”</strong>不是看一时的得失，而是看得更久远，看得更长久，不在意自己的个人得失和荣辱。当时子路接受了一头牛，用现在的话一定被人骂的，因为别人一定说他，还是孔子的学生呢，救人一命还得要人家一头牛，他一定是被别人误解和曲解的，可是那又如何呢？个人的得失又能怎么样，给别人带来好的影响，才是好的。</span></p><p><span><strong>“现行虽善，而其流足以害人，则似善而实非也；</strong>现行虽不善，而其流足以济人，则非善而实是也。然此就一节论之耳。”现行看似好像是善的，但是流传下来的东西，是可以害人的，如果细细分辨，这里面的是非观是不同的。看似是善 实则不是的，子路这样的行为，现行看着好像不是那么善，但是流传下来的东西，足可以救济更多的人，所以举了这样一个例子来讲这个事情。 </span></p><p><span><strong>“他如非义之义，非礼之礼，非信之信，非慈之慈，皆当抉择。”</strong>其他还有很多类似的事情，比如说我们举例来讲，什么叫非义之义？我们现在的社会当中，也经常出现这种情况，说我跟谁的关系比较好，我跟他特别讲义气，他什么事情，我都两肋插刀去相助，非义之义是什么，明明他做的是不好的事情，还在讲义气，看似是帮了他，实则是有损更多人的利益，这个不是义气的。</span></p><p><span>我们经常举这样例子，比如说我们有一个朋友偷电动车，我们帮他把风，觉得我很义气，然后他出去跟人打架，我们帮他打架，觉得我很有义气，那叫义气吗？不叫义气的。看似对他讲了义气，却伤害了更多的人，所以《论语》都告诉我们，君子是和而不同的，小人是同而不和，君子看到的都是和谐，不会同流合污的，所以义气我们要怎么看？</span></p><p><span>什么叫真正的义气？就是去看他做的这件事情，是不是对他人有益的，是不是会给别人带来正向的帮助和引导的，如果是，那叫义气，如果他只是为了一己之私，他做出来的事情，只有自己得好处了，而别人却受到伤害了，那不叫义气。如果我们不懂得去分辨，无形当中，我们做了很多错事，却不自知，我们以为是讲义气的，非礼之礼，非信之信，非慈之慈是一样的，都是一个道理。</span></p><p><span>再举一个例子，非慈之慈，比如说现在我们家里有很多的小孩子，尤其是爷爷奶奶，或者是外公外婆带孩子的，他们觉得对孩子是慈爱的，却给孩子养成了很多不好的习惯。</span></p><p><span>比如说，我经常看到这样的情况，小孙子或小外孙明明打了一巴掌，爷爷还特别高兴，由此就会养成孩子爱打人的习惯，见没见过这样的孩子，因为孩子，他是没有是非的分别能力的，他打我们，我们在笑，他就以为，我们喜欢这样的动作和行为，我们会发现他见人就打，最后这个孩子人人都不喜欢。这是慈爱的是吗？</span></p><p><span>现在有很多家长，也是一样的，孩子可能才六七岁，七八岁，跟别的同学和小朋友之间起了一点摩擦，他是怎么教育的？不能吃亏，要打回去，甚至家长帮着跟着吵，给孩子培养的是什么样的品性？看似是在慈爱他，是在疼他，不是这样的。我们没有去考虑这件事情更久远的影响，对孩子的未来，会形成什么样的品格。</span></p><p><span>现在有很多年轻人不也是吗，比如说哥哥姐姐或者父母条件比较好的，就很放纵孩子，他不上班就不上班，不工作就不工作，不努力就不努力，觉得可以养他，可是时间长了，他就养成了不劳而获的习惯，他将来要如何自立，将来要如何独处，所以看似是慈爱的，实则不是的。</span></p><p><span>如果我们真正懂得，对他是慈爱的，要为他的未来着想，不论一时而论久远，不要看当下让他舒服了，时间长了，孩子的一生就这样荒废掉了，他不可能永远在我们的庇护下长大，然后我们会发现，他要一直在庇护下长大，突然有一天，我们想让他独立了，他的性格已然形成，独立不了。</span></p><p><span>现在很多孩子，逐渐得抑郁了，为什么得抑郁症呢？通常得抑郁症的孩子，家里一般的话，都有强势的父母，父母太强势了，孩子说什么都不被认可，不被鼓励，不让他做主，久而久之，他的性格就形成自卑了。当我们想让他再独立的时候，强势的父母更强势，你怎么就不能独立，你怎么就不能自信一点，那是我们培养出来的，那是我们引导出来的，而我们不自知，还在抱怨孩子吗？</span></p><p><span>所以我们一定要懂得，真正的慈爱，一定是为他的未来去着想，而不是只指当下，这件事情，皆当抉择，这些事情我们都要懂得，更加深刻地，更加细致地去分辨。我们做事情，才真正懂得是非，我们在没学习之前，总觉得我们懂了是非，明了善恶，大家有没有感觉，越学好像自己连是非也不会分别了，连善恶都不清楚了。所以为什么要学习圣贤的文化？</span></p><p><span>孔子说：“不见迹，亦不入于室”，如果不踏着圣贤的痕迹，是很难升堂入室的，就是学不到家，因为圣人留下来那么多，对我们好的文化，我们踏着足迹往前走就好了。</span></p></div>"
},{
    "title": "第二十二讲《积善之方》谓偏正半满",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇-谓偏正半满</strong></span></p><p><span><strong>“何谓偏正？昔吕文懿公，初辞相位，归故里，海内仰之，如泰山北斗。”</strong>这一段开始讲到什么叫偏、正？昔吕文懿公，昔就是曾经，吕是姓氏，文懿公是谥号，是明朝的一位宰相。我们的文懿公，初辞相位的时候，回归故里了，他的德行是大家都敬仰的，如泰山北斗一样。</span></p><p><span><strong>“有一乡人，醉而詈之，吕公不动，谓其仆曰：‘醉者勿与较也’。闭门谢之。”</strong>在乡里的时候，遇到一个人，喝醉酒以后骂他，辱骂他，吕公不动气，不生气，也不动怒，跟身边的仆人说，他是一个喝醉的人，不要与他计较，谢客，闭门，不理会就好了。</span></p><p><span><strong>“逾年，其人犯死刑入狱。吕公始悔之曰：‘使当时稍与计较，送公家责治，可以小惩而大戒。’”</strong>过了一年，那个人犯了很重的刑罚，被判了死罪。吕公开始后悔了，为什么后悔？假使当时，我要稍稍与他计较一下，送到官府，给他点小小的惩罚，让他引以为戒，也就不会发生今天的事情了，所以这是一个圣贤之人的想法。</span></p><p><span><strong>“‘吾当时只欲存心于厚，不谓养成其恶，以至于此。’”，</strong>我当时只是心存仁厚，觉得不要与他计较了，未曾想给他养成了更大的恶，所以才有了今天，非常的懊悔，这是圣贤跟我们的不同，按正常我们一般人的思维，是什么样的？如果那个人被判了死刑，可能会幸灾乐祸，即使不幸灾乐祸，可能还会说什么？他这样的行为，肯定是这样的结果。</span></p><p><span>可是圣贤之人不是的，他在想这件事情，其实我做的也不够，如果当时我做的再好一点，给他一些小小的惩罚，可能他就不至于养成更大的祸端了，尤其我们教子，不是如此吗？看到他一些不好的行为，一定要懂得及时纠正，而不是放纵，将来他会酿成大祸的。</span></p><p><span>当我们喜欢一个人的时候，一定不是掩盖他的缺点，一定把他指出来，让他去成长，而不是护着他，护着他实则就是害了他，最后可能会养出来很多，更多的不好的习惯出来，他就会被更多的人，修理和嘲笑，那不如关起门来，我们自己修理，所以一定要懂得真正的爱一个人，一定是让他成长，指出他的问题，不是给他藏着，藏着能行吗？</span></p><p><span><strong>“此以善心而行恶事者也。”</strong>整个这一段，告诉我们一个道理，虽然是善心，可是最后的结果，行的却是恶事，告诉我们做事情什么叫偏，什么叫正？我们的发心是什么，是为了他的未来去着想的，是为了让他变得更好而着想的，而不是只以当下的一个行为，去论偏或者正的。</span></p><p><span>“又有以恶心而行善事者。如某家大富，值岁荒，穷民白昼抢粟于市。”接下来举了另外一个例子，以不好的心，恶心，但是结果却是行了善事的例子。比如说有一家富有的大户人家，值岁荒，就是荒年，人民吃不上饭，很多平民在街市上，光天化日之下，就去抢粮食。</span></p><p><span><strong>“告之县，县不理，穷民愈肆，遂私执而困辱之，众始定。不然，几乱矣。”</strong>去告诉给县衙了，县衙不管，既然县衙不管，这些贫苦的人民，就更加地放肆，接下来大户人家，就私下执行，把这些人囚禁了，并且辱骂他们，指责他们，这就是小城大戒。这个时候，众人开始害怕了，开始稳定下来，不然只会让整个城变得更乱。整个故事又告诉我们一个道理，虽然他出的是不好的心，可是最后那个行为的结果是好的。</span></p><p><span><strong>“故善者为正，恶者为偏，人皆知之。其以善心而行恶事者，正中偏也；”</strong>善者就是正的，恶者不正就是偏的，这个是人人都知道的道理。吕公的故事，告诉我们一个道理，我们是以善心，但是行的却是不好的事情，造成了不好的结果，虽然是正的，但是正中还有偏，也就是说当我们做一件事情，我们的善心善行虽然是好的，但是如果导致那件事情的结果不好。虽然我们是善行，可是正中还有偏，就是好的里面，还有不好的成分在。</span></p><p><span><strong>“以恶心而行善事者，偏中正也，不可不知也。”</strong>如果以恶心，最后结果却成了善事，我们的起点不对，所以叫偏，但是虽然起点不对，偏中还是有正的，就是不好的心念和行为当中，却产生了好的结果，所以里面还有正，就是我们一定要知道这个道理，从里面细细地去分辨。</span></p><p><span>这一段讲的是何为偏正，我们做事情的时候，因为不断地要改过，不断地修正自己，让自己变得更接近圣贤，那我们要做事情，无论从出发点，还是考虑后面长久的，所带来的影响和结果，我们尽量都去做到正，做事情的发心是好的，行为是好的，也往后考虑的更长久一点，尽量让自己符合那个正。</span></p><p><span><strong>“何谓半满？《易》曰：‘善不积，不足以成名；恶不积，不足以灭身。’”</strong>这一段告诉我们，什么叫半，什么叫满？《易经》说，如果不能不断地去积累善行，是不会有好的名声和名誉的，同样反之也一个道理，要不是做了很多的恶事，也不足以灭身的，叫身败名裂。</span></p><p><span>为什么会身败名裂？一定是做了太多的不好的恶事，不好的行为所导致的，德不配位，必有余秧，所以其实整个这段话的在，告诉我们什么？就是两个字，积累。善行是我们积累出来的，名誉、德行也是我们积累出来的，同样我们的恶行，导致身败名裂，让生活变得越来越不好的，让品性变得越来越不好的，也是我们自己积累而来的。</span></p><p><span>“《书》曰：‘商罪贯盈。’如贮物于器，勤而积之，则满；懈而不积，则不满。” 书是指《尚书》，我们经常听到一个词叫，恶贯满盈。商指的那个时候商朝，商朝后来被周王朝取代了，商罪贯盈是什么意思？以前的钱串都是用绳穿起来的，穿满一串叫一贯，所以叫恶贯满盈，它形容的就是多，说做了太多不好的事情，所以说叫商罪贯盈。</span></p><p><span>好比是一个储存东西的器物，如果不停地去往里面积累，勤而积之，就会变得越来越满，如果不去努力地积累，不满，就是半，所以我们做任何事情不是一样的吗，我们的学习，不是一点一点积累的吗？每天学习一点点，每天进步一点点。苟日新，日日新，又日新。</span></p><p><span>比如说大家做事情也是一样的，哪个工作环节，变得熟练了，怎么变熟练的，这也是日积月累的，我今天做一点点，明天做一点，做着做着，越做越熟练，我们修行不是一样的吗？因为很多朋友总是很着急，什么时候能有智慧，我什么时候能开悟，我什么时候能变得博学？都是点点滴滴而来的。</span></p><p><span>我们不好的行为不也如此吗？所以说，让自己每天的行为变好，去往好的方向积累，而不要往不好的方向去积累，都是点点滴滴所产生的，千里之行始于足下。<strong>“此一说也。”</strong>这是一种关于半和满的说法。</span></p><p><span><strong>“昔有某氏女入寺，欲施而无财，止有钱二文，捐而与之，主席者亲为忏悔。”</strong>曾经有某女，入寺庙想要布施，但是没有钱财，身上只有二文钱，这个时候全部捐赠给了寺院，主席指的是主持，寺院的主持亲自为他忏悔和回向。</span></p><p><span><strong>“及后入宫富贵，携数千金入寺舍之，主僧惟令其徒回向而已。”</strong>后来这个女子入了宫，得了富贵，这个时候带来了千金入寺，之前只有二文钱，可是这位住持，只是令他的弟子，给他做回向和忏悔。</span></p><p><span><strong>“因问曰：‘吾前施钱二文，师亲为忏悔，今施数千金，而师不回向，何也？’”</strong>这个时候那女子非常不解，我们也不理解，之前只布施了两文钱，为什么主持亲自给他做忏悔和回向，而这时带了千金来，却只是让他的弟子给做了回向。不明原因所以问，师父，这是什么情况，我之前只布施了两文钱，您亲自为我忏悔，现在我带着千金来做布施，为何只是让您的弟子给我做回向，不理解。</span></p><p><span><strong>“曰：前者物虽薄，而施心甚真，非老僧亲忏，不足以报德；”</strong>这位主持说，你之前所布施的东西，物虽薄，虽然只有二文钱，可是你布施的心甚真，之前这个女子到了这里，身上只有二文钱，都拿出来做布施了，甚至把我的全部都去做布施，这个时候他的心是很诚的，如果我不去亲自为你忏悔，为你做回向，不足以报德，我们不足以报你的这份德行。</span></p><p><span><strong>“今物虽厚，而施心不若前日之切，令人代忏足矣。”</strong>今天你带来的东西虽多千金，但布施的心，已经没有之前真切了，我让弟子给你做回向足以，所以这里看的是什么呢，是你心是否真切？我们之前也讲过，了凡先生为民减粮的一件事情，他的施心非常的真切，一行就顶万善了，所以我们平时做事情，不是一样的吗，比如说生活当中，当我们有一个事情，有很多朋友来帮忙的，那个人来帮忙的心，切不切，真不真，难道我们感受不到吗？是不是清清楚楚。</span></p><p><span>比如说我们遇到了一个困难，朋友借钱给我们，有的人可能借的钱很少，可是他真的是很急切地想要帮助我们，反而更感激他，可是另外一个人，虽然借钱给我们了，可是他帮助我们的心并不真切，甚至冷嘲热讽的，我们可能不但不感激他，心里可能还默默地产生怨恨，当然产生怨恨是我们自身的不足，我们只是讲这个道理，生活当中这样的案例比比皆是。</span></p><p><span>所以这一段告诉我们，他提倡的是做事情真切的心，我们大家在一起学习，在一起修行，在一起做事情，不是一样的吗，谁的心是不是真切的，看得不清楚吗？包括这些朋友们，跟着我们一起去学习，不是一样吗，谁是真的想学习，真的想修行，心真不真，切不切，我们不是看得清清楚楚，这里更多的是告诉我们，这一段讲心，我们的真心很急切的去做事情，很急切的去布施，这个叫满，如果不真切，东西虽然多，也是半。</span></p><p><span><strong>“此千金为半，而二文为满也”，</strong>这句话做了总结了，千金反尔是半，二文反而是满，因为真心不同，诚意不同。</span></p></div>"
},{
    "title": "第二十三讲《积善之方》辨善行大小",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇-辨善行大小</strong></span></p><p><span><strong>“钟离授丹于吕祖，点铁为金，可以济世。”</strong>八仙里面的汉钟离和吕洞宾，我们称为吕祖，汉钟离授丹术于吕洞宾，什么丹术呢？点铁为金，就是这个铁啊，点一下就会变成金子，可以济世，可以帮助世人的这样一种丹术。</span></p><p><span><strong>“吕问曰：‘终变否？’曰：‘五百年后，当复本质。’吕曰：‘如此则害五百年后人矣，吾不愿为也。’”</strong>吕祖问，金子将来会不会变回铁啊？如果教我的丹术点铁了以后，它一直是金子，还是以后会变回去，成为铁呢？这个时候汉钟离说，五百年以后啊，它才会变回去，本质就是铁。那这个我不能学，为什么不能学？</span></p><p><span>五百年以后，我现在是帮助了其他人了，帮助了世人了，可是却害了五百年以后的那个人吗，那个时候的人，拿到金子发现是一块铁啊，他成了受害者了，吕祖说这样的事情我不做，我不学。</span></p><p><span><strong>“曰：‘修仙要积三千功行，汝此一言，三千功行已满矣。’”</strong>这时汉钟离说了，以前经常说一句话，善满三千，自然成仙，仅此一言，已然成仙了。这一念头有多么重要，吕洞宾为什么会成为吕祖啊？</span></p><p><span>他的念头是什么，他考虑的多久远，如果这件事情，我虽然帮助了当下的人，可是五百年以后，会有受害者出现，这个事情我是不做的，这一个念头就可抵三千善行了。心念的力量何其强大。“此又一说也。”这是关于半和满的，又一说法。</span></p><p><span><strong>“又为善而心不着善，则随所成就，皆得圆满。”</strong>当做了很多的善事善行，但是却不着善，就是我也不认为我在做善事，我也不放在心里。随意做什么事情都得成就，皆得圆满。</span></p><p><span><strong>“心着于善，虽终身勤励，止于半善而已。譬如以财济人，内不见己，外不见人，中不见所施之物，是谓三轮体空，是谓一心清净。”</strong>刚才说了，如果我们去做很多善事，善行，而不着善，皆得圆满。可是如果我们，做了一些善事善行，着善了，虽然做了一生的善事，也只是做了一半，内不见己是无我相，外不见人是无人相，中不见所施之物是无物相，是谓三轮体空。</span></p><p><span>什么都没有，我也不记得我布施什么东西，我也不记得我布施给谁了，我也不记得布施的是什么东西财或物，这个叫一心清净。如果我们做了很多善事和善行，不能一心清静的时候，就会杂念频生，并且反而会生出来很多的烦恼和痛苦。</span></p><p><span>生活当中是不是这样的，明明可能我们帮助了别人，做了一些事情和好事，善行善举，可是我们总把那个事情，挂在嘴上的时候，别人是不是反而不感激我们了，一旦我们做了一点善行的时候，我们都在渴望着对方的回报，他就不是善行了，是索取。</span></p><p><span>并且我们内心会产生极大的痛苦，比如说我帮了他，他连声谢谢都没说，比如说我帮了他，当我出现事情的时候，他并没有出现，反而会滋生了很多的痛苦，我们帮的人越多，自己的痛苦越多，因为每天都在期盼着，有人能回报给我们，每天都在期盼着，对方的感谢，反而自己活得会很累，给自己造成了很多的烦恼和痛苦的根源，并且这样我们的功德，善行，又变小了，变成一半了。</span></p><p><span>同样道家也告诉我们这个观念，《太上感应篇》讲：“施恩不图报，与人不追悔”，我们施给别人的恩德，是不图回报的，与人不追悔，送给别人的东西，是不后悔的。生活当中，经常有因为这个事情而痛苦的，就是我们与人就开始追悔。</span></p><p><span>举个例子，我们送给别人这样一个杯子，我们还得看着，他用没用，是不是给别人了，我们送给别人茶叶，他是不是自己喝的，他一定不能给别人喝，一定不能转送他人。很多恋人之间，是不是这样的？</span></p><p><span>送他一件衣服，他为什么见我没穿，那件衣服哪去了，为什么重要场合他不穿？反而会增加很多的痛苦，这个杯子也好，茶叶也好，我们已经送给他人了，他就不属于他人的东西了，如何安排，不是他的事情吗。</span></p><p><span>生活当中，我们常常因为这些小事而烦恼，纠结痛苦啊，所以我们不从善行的角度来讲，只要我们做事情，只要做善事，还在着相，痛苦和烦恼的是我们自己，所以一定一心清静的去做事情。</span></p><p><span>生活当中还有很多这样的人，比如说，我帮过很多的人，突然有一天，别人回来感谢的时候，我还帮过他吗？我实在是忘了，不太记得这件事情，这叫三轮体空。这个是一心清静的，越是这样反而得的福德越多，越得圆满，所以说无论从善行的角度，从功德的角度，从我们自心清净的角度，我们一定不要着相，否则很痛苦，反而滋生烦恼。</span></p><p><span><strong>“是谓一心清净，则斗粟可以种无涯之福，一文可以消千劫之罪。”</strong>只要我们一心清静，哪怕是一斗米，也可以种无边的福德，哪怕是一文钱，也可以消千劫之罪业，所以告诉我们什么呢？其实很多时候，不在于善行的大或小，而在于我们的心是否清净，我们的念是否纯正，我们是不是能做无相布施，无愧于这些相里面。</span></p><p><span><strong>“倘此心未忘，虽黄金万镒，福不满也。此又一说也。”</strong>如果不能一心清静，不能忘记这些事情，每天都记在心里，虽然用了很多黄金，可是福德，也不会满的，只是一半，这是关于半和满的另外一种说法。</span></p><p><span>其实整个这一节，给我们举了好几个例子，都在讲半和满，都在告诉我们，发心至真至纯的重要性，所以平时，我们做任何事情的时候，一定要看看，自己的心是什么样的，我们自己的念头起处，是为了什么去做这件事情的？</span></p><p><span>另外就是做完了以后，让自己一心清静，坦坦荡荡的，这个时候心才无挂碍。想象一下，我们每天做了一些事情，天天想着帮助过谁，累不累？会让自己很痛苦，让自己的心胸变得更小。</span></p><p><span><strong>“何谓大小？昔卫仲达为馆职，被摄至冥司，主者命吏呈善恶二录。”</strong>曾经有一个人卫仲达，馆职是翰林院的一个官员，曾经是做这样一个官职的人，魂魄被抓到了阴间，这个时候判官叫人，把他的善恶两本名册拿上来。</span></p><p><span><strong>“比至，则恶录盈庭，其善录一轴，仅如箸而已。索秤称之，则盈庭者反轻，而如箸者反重。”</strong>等到拿来的时候，记载恶录的名册，摆满了一个院子，而记录善的就一轴，这个箸是什么意思，像筷子，善录就一个，而且像筷子那么小，记录恶事的名册，堆满了一个院子。</span></p><p><span>索就是索要，让别人拿来秤称一下，结果说 拿秤称一下，他的罪业摆满了一个庭院，善业只有一轴，而且像筷子那么点。结果一称，反而一轴重，满庭院的恶业轻。</span></p><p><span><strong>“仲达曰：‘某年未四十，安得过恶如是多乎？’曰：‘一念不正即是，不待犯也。’”</strong>仲达这时问，我还不到四十，怎么做了那么多的恶业，表示不服，不理解，为什么那么多的恶业，不需要等我们做出来，一念不正，就开始造恶业了，都讲起心动念呢，一个不好的念头起，恶业已成啊，不需要再去做啊。</span></p><p><span>比如说我们生活当中，念头是不是常起，碰到一件事情的时候，心里可能默默地已经辱骂他上千遍了，甚至可能拳打脚踢一万遍了，每当我们的情绪起的时候，是不是恶念丛生啊，所以为什么修行修到最后，都要修起心动念呢，每一个念头都要端正，每一个意念起，都不是伤害他人的，年为四十，他已经做了那么多的恶业。</span></p><p><span><strong>“因问轴中所书何事？曰：‘朝廷尝兴大工，修三山石桥，君上疏谏之，此疏稿也。’</strong><strong>”</strong>他又继续问，说轴中所谓何事呢？写的是什么善业呢，曾经朝廷想要大兴古墓，要修三山石桥，要修三座大山，还要在这里建桥，但是呢，这是一件，劳民伤财的事情，据说这个事情就发生在福建，因为这个事情是劳民伤财的，所以卫仲达 ，这个时候就上书谏言，不要劳民伤财。就做了这样一件事情，说轴中所记载的，就是当时上书的稿，也就是说奏折的内容。</span></p><p><span><strong>“仲达曰：‘某虽言，朝廷不从，于事无补，而能有如是之力。’曰：‘朝廷虽不从，君之一念，已在万民; 向使听从，善力更大矣。’”</strong>仲达说，我虽然说了，可是朝廷没有听我的啊，这朝廷也没听，也没改变那个事情的结果，怎么会有这么大的力量。朝廷虽然没有听从，可是这一念起，在万民，因为上书这件事情，不是为了自己，是为了万民请命，是不要劳民伤财，因为这一个念头，动的是心怀苍生的，说假使如果是听从了，那力量比这个更大。</span></p><p><span>整个这段，其实都在告诉我们，当我们的念头起处，业已形成，无论是善念还是恶念，都是一样的。所以为什么修行，我们天天讲修心，要修正自己的念头，不要以为我们的一个念头起处，没有他人知道就好了，不行的。</span></p><p><span>我们天天讲修慎独，慎独我给大家讲过两层意思，第一层是独自一个人的时候，也要保证自己的行为是好的，还有一层是什么呢，要独自觉醒，觉察自己的念头，自己的心念起处，是不是恶的，是不是善的，因为当一念起的时候，虽然行为还没有发生，可是业已成，行为发生的时候，产生的业就会更大，无论善恶皆是如此。</span></p><p><span><strong>“故志在天下国家，则善虽少而大；苟在一身，虽多亦小。”</strong>如果念头起，志在天下国家的，虽然善少，其实它是大，因为是心怀天下，心怀苍生的，所以我们再去看历史，我们的圣贤，会发现是不是他们的想法，念头，行为都是利益天下苍生的，动的念头就大，而不是为了一己之私，或者为了某一个人，所以他的起心动念处就不一样。</span></p><p><span>如果善念，只在某一个人身上，虽多亦小，虽然做了很多善事，很多善行，可是它也是小的，如果我们志在天下国家，心怀的是苍生，虽然做的事情可能少，或者动了这样的念头，还没有产生具体的行为，可是善业已成，那么如果再继续产生行为，善业更大，这是大和小区别。</span></p></div>"
},{
    "title": "第二十四讲《积善之方》济众十纲目",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇-济众十纲目</strong></span></p><p><span><strong>“何谓难易？先儒谓克己须从难克处克将去。”</strong>这一段告诉我们什么叫难，什么叫易？先儒，以前的圣贤告诉我们，克己要先从难处开始修，克己克什么，克制自己的行为，克制自己的私欲，要从艰难处开始修，我们现在讲修行，也是一样的，难行能行才叫修行。</span></p><p><span>我们修行要讲次第，从一开始不断地去改正自己的不足，自己的过错，还有一种方式，就是从难修处去修，从难行处去行，这个也是戒的力量，这个也是约之以礼的力量。</span></p><p><span><strong>“夫子论为仁，亦曰先难。”</strong>这里的夫子讲的是孔子，孔子论为仁之道，也是说什么先难，《论语》里面有这段话，樊迟问仁，问孔子什么叫仁？孔子对他的弟子讲：“先难而后获，可谓仁矣”，做任何事情，都是先难而后的。</span></p><p><span>包括我们平时做事情也一样，刚开始做一件工作，做一件事情的起初一定是觉得难的，因为不会，先难而后获，只有先经历了这些困难，经历了这些不容易，后面才能获得，我们修行不也是一样的吗？刚开始是难的，要克己的，要不断地去修正自己的，要不断地提升自己的学识的，都是要经历先难的过程，然后才能后获。</span></p><p><span>创业不也一样的道理吗？刚开始的创业的初期，一定是艰难的，一定是困苦的，一定是不容易的，只有经历了这些困难，后面才会获得，一样的。两个人之间的感情，不也是一样吗？一定是先难的，要先懂得付出，先懂得给予，一开始赢得一个人的心，是很难的，只有赢得了一个人的心，经历了这些困难，后面才会获得，所以其实万事万物，都是这样的道理，都是先难而后获的。</span></p><p><span>但是往往我们，做事情，修行也好，学习也好，为什么容易退缩，就是不明其中的道理，总想着不劳而获，总想事情很简单地就能做成，总想做学问，我不付出就可以做成，我不努力就可以做成，那是不可能的，这不是万事万物发展的规律。</span></p><p><span>何为难易？先告诉我们要有这样的观念，要先难，后面才能容易，如果刚开始做的事情，都很容易，后面就会越来越难，包括我们的老人不都告诉我们，年轻的时候要多吃点苦，多经历点人生的挫折，这样才能安享晚年，很多人是不是反过来的，年轻的时候很放纵自己，很恣意妄为，可是年老的时候，生活反而不得安稳，这些老人告诉我们的都是合道的，所以我们一定要懂得，先难而后获的道理。</span></p><p><span>修行是一样的，很多人都会说修行，干嘛让自己那么辛苦呢，干嘛还要约束自己的行为，干嘛这个也不能做，那个也不能做，都是为了先难而后获。只有前期不停地去克己，让自己的行为更如理更如法，后面才能活得有智慧，才能活得淡定，才能活得从容，要不然后面怎么会结出来那么多果，所以不光是修仁德，要先难而后获，我们做任何事情，都是要先难后获的，包括我们现在所做的事情，也是一样的。</span></p><p><span>大家从开始不懂，一直到不停地去摸索，不停地去学习，我们一起奋斗的那些日日夜夜，都是艰难的，当经历了那个阶段，才会获得那件事情的成果，我们学习也是一样的，我们修行也是如此，我们要想增加自己的仁德，也是如此。</span></p><p><span>刚开始是艰难的，一定是不理解我们的人很多，一定是阻碍多，但是也只有经历了这些艰难，才会获得。接下来了凡先生举了几个，生活中的案例。</span></p><p><span><strong>“必如江西舒翁，舍二年仅得之束修，代偿官银，而全人夫妇，”</strong>江西有一位舒翁，舒老先生，舍了自己两年教书所得来的学费，代偿官银，代别人偿还了官银，保全了那对夫妇的生命。想一想这个事情是很难的，拿出来他两年仅有的，自己的收入，帮助了一对夫妇。</span></p><p><span>到现今我们这个时代，包括那个时代，其实是很难做到的，如果我们把自己两年的生活物资，拿出一部分给别人，还容易做到一点，但是全舍很难的。所以举了这位老先生的例子。</span></p><p><span><strong>“与邯郸张翁，舍十年所积之钱，代完赎银，而活人妻子，皆所谓难舍处能舍也。”</strong>又举了一个例子，河北邯郸一位张老先生，用了自己十年，所有积累的金钱，代完赎银，那个时候有人卖妻子，这个人把卖出来的钱，已经花光了，花没有了，这个时候如果再不去赎妻的话，可能他的妻子就要被用在他处了。这个时候张老先生，把自己所有的十年的积蓄，都拿出来，活人妻子。</span></p><p><span>举了这样两位老先生的例子，告诉我们这样的行为，都是在最难舍的地方去舍得。“如镇江靳翁，虽年老无子，不忍以幼女为妾，而还之邻，”又比如说镇江的这位老先生，老年无子，邻居想把幼女嫁他为妾，为他生子，可是这位老先生不忍心辜负了对方的青春年华，把这个幼女给邻居还回去了。</span></p><p><span><strong>“此难忍处能忍也，故天降之福亦厚。”</strong>这样的行为，都是难忍处能忍的。之前这两个故事告诉我们，难舍处能舍，难忍处能忍，所以天会降之厚福的。</span></p><p><span><strong>“凡有财有势者，其立德皆易，”</strong>其实所有的有财的，有钱的，有势的人，立德是比较容易的，比如说，《了凡四训》的主人公，袁了凡先生，他为什么积累的善行会比较多呢？因为他为官，可以做更多利民的事情，有财也是一样的，自己是有财富的，所以想去做帮助他人的事情，是不是更容易？</span></p><p><span>我们再延伸一点，只要是有一技之长的，立德都比较容易。比如说是有才华的，是有权势的，是有财富的，是有智慧的，可以去做法布施的，可以做无畏布施的，可以做财布施的，只要还有一技之长，立德就比较容易。</span></p><p><span>哪怕在生活当中，在工作当中，有很多自己的技能，也可以立德，可以去教会更多的人，可以去布施给更多的人，这就是法布施。当我们会的东西别人不会，我们诚心诚意的为他好，是教给他的，都是在布施法，所以只要有一技之长，我们去立德就是比较容易的。</span></p><p><span><strong>“易而不为，是为自暴。”</strong>立德这么容易的事情，如果不去做，自暴自弃，荒废了自己的才华，智慧，财富，还有权势。我们帮助的人越多，所积累的德行也就越多，之前咱们也讲过积阳善是享世名的，我们帮助了很多人，都是为人知的，那么就会得到好的名声，好的名誉，好的名望。</span></p><p><span>如果我们做的事情，是不为人知的，天会报给我们的，那是在积阴德。自身有这么多的财富，学识或者是智慧，如果不去帮助他人，不去给自己立德，不去积累躬行，这就是自暴自弃，荒废年华。</span></p><p><span><strong>“贫贱作福皆难，难而能为，斯可贵耳。”</strong>但是贫贱想去作福，去帮助他人，相对来讲是比较难的，但是难而能为，这个更可贵。</span></p><p><span>之前咱们讲过一个故事，有某女到寺院里面，身上只有二文钱，可是她的善心真切，都捐给了寺院，非常的难能可贵，所以住持亲自为她做忏悔和回向，但是后来她携了千金再去，善心不真切了，反而没有她之前那样可贵。我们现在很多时候，都去赞叹什么样的人，可能不太富有，可是他却帮助了很多人。</span></p><p><span>我们看新闻，经常看到这样的故事，说有的人可能一生在收废品，但却资助了很多失学儿童，这样的行为更可贵，所以这一段，都在告诉我们，要去做这些艰难的事情，要尽自己的所能，去帮助他人，帮助他人的同时，其实也是给自己积累德行。</span></p><p><span>《大学》讲的：“在明明德，在亲民，在止于至善”，我们去做至善的事情，去做向善的事情，不断地亲民，去帮助他人，其实也是在明自己的德行，其实利他就是自利的。</span></p><p><span><strong>“随缘济众，其类至繁，约言其纲，大约有十：”</strong>随缘去帮助众人，帮助别人，种类实在是非常的多，我们做任何事情，都是可以帮助别人的，甚至任何一个心念起，包括我们讲的话，都是可以帮助别人的，种类实在是繁多。大概总结一下，有以下十条。</span></p><p><span><strong>“第一，与人为善；”</strong>就是无论我们的言行，心念，所做的所有的事情，都是对他人有益的，都是帮助他人的，都是鼓励他人的，都是与人为善，都是与人方便的。</span></p><p><span><strong>“第二，爱敬存心；”</strong>我们无论做任何事情，爱和敬都是存在心里的。这十条，简略地讲解，后面有对于这十条的详细解释。</span></p><p><span><strong>“第三，成人之美；”</strong>《论语》讲：“君子成人之美，不成人之恶，小人反是”，君子的行为是要成人之美的，而不成人之恶，小人恰恰相反。</span></p><p><span><strong>“第四，劝人为善；”</strong>第一条告诉我们，与人为善，就是自己的行为，是要符合善的，现在不光我们要自己的行为善，还要劝人向善，要引导劝解他人，和我们一起去符合善良之道。</span></p><p><span><strong>“第五，救人危急；”</strong>去做救人危急的事情，我们老话也讲：“救急不救贫”，因为一个人贫，是他自己不努力，但是一个人遇到急事，我们一定要救的，然后我们要想救一个贫的人，怎么办？我们要鼓励他，靠他自己，要让他自己去增长智慧，要让他自己积极主动地去做事情。“授人以鱼，不如授人以渔”，就是要教给他捕鱼的方法，胜过于直接给他鱼。我们现在做事情，不也是一样的吗？要真想去帮助一个人，不是给他现成的东西，让他不劳而获，是教给他如何赚钱，如何成长的方法。</span></p><p><span><strong>“第六，兴建大利；”</strong>因为这样的事情，是可以利益更多大众的，以前通常指的大利是指的什么？兴修水利，比如说修桥，铺路，做水利工程这样的事情，我们现在把它延伸一下，什么叫大利？能利益更多大众的事情叫大利。</span></p><p><span>比如说儒家文化告诉我们，要教化众生，要传播文化，做文化的传承，这都是大利，因为做的这件事情，可以利益更多的人，可以利益更多的大众，叫大利。</span></p><p><span><strong>“第七，舍财作福；”</strong>舍一些自己的财富，去积累福德，去做有福德的事情。</span></p><p><span><strong>“第八，护持正法；”</strong>我们要护持那些正能量的，导人向善的那些法，儒释道的法，诸子百家的法，只要是教人向善的，让人变得更好的，我们都要去护持这样的法，让他能去传承下去。</span></p><p><span><strong>“第九，敬重尊长；”</strong>我们要懂得敬重比我们年龄大的人，敬重那些我们在心里佩服的人，敬重那些有学识的人，敬重那些有德行的人，我们现在通过不停地学习，不停地修行以后，我们把这个事情开始延伸了，我们去敬重每一个人，敬重我们生命当中出现的每一个人，敬重每一个帮助过我们的人，甚至敬重每一个陌生人。</span></p><p><span><strong>“第十，爱惜物命。”</strong>我们要懂得去爱和珍惜，每一个有生命体的有情众生，甚至是每一个物品。比如说一个杯子，比如说我们用的一个手机，比如说我们开的车子，比如说我们晚上睡觉的床，我们都要懂得去爱惜物命的。</span></p><p><span>我们把这个物再延伸一下，懂得去爱生活当中，每一个出现的人，事，物。任何一个东西，我们要都懂得爱惜，出现一个事情，我们也去认真地去爱护，这件事情的发生，出现一个东西，我们也珍爱这个东西，出现一个人，我们也要去敬爱这个人，这个时候，仁慈之心，格局，胸怀就在不断得变大，就像天地一样，他是孕育万物的。</span></p><p><span>我们为什么要和天地学习，《道德经》上讲：“人法地，地法天，天法道，道法自然”，人是效法地的，效法就是学习，我们学习天地什么呢？是他孕育万物，是他的厚德载物。让我们自己的胸怀更大，就可以从爱惜物命开始修。</span></p></div>"
},{
    "title": "第二十五讲《积善之方》谓与人为善",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓与人为善</strong></span></p><p><span><strong>“何谓与人为善？昔舜在雷泽，见渔者皆取深潭厚泽，而老弱则渔于急流，浅滩之中，”</strong>雷泽就是今天我们的山东省菏泽市，曾经舜帝在雷泽这个地方，看到很多捕鱼的人，年轻力壮的人，都在深水的地方捕鱼，因为那个地方的鱼更大更多，而老弱则在浅滩之处捕鱼。为什么呢？争抢不过那些年轻力壮的人呢，所以他们只能在浅滩处捕鱼，自然所得所获就会少。</span></p><p><span><strong>“恻然哀之。往而渔焉，见争者皆匿其过而不谈；见有让者，则揄扬而取法之。”</strong>舜帝看到了这件事情，很哀怜和悲悯这些老弱之人，所以怎么办？他自己也去捕鱼，看到那些争抢的行为，不去说；看到那些不争的人，看到那些礼让的人，他就去赞美这样的行为，并以这样的行为，为榜样啊。</span></p><p><span><strong>“期年，皆以深潭厚泽相让矣。”</strong>又过了一年，人们都养成了习惯，捕鱼多的地方，深潭处，人们会让给那些老弱之人，让他们去那里去捕鱼，舜帝这样一个行为，就引导了这个地方人的风气和他们礼让的形成。</span></p><p><span>《中庸》里讲：“舜帝好问好察迩言，隐恶而扬善，执其两端，用其中于民”，这段话是赞美舜帝的。说他是好问好察迩言，迩是什么，就是近处的意思，好问好察而言，身边所发生的事情，他好问，不懂就问，好察，不仅问，还要自己去观察，隐恶而扬善。</span></p><p><span>就是看到不好的行为，他不讲，把它隐藏起来，看到好的行为，他就去赞扬，这叫隐恶而扬善。执其两端，在善恶中间，找到一个合适的度，用其中于民，找到一个最适合的度，把他拿出来再用，这是舜帝的大智慧和仁德之心。</span></p><p><span>其实我们在企业当中，也是一样的，如果懂得隐恶而扬善，做事情就会事半功倍，比如说，我们看到一些不好的行为，我们不讲，把它隐藏起来，但是看到一些好的行为，一定要加以宣扬，加以赞美，加以肯定，并且以这个为榜样。别人就会去效仿，所以隐恶而扬善，是非常重要的一件事情。</span></p><p><span>不去揭露那些不好的事情，和不好的行为，我们在不停地扬善的时候，他是有导向的，任何一个团队当中，也是一样的，在扬善的时候，在赞美什么样的事情，在以什么样的事情让大家为榜样的时候，别人是不是自然的风气就会转。</span></p><p><span>所以舜帝就是这样的行为，圣人都是处不言之教的，是靠自己的行为在带动，看到这个地方在捕鱼，他自己去捕鱼，他去推崇什么样的行为，人们是不是自然就去效仿。</span></p><p><span><strong>“夫以舜之明哲，岂不能出一言，教众人哉？乃不以言教而以身转之，此良工苦心也。”</strong>以舜帝之明哲，如此的聪明和睿智，其实一言就可以教化众人的，什么意思呢？舜帝看到了捕鱼的这件事情，他是不是可以过去直接告诉大家，懂得礼让就好了，完全可以这样去做的，可是舜帝却没有啊，圣人都是行不言之教的，处无为之事。他看到了这样事情，自己身体力行地去做，去转化，是不是这个比说的力量更大。</span></p><p><span>因为说的话，这些渔民当时可能会听，对吧？说：“是的，我们以后也要这样”，可是当人离开的时候，他们可能又回归原本的样子，还是不会互相礼让的，可是舜帝是靠自己的行为去转化的，所以说君子是有絜矩之道的，上行而下效，所以我们每个人，都是一种絜矩之道。</span></p><p><span>当我们想要去做什么事情的时候，其实不是指责，而是自己多努力，去修正自己的行为。这个时候，是在身体力行地导人向善，这是很良苦的用心。</span></p><p><span><strong>“吾辈处末世，勿以己之长而盖；”</strong>袁了凡先生那个时代，为什么叫末世？就是衰亡的时代，所以说我们处于衰亡的时代，不要以自己的长处去压人，在我们这个社会当中，这样的事情更多，在一个团队当中，甚至在生活当中，是不是经常这样啊，我们会一个东西的时候，我们就拼命地贬低别人，去压倒别人，对吧？</span></p><p><span>“怎么这么笨，怎么这么无能，连做饭这么小的事情，也不会做，连软件这么简单的东西，也不会弄”，企业当中，一个团队当中，生活当中，经常出现的事情就是这样的，我们把对方打击的一无是处，他自己就会越来越自卑，越来越不自信，所以说，不要以自己的长处去压别人，去贬低别人，只会让他变得更不好。</span></p><p><span>这一段告诉我们，什么叫与人为善？我们以前粗浅地理解，认为我不要做坏事就好了，我们拿自己的长处，不停地去贬低别人，不也是在做坏事吗？只是我们以前不觉得，这是在做坏事。</span></p><p><span><strong>“勿以己之善而形人；”</strong>不要以自己的善行，跟别人去比较。就是不要自己做了点好事情，天天去跟别人对比，天天去跟别人比较。</span></p><p><span>举个例子，前几天发生疫情，我捐钱了，你捐了吗？前几天朋友碰到一个什么困难，我去帮忙了，你去没去啊？是不是这样的常态？其实这个都是与人为恶，所以我们要与人为善是什么？</span></p><p><span>我们做的善行，就默默地去做，不要道德绑架其他人，做了一点好事情，就一定要和他人比较，工作时候也是一样，我昨天加班两个小时，你加班了没有？这个都不叫与人为善，都是不好的行为。</span></p><p><span><strong>“勿以己之多能而困人。收敛才智，若无若虚。”</strong>困，就是为难的意思，不要自己会的东西比较多，就开始显能，开始为难他人。我们一定要懂得，收敛自己的才智，不要去贬低，不要去为难他人，也不要过多地去炫耀和彰显，懂得收敛自己的才智。</span></p><p><span>若无若虚，无，就是没有，虚是什么？好像不足的样子，是不是越是平和的人，越有智慧的人，就是这个样子的，看似好像什么都不懂，永远都是那么谦和的，好像没有智慧一样，好像智慧不足那个样子，其实没有过多地彰显。</span></p><p><span>《论语》中有讲，孔子与乡人相处的时候，言似不足者，说话好像是不太会说的样子，其实就是不跟人去彰显，所以圣贤处事之道，是这样的，要懂得收敛自己的才智，该用的时候用，不该用的时候，就像若有若无的状态。</span></p><p><span><strong>“见人过失，且涵容而掩覆之。”</strong>涵容就是包容、宽容的意思，掩覆就是掩藏，见到别人的过失和不足，去包容别人，并且加以掩藏，而不去宣扬，看到别人有一个不好的行为，或者工作当中，犯了一个什么样的错误，我们要懂得去包容，而不是给他不停地彰显出来，恨不得满世界的人都知道，他犯了一个什么样的错误，他做了一个什么不对的事情，所以这都是在隐恶而扬善。</span></p><p><span>但是别人做了一个好的事情，我们要去帮助人家，去赞美人家，去宣扬人家，让更多的人知道，而不好的事情，就帮助人家去隐藏一下，当我们去做这样的行为的时候，别人知不知道啊，别人做了一个好的事情，帮他赞美和宣扬，他心里清不清楚，清楚吧。</span></p><p><span>同样，他犯了一个错误，本来他已经提心吊胆了，可是我们在不停地揪住不放，非要去往外宣传的时候，他心里难不难过，心里痛不痛苦？他心里是不是紧张的，越是这样的话，怎么能说是与人为善呢？都是在做不善的事情和行为。</span></p><p><span><strong>“一则令其可改，一则令其有所顾忌而不敢纵，”</strong>为什么我们要包容的同时，帮他隐藏？第一给他机会，让他自己改正了。当我们不讲的时候，他自己心里清不清楚，大家是知道的，越是这样，其实他自己反而越去改正，可是我们越去说，对方反而不改了。</span></p><p><span>夫妻之间相处之道，是不是也这样的？本来对方犯了一个什么错误，我们要是不说，他自己还觉得不好意思，有点愧疚之心，还要改一改，结果我们天天说，天天说，最后不在意了，反正天天这么说，我也不改了，而且变本加厉。</span></p><p><span>孩子是不是也一样的？我们天天批评他，天天批评他，批评到一定的程度，他就不在乎了，随便说吧，无所谓，怎么说都行。形成对立和反抗了，所以说其实好的方式是点到则止，让对方清楚明白就好了，我们给他机会，让他自己去改正才有力量，另外让他有所顾忌，以后不敢肆意妄为，就可以了。</span></p><p><span>我们去读历史的时候，也是一样的，这些圣贤的君王，都会用这样的方法。看到一个什么事情，上朝的时候（我们现在叫开会），是不是含沙射影的，点化一番就完了，做了不对的事情的人，心里在打鼓，他明明知道圣上说的，就是他，可是就没说他，他自己回去是不是偷偷地就改掉了，并且不再敢肆意妄为。</span></p><p><span>做一个圣贤的君主，都是明察秋毫的，我们现在生活在这个时代，也是一样的，如果我们是明察秋毫的，并且心怀仁德的，有威仪又有威慑的力量，同时又是仁爱每一个人的，去给每一个人机会，去修正和改正自己，这个才是与人为善。</span></p><p><span><strong>“见人有微长可取，小善可录，翻然舍己而从之，”</strong>看到别人哪怕有微小的长处和优点，是可以取的，哪怕是有很小的善事，也是可以被记录的，这种情况我们要怎么办？翻然就是快而彻底，翻然悔悟，非常快，就是很快很彻底的，舍掉了之前自己的那些固有的不足，择其善者而从之，去学习人家身上的微长，去学习人家身上的那些小善，从而不断地去修正我们自己。</span></p><p><span><strong>“且为艳称而广述之。”</strong>艳称是赞叹的意思，并且我们要去赞叹，去传扬，我们不但自己舍己而从之，我们还要去赞叹人家，还要去广述和宣扬人家的长处，人家的优点，人家的善行，这叫与人为善。</span></p><p><span><strong>“凡日用间，发一言，行一事，全不为自己起念，全是为物立则，”</strong>我们每天在日常生活当中，每讲一句话，每做一件事情，我们讲的每一句话，我们做的每一件事情，都不是为自己在起念的，都不是为了自己的私欲的，全是为物立则，立则就是树立榜样，我们做任何事情都在想着，如何给他人树立榜样的。</span></p><p><span>舜帝在雷泽捕鱼的这个事情，不就是如此吗？我们去树立一个好的榜样，而不是为了自己的得失，我们生活当中也是一样的，做任何事情的时候，我们去想一想，我们这一个行为做出来的时候，是不是给他人带来一个好的榜样，而不是带来一个不好的影响呢？</span></p><p><span>当我们每个人都去这样思考问题，都去这样要求自己的时候，我们每个人都是絜矩之道，身边的人都会向我们学习。就像我们修行一段时间，大家每一个人本身都是一种絜矩之道啊，我们站在这里，坐到这里，别人看到我们的行为，自然就会受到我们行为的影响，这个就叫絜矩之道。</span></p><p><span>比如说我们任何一个团队当中，风气都是如此形成的，所以一个好的风气的带动，一个团队的氛围，一个企业的氛围，一个家庭的氛围都一样，都是要靠每一个人去，以身作则的，才能为物立则。为物立则的时候，树立良好的榜样，实则就已经是与人为善了，善行真的是无处不在。</span></p><p><span>大家会以为没有钱，我怎么行善？不是那样的，一个好的言语，一个好的行为，一个好的念头，都是在与人为善，善心真切的力量，远远比我们认为的，布施点钱，或者我做点有形的事情，要大的多。</span></p><p><span><strong>“此大人天下为公之度也。”</strong>大人是伟大的圣贤之人。这些伟大的圣贤之人，他的言行举止，做任何事情，都是为天下着想的，都是以天下为公的，那是他们的度量，所以我们学习和修行的过程当中，也是不断地去扩大自己的心量。</span></p><p><span>我们刚开始做的榜样，可能只能给身边的人，可能只能给自己家的孩子，但是随着我们的德行不断地增加，随着智慧在不断地增加，我们给树立榜样的人群，就会变得越来越大，与人为善，也会变得越来越大。</span></p></div>"
},{
    "title": "第二十六讲《积善之方》和爱与合敬",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--和爱与合敬</strong></span></p><p><span><strong>“何谓爱敬存心？君子与小人，就形迹观，常易相混，惟一点存心处，则善恶悬绝，”</strong>君子和小人之间的区别，如果从形迹上，就是表现出来的行为和表象上，常易相混，看着差不多。但是，唯一的区别在哪里，就是做事情所存的心不同，就是我们常讲的起心动念不一样，则善恶悬绝，绝然不同，相差反差非常的大，所以只是心念的不同，发心的不同而已。</span></p><p><span>我们举两个生活当中的例子，比如说同样是开公司，同样是在工作，每个人的发心就不同了，有的人发心是想让更多人受益，而有的人发心，可能只是为了赚钱，我们不讲这个事情的对或错，我们只是讲，同是做公司这件事情，行为上，行迹上，看着是差不多的，可是发心处不同，长此以往所产生的结果，就会绝然不同。</span></p><p><span>短期内看着好像差不多，但是能走多长久，是靠我们的发心的，刚开始的时候，别人可能看不到我们的发心，时间长了以后啊，一定可以从行为上，反观其心，因为一个人的发心不同，思维不同，所做出来的事情必然不同，那么长久之后，一定看得出来。《大学》讲：“诚于中，形于外”，通过外面的行为所产生的结果，就会看到内心有多少诚心和诚意。</span></p><p><span><strong>“判然如黑白之相反。”</strong>行为上差不多，但是心念不同，存心不同，如黑白一样，最后结果反差就是如此之大。其实我们很多做事情，做企业啊，刚开始很多人的发心都挺好的，都是为了让客户赚到更多的钱，都是为了让员工变得更好，但是做着做着初心没有了，最开始的发心找不到了，迷失了，所以最后的结果可能不理想。</span></p><p><span>我们经常讲，保持初心很重要，不忘初心，方得终始，刚开始的存心处，或许都是好的，但是长此以往，想保持自己内心的清静，并不容易，所以也就更加显得难能可贵了。</span></p><p><span><strong>“故曰：‘君子所以异于人者，以其存心也。’”</strong>异就是不同，之所以和别人不同，是因为存心不同。“君子所存之心，都是爱人和敬人之心。”他心里想的，都是如何爱护别人，如何爱惜别人，如何敬重他人呢。</span></p><p><span>当我们是这样的存心的时候，行为所表现出来的，自然就会不同。我们去爱员工，去爱身边的人，去敬客户，去敬每一个环节的工作人员，去爱身边的每一个朋友，去敬畏身边所出现的每一个人。</span></p><p><span>想象一下，当我们是这样的存心的时候，这个人自然就是平和的，所散发出来的磁场，自然就是慈爱的，别人也就自然愿意和我们打交道，自然也愿意和我们交往，也愿意和我们一起做事情，那个事情的结果，是不是会变得不同。</span></p><p><span><strong>“盖人有亲疏贵贱，有智愚贤不肖，万品不齐，”</strong>盖，是一个助词，人都有亲疏贵贱之分，同时有的人是有智慧的，有的人是愚笨的，有的人是贤德的，有的人是不肖的，这里不肖就是不入流的意思，告诉我们人人本来就不同。</span></p><p><span><strong>“皆吾同胞，皆吾一体，孰非当敬爱者？”</strong>虽然万品不齐，但都是我们的同胞，与我们本然一体，谁不应该是被敬爱的人呢？但是我们生活当中，很难做到这一点，都是有亲疏贵贱之分的，我们愿意去敬重那些有德行的人，愿意去敬重那些位高权重的人，愿意去敬重那些有智慧的人，愿意去敬重敬爱我们觉得亲近的人，所以说，这点不容易做到。</span></p><p><span>但是我们要明白，这个是我们修正的方向，原本可能我们什么样的人，都不敬爱，表面上说那个人，我们是敬爱他的，内心可能还在产生一些不好的行为，不好的心念。我们先养成对那些优秀的人，有智慧的人，产生爱敬之心。</span></p><p><span>我们不断地去修行，去对每一个人，都能产生爱敬之心，如果我们能爱所有的人，敬所有的人，就是圣人。因为圣人的胸怀就是如此，圣人是爱世人的，如果能去心怀天下，那已然成为圣人。所以我们要懂得，这是我们不断地修正的方向。</span></p><p><span><strong>“爱敬众人，即是爱敬圣贤；”</strong>为什么？因为圣贤本身就是爱众人的，我们爱圣贤的德行，爱圣贤的品格，爱圣贤的精神，爱圣贤的文化，那我们要明白圣贤在爱什么？他想要用这些文化，这些精神去影响世人，去影响众人，我们直接去爱众人，其实已然就是圣贤之道了。</span></p><p><span>放弃这么简单的方法，不停地去追逐圣贤，这不是舍近求远呢，那我们学习圣贤的文化，直接用它爱众人，爱世人就好了。</span></p><p><span><strong>“能通众人之志，即是通圣贤之志。”</strong>我们能去通众人的志向，通世人的志向，即是通了圣贤的志向。因为圣贤的志向，就是满足世人和众人的志向，就是在引导世人和众人，向善的向上的，向着积极阳光的，去合道的，这就是圣贤的智，所以我们直接去做这样的事情，不就是符合了圣贤之道嘛，所以说我们心里，能怀着多少人，就能去做多大的事情，能包容多少事情，就会做得有多大。</span></p><p><span>如果我们不能去包容世人，不能去包容那么多的事情，那学习圣贤的文化，终极的意义，又到底在哪里呢？所以要懂得爱每一个人，去敬每一个人，实则就是在爱敬圣贤之道，就是在爱敬圣贤本身，因为我们已然在做着，圣贤所做的事情。</span></p><p><span><strong>“何者？”</strong>我把它断开讲，什么意思呢？为什么要这样呢？刚才讲的这一段，都是在告诉我们，为什么要这个样子。</span></p><p><span><strong>“圣贤之志，本欲斯世斯人，各得其所。”</strong>圣贤的志向，本来就是这样的，他本来就想要去帮助这里的人，这个时代的人，这个时代是哪个时代啊？我们处在任何时代，不都是这个时代嘛，所以圣贤的文化，可以流传几千年，因为哪个时代都通用，通用的是圣贤之道，通用的是圣贤的仁爱之心，通用的是圣贤的爱敬之心。</span></p><p><span>所以无论我们什么时候听，都是这时啊。无论是何时，圣贤想要做的事情，都是想要众人各得其所，安居乐业，幸福美满地去生活，当我们这样去做的时候，其实就是在通圣贤之志。</span></p><p><span><strong>“吾合爱合敬，而安一世之人，即是为圣贤而安之也。”</strong>我们合爱合敬，去安一世之人，就是在为圣贤而安这一世之人，圣贤所要做的事情都是安人，所以我们经常说一个词，叫什么呢？修己安人，就是不断地去修正自己，靠自己的言行举止，去让身边的人变得更安稳。</span></p><p><span>比如说在生活当中，我们经常也会说，我要带给别人快乐，首先我们要想带给别人快乐，首先自己是轻松的，喜悦的，快乐的状态，否则如何带给别人快乐？有的人说了，我想让别人增长智慧，首先自己有智慧，懂得有智慧以后，去引导去影响身边的人，才能让他变得有智慧，所以我们为什么要学习圣贤的文化，就是在不断地修己安人，修己的力量有多大，就能安多少人，就能安多少世的人。</span></p><p><span>比如说，圣贤的文化，不光安那个时代的人，我们现在这个时代，还在受着圣贤文化的影响和熏陶，那不是在安后世之人嘛，所以我们现在不断地去修己安人，其实本身就是圣贤之志。</span></p><p><span>整个这一段话，其实都是在告诉我们，爱每一个人，敬重每一个人，其实就是爱敬圣贤本身，我们本身就是行圣贤之道，所以一点都不遥远，这个也是修行，也是我们增长自己仁德，最快，最好，最直接的方式。</span></p><p><span><strong>“何谓成人之美？玉之在石，抵掷则瓦砾，追琢则圭璋；”</strong>什么叫成人之美？玉是怎么形成的？玉是从石头里面开采出来的，雕琢出来的，玉如果和一堆石头，混在一起的时候，抵掷就是扔掉的时候，如果没有发现这块玉，把它扔掉的时候，其实它就是瓦砾嘛，就是一块石子。</span></p><p><span>追琢则圭璋，可是我们要不停地去雕琢它的时候，就可以用来做圭和璋的，圭是以前的君王所戴的配饰，一般有国家大典之时所佩戴，璋是把圭分切成对半，祭祀的时候所佩戴的，圭璋就是形容贵重，很珍贵的美玉。</span></p><p><span>这一段都在告诉我们，一块美玉也得不断地去雕琢它，才能显得贵重，如果不去雕琢，把它扔掉的时候，就是一块碎石瓦砾，我们人是不是一样的？我们每个人可能都是一个石子，不停地去雕琢的时候，才能成才。</span></p><p><span>为什么说玉不琢不成器？我们人也是需要不断地雕琢的，不断地去修正我们自己的品行，增加我们自己的仁德，让我们的行为变得合理合法合道，我们才能成为一个别人眼中，珍贵的人，别人眼中敬重的人。</span></p><p><span>《大学》讲：“如切如磋，如琢如磨”，一样的道理，我们要不停地去切磋，去修正我们身上那些大的不足，那些大的不好的行为，不好的念头，然后如琢如磨，再精雕细琢，才能成为一个贵重的物品，跟玉石一个原理，我们一定要懂得这个道理，为什么要学习圣贤的文化，为什么要每天不停地去修正自己，都是为了让自己变得更好，都是让自己变得更珍贵，更贵重，然后修己过后，才能安人。</span></p></div>"
},{
    "title": "第二十七讲《积善之方》谓成人之美",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓成人之美</strong></span></p><p><span><strong>“故凡见人行一善事，或其人志可取而资可进，皆须诱掖而成就之，”</strong>当我们看到一个人，在做一件善事的时候，或者有的人志向是可取的，有一个很美好的志向，有一个愿意帮助他人的志向，并且他是有资质的。</span></p><p><span>我们经常说一个人有潜力，说明这个人是可培养的，凡是碰到这样的人和这样的事，我们要不停地去帮助他，让他有所成就，这都是成人之美。</span></p><p><span>所以说为什么君子都是成人之美的呢？看到他人有美好的德行，我们要去赞叹他，要鼓励他，看到有的人有志向，我们要设法去帮助他，看到有的人不停地去成长，我们要去鼓励他，多去帮助他，多去带动他，多去引导他，这叫成人之美。</span></p><p><span>在一个企业当中，不也是一样的吗？任何人是不是都愿意帮助，一些积极进取，并且努力的人哪，因为这样的人，他是有内在的动力的，只要稍加一帮助，他就可以让自己变得更好，就可以把事情做得更好，这些都是成人之美。</span></p><p><span><strong>“或为之奖借，或为之维持，或为白其诬而分其谤，务使之成立而后已。”</strong>或者你去赞美和激励他，叫奖借，或为之维持，就是你设法去护持和帮助他，他就像一个正在茁壮成长的禾苗，我们要懂得去呵护他，去护持他，让他长得更好，或者当他受到了不好的事情的影响，这叫诬。</span></p><p><span>当受到一些不好的事情影响的时候，我们要去帮助他变白，要去呵护他，去爱护他，而分其谤，我们去帮他分担毁谤之词，帮助他分担被人毁谤的那些行为，我们一定要帮助他立于社会，有所成就，这叫成立。</span></p><p><span>我们在任何团队当中，也是一样的，碰到这样的人，碰到这样的事情，我们要多去帮助他，多去爱护他，多去提拔他，多去提高他，一定让他有所成就，成为一个有作为的人，一定让他在这个地方立得住，我们所做的这些事情，都是在成人之美，看到那些向上的积极的事情，包括向上的人，积极的人，良善的人，阳光的人，我们都要去帮助他去做事情，让他变得更好，让他能立得住，这都是成人之美。</span></p><p><span><strong>“大抵人各恶其非类，”</strong>大概人都不喜欢和自己不同的人，所以叫恶其非类。我们人是不是往往都喜欢和自己一样的人，如果自己是个不努力的人，你会发现别人努力，我是不太高兴的。很多团队当中，经常出现这种情况，我不努力的时候，他努力工作，我得想办法让他不要努力，早点下班，下班咱俩出去吃饭，出去喝酒多好，你做那么多事情干嘛？</span></p><p><span>同样你要是一个积极努力的人，你也不喜欢不努力的人，你看那个人做事情，他做事情一点都不努力，一点都不为这个团队着想，这个人一点都不善良，所以人都是恶其非类的。</span></p><p><span><strong>“乡人之善者少，不善者多。善人在俗，亦难自立。”</strong>一个乡里的人，通常都是善者少，不善者多的，包括我们现在讲，任何一个环境，任何一个团队都一样，都是不善者居多，善者居少的，所以说善人在俗世当中，是很难自立的。生活当中，是不是这样的？尤其是现在这个社会，可能你是清静的，是自在的，是善良的，反而在你的周围，是很难生存的。</span></p><p><span><strong>“且豪杰铮铮，不慎修形迹，多易指摘，”</strong>并且豪杰通常都是刚正不阿的，所以豪杰铮铮，不慎修形迹，不太注意自己的行为，不太注意自己的言语，我们看电视也经常会讲，就不能说点屈服的话吗？你就不能说点对他恭维的话吗？能不能看到这个事情，你不要讲，不要去这样做了？</span></p><p><span>但是豪杰不是这样的，他正就是正，偏就是偏，当我看到一些事情，我是不可能不讲的，所以你看历史上的人物，都是这样的，都是刚正不阿的状态，都是非常是非分明的，所以这样的人多易指摘，很容易受到别人的指责和诬陷。</span></p><p><span><strong>“故善事常易败，而善人常得谤。”</strong>所以说善事经常都是容易失败的，不容易做成，并且善人是很容易得到他人毁谤的，很容易得到他人迫害的，我们看电视，看历史的时候，有很多忠臣，最后不都是被迫害的吗？因为忠臣做事情就是这样的，豪杰铮铮，刚正不阿，不修自己的言行，最后可能难得善终，因为受到了太多人地迫害所导致的。</span></p><p><span><strong>“惟仁人长者，匡直而辅翼之，其功德最宏。”</strong>匡直就是匡正而辅助，如果有仁德的长者，这样的人去做事情，功德是最广大的，很多团队当中，其实有这样的人，有这样的仁人长者。很多努力的孩子在做事情，他们都是很仁慈的，都怎么讲啊，通常说，你们不好好努力做事情，人家努力，你们还不让，你们到底想干什么呢？你们不去帮忙罢了，怎么还能起反作用呢？</span></p><p><span>所以我们再去看历史，很多朝代都有这样的人，都有那些忠臣，都会有一些年长的人，或者位高权重的，比如说宰相或者某一位亲王，这个人如果是仁人长者，他明里暗里，都会去帮那些忠义之士，说这样的人功德是最大的，所以这个都是成人之美。</span></p><p><span><strong>“何谓劝人为善？生为人类，孰无良心？”</strong>生而为人，怎么会没有良心？谁都有，但是为什么没有了，是迷失掉了。</span></p><p><span><strong>“世路役役，最易没溺。”</strong>世上的事情太多了，我们每天都是劳苦不息的，每天都是奔波不休的，每天都是争名夺利的，所以说把良心迷失了，泯灭了。</span></p><p><span>《西游记》里面有一段话：“争名夺利几时休，早起迟眠不自由，骑着骡驴思骏马，官至宰相望王侯”，就是形容人们每天都活在争名夺利当中，有了骡驴还得要骏马，官至宰相，还得做王侯，永不满足，不停地争名夺利，把我们原本的良心，良善的东西，沉沦了，泯灭了。</span></p><p><span><strong>“凡与人相处，当方便提撕，开其迷惑，”</strong>我们只要是与人相处的时候，一定要懂得多去，提示提醒他人，开其迷惑，不要让他人沉浸，在这些烦恼当中，沉浸在这些困惑当中。为什么所有做文化传承的人，自古圣贤都在去做救人慧命的事情，化人心智的事情，都是因为要开其迷惑。</span></p><p><span><strong>“譬犹长夜大梦，而令之一觉；譬犹久陷烦恼，而拔之清凉，”</strong>好像一个长夜的大梦一样，令人觉醒；就好像是久陷烦恼之中，而我们给对方一丝清凉，自古以来都有当头棒喝，就是让人瞬间觉醒了，突然觉到清凉了，觉得清静了，都是在开其迷惑，都是在打开人的心智，所以这个是文化的力量。</span></p><p><span><strong>“为惠最溥。”</strong>溥是广大之意，所以去做这样的事情，才是最广大的，最广博的。所以儒释道的文化，都在告诉我们这个道理，大学之道，在明明德，在亲民，在止于至善，都是在让你不停地去帮助他人，并且要帮助的是，让对方觉醒的事情，自觉觉他，觉行圆满，而不光是给他人带来一些财务上的，可看得见的利益，而更重要的是让对方觉醒，是在不停地救人慧命，是在不停地教化众生，这个才是最广大的利益。</span></p><p><span><strong>“韩愈云：”</strong>韩愈是唐朝人，是唐宋八大家之首，既是文学家，诗人，又是一位做过官从过政的人，他当时提出文道合一，文化和道要合到一起的，韩愈有很多的名句，都是我们熟知能详的。</span></p><p><span>比如《师说》：<strong>“师者，传道授业解惑也”，“世有伯乐，然后有千里马，千里马常有，而伯乐不常有”，</strong>出自于《马说》，都是韩愈所讲的。</span></p><p><span><strong>“一时劝人以口，百世劝人以书。”</strong>所以要想劝人向善一时，可以用说的，百世是要用书的，这里的书不就是文化的传承嘛，包括我们现在学《了凡四训》，那是四百多年前的书，还在劝化着我们。</span></p><p><span>我们现在学习儒家的文化，两千五百多年了，还在劝化着我们，乃至我们学《诸子百家》，学《周易》，学《山海经》都一样，五千年的文化，还在劝化着我们，所以更大的劝人为善的事情，是留下文化，留下著作，所以一时劝人以口，只能起一时的作用，但是要想百世劝人，是要留下书籍，留下文化的传承的，要去救人慧命的。</span></p><p><span><strong>“较之与人为善，虽有形迹，然对证发药，时有奇效，不可废也。”</strong>百世劝人以书，相比于与人为善，虽有形迹，是有迹可循的，是表现出来的。你主动的劝人向善，不是表现出来的吗？与人为善是什么？别人遇到困难了，你毫无痕迹地去帮忙，而劝人向善，是在事情未发生之前，你就在不停地劝化他人了，虽有形迹，但是对症发药，时有奇效，因为你看到了世人的症结所在，看到了世人的困惑所在，所以时有奇效，会经常看到很多神奇的效果。</span></p><p><span>其实圣贤的文化，不都在做着这样的事情吗，事情在未发生之前，如果你不停地去学习圣贤的文化，就少犯过错，所以说不可废也，这样的事情，不能不用，不可不用，不可荒废。</span></p><p><span><strong>“失言失人，当反吾智。”</strong>如果失言失人了，我们要自我反省，还是我们自己的智慧不够。在生活当中，经常有这样的事情发生，我们是在劝人向善的，但是言辞过激，或者说的不得当，是不是失言失人哪，让对方反而不接受了，当这种情况发生的时候，我们要自己反思，是不是我们自己的能量，磁场，语气，态度，智慧还不足所导致的呢。</span></p></div>"
},{
    "title": "第二十八讲《积善之方》谓救人危急",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓救人危急</strong></span></p><p><span><strong>“何谓救人危急？患难颠沛，人所时有。”</strong>关键词一个叫危叫急，危就是危难之时，有危险的时候，急是突然所发生的事情，所以我们要懂得救人危和急。颠沛，就是遇到困顿，遇到困难，不稳定的时候。人所时有，我们每个人在生命当中，都会发生这样的事情。</span></p><p><span><strong>“偶一遇之，当如痌瘝之在身，速为解救。”</strong>痌瘝，是创伤和疾病的意思，当我们遇到别人有急，或者有难的时候，有困境的时候，怎样去思考？就如同自己有创伤和疾病在身，速为解救。我们在什么状态下，是最着急去自救的，身上有伤或者有疾病的时候，一定是很着急去解决的，当遇到有他人有困难之时，危机之时也是一样的道理，就好像自己有伤，有疾病一样去速为解救。</span></p><p><span>圣贤看到的是什么，是看到我们的精神贫瘠，是看到我们的慧命受了影响，为什么那么多圣贤，有那么大的慈悲心，那么大的仁爱之心，是看到我们从精神层面，是有疾患的，所以才不停地去传播圣贤的文化，不停地给我们讲天地运行的规律，来教导我们，让我们去觉醒，所以只是看到的地方不一样，我们人之肉眼，只能看到身体的创伤，而圣贤是看到了，我们精神上的创伤和困急。</span></p><p><span><strong>“或以一言伸其屈抑，或以多方济其颠连。”</strong>或者用语言去帮助别人，伸张委屈和压抑，当别人受到了委屈，受到了侮辱的时候，这个也是对方的危急之时，我们要去帮助去伸张，让他少受委屈，或者想很多的方法去帮助，当别人碰到了很多问题，困惑的时候，我们要想方设法地去帮助，去救济，这都是救人于危急。不仅是我们能看到的危急，还有比如说别人遇到困惑了，这是救人慧命，比如说别人有恐惧，有恐慌，我们去帮助去疏导，或者去讲很多话语，设法让他去觉醒，这都是在救人慧命的。</span></p><p><span><strong>“崔子曰：惠不在大，赴人之急可也。”</strong>崔子，明代人，当时做到了礼部侍郎，他讲了这样一段话，恩惠不在大小，赴人之急可也，主要是救人于急和难之中，所以我们为什么经常讲：“良言一句暖三冬”，当别人遇到困难的时候，遇到困惑的时候，正在悲伤的时候，可能我们的善心善言，就可以让对方感受到温暖，所以恩惠不在大小的，看能不能救人于急和难之中。</span></p><p><span>比如说生活当中，也是一样的，有很多朋友，经常遇到了一些突发事故，这个时候，他可能需要别人的关心，需要别人的引导，甚至说物质上需要别人的帮助，所以我们自古以来，都讲救急不救贫，当别人遇到难，说明他被当下的事情难住了，这个都是危急之时，所以我们伸手去救一下，虽然可能这个行为或许很小，但是救人之急，我们的功德和善行却很大。</span></p><p><span><strong>“盖仁人之言哉。”</strong>这句话实在是人人所讲的话，这句话也实在是具有仁德的，其实我们忆往昔，回忆自己的生活和整个人生的状态，工作当中所经历的事情，我们能记住的人，是不是都是那些救我们于危急之中的人，突然发生了一个什么事情，陷到了一个什么债务当中，可能我们记起来都是最难的时候，帮助过我们的人，说我曾经工作上，遇到过什么样的困惑，在我最艰难的时候，出现了什么样的人，来帮助我们。</span></p><p><span>通常我们记住的都是在最困难，最危急的时候，来帮助我们的人雪中送炭。如果是锦上添花的，记忆就没有那么深刻了，所以说我们要懂得救人危急。</span></p><p><span><strong>“何谓兴建大力？小而一乡之内，大而一邑之中，凡有利益，最宜兴建，”</strong>这里的大利指的是什么？是利益大众的事情，利益更多人的事情叫大利，小在一乡之内，大在这里的邑，指的是邑县县城，只要是有利益大众，利益他人的事情，我们都要去做，都要去建设。</span></p><p><span><strong>“或开渠导水，或筑堤防患；或修桥梁，以便行旅；”</strong>或者去开渠导水，帮助人家灌溉农田，或者是筑堤防患，就是预防水患的，兴建水利工程，或者去修桥铺路，以方便他人从这里经过，路过，这个是相对来讲比较大的事情了。</span></p><p><span>还有比较小的事情，比如说“或施茶饭，以济饥渴。”或者给一些吃不上饭的人，去施一些水，施一些粮食，帮助他们度过饥渴，现在这样的事情越来越少，但是在明朝以前更多，因为那个时候，每遇灾年荒年的时候，会有很多平民是吃不上饭的，那个时候做这样的事情，是非常大的功德，因为他是一个非常大众的群体，所以是一个利益大众的事情。</span></p><p><span>到了我们现在，可能这样的事情就变小了，因为吃不上饭的人越来越少，但是依然有或者吃的不好的，生活不富足的，其实我们都去可以做一些布施的，让他们的生活变得更好，这都是利益大众的事情。</span></p><p><span><strong>“随缘劝导，协力兴修，”</strong>随着机缘去劝导众人，这个词非常好，劝导是什么意思呢？就是我们不光自己去帮助他人，做以上所说的这个事情，我们还劝化别人，和我们一起去做这样的事情，协力兴修，有的人说，我没有那么大的能量，我也没有那么大的能力去修桥铺路，但是我们可以去协助啊。</span></p><p><span>哪怕说我捐了很小的一部分钱，这也是协助，我出了一部分利，这个也是协助，所以我们自己要有更大的能量，我们就去做这样的事情，如果我们能量没有那么大，我们可以协助他人，去做这样的事情啊。</span></p><p><span><strong>“勿必嫌疑，勿辞劳怨。\"</strong>只要我们在做善事，做善行的时候，一定会有流言蜚语的，一定会有嫌隙产生的，一定是有人不理解，甚至冷嘲热讽的，这样的情况时有发生，告诉我们，不要害怕这些嫌疑和流言蜚语。</span></p><p><span>到了我们这个时代，其实也是一样，只要我们是在做利益他人的事情，一定会有人诋毁，攻击和误解的，勿辞劳怨，不要抱怨，不要觉得自己劳累，因为我们自己本身做的这件事情，就是利益大众的，我们的行为，我们的善心，既然是想利益大众的，就不要怕累，不要埋怨，不要担心别人的误解。</span></p><p><span>之前咱们也讲过，积阴德，天报之，我们去做了很多事情，积了很多阴德，虽然有人误解我们，可能很多事情也没人知道，但是天会回报给我们的，如果我们无辜的担了一些恶名，天会降福给我们的。</span></p><p><span>所以我们纵观历史，大家去看哪一个圣贤，哪一个有成就的人，曾经不被人冤枉，曾经不是担负了很多的恶名，但是往往越担负这些恶名，越承担了很多无辜，所发生在自身的事情，反而会有成就，其实这个都是天报之的。</span></p><p><span>儒家文化也一样，有一个词叫忍辱负重，辱不就是别人的误解吗，别人的不理解，自己的不如意吗？我们承受这些，还能负重去前行，我们会发现天会报给我们更大的福德，更大的智慧的。</span></p><p><span>哪有一个人是不经过忍辱的过程，能拥有智慧的，所以经历这样的过程，不光是天报福给我们，自己在这个过程当中，也是不断地扩大自己的心量，增长自己的智慧，所以碰到这样的事情，不要害怕，要勇敢地前行。</span></p></div>"
},{
    "title": "第二十九讲《积善之方》谓舍财作福",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓舍财作福 </strong></span></p><p><span><strong>“何谓舍财作福？释门万行，以布施为先。所谓布施者，只是舍之一字耳。达者内舍六根， 外舍六尘，一切所有，无不舍者。”</strong>把财舍出去，我们的福报就得来了。我们有更大的福报，才有可能获取更多的财富。有千万种行善的方法，是以布施为先的，什么叫布施呢？</span></p><p><span>其实就是一个字就是舍。达者，这里指智慧通达的人，觉醒的人，觉悟的人。达者是内舍六根的，也就是我们经常讲到的眼，耳，鼻，舌，身，意六根，六根是对应着六尘，六尘就是色，声，香，味，触，法。</span></p><p><span>一个是不入，一个是无，无是什么？不是没有，而是不入，那么内舍六根是何意呢？就是我们看到了不喜欢的事情，不起情绪，我们听到了那些不喜欢的话，不起情绪，我们看到了不喜欢的东西，不起分别。不喜欢的东西，不喜欢听的话，本身就是已经在分别了，舍是什么，不是没有，而是不起分别，当我们不起分别的时候就不入，不入就不会产生情绪。</span></p><p><span>每天我们的痛苦从哪里来？无非是他说的话我不爱听，他做的事情我不喜欢，他所说的话，不是按照我的想法，他做的事情，不是按照我的标准，我们所有的东西都是在取相。比如说眼睛看到的是在取相，耳朵听到的是在取相，感受到的是在取相，所以这些都是在取相。</span></p><p><span>只要把这些相取回来了，就会产生痛苦，其实这些都是因为不舍，但是我们修不到这个层次的时候，我们不理解。其实真正的布施是在修什么？就是修一个舍字，把我们自己的那些东西，全部舍掉。比如说，舍掉我们的情绪，舍掉我们的喜好，舍掉我们的分别，舍掉我们的贪着，比如说我们贪色，色是指好看的东西，我们贪财，贪食物的美味，我们贪别人赞美的享受，这些都是贪。</span></p><p><span>一个舍字，修得越好，内心是没有痛苦的，因为我们不起分别，这个是六根和六尘的作用，如果我们的六根，眼耳鼻舌身意不起分别，对于外面的六尘 ，色声香味触法，也自然能安然处之。</span></p><p><span>比如说我们看山就是山，不会因为这个山，达不到我们的满意而抱怨，说我们喝水，水就是水，不会因为水的味道，不是我想要的而产生痛苦，我们穿衣服，衣服就是衣服，有哪件就穿哪件，不会因为我们的喜好，或者它的款式，而产生分别和痛苦，所以说到根源，其实这些分别，都是因为舍不掉我们自己的眼耳鼻舌身意，所带来的那些感受。</span></p><p><span>当懂得把这些东西舍掉的时候，会发现一切所有，无不舍者。内在的这些六根，已经不复存在，已经不起分别，已经不入色生香味触法，这个时候用什么，又有什么区别呢？这时就不产生痛苦了，外面的东西自然就舍掉了，为什么我们有那么多的贪着呢？</span></p><p><span>其实都是满足自己的六根的，吃的好吃，满足的是口腹之欲，喜欢好看的东西，满足的是我们的眼睛，喜欢听好话，满足的是我们的耳朵，但是归根结底，满足的都是我们的意识，那个意识心，所以当对这些东西，没有分别的时候，自然就没有痛苦，也就没有什么不舍的东西，所以这个是终极的。但是绝大多数人，一定是修不到的，修不到怎么办？还是讲次第的。</span></p><p><span><strong>“苟非能然，先从财上布施。”</strong>如果做不到怎么办呢，先去做财布施。布施分为财布施，法布施和无畏布施，法布施是教给人正法，让人觉醒的，这是往大了讲，往小了讲，法布施也很简单，比如说在生活当中，我们会的东西，诚心诚意地教给别人，就是法布施。</span></p><p><span>举例子，我们做饭做得很好，当别人想学的时候，我们把做饭的好的方法，教给对方，让他也学会做饭，这就是法布施。在工作岗位上也一样，我们某一项技能特别好，诚心诚意地教给别人，让他人也会了，就是法布施。</span></p><p><span>我们平时可以去做法布施的事情，因为法布施是得法的，第一层的意思得法是什么呢？我们不断地教给别人的时候，天会回馈给我们的，天道是循环的；第二层意思是什么？我们如果能把别人都教会，是不是我们自己肯定是更会的，所以我们经常讲，我们能把别人教懂，才是真得懂，如果只有自己懂，别人没有学会，说明不是真得懂，因为无法教人，传道授业解惑，才能做一个师做的事情，当我们做了师能做的事情，这个时候才是真的会。</span></p><p><span>所以我们不断地去教给更多人的时候，最会的一定是我们自己，大家一定要懂得去分享，己有能勿私藏，不要说我会点东西，我自己就藏着不放，不行的，这样的话也无法成长，无法给自己积累福德，这是法布施。</span></p><p><span>无畏布施是什么？当别人遇到恐惧畏惧，害怕，都是属于畏惧，通过我们学的法，去让对方减少这种恐惧，担心和忧虑，这个就是无畏布施。所以我们回到财布施，先从财上去布施，为什么在生活当中，可能我们教给别人方法，没有那么难，但是把自己的财富舍出去给他人，是不是就相对来讲，难一点了。</span></p><p><span><strong>“世人以衣食为命，故财为最重。吾从而舍之，”</strong>世人都是以衣食为命的，我们要穿衣吃饭，是不是都是需要用钱财的，都需要花钱去买的，故财为最重。财富在我们绝大多数人的心中，是最重要的。吾从而舍之，我们从这里开始修舍，当我们不在意那么多的财富了，对衣食没有那么高的要求了，说明什么我们的欲望在不断得减少，然后我们才能内舍六根，否则是做不到的。</span></p><p><span>我们听到这段话，会觉得我根本做不到内舍六根，怎么办？不着急，先从财上适当地去布施，慢慢地去修行，舍是什么，就是不要了，我的东西不要了叫舍，没有欲望叫舍，有欲望叫取，所以在取舍之间，我们要懂得修舍，因为舍得越多，实则最后得到的会越多。经常做布施的人，经常帮助别人的人，当我们遇到事情的时候，一定有更多人来帮助我们。只不过我们想的都是先取后舍，而修行之道，圣贤告诉给我们的是，先舍后取，为什么要去修舍？</span></p><p><span><strong>“内以破吾之悭，外以济人之急。”</strong>对内破自己的悭，悭是悭吝，就是吝啬小气的意思，所以我们不断地去修布施，修舍，让自己变得越来越大气，不再那么吝啬，外在又能济人之急，能帮助别人，救别人于急难之中，所以无论是对内对外都有好处的，吝是什么呢？就是我们自己本有的，不舍啊，不给啊。比如说我们会点东西，不舍得教给他人，我们知道了一个好玩的东西，知道一个好的秘密，甚至不舍得分享给他人，这都是吝。</span></p><p><span>吝让我们的格局变得很小，让我们的心量，变得很小，一个人如果是贪的是吝的，即使是简单的做一个事情，也很难做好的，没人跟我们交朋友，我们会的东西遮遮盖盖的，不愿意教给他人，难道他人感受不到吗？其实感受得清清楚楚，这样的人做事情很难做大的，用现在的话说，这个人做事情不够大气，没有格局，心量太狭隘，所以没人愿意去跟这样的人做事情的。</span></p><p><span>所以我们舍，看似有所失，实则是有所得的，是让自己的内在变宽阔，并且可以去救助他人，于急难之中，从明处来说，别人会回馈帮助我们，从暗处来说，天道会回馈给我们，天道损有余而补不足，我们经常去付出的时候，经常去舍的时候，天道循环的规律，又回馈到我们自己身上来了。</span></p><p><span><strong>“始而勉强，终则泰然，”</strong>我们开始做的时候，一定是勉强的，到最后一定是泰然的，就是自然的，舒适的安逸的状态。我们刚开始想去做一些布施，肯定是勉强的，不舍，但是舍着舍着，开始变得很泰然自若了，就像我们教别人，法布施也一样，刚开始我们会点东西教给别人，没办法，是老板让我教，领导让我教，他天天问我，我不得不教，是不是勉强的这种状态，教着教着，不停地舍，内在的心量，就在不停得放大，到后面的时候，是安然自得的状态，甚至愿意主动去教给别人，所以这是一个过程。</span></p><p><span><strong>“最可以荡涤私情，祛除执吝。”</strong>我们这样去做的时候，不停地去布施的时候，最能清洗我们的内心，祛除我们的私欲和杂念的，破除我们的执念和我执，还有吝啬，吝是对内的不舍，内在的这种小气，执是什么？我们拼命地向外获取的时候，就是我执，就是执着的。</span></p><p><span>比如说别人说句不好听的话，我痛苦了，他说的话，我不喜欢听，他做的事情，我不喜欢，今天他做的吃的，我不喜欢，他做事情，我不满意。都是执着，都是执着在我里面，很多人经常说，怎么做到无我，怎么去破我执？</span></p><p><span>如果我们连布施最基础的都不能去修，怎么能做到无我，怎么能做到不贪着，不索取，所以都是从布施开始修的，这一段的主题告诉我们，何谓舍财作福，财看似舍出去了，但是我们得到的其实是福德。</span></p><p><span>圣贤做的事情，是不是都是忍辱负重的？咱们之前讲过，世人做事情，碰到不满的事情，他是刚正不阿的，是豪杰铮铮的，是不被权势所屈服的，一定要仗义执言的，哪怕这个官我不做。可是圣贤做事情，又上了一个境界，受屈辱没关系，但是我会依然留在这里，为什么？我要为民请命，圣人是无常心，以百姓心为心的，他不再想自己是不是受到了屈辱。</span></p><p><span>当觉得自己有委屈，要仗义执言，还是在我执当中的，舍得不干净，但是这样的人，已经到了一定的境界，可是如果以圣贤的境界来讲，还不够，因为还有那么多自己的感受在里面。</span></p><p><span>阳明先生不是这样的吗？他受了多少屈辱，可是他不在乎，为什么？他说致良知，致良知是什么？让我去剿匪，不会考虑这件事情的后果，做完了以后，朝廷会不会依然不用我了，他不会想这些事情，因为阳明先生认为，我们还在思考这些事情，就是没有致良知，致良知是什么呢？</span></p><p><span>我只问我的良心，这件事情该不该做？就好像有的人，舍己救人，我看到有人跳水了，致良知是什么，我马上想办法去救，不会去考虑得失，我会不会有危险，救完了别人会不会被误解，这都不是致良知的表现。</span></p><p><span>比如说，写《史记》的司马迁，他被陷入狱在想着什么？我不能死，我为什么不能死，我死了历史不是断代了吗，我必须要活着出去，我要把《史记》写完，《史记》写完了，我的命就不重要了，他考虑的都是如何对更多的人有益，不在意自己的屈辱，舍得才干净，所以为什么圣贤之辈，越是不在意别人的误解。</span></p><p><span>孔夫子也在讲：“邦有道则仕，邦无道则隐”，有人会说国家需要我们的时候，我们走了，但是他提倡以道侍君的，就是让我去服侍君主，可以的，但是我必须要以道侍君，如果不合道我是不会做的，隐藏起来做文化的传承，不在意别人的误解，不在意他人说我不作为，但是我要保存我的身体和生命，不是为己，而是要把文化传承下去。后世一定会出现有识之士，把这些文化重新捡起来，去兴建大利，利益后面的人们。</span></p><p><span>哪一个圣贤不是受了很多的忍辱的，包括孔子那个时代，周游列国十四年，受过多少的屈辱，和别人的排挤，非议，甚至很多次生命垂危，可是他不会意气用事的，为什么呢，他考虑的是后世的众生，如果意气用事了，自己的生命没有价值，如何兴建大利呢？</span></p><p><span>所以这个舍字是非常重要的，如果不修舍，破除不了自己的我执和内在的贪吝，破不掉的话，境界又怎么能上得去，更不要谈无我了，那个境界太远了，所以都是从布施开始修，从舍开始断的。</span></p></div>"
},{
    "title": "第三十讲《积善之方》谓护持正法",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓护持正法</strong></span></p><p><span><strong>“何谓护持正法？法者，万世生灵之眼目也。”</strong>什么叫正法？导人向善的法，正能量的法，能帮助他人的法，我们都称之为正法。法，是万世生灵的眼目，我们的眼目是用来看方向的，法就是给众生导航，指引方向的。</span></p><p><span>我们现在每天学习的圣贤文化，我们在讲的《了凡四训》都是我们的眼目，都是告诉我们什么事情是该做的，什么事情是不该做的，这不都是我们的眼目吗？同时不仅是我们的眼目，也是真理的行为准则，告诉我们依理依法行事，所以这是法的重要性。</span></p><p><span>“<strong>不有正法，何以参赞天地？”</strong>如果没有了正法，何以参赞天地呢？参赞是依据天地的变化，我们去创造，比如说孔子在《易传》写到，参赞天地之育化，这些圣贤的文化，都在干什么呢？都在告诉我们道和法，就是天地运行的规律，当我们懂得天地运行的规律，我们会在这个规律和变化之内，去创造其他的万物，这个叫参赞。</span></p><p><span>《道德经》讲：“天大，地大，道大，王亦大”，有四大。道就是指的道运行的规律，同时天也大地也大，王亦大，王指的就是人，说人和天地还有道，是一样大的，为什么一样大，因为人可以在天地变化的规律当中，去创造万物。</span></p><p><span>举个简单的例子，比如说我们现在吹的空调，就是参赞。夏季，我们为什么要开始吹空调，天热，是不是天地运行的规律，到这个季节热了，就创造出来了空调，我们的房子不是这样的吗，因为天地会刮风会下雨啊，创造出来的房子不是遮风避雨的吗？</span></p><p><span>为什么说王亦大？创造出来的这些法，是人创造出来的吧，人创造出来的这些法，就是随着天地的变化规律，而让万物生存的东西，生存的事物，这叫参赞天地。刚才讲的房子也好，我们所用的空调也好，其实这些都是道，都是法。</span></p><p><span><strong>“道日用而民不知”，</strong>道，还有法，其实我们每天都在用，而民不知，只是我们自己不知道，我们用的其实就是道，用的其实就是法，但是这些法都是谁创造出来的，都是人，都是圣贤所创造出来的，所以我们要护持正法的。</span></p><p><span>今天我们学儒释道的文化，乃至于诸子百家，这些圣贤所讲的正法，都是让我们了解天地万物运行的规律，我们了解了天地万物运行的规律，从中才能得以生存。为什么要导人向善呢，为什么要告诉人们觉悟之法，因为天道运行的规律，就是这样的。我们越善，得的福德就越多，我们的贪着越少，舍得越多，就越接近于圣贤，越能懂得天地之道。</span></p><p><span>天地何曾贪着，日月变照古今，不分善恶，故日月长明，天地日月，是不是都在度化着众生，都在滋养着众生，而自己从来不曾索取，这都是法的重要性，这些法都是我们万物生灵的眼目，都是给我们指引方向的，这就是我们学习圣贤文化的重要性。</span></p><p><span><strong>“何以裁成万物？”</strong>裁，裁剪的裁，做一件衣服，是不是需要剪裁的，哪里是可以用的，哪里是不可以用的，如果用，要怎么用，法是用来做什么，参赞天地，我们得知道天地运行的规律。这时裁是什么，是不是找到一个合适的度，就是法， 找到一个合适的度，去配合天地运行的规律，所以叫裁成万物，就是造物的过程，让万物生长的过程。</span></p><p><span>我们种庄稼，是不是要随顺着天地的变化呀，什么季节该种，什么时候该浇水，什么时候该收割，一样的。如果不知道天地运行的规律，又如何去耕种。到今天很多事情已经变得，顺理成章了，比如说空调，房子。种地什么季节该种，什么季节该收，是不是以前我们的先祖们创造出来的，以前人们是不知道的。</span></p><p><span>从舜帝的时候开始，到禹帝，大禹治水，黄河泛滥，水是无法治理的，水是人们的隐患，经常夺去人们的生命和粮食，先贤们是不是不断地在探寻，天地万物变化的规律，然后治水，发展农业，发展工业，所以圣贤们已经创造出来了，已经裁成万物了，我们现在是坐享其成的。</span></p><p><span>这是从我们能看到东西的角度来讲，还有一个层面，就是我们精神层面的，我们的智慧层面的，天道无形的那些运转规律，圣贤文化都有讲，所以按照圣贤所讲的那些规律做事情，就更接近于圣贤。</span></p><p><span><strong>“何以脱尘离缚？何以经世出世？”</strong>如果没有这些法，我们怎么能脱离开尘世的这些束缚，我们那么多的不舍，就产生了那么多的情绪，如果没有这些正法的指引，我们要如何觉醒，如何让自己快乐和自在呢？</span></p><p><span>当我们不懂得去修持正法的时候，我们就会向外不停地贪求，我们总以为拥有的更多了，变得快乐了，变得开心了，可事实往往相反，很多东西我们追求到了，可是我们并不快乐，为什么，因为我们在取而不懂得舍，才会产生那么多的痛苦，世间的人们都告诉我们取的，而圣贤的文化，正法，却是告诉我们舍的。</span></p><p><span>《老子》讲：“正言若反”，我讲的是正确的天道运行的规律，可是人们听着，好像是反的一样，可以经世出世，经世就是经历的世事。我们这一生，要经历很多事情，要被很多事情所累，经世好理解，出世难做到，怎么才能出世，我们如何才能不被这些红尘当中的事情所累？就是我们的情绪不起，不被这些事情所束缚，谁说了一句不好听的，不会因为这句话而产生痛苦，就从这件事情当中出来了，这是小事。</span></p><p><span>我们再往大了讲，什么叫出世，所有红尘当中的这些事情，不被他所扰，这个才叫出世，也就是说我们舍得越彻底，不被这些事情，这些名利，这些贪念所累的时候，才能出世。出世要靠正法指引的，如果没有正法指引，我们无法做到出世的，我们很难觉醒，所以一定要护持正法。</span></p><p><span><strong>“故凡见圣贤庙貌、经书典籍，皆当敬重而修饬之。”</strong>凡是见到圣贤庙貌，就是庙堂，圣相，经典书籍，包括我们的文化，书本，都应该敬重，修饬就是修整整理，所有的能传正法的东西，我们都要去敬重去修整，去传承的，要去爱护爱惜的。</span></p><p><span><strong>“至于举扬正法，上报佛恩，尤当勉励。”</strong>举扬就是推举宣扬，刚才讲到让我们护着这些法，敬重这些法，进而又加深了，我们要推举的，要去宣传，要去传扬这些正法的。要上报佛恩的，而且不光是佛恩，还有这些圣贤之恩，我们怎么报这些圣贤之恩，把文化传承下去，因为圣贤的心，是以百姓心为心的，他是以生活在迷途当中的众生为心的，所以我们在保护他的法，在传承他的法，就是在上报圣贤之恩。</span></p><p><span><strong>“尤当勉励”，</strong>全力实践的时候就叫持，如何护持正法，护是保护着正法，不受伤害，持是我们全力地践行，去推举去传播，用现在的话叫做文化传播，所以我们要去做这样的事情，这个是在护持正法，是在利益大众，如果我们自己，没有那么大的能量去持，但是看别人在传正法的时候，我们要加以协助和帮助，保护他不受伤害，持就是我们自己全力地去践行，去推广，去宣传，让文化不要断代。</span></p><p><span>我们这个时代的人们，无论是精神生活，还是内在的贫瘠，都会让我们产生这么多的痛苦和烦恼，如果我们再不去护持正法，那后世子子孙孙们，更加痛苦的，所以这是护持正法的重要性。</span></p></div>"
},{
    "title": "第三十一讲《积善之方》谓敬重尊长",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓敬重尊长</strong></span></p><p><span><strong>“何谓敬重尊长？家之父兄，国之君长，与凡年高、德高、位高、识高者，皆当加意奉事。”</strong>敬重那些尊敬的人，或者我们的长辈，在家里自己的父亲和兄长，在国家来说就是我们的君主，和比我们官职更大的人，长官，以及年龄比我们大的人，我们都要去尊敬和敬重。</span></p><p><span>德行比我们高的，可能年龄没有我们大，但是人家的德行，品行比我们好，位置比我们更高的是我们的领导，认识比我们更广的，更博学的人，我们都要去尊重的。加意，就是特别的注重和用心，奉是侍奉。</span></p><p><span>比如在工作当中也是一样的，那些德高和识高的人，或者说位比我们高的人，我们尊重别人的同时，就会事奉他去做事情，事奉很简单。举个例子，看他口渴了，给他倒一杯水，是不是侍奉？看他有需要的时候，去帮一下忙，是不是侍奉？我们要敬重这些德高，位高，年高的人。</span></p><p><span>我们学习了儒家的文化，《论语》告诉我们：“主忠信，无有不如己者”，自己内在是以忠信为主的人，没有一个朋友是不如我们的，如果我们是怀着这样的思想，三人行必有我师，是不是我们该敬重每一个人，不光是我们的尊长，每一个人都是值得我们敬畏的。</span></p><p><span>所以孔子也会说：“后生可畏”，现在的年轻人，可能现在还不如我们，但是我们不知道，他的将来会怎么样啊，所以说每个人都是值得我们尊重的，因为我们是主忠信的，我们自己内在是忠和信的，我们会去敬重和尊重每一个人，这个时候格局和胸怀就在变大，仁爱之心就会变大。</span></p><p><span>所以我们经常说什么样的人是仁慈的人，这个人对谁都好，无论对方怎么样，他永远都是慈爱的，永远是包容的，这样的人叫德高望重之人，这是一点一点修起来的，我们要先从尊重每一个人开始修。</span></p><p><span><strong>“在家而奉侍父母，使深爱婉容，柔声下气，”</strong>在家的时候侍奉父母，是有很和顺的仪容的，有很和顺的态度的，并且说话是柔声的，口气是处下的，非常平顺的。我们现在很难有人做到了，所以《论语》讲：“色难”，和颜悦色很难，我们和颜悦色地对待父母，对待他人是很难的。</span></p><p><span>一个家庭氛围当中，多出现的一个词，叫疾言厉色，都是很急躁的，气冲冲的样子，所以这里告诉我们，要懂得柔声下气地对待父母，再延伸的话，就是对待每一个人。</span></p><p><span><strong>“习以成性，便是和气格天之本。”</strong>习以成性，就是当我们养成习惯以后，变成了我们新的品性，这个时候便是和气格天之本。格天是感动的意思，我们内在，如果是尊重每一个人的，是和颜悦色的，是柔声下气的，这是感动上天的根本。</span></p><p><span>所以我们去观察，是不是越有成就的人，越有修为的人，或者一些古之圣贤，他是温和的，是和颜悦色的，是不苛责的，因为这个是可以感动上天的根本，这个事情是合天道的。</span></p><p><span><strong>“出而事君，行一事，毋谓君不知而自恣也；”</strong>出而侍奉君主，也是一样的，做任何事情，不要以为君主不知道，然后开始自恣，开始不约束自己的行为，开始放纵自己的行为了。</span></p><p><span>我们现在是不是同样适用？比如说在企业当中，事情好像是做给老板看的，做给领导看的，如果领导看不到的情况下，就开始放纵自己的行为了，就开始以为人不知道了。整个这段话，都在告诉我们敬重尊长，为什么在君主看不到的地方，我们也要约束自己的行为呢？</span></p><p><span>第一体现的是对君主的敬重，第二何尝不是对自己的敬重呢，我们是敬畏敬重自己所做的事情，其实与他人无关，刚才我们在讲主忠信，内在是以忠信为主的人，我们忠于君的同时，其实是忠于己，我们敬重他人的同时，其实在敬重自己，因为那个是我们的行为习惯和习气。</span></p><p><span>所以一个善良的人，对自己善良，对他人也善良，一个抱怨的人，他不只是抱怨他人，他也抱怨自己，动不动就生气，动不动就自我愤怒，因为那是他的习性和习气，所以我们要不断修的，其实看似是对别人的敬重，是对别人的忠心，实则也是内修的过程，是让自己养成新的习惯和新的品性。</span></p><p><span><strong>“刑一人，毋谓君不知而作威也。”</strong>刑是审判，审判一个人的时候，不要以为君主不知道，就开始作威作福，就是滥用私权了。再延伸一下，比如说现在做事情也是一样的，当我们去处罚或者去做一件事情的时候，不要以为别人不知道，就开始作威作福，甚至假传一些意思，这样都是不好的，都是在滥用私权的行为，这个都是不懂得敬重上位，才做出来的事情。</span></p><p><span><strong>“事君如天，古人格论，此等处最关阴德”，</strong>所以说事君是如天的，格论就是观点和道理，古人的观点和道理，就是这样的，这些事情更关乎，一个人的阴德，整个《了凡四训》，经常讲要积阴德，因为积阴德，天道会回馈给我们的，以前古人为什么都讲忠信，因为讲事君就是事天，事天就是在积累阴德，如果不事天，是给自己积累不了德行的。</span></p><p><span>一般古之圣贤，什么时候才会起义，才会赞同造反的事情发生，就是君主所做的事情不合天道了，不为民请命了，开始施暴政了，这个时候他是为天道的，就会众起而反之。</span></p><p><span>但是告诉我们，君就是代表的天，我们现在做事情也是一样的，更多的是敬重自己，对自己是忠信的，对事情就是忠信的，我们对他人就是敬重的，其实都是在不断地修自己内在的德行。</span></p><p><span><strong>“试看忠孝之家，子孙未有不绵远，而昌盛者，切须慎之。”</strong>我们尝试着去看那些忠孝之家，他的子孙都是久远而昌盛的。绵远，就是久远之一。所以说一定要谨慎，引以为戒，我们按照这些忠信之义去做事情，按照忠信之德去做事情。</span></p><p><span>我们再延伸一下，忠信之家，有的时候人们会说不对，有很多忠义之士，不是受到了冤枉，受到了迫害了吗？他也不一定都长生。</span></p><p><span>其一，我们看到的只是一部分，不代表全部，因为这些我们耳熟能详的事情，无非是通过电视或者某一个比较有名的历史阶段，但是不代表全貌，还有更多的忠义之士，只是我们了解的不够多。</span></p><p><span>其二，比如说了凡先生，甚至其他很多历史故事的忠义之士，为什么我们现在还在宣扬他的精神？死而不亡者寿，他当时好像是受到了迫害，可是因为那些事情，他也有了更多的德行，也得到了更多的忠义之名，我们后世还在赞扬这些人。</span></p><p><span>我们后世的每一个人，都是在尊敬人家，还在学习古之圣贤的文化，所以流传的岂不是更久远吗？当我们懂得把时间概念拉长的时候，我们看的不是他当下的得失，而是后世所留的那些名望，和他留下来的那些精神，这些才是值得我们学习的。</span></p></div>"
},{
    "title": "第三十二讲《积善之方》谓爱惜物命",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>积善之方篇--谓爱惜物命</strong></span></p><p><span><strong>“何谓爱惜物命？凡人之所以为人者，惟此恻隐之心而已，”</strong>什么叫爱惜物命？我们能被称之为人，是因为我们还有恻隐之心，恻隐之心是什么呢？就是看到了别人的不幸，而表示同情，这个叫恻隐之心。或者说人是因为有慈悲之心的，用阳明先生的话讲，人都是有良知的，所以我们才被称之为人。</span></p><p><span>人之初，性本善，我们人最初的时候，从婴孩的状态，从小时候的状态，是不是都是善良的，我们小时候，是不是都有过梦想，比如说做世界警察，要做科学家，要去行侠仗义，我们回忆一下，小时候的那些梦想，是不是都是利他的呀，都是对他人有好处的，而不是对自己有好处的。</span></p><p><span>再往深一层指的是人的天性，他是本善的，为什么我们走到社会上以后，开始逐渐得变恶了，因为有欲望，欲望越多，是为了得到，为了索取，为了贪求才做坏事的。如果我们要少了那些欲望，没有了那些贪求，谁又愿意去做坏事呢，谁不愿意做好事，只是当他和欲望，发生冲突的时候，我们被欲望打败了，所以就会做不好的事情。恻隐之心，人皆有之，所以我们才被称之为人。</span></p><p><span><strong>“求仁者求此，积德者积此。”</strong>修仁德的人，要修恻隐之心的，积累德行，积累善行的人，也是要积累恻隐之心的。《了凡四训》整个这一篇，都在告诉我们积善之方，积善的方法。大家想一想，如果没有恻隐之心，能去积善吗？</span></p><p><span>就是因为我们有了恻隐之心，看到了别人的痛苦，看到了别人的危难，我们生了恻隐之心，我们表示同情，这个时候我们才去积累善行的，所以积功累德的根本，是在这里的，要升起恻隐之心，修仁者，求仁者，修仁德的人，也是从这里开始修的，我们有了恻隐之心，我们才能建立更多的仁慈仁爱之心。</span></p><p><span><strong>“周礼，‘孟春之月，牺牲毋用牝，’”</strong>牝是什么，就是雌的，是母的，孟春三月是春季的首月，那时周礼是要祭祀的，春天祭祀不用母的，为什么？因为春天母的都是怀子的，如果用母的不是多伤及性命了吗？</span></p><p><span>我们经常说一句话：“劝君不吃三月鲫，万千鱼籽在腹中，劝君莫打三春鸟，子在巢中待母归”，都是告诉我们这样的道理。</span></p><p><span><strong>“孟子谓君子远庖厨，所以全吾恻隐之心也。”</strong>这里的庖厨指的是什么呢，杀生的，杀害物命的厨房，君子尽量远离这样的事情，为什么咱们这里要吃素啊，就是不想让大家在厨房里做这样的事情，所以咱们才提倡吃素的，能长期的吃素，是不是就在修我们的恻隐之心，修我们的仁慈和仁爱之心呢，一样的道理。这都是为了成全我们的恻隐之心，进而修我们的慈悲之心，仁爱之心。</span></p><p><span><strong>“故前辈有四不食之戒，谓闻杀不食、见杀不食、自养者不食、专为我杀者不食。”</strong>为了成全恻隐之心，在我们之前的古人，对于吃，有四种戒，就是四种不吃的行为：听到被杀害的声音不吃的; 我看到被杀的场面也不吃; 自己养的不吃; 专为我而杀的不吃。</span></p><p><span>举个例子，我去朋友家做客，朋友看我来了以后，家里养的鸡也好，羊也好，专门为了招待我，而把它杀掉，这种情况下是不吃的。刚开始修行的人们，我做不到吃素，怎么办呢？了凡先生这里所讲，不是为我而杀的我就吃，不是活的现杀的就吃，所以说我们去饭店的时候，尽量少点现杀的，点他已经杀好的，那些冻肉就好了。</span></p><p><span><strong>“学者未能断肉，且当从此戒之。”</strong>刚开始学习的人，怎么办呢？我们做不到吃全素，所以按照上述讲的三净肉，这样的标准去做就好了。我们只吃这样的肉，我们不吃那些现杀的，不吃那些为我而杀的，就可以了，循序渐进地一步一步来。</span></p><p><span><strong>“渐渐增进，慈心愈长。”</strong>我们从刚开始一点一点来，先吃三净肉，一点一点地增进，就是循序渐进的过程，然后慈心愈长，随着我们慈心，越来越增长的时候，可能连三净肉也不吃了，所以很多刚开始学习，刚开始修行的朋友总问说，我做不到吃素怎么办？</span></p><p><span>我一直都在讲，我们修行不需要太刻意而为之，当我们还做不到的时候，该吃吃，只不过在不断得减少，然后只吃净肉，我们的恻隐之心，慈悲之心，仁爱之心都会渐渐地增长，自然而然的就开始不吃了，所以那个果是自然呈现的，不需要太过于刻意和纠结，当下做不到没关系，我们只要按照正确的方向，按照法去指引我们就好了。</span></p><p><span><strong>“不特杀生当戒，蠢动含灵，皆为物命。求丝煮茧，锄地杀虫，念衣食之由来，皆杀彼以自活。”</strong>不仅是杀生，我们要戒，这里蠢动泛指动物，这些动物都是含灵的，所以皆为物命，它都是有生命的，告诉我们要懂得珍惜和珍爱，爱惜物命。</span></p><p><span>求丝煮茧，我们穿的衣服，很多是用蚕丝做的，蚕丝是怎么取来的？茧一开始吐丝，都是把自己的身体包裹起来的，包成白的，但是怎么才能取它的丝，是要用水煮的，用热水煮，一开始它是硬的，煮完了以后，它就开始变软，我们才能找到蚕丝的头，把头拽出来的时候，蚕丝才是完整的。</span></p><p><span>但是这个时候的茧，已经煮得死掉了，所以告诉我们，衣物都是这样来的。锄地杀虫，我们种庄稼的时候，现在要打农药，要除草，是不是都是杀害了，很多虫子的。</span></p><p><span><strong>“念衣食之由来，皆杀彼以自活。”</strong>这段话不是告诉我们，不要种庄稼了，不是告诉我们不要穿衣服了，而是我们要念及衣食的由来，都是杀害了那么多的物命，我们自己才得以存活的，我们才有衣和食，这个时候要懂得爱惜。</span></p><p><span>“<strong>故暴殄之孽，当与杀生等。”</strong>暴殄是浪费，糟蹋，如果这个时候我们还在浪费，还在糟蹋，与杀生是一样的。这段话告诉我们，不是不让我们用，而是不能浪费的，不能浪费食物，不能浪费衣物的，如果浪费了，跟杀生是一样的。</span></p><p><span><strong>“至于手所误伤，足所误践者，不知其几，皆当委曲防之。”</strong>至于我们的手上误伤误杀的，脚所误踩误塌的，实在不知道数量有多少，但是我们要小心谨慎的，尽量少误伤。</span></p><p><span>所以很多学习和修行了一段时间的朋友，大家都会讲，现在走路特别小心，看看有没有虫子，做事情的时候也特别小心，看看有没有伤到什么样的物命，这都是恻隐之心，在不断地提升的过程，都是我们的慈悲之心，在不断地增长的过程。</span></p><p><span>所以我们更多的去注意这些物命，我们尽量少误伤，尽量少误杀，这些都是在行善。很多人总说，我没有能力怎么行善？这就已然是在行善了，我们的一个善念起，我们一个对他人有益的善良的话，我们珍惜物命的一个行为，这都是善行。</span></p><p><span><strong>“古诗云：‘为鼠常留饭，怜蛾不点灯。’何其仁也！”</strong>这是苏东坡讲的，爱护老鼠的时候，给它留点饭，让它可以有的吃。我们经常说一个词，叫飞蛾扑火，只要是有火有亮，蛾就是往上扑的，所以要可怜这些蛾，是不点灯的，不点火的，不伤害它们的生命，这是多大的仁德之心，多强的仁爱之心。</span></p><p><span><strong>“善行无穹，不能殚述。由此十事而推广之，则万德可备矣。”</strong>善行实在是无穷无尽，太多了，这里不能一一详尽地述说，由这十件事情，不停地推广和延伸，所有的事情，我们都可以去完备的，所有的事情，我们都可以这十件事情为准则，去不停地延伸推广，让我们生活当中，到处都是善行，到处都是善念。</span></p></div>"
},{
    "title": "第三十三讲《谦德之效》满损谦受益",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>谦德之效篇--满损谦受益</strong></span></p><p><span>整个这一篇告诉我们，懂得谦虚，懂得谦下，本身就是一种德行。比如说每天学习，每天修行，我们会说让自己慢下来，让自己少起情绪，不断地去修正自己的念头，是一种修行，不断地改过，是一种修行，不断地行善是一种修行，同样谦虚也是一种修行。</span></p><p><span>我们每个人的骨子里面，或多或少的都有一种，高傲自满和骄傲的状态，跟我们刚开始修慈心于物是一样的，我们一点一点的，让自己从外在的状态，谦虚下来，从内心的心理上谦虚下来，所以我们把谦虚，当成一种修行的功课，当成我们每天都要去观察的事情来做，只有懂得谦虚，懂得谦下，才能积累更大的德行。</span></p><p><span><strong>“《易》曰：天道亏盈而益谦，”</strong>《易经》上讲，天道是亏盈而益谦的，《道德经》也讲，天道损有余而补不足，和这里的亏盈是一个意思，天道把一些好处，都是给到懂得谦虚的人，所以他是溢盈的。但是会拿走骄傲自满的人，身上的一些东西，天道循环的规律，是用来匡正的。</span></p><p><span>有一些人太过于骄傲自满，得到的太多，那就会从这样的人身上，拿走一部分，给到谦虚的人那里去，这是一种循环的自然规律和道理，不是天道刻意而为之，所以《易经》明确地告诉我们，是这样运行的。</span></p><p><span><strong>“地道变盈而流谦，”</strong>不仅是天道，地道也是如此，变盈而流谦是什么意思呢？举例子，我们看水都是往低处流的，所以有句话叫：“人低为王，水低为海”，比如说某一个地方，水满了以后，是不是哪里低，往哪里去流动，地道也是如此，满就是不谦的状态。</span></p><p><span>我们经常说，骄傲的人就会自满，就会自以为是，当我们自以为是的时候，很多福德，很多的人际关系，很多的财富，就已经开始流走了，就流到低的地方去了，天地之道都是如此。</span></p><p><span><strong>“鬼神害盈而福谦，”</strong>鬼神之道也是一样的，它是惩罚那些自满的人，惩罚那些骄傲的人，而去降福给谦德和谦逊的人。我们以前是不是经常看那些电影，比如说捉鬼的影片，这些鬼神恶作剧，是不是太骄傲自满的，不可一世的，都是这样的人，即使是恶作剧，他也会找这样的人，但是他愿意去帮助一些谦虚的人，懂礼的人，忠厚之人，虽然是以一种电视剧的手法表现出来，难道不也是在给我们讲道理的吗？</span></p><p><span><strong>“人道恶盈而好谦，”</strong>我们人道是不是一样的，好是喜好的意思。我们是不是都喜好谦虚的人，喜欢谦下的人，而讨厌那些骄傲自满的人，所以我们要把谦虚当成一种日常的功课，当成每天的行为准则来修正。我们生活当中也好，我们去学习也好，或者我们接触的朋友也好，有多少人喜欢骄傲自满的？即使我表现出来，就喜欢这样的性格，其实心里是不喜欢的，这样的人太过于傲气，太过于自满。</span></p><p><span>通常骄傲自满的人际关系并不好，所以我们要去观察我们的生活，如果我们的人际关系不好，事情做得很差，是不是我们太不谦虚了，所以叫谦德之效。</span></p><p><span>如果我们连谦虚的道理都不懂，又哪来的德行？这些优秀的人，有成就的人，是不是都是谦虚的，都是谦下的，明明自己做了很多事情，还讲其实我什么都没有做，他对每个人都是和顺的，对每个人都懂得处下，所以我们要多懂得去看看自身，平时的言行举止，我们在工作当中，在人际交往的过程当中，是不是表现的，太过于自满和自傲，所以这是天地鬼神，人，都不喜欢的。</span></p><p><span><strong>“是故谦之一卦，六爻皆吉。”</strong>谦卦是《易经》里面，六十四卦当中的第十五卦，唯有谦卦是六爻皆吉的。其他的任何一卦，都是物极必反。六十四卦第一卦叫乾卦，也就是天。乾卦，天行健，君子以自强不息，自强不息是好事情，可是物极必反，自强不息到一定的程度，也是不好的。</span></p><p><span>《易经》有一句话叫群龙无首，当我们强到一定程度，就会群龙无首。比如说，我们每个人都一样，当强到一定的程度，还有人帮我们吗？没有。即使是自强不息，都会物极必反，只要强到一定的程度，没有人愿意帮我们的。</span></p><p><span>做企业的人，如果我们自己强到一定的程度，别人都不帮忙，我们家庭的女士也是一样的，如果在家庭当中非常强势，会发现做事情没人管我们的，什么都得我们自己做。有的老板做企业，为什么这么累？都得亲力亲为，这个事情交给别人，我是不放心的，这是不是一种骄傲自满，认为除了我，别人都做不好事情的。</span></p><p><span>言下之意就是他们根本不行，所以我才不相信他们。强势的女人，怎么讲话？“不是，老师，他们都不行，不是我非要强势”，是我们太强势了，故而他们不行。太强势的人，幸福感不强的，任何事情不能过度，即使是自强不息，过度了都不好，但是唯有谦卦不同，六爻皆吉，谦虚是可以无度的，无论我们谦虚到什么状态，别人都喜欢，天地都喜欢，这是谦卦的不同。</span></p><p><span>唯一一个六爻皆吉的，其他的卦象，都是物极则反，谦虚是人人都喜欢的，是天地所造福的，所以我们要把谦虚，当成一种常态来修。</span></p><p><span>我们学习是不是一样的，骄傲自满的人，学不进去东西的， 我觉得已经很会了，我觉得已经很厉害了，从此以后不再进步了，因为已经满了，还怎么进步呢？就像这个杯子一样，已经装满水了，其他的东西，已经装不进去了。</span></p><p><span>平时生活当中也是，工作状态当中也是一样的，越是谦虚的人，他的成长速度越快，因为他谦虚，我很努力并且又处下，我对每个人都是和蔼的，每个人跟我讲什么，我都是听的，都是承受的，我都是努力成长的，这样的人才有发展，天地也会降福给这样的人，所以我们一定要懂得这个道理，切忌骄傲自满。</span></p><p><span>我们学习不是如此吗，只要觉得自己会很多知识的人，不会再进步的，因为我们已经觉得自己很厉害了，我已经会了很多知识了，所以学习也是一样的，一定要让自己保持一个无知的状态，我是不知道那么多东西的，我还欠缺很多，只有这样，才会成为一个更大的容器，所有的福德，所有的学习，所有的成长才会往低处流。</span></p><p><span>《道德经》也告诉我们：“江海所以能为百谷王者，以其善下之”，江海能成为百谷之王，百谷就是指很多山川，小溪，河流，最后统统归于江海，为什么呢？江海善于处下，所以这一点是非常重要的。了凡先生把它放到，最后一篇来讲，把谦和德放在一起，是非常准确的，谦虚本身就是一种良好的德行和品行。</span></p><p><span>“《书》曰：‘满招损，谦受益。’予屡同诸公应试，每见寒士将达，必有一段谦光可掬。”《尚书》告诉我们，满要招来损害的，只有谦虚的人才是受益的。我经常和诸公，和很多人去应试，一起参加考试，每次见到很多寒窗苦读的读书人，将要发达的时候，必有征兆，什么样的征兆呢？</span></p><p><span>必有一段谦光可掬，可掬是像手能捧住一样，我们好像手里捧着一把光一样，就是一个人谦和的神采，已经到达了可以捧住的感受，所以去想象一下，那是一种什么样的状态？我们看到这一个人，就知道他是谦和的，是顺承的，是懂得处下的，他浑身散发的是这样的光彩。我们要看到这样的人，就知道了，这样的人在不久的将来，必然是要发达的，因为他是有征兆，有迹可循的。</span></p><p><span>同样反过来，一个人骄傲自满，狂妄不可一世，也有征兆的，接下来一定会碰到挫折和被迫害的，所以满招损，谦受益，这样的人骄傲自满到一定的状态，就会招致损害的。</span></p><p><span><strong>“辛未计偕，我嘉善同袍凡十人，”</strong>辛未年，是指一五七一年，举人赴京考试叫做计偕。一五七一年，在了凡先生的家乡，他和同袍十余人，一起赴京考试。嘉善是地名，那个时候同袍是指同乡同学，同僚，一起在朝为官的都叫同袍。</span></p><p><span><strong>“惟丁敬宇宾，年最少，极其谦虚。予告费锦坡曰：‘此兄今年必第。’”</strong>丁敬宇宾，他的年纪是我们十余人当中，最小的，但是却是最谦虚最谦逊的人。我就告诉费锦坡，他是跟了凡先生共同去参加考试的人，说丁敬宇今年必中。</span></p><p><span><strong>“费曰：‘何以见之？’予曰：‘惟谦受福。兄看十人中，有恂恂款款，不敢先人，如敬宇者乎？’”</strong>费锦坡问我，怎么会觉得他一定会考中呢？我就讲唯有谦虚的人，会受到福德的。恂恂是指恭谨温顺，款款是很忠实很诚恳的样子。不敢先人，就是做什么事情，都是不敢为人先的，他做什么事情都是处后的。</span></p><p><span>观察一下，在我们这十个人当中，有没有如此温顺的，如此恭谨的，如此忠实和诚恳的，事事都在别人的后面，有没有一个像丁敬宇这样的人？</span></p><p><span>我们平时做事情，都是喜欢彰显自己的，都是想冲在前面的，都是想表现自己的，可是这里的人不一样，他永远都是那么谦逊的，做什么事情都礼让他人，先行先走先用，这样的人都是谦虚的，所以这是一种谦虚心态的一种表现。</span></p><p><span><strong>“有恭敬顺承，小心谦畏，如敬宇者乎？”</strong>有没有对他人都很恭敬的，顺承的，就是都愿意去接受的，并且非常小心谨慎，充满着敬畏之心，有没有如敬宇者乎？这里能看到这一个人谦虚，谦逊的征兆，和他表现出来的那个样子。</span></p><p><span><strong>“有受侮不答，闻谤不辩，如敬宇者乎？”</strong>有没有受到了别人的侮辱，却不对答，不还嘴，闻到别人的毁谤不去辩解，都坦然顺受。看看有没有一个如敬宇者乎？</span></p><p><span><strong>“人能如此，即天地鬼神，犹将佑之，岂有不发者？”</strong>一个人如果能做到如此地步，天地鬼神都会给他降福的，都会佑之，这样的人怎么能不发达，必有征兆。 </span></p><p><span><strong>“及开榜，丁果中式。”</strong>开榜的时候，丁敬宇果然中了进士，后来丁敬宇，官至工部尚书，又做了太子太保。那个时候，做到太子的太保，是位列三公的，就是给太子教书的，辅助太子去成长的人，他自己的德行要非常好，才可以的。</span></p><p><span>不光是书读得好，身上的品德非常优良，很有德行，很有才学，才能去做太子太保的。所以了凡先生通过观察这一个人，平时的行为举止，就会知道将来这个人，必有一番作为 ，因为他懂得谦虚的，是有良好的品德的。</span></p></div>"
},{
    "title": "第三十四讲《谦德之效》必谦必相之",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>谦德之效篇--必谦必相之</strong></span></p><p><span><strong>“丁丑在京，与冯开之同处，见其虚己敛容，大变其幼年之习。”</strong>丁丑年，就是一五七七年，在京城的时候，了凡先生和冯开之，两个人住在一起，这个时候他看到这个人是很谦虚的，对人对事，面容是很和顺的样子，跟幼年的时候，完全不同了。这里也就说明一个什么道理呢？冯开之在幼年的时候，不是这样的状态的，说明他这些年，不断地修正自己，现在变成了很谦虚，面容很和顺的样子。</span></p><p><span><strong>“李霁岩直谅益友，时面攻其非，”</strong>冯开之有一个好友叫李霁岩，直谅是非常正直诚信的样子，说他有一个这样的朋友，有的时候当面指责，冯开之的过错和不足，这一点没有几个人受得了。</span></p><p><span>《论语》里面有一段话，子贡问孔子交友之道，孔子说，忠告而善道之，对好友一定是忠告的，并且影响他引导他向善，他这个朋友是不是这样做的，只不过方法直接，我们现在很多人，未必受得了。我们看冯开之是怎么做的？“但见其平怀顺受，未尝有一言相报。”他是很平和地接受，没有一句地反驳，这些行为，被了凡先生都看在了眼里。</span></p><p><span><strong>“予告之曰：福有福始，祸有祸先，此心果谦，天必相之，兄今年决第矣。”</strong>了凡先生讲，一个人的福气来的时候，一定有开始，要发生祸端的时候，也必有原因。一切事情都是有征兆的，是能看得出来的。如果我们的心，果真是谦虚的，天必相之，上天一定会把福德，降到我们自己的身上来，兄今年一定会考中的，那个时候决第都是考中进士。“已而果然。”后来果然考中了。</span></p><p><span>我们经常会讲古之圣贤，为什么看人极准，他并不神奇，是因为他懂得了，某些事物发展的痕迹。这个时候，他就很清楚得能看懂人，就像我们不停地去学习圣贤的文化也是一样的，当我们学习了很多圣贤的文化，某些人的行为，只要一对照，自然就会知道，他接下来发生什么事情，因为凡事发生必有痕迹，都是按照天地循环的规律，所告诉给我们的。</span></p><p><span>上一篇我们也讲到，法者，万世生灵之眼目也，正法是什么？是我们万世生灵导航的方向，明白了万事万物发展的规律，懂得了正法，拿着这个眼目，对照别人发生的事情，是不是一目了然哪？因为规律清清楚楚得，摆在那里，为什么古之圣贤看人极准，是因为他知道事物的发展规律，所以看人自然是准的。</span></p><p><span>“赵裕峰，光远，山东冠县人，童年举于乡，久不第。”赵裕峰是人名，字光远，山东冠县人，离济南很近，聊城有个冠县，童年，这里指的是不满二十岁，在乡里就中了举人了，下一步就是考进士，但是进士却一直都考不上。</span></p><p><span><strong>“其父为嘉善三尹，随之任，慕钱明吾，而执文见之。”</strong>他的父亲是嘉善的三尹，一般那个时候分大尹，二尹和三尹。大尹就是知县，二尹就是县丞，丞相的丞。三尹就相当于是一个办事情的官员，或者文员之类的，他的父亲是做的三尹，他随父亲去上任，他特别仰慕一个文人，当时的一个名士叫钱明吾，然后拿着自己所做的文章，去拜见了他所仰慕之人。</span></p><p><span><strong>“明吾悉抹其文，赵不惟不怒，且心服而速改焉。”</strong>钱明吾先生把他所有的文章，全部涂抹了，用笔全部划掉了，可以想象一下，他这样的一个行为，一般人是不是就很生气了，如果看我的文章不好，直接告诉我就好了，何必把我的文章全部划掉。他不但不生气，并且非常心服口服地去改正，注意是速改焉，马上立刻地去改正。</span></p><p><span>这一点是我们现在的人，很难做到的，因为我们太自满的状态了。很多时候，我们经常会说，想去拜访一个老师，拜访一个高人，会发现有一个奇怪的现象，当我们去拜访这个人的时候，如果说的都是他人的问题，我们处在局外的时候，会拍案叫绝，表示极度的赞同，只要说到自己的问题，心里马上不服，因为自己太自满的状态，就是如此的。</span></p><p><span>所以我们看人家，马上心服口服地去改正，既然他是我们所仰慕之人，说明无论他的德行，才学，品格都是比我们要高的，既然他是比我要高的，我们诚心求教，为何还如此骄傲自满的状态呢？</span></p><p><span><strong>“明年，遂登第。”</strong>第二年，登第了。说明他之前的文章做得肯定还是有问题的，是有不足的，所以他速改了。这种决心背后那个东西叫谦虚，如果我们没有那个谦虚，怎么会改呢？</span></p><p><span>我们要不懂得谦逊，不懂得谦虚是不会改的，会觉得我自己的文章做得很好，我仰慕于他，来拜访，他却把我的文章都涂抹了，心里开始不服气。可是人家转年就去中了科第，是有他的道理的。每一个故事，都在告诉我们谦虚的效果，谦虚的德行。</span></p><p><span><strong>“壬辰岁，予入觐，晤夏建所，见其人气虚意下，谦光逼人，”</strong>入觐就是入朝去见帝王，晤，是遇见的意思。我们现在还有一个词叫会晤。在一五九二年的时候，入朝去见帝王，遇见了一个人，叫夏建所，我看到夏建所这个人，虚怀若谷，能感受到，这个人是不为人先的，他是懂得处下的，浑身散发着谦虚之光，让别人看到他，都不忍为难这样一个人，因为太过于谦虚和谦逊了。</span></p><p><span><strong>“归而告友人曰：‘凡天将发斯人也，未发其福，先发其慧’。”</strong>回来以后，我就跟一个友人在讲，凡是天将让一个人发达的时候，是先让一个人增长智慧，所以为什么我们每天修行，每天学习都要讲，一定要让一个人增长智慧，我们自己一定要不断地去学习，不断地去修正自己，让自己增长智慧。增长智慧以后，福德就来了。因为我们增长了智慧，才能看懂很多事物发展的规律，我们做事情才是合道的，才是对他人有益的，才是谦虚的。</span></p><p><span>当我们这样去做的时候，越接近于天道，福德自然不就降下来了吗，我们天天讲，天地降福于我们，天地是没有丝毫偏差和偏向的，并不是偏向我们，给我们降福，而是我们自己的行为，符合了天地发展的规律，所以自然就会得福德得福报。</span></p><p><span><strong>“此慧一发，则浮者自实，肆者自敛。”</strong>智慧一旦升起来的时候，浮者，浮华的人，自然开始变得充实，肆者自敛，很放肆的人，自然就开始变得收敛，当我们还很浮华，很放肆，很骄傲，很自满的状态，实则是没有智慧的表现。</span></p><p><span>当我们有智慧的时候，就会变得谦逊，就会变得没有那么骄傲自满，做事情的时候，自然设身处地的为每个人着想，这个时候智慧就开始显现，接下来福德才会开始显现的。</span></p><p><span><strong>“建所温良若此，天启之矣。及开榜，果中式。”</strong>夏建所这个人，他很温和很良善，已经到了这个地步，这是天来启发他了。后来开榜，果然考中了。我们从每个人身上去看他当下的言行举止，就知道，将来他会发展成什么样子，万事万物都有迹可循。</span></p></div>"
},{
    "title": "第三十五讲《谦德之效》谦善积阴德",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>谦德之效篇--谦善积阴德</strong></span></p><p><span><strong>“江阴张畏岩，积学工文，有声艺林。”</strong>江阴是地名，张畏岩是人名，积学是很有学识，工文是不单有学识，并且他的文章做得很好，艺林是指读书人，在读书人之中，是很有名望，很有声望的这样一个人。</span></p><p><span>“<strong>甲午，南京乡试，寓一寺中，揭晓无名，大骂试官，以为眯目。”</strong>一五九四年，去南京参加乡试，借宿在一个寺中，揭晓的时候，发现没有他的名次，也就是说没考中，大骂士官，很生气，因为本身他的学识和文章都做得很好，没考中，他就特别得气愤，以为眯目。眯目是什么意思？比如说，我们平时这样叫眯目，就是指眼睛眯成一条缝，很小的意思。他是在骂士官，是不是瞎了眼睛，我写的文章这么好，却没有名次。</span></p><p><span><strong>“时有一道者，在旁微笑，张遽移怒道者。道者曰：‘相公文必不佳。’</strong><strong>”</strong> 这时有一个道人在旁微笑，遽是立刻的意思，他立刻就迁怒给了道者。道者说：你的文章写得一定不好。</span></p><p><span><strong>“张益怒曰：‘汝不见我文，乌知不佳？’”</strong>益就是更加，更加愤怒，更加生气地说，你没有见过我的文章，怎么会知道不好呢？“道者曰：‘闻作文，贵心气和平，今听公骂詈，不平甚矣，文安得工？’”道士又说了，我听说要想文章做得好，贵在心气是平和的，和平的状态，我今天听到你的这种怒气和骂詈，心中甚是不平，哪来的心气平和呢？你怎么可能写出来好的文章？</span></p><p><span><strong>“张不觉屈服，因就而请教焉。”</strong>张畏岩不得不自觉地屈服了，当他请教时候，是不是态度就变平和了？因此去请教这位道人，一个人谦虚的状态，心气平和的状态是多么重要，如果我们不是在心气平和的状态，不懂得谦虚的状态下，怎么可能写出来好的文章呢？又怎么可能讲出来美妙的话语呢？</span></p><p><span>大家想一想，我们如果心气是不平和的，是骄纵自满的状态，可以想象所讲出来的话，所写出来的东西，是什么样子的，所以谦虚的时候，心态非常平和的状态下，才能写出来美好的东西。</span></p><p><span>子曰：“不学礼，无以立，不学《诗》无以言”，孔夫子讲，如果不学礼，是无法在这个社会上立足的，想一想没有礼貌的人，怎么立足啊？人际关系怎么会好，生意怎么会好，为官怎么会顺畅呢？所以不懂礼是难以立足的。不学《诗》无以言，那个时代，孔子讲的是《诗经》，不学《诗经》是不会讲话的，为什么我们把标题用诗经体描述，这样更简洁，别人看着也更明朗。什么叫诗经体？都是四个字四个字地讲。</span></p><p><span>比如《诗经》里讲：“桃之夭夭，其叶蓁蓁，之子于归，宜其家人”，我们正常都怎么讲话，一个待嫁的少女，家人对他的一种叮嘱：嫁到对方家里，一定要懂得相夫教子，一定要为对方的家庭好，一定要懂得孝顺公婆，不要那么多的事情。这样讲出来，与之子于归，宜其家人，是不是美感不同？</span></p><p><span>比如《大学》里，引用《诗经》：“瞻彼淇澳，菉竹猗猗，有斐君子，如切如磋，如琢如磨，瑟兮僴兮，赫兮喧兮”，有这样一个君子，每天不停地切磋琢磨，去修正自己，身上所散发的都是美好的光明的样子，用诗经体所描述出来的感受，是不是完全不同？我们现在生活当中，同样好用。</span></p><p><span>比如举例，我们吃完中午饭，去山间随便溜达一圈，碰到一个邻居，聊了很多家长里短的事情，是不是正常该这样描述，用诗经体怎么描述？午饭过后，游于山间，偶遇友人，闲话家常，是不是美感就出来了？</span></p><p><span>那一天咱们录小视频，就是我躺在摇椅上，大家都说像个老头对吧？正常我们讲话会说，坐在摇椅上，配上音乐，感觉就像退休的老人家一样。如果用诗经体怎么描述？摇椅慢慢，思绪翱翔，悠然自得，亦如老者。这样几句话说出来，是不是不一样的意境了？所以这是诗经体，这是诗词的力量。</span></p><p><span>所以孔夫子告诉我们，不学《诗》无以言，不学《诗》讲出来的话，是不好听的，是不优美的，我们讲理也好，我们想讲出来的话优美也好，是不是首先得是谦虚的，得是心气平和的状态，否则能讲出来那些雅言吗？能做出来那些有礼的行为吗？如果我们连最起码的谦虚，都不懂，如何才能恭敬有礼？</span></p><p><span>如果内在的心气都不平和，如何讲出来那些美妙的语言呢？如何有那种悠然自得的状态呢？张畏岩不得不屈服，因为一听道者讲得有理，所以这个时候开始请教了。</span></p><p><span><strong>“道者曰：中全要命，命不该中，文虽公，无益也。须自己做个转变。”</strong>是否能中，全在命运可不可中，如果命里是不该中的，文章写得虽然好，也没有用的。这段话在告诉他什么呢？虽然有可能文章写得好，但是命不该中，即使文章写得好也没用，必须自己做个转变。</span></p><p><span><strong>“张曰：‘既是命，如何转变？’道者曰：‘造命者天，立命者我。”</strong>既然是命运，又让我转变，我要如何转变？说造命在天，可是立命却在我，如何立命啊？去努力地改变，积极地积累德行，去行善事，积累阴功，也就是积累阴德，这叫立命在我。</span></p><p><span>但是通常流行一句话：“听天由命”，听天由命不就是不努力吗？反正我就这样，我命里没有，我也没法努力，反正就是这个样子，发展成什么样就算什么样的，这叫听天由命。立命有我的状态，是我要积极努力地去改变，去进取的。</span></p><p><span><strong>“力行善事，广积阴德，何福不可求哉？”</strong>如果我们要身体力行地做善事，广积阴德，什么样的福不可求呢？整个《了凡四训》，很多地方都提到阴德，就是我们一定要去懂得，做一些不为人知的事情，不求他人回报的，这些都是阴德。</span></p><p><span>还有一个重要的点，当我们过于骄傲自满的时候，是损自己阴德的，只不过我们不懂得。反过来一样，我们做事情做人，如果懂得谦恭谨慎，实则已然是在给自己积累阴德了，我们一定要切记，要把谦虚把谦下，当成一种每天修行的必要功课来做，如此，我们就已经是在积累德行了。</span></p><p><span><strong>“张曰：‘我贫士，何能为？’”</strong>我只是一个贫苦的读书人，我又怎样去广积善行，如何去积累阴德？这也是我们现在很多人的想法，我没有钱，我怎么去做好事情呢，我没有智慧，让我如何去帮助更多的人，广积阴德呢？</span></p><p><span><strong>“道者曰：‘善事阴功，皆由心造，常存此心，功德无量，’”</strong>所有的善事，都是我们由心而造的，如果我们经常存着做善事的心和念头，已然是功德无量了。为什么说修行，要从自己的心念处开始修？从心念上不要骄傲自满，从心念上，就不要产生坑害他人的念头，而要产生如何帮助他人的念头，如何谦恭温顺的念头，所以从心念起处就已然开始修了。</span></p><p><span><strong>“且如谦虚一节，并不费钱，你如何不自反而骂试官乎？”</strong>告诉张畏岩，像谦虚这样的事情也不用钱，是不是都是心念起处啊，当懂得谦虚，已经是给自己在积累德行了，怎么还用钱呢？同样如果我们是骄傲自满的，放纵的，狂妄不可一世的，任何人都不放在眼里的，已经是在给自己损阴德，而不自知，不懂得内在谦逊，谦虚，不懂得自我反省，反而去骂试官？</span></p><p><span><strong>“张由此折节自持，善日加修，德日加厚。”</strong>从此以后，他开始折节自持，折节就是降低自己了，降低自己的身份，开始自己行持，变得谦虚，变得谦逊了，善行越来越多，自己的德行也越来越厚重，所以我们才讲厚德载物，如果我们自己没有宽厚的德行，如何能承载更多的事情，如何能容纳包容更多的人，所以都是从谦虚开始修的。</span></p><p><span><strong>“丁酉年，梦至一高房，得试录一册，中多缺行。问旁人，曰：‘此今科试录。’”</strong>一五九七年，做梦梦到一个很高的房子，得到一本试录的名册，名册里面记录着，哪些人是可以考中的，哪些人是考不中的，可是中间，却发现有很多是缺行的，也就是空白的，没有人名。这个时候他问旁人什么情况？有人对他讲，这就是今年考科第的试录，就是这样一本名册。</span></p><p><span><strong>“问：‘何多缺名？’曰：‘科第阴间三年一考较，须积德无咎者，方有名。’”</strong>为什么中间会缺了这么多的名字？说阴间是三年一考较的，考较就是考察校对，必须不停地积累德行，无咎就是没有过错和过失的，方有名。</span></p><p><span>这里讲了一个非常重要的事情，要考较考察什么呢？本来上边可能有他的名字的，但是他这三年，做过积德的事情，并且没有过多的过错和过失，才能榜上有名，也就意味着，即使在上面有他的名字，可是他做了很多过错和过失的事情，他的名字也是会被除去的。</span></p><p><span><strong>“如前所缺，皆系旧该中式，因新有薄行而去之者也。”</strong>如前面看到的所缺，本来该有他的名字，他是该考中的，可是因为品行不端，有很多过错，所以把他的名字去掉了，就会有那么多的空白处。</span></p><p><span><strong>“后指一行云：‘汝三年来，持身颇慎，或当补此，幸自爱。”</strong>后面又指到一个地方对他讲，你这三年来，从谦虚谨慎开始修，积累了很多的德行和善行，或许是可以补在此处的，希望你要自爱，要继续勤勉去积累阴德。“是科果重中一百五名。”后面果然考中了。</span></p><p><span>现在我们回到之前，道人所讲的那番话，他说，本命不该中，即使文章做得好也无益，是不是他本来命里是不该中的？为什么后来中了，是因为他积累了很多阴德，故而改命了。</span></p><p><span>整个《了凡四训》在讲什么？因为自己修了很多的德行，做了很多的善事，了凡先生本来无子也得子了，本来不能中科第也登科第了，这里的张畏岩，是不是也一样的道理，所以命运是可以改变的。但是命由我造，如何改变？</span></p><p><span>通篇都在讲行善，未论行善，先行改过，现在整个又告诉我们，谦德之效，懂得谦虚，懂得改过，懂得行善，就是在不停地积累阴德，才会把我们本来命里没有的，会把它修出来。</span></p></div>"
},{
    "title": "第三十六讲《谦德之效》必谦必相之",
    "date": "2022-08-02",
    "html": "<div class=\"B1_text\"><p><span><strong>谦德之效篇--须念念谦虚</strong></span></p><p><span><strong>“由此观之，举头三尺，决有神明，”</strong>由此就知道了，举头三尺，一定是有神明的，我们的所作所行，都是被记录在案的，无论是我们的善行，还是恶行都一样。所以老人常常告诉我们，做事情一定不要亏了阴德，以前我们的爷爷奶奶，是不是经常这样告诉我们，要多积阴德，一定不要做缺德的事情，不要以为别人看不见，我们就要去做那样的事情，都在损自己的德行，一定不要骄傲自满，一定要懂得谦虚。</span></p><p><span><strong>“趋吉避凶，断然由我。”</strong>如何趋吉避凶，都是由我们自己的行为所带来的，因为鬼神也是降福给谦虚的人，天地也是降福给谦虚的人，我们懂得不断地去谦虚的时候，就会避开很多的灾祸。我们在这个世上行走，不是一样的吗，一个人如果做事情，永远是谦虚的谦逊的，别人就会喜欢这个人，我们跟谁打交道，狂妄不可一世，即使有一些才华，别人也不喜欢，就会让自己受到损害，所以满招损，谦受益，在任何场合都是如此。</span></p><p><span><strong>“须使我存心制行，毫不得罪于天地鬼神，”</strong>我们一定要懂得存心制行，存心制行，存在什么样的心，约束自己的行为叫制，所以我们要把谦虚，当成一种修行来做，当碰到一件事情的时候，我们心里就要思考，我们是不是够谦虚的，以此来约束我们的行为，让我们变得谦虚。</span></p><p><span>久而久之是不是，我们就形成了谦虚的心念，就变成了一种常态，所以先开始是存心制行的，然后一点一点的，变成我们的心都是谦虚的，然后我们所表现出来的样子，就是谦虚的。</span></p><p><span>不能得罪于天地鬼神，《论语》中讲：“获罪于天，无所祷也”，孔子说什么呢，如果我们的行为是获罪于天的，违反了天地的规则和道理，我们向谁祈祷都没有用的，其实在告诉我们什么呢？我们只要行为端正，就不会得罪天地鬼神，不要得罪于天地鬼神，不是说怕天地鬼神生气，天会跟我们生气吗，地会和我们生气吗？那如何不得罪呢？</span></p><p><span>我们的行为是中正的，是谦虚的，是行善的，自然就不得罪，我们自己的行为是端正的，无需去做任何的祈祷，靠自己就好了，所以命是掌握在我们自己的手里的。</span></p><p><span><strong>“而虚心屈己，使天地鬼神，时时怜我，方有受福之基。”</strong>虚心就保持很谦虚的心态，屈己是什么，委屈自己，刚开始是不是，要用一些行为来约束我们，很多人说，那约束我的行为，让我自我约束，我不习惯，这就叫屈己。</span></p><p><span>所以刚开始我们是虚心屈己的，使天地鬼神，都会怜惜我，都会疼爱我们，都会降福于我们，如此才是受福的根本和根基。那这段话告诉我们什么呢，如果我们不懂得，去约束自己的行为，如果不懂得去虚心，即使天想要降福，我们也没有根基，所以谦虚这件事情，何其重要。</span></p><p><span><strong>“彼气盈者，必非远器，纵发亦无受用。”</strong>彼是指那些，气盈者就是自满，自满的人必非远器，这些人一定走不远的，即使短暂的有一些发达，也无福享用。我们现在也经常会讲这样的话，看到一个人很狂妄不可一世，我们是不是就讲了，别看眼下发达，将来一定走不远，将来一定会出问题的，就是这样的道理。</span></p><p><span><strong>“稍有识见之士，必不忍自狭其量，而自拒其福也，”</strong>稍稍有一些见识的人，一定不忍心自狭其量，就是让自己的心胸变得狭隘，我们让自己的心胸，越变越狭隘的人，绝非有识之士，更非有志之士，一个有智慧的人，有见识的人，一定是让自己的心量，越来越大的，一定是虚怀若谷的，可以容纳承载更多的人和事，怎么会让自己的心量，变得如此狭隘，并且自拒其福也，拒绝了很多福德，降在我们的身上。所以我们有多大的心量，才能有多大的福德。</span></p><p><span><strong>“况谦则受教有地，而取善无穷，”</strong>况且谦虚的人，受教有地，才能得到别人的教诲和指点，我们想要学习的人，不是一样的吗？如果我们不懂得谦虚之道，谁愿意教给我们呢？教给我们一句反十句，然后我们去跟人家学习，态度还傲慢，谁愿意教我们呢？受教无地，即使教，也不是真心诚意的，所以谦虚才能使我们进步，才能使我们不断地去学习，因为我们总是觉得，亏的状态不满，我们才能容纳更多的东西。</span></p><p><span>就好像一个器具一样，本来就是这么大一个碗，我们只能装这么多东西，但是随着不断地修行，让我们的心量扩大，做大器之人，在不断地扩大，我们才能吸收更多的东西，修到一定的境界，君子不器了，虚怀若谷了，连器都没有了，这个时候，我们可以容纳万物的。</span></p><p><span>我们一定是从小往大修，让自己大器一点，不要碰到事情就斤斤计较，心量如此狭隘，我们怎么成大器，也走不远，这些的根基都是要懂得谦虚。如此我们会发现能取善无穷，因为我们更谦虚，容纳的东西更多，所能行的善事就更多，天所降给我们的福报和善，就会越多，要不然，我们没有那么大的心量，没有那么大的福德，是承载不了的。</span></p><p><span><strong>“尤修业者所必不可少者也。古语云：‘有志于功名者，必得功名，有志于富贵者，必得富贵。’”</strong>修业指的是进修德业，尤其想要进修的，增加自己的德行的，修自己的善业的，必不可少。什么叫志？我们有志于功名必得功名，有志于富贵，必得富贵，我们得先有志，先有方向，如果连方向都没有，怎么会得，就像我们现在每天做事情，是不是也一样的？想要掌握哪个技术，我想要会什么？</span></p><p><span>这是不是一种志，这是不是一种方向，我们有了这个方向，才可能不停地努力，不停的让自己变得谦虚，如果连这个方向都没有，怎么会有所得，好比是《大学》所讲的止。</span></p><p><span><strong>“人之有志，如树之有根。”</strong>人有了志向，就好比是树是有根的，如果树无根，这棵树怎么能茁壮的成长，我们人不也是一样的吗，如果我们没有志向，我们如何让自己变得强大，如何让自己茁壮成长？</span></p><p><span>王阳明先生也讲：“志不立，天下无可成之事”，所以不立志，天下没有能成的事情，我们熟知的诸葛亮，孔明先生也讲了，“志当存高远”，都在讲志向，志向是指引我们人生的方向，是我们进步的动力和桥梁。</span></p><p><span><strong>“立定此志，须念念谦虚，尘尘方便，”</strong>当我们立定此志的时候，念念谦虚，每一个念头，每一个行为，都是谦虚的，尘尘方便，这里的尘 指的是尘埃，即使像尘埃那么小的事情，我们要与人方便与人为善，我们要记住这八个字，念念谦虚，尘尘方便，我们所起的每一个心念，都是谦虚的，我们做任何事情，都是与人方便的，都是与人为善的。</span></p><p><span><strong>“自然感动天地，而造福由我。”</strong>当我们这样去做事情，这样去修正自己的时候，自然会感动天地，造福于我的。因为我们的行为，已然合了天地运行之道，自然就会降福给我们，所以这就是我命由我不由天，我们不是在求天地降福，而是让自己的行为，符合天地运行的规律，他自然就会降福给我们，这是水到渠成的事情。</span></p><p><span><strong>“今之求登科第者，初未尝有真志，不过一时意兴耳。”</strong>今天想求登科第的人，未尝有真志，他并不是真的想登科第，只不过是一时兴起。</span></p><p><span><strong>“兴到则求，兴阑则止。”</strong>阑就是退，兴趣来的时候，我们就求登科第，兴致退的时候，我们就停止不前。那个时候求登科第如此，我们现在做事情，很多人是不是如此，未尝有真志，很多人说，我要努力创业，我一定要好好工作，我要涨工资，我要做领导，我要好好学习，我要努力修行，会发现未尝有真志，兴趣来了，喊喊加油，兴趣退了就停止不前，所以绝非真志，如果真的有志向，一定是念念谦虚，尘尘方便的，一定是不断地约束自己的行为，让自己前行的，这才叫真志。</span></p><p><span>《论语》中讲，子曰：“未之思也，夫何远之有？”我是很思念一个人的，只不过离得太远了，这个时候孔子说，未之思也，夫何远之有？我们还是没有思念，如果真正思念，又何远之有呢？</span></p><p><span>我们做事情不是一样的吗，很多人说了，我真的想努力，如果我们真的想努力，何远之有？有的人说了我也想学习，可是我就是笨，学不会，未之思也，夫何远之有，如果我们真的想学习，何远之有？一步一步往前走，千里之行，始于足下。</span></p><p><span>有的人说了，我一定做好这个事情，可是太难了，我不会，未之思也，夫何远之有？所以这两句话，适合任何事情，当出现不会做的时候，我们觉得太难的时候，问问自己真正思了吗，真正想去做了吗，如果想去做，根本不远，我们觉得远是因为真的没有想去做。</span></p><p><span>“孟子曰：‘王之好乐甚，齐其庶几乎？’”孟子和齐宣王的一段对话，他说齐宣王，王喜欢音乐，到了一定的程度，国运就可以开始兴旺了，人民就可以治理了，为什么呢？在那个时代礼乐是不分家的，喜欢乐的人，懂乐的人一定是知礼的人。</span></p><p><span>我们现在的时代背景不一样，喜欢音乐到了极点的人，这个人对礼也是到了极点的人，那个时候提倡以礼治国，如果我们喜欢音乐到了极点，知礼到了极点，国运就要开始兴盛了，百姓就可以治理了。“予于科名亦然。”我对于考取功名这件事情和孟子是一样的。</span></p><p><span>为什么要讲《了凡四训》这本书？本身是个家训，是了凡先生写给自己儿子的。有很多人会觉得《了凡四训》写的是不是太简单了，大家更愿意学那些，高深的深奥的法，这个好比是我们建房子建楼，《了凡四训》就相当于是地基。</span></p><p><span>我们看他讲的都是改过，都是行善，都是谦虚谦德，都是如何安身立命，讲了一些最初级的事情。如果我们地基打的不稳，我们修行也好，做学问也好，不懂得改过，不懂得行善，不懂得谦虚，即使我们学了那么多深奥的道理，根基不稳，往上越走越偏。</span></p><p><span>现在的情况是，很多人学了很多的知识，明白了很多的道理，但是自己的行为，并未真的发生变化，也没去做过一些有利于他人的事情，也不愿意去做，积德行善的事情。我们一定要懂得从根基开始学，我们的根基打得越扎实，我们将来的学问，才可能做得更高，我们的福德才可能更旺，我们的智慧才可能更究竟，所以这是根基，需要我们很扎实的把他做牢的事情。</span></p></div>"
}]