[{
    "title": "《中庸》第一讲 率性谓道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第一讲 率“性”谓道</strong></span></p><p><span><strong>天命之谓性，<strong>率性之谓道，</strong>修道之谓教，道也者，不可须臾离也；可离，非道也。</strong></span></p><p><span>《中庸》是《礼记》中的一篇，我们之前学《大学》，现在来学《中庸》。整个《大学》告诉我们：<strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>告诉我们：“自天子以至于庶人，壹是皆以修身为本。”告诉给我们一个方向，要懂得修身的。</span></p><p><span>  具体如何去修身？如何去让自己的行为去合道，到底怎样去修呢？这个时候我们就开始要更深入地去学习中庸之道了。</span></p><p><span>《中庸》就是具体告诉我们，该去如何修正自己的身和行为的。《中庸》的作者叫做子思，我们后世称为子思子，加上一个“子”是尊称。子思是孔子的孙子，是《大学》的作者曾子的弟子，他又延续了孔子的思想，延续了曾子的思想，写出来了《中庸》。</span></p><p><span>《中庸》开篇给了我们三个概念：第一个概念叫做<strong>“天命之谓性”</strong>；第二个概念<strong>“率性之谓道”</strong>；第三个概念<strong>“修道之谓教”</strong>。</span></p><p><span>先说第一个：“天命之谓性”。什么叫作“性”？天赋予给我们每个人的力量，天赋给我们每个人的那个东西，就叫“性”。不光是人，所有的众生都有那个“性”，这个“性”是我们每个人的内在本自具足的。</span></p><p><span>用王阳明先生的话讲，叫作“良知”。但是“良知”绝不是“性”。为什么我们说“良知”是“性”呢？是让人方便去理解。我们用“良知”来代替这个“性”，我们能更好地理解“性”是什么。</span></p><p><span>这个“性”他本身是干净的、是纯洁的、是一丝不染的、是至善的、是至纯的。至善就是没有一丝的恶。当没有一丝的恶的时候，就是无善无恶。所以阳明先生同时又讲：“无善无恶心之体”，《大学》又讲：<strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>当达到至善的时候就无善无恶了。</span></p><p><span>平时我们为什么说有善有恶？为什么要说止恶扬善？因为还有恶。当达到至善的时候，他是没有善恶的；达到至纯的时候，他是没有一丝的杂染，没有一丝的杂念，没有一丝的欲望的。</span></p><p><span>为什么说人人皆是仲尼呢？就是人人都是圣人，他是人本有的天性。所以“天命之谓性”，这个“性”是每个人本自具足的，只不过我们很多人不知道我们还有一个东西叫作“性”，而这个东西体现出来的才叫“道”，这个“性”不是“道”。</span></p><p><span>为什么所有的圣贤都在告诉我们：“你要懂得向内求，因为你本身就是具足的。”我们本来的“性”和圣人是无二的，没有区别。那个“性”是每个人都一样，都是圆满的，只不过我们没有见到那个“性”。</span></p><p><span>率性之谓道。率的“性”是什么“性”？我们刚才讲的“天性”。你率这个“性”而为，就是道本身。因为他是至善的，他是至纯的，他是至真的，他是和圣人没有分别的。你怎么去做，怎么去行都是道，所以“率性之谓道”，自然就是顺道而为，顺道而行的。</span></p><p><span>第一个概念：“天命之谓性”，告诉我们要懂得见“性”。“率性之谓道”告诉我们知“道”，你要先知道那个“道”。</span></p><p><span>“修道之谓教。”你知道有那样一个“性”，你知道了原来率“性”而为，就是“道”本身。那如何才能让我们知“道”，如何才能让我们见“性”呢？从修道开始。“修道之谓教”,教是什么呢？教化、教育、效法之意。</span></p><p><span>修道在修什么？在修自己，让自己合道。“道”不用修，“道”本身就在那里运行。“性”也不用修，“性”每个人本来就是圆满和具足的。为什么叫明心见性呢？当你的心明了以后，自然就是见“性”的。所以我们修道是修己，让自己去合道就可以了。</span></p><p><span>我们经常说一个词——修身养性。修身修什么？修我们的行为，让我们自己的行为符合至善、至纯、至真。养的是什么呢？养的是我们的天性，不是人性。人性是贪婪的，因为人本身就是因为欲念而生，当我们为了得到很多东西的时候，自然体现的就是人性的贪婪的那一面，他是正常的情况。所以我们养的“性”不是人性，是天性。</span></p><p><span>修身不断地修正我们自己的行为，让我们的杂念变少、欲望变少、至善、至纯、至真，这个时候滋养的是我们的天性。</span></p><p><span>为什么我们经常讲：“修行的起步一定是止恶扬善。”我们只有符合善，才能滋养天性。如果我们的行为是不符合至善的，不是至纯的，那个时候我们滋养的都是人性，都是人性贪婪的部分。</span></p><p><span>所以修身滋养的是我们的天性，就是这句话——修道之谓教。我们按照道的规律去修正自己，我们就是在教化自己、教育自己，效仿天地的圣贤之道。</span></p><p><span>我们为什么要学习圣贤的文化？不是在效仿吗？是在效仿圣贤告诉给我们那些道，然后用来修正自己，这个叫修道。</span></p><p><span>我们天天讲的修道，绝非是道家之意，儒家依然有“道”，这个“道”是通用的，这个是世间万物运转的法则规律。所以他不是专属于某一家，只不过每一家的叫法和给我们的言语的力量和说辞不同。道家讲的是自然规律，儒家讲的是中庸之道、大学之道，都一样的。</span></p><p><span>修道，外在修我们的行为，内在让我们回归天性。注意不是修“性”，是回归，因为“性”我们本来就是具足的，本来他就是无所不知的，他和圣贤是一样的。所以让我们的行为去符合善道，自然就回归本性。所以道家叫“去欲还本，返璞归真。”都是归到最后的“性”上来。</span></p><p><span>“修道之谓教”，就是自觉和觉醒的过程。同时修道不光是要修己的，我们还要去觉他的。“大学之道，在明明德，在亲民，在止于至善。”明德是内修，亲民是帮助他人，才能止于至善，达到至善就无善无恶了，就回归那个“性”了。道家叫正己化人。</span></p><p><span>所有的文化都在告诉我们道理，修道绝不是只单单修己，不够的。我们单单去修己，不可能回归到那个“性”。</span></p><p><span>我们说：<strong>“人法地，地法天，天法道，道法自然。”</strong>我们这个时候来效仿天地之道，我们看看天地他都不是自私的，他是照耀万物的，他是滋养万物的，才能回归到那个“性”。</span></p><p><span>学儒家文化，不光是我们自己要学习圣贤文化，要修行圣贤文化，我们还要教化他人的。所以这个是修道的全部过程，一个是自觉、觉醒，然后不断地去觉他、利他，我们才能让自己达到至善，否则达不到的。</span></p><p><span>所以修行绝非自私自利，一定是肩负他人的痛苦，肩负他人的慧命在身的，不停地去救人慧命，不停地去教化他人，去影响他人，才能让我们回到本性上去。</span></p><p><span>但是这里有一个次第：“在明明德，在亲民”、“自觉觉他”、“正己化人”。都是先修己，再利他。当我们自己有了一定的水平、智慧或者说文化，或者有一定的善良的时候，这个时候我们在不停地帮助他人的过程当中，更加增加自己的德行，彰显自己的智慧，去激发自己内在的良善。</span></p><p><span>当我们不断地去修正自己，不断地去利益他人，自己的私欲变得越来越少，杂念变得越来越少，我们那个“性”就会显现的越来越多，他是逐步修出来的。</span></p><p><span><strong>“道也者，不可须臾离也。”</strong>须臾：是片刻的意思。“道”不可片刻离开的。我们生活当中其实处处是“道”，无处不“道”，只是我们不知道那个叫“道”。</span></p><p><span>举个例子，我们渴了要喝水，是不是“道”？我们饿了要吃饭 ，是不是“道”？每天太阳东升西落，是不是道？春夏秋冬的变化，是不是“道”？都是“道”。所有的一切，万物都是遵“道”而行，都是在“道”当中运行的，我们每天都在用着“道”而不自知。</span></p><p><span>我们学习修道是为了什么呢？就是让我们了解道的运作规律，了解自己的“性”体，然后我们去遵道而行，自己才能合了道。</span></p><p><span>道的规律是不变的，但是修的是我们自己，让我们自己更合道，本来的“性”才能凸显出来。所谓的“道”都是方便法，都是这些圣贤告诉我们“道”的运行规律，从多方的角度去给我们解释了什么叫“道”，都是为了让我们能参透，遵道而行。</span></p><p><span>这个时候我们的行为才是合道的，只有我们的行为合了道，我们才能见到自己的“性”，因为我们沾染了太多的尘埃，沾染了太多的欲望和杂念，不停地去擦拭，然后显现出来我们那个本性，所以这个就是修行的次第。</span></p><p><span><strong>“可离，非道也。”</strong>他是片刻不能离开的，如果能离得开的就不是道了。所以“道”他是万事万物运转的规律，运转的法则。</span></p><p><span>包括我们平时生活当中，有智慧的人看到一件事情的发生，甚至听到一个人的言行，看到一个人的举止，他接下来会知道发生什么事情，为什么呢？万事万物都有规律。我们经常讲：说感情突然不好了，生意突然不好了。这个时候如果我们身边有一些有智慧的人，他早就已经看出来，将来会不好的，因为符合“道”的规律。</span></p><p><span>就好比是我们现在跟着修行，学习了五、六个月以后的人，我们注意去观察生活当中的事情，会发现很多事情就知道结果了，一点都不神奇，任何事情的发展都有其规律的。</span></p><p><span>我们举两个生活中的例子，为了方便大家去理解。比如说我们到一个地方吃饭，我们到了这个地方吃饭，我们看到这里的老板、这里的服务员的服务态度，他如何待人接物，我们吃到他饭菜的口味，知不知道他的生意将来会做得怎么样？这就是“道”，这就是规律。</span></p><p><span>那我们去做任何事情不是一样的吗？包括老人经常告诉我们：“人一定要懂得谦逊，不要狂妄，<strong>‘天狂必有雨，人狂必有祸。’</strong>”这不是“道”吗？</span></p><p><span>生活当中比比皆是，他片刻都不曾离开过我们，只不过我们明白了“道”的运作规律。通过诸位圣贤所教给我们的道理，我们明得越多，行为自然就会受到约束，自然就会让自己合道。我们越是合道，“性”自然就会显现出来。</span></p><p><span>所以明心见性，就是这样的过程。是我们不断地明达，不断地了悟自己的那颗心，我们了悟的越多，行为越至善，我们的性体自然就露出来了。</span></p><p><span>那个“性”是不用修的，原本具足。那要修的是什么呢？是我们这颗被污染的心、被污染的念头、被这些念头所支控的我们的这些行为，要修正的是这些。当我们不断地修正自己的行为，就回归本性了。</span></p><p><span>万事万物的发展都有其规律。举例子，院子里开的樱花，忽然有一天下完雨，开门怎么满院子的花？我们说突然开花了。突然吗？它都已经长了十年了。没开花之前，它已经在默默地生长了，只不过我们没注意，它那个结果还没有凸显出来，这不是“道”的规律吗？</span></p><p><span>所有的事情都有其痕迹，都有其规律，只不过是我们没有发现，我们学习和修行的过程是不是这样的？所以大家真的不要着急。说：“我学习了两个月、三个月，我没有变化。”我们没有积累到一定的程度，就像院子里那个花一样。当我们积累到一定的程度，别人看到的是我们突然之间盛开了，这就是“道”。</span></p><p><span>生活当中到处都是“道”，处处都有规律。我们越是明白事物的发展规律，有什么可着急的？着急就是拔苗助长。看似花开了，会发现它开得不长久，开完了明年不开了，因为它的根损坏了。所以所有的事情都一样。</span></p><p><span>为什么修行是需要我们拿出一生的时间，不停地去修内在？因为内在的根有了，我们只会盛开得越来越好。可要是通过外在所学习的方法，他只是一时的，他只是表面功夫，他叫花拳绣腿，当下看似盛开了，养不长久的。</span></p></div>"
},{
    "title": "《中庸》第二讲 君子慎独",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二讲 君子慎独</strong></span></p><p><span><strong></strong></span></p><p><span><strong>是故，君子戒慎乎其所不睹，恐惧乎其所不闻。莫见乎隐，莫显乎微，故君子慎其独也。喜怒哀乐之未发，谓之中；发而皆中节，谓之和。</strong></span></p><p><span>上一讲告诉我们“修道之谓教”，又告诉我们“道不可须臾离也”，片刻都不曾离开过我们，如何去修道呢？</span></p><p><span><strong>“是故，君子戒慎乎其所不睹，恐惧乎其所不闻。”</strong>君子是如何修道的？“戒慎乎其所不睹，恐惧乎其所不闻”，别人看不见的地方，别人听不见的地方，我们自己也要保持戒慎，就是很小心，很警戒，很谨慎的样子，恐怕自己违了道，恐怕自己行为是不合道的，即使别人看不见、别人听不到，我们也是这样修正自己的。</span></p><p><span>注意，我们这样修是不是为了给别人看的？不是吧，为什么？因为我们要持的是道德本性。那个“性”他一直都在那里，道的运作规律就在那里，不在有没有人看。就像外面的花，我们看或者不看，都会开放。日出时，我们看或者不看，它都会升起，到了时间它都会日落，这就是道。</span></p><p><span>道不是为了给别人看的，所以我们修行是给自己修的，不是表现给别人看的，这个就是道的运作规律。即使没有任何人看见听见，我们也是小心的、是谨慎的、是恐惧的，恐怕自己违了道。</span></p><p><span><strong>“莫见乎隐，莫显乎微。”</strong>隐就是很隐蔽，微就是很小。即使在很隐蔽的地方，在很小的事情上，道还在，因为道是无处不在的，不曾片刻离开我们的，所以让自己合道，即使再隐蔽的地方、再小的事情上道都在。</span></p><p><span>比如我们喝水，难道没人看见的时候，我们就不喝水了吗？我们饿了，难道没人看见的时候，我们就不吃饭了吗？是不是依然得吃饭，依然得喝水，这就是道。所以修道不是修给别人看的，是在修自己的道德本性，因为他是无处不在的。</span></p><p><span><strong>“故君子慎其独也。”</strong>所以说君子一定是修慎独的，就是自己独处的时候，依然很谨慎的在要求自己的行为，约束自己的行为，又让自己保持独觉，独立思考的一种状态上。</span></p><p><span>有句话讲的特别好，慎独是最高级的独处方式，那一个人怎么才能变得从容自在？就是自己独处的时候和他人相处的时候都是一样的，不用去刻意，不用去假装，这个时候我们就是自在的。</span></p><p><span>为什么说慎独是最高级的独处方式呢？比如，尤其是跟着我们学习和修行了几个月的朋友，有没有发现越来越喜欢独处？越来越喜欢安静，为什么呢？我们不需要再去依靠外界、依附外物，让我们快乐，我们自己坐在这里就是喜乐的，就是自在的，所以慎独修到一定的境界，是很高级的。没事情的时候我就安住在当下，就是定在这里了，有事情的时候我随时可以动。</span></p><p><span>慎独是不是一样的？没有人的时候就我自己，我也这个样子。比如自己坐在这里一句话不用讲，甚至一个念头都不用起，坐在这里就是喜乐自在的，需要用的时候，我们念头就起了，需要讲话的时候我们就讲，不需要讲话的时候又是安然恬静自在的样子，所以我们不停地去修自己的慎独，我们内在就会变得非常的从容，非常的淡定。</span></p><p><span>慎独绝非是在约束自己的行为，很多人刚开始接触慎独这个词，会认为那多辛苦，多累呀，自己的时候还要保持行为端正，太累了。儒家叫礼，就是要守礼法，也是在约束自己的行为，这个只是起步阶段，再往上修的时候叫“不礼而礼”，我们也不需要再去守礼，因为本然就已经变成这个样子了。</span></p><p><span>刚开始我们修行的时候，要不停地转变自己的念头，遇事情的时候告诉自己不要急躁，不要抱怨和指责，这是不是都在转变自己的念头？可是当我们转变到一定程度的时候，会发现现在遇事情怎么不急了呢？碰到事情怎么就不抱怨了呢？这个时候还需要求自己再去转念头吗？不用了，已然就是这个样子了。所以说慎独再往上修的时候，不需要任何刻意的成分，因为我们已然变成那个样子了。</span></p><p><span>“莫见乎隐，莫显乎微。”即使在很隐蔽的地方、很小的事情上，行为也是处处合道的。我们只有在合道的时候，我们的性体才能出来，所以修行不是给任何人看的，不是给任何人听的，而自己内在的喜乐、内在的从容，只有我们自己是最清楚的。</span></p><p><span>这里给我们提出了一个方法，即使没人的时候，没人听到、没人看到的时候，我们也是这样去修正自己的。没人看到的时候，我们都能去这样修正自己，在有人看到的时候，是不是自然呈现出来的就是这样的状态？所以这是修道的过程。</span></p><p><span>如果这里告诉我们，有人的时候要如何去修行，是不是不够深入？我们以为没人的地方就不用修行了？不是的。道是无处不在的，跟是否有人没有关系。我们都是在让自己时时刻刻持的道的运行规律，持的是道的本体，让自己去回归天性。</span></p><p><span><strong>“喜怒哀乐之未发，谓之中，发而皆中节，谓之和。”</strong>现在我们又开始换一个概念了，如何去修道？整个《中庸》所阐述给我们的理念，都是分为体和用的。比如，中和庸，中是体，庸是用。“天命之谓性”，性是体。“率性之谓道”，道是运转的规律。“修道之谓教”，教是外用的。</span></p><p><span>接下也是一样的，“喜怒哀乐之未发，谓之中”，中是道体，是道的本体。“发而皆中节，谓之和”，和是外用。</span></p><p><span>我们先来讲“体”，“中”，喜怒哀乐是我们的情绪，未发是什么意思呢？未生发，没有，没有喜怒哀乐这是“中”。</span></p><p><span>比如说我们去看天地，看太阳，它有喜怒哀乐吗？没有吧？包括我们去看这些圣贤，他有喜怒哀乐吗？没有吧。这个时候可能有朋友说：“有，我看圣贤也哭，颜回去世的时候，孔子也痛哭啊！”注意啊，发而皆中节啊，看似的有，其实是外用。</span></p><p><span>《道德经》讲：<strong>“圣人无常心，以百姓心为心。”</strong>他是没有自己的心，没有自己的喜怒哀的，为什么人们看到的是有呢？发而皆中节，比如，喜怒哀乐，没有喜怒哀乐谓之中，是道体，道体能不能用？</span></p><p><span>道体本身是不能用的，但是要想用的时候怎么用？发而皆中节，谓之和，但是一定要先修到“中”，我们的“发”才能“中节”，当我们喜怒哀乐都没有的时候，是符合“中”的，然后接下来“发而皆中节”,中节都是适度的，恰到好处的叫中节。</span></p><p><span>如果我们是有喜怒哀乐的情绪在的，还有可能发而皆中节吗？不可能吧，发的都是不适当的。</span></p><p><span>举个生活中的例子，比如，一些优秀的企业家或者我们身边优秀的老板，开会的时候，他跟大家在拍桌子，在起情绪，在发火，转身以后他该喝茶喝茶，该做事情做事情，这个叫“发而皆中节”。因为没有喜怒哀乐，谓之中，但是要想用，中是没法用的，所以“发而皆中节”是外用，要不要用方法呀？要的，方法就是和，用的过程就是庸。</span></p><p><span>包括我们去看电视，那些圣贤的帝王是不是就是这样的？看似上早朝的时候发怒、发火，是在用，那是一种方法，这个时候他的境界是不一样的，要想发而皆中节，我们就让自己符合中的状态，把自己的喜怒哀乐倾向于没有，这个时候才能找到道体，自己本身是没有情绪的，“发而皆中节，谓之和”。我们经常讲一个词，叫以和为贵。</span></p><p><span>再举个例子，刚才我们说的孔夫子，在颜回去世的时候，孔夫子很痛苦，大哭，如果这个时候不哭，合不合适？不合适吧？这么心爱的弟子去世了却不哭。</span></p><p><span>再举例，我们修道之人，再讲回生活当中，我们都知道生老病死，像自然规律一样，每个都无法避免，有亲人离世的时候，身边的亲人朋友发生了一些让他们自己觉得很痛苦的事情，我们要不要跟着伤心一下？要吧，这个就是谓之和，因为要恰如其分才叫和。如果人家都在哭，我们在笑，合适吗？不合适吧，但是真的内在有多痛苦吗？不是，因为我们明白这些事情，每个人都要经历的，所以这个叫和。</span></p><p><span>以和为贵，是任何事情都恰到好处。我们再讲有的人为什么要发怒？因为做某件事情的时候，需要展现情绪出来，但是一定是适度的，一定是适宜的，所以是方法。</span></p><p><span>中是道体，和是所有达到的结果，用的过程就是庸，所以庸是体和用之间的过程、方法。道家一开始也是讲“有”，有之后上一个境界是要讲无的，“致虚极，守静笃，万物并作，吾以观其复，讲无，什么都没有，无以后怎么办？有无相生。</span></p><p><span>这里告诉我们“喜怒哀乐之谓发，谓之中”是道体，要修到中，然后“发而皆中节，谓之和”，到了和，不是比中低了一个境界，是高了一个境界，当修到中时，会发现再上一个境界我们不是有自己的喜怒哀乐，而是为了那件事情的和，为了所有事情的运作规律，这个时候来发而皆中节，这个比中其实又高了一个境界。</span></p><p><span>道家讲的有无相生，圣人无常心，以百姓心为心，为天下浑其心。这些圣贤之人，他没有自己的喜怒哀乐，可是他留下来做什么呢？来教化众生。</span></p><p><span>比如孔夫子会说：<strong>“朝闻道，夕死可矣。”</strong>孟子会说：<strong>“夭寿不二。”</strong>既然夭寿不二，干嘛还要留在世上？因为这个时候他要用，还有那么多迷途当中的人们，还有那么多人要等着破迷开悟，所以留下来做的事情都是和。</span></p></div>"
},{
    "title": "《中庸》第三讲 君子中庸",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三讲 君子中庸</strong></span></p><p><span><strong>中也者，天下之大本也；和也者，天下之达道也。致中和，天地位焉，万物育焉。</strong></span></p><p><span><strong>仲尼曰：“君子中庸，小人反中庸。君子之中庸也，君子而时中；小人之中庸也，小人而无忌惮也。”</strong></span></p><p><span><strong>“中也者，天下之大本也</strong><strong>。”</strong>中是天下之大本，什么叫本？根本叫本，中是根。好比是一颗树，有根才能存活的。修行要先修到中，才能有和，才能有庸。中庸，中是体，庸是用。就好比刚才我们讲道家有无相生，要修到无，才能有无相生，如果没有达到中，没有找到本，那个时候不叫庸，叫动。</span></p><p><span>中是道的本，庸是符合中的状态下用的，但是如果不懂得中，没有去修中，那个时候不叫庸，叫动，会随着自己的妄念在动，随着自己的欲望在动，随着自己的杂念在动。</span></p><p><span>根本是什么？就是丢不掉的东西，就好比是一个树，要把树根丢掉了，还有树吗？根本就是不可丢掉的东西。中也者，天下之大本也，这是我们修道的根本，是不能丢掉的，如果把他丢掉了，就没有庸了。</span></p><p><span><strong>“和也者，天下之达道也。”</strong>如何去达道、如何去达中？要去修和，《论语》讲：<strong>“礼之用，和为贵”，</strong>以和为贵，礼是用来做什么的呢？是达到“和”，所以我们中国文化自古以来都讲一个“和”字，和是所呈现出来的结果。</span></p><p><span>礼是做什么的呢？是辅助我们达到那个结果，达不到“和”怎么办？用礼来约束自己的行为，才能逐渐地达到和。</span></p><p><span>“和也者，天下之达道也”，每件事情的结果呈现出来的都是和谐的，才能趋向于“达道”，所以中和庸又是相互作用，要明白我们往“中”去修，用出来的是“庸”，所达到的结果是“和”。</span></p><p><span>反过来也是一样的，我们一下达不到中的状态怎么办？去修“和”，所做事情的“和”越来越多，我们自然就倾向于回到“中”的状态，所以是相辅相成的。</span></p><p><span>现在经常讲一个词——法治社会，孔子是提倡以礼治国的，是提倡以仁治国的，但是礼和法是不分家的，所以叫礼法。儒家提倡以礼治国，法家提倡的是以法治国，法家说不需要那么多的仁，不需要那么多的礼，直接制定法律法规就可以了。</span></p><p><span>儒家和法家，礼和法没有哪个好哪个坏，看用在什么时代、什么样的社会背景下。我们现在这个时代，需要礼又需要法。法是为了辅助礼的执行，如果没有法，礼不成立。因为不合礼的事情，就要受到法律的惩罚，所以是辅助礼的推广的。</span></p><p><span>为什么儒家要提倡以礼治国呢？当每个人都懂得修自己的内在，让自己如礼的时候，自然就如法了，如礼的时候不是为了少触犯法律吗？所以这个是在教化我们的道德观念，抓我们的精神文明，所以礼和法是不可分开的。</span></p><p><span><strong>“礼之用，和为贵”，</strong>为什么要用礼和法？因为我们要创造一个和谐的社会，如果我们内在的心念变得善良，变得为他人着想，变得没有那么多的私欲，又何需法律呢？我们自己是懂得礼的，这个时候礼的作用，就是以和为贵。</span></p><p><span>我们刚开始修行的时候，很多人说：“中修不到呀，太难了怎么办？”修“和”，去看一看身边发生的每一件事情，是不是“以和为贵”的？若所有做事情的出发点，我们的念头和行为都是以和为贵的，喜怒哀乐自然就开始变少，就趋向于“中”的状态。</span></p><p><span>比如大家在一起修行做事情也是一样，发生了一个什么事情，本来是要发怒、发火的，但是想到以和为贵，不能因为我的怒气让别人不开心，导致我们整个团队的事情没有办法往下进行，这是不是在约束自己的行为？我们想的是“和”，行为自然就会受到约束，“我不能发火，我不能发怒”，我们在平息自己的情绪，就是“戒”和“礼”的作用。长此以往，遇到事情都是用礼来约束自己的，喜怒哀乐就会变得越来越少，越来越少，最后趋向于“中”的状态，所以中庸是反复地用，反复地修正的过程。</span></p><p><span>达不到“中”时，我们就去修和，所以告诉我们“和也者，天下之达道也”，我们修和，就是通往“达道”，通往“中”的路上。</span></p><p><span><strong>“致中和，天地位焉，万物育焉。”</strong>致中和，天地就会各归其位，找到自己的位置，万物自然生长和发育。致中和才是道的全部，只有“中”没法用，只有“和”，达不到道体“中”的状态，所以“致中和”既有体又有用。</span></p><p><span>“天地位焉，万物育焉”，天地各归其位，按照自己的位置去运转，万物自然就生长，如果不是各归其位，天下就会大乱。</span></p><p><span>比如，我们讲太阳该出来的时候不出来，不该出来的时候出来了，是不是万物就开始乱套了？比如大地滋养万物也是一样的，不曾有任何的私心和偏差，不会因为哪个花朵长的好看去多给它一点土，哪个长的太丑了就少给点土，他只是按照自己的规律去运转，万物才能自然生长。</span></p><p><span>我们每个人是不是这样的？在一个企业当中，做老板的要做好自己位置该做的事情，做员工要做好自己位置该做的事情。素其位，各归其位的时候，会发现整个公司自然就是运转的状态。</span></p><p><span>儒家为什么要讲五伦关系呢？君就是君，臣就是臣，父就是父，子就是子，各归其位的时候，所有的事情都会按照既定的规律去发展。</span></p><p><span>为什么会有天下大乱？君不像君，臣不像臣，做君主的没有做君主的样子，做臣子的不服从君主的管制，天下就乱了。在一个家庭当中是不是如此？做父亲的如果没有做父亲的样子，做母亲的如果没有母亲的样子，做孩子如果不懂得孝顺，整个家不是就乱了吗？</span></p><p><span>“致中和，天地位焉，万物育焉”，所有的事情都是如此，当懂得“中”的状态，当懂得“和”的外用，所有的事情都会各归其位。如果有不归其位的，我们懂了“中”和“和”的道理，一看到事物的发展，就知道接下来该发生的事情，因为我们通过不断地学习，掌握了道的运作规律，就知道不归其位的时候，接下来就要乱了。</span></p><p><span>仲尼曰：<strong>“君子中庸，小人反中庸。”</strong>君子是依乎中庸之道来修正自己的行为，来做事情的。《中庸》开篇就讲到“见性”、“知道”，讲到“修道”，告诉我们道就在我们的生活当中，不可须臾离也，离不开我们的生活。</span></p><p><span>我们的生活的点点滴滴，我们的行为、工作，我们立足于天地之间，都是按照道的规律在运行，所以君子的行为是依乎中庸之道，去修正自己去做事情的。而小人反中庸，反是违背的意思，小人就是不懂得修身的人，做事情是违背中庸之道的。</span></p><p><span><strong>“君子之中庸也，君子而时中；小人之中庸也，小人而无忌惮也。”</strong>君子所依附的中庸之道，君子而时中是什么意思？“时”是时时刻刻的意思，时时刻刻都在依附着中庸之道，都在依乎中庸之道去行事，时时刻刻警醒自己，要依乎中庸之道，不要有偏差，都在依乎着自己的本性，他是至纯、至真、至善的，时时刻刻都在警醒自己莫显乎隐，莫显乎微。</span></p><p><span>小人的中庸是什么呢？无所忌惮也，很多人刚开始学习的时候，都会有这样的困惑，为什么我们越学习越要严格要求自己？而那些不学习的人就可以肆无忌惮地做事情？因为还不懂得修身，做事情是无所忌惮的。</span></p><p><span>就像是我们在没有学习、没有修行之前，不也是如此吗？想发脾气就发脾气，想说伤害他人的话，就伤害他人，想做出伤害他人的行为，我们就去伤害他人，这就是无忌惮也，无所忌惮。</span></p><p><span>可是我们越学习，会越谨慎、越小心，因为我们开始依乎中庸之道了，只有我们依乎中庸之道，才能见到原本的本性，才能找到圆满具足的我们。</span></p><p><span>如果我们是无所忌惮的，只会离道越来越远，是背道而行的。所以说君子时时刻刻地都在警醒自己，让自己去依乎中庸之道，只有我们依乎中庸之道，我们的本性才能回归最纯良的状态，我们做的事情也才可能做好。</span></p><p><span>当我们懂得修正自己的时候，越依乎中庸之道，在做事情的时候，我们内心会变得更坦然。《论语》里面讲：“君子泰而不骄，小人骄而不泰。”什么意思呢？孔子告诉我们，君子是很泰然、很安然自若的，不骄。骄是什么？骄傲、傲慢、焦虑、恐慌，君子做事情是很泰然很坦荡的。</span></p><p><span>我们如何才能坦荡呢？得依乎中庸之道，不断地去修正自己，不断地去要求自己的时候，内心是无所恐惧的，是懂得向内求的，不会再去抱怨和索取，也不会去焦虑和恐慌，这个时候才能回到泰然自若的状态。</span></p><p><span>而小人骄而不泰，每天活在傲慢当中、每天活在无礼当中、每天活在情绪当中，出现事情就开始恐慌，出现事情就开始焦虑，为什么呢？小人，不懂得修身的人，难道不清楚自己的行为是不对的吗？清楚，可是自己总认为自己无法修正，就开始无所忌惮，所以就只会越来越焦虑，越来越恐慌，总活在担心和忧虑当中。</span></p><p><span>比如总担心对方离开我，为什么担心？明知自己的不足；担心老板炒我鱿鱼，为什么担心呢？知道自己做得不够好；担心生意不好、客户不再回来，为什么担心？我们自己明白付出得不够多。</span></p><p><span>所以我们如果不是依乎中庸之道、不断地去修正自己，让自己回归本来的天性，不让自己去合道，我们每天都活在忧虑当中。</span></p><p><span><strong>“君子居易以俟命，小人行险以侥幸。”</strong>君子依乎中庸之道，是居易以俟命的，把最简单的事情、最容易的事情反复地做好，等待天命就够了。我自己是合道的、遵道而行的，自然有天命赋予给我们，肯定是泰然自若的。小人做事情是行险于侥幸，靠侥幸心理做事情。</span></p><p><span>比如说今天做生意，担心生意不好，为什么呢？不确定性呀。如果是君子，依乎的是中庸之道，我们是懂得不断地向内求的，我们发心是不是至善的？是不是至真的？我现在做的生意能不能给他人带来利益？是不是为他人着想的？有没有努力地改正自己、提升自己？</span></p><p><span>如果我们是这样做事情的，又有什么可担心的呢？还用担心生意不好吗？要是这样的状态在工作，还用担心老板炒我们鱿鱼吗？要是以这样的状态在经营家庭和感情，还会担心对方的离开吗？</span></p><p><span>如果我们不懂得依乎中庸之道来修正自己，只能活在焦虑和恐慌当中，我们发脾气的时候，我们做一些不好的行为的时候，当时是无所忌惮的，发生事情的时候就是恐慌的、焦虑的，因为我们在行险以侥幸。生意做得好不好看侥幸，因为我们也不确定；感情过的好不好，看缘分吧。</span></p><p><span>但是君子不是这样的，君子做事情是不停地去修正自己，让自己合乎于天道，时时刻刻来克己、来律己，所呈现出来的结果就是泰然自若的。刚开始大家一听到这段话，看似说君子其实更不容易，得时时刻刻地修正自己。小人为什么可以肆无忌惮呢？因为种的因不同，结果不同。若时时刻刻在克己，所得到的结果就是泰然自若，我们的行为、做的事情就是合道的，结果自然就好。</span></p><p><span>而不懂得修身的人，过程中种因的时候是无所忌惮的，随意发脾气，随便做一些不好的行为，那个结果自然呈现的也是不好的。</span></p></div>"
},{
    "title": "《中庸》第四讲 中庸至矣",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第四讲 中庸至矣</strong></span></p><p><span><strong>子曰：“中庸其至矣乎！民鲜能久矣。”子曰：“道之不行也，我知之矣：知者过之，愚者不及也。道之不明也，我知之矣：贤者过之，不肖者不及也。人莫不饮食也，鲜能知味也。”</strong></span></p><p><span><strong>“子曰：中庸其至矣乎，民鲜能久矣。”</strong>孔子说中庸的道理可以说至高无上了，鲜是很少的意思，久是很长时间，很长时间都没有人能做到了。</span></p><p><span>孔子讲这句话也是有时代背景的，在春秋兵荒马乱、礼崩乐坏的时代，人们都在想着如何去争权夺利，如何让自己过得温饱和安逸，所以人们对于文化的追求没有我们现在这个时代更强盛和更需要。</span></p><p><span>我们现在生活在一个衣食富足的时代，有了物质文明的基础，现在追求的是精神文明，也是现在国家的导向，在推行国学、推行传统文化，所以这个时代的我们比孔子那个时代应该更有追求精神文明。</span></p><p><span>所以这个时代出现的智者，愿意去修行的人，愿意去学习的人，也会更多，要不然也不会这么多朋友在听《中庸》，也不会有这么多的老师在讲传统文化，所以说孔子的这句话，有他的时代背景。</span></p><p><span>可是到了这个时代，我们要勉励自己反过来听，虽然很少有人能做到，虽然很久没有人能做到了，但是我们要勉励自己做一个躬行君子，让自己依乎中庸之道。</span></p><p><span>孔子接下来又讲了，为什么很少有人能依乎中庸、很久都没有人做到了呢？原因孔子是知道的。</span></p><p><span>子曰：<strong>“道之不行也，我知之矣，知者过之，愚者不及也。”</strong>孔子说：“道之不行，我是知道的。”道之不行就是行不通、不能流行、不能流通。说我知道什么原因，知者过之，愚者不及。聪明的人过了，愚者想去依乎中庸，想去听明白中庸在讲什么，又听不懂。</span></p><p><span>到了我们现在这个时代，依然如此，有很多自诩为聪明的人，一听道理都懂。所以现在最流行的这句话：“不用给我讲那些，道理我都明白。”什么都懂，就是过不好，什么都懂，却活得不潇洒、不自在，为何呢？就是知者过之，自以为聪明，觉得自己很懂，当觉得自己很聪明的人，就不会去躬行的。</span></p><p><span>太聪明的人，很难脚踏实地去做事情，因为他以为都看懂了，以为都明白了，别人做事情的时候，他还觉得很傻，别人在努力修行的时候，他还认为那个东西没有用，自古以来都是这样的。</span></p><p><span>为什么叫小聪明大智慧呢？聪明反被聪明误，比如我们看电视其实也是一样，会发现某一武侠门派，最后可能得了衣钵的人，往往不是最聪明的那个人，因为太聪明了，以为什么都能看懂，做文化和修行更是如此，真的是点点滴滴地积累而来的，绝不是能看懂的，所以叫悟道，叫做学问。古人的学问是要做的，我们的行为是要躬行的。</span></p><p><span>陆游有两句诗：<strong>“纸上得来终觉浅，绝知此事要躬行。”</strong>纸上得来的知识，终究觉得是浅薄的，觉知此事要躬行。我们真的要踏踏实实地做学问，踏踏实实地去修行，点点滴滴地去修正自己，让自己依乎中庸之道。</span></p><p><span>我们做事情不是如此吗？很多自以为聪明的人，一看就会，一做就废，看的时候都觉得看懂了明白了，一做的时候会发现根本就不明白，漏洞百出。因为觉得自己太聪明了，反而不会脚踏实地的去做事情，去研究里面的精髓。</span></p><p><span>我们不要去做那个太聪明的人，如果我们本身是一个聪明人，不是坏事，但是一定把聪明升华成为智慧，升华成为悟性，所以我们讲修行修行，修的是“行”，绝不是听就能明白的。</span></p><p><span><strong>“道之不明也，我知之矣。”</strong>刚在孔夫子说到：“道之不行，我知道原因了，太聪明的人，自以为是，他不去做；愚者呢，他又听不懂，所以道不行。”</span></p><p><span>接下来又说，道之不明也，道不行，也就进门的人少，进了门以后说，道之不明矣，进了门以后，不能修得很明达的人，进门的人本来就少，进来的人能修明达的人更少，原因我也是知道的。</span></p><p><span><strong>“贤者过之，不肖者不及也。”</strong>太过于贤的人过了，为什么呢？不懂得变通，太过于贤能、贤德的人，完全按照书本上所讲的，不懂得变通，就把书读死板了。所以古人才告诉我们：“与其全信书，不如不读书。”因为不懂得变通，不懂得温故而知新，不懂得我们要学习圣贤文化的义理，而绝非书面上的意思。</span></p><p><span>就好比学儒家文化，圣贤之人给我们举了很多那个时代的背景和案例，我们要从里面去思考和体悟，圣人后面要告诉给我们的是什么义理，而绝不是遵照那句话的表面意思。</span></p><p><span>举个例子，假设过去几百年以后，人们在看到我们这句话，也会不理解我们表达的意思是什么？也要再去查我们这个时代的背景。为什么要举这样的例子，查完之后要知道我们举例子背后想讲的道理是什么，不要执着于文字相，否则就太过了。</span></p><p><span>《论语》讲：<strong>“质胜文则野，文胜质则史，文质彬彬，然后君子。”</strong>质胜文则野，我们每个人都有自己本身的特质。举个例子，有的人口才好是特质，有的人做事很有冲劲儿这个是特质，有的人做事情很有毅力是特质，有的人很聪明这个是质。</span></p><p><span>但是质胜文则野，文是什么？内在的文化修养，口才好的人如果内在是没有文化修养的，是不是说出来的话就很粗野？我们叫野路子。比如，性格很有毅力，可是内在如果没有文化素养，是不是就变成了固执，所以这就是质胜文则野。</span></p><p><span>文胜质则史，就是只学文了，没有和自己的质相关联，史就是守旧的，这里提的贤者过之，跟那个意思是相近的，所以说我们一定要懂得文质彬彬，然后君子，文和质是相得益彰的，所以我们要多读书、多学习，但是要懂得和自己原来最本质的东西相关联、相契合，这样我们才能懂得变通，才能深得其义理。</span></p><p><span><strong>“不肖者不及也。”</strong>不肖者是不像个样子，不学习也不努力。我们说一个人不好怎么说？看那个人真不肖，不肖指的不是不孝顺，而是做事情的时候不像个样子，这样的人也无法把道修的明达。</span></p><p><span><strong>“人莫不饮食也，鲜能知味也。”</strong>开始总结了，我们人人都要吃饭的，很少能有人知其味了。我们每天都在吃饭，有几个人能吃出饭菜里的味道，这里指的味道不只是口感，是里面所含的营养，所需要的工序，跟我们人体的契合程度，我们为什么要吃这样的食物？有多少人研究里面的道理呢？</span></p><p><span>这句话是形容词，告诉我们什么呢？道就是在我们生活之中，道就在我们生活的点点滴滴，天地万物都是在道中运行的，又有几个人知道“道”的存在呢？又有几个人知道“道”的存在并且按照道的规律去修正自己，让自己符合道呢？</span></p><p><span>所以《中庸》开篇就告诉我们“见性”、“知道”，接下来告诉我们“修道”，就是告诉我们这些概念和次第，让我们按照道的规律不断地修正自己，让自己依乎中庸之道。依乎中庸之道就是在依乎圣贤之道，我们按照圣贤之道去修正自己，就可以把自己修成圣贤。</span></p><p><span>什么叫笃信好学？</span></p><p><span>之前讲《论语》有四个字，笃信好学，什么叫笃信好学？坚定不移的信，就是我们完全按照他说的去做，笃信这两个字很难做到。就是他告诉我们这么做我们就这么做，每天大家在一起，我所讲的话、做事情所信奉的准则、包括我们在一起调和所有的事情，哪个不是按照我自己讲的做的？就是我真的在照着做的，这叫笃信。</span></p><p><span>当我们不能笃信的时候，力量就减半，最根本的东西一定不能丢，至诚合天，就是我们真的是一片赤诚之心，我们这个东西一定是真的，不能有丝毫假的，所以我是学到哪，真的照着他去做。</span></p><p><span>这个世界上读过书的人很多，可是他读的东西自己都不信，怎么产生力量？笃信，什么叫笃？就是坚定不移。什么时候才能考验一个人笃不笃信？碰到困难和挫折的时候，一开始人们说传统文化真好，碰到事情就说这不管用，那不叫信。</span></p><p><span>看人们是不是都这样的？说：“我也要做一个高尚的人”，那是没出现利益，出现利益的时候就不高尚了，那不叫信。所以什么叫笃信，无论发生任何事情，我是坚定不移的，这叫笃信，所以我们缺少的是笃。</span></p><p><span>圣人说的很明白，“道之不行”我知道，聪明的人过了，“愚者不及”愚者听不懂；“道之不明”我也知道，贤者过了，“不肖者不及”，贤者是什么呢？他太按照书本上的也不行，这个不肖者是他实在不像个样子，不学无术也不行。</span></p><p><span>只要有这个劲儿，不用学多，就学两三句，我们如果真的照着去做，做上三年，这个人绝对是有大修为者，但是会发现人们太好高骛远了。</span></p><p><span>如果大家不做事情，每天在这读书，没用的，我们永远都学不懂，为什么很多人讲儒家文化讲的都是表面的？因为他没修，他没修那个东西一定是假的，他自己都不信，当不信的时候就不产生力量，力量出不来的，那个东西是个假象。</span></p><p><span>所以我们真的要每天去应用，比如说学的《中庸》，每天做事情就把他相关联，他一定能关联得上。比如发生了一个什么事情，我们要想着致中和的。</span></p><p><span>在做事情当中想着致中和，比如遇到一个事情要发脾气时，想到《中庸》讲，<strong>“喜怒哀乐之未发，谓之中”</strong>，我们得修中，不能发脾气。然后我们修到没脾气了，有时候好像也得用点喜怒哀乐，<strong>“发而皆中节，谓之和。”</strong></span></p><p><span>我们是真的碰到事情就照着做，碰到事情那个才能真的变成我们的，否则不产生力量，我们只是道理明白了，没有用的。</span></p><p><span>再举个例子，比如做事情时有个坏的想法，“不行的，君子依乎中庸，小人反中庸，不行！”我们真的是天天照着修，就会变成我们的了，否则不产生力量。</span></p><p><span>其实人们缺少的是践行，因为现在的人们太好高骛远了，甚至在家花个三百块钱，恨不得把《四书五经》、《道德经》全听一遍，有啥用呀？说白了就是贪念，认为一定学得多才好，大家都已经浮躁到什么程度了？大家都在比什么？老师读过多少本书？现在读几本？大家以为读书多，一天读五本比读四本书的厉害，都已经愚痴到什么程度了。</span></p></div>"
},{
    "title": "《中庸》第五讲 好问好察",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第五讲 好问好察 </strong></span></p><p><span><strong>子曰：“道其不行矣夫！”子曰：“舜其大知也与！舜好问而好察迩言，隐恶而扬善。执其两端，用其中于民，其斯以为舜乎！”</strong></span></p><p><span><strong>子曰：“道其不行矣夫！”</strong>圣人又开始感叹了，看来道是行不通了。子曰：“舜其大知也与！顺好问而好察迩言，隐恶而扬善。”舜帝可谓是有大智慧的人，好问好察迩言。迩是近处的意思。说舜帝这个人非常的谦逊，好问而好察迩言，好问、好观察身边的人和事；隐恶而扬善，隐藏别人不好的行为，而去宣扬那些善良的好的行为。</span></p><p><span>好问和好察，这两个词非常的重要，首先什么样的人才能好问和好察？是不是谦虚谦逊的人？骄傲自满的人不太好问别人的。《论语》中讲：<strong>“敏而好学，不耻下问。”</strong>好问的人通常都是谦虚的，都是谦逊的，尤其是我们作为一个修行之人来讲，好问和好察极其重要。</span></p><p><span>“好问”，首先，我们每天需要观察，要问的是自己，每天我们自己行为，是不是依乎中庸之道的？我们的行为是不是良善的？我们的心念是不是为他人着想的？我们做事情是不是忠心忠义的？我们与人交往是不是心怀仁爱的？这个都是我们每天要问自己的，只有这样每天不停地去追问自己，去修正自己，才能让自己合乎于中庸之道。</span></p><p><span>第二个问，问什么？问身边的人，有什么不懂的，一定要懂得去请教、去问询他人。<strong>“三人行，必有我师，择其善者而从之，其不善者而改之”</strong>，他人的优点强过于我的，我去跟对方学习；看到他人身上的问题和缺点，我们用来修正自己，一定不要犯这样的错误。</span></p><p><span>在生活当中也好，在工作当中也好，当我们是怀着一颗谦虚的心态，去看看身边的人，哪一个人不比我们强？哪一个人身上没有他的优点？有人可能比我的力气大，有人比我有智慧，有人比我有学识，有的人比我会做饭，有的人电脑比我用的好，有的人开车比我开的好，有的人经营企业比我经营的好，有的人养花比我养的好，当我们是谦虚的态度，我们看谁的身上都有优点。</span></p><p><span>孔子讲：<strong>“主忠信，无友不如己者”</strong>，如果我们内在是忠和信的，是以忠信为主，以忠信为本的，没有一个朋友是不如我们的，我们就可以众人为师，很谦虚地去学习每个人身上的优点。</span></p><p><span>这里说舜帝就是这样的人，舜帝会问很多的事情，甚至问天问地，问天为什么会下雨，问黄河流域的人们为什么经常受灾，就是因为他有了这些问题，所以才会想办法去解决这些问题。</span></p><p><span>我们在生活或工作当中也同样的道理，只有懂得不停地去问自己，不停的去问身边的人，去问自然规律，去问天、去问地，我们才能看到很多问题，会发现很多问题，进而才能去解决问题。</span></p><p><span>“好察”，察是察觉，我们经常讲一个词叫悟性，悟从哪里来？悟在察觉之后，如果没有察觉事情的发生，又如何去悟到呢？说我们察觉到了自己的情绪，我们才能悟到下一步怎么去修正；我们察觉了自己的行为有偏差，才能悟到了进而去修正；我们察觉自然的规律，才能悟到原来大道就在其中；我们察觉一件事情的发生，才能悟到里面所蕴含的规律；我们察觉到自己的起心动念，才能悟到进而修正自己的心念。</span></p><p><span>好问好察，是我们修行当中非常重要的两点，也是我们在生活和工作当中所需要拥有的智慧。想一想我们在生活、学习、工作当中都如此，如果我们既好问又好察，你会发现你的智慧自然就出来了，你看很多问题自然就是通透的，你自然就会悟到方法去解决问题，所以这是我们修行的根基。</span></p><p><span>好问好察，我们在生活当中一定要多去练习，多去应用，这个时候我们看事情才能明察秋毫，否则看不懂的，这个是需要我们长期的去修习的两个基本要素。</span></p><p><span><strong>“隐恶而扬善”</strong>，我们在生活当中恰好和这个相反，看我们生活当中通常是怎么做的？隐善而扬恶，别人的优点看不到，抓住别人的缺点，死死的不放手，所以我们在生活当中，一定要懂得去用隐恶而扬善，怎么用呢？</span></p><p><span>举个例子，比如在一个企业当中，有的人迟到，现在这个时代都流行打卡机或者刷脸识别，是不是迟到的人自然就会受到罚款，？那什么叫隐恶而扬善呢？如果我们想让别人不迟到，不要抓着那个迟到的人，狠狠地批评不放，要去扬善，谁早到的我们提出鼓励和表扬，是不是在树立标杆？那大家就知道了，领导其实想不让大家迟到。会发现当我们这样去做的时候，经常迟到的人，他自己就自觉了，如果非抓着迟到的人不放，他心里一定产生逆反和厌烦的心理。</span></p><p><span>看看生活当中是不是一样的？夫妻过日子，我们抓住对方一个缺点不放，天天讲不停地说，循环播放，看看对方是不是厌烦？对方就开始逆反，再说着说着，他就不听了，我们要懂得扬善，看到他身上的优点，多去鼓励他，会发现他反而愿意去修正自己。</span></p><p><span>教育孩子不是一样的吗？孩子身上的优点，我们要加以鼓励和表扬，而不是抓着他的缺点不放，天天说他天天说他，最后他就产生逆反心理了。</span></p><p><span>之前讲《了凡四训》的时候，讲过舜帝的故事，说舜帝在雷泽这个地方捕鱼，他看到这个地方年轻力状的人，都在深潭处捕鱼，因为深潭处鱼又大又多，而年老体弱的，都在浅滩处捕鱼，浅滩处一定是鱼又小又少，这个时候舜帝看到这个事情怎么做呢？隐恶扬善。</span></p><p><span>舜帝就到了这个地方和大家一起捕鱼，比如，有在深潭捕鱼的人，主动谦让的，他就表扬这个人，大加赞赏。他看到有争夺争抢深潭的，他不言语，不说这个事情，只讲好的事情。天天这样去做，人们看到了舜帝在这样做，很多人就效仿舜帝主动地让，后面这个地方就形成了一个新的风气，年老的人都在深潭处捕鱼，年轻力状的都在浅滩处捕鱼。</span></p><p><span>如果以舜帝的位置，他完全可以用言语教化大家，让大家把深水处让给年老之人，可是舜帝没有这样做，圣人处的是无为之事，行的是不言之教，所以舜帝是身体力行的去影响大家。他这样去做别人自然效仿，而且这个是别人从内心深刻地佩服的，这个就是榜样的力量，就是隐恶扬善的力量。</span></p><p><span>所以在生活当中，我们一定要懂得隐恶扬善，会发现人际关系会变好，亲子关系会变好，家庭会变和谐，员工会变和谐。</span></p><p><span><strong>“执其两端，用其中于民。”</strong>执其两端，做任何事情不执于一端，执其两端，执就是拿起，拿起两端能用其中于民，什么叫中？就是适宜的、合适的、适度的、中正的、中和的，用于民。</span></p><p><span>举个例子，比如在生活当中或者在工作当中，发生了一个事情，我们不会因为听谁讲的一面之词，就开始偏私、开始偏袒，说这个人跟着我们的时间长，我们就信任他，就完全听受他的一面之词，这个叫执其一端。</span></p><p><span>执其两端是什么？所有的事情从双方都了解清楚，然后执其中于民，是找到一个合适的度去解决这件事情的。</span></p><p><span><strong>“致中和，天地位焉，万物育焉”</strong>，什么叫执其中？中还得配上和，以和为贵，这件事情是以和谐为主的，是让大家和在一起的，这样解决问题才叫中。</span></p><p><span>《论语》讲：<strong>“君子和而不同，小人同而不和。”</strong>君子做的事情是以和为贵的，允许和包容所有的不同产生。当有两个人在面前因为一件事情起争执的时候，要允许性格的不同，允许事情的不同。</span></p><p><span>以和为贵，是让大家变得更和谐，环境变得更和谐，天下变得更和谐，是以“和”的结果，用“中”的态度去解决问题，这个叫用其中于民。</span></p><p><span>什么样的人才能“用其中于民”？首先是没有情绪的，<strong>“喜怒哀乐之未发，谓之中”</strong>，如果有一个人给我们讲话，我们的情绪就动了，那还能中吗？不能了。所以一定是不偏袒的，没有情绪的，没有欲望的，只有这样的人才能保持中正的态度，才能以和为贵，才能致中和。</span></p><p><span><strong>“其斯以为舜乎！”</strong>这句话在告诉我们，这才是舜，舜之所以称为舜的原因正是如此，不愧是舜帝。这句话可以说是孔圣人对舜帝的很高的评价了，他没有说舜帝堪比唐尧，看这个就不同了，说舜帝不愧是舜帝，他就是他自己，所以他称为舜，就是因为他有这样的格局，有这样的仁爱之心。</span></p></div>"
},{
    "title": "《中庸》第六讲 择乎中庸",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第六讲 择乎中庸 </strong></span></p><p><span><strong>子曰：“人皆曰‘予知’；驱而纳诸古擭陷阱之中，而莫之知辟也。人皆曰‘予知’；择乎中庸而不能期月守也。”</strong></span></p><p><span><strong>子曰：“回之为人也，择乎中庸，得一善，则拳拳服膺而失之矣。”</strong></span></p><p><span><strong>子曰：“天下国家可均也，爵禄可辞也，白刃可蹈也，中庸不可能也。”</strong></span></p><p><span><strong>子曰：“人皆曰，予知。”“驱而纳诸古擭陷阱之中，而莫之辟也。”</strong>人人都说我很有智慧，都说我很聪明。驱是驱动、被驱赶的意思。纳：落入的意思。诸：很多。</span></p><p><span>这句话在告诉我们什么呢？人人都觉得自己很聪明，可是被驱赶落入到很多陷阱之中而不自知，不知道躲避。古擭：以前捕捉野兽的器具。陷井：挖的陷井。这句话在形容一个野兽被驱赶和驱逐落入到这些捕兽的器具和陷阱之中，而不知去躲避。</span></p><p><span>被什么驱赶的？被利益、被欲望所驱赶所驱使。我们延伸到现在这个时代，很多人是不是经常掉入陷阱？很多人经常哭诉说：“被骗了要怎么办？”为什么被骗呢？被利益驱动和驱赶，被自己的欲望驱动和驱赶的。</span></p><p><span><strong>“而莫之知辟也”，</strong>不知道躲避，利欲熏心了，怎么躲避？我们的贪欲贪心起了，如何躲避？怎么才不被这些欲望和利益所驱动呢？——依乎中庸之道。</span></p><p><span>我们自己明白什么事情该做，什么事情不该做，我们有自知之明。我们去问自己，去觉察自己的行为，是不是和那些别人给我们画饼、给我们说了很多利益，我们觉得是否匹配呢？</span></p><p><span><strong> </strong></span></p><p><span><strong>“人皆曰：‘予知’；</strong>择乎中庸而不能期月守也。”人人都觉得我很有智慧，觉得我很聪明，说我听说中庸之道，也觉得中庸之道好，“择乎中庸”，但是“而不能期月守也”。“期月”这里指的是一个月的意思。虽然我知道中庸之道好，可是我连一个月也不能守得住。</span></p><p><span>这段话说了两种人：第一种人，觉得我很聪明，觉得我很有智慧，被利益驱动，被欲望驱使而不知道躲避。第二种人，我也知道中庸之道好，可是一个月也守不住，不能时时刻刻地让自己依乎中庸之道。</span></p><p><span>我们现在再来判断，一个人有没有智慧，其实就变得很简单了。看看他是不是被利益，被欲望驱动着走，如果是被利益和欲望驱动着走，不能称之为智慧，最多能称之为聪明，有些才干，但绝不等同于智慧。</span></p><p><span>我们再去看看这个人，是不是有更大的智慧，就是他能不能时时刻刻地依乎中庸之道，去不断地修正自己，和不断地去做事情。这两点能做到才是有智慧之人。</span></p><p><span>《道德经》同样也讲给我们这样的道理，《道德经》说：<strong>“上士闻道，勤而行之，中士闻道，若存若亡，下士闻道，大笑之，不笑不足以为道。”</strong>上士闻道是勤而行之的，就是这里的时时依乎中庸之道；中士闻道就是若存若亡，是这里所讲的择乎中庸而不能长守；下士闻道大笑之，就是这里的每天被利益和欲望驱动而不知躲避，跟他一说道，还不以为然，甚至哈哈大笑。</span></p><p><span>老子说，不笑不足以为道，道的规律就是这样的。有人信，有人不信，有人不以为然，这个才是道的规律。</span></p><p><span>很多人经常会说：“中庸这么难，我做不到啊，有几个人能做到的呢？”对，这个才是道。就是有的人能做到，有的人做一半若存若亡，有的人做不到，有的人不信，这个才是道的规律。</span></p><p><span>我们看世间万事万物，不是这样的吗？有参天大树、有花、有草、有土，有山河大地，人有有智慧的、有没有智慧的、有无知的、有有钱人、有小康之家、有没钱的，这才是世界运行的规律。</span></p><p><span>只不过我们自己要做什么样的人，我们是否想让自己依乎中庸之道，我们是否想让自己变得更有智慧，变得更有格局，变得生活更坦然。接下来又开始给我举了一个上士的例子，就是孔子的得意门生颜回。</span></p><p><span><strong> </strong></span></p><p><span><strong>子曰：“回之为人也，择乎中庸，得一善则拳拳服膺，而弗失之矣。”</strong>说颜回这个人择乎中庸，选择中庸之道。得一善，就是领悟到一个道理，学到了一个善行，明白了一件事情，这叫得一善。“则拳拳服膺”，拳拳就是紧紧地握住，膺是指我们的胸口，拳拳服膺就是紧紧地握住，放在心里怕失去。“而弗失之矣”，不能让他失去。</span></p><p><span>整个这段话，形容颜回追求学问的这种态度，得一善念，明白了中庸的道理，紧紧地握住放在心里，恐怕失去的样子，所以我们做学问，我们修行，都应该有这样的态度。</span></p><p><span>如果我们是以这样的态度来学习、来修行的，来依乎于中庸之道，我们才能做到上士勤而行之。不停地去勉励自己，让自己依乎中庸之道，去修正自己去做事情。</span></p><p><span>为什么要有这样的态度去做事情呢？因为修行中庸之道是很难的，我们少了这样的态度，是很难守得住的。所以才说择乎中庸而期月不能守也。接下来就告诉我们，中庸有多难。</span></p><p><span><strong>子曰：“天下国家可君也，爵禄可辞也，白刃可蹈也，中庸不可能也。”</strong>天下国家是可以均衡的，可以平均的，只要是贤德的君主就可以做得到，这体现的是一种仁，有仁德的贤明的君主可以让国家均衡。</span></p><p><span>“爵禄可辞也”，爵是官爵；禄是俸禄，就是名利，智者是可以弃掉这些的。“白刃可蹈也”，蹈就是踩；有勇气的人，勇者可踩也。</span></p><p><span>整个这三句话，给我们讲的是仁、智、勇，仁者贤君是可以让国家达到均衡的，可以治理好一个国家的。一个智者是可以放弃名利的，所以智者可弃也，一个勇敢的人，他是可以踩着刀剑的，所以勇者可踩也。</span></p><p><span>仁、智、勇，这三点是可以做到上述这三件事情，可是中庸不可能也。有了仁、智、勇，中庸也未必能做得到，所以还需要的是什么呢？态度，颜回的这种态度，“得一善，则拳拳服膺”的这种态度。《道德经》讲的“上士闻道，勤而行之”的这种态度。</span></p><p><span>所以中庸说难也难，说不难实在也不难，态度很重要。因为人们乍一听的时候会不理解，我们依乎中庸不对呀，我越修越痛苦呀，其实不是的。依乎中庸看似过程是痛苦的，结果是好的。</span></p><p><span>比如，现在跟着学习了五六个月的这些朋友，看看他们现在是不是安然自若的状态？看他们超话分享说：“生病了去输液，都是很爽的状态。”对呀，修行的结果就是这样的，要不然我们想一想是不是焦虑的？现在的人跟着做事情也是，会发现越是依乎中庸之道，平时是严于律己的，结果就是淡定自若的。否则过程是无所忌惮的，结果就是焦虑的、就是恐慌的。</span></p><p><span>所以为什么那么多人生活在痛苦当中，就是不懂得中庸之道的妙。为什么我们来讲中庸？我们要不是把他掰开了、揉碎了往生活当中讲。大家会认为中庸太高大了，离我们太远了，我做不到，其实真的不难。</span></p><p><span>只不过我们总是认为，道好像是高高在上的，实则不是，道就在我们生活当中的点点滴滴，我们一点一点去修正自己就合道了。</span></p><p><span>先讲了很多孔子对于中庸的概念，后面才具体讲的，前面讲的都是概念。就好比《道德经》开篇就告诉我们什么叫道，告诉什么叫道了之后，再告诉什么叫德，我们该怎么去修。</span></p><p><span>就像《大学》不是一样吗？<strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>我们如果真的听懂《大学》，听这一句就够了，因为没有办法，是要给大家讲的。如果我自己学《大学》，就把这三句话学懂了，后面的不用了。三纲领，纲领有了。</span></p><p><span>那一样我们要学《中庸》，就学一句话就可以了，<strong>“天命之谓性，率性之谓道，修道之谓教。道也者，不可须臾离也，可离非道也。”</strong>就结束了，后面所有的解释都围绕这句话来说的。</span></p><p><span>今天讲的这些，是告诉我们具体如何修的，我们有体悟。可是之前讲的见性，讲的道，我们没见过，所以理解不了，这是正常的。这个可能在一年以后，才能真正的理解那句话在讲什么。因为这个我们有体会，所以就更好理解。</span></p></div>"
},{
    "title": "《中庸》第七讲 子路问强",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第七讲 子路问强</strong></span></p><p><span><strong>子路问“强”。子曰：“南方之强与？北方之强与？抑而强与？宽柔以教，不报无道，南方之强也，君子居之；衽金革，死而不厌，北方之强也，而强者居之。故君子和而不流，强哉矫！中立而不倚，强哉矫！国有道，不变塞焉，强哉矫！国无道，至死不变，强哉矫！”</strong></span></p><p><span><strong>子路问强。</strong>子路是孔子的得意门生，叫仲由，字子路。子路的性格本身是刚强的、勇猛的，也是跟在孔子身边时间最长的弟子，这个人刚强果敢。这里的子路问强，问孔子什么叫强？</span></p><p><span><strong>子曰：“南方之强与？北方之强与？抑而强与？”</strong>这个而是什么意思？是你的意思，这个时候孔子说：“你是问南方的强？还是问北方的强呢？还是问像你这样的强？”孔子开始自己回答了。</span></p><p><span><strong>“宽柔以教，不报无道，南方之强也，君子居之。”</strong>说南方的强是宽柔以教的，他是宽容的、他柔和的，以教导他人，这是南方的强。“不报无道”，即使别人对我们做了不好的事情，别人伤害了我们，我们也不去报复。这样的是君子居之的，南方的强是符合君子风范的。</span></p><p><span><strong>“衽金革，死而不厌，北方之强也，而强者居之。”</strong>衽金革，衽：就是卧席，金：是武器，革：是盔甲；说北方的强是枕着武器就可以睡觉，就可以席地而卧。形容的是什么？战死沙场而不厌，不厌：就是不后悔、不悔恨。说这是北方的强。所以北方自古出将领。</span></p><p><span>“而强者居之”，这里的强指的是勇敢，说北方的强是勇敢的，南方的强是宽柔以教的，是君子风范。</span></p><p><span>整个这一段告诉我们南方的强和北方的强。子路问强，孔子却没有回答什么是强，他告诉你南方有南方的强，北方有北方的强。这段话告诉我们什么呢？任何事情都有它的多面性，都有它的多样性。</span></p><p><span>《论语》里面弟子问仁，每个不同的人问什么叫仁，孔子的回答都不同；有很多弟子问政，每个人问的不同，孔子回答的不同；很多人问孝，什么叫孝道，孔子的回答不同。</span></p><p><span>这里面子路开始问强，孔子回答了南方的强和北方的强，在告诉我们任何事情都有它的多样化，都有它的多面性。就好比是今天如果有人问我们，什么叫修行？我们对每个不同阶段的人，回答也是不同的。</span></p><p><span>今天同样问孝也是一样的，比如一个七八岁的孩子来问孝，我们可能告诉他好好学习就是孝，听父母的话就是孝顺；一个中青年来问何为孝，可能告诉他不让父母操心，经营好自己的家庭，做好自己的事业就叫孝了。</span></p><p><span>如果有的父母衣食、物质方面是不富足的，这个时候，可能告诉他要多给父母买东西，多给父母一些生活费，就叫孝顺了；如果有的父母本身衣食很富足，缺少陪伴，可能告诉他多陪伴父母就是孝顺。</span></p><p><span>所有的事情都有多面性，都有不同。现在我们一个团队、一个企业当中，也同样的道理，有的人问我们什么样的员工叫有能力，我们没法列举某一种人，才叫有能力。需要财务的时候，财务是有能力的；需要技术的时候，技术是有能力的；需要销售的时候，销售是有能力的；需要后勤的时候，后勤人员是有能力的。接下来重点来了。</span></p><p><span><strong>故君子和而不流，强哉矫！</strong>哉矫是一个感叹词，语气助词。和而不流才是真正的强大。什么叫和而不流？我们先说流，同流就是你随着他走，这里不要用同流合污，不一定是污的，是同流。</span></p><p><span>比如说我们在做事情当中，我们是为了和的。就好比回到我们一个企业当中，我们不是偏袒任何一方的，不是认为只有财务才是有能力的，只有销售才是有能力的，是为了和的，是为了一个整体的。</span></p><p><span>比如说我们现在再回到南方的强和北方的强，不是认为南方的强才叫强，或者北方的强才叫强，我们要懂得“和而不流”，不去和任何人去同流，而是以和为贵，这个才是真正的强。</span></p><p><span><strong>“中立而不倚，强哉矫！”</strong>比如我们依靠一个东西，倚是不是偏的？偏了才叫倚、偏私；中正而不偏私，才是真正的强大。又回到我们讲中庸了：“致中和，天地谓焉，万物育焉。”一个是告诉我们和而不流，一个是告诉我们中正而不偏私，这个才是真正的强大。</span></p><p><span>《大学》会讲：<strong>“欲修其身者，先正其心。身有所忿懥，则不得其正；有所忧患，则不得其正；有所好乐，则不得其正。”</strong>当我们的情绪一旦动了，心一旦偏私了，就不会变得中正。</span></p><p><span>这里面告诉我们一个概念，真正的致中和，做任何事情都是中正的，才是真正的强大。不是武力强就叫强大，不是有某一方面的文化就叫强大。</span></p><p><span>所以你看我们在一个企业当中，如果我们是做一个领袖的，我们要知道真正的强大是什么，是我们懂得做任何事情都是致中和的。因为当我们懂得致中和的时候，才能把所有人和在一起，才能把所有的事情和在一起，这个才叫真正的强大。</span></p><p><span>比如说我们形容以前古代的朝廷，说一个强大的国家，一个强大的国家是不是他的经济要富足？他的文化要昌盛，有文臣、有武将？这个才能叫强大。如果只有武将能称为强大吗？如果只有文臣能称为强大吗？</span></p><p><span>所以一个强大一定是多元化的、多样化的、包容的。我们现在来说一个企业，说这个企业很强大，这个企业之所以称为强大，是不是企业当中一定有各种人才的存在？这个才叫强大。</span></p><p><span>如果只有北方的强，只尚武力能称为强大吗？如果只有南方的强，都是宽柔以教的，没有人有武力能称为强大吗？包容的才是强大的，中正的才是强大的，和的才是强大的。</span></p><p><span>中庸之道告诉我们：最大的强大是“中”和“和”的力量。包括我们之前也会讲舜帝“致中和”，用中和来去做事情。所以我们要懂得强大的概念，实则是我们的容人之量。说一个人内心强大，是不是他什么事情都能容，什么样的人都能容，这个才叫真正的强大。</span></p><p><span>《易经》里有一卦叫师卦，师卦前边是讼卦，讼卦前面是需卦。当一个事情有需要的时候，他就会孕育而生；当一件事情发生的时候就会出现争讼，他为什么出现？是因为有需要才会出现，当出现一件事情的时候，就会有争讼；争讼出现了之后，就会有师卦脱颖而出。</span></p><p><span>什么叫师卦呢？就是从争讼当中脱颖而出的那些有能力的人就出现了。举个例子，咱们现在很多朋友已经跟着学习五六个月以后，现在我们的超话出现了，有很多人私下开始建了群。这些人是谁选举的吗？不是，是他自己在需求当中，在争讼当中脱颖而出的。</span></p><p><span>你看在一个团队当中是不是如此？当一件事情需求产生了，然后接下来事情发生了，就会产生争讼。那么有仁德的人、有包容能力的人、有担当的人，就会从当中脱颖而出。所以万事万物的发展规律，都是如此。</span></p><p><span>这个时候你会发现，能脱颖而出的人一定是懂得“中和之道”的人，他是和而不流的，他不流向任何一方，任何一件事情。他是以和为贵的，他是中正而不倚的，他是不偏私的，这样的人就脱颖而出了，这个才叫强大。</span></p><p><span>我们自古看到的圣贤之人，自古看到的贤臣良将，是不是都是有包容的？都是有容人之量的？都是做事中正之人，这个才叫强大。</span></p><p><span>所以整个这段话告诉我们一个概念：不要有任何的偏差，要允许所有事情的发生，允许所有事情的不同，允许各种强大。而我们需要修的是“中”和“和”，这个时候你才会变得更加强大。我们一个团队也是一样的，只有我们都懂得中和和的力量，我们的团队才会变强大，否则是不可能变强大的。</span></p><p><span>在一个家庭当中也是一样的，如果一家之长，不能懂得中和之道，你的家里就都是矛盾，不停地在解决各种问题的发生，不停地在解决各种矛盾和问题。一个企业当中同样如此，一个国家更是如此。</span></p><p><span>所以说“中”“和”这两个字是中华文化的根基，故而我们现在伟大的祖国，叫中华人民共和国。中和是在其中的。这是中华文化的魂，这是东方的哲学智慧，这是包罗万象，可以容纳天地的，这是符合中庸之道的。所以“致中和，天地位焉，万物育焉。”</span></p><p><span>你看我们在企业当中的应用是不是如此？当我们懂得致中和的时候，是不是所有的人都会各归其位，所有的事情都会各归其位，自然地运转。如果你不能去致中和，大家每天只会生活在是非对错里面，苦苦地纠缠而不得解脱，这个不叫强大。</span></p><p><span>通过“子路问强”这一段，孔子给出的什么叫真正的强大。这个时候我们再来理解这个强大，就不只是子路所问南方的强、北方的强，还是像你这样的强者，你们那个也可以称之为强。但是更强大的是“致中和”，是和而不流，是中正而不偏。</span></p><p><span><strong>“国有道，不变塞焉，强哉矫！”</strong>“国有道，不变塞”，就是国家有道、政治清明的时候，不变塞是不改变过去自己的操守。用我们现在的话讲，就是不要得意忘形。看看很多人都是这样的，我们过穷苦日子的时候，还有自己的操守、自己的品格、自己的节俭，一旦开始过上富足的生活，自己原本的操守就没有了，就开始得意忘形了。</span></p><p><span>所以国有道，用现在的话讲，我们过上了富足的生活，我们还不改变自己过去的操守，这个才叫强大。</span></p><p><span><strong>“国无道，至死不变，强哉矫！”</strong>国家无道的时候，我也不改变自己的操守，我也不会去同流合污，依然保持中正的态度、中正的处事风格，这个才叫真正的强大。</span></p><p><span>用现在的话讲，如果我们再聊这两句话的中庸之道，无论我们是富贵的还是贫困的，我们都持守中正之道，不会与人同流合污，不会因为自己的私欲而变得有偏私，去恪守中正之道，这个才是真正的强大。</span></p><p><span>所以当我们依乎中庸之道的时候，会让自己变得更加强大、更加泰然、更加变得悠然自得、更加变得无欲无求，你看我们这个状态才是强大的。并不是说你有武力就叫强大，你只懂得宽柔以教就叫强大。</span></p></div>"
},{
    "title": "《中庸》第八讲 遵道而行",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第八讲 遵道而行</strong></span></p><p><span><strong>子曰：“素隐行怪，后世有述焉，吾弗为之矣。君子遵道而行，半途而废，吾弗能已矣。君子依乎中庸，遁世不见知而不悔，唯圣者能之。”</strong></span></p><p><span><strong>君子之道，费而隐。夫妇之愚，可以与知焉；及其至也，虽圣人亦有所不知焉。夫妇之不肖，可以能行焉；及其至也，虽圣人亦有所不能焉。天地之大也，人犹有所憾。故君子语大，天下莫能載焉；语小，天下莫能破焉。《诗》云：“鸢飞戾天，鱼跃于渊。”言其上下察也。君子之道，造端乎夫妇，及其至也，察乎天地。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>子曰：“素隐行怪，后世有述焉，吾弗为之矣。”</strong>素隐行怪，就是寻求偏僻的方法，走小路。“后世有述焉”，即使后人有称道，有称赞于你的。“吾弗为之矣”，我也不会去做这样的事情。用现在的话素隐行怪非常好理解，搞怪、哗众取宠，做一些不正当的，不是正道光明的行为去博取众人的眼球。</span></p><p><span>现在是网络时代、自媒体时代、直播的时代，我们更好容易理解素隐行怪。很多人为了出名，为了火，不择手段，哗众取宠，甚至颠覆了人们的价值观，去吸引别人的眼球，以达到自己火的目的，这都是素隐行怪。</span></p><p><span>后世有述焉，我们讲不光是后世，当下也有人称道，当下也有人支持，但是孔子说：“这样的事情我是不去做的”。</span></p><p><span>我们再回过来讲，“后世有述焉”，述就是后世还有人在讲这件事情，那述有好的、有坏的。包括我们现在会去赞叹我们雷锋的奉献精神，会去赞叹岳飞的精忠报国。同样现在也会有人在说秦桧的遗臭万年，不好的也叫述。我们现在还在称赞诸葛孔明的鞠躬尽瘁，死而后已；关二爷的义薄云天，所以说述有好有坏。</span></p><p><span>如果我们做的是素隐行怪的事情，第一不长久；第二，我们所得到的述，有可能是被后人所辱骂的，所耻笑的，遗臭万年。所以说这样的事情，我们是一定不要做的，毕竟走的是偏僻的小路，一定不长久。我们一定要走大路，去做光明正大的事情，依乎中庸之道，我们才能走得稳，才能走得久。</span></p><p><span><strong>“君子遵道而行，半途而废，吾弗能已矣。”</strong>说君子是遵中庸之道而行的，半途而废的事情。“吾弗能已矣”，弗是不的意思，已是停止的意思。说君子依乎中庸之道而行，半途而废，我是不可能停止的，我会一直依乎中庸之道去行事。“得一善，则拳拳服膺”，让自己始终依乎中庸之道前行，时时刻刻地来警醒自己，时时刻刻地让自己率性而为，时时刻刻地让自己合道而行。</span></p><p><span><strong>“君子依乎中庸，遯世不见知而不悔，唯圣者能之。”</strong>君子依乎中庸之道而行，遁世不见知而不悔，即使不被世人所知，我也不会后悔。《论语》讲：“人不知而不愠，不亦君子乎”，别人即使不知道我，不了解我的学识，我也不生烦恼，这不是君子的风范和修养吗？</span></p><p><span>所以这段话也同样告诉我们，我们依乎的中庸之道，不是为名、不是为利，只是合了道，回归我们自己的天性，天命之谓性。不是做给别人看的，不是做给别人知的，所以要慎独。</span></p><p><span>我们是让自己合于天性，合于天道，所以即使不被人知道，我也不会后悔，唯圣者能之，只有圣人才能做到吧。如果我们一直是依乎中庸之道去行事的，天地怎么会埋没人才呢？你是合天道的，天地自然会彰显你的德行。所以这句话来告诉我们，是不要为名利，我们依乎的中庸之道，绝非做给任何人看的，那是回归我们的天性。</span></p><p><span><strong>“君子之道，费而隐。”</strong>说君子的中庸之道，费而隐，费是广大，隐是精微。中庸之道，既广大又精微，无所不含的。</span></p><p><span><strong>“夫妇之愚，可以与知焉；及其至也，虽圣人亦有所不知焉。”</strong>道广大和精微到什么程度呢？就是普通的、愚昧的男女，可以与知焉，也是知道“道”的。及其至也，如果你说到最高处、最大处，虽圣人亦有所不知焉，即使是圣人也不可能全知道。</span></p><p><span>所有的万事万物都在道中运行的，你要说他大，太大；你要说他小，就在我们平时的生活当中，即使是最普通的、愚笨的男女也知道。比如说我们说阴阳和合生万物，我们最普通的男女知不知道阴阳和合？都知道如何生子。平时我们饿了吃饭就是道，渴了喝水就是道，你看看最普通的男女知不知道？天热了少穿一点，天寒了多穿一点，都是道。看看最普通的男女是不是也知道？</span></p><p><span>如果再往大了讲，天地万物我们都了解不清楚，何况道呢？所以即使是圣人也不会全知晓的。举个生活中的例子好理解，即使是一个非常贤明的君主，你有可能不知道如何种地，你也可能不知道如何做饭。你再优秀的厨师，你也可能不知道如何做衣服。道，实在是广大，不可能所有的事情，我们都知道。</span></p><p><span><strong>“夫妇之不肖，可以能行焉；及其至也，虽圣人亦有所不能焉。”</strong>刚才说的是知“道”，现在说的是行“道”，说即使普通男女、不怎么贤明之人，可以能行焉，也可以行“道”。及其至也，虽圣人亦有所不能焉，如果你说到最广大、最高处，圣人也不能都做到的。</span></p><p><span><strong>“天地之大也，人犹有所憾。”</strong>天地之大，人都是有所遗憾的，你不可能所有的事情都知道，你也不可能所有的事情都做到。孔子在《周易》里面讲：“参赞天地之化育”，道是用来做什么的？让我们来参赞天地之化育，随着天地运行的规律，我们来创造万物的。</span></p><p><span>举个例子，我们知道了“道”的运作规律，我们知道了春夏秋冬的变化，到了夏天热的时候，我们是不是知道有空调？当到了冬天冷的时候，我们是不是要取暖呢？这都是在遵循着道的规律，我们来创造万物。</span></p><p><span>比如说现在外面在下着雨，自古以来的圣人格物以后，都会告诉我们有下雨天，所以人们知道了有下雨天，是不是就建造了房子，让我们来遮风挡雨，这都是参赞天地化育之变化，我们所创造出来的。</span></p><p><span>我们懂得了中庸之道，依乎中庸之道，告诉我们本来的那个天性是至善的、是至纯的、是至真的，我们率天性而为就是道。我们不好的事情不去做，就是在让自己合道，我们率自己本性的最纯真的、最善良的事情去做，这个就是合道，就是率我们自己本来的天性。</span></p><p><span>所以为什么我们要学习圣贤的文化？为什么要学习道呢？就是你要了解他的运行规律，然后我们按照他的运行规律去修正我们自己，让我们自己的行为合于道，就是合于自己的天性了。</span></p><p><span><strong>“故君子语大，天下莫能载焉；语小，天下莫能破焉。”</strong>道之大，天下莫能载焉，因为道比天大，天地都是孕育在道中的，运行于道中的。语小，天下莫能破焉，即使再小，你也无法破坏道的规律。所有的万事万物，无论有多大，无论有多小，都在道中运行。</span></p><p><span>所以告诉我们是离不开道的，我们生活的处处都是道，我们懂得道，去依乎道而行事，我们本身就是道，我们就是在依道而运行，依自己的天性而运行。</span></p><p><span><strong>诗云：“鸢飞戾天，鱼跃于渊。”</strong>鸢是一种鹰，戾是到的意思，达到的到。鱼跃于渊，这句话在告诉我们，无论天上的飞鸟，还是水里跳跃的鱼，都是在道中的。</span></p><p><span><strong>“言其上下察也。”</strong>中庸之道都上下可察的，这里的“其”指的是中庸之道，所以说中庸之道，道是上下可察的，无论是天上的飞鸟，还是水里跳跃的鱼，都在道中。这两句话引用《诗经》在形容道是能上能下，包含于天地之间的，天地是在道中的。</span></p><p><span><strong>“君子之道，造端乎夫妇，及其至也，察乎天地。”</strong>君子之道，这里也指的是中庸之道。“造端乎夫妇”，开始于夫妇，及其至也，到他最广大、最高处，觉察知晓于天地万物。</span></p><p><span>整个这一段，都是来形容道的大，都是来形容万事万物都在道中运行。所有的事情，所有的规律、所有的变化都是道。</span></p><p><span>如何引导孩子不要去看这些素隐行怪的事情？一定是平时我们的价值观。你去想一想，为什么会有这么多素隐行怪的事情发生呢？说明有市场，说明现在的人的心里是需要这些东西的。</span></p><p><span>我们去看一看一个孩子，他为什么需要看这些东西呢？他是平时受身边的孩子和家长的影响。七、八岁的孩子，十几岁的孩子，他自己的价值观还没有完全建立，所以这个时候怎么办呢？不是你教给他要看什么或者不看什么，是我们家长点点滴滴给他带来的影响。</span></p><p><span>你看在一个家庭当中，遇到事情如果夫妻俩就吵架，就互相指责抱怨，孩子形成的就是这样的思维。如果遇到事情的时候，父母教给孩子的都是你要友爱，你要包容他人，是不是你给他植入的思维就是这样的？这个时候孩子看到那些经常吵架的视频，他就不看了。因为什么呢？这跟父母教给我的不一样，“举直错诸枉”。</span></p><p><span>在我们这个团队当中是不是一样？比如说当碰到一个事情的时候，我在跟大家聊天的时候是不是在举直？就是我在跟大家聊什么样的思维方式，你们自然就向这个靠拢，不靠拢的，在我们这里是待不下去的。</span></p><p><span>但是你想一想，如果碰到一件事情，我的想法如果都是素隐行怪的，我的想法如果都是不择手段的呢？我的想法如果都是以利益为出发点的呢？这个也叫举直，只不过我认为那个叫直，你们的思想是不是自然就会跟着我往这边偏颇？但是我们现在碰到事情，我们都讲仁爱的呢？我们都讲和的呢？我们都讲包容的呢？我们都讲如何对他有益的呢？即使原来大家的想法不完全是这样，是不是一点一点就会往这方面靠拢？一样的。</span></p><p><span>所以说孩子真的是我们自己影响的，不是我们几句话能把他教明白的。我们再去看很多孩子，我们说有教养的孩子，有学识的孩子，要不然这个孩子就是生而知之，他天生就是那样的，要不然就是父母有修养，所以他影响出来的孩子就是好的。</span></p><p><span>现在我们经常看考试，会有一些寒门出贵人，说学习学霸。注意，虽然那个孩子可能是寒门出来的，但是我们要去了解他的家庭背景，就会明白一个道理，他们家的条件可能不好，可能是贫困，但是父母一定是正直的。没有一个父母天天耍一些小聪明，搞一些素隐行怪的事情，能教导出来好的孩子的，一定是他父母端正的行为影响到他。</span></p><p><span>所以我们讲这里的端正和善良，绝不是有钱或者没钱，绝不是物质条件怎么样。我们这一代的孩子，还有七零后的孩子，为什么绝大数人还是正直的？从小我们的父母都怎么教育我们的？“不能占人家便宜，做事情不能损了阴德。”现在的父母是怎么教的？“不能吃亏，你要打不过他，我帮你揍他去。”你都是这样的想法，他能不素隐行怪吗？</span></p><p><span>所以每次看超话的时候，我还是蛮感动的，因为看到这么多朋友的变化，这么多朋友在分享他生活中的小事情，他分享孩子跟他所带来的变化，这个是非常正能量的事情，也是在行不言之教的事情。</span></p><p><span>很多朋友在分享的时候也会说，不学《太上感应篇》，不知道原来这么多事情都是错的；不学《了凡四训》，不知道原来我那个不叫行善，是作恶；不学《论语》、不学《中庸》，我们还以为自己都已经很厉害了。我们会发现越学越无知，这不是在重新树立我们的价值观？何况孩子？我们如果不学习圣贤之道，我们都走不上正确的价值观，我们如何依乎中庸之道？</span></p><p><span>所以人真的是要懂得不断地学习、不断地去修正自己，就是《论语》的话：“就有道而正焉，不践迹，亦不入于室。”如果我们不踏着圣贤的足迹，很难升堂入室，学不到家。所以这就是文化所带给我们的力量，这也是为什么孔夫子如此重视文化传承，官可以不做，但是文化不能不传承。</span></p><p><span>包括我们今天说孔子是至圣先师，不仅仅是因为他创立了儒家文化，是因为他让文化传承下来的。所以为什么儒释道的文化，没有人告诉你如何赚钱的，没有人告诉你如何让自己过得更好，他都在救我们的慧命。</span></p><p><span>当我们的智慧有了，做事情是合道的，自然就过得更好，自然就能赚到更多的钱，它是水到渠成的事情，所以“居易以俟命”，我们把最简单的事情做好，依乎中庸之道而行，结果自然呈现，我们更大的天命就来了。所以无需外求，我们自己本身就是道，我们率天性而为，就是符合道的规律。</span></p></div>"
},{
    "title": "《中庸》第九讲 道不远人",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第九讲 道不远人</strong></span></p><p><span><strong>子曰：“道不远人，人之为道而远人，不可以为道。</strong></span></p><p><span><strong>《诗》云：‘伐柯，伐柯，其则不远。’执柯以伐柯，睨而视之，犹以为远。故君子以人治人，改而止。忠恕违道不远，施诸己而不愿，亦勿施于人。</strong></span></p><p><span><strong>君子之道四，丘未能一焉：所求乎子以事父，未能也；所求乎臣以事君，未能也；所求乎弟以事兄，未能也；所求乎朋友，先施之，未能也。庸德之行，庸言之谨；有所不足，不敢不免；有余不敢尽。言顾行，行顾言，君子胡不慥慥尔！”</strong></span></p><p><span><strong>子曰：“道不远人，人之为道而远人，不可以为道。”</strong>孔子说：“道不远人”，道是离不开人群的，如果我们以为道是离开了我们，不可以为道，就是还不懂得什么是道。道就在我们人群中间，道就在我们的天性里，道就在我们的身体内，道就在我们的身体外，无所不含，无所不在。为了让我们好理解，开始举例了。</span></p><p><span><strong>《诗》云：“伐柯，伐柯，其则不远。”</strong>伐柯，伐：是砍的意思，柯：是斧柄，就是斧头的柄，我们现在的话叫斧头把。所以“伐柯，伐柯，其则不远。执柯以伐柯，睨而视之，犹以为远。”我们先来讲伐柯，伐柯，什么意思呢？就是我们拿着斧头再去做一个斧柄，去砍那个木头，是不是拿着旧的斧柄再去做新的斧柄？这叫伐柯，伐柯，其则不远。</span></p><p><span>“执柯以伐柯”，我们执着斧柄再去做一个斧柄。“睨而视之”，就是盯着木头，再去做新的斧柄。犹以为远，还以为它离我们很远。什么意思呢？就是在告诉我们，我们自己手里在拿着道，还在到处找道，所以以为道离我们很远。</span></p><p><span>道是向内求的，开篇就讲了：“天命之谓性”，每个人都被赋予了本来的性。“率性之谓道”，我们率着本来至真至纯的天性就是道，道不是向外寻求的，向外寻求是找不到道的，向内找才能找到那个道。所以我们每个人本身就是道，只不过我们没有找到自己的性。</span></p><p><span><strong>“故君子以人治人，改而止。”</strong>所以说君子以人治人，我们先来举例，执柯以伐柯，什么意思？我们照着手里的这个柄，来修新的斧柄就可以了，这叫执柯以伐柯。</span></p><p><span>以道修道，我们本身内在就是具足的，但是他还不能显现，怎么办呢？我们明白了中庸之道，依乎中庸之道去修，就是以道修道。以人治人是什么意思？我们自己本身就是符合道的。“以人治人”，不是治理别人，是治理自己，以自己的天性来修理自己，就是以人治人。</span></p><p><span>“改而止”，直到改正为止。看看自己哪里的行为是不符合中庸之道的，是不符合至善、至纯、至真的，我们就来治理自己，按照他来修正自己，修到改而止。开篇“修道之谓教”，来教化、教育，来修正我们自己就是修道。所以，以道修道，以人治人。</span></p><p><span>忠恕违道不远，违道就是离开的意思。“忠恕违道不远”，忠恕不是道。但是举例了，忠恕离道不远了，所以忠恕只是道的一种体现和应用的方法。说我们如何修道，我们那个道无法具体地量化，所以给我们列举了，忠恕离道不远了。所以我们还找不到道的时候，怎么办？修忠恕。什么叫忠恕呢？</span></p><p><span><strong>“施诸己而不愿，亦勿施于人。”</strong>所以接下来又开始讲以人治人。什么叫忠恕之道？当我们做一件事情的时候，“施诸己而不愿”，对于自己，如果是不愿意的，“亦勿施于人”，当我们要做一件事情，我们要讲一句话，自己去想，如果这番话是对自己讲的，如果这个行为是对自己做的，我们愿不愿意？如果不愿意，不要施诸于他人，这个就叫忠恕之道。是不是以人治人？</span></p><p><span>所以<strong>“己所不欲，勿施于人”</strong>就是忠恕之道。我们按照忠恕之道，不断地去修正自己，就是以人治人，以道修道，执柯以伐柯。所以，忠恕不是道，我们可以按照忠恕去往前修，离道就会越来越近，这是一种外在的体现方法。</span></p><p><span>接下来就开始具体地讲了，如何造端乎夫妇？</span></p><p><span><strong>“君子之道四，丘未能一焉”，</strong>君子之道有四，这里的丘就是指的孔子，因为后人子思，包括孔子的弟子，为了对老师的尊敬，所以不读丘（qiū），读丘（mǒu），指的是孔丘，孔夫子的意思。孔子说：“君子之道有四，丘未能一焉”，我一样都没做到。</span></p><p><span><strong>“所求乎子以事父，未能也”，</strong>首先所求父子，以子去事奉自己的父亲，我没有做到。因为孔子的父亲叔梁纥，在孔子三岁的时候去世，孔子的母亲颜徵在，在孔子十七岁的时候去世的。孔子说：“子以事父，我没有做到。”</span></p><p><span><strong>“所求乎臣以事君，未能也“，</strong>第二件事情讲君臣，说臣要事奉自己的君主，为国为民去做事情，我也没有做到。孔子只短暂的时间为过官，一开始做中都宰，后来做小司空，又做大司寇。所以说孔子未能为国为民去操劳，未能事奉君主，这也是其中一个遗憾。</span></p><p><span>但是孔子他是有政治抱负的，在《论语》也有讲过：“苟有用我者，期月而已矣，三年有成。”期月：这里期月指的是一年。孔子在说：“如果有人用我为政，一年有一些起色的，三年会有成果。”但同时孔子所追寻的又是以道事君，当君不合道、国无道的时候，孔子就不去做这样的事情，所以一直没有实现他的政治抱负，这也是心中一个遗憾。</span></p><p><span><strong>“所求乎弟以事兄，未能也”，</strong>第三项又讲兄弟了，兄弟之间的关系，就是孝和悌的关系。弟应该是事奉自己的兄长的，也没有做到。孔子的哥哥孟皮也是早逝的。</span></p><p><span><strong>“所求乎朋友，先施之，未能也。”</strong>又开始讲朋友的关系了，这里的君子之道四，就是从普通生活的人伦开始讲起，君臣、父子、兄弟、朋友。说所求乎朋友，“先施之，未能也”。跟朋友的相处之道，是我先施给、先给予对方，我也没能做到。</span></p><p><span>其实我们现在反观自身也是一样的，有的时候我也在思考，我跟朋友相交，其实也没有什么先给予对方的，因为一直在修行，一直想去做文化传播的事情，如果能跟我一起修行的朋友还好，如果不能跟我一起修行的朋友，我又能给予朋友什么呢？大家聊已经聊不到一起了，大家一起玩也没有什么共同语言，所以也做不到了。</span></p><p><span>整个这段话在告诉我们，道从造端乎夫妇开始，从我们日常的亲情当中、日常的友情当中，就包含着道，就在我们的人伦关系之中。我们和每一个人交往的时候，是不是符合至真的？是不是符合至纯的？是不是符合至善的？这就是道。所以说道不远人，一点都不远，在我们行为的点点滴滴、在我们的言谈、在我们的人际关系当中，处处都是道。</span></p><p><span><strong>“庸德之行，庸言之谨”，</strong>这里从字上看它是行为的行（xíng），但是在这里要读作行（xìng），这里的行是什么意思呢？是德行、品行之意。现在的行，比如一个人有没有德性，有没有品性，都已经改成性别的性了，但是以前是行为的行。</span></p><p><span>庸德之行是什么意思呢？庸：就是很平常很普通的。是在告诉我们，在很平常、很普通的事情当中，所能彰显的也是我们的德性。</span></p><p><span>庸言之谨，庸是普通的，平常的言语当中也要小心谨慎的，因为这已然就是道了。这两句话还在告诉我们，庸德之行是自己的内在的，我们自己的内在是不是有德性的？庸言之谨是我们外在的，我们所讲出来的话是不是小心谨慎的、是不是能保持我们的德性、保持我们的品性的。</span></p><p><span><strong>“有所不足，不敢不勉”，</strong>当我们有所不足的时候，不敢不勉励行之，何况是我们呢？孔子自己也说：“君子之道有四，而未能一焉。”自己也是做不到的。</span></p><p><span>所以说我们平时的生活当中，也是一样的，当明白自己有所不足的时候，一定要不断地勉励自己前行，让自己依乎中庸之道。</span></p><p><span><strong>“有余不敢尽。”</strong>有余就是多；话不要说满，行为做事不要做绝。“满招损，谦受益”，包括我们平时生活当中、平时工作当中也是一样的，如果我们没有十足的把握去完成这件事情，我们不能讲的。即使有十足的把握，也要讲七八分，不要把话说满。</span></p><p><span><strong>“言顾行，行顾言”，</strong>内外要一致，我们讲的话自己去观照、自己去对照，符不符合我们内在的德性和品性。同样，我们的德性和品性，要照顾到我们所说出去的话内外是不是一致的。</span></p><p><span><strong>“君子胡不慥慥尔！”</strong>慥慥尔：是小心谨慎，忠厚、诚恳的样子。君子怎么能不小心谨慎、怎么能不表现出来诚恳忠厚的样子呢？</span></p></div>"
},{
    "title": "《中庸》第十讲 君子之道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十讲 君子之道</strong></span></p><p><span><strong>君子素其位而行，不愿乎其外。素富贵，行乎富贵；素贫贱，行乎贫贱；素夷狄，行乎夷狄；素患难，行乎患难。君子无入而不自得焉！</strong></span></p><p><span><strong>在上位不陵下，在下位不援上；正己而不求于人，则无怨；上不怨天，下不尤人。故君子居易以俟命，小人行险以徼幸。</strong></span></p><p><span><strong>子曰：“射有似乎君子，失诸正鹄，反求诸其身。”</strong></span></p><p><span><strong>君子之道，辟如行远必自迩，辟如登高必自卑。《诗》曰：“妻子好合，如鼓瑟琴；兄弟既翕，和乐且耽；宜尔室家，乐尔妻帑。”子曰：“父母其顺矣乎！”</strong></span></p><p><span><strong>“君子素其位而行，不愿乎其外。”</strong>素其位就是守自己的本分，君子的行为和做事情都是守自己的本分。“不愿乎其外”，不会做自己的本位、本职、本分的事情之外的想法和作为，都不会越矩，都不会不守礼，都不会去奢望和奢求，所以叫君子素其位而行，不愿乎其外。</span></p><p><span><strong>“素富贵，行乎富贵”，</strong>如果我们是富贵的，我们就行乎富贵，做富贵的人该做的事情。举个例子，如果我们是富贵的人，就不要与穷人争利。《大学》里会有讲：“畜马乘，不察于鸡豚；伐冰之家，不畜牛羊。”告诉我们有马乘的，那个时候就是富贵人家了。豚是猪，就不要看一些鸡和猪这类的事情和利益了。伐冰之家是指的士大夫，因为只有士大夫，家里有人去世才能用冰葬，这样的人家不畜牛羊，就不要再去畜养牛羊了。</span></p><p><span>为什么呢？第一是不与民争利，第二是要把我们的格局胸怀放得更宽。用现在怎么理解呢？如果我们生活是富足的，我们就不要再和他人总去斤斤计较。现在我们很多人物质条件其实蛮丰富的，每天买个菜也计较，对别人永远都是吝啬的。其实这都是在损自己的福德，都是自己的行为不够坦荡和光明。</span></p><p><span>君子是如何做事情的呢？素富贵我们就行乎富贵，不与他人斤斤计较，但是对自己的用度却是节俭的，对别人却是宽容的。</span></p><p><span><strong>“素贫贱，行乎贫贱”，</strong>如果我们当下的生活不富足，我们也懂得安分守己，不做妄想，不去和别人的生活攀比。如果我们跟别人不断地攀比，就会产生很多的烦恼和欲望，就会让我们的行为出现偏差。</span></p><p><span><strong>“素夷狄，行乎夷狄”，</strong>以前叫东夷、西戎、南蛮、北狄，指的是除了中原以外的四个方向。“素夷狄，行乎夷狄”，生活在四边的人们，也要安分守己地在那里生活就好了。</span></p><p><span>如果延伸到我们现在如何理解呢？比如说在一个企业当中，如果我们没有走到这个企业的中心位置，去做职员或者其他岗位的人，那我们就守好自己的位置，把我们自己的本职工作做好就够了。</span></p><p><span><strong>“素患难，行乎患难”，</strong>如果我们当下的生活，是有一些忧患的、是有一些困难的，那我们就懂得安住在自己的当下去生活就好了。</span></p><p><span>《弟子规》有一句话，叫<strong>“上循分，下称家”。</strong>上循本分，称是合适的意思，我们如何去生活？我们平时的消费也好、平时的用度也好、平时的所思所想，都和自己当下的情况是相匹配的，是适合的就好了。</span></p><p><span><strong>“君子无入而不自得焉”，</strong>入就是处在的意思。所以说君子处在什么地方，都是可以悠然自得的，都是可以自得其乐的，都无需焦虑，无需产生怨恨的。</span></p><p><span>素其位而行，绝非不思进取。首先我们要懂得素其位，然后修己以进取，“安分守己，恬于进取者，方且以道义自称”。我们要懂得先安分守己，恬于进取者，恬是一种心态，是恬然，悠然自得的样子，在这样的状态下再去进取，这个才是君子之风范。</span></p><p><span>如果我们自己首先不懂得素其位而行，每天不停地是向外攀缘的，不停地产生焦虑的，不停地是有非分之想的，我们怎么能恬于进取呢？我们怎么可能安然自得地不断地修正自己，以增加自己的福德，让自己的生活变得更好呢？</span></p><p><span>所以素其位绝非不进取。素其位是为了让自己更好地修自己的德行，让自己合于道，让自己合于善，让自己多去帮助他人，让自己来修正自己，不断地提升自己，我们的生活自然会过得越来越好，所以这都是道的运作规律。</span></p><p><span><strong>“在上位不陵下，在下位不援上”，</strong>处在上位的人，不欺陵处在下位的人；处在下位的人，不去攀缘处在上位的人，还在告诉我们要懂得素其位。处下位的人，为什么不需要去攀缘处上位的人呢？接下来给了我们答案。</span></p><p><span><strong>“正己而不求于人，则无怨；上不怨天，下不尤人。”</strong>我们不用去做攀缘的事情，“正己而不求于人，则无怨”，只要我们遇事都在不停地正己的，不停地要求自己的，不停地修正自己的，把自己该做的事情做好就是最好的攀缘方式，而不需要用谄媚的方式，只需要把自己本位的事情做好就够了。</span></p><p><span>我们在生活当中也是同样的道理，当遇见婆媳关系的时候，当遇见亲子关系的时候，当遇见夫妻感情关系的时候，当和朋友交往的人际关系当中，如果遇事我们都懂得去正己，都懂得去修正自己、提升自己，这个时候我们就“上不怨天，下不尤人”。我们不会去抱怨，不会去指责任何人，因为每个人都是在道中运行的。</span></p><p><span>如果我们当下过得不好，我们当下的生活是自己不满意的，那得看看是不是自己做得还不够呢？道是没有丝毫偏差的，我们当下所拥有的都是和当下正好匹配的，只是我们不自知。所以我们要懂得正己，这个时候我们就不会去怨天，也不会去尤人。</span></p><p><span><strong>“故君子居易以俟命，小人行险以徼幸。”</strong>所以说君子的行为是居易以俟命，小人反之，是行险以徼幸，做事情是靠徼幸的。</span></p><p><span>我们来讲君子居易以俟命，这里的易是什么意思？易就是最容易、最简单的事情。什么叫简单？自己能做到的事情就是简单的事情，自己做不到的事情就不简单。自己能做到的事情最简单，那素其位不就是最简单的吗？我现在有多大的能力，我就做多大的事情，我也不用攀缘，我也不加外求，这不就是最简单的事情吗？</span></p><p><span>所以我们要懂得做最简单的事情，做最容易的事情。素其位，然后恬于进取，安然自若的状态，不停地去修正自己，不停地去正己，不停地去前行，这不就是最简单的事情、也是最容易做到的吗？我们何必苦苦地向外贪求，苦苦地向外攀缘呢？</span></p><p><span>君子为什么是淡然的？为什么是泰然的？我把自己最简单的事情做好，以等待更大的天命就够了。而小人做事不同，行险以徼幸，不停地去攀缘是不是行险呢？</span></p><p><span>举个例子，谁的物质条件特别好，我就想攀缘和他交朋友。会发现跟他交朋友的过程当中，我们其实是累的，是辛苦的。因为等级差的太多，人家不愿意去理我们。不是人家说嫌贫爱富，而是我们自己的思维和他不匹配，我们自己的想法，我们自己的行为和人家都是不匹配的，所以他肯定是累的。</span></p><p><span>包括我们在工作当中也是一样。本来我做某一个岗位的工作做得还不错，但是我们非要攀缘，非要去想升职。会发现当我们升职了，反而做得更累，因为我们的能力还不足够驾驭的时候，就是这个样子的。这就叫行险以徼幸，能不能做好看运气。</span></p><p><span>做生意不是一样的吗？很多人做生意都是如此，本来做一个生意还不错，自己非要扩大，扩大以后会发现行险以徼幸，因为能力和智慧不足够匹配，就开始盲目地扩张，能不能做好靠徼幸。徼幸就做好了，如果恰好不徼幸呢？就翻船了，生意没做好。升职以后反而活得更累，交几个认为更有钱的朋友，反而过得更辛苦，让自己变得更卑微，这都是不懂得修身给自己带来的结果。</span></p><p><span>所以君子做事情是素其位的，把简简单单的事情做好，不断地提升自己的智慧，不断地提升自己的德行，自有天命所归。</span></p><p><span><strong>子曰：“射有似乎君子，失诸正鹄，反求诸其身。”</strong>说射箭好比是君子之道。正鹄是箭靶，箭靶中心。失诸就是没射中。君子之道和射箭差不多，射箭就好比是君子之道。如果没有射中靶心，反求诸其身，我们要懂得是自己的技艺不够，所以应该反过来要求自己，这就是正己而不求于人。射箭没有射中靶心，总不能说：“靶放的位置不对，你给我改个地方。”改个地方你也射不中。</span></p><p><span>所以说君子之道也是如此，就跟射箭是一样的。射不中说明我们的技艺不够，那要不停地正己，去提升自己，才是君子之道，君子之风。而不是到处地指责埋怨，找很多外在的理由和借口。</span></p><p><span><strong>“君子之道，辟如行远必自迩，辟如登高必自卑。”</strong>这里的迩是近处的意思，卑是低处的意思。说君子之道就好比是远行，都是要从近处开始走的。辟如登高必自卑，卑是低处，就好比是登高，一定是从低处走到高处的。告诉我们君子之道是素其位，点点滴滴地不停地正己的过程，才会越走越远，是按照次第而行的。</span></p><p><span>《道德经》也讲：<strong>“合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。”</strong>说合抱之木，合抱形容树木的粗大，生于毫末，它也是从毫末一点一点长起的。九层之台，它也是一砖一瓦建立起来的。千里之行，它也是一步一步走出来的，所以这就是道的运行规律。</span></p><p><span><strong>《诗》曰：“妻子好合，如鼓瑟琴”，</strong>形容夫妻相亲相爱，像琴瑟和鸣，讲的是协调，讲的是和睦。</span></p><p><span><strong>“兄弟既翕，和乐且耽”，</strong>兄弟既翕形容的是关系融洽，和乐且耽，耽是沉浸其中的意思。兄弟之间的关系是融洽的，是和乐的，是沉浸在其中的。</span></p><p><span><strong>“宜尔室家，乐尔妻帑”，</strong>宜尔室家，我们先讲室，比如说以前都讲家室，以前的家族大，大的家族称为家，比如说老大、老二、老三，分得一室，自己的小家叫做室。乐尔妻帑，这里的妻帑指的是妻子和儿女的统称，告诉我们整个大的家族都是和睦的。</span></p><p><span><strong>子曰：“父母其顺矣乎！”，</strong>如果能做到这样的话，父母可以说是称心如意了。有的时候我们总讲孝顺，如果我们兄弟之间感情不和，夫妻之间吵吵闹闹，父母怎么能过得安心和踏实？</span></p><p><span>所以整个这段引用《诗经》，在告诉我们这个道理，告诉我们<strong>“行远必从近处，登高必从低处”</strong>，我们齐家也是一样的，齐家让自己的整个家庭更和睦，让妻儿更幸福，如此父母也更能顺心。</span></p></div>"
},{
    "title": "《中庸》第十一讲 大德受命",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十一讲 大德受命</strong></span></p><p><span><strong>子曰：“鬼神之为德，其盛矣乎！视之而弗见，听之而弗闻，体物而不可遗。使天下之人，斋明盛服，以承祭祀，洋洋乎如在其上，如在其左右。《诗》曰：‘神之格思，不可度思，矧可射思。’夫微之显，诚之不可掩如此夫！”</strong></span></p><p><span><strong>子曰：“舜其大孝也与！德为圣人，尊为天子，富有四海之内；宗庙飨之，子孙保之。故大德，必得其位，必得其禄，必得其名，必得其寿。故天之生物，必因其材而笃焉，故栽者培之，倾者覆之。《诗》曰：‘嘉乐君子，宪宪令德，宜民宜人，受禄于天；保佑命之，自天申之。’故大德者必受命。”</strong></span></p><p><span><strong> </strong></span></p><p><span>整个这一段都在告诉我们，道就在生活中。夫妇之愚，可以与知焉；夫妇之不肖，可以能行焉。道就在我们生活当中，就在我们人际关系当中。“造端乎夫妇”，从这些日常的行为、日常的关系当中，就已经是道了。只不过我们懂得了道是什么，就能更好地让自己的行为去合道。接下来开始讲察乎于天地，告诉我们“道”的那些无形的运行规律是什么。</span></p><p><span><strong>子曰：“鬼神之为德，其盛矣乎。”</strong>这里讲鬼神的德行是非常盛大的，鬼神就是察乎于天地之间，体察我们的人生百态，体察我们的善恶，并加以记录的。</span></p><p><span>我们学《太上感应篇》，都应该知道：<strong>“福祸无门，惟人自召。善恶之报，如影随形。”</strong>这都是道的运作规律。<strong>“举头三尺有神明”</strong>，我们的善恶都是被记录在案的，这就是察乎于天地。</span></p><p><span>所以这里孔子在说：“鬼神体察天地万物的德行，是非常大的。”所以儒家绝非是不承认鬼神的存在，只是不去过多地讲解，儒家的文化是以人为本，解决人与人之间的关系。</span></p><p><span>这里在告诉我们鬼神在发挥他的功德，在体察着我们的善恶。《论语》里面也会讲：<strong>“敬鬼神而远之”</strong>，为什么要讲“敬鬼神而远之”呢？对于鬼神我们敬畏之心就够了。远之，有远就有近，告诉我们要远鬼神，近人民，近百姓，多去为百姓做事情，做事情靠自己的努力，而不要求诸于鬼神。</span></p><p><span>到了我们这个时代更是如此。何为正行？我们要懂得<strong>“正己而不求于人”</strong>，我们要懂得修正自己的行为，让自己合于道，而不是到处去求鬼神。</span></p><p><span><strong>“视之而弗见，听之而弗闻，体物而不可遗。”</strong>这里的弗是不的意思，视之：看不见，也听不到。这里在告诉我们鬼神看不见、也听不到。但是体物而不可遗，遗是离开的意思，告诉我们体现在万事万物当中，我们又是离不开的。</span></p><p><span>比如说现在我们天天在讲，做事情有因就有果。道家告诉我们：<strong>“善恶之报，如形随形”；</strong>儒家告诉我们要懂得<strong>“致良知”</strong>；孔子告诉我们<strong>“获罪于天，无所祷也。”</strong>这些事情我们也看不见、也听不到，但是他却察乎于天地之间，运行于天地之间，受着某种规律在运行着，这个规律就是道。这里告诉我们鬼神，就是在做这些事情的，在体察我们的人间疾苦，记录我们的人间善恶。</span></p><p><span><strong>“使天下之人，斋明盛服，以承祭祀。”</strong>说鬼神的这些盛大的德行，使天下之人，斋明盛服，斋就是斋戒，明就是静心；盛服就是穿着华丽的衣服去祭祀。</span></p><p><span>古代就开始有祭祀天地、祭祀鬼神的说法。所以说圣贤之人，我们的古人都是承认并且敬重天地鬼神的存在，只不过我们不提倡求助于天地鬼神。到了我们这个时代，我们信偏了。</span></p><p><span>以前的人是不断地修正自己，让自己的德行合于天地之间，去敬重鬼神的存在。而我们现在不懂得修正自己，让自己合道，反而去求鬼神，大错特错，我们的行为和思想出现了偏差，所以才叫迷信。</span></p><p><span><strong>“洋洋乎如在其上，如在其左右。”</strong>洋洋乎：形容盛大、众多的样子。有很多的神存在，如在其上，如在其左右，我们身边到处都是，无所在，无所不在。</span></p><p><span>无所在是什么意思呢？<strong>“视之而弗见，听之而弗闻”</strong>，我们看不到，就以为无所在。<strong>“体物而不可遗”，</strong>体现在万事万物的规律当中，所以他又无所不在。所以很多事情讲道的规律，不是我们不知道，他就不存在，也不是我们不认可、不认同，他就不存在，万事万物都有他自己运行的规律。</span></p><p><span><strong>《诗》曰：“神之格思，不可度思，矧可射思。”</strong>格：是降临的意思，度：是揣测的意思。“矧可射思”，矧：是况且。射：是怠慢和不敬的意思。所以整句话翻译过来什么意思呢？说神之降临是不可揣测的，我们怎可去怠慢和不敬呢？</span></p><p><span><strong>“夫微之显，诚之不可掩如此夫！”</strong>微之显：是细微的、隐蔽的意思。即使再细微、再隐蔽都会显现出来的。“诚之不可掩如此夫”，掩：是掩饰的意思。再细微的、再隐藏的事情都会被显现出来，是不可掩饰的。鬼神的功德也是不可掩饰的，他是体察万事万物的。</span></p><p><span>所以我们平时所做的行为，无论好与坏都是不可掩饰的，都是藏不住的，哪怕再细微、再隐蔽。所以我们老话总讲：“举头三尺有神明”，告诉我们要懂得积阴德。</span></p><p><span>何为阴德？就是别人看不见的事情，即使是别人看不见的事情，天网恢恢，疏而不漏，天地鬼神都是在体察万物的，一切都在道的运作规律当中。所以说道察乎天地，我们做的所有的事情，都会记录在自己身上。</span></p><p><span><strong>“善恶之报，如影随形”</strong>，所以说我们让自己合道，绝非做给任何人看的，只是让我们自己的行为变得更善良，让自己更合道。我们只有越合道，才能显现自己的天性。“天命之谓性”，我们最原本的、最至纯至真的东西，才会得以显现。</span></p><p><span>接下来又开始给我们举例了，举舜帝的例子，告诉我们舜的所行所为，最后的所得都是道的运行规律。</span></p><p><span><strong>子曰：“舜其大孝也与！德为圣人，尊为天子，富有四海之内；”</strong>说舜帝可以称为是大孝之人。若论德行，可以称为圣人；若论尊贵，可以称为天子，舜帝是那个时候的天下共主；若论富有，可以说坐拥天下。</span></p><p><span><strong>“宗庙飨之，子孙保之。”飨：是祭祀。</strong>说宗庙一直在祭祀着舜帝，包括我们现在有很多地方也有舜祠，就是供奉祭祀舜帝的地方。“子孙保之”，还有子孙保其基业，甚至现在的我们还在学其德行，还在学其仁爱，还在传承，这都是子孙保之。</span></p><p><span><strong>“故大德，必得其位，必得其禄，必得其名，必得其寿。”</strong>所以说有如此大的德行的人，他必得其位；“必得其禄”，上天给他的俸禄，给他的福禄；“必得其名”，所以我们现在都在称赞舜帝，都在称赞古之圣贤；“必得其寿”，他必然是可得长寿的。</span></p><p><span>我们这里来补充一句，这里的寿和我们世俗之人所理解的寿还不一样。《孟子》说：<strong>“夭寿不贰。”</strong>《道德经》讲：<strong>“不失其所者久，死而不亡者寿。”</strong>“不失其所”，是不失其道，不失其道才会长久。“死而不亡者寿”，我们的肉体会死亡的，死而不亡的是精神，是文化、是传承。</span></p><p><span>所以到今天我们还在赞扬舜帝，还在赞扬老子，还在赞扬孔子，这都是死而不亡，这个才叫寿。绝非浅意的我们理解的人活到多大年龄才叫寿。</span></p><p><span><strong>“故天之生物，必因其材而笃焉。”</strong>所以说天生养万物，必因其材而笃焉。这里的笃是加厚的意思。说天地不光生万物，还养万物，生育、养育万物，都是因材而笃的。</span></p><p><span><strong>“故栽者培植，倾者覆之。”</strong>栽者就是我们形容他是正的，所以叫栽。只要我们行得正，天是培养我们的。倾者覆之，倾：是歪了的意思。覆之：就是推倒。如果我们行的是不合道的，我们是歪的，天必然将我们推倒。</span></p><p><span>天都是因为我们自己的资质，我们种了什么样的因，就会给我们什么样的果。所以我们老话讲：“自助者天助”，我们自己是自助的、是积极的、是向上的、是行正道的，天都助我们。如果自己是邪恶的，走的路是歪的，天必将推倒于我们。</span></p><p><span>所以我们反过来再来理解这句话，天是不曾加丝毫的善恶于我们的，所谓的天在栽培我们，是我们自己合了道的运行规律，天地自然就是滋养我们的；如果我们自己做的事情是不合道的，是倾者自覆。所以孔夫子才告诉我们：“获罪于天，无所祷也。”如果我们是得罪于天的，祷告也没有用。</span></p><p><span><strong>《诗》曰：“嘉乐君子，宪宪令德，宜民宜人，受禄于天；”</strong>《诗经》告诉我们，嘉乐君子，嘉：就是善良的。乐：是快乐的。说善良快乐的君子，“宪宪令德”，宪宪是盛大之意，盛大的美德。“宜民宜人”，这里的民指的是百姓，人是指的为官、为政之人。“受禄于天”，上天是赋予给福禄的。我们来看看这句话什么意思呢？善良快乐的君子，他自己有着盛大的美德，对于百姓和为官为政之人都是有益处的，他是受福禄于天的。</span></p><p><span><strong>“保佑命之，自天申之。”</strong>上天会护佑这样有德行的君子，会赋予天命。“自天申之”，申：是匹配。这样的善良和乐的君子，上天是保佑的，会赋予给天命的，这一切都是和他自己的德行，和他自己的道相匹配的。</span></p><p><span><strong>“故大德者必受命。”</strong>所以说大德之人必受于天命。</span></p><p><span>整个这一段都在告诉我们，我们所做的所有的事情，都是和自己正好相匹配的。我们有大德之人，自然会有大的天命，自然会受禄于天，自然会得其名，得其位。</span></p></div>"
},{
    "title": "《中庸》第十二讲 无忧文王",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十二讲 无忧文王</strong></span></p><p><span><strong>子曰：“无忧者，其惟文王乎！以王季为父，以武王为子；父作之，子述之。武王缵大王、王季、文王之绪，壹戎衣而有天下，身不失天下之显名；尊为天子，富有四海之内；宗庙飨之，子孙保之。武王末受命，周公成文武之德，追王大王、王季，上祀先公以天子之礼。斯礼也，达乎诸侯、大夫及士、庶人。父为大夫，子为士；葬以大夫，祭以士。父为士，子为大夫，葬以士，祭以大夫。期之丧，达乎大夫；三年之丧，达乎天子；父母之丧，无贵贱一也。”</strong></span></p><p><span><strong>子曰：“武王、周公其达孝矣乎！夫孝者，善继人之志，善述人之事者也。春秋，修其祖庙，陈其宗器，设其裳衣，荐其时食。”</strong></span></p><p><span><strong>子曰：“无忧者，其惟文王乎！”</strong>孔子说：“若论没有忧愁，恐怕只有周文王了吧！”为什么这样讲呢？<strong>“以王季为父，以武王为子；父作之，子述之。”</strong>说周文王的父亲是王季，儿子是周武王。父作之，作是开创的意思，说父亲开创的基业。子述之，周武王去把他发扬光大。</span></p><p><span>这里有一个周朝开创的故事，周文王从祖父开始，叫古公亶dàn 父，这个人就是很有德行的人，他是后稷大人的后代。后稷大人，我们看过电视剧《舜帝》里面有提到过，后稷是农业的创始者，也就是周文王的祖先。当时周文王的祖父古公亶父，生活在一个地方叫做豳bīn ，以农业为主，推行的是仁政。</span></p><p><span>当时有很多戎兵来犯，百姓就奋起反抗，古公亶父就想了一个问题，他说：“我的这些百姓、我的这些子民，做我的子民和做他们的子民有什么区别呢？我不能因为自己的事情，让这些百姓流血牺牲。”</span></p><p><span>他后来就举家迁移，搬到了岐山周原这样一个地方，在现在的陕西，他到这个地方重新又开始发展农业。因为他是一个非常有仁德的人，又有很多人投奔而来，他就把这个地方经营得非常好，一直推行的是仁政。</span></p><p><span>后来又到了周文王的父亲王季，他们是姬姓，周文王叫姬昌，文王的父亲叫姬季历，王季是后面子孙给的尊称。所以到了周文王的父亲王季这里，他依然推行的是仁政。</span></p><p><span>周文王的祖父从小就看着姬昌，说他将来是可以做君位的，也就是说周文王。但是周文王的父亲王季，是古公亶父的第三子，如果按礼制是应该传长子的，后面王季的两位兄长，也知道了父亲的意思，是想把王位传给王季的，传给他的三弟，也就是未来想为了传给姬昌的，也就是周文王。</span></p><p><span>后面这两位兄长就开始离开家远走，不光离开家远走，还去纹身剪发。那个时候的纹身剪发是被称为大逆不道的，是不能继承王位的，所以后面王季就继承了王位。王季继承了王位，又经过他自己的德政，又去经营，后来传到了周文王这里。周文王开始广施仁政，发展农业，招贤纳士。</span></p><p><span>当时周文王为政的时候，还在商朝之下的一个诸侯国，但是由于他推行的是仁政，有很多人民来投奔，当时已经坐拥三分之二的天下。但是周文王守君臣之礼，并没有起兵伐商。</span></p><p><span>到了周武王这里，天下更加的暴乱，商纣施行的暴政。无奈之举，武王才开始起兵伐纣，这是整个周朝建立的历史。所以讲周文王为什么没有忧愁呢？他承了祖上的先业，又有他的儿子周武王来继承发扬整个周朝的基业。</span></p><p><span>所以整个这段在告诉我们什么呢？只有有大的德行的人，才可能没有忧愁。之前我们讲过：<strong>“故大德者，必得其位”</strong>，大德行的人一定有他的位置；“必得其禄”，上天一定会给他福禄；“必得其名”，后世一定会传他的美名；“必得其寿”，他一定是被宗庙祭祀的。</span></p><p><span><strong>武王缵zuǎn 大王、王季、文王之绪。</strong>缵：是继承的意思。说周武王继承大王，也就是他的曾祖父、文王的祖父，刚才我们提到的古公亶父；王季就是文王的父亲，再加上文王之绪，武王是继承了先祖的基业。</span></p><p><span><strong>“壹戎衣而有天下，身不失天下之显名”，</strong>说开始出兵伐纣（商纣王），出兵伐纣而得的天下，但是又身不失天下之美名，本来以下犯上是不合礼法的，但是商朝行的是暴政，这个时候挥的是正义之师。所以说虽然是以下犯上，但是因为他起的是正义之师，是为了全天下的黎民百姓。所以身不失天下之显名，美名和德行都得到了彰显，创立了周王朝。</span></p><p><span><strong>“尊为天子，富有四海之内，宗庙飨之，子孙保之。”</strong>尊贵为当今的天子，富有四海之内，坐拥天下；宗庙飨之，宗庙一直在祭祀，子孙保全其基业，到现在我们还在祭祀周文王，还在祭祀周武王。</span></p><p><span>孔夫子非常推崇的几个圣人——祖述尧舜，宪章文武。经常提到唐尧、舜帝、周文王、周武王之美德、之圣名。包括我们现在还在学习这些圣贤的品德，这都是宗庙飨之，子孙保之。</span></p><p><span>所以整个都在告诉我们，天道遵循的规律。道是察乎于天地的，他是有无形的那种规律在运作的，他只要是符合德行的，他是符合道的，他自然就可以得到上天所赋予给的天命。</span></p><p><span><strong>“武王末受命，周公成文武之德。”</strong>“武王末受命”，指的是武王到了晚年才得了天子、得了天命，武王继承了祖辈的基业，自己又为政九年，才开始出兵讨伐商纣，所以说他已经人到晚年才受的天命。</span></p><p><span><strong>“周公成文武之德”，</strong>武王在位两年，就到了他的儿子周成王即位，那个时成王年幼，周公辅政。周公是周文王的第四子，是周武王的弟弟，他开始辅政，辅助周成王。所以说周公成文武之德，他继续继承和发扬周文王和周武王的德行。</span></p><p><span><strong>“追王大（tài ）王、王季，上祀先公以天子之礼。”</strong>追王，王这里是一个动词，尊称，追加之意。大王：就是我们刚才讲的文王的祖父古公亶父、王季，追加他们的谥号为天子，这样才能享受后人天子之礼去祭祀。</span></p><p><span>斯礼也，达乎诸侯、大夫即士、庶人。这个时候周公制定礼乐，这个礼乐不光是追封先王，还达乎各个诸侯、大夫、士、还有庶民。孔子一生在推行的是周礼，就是周公所制定和完善的礼乐制度。制定了什么样的礼呢？关于丧礼的这里有讲。</span></p><p><span><strong>“父为大夫，子为士，葬以大夫，祭以士。”</strong>说如果父亲是做到了大夫，子是做到了士，大夫比士要更尊显。这个时候如果父亲去世，是以大夫之葬礼之，子祭祀是以士之礼去祭祀。</span></p><p><span><strong>“父为士，子为大夫，葬以士，祭以大夫。”</strong>如果父亲是做士，子身为大夫，父亲去世以士之礼葬。祭祀的时候，子以大夫之礼去祭祀。</span></p><p><span><strong>“期（jī ）之丧，达乎大夫；三年之丧，达乎天子。”</strong>这里的期之丧，是指的守丧一年。说守丧一年的礼仪，“达乎大夫”，也就是说大夫以下，都要守一年之丧的。《周礼》有记载，关于丧礼有五个时间，一个是三年之丧，一个是一年之丧，一个是九个月之丧，五个月之丧和三个月之丧。</span></p><p><span>三年之丧就属于大礼。比如说臣为君，子为父这是守三年的。其他的近亲，比如说叔父、伯父，这是守丧一年的。所以这里告诉我们“期之丧，达乎大夫”，守一年之丧的，大夫以下都要去守这样的礼，但是天子是不守的，天子只守三年之丧，达乎天子。</span></p><p><span>天子最后剩下守的丧，也就还有父亲，所以说天子只守三年丧，但是其他的人要守一年之丧的。</span></p><p><span><strong>“父母之丧，无贵贱一也。”</strong>父母之丧不分贵贱，从天子以至于庶人，都要守父母之丧，也就是三年之丧，包括天子在内都要去守的。</span></p><p><span>整个这一段从“无忧者，其惟文王乎”开始，一直到“父母之丧，无贵贱一也”，都在告诉我们一件事情——有多大的德行，后面就会得到多少名，就会得到什么样的位置，就会得到什么样的子孙保之。</span></p><p><span>周文王从祖父开始，乃至于从后稷大人开始，一直到周武王、周公、周成王，这些人都是推行仁德的，都是有仁政的，所以才能贵为天子，“宗庙飨之，子孙保之。”</span></p><p><span>所以这里面就告诉我们一个道察乎天地的规律——我们有多大的德行，我们做过多少利益他人的事情，我们亲过多少民，这个时候我们才能享受多大的德行。</span></p><p><span>如果我们是被人忘记的，甚至不被子孙祭祀的，说明我们自己本身的德行太少了，不足以彰显在天地之间。讲过了礼，接下来开始讲孝。</span></p><p><span><strong>子曰：“武王，周公其达孝矣乎！”</strong>说周武王、周公可谓是孝顺了。这里又用个达，比一般的孝顺要更加的通达。为什么要这样讲呢？</span></p><p><span><strong>“夫孝者，善继人之志，善述人之事者也。”</strong>说什么样的人能称为达孝呢？就是很通达的孝顺了。“善继人之志”，善于继承先祖的志向。“善述人之事者也”，发扬别人的基业，发扬别人的事业。我们总讲一句话叫“子承父业”，所以什么样的人可称为孝顺呢？我们可以继承父辈的遗志，去把他未完成的心愿，去发扬光大，这个才称为达孝。</span></p><p><span>所以我们自己也要反思的。比如说我们现在自己立于天地之间，我们自己要去想一想，我们将来是否能留给子孙什么样的遗志呢？能让他们去完成，能让子孙以我们自己为荣，我们能做出什么样有德行的事情，什么样有德行的行为，可以让后人去传承呢？要不然后人又继承我们什么呢？</span></p><p><span>我们再反过来思维也是一样的，如果我们的父母做了很多有德行的事情，是有他自己的基业的，那我们也要努力地按照父亲的行为，去继承他的遗志，去把他的事情发扬光大。</span></p><p><span>我们再扩大一点讲，古之圣贤留了那么多伟大的事业，那么多伟大的基业，那么好的文化传承，是不是我们每个人都有责任、都有义务、都愿意去承担、去传承这些文化呢？</span></p><p><span>学儒家文化，《论语》讲：<strong>“士不可以不弘毅，任重而道远。”</strong>所以说达孝是继人之志，述人之事的。</span></p><p><span><strong>“春秋，修其祖庙，陈其宗器。”</strong>接下来又讲关于孝的第二点，春秋是指的春天和秋天两个祭祀的节日。我们现在很好理解，比如说春天，清明节；比如说秋天，七月十五。</span></p><p><span>在春秋这样祭祀的节日，修其祖庙，修饰、洒扫祖庙。现在可能小的家庭已经没有祖庙了，但是大的家族还有祖庙的，用现在好理解的方式，比如说去上上坟。“陈其宗器”，陈列好祭祀的器具。</span></p><p><span><strong>“设其裳衣，荐其时食。”</strong>设其裳衣，就是以前祖上所穿过的衣服摆好；荐其时食，准备好相应的应季的食品、食物和贡品，摆放整齐，这是祭祀的一个仪式。</span></p></div>"
},{
    "title": "《中庸》第十三讲 宗庙之礼",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十三讲 宗庙之礼</strong></span></p><p><span><strong>宗庙之礼，所以序昭穆也；序爵，所以辨贵贱也；序事，所以辨贤也；旅酬下为上，所以逮贱也；燕毛，所以序齿也。</strong></span></p><p><span><strong>践其位，行其礼，奏其乐；敬其所尊，爱其所亲；事死如事生，事亡如事存，孝之至也。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“宗庙之礼，所以序昭穆也。”</strong>昭穆：左昭右穆。整个这一句话什么意思呢？大家可以想象这样一个画面，祭祀活动，宗庙之礼的时候，得按昭穆的顺序排列，比如说长幼尊卑，每个人所站的位置是不同的。</span></p><p><span><strong>“序爵，所以辨贵贱也。”</strong>爵：就是爵位、官位的意思，在宗庙之礼的时候，就会看到什么样的人，官位是大的。但是这里重点是他把序爵放在第二位，放在第一位的是序昭穆。就是官位再大也不可能越过长辈，所以首先是按长幼尊卑来排的，那么接下来是按照官位的大小来排序的。所以辨贵贱也，就知道什么样的人是做官的了。</span></p><p><span><strong>“序事，所以辨贤也。”</strong>序事，这里的事指的是承担什么样的职位、承担什么样的职务。整个在宗庙之礼的过程当中，什么样的人，担任什么样的职责，所以辨贤也，这个时候就看出什么样的人是有贤能的人，什么样的人是负责组织的，什么样的人分配了多少事情，所以就能看出谁是贤能之人。</span></p><p><span><strong>“旅酬下为上，所以逮贱也。”</strong>旅：是众人、众多的意思。酬：是敬酒的意思。宗庙的礼仪结束之后，是不是大家要一起吃饭，要一起敬酒？这个时候开始下为上了，什么意思呢？众人在一起敬酒的时候，是不是通常都是晚辈给长辈敬酒，辈分低的给尊贵的人敬酒。但是以前敬酒和现在的习俗不一样，以前晚辈给长辈敬酒，也是晚辈先干、先喝。</span></p><p><span>我们现在都讲先干为敬，但古时候不是这样的，古时候也是晚辈先喝，但是长辈看着晚辈先喝，是表示对晚辈的尊敬和敬重，所以叫“旅酬下为上”，这个时候处在下位的晚辈是为上的。“逮贱也”，就是恩及下位的，就是表示敬重和喜欢晚辈的，所以你看着他，让对方先喝，和现在的先干为敬是反过来的。</span></p><p><span>所以这句话“旅酬下为上，所以逮贱也”，是体现长辈对晚辈的恩泽，尊贵之人对身处低下位置之人的眷顾，所以叫逮贱也。</span></p><p><span><strong>“燕毛，所以序齿也。”</strong>燕毛是指的头发的颜色，比如说我们年轻的时候，是不是都是黑色的头发？再随着年龄的增长，可能黑白相间，再随着年龄的增长，就是满头白发，所以说燕毛是告诉我们头发的颜色不同。</span></p><p><span>“所以序齿也”，齿是年龄的意思，看到头发颜色的不同，就看出了人的年龄的不同。这句话是告诉我们尊老，整个这一段看似是在讲宗庙之礼，但是这背后是有含义的。</span></p><p><span>比如说从“开始宗庙之礼，所以序昭穆也。”从刚开始宗庙之礼的时候，我们就可以看出来，整个家族的位置尊卑，谁是做什么样的官的，有什么样的官爵。因为祭祖的时候，如果有哪家的子孙是做了大官的，这个时候祭祖的时候是要禀告先祖的，要禀告去世的先人所知晓的。</span></p><p><span><strong>“序事，所以辨贤也”</strong>，这个时候什么样的人去承担了什么样的位置，就看出了这个人是不是有才能的。比如说现在即使我们公司组织一个活动，或者家里组织成一个什么样的婚礼，是不是通常负责组织那个人，都是大家所推选出来的，这样的人通常都是这方面的有贤能之才。</span></p><p><span><strong>“旅酬下为上，所以逮贱也。”</strong>所以这个时候体现的是敬下，让处在下位的人，处在晚辈的人，可以接触到处在上位的人，可以接触到做官的人。</span></p><p><span><strong>“燕毛，所以序齿也”，</strong>根据头发的颜色，可以看到人的年龄，这个时候我们要懂得尊老的。所以从这样一个场景当中，我们能看到背后的道理，因为我们现在很少有人接触过这些宗庙的礼仪，所以不太好理解。</span></p><p><span>举个生活当中的例子，方便大家去理解。我们把宗庙之礼暂且称为年会这样一个场面，因为它相对来讲比较接近，为了方便大家理解。整个公司在办年会的过程当中，是不是“所以序昭穆也”？会按照尊卑的位置排序吧？谁坐第一排，谁坐第二排，吃饭的时候谁坐在哪张桌子上，比如说有没有外来的领导呢？通常我们的老板都会请几位同行的或者其他行业的、德高望重的，或者做得比较好的朋友来参加我们的年会，所以这个时候是有位置的排序的。</span></p><p><span>接下来“序爵，所以辨贵贱也”，每个人职位的大小是不是安排坐的地方也不一样？可能职位高的，安排和董事长坐在一起。所以这个时候我们就知道了，位置的尊卑贵贱，谁是做什么职务的，一目了然。</span></p><p><span>“序事，所以辨贤也”，谁来做主持、谁来做统筹这件事情，这方面的才能就看得出来了。“旅酬下为上，所以逮贱也”，我们还回到这个场面上，一开始一般一个年会敬酒的时候，是不是通常先敬来宾？接下来开始可能老板要举杯先敬酒了，先敬大家，以表示对大家的尊重和器重，道一声我们所有的人辛苦了。这个时候开始，是不是众人敬酒的时候下为上了？反过来了，上为下，就是在重视和敬重处下位的人。</span></p><p><span>“燕毛，所以序齿也”，一般董事长以上为下，我们以下为上。那么再接下来是不是开始单独大家要互相敬酒了？一般部门领导先去敬董事长，然后员工再去敬部门的领导。然后反过来，董事长再去敬各部门的经理，再回来去敬员工，然后员工之间再开始相互敬酒。</span></p><p><span>喝到一定的程度，是不是就开始尊老了，说即使有的人没有多大的德行，或者没有多大的作为，但是他的年龄比较长，哪怕是我们看守大门的大爷，是不是这个时候也会有人给他敬酒？所以最后体现的就是尊老。</span></p><p><span>整个年会这样一个活动看似只是个礼仪，只是个形式，但是仁德已经在其中了。很多人是特立独行的，不来参加年会的，这样的人都是不以大局为重的，不以和为贵的，他跟这个公司一定是没有感情的。</span></p><p><span>看看整个在年会的现场，通常比较活跃的那些人，是不是都是有担当的？都是怎么样让大家变得更和气，整个氛围变得更好，所有的人能开始变得更团结。所以这样的人，仁德已经体现在其中了。</span></p><p><span>我们再讲回来，宗庙之礼更是如此，看似只是一个宗庙之礼，看似只是一个形式，但是这里面体现的就是人的仁德、人的敬畏之心，是不是敬先祖的？是不是敬重在场的每一个人的？是不是不忘祖先的功绩的？</span></p><p><span><strong>“践其位，行其礼，奏其乐”，</strong>践其位，首先升起祖先的排位，每个人站到每个人该站的位置，各归其位；“行其礼”，开始各行其礼，因为每个人所行的礼是不同的；“奏其乐”，每个人所行的礼，奏的乐都是不一样的，因为以前的周礼，规矩非常之繁多。</span></p><p><span><strong>“敬其所尊，爱其所亲”，</strong>整个宗庙之礼，体现出来的氛围就是这八个字——敬其所尊，爱其所亲。比如说参加宗庙之礼的这些人，他内心所敬重的先祖，也是不一样的；在场的这些人，每个人所敬重的人，也是不一样的；所爱的人，所亲的人都是不一样的。只不过这八个字，是来体现了整个宗庙之礼的氛围，他是敬重的、他是仁爱的、他是亲爱的，这样一种氛围。</span></p><p><span><strong>“事死如事生，事亡如事存，孝之至也。”</strong>整个这两句话来总结这一段宗庙之礼。“孝之至”，可谓最高的孝顺了，到了极致。什么样的孝顺可以被称为最高的孝顺了呢？“事死如事生，事亡如事存”，说祭祀，虽然已经先逝，可是我们就像他还活着一样。所以看似是讲的宗庙之礼，其实是讲的我们内在的孝道是不是还在。</span></p><p><span>整个这一段告诉我们武王、周公，达孝矣乎。说他们的孝是通达的，先祖创下的这些伟大的基业，我们来继承，我们来去把他发扬光大，我们对待先祖好像他们还在世一样，依然如此地去尊敬，可谓孝之至矣。</span></p><p><span><strong>“郊社之礼，所以事上帝也”，</strong>郊社之礼，郊社是两个词，冬至在南郊祭天称为郊。夏至在北郊祭地，称为社，所以郊社是祭祀天地的礼仪。在我们的首都北京，现在还有天坛和地坛这两个地方，是在明朝永乐年间修建的。明清两朝的天子，都在天坛和地坛，祭祀天地的。</span></p><p><span><strong>“宗庙之礼，所以祀乎其先也。”</strong>宗庙之礼是祭祀我们的先祖的。</span></p><p><span><strong>“明乎之郊社之礼，禘尝之义，治国其如示诸掌乎！”</strong>整个这一段是精髓，告诉我们，为什么要讲宗庙之礼的要义就在此。“明乎郊社之礼”，如果我们真的明白、明达，祭祀天地之礼。“禘之义”，禘是指的夏季，尝是指的秋季。禘尝之义，禘尝是指的天子和诸侯祭祀祖先的礼仪，叫做禘尝之义。</span></p><p><span>整个这段话告诉我们如果是明达、是通达的，对于祭祀天地和祭祀祖先的礼仪，如果我们明白其中的要义，“治国如示诸掌乎”，这个时候如果治国就好像看自己的手掌，如此的简单清晰。这里为什么要告诉我们如果我们真正明白郊社之礼，祭祀天地之礼，真正明白祭祖的含义和要义，治国就像看着自己的手掌这样的简单。</span></p><p><span>整个这一段，看似是讲的宗庙之礼，实则是讲的道察乎天地，这里是讲的因果循环的规律和定律。</span></p><p><span>我们回顾这一段，告诉我们如果说没有忧愁，恐怕只有文王了。因为文王从祖父开始，一直到他的儿子周武王，周公，再到他的孙子周成王，都是实行的仁政，所以大德必受命于天。</span></p><p><span>为什么后面还会有<strong>“宗庙飨之，子孙保之”。</strong>我们到现在还在学习这些圣贤的品行，还在学习他们流传下来的文化和作风，是因为他们自己的行为，是合乎天道的。</span></p><p><span>所以开篇就告诉我们：<strong>“天命之谓性，率性之谓道”，</strong>让我们合乎自己最至纯、至真、至善的天性，我们率着天性而为就是合道的，合道的人才能长久，才能让后世去敬仰我们，去赞叹我们。</span></p><p><span>所以整个这段的宗庙之礼，都在告诉我们这样一个规律。都是因为他们有这么大的德行，所以他们是受命于天的，他才能去长寿，才能去得他的美名，才能去得他的位置。</span></p><p><span>如果我们懂得了这里面的道理，这就是治国的道理，看似讲的是祭祀，可是里面讲的是我们的诚意，讲的是我们的德行，看我们的行为是不是合道？是不是能回归到自己的天性？这是整个这段话的要义。</span></p><p><span>那我们再来延伸一下，我们去拜圣贤，比如说我们去孔庙、去孔府、去孟子庙、去颜庙，我们去拜舜帝舜祠，我们到底在拜什么呢？看似我们到那里去求一求，说保佑我孩子考上一个好的学校，保佑我们风调雨顺，家族安康，这是表面的形式。</span></p><p><span>我们去拜的不是要感受圣贤的文化吗？不是要去体悟他的一生所作所为吗？不是要体会他的心怀天下吗？如果我们知道为什么这些圣贤会被我们供奉至今？是因为他有大的德行，是因为他的做事是符合道的，是回归他自己的天性的，这个才是我们要学习的东西。</span></p><p><span>如果我们懂得这个道理，我们何须外求呢？我们自己人人都有那个天性，我们率那个天性而为，都可以去合道的，那我们的德行也自然会得到彰显。</span></p><p><span>这里面还有一个很重要的点，比如说我们到现在这个社会，再来学习儒家文化，我们会认为什么呢？说儒家文化太注重礼节了，为什么呢？孔子在那个时代，他是礼崩乐坏的时代，为什么孔子要重新推行周礼呢？是因为人们内在开始没有仁德了。没有仁德，用礼是来约束人们的。</span></p><p><span>这些宗庙之礼也好，这些祭祀之礼也好，人们在去参加这些祭祀和宗庙之礼的时候，是不是起码行为上是合礼的？他是想人们通过这个行为去建立内在的仁德。其实我们到现在也是一样的，我们现在修行是不是要用戒？是不是要用礼？为什么要用戒和礼呢？就是因为我们自己的心念，还没有那么光明；是因为我们的行为，还不足够的良善，所以用戒和礼是来约束行为的，都是其实约束行为不是最后的目的，最终的目的是通过行为的约束，可以让我们内心的欲望变得越来越少，这才是大家守戒的意义。</span></p><p><span>比如说一开始我就是想吃肉，我就是想喝酒，可是我们守了戒以后，我不能吃、我不能喝，是不是时间长了，我们就养成一个新的习惯了，那个时候让我们吃也不吃了，这个时候就叫不戒而戒。</span></p><p><span>所以其实所有的事情都一样，只不过人们只讲礼，不讲背后的仁德，不知道通过礼到底要来修正什么。所以我们讲《中庸》为什么想讲里面的东西，要不然大家讲宗庙之礼、讲祭祀，和我们有什么关系呢？其实是想告诉大家，看似是祭祀，他告诉的是我们道的循环规律，他告诉的是我们通过祭祀要懂得敬重祖先，敬重先贤，敬畏天地，这都是道的一部分。</span></p><p><span>所以这一段大家不太好理解，不太好理解没关系，因为关于礼仪的事情，祭祀的事情，离我们比较遥远，所以我们不用去理解字面是什么意思，我们懂得它后面的规律在讲什么就好了。</span></p></div>"
},{
    "title": "《中庸》第十四讲 修身以道",
    "author": "虚空先生",
    "date": "2022-07-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十四讲 修身以道</strong></span></p><p><span><strong>哀公问政。子曰：“文武之政，布在方策。其人存，则其政举；其人亡，则其政息。人道敏政，地道敏树。夫政也者，蒲卢也。故为政在人；取人以身，修身以道，修道以仁。仁者，人也，亲亲为大；义者，宜也，尊贤为大。亲亲之杀，尊贤之等，礼所生也。在下位，不获乎上，民不可得而治矣。故君子不可以不修身；思修身，不可以不事亲；思事亲，不可以不知人；思知人，不可以不知天。”</strong></span></p><p><span><strong>哀公问政。</strong>鲁哀公问孔子如何治理朝政。</span></p><p><span><strong>子曰：“文武之政，布在方策。”</strong>文武指的周文王和周武王，周文王和周武王治理国家的政策。“布在方策”，布：是记载的意思。方策：是典籍。周文王和周武王如何治理国家的，都记载在典籍之上。</span></p><p><span><strong>其人存，则其政举；</strong>其人存，这里的人指的是圣君和贤臣，他治理国家的方法都记载典籍当中。如果有圣君和贤臣去推广，则其政举，就能实行的下去。</span></p><p><span><strong>其人亡，则其政息。</strong>如果没有圣君，没有贤臣去推行，则其政息，政就会停息。言下之意在讲什么呢？政策、方法都在典籍当中记载，可是如果没有贤德之人去推行，我们看到了典籍和方法也是没有用的。</span></p><p><span>包括延伸到我们现在也是一样的，我们拼命地向外去贪求、去学习方法。可是如果我们自己本身不修贤德，我们自己不能去推行，会发现学了方法也是没有用的。</span></p><p><span>所以我们经常来赞叹周文王和周武王的德行，而不是赞叹他当时所用的方法，方法如果不是碰到有贤能之人，它是推行不下去的。</span></p><p><span>我们整个上两讲都在讲舜帝，都在讲周文王，都在讲周武王，都在讲宗庙之礼，都在讲子孙保之。整个这一段都在告诉我们是因为周文王和周武王，他们的所作所为，是合乎天道的，所以才会有后世子孙保之基业。</span></p><p><span>整个《中庸》都在告诉我们：<strong>“天命之谓性，率性之谓道，修道之谓教。”</strong>如果我们自己做的事情是合道的，是合乎于自己本来的天性的，这时事情才能做大。事情做得有多大，后世才会有多少人来承保我们的基业。</span></p><p><span>为什么我们今天还在学习孔子的文化，是因为孔夫子有那么大的德行，他是合乎于天道的，是合乎于天性的。所以到现在我们还在传承着孔夫子的文化，我们还在讲着周文王和周武王的贤德的故事，是因为他自己本身有那么大的德行，合乎于天道，合乎于天性。</span></p><p><span>所以告诉我们，要懂得依乎中庸之道，我们依乎中庸之道有多少，就取决于我们的事情做得有多大，有多少人来承载我们的事情，这就是道的运行规律。</span></p><p><span>所以这里哀公问政，孔夫子又一次提出，说：“文武之政就在写典籍当中。可是不是那个方法，能让你治好国家的，是你自己要是一个圣君，你要懂得用贤臣，你才能治理好国家。否则你只学习典籍上的方法，是没有用处的。”接下来开始举例了。</span></p><p><span>人道敏政，地道敏树。说你人要是合道的，就能促进和有利于政治；如果你是无道的，你就不会促进于政治的发展。</span></p><p><span><strong>“地道敏树”，</strong>地要懂得包容，要懂得承载，要能滋养万物，土地是肥沃的，才可能有利于树的生长。如果土地不是肥沃的，树怎么才能生长更旺盛呢？所以其实所有的事情都在告诉哀公：“你要自己修仁德，你要自己纳贤臣，方法才有用。否则，一味地向外学习方法，是不管用的。”</span></p><p><span><strong>夫政也者，蒲卢也。</strong>蒲卢：是蒲草和芦苇。这里举了两个生命力特别旺盛，长得特别快的芦苇和蒲草为例，在告诉什么呢？政治就好比是蒲草和芦苇，长的那么快，如果推行的是仁政，也会像芦苇一样如此的旺盛；如果推行的是暴政，不是仁德之政，也会像芦苇一样，迅速地生长和蔓延。</span></p><p><span><strong>故为政在人；</strong>所以说，要想做好政治，要想治理好国家，在人而不在方法。周文王和周武王，如何治国的方法，典籍上都有记载，可是我们如果没有周文王和周武王的仁德，没有人家的德行和仁爱之心，学习了方法也是没有用处的。</span></p><p><span>所以告诉我们故为政是在人的，不要一味地向外去寻找方法，而是要懂得以人为本，要懂得修身为本。所以接下来就讲了。</span></p><p><span><strong>取人以身，</strong>说为政是在人的，那接下来选取什么样的人？取人以身，要选懂得修身之人。如何修身呢？</span></p><p><span><strong>修身以道，</strong>修身是要让自己的身体，让自己的行为去合道的，所以又回到开篇了：<strong>“天命之谓性，率性之谓道”，</strong>我们要合乎于自己的本性，合乎于自己的良知，去修身，让自己的身体的行为去合乎于道。</span></p><p><span><strong>修道以仁。</strong>如何修道呢？先修自己的仁爱之心，内在是有仁的，外在才能有德，我们说一个人有德行，是他内在有仁，外面的行为才可能有德。</span></p><p><span><strong>仁者，人也，亲亲为大；</strong>什么叫仁呢？这里给我们概念了：仁者，人也，亲亲为大。我们看仁字怎么写，一个人加一个二，两个人以上，我们和别人交往的时候，才能体现出仁德；如果你自己和自己交往，是体现不出来仁的。当我们和人交往，懂得爱别人，懂得仁爱别人，这个时候才能构成一个仁字。</span></p><p><span>所以说<strong>“仁者，人也，亲亲为大。”</strong>要懂得和别人相处，亲爱别人，爱护别人，所以叫亲亲为大。这里用了两个亲，亲亲为大，第一个亲是亲爱的意思，第二个亲是从身边的亲人开始爱护，所以叫亲亲为大。</span></p><p><span>我们先要懂得去爱护身边的人、爱护自己的父母、爱护自己的孩子、爱护自己的另一半、爱护自己的朋友、爱护出现在自己身边的每一个人。然后进而再把我们的仁德不断地扩大到泛爱众，去爱护更多的人，这是修行的次第，这是修仁德的次第。</span></p><p><span>儒家是讲人伦关系的，是讲五伦的，所以从我们身边的人开始爱起，我们再不断地延伸扩大到一定的境界，就是泛爱众。</span></p><p><span>也就是《道德经》里所讲的：<strong>“天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗”</strong>。修到圣人的境界，他的仁德是没有偏私的，看待百姓都是一样的仁爱，也就是泛爱众。所以这是次第，先从身边的人开始爱起。</span></p><p><span>也就是《论语》所讲的：<strong>“近者悦，远者来。”</strong>先让接触过我们的每一个人，都能是喜悦的，都能得到我们的爱护，感受到我们的德行，远处的人自然就会来到我们的身边，我们才能去施行更大的仁德。</span></p><p><span><strong>义者，宜也，尊贤为大。</strong>讲完仁，又开始讲义。这个义和我们现在的理解不太一样，我们现在说做事情要讲义气，而古文化的义是从宜开始的。义者，宜也，这个宜是适宜、适度的意思，说什么叫义？就是我们做任何事情都是适宜的、都是适度的、都是合适的，掌握好分寸的，这个叫宜也。</span></p><p><span>尊贤为大，要懂得去尊重贤德的人，这个才是最大的事情。为什么呢？我们刚开始学习，刚开始修行，只有尊重和亲近那些贤德之人，我们自己才会受到这些贤德之人的影响，受到贤德之人的教化。</span></p><p><span>很多人在生活当中经常说：“我不知道该做什么，我的人生没有方向。”越是这样，我们越要接近贤德之人，接近圣贤的文化，我们才能受到对方的影响，我们才能知道我们自己要立什么样的志，去做什么样的事情。我们为什么要学习圣贤文化？不就是在尊贤吗？</span></p><p><span>所以这个才是我们当下最大的事情，从这个事情再不断地去延伸，当我们学习了圣贤文化里面的品质、里面的德行，这个时候我们才能让自己变成一个贤德的人，去做更多利益他人的事情。</span></p><p><span><strong>亲亲之杀，尊贤之等，礼所生也。</strong>这里的杀，指的是层次。这里的等，指的是等级，告诉我们是亲疏有别的，我们去懂得亲近别人的时候，也是按层次来的，先从我们自己身边的人开始去亲近，然后我们再去亲近更多的人。</span></p><p><span>尊贤之等，尊重贤人也是分等级的。我们现在也是一样的，比如说我们和领导在一起，是不是要注意自己的说话方式；我们跟长辈在一起，是不是也要注意自己的说话方式，注意自己的行为，这都是尊贤之等。</span></p><p><span>礼所生也，这里面就包含着礼，我们经常讲：仁、义、礼、智、信，礼从何来？就是从这些亲疏有别，从尊重贤能之人的等级开始生出来的礼。</span></p><p><span>现在到了我们这个时代，礼变少了。我们觉得礼是一个很繁琐的事情，礼变少了，我们的仁爱之心也变少了。所以大家去试想一下，现在我们再参加一个公司的聚会，或者是到了春节，我们在走亲访友的过程当中，有多少人还有内心的仁德去尊敬老人、尊敬领导呢？</span></p><p><span>所以我们看表面上好像说我们尊敬老人只是为了守一个礼，如果我们真正明白，礼后面讲的是仁爱之心，如果我们是尊敬我们长辈的，会发现我们的行为自然就合乎礼。如果我们内心是不尊敬对方的，礼从何来？所以礼只是外在的表现形式，而内在的是看自己的仁德。</span></p><p><span>所以我们试想一下，如果我们做任何事情都是懂得“居敬而行简”的，和“居简而行简”的区别就出来了。这两句话来自于《论语》，说我们一种行为是居简而行简，另外一种行为是居敬而行简。</span></p><p><span>举个最简单的例子，比如说我们倒这杯水，本来我们倒这杯水给对方，本来是一个很简单的行为，如果我们心里是怀着敬畏的，去给对方倒一杯水，还是这样简单的行为，对方一定能感受到我们的礼。这个礼从何来呢？是从我们自己内在的仁德之心，是从我们尊敬对方开始来的。</span></p><p><span>所以我们一定要懂得这个道理，礼看似的表面形式，但是我们自己要懂得外面表现出来的这个礼，是我们内在是尊重别人的，是敬重别人的，是尊贤的，这个时候会发现我们居敬而行简，哪怕是一个很简单的行为，倒一杯水，给对方开一下车门，或者是跟对方打一声招呼，会发现对方都能感受到我们内心对他的尊重。所以礼看似表面的行为，里面怀着的却是自己的仁义和德行。</span></p><p><span><strong>在下位，不获乎上，民不可得而治矣。这</strong>句话是在下一章节的，写到这里很多人都说不通顺，也确实讲起来它是不通顺的，所以这里我们不解释这句话，到下一章节再讲。</span></p><p><span><strong>故君子不可以不修身；</strong>所以说君子一定要懂得修身之道，一定要懂得去修正自己的行为。不仅是哀公问政，要懂得修身，我们现在人际关系，如果不懂得修身，又如何去维护好呢？我们去做生意，如果不懂得修身，又如何把生意做好呢？我们去经营一段感情，如果不懂得修身，又如何把感情经营好呢？我们想教育好我们的孩子，如果我们不懂得修身，又如何把孩子教育好呢？我们去参加工作，如果不懂得去修身，我们又如何能把工作做得好呢？所以无论我们在做什么，都要懂得修身之道。</span></p><p><span><strong>思修身，不可以不事亲，</strong>如果我们想要去修身，不可以不事亲，就是侍奉我们自己的亲人。我们再延伸一下讲，就是不得不亲民：“大学之道，在明明德，在亲民，在止于至善。”大人的学问是要懂得不断地去明自己的德行，这个是内修。在亲民，就是不断地亲近和帮助更多的人，我们内在的德行才能得到更好的彰显。目标是止于至善，以善为我们自己行为的准则和导向。</span></p><p><span>所以这里又再一次告诉我们，人如何修仁？我们得亲民，得去帮助更多的人，才能修我们自己的仁。我们内在的仁有了，外在才能有德行，我们的行为才能变成有德行的行为，这就是在修身的过程。</span></p><p><span><strong>思事亲，不可以不知人；</strong>如果我们去想亲民，想仁爱更多的人，不可以不知人，我们要知人才行的。这里的知人，不是指知人性，不是知人性贪婪的部分。这里的不知人，告诉我们道不远人，道就在我们每个人的生活当中。“造端乎夫妇”，之前一直在讲造端乎夫妇，在讲“道不远人”，在讲“执柯以伐柯”，在讲“以人治人”，在告诉我们“君子之道有四”。这都是在讲仁，告诉我们：<strong>“正己而不求于人，则无怨。上不怨天，下不尤人。”</strong>在告诉我们：<strong>“君子居易以俟命，小人行险以徼幸。”</strong>这都在告诉我们，不可以不知人，更不可以不知人的行为是要合道的，人的本性都是纯真，都是善良的天性，所以我们要懂得知人。</span></p><p><span><strong>思知人，不可以不知天。</strong>所以又回来了，告诉我们要想知人，不可以不知道自己的天性。率天性而为才是合道的，修道才是合教的。这个时候我们自己做事情，一定要去合乎于道的标准，这个时候才会回归我们人本有的天性，本性具足的、圆满的天性。</span></p></div>"
},{
    "title": "《中庸》第十五讲 达道达德",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十五讲 达道达德</strong></span></p><p><span><strong>天下之达道五，所以行之者三。曰：“君臣也、父子也、夫妇也、昆弟也、朋友之交也，五者，天下之达道也；知、仁、勇，三者，天下之达德也；所以行之者，一也。或生而知之，或学而知之，或困而知之，及其知之，一也。或安而行之，或利而行之，或勉强而行之，及其成功，一也。”</strong></span></p><p><span><strong>子曰：“好学近乎知，力行近乎仁，知耻近乎勇。知斯三者，则知所以修身，知所以修身，则知所以治人；知所以治人。则知所以治天下国家矣。”</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>天下之达道五，所以行之者三。</strong>如何去达道、如何去修道呢？有五项，五个方面，如何去行呢？有三个方面。</span></p><p><span><strong> </strong></span></p><p><span><strong>曰：君臣也、父子也、夫妇也、昆弟也、朋友之交也。</strong>又开始讲“造端乎夫妇”，“道不远人”，就在我们的人伦关系之中。天下之达道五，从君臣，古代的君与臣的关系，就包含着道。父与子，父子关系就在道中；夫妻关系，昆弟关系，昆弟是指的兄弟姐妹，朋友之交也，我们的这些人伦关系当中，都是在道中运行的。</span></p><p><span>所以告诉我们，<strong>“仁者，人也，亲亲为大”</strong>。从亲爱我们身边的五伦关系开始做起，然后逐渐地扩大自己的仁德之心，到泛爱众，这个就是修行的次第和过程。</span></p><p><span><strong>五者，天下之达道也；</strong>五伦关系就是达道的过程，就是我们修自己仁德的过程。所以这里讲的是一个次第，绝不是修完这五伦关系就够了，不够的。再接下来是要泛爱众的，再接下来是要慈爱世人的，是要爱护所有的人。</span></p><p><span>所以这是我们入道的一个修行的次第，我们都从这五伦关系开始去修，让自己的仁爱之心不断地去扩大，才可能去爱众人，如果我们连身边的人还不爱，又如何去爱众人呢？</span></p><p><span><strong>知、仁、勇，三者，天下之达德也；</strong>智慧、仁爱、勇敢，三者是天下之达德也。要想让自己变得有德行，就要从“智、仁、勇”开始修起。</span></p><p><span><strong>所以行之者，一也。</strong>如何去行，如何去达德和达道呢？行之者一也，这里的一就是德，如何才能去达道？从人伦关系开始到泛爱众，最后回到一，都是自己有德。德从哪里修呢？从知、仁、勇开始修。</span></p><p><span><strong>或生而知之，或学而知之，或困而知之；</strong>有的人是生而知之，天生就有德行，有的人天生就有智慧，有的人天生就有仁爱之心，有的人天生就比较勇敢，所以这样的人是生而知之的，生而知之是可遇不可求的。</span></p><p><span>如果不是生而知之的人，我们就要做或学而知之的人，可以通过学习来达道，可以通过学习来增长智慧，可以通过不断地学习，来增长自己的仁爱之心，可以通过学习让自己变得勇敢，通过学习来增加自己的德行。</span></p><p><span>或困而知之，如果我们还不能去主动学习，就会困而知之，困而知之就是遇到了困难，遇到困难被迫知道，困而知之是要付出代价的。</span></p><p><span>比如在生活当中也是一样，有的人不懂得去学习如何去经营感情，当感情出现困难了出现挫折了，受到伤害了，我们才懂得去学习。</span></p><p><span>我们教育孩子也是一样的，如果我们不懂得主动去学习教育孩子的方法，那就要等到孩子学习出现了问题，我们才开始去学习，这个时候是要付出代价的。</span></p><p><span>我们做企业不是一样吗？如果我们不懂得主动地去学习，去做学而知之的人，那我们要付出巨大的代价以后，被迫才会明白很多道理，这就是困而知之。</span></p><p><span>所以不要让自己做困而知之的人，一定要努力地去学习，成长自己，让自己去合乎于道的规律，如此才能走得长久，让我们自己少受困难、磨难和挫折，所以每个人要懂得，积极努力地进取和学习。</span></p><p><span><strong>及其知之，一也。</strong>无论我们是生而知之、学而之知、还是困而知之的，到最后知道是一样的，只不过过程不同。</span></p><p><span><strong> </strong></span></p><p><span><strong>或安而行之，或利而行之，或勉强而行之。</strong>仅是知道还不行，还要“行”，所以才有阳明先生的“知行合一”。刚才讲的是“知”，现在开始讲“行”，知道了以后，有的人安而行之，就是很安然地去做事情。有的孩子就是安而行之的，不用去跟他讲学习的好处，也不用去要求他去学习，他自己就懂得去学习。</span></p><p><span>比如说企业当中，也会有安而行之的员工，不用去督促他做事情，他就知道努力地做事情。比如说有的人热爱学习，不需要跟他讲学习的好处，他自己本身就是热爱的，所以这样的人，都是安而行之的人。</span></p><p><span>像有的人，他天性就善良，有的人他天生就智慧，他总去帮助别人，不需要跟他讲为什么要帮助别人，如何是合乎道的，他本身就是安而行之的人，他本性的部分就是合道的。</span></p><p><span>或利而行之，利就是为了利益去做事情。利而行之，我们再延伸一下，我们一定要懂得去如何应用。比如说孩子，他不能做到安而行之，这时我们要懂得用利而行之。这里的利，不只是利益，还有鼓励的方法。比如说孩子不学习，我们要去想办法鼓励他去学习，这也是利而行之。</span></p><p><span>比如员工不上进，不努力工作，我们也要懂得利而行之，去找到激励他、鼓励他的方法。有的企业用的是绩效，有的企业用的是股份，有的企业用的是提成，有的企业用的是文化，是提升他的信仰，提升他的文化，提升他的价值观，这都是利而行之。</span></p><p><span>同样对我们自己也是一样的，如果我们做很多事情，不能安而行之的时候，我们也要找到激励自己的方法，让自己前行，进而去影响更多的人。或勉强而行之，如果不能安而行之，利而行之也不管用，最后就是勉强而行之了。</span></p><p><span>很多人让孩子写作业是不是就是这样的？孩子不写，最后一招就是他再不写，揍他，体罚，没办法，逼着他去做。有的企业当中是不是一样的？抓紧做啊，再不做就罚款啦，这都是勉强而行之，无奈之举。</span></p><p><span>所以勉强而行之，所产生的力量是最小的，所以说我们尽量不要勉强而行之，一定要自己努力地去想更多的方法，激励着自己和他人去前行，去利而行之。</span></p><p><span>及其成功，一也。无论是安而行之，还是利而行之，或勉强而行之，及其成功，这都是事情的结果做出来。一也，是一样的，这里讲的一也，呈现出来的结果是一样的。</span></p><p><span>我们再往深了延伸，虽然看似呈现出来的结果是一样的，那件事情最后还是去做了，或者即使是困而知之，最后还是知道了，结果看似是一样的，过程是不一样的。有的人做的是开心的，有的人是喜悦的，有的人是被勉强的，有的人是被迫的，有的人是被痛苦的，所以结果看似一样，但实则过程不一样。</span></p><p><span>所以如果要想让自己变得安然，变得喜悦、自在，从容地去知和行，我们就要努力地学而知之，就要努力的利而行之，这样过程才减少痛苦。我们懂得这个道理，这样去修正自己，也这样去引导身边的人，让他们过程减少痛苦。</span></p><p><span>我们如何才能增长自己的智慧？如何才能增长自己的仁爱？如何才能让自己变得更勇敢呢？接下下来告诉我们方法。</span></p><p><span><strong>子曰：“好学近乎知，力行近乎仁，知耻近乎勇。”</strong>怎么样才能有智慧？好学就近乎有智慧了，我们要多努力地学习，多读圣贤书，多学习圣贤的文化，圣贤书就是总结的道理，教给我们，我们努力地去学习，这样就能增长智慧。</span></p><p><span><strong>“力行近乎仁”</strong>，只知道是不行的，知道最多算是知识，不是智慧，力行近乎仁，我们只有身体力行地去做、去实践，我们的仁爱之心才会增长，才会经过内化转变为智慧。</span></p><p><span>所以才有阳明先生所讲的知行合一，“知是行之始，行是知之成”，只有我们自己真正地做到了，我们的知识才会转变为智慧。</span></p><p><span>所以《论语》开篇就讲：<strong>“学而时习之，不亦说乎”，</strong>告诉我们学而时习，习是什么呢？不光是温习，不断地去实践，不断地去应用，这个才叫学习。我们很多人都是学而不习的，只是学到了一些知识，但是并没有去应用到自己的生活和工作当中去，没有习，哪来的喜悦呢？</span></p><p><span>反而不断地学是痛苦的，因为没有习，并没有把它转化为自己的东西。所以这里告诉我们知和行的概念。“好学近乎知zhì”，近乎知，不等同于知，力行近乎仁，我们去身体力行的时候，就接近于仁德了。</span></p><p><span>所以说一定要知行合一，不断地学而时习之，才能不亦说乎。我们只有不断地去学习，增加了自己的知识，通过行为增加自己的仁德，转化成为了自己的智慧。这时候我们才能“知耻近乎勇”，我们的羞耻之心是从哪里来的？如果我们没有学习之前，我们不觉得做很多的事情是不对的，是不合道的，不知耻。这里的知耻不是贬义词，是知道自己的过错和不足，才是最勇敢的人，最勇敢的人是战胜自己的人，是超越自己的人。</span></p><p><span>我们如果不知耻，不知道自己身上的过错和不足，我们怎么能超越自己呢？我们又如何能修正自己，让自己更合道呢？</span></p><p><span>“耻”一定是在我们的知和行之后的，如果我们没有去学习，没有通过行为不断地去修正自己，我们是看不到自己的过错的，也就不会成为一个真正勇敢的人，这就是我们修行的次第。有了知、仁、勇，我们自己的德行自然就得以彰显。</span></p><p><span><strong>知斯三者，则知所以修身。</strong>知道了这三者，我们才知道如何去修身。</span></p><p><span><strong>知所以修身，则知所以治人。</strong>我们只有知道了如何修身，才能知道如何治人。我们先讲这里的治人，是分内和外的，首先想治他人，先治己。</span></p><p><span>这里的治人，第一层一定是先治己，先去治理自己、去修正自己，进而影响他人，才能治理他人。他人，更多的是靠我们影响的，我们去治理好自己，自然就去影响他人，也就达到了治人的结果。</span></p><p><span><strong>知所以治人，则知所以治天下国家矣。</strong>我们知道了如何治理自己，如何影响他人，自然就知道了如何治理天下国家。</span></p><p><span>所以从“哀公问政”开始，告诉我们修身的道理，当我们懂得修身，就能治人；当我们懂得如何治人，自然就治理天下国家，就回答了哀公问政。</span></p></div>"
},{
    "title": "《中庸》答疑解惑",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》答疑解惑①</strong></span></p><p><span>“生而知之”、“学而知之”和“困而知之”。我们首先要想做一个学而知之的人，第一点是不要困惑，我们不困惑才能去学而知之。当一个事情我们出现困惑的时候，是不会学习的，出现困惑的时候就抱怨了，抱怨别人不好、抱怨社会不公、抱怨他人不对，这个时候我们怎么会去学习呢？</span></p><p><span>所以要想学而知之的前提是不困惑，不困惑不代表我们能解决问题，而是不会因为解决不了这个问题而抱怨，而去觉得这个事情有多困难，这个时候我们才能去学而知之，否则是不可能学而知之的。</span></p><p><span>比如说我们大家在工作的过程当中，当出现了一个难题，不会，是不是困惑了？这个时候困惑了，什么样的人能学习？首先是不抱怨的。“说我这不会，说明还是我自己不足，我得去学习才能让自己会。”那我们去思考：这件事情有没有人会？一定有人会的，只是我还不会，这个时候会发现我们才能去学习的。</span></p><p><span>如果困住了是不会学习的。比如说出现一个事情，“我干不了，我不会，我又不是专业的，你找别人干去吧”。这个时候就真正地困住了。所以我们首先先要解决的第一个问题，是出现了问题不困惑，去不停地反复地再去学习。学习什么？学习知识。学习完知识呢？去“力行近乎仁”，这个时候我们的仁德就会不断地去增加。</span></p><p><span>这个过程当中我会跟大家讲咱们未来虚空济的理想，未来咱们的方向，但是你看讲完之后，我什么时候着急过？好像讲完了这个事情就忘掉了。为什么呢？那是我们的方向，我们的方向通过什么才能达到呢？是通过我们停下来不断地学习、不断地修行、不断地让自己合道、不断地积累我们自己的德行，我们才能达到那个结果。那个结果不是求来的，是自己修来的。</span></p><p><span>就像整个《中庸》所讲的，周文王和周武王不是我想着后人是不是祭祀我。这些圣贤没想着说后人是不是后面的时候还会供奉我们，还会去学习我们的文化，他不需要想。自己合了多大的道，事情就会做的多大，文化就能传承多久。</span></p><p><span>所以我们去看现在我们所有所推举的圣贤，都是他自己的德行合乎于道。所以老子告诉我们：“圣人无私，故能成其私。”圣人当时做这些事情，他是没有私心的，所以才成就了他最大的私，我们到现在还去赞扬，还去赞美。</span></p><p><span>我们再反过来说思维。会发现现在我们是不是学习的时间越长、修行的越久，能困住我们的事情越少？为什么呢？是我们先学就不受困了，而不是等着困住再学，等着困住再学的人，已然是困而知之了。</span></p><p><span>比如说有的人，夫妻感情已经闹到离婚了，孩子已经闹到叛逆了，企业已经面临倒闭了，我们才被迫去学习，这叫困而知之。这个时候为时已晚，是需要付出巨大的代价的。</span></p><p><span>我们首先遇到不会的事情，第一点，不困惑。第二点，即使我们没遇到困难和让我们挫折的事情，我们就不断地去学习，就是为了不让困难出现，这就是《道德经》讲的：“其未兆易谋”。不是等着那个问题发生了，我才去被迫去学习，那个时候已然付出代价了，而是事情在未发生之前，我们就不断地去努力学习，让自己少受困苦。</span></p><p><span>包括我们为什么要学道？为什么要让自己的行为合道呢？我们让自己的行为合道，不就是为了少出困难、少出困苦吗？所以为什么跟着学习的朋友，时间越长的、修行越好的，会发现原本生活中让我们痛苦的事情、觉得困难的事情没有了，不出现了。这个时候是我们学习以后所达到的结果，所以这个就是学而知之的用处。因为生而知之，不是我们想生而知之就能生而知之的，所以只能通过学而知之。</span></p><p><span>话再说回来，谁的生而知之又不是学而知之呢？只不过是什么时候学的罢了。所以苏东坡说：“书到今生读已迟”。就像我们经常说，某一个孩子有天赋，说这个孩子天生画画就好，天生唱歌就好，哪里来的？生而知之，生而知之是哪里来的？还是学而知之。</span></p><p><span>什么叫中呢？这不叫中。我们以为放在中间就叫中吗？举个例子还是这个东西，一头大一头小呢？你要放在中，它平吗？中是为了平，是为了和。假如这有个秤在这晃，你不一定放在中上，它才保持平衡，它可能往左边一点，也可能往右边一点，因为取决它东西不一样，事情不一样。</span></p><p><span>比如说他们两口子吵架了，男的在这说，女的她就一直哭，明明知道这件事情女方做的不对，但是她就一直在哭，难道还非得要说她不对吗？那她不哭得更厉害吗？当下可能说:“你看你一个男人，你为什么不懂得忍让？你看她都哭成这个样子，她没错。”然后把这个事情平息了，和了,这个时候才叫中。“中”接下来之后，再私下找她解决，把这个事情处理圆满了，找到合适的度叫中。</span></p><p><span>为什么会有不顺呢？什么叫不顺？逆，就是逆着我的想法就叫不顺。所以不顺从哪来？不是从我们觉得它逆了吗？它不顺我的心呢？但是我们觉得不顺你的心了，别人未必。</span></p><p><span>我们浅层的理解什么叫心正？说善良就是心正，不是的。我们经常举例，这样的（杯子歪着拿），你能说这杯子是正的吗？不能说它坏，它是歪，但是它不坏，为什么叫歪，它动了。</span></p><p><span>所以什么叫正心？我不动，它没有所偏所倚。《大学》讲：“身有所忿懥，则不得其正；有所好乐，则不得其正；有所忧患，则不得其正。”我们没有好乐，没有自己的喜好，没有忿懥，没有忧患，它就是正的。既然它是正的，什么都没有，哪来的不顺？所以会发现我们的心越正，我们的生活就越从容。</span></p><p><span>什么样的人吃饭很开心呢？就是我们做什么都行。什么样的人吃饭不开心呢？我喜欢吃辣，没做辣；我不喜欢吃辣，今天做饭做辣了，是不是就开始不顺心？什么叫随遇而安？做什么都行，做什么都好吃，吃包子就吃包子，吃米饭就吃米饭，擀面条就擀面条，辣就辣，不辣就不辣，都行，就没有不顺。</span></p><p><span>那再举例子，录视频不也是？我没有自己那么多的要求和标准，你二十分钟停就停，十五分钟停就停，三十分钟停就停；既然已经三十分钟，那我就多截一下，费点事；既然已经十五分钟，我就凑两段，哪来的不顺？</span></p><p><span>为什么我们说要在事情当中才能修行？就是因为在这些小事情当中，我们才能发现：“啊，原来还是我的心不够正。”但是不是说他错了，没有对错，境界不同，何来对错？</span></p><p><span>我跟你们说话不是这样的吗？前两节课咱们时间太长了，你们要注意，这是什么？下次注意，而不纠结于已发生的事情。那它已经二十五分钟、二十九分钟了，你说你再去执着，你自己不舒服，他人也不舒服，何必呢？</span></p><p><span>所以我们说的任何事情，都是解决于接下来发生的事情，而不执着于过去。</span></p><p><span>我们出去玩，住在哪里都行；吃什么随意安排，愿意吃什么就吃什么；今天走到哪里，就是哪里；今天我做事情，我没有自己那么多的标准，大家怎么做就怎么做。但是没有自己的标准，不代表自己不提出意见，而是不执着。要不提出意见，那叫没有主见，可是我提了，但是我又不执着于那个结果，这个时候叫正心，这个时候人的境界是不同的。</span></p><p><span>孔子的文化也一样，我又想教化于所有的世人，但是我又不执着于教化所有的世人，我们既想帮助所有的人，可是我不执着于所有的人都一定来接受，这个时候我们才不执着。</span></p><p><span>我常讲的两句话，<strong>“圣人无常心，以百姓心为心。”</strong>圣人没有自己的标准，以百姓的标准为标准，这个时候的境界就不同了。哪有什么执着和不顺的？没有，都一样，这个时候的境界的人，才能真正随遇而安。</span></p><p><span>为什么能随遇而安？我们没有自己的标准才能安，我们都是自己的标准能安吗？他说的话我不高兴了，他说的话语气声大了，今天他做的不可口，今天那屋太冷了，明天屋太热了，会发现我们的标准太多了，所以会觉得生活充满着不顺，全是自己设定的标准。然后一般的朋友还听不懂，他说那不是没有标准吗？那不是没有原则吗？不是。</span></p><p><span>然后我们再回到《中庸》，什么叫中？<strong>“喜怒哀乐之未发，谓之中”，</strong>我们没有自己的标准，我们才没有喜怒哀乐。要是有自己的标准，不就有喜怒哀乐吗？没按照我的标准就不顺心，不顺心是不是就是怒了？生气了？</span></p><p><span>所以当我们没有什么标准的时候，才能处于中的状态，它是随顺自然的，事态怎么发展，我就怎么随着走，都一样，没所谓的事情。</span></p><p><span>中是不能用的，没有喜怒哀乐能不能用？不能用。“发而皆中节,谓之和”，就是以和为贵，什么时候发，要不要提意见？要。但是提意见是以和为贵的，为了让这件事情做得更好，这个时候的发有没有情绪？没带情绪，所以我们才能发而皆中节。</span></p><p><span>我们要是带着情绪，能发而皆中节吗？脸上就写着我们的情绪和不满意。但如果我们是中的状态，是为了这件事情的和，或者为了这件事情的结果更好，我们发了，这个时候“发而皆中节”。说：“你看这个事情，咱们不能这样弄，咱们怎么怎么做，这个呈现出来的效果才会更好。”别人感受不感受得到我们的境界和修为，还有包容？所以这叫“中和”。</span></p><p><span><strong>“致中和，天地位焉，万物育焉。”</strong>要把中和这两个字，我们把它不断地去用在自己平时的言语当中、用到工作当中、生活当中，我们会发现无往而不利。</span></p><p><span>中和这两个字实在是强大。大，可天地位焉，万物育焉；小，它可以融入到我们生活的点点滴滴。但是我们要懂得中，我们要懂得喜怒哀乐之未发，我们才能“中”，这个时候我们才能去以和为贵。要是情绪一起，还有和吗？没了，全是不和，全是不顺，全是逆。</span></p><p><span>所以中和这两个字，实在是中华文化的精髓，到处可用，可大可小，点点滴滴都包含着。</span></p></div>"
},{
    "title": "《中庸》第十六讲 修身立命",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十六讲 修身立命</strong></span></p><p><span><strong>凡为天下国家有九经，曰：修身也，尊贤也，亲亲也，敬大臣也，体群臣也，子庶民也，来百工也，柔远人也，怀诸侯也。修身，则道立；尊贤，则不惑；亲亲，则诸父昆弟不怨；敬大臣，则不眩；体群臣，则士之报礼重；子庶民，则百姓劝；来百工，则财用足；柔远人，则四方归之；怀诸侯，则天下畏之。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“凡为天下国家有九经”，</strong>为：治理。经：指的是法则、真理。这句话翻译过来，凡是要治理天下国家的，有九条法则或者说有九条真理。</span></p><p><span><strong>曰：“修身也，尊贤也，亲亲也，敬大臣也，体群臣也，子庶民也，来百工也，柔远人也，怀诸侯也。”</strong>有以上这九条法则和真理。首先是从修身开始，无论是《中庸》还是《大学》，都告诉我们：<strong>“自天子以至于庶人，皆以修身为本。”</strong>这里面又告诉我们，凡是要治理天下国家，再延伸一下，无论我们想要做任何事情的真理都是不变的。</span></p><p><span>第一件事情的根基一定是懂得修身，我们一定要懂得修正自己的行为。接下来是“尊贤也”，我们要如何修身呢？我们得尊贤德的人，如果我们不去尊那些贤者，不去尊那些圣者，我们又该如何懂得修身之道呢？</span></p><p><span>所以尊贤是很重要的事情，我们效仿贤德之人来修正自己。当我们的人生没有方向的时候，当我们出现迷茫的时候、出现困惑的时候，只有尊重贤德的人，向贤德的人学习，我们才知道如何修正自己的身、修正自己的行为。</span></p><p><span><strong>“亲亲也”，</strong>从亲近身边的人开始，所以叫亲亲。从亲近身边的人开始，帮助身边的人开始，爱护身边的人开始，然后不断地延伸去爱护更多的人。</span></p><p><span><strong>“敬大臣也”，</strong>敬重大臣，所有事情的次第都是由近到远，敬大臣也是一样的。敬重身边的大臣，说我们想要治理天下国家，想要治理朝政，首先要敬重身边的大臣。我们现在做事情不是一样的吗？我们要敬重身边跟我们一起做事情的人，这是我们做事情根基的主体。</span></p><p><span><strong>“体群臣也”，</strong>体恤群臣，大臣是核心，是我们的根基。就好比说一个公司，中层领导是我们的大臣。体群臣，就是我们所有的员工，我们要体恤所有的员工，体恤跟我们一起做事情的所有人，要体恤他们的不容易。</span></p><p><span><strong>“子庶民”，</strong>再进而延伸，要开始爱护子民了，所以以前都讲爱民如子。我们现在做事情也是一样的，不光我们要敬重身边的大臣，不光我们要体恤群臣，体恤我们所有的员工，我们再去爱护民众，再去延伸，要爱护所跟随我们的每一个人，要爱护我们的每一个客户，要爱护我们每一个消费者。</span></p><p><span><strong>“来百工也”，</strong>这里的来百工也，来：解释成招聘或者招纳的。我们如果去学习中庸之道，不尽然。这个来是什么呢？感召的意思，是他自动而来的。</span></p><p><span>所以大家去想一想，无论治理国家也好，包括我们做企业也好，做事情也好，包括我们修行也好，我们开始以修身为本，我们又懂得尊重贤德的人，去效仿贤德的人，我们又能从亲近的人开始去帮助，进而延伸到泛爱众。</span></p><p><span>我们又能去敬重身边跟着一起做事情的这些重要的人，又能体恤跟我们做事情的每一个人，又能去爱护更多的人、更多的我们的客户、每一个跟我们学习的朋友，这个时候自然就来百工。</span></p><p><span>因为这些人是被我们的明德，这些人是被我们做事情的善良，被我们做事情的恒心，被我们做事情的仁爱之心所感召而来的。所以他不只是招纳的，他一定是被感化而来的。听说你这个地方很好，他自愿来到你这个地方，这个时候才会有力量。</span></p><p><span>古代也是一样的，听说哪个君主是贤德的，他是爱民如子的，就会有很多贤才自动的找上门来，不是你招纳的，而是被你的品德所感召而来的。</span></p><p><span>那我们做企业不是一样的道理吗？以上我们是按照这个次第来修正过来的，按照这个次第来做事情的，别人家的客户听说我们这里服务特别好，听说我们这里的饭菜的口味特别好，听说我们这里的服务特别好，他自然就会被感召而来，这个时候我们的生意才会变得更旺盛。</span></p><p><span>我们再回来，这里的来百工，是指治理国家的时候，来了各种人才，来了各种工匠。那我们做企业做团队也是一样的，那我们的来百工就会有更多的人才愿意加入我们，陪伴我们、帮助我们一起去做事情。再往下一层讲，就会有更多的消费者，更多的客户感召而来，愿意从我们这里去消费，愿意跟我们一起去做生意，所以这个是感召的力量。</span></p><p><span><strong>“柔远人也”，</strong>柔就是优待远方的客人，我们懂得去爱护和优待远方的客人。</span></p><p><span><strong>“怀诸侯也”，</strong>怀诸侯就是关怀和安抚。首先我们说怀，什么叫“怀”？放在心里叫怀，所以叫心怀天下、心怀诸侯。当我们放在心里去关怀一个人，这个时候我们才能对他是宽容的，才能懂得如何去安抚他。所以这里告诉我们是怀诸侯，说做天子的人，要心怀天下的诸侯。</span></p><p><span>接下来会继续讲何为修身呢？修身是种的因，那要懂得修身会得到什么样的果呢？</span></p><p><span><strong>“修身，则道立”</strong>，这里开始讲这九条真理，九条法则。我们要懂得修身这是因，所得的果就是道立，这个时候我们的道才能立得住，行的才是达道。因为我们的行为是端正的，自然我们的道就立得住，我们的品行就立得住。</span></p><p><span><strong>“尊贤，则不惑”，</strong>尊贤是因，我们为什么要尊贤呢？尊贤，我们所得到的果就是不困惑。因为贤德之人，他懂得如何去按照道，解决他自己的事情，解决他自己的问题，我们可以从他身上学到智慧。这个时候我们所得到的果，就是自己遇事情也不困惑，包括我们学习圣贤的文化，也是在尊贤。所以我们越是学习圣贤的文化，我们的困惑就会变得越少。</span></p><p><span><strong> </strong></span></p><p><span><strong>“亲亲，则诸父昆弟不怨”，</strong>亲近亲近的人，诸父就是我们现在讲，说叔父、伯父，我们的父亲这都叫诸父。昆弟是我们的堂兄堂弟。不怨，因为我们亲近身边的这些人，帮助身边的这些人，所以他们就不会产生怨恨。那是那个时候治理国家，说你自己有了显赫的地位，如果你身为一朝的天子，你要懂得先要去亲近整个宗族之人。</span></p><p><span>那个时候的诸侯国是怎么来的呢？周朝那个时候开始有天子，天子就把自己的宗亲宗族，还有立过功的大臣，每个人给了一块封地，这个时候才有的诸侯国。</span></p><p><span>包括我们说周文王、周武王都是姬姓，当时姬姓有五十三个宗族，被封为诸侯国，他的昆弟、诸父才不怨。包括我们之前也学过周文王、周武王在继位以后，开始追封大王、追封王季，都是为王的。所以整个都是在亲亲，都是从自己最身边的最亲近的人，先让他们去获利，先让他们有显赫的位置。</span></p><p><span>如果到今天，比如说我们做事情，自己有一些成果，或者我们的衣食比较富足的时候，我们不可独享，要惠及身边的亲人，这个时候他们对我们才不产生怨恨。</span></p><p><span>当我们有能力的时候，要想办法惠及昆弟，惠及诸父，就是我们叔父，我们的伯父，包括我们的父辈，这个时候他们自然就不产生怨恨，所以它的道理是通的。</span></p><p><span><strong>“敬大臣，则不眩”，</strong>当我们懂得敬重身边的大臣，这个时候则不眩，不眩就是做事情不慌不乱。我们现在在一个企业、在一个团队当中，是不是也同样的道理？如果我们敬重身边帮我们做事情的人，当遇事的时候是不是我们自己就不慌不乱？因为有这些人去承担、去承载这些事情。</span></p><p><span>那以前治理天下也是一样的，这些大臣可以帮你维护并且治理天下，所以无论遇到什么事情都是可以不慌不乱的，因为有人在做事情。如果我们平时不敬重身边帮我们做事情的人，遇到事情的时候，没人给你去承担，你自然就是慌乱的状态，任何事情都是有因有果的。</span></p><p><span>我们想要得到，遇事情有人帮我们承担这样一个果，那我们平时就要懂得去种因，去敬重每一个帮我们做事情的人。如果我们想遇事情的时候，没有那么多的困惑，我们就要懂得去亲近贤德的人，去效仿贤德的人，向他们去学习。只有这样，我们平时积累的这些因，遇到事情的时候我们才不困惑，所以任何事情有因必有果。</span></p><p><span><strong>“体群臣，则士之报礼重”，</strong>如果我们懂得体恤群臣，懂得体会他人的不容易，别人就会有报礼之心，就会有报恩之心，做事情才会竭尽全力。如果我们不懂得种因，不懂得体恤跟在我们身边的每一个人，我们会发现，当我们有事情出现的时候，别人也不体恤我们，别人也不会理解和体会我们的不容易。</span></p><p><span>所以任何事情，我们都要懂得先去种因，我们想要得到什么样的果，那个果不是求来的，而是我们自己踏踏实实地从平时就要懂得体会每个人的不容易，去体恤每个人的不容易，去包容和仁爱每一个人，这个时候别人才会以同样的心和力回报给我们。它是循环的，这个就是我们生活当中每件事情的因果。</span></p><p><span><strong>“子庶民，则百姓劝”，</strong>如果我们是爱民如子的，如果我们懂得去爱护他人的，这个时候则百姓劝。这里的劝是什么呢？就是被感化的。只有被感化，他才是积极向上的。包括我们现在说做企业，不是同样的道理吗？如果我们懂得爱护我们的客户，爱护每一个消费者，只有这样他才会被我们感化。</span></p><p><span>所以我们要爱我们每一个粉丝朋友，爱我们每一个跟我们共同学习的人，只有我们自己以这种至诚之心去爱护每一个人，去尊敬每一人，这些人才有可能被感化。所以治理国家是如此，今天我们做事情、我们的修行，道理都是相通的。</span></p><p><span><strong>“来百工，则财用足”，</strong>只有我们吸引了各样的人才，这个时候我们才能创造价值，才能创造财富。那个时候治理国家，只有来了各种工匠、各种人才，国家才能昌盛。我们现在的团队也是一样的，只有感召而来的各种人才，这个时候我们才能创造更好的价值。</span></p><p><span><strong>“柔远人，则四方归之”，</strong>当我们去优待每一个远方的客人来的时候，四方归之。尤其那个时候治理天下国家，因为都是诸侯国，如果你是优待远方的客人，你的美名就会传颂出去，就会有更多的人愿意来到你的国家。</span></p><p><span>现在也通用，我们如果懂得去优待每一个到我们企业当中来的人，我们懂得优待每一个到我们虚空济来的人，这个时候你会发现，四方听说这件事情，自然心之所向，自然愿意来到这里。</span></p><p><span>我们做企业也是同样的道理，我们去做生意也是同样的道理。比如说我们即使开一个饭店，也是一样的，我们优待来到我们这里的每一个客人，这个时候他在这里消费是舒服的，在我们这里吃饭他是快乐的，他是喜悦的，这个地方他是觉得值得留恋的，我们的美名自然就会传扬出去，别人也自然愿意来到我们这里。</span></p><p><span>所以任何事情都是有因有果的，因果并不玄幻，可能很多朋友把它理解成是一个玄幻的道理，其实不是的，生活当中点点滴滴都是有因有果的。</span></p><p><span><strong>“怀诸侯，则天下畏之。”</strong>这里的畏是敬畏、臣服的意思。如果我们的心里是怀着诸侯的，天下自然就是敬畏我们的，自然就是有臣服之心的。</span></p><p><span>这是整个告诉我们治理天下国家的九条真理和法则。同样我们延伸到现在，这也是我们做事情，立于这个社会之间的九条真理和法则。</span></p></div>"
},{
    "title": "《中庸》第十七讲 行之者一",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十七讲 行之者一</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>斋明盛服，非礼不动，所以修身也；去馋远色，贱货而贵德，所以劝贤也；尊其位，重其禄，同其好恶，所以劝亲亲也；官盛任使，所以劝大臣也；忠信重禄，所以劝士也；时使薄敛，所以劝百姓也；日省月试，既禀称事，所以劝百工也；送往迎来，嘉善而矜不能，所以柔远人也；继绝世，举废国，治乱持危，朝聘以时，厚往而薄来，所以怀诸侯也。凡为天下国家有九经，所以行之者，一也。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“斋明盛服，非礼不动，所以修身也。”</strong>斋明是指内心虔诚，以前是讲斋戒的，斋戒就是为了内心清净、内心虔诚。盛服是指外表要端庄，外表要端正。</span></p><p><span>所以这句话告诉我们，内心要是虔诚的，外表要是端正的，内在要有仁爱之心，外表我们自己所呈现出来的行为，是让他人看着舒适的，是可以表法的。</span></p><p><span>“非礼不动”，不合礼的事情我们是不动的。这里的不动我们再延伸一下，从浅的层面来讲，不合乎礼的事情我们不要产生行为，就是我们不去具体地去做。那再往深一层讲，不合乎礼的事情，我们的心念也不为所动，这个就需要长久地学习和长时间地修行。</span></p><p><span>刚开始我们可以不让自己的行为产生，说既然我产生了不合礼、不合法或者是不够仁爱的想法出来了，但是起码我们控制自己的行为，不让自己做出来什么越礼的行为，不合乎善良的行为。再接下来开始，经过一段时间的学习和修行，甚至我们不合礼的心念都不会动。</span></p><p><span>“所以修身也”，这样就是修身。整个修身告诉我们内外兼修，内心虔诚，外表端正，这样就可以修身了。</span></p><p><span><strong>“去谗远色，贱货而贵德，所以劝贤也。”</strong>去馋：就是摒弃谗言的意思。远色：就是远离女色、远离美色，这是大家通常的理解。我们再讲深入一层的色是什么呢？所有的有形态的、美好的东西都称为色。所以这里告诉我们远离那些物质的，让我们所贪恋的那些色相。如果浅层的理解就是远离美色。</span></p><p><span>贱货就是轻视的意思，货是代表着财物，代表着货品。所以我们要轻视而贵德，而要重注自己的品德修养。所以劝贤也，只有我们自己懂得摒弃谗言，只有我们自己远离这些色相对我们所带来的困扰和带来的诱惑，我们懂得轻视货品，而重注自己的道德修养、注重自己的品德。这个时候所以劝贤也，只有我们自己做到这样，才能感化那些贤德之人。</span></p><p><span>如果我们不懂得去修身，如果我们不懂得去培养自己的德行，又如何去感化那些贤德的人跟我们一起做事情和治理国家呢？所以整个天下国家有九经，也在讲以修身为本。</span></p><p><span>我们懂得修身的时候，我们才能劝贤，也就是才会有贤德的人，愿意来跟我们自己做事情。包括我们现在也是一样的，想把企业做大、想把团队做大，如果我们自己没有良好的德行，如果我们自己不是贵德的，而总是听信谗言，自己又被欲望所困惑，哪会有贤德的人愿意跟我们做事情呢？</span></p><p><span>所以我们自己是什么样的行为，我们自己注重什么，自然就会吸引什么样的人来到我们的身边。</span></p><p><span>很多朋友做公司的、做企业的，在跟我聊天的过程当中都在抱怨，他说他的员工不积极，说他的员工不上进，他的员工每一个人都是利欲熏心的，这些人都是在为了钱做事情。</span></p><p><span>我说：“是啊，因为你也是在为了钱做事情，所以你吸引来的自然就是这样的人。如果你自己是懂得贱货而贵德的，你要是轻视财货的，你要是很注重自己的道德品行的修养，如果你做事情是真的从客户的角度去出发的，你只有这样才能吸引跟你一样的人。”</span></p><p><span>所以说我们一定要懂得这个道理，我们的员工是什么样子，他是我们自己吸引而来的。为什么看着别人家的员工好？一样，别人家的员工也看着别人家的老板好。所以道理是相通的，要想有贤德的人跟着我们，那我们要去种因，首先自己要去变成一个贤德的人。</span></p><p><span>如何让自己变成一个贤德的人？先要去尊贤，尊重那些贤德的人，去学习那些圣贤文化，把我们自己变成一个贤德的品格。这个时候所以劝贤也，我们才能感化那些贤德的人来到我们身边。</span></p><p><span><strong>“尊其位，重其禄，同其好恶，所以劝亲亲也。”</strong>尊其位，就是提高他们的位置，提高他们的地位，尊重他们的地位。“重其禄”，要给他们相应的丰厚的俸禄。这个禄我们再延伸一下，到现在这个社会，这个禄代表是什么呢？每个人想要的东西不一样。因为这里讲的是亲亲，有的人想要的是陪伴，有的人想要的是金钱，有的人想要的是物质，有的人想要的是安慰，每个人所想要的禄是不一样的。所以既然是亲亲，要什么给什么，尽己所能地去满足对方，去给予对方。</span></p><p><span><strong>“同其好恶，所以劝亲亲也。”</strong>和他有相同的喜好，我们才能懂得去亲亲，我们身边的亲人，才不会对我们产生抱怨。</span></p><p><span><strong>“官盛任使，所以劝大臣也。”</strong>官盛任使就是加官任命，重用的意思。说我们只有看到这些有能力的贤臣，我们要懂得去给他加官，并且要懂得去重用，所以劝大臣也，才能感化大臣。</span></p><p><span>这里的劝我们再延伸一下，第二层意义，刚才我们讲劝是感化，第二层意义是积极努力。我们感化以后，他才会积极努力地去做事情。</span></p><p><span>所以当我们去劝大臣也，达到了感化的效果。感化完以后，他才会积极努力地去做事情，包括我们说我们感化身边的每一位员工是不是同样的道理？他受到了感化，他才会积极向上地去努力。</span></p><p><span>所以我们看身边的每一个人都是一样的，当一个人发自内心地真诚努力地做事情，他诚心诚意地做事情，不是管理来的，管理来他是表面在努力，但是内心并没有真正地去努力做事情。所以只要是被感化的，他才能发自内心地去积极努力，这个叫劝。</span></p><p><span><strong>“忠信重禄，所以劝士也。”</strong>忠信，就是我们做事情是讲忠的，并且又是诚信的。重禄，一定是要给相应的报酬的。现在我们很多人都喜欢画饼，画饼没错，但是画完饼要实现。如果只是画饼不实现，就是不重禄，就是不讲忠信。</span></p><p><span>很多企业刚开始，大家的信心满满，都在努力地做事情。如果只是画饼，但是不重禄，没有实现，会发现很多有能力的人就开始离开了。因为你说的话不兑现，你是不讲忠信的，他又如何一直跟随着你呢？所以告诉我们忠信重禄，所以劝士也，只有这样才能感化这些有志之士。</span></p><p><span><strong>“时使薄敛，所以劝百姓也。”</strong>在用民的时候，要赶到合适的时节。比如说农忙的时候，不要征收人民去做事情，不要役使百姓去做事情。</span></p><p><span>在以前，比如说要修建城池，或者比如说征兵，都是要征使百姓的，但是要懂得用民以时，要在合适的时节，不耽误正常劳作，不耽误正常的农民种地的时节，所以这个叫使民以时。</span></p><p><span>这里告诉我们我们就是时使，要役使百姓的时候，要掌握好季节和适宜。薄敛就是减少税收，减少赋税。所以劝百姓也，如何感化百姓呢？在合适的时间用百姓，并且去减少税收，让每个人的压力变小，这样自然就感化百姓，让他们积极努力地去做事情。</span></p><p><span><strong>“日省月试，既xì廪lǐn称事，所以劝百工也。”</strong>日省月试，就是每日去考察，每月去考核。既廪称事就是通过他们付出的劳动，经过考核去给到相应的酬劳、报酬，用现在的话就叫绩效考核。所以劝百工也，这样我们才能用百工，才能感化百工，让这些工匠去积极努力地做事情。</span></p><p><span><strong>“送往迎来，嘉善而矜不能，所以柔远人也。”</strong>送往迎来，就是来的时候我们要欢迎，走的时候要欢送，远人，是远方的客人。 </span></p><p><span><strong>“嘉善而矜不能”，</strong>要懂得赞扬和嘉奖对方做得好的事情，懂得嘉奖对方的优点。“而矜不能”，矜就是同情，不光同情，还要去救济对方不知的地方，宽容对方不好的地方。</span></p><p><span><strong>“所以柔远人也”，</strong>我们要如何对待远方的客人呢？来的时候是欢迎的，走的时候是欢送的，身上有优点我们是赞扬的、是奖励的，是嘉奖的。身上有不足的地方，我们同情的同时，是救济的，是宽容的，所以柔远人也，我们自然就会得到四方归心。</span></p><p><span><strong>“继绝世，举废国，治乱持危，朝聘以时，厚往而薄来，所以怀诸侯也。”</strong>继绝世，是指以前有的诸侯国，没有子孙去承接的，这个时候要想办法去延续。举废国是帮助一些治理不好的国家叫废，荒废的国家，去帮助这样的诸侯国复兴。</span></p><p><span>“治乱持危”，去治理乱世，治理乱象，去扶持危难。“朝聘以时”，以前的诸侯是要定期觐见天子的，一年为一小聘，三年为一大聘，五年为朝，所以定时的要接受朝聘。</span></p><p><span>并且“厚往而薄来”，厚往就是人家走的时候我们给的多，而薄来就是我们要的少，对方的诸侯国所进贡的礼品，我们要加倍地更多地去给予对方，所以叫厚往。</span></p><p><span>包括我们现在生活当中也是一样的，如果我们自己的物质条件是颇为丰厚的，会有很多人来到我们这里，说来见我们也好，或者说来我们这里送礼也好，如果我们是心怀对方的，就应该这样的，让对方薄来而我们厚往，这样对方心里没有压力，并且他也愿意来到我们在这里。</span></p><p><span>尤其是比如说现在我们这个社会，逢年过节的时候，比如说我们要是身为长辈，其实有很多小辈按礼是要来的，但是有的人他的生活并不富裕，或者性格比较小气，就会阻碍他到我们这里来，因为他会觉得来到这里，本身我生活就不富足还买很多的礼品，就会给他的心理造成压力，如果我们懂得这样去做的时候，对方带东西来的时候，而我们回馈、给回去的，让他拿走的更多，是不是就避免了他的心理压力？</span></p><p><span>所以以前治理国家如此，现在我们生活在这个时代依然如此，我们要懂得去爱护那些晚辈，懂得爱护那些来我们这里送礼的这些人，来我们这里走动的这些人。如果我们是爱护对方的，是心怀对方的，我们也可以厚往。</span></p><p><span>所以怀诸侯也，这样的话我们就是在心怀诸侯，自然这些诸侯就愿意来觐见天子。我们这个时代也是一样的，这些人就会愿意来我们这里走动。</span></p><p><span><strong>“凡为天下国家有九经，所以行之者，一也。”</strong>以上治理国家的九条法则和真理，所以行之者，一也。我们来总结这九条真理，九条法则，如果归于一，就是对人好，我们去对每一个人好，我们对每一个人是仁爱的、是仁慈的，就可以了。</span></p><p><span>这个一也，“一”到底指的是什么呢？我们再往前回顾就好理解了，“好学近乎知，力行近乎人，知耻近乎勇。知斯三者，则知所以修身；知所以修身，则知所以治人；知所以治人，则知所以治天下国家矣。”所以告诉我们如何修身、如何治理国家？我们得好学，我们得力行，我们得知耻，就有了“智、仁、勇”。那我们再往前讲，智、仁、勇，再往前告诉我们什么呢？“天下之达德也 ，所以行之者，一也”，说我们自己要懂得修自己的德，如果有了德就能治理天下国家。</span></p><p><span>那要如何才能有德呢？我们要懂得“智、仁、勇”，懂得智、仁、勇，就可以修身，懂得修身，就可以治理天下国家。如何懂得治理天下国家呢？有九经，这九条法则。现在又告诉我们，这九条法则，行之者又归于一，这个一就是德。如果我们有了德，其实这九条是一样的。</span></p><p><span>我们再去延伸，如果我们的行为是有德行的，那治理国家也好，我们经营我们的企业也好，我们做事情也好，我们的修身之道也好，何止是九条呢？这里只是列举了九条例子，我们可以有九十条，又可以九百条，因为我们是有德行的，这是外在的表现。</span></p><p><span>内在又是有仁的，有仁爱之心，体现在外是有德行的，我们可以有很多条真理和法则，都是对他人好，才能彰显我们自己的德行。我们自然就可以懂得如何去经营好我们的事业，如何去经营我们的好家庭，如何去修正自己的身心。所以一也，德也。</span></p><p><span>这里的一也，有的朋友解释为诚，在这之后是讲诚的，在这个之前是讲德的，为什么这样说？诚是什么？是我们做事情的过程当中，所表现出来的叫诚，对吧？说我们做事情有没有诚意，是不是有诚心，这叫诚。</span></p><p><span>可是我们要治理天下国家也好，要懂得去修正自己也好，如何去亲民也好，这个时候需要什么来承载呢？需要的是德，如果我们自己是没有德行的，诚意从哪里来？</span></p><p><span>我们做事情的过程，我们怎么懂得去怀诸侯、怎么懂得去柔远人、怎么懂得去劝百工、怎么懂得去亲亲和尊贤？只有我们自己内在是有仁爱之心的，外在是有德行的，这个时候我们这些行为才可能是利他的，才可能是对别人好的。</span></p><p><span>所以他也只是列举了九条例子，但是后面结尾结得好。所以行之者，一也，在告诉我们什么呢？如果我们是有德行的，何止是九条呢？</span></p><p><span>让我们现在来做企业，或者说我们来带好我们自己的团队，可以有九十条。但是无论有多少条，真理不变，这个真理就是德。</span></p><p><span>我们去想一想，如果我们是缺少德行的，如果没有这个东西，那九条真理我们要如何践行呢？践行不了。说到整个这一段，我们要懂得修自己的德，内在修仁，外在修德，合起来叫仁德。</span></p><p><span>我们要懂得修仁德的时候，会发现自然就知道该如何治理企业。我们去想一想，如果我们是有仁爱之心的，我们的外在是有德行的，不知道对员工好吗？不知道对客户好吗？如果我们自己是有仁德的，不知道遇事情该修正自己吗？不去苛责他人，我们不知道去柔远人吗？去优待每一个远方的客人，去爱护好每一个客户，我们都知道。</span></p><p><span>可是如果我们要是没有德的时候，我们就不知道。并且我们没有德的时候，我们知道了，也做不到，因为我们从内心不是仁爱他人的，我们怎么能做得到呢？</span></p><p><span>所以我们经常说谁有德行，为什么会说他有德行呢？一定是他帮助过很多的人。他帮助过他的员工去成长，他帮助他的员工去过更好的生活，他帮助他每一个客户去赚更多的钱，他帮助他每一个客户去成长，只有这样的人，我们才能称为他有德行。</span></p><p><span>所以回到这个“一也”，就是“德也”。所以说不能理解为诚，诚只是自己的心意，但是诚还没外显，没有表现出来不能称之为德。</span></p><p><span>所以整个这一段都告诉我们具体的方法，如何修身、如何尊贤、如何亲亲、如何柔远人、如何劝百工。所以他是体现在外面的，故而这里的“一”是德。</span></p><p><span>当我们有德，他是可以无限延伸的，他是可以应用到我们的生活和企业当中去的。所以我认为这一段讲的是德，而不是诚，再往后面开始在讲诚。所以我们从下节课开始讲诚，而这里的“一也”，讲的是“德也”。</span></p></div>"
},{
    "title": "《中庸》第十八讲 道定不穷",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十八讲 道定不穷</strong></span></p><p><span><strong>凡事豫则立，不豫则废；言前定，则不跲jiá；事情定，则不困；行前定，则不疚；道前定，则不穷。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“凡事豫则立，不预则废。”</strong>这里的豫是提前准备、提前预备。废：是失败的意思。凡事提前有预备、有准备的，才能立得住。</span></p><p><span>“不豫则废”，如果没有提前准备，很容易失败的。这里的“豫”在告诉我们准备什么呢？准备什么——这个事情很值得我们去思考。很多朋友会讲：“做事之前我也准备了很多东西，我也准备了很多方案，也准备了很多计划，可最后可能还是失败的，并没有走得那么长久。”所以这里的“豫”很关键。</span></p><p><span>这里的“豫”是要知道什么呢？最关键的是要“知止”，是要有目标、有方向的。所以我们在讲《大学》，开篇就在讲止——知止而后有定。如果我们是不知止的，方向和目标如果是不明确的，做事情是很容易失败的。</span></p><p><span>举个例子，说我们即使是出行，首先我们要很明确地知道去哪里，这次去这个地方的目的和意义到底是什么。如果这个止是不明确的，会发现我们不知道该准备什么，不知道该带多少用品，不知道该带多少食物，不知道该有什么样的心理状态的准备，所以这里的“豫”，首先是知止。</span></p><p><span>第二点是我们有心理的准备，这个极其重要的。很多事情的成败取决于止，我们那个方向是不是正确的，取决于我们有没有做好心理准备，而不是预备那些细枝末节。会发现我们很多时候在做事情，细节可能考虑到了，但是我们的心里并没有做好强大的准备，没有定力。</span></p><p><span>为何没有定力？是不知道“止”。我们不知道前方我们要面对什么，我们不知我们做事情的意义到底是什么，我们那个止是不明确的，会发现很容易就失败的。</span></p><p><span>所以这里的准备和预备，我们不要理解成片面的，是不是准备好细节、准备好东西、准备好流程就够了，完全不是的。最重要的准备是心里的准备，是目标的方向一定是明确的，那个意义一定是明确的，我们才有定力。否则，我们是没有坚定的信念去做成一件事情的。</span></p><p><span><strong>“言前定，则不跲jiá ”，</strong>说我们说话，知道该说什么，讲话之前是有宗旨的，我们是知止的。这个时候“则不跲”，不跲是流畅的意思。中断，如果我们言不能前定，说话很容易就中断，不会流畅的。</span></p><p><span>包括我们和同事之间沟通，包括我们跟孩子沟通，包括夫妻之间沟通，包括跟客户的沟通，都是一样的道理，要懂得言前定。说话之前要知道自己要讲什么，讲这番话的意义是什么，讲这番话的止是什么，如果这个止不明确，会发现讲话就是不流畅的，不知道去说什么，说话没有重点。</span></p><p><span>很多夫妻之间为什么吵架？不知道言前定，不知道我们这次聊的目的是什么，意义是什么，可能是为了解决孩子的学习问题。可是会发现，我们这个止不明确，聊着聊着却因为对方说的一句话不高兴了，两个人吵起来了，结果把孩子学习的事情忘掉了。</span></p><p><span>我们做销售和客户谈判不是一个道理吗？如果不知道自己的止是什么，为什么而去谈，会发现讲话就是不顺畅的，聊着聊着很容易就没有重点了。</span></p><p><span>包括我们在直播的过程当中不是一样的吗？我们要很清楚地知道止是什么，我为什么要讲这些话，如果我们有很明确的止，知道我就是在教人修行的，我是告诉人们如何去学习圣贤文化的，我告诉人们如何去行善积德的。这个止如果很明确，会发现我无论讲什么，都会归到这个止上，这样就不偏，就是流畅的，就是顺畅的。</span></p><p><span>否则会发现聊着聊着，自己都不知道在聊什么，就是不懂得“言前定”的道理。所以我们做事情之前要知道止，我们讲话之前也要知道止。</span></p><p><span>说我今天出去和一个朋友聊天，我也要知道我今天主要想聊什么，想解决什么事情，想带给对方什么，我们这个止如果是很清晰的，讲话就是顺畅的，心里就是淡定从容的，否则没有定力。</span></p><p><span><strong>“事前定，则不困。”</strong>说我们做事情之前，如果是有定力的，则不困。定力从哪来？知止而后有定，我们做每件事情之前都是知止的，这个时候我们才有定力，做事情才不困，不受困、不迷茫。</span></p><p><span>大家想一想，我们做任何事情是不是都是这样的？我们要是不知止，我们要是没有坚定的信念和定力，很容易就受困，很容易就迷茫。这个迷茫既来自于外界，外界发生一个什么事情，比如说别人的非议、别人的不理解，我们就开始迷茫了。</span></p><p><span>还有一个迷茫是来自于内在的，当我们碰到了困难、碰到了阻碍，我们就开始迷茫，不知道方向，不知道该如何进行下去，不知道该如何走下去，就会受困。</span></p><p><span>所以如果我们每件事情不能知止，不能产生定力，既会被外界的环境所干扰，又会被自己的心里的迷茫所困惑。所以告诉我们：“事前定，则不困”。这样才少受困惑。</span></p><p><span>举个例子，为了方便大家理解，什么叫事前定，则不困？比如说让座，说我们坐公交车，我们准备让座这件事情。什么叫事前定，则不困？说我让座，只是我看着身边站了一个年龄比较大的人，或者说我看他很累，或者他抱着孩子，我给他让座了，但是我让座之前，我就明白这件事情，我让座只是为了我自己的心里更坦然，不需要对方感谢和赞美的，让完座以后自己是潇洒的。</span></p><p><span>但是如果我们是图回报的呢？会发现我们让完座了，如果对方并没有表示感谢，这个时候我们就觉得受困了，我们就会觉得难受，觉得痛苦：“我为什么要给他让座，我要不给他让就好了。”这个是不是来源于既有外界的因素环境，又有我们自己内在的迷茫和困惑。</span></p><p><span>所以我们做任何事情都是一样的，当我们选择了一件事情，我们要很明确的知道自己的止是什么，我为什么做这件事情，这个时候我们就不容易受到外界的干扰。</span></p><p><span>否则我们很容易受到外界的干扰，我们认为我们在帮助别人，我们认为我们在做善事，可是并没有得到别人的认可、鼓励、支持，这个时候我们就开始困惑。就是因为做事情之前我们的止不明确，我们的定力不强，所以很容易受到困惑的。尤其是这个时代，我们一定要懂得一个道理，越是做帮助他人的事情，我们自己越容易受到困惑。</span></p><p><span>所以知止是非常重要的事情，我很清楚我自己要做什么，我自己要的是什么，这个时候我们才有很坚定的信心，才不被困惑，说话才会更顺畅，才不容易失败。我们再倒着往前推也是一样的。</span></p><p><span><strong>“事前定，则不困；言前定，则不跲；凡事豫则立，不豫则废。”</strong>所以整个这段都在告诉我们一个共同的道理，我们的止要很明确，我们要很清楚地知道自己在做什么，这个时候我们才能淡定从容，不被外界的环境影响，不被自己的内心所困惑。</span></p><p><span><strong>“行前定，则不疚。”</strong>我们做事情，我们的行为产生之前，我们是有定力的，我们是有准备的，则不后悔，不会愧疚。整个这一段最后这两句是点睛之笔，接下来告诉我们了。</span></p><p><span><strong>“道前定，则不穷。”</strong>这里的道告诉我们，做事情要是合道的，这个叫道前定，“则不穷”。我们这个事情才不会穷尽，才会无限长久地做下去。</span></p><p><span>所以这句话回头再来告诉我们：<strong>“凡事预则立，不豫则废。”</strong>到底在立什么呢？到底在豫什么呢？在准备什么？</span></p><p><span>《中庸》前面讲了那么多，要告诉我们道的规律，要告诉我们“道不远人”，告诉我们<strong>“造端乎夫妇，察乎于天地”</strong>。这个时候又告诉我们“道前定”，我们做的事情要是合道的，这个时候我们会发现，就会无穷尽地做下去，否则这个事情必不长久。</span></p><p><span>我们再回来讲止，说我们做一件事情都要知止，这个止到底要止于什么？如果我们做生意，如果我们做事情，如果我们做教育，甚至说我们做医生，我们做律师，都是一样的，任何一个行业都是同理。如果我们这个止是不合道的，是不去帮助他人的，这件事情不会长久的。不光不会长久，自己很容易受困。</span></p><p><span>举个例子，如果我们是做老师的人，我们的止不是帮助别人的，不是教育他人的，不是培养他人之心，做事情的时候，是不是很容易受困呢？比如说工资太低了，做老师太辛苦了、太累了，又赚不多少钱，还总受到他人的非议和不理解，孩子们还不听话。</span></p><p><span>比如说如果我们是做医生的，也一样。如果我们的止不是帮助他人的，不是救死扶伤的，很容易我们自己的内心就会受困。现在的患者脾气都不好，明明是在帮助他，可很多人还是在骂我们，这个时候我们会发现就容易受困了。</span></p><p><span>但是如果我们的止很明确，就不容易失败。我们救他人，是我们自己的本职工作，帮助了他人，我是快乐的，即使有病患的不理解，我们心里在思考什么？毕竟是得病的人，他的脾气、情绪不稳定也是正常的，这个时候会发现，我们自己内心才能坦然。</span></p><p><span>我们做生意不是一样的吗？如果我们想的不是如何服务好他人，让每个客户更满意，去帮助更多的人，在做事情当中我们就很容易抱怨和受困：“现在的顾客太难服务了，消费没有多少钱，事情还特别多，非常的挑剔。”这个时候我们内心又开始受困。</span></p><p><span>但是如果我们的止就是为了帮助他人，我的产品给他人提供了价值，提供了服务，才是我存在的意义。这个时候会发现，我们才有无限的动力做下去，并且他也是合道的，唯有合道才能长久。</span></p><p><span>所以这段话是总结整个《中庸》我们前面所讲过来的，治理国家有九经，九条真理、法则，一样的，都会告诉我们“道前定，则不穷”。</span></p><p><span>那如何道前定呢？就是我们首先要非常地清楚，道的运作规律，道到底在讲什么？让我们自己的所思、所行去合于道，这个事情才能无穷尽地做下去。</span></p><p><span>《太上感应篇》告诉我们<strong>“施恩不图报”</strong>才叫善。我们以前不认为，“我施恩图报是正常的，我们帮了他，凭什么不图回报？”可是我们要知道，如果我们施恩了是图报的，实则不符合天地之道，他不是道的最终的那个诚。我们看天地，来滋养万物，来普照万物，他要回报了没有？没有吧。</span></p><p><span>而且不光是不合道，我们自己内心会痛苦。刚才讲“事前定，则不困”。如果我们不明白这个道理，不知道这个止，你看是不是很容易就受困？说：“我帮助他了，他怎么背后还说我坏话？”“我明明为了他们做了很多事情，怎么背后他们还误解我，还说我们的不好呢？”</span></p><p><span>这个时候自己是不是很容易受困？当自己很容易受困的时候，很多时候我们就走不下去，因为我们看的都是他人的认可、鼓励和赞美。如果没有这些东西，我们就不再坚定。</span></p><p><span>所以为什么“道前定，则不穷”？我们越是懂得道的规律是什么，越是学习了很多圣贤文化，我们自己的止很明确、很清晰，我们明白道在讲什么，我们才有坚定的信念。这个时候我们才能有无穷的动力，我们才能把这件事情做得很长久。</span></p><p><span>所以我们去看古之圣贤也好，如今的优秀的企业家也好，看看哪个人不是经历了那么多的非议和别人的不理解，甚至是打压，但是为什么能站起来呢？懂得道的规律，才能站得住，否则站不住的，做事情也必不长久。</span></p><p><span>所以整个《中庸》非常的关键，为什么说大家要学习《大学》，学习《了凡四训》、甚至学习《论语》，学习这些之后，我们再来学习《中庸》。因为他告诉我们“道”的规律是什么，我们如何在这个规律当中去做事情，这个时候我们才能坚定自己的信念，否则做事情很难长久，而且也不合乎道，做事情的时候很容易就受到阻碍。</span></p><p><span>我们再反过来刚才所讲的：<strong>“凡事豫则立，不豫则废。”</strong>这里的“豫”是什么呢？就是那个止、方向和目标。但是我们止、方向和目标，在设立那个止之前，我们必须要懂得道在讲什么，否则我们那个止站不住。</span></p></div>"
},{
    "title": "《中庸》第十九讲 诚身有道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第十九讲 诚身有道</strong></span></p><p><span><strong>在下位，不获乎上，民不可得而治矣；获乎上有道，不信乎朋友，不获乎上矣；信乎朋友有道，不顺乎亲，不信乎朋友矣；顺乎亲有道，反诸身不诚，不顺乎亲矣；诚身有道，不明乎善，不诚乎身矣。</strong></span></p><p><span><strong> </strong></span></p><p><span>上一段告诉我们：<strong>“道前定，则不穷。”</strong>再上一段告诉我们：<strong>“凡为天下国家有九经”，</strong>说我们去治理一个国家，甚至我们去做好一个团队，去做好一个企业都是一样的，都有这些不变的真理，都要告诉我们去合道，才能无穷尽地做下去。如何才能让自己合道呢？所以接下来又来告诉我们。</span></p><p><span><strong>“在下位，不获乎上，民不可得而治矣。”</strong>我们现在也是一样的，现在不用我们去治理百姓了，我们要想去做更多的事情，要怎么办呢？在下位，不获乎上，民不可得而治矣。我们处在下位的人，如果不能获得上位的人的信任和赏识，“民不可得而治矣”，我们没有治理百姓的机会。</span></p><p><span>延伸到现在，就是我们没有做更多事的机会。我们在一个企业当中，处于下位，如果不能获乎上位的认可和赏识，我们如何去做更多的事情？做不了。</span></p><p><span>我们现在流行一个词，叫“顾客是上帝”，我们这个时候就处于下位了，如果我们不能获得顾客的信任、赏识和认可，我们要如何去为他服务，去做更多的事情？做不了的。</span></p><p><span>所以，首先我们要懂得一个道理，我们处在下位的时候，一定要获得处在上位的认可和赏识，我们才有机会去施展我们的抱负和才华，才有机会去做合道的事情，否则我们连机会都没有。</span></p><p><span>从这里我们再开始延伸一下，比如说我们想跟别人分享传统文化，如果我们不能获得别人的认可，不能获得别人的赏识，我们要如何去做更多的事情？想做都没有机会。</span></p><p><span>我们在一个企业当中工作不是一样的吗？如果不能获得上位的认可、领导的认可，他不把我们放在一个更重要的位置上，即使我们想做更多的事情，要如何去做呢？</span></p><p><span>我们做企业，我们去开饭店，我们去开酒店，做任何事情不是一样的道理吗?我们去卖一个产品，如果不能获得处在上位的人的认可，我们如何去为他服务、去为他做更多的事情？没有机会。</span></p><p><span>所以告诉我们，首先要获得上位的认可。那要获得上位的认可，要怎么办呢？</span></p><p><span><strong>“获乎上有道，不信乎朋友，不获乎上矣。”</strong>说获乎上位的认可和信任，有道就是有方法，什么方法呢？如果不信乎朋友，不获乎上矣，如果我们不能获得朋友的信任，我们是不能获得上位的信任和赏识的。</span></p><p><span>我们再把这个朋友延伸一下，就是我们周围的人，如果我们不能让周围的人信任我们，我们又如何获得上位的认可呢？</span></p><p><span>举个例子，还是回到企业当中来讲，如果我们在一个企业、在一个团队当中，不能获乎周围的人，同事的人、客户这些周围的人来认可我们、信任我们，我们怎么能获得上位的认可？</span></p><p><span>所以它是一个次第，如何获乎上位？先让周围的人认可我们、信任我们。那如何让周围的人、如何让朋友信任我们？</span></p><p><span>“信乎朋友有道”，想让朋友、周围的人信任我们是有方法的。</span></p><p><span>“不顺乎亲，不信乎朋友矣。”如果我们不懂得孝顺和顺从身边的亲人，是不会得到朋友和周围的人的信任的。所以我们现在会流行一句话，说一个人如果他是不孝顺的，他怎么可能对朋友好呢？他对他的父母都不好，和他的父母、和他的兄弟姐妹都是斤斤计较的，他怎么会不和我们斤斤计较呢？</span></p><p><span>所以在生活当中，我们交朋友要格外注意的。如果有一个人，每天在不停地抱怨他的父母，抱怨他的亲人，这个时候我们一定要懂得一个道理，这样的人是处于负能量的，他是会抱怨很多事情的，他跟别人一定也在抱怨我们自己。如果我们是这样的行为，是不会获得周围人的认可和信任的。</span></p><p><span>所以我们再来反思这个件事情也是一样的，如果我们自己每个人还在说着身边人的不好，说我的父母不好；我的老公什么都不是，一点也不优秀；我的老婆一点都不上进；我的孩子一点都没有出息。</span></p><p><span>如果我们自己不停地这样去抱怨身边的人，您知道会有什么样的后果吗？当我们在这样不停地抱怨的时候，所接触到我们的每一个人，都会认为我们身边的人不好，我们让他如何立足？</span></p><p><span>尤其是在一个家庭当中，比如说有的女人在抱怨她老公这不好那不好，尤其是你在跟你的娘家人在不停地抱怨，你就可知你的老公在娘家人身边会是什么样的印象，会是什么样的地位，你让他如何自立呢？</span></p><p><span>反之我们作为一个男人也是一样的，你还想让你的老婆变得更懂事，还想让她变得更顺从，还想让她变得更优秀，如果你在你的家里人面前天天抱怨的都是她的不好，你家里的人这个时候就对她产生了这样的印象。无论她做什么事情，他们都会觉得你老婆不好，你这个时候让她如何立足呢？</span></p><p><span>所以我们一定要从正反两个方面来思考这件事情。从正的方面，我们自己一定不要去抱怨身边的人，我们自己一定要懂得去顺从自己的亲人，一定要懂得感恩，这个时候我们才能获得周围的人、获得朋友的信任。</span></p><p><span>我们换位思考就懂得这个道理了，如果我们身边的朋友，如果我们的同事，天天在抱怨他身边亲人的不好，我们觉得这个人可信吗？觉得这个人可用吗？如果要觉得不可以，我们一定不要做这样的人。</span></p><p><span>再反之也是一样的，我们如果想让身边的亲人变得更好，我们就不要当那么多人去抱怨他，去指责他的不是，反而要帮助他树立威信，帮助他树立在别人心目中的信任感，他才有可能变得更好。</span></p><p><span><strong>“顺乎亲有道”，</strong>顺乎亲是有方法的。</span></p><p><span><strong>“反诸身不诚，不顺乎亲矣。”</strong>如果我们做事情，如果我们孝顺身边的亲人，和身边的亲人处理好关系，我们一定要懂得反观自省。反观什么呢？我们自己的身是不是诚的？我们自己的行为是不是诚的？我们是不是心诚的？我们做事情是不是真诚的？如果不是真诚的，对方是不是一定能感受得到？</span></p><p><span>比如说我们孝顺父母，如果我们给父母拿钱的时候，如果是不真心的，是不真诚的，不仅自己的父母会知道，身边的人都会看得出来。</span></p><p><span>所以我们再去延伸，无论是顺从亲人或者取信于朋友，或者获乎上位，是不是都要用到这个诚字？如果我们服务客户的时候，不是真诚的，对方可不可以感受得到？是不是清清楚楚？</span></p><p><span>如果我们去跟领导做事情，对公司是不诚的，对领导是没有诚意的，对方是不是清清楚楚的感受得到？包括和周围的人相处，我们如果心是不诚的，对方清清楚楚的感受得到。</span></p><p><span>当我们不能获得别人的信任、认可的时候，要反观自己的心是不是诚的，自己的行为是不是诚的。如何才能让自己去更诚呢？接下来讲。</span></p><p><span>“诚身有道”，让自己的行为变得更真诚，有方法的。</span></p><p><span><strong>“不明乎善，不诚乎身矣。”</strong>如果我们不知善恶、不明善恶，是无法诚乎身的。如何去做到诚呢？给了我们方法，首先要知善，我们知善才能合于诚。</span></p><p><span>所以咱们整个平台上为什么先讲《太上感应篇》，先讲《了凡四训》？就是告诉我们，首先要知道什么是善，首先要知道什么事情是该做的，什么事情是不该做的，我们才有可能有诚意。否则，我们的诚意又从哪来呢？</span></p><p><span>我们再来总结这一段，如果我们是不知道什么是善，这个时候我们做事情就会心不甘、情不愿，就不诚了。举个例子，在公交车让座的事情，那什么叫善呢？我让座是不图回报的。《太上感应篇》里有讲：<strong>“施恩不图报，予人不追悔。”</strong>我们施给别人恩德是不图回报的，这叫善。</span></p><p><span>如果我们不懂得这个道理，就会心不甘、情不愿。比如说我们再说孝顺父母，我们孝顺父母要心诚、身诚，因为父母给了我们生命。如果我们不懂得这个道理，我们在给父母生活费的时候，就心不甘、情不愿；我们在照顾父母的时候，就心不甘、情不愿。</span></p><p><span>我们在一个企业当中做事情也是一样的，我们既然拿了人家的工资，我们既然拿了人家的报酬，我们就要努力、真诚地去做事情，这个才叫善。如果我们不懂得这个道理，是不是会每天不停地抱怨自己的付出，不停地抱怨领导的不理解，所以就会心不甘、情不愿。</span></p><p><span>如果想让自己变得诚，首先要知善，只有知善，我们做事情才是心甘情愿的，我们做事情心甘情愿才谓之诚。这个时候我们才是合于道的，我们才有无穷尽的动力，我们做事情才能不停地、长久地做下去。</span></p><p><span>比如说我们做生意不是一样的吗？我们凭什么去抱怨顾客，抱怨我们的客户，人家给我们钱了，我们收人家的费用了，我们去给人家做好服务，让顾客更满意，这个才符合道。</span></p><p><span>好比是我们换位思考，我们从一个地方消费了，如果人家对我们是没有诚意的，我们自己会有什么样的心理感受？本身这件事情就是不合乎道的，就是自己的不诚所致。</span></p><p><span>要懂得先知善，我们明的善恶越多，才能越诚自己的意；越诚自己的意，我们的行为才能越端正；行为越端正，才能让自己越合乎于道。“道前定，则不穷”。</span></p></div>"
},{
    "title": "《中庸》第二十讲 诚者天道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十讲 诚者天道</strong></span></p><p><span><strong>诚者，天之道也；诚之者，人之道也。诚者，不勉而中，不思而得，从容中道，圣人也；诚之者，择善而固执之者也。</strong></span></p><p><span>接下来开始重点的讲诚，诚是我们做事情的关键和基础，我们想让人际关系变得更好，离不开诚；我们想让事业变得更好，离不开诚；我想让自己变得更有修为，离不开诚；我想让自己变得更有学识，离不开诚。</span></p><p><span><strong>“诚者，天之道也。”</strong>“诚”这是天道，天道是有诚意的。什么叫诚？没有一丝杂念，没有一丝妄念，没有分别心，这个叫诚。所以天地日月他是诚的，日月遍照古今，不分善恶，故日月长明，他是没有一丝杂念，没有一丝分别心的，无论善恶，无论古今之人，都是一样的。</span></p><p><span>《道德经》讲：<strong>“天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。”</strong>说天地和圣人都是一样的，没有偏私的，对待万物和百姓都是一样的，这个叫诚。</span></p><p><span>告诉我们诚者是天之道，这里的诚有两层含义：第一层含义，诚的本身他是一种境界；第二层含义，诚是修行的过程，过程也叫诚。诚就是我们不断地修行，不断地让自己没有杂念、没有分别心，合于至诚的境界的过程也叫做诚。</span></p><p><span>所以《中庸》还有一个词，叫<strong>“至诚如神”</strong>。当我们趋向于至诚的境界，是如神一般的存在的。神是什么呢？首先他是一个抽象的概念，告诉我们有神力。第二层告诉我们什么呢？神是在体察着世间万物的变化，是在监管着世间万物的运行。</span></p><p><span>我们再往生活化讲，什么叫神？按照规律做事情的人，就是符合神的。再往生活化了讲，什么意思呢？当我们做事情没有杂念的时候，没有一丝妄念的时候，我们就会这样形容？这个人做事情真神了。因为我们看他做事情是顺畅的，是无可阻挡的，是不可思议的，他做什么事情好像都那么顺畅，做什么事情仿佛都有天助。</span></p><p><span>比如说有的人说开车开的特别好，我们可能也会这个字，那个人开车真的是神了；有的人企业做得很好，我们也会说，那个人做企业简直就是一个神话；可能一个人的医术很高明，我们也会说，那个人简直是医神。</span></p><p><span>为什么呢？是因为这样的人做事情，没有一丝的杂念，没有一丝的杂染，他是没有分别心的，他是合于道的，他是合于规律的、合于法则的，我们会发现他做事情非常的顺畅。</span></p><p><span>甚至我们去问这样的人，你是如何做的这么好？他自己可能也说不清楚：“我只知道帮助他人就好了，我只知道我应该去做更多的事情，服务于更多的人，我应该去救死扶伤，我应该去救他人的慧命。”因为那是合于道的，所以诚者是天之道。</span></p><p><span>天道运作规律就在一个“诚”字上，这个诚既然是天之道，我们要如何去做呢？接下来告诉我们。</span></p><p><span><strong>“诚之者，人之道也。”</strong>诚是天道的境界，诚之者是我们趋向于诚的过程，叫诚之者，人之道也。所以诚就是我们修道的过程，是让我们逐渐的没有一丝的杂念，没有妄念，心都是光明的，都是利他的，没有分别的。这个时候我们就趋向于天之道，就是最终的诚的境界。</span></p><p><span><strong>“诚者，不勉而中，不思而得，从容中道，圣人也。”</strong>诚者，就告诉我们已经达到诚的状态了。刚才告诉我们：“诚之者，人之道”，诚之是去往诚的过程，诚者就是已经达到诚了。当达到了诚的人，“不勉而中”，不用勉强，做事情他自然就是中的，他自然就是诚的，无需勉强和刻意。</span></p><p><span><strong>“不思而得”，</strong>不需要去思考，他随意做什么事情都是合道的，都是得于道的。“从容中道”，他很从容、很淡定地做事情就是中道的，就是合于道的。</span></p><p><span>所以我们《中庸》开篇就讲了：<strong>“天命之谓性，率性之谓道”。</strong>这里是不是就是率性而为？当我们达到至诚的境界，就是率性而为的，率性而为就是这样的境界。不勉而中，不用勉强，他就是道；不用思虑，随便所做任何事情他就是道，很从容淡定的就是道，所以率性之谓道。</span></p><p><span>我们还不能达到诚的时候，不能做到率性之谓道的时候，我们就要做下一句了“修道之谓教”，反过来就是这里的“诚之者，人之道也”。</span></p><p><span>所以我们要不停地修正自己的身心，让自己去合道，当我们达到诚的状态，就可以率性而为了，“圣人也”，能做到这样的就是圣人了。</span></p><p><span>所以说我们人人都是圣人，人人自性都是圆满的，人人都有天性，只不过是我们被这些杂染所覆盖了，看不到。所以“修道之谓教”，我们不停地去学习，不停地去效法圣人，就是让我们找到自己的天性，找到我们自己的诚，所以至诚是合天的，至诚是如神的。我们还没有修到圣人这种境界之前，要怎么办呢？</span></p><p><span>“诚之者”，比如说我们做一个躬行君子，我们做一个修行之人，去往圣贤的路上，所以叫诚之者。城之者，我们怎么做呢？</span></p><p><span><strong>“择善而固执之者也”，</strong>这里的固执是坚守的意思，说我们要选择善道并且坚守，这就是诚之者的过程。我们现在做不到圣人的标准，我们做不到至诚，我们不能率性而为的时候，我们就要“修道之谓教”了。</span></p><p><span>我们不停地去修正自己的身心，我们去选择善道，并且坚守不渝地去修我们自己，这就是修行之道。也就是诚之者的过程，目标是至诚的境界，就符合了圣人，符合了天地之道。</span></p><p><span>之前我们《中庸》也讲过，说：<strong>“颜回之为人，依乎中庸，择一善，而拳拳服膺”。</strong>那我们自己修行的过程，也是如此，选择一个善道，自己把他牢牢地放在心上，紧紧地握住，坚守不渝地去修正自己。终有一天我们会合乎于圣人之道，合乎于诚，合乎于道。</span></p><p><span>这个“诚”字是修行的关键点，前段也讲，那如何让自己诚？要知善。知善我们的行为才有准则，所以这一段，我们把诚和善放在一起讲，要想让自己至诚，必须要择善道，我们不停地去学习圣贤的文化，就是在择善道。</span></p><p><span>择了善道还不够，还要坚守善道，去不停地修正我们自己的身心，去合于善，去合于诚。这个时候我们才能处理好人际关系，才能经营好自己的企业，才能让自己“道前定，则不穷”。</span></p><p><span>这个时候我们再用这段话来理解，很多朋友都问：“什么叫修行？修行到底是指的什么？”修行之道，择善而坚守，这个就是修行。</span></p><p><span>《大学》讲：<strong>“格物、致知、诚意、正心、修身、齐家、治国、平天下。”</strong>他讲的诚意<strong>“诚其意者，毋自欺也”，</strong>还不是这里的诚，那个叫诚意，诚加上意，他就是表现出来的东西了。</span></p><p><span>我们做事要有诚意，是要求自己的。而这里的诚，诚之和诚意有类似，但是诚是指的一种状态和境界。那里讲的诚意和这里的诚之等同，和诚不同。就好比说我们讲一个词，德和德行，一样吗？德是一种境界和内在的，德行是要做出来的，行为所表现出来的，所以诚意更多的是自我要求。</span></p><p><span>我们讲德行也是一样的，是让自己的行为合于德，他是表现出来的行为和过程。而这里的诚是那个境界，去往诚的过程叫诚之。</span></p><p><span>比如说我们举个例子说北京，北京是在那里不动的，我们说北京之，什么意思？去往北京的路上，就是我们知道我们要去北京，但是我们去往的路上，是让我们自己奔着那个方向走。</span></p><p><span>就好比是《中庸》的开篇讲的：<strong>“天命之谓性”，</strong>那个性是不动的，你也不用修。所以你看整个《中庸》没有讲如何修性，然后他告诉我们：“率性之谓道”，我们要知道天性是什么，我们率着天性而为的就是道。</span></p><p><span>那什么是道呢？又告诉我们了，整个讲了这么多道的规律，说“造端乎夫妇，察乎于天地”都是道。那又告诉我们了“修道之谓教”，修正我们自己，让我们自己去合于道，这就是教，就是修道的过程。让我们自己懂得合于道了，我们不就知道那个天性是什么了吗。知道了天性是什么了，我们率性而为，怎么做都是道。</span></p><p><span>所以孔子才说：<strong>“随心所欲，不逾矩。”</strong>注意什么叫不逾矩？就是没有不合适的地方。如果我们只听前半句，随心所欲就偏了，再加上不逾矩，会发现就很难了，因为我们所有的事情都是合道的，都是没有不合适的地方的。</span></p><p><span>这个时候他随心所欲随的是什么心？就是天性的心，他随的是圣人之心，所以才有率性而为。但是我们现在的率性而为都是逾矩，都是率自己的贪婪的本性，不是天性，他就不是一个东西。</span></p><p><span>换个角度来理解诚，更好理解。比如说《道德经》讲，他讲了道的规律：<strong>“在天为道，在人为德。”</strong>为什么叫《道德经》？他从很多方面去讲道，又从很多方面去讲德，其实德也是道，我们合着德去做事情就是合道的。</span></p><p><span>那我们再来告诉我们这里的事情，“天命之谓性”，这里的诚是什么？换个角度给我们讲什么是性，其实就是在举例子。因为那个性是讲不出来的，就好比是《道德经》的道，没法用语言描述，只能通过举例子的方式告诉我们什么是道。</span></p><p><span>所以这里也是一样的，告诉我们“诚者天之道也”，诚也就是那个性，我们停下来在修什么？不就修一个“诚”字吗？诚不是给任何人看的，是诚于自己的善，诚于自己的天性。</span></p><p><span>比如说举个例子，诚是一百分，我们现在绝大多数人，可能说我就能诚十分，我能诚二十分，我们能诚三十分，我们不停地修“诚”字，就是让自己诚的分数越高，就越合乎我们自己的天性，越合乎天性，他本然就是道。</span></p><p><span>所以《中庸》告诉我们，“诚者”就是我们达到诚的人，是从容中道的。圣人也，说圣人是什么？诚者。他做事情是从容的，就是合道的。就像开篇讲的率性之谓道，他随便怎么做都是合道的，因为他至诚，所以我们都在通往诚的路上。</span></p><p><span>他讲到这里诚者和诚之者，其实我们要把这个概念听明白了，我们就知道我们修行的方向是什么。我们这样再不停地去修正自己的时候，我们会发现，这不就是中与和的力量，他把中和和的力量又细化了。</span></p><p><span>所以诚和善，其实真的讲得特别好。但是我们的善恶关键从哪来？我们不停地学习，才知道什么是合乎善的。我们所了解的善越多，我们去奔着善去做事情，是不是自己就越来越诚？当达到诚者的状态，就是找到了自己的天性，我们就可以率性而为，率性而为本身就是道。因为我们是至诚的，就是道本身。</span></p><p><span>所以《中庸》告诉我们，诚者不是从容中道吗？<strong>“不勉而中，不思而得”，</strong>我们就随便做，怎么做都是中道的。因为他是至诚的，他没有杂念的，他没有污染的，他没有分别的。</span></p><p><span>就好比我们修行到一定的程度，我们的内心若是光明的，我们的内心都是善念，我们随便讲，讲什么都是对的，错不了。我们可能没有讲得那么好，可能没有那么好的文采，可能不会引经据典，但是我们的理一定错不了。</span></p><p><span>好比是一个非常善良的人，他可以不懂那么一些大道理，但是他讲出来的话一定不偏。但是如果我们不是善良的，我们不合道，虽然口才很好，虽然言语很犀利，我们讲的话未必有德行。</span></p><p><span>所以讲《论语》的时候说过：<strong>“有德者必有言，有言者不必有德。”</strong>说有德行的人，讲出来的话一定是对的，一定是合道的；但是讲话对的人，未必有德行。</span></p><p><span>《中庸》讲：<strong>“义者宜也，尊贤为大。”</strong>什么叫义？适宜的，适度的。什么叫尊贤为大？我们只有尊重贤德的人，我们只有学习圣贤文化，我们才能适度，才能合道。</span></p><p><span>所以“义”通常都和什么组词？道义、忠义、情义。那和道义放在一起什么意思？就是我们和道都是合适的、都是适度的；和忠义放在一起，只要是围绕着忠的，就是适宜的；我们和情义放在一起，只要做的事情，所讲的话，都是合乎于情的，都是和情适度的、适宜的，就叫情义。</span></p><p><span>比如说对我吧，他可以不懂大道理，但是他忠要是在，他无论如何都是适宜的。不适宜的话他说不出来，因为那是不忠：“这种话，我怎么能讲出来？”</span></p><p><span>所以我才反复地告诉你们，跟着修行一年、两年、三年以后，吗可以不必懂那么些大道理，但是我们是真真实实地跟着修过来的，所以我们讲的话一定是适宜的，他一定不跑偏，所以这就是修行的妙处。</span></p><p><span>如果我们是不懂得修行的，不是去修至诚的，不是去修至善的，我们学习了那么多文化，又如何呢？我们讲出来的理都是偏的，他是不合道的。</span></p><p><span>所以我们修行是先修自己的行为，再去学文化。不是先学文化，先学文化很容易偏。但是我们已经跟着修行了这么久，我们就开始并行，一边修正自己的行为，一边去学习文化，让自己内在又有文化修养，外在品质又是好的。</span></p><p><span>包括现在跟着咱们一起学习修行的这些朋友都一样的，我们现在到了这个阶段，大家是并行的，我又让我自己的本质和品性变得更好，这是修内在的，让他合道，同时又不断地提升自己的文化素养。这个时候会发现，我们又是合道的，讲出来的话又是动听的、又是圆融的，这个时候才是君子之风。这不就是“学而时习之，不亦说乎吗？”这就是学和习的关系。</span></p><p><span>所以这个诚，其实蛮难理解的，所以大家一定是反复地修行，修行到一定程度这个时候我们才能理解这个诚到底是什么。</span></p></div>"
},{
    "title": "《中庸》答疑解惑",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十一讲 答疑解惑</strong></span></p><p><span>所以我们为什么要去学习圣贤的文化？为什么让自己去行善？只有我们不断地去行善，不断地学习圣贤的文化，这个就是明的过程。</span></p><p><span>为什么叫明心见性？就是不断地让自己明达，不断地让自己通向光明，这就是明的过程，也是修的过程，最终的目的是达到诚。</span></p><p><span>我们为什么讲：<strong>“人之初，性本善。”</strong>为什么道家老子告诉我们：“要像婴儿学道呢？”人之初，性本善。最开始婴儿，其实他是最合道的状态，他是非常的光明的，他是没有一丝杂染的，他是很纯净的。</span></p><p><span>比如说我们小时候想一想，我们的梦想是不是都是利他的？我们都是想着如何为他人好的。可是长大了以后不一样了，为什么呢？我们开始有欲望了，开始有情绪了，开始有贪婪了，开始有抱怨了，开始有自己的喜好了，开始有自己的贪着了。</span></p><p><span>开始想拥有更多的东西——我拥有朋友对我的认可，我拥有别人对我的爱，我拥有每个人对我的照顾，我需要拥有更多好的东西，我需要拥有更多的钱财，我需要拥有好的车子，我需要拥有好的化妆品。就是我们想要拥有的越多，我们离道就越远。所以我们的本性，就是被这些东西所掩盖住了。</span></p><p><span>我们为什么修行叫<strong>“返璞归真，去欲还本？”</strong>不停地去除欲望，找到我们本来的至真、至纯的性。所以开篇告诉我们：“天命之谓性”，这个性是那个东西，也就是这里讲的诚。</span></p><p><span><strong>“自诚明，谓之性”，</strong>他本来就是诚明的，就是光明的，那个是性。可是我们那个性没有了，找不到了。怎么办呢？就得“自明诚，谓之教”，就是我们不断地去明，这个明就变成动词了，不断地去明、不断地去修、不断地去找回来，这个就是明的过程。</span></p><p><span>为什么说大家要先学懂《大学》，再学《中庸》呢？否则我们完全听不懂《中庸》到底在讲什么。他是告诉我们明心见性的，他是找到我们自己至真至纯的本性的。同时这又告诉我们很多运行的规律，包括很多德是如何运行的，道是如何运行的，所以《中庸》很深。</span></p><p><span>我们《大学》里讲的：<strong>“格物、致知、诚意、正心、修身、齐家、治国、平天下”</strong>，那里的格物、致知、诚意、正心、修身，都是明的过程，都是不断地向内明的过程。我们只有不断地向内明，我们明到一定程度，我们才能知道《中庸》到底在讲什么。否则我们会发现，这里一会儿讲诚，一会儿讲天性，一会儿讲道，大家听不懂。</span></p><p><span>为什么叫明心见性？我们心没有明达到那种程度，是见不了性的。除非是顿悟的根器，瞬间就顿悟了，但是这样的根器毕竟是少数。</span></p><p><span>所以我们也经常讲，当我们修正到一定的程度，就好像是夜明珠，我们已经没有那么多的杂染，才能真正明白<strong>“本来无一物，何处惹尘埃。”</strong>现在人们很多人都在讲这两句话，可是真正体悟到的人并不多。如果真正体悟到了，会发现这个人做事情一定是至善、至纯、至真的。</span></p><p><span><strong>“率性之谓道”，</strong>我们随便率自己的本性而为，怎么做都是合道的，可以不需要方法，不需要学会任何的方法，因为他本来就是圆满具足的，就是我们那个诚。</span></p><p><span>这里讲诚，其实跟我们开篇讲<strong>“天命之谓性”</strong>是一个意思，只不过换一个词再给我们讲，总用那个“性”，大家听不明白，怎么办呢？就开始换一个“诚”字，开始给我们讲，相当于又往下落了一层，一个道理。</span></p><p><span>现在人们经常说“安住当下”，我们要深一层的讲境界，什么叫安住当下？我们以为安住当下是安住在当下这个事情上吗？不是的。我们要安住这件事情上，到下一件事情上，我们的思绪还会回来。什么叫安住当下？无所住叫安住当下，不安在任何事情上，我们的心是无所住的，才能安住在每一件事情上。</span></p><p><span>所以我们这里讲“诚”到底是什么？诚是一种境界和状态。我们说没有杂染叫诚，专一叫诚，对吧？一心一意叫诚，是吗？这是文字相所表达出来的。真正的至诚是什么？是没有专一，没有诚，才是至诚。</span></p><p><span>我们《大学》讲的：<strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>什么叫至善呢？无善无恶才是至善，我们为什么要告诉我们要止恶扬善，因为我们还有恶。</span></p><p><span>当我们达到没有恶，完全是善的，还有善吗？没有善了，叫至善；没有诚了，叫至诚；没有性了，叫至性；没有当下，无所住的，叫安住当下。</span></p><p><span>所以这个境界就又深一层了，但是我们要讲出来，要用的时候，只能往下一层讲，叫安住当下，叫专一，没有一丝杂染叫诚。</span></p><p><span>“大学之道，在明明德，在亲民，在止于至善。”我们奔着善的目标去做事情、去修行，叫止于至善。我们只能这么讲，但是深入一层的，是善没有了，诚没有了，当下没有了，我们才是真正的无所住，我们才是真正的至诚和至善。</span></p><p><span>老子也在说，孔子也在说，都告诉我们一个道理，道是不可说的。<strong>“大道无名，强曰为道。”</strong>我不想说你非我让说：<strong>“道可道，非常道。名可名，非常名。”</strong>不能说的，但是你非让我说，我只能跟讲一个方便法。</span></p><p><span>其实真正的道是不用讲的，也讲不出来。能讲出来的，都是为了有助于人们去理解。但是注意，如果我们从这些圣人的文字相上，我们永远入不了道，只能摸到那个门。</span></p><p><span>但是剩余那一步是靠我们自己的，剩余那一步是没有法的。我们学习这些圣贤的文化，就是自明诚的过程。但是他给我们的路，给我们的方便法，只能走到门口。我们把那个东西再破掉的时候，才能进入自诚明的状态。就像我之前聊过太极，太极的状态就是这样的，到了太极的状态，是没有阴阳的。</span></p><p><span>但是我们要修行的过程，渐修怎么办呢？让自己达到至阳，就是说我们做的都是好的事情，都是善良的，都是阳光的，让自己达到至阳、纯阳。</span></p><p><span>但是纯阳还不是太极，但是他已经几乎接近于太极了，所以我们再把纯阳，再破掉就进入太极了。所以这是必经之路，我们只能让自己去修纯阳，要修纯阴那就成纯坏蛋了。所以我们去修纯阳，让自己达到顶端，再把阴阳破掉，就进入太极了。</span></p><p><span>这里的自明诚也是一样的，我们按照四书五经的文化，就是明诚的过程。然后我们不断地达到明达，达到通透，达到善的顶点，再把这个明诚，把善恶破掉，就进入自诚明的境界了，能体会吗？</span></p><p><span>所以我们能讲出来的所有的法都是方便法，都是辅助我们达到那个地方。但是真正那一步是靠自己破掉的，不是法所能给予我们的。</span></p><p><span>我们往生活延伸，它这个道理是有异曲同工之妙，但是不等同。我们开车是不是一个道理？做饭是不是一个道理？如果我们还在想着饭我该怎么做，到不了境界。但什么时候把做饭的方法忘了，过程忘了，进入在很享受很自在那个状态。《论语》里讲“游于艺”的的状态，会发现做出来的东西——美味。</span></p><p><span>讲课也是一样的，如果还在用方法讲课，还在用思维讲课，还在背草稿去讲课，那就是课。但是我们要不要有这个过程？要，当我们过了这个过程，把这些所有的方法全破掉，我都不知道我在讲什么，然后就进入那个境界和状态了。</span></p><p><span>所以这个过程是怎么达到的？是自明诚的过程，我们没有前期学的那些方法，找不到那状态。其实所有的的东西，一定是我们在行中去找的。</span></p><p><span>包括我们天天说“悟”，一定是在不停地“行”中，不停地去自明诚。在“诚之”的过程，当我们到达了一定的程度，把这个东西破掉，我们才能进入自诚明的境界。</span></p><p><span>所以修行修行，是真的修出来的，绝对不是说我们自己说学了点方法，我们学了点《中庸》，学了点《大学》，这个可以辅助我们走到门口。但是我们要没有这个过程，永远也达不到那个顶点，这个就是自明诚，就是诚之的过程。</span></p><p><span>所以之前《中庸》讲，诚者是从容中道的，本来就是诚者。有的人生而知之，他出生就是至诚的，所以他是从容中道。那我们诚之者，就得不停地去修行，“择善而坚守”，然后不停地修，这就是自明诚的过程。</span></p></div>"
},{
    "title": "《中庸》第二十一讲 虽愚必明",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十一讲 虽愚必明</strong></span></p><p><span><strong>博学之，审问之，慎思之，笃行之。有弗学，学之弗能弗措也；有弗问，问之弗知弗措也；有弗思，思之弗得弗措也；有弗辨，辨之弗明弗措也；有弗行，行之弗笃弗措也。人一能之，己百之；人十能之，己千之。果能此道矣，虽愚必明，虽柔必强。</strong></span></p><p><span><strong>自明诚，谓之性；自明诚，谓之教。诚则明矣，明则诚矣。</strong></span></p><p><span><strong> </strong></span></p><p><span>我们上一节讲到<strong>诚者，天之道；诚之者，人之道也。</strong>诚之，就是修行的过程，就是修道的过程，我们要如何去诚之，如何去学习呢？“博学之，审问之，慎思之，明辨之，笃行之”，这个也是诚之的过程，也是修道的过程，也是我们学习的过程。</span></p><p><span>第一步，先博学，要广泛地地去学习，广泛地学习以后，我们才能审问之，审问之就是追寻原理，探寻究竟。我们只有让自己变得更博学，更加广泛地去学习，我们才可能去追寻每个所学背后的原理。</span></p><p><span>慎思之，我们只有博学，不断去追寻原理，这个时候我们才能谨慎地去思考。明辨之，谨慎地思考之后，我们才能去明确地辨别。要辨别什么呢？在我们博学的过程中，不见得所有的知识都是善的，不见得所有的知识都是正确的，也不见得所有的知识，都是适合我们当下的，所以这个时候就需要明辨。</span></p><p><span>明确地去辨别哪一些是善，哪一些是恶，哪一些是真，哪一些是伪，哪一些是我当下该去学习的，是我当下该去修正的，都需要我们来辨别。明辨以后，开始笃行之，要开始坚定地去做了。</span></p><p><span>我们讲修行修行，最后都是要修正自己的行为，修正我们自己的行为之前非常重要，就是明辨。我们一定要明辨是非，明辨善恶，明辨曲直，哪一些是适合我们的，这个时候我们要坚定地去做，坚定地去行，才能让我们自己发生变化。有很多人就是停在了这一步，明辨了，也知道是非了，也知道真假了，也知道善恶了，可是自己不去坚定地去做，那个都算不得修行。</span></p><p><span>所以，这里讲的次第也是我们修道的过程，也是我们诚之的过程。我们再反过来讲也是一样的。很多朋友都会问什么叫修行？我该怎样去修行呢？要想修正自己的行为，我们要先懂得明辨是非善恶。要想明辨是非善恶，我们一定是谨慎地思考。要想谨慎地思考，我们一定在追寻每件事情的原理，追寻道到底在讲什么，善到底在讲什么，规律到底在讲什么。我们要想追寻每件事情的真理的前提，是我们必须要博学，要广泛地学习更多的知识。</span></p><p><span>所以它是一个次第，我们按照这个次第去修正自己，就是诚之的过程，这是人之道也，是我们人修道的方法。</span></p><p><span><strong>“有弗学，学之弗能弗措也。”</strong>有弗学，这里的弗是不的意思。我们即使再博学，也有我们学不到的地方，也有我们学不到的知识，可以有学不到的知识，但是我们学习要有态度。什么样的态度呢？学不到的知识，它是正常的。“学之弗能弗措也”，但是学到的知识，是不能要放弃的。只要我们愿意去学习的，不要中途而废，不要轻易放弃。</span></p><p><span><strong>“有弗问，问之弗知弗措也。”</strong>一定有我们问不到的地方。所以刚才的次第就告诉我们，“博学之，审问之”。我们博学以后，要不停地去探寻事物的真理。但是我们在学习探寻的过程当中，有的时候并未产生疑问，或者没有想到问题，没有关系，它是正常的。</span></p><p><span>但是我们要有坚定的态度，一旦问的，我们一定要把它问清楚，不要中途放弃的。这个也就是《大学》讲的格物，不停地去探寻事物的规律和背后的原理。说当我做一件事情的时候，我一旦产生疑问，我就要不停地深入地去探究，直到把这个事情学会。我学不懂，可以反反复复地多学几遍，多听几遍，我可以找老师去提出我的疑问，我可以找我身边的同修，找我的善知识去继续追问，让我明白这件事情的道理，而不能半途而废。</span></p><p><span><strong>“有弗思，思之弗得弗措也。”</strong>说有的地方我们可以思考不到，那个是正常的。但是同样我们也要有态度，只要是我们思考的，并没有得到答案的，我是不会中途放弃的。</span></p><p><span><strong>“有弗辨，辨之弗明弗措也。”</strong>说有的地方我可能不能去明辨，我也不知道该如何去明辨，但是只要是明辨不清楚的，我知道了这个事情我必须要去明辨这里面的是非，必须要明辨这里面的善恶和真假。只要我开始去辨别，就一定要把它辨别清楚，否则我是不会轻易放弃的。</span></p><p><span><strong>“有弗行，行之弗笃弗措也。”</strong>有的地方我可能做不到，包括我们现在学习，我们现在修行也是同样的道理。有一些事情我是做不到的，我们每个人都有做不到的地方，这个没有关系。但是我们也要该有自己学习和修行的态度，只要是能做到的，就不会中途放弃。做不到的我要知道那是我下一步该行的方向，可是我当时做不到怎么办呢？我当时就不去做，但是我已经能做到的事情，我就不要再反复，不会再放弃。</span></p><p><span>整个这一段都在告诉我们一个道理，就是我们学习也好、修行也好、做事情也好，都要有这样的态度。我不知则矣，只要是知道的，我就去坚定地去笃行，不停地去修正自己，而且中途是不放弃的。就像我们之前所讲，“依乎中庸之道，择一善，则拳拳服膺”，把它紧紧地抓在手里，放在心中，是绝不会中途而废的。</span></p><p><span>包括我们修行不是一样的吗？举个例子，有的人说：“我现在做不到吃素怎么办？”那就不需要吃素，是我们自己的慈悲心还没有增长上来，没有意识到吃素的好处。可是我们一旦意识到了，开始吃素的时候，就不要再半途而废了。</span></p><p><span>我们去做其他事情也是一样的。说这件事情我做不到，但是我知道那个方向。做不到，我当下也不纠结、不痛苦、不困惑。可是一旦我能做到的事情，就不要让自己半途而废，不要轻易地放弃，这个就是笃行的力量。否则我们就会不停地去退转，我们就会不停地去反复。</span></p><p><span>包括我们做学问，我们去讲文化，我们去聊修行，都是同样的道理。当自己已然能做到的事情，绝对不要再因为受到他人的影响，为了自己的口腹之欲，或者是说自己心情不好的时候，就开始不约束自己的行为、开始放纵，这样很容易就退回到原点的。</span></p><p><span>所以一定要去笃行，这是我们每个人在修行的过程、在做学问的过程、在做事情的过程。用《中庸》的话讲，在“诚之”的过程所必不可少的态度，这个就是笃行的态度，笃信的态度。</span></p><p><span><strong>“人一能之，己百之；人十能之，己千之。”</strong>所以接下来又告诉我们了，如果别人一分努力就可以做得到，我们要拿出百分的努力；如果别人十分的努力能做到，我们要拿出千倍的努力。</span></p><p><span><strong>“果能此道矣”，</strong>如果我们真的能这样去做，按照此方法去行之。“虽愚必明，虽柔必强”，虽然是愚钝的，也必然会达到高明。这里很多朋友说成是聪明，说虽愚必明，虽然很愚钝也会变聪明，实则不尽然。虽愚必明，这里的明是高明。</span></p><p><span>举个例子，如果本来我们是一个愚钝的人，我们通过学、通过习，会发现不见得我们会变得聪明，因为聪明它是本质的东西，但是却可以变得高明，变得有智慧，这个比聪明要上了一个层次和境界。</span></p><p><span>比如说我们很多人本来可能是愚钝的，可是我们通过不断地学习，不断地修正自己，不断地减少自己的欲望，不断地减少自己的情绪，会发现这个人变得是高明和通达的。高明是什么呢？在任何事情发生的时候，都可以看透事情的本质，这个不是聪明所能达到的效果。</span></p><p><span><strong>“虽柔必强”，</strong>虽然我们是柔弱的、是弱小的，但是我们如果能按照这样的方法去修正自己，自己一定会变得强大。无论是我们的内心还是我们外在的行为，还是我们处事的方法，还是我们的智慧，都会变得强大。</span></p><p><span>所以整个这段讲的次第非常的重要，我们一定要脚踏实地的，按照这样的次第去不断地修行自己，就是我们“诚之”的过程。“虽愚必明，虽柔必强”，这是我们要达到的果。只要我们按照这个次第，不断地去博学，不断地去深思，不断地去明辨，不断地去笃行。“人一”，我们自己要付出百倍的努力；“人十”，我们自己要付出千倍的努力，如果我们能按照这样的方法去种因，就会得到这样的果。</span></p><p><span>很多朋友在学习和修行的过程当中，总会认为自己没有文化，说自己比较笨，说自己入门比较晚，其实都没有关系的。所以这段话也在鼓励我们每一个人，“果能此道”，如果我们真的能按照这样的方法去做，虽然我们可能是愚笨的，但是必然也会变得明达；虽然我们现在还是柔弱的，我们也必将变得强大。明和强大，这里的明其实意义很深刻。</span></p><p><span>接下来又开始告诉我们，<strong>“自诚明，谓之性”。</strong>自诚明，本来我们每个人都是至诚的、都是诚明的，谓之性。这里也就是《中庸》开篇所讲的天命之谓性，我们自己每个人的本性都是至诚的，都是诚明的。</span></p><p><span><strong>“自明诚，谓之教”，</strong>这里的明是个动词，是显现本性的意思，我们让本来的本性至诚显现出来，谓之教。所以我们为什么要学习圣贤的文化，接受教化，就是这个道理。明是过程，是动词。我们只有让自己不停地去明达，不停地去修正自己的过程。至诚，我们本来的天性才会显露出来。谓之教，这就是我们在接受教化，也是我们在学习的过程，这里不太好理解。</span></p><p><span>我给大家举个例子，自诚明和自明诚的关系。比如说有个夜明珠，说夜明珠它本来就是通透的，就是无杂染的，就是至纯的，我们每个人的本性都是那个样子的，都是圆满的，都是圆融的，都是至纯、至真、至善的，都是透明的、没有一丝的杂染。</span></p><p><span>我们自己的本性就好比是夜明珠。可是后来呢？我们在人世间经历了各种杂染和污染，让这颗夜明珠就变得不再通透，上面有很多的灰尘，有很多的灰尘怎么办呢？这个就是自明诚的过程，我们这个明就是让他恢复本来的面貌，不停地去擦拭，不停地去拂拭，不让他被尘埃所染，恢复他本来的光明的样子。</span></p><p><span>我们生活在这个世间已经被惹上尘埃了，怎么办呢？就是“自明诚，谓之教”，这个就是修道的过程，修道之谓教。“诚之者，人之道也”，这个是诚之的过程。诚之的过程叫做明，所以这个明就是我们不停地让自己变得明达，明就是修行的过程。</span></p><p><span><strong>“诚则明矣，明则诚矣”，</strong>这里又告诉我们，其实结果都一样的。诚则明矣，本来我们是至诚的，他就是明达的，所以诚则明矣。明则诚矣，如果我们不能去顿悟，我们不能上来就是至诚的。之前我们也讲过，“诚者，不勉而中，不思而得，从容中道，圣人也”，圣人他一出世，经过简短地学习、修行，他开始觉悟了，这个时候他就是自诚明的，所以诚则明矣，他自然就是通达的。</span></p><p><span>但是，我们如果不是顿悟的根器，我们就要渐修的，就是诚之的过程，也就是明的过程，明则诚矣，一样的。我们可以通过自己不断地去明心，不断地去明达，也可以让自己达到至诚，回归本来的天性。所以他的结果是一样的，只不过方法不一样，一种叫顿悟，一种叫渐悟，但是所达到结果都是自诚明的。</span></p></div>"
},{
    "title": "《中庸》第二十二讲 至诚能化",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十二讲（至诚能化）</strong></span></p><p><span><strong>诚则明矣，明则诚矣。唯天下至诚，为能尽其性；能尽其性，则能尽人之性；能尽人之性，则能尽物之性；能尽物之性，则可以赞天地之化育；则可以赞天地之化育，则可以与天地参矣。</strong></span></p><p><span><strong>其次致曲。曲能有诚，诚则形，形则著，著则明，明则动，动则变，变则化；唯天下至诚为能化。</strong></span></p><p><span>上一段讲到<strong>“自诚明，谓之性；自明诚，谓之教。”</strong>告诉我们诚和明的关系。</span></p><p><span><strong>“诚则明矣，明则诚矣。”</strong>无论我们通过什么样的路去达到那个本性，去达到那个至诚，其结果是一样的。那么达到至诚以后，是一种什么样的状态和境界呢？接下来告诉我们。</span></p><p><span><strong>“唯天下至诚，为能尽其性。”</strong>天下的万事万物，只有达到至诚的状态，才能尽其本性。不光是人，唯天下至诚，天下万物都是一样的，只有达到至诚的状态，才能显现本性，尽其性。</span></p><p><span><strong>“能尽其性，则能尽人之性。”</strong>又往下落了一层，能尽其性的时候，才能找到自己的本性、自己的良知，这个时候则能尽人之性。所以我们说：“人之初，性本善。”是指的这里的人性，是我们率天性而为的，是我们尽了自己的本性和良知的那个人之性，这个人之性是本善的。</span></p><p><span>我们很多人会讲到，说：“人性是恶的，人性的贪婪的。”这些有没有错？也没有错，只不过这个是经过杂染的、经过蒙蔽的，才有这些恶，才有这些不好的行为。但是人之初的性是本善的，就是阳明先生所讲的：“人人都是有良知的。”致良知，致是过程，良知是我们每个人本有的。</span></p><p><span><strong>“能尽人之性，则能尽物之性。”</strong>我们只有尽人之性，这个时候才能尽物之性，什么意思呢？我们只有达到自己的率性而为的天性，达到至诚的状态，能尽物之性，才能看到万事万物发展的规律和法则。</span></p><p><span>《道德经》讲：<strong>“致虚极，守静笃；万物并作，吾以观复。”</strong>就是这个道理。“致虚极，守静笃”的状态，我们才能看到万事万物发展的规律。这里一样的，我们才能尽物之性。</span></p><p><span><strong>“能尽物之性，则可以赞天地之化育。”</strong>当我们能尽物之性的时候，能看懂事物的发展规律，则可以赞天地之化育。这里的赞是帮助、协助的意思。我们能看懂万事万物发展的规律，我们就可以帮助、协助天地去化育万物了。</span></p><p><span>这里我们来举例子，为了方便大家理解，那圣贤的文化是做什么的？是不是帮助天地来化育万物的、来教化众生的、教化世人的。圣贤是他至诚的，他找到了自己的天性。这个时候他尽了人性，尽完人性以后尽物性，看到了事物发展的规律，看到了每个时代发展的规律，每个时代缺少什么，这个时候就可以帮助天地来化育万物了。</span></p><p><span>再举个例子，古代的大禹治水，这些圣贤在做什么？是不是看到了事物发展的规律，看到了水灾，看到了人民受苦，这个时候他是不是开始帮助天地来化育人类？</span></p><p><span>比如说人类没有粮食的时候，有的圣贤看明白了事物发展的规律，找到了人挨饿的原因，又找到了四季变化的规律，开始有了水稻，创造出来了粮食。所以这个时候只有达到至诚的状态，才能协助天地来创造万物。</span></p><p><span>我们再往现代讲也是一样的，比如说我们这个时代有汽车、有手机、有电脑、有空调、有房子，都是哪里来的？是不是有的人看明白了我们这个时代缺少什么，看懂了自然规律的法则，从这其中找到了一条出路，来创造万物，这些都是在参赞天地之化育。</span></p><p><span>所以很多朋友都会有疑惑，大家都会经常问，说没有了欲望，社会要如何发展，时代要如何进步？所以我们去看这个时代也好，去纵观上下五千年的文明，哪一个时代，能帮助天地化育我们的、化育世人的、能推动时代发展的、能为国家做贡献的，是不是都是那些至诚之人？都是那些没有私欲的人。</span></p><p><span>当我们满心满脑都是私欲的时候，我们怎么可能去帮助别人？更何谈推动时代发展。所以很多人总是认为有欲望的人，才是让时代发展的人，其实欲望越多的人，反而是处在社会底层的人。</span></p><p><span>那些欲望越少的人，他越能尽人之性的人，越能尽天之性的人，才是不断推动社会发展，推动时代发展，帮助天地化育万物之人。</span></p><p><span>所以我们在学习圣贤文化，我们在享受这个时代，所带给我们的这些便利，都是有这些至诚之人中间所做的事情，所协助天地带给我们的便利。</span></p><p><span>所以圣贤的文化，就是在告诉我们道的运行规律，在告诉我们时代的发展规律。我们学习圣贤的文化，就是在学习智慧的经验和总结，我们越是明白这些道理，越是不断地去修正自己，这个就是自明诚的过程。</span></p><p><span>让我们择一善而坚守，不断地让自己达到至诚的状态。当我们达到至诚的状态，我们就能尽人性；尽人性，就能尽物性；尽物性，则我们也可以帮助天地之化育。所以就有很多文化的传承者，很多修行的传承者。</span></p><p><span><strong>“可以赞天地之化育，则可以与天地参矣。”</strong>当我们可以帮助天地去化育万物的时候，则可以与天地参矣。参是并立的意思，这个时候我们就可以与天地并立了。</span></p><p><span>我们经常听到一个词叫“三才”，天、地、人三才是并立的，没有大或者小。《道德经》告诉我们：“域中有四大。”说一个区域，就是我们所生活这个地方，有四大：道大，天大，地大，王亦大。王就是人，说我们人是可以与天地齐的，为什么呢？因为人是可以帮助天地化育万物的。所以才有了圣贤，所以才有了圣贤之文化来化育众生，所以他是以天地并立齐驱的。</span></p><p><span>这里我们所有的人再拉升一个境界，再来看这个世界。我们讲到了，我们都已经与天地齐，我们想象一下，我们在这个境界上再往下看。</span></p><p><span>庄子《逍遥游》开篇就讲：<strong>“北冥有鱼，其名为鲲。鲲之大，不知其几千里也。化而为鸟，其名为鹏。鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。”</strong>所以大家想一想《逍遥游》的境界，扶摇直上九万里。</span></p><p><span>儒家这里告诉我们与天地参，都在这个境界上。当我们站在这个境界上，再往下看的时候，生活当中所发生的事情还大吗？今天谁占了我五块钱的便宜；今天路上开车的时候，谁瞪了我一眼；我今天回到家里，家人眼色不好看；我今天因为一件衣服没买满意，我开始变得烦恼；因为同事某一句话，让我不开心了。所以我们站在这个境界往下看的的时候，可不可笑？是不是变得自己好幼稚，好可笑？</span></p><p><span>所以既然我们讲到这个境界上，我们就尝试着从这个境界上往下看，是不是生活当中的所有事情开始变小？开始变得不需要那么纠结，不需要那么执着了，这就是那个至诚的状态。</span></p><p><span>所以为什么越是圣贤的人，越是智者，不与人争辩、不与人计较呢？因为我们在低的境界上，他是在高的境界上，有什么可计较的？有什么可执着的？有什么可烦恼和愤怒的呢？</span></p><p><span>我们虽然达不到那个境界，但尝试从那个境界，再来看我们当下的生活，这个时候我们的心量大了，境界高了，是不是事情就变小？烦恼自然就变少了。</span></p><p><span>所以当我们生活当中解决不了的烦恼、困惑和问题的时候，其实都是我们的境界不够高，所以才有了这些痛苦的发生。</span></p><p><span>所以当我们达到至诚的时候，是在高境界上的。但是我们不得不说，没有办法，我达不到那个至诚的状态，达不到至诚的状态怎么办呢？《中庸》还有方法，接下来又告诉我们如何去修，如何去诚之的过程，达不到至诚怎么办？</span></p><p><span>告诉我们“其次致曲”，这里的曲是什么意思？不是弯的意思。曲是一方面，一部分，就是我们达不到至诚，怎么办呢？我们可以在一方面达到至诚。接下来就讲。</span></p><p><span><strong>“诚之者，人之道也。”</strong>说我们人还没有达到圣人的标准，还达不到至诚的境界和状态，但是我们可以从某一方面去致曲，就是某一方面我们可以是至诚的。</span></p><p><span><strong>“曲能有诚”，</strong>就是我在某一方面是可以有诚意的。举个例子，有的人在事业上能做到至诚，可能在家庭关系和朋友交往之中，做不到至诚；有的人可能我在家庭的氛围当中，可以做到诚，可能在事业上做不到诚。这个例子到处都是吧？</span></p><p><span>所以我们再去看生活当中，再去看自己，其实很容易就理解了这句话。当我们不能事事全面地达到至诚的时候，我们在某一方面先让自己有诚意，先让自己趋向于诚，这个就是“诚之者，人之道也”，就是我们人所修行的方法。如果我们在某一方面是有诚意的。</span></p><p><span><strong>“诚则形，形则著。”</strong>这个时候我们的诚意就会有形，就是通过行为可以表现出来，别人可以通过我们的行为，看到我们其中的诚意。我们讲《大学》会讲：“诚于中，形于外。”和这里的诚则形是一样的。</span></p><p><span>举个例子，我们在工作的过程当中，如果我们是有诚意的，别人通过我们的行为可不可以看得到？如果我们在家庭当中，对待家人如果是有诚意的，家人可不可以看得到？可以吧？如果我们对待客户是有诚意的，客户可不可以看得到？如果我们对待朋友是有诚意的，朋友是不是可以看得到？</span></p><p><span>所以我们先让自己某一方面是有诚的就够了，这个时候我们的外在的行为就会显露和表现出来。那么接下来，表现出来以后，“形则著”，就会有显著的、明显的效果。</span></p><p><span>比如说我们对朋友诚的时候，会不会有效果？我们对家庭诚的时候，会不会有效果？我们对于感情诚的时候，会不会有效果？我们对事业诚的时候，会不会有效果？我们对员工诚的时候，会不会有效果？就是无论我们对哪一方面的诚，都可以换来同样的效果和明显的别人所感受到的，甚至是回馈给我们的。</span></p><p><span>我们如果对于朋友是诚的，我们的关系就会变得更好；如果我们对客户是诚的，我们的生意就会变得更好；如果我们对感情是诚的，我们有可能感情就会变得更好。所以我们诚在哪里，哪里就会有显著和明显的效果。</span></p><p><span><strong>“著则明，明则动。”</strong>刚才我们说了，我们有诚有形能表现出来的时候，就会有明显的效果。但是有明显的效果，不代表所有的人都认可，对吧？还会有人非议，还会有人不理解，但是我们依然这样做下去，依然要至诚。</span></p><p><span>当我们至诚再有更大的发挥，更大的效果的时候，就是“著则明”，就会发光的，就会充满着光明的，就会影响到他人的，说明我们诚变得更大了。这个时候我们是光明的，是耀眼的，别人都可以看到的。</span></p><p><span>所以很多朋友都会讲，说：“我对别人是诚的，可是我也没有换来应有的效果，也不显著？”所以这里告诉我们“著则明”，不要着急。没有显著的效果，别人还在误解和不理解的时候，说明我们至诚的程度还不够。</span></p><p><span>那怎么办呢？继续去让自己变得至诚，接下来著就会明，这个时候我们的光明才更耀眼，别人自然就会看得到，我们的非议才能变少。</span></p><p><span>“明则动”，当我们散发着耀眼的光芒，别人都能看到我们的时候，明则动，别人才会受到我们的感动，别人才会受到我们的感化。</span></p><p><span><strong>“动则变，变则化”，</strong>这个时候别人受到了我们的感动，他才会发生转变。比如说延续刚才的例子，说我不停地对朋友诚，我不停地对客户诚，我不停地对家庭诚，可是他们并没有感动，他们并没有发生变化，说明我们至诚还不够。</span></p><p><span>我们到了这一步“动则变”，他受到了我们的感动，他就会去转变、去改变，就会受到我们的影响，这个时候“变则化”。化就是进入到一种境界了，他也变得和我们一样了，这个叫化。</span></p><p><span>说我是至诚的，别人受到了感动，开始发生转变，转变以后他也开始化了，开始变得跟我们一样去至诚了，开始变得跟我们一样，去行善道了，开始跟我们一样变得有光明，变得耀眼了，变得利益他人了，这个叫化。</span></p><p><span><strong>“唯天下至诚为能化。”</strong>所以告诉我们：唯有天下至诚才能化育万物，才能达到化的效果。所以整个其实这段，又给了我们一个次第，当我们还达不到至诚的时候，还不能化育万物，还不能与天地并立的时候，怎么办呢？先让我们某一方面是诚的，然后不停地去修我们的至诚，这个就是次第和标准，还有法则。</span></p><p><span>我们不断地这样去修正的时候，终有一天自己可以达到至诚的状态。因为我们每个人的自性都是光明的，我们每个人都有天性，我们每个人都是自诚明的，只不过我们被掩盖住了。所以我们要逐渐地去修正自己，让我们自己从生活的某一方面先开始去至诚，先开始去变得有诚意。</span></p><p><span>然后接下来就会<strong>“诚则形，形则著，著则明，明则动，动则变，变则化”，</strong>最后让自己达到至诚的状态。所以这个就是诚之的过程，人之道也，就是我们修行的方法，修道之谓教，这就是我们修正的过程。</span></p><p><span>我们当下达不到至诚的状态，是正常的，所以一定不要听到说达不到至诚，那要怎么办呢？我是不是就不要修了，就要放弃了？不是这样的。</span></p><p><span>我们每个人当下都达不到至诚，可是达不到至诚，我们知道方向，给了我们次第，我们按照这样的次第，不断地去诚之的过程，就是我们每个人所要修正的方法。</span></p></div>"
},{
    "title": "《中庸》第二十三讲 至诚如神",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十三讲 至诚如神</strong></span></p><p><span><strong>至诚之道，可以前知：国家将兴，必有祯祥；国家将亡，必有妖孽；见乎蓍龟。动乎四体。祸福将至，善，必先知之；不善，必先知之。故至诚如神。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“至诚之道，可以前知。”</strong>上一节课我们讲到：<strong>“为天下至诚，能尽其性”</strong>，但是当我们达不到所有的面都能至诚的时候，怎么办呢？其次致曲，从某一方面达到至诚也是可以的，这也是我们诚之的次第，修行的过程。</span></p><p><span>这里面又开始告诉我们：“至诚之道，可以前知”，我们从某一方面达到至诚，我们从某一方面就可以前知，前知就是预知将来所要发生的事情，任何事情都是一样的。</span></p><p><span>我们一直在讲，万事万物都有它自然的发展规律，当我们是达到至诚的状态，没有自己的念头，没有自己的情绪在的时候，我们看见一件事情的发生，自然会知道那件事情的结果。</span></p><p><span>举个例子，我们看到一个企业，如果我们看到一个企业是上下一心的，每个人都处在温暖喜悦和感动当中的，我们自然就会知道，这个企业一定会发展得越来越好。</span></p><p><span>我们《大学》也讲过：<strong>“未有上好仁，而下不好义者；未有好义，其事不终者也”。</strong>就是这样的道理。相反，如果我们看到一个企业都是勾心斗角的，每个人都是不快乐的，每个人都是很痛苦地在做事情，遇到事情都是互相推卸责任的，这个企业发展一定会越来越不好。</span></p><p><span>这就是至诚的力量。当我们对某一件事情有诚意的时候，我们对某件事情没有杂念的时候，我们就从其中看到了事物发展的规律。</span></p><p><span>比如说我们现在跟着学习了半年的朋友，我们再看一个人的言谈举止，看一个人的行为，看一个人所说的话语，看他当下所做的事情，做这件事情的发心是什么，就知道他这件事可以做多远。</span></p><p><span>我们再去听一个人经常是抱怨的，是指责他人的，每天的心情是忧虑的，我们就知道接下来他的身体会出问题的，他一定活得是很不开心的。</span></p><p><span>所有的事情都有规律，只不过我们从哪一方面是至诚的，我们就能看到哪一件事情的发展规律。所以接下来又开始讲了。</span></p><p><span><strong>“国家将兴，必有祯祥；国家将亡，必有妖孽。”</strong>当一个国家将要兴旺的时候，将要兴盛的时候，他必有吉祥的事情发生。看到人民都是其乐融融的，看到每一个人都是积极向上的。比如说在以前的朝代当中，都是赞叹帝王的，都是赞叹大臣的，生活都是很富足的，这就是吉祥的征兆。</span></p><p><span>同样，国家将亡，必有妖孽。有很多反常的行为出现，人民都是怨声载道的，就知道了这个国家将来一定要出问题的，将亡。这都是古之圣贤给我们的道理。</span></p><p><span>同样这个道理，我们现在延伸到我们的企业当中，延伸到我们的家庭当中都是一样的。如果我们家庭氛围当中，都是互相抱怨的，都是怨声载道的，就知道了这个家庭将亡，会解体的。因为每个人都处在负能量当中，都在互相地抱怨和指责，这就是预知。因为你知道了事物发展的规律。</span></p><p><span>同样，如果一个家庭是父慈子孝的，如果是其乐融融的，我们就知道了，这个家庭是要兴旺的，这个家庭生活一定会越过越好的。</span></p><p><span>同样在一个企业当中，一个团队当中，都是这样的道理。如果是上下一心，其乐融融的，这个企业一定发展得越来越好。如果这个企业的客户和公司内部的人，都是打成一片的，它自然会越发展越好。</span></p><p><span>如果反之，每天这里所有的人都是在斤斤计较的，都是在互相指责的，都是在互相抱怨的，所有的行为都是反常的，妖孽来了。我们就知道了，这个企业一定是越发展越不好，在走下坡路了。</span></p><p><span>所有的事情都有规律，只不过我们对这件事情不是至诚的，我们的杂念太多，所以我们才看不到。</span></p><p><span>我们不停地学习圣贤的文化，掌握道的规律，我们不停地去修正自己，让自己变得更淡定和从容的时候，这个时候我们看到什么事情，会发现极其简单，那个结果就摆在那里，这就是至诚可以前知。</span></p><p><span>所以他并不玄幻。他只是告诉我们，人是可以有预知能力的，不需要借助任何的外力，这个叫智慧了。</span></p><p><span><strong>“见xiàn乎蓍龟，动乎四体。”</strong>蓍：就是蓍shī草。龟：就是龟甲，以前的古人占卜用的。见乎：就是呈现。很多事物的发展，它是呈现在蓍草和龟甲上的。</span></p><p><span>“动乎四体”，就是通过行为可以看得到的。我们现在来讲，我们只讲文化的部分。比如说我们刚才所举的例子，在一个家庭环境当中、在一个团队当中、在一个企业当中、乃至在一个国家当中，只要我们是做任何事情，只要我们产生行为，就是动乎四体。我们的行为一发生，我们就会通过这个人的行为，通过这个团队的行为，而知道了接下来要发生的事情。</span></p><p><span>我们再来讲以前占卜的意义，以前古人占卜，占卜了之后他也要结合实际的情况。他在占卜之前，一定是对自身和当下的时局，了如指掌的。这个时候他是很清楚当下的状况，这个时候再来占卜作指导意义，再结合当下的情况，再动乎四体，再看当下这件事情所产生的这些行为，他就知道接下来该发生的事情了。</span></p><p><span>所以真正对《易经》了解清楚的人，是不需要占卜的。《易经》是为君子谋划事情的，是可以趋吉避凶的。当我们掌握了《易经》的规律，就再结合当下的实际情况和当下的行为，我们自然就知道下一步该发生什么事情，何须占卜。</span></p><p><span>这就是我们《中庸》讲的：<strong>“君子居易以俟命”。</strong>当我们自己把最简单的事情做好的时候，我们就掌握了事物前行的规律，是可以前知的，又何须占卜呢？什么情况下我们才占卜呢？对未来的不确定性，我们产生迷茫、不自信的时候才去占卜。</span></p><p><span>所以当我们居易以俟命的时候，其实是不需要占卜的。只需要通过事情的发生，动乎四体，自己和他人所产生的行为，自然就会知道接下来发生的事情，这个就是至诚的力量。</span></p><p><span><strong>“祸福将至，善，必先知之；不善，必先知之。”</strong>当我们的祸或者福要到来的时候，“善，必先知之”。怎么知道的呢？我们当下的行为是善还是不善的，清清楚楚。我们看自己和看他人，当下的心念、思维、行为是不是善的，是不是清清楚楚？</span></p><p><span>我们怎么才能看出来自己和他人当下的行为是善还是不善的呢？我们得是至诚的状态。至诚从哪里来？比如说我们对于文化是至诚的，我们对于修行是至诚的，我们就会不停地努力地去学习。只有我们是至诚的状态，不停地努力去学习圣贤文化，我们才知善恶，这个不就是“就有道而正焉吗？”</span></p><p><span>我们只有学习了圣贤的文化，我们才知道自己当下的行为是善的还是不善，才知道他人的行为是善的还是不善，这个就是至诚的力量。</span></p><p><span>所以我们看到这个人的行为，当下是善的还是不善的，不就接下来必先知之了吗？他当下是善的，结果就是善的；当下是不善的行为，结果就是不善的结果。所以这个就是诚意所带给我们的力量。</span></p><p><span><strong>“故至诚如神。”</strong>这里的神，我们通常形容神是有强大的力量的。有强大智慧的，叫神。所以说至诚以后，我们就是拥有这样强大的力量和强大的智慧。</span></p><p><span>我们往生活化来讲，其实他一点都不玄幻，甚至说极其简单。比如说大家去想一想，我们很多朋友已经跟着直播学习半年了，跟着直播修行半年了，大家在分享超话的过程当中，会发现很有意思。当身边的朋友，出现了家庭的纠纷、痛苦和烦恼，甚至出现生意上的不顺，他一跟我们讲的时候，我们可能几句话就能说中要害，有没有这种体会？</span></p><p><span>包括你们（学生们）跟着修行了这么久，别人在给你们打电话的时候，你在接电话的过程当中，你会发现他说了很多，你几句话就说中要害了。别人就会觉得这个人真神。</span></p><p><span>我们自己觉得神吗？不神。就是我们通过不停地学习，不停地修正自己，我们看很多问题是很清晰的，他是很简单的，这个就是至诚之道。</span></p><p><span>但是这个不是达到了至诚，告诉我们至诚之道，他只是至诚其中的用的方法，他是外用的，他是可以用的。所以我们去想象一下，我们对某一方面至诚，我们在哪一方面就可以前知。</span></p><p><span>举个例子，比如说我们对做饭是至诚的，因为至诚，我们一定会把这个手艺做得如火纯青，要不然就不叫至诚。</span></p><p><span>比如说做视频后期剪切，配字幕，如果对这件事情是至诚的状态，是不是就会不停地去学习？让自己这方面的技能很强大，这个时候就是如神的。</span></p><p><span>什么意思呢？别人做一件事情，他刚开始做，就知道结果不行。“不行，你这个肯定做不好，因为你那个架势就不对，你这个发心也不对，你这个方法也不行，你这个心态也不可以”。我们知不知道？是不是很清楚？</span></p><p><span>同样上来一个人，比如说前两天他她（学生）来的时候，她不会做，自己在那里急得直哭。我那个时候就跟她讲：“我说不会的，这个孩子几天后就能会做。”为什么呢？能不能感受到她急切想学习的心，她他迫切地想要做好的心，有这个就够了，一看就知道他是可以的。</span></p><p><span>但是相反，别的人他可能本来挺会，还觉得我的技术挺厉害的，还觉得我在以前是个优秀的人，但是在这里待上几天，可能就会知道了，他不行。为什么呢？是不是一看就知道，因为你们跟着修行了这么久了，你知道他没有诚在里面，没有那个诚在里面，他是不会加倍地努力的。如果不加倍地努力，诚不能在这个事情当中，他不产生力量。</span></p><p><span>我一直在强调，技术很快就过时，但是诚意不会。你可以不会这件事情，不知道怎么做，但是你只要有诚在，你就可以如神，就把这件事情可以做得炉火纯青。</span></p><p><span>然后当我们自己如神的状态的时候，我们会发现看很多事情，自然变得清晰，简单明了，不需要那么麻烦的。所以他一点都不玄幻，我们从哪一方面至诚，我们从哪一方面就可以前知。</span></p><p><span>比如说我们对于学习，对于修行这件事情，如果是至诚的，别人修到什么程度，一讲话知不知道？别人学习学到什么程度，一讲话知不知道？就是如神，其实他真的是极其简单的事情。</span></p><p><span>古之圣贤就是这样的，他走到哪个诸侯国，走到哪个地方，他就知道将来这个国家会发展成什么样子，他自然就清晰了。为什么呢？他掌握了这件事情的发展规律，它就是如此的简单，所以他是可以前知的。</span></p><p><span>为什么说人是万物之灵？只不过人没有找到自己的灵性，没有找到自己那个至诚，所以才不停地向外求，想借助于外界的力量来解决自己的问题，想借助于外界的力量，自己才能知道很多事情。其实大可不必，所以修行是向内求的，我们对哪件事情是至诚的，我们对哪件事情就是如神的，其实就是如此的简单。</span></p></div>"
},{
    "title": "《中庸》第二十四讲 成物成己",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十四讲 成物成己</strong></span></p><p><span><strong>诚者，自诚也；而道，自道也。诚者，物之终始；不诚，无物。是故，君子诚之为贵。诚者，非自成己而已也，所以成物也。成己，仁也；成物，知也。性之德也，合外内之道也，故时措之宜也。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“诚者，自诚也；而道，自道也。”</strong>说诚者，自诚也，什么意思呢？我们如何才能拥有诚？说：“你给我点诚吧，你让我有点诚意，求你给我点诚，求你给我点智慧。”不行的。所以这里告诉我们“诚者，自诚也”，诚哪里来的？要自我成全，这个诚是我们自己修来的。</span></p><p><span><strong>“而道者，自道也。”</strong>道哪来的？我们自修自证，自我实践所得来的。所以这句话要告诉我们不要向外求，至诚这么好，还可以前知，至诚可以变得这么有智慧。</span></p><p><span>怎么来诚呢？自我成全，自我学习，自我成长。那道这么好，我们怎么了解道啊？道，自道也，我们自修，自我实践，自我体悟，会发现生活当中处处都是道。但是，要靠我们自己，不要向外求，向外求是没有用的，别人给不了我们。</span></p><p><span><strong>“诚者，物之始终；不诚，无物。”</strong>说诚者是贯穿始终的。我们来举个例子，有没有这样一种人，我刚开始接触一件事情，或者我刚开始做企业，或者我刚开始工作，或者我刚开始学习，或者我刚开始修行，是诚意满满的，但是做着做着，做不好了。</span></p><p><span>为什么呢？诚意丢了。说我刚学一个东西，我诚意满满的，因为我不会，我努力地去学习。学着学着，我觉得我会一点了以后，诚意没了。</span></p><p><span>我刚开始学习，我很有劲头，我一定要努力学习，我一定要让自己变成一个有文化的人、有知识的人、有水平的人、有境界的人，讲了很多。可是我们会发现，学着学着不学了，学得慢了。为什么呢？诚意没了。</span></p><p><span>很多人做事情是不是这样的？我刚开始做事情的时候很努力，我很积极向上，可是做着做着诚意丢了，诚丢了。</span></p><p><span>所以告诉我们这个诚是贯穿始终的。“诚者，物之终始；不诚，无物。”如果我们中间诚丢了，无物，了无一物，什么事情都做不好，什么事情都做不成。</span></p><p><span>用《道德经》的话讲：<strong>“慎终如始，则无败事。”</strong>这是我们每个人都需要时时刻刻警醒自己的，慎终如始。我做每件事情，哪怕做到最后，我都去找到我最开始做事情的诚意，如果我们这个诚意是贯穿始终的，会发现，任何事情我们都做得好。</span></p><p><span>就是因为我们诚意不能贯穿始终，所以才导致很多事情都半途而废了。比如说谈感情，是不是也是这样半途而废的？本来觉得对这件感情是很有诚意的，可是走着走着，诚意没了，这段感情也就结束了。</span></p><p><span>我们去做一个工作，本来我对这个工作是很有诚意的。可是三分钟热血，做着做着诚意丢了，这件事情就失败了。很多人刚开始做企业，是不是都是有个很好的发心？刚开始动力很十足，可是做着做着诚意丢了，结果就是失败的，无物，什么都没有。</span></p><p><span>很多人学习和修行，刚开始是不是热血澎湃的？我一定要学习，我一定要变成有智慧的人，我一定要去照亮别人。可是走着走着，诚意丢了，结局就是失败的，就是自我放弃的。</span></p><p><span><strong>“是故，君子诚之为贵。”</strong>所以说，君子诚之为贵，诚是很珍贵的，是非常重要的，是贯穿始终的。</span></p><p><span>所以《中庸》中间有好几篇，都是在讲“诚”，就告诉我们“诚”的重要性。就好比是我们每一个人刚开始到这里的时候，其实大家是不是都不会？哪一方面都不会，可是我们每天一到不会的时候，我们就讲《大学》的诚意，我们今天和大家讲到《中庸》，这里的“诚”比《大学》讲的“诚意”又深了一个境界。</span></p><p><span>诚意是什么？得意念去调动，说：“我做这件事情没劲了、不会了，我要鼓励自己要有诚意。”而这个诚不是的，这个诚是我们不动意就保持在诚的境界和状态上，就是如神的。</span></p><p><span>所以相当于这个诚是内化了，但是这个诚是我们每个人都本有的。我们如果把自己保持在这个诚的状态上，不用说做每件事情，我让自己有诚意，不需要。我们本来就是有诚的，内在本来就是自诚明的，谓之性。</span></p><p><span>所以让我们自己保持在诚的状态上，我们做每一件事情的时候，我们都来思考：我们是不是诚的？</span></p><p><span>我们剪视频也是一样的，配字幕也是一样的，录课也是一样的，接电话也是一样的，我们做每件事情，都去看我在没在诚上。我学习也是一样的，修行也是一样的，如果我们一直让自己在这个诚上，一直保持诚的这种心态，保持诚的这种运转，会发现做什么事情都是简单的。</span></p><p><span>这个时候我们是无杂念的，并且是享受在这个状态当中的。所以我们要用心体悟这个诚，他是很珍贵的、很重要的，接下来又开始上升一个境界。</span></p><p><span><strong>“诚者，非自成己而已也。所以成物也。”</strong>说诚者不只是成就了自己就可以了，这句话非常有意思。诚者，不是只有成就自己就可以了，所以才能成万物也，是可以成万事万物的。</span></p><p><span>说我们对做饭这件事情是有诚的，我们只是在成己吗？不是吧？是不是也成就了美味佳肴呀？我接电话这件事情是有诚的，是不是不只是成己？是成就了打电话的那位朋友；我对于拍视频这件事情是有诚的，是不是不只是成了自己？还成就了这段视频；我拍电影的人，对于拍电影是有诚的，我不光成了自己，还成就了一个好的电影；对短视频这件事情是有诚的，不光成了自己，还成就了一个视频。</span></p><p><span>所以，所有的事情都是一样的，我们成的不只是自己，还可以成就万物。说我们养一盆花，如果我们对养花这件事情是有诚意的，不光是成了自己，还成就了美丽的花朵，是不是这样的？</span></p><p><span>所以这个就上升到什么呢？自觉觉他。我们不光是自成，并且我们在自成的同时，还在成就万物。如果我们不能自成，可以成就万物吗？不可以。</span></p><p><span>我们对做饭这件事情，如果是没有诚的，怎么能做出来美味佳肴呢？如果对做线上课这件事情，是没有诚意的，怎么可能做出来好的作品呢？如果对接电话这件事情是没有诚的，怎么可能成就打电话来的那个人呢？</span></p><p><span>所以这个境界就上升了，我们很多朋友经常在问，我如何能做好工作？我如何能学习好？我如何能做好生意？做生意怎么做得更好呢？去找自己的诚。我们的诚到了，就成就了那件事情了，就成就万事万物了。所以去看自己的诚是否在，我们找到这个诚，就是回归自己本性的过程。</span></p><p><span>所以“诚”是我们开篇所讲的：“天命之谓性”，换一个方式告诉我们，如何找到那个性？从诚开始修，让自己每件事情都是至诚的。</span></p><p><span><strong>“成己，仁也；成物，知也。</strong>”告诉我们成己，成就自己，是建立内在的仁，这是仁也。成物，知也，当我们能成就万事万物的时候，是一种智慧。</span></p><p><span>我们再来延伸和举例子，说一个人的智慧是从哪里增长的呢？首先我们得成己，如何成己呢？得让自己内在是有仁德的，是有仁爱之心的，是有仁慈之心的。接下来，当我们有了仁爱之心，有了仁德，我们就会做什么样的事情？我们自然而然地就会去做利益他人的事情，不停地在明德。</span></p><p><span>《大学》讲的明德，然后就会亲民。我们内在有仁德的人，我们自然就会去做利益他人的事情，这个时候才开始成物，知也。我们在做利益他人事情的过程，自然就会增长智慧；如果我们不去做利益他人的事情，会发现我们的智慧很难增长的。</span></p><p><span><strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>如果我们不去做亲民的事情，是不可能止于至善的。一个袖手旁观的人，怎么可能圆满呢？所以这里告诉我们：“成物，知也”，只有我们去成就、成全万事万物，这个时候我们才能变得有智慧。</span></p><p><span><strong>“性之德也，合外内之道也。”</strong>告诉我们性之德也，内成仁。刚才讲的成己，仁也；外成知，成物，知也，合起来就是本性之德也。说天命之谓的本性，本性的德就是这样的。所以他是合外内之道也。</span></p><p><span>他是合外内之道的，合外是什么？成物，知也。合内是什么？成己，仁也。所以整个这句话告诉我们，内在修自己的仁德，外在去成就万事万物，这个是性之德也。我们本性就是如此的，所以他合外内之道也。</span></p><p><span><strong>“故时措之宜也。”</strong>故而，时就是随时的意思。措是施行，宜也，就是适宜的意思。这句话连起来什么意思？所以说随时随地，施行的、所做出来的行为，都是适宜的，都是合适的，就是道。</span></p><p><span>所以开篇就告诉我们：<strong>“天命之谓性，率性之谓道”</strong>，做所有的事情随时随地都是合时宜的，都是合道的。为什么呢？因为成己，我们内在有仁；成物，我们外在有德；中间又能不断地增长智慧，所以这是性之德也。</span></p><p><span>当我们有了本性之德行，我们做任何事情就是道本身，故而叫“率性之谓道”。怎么做，随时随地做什么都是合时宜的，这就是至诚的力量。当我们不断地去至诚，就是让我们不断地回归本性，就是让我们内外都是合道的，就回归了我们性之德也。</span></p><p><span>我们在做事情当中，如果没有这个诚在，我们那个事情能做好吗？比如说拍视频、剪辑视频，如果没有这个诚在，怎么能把这个事情做好？比如说有的时候做的小视频，别人看了很好，说这个视频做得太棒了，这个视频做得真的神了，这个境界，让人一看就很舒服。我们去从这件事情思考，就知道他一定有诚在里面的。</span></p><p><span>我们去剪辑视频，去配字幕，如果自己是非常有诚的，就做这件事情，心无杂染，我一心只想把这件事情做好，会发现所呈现出来的，别人看着就是好的，这是其一。</span></p><p><span>其二，会发现做的过程当中，就是轻松自在的，有没有这种体会？这是我们做出来的吗？怎么做出来这么好，超常发挥，这就是神。就是我们很自如，很轻松的状态。</span></p><p><span>所以我们去看，去思索，我们生活当中所有发生的事情，只要是觉得做得特别好的，特别轻松自在的，都是因为这个诚在其中。如果没有这个诚，我们做事情是做不好的。</span></p><p><span>去想一想，接电话的时候不是吗？如果没有诚在，接电话就是草草了事，接电话就是赶紧说完算了；接电话就是，买不买课，不买课抓紧挂了。别人就感受得到，而且自己也很痛苦，会发现越接越痛苦，因为觉得每个人来的电话，好烦呢！因为没有那个诚在。</span></p><p><span>所以，如果对接电话这件事情是有诚意的，我们接什么样的电话不是电话呢？他只要打来电话，说明他是有需求的。我们对电话是诚的，对接电话这件事情是诚的，对电话背后的那个人是诚的，会发现，他说什么就陪他聊什么，他需要什么，我们就力所能及地给予他点什么。</span></p><p><span>这个时候我们就是轻松自在的，保持了轻松自在，说话才能说到重点，别人才能说：“这个人真的神了，通过接个电话怎么就能知道我的问题？”它就是这样来的呀。</span></p><p><span>我们看看做每件事情，不是这样的吗？所以大家要知道诚的重要性，他是物之终始。如果没有诚，无物，万物都不形成，最终所有的事情的结局，一定是以失败告终的。所以我们至诚的状态能保持多久，也就决定了这件事情能做多久。</span></p></div>"
},{
    "title": "《中庸》第二十五讲 无为而成",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十五讲 无为而成</strong></span></p><p><span><strong>故至诚无息，不息则久。久则征，征则悠远，悠远则博厚，博厚则高明。薄厚所以载物也，高明所以覆物也， 悠久所以成物也。博厚配地，高明配天，悠久无疆。如此者， 不见而章，不动而变，无为而成。</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“故至诚无息，不息则久。”</strong>所以说“至诚”是不停止的，不停息的。“不息则久”，只有不停息才会久。</span></p><p><span>什么叫至诚无息呢？首先我们先讲深层次的意思，如果至诚，我们找到了至诚，达到了至诚，他是自然运转，自己运转不会停息的。就好像我们说自性是圆满的，一旦我们找到了那个自性，他自然就是圆满、圆融和光明的，他自己是不会停止的。</span></p><p><span>我们再回来讲浅一层的意思，我们达不到至诚之前，要怎么办呢？至诚无息，我对一件事情是至诚的，我让自己不停息。</span></p><p><span>举个例子，我对于学习这件事情，如果是至诚的，那我刚开始不能做到他自己不停息的状态，怎么办呢？就是“诚之”的状态，我自己约束自己的行为，不让自己停息，我不停地去约束自己，让自己努力地去学习。</span></p><p><span>学到什么程度呢？学到发现有一天我不学习像少了什么东西一样；一天不学习，我是不舒服的状态；一天不学习，我觉得我的生命，都开始变得没有意义。这个时候会发现他自然就是不停息的，那我们没到那个境界之前，我们自己要约束自己的行为了，不让自己停下来。</span></p><p><span>比如说我做每件事情的时候也是一样的，我不能达到至诚的状态，怎么办呢？我要用“诚之”来约束自己，我不停地告诉自己，做这件事情要有“诚”，我自己人工地让他不停息。</span></p><p><span>当我们达到那个境界，就是自动的，现在我们只能半自动，那就得约束自己的行为，让自己约束自己去保持诚的状态，所以叫“至诚无息”。</span></p><p><span>“不息则久”，当我们自己不断地约束自己的行为，不断地让自己去“诚之”的过程，不息才会长久。</span></p><p><span>“久则征”，征是什么意思？就会有效验了，就会有明显的效果出来了。所以只有保持长久的至诚的状态，我们才会有效验、有效果表现出来。</span></p><p><span>有效果表现出来的时候，我们自己也可以感受得到，他人也可以看得到。接下来又告诉我们。</span></p><p><span><strong>“征则悠远”，</strong> 有了明显的效果，他才会变得悠远无穷，没有穷尽。</span></p><p><span><strong>“悠远则博厚”，</strong>只有我们变得悠远的时候，我们才能博厚，厚德载物。我们只有让自己变得博厚，我们才能去承载更多的事情。</span></p><p><span>如果我们不能让自己变得博厚，我们如何去承载更多的事情呢？他是相互作用。我们再反过来讲也是一样的，如果我们不愿意去成物，不愿意去帮助他人，不愿意去承载，我们又怎么才能博厚呢？</span></p><p><span>所以他是相辅相成的，就好比是我们讲的“成己，仁也；成物，知也”，他是密不可分的。我不停地去成己，让自己变得有仁德；我不停地去成物，让自己变得有智慧。</span></p><p><span>这里也是一样的，我们要不停地去承载更多的事情，让自己变得博厚。只有我们变得博厚了，我们才能去承载更多的事情。所以儒释道的文化，教给我们的道理是相通的，自利利他。</span></p><p><span>《大学》告诉我们：<strong>“在明明德，在亲民，在止于至善。”</strong>《中庸》这里告诉我们：“成己，仁也；成物，知也。”《论语》告诉我们：“己欲立而立人，己欲达而达人。”</span></p><p><span>所以我们要想让自己变得博厚，我们就要去承载，去帮助更多的人。只有我们去承载了更多的事情，帮助了更多的人，我们才能让自己变得博厚。</span></p><p><span><strong>“博厚则高明。”</strong>只有博厚，我们才能变得高明。高明是什么呢？美妙的、高大光明的样子。我们形容天是用高明的，当我们变成高明的样子，我们就可以去照耀万物。我们如何才能变得博厚？如何才能变得高明呢？从至诚开始。</span></p><p><span><strong>“至诚无息，不息则久；久则征，征则悠远；悠远则博厚，博厚则高明。”</strong>这就是次第。“物有本末，事有终始，知所先后，则近道矣。”这就是至诚这件事情的规律。</span></p><p><span>我们如何把自己修成高明的样子？首先从至诚开始修，从每一件小的事情开始修，从诚之的过程开始修，让自己保持对每件事情都有诚。</span></p><p><span><strong>“薄厚所以载物也，高明所以覆物也。”</strong>只有博厚，我们才可以承载万物，像大地一样承载包容和滋养万物。</span></p><p><span><strong>“高明所以覆物也”，</strong>覆物是覆盖的意思，当我们变成高明的境界和状态，我们才可以覆盖万物、引领万物；知物，用物。就是我们之前讲的“能尽物之性”。</span></p><p><span><strong>“悠久所以成物也。”</strong>我们只有悠久，所以才能成就、成全万事万物。包括我们做一个企业，或者我们做某一件工作，某一件事情是不是也是一样的？只有悠久才可以做成这件事情。</span></p><p><span>如果我们做事情是有头无尾的、有始无终的，那如何才能成物呢？好比是我们刚开始做一件事情的时候做得很好，因为有诚在。做着做着诚没有了，最后这件事情的结果也是不好的。因为什么？不够悠久，不能长久地保持诚的状态。</span></p><p><span>所以整个告诉了我们三个关键点：一个是博厚，博厚我们才能承载万物；一个是高明，高明我们才可以覆盖引领万物；一个是悠久，悠久我们才能成物。</span></p><p><span><strong>“博厚配地，高明配天，悠久无疆。”</strong>博厚是和大地相匹配的，所以我们经常讲“厚德载物”。高明是可以配天的，天是主宰万物的，地是承载万物的。</span></p><p><span>悠久无疆，只有悠久的，这件事情才可以无穷尽地发展下去，才可以无穷尽地做下去。</span></p><p><span>所以我们从至诚开始修，当我们不断地去修自己的至诚，不停息的状态就会久；久了以后会有效验、有效果，别人就可以看得到；别人看得到以后，他自然就会变得悠久；悠久以后开始博厚，博厚的时候我们就开始能承载万物了。</span></p><p><span>所以我们去看，一个国家的发展也是这样的，他只有经过悠久以后，所得到的现状才可以承载更多的事情。包括我们学《论语》的时候也讲过，即使是一个圣贤之人，一个贤德的君主治世，他也至少需要三十年的时间。为什么呢？他也需要三十年，甚至一百年的时间，才可以把一个国家治理好。因为他需要时间，来让他变得悠久，变得国富，变得民强。</span></p><p><span>我们看一个企业，是不是一样的道理？一个企业它一定要经历一个时间段的发展，才可以变得博厚。这个企业经历两年、三年、五年，甚至十年的发展，它才可以去承载更多的事情。</span></p><p><span>包括我们一个人不是一样的吗？我们到一个企业当中去工作，看看是不是如此，我们需要三个月、半年，甚至一年的时间，不停地让自己积累，我们才能去承载更多的事情。</span></p><p><span>我们学习和修行不是如此吗？我们要经过几个月甚至一年、两年、三年、五年的学习和不断地修正自己，我们才能让自己变得博厚。让自己变得博厚以后，这个时候我们来承载事物的。</span></p><p><span>博厚以后，下一步再干嘛呢？让自己变得高明，就是我们可以照耀万物的，我们可以引领万物的。一手托起万物，一手引领万物，这就是“天地位焉，万物育焉”，很多事情自然就在中间就会发展。</span></p><p><span>所以我们去想一想，无论是一个人还是一个企业，我们能承载事物，又能引领和照耀事物的时候，这些事物自然就会在里面生长和发展。这就是《中庸》开篇所讲的：<strong>“天地位焉，万物育焉。”</strong>天地各归其位，万物自然生长。</span></p><p><span>我们一个企业是不是一样的，我们能托起事物，托起我们团队和客户这些人。同时又能引领方向，又像一束光一样，不停地去照耀每一个人，让每一个人可以感觉到温暖。这个时候，万事万物在其中自然就运行了。这个就是天地之道，也是中庸之道。</span></p><p><span><strong>“如此者，不见而章，不动而变，无为而成。”</strong>如果能做到这样，我们不需要去表现，不需要去呈现，自然就会变得彰显。我们不需要去动，不需要刻意地去做什么事情，自然而然就会产生变化。万事万物在其中自然就会生长，自然就会变得节节高。</span></p><p><span>“无为而成”，不需要去做任何事情，自然水到渠成。所以其实儒家也是讲无为的。但是为什么又讲了那么多有为的方法呢？就是我们不懂得这个境界之前，自然要是有为的。可是当我们有为做到了一定程度，是可以无为而成的。就像我们每天去找到了自己至诚的状态，会发现做什么事情我们不用刻意。</span></p><p><span>举个很小的例子，如果我们做这件事情，内心是很至诚的，我们不用刻意去找哪个方法，凭着自己那个诚，那个感觉它就是在的。我们也不用去要求那个结果，说我一定要把这件事情做好，不用的。当我们那个诚意在的时候，会发现我们就自然而然地做，无论怎么做效果都是好的。</span></p><p><span>我们做企业更是同样的道理，如果我们按照之前《中庸》这一段所讲：“天地位焉，万物育焉。”我们自己又是博厚的，可以承载这些事物，同时我又能引领和照耀这些事物，我们需要要求那个结果必然是好的吗？我们需要再刻意做什么样的事情吗？是不是其实都不用呀？它自然就是水到渠成的，所能达到的那个效果。</span></p><p><span>如果我们对某件事情是至诚的，会不会被困难和阻碍所阻挡？不会吧？无论我们遇到任何的事情、遇到任何的艰难，我们都可以去战胜，可以去克服，这就是至诚。</span></p><p><span>或者换句话讲，我们再来讲性，说我们“天命之谓性”，那个本性是善良的、是至真的、是至纯的，我们会不会因为遇到了一个跟自己有利益的事情，让我们起情绪的事情，就保持不善良了？不会吧。</span></p><p><span>所以为什么要致良知呢？就是我们要致自己的良知，我们要找到了自己的良知，是不会做坏事的，无论什么样的理由和借口，都不会。</span></p><p><span>再讲回来，诚也是一样的。如果我们是至诚的状态，不会被任何问题和困难吓退的。所以这些古之圣贤会不会因为挫折、障碍、困难，自己就停止不前了？儒家要讲忍辱负重的，当我们是至诚的状态，所谓的碰到困难和挫折还算辱吗？不算。</span></p><p><span>所以当我们还被很多困难阻碍住的时候，说明什么？我们没有至诚。我们要明白这个道理的时候，怎么办呢？碰到困难的时候，刚才说了我们人工至诚，手动，就是因为还没达到至诚。要是达到至诚，我们是不会被这些障碍吓到的，不会被这些困难阻碍的，但是我们明白这个道理很重要。</span></p><p><span>我们做不到的时候，我们就开始手动的了，我要至诚。碰到这个问题，我怎么想办法把这个事情解决掉，把这个障碍跨过去，继续前行，这就是在“诚之”的路上。</span></p><p><span>所以他讲的至诚的状态就是这样的，做什么事情就是轻松自在的。碰到问题，我也会一笑而过，这就是至诚的那种状态上。</span></p><p><span>所以如果做事情我们不能达到这样的状态，总容易退缩的时候，说明我们对这件事情不够至诚。那我们怎么办？就是“诚之”，就是手动地至诚。就是告诉我们不行，这件事情我是要至诚的，我是要跨越这个困难和障碍的。我们跨越一层，我们的诚就多一分，我们就更趋向于那个至诚的路上。</span></p><p><span>所以，当成者的时候，我们不光是在成自己，我们还能成万物，成就事物。我们对哪件事情是至诚的，我们就可以成就哪件事情。</span></p></div>"
},{
    "title": "《中庸》第二十六讲 天地之道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十六讲 天地之道</strong></span></p><p><span><strong>天地之道，可一言而尽也：“其为物不贰，则其生物不测。”天地之道：博也，厚也，高也，明也，悠也，久也。今夫天，斯昭昭之多，及其无穷也，日月星辰系焉，万物覆焉。今夫地，一撮土之多，及其广厚，载华岳而不重，振河海而不泄，万物载焉。今夫山，一卷石之多，及其广大，草木生之，禽兽居之，宝藏行之。今夫水，一勺之多，及其不测，鼋鼍蛟龙鱼鳖生焉，货财殖焉。</strong></span></p><p><span><strong>《诗》云：“维天之命，於穆不已。”盖曰天之所以为天也。“於乎不显！文王之德之纯。”盖曰文王之所以为文也，纯亦不已。</strong></span></p><p><span>《中庸》的整个一段，我们穿插课答的小问题，关于什么是诚，关于如何理解无为而成？当我们更好的理解诚，更好的理解无为，更好的理解至诚无息，我们接下来要讲的部分才好容易去理解。接下来开始给我们举例子了。</span></p><p><span><strong>天地之道，可一言而尽也。</strong>天地的道，一言就可以说完了。</span></p><p><span><strong>其为无物不贰，则其生物不测。</strong>其为物不贰，告诉我们天地，创造万物的时候是不贰的，也就是一，也就是至真至纯的状态。所以这里告诉我们，天地之言，可一言而尽也，指的是至诚，告诉我们其为物不贰。</span></p><p><span><strong>则其生物不测，</strong>因为天地创造万物是没有分别的、没有杂染的、是至诚的状态，同时则其生物不测，生育万物化育万物是深不可测的。</span></p><p><span><strong>天地之道，博也，厚也，高也，明也，悠也，久也。</strong>天地的道都有什么样的特质？他是博的，博也，广博；厚也，深厚；高也，高大的；明也，光明的；悠也， 悠远的；久也，长久的；所以我们要学习效法天地之道。</span></p><p><span>《道德经》讲：<strong>“人法地，地法天，天法道，道法自然。”</strong>人法地，地法天，是什么意思呢？这个法就是效法的意思。人要效法天地，学习天地之道。所以天地之道是广博的，深厚的，高大的，光明的，悠远的，长久的，这个也是我们学习的。</span></p><p><span>博也，我们让自己变得更广博，让自己变得更博学；厚也，我们让自己变得更深厚，变得更精通，当我们不断地博学，让自己变得更精通，接下来让我们自己变得更高大，更光明。</span></p><p><span>当我们变得更高大更光明，这里的高大指的是什么?我们的格局，光明是我们每个人可以散发的光和热的，如此才可以悠远。悠远，作为我们来讲，就是不停地去持续；久也，才可能长久。</span></p><p><span>所以这也是我们每个人，所学习所要修行的次第。只有我们不断地博学，才能让我们自己博厚。只有我们博厚，才可以变得能承载万事万物；当我们能承载万事万物，才能让自己变得光明；当我们变得光明才会走得更久远。</span></p><p><span>整个这一段告诉我们天地之道的特质，也告诉我们每个人为学、修行，所要行的次第，所要具备的特质是什么样子的。接下来开始具体举例子了。</span></p><p><span>今夫天，斯昭昭之多；说我们今天来说说天。这里的昭昭之多，就是一点一点的光明积累而成的。</span></p><p><span>及其无穷也，日月星辰系焉，万物覆焉。我们今天来说说天，他是由一点一点的光明积累而成。极其无穷也，我们如果再往大了讲，他又是无穷无尽的，日月星辰都是悬系悬挂在其中。万物覆焉，他是可以覆盖照耀万物的。</span></p><p><span><strong>今夫地，一撮土之多，及其广厚，载华岳而不重，振河海而不泄，万物载焉。</strong></span></p><p><span>现在再来说说地，往小了讲他只有一撮土之多。我们经常形容一撮，就是很少很小的意思，如果往大了讲，及其广厚，他是广博的是厚重的。</span></p><p><span>载华岳而不重，这里的华岳指的是西岳华山。那何止是华山，上面所承载太多的山了，我们说三山五岳等等，太多的名山都是被大地所承载的。</span></p><p><span>振河海而不泄，容纳河海而不泄露，我们所有的山、河、陆地都是承载于大地之上的。万物载焉，他是可以承载万物的。</span></p><p><span><strong>今夫山，一卷石之多，及其广大，草木生之，禽兽居之，宝藏兴焉。</strong>我们再来说说山，一卷石之多，像拳头这么小的石头，这是往小的说。往大了讲及其广大，草木生之，所有的草木都是在山上生长的；禽兽居之，禽兽是居在山林之中的；宝藏兴焉，有丰富的宝藏物产在里面孕育，在里面生长。</span></p><p><span><strong>今夫水，一勺之多，及其不测，鼋鼍蛟龙鱼鳖生焉，货财殖焉。</strong>我们再来说说水，往小的讲，可能一勺之多，或者只有一杯水。如果再往大了讲，及其不测，水又深不可测，江河胡海都是深不可测的。尤其是我们经常用海来形容，他深不可测的时候里面又可以孕育和生长万物的。</span></p><p><span>鼋鼍蛟龙鱼鳖生焉，这些都是生长和生活在水里的。这里的鼋指的是大鳖，鳖最大的种类；鼍是指鳄，鳄鱼，扬子鳄；蛟，大家都是知道了蛟和龙。蛟、龙、鱼、还有鳖，这里只是举了几个其中的例子。海里的生物非常多，都是在里面生长和生活的。</span></p><p><span>货财殖焉，并且里面还有很多珍珠，水晶，珊瑚等等珍贵的珠宝，都是从里面繁殖的。从天，地、山、水，给我们举例子。告诉我们什么道理呢？大地从一开始的一撮土，到可以承载万物。天从昭昭之多，那一点点的光明，到可以覆盖万物；山从一卷石，这么小的一个石头开始，可以让草木生之，可以让禽兽居之；水从一点点开始，最后到可以里面生长和孕育万物。</span></p><p><span>整个这段告诉我们至诚无息。天，地，山，水，都是至诚的。这一段的开篇就在告诉我们天地之道，可一言而尽也，这一言就是至诚的状态。</span></p><p><span>当我们有了至诚的状态，至诚无息，不息则久，久则徵，徵则悠远，悠远则博厚；博厚则高明。说我们这个山和大地还有水，最开始他至诚的状态。由小不停地变大，一开始只有一撮土之多，后面的时候，就发展成了一座大山，大山也是一点一滴形成的。</span></p><p><span>所以告诉我们天地循环的规律，都是从至诚无息开始的。只有我们是至诚无息的状态，我们再不停息才会变久，久才会变徵，就会有明显的效果。徵才会变得悠远，悠远才会变得博厚，博厚才会变得高明。</span></p><p><span>整个这段用山、水、天和地举例子，告诉我们都是从最早的至诚的状态不停息地前行，不停息地去至诚，才能让自己变得博厚和高明。</span></p><p><span>我们每个人的学习也是如此，一点一滴积累来的，我们每个人的修行也是点点滴滴积累而来的。我们自己当下什么样的生活，我们自己做生意的，我们生意做的有多大，都要从至诚无息开始，点点滴滴的积累，我们才可能变得博厚，才可能变得悠远。</span></p><p><span><strong>《诗》云：“维天之命，於穆不已。”</strong>我们至诚无息，从天、地、山、水开始举例子，让我们明白至诚无息的原理和发展的规律。不可以不举人的例子，所以接下就说了。</span></p><p><span>《诗经》说：维天之命，於穆不已，这里开始依然从天开始举例子，维天之命，上天之道，上天的道理。於穆不已，於是感叹词；穆是深远的意思；不已就是无穷的，无止境的。上天之道深远无穷，接下来开始总结了。</span></p><p><span><strong>盖曰天之所以为天也。</strong>所以说天之所以为天，就是因为他深远无穷。这个时候开始赞叹周文王。</span></p><p><span><strong>於乎不显，文王之德之纯。</strong>於乎不显，岂不光明，岂不显著！感叹句，用我们现在的话理解，多么光明显著的样子。文王之德之纯，周文王的德行是如此的纯净，这里告诉我们如此之纯净。纯讲的是什么？就是至诚的状态他就是纯的。</span></p><p><span>所以我们再来理解这句话，说周文王的德行是如此的纯净，如此的至诚，多么的光明显著。</span></p><p><span><strong>盖曰文王之所以为文也，纯亦不已。</strong>所以说周文王他才是周文王，纯亦不已，刚才说了维天之命，於穆不已，不已就是无穷的无止境的样子。</span></p><p><span>所以这里又说周文王，纯亦不已，周文王之纯，周文王的至诚是无穷的、无止境的，就是至诚无息的状态。周文王是一心为民的，道德纯净至诚无息的状态，这就是人之道。人之道也是天之道。</span></p><p><span>《中庸》讲过：<strong>“诚者，天之道也；诚之者，人之道也”。</strong>我们人修行是要诚之的过程，当我们自己达到至诚的状态，诚者天之道，所以说和天道一样的。</span></p><p><span>整个《中庸》到现在这一段，天、地、山、水、人，其实达到至诚的状态是一样的。《诗经》还有一句话是赞叹周文王：“穆穆文王，于缉熙敬止”，说周文王光明的深远的德行，是让人们如此的尊敬，如此的敬重，因为他是合天道之道的。</span></p><p><span>所以时至今日，我们还在赞叹文王，还在赞叹这些圣贤的文化，还在赞叹孔子，都是因为至诚的状态。他是合乎于天道的，至诚的状态也就是自己本性的状态。</span></p><p><span>《中庸》开篇：<strong>“天命之谓性，率性之谓道。”</strong>我们率自己至诚的本性，所思所想所作本身就是道。所以又一次来告诉我们，至诚的重要性，至诚就是我们自己的本性的那个状态。无论是天、地、山、水、人，都是从至诚无息开始的。</span></p><p><span>比如，周文王，一开始不是如此的悠远，不是如此的博厚，不是如此的高明，他是点点滴滴的一心为民，让自己的道德更加纯净，让自己保持至诚无息的状态。包括我们讲的山水也是一样的，都是点点滴滴，从至诚无息积累而来来。</span></p><p><span>整个这段告诉我们，修行的次第，学习的规律，做圣贤的次第，依然如此。合天道的规律依然如此，所以告诉我们，修道之谓教，我们点点滴滴地去修正自己，让自己达到至诚的状态，就是合乎道的。</span></p></div>"
},{
    "title": "《中庸》第二十七讲 圣人之道",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十七讲 圣人之道</strong></span></p><p><span><strong>大哉！圣人之道！洋洋乎，发育万物，峻极于天。优优大哉！礼仪三百，威仪三千，待其人而后行。故曰：“苟不至德，至道不凝焉。”故君子尊德性而道问学，致广大而尽精微，极高明而道中庸。温故而知新，敦厚以崇礼。</strong></span></p><p><span><strong>大哉！圣人之道！</strong>接下来告诉我们圣人之道。圣人是如何做事情的，圣人是如何修正自己的，伟大的圣人他所行的道。</span></p><p><span><strong>洋洋乎，发育万物，峻极于天。</strong>洋洋乎，就是很多充满天地之间洋洋洒洒，是形容很多，充满于天地之间的叫洋洋乎。</span></p><p><span>发育万物，峻极于天，发育万物是可以使万物生长，使万物生存的；峻极于天，像天一样崇高和伟大，圣人的道理是什么样的？是发育万物的，他是利益万物的，不只是利益人。</span></p><p><span>比如，圣人发展农业，发展文化的传承，不光是利益人，不光是化育人的，还有化育万物。之前我们也讲过，参赞天地之造化，还要看天道的运行规律，给我们创造万物，让万事万物都在其中可以生存。</span></p><p><span>所以，圣人的伟大充满于天地之间，是可以让万事万物都受其影响，去创造，生育和化育滋养万物的，这是圣人所行的道。这是外在的行为，也就是所行之道之方法。接下来讲内在的。</span></p><p><span><strong>优优大哉！礼仪三百，威仪三千，待其人而后行。</strong>优优就是充足充裕的样子。圣人的内在也是充足的，也是充裕的，具有礼仪三百，威仪三千。待其人而后行，待其人是指圣人自己。待自己有这样的德行以后而后行，后面自然就会出来，礼仪三百，威严三千。</span></p><p><span>一个圣人的威仪是从哪里来的？他是自己内在有德行以后，外在的礼仪和威仪自然就出来了。这里的威仪并不是只有严肃，这里的礼仪三百，威仪三千，都是概念词，其实何止三百或者三千。</span></p><p><span>但是，当一个人具有了德行以后，自己符合圣人的标准，符合道的时候，他所有做出来的事情都是合乎道的，自然就会合乎礼仪的，自然就是威仪的。</span></p><p><span>比如，这些圣贤老子也好，孔子也好，看上去他就是有威仪的，看上去他所讲的哪一句话，他所做出来的哪一个行为，都是合乎礼仪的。因为他内在的德行是优优大哉的，他是充足的充裕的，所以叫待其人而后行。</span></p><p><span>我们自己也是一样的，不断修自己内在德行，礼仪和威仪自然就会出来的，这是内在的。当我们有了内在的这些德行之后，就开始外在的了，叫圣人之道。</span></p><p><span>圣人所做的事情，所用的方法，外面的道，外用的就是洋洋乎，发育万物。他是充满于天地之间的，可以化育万物的，像天一样崇高和伟大。这是形容圣人的内在和外在。所以接下来开始给我总结了。</span></p><p><span><strong>故曰：苟不至德，至道不凝焉。</strong>所以说，如果不能让自己去达到至高的德行，至道不凝焉。凝，是凝聚的意思，怎么能让道凝聚集中在我们这里呢？</span></p><p><span>整个《中庸》告诉我们，做事情要合道，当我们所做的事情，当我们的思维行为合的道越多，万事万物自然就会聚集在我们这里。因为我们这里是合道的，所以道在此凝聚。</span></p><p><span>我们现在很多人在学习圣贤文化，很多人在修行，也有很多人在做事业，有很多人在做生意，我们去讲这个时代，甚至在以前古时候也是一样的。只要是一个人有所成就的，在某部分一定是合道的，合道的部分有多大，就会聚集在那里有多少道。</span></p><p><span>我们处处都合道的时候，就会有更多的道，聚集在我们这里，所以说我们有多大的德行，就会有多少道，就能成多大的事情。</span></p><p><span>所以，这里告诉我们，苟不至德，至道不凝焉。如果我们不能去至德，之前讲的是至诚，如果我们不能去至德，道也不会凝聚在我们这里。</span></p><p><span>再来往前反推，来理解这段话的意思，我们至德，道就会凝聚在我们这里；道凝聚在我们这里，我们就会有礼仪三百，威仪三千。</span></p><p><span>当我们有了内在的德行，才能去做外在的事情。洋洋乎，发育万物，峻极于天，我们就能去化育万物，和天一样崇高和伟大，这就是圣人所行的道。</span></p><p><span>告诉我们要至德，道就会聚集在我们这里，聚集在我们这里，我们内在的仁德外在的行为，自然就会得以彰显，这就是大哉圣人之道。</span></p><p><span>故君子尊德性而道问学。接下来开始降了一等，刚才讲的是圣人之道，现在又告诉我们君子要如何做事情。我们达不到圣人之道，没有圣人如此的崇高和伟大，我们没有至德怎么办？我们做一个躬行君子，躬行君子内在有仁德，外在有利益众生的事情，才能去做圣人。</span></p><p><span>我们是躬行君子，我们要如何去做呢？尊德性而道问学，我们要尊重的是德性，是我们内在的德性，要依德性而道问学，要依我们自己的德性。然后再去学习知识，探索文化来修正和指正我们的行为方式。</span></p><p><span>很多人说：“我也爱学习，可是不知道学什么。”</span></p><p><span>《中庸》讲了这么多道的规律，讲了这么多至诚，讲了这么多至德。所以就告诉我们德性是什么，告诉我们诚是什么，告诉我们道是什么，都是在告诉我们圣人之道和天地的法则。告诉我们躬行君子要尊德性而道学问，这个时候我们再去学什么就有了方向，我们再做事情也自然有了方向。</span></p><p><span><strong>致广大而尽精微，</strong>我们要广博地去学习，广大的去学习，同时要尽精微，还要学到精细处，还要学的精通，还要学的精深。</span></p><p><span><strong>极高明而道中庸。</strong>让自己达到一个极高明的境界，依乎中庸之道而行之。当我们达到高明的时候，才能用中庸。就像开篇就讲：<strong>“喜怒哀乐之未发，谓之中；发而皆中节，谓之和。致中和，天地位焉，万物育焉。”</strong></span></p><p><span>只有达到了道的本体，中的状态，喜怒哀乐之未发，这个时候我们到了中，才可以用和，才能以和为贵，以和为目的，才可能发而皆中节，这个过程就叫庸。</span></p><p><span>所以，我们自己要有一个高明的状态，才能依乎中庸去做事情。整个这里告诉我们方向，又告诉我们回归当下，脚踏实地去做事情。遵自己的德性，依这个德性而道问学，再去学习再去修行。</span></p><p><span>告诉我们要去致广大，一定要广泛地广大地去学习，并且还要精通，还要精深。让我们自己达到极高明的境界，同时又要依乎中庸之道。可上可下，上是我们的止，是我们学习和修正的方向，那个是道的可大的地方。</span></p><p><span>同样道造端乎夫妇，还要回到小的地方。做任何事情都可以依中道而行，都可以做到精微处，做到精细处。</span></p><p><span>包括我们即使是做学问，这里叫道问学。同样，我们还要遵守自己原本的德行，同时再来往下，不断地去学习一些基础的知识，这个时候我们才能用。</span></p><p><span>上是合道的，我们下面即使用到生活当中，用到工作当中，他依然是合道的，所以说道可大可小。</span></p><p><span><strong>温故而知新，敦厚以崇礼。</strong>所以说我们要温故而知新，学习故有的文化，学习故有的思想，但是要知新这个才是合道的。</span></p><p><span>如果我们只学了故的东西，过去的思想和文化，但是不能结合我们的当下去延伸出来新的东西，就是这里说的，致广大而尽精微，就不能学到精微处，不能学到精细处。</span></p><p><span>敦厚以崇礼，要心存仁厚，崇尚礼仪。所以我们做任何事情都是一样的，用这两句来结尾这一段话。我们无论去做任何事情，学习、工作、生活、做生意都一样，心存仁厚，崇尚礼仪，崇尚礼节，不停地去学习圣贤的文化，学习过去的思想过去的文化。但是要知新，创造新的东西，新的思路，适合当下用的思想，这样才能温故而知新，我们才能学以致用。</span></p><p><span>做学问也好，我们学习也好，包括我们修行也好，我们做事情也好，要不要先致广大？就是要有一个大的方向，大的止。</span></p><p><span>比如说一个做事情带团队做企业的，如果没有目标，没有止，能行吗？那个就是广大。精微是什么？只有目标，只有止行不行？还要把当下的每一件小事情做好。</span></p><p><span>那做学问不是一样吗？如果只学习当下需要的知识，可以无限的延伸和拉高我们的境界和格局吗？不会吧。为什么我们学习要先了解道在讲什么，就好比我们做事情，我们要有目标，要有方向，还要回来把当下的事情做好。</span></p><p><span>就好比我们经常给大家举例子，如果我们只学《中庸》，可以讲《中庸》吗？讲不了。如果我们只学《大学》，可以讲《大学》吗？讲不了。一定是先致广大，然后再回来尽精微。</span></p><p><span>比如，我们学习了《中庸》，学习了《论语》，学习了《大学》，学习了《道德经》，学了《了凡四训》，如果跟生活讲，这个都是致广大。</span></p><p><span>但是，尽精微是什么？还要回归到生活和工作的当下。要把中庸之道拿到生活当中用，这个叫尽精微。</span></p><p><span>好比，每天都告诉我们不停地去学习，但是我们去学习书本上的知识以后，要懂得往自己的当下去用。如果只学不用，每天把这个书，翻烂都没有价值。天天听我在讲，可是生活当中，行为上不修正，没有意义的。就是只致广大了，但是没有尽精微，所以这就是闻思修的关系，非常重要。</span></p><p><span>这一段在告诉我们，君子如何去通往圣人，如何让自己去修圣人之道。整个这段话都一个大一个小。首先告诉我们尊德性，要尊重的是自己内在的至高无上的德性。和圣人和天地是一样的，遵照德性再去道问学。尊德性，不代表我们有德性了，而道问学还要从头开始学，但是我们有方向。</span></p><p><span>接下来，致广大而尽精微。广大了，但是精微处没做到，所以怎么办呢？从精微处点点滴滴往上积累，往上修，才能最终到达广大。接下来也是一样的，极高明要知道最高明的境界是什么，然后要回来再依乎中庸之道往上修，能体会吗？</span></p><p><span>这好比是什么？举个例子，我们现在开车去北京，导航定到北京，这是我们的目的地。但是不代表现在就到了，只是地图导航目的地到了，还有五百多公里，注意还有五百多公里，这个时候要干吗？用《中庸》的话就是导航定在北京，从济南开始出发，能理解吗？</span></p><p><span>如果没有导航，我们不知道该去哪里，所以为什么很多人浑浑噩噩的度日，没有方向，没有目标，没有止。我们把导航定在北京，从济南开始出发，这个时候，如果定完导航就不去了，就觉得我们到了，到不了的。</span></p><p><span>这个生活当中的道理，大家很容易理解。很多人做事情是不是这样，很多人学习是不是这样的，很多人修行是不是这样的？学了很多理论，就觉得自己已经很厉害了，但是还没有走，还没有往前行，只是听说了是那个样子的。</span></p><p><span>所以说我们每个人要在生活，要在工作的点点滴滴去修行。如果没去修行，就是只有致广大。那个广大也是听我们讲的，也是听圣贤讲的，但是没有尽精微，没有从细节处开始修。所以这段话非常之关键，这是我们修行的次第，又要致广大又要尽精微，这个也是很多人的困惑。</span></p><p><span>我们再来延伸一下这段话，如果没有尊德性，这个时候道问学，开始学习学问，是不是容易偏呀？因为自己不知道该学什么，就学偏了。如果没有致广大而尽精微，只是从生活当中的点点滴滴处去做，但是没有方向，不知道该往哪个方向去做，只有尽精微，就不可能变得广大和广博。</span></p><p><span><strong>极高明而道中庸，</strong>也同样的道理。如果我们不是达到一个很高明的境界，也用不了中庸之道。所以依乎中庸之道去做事情的时候，一定是这个人已经极其高明了，接下来温故而知新。</span></p><p><span>很多人是什么呢？我们也不学故有的知识，也不学古人留下来的文化，这个时候是不是《论语》所讲的，质胜文则野？没有内在的修养，不知道该去学什么样的东西，该去学什么样的文化。</span></p><p><span>同时《论语》还有一句话，子曰：<strong>“不见迹，亦不入于室。”</strong>不踏寻着圣人的痕迹，也不能升堂入室，就是学不到家。所以温故，首先要学习圣贤的文化，这个时候就又出现了一大批人只温故，把知识学死了，开始学的是文字相。</span></p><p><span>不能温故而知新，不能结合出来当下所能用的东西，无法融入到生活和工作当中去，这个都是不行的。只致广大了，但是没有尽精微；只尊德性了，但是没有道问学，没有去做学问，没有踏踏实实地去行。</span></p><p><span>接下来告诉我们，敦厚以崇礼，心存仁厚，崇尚礼仪，崇尚礼节。有的人是心存仁厚的，可是他不讲礼仪，是不是就没有外用的成分？有的人只有外用，我是崇尚礼节的崇尚礼仪的，但是我们的心不是存仁厚的，是不是也不行？</span></p><p><span>整个这段其实往下在给我们讲，道的两端，上可大，下可小，内要修成敦厚的样子，外要崇尚礼节，要表现出来。所以，都是一大一小，一上一下，一内一外，在给我们讲圣人之道，告诉我们君子要依乎圣人之道去做事情，这是我们每个人学习和修正的方向。</span></p></div>"
},{
    "title": "《中庸》第二十八讲 居上不骄",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十八讲 居上不骄</strong></span></p><p><span><strong>是故，居上不骄，为下不倍。国有道。其言足以兴；国无道，其默足以容。《诗》曰：“既明且哲，以保其身”，其此之谓与。</strong></span></p><p><span><strong>是故，居上不骄，为下不倍。</strong>居上位的时候不骄傲，处下位的时候不违背礼仪。我们先讲一下上位，比如，以前的天子君主，做大夫的这都是属于上位。包括我们延伸到现在，也是一样的，我们做父亲的时候是上位，做一个公司领导的时候，我们做长辈的时候，这都叫上位。</span></p><p><span>当我们处在上位的时候，不骄傲。处在下位的时候也不会去违背礼仪，不会去违背礼节。</span></p><p><span>我们再来讲一个上和下，当我们在顺境的时候是不是上？当我们在逆境的时候是不是下？我们处在顺境的时候，我们也不要骄傲自满；我们处在逆境的时候，我们也不要违背礼仪，不要违背道德，不要违背学问。</span></p><p><span>往往我们在逆境的时候，反而更容易违背了道德观念。其实一个人在顺境的时候，我们很多人都会讲，我们要去利益他人，要去明德亲民，要去行善积德。所以处上位的时候，富而不骄容易，贫而不怨难，这是《论语》的话。我们处在贫穷的时候，处在逆境的时候，还不去抱怨，还不去怨恨这个是比较难的。所以我们要尤其的注意，尤其要时刻的修正自己。</span></p><p><span>当自己处在逆境的时候，千万不要违背自己的道德，千万不要违背天道循环的规律，千万不要违背礼仪。当我们越是这样不违背的时候，我们的命运才能接下来发生转变，才会发生变化。</span></p><p><span>试想一下，我们处在逆境的时候，我们越是抱怨，越会增加我们的负能量，我们的处境就会更加的堪忧。我们越处在逆境的时候，身边的亲人也好，朋友也好，我们的合作伙伴也好，这个时候都是不爱和我们交往的。如果我们再去抱怨，我们再去满身的负能量，别人就更想远离我们了。</span></p><p><span>如果我们处在逆境的时候，还能积极乐观，还能向上，不违背道德，别人就会来赞叹我们，认为这个虽然暂时处在下位，但是这个人是积极向上的。</span></p><p><span>自助者天助，我们自己是乐观的是积极的，是向上的，天都会来助我们，因为符合天道循环的规律。</span></p><p><span>所以，尤其是要注意贫而不怨难。越是难，我们处逆境的朋友们一定要努力地积极地向上，让自己依乎道去行事，去依乎自己的道德，依乎德行，这个时候我们才能变得越来越好。</span></p><p><span><strong>国有道，其言足以兴；</strong>当国家有的道，政治清明的时候，其言足以振兴一个国家，整个这段都是讲的君子之风。</span></p><p><span>上一节课告诉我们，君子要尊德性而道学问，再上一句告诉我们，君子居上不骄，为下不倍。现在依然告诉我们，君子之风在国有道的时候，其言足以兴。君子的言论和行为是足以振兴国家的。</span></p><p><span><strong>国无道，其默足以容。</strong>当国家无道的时候是保持沉默足以容身的，这个就是君子之风。能屈能伸，处上位的时候不骄傲，不自满；处在下位的时候不抱怨，不怨恨。</span></p><p><span>国家有道的时候，用自己的道德学问去振兴国家；国家无道的时候，懂得保持沉默，保全自身。其默足以容，保全自身的同时还可以做很多利益他人的事情。所以，君子是懂得明哲保身的，接下来又开始讲了。</span></p><p><span><strong>《诗》曰：既明且哲，以保其身。</strong>这里的哲是智慧的意思，既明达又有智慧，以保其身，可以保全自己的身体的，保全自己的性命。</span></p><p><span>儒家文化讲，邦有道，则仕；邦无道，则隐。在国家有道的时候，我们出来做事情；在国家无道的时候，我们要懂得隐退。隐退不是为了贪生怕死，而是我们要做更多利益他人的事情。既然是仕途走不通，可以做文化，可以做传承。</span></p><p><span>如果没有儒家的圣贤之士，一代一代的做传承，如果每个人经历了不顺，不能为国家做事情的时候，就开始变得颓废，那文化又如何传承？所以叫忍辱负重。</span></p><p><span>当我们至德性，内心怀有仁爱，外在是有德行的时候，无论处在任何时代，任何背景下，都可以做利益他人的事情。无非以什么样的形式，以什么样的方法，以什么样的身份去做事情。</span></p><p><span><strong>其此之谓与。</strong>这句话说的就是这个意思吧。在说《诗经》，既明且哲，以保其身，这句话说的就是这个意思。在用《诗经》来做总结，说的君子之风。</span></p><p><span>整个这一段，包括上一节课，讲的就是修身立命。一个君子一直都是懂得修身的。一个君子要如何立命，要如何滋养自己的德性？</span></p><p><span>《论语》讲：<strong>“志于道，据于德，依于仁，游于艺。”</strong>我们的志向是要向道的，据于德，要根据自己的德行，以德为根据；依于仁，要依靠仁，依靠内心的仁心，仁爱，仁慈去做事情；游于艺，很享受在艺的状态，要游于艺去做事情。</span></p><p><span>整个这段告诉我们修身立命的方法。当我们自己的志向是向着道的，是根据自己的德行的，是依乎于自己内心的仁爱之心，这个时候我们才能游于艺。</span></p><p><span>游于艺什么意思？无论我们处在上位，处在下位，处在什么样的时代，处在什么样的背景，我们都会依乎这个时代的发展，找到自己的安身立命之法，找到自己的利益他人，育化万物的方式。</span></p><p><span>所以，为什么说乱世出英雄？春秋时代出圣人，国家纷乱，越是这种纷乱的时代，越有圣人横空出世。</span></p><p><span>到了我们这个时代也是一样的，我们这个时候到了国富民强的时代，到了人民安居乐业的时代，我们就要依乎现在的时代的发展，去找我们自己的安身立命之法。</span></p><p><span>我们修自己的身是不变的，滋养自己的德性是不变的。在这个基础之上，我们去看看这个时代的人缺少什么，这个时代的人，有哪些是需要我们帮助的，这就是我们的立命之法。</span></p><p><span>只有我们志向是向道的，是根据自己的仁德为基础的，我们才能游于艺，我们才能很自在很从容的，去选择我们所做的事情。</span></p><p><span>所以告诉我们如何修身，如何立命，君子之风是如何做事情的，圣人的道和方法是什么样的，这是我们学习的方向和榜样。</span></p><p><span>我们现在国有道，其言足以兴；国无道，其默足以容，再来延伸，因为这本书是有时代背景的，是讲齐家，治国，平天下的。到了我们这个时代，不需要我们去做这些事情，所以我们要活学活用，温故而知新，要往生活当中来延伸。</span></p><p><span>看看我们做企业，做团队是不是同样的道理？当这个团队有道的时候，企业有道的时候，我们用自己的道德学问，是可以帮助振兴企业，振兴这家公司的。可是企业无道的时候，要懂得保持沉默，要懂得在其中如何安身立命。要不然用自己的德行和学问去力挽狂澜，要不然这个时代我们更自由，可以选一家有道的企业，有道的公司去做事情就好了。</span></p><p><span>如果在这个企业当中，我们是处上位的，要懂得去看这个企业有没有道的。如果我们的企业是有道的，才能吸引更多的有道德和学问的人，有才能的人来到我们的团队当中。</span></p><p><span>如果我们是无道的，很多有道德的有学问的人，都在保持沉默，这个时候我们要懂得《论语》教给我们的道理，举直错诸枉，能使枉者直，我们要去重新举一些贤才，举一些正直的人，这个时候其他的人，才会懂得效仿。</span></p><p><span>在我们任何一个团队当中，都是一样的，处上位的人一定是冷静思考的，去看整个团队当中所发生的事情。我们自己首先一定是向道的，否则我们的行为也不可能向道，也看不出来企业哪一些行为是不合道的。</span></p><p><span>当我们自己是向道的，看到哪些事情是偏的，看到有一些正直的人，做得好的人符合道的人，这个就叫直。举直错诸枉，我们举直的时候，别人自然会效仿所举出来的榜样和标杆，他们就会依照这个去做事情，依照这个人的行为去修正自己，故而叫能使枉者直，使弯的开始变直。</span></p><p><span>所以说，无论我们是处在上位的，还是处在下位的，他教给我们的道理，都是相同的，只不过我们要懂得温故而知新，这个就是致广大，而尽精微。</span></p><p><span>我们要去广大地去学习道的规律在讲什么，我们还要活学活用，用到我们的细节，用到我们的精微处。这个时候，道才能在我们这个团队当中发生作用。</span></p></div>"
},{
    "title": "《中庸》第二十九讲 今从周礼",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第二十九讲 今从周礼</strong></span></p><p><span><strong>子曰：“愚而好自用；贱而好自专；生乎今之世，反古之道；如此者，灾及其身者也。”</strong></span></p><p><span><strong>非天子不仪礼，不制度，不考文。今天下，车同轨，书同文，行同伦。虽有其位，苟无其德，不敢作礼曰焉；虽有其德，苟无其位，亦不敢作礼乐焉。</strong></span></p><p><span><strong>子曰：“吾说夏礼，杞不足徵也；吾学殷礼，有宋存焉；吾学周礼，今用之，吾从周。”</strong></span></p><p><span><strong>子曰：愚而好自用；贱而好自专；生乎今之世，反古之道；如此者，灾及其身者也。</strong>愚，愚昧；注意，愚昧还不是最可怕的，更可怕是愚昧而自以为是，就是既愚昧还自以为是。看我们生活当中是不是有很多这样的人，自己是愚昧的、愚笨的、无知的，别人的话还听不进去，圣贤的道理还觉得没用，并且非常的自以为是。</span></p><p><span><strong>贱而好自专，</strong>贱就是卑贱的意思。处在下位的时候，位置低的时候还好自专、自作主张，处在下位的时候还喜欢自作主张。</span></p><p><span><strong>生乎今之世，反古之道，</strong>反是返回的返，返回，恢复的意思。我们生在今天这个世道，还要想返回古时候，这句话非常有意思。</span></p><p><span>我们这个时代是不是样的？有很多人都说，能回到父母还有爷爷那个时代该多好，那个时候的人是干净的，是善良的，是纯洁的。我们还要能回到一夫多妻制该多好，这都是反古之道。</span></p><p><span>无论过去的是好的还是坏的，有没有可能回到过去？没有可能。时代在发展，天道是惟新的，不停地推动着时代，在往前发展，我们是回不到过去的。所以反古之道的人，这种思想就会不停地去抱怨。</span></p><p><span>还有很多人做生意，说如果回到实体店的那个时候该多好，怎么可能呢？很多人接受不了新鲜事物，就开始抱怨，抱怨想回到过去的那个时代，那是不可能的。所以只要产生反古之道人的想法，多数都是抱怨的，多数都是停滞不前的。思想不革新，不往前走就会被时代所淘汰。</span></p><p><span>我们要赞同过去的好的东西，但是绝不是再回到那个时代，再回到从前。而是我们遗留的那些好的东西，我们学过来，用到我们的当下，用到我们的现代，这个才叫温故而知新。都可以用在我们当下，时代在进步，是不可能回去的。</span></p><p><span>比如还有一个词叫，反清复明，在清朝是最常见的词，那么多人是在反清复明，能反的成功吗？反不成功。即使真的，假设反成功了，他也不是明，也是其他的王朝，怎么可能反清还能复回明呢，那个是不可能的。</span></p><p><span>所以，我们一定要懂得这个道理，懂得这个道理以后，我们就不会自怨自怜。当发生一件事情，我们才能懂得往前行，而不是停在原地去感叹去抱怨，这个都是不对的。</span></p><p><span><strong>如此者，灾及其身者也，</strong>如上三者，如果是这样的，灾祸马上要降临到身上了。所以我们再来总结这一段话，愚昧而自以为是，位置低下，卑贱处下位，还自作主张。生活在我们现在这个时代，还想反古，灾祸就会来到我们自己的身边。</span></p><p><span>愚昧而自以为是，要如何成长？马上被时代淘汰，那灾祸不是来了吗？位置处低下还自作主张，很快就被别人淘汰掉了，不用我们了。我们处在这样的位置，不知道努力地去学习，不知道去修正自己，遇事还总是自作主张，惹人厌烦。</span></p><p><span>我们生活这个时代，天天抱怨时代的不好，还想回到过去那个时代，怎么可能呢？最后就落入了自怨自怜，这样的境界当中去，所以说灾祸就到了自己的身上。</span></p><p><span><strong>非天子不议礼，不制度，不考文。</strong>不是天子是不议论礼乐的，是不制定法度的，是不考定文字规范的。所以这段话也在告诉我们，处在什么样的位置就去做什么样的事情，没在那个位置的时候，就不要去思考抱怨和解决这样的事情，也解决不了。为什么呢？</span></p><p><span>举个例子，比如，现在很多朋友也抱怨，抱怨很多政策性的问题，他是因为高度不够。处在下位的人考虑的都是自身利益，有站在天子的角度考虑过吗？如果是站在天子的角度考虑，圣贤的天子，他考虑的是所有人的利益。而我们处在下位的时候只考虑的是自己的利益。</span></p><p><span>比如在一个企业当中，也是一样的，处在下位的时候，在议论公司的制度，说公司的决策不好，会发现我们考虑的无非是自己的利益，只想的是自己的利益。而处在上位的人是谋全局的。</span></p><p><span>为什么告诉我们处在下位的人，不要自作主张，考虑的问题并不全面。所以有句话叫，不谋全局者，不足以谋一域；不谋万事者，不足以谋一时。我们看的不是全局观，看的只是个人利益得失，或者说我们的高度并不够，看的只是自己的问题，而处在上位的人，看得是全面的问题。</span></p><p><span><strong>今天下，车同轨，书同文，行同伦。</strong>今天的天下，车(jū)就是车（chē），车同轨，车子的轮距都是一致的，书同文，文字文体都是统一的。大家都有相同的伦理和道德观念。</span></p><p><span><strong>虽有其位，苟无其德，不敢做礼乐焉。</strong>虽然我们处在那个位置上，苟无其德，如果没有那个德行，不敢做礼乐焉，也不敢去重新制定礼乐的。</span></p><p><span><strong>虽有其德，苟无其位，亦不敢做礼乐焉。</strong>虽然有那个德行，但是如果没在其位，没有那个位置，亦不敢做礼乐焉，也是不敢去做礼乐的。</span></p><p><span>这段话告诉我们，德和位要相匹配。即使伟大如孔子，德行如孔子，也没有重新制定礼乐，沿袭的也是周礼。</span></p><p><span>孔子为什么去推崇周公？周公既有德又有位，辅政有位又有至高的德行，所以才制定了周礼。即使有的人有位置，但是没有德行，讲的话是不是就没人愿意听？</span></p><p><span>比如在一个企业当中，我们是处在高位了，可是没有德行，大家都不认可，都不认同，我们制定了一个规则，制定了一个制度，有没有人爱遵守？不遵守。表面上听，实则我们说了也不听。</span></p><p><span>在一个企业当中，一个人有德行，但是我们没把他放在那个位置上，他制定了一个规则，别人会听吗？关他什么事情，用他操心吗，用得着他来管这个事情吗。</span></p><p><span>整个这段话告诉我们，无论做任何事情，德和位要相匹配的。我们反过来理解，当我们自己没有处在一定的位置上的时候，要谨言慎行。不断地提升自己内在的德行，让自己变得更有仁爱之心。讲话要注意了，行为要注意了，靠我们自己的德行，去影响身边的人就够了。当我们有了足够的德行，再有了那个位置之后，我们再讲出来的话，才有更多的人去信服。</span></p><p><span>《中庸》也是一样的，我们经常引用孔子的话，是不是在引经据典？这话不是我讲的，是孔夫子的讲的。我们每天去学习圣贤的文化，每天和各位朋友在分享修行的心得，是不是也要引经据典呢？</span></p><p><span>因为，我们还没有那么大的德行，还没有那么高的位置，就要引经据典。这话不是我讲的，是圣贤说的，我们也是和圣贤学的，这就是我们修行的过程。可是我们随着自己的德行，变得更大，是不是在别人心中的位置就会更高？这个时候我们再讲出来的话，是不是就有更多的人信服了？所以，这个时代是非常好用的。</span></p><p><span>包括我们做生意是不是一样的？有更多的德行，别人才愿意信服我们的话，我们在这些人心目中的地位才会变高。因为时代背景不同，那个时候的时代，我们是必须处在什么样的位置，别人才听我们的话。</span></p><p><span>可是，这个时代不一样了，我们更多的人都是做生意的，都是自由职业者，所以这里的位置，我们延伸一下，我们在别人心目中的位置，取决于自己的德行有多大，有多大的德行，在别人心目中的位置就多高，所讲的话才会有多少人去认同。</span></p><p><span>这是我们这个时代，要懂得反过来思考，应用到我们当下的，温故而知新，我们才能去用，才能懂得如何去修正自己。</span></p><p><span><strong>子曰：吾说夏礼，杞不足徵也，吾学殷礼，有宋存焉；吾学周礼，今用之，吾从周。</strong>孔子说，我说夏朝的礼，杞是夏朝的后裔，一个杞国，只剩下杞国很小的一个部分，不足以彰显夏朝的礼。说我去学殷朝的礼，有宋国存焉，宋国是殷朝的后裔小国。</span></p><p><span>接下来重点来了，吾学周礼，说我又学周礼，周朝的礼乐，今用之，今天还在用；吾从周，说我是从周的。这里孔子开始举例说明，说我又学了夏朝的礼，又学了殷朝的礼，又学了周朝的礼，但是我是从周的。为什么？这里有个关键的三个字今用之，因为今天我们还在用着周朝的礼，所以我是从周礼的。</span></p><p><span>为什么从周礼？回到上一段，告诉我们虽有其德，苟无其位，亦不敢做礼乐焉。不敢重新去制定，因为改变不了一个时代的发展。</span></p></div>"
},{
    "title": "《中庸》第三十讲 君子三重",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十讲 君子三重</strong></span></p><p><span><strong>王天下有三重焉，其寡过矣乎！上焉者，虽善无徵，无徵不信，不信民弗从。下焉者，虽善不尊，不尊不信，不信民弗从。故君子之道，本诸身，徵诸庶民，考诸三王而不缪，建诸天地而不悖，质诸鬼神而无疑，百世以俟圣人而不惑。</strong></span></p><p><span><strong>王天下有三重焉，其寡过矣乎！</strong>王是动词，如果用在帝王的身上，用在君上的身上就是统治天下称王，有三重焉，但是绝对不只是给王者讲的，我们再把他延伸，无论我们任何人。</span></p><p><span><strong>王天下有三重焉，</strong>想要去帮助天下人民，兴旺天下事情，有三件非常重要的。这里先埋一个伏笔，到底是哪三重，我们先不讲。其寡过矣乎，如此能做到这三项，我们就会很少有过错。</span></p><p><span><strong>上焉者，虽善无征，无征则不信，不信民弗从。</strong>上焉者，处在上位的人。虽善无征，虽然可能是善良的，但是无征，别人没看到我们所做的事情，没有看到我们的善迹，没有看到我们的善行，没有把它表现出来，没有把它呈现出来。这里的表现出来，不是刻意做给任何人看，而是别人是否真的受到了我们的利益，受到了我们的恩惠。</span></p><p><span>无征不信，如果我们没有呈现出来那个善行、那个善迹，别人就不会相信。不相信民弗从，不信百姓就不会服从，不会顺从，也更加不会跟随我们做事情。</span></p><p><span>我们再把这句话延伸，虽善无征，不只是善，说一个人有智慧、一个人善良、一个人有德行、一个人有才能、一个人有学识，这统称为善。都是有优秀的才能，好的品质，这个都可以称为善。</span></p><p><span>但是，虽然有这些好的品质，但是无征，别人并没看到。为什么别人没有看到？并没有去做利益他人的事情，如果我们没有做利益他人的事情，别人就不信服，别人不信服就没有人跟从，没有人顺从。</span></p><p><span><strong>下焉者，虽善不尊，不尊不信，不信民弗从。</strong>如果我们处在下位的人虽然很善良，还是刚才的延伸，很有才能，很有学识，很有智慧，但是虽善不尊，没有尊贵的位置这个是不行的。</span></p><p><span>为什么呢？不尊不信，没有尊贵的位置，别人也是不相信的。不信民弗从，别人不信就不会有人顺从、不会有人跟从，不会有人和我们一起来做事情。</span></p><p><span>再来反过来讲，这段话在讲什么？首先第一点告诉我们，其寡过矣乎！先讲寡过，就是懂得修己，才能少过错，懂得修己身，修自己的行为，修自己的德行才能寡过。</span></p><p><span>我们先要修自己的德行，这是三重里的第一重就是修己身，修寡过。第二重开始是什么？处上位的人，要做有利于他人的事情才能去征显。处下位的人要不断地修正自己的德行，让自己处在上位，才可能利益更多的人。</span></p><p><span>我们现在为什么说通用？可以延伸到我们生活的方方面面，可以适用于每一个人身上。我们处在这个时代更是如此，首先要懂得修己身，让自己寡过，少犯过错。如此我们在别人心中才能有位置，我们在心中能有位置，别人才能信服我们，才会顺从和跟从我们一起去做事情，或者说跟从我们，一起去学习，跟从我们一起去修行。</span></p><p><span>我们做企业是不是同样的道理？首先要修己身，自己少犯错误，本身是有德行的，处在那个位置上，虽然有德行，虽然有才能和学识，但是还要把他彰显出来，还要去做很多帮助别人的事情，别人受到了我们的恩惠，受到我们德行的感召和影响，他才会更加的信服。</span></p><p><span>在一个企业当中，如果我们是处下位的也同样，要修己身，让自己少犯过错，处上位的人才能看到我们的德行，才能看到我们的善行。这个时候才能提拔我们的位置，我们在身边的人，也会有更加的影响力，我们在他们的心中才有位置，才可能去做更多的事情。</span></p><p><span>所以告诉我们，王天下有三重。第一就是修身，寡过，让自己少犯过错。第二就是如何获乎上，第三就是如何处好下位。</span></p><p><span>我们如何获乎上？什么叫上什么叫下呢？无论我们每个人都是有上、有下，老百姓经常讲：“上有老，下有小。”在企业当中上有领导，下有员工。即使是做天子的，还有上天，还有天地，下面还有子民。所以无论我们任何人，都是有上和有下。</span></p><p><span>这三重我们再延伸一下，什么意思呢？以自己为中，修己身，寡过矣，自己就是中。往上我们要对得起天，往下我们要对得起地，这就是天、地、人三才。</span></p><p><span>我们取中，但是自己要先懂得修身为本，所以这是最重要的事情，然后做好处上位的事情，再做好处下位的事情。接下来开始讲重点了。</span></p><p><span><strong>故君子之道，本诸身，征诸庶民。</strong>所以君子所行的大道，以修身为本。修自己的身，才能让自己寡过，修完自己的身以后，征诸庶民，在百姓当中有效验，在百姓当中可以彰显我们自己的德行。就是在帮助更多的人，我们才可能征诸庶民。</span></p><p><span>征诸庶民以后，这个时候我们要往上讲。</span></p><p><span><strong>考诸三王而不缪。</strong>前后上下，前后和上下一个意思。我们从时间的概念，开始往前推，考诸三王而不缪，以前在春秋那个时代，指的三王就是指的夏商周，夏禹就是我们讲大禹治水的禹，商汤，周文王。往前、往上，考诸三王而不缪，就是我们自己的行为，去考诸三王而没有错误。</span></p><p><span>到了我们这个时代，可以考诸的就更多了，我们有那么多的圣贤，出了那么多伟大的君王，出来那么多先天下之忧而忧，后天下之乐而乐的圣贤，都可以作为我们的考究。我们去考察这些圣贤的行为，去探究这些圣贤所讲的道，再来修正自己的身心，指正自己的行为，看看自己是不是依然没有错误的。</span></p><p><span><strong>建诸天地而不悖，</strong>建诸天地，就是我们立于天地之间，而不违背天地之道。</span></p><p><span><strong>质诸鬼神而无疑，</strong>质就是询问、到达的意思。我们自己的行为，即使去询问鬼神，到达鬼神那里，鬼神都不疑。</span></p><p><span>我们之前讲，<strong>举头三尺有神明。</strong>《中庸》前面也会讲，<strong>洋洋乎，如在其上，如在其左右，</strong>鬼神是充满天地之间，来体察和监督万物的。我们一个人的行为，有可能其他人看不见，但是举头三尺有神明的。所以，我们要光明到什么程度呢？即使是到达鬼神那里，也丝毫不会疑惑的。</span></p><p><span><strong>百世以俟圣人而不惑，</strong>即使是百世以后，有圣人出现的时候，去探究我们自己的行为，而不产生疑惑，这里的重点很有意思。百世以俟圣人，不是说所有的人都不惑，是圣人看到我们的行为，而不产生疑惑，因为我们所做的事情，不是所有的人都会理解的。</span></p><p><span>比如，我们现在所学习儒家文化，孔子的思想到现在，也会有人不理解，也会有人困惑。道家的老子、庄子，同样到现在也是有人不理解，也是有人不信，所以老子才会讲，下士闻道大笑之，不笑不足以为道。孔子在《论语》当中也会讲，中人以上可以语上也，中人以下不可以语上也。</span></p><p><span>这里的重点告诉我们，圣人百世以后出现，对我们的行为也不产生困惑，这个时候，我们才能真正的立于天地之间，这个才是圣人之道。</span></p><p><span>这里有三重，刚才讲寡过是不是就是圣贤了？不是。寡过是自己不犯错误，接下来又讲，上焉者，虽善无徵。寡过是不是就是善的？起码不做坏事，但是虽善无徵，没有去做利益他人的事情。无徵不信，我们没有做利益他人的事情，别人如何对我们信服，不信民弗从，没有人信服的时候，有什么样的民众百姓，会顺从我们呢，不会的。</span></p><p><span>我们做学问一样，修行一样，做企业一样。如果我们没有利益他人，他人怎么会顺从我们，他人如何跟从呢？我们利益过多少人，就会有多少人愿意信服我们，愿意顺从，愿意跟随，看看是不是这样的？</span></p><p><span>在一个家庭当中也是如此，我们帮助过家里的什么样的亲人，这些亲人就是信服我们的。我们说自己的日子过得很好，可是从来不曾帮过亲朋好友，我们让他们如何信服？所以，我们能说是圣人吗？最多是不做恶事，就是这里讲的虽善无征。</span></p><p><span>虽然没做坏事，也没做过什么利益他人的事情，儒释道的文化都在告诉我们做事情，不是大家所理解的，我们修行以后，什么都不干了，是不是我们什么都不做了？就是这里讲的虽善无征。</span></p><p><span>道家告诉我们，<strong>无为而治，无为而无所不为。</strong>无为而治，最后还要落到治上，还在做事情，所以都在告诉我们，修行以后要做事情的。</span></p><p><span>我们每天讲儒家的文化都在说，不是修行完以后什么都不干了，而是应该做得更多，去做更多利益他人的事情，这个才是圣人。我们看看哪个圣贤是不做事情，就被后世所赞叹的。</span></p><p><span>孔子说有狷者，狂狷之人。狂是志向远大的，知进不知退的人，狷者是太过于洁身自好，不愿意去做事情的人。</span></p><p><span>所以，圣贤的文化是告诉我们，先寡过，先修己。当我们的己身修的更端正，有德行的时候就不能虽善无征了，还要去做利益他人的事情，这个才是符合圣贤之道的。</span></p></div>"
},{
    "title": "《中庸》第三十一讲 大德敦化",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十一讲 大德敦化</strong></span></p><p><span><strong>质诸鬼神而无疑，知天也；百世以俟圣人而不惑，知人也。是故，君子动而世为天下道，行而世为天下法，言而世为天下则；远之则有望，近之则不厌。《诗》曰：“在彼无恶，在此无射；庶几夙夜，以永终誉。”君子未有不如此，而蚤有誉于天下者也。</strong></span></p><p><span><strong>仲尼祖述尧舜，宪章文武；上律天时，下袭水土。譬如天地之无不持载，无不覆帱；辟如四时之错行，如日月之代明。万物并育而不相害，道并行而不相悖。小德川流，大德敦化。此天地之所以为大也。</strong></span></p><p><span><strong>质诸鬼神而无疑，知天也；</strong>询问到达鬼神那里而不疑惑，而不怀疑，这个叫知天也。什么意思？知晓天理，知晓天道。</span></p><p><span>比如我们之前学《太上感应篇》、《了凡四训》，《太上感应篇》在讲知因果，明善恶。《了凡四训》也告诉我们如何去做善事，告诉我们什么事情该做，什么事情不该做，让我们知善恶，明因果，这个都叫知天也。</span></p><p><span>什么情况下鬼神才不质疑我们？是我们合乎于天理，合乎于因果的，自然鬼神就不质疑，所以叫：“举头三尺有神明。”如果我们做的事情是不合乎于天理的，自然要遭到鬼神的质疑，我们质鬼神而无疑，说明我们做的事情是知天理，合天道的。</span></p><p><span>当我们学习了圣贤文化，知天理，知天道循环的规律，做事情就不种恶因。我们如果不知天理，做事情自然就是种恶因的，种恶因就是损自己的福报，就会被鬼神所质疑。</span></p><p><span><strong>百世以俟圣人而不惑，知人也；</strong>我们如何做，才能在后世出现圣人的时候，对我们的行为不表示困惑，是因为我们知晓人道，讲的都是人该如何做事情。</span></p><p><span>整个这一段告诉我们，我们既要知天道，又要知人道；既要合天道，又要合人道。圣人对我们的行为才不困惑。</span></p><p><span>这些圣贤都在告诉我们天道循环的规律，《中庸》也告诉我们中庸之道是什么？告诉我们仁是什么，德是什么？《大学》告诉我们，明明德，亲民，止于至善，这些都是在知人道，告诉我们作为一个人，该去做什么样的事情。</span></p><p><span>《中庸》又告诉我们，道存在于天地之间，道不远人。又告诉我们执柯以伐柯，又告诉我们，道，大可察乎于天地，小可造端乎夫妇。这都是在告诉我们人道，我们作为一个人该做什么事情。</span></p><p><span>也就是说我们自己这一生的行为，所做的事情，从天道的角度来讲，鬼神是不疑的；从人道的角度来讲，即使有圣贤再出世的时候，看到我们这一生的行为，他也是合人道的，所以既合天道又合人道。</span></p><p><span><strong>是故，君子动而世为天下道。</strong>动，比如，我们的行为这叫动，我们的心念也叫动，我们的思维也是在动，所以君子动而世为天下事，君子但凡有所动，可以成为世世代代的楷模、法则和榜样。</span></p><p><span>这里的动而是为天下道，世就是世世代代的意思，道是标准，法则。所以我们再来理解这句话，就好理解了。我们作为一个君子，所要行的道又合天道，鬼神不疑；又合人道，有圣贤出世，对我们的事情、对我们的行为不会表示困惑。我们但凡有所动，都可以成为世世代代的楷模、榜样和遵循之道。</span></p><p><span>行而世为天下法，言而世为天下则。当我们所产生的行为，都会成为世世代代的模范。我们所讲出来的话，都可以成为世世代代的法则，学习圣贤的文化的标准。</span></p><p><span>比如，现在的我们是不是经常引经据典，子曰：<strong>“学而时习之，不亦说乎。”</strong>子曰：<strong>“君子和而不同，小人同而不和。”</strong>这都是在引用圣贤的话，这些圣贤的言行所动，都在成为我们后世的法则，我们后世所学习的榜样。</span></p><p><span><strong>远之则有望，近之则不厌。</strong>我们从时间和空间两个角度来讲。我们先讲空间，离我们远的人，对我们的行为是仰望的，是仰慕的。近之则不厌，在我们身边的人是不讨厌、不厌烦我们的，这是从空间上来讲。</span></p><p><span>用《论语》的话叫<strong>近者说，远者来，</strong>接触过我们的人，在我们身边的人都会觉得喜悦，远者自然就是仰望的，就是仰慕的，愿意来到我们的身边。</span></p><p><span>我们再从时间的概念上来讲，远之则有望，孔子到我们现在两千五百多年，是不是我们依然是仰慕的？依然是仰望的。比如，我们经常提到的王阳明先生，明朝人，我们所学过的《了凡四训》，袁了凡先生也是明朝人，我们是不是也是仰慕的、也是仰望的？</span></p><p><span>近之则不厌，我们生活在现在这个时代，这个时间段，很多人也不会厌烦我们，不会讨厌我们。我们再去讲回古之圣贤，在孔子那个时代，在王阳明先生那个时代，在袁了凡先生那个时代，他们身边的弟子，身边的亲朋好友，也是不厌烦他们所做的事，和他们的行为，这个也可以成为，我们的行为标准。要让守在身边的人，附近的人不厌烦我们。远者见不到我们的人，又是仰慕我们的，我们是有名望的。</span></p><p><span>这一段都在告诉我们，君子的行身法则，如此去修正自己的行为，依乎于君子之道，我们自己才能寡过。上对得起天，下对得起地，前对得起圣贤，后可以等待圣人，来验证我们的行为，而不受任何的质疑和困惑，这个是君子立于天地之间的本，也是我们学习的圣贤之道。</span></p><p><span>同样的道理，接下来开始又要引经据典了。</span></p><p><span><strong>《诗》曰：在彼无恶，在此无射，庶几夙夜，以永终誉。</strong>《诗经》其中的几句话，我们先讲一下这几句话的背景，这个是周朝的天子，在接待各个诸侯国的国君，所演奏的乐曲，其中的几句话，里面大有深意。</span></p><p><span>在彼无恶，他们在自己的国家，在自己的诸侯国，没有人厌恶。在此无射，这里的射也是厌恶，厌恨之意，在这里也没有人厌恨他们。因为到这里的都是各个诸侯国的国君，都在这里。</span></p><p><span>如何能让这里的诸侯国的国君，都不厌恶呢？是不是远之则有望呀？别人虽然离他很远，对他也是仰慕的，他也是有好的名望在外的。所以无论是在自己的国家没有人厌恶，还是到这里都没有人厌恶。</span></p><p><span>庶几夙夜，庶就是差不多；几就是几乎；夙夜就是早晚的意思。差不多几乎早晚都要忙于政事，早晚要勤于政事，因为大家都是诸侯国的国君，都是要为民操劳的，为民请命，勤于政事的。</span></p><p><span>以永终誉，如此才能永远长久的保持我们的声誉。</span></p><p><span>延伸到我们现在，是不是也同样的道理，我们身边的人不讨厌我们，离着我们远的人，听到了我们的声望，是仰慕我们的，我们都要忙于自己所做的事情，才可能永久的保持声誉。</span></p><p><span>如果我们没有去做事情，有没有可能保持自己的声誉？没有。我们没做过利益他人的事情，别人怎么可能会仰慕我们？我们没有帮过身边的人，身边的人怎么会不厌烦？所以自古至今，道理都是相同的。</span></p><p><span>无论上至天子，到诸侯国的国君，下到庶民，都是同样的道理。都要不停地去做帮助他人的事情，这个才是君子之风，才是君子所行之道。</span></p><p><span>君子未有不如此，而蚤有誉于天下者也。君子没有不这样做，可以早早的有声誉传播于天下者。我们反过来讲，一个君子只有如此的去做事情，利益身边的人，让身边的人、近处的人不厌烦，远处的人对我们是仰慕的，只有这样去做，才可能让我们的声誉、美名传播于天下，才可能使别人信服，才会有别人愿意跟随我们去做事情。</span></p><p><span>所以我们总结，天下有三重焉，要先修己身，寡过。接下来，上要对得起天，下要对得起地；上要对得起处在我们上位的人，下要对得起处在我们下位的人；前要符合圣人之道，后圣人出现可以验证我们的行为。这样我们才能立于天地之间，不违背天地之道。</span></p><p><span><strong>仲尼祖述尧舜，宪章文武；</strong>仲尼是孔子的号，号仲尼。因为子思是孔子的孙子，所以尊称祖上不能直呼其名。仲尼祖述尧舜，说孔子继承尧舜之道。</span></p><p><span>宪章文武，宪就是取法，效法的意思。章是彰显，取法，效法彰显周文王和周武王的德行，所以叫祖述尧舜，宪章文武。</span></p><p><span><strong>上律天时，下袭水土。</strong>上要合天道的规律，下要沿袭符合水土，就是上合天，下合地。譬如天地之无不持载，无不覆帱；就好比是天地一样，所有的事情都去承载，都去覆盖。</span></p><p><span>譬如四时之错行，如日月之代明。又好比是春夏秋冬，四季更替。“日月之代明”日月是交替照明交替辉映的，来照亮这个世间上的万事万物。接下来开始给我们总结重点了。</span></p><p><span><strong>万物并育而不相害，道并行而不相悖；</strong>万物是共同生育的，但是不互相伤害，不会互相侵害。道并行而不悖，道是可以并行的，而不相违背。</span></p><p><span>这段话在告诉我们包容，告诉我们承载，告诉我们中和的力量。我们往大了讲，天地孕育万物，万物生长在其中并不相违背，也并不互相妨碍，也并不会互相伤害。</span></p><p><span>我们延伸到生活当中如何去用？我们学习诸子百家的思想，也是同样的道理，他是共存的，是共生的，并不相害。都是教人向善的，让人知因果、明善恶，去做利益他人的事情。</span></p><p><span>我们在一个家庭当中，也要懂得包容，要懂得承载，要懂得中和之道。举个例子，在家庭当中，发生了一件事情，夫妻两人的想法思维不相同，是可以并存的。为什么认为不可以并存？是没有包容，认为只有我们说的才是对的，对方说的就一定是错的，就会产生是非，吵架和争吵、争辩。</span></p><p><span>在一个企业当中，也是一样的，如果我们是包容的，是承载的，是懂得致中和的。每个人说的都有他的道理，他的角度，只不过我们觉得哪个方法，哪个角度，哪个思维，更适合我们的当下，但是不代表别人的都是错的。</span></p><p><span>到了我们这个时代，更是如此，这是一个多元化的时代，这是一个包容的时代。如果我们不懂得去包容，不懂得去承载，我们每天都会生活在这种争执、是非，对错当中，我们听到一个思想，只要是和我们不一样的，就开始争辩，我们听到一个思想，只要认为他和我们的理念不相同，就认为他是错的，这个时候我们自己就很痛苦。并且我们自己无法成长，这就是不懂得包容，不懂得致中和。</span></p><p><span>有很多朋友会问：“老师，您觉得某某老师讲的如何？能不能给点评论？”我说：“其实讲的都好，只要他讲的内容是告诉我们向善的，是告诉我们不要抱怨的，是告诉我们利益他人的，讲的都是对的。只不过从不同的角度去帮助不同的人，哪有什么好坏呢。”</span></p><p><span>他是可以并行的，我们讲幼儿园老师有幼儿园的好，小学老师有小学的好，中学老师有中学的好，大学老师有大学的好，教授讲的有教授的好，只要是导人向善的，教人正能量的都是好的，都不相违背，只不过利益的人群不同，角度和出发点不同，是可以并行的，可以包容的。</span></p><p><span><strong>小德川流，大德敦化。</strong>小的德行，川流不息，形容很多。在我们的生活当中，看看小的德行是不是非常多？我们有很多小的德行，去可以利益他人的。比如，我们从行为上，去帮助一个人；从思维上去帮助一个人解惑，别人不会的我们会，我们可以教给他方法，所以这些小的德行，川流不息，特别多，我们可以通过一些小事情，帮助很多人。大德敦化，大的德行他是敦厚的，是可以化育万物的。</span></p><p><span>此天地之所以为大也。天地为什么伟大？有小的德行，又有大的德行，可以包容万物，又可以承载万物。所以我们学习圣人之道，效法天地之道。</span></p><p><span>我们守君子之道，都是同样的道理，我们要懂得包容，要懂得去承载；我们每天要去从小的德行，开始做起，川流不息，不停地去帮助别人，不停地去利益他人，才会有更大的德行，有了更大的德行，才可以化育万物。</span></p><p><span>所以天地是不是既有大德又有小德？我们学习君子之风也是同样的，我们每天从小的德行做起，不断地积累大的德行，上对得起天道，下对得起地道。我们立于天地之间，而不违背天地的法则。</span></p></div>"
},{
    "title": "《中庸》第三十二讲 至诚配天",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十二讲 至诚配天</strong></span></p><p><span><strong>唯天下至圣，为能聪明睿智，足以有临也；宽裕温柔，足以有容也；发强刚毅，足以有执也；齐庄中正，足以有敬也；文理密察，足以有别也。溥博渊泉，而时出之。溥博如天，渊泉如渊。见而民莫不敬，言而民莫不信，行而民莫不说。是以声名洋溢乎中国，施及蛮貊，舟车所至，人力所通，天之所覆，地之所载，日月所照，霜露所对，凡有血气者，莫不尊亲，故曰配天。</strong></span></p><p><span>接下来从唯天下至圣到唯天下至诚，告诉我们至圣和至诚的状态。讲到这里，《中庸》开始给我们做总结了。</span></p><p><span>从最开始开篇的，天命之谓性，率性之谓道，修道之谓教。道不可须臾离也，可离非道也。给我们讲什么叫性，什么叫道，如何去修道？又告诉我们道不远人，就在我们生活当中。往大了讲可以察乎于天地，往小了讲可以造端乎夫妇。</span></p><p><span>接下来又告诉我们，舜、周文王、周武王、周公之德行，告诉我们大德者，必得其位，必得其禄，必得其名，必得其寿。接下来又跟我们讲了，素其位而行；告诉我们君子居易以俟命；又告诉我们致天下之达德；又告诉我们凡为天下有九经。</span></p><p><span>又讲给我们至诚的道理，自诚明，谓之性，自明诚，谓之教。告诉我们，诚者是天之道，诚之者是人之道也。接下来又开始讲，至诚无息，不息则久，久则征，征则悠远，悠远则博厚，博厚则高明；又告诉我们大哉，圣人之道，告诉我们圣人是如何处事的。</span></p><p><span>上一讲又跟我们讲，仲尼祖述尧舜，宪章文武。到这里开始总结，告诉我们天下至圣，是什么样的状态？</span></p><p><span>唯天下至圣，为能聪明睿智，足以有临也。唯有天下至圣，达到至圣的状态，为能聪明睿智，又聪明、又睿智、又通达的智慧叫睿智。这里的聪明，指的反应快，反应又快又聪明，又有通达的智慧，足以有临也，足以居上位而临下。</span></p><p><span>当我们有一定的德行以后，当达到至圣的状态，一定会处尊位，处上位的；一定会有声望的，别人是仰望的是仰慕的。讲的话语自然是权威的，是有说服力的。这个时候才足以临下，受到别人的尊重。这是达到至圣的状态。</span></p><p><span>那么，即使我们在通往至圣的路上，我们去做一个躬行君子，即使我们不能达到至圣的状态，只要我们不断地学习，不断地修行，让自己更具有更多的德行，这个时候就可以居上以临下。</span></p><p><span>举个例子，如果我们是有才能的、有德行、有智慧的，在一个企业当中，是不是就容易受他人的尊重和仰慕爱戴？这就是上位。</span></p><p><span>当我们有足够的智慧和仁德，还有慈悲心的时候，我们在朋友当中就是受人尊重的，就是在处上位。</span></p><p><span>在一个家庭当中也是同样，我们是有仁爱的，是有智慧的，是条理清晰的，是睿智的，这个时候受到别人的尊重，就在处上位。</span></p><p><span>我们现在立于天地之间，生活在这个时代，也是同样的道理。我们自己是有德行的，是有智慧的，就会受人尊重受人爱戴。我们就可以处上位，处上位的时候我们才足以临下。</span></p><p><span>很多人都去讲，我要帮助更多的人。要不然处于上位，没有人尊重我们，要如何帮助更多的人呢？不会有人信服我们。</span></p><p><span>我们通往至圣的路上，虽然不能一下到达至圣的境界，但是我们上升一层，我们的位置就往上走一分，受到别人的尊重就会增加一分，这个时候是可以临下，再去做一些事情的。</span></p><p><span>当我们足以临下的时候，接下来就是我们的行为、态度。</span></p><p><span><strong>宽裕温柔，足以有容也；</strong>我们是宽厚的，宽容的，温和的，柔顺的。足以有容也，有足够的包容心，去包容更多的人。达到至圣的状态，就是包容天下苍生，包容天下万物。</span></p><p><span>所以，我们去看看自己，有多么大的德行，有多么大的仁慈，就可以包容多少人和包容多少事情。</span></p><p><span>如果我们能包容十个人，我们就只能临十个人；如果我们能包容一百个人，我们就足以临一百个人；如果我们能包容一千个人，我们就足以临一千个人。去看我们自己当下的状态，我们要懂得反躬自省。</span></p><p><span>这一段在告诉我们，达到至圣的状态是什么样子，即使我们达不到，也要有方向。至圣是这样的状态，我们去用这个状态用这个境界来对比自己。看自己有多大的容人之量，看自己有多大的包容之心。</span></p><p><span>当达到至圣的状态，是足以包容天下万物的。像天地一样，既能包容万物、承载万物，又能化育万物。</span></p><p><span><strong>发强刚毅，足以有执也；</strong>发强，发奋图强；刚毅是形容有毅力、刚强、果敢。足以有执也，这里的执是坚守、决断的意思。</span></p><p><span>达到至圣的状态，是发奋图强的，刚毅果敢的，不会被任何的困难问题所障碍。并且足以有执也，做任何事情是有自己的决断的。</span></p><p><span>这也是我们当下参照的标准，看看自己是不是发奋图强、刚毅果敢的？遇到事情的时候，看看我们自己是不是能坚守的？是不是可以决断的？</span></p><p><span><strong>齐庄中正，足以有敬也；</strong>齐这里指的是斋戒，斋戒就是亲近之心，敬重，恭敬。看看我们做任何事情懂不懂得去斋，我们又要斋心，让自己的心变得清净；又要斋戒，恪守自己的行为规范是如礼的、如法的，是符合仁德的。</span></p><p><span><strong>尊德性而道问学，</strong>尊重的是自己本有的德性，这个时候再去学习和修正自己的行为。庄就是庄重，中正不偏私，足以有敬也。</span></p><p><span>这个时候我们再来理解这句话，当我们自己懂得斋心的，让自己的心念更正，让自己的心念保持清净，让自己的行为是庄重的，并且做事情是中正不偏私的，足以有敬也，这个时候，自然就会受到别人的敬重。</span></p><p><span><strong>文理密察，足以有别也；</strong>什么叫文理？有横有竖叫文理。文理密察，密就是细微处。再来理解这四个字，在极细微处，我们也是可以条理清晰，明察秋毫的。</span></p><p><span>当我们能做到这一点的时候，足以有别也，我们可以去辨别是是非非，去看清每件事情背后那个本质是什么，我们的条理是非常清晰的，而不被事情的表面所迷惑。</span></p><p><span>所以，为什么我们学习圣贤文化？圣贤看事情为什么直接就能看到事情的本质，不会被表象所迷惑，因为达到至圣的状态，自然就是这样的境界，自然有通达的智慧，可以看透一切我们认为很复杂的事情背后的规律。</span></p><p><span>同样，即使我们达不到至圣的状态，通过不断地学习和不断地修行，也是可以条理更加清晰的，让我们看问题变得更明达，这个时候我们才能有正确的辨别。</span></p><p><span><strong>溥博渊泉，而时出之。溥博如天，渊泉如渊。</strong>我们先讲溥博渊泉，溥就是普遍的意思，充满的非常多叫溥；博就是广大之意，渊泉形容深不可测，很深，深渊。溥博渊泉，而时出之，时出之，就是时时出现，事事处处都可以体现出来。</span></p><p><span>我们再理解这八个字，他是普遍的，广大的，深不可测的，处处可以体现出来。什么东西普遍广大，深不可测，处处可以体现呢？所有的东西都是。</span></p><p><span>达到至圣的状态，智慧是深不可测的，是普遍的，是广大的。明达是深不可测的，仁德是深不可测的，至诚之心是深不可测的，化育万物是深不可测的。所有的事情、所有的智慧、所有的仁德都是深不可测的，都是普遍的广大的，处处可以体现出来。</span></p><p><span>溥博如天，渊泉如渊。溥博如天，充满天地之间，广大的样子像天一样广博。渊泉如渊，他是幽静的，深不可测的。达到至圣的状态，圣人身上所具备的所有的智慧和仁德都是深不可测的，都是广博如天。</span></p><p><span><strong>见而民莫不敬，言而民莫不信，行而民莫不说。</strong>当出现的时候，人民莫不尊敬。言而民莫不信，只要讲出来的话语，百姓莫不相信，都是相信的。行而民莫不说，只要做出来的事情，所产生的行为，是可以令百姓喜悦赞叹的。</span></p><p><span>是以声名洋溢乎中国，这里的中国，那个时候指的是中原，说自己美好的声明，美好的名望是可以洋溢乎，整个中原大地的。</span></p><p><span><strong>施及蛮貊，</strong>施，就是旁及；甚至可以旁及到蛮貊。蛮貊指的是边远地区。美好的名声洋溢于中原地区，甚至可以旁及到边远地区。</span></p><p><span><strong>舟车所至，人力所通，天之所覆，地之所载。</strong></span></p><p><span>不停地在扩大范围了，从一开始洋溢乎中原地区，甚至旁及边远地区。再接下来只要是船、车所能到达的地方，人力所通，只要是人力所能过去的地方，天之所覆，地之所载，只要在天地之间，名声、声望，圣人之贤德都可以传扬过去。</span></p><p><span><strong>日月所照，霜露所队。</strong>日月能照到的地方，霜露可以降临的地方。</span></p><p><span><strong>凡有血气者，莫不尊亲，故曰配天。</strong>这里的血气指的有生命的，凡事有生命的，莫不尊亲，都是尊重和亲近的。故曰配天，所以圣人的德行，圣人的智慧，圣人化育万物的能力，参赞天地之化育，是可以配天的。</span></p><p><span>整个这一段都在告诉我们，达到至圣以后的状态，是和天相匹配的，是深不可测的，是广博的，充满天地之间的，所以这是圣人达到境界的状态。同时也是我们修行的次第和标准。</span></p><p><span>我们可以对照着来修自己，看看我们自己是不是聪明，有通达的智慧，看看我们是不是宽容的，是不是温厚的、温和的，对待他人是不是柔顺的。我们自己的内在是不是刚毅的，我们是不是能条理清晰的，我们自己的行为是不是庄重的。我们处事的风格是不是中正不偏私的，我们自己的内心是不是清净的，是不是懂得约束自己的行为的。</span></p><p><span>所以整个这一段，可以成为我们自己修行的止，是我们自己修正的方向。至圣和至诚同样的道理，我们一下或许达不到至圣的状态，就好比是至诚，我们不能直接达到至诚的状态，但是我们懂得诚之，不停地去往至诚的路上。</span></p><p><span>至圣也是同样的道理，当我们达到至圣的状态，就是开篇所讲的，天命之谓性，率性之谓道，率着本性而为，回归自己的本性，我们就是圣人。每个人都是圣人，只不过后期的杂染太多，所以我们逐渐地修行的过程，就是去往至圣的路上。</span></p><p><span>最后这两句，凡有血气者，莫不尊其，故曰配天。血气，通常我们在书本上所理解的是指人类。但是后面告诉我们，故曰配天，天所覆盖之下，何止是人类，所有的有生命的，都是有血气者。</span></p><p><span>所以，我们学习圣贤的文化，让自的格局和境界再高一点，他泛指的是所有有生命的，莫不尊重和亲近，所以他和天是相匹配的。</span></p></div>"
},{
    "title": "《中庸》 答疑解惑",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span>《中庸》 答疑解惑</span></p><p><span>这一段告诉我们，溥博渊泉是形容至圣的状态，他是如此的广大和广博、深邃、深不可测，所有的方面都是深不可测的。但是，我们达不到至圣的状态，我们可以从某一个方面去修。</span></p><p><span>比如有的人，可以让自己的容人之量变得更大；有的人可以让自己变得更通达智慧；有的人呢，可以让自己变得条理更加的清晰；有的人可以让自己的行为变得更庄重，有的人可以让自己处事风格更加的中正不偏私，都可以。</span></p><p><span>圣人他是具足的，就好比是我们自己的本性，他是具足的。如果我们回归了本性，我们是处处都可以体现的，哪一方面就是具足的。</span></p><p><span>但是，我们不能回归本性的时候，就是修道之谓教。我们可以去找自己的性格特点，从某一方面让他修行的更好，这个是对的。</span></p><p><span>并且这一段只是举了几个例子，达到至圣的状态不只是，当下所说的这些，他是非常的全面的，他是无所不知，无所不通的。</span></p><p><span>曲阜有一个万仞宫墙的故事，万仞宫墙在形容什么？子贡有一个一起在朝为官的人，有人说子贡，觉得他的学识甚至比孔子还要高。子贡说：“我的学识和德行就好比是一仞宫墙，当有这个高度的时候，就可以看到我全部的学识和德行。但是，我的老师孔夫子，像数仞那么高。”就是不知道有多高，是深不可测的。老师的学识和德行是看不到底的。</span></p><p><span>后来万仞宫墙，就是形容孔夫子的德行和智慧，不知道他多高，也不知道他有多么广博，这个就是这里告诉我们的溥博渊泉，而时出之。处处都可以体现出来圣人所具备的那些品质，这个也是我们本性上的东西。</span></p><p><span>知微之显，通过一件事情的表象和显现，就可以察觉到精微处。我们再往上延伸一下，知远之近，从近处所表现出来的事情，就知道远处要发生什么。</span></p><p><span>举两个生活中的例子，比如夫妻之间，如果要懂得知微之显，要懂得知远之近，刚开始出现异常的时候，要懂得及时解决，就不会有后面的事情。如果出现异常的时候，没有察觉到，我们是不知道的，是不是中间的裂痕就会越来越大？当有一天发现的时候，已然解决不了了。</span></p><p><span>就好比是我们身体不舒服，当有小的不舒服，我们要及时察觉了，就把他解决了，否则时间长了，就病入膏肓。这是不是从表象就知道细微处？从近处就可以看到未来。所以我们不断地学习修行的奇妙之处，不就在这里吗？</span></p><p><span>我们有了觉察和觉知的能力，带团队是不是一样的？当发现团队的氛围出现问题了，当出现一些小的表象，要知道这里面精微处是什么，远处可能会导致什么样的结果发生。所以大家共同做事情，共同修行的过程，是不是我们发现一些问题的时候，就会及时去调整？就不会让它越演越烈，其未兆易谋，很多事情好解决。</span></p><p><span>就好比是很多家里的孩子，是不是也一样的，如果父母是懂得修行的人，从他一些表象上，就要知道这个孩子最近出了什么问题，而看到精微处，我们提早去解决，而不是等他酿成大祸。</span></p><p><span>比如我们种菜是不是一个道理，当我们通过叶子黄了，要及时发现他缺水了，我们去浇水，是不是由近开始知远。如果不知道，没有发现，没有放在心上，最后会发现它不结果的。</span></p><p><span>看我们做事情，是不是这样的，我们做事情要不要有觉知能力？就是这个事情我刚一做，就觉得哪里是不对的。就好比昨天录的课，及时发现声音有问题，马上停止，要不然我们讲了一个小时，就白讲了。所以我们一定要让自己保持觉知和觉察能力。</span></p><p><span>包括我们修行当中，去觉察自己每一个不好念头，觉察到了这个不好的念头，是不是显像？从这个显像就可以知道它的精微处。我们说，现在有个不好的念头起了，这是显像，从这个显像自己往里面深挖是什么呢？</span></p><p><span>为什么起这个念头，因为什么事情，因为谁的出现，因为什么事情的出现，导致了这个念头的发生，我们提前知道了把它解决掉。是不是就是由近知远？而不让未来那个事情再去发生。</span></p><p><span>我们看所有的东西不都是一样的，就是防患于未然。这就是修行的奇妙之处，为什么我们越学习越修行，越有觉察能力，我们犯的错误就会越少。</span></p><p><span>如果我们懂得修行之道，再去经营人际关系是不是也是一样？我们所付出的代价就会越少。我们带团队、经营企业不是同样的道理吗？不要等到困而知之。很多人都是不懂得学习，不懂修行，都是困而知之的。</span></p><p><span>做生意赔钱了，我们被迫学习；感情出问题了，才知道原来感情还要经营，会发现那个时候已经晚了。所以这几句话往生活当中，是可以随处应用的。无论是我们自己外在的行为，对自己衣食住行的要求，还有对自己思维上的引导，都起到了一个很好的作用，他可以往生活和工作当中无限的延伸。</span></p><p><span>大家把这几句话，可以反复地记住背下来，会发现碰到事情的时候，就提醒自己，是不是淡而不厌的；是不是简而文的；是不是温而理的；能不能知远之近，知风之自，知微之显。如果这些不停地来警醒自己，就可以入道德之门了。</span></p><p><span>所以发现问题的能力，极其重要。如果我们不能发现问题，要如何解决问题？如果不能发现自己的不足，要如何修正？但是我们怎么才能发现问题？学而知之。只有不停地学习，才知道问题出在哪里，只有不停地学习，才能变得更明达，才能发现，做事情当中的问题。</span></p><p><span>如果我们不去学习，都是以为自己没问题的，以为自己很厉害，只是时运不济，其实不然，是我们自己看不到自身的问题。所以很多跟着学习了半年的朋友，我们再去看，自身还有很多的不足，自己感叹原来我还有不足呢，是啊，只是我们没有学习更多的知识而不懂，所以发现问题是一个非常好的事情。</span></p><p><span>我们在讲《了凡四训》的时候，也讲过莫论行善，先说改过。要先改正自己的过错，如何才能改过？得先发现自己的不足才能改过，改完过才能去行善。所以他也是有次第的，非常好的一个行为和事情。</span></p></div>"
},{
    "title": "《中庸》第三十三讲 至诚立本",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十三讲 至诚立本</strong></span></p><p><span><strong>唯天下至诚，为能经纶天下之大经，立天下之大本，知天地之化育。夫焉有所倚？肫肫其仁，渊渊其渊，浩浩其天。苟不固聪明圣知达天德者，其孰能知之？</strong></span></p><p><span><strong>《诗》曰：“衣锦尚絅。”恶其文之著也。故君子之道，暗然而日章；小人之道，的然而日亡。君子之道，淡然而不厌，简而文，温而理，知远之近，知风之自，知微之显，可与入德矣。</strong></span></p><p><span><strong>唯天下至诚，为能经纶天下之大经；</strong>唯有达到天下至诚的状态，为能经纶，经纶是整理的意思；大经就是规律法则。</span></p><p><span>我们再来理解这句话，唯有达到至诚的状态，才能整理天下之规律和法则。道的运行规律不是某个人，也不是某个圣贤创造出来的，本来就有他运行的规律。</span></p><p><span>达到至诚的状态，就是圣人的状态，就可以参破宇宙运行的规律。整理出来道的运行规律和法则，告诉给我们后人，我们后人来参照学习圣贤的文化，让自己更符合道，更符合法则和规律，少做恶事，让自己回归圣贤的路上。</span></p><p><span><strong>立天下之大本，知天地之化育，</strong>立就是确立，确立天下之根本。知天地之化育，知道天地的化育，参赞天地是化育，帮助天地来化育万物。</span></p><p><span>比如我们学习的《四书五经》，都在告诉我们如何知道天地的化育，这些圣贤文化，同时在参赞天地之化育，就是在帮助天地，教化我们每一个人。</span></p><p><span>所以，这是达到至诚的状态所做的事情，可以参破天道运行的规律法则，确立天下运行的根本，帮助天地化育万物，这是达到至诚的状态。也是至圣的状态，圣人就是来做这些事情的。</span></p><p><span>比如，我们学习了《大学》，学习了《中庸》，就知道人之根本是什么，人之根本要懂得修身，自天子以至于庶民，皆以修身为本。要懂得修正自己的德行，要懂得增加自己的仁爱之心。</span></p><p><span>我们做事情要懂得，义者宜也，尊贤为大，要懂得去至诚，回归自己本有的天性，这都在教给我们人之根本。这不是在帮助天地来化育万物吗？</span></p><p><span><strong>夫焉有所倚？</strong>夫是助词，焉有所倚？哪有什么可依靠的呢？这句反问在说什么？说可以整理天下的规律法则，帮助天地化育万物，哪有什么可依靠的？能依靠什么呢？</span></p><p><span>达到至诚的状态自然就是圆满的。天命之谓性，他就是至诚的就是至圣的；率性之谓道，率这个至诚的至圣之本性就是道。</span></p><p><span><strong>肫肫其仁，渊渊其渊，浩浩其天。</strong>肫肫，就是很诚挚的、很诚恳的；其仁，仁德，指的是内在的；看我们内在达到至诚的状态，是很有诚挚的很诚恳的，仁德，仁心、诚挚、诚恳，就是别人、万事万物对诚恳和诚挚，是没有丝毫的疑虑的，这叫肫肫其仁。很诚挚，诚恳的仁德。</span></p><p><span>渊渊其渊，浩浩其天，我们再把它延伸一下，外在的行为是深不可测的，做事情具有玄德，玄妙的德行。玄，也是深邃之意，是很深邃的，是深不可测的德行和做了很多深不可测的，利益他人的行为。</span></p><p><span>原意，肫肫其仁，渊渊其渊，在讲一种状态和境界，我们把他延伸出来，讲内讲外是为了有助于我们去理解。</span></p><p><span><strong>浩浩其天，浩大如天，</strong>内在诚挚的诚恳的仁德，行为深不可测，他是玄妙的，是玄德的，浩大像天一样广博，普照万物，化育万物。</span></p><p><span>苟不固聪明圣知达天德者，其孰能知之？苟，就是如果的意思；固就是确实有；如果不是确实有聪明圣知，圣人的智慧，达天德者，还要达到天之德行，其孰能知之？</span></p><p><span>整个这句话告诉我们，如果不是确实有聪明睿智、圣人一样的智慧，并且还要有像天一样大的德行，怎么会知道这一切呢？所以告诉我们至诚至圣的状态，是无所不知的，无所不能的。</span></p><p><span>我们把这一小段再做个总结，刚才告诉我们，夫焉有所倚？我们有什么能够依靠的呢？我们要依靠什么，才能让自己有如此的德行，达到至诚的状态呢？任何依靠都没有，我们自己回归自己的本性，本然就是这个样子的，本然就是无所不知的，本然就是至圣的，本然就是至诚的，所以天命之谓性。</span></p><p><span>我们现在所做的事情，都是在修道之谓教，整个中庸都在告诉我们道在讲什么？如何去向道，这个就是我们修己的过程。让自己去回归自己的本性，所以这段告诉我们不要向外求，不要求别人给我们智慧，没有任何人可以给我们的。所以说，诚者，自诚也；而道，自道也。</span></p><p><span>我们如何达到至诚的状态？自我成就。如何去修道？道不用修，他本来就在那里。我们修什么？修己，让自己合道。所以告诉我们，没有什么是可以依靠的，圣贤能提供给我们的是方法，是法则。所以不要再苦苦的向外求，去求智慧，去求方法，而要回归自己的本性。自己去至诚，自己去至圣，自己去至道。</span></p><p><span>讲到这里，整个《中庸》的部分基本就结束了，接下来开始引用《诗经》，来给我们作为补充，补充我们的行为规范，补充我们的内在。</span></p><p><span><strong>《诗》曰：衣锦尚絅。</strong>《诗经》里讲了这四个字叫，衣锦尚絅，衣是动词，穿衣、穿着意思；锦就是锦绣的华美的衣服；絅是麻衣，是麻的、粗麻的衣服。尚絅就是外罩，穿在外面的麻衣。</span></p><p><span>我们再来理解这句话什么意思呢？里面穿着锦绣的华服，外面要罩上粗布的麻衣。《诗经》的四个字讲完了。但是，我们从《诗经》当中可以延伸什么呢？接下来告诉我们了。</span></p><p><span><strong>恶其文之著也。</strong>这里用了一个恶，很重了，厌恶，厌恶其内在的色彩、纹饰太过于显著。是不是告诉我们要低调？外面要穿一个粗布麻衣，把里面的锦绣华服遮盖住，因为我们自己是厌恶里面的色彩和那些装饰的纹路。为什么要这样呢？</span></p><p><span>故君子之道，暗然而日章；所以说君子之道，暗然而日章。暗然就是外表是暗淡朴素的，我们只有外表是暗淡朴素的，而日章，内在的德行却可以日渐的彰明，日渐的彰显。</span></p><p><span><strong>小人之道，的然而日亡。</strong>的然，就是外表光鲜的，小人之道是什么呢？外表是光鲜的，但是内在的德行是日渐消亡的。因为小人只注重外表的华丽，外表的安逸、享受和贪婪，内在的德行自然就是日渐损害的，日渐消亡的。</span></p><p><span>君子之道，淡而不厌，简而文，温而理；君子之道，淡而不厌，这里的淡是指的方方面面。比如说我们对于吃、对于住、对于行、对自己的穿着、对自己的生活用度、对于外在的追求都是淡然的，而自己也不厌倦。我们内在的德行就会日益的彰显。</span></p><p><span>简而文，文是一种什么状态？我们经常用一个词文雅，有文采，是不是说明他是有内在的、是有内涵的？所以简而文，就是简朴、简约、简单，但是不失内涵。</span></p><p><span>包括我们讲话也是一样的，可能讲话很简单，言语很朴实，但是是有内涵的、是有深度的。包括我们的生活所用也是一样的，是简朴的，但是不失内涵的。包括我们房间的摆设也可以是一样的，他是简朴的，但是不失内涵的。温而理，温和的、温厚的，但是又是明达事理的。</span></p><p><span><strong>知远之近，知风之自，知微之显，可与入德矣。</strong>知远之近，可以由近知远。当发生一件事情，我们从近处就可以看到远处将要发生的事情。我们通过一个人的言行，就可以看到未来所要发生的事情，这个都叫知远之近。有近处而知远处，由现在而知道将来所要发生的事情。</span></p><p><span>知风之自，当出现了一件事情，我们知道风是从哪里来的，形容知道事情的源泉。</span></p><p><span>知微之显，显通过显像，表象，就可以知道他的细微处，所以叫知微之显。</span></p><p><span>这三句我们都要懂得从后往前理解，比如说，知远知近是由近而知远；知风之自是从自身开始，就知道事情发生的源头。知微之显通过显现出来的表象，就可以看到细微处。</span></p><p><span>这几句都在告诉我们，君子要懂得时刻有觉知能力，有觉察能力的。《道德经》讲：“其未兆易谋。”同理。当事情还没有发生，或者是刚刚开始发生的时候，是容易谋划的，是容易解决的，所以叫其未兆易谋。</span></p><p><span>这里面也是同样的，当发生了一件事情，我们从近处就可以看到远处，可以提前制止问题的发生。通过一个表象我们就能观察到细微处，就可以尽早的解决问题和隐患。</span></p><p><span>包括我们自己修行，也是同样的道理，我们不停地学习圣贤的文化，不就是知微之显吗？通过当下自己的行为表象，再去对照就知道了，我不能再这样做下去了。再这样做下去一定会出问题的，我们自然就会让自己的行为越来越合道。</span></p><p><span>当我们自己一个不好的心念产生的时候，我们就知道了要及时制止自己的念头，否则再接下来就会产生不好的行为。</span></p><p><span>可以入德矣，这样就可以入了道德之门。所以整个这一段，君子之道，讲的特别好。淡而不厌，简而文，温而理，是在告诉我们的行为；知远之近，知风之自，知微之显，是在告诉我们的思维。</span></p><p><span>我们要如何去思考，我们要如何去行事、我们要如何去看待问题？时刻保持觉察和觉知的能力，其未兆易谋，如果懂得这样要求自己，是不是就入了道德之门了？</span></p><p><span>每天不停地去要求自己，淡而不厌，简而文，自己对于很多事情是淡然的、是淡泊的、是简朴的，自己也不厌倦。并且还是富有内涵的，时刻保持这种觉知的能力，就会把很多事情防患于未然，如此就开始入了道德之门了。</span></p></div>"
},{
    "title": "《中庸》第三十四讲 内省不疚",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十四讲 内省不疚</strong></span></p><p><span><strong>《诗》云：“潜虽伏矣，亦孔之昭。”故君子内省不疚，无恶于志。君子之所不可及者，其唯人之所不见乎！</strong></span></p><p><span><strong>《诗》云：“相在尔室，尚不愧于屋漏。”故君子不动而敬，不言而信。</strong></span></p><p><span><strong>《诗》曰：“奏假无言，时靡有争。”是故君子不赏而民劝，不怒而民威于鈇钺。</strong></span></p><p><span><strong>《诗》云：潜虽伏矣，亦孔之昭。</strong>潜就是很隐蔽、隐藏；伏就是看不见；虽然在很隐藏看不见的地方。亦孔之昭，孔也是很大；昭就是明显、显著。</span></p><p><span>这句话是什么意思呢？隐藏看不见的地方，看不见的时候也是很明显的、很显著的。</span></p><p><span>故君子内省不疚，无恶于志。所以说君子要懂得内省，不停地向内求。而不疚，不疚就是不后悔。无恶于志，坚持自己的志向，时时省察。我们再来讲到底是什么东西，在隐藏看不见的地方，也是很显著、很明显，所有的东西，皆是如此。万事分阴阳，所有的我们无论是好的还是坏的，即使在别人看不见的地方，也是很显著的。</span></p><p><span>比如说我们身上有一个优点，即使我们不刻意去彰显，我们是隐藏的，是看不见的，会发现随着事情的发生，别人也能看到我们的优点。同样，缺点亦是如此，我们自身的缺点和不足，无论隐藏的有多么好，终究会被别人发觉和看见。</span></p><p><span>我们做了好事也是一样的，即使在不为人知的地方，也是很明显的。十目所视，十手所指，其严乎。这句话要告诉我们，无论好的还是坏的，无论是否刻意隐藏或刻意彰显，终究会被看得到。</span></p><p><span>所以告诉我们，故君子内省不疚，我们不停地去反求于己，不停地去内省才能不愧疚，才能不后悔。说一个人有才能，不需要刻意去彰显，只要是金子，一定不会被埋没。当我们还在抱怨怀才不遇的时候，说明我们自己的智慧、才能、德行，还不足以影响别人，不足以光明到被他人看见。</span></p><p><span><strong>至诚无息，不息则久，久则征。</strong>我们不停地持久下去，不停地内省，就会有明显的效果出来。所以无论是所有的事情都是藏不住的，都是隐藏不了的。我们一定要保持不停地去内省。</span></p><p><span><strong>无恶于志，</strong>这个时候才不会埋没自己的志向，才懂得时时省察，时时调整自己的志向。让自己的志向变得更光明，让自己的志向变得更良善。</span></p><p><span><strong>君子之所不可及者，其唯人之所不见乎！</strong>之所以我们达不到君子的境界，我们达不到君子的德行原因是什么？唯人之所不见乎，正好是在于人们看不见的地方，所以儒家告诉我们要修慎独的。</span></p><p><span><strong>诚于中，形于外</strong>，我们自己在独处的时候，是不是别人见不到的时候，我们和君子之间的差距，正是因为君子在没有人看见的地方，他是修慎独的。而我们绝大多时候，都是为了做给别人看的。</span></p><p><span>在有人的时候，在公开的场合，我们对自己要求还是颇高的，还懂得克己。但是，在独处的时候，就不懂得克己了。所以我们修行之人，尤其要注意的恰恰是人所不见的时候。</span></p><p><span>举个例子，比如说我们自己家的孩子，如果在没人的时候，我们会觉得没关系，孩子做什么都无所谓，会发现他就已然形成了习惯。当有人的时候，再去规范他的习惯是不可行的，别人一眼就看得到。</span></p><p><span>包括我们自己也是一样的，如果我们平时不是懂得严于律己的，当遇见他人的时候，当有事情发生的时候，我们之前的习惯和思维方式，自然就会出来，瞒是瞒不住的。所以就像《诗经》所讲：<strong>“潜虽伏矣，亦孔之昭。”</strong>我们平时的思维方式，平时的行为习惯，只要在事情发生的时候，自然就会出现。</span></p><p><span>比如说我们一个人独处的时候，在背后的时候，总是抱怨的、总是苛责的，当碰到事情，我们不经意间所表现出来就是抱怨，只不过我们不自知。但是其他的人看得清清楚楚，这就是<strong>“诚于中，形于外。”</strong></span></p><p><span>我们内心是有多少诚意的，平时是如何要求自己的，从行为当中都可以表现出来，别人清清楚楚都可以看得到。尤其是在比我们高明的人面前，丝毫掩饰不了。接下来又开始讲。</span></p><p><span><strong>《诗》云：相在而室，尚不愧于屋漏。</strong>相，就是看的意思；尔就是你的意思；室，就是自己独处的时候。一个人在独处的时候，尚不愧于屋漏，古人屋漏通常指的是西北角，还有一种说法，以前古人在西北角供奉神明。</span></p><p><span>所以，这句话是什么意思呢？看一个人在独处的时候，是不是可以无愧于神明的，我们学《太上感应篇》也会讲，举头三尺有神明；我们学《了凡四训》也会讲，我们做的所有事情，都是被神明记录的，我们自己所做的善业和恶业，都是放在那里清清楚楚的。</span></p><p><span>《太上感应篇》又告诉我们，<strong>祸福无门，唯人自召，善恶之报，如影随形。</strong>包括我们现在所学的《中庸》也会告诉我们，<strong>鬼神之德，其盛矣乎，洋洋乎，如在其上，如在其左右。</strong>又告诉我们道察乎于天地。我们所有做的事情，都是被看得清清楚楚，记录在册的。</span></p><p><span>《大学》又告诉我们，<strong>十目所视，十手所指，其严乎。</strong>《大学》还告诉我们，<strong>诚于中，形于外。</strong>都在时时刻刻地警醒我们，要懂得慎独。无论在什么样的场合，无论在是否有他人在的场景，我们都要严格地去要求自己。</span></p><p><span><strong>故君子不动而敬，不言而信。</strong>君子在没有动的时候，就是保持恭敬之心的，在没有说话的时候就是保持诚信的，我们经常听到一个词，叫言而有信。</span></p><p><span>这里我们上升一个层次和境界，不用等言，不讲话之前也是诚信的。我们的起心动念、时时刻刻皆是善，才能不动而敬，不言而信。我们坐在这里不讲任何话，不去产生任何的行为，都是保持恭敬的、都是保持诚信的、都是慎独的、都是时时刻刻内省的、都是不动恶念的，所以这是修慎独的重要性。</span></p><p><span>整个《中庸》的结尾部分，不停地引用《诗经》，来告诉我们作为一个躬行君子，如何去修正自己的行为、思维、甚至心念？</span></p><p><span><strong>《诗》曰：奏假无言，时靡有争。</strong>这段《诗经》所讲的是《商颂》里面的列祖，是在祭祀商汤的时候，所奏之乐曲。商汤是商朝的创立者，非常贤明有德行的君王，所以他是受百姓敬仰和爱戴的，他是有德行的。</span></p><p><span>所以，告诉我们奏假无言，时靡有争。在祭祀商汤之时，每个人都是肃穆无言的，在当时那个环境，没有任何争讼和喧闹，所以叫时靡有争。</span></p><p><span>我们可以想象一下这样的一个场景，在这样一个祭祀的生活当中，是没有任何人有争讼和喧闹的，都保持肃穆。为什么能做到这个状态？是因为我们从内心是非常尊重这个人的。</span></p><p><span>我们往生活当中延伸，也是一样的，当我们特别尊重一个人的时候，我们很仰慕一个人的时候，我们很恭敬对待一个人的时候，看看我们在这个人的面前，是不是保持庄严的？是保持肃穆的，不会产生任何争讼的。</span></p><p><span>我们现在这个社会，即使说我们参加一个比如说婚礼，如果在场组织活动的人，是我们很敬重的人，是不是我们自己表现出来的，一定是对对方充满敬畏之心的？如果对方不是我们敬重的人，是不是我们说话可能就开始肆无忌惮？</span></p><p><span>所以整个这段就告诉我们，我们敬仰的是一个人的德行。再回到《诗经》所讲，虽然商汤不在，但是我们学《论语》告诉我们，祭神如神在，就好像他在一样是敬畏的，是一样的恭敬的。</span></p><p><span><strong>是故君子不赏而民劝， 不怒而民威于鈇钺。</strong>我们先来讲鈇钺，以前刑罚的器具， 这里延伸为刑法。我们先来讲字面的意思，所以说君子不用去奖赏，而民劝，就会被感动，就会被劝化。</span></p><p><span><strong>不怒而威，</strong>甚至比行为还要敬畏。当我们是一个有德行的君子之时，我们不需要靠奖赏，而别人自然就会受到感动，加倍地去努力。</span></p><p><span>何为劝？被感动，而自己产生的努力的行为称为劝。所以看看在有德行的人面前，是不是这样的？因为君子是有絜矩之道的，君子是行不言之教的。</span></p><p><span>当我们是有德行的，行为就会影响身边的每一个人。不需要靠利益，不需要去靠奖赏，别人就会被感动，就会努力，这叫民劝。</span></p><p><span>不怒而威，不需要去发怒，就有自己的威严，别人在我们面前，自然就是敬畏的，自然就是恭敬的，甚至比刑罚还要管用。当他犯了一个错误，不需要去惩罚他，靠我们的仁德就可以去感化他，让他产生恭敬和敬畏之心，他自己就会产生畏惧，自己就会去加以改正。</span></p><p><span>所以整个这段，都告诉我们仁德的重要性，当我们是有德行的君子，会发现我们处处就是别人的榜样，别人就会按照我们自己的行为，去感化自己，自己努力去做事情。</span></p><p><span>整个来总结一下，这节课的内容，从潜虽伏矣，亦孔之昭，到相在尔室，尚不愧于屋漏，在到我们最后一句奏假无言，时靡有争，告诉我们虽然在隐藏看不见的地方，我们的所做、所为、所思，都是被看到的。即使我们在独处的时候，也不能愧对自己，也不能愧对天地鬼神。</span></p><p><span>最后我们又来告诉自己，当我们自己是有德行的君子，别人自然就会受到我们的感化，而去努力。我们不需要去惩罚和靠奖赏去要求任何人，我们自己就是有絜矩之道的，上行下效。</span></p><p><span>但是，我们自己的仁德从哪里来呢？从慎独开始修，如果我们自己当面是一套，背后是一套，平时我们的行为展现的是很好的，但是我们在独处的时候，不能严于律己，我们自己会觉得自己在别人面前，表现出来的行为是很好的。但是，实则在我们身边的人，看的是清清楚楚的。</span></p><p><span>所以告诉我们，如何增加自己的德行，如何才能有絜矩之道，如何才能行不言之教？关键的地方在于慎独。就是我们自己独处的时候，一定是诚于中，才能形于外，我们一定是至诚的。无论是在任何地方，无论是在多么隐藏和看不见的地方，都是如此。</span></p><p><span>我们对自己内在是有诚的，才能不断地去修慎独。我们的德行足以彰显，这里的彰显是不需要刻意的，因为平时对自己的要求，会融入到我们的起心动念当中，会融入到我们每个行为当中，所以君子自然就是不动而敬，不言而信。不需要有任何的行为产生，就是恭敬的样子，甚至不需要有任何的话语，别人就会相信是诚信的，因为我们是自诚的。</span></p><p><span>把自己修成了内在是有仁德的，我们才能感化别人，才会有更多的人愿意去跟随我们去做事情，更多的人就会受到我们的感化而去努力。他比奖赏和刑罚更能起到作用。</span></p><p><span>我们再举两个生活中的例子，让大家更好的理解。比如说在家庭当中，我们不需要靠奖赏孩子，他就会被感动，被感化。比如我们想让孩子好好学习，我们一般是用奖励的方法，说要好好学习，我带你去哪里玩。可是有的父母是不需要靠奖赏的，因为我们自己本身就是爱学习的，自己就是有良好的价值观的，他会受父母的影响。</span></p><p><span>以前为什么会要讲书香门第呢？因为家里的父母就爱读书的，就是爱学习的，就是有文化的，孩子自然就会受到感化。</span></p><p><span>看看在企业当中，也是同样的道理，如果我们自己是一个有德行的君子，是一个有仁德的人，我们自己每天在努力的做事情，作风是中正的，会发现我们不需要靠奖赏，别人自然就会跟着我们去努力，因为他是受到了我们的感化。</span></p><p><span>如果以利相交，利尽则散，我们讲到这里并不是说不让以鼓励，不让以奖赏，而是要以仁德为主，奖赏为辅，这样才能起到更好的效果。</span></p><p><span>不怒而民威，也是同样的道理，我们不需要去靠惩罚，让孩子害怕我们，如果我们自己平时是行为很端正的父母，会发现孩子做错事情的时候，在我们面前他自然就汗颜，他会觉得不好意思。</span></p><p><span>比如说我们以前看电视，在很多门派当中是不是也一样的，如果做师父的是很有威严的，做师父的是很有德行的，当弟子犯了错误的以后，他自然就会觉得有愧，这个就是不怒而威。不需要靠惩罚，自己的内心就会被触动，就会被感化，他就会知道自己做的是不对的。</span></p><p><span>这一切的前提，都是建立在我们自己是有君子之风的，我们自己是有德行的。如果我们自己不懂得修慎独，表里是不一的，别人自然就不会被我们感化。</span></p></div>"
},{
    "title": "《中庸》第三十五讲 君子明德",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《中庸》第三十五讲 君子明德</strong></span></p><p><span><strong>《诗》曰：“不显惟德！百辟其邢之。”是故君子笃恭而天下平。</strong></span></p><p><span><strong>《诗》云：“予怀明德，不大声以色。”子曰:“声色之於以化民，末也。”《诗》曰：“德犹如毛。”毛犹如伦。“上天之载，无声无臭。”至矣。（原文）</strong></span></p><p><span><strong>《诗》曰：不显维德！百辟其刑之。</strong> 这是《诗经》其中的一篇周颂，用来赞美文王的，赞美周氏的天子。也是用来警醒周氏的天子，用来警醒诸侯的。通常这篇周颂列文，在周天子封诸侯国国君的时候，所奏的乐曲。</span></p><p><span>不显维德是感叹词，难道文王的德行不够彰显吗？意思是他的德行是很大的，是彰显在外的。</span></p><p><span>我们再用来延伸，第一层意思，他是赞美文王的。那么第二层意思也是来警醒周氏的后代天子，要懂得修正自己的德行。</span></p><p><span>百辟其刑之，百是一个量词；辟是指的君，也就是指各诸侯的君王，当自己的德行，大大的彰显在外的时候，各位诸侯国的国君，其刑之，自然就会去效法。也就是告诉所有的周朝的天子，当自己的德行得以彰显之时，各诸侯国的国君自然就会来效法，同时也在告诉诸侯国的国君，当自己是有德行的，其他的百姓人民自然会效法。</span></p><p><span>是故君子笃恭而天下平。所以君子的行为，笃恭就是笃行、恭敬，当一个君子的行为是笃行的，是恭敬的，而天下自然效法，天下自然太平。笃行和恭敬的前提是什么呢？惟德，以德治天下。</span></p><p><span>以德养身，当自己是具备德行的，别人自然开始效法，当自己有德行的时候，更要保持笃行，恭敬的态度，而别人自然效法，而天下自然太平。</span></p><p><span>所以《诗经》讲的是治理天下。我们往生活当中延伸，也是同样的道理，到了我们现在不光是治理天下，我们自己的安身，自己的立命，自己做人的根本，都要以德为法则。当我们自己是具备德行的，我们是笃行的，是恭敬的，而身边的人自然会去效法。</span></p><p><span>在一个家庭当中，我们是有德行的，我们是保持笃行恭敬的，而身边的家人也自然受到我们的影响，自然会去效法。</span></p><p><span>在一个企业当中也是如此，我们做上位的人，要修自己的德行，要去笃行恭敬，别自然就会受到我们的影响，开始效法。企业就是太平的，就是顺其自然的往前发展的。</span></p><p><span>所以这一篇整个告诉我们，德行的重要性，修己身的重要性，当我们以德为法则，我们自己的团队自然也会受到我们的影响，得以治理，所以这是安身立命做人的根本，就在于德。</span></p><p><span><strong>《诗》云：予怀明德，不大声以色。</strong>继续跟我们讲德行的重要性，这一篇来自《诗经》大雅皇矣，也是赞美周王室的。这一篇整个《诗经》分八章节，前四章节是赞美古公亶父的，也就是我们之前所提到过的太王，后四章是赞美周文王的。</span></p><p><span>予怀明德，不大声以色。予是我的意思，我是怀有明德的；不大声以色，不需要去疾言厉色，不需要去厉声厉色地教化人民。</span></p><p><span><strong>子曰：声色之于以化民，末也。</strong>孔子说，以声色来教化于民，末也，实在是最末等的方法。</span></p><p><span>我们如果是怀有仁德的，是不需要靠疾言厉色去教化于民的。孔子又说了，如果以疾言厉色，以声色去化民，实在是最末等的方法了。</span></p><p><span>我们再把这个声色延伸一下，比如说我们严厉的手段、严苛的方法、奖惩的制度，这都叫声色。所以圣贤的文化是告诉我们，以德治天下，以仁治天下。靠自己的身教，行不言之教，去影响去化育天地的子民，而不是靠严苛的方法，而不是疾言厉色，去教化于民。</span></p><p><span>现在我们的企业当中也是一样的，如果我们做一个领导，每天只是靠喊，靠拍桌子，靠发怒，靠情绪，这实在是最末的方法，而是靠自己的德行去感染身边的每一个人，身边的人看到我们的德行的时候，自然也会去效法，他也会变成一个有德行的人。</span></p><p><span>包括我们在一个家庭当中，和朋友相处也是一样的，我们靠声色是解决不了问题的。如果一旦用了声色，去解决问题，也是最末等的方法，别人心里是不服气的，自然也就不会产生敬畏之心。</span></p><p><span>但是我们在这个时代，要不要用末等的方法，要不要用声色呢？肯定是要用的，但是呢一定是以德为主，以声色手段方法为辅。</span></p><p><span>比如说我们现在叫法治社会，要不要有法律？要。但是法律一定是解决已经犯错误的人。就好比是我们一个公司，要不要有规章制度？要。没有规矩不成方圆，但是如果我们，只是靠规章制度来管理员工，会发现员工的内在哪来的驱动力，怎么可能人人是积极向上的，只不过是在制度之下不得不做，所以这实在是最末等的方法。</span></p><p><span>所以声色方法是不得已而为之，不得已而用之，把它归为末，我们的本要靠自己的德行。</span></p><p><span><strong>《诗》曰：德犹如毛。</strong>《诗经》告诉我们德犹如毛。这里引用了四个字，德就好比是羽毛一样轻盈。这四个字在告诉我们什么呢？其实我们修自己的德行就像羽毛一样的轻盈，当我们自己有了德行，我们再去治理天下，再去管理团队，再去学习、再去修身，都像羽毛一样的轻盈简单。</span></p><p><span>当我们自己有德行的时候，身边的人自然就会受到我们的影响，就是像羽毛一样的举重若轻，就是一样如此的轻盈简单。</span></p><p><span>毛犹有伦。但是羽毛不足以比拟德，因为毛还有伦。就是毛还是有痕迹的，还是有重量的。告诉我们其实当我们自己修德行，靠德行去影响他人，比羽毛还要轻盈，还要没有痕迹。</span></p><p><span><strong>上天之载，无声无臭，至矣。</strong>上天化育万物，承载万物，是无声无臭的，没有任何的声音，没有任何的气味。所以说毛犹有伦，羽毛还有痕迹，上天化育万物的德行，没有任何的声音，没有任何的重量，没有任何的气味，是无形无相的。至矣，可谓德的至高境界了。</span></p><p><span>所以，整个最后《中庸》的结尾的部分，引用了《诗经》的三段话，都在告诉我们修德行的重要性。</span></p><p><span>不显惟德，百辟其刑之。当我们自己的德行如此显著的时候，别人自然会来效法。予怀明德，不大声以色。我们自己是有德行的，内在是有明德的，不需要疾言厉色即可以教化于民。德犹如毛，德好比羽毛一样轻盈，修德行，靠德行影响别人就是如此的简单，如此的轻盈。</span></p><p><span>但是羽毛还不足以形容德行，因为它还有痕迹，它还有重量。上天化育万物是没有重量的、没有声音的、没有色味的，可谓德的至高境界了。</span></p><p><span>整个《中庸》讲到最后的时候，给我们归于德，归到至德。《中庸》开篇的时候告诉我们，天下国家可均也，爵禄可辞也，白刃可蹈也，中庸不可能也。告诉我们《中庸》很难，天下国家可以均衡，只要有仁就够了。</span></p><p><span>爵禄可辞也，爵位和俸禄都可以辞掉不要的，只要是一个智者就可以看破。白刃可蹈也，再锋利的刀刃都可以去踩的，只要有勇气就够了。但是中庸不可能也，即使有了智、仁、勇，中庸也不一定能做得到，告诉我们中庸之难。</span></p><p><span>但是，结尾的时候又告诉我们了，归到最后就似乎一个“德”字，当达到至德的状态，其实很简单，很轻盈，就像一片羽毛一样。</span></p><p><span>整个《中庸》告诉我们，至诚、至圣、至德，都是天命之谓性，都回到了我们自己的本性，那个本性就是无声的、无色的，没有任何重量的，无形的、无相的，本然他就是通体透明的、本然他就是圆满具足的。</span></p><p><span>我们率圆满具足的本性而为，就是道，所以归到最后，用一个德字来结束了所有《中庸》的内容，他是举重若轻的。</span></p><p><span>我们《中庸》也是如此，举重若轻的结束了，当达到至的状态，会发现就是回归本性的状态，当回归天性的状态，本然就是至德的，本然就是至诚的，本然就是至圣的，他就是圣人。这个天命之谓性，这个天性不用修的，人人都有。</span></p><p><span>我们在修什么呢？因为我们现在不能做到至诚，我们后期的杂染太多了，所以怎么办呢？我们不停地修正自己的行为，修正自己的心念，达到至诚的状态，或者达到至德的状态，或者达到至圣的状态都一样，就是天命之谓性，即刻就成圣了，一个道理。只不过我们做不到的时候，最后结尾告诉我们去至德，因为德是可以显化出来的。</span></p><p><span>诚是不是不容易体现，至圣是不是不容易体现？所以要给我们一个外修的方法，这个方便法就是德。我们不停地修德、不停地修德，当达到至德的时候，就进入天命之谓性的天性了，就回归了。</span></p><p><span>或者达到至诚的状态，一样的回归天性；或者达到至圣的状态，一样回归天性，只不过德是可以量化的，更容易理解，所以他最后以德来结尾，他是举重若轻的。</span></p><p><span>告诉我们其实中庸之道，其实天命之谓性，都很简单。回归道自己的德上，不停地去修正自己的德行。像天一样化育万物的，像天一样无形、无相、无声、无臭，没有任何的重量的。</span></p><p><span>所以，这个时候大家去感受一下，这个境界和状态是何其的潇洒，何其的轻盈，就回归天命之谓性，然后率性之谓道，我们如果率至德的本性，随意而为，就是道本身。</span></p><p><span>所以我们学《论语》的时候，孔子也会说，随心所欲不逾矩，他随的是天性。</span></p></div>"
}]