[{
    "title": "《孟子》公孙丑上 ①-1 眼界与格局（免费）",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-1眼界与格局</strong></span></p><p><span/></p><p><strong><span>公孙丑问曰：“夫子当路于齐，管仲、晏子之功，可复许乎？”</span></strong></p><p><strong><span>孟子曰：“子诚齐人也，知管仲、晏子而已矣！”</span></strong></p><p><span>第一章讲的是如何为政，都是各个国家的君主君王问孟子，该如何去治理天下、治理国家，所以孟子讲仁政。通过很多细节，通过每件发生的事情，去讲仁政，所以更多的是宏观的，是大的，并没有让我们真正地去了解孟子。</span></p><p><span>而公孙丑章句则不同，公孙丑是孟子的得意门生，孟子是比较喜欢公孙丑的。我们去想为何会喜欢公孙丑这个人呢？我们去学习《论语》的过程当中，也会发现，孔夫子也有很多喜欢的学生，比如说颜回，比如说子贡，比如说子路，为什么会喜欢这些学生？</span></p><p><span>首先这些学生是积极努力向上的；其二，他们的德行品德都很好；其三，他们的思想是有一定的深度的，跟老师之间是有一定的契合度的，所以才会让老师去喜欢这些学生们。当两个有深度的、有契合度的人在一起交流，他所问出来的问题，是更深刻的。</span></p><p><span>接下来，我们要讲到公孙丑问孟子，然后孟子给回答。我们通过公孙丑问孟子的问题，我们可以看到孟子的回答，是更深刻的，他有助于我们去了解孟子的思想、孟子的精神以及孟子的行为。他和君王问话不一样，君王问的更多的是，如何治理国家。</span></p><p><span>而孟子表达的是，自己大的宏观上的想法，该如何去实行仁政？该如何去保民？如何去治理天下？但是孟子回答学生之间，却有自己的喜好，说我喜欢做什么事情，我的价值观是什么样子的，我对于一件事情具体是怎么看待的，我平时的行为是怎么样的。</span></p><p><span>所以我们通过接下来的学习，让我们更加了解一个有血有肉的孟子，我们说去了解一个人，一定要了解他的思想，他的精神以及他平时的行为，这是血和肉。而我们去了解一个人的简介，他的生平，那个只是概括，不足以了解一个人。</span></p><p><span>比如说，我们讲到孟子周游列国二十载，邹国人，有很多弟子，被称为圣人，活到了八十四岁，这都是简介。这些是没有血没有肉的，没有内涵。我们接下来，去看看孟子他平时的思维和他的行为，到底是什么样子的？我们看看他心中的理想是什么样子的？</span></p><p><strong><span>公孙丑问曰：夫子当路于齐。</span></strong><span>得意门生问孟子一个问题，当路指的是当政，并且是掌握政权。公孙丑是齐国人，我们看公孙丑的问题，说：当路于齐，如果老师您来执掌齐国的政权，我们说孟子在齐国是做稷下大夫的，有官职，但是不主政。</span></p><p><span>也就是享受了大夫的俸禄待遇，但是并不具体的参与齐国的政事，也就是没有政权的，并不能实际的为齐国做什么事情，只能是给齐宣王一些建议，一些学识上的交流。所以公孙丑就会有一些好奇，说如果老师您来掌管齐国的朝政，那齐国会变成什么样子呢？</span></p><p><span>这个可能不光是公孙丑的疑问，我们心中可能也会有疑问，因为孟子和孔子还不相同，孔子他是曾经为官的，所以我们可以看到孔子为官的政绩。但是孟子一生并没有实际的做官，他一生都在为学，这个时候我们就要好奇了，如果是孟子来当政来为官，他会用什么样具体的方式或者他会怎么去做呢？</span></p><p><span>我们看接下来的问题，<strong>夫子当路于齐，管仲、晏子之功，可复许乎？</strong>这是公孙丑的问题，如果说老师您掌管了齐国的政权，管仲、晏子之功，可复许乎？我们看管仲和晏子这两个人，都是给齐国建立了功业之人。管仲辅佐齐桓公，称霸于诸侯，成为春秋五霸的第一位霸主。而晏子辅佐齐景公，让齐国以及景公，名扬天下。</span></p><p><span>这样两个人对于齐国的功业和贡献，都是很大的。所以公孙丑就问孟子说，老师您如果坐在那个位置上，可以达到管仲和晏子那样的功业吗？可以让齐国再度兴起，称霸于天下吗？这是公孙丑的问题，我们看孟子是如何回答的？</span></p><p><span>孟子其人讲话，是很有趣味的，他并不会直接回答这个问题，而是举例子，或者讲其他人的事情，来表达自己的想法，这样讲话更有利于回答问题。我们在生活当中，其实也要学会这种交流的方式。当有人问我们一个问题，你直接回答，未必是最好的方式。莫不如举个相同的例子，找一个相同的故事，来表达我们心中的想法，我们接下来学习孟子是如何表达的。</span></p><p><strong><span>孟子曰：子诚齐人也，知管仲、晏子而已矣！</span></strong><span>首先孟子讲了一句话，说你真的是一个齐国人，为什么这么讲？管仲和晏子都是齐国人，说你真的是一个齐国人，你就只知道管仲和晏子，这句话在讲什么？在讲公孙丑的格局和眼界太小了。你应该去放眼天下，看到更多优秀的人，看到更多贤德的人，而不只是看到了管仲和晏子。</span></p><p><span>我们先讲公孙丑的想法，是绝大多数人的想法，我们绝大多数人，只关心自己身边的事情。比如说，公孙丑他是齐国人，他就只关注齐国的那些贤德之人，而如果我们放眼天下，发现有更多贤德之人，可是我们没有看到。</span></p><p><span>我们去想一想，生活当中这个道理，也非常的实用。我们经常说一个人的眼界和格局，什么叫做眼界？如果你只盯着自己身边发生的事情，只关注自己身边的人，这就是没有眼界的表现。</span></p><p><span>我们举个小的例子，来逐步地延伸，比如说在生活当中，我们只关注自己在付出，这个时候你就看不到你的爱人，其实他默默地为家庭付出了很多，你的父母其实为你付出了很多，你的领导和同事以及你的朋友，其实也为你付出了很多，但是说我们的眼界太小了，我们只看到自己每天辛苦地在工作。</span></p><p><span>我们说我很努力的在工作，为了养家糊口付出了很多，可是我们有想过，我们的爱人也在付出很多吗？有想过我们的同事和领导，比我们付出的可能更多，有想过父母可能已经把最好的都给了我们，但是由于我们的眼界，实在是太窄，我们只看到了自己，所以看不到别人的付出。这个时候，我们就会升起很多的抱怨。</span></p><p><span>我们再扩大一点来讲，如果我们只关注到自己的付出，以及我身边这些人在付出，我们依然会生活在抱怨当中，我们会怨天尤人，我们抱怨命运对我们不公。我们这一家人没有做过什么坏事，我每天都在辛苦努力地工作，我也从没有害人之心。</span></p><p><span>可是为什么我当下的生活，还是没有过好？同样是我们的眼界太窄，我们的格局太小了，我们有没有去关注到比我们更优秀的人，他们是如何做事情的？他们在生活当中是如何提升自己的？</span></p><p><span>他们是否比我们做了更多有善行的事情？是否他们努力的方向比我们更正确？所以说我们要学会打开自己的眼界，放大自己的格局，不要总去看自己身边发生的这点事情。</span></p><p><span>我们再来看公孙丑，他比绝大多数人的眼界是大得多的，我们看他看到的是什么？是齐国，是管仲，是晏子之功，他是在想，如果老师的学问和德行是否可以让齐国变得更好，而不是放眼全天下。</span></p><p><span>那我们显而易见，孟子的思维和格局要比公孙丑，又要大上许多，他是放眼天下，来看待这个事情。所以他才会周游列国二十年，他无论走到每一个国家，他是没有国家的局限性的。孟子本是邹国人，但是同样他走到任何一个国家，都是希望你可以利民的，是可以称王天下的，对全天下的百姓都要更好。</span></p><p><span>所以我们看真正一个越有仁德的人，他是放眼天下的，而不只是自己身边的事情，自己小家的事情，也不只是齐国或者邹国的事情。所以我们回头，再来看这句话，孟子说你真是一个齐国人，你就只知道管仲和晏子而已矣，而不知道还有更多的人，还可以放眼天下。</span></p><p><span>我们从这段对话当中学习到，我们在生活当中，要把自己的眼界打开，要把自己的格局放大，这个时候心大了，我们身边的事情自然就变小。</span></p><p><span>我们举个例子，在家里照顾孩子、相夫教子的人，通常容易多烦恼，为什么呢？就是我们的眼界，只关注了当下家里所发生的琐事。如果这个时候，我们在家里懂得把眼界不断地放大，我们去关注到更多的人，我们去关注到我们的爱人，他为了这个家庭的生活，在辛苦地打拼。我们去看这个社会上，还有那么多的好人好事，还有那么多的人，想在为社会贡献着价值。</span></p><p><span>这个时候我们发现，家里这些琐事就不会障碍到我们，就不会让你产生那么多的烦恼，所以这就是眼界。我们来总结什么叫做眼界？我们往外看的有多远，从自身开始出发，往外面看得越远，也就是你的眼界就更宽，这个时候，我们的烦恼就会变得更少。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-2 孟子不愿与管仲比",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-2 孟子不愿与管仲比</strong></span></p><p><span><strong>或问乎曾西曰：‘吾子与子路孰贤？’曾西蹵然曰：‘吾先子之所畏也。’曰：‘然则吾子与管仲孰贤？’曾西艴然不悦，曰：‘尔何曾比予于管仲！管仲得君，如彼其专也；行乎国政，如彼其久也；功烈，如彼其卑也！尔何曾比予于是！’曰：“管仲、曾西之所不为也，而子为我愿之乎？</strong></span></p><p><span>孟子要回答公孙丑的问题了，但是孟子并不会直接回答，而是又举了一个曾经发生的事情，这件事情发生在曾西的身上。我们要注意，这里的曾西是曾申，字子西，是曾子的儿子。曾子的父亲叫曾晳。我们看曾经发生在曾子的儿子身上什么事情呢？</span></p><p><span><strong>或问乎曾西曰：吾子与子路孰贤？</strong>有人曾经问了曾西一个问题，吾子是尊称，您的意思，也就是问曾西，您与子路孰贤？这个问题值得注意了。曾西是曾子之子，那么曾子又是孔夫子的弟子，子路也是孔子的弟子，也就是子路与曾西的父亲都是孔子的弟子。差着辈分呢，我们看曾西是如何回答的？</span></p><p><span><strong>曾西蹵然曰：吾先子之所畏也。</strong>蹵有两个意思，一个意思是不安，非常局促不安的样子，另外一个意思是不悦。这个时候曾西又不安，又不悦，故而蹵然曰：“吾先子之所畏也”。先子指的是先父，也就是曾子。子路是我父亲敬畏的人，这个时候他是很不开心的，并且很不安。</span></p><p><span>怎么能问出这样的问题？你去问我一个我父亲都很敬畏的人，问我与他谁更优秀？这不是难为人吗？没有办法去回答，所以就蹵然讲了这样一句话，他是我父亲敬重和所敬畏之人，我怎么可能去比较，既然和子路不能去比较，那么就比较一个其他人。</span></p><p><span><strong>曰：然则吾子与管仲孰贤？</strong>我们看这个问题如此的熟悉，正是公孙丑问孟子的问题，那您与管仲谁更贤德，谁更好一点？</span></p><p><span><strong>曾西艴然不悦，曰：尔何曾比予于管仲！</strong>艴，愤怒。曾西不但不高兴而且很愤怒，脸色一沉，讲到你怎么能拿我和管仲相比？言下之意是很不高兴的，认为没有可比性，为何要这样讲？</span></p><p><span><strong>管仲得君，如彼其专也；行乎国政，如彼其久也。</strong>说管仲得到齐桓公的信任，是多么的专一。他去掌管国政，是那么长的时间。我们首先看这两点，齐桓公是非常信任管仲的，无论大小事宜，都可以交给管仲去处理。并且不计较管仲的一箭之仇，管仲曾经是拿弓箭射过公子小白的，也就是齐桓公未做君主之前。</span></p><p><span>但是齐桓公并不计较，让管仲去做国相，掌管齐国的朝政。我们可以知道齐桓公对于管仲的这种信任程度，并且管仲一生都在掌管着齐国的政权，所以首先曾西说齐桓公信任管仲，那么专一，管仲掌管齐国政权，又那么长的时间。</span></p><p><span>这是非常重要的两点，我们之前讲过一位贤相，是要有一位明君，绝对信任他的君主，否则一个人即使再有才能，也没有发挥的机会。我们用到现在也是如此，即使一个再有才能的员工，如果老板不能全心全意地去信任他，不能给他足够的时间，也没有办法发挥自己身上的才能，所以是彼此成就的关系。</span></p><p><span>有明君才会有贤相，我们看曾西说：管仲得到了齐桓公的绝对信任，并且长时间地掌管齐国的朝政，接下来那个结果是什么样子的呢？</span></p><p><span><strong>功烈，如彼其卑也！</strong>功烈指的是功勋业绩，卑指的是卑小，也就是少的意思。曾西讲：管仲得到了齐桓公的信任，并且那么长的时间，而做到的功勋业绩却那么卑微，那么小。言下之意，曾西是不愿意跟管仲去相比的，因为他认为管仲所做的事情，微不足道。</span></p><p><span>我们这里不禁要有疑问了，管仲是很伟大之人，他帮助了齐桓公称霸天下，九合诸侯，并且把齐国治理得很好，怎么能说他的功业很卑微呢？</span></p><p><span>我们在《论语》当中讲过，孔子对于管仲的看法有赞美，同时也有批评。赞美的地方，说管仲大仁大义，如果没有管仲，我们现在可能已经沦为夷狄，已经没有了文化，所以说他是大仁大义的，并且他辅佐齐桓公称霸天下，不动刀兵。但是也说过管仲不知礼，不知俭，对于君主没有礼节，并且平时的生活作风，也不够节俭。</span></p><p><span>我们再来看这里的曾西，他认为管仲所做的功业是很卑小的，所以不愿意拿自己与他相比。我们这里要讲一个话题了，为什么儒家之人，并不认同管仲的做法呢？这里面是有原因的，在那个时候治理国家，通常有两条策略，第一称之为霸道，第二称之为王道。</span></p><p><span>管仲辅佐齐桓公称霸天下，用的是霸道，什么叫做霸道？也就是以武力征服天下，我让我自己的武力变得更强。我掌握绝对的话语权，代天子发号施令，这就叫霸道。但是王道所走的路，是截然不同的。我们比如说文王，比如说商汤，这些人走的是王道，再比如说尧、舜、禹。</span></p><p><span>何为王道？就一个出发点，一切以百姓的利益为先，一切都是为了百姓着想。用《大学》的话叫做亲民，也叫如保赤子，不停地去帮助百姓，从百姓安居乐业的角度去出发，去实行王道，而天下百姓自来归服。</span></p><p><span>我们看无论是齐宣王还是梁惠王，问到孟子该如何治理国家？孟子一直讲的都是王道，也就是施仁政，不要靠自己武力的强大，去征服天下，而是要对百姓更好，让百姓生活得更幸福，其他地方的百姓，自然愿意来你这里生活，这就是王道。</span></p><p><span>从曾西的角度看来，也是一样的，管仲走的是霸道，不值一提，而儒家推行的是王道，不要想着去称雄天下，也不要去用武力去压服，或者压制别人，而是不停地对百姓做得更好，去想着发展齐国的经济，发展齐国的军事，出发点和王道都是不相同的。</span></p><p><span>王道的出发点，一切都是利民的，利益他人的，而国家自然变得强大。所以从最本质上的出发点，就不相同，故而曾西不愿意拿自己和管仲去比较。</span></p><p><span><strong>尔何曾比予于是！曰：管仲、曾西之所不为也，而子为我愿之乎？</strong>又重复了一句加强语气，你怎么能拿我和他相比呢？接下来孟子作了总结，说曾西是不愿意做管仲所为的事情，而你以为我就愿意那样去做吗？</span></p><p><span>孟子表达了自己的想法，他引用了曾西过去所发生的一件事情，告诉公孙丑，我和曾西的想法是一样的，你以为我愿意和管仲相比吗？我是完全不愿意的。因为我们主张的是王道，实行的是仁政，而管仲治理天下，主张是用霸道，用武力掌握绝对的话语权。</span></p><p><span>正所谓道不同不相为谋，没有谁对谁错，或者谁的更好，谁的不好，只是我们整个的主张并不相同。像我们现在也是如此，我们不是说别人的想法不够好，或者只有我们的想法才是正确的，只不过我们的主张不一样。</span></p><p><span>有的人说，我把我的产品做得更优质，我用我的产品去服务顾客，我赚取更多的利润，没有错误。但是学习儒家文化的人，我没有想去赚取更多的利润，而是想我如何去帮助更多的人，以帮助别人为目的，去调整自己做事情的方向，如此我那个利润是自己来到，而我不需要去强求。所以是完全两个思维，我们不讲对错，只是讲各不相同，而孟子主张的是王道，所以并不愿意与管仲相比。</span></p><p><br/></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-3 久则难变",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-3 久则难变</strong></span></p><p><span><strong>曰：“管仲以其君霸，晏子以其君显。管仲、晏子，犹不足为与？”曰：“以齐王，由反手也。”曰：“若是则弟子之惑滋甚。且以文王之德，百年而后崩，犹未洽与天下；武王、周公继之，然后大行。今言王若易然，则文王不足法与？曰：“文王何可当也，由汤至于武丁，贤圣之君六七作，天下归殷久矣，久则难变也。”</strong></span></p><p><span>我们来回顾上一讲，孟子与公孙丑之间的对话，公孙丑问孟子一个问题，如果由老师您来当政，是否可以恢复到管仲和晏子那个时候的功业？公孙丑问这句话有两种感情在其中，第一是爱国之情，因为公孙丑是齐国人，所以他希望齐国变得更加兴盛，可以兴盛到齐桓公那个时候，称霸于诸侯，可以像齐景公那个时候，齐国是名扬天下的。</span></p><p><span>第二种感情叫师生之情，他希望自己的老师可以在齐国当政，可以把齐国的功业恢复到以前的那种情况。故而问了孟子这样的问题，但是没有想到老师却不屑于与管仲，相提并论，并且引用了曾西身上发生的事情来作对比，并不愿意跟管仲、晏子相比较，因为管仲走的是霸道，而孟子儒家文化提倡的是王道。</span></p><p><span>如何对百姓更好，爱民如子而称王天下？这里涉及到两个角度的问题。首先公孙丑的角度是，自下而上地去看待，比如说我作为一个齐国人，我希望我的国家变得更兴盛。比如说我觉得管仲和晏子的功业做得很多，这是自下而上，他是仰视着看。但是孟子则不同，他是自上而下的，去看待这个问题。</span></p><p><span>他通过学习儒家文化，通过从孔夫子那里学习的王道仁政，他学习的是尧、舜、禹、汤、文王、武王、周公这些人的德行，所以他站在王道的角度往下看，他是不屑于去做这样的事情的。</span></p><p><span>因为两个人的角度，看到的观点并不相同，在孟子和曾西的眼中，管仲和晏子做得事情是微不足道的，并不足够好。但是公孙丑觉得他们已经很伟大，做得事情已经很好，故而他依然是不解。</span></p><p><span>所以接下来继续的问道：<strong>曰：管仲以其君霸，晏子以其君显。</strong>说管仲辅佐齐桓公，让他称霸于诸侯，而晏子辅佐齐景公，可以让景公名扬天下，声名远扬。</span></p><p><span><strong>管仲、晏子，犹不足为与？</strong>难道管仲和晏子还不值得学习吗？为何值得学习呢？在公孙丑的眼中很简单，因为管仲辅佐齐桓公，所以可以称霸于诸侯，因为晏子辅佐了齐景公，所以可以让君显，也就是声名远扬。说这样的人难道不值得我们去学习吗？如果这样的人都不值得我们去学习，我们到底该学习什么呢？</span></p><p><span><strong>曰：以齐王，由反手也。</strong>孟子讲到，如果以齐国的能力，以齐国国土的大小，以齐国的兴盛，要想称王于天下，易如反掌，就像这个手掌，我们把他反过来，如此简单。</span></p><p><span><strong>曰：若是则弟子之惑滋甚。</strong>这个时候公孙丑讲了，老师如果照您这样说，弟子我心中的疑惑就更甚了，怎么可能称王天下，是易如反掌的事情？</span></p><p><span><strong>且以文王之德，百年而后崩，犹未洽与天下。</strong>这就是公孙丑的困惑了，如果老师您认为齐国称王天下，是易如反掌的事情，我想问的是以周文王那么大的德行，百年而后崩，文王活了那么久，也没有完全让天下臣服。</span></p><p><span>历史有记载，文王是活到九十多岁的，未洽于天下，这里的洽是周遍，遍布的意思。也就是文王那么大的德行，治理国家那么久，也没有遍布天下，让天下的百姓去臣服。所以公孙丑心中的困惑是很深的，怎么齐国想要称王天下，就易如反掌，以文王那么大的德行，经营了那么久，还不能称王于天下？</span></p><p><span><strong>武王、周公继之，然后大行。</strong>说文王在世之时，并没有周遍天下，并没有称王天下，而是武王和周公继承了文王的德行和遗志，然后大行。这个时候才大行于天下的，这里公孙丑在讲文王以及武王，以及周公，况且还不止这些。</span></p><p><span>我们经常讲到太王，也就是从文王的祖父开始，已经都是贤明之君，都是大德之人。需要历数这么多代贤君，才可以成王天下。</span></p><p><span><strong>今言王若易然，则文王不足法与？</strong>今天我们讲，称王天下如此的简单，难道文王也不值得我们学习和效法吗？</span></p><p><span>我们再来回顾这段话，公孙丑的疑惑，公孙丑认为管仲和晏子功业是很大的，是值得学习的，但是孟子觉得管仲和晏子并不值得效法，自己也不屑于与他们去相比较。因为孟子认为以齐国当下的情况，要想称王，走王道、施仁政，是易如反掌的事情。</span></p><p><span>这个时候公孙丑的困惑，就变得更深了，如果说称王天下这么简单，我觉得这个道理不正确，因为以文王的德行，在他在世之时，都没有称王天下。而是武王、周公继之，然后大行。可是今天老师您却认为称王天下，如此简单，那难道说周文王的德行和周文王称王天下的方法，也不值得我们去学习和效法了吗？</span></p><p><span>接下来整个这一段，都是孟子回答公孙丑的疑惑。首先讲了一句话：<strong>文王何可当也。</strong>怎么能和文王相提并论呢？没有办法与文王去相比较的。接下来孟子要开始讲，为什么文王在世之时，并没有称王于天下。</span></p><p><span><strong>由汤至于武丁，贤圣之君六七作。</strong>孟子从商汤开始讲起，商朝的开国之君，由汤到武丁中间出现了六七位贤德之君。</span></p><p><span><strong>天下归殷久矣，久则难变也。</strong>因为从商汤到武丁，出现了六七位贤德之君，所以天下归殷久矣，天下的百姓是诚心归服于商朝的。久则难变也，因为归服的时间久，所以他是很难改变，很难被推翻的。因为从商汤到武丁之间，这几位贤君都是为百姓去着想的，所以江山很稳固，百姓安居乐业，所以久则难变也。</span></p><p><span>那我们这里要来延伸讲讲，久则难变也，这个观点在我们生活当中极其重要。比如说一个人的习惯，长久了以后是很难改变的。我们举例子，即使一个人到国外生活多年，依然会用自己小的时候，或者说过去吃的食物习惯和方式去生活。</span></p><p><span>再比如说，一个人的乡音难改，无论你去外地多长时间，多久，你乡音一直都是在的，这就是久则难变也。我们再举个例子，比如说两个人在一起相处久了之后，就形成了习惯，这个人突然有一天离开你的身边，你更多的是不适应，不舍，也就是没有办法习惯。</span></p><p><span>再比如说，生活当中我们也是一样的，当你的行为产生了一个习惯以后，时间越久，越难以改变；比如说，我们写字的握笔方式，即使他不是正确的，但是我们长久以来，都是这样的习惯，即使有人告诉我们，正确的拿笔的方式，我们也很难去改变。</span></p><p><span>再比如说，我们一个人，如果遇事总是喜欢发脾气，总是喜欢抱怨，这也是一种习惯。所以每当遇事情之时，我们都是抱怨的，都是发脾气的，都是以暴力的方式去解决，这就是习惯。所以我们明白这个道理以后，要想改变自己当下的习惯，是需要下大的决心才可以的，一方面是决心，另一方面就是足够的时间，才可以去改变。</span></p><p><span>我们再比如说，一个人总有拖延的习惯，注意这是习惯，因为长久以来形成这样的习惯，故而很难改变。如果我们想改变拖延的习惯，需要有巨大的决心，再加上时间，才会让我们的习惯加以改变。所以这里我们要明白一个道理，我们人是被习惯所支配的，被习惯所掌控的。</span></p><p><span>很多时候，明明不愿意这样去做事情，但是莫名其妙的，就被我们的习惯支配着，又变成了这个样子。所以我们要让好的习惯，去支配我们的生活，不要养成一些坏的习惯，从良好的习惯开始，否则时间越久就越难改变。</span></p><p><span>这是我们用来修正自己，如果我们反过来去观察别人也是一样的，我们通过别人的思维方式，通过别人的讲话，通过别人的行为，我们也可以看到对方的习惯。如果这个习惯我们是可以善加利用的，他就会向好的方向去发展，如果我们懂得去帮助和改变他人，就要懂得从他人的习惯开始下手。</span></p><p><span>我们举个例子，比如说我们的孩子，我们想让他将来变成什么样的人？那么从小我们就要让他养成什么样的习惯。举个例子，我们想让孩子心目中有别人，在生活当中遇到事情的时候，我们就要经常的去教导他，去引导他，去陪伴他，让他懂得为别人着想，久而久之他就会形成习惯，那么长大以后，他就会懂得为别人着想。</span></p><p><span>再举个例子，我们将来想让这个孩子变成一个有礼貌的人，我们从小就要去引导他，懂得与人打招呼，然后做事情懂得守规矩，长大以后他自然就变成了这个样子。所以无论是对我们自己也好，或者我们是教孩子也好，教我们的学生也好，都要养成良好的习惯。</span></p><p><span>养成良好的习惯，就会成为一种自然，而时间越久越不会被改变，就形成了惯性。我们再回到文中，是因为从商汤到武丁，有六七位贤君，所以天下百姓是诚心归服的，而归服的时间越久，就越难被改变，想推翻商朝，是很困难的事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-4 贤人相辅",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-4 贤人相辅</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。纣之去武丁未久也，其故家遗俗，流风善政，犹有存者；又有微子、微仲、王子比干、箕子、胶鬲，皆贤人也，相与辅相之；故久而后失之也。尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。</strong>武丁让诸侯来朝见，拥有整个天下，犹如在掌上转动东西一样，就是如此简单，为什么如此简单？因为从商汤到武丁，打下了深厚的基础，并且武丁亦是一位贤君，在武丁这个时期，是被称为武丁盛世的。他自己又是一位贤君，并且从商汤以来一直积累德行，施行为天下百姓着想的仁政。所以到武丁这个时期，掌管天下，就像在掌中运东西一样，如此简单。</span></p><p><span>这里为什么要提到武丁呢？首先因为武丁这个时期是盛世，并且到了武丁这个时候是殷商；</span><span>最后一位贤德之君，从武丁开始一直到商纣王，纣王以后商朝就灭亡了。这个期间又经历了大约一百二十年，我们去看这个时间段，从商汤到武丁，经历了六七位贤君，所以天下是稳固的，治理天下易如反掌。</span></p><p><span>但是从武丁开始到商纣王，殷商灭亡又经历了大约一百二十年的时间，也就是从武丁之后，一代一代商朝的君王，开始失去了德行，开始不施仁政，所以到商纣王那个时候会灭亡。我们就看到了一件事物的规律，他不是一下兴盛，亦不是一下衰亡，他是有个循序渐进的过程。</span></p><p><span>比如说，一个企业经营得很好，不是一年两年的努力，是长时间的努力，逐渐地达到了顶峰。一个企业开始变得衰退，到没落，最后到灭亡，也不是一朝一夕的，是从顶峰一代不如一代，一件事情不如一件事情，最后到灭亡。</span></p><p><span>我们说两个人的感情，也是如此，他从一开始的平淡，不停地升温，最后感情很深厚很稳固。如果随着一些事情的发生，或者时间的推移，两个人经历的事情，越来越不和谐，最后可能导致两个人的感情破裂，所以我们明白这个事物的规律，是让我们懂得及时觉察的智慧和能力。</span></p><p><span>我们要学会在一件事情没有呈现结果之前，及时地觉察到问题出在了哪里。我们再比如说孩子，很多家长会讲，说孩子突然变得叛逆了，其实并不突然，他从不叛逆到叛逆中间，是有一个时间线的，只是我们没有及时地察觉到，没有及时地发现问题，当结果呈现出来的时候，</span></p><p><span>已经晚了。</span></p><p><span>还有人说，我的爱人怎么突然开始不爱我了，他突然开始对我不好了，其实并不是，中间也是有一个过程，是有一个时间线的，只不过我们没有及时地去觉察到，去看到问题。这个时间线的长短，根据事情的大小有所不同。</span></p><p><span>比如说，一个朝代，他可能这个时间线是一百年，是两百年。对于我们企业来讲，可能是三年五年，十年乃至于二十年。对我们的家庭来讲，可能是一年，两年，三年。一些更小的事情，可能是一个月，两个月，三个月，甚至是一天，两天，三天。所以无论任何一件事情。都是有时间线的，都是有过程的，都是有迹可循的，我们要从中去看到规律和痕迹。</span></p><p><span><strong>纣之去武丁未久也，其故家遗俗，流风善政，犹有存者。</strong>这里讲到了纣离武丁，时间并不太久远，一百多年的时间，但是在这一百多年的时间，其故家遗俗，流风善政，犹有存者。故家是指过去的，世代相传的，那些好的遗俗还在。流风善政，过去从商汤到武丁，那些为政的，那些善良的，那些为民请命的，还留下来了，所以叫犹有存者。</span></p><p><span>故而到商纣王时期，虽然已经无道，但是还有很多百姓，并不愿意离开商朝，也并不愿意推翻商朝，并且最重要的还给商纣王，遗留下来很多好的东西。比如说仁政，比如说国家的基础，再比如说，更重要的是贤德之人还有很多。</span></p><p><span><strong>又有微子、微仲。</strong>微子和微仲都是商纣王的兄长，商纣王是第三子，但是为何商纣王可以继承了君位？因为微子和微仲的母亲，在生微子和微仲之时，还不是王后的身份，但是在生商纣王之时已经变成了王后，所以这个时候纣王就变成了嫡子。以前是立嫡子为君的，故而商纣王就做了君主，但是微子和微仲是两位贤德之人，一起辅佐商纣王。</span></p><p><span><strong>王子比干、箕子、胶鬲，皆贤人也，相与辅相之，故久而后失之也。</strong>并且还有王子比干和箕子，王子比干和箕子是纣王的叔父，胶鬲是贤臣，臣下的身份。以上所讲的这些都是贤者，因为有这些贤者在，故而想要推翻商纣王，并没有那么容易。因为有这些贤人去辅佐纣王，故而久后失之也，所以要很长的时间，才会失去商朝，才会灭亡。</span></p><p><span><strong>尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong>没有一寸土地不是归纣王所有，没有一个百姓不是他的臣子，然而文王只有方圆百里之地起家，是以难也。</span></p><p><span>我们整个再来看，这一段孟子的回答，回答了公孙丑。为什么以文王的德行，在世之时没有称王于天下呢？并不是文王的德行不足够，我们怎么敢和文王去比德行呢？是因为从商汤到武丁，有六七代贤君，所以天下归商久矣，久则难变。</span></p><p><span>这个是很难改变的，况且从武丁到商纣王的时间并不久，一百多年的时间。所以以前的一些好的仁政，还有一些遗俗，并且还有一些贤人，共同留下来辅佐纣王，而文王只是从方圆百里的地方起家。</span></p><p><span>那个时候没有一寸土地，不是纣王的，没有一个臣下不是纣王的，所以文王的起家才如此艰难。并不是文王的德行不够大，而是商朝的根基过于深厚，所以文王在世之时，并没有能称王天下，而需要武王和周公继之。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-5 乘势而为",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上①-5 乘势而为</span></strong></p><p><strong><span>齐人有言曰：‘虽有智慧，不如乘势；虽有镃基，不如待时。’今时则易然也，夏后、殷、周之盛，地未有过千里者也，而齐有其地矣；鸡鸣狗吠相闻，而达乎四境，而齐有其民矣，地不改辟矣，民不改聚矣；行仁政而王，莫之能御也。</span></strong></p><p><strong><span>齐人有言曰：虽有智慧，不如乘势；虽有镃基，不如待时。</span></strong><span>我们再来回顾，孟子与公孙之间的对话，公孙丑问孟子如果您来执掌齐国的国政，可以再现管仲和晏子的霸业吗？孟子是不屑于和管仲、晏子相比较的，正是因为管仲和晏子兴的是霸业，而孟子想要推行的是王道。</span></p><p><span>接下来公孙丑就有了疑问，如果实行王道，时间会不会太久？即使以文王的德行，也要武王和周公之才，可以实行王道，他不是一代人可以实现的。接下来孟子又说，不是这样的道理，因为文王那个时期，他从很小的地方开始起家，虽然经历了很多艰难，但是最后不也称王于天下了吗？</span></p><p><span>为什么文王那个时候很难，是因为从商汤到武丁打下的基础很深厚，而从武丁到商纣王仅有一百多年的时间，所以还留下了很多贤臣，还留下了很多仁政，留下了很多故家遗风，所以他是很难的。</span></p><p><span>但今天的情形不同，今天的齐国有广阔的土地，有众多的百姓，并且是万乘之国，而且很久都已经没有出现仁君，去推行仁政，现在是最合适的时机。如果这个时候，实行仁政等于乘势而为，做事情是易如反掌的，想要称王于天下，是非常简单的事情。</span></p><p><span>所以这里孟子在讲齐国的现状之前，讲了一句齐国的谚语：虽有智慧，不如乘势；虽有镃基，不如待时。我们看乘势，何为乘呢？举个例子，我们说乘车，也就是我们自己不用动，车子在动，就可以带我们去想要去的地方；比如说我们乘飞机，我们可以不动，但是飞机它在动，就可以带我们去那个地方，这称之为乘。</span></p><p><span>我们接下来再看，什么叫做势呢？我们经常讲一个成语，叫大势所趋，就是众多人推动着一件事情，众多需求下推动的一件事情，它是自然发展的；我们乘着别人的需求，就可以到达那个地方。</span></p><p><span>比如说孟子讲的，今天齐国如果实行仁政，称王天下，是易如反掌的事情。因为百姓生活在水深火热之中，已经太久了，连年战乱，这个时候的百姓是需要安居乐业的生活，如果这个时候实行王政，这就叫大势所趋。</span></p><p><span>我们再来讲一讲，势的几个特点，首先势是变化的，一直在动；我们举个例子，我们见过海浪，上一秒它可能离我们还很远，那下一秒它就来到了我们的眼前，再下一秒它可能离我们又很远，这就叫势，所以势它是波动的，是变化的。</span></p><p><span>我们再讲，势还有什么特点呢？比如说杯子从桌子上落下来，我们可以把它接得住，这个杯子落下的过程就叫势，但是因为它的势比较小，所以我们可以接得住；但是如果落下来的这个东西比较大，我们用手是没有办法接住的，也就是落下的东西越大，势力也就会越大，这种力量是不可被阻挡的。</span></p><p><span>我们再去看，文王武王之所以可以创建周朝，就是因为势头不可挡，叫势不可挡。比如说，商纣王如果不是荒淫无道，如果百姓不是生活在水深火热之中，文王、武王即使再有德行，也难以得到天下。这是因为所有的百姓生活的并不好，他们是不想生活在商纣王的统治之下，人们是有需求的，这就是大势所趋。</span></p><p><span>因为百姓有太多的怨言，这个时候如果有人是兴仁政的，是有德行的，百姓看得到，自然拥护。文王和武王故而可以得天下，也就是势越大，越不可阻挡。我们知道势的第二个特点，不可被阻挡，不可被改变，它不是以个人的意志或者能力可以转变的。</span></p><p><span>我们再讲势还有什么特点呢？它是积少成多的，最后就成为了势。本来他可能很少，但是需求的人越来越多，或者聚集的东西越来越多，就形成了大势。</span></p><p><span>我们举个例子，比如说过去这些年，房地产行业的兴起，为什么房子会越卖越贵？因为人们生活条件好了以后，都想改善生活，想要买房子的人变得越来越多，所以房价就会不停地上涨，这就叫大势。它不以个人的意志为转移，不是有个别人抗议，觉得房子贵，就可以让房价停下来，因为有太多的人需求，积少成多在推动着这件事情。</span></p><p><span>什么时候房价会落下来呢？需求的人越来越少，大家不再购买房子，它自然就落下来了，这就叫势。所以我们看势它就像一个抛物线一样，最开始处低位，逐渐地上升到高位，到最高的时候再开始下降。</span></p><p><span>我们再比如说，这些年互联网的兴起，是不是一样的道理？以前人们都喜欢在实体店，喜欢逛街，以这种形式去购物，但是随着这种形式长久时间的不变化，人们已经开始没有新鲜感，这个时候开始出现了网络，一开始人们是不接受的，但是随着人们更多地开始追寻一些新鲜事物，逐渐地需要的人变得越来越多，再积少成多的过程，就形成了势。</span></p><p><span>我们这个时候再来回顾，势的几个特点，首先它是变化的，它是一直在动的；其二，这种势越大，这种力量就不可阻挡，无法被改变；其三，它是积少成多的过程。</span></p><p><span>孟子在这里之所以引用这句谚语，就是讲齐国现在正在势头上，如果懂得乘势而行，顺势而为，实行王政去推行仁道，这个时候称王天下是易如反掌的事情。</span></p><p><span>我们在生活当中，如何才能乘势而起呢？我们放到最后，看看孟子是如何讲的？虽有镃基不如待时，镃基指的是锄具，也就是农民耕种所用的锄头，虽有锄具不如待时，你不如待时而动。什么意思？即使你有好的锄具，如果不到耕种的季节，也是没有作用的。也就是齐国即使再强大，但是你不能等到好的时机也没用。</span></p><p><span>比如说，文王即使有德行，如果不是因为商纣王暴虐无道，这个时候你也没有办法得到天下，这就叫时机。所以我们要知道做任何一件事情，都要等待合适的时机，而齐国现在有势，并且正处在合适的时机，只不过看是否能抓住这个时机。</span></p><p><span>我们再讲生活当中很多事情都一样，我们要懂得乘势而为，要懂得抓住恰当的时机去做事情。</span></p><p><strong><span>今时则易然也。</span></strong><span>今天齐国正处在合适的时机上，为什么孟子说现在的齐国处在合适的时机上，我们看孟子接下来是如何讲的？</span></p><p><strong><span>夏后、殷、周之盛，</span></strong><strong><span>地未有过千里者也。</span></strong><span>夏、商、周之盛，在他最兴盛的时候，地也没有超过方圆千里。</span></p><p><strong><span>而齐有其地矣。</span></strong><span>说今天齐国所拥有的土地，方圆千里，即使过去夏商周在最鼎盛的时期，也没有今天齐国的土地这样辽阔。</span></p><p><strong><span>鸡鸣狗吠相闻，而达乎四境。</span></strong><span>鸡鸣狗吠相闻，它形容的是百姓密集的程度，鸡叫和狗叫可以互相听闻，也就是邻居会比较多，并且达乎四境。不是只有某个地方，人员密集到这种程度，可以到齐国四周的边境，我们可以想象这样一个画面，百姓是很多的。</span></p><p><strong><span>而齐有其民矣，地不改辟矣，民不改聚矣。</span></strong><span>说齐国现在已经有这么多的百姓了，今天齐国不需要再去扩展土地，不需要去增加更多的百姓；因为齐国现在有方圆千里的土地，并且百姓生活的密集程度，已经很多了。所以今天齐国不应该再去扩展土地，也不要去想着如何增加民众，只需要把现有的这些百姓，让他们生活得更好，就足以称王于天下。</span></p><p><strong><span>行仁政而王，莫之能御也。</span></strong><span>如果这个时候齐国实行仁政，是没有办法阻挡的。我们再来回顾这一段，孟子讲齐国想要称王天下，易如反掌，为什么？首先齐国的土地足够大，百姓足够多，即使夏、商、周在最兴盛之时，也没有这么多的人，也没有如此辽阔的土地。</span></p><p><span>这个时候的齐国，不需要想着再向外扩张，不需要称霸于诸侯之间，只需要去兴王政，可以让百姓安居乐业，让百姓过上更好的生活。而其他的国家还在战乱之中，那百姓自然想要来齐国生活，怎么还需要招集更多的百姓，怎么还需要扩展土地呢？</span></p><p><span>如果这个时候，齐国去实行王道，兴仁政，是不可被阻挡的，这就是大势所趋。不会以人的意志为转移，没有办法阻挡这种势。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-6 事半功倍",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上①-6 事半功倍</span></strong></p><p><strong><span>且王者之不作，未有疏于此时者也；民之憔悴于虐政，未有甚于此时者也。饥者易为食，渴者易为饮。孔子曰：‘德之流行，速于置邮而传命。’当今之时，万乘之国行仁政，民之悦之，犹解倒悬也。故事半古之人，功必倍之，惟此时为然。</span></strong></p><p><strong><span>且王者之不作，未有疏于此时者也。</span></strong><span>王者之不作，指的是没有仁君出现；未有疏于此时者也，没有等待这么久的了，也就是从周朝之后一直到战国期间，这几百年并没有王者出现。我们再去看武王那个时期，从商汤到武丁，六七位皆是贤君，都是仁德的君主。</span></p><p><span>从武丁到商纣王，经历了一百多年，所以这个时候文王和武王的出现，仁德之君替代了商朝，建立了周朝，中间只有一百多年的时间。所以文王得天下，才会比较艰难，但是今天齐国的现状不同，又有辽阔的土地，又有众多的百姓，而且还有这么久都没有出现仁德之君，百姓自然是渴望的。</span></p><p><strong><span>民之憔悴于虐政，未有甚于此时者也。</span></strong><span>百姓生活在这种虐政的压迫之下，没有比这个时候更甚的了。</span></p><p><strong><span>饥者易为食，渴者易为饮。</span></strong><span>饥饿的人是很容易满足的，你给他什么样的东西，他不会挑剔；渴了很久的人，你给他什么样的喝的都可以，是非常容易满足的。这两句话就是在形容现在天下的百姓，他们已经挨饿饥渴很久了，所以他们渴望有仁君的出现。</span></p><p><span>这两句话我们往生活当中，延伸一下，我们经常讲一个词语，叫饥不择食，当我们在饥饿之时，吃食物是不挑剔的。举个例子，如果我们的孩子从小缺乏关爱，从这方面来讲，就是饥饿的，那就会饥不择食，长大了以后，只要别人给他一点关心，他就容易深陷其中，进而上当受骗，所以我们可以看到身边很多的人，从小因为缺乏很多关爱，长大了以后，就容易被骗，他容易走错路。</span></p><p><span>同样我们再反过来讲，如果一个孩子在一个溺爱的家庭当中长大，那么在将来的工作和生活当中，他就接受不了挫折，但凡有一点挫折，他就难以接受，他会产生对抗，甚至产生自卑的心理，那也就是我们不能让一个孩子过饥或者过饱。你给他没有关爱，没有关怀，这是不行的，他会内心匮乏，可是如果你给他太多的溺爱，将来他又没有办法，承受挫折。</span></p><p><span>所以我们要懂得取中，莫偏于一端。那不光对孩子如此，我们在生活当中和其他人的交往，也是一样的，我们不能对一个人过于好，过于好的时候，就会变成溺爱，变成偏爱；但是我们也不能对一个人，漠不关心，这个时候，他从这方面是匮乏的，就会饥不择食。</span></p><p><span>为什么现在很多感情，容易出问题？就是我们给对方的关心关爱，在乎的太少了，这个时候他会从另外一个地方，来寻求被关注，寻求被关心。所以我们的感情，就容易出现缝隙。</span></p><p><span>我们从这句话再来延伸，我们对自己也是一样的，我们不能对自己太过于好，我们会变得很矫情；我们也不能对自己太不好，我们会容易生活在自卑和自我否定当中，我们体会不到生活当中的美好和快乐，故而我们要取中。</span></p><p><span>不能对自己，不加关心，同时也不能对自己，过于放纵。我们去取合适的点，包括我们去做事情、学习或者我们去做事业，都是一样的，我们不能太过于用力，当我们太过于用力的时候，容易放弃，因为我们体会不到幸福。但是我们也不能太过于松散，如果我们太过于松散，我们就不懂得时时刻刻，保持进步。同样还是折中，不能让我们自己，饥不择食，同时也不能让我们自己，过于饱、过度，这都是不正确的。</span></p><p><strong><span>孔子曰：德之流行，速于置邮而传命。</span></strong><span>置是设置；邮是驿站。引用了孔夫子的话，德政流行的速度，要超过于设置驿站，去传播政令，以前驿站是最快速的，可以传达政令的方法，而德政的流行，要比驿站的传播速度更快。</span></p><p><strong><span>当今之时，万乘之国行仁政，民之悦之，犹解倒悬也。</span></strong><span>说现在这个时候，万乘之国去实行仁政，百姓是非常高兴的，就像解救倒挂着的人，我们可以想象得到，一个倒挂着的人，他是何其得痛苦难受。</span></p><p><span>这句话同样是来形容，现在天下的百姓，他们生活在倒悬之中，每天过着担惊受怕的日子，并且食不能饱腹，衣不能保暖，每天都要承受着战乱之苦，并且丧事也没有人去办理，家庭也没有办法很好的去生活。如果这个时候，有一个万乘之国去推行仁政，百姓一定闻风而来。</span></p><p><strong><span>故事半古之人，功必倍之，惟此时为然。</span></strong><span>所以做了总结，今天的事情，只要做到古人的一半，功效是必然要加倍的，此时就是最合适的时机，这是孟子与公孙丑对话的全文。</span></p><p><span>我们现在再来看，孟子所言说现在的齐国，想要称王天下，易如反掌，是因为齐国有足够大的土地，足够多的百姓，并且现在正在合适的时机上。因为很久没有仁德之君的出现，百姓生活在虐政之中，没有比此时更甚的，所以这个时候，如果齐国去行仁政，百姓是非常开心的，犹解倒悬之苦。</span></p><p><span>齐国如果去实行仁政，天下的百姓，自然会知道，这种仁政流行的速度，比驿站传播政令还要快。但是我们去反观这个时候齐国，以及其他的诸侯国，大家都在想着去称霸于天下，都想着用武力不停地扩张，去解决问题。</span></p><p><span>但是孟子则不这样认为，孟子认为恰恰是在这个时机，万乘之国才要去兴仁政，才要去兴王道。他比文王那个时期，要更简单得多，所以才会有对公孙丑所言的那一段话，他不屑于与管仲相比，因为现在的时机也不同，为什么要去称霸于诸侯，而不去兴王道，让百姓自然归服？这是最简单的道路，是乘势而行，顺势而为。</span></p><p><span>我们从这段话当中，再来延伸八个字，乘势待时，事半功倍。如果我们懂得去乘势而行，懂得等到合适的时机，事半功倍。我们只需要做一半的事情，而得到的结果和功效，是成倍的在增加。</span></p><p><span>我们举例子，在房地产正在兴起的时候，如果我们懂得看到大势所趋，我们买一个房子放在那里，什么都不用做，这就是事半功倍。再比如说，互联网在兴起的时候，如果我们看到了商机，我们去做这样的事情，事半而功倍，很简单就可以把这件事情做好。</span></p><p><span>再比如说，早些年做实体的生意，也是如此。那个时候，只要你开一个什么样的店铺，就可以很容易地赚到钱。但是当大势开始没有的时候，你再做事情就会变得很艰难，所以我们这里要懂得去看清形势，任何一件事情的发生，都有其规律可言。我们要懂得找到那个规律，并且乘势，就可以事半而功倍。</span></p><p><span>我们这里再来看齐国，为何齐国现在可以乘势而为？是因为它有足够多的土地，方圆千里，并且它有足够多的百姓，鸡鸣狗吠相闻，达乎四境。我们从这里要学习到一点，要想懂得乘势而为，首先要让自己变得更强大，才可能蓄势待发。</span></p><p><span>举例子，齐国因为现在足够强大，所以才可以乘势而为。比如说房地产在兴起的时候，即使我们知道这是大势所趋，如果我们手里没有钱，是不是也没有办法？即使我们看到了互联网正在兴起，但是我们对这方面一无所知，是不是也没有办法？即使我们看到实体的生意很好做，但是我们没有钱去投资，我们对它一窍不通，是不是也没有办法？</span></p><p><span>乘势的前提是，我们在强大和提升自己，我们有智慧看得清楚，这叫提升自己。我们有一定的实力，可以参与其中，这是提升自己，所以提升自己，是永恒不变的话题，只有我们懂得提升自己，有更多的智慧，我们才能看清楚下一个势的到来。</span></p><p><span>我们在不停地提升自己的能力，比如说某方面的技能，比如说经济的实力，比如说智慧，比如说人脉关系，这都是提升自己的范畴，我们在不停地提升自己，才能看到下一个形势的到来，下一个行业或者事情的兴起，我们才有足够的能力，乘势而为。</span></p><p><span>我们在没有事情的时候，我们就要学会蓄势待发，我们不停地去明德和亲民，让我们有足够多的德行，让我们有更多的智慧，让我们有更加专业的技能，这个时候大势来的时候，我们才可能乘势而行，事半而功倍。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-1 不动心之源由",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上2-1 不动心之源由</span></strong></p><p><strong><span>公孙丑问曰：“夫子加齐之卿相，得行道焉，虽由此霸王不异矣。如此则动心否乎？”孟子曰：“否。我四十不动心。”曰：“若是，则夫子过孟贲远矣！”曰：“是不难。告子先我不动心。”曰：“不动心有道乎？”</span></strong></p><p><span>课程开始之前，我们先来探讨一个话题，这个话题关于心，我们去思考在什么样的情况下我们会动心？</span></p><p><span>举例子，比如说，我正在追求某件事情，这件事情是我梦寐以求的，它在即将实现之时，看看我们的心会不会动。</span></p><p><span>比如说，我特别思念一个人，我特别想要见到这个人，当我在见到他之前或者已经见到他那个时候，看看我们的心是否会动，也就是我们的心会随着很多事情而波动，进而它会影响到我们的身体。</span></p><p><span>举个例子，比如说，我们觉得我很痛心，就是心动到了一定的程度，我们会觉得很痛。再比如说，很多事情的发生事与愿违，我又没有能力去解决，这个时候我会觉得我的心很堵，我的心像被堵住了一样，我开始变得呼吸都觉得很困难，不顺畅。这都是由于我们的心动了，并且到了一定的程度，它会影响我们的身体和生理的变化。</span></p><p><span>再比如说，我对一件事情特别愤怒，也是由于动心所导致的。再比如说，我特别激动，我特别紧张，我现在特别兴奋，这一切都是动心以后所产生的反应。</span></p><p><span>我们去思考，在什么样的情况下，我们不会动心呢？</span></p><p><span>我们先举个例子，比如说，我们听到一个陌生人或者一个同事，我们之间的关系并没有那么亲近，我们听说他与他的爱人分手了，当事人他会觉得很心痛，他会觉得难以接受，他会沉浸在痛苦当中无法自拔，就是因为他的心在动，所以产生了各种反应，以及各种情绪。这个时候我们作为旁观者，好像我们的心并不会痛，因为我们的心并没有为之所动。</span></p><p><span>再比如说，别人家的孩子考试的成绩不好，这个时候他的家长可能会愤怒，可能很生气，可能觉得很无奈，总之他的心会动。但我们这时候作为旁观者，我们并不会跟着心动，所以我们可以很好的去劝告对方，学习好又不是唯一的出路，我们家孩子既然没有这方面的天赋，你让他做其他的事情就好了，看看他有没有其他的爱好以及特长，可以给他换个方向，你看我们的心是不会为之所动的。</span></p><p><span>诸如此类的事情很多，我们就下了一个结论，事不关己，与我没有关系的事情，我是不会动心的。那么与我有关系的事情，在什么样的情况下，我们的心不为之所动呢？</span></p><p><span>我们举个例子，比如说，我们的手上有一点破损，坏掉了一个很小的口，这个时候好像我们不会为之所动。我们说没关系，破皮而已，不用去理它，或者伤口再大一点，我们说没关系，贴上个创可贴自然就会好。</span></p><p><span>这个时候我们通常不会动心，为什么会这样呢？</span></p><p><span>当我们有足够的力量去解决它，去掌控和驾驭它，我们的心就不会为之所动。比如说，我们去到商场，我们看到一件衣服上面的标价是两千元，这个时候有的人就会觉得太贵了，赶紧走，它不适合我，衣服怎么可以这么贵呢？没有必要买这么贵的衣服，这一刻我们的心是动的，为什么会动呢？因为我们手里的钱财没有足够的力量，这个时候我们心就会为之所动。</span></p><p><span>同样，另外一个人他手里有足够的钱，所以看到这两千元的衣服并不会为之所动，反而会觉得还挺便宜的，只要它适合我就可以了。</span></p><p><span>我们再举另外一个例子，比如说，我面前放了一个重物，重八十斤，我们是一位很有力量的男士，见到他就不会为之所动，我可以轻易地或者说想要搬动它，我就可以去搬动它，因为我有足够的力量。</span></p><p><span>但是如果是一位柔弱的女子，或者一位没有强大力量的人，这个时候我们看到它就会有一点动心，说它放在这里碍事，我要怎么办呢？说谁这么讨厌，把这么重的一个东西，放在这个地方，我们的心就会随之而动。</span></p><p><span>我们又开始下一个结论：第一，事不关己的时候，我们的心是不为所动的；其二，就是我们有足够的力量大于当下所面对的事情，这个时候我们的心就不为之所动。</span></p><p><span>在生活当中，当我们没有足够强大的力量去战胜当下的困难，当下的挫折，这个时候我们的心就会为之所动。它会影响我们的情绪，影响我们的状态，甚至会影响我们的生理和身体的变化。那想要解决这样的困惑和当下的问题，就是我们不停地去强大自己的力量，无论你在哪方面强大，都会相应地让这一类的事情不再发生，我们的心不为之所动。</span></p><p><span>那么学习传统文化，学习圣人教给我们的道理，就是在智慧层面让我们自己变得更强大，这个时候，我们不会为生活当中出现的问题和困难所吓倒，我们的心不会为之所动，我们才可以坦然从容地面对生活。</span></p><p><span>那么接下来这段话，孟子与公孙丑之间探讨的就是如何不动心，我们讲的这一段是抛砖引玉。我们从这一段开始带着这样的思考，我们来看孟子和公孙丑之间的对话，它是层层递进的关系，仿佛我们推开一扇大门，从大门我们一步一步，循序渐进地走到最里面，我们去看这个过程都发生了什么，我们一步一步如何可以升堂入室。</span></p><p><strong><span>公孙丑问曰：夫子加齐之卿相，得行道焉。</span></strong><span>公孙丑问了一个问题，如果让老师您执掌齐国的朝政，加之卿相，位高权重，得行道焉，并且得以推行您自己的政治主张。我们都知道孟子推崇的是王道，如何利益天下之百姓，所以这个时候，公孙丑就问了孟子，假如老师您可以执掌齐国的政治，并且您可以完全按照您自己的主张去行事，按照您自己的思想去治理这个国家。</span></p><p><strong><span>虽由此霸王不异矣。</span></strong><span>如果是这种情况，老师您无论想建立王道，还是想建立霸道，建立功业都已经不足为奇了。我们可以看到公孙丑对于老师的这份笃定和自信，他相信老师如果执掌了齐国的政事，并且可以推行自己的主张，无论想成就王业霸业，无论想建立什么样的功业，都是不足为奇的，轻而易举的事情。我们知道公孙丑这段话可以算是孟子梦寐以求的事情，他一生都在推行王道，都在讲仁政，一心都想实现这样的抱负，可谓心之所想。</span></p><p><strong><span>如此则动心否乎？</span></strong><span>问题来了，公孙丑就问了孟子，如果可以实现您梦寐以求的事情，我想请问，老师您会动心吗？</span></p><p><span>我们看孟子怎么讲？<strong>孟子曰：否。我四十不动心。</strong>孟子说，不会的，即使实现的是我梦寐以求的事情，我也不会为之而心动，我四十岁以后就已经是这个样子了。</span></p><p><strong><span>曰：若是，则夫子过孟贲远矣！</span></strong><span>如果是老师您说的这样，你已经远远地超过孟贲了。孟贲：历史记载是一位十分有力量的勇士，这个人的力量有多大呢？他可以单手与牛搏斗，也就是双手可以分别于两头牛搏斗，并且单手可以把那个牛角拔出，他的力量就这么大。因为古人是尚武的、尚勇的，所以很多人是很赞叹孟贲的这种力量。</span></p><p><span>因为他的力量足够强大，所以他从来无所畏惧，比如说，我可以与牛搏斗；比如说，我可以举鼎。那么在于力量这件事情面前，他是无所畏惧的，最后自己也是死于尚武，因为他无所畏惧，所以只要是面对有勇气搏斗类的事情，他都敢于去向前。</span></p><p><span>我们再回顾刚才我们讲的，如何才能不动心？那么其一，就是事不关己；其二，是我有足够的力量面对当下的这件事情，所以我就无所畏惧，我的心不会为之所动。这里公孙丑讲，如果是，那我觉得老师您是要远远超过孟贲的，因为在公孙丑那里，他觉得孟贲的这种无所畏惧就是不动心。</span></p><p><span>我们看看孟子怎么讲？<strong>曰：是不难。告子先我不动心。</strong>说这件事情确实不难，孟子指的是不动心这件事情，没有什么难的。告子是比我开始先不动心的，告子是墨子的弟子，但是告子并没有留下什么样的著作，只是在《孟子》当中，我们可以了解告子这个人。</span></p><p><span>具体告子是如何做到不动心的？他的不动心与孟子之间又有什么区别呢？他的不动心与孟贲的无所畏惧，又有什么区别呢？我们且往后学习，我们自然可以看到每个人关于不动心，他到底做到了什么样子？他们之间到底有什么样的区别？</span></p><p><strong><span>曰：不动心有道乎？</span></strong><span>这个时候公孙丑开始问了，老师请问不动心有什么样的方法吗？要如何才能做到不动心？在公孙丑看来，不动心的人既然可以有这么多。比如说孟贲无所畏惧；比如说老师可以实现自己梦寐以求的理想，还能不为之所动，并且孟子还告诉公孙丑，如果照你说的孟贲这样去理解，是不难，这个不动心是不难的，告子先于我而不动心。</span></p><p><span>我们这里先有一个伏笔，我们要知道孟子所讲的不动心，和公孙丑所认为的无所畏惧的不动心，是有巨大的差别的。具体有什么样的区别，我们一点一点推开这扇大门，一点一点地去学习和深入的了解。</span></p><p><br/></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-2 养勇之方",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上②-2养勇之方</strong></span></p><p><span><strong>曰：“有。北宫黝之养勇也，不肤桡，不目逃；思以一豪挫于人，若挞之于市朝。不受于褐宽博，亦不受于万乘之君；视刺万乘之君，若刺褐夫，无严诸侯；恶声至，必反之。孟施舍之所养勇也。曰：‘视不胜，犹胜也。量敌而后进，虑胜而后会。是畏三军者也。舍岂能为必胜哉，能无惧而已矣。’”</strong></span></p><p><span>这个时候孟子开始回答公孙丑，回答他的问题，说不动心有方法吗？孟子当然是有方法的。但是我们知道孟子讲话的思维逻辑性是很强的，他会循序渐进地去讲解不动心，会由浅入深，</span><span>所以，我们从浅处先来看孟子是如何讲的。</span></p><p><span><strong>曰：有。</strong>接下来这段话提到了三个人，提到这三个人为什么会不动心。提到不动心，先讲了勇气，一个人只有有勇气，才可能让自己的心不动，我们看关于勇气，这三个人都是什么样的状态。</span></p><p><span>这三个人代表了三个不同的层次和境界，首先提到的<strong>北宫黝之养勇也。</strong>说北宫黝这个人是如何培养自己的勇气，如何培养自己的勇敢的。</span></p><p><span><strong>不肤桡，不目逃。</strong>肤：指的是我们的肌肤；桡：指的是退缩。我们看这三个字，说北宫黝的勇气，他是如何培养的，即使刺伤了自己的肌肤，他也决不退缩。我们平时，当我们皮肤被刺伤之时，我们是本能地想要去退缩，想要去退后。</span></p><p><span>不目逃，即使要刺伤到了自己的眼睛，也决不逃避。我们看这六个字是很难做到。当我们的肌肤面临着被刺伤，或者已经刺伤，决不退缩，当危险已经来到我们的面前，甚至奔着我们的眼睛而来，也决不逃避。</span></p><p><span><strong>思以一豪挫于人，若挞之于市朝。</strong>他为什么会面对危险不退缩呢？思：是他是这样认为的，他是这样思考的；挫：是输的意思；挞：是鞭打；市朝：指的是众人眼目之下，也就是热闹的市集。北宫黝认为如果我有一丝的逃避和退缩，输给了别人，那就相当于被鞭打在热闹的市集之下，这是他不堪忍受的事情，所以，从不允许自己退缩和逃避。</span></p><p><span><strong>不受于褐宽博，亦不受于万乘之君。</strong>褐：指的是衣服；宽博：指的是地位低下之人做的宽袍，所以褐宽博指的是地位卑微的平常人。我们再看这句话就好理解了，说不会受辱于平常的百姓，不会受辱于普通人，亦不受于万乘之君，即使是万乘之君，我也不会在他这里受辱和忍受。</span></p><p><span><strong>视刺万乘之君，若刺褐夫，无严诸侯。</strong>如果去刺杀万乘之君，就像刺杀一个普通百姓是一样的，不会畏惧诸侯。</span></p><p><span><strong>恶声至，必反之。</strong>如果敢有人辱骂于我，一定是反击回去的。我们看对于北宫黝的这一段描述，我们可以看到这个人是有勇气的，他自己仿佛是铜墙铁壁一般，从来不会落败，从来不会退缩，从来不会逃避。并且他没有什么样的区别，无论你刺伤我的肌肤，或者是刺伤我的眼睛，我同样不退缩。无论是对一个普通百姓，还是对于万乘之君，我绝不会输，并且决不忍受屈辱。如果你去让我刺杀一个万乘之君，刺杀诸侯，对于北宫黝来讲，他跟刺杀平常百姓是一样的。无论何人只要对他恶语相向，他是一定会反击回去的，这是北宫黝的这种勇气和培养勇气的方法。</span></p><p><span>其实这种人我们在生活当中亦很常见。比如说，一个力量很大的人，在于比力量这方面他是无所畏惧的，无论对方的身份是高是低，是有钱还是没钱，在于力量这件事情，他决不屈服，</span><span>而且会不停地让自己变得更强大，犹如铜墙铁壁一般。但是我们再去看生活当中，这种人有一种初生牛犊不怕虎的思维在其中，所以他并不是一种成熟的表现。</span></p><p><span>比如说，我们在年轻之时，往往会不服输，认为自己可以改变世界，认为自己可以战胜一切困难，尤其是当我们自己做出一些成绩以后，这种自信就会变得更强大。比如说，我通过自己的努力，让自己的生活变得更好，我们就觉得我们已经很厉害了，并且我们可以让自己变得更好，所以，我们无所畏惧任何困难的出现。</span></p><p><span>比如说，我们在一个工作岗位上，我们通过自己的努力，把这个工作做得很好，我们就认为我们可以一路向上，我们从来不会失败，我们有足够的勇气面对所有的问题和困难。</span></p><p><span>所以我们去看北宫黝的这种勇气，他是有一些稚嫩的，有一些不成熟在其中的。就像我们去读历史当中也会有很多这样的人物，他无所畏惧，但是他会有一些鲁莽，这样的人是不懂得变通的。</span></p><p><span>但是我们抛开其人不讲，这种培养勇气的方法是我们值得学习的，我们要在某一方面让自己变得有优势，让自己变得强大，从而让自己变得无所畏惧，不会对一些事情的出现而动心。</span></p><p><span>我们举个例子，我们去看北宫黝，即使面对危险在自己的面前，决不退缩，决不逃避；可是想想我们生活当中，有多少人面对问题，面对困难，是退缩和逃避的呢？</span></p><p><span>举个例子，我要去学习一个新的技能，还没等开始做，我们就认为自己不可以，我们就开始退缩。再比如说，在感情当中遇到了一点挫折，我们就觉得人生没有了意义，我们甚至因为感情，会对人生，对我们整个的生命状态，开始退缩和逃避。</span></p><p><span>还有多少人因为我从一份工作的离开，从而失去了我对人生的勇气呢？还有多少人因为生意的失败，我会觉得我自己无能，我开始自我否定，我开始不相信自己，我以后还可以过上更好的生活，我还可以东山再起，这都是退缩和逃避的表现。</span></p><p><span>所以，我们要学习的是北宫黝身上的，这种面对问题和困难决不退缩，并且没有任何的区别。我不会区别这件事情是大是小，是贵是贱，我都有足够的勇气，不停地让自己变强大，去克服当下的困难和逆境，这是北宫黝培养自己勇气的方法。</span></p><p><span>我们再看孟子接下来讲的孟施舍，他是如何培养勇气的？</span></p><p><span><strong>孟施舍之所养勇也。</strong>孟施舍他是如何培养自己的勇敢，培养自己的勇气的？</span></p><p><span><strong>视不胜，犹胜也。</strong>视：就是看上去这件事情我不足以胜任，但是犹胜也。我要调节自己的心态，告诉我自己是可以制胜的。</span></p><p><span>我们举个例子，比如说，我面对一件我之前没有做过的事情，这一看我觉得难以胜任，因为我没有经验，没有做过，但是犹胜也。我仿佛觉得这件事情我是可以胜任的，我会不停地去寻找方法，我可以刻苦地努力，万事皆有解决问题的途径。</span></p><p><span>所以，我们看孟施舍他是对于自己内心的一种鼓励，当我们面对新的事情，当我们面对当下解决不了的问题，我们都要告诉自己，我们是可以战胜它的，只需要我们再刻苦一点，再努力一点去寻求方法，一切问题终将可以被解决。</span></p><p><span><strong>量敌而后进，虑胜而后会。</strong>量敌而后进，我们先去思量，思量好了之后，我们再去前进。虑胜而后会，后会：是交战的意思。我们先考虑好，如何才能战胜对方，这个时候我们再选择交战。</span></p><p><span><strong>是畏三军者也。</strong>说这样的人是恐惧三军的，是恐惧交战的。</span></p><p><span><strong>舍岂能为必胜哉，能无惧而已矣。</strong>我们再来看孟施舍这段话，他说如果你思量好再前进，如果你考虑周全再去交战，这是因为畏惧三军，畏惧交战之人，说我怎么能有必胜的方法再去决战，只是因为我无所畏惧而已。</span></p><p><span>孟施舍在讲，如果你考虑得那么周全，是因为你畏惧交战这件事情，是因为你心里有恐惧，</span></p><p><span>这个时候你是犹疑的，退缩的，即使两军交战，你也一定会失败。他说并不是我对于所有的事情，都有制胜的方法，而是因为我内心无所畏惧。</span></p><p><span>我们再来总结这一段，首先这里最重要的一点，是我们自己对于内心的调节，是我们对一件事情是无所畏惧的，在这个基础之上，我们可以思量，考虑更周全的方法。如果没有这份勇气在先，我们就不要过多的思量，否则你就会退缩，没有办法去做好一件事情。</span></p><p><span>我们来举个例子，比如说，我现在要去做饭，这件事情我并不擅长，可是我内心有足够的勇气，我可能边做边学，并不是因为我掌握了做饭的方法，而是我内心无所畏惧，我是不会恐惧这件事情的。</span></p><p><span>我们再来看第二种人，我不会做饭，我也没有足够的勇气，这个时候我要学习方法，我要不停地去思量，考虑周全，可是考虑的过程，我们会发现它越来越繁琐，越来越难，最后我们就会放弃，畏惧这件事情。所以我们去看看生活当中，遇事情我们要怎样去思考。但是无论你的思考是什么样的方向，这种勇气都是要放在前的。</span></p><p><span>视不胜，犹胜也。我们看上去无法胜任，但是我们一定要告诉自己的内心，是完全可以胜任的。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-3 勇往直前",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-3勇往直前</strong></span></p><p><span><strong>孟施舍似曾子，北宫黝似子夏。夫二子之勇，未知其孰贤；然而孟施舍守约也。昔者曾子谓子襄曰：‘子好勇乎？吾尝闻大勇于夫子矣：自反而不缩，虽褐宽博，吾不惴焉；自反而缩，虽千万人，吾往矣！’孟施舍之守气，又不如曾子之守约也。</strong></span></p><p><span><strong>孟施舍似曾子，北宫黝似子夏。</strong>曾子和子夏都是孔子的学生。在《论语》当中，孔夫子也讲到，“参也鲁”，讲到曾子这个人其实并没有那么聪慧，所以，这里我们去看孟子说，孟施舍似曾子，这里指的是，两个人都没有先天的优势，我们说曾子其实并不聪慧，但是他刻苦努力，一生都在修己。</span></p><p><span>吾日三省吾身。每天都在数次地反省自己，这是曾子的名言。并且曾子临终之时对他的弟子们讲，说我这一生战战兢兢，如履薄冰，如临深渊。所以说他跟孟施舍有些相似，没有那么好的先天优势，但是这一生是不停地刻苦修正自己的过程。</span></p><p><span>北宫黝似子夏，子夏十哲之一，是以文学著称的。这个人很有才华，那么他的文学和才华是有天赋的，就像这里的北宫黝，他先天的性格当中，就有如铜墙铁壁一般，无所畏惧。</span></p><p><span><strong>夫二子之勇，未知其孰贤。</strong>这里讲到孟施舍和北宫黝，说他们两个人，这种勇气也好，勇敢也好，说不上谁更好一点，没有好与坏。所以我们去看生活当中，也正是出现了很多类似北宫黝和孟施舍的人。北宫黝是第一种人，说在某方面是有天赋的，是有才华的，不需要努力，在这方面就可以做得很好。</span></p><p><span>还有第二种人，就是类似于孟施舍的。很多事情我是没有办法胜任的，但是我可以不停地调节自己的心态，我告诉自己我可以胜任，可以战胜当下的困难，我不停地刻苦努力，让自己可以做好一件事情。</span></p><p><span>其实，这两种人身上都有我们可以学习的地方。我们如果在某方面是有天赋的，我们就不停地去加强，让他如铜墙铁壁一般，但是我们的天赋不可能涉及到生活的所有领域，可能在力气这方面我们是有天赋的，可能在聪慧这方面我们是有天赋的，可能在灵性这方面我们是有天赋的，那么在有天赋的领域，我们就让自己的长处变得更长，犹如铜墙铁壁。</span></p><p><span>但是在我们不能胜任的事情，我们就要懂得不停地调整自己的心态，我们通过刻苦地努力，犹胜也。我们可以去战胜一切困难，可以去胜任一切事情。</span></p><p><span><strong>然而孟施舍守约也。</strong>我们看这个约，约：是指的要领、要害、重点、核心。孟子说，这两个人，他们身上的勇敢没有谁更好，但是孟施舍守约也，孟施舍是抓住了要领的。为什么说孟施舍抓住要领？我们刚才也讲到过，一个人不可能在生活的所有领域，你都有天赋的，不可能你都有先天的优势。那怎么办？</span></p><p><span>就要学习孟施舍的抓住要领，看到一件事情，即使我们不能胜任，我们先要鼓励自己，告诉自己是可以做到的，接下来刻苦努力让自己胜任这件事情，这就叫做要领。他可以适合绝大多数要发生的事情和我们无法面对的困难，所以，我们也要抓住孟施舍身上的要领，让我们可以有勇气面对生活当中的一切困难。</span></p><p><span><strong>昔者曾子谓子襄曰。</strong>这里提到了第三个人，谓：就是告诉，对他讲。子襄，是曾子的门人弟子，从前曾子对自己的学生子襄讲了一段话。</span></p><p><span><strong>子好勇乎？吾尝闻大勇于夫子矣。</strong>曾子问子襄说，你好勇吗？接下来其实就是曾子想要告诉子襄，如何让自己变成一个勇敢的人，如何让自己变得有勇气。吾尝闻大勇于夫子矣，这里的夫子，指的是孔子，曾子说，我曾经听我的老师孔夫子讲过，关于大勇，什么才是大勇呢？</span></p><p><span><strong>自反而不缩，虽褐宽博，吾不惴焉。</strong>我们先看这里的缩，缩：指的是合于正义的，合于仁、合于德、合于礼的事情，称之为缩。褐宽博，我们刚才讲到了，他指的是寻常百姓，地位低下之人。首先要自我反省，如果我们做的事情是不合于道义的，是不合于正道的，不合于正确的价值观，虽然面对的是普通百姓，我也不会欺压于人，我也并不会无理辩三分，这是大勇之人。</span></p><p><span>我们这个时候要往生活当中去思考了，这句话告诉我们首先要自我反省。懂得自我反省的人</span><span>才是大勇之人，而不是说我的位置更高，我比你更有钱，或者我是你的父亲，或者我是你的领导，明明我做的是不正确的，我还欺压他人，这是错误的。明明我的道理并不是正确的，</span><span>我还以自己的地位强压于人，这是错误的。</span></p><p><span><strong>自反而缩，虽千万人，吾往矣！</strong>但是如果我自我反省，我的事情是合道的，我的行为是正义的，即使有千人万人挡在我们的面前，我们也是勇往直前，决不退缩。</span></p><p><span>我们再来看曾子所讲的这段话，这种勇气不来源于天赋，不是先天的优势，也不来源于自我内心的调节，说我告诉自己我很有勇气，我很强大，而是来源于我们自己心中的正道，这才是大勇。</span></p><p><span>如果我们做的事情是不正确的，是不合乎道理的，是不正义的，那么即使面对普通人我也不会强压于人。但是我们经过自我反省，如果我们做的事情是正确的，是有利于他人的，是合于道德的，虽千万人，吾往矣。即使千军万马挡在我的身前，我依然是勇往直前，无所畏惧。</span></p><p><span>这种勇气和勇敢来源于我们心中的正义，我们可以去读历史，有很多正义之士就是因为内心是合于道德的，所以才可以勇往直前。这种勇敢它是来源于你自己内心的善良和那份正直，</span><span>因为你内心是有正义作为参照的，所以你可以无所畏惧，这才是孔夫子心中的大勇者。</span></p><p><span><strong>孟施舍之守气，又不如曾子之守约也。</strong>孟施舍所守的这种勇气，又不如曾子之守约也。这个约，同样指的是要领，重点核心。孟施舍也是懂得守约守气的，但是他守的要领是不停地鼓励自己，通过刻苦努力去完成，让自己有勇气。但是曾子这个守住要领，是培养自己心中的正义感，是让自己心中有正道，是问心无愧，所以你可以无所畏惧，这是大勇者。</span></p><p><span>我们来举例子了，比如说，我们面对一件事情是我无法胜任的，甚至这件事情会有很多人非议和误解，我们看看曾子的守约，我们去思考，我做这件事情是自私自利的，还是为了利益他人的，我去问清楚自己，这件事情是否是合乎于正义的。</span></p><p><span>如果是，那有什么可畏惧的，虽千万人，吾往矣。即使有千人万人不理解，千人万人挡在我们面前，我依然会勇往直前，这是内心的这种正义感所带给我们的。</span></p><p><span>那我们再回过来去看孟施舍，这件事情我可能胜任不了，有这么多人误解我，但是我告诉自己我是可以的，我是可以战胜我自己的，我可以通过刻苦努力，让别人最后认同我。</span></p><p><span>所以你看，它是两种要领，看你自己能抓住的是哪一个。但是我们刚开始想要去抓住孟子所教给我们曾子所说的要领，可能很难，因为这种正义感，这种道德之心，是需要我们逐渐地学习才可以达到的，它是一种次第。</span></p><p><span>我们回头再来总结，孟子所引用的这三个人，首先北宫黝，他是有先天的优势的。举个例子，</span><span>有的人有先天的优势，就是不在意他人的想法，无论他人支持与否，我都坚定的做自己的事情，并且认为我的一定是正确的，这是先天的优势，没有办法学习。</span></p><p><span>那么还有第二种人就是鼓励我们自己，我们是可以的，我一定可以，通过刻苦地努力达到结果，以让别人来认同我。</span></p><p><span>那么还有就是第三种人，曾子所讲的大勇者。无论有多少人误解和不支持，你知道你做的事情是正义的，你知道你做的事情是帮助别人的，是符合道德的，所以，虽千万人吾往矣，没有任何人可以阻挡你的脚步，这是大勇。</span></p><p><span>所以我们综上所述，这三种人身上的特点都值得我们去学习，它是可以兼具的，我们看孟子</span><span>是不是兼具了这三种勇气，公孙丑问孟子，如果您来执掌齐国的朝政，是否可以动心呢？孟子讲，不会，我四十岁以后就不再动心了。为什么不动心？因为他有足够的勇气。</span></p><p><span>我们先看北宫黝身上的特点，先天优势，我们看孟子有吧，先天的才华，口才，智慧，对于王道的推崇，第一点有了。</span></p><p><span>我们再看第二点，孟施舍身上的，难道所有的事情孟子都能胜任吗？显然是不可能的，我们任何一个人都没有办法做到，生活当中发生的所有事情都可以胜任。但是，我有这个自信是可以克服一切困难的，我可以鼓励自己，我可以通过刻苦的努力，去解决一切出现在我面前的障碍。</span></p><p><span>我们再看第三点，曾子所讲的这种大勇，孟子显然更加具备。孟子推行的就是王道，他的思想就是以仁政为核心，与民同乐，仁者无敌，所以，做的事情是利益全天下百姓的，我丝毫没有自己的私利，又有什么可以阻挡我前行的脚步呢？所以，虽千万人，吾往矣！他会勇往直前地去做这些事情，所以，有这三种勇气在其中，孟子当然是不会动心的。无论发生任何一件事情，孟子的心都不会为之所动。</span></p><p><span>我们就要学习这三种勇气。在我们有天赋的地方，我们让它变得犹如铜墙铁壁，在我们不能胜任的事情面前，我们告诉自己，鼓励自己，我们是可以的。然后通过刻苦努力以培养我们的勇气。</span></p><p><span>还有第三点，尤为重要。我们做一件事情的时候，我们自己去思考，去问问自己，我们反观自省，它是否合于道德，是否合于礼义，是否合于我们内心的仁、义、礼、智、信，是否是为他人着想和考虑的，如果是，那又有什么值得畏惧的呢？虽千万人，吾往矣。</span></p><p><span>所以，想让自己不动心，我们就去学习这三种勇气，它可以克服我们生活当中的一切困难，让我们的心不会为之所动。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-4 心动与动心",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-4 心动与动心</strong></span></p><p><span><strong>曰：“敢问夫子之不动心，与告子之不动心，可得闻与？”“告子曰：‘不得于言，勿求于心，不得于心，勿求于气。’”</strong></span></p><p><span>我们再来回顾这一段对话，公孙丑问孟子，如果可以做齐国的卿相，会不会动心。我们这里要区分动心和心动的区别。</span></p><p><span>何为心动？我们举个例子，比如说，我们看到一件漂亮的衣服，或者看到一个美女，看到一个帅哥，这个时候你会产生心动的感觉，心动它是主动的，是我们自己主动地想要追求一个东西，或者主动地看到了什么，所产生的感受。</span></p><p><span>我们再讲何为动心？举个例子，比如说有人对你讲了一番话，这个时候来问你，说你是否动心了呢？也就是有人主动地想要改变我们的某些想法或者某些认知，这个时候我们是被动的，称之为动心。</span></p><p><span>我们再来看公孙丑问孟子的问题，说如果老师您可以做齐国的卿相，这个时候你的心是否会动。我们要知道，如果一个人去治理一个国家，他会面对很多的困难，会面对很多的动荡，在这些困难和动荡之中，自己的心是否能不为所动呢？</span></p><p><span>我们再来看动心和心动的第二个区别。我们讲，心动它是主动的，并且是突然的，猛烈的。动心，首先它是被动的，其次，它是缓慢的改变的过程。比如说，因为别人的一些话，因为环境的变化，或者因为出现了一些人，或者出现了一些困难，这个时候，我们被动的被事情或者环境所改变，我们的心为之所动。</span></p><p><span>我们举个例子，比如说，我们跟一个人刚开始一段感情，我们是想要和对方相扶相伴到老的，但是有可能中途发生了很多事情，让我们的心开始动，忘记了最开始的想法。再比如说，很多人刚开始做生意，或者做一家企业，刚开始是有自己的志向的，可是做着做着，经历了一些事情，或者经历了一些困难，我们的心智被外在的环境和事件所影响，这个时候开始变得动。</span></p><p><span>公孙丑问孟子，如果做了齐国的卿相会如何。孟子讲，我四十岁以后已经开始不动心，我不会被外界的环境，被他人，或者被困难，被一些事件的出现，影响了我最开始的志向。孟子的志向推行王道，推行仁政，不会因为任何环境和任何人的变化，或者出现，自己的心为之所动。</span></p><p><span>公孙丑听到这里或许跟我们的想法是一样的，这种不动心的境界，我们要如何才能达到？有没有什么样的方法？</span></p><p><span>孟子讲当然是有的，给我们列举了三个方法，可以培养自己的勇敢，培养自己的勇气，进而让自己不会去动心。</span></p><p><span>哪三个方法呢？第一点，讲了北宫黝，当你有足够的能力去胜任一件事情，这个时候你是不会动心的。我们举个例子，比如说，现在随着我们生活的条件变得更富裕，这个时候如果说我们买一个零食，我们可能拿出五块钱就可以了，对于拿出五块钱这件事情，我们是不会动心的，因为我们手里的钱足够胜任这件事情。</span></p><p><span>但是如果拿出五万、五十万，可能这个时候，我们就要动心了。什么叫动心？就是我们的意志开始松动，开始产生了很多想法，说这个车我真的要去买吗？如果要去买，会不会给我的生活带来很多的压力呢？</span></p><p><span>如果要去买了这个车，我还要去保养，还要去加油，现在的油价比较高，这就叫动心。也就是出现了一件事情，我们的心开始犹豫不定，开始过多的思考，我们的意志开始松动，称之为动心。</span></p><p><span>再比如说，关于我们家孩子的教育问题，说孩子比较叛逆，这个孩子不爱学习，如果你有足够的能力和智慧，你就不会动心，我有一万种方法可以改变这个孩子，我有很多种智慧可以引导这个孩子，当你的智慧和能力足够胜任这件事情，你就不会动心。</span></p><p><span>但是如果你没有足够的智慧，这个时候我们就要动心了，你要去开始思考这个孩子现在不听话，他未来要如何去找到好的工作呢？如果他现在不好好学习，将来大学他是考不上的，如果他不能好好学习，我要怎么办？可能我后半生的生活也因此而没有了着落，这就叫动心。</span></p><p><span>当我们一旦开始动心，我们就会产生很多的想法，也就产生了内耗。想一想，我们在生活当中，是不是有很多事情我们都是动心的，因为我们没有足够的智慧去处理和胜任生活当中的这些事情，所以我们每一天动心的时候会有很多，因此我们就会觉得很累，头脑不清明。</span></p><p><span>孟子告诉我们的第一个方法，要想不动心，我们就要让自己有足够的能力，足够的智慧，去胜任当下的事情，就像北宫黝，他有足够的力量，他是不会退缩的，这是先天的优势。我们需要通过后天地努力，让自己有足够的智慧力量，胜任我们当下的事情，如此，你就不会动心。</span></p><p><span>那又讲到了第二个方法，因为不是任何时候，我们在任何一个领域，或者在任何一个事件，我们都可以做到足以胜任，那就讲到了孟施舍的方法，视不胜，犹胜也。我看到当下的事情，好像我并不能完全胜任，但是，我在心里告诉自己我是可以胜任的，这个时候，我加倍的刻苦努力，可以让自己胜任当下的事情，让自己不动心。</span></p><p><span>进而又讲到了曾子说的第三个方法，如何让自己不动心呢？让自己合于义，让自己做的事情合于道，合于自己内心的价值观，当你合于了正道，合于自己的价值观，你就不会动心。比如说孟子，我做的事情是为民请命的，是为百姓好的，是保护百姓，让百姓可以过上安居乐业的生活，因此，我毫无畏惧，无论遇到任何困难，遇到任何问题，虽千万人，吾往矣。我不会被这些困难所吓到，因为我心里怀着的是正义，所以我不动心。</span></p><p><span>我们在生活当中也是一样的，当你被别人误解，被别人怀疑，当你遇到困难之时，你去想一想，自己如果做的事情是正义的，这个时候你的体内是充盈着浩然正气的，所以你无所畏惧，我们的心也不会被动，这个时候，你的思想、意志不会动摇。</span></p><p><span>可是如果我们一动心，我们就开始本来的想法就要动摇了。本来我是想着为民请命，可是遇到困难之时，我就要想我这样做下去真的有意义吗？我可以有能力去做好这件事情吗？当我们一开始动心，你的行为就会开始变得犹豫不决，开始变得缓慢，因此这件事情你也就没有办法再做下去。</span></p><p><span>孟子讲了三个人培养勇气的方法，可以不动心，但是之前孟子提到过孟子自己四十岁以后不动心，又提到告子先我而不动心，这个时候公孙丑就要问了，我想请问一下老师您和告子，用什么样的方法可以不动心的。</span></p><p><span>我们看接下来的话题，<strong>曰：敢问夫子之不动心，与告子之不动心，可得闻与？</strong>公孙丑问道，说老师您的不动心与告子的不动心有什么区别吗？可以说来听一听吗？</span></p><p><span><strong>告子曰：不得于言，勿求于心，不得于心 勿求于气。</strong>这是告子讲的话，这里孟子首先讲，告子的不动心的方法，不得于言，勿求于心。言：指的是言语道理，如果在言语和道理上没有通达，那么就不要求于心。</span></p><p><span>不得于心，勿求于气。如果你心里的想法没有开始变化，这个时候你不要求助于气。我们看这句话有三个关键词，第一个叫做言，第二个叫做心，第三个叫做气。言：指的就是言语和道理了，心：指的是我们自己内心的想法，气，我们来讲一讲何为气？我们长期的行为形成的习惯，我们称之为气。</span></p><p><span>我们举例子，比如说我们可以看到军人，说军人一身正气，我们看看这个气从哪里来。是因为军人从到了部队那一天开始，他所接受的教育就是要正义的，就是要保家卫国的，他长此经受了这样的教育，他改变了内心的想法，他的行为就会变成有正气的样子。</span></p><p><span>我们再举个例子，比如说，我们看到一个有威仪的法官，我们看到这个人，你在他面前就不敢讲假话，因为你看到他身上散发的气，就是这个样子的，就是因为他长期的思想，长期的行为，就形成了这样的气。</span></p><p><span>我们再举个例子，说有的人你看上去就是一身的怨气，因为他的想法和他的行为，都是长久的抱怨，最后就形成了他那个气，所以你看到这个人他都是负能量的，讲话必然是抱怨的。</span></p><p><span>我们再举个例子，比如说，你看到那些经常爱占小便宜的人，你去观察他的行为，他总是东张西望，为什么？看看哪里可以占到便宜，看看哪里可以让自己得到更多的好处，所以，气就是你长期的想法和你长期的行为，最后形成的习惯，也就成了气。</span></p><p><span>我们再来看告子所讲的这句话，首先，一个人要从言语和道理上明白，这个时候你的内心才会改变，你的想法才会改变，你的内心和想法开始改变，就有了行为，最后就形成了气。</span></p><p><span>我们举个例子，比如说，一个人首先你要明白道理，应该去孝顺，这个时候你就有孝顺的心，所以，你就形成了行为，最后就养成了气。如果一个人不明白孝顺是正确的，不明白孝悌是何意，他就不会有这样的心和这样的想法，它也就不会形成这样的行为和气。</span></p><p><span>我们再举个例子，我们讲人要亲民，要懂得帮助他人，要有利他思维，这是从道理上我们先学习，先明白了，我们每天学习圣贤文化，知道要亲民，知道要去帮助更多的人，这就叫言语通顺。当言语通顺、通达，我们的内心就会开始改变，接下来我们的行为就会变化，最后就形成了气。我们一看这个人说，看上去就很善良，看上去就很温和，很好打交道的样子，</span></p><p><span>这就形成了气。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-5 持其志 养其气",
    "date": "2022-09-20",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-5 持其志 养其气</strong></span></p><p><span><strong>“不得于心，务求于气，可；不得于言，务求于心，不可。夫志，气之帅也；气，体之充也。夫志至焉，气次焉。故曰：‘持其志，无暴其气。’“既曰‘志至焉，气次焉’，又曰：‘持其志，无暴其气’者，何也？曰：“志壹则动气，气壹则动志也。今夫蹶者、趋者，是气也；而反动其心。”</strong></span></p><p><span>孟子和告子所讲的道理有相同点，但同时还有一个非常大的不同点。<strong>不得于心，勿求于气，可。</strong>接下来孟子讲到，不得于心，勿求于气，这个是可以的，因为你的心没有改变，你的想法没有改变，这个时候你的行为就不会改变，不会形成那个气，这个是可以的。</span></p><p><span>那也就是告子的后半段孟子是认同的，那不认同的是前半段，<strong>不得于言，勿求于心，不可。</strong>如果说道理上没通，你就不要求于心，不要想着内心可以变化，这个是不可以的。</span></p><p><span>什么道理？这句话对，但是不绝对，我们绝大多数人都是要先学习道理，先从言语上通达，我们的内心才会改变，行为才会改变，才会形成气。但是还有另外一种人，我不明白这个道理，我也没有学习过圣贤文化，但是内心本来就懂得孝顺，内心本来就善良，我天生就知道应该去帮助他人，这些人不是从道理和言语上通顺的，而是内心本来就有。</span></p><p><span>我们这里可以引用一个故事，《六祖坛经》当中有神秀大师，神秀当时作了一首偈子：“身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。”告诉我们的内心要时时擦拭，就像擦拭镜子是一样的，不要让它惹上尘埃，这句话是正确的，绝大多数人修行的次第，也是要这样去做的，但是它不够究竟，还有更深层次的就是六祖慧能大师。</span></p><p><span>慧能同样也说了一个偈子：“菩提本无树，明镜亦非台，本来无一物，何处惹尘埃。”说本来就什么都没有，是不需要去擦拭的，我们再回过来看孟子和告子之间的区别就在这里，告子讲的是适合大多数人去学习的。比如说，我们需要先学习圣贤文化，从道理上，从言语上明白了该明德，亲民，止于至善，明白了该去做合于义的事情，明白了该去孝顺他人，这个时候，我们的内心会随之而发生变化，最后形成了气。</span></p><p><span>但是孟子讲的是更深层次的，告诉我们本性本来就是善良的，有的人生而孝顺，有的人生来就知道，做人要善良，要利益他人，要去帮助更多人，这部分人是不需要经过学习的，本来就有。</span></p><p><span>所以孟子和告子两个人讲的都对，只不过孟子讲得更深了一层，告诉我们，有的人可以通过言语让自己的内心发生变化，而有的人不需要通过任何言语，他本来内心，本性上就是善良的，所以他同样可以形成一身正气。</span></p><p><span>接下来孟子又讲了一个观点，具体又告诉我们，这个气到底从哪里来。</span></p><p><strong><span>夫志，气之帅也，气，体之充也。</span></strong><span>首先告诉我们，志，气之帅也。什么叫帅？我们讲主帅，首领，控制，指挥的，所以什么来控制和指挥气呢？志。什么叫做志呢？就是目标，我们想要干什么，这就叫志。</span></p><p><span>比如说，我们去形容一个人，我们说这个人少年得志，那什么叫少年得志呢？他不停地在追寻自己的目标，追寻自己的理想，并且得到了，所以叫少年得志。</span></p><p><span>志就像我们人生当中的导航，如果你有了志，你会知道你所有的行为去向哪里，他是有导向的，可是如果没有这个志，你的气是散的，没有地方可以聚集，所以志是非常重要的。</span></p><p><span>我们从小就要培养孩子的志向，可是我们反观现在，我们有多少孩子是有自己的志向的，不光孩子，我们现在成人亦是如此，问问自己我们有志向吗？我们知道自己要去干什么吗？如果你没有这个志向，你每天的生活就是盲目的，你就是迷茫无助的，我不知道该去做什么事情，我每天就会变得无所事事，无所适从。</span></p><p><span>所以这个志是非常重要的，如果你的孩子可以张口讲出来他的志向，那么恭喜你，这个孩子如果顺着他自己的志向而努力，将来他就会变成一个优秀的人。</span></p><p><span>比如说，我们都知道，王阳明先生从小立志当圣人，当他有了这个志向以后，他所有的行为就有了导向，所以他会学习圣人都做了什么，立德，立功，立言，他一生的行为就有了标准。</span></p><p><span>再比如说我们都听到过的志向，为中华崛起而读书，当你有这个志向的时候，你的所有的行为就形成了导向，这个时候，久而久之就形成了气。</span></p><p><span>还有比如说，我们小的时候有很多孩子是有理想的，是有志向的。有的人说，我想要做科学家，为社会和国家做贡献；有的人说，我想去做警察，可以去维护社会治安；有的人说，我想去做医生，可以去帮助更多的病患；有的人说，我想去做老师，可以去改变更多人的心灵。</span></p><p><span>当你有志向的时候，你的行为就有了努力的方向。但是要注意的是，我们很多人的志向，可能只是说说而已，说了以后你自己并没有去在意他。而真正有志向的人，是说到哪里做到哪里，我所有的行为都会为了自己的目标而去努力，这个时候你的气自然就会变得专注。</span></p><p><span>气，体之充也。这个气它是充满在一个人的体内的，所以，一个人的志向如果是专一的，你的行为如果是有导向的，你就可以看到这个人的气，他是不散乱的，气不散乱，就会让你不动心。</span></p><p><span>想一想我们为什么会动心？是因为你的志和气都不够专，所以遇到困难的时候，遇到诱惑的时候，遇到环境变化之时，我们都会开始动心。如果你的志和气是专一的，它是充盈你的体内的，我们的心就不会为之所动。</span></p><p><strong><span>夫志至焉，气次焉。</span></strong><span>首先，我们这个志如果达到了，气是自然而然就可以充盈的。</span></p><p><strong><span>故曰：持其志，无暴其气</span></strong><span>。所以说，持就是专注于你自己的志向。无暴其气，不要让你的气散乱。</span></p><p><span>我们看最后这两句话，首先，孟子说当你的志到了，你的气自然就到了。可是接下来又说，你要让自己的志向专注，并且不要让自己的气散掉。我们看到这里，似乎又有一个疑问了，这个疑问公孙丑接下来要问到了。</span></p><p><strong><span>既曰：志至焉，气次焉，又曰：持其志，无暴其气，者，何也？</span></strong><span>既然说志至焉，气次焉，如果志到了，气自然就到了。可是又说持其志，无暴其气者，你得专一自己的志向，并且不要让自己的气散掉，这是为何？</span></p><p><span>我们来体会这个疑惑，孟子说，你只要志向到了，气就到了，也就是你不用去理那个气，它是自然而然的。可是接下来又说了，你得持其志，并且还得无暴其气，还得保证气不散掉。这是什么道理？</span></p><p><strong><span>曰：志壹则动气，气壹则动志也。</span></strong><span>孟子说到了，因为当你的志向不能够专一的时候，你的气就会散掉。同样，如果你的行为，你的气不能保持专一的时候，就会动摇你的志向。</span></p><p><span>为什么会动心呢？就是因为你的志向不够专注。举个例子，很多人做一件事情，最开始的志向和初心是好的，可是做着做着你的行为，你的气，就会开始散乱，就会开始动摇，这就是孟子所讲的，持其志，无暴其气，你要让自己的志向专一，并且你不要让自己的行为和你的气受到影响。</span></p><p><span>我们再来看这句话，志壹则动气，气壹则动志也。首先，这个“壹”是专注的意思，如果你的志向是专注的，就会带动你的气，如果你的行为和气是专注的，同时又会带动你的志向，所以它是相互作用的。</span></p><p><span>但是相互作用有好有坏，如果你的志向专一，就会带动你的气，你的行为和气专一，就会带动你的志。反之也是如此，如果你的志向松动，就会让你的气散乱，如果你的行为和你的气散乱，就会影响你的志向。</span></p><p><strong><span>今夫蹶者、趋者，是气也；而反动其心。</span></strong><span>我们先看蹶者，蹶者：指的是走路不稳的人。趋者：指的是走路过快的人。那这里孟子举了例子，说了两种人，一种人走路不稳，说明这样的人并不懂得稳扎稳打，还有另外一种人叫趋者，也就是急于求成的人，说这两种人都是气也，什么意思呢？是长期的思维，长期的行为，形成了这样的习惯。</span></p><p><span>我们再讲稳扎稳打的人，做事情合于道德的人，同样是气也。因为你长期的心性是如此，长期的思考是如此，长期的行为是如此，最后就形成了气，而反动其心。</span></p><p><span>这里点题了，如果一个走路不稳的人，和一个过于急于求成的人，形成了这样的气，它就会影响你的心性。</span></p><p><span>我们再来体会这句话，为什么孟子讲，要持其志，又要无暴其气呢？因为你的想法一旦发生一点变化，这个时候你的行为就会跟着变化，长久以往，你就形成了急躁之气，这个时候反动其心，让你本来稳的那颗心，也会开始变得不稳。</span></p><p><span>所以，我们既要专注于自己的志向，同时还要注意自己的行为，因为你的行为长期下来就会形成气，而这个气又会反动其心，它会影响我们自己的心理变化。</span></p><p><span>我们举个例子，比如说，一个人要想保持平和之气，你就需要让自己的想法变得平和，让你的行为变得平和，最后就养成了平和之气，你的心性就是平和的。</span></p><p><span>但是说我们的心想要去平和，可是不知不觉，遇事你的想法变得急躁，就是那个趋者，然后接下来你的行为会变得急躁，最后你的气就开始变得不是平和，而是急躁之气，而反动其心，</span><span>这个时候回来就影响了你平和的心。</span></p><p><span>所以要想养成平和之气，我们首先要有这样的志向，我要养成平和之气，接下来我们要让自己的想法，保持平和，要让自己的行为保持平和，最后就养成了平和之气。</span></p><p><span>所以又要专注自己的志向，同时又要注意自己的行为和行为所养成的气，就叫无暴其气。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-6 浩然之气",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-6 浩然之气</strong></span></p><p><span><strong>“敢问夫子恶乎长？”曰：“我知言，我善养吾浩然之气。”“敢问何谓浩然之气？”曰：难言也。其为气也，至大至刚，以直养而无害，则塞于天地之间。其为气也，配义与道；无是，馁也。是集义所生者，非义袭而取之也；行有不慊于心，则馁矣。我故曰‘告子未尝知义’以其外之也。</strong></span></p><p><span><strong>敢问夫子恶乎长？</strong>公孙丑接着问：想问老师您有什么优异的特长没有？为何会有此疑问呢？我们来回顾上一段上一段话，公孙丑问孟子，孟子的不动心和告子的不动心，有什么区别？</span></p><p><span>孟子首先讲了告子的不动心，告子的不动心要从言语和道理上先通，通了以后会改变自己的内心，内心改变以后会形成行为，行为再形成气，那也就是告子的气和不动心，它是由外在所产生的，由外在的言语，外在的道理来通顺，那显然孟子并不赞同。</span></p><p><span>故而孟子讲：说心里先有了想法，再形成气，这个是可以的，但是一定要从言语上先通，这个是不可以的，因此公孙丑就问了孟子，那老师您的特长在哪里？其实言下之意也是在问那老师，您的方法是如何做到不动心的。</span></p><p><span><strong>曰：我知言，我善养吾浩然之气。</strong>孟子说我有两个特长：第一个特长，我知言，我知道言语，这里我们要注意了，这里的我知言不是最表面的，说我擅长讲话，或者擅长听别人讲话，不是；我们说，言语背后可以看到一个人内心真实的想法，可以看到一个人的性格，可以看到一个人的思维方式。</span></p><p><span>所以孟子讲：我知言，通过言语的背后，可以知道别人心之所动，可以知道他为什么要讲这段话，可以知道他的性格，可以知道他的思维方式，这是第一个长处。</span></p><p><span>那么第二个长处，我善养吾浩然之气，我善于培养自己的浩然之气，我们听到这段话，孟子知言，善养浩然之气，我们都会挑自己最关心的，最在意的问题去问，公孙丑和我们是一样的。</span></p><p><span><strong>敢问何谓浩然之气？</strong>他没有先问知言，为什么会知言，背后到底有什么道理？把这个问题忽略掉了，想请问老师什么叫做浩然之气？</span></p><p><span><strong>曰：难言也。其为气也，至大至刚。</strong>这个事情是很难讲清楚的，所以叫难言也，即使是讲不清楚，也要尝试着去讲，这种浩然之气又大、又强、很有力量。</span></p><p><span><strong>以直养而无害，则塞于天地之间。</strong>我们先看这种气，强和大到什么程度，可以充满充盈于天地之间，如何才能有这种气呢？以直养而无害，直是正直，要用正直去养这种气，并且不要去伤害它。</span></p><p><span>我们举个例子，什么叫不要伤害它呢？不要有漏掉的地方，举个例子，我们说用一个器具去装空气，如果我们用的是塑料的袋子，一旦有一个地方是漏气的，这个气就泄掉了。所以既要以正直去养这种气，但同时要让他做到无害，不要去做伤害气的事情，也就是不要做不正直的事情，一旦你做不正直的事情，对这个气就是有所伤害的，它会漏掉。</span></p><p><span><strong>其为气也，配义与道。</strong>我们先看这个配字，什么叫做配呢？它是不可或缺的东西，举个例子，我们说找一个人配合，我们来做这件事情，他虽然不是主体，但是少了这个人，这个事情没有办法做，说我们准备一些配菜，它虽然不是主料，但是缺少它这道菜没有办法做成。</span></p><p><span>所以配的特点就是不能缺少的，但是它并不是主体，其为气也，配义与道也，那么如何去配？</span></p><p><span>配合正义的事情，合于义的，合于道的事情。</span></p><p><span><strong>无是，馁也。</strong>枯萎，变缩小的，称之为馁。如果不是这样做，这个气就会漏掉。我们再看这句话，这种气是要靠自己的正直去将养，并且不要去做有害的事情，是配合义和道的。如果不是配合义与道，他就一定会馁也，也就会消散掉，这种气就会有漏，就不是至大至刚之气。</span></p><p><span><strong>是集义所生者。</strong>重点来了，这种气从哪里来呢？集义所生者什么叫集，就是聚集，越来越多，聚集义所生，我们来看这个生字，何为生呢？从无到有，从小到大，从少到多，称之为生。</span></p><p><span>我们来看生的特点是什么？举个例子，说我们让一个禾苗生长，主导是靠禾苗自己，然后配以辅助。比如说，我们给它浇水，给它施肥，让它可以得到阳光雨露，但是禾苗自己才是主导，我们看生是什么意思？如何才能生起？浩然之气是你经常聚集的，多做合于义的事情，自然就生起浩然之气。</span></p><p><span>比如说，我们讲一位法官，一位法官如何身上才能有正义之气呢？是他经常公正的断案，他经常站在法律的角度，保持公正公平的原则，当他做的多了以后，自然就生起这种正义之气。</span></p><p><span>我们说一个人何为正直，他经常聚集性的做合于义的事情，合于正直的事情，久而久之就生起了浩然之气，也就是这种正气。</span></p><p><span>我们这里再来讲讲气，每个人所聚集的气是不一样的，孟子讲，自己善养浩然之气，但是反观生活当中，很多时候我们也在聚集气，只不过有可能聚集的是怨气，怨气从哪里来？平时我们的想法当中，我们的行为当中总是抱怨，抱怨的多了，最后聚集而来就形成了气，也就是怨气。</span></p><p><span>我们再讲说有的人你看上去，就可以感受得到满身的贪婪之气，就是因为他平时的所思所想都是贪婪的，久而久之就聚集了这种气。所以你看上去就是贪婪之气，还有的人我们说这个人很小气，因为他什么事情都斤斤计较，总是喜欢占人便宜得到好处，久而久之这样的事情做多了，就聚集成了气，我们看到的就是这个人很小气。</span></p><p><span>我们讲，一个人说有儒雅之气，同样的道理平时的想法，平时的行为都是儒雅的，淡然的，平和的，久而久之就聚集生起了这种儒雅之气，所以去看看我们身上现在散发的是什么气，</span><span>我们就知道它是由于我们平时聚集的时间久了，聚集的多了，自然所生起的这种气。</span></p><p><span>我们回头再来看孟子是如何养自己的浩然之气，经常做合于义的事情，合于道的事情，久而久之这种气是自然生起的，而你不需要刻意的再去养这种气，它是随着你心里有义，你的行为上有义，自然所生起的这种浩然之气。这种浩然之气，当你聚集的越来越多，那么自然是至大至刚，充塞于天地之间。</span></p><p><span><strong>非义袭而取之也。</strong>这句话我们要注意了，袭是什么意思呢？是义的延续，并不是做了一件合于义的事情，延续就可以取到这种气。比如说我开了一个公司，这个公司是做了利益他人的事情，帮助他人的事情，是合于义的，从此以后我就不再做事情了，那么这一件事情是不足以生起浩然之气的。</span></p><p><span>我们是要不停地一件又一件的做更多符合于义的事情，聚集的多了，才会生起这种浩然之气，</span><span>所以我们学习孟子要体会到这一点，我们在生命当中是要不停地去做合于义的事情，而不是靠一件事情，我们从这里要去延伸，也就是不倚仗我们在生活当中，不能倚仗和依靠一件事情，达到什么样的目标和结果。</span></p><p><span>比如说，我对我的朋友很好，你不能说因为一件事情对他很好，靠着这一件事情的延续，来稳固我们之间的感情，它会变淡会变少。</span></p><p><span>再举个例子，说我曾经读初中的时候，考试是第一名，你以后读高中，读大学，你还需要不停地进步，而不是依靠那一次的考试成绩，来度过我们以后的生活。我们在生活当中就要懂得这个道理，我们要不断地去提升自己，并且不停地去付出，不停地去做合于义的事情，最后聚集而来，会生起浩然之气，绝非一件事情的延续。</span></p><p><span><strong>行有不慊于心，则馁矣。</strong>这里的慊是满足满意的意思，如果我们的行为做的有不让我们的心满足和满意的地方，这个时候的气就会缩小，会变得没有力量，这句话很好理解，就是我们的行为一定要无愧于心，否则这个气就会逐渐地漏掉，最后就会散掉。</span></p><p><span>所以要保证我们的每一个行为都是合于义的，都是无愧于内心的，这种气才会变得至大至刚。</span></p><p><span>我们经常讲到一个成语叫理直气壮，如果我们在合于义，合于道德，这件事情上没有亏，我们理就是直的，这个时候你的气是充盈在你的体内的，你讲出来的话是铿锵有力的。</span></p><p><span>可是如果这件事情我们是有愧于心呢？你不敢让别人提及，一聊到这个话题的时候，我们总是想转移，这个时候你的气就会逐渐地泄掉，也就是馁也。</span></p><p><span>我们再来总结这一段，如何才能养这种浩然之气，首先我们做的事情是要合于义，合于道的，</span><span>以正直去将养，并且不要去做伤害气的事情，聚集的义行多了以后，自然生起这种浩然之气，</span><span>但是行为上不要有愧于心，当有愧于心的地方，就是在漏掉这个浩然之气，当你漏的多了以后，这个气就不足，就没有办法达到。</span></p><p><span>孟子所讲的至大至刚，所以我们不停地去做合于义的事情，不停地去反观自省，自己的行为不要有愧于心，不停地去将养义行，这个浩然之气就会生起，直到它至大至刚，充塞于天地之间。</span></p><p><span>我们去读历史经常可以看到那些忠义正直之士，为什么可以正气凛然，就是因为这种气充盈在他的体内，他做的事情无愧于心，做的事情合于义，合于道，所以这种正气就在体内，他是支撑一个人，可以变得更好的动力。</span></p><p><span><strong>我故曰‘告子未尝知义’以其外之也。</strong>所以孟子讲：告子并不了解义，所以认为这种气是来自于外在的，其实不对，这种气是来源于一个人的内在的，是从内心而生起来的浩然之气，当我们的内心是懂得义，懂得道的，以正直去将养，并且不做伤害义行的事情，这种浩然之气自然生起，所以这种浩然之气不是来自于外面，而是来自于我们的内在。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-7 揠苗助长",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-7揠苗助长</strong></span></p><p><span><strong>必有事焉而勿正，心勿忘，勿助长也。无若宋人然：宋人有闵其苗之不长而揠之者，芒芒然归，谓其人曰：‘今日病矣！予助苗长矣！’其子趋而往视之，苗则槁矣！天下之不助苗长者，寡矣，以为无益而舍之者，不耘苗者也。助之长者，揠苗者也；非徒无益，而又害之！</strong></span></p><p><span><strong>必有事焉而勿正，心勿忘，勿助长也。</strong>我们先来看第一句，必有事焉而勿正，一定要从事情当中去聚集这种气之所在。孟子和告子的不同正在这里，告子认为这个气可以从言语上，从道理上得来，然后内心是通达的，进而可以养这种浩然之气，但是孟子讲说，我善养吾浩然之气，而这种浩然之气是从内在的，是可以正直去养的。</span></p><p><span>当以正直去养的这种浩然之气，是至大至刚的，要配上义与道，配合义行，配合自己的所思所想，是合于道的。这里注意了，又进而提到，必有事焉而勿正，就是一定要从做事情当中去积累，而勿正，这个正是什么意思呢？预期，要从事情当中去积累，去聚集这种浩然之气。但是注意，不要有期盼，不要期盼一个结果的呈现。</span></p><p><span>我们看这一句话，我们要做一个延伸，这句话在生活当中非常的好用，我们不光是善养浩然之气是如此的次第，我们做其他的事情也一样，一定要通过努力做事情而达到那个结果，但是不要去期盼。</span></p><p><span>我们举个例子，比如说，对于孩子的学习成绩，我们要通过事情，然后去帮助孩子，帮助他提升学习的动力，提升学习过程当中的努力，但是而勿正，不要期盼他考试成绩一定会好，否则，就会给我们带来痛苦。</span></p><p><span>再比如说，说我们去学习传统文化，我们一定要在事情当中去努力，在这个过程当中保持努力地学习，但是不要给自己一个预期的成果。比如说，我一个月必须要学到什么程度，两个月必须要达到什么状态，这个时候就会产生痛苦。</span></p><p><span>再比如说，我们参加工作也是如此，我们要在工作当中，在具体的事情当中努力去做，但是不要期盼一个什么样的成果，说我做三个月，一定可以拿到什么样的结果，我做几个月一定可以加薪，我做多久一定可以升职，当我们有这种预期，就会产生痛苦和烦恼。</span></p><p><span>我们再举个例子，比如说，感情也是如此，说想和一个人开始一段感情，或者是夫妻之间，我在感情的过程当中，在家庭生活的过程当中，在具体的事情上去努力，但是不要去期盼结果，说努力地对他好，我们这个感情一定可以变成什么样子吗？说我努力地对他好，对方就一定会给我回馈吗？那个是没有办法的。所以，我们要回到那个过程，那个事件当中去。</span></p><p><span>再比如说，养生也是如此，我们现在经常会谈到养生，但不代表所有的养生的人都可以达到很好的一个预期的结果，但是有一点是可以肯定的，你只要去注重过程，注重具体的事件，你只要去养生，就比不养生的人，结果要好得多。</span></p><p><span>我们说对于孩子的学习成绩，对于自己的感情也是如此，我们在具体的事情当中努力地付出，不一定达到预期的成果，但是一定比你不努力要好得多。所以，孟子告诉我们如何可以养自己的浩然之气，就是在事情上去努力，但是心态上是放平和的，勿正，不要有一个预期的结果，说我什么时候可以养出这种浩然之气呢？当你有这种预期的结果，你的心态就会开始变得不平和，这个气它就没有办法变得至大至刚。</span></p><p><span>心勿忘，勿助长也。心里时刻不能忘记这件事情，我一直放在心上，要养我的浩然之气，然后我从具体的事情上，从义行上，从合于道上去努力，而不追逐那个预期的结果。</span></p><p><span>勿助长也。不要去助长，何为助长呢？就是刻意地去帮助他成长。我们经常听到过一个成语，叫揠苗助长，这个揠是拔的意思，所以，我们又叫做拔苗助长，我们接下来，孟子讲了一个例子，告诉我们不要去刻意地助长。</span></p><p><span><strong>无若宋人然：宋人有闵其苗之不长而揠之者。</strong>不要像宋国人那个样子，闵：是担心的意思，揠：就是拔，有一个宋国人他很担心自己的禾苗没有长，这个时候他就把苗拔起。</span></p><p><span><strong>芒芒然归。</strong>芒芒：指的是很疲惫无神的样子。这个人在拔苗助长，拔苗以后他很疲惫，首先是很累，接下来是无神，为什么会无神呢？他也不知道这样做到底有没有用。所以，你看当我们做一件事情，我们很疲惫，而且做了之后又不知道有没有结果，不知道有没有成效的时候，就是这种芒芒然的状态。</span></p><p><span>这个时候他开始对别人去讲，<strong>谓其人曰：‘今日病矣！予助苗长矣！’</strong>病：指的是很累，累坏我了。因为他拔苗助长之后很疲惫，并且不知道是否有效果，无神的样子。这个时候，见到其他人，就对其他人讲，说今天可累死我了，我去帮助禾苗生长了。</span></p><p><span><strong>其子趋而往视之，苗则槁矣！</strong>这个时候他的儿子听到了，趋：是快速地跑过去，到那里去查看，结果发现苗槁矣，已经死掉了。</span></p><p><span><strong>天下之不助苗长者，寡矣。</strong>我们听上去，拔苗助长的故事好像很简单，我们怎么会去做拔苗助长的事情呢？可是换到其他的事情上，我们还知道吗？所以这里孟子给了一个结论，说天下不去拔苗助长的人是很少的，想一想我们生活当中的事情是不是如此？</span></p><p><span>我们总是操之过急。比如说，对于我们的感情，我们总是想刻意的去做一点什么。比如说，孩子的学习成绩，我们总是急于求成，急于达到预期的结果，我们就会刻意地去拔苗助长。我们看看生活当中有多少人为了逼迫孩子学习，让他拿到一个好的成绩，最后孩子产生了叛逆的心理，对抗自闭，甚至跟家长已经不再交流，甚至还有的人生起了怨恨之心，这不都是拔苗助长的结果吗？</span></p><p><span>再比如说，我们去做一个生意也是如此，我们总想快速盈利，我什么时候可以快速地赚到钱呢？我什么时候可以把我的费用赚回来？这个时候你的心和你的行为就会走偏，我们如何想着快速地盈利，我们怎么想着把这个利润再加大一点，我们怎么想着把这个费用再节约一点，这都是拔苗助长。</span></p><p><span>所以，我们生活当中有很多事情都是在拔苗助长。在孟子那个时期已然如此，那时至今日更是如此，随着社会的节奏变得越来越快，人心变得越来越浮躁，变得越来越急功近利，做什么事情都想要快速地拿到那个结果，这个时候就会像文中的宋国人一样，去做拔苗助长的事情，可是最后那个结果，你会发现禾苗已经死掉了。</span></p><p><span><strong>以为无益而舍之者，不耘苗者也。</strong>以为这件事情是没有益处，而不去做的人。这段话当中提到了两种人，第一种人就是拔苗助长的人，急于求成。而第二种人就是以为这件事情是没有益处的，因而不去做的人，这里是意有所指的，有的人认为养浩然之气是没有意义的事情，</span></p><p><span>所以就不去做。</span></p><p><span>但是我们学习《孟子》到现在，明白了一个道理，一个人最重要的，就是你呈现出来的这个气。比如说别人和你相处起来是否舒服，这是你的气；别人是否信服你所讲的话，这是你呈现出来的气；当你跟别人交流之时，别人可以听进去几分，这是你散发出来的气；当你做一件事情，是否可以做成，这是你散发出来的气。</span></p><p><span>如果一个人目标是坚定的，你就有坚定之气；如果一个人是勇敢的，你就有勇敢之气；如果一个人是担当的，你就有担当之气；如果一个人是正义的，你就有正气；如果人是有智慧的，你身上散发的就是睿智之气。</span></p><p><span>但是很多人并不明白这个道理，认为养浩然之气是无意的事情，因而就不去做。我们学习到这里，你可以去观察自己，观察身边的人，这个人，你所感受到的人，这个人散发出来的都是那个气，我们意识到了气的重要性，我们可以去向孟子学习，善养吾浩然之气。</span></p><p><span><strong>助之长者，揠苗者也；非徒无益，而又害之！</strong>告诉我们，当你刻意的，想要达到那个结果，急于求成，这是拔苗助长之人，不光这件事情没有益处，反而害了他。</span></p><p><span>我们再来整个总结这一集所讲的内容，这里讲了三种人。第一种人，孟子讲的是善养浩然之气的人，必有事焉而勿正，心勿忘，勿助长也，一定要从事情当中去努力，但是又不期盼那个结果，心时时刻刻没有忘记这件事情，并且不急于求成，这就是善养浩然之气的方法。</span></p><p><span>我们把它延伸出来，不光是善养浩然之气，我们善于做任何一件事情，都是这个道理。比如说我们善于经营感情，我们就知道在具体的事件当中去付出，而我又不期盼结果，我时时刻刻都把对方放在我的心上，我又不刻意地去做拔苗助长的事情。我们说善于学习的人也是如此，我从具体的事件当中去学习，努力刻苦地去积累，但是我又不着急期盼那个结果，我时时刻刻都把学习这件事情放在心上，又不会去做拔苗助长的事情。</span></p><p><span>我们以此类推，无论是你教育孩子，参加工作，做事业都如此。所以善养浩然之气，延伸出来，我们善于做任何事情，都可以用孟子的这个方法。</span></p><p><span>进而又讲到了第二种人，第二种人就是急于求成的人，拔苗助长的人。拔苗助长的人不光对于这件事情无益，反而会带来更多的伤害。</span></p><p><span>比如说，我们着急孩子的考试成绩，你没有耐心去做具体的事情，你只想要那个结果，你就会不停地去逼迫孩子，最后你不光没有帮助他，提升考试成绩，你有可能进而伤害到了他，伤害了我们之间的感情和关系。</span></p><p><span>我们做生意也是如此的，当你是急于求成，拔苗助长之人，你不光没有帮助你把生意做得更好，反而让你的生意快速的灭亡，快速地走到尽头，这就是在伤害它。</span></p><p><span>我们感情也是如此，你总是快速地想要得到预期的结果，而你去急于求成，去拔苗助长，最后，反而让你们的感情变得更加破裂，所以，孟子告诉我们，不要去做急于求成，拔苗助长的人，非徒无益，而又有害。</span></p><p><span>进而又讲到了第三种人，第三种人是认为这件事情无益，所以就不去做的人。</span></p><p><span>比如说，对于孩子学习不好这件事情，我们到底管还是不管？有的人认为说，管又没有什么意义，我干脆就不管了，这同样是错误的。具体的，正确的方式，是我们在具体的事情上帮助孩子提升成绩，但是结果顺其自然就好了。</span></p><p><span>还有很多事情，比如说，养浩然之气也是如此，它并不是无益的，是我们并没有认识到它的好处。再比如说，仁德、忠信、孝顺、亲民，帮助他人，这些事情同样有很多人认为它是无益的，所以就不去做。</span></p><p><span>但是我们学习了以后，明白了一个道理，一个人如果没有仁德之心，你自己不会生活得开心，你也不会让自己变得更有格局，让你的心胸变得更开阔。如果一个人不懂得忠信的道理，你是没有办法在这个社会上立足的，对于朋友，对于感情，对于工作，对于事业，如果自己没有忠信，你又怎么可能把它做下去呢？</span></p><p><span>所以，这些都是有益的事情，只是我们需要通过学习，清醒的、深刻的认识到。当我们知道它是有益的，我们就可以通过事情上去践行，可以善养吾浩然之气，可以善于培养自己的仁德之心，可以善于培养自己的忠信，可以善于养成自己的孝顺，可以善于养成自己的慈爱之心。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-8 知言知人",
    "date": "2022-09-17",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-8 知言知人</strong></span></p><p><span><strong>“何谓知言？”诐辞，知其所蔽；淫辞，知其所陷；邪辞，知其所离。</strong></span></p><p><span><strong>何谓知言？</strong>我们来回顾公孙丑的问题，问孟子有什么擅长的地方，孟子讲，我擅长两点：第一点，是我知言。第二点，才讲到我善养吾浩然之气。但是，我们似乎对浩然之气更感兴趣，问完了浩然之气，接下来公孙丑回过头来再来问，何谓知言。知言到底是什么意思呢？</span></p><p><span>我们看孟子的回答<strong>“诐辞 知其所蔽。”</strong>第一个诐，是偏颇的意思，后面这个蔽，是遮挡的意思。如果一个人讲话是偏颇的，他一定是被什么遮挡住了。</span></p><p><span>我们来举个例子，来理解这句话。盲人摸到大象的耳朵，然后别人让他去形容，说大象是什么样子的？盲人会讲，大象像一个蒲扇一样；可能有的盲人摸到了象腿，这个时候有人又问到了，说大象是什么样子的？他说大象就跟一根柱子是一样的；而有的人可能摸到了大象的身体，他就会去形容说，大象像一堵墙。</span></p><p><span>他们所讲的都叫诐辞，也就是偏颇的言语，他们被什么所遮挡住了呢？被自己的眼睛，因为他们看不到全貌，只是摸到了某一部分，所以讲出来的话就叫做诐辞，因为被遮挡住了。</span></p><p><span>这个故事很好理解，但是我们试着再往生活当中去延伸，看看我们每个人是否都有被遮挡的地方。</span></p><p><span>举个例子，说我喜欢红色，我认为红色的很好看，这就叫诐辞，这是偏颇的言论，你喜欢红色，故而你认为红色好看，这是我们被自己的喜好所遮挡住了，没有看到事情的全貌。可能有的人喜欢黑色，有的人喜欢白色，有的人喜欢蓝色，所以不代表我们喜欢的红色，就一定是好看的。</span></p><p><span>再比如说，我们吃辣的食物,我们觉得很好吃，这个时候我们就会讲出偏颇之语，我们觉得辣的好吃，你不吃辣的菜，怎么会有味道呢？这就叫偏颇，是我们被自己的喜好所遮挡住了，并没有看到事情的全貌。</span></p><p><span>我们来以此思考，我们都会被什么所遮挡住？</span></p><p><span>盲人是被眼睛所遮挡住了，耳聋之人是被耳朵所遮挡住了，那我们绝大多数的人是被认知所遮挡住了，因为我们认知不够，所以就会讲出偏颇的言语，还有很多人是被情绪所遮挡住了，因为我当下很生气，所以我接下来的言论和行为，就会变得偏颇，就是诐辞。因为我们沉浸在情绪当中，就开始看不到事情的全貌和真相。还有很多人是被喜好所遮挡住了，我们刚才举过几个例子，因为我喜欢这个颜色，所以我就认为只有这个颜色才是好看的，选择其他颜色的人，是你的审美有问题，这都叫偏颇之语。</span></p><p><span>看看我们自己的认知，也就是我们每个人的认知，都是有局限的，都是有障碍的，那也就是我们所有人都会有偏颇，产生偏见，我们每个人看到的角度都不是最全面的，我们只是看到了一部分。所以，这个时候我们明白这个道理，就要知道不会轻易地评价一个人，一件事情，或者一个物品，因为你讲的有可能是偏颇之语。</span></p><p><span>我们举个例子，说我面前有个杯子，这个时候，可能别人把这个杯子打破了，这个时候别人可能就会讲出偏颇之语，说杯子没关系，不重要，我再买一个就好了，这就叫偏见。为什么？</span></p><p><span>这个杯子本身可能不值钱，但是它背后有可能有更深刻的意义和价值。比如说，这是我非常敬重的人所送之物。比如说，这是我所爱之人所赠之礼，它背后的意义和价值，就会变得不一样。这个时候，我们就知道了，我们不要轻易地给别人下结论，说这个杯子又不值钱。它不光是事情的本身，它背后可能蕴含着更多的人、事和情感。</span></p><p><span>再比如说，我们看到了一件事情的发生，我们就开始去评价这件事情，就像盲人摸象，我们看到的只是一部分，或者是断章取义，而并不是全面，这个时候你讲出来的话，就是诐辞，因为我们被自己的认知所局限住了，而并没有知道背后的东西，所以怎么能轻易地去下言论？下结论？</span></p><p><span>我们再来看孟子的这句话，说诐辞，知其所蔽。一个人讲出来偏颇的话，就可以知道他是被什么所遮挡住了。我们刚才学习的这段话，如果我们深刻理解了，我们也可以做到孟子这样，诐辞，知其所蔽。当一个人讲出来偏颇的话，有偏见的言论，我们就可以看到，他是被什么所遮挡住了。</span></p><p><span>比如那个盲人，是被眼睛所遮挡住了；听不到的人，是被耳朵所遮挡住了；在有情绪的状态下，讲出来的话和行为，我们就知道，他是被情绪所遮挡住了。还有的人，被自己的喜好所遮挡住了，他喜欢的就认为是好的，正确的，不喜欢的，讨厌的，就认为是不正确的，不好的，这都是喜好所遮挡。还有更多的人是被认知所遮挡住了，因为每个人的认知都是有局限性的。</span></p><p><span>我们不可能了解这个世界上的万事万物，我们可能只是从某一个方面，某一个角度去了解到了，那我们就知道了，别人即使讲出偏颇之语，我们也不会产生什么样的情绪。我们也更不会认为这是无知之人，因为当你这样认为，我们自己就已经陷入了偏颇，每个人的认知都是有局限性的。</span></p><p><span>当我们懂得这个道理，我们就不会苛责于人，我们看清楚的是他背后所遮挡的东西。举个例子，一个人拿出来一个东西，他说这个是世界上最好的东西，你就知道了他是被他的见识所遮挡住了，那是他见过的最好的，但是他以为这个是世界上最好的东西，这就是遮挡。</span></p><p><span>当我们明白这个道理，我们就可以淡然的、清晰的看着身边的人和事，每个人讲出来一句话，我们就知道他是被什么所遮挡住了。</span></p><p><span>第二层，当我们明白这个道理，我们就不会轻易地下断言，我们让自己免于偏颇之语，免于偏见，这个时候，我们就没有那么多对他人和事件的评价。</span></p><p><span>比如说，这个人这样做是对的，那样做是错的，没有。比如说，聪明的人就一定好，愚笨的人就一定不好，那叫偏见。聪明的人，有聪明的好处；愚笨的人，有愚笨的好处；我们说个子高的人，有个子高的好处；个子矮的人，有个子矮的好处；红色有红色的好，蓝色有蓝色的好，没有什么东西是绝对的。当我们有这样的认知，你就不会产生偏颇，也就不会有蔽。</span></p><p><span><strong>淫辞 知其所陷。</strong>淫：就是过度。过度的言语，我会知道他是陷在什么地方了。我们看这个陷字，无法自拔，称之为陷。比如说，一个人深陷在泥潭当中，他是没有能力自己从中出来的，称之为陷。一个人如果产生了过度的行为，或者过度的言语，孟子讲，我就知道他陷在了什么地方。</span></p><p><span>我们看这句话是什么意思？比如说，一个人陷在情绪当中，我现在很愤怒，你去看他讲的话会不会过度，会不会过分，平时这种伤害别人的话，他可能是不会讲的，但是他深陷情绪之中，就会讲过度过分的言语。</span></p><p><span>再比如说一个人，陷在自己自卑的情绪当中，说我现在很自卑，这个时候，他就会不停地自我否定，所以，他讲的话也同样是过度的。别人说其实你很漂亮，我没有那么好看，有很多的缺陷；别人说其实你挺厉害的，这件事情做得不错，说不不不，这件事情我做的并不好，所以他总是沉浸在自卑当中。这个时候他讲的话就会过度，过于自我否定，过于自卑。</span></p><p><span>再比如说，一个陷在自大的状态当中的人，同样他的言语和行为，都是过度的。他认为自己高高在上，认为自己各个方面都要比别人更强，这个时候是瞧不起他人的。所以，他所说出来的话，自然就是过度的，让别人很不开心，并且容易引起别人的仇视。</span></p><p><span>再比如说，得意就会忘形。比如说一个人陷在得意的状态当中，说我这几年顺风顺水，我做什么事情都很顺，这个时候，他讲话就很容易夸大，很容易把一件事情看得很小，很容易看不到危险。所以，一个人无论深陷在任何一种情绪和状态之中，都会产生过度的言语，以及过分的行为。</span></p><p><span>孟子讲，我看到一个人过度的言语，就会知道他是陷在什么之中，他可能陷在自卑之中，可能陷在自大之中，可能陷在愤怒之中，可能陷在得意之中。我们学习了孟子的这种智慧，也可以做到这个样子，听到一个人讲出过度的话，产生过分的行为，我们不会沉浸在表象之中，我们能看到更深刻的道理。</span></p><p><span>他是因为自卑，所以才讲出这样的话，我们就知道，我们想帮助一个人，不是从他的言语上去帮助他，而是调整他深陷在自卑当中的这种状态，他自卑之心开始变得逐渐平稳，去掉了自卑之心，他的言语自然变得适中。</span></p><p><span>如果一个人很自大，我们要想帮助一个人，是帮助他去除掉这颗自大之心，不要让他深陷在自大的状态当中，他的言语和行为，自然就是适中的。</span></p><p><span>如果一个人开始变得得意，我们要懂得让他不要那么得意，任何一件事情都是有好有坏的，当你过于得意，一定就会失意。当他明白这个道理，去掉了得意之心，他的言语自然就是适中的。</span></p><p><span>所以我们学习了孟子的这种智慧，首先可以反观自省，当我们产生过度的言语和过分的行为，我们一定要及时地察觉到，我们是深陷在了什么地方，或自卑、或自大、或开心、或消极、</span><span>或愤怒、或喜悦，都有可能会产生过度的言语。我们及时的觉察，自己及时的调整，同时，我们可以用它去教育孩子，用它去和身边的人相处。</span></p><p><span><strong>邪辞，知其所离。</strong>邪：就是不正。一个人讲出来不正的话，我们要看他背离了什么。</span></p><p><span>举个例子，说一个人不孝顺父母，他讲出来的话，就会是邪辞。比如说，不懂得孝顺父母的人，可能就会讲说，父母都这个年龄了，怎么还没有离开？父母到这个年龄了，怎么还要求那么多？父母从来都没有给过我什么？为什么这个时候我要去给他们更多？你一听就知道了这个人讲的是邪辞，不正的言语。为什么？因为他背离了孝道。</span></p><p><span>好，我们再举个例子，说一个人懂得忠信，如果不懂得忠信之人，就会讲邪辞，背离了忠信，他讲出来的话，自然就是不正的。举个例子，比如说夫妻之间的忠，如果有人对你讲说，没关系，你可以背着你的爱人在外面花天酒地，你一听就知道，这是邪辞，因为这个人他不忠于感情，不忠于婚姻，不忠于家庭。</span></p><p><span>再举个例子，比如说，我们在一个企业工作也是一样，如果有人去讲说，你工作干嘛那么努力？得过且过就可以了，无非是拿个工资。那你就知道了，这个人讲的是邪辞，他说的是不正的言论，因为他没有忠于这份工作，没有忠于自己的岗位。那这样的人，怎么能与他相处呢？</span></p><p><span>再比如说，有的人讲出不正之辞，是因为背离了仁义，我们做事情为什么要为他人考虑呢？一定要先看自己的利益，我得到利益就可以了，至于他们，我们不用去理，你就知道了这个人讲的是邪辞，因为他<span>背离了</span>仁义背离了仁德。</span></p><p><span>所以，我们去看一个人讲出来不正的言论，它背后是背离了什么。有可能是背离了忠贞，有可能是背离了仁德，有可能背离了正义，有可能背离了孝道，也有可能是背离了朋友之间的感情，所以叫邪辞，知其所离。听到一个人讲出不正的言论，我就可以看到他背后背离了什么，也就是相应的缺失了什么。</span></p><p><span>比如说，一个人背离了孝道，我们要想着去帮助这个人，让他明白孝道。比如说，一个人讲的是，如何背着他的爱人做什么不道德的事情，我们就知道，要教给他的是忠贞之道。因为他不懂得家庭是需要和谐的，感情是需要彼此忠贞不渝的。</span></p><p><span>那同样，我们明白这个道理，又可以反观自省，又可以去帮助他人，我们要及时地觉察到，如果我们的言语、言论是不正的，是邪辞，我们去看对应的，我们到底背离了什么？如果背离了仁德，我们去修自己的仁德，如果不够忠贞，我去修正自己的忠贞。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-9 先知言 后知避",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上2-9 先知言 后知避</span></strong></p><p><strong><span>遁辞，知其所穷</span><span>。生于其心，害于其政；发于其政，害于其事。圣人复起，必从吾言矣。宰我、子贡，善为说辞，冉牛、闵子、颜渊，善言德行，孔子兼之，曰：‘我于辞命 则不能也。’</span></strong></p><p><strong><span>遁辞，知其所穷。</span></strong><span>遁：就是闪躲遮掩，一个人讲话如果总是闪躲，顾左右而言他，或者讲话遮遮掩掩，知其所穷。这个时候，你就知道他背后一定是有事情的，他遇到了困境。或者是不足的。</span></p><p><span>我们举个例子，比如说，你问一个人，你最近过得怎么样？他说，还行还行，还可以，挺好的。你就知道了，他讲话是有遮掩的，那就意味着他背后一定是有不足，或者是遇到了什么困难，或者是有事情让他当下并不如意。</span></p><p><span>再比如说，我们对孩子讲，说你的作业写完了没有？他说差不多了，写完了，他讲话是闪躲的，是有遮掩的，底气不足，你就知道一定是有事情。可能是他没有写完，也可能是他有很多作业不知道，可能当时没有注意听讲，老师布置的作业他不完全清楚。</span></p><p><span>再比如说，在夫妻感情当中也是一样的，当你们之间正常的交流，如果他讲话总是闪躲和遮掩的，那就说明一定有事情在瞒着我们，或者其中他遇到了什么困难，是没有办法讲出来的。</span></p><p><span>由此我们就可以知道了，我们看一个人总是躲闪，我们就看他背后到底有什么事情，可能那个事情是需要我们帮助的。</span></p><p><span>比如说孩子，你发现他有遮遮掩掩的时候，他有闪躲，你知道了，就不妨想办法去帮助一下他。你可以直接对他讲，有问题有困难你可以说，是不是作业忘了带回来呢？是不是有一些作业你并不清楚，我们一起想办法来克服。</span></p><p><span>再比如说，当你问到朋友他最近过得如何，如果他总是闪躲的，如果他总是遮遮掩掩，说明他当下可能遇到了什么困难，我们不妨可以问问朋友，你遇到了什么困难？你不妨直说，我看看尽可能的，是否可以帮助到你？这是说到帮助别人。</span></p><p><span>还有另外一种情况，别人在遮遮掩掩，很多事情不能明说，你知道了以后，我们就要懂得这件事情不能再继续问下去了，我们也清晰的了解了他的为人，了解他背后可能做了什么样的事情，我们做到心中有数就可以了。</span></p><p><span>我们再来看整个这四句话，这是孟子讲的知言，诐辞，知其所蔽；淫辞，知其所陷；邪辞，知其所离；遁辞，知其所穷。我们看整个通过这四句话，我们可以看到每个人身上或多或少都会有。</span></p><p><span>比如说，第一个诐辞，知其所蔽。每个人都会有遮挡自己的地方，比如说情绪，比如说喜好，</span></p><p><span>再比如说认知，我们每个人的认知都不可能那么全面，都有所偏颇，这个是人性上的，也就是人性上本身就带的这个东西。</span></p><p><span>那么接下来讲的是心性上的，淫辞，知其所陷。每个人在心性上如果不平稳的时候，比如说开心喜悦，比如说不高兴的时候，比如说愤怒的时候，只要你的心态不够平和，产生波动，</span></p><p><span>都有可能会产生淫辞。</span></p><p><span>从人性最后又讲到了心性，再接下来，又再往下降一降，又讲到了，邪辞，知其所离。这个是我们学识不够，我们没有去学习更多的文化知识和道理，所以就很容易出现邪辞。</span></p><p><span>比如说，没有学习仁义之道，你讲出来的话就不合于仁义；你没有去学习孝道，那么讲出来的话就不合于孝；你不懂得忠信的道理，就会讲出来，不符合忠信的邪辞。</span></p><p><span>再接下来，当我们遇到困难之时，就会讲遁辞，我们可能遇到了困境，可能这个话不足以和别人说，所以就会遮遮掩掩，讲话就是闪躲的。还有可能是我们做了对不起他人的事情，做了欺骗他人的事情，所以导致我们自己的底气不足，这个时候讲话，就会讲出来遁辞。</span></p><p><span>我们看这四点，在我们每个人身上，或多或少都在发生着，我们明白这个道理，就可以看清楚自己，就可以看清楚每一个人，这就是孟子讲的“我知言。”</span></p><p><strong><span>生于其心，害于其政。</span></strong><span>这些言语是从心所生的，从心所生就会害于其政，如果是从政之人就会把偏颇过度的言语、闪躲的言语，以及不正的言语，带到自己的政事当中来，它会影响我们的行为，影响我们的工作。</span></p><p><span>古人都讲从政，我们现在做其他的事情也是如此。如果我们不懂得这个道理，我们自己如果不知言，就会让自己这些偏颇的言语、过度的言语、不正的言语、躲闪的言语，从自己的心而生起，最后影响自己的行为，再到影响我们具体所做的事情当中。</span></p><p><strong><span>发于其政，害于其事</span></strong><span>。如果在你的政事上发出，就会呈现在具体的事情当中，我们刚才举例子了，无论是从政也好，我们工作也好，或者做生意也好，都一样，我们首先要知言，首先要从自己开始修正，如果我们不知道去避免这些言语的发生，就会由我们的心生起，最后就会演变到我们的行为当中来，到我们具体做的事情当中去。</span></p><p><span>比如说，我们不知道邪辞，我们不知道去避免它，就会让我们在工作当中讲很多不正的话，</span></p><p><span>如果我们不懂得遁辞的道理，就会让我们在工作当中总是闪躲，总是遮遮掩掩，为什么会闪躲和遮遮掩掩？可能我们在工作上没有足够的努力，做的不足，自己知道做的不够好，所以当领导问起，我们就会产生闪躲的言语。</span></p><p><span>再比如说诐辞，我们如果不懂得让自己扩大自己的认知，不要讲偏颇的话，这个时候在工作当中，我们就会产生偏颇的行为，我们会认为自己是很优秀的，自己的见解永远是正确的，因而就听不进去领导的话，听不进去同事的话，也听不进去顾客对我们的反馈，进而我们就会产生淫辞。我们接下来会产生更多的情绪，我们在愤怒当中，就会讲过度的话，对同事、对员工、对客户。如果我们觉得自己很厉害的时候，就会产生自大的情绪，产生自大的状态，这个时候，我们就会讲出过度的言语，产生过度的行为。</span></p><p><span>所以要想把一件事情做好，我们首先要知言，不光是做好一件事情。</span></p><p><span>我们说要想教育好孩子，我们得先知言，如果你不知言，你看不清楚很多事情。同样的道理，我们要想经营好这个家庭，我们要先学会知言，既知道自己言语和心理、思维上的变化，同时，又能知道对方的言语和心理上的变化，如此，才可以让家庭变和谐，让亲子关系变得更和睦，让工作变得更顺畅。</span></p><p><strong><span>圣人复起，必从吾言矣</span></strong><span>。孟子讲如果以后还有圣人再出来，必从，就是一定会赞同，和认可我讲的这段话。</span></p><p><strong><span>宰我、子贡，善为说辞，冉牛、闵子、颜渊，善言德行。</span></strong><span>这里列举了孔夫子的五位学生，首先讲宰我与子贡，宰我、子贡善为说辞，这两个人是善于言语，善于讲话的。所以当鲁国有危机之时，孔夫子都是让子贡去处理外交事件，因为他善于讲话，善于琢磨别人的心理，讲话可以讲到别人的心里，所以才能做好外交。并且子贡可以为商，朋友遍及天下，就是因为他善言辞，善把握别人的心理。</span></p><p><span>冉牛、闵子、颜渊，善言德行，我们看颜回、闵子骞和冉牛，他们三个人善言德行，什么意思呢？他们讲的言语更多的都是关于的德行，德行之外的事情，他们并不愿意讲，所以这三位在孔门十哲之中，是以德行著称的。</span></p><p><strong><span>孔子兼之。</span></strong><span>这个时候孟子讲，说孔子是兼之的，既善言辞，既知言，知心，知思维，同时又善言关于德行的事情，言下之意，孔子才是最全面的人。</span></p><p><strong><span>曰：我于辞命 则不能也。</span></strong><span>孔子是兼之的，但是自己却讲，我对于言辞、天命、性命这些事情，我是不清楚的，不知道的。</span></p><p><span>我们看这句话有意思，正好是对应了孟子所讲，我们来回顾公孙丑问孟子，何谓知言。孟子第一句话讲的是，诐辞，知其所蔽，不会讲偏颇的话，才不会被自己的认知所遮挡。所以孔子是兼之的，自己却讲对于言辞，对于天命，对于性命我是不清楚的。</span></p><p><span>因为没有人会说自己真正的清楚，当你说自己真正的清楚，真正的了然，就已经是诐辞了，</span></p><p><span>被自己的认知所遮挡，并没有看到事情的全貌。所以，我们看孟子讲话的逻辑思维很强，首先是孔夫子的谦词。其二，放在这里告诉我们，圣人讲话是没有诐辞的，不会认为自己什么事情都清楚，不会认为自己什么都知道，给我们做了一个很好的典范。</span></p><p><span>我们再来回顾整个公孙丑问孟子的这一段话，公孙丑问孟子老师，老师，你有什么样的长处特点？孟子讲，我有两个特点：第一个特点，叫知言，第二个特点，叫我善养吾浩然之气。</span></p><p><span>我们知道孟子周游列国二十年，他不停地去讲自己仁政的思想，去到每个国家和诸侯国的国君去谈仁政，和各位大夫去谈仁政，和自己的学生们去谈仁政，去讲自己的思想。如果孟子不能知言，要如何去讲自己的思想呢？所以首先知言是一个必不可少的条件和能力。</span></p><p><span>其二，孟子讲，我善养吾浩然之气，我们看言语是不是要配合浩然之气，才可以让你的言语通达？才可以让别人更好地去接受？如果孟子整个呈现出来的不是浩然之气，那么他讲的仁政又有哪位君主可以愿意去听呢？可以向孟子去请教呢？</span></p><p><span>我们由此不妨可以想象一下孟子的形象，首先，孟子他是知言的，他可以清楚地把握每个人的心理变化，到什么样的程度，去讲什么样的话。其二，孟子整个人是散发着浩然之气，傲立于天地之间的。</span></p><p><span>孟子的形象大概就在我们的脑海当中呈现出来了，一个充满着浩然之气，傲立于天地之间的人，并且讲话是可以时刻地讲到对方的心里，只要你开口讲话他就可以准确的知道你心里在想什么，你被什么所障碍住了，你为什么要讲这样的话。当我们脑海当中有了孟夫子的形象，我们就可以去学习做一个又知言，又有浩然之气的人。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-10 仁且智",
    "date": "2022-09-20",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-10 仁且智</strong></span></p><p><span><strong>“然则，夫子既圣矣乎”曰：“恶，是何言也！昔者子贡问于孔子曰：‘夫子圣矣乎？’孔子曰：‘圣，则吾不能；我学不厌而教不倦也。’子贡曰：‘学不厌，智也；教不倦，仁也。仁且智，夫子既圣矣！’夫圣，孔子不居。是何言也！昔者窃闻之：子夏、子游、子张，皆有圣人之一体；冉牛、闵子、颜渊，则具体而微。“敢问所安。”曰：“姑舍是”“曰：伯夷、伊尹，何如？”“曰：不同道，非其君不事，非其民不使，治则进，乱则退，伯夷也。何事非君？何使非民？</strong></span></p><p><span><strong>然则，夫子既圣矣乎。</strong>公孙丑这个时候问孟子：“老师你已经是圣人了？”我们去想，为何公孙丑会有此疑问呢？在之前我们讲过，孟子说：“我知言”，然后又引用了孔夫子的学生们，以及孔夫子本人说：“宰我和子贡善为说辞”，这是一种讲话的技巧。</span></p><p><span>我们很多人是有讲话技巧的，这样的人善于抓住对方的心理变化，善于抓住形式，善于抓住某个事件，所以叫善为说辞。</span></p><p><span>那么接下来，又引用了闵子骞、冉牛、颜回，说这三个人善言德行，善言德行是根本的智慧，我们把第一种人称之为技巧，他善于讲话的技巧，善于某个领域。但是第二种人不一样，他抓住了根本智慧，所以叫善言德行，什么意思呢？</span></p><p><span>举个例子，颜回、闵子骞这样的人，他是有德行的行为，他是懂得修德的，那么接下来他所讲的话，自然就是善言德行的。当一个人善于用德去修正自己，善言德行，无论你讲任何一件事情，都可以抓住那个事情的根本，所以，我们说善言德行是根本的智慧。</span></p><p><span>举个例子，一个人懂得修德，那么无论你去跟任何人交流，无论交流任何一个行业和任何一件事，你都可以抓到这个事情的根本，就是他有没有德。</span></p><p><span>但是孔子兼之，就是孔子既有根本的智慧，有这个德行，善言德行，同时，他又掌握了说话的技巧，可以善于把握对方的心理，善于把握形势。因为孟子可以看到孔子的高度，我们想，站在同等高度的人，才能看到那个高度的事情。既然孟子可以看到子贡和宰我擅长的是说辞，擅长讲话，擅长外交，又可以看到闵子骞，颜回他们擅长的是言德行，也就是修德，抓住了根本智慧，又可以看到孔夫子是兼之的。</span></p><p><span>公孙丑有此疑问，既然孟子可以看到这些事情，就说明孟子达到了高度，故而问孟子，老师，你已经是圣人的境界了。</span></p><p><span><strong>曰：恶，是何言也！</strong>恶是叹词，说你这是讲的什么话？我怎么可以以圣人自称？</span></p><p><span><strong>昔者子贡问于孔子曰：夫子圣矣乎？</strong>接下来引用了一件事情，说，从前子贡问孔夫子，说老师，您是圣人了吧？同样，子贡也认为自己的老师是圣人，我们看孔子是如何作答的。</span></p><p><span><strong>孔子曰：圣，则吾不能，我学不厌而教不倦也。</strong>子贡认为孔夫子是圣人，但是孔子说圣，则吾不能，说圣人我是达不到的，我只是学而不厌，教而不倦。我们看孔夫子说他只做了两件事情而已，第一件事情，就是学而不厌，我不停地去学习修我自己，提升我自己。第二件事情，在我提升自己之后，我教会他人永不厌倦，我只是做了这两件事情而已，至于子贡所讲的圣人的境界，我是达不到的。</span></p><p><span><strong>子贡曰：学不厌，智也；教不倦，仁也，仁且智，夫子既圣矣。</strong>子贡说，学不厌倦，智也，因为学习不厌倦、不停止，就会增加智慧。教不倦，仁也，教诲他人不厌倦，这是仁的体现。我们去想一个人怎样才能做到教诲他人而不厌倦呢？</span></p><p><span>就是因为内心有足够的仁爱，有足够的仁德，所以不停地去教别人，并不厌弃对方，不厌其烦地去讲给对方听，去教诲更多的人，希望更多的人可以有德行，可以有智慧，可以生活得更好。所以仁且智，这就是圣人所呈现出来的表现。</span></p><p><span>我们这里可以来思考，一个圣人的指标，就是仁且智，不停地学习不厌倦，就是在提升自己智慧的过程，然后用自己的智慧，可以去帮助更多的人，这就是仁德的体现。</span></p><p><span>所以圣人是仁且智，缺一不可。如果一个人说我只有仁德之心，我想帮助别人，但是我却没有智慧，这个时候你是没有办法真正地帮助别人，因为我们告诉对方追求的东西，有可能是错的，有可能是本末倒置的。所以只有仁德不够，要加上智慧。</span></p><p><span>只有智慧也是不够的，只有智慧，没有那颗仁爱之心，不会去做真正地帮助别人的事情，那么只是聪明而已，只是智者，但是并不愿意更多地付出和教诲他人。</span></p><p><span>所以我们这一生要做的事情，无非是仁且智，不停地去帮助他人，教诲他人，这就是仁。不停地去学习自我提升，自我修行，这就是智。</span></p><p><span><strong>夫圣，孔子不居。是何言也！</strong>这个时候，孟子再次强调，关于圣人，孔夫子都不居，你讲的这是什么话？</span></p><p><span><strong>昔者窃闻之：子夏、子游、子张，皆有圣人之一体；</strong>窃闻，是私下里说，曾经私下里听说过，子夏、子游、子张，这三个人都有圣人的一体，指的是一方面，某些特点。子夏以文学著称，并且是孔夫子的得意门生，子游被称为南方夫子，因为有了子游，孔夫子的道才传到了南方。子张善于交友，朋友遍天下，所以说他们身上的特点，都是圣人身上的某一方面。</span></p><p><span><strong>冉牛、闵子、颜渊，则具体而微。</strong>那说到冉牛、闵子骞、颜回，这三个得意的门生都是以德行著称的。说他们是具备了圣人全面的特点，但是而微，还比较浅薄微小，没有那么高的深度和那么高的境界。</span></p><p><span>我们再来看，以德行著称的闵子骞和颜回，说他们身上的特点，和圣人的特点基本是符合的。</span><span>但是有一点就是不足，因为他们还比较浅薄，还比较微小，全面，但是并没有达到圣人的境界。</span></p><p><span><strong>敢问所安。</strong>这个时候，公孙丑又问孟子了，安是指的什么？您是什么样子的？您的追求是什么？您觉得您以什么立命？言下之意就是在问孟子，老师您觉得您跟提到的这几位，哪一位比较相似呢？是像孔子，但是孟子又不以和孔子相比而自居，那是像颜回，是像闵子骞，还是像子夏，还是像子游，亦或是子张和冉牛呢？</span></p><p><span><strong>曰：姑舍是。</strong>这个时候孟子讲，暂且不提，说不谈这个话题了，为什么呢？没有办法去作对比。</span></p><p><span>我们说对于颜回的了解，对于闵子骞的了解，对于子游和子夏的了解，我们只是通过了《论语》，和过去听说的一些事情，并没有更多全面的资料，而且也不是和我们同时代的人，并没有那么了解，所以，就没办法说我和谁更相似。但是公孙丑一定是锲而不舍的，因为他想更多地去了解孟子，了解自己的老师到底是一个什么样的人，他到底是一种什么样的状态？他的追求到底是什么呢？</span></p><p><span>所以进而又问道<strong>曰：伯夷、伊尹，何如？</strong>说伯夷和伊尹这两位，您是怎么看待的？因为在公孙丑的心中，伯夷和伊尹都是圣贤之人，都是有德行的人，所以就想继续去对比，想要去了解孟子到底是一个什么样的人，他心中的想法到底是什么样子的。</span></p><p><span><strong>曰：不同道。</strong>首先说了伯夷和伊尹，他们的处事方法各不相同，他们的性格，他们的选择也各不相同。</span></p><p><span><strong>非其君不事，非其民不使。</strong>说不是自己的君主，我不去事奉，不是自己国家的百姓，我不去使用。</span></p><p><span><strong>治则进，乱则退，伯夷也。</strong>治，就是世道，好的时候我就进，去做事情，乱则退，如果出现天下大乱，我就归隐。说这是伯夷的道，也是伯夷的处事风格，行为准则。</span></p><p><span>我们去回顾伯夷其人，伯夷和叔齐是古代有名的贤人君子，因为他们两个互相让国君的位置，谁也不愿意去做。商纣王后期昏庸无道，才有了武王伐纣，伯夷和叔齐想拦着武王，不想让武王去伐纣，但是武王自然为天下百姓着想，还是去伐了纣王。后来建立了周朝，伯夷和叔齐这两个人是不食周粟的，因为改朝换代，甚至连周朝的粮食都不吃，更不要说事奉周朝的君主，和爱戴周朝的百姓，这就是伯夷的行事作风。</span></p><p><span><strong>何事非君？何使非民？</strong>这两句话是孟子自己的想法，说事奉谁的君主，又不是事奉呢？哪一个百姓又不是自己的百姓呢？言下之意，是在讲伯夷不懂得变通，他在守旧，只守着自己认定的过去的君主，和过去的百姓。</span></p><p><span>伯夷是有德行之人，是一位君子，但是道不同，我不赞同他的行事作风。也就是在孟子看来，</span><span>你事奉什么样的君主，又有什么区别呢？使用什么样的百姓，又有什么区别？如果这位君主他是贤德的，是为天下百姓着想的，我们就应该去尽一份力量，哪有那么多的分别？</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-11 进退自如",
    "date": "2022-09-23",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-11 进退自如</strong></span></p><p><span><strong>治亦进，乱亦进，伊尹也。可以仕则仕，可以止则止，可以久则久，可以速则速，孔子也。皆古圣人也，吾未能有行焉；乃所愿，则学孔子也。</strong></span></p><p><span><strong>治亦进，乱亦进，伊尹也。</strong>接下来又提到了伊尹，伊尹和伯夷不同，伊尹是治亦进，乱亦进。说政治清明，我就去做事情；即使是国家昏乱，我同样在做事情，我们听到这里，是不是会觉得伊尹好像是更懂得变通？</span></p><p><span>伊尹辅佐了五代君王，其中也有君王不贤德，比如说，太甲被伊尹放逐桐宫去反思，所以伊尹是无论国家到了什么样的状态，他都是要进取的。</span></p><p><span>除了孟子回答了公孙丑关于伯夷和伊尹的看法。孟子自己又提到了第三个人，<strong>可以仕则仕，可以止则止，可以久则久，可以速则速，孔子也。</strong></span></p><p><span>孟子这里又提到了孔子，可以仕则仕，孔子在鲁国做到了大司寇，并且摄相事。可以止则止，当孔夫子在鲁国发现不能以道事君，不能实现自己的政治理想，随时都是可以停止的。包括孔夫子十四年周游列国的过程当中，都是坚持以道事君，不可则止。我想要去从政，实现自己的政治理想，但是如果这个政治环境，或者这个君主不能推行仁政，不能去以德行治国，不可以为政以德，那么就是随时可以停止，随时可以离开。</span></p><p><span>可以久则久，一件事情如果可以做的长久，就按照长久的打算去做。比如说，孔夫子到了晚年周游列国以后，发现并不能实现自己的政治理想，就停止从政这条路，晚年著书立作，所以，我们今天才有了四书五经。</span></p><p><span>可以速则速，一件事情需要快速地解决，那么就快速地完成，绝不拖沓，这是孔子的作风。</span></p><p><span>我们再来回顾这一段，其实提到了三种人：第一种人，提到了伯夷，伯夷是不知进的人，不会随着时代的发展，去进取的人。周武王是比商纣王更贤明的君主，所以已经改朝换代，但是伯夷并不会知进，他坚守自己的原则，守旧，保持自己的君子之风，不食周粟，饿死在首阳山。这样的人我们是赞叹的，贤人君子有德行，固守原则。</span></p><p><span>那又提到了第二种人，伊尹，伊尹是知进不知退，无论是治世还是乱世，都要去进取的，都要去按照自己的想法和理想去做事情的人。</span></p><p><span>进而又提到了第三种人，孔子是可以为仕就为仕，实现自己的政治理想，当发现不能实现自己的政治理想，可以止，随时可以停止，也可以按照长久的规划去做事情，也可以按照短期的计划去做事情。所以我们说，孔子这样的人是进退自如的人，拿得起，放得下，无论做任何一件事情都可以。</span></p><p><span>我们再来延伸这三种人，在我们的生活当中其实很常见。有的人是不知进的，也就是因循守旧之人，不懂得变通，不会随着时代的发展去做事情。比如说现在社会上、时代上所流行的东西，很多我们过去抱着固有思想的人，是不会变通的，还按照自己过去认准的方法去做事情，但是时代已经变了，消费的群体已经变了，人们关注的地方已经变了，如果还在因循守旧，是没有办法跟上时代的进步和发展的。</span></p><p><span>那么第二种人是不停地进取的人，但是不懂得退。我们举个例子，比如说伊尹，比如说，我们熟知的三国时期的诸葛亮，这样的人都是知进而不知退的人，他会一直的进取去做一件事情，去实现自己的理想。</span></p><p><span>生活当中这样的人很多，比如说，工作当中，我们可以看到一直在积极进取的人；比如说，在事业上我们可以看到一直在进步的人。所以，这样的人值得我们去学习，但是当你不懂得退，就可能给自己带来很多的麻烦，并且这样的人是不懂得休息的。</span></p><p><span>那么还有第三种人，进退自如的人。这样的人需要有极高的境界，并且没有自己的欲望，所以可行可止，可做可不做，无可无不可。显然孟子他是更赞同孔子的做法，所以当公孙丑问起伯夷和伊尹何如，孟子讲，不同道，大家的行为准则不一样，处理事情的方式不一样而已。</span></p><p><span><strong>皆古圣人也，吾未能有行焉。</strong>接下来回答了公孙丑，伯夷、伊尹都是古之圣人也，我都是达不到的，因为我并没有去做那些事情。我也没有像伊尹一样治亦进，乱亦进；我也没有像伯夷一样，固守自己的原则，什么事情都不去做，不会跟着时代的发展。他们都是古之圣贤，很赞叹，但是我并不愿意做这样的人。</span></p><p><span>故而接下来讲到<strong>乃所愿，则学孔子也。</strong>说我自己心中的理想，我的愿望是学习孔子这样的人。学习孔子的进退自如，可行可止。</span></p><p><span>如果有机会实现自己的政治抱负，那就去从政；如果发现不能以道事君，不能推行自己的政治主张，我就不可则止。我可以为了长久的事情去打算，我可以短期的做一件事情，无论如何，都可以安然自处，我并没有什么样的欲望，我也没有什么样固定的想法，所以才能进退自如。</span></p><p><span>我们再来看孟子的想法，他并不愿意和颜回、子贡、子张、子游、子夏去对比，因为他认为自己不了解，也并不愿意去做伊尹和伯夷这样的人，因为那与自己的处事风格是各不相同的。如果非要问我的理想和我心中所愿，我是想学习孔子这样的人。</span></p><p><span>这句话，我们可以看到孟子的思想是非常的通透与豁达的，他不论对错，不讲是非，不论高低，说这些人都是古之圣人，但是我并不是觉得他们好，或者是不好，只是我的行为处事的方式与他们各不相同。我更愿意去学习孔子这样的人。</span></p><p><span>当我们有了这种思维，我们再去看待生活当中的事情，就会变简单。</span></p><p><span>比如说，伯夷这样的人，我们很赞叹，贤人君子，固守原则；伊尹这样的人，我们也赞叹，因为他不停地在追求自己的理想，积极进取。那么子夏这样的人，我们也很赞叹，他是以文学著称的；颜回这样的人，我们也很赞叹，因为他有德行；子贡和宰我这样的人，我们也很赞叹，因为他们是口才很好的人，善于讲话，善于交友之人。</span></p><p><span>每个人的理想都是好的，每个人的处事方式并没有对与错，只是性格不同，追寻的理想不同，所处的环境不同而已，但是，我更愿意学孔子这样进退自如的人。</span></p><p><span>我们这里可以再上升一个境界来讲，我们去想，为什么孔子可以仕则仕?可以止则止？我们看“可以”这两个字很有意思，什么叫“可以”呢？外界的条件和环境允许了，称之为“可以”。</span></p><p><span>比如说，伯夷、武王显然是比商纣王更仁德的，更是一位贤明之君，我们看从环境和条件上，他是可以仕的，但是伯夷并没有仕，为什么呢？因为伯夷被忠所牵绊，他忠于自己的国家，忠于自己的百姓，当他被忠所牵绊，他就不知进，没有办法再为周朝去做事情。</span></p><p><span>我们再看伊尹是不是如此？他也是被忠所牵绊。比如说，无论这个君主是好，还是不好，无论是治世还是乱世，他都可以为仕，他都是知进而不知退的。同样是因为那个忠的思想所以牵绊住了，就没有办法像孔子一样可以仕则仕，可以止则止。</span></p><p><span>我们引用的诸葛亮，孔明先生也是如此，他也是被忠所牵绊，因为他感恩刘备对他的知遇之恩，所以才想为刘备的后人夺得天下，让天下一统。但是他自己的内心显然知道，这是做不到的。</span></p><p><span>我们这个时候再来看，为什么孔夫子可以不被这些事情所牵绊呢？因为他不沉浸在情之中。</span></p><p><span>我们举个例子，比如说，孔夫子他的儿子孔鲤去世之时，是有棺无椁的，因为按照礼制，他是不能用椁的，只能用棺。他最心爱的，最得意的弟子——颜回去世之时，颜回的父亲来请求孔夫子，卖掉自己的马车，让颜回可以有椁。颜回离世之时，孔夫子是非常悲痛的，甚至感叹说“天丧我！天丧我！”但是孔夫子依然没有卖掉自己的马车。</span></p><p><span>孔夫子讲，按照礼制我是做大夫的人，做过大夫的人，是不能卖掉自己的马车而步行的。所以，颜回他虽然是我心爱的学生，但是也不可以有椁，我自己的儿子离世，他也是没有椁的。以此我们就可以看到，孔夫子他不为情所牵绊，他只看当下的形势可不可以这样去做，如果按礼制可以做则做，不可以做则不做。</span></p><p><span>所以我们可以看孔夫子的境界，可以仕则仕，可以止则止，就是因为他不被情所牵绊，他心中所想的都是大仁、大义、大忠，他的东西大，就区别了小。</span></p><p><span>我们讲伯夷的忠，他是小忠，忠于自己过去的君主，但是已经改朝换代了，并且新上任的君主武王，他是为了天下百姓的，如果能舍弃那个小忠，不被小忠所牵绊，他是可以去做更多事情的。</span></p><p><span>我们在《论语》当中有讲过，孔夫子赞叹管仲，是因为管仲看到的是大仁大义，他并没有因为自己辅佐的公子纠离世，而自己也选择自杀。而是选择辅佐齐桓公，因为他想的是齐国的百姓，甚至是天下的百姓，这就是大仁大义。</span></p><p><span>我们回过来再看孔夫子的境界，可以仕则仕，可以止则止，可以久则久，可以速则速。就是因为他不会沉浸在任何情之中。孔夫子讲仁、讲义，但是却不被仁和义所牵绊；讲忠、讲信，却不被忠和信所牵绊。这是我们有了忠信、仁爱的基础之上，还能不被这些牵绊，是一种极高的境界。</span></p><p><span>所以，孟子讲到孔夫子，是非常地赞叹和认同的，说像孔子这样的人，我是达不到的，并且生民未有，自从有人类以来，没有达到孔子这样境界和这么大贡献的人。</span></p><p><span>但是，我们向往孔夫子这样的境界，我们要明白其中的道理，一个人要有情有义，但是你又不能被情义所牵绊，这是一种修为，这是一种境界。</span></p><p><span>伯夷和伊尹都是古之圣贤，都是值得我们学习和效法的。但是孔夫子他具备了更高的境界和修为。所以，孟子讲伊尹和伯夷所做的事情，我是达不到的，但是如果非问我心中所愿，我想学习的是孔子这样的人，所以，孔子的境界虽然极难达到，但是我们也可以去学习。</span></p><p><span>一个人要学习忠信，要有情有义，但是还能不被情所牵绊，不被自己的欲望所牵绊，不因为身边亲近的人，而破坏了自己心中的仁义、道德，这个时候，才能可进可退，可行可止。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-12 生民未有",
    "date": "2022-09-22",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上②-12 生民未有</strong></span></p><p><span><strong>“伯夷、伊尹于孔子，若是班乎？”曰：“否。自有生民以来，未有孔子也！”曰：“然则有同与？”曰：“有。得百里之地而君之，皆能以朝诸侯，有天下；行一不义，杀一不辜，而得天下，皆不为也。是则同。”曰：“敢问其所以异？”“曰：“宰我、子贡、有若，智足以知圣人；汙不至阿其所好。 宰我曰：‘以予观于夫子，贤于尧舜远矣。’”</strong></span></p><p><span><strong>伯夷、伊尹于孔子，若是班乎？</strong>我们看这个“班”字，同等、类似、一样，公孙丑问孟子说：“伯夷、伊尹，对比于孔子，他们三个是同等的人吗？是相似的人吗？”</span></p><p><span>为什么会有此一问呢？我们在上一节课程当中讲过，说伯夷不知进，伊尹不知退，孔子是可进可退，进退自如之人。但是孟子又讲：“皆古之圣人也。”说这三位都是古之圣人，只是不同道，每个人的处事风格各不相同而已。</span></p><p><span>这个时候公孙丑又问，他们是同样的人吗？</span></p><p><span>孟子回答，<strong>曰：否。</strong>不一样。<strong>自有生民以来，未有孔子也！</strong>自从有人类以来没有像孔子这样的人。我们可以看到孟子对于孔子是极其推崇的，他认为自有人类以来，是没有人可以像孔子一样的，也就是没有和他同等的人。</span></p><p><span><strong>曰：然则有同与？</strong>公孙丑继续问了，既然他们不是同类人，那有没有相同的地方呢？</span></p><p><span>我们看这句话问得很有智慧，深入灵魂。为什么会这么讲呢？看看我们平时的思维，总想问那个不同点。比如说，我们可能会问孔子与他们有哪些不同，他的优点在什么地方，就是我们的关注点总是在最好的，最优秀的那个人身上。</span></p><p><span>比如说，我们去找一个工作，总想去找一个最好的工作；我们想去了解一个事物，总想去看那个最好的；比如说，我们想学习，我们总想问谁是在这方面最优秀的，最好的那个，我们向他学习。我们总是想看不同点，但我们看公孙丑的思维很有意思，他说，他们相同的地方在哪里呢？他们相同的地方也就是古之圣人共同的特点，而不是不同的地方。</span></p><p><span>孔子的不同的地方是没有人可以达到的，这是孟子的思想，说孔子这样的人如果你去找他身上那个优于别人的地方，那个不同，自有人类以来是没有的。所以公孙丑这个时候，就反过来问了伯夷和伊尹，既然也能称为圣人，他们和孔子身上的共同点，相同之处在什么地方？</span></p><p><span>我们再换一种思维，比如说，在生活当中有很多事业有成的人，我们可以去了解这些事业有成的人，身上的共同点是什么。比如说，是不是有担当的？是不是有德行的？是不是有创造力的？就是我们找到共同点，我们就可以向他去学习，而不是找到他那个不同点。</span></p><p><span>他身上优于别人的地方可能是他的天赋，不是我们轻易可以达到的，就是我们总是急于求成，想向最优秀的那个人，直接去学习他身上的特点，但实则这个方式并不太正确，我们要先去学习绝大多数成功人身上的共同点。</span></p><p><span>当我们有共同点，我们再向不同的地方再去出发。比如说，我们想直接像孔子这样，这是很难的，但是，我们先可以学习像伯夷和伊尹这样的人，既然可以成为圣人，我们先达到他们身上的境界，这个时候，我们才可以再上一步。所以，我们看公孙丑的这种思维，其实更适合绝大多数人去思考。</span></p><p><span>我们接下来看他们身上的共同之处有哪些呢？</span></p><p><span><strong>曰：有。</strong>孟子说，他们身上有共同点，我们看看都哪里相同？</span></p><p><span><strong>得百里之地而君之，皆能以朝诸侯，有天下。</strong>如果给他们方圆百里的土地，而君之，让他们来做君主，都可以让诸侯来朝，并且可以统一整个天下。我们看这一句话，说他们三位都有一个共同的特点，就是能力加德行，给他们方圆百里的土地，他们是有能力和德行让诸侯来朝，可以一统天下的。</span></p><p><span>我们去看，齐国有土地方圆千里，但是这里又举了个例子，说伯夷、伊尹和孔子的德行以及能力，都足以让他们统一整个天下，以实行王道。也就是这三位，他们的德行的根基是一样的，他们可以实行王道的能力是一样的。</span></p><p><span><strong>行一不义，杀一不辜，而得天下，皆不为也。</strong>如果让他们去做一件不义之事，杀一个无辜之人，而拥有天下，皆不为也。他们三位都不会去做这样的事情，我们看，说第二个共同点，就是他们的道德底线是相同的。</span></p><p><span>说的第一点是德行和能力，给他们方圆百里，是有足够的德行和能力让天下诸侯来朝，进而实行王道统一天下。那么第二个相同点，就是他们的道德底线相同，即使是拥有整个天下，但是如果做了一件不合于义的，杀了一个无辜之人，都不会去为的，不会触碰到那个道德底线。</span></p><p><span><strong>是则同。</strong>讲了两点相同的地方，我们这个时候又不禁要去思考了，既然这三位古之圣人，他们的道德基础，他们的能力是相同的，他们的道德底线也是相同的，不会去做不义和杀害无辜的事情，即使得了天下也绝不为。既然有这么多相同的地方，但是孟子又讲伯夷和伊尹，是没有办法和孔子相提并论，相比较的。因为孔子自生民以来，未有像他这样的人。</span></p><p><span>这个时候，我们就要继续想，有了这个相同的德行和能力，以及底线为基础，他们的不同点到底在什么地方？</span></p><p><span>我们看看孟子是怎么看待的。<strong>曰：敢问其所以异？</strong>公孙丑问了，敢问他们有什么不同的地方呢？我们去想有谁是更了解孔子的？是不是他身边的学生？他身边有智慧的学生会更加地了解孔子。所以，孟子接下来引用孔夫子身边的三位学生，他们对于孔夫子的看法，我们才能更加清楚地去了解，为什么孔夫子是很伟大的，生民未有。</span></p><p><span><strong>曰：宰我、子贡、有若，智足以知圣人。</strong>孟子讲宰我，子贡和有若这三个人，他们的智慧足以去了解和辨别圣人。</span></p><p><span><strong>汙不至阿其所好。</strong>即使他们讲话夸大、夸张，也绝不至于谄媚，投其所好。这句话在讲什么呢？</span></p><p><span>因为孔夫子是宰我、子贡、有若的老师，但是这三位学生都是智者，他们的智慧足以去了解和辨别一位圣人，他们即使说话有夸张，也绝不可能是谄媚的，无缘无故地去说自己的老师有多好。所以，首先对宰我、子贡、有若是肯定的，他们的智慧是足够了解圣人的，并且他们讲话绝不会阿其所好，也就是他们讲的话一定是真实的。</span></p><p><span>我们看他们是如何评价孔夫子的？<strong>宰我曰：以予观于夫子，贤于尧舜远矣。</strong>宰我讲了一句话，以我来观察夫子，要远远贤于尧舜。</span></p><p><span>我们学过《论语》，学过《孟子》都会知道，孔夫子是赞叹尧舜的，尧舜可以禅让天下，不为一己私利，并且为百姓做了很多事情。比如说去开集市，可以方便百姓去做贸易。比如说，制定了很多文化礼仪，做了很多利民的事情，并且是以仁德治天下的。舜是以孝著称的，他们为百姓做了很多事情，利益了很多当时的百姓。</span></p><p><span>但是这里宰我却说，孔夫子要远远贤于尧舜，为什么呢？</span></p><p><span>我们来思考这个话题，从我们现在两千五百年之后，我们来看尧舜固然伟大，但是更多地，他利益的是他同时代的那些百姓，对于两千五百年以后的我们，好像我们受到的益处，并不是那么多。</span></p><p><span>但是孔子则不同，因为有了孔子，我们才有了文化的传承，我们今天才可以学习到四书五经，今天我们的祖国才可以被称为礼仪之邦，这些都是源于孔子的贡献。我们去读整个从春秋以后的历史，读书人都是以孔子为楷模的，读书人从小就要立志的，这个志从哪里来呢？从孔夫子的思想当中来。所以，孔夫子的思想流传了两千五百年，我们相信再下去几千年，依然会有人学习孔子的思想，这就是他的贡献。</span></p><p><span>所以孟子才会讲孔子这样的人，自有人类以来，是没有出现过的，没有人可以比孔子更伟大，就是因为他对后世的贡献，价值和影响是极其深远的。</span></p><p><span>我们回头再来体会伯夷和伊尹，虽然也是古之圣人，他们有自己的品德，他们有自己的中正，但是，我们现在并没有受到伯夷和伊尹的益处，伊尹已经做到了一个国家的一人之下，万人之上，也并没有对我们后世的人影响像孔子这样深远。</span></p><p><span>所以，这也是孟子一生为学，而没有为官的原因之所在，因为他是想要效法孔子的，他想要学习孔子，让自己一生主张的思想，可以流传到后世，它的影响会变得更加深远。后来我们讲孔孟之道，把孟子和孔子放在了同等的地位，因为他们做的是一样的事情，所以宰我才讲，孔子要远远的贤于尧舜，就是因为他对后世的贡献，价值和影响，更大、更深远。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-13 出类拔萃",
    "date": "2022-09-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-13 出类拔萃</strong></span></p><p><span><strong>子贡曰：‘见其礼而知其政，闻其乐而知其德，由百世之后，等百世之王，莫之能违也。自生民以来，未有夫子也！’有若曰：‘其惟民哉？麒麟之于走兽，凤凰之于飞鸟，泰山之于丘垤，河海之于行潦，类也。圣人之于民，亦类也；出于其类，拔乎其萃，自生民以来，未有盛于孔子也！’</strong></span></p><p><strong><span>子贡曰：‘见其礼而知其政，闻其乐而知其德。</span></strong><span>看见一个国家的礼仪，就可以知道他的政治；听到一个国家的音乐，就可以看到他的德行，看到这里的风气。</span></p><p><strong><span>由百世之后，等百世之王，莫之能违也。</span></strong><span>我们先看这里的等，就是评价，来自于后世的，或者叫历史的评价，这个称之为等。我们再看这句话的意思，即使一百代以后，他的评价出来了，也并不会违背这个道理。</span></p><p><span>什么意思？他在讲孔夫子留下了一个思维体系。什么思维体系？见其礼而知其政，闻其乐而知其德，这个道理。即使过了一百代君王，也没有违背的。</span></p><p><span>所以讲，孔夫子留下的这种思维体系，它是可以一直流传下去的，没有可以违背这个道理的时候。我们去看一个国家，你看到他有没有礼，你就知道他是如何为政的；你听他的乐，你就知道这个国家有没有德行。</span></p><p><span>以前的乐，是用《诗经》的内容为词，所以《诗经》都是讲美好的东西，都是讲有德行的东西，都是讲仁爱。如果这个国家的乐是淫词，淫是过度的意思，如果是淫词，过度享乐的，你就知道这个国家不重视品德。所以，他讲的规律，后世是没有办法违背的。</span></p><p><span>我们现在也是如此，我们如何分辨一个人是好，还是不好呢？</span></p><p><span>我们通过言行貌好。我们去看这个人所讲的话，他讲的话是不是正义的，是不是歪理，符不符合仁、义、礼、智、信；我们再看他的行为，他的行为是否懂得为别人着想的，是否是仁爱他人的；我们再看他呈现出来的状态样子，我们再看他的喜好，我们通过言、行、貌、好，就可以看到一个人内在有什么。</span></p><p><span>举个例子，我们去看一个人有没有德行，我们可以通过他的行为，可以通过他的言语。我们看到一个人是否孝顺，我们可以通过他的行为，是否孝顺父母，我们可以通过他的言语，平时对于父母这件事情，他是如何讲的。</span></p><p><span>我们看一个员工是否可以用，我们看他有没有敬畏之心，对公司的领导，对自己所做的事情，对自己在的企业，是不是有敬畏的。我们接下来再看他这个人，是否可以忠于自己所做的事情。我们还要看这个人是否有德行，他做的事情是否想着为这个企业，为他的客户创造价值，我们就知道这个员工可不可以用。</span></p><p><span>我们想谈一段恋爱，也是一样的。我们经常讲，你要看他的人品是否是正的，你要看他是如何对待他人的，你要看这个人是否是忠贞的。</span></p><p><span>这些思维体系从哪里来？</span></p><p><span>从孔夫子的思维当中来。因为孔夫子讲了仁、义、礼、智、信，讲了儒家学说，所以，我们现在才有了观察事物的思想，才有了观察事物的角度，这就是子贡说的孔子伟大的地方。</span></p><p><span>那个时候，因为国家主要的事情是政事，所以到每一个国家，你看他是否注重礼，你就知道他的政事；看他是否注重乐，你就知道他是什么样的品德，国家是什么样的风气。</span></p><p><span>演变到了现在，我们所能应用的部分，就会变得更广泛。我们去观察一个国家，去观察一个企业，去观察一个人，我们都可以通过礼乐，都可以通过孔子所讲的仁、义、礼、智、信、忠、孝、敬，这些去观察。所以，这就是规律，而这种规律，源于孔子的这种文化体系。</span></p><p><strong><span>自生民以来，未有夫子也！</span></strong><span>子贡说了，自有人类以来，没有像夫子这样的人，没有一个人可以像孔子的贡献和价值那么深远，没有人像孔子一样，可以建立一套思想体系，影响后世百代君王之后，我们现在来看，他可以影响数千年。</span></p><p><span>这就是宰我和子贡，还有孟子赞叹孔子的地方，说他的贤德，远远要贤于尧舜的；说他的德行，是生民以来未有过的。从来没有一个人像孔子这样，对后世影响那么深远。</span></p><p><span>他所建立的思想，他所推行的礼仪，上可以影响到一位国君治理国家，中可以影响到一个朝代的读书人，这些大臣，他们都是用儒家的文化去治国的，下可以影响到每一位百姓的安身立命。</span></p><p><strong><span>有若曰：其惟民哉？</span></strong><span>这里的民，指的是百姓，我们再翻译过来，指的是人，说岂止是人这样啊？</span></p><p><span>接下来开始举例子了，<strong>麒麟之于走兽。</strong>麒麟是走兽的一种，但是它却远远优于其他的走兽。</span></p><p><strong><span>凤凰之于飞鸟。</span></strong><span>凤凰也是鸟类的，但是它跟其他的鸟类既相同，也不相同。</span></p><p><strong><span>泰山之于丘垤。</span></strong><span>丘垤，指的是土丘，小土堆。泰山对于小土堆来讲，它虽然是山，但是远远高于普通的小土堆。</span></p><p><strong><span>河海之于行潦。</span></strong><span>行潦，指的是水洼，小水沟。河海与小水沟，类也。我们刚才所讲到的都是同类，比如说麒麟与走兽，凤凰与飞鸟，泰山与丘垤，河海与行潦，他们都是同类，但是又远远高出同类。</span></p><p><strong><span>圣人之于民，亦类也。</span></strong><span>圣人与百姓而言，也是同类。</span></p><p><strong><span>出于其类，拔乎其萃。</span></strong><span>说圣人跟人是同类，一样的。但是却出于其类，拔乎其萃。我们所熟知的成语——出类拔萃。圣人也是人，但是他要远远超出人很大一部分，就像凤凰对于飞鸟，麒麟对于走兽，泰山对于丘垤，河海对于行潦，是一样的。</span></p><p><span>我们说泰山它也是山，但是泰山所承载的高度和它的地位，是远远高于一般的丘垤的；我们说凤凰它也是飞鸟的一种，但是它要远远高过其他的飞鸟。所以用来形容孔子，他虽然也是人类，但是他的贡献、他的价值、他的德行、他的光芒、他的思想和境界，是远远的高出人类的，出类拔萃。</span></p><p><strong><span>自生民以来，未有盛于孔子也！</span></strong><span>说自从有人类以来，没有像孔子这样伟大的人。</span></p><p><span>我们再来回顾有若所讲的第一句话，其惟民哉？岂止是人类？有若在讲，自从有万物以来，就没有哪一个万物，或者哪一个人，比孔子更加伟大的。</span></p><p><span>那我们再来看,孔夫子身边的三位学生，对于孔夫子的评价和赞叹：宰我讲，远远贤于尧舜；子贡讲，生民以来都没有像夫子这样的人；有若讲，止是民哉，没有什么是比孔子更伟大的，未有盛于孔子也。</span></p><p><span>我们看孟子把有若、子贡、和宰我，对于孔子的评价放在这里，就说明孟子也是这样认为的，所以，当公孙丑问到伯夷、伊尹和孔子是不是同等的人，孟子讲，不是的，没有人可以跟孔子同等来比较，自生民以来就没有像孔子这样的人。</span></p><p><span>所以，我们说孟子是沿袭了孔子的思想，去讲仁政，去讲爱民，去讲浩然之气。所以一生都在以孔子为榜样，故而带着学生们周游列国二十年，去推行自己的仁政思想，去讲儒家的文化，去效仿尧舜禹。</span></p><p><span>我们再来作一个总结，一个人最大的贡献和价值到底是什么？</span></p><p><span>如果我们学习了这一篇文章，我们知道了一个人最大的价值，是有自己的思想，有自己的文化体系，并且可以用这种思想，这种价值观，影响身边更多的人，可以去传承后世。之所以说孔子生民以来未有，就是因为他的思想、贡献和价值，它是源远流长的，影响着数千年。</span></p><p><span>我们现在也是一样的，说我们想帮助一个人，给他物质上的东西比较容易。我们给一个人一份工作，给一个人买一些好吃的东西，好用的东西，这个比较容易，但是更难的在于，改变一个人的思想，救赎一个人的灵魂，是让他可以拔出那种痛苦，让他可以更好地去面对生活。</span></p><p><span>一个人没有能力工作，那更难得的是，你帮助他如何更好地工作，而不是给他一份工作，这并不能真正地解决他的问题。</span></p><p><span>所以，我们经常说儒家文化伟大，伟大就伟大在，可以改变一个人的思想，可以扭转一个人的价值观，可以救赎一个人的灵魂，所以，这才是对后世更大的价值。</span></p><p><span>儒家提倡内圣外王，讲三不朽：立德、立功、立言。立德，就是你做有德行的事情；立功，就是你的这件事情是起到了效果的；最后要立言，因为你在立德和立功之后，你所讲的言是有德行的，并且是有效用的，有结果的，讲的是真理。</span></p><p><span>这个时候，你要立言，因为你的这种言语它是正确的，道理是经过你自己用德行，用亲身去实践的，然后用它帮助别人，才会有功。这个时候，你讲的言语是可以给别人指明道路的，可以改变别人的思想，改变别人的价值观，救赎一个人的灵魂。</span></p><p><span>所以，我们知道孔孟之所以伟大，就是他们在做着改变他人思想的事情。正如我们今天，还在学习孔子，还在学习孟子，学习孔孟之道，这两位圣人数千年以后，还在影响着我们，所以，他们的价值和贡献是无限的，再过去几千年，它还在影响着几千年之后的人们。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ③-1 以力假仁者",
    "date": "2022-09-28",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上<span>③</span>-1 以力假仁者</span></strong></p><p><span><strong>孟子曰：“以力假仁者霸，霸必有大国。以德行仁者王，王不待大；汤以七十里，文王以百里。以力服人者，非心服也，力不赡也。”</strong></span></p><p><span>我们先来思考一个问题，如何才能做成一件事情？我们通常会想，做成一件事情一定是需要实力的，实力又分为内在的和外在的：内在的实力，就是我们自己的能力有多强，有什么样的天赋，有什么样的优点，或者说具备了什么样的技能；外在的实力，通常讲，我有多少财富，我有没有资金，我有多少人脉，这些称为外在的实力。</span></p><p><span>这是我们大多数人的想法，认为做成一件事情，只要有实力就可以了，我自己有能力，并且有一些人际关系，有一些财富，有一些资金，可以支撑我去做这件事情，我就可以把一件事情做成。我们说，想要做成一件小事情，有这个实力就够了，但是想要做成大的事情，绝不是靠自己的实力就可以的。</span></p><p><span>我们经常听到一句话：小事靠财，大事靠德。小事情，我们有一些财富，靠着我们自己的努力，靠着我们有一些实力，就可以做成；但是，如果要做成一件大的事情，一定是靠德行的，只有我们有德行，才能把一件事情做大，并且把一件事情做得更长久。</span></p><p><span>一件事情做大，绝非一人之功，不是说我们自己有多强的能力，有多好的人脉，多大的财富，就可以把它做大的。要想一件事情做大和做长久，是有很多人愿意跟我们在一起，有很多人愿意来帮助我们去做这件事情，它才可能变大，才可能变得更长久。</span></p><p><span>所以说，要做成一件大的事情，长久的事情，是要靠德行来支撑的。</span></p><p><span>我们接下来进入孟子所讲的内容，<strong>孟子曰：以力假仁者霸，霸必有大国。</strong>我们先看这个力，力就是刚才我们所讲的实力，你可以把它翻译成武力，总而言之就是有足够强的力量，有实力。以力假仁者霸，我有足够的实力，但是我假借仁义之名，这个称之为霸。</span></p><p><span>我们来体会这句话，在生活当中，我们经常可以看到这类事情的发生。比如说，我们在做父母之时，我们是处上位的，我们用自己的力量来要求孩子，你必须听我的，我这是为了你好，这就叫以力假仁者。</span></p><p><span>我们并不是用仁德的角度去出发，用仁德的态度去教育孩子，而是靠我们的力量，因为我是你的父亲，或者因为我是你的母亲，因为我是赚钱的，因为我养着你的生活和你上学，这就叫以力假仁者霸。我们看上去父母是强势的，是霸道的。</span></p><p><span>再比如说，夫妻之间也是一样的，如果有一个人的事业比较好，而另一个人在家里并没有什么工作，可能在家里带孩子，在家里做一些家务，这个时候，我们就会认为赚钱的一方，我们是有力量的，我们是有实力的，所以，我们这个时候呈现出来的就是强势的，就是霸道的。</span></p><p><span>再比如说，在一个企业当中，做领导也是如此，因为我是领导，或者因为我是老板，我给你发工资，所以，你就必须要听我的话，这就叫以力假仁者。我们会说老板很强势，领导很霸道。</span></p><p><span>霸必有大国。有这种霸，你必须要具备大国的条件。我们去看春秋和战国时期，齐国、晋国、楚国，这都是在春秋称霸的国家，称霸靠的是什么？是齐国、晋国和楚国本来就强大，只有你更强大，所以你才能去称霸。但是称霸这件事情并不能长久，你也没有办法让天下人都来归顺，因为你靠的是实力，靠的是武力，而不是靠的仁德。</span></p><p><span>但是我们反观，我们去看商汤，我们去看大禹，我们去看周文王，周武王，靠的是仁德，仁德再加上实力，一件事情才可以做大，才可以做得更长久。</span></p><p><span>我们在生活当中也要学会这个道理，比如说我们是做领导的，本来就是处上位的，如果这个时候，我们有自己的实力，再加上自己的德行，别人才会诚心诚意地愿意和我们在一起做事情，这种力量它是由内心所生发的，是不需要我们去管理和要求的。如果我们只是去管理和要求，我们靠的是力，而这种力只会让别人表面上是顺从的，但是从内在，它并不会生发力量。</span></p><p><strong><span>以德行仁者王，王不待大。</span></strong><span>如果我们以德行，去做仁德的事情，去做仁义的事情，就可以称王于天下。王不待大，如果我们是称王天下，就不需要你具备大国的条件。</span></p><p><span>这句话很重要，孟子在教给我们一个道理：如何才能以小博大。</span></p><p><span>比如说一个人，我现在即使什么都没有，没有人关心我，没有感情，没有事业，没有工作，一无所有，但是，如果我们懂得这个道理，我们就可以以小博大，可以从无到有。</span></p><p><span>我们先要做的第一件事情，是积累自己的德行。没有人关心我，我就去主动地关心他人；我没有一个好的事业，我就先想着如何去帮助别人。我去想着如何去提升我自己的能力，当我有了一些能力以后，我不是去要求和强求他人，而是去行仁德之事，去多帮助他人。这个时候，你从小就会变大，从无就会变成有。</span></p><p><span>接下来，孟子举了两个例子，<strong>汤以七十里，文王以百里。</strong>商汤和周文王最后都是拥有了天下，商汤建立了商朝，文王建立了周朝，这两个人都是以小来博大的。汤只有土地七十里，而文王只有土地百里，但是他们行的却是仁德之事，是想着如何为百姓请命，帮助百姓过上更好的生活，所以，就会有更多的百姓愿意拥护，愿意追随他们这样的人，最后就会拥有了整个天下，这就是以小博大的过程。</span></p><p><span>但是，你要想称霸天下，一定是靠你自己的实力和武力，是暂时的一时之功，别人当下可能会认同你，但并不是发自内心的，一旦你的力量开始减弱，别人就会开始不服从，开始对抗，所以如何能大？如何能久？</span></p><p><span>你看看我们在家庭教育当中，也是同样的道理。如果我们是以力假仁者，我们不停地去要求这个孩子，我们以处他父母的位置来要求，或者强迫他做一些事情，因为他刚开始的力量小，他没有办法与之对抗，但是当他的力量足够大，孩子长大以后，到了他的青春期和叛逆期，这个时候，他就不再听从我们大人所讲的话，我们讲的道理，他是要顶撞的，因为他从内心开始就不服气。所以，我们一定要谨慎地对待这件事情。</span></p><p><span>无论生活当中的大事还是小事，都不要去做以力假仁者。比如说夫妻之间也是一样的，如果我们只是因为赚钱多，你就不停地去要求和苛责对方，那么当下他呈现出来的状态，有可能是顺从的，但是当有一天，他自己有能力出去赚钱的时候，你会发现我们之间就会形成对抗，就会形成对立，因为他的力量足够强大，他就一定会去反抗的。</span></p><p><span>我们对待员工也是如此，如果我们只是因为自己处上位，而去要求他，如果我们只是以给他发工资为由，这都是以力假仁者。当有别人给他更高的工资，当他在这个地方，不想再这样工作，不想再受压迫之时，他就一定会离开，所以，这件事情是不会长久的。</span></p><p><span>我们接下来看孟子作的总结：<strong>以力服人者，非心服也，力不赡也。</strong>赡，是足够的意思；不赡，就是不够、不足。我们以武力或者以实力去役使他人，他不是发自内心的顺服，只是他自己的力量不够而已。</span></p><p><span>我们再回顾刚才我们举的几个例子，如果以力假仁地去对待你的孩子，他当下虽然是顺从的，但并不是心服，只是他现在的力量还不足以反抗。那我们去对待感情，对待员工，对待朋友，都是一样的。</span></p><p><span>包括如果我们的生意做得很大，我们这样去对待我们的客户也是如此，他当下可能没有更好的办法，是因为他当下的力量还不够，所以，看似他当下是服从的，并不是从内心生发的，当他有一天力量足够大，他就会起来对抗。所以，我们去做这样的事情，从长久来看，没有任何的意义。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ③-2 心悦诚服",
    "date": "2022-09-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上3-2 心悦诚服</strong></span></p><p><span><strong>以德服人者，中心悦而诚服也，如七十子之服孔子也。《诗》云：‘自西自东，自南自北，无思不服。’</strong></span></p><p><span>接下来又举了一个相反的例子，刚才举的例子是以力服人者，他当下看似的顺从，是因为他没有足够的力量。</span></p><p><span><strong>以德服人者，中心悦而诚服也。</strong>中是助词，表示他内心真的是真心的，诚心的顺从我们。</span></p><p><span><strong>如七十子之服孔子也。</strong>七十子，指的是孔夫子的门人弟子，孔夫子弟子三千，七十二圣贤，</span></p><p><span>所以，这里指七十多人是诚心的顺服于孔子的。</span></p><p><span>为什么会诚心顺服于孔子呢？因为孔子的德行。我们去想孔夫子的一生，他并不是顺利的，曾经为官，做到过大司寇，代理相事，但是并不能实现自己的政治主张，所以开始十四年的周游列国，在这个过程当中经历了很多苦难，甚至是生命的危机，受到困厄，但是依然有这么多的学生愿意跟随在他的身边，这就是德行。</span></p><p><span>如果是以力服人者，当你处在高位，当你当下更顺利，可能有人会愿意跟在你身边，但是你遇到困厄之时，你在最困难的时候，还有人愿意留在你身边，那就说明，这是你的德行。</span></p><p><span>所以，我们不妨来反思自己，如果我们自己遇到了困境，遇到了困难，还有多少人愿意跟在我们身边呢？这个时候，他都是摒弃了利，而是被我们自己的德行所吸引的，愿意留在我们身边。</span></p><p><span>我们再来看这句话，他首先讲了一个道理，告诉以德服人者，心悦诚服。我们去想，可能我们每个人身边，都会有心悦诚服的人，但是，我们去看数量有多少呢？</span></p><p><span>这里首先讲了孔子，因为孔子身边有这么多人，愿意心悦诚服地去跟随孔子，那就说明孔子的德行足够大。即使是以力服人者，是不是也会有心悦诚服的人呢？也会的，只不过数量的多与少。</span></p><p><span>我们讲，一个人可能再霸道，或者性格当中再有一些缺陷，他可能也真心诚意地对待身边的某个人，或者某些人是好的，这些人也可能会心悦诚服。但是，我们要把眼光放得更大一点，看看身边有多少人是愿意心悦诚服的，以检验我们自己的德行究竟有多大。</span></p><p><span>所以这段话总结过来，人有多少，时间有多长，如果跟随在你身边的人越多，跟随得越久，就说明德行更好一点。</span></p><p><span>我们反过来再看商汤和周文王，他们之所以拥有天下，就是因为他们的德行足够大，有更多的人愿意跟随在他们身边，所以，可以以小博大，以方圆七十里，方圆百里，最后可以拥有整个天下。</span></p><p><span>我们现在看到的齐国，有方圆千里，但齐国的君主都是在想着以力假仁，想去称霸天下，所以，孟子才会讲，这不是当下最好的出路。如果当下齐国能去实行王道，称王于天下，易如反掌，是非常简单的事情。</span></p><p><span>我们再去想，如果我们自己本身是有一定的实力的，我们有自己的能力特长，也有一些财富，有一些人脉，如果，这个时候再去行仁德之事，我们把一件事情做大，做长久，是易如反掌的事情。</span></p><p><span>但是，有的时候我们可能就会想，你说我两个条件，如果没有那么足怎么办？说我自己也没有那么强的实力，我可能也没有那么好的德行，所以，我们这里要去思考，到底是能力比较容易获得？还是德行比较容易获得？</span></p><p><span>比如说，我们现在没有钱，我们可以快速地有钱吗？好像不能；比如说我自己没有什么样的天赋，我可以快速地通过努力获得吗？好像也不能；比如说我出生在一个什么样的家庭，我的家庭就没有给我那么多的人脉和资源，我可以快速地获得吗？好像也不能。</span></p><p><span>那也就是，我们想要获得实力，是很困难的事情，它并不容易。而且我们自己也没有办法把握，没有办法掌控，我不能让我自己变成一个有钱人，我也不能现在去改变我的家世。但是有一件事情，比较容易获得，就是修德行，它是我自己可以把握的事情，我愿意去提升我自己，我愿意去帮助别人，这是我可以做主的事情。</span></p><p><span>《论语》当中孔子讲了一句话，非常经典和受用，“仁远乎哉？我欲仁，斯仁至矣。”</span></p><p><span>说仁这件事情，离我们很远吗？如果我想要仁，这就已经到达了。所以，我们想要获得德行这件事情，相对而言要容易得多，它不像实力，它是靠一些外在的因素，是我们没有办法掌控和快速获得的。但是仁德这件事情可以，只要我们想要去改变自己的当下，想要去让自己积累更多的德行，我就从当下做起，它可以以小博大，我虽然自己没有什么实力，但是我却可以通过自己的德行，最后把一件事情做大，把它做得更长久。</span></p><p><span>有了德行，我可以无中生有，从无到有。本来我是没有感情的，但是因为我有德行，我不停地去付出，那就会有人愿意来到我的身边；本来可能我是没有事业的，但是因为有了德行，我总想着去帮助别人，就会有更多的人愿意跟在我们的身边，从没有事业变成有事业。</span></p><p><span>所以，积累德行是一条捷径，帮助别人，是快速地可以成就自己最直接的方法，它比获得实力要更容易。</span></p><p><span>接下来孟子用《诗经》的一段话作为总结，这篇《诗经》来自于《大雅》，《大雅·文王有声》指的是文王有声望的意思，整个这篇《诗经》分为八章，前四章赞叹文王，建都于丰；后四章是赞叹武王建都于镐京。</span></p><p><span>这段时间引用的是后四章，也就是赞叹武王建都于镐京，<strong>《诗》云：自西自东，自南自北，无思不服。</strong>在这三句之前还有一句，叫镐京辟雍，镐京，是指的建都的这个地方。一开始辟雍是天子来行礼，奏乐的地方，比如说在这里朝见诸侯，比如说在这里祭祀天地；后来辟雍</span></p><p><span>又改成了天子教学的地方，天子要在这里讲学；再后来，又把它演变成了贵族的学生在这里学习的地方。</span></p><p><span>自从汉朝以后，历代都有辟雍，只不过辟雍它的功能性不一样，每个朝代它的用途也不一样，有的时候，用在这里祭祀，用在这里行礼，用在这里奏乐，有的天子会在这里讲学，还有的，用于贵族子弟在这里参加学习。</span></p><p><span>我们再来看《诗经》的这一句话，说武王在这个地方朝见诸侯，自西自东，自南自北，无思不服。在讲诸侯从四面八方来到这里，无一不是真心的，归服于武王的。此之谓也，讲的就是这件事情。</span></p><p><span>这里孟子讲的是什么事情：就是以德服人者，心悦诚服也。说武王当时所做的这件事情，在朝见诸侯，大家都是诚心思服的，讲的就是以德服人这件事情。</span></p><p><span>最后我们来总结这一讲课程，我们学到了什么。</span></p><p><span>首先，告诉我们想要做成一件事情，想让它变大、变久，我们要有实力加德行。但是，当我们没有实力之时，我们要如何尝试？修仁德，它更容易获得。所以，首先我们第一件事情要养德，要培养自己的德行，有了德行以后，有了第二件事情，可以以小博大，就像商汤，就像周文王，可以七十里以百里，最后称王于天下。</span></p><p><span>那么有了德行，还有第三件事情，可以从无到有，无论我们当下处在什么样的环境，我们想要感情也好，想让别人关心也好，我们想让自己的事业变得更成功，或者我们想让自己的工作变得更顺利，或者我想让他人跟随于我，想让我的人脉人际关系变得更好，我们都可以无中生有，前提是我们要养德。</span></p><p><span>我们有了德行，可以去以德行仁，去用我们的德行，帮助和滋养更多的人。当你帮助的人更多，就会有更多人愿意追随，可以从无到有，去实现我们的人生理想，实现我们的人生志向。</span></p></div>"
}]