[
  {
    "title": "《太上感应篇》第一讲(免费试看）",
    "date": "2025-07-31",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第一讲</span></strong></p><p><span>整个《太上感应篇》教给我们的是知因果，明善恶。告诉给我们有二十六条善行，一百七十条恶行，告诉我们哪些事情该做，哪些事情不该做。</span></p><p><span>我们要想修行也好，要想做学问也好，要想立于天地之间，首先的一件事情就是要明善恶，这是做人最基本的准则，也是符合天地之道运行规律的一种方式和准则，更是我们修行人的起点。</span></p><p><span>当我们学习完整个《太上感应篇》，知道哪些行为是该做的，哪些行为是不该做的，用来反躬自省，进而不断地修正自己，让自己内在的品格更良善。</span></p><p><span>如果我们不学习《太上感应篇》，很多时候我们认为是对的，其实未必。</span><span>我们觉得那件事情不是作恶，其实有很多行为已经造成了很多的因果，而我们不自知。</span></p><p><span>《太上感应篇》的太上，是指太上老君，也就是我们民间传说的老子，写《道德经》的老子。感应是什么意思？其实整个这一篇“<span>感应</span>”两个字非常重要。举个例子，从这一篇来讲，太上想感化我们，这叫感。我们应不应，叫应，你来我往叫感应。</span></p><p><span>比如，太上老君想感化我们，如果我们不应，不应就是不相信，不相信不照着去做，不照着去修正，就是没有应。有一句话讲：“天雨虽大，不润无根之草。”天下雨是没有分别的，都是在滋养万物的，可是没有根的草，就是不应，自己不扎根，自己不去努力是不行的。</span></p><p><span>圣贤文化都在告诉我们天道循环的规律。这个时候看的是我们自己是不是应了。</span></p><p><span>生活当中“<span>感应</span>”这两个字也非常重要。</span><span>举例：两个人之间的沟通，是不是要有感有应？要有来有往。我们对别人讲一番话，是想感化他也好，是想感动他也好，这个时候对方应或者不应非常重要。如果对方是不理睬的，是不听的，是不信的，就无法达到共鸣。</span></p><p><span>我们经常讲一个词叫沟通，如果有感不应，就是只沟不通，两个人没有达到共识，没有达到一个统一的思维的标准或者行为的规范，这不就是不通吗？</span></p><p><span>想一想，我们跟孩子之间的沟通不是一样的吗？我们想教给孩子一个道理，他的行为是不对的，我们想指正他，这叫感。可是他不应、不听我们的，结果就是不好的，就是不产生力量的。</span></p><p><span>我们一定要学会<span>第一</span>感应，先去做应的人，无论别人在跟我们讲什么，我们尽量去契合对方的思想，契合对方告诉我们的想法和方法，然后我们来学以致用，要学会去做应的人。如果我们讲出来的任何话，别人都是不应的，我们自己<span>的心理</span>是不是难过的？是不是不开心的？</span></p><p><span>既然我们自己是不开心的，别人跟我们讲话的时候，首先，我们要学会去做应的这个人，去应承父母所讲的话，去应朋友同事所讲的话，甚至去应孩子所给我们讲的话，去应领导跟我们讲的话。</span></p><p><span>我们只有懂得去做应的那个人，自然会变得谦逊有礼，别人也才可能喜欢我们，也才可能有事情跟我们讲。如果跟我们讲什么，我们都不应，还有谁愿意跟我们说话？还有谁有事情的时候愿意想起来我们？当我们的应做到一定的程度，我们这个人一定是谦和的，一定是懂礼的。</span></p><p><span>这个时候，我们就去做感的那个人，我们去感动他人，去感化他人，去教化他人，这不都叫感吗？如果我们做感的人，自我要求就要更高一点了。高在什么地方？我们去看看对方是不是能收到当下所对他讲的话？</span><span>如果不能，我们要懂得调整自己的方式，而不是一味地讲。对方听不懂、听不进去的时候，我们依然自顾自的在感动，在感化对方，这个时候我们要不断地去调整方法，让对方可以接收得到。</span></p><p><span>当我们做感和做应的时候，都是在不停地去调整自己。我们现在学习《太上感应篇》就要做应的那个人了，接下来我们看看太上老君跟我们讲了什么，我们要如何去应。</span></p><p><strong><span>太上曰：“祸福无门，惟人自召。善恶之报，如影随形。”</span></strong><span>这句话大家耳熟能详，说福祸是无门的，都是我们自己感召而来的。我们做了什么样的事情，就会感召什么样的福报。同样做了不好的行为，自然会感召不好的结果。</span></p><p><span>在生活当中其实也是一样的，当我们心态是积极、快乐的，我们身边吸引的人也会是这样的类型。如果我们是抱怨的、苛责的，我们所感召的朋友也是如此的。</span></p><p><span>在一个家庭当中也是一样，比如我们是爱抱怨的父母，遇到事情就斤斤计较，时间长了，孩子跟我们的性格是一样的。是我们做的所有的事情形成的磁场，而感召来接下来所有事情的发生。</span></p><p><span>善恶之报，如影随形。</span><span>如果做了不好的事情，我们常讲的报应，就像影子一样跟着我们的身体，是甩不掉的，同样做善行也是如此。告诉我们善恶都是有报的，并且是如影随形的，只要是我们做过的事情，是无论如何也摆脱不掉的，一定会出现，并且一直跟着我们生生世世永远不断。</span></p><p><span>所以我们一定要引以为戒，多做善事，多起善念。不要做那些不好的事情。少抱怨，因为我们越是抱怨，所感召的都是不好的磁场，身边所感召来的也都是爱抱怨的人，接下来所发生的事情和行为，显而易见。</span></p><p><strong><span>是以天地有司过之神，依人所犯轻重，以夺人算。</span></strong><span>所以天地之间，是有司过之神的。司：管理，掌管、管理罪恶的神，管理善恶的神。</span></p><p><span><span>依人所犯轻重，以夺人算。</span>以我们每个人所犯的轻和重，来夺人算。</span></p><p><span>算，是一个计算单位，人活一百天叫一算。</span><span>如果我们做了很多不好的事情，会减掉一百天的寿命，只不过我们不知道自己原本的寿命有多长。做了很多不好的行为，其实就会导致自己减算了，只不过我们不清楚罢了。</span></p><p><strong><span>算减则贫耗，多逢忧患。</span></strong><span>不仅是在减我们的算，减我们的寿命，同时自己还多贫耗，多逢忧患，经常有不好的事情发生，让我们很忧虑。</span></p><p><span>老百姓常讲一句话：屋漏偏逢连夜雨。为什么会这样呢？天下雨的时候，难道只下在我们屋漏的地方吗？是不是人家屋不漏的地方也下了，但是因为人家没有漏，所以不会淋雨。但是我们屋漏，再碰到下雨的时候，就开始漏了。</span></p><p><span>我们生活当中不也是一样的吗？我们有的时候会抱怨：为什么我的生命这么不顺？为什么我总是出现一些忧患的事情，总是有一些突然的事故出现？难道别人家没有吗？别人家也有。只不过人家有福德，所以当有事情发生的时候，不足以影响人家。</span><span>是我们自身有太多的不足，和做过很多不好的行为所导致的。</span></p><p><span>人家是有善行，所以逢的忧患就少。而我们做过很多不好的行为，或者说善行不够，所以才多逢忧患。</span><span>我们一定要懂得这个道理，反躬自省。就好比是我们屋子漏了，怎么办？不要抱怨，抱怨是解决不了问题的，去想办法修缮。</span></p><p><span>我们不也一样吗？</span><span>如果身处困厄当中，身处忧患当中，不要抱怨，不断地修缮自己，去积累善行，多做善事，多起善念。就像房子一样，我们自然会变得越来越好。所以一定要知善恶，明因果的。</span></p><p><strong><span>人皆恶之，刑祸随之。</span></strong><span>并且人人都是讨厌我们的，不喜欢我们的，刑祸也就随之而来。同样在生活当中，有的人会经常抱怨：我的人际关系不好，别人都讨厌我。我们不要反躬自省一下吗？是不是</span><span>我们所说的很多话，我们的情绪，我们的行为，是让别人觉得讨厌和难以接受以及不敢接近的呢？所以别人讨厌我们的时候，不要去抱怨他人，也<span>不要自怨自责，</span>去修正自己的行为，不做那些不好的事情，不说伤害他人的话，别人自然就喜欢我们了。</span></p><p><span>我们去想一想，谁不喜欢阳光快乐、积极正能量的人呢？我们如果是天天抱怨的，天天指责的，这本身已经是过错了，只是我们不明白这是过错，所以《太上感应篇》 是教给我们这些道理的。</span></p><p><strong><span>吉庆避之，恶星灾之。</span></strong><span>吉庆的事情，避开我们，那些不好的星，指的是恶星，降祸给我们。我们经常说：一个人顺利的时候做什么都顺，不顺利的时候做什么都不顺，都是我们自己的行为所感召来的，如影随形。</span></p><p><span>经常做善事的人，经常很快乐、很阳光的人，我们会发现这样的人会讲：我做什么事情都很顺，我每天都很快乐。</span></p><p><span>反之也是一样，我们经常做一些坑害他人的行为，经常起一些不好的念头，如果是负能量的，就会讲：“我做什么事都不顺，好像所有人都害我，好像所有人都看不上我。碰到的所有的问题都是困难，都是挫折。<span>”</span>其实都是我们的心念和我们自身的行为所感召的，如影随形。</span></p><p><span>开篇这十六个字<span>“</span><span>祸福无门，惟人自召，善恶之报，如影随形</span><span>”</span>非常重要。我们所有的心念、所有的思维、所有的行为，所产生的善或恶，都是我们自己感召而来，都像影子一样跟着我们是无法摆脱的。我们只有正己，不断地修正自己，才能感召那些好的事情发生在我们自己的身上。</span></p><p><strong><span>算尽则死。</span></strong><span>如果我们做了很多的恶行，不停地减算，我们的生命就结束了。</span></p><p><strong><span>又有三台北斗神君，在人头上，录人罪恶，夺其纪算。</span></strong><span>因为三台北斗神君，主管人的生死夭寿，在人头上录人罪恶。就是我们老话所讲的：举头三尺有神明。</span><span>根据人的罪恶夺取计算。一百天为一算，十二年为一纪。小的过错，小的罪恶夺人算，或者说小的罪恶，积累到一定的程度就夺人纪，一纪就是十二年。</span></p><p><strong><span>又有三尸神，在人身中，每到庚申日，辄上诣天曹，言人罪过。</span></strong><span>又有三尸神，在人的身体当中，住其头，住其肠，住其足，这叫三尸神，是在人的体内的。每到庚申日的时候，就把我们的罪恶上禀天庭了。</span></p><p><span>因为他在我们人的身体当中，我们所有的行为都是清清楚楚的，甚至我们每一个心念都是清清楚楚的，我们的罪恶都会被上报的。一般六十天，一个庚申日，也就是说每两个月上报一次。</span></p><p><span>大家学习也好，修行也好，经常听到一句话：要注意自己的起心动念。当我们的心念起的时候，行为虽然没有发生，其实已经是在造恶业了。只不过比行为做出来的恶业要少一些而已。所以我们修行就是不断地修自己的身口意，不断地修正己身，修正行为。</span></p><p><span>自己所讲的话，一定是有利于他人的话。坑害他人的话不要讲，伤害他人的话不要讲。意就是我们的念头，这些都是被记录在案。反过来讲也是一样的，我们的心念如果是正的，心念如果是利他的，行为虽然没有产生，可是已经给自己积累功德了。</span></p><p><span>大家常讲：我的条件也不好，我又没有钱，我又没有那么高的智慧，我怎么去行善，我如何去积德？</span></p><p><span>其实很简单，只要我们的心念都是对他人好的，我们每一个想法都是利益他人、帮助他人的，其实已经在积累善业了。并且长此以往我们的心念如果都是帮助他人，会衍生出来很多的力量让我们可以身体力行地去积累善业的，都是点点滴滴积累而来的。</span></p><p><span>同时难道不好的行为不是如此吗？都是我们不停地动念，想的都是如何坑害他人的想法。一开始可能只是想想而已，想得多了就付出行动了，更大的罪恶就出来了。</span></p></div></div>"
  },
  {
    "title": "《太上感应篇》第二讲",
    "date": "2024-03-16",
    "html": "<div class=\"B1_text\"><div><p><strong>第二讲</strong></p><p><span><strong>月晦之日，灶神亦然。</strong>月晦之日，就是农历每个月的最后一日，灶神也同样去做着上至天朝的事情。</span></p><p><strong>凡人有过，大则夺纪，小则夺算。</strong><span>凡是人所产生的过错，大就夺纪，小就夺算。</span></p><p><strong>其过大小，有数百事，欲求长生者，先须避之。</strong><span>过错大小，太多了。数百事也只是一个概念，一个数量词。何止百事，千事，万事都有。所以想要求长生怎么办？</span></p><p><span>先避开这些不好的事情、不好的行为。所以说要想求长寿，方法就是不断地去行善，去做利益他人的事情，少做恶事，让自己的心性是光明的，是平顺的，自然就长寿。</span></p><p><span><strong>是道则进，非道则退。</strong>符合道的事情，顺天理的事情，合仁义的事情，我们就做。违反天道的，违反人伦的事情，不合仁义的事情，我们就退，不要去做这样的事情就可以了。</span></p><p><span><strong>不履邪径，不欺暗室。</strong>邪径就是小路，做事情不走小路，去走光明的大道，不去做背后毁人、迫害他人的事情。不欺暗室就是在没有人的地方，不见光的地方，也不去做不好的事情。</span></p><p><span>前面讲过有三尸神，举头三尺又有神明，都在不断地去监管我们这些事情的。所以我们要约束自己的行为，即使在没人的暗室，也不去做那些不见光的事情。因为我们做的任何事情，都是给自己在积累福德或者给自己埋下祸根，不要以为别人看不见我们就可以肆意妄为。</span></p><p><span><strong>积德累功，慈心于物。</strong>不断地积累德行，积累善行。慈心于物，这个范围更宽广一点。说我们做任何事情，不光是对人，不光是对事情，不光是对有生命的动物，甚至对每一个东西，我们都是慈爱的。</span></p><p><span>比如我们慈悲地去对待一个杯子，比如走路很轻缓的状态，为什么会这样呢？我们有慈悲之心，担心会影响他人。如果很大声地走路，很大声地关门，这个时候是会对他人造成影响的。</span><span>比如在一个团队当中，如果有的人做什么事情声音很大，走路的声音很大，这个时候在里面办公的人是不是有一种想法：我想去看看外面那个是谁。当看到是谁的那一刻，我们心里对他的印象就不好了。虽然可能没有讲出来：走路那么大的声音，关门都是摔摔打打。但是瞬间对这个人的印象就不好了。</span></p><p><span>这里讲慈心于物，慈者是万物之本，是万物之根。要有慈悲，有慈爱之心，这个时候才可能滋养万物。所以我们对一个杯子不是一样的吗，我们对它有慈悲之心，它就回馈给我们。</span><span>比如，我们开的车子不是一样的吗？我们对它有慈悲之心，去爱护它，就不出毛病。包括我们用的电脑、用的空调不都是如此吗，如果对它不是慈悲的，是摔摔打打的，把它用坏了，还要自己去修理的。</span></p><p><span>我们看生活当中，如果用东西每天都是摔摔打打的人，这样的人的福报就小，福气就小，脾气就更加得暴躁，而且人们都是想远离这样的人。但是另外一个人，用东西都是轻缓的，都是轻柔的，他走路也是轻的，为什么？他心目中有别人，不想去影响他人。我们自然愿意和这样的人接近，愿意和这样的人去交往，同样天地也愿意降福给这样的人。</span></p><p><span>慈心于物是我们每天生活和工作当中必不可少的，做每一件事情都应该是这个样子的。包括在家庭当中，比如两个人看手机，一个孩子看电视，大家恨不得都把声音放到最大，以暴制暴，会发现反而家里成了什么样的氛围呢？互相干扰，所有的人都不得清静，不得安宁。</span></p><p><span>我们看看有教养的家庭是什么样子的？每个人动作都是轻缓的，做的每件事情都想着不要影响其他的人，这都是慈悲的表现。把家里营造成这样的氛围，这样的环境才是和谐的，磁场才是温和的，才是平顺的。</span></p><p><span>人越多的地方，我们越应该懂得修慈心于物，慈心于物本身这种慈悲就会散发出来磁场。我们轻缓地对待所有的万事万物，这个地方所散发出来的能量就是祥和的，就是宁静的。别人到这个地方，就会觉得很舒服。</span><span>就好比是我们去一个人的家里，到他家里说不清楚哪里不好，也说不清楚哪里好，但是会有感觉在这里待着是舒服的还是不舒服的。</span><span>包括我们去一个公司，如果这个公司是弥漫着硝烟的，进去之后就有一种压迫感，就有一种焦虑感。如果人人看似好像都是很开心的状态，我们就愿意在这里多待，在这里待着就是舒服的状态。这个东西虽然看不见，但是都是由于我们有没有慈心所形成的一种气场环境。</span></p><p><span>慈心于物，应该作为我们生活当中一个修身的标准。当我们懂得慈心于物，逐渐的心目中就会有他人，就会有万物，做事情会考虑到不要伤害东西，不要影响他人，我怎么做事情才能对他人更好，这是一个修身非常好，也是非常重要的一个方法。</span></p><p><span>所以我们从慈心于物开始，认真地去对待自己的每一本书、每一个杯子，自己开的车子，自己办公的电脑，自己的手机，对待自己的每一件事情，对待出现在我们身边的每一个人，我们的慈悲之心就会不断地去增长。</span></p><p><span><strong>忠孝友悌，正己化人。</strong>忠孝，是对自己的父母要忠要孝顺，再延伸就是对我们的领导，对我们的上司，对身边的每一个人。对每一个人虽然不能称为孝，但是可以用忠，我们的忠不是忠于自己吗？让自己做事情也好，做人也好，是讲忠信的。我们以忠以孝去对待每一个人，以慈悲去对待每一个人。</span><span>友悌，就是尊敬比我们年长的人。正己化人，化就是感化，我们一定要懂得，遇事情的时候是不断地修正自己才能感化他人，而不是说我们一开始就指责要求他人，那个是没有力量的。</span></p><p><span><strong>矜孤恤寡。</strong>矜是怜悯之意，恤，我们经常讲体恤同情，并且帮助他人。孤和寡在《礼记》中有记载：少儿无父谓之孤，老而无夫谓之寡。我们要懂得去怜悯，同情，体恤和帮助那些孤寡之人。</span></p><p><span><strong>敬老怀幼。</strong>尊敬老者，关怀幼小之人，这是我们中华民族的传统美德。</span></p><p><span><strong>昆虫草木。犹不可伤。</strong>即使是昆虫和一花一草，我们都不要去伤害。</span></p><p><span><strong>宜悯人之凶。</strong>悯，首先是怜悯，同情。我们要有悲天悯人的情怀，凶就是不好的事情。比如说，别人做了一些不好的事情，我们不应该是厌恶的，不应该是想逃离的，不理他的。</span><span>而是什么呢？悯，很怜悯，很同情他。当我们产生了同情和怜悯之心，我们就不只是讨厌他了，要想办法帮他走出来。正己化人，有慈悲之心的人，做事情是不是这样做的。</span><span>不是因为他做了不好的事情，我们就开始讨厌他，而是要怜悯他，想办法拉他出苦海，要靠自己的行为去影响他，去感化他，这个才叫慈悲之心。</span></p><p><span><strong>乐人之善。</strong>别人做了善事情，我们是非常高兴的，非常欢乐的，非常快乐的。并且支持他，鼓励和赞美他，让他继续去做更多更好的善事。</span></p><p><span><strong>济人之急。救人之危。</strong>救济他人，当他人有着急的事情，我们去相救。别人出现危难，出现困难的时候，我们去相救，想方设法去帮助。</span></p><p><span><strong>见人之得。如己之得。</strong>看见别人得到了好的事情，就好像自己有所得一样高兴，但是我们现在恰恰是相反的。见人有得，好像自己失去了什么一样。看到别人发展的好，我们一定想办法让他不要那么好。其实这些都是在作恶，而我们自己不明白。</span></p><p><span>所以为什么要学《太上感应篇》，这里讲得非常的详细。如果别人有得，我们自己也很高兴，好像自己得到了一样那么开心，当我们这样去做的时候，已经在行善了，已经在给自己积累德行，积累善业了。</span><span>再扩充一下：见人之有，如己之有。看见他人有能力，有才华，就好像自己有一样，那么开心，这就是容人之量。</span></p><p><span>什么样的人能做领袖？什么样的人能做领导？什么样的人能做高管？</span><span>得有容人之量，得有德行。如果遇事都是想掌控的，见到别人有才华就想往下压着，会发现这样的人永远走不到高处，因为没有容人之量。看到别人有技能，<span>反而</span>还想方设法地去打压，这样的人怎么能往上走呢，我们自己的德行也不匹配。</span><span>大家去观察，往往技能很强的人，都是做技术做的特别好，很难走到高位上，为什么？太倚仗于自己的技能了，而看不到别人的技能，没有容人之量。</span></p><p><span>很多做领导的人，做领袖的人，好像看似什么都不会，但是他是慈悲的，是慈爱的，是能容人的，是有德行的。</span><span>所以我们每个人都要懂得去修这一点，看到别人有好的技能，有好的相貌，在做好的事情，我们应该是容忍的，包容的，并且去鼓励他人的，这就是我们的德行在不断地扩充。</span></p><p><span><strong>见人之失。如己之失。</strong>看到他人有所失去的时候，好像自己失去了一样。</span></p><p><span><strong>不彰人短。</strong>不去彰显他人的短处，无论在生活、工作、交朋友当中都是一样的，如果发现他人的短处，不停地拿出来讲，他人是不是很不高兴，是不是很讨厌我们。换位思考，如果别人揪着我们的短处天天不放，我们是不是很反感他。</span><span>己所不欲，勿施于人。既然我们很讨厌这样的行为，就一定不要去做这样的事情。其实有很多人都是这样的，为了彰显自己的口才，彰显自己厉害，天天揭人的短，天天拿别人的不好来讲事情，这样的人其实很招人讨厌的。</span><span>一定要明白这一点，不要去彰显他人的短处，反而应该帮忙隐藏才是。当我们帮忙隐藏他人的短处，他心里明不明白？是不是他很清楚，反而会感激我们，并且感激的同时，他会自我修正的。</span></p><p><span><strong>不炫己长。</strong>不要拿自己的长处天天炫耀。如果在生活、工作、或者在交朋友当中，我们天天讲自己的长处，讲的麻木了别人开始就变反感，变得不喜欢和我们交往<span>了</span>。因为太过于炫耀，太过于张扬，反而会给自己惹来祸端的。</span></p><p><span><strong>遏恶扬善。</strong>第一个遏是遏制的意思，遏制住那些不好的恶行，不好的行为，去扬善行。</span></p><p><span><strong>推多取少。</strong>当我们索取和拿一样东西的时候，把多的让给别人，少的自己拿，如果我们能经常这样去做事情的时候，别人自然就是喜爱我们的，自然就会回馈给我们。</span><span>我们的德行和善行，自然的日日在加大，我们有德行的时候，就会有更多的人愿意跟随我们。</span></p><p><span>《大学》讲：“德者本也，财者末也。”我们的德行越好，财自然就来了。</span><span>为什么说有德此有人？有德行的时候，就有人跟随，有人此有土，就会有自己的领域，有土此有财，这个时候有了自己的领域，又有人跟着做事情，我们的财自然就来了。</span><span>有财此有用，这个时候我们才有用处。所以说推多取少，看似好像是往出舍，好像是自己少拿了，实则我们的德行在不断地扩充，最后反而会多得，其实就是先舍后得，我们舍得越多才会得的越多。</span></p><p><span><strong>受辱不怨。</strong>当我们受到侮辱，受到误解的时候，也不产生怨恨，反而能反躬自省，看看自己是不是哪里做的不足，才招致别人的误解，不产生怨恨，不去抱怨他人。</span></p><p><span><strong>受宠若惊。</strong>我们受到别人的赞美、赞扬，好像受到惊吓了一样。《道德经》讲：“受宠若惊，贵大患若身，宠为下，得之若惊，失之若惊。”我们受到别人的宠爱或赞扬，就好像自己的身体要得病了一样，宠是为下的，我们总认为，受到别人的宠爱是好事情，其实未必见得。</span></p><p><span>人为什么会产生脆弱？为什么承受不了压力和别人的误解？就是因为从小受的宠太多了，每天都是被别人赞扬的，被别人鼓励的。突然走上社会的时候，会发现有一天别人开始误解我们，开始诋毁，甚至开始苛责，我们就受不了了。</span></p><p><span>宠是一件不好的事情，包括我们养花也是一样的。比如我们特别宠爱哪一朵花或者哪一盆花，会发现这个花反而最容易养死，因为太过于关注它了，可能给它浇的水是最多的，施的肥是最多的，反而把它淹死了。</span><span>在一个团队当中是不是一样。如果我们过度地宠爱一个人，反而是让他和所有的人都产生对立了，而这个人在团队当中是被排挤掉的。</span></p><p><span>所以一定要去注意这个问题，当自己受到了别人的宠爱的时候，我们要受宠若惊，像身体要得病一样，不要去执着于别人的赞美和表扬当中。</span><span>如果一旦我们习惯了，突然有人说出反对的意见，有人不认可我们的时候，有人误解我们的时候，我们自己就开始承受不了了。所以让自己保持非常中正的状态，受到了别人的误解，我们也不怨恨。</span><span>受到了别人的过多的宠爱和赞扬，我们也懂得战战兢兢的。不要去太过于执着别人的赞美当中，保持一个中立的状态，我们才是悠然自得的。不在别人诋毁或者赞美的感受当中无法自拔。</span></p></div></div>"
  },
  {
    "title": "《太上感应篇》第三讲",
    "date": "2024-03-17",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第三讲</strong></span></p><p><span><strong>施恩不求报。</strong>当我们帮助别人，对别人有恩惠的时候，不求他人的回报，只有这样我们内心才会坦然，这是第一点。第二点，《了凡四训》中讲过：积阴德，天报之。</span><span>我们不断地去恩惠他人，帮助他人，不求回报的时候，上天自然会把很多福德重新降到我们自己的身上来。</span></p><p><span>并且从世间法的角度也是如此，如果我们去帮助一个人，总是去求回报的时候，自己就会产生很多的期望和痛苦。</span><span>我帮助了他，他总得赞美我一声。我帮助了他，他总得说声谢谢，他见到别人总应该说我的好处。本来帮人是一件好事情，可是我们如果都是这些期望的时候，反而会产生很多痛苦。我原来帮过他，我遇到困难他怎么没有帮我，反而会给自己产生很多的痛苦。</span></p><p><span><strong>与人不追悔。</strong>给予他人的时候，是不要后悔的。其实生活当中经常这样说：那天明明帮了他一件事情，帮完了之后我就后悔了，如果当时我不帮他就好了，为什么他没有感激我呢？</span></p><p><span>其实如果我们是这样的心念去做事情的时候，不是在帮助他人，也不是在行善，我们从根本上想的就是索取，就是交换。我帮他，他一定要帮我，我给他东西，他一定要给我，这个时候就会产生痛苦了。</span><span>今天我请他吃个饭，我就想他什么时候请我。今天我帮了他一件事情，我就想他什么时候能回馈给我。</span></p><p><span>如果每天我们都活在这种期盼当中，何其痛苦？生活当中总产生这样的事情，我送给他一件东西，如果他送给别人了我就不高兴，我送给他一件衣服，他没穿我就不开心。本来我们<span>去帮助人家，</span>给人家一个东西是好，可是由于我们心念不懂得去调整，反而成了坏事了，这不是自寻苦恼、作茧自缚嘛。</span></p><p><span><strong>所谓善人。人皆敬之。</strong>善良的人，人人都是敬重、敬爱我们的。我们去不停地去帮助他人，也不求回报；不停地是给予他人，也不后悔。这样的人自然就是受别人敬重的。</span></p><p><span>如果在生活和工作当中，我们帮了一个人，天天求回报，天天挂在嘴边，反而越说越没有功劳。</span><span>比如我本身是一个家庭主妇，在家里相夫教子，明明做了很多家务，可是我天天说：没有我，这个家能行吗？谁来收拾卫生，谁给你们洗衣服做饭？天天这样讲的时候，自伐者无功，别人不但不感激，还会心生抱怨。</span><span>有的男同志也是一样的，每天出去赚钱养家，本来是一个很好的事情。可是天天说：你看你的衣服，不是我给你买的吗？没有我，你有鞋子穿吗？没有我，你们吃什么？天天这样讲的时候，别人是不是反而产生反感。</span><span>有的人在工作当中帮别人一点事情会怎么讲：“没有我能有你的今天吗？没有我，你的业绩怎么会做成这么好？”其实别人是很反感的。</span></p><p><span>但是不讲的时候呢，我也没做什么，做点家务不是正常的吗？我作为一个男人，养家糊口，是分内之事。我没有帮什么忙，其实都是靠你自己的能力。我们这样讲的时候，反而功劳是最大的，别人是感激的，每个人都是敬重我们的。</span></p><p><span><strong>天道佑之。福禄随之。</strong>天道是护佑我们的，福䘵也是跟随我们的。</span></p><p><span><strong>众邪远之。神灵卫之。</strong>所有的邪恶、不好的事情都会远离我们。所有的神灵也都是来护卫我们的。</span></p><p><span><strong>所作必成。</strong>所做的事情一定会成功的。其实我们在生活、工作当中都会有这样的感受，如果我们经常是去帮助他人的，在我们做事情的过程当中总会有些人无缘无故地也来帮助我们。碰到困难的时候，总是很容易出现一个什么样的人就帮助我们解决了，</span><span>因为我们自己积累过善行。反之也是一样的，有的人做什么事情都不顺，为什么？因为经常给他人捣乱，做过迫害他人的事情，平时没有积累善行，并且还做下了很多恶行，所以在做事情当中就会多坎坷，总有人出现来阻碍发展，总有人出现来破坏事情，是我们自己所感召而来的。</span></p><p><span><strong>神仙可冀。</strong>冀是希望的意思，我们不停地积累善行，不光是所做的事情都会成，想去做神仙也是有希望的呀。</span></p><p><span><strong>欲求天仙者。当立一千三百善。欲求地仙者。当立三百善。</strong>想要成天仙其实也很简单，不停地去积累善行就够了，做一千三百善。想成地仙也很简单，不停地去积累善行，做三百善事，不停地积累善行，积累自己的德行，自然就成仙了。</span></p><p><span><strong>苟或非义而动。背理而行。</strong>非义就是违背天理，违背道义的事情。如果我们去动一些违背天理，违背道义的念头或者行为，都会产生不好的恶业。</span></p><p><span><strong>以恶为能。忍作残害。</strong>很多人是不是以恶为能的。做一些恶劣的行为，做一些不好的事情居然还到处去炫耀。有的人骗人，互相之间<span>还</span>在讲自己骗术多高明，骗的业绩已经达到了多少钱。</span><span>这样的人，都是以恶为能的。还有那些欺负善良的人，打架斗殴的人，天天在欺负他人还觉得自己有多厉害。每天欺负老实人还在说：“你看我多厉害，你看他敢惹我吗？”残害那些无辜的人，甚至残害很多生灵，这都是要给自己降祸损福的。</span></p><p><span><strong>阴贼良善。</strong>阴就是阴谋，贼就是偷的意思。用阴谋去剥夺善良之人手里的东西或者财物。或者以前讲迫害忠臣，用阴谋去偷人家的功劳，也是阴贼良善。比如，现在企业当中，明明这些事情是人家某一个人做的，可是用阴谋把功劳据为己有说是自己做的，这都是阴贼良善。是在给自己积累恶行，是有损自己的德行的。</span></p><p><span><strong>暗侮君亲。</strong>君就是领导，古代叫君王。亲就是我们的双亲、父母。<span>背后侮辱、指责、抱怨</span>领导和父母，这都是不好的行为。</span></p><p><span><strong>慢其先生。</strong>先生指的是老师。怠慢或是诋毁，甚至是侮辱我们的老师。我们在生活当中会有很多的老师，有教我们开车的老师，有教我们学问的老师，可能在工作当中也是<span>我们的</span>老师。不要去怠慢、攻击、诋毁任何一个教我们某项技能和学问的老师。</span><span>再扩大一点，不要去怠慢和诋毁身边所出现的每一个带给我们的正能量的人，对我们有过帮助的人，这些人都可以称之为我们的老师。《论语》讲：“三人行，必有我师，择其善者而从之，其不善者而改之。”我们从任何人身上学习到某一个优点，这样的人都可以称之为我们的老师。</span></p><p><span>这样我们的慈悲之心、能量和格局就在扩大。我们去敬重每一个曾经帮助过我们的人，曾经指导过我们的人，曾经让我们从他身上学习过的那些人。这个时候，我们是以大众为师的。大众或大家、天地所教出来的人才能承载万物。我们以前看武侠剧是不是一样的，高手是不是都是大家教出来的？那个才是高手。</span></p><p><span><strong>叛其所事。</strong>背叛自己所做的事情。以前的叛其所事是指背叛君主，或者背叛以前的上位、领导。现在再宽泛一点，不要背叛自己所做的事情，不要背叛自己上面的领导。现在很多人经常做这样的事情，从一个企业离开了之后，可能还要带走企业的资源，其实这都是不良善的行为，都是恶行的一种。</span></p><p><span><strong>诳诸无识。</strong>欺骗无识无知的人。不要欺骗那些无知的人，现在我们还有很多人专门做这样的事情，去欺骗一些老人、诈取他们的财务，这些行为都是会给自己招来祸端的。</span><span>现世报就是这样的人，违法是要被抓的，最后依然一无所有，还要有牢狱之灾。即使侥幸逃脱，会发现所骗取的那些钱财不能让自己安享晚年的。</span><span>大家观察这个社会上的规律，只要做的事情是欺骗、欺诈他人的，尤其是欺诈一些无知的人，钱财总会有一个地方流出去，存不下来的。因为我们做的事情是有违天理，怎么能积累下来呢？自己也是不得善终的。所以得不偿失，一定不要去做欺骗他人的事情。</span></p><p><span><strong>谤诸同学。</strong>毁谤同学、同事、同乡。没有依据的事情就是诽谤，所以不要去做这类型的事情。</span></p><p><span><strong>虚诬诈伪。</strong><strong>攻讦宗亲。</strong>虚就是虚假，诬就是诬陷，诈就是欺诈。什么叫伪？假的、没有的事情，像这样的行为都不要去做。宗亲，以前同姓谓之宗，异姓谓之亲。</span><span>比如现在跟父亲同姓的亲人就是同宗，跟母亲那边的亲戚是亲。<span>也就是泛指我们所有的亲戚。</span>不要背后做一些攻击、陷害、有损他们利益的事情。</span></p><p><span><strong>刚强不仁。</strong>刚强不仁放在一起了。单讲刚强，不见得是坏的，可是如果刚强是建立在不仁的基础之上就是暴力的。并且不是怀着仁德之心的，自然就做出来很多蛮横无礼的事情。</span></p><p><span><strong>狠戾自用。</strong>很凶狠，残暴，非常的自以为是，以自我为中心。</span></p><p><span><strong>是非不当。</strong>是非分不清楚。所以为什么要学习圣贤的文化？就是让我们明是非、辨善恶。</span></p><p><span><strong>向背乖宜。</strong>向和背是一对反义词，我们要向着阳光，向着善良，向着光明。反过来就是背。乖宜是什么呢？明明我们做的事情是反的，是背对着善良的，背对着阳光的，我们明知道还去做。</span><span>很多时候，难道我们做的事情不知道是错的吗？知道为什么还做？都是有利益关系，有欲望，或者是当我们的情绪起的时候，就做了很多违背自己良知的事情，违背善良的事情。所以修行要懂得控制自己的情绪，要懂得分别自己的欲望。</span></p><p><span><strong>虐下取功。<strong>谄上希旨。</strong></strong><span>下位</span>以前就是子民、人民，<span>虐待下位的人，</span>而取得自己功劳。旨是赞同，迎合之意，谄上既然能用谄媚，说明他的旨意一定是不合正道的，一定是有问题的。</span><span>明明知道他的旨意是不合礼法的，是不好的，我们也去赞同和迎合。不要去做这样的事情。</span></p><p><span><strong>受恩不感。</strong>我们接受了别人的恩惠，别人的帮助，却没有感激之情，没有感谢之意。有一个词叫有感恩之心，我们要感恩那些曾经帮助过我们的人，甚至要感谢生活当中所出现的每一个人，再甚至我们要感谢世界上的万事万物。</span></p><p><span>比如要感谢我们的车子，没有车子我们的交通不便利。要感谢我们的房子，没有房子不能遮风挡雨。甚至要感谢每一朵花，每一朵花都以它的方式在给这个世界带来色彩。我们要感谢阳光，感谢雨露，感谢微风，感谢我们生命当中的每一个人。</span></p><p><span>我们不断地懂得去感谢，懂得去感恩他人，我们的心性自然就是光明的，自然就会慈心于物。感谢一个人，看看我们是怎么对待他的。感谢万物，又是怎么对待的呢。当我们懂得感谢天地万物的时候，我们的心念就是光明的。</span></p><p><span><strong>念怨不休。</strong>这实在是极其恶劣的行为。生活当中经常有这样的情况，我们不但不感谢那些帮助我们的人，念头里反而会产生怨恨，不肯罢休。别人帮助了我们，反而像仇人一样，这就是念怨不休。</span></p><p><span><strong>轻蔑天民。扰乱国政。</strong>轻蔑是轻视，不放在眼里。天民是天下人民。分开讲，先讲天和民，民就是人民，天就是天道。天是爱民的，如果我们轻视天下人民，就相当于是在轻视天道。同样，如果我们轻视天道，连天道都不相信，我们自然也不把人民放在眼里，是相通的。</span><span>如果我们不把天民放在眼里，一个人的行为就是不懂得约束自己的，什么事情都敢为。所以不相信善恶的人，不惧怕法律的人，是不是什么事情都敢做？只要我们是敬畏因果的，敬畏天道的，敬畏每一个人的，自然就谨言慎行，我们的行为也自然就是有德行的。</span></p></div></div>"
  },
  {
    "title": "《太上感应篇》第四讲",
    "date": "2024-03-17",
    "html": "<div class=\"B1_text\"><div><p><span><strong>《太上感应篇》第四讲</strong></span></p><p><strong>扰乱国政。</strong><span>扰乱国政的人一定是做官的人。现在我们扰乱不了国政，但是也不要破坏社会的秩序。如果在一个企业当中，不要扰乱企业的正常的秩序。我们很多人都是反着来的，在一个团队当中，如果自己犯了过错，不懂得反躬自省，反而要拉着别人和自己一起去扰乱秩序和规则。</span><span>这样的人其实都是在作恶的，因为人在做事情的时候都想把别人变成和自己一样。如果我们是一个君子，想把别人也影响成君子。如果我们做事情是不守规则的，是做伤害他人的事情，我们害怕孤单怎么办？就想着把别人也变成和自己一样，一起去对抗和扰乱秩序，其实这些都是恶行，都是非常不好的行为。</span></p><p><span><strong>赏及非义。刑及无辜。</strong>我们奖赏的却是不合道义，不合天理的。刑就是惩罚，反而去惩罚那些无辜的人。为什么会做这样的事情？</span><span>无非是利益关系，有的人虽然违背了道义，可是他跟我有利益关系，反而去奖赏于他。有的人我们明知道他是无辜的，为什么要惩罚他呢？因为利益关系。所以说我们有那么多的欲望在身、在心的时候，做事情自然就有失公允，违背道义。</span></p><p><span><strong>杀人取财。倾人取位。</strong>杀害别人，得到他的钱财。倾是倾倒、歪斜、反转。我们把别人扳倒反转，取代他的位置。以前做事情不择手段就是这样的，别人站在那个位置上，想办法让他下来，让他倾倒，而我们去取而代之。</span><span>其实现在的企业当中经常出现这样的情况，想办法用一些不好的手段，让别人在老板、领导那里失信，然后去取代他的位置。其实都是不好的恶行，都是损阴德、耗福报的事情。</span></p><p><span><strong>诛降戮服。贬正排贤。</strong>降服就是已经投降的，已经臣服之人。还去杀戮、杀害俘兵。贤就是有德行的人，有才能的人。贬低那些正直的人，排挤那些有能力、有才华的人，这些都是不好的行为。</span></p><p><span><strong>凌孤逼寡。弃法受赂。</strong>欺凌和逼迫那些孤寡之人，放弃了法律、法则，而接受一些贿赂，去做一些不利于他人的事情，不符合法理的事情。</span></p><p><span><strong>以直为曲。以曲为直。</strong>歪曲事实，颠倒是非黑白。是知道是非的，但是却让黑白颠倒，是非颠倒，歪曲事实。</span></p><p><span><strong>入轻为重。见杀加怒。</strong>本来有一些人是触犯很轻、不犯法律的行为，却给他重判。并且即使犯了刑的人，要去执行死刑的人，也应该怀着悲悯之心去对待，而不是更加的愤怒。</span></p><p><span>在生活当中也是一样的，明明他人有小的过错，但是我们揪住不放，不依不饶，这都是以轻为重。看到别人身上有不好的行为，不应该是加以愤怒的，而是应该有悲悯之心，帮助他去改正的。</span><span>有的时候看电视、看新闻，有的人去欺凌其他人，身边的同伴不但不去制止，不但不去劝免，却在旁边加油助威，这都是加怒这样行为的，都是损害他人的，也都是不利于自己德行的。</span></p><p><span><strong>知过不改。知善不为。</strong>知道自己有过错还不去改正，知道很多善行却不去做。</span></p><p><span><strong>自罪引他。壅塞方术。</strong>明明是自己的过错，却推到他人的身上，这叫自罪引他。壅塞是阻挠、阻碍。方术，以前的医卜、星象。用这些方术之人，小则养家糊口，大则记事的，不要去阻挠和阻碍这样的事情。这里的方术指的是去做正义的事情，而不是用方术做欺诈之人。</span></p><p><span><strong>讪谤圣贤。侵凌道德。</strong>讪就是戏侮、戏耍。谤就是诽谤。不要去这样对一些圣贤和有贤德之人。不要去欺凌那些有道德的人和人家做的有道德的事情。</span></p><p><span><strong>射飞逐走。发蜇惊栖。</strong>飞是飞禽，走是走兽。不要去射杀、捕捉飞禽走兽。蜇是蜇伏，冬眠中的动物叫蜇，栖就是栖息在树上的鸟。不要去挖正在冬眠中的动物，也不要去惊扰正在栖息当中的鸟类。</span></p><p><span><strong>填穴覆巢。</strong>看到一些动物的洞穴给人家堵上，看到一些鸟巢把它捣毁，让它们无家可归。千万不要去做这样的事情，其实无形之中，都会损自己的阴德的。</span></p><p><span><strong>伤胎破卵。</strong>看到一些鸟类，或者有的地方有很多的山鸡，它的栖息之地里面都有一些蛋的，有的人就会拿回去煮着吃，蛋里面都是有幼崽的，有胎有卵就意味着里面有更多的生命，这些事情都不要去破坏。</span></p><p><span><strong>愿人有失。</strong>希望别人有过错，幸灾乐祸的。生活和工作当中经常出现这样的事情，当我们看一个人不顺眼的时候，当人家正在积极向上的做事情，我们是希望他出过错的，是幸灾乐祸的状态。这样的行为也都是有损自己的德行的。</span></p><p><span><strong>毁人成功。</strong>从中去破坏，不让他人成功。希望他人有过失，把事情做得不好，我们从而幸灾乐祸。</span></p><p><span><strong>危人自安。减人自益。</strong>去危害他人求得自身的安稳。减少他人的利益，增加自己的利益。</span></p><p><span><strong>以恶易好。以私废公。</strong>明明展示出来的商品是好的，可是在交易的时候却把它换成不好的，这都是以恶易好的行为。为了一己之私而废弃公理，废弃公道。</span></p><p><span><strong>窃人之能。<span>蔽</span>人之善。</strong>窃就是把别人所做的事情和功劳据为己有。掩盖和隐藏别人的善行、长处。</span></p><p><span><strong>形人之丑。讦人之私。</strong>暴露别人的丑行，暴露别人的隐私，去揭发别人的隐私。</span></p><p><span><strong>耗人货财。离人骨肉。</strong>消耗他人的财物、财富。做的一些事情和行为是让人家骨肉分离的。比如，贩卖儿童、倒卖儿童的。甚至从中挑拨离间，让人家骨肉分离、不得团聚的，这样都是很大的恶行了。</span></p><p><span><strong>侵人所爱。助人为非。</strong>侵占和占有别人爱的人、事或物。帮助他人做一些不好的事情、<span>为非作歹，</span>。</span></p><p><span><strong>逞志作威。辱人求胜。</strong>逞是逞能，显示自己的才能，不懂得约束自己的行为，<span>按照自己的想法，</span>做一些危害他人、有损他人的事情。侮辱别人去求得胜利，以显己之能。生活当中经常出现靠侮辱别人、诋毁别人、贬低别人来抬高自己。</span></p><p><span><strong>败人苗稼。破人婚姻。</strong>农民是以谷为命的，粮食是非常重要的。不要去破坏人家的禾苗、庄稼。不要破坏他人的婚姻。</span></p><p><span><strong>苟富而骄。苟免无耻。</strong>一旦富贵，开始变得骄纵，这都是不好的行为。犯了错误在先，幸免受罚，还无羞耻之心。</span></p><p><span><strong>认恩推过。嫁祸卖恶。</strong>认是冒认冒领。冒领一些好的事情，去推脱、推卸自己的过错和责任。把一些过失嫁祸给他人，把自己所做过的一些恶事都卖给他人，就是推卸到他人的身上。</span></p><p><span><strong>沽买虚誉。包贮险心。</strong>一些空的名誉、头衔，去作假，这样的行为都是不好的。表面上又表现得很和善，背地里去做着阴险害人的事情，这就叫包贮险心，包藏祸心。</span></p><p><span><strong>挫人所长。</strong>当别人有长处的时候，我们去挫其志，让别人的长处不能得以发挥。比如有的人明明做得很好，是需要鼓励的，但是我们可能有一己之私，或为了显己之能，不停地说一些打击对方的话，让对方的长处不能得以发挥，这都是恶行。</span></p><p><span><strong>护己所短。</strong>护持自己的短处，护持自己身边人的短处，护持自己所爱之人的短处。</span></p><p><span><strong>乘威迫胁。</strong>乘威就是利用自己的权威，去做威迫、威胁他人的事情。</span></p><p><span><strong>纵暴杀伤。</strong>纵容，施暴，去杀害和伤害他人，甚至伤害很多动物，伤害很多东西，都是一样的。</span></p><p><span><strong>无故剪裁。</strong>就是无缘无故地浪费。比如我们的衣服，浪费很多物料。因为以前人们的东西都是来之不易的。即使我们现在的物品充足，也不能去过度地消耗和浪费。所以老人都教给我们：福向俭中求。我们生活是要节俭的，不能浪费的物品一定不能浪费，不要无故剪裁。</span></p><p><span><strong>非礼烹宰。</strong>不要任意残杀。</span></p><p><span><strong>散弃五谷。劳扰众生。</strong>不要浪费粮食，劳烦、骚扰、驱使百姓。这样的行为叫劳扰众生，把百姓当牛和马一样去驱使。</span></p><p><span><strong>破人之家。取其财宝。</strong>不要去破坏人家的家园。去剥夺人家的财富。</span></p><p><span><strong>决水放火。以害民居。</strong>不要去做放水放火的事情。以残害别人的家园。</span></p><p><span><strong>紊乱规模。以败人功。</strong>规模是政令，规则，法令。不要去破坏人家的政令，不要去破坏人家的规则。不让人家的事业得以成功。</span></p><p><span><strong>损人器物。以穷人用。</strong>损害他人的器物，让人无法使用。</span></p><p><span><strong>见他荣贵。愿他流贬。</strong>看见他人是荣华富贵的，高官厚禄的，就希望他被流放、被贬官。</span></p><p><span><strong>见他富有。愿他破散。</strong>看见他人富有，就希望他人破散。我们的心里往往都会住着一个念头，不希望他人比我们过得更好。所以在生活当中，如果看别人过得更好，就会心生怨恨，希望他人破财。</span><span>在一个企业当中，看到那些有能力的人就希望他出差错。在生意上，看到他人生意做得好，我们心里希望他开始变得不顺。其实这些念头起的时候，都是在给自己做恶，都在不停地损耗自己的阴德。</span></p><p><span><strong>见他色美。起心私之。</strong>看到他人的美貌、美色，就想占为己有。或者是看到别人手里有好的东西，好的宝贝，我们都想占为己有。</span></p><p><span><strong>负他货财。愿他身死。</strong>负就是欠别人的财物，欠别人的外债就希望他出意外，是不是我们就不需要再还了，这样的想法念头，都是很大的恶业了。</span></p><p><span><strong>干求不遂。便生咒恨。</strong>求人办事，对方不帮忙，让自己不如意、进展不顺利的时候，便生怨恨，心里是咒骂他人的。</span></p><p><span><strong>见他失便。便说他过。</strong>就是落井下石。见他人失去了权力，或者失去了说话的话语权。这个时候我们就开始说他过去的过错，开始落井下石。</span></p><p><span>从见他荣贵开始，到这里见他失便，便说他过，这都是心理的活动。</span><span>我们修行要修自己的念头，整个这一段行为并没有产生，但我们心里的恶念已经产生，就已经开始造业了，所以我们一定去不断地修正自己的念头。</span></p></div></div>"
  },
  {
    "title": "《太上感应篇》第五讲",
    "date": "2024-06-09",
    "html": "<div class=\"B1_text\"><div><p><span><strong>《太上感应篇》第五讲</strong></span></p><p><span><strong>见他体相不具而笑之，见他才能可称而抑之。</strong>体相不具就是身体上有一些残疾，形象比较丑陋之人，不要笑话讥笑这样的人。看到他人有才能有才华，我们是压抑压制的，这都是不好的行为。</span></p><p><span><strong>埋盅厌人，用药杀树。</strong>用邪法、盅术去害人。用药杀害花草树木都是不好的行为。</span></p><p><span><strong>恚怒师傅，抵触父兄。</strong>愤怒、憎恨、辱骂自己的师傅，自己的老师。顶撞和冲撞自己的父亲和兄长，这样都是无礼的行为，无礼的行为也是一种恶行。</span></p><p><span><strong>强取强求，好侵好夺。</strong>靠比较蛮横、强硬的方式抢夺来的财物，这样都是损阴德的。</span></p><p><span><strong>掳掠致富，巧诈求迁。</strong>求迁、套路和掠夺的方式让自己获得财富，靠奸巧伪诈的行为让自己升迁，也就是说我们的官位也好，我们的升迁也好，我们的财富也好，是用不正当的方式，用欺诈的方式，用强取豪夺的方式所获得的，都是恶行。</span></p><p><span><strong>赏罚不平，逸乐过节。</strong>赏罚不明、不平、不正当、不均衡。享乐安逸的生活不懂得节制，过度地消耗，都是损耗自己德行的行为。</span></p><p><span><strong>苛虐其下，恐吓于他。</strong>苛责和虐待处在自己下位之人。以前朝廷上来讲黎民百姓，现在来讲是指下属，或者是自己的孩子，甚至是自己的父母。</span><span>因为有的时候，父母可能要倚仗我们去生活生存，只要是生活在我们之下的，是倚仗着我们来生活和做事情的，都叫其下。我们不能去苛责和虐待，不能恐吓他人，让他人心生恐惧，这都是不好的行为。</span></p><p><span><strong>怨天尤人，<strong>呵风骂雨。</strong></strong>经常有很多人是怨天尤人的，当发生了一个事情，就怨天怨地指责他人。《中庸》讲：正己而不求于人，则无怨，上不怨天，下不尤人。当遇到事情的时候，我们要懂得去修正自己，如此才能不产生怨恨，也不会怨天，也不会尤人。</span><span>不要呵斥风雨，其实就是指天骂地了，我们很多人有的时候做事情不顺畅，情绪起来的时候，就容易指天骂地，遇到谁就对谁发脾气，苛责，指责，这样都是损自己阴德的行为。</span></p><p><span><strong>斗合争讼。</strong>斗就是争斗，合就是撮合。去挑拨他人之间产生争讼的行为。不要私下去与人打斗，也不要撮合与他人打斗，也不要去撮合他人去做争讼的事情。</span><span>比如，我们看到一些事情，现在很多人的行为都是去指使对方说：不行就告他，不行就想点什么卑劣的手段。这样的行为都是不好的行为，都在损自己的阴德。</span></p><p><strong><span>妄逐朋党。</span></strong><span>不问是非，妄加评论，去拉帮结派。</span></p><p><span>很多时候，我们去帮朋友之间的忙也是这样的，不问是非，不知事情的全貌，就开始下结论，然后拉帮结伙地去做事情，或者去帮忙，其实都是为非作歹的行为。</span><span>现在我们这个时代，更容易发生这样的事情，比如，我们有的时候在看视频，或者在看新闻的时候，可能只是断章取义，看到了其中一段，就开始妄下结论，结党营私，去拉帮结伙去站队做事情，其实都是有失公允。</span><span>通常有智慧的人，是不会轻易去对他人的事情，妄加评价的，因为不知全貌，这样的行为，其实无形之中，都在损耗我们的阴德，只是我们还不自知。</span></p><p><span><strong>用妻妾语，违父母训。</strong>经常听一些妻妾的语言，而去违背父母的训导和教诲。这里讲得很清楚，能称为训的，通常就是父母对我们的教诲，讲的正确的话才叫训，并不是说所有的话，我们都必须按照父母所指导的去做，</span><span>而是他对我们正确的教诲。不是正确的教诲，我们可能不顶嘴不顶撞，可是我们不一定非要照着做。</span></p><p><span><strong>得新忘故。</strong>得到新的东西，就开始忘记了原来的东西，喜新厌旧。其实不光是对人，对事对物都是这样的，不要新买来的东西，旧的就弃之不用了，每一件物品也要物尽其用的。</span></p><p><span><strong>口是心非。</strong>做事情讲的是一套，内心里想的又是另外的样子。</span></p><p><span><strong>贪冒于财，欺罔其上。</strong>贪冒就是冒认冒领，本来不属于我们的财物，去默认去冒领。欺罔其上，以前叫欺君罔上，现在一样的，做事情是欺瞒的，然后自己得到了一些不义之财，或者不该我们拿到的东西，用欺上的手段获得。</span></p><p><span><strong>造作恶语，谗毁平人。</strong>造作就是捏造的非事实的语言，去毁坏他人，对别人恶语相向。谗悔平人，用谗悔诬陷，去冤枉好人。本来这个话，我们是不该这样讲的，不该冤枉他人的，而是为了自己的私欲，开始变得冤枉他人，开始去颠倒是非，都在损耗自己的阴德。</span></p><p><span><strong>毁人称直，骂神称正。</strong>毁谤他人，诋毁他人，以凸显自己的正直。靠辱骂天地神灵，以凸显自己的正直。</span></p><p><span>比如，很多人都会讲这样的话，靠诋毁别人来凸显自己非常的正直、非常的正义。</span><span>甚至辱骂天地神灵“不要相信这些天地，不要相信什么鬼神，没有什么善有善报，没有什么天道循环”，然后以显示自己非常的正直。“我就是最正义的人，像我们这样的人，什么都不要信，信我们自己就好了”，这样的行为都是在骂神称正，都是在毁人称直。</span></p><p><span><strong>弃顺效逆。</strong>效仿一些忤逆的行为，而不去顺从。比如，很多孩子在青春期的时候容易叛逆，开始不顺从父母，不顺从师长所讲的话，学习了其他孩子身上的忤逆的行为，这样的行为都是不好的。</span></p><p><span><strong>背亲向疏。</strong>背着自己亲近的人，反而向着疏远的人，这样的行为都是不对的，都是我们不懂得亲情，不懂得爱护身边的人，所做出来的偏激的行为。</span></p><p><span><strong>指天地以证鄙怀，引神明而鉴猥事。</strong>这个就相当于现在经常讲的发誓，明明自己做了坏事，却指天地为证，让鬼神给自己证明，为什么会这样做。</span><span>就是为了使别人相信我们所讲的话是真的，但是实则我们做的是卑鄙的事情，自己心里怀着是很猥琐的想法。但是为了取信于人，不停地发誓，好像天地鬼神，能为我们作证一样。其实我们心里明知道自己是不好的，这样的行为是极损耗自己的阴德的。</span></p><p><span>很多经常发誓的人，他的脾气秉性，并不温和，生活并不顺利，其实都是在不停地消耗自己的阴德，而不自知。越是优秀的人，越是有成就的人，哪有天天动不动就发誓的，动不动就让天地鬼神给自己作证，这都是内心亏耗的表现，内心虚诈的表现。</span><span>总想拿一个事情，让别人相信，但是实则别人是一目了然的，很清楚的，只是不讲出来罢了。</span></p><p><span><strong>施与后悔，假借不还。</strong>施与给别人东西就开始后悔。以借为名，其实刚开始借的时候，自己心里就已经打定了主意，不会还给人家的。</span></p><p><span><strong>分外营求，力上施设。</strong>本分之外的东西，我们想去贪取。奢求的东西，靠施威、或者想方设法去破格获取。超出自己本分的东西，利用一些卑鄙的手段、或者施威的方法获得。</span></p><p><span><strong>淫欲过度，心毒貌慈。</strong>心里怀的都是很阴暗，很恶毒的想法，但是表面上又表现得很慈祥，很慈悲的样子。</span></p><p><span><strong>秽食馁人，左道惑众。</strong>秽食就是污秽的食物，给别人吃、或者卖给他人的是不干净的东西、过期的东西。利用一些旁门左道之术，去迷惑众人，以达到骗取和诈取的目的。</span></p><p><span><strong>短尺狭度，轻秤小升。</strong>缺斤短两，比如说卖一个用量尺、用米来计算的物品，明明是一米，用尺子去量到九十五、或者九十厘米，这都叫短尺。轻秤就是缺斤少两，明明应该是两斤的东西，我们只给人家一斤八两，或一斤九两，这样都是损耗自己阴德的行为。</span></p><p><span>一个新闻在讲这样一个故事，现在有的秤是用遥控的，很多人在这里买鱼，发现斤数好像不对，后来就报警。可是他是遥控操作的，警察来了之后，也没有办法，因为警察到了，他就又恢复到了原来的样子。</span><span>但是当别人买鱼的时候，又是短两的。这样的行为是非常损耗阴德的，其实是得不偿失的，当下看似多赚了点钱，其实背后一定是有所损失的，天道循环的规律丝毫不差的。</span></p><p><span><strong>以伪杂真，采取奸利。</strong>用假的东西充当真的，然后去榨取钱财，获得不该得到的利益。</span></p><p><span><strong>压良为贱，谩蓦愚人。</strong>逼人为奴、为娼、为婢这样的行为，使用诡计，欺骗或者压榨那些没有智慧的人。</span></p><p><span><strong>贪婪无厌，咒诅求直。</strong>一直贪取、索取，但是还不知道满足。经常很多人遇事情的时候就会咒骂、诅骂，以表示自己的正直，好像别人都是曲的，别人都是错的，只有我们自己是正直的，这样的人经常去咒骂、去诅骂，来证明自己的正直。</span><span>其实别人是不愿与之争辩，但是我们都会想远离这样的人，同时天道循环的规律，也会损耗这样人的福德。</span></p><p><span><strong>嗜酒悖乱。</strong>经常喝醉酒，做出一些违背道理，违背道德的行为。比如，很多人酒后乱性，酒后打架，甚至酒后辱骂自己的父母，酒后做出来很多破格的事情。一定不要经常醉酒，去做一些悖理的行为。醒酒之时，又开始后悔，但是造成的损失和对他人的伤害，已然无法弥补了。</span></p><p><span><strong>骨肉忿争。</strong>跟自己的双亲、自己的兄弟姐妹，因为一些利益，一些言语的不和，一些生活的冲突，骨肉相争。</span></p><p><span><strong>男不忠良，女不柔顺。</strong>如果男人不是忠厚善良的，女人不是温柔和顺的，这都是不合天道的，都算是不好的行为。因为中国自古以来就讲乾坤之道，乾为天代表男，坤为地代表女，所以女人是温和的，是柔顺的，男人是善良的，是诚实的、是敦厚的样子。</span></p><p><span><strong>不和其室，不敬其夫。</strong>夫妻之间不和睦相处。</span></p><p><span><strong>每好矜夸，常行妒忌。</strong>经常自夸，经常自大的人，遇到比自己有能力的人，遇到比自己好的人，就常行嫉妒。当我们这样的念头升起的时候，第一，自己的心性会变得阴暗，会变得不光明。</span><span>第二，其实已经在损耗自己的德行。所以我们要时刻注意自己的行为，自己所讲的话和自己的每一个念头，无形当中都在造着善业或者恶业。</span></p><p><span><strong>无行于妻子，失礼于舅姑。</strong>不善待自己的妻子。舅姑，古代是指公婆。不孝敬公婆，对公婆无礼，这都是不好的行为。</span></p><p><span><strong>轻慢先灵，违逆上命。</strong>轻视和慢待自己祖先的灵位，不敬重过去的我们的祖上。违反和忤逆上方之命。古代常指君王，现在上命可以是我们的老师，可以是单位的领导，可以是我们的长辈，是我们的父母。</span></p><p><span><strong>作为无益，怀挟外心。</strong>所做的事情都是没有意义的，更不是利益他人的。做事情是三心二意的。比如现在正在做着当下的工作，心里却又想着其他的事情，这都是三心二意。</span></p><p><span><strong>自咒咒他。</strong>经常咒骂自己，或者咒骂他人。其实经常抱怨的朋友总犯这样的错误，一到事情发生的时候，开始咒自己，开始骂自己、恨自己，甚至骂他人恨他人，这样的行为都是不光明的，会让我们的内心更加阴暗的。</span></p><p><span><strong>偏憎偏爱。</strong>做事情的分别心非常大，遇到憎恨的人，他做什么都是错的。遇到偏爱的人，好像他做什么东西都是对的，说什么话都是对的。这样的行为，做事情是有失偏颇的。</span></p><p><span><strong>越井越灶，跳食跳人。</strong>井和灶台是不能跳跃、不能跨越、不能从上面走的。所吃的食物，还有人，是不能从他身上迈过的。其实我们小的时候，父母都会教给我们，灶台和井不能跳，是不能从人身上迈过去的，包括我们的食物，这些都是不敬的，都是无礼的行为。</span></p></div></div>"
  },
  {
    "title": "《太上感应篇》第六讲",
    "date": "2024-06-09",
    "html": "<div class=\"B1_text\"><div><p><span><strong>《太上感应篇》第六讲</strong></span></p><p><span><strong>损子堕胎。</strong>损子就是虐待孩子，虐待儿童。堕胎，胎死腹中。现在堕胎的人比较多，建议大家尽量不要去堕胎，会影响男人的运势，也会影响女人的身体健康，也会损耗自己的阴德。</span></p><p><strong><span>行多隐僻。</span></strong><span>做事情有很多不光明正大的地方。如果见不得光的事情越多，隐私的事情越多，我们的内心就越不坦然，很多朋友一起学习的过程当中经常问：要如何静心，如何让自己的心变得坦然，变得光明？那就减少那些见不得人的事情，减少那些见不得光的事情，我们内心才能坦然。</span></p><p><span>大家想一想，在我们平时的生活当中也好，工作当中也好，在我们的人际交往的过程当中也好，只要做了自己觉得不是正大光明的事情，看看内心是不是忐忑不安的，是不是怕被人发现的，总有这些事情和心思在，我们的心又如何静的下来？我们又如何坦坦荡荡呢？</span></p><p><span><strong>晦腊歌舞。</strong>在晦腊这两个日子不要去唱歌跳舞。每个月的最后一日称为晦日。道家讲三元五腊，三元指的天官，地官，水官，五腊是一年当中有五个节日，有正月初一，就是我们传统的春节，有五月初五端午节，还有七月初七，就是七夕节，还有十月初一是寒食节，还有十二月初八，就是腊八节，称为五腊。</span><span>在三元五腊这样的日子，是五方五老和三官下界访察、下界校正的日子。校正人的生死、善恶福䘵等等事情。在这样的日子，是不适合唱歌跳舞的，这是道家的习俗。</span></p><p><strong><span><span>朔旦号怒。</span></span></strong><span>朔是初一，旦是早晨，在初一和早晨的时候，不要去呼喊和愤怒。</span></p><p><span><strong>对北涕唾及溺。</strong>北方住着北斗神君，对着北方的时候，不要去做这样的行为。</span></p><p><strong><span>对灶吟咏及哭</span></strong><span>。不要对着灶台唱颂，以及去哭泣，都是对神明不敬的事情。</span></p><p><strong><span>又以灶火烧香。</span></strong><span>不要以灶火去点香。</span></p><p><span><strong>秽柴作食，夜起裸露。</strong>用污秽的柴火去做食物，这是不洁的行为。即使夜起的时候，也不要裸露自己的身体。古人讲，对明要保持君子风范，对幽也就是对暗处，也是要保持君子风范的，不能裸露自己的身体，明是对人不敬，暗是对鬼神不敬。</span></p><p><span><strong>八节行刑。</strong>在八个节气，不要去行刑。通常八个节气有：立春、春分、立夏、夏至、立秋、秋分、立冬、冬至。</span></p><p><span><strong>唾流星，指虹霓。</strong>这样的行为也是不敬的。</span></p><p><span><strong>辄指三光，久视日月。</strong>三光指的是日月星辰。久视日月也被视为不敬天地的行为，不敬日月的行为。</span></p><p><span><strong>春月燎猎。</strong>燎猎就是焚火。在春天的时候到山里，切忌不要做这样的行为。因为春天多孕，动物也是多孕怀子的季节，并且燎猎这样的行为，会多杀无辜的。一旦放火烧山林，会有很多的动物，因此受到伤害，这样的行为是罪大恶极。</span></p><p><span><strong>对北恶骂。</strong>对着北方去恶骂，因为北方住着是北斗神君的。</span></p><p><span><strong>无故杀龟打蛇。</strong>无缘无故地去杀害龟、蛇，这些有灵性的动物。</span></p><p><span>刚才讲晦腊歌舞一直到后面这一段，是有很多道家对于神明、对于天地的一些敬畏。</span><span>这一段我们自己适当的应用到现在的生活当中去就好了，其他的大多数都是在要求我们的行为，包括自己所讲出去的话和念头，心里所动的那些心思，这一段加上了一些道家对于天地鬼神的敬畏之心。</span></p><p><span><strong>如是等罪，司命随其轻重，夺其纪算，算尽则死。</strong>如上所讲的一百七十条恶行，这些不好的行为，有司命星君来按照我们自己所犯的轻或重，来夺我们的纪和算。</span><span>一纪是十二年，一算是一百天。看我们所做的恶行的轻重来判定。司命星君有很多位，有的主管生死，有的主管福䘵，有的主管婚姻，有的主管福祸。也就是说这些司命星君，是掌管着人间所有的能呈现出来的那些福祸、生死善恶等等这一切事情。</span></p><p><span>所以我们所有的行为念头，所讲出去的话，是善的还是恶的，都是被实时的记录在案的，会根据我们的善行和恶行，给匹配相应的福报，相应的婚姻，相应的财富，相应的官位，相应的智慧。</span></p><p><span>所以告诉我们祸福无门，唯人自召。善恶之报，如影随形。都是我们自己所造作的，都是我们自己所感召而来的，不要去怨天尤人，要懂得时时刻刻警醒自己，修正自己的行为以合天道，如果我们一旦恶行过多，算尽则死，生命就结束了，不得寿终正寝的。</span></p><p><span><strong>死有余责，乃殃及子孙。</strong>如果算尽则死，还有余责，我们子孙也要跟着受到相应的惩罚的。所以一定不要祸及子孙。《周易》讲：积善之家，必有余庆，积不善之家，必有余殃，也是同样的道理。</span></p><p><span><strong>又诸横取人财者，乃计其妻子家口以当之。</strong>横取就是靠威势，靠蛮横以获得的不义之财，强取得到他人之财，虽然我们暂时看似夺取来的东西，好像是自己得到了。</span><span>接下来自己的家人会来偿还、抵债的。现在社会也经常发生这样的事情，看似好像豪取，强夺了很多财物，但是会出现自己的妻子、<span>孩子</span>或者<span>家人</span>，把所得到的那些不义之财消耗掉。</span></p><p><span><strong>渐至死丧。</strong>甚至严重者，夺取自己的性命，家人的性命，所以说不得不引以为戒。</span></p><p><span><strong>若不死丧，则有水火盗贼。</strong>如果罪不至死，恶不至死，就会出现水火盗贼，来剥夺我们横取的那一部分。比如说有水灾，有火灾，或被别人偷盗而去，这都是因为横取的那些财本不该属于我们。天道是损有余而补不足的，一定会以其他的方式再夺走的。</span></p><p><span><strong>遗亡器物，疾病口舌诸事，以当妄取之值。</strong>还会发生诸多的事情，类似于疾病，口舌之争，惹上官司等等这些事情的出现。横取的那些财货，还会去抵消同等价值的东西，发生的事情。</span><span>看看是不是得不偿失的，当下用一些卑劣的手段，看似有所得，但是经历了很多事情之后，还是要消耗掉的，并且又损耗自己的德行，浪费了生命的光阴。</span></p><p><span><strong>又枉杀人者，是易刀兵而相杀。</strong>冤枉他人杀了人。看似是在枉杀他人，实则是相杀而报之；看似在杀人，实则是在杀己的。因为天会重新回报给自身的，只是我们当下没有看到而已。所以我们冤枉杀人，其实像是刀兵相杀，最终都是要回馈到自己的身上的。</span><span>有的人可能侥幸的逃脱了法律的制裁，但是逃脱不了天道的循环，这就是因果报应，丝毫不爽的。所以一定不要去做这样的事情，冤枉他人就相当于是在冤枉自己，损害他人实则也是在损害自己，最后都会回到自己的身上，如影随形，就像我们自己的影子一样，是摆脱不掉的。</span></p><p><span><strong>取非义之财者，譬如漏脯救饥，鸩酒止渴。</strong>漏脯是指以前的腊肉挂在房檐下，而那个地方漏雨漏水，被这些漏水浸泡过的肉是有毒的。如果我们取的是非义之财，好比是吃已经腐烂的有毒的肉，好比是喝了毒酒。</span></p><p><span><strong>非不暂饱，死亦及之。</strong>非但不能吃饱，死亡马上就来临了。告诉我们，切忌不要取非义之财，看似有所得，结果必有所失的。</span></p><p><span><strong>夫心起于善，善虽未为，而吉神已随之。</strong>结尾给我们讲善念了。当我们心里一个善念起的时候，善行虽然还没有做，但是吉神已随之了。</span></p><p><span><strong>或心起于恶，恶虽未为，而凶神以随之。</strong>同样的道理，如果我们心里起的都是恶念，虽然还没有做出来具体的行为，但是凶神已随之。随着我们的善念和恶念越来越多，我们所积累的自己的善业和恶业，自然就会越来越多。</span></p><p><span><strong>其有曾行恶事，后自改悔。</strong>如果我们曾经是做过不好的事情，做过恶事的，没关系的，不要恐慌，也不要去害怕，我们马上去改正，去改悔就好了。</span></p><p><span><strong>诸恶莫作，众善奉行。</strong>所有的恶事不要再去做，所有的善行都要去做。从每一个小事情开始去做，从我们每一个善念开始去起，从我们鼓励和赞美他人的话语开始去说，从我们身口意，三个方面，不断地去修正自己，我们的德行就会变得日益丰厚。</span></p><p><span><strong>久久必获吉庆，所谓转祸为福也。</strong>经过天长地久，自然就会获得吉庆，自然就会拥有相对的福德，这就是转祸为福。</span></p><p><span>我们做过一些不好的行为，无需担心，当我们诸恶莫作，众善奉行的时候，自然就是转祸为福。</span><span>上天有好生之德，万物留一线生机，曾经做过一些不好的事情，又有什么可担心的，我们从当下开始改正，上天是慈爱世人的，是慈爱众生，慈爱万物的，所以任何事情都留给我们一线生机，可是如果我们不懂得改变，就是自作孽不可活。</span></p><p><span><strong>故吉人语善、视善、行善。</strong>所以说吉祥的人讲的话都是有益于他人的，看到的都是善良的事情，观察的角度也都是善良的，行为也都是善良的。为什么吉人语善视善行善，因为吉人内心是善良的，心是善良的，念念是善良的，自然所讲出来的话就是善良的，看到的世界自然就是美好的，行为自然也就是善良的。</span></p><p><span><strong>一日有三善，三年天必降之福。</strong>每日有三善，三年天必降福。每天讲的都是善良的话，起的都是善良的念头，看到的都是好的、善良的、光明的事情，行为都是善良的，我们每天只要坚持长久的这样去做，三年必然会获吉庆，自然会得福德。</span></p><p><span><strong>凶人语恶，视恶、行恶。</strong>同样，凶狠的人讲出来的话都是恶狠狠的，讲出来的话都是伤害他人的，讲出来的话都是辱骂的，看到的也都是这个世界的阴暗面，看到什么都能去指责，都能去抱怨，行为也都是恶行。</span></p><p><span><strong>一日有三恶，三年天必降之祸。</strong>如果每天都是活在这样邪恶的念头当中，活在这些恶行当中，三年必降祸。老人是不是常跟我们讲这样的话？“看看哪些人，当下做的是恶事，老天一定会惩罚他的。”所以如果是通过一些不好的手段，经常是欺凌他人的，当下看似好像挺风光的，其实过几年，天降奇祸的，一定是得不偿失的。</span></p><p><span><strong>胡不勉而行之？</strong>为什么不勉励地前行。</span></p><p><span>整个《太上感应篇》，讲了二十六条善行，一百七十条恶行。告诉我们时刻懂得去规范自己的每一个念头，所讲出去的每一句话，所做出来的每一个行为，让我们自己时时刻刻懂得去修正。</span></p><p><span>当我们学习了《太上感应篇》以后，就好比是在我们心里扎了根，种了种子。</span><span>比如，可能没记住《太上感应篇》里面具体的某一个行为的原句是什么，一旦我们学过，我们懂得这个道理，就是在我们的心里扎了根。当我们遇事情的时候就能想得起来当时学的《太上感应篇》里的一句话，虽没记住，但是那个道理我们懂了，就会时时刻刻地来约束自己的行为。</span></p><p><span>有时间的朋友听完以后，再反复地读几遍，记得更牢固，浸润在我们的内心深处，遇事情的时候，自然就会出来，成为我们的行为准则，然后让我们懂得去修正自己的身、口、意，让自己的内心变得更光明，久而久之天必降福。</span></p></div></div>"
  }
]