[{
    "title": "《孟子》公孙丑上 ①-1 眼界与格局（免费）",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-1眼界与格局</strong></span></p><p><span/></p><p><strong><span>公孙丑问曰：“夫子当路于齐，管仲、晏子之功，可复许乎？”</span></strong></p><p><strong><span>孟子曰：“子诚齐人也，知管仲、晏子而已矣！”</span></strong></p><p><span>第一章讲的是如何为政，都是各个国家的君主君王问孟子，该如何去治理天下、治理国家，所以孟子讲仁政。通过很多细节，通过每件发生的事情，去讲仁政，所以更多的是宏观的，是大的，并没有让我们真正地去了解孟子。</span></p><p><span>而公孙丑章句则不同，公孙丑是孟子的得意门生，孟子是比较喜欢公孙丑的。我们去想为何会喜欢公孙丑这个人呢？我们去学习《论语》的过程当中，也会发现，孔夫子也有很多喜欢的学生，比如说颜回，比如说子贡，比如说子路，为什么会喜欢这些学生？</span></p><p><span>首先这些学生是积极努力向上的；其二，他们的德行品德都很好；其三，他们的思想是有一定的深度的，跟老师之间是有一定的契合度的，所以才会让老师去喜欢这些学生们。当两个有深度的、有契合度的人在一起交流，他所问出来的问题，是更深刻的。</span></p><p><span>接下来，我们要讲到公孙丑问孟子，然后孟子给回答。我们通过公孙丑问孟子的问题，我们可以看到孟子的回答，是更深刻的，他有助于我们去了解孟子的思想、孟子的精神以及孟子的行为。他和君王问话不一样，君王问的更多的是，如何治理国家。</span></p><p><span>而孟子表达的是，自己大的宏观上的想法，该如何去实行仁政？该如何去保民？如何去治理天下？但是孟子回答学生之间，却有自己的喜好，说我喜欢做什么事情，我的价值观是什么样子的，我对于一件事情具体是怎么看待的，我平时的行为是怎么样的。</span></p><p><span>所以我们通过接下来的学习，让我们更加了解一个有血有肉的孟子，我们说去了解一个人，一定要了解他的思想，他的精神以及他平时的行为，这是血和肉。而我们去了解一个人的简介，他的生平，那个只是概括，不足以了解一个人。</span></p><p><span>比如说，我们讲到孟子周游列国二十载，邹国人，有很多弟子，被称为圣人，活到了八十四岁，这都是简介。这些是没有血没有肉的，没有内涵。我们接下来，去看看孟子他平时的思维和他的行为，到底是什么样子的？我们看看他心中的理想是什么样子的？</span></p><p><strong><span>公孙丑问曰：夫子当路于齐。</span></strong><span>得意门生问孟子一个问题，当路指的是当政，并且是掌握政权。公孙丑是齐国人，我们看公孙丑的问题，说：当路于齐，如果老师您来执掌齐国的政权，我们说孟子在齐国是做稷下大夫的，有官职，但是不主政。</span></p><p><span>也就是享受了大夫的俸禄待遇，但是并不具体的参与齐国的政事，也就是没有政权的，并不能实际的为齐国做什么事情，只能是给齐宣王一些建议，一些学识上的交流。所以公孙丑就会有一些好奇，说如果老师您来掌管齐国的朝政，那齐国会变成什么样子呢？</span></p><p><span>这个可能不光是公孙丑的疑问，我们心中可能也会有疑问，因为孟子和孔子还不相同，孔子他是曾经为官的，所以我们可以看到孔子为官的政绩。但是孟子一生并没有实际的做官，他一生都在为学，这个时候我们就要好奇了，如果是孟子来当政来为官，他会用什么样具体的方式或者他会怎么去做呢？</span></p><p><span>我们看接下来的问题，<strong>夫子当路于齐，管仲、晏子之功，可复许乎？</strong>这是公孙丑的问题，如果说老师您掌管了齐国的政权，管仲、晏子之功，可复许乎？我们看管仲和晏子这两个人，都是给齐国建立了功业之人。管仲辅佐齐桓公，称霸于诸侯，成为春秋五霸的第一位霸主。而晏子辅佐齐景公，让齐国以及景公，名扬天下。</span></p><p><span>这样两个人对于齐国的功业和贡献，都是很大的。所以公孙丑就问孟子说，老师您如果坐在那个位置上，可以达到管仲和晏子那样的功业吗？可以让齐国再度兴起，称霸于天下吗？这是公孙丑的问题，我们看孟子是如何回答的？</span></p><p><span>孟子其人讲话，是很有趣味的，他并不会直接回答这个问题，而是举例子，或者讲其他人的事情，来表达自己的想法，这样讲话更有利于回答问题。我们在生活当中，其实也要学会这种交流的方式。当有人问我们一个问题，你直接回答，未必是最好的方式。莫不如举个相同的例子，找一个相同的故事，来表达我们心中的想法，我们接下来学习孟子是如何表达的。</span></p><p><strong><span>孟子曰：子诚齐人也，知管仲、晏子而已矣！</span></strong><span>首先孟子讲了一句话，说你真的是一个齐国人，为什么这么讲？管仲和晏子都是齐国人，说你真的是一个齐国人，你就只知道管仲和晏子，这句话在讲什么？在讲公孙丑的格局和眼界太小了。你应该去放眼天下，看到更多优秀的人，看到更多贤德的人，而不只是看到了管仲和晏子。</span></p><p><span>我们先讲公孙丑的想法，是绝大多数人的想法，我们绝大多数人，只关心自己身边的事情。比如说，公孙丑他是齐国人，他就只关注齐国的那些贤德之人，而如果我们放眼天下，发现有更多贤德之人，可是我们没有看到。</span></p><p><span>我们去想一想，生活当中这个道理，也非常的实用。我们经常说一个人的眼界和格局，什么叫做眼界？如果你只盯着自己身边发生的事情，只关注自己身边的人，这就是没有眼界的表现。</span></p><p><span>我们举个小的例子，来逐步地延伸，比如说在生活当中，我们只关注自己在付出，这个时候你就看不到你的爱人，其实他默默地为家庭付出了很多，你的父母其实为你付出了很多，你的领导和同事以及你的朋友，其实也为你付出了很多，但是说我们的眼界太小了，我们只看到自己每天辛苦地在工作。</span></p><p><span>我们说我很努力的在工作，为了养家糊口付出了很多，可是我们有想过，我们的爱人也在付出很多吗？有想过我们的同事和领导，比我们付出的可能更多，有想过父母可能已经把最好的都给了我们，但是由于我们的眼界，实在是太窄，我们只看到了自己，所以看不到别人的付出。这个时候，我们就会升起很多的抱怨。</span></p><p><span>我们再扩大一点来讲，如果我们只关注到自己的付出，以及我身边这些人在付出，我们依然会生活在抱怨当中，我们会怨天尤人，我们抱怨命运对我们不公。我们这一家人没有做过什么坏事，我每天都在辛苦努力地工作，我也从没有害人之心。</span></p><p><span>可是为什么我当下的生活，还是没有过好？同样是我们的眼界太窄，我们的格局太小了，我们有没有去关注到比我们更优秀的人，他们是如何做事情的？他们在生活当中是如何提升自己的？</span></p><p><span>他们是否比我们做了更多有善行的事情？是否他们努力的方向比我们更正确？所以说我们要学会打开自己的眼界，放大自己的格局，不要总去看自己身边发生的这点事情。</span></p><p><span>我们再来看公孙丑，他比绝大多数人的眼界是大得多的，我们看他看到的是什么？是齐国，是管仲，是晏子之功，他是在想，如果老师的学问和德行是否可以让齐国变得更好，而不是放眼全天下。</span></p><p><span>那我们显而易见，孟子的思维和格局要比公孙丑，又要大上许多，他是放眼天下，来看待这个事情。所以他才会周游列国二十年，他无论走到每一个国家，他是没有国家的局限性的。孟子本是邹国人，但是同样他走到任何一个国家，都是希望你可以利民的，是可以称王天下的，对全天下的百姓都要更好。</span></p><p><span>所以我们看真正一个越有仁德的人，他是放眼天下的，而不只是自己身边的事情，自己小家的事情，也不只是齐国或者邹国的事情。所以我们回头，再来看这句话，孟子说你真是一个齐国人，你就只知道管仲和晏子而已矣，而不知道还有更多的人，还可以放眼天下。</span></p><p><span>我们从这段对话当中学习到，我们在生活当中，要把自己的眼界打开，要把自己的格局放大，这个时候心大了，我们身边的事情自然就变小。</span></p><p><span>我们举个例子，在家里照顾孩子、相夫教子的人，通常容易多烦恼，为什么呢？就是我们的眼界，只关注了当下家里所发生的琐事。如果这个时候，我们在家里懂得把眼界不断地放大，我们去关注到更多的人，我们去关注到我们的爱人，他为了这个家庭的生活，在辛苦地打拼。我们去看这个社会上，还有那么多的好人好事，还有那么多的人，想在为社会贡献着价值。</span></p><p><span>这个时候我们发现，家里这些琐事就不会障碍到我们，就不会让你产生那么多的烦恼，所以这就是眼界。我们来总结什么叫做眼界？我们往外看的有多远，从自身开始出发，往外面看得越远，也就是你的眼界就更宽，这个时候，我们的烦恼就会变得更少。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-2 孟子不愿与管仲比",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-2 孟子不愿与管仲比</strong></span></p><p><span><strong>或问乎曾西曰：‘吾子与子路孰贤？’曾西蹵然曰：‘吾先子之所畏也。’曰：‘然则吾子与管仲孰贤？’曾西艴然不悦，曰：‘尔何曾比予于管仲！管仲得君，如彼其专也；行乎国政，如彼其久也；功烈，如彼其卑也！尔何曾比予于是！’曰：“管仲、曾西之所不为也，而子为我愿之乎？</strong></span></p><p><span>孟子要回答公孙丑的问题了，但是孟子并不会直接回答，而是又举了一个曾经发生的事情，这件事情发生在曾西的身上。我们要注意，这里的曾西是曾申，字子西，是曾子的儿子。曾子的父亲叫曾晳。我们看曾经发生在曾子的儿子身上什么事情呢？</span></p><p><span><strong>或问乎曾西曰：吾子与子路孰贤？</strong>有人曾经问了曾西一个问题，吾子是尊称，您的意思，也就是问曾西，您与子路孰贤？这个问题值得注意了。曾西是曾子之子，那么曾子又是孔夫子的弟子，子路也是孔子的弟子，也就是子路与曾西的父亲都是孔子的弟子。差着辈分呢，我们看曾西是如何回答的？</span></p><p><span><strong>曾西蹵然曰：吾先子之所畏也。</strong>蹵有两个意思，一个意思是不安，非常局促不安的样子，另外一个意思是不悦。这个时候曾西又不安，又不悦，故而蹵然曰：“吾先子之所畏也”。先子指的是先父，也就是曾子。子路是我父亲敬畏的人，这个时候他是很不开心的，并且很不安。</span></p><p><span>怎么能问出这样的问题？你去问我一个我父亲都很敬畏的人，问我与他谁更优秀？这不是难为人吗？没有办法去回答，所以就蹵然讲了这样一句话，他是我父亲敬重和所敬畏之人，我怎么可能去比较，既然和子路不能去比较，那么就比较一个其他人。</span></p><p><span><strong>曰：然则吾子与管仲孰贤？</strong>我们看这个问题如此的熟悉，正是公孙丑问孟子的问题，那您与管仲谁更贤德，谁更好一点？</span></p><p><span><strong>曾西艴然不悦，曰：尔何曾比予于管仲！</strong>艴，愤怒。曾西不但不高兴而且很愤怒，脸色一沉，讲到你怎么能拿我和管仲相比？言下之意是很不高兴的，认为没有可比性，为何要这样讲？</span></p><p><span><strong>管仲得君，如彼其专也；行乎国政，如彼其久也。</strong>说管仲得到齐桓公的信任，是多么的专一。他去掌管国政，是那么长的时间。我们首先看这两点，齐桓公是非常信任管仲的，无论大小事宜，都可以交给管仲去处理。并且不计较管仲的一箭之仇，管仲曾经是拿弓箭射过公子小白的，也就是齐桓公未做君主之前。</span></p><p><span>但是齐桓公并不计较，让管仲去做国相，掌管齐国的朝政。我们可以知道齐桓公对于管仲的这种信任程度，并且管仲一生都在掌管着齐国的政权，所以首先曾西说齐桓公信任管仲，那么专一，管仲掌管齐国政权，又那么长的时间。</span></p><p><span>这是非常重要的两点，我们之前讲过一位贤相，是要有一位明君，绝对信任他的君主，否则一个人即使再有才能，也没有发挥的机会。我们用到现在也是如此，即使一个再有才能的员工，如果老板不能全心全意地去信任他，不能给他足够的时间，也没有办法发挥自己身上的才能，所以是彼此成就的关系。</span></p><p><span>有明君才会有贤相，我们看曾西说：管仲得到了齐桓公的绝对信任，并且长时间地掌管齐国的朝政，接下来那个结果是什么样子的呢？</span></p><p><span><strong>功烈，如彼其卑也！</strong>功烈指的是功勋业绩，卑指的是卑小，也就是少的意思。曾西讲：管仲得到了齐桓公的信任，并且那么长的时间，而做到的功勋业绩却那么卑微，那么小。言下之意，曾西是不愿意跟管仲去相比的，因为他认为管仲所做的事情，微不足道。</span></p><p><span>我们这里不禁要有疑问了，管仲是很伟大之人，他帮助了齐桓公称霸天下，九合诸侯，并且把齐国治理得很好，怎么能说他的功业很卑微呢？</span></p><p><span>我们在《论语》当中讲过，孔子对于管仲的看法有赞美，同时也有批评。赞美的地方，说管仲大仁大义，如果没有管仲，我们现在可能已经沦为夷狄，已经没有了文化，所以说他是大仁大义的，并且他辅佐齐桓公称霸天下，不动刀兵。但是也说过管仲不知礼，不知俭，对于君主没有礼节，并且平时的生活作风，也不够节俭。</span></p><p><span>我们再来看这里的曾西，他认为管仲所做的功业是很卑小的，所以不愿意拿自己与他相比。我们这里要讲一个话题了，为什么儒家之人，并不认同管仲的做法呢？这里面是有原因的，在那个时候治理国家，通常有两条策略，第一称之为霸道，第二称之为王道。</span></p><p><span>管仲辅佐齐桓公称霸天下，用的是霸道，什么叫做霸道？也就是以武力征服天下，我让我自己的武力变得更强。我掌握绝对的话语权，代天子发号施令，这就叫霸道。但是王道所走的路，是截然不同的。我们比如说文王，比如说商汤，这些人走的是王道，再比如说尧、舜、禹。</span></p><p><span>何为王道？就一个出发点，一切以百姓的利益为先，一切都是为了百姓着想。用《大学》的话叫做亲民，也叫如保赤子，不停地去帮助百姓，从百姓安居乐业的角度去出发，去实行王道，而天下百姓自来归服。</span></p><p><span>我们看无论是齐宣王还是梁惠王，问到孟子该如何治理国家？孟子一直讲的都是王道，也就是施仁政，不要靠自己武力的强大，去征服天下，而是要对百姓更好，让百姓生活得更幸福，其他地方的百姓，自然愿意来你这里生活，这就是王道。</span></p><p><span>从曾西的角度看来，也是一样的，管仲走的是霸道，不值一提，而儒家推行的是王道，不要想着去称雄天下，也不要去用武力去压服，或者压制别人，而是不停地对百姓做得更好，去想着发展齐国的经济，发展齐国的军事，出发点和王道都是不相同的。</span></p><p><span>王道的出发点，一切都是利民的，利益他人的，而国家自然变得强大。所以从最本质上的出发点，就不相同，故而曾西不愿意拿自己和管仲去比较。</span></p><p><span><strong>尔何曾比予于是！曰：管仲、曾西之所不为也，而子为我愿之乎？</strong>又重复了一句加强语气，你怎么能拿我和他相比呢？接下来孟子作了总结，说曾西是不愿意做管仲所为的事情，而你以为我就愿意那样去做吗？</span></p><p><span>孟子表达了自己的想法，他引用了曾西过去所发生的一件事情，告诉公孙丑，我和曾西的想法是一样的，你以为我愿意和管仲相比吗？我是完全不愿意的。因为我们主张的是王道，实行的是仁政，而管仲治理天下，主张是用霸道，用武力掌握绝对的话语权。</span></p><p><span>正所谓道不同不相为谋，没有谁对谁错，或者谁的更好，谁的不好，只是我们整个的主张并不相同。像我们现在也是如此，我们不是说别人的想法不够好，或者只有我们的想法才是正确的，只不过我们的主张不一样。</span></p><p><span>有的人说，我把我的产品做得更优质，我用我的产品去服务顾客，我赚取更多的利润，没有错误。但是学习儒家文化的人，我没有想去赚取更多的利润，而是想我如何去帮助更多的人，以帮助别人为目的，去调整自己做事情的方向，如此我那个利润是自己来到，而我不需要去强求。所以是完全两个思维，我们不讲对错，只是讲各不相同，而孟子主张的是王道，所以并不愿意与管仲相比。</span></p><p><br/></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-3 久则难变",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-3 久则难变</strong></span></p><p><span><strong>曰：“管仲以其君霸，晏子以其君显。管仲、晏子，犹不足为与？”曰：“以齐王，由反手也。”曰：“若是则弟子之惑滋甚。且以文王之德，百年而后崩，犹未洽与天下；武王、周公继之，然后大行。今言王若易然，则文王不足法与？曰：“文王何可当也，由汤至于武丁，贤圣之君六七作，天下归殷久矣，久则难变也。”</strong></span></p><p><span>我们来回顾上一讲，孟子与公孙丑之间的对话，公孙丑问孟子一个问题，如果由老师您来当政，是否可以恢复到管仲和晏子那个时候的功业？公孙丑问这句话有两种感情在其中，第一是爱国之情，因为公孙丑是齐国人，所以他希望齐国变得更加兴盛，可以兴盛到齐桓公那个时候，称霸于诸侯，可以像齐景公那个时候，齐国是名扬天下的。</span></p><p><span>第二种感情叫师生之情，他希望自己的老师可以在齐国当政，可以把齐国的功业恢复到以前的那种情况。故而问了孟子这样的问题，但是没有想到老师却不屑于与管仲，相提并论，并且引用了曾西身上发生的事情来作对比，并不愿意跟管仲、晏子相比较，因为管仲走的是霸道，而孟子儒家文化提倡的是王道。</span></p><p><span>如何对百姓更好，爱民如子而称王天下？这里涉及到两个角度的问题。首先公孙丑的角度是，自下而上地去看待，比如说我作为一个齐国人，我希望我的国家变得更兴盛。比如说我觉得管仲和晏子的功业做得很多，这是自下而上，他是仰视着看。但是孟子则不同，他是自上而下的，去看待这个问题。</span></p><p><span>他通过学习儒家文化，通过从孔夫子那里学习的王道仁政，他学习的是尧、舜、禹、汤、文王、武王、周公这些人的德行，所以他站在王道的角度往下看，他是不屑于去做这样的事情的。</span></p><p><span>因为两个人的角度，看到的观点并不相同，在孟子和曾西的眼中，管仲和晏子做得事情是微不足道的，并不足够好。但是公孙丑觉得他们已经很伟大，做得事情已经很好，故而他依然是不解。</span></p><p><span>所以接下来继续的问道：<strong>曰：管仲以其君霸，晏子以其君显。</strong>说管仲辅佐齐桓公，让他称霸于诸侯，而晏子辅佐齐景公，可以让景公名扬天下，声名远扬。</span></p><p><span><strong>管仲、晏子，犹不足为与？</strong>难道管仲和晏子还不值得学习吗？为何值得学习呢？在公孙丑的眼中很简单，因为管仲辅佐齐桓公，所以可以称霸于诸侯，因为晏子辅佐了齐景公，所以可以让君显，也就是声名远扬。说这样的人难道不值得我们去学习吗？如果这样的人都不值得我们去学习，我们到底该学习什么呢？</span></p><p><span><strong>曰：以齐王，由反手也。</strong>孟子讲到，如果以齐国的能力，以齐国国土的大小，以齐国的兴盛，要想称王于天下，易如反掌，就像这个手掌，我们把他反过来，如此简单。</span></p><p><span><strong>曰：若是则弟子之惑滋甚。</strong>这个时候公孙丑讲了，老师如果照您这样说，弟子我心中的疑惑就更甚了，怎么可能称王天下，是易如反掌的事情？</span></p><p><span><strong>且以文王之德，百年而后崩，犹未洽与天下。</strong>这就是公孙丑的困惑了，如果老师您认为齐国称王天下，是易如反掌的事情，我想问的是以周文王那么大的德行，百年而后崩，文王活了那么久，也没有完全让天下臣服。</span></p><p><span>历史有记载，文王是活到九十多岁的，未洽于天下，这里的洽是周遍，遍布的意思。也就是文王那么大的德行，治理国家那么久，也没有遍布天下，让天下的百姓去臣服。所以公孙丑心中的困惑是很深的，怎么齐国想要称王天下，就易如反掌，以文王那么大的德行，经营了那么久，还不能称王于天下？</span></p><p><span><strong>武王、周公继之，然后大行。</strong>说文王在世之时，并没有周遍天下，并没有称王天下，而是武王和周公继承了文王的德行和遗志，然后大行。这个时候才大行于天下的，这里公孙丑在讲文王以及武王，以及周公，况且还不止这些。</span></p><p><span>我们经常讲到太王，也就是从文王的祖父开始，已经都是贤明之君，都是大德之人。需要历数这么多代贤君，才可以成王天下。</span></p><p><span><strong>今言王若易然，则文王不足法与？</strong>今天我们讲，称王天下如此的简单，难道文王也不值得我们学习和效法吗？</span></p><p><span>我们再来回顾这段话，公孙丑的疑惑，公孙丑认为管仲和晏子功业是很大的，是值得学习的，但是孟子觉得管仲和晏子并不值得效法，自己也不屑于与他们去相比较。因为孟子认为以齐国当下的情况，要想称王，走王道、施仁政，是易如反掌的事情。</span></p><p><span>这个时候公孙丑的困惑，就变得更深了，如果说称王天下这么简单，我觉得这个道理不正确，因为以文王的德行，在他在世之时，都没有称王天下。而是武王、周公继之，然后大行。可是今天老师您却认为称王天下，如此简单，那难道说周文王的德行和周文王称王天下的方法，也不值得我们去学习和效法了吗？</span></p><p><span>接下来整个这一段，都是孟子回答公孙丑的疑惑。首先讲了一句话：<strong>文王何可当也。</strong>怎么能和文王相提并论呢？没有办法与文王去相比较的。接下来孟子要开始讲，为什么文王在世之时，并没有称王于天下。</span></p><p><span><strong>由汤至于武丁，贤圣之君六七作。</strong>孟子从商汤开始讲起，商朝的开国之君，由汤到武丁中间出现了六七位贤德之君。</span></p><p><span><strong>天下归殷久矣，久则难变也。</strong>因为从商汤到武丁，出现了六七位贤德之君，所以天下归殷久矣，天下的百姓是诚心归服于商朝的。久则难变也，因为归服的时间久，所以他是很难改变，很难被推翻的。因为从商汤到武丁之间，这几位贤君都是为百姓去着想的，所以江山很稳固，百姓安居乐业，所以久则难变也。</span></p><p><span>那我们这里要来延伸讲讲，久则难变也，这个观点在我们生活当中极其重要。比如说一个人的习惯，长久了以后是很难改变的。我们举例子，即使一个人到国外生活多年，依然会用自己小的时候，或者说过去吃的食物习惯和方式去生活。</span></p><p><span>再比如说，一个人的乡音难改，无论你去外地多长时间，多久，你乡音一直都是在的，这就是久则难变也。我们再举个例子，比如说两个人在一起相处久了之后，就形成了习惯，这个人突然有一天离开你的身边，你更多的是不适应，不舍，也就是没有办法习惯。</span></p><p><span>再比如说，生活当中我们也是一样的，当你的行为产生了一个习惯以后，时间越久，越难以改变；比如说，我们写字的握笔方式，即使他不是正确的，但是我们长久以来，都是这样的习惯，即使有人告诉我们，正确的拿笔的方式，我们也很难去改变。</span></p><p><span>再比如说，我们一个人，如果遇事总是喜欢发脾气，总是喜欢抱怨，这也是一种习惯。所以每当遇事情之时，我们都是抱怨的，都是发脾气的，都是以暴力的方式去解决，这就是习惯。所以我们明白这个道理以后，要想改变自己当下的习惯，是需要下大的决心才可以的，一方面是决心，另一方面就是足够的时间，才可以去改变。</span></p><p><span>我们再比如说，一个人总有拖延的习惯，注意这是习惯，因为长久以来形成这样的习惯，故而很难改变。如果我们想改变拖延的习惯，需要有巨大的决心，再加上时间，才会让我们的习惯加以改变。所以这里我们要明白一个道理，我们人是被习惯所支配的，被习惯所掌控的。</span></p><p><span>很多时候，明明不愿意这样去做事情，但是莫名其妙的，就被我们的习惯支配着，又变成了这个样子。所以我们要让好的习惯，去支配我们的生活，不要养成一些坏的习惯，从良好的习惯开始，否则时间越久就越难改变。</span></p><p><span>这是我们用来修正自己，如果我们反过来去观察别人也是一样的，我们通过别人的思维方式，通过别人的讲话，通过别人的行为，我们也可以看到对方的习惯。如果这个习惯我们是可以善加利用的，他就会向好的方向去发展，如果我们懂得去帮助和改变他人，就要懂得从他人的习惯开始下手。</span></p><p><span>我们举个例子，比如说我们的孩子，我们想让他将来变成什么样的人？那么从小我们就要让他养成什么样的习惯。举个例子，我们想让孩子心目中有别人，在生活当中遇到事情的时候，我们就要经常的去教导他，去引导他，去陪伴他，让他懂得为别人着想，久而久之他就会形成习惯，那么长大以后，他就会懂得为别人着想。</span></p><p><span>再举个例子，我们将来想让这个孩子变成一个有礼貌的人，我们从小就要去引导他，懂得与人打招呼，然后做事情懂得守规矩，长大以后他自然就变成了这个样子。所以无论是对我们自己也好，或者我们是教孩子也好，教我们的学生也好，都要养成良好的习惯。</span></p><p><span>养成良好的习惯，就会成为一种自然，而时间越久越不会被改变，就形成了惯性。我们再回到文中，是因为从商汤到武丁，有六七位贤君，所以天下百姓是诚心归服的，而归服的时间越久，就越难被改变，想推翻商朝，是很困难的事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-4 贤人相辅",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-4 贤人相辅</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。纣之去武丁未久也，其故家遗俗，流风善政，犹有存者；又有微子、微仲、王子比干、箕子、胶鬲，皆贤人也，相与辅相之；故久而后失之也。尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。</strong>武丁让诸侯来朝见，拥有整个天下，犹如在掌上转动东西一样，就是如此简单，为什么如此简单？因为从商汤到武丁，打下了深厚的基础，并且武丁亦是一位贤君，在武丁这个时期，是被称为武丁盛世的。他自己又是一位贤君，并且从商汤以来一直积累德行，施行为天下百姓着想的仁政。所以到武丁这个时期，掌管天下，就像在掌中运东西一样，如此简单。</span></p><p><span>这里为什么要提到武丁呢？首先因为武丁这个时期是盛世，并且到了武丁这个时候是殷商；</span><span>最后一位贤德之君，从武丁开始一直到商纣王，纣王以后商朝就灭亡了。这个期间又经历了大约一百二十年，我们去看这个时间段，从商汤到武丁，经历了六七位贤君，所以天下是稳固的，治理天下易如反掌。</span></p><p><span>但是从武丁开始到商纣王，殷商灭亡又经历了大约一百二十年的时间，也就是从武丁之后，一代一代商朝的君王，开始失去了德行，开始不施仁政，所以到商纣王那个时候会灭亡。我们就看到了一件事物的规律，他不是一下兴盛，亦不是一下衰亡，他是有个循序渐进的过程。</span></p><p><span>比如说，一个企业经营得很好，不是一年两年的努力，是长时间的努力，逐渐地达到了顶峰。一个企业开始变得衰退，到没落，最后到灭亡，也不是一朝一夕的，是从顶峰一代不如一代，一件事情不如一件事情，最后到灭亡。</span></p><p><span>我们说两个人的感情，也是如此，他从一开始的平淡，不停地升温，最后感情很深厚很稳固。如果随着一些事情的发生，或者时间的推移，两个人经历的事情，越来越不和谐，最后可能导致两个人的感情破裂，所以我们明白这个事物的规律，是让我们懂得及时觉察的智慧和能力。</span></p><p><span>我们要学会在一件事情没有呈现结果之前，及时地觉察到问题出在了哪里。我们再比如说孩子，很多家长会讲，说孩子突然变得叛逆了，其实并不突然，他从不叛逆到叛逆中间，是有一个时间线的，只是我们没有及时地察觉到，没有及时地发现问题，当结果呈现出来的时候，</span></p><p><span>已经晚了。</span></p><p><span>还有人说，我的爱人怎么突然开始不爱我了，他突然开始对我不好了，其实并不是，中间也是有一个过程，是有一个时间线的，只不过我们没有及时地去觉察到，去看到问题。这个时间线的长短，根据事情的大小有所不同。</span></p><p><span>比如说，一个朝代，他可能这个时间线是一百年，是两百年。对于我们企业来讲，可能是三年五年，十年乃至于二十年。对我们的家庭来讲，可能是一年，两年，三年。一些更小的事情，可能是一个月，两个月，三个月，甚至是一天，两天，三天。所以无论任何一件事情。都是有时间线的，都是有过程的，都是有迹可循的，我们要从中去看到规律和痕迹。</span></p><p><span><strong>纣之去武丁未久也，其故家遗俗，流风善政，犹有存者。</strong>这里讲到了纣离武丁，时间并不太久远，一百多年的时间，但是在这一百多年的时间，其故家遗俗，流风善政，犹有存者。故家是指过去的，世代相传的，那些好的遗俗还在。流风善政，过去从商汤到武丁，那些为政的，那些善良的，那些为民请命的，还留下来了，所以叫犹有存者。</span></p><p><span>故而到商纣王时期，虽然已经无道，但是还有很多百姓，并不愿意离开商朝，也并不愿意推翻商朝，并且最重要的还给商纣王，遗留下来很多好的东西。比如说仁政，比如说国家的基础，再比如说，更重要的是贤德之人还有很多。</span></p><p><span><strong>又有微子、微仲。</strong>微子和微仲都是商纣王的兄长，商纣王是第三子，但是为何商纣王可以继承了君位？因为微子和微仲的母亲，在生微子和微仲之时，还不是王后的身份，但是在生商纣王之时已经变成了王后，所以这个时候纣王就变成了嫡子。以前是立嫡子为君的，故而商纣王就做了君主，但是微子和微仲是两位贤德之人，一起辅佐商纣王。</span></p><p><span><strong>王子比干、箕子、胶鬲，皆贤人也，相与辅相之，故久而后失之也。</strong>并且还有王子比干和箕子，王子比干和箕子是纣王的叔父，胶鬲是贤臣，臣下的身份。以上所讲的这些都是贤者，因为有这些贤者在，故而想要推翻商纣王，并没有那么容易。因为有这些贤人去辅佐纣王，故而久后失之也，所以要很长的时间，才会失去商朝，才会灭亡。</span></p><p><span><strong>尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong>没有一寸土地不是归纣王所有，没有一个百姓不是他的臣子，然而文王只有方圆百里之地起家，是以难也。</span></p><p><span>我们整个再来看，这一段孟子的回答，回答了公孙丑。为什么以文王的德行，在世之时没有称王于天下呢？并不是文王的德行不足够，我们怎么敢和文王去比德行呢？是因为从商汤到武丁，有六七代贤君，所以天下归商久矣，久则难变。</span></p><p><span>这个是很难改变的，况且从武丁到商纣王的时间并不久，一百多年的时间。所以以前的一些好的仁政，还有一些遗俗，并且还有一些贤人，共同留下来辅佐纣王，而文王只是从方圆百里的地方起家。</span></p><p><span>那个时候没有一寸土地，不是纣王的，没有一个臣下不是纣王的，所以文王的起家才如此艰难。并不是文王的德行不够大，而是商朝的根基过于深厚，所以文王在世之时，并没有能称王天下，而需要武王和周公继之。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-5 乘势而为",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上①-5 乘势而为</span></strong></p><p><strong><span>齐人有言曰：‘虽有智慧，不如乘势；虽有镃基，不如待时。’今时则易然也，夏后、殷、周之盛，地未有过千里者也，而齐有其地矣；鸡鸣狗吠相闻，而达乎四境，而齐有其民矣，地不改辟矣，民不改聚矣；行仁政而王，莫之能御也。</span></strong></p><p><strong><span>齐人有言曰：虽有智慧，不如乘势；虽有镃基，不如待时。</span></strong><span>我们再来回顾，孟子与公孙之间的对话，公孙丑问孟子如果您来执掌齐国的国政，可以再现管仲和晏子的霸业吗？孟子是不屑于和管仲、晏子相比较的，正是因为管仲和晏子兴的是霸业，而孟子想要推行的是王道。</span></p><p><span>接下来公孙丑就有了疑问，如果实行王道，时间会不会太久？即使以文王的德行，也要武王和周公之才，可以实行王道，他不是一代人可以实现的。接下来孟子又说，不是这样的道理，因为文王那个时期，他从很小的地方开始起家，虽然经历了很多艰难，但是最后不也称王于天下了吗？</span></p><p><span>为什么文王那个时候很难，是因为从商汤到武丁打下的基础很深厚，而从武丁到商纣王仅有一百多年的时间，所以还留下了很多贤臣，还留下了很多仁政，留下了很多故家遗风，所以他是很难的。</span></p><p><span>但今天的情形不同，今天的齐国有广阔的土地，有众多的百姓，并且是万乘之国，而且很久都已经没有出现仁君，去推行仁政，现在是最合适的时机。如果这个时候，实行仁政等于乘势而为，做事情是易如反掌的，想要称王于天下，是非常简单的事情。</span></p><p><span>所以这里孟子在讲齐国的现状之前，讲了一句齐国的谚语：虽有智慧，不如乘势；虽有镃基，不如待时。我们看乘势，何为乘呢？举个例子，我们说乘车，也就是我们自己不用动，车子在动，就可以带我们去想要去的地方；比如说我们乘飞机，我们可以不动，但是飞机它在动，就可以带我们去那个地方，这称之为乘。</span></p><p><span>我们接下来再看，什么叫做势呢？我们经常讲一个成语，叫大势所趋，就是众多人推动着一件事情，众多需求下推动的一件事情，它是自然发展的；我们乘着别人的需求，就可以到达那个地方。</span></p><p><span>比如说孟子讲的，今天齐国如果实行仁政，称王天下，是易如反掌的事情。因为百姓生活在水深火热之中，已经太久了，连年战乱，这个时候的百姓是需要安居乐业的生活，如果这个时候实行王政，这就叫大势所趋。</span></p><p><span>我们再来讲一讲，势的几个特点，首先势是变化的，一直在动；我们举个例子，我们见过海浪，上一秒它可能离我们还很远，那下一秒它就来到了我们的眼前，再下一秒它可能离我们又很远，这就叫势，所以势它是波动的，是变化的。</span></p><p><span>我们再讲，势还有什么特点呢？比如说杯子从桌子上落下来，我们可以把它接得住，这个杯子落下的过程就叫势，但是因为它的势比较小，所以我们可以接得住；但是如果落下来的这个东西比较大，我们用手是没有办法接住的，也就是落下的东西越大，势力也就会越大，这种力量是不可被阻挡的。</span></p><p><span>我们再去看，文王武王之所以可以创建周朝，就是因为势头不可挡，叫势不可挡。比如说，商纣王如果不是荒淫无道，如果百姓不是生活在水深火热之中，文王、武王即使再有德行，也难以得到天下。这是因为所有的百姓生活的并不好，他们是不想生活在商纣王的统治之下，人们是有需求的，这就是大势所趋。</span></p><p><span>因为百姓有太多的怨言，这个时候如果有人是兴仁政的，是有德行的，百姓看得到，自然拥护。文王和武王故而可以得天下，也就是势越大，越不可阻挡。我们知道势的第二个特点，不可被阻挡，不可被改变，它不是以个人的意志或者能力可以转变的。</span></p><p><span>我们再讲势还有什么特点呢？它是积少成多的，最后就成为了势。本来他可能很少，但是需求的人越来越多，或者聚集的东西越来越多，就形成了大势。</span></p><p><span>我们举个例子，比如说过去这些年，房地产行业的兴起，为什么房子会越卖越贵？因为人们生活条件好了以后，都想改善生活，想要买房子的人变得越来越多，所以房价就会不停地上涨，这就叫大势。它不以个人的意志为转移，不是有个别人抗议，觉得房子贵，就可以让房价停下来，因为有太多的人需求，积少成多在推动着这件事情。</span></p><p><span>什么时候房价会落下来呢？需求的人越来越少，大家不再购买房子，它自然就落下来了，这就叫势。所以我们看势它就像一个抛物线一样，最开始处低位，逐渐地上升到高位，到最高的时候再开始下降。</span></p><p><span>我们再比如说，这些年互联网的兴起，是不是一样的道理？以前人们都喜欢在实体店，喜欢逛街，以这种形式去购物，但是随着这种形式长久时间的不变化，人们已经开始没有新鲜感，这个时候开始出现了网络，一开始人们是不接受的，但是随着人们更多地开始追寻一些新鲜事物，逐渐地需要的人变得越来越多，再积少成多的过程，就形成了势。</span></p><p><span>我们这个时候再来回顾，势的几个特点，首先它是变化的，它是一直在动的；其二，这种势越大，这种力量就不可阻挡，无法被改变；其三，它是积少成多的过程。</span></p><p><span>孟子在这里之所以引用这句谚语，就是讲齐国现在正在势头上，如果懂得乘势而行，顺势而为，实行王政去推行仁道，这个时候称王天下是易如反掌的事情。</span></p><p><span>我们在生活当中，如何才能乘势而起呢？我们放到最后，看看孟子是如何讲的？虽有镃基不如待时，镃基指的是锄具，也就是农民耕种所用的锄头，虽有锄具不如待时，你不如待时而动。什么意思？即使你有好的锄具，如果不到耕种的季节，也是没有作用的。也就是齐国即使再强大，但是你不能等到好的时机也没用。</span></p><p><span>比如说，文王即使有德行，如果不是因为商纣王暴虐无道，这个时候你也没有办法得到天下，这就叫时机。所以我们要知道做任何一件事情，都要等待合适的时机，而齐国现在有势，并且正处在合适的时机，只不过看是否能抓住这个时机。</span></p><p><span>我们再讲生活当中很多事情都一样，我们要懂得乘势而为，要懂得抓住恰当的时机去做事情。</span></p><p><strong><span>今时则易然也。</span></strong><span>今天齐国正处在合适的时机上，为什么孟子说现在的齐国处在合适的时机上，我们看孟子接下来是如何讲的？</span></p><p><strong><span>夏后、殷、周之盛，</span></strong><strong><span>地未有过千里者也。</span></strong><span>夏、商、周之盛，在他最兴盛的时候，地也没有超过方圆千里。</span></p><p><strong><span>而齐有其地矣。</span></strong><span>说今天齐国所拥有的土地，方圆千里，即使过去夏商周在最鼎盛的时期，也没有今天齐国的土地这样辽阔。</span></p><p><strong><span>鸡鸣狗吠相闻，而达乎四境。</span></strong><span>鸡鸣狗吠相闻，它形容的是百姓密集的程度，鸡叫和狗叫可以互相听闻，也就是邻居会比较多，并且达乎四境。不是只有某个地方，人员密集到这种程度，可以到齐国四周的边境，我们可以想象这样一个画面，百姓是很多的。</span></p><p><strong><span>而齐有其民矣，地不改辟矣，民不改聚矣。</span></strong><span>说齐国现在已经有这么多的百姓了，今天齐国不需要再去扩展土地，不需要去增加更多的百姓；因为齐国现在有方圆千里的土地，并且百姓生活的密集程度，已经很多了。所以今天齐国不应该再去扩展土地，也不要去想着如何增加民众，只需要把现有的这些百姓，让他们生活得更好，就足以称王于天下。</span></p><p><strong><span>行仁政而王，莫之能御也。</span></strong><span>如果这个时候齐国实行仁政，是没有办法阻挡的。我们再来回顾这一段，孟子讲齐国想要称王天下，易如反掌，为什么？首先齐国的土地足够大，百姓足够多，即使夏、商、周在最兴盛之时，也没有这么多的人，也没有如此辽阔的土地。</span></p><p><span>这个时候的齐国，不需要想着再向外扩张，不需要称霸于诸侯之间，只需要去兴王政，可以让百姓安居乐业，让百姓过上更好的生活。而其他的国家还在战乱之中，那百姓自然想要来齐国生活，怎么还需要招集更多的百姓，怎么还需要扩展土地呢？</span></p><p><span>如果这个时候，齐国去实行王道，兴仁政，是不可被阻挡的，这就是大势所趋。不会以人的意志为转移，没有办法阻挡这种势。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ①-6 事半功倍",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上①-6 事半功倍</span></strong></p><p><strong><span>且王者之不作，未有疏于此时者也；民之憔悴于虐政，未有甚于此时者也。饥者易为食，渴者易为饮。孔子曰：‘德之流行，速于置邮而传命。’当今之时，万乘之国行仁政，民之悦之，犹解倒悬也。故事半古之人，功必倍之，惟此时为然。</span></strong></p><p><strong><span>且王者之不作，未有疏于此时者也。</span></strong><span>王者之不作，指的是没有仁君出现；未有疏于此时者也，没有等待这么久的了，也就是从周朝之后一直到战国期间，这几百年并没有王者出现。我们再去看武王那个时期，从商汤到武丁，六七位皆是贤君，都是仁德的君主。</span></p><p><span>从武丁到商纣王，经历了一百多年，所以这个时候文王和武王的出现，仁德之君替代了商朝，建立了周朝，中间只有一百多年的时间。所以文王得天下，才会比较艰难，但是今天齐国的现状不同，又有辽阔的土地，又有众多的百姓，而且还有这么久都没有出现仁德之君，百姓自然是渴望的。</span></p><p><strong><span>民之憔悴于虐政，未有甚于此时者也。</span></strong><span>百姓生活在这种虐政的压迫之下，没有比这个时候更甚的了。</span></p><p><strong><span>饥者易为食，渴者易为饮。</span></strong><span>饥饿的人是很容易满足的，你给他什么样的东西，他不会挑剔；渴了很久的人，你给他什么样的喝的都可以，是非常容易满足的。这两句话就是在形容现在天下的百姓，他们已经挨饿饥渴很久了，所以他们渴望有仁君的出现。</span></p><p><span>这两句话我们往生活当中，延伸一下，我们经常讲一个词语，叫饥不择食，当我们在饥饿之时，吃食物是不挑剔的。举个例子，如果我们的孩子从小缺乏关爱，从这方面来讲，就是饥饿的，那就会饥不择食，长大了以后，只要别人给他一点关心，他就容易深陷其中，进而上当受骗，所以我们可以看到身边很多的人，从小因为缺乏很多关爱，长大了以后，就容易被骗，他容易走错路。</span></p><p><span>同样我们再反过来讲，如果一个孩子在一个溺爱的家庭当中长大，那么在将来的工作和生活当中，他就接受不了挫折，但凡有一点挫折，他就难以接受，他会产生对抗，甚至产生自卑的心理，那也就是我们不能让一个孩子过饥或者过饱。你给他没有关爱，没有关怀，这是不行的，他会内心匮乏，可是如果你给他太多的溺爱，将来他又没有办法，承受挫折。</span></p><p><span>所以我们要懂得取中，莫偏于一端。那不光对孩子如此，我们在生活当中和其他人的交往，也是一样的，我们不能对一个人过于好，过于好的时候，就会变成溺爱，变成偏爱；但是我们也不能对一个人，漠不关心，这个时候，他从这方面是匮乏的，就会饥不择食。</span></p><p><span>为什么现在很多感情，容易出问题？就是我们给对方的关心关爱，在乎的太少了，这个时候他会从另外一个地方，来寻求被关注，寻求被关心。所以我们的感情，就容易出现缝隙。</span></p><p><span>我们从这句话再来延伸，我们对自己也是一样的，我们不能对自己太过于好，我们会变得很矫情；我们也不能对自己太不好，我们会容易生活在自卑和自我否定当中，我们体会不到生活当中的美好和快乐，故而我们要取中。</span></p><p><span>不能对自己，不加关心，同时也不能对自己，过于放纵。我们去取合适的点，包括我们去做事情、学习或者我们去做事业，都是一样的，我们不能太过于用力，当我们太过于用力的时候，容易放弃，因为我们体会不到幸福。但是我们也不能太过于松散，如果我们太过于松散，我们就不懂得时时刻刻，保持进步。同样还是折中，不能让我们自己，饥不择食，同时也不能让我们自己，过于饱、过度，这都是不正确的。</span></p><p><strong><span>孔子曰：德之流行，速于置邮而传命。</span></strong><span>置是设置；邮是驿站。引用了孔夫子的话，德政流行的速度，要超过于设置驿站，去传播政令，以前驿站是最快速的，可以传达政令的方法，而德政的流行，要比驿站的传播速度更快。</span></p><p><strong><span>当今之时，万乘之国行仁政，民之悦之，犹解倒悬也。</span></strong><span>说现在这个时候，万乘之国去实行仁政，百姓是非常高兴的，就像解救倒挂着的人，我们可以想象得到，一个倒挂着的人，他是何其得痛苦难受。</span></p><p><span>这句话同样是来形容，现在天下的百姓，他们生活在倒悬之中，每天过着担惊受怕的日子，并且食不能饱腹，衣不能保暖，每天都要承受着战乱之苦，并且丧事也没有人去办理，家庭也没有办法很好的去生活。如果这个时候，有一个万乘之国去推行仁政，百姓一定闻风而来。</span></p><p><strong><span>故事半古之人，功必倍之，惟此时为然。</span></strong><span>所以做了总结，今天的事情，只要做到古人的一半，功效是必然要加倍的，此时就是最合适的时机，这是孟子与公孙丑对话的全文。</span></p><p><span>我们现在再来看，孟子所言说现在的齐国，想要称王天下，易如反掌，是因为齐国有足够大的土地，足够多的百姓，并且现在正在合适的时机上。因为很久没有仁德之君的出现，百姓生活在虐政之中，没有比此时更甚的，所以这个时候，如果齐国去行仁政，百姓是非常开心的，犹解倒悬之苦。</span></p><p><span>齐国如果去实行仁政，天下的百姓，自然会知道，这种仁政流行的速度，比驿站传播政令还要快。但是我们去反观这个时候齐国，以及其他的诸侯国，大家都在想着去称霸于天下，都想着用武力不停地扩张，去解决问题。</span></p><p><span>但是孟子则不这样认为，孟子认为恰恰是在这个时机，万乘之国才要去兴仁政，才要去兴王道。他比文王那个时期，要更简单得多，所以才会有对公孙丑所言的那一段话，他不屑于与管仲相比，因为现在的时机也不同，为什么要去称霸于诸侯，而不去兴王道，让百姓自然归服？这是最简单的道路，是乘势而行，顺势而为。</span></p><p><span>我们从这段话当中，再来延伸八个字，乘势待时，事半功倍。如果我们懂得去乘势而行，懂得等到合适的时机，事半功倍。我们只需要做一半的事情，而得到的结果和功效，是成倍的在增加。</span></p><p><span>我们举例子，在房地产正在兴起的时候，如果我们懂得看到大势所趋，我们买一个房子放在那里，什么都不用做，这就是事半功倍。再比如说，互联网在兴起的时候，如果我们看到了商机，我们去做这样的事情，事半而功倍，很简单就可以把这件事情做好。</span></p><p><span>再比如说，早些年做实体的生意，也是如此。那个时候，只要你开一个什么样的店铺，就可以很容易地赚到钱。但是当大势开始没有的时候，你再做事情就会变得很艰难，所以我们这里要懂得去看清形势，任何一件事情的发生，都有其规律可言。我们要懂得找到那个规律，并且乘势，就可以事半而功倍。</span></p><p><span>我们这里再来看齐国，为何齐国现在可以乘势而为？是因为它有足够多的土地，方圆千里，并且它有足够多的百姓，鸡鸣狗吠相闻，达乎四境。我们从这里要学习到一点，要想懂得乘势而为，首先要让自己变得更强大，才可能蓄势待发。</span></p><p><span>举例子，齐国因为现在足够强大，所以才可以乘势而为。比如说房地产在兴起的时候，即使我们知道这是大势所趋，如果我们手里没有钱，是不是也没有办法？即使我们看到了互联网正在兴起，但是我们对这方面一无所知，是不是也没有办法？即使我们看到实体的生意很好做，但是我们没有钱去投资，我们对它一窍不通，是不是也没有办法？</span></p><p><span>乘势的前提是，我们在强大和提升自己，我们有智慧看得清楚，这叫提升自己。我们有一定的实力，可以参与其中，这是提升自己，所以提升自己，是永恒不变的话题，只有我们懂得提升自己，有更多的智慧，我们才能看清楚下一个势的到来。</span></p><p><span>我们在不停地提升自己的能力，比如说某方面的技能，比如说经济的实力，比如说智慧，比如说人脉关系，这都是提升自己的范畴，我们在不停地提升自己，才能看到下一个形势的到来，下一个行业或者事情的兴起，我们才有足够的能力，乘势而为。</span></p><p><span>我们在没有事情的时候，我们就要学会蓄势待发，我们不停地去明德和亲民，让我们有足够多的德行，让我们有更多的智慧，让我们有更加专业的技能，这个时候大势来的时候，我们才可能乘势而行，事半而功倍。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-1 不动心之源由",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上2-1 不动心之源由</span></strong></p><p><strong><span>公孙丑问曰：“夫子加齐之卿相，得行道焉，虽由此霸王不异矣。如此则动心否乎？”孟子曰：“否。我四十不动心。”曰：“若是，则夫子过孟贲远矣！”曰：“是不难。告子先我不动心。”曰：“不动心有道乎？”</span></strong></p><p><span>课程开始之前，我们先来探讨一个话题，这个话题关于心，我们去思考在什么样的情况下我们会动心？</span></p><p><span>举例子，比如说，我正在追求某件事情，这件事情是我梦寐以求的，它在即将实现之时，看看我们的心会不会动。</span></p><p><span>比如说，我特别思念一个人，我特别想要见到这个人，当我在见到他之前或者已经见到他那个时候，看看我们的心是否会动，也就是我们的心会随着很多事情而波动，进而它会影响到我们的身体。</span></p><p><span>举个例子，比如说，我们觉得我很痛心，就是心动到了一定的程度，我们会觉得很痛。再比如说，很多事情的发生事与愿违，我又没有能力去解决，这个时候我会觉得我的心很堵，我的心像被堵住了一样，我开始变得呼吸都觉得很困难，不顺畅。这都是由于我们的心动了，并且到了一定的程度，它会影响我们的身体和生理的变化。</span></p><p><span>再比如说，我对一件事情特别愤怒，也是由于动心所导致的。再比如说，我特别激动，我特别紧张，我现在特别兴奋，这一切都是动心以后所产生的反应。</span></p><p><span>我们去思考，在什么样的情况下，我们不会动心呢？</span></p><p><span>我们先举个例子，比如说，我们听到一个陌生人或者一个同事，我们之间的关系并没有那么亲近，我们听说他与他的爱人分手了，当事人他会觉得很心痛，他会觉得难以接受，他会沉浸在痛苦当中无法自拔，就是因为他的心在动，所以产生了各种反应，以及各种情绪。这个时候我们作为旁观者，好像我们的心并不会痛，因为我们的心并没有为之所动。</span></p><p><span>再比如说，别人家的孩子考试的成绩不好，这个时候他的家长可能会愤怒，可能很生气，可能觉得很无奈，总之他的心会动。但我们这时候作为旁观者，我们并不会跟着心动，所以我们可以很好的去劝告对方，学习好又不是唯一的出路，我们家孩子既然没有这方面的天赋，你让他做其他的事情就好了，看看他有没有其他的爱好以及特长，可以给他换个方向，你看我们的心是不会为之所动的。</span></p><p><span>诸如此类的事情很多，我们就下了一个结论，事不关己，与我没有关系的事情，我是不会动心的。那么与我有关系的事情，在什么样的情况下，我们的心不为之所动呢？</span></p><p><span>我们举个例子，比如说，我们的手上有一点破损，坏掉了一个很小的口，这个时候好像我们不会为之所动。我们说没关系，破皮而已，不用去理它，或者伤口再大一点，我们说没关系，贴上个创可贴自然就会好。</span></p><p><span>这个时候我们通常不会动心，为什么会这样呢？</span></p><p><span>当我们有足够的力量去解决它，去掌控和驾驭它，我们的心就不会为之所动。比如说，我们去到商场，我们看到一件衣服上面的标价是两千元，这个时候有的人就会觉得太贵了，赶紧走，它不适合我，衣服怎么可以这么贵呢？没有必要买这么贵的衣服，这一刻我们的心是动的，为什么会动呢？因为我们手里的钱财没有足够的力量，这个时候我们心就会为之所动。</span></p><p><span>同样，另外一个人他手里有足够的钱，所以看到这两千元的衣服并不会为之所动，反而会觉得还挺便宜的，只要它适合我就可以了。</span></p><p><span>我们再举另外一个例子，比如说，我面前放了一个重物，重八十斤，我们是一位很有力量的男士，见到他就不会为之所动，我可以轻易地或者说想要搬动它，我就可以去搬动它，因为我有足够的力量。</span></p><p><span>但是如果是一位柔弱的女子，或者一位没有强大力量的人，这个时候我们看到它就会有一点动心，说它放在这里碍事，我要怎么办呢？说谁这么讨厌，把这么重的一个东西，放在这个地方，我们的心就会随之而动。</span></p><p><span>我们又开始下一个结论：第一，事不关己的时候，我们的心是不为所动的；其二，就是我们有足够的力量大于当下所面对的事情，这个时候我们的心就不为之所动。</span></p><p><span>在生活当中，当我们没有足够强大的力量去战胜当下的困难，当下的挫折，这个时候我们的心就会为之所动。它会影响我们的情绪，影响我们的状态，甚至会影响我们的生理和身体的变化。那想要解决这样的困惑和当下的问题，就是我们不停地去强大自己的力量，无论你在哪方面强大，都会相应地让这一类的事情不再发生，我们的心不为之所动。</span></p><p><span>那么学习传统文化，学习圣人教给我们的道理，就是在智慧层面让我们自己变得更强大，这个时候，我们不会为生活当中出现的问题和困难所吓倒，我们的心不会为之所动，我们才可以坦然从容地面对生活。</span></p><p><span>那么接下来这段话，孟子与公孙丑之间探讨的就是如何不动心，我们讲的这一段是抛砖引玉。我们从这一段开始带着这样的思考，我们来看孟子和公孙丑之间的对话，它是层层递进的关系，仿佛我们推开一扇大门，从大门我们一步一步，循序渐进地走到最里面，我们去看这个过程都发生了什么，我们一步一步如何可以升堂入室。</span></p><p><strong><span>公孙丑问曰：夫子加齐之卿相，得行道焉。</span></strong><span>公孙丑问了一个问题，如果让老师您执掌齐国的朝政，加之卿相，位高权重，得行道焉，并且得以推行您自己的政治主张。我们都知道孟子推崇的是王道，如何利益天下之百姓，所以这个时候，公孙丑就问了孟子，假如老师您可以执掌齐国的政治，并且您可以完全按照您自己的主张去行事，按照您自己的思想去治理这个国家。</span></p><p><strong><span>虽由此霸王不异矣。</span></strong><span>如果是这种情况，老师您无论想建立王道，还是想建立霸道，建立功业都已经不足为奇了。我们可以看到公孙丑对于老师的这份笃定和自信，他相信老师如果执掌了齐国的政事，并且可以推行自己的主张，无论想成就王业霸业，无论想建立什么样的功业，都是不足为奇的，轻而易举的事情。我们知道公孙丑这段话可以算是孟子梦寐以求的事情，他一生都在推行王道，都在讲仁政，一心都想实现这样的抱负，可谓心之所想。</span></p><p><strong><span>如此则动心否乎？</span></strong><span>问题来了，公孙丑就问了孟子，如果可以实现您梦寐以求的事情，我想请问，老师您会动心吗？</span></p><p><span>我们看孟子怎么讲？<strong>孟子曰：否。我四十不动心。</strong>孟子说，不会的，即使实现的是我梦寐以求的事情，我也不会为之而心动，我四十岁以后就已经是这个样子了。</span></p><p><strong><span>曰：若是，则夫子过孟贲远矣！</span></strong><span>如果是老师您说的这样，你已经远远地超过孟贲了。孟贲：历史记载是一位十分有力量的勇士，这个人的力量有多大呢？他可以单手与牛搏斗，也就是双手可以分别于两头牛搏斗，并且单手可以把那个牛角拔出，他的力量就这么大。因为古人是尚武的、尚勇的，所以很多人是很赞叹孟贲的这种力量。</span></p><p><span>因为他的力量足够强大，所以他从来无所畏惧，比如说，我可以与牛搏斗；比如说，我可以举鼎。那么在于力量这件事情面前，他是无所畏惧的，最后自己也是死于尚武，因为他无所畏惧，所以只要是面对有勇气搏斗类的事情，他都敢于去向前。</span></p><p><span>我们再回顾刚才我们讲的，如何才能不动心？那么其一，就是事不关己；其二，是我有足够的力量面对当下的这件事情，所以我就无所畏惧，我的心不会为之所动。这里公孙丑讲，如果是，那我觉得老师您是要远远超过孟贲的，因为在公孙丑那里，他觉得孟贲的这种无所畏惧就是不动心。</span></p><p><span>我们看看孟子怎么讲？<strong>曰：是不难。告子先我不动心。</strong>说这件事情确实不难，孟子指的是不动心这件事情，没有什么难的。告子是比我开始先不动心的，告子是墨子的弟子，但是告子并没有留下什么样的著作，只是在《孟子》当中，我们可以了解告子这个人。</span></p><p><span>具体告子是如何做到不动心的？他的不动心与孟子之间又有什么区别呢？他的不动心与孟贲的无所畏惧，又有什么区别呢？我们且往后学习，我们自然可以看到每个人关于不动心，他到底做到了什么样子？他们之间到底有什么样的区别？</span></p><p><strong><span>曰：不动心有道乎？</span></strong><span>这个时候公孙丑开始问了，老师请问不动心有什么样的方法吗？要如何才能做到不动心？在公孙丑看来，不动心的人既然可以有这么多。比如说孟贲无所畏惧；比如说老师可以实现自己梦寐以求的理想，还能不为之所动，并且孟子还告诉公孙丑，如果照你说的孟贲这样去理解，是不难，这个不动心是不难的，告子先于我而不动心。</span></p><p><span>我们这里先有一个伏笔，我们要知道孟子所讲的不动心，和公孙丑所认为的无所畏惧的不动心，是有巨大的差别的。具体有什么样的区别，我们一点一点推开这扇大门，一点一点地去学习和深入的了解。</span></p><p><br/></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-2 养勇之方",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上②-2养勇之方</strong></span></p><p><span><strong>曰：“有。北宫黝之养勇也，不肤桡，不目逃；思以一豪挫于人，若挞之于市朝。不受于褐宽博，亦不受于万乘之君；视刺万乘之君，若刺褐夫，无严诸侯；恶声至，必反之。孟施舍之所养勇也。曰：‘视不胜，犹胜也。量敌而后进，虑胜而后会。是畏三军者也。舍岂能为必胜哉，能无惧而已矣。’”</strong></span></p><p><span>这个时候孟子开始回答公孙丑，回答他的问题，说不动心有方法吗？孟子当然是有方法的。但是我们知道孟子讲话的思维逻辑性是很强的，他会循序渐进地去讲解不动心，会由浅入深，</span><span>所以，我们从浅处先来看孟子是如何讲的。</span></p><p><span><strong>曰：有。</strong>接下来这段话提到了三个人，提到这三个人为什么会不动心。提到不动心，先讲了勇气，一个人只有有勇气，才可能让自己的心不动，我们看关于勇气，这三个人都是什么样的状态。</span></p><p><span>这三个人代表了三个不同的层次和境界，首先提到的<strong>北宫黝之养勇也。</strong>说北宫黝这个人是如何培养自己的勇气，如何培养自己的勇敢的。</span></p><p><span><strong>不肤桡，不目逃。</strong>肤：指的是我们的肌肤；桡：指的是退缩。我们看这三个字，说北宫黝的勇气，他是如何培养的，即使刺伤了自己的肌肤，他也决不退缩。我们平时，当我们皮肤被刺伤之时，我们是本能地想要去退缩，想要去退后。</span></p><p><span>不目逃，即使要刺伤到了自己的眼睛，也决不逃避。我们看这六个字是很难做到。当我们的肌肤面临着被刺伤，或者已经刺伤，决不退缩，当危险已经来到我们的面前，甚至奔着我们的眼睛而来，也决不逃避。</span></p><p><span><strong>思以一豪挫于人，若挞之于市朝。</strong>他为什么会面对危险不退缩呢？思：是他是这样认为的，他是这样思考的；挫：是输的意思；挞：是鞭打；市朝：指的是众人眼目之下，也就是热闹的市集。北宫黝认为如果我有一丝的逃避和退缩，输给了别人，那就相当于被鞭打在热闹的市集之下，这是他不堪忍受的事情，所以，从不允许自己退缩和逃避。</span></p><p><span><strong>不受于褐宽博，亦不受于万乘之君。</strong>褐：指的是衣服；宽博：指的是地位低下之人做的宽袍，所以褐宽博指的是地位卑微的平常人。我们再看这句话就好理解了，说不会受辱于平常的百姓，不会受辱于普通人，亦不受于万乘之君，即使是万乘之君，我也不会在他这里受辱和忍受。</span></p><p><span><strong>视刺万乘之君，若刺褐夫，无严诸侯。</strong>如果去刺杀万乘之君，就像刺杀一个普通百姓是一样的，不会畏惧诸侯。</span></p><p><span><strong>恶声至，必反之。</strong>如果敢有人辱骂于我，一定是反击回去的。我们看对于北宫黝的这一段描述，我们可以看到这个人是有勇气的，他自己仿佛是铜墙铁壁一般，从来不会落败，从来不会退缩，从来不会逃避。并且他没有什么样的区别，无论你刺伤我的肌肤，或者是刺伤我的眼睛，我同样不退缩。无论是对一个普通百姓，还是对于万乘之君，我绝不会输，并且决不忍受屈辱。如果你去让我刺杀一个万乘之君，刺杀诸侯，对于北宫黝来讲，他跟刺杀平常百姓是一样的。无论何人只要对他恶语相向，他是一定会反击回去的，这是北宫黝的这种勇气和培养勇气的方法。</span></p><p><span>其实这种人我们在生活当中亦很常见。比如说，一个力量很大的人，在于比力量这方面他是无所畏惧的，无论对方的身份是高是低，是有钱还是没钱，在于力量这件事情，他决不屈服，</span><span>而且会不停地让自己变得更强大，犹如铜墙铁壁一般。但是我们再去看生活当中，这种人有一种初生牛犊不怕虎的思维在其中，所以他并不是一种成熟的表现。</span></p><p><span>比如说，我们在年轻之时，往往会不服输，认为自己可以改变世界，认为自己可以战胜一切困难，尤其是当我们自己做出一些成绩以后，这种自信就会变得更强大。比如说，我通过自己的努力，让自己的生活变得更好，我们就觉得我们已经很厉害了，并且我们可以让自己变得更好，所以，我们无所畏惧任何困难的出现。</span></p><p><span>比如说，我们在一个工作岗位上，我们通过自己的努力，把这个工作做得很好，我们就认为我们可以一路向上，我们从来不会失败，我们有足够的勇气面对所有的问题和困难。</span></p><p><span>所以我们去看北宫黝的这种勇气，他是有一些稚嫩的，有一些不成熟在其中的。就像我们去读历史当中也会有很多这样的人物，他无所畏惧，但是他会有一些鲁莽，这样的人是不懂得变通的。</span></p><p><span>但是我们抛开其人不讲，这种培养勇气的方法是我们值得学习的，我们要在某一方面让自己变得有优势，让自己变得强大，从而让自己变得无所畏惧，不会对一些事情的出现而动心。</span></p><p><span>我们举个例子，我们去看北宫黝，即使面对危险在自己的面前，决不退缩，决不逃避；可是想想我们生活当中，有多少人面对问题，面对困难，是退缩和逃避的呢？</span></p><p><span>举个例子，我要去学习一个新的技能，还没等开始做，我们就认为自己不可以，我们就开始退缩。再比如说，在感情当中遇到了一点挫折，我们就觉得人生没有了意义，我们甚至因为感情，会对人生，对我们整个的生命状态，开始退缩和逃避。</span></p><p><span>还有多少人因为我从一份工作的离开，从而失去了我对人生的勇气呢？还有多少人因为生意的失败，我会觉得我自己无能，我开始自我否定，我开始不相信自己，我以后还可以过上更好的生活，我还可以东山再起，这都是退缩和逃避的表现。</span></p><p><span>所以，我们要学习的是北宫黝身上的，这种面对问题和困难决不退缩，并且没有任何的区别。我不会区别这件事情是大是小，是贵是贱，我都有足够的勇气，不停地让自己变强大，去克服当下的困难和逆境，这是北宫黝培养自己勇气的方法。</span></p><p><span>我们再看孟子接下来讲的孟施舍，他是如何培养勇气的？</span></p><p><span><strong>孟施舍之所养勇也。</strong>孟施舍他是如何培养自己的勇敢，培养自己的勇气的？</span></p><p><span><strong>视不胜，犹胜也。</strong>视：就是看上去这件事情我不足以胜任，但是犹胜也。我要调节自己的心态，告诉我自己是可以制胜的。</span></p><p><span>我们举个例子，比如说，我面对一件我之前没有做过的事情，这一看我觉得难以胜任，因为我没有经验，没有做过，但是犹胜也。我仿佛觉得这件事情我是可以胜任的，我会不停地去寻找方法，我可以刻苦地努力，万事皆有解决问题的途径。</span></p><p><span>所以，我们看孟施舍他是对于自己内心的一种鼓励，当我们面对新的事情，当我们面对当下解决不了的问题，我们都要告诉自己，我们是可以战胜它的，只需要我们再刻苦一点，再努力一点去寻求方法，一切问题终将可以被解决。</span></p><p><span><strong>量敌而后进，虑胜而后会。</strong>量敌而后进，我们先去思量，思量好了之后，我们再去前进。虑胜而后会，后会：是交战的意思。我们先考虑好，如何才能战胜对方，这个时候我们再选择交战。</span></p><p><span><strong>是畏三军者也。</strong>说这样的人是恐惧三军的，是恐惧交战的。</span></p><p><span><strong>舍岂能为必胜哉，能无惧而已矣。</strong>我们再来看孟施舍这段话，他说如果你思量好再前进，如果你考虑周全再去交战，这是因为畏惧三军，畏惧交战之人，说我怎么能有必胜的方法再去决战，只是因为我无所畏惧而已。</span></p><p><span>孟施舍在讲，如果你考虑得那么周全，是因为你畏惧交战这件事情，是因为你心里有恐惧，</span></p><p><span>这个时候你是犹疑的，退缩的，即使两军交战，你也一定会失败。他说并不是我对于所有的事情，都有制胜的方法，而是因为我内心无所畏惧。</span></p><p><span>我们再来总结这一段，首先这里最重要的一点，是我们自己对于内心的调节，是我们对一件事情是无所畏惧的，在这个基础之上，我们可以思量，考虑更周全的方法。如果没有这份勇气在先，我们就不要过多的思量，否则你就会退缩，没有办法去做好一件事情。</span></p><p><span>我们来举个例子，比如说，我现在要去做饭，这件事情我并不擅长，可是我内心有足够的勇气，我可能边做边学，并不是因为我掌握了做饭的方法，而是我内心无所畏惧，我是不会恐惧这件事情的。</span></p><p><span>我们再来看第二种人，我不会做饭，我也没有足够的勇气，这个时候我要学习方法，我要不停地去思量，考虑周全，可是考虑的过程，我们会发现它越来越繁琐，越来越难，最后我们就会放弃，畏惧这件事情。所以我们去看看生活当中，遇事情我们要怎样去思考。但是无论你的思考是什么样的方向，这种勇气都是要放在前的。</span></p><p><span>视不胜，犹胜也。我们看上去无法胜任，但是我们一定要告诉自己的内心，是完全可以胜任的。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-3 勇往直前",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-3勇往直前</strong></span></p><p><span><strong>孟施舍似曾子，北宫黝似子夏。夫二子之勇，未知其孰贤；然而孟施舍守约也。昔者曾子谓子襄曰：‘子好勇乎？吾尝闻大勇于夫子矣：自反而不缩，虽褐宽博，吾不惴焉；自反而缩，虽千万人，吾往矣！’孟施舍之守气，又不如曾子之守约也。</strong></span></p><p><span><strong>孟施舍似曾子，北宫黝似子夏。</strong>曾子和子夏都是孔子的学生。在《论语》当中，孔夫子也讲到，“参也鲁”，讲到曾子这个人其实并没有那么聪慧，所以，这里我们去看孟子说，孟施舍似曾子，这里指的是，两个人都没有先天的优势，我们说曾子其实并不聪慧，但是他刻苦努力，一生都在修己。</span></p><p><span>吾日三省吾身。每天都在数次地反省自己，这是曾子的名言。并且曾子临终之时对他的弟子们讲，说我这一生战战兢兢，如履薄冰，如临深渊。所以说他跟孟施舍有些相似，没有那么好的先天优势，但是这一生是不停地刻苦修正自己的过程。</span></p><p><span>北宫黝似子夏，子夏十哲之一，是以文学著称的。这个人很有才华，那么他的文学和才华是有天赋的，就像这里的北宫黝，他先天的性格当中，就有如铜墙铁壁一般，无所畏惧。</span></p><p><span><strong>夫二子之勇，未知其孰贤。</strong>这里讲到孟施舍和北宫黝，说他们两个人，这种勇气也好，勇敢也好，说不上谁更好一点，没有好与坏。所以我们去看生活当中，也正是出现了很多类似北宫黝和孟施舍的人。北宫黝是第一种人，说在某方面是有天赋的，是有才华的，不需要努力，在这方面就可以做得很好。</span></p><p><span>还有第二种人，就是类似于孟施舍的。很多事情我是没有办法胜任的，但是我可以不停地调节自己的心态，我告诉自己我可以胜任，可以战胜当下的困难，我不停地刻苦努力，让自己可以做好一件事情。</span></p><p><span>其实，这两种人身上都有我们可以学习的地方。我们如果在某方面是有天赋的，我们就不停地去加强，让他如铜墙铁壁一般，但是我们的天赋不可能涉及到生活的所有领域，可能在力气这方面我们是有天赋的，可能在聪慧这方面我们是有天赋的，可能在灵性这方面我们是有天赋的，那么在有天赋的领域，我们就让自己的长处变得更长，犹如铜墙铁壁。</span></p><p><span>但是在我们不能胜任的事情，我们就要懂得不停地调整自己的心态，我们通过刻苦地努力，犹胜也。我们可以去战胜一切困难，可以去胜任一切事情。</span></p><p><span><strong>然而孟施舍守约也。</strong>我们看这个约，约：是指的要领、要害、重点、核心。孟子说，这两个人，他们身上的勇敢没有谁更好，但是孟施舍守约也，孟施舍是抓住了要领的。为什么说孟施舍抓住要领？我们刚才也讲到过，一个人不可能在生活的所有领域，你都有天赋的，不可能你都有先天的优势。那怎么办？</span></p><p><span>就要学习孟施舍的抓住要领，看到一件事情，即使我们不能胜任，我们先要鼓励自己，告诉自己是可以做到的，接下来刻苦努力让自己胜任这件事情，这就叫做要领。他可以适合绝大多数要发生的事情和我们无法面对的困难，所以，我们也要抓住孟施舍身上的要领，让我们可以有勇气面对生活当中的一切困难。</span></p><p><span><strong>昔者曾子谓子襄曰。</strong>这里提到了第三个人，谓：就是告诉，对他讲。子襄，是曾子的门人弟子，从前曾子对自己的学生子襄讲了一段话。</span></p><p><span><strong>子好勇乎？吾尝闻大勇于夫子矣。</strong>曾子问子襄说，你好勇吗？接下来其实就是曾子想要告诉子襄，如何让自己变成一个勇敢的人，如何让自己变得有勇气。吾尝闻大勇于夫子矣，这里的夫子，指的是孔子，曾子说，我曾经听我的老师孔夫子讲过，关于大勇，什么才是大勇呢？</span></p><p><span><strong>自反而不缩，虽褐宽博，吾不惴焉。</strong>我们先看这里的缩，缩：指的是合于正义的，合于仁、合于德、合于礼的事情，称之为缩。褐宽博，我们刚才讲到了，他指的是寻常百姓，地位低下之人。首先要自我反省，如果我们做的事情是不合于道义的，是不合于正道的，不合于正确的价值观，虽然面对的是普通百姓，我也不会欺压于人，我也并不会无理辩三分，这是大勇之人。</span></p><p><span>我们这个时候要往生活当中去思考了，这句话告诉我们首先要自我反省。懂得自我反省的人</span><span>才是大勇之人，而不是说我的位置更高，我比你更有钱，或者我是你的父亲，或者我是你的领导，明明我做的是不正确的，我还欺压他人，这是错误的。明明我的道理并不是正确的，</span><span>我还以自己的地位强压于人，这是错误的。</span></p><p><span><strong>自反而缩，虽千万人，吾往矣！</strong>但是如果我自我反省，我的事情是合道的，我的行为是正义的，即使有千人万人挡在我们的面前，我们也是勇往直前，决不退缩。</span></p><p><span>我们再来看曾子所讲的这段话，这种勇气不来源于天赋，不是先天的优势，也不来源于自我内心的调节，说我告诉自己我很有勇气，我很强大，而是来源于我们自己心中的正道，这才是大勇。</span></p><p><span>如果我们做的事情是不正确的，是不合乎道理的，是不正义的，那么即使面对普通人我也不会强压于人。但是我们经过自我反省，如果我们做的事情是正确的，是有利于他人的，是合于道德的，虽千万人，吾往矣。即使千军万马挡在我的身前，我依然是勇往直前，无所畏惧。</span></p><p><span>这种勇气和勇敢来源于我们心中的正义，我们可以去读历史，有很多正义之士就是因为内心是合于道德的，所以才可以勇往直前。这种勇敢它是来源于你自己内心的善良和那份正直，</span><span>因为你内心是有正义作为参照的，所以你可以无所畏惧，这才是孔夫子心中的大勇者。</span></p><p><span><strong>孟施舍之守气，又不如曾子之守约也。</strong>孟施舍所守的这种勇气，又不如曾子之守约也。这个约，同样指的是要领，重点核心。孟施舍也是懂得守约守气的，但是他守的要领是不停地鼓励自己，通过刻苦努力去完成，让自己有勇气。但是曾子这个守住要领，是培养自己心中的正义感，是让自己心中有正道，是问心无愧，所以你可以无所畏惧，这是大勇者。</span></p><p><span>我们来举例子了，比如说，我们面对一件事情是我无法胜任的，甚至这件事情会有很多人非议和误解，我们看看曾子的守约，我们去思考，我做这件事情是自私自利的，还是为了利益他人的，我去问清楚自己，这件事情是否是合乎于正义的。</span></p><p><span>如果是，那有什么可畏惧的，虽千万人，吾往矣。即使有千人万人不理解，千人万人挡在我们面前，我依然会勇往直前，这是内心的这种正义感所带给我们的。</span></p><p><span>那我们再回过来去看孟施舍，这件事情我可能胜任不了，有这么多人误解我，但是我告诉自己我是可以的，我是可以战胜我自己的，我可以通过刻苦努力，让别人最后认同我。</span></p><p><span>所以你看，它是两种要领，看你自己能抓住的是哪一个。但是我们刚开始想要去抓住孟子所教给我们曾子所说的要领，可能很难，因为这种正义感，这种道德之心，是需要我们逐渐地学习才可以达到的，它是一种次第。</span></p><p><span>我们回头再来总结，孟子所引用的这三个人，首先北宫黝，他是有先天的优势的。举个例子，</span><span>有的人有先天的优势，就是不在意他人的想法，无论他人支持与否，我都坚定的做自己的事情，并且认为我的一定是正确的，这是先天的优势，没有办法学习。</span></p><p><span>那么还有第二种人就是鼓励我们自己，我们是可以的，我一定可以，通过刻苦地努力达到结果，以让别人来认同我。</span></p><p><span>那么还有就是第三种人，曾子所讲的大勇者。无论有多少人误解和不支持，你知道你做的事情是正义的，你知道你做的事情是帮助别人的，是符合道德的，所以，虽千万人吾往矣，没有任何人可以阻挡你的脚步，这是大勇。</span></p><p><span>所以我们综上所述，这三种人身上的特点都值得我们去学习，它是可以兼具的，我们看孟子</span><span>是不是兼具了这三种勇气，公孙丑问孟子，如果您来执掌齐国的朝政，是否可以动心呢？孟子讲，不会，我四十岁以后就不再动心了。为什么不动心？因为他有足够的勇气。</span></p><p><span>我们先看北宫黝身上的特点，先天优势，我们看孟子有吧，先天的才华，口才，智慧，对于王道的推崇，第一点有了。</span></p><p><span>我们再看第二点，孟施舍身上的，难道所有的事情孟子都能胜任吗？显然是不可能的，我们任何一个人都没有办法做到，生活当中发生的所有事情都可以胜任。但是，我有这个自信是可以克服一切困难的，我可以鼓励自己，我可以通过刻苦的努力，去解决一切出现在我面前的障碍。</span></p><p><span>我们再看第三点，曾子所讲的这种大勇，孟子显然更加具备。孟子推行的就是王道，他的思想就是以仁政为核心，与民同乐，仁者无敌，所以，做的事情是利益全天下百姓的，我丝毫没有自己的私利，又有什么可以阻挡我前行的脚步呢？所以，虽千万人，吾往矣！他会勇往直前地去做这些事情，所以，有这三种勇气在其中，孟子当然是不会动心的。无论发生任何一件事情，孟子的心都不会为之所动。</span></p><p><span>我们就要学习这三种勇气。在我们有天赋的地方，我们让它变得犹如铜墙铁壁，在我们不能胜任的事情面前，我们告诉自己，鼓励自己，我们是可以的。然后通过刻苦努力以培养我们的勇气。</span></p><p><span>还有第三点，尤为重要。我们做一件事情的时候，我们自己去思考，去问问自己，我们反观自省，它是否合于道德，是否合于礼义，是否合于我们内心的仁、义、礼、智、信，是否是为他人着想和考虑的，如果是，那又有什么值得畏惧的呢？虽千万人，吾往矣。</span></p><p><span>所以，想让自己不动心，我们就去学习这三种勇气，它可以克服我们生活当中的一切困难，让我们的心不会为之所动。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-4 心动与动心",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-4 心动与动心</strong></span></p><p><span><strong>曰：“敢问夫子之不动心，与告子之不动心，可得闻与？”“告子曰：‘不得于言，勿求于心，不得于心，勿求于气。’”</strong></span></p><p><span>我们再来回顾这一段对话，公孙丑问孟子，如果可以做齐国的卿相，会不会动心。我们这里要区分动心和心动的区别。</span></p><p><span>何为心动？我们举个例子，比如说，我们看到一件漂亮的衣服，或者看到一个美女，看到一个帅哥，这个时候你会产生心动的感觉，心动它是主动的，是我们自己主动地想要追求一个东西，或者主动地看到了什么，所产生的感受。</span></p><p><span>我们再讲何为动心？举个例子，比如说有人对你讲了一番话，这个时候来问你，说你是否动心了呢？也就是有人主动地想要改变我们的某些想法或者某些认知，这个时候我们是被动的，称之为动心。</span></p><p><span>我们再来看公孙丑问孟子的问题，说如果老师您可以做齐国的卿相，这个时候你的心是否会动。我们要知道，如果一个人去治理一个国家，他会面对很多的困难，会面对很多的动荡，在这些困难和动荡之中，自己的心是否能不为所动呢？</span></p><p><span>我们再来看动心和心动的第二个区别。我们讲，心动它是主动的，并且是突然的，猛烈的。动心，首先它是被动的，其次，它是缓慢的改变的过程。比如说，因为别人的一些话，因为环境的变化，或者因为出现了一些人，或者出现了一些困难，这个时候，我们被动的被事情或者环境所改变，我们的心为之所动。</span></p><p><span>我们举个例子，比如说，我们跟一个人刚开始一段感情，我们是想要和对方相扶相伴到老的，但是有可能中途发生了很多事情，让我们的心开始动，忘记了最开始的想法。再比如说，很多人刚开始做生意，或者做一家企业，刚开始是有自己的志向的，可是做着做着，经历了一些事情，或者经历了一些困难，我们的心智被外在的环境和事件所影响，这个时候开始变得动。</span></p><p><span>公孙丑问孟子，如果做了齐国的卿相会如何。孟子讲，我四十岁以后已经开始不动心，我不会被外界的环境，被他人，或者被困难，被一些事件的出现，影响了我最开始的志向。孟子的志向推行王道，推行仁政，不会因为任何环境和任何人的变化，或者出现，自己的心为之所动。</span></p><p><span>公孙丑听到这里或许跟我们的想法是一样的，这种不动心的境界，我们要如何才能达到？有没有什么样的方法？</span></p><p><span>孟子讲当然是有的，给我们列举了三个方法，可以培养自己的勇敢，培养自己的勇气，进而让自己不会去动心。</span></p><p><span>哪三个方法呢？第一点，讲了北宫黝，当你有足够的能力去胜任一件事情，这个时候你是不会动心的。我们举个例子，比如说，现在随着我们生活的条件变得更富裕，这个时候如果说我们买一个零食，我们可能拿出五块钱就可以了，对于拿出五块钱这件事情，我们是不会动心的，因为我们手里的钱足够胜任这件事情。</span></p><p><span>但是如果拿出五万、五十万，可能这个时候，我们就要动心了。什么叫动心？就是我们的意志开始松动，开始产生了很多想法，说这个车我真的要去买吗？如果要去买，会不会给我的生活带来很多的压力呢？</span></p><p><span>如果要去买了这个车，我还要去保养，还要去加油，现在的油价比较高，这就叫动心。也就是出现了一件事情，我们的心开始犹豫不定，开始过多的思考，我们的意志开始松动，称之为动心。</span></p><p><span>再比如说，关于我们家孩子的教育问题，说孩子比较叛逆，这个孩子不爱学习，如果你有足够的能力和智慧，你就不会动心，我有一万种方法可以改变这个孩子，我有很多种智慧可以引导这个孩子，当你的智慧和能力足够胜任这件事情，你就不会动心。</span></p><p><span>但是如果你没有足够的智慧，这个时候我们就要动心了，你要去开始思考这个孩子现在不听话，他未来要如何去找到好的工作呢？如果他现在不好好学习，将来大学他是考不上的，如果他不能好好学习，我要怎么办？可能我后半生的生活也因此而没有了着落，这就叫动心。</span></p><p><span>当我们一旦开始动心，我们就会产生很多的想法，也就产生了内耗。想一想，我们在生活当中，是不是有很多事情我们都是动心的，因为我们没有足够的智慧去处理和胜任生活当中的这些事情，所以我们每一天动心的时候会有很多，因此我们就会觉得很累，头脑不清明。</span></p><p><span>孟子告诉我们的第一个方法，要想不动心，我们就要让自己有足够的能力，足够的智慧，去胜任当下的事情，就像北宫黝，他有足够的力量，他是不会退缩的，这是先天的优势。我们需要通过后天地努力，让自己有足够的智慧力量，胜任我们当下的事情，如此，你就不会动心。</span></p><p><span>那又讲到了第二个方法，因为不是任何时候，我们在任何一个领域，或者在任何一个事件，我们都可以做到足以胜任，那就讲到了孟施舍的方法，视不胜，犹胜也。我看到当下的事情，好像我并不能完全胜任，但是，我在心里告诉自己我是可以胜任的，这个时候，我加倍的刻苦努力，可以让自己胜任当下的事情，让自己不动心。</span></p><p><span>进而又讲到了曾子说的第三个方法，如何让自己不动心呢？让自己合于义，让自己做的事情合于道，合于自己内心的价值观，当你合于了正道，合于自己的价值观，你就不会动心。比如说孟子，我做的事情是为民请命的，是为百姓好的，是保护百姓，让百姓可以过上安居乐业的生活，因此，我毫无畏惧，无论遇到任何困难，遇到任何问题，虽千万人，吾往矣。我不会被这些困难所吓到，因为我心里怀着的是正义，所以我不动心。</span></p><p><span>我们在生活当中也是一样的，当你被别人误解，被别人怀疑，当你遇到困难之时，你去想一想，自己如果做的事情是正义的，这个时候你的体内是充盈着浩然正气的，所以你无所畏惧，我们的心也不会被动，这个时候，你的思想、意志不会动摇。</span></p><p><span>可是如果我们一动心，我们就开始本来的想法就要动摇了。本来我是想着为民请命，可是遇到困难之时，我就要想我这样做下去真的有意义吗？我可以有能力去做好这件事情吗？当我们一开始动心，你的行为就会开始变得犹豫不决，开始变得缓慢，因此这件事情你也就没有办法再做下去。</span></p><p><span>孟子讲了三个人培养勇气的方法，可以不动心，但是之前孟子提到过孟子自己四十岁以后不动心，又提到告子先我而不动心，这个时候公孙丑就要问了，我想请问一下老师您和告子，用什么样的方法可以不动心的。</span></p><p><span>我们看接下来的话题，<strong>曰：敢问夫子之不动心，与告子之不动心，可得闻与？</strong>公孙丑问道，说老师您的不动心与告子的不动心有什么区别吗？可以说来听一听吗？</span></p><p><span><strong>告子曰：不得于言，勿求于心，不得于心 勿求于气。</strong>这是告子讲的话，这里孟子首先讲，告子的不动心的方法，不得于言，勿求于心。言：指的是言语道理，如果在言语和道理上没有通达，那么就不要求于心。</span></p><p><span>不得于心，勿求于气。如果你心里的想法没有开始变化，这个时候你不要求助于气。我们看这句话有三个关键词，第一个叫做言，第二个叫做心，第三个叫做气。言：指的就是言语和道理了，心：指的是我们自己内心的想法，气，我们来讲一讲何为气？我们长期的行为形成的习惯，我们称之为气。</span></p><p><span>我们举例子，比如说我们可以看到军人，说军人一身正气，我们看看这个气从哪里来。是因为军人从到了部队那一天开始，他所接受的教育就是要正义的，就是要保家卫国的，他长此经受了这样的教育，他改变了内心的想法，他的行为就会变成有正气的样子。</span></p><p><span>我们再举个例子，比如说，我们看到一个有威仪的法官，我们看到这个人，你在他面前就不敢讲假话，因为你看到他身上散发的气，就是这个样子的，就是因为他长期的思想，长期的行为，就形成了这样的气。</span></p><p><span>我们再举个例子，说有的人你看上去就是一身的怨气，因为他的想法和他的行为，都是长久的抱怨，最后就形成了他那个气，所以你看到这个人他都是负能量的，讲话必然是抱怨的。</span></p><p><span>我们再举个例子，比如说，你看到那些经常爱占小便宜的人，你去观察他的行为，他总是东张西望，为什么？看看哪里可以占到便宜，看看哪里可以让自己得到更多的好处，所以，气就是你长期的想法和你长期的行为，最后形成的习惯，也就成了气。</span></p><p><span>我们再来看告子所讲的这句话，首先，一个人要从言语和道理上明白，这个时候你的内心才会改变，你的想法才会改变，你的内心和想法开始改变，就有了行为，最后就形成了气。</span></p><p><span>我们举个例子，比如说，一个人首先你要明白道理，应该去孝顺，这个时候你就有孝顺的心，所以，你就形成了行为，最后就养成了气。如果一个人不明白孝顺是正确的，不明白孝悌是何意，他就不会有这样的心和这样的想法，它也就不会形成这样的行为和气。</span></p><p><span>我们再举个例子，我们讲人要亲民，要懂得帮助他人，要有利他思维，这是从道理上我们先学习，先明白了，我们每天学习圣贤文化，知道要亲民，知道要去帮助更多的人，这就叫言语通顺。当言语通顺、通达，我们的内心就会开始改变，接下来我们的行为就会变化，最后就形成了气。我们一看这个人说，看上去就很善良，看上去就很温和，很好打交道的样子，</span></p><p><span>这就形成了气。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-5 持其志 养其气",
    "date": "2022-09-20",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-5 持其志 养其气</strong></span></p><p><span><strong>“不得于心，务求于气，可；不得于言，务求于心，不可。夫志，气之帅也；气，体之充也。夫志至焉，气次焉。故曰：‘持其志，无暴其气。’“既曰‘志至焉，气次焉’，又曰：‘持其志，无暴其气’者，何也？曰：“志壹则动气，气壹则动志也。今夫蹶者、趋者，是气也；而反动其心。”</strong></span></p><p><span>孟子和告子所讲的道理有相同点，但同时还有一个非常大的不同点。<strong>不得于心，勿求于气，可。</strong>接下来孟子讲到，不得于心，勿求于气，这个是可以的，因为你的心没有改变，你的想法没有改变，这个时候你的行为就不会改变，不会形成那个气，这个是可以的。</span></p><p><span>那也就是告子的后半段孟子是认同的，那不认同的是前半段，<strong>不得于言，勿求于心，不可。</strong>如果说道理上没通，你就不要求于心，不要想着内心可以变化，这个是不可以的。</span></p><p><span>什么道理？这句话对，但是不绝对，我们绝大多数人都是要先学习道理，先从言语上通达，我们的内心才会改变，行为才会改变，才会形成气。但是还有另外一种人，我不明白这个道理，我也没有学习过圣贤文化，但是内心本来就懂得孝顺，内心本来就善良，我天生就知道应该去帮助他人，这些人不是从道理和言语上通顺的，而是内心本来就有。</span></p><p><span>我们这里可以引用一个故事，《六祖坛经》当中有神秀大师，神秀当时作了一首偈子：“身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。”告诉我们的内心要时时擦拭，就像擦拭镜子是一样的，不要让它惹上尘埃，这句话是正确的，绝大多数人修行的次第，也是要这样去做的，但是它不够究竟，还有更深层次的就是六祖慧能大师。</span></p><p><span>慧能同样也说了一个偈子：“菩提本无树，明镜亦非台，本来无一物，何处惹尘埃。”说本来就什么都没有，是不需要去擦拭的，我们再回过来看孟子和告子之间的区别就在这里，告子讲的是适合大多数人去学习的。比如说，我们需要先学习圣贤文化，从道理上，从言语上明白了该明德，亲民，止于至善，明白了该去做合于义的事情，明白了该去孝顺他人，这个时候，我们的内心会随之而发生变化，最后形成了气。</span></p><p><span>但是孟子讲的是更深层次的，告诉我们本性本来就是善良的，有的人生而孝顺，有的人生来就知道，做人要善良，要利益他人，要去帮助更多人，这部分人是不需要经过学习的，本来就有。</span></p><p><span>所以孟子和告子两个人讲的都对，只不过孟子讲得更深了一层，告诉我们，有的人可以通过言语让自己的内心发生变化，而有的人不需要通过任何言语，他本来内心，本性上就是善良的，所以他同样可以形成一身正气。</span></p><p><span>接下来孟子又讲了一个观点，具体又告诉我们，这个气到底从哪里来。</span></p><p><strong><span>夫志，气之帅也，气，体之充也。</span></strong><span>首先告诉我们，志，气之帅也。什么叫帅？我们讲主帅，首领，控制，指挥的，所以什么来控制和指挥气呢？志。什么叫做志呢？就是目标，我们想要干什么，这就叫志。</span></p><p><span>比如说，我们去形容一个人，我们说这个人少年得志，那什么叫少年得志呢？他不停地在追寻自己的目标，追寻自己的理想，并且得到了，所以叫少年得志。</span></p><p><span>志就像我们人生当中的导航，如果你有了志，你会知道你所有的行为去向哪里，他是有导向的，可是如果没有这个志，你的气是散的，没有地方可以聚集，所以志是非常重要的。</span></p><p><span>我们从小就要培养孩子的志向，可是我们反观现在，我们有多少孩子是有自己的志向的，不光孩子，我们现在成人亦是如此，问问自己我们有志向吗？我们知道自己要去干什么吗？如果你没有这个志向，你每天的生活就是盲目的，你就是迷茫无助的，我不知道该去做什么事情，我每天就会变得无所事事，无所适从。</span></p><p><span>所以这个志是非常重要的，如果你的孩子可以张口讲出来他的志向，那么恭喜你，这个孩子如果顺着他自己的志向而努力，将来他就会变成一个优秀的人。</span></p><p><span>比如说，我们都知道，王阳明先生从小立志当圣人，当他有了这个志向以后，他所有的行为就有了导向，所以他会学习圣人都做了什么，立德，立功，立言，他一生的行为就有了标准。</span></p><p><span>再比如说我们都听到过的志向，为中华崛起而读书，当你有这个志向的时候，你的所有的行为就形成了导向，这个时候，久而久之就形成了气。</span></p><p><span>还有比如说，我们小的时候有很多孩子是有理想的，是有志向的。有的人说，我想要做科学家，为社会和国家做贡献；有的人说，我想去做警察，可以去维护社会治安；有的人说，我想去做医生，可以去帮助更多的病患；有的人说，我想去做老师，可以去改变更多人的心灵。</span></p><p><span>当你有志向的时候，你的行为就有了努力的方向。但是要注意的是，我们很多人的志向，可能只是说说而已，说了以后你自己并没有去在意他。而真正有志向的人，是说到哪里做到哪里，我所有的行为都会为了自己的目标而去努力，这个时候你的气自然就会变得专注。</span></p><p><span>气，体之充也。这个气它是充满在一个人的体内的，所以，一个人的志向如果是专一的，你的行为如果是有导向的，你就可以看到这个人的气，他是不散乱的，气不散乱，就会让你不动心。</span></p><p><span>想一想我们为什么会动心？是因为你的志和气都不够专，所以遇到困难的时候，遇到诱惑的时候，遇到环境变化之时，我们都会开始动心。如果你的志和气是专一的，它是充盈你的体内的，我们的心就不会为之所动。</span></p><p><strong><span>夫志至焉，气次焉。</span></strong><span>首先，我们这个志如果达到了，气是自然而然就可以充盈的。</span></p><p><strong><span>故曰：持其志，无暴其气</span></strong><span>。所以说，持就是专注于你自己的志向。无暴其气，不要让你的气散乱。</span></p><p><span>我们看最后这两句话，首先，孟子说当你的志到了，你的气自然就到了。可是接下来又说，你要让自己的志向专注，并且不要让自己的气散掉。我们看到这里，似乎又有一个疑问了，这个疑问公孙丑接下来要问到了。</span></p><p><strong><span>既曰：志至焉，气次焉，又曰：持其志，无暴其气，者，何也？</span></strong><span>既然说志至焉，气次焉，如果志到了，气自然就到了。可是又说持其志，无暴其气者，你得专一自己的志向，并且不要让自己的气散掉，这是为何？</span></p><p><span>我们来体会这个疑惑，孟子说，你只要志向到了，气就到了，也就是你不用去理那个气，它是自然而然的。可是接下来又说了，你得持其志，并且还得无暴其气，还得保证气不散掉。这是什么道理？</span></p><p><strong><span>曰：志壹则动气，气壹则动志也。</span></strong><span>孟子说到了，因为当你的志向不能够专一的时候，你的气就会散掉。同样，如果你的行为，你的气不能保持专一的时候，就会动摇你的志向。</span></p><p><span>为什么会动心呢？就是因为你的志向不够专注。举个例子，很多人做一件事情，最开始的志向和初心是好的，可是做着做着你的行为，你的气，就会开始散乱，就会开始动摇，这就是孟子所讲的，持其志，无暴其气，你要让自己的志向专一，并且你不要让自己的行为和你的气受到影响。</span></p><p><span>我们再来看这句话，志壹则动气，气壹则动志也。首先，这个“壹”是专注的意思，如果你的志向是专注的，就会带动你的气，如果你的行为和气是专注的，同时又会带动你的志向，所以它是相互作用的。</span></p><p><span>但是相互作用有好有坏，如果你的志向专一，就会带动你的气，你的行为和气专一，就会带动你的志。反之也是如此，如果你的志向松动，就会让你的气散乱，如果你的行为和你的气散乱，就会影响你的志向。</span></p><p><strong><span>今夫蹶者、趋者，是气也；而反动其心。</span></strong><span>我们先看蹶者，蹶者：指的是走路不稳的人。趋者：指的是走路过快的人。那这里孟子举了例子，说了两种人，一种人走路不稳，说明这样的人并不懂得稳扎稳打，还有另外一种人叫趋者，也就是急于求成的人，说这两种人都是气也，什么意思呢？是长期的思维，长期的行为，形成了这样的习惯。</span></p><p><span>我们再讲稳扎稳打的人，做事情合于道德的人，同样是气也。因为你长期的心性是如此，长期的思考是如此，长期的行为是如此，最后就形成了气，而反动其心。</span></p><p><span>这里点题了，如果一个走路不稳的人，和一个过于急于求成的人，形成了这样的气，它就会影响你的心性。</span></p><p><span>我们再来体会这句话，为什么孟子讲，要持其志，又要无暴其气呢？因为你的想法一旦发生一点变化，这个时候你的行为就会跟着变化，长久以往，你就形成了急躁之气，这个时候反动其心，让你本来稳的那颗心，也会开始变得不稳。</span></p><p><span>所以，我们既要专注于自己的志向，同时还要注意自己的行为，因为你的行为长期下来就会形成气，而这个气又会反动其心，它会影响我们自己的心理变化。</span></p><p><span>我们举个例子，比如说，一个人要想保持平和之气，你就需要让自己的想法变得平和，让你的行为变得平和，最后就养成了平和之气，你的心性就是平和的。</span></p><p><span>但是说我们的心想要去平和，可是不知不觉，遇事你的想法变得急躁，就是那个趋者，然后接下来你的行为会变得急躁，最后你的气就开始变得不是平和，而是急躁之气，而反动其心，</span><span>这个时候回来就影响了你平和的心。</span></p><p><span>所以要想养成平和之气，我们首先要有这样的志向，我要养成平和之气，接下来我们要让自己的想法，保持平和，要让自己的行为保持平和，最后就养成了平和之气。</span></p><p><span>所以又要专注自己的志向，同时又要注意自己的行为和行为所养成的气，就叫无暴其气。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-6 浩然之气",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-6 浩然之气</strong></span></p><p><span><strong>“敢问夫子恶乎长？”曰：“我知言，我善养吾浩然之气。”“敢问何谓浩然之气？”曰：难言也。其为气也，至大至刚，以直养而无害，则塞于天地之间。其为气也，配义与道；无是，馁也。是集义所生者，非义袭而取之也；行有不慊于心，则馁矣。我故曰‘告子未尝知义’以其外之也。</strong></span></p><p><span><strong>敢问夫子恶乎长？</strong>公孙丑接着问：想问老师您有什么优异的特长没有？为何会有此疑问呢？我们来回顾上一段上一段话，公孙丑问孟子，孟子的不动心和告子的不动心，有什么区别？</span></p><p><span>孟子首先讲了告子的不动心，告子的不动心要从言语和道理上先通，通了以后会改变自己的内心，内心改变以后会形成行为，行为再形成气，那也就是告子的气和不动心，它是由外在所产生的，由外在的言语，外在的道理来通顺，那显然孟子并不赞同。</span></p><p><span>故而孟子讲：说心里先有了想法，再形成气，这个是可以的，但是一定要从言语上先通，这个是不可以的，因此公孙丑就问了孟子，那老师您的特长在哪里？其实言下之意也是在问那老师，您的方法是如何做到不动心的。</span></p><p><span><strong>曰：我知言，我善养吾浩然之气。</strong>孟子说我有两个特长：第一个特长，我知言，我知道言语，这里我们要注意了，这里的我知言不是最表面的，说我擅长讲话，或者擅长听别人讲话，不是；我们说，言语背后可以看到一个人内心真实的想法，可以看到一个人的性格，可以看到一个人的思维方式。</span></p><p><span>所以孟子讲：我知言，通过言语的背后，可以知道别人心之所动，可以知道他为什么要讲这段话，可以知道他的性格，可以知道他的思维方式，这是第一个长处。</span></p><p><span>那么第二个长处，我善养吾浩然之气，我善于培养自己的浩然之气，我们听到这段话，孟子知言，善养浩然之气，我们都会挑自己最关心的，最在意的问题去问，公孙丑和我们是一样的。</span></p><p><span><strong>敢问何谓浩然之气？</strong>他没有先问知言，为什么会知言，背后到底有什么道理？把这个问题忽略掉了，想请问老师什么叫做浩然之气？</span></p><p><span><strong>曰：难言也。其为气也，至大至刚。</strong>这个事情是很难讲清楚的，所以叫难言也，即使是讲不清楚，也要尝试着去讲，这种浩然之气又大、又强、很有力量。</span></p><p><span><strong>以直养而无害，则塞于天地之间。</strong>我们先看这种气，强和大到什么程度，可以充满充盈于天地之间，如何才能有这种气呢？以直养而无害，直是正直，要用正直去养这种气，并且不要去伤害它。</span></p><p><span>我们举个例子，什么叫不要伤害它呢？不要有漏掉的地方，举个例子，我们说用一个器具去装空气，如果我们用的是塑料的袋子，一旦有一个地方是漏气的，这个气就泄掉了。所以既要以正直去养这种气，但同时要让他做到无害，不要去做伤害气的事情，也就是不要做不正直的事情，一旦你做不正直的事情，对这个气就是有所伤害的，它会漏掉。</span></p><p><span><strong>其为气也，配义与道。</strong>我们先看这个配字，什么叫做配呢？它是不可或缺的东西，举个例子，我们说找一个人配合，我们来做这件事情，他虽然不是主体，但是少了这个人，这个事情没有办法做，说我们准备一些配菜，它虽然不是主料，但是缺少它这道菜没有办法做成。</span></p><p><span>所以配的特点就是不能缺少的，但是它并不是主体，其为气也，配义与道也，那么如何去配？</span></p><p><span>配合正义的事情，合于义的，合于道的事情。</span></p><p><span><strong>无是，馁也。</strong>枯萎，变缩小的，称之为馁。如果不是这样做，这个气就会漏掉。我们再看这句话，这种气是要靠自己的正直去将养，并且不要去做有害的事情，是配合义和道的。如果不是配合义与道，他就一定会馁也，也就会消散掉，这种气就会有漏，就不是至大至刚之气。</span></p><p><span><strong>是集义所生者。</strong>重点来了，这种气从哪里来呢？集义所生者什么叫集，就是聚集，越来越多，聚集义所生，我们来看这个生字，何为生呢？从无到有，从小到大，从少到多，称之为生。</span></p><p><span>我们来看生的特点是什么？举个例子，说我们让一个禾苗生长，主导是靠禾苗自己，然后配以辅助。比如说，我们给它浇水，给它施肥，让它可以得到阳光雨露，但是禾苗自己才是主导，我们看生是什么意思？如何才能生起？浩然之气是你经常聚集的，多做合于义的事情，自然就生起浩然之气。</span></p><p><span>比如说，我们讲一位法官，一位法官如何身上才能有正义之气呢？是他经常公正的断案，他经常站在法律的角度，保持公正公平的原则，当他做的多了以后，自然就生起这种正义之气。</span></p><p><span>我们说一个人何为正直，他经常聚集性的做合于义的事情，合于正直的事情，久而久之就生起了浩然之气，也就是这种正气。</span></p><p><span>我们这里再来讲讲气，每个人所聚集的气是不一样的，孟子讲，自己善养浩然之气，但是反观生活当中，很多时候我们也在聚集气，只不过有可能聚集的是怨气，怨气从哪里来？平时我们的想法当中，我们的行为当中总是抱怨，抱怨的多了，最后聚集而来就形成了气，也就是怨气。</span></p><p><span>我们再讲说有的人你看上去，就可以感受得到满身的贪婪之气，就是因为他平时的所思所想都是贪婪的，久而久之就聚集了这种气。所以你看上去就是贪婪之气，还有的人我们说这个人很小气，因为他什么事情都斤斤计较，总是喜欢占人便宜得到好处，久而久之这样的事情做多了，就聚集成了气，我们看到的就是这个人很小气。</span></p><p><span>我们讲，一个人说有儒雅之气，同样的道理平时的想法，平时的行为都是儒雅的，淡然的，平和的，久而久之就聚集生起了这种儒雅之气，所以去看看我们身上现在散发的是什么气，</span><span>我们就知道它是由于我们平时聚集的时间久了，聚集的多了，自然所生起的这种气。</span></p><p><span>我们回头再来看孟子是如何养自己的浩然之气，经常做合于义的事情，合于道的事情，久而久之这种气是自然生起的，而你不需要刻意的再去养这种气，它是随着你心里有义，你的行为上有义，自然所生起的这种浩然之气。这种浩然之气，当你聚集的越来越多，那么自然是至大至刚，充塞于天地之间。</span></p><p><span><strong>非义袭而取之也。</strong>这句话我们要注意了，袭是什么意思呢？是义的延续，并不是做了一件合于义的事情，延续就可以取到这种气。比如说我开了一个公司，这个公司是做了利益他人的事情，帮助他人的事情，是合于义的，从此以后我就不再做事情了，那么这一件事情是不足以生起浩然之气的。</span></p><p><span>我们是要不停地一件又一件的做更多符合于义的事情，聚集的多了，才会生起这种浩然之气，</span><span>所以我们学习孟子要体会到这一点，我们在生命当中是要不停地去做合于义的事情，而不是靠一件事情，我们从这里要去延伸，也就是不倚仗我们在生活当中，不能倚仗和依靠一件事情，达到什么样的目标和结果。</span></p><p><span>比如说，我对我的朋友很好，你不能说因为一件事情对他很好，靠着这一件事情的延续，来稳固我们之间的感情，它会变淡会变少。</span></p><p><span>再举个例子，说我曾经读初中的时候，考试是第一名，你以后读高中，读大学，你还需要不停地进步，而不是依靠那一次的考试成绩，来度过我们以后的生活。我们在生活当中就要懂得这个道理，我们要不断地去提升自己，并且不停地去付出，不停地去做合于义的事情，最后聚集而来，会生起浩然之气，绝非一件事情的延续。</span></p><p><span><strong>行有不慊于心，则馁矣。</strong>这里的慊是满足满意的意思，如果我们的行为做的有不让我们的心满足和满意的地方，这个时候的气就会缩小，会变得没有力量，这句话很好理解，就是我们的行为一定要无愧于心，否则这个气就会逐渐地漏掉，最后就会散掉。</span></p><p><span>所以要保证我们的每一个行为都是合于义的，都是无愧于内心的，这种气才会变得至大至刚。</span></p><p><span>我们经常讲到一个成语叫理直气壮，如果我们在合于义，合于道德，这件事情上没有亏，我们理就是直的，这个时候你的气是充盈在你的体内的，你讲出来的话是铿锵有力的。</span></p><p><span>可是如果这件事情我们是有愧于心呢？你不敢让别人提及，一聊到这个话题的时候，我们总是想转移，这个时候你的气就会逐渐地泄掉，也就是馁也。</span></p><p><span>我们再来总结这一段，如何才能养这种浩然之气，首先我们做的事情是要合于义，合于道的，</span><span>以正直去将养，并且不要去做伤害气的事情，聚集的义行多了以后，自然生起这种浩然之气，</span><span>但是行为上不要有愧于心，当有愧于心的地方，就是在漏掉这个浩然之气，当你漏的多了以后，这个气就不足，就没有办法达到。</span></p><p><span>孟子所讲的至大至刚，所以我们不停地去做合于义的事情，不停地去反观自省，自己的行为不要有愧于心，不停地去将养义行，这个浩然之气就会生起，直到它至大至刚，充塞于天地之间。</span></p><p><span>我们去读历史经常可以看到那些忠义正直之士，为什么可以正气凛然，就是因为这种气充盈在他的体内，他做的事情无愧于心，做的事情合于义，合于道，所以这种正气就在体内，他是支撑一个人，可以变得更好的动力。</span></p><p><span><strong>我故曰‘告子未尝知义’以其外之也。</strong>所以孟子讲：告子并不了解义，所以认为这种气是来自于外在的，其实不对，这种气是来源于一个人的内在的，是从内心而生起来的浩然之气，当我们的内心是懂得义，懂得道的，以正直去将养，并且不做伤害义行的事情，这种浩然之气自然生起，所以这种浩然之气不是来自于外面，而是来自于我们的内在。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-7 揠苗助长",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-7揠苗助长</strong></span></p><p><span><strong>必有事焉而勿正，心勿忘，勿助长也。无若宋人然：宋人有闵其苗之不长而揠之者，芒芒然归，谓其人曰：‘今日病矣！予助苗长矣！’其子趋而往视之，苗则槁矣！天下之不助苗长者，寡矣，以为无益而舍之者，不耘苗者也。助之长者，揠苗者也；非徒无益，而又害之！</strong></span></p><p><span><strong>必有事焉而勿正，心勿忘，勿助长也。</strong>我们先来看第一句，必有事焉而勿正，一定要从事情当中去聚集这种气之所在。孟子和告子的不同正在这里，告子认为这个气可以从言语上，从道理上得来，然后内心是通达的，进而可以养这种浩然之气，但是孟子讲说，我善养吾浩然之气，而这种浩然之气是从内在的，是可以正直去养的。</span></p><p><span>当以正直去养的这种浩然之气，是至大至刚的，要配上义与道，配合义行，配合自己的所思所想，是合于道的。这里注意了，又进而提到，必有事焉而勿正，就是一定要从做事情当中去积累，而勿正，这个正是什么意思呢？预期，要从事情当中去积累，去聚集这种浩然之气。但是注意，不要有期盼，不要期盼一个结果的呈现。</span></p><p><span>我们看这一句话，我们要做一个延伸，这句话在生活当中非常的好用，我们不光是善养浩然之气是如此的次第，我们做其他的事情也一样，一定要通过努力做事情而达到那个结果，但是不要去期盼。</span></p><p><span>我们举个例子，比如说，对于孩子的学习成绩，我们要通过事情，然后去帮助孩子，帮助他提升学习的动力，提升学习过程当中的努力，但是而勿正，不要期盼他考试成绩一定会好，否则，就会给我们带来痛苦。</span></p><p><span>再比如说，说我们去学习传统文化，我们一定要在事情当中去努力，在这个过程当中保持努力地学习，但是不要给自己一个预期的成果。比如说，我一个月必须要学到什么程度，两个月必须要达到什么状态，这个时候就会产生痛苦。</span></p><p><span>再比如说，我们参加工作也是如此，我们要在工作当中，在具体的事情当中努力去做，但是不要期盼一个什么样的成果，说我做三个月，一定可以拿到什么样的结果，我做几个月一定可以加薪，我做多久一定可以升职，当我们有这种预期，就会产生痛苦和烦恼。</span></p><p><span>我们再举个例子，比如说，感情也是如此，说想和一个人开始一段感情，或者是夫妻之间，我在感情的过程当中，在家庭生活的过程当中，在具体的事情上去努力，但是不要去期盼结果，说努力地对他好，我们这个感情一定可以变成什么样子吗？说我努力地对他好，对方就一定会给我回馈吗？那个是没有办法的。所以，我们要回到那个过程，那个事件当中去。</span></p><p><span>再比如说，养生也是如此，我们现在经常会谈到养生，但不代表所有的养生的人都可以达到很好的一个预期的结果，但是有一点是可以肯定的，你只要去注重过程，注重具体的事件，你只要去养生，就比不养生的人，结果要好得多。</span></p><p><span>我们说对于孩子的学习成绩，对于自己的感情也是如此，我们在具体的事情当中努力地付出，不一定达到预期的成果，但是一定比你不努力要好得多。所以，孟子告诉我们如何可以养自己的浩然之气，就是在事情上去努力，但是心态上是放平和的，勿正，不要有一个预期的结果，说我什么时候可以养出这种浩然之气呢？当你有这种预期的结果，你的心态就会开始变得不平和，这个气它就没有办法变得至大至刚。</span></p><p><span>心勿忘，勿助长也。心里时刻不能忘记这件事情，我一直放在心上，要养我的浩然之气，然后我从具体的事情上，从义行上，从合于道上去努力，而不追逐那个预期的结果。</span></p><p><span>勿助长也。不要去助长，何为助长呢？就是刻意地去帮助他成长。我们经常听到过一个成语，叫揠苗助长，这个揠是拔的意思，所以，我们又叫做拔苗助长，我们接下来，孟子讲了一个例子，告诉我们不要去刻意地助长。</span></p><p><span><strong>无若宋人然：宋人有闵其苗之不长而揠之者。</strong>不要像宋国人那个样子，闵：是担心的意思，揠：就是拔，有一个宋国人他很担心自己的禾苗没有长，这个时候他就把苗拔起。</span></p><p><span><strong>芒芒然归。</strong>芒芒：指的是很疲惫无神的样子。这个人在拔苗助长，拔苗以后他很疲惫，首先是很累，接下来是无神，为什么会无神呢？他也不知道这样做到底有没有用。所以，你看当我们做一件事情，我们很疲惫，而且做了之后又不知道有没有结果，不知道有没有成效的时候，就是这种芒芒然的状态。</span></p><p><span>这个时候他开始对别人去讲，<strong>谓其人曰：‘今日病矣！予助苗长矣！’</strong>病：指的是很累，累坏我了。因为他拔苗助长之后很疲惫，并且不知道是否有效果，无神的样子。这个时候，见到其他人，就对其他人讲，说今天可累死我了，我去帮助禾苗生长了。</span></p><p><span><strong>其子趋而往视之，苗则槁矣！</strong>这个时候他的儿子听到了，趋：是快速地跑过去，到那里去查看，结果发现苗槁矣，已经死掉了。</span></p><p><span><strong>天下之不助苗长者，寡矣。</strong>我们听上去，拔苗助长的故事好像很简单，我们怎么会去做拔苗助长的事情呢？可是换到其他的事情上，我们还知道吗？所以这里孟子给了一个结论，说天下不去拔苗助长的人是很少的，想一想我们生活当中的事情是不是如此？</span></p><p><span>我们总是操之过急。比如说，对于我们的感情，我们总是想刻意的去做一点什么。比如说，孩子的学习成绩，我们总是急于求成，急于达到预期的结果，我们就会刻意地去拔苗助长。我们看看生活当中有多少人为了逼迫孩子学习，让他拿到一个好的成绩，最后孩子产生了叛逆的心理，对抗自闭，甚至跟家长已经不再交流，甚至还有的人生起了怨恨之心，这不都是拔苗助长的结果吗？</span></p><p><span>再比如说，我们去做一个生意也是如此，我们总想快速盈利，我什么时候可以快速地赚到钱呢？我什么时候可以把我的费用赚回来？这个时候你的心和你的行为就会走偏，我们如何想着快速地盈利，我们怎么想着把这个利润再加大一点，我们怎么想着把这个费用再节约一点，这都是拔苗助长。</span></p><p><span>所以，我们生活当中有很多事情都是在拔苗助长。在孟子那个时期已然如此，那时至今日更是如此，随着社会的节奏变得越来越快，人心变得越来越浮躁，变得越来越急功近利，做什么事情都想要快速地拿到那个结果，这个时候就会像文中的宋国人一样，去做拔苗助长的事情，可是最后那个结果，你会发现禾苗已经死掉了。</span></p><p><span><strong>以为无益而舍之者，不耘苗者也。</strong>以为这件事情是没有益处，而不去做的人。这段话当中提到了两种人，第一种人就是拔苗助长的人，急于求成。而第二种人就是以为这件事情是没有益处的，因而不去做的人，这里是意有所指的，有的人认为养浩然之气是没有意义的事情，</span></p><p><span>所以就不去做。</span></p><p><span>但是我们学习《孟子》到现在，明白了一个道理，一个人最重要的，就是你呈现出来的这个气。比如说别人和你相处起来是否舒服，这是你的气；别人是否信服你所讲的话，这是你呈现出来的气；当你跟别人交流之时，别人可以听进去几分，这是你散发出来的气；当你做一件事情，是否可以做成，这是你散发出来的气。</span></p><p><span>如果一个人目标是坚定的，你就有坚定之气；如果一个人是勇敢的，你就有勇敢之气；如果一个人是担当的，你就有担当之气；如果一个人是正义的，你就有正气；如果人是有智慧的，你身上散发的就是睿智之气。</span></p><p><span>但是很多人并不明白这个道理，认为养浩然之气是无意的事情，因而就不去做。我们学习到这里，你可以去观察自己，观察身边的人，这个人，你所感受到的人，这个人散发出来的都是那个气，我们意识到了气的重要性，我们可以去向孟子学习，善养吾浩然之气。</span></p><p><span><strong>助之长者，揠苗者也；非徒无益，而又害之！</strong>告诉我们，当你刻意的，想要达到那个结果，急于求成，这是拔苗助长之人，不光这件事情没有益处，反而害了他。</span></p><p><span>我们再来整个总结这一集所讲的内容，这里讲了三种人。第一种人，孟子讲的是善养浩然之气的人，必有事焉而勿正，心勿忘，勿助长也，一定要从事情当中去努力，但是又不期盼那个结果，心时时刻刻没有忘记这件事情，并且不急于求成，这就是善养浩然之气的方法。</span></p><p><span>我们把它延伸出来，不光是善养浩然之气，我们善于做任何一件事情，都是这个道理。比如说我们善于经营感情，我们就知道在具体的事件当中去付出，而我又不期盼结果，我时时刻刻都把对方放在我的心上，我又不刻意地去做拔苗助长的事情。我们说善于学习的人也是如此，我从具体的事件当中去学习，努力刻苦地去积累，但是我又不着急期盼那个结果，我时时刻刻都把学习这件事情放在心上，又不会去做拔苗助长的事情。</span></p><p><span>我们以此类推，无论是你教育孩子，参加工作，做事业都如此。所以善养浩然之气，延伸出来，我们善于做任何事情，都可以用孟子的这个方法。</span></p><p><span>进而又讲到了第二种人，第二种人就是急于求成的人，拔苗助长的人。拔苗助长的人不光对于这件事情无益，反而会带来更多的伤害。</span></p><p><span>比如说，我们着急孩子的考试成绩，你没有耐心去做具体的事情，你只想要那个结果，你就会不停地去逼迫孩子，最后你不光没有帮助他，提升考试成绩，你有可能进而伤害到了他，伤害了我们之间的感情和关系。</span></p><p><span>我们做生意也是如此的，当你是急于求成，拔苗助长之人，你不光没有帮助你把生意做得更好，反而让你的生意快速的灭亡，快速地走到尽头，这就是在伤害它。</span></p><p><span>我们感情也是如此，你总是快速地想要得到预期的结果，而你去急于求成，去拔苗助长，最后，反而让你们的感情变得更加破裂，所以，孟子告诉我们，不要去做急于求成，拔苗助长的人，非徒无益，而又有害。</span></p><p><span>进而又讲到了第三种人，第三种人是认为这件事情无益，所以就不去做的人。</span></p><p><span>比如说，对于孩子学习不好这件事情，我们到底管还是不管？有的人认为说，管又没有什么意义，我干脆就不管了，这同样是错误的。具体的，正确的方式，是我们在具体的事情上帮助孩子提升成绩，但是结果顺其自然就好了。</span></p><p><span>还有很多事情，比如说，养浩然之气也是如此，它并不是无益的，是我们并没有认识到它的好处。再比如说，仁德、忠信、孝顺、亲民，帮助他人，这些事情同样有很多人认为它是无益的，所以就不去做。</span></p><p><span>但是我们学习了以后，明白了一个道理，一个人如果没有仁德之心，你自己不会生活得开心，你也不会让自己变得更有格局，让你的心胸变得更开阔。如果一个人不懂得忠信的道理，你是没有办法在这个社会上立足的，对于朋友，对于感情，对于工作，对于事业，如果自己没有忠信，你又怎么可能把它做下去呢？</span></p><p><span>所以，这些都是有益的事情，只是我们需要通过学习，清醒的、深刻的认识到。当我们知道它是有益的，我们就可以通过事情上去践行，可以善养吾浩然之气，可以善于培养自己的仁德之心，可以善于培养自己的忠信，可以善于养成自己的孝顺，可以善于养成自己的慈爱之心。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-8 知言知人",
    "date": "2022-09-17",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-8 知言知人</strong></span></p><p><span><strong>“何谓知言？”诐辞，知其所蔽；淫辞，知其所陷；邪辞，知其所离。</strong></span></p><p><span><strong>何谓知言？</strong>我们来回顾公孙丑的问题，问孟子有什么擅长的地方，孟子讲，我擅长两点：第一点，是我知言。第二点，才讲到我善养吾浩然之气。但是，我们似乎对浩然之气更感兴趣，问完了浩然之气，接下来公孙丑回过头来再来问，何谓知言。知言到底是什么意思呢？</span></p><p><span>我们看孟子的回答<strong>“诐辞 知其所蔽。”</strong>第一个诐，是偏颇的意思，后面这个蔽，是遮挡的意思。如果一个人讲话是偏颇的，他一定是被什么遮挡住了。</span></p><p><span>我们来举个例子，来理解这句话。盲人摸到大象的耳朵，然后别人让他去形容，说大象是什么样子的？盲人会讲，大象像一个蒲扇一样；可能有的盲人摸到了象腿，这个时候有人又问到了，说大象是什么样子的？他说大象就跟一根柱子是一样的；而有的人可能摸到了大象的身体，他就会去形容说，大象像一堵墙。</span></p><p><span>他们所讲的都叫诐辞，也就是偏颇的言语，他们被什么所遮挡住了呢？被自己的眼睛，因为他们看不到全貌，只是摸到了某一部分，所以讲出来的话就叫做诐辞，因为被遮挡住了。</span></p><p><span>这个故事很好理解，但是我们试着再往生活当中去延伸，看看我们每个人是否都有被遮挡的地方。</span></p><p><span>举个例子，说我喜欢红色，我认为红色的很好看，这就叫诐辞，这是偏颇的言论，你喜欢红色，故而你认为红色好看，这是我们被自己的喜好所遮挡住了，没有看到事情的全貌。可能有的人喜欢黑色，有的人喜欢白色，有的人喜欢蓝色，所以不代表我们喜欢的红色，就一定是好看的。</span></p><p><span>再比如说，我们吃辣的食物,我们觉得很好吃，这个时候我们就会讲出偏颇之语，我们觉得辣的好吃，你不吃辣的菜，怎么会有味道呢？这就叫偏颇，是我们被自己的喜好所遮挡住了，并没有看到事情的全貌。</span></p><p><span>我们来以此思考，我们都会被什么所遮挡住？</span></p><p><span>盲人是被眼睛所遮挡住了，耳聋之人是被耳朵所遮挡住了，那我们绝大多数的人是被认知所遮挡住了，因为我们认知不够，所以就会讲出偏颇的言语，还有很多人是被情绪所遮挡住了，因为我当下很生气，所以我接下来的言论和行为，就会变得偏颇，就是诐辞。因为我们沉浸在情绪当中，就开始看不到事情的全貌和真相。还有很多人是被喜好所遮挡住了，我们刚才举过几个例子，因为我喜欢这个颜色，所以我就认为只有这个颜色才是好看的，选择其他颜色的人，是你的审美有问题，这都叫偏颇之语。</span></p><p><span>看看我们自己的认知，也就是我们每个人的认知，都是有局限的，都是有障碍的，那也就是我们所有人都会有偏颇，产生偏见，我们每个人看到的角度都不是最全面的，我们只是看到了一部分。所以，这个时候我们明白这个道理，就要知道不会轻易地评价一个人，一件事情，或者一个物品，因为你讲的有可能是偏颇之语。</span></p><p><span>我们举个例子，说我面前有个杯子，这个时候，可能别人把这个杯子打破了，这个时候别人可能就会讲出偏颇之语，说杯子没关系，不重要，我再买一个就好了，这就叫偏见。为什么？</span></p><p><span>这个杯子本身可能不值钱，但是它背后有可能有更深刻的意义和价值。比如说，这是我非常敬重的人所送之物。比如说，这是我所爱之人所赠之礼，它背后的意义和价值，就会变得不一样。这个时候，我们就知道了，我们不要轻易地给别人下结论，说这个杯子又不值钱。它不光是事情的本身，它背后可能蕴含着更多的人、事和情感。</span></p><p><span>再比如说，我们看到了一件事情的发生，我们就开始去评价这件事情，就像盲人摸象，我们看到的只是一部分，或者是断章取义，而并不是全面，这个时候你讲出来的话，就是诐辞，因为我们被自己的认知所局限住了，而并没有知道背后的东西，所以怎么能轻易地去下言论？下结论？</span></p><p><span>我们再来看孟子的这句话，说诐辞，知其所蔽。一个人讲出来偏颇的话，就可以知道他是被什么所遮挡住了。我们刚才学习的这段话，如果我们深刻理解了，我们也可以做到孟子这样，诐辞，知其所蔽。当一个人讲出来偏颇的话，有偏见的言论，我们就可以看到，他是被什么所遮挡住了。</span></p><p><span>比如那个盲人，是被眼睛所遮挡住了；听不到的人，是被耳朵所遮挡住了；在有情绪的状态下，讲出来的话和行为，我们就知道，他是被情绪所遮挡住了。还有的人，被自己的喜好所遮挡住了，他喜欢的就认为是好的，正确的，不喜欢的，讨厌的，就认为是不正确的，不好的，这都是喜好所遮挡。还有更多的人是被认知所遮挡住了，因为每个人的认知都是有局限性的。</span></p><p><span>我们不可能了解这个世界上的万事万物，我们可能只是从某一个方面，某一个角度去了解到了，那我们就知道了，别人即使讲出偏颇之语，我们也不会产生什么样的情绪。我们也更不会认为这是无知之人，因为当你这样认为，我们自己就已经陷入了偏颇，每个人的认知都是有局限性的。</span></p><p><span>当我们懂得这个道理，我们就不会苛责于人，我们看清楚的是他背后所遮挡的东西。举个例子，一个人拿出来一个东西，他说这个是世界上最好的东西，你就知道了他是被他的见识所遮挡住了，那是他见过的最好的，但是他以为这个是世界上最好的东西，这就是遮挡。</span></p><p><span>当我们明白这个道理，我们就可以淡然的、清晰的看着身边的人和事，每个人讲出来一句话，我们就知道他是被什么所遮挡住了。</span></p><p><span>第二层，当我们明白这个道理，我们就不会轻易地下断言，我们让自己免于偏颇之语，免于偏见，这个时候，我们就没有那么多对他人和事件的评价。</span></p><p><span>比如说，这个人这样做是对的，那样做是错的，没有。比如说，聪明的人就一定好，愚笨的人就一定不好，那叫偏见。聪明的人，有聪明的好处；愚笨的人，有愚笨的好处；我们说个子高的人，有个子高的好处；个子矮的人，有个子矮的好处；红色有红色的好，蓝色有蓝色的好，没有什么东西是绝对的。当我们有这样的认知，你就不会产生偏颇，也就不会有蔽。</span></p><p><span><strong>淫辞 知其所陷。</strong>淫：就是过度。过度的言语，我会知道他是陷在什么地方了。我们看这个陷字，无法自拔，称之为陷。比如说，一个人深陷在泥潭当中，他是没有能力自己从中出来的，称之为陷。一个人如果产生了过度的行为，或者过度的言语，孟子讲，我就知道他陷在了什么地方。</span></p><p><span>我们看这句话是什么意思？比如说，一个人陷在情绪当中，我现在很愤怒，你去看他讲的话会不会过度，会不会过分，平时这种伤害别人的话，他可能是不会讲的，但是他深陷情绪之中，就会讲过度过分的言语。</span></p><p><span>再比如说一个人，陷在自己自卑的情绪当中，说我现在很自卑，这个时候，他就会不停地自我否定，所以，他讲的话也同样是过度的。别人说其实你很漂亮，我没有那么好看，有很多的缺陷；别人说其实你挺厉害的，这件事情做得不错，说不不不，这件事情我做的并不好，所以他总是沉浸在自卑当中。这个时候他讲的话就会过度，过于自我否定，过于自卑。</span></p><p><span>再比如说，一个陷在自大的状态当中的人，同样他的言语和行为，都是过度的。他认为自己高高在上，认为自己各个方面都要比别人更强，这个时候是瞧不起他人的。所以，他所说出来的话，自然就是过度的，让别人很不开心，并且容易引起别人的仇视。</span></p><p><span>再比如说，得意就会忘形。比如说一个人陷在得意的状态当中，说我这几年顺风顺水，我做什么事情都很顺，这个时候，他讲话就很容易夸大，很容易把一件事情看得很小，很容易看不到危险。所以，一个人无论深陷在任何一种情绪和状态之中，都会产生过度的言语，以及过分的行为。</span></p><p><span>孟子讲，我看到一个人过度的言语，就会知道他是陷在什么之中，他可能陷在自卑之中，可能陷在自大之中，可能陷在愤怒之中，可能陷在得意之中。我们学习了孟子的这种智慧，也可以做到这个样子，听到一个人讲出过度的话，产生过分的行为，我们不会沉浸在表象之中，我们能看到更深刻的道理。</span></p><p><span>他是因为自卑，所以才讲出这样的话，我们就知道，我们想帮助一个人，不是从他的言语上去帮助他，而是调整他深陷在自卑当中的这种状态，他自卑之心开始变得逐渐平稳，去掉了自卑之心，他的言语自然变得适中。</span></p><p><span>如果一个人很自大，我们要想帮助一个人，是帮助他去除掉这颗自大之心，不要让他深陷在自大的状态当中，他的言语和行为，自然就是适中的。</span></p><p><span>如果一个人开始变得得意，我们要懂得让他不要那么得意，任何一件事情都是有好有坏的，当你过于得意，一定就会失意。当他明白这个道理，去掉了得意之心，他的言语自然就是适中的。</span></p><p><span>所以我们学习了孟子的这种智慧，首先可以反观自省，当我们产生过度的言语和过分的行为，我们一定要及时地察觉到，我们是深陷在了什么地方，或自卑、或自大、或开心、或消极、</span><span>或愤怒、或喜悦，都有可能会产生过度的言语。我们及时的觉察，自己及时的调整，同时，我们可以用它去教育孩子，用它去和身边的人相处。</span></p><p><span><strong>邪辞，知其所离。</strong>邪：就是不正。一个人讲出来不正的话，我们要看他背离了什么。</span></p><p><span>举个例子，说一个人不孝顺父母，他讲出来的话，就会是邪辞。比如说，不懂得孝顺父母的人，可能就会讲说，父母都这个年龄了，怎么还没有离开？父母到这个年龄了，怎么还要求那么多？父母从来都没有给过我什么？为什么这个时候我要去给他们更多？你一听就知道了这个人讲的是邪辞，不正的言语。为什么？因为他背离了孝道。</span></p><p><span>好，我们再举个例子，说一个人懂得忠信，如果不懂得忠信之人，就会讲邪辞，背离了忠信，他讲出来的话，自然就是不正的。举个例子，比如说夫妻之间的忠，如果有人对你讲说，没关系，你可以背着你的爱人在外面花天酒地，你一听就知道，这是邪辞，因为这个人他不忠于感情，不忠于婚姻，不忠于家庭。</span></p><p><span>再举个例子，比如说，我们在一个企业工作也是一样，如果有人去讲说，你工作干嘛那么努力？得过且过就可以了，无非是拿个工资。那你就知道了，这个人讲的是邪辞，他说的是不正的言论，因为他没有忠于这份工作，没有忠于自己的岗位。那这样的人，怎么能与他相处呢？</span></p><p><span>再比如说，有的人讲出不正之辞，是因为背离了仁义，我们做事情为什么要为他人考虑呢？一定要先看自己的利益，我得到利益就可以了，至于他们，我们不用去理，你就知道了这个人讲的是邪辞，因为他<span>背离了</span>仁义背离了仁德。</span></p><p><span>所以，我们去看一个人讲出来不正的言论，它背后是背离了什么。有可能是背离了忠贞，有可能是背离了仁德，有可能背离了正义，有可能背离了孝道，也有可能是背离了朋友之间的感情，所以叫邪辞，知其所离。听到一个人讲出不正的言论，我就可以看到他背后背离了什么，也就是相应的缺失了什么。</span></p><p><span>比如说，一个人背离了孝道，我们要想着去帮助这个人，让他明白孝道。比如说，一个人讲的是，如何背着他的爱人做什么不道德的事情，我们就知道，要教给他的是忠贞之道。因为他不懂得家庭是需要和谐的，感情是需要彼此忠贞不渝的。</span></p><p><span>那同样，我们明白这个道理，又可以反观自省，又可以去帮助他人，我们要及时地觉察到，如果我们的言语、言论是不正的，是邪辞，我们去看对应的，我们到底背离了什么？如果背离了仁德，我们去修自己的仁德，如果不够忠贞，我去修正自己的忠贞。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-9 先知言 后知避",
    "date": "2022-09-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上2-9 先知言 后知避</span></strong></p><p><strong><span>遁辞，知其所穷</span><span>。生于其心，害于其政；发于其政，害于其事。圣人复起，必从吾言矣。宰我、子贡，善为说辞，冉牛、闵子、颜渊，善言德行，孔子兼之，曰：‘我于辞命 则不能也。’</span></strong></p><p><strong><span>遁辞，知其所穷。</span></strong><span>遁：就是闪躲遮掩，一个人讲话如果总是闪躲，顾左右而言他，或者讲话遮遮掩掩，知其所穷。这个时候，你就知道他背后一定是有事情的，他遇到了困境。或者是不足的。</span></p><p><span>我们举个例子，比如说，你问一个人，你最近过得怎么样？他说，还行还行，还可以，挺好的。你就知道了，他讲话是有遮掩的，那就意味着他背后一定是有不足，或者是遇到了什么困难，或者是有事情让他当下并不如意。</span></p><p><span>再比如说，我们对孩子讲，说你的作业写完了没有？他说差不多了，写完了，他讲话是闪躲的，是有遮掩的，底气不足，你就知道一定是有事情。可能是他没有写完，也可能是他有很多作业不知道，可能当时没有注意听讲，老师布置的作业他不完全清楚。</span></p><p><span>再比如说，在夫妻感情当中也是一样的，当你们之间正常的交流，如果他讲话总是闪躲和遮掩的，那就说明一定有事情在瞒着我们，或者其中他遇到了什么困难，是没有办法讲出来的。</span></p><p><span>由此我们就可以知道了，我们看一个人总是躲闪，我们就看他背后到底有什么事情，可能那个事情是需要我们帮助的。</span></p><p><span>比如说孩子，你发现他有遮遮掩掩的时候，他有闪躲，你知道了，就不妨想办法去帮助一下他。你可以直接对他讲，有问题有困难你可以说，是不是作业忘了带回来呢？是不是有一些作业你并不清楚，我们一起想办法来克服。</span></p><p><span>再比如说，当你问到朋友他最近过得如何，如果他总是闪躲的，如果他总是遮遮掩掩，说明他当下可能遇到了什么困难，我们不妨可以问问朋友，你遇到了什么困难？你不妨直说，我看看尽可能的，是否可以帮助到你？这是说到帮助别人。</span></p><p><span>还有另外一种情况，别人在遮遮掩掩，很多事情不能明说，你知道了以后，我们就要懂得这件事情不能再继续问下去了，我们也清晰的了解了他的为人，了解他背后可能做了什么样的事情，我们做到心中有数就可以了。</span></p><p><span>我们再来看整个这四句话，这是孟子讲的知言，诐辞，知其所蔽；淫辞，知其所陷；邪辞，知其所离；遁辞，知其所穷。我们看整个通过这四句话，我们可以看到每个人身上或多或少都会有。</span></p><p><span>比如说，第一个诐辞，知其所蔽。每个人都会有遮挡自己的地方，比如说情绪，比如说喜好，</span></p><p><span>再比如说认知，我们每个人的认知都不可能那么全面，都有所偏颇，这个是人性上的，也就是人性上本身就带的这个东西。</span></p><p><span>那么接下来讲的是心性上的，淫辞，知其所陷。每个人在心性上如果不平稳的时候，比如说开心喜悦，比如说不高兴的时候，比如说愤怒的时候，只要你的心态不够平和，产生波动，</span></p><p><span>都有可能会产生淫辞。</span></p><p><span>从人性最后又讲到了心性，再接下来，又再往下降一降，又讲到了，邪辞，知其所离。这个是我们学识不够，我们没有去学习更多的文化知识和道理，所以就很容易出现邪辞。</span></p><p><span>比如说，没有学习仁义之道，你讲出来的话就不合于仁义；你没有去学习孝道，那么讲出来的话就不合于孝；你不懂得忠信的道理，就会讲出来，不符合忠信的邪辞。</span></p><p><span>再接下来，当我们遇到困难之时，就会讲遁辞，我们可能遇到了困境，可能这个话不足以和别人说，所以就会遮遮掩掩，讲话就是闪躲的。还有可能是我们做了对不起他人的事情，做了欺骗他人的事情，所以导致我们自己的底气不足，这个时候讲话，就会讲出来遁辞。</span></p><p><span>我们看这四点，在我们每个人身上，或多或少都在发生着，我们明白这个道理，就可以看清楚自己，就可以看清楚每一个人，这就是孟子讲的“我知言。”</span></p><p><strong><span>生于其心，害于其政。</span></strong><span>这些言语是从心所生的，从心所生就会害于其政，如果是从政之人就会把偏颇过度的言语、闪躲的言语，以及不正的言语，带到自己的政事当中来，它会影响我们的行为，影响我们的工作。</span></p><p><span>古人都讲从政，我们现在做其他的事情也是如此。如果我们不懂得这个道理，我们自己如果不知言，就会让自己这些偏颇的言语、过度的言语、不正的言语、躲闪的言语，从自己的心而生起，最后影响自己的行为，再到影响我们具体所做的事情当中。</span></p><p><strong><span>发于其政，害于其事</span></strong><span>。如果在你的政事上发出，就会呈现在具体的事情当中，我们刚才举例子了，无论是从政也好，我们工作也好，或者做生意也好，都一样，我们首先要知言，首先要从自己开始修正，如果我们不知道去避免这些言语的发生，就会由我们的心生起，最后就会演变到我们的行为当中来，到我们具体做的事情当中去。</span></p><p><span>比如说，我们不知道邪辞，我们不知道去避免它，就会让我们在工作当中讲很多不正的话，</span></p><p><span>如果我们不懂得遁辞的道理，就会让我们在工作当中总是闪躲，总是遮遮掩掩，为什么会闪躲和遮遮掩掩？可能我们在工作上没有足够的努力，做的不足，自己知道做的不够好，所以当领导问起，我们就会产生闪躲的言语。</span></p><p><span>再比如说诐辞，我们如果不懂得让自己扩大自己的认知，不要讲偏颇的话，这个时候在工作当中，我们就会产生偏颇的行为，我们会认为自己是很优秀的，自己的见解永远是正确的，因而就听不进去领导的话，听不进去同事的话，也听不进去顾客对我们的反馈，进而我们就会产生淫辞。我们接下来会产生更多的情绪，我们在愤怒当中，就会讲过度的话，对同事、对员工、对客户。如果我们觉得自己很厉害的时候，就会产生自大的情绪，产生自大的状态，这个时候，我们就会讲出过度的言语，产生过度的行为。</span></p><p><span>所以要想把一件事情做好，我们首先要知言，不光是做好一件事情。</span></p><p><span>我们说要想教育好孩子，我们得先知言，如果你不知言，你看不清楚很多事情。同样的道理，我们要想经营好这个家庭，我们要先学会知言，既知道自己言语和心理、思维上的变化，同时，又能知道对方的言语和心理上的变化，如此，才可以让家庭变和谐，让亲子关系变得更和睦，让工作变得更顺畅。</span></p><p><strong><span>圣人复起，必从吾言矣</span></strong><span>。孟子讲如果以后还有圣人再出来，必从，就是一定会赞同，和认可我讲的这段话。</span></p><p><strong><span>宰我、子贡，善为说辞，冉牛、闵子、颜渊，善言德行。</span></strong><span>这里列举了孔夫子的五位学生，首先讲宰我与子贡，宰我、子贡善为说辞，这两个人是善于言语，善于讲话的。所以当鲁国有危机之时，孔夫子都是让子贡去处理外交事件，因为他善于讲话，善于琢磨别人的心理，讲话可以讲到别人的心里，所以才能做好外交。并且子贡可以为商，朋友遍及天下，就是因为他善言辞，善把握别人的心理。</span></p><p><span>冉牛、闵子、颜渊，善言德行，我们看颜回、闵子骞和冉牛，他们三个人善言德行，什么意思呢？他们讲的言语更多的都是关于的德行，德行之外的事情，他们并不愿意讲，所以这三位在孔门十哲之中，是以德行著称的。</span></p><p><strong><span>孔子兼之。</span></strong><span>这个时候孟子讲，说孔子是兼之的，既善言辞，既知言，知心，知思维，同时又善言关于德行的事情，言下之意，孔子才是最全面的人。</span></p><p><strong><span>曰：我于辞命 则不能也。</span></strong><span>孔子是兼之的，但是自己却讲，我对于言辞、天命、性命这些事情，我是不清楚的，不知道的。</span></p><p><span>我们看这句话有意思，正好是对应了孟子所讲，我们来回顾公孙丑问孟子，何谓知言。孟子第一句话讲的是，诐辞，知其所蔽，不会讲偏颇的话，才不会被自己的认知所遮挡。所以孔子是兼之的，自己却讲对于言辞，对于天命，对于性命我是不清楚的。</span></p><p><span>因为没有人会说自己真正的清楚，当你说自己真正的清楚，真正的了然，就已经是诐辞了，</span></p><p><span>被自己的认知所遮挡，并没有看到事情的全貌。所以，我们看孟子讲话的逻辑思维很强，首先是孔夫子的谦词。其二，放在这里告诉我们，圣人讲话是没有诐辞的，不会认为自己什么事情都清楚，不会认为自己什么都知道，给我们做了一个很好的典范。</span></p><p><span>我们再来回顾整个公孙丑问孟子的这一段话，公孙丑问孟子老师，老师，你有什么样的长处特点？孟子讲，我有两个特点：第一个特点，叫知言，第二个特点，叫我善养吾浩然之气。</span></p><p><span>我们知道孟子周游列国二十年，他不停地去讲自己仁政的思想，去到每个国家和诸侯国的国君去谈仁政，和各位大夫去谈仁政，和自己的学生们去谈仁政，去讲自己的思想。如果孟子不能知言，要如何去讲自己的思想呢？所以首先知言是一个必不可少的条件和能力。</span></p><p><span>其二，孟子讲，我善养吾浩然之气，我们看言语是不是要配合浩然之气，才可以让你的言语通达？才可以让别人更好地去接受？如果孟子整个呈现出来的不是浩然之气，那么他讲的仁政又有哪位君主可以愿意去听呢？可以向孟子去请教呢？</span></p><p><span>我们由此不妨可以想象一下孟子的形象，首先，孟子他是知言的，他可以清楚地把握每个人的心理变化，到什么样的程度，去讲什么样的话。其二，孟子整个人是散发着浩然之气，傲立于天地之间的。</span></p><p><span>孟子的形象大概就在我们的脑海当中呈现出来了，一个充满着浩然之气，傲立于天地之间的人，并且讲话是可以时刻地讲到对方的心里，只要你开口讲话他就可以准确的知道你心里在想什么，你被什么所障碍住了，你为什么要讲这样的话。当我们脑海当中有了孟夫子的形象，我们就可以去学习做一个又知言，又有浩然之气的人。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-10 仁且智",
    "date": "2022-09-20",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上2-10 仁且智</strong></span></p><p><span><strong>“然则，夫子既圣矣乎”曰：“恶，是何言也！昔者子贡问于孔子曰：‘夫子圣矣乎？’孔子曰：‘圣，则吾不能；我学不厌而教不倦也。’子贡曰：‘学不厌，智也；教不倦，仁也。仁且智，夫子既圣矣！’夫圣，孔子不居。是何言也！昔者窃闻之：子夏、子游、子张，皆有圣人之一体；冉牛、闵子、颜渊，则具体而微。“敢问所安。”曰：“姑舍是”“曰：伯夷、伊尹，何如？”“曰：不同道，非其君不事，非其民不使，治则进，乱则退，伯夷也。何事非君？何使非民？</strong></span></p><p><span><strong>然则，夫子既圣矣乎。</strong>公孙丑这个时候问孟子：“老师你已经是圣人了？”我们去想，为何公孙丑会有此疑问呢？在之前我们讲过，孟子说：“我知言”，然后又引用了孔夫子的学生们，以及孔夫子本人说：“宰我和子贡善为说辞”，这是一种讲话的技巧。</span></p><p><span>我们很多人是有讲话技巧的，这样的人善于抓住对方的心理变化，善于抓住形式，善于抓住某个事件，所以叫善为说辞。</span></p><p><span>那么接下来，又引用了闵子骞、冉牛、颜回，说这三个人善言德行，善言德行是根本的智慧，我们把第一种人称之为技巧，他善于讲话的技巧，善于某个领域。但是第二种人不一样，他抓住了根本智慧，所以叫善言德行，什么意思呢？</span></p><p><span>举个例子，颜回、闵子骞这样的人，他是有德行的行为，他是懂得修德的，那么接下来他所讲的话，自然就是善言德行的。当一个人善于用德去修正自己，善言德行，无论你讲任何一件事情，都可以抓住那个事情的根本，所以，我们说善言德行是根本的智慧。</span></p><p><span>举个例子，一个人懂得修德，那么无论你去跟任何人交流，无论交流任何一个行业和任何一件事，你都可以抓到这个事情的根本，就是他有没有德。</span></p><p><span>但是孔子兼之，就是孔子既有根本的智慧，有这个德行，善言德行，同时，他又掌握了说话的技巧，可以善于把握对方的心理，善于把握形势。因为孟子可以看到孔子的高度，我们想，站在同等高度的人，才能看到那个高度的事情。既然孟子可以看到子贡和宰我擅长的是说辞，擅长讲话，擅长外交，又可以看到闵子骞，颜回他们擅长的是言德行，也就是修德，抓住了根本智慧，又可以看到孔夫子是兼之的。</span></p><p><span>公孙丑有此疑问，既然孟子可以看到这些事情，就说明孟子达到了高度，故而问孟子，老师，你已经是圣人的境界了。</span></p><p><span><strong>曰：恶，是何言也！</strong>恶是叹词，说你这是讲的什么话？我怎么可以以圣人自称？</span></p><p><span><strong>昔者子贡问于孔子曰：夫子圣矣乎？</strong>接下来引用了一件事情，说，从前子贡问孔夫子，说老师，您是圣人了吧？同样，子贡也认为自己的老师是圣人，我们看孔子是如何作答的。</span></p><p><span><strong>孔子曰：圣，则吾不能，我学不厌而教不倦也。</strong>子贡认为孔夫子是圣人，但是孔子说圣，则吾不能，说圣人我是达不到的，我只是学而不厌，教而不倦。我们看孔夫子说他只做了两件事情而已，第一件事情，就是学而不厌，我不停地去学习修我自己，提升我自己。第二件事情，在我提升自己之后，我教会他人永不厌倦，我只是做了这两件事情而已，至于子贡所讲的圣人的境界，我是达不到的。</span></p><p><span><strong>子贡曰：学不厌，智也；教不倦，仁也，仁且智，夫子既圣矣。</strong>子贡说，学不厌倦，智也，因为学习不厌倦、不停止，就会增加智慧。教不倦，仁也，教诲他人不厌倦，这是仁的体现。我们去想一个人怎样才能做到教诲他人而不厌倦呢？</span></p><p><span>就是因为内心有足够的仁爱，有足够的仁德，所以不停地去教别人，并不厌弃对方，不厌其烦地去讲给对方听，去教诲更多的人，希望更多的人可以有德行，可以有智慧，可以生活得更好。所以仁且智，这就是圣人所呈现出来的表现。</span></p><p><span>我们这里可以来思考，一个圣人的指标，就是仁且智，不停地学习不厌倦，就是在提升自己智慧的过程，然后用自己的智慧，可以去帮助更多的人，这就是仁德的体现。</span></p><p><span>所以圣人是仁且智，缺一不可。如果一个人说我只有仁德之心，我想帮助别人，但是我却没有智慧，这个时候你是没有办法真正地帮助别人，因为我们告诉对方追求的东西，有可能是错的，有可能是本末倒置的。所以只有仁德不够，要加上智慧。</span></p><p><span>只有智慧也是不够的，只有智慧，没有那颗仁爱之心，不会去做真正地帮助别人的事情，那么只是聪明而已，只是智者，但是并不愿意更多地付出和教诲他人。</span></p><p><span>所以我们这一生要做的事情，无非是仁且智，不停地去帮助他人，教诲他人，这就是仁。不停地去学习自我提升，自我修行，这就是智。</span></p><p><span><strong>夫圣，孔子不居。是何言也！</strong>这个时候，孟子再次强调，关于圣人，孔夫子都不居，你讲的这是什么话？</span></p><p><span><strong>昔者窃闻之：子夏、子游、子张，皆有圣人之一体；</strong>窃闻，是私下里说，曾经私下里听说过，子夏、子游、子张，这三个人都有圣人的一体，指的是一方面，某些特点。子夏以文学著称，并且是孔夫子的得意门生，子游被称为南方夫子，因为有了子游，孔夫子的道才传到了南方。子张善于交友，朋友遍天下，所以说他们身上的特点，都是圣人身上的某一方面。</span></p><p><span><strong>冉牛、闵子、颜渊，则具体而微。</strong>那说到冉牛、闵子骞、颜回，这三个得意的门生都是以德行著称的。说他们是具备了圣人全面的特点，但是而微，还比较浅薄微小，没有那么高的深度和那么高的境界。</span></p><p><span>我们再来看，以德行著称的闵子骞和颜回，说他们身上的特点，和圣人的特点基本是符合的。</span><span>但是有一点就是不足，因为他们还比较浅薄，还比较微小，全面，但是并没有达到圣人的境界。</span></p><p><span><strong>敢问所安。</strong>这个时候，公孙丑又问孟子了，安是指的什么？您是什么样子的？您的追求是什么？您觉得您以什么立命？言下之意就是在问孟子，老师您觉得您跟提到的这几位，哪一位比较相似呢？是像孔子，但是孟子又不以和孔子相比而自居，那是像颜回，是像闵子骞，还是像子夏，还是像子游，亦或是子张和冉牛呢？</span></p><p><span><strong>曰：姑舍是。</strong>这个时候孟子讲，暂且不提，说不谈这个话题了，为什么呢？没有办法去作对比。</span></p><p><span>我们说对于颜回的了解，对于闵子骞的了解，对于子游和子夏的了解，我们只是通过了《论语》，和过去听说的一些事情，并没有更多全面的资料，而且也不是和我们同时代的人，并没有那么了解，所以，就没办法说我和谁更相似。但是公孙丑一定是锲而不舍的，因为他想更多地去了解孟子，了解自己的老师到底是一个什么样的人，他到底是一种什么样的状态？他的追求到底是什么呢？</span></p><p><span>所以进而又问道<strong>曰：伯夷、伊尹，何如？</strong>说伯夷和伊尹这两位，您是怎么看待的？因为在公孙丑的心中，伯夷和伊尹都是圣贤之人，都是有德行的人，所以就想继续去对比，想要去了解孟子到底是一个什么样的人，他心中的想法到底是什么样子的。</span></p><p><span><strong>曰：不同道。</strong>首先说了伯夷和伊尹，他们的处事方法各不相同，他们的性格，他们的选择也各不相同。</span></p><p><span><strong>非其君不事，非其民不使。</strong>说不是自己的君主，我不去事奉，不是自己国家的百姓，我不去使用。</span></p><p><span><strong>治则进，乱则退，伯夷也。</strong>治，就是世道，好的时候我就进，去做事情，乱则退，如果出现天下大乱，我就归隐。说这是伯夷的道，也是伯夷的处事风格，行为准则。</span></p><p><span>我们去回顾伯夷其人，伯夷和叔齐是古代有名的贤人君子，因为他们两个互相让国君的位置，谁也不愿意去做。商纣王后期昏庸无道，才有了武王伐纣，伯夷和叔齐想拦着武王，不想让武王去伐纣，但是武王自然为天下百姓着想，还是去伐了纣王。后来建立了周朝，伯夷和叔齐这两个人是不食周粟的，因为改朝换代，甚至连周朝的粮食都不吃，更不要说事奉周朝的君主，和爱戴周朝的百姓，这就是伯夷的行事作风。</span></p><p><span><strong>何事非君？何使非民？</strong>这两句话是孟子自己的想法，说事奉谁的君主，又不是事奉呢？哪一个百姓又不是自己的百姓呢？言下之意，是在讲伯夷不懂得变通，他在守旧，只守着自己认定的过去的君主，和过去的百姓。</span></p><p><span>伯夷是有德行之人，是一位君子，但是道不同，我不赞同他的行事作风。也就是在孟子看来，</span><span>你事奉什么样的君主，又有什么区别呢？使用什么样的百姓，又有什么区别？如果这位君主他是贤德的，是为天下百姓着想的，我们就应该去尽一份力量，哪有那么多的分别？</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-11 进退自如",
    "date": "2022-09-23",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-11 进退自如</strong></span></p><p><span><strong>治亦进，乱亦进，伊尹也。可以仕则仕，可以止则止，可以久则久，可以速则速，孔子也。皆古圣人也，吾未能有行焉；乃所愿，则学孔子也。</strong></span></p><p><span><strong>治亦进，乱亦进，伊尹也。</strong>接下来又提到了伊尹，伊尹和伯夷不同，伊尹是治亦进，乱亦进。说政治清明，我就去做事情；即使是国家昏乱，我同样在做事情，我们听到这里，是不是会觉得伊尹好像是更懂得变通？</span></p><p><span>伊尹辅佐了五代君王，其中也有君王不贤德，比如说，太甲被伊尹放逐桐宫去反思，所以伊尹是无论国家到了什么样的状态，他都是要进取的。</span></p><p><span>除了孟子回答了公孙丑关于伯夷和伊尹的看法。孟子自己又提到了第三个人，<strong>可以仕则仕，可以止则止，可以久则久，可以速则速，孔子也。</strong></span></p><p><span>孟子这里又提到了孔子，可以仕则仕，孔子在鲁国做到了大司寇，并且摄相事。可以止则止，当孔夫子在鲁国发现不能以道事君，不能实现自己的政治理想，随时都是可以停止的。包括孔夫子十四年周游列国的过程当中，都是坚持以道事君，不可则止。我想要去从政，实现自己的政治理想，但是如果这个政治环境，或者这个君主不能推行仁政，不能去以德行治国，不可以为政以德，那么就是随时可以停止，随时可以离开。</span></p><p><span>可以久则久，一件事情如果可以做的长久，就按照长久的打算去做。比如说，孔夫子到了晚年周游列国以后，发现并不能实现自己的政治理想，就停止从政这条路，晚年著书立作，所以，我们今天才有了四书五经。</span></p><p><span>可以速则速，一件事情需要快速地解决，那么就快速地完成，绝不拖沓，这是孔子的作风。</span></p><p><span>我们再来回顾这一段，其实提到了三种人：第一种人，提到了伯夷，伯夷是不知进的人，不会随着时代的发展，去进取的人。周武王是比商纣王更贤明的君主，所以已经改朝换代，但是伯夷并不会知进，他坚守自己的原则，守旧，保持自己的君子之风，不食周粟，饿死在首阳山。这样的人我们是赞叹的，贤人君子有德行，固守原则。</span></p><p><span>那又提到了第二种人，伊尹，伊尹是知进不知退，无论是治世还是乱世，都要去进取的，都要去按照自己的想法和理想去做事情的人。</span></p><p><span>进而又提到了第三种人，孔子是可以为仕就为仕，实现自己的政治理想，当发现不能实现自己的政治理想，可以止，随时可以停止，也可以按照长久的规划去做事情，也可以按照短期的计划去做事情。所以我们说，孔子这样的人是进退自如的人，拿得起，放得下，无论做任何一件事情都可以。</span></p><p><span>我们再来延伸这三种人，在我们的生活当中其实很常见。有的人是不知进的，也就是因循守旧之人，不懂得变通，不会随着时代的发展去做事情。比如说现在社会上、时代上所流行的东西，很多我们过去抱着固有思想的人，是不会变通的，还按照自己过去认准的方法去做事情，但是时代已经变了，消费的群体已经变了，人们关注的地方已经变了，如果还在因循守旧，是没有办法跟上时代的进步和发展的。</span></p><p><span>那么第二种人是不停地进取的人，但是不懂得退。我们举个例子，比如说伊尹，比如说，我们熟知的三国时期的诸葛亮，这样的人都是知进而不知退的人，他会一直的进取去做一件事情，去实现自己的理想。</span></p><p><span>生活当中这样的人很多，比如说，工作当中，我们可以看到一直在积极进取的人；比如说，在事业上我们可以看到一直在进步的人。所以，这样的人值得我们去学习，但是当你不懂得退，就可能给自己带来很多的麻烦，并且这样的人是不懂得休息的。</span></p><p><span>那么还有第三种人，进退自如的人。这样的人需要有极高的境界，并且没有自己的欲望，所以可行可止，可做可不做，无可无不可。显然孟子他是更赞同孔子的做法，所以当公孙丑问起伯夷和伊尹何如，孟子讲，不同道，大家的行为准则不一样，处理事情的方式不一样而已。</span></p><p><span><strong>皆古圣人也，吾未能有行焉。</strong>接下来回答了公孙丑，伯夷、伊尹都是古之圣人也，我都是达不到的，因为我并没有去做那些事情。我也没有像伊尹一样治亦进，乱亦进；我也没有像伯夷一样，固守自己的原则，什么事情都不去做，不会跟着时代的发展。他们都是古之圣贤，很赞叹，但是我并不愿意做这样的人。</span></p><p><span>故而接下来讲到<strong>乃所愿，则学孔子也。</strong>说我自己心中的理想，我的愿望是学习孔子这样的人。学习孔子的进退自如，可行可止。</span></p><p><span>如果有机会实现自己的政治抱负，那就去从政；如果发现不能以道事君，不能推行自己的政治主张，我就不可则止。我可以为了长久的事情去打算，我可以短期的做一件事情，无论如何，都可以安然自处，我并没有什么样的欲望，我也没有什么样固定的想法，所以才能进退自如。</span></p><p><span>我们再来看孟子的想法，他并不愿意和颜回、子贡、子张、子游、子夏去对比，因为他认为自己不了解，也并不愿意去做伊尹和伯夷这样的人，因为那与自己的处事风格是各不相同的。如果非要问我的理想和我心中所愿，我是想学习孔子这样的人。</span></p><p><span>这句话，我们可以看到孟子的思想是非常的通透与豁达的，他不论对错，不讲是非，不论高低，说这些人都是古之圣人，但是我并不是觉得他们好，或者是不好，只是我的行为处事的方式与他们各不相同。我更愿意去学习孔子这样的人。</span></p><p><span>当我们有了这种思维，我们再去看待生活当中的事情，就会变简单。</span></p><p><span>比如说，伯夷这样的人，我们很赞叹，贤人君子，固守原则；伊尹这样的人，我们也赞叹，因为他不停地在追求自己的理想，积极进取。那么子夏这样的人，我们也很赞叹，他是以文学著称的；颜回这样的人，我们也很赞叹，因为他有德行；子贡和宰我这样的人，我们也很赞叹，因为他们是口才很好的人，善于讲话，善于交友之人。</span></p><p><span>每个人的理想都是好的，每个人的处事方式并没有对与错，只是性格不同，追寻的理想不同，所处的环境不同而已，但是，我更愿意学孔子这样进退自如的人。</span></p><p><span>我们这里可以再上升一个境界来讲，我们去想，为什么孔子可以仕则仕?可以止则止？我们看“可以”这两个字很有意思，什么叫“可以”呢？外界的条件和环境允许了，称之为“可以”。</span></p><p><span>比如说，伯夷、武王显然是比商纣王更仁德的，更是一位贤明之君，我们看从环境和条件上，他是可以仕的，但是伯夷并没有仕，为什么呢？因为伯夷被忠所牵绊，他忠于自己的国家，忠于自己的百姓，当他被忠所牵绊，他就不知进，没有办法再为周朝去做事情。</span></p><p><span>我们再看伊尹是不是如此？他也是被忠所牵绊。比如说，无论这个君主是好，还是不好，无论是治世还是乱世，他都可以为仕，他都是知进而不知退的。同样是因为那个忠的思想所以牵绊住了，就没有办法像孔子一样可以仕则仕，可以止则止。</span></p><p><span>我们引用的诸葛亮，孔明先生也是如此，他也是被忠所牵绊，因为他感恩刘备对他的知遇之恩，所以才想为刘备的后人夺得天下，让天下一统。但是他自己的内心显然知道，这是做不到的。</span></p><p><span>我们这个时候再来看，为什么孔夫子可以不被这些事情所牵绊呢？因为他不沉浸在情之中。</span></p><p><span>我们举个例子，比如说，孔夫子他的儿子孔鲤去世之时，是有棺无椁的，因为按照礼制，他是不能用椁的，只能用棺。他最心爱的，最得意的弟子——颜回去世之时，颜回的父亲来请求孔夫子，卖掉自己的马车，让颜回可以有椁。颜回离世之时，孔夫子是非常悲痛的，甚至感叹说“天丧我！天丧我！”但是孔夫子依然没有卖掉自己的马车。</span></p><p><span>孔夫子讲，按照礼制我是做大夫的人，做过大夫的人，是不能卖掉自己的马车而步行的。所以，颜回他虽然是我心爱的学生，但是也不可以有椁，我自己的儿子离世，他也是没有椁的。以此我们就可以看到，孔夫子他不为情所牵绊，他只看当下的形势可不可以这样去做，如果按礼制可以做则做，不可以做则不做。</span></p><p><span>所以我们可以看孔夫子的境界，可以仕则仕，可以止则止，就是因为他不被情所牵绊，他心中所想的都是大仁、大义、大忠，他的东西大，就区别了小。</span></p><p><span>我们讲伯夷的忠，他是小忠，忠于自己过去的君主，但是已经改朝换代了，并且新上任的君主武王，他是为了天下百姓的，如果能舍弃那个小忠，不被小忠所牵绊，他是可以去做更多事情的。</span></p><p><span>我们在《论语》当中有讲过，孔夫子赞叹管仲，是因为管仲看到的是大仁大义，他并没有因为自己辅佐的公子纠离世，而自己也选择自杀。而是选择辅佐齐桓公，因为他想的是齐国的百姓，甚至是天下的百姓，这就是大仁大义。</span></p><p><span>我们回过来再看孔夫子的境界，可以仕则仕，可以止则止，可以久则久，可以速则速。就是因为他不会沉浸在任何情之中。孔夫子讲仁、讲义，但是却不被仁和义所牵绊；讲忠、讲信，却不被忠和信所牵绊。这是我们有了忠信、仁爱的基础之上，还能不被这些牵绊，是一种极高的境界。</span></p><p><span>所以，孟子讲到孔夫子，是非常地赞叹和认同的，说像孔子这样的人，我是达不到的，并且生民未有，自从有人类以来，没有达到孔子这样境界和这么大贡献的人。</span></p><p><span>但是，我们向往孔夫子这样的境界，我们要明白其中的道理，一个人要有情有义，但是你又不能被情义所牵绊，这是一种修为，这是一种境界。</span></p><p><span>伯夷和伊尹都是古之圣贤，都是值得我们学习和效法的。但是孔夫子他具备了更高的境界和修为。所以，孟子讲伊尹和伯夷所做的事情，我是达不到的，但是如果非问我心中所愿，我想学习的是孔子这样的人，所以，孔子的境界虽然极难达到，但是我们也可以去学习。</span></p><p><span>一个人要学习忠信，要有情有义，但是还能不被情所牵绊，不被自己的欲望所牵绊，不因为身边亲近的人，而破坏了自己心中的仁义、道德，这个时候，才能可进可退，可行可止。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-12 生民未有",
    "date": "2022-09-22",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上②-12 生民未有</strong></span></p><p><span><strong>“伯夷、伊尹于孔子，若是班乎？”曰：“否。自有生民以来，未有孔子也！”曰：“然则有同与？”曰：“有。得百里之地而君之，皆能以朝诸侯，有天下；行一不义，杀一不辜，而得天下，皆不为也。是则同。”曰：“敢问其所以异？”“曰：“宰我、子贡、有若，智足以知圣人；汙不至阿其所好。 宰我曰：‘以予观于夫子，贤于尧舜远矣。’”</strong></span></p><p><span><strong>伯夷、伊尹于孔子，若是班乎？</strong>我们看这个“班”字，同等、类似、一样，公孙丑问孟子说：“伯夷、伊尹，对比于孔子，他们三个是同等的人吗？是相似的人吗？”</span></p><p><span>为什么会有此一问呢？我们在上一节课程当中讲过，说伯夷不知进，伊尹不知退，孔子是可进可退，进退自如之人。但是孟子又讲：“皆古之圣人也。”说这三位都是古之圣人，只是不同道，每个人的处事风格各不相同而已。</span></p><p><span>这个时候公孙丑又问，他们是同样的人吗？</span></p><p><span>孟子回答，<strong>曰：否。</strong>不一样。<strong>自有生民以来，未有孔子也！</strong>自从有人类以来没有像孔子这样的人。我们可以看到孟子对于孔子是极其推崇的，他认为自有人类以来，是没有人可以像孔子一样的，也就是没有和他同等的人。</span></p><p><span><strong>曰：然则有同与？</strong>公孙丑继续问了，既然他们不是同类人，那有没有相同的地方呢？</span></p><p><span>我们看这句话问得很有智慧，深入灵魂。为什么会这么讲呢？看看我们平时的思维，总想问那个不同点。比如说，我们可能会问孔子与他们有哪些不同，他的优点在什么地方，就是我们的关注点总是在最好的，最优秀的那个人身上。</span></p><p><span>比如说，我们去找一个工作，总想去找一个最好的工作；我们想去了解一个事物，总想去看那个最好的；比如说，我们想学习，我们总想问谁是在这方面最优秀的，最好的那个，我们向他学习。我们总是想看不同点，但我们看公孙丑的思维很有意思，他说，他们相同的地方在哪里呢？他们相同的地方也就是古之圣人共同的特点，而不是不同的地方。</span></p><p><span>孔子的不同的地方是没有人可以达到的，这是孟子的思想，说孔子这样的人如果你去找他身上那个优于别人的地方，那个不同，自有人类以来是没有的。所以公孙丑这个时候，就反过来问了伯夷和伊尹，既然也能称为圣人，他们和孔子身上的共同点，相同之处在什么地方？</span></p><p><span>我们再换一种思维，比如说，在生活当中有很多事业有成的人，我们可以去了解这些事业有成的人，身上的共同点是什么。比如说，是不是有担当的？是不是有德行的？是不是有创造力的？就是我们找到共同点，我们就可以向他去学习，而不是找到他那个不同点。</span></p><p><span>他身上优于别人的地方可能是他的天赋，不是我们轻易可以达到的，就是我们总是急于求成，想向最优秀的那个人，直接去学习他身上的特点，但实则这个方式并不太正确，我们要先去学习绝大多数成功人身上的共同点。</span></p><p><span>当我们有共同点，我们再向不同的地方再去出发。比如说，我们想直接像孔子这样，这是很难的，但是，我们先可以学习像伯夷和伊尹这样的人，既然可以成为圣人，我们先达到他们身上的境界，这个时候，我们才可以再上一步。所以，我们看公孙丑的这种思维，其实更适合绝大多数人去思考。</span></p><p><span>我们接下来看他们身上的共同之处有哪些呢？</span></p><p><span><strong>曰：有。</strong>孟子说，他们身上有共同点，我们看看都哪里相同？</span></p><p><span><strong>得百里之地而君之，皆能以朝诸侯，有天下。</strong>如果给他们方圆百里的土地，而君之，让他们来做君主，都可以让诸侯来朝，并且可以统一整个天下。我们看这一句话，说他们三位都有一个共同的特点，就是能力加德行，给他们方圆百里的土地，他们是有能力和德行让诸侯来朝，可以一统天下的。</span></p><p><span>我们去看，齐国有土地方圆千里，但是这里又举了个例子，说伯夷、伊尹和孔子的德行以及能力，都足以让他们统一整个天下，以实行王道。也就是这三位，他们的德行的根基是一样的，他们可以实行王道的能力是一样的。</span></p><p><span><strong>行一不义，杀一不辜，而得天下，皆不为也。</strong>如果让他们去做一件不义之事，杀一个无辜之人，而拥有天下，皆不为也。他们三位都不会去做这样的事情，我们看，说第二个共同点，就是他们的道德底线是相同的。</span></p><p><span>说的第一点是德行和能力，给他们方圆百里，是有足够的德行和能力让天下诸侯来朝，进而实行王道统一天下。那么第二个相同点，就是他们的道德底线相同，即使是拥有整个天下，但是如果做了一件不合于义的，杀了一个无辜之人，都不会去为的，不会触碰到那个道德底线。</span></p><p><span><strong>是则同。</strong>讲了两点相同的地方，我们这个时候又不禁要去思考了，既然这三位古之圣人，他们的道德基础，他们的能力是相同的，他们的道德底线也是相同的，不会去做不义和杀害无辜的事情，即使得了天下也绝不为。既然有这么多相同的地方，但是孟子又讲伯夷和伊尹，是没有办法和孔子相提并论，相比较的。因为孔子自生民以来，未有像他这样的人。</span></p><p><span>这个时候，我们就要继续想，有了这个相同的德行和能力，以及底线为基础，他们的不同点到底在什么地方？</span></p><p><span>我们看看孟子是怎么看待的。<strong>曰：敢问其所以异？</strong>公孙丑问了，敢问他们有什么不同的地方呢？我们去想有谁是更了解孔子的？是不是他身边的学生？他身边有智慧的学生会更加地了解孔子。所以，孟子接下来引用孔夫子身边的三位学生，他们对于孔夫子的看法，我们才能更加清楚地去了解，为什么孔夫子是很伟大的，生民未有。</span></p><p><span><strong>曰：宰我、子贡、有若，智足以知圣人。</strong>孟子讲宰我，子贡和有若这三个人，他们的智慧足以去了解和辨别圣人。</span></p><p><span><strong>汙不至阿其所好。</strong>即使他们讲话夸大、夸张，也绝不至于谄媚，投其所好。这句话在讲什么呢？</span></p><p><span>因为孔夫子是宰我、子贡、有若的老师，但是这三位学生都是智者，他们的智慧足以去了解和辨别一位圣人，他们即使说话有夸张，也绝不可能是谄媚的，无缘无故地去说自己的老师有多好。所以，首先对宰我、子贡、有若是肯定的，他们的智慧是足够了解圣人的，并且他们讲话绝不会阿其所好，也就是他们讲的话一定是真实的。</span></p><p><span>我们看他们是如何评价孔夫子的？<strong>宰我曰：以予观于夫子，贤于尧舜远矣。</strong>宰我讲了一句话，以我来观察夫子，要远远贤于尧舜。</span></p><p><span>我们学过《论语》，学过《孟子》都会知道，孔夫子是赞叹尧舜的，尧舜可以禅让天下，不为一己私利，并且为百姓做了很多事情。比如说去开集市，可以方便百姓去做贸易。比如说，制定了很多文化礼仪，做了很多利民的事情，并且是以仁德治天下的。舜是以孝著称的，他们为百姓做了很多事情，利益了很多当时的百姓。</span></p><p><span>但是这里宰我却说，孔夫子要远远贤于尧舜，为什么呢？</span></p><p><span>我们来思考这个话题，从我们现在两千五百年之后，我们来看尧舜固然伟大，但是更多地，他利益的是他同时代的那些百姓，对于两千五百年以后的我们，好像我们受到的益处，并不是那么多。</span></p><p><span>但是孔子则不同，因为有了孔子，我们才有了文化的传承，我们今天才可以学习到四书五经，今天我们的祖国才可以被称为礼仪之邦，这些都是源于孔子的贡献。我们去读整个从春秋以后的历史，读书人都是以孔子为楷模的，读书人从小就要立志的，这个志从哪里来呢？从孔夫子的思想当中来。所以，孔夫子的思想流传了两千五百年，我们相信再下去几千年，依然会有人学习孔子的思想，这就是他的贡献。</span></p><p><span>所以孟子才会讲孔子这样的人，自有人类以来，是没有出现过的，没有人可以比孔子更伟大，就是因为他对后世的贡献，价值和影响是极其深远的。</span></p><p><span>我们回头再来体会伯夷和伊尹，虽然也是古之圣人，他们有自己的品德，他们有自己的中正，但是，我们现在并没有受到伯夷和伊尹的益处，伊尹已经做到了一个国家的一人之下，万人之上，也并没有对我们后世的人影响像孔子这样深远。</span></p><p><span>所以，这也是孟子一生为学，而没有为官的原因之所在，因为他是想要效法孔子的，他想要学习孔子，让自己一生主张的思想，可以流传到后世，它的影响会变得更加深远。后来我们讲孔孟之道，把孟子和孔子放在了同等的地位，因为他们做的是一样的事情，所以宰我才讲，孔子要远远的贤于尧舜，就是因为他对后世的贡献，价值和影响，更大、更深远。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ②-13 出类拔萃",
    "date": "2022-09-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ②-13 出类拔萃</strong></span></p><p><span><strong>子贡曰：‘见其礼而知其政，闻其乐而知其德，由百世之后，等百世之王，莫之能违也。自生民以来，未有夫子也！’有若曰：‘其惟民哉？麒麟之于走兽，凤凰之于飞鸟，泰山之于丘垤，河海之于行潦，类也。圣人之于民，亦类也；出于其类，拔乎其萃，自生民以来，未有盛于孔子也！’</strong></span></p><p><strong><span>子贡曰：‘见其礼而知其政，闻其乐而知其德。</span></strong><span>看见一个国家的礼仪，就可以知道他的政治；听到一个国家的音乐，就可以看到他的德行，看到这里的风气。</span></p><p><strong><span>由百世之后，等百世之王，莫之能违也。</span></strong><span>我们先看这里的等，就是评价，来自于后世的，或者叫历史的评价，这个称之为等。我们再看这句话的意思，即使一百代以后，他的评价出来了，也并不会违背这个道理。</span></p><p><span>什么意思？他在讲孔夫子留下了一个思维体系。什么思维体系？见其礼而知其政，闻其乐而知其德，这个道理。即使过了一百代君王，也没有违背的。</span></p><p><span>所以讲，孔夫子留下的这种思维体系，它是可以一直流传下去的，没有可以违背这个道理的时候。我们去看一个国家，你看到他有没有礼，你就知道他是如何为政的；你听他的乐，你就知道这个国家有没有德行。</span></p><p><span>以前的乐，是用《诗经》的内容为词，所以《诗经》都是讲美好的东西，都是讲有德行的东西，都是讲仁爱。如果这个国家的乐是淫词，淫是过度的意思，如果是淫词，过度享乐的，你就知道这个国家不重视品德。所以，他讲的规律，后世是没有办法违背的。</span></p><p><span>我们现在也是如此，我们如何分辨一个人是好，还是不好呢？</span></p><p><span>我们通过言行貌好。我们去看这个人所讲的话，他讲的话是不是正义的，是不是歪理，符不符合仁、义、礼、智、信；我们再看他的行为，他的行为是否懂得为别人着想的，是否是仁爱他人的；我们再看他呈现出来的状态样子，我们再看他的喜好，我们通过言、行、貌、好，就可以看到一个人内在有什么。</span></p><p><span>举个例子，我们去看一个人有没有德行，我们可以通过他的行为，可以通过他的言语。我们看到一个人是否孝顺，我们可以通过他的行为，是否孝顺父母，我们可以通过他的言语，平时对于父母这件事情，他是如何讲的。</span></p><p><span>我们看一个员工是否可以用，我们看他有没有敬畏之心，对公司的领导，对自己所做的事情，对自己在的企业，是不是有敬畏的。我们接下来再看他这个人，是否可以忠于自己所做的事情。我们还要看这个人是否有德行，他做的事情是否想着为这个企业，为他的客户创造价值，我们就知道这个员工可不可以用。</span></p><p><span>我们想谈一段恋爱，也是一样的。我们经常讲，你要看他的人品是否是正的，你要看他是如何对待他人的，你要看这个人是否是忠贞的。</span></p><p><span>这些思维体系从哪里来？</span></p><p><span>从孔夫子的思维当中来。因为孔夫子讲了仁、义、礼、智、信，讲了儒家学说，所以，我们现在才有了观察事物的思想，才有了观察事物的角度，这就是子贡说的孔子伟大的地方。</span></p><p><span>那个时候，因为国家主要的事情是政事，所以到每一个国家，你看他是否注重礼，你就知道他的政事；看他是否注重乐，你就知道他是什么样的品德，国家是什么样的风气。</span></p><p><span>演变到了现在，我们所能应用的部分，就会变得更广泛。我们去观察一个国家，去观察一个企业，去观察一个人，我们都可以通过礼乐，都可以通过孔子所讲的仁、义、礼、智、信、忠、孝、敬，这些去观察。所以，这就是规律，而这种规律，源于孔子的这种文化体系。</span></p><p><strong><span>自生民以来，未有夫子也！</span></strong><span>子贡说了，自有人类以来，没有像夫子这样的人，没有一个人可以像孔子的贡献和价值那么深远，没有人像孔子一样，可以建立一套思想体系，影响后世百代君王之后，我们现在来看，他可以影响数千年。</span></p><p><span>这就是宰我和子贡，还有孟子赞叹孔子的地方，说他的贤德，远远要贤于尧舜的；说他的德行，是生民以来未有过的。从来没有一个人像孔子这样，对后世影响那么深远。</span></p><p><span>他所建立的思想，他所推行的礼仪，上可以影响到一位国君治理国家，中可以影响到一个朝代的读书人，这些大臣，他们都是用儒家的文化去治国的，下可以影响到每一位百姓的安身立命。</span></p><p><strong><span>有若曰：其惟民哉？</span></strong><span>这里的民，指的是百姓，我们再翻译过来，指的是人，说岂止是人这样啊？</span></p><p><span>接下来开始举例子了，<strong>麒麟之于走兽。</strong>麒麟是走兽的一种，但是它却远远优于其他的走兽。</span></p><p><strong><span>凤凰之于飞鸟。</span></strong><span>凤凰也是鸟类的，但是它跟其他的鸟类既相同，也不相同。</span></p><p><strong><span>泰山之于丘垤。</span></strong><span>丘垤，指的是土丘，小土堆。泰山对于小土堆来讲，它虽然是山，但是远远高于普通的小土堆。</span></p><p><strong><span>河海之于行潦。</span></strong><span>行潦，指的是水洼，小水沟。河海与小水沟，类也。我们刚才所讲到的都是同类，比如说麒麟与走兽，凤凰与飞鸟，泰山与丘垤，河海与行潦，他们都是同类，但是又远远高出同类。</span></p><p><strong><span>圣人之于民，亦类也。</span></strong><span>圣人与百姓而言，也是同类。</span></p><p><strong><span>出于其类，拔乎其萃。</span></strong><span>说圣人跟人是同类，一样的。但是却出于其类，拔乎其萃。我们所熟知的成语——出类拔萃。圣人也是人，但是他要远远超出人很大一部分，就像凤凰对于飞鸟，麒麟对于走兽，泰山对于丘垤，河海对于行潦，是一样的。</span></p><p><span>我们说泰山它也是山，但是泰山所承载的高度和它的地位，是远远高于一般的丘垤的；我们说凤凰它也是飞鸟的一种，但是它要远远高过其他的飞鸟。所以用来形容孔子，他虽然也是人类，但是他的贡献、他的价值、他的德行、他的光芒、他的思想和境界，是远远的高出人类的，出类拔萃。</span></p><p><strong><span>自生民以来，未有盛于孔子也！</span></strong><span>说自从有人类以来，没有像孔子这样伟大的人。</span></p><p><span>我们再来回顾有若所讲的第一句话，其惟民哉？岂止是人类？有若在讲，自从有万物以来，就没有哪一个万物，或者哪一个人，比孔子更加伟大的。</span></p><p><span>那我们再来看,孔夫子身边的三位学生，对于孔夫子的评价和赞叹：宰我讲，远远贤于尧舜；子贡讲，生民以来都没有像夫子这样的人；有若讲，止是民哉，没有什么是比孔子更伟大的，未有盛于孔子也。</span></p><p><span>我们看孟子把有若、子贡、和宰我，对于孔子的评价放在这里，就说明孟子也是这样认为的，所以，当公孙丑问到伯夷、伊尹和孔子是不是同等的人，孟子讲，不是的，没有人可以跟孔子同等来比较，自生民以来就没有像孔子这样的人。</span></p><p><span>所以，我们说孟子是沿袭了孔子的思想，去讲仁政，去讲爱民，去讲浩然之气。所以一生都在以孔子为榜样，故而带着学生们周游列国二十年，去推行自己的仁政思想，去讲儒家的文化，去效仿尧舜禹。</span></p><p><span>我们再来作一个总结，一个人最大的贡献和价值到底是什么？</span></p><p><span>如果我们学习了这一篇文章，我们知道了一个人最大的价值，是有自己的思想，有自己的文化体系，并且可以用这种思想，这种价值观，影响身边更多的人，可以去传承后世。之所以说孔子生民以来未有，就是因为他的思想、贡献和价值，它是源远流长的，影响着数千年。</span></p><p><span>我们现在也是一样的，说我们想帮助一个人，给他物质上的东西比较容易。我们给一个人一份工作，给一个人买一些好吃的东西，好用的东西，这个比较容易，但是更难的在于，改变一个人的思想，救赎一个人的灵魂，是让他可以拔出那种痛苦，让他可以更好地去面对生活。</span></p><p><span>一个人没有能力工作，那更难得的是，你帮助他如何更好地工作，而不是给他一份工作，这并不能真正地解决他的问题。</span></p><p><span>所以，我们经常说儒家文化伟大，伟大就伟大在，可以改变一个人的思想，可以扭转一个人的价值观，可以救赎一个人的灵魂，所以，这才是对后世更大的价值。</span></p><p><span>儒家提倡内圣外王，讲三不朽：立德、立功、立言。立德，就是你做有德行的事情；立功，就是你的这件事情是起到了效果的；最后要立言，因为你在立德和立功之后，你所讲的言是有德行的，并且是有效用的，有结果的，讲的是真理。</span></p><p><span>这个时候，你要立言，因为你的这种言语它是正确的，道理是经过你自己用德行，用亲身去实践的，然后用它帮助别人，才会有功。这个时候，你讲的言语是可以给别人指明道路的，可以改变别人的思想，改变别人的价值观，救赎一个人的灵魂。</span></p><p><span>所以，我们知道孔孟之所以伟大，就是他们在做着改变他人思想的事情。正如我们今天，还在学习孔子，还在学习孟子，学习孔孟之道，这两位圣人数千年以后，还在影响着我们，所以，他们的价值和贡献是无限的，再过去几千年，它还在影响着几千年之后的人们。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ③-1 以力假仁者",
    "date": "2022-09-28",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上<span>③</span>-1 以力假仁者</span></strong></p><p><span><strong>孟子曰：“以力假仁者霸，霸必有大国。以德行仁者王，王不待大；汤以七十里，文王以百里。以力服人者，非心服也，力不赡也。”</strong></span></p><p><span>我们先来思考一个问题，如何才能做成一件事情？我们通常会想，做成一件事情一定是需要实力的，实力又分为内在的和外在的：内在的实力，就是我们自己的能力有多强，有什么样的天赋，有什么样的优点，或者说具备了什么样的技能；外在的实力，通常讲，我有多少财富，我有没有资金，我有多少人脉，这些称为外在的实力。</span></p><p><span>这是我们大多数人的想法，认为做成一件事情，只要有实力就可以了，我自己有能力，并且有一些人际关系，有一些财富，有一些资金，可以支撑我去做这件事情，我就可以把一件事情做成。我们说，想要做成一件小事情，有这个实力就够了，但是想要做成大的事情，绝不是靠自己的实力就可以的。</span></p><p><span>我们经常听到一句话：小事靠财，大事靠德。小事情，我们有一些财富，靠着我们自己的努力，靠着我们有一些实力，就可以做成；但是，如果要做成一件大的事情，一定是靠德行的，只有我们有德行，才能把一件事情做大，并且把一件事情做得更长久。</span></p><p><span>一件事情做大，绝非一人之功，不是说我们自己有多强的能力，有多好的人脉，多大的财富，就可以把它做大的。要想一件事情做大和做长久，是有很多人愿意跟我们在一起，有很多人愿意来帮助我们去做这件事情，它才可能变大，才可能变得更长久。</span></p><p><span>所以说，要做成一件大的事情，长久的事情，是要靠德行来支撑的。</span></p><p><span>我们接下来进入孟子所讲的内容，<strong>孟子曰：以力假仁者霸，霸必有大国。</strong>我们先看这个力，力就是刚才我们所讲的实力，你可以把它翻译成武力，总而言之就是有足够强的力量，有实力。以力假仁者霸，我有足够的实力，但是我假借仁义之名，这个称之为霸。</span></p><p><span>我们来体会这句话，在生活当中，我们经常可以看到这类事情的发生。比如说，我们在做父母之时，我们是处上位的，我们用自己的力量来要求孩子，你必须听我的，我这是为了你好，这就叫以力假仁者。</span></p><p><span>我们并不是用仁德的角度去出发，用仁德的态度去教育孩子，而是靠我们的力量，因为我是你的父亲，或者因为我是你的母亲，因为我是赚钱的，因为我养着你的生活和你上学，这就叫以力假仁者霸。我们看上去父母是强势的，是霸道的。</span></p><p><span>再比如说，夫妻之间也是一样的，如果有一个人的事业比较好，而另一个人在家里并没有什么工作，可能在家里带孩子，在家里做一些家务，这个时候，我们就会认为赚钱的一方，我们是有力量的，我们是有实力的，所以，我们这个时候呈现出来的就是强势的，就是霸道的。</span></p><p><span>再比如说，在一个企业当中，做领导也是如此，因为我是领导，或者因为我是老板，我给你发工资，所以，你就必须要听我的话，这就叫以力假仁者。我们会说老板很强势，领导很霸道。</span></p><p><span>霸必有大国。有这种霸，你必须要具备大国的条件。我们去看春秋和战国时期，齐国、晋国、楚国，这都是在春秋称霸的国家，称霸靠的是什么？是齐国、晋国和楚国本来就强大，只有你更强大，所以你才能去称霸。但是称霸这件事情并不能长久，你也没有办法让天下人都来归顺，因为你靠的是实力，靠的是武力，而不是靠的仁德。</span></p><p><span>但是我们反观，我们去看商汤，我们去看大禹，我们去看周文王，周武王，靠的是仁德，仁德再加上实力，一件事情才可以做大，才可以做得更长久。</span></p><p><span>我们在生活当中也要学会这个道理，比如说我们是做领导的，本来就是处上位的，如果这个时候，我们有自己的实力，再加上自己的德行，别人才会诚心诚意地愿意和我们在一起做事情，这种力量它是由内心所生发的，是不需要我们去管理和要求的。如果我们只是去管理和要求，我们靠的是力，而这种力只会让别人表面上是顺从的，但是从内在，它并不会生发力量。</span></p><p><strong><span>以德行仁者王，王不待大。</span></strong><span>如果我们以德行，去做仁德的事情，去做仁义的事情，就可以称王于天下。王不待大，如果我们是称王天下，就不需要你具备大国的条件。</span></p><p><span>这句话很重要，孟子在教给我们一个道理：如何才能以小博大。</span></p><p><span>比如说一个人，我现在即使什么都没有，没有人关心我，没有感情，没有事业，没有工作，一无所有，但是，如果我们懂得这个道理，我们就可以以小博大，可以从无到有。</span></p><p><span>我们先要做的第一件事情，是积累自己的德行。没有人关心我，我就去主动地关心他人；我没有一个好的事业，我就先想着如何去帮助别人。我去想着如何去提升我自己的能力，当我有了一些能力以后，我不是去要求和强求他人，而是去行仁德之事，去多帮助他人。这个时候，你从小就会变大，从无就会变成有。</span></p><p><span>接下来，孟子举了两个例子，<strong>汤以七十里，文王以百里。</strong>商汤和周文王最后都是拥有了天下，商汤建立了商朝，文王建立了周朝，这两个人都是以小来博大的。汤只有土地七十里，而文王只有土地百里，但是他们行的却是仁德之事，是想着如何为百姓请命，帮助百姓过上更好的生活，所以，就会有更多的百姓愿意拥护，愿意追随他们这样的人，最后就会拥有了整个天下，这就是以小博大的过程。</span></p><p><span>但是，你要想称霸天下，一定是靠你自己的实力和武力，是暂时的一时之功，别人当下可能会认同你，但并不是发自内心的，一旦你的力量开始减弱，别人就会开始不服从，开始对抗，所以如何能大？如何能久？</span></p><p><span>你看看我们在家庭教育当中，也是同样的道理。如果我们是以力假仁者，我们不停地去要求这个孩子，我们以处他父母的位置来要求，或者强迫他做一些事情，因为他刚开始的力量小，他没有办法与之对抗，但是当他的力量足够大，孩子长大以后，到了他的青春期和叛逆期，这个时候，他就不再听从我们大人所讲的话，我们讲的道理，他是要顶撞的，因为他从内心开始就不服气。所以，我们一定要谨慎地对待这件事情。</span></p><p><span>无论生活当中的大事还是小事，都不要去做以力假仁者。比如说夫妻之间也是一样的，如果我们只是因为赚钱多，你就不停地去要求和苛责对方，那么当下他呈现出来的状态，有可能是顺从的，但是当有一天，他自己有能力出去赚钱的时候，你会发现我们之间就会形成对抗，就会形成对立，因为他的力量足够强大，他就一定会去反抗的。</span></p><p><span>我们对待员工也是如此，如果我们只是因为自己处上位，而去要求他，如果我们只是以给他发工资为由，这都是以力假仁者。当有别人给他更高的工资，当他在这个地方，不想再这样工作，不想再受压迫之时，他就一定会离开，所以，这件事情是不会长久的。</span></p><p><span>我们接下来看孟子作的总结：<strong>以力服人者，非心服也，力不赡也。</strong>赡，是足够的意思；不赡，就是不够、不足。我们以武力或者以实力去役使他人，他不是发自内心的顺服，只是他自己的力量不够而已。</span></p><p><span>我们再回顾刚才我们举的几个例子，如果以力假仁地去对待你的孩子，他当下虽然是顺从的，但并不是心服，只是他现在的力量还不足以反抗。那我们去对待感情，对待员工，对待朋友，都是一样的。</span></p><p><span>包括如果我们的生意做得很大，我们这样去对待我们的客户也是如此，他当下可能没有更好的办法，是因为他当下的力量还不够，所以，看似他当下是服从的，并不是从内心生发的，当他有一天力量足够大，他就会起来对抗。所以，我们去做这样的事情，从长久来看，没有任何的意义。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ③-2 心悦诚服",
    "date": "2022-09-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上3-2 心悦诚服</strong></span></p><p><span><strong>以德服人者，中心悦而诚服也，如七十子之服孔子也。《诗》云：‘自西自东，自南自北，无思不服。’</strong></span></p><p><span>接下来又举了一个相反的例子，刚才举的例子是以力服人者，他当下看似的顺从，是因为他没有足够的力量。</span></p><p><span><strong>以德服人者，中心悦而诚服也。</strong>中是助词，表示他内心真的是真心的，诚心的顺从我们。</span></p><p><span><strong>如七十子之服孔子也。</strong>七十子，指的是孔夫子的门人弟子，孔夫子弟子三千，七十二圣贤，</span></p><p><span>所以，这里指七十多人是诚心的顺服于孔子的。</span></p><p><span>为什么会诚心顺服于孔子呢？因为孔子的德行。我们去想孔夫子的一生，他并不是顺利的，曾经为官，做到过大司寇，代理相事，但是并不能实现自己的政治主张，所以开始十四年的周游列国，在这个过程当中经历了很多苦难，甚至是生命的危机，受到困厄，但是依然有这么多的学生愿意跟随在他的身边，这就是德行。</span></p><p><span>如果是以力服人者，当你处在高位，当你当下更顺利，可能有人会愿意跟在你身边，但是你遇到困厄之时，你在最困难的时候，还有人愿意留在你身边，那就说明，这是你的德行。</span></p><p><span>所以，我们不妨来反思自己，如果我们自己遇到了困境，遇到了困难，还有多少人愿意跟在我们身边呢？这个时候，他都是摒弃了利，而是被我们自己的德行所吸引的，愿意留在我们身边。</span></p><p><span>我们再来看这句话，他首先讲了一个道理，告诉以德服人者，心悦诚服。我们去想，可能我们每个人身边，都会有心悦诚服的人，但是，我们去看数量有多少呢？</span></p><p><span>这里首先讲了孔子，因为孔子身边有这么多人，愿意心悦诚服地去跟随孔子，那就说明孔子的德行足够大。即使是以力服人者，是不是也会有心悦诚服的人呢？也会的，只不过数量的多与少。</span></p><p><span>我们讲，一个人可能再霸道，或者性格当中再有一些缺陷，他可能也真心诚意地对待身边的某个人，或者某些人是好的，这些人也可能会心悦诚服。但是，我们要把眼光放得更大一点，看看身边有多少人是愿意心悦诚服的，以检验我们自己的德行究竟有多大。</span></p><p><span>所以这段话总结过来，人有多少，时间有多长，如果跟随在你身边的人越多，跟随得越久，就说明德行更好一点。</span></p><p><span>我们反过来再看商汤和周文王，他们之所以拥有天下，就是因为他们的德行足够大，有更多的人愿意跟随在他们身边，所以，可以以小博大，以方圆七十里，方圆百里，最后可以拥有整个天下。</span></p><p><span>我们现在看到的齐国，有方圆千里，但齐国的君主都是在想着以力假仁，想去称霸天下，所以，孟子才会讲，这不是当下最好的出路。如果当下齐国能去实行王道，称王于天下，易如反掌，是非常简单的事情。</span></p><p><span>我们再去想，如果我们自己本身是有一定的实力的，我们有自己的能力特长，也有一些财富，有一些人脉，如果，这个时候再去行仁德之事，我们把一件事情做大，做长久，是易如反掌的事情。</span></p><p><span>但是，有的时候我们可能就会想，你说我两个条件，如果没有那么足怎么办？说我自己也没有那么强的实力，我可能也没有那么好的德行，所以，我们这里要去思考，到底是能力比较容易获得？还是德行比较容易获得？</span></p><p><span>比如说，我们现在没有钱，我们可以快速地有钱吗？好像不能；比如说我自己没有什么样的天赋，我可以快速地通过努力获得吗？好像也不能；比如说我出生在一个什么样的家庭，我的家庭就没有给我那么多的人脉和资源，我可以快速地获得吗？好像也不能。</span></p><p><span>那也就是，我们想要获得实力，是很困难的事情，它并不容易。而且我们自己也没有办法把握，没有办法掌控，我不能让我自己变成一个有钱人，我也不能现在去改变我的家世。但是有一件事情，比较容易获得，就是修德行，它是我自己可以把握的事情，我愿意去提升我自己，我愿意去帮助别人，这是我可以做主的事情。</span></p><p><span>《论语》当中孔子讲了一句话，非常经典和受用，“仁远乎哉？我欲仁，斯仁至矣。”</span></p><p><span>说仁这件事情，离我们很远吗？如果我想要仁，这就已经到达了。所以，我们想要获得德行这件事情，相对而言要容易得多，它不像实力，它是靠一些外在的因素，是我们没有办法掌控和快速获得的。但是仁德这件事情可以，只要我们想要去改变自己的当下，想要去让自己积累更多的德行，我就从当下做起，它可以以小博大，我虽然自己没有什么实力，但是我却可以通过自己的德行，最后把一件事情做大，把它做得更长久。</span></p><p><span>有了德行，我可以无中生有，从无到有。本来我是没有感情的，但是因为我有德行，我不停地去付出，那就会有人愿意来到我的身边；本来可能我是没有事业的，但是因为有了德行，我总想着去帮助别人，就会有更多的人愿意跟在我们的身边，从没有事业变成有事业。</span></p><p><span>所以，积累德行是一条捷径，帮助别人，是快速地可以成就自己最直接的方法，它比获得实力要更容易。</span></p><p><span>接下来孟子用《诗经》的一段话作为总结，这篇《诗经》来自于《大雅》，《大雅·文王有声》指的是文王有声望的意思，整个这篇《诗经》分为八章，前四章赞叹文王，建都于丰；后四章是赞叹武王建都于镐京。</span></p><p><span>这段时间引用的是后四章，也就是赞叹武王建都于镐京，<strong>《诗》云：自西自东，自南自北，无思不服。</strong>在这三句之前还有一句，叫镐京辟雍，镐京，是指的建都的这个地方。一开始辟雍是天子来行礼，奏乐的地方，比如说在这里朝见诸侯，比如说在这里祭祀天地；后来辟雍</span></p><p><span>又改成了天子教学的地方，天子要在这里讲学；再后来，又把它演变成了贵族的学生在这里学习的地方。</span></p><p><span>自从汉朝以后，历代都有辟雍，只不过辟雍它的功能性不一样，每个朝代它的用途也不一样，有的时候，用在这里祭祀，用在这里行礼，用在这里奏乐，有的天子会在这里讲学，还有的，用于贵族子弟在这里参加学习。</span></p><p><span>我们再来看《诗经》的这一句话，说武王在这个地方朝见诸侯，自西自东，自南自北，无思不服。在讲诸侯从四面八方来到这里，无一不是真心的，归服于武王的。此之谓也，讲的就是这件事情。</span></p><p><span>这里孟子讲的是什么事情：就是以德服人者，心悦诚服也。说武王当时所做的这件事情，在朝见诸侯，大家都是诚心思服的，讲的就是以德服人这件事情。</span></p><p><span>最后我们来总结这一讲课程，我们学到了什么。</span></p><p><span>首先，告诉我们想要做成一件事情，想让它变大、变久，我们要有实力加德行。但是，当我们没有实力之时，我们要如何尝试？修仁德，它更容易获得。所以，首先我们第一件事情要养德，要培养自己的德行，有了德行以后，有了第二件事情，可以以小博大，就像商汤，就像周文王，可以七十里以百里，最后称王于天下。</span></p><p><span>那么有了德行，还有第三件事情，可以从无到有，无论我们当下处在什么样的环境，我们想要感情也好，想让别人关心也好，我们想让自己的事业变得更成功，或者我们想让自己的工作变得更顺利，或者我想让他人跟随于我，想让我的人脉人际关系变得更好，我们都可以无中生有，前提是我们要养德。</span></p><p><span>我们有了德行，可以去以德行仁，去用我们的德行，帮助和滋养更多的人。当你帮助的人更多，就会有更多人愿意追随，可以从无到有，去实现我们的人生理想，实现我们的人生志向。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ④-1 仁则荣 不仁则辱",
    "date": "2022-10-14",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上</strong></span><strong>④-1 仁则</strong><strong>荣 不仁则辱</strong></p><p><span><strong>孟子曰：“仁则荣，不仁则辱。今恶辱而居不仁，是犹恶湿而居下也。如恶之，莫如贵德而尊士。贤者在位，能者在职，国家闲暇，及是时，明其政刑，虽大国必畏之矣。”</strong></span></p><p><span><strong>孟子曰：仁则荣，不仁则辱。</strong>这七个字孟子讲了一个定论，并且他是道的规律。</span></p><p><span>什么叫做规律呢？</span></p><p><span>是定律，它是真理，是正确的道理。</span></p><p><span>我们再来看这七个字，仁则荣，不仁则辱。当我们把这七个字作为自己的人生准则，我们做事情是有方向的，如果我们没有这个人生准则，我们做事情就失去了方向，不知道该往什么地方去努力。</span></p><p><span>何为仁则荣呢？</span></p><p><span>当我们做对别人好的事情，我们就会得到荣。荣通常我们用繁荣，欣欣向荣，来形容一件事情。或者形容一个人，那也就是荣是好的意思。不停地变好的过程，叫欣欣向荣，繁荣的景象。呈现出来那个结果，我们也称之为荣。</span></p><p><span>仁则荣，如果一个人内在是有仁的，外在是有德行的。我们一切都会向好的方向去发展，反之不仁则辱，如果一个人内心没有仁，外在的行为没有德行，最后我们自己就会去受辱，所以说这七个字它讲的是真理定论。</span></p><p><span>人生准则，我们要把这七个字听懂，并且要用这七个字践行到我们的生活当中去，我们的生活就会变得欣欣向荣。比如说，我们对待感情也是一样的，要想让感情变得荣，我们就要内心有仁，外在有德。我们去为对方去着想，为对方好，最后的结果就是荣的。</span></p><p><span>可是如果我们不仁，你不懂得去为对方着想，那么对方就不会懂得为你着想，为你去付出。最后的结果就会是辱，我们看辱是什么意思，我们说耻辱，但是辱不只是耻辱的意思，一切不好的东西，不顺的，不如意的，逆境，我们都称之为辱。</span></p><p><span>如果一个人是不仁的，我们不光会受到耻辱，比如说，我们对于感情不仁，那么他就会向不</span></p><p><span>好的方向去发展。比如说，我们去做一个企业的领导，如果你对你的员工不仁，对你的客户不仁，那就会向不好的方向去发展。</span></p><p><span>我们交朋友也是如此，如果你对朋友是好的，你懂得为朋友付出和着想，是仁的，结果你和朋友的关系，就会变得更好，这就是仁则荣。</span></p><p><span>所以无论我们是经营企业，我们做生意还是交朋友，亦或者是经营家庭都一样，我们都要遵循着这样的守则，准则，我们懂得用仁，那个结果自然就是荣的，是好的。如果是不仁呢？那个结果是辱的，会向着不好的方向去发展。</span></p><p><span>我们听上去这七个字非常简单，可是往往就是这么简单的道理，我们却不懂得在生活当中去践行，所以孟子接下来讲今天的人的现状。</span></p><p><span><strong>今恶辱而居不仁。</strong>说我们今天的人恶辱，我讨厌受辱，我讨厌事情呈现出来不好的结果，但是我却居不仁，我做的都是不仁的事情。</span></p><p><span><strong>是犹恶湿而居下也。</strong>这就相当于我们讨厌潮湿却住在低洼的地方，一个人如果讨厌潮湿的地方，你就不要住在低处，因为低处水多自然就会潮湿。如果一个人讨厌耻辱，讨厌不好的事情发生在自己身上，那就不要去做不仁的事情。</span></p><p><span><strong>如恶之，莫如贵德而尊士。</strong>恶之指的是如果讨厌耻辱，讨厌不好的事情发生。我们看孟子在周游列国的过程当中，与孟子对话的通常都是以君主为多，以士大夫居多，也就是这番话是讲给处上位的人听的，如果一个处上位的人，比如说，君主要讨厌耻辱的事情发生，那莫如贵德而尊士。</span></p><p><span>贵德是把德行看得重要，崇尚德行，尊士指的是尊重士人、读书人、有志之士，有才能的人。我们看这句话讲了德，也讲了才，一个处上位的人要想不受耻辱，要想把国家治理好，非常简单，首先要贵德，你要去看重那些有德行的人。而尊士，去尊重那些有志之士，有才能的人，这样你才能治理好一个国家。</span></p><p><span>不光是处上位的君主如此，我们对自己的要求也是如此，我们要想让自己远离耻辱，要想让自己的结果变得更好，不想让那些不好的事情发生在我们的身上，我们就要贵德而尊士。贵德是注重自己德行、修养，尊士是尊重那些有志之士，有才能的人。同时也是在让我们自己提升自己的才能，提升自己的志向，如此德才兼备，自然就远耻辱也。</span></p><p><strong><span>贤者在位，能者在职。</span></strong><span>当一个处上位的人懂得贵德而尊士，崇尚有德行的人，任用那些有才能的，有志向的人，就会把那些贤德的人放在该放的位置上，把有能力的人放在合适的岗位上。</span></p><p><span>但是这句话我们要放在一起理解，一个人的德行很重要，有了德行，还要有才能，告诉我们，首先要贵德，然后尊士，把那些贤德的人有仁德的人，放在高位上，放在合适的位置，然后再用他们自己身上的才能让他去做合适的事情。</span></p><p><span>所以是把德行排在第一位，把才能排在第二位，我们去看一个有德行的人，他有可能在某一方面是擅长的，可能在某些方面是不擅长的。所以我们先去看一个人是否有德行，如果这个人是有德行的，我们再去看他有什么样的才能，让他可以在什么地方得以发挥。</span></p><p><span>如果治理一个国家，贤德的人是在位的，有才能的人是在职的，每个人各司其职。接下来的国家就可以达到太平无事，无内忧，无外患，当我们自己解决了自己内部的内忧问题，整个国家是稳定的，外患自然也就会变少，或者说是有能力对抗外患的。</span></p><p><span>我们去做一个企业是一样的，首先我们第一步是要团结内部，我们每个重要岗位上，都是有德行的人，并且有德行的人可以把他的才能在合适的位置发挥作用，这个时候内部就是团结稳定的，当内部是团结稳定的，足可以抵挡一切外来的压力和环境。</span></p><p><strong><span>国家闲暇。</span></strong><span>这四个字是承上启下的，如果有德行的人，都在合适的位置，并且有才能的人都在固定的岗位上，发挥着职能，就会国家闲暇，这是承上。国家闲暇就会太平无事。</span></p><p><span>我们闲暇之后要做什么事情呢？</span></p><p><span>我们这里不妨先思考一下，有很多人在闲暇的时候，可能会无所事事，不知道做什么，或者是闲不住。但是一个处上位的人，如果把有德行的人，有才能的人，都可以各自很好的运转，接下来的闲暇无事的时候，就会去做另外一件事情。</span></p><p><span>我们看是什么事情呢？</span></p><p><strong><span>及是时，明其政刑。</span></strong><span>当国家闲暇之时这个时候明其政刑，政是政治，刑是刑法。当内部团结稳定，平安无事，那么这个时候就是要去修明政治，修明刑法。我们去看一个企业是不是如此？如果有德行的人都在合适的位置上，有才能的人得以发挥，这个时候相安无事。</span></p><p><span>我们要做什么呢？我们要去让自己内部得到完善和成长，比如说，内部还有哪些事情需要修正，还有哪些事情需要不停地去做出调整，让团队之间可以更好的合作。</span></p><p><span>对于我们个人也是一样的，我们个人如果在闲暇之时，我们要去做什么事情呢？我们要去做提升自我的事情。我们在闲暇之时去思考，如何可以让自己变得更好，比如说，我们可以去明德，可以去学习更多的知识，读更多的书。我们也可以去亲民，去帮助别人，我们也可以在闲暇之时团结自己的团队，让团队变得更和谐。</span></p><p><span>我们也可以在闲暇之时多陪伴自己的家人，让我们的家庭变得更和谐。我们也可以在闲暇之时，多跟朋友交流，促进我们和朋友之间的感情。我们也可以用闲暇之时，教育好我们的孩子，让我们的孩子有一个更良好的价值观。总而言之，我们在闲暇之时要做的事情，是提升自我，或者和身边的人的关系，感情变得更稳固。</span></p><p><strong><span>虽大国必畏之矣。</span></strong><span>如果一个处上位的君主，可以用有德行的人，用有才能的人，并且在闲暇之时，修明自己的政治和刑法，即使是大国，也会是有所畏惧的，不敢欺凌于你。</span></p><p><span>那对于一个人来讲，也是一样的，我们要注重自己的德行，并且要提升自己的才能，在闲暇之时，我们依然不要忘记去提升自己，以及维护好我们身边的关系。那么所有人都会是惧怕我们的，并不会轻易的敢于欺凌我们。</span></p><p><span>所以一个人，或者是一个国家，在闲暇之时，如果是自我放纵的，并不懂得去提升和强大自己，那么就很容易遭到他人的侵犯和他人的欺凌。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ④-2 未雨绸缪",
    "date": "2022-10-14",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ④-2未雨绸缪</strong></span></p><p><span><strong>《诗》云：‘迨天之未阴雨，彻彼桑土，绸缪牖户；今此下民，或敢侮予？’孔子曰：‘为此诗者，其知道乎！能治其国家，谁敢侮之？’今国家闲暇，及是时，般乐怠敖，是自求祸也。祸福无不自己求之者！《诗》云：‘永言配命，自求多福。’《太甲》曰：‘天作孽，犹可违；自作孽，不可活。’此之谓也。</strong></span></p><p><span>孟子引用的这篇《诗经》出自于《国风.豳风》,豳是周王朝的起源地。</span></p><p><span>我们接下来来了解这篇《诗经》讲了什么，这篇《诗经》的名字叫做《鸱鸮》，鸱鸮是一种鸟，类似于猫头鹰的一种鸟。这种鸟在古代被称为不祥之物，这篇《诗经》是拟人化，他以一个鸟的角度，告诉我们做人的道理。</span></p><p><span>鸱鸮把一只鸟的幼子叼走了，接下来就以这位母鸟的角度，是如何看待这件事情的，母鸟的孩子被鸱鸮所叼走，但是母鸟并没有消极和抱怨，它说鸱鸮叼走了我的孩子，但是我要积极努力地去坚固我的鸟窝，不会让它再来毁掉我的鸟窝。</span></p><p><span>我们看这首《诗经》，孟子引用的其中一段<strong>《诗》云：迨天之未阴雨。</strong>迨是趁着，趁着天还没有下雨。</span></p><p><strong><span>彻彼桑土，绸缪牖户。</span></strong><span>彻彼桑土，指的是剥取桑树的皮；牖是窗，户是门。趁着天还没有下雨，这个时候去剥取桑树上的皮，来巩固和修筑我鸟窝的门窗。</span></p><p><strong><span>今此下民，或敢侮予？</span></strong><span>下民指的是无礼之人，如果我们懂得像这只鸟一样，趁着天还没有下雨，我们去剥取桑树上的皮，加固自己的鸟窝，以后那些无礼之人，他还敢欺负于我吗？</span></p><p><span>所以我们看这只鸟，他的孩子被鸱鸮所叼走，但是他并没有变得消极，他反而变得更加积极。</span></p><p><span>说天还没有下雨，我就努力地去剥取桑树上的皮，去加固我的鸟窝，我看它以后还能来欺负我。</span></p><p><span>接下来开始讲了道理，今此下民，谁敢侮予？往后那些无礼的人，他们谁还敢欺负我呢？所以，他告诉了我们一个做人的道理，当我们遇到一些灾难，遇到一些逆境之时，我们这个时候不是消极面对，不是抱怨，而是积极地强大自己，像这只鸟一样，去让自己变得更有力量，去让自己变得更有德行，那么，以后那些无礼之人，他怎么敢再来欺负我？</span></p><p><strong><span>孔子曰：为此诗者，其知道乎！</span></strong><span>说作这首诗的人知道这首《诗经》，据说是周公所作，所以他从一个鸟的角度，其实讲的是做人的道理，讲的是治理国家的道理。</span></p><p><strong><span>能治其国家，谁敢侮之？</span></strong><span>一个人可以治理自己的国家，谁又敢来欺辱于我？整个这句话，告诉我们做人的道理，告诉我们治国的道理。无论我们处在什么样的阶段，都要懂得去提升和强大自己。</span></p><p><span>我们整个再来看这一段，首先孟子讲了一个定论，仁则荣，不仁则辱。如果你去做一个有仁德的人，做一些仁德之事，你的结果就会欣欣向荣，向着好的方向去发展；反之，如果做的是不仁的事情，那么结果就是受到耻辱，受到侮辱，一切结果都会向不好的方向去发展。</span></p><p><span>接下来又讲到，可是我们今天的人，我们讨厌耻辱，讨厌不好的事情发生在我身上，却居在不仁处，就像我们明明讨厌潮湿，却要住在低洼处。</span></p><p><span>如果一个处上位的人，讨厌耻辱，那么就要贵德而尊士，去崇尚有德行的人，去尊重有志之士，有才能的人，这样，贤德的人就会在位，有才能的人就会在职，如此，一个国家就会变得闲暇，相安无事，在相安无事之时，要去修正我们的政治与刑法，这样其他的国家就不敢来犯，他是畏惧的。</span></p><p><span>所以，对于一个人也是一样的，要想让自己变得欣欣向荣，结果是好的，我们就要懂得去重视自己的德，然后，提升自己的才能，并且在闲暇之时，要懂得去强大自己，并且跟自己身边的人维护好感情，这个时候，别人自然也是不敢来欺凌于我们的。</span></p><p><span>接下来孟子又引用了《诗经》，《诗经》这个角度又告诉我们一个道理，叫做未雨绸缪。当天还没有下雨的时候，我们要去巩固自己的家园，也就是告诉我们，在事情还没有坏到那种程度之前，我们要积极地去面对，我们要去勇敢地面对，我们要去强大我们自己，这样，那些无礼之人是不敢来欺负我们的。</span></p><p><span>孔子又去总结了这首《诗经》，说能讲出这样的道理，能做出这样的诗，说明他知“道”啊！所以是周公所作，告诉我们要未雨绸缪，无论发生什么事情，即使是那只鸟的孩子被鸱鸮所叼走，它依然在加固自己的家园，让自己有能力去对抗外在的环境，去对抗他人的欺凌。</span></p><p><span>所以，无论到什么时候，我们都要懂得去强大自己，在平时闲暇之时，我们要去提升自己，当我们遇到了一些逆境，遇到了生命当中的一些坎坷，我们同样要提升和强大自己。</span></p><p><span>可是今天孟子所看到的现状，却不是刚才《诗经》当中所描述的那个样子。</span></p><p><strong><span>今国家闲暇，及是时，般乐怠敖，是自求祸也。</span></strong><span>可是今天国家闲暇之时，人们在般乐怠敖。般乐，指的是追求享乐；怠，指的是倦怠、怠慢；敖，指的是游玩。现在国家闲暇，平安无事，这个时候却在追求享乐，怠慢政事，是自求祸也。这是给自己带来的祸患，而且是自求的。</span></p><p><span>我们去看这句话，当一个国家闲暇，平安无事之时，从君主乃至于士大夫，大家如果都在追求享乐，这不是自己给自己求祸吗？其他的国家，人家都在变法，都在图强，都在让自己变得更好，让百姓变得生活得更幸福。而我们如果还在追求这些享乐，那么将来祸患是会来到的。</span></p><p><span>用在我们现在，也是同样的道理，比如说，我们一个人如果在平时闲来无事，我们都在追求享乐，那么，将来是要有祸患发生在我们身上的。如果我们自己当下是顺境的，我们在顺境之时，在闲暇之余，如果不懂得居安思危，不懂得去提升自己，那么是要带来祸患的。</span></p><p><span>一个人遇到逆境也是如此，说我们现在不太顺利，有一些事情可能遇到了难关，如果这个时候，我们在追求享乐，在放纵自己，那么这也是自求祸也，会给自己带来更多的隐患。</span></p><p><strong><span>祸福无不自己求之者！</span></strong><span>所以告诉我们，福和祸都是自己求来的，如何求呢？如果我们懂得不</span></p><p><span>停地去提升自己，积极地去面对，让自己变得更有德行，让自己变得更有才能，这就是在自</span></p><p><span>求多福。可是，如果我们不懂得去提升自己，不懂得让自己去做仁德之事，如果追求的都是享乐懈怠，就是我们自己在给自己求祸。</span></p><p><strong><span>《诗》云：永言配命，自求多福。</span></strong><span>引用《诗经》当中《大雅》的第一篇，这首诗，前半部分是在赞美文王的德行，后半部分是在告诫周王室的后代，起到一个警示的作用。商朝为什么会灭亡呢？到了商纣王开始暴虐，开始对百姓不好，对百姓不好，不施仁政，这个时候，就等于是违背了天命，违背了道，当违背了道，自然就会带来灭亡，带来灾祸。</span></p><p><span>孟子在这里引用了八个字：永言配命，自求多福。永言配命，是讲永远顺着天道，顺着天命去做事情；自求多福，这就是在给自己求福。我们也可以用这八个字来警醒自己，如果想让自己多福，就去永言配命，我们要去顺着天道而为，顺着天命而为，这个时候，自然就是多福的；可是如果我们不懂得顺着天命，顺着天道，做的都是伤天害理之事，那么自求多祸。</span></p><p><strong><span>《太甲》曰：天作孽，犹可违；自作孽，不可活。<strong>此之谓也。</strong></span></strong><span>我们来看这句话：天作孽，犹可违。如果是老天带来的灾祸，是可以避开的；如果是自己带来的灾祸，是无论如何也没有办法躲开的。那什么叫做天作孽呢？不可抗衡的，不可抗拒的因素，叫天作孽。天作孽，犹可违，是可以避开的。</span></p><p><span>我们来举个例子，我们经常会讲一句话：叫屋漏偏逢连夜雨。那什么叫做天作孽呢？比如说，总是下连夜雨，这是天象，是不可抗拒的，但是犹可违。这个时候，我们只要把自己的房子修缮得更好，就是可以避开的。像那只鸟一样未雨绸缪，趁着天还没有下雨，这个时候我们去修缮自己的房子，让自己的房子变得更坚固，那么即使是下连夜雨，我也是可以躲开的。</span></p><p><span>天作孽的事情，不可抗衡的事情，我们通过个人的努力，是可以躲得开的；但是，自作孽不可活。我们自己如果给自己招来的灾祸，这个是没有办法避开的。我们还用刚才的例子，如果下的是连夜雨，那么我们还不懂得去修缮自己的房子，这个就是自作孽，不可活了，我们就没有办法躲开漏雨这样的结果。</span></p><p><span>其实整个这一段，孟子都在教给我们一个积极的意义，告诉我们，无论是处在逆境还是顺境，我们都要积极地去面对生活，都要积极地去努力，可以通过努力躲开很多的事情。我们如果懂得去追求仁德，懂得永言配命，就是自求多福；如果我们不仁，那么则辱，并且我们不懂得积极向上，不懂得去努力，就是自作孽，不可活。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑤-1 君主之仁政",
    "date": "2022-10-14",
    "html": "<div class=\"B1_text\"><p><span><strong><span>《孟子》公孙丑上 </span></strong><strong><span/></strong><strong>⑤-1</strong><strong><span>君主之仁政</span></strong></span></p><p><span><strong><span>孟子曰：尊贤使能，俊杰在位，则天下之士皆悦而愿立于其朝矣；市廛而不征，法而不廛，则天下之商，皆悦而愿藏于其市矣；关讥而不征，则天下之旅，皆悦而愿出于其路矣；耕者助而不税，则天下之农，皆悦而愿耕于其野矣。廛无夫里之布，则天下之民，皆悦而愿为之氓矣。</span></strong></span></p><p><span>上一节讲了一条定论 ：仁则荣 ，不仁则辱。这个仁就是懂得为他人去着想，为他人去付出。用什么样的方式去为他人付出呢？在不同的位置上，这个仁的体现方式也是有所不同的。</span></p><p><span>我们来举个例子，比如说坐在君主的位子，什么叫做仁呢？懂得为百姓着想，用合适的方式，百姓喜欢的方式，让百姓可以安居乐业，这个称为仁。有人就提出了孟子的思想，说孟子讲民重君轻。我们要注意这句话，民重君轻是对的。但这是站在君主的角度，所以以民为重。如果换个角度来思考，站在百姓的角度就要以国家为重，以君为重。</span></p><p><span>我们放到生活当中也是一样的，生活当中何谓仁呢？站在父母的角度，慈爱子女，让子女变得更好，为子女着想，这叫父母的仁。所以从父母的角度，是把孩子看得重，而把自己看得很轻。可是站在孩子的角度，这个仁就要有所变化。怎样去孝顺父母，懂得为父母着想，这是做子女的仁与孝。站在子女的角度，要把父母看得很重，把自己看得很轻。</span></p><p><span>我们在工作当中也是一样的，说一个企业的领导，要把员工和客户看得很重要，把自己看得很轻，这是作为企业领导的仁。但是作为员工，就不能把员工自己看得很重，而是要把领导和企业看得很重，把自己看轻。所以我们再回来看这句话，孟子讲民重君轻，这是站在君主的角度，但是我们要懂得去换位思考，没有什么事情是一成不变的，这个仁也就是懂得为对方，为他人去着想。用他人希望的方式，他人喜欢的方式，让他得到更多 这个称之为仁。仁则荣，不仁则辱。我们接下来看，站在君主的角度，要如何去实行仁政。</span></p><p><span><strong><span>孟子曰</span></strong><strong><span>：</span></strong><strong><span>尊贤使能</span></strong><strong><span>，</span></strong><strong><span>俊杰在位</span></strong><strong><span>。</span></strong><span>作为君主，什么叫做仁呢？首先要尊贤使能，尊重有贤德的人，使用有才能的人。尊贤使能放在一起，讲得是一个德才兼备之人。贤者是有德行的，能者是有才华的。作为一个君主，首先要做的第一件事情就是，尊重和使用那些德才兼备之人。让俊杰在位，俊杰就是指的德和才突出的人，杰出之人称之为俊杰。</span></span></p><p><span><strong><span>则天下之士皆悦而愿立于其朝矣</span></strong><strong><span>。</span></strong><span>如果一个君主是懂得实行仁政的，就会尊重和使用德才兼备之人。这个时候天下的读书人，有志之士，就会很高兴。并且愿意来这里的朝堂做事、任职。</span></span></p><p><span>孟子的这段话提出了五种人。第一种就是我们刚才所讲到的，为政和从政之人。如果一个君主是有仁德的，首先会尊重有德行并且有才能的读书人，有志之士。因为这些人是来到朝堂做事情，任职的。他们是可以帮助更多的百姓，帮助这个国家走得更远，做得更好；更多地可以利益民众的。</span></p><p><span><span>接下来又讲了第二种人，商人。</span><strong><span>市廛而不征</span></strong><strong><span>，</span></strong><strong><span>法而不廛</span></strong><strong><span>。</span></strong><span> 市指的是市场，廛指的是房屋居所。市廛放在一起，市场上的房屋，指的就是商铺；法是管理。商铺收了租金，就不要再去征税；收了管理的费用，就不要再去收房屋的租金。我们看这两句话很有意思，因为到了战国那个时期，连年征战，国家的税收就会变得很重。既让经商之人交市场管理的费用，还要去征收他的税，这个时候商人是不堪其重的，所以经商的人就会变得越来越少。</span></span></p><p><span><span>这里孟子讲了一个为君的仁道。如果一个为君者懂得去为经商之人考虑，费用只收其中一种就好了，这个时候商人是有利益的；只有商人有利益，才会让市场的货物便于流通。但是如果税负过重，导致商人不愿意来到这里经商，最后损失的还是国家的利益。如果一个仁君懂得把更多的利益让给商人，只收取其中的一种费用就可以。这个时候 ，</span><strong><span>则天下之商</span></strong><strong><span>，</span></strong><strong><span>皆悦而愿藏于其市矣</span></strong><strong><span>。</span></strong></span></p><p><span><span>接下来又讲到了，为君要去为他着想的第三种人，叫做旅人。</span><strong><span>关讥而不征</span></strong><strong><span>。</span></strong><span>关指的是关卡；讥指的是稽查。关卡只做一些检查，不要去征税。如果不做检查是不可以的，有可能带的东西是有危险的，或者是不利于这个国家的。关卡只对旅人稽查检查一些违禁物品，不要去征税。如果这样去做，就会利于旅人的流动。</span></span></p><p><span><span>如果总是征税，别人就不愿意来到这个国家。这个时候交流就会不方便，不方便所有的人在这里流动，那么这个国家就会变得封闭和保守，而且不能让更多的人去了解这个国家，就不会刺激一些相关的消费，文化的交流等等。如果可以做到只检查而不征税，</span><strong><span>则天下之旅</span></strong><strong><span>，</span></strong><strong><span>皆悦而愿出于其路矣</span></strong><strong><span>。</span></strong><span>这个时候天下的旅人都会很开心，并且愿意出现在这个国家的道路上。</span></span></p><p><span><span>这个时候要讲到，为君要去着想的第四种人，就是农民。</span><strong><span>耕者助而不税</span></strong><strong><span>。</span></strong><span>这里的助是帮助；税是交税。以前都是井田制，也就是一块田地分成一个井字形，就是九块。最中间的那一块是国家的，是要充公的，其他的八块是百姓来种的。这个时候种八块的百姓，帮助耕种井田制最中间的这一块，就是八助一，也就是让这些农民帮助耕种公家的这一块地，但是不要去征税。到战国这个时期，既要帮助国家种这九分之一，同时又要农民去交税。这个时候如果农民所交的税过多，百姓就不愿意去耕种，所以导致民不富，国不强。</span></span></p><p><span><span>这里也是在讲给为君之人的，如果你想要去实行仁政，你要懂得为农民去着想，农民更愿意去付出一些自己的力气，而不愿意去交更多的税。所以如果国家懂得为百姓去着想，让他们帮助耕种国家的土地，并且不再去额外征收他们的税。这个时候百姓，因为他自己得到的利益更多，所以就会加倍努力地去种田。</span><strong><span>则天下之农</span></strong><strong><span>，</span></strong><strong><span>皆悦而愿耕于其野矣</span></strong><strong><span>。</span></strong></span></p><p><span>如果一个国家，对于百姓来讲，只让他帮助耕种公家的田地，而且不另外收税。这个时候天下的百姓都是很开心的，并且愿意来到这里耕种田地，自然就可以吸引其他国家生活不幸福的百姓，来到这个国家。随着人口的增多，国家自然就会变得强大。</span></p><p><span><span>接下来讲到，要为对方考虑的第五种人。第五种人指的是外来人口 ，流动人口。</span><strong><span>廛无夫里之布</span></strong><span>，这里分为里布和夫布，里布指的是土地税；夫布指的是助耕税。外来的人口来到这个地方，你不要收他的土地税和助耕税。这个时候，外来人口才能在你这里得到好处，从而愿意来到这个国家。但是那个时候对于外来人口，并没有那么多仁政。既要他们交土地税，同时又要他们交助耕税，而且还要让他们去交更多额外的税。这个时候，就会导致外来人口不愿意来到这个国家。</span></span></p><p><span><span>这里孟子又提出了一个方法，廛无夫里之布。如果流动的外来人口来到这个地方，我们不要收他们的土地税，也不要收他们其他的税，而要分给他们土地，像这里原有的农民百姓一样，只要帮助公家种田，其他他自己的所得都归他自己。</span><strong><span>则天下之民</span></strong><strong><span>，</span></strong><strong><span>皆悦而愿为之氓矣</span></strong><strong><span>。</span></strong><span>这个氓指的就是外来的流动人员。如果一个国家可以这样去做，则天下的流动人口都是很开心的，自然愿意来到这个国家。</span></span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑤-2 无敌于天下",
    "date": "2022-10-14",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上⑤-2无敌于天下</strong></span></p><p><span><strong>信能行此五者，则邻国之民，仰之若父母矣。率其子弟，攻其父母，自生民以来，未有能济者也。如此，则无敌于天下；无敌于天下者，天吏也。然而不王者，未之有也。</strong></span></p><p><span>我们来总结孟子举例子当中所讲的五种人，第一种人，是为政，从政之人，那些读书人和有志之士；第二种人，是商人。每一种人他的所需是不同的，何为仁呢？就是懂得为对方着想，让对方得到他自己想要的东西。</span></p><p><span>为政、从政之人，那些读书和有志之士是希望可以展现自己的才能，并且让他们可以为更多的百姓去做事情，所以，为这些有志之士着想，让他们的才能得以发挥，这个时候，其他的有志之士自然会愿意来到这个国家。</span></p><p><span>对于第二种人——商人来讲，是想要赚取更多的利益，所以，对商人的仁，就是让他可以得到更多的利益，作为国家来讲，是尽可能地减少对他们的税收，自然天下的商人就愿意来到这里经商，因为他们会认为，这里的经商环境是好的，他们可以得到的更多。</span></p><p><span>第三种人，对于旅人来讲，只需要去检查他有没有什么样的危险，或者违禁的物品，其他的税收就不要去征收，这个时候，是有利于货物人员的流通，而天下的旅人都知道这个地方是有利于流通的，并且不会让他们付出更多的税收，则天下的旅人自然会愿意聚集在这里，人口的流动就会带来消费和繁荣。</span></p><p><span>那么对于第四种人——农民，就是让农民可以通过自己的努力，过上幸福安康的生活，可以去安居乐业。所以，孟子讲的仁道，你要懂得为农民去着想，让他们可以出一些力气，帮助国家来种田，但是不要收他们的税，这个时候，天下的农民都会很开心，当然会愿意生活在这片土地上。</span></p><p><span>对于第五种人——外来的流动人口，他们当然是希望我去到一个地方，可以分给我土地，并且没有那么重的税收，可以让自己的家庭解决温饱问题。</span></p><p><span>所以，孟子也只是列举了这五种人，告诉我们如何做到仁则荣，不仁则辱，给了一些具体的方法。但是，其实远远并不只有这五种人，还有更多的人。但是通过孟子列举的这五种人，我们知道了什么叫做仁，如何才能做到仁则荣。就是懂得为不同的群体去着想，只要你是为他着想的，是满足他的需求的，自然他就可以得到更多的好处，从而愿意留在这个国家。</span></p><p><span>我们在生活当中也是一样的，何为仁呢？无论我们在任何一个位置，都要懂得为别人去考虑。</span></p><p><span>举个例子，如果我们是做企业的领导，我们要为员工去考虑，要去为客户考虑，这就叫做仁；如果我们是一个员工，我们就要懂得为客户去考虑，懂得为领导去考虑，懂得为公司去考虑，这个就叫做仁；如果我们是做父母的，我们懂得为孩子去考虑，这就叫做仁；如果是做孩子的，做子女的，要懂得为做父母的去考虑，要懂得为其他的兄弟姐妹去考虑，让我们这些兄弟姐妹是和谐的，合乐的，对于父母来讲，这就叫做仁。</span></p><p><span>所以，在不同的位置上，我们这个仁的方式是不一样的，但是核心要点相同，如何为更多的人去考虑。</span></p><p><span>我们这里不禁要有一个疑问了，如果国家都去为别人考虑，收的税少了，那么国家要如何变得强大？这里面这个问题，是我们需要去改变我们过去固有的思维。</span></p><p><span>《论语》当中讲过这个道理，如果现在国家没有那么多的税收，我想把税收提高，是不是可以让国家变得更富强？举个例子，可不可以十抽二？十分抽两分给国家，国家的税收，是不是就变得更多了？</span></p><p><span>但实则并不是这样的，如果税收收的过多，就会导致农民不耕种，导致商人不经商，因为他们是没有利益的，所以他们不愿意去做，国家的税收反而会变少。可是如果要变成了十抽一呢？国家只要十分之一，这个时候，商人有利可图，他就会更愿意去经商，也会让更多的人想要去经商，虽然是十抽一，但最后得到的总和是多的。</span></p><p><span>对于百姓也是如此，如果税收过重，百姓就不愿意去耕种，最后地是荒的，国家收到的反而是少的；可是如果国家少收，就会有更多的人愿意去耕种，那么这个时候，国家收到的总和反而是多的。</span></p><p><span>其实我们在生活当中，也可以运用这个道理。比如说做生意，我们只想着把利润赚得更多，可是来的人会变得越来越少，最后我们得到的依然是少的；可是如果我们把利润放低，来的顾客会随之越来越多，所以看似是利润低了，但是最后看总和的时候，实则是利润高了。</span></p><p><span>所以，我们在生活当中，要懂得从这种仁德的角度出发，让别人得到更多的好处，看似我们有所失，但实则我们是有所得；如果不去行仁道，我们看似当下好像可以得到的更多，但是从长久来看，实则我们失去的会更多。</span></p><p><strong><span>信能行此五者，则邻国之民，仰之若父母矣。</span></strong><span>信，是指的确实；仰，指的是敬仰、仰望。如果可以做到孟子所讲的这五点，邻国的百姓就像仰望自己的父母一样。这里为什么要用父母来比喻？</span></p><p><span>我们去想想，通常父母的爱是无私的，并且是不要求任何回报的，是时刻都为子女去着想，为子女好的，如果为君之人懂得实行仁政，为自己的子民去着想，那么对于子民来讲，敬仰、仰望君主，就像看着自己的父母一样。</span></p><p><strong><span>率其子弟，攻其父母，自生民以来，未有能济者也。</span></strong><span>如果懂得为自己的百姓着想，那么其他邻国的百姓，就会像仰望自己的父母一样，这个时候，如果让他们率其子弟，攻其父母，那是没有的事情。</span></p><p><span>也就是邻国的百姓，既然是仰望这个国家的，像仰望自己的父母一样，即使是他们自己的国家，想让他们率其子弟，攻击你这个国家，自生民以来，未有能济者也，没有可以成功的。因为他们心之所向的，是你这个国家的仁政，是百姓生活的安居乐业，所以，他们只会心之所向，而不会来攻击。</span></p><p><strong><span>如此，则无敌于天下。</span></strong><span>如果可以做到这个样子，是天下无敌的，也就是仁者无敌。如果一个国家的君主可以去实行仁政，可以懂得为从政者着想，为有志之士着想，可以懂得为商人着想，为旅人着想，为农民着想，为外来的流动人员着想，时时刻刻都是这种仁的思想，那么，是要无敌于天下的，故而叫，仁者无敌。</span></p><p><strong><span>无敌于天下者，天吏也。</span></strong><span>可以无敌于天下的人，是代天管理百姓，管理子民的。</span></p><p><strong><span>然而不王者，未之有也。</span></strong><span>如果可以做到仁者，就会无敌于天下。无敌天下就是代天行使管理的责任，如果是代天行使管理的责任，还不能称王于天下的，是没有这样的事情的。</span></p><p><span>我们再来总结这一段，就是来告诉我们仁者无敌。当你懂得用仁德去做事情，你就可以无敌于天下，因为没有人会愿意与你为敌，都会想着去跟随你，才能让他们自己生活得更好，那么这个时候，自然就可以去称王于天下。</span></p><p><span>整个这一段，是上一句的延展部分。上一句讲到：仁则荣，不仁则辱，告诉我们一个定律，如果你想要让自己变得更好，那么就去做仁的事情；否则，做了不仁的事情就会辱，辱就是变得不好。那么这一段在告诉我们具体的方法，怎么去应用？如何才能做到仁则荣呢？</span></p><p><span>如果是做君主的，你要懂得去为你的百姓着想，为那些从政者、有志之士、商人、旅人、农民和外来人口着想，如果你懂得为这些人着想，做的事情都是对他们有利的，就是仁，仁则荣，这个时候，国家就会向着更好的方向去发展。</span></p><p><span>我们就可以以此得出来一个结论：如果我们在生活当中，想让自己的生活变得更好，那就对出现在我们生活当中的人，为他们去着想，让他们变得更好，我们就可以仁则荣。</span></p><p><span>如果我们是做生意的，我们就要懂得为出现在我们生意里的每个人去着想，如果他们都可以变得更好，仁则荣，我们自然就可以变得更好。</span></p><p><span>我们在和朋友的人际关系当中也是一样的，如果我们可以为我们身边的每一位朋友去着想，让他们可以变得更开心，可以得到的更多，仁则荣，我们跟朋友的关系自然就会变好。</span></p><p><span>我们如何跟自己孩子的关系，跟父母的关系变得更好，同样的道理，我们懂得为对方去着想，让他们变得更开心，让他们变得更好，仁则荣，我们和他们的关系自然会向着更好的方向去发展。</span></p><p><span>所以告诉我们仁则荣，不仁则辱。如果你懂得为更多人去着想，我们就会变得欣欣向荣，变得更好；相反，不仁则辱，如果我们不去做为他人着想的事情，事事都以自己得到更多好处为出发点，这就是不仁，不仁则辱，我们就会向着更不好的方向去发展。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑥-1 不忍人之心",
    "date": "2022-10-14",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上⑥-1 不忍人之心</strong></span></p><p><span><strong>孟子曰：人皆有不忍人之心。先王有不忍人之心，斯有不忍人之政矣。</strong></span></p><p><span>《孟子》的这节课程开始之前，我们先来讲一讲王阳明的四句教：“无善无恶心之体，有善有恶意之动，知善知恶是良知，为善去恶是格物。”我们以一个人一生的成长经历来举例子，会更好理解这四句话。</span></p><p><span>我们说一个人从刚开始出生，还在婴儿的阶段，这个时候他是无善无恶的，他没有任何的善恶可言。比如说，他饿了就会哭，开心了就会笑，不开心了可能同样还会去哭，这个时候，他没有那么多善恶的标准，因为他什么都没有想做，他的意识还没有开始动。</span></p><p><span>可是随着他长到了几岁，比如说两三岁，这个时候，有善有恶意之动，他的意识已经开始萌动了，但是注意，这个时候他的意识虽然开始萌动，他还并不知道什么叫做善，什么叫做恶。</span></p><p><span>举个例子，比如说他打了别人一下，他并不知道这个行为是善的，还是恶的；是好的，还是坏的，只是他有意识想要去动手，所以这个时候就产生了行为。</span></p><p><span>那么接下来讲，知善知恶是良知，如何才能让一个孩子知善知恶呢？</span></p><p><span>比如说，当他打了大人一下，大人也可以打他一下，让他去体会，可能这个时候他发现自己很疼痛，他就知道了这件事情是不对的，因为我也讨厌这件事情，我也不喜欢别人来打我一下，这个时候，在他的意识当中就知道了这个是恶的，这件事情是不好的。</span></p><p><span>所以，他的善恶是从他自己的良知当中就会知道的，只不过我们需要给他一些引导，让他意识到什么叫做善，什么叫做恶。</span></p><p><span>接下来，为善去恶是格物。当我们懂得去做善的事情，去除掉恶的事情，不去做那些不好的事情，就叫做格物了。</span></p><p><span>我们返回来再讲知善知恶是良知，每个人都是有良知的，这是我们要思考的问题。</span></p><p><span>圣人告诉我们的是，每个人都是有良知的，这个是一定的，毫无疑问，不容置疑。也就是每个人都有良知，我们的良知当中都知道善恶，都知道想要去做善的事情，而不想去做恶的事情。</span></p><p><span>但是，我们这里可能不禁要有疑问了，不对，很多时候，我们也并没有都去做善的事情，而且我们去观察身边的人，还有很多人不去做善事，而去做恶事，这是为什么呢？</span></p><p><span>我们来举个例子，什么叫做良知？良知也就是同情之心，恻隐之心，怜悯之心，体恤他人之心。</span></p><p><span>我们来举个例子，比如说，我们在街上看到一位老人家摔倒了，这个时候，你的心有没有动过？说我想去扶他一下，但是最后可能产生两种结果，一种结果是扶，一种结果是没有去扶。</span></p><p><span>那我们去想一想为什么没有去扶？这个时候，可能我们要去思考了，我万一扶了他，他开始讹诈我怎么办？万一我扶了他，他的身体不好，或者他比较糊涂，这个时候，他以为是我给他撞到的怎么办？如果扶了他，会不会给自己带来麻烦？如果我扶了他，会不会影响我自己的时间等等？</span></p><p><span>这个时候，加上了更多利益的考量在其中，所以最后你可能决定没有扶，但是注意，没有扶不代表我们自己没有良知，在你看到他摔倒的那一刻，你动了一下心念，你想要去扶，当你产生了这样一种想法，这个就是良知，只不过后来被很多外在的因素所干扰，最后可能我们决定没有去扶他。</span></p><p><span>所以，也就是我们的良知被很多东西掩盖住了，或者是我们的欲望，或者是得失心，或者是怕麻烦等等。</span></p><p><span>但是，有的人即使想到了这些，或者干脆没有想，他还是直接去扶了，我们就知道了，这样的人，良知相对而言被遮盖住的更少，它更加在散发着光明。所以，我们可以看到，在生活当中愿意去行善，愿意去帮助他人的人，良知被掩盖的更少。</span></p><p><span>可是，我们有一些人，并没有去做更多帮助别人的事情，不代表我们没有良知，而是我们的良知被各种欲望和想法，以及外在的因素遮盖住了而已，只是显露出来的部分多与少。</span></p><p><span>接下来第四句话，为善去恶是格物。当我们懂得不停地去做善事，然后不停地去除那些恶的，那些欲望的外在因素的遮盖，就是格物。格物也就是格除一些欲望，格除一些外在因素的干扰，显露出来本来的良知。</span></p><p><span>我们再来看这四句话，其实很简单。无善无恶心之体，本来我们心的本体，它是没有善恶的。</span></p><p><span>有善有恶意之动，当我们有了意识，也就产生了善恶；我们有了想法，也就产生了善恶。比如说，我们觉得他对我好，这个称之为善，他对我不好，这个就是恶，是我们自己的意识和想法在动，所以开始有了定义，开始有了善恶。</span></p><p><span>知善知恶是良知，那用什么来知道善恶的？我们本来的良知就知道什么事情是善，什么事情是恶，只不过虽然我们知道什么是善，什么是恶，如果我们的良知被遮盖住了，被欲望，被其他的因素所遮挡，我们就会去做一些明知道是不善，但还要去做的事情；同时也会做一些明知道是善，但是并没有去做的事情。都是因为那些欲望杂染了我们本来的良知。</span></p><p><span>其实重点就在第四句话了，我们学习传统文化，我们修身的意义到底是什么？就是为善去恶是格物，我们不停地格除那些欲望，不停地格除那些杂染，不停地格除那些干扰，我们自然按照良知的本意，就会去为善去恶。</span></p><p><span>不光阳明先生如此讲，我们去看《道德经》也是如此。老子首先讲道，道是无善无恶的，它是没有属性的，道只是在讲各种事物发展的规律，但是我们一个人可不可以做到不动？</span></p><p><span>无善无恶心之体，如果你的心不动就没有善恶，就像一个人，如果你明白了道的规律，如果你不动那就可以无为，他是没有任何的善恶的。但是我们绝大多数人是没有办法做到不动的，如果你做不到不动，既然是动，我们就要懂得往好的方向，往善的方向，往有德的方向去动。</span></p><p><span>所以老子讲《道德经》，讲完了道，是要讲德的，你如何去遵循德做事情，如何去往善的方向去做事情。不光阳明先生和老子在讲这样的规律，今天我们这节课程，孟子也在探讨人性，也在讲一个人如何才能行仁、义、礼、智，这个仁、义、礼、智，到底是从什么地方来的。</span></p><p><span>我们来看孟子是如何讲的？</span></p><p><strong><span>孟子曰：人皆有不忍人之心。</span></strong><span>首先孟子讲了一个结论，首先说了一句话，每个人都有不忍人之心。不忍人之心，指的是怜悯之心，同情之心，体恤之心，不忍他人受苦之心。我们去想一想是不是这样的，每个人都会有，当我看到他人在受苦，有一刻我是觉得不忍的；当我看到有老者摔倒了，那一刻我是怜悯和同情的，这就是阳明先生所讲的良知。</span></p><p><span>即使说我们看到电视，即使我们是读一本书，我们在看他人受苦的那一刻，我们可能都会有一点难过，有一点同情，有一点体恤他，还有一点怜悯，甚至还想过，我能去帮他做点什么呢？这就是人之所以称之为人的地方。每个人都有这颗心，只不过我们显露的地方是多还是少，我们被什么东西遮盖住了。</span></p><p><span>讲了这句定论之后，孟子开始要论述这个道理，我们学习《孟子》会知道，孟子的思维逻辑很清晰，他每一段话都讲了一件完整的事情，和完整的观念。</span></p><p><span>首先讲了这句话，它是个定论，接下来就会去举例子来说明这件事情，为什么会这个样子，最后结尾的部分会告诉我们，如果你懂得这个样子，会有什么样的成果。</span></p><p><span>结果是什么样子的？接下来举例子，<strong>先王有不忍人之心，斯有不忍人之政矣。</strong>先王，指的是以前的圣明的君王，因为这些圣贤的君王有不忍人之心，所以才有了不忍人之政，因为他不忍百姓受苦，不忍那么多人流离失所，不忍那么多人忍受战乱之苦，不忍看到那么多人家破人亡，不忍看到那么多人战死沙场，因为他有了这颗不忍人之心，所以就行了不忍人之政。</span></p><p><span>这是仁则荣，不仁则辱的，讲得更深入的，更细节的东西。我们上两节课讲到，如何从事情当中仁则荣，而接下来的内容是直接触碰到内心的，讲得更细致，如何才能做到仁则荣呢？是因为你先有了不忍人之心，所以自然会去行不忍人之政。</span></p><p><span>不光是圣贤的君王如此，我们作为一个人也是一样的。说我不忍心我的爱人受什么样的苦，所以我不忍心伤害他，不忍心做背叛他的事情。因为我不忍心让我的父母受什么样的苦，所以我不会去顶撞我的父母，我应该去孝顺我的父母。如果一个人做生意，我不忍心让我的顾客，在我这里花了高的价钱，但是买的产品并不实用，所以会严格地把控我的每一款产品，因为我不忍他受苦。</span></p><p><span>所以，当我们有了这颗心，自然会去有相应的行为出现。比如说，我们可以看到孔子，看到孟子，看到这些人，因为不忍心大家没有接触到文化而受苦，所以他们去传播圣贤之道，都是有了不忍人之心，才会做出来相应的不忍人之事。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑥-2 人皆有良知",
    "date": "2022-10-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑥-2 人皆有良知</span></strong></p><p><strong><span>以不忍人之心，行不忍人之政，治天下可运之掌上。所以谓人皆有不忍人之心者，今人乍见孺子将入于井，皆有怵惕恻隐之心；非所以内交于孺子之父母也，非所以要誉于乡党朋友也，非恶其声而然也。由是观之，无恻隐之心，非人也；无羞恶之心，非人也；无辞让之心，非人也；无是非之心，非人也。</span></strong></p><p><strong><span>以不忍人之心，行不忍人之政，治天下可运之掌上。</span></strong><span>一位圣贤的君王，因为有了不忍人之心，所以去行不忍人之政，这个时候，治理天下易如反掌，就像在手掌上转动东西，如此简单。</span></p><p><span>所以孟子告诉我们，想要治理天下很简单，先去治理这颗人心，让我们有不忍人之心，你就会去做出不忍人的事情，不忍人之政，最后治理天下易如反掌。</span></p><p><span>既然治理天下都易如反掌，我们要想治理好家庭，治理好自己的生意，好像也同样易如反掌，一样的顺序。我们先要有这颗不忍人之心，我们自然会做不忍人之事，最后那个事情是水到渠成的，易如反掌的。</span></p><p><span>如果我们用这颗不忍人之心，时刻都为我们的顾客去着想，我们不忍心他受到伤害，我们不忍心他多花钱财，我们不忍心他买到的东西是不好的，我们不忍心让他在我这里，没有享受到好的服务，我们不忍心用什么样的言语刺激到对方，当我们时时刻刻都是这种想法，我们的行为也就自然有了方向，最后那个结果，就是自然呈现出来的。</span></p><p><span>通过这一段延伸，我们可以得出一个观点：不光是圣贤的先王有不忍人之心，我们每个人都是有不忍人之心的，这种不忍人之心是我们内在的，是与生俱来的，就像阳明先生所讲的良知，他是每个人都有的。</span></p><p><span>接下来，孟子就要通过例子来告诉我们，每个人都有良知，每个人都有不忍人之心。</span></p><p><strong><span>所以谓人皆有不忍人之心者。</span></strong><span>所以说每个人皆有不忍人之心，无论这个人是什么样子的，他是善也好，是恶也好，是君王也好，是庶民也好，或者是十恶不赦之人，他也都有不忍人之心。</span></p><p><strong><span>今人乍见孺子将入于井，皆有怵惕恻隐之心。</span></strong><span>这一段话是来举例子说明，为什么人皆有不忍人之心。例子来了，现在看到一个孺子将要入于井，也就是快要掉到井里去了，皆有怵惕恻隐之心。怵惕：是惊吓，惊恐；恻隐之心：是怜悯、同情，想要去帮助他的那颗心。我们去想象这样一个画面，现在看到一个孺子将要掉到井里，我们的第一反应是惊吓，第二反应是同情、怜悯，想要去帮助他，这是想法产生了，这就是不忍人之心，也就是良知。</span></p><p><span>但是接下来，能不能把这个孺子救下来呢？可能我们要产生很多的想法了，比如说，我的能力够不够？比如说，我可不可以用这个时间跑到那里呢？比如说，我跑到那里，万一没救下来，会不会被别人误解，等等一系列的想法。</span></p><p><span>但是这些想法虽然产生了，它不影响我们那一刻的心动了，那一刻的不忍人之心，只不过我们被遮盖住了多少，我们那颗仁心，我们的良知被遮盖住了多少，最后决定了我们有没有把那个孩子救下来。</span></p><p><span>其他的事情也一样，当我们看到了一件不好的事情，我们那个良知，那个不忍人之心会动的。只不过后面，我们又添加了很多想法，和所谓的现实的因素，那么我们的想法越多，我们的欲望越多，我们现实的因素越多，最后它遮盖住了，就没有让我们那颗不忍人之心，散发它本有的光明。</span></p><p><strong><span>非所以内交于孺子之父母也。</span></strong><span>我们再讲回来，当我们看到孺子将要入于井，都会生惊吓、同情、怜悯，和想要帮助他的心，非所以内交于孺子之父母也。我们并不是为了结交孺子的父母，也就是我们那一刻的想法是从良知上来的，是从不忍人之心上来的，并不是有那么多的想法，想要去结交孺子的父母。</span></p><p><strong><span>非所以要誉于乡党朋友也。</span></strong><span>当我们生起那颗不忍人之心之时，并不是为了让乡党朋友可以赞美我，那只是我们最真实的那一刻的想法。</span></p><p><strong><span>非恶其声而然也。</span></strong><span>也并不是讨厌那个孺子的哭声，所以才动了那颗恻隐怜悯之心。我们看“非所以”这三个字很重要，孟子排除了一切外在的因素，告诉我们本心就是这个样子的。</span></p><p><span>我们看到一个孺子将要入于井，我们不是想要结交孺子的父母，我也不是为了乡党朋友可以赞美我，我也不是讨厌孺子的哭声，只是我那一刻的本心动了，那一刻的不忍人之心出来了，所以去掉了一切外在的因素。</span></p><p><span>这就是本来的那个东西，只不过我们很多时候，本来的这颗心被遮盖住了而已。我们又考虑到了那么多的得失，那么多的利益，那么多的担忧，所以这件事情并没有去做。</span></p><p><span>我们去想一想，在生活当中是不是如此，当我们看到一个老者摔倒在路上，当我们看到孺子将要入于井，当我们看到别人做的善的事情，或者当我们看到别人做的恶的事情，如果排除了这些外在的因素，我们那颗不忍人之心，我们那颗是非善恶的心，其实我们是清清楚楚的。</span></p><p><span>难道我们不知道什么事情该做？不知道什么事情不该做？不知道什么是善？不知道什么是恶吗？其实我们的内心是清清楚楚的，只不过被更多的东西遮盖住了，最后没有产生行为而已。我们要如何可以把那颗恻隐之心，把那个良知的光明，更加显现出来呢？我们接下来去看孟子如何讲？</span></p><p><strong><span>由是观之，无恻隐之心，非人也。</span></strong><span>由此我们可以知道，没有恻隐之心的人，不能称之为人。</span></p><p><strong><span>无羞恶之心，非人也。</span></strong><span>一个人没有羞恶之心，是不能称之为人的。我们看什么叫羞恶之心？羞：就是羞耻，恶：是厌恶。羞耻是指针对自己而言的，当我们做了一件恶的事情，做了一件不好的事情，做了一件错误的事情，每个人都是有羞耻之心的。</span></p><p><span>那恶呢？当别人做了一件不好的事情，做了一件错的事情，我们就会产生厌恶之心，所以每个人都有这种羞恶之心。</span></p><p><span>我们来举个例子，比如说我们出去买东西，或者出去做什么事情，如果我们自己插队了，在插队的那一刻，你有没有一点不安，或者有没有一点不好意思，或者有没有那一点不自然，当有那一点不自然，不好意思，这就是羞耻之心。</span></p><p><span>就是我们知道这件事情是不对的，但是可能因为我赶时间，可能因为我这样的习惯已经形成了，所以我们就去做了插队的行为。但是那一刻，如果我们有一点不自然，有一点不太舒服，有一点不太好意思，有一点点愧疚，这就是那个羞耻之心。</span></p><p><span>我们以此类推，在生活当中，其他的事情也是如此，如果我们拿了本不该拿的东西，拿了原本不属于我们的东西，有没有一丝不自然，有没有一点忐忑，有没有一点怕别人知道，这都是羞耻之心。</span></p><p><span>所以我们就知道了，其实这个羞耻之心是每个人都有的，只不过比例和程度的多与少，大与小。有的人可能有一丝不太好意思，转瞬即逝；而有的人可能会在心里考虑良久，甚至在内心不停地去徘徊犹豫，自己再去多想这个事情，所以它只是比例的问题，其实任何人都有。</span></p><p><span>我们再讲厌恶之心也是如此，你看到别人做的事情是错的，你有没有一丝的厌恶？比如说，你看到别人插队了，你会不会有一丝的不开心？有一丝觉得，这个人怎么这样的没有素质？他为什么可以跑到前面去呢，后面明明还有那么多人？所以，那一刻你的厌恶之心就会生起。</span></p><p><span>羞恶之心，它是可以相互运用的。比如说，我们有了羞耻之心，我们就会厌恶别人去做羞耻的事情。当我们有了厌恶之心，就会提醒自己，不要去做让自己内心觉得羞耻的事情。所以，孟子讲无羞恶之心，非人也。这样的不能称之为人。</span></p><p><span>孟子这一段，是在讲人性里本来就有的东西，告诉我们，人性里本来就有不忍人之心，本来就有良知，本来就有恻隐之心，本来就有羞恶之心，只不过程度的多与少，或者大与小。</span></p><p><strong><span>无辞让之心，非人也。</span></strong><span>懂得礼让，谦让他人，你看我们每个人从内心深处，都有谦让他人的心。举个例子，我们看到一位老者，你会生起谦让之心。比如说，我坐在公交车上，或者地铁的座位上，我看到一个老者，或者看到一位孕妇，曾经我的心可能会动了一下，我要不要给他让个座？当你动了这颗心，那就是辞让之心。</span></p><p><span>只不过后来，我们可能又多加衡量，所以最终导致没有去让座。比如说，你会想我也挺累的，这么多人我往哪儿站啊？我的东西也比较多；我背的这个包也很沉重；如果我站着可能也会很累；其实我也有一点晕车等等，这一系列的想法出来的时候，最后的结果可能是让座，也可能是没让座。但是，我们讲的是人人都有那颗心，当你的心动了一下，这就是辞让之心。</span></p><p><span>在生活当中很多事情，我们如果懂得细细地去体会，每个人都有辞让之心，所以说无辞让之心，非人也。如果没有这颗辞让之心，不能称之为人。</span></p><p><strong><span>无是非之心，非人也。</span></strong><span>是非，每个人都可以明辨是非，知善恶。什么事情是正确的？什么事情是错的？什么样的事情是善的？什么样事情是恶的？是不是我们每个人内心，都很清楚啊。</span></p><p><span>比如说，我们去看一部电影，我们知道什么样的人是善的，他做的事情是对的，我们也很厌恶，很讨厌那些饰演坏人的角色，我们会觉得他怎么那么坏，他怎么可以做出这样的事情，他的道德他的价值观是不正确的。</span></p><p><span>你看，当我们作为一个旁观者，人人都有是非善恶之心，我们可以看得很清楚。现在是互联网时代，更是如此，一个人做了什么违背道德的事情，我们都可以站在道德的制高点上，来评价它，来说他的对与错，这就是是非之心。</span></p><p><span>只不过，是非和善恶之心放到我们自己身上，可能因为一些欲望，可能因为一些利益，我们开始变得看不见善恶了。明明自己做的事情是错的，明明自己是恶的，但是我们却视而不见，不是我们内心不知道，而是我们被欲望所蒙蔽了。</span></p><p><span>我们曾几何时，也动过很多善心，动过很多善念，想要去做一些帮助他人的事情，可是，可能被一些外在的环境，被一些自己杂染过的想法，遮盖住了，故而就没有去做那件事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑥-3 心之四端",
    "date": "2022-10-19",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 <span>⑥</span>-3 心之四端</span></strong></p><p><strong><span>恻隐之心，仁之端也；羞恶之心，义之端也；辞让之心，礼之端也；是非之心，智之端也。人之有是四端也，犹其有四体也；有是四端，而自谓不能者，自贼者也；谓其君不能者，贼其君者也。凡有四端于我者，知皆扩而充之矣。若火之始然，泉之始达。苟能充之，足以保四海；苟不充之，不足以事父母。</span></strong></p><p><span>我们再来看孟子的这四句话，告诉我们人性当中都有恻隐之心，都有羞恶之心，都有辞让之心，都有是非之心，这是本来就具备的东西。</span></p><p><span>我们看这四种心对应的是什么呢？儒家文化讲仁、义、礼、智、信，我们每个人要修一颗仁德之心，我们每个人要去做合义的事情，我们要做一个懂礼的人，我们要做一个有智慧的人。</span></p><p><strong><span>恻隐之心，仁之端也。</span></strong><span>端：开端、开始，初始的意思。我们要注意这句话了，恻隐之心，仁之端也，每个人都有恻隐之心，有了恻隐之心就是仁的开端。我们看孟子的思维，仁、义、礼、智从哪里来？不是从外在来，是每个人本来就有，每个人都有恻隐之心，而这个恻隐之心，就是仁的开端，也就是本来我们内在就具备仁心。</span></p><p><strong><span>羞恶之心，义之端也。</span></strong><span>每个人都有羞恶之心，而羞恶之心就是义的起始，义的开端。举个例子，我们厌恶别人插队这件事情，如果我们厌恶别人插队这件事情，就会产生义的行为，比如说制止他的插队，不让他去做这件事情，这就是有了义的行为了。</span></p><p><span>再比如说，我们厌恶别人插队这件事情，我们自己就不愿意去做这样的事情，所以就产生了义行。义者宜也，我们就会去做合适的行为，也就是我们厌恶的事情，我们自己就不愿意去做，这也叫义行。我们厌恶的事情，可能我们会去出手帮助别人，或者制止别人，这个也称之为义行。所以一个人首先有羞恶之心，接下来自然会去做义的行为。</span></p><p><strong><span>辞让之心，礼之端也。</span></strong><span>每个人内在都有辞让、礼让之心，所以有了让，自然也就有了礼让。当我们那颗心产生了辞让的想法，如果我们可以去掉，那些掩盖住我们的欲望和杂染，让这个辞让的行为，更多的可以呈现出来，这个时候就变成了礼。</span></p><p><strong><span>是非之心，智之端也。</span></strong><span>我们每个人都可以明辨是非，知道善恶，这就是智之端也。我们每个人的内在都是有智慧的，所以什么叫做智者？知是非，明善恶。</span></p><p><strong><span>人之有是四端也，犹其有四体也。</span></strong><span>人因为有了这四端——仁、义、礼、智，有了这四端，犹其有四体也，就好像是一个人有了四肢。我们看四肢是来做什么的，它是可以行动自如的，它是可以产生行为的，是可以帮助他人的。</span></p><p><span>所以孟子告诉我们，有了恻隐之心，有了羞恶之心，有了辞让之心，有了是非之心，也就是有了四端。有了仁、义、礼、智，有了这四端，就像是一个人有了四肢，可以去行动，可以产生行为，可以去帮助更多的人，可以去做更多的善行。</span></p><p><strong><span>有是四端，而自谓不能者，自贼者也。</span></strong><span>有了这四端，我们就可以产生行为，可以去帮助他人。但是有这四端，而自谓不能者也，说我不能去做善事，也没有什么善事让我去做，这种人叫自贼者也。</span></p><p><span>那什么叫贼？自暴自弃的，自我伤害的人。那么很多人会讲，说我生活当中没有机会去善行，不是这样的，是我们被自己遮盖住了，不知道而已。我们每个人都有仁、义、礼、智，这四端，我们想要去帮助别人，我们也知道什么是善，什么是恶，所以，怎么会没有帮助别人的事情呢？只是被一些欲望，被一些杂念，被一些担忧，所掩盖住了而已。</span></p><p><span>所以，我们知道了有这四端，就可以去做更多的行为，做更多帮助他人的事情，如果我们以为不能，是我们在自暴自弃，是我们在自我伤害自己的四端而已。</span></p><p><strong><span>谓其君不能者，贼其君者也。</span></strong><span>如果说自己的君主不能去行仁政，不能去做善事，这是贼害自己的君主，是对自己的君主自暴自弃，是伤害自己君主的德行的想法和行为。所以，我们可以看到孟子在周游列国期间，见到的每一位君主，孟子都要去讲仁政，都要去告诉他推行仁政，去为百姓着想。</span></p><p><span>因为孟子清楚地知道每一个人都有这四端，他都可以去推行仁政，只不过被自己争霸的欲望，被自己的享乐掩盖住了，没有显露出来而已。所以，见到每个人都会去讲他的仁政，都会告诉每一位君主，您是有仁心的，先王就是因为有不忍人之心，所以可以行不忍人之政。</span></p><p><span>那么今天还不能行不忍人之政，就是因为我们没有坚信自己有那颗不忍人之心，我们还没有去除掉那些欲望，我们还不懂得为百姓去着想，当我们自己可以找到那颗不忍人之心，我们自然会去推行仁政。</span></p><p><span>我们每一个人都一样，我们每一个人原本都是善良的，都是具足的，都是有良知的，都是有仁、义、礼、智这四端的，所以我们要坚信这一点。当我们去坚信这一点，我们就会不停地去除我们的欲望，为善去恶是格物。我们不停地去格除那些欲望，不停地去格除那些杂染，让我们去掉那些恶的想法，去掉那些恶的行为，自然会去做善行。</span></p><p><span>我们从仁、义、礼、智这个开端，就可以让我们变得更加仁爱，让我们变得更加有德行，变得更加仁义，变得更加有智慧，变得更加遵循礼仪。</span></p><p><span>接下来重点来了，孟子告诉我们到底该怎么去做，如何让仁、义、礼、智散发它本有的光明呢？</span></p><p><strong><span>凡有四端于我者，知皆扩而充之矣。</span></strong><span>每个人都是有这四端的，但是我们要知道，扩而充之。扩：扩大；充：充实。现在我们知道了，每个人都有这四端，我们接下来要做的事情，就是扩而充之，如何把这颗仁心扩大，让它不停地变充实。如何把知道善恶，知道是非的这种智慧扩大，让它变得更充实。如何把礼让，把义行扩大，变得更充实，这是我们每个人现在要去做的事情。</span></p><p><strong><span>若火之始然，泉之始达。</span></strong><span>这句话太妙了！如果一个人懂得把仁、义、礼、智，这四端扩而充之，这个时候，就好像火刚刚开始燃起，泉水刚刚开始流淌，这是我们重生的时候。这个时候，让我们的生命，让我们的人性在散发着光芒，如果不懂得扩而充之，我们的生命将如死灰一般，我们的生命将如泉水不在流淌一般，它没有办法绽放。</span></p><p><span>可是如果我们懂得扩而充之，懂得让我们的仁、义、礼、智变得散发着光芒，这个时候，我们才是重生的时候，它会让我们的生命走向更高级，走向更自由，走向更光明，就像那个火刚刚开始燃烧，像泉水潇洒自在地流淌。</span></p><p><span>我们去想一想，什么样的人的生命更高级？想一想我们会去敬仰什么样的人？我们会去羡慕什么样的人？</span></p><p><span>是不是那些散发着人性光辉的人？像孔子这样的人，像孟子这样的人，像我们生活当中出现过的，无数的有仁、义、礼、智的人，这些人在做着帮助别人的事情，所以，我们赞叹他们伟大的人格，我们赞叹他们高尚的灵魂；所以，这些人的生命在走向更高级，在走向更光明。</span></p><p><span>我们会去唾弃那些没有仁、义、礼、智的人，我们唾弃那些经常做着恶行的人，我们唾弃那些经常抱怨的索取的伤害他人的人。</span></p><p><span>所以，我们看到生命与生命的不同，不就是人性的光辉的不同吗？所以，我们要让自己的生命去走向更光辉，走向更良善，我们就是对于这四端扩而充之，看我们的生命，就像火刚刚燃起，就像泉水在自由地流淌。</span></p><p><strong><span>苟能充之，足以保四海。</span></strong><span>如果我们懂得去充实这四端，足以安定天下。既然足以安定天下，我们想要安定一个家庭，想让自己生活得更好，那么更加是易如反掌的事情。</span></p><p><strong><span>苟不充之，不足以事父母。</span></strong><span>如果不能去充实这四端，我们不足以侍奉和孝顺父母，想一想，现在为什么还有很多人不去孝顺父母？因为这四端我们都没有去充实，我们没有仁，没有义，没有礼让，不懂是非，不明善恶，那怎么会去孝顺父母呢？</span></p><p><span>所以，我们要去充实这四端，我们自然会去孝顺父母，我们人性的光辉自然得以呈现。不光去侍奉父母，我们去想一想，对待自己的子女是不是一样的？如何才能慈爱孩子呢？我们只要去充实这四端就可以了。我们如何去做好人际关系呢？ 我们如何去做好生意？我们去充实这四端就可以了。</span></p><p><span>当我们有了仁、义、礼、智，我们就会愿意去帮助和服务更多的顾客，我们的生意自然就变好了；我们愿意去帮助更多的朋友，我们自然的人际关系就好了。</span></p><p><span>所以，孟子讲苟能充之，足以保四海。如果做君王的人，可以不停地扩而充之这四端，去散发人性的光辉，去为百姓做更多的事情，足以安定天下。</span></p><p><span>我们每个人，如果懂得扩充这四端，足以让我们身边的一切变得更好，无论是生意、感情、父母、子女、朋友，还有我们自己的生命状态，都会得以绽放。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑦-1 术不可不慎",
    "date": "2022-10-21",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上 ⑦-1 术不可不慎</strong></span></p><p><span/><strong>孟子曰</strong><strong>：</strong><strong>矢人岂不仁于函人哉</strong><strong>？</strong><strong>矢人惟恐不伤人</strong><strong>，</strong><strong>函人惟恐伤人</strong><strong>。</strong><strong>巫匠亦然</strong><strong>。</strong><strong>故术不可不慎也</strong><strong>。</strong><strong>孔子曰</strong><strong>：</strong><strong>里仁为美</strong><strong>，</strong><strong>择不处仁</strong><strong>，</strong><strong>焉得智</strong><strong>？</strong></p><p><span>我们来做一下前情回顾，回想一下之前的这几节课程，我们都学习到了什么。孟子首先告诉</span></p><p><span>给我们一个定论，仁则荣，不仁则辱。</span></p><p><span>接下来又开始举例子说明，为什么一定要去做仁的事情，当你懂得为他人去着想，我们一切都会变得欣欣向荣，都会变得更好。可是如果我们不懂得为他人着想，不懂得去做利益他人的事情，我们则会受辱。这个辱泛指事情会向着不好的方向去发展，那么进而又开始讲到</span></p><p><span>如果作为一个君王，处上位者，要如何去做到仁则荣呢？</span></p><p><span>我们要去尊重贤德的人，让那些有才能的人可以各得其位，我们要懂得为更多的百姓去着想，</span></p><p><span>我们要去利益到那些有志之士，让他们可以施展自己的才华，然后我们要利益那些经商之人，</span></p><p><span>减少他们的税收，他们才愿意在这个地方去经商。</span></p><p><span>我们要去利益到那些旅人，这些旅人才会愿意来到这个国度。我们要利益到农民，减少他们的税收，让他们可以解决温饱，进而解决安居乐业的问题。我们还要去利益那些外来的人员，</span></p><p><span>让他们可以在这里安家，所以作为一个君主，我们要懂得为百姓去着想。</span></p><p><span>那进而又讲到每个人皆有不忍人之心，告诉我们处上位该如何去行仁政，去利益更多的人，进而又更细节地讲到，其实这个仁心我们每个人内在都有，我们人人都有这四端。有仁之端、</span></p><p><span>礼之端、义之端、智之端，也就是这个仁心，是我们内在的每个人都有的。</span></p><p><span>只不过我们要给他扩而充之，我们不停地去扩大，不停地去充实它，让我们这颗仁心变得越来越大，我们可以为更多的人去想，为更多的人去谋福。如果是作为一个为官之人，就要想着为百姓谋福，这就是仁心。</span></p><p><span>如果是一个做君主之人，让每个人各得其所，这就是仁心。如果我们是做父母的人，我们要如何去帮助到我们的孩子，让他变得更好，这就是仁心。如果我们是做生意的人，我们怎么想着利益到我们的顾客，让他在这里可以物超所值，让他在这里可以感受到温暖，这就是仁心。如果我们是一个企业的领导，我们要想着怎么帮助更多的员工，去得到内在的成长，以及他可以赚到一些工资，可以让自己的家庭变得更和谐。如果我们是作为一个员工，我们要想着怎么为这个团队，为这个企业贡献自己的力量，怎么为顾客去着想，可以让他们得到更多的实惠和更优质的服务，这就是仁心。</span></p><p><span>讲完了仁心以后，今天这节课程孟子进而延伸，告诉我们如何去择业，如何去选择一个符合仁心，仁德的职业，这个对我们来讲很重要。</span></p><p><span><strong><span>孟子曰</span></strong><strong><span>：</span></strong><strong><span>矢人岂不仁于函人哉</span></strong><strong><span>？</span></strong><span>这里提到了矢人和函人。矢指的是箭，矢人指的是制造箭的人。函指的是盔甲、铠甲。函人是指的制造盔甲之人。</span></span></p><p><span>我们再来看这是一个问句，矢人岂不仁于函人哉？说我们看看做箭的人，是不是比制作盔甲的人更加的不仁？为什么这么讲，我们去想一想，听上去制作箭的人和制作盔甲的人，似乎好像没有什么区别，但是我们仔细的去思考，其中就有区别了。</span></p><p><span>我们想一想做箭的人，想让自己的箭更加得锋利，这个时候才会有人去购买，做盔甲的人他在想怎么把我的盔甲做得更坚固，不容易被射伤这个时候他人才会去购买。</span></p><p><span><strong><span>矢人惟恐不伤人</span></strong><strong><span>，</span></strong><strong><span>函人惟恐伤人</span></strong><strong><span>。</span></strong><span>做箭的人是担心自己的箭没有办法伤到别人，那说明箭做的不够好，就不会有人愿意来购买。而函人惟恐伤人，做铠甲的人，担心自己做的铠甲不够坚固，唯恐伤到穿铠甲的人。我们这里看区别很大，做箭的人是想着更多地伤害到他人，让箭变得更锋利，而做盔甲的人是想着如何做得更坚固，不被他人伤害。</span></span></p><p><span><strong><span>巫匠亦然</span></strong><strong><span>。</span></strong><span>这里的巫指的是巫医，匠指的是做棺椁之人，这里孟子为何要提到巫匠亦然呢？</span></span></p><p><span>因为在以前社会背景下，做巫医和做棺椁的人是不受人尊敬的，巫医他不是正常的医生，他是用巫术给人治病的人，而做棺椁之人也是如此，即使发展到我们的今天，巫医和做棺椁之人也是不受人尊重的。甚至我们想要远离这样的人，说这个人是做什么的？他是做棺椁的，我们觉得好像有些晦气，所以我们并不愿意接触这一类的人。</span></p><p><span>孟子这里讲道：巫匠亦然。这两种职业并不受他人的尊敬，但是圣人的角度和普通人不一样，圣人去尊敬一个人，是看他做的事情是否是仁德的，我们再来看巫医，是帮人治病的。那么做棺椁之人，是让人走了以后，可以有安葬之处，有安葬之所。在圣人的角度看来，这样的人都是仁德之人，所以巫匠和函人是一样的，他们所做的都是帮助他人的事情。</span></p><p><span>这里孟子告诉给我们一个看待事物，和看待他人的准则，我们不要去看他职业，本身是什么样子的，而我们要去看他所做的事情，是否是有仁德的，是否是为了他人好，是否是为了他人着想的。如果是为他人着想的，比如函人，做盔甲的人，唯恐人受到伤害，这样的人值得尊敬和赞叹。</span></p><p><span>再比如说，巫医和做棺椁之人，他们所做的事情是救死扶伤的，是让人有一个安身之所，他在死后可以去下葬，所以这样的人是值得尊敬的。再比如说，有的人即使高高在上，坐着君主的位置，可是他是残暴不仁的，他没有为百姓去着想，这样的人我们称之为暴君，或者昏君，虽然他的位置高高在上，但是也不值得人去尊敬。</span></p><p><span>再比如说，为官之人，可能位高权重，可是他坐在那个位置上，并不想为百姓谋福利，都在想着如何去发动战争，想着去满足自己的贪欲，想着去横征暴敛，这样的人即使坐在高位上，</span></p><p><span>也不值得被人尊重。所以孟子这句话给了我们一个准则，我们去看待一个人，不要看待他坐在什么位置上，不要去看他做什么样的职业，我们去看他所选择的事情，是否可以去帮助到他人，是否是含有仁在的。</span></p><p><span><strong><span>故术不可不慎也</span></strong><strong><span>。</span></strong><span>术指的是我们的技能，选择的职业等等，这里孟子下了一句结论，所以说选择自己的职业技能，手艺，不可不慎重。因为当我们选择不好之时，我们所做的职业本身就是伤害仁德的。</span></span></p><p><span>比如说，这里举例子讲到的矢人，制作箭的人。那再举例子，说到我们现在的生活当中，说有的人选择了一个骗人的行业，当你去选择骗人的行业，无论你怎么去做，你都是在伤害他人，所以这是不符合仁，不符合我们内在良知的。所以我们在择业的时候很重要，我们去想我们当下所做的这个行业，所做的领域，是否可以给他人提供帮助，如果不能给他人提供帮助，</span><span>甚至是有害他人的，那么这件事情是不可以去做的。</span></p><p><span>这是从最明显的角度来讲，我们可以自己去思考，我们再深入和更细致的来讲，第二个角度，比如说我们做医生，比如说我们做老师这个职业，是否能帮助他人，还是伤害到他人，需要我们自己扪心自问，问问自己的良心，我做医生真的是在救死扶伤吗？我真的有用我这个职业去帮助到他人吗？我作为一个老师，我真的是在让我的孩子变得更好吗？我真的是教我的学生向善吗？而不是误人子弟。</span></p><p><span>所以说我们无论当下去做什么样的行业，什么样的领域，我们都要拷问一下自己的良心，我坐在这个位置上，有努力地在向善吗？有去做仁德的事情吗？有让我这颗不忍人之心发挥它更多的光明吗？</span></p><p><span>比如说我做了一个产品，这个产品真的是对别人有利的吗？还是说这个产品只是看起来好看，</span></p><p><span>但是它有很多的辐射，会带给很多人伤害呢？这些都是需要扪心自问的，别人或许从外面看不出来，他只是看到了一个表象，可是我们自己要清晰的知道，我们做这件事情到底是有益于人的，还是有害于人的。当我们懂得去扪心自问，懂得去自我反思，我们才可能让自己内在的仁爱之心扩而充之，让他发挥更大得光明和作用。</span></p><p><span><strong><span>孔子曰</span></strong><strong><span>：</span></strong><strong><span>里仁为美</span></strong><strong><span>，</span></strong><strong><span>择不处仁</span></strong><strong><span>，</span></strong><strong><span>焉得智</span></strong><strong><span>？</span></strong><span>这里孟子引用了孔夫子的一句话，讲里仁为美。一个人内在是有仁德的，就是美好的，看待一切事物也是美的，生活也是美好的，择不处仁，焉得智。如果不选择处在仁上，不是时刻去做仁的事情，怎么能得到这种智慧呢？也称不上有志之人。</span></span></p><p><span>所以我们看孔夫子的这句话，什么样的人叫做有智慧的人，懂得内在用仁去做事情的人，这样的人是有智慧的，并且这样的人是美好的。我们来举个例子，来讲一种感受和状态，我们去体会什么叫做里仁为美。</span></p><p><span>冰之将释，我们去体会这四个字，看到冰将要融化的那个样子，是不是很潇洒，是不是很美好，那里仁为美呢？就是这种感受。我们来举一个具体的例子，比如说，我们坐在公交车上这个时候我们看到一位老人家，或者看到一位孕妇，我们给他让个座，这个时候我们有没有觉得自己瞬间好像高大了。</span></p><p><span>我们站在那里，就好像屹立于天地之间，我充塞于天地之间，那就是美好的感受。比如说我即使走在路上，我帮助了一个陌生人，我在帮助他以后那一刻，有没有瞬间觉得自己好像很高大，瞬间觉得自己内在是有些成就感的，这就是里仁为美。</span></p><p><span>所以当我们内心有仁，愿意去做帮助别人的事情，我们才能体会到那种美好，这种美好它是源源不断的。从自己的内在不停地生发出来的，扩而充之，它可以延展到我们生活当中的每一件事。最后也就有了孟子所讲的浩然之气，充塞于天地之间。</span></p><p><span>我们只有真正地去做，才能体会到什么叫做里仁为美。它不是通过思维和道理可以想得通的，如果我们大多数人用思维去想，我们会认为我去做仁德的事情，去帮助别人，那不是我自己吃亏了吗？所以只有真正去践行里仁为美，我们才知道内在的这种美好是源源不断的。并且我们只有真正去做，我们才能得到这种智慧。</span></p><p><span>反之如果我们要去做那些不仁的事情，举个例子，我们做了欺骗，欺诈他人的事情，做完以后我们内心会觉得美好吗？不会吧。反而我们会觉得忐忑不安，我们总是担心别人发觉，万一被人知道了怎么办呢？即使别人不知道，我们自己也总会想起这件事情，所以当你做不仁的事情，我们内心不但没有美好，反而还会有更多的担忧，有更多的恐惧，甚至吃饭没有了味道，睡觉也不安稳。</span></p><p><span>所以做不仁之事，就会让我们的内心更加的不堪，更加的痛苦，更加的烦恼和忐忑，但是我们去做仁的事情，会让我们内在更加美好，更加自在，更加放松，你会觉得自己有一种成就感，会觉得自己变得越来越高大，会觉得自己充满着浩然正气。</span></p><p><span>这就是里仁为美，孟子这里引用孔夫子的这句话来告诉我们，只有你内在是仁的，你自己内在才会有美好，你的生活才会变得更美好。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑦-2 反求诸己",
    "date": "2022-10-24",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 <span>⑦</span>-2 反求诸己</span></strong></p><p><span><strong>夫仁，天之尊爵也，人之安宅也；莫之御而不仁，是不智也。不仁不智，无礼无义，人役也。人役而耻为役，由弓人而耻为弓、矢人而耻为矢也。如耻之，莫如为仁。仁者如射，射者正己而后发，发而不中，不怨胜己者，反求诸己而已矣。</strong></span></p><p><strong><span>夫仁，天之尊爵也，人之安宅也。</span></strong><span>夫：是助词，说仁是天之尊爵也。我们先讲什么叫做爵呢？以前讲爵位，就是说明这个人的位置很高，是受人尊重的。如果一个人是有仁的，内心有仁，他做的事情是仁的，天是尊重这样的人的，老天是把这样的人放在爵位上的，也就是放在高位上。当老天把这样的人放在高位上，就会给予他更多，就会匹配给他更多。所以，我们去看古代有爵位的人，他会有更多的俸禄，他会有更多的荣誉，他会受到更多人的尊重和敬仰。</span></p><p><span>老天喜欢有仁之人，那不光是老天喜欢，想一想我们人，是不是也喜欢有仁爱，有仁德之人？我们愿意和君子打交道，我们愿意和仁爱的人相处，我们都不愿意和小人相处，所以叫人之安宅也。</span></p><p><span>我们看什么叫做安宅？我们去想一想，我们的宅当中都有什么？有自己的父母，有自己的妻儿，也就是一家老小都在家宅之中。一个人有了仁，你就可以安宅，当你去做更多帮助别人的事情，别人见到你的家人都是尊重的。</span></p><p><span>可是如果一个人总是做欺骗他人的事情，做伤害他人的事情，那就是不仁的，当你去做不仁之事，别人看到你的家人是要唾弃的，看到你的家人是背后要指指点点的。如果你去做了欺骗他人的事情，别人会找到家里来的，向我们去讨要，甚至我们要惹上官司的，就没有办法安居乐业，我们的家宅是不安宁的。</span></p><p><span>一个人有了仁，老天会尊重这样的人，把他放在高位，给予和匹配给他更多的东西，并且我们一家老小才可以幸福安定地生活，这就是仁的重要性。</span></p><p><strong><span>莫之御而不仁，是不智也。</span></strong><span>莫：是没有；御：是阻挡，如果没有人去阻挡，却不去做仁德的事情，这是没有智慧的表现。我们去想一想，我们生活当中，有人阻挡我们去行仁德之事吗？似乎也有，比如说，有的人可能被强迫，被压迫，不得不去做骗人的事情，如果你不做，可能危及到了你的生命，危及到了你的人身安全，这个时候叫有人阻挡。</span></p><p><span>可是想想我们大多数时候，并没有人去阻挡我们，没有人去强迫、要求我们不许做仁德之事。所以说，没有人阻挡，我们却不去做仁德的事，做对他人有益的事情，这是没有智慧的表现。所以孔子讲，里仁为美，择不处仁，焉得智？如果你不去做仁德之事，是没有智慧的表现。</span></p><p><span>从这个角度看来，好像我们很多人都是没有智慧的表现，我们有的那个，似乎叫聪明。我们总是想要索取更多，我们总是做着伤害他人的事情，总是在满足自己的贪欲，想让自己得到更多的利益。</span></p><p><span>但是智慧则不同，智慧是你可以看清楚事情的真相。孔子告诉我们，里仁为美，孟子告诉我们，老天尊重有仁之人，可以让人去安宅，所以说，当没有人阻挡，我们还不能去行仁德之事，这就是没有智慧的。</span></p><p><span>我们学了圣贤文化以后，要变成一个智者，我们要清楚地知道，该做什么样的事情，不该做什么样的事情。当我们去行仁，老天就会给予和匹配给我们更多，也可以让我们自己生活得更好，可以安定自己的家。如果反之，我们去做不仁之事，老天就不会给我们匹配和给予更多，我们自己的家也没有办法变得更安定，变得更和谐。</span></p><p><strong><span>不仁不智，无礼无义，人役也。</span></strong><span>我们来看孟子，这句话讲得很重，如果一个人没有仁，没有智，没有礼，没有义，就一定会被他人仆役，被他人役使，并且不受尊重。什么叫做仆役呢？是要做很多工作的，身不由己，并且不受他人的尊重。</span></p><p><span>我们来举例子，看看我们很多人是不是这样的？说我们在一个企业当中，什么叫做仁呢？有没有为公司着想，有没有想着如何去利益自己的同事，有没有想着如何去帮助自己的顾客。</span></p><p><span>我们再看有没有礼，有没有辞让之心，我们懂不懂得跟领导，跟同事，跟客户之间是辞让的，是谦让的。</span></p><p><span>我们有没有把公司的困难当成自己的困难，比如说公司在遇到难关之时，我们有没有想过，我可以贡献哪些力量，我可以去担当什么事情。如果我们也没有这些奉献精神，也没有为公司着想过，也不想着去帮助同事和顾客，我们不就是被人役使，并且不受尊重的人吗？如果我们是这样的人，你去想一想，公司当中的领导会来尊重我们吗？同事会来赞叹我们吗？顾客会对我们产生留恋之情吗？似乎好像都不会。</span></p><p><span>我们举个例子，在一个家庭当中也是一样的，如果其中的某一位家庭成员，不去想着为这个家庭承担更多的责任，也没有想着帮助家庭当中的其他人，也并不想为这个家庭付出更多，你看这样的人不就是仆役之人吗？家里没有人尊重他，没有人看得起他。</span></p><p><span>我们再来看孟子形容的这句话，如果我们没有仁，没有智，没有礼，没有义，那就成了仆役了，不受人尊重，没有人把我们放在心上。所以，我们生活当中，很多人会去感叹说，我人微言轻，没有人在乎我，在公司也没有人尊重我，我在家里也没有人看得起我。</span></p><p><span>这个时候，我们就要思考了，为什么会有今天的结果？我们可有仁、义、礼、智，在其中？如果我没有去为他人着想过，我没有去付出和贡献过，我也不懂得礼让，我也不懂得去做合适宜的事情，别人要如何尊重我们呢？我们不就是那个仆役吗？总是被人役使，并没有人愿意去尊重我们。所以，如果我们发现自己是这样的人，我们就要懂得去改变了。</span></p><p><span>到底该如何去改变我们的现状呢？不要去做一个被人役使的人，我们看孟子接下来会给我们答案。<strong>人役而耻为役。</strong>这个耻字很重要，当做仆役之人，以做仆役为耻，产生了羞耻之心，就会想办法去改变现状，但是如果不以为耻，就不会去改变现状。</span></p><p><span>我们举例子，比如说，我们在一个企业当中，从来没有想过仁、义、礼、智，没有想过去担当和贡献，有的人是不以为耻的，甚至认为公司跟我有什么关系呢？公司做得好不好，只要给我发工资就可以了。</span></p><p><span>我们在家庭当中也是一样的，这个家过得好不好，跟我有什么关系呢？只要有我一口吃的就可以了，当这样想的人，就是没有羞耻之心，他的羞耻之心并没有生发起来，所以就会变成了这个样子，当我们以此为耻，你就会想办法去改变。</span></p><p><strong><span>由弓人而耻为弓、矢人而耻为矢也。</span></strong><span>就好像是做弓的人，以自己做弓为耻；做箭的人，以自己做箭为耻。</span></p><p><strong><span>如耻之，莫如为仁。</span></strong><span>如果有了羞耻之心，那就去做仁德之事就好了，这一段我们要用来思考，看看自己是不是无仁无智，无礼无义。如果我们发现好像很多地方，我确实做的不够，也生起了羞耻之心，我们接下来想要去做改变，很简单，莫如为仁，我接下来就去做有仁的事情就好了。</span></p><p><span>如果在一个家庭当中，我去想着怎么为家庭的其他成员去着想，怎么去帮助到这些人，让他们可以生活得更幸福，我们可以共同创造一个和谐美满的家庭环境。</span></p><p><span>如果我在一个企业当中，我就要去思考了，我如何才可以贡献自己的一份力量，我如何才可以去担当，当我们去担当更多的事情，当我们去行仁，当我们有了智慧，当我们懂得礼让，这个时候，自然会受到他人的尊敬和重视。</span></p><p><span>当我们生起了羞耻之心，这个时候不需要去自责，我们接下来去为仁就好了。我们要进而去思考，说我生起了仁心，我想要去在这个企业当中有更多的担当，我想要在这个社会上有更多的担当，或者说，我想在我的家庭生活当中有更多的担当，这个心我们已经有了，接下来就是如何做。</span></p><p><span>我们要不停地让这个仁心扩而充之，让它变得扩大，让它变得充实，并且我们还要提升自己行仁的能力，我们只有心是不够的，还需要有能力，才可以去做更多符合仁的事情。</span></p><p><span>如何去提升能力？<strong>仁者如射，射者正己而后发。</strong>说行仁这件事情，就像射箭是一样的道理，首先要端正射箭的姿势，射箭的标准，如何去发力。而后发，这个时候箭才会发出去。</span></p><p><span>所以说行仁和射箭是一样的，首先要先端正自己，看看自己的心是否合了仁，然后，我们再去看我们的行为，一步一步地去端正它，看我们哪件事情做的还不够仁，在不停地练习的过程当中，也就是正己的过程。</span></p><p><strong><span>发而不中，不怨胜己者。</span></strong><span>如果我们射箭没有射中，并且别人射中了，这个时候，不怨胜己者，我们不怪他。</span></p><p><strong><span>反求诸己而已矣。</span></strong><span>这个时候，我们要反过来去要求自己，提升自己射箭的技能。我们再讲行仁也是如此，当我们发现别人更有仁德，我们就向对方去学习，去学习他的心，他有一颗怎样的仁心，去学习他通过什么样的方式，通过什么样的行为去行仁。</span></p><p><span>我们来学习，学习到更多行仁的方法，然后我们反复加以练习。就像射箭是一样的，这一次我们没有射中，那我们就要去思考，究竟是我们的发力方式不对？还是我们缺少练习呢？还是我们自己瞄准的技艺不够准确？所以，我们去不停地总结其中的问题，然后来反求诸己，不停地去提升我们自己，我们就会变得扩而充之，让自己变得越来越懂得去行仁，并且也有这个能力去行仁德之事。</span></p><p><span>我们再来看整个这一段，孟子告诉我们，每个人都有不忍人之心，那颗仁心我们是每个人都有的，但是它可能被欲望所蒙蔽住了，所以，我们就去做成了役人，被他人仆役，并且不受人尊重。如果我们以之为耻，我们发现了这个问题，那我们就去做行仁之事。</span></p><p><span>我们先有了这颗仁心，接下来就如射箭一样，我们要不停地端正自己，我们不停地去找到其中的问题，看到自己的不足，反求诸己，我们不停地来提升自己，这就是扩而充之的过程，我们会让仁心变得越来越有光芒，我们会让自己行仁的能力越来越强大。</span></p><p><span>我们再把这一讲作一句总结：术不可不慎。我们选择自己的谋生之道，我们选择自己的生活领域，不可以不慎重，看看这件事情是否是符合仁的，如果用四个字来总结叫做：仁心仁术。</span></p><p><span>我们先看看自己有没有仁心。举例子，如果一个做老师之人，所选择的职业是符合仁术的，但是我看看自己有没有仁心，我是否从孩子的角度出发，希望让我的学生变得更好。如果我是做一个医生的人，那我们选择的这个行业，这个职业，是仁术，没有问题的。那我们就再来看自己的仁心，我们是否愿意救死扶伤，我们是否去想要帮助他人解决内心，或者身体上的痛苦。</span></p><p><span>所以，我们既要注重自己选择的事情，那个职业叫做仁术，选择职业以后，我们还需要反复去斟酌，去扪心自问，我们做的这个事情是否符合仁心，用四个字来总结：仁心仁术。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑧-1 闻过则喜",
    "date": "2022-10-26",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑧-1 闻过则喜</span></strong></p><p><strong><span>孟子曰：子路，人告之以有过则喜；禹，闻善言则拜。大舜有大焉，善与人同，舍己从人。乐取于人以为善。</span></strong></p><p><span>上一讲课程，我们讲到，术不可不慎也。术，我们可以把它理解成技能、职业，我想要做什么样的工作，我用什么样的手艺，这都叫术。但是我们这里做一下提升，我们要注意一点，就是我们的术不要成为生存技能，当我们把它看成生存技能，都是利己的。</span></p><p><span>我们去回想一下，我们是怎么教育自己的孩子的，比如说，你告诉他，你要好好学习，将来考个好的大学，这样你可以找一个好的工作；或者说我们告诉孩子，说你要学一门手艺，将来你可以养家糊口；说你要去做一位老师，做一位医生，这样工作是稳定的，工资是固定的，并且受人尊重。这都是沦为了生存技能，我们要在术的面前加上仁，叫仁心仁术。</span></p><p><span>看看我们有多少人告诉自己的孩子，是先把仁放在前，把术放在后的？教育我们的孩子要去做一名老师，为什么？当你去做一名老师，那是心灵的工程师，你可以教给更多孩子做人的道理，你可以教给更多孩子学问，让他们长大做一个对社会有贡献，有价值的人，这叫仁心仁术。</span></p><p><span>术不仅仅是技能，我们如果把它沦为生存技能，就完全是利己的。这个时候，我们的满脑子充满着利益，这种利益驱使着我们，欲望就会变得越来越多，我们的生活也会变得越来越痛苦，人们会不停地去追逐利益和欲望，所以产生的相应的烦恼就会很多。</span></p><p><span>但是我们加上仁心仁术则不同，加上仁心，我们选择一个职业，我们选择一个工作，是想着怎么利益和帮助到他人的，比如说我们告诉孩子，你要努力地读书，将来做一个对社会有贡献，有价值的人。当你把仁放在前，术放在后，你会发现，从小这个孩子他想的东西跟别人就不一样，他会变成一个有担当，有责任心的人，他会变得更加有力量。</span></p><p><span>比如说，让他学一门手艺也是一样的，说我们去学一门手艺，将来可以用这个手艺给别人提供一些帮助，给别人提供一些便利。比如说，我们去经商也是一样，说你教给孩子去做生意，说去开一个服装店，去开一家酒店，去开一家饭店，你让他想着如何为更多人提供优质的服务，可口的饭菜，舒适的环境，这个时候，他的出发点就是不一样的。</span></p><p><span>所以，我们不要把术沦为生存的技能，这个时候完全都是利己主义，而这种利己只会滋生我们的欲望，带来的相应的烦恼和痛苦就会越来越多。但是我们用仁心仁术则不同，我们的出发点是如何给别人提供帮助和服务，这个时候，我们内心会充满着喜悦，你不会被欲望和利益所驱使着，我们可以做一个轻松自在的人。</span></p><p><span>接下来孟子就要讲到，为何通过不同的出发点，会有不同的成就。我们接下来看子路，看大禹，看大舜，他们也在用术，但是他们的出发点不同，他们是用仁心在前，术，也就是生存技能在后。</span></p><p><span>我们接下来学习孟子是如何讲的，<strong>孟子曰：子路，人告之以有过则喜。</strong>孟子首先提到了子路，别人告诉子路他是有过错的，子路则喜，这个时候他很开心，和我们普通人不太一样；普通人别人告诉我们有过错，我们是不开心的，不高兴。我们只想让别人赞美我们，只想让别人表扬我们，只想让别人看到我们的好，而不是指出我的错误。</span></p><p><span>我们去想一想，为什么有人告诉子路他有过错，他会很开心呢？他的人生的意义和目的不相同，所以他跟普通人就不一样。普通人的目的只是为了炫耀我自己，让我自己呈现出来更好的东西，所以，我只想得到别人的赞美、夸奖。而子路的目的和意义在于，他想要做一个更好的自己，他想要去践行老师说的文化，他想要去修正自己。所以，我们去想一想是不是这样的道理？</span></p><p><span>一个人是想要提升自己的，想让自己变得更好，故而别人提出自己的过错，则喜。我们举个例子，比如说，我们现在正在学习做一道菜，我们特别希望把菜做好，我们想提升自己的厨艺，这个时候，如果有一个人可以指点我们，看看我们是否是开心的。他告诉我们油放多了，糖放少了，这个盐放的时机不合适，如果再晚放两分钟效果会更好，你看我们这个时候，是不是开心和喜悦的。所以，这个开心和喜悦，是源于我们的目的不同，我们的目的是想要提升厨艺，所以这个时候别人提出问题，提出过错，我们是很开心的。</span></p><p><span>但是我们去想想，好像我们大多数人的目的，并不懂得提升自己为关键，所以我们一定要把这个问题的核心找到，并且我们知道，我们的目的和意义在于提升自己。这个时候，别人提出我们的过错，我们是开心的，我们是愿意接受的，这是孟子讲的第一步。</span></p><p><span>更进一步，我们看看是谁呢？<strong>禹，闻善言则拜。</strong>更进一步的讲到了大禹，我们都知道大禹治水的故事，并且大禹是一位圣明的君王，禹比子路又近了一步，当他听到善言，他是要拜谢的。</span></p><p><span>我们去想一想，为什么他听到善言会去拜谢呢？这里的核心到底又是什么呢？禹，做君王，他是为天下百姓着想的，那么别人提出的善言，就是对天下百姓有益的，所以，这个时候他会去拜谢。</span></p><p><span>我们来举个例子，如果我们经营一个企业，如果你的企业有几百上千的员工，这个时候，如果有人提出善言，告诉你如何去管理一个企业，如何去管理好自己的员工，如何去提升业绩，如何让团队运行得更顺畅，更和谐，这个时候，你看看我们是不是拜谢的。</span></p><p><span>这里的核心在于，禹为何会拜谢呢？是因为他有更多的责任和担当，当他有更多的责任和担当，他看到的东西不一样了，他不再是以自我为中心，而是以天下为己任。</span></p><p><span>我们去学习技能，看看是不是这个样子的。如果我们是做老师的人，别人提出善言，如果我们是以孩子的成长为己任的，我们是要拜谢的，因为人家提出的意见可能是让我们自己更好，或者告诉我们现在的教学方法还可以有所提升，还可以用什么样的思维去教育孩子，我们是要拜谢的。</span></p><p><span>那也就是禹和子路的区别在于，子路想要成为一个更好的自己，所以闻过则喜。而大禹他有更多的责任和担当，以天下的百姓为己任，所以他闻善言是要拜谢的。因为禹听到的善言，无论是提升他自己的，还是对天下百姓有益的，最后都是会利益到百姓身上，故而需要去拜谢。我们可以看到，当一个人内在有了担当，有了责任感，这个时候，你的出发点是不一样的，不会考虑那么多我的感受和我的得失。</span></p><p><span>我们再回到刚才的话题，术不可不慎也，如果我们选择的术只是为了利己的，希望自己可以过上一个好的生活，这个时候，别人提出我们的过错，我们是不开心的，甚至我们会记恨他人，更不要去谈拜谢他人，不会有这样的想法。</span></p><p><span>可是，如果我们学的术，是把仁放在前，术放在后呢？我们选择的职业，是希望帮助更多人，这个时候，我们愿意别人提出我的过错。再进一步，别人提出善言，我是要感谢对方的，感谢他来指点我，可以让我更好地提升，可以让我更好地去帮助他人。目的和赋予的意义不同，我们面对一件事情，选择的方式和面对的态度就不相同。</span></p><p><span>如果我们完全是为了自己，我们不喜欢别人说我的过错，我闻善言也更不会拜谢；但是我们以提升自己为目的，我们以天下百姓，以更多人的发展或者是好处为己任，这个时候，我们听到善言会去拜谢的。</span></p><p><span>我们看孟子再进一步，会讲到什么人呢？<strong>大舜有大焉。</strong>这里的大焉，指的是更伟大之处。先是提到了子路，闻过则喜，又提到了禹，闻善言则拜，接下来又提到了大舜，说大舜有更伟大之处，我们看什么更伟大之处呢？</span></p><p><strong><span>善与人同。</span></strong><span>这句话讲的妙，什么叫善与人同呢？善与他人相同。我们举个例子就好理解了，比如说有高有低，什么叫善与人同呢？当我们高的时候，我们可以去教给那些低的人，让我们保持相同；当我们低的时候，别人高的时候，我们善于去向他学习，跟他保持相同。</span></p><p><span>所以，你看这句话对于我们大多数人来讲，难不难达到？我们先说第一点，当我们比别人优秀的时候，有多少人心甘情愿地把我会的东西教给对方，让对方和我保持相同呢？这需要无私，我们没有那么多的私欲，所以我可以把我会的东西，把优于别人的地方教给他，让他与我相同。</span></p><p><span>我们看第二点，同样也很难。当别人比我们优秀的时候，我们是有容人之量的，并且愿意向他学习，去提升我自己，善与他相同。孔子讲，三人行必有我师焉，每个人都有优于我们的地方。我们愿意向优于我们的人，他的任何一个特点去学习，让我保持与他相同；而我优于别人的地方，我又愿意诚心诚意地去教给他，让他与我相同。所以孟子讲，大舜很伟大，是因为他善与人同。</span></p><p><strong><span>舍己从人。</span></strong><span>我们来看这四个字，舍己，他没有我；从人，我们看大舜他是做帝王的，做帝王的舍己从人，从谁啊？从百姓。我们再结合上一句话，善与人同，舍己从人，大舜他可以舍掉自己，没有我，善于从百姓。</span></p><p><span>我们来举例子，比如说百姓他想要去耕种，因为耕种对于百姓来讲是最重要的，他可以有更多的粮食，他可以换取其他的物品，他可以让一家人吃饱肚子。所以这个时候，大舜的善与人同，就是要去学习耕种的技术，当他去学习了耕种，然后教给百姓去耕种，利益这些百姓。</span></p><p><span>我们看大舜所学的术，不是为了自己的，他是舍己从人，舍弃了自己喜欢的，或者是想要做的事情，而从百姓去耕种。比如说，百姓想要去捕鱼，那么大舜又会去学习捕鱼，并且把捕鱼的这些技术教给了百姓，让他们可以通过捕鱼，让自己的生活变得更好。</span></p><p><strong><span>乐取于人以为善。</span></strong><span>我们先看以为善，学习的目的是为了行善。乐取于人，那想要去行善，拿什么去行善呢？很快乐地取自于他人，从他人那里学来的东西用来行善。</span></p><p><span>比如说，大舜他可能并不会捕鱼，并不会耕种，或者并不会做一些其他的事情，但是他想要去以为善，他想要去帮助更多的人，所以他可以乐取于人。他可以学习如何去耕种以为善，去帮助百姓；他可以学习如何去捕鱼以为善，去帮助百姓；他可以学习更多的技能，比如说，制陶以为善，去教给百姓，帮助百姓。那我们看大舜的伟大之处，善与人同，舍己从人，然后从别人那里吸取更多的技能，去以为善，帮助更多的人，这一点我们是可以学到的。</span></p><p><span>如果我们自己学习一个技能，不只是为了我的养家糊口，不只是为了让我自己过上好的生活，而我是以为善为目的，我想要去帮助更多人，所以，我就可以善与人同，我就可以舍己从人。</span></p><p><span>我们再来举个例子，我们教给自己的孩子，也是如此。如果你让孩子从小有一个这样的价值观，你要让他做事情是以行善为目的和意义，这个时候，我们就可以去观察自身和观察社会现状，我们去看看这个社会现状缺少什么，那我们就善与人同，去学习那些优秀的人，并且自然也就舍己从人，不再去看自己怎么想，而是去看他人所需要，那么最后自然可以吸取更多的东西，以为善，去帮助更多人。</span></p><p><span>我们自己也是一样的，你说我现在想要做一个生意，但是我不知道做什么，很简单。如果你以为善当作意义和目的，我就去观察，舍己从人，看看现在他人都需要哪方面的帮助，我可以从哪个领域去发挥自己的长处，从而帮助到更多人。这个时候，你就可以善与人同，你去学习他人的优点，学习他人的长处，吸取了更多的技能，用来以为善，去帮助更多人。</span></p><p><span>所以，我们再回顾这节课程开始的时候，我们所举的例子，如果我们只是把术当成了生存技能，我们都是为己的，我们就会看不清楚很多事情的真相，我们看不清楚他人的所需。</span></p><p><span>但是如果是仁心仁术，我们是以帮助他人，以为善，当做我们的目标，这个时候，我们自然可以去看清楚更多人的需求，我们这个时候的术，就成了帮助他人的技能，帮助他人的方法，而不只是自己谋生的手段。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑧-2 与人为善",
    "date": "2022-10-28",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑧-2 与人为善</span></strong></p><p><strong><span>自耕稼陶渔，以至为帝，无非取于人者。取诸人以为善，是与人为善者也。故君子莫大乎与人为善。</span></strong></p><p><strong><span>自耕稼陶渔，以至为帝，无非取于人者。</span></strong><span>耕嫁：指的是耕种，也就是做农夫；陶：指的是制陶，也就是陶工；渔：指的是捕鱼；以至为帝：最后到做了帝王。讲到大舜从最开始做农夫，做陶工，做捕鱼，最后一直到帝王。</span></p><p><span>无非取于人者，没有哪一项，不是向别人学习而来的。这里给了我们一个学习的方向，无论我们会不会种地，会不会捕鱼，会不会制陶，会不会做帝王都没有关系，只要我们有一个以为善的目的，有了这样一个方向，我们做事情是想帮助更多人的，我们都可以取自他人，因为有了这颗行善的心，我们就会舍己从人，看他人所需。</span></p><p><span>比如说在大舜那个时代，人们需要耕种，那么大舜就可以去学习耕种，并且可以看到对于耕种有才华的人，可以邀请这些人与他一起去行善，一起去教给更多的百姓耕种。比如说可能不会捕鱼，但是那个时候的人们，需要以捕鱼为生，那么就可以去学习捕鱼，并且带动更多的百姓去捕鱼。</span></p><p><span>比如说，当人们的生活条件开始有所改善，需要一些陶器，那么，这个时候就可以去学习制陶，并且发现一些能制陶的人，与大舜一起去行善，帮助更多的百姓，既让百姓有了陶制品可以用，又可以把多余的制作的陶制品拿来换其他的货物，比如说换取粮食。</span></p><p><span>再比如说，当人们手里有了粮食，有的人有了陶器，有的人有了鱼，还有的人有了其他的物品，那么大家需要做一些物品的交换，来充实自己的生活，大舜又发明了市集，可以让人们集中在这里交换物品。最后交换物品的时候，发现总是拿着东西，换来换去的很繁琐，所以后来又发明了钱币。</span></p><p><span>我们可以看大舜所做的事情，都是舍己从人的，都是去看百姓，看他人的所需，他们现在需要做什么，那我就去学什么，所以叫无非取于人者。</span></p><p><span>我们所会的所有的东西，其实都是取自于他人的。比如说我们从小学习，读小学，读初中，读高中，读大学，我们所学的所有的知识，无非取于人者，都是老师教给我们的。我们现在所穿的东西也一样，我们穿的衣服，我们穿的裤子，我们穿的鞋子，我们用的手机，无非取于人者，都是从他人那里学来的，或者是获取的。我们现在住的房子，我们现在开的车子，有哪一样不是取自于他人呢？</span></p><p><span>其实我们本来都是一无所有的，我们什么都没有，都是从他人那里获取来的。所以既然是从他人那里获取来的，我们就要懂得以为善，我们要懂得我们获取的东西可以用来帮助更多的人。</span></p><p><span>比如说，我们获取了知识，我们获取了文化，我们获取了智慧，我们获取了德行，我们获取了忠信，我们明白了仁义，我们都要把这些再去以为善，去帮助更多的人。比如说我们获取了财物，我们获取了地位，我们获取了企业，我们获取了团队，我们获取了什么样的技能，我们都可以把这些获取的东西，以为善，去帮助更多的人。</span></p><p><span>所以它们是相互的作用，当我们获取的更多，我们就去以为善，帮助更多人。当我们现在还没有获取那么多，我们要先以为善当作我们的目的，仁心仁术。当我们以为善，我们就可以去获取更多的东西，我们可以从别人那里学习一些技能，可以学习智慧，可以学习德行，可以学习某个领域的手艺，我们把学来的东西再去以为善，去帮助更多的人。</span></p><p><strong><span>取诸人以为善，是与人为善者也。</span></strong><span>我们看这句话的重点，叫做与人为善，什么叫做与人为善呢？就是和他人一同去行善。</span></p><p><span>我们看这个格局就大了，举例说的大舜，他所学的东西，无非取于人者，都是从别人那里学习来的，这就是在与人为善，就是在与他人一起为善。我们举个例子，比如说大舜那个时候，有负责耕种的人，叫做后稷，后稷非常擅长于耕种，所以大舜和后稷学习耕种，并且让后稷和他一起帮助更多的百姓，这个时候的力量就会变大。</span></p><p><span>这里我们要看一个关键点，比如说后稷擅长耕种，即使大舜和后稷去学习，他也未必可以学到后稷的能力和水平，与其跟他学习，不如让后稷和他一起行善，去帮助更多人，这叫与人为善。</span></p><p><span>我们去看现在的社会也是一样的，我们去看看那些有成就的人，是不是都是与人为善呢？比如说，我不擅长某方面的技能，我可以找来擅长这方面技能的人，让他和我一起做事情，这就叫与人为善。</span></p><p><span>所以，你看人的格局和境界就变大了，当我们自己的内在有仁德之心，我们是以为善为目的的，我们不会存私，我们会向他人学习，并且邀请有能力的人，有某方面技能的人，有共同想法的人，邀请他来一起和我们去做更多的善行，可以利益更多的人。</span></p><p><span>一个人的力量是有限的，但是与人为善，大家共同去帮助更多的人，力量会变得越来越强大。所以当我们有了那颗仁心，当我们有了以为善为目的的这种想法，我们就可以邀请更多的人，与人为善，大家共同去帮助更多的人。</span></p><p><strong><span>故君子莫大乎与人为善。</span></strong><span>这句话是最后的总结，一个君子做的最大的行善，莫过于与人为善。我们看这里，先看为善，为善就是我们去帮助更多人；与人为善，就是和他人一同去帮助更多的人。所以，一个君子是有能量的，一个君子是有德行的，不光自己为善，还要和他人共同地去为善，这个时候的力量会变得更强大，可以去帮助更多的人。</span></p><p><span>我们再来回顾这一句话，我们来做个总结。首先我们讲了术不可不慎也，我们去选择技能，不要把它沦为生存的技能，不要是为了自己能过上好的生活，这个背后伴随着欲望，伴随着利益，而欲望背后伴随着痛苦，伴随着烦恼，伴随着永不知足。而我们要改变一个方向，仁心仁术，我们要懂得先去以为善，以为善当作我们的目的，把它赋予以为善为意义，这个时候，我们再学习的术，都是帮助别人的方法。</span></p><p><span>当我们有了以为善作为我们的目的和方向，接下来孟子又讲了一个次第。</span></p><p><span>当我们有这个方向，我们就可以像子路一样，闻过则喜，别人说我们的过错，说我们的不足，我们是很开心的，因为我们可以提升自己，进而可以去帮助更多的人。</span></p><p><span>进一步又提到了禹，闻善言则拜。因为禹是有担当的，是以天下百姓为己任的，他是有责任的，所以听到别人的善言是要拜谢的，因为他所说的善言是可以让我更好的，利益到百姓的。</span></p><p><span>进而又提到了舜，他有更伟大的地方，他可以善与人同，可以舍己从人，又把以为善上升了一个境界。我们去懂得与他人相同，别人低于我们的地方，我们愿意教给他，这就是以为善；别人高于我们的地方，我们努力地向他学习，向他看齐，提升自己，也是为了以为善。我们可以舍己从人，舍掉自己，没有我，去看看他人学什么，这是不停地在上升以为善的境界。当我们有了这些以为善的境界和方向，我们就可以从他人那里去学习，无论是耕种、捕鱼、制陶，还是为帝王，无非取于人者，都是可以从别人那里学习来的。</span></p><p><span>最后又上升了一个境界，何为君子？君子不光自己为善，还要与人为善，和他人共同去帮助更多的人。</span></p><p><span>我们去看那些君子，不光自己善于学习，善于提升自己，闻过则喜。并且听到别人的善言是很感谢的，因为我可以提升自己，看到自己的不足，可以帮助更多的人，可以承载更多的事情。进而我可以舍己从人，我可以舍掉自己的那些东西，自己的那些想法，看看别人需要什么。我也可以善与人同，不足的地方我向别人学习，比别人好的地方我可以教给他，我善于以万物为师。最后，我们君子的胸怀和气魄就出来了，不光自己为善，我们可以邀请更多优秀的人与我们一起为善。</span></p><p><span>所以，我们去看那些伟大的贤人君子，他们所做的事情，也正是孟子今天所告诉给我们的次第。</span></p><p><span>我们就知道了，从一开始选择技能，我们就要术不可不慎，我们要懂得从一开始的想法，就不是为了自己的生存，而是为了以为善为目的和方向，它会让我们整个价值观，整个人的格局变得不相同。如果我们懂得这样去教育我们的孩子，从小的时候，他的价值观，他的胸怀，他心里的方向就与人不同。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑨-1 两种极致之人",
    "date": "2022-10-26",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑨-1 两种极致之人</span></strong></p><p><strong><span>孟子曰：“伯夷，非其君不事，非其友不友。不立于恶人之朝，不与恶人言。立于恶人之朝，与恶人言，如以朝衣朝冠，坐于塗炭。”</span></strong></p><p><span>今天我们讲到公孙丑上的最后一段话，我们去回顾整个公孙丑上都讲了什么。公孙丑，孟子的学生，问了孟子一个问题，说假使老师您来执掌齐国的朝政，可以像管仲和晏子那个样子，恢复以前齐国的霸业吗？最后孟子说，那不是我想要的，我想要的是实行王道，也就是推行仁政，而管仲和晏子，他们实行的是霸道，这个是有所不同的。</span></p><p><span>进而又围绕着仁政开始展开，讲到了浩然之气，讲到了不动心。接下来又进而讲了一个规律：仁则荣，不仁则辱。那么作为一个君主，要懂得去为全天下的人去着想，去为从政的人着想，让这些有志之士可以实现自己的才华和理想，要为那些经商的人去着想，要为耕种的农民去着想，要为旅人去着想，要为那些外来的人员去着想，这个就是在实行仁政。</span></p><p><span>接下来又讲到不忍人之心，每个人内在都是有这颗仁心的，只不过我们需要扩而充之，让这个仁心变得越来越大，散发它本有的光明。</span></p><p><span>进而又讲到术不可不慎也，告诉我们如何去选择一个符合仁的职业。举了几个例子，比如说，做箭的人和做盔甲的人，做盔甲的人，他是想着如何不伤害他人，所以更符合了内在的仁；而去做箭的人，唯恐自己的箭不够锋利，不能伤害到他人，所以他就违背了自己内在的仁。做巫医和做棺椁之人也是如此，虽然他们的职业并不受人尊重，但是他们所做的事情，却是在帮助他人，所以符合了内在的仁。</span></p><p><span>从而告诉我们，去看待一个人，去看待一件事情，不要通过事情的表面，而是要去看他的内在，是否合了我们自己内心的仁之端也。所以，选择自己的职业，一定要去思考，它是否是仁的，是否去帮助到他人，所以叫仁心仁术。</span></p><p><span>进而又告诉我们，你选择一个行业，选择一种职业，到底该以什么为方向。不要把它沦为生存的技能，我只是为了有一个好的工作而去工作，我是为了将来有一个好的工作可以去谋食，而去学习，而是要懂得以为善为目的。当我们以为善为目的，我们再所学习的东西，你的出发点就不相同。这个时候就有了方向，有了志向。</span></p><p><span>那么到了公孙丑上的最后这一段话，孟子又告诉给我们，一个人要去行仁道，我们内在也是有仁的，但是这个仁，究竟我们要做到什么样的程度呢？我们要如何与他人相处？我们要如何去做事情？所以，这一段是整个公孙丑上的收尾，来做了一个总结。</span></p><p><span>在这段总结之前，我们来先思考一个问题，或者说观察一种现象，在生活当中通常会出现两种人，两种比较极致的人。我们来举个例子，比如说，有的家长会告诉孩子，你不能去跟一些品行不好的孩子一起玩，哪怕他有一点不好的地方也不可以，这是一种极致；还有另外一种极致，干脆不去管我们的孩子，他愿意和什么样的人玩，就和什么样的人玩，他愿意去做什么样的事情，就去做什么样的事情。</span></p><p><span>还有另外一种父母呢，孩子做这件事情不可以，比如说垃圾食品不能吃，比如说凉的东西不能吃，比如说每天必须几点睡觉，这是两种不同的极致。</span></p><p><span>我们再举例子，比如说生活当中也是一样的，说有的人很注重养生，吸烟有害健康，吸烟我是绝不会的，不喝酒，不吃辣，不吃咸的东西，要求必须清淡，不熬夜，总而言之，所有的有害于健康的事情，我都不会去做，这是一种极致。</span></p><p><span>还有另外一种极致，我什么都不在乎，嘴里说着生死有命，富贵在天，我不需要去注重我的身体，我也不需要去保养它，我也不害怕任何事情和任何东西，比如说烟、酒、食物给我带来的伤害，所以你看这是两种极端。</span></p><p><span>还有的人比如说，在做事情当中，或者在交朋友当中，什么样的朋友都可以交流，什么样的朋友都可以在一起工作，在一起玩耍，三教九流的朋友都有。还有一种交友会特别的慎重，只要我发现这个人说他不孝顺、不仁德、不忠信、不友爱，或者不懂得帮助他人，或者没有什么样的才能，我就不与他交友。</span></p><p><span>所以这里又呈现了两个极端，一个极端是，我对于交朋友这件事情非常的严格；还有一种，我无论什么样的朋友都可以与他交往。我们看生活当中，这两种人到底什么样的人才是更好的呢？</span></p><p><span>接下来我们看孟子，孟子在这段话当中，也举例子讲了两种人，这两种人都是古之圣贤，一位是伯夷，一位是柳下惠，我们来看孟子怎么讲？</span></p><p><strong><span>孟子曰：伯夷非其君不事，非其友不友。</span></strong><span>我们先简单介绍一下伯夷，我们跟着一起学过《论语》的朋友，对伯夷、叔齐应该很熟悉了。伯夷是商纣王时期，孤竹国国君的儿子，并且是长子。按理来讲，伯夷是要继承他父亲的诸侯国国君的位置，但是伯夷的父亲有意想把自己的位置传给叔齐，所以伯夷就离开了孤竹国这个地方。</span></p><p><span>我们可以看到伯夷的孝顺，他是为了满足父亲的想法和意愿，故而放弃了他本应该得到的那个位置。</span></p><p><span>并且还不光如此，伯夷听说周文王是一位贤德之人，就想去周文王那里，但是在去的路上，听说周文王已经离世了。</span></p><p><span>他听说周文王离世以后，这个时候又知道了武王正在举兵伐纣，伐商纣王，这个时候伯夷是去劝阻周武王的，是不希望他去伐纣的。为什么呢？这个叫以臣弑君，以下犯上，在伯夷的价值观当中，这个是不被允许的。但是武王并没有听从伯夷的劝阻，因为武王认为自己是领了天命之人，是因为商纣王昏庸无道，百姓生活在困苦之中，故而要举兵去伐纣。但是伯夷是不认同的，所以就开始隐居在首阳山。</span></p><p><span>后来武王伐纣得了天下，建立了周朝，曾经是来请过伯夷的，因为武王知道伯夷是一位贤德，并且有才能之人，所以想请伯夷来到周朝为官，可以为天下贡献一点力量。但是伯夷是断然拒绝的，他不但拒绝，而且不食周粟，也就是不吃周朝的粮食，采薇而食，吃野果，最后饿死在首阳山。</span></p><p><span>我们看孟子是如何讲伯夷其人的，说非其君不事，非其友不友。不是自己的君主，他是不去侍奉的；不是自己的朋友，他是不去交往的。</span></p><p><span>我们要看这里的其君，它有两层含义：第一层含义，不是我的君主，我不去事奉。比如说，武王建立了周朝，想请伯夷去为官，他是不事的，因为他认为武王不是我的君主，商纣王才是我的君主。那么还有第二层意思，商纣王在位期间，伯夷是隐居在渤海边的，他也没有去事奉商纣王，为什么呢？这个也叫非其君，因为商纣王不是贤德之君，他是昏庸无道的，所以在伯夷的心中，这个也叫非其君。</span></p><p><span>我们总结非其君两个概念，第一个概念，不是我的君主；第二个概念，不是一位明主，所以我不去事奉。</span></p><p><span>非其友不友，本来不是我朋友的人，我是不会与之交友的。那么第二层意思也一样，如果这个人不是贤德之人，我是不会与他交友的。</span></p><p><strong><span>不立于恶人之朝，不与恶人言。</span></strong><span>什么叫做恶人呢？他是对比于善人来讲的，善人是心怀天下的人，是可以去推行仁政的人，可以爱护百姓的人。为什么没有去商纣王那里为官呢？因为商纣王在伯夷的心中是恶人，因为他并不是与人为善，并不是去帮助百姓可以过上更好的生活，所以他是不会在朝为官的。</span></p><p><span>那么在伯夷的心中，武王亦是恶人，为何呢？因为他推翻了商纣王，那么是以下犯上，以臣弑君，所以他不会与这些人同朝为官，也不愿意为这些人去做事情，甚至不与恶人言，他认为不是善人的，不好的人，不合于礼法的人，我同你讲话都不可以。</span></p><p><span>所以，历史上有对于伯夷的评价，说伯夷其人，脏的东西，不好的东西，不看、不听、不言、不动。只要是他认为不好的东西，恶的东西，脏的东西，他是不会看的，更不会与之交往。</span></p><p><span>并且作了一个很形象的比方，说如果<strong>立于恶人之朝，与恶人言，如以朝衣朝冠。</strong>朝衣和朝冠，指的是上朝的时候穿的礼服和礼帽。我们去想象一下，上朝的时候所穿的衣服，它是非常隆重的，并且是身份的象征，也是礼法。这里作了一个比方，如果与恶人共立朝堂，如果与恶人讲话，好比是穿着非常隆重的礼帽、礼服。</span></p><p><strong><span>坐于塗炭。</span></strong><span>塗：指的是污泥；炭：指的是炭火。就好比是我穿着很隆重的衣服，却可以与污泥和炭火为伍，这是决然不可以的。</span></p><p><span>其实想想这个例子，我们就很好理解，比如说，如果今天我们出席正式的场合，我们可能穿着西装，穿着礼服，穿着我们自己认为的隆重的衣服，这个时候，我们会保持我们的站姿，保持我们的坐姿，因为我们怕我们的衣服会起皱，更不会去接近污泥和炭火，因为污泥会让我们的衣服变得脏，炭火会让我们的衣服损坏，或者是沾染了很多的灰尘。</span></p><p><span>所以，我们就可以看到伯夷的性格，他说与恶人同朝为官，或者与恶人为伍，或者与恶人讲话，就好像是我穿着这么隆重的衣服，我却沾染了污泥和炭火，这是决然不可以的。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑨-2 尔为尔 我为我",
    "date": "2022-10-27",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑨-2 尔为尔 我为我</span></strong></p><p><strong><span>推恶恶之心，思与乡人立，其冠不正，望望然去之，若将浼焉。是故诸侯虽有善其辞命而至者，不受也；不受也者，是亦不屑就已。柳下惠不羞汙君，不卑小官；进不隐贤，必以其道；遗佚而不怨，阨穷而不悯。故曰：‘尔为尔，我为我’。</span></strong></p><p><strong><span>推恶恶之心，</span></strong><span>把这种恶恶之心再扩大，<strong>思与乡人立。</strong>乡人：指的是我们的同乡、乡党，乡人和其他人的区别在什么地方？乡人是与我有关系的，但是关系又没有那么大，没有那么亲近。如果是陌生人，是没有关系的；如果是亲人，他的关系会更亲近，而乡人既有关系，但是又并不深厚。</span></p><p><strong><span>其冠不正。</span></strong><span>冠：指的是帽子，帽子不正。<strong>望望然去之。</strong>我们看望然是看一看，看上去，望望然放在一起，是说我看上去又有一点失望，又有一点无可奈何，又似乎做不了什么，所以望望然的离开了。</span></p><p><strong><span>若将浼焉。</span></strong><span>浼：是弄脏和玷污。好我们再来看整个这句话，这句话是在讲伯夷，说他自己不会与恶人同朝，也不会与恶人言语，就好像是我穿着隆重的衣服，怎么能让炭火和污泥来沾染了我呢？</span></p><p><span>接下来把这个概念推广开来，思与乡人立，好像和乡人立在一起，发现他戴的帽子不端正，这个时候，我看上去有些失望，又有些无可奈何。失望，是因为他的帽子戴的不端正；无可奈何，是因为他是乡人，我又没有办法像对待自己身边人，直接告诉他，你帽子戴的不正，或者直接帮他扶正。所以，只能失望的离开，因为不离开，我认为这是污染了我，把我也开始弄脏。所以我们讲伯夷，脏的东西，他认为不好的东西，不看、不听、不言。</span></p><p><strong><span>是故诸侯虽有善其辞命而至者，不受也。</span></strong><span>所以作了总结，有其他的诸侯国知道他的好，知道他的善，并且美言相劝，想让他去那里从政，去那里做事情，不受也，他是不接受的，为什么呢？他认为这些事情是不好的。</span></p><p><strong><span>不受也者，是亦不屑就已。</span></strong><span>为什么会不接受呢？因为他不屑于去就职，不愿意去做这样的事情。所以我们整个来看伯夷，他是非常极致的人，无论是他的忠，还是他的孝，或者是他交友的标准，都是极致的。</span></p><p><span>为了孝顺父亲，我可以放弃自己本应该得到的国君的位置，可以远走他乡。为了忠于商朝，他可以不去周朝为官，甚至可以不食周粟，最后饿死在首阳山。那他交友更是如此，如果这个朋友，他不贤德，我是绝对不会与之交往的。好像是我穿着隆重的衣服，怎么会去接近污泥呢？怎么又会去接近炭火呢？</span></p><p><span>孔子曾经讲过伯夷，说伯夷求仁而得仁，又有何怨乎呢？说伯夷是求仁的人，他为了求得这一个仁字，可以不要自己的生命，他可以不食周粟，所以，他是没有怨恨的人。</span></p><p><span>伯夷是一个把仁、孝、忠，交友都做到极致的人。我们来举个例子，就好比是一扇门，有的人把这个门开了一个很小的缝隙，除非很贤德的人，我极其认可的人，他才可以进入到这个门里，如果不是，他是没有办法进来的，这是第一种极致的人，如伯夷。</span></p><p><span>那么还有第二种极致的人，我的门是大敞四开的，不加任何的阻拦，任什么样的人都可以进得这个门来，我们接下来讲的正是第二种极致的人，叫做柳下惠。</span></p><p><strong><span>柳下惠不羞汙君。</span></strong><span>汙：通污染的污，也就是不好的，坏的意思。柳下惠去事奉即使一些不好的君主，我也可以去在朝为官，可以去事奉他，并且我不觉得这是一件羞耻的事情。</span></p><p><span>我们再讲讲柳下惠，柳下惠在鲁国为官，是管刑狱的，一个很小的官，官职不大。我们听说柳下惠这个人最有名的故事，莫过于柳下惠坐怀不乱。</span></p><p><span>并且柳下惠这个人是以贤德著称的，他的贤德闻名于各个诸侯国之间。我们可以讲一件小事情，就知道其他国家的人对其的尊重。有一次秦国去攻打齐国，路过了柳下惠的墓，这个时候，秦国的将领要求士兵，在柳下惠墓的五十步之内不许砍柴，如果砍柴立斩不赦。我们就可以看到，是对柳下惠贤德的一种尊重。</span></p><p><span>并且柳下惠坚持以直道事君。因为他在鲁国做的官职很小，总是数次被罢免，所以就有人去劝柳下惠，说你可以去其他的诸侯国为官，他的贤德是在各个诸侯国闻名的，相信去到哪个国家，都会被隆重接待，并且是可以被重视的，为什么偏要在鲁国做这么小的官，而且还总是被贬呢？</span></p><p><span>这个时候，柳下惠讲，我是以直道事君的，我是以直道去做事情，去为官，如果我以这种直道事君，即使去到其他的国家，同样会得罪很多人，我依然会被贬，那和我在鲁国又有什么区别呢？如果我可以改变自己的以直道事君，我在鲁国就可以有很好的未来，我又何必去其他的国家呢？</span></p><p><span>所以，柳下惠在朝为官，并不会在意君主是什么样子的人，无论你是贤明的君主也好，你是昏庸无道的君主也好，我都可以去事奉，我都可以按照自己的准则去做事情，而不觉得羞耻。</span></p><p><strong><span>不卑小官，进不隐贤，必以其道。</span></strong><span>不卑小官：不会觉得自己的官职小而觉得卑微，或者不努力地做事情。进不隐贤：说我做事情是不会隐藏自己的贤德与才干的。</span></p><p><span>我们看这八个字，这是我们要学习的优点。我们通常讲一个有贤德的人，或者有才能的人，都是有几分傲气的。我们去试想一下，我们身边是不是有很多这样的人，比如说有一定的才能，有一定的能力，如果给我的位置是小官，也就是职位不高，我是不屑于去做事情的，并且我不认真努力，甚至是消极怠工。</span></p><p><span>那进不隐贤同样做到也很难，当我们去做一件事情，我们可能想着隐藏我们的才能，我们觉得既然我的位置这么低，有一些事情不是我该管的，我为什么要去管呢？</span></p><p><span>所以，我们可以看到柳下惠其人，无论他的官职有多么小，只要他去做这件事情，他就会认真努力地去做，不会有所隐藏，更不会恃才傲物，不会认为自己有才能，所以做的官小我就不去努力。必以其道，他是按照自己的道，按照自己的价值观去做事情，他保有自己的风骨，不被别人所影响。</span></p><p><strong><span>遗佚而不怨。</span></strong><span>这里的佚:通的是失，失去的失,也就是遗失而不怨，即使把自己的官丢掉了，他也不会生怨。</span></p><p><strong><span>阨穷而不悯。</span></strong><span>悯:是忧愁；穷:指的是穷困；阨穷的阨是助词。穷我们很多人已经没有办法不忧愁了，但是柳下惠穷困潦倒到一定的程度，还不会觉得忧愁。</span></p><p><strong><span>故曰：尔为尔，我为我。</span></strong><span>这里的故曰，指的是柳下惠他自己曾经讲过的六个字：“尔为尔，我为我。”这六个字翻译起来很简单，你是你，我是我，但是其中所蕴含的道理和风骨可不简单。</span></p><p><span>我们来看，你是你，我是我，我们再用在柳下惠身上，我们就知道这六个字又何其的不简单。你做你的事情，我做我的事情，你做你的昏君，不影响我直道而行，不影响我是个贤臣。你是一个没有贤德的人，我可以与你交友，但是你不影响我的贤德，你怎么可以污染到我呢？所以你做你的事情，我做我的事情，我不会被你影响，我也不会被环境所影响，这是这六个字的绝妙之处。</span></p><p><span>所以，我们不妨把这六个字当成自己的座右铭，我们去告诉自己，尔为尔，我为我，你是你，我是我。举例子，你可以行不善之事，难道我就可以被你影响，去行不善之事吗？我可以对你好，我不需要你对我好，你可以欺骗我，难道我就要去欺骗他人吗？你可以为恶，你可以伤害到了我，难道我会因此而伤害他人吗？怎么会呢？我只是保持了我自己的风骨，我是直道而行的。</span></p><p><span>无论是什么样的君主在位，我都是直道而行；无论我去到什么样的国家，我也都是直道而行，我不会因为外界的环境和对方的变化，而改变了自己。所以这个恰恰是我们在现在社会，需要学习的境界和思维方式。</span></p><p><span>别人可以不为善，但是我定要为善，因为你是你，我是我；别人可以利欲熏心，但是我不可以，我可以出污泥而不染，因为你是你，我是我；别人可以来欺骗我，可以来伤害我，但我决不做欺骗和伤害他人的事情，因为你是你，我是我，我怎么会被你所污染呢？</span></p><p><span>所以，这种出污泥而不染的精神，和这种思维方式，我们可以把它用在生活当中，以保持自己的纯净和不被杂染。</span></p></div>"
},{
    "title": "《孟子》公孙丑上 ⑨-3 持守中道",
    "date": "2022-10-31",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上 ⑨-3 持守中道</span></strong></p><p><strong><span>虽袒裼裸裎于我侧，尔焉能浼我哉！故由由然与之偕而不自失焉。援而止之而止。援而止之而止者，是亦不屑去已。孟子曰：伯夷隘，柳下惠不恭。隘与不恭，君子不由也。</span></strong></p><p><strong><span>虽袒裼裸裎于我侧，尔焉能浼我哉！</span></strong><span>我们看袒裼裸裎，裼和裎，指的是贴身的单衣，袒裼裸裎，指的是赤身裸体了。虽赤身裸体于我身侧，就是在我身旁，又怎么能污染到，怎么能玷污到我呢？</span></p><p><span>我们看这句话和伯夷正好相反，伯夷认为脏的东西不看、不听，甚至乡人的帽子戴得不端正，我都要望望然而去的，因为那会弄脏我的，会污染到我的。但是柳下惠是另外一个极致，你是你，我是我，别说你的帽子戴得不端正，即使你赤身裸体在我身旁，又能如何呢？你也没有办法玷污到我，所以这是两个极致。</span></p><p><span>这个时候我们再来看，因为柳下惠的这种思维方式和他讲过的这句话，你是你，我是我。无论你怎样，即使是赤身裸体在我身旁，也没有办法污染到我，所以才有了坐怀不乱的故事。</span></p><p><span>历史上众说纷纭，有说真，有说假，各种说法也不一样。但是我们这里不需要去执着，我们只需要通过这个故事，去了解柳下惠的这句话就好了。你是你，我是我。</span></p><p><span>传说在一个寒冷的雨夜，柳下惠自己裹着被子依然很冷，这个时候他就在思考，他说现在战乱连年，我在自己的屋子里面，并且还有被子，我也很冷，其他还有多少流离失所的人呢？是不是他们会更冷啊？这个时候，有一位女子敲门，进来以后，因为穿得很少，并且遇到了雨夜，衣服已经被淋湿了，所以就来求助柳下惠，说听说您是一位君子，我是不可以生病的，因为我还有母亲，我现在很寒冷，我可不可以坐在你的怀里？柳下惠的风格，我们已经知道了，你是你，我是我。即使你赤身裸体又怎么会污染到我呢？所以柳下惠就同意了，可以让这个女子坐在她的怀里一夜而不乱。</span></p><p><span>所以我们就可以看到，这是柳下惠的思维和他的性格，我的门是大敞四开的，什么人都可以进来，什么样的事情我都可以接纳，我穷困潦倒，我不觉得有问题，我也不会忧愁，即使我数次被贬，我也可以坦然面对。</span></p><p><span>无论我的朋友是什么样子的，是贤德之人也好，是鸡鸣狗盗之徒也好，对于我来讲都不重要，你是你，我是我，又怎么会污染到我呢？</span></p><p><strong><span>故由由然与之偕而不自失焉。</span></strong><span>由由然：是很坦然，有点高兴的样子。所以和伯夷又正好相反，伯夷是望望然去之，而柳下惠是由由然与之。比如说，伯夷看到认为不好的事情，比如说帽子不端正，他会望望然去之，不要污染到我。而柳下惠无论遇到什么事情，我都可以坦然，甚至有一点高兴地去面对它。</span></p><p><span>我们再来看这句话，由由然与之偕而不自失焉，我可以坦然地高兴地与他人相处，并且不会失去自我，不会被别人所污染。</span></p><p><strong><span>援而止之而止。</span></strong><span>这个援：指的是拉扯、扯住的意思，我们来看这句话是什么意思呢？不会被拉扯，或者被什么事情阻挡住。我们来体会这个援字，它是一种什么感受。</span></p><p><span>比如说，我在鲁国，即使做一个很小的官，即使经常被罢免，我也不会因为别人的劝说而离开故土；比如说，在那个雨夜，有一位女子来到这里，她想请求坐在我的怀里，我也不会因为我惧怕或者在乎名声，我就离开这里。无论什么事情的拉扯或者阻挡，都不影响我去做我自己，保持我自己的风格。</span></p><p><span>我们这个时候，再来看伯夷和柳下惠这两种极致的人，伯夷是主观意识比较强，是我自己的判断能力。举个例子，说我自己的判断，主观认为武王伐了纣王，这是以臣弑君，以下犯上，所以我不会去与他做事情，甚至不想与他言语。再比如说，乡人的帽子不够端正，我望望然去之。</span></p><p><span>我们注意，伯夷更多的是自己的主观意识，主观思维，主观评定。</span></p><p><span>我们再看柳下惠恰恰相反，他是以对方为主导的，自己没有任何的想法。比如说，你想坐在怀里，那你就坐；你想让我在这里为官，我就为官；你想要罢免我，你就罢免我。我的生活过得富足，我就坦然处之；我的生活穷困潦倒，我也可以不忧愁，且坦然处之。</span></p><p><span>所以一个是主动的，一个是被动的；一个是原则性更强，一个是更加随顺。无论生活给了我什么，你要求做什么，那你就去做，不会被这些东西拉扯而止住，这就是援字。</span></p><p><strong><span>援而止之而止者，是亦不屑去已。</span></strong><span>为什么会援而止而止之呢？不屑于去，我们看伯夷是不屑于就，不屑于去就职，因为我有自己的原则。而柳下惠是不屑于离开，因为我可以随顺一切事情。</span></p><p><span>我们要来思考了，这两种极致的人，对于我们绝大多数人来讲，这个境界都是难以企及的。</span></p><p><span>想一想，我们多少人可以做到像伯夷那个样子，把忠孝，把仁义，把道德，把交友的标准，把自己的原则，可以发挥到那么极致，甚至为了自己的原则，我可以不要自己的生命，我可以不吃饭，我可以饿死在首阳山上，所以伯夷也被称之为古之圣贤，也是后世无数人以他的精神和原则去学习的，所以这种极致的人，我们绝大多数人是很难以达到的。</span></p><p><span>比如说，我们去交友，我们可以做到，这个朋友但凡有一点不好的地方，我们就不与他交往吗？比如说，我们看到我们的乡党，他但凡有不合乎礼数的事情，我们都会离开吗？比如说，我们的工作，但凡这个企业或者领导有一点不合适的事情，我们就决不为他工作吗？好像这个很难达到，难以企及。</span></p><p><span>我们再来去看柳下惠是不是一样，柳下惠可以做到随顺，可以做到随遇而安，你想要用我，你就用我，即使我的官职很小，我也决不隐藏自己的才能，我依然努力而为；你想罢免我，那你就罢免我，我决不会有怨言，决不会有忧愁。我过上富足的生活，我就坦然的面对；即使我穷困潦倒，我也不会忧愁。</span></p><p><span>交朋友，你是什么样的人，就是什么样的人，与我无关，即使有人赤身裸体的在我身旁，我也不会做出任何的举动，因为我不屑于离开。你是你，我是我，无论你如何都不会影响到我，所以这是另外一种极致，我们大多数人也是很难以企及。</span></p><p><span>所以我们看孟子最后一句的总结，<strong>孟子曰：伯夷隘，柳下惠不恭。</strong>隘：是狭隘，也就是小。柳下惠不恭，这个不恭：指的是不严肃、不认真、不重视。</span></p><p><span>我们可以看柳下惠，他的这些行为，是很容易遭到风言风语的，所以围绕着柳下惠这种人的是非，就会变得很多。我们去试想一下，如果在生活当中，我们可以你是你，我是我，即使有人赤身裸体在身边，你也可以不屑于离去，这个时候，风言风语一定会变得更多。</span></p><p><span>我们再反过来说，伯夷隘，伯夷比较狭隘，用孟子的话讲，气量太小了，太狭隘了，为什么呢？难道不能做到以百姓为重吗？以天下为己任吗？非要坚守自己的原则？所以你看，伯夷把原则发挥到了极致，而柳下惠把随性发挥到了极致。</span></p><p><strong><span>隘与不恭，君子不由也。</span></strong><span>这种狭隘和不严肃、不认真，君子不由也。我们要注意由字了，千万不要把它理解成狭隘和不严肃，君子是不这么做的，如果是那样的，就叫君子不为也了。绝对不是说伯夷和柳下惠的这种隘和不恭，君子不这么去做，这是不对的。</span></p><p><span>我们再看这个由是什么意思呢？由：是遵循的意思。所以，君子是不会遵循这种隘和不恭去做事情的，为什么呢？</span></p><p><span>我们讲伯夷和柳下惠都是古之圣贤，但是他们所能达到的极致，大多数人并不适合，也没有办法做到，所以说，不要遵循着他们的准则去做事情。</span></p><p><span>那么君子是要持中的，我们要持守中道，比如说我们刚才举的例子，伯夷是把门关得很紧，只留了一个小小的缝隙，只有贤德之人才可以进来，而柳下惠是把门全部打开，所有的人都可以进来。</span></p><p><span>君子持中是什么意思呢？我把这个门开到一半的样子，我要有所甄别的，什么样的人我可以与之交友，什么样的事情我可以去做；什么样的人不要与之交友，什么样的事情我不要去做，这个就是执中。</span></p><p><span>我们要执中道去做事情，比如说，我可以注重养生，注重保护自己的身体，但是不能过于极端，所有伤害身体的事情都不要去做，请问我们要怎样去生活呢？如果说我们完全不在意自己的身体，是不是又走到另外一个极端？也不行。所以，我们要去执中，该在意的还是要在意，但是不需要过度地去在意自己的身体。</span></p><p><span>再比如说，我们交朋友也是一样的，不是什么样的朋友我都能交往的，我要有所甄别，但也绝不是他身上只要有缺点，只要有不好的地方，我就不与他交往。</span></p><p><span>所以我们学习了儒家的文化，我们了解了孔孟之道，我们看孔子和孟子的思想是一致的，告诉我们君子不由也，不要去遵循着这两种极致去做事情。我们赞叹伯夷和柳下惠的境界和为人，但是我们不要去遵循，我们要持守中道去做事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ①-1 天时地利人和",
    "date": "2022-11-01",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ①-1 天时地利人和</span></strong></p><p><strong><span>孟子曰：天时不如地利，地利不如人和。</span></strong></p><p><span>这节课程开始之前，我们先讲三个我们比较熟悉的词语：第一个叫作天时，第二个叫作地利，第三个叫作人和。</span></p><p><span>什么叫作天时呢？天时本来的意思，指的是天气，比如说阴晴，比如说黑白，比如说是否下雨，自然的这种天气的变化，我们称之为天时。</span></p><p><span>我们再延伸一下，还有什么叫作天时呢？比如说一个大的行业发展趋势，这个也叫作天时，就是没有办法逆转的，按照某种规律和方向在发展的事物，这是我们没有办法掌控的，称之为天时。</span></p><p><span>再比如说，什么叫作地利？地利本意指的是土地，比如说土地是否肥沃，这个地方的阳光是否充足。</span></p><p><span>我们再延伸一点，什么叫作地利呢？比如说一个人具备了什么样的先天条件，说我有什么样的父母，我出生在一个什么样的家庭，说我这个人先天比较聪慧，或者有的人先天的嗓音条件比较好，现在已经积累的东西，我们称之为地利。</span></p><p><span>还有什么叫作人和呢？有多少人愿意来帮助我们，有多少人愿意和我们在一起，这个称之为人和。</span></p><p><span>我们再来延伸一点，何为人和呢？一个人是否积极向上，是否努力，称之为人和。我们再扩展一点，一个人是否懂得明德和亲民，这个就是人和。当你懂得明德，不断地去提升你自己，就会有更多人愿意来帮助你；当你懂得去亲民，不停地去帮助别人，别人自然愿意跟你在一起，你就可以和更多的人。</span></p><p><span>我们再来看天时地利人和，天时这是不可掌控的东西，比如说什么时候刮风，什么时候下雨，这个不是我们人所能左右的；说一个行业发展的趋势，它不是一个人可以左右的；说现在到了什么样的时代，该发展什么样的事物，这个不是人可以左右的。</span></p><p><span>天时虽然不可左右，但是有智慧的人可以探寻它的规律。我们来举个例子，说即使没有天气预报的情况下，但是有智慧的人可以通过经验和自然规律，知道接下来要刮什么方向的风，接下来是否要下雨，什么时候雨水会比较多，这个都是经验和智慧的总结。</span></p><p><span>所以说，一个智者要学会去窥视天机，也就是可以探寻事物的发展规律，我们探寻了事物的发展规律，并不是要去掌控它，而是懂得迎合天机，配合天机去做事情。</span></p><p><span>举个例子，我们看到的三国演义当中的诸葛亮和周瑜借东风，这个就是天机。东风不是你能掌控的，但是你却有迹可循，你可以懂得去探寻事物的规律，看好什么时候会刮东风，这个就是智慧了。</span></p><p><span>还有地利，说我们现在先天有什么样的条件，有什么样的天赋，我积累了多少财富，比如说我想要投资做一个生意，我这个人天生有生意头脑，这就是地利，或者我现在有一部分的资金储备，我可以用来做生意，这个就叫作地利。</span></p><p><span>再比如说现在流行互联网，而我恰巧懂得互联网的思维，我恰巧有这方面的技能，这个也称之为地利。这个地利是从什么地方来的呢？是我们先天所带来的一部分，还有一部分，是我们通过后天的努力学习而得来的。</span></p><p><span>我们再来看古人，会有人感叹说生不逢时，为什么会感叹生不逢时呢？这个时候说明缺少了天时，但是占了地利，比如说，我这个人很有才华，但是我生在这个时代不合适，故而我的才华没有办法展现，这个就叫作生不逢时。</span></p><p><span>我们来举个例子，比如说，现在有的人喜欢自由职业，说我不喜欢出去工作，我可以靠着我的嗓音，或者靠着我某方面的天赋，或者靠着我的口才，或者靠着我的艺术创作，就可以在家里很好地去生活，这个说明我们是占了地利和天时的。</span></p><p><span>但是假设我们出生在三十年前呢？那个时候，我们就不占天时，虽然我们有自己的想法，我想做自由职业，并且我有某方面的天赋，但是那个时机不合适，那个时机大家都要去努力地工作，都要去工厂或者去种地，大家更喜欢努力的、积极的、踏实的、勤奋的人。所以到了我们这个时代就不一样了。</span></p><p><span>我们再举个例子，说一个人天生有生意头脑，会经商，但是如果你出生的时代，恰巧是不允许经商的，这方面的事情是禁止的，这个时候就是不占天时，生不逢时。再比如说，说一块土地很肥沃，但是今年这一年就是不下雨，或者是总是阴天不出太阳，你看这个地利有了，就是土地本身是肥沃的，土壤是好的，适合庄稼或者其他的农作物，但是今年不下雨，即使土地肥沃，也没有办法长出好的植物，这个就叫作有地利，但是不占天时。</span></p><p><span>我们说一个人想要有更好的发展，天时、地利、人和都占全是最好的。说赶上了一个适合我的特点，或者某种天赋发挥的天时，同时我又有一些先天条件，或者是通过我后天的努力，我有了一些积累或者积蓄，另外我又占了人和，就是有更多的人愿意来帮助我，有更多人愿意和我一起去做事情，这个就是天时地利人和，如果这三者可以都占，那么一个人是一定会有一些成就的。</span></p><p><span>天时虽然没有办法掌握，如果我们有智慧，是可以寻找一些机会和规律的。比如说接下来什么样的行业会兴起，这个时候，我是可以探寻到规律的，这个时候，我又有了一些先天的条件去和它相应和，我又可以通过努力积累一些东西，都是地利。我又懂得明德和亲民，提升自己的德行，同时我去帮助更多的人，有更多的人愿意跟我在一起，所以，我们要懂得占着天时、地利、人和，去成就一件事情。</span></p><p><span>但是天时是否可以来到，这个是福分所致。如果没有那个福德呢？可以用智慧去寻找一些规律和痕迹。</span></p><p><span>我们讲完天时、地利、人和的概念，我们接下来进入孟子的课程，从今天开始的课程，到了公孙丑章句下。</span></p><p><span>公孙丑章句下主要来探讨一个人的思维方式，一个人要有什么样的观念，要有什么样的思想，一个人要以什么样的行为去做事情，我们要想做好一件事情，到底该配合一些什么东西。比如说开篇就讲到了天时、地利、人和，我们看孟子如何讲。</span></p><p><strong><span>孟子曰：天时不如地利，地利不如人和。</span></strong><span>我们说最好的是天时、地利、人和都占。那么天时既然是没有办法掌控的东西，也就不是所有人都可以占着天时，既然不能占着天时，我们退而求其次，讲天时不如地利。</span></p><p><span>比如说，即使我们赶不上一些大的、好的行业趋势，但是我们有一些先天的条件，或者说我们有一些积累和积蓄，这个时候我们有一些地利，也可以让我们很好地去做一些事情。</span></p><p><span>如果用古时候的国家来举例子，那什么叫作天时呢？就是看我的国运如何，我是否是领受着天命的，是否可以统一华夏。还有什么叫作地利呢？比如说，我的这些城池是否有山川之险，如果我的城池占着山川之险，易守难攻，这个时候我是容易守住这个地方的，虽然天时可能不在我这里，但是我有着地利，有着山川之险，我也可以维持上很长一段时间。</span></p><p><span>再比如说，我们做生意也是一样的，即使我们没有占着天时，但是我有一些天赋在其中，比如说，我有好的经商头脑；再比如说，我做这个行业相对还是比较稳定的；再比如说，我过去积累了一些客户资源，虽然我不占天时，但是我也可以维系相当长的一段时间，这就叫天时不如地利。</span></p><p><span>地利不如人和。我们说什么叫人和？我们自己努力的程度，我们是否积极向上，我们是否懂得明德和亲民，即使我没有山川之险，即使我没有过去生意上积累的一些客户资源，但是我这个人愿意去帮助别人，称之为亲民。我懂得不停地提升自己，称之为明德。即使我什么都没有，我一无所有，我通过明德和亲民，也可以让我的生意维系下去，也可以保有一个国家。这个时候，人和也就是懂得实行仁政，去让更多的人愿意围绕在我们身边。</span></p><p><span>所以，天时、地利、人和，若要分开来讲，孟子认为人和才是最重要的。因为天时我们无法掌握，那么地利带有一些先天条件，也带有一些后期的积累，但是人和，却是完全可以由我们主动掌握的事情。</span></p><p><span>我可以没有好的家庭条件，我可以不占大行业的趋势，我也可以原本并没有什么样的积蓄，但是我从现在开始，如果懂得明德亲民，不停地去提升自己，我占了人和，同样也可以让我的生意变得更好，同样也可以让我的感情变得更和谐，同样也可以让我们的工作变得更顺利。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ①-2 得道者多助",
    "date": "2022-11-03",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ①-2 得道者多助</span></strong></p><p><strong><span>“三里之城，七里之郭，环而攻之而不胜。夫环而攻之，必有得天时者矣；然而不胜者，是天时不如地利也。城非不高也，池非不深也，兵革非不坚利也。米粟非不多也，委而去之，是地利不如人和也。”故曰：“域民不以封疆之界，固国不以山谿之险，威天下不以兵革之利。得道者多助，失道者寡助。寡助之至，亲戚畔之；多助之至，天下顺之。以天下之所顺，攻亲戚之所畔；故君子有不战，战必胜矣。”</span></strong></p><p><span>接下来，孟子举例子具体来讲，为何说天时不如地利，地利不如人和，如果用一个国家来理解，何为天时地利人和？</span></p><p><strong><span>三里之城，七里之郭。</span></strong><span>城：指的是内城；郭：指的是郭城，也就是外城。我们来看孟子描述的这样一个城池很小，内城只有三里，外城也只有七里。</span></p><p><strong><span>环而攻之而不胜。</span></strong><span>环：指的是包围，围绕起来，包围起来攻击这样一座小城，且不能胜利。</span></p><p><strong><span>夫环而攻之，必有得天时者矣。</span></strong><span>我们去看为什么可以环而攻之呢？这是天时所致，什么意思呢？说有这样一个小的国家，小的城池，内城三里，外城七里，这个是天时，也就是我的国家或者这个城池本来就这么小，这个不是我能决定的，所以这个是我没有办法改变的客观存在。</span></p><p><span>还有什么叫作天时呢？说有一个大的国家，或者大的军队，可以包围这样一座小城池，那是他的天时，他可能本来国家就比我更大一点，他军队的数量本来比我就多一点，所以这些都称之为天时，也就是不可改变的原有的一些因素。</span></p><p><strong><span>然而不胜者，是天时不如地利也。</span></strong><span>包围起来这样一个小城，但是却不能胜利，为什么呢？这个就叫天时不如地利也。比如说，虽然天时是我们有这么多的军队，包围这样一个小城，但是这个小城可能是城墙比较坚固，可能是兵器比较锋利，所以即使包围起来也没有办法战胜，因为它占着城池坚固，所以天时是不如地利的。</span></p><p><strong><span>城非不高也，池非不深也。</span></strong><span>说城墙不可为不高，池:指的是护城河，护城河不可为不深。</span></p><p><strong><span>兵革非不坚利也。</span></strong><span>兵:指的是兵器;革:指的是铠甲。说兵器和铠甲不可为不坚利，都是很坚利的。</span></p><p><strong><span>米粟非不多也。</span></strong><span>米粟：指的是粮食，说粮食是很多的，因为没有粮食军民的心是没有办法稳定的。</span></p><p><strong><span>委而去之，是地利不如人和也。</span></strong><span>委而去之：指的是弃城而走。我们看这句话是什么意思？城墙高大坚固，城池很深，兵器锋利，铠甲坚固，粮食也足够多，这个时候还有弃城而走的人，说明地利不如人和也。</span></p><p><span>我们去看历史，有很多这样的典故，明明城池很高大坚固，粮食也足够多，但是还有的守将弃城而走，为什么会这样呢？这个就是地利不如人和也，人心不和。我们举个例子，比如说对方如果是仁德之师呢？我们就想弃城而走，想要投降对方，因为跟他可能会比现在的现状变得更好。再比如说，守城方的君主，他是昏庸无道的，即使有坚固的城墙，有足够多的粮食，也想弃城而走，因为人心不和。</span></p><p><span>我们再来看孟子所讲的这段话，说天时不如地利，地利不如人和。占着天时固然是好，可是天时还不如地利，地利又不如人和，也就是人和是最重要的事情。</span></p><p><span>我们来举例子，比如说一个人做生意，即使是家族传承下来的企业，你看这个时候是占着天时的，虽然有一个很大的企业，如果你不能不停地去积累，不停地去加固，不停地去服务和帮助更多的人，你没有带一些先天条件，某种天赋，也是没有办法守住这份基业的。接下来即使你守住了这份基业，你要知道它的核心是人和，如果不能去明德亲民，不能让更多人跟我在一起，不能是让大家的心团结一致的，终究这个企业是做不下去的。</span></p><p><span>其实我们做生意也是如此，无论我们占了什么样的先天优势，比如说我赶到了一个互联网行业的势头上，我在这个势头上，我崛起了，但是最后我们可能败于人和，如果我们的人心是不和的，即使我们占了一时的天时，也没有办法可以让它更长久。</span></p><p><span>一段感情也是一样的，即使我在合适的时机下，遇到了一个什么样的人，我觉得我们在一起很好，我也很喜欢对方，但是如果长时间下来离德离心呢？人心不和，这段感情我们终究是守不住的。</span></p><p><span>所以用孟子的例子来讲，真正可以守住一座城池，守住一个国家的是人和，绝不是天时和地利，即使有坚固的城墙，有锋利的兵器也是没有用的，人心失和终究是守不住的。</span></p><p><strong><span>故曰：域民不以封疆之界。</span></strong><span>这个域指的是限定、限制。域民：指的是限定百姓，不以封疆之界。</span></p><p><span>我们看这句话是什么意思，一个国家我们要以什么去限定百姓呢？通常我们觉得以规定，以规矩，说什么样的事情你不能做，哪里的边界你不能触犯，包括我们经营一个企业是不是如此？我们想通过一些规则，通过一些规章制度，去限定我们这些员工可以做什么，不可以做什么；但我们看孟子这句话，说域民不以封疆之界，我们想要去限定或者说管理他人，不是以这些边界，不是以规则，不是以规章制度。</span></p><p><span>学习《论语》讲过一句话叫近者悦，远者来。不以规章制度去限定，不以边界去限定，要以什么来限定呢？以仁政，以仁爱之心，以这种人和。如果让生活在这里的百姓都是安居乐业的，他们的生活是安定而美满的，近者悦，远者来，其他地方的人，自然想要慕名而来。</span></p><p><span>我们去做生意也是一样的，如果来到我们这里的顾客，来到这里都是喜悦的，是得到帮助的，享受到了良好地服务的，近者悦，远者自然来。</span></p><p><span>我们去做一家企业也是一样的，如果在这里工作的员工，他可以赚到工资，他可以在这里实现自我价值，他可以在这里去提升，近者悦，远者来，别人自然是愿意来到这个地方的，所以不需要以那么多的规定和限定去管理。</span></p><p><strong><span>固国不以山谿之险。</span></strong><span>所以说要想稳固一个国家，不以山川之险。</span></p><p><strong><span>威天下不以兵革之利。</span></strong><span>要想威行天下，不以兵器和铠甲的锋利。</span></p><p><strong><span>得道者多助，失道者寡助。</span></strong><span>告诉我们答案，得道者多助，失道者自然就是寡助的。所以不要以这些山川之险，不要以兵器的锋利，也不要用限定百姓的方式去管理民众，我们用道去管理百姓，用道去稳固国家，用道去威行天下。</span></p><p><span>作为一个国家来讲，道，就是君主是否推行仁政，是否与民众以百姓为核心。如果以百姓为核心推行仁政，想着让百姓生活的更好，这个时候不需要以山川之险，百姓自然会捍卫自己的国家，因为那是在捍卫自己的幸福生活；百姓自然愿意去拥护这个国家，因为那是在拥护他自己的幸福生活，所以这就是得道者多助，失道者寡助。</span></p><p><span>我们去做一个生意也同样如此，如果我们对这些员工是好的，对于我们的这些客户是好的，是有帮助的，这些客户和员工是不希望这家企业倒下的，是希望这家公司变得越来越好，因为这是所有人幸福的源泉，是所有人的利益共同体，这个就是得道者多助。</span></p><p><span>所以我们要懂得去合于道去行事，去推行仁政，用仁德之心去做事情，这个也就是本篇所讲的人和。</span></p><p><strong><span>寡助之至，亲戚畔之。</span></strong><span>亲戚：指的是我们身边最核心的，最亲近的人，也就是亲人。如果我们总是失道的，失到了一定的程度，我们身边的亲人都会背叛。</span></p><p><strong><span>多助之至，天下顺之。</span></strong><span>得道者就会多助，当我们不停地实行仁政，合于道地去做事情，到了一定的程度，天下人都是愿意顺从和帮助我们的。</span></p><p><strong><span>以天下之所顺，攻亲戚之所畔。</span></strong><span>这件事情就变得简单了，带着天下人的认同，天下人的跟随，天下人的顺从，去攻打那些亲人都背叛的人，是何其容易的事情。</span></p><p><strong><span>故君子有不战，战必胜矣。</span></strong><span>所以说君子不会主动地去发动战争，但是战必胜矣。只要发动战争，是一定会胜利的。</span></p><p><span>我们学习《论语》，学习《孟子》，讲过商汤，讲过文王，讲过武王伐纣，这些都是挟天下之顺，而攻亲戚之畔，所以那个结果自然就会呈现出来。</span></p><p><span>比如说，商汤攻打到哪个国家，哪个国家的百姓是愿意跟随的，所以即使有坚固的城池，锋利的兵器，也不会去抵抗，而直接会变得顺从，甚至商汤去攻打其他的诸侯国，没有被攻打到的国家的百姓是不开心的，为什么不先攻打我这里呢？这就可以看到，这就是人和，是人心所向。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ①-3 心怀感恩之心",
    "date": "2022-11-09",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ①-3 心怀感恩之心</span></strong></p><p><span>我们再来回顾这段话，天时不如地利，地利不如人和，最后落点是在讲人和。也就是只要是人和，即使我们不占天时，不占地利，说商汤从方圆七十里的国家开始，他在不停地去推行仁政，不停地去为百姓着想，这个就是人和。当这个人和不断地扩大，到达了一定的程度，不停地去积累，我们也就有了地利，有了地利我们等待天时即可。</span></p><p><span>同时这里还有一个重点，叫作得道者多助，失道者寡助。</span></p><p><span>我们来重点延伸其中的一个字，这个字叫作助，帮助的助，我们去想，无论我们做任何一件事情，都没有办法离开他人的帮助。</span></p><p><span>何为天时呢？天时就是天来帮助；何为地利呢？地利就是地来帮助；何为人和呢？人和就是人来帮助。所以一个人你要懂得去找天来帮助，那你就合于道，你懂得去寻找道的规律，事物发展的规律，天自然来助之。</span></p><p><span>你如何想让地来帮助呢？你就去寻找地利，去让自己有一些积累，有一些积蓄，这个时候地就会来帮助，同时我们更要懂得去寻找更多的人来帮助，如何让更多的人来帮助？</span></p><p><span>得道者多助，失道者寡助。我们去按道去行事，我们去推行仁政，我们用仁爱之心去帮助更多的人，自然得道者多助。</span></p><p><span>我们来举一些例子，生活当中无论你想做任何事情，都离不开他人的帮助。比如说，有的人说我想体验一下做母亲的感受，当你想要做一回母亲的时候，是否需要孩子来帮助呢？因为有孩子愿意来到你的身边，他愿意成为你的孩子，所以才可以做母亲。</span></p><p><span>再比如说，有的人说我想要做生意，你想让生意做好，你就需要有员工的帮助，需要有更多的人愿意和你一起去工作，还需要有顾客，有顾客愿意购买你的产品，愿意与你合作，所以你才可以做生意，这个时候我们就需要员工和顾客的帮助。</span></p><p><span>再比如说，我想要组成一个家庭，我需要一个爱人，这个时候，你就需要另外一方来给你帮助，他愿意和你生活在一起，愿意和你共同面对未来人生的风风雨雨，酸甜苦辣。所以需要他的帮助，我们才能组成一个家庭。</span></p><p><span>再比如说，想做一名老师，我想要教知识和学问给他人，是不是需要更多学生的帮助，因为有了学生的帮助，因为有听众，所以才能做成这个老师。</span></p><p><span>这样的例子比比皆是，因而我们就明白一个道理，一个人无论想要做成任何一件事情，都离不开他人的帮助。</span></p><p><span>再比如说，我想要买一个房子，把我的家安在这里，你想买一个房子也需要很多人的帮助。比如说没有人来建这样一个房子，你可以买得到吗？所以我们想要住的房子，是需要盖房子的人来给我们帮助，而盖这座房子，其中是包含了很多人的心血和设计在其中的。</span></p><p><span>再比如说我开的车子，我想要买一辆车子是需要很多人的帮助，才可以让我开到这个车子，流水线上有那么多的工人，还有设计师，还有发动机，那么还需要有加油站的人来提供帮助。</span></p><p><span>因而我们在这个基础之上，我们就要再提升一个境界了，所有人的出现都是来帮助和成就我们的，没有例外。</span></p><p><span>看看我们刚才所举的例子，我们想做一个母亲，需要一个孩子来帮助我，来成就我；我想组成一个家庭，需要一个爱人来帮助我，来成就我；我想买到一个房子，需要有那么多的人来帮助我，来成就我；我想要做一个生意，需要那么多的员工，还需要顾客，另外还需要产品或者我想要做的某个艺术品，这些都是来帮助和成就我们的。</span></p><p><span>所以我们要懂得去感恩万事万物，我们做成一个老师，是因为有学生在成就我们；我们做成了母亲，是因为有孩子在成就我们；我们有了婚姻，是因为有爱人在成就我们；我们有了生意是因为顾客、员工，还有产品在成就我们。</span></p><p><span>所以人是要心怀感恩之心的，我们感谢天，感谢地，我们感谢阳光，我们感恩雨露，我们感恩生活当中出现的每一个人，我们感恩生活当中遇到的每一件事情，遇到的每一次挫折和危机。所以这个思维是非常重要的，没有一个人，一件事情不是来帮助我们的。</span></p><p><span>我们举个例子，说有一个人骂了我们一句，或者有的人对我们产生了误解，注意！这个时候他的出现，是来帮助我们的。他来帮助我们可以去面对更多的困境，可以面对更多的不如意，</span></p><p><span>可以面对更多的耻辱，如果没有这样的人和这样的事情发生，我们没有办法让自己的内心变得强大。</span></p><p><span>比如说，我的人生当中出现了一个人，他来伤害了我，其实他并不是来伤害我的，他同样是来成就和帮助我的，因为他的伤害我让自己变得更强大，因为他的伤害，我知道了我自己的德行哪里是有亏欠的，我知道我的智慧哪里是有不足的，我不懂得去甄别，所以才出现了这样一个人。</span></p><p><span>所以这个思维方式很重要，如果我们还认为有人在伤害我们，我们还认为我们发生的事情是不如意的，我们还认为当下的人和事，他们有多么不好，说明我们的德行和修为是不足的，</span><span>我们的德行和修为不足以让我们有这个智慧，认清楚当下事情的真相。</span></p><p><span>所以，所有人的出现都是来帮助和成就我们的。</span></p><p><span>比如说，我的孩子不听话，你要知道孩子的不听话是来帮助和成就我们的，说明我们自己做父亲或者做母亲，没有足够的德行和智慧教育好这个孩子，所以他的出现，告诉我们要去提升我们自己，要去明德和亲民。</span></p><p><span>如果我们生活当中，出现了骗我们钱财的人，我们要感谢他，我们要知道他的出现，并不是为了欺骗我，他的出现是来帮助和成就我的。他告诉了我们，说明我们的德行是有漏的地方，说明我们自己还有那么多的贪欲，说明我们的智慧还那么的不足，所以才有他的出现欺骗了我，这是来告诉我们明德和亲民的。</span></p><p><span>生活当中无论出现了任何一件事情，我们都要懂得是为了帮助和成就我们而来，绝不是为了伤害我们而来。听到这里，可能还有人会感叹，为什么没有人愿意主动来帮助我呢？</span></p><p><span>我们要去思考这个问题了，为什么没有人愿意来助我呢？是不是说明得道者多助？我们不得道，我们没有懂得明德和亲民的道理，我们没有愿意主动地去帮助他人。如果我们愿意主动地去帮助他人，就可以有人和，就可以得道者多助，就会有更多人愿意来帮助我们。</span></p><p><span>这个时候有的人又说了，说我也帮助了别人，可是也没有人愿意帮助我。举个例子，说我也给同事倒了水，我也帮助同事去完成工作，可是还是没有人愿意去帮助我，说明我们自己的能力有限，就是我们能帮助别人所做的事情有限。当我们的能力不够的时候，我们就要懂得去明德了，懂得去不断地去提升自己，当你不断地去提升自己，你有更大的能力去帮助更多的人，自然你可以得到更多的道，也就是有更多人愿意来帮助你。</span></p><p><span>所以，我们感叹没有人帮助我们的时候，我们首先要想着去帮助别人，我们帮助别人还是没有人帮助我们，我们要懂得不断地提升自己，让自己的能力变得更好，变得更强，我们因而可以帮助更多人，去做更多的事情，最后自然就是得道者多助，失道者寡助。</span></p><p><span>所以总结下来，最重要的一个字就是助。我们在这个世界上，无论想做任何一件事情，都离不开他人的帮助，所以我们要懂得这个道理，就要合道去做事情。</span></p><p><span>同时，我们的思维和境界要上升一个层级，我们要知道所有的人事物的出现，都是来帮助和成就我们的，因此我们的内心充满着仁爱，我们的内心充满着美好和感恩。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ②-1 听话听音",
    "date": "2022-11-08",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ②-1 听话听音</span></strong></p><p><strong><span>孟子将朝王。王使人来曰：“寡人如就见者也，有寒疾，不可以风。朝将视朝，不识可使寡人得见乎？”对曰：“不幸而有疾，不能造朝。”明日，出弔于东郭氏。公孙丑曰：“昔者辞以病，今日弔，或者不可乎？”曰：“昔者疾，今日愈，如之何不弔？”</span></strong></p><p><strong><span>孟子将朝王。</span></strong><span>将：准备、将要。孟子准备去朝见齐王，这里有人说是齐宣王，还有的人说不是，这句话的重点也不在于，他到底去见齐国的哪位君王，所以这个问题我们也并不深究。</span></p><p><span>我们看看孟子在去朝见齐王的过程当中，发生了一些什么事情，而这段事情又想要告诉我们一个什么道理呢？</span></p><p><span>孟子准备去朝见齐王，这个时候，<strong>王使人来曰：寡人如就见者也，有寒疾，不可以风。</strong>如，就是应当我去见你的意思，齐王派人对孟子讲了一番话，说寡人应当去拜访您才对，但是我有寒疾，是不能见风的。</span></p><p><span>我们把这句话带到我们现在生活当中的场景，我们来体会这句话是什么意思。比如说我们去某一个城市，想见我们的朋友，或者是想拜访一位领导，这个时候，对方派了一个其他人过来，对我们讲了一句话，说我本应该去见你的，但是我有寒疾，不可以见风，我们听听是什么感受？是不是会有一些不太开心，对方说他有寒疾，他不能见风，其实他是不想见我们。</span></p><p><span>这里面还有一种思维方式，我们要去看一个人背后讲话，他到底在讲什么，他的思维是以我为中心的，还是以他人为中心的。</span></p><p><span>比如说，齐王讲有寒疾不可以见风，是不是都是在为自己着想啊？如果我们大老远去一个城市见一个朋友，对方对我们讲，说我其实应该去见你的，但是我有寒疾，我不可以受风，我们听上去会不会有一些失落感，因为对方根本就不重视这件事情。</span></p><p><span>还有另外一种思维方式，如果齐王派人对孟子讲，说我应当去见您的，但是我有寒疾，我怕我的状态不好，没有办法听到您的教诲，没有办法去跟您更好地交流。</span><span>你看这番话的意境，是不是马上就变了。如果齐王派人来讲，说我有寒疾，怕传染到给您，这就不好了，你看是不是整个想法的不同，你就可以看到这个人心中到底在想什么。</span></p><p><span>还是刚才那个例子，如果我们在一个城市，想要见一位朋友，这位朋友讲其实我应该去见你的，但是因为这两天的身体不舒服，我怕我的状态不好影响到你，你看这个时候，我们看到的是他在为别人着想，也就是心里的重视程度不一样。</span></p><p><span>所以我们经常讲，听话听音，不要去听声，不要听他说了什么，你要去听他背后这句话想要表达什么。</span></p><p><span>什么叫声音呢？举个例子，说我们拿一个东西，敲一个物品，比如说敲鼓，比如说敲钟，我们敲，铛，响了一下，叫做声；响过之后，那个声音还会再环绕一下，还会再流传一下，那个东西叫音。也就是我们真正要听的，是敲完之后的声音是否悦耳，我们说话也是一样的，我们听一个人不要听他说了什么，而是看他背后想要表达的是什么。</span></p><p><span>我们讲完这些，再回头来看这句话，就变得很简单了。孟子本来准备是要朝见齐王的，这个时候齐王派一个使者过来，对孟子讲，我应当去见您，但是我有寒疾不可以见风，我们知道了，齐王是不太想见孟子的，如果他想见孟子，就会讲说，我受了寒风，怕影响我与您的交谈，所以我可不可以改天再来约见您，再来拜访您？那显然他是不想见的。</span></p><p><span>我们看接下来使者又说了另外一句话，<strong>朝将视朝，不识可使寡人得见乎？</strong>朝，指的是明天早晨，明天早晨是要上朝的，不知道可否在朝堂上见到您呢？我们再来看这句话，今天我有风寒，不可以见风，明天就可以去上早朝，并且想让孟子来朝堂之上见齐王。</span></p><p><span>我们从这里就要延伸三点，我们来思考。第一点，我们说齐王并不想见孟子；第二点，他并没有重视孟子，也并没有去礼待他；第三点，他并不想和孟子深谈。</span></p><p><span>我们去想，在朝堂之上是有很多其他的大夫和朝臣在的，在这种情况下，孟子可以讲他的言论和思想吗？他可以去告诉齐王如何去行仁政吗？如何去治国吗？显然是不可以的。</span></p><p><span>我们再把它带到生活的场景当中来，这句话就很容易理解了。比如说，有一个人想要来家里来拜访我们，我们说，今天我有风寒，这样好不好，明天早晨八点我要去上班，有什么事情去我公司聊好不好，你看是不是整个性质就变了。</span></p><p><span>第一，我们不想见这个人；第二，我们从心里并不重视他；第三，叫你去公司，是不想和你太深入的聊，只是在人很多的情况下，我们适当的聊上几句就可以了。</span></p><p><span>我们这里进而再去思考，齐王为什么不想见孟子呢？难道不知道孟子讲的是仁政吗？讲的是王道吗？讲的是德行吗？当我们明知道对方主张的是什么，明知道对方会说什么，但是我又不想这样去做，所以我们就不想去见对方，但是不得不见，我们就找一个人多的场合见一下就好了。</span></p><p><span>你看生活当中我们的心里是不是如此，比如说有一个朋友找我们，我们明知道他要说什么，但是不见好像从面子上又过不去，故而就会选择改天一个有众多人在场的场景，这样这个事情就可以化解了。</span></p><p><span>所以，当我们把里面的心理活动，把它分析出来，我们就知道了齐王并不想见孟子，他也不重视他，也不想跟他深谈，并且清晰的知道孟子的主张，故而不愿意去面对这件事情，我们从中就要学到这种心理变化和思维方式了。</span></p><p><span>你看，我们在生活当中遇到了类似的事情，我们就知道了对方的心理，他是否想见我们，是否愿意跟我们交谈下去，是否明知道我们要说什么，而对方只是在推脱，当我们明白这个道理，我们才能知道如何去应对。</span></p><p><span>我们看孟子是如何应对的。<strong>对曰：不幸而有疾，不能造朝。</strong>孟子讲，非常的不幸运，我也有了疾病，所以，明天早晨我是没有办法去朝堂上见齐王的，明知道对方不想见，不愿意去深谈，那何必自讨没趣呢？</span></p><p><strong><span>明日，出弔于东郭氏。</span></strong><span>东郭氏：齐国的大夫。到了第二天，孟子去东郭氏去慰问，吊丧。</span></p><p><strong><span>公孙丑曰：昔者辞以病，今日弔，或者不可乎？</span></strong><span>这个时候公孙丑很担心，因为他是孟子的学生，所以自然是担心自己的老师的，说昨天您说有疾，今天却来东郭氏参加慰问吊丧，是否这样做不合适呢？</span></p><p><strong><span>曰：昔者疾，今日愈，如之何不弔。</span></strong><span>孟子说，昨天我有疾病，但是今天我已经好了，参加慰问和吊丧，有什么不合适的呢？我们再来看孟子这番话，完全对应了齐王的话，齐王讲说有风寒，不可以见风，但是明天朝堂之上，不知道是否可以见到您？</span></p><p><span>所以孟子对应说，实在不幸，我也有疾，所以没有办法明天去朝堂，但是我第二天却可以去东郭氏去吊丧，为什么呢？我也是昔者有疾病，今天我痊愈了，故而我可以去。</span></p><p><span>所以孟子整个表达的心理活动和思想，完全是对应了齐王，你是怎么对待我的，我就是怎么对待你的；你是如何来看待这件事情，我就是如何来看待这件事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ②-2 重视与走形式",
    "date": "2022-11-08",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ②-2 重视与走形式</span></strong></p><p><strong><span>王使人问疾，医来。孟仲子对曰：“昔者有王命，有采薪之忧，不能造朝。今病小愈，趋造于朝，我不识能至否乎？”使数人要于路，曰：“请必无归，而造于朝。”不得已而之景丑氏宿焉。景子曰：“内则父子，外则君臣，人之大伦也。父子主恩，君臣主敬，丑见王之敬子也，未见所以敬王也。”</span></strong></p><p><strong><span>王使人问疾，医来。</span></strong><span>齐王知道了这件事情，所以使人来问疾，问孟子的健康状况，问他的疾病是否痊愈，并且还有医者到来。我们看简单的这几个字，我们可以从中看到人生百态，</span></p><p><span>我们来思考一个问题，我们说一个人是否重视你，到底应该看什么？我们看他付出了什么，</span><span>但是付出什么却要因人而异。</span></p><p><span>我们举个例子，我们说齐王他有重视孟子吗？我们看到他付出什么，就知道他是否重视了。比如说对于齐王来讲，如果他真的重视孟子，真的尊重有德行的人，听到孟子有疾，那么最重视他的行为，莫过于亲自来探望和慰问，这是最大的重视。但是齐王最不缺的是什么？不缺人，不缺医，只派人，只派医者去慰问，这是一件非常简单的事情。所以虽然有一些重视，但不多，只是做给他人看的而已。</span></p><p><span>我们来举一个生活当中的例子，比如说，一个人他自己很有钱，然后他可以给另外一个人钱，</span><span>告诉对方说，我很重视你，这个是不对的。因为他有钱，钱对他来讲并不重要，但是一个很有钱的人，他的时间很宝贵，他愿意花时间去陪伴另外一个人，说明心里是重视对方的。</span></p><p><span>再比如说，今天中午这个朋友要请我吃饭，这个时候我们要去观察，什么叫重视呢？说这个朋友的家庭条件很一般，但是，他愿意拿出来对他来讲很重要的钱，请我们在外面吃饭，说明对方对我们是很重视的。但是如果我们这个朋友，他是不在乎钱的，很富裕，他在外面请我们吃饭，显然是没有那么重视；如果他很有钱，但是他又愿意麻烦自己，在他家里为我们准备吃的，说明对方是对我们很重视的。</span></p><p><span>所以我们去观察何为重视，去看对方付出了什么。付出什么，又因人而异，我们看对方最重要的，最在乎的是什么，如果他愿意拿最重要的，最在乎的事情，对另外一个人付出，说明他是很重视的。</span></p><p><span>由此我们就可以看到这几个字，就可以表明齐王并没有重视孟子，只是做给别人看的而已，因为孟子是有德行在外的，大家都知道孟子，所以都很尊敬他，如果不派人去探望，去慰问，</span><span>这个时候别人会有议论的。就像我们家里来个朋友，如果我们不去请他吃顿饭，好像面子上说不过去。</span></p><p><span>我们接下来再看孟仲子说的话，孟仲子是孟子的兄弟，这个时候和孟子住在一起，所以王使人来探望，这个时候孟仲子在家，所以就去对答了接下来的这番话。</span></p><p><strong><span>孟仲子对曰：昔者有王命，有采薪之忧，不能造朝。</span></strong><span>说之前齐王有王命，但是有采薪之忧。采薪，指的是砍柴，采薪之忧，指的是生病了，没有办法砍柴。就好比说我们现在来形容自己不舒服，别人说你怎么了，我连喝水都很费力，就说明我们现在身体有疾，说我走路有些无力，都是形容我有疾病在身。所以这里的采薪之忧，也是在告诉来者，说齐王有命的时候，因为他有疾，所以不能去造朝。</span></p><p><strong><span>今病小愈，趋造于朝。</span></strong><span>说今天他的疾病有些好转了，趋: 急忙快速的，他急忙就去造朝了。</span></p><p><strong><span>我不识能至否乎？</span></strong><span>我不知道他这时有没有到达朝堂。</span></p><p><strong><span>使数人要于路。</span></strong><span>要:拦截，接下来就派了很多人，到路上去拦截孟子。</span></p><p><strong><span>曰：请必无归，而造于朝。</span></strong><span>一定不要回家，抓紧时间去朝堂之上。</span></p><p><span>我们再看整个对话的过程，齐王派使者来慰问，这个时候孟仲子认为齐王是很重视孟子的，所以说一定要派人去拦截，让他不要回家，快快地去朝堂之上见齐王。所以，我们看孟仲子他代表的是普通人的想法，普通人在遇到一件事情的时候，就会看到那个表象，通过表象来判断，说齐王是很重视孟子的，那么你要快快地去见齐王。但是孟子是很清楚的，齐王并没有重视他，也不想与他深谈，派人来探望也只不过是走个形式，所以孟子自然不会去朝堂之上。</span></p><p><strong><span>不得已而之景丑氏宿焉。</span></strong><span>去朝堂之上，孟子不会去的，但是这个时候回家也并不合适，所以在这种不得已的情况下，去了景丑氏家里过夜。</span></p><p><strong><span>景子曰：内则父子，外则君臣，人之大伦也。</span></strong><span>景子说了一段话，因为孟子在景子家留宿，所以自然也就会说起这件事情，景子讲了一段话，内则父子，在家里是父子的关系；外则君臣，在外是和君臣之间的关系，人之大伦也，这是人与人非常重要的关系。</span></p><p><strong><span>父子主恩，君臣主敬。</span></strong><span>父子之间要以恩为主，而君和臣之间要以敬为主。</span></p><p><span>我们来看这八个字，父子主恩，父亲和儿子之间最重要的纽带，相处的方式以及准则，就是以恩情为主。我们说父亲对我们有养育之恩，并且对我们还有教导之责，所以古人都讲：子不教父之过。所以，父亲不光是要生育儿子，并且还要去给他教育，给他指导人生的方向，且还要子承父业，所以父和子之间是有恩情在的。</span></p><p><span>这就给我们父子之间提出了一个标准，我们如何和自己的父亲相处？我们要去回报他的恩情，</span><span>我们要抱着感恩之心，我们如何和自己的儿女相处呢？我们要给他更多的恩情，给他更多的养育之恩。所以无论是子对父，还是父对子，都是一个主恩的心理和一个主恩的行为。</span></p><p><span>君臣主敬，君和臣的关系是要敬重的。比如说，臣对君，你要去敬畏他，你要去尊重他，无论他是什么样的想法，无论他是什么样的心理，君召见，臣必到的，所以言下之意，孟子并没有去见齐王，也就是他并不敬重齐王。</span></p><p><strong><span>丑见王之敬子也，未见所以敬王也。</span></strong><span>丑：是他的自称，说我看见齐王是敬重您的，但是我没有看到您在敬重齐王。听说孟子你有疾，齐王派人来慰问，并且带来了医者，他是如此的敬重您孟子，但是我看到您却没有敬重齐王，这是不该这样去做的，这不是为臣之道。</span></p><p><span>以上所讲的这一段是阐述了这样一件事情：从孟子准备去见齐王，但是齐王说自己有疾，不可以见风，想在明天早晨的朝堂之上见到孟子。所以孟子也说，我自己得了疾病，没有办法明天去早朝，第二日，他却去东郭氏，参加了吊丧，这个时候公孙丑又开始问了，说昨日有疾，今日来吊丧，是否不太合适呢？孟子讲，有何不妥？昨日我有疾，今天我已经好了，怎么就不能来参加吊丧呢？以此来回应齐王的态度。</span></p><p><span>接下来齐王知道了这件事情，又派使者来孟子所居住的地方，并且带来了医者，想要看孟子到底有何疾，是否已经有好转。孟仲子就对答了这番话，接下来又派人在路上去拦截孟子，</span><span>让他快快地去朝堂之上见齐王，孟子在无奈之下来到了景丑氏的家里过夜。景丑氏显然对这件事情也是不理解的，父子是主恩的，君臣是主敬的，我看到齐王对您孟子是尊敬的，孟子为何您不去尊敬齐王呢？</span></p><p><span>以此我们可以看到，从到公孙丑到孟仲子，再到景子。他们显然都不大认同孟子的做法，也会认为孟子这样做是否有不妥。之前的部分，只是描述了这样一个事件 ，接下来孟子会表达他的观点。为何他没有去见齐王。孟子到底想要去表达一个什么样的观念，他想要教会我们什么样的道理呢？</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ②-3 内外相调和扎根",
    "date": "2022-11-10",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ②-3 内外相调和扎根</span></strong></p><p><strong><span>曰：恶！是何言也！齐人无以仁义与王言者，岂以仁义为不美也？</span></strong></p><p><span>我们再来延伸一个观点：内则父子，外则君臣。这里讲了内，讲了外。内指的是在家，在家我们儿子要听从父亲的，而在外臣要听君的话。</span></p><p><span>这里我们来延伸超过知识范畴的内容，这个知识点是我们需要去学习的，但是它与本文的关联并不大，这里讲的内外，是内有父子，外有君臣；但同时内外也是两种状态，我们在任何一件事情当中，都离不开内和外这两种状态。</span></p><p><span>我们来举个例子，比如说工作是外，回家里的生活是内，这两点都不可缺少。比如说，一个人如果一直工作，一直处在外，这个时候就会劳累，当你劳累到一定的程度，你就会去对抗工作，找不到生命的意义和价值，不知道活着到底为了什么，这个时候就需要生活的部分去调剂。可是一个人如果没有工作呢？只是在家庭生活当中，时间久了，同样会觉得没有意义，觉得无聊。</span></p><p><span>所以内和外是相结合的。还有一个词叫劳逸结合，劳是外，逸是内。所以我们做一件事情，要有辛劳的时候，有努力的时候，这个是价值和意义，同时我们要注意休息，注意调节。</span></p><p><span>再比如说，万物分阴阳，一内一外，有阴就要有阳。再比如说，天气有阴有晴，一内一外，如果总是晴天，这是不可以的，万物是没有办法生长的，并且空气它会干燥，所以就有了阴天，有了雨天；但是如果一直下雨，一直阴天，没有晴朗的天气，同样不可以，这个时候万物是没有生机的，人们是见不到阳光的。所以要有黑有白，有阴有晴，这是内外相结合。</span></p><p><span>所以我们就懂得任何一件事情，都是有内和外这两种状态，而我们要学会中庸之道，我们从中间去找一个平衡点。</span></p><p><span>比如说当我过度劳累的时候，我要注意休息，可是我一直休息，整个人又会变得倦怠，没有斗志，这个时候，我就要注意积极努力地去奋斗。</span></p><p><span>比如说有了黑天，我们可以休养生息，所以才有白天的精力旺盛；通过白天的工作，我们消耗了一定的精力，所以有了夜晚，我们可以休养生息。</span></p><p><span>包括一个人的状态也是如此，当我们做一件事情，总是积极向上的时候，你会遇到一些挫折，遇到一些困境，这个时候就要懂得放松弛，懂得不要去那么要强；</span></p><p><span>可是当我们松弛下来一段时间，我们又会变得没有斗志，这个时候我们去调整自己，又要让自己变得积极向上。</span></p><p><span>所以，从内有父子，外有君臣，我们延伸到人都有两种状态，做任何事情都需要这两种状态：一内一外，一阴一阳，而我们需要调节的是从中找到一个平衡点，当我们过于阳，我们就要调到阴；当我们过于阴，我们就要调到阳。</span></p><p><span>再比如说，我们对待孩子的态度也分阴阳，分内外。比如说我们对他过于严厉，过于苛责，我们过于强势，这是偏向于阳的，如果偏向于阳，孩子就会变得很阴柔，比如说他会变得没有主见，比如说他会在这种长期的压力下，最后他的性格会有某些方面的缺失。当我们发现自己过于阳刚之时，我们就要去调整，我们可能要给他更多的关心，给他更多的关爱，给他更多的支持和鼓励，让他变得更阳刚，而我们变得更柔软。</span></p><p><span>可是有的父母恰恰相反，又开始变得过于阴，也就是什么事情我都不去管，任凭他自己做主，这个时候，他就会容易犯很多的错误。</span></p><p><span>所以，我们教育孩子同样也是阴阳相调和，看看我们自己处在一个什么样的状态。</span></p><p><span>这是延伸的第一点事情，都有内外，都分阴阳。我们再来延伸第二点：任何事情都要有根。比如说内有父子，外有君臣，这是根，在家里我们听从父亲的话，这样一个人是有根的；在外一个臣子听君主的话，我们延伸出来，也就是在工作的时候，你要去听领导的话，这是有根的。</span></p><p><span>我们来举例子，比如说我们在工作当中，有事情你可以问领导，公司的发展方向，如何去生存，有领导去承担这些事情，你看，这个时候作为员工，我们就是有根的。</span></p><p><span>什么叫根呢？我们说树它是有根的，那个根是不停地向上输送营养的。你看我们作为员工，公司这个平台是根，公司的老板，公司的领导他是根，有了这个根，我们是被护佑的，我们是可以被输送营养和价值的。可是这个时候，我们作为员工，作为臣，是要主敬的。我们要去尊敬领导，尊敬老板，因为他在给我们输送着营养，他是那个根。</span></p><p><span>内有父子也是一样的，说我们在家里，要尊敬我们的父母，因为父母是根。这个根不取决于说我们的父母有没有能力，有的人可能会说，说我的父母并没有能力，也没有多大的智慧，它和能力和智慧无关，只要有父母在，一个人就是有根的，这个如果有经历的人，会有感受。</span></p><p><span>比如说父母或许没有什么样的能力，或许没能给我更好的条件，当有一天你发现如果父母不在的时候，他离开了人世间，这个时候你的心里会有失落感，你会去感叹，我从此以后没有家了，这就是没有了那个根。</span></p><p><span>没有根就像浮萍一样，就像那个草，它没有了那个根，它没有办法变得生机勃勃，没有办法变得更旺盛。</span></p><p><span>所以一个人要懂得去寻找自己的根源，而这里告诉我们内有父子，外有君臣，这个就是那个根。说我们在家里有父母在，我们这个家是有根的，可是随着我们自己逐渐的强大，我们逐渐地成长，我们就变成了那个根。在工作当中我们要懂得去尊敬领导，领导和公司这个平台就是那个根，他在不停地给我们输送着营养。</span></p><p><span>可是如果我们不懂得去尊敬领导，不懂得去尊敬父母，一个人就是没有根的，没有根，这个时候你是没有准则的，你做事情是无所依托的，没有依托的地去做事情，是没有力量的。</span></p><p><span>我们可以不妨试想一下，说有的人在工作当中，不尊敬领导，他总是特立独行，按照自己的想法去做事情，你发现这个企业当中，并没有人去喜欢他，你看他像不像浮萍一样，他总是在飘着，他是没有遵循着某种原则和规律在做事情的，所以这个人就是无根的。</span></p><p><span>再比如说，有的人不尊敬父母，不重视父母，你会发现这个人就像浮萍一样，他是飘着的，那个家并不是他的根，他的内心是没有依托的，所以这个时候，就会变得没有力量。</span></p><p><span>我们学习了今天的内容，一定要注意这个问题，我们要懂得在家里尊敬父母，那是我们的根；我们在工作的时候，我们要尊敬我们的领导，那是我们的根；要尊重我们这个公司，那是我们的根。</span></p><p><span>再延伸开，当我们跟朋友相处的时候，或者我们在一个小家庭当中，跟我们的爱人相处的时候，你的爱人就是你的根。如果你不去尊重他，你跟他不是互敬互爱的，你就不愿意回到这个家，这个家就没法给你提供足够的营养。</span></p><p><span>比如说我们在一个企业当中工作，也是一样的，如果我们不爱这家企业，如果我们不尊敬这家企业的领导，一个人就是没有根的。我虽然在这个公司工作，可是我没有安全感，可是我不觉得被重视，这就是没有根。</span></p><p><span>所以，当我们去尊敬领导，尊敬父母和爱人，互敬互爱，是因为要给自己有所依，你的内心是有所依托的，你是有根的，所以这个时候你才能变得有营养，你才能变得有生机，不停地向上去生长。</span></p><p><span>讲完了题外话，我们再回到原文。我们看景丑氏景子所说的话，他讲了这样一个道理，说内有父子，外有君臣。父子主恩，君臣主敬。言下之意是觉得孟子不敬君主，为什么呢？</span></p><p><span>君主召见孟子去朝堂之上，而孟子却找一个理由推脱，说我病了去不了，所以他认为孟子并不尊敬、不敬重齐王，而齐王却尊重了孟子，因为听说孟子有疾，使人来问，并且医者也跟着到来，可是孟子依然没有去见齐王，这不是对齐王的不尊敬吗？</span></p><p><span>我们看孟子是如何讲？<strong>曰：恶！是何言也！</strong>恶：感叹词，你这叫什么话呢？言下之意是说，景子你讲的不对，难道齐王召见我，我没有去，就是不敬重齐王了吗？显然孟子和景子这两个人对于敬的理解，是不一样的。</span></p><p><span>接下来孟子就讲到了，究竟什么叫做敬呢？<strong>齐人无以仁义与王言者。</strong>说齐国人没有一个人和齐王去谈仁义的，<strong>岂以仁义为不美也？</strong>难道是仁义不美，难道是仁义不好吗？</span></p><p><span>你看这里我们就要思考了，齐国这么大的国家，却没有一个人和齐王去谈仁义，难道是这些人认为仁义不好吗？显然不是的，因为景子还在告诉孟子，内有父子，外有君臣；父子主恩，君臣主敬。显然景子也是赞同敬是好的，恩是好的，自然仁义也是好的。可是有人觉得仁义好，却没有人和齐王去谈仁义，这是为什么呢？</span></p><p><span>我们这里要去思考，为什么齐国人没有和齐王谈仁义的呢？如果齐王是求仁义的，他追求的是仁义，是道德，那就会有很多人投其所好，去跟他讲仁义，去跟他讲道德，去跟他讲王道，去讲施仁政，为何没有人去讲呢？显然是齐王并不求仁义，我们要知道臣是随君所好的，会投其所好，君主求仁义，臣自然就讲仁义；如果君主好美色，那么臣下自然会在全国选一些美人，送给君王；如果君王有什么样的嗜好，那么臣下自然想尽一切办法去满足。</span></p><p><span>我们在生活当中也是一样的，尤其是做领导的人，处上位的人，一定要明白这个道理。比如说，一个做领导的人，你要是喜欢听一些小道消息，你发现你的员工，你的下属，就会找到很多的小道消息去不停地传播，告诉给你，如果你表现出来了兴致，那么更多人会来讲一些小道消息，难道要用这些小道消息去治理团队吗？去经营你的企业吗？</span></p><p><span>所以处上位的人，你好什么东西很重要，比如说如果你要是好书法，好写字，那么别人所送的东西，就会围绕着书法和写字这件事情展开；如果一个领导好仁义，那么你的员工和下属自然就是好仁义的；如果一个处上位的人，是有利他精神的，那么你团队的其他人自然会变得有利他精神，因为他们会随其所好，你好仁义，他们如果不好仁义，那么这个公司就没有办法容得下他们。</span></p><p><span>所以处上位的人要洁身自好，看看你自己喜欢什么，你在追求什么，你团队就会形成什么样的风气。</span></p><p><span>我们说到这里显然得到了答案，齐人为什么没有和齐王讲仁义道德呢？是因为齐王不好，是因为他的追求并不在此。</span></p></div>"
},{
    "title": "《孟子》公孙丑下 ②-4 角度不同 选择不同",
    "date": "2022-11-10",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑下 ②-4 角度不同 选择不同</span></strong></p><p><strong><span>其心曰‘是何足与言仁义也’云尔，则不敬莫大乎是。我非尧舜之道，不敢以陈于王前，故齐人莫如我敬王也。景子曰：“否，非此之谓也。《礼》曰：‘父召，无诺；君命召，不俟驾。’固将朝也，闻王命而遂不果，宜与夫《礼》若不相似然。”</span></strong></p><p><strong><span>其心曰：‘是何足与言仁义也’云尔。</span></strong><span>我们看这句话，孟子说：“齐国为什么没有人和齐王去谈仁义呢？其心曰，说这些人心里想的是，他怎么值得我去与他谈仁义呢？为何不讲？因为这些人心里是清楚的，齐王是不值得与他谈仁义的，因为他不求仁义。”</span></p><p><strong><span>则不敬莫大乎是。</span></strong><span>孟子说：“我认为的不敬莫过于此了。”我们看孟子讲何为敬？明知道仁义是好的东西，却因为君主不追求，不喜好，而不与他讲；心里还在想，齐王这样的人，不值得与他谈仁义，这个才是最大的不敬。</span></p><p><span>而我孟子是敬齐王的，我要告诉给他仁义的道理，我要坚持自己的主张，为什么呢？我敬重一个人，我希望他变得更好，而不是投其所好。且他的爱好对国家，对百姓，是没有益处的，</span><span>不是说我听他的话就是敬畏了，难道他做的事情不正确，我还要听他的话，这个才叫敬畏吗？</span><span>而孟子认为不是。</span></p><p><strong><span>我非尧舜之道，不敢以陈于王前。</span></strong><span>说如果我讲的不是尧舜之道，我是不敢在齐王面前去讲的。也就是孟子说我要讲的东西都是尧舜之道，尧舜是如何施仁政，治理天下的，我要把这些仁政，要把仁义讲给齐王。</span></p><p><strong><span>故齐人莫如我敬王也。</span></strong><span>所以说齐国人并没有我敬重齐王。</span></p><p><strong><span>景子曰：否，非此之谓也。</span></strong><strong><span>《礼》曰：‘父召，无诺；君命召，不俟驾。’</span></strong><span>景子说：“不是，不是。不是这个道理，我说的不是这件事情，我说的是礼。”这里的礼指的是《礼经》，因为礼经现在已经失传了。我们看《礼经》接下来所讲的这段话，讲得太好了。</span></p><p><span>父召无诺，当父亲在叫我们的时候，没有来得及答应，可是我们的身体已经产生了行为，我们已经走过去了。比如说父亲叫我们的名字，我们一边答应着，甚至还没来得及答应，但是已经迈开脚步，走到父亲的身边了。</span></p><p><span>君命召，不俟驾。不俟驾，是指马车还没有准备好，就已经开始出发了，这形容的是一种态度。我们去想象一下这样一个场景，当君命来召，这个时候古人是要乘坐马车的，下人正在准备着马车，这个时候我们已经开始出发，然后马车追上来，我们再坐马车开始过去，形容的是一种态度，是快速地反应的态度，如果一个人懂得这样去做事情，无论走到哪里都会讨人喜欢。</span></p><p><span>我们去想，在一个工作场景是不是这样的，当领导叫一位员工说，小张你过来一下，他说唉，马上已经过来了，甚至说一边走一边答应，说唉，马上到，你看这样的人会不会讨</span><span>领导的喜欢？</span></p><p><span>再比如说我们生活当中交的朋友，当你跟朋友交流一件事情，或者你和他打招呼的时候，他的行为已经产生了，并且才开始答应。</span></p><p><span>可是想想我们很多时候，好像不是这个样子的，比如说，当父母叫到我们的时候，有的人是答应了，嗯，可是答应了之后呢？迟迟没有动身，还在做着你手里的事情，即使我们正在吃饭，说父母有事情叫我们，这个时候你是立马产生行动，把手里的饭放下，并且一边答应着</span></p><p><span>去到父母的面前。</span></p><p><span>你看在企业当中也是如此，无论你手里在做着什么事情，当领导在叫我们的时候，我们是第一时间放下所有的事情，来到领导的面前。</span></p><p><span>可是如果反之，父母在叫我们的时候，我们说心里还在想，等我吃完这口饭，等我忙完手里的事情；当领导在叫我们的时候，我们唉，答应着可是还在想，我手里还有着急的事情，我需要先处理完，等我处理完了，我一会儿就去。你看这个时候我们的行为，就会变得很拖沓，</span></p><p><span>没有快速地反应和回馈，所以这个时候，即使我们的工作做的再好，领导也不会喜欢我们。因为我们并不懂得尊敬他人，我没有尊敬父母，我们也没有尊敬领导，所以做什么工作就会不讨喜。</span></p><p><span>我们懂得这个道理，从小就要教给我们的孩子做一个这样的人，可是反观我们现在很多孩子，</span></p><p><span>我们叫他根本不理你，即使理你也是拖拖拉拉的，即使答应着，还在问你什么事情。</span></p><p><span>比如说，你叫孩子，你说你过来一下，他会问你干什么，有什么事情，我正在玩呢！你看他还要问什么原因，就是我们从小就没有教给孩子要懂得敬重他人，那将来这样的孩子走上社会，参加工作，我们请问什么样的人会喜欢这样的孩子？连快速的反应能力，和尊重他人的习惯都没有养成。</span></p><p><span>所以我们从小就要有这种意识，去教育我们的孩子，让他从开始就懂得尊重他人，懂得快速地给他人反应和回馈，将来走到社会上，他才会讨人喜欢，成为一个有用的人。</span></p><p><span>包括我们自身也是一样的，看看我们自己是不是像《礼经》所说的这个样子，当处上位的人，</span></p><p><span>我们的父母，我们的领导在叫我们的时候，我们是否可以无诺，是否可以不俟驾，它形容的是一种态度，和我们的思维方式，还有我们的行为习惯。而且这个背后，如果我们养成了这种行为和思维的习惯，我们就会变得很敏锐，在我们以后做事情的过程当中，我们可以快速地反应，可以快速地回馈一件事情。</span></p><p><strong><span>固将朝也，闻王命而遂不果。</span></strong><span>固，是本来的意思。说本来您是要准备去见齐王的，但是闻了王命以后，反而没有去，这是什么道理？</span></p><p><strong><span>宜与夫《礼》若不相似然。</span></strong><span>这好像和《礼经》所讲的不太相合吧？这里也是依然在讲孟子</span><span>不懂得去敬重君主，您本来就准备是要见齐王的，可是听到了齐王的王命，反而不去了，好像和《礼经》所讲的不太相合，这依然是景子的观点。</span></p><p><span>我们可以看到孟子和景子的观点是不同的。我们以此要延伸非常重要的一种思维方式，我们说在一件事情当中，到底什么样的角度才是正确的呢？</span></p><p><span>我们现在来回顾孟子与景子之间的对话，我们去看到底谁讲的才是正确的呢？孟子认为我比齐国人都敬重齐王，因为我知道仁义好，我知道尧舜之道好，所以我要讲给齐王听，而齐国人认为我们要投其所好，因为齐王不求仁义，所以我们就不讲仁义。</span></p><p><span>然后景子认为，我们要听齐王的话，君命召，不俟驾。君召见我们，我们要马上立刻去到朝堂之上。</span></p><p><span>然后我们再看这里有大多数人的观点，比如说从公孙丑也在说孟子，说老师，您这样做不太合适吧？您能参加丧礼却不去见齐王，孟仲子同样觉得孟子这样做不合适，所以派人在路上拦截孟子，叫他赶紧上朝，可是孟子并没有去，在不得已之下，来到了景丑氏的家里过夜。同样景子也认为，孟子不太合适，说您这样的行为与《礼经》好像不太相合。</span></p><p><span>由此我们可以知道，在一件事情发生的时候，会有很多个角度去看待这件事情，而每个人的角度各不相同，这里面其实并没有什么对或者错，只是每个人看问题的角度不同而已。比如说景子说的很有道理，认为内有父子，外有君臣，并且引用《礼经》当中的话，父召，无诺。君命召，不俟驾，显然这个角度也是正确的。</span></p><p><span>可是孟子的角度却不在这个地方，这里的问题就出现了，当我们面对一件事情，我们到底该怎样取舍呢？我们到底要依着什么去做选择，这个很重要。</span></p><p><span>所以这里我们来延伸两点：第一点，我们要依着大多数人普遍认为正确的观点和概念，比如说在面对齐王这件事情，大多数人普遍的观点是认为要马上去见齐王；那么还有第二种人就是孟子。</span></p><p><span>如果一个人你有独到的见解，有自己更高明的智慧，看到了这个问题更深层次的角度。你就可以按照自己的见解去行事，但是这里面有一个问题，就是你要做好一切产生不好结果的心理准备。</span></p><p><span>比如说孟子没有去见齐王，那有可能产生的结果，齐王从此以后不会重视你说的话，甚至还有可能治罪于孟子。如果心里是可以承受这个结果的，你就依靠着自己独到的见解就可以了。</span></p><p><span>我们来举一个生活当中的例子，比如说，普遍的大多数人都在追求利益，都在追求想要获得更多。有的人说我有自己独到的东西，我不注重利益，我只在乎仁义，我只在乎道德，我追求的是忠信。可以，但是这个时候就要做好心理准备，我们可能不被他人理解，我们可能不被他人认同，甚至他人会去诋毁，甚至是不相信。</span></p><p><span>如果我们做好了这些心理准备，就可以按照自己的风格，自己的想法去做事情。我们可以看古人有很多这样去做事情的，比如我们说孔子，别人都认为他不应该去做这些事情，但是孔子明知不可为而为之；比如说颜回，大家认为颜回有学识，认为颜回有智慧，他应该去为政，</span></p><p><span>他应该去做更多的事情，可是颜回并不喜欢。我喜欢安贫乐道的生活，一箪食，一瓢饮，居陋巷，人不堪其忧，回不改其乐，贤哉回也，他在保持自己的风格。</span></p><p><span>再比如说，我们之前学习到的伯夷，学习到的柳下惠，伯夷可以坚守自己的原则，绝不食周粟，采薇而食，最后饿死在首阳山，求仁而得仁。还有我们学习的柳下惠，尔为尔，我为我。我保持我自己的风格，出淤泥而不染，即使他人对我产生非议，我也绝无动于衷，我不会被这些非议和外在的环境所影响。</span></p><p><span>所以我们看到这些人，他是超脱的人。再比如说孟子，我不会按照你们大多数人认为正确的观点去做事情，所以我们可以看到公孙丑，孟仲子，景子都认为孟子这样做是不合适的，但是孟子保持着自己的观点，不为这些人和这些事情所动。</span></p><p><span>所以从第一点上来讲，大多数人认为正确的，不容易犯错误。从第二点来讲，你保持自己独到的见解和风格，容易产生两种截然不同的结果。一种结果是好，一种结果是不好。并且是非常得不好，这里我们就要去思考，导致好和不好最重要和核心的因素是什么呢？</span></p><p><span>我们可以看到生活当中，有很多人他保持自己的见解，最后结果很好，大家很尊重他。比如说孔子和孟子；比如说伯夷和柳下惠；比如说颜回。那生活当中还有一部分人，保持自己独到的见解，特立独行，但是结果却非常不好，甚至让人唾弃。</span></p><p><span>为什么会这个样子？核心的观点就在于你是否是利他的，是否对他人是有益的。比如说孟子，他坚持自己的观点和风格，因为他讲的东西是对别人有益的，所以可以赢得别人的尊重。我们在生活当中也是一样的，我们可以有自己独到的见解和风格，但是如果你是帮助他人的，是对他人有益的，终有一天可以赢得他人的尊重和认同。</span></p><p><span>可是反之，有的人也有自己独到的见解，但是特立独行只让自己开心，自己高兴就可以了，从来没有想着去帮助他人，去利益到他人。所以那个结果就会变得不好，甚至人人讨厌。</span></p><p><span>我们再来总结这个观点，当我们面对一件事情，它有很多的角度，那我们到底该如何选择其一呢，我们可以按照大多数人，普遍认为正确的观点，这个时候不容易出差错。</span></p><p><span>还有第二个角度就是我们有自己独到的见解，我们有超脱的智慧，我们有自己的志向，我们就随自己的内心而为，我们可以承受一切的后果。这个时候自然会产生两种结果，一种结果是好，一种结果是不好。而产生好与不好的核心在于我们是否是利他的，如果是利他的，终究会产生好的结果。如果不是利他的特立独行，最后的结果就是不好的，让别人去讨厌，被人去唾弃。</span></p><p><span>孟子的角度自然是利他的，是帮助更多人，所以他有他独到的见解和观点，我们接下来就来看孟子他的观点是什么？</span></p></div>"
}]