[{
    "title": "《孟子》公孙丑上①-1 眼界与格局",
    "date": "2022-08-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-1眼界与格局</strong></span></p><p><span/></p><p><strong><span>公孙丑问曰：“夫子当路于齐，管仲、晏子之功，可复许乎？”</span></strong></p><p><strong><span>孟子曰：“子诚齐人也，知管仲、晏子而已矣！”</span></strong></p><p><span>第一章讲的是如何为政，都是各个国家的君主君王问孟子，该如何去治理天下、治理国家，所以孟子讲仁政。通过很多细节，通过每件发生的事情，去讲仁政，所以更多的是宏观的，是大的，并没有让我们真正地去了解孟子。</span></p><p><span>而公孙丑章句则不同，公孙丑是孟子的得意门生，孟子是比较喜欢公孙丑的。我们去想为何会喜欢公孙丑这个人呢？我们去学习《论语》的过程当中，也会发现，孔夫子也有很多喜欢的学生，比如说颜回，比如说子贡，比如说子路，为什么会喜欢这些学生？</span></p><p><span>首先这些学生是积极努力向上的；其二，他们的德行品德都很好；其三，他们的思想是有一定的深度的，跟老师之间是有一定的契合度的，所以才会让老师去喜欢这些学生们。当两个有深度的、有契合度的人在一起交流，他所问出来的问题，是更深刻的。</span></p><p><span>接下来，我们要讲到公孙丑问孟子，然后孟子给回答。我们通过公孙丑问孟子的问题，我们可以看到孟子的回答，是更深刻的，他有助于我们去了解孟子的思想、孟子的精神以及孟子的行为。他和君王问话不一样，君王问的更多的是，如何治理国家。</span></p><p><span>而孟子表达的是，自己大的宏观上的想法，该如何去实行仁政？该如何去保民？如何去治理天下？但是孟子回答学生之间，却有自己的喜好，说我喜欢做什么事情，我的价值观是什么样子的，我对于一件事情具体是怎么看待的，我平时的行为是怎么样的。</span></p><p><span>所以我们通过接下来的学习，让我们更加了解一个有血有肉的孟子，我们说去了解一个人，一定要了解他的思想，他的精神以及他平时的行为，这是血和肉。而我们去了解一个人的简介，他的生平，那个只是概括，不足以了解一个人。</span></p><p><span>比如说，我们讲到孟子周游列国二十载，邹国人，有很多弟子，被称为圣人，活到了八十四岁，这都是简介。这些是没有血没有肉的，没有内涵。我们接下来，去看看孟子他平时的思维和他的行为，到底是什么样子的？我们看看他心中的理想是什么样子的？</span></p><p><strong><span>公孙丑问曰：夫子当路于齐。</span></strong><span>得意门生问孟子一个问题，当路指的是当政，并且是掌握政权。公孙丑是齐国人，我们看公孙丑的问题，说：当路于齐，如果老师您来执掌齐国的政权，我们说孟子在齐国是做稷下大夫的，有官职，但是不主政。</span></p><p><span>也就是享受了大夫的俸禄待遇，但是并不具体的参与齐国的政事，也就是没有政权的，并不能实际的为齐国做什么事情，只能是给齐宣王一些建议，一些学识上的交流。所以公孙丑就会有一些好奇，说如果老师您来掌管齐国的朝政，那齐国会变成什么样子呢？</span></p><p><span>这个可能不光是公孙丑的疑问，我们心中可能也会有疑问，因为孟子和孔子还不相同，孔子他是曾经为官的，所以我们可以看到孔子为官的政绩。但是孟子一生并没有实际的做官，他一生都在为学，这个时候我们就要好奇了，如果是孟子来当政来为官，他会用什么样具体的方式或者他会怎么去做呢？</span></p><p><span>我们看接下来的问题，<strong>夫子当路于齐，管仲、晏子之功，可复许乎？</strong>这是公孙丑的问题，如果说老师您掌管了齐国的政权，管仲、晏子之功，可复许乎？我们看管仲和晏子这两个人，都是给齐国建立了功业之人。管仲辅佐齐桓公，称霸于诸侯，成为春秋五霸的第一位霸主。而晏子辅佐齐景公，让齐国以及景公，名扬天下。</span></p><p><span>这样两个人对于齐国的功业和贡献，都是很大的。所以公孙丑就问孟子说，老师您如果坐在那个位置上，可以达到管仲和晏子那样的功业吗？可以让齐国再度兴起，称霸于天下吗？这是公孙丑的问题，我们看孟子是如何回答的？</span></p><p><span>孟子其人讲话，是很有趣味的，他并不会直接回答这个问题，而是举例子，或者讲其他人的事情，来表达自己的想法，这样讲话更有利于回答问题。我们在生活当中，其实也要学会这种交流的方式。当有人问我们一个问题，你直接回答，未必是最好的方式。莫不如举个相同的例子，找一个相同的故事，来表达我们心中的想法，我们接下来学习孟子是如何表达的。</span></p><p><strong><span>孟子曰：子诚齐人也，知管仲、晏子而已矣！</span></strong><span>首先孟子讲了一句话，说你真的是一个齐国人，为什么这么讲？管仲和晏子都是齐国人，说你真的是一个齐国人，你就只知道管仲和晏子，这句话在讲什么？在讲公孙丑的格局和眼界太小了。你应该去放眼天下，看到更多优秀的人，看到更多贤德的人，而不只是看到了管仲和晏子。</span></p><p><span>我们先讲公孙丑的想法，是绝大多数人的想法，我们绝大多数人，只关心自己身边的事情。比如说，公孙丑他是齐国人，他就只关注齐国的那些贤德之人，而如果我们放眼天下，发现有更多贤德之人，可是我们没有看到。</span></p><p><span>我们去想一想，生活当中这个道理，也非常的实用。我们经常说一个人的眼界和格局，什么叫做眼界？如果你只盯着自己身边发生的事情，只关注自己身边的人，这就是没有眼界的表现。</span></p><p><span>我们举个小的例子，来逐步地延伸，比如说在生活当中，我们只关注自己在付出，这个时候你就看不到你的爱人，其实他默默地为家庭付出了很多，你的父母其实为你付出了很多，你的领导和同事以及你的朋友，其实也为你付出了很多，但是说我们的眼界太小了，我们只看到自己每天辛苦地在工作。</span></p><p><span>我们说我很努力的在工作，为了养家糊口付出了很多，可是我们有想过，我们的爱人也在付出很多吗？有想过我们的同事和领导，比我们付出的可能更多，有想过父母可能已经把最好的都给了我们，但是由于我们的眼界，实在是太窄，我们只看到了自己，所以看不到别人的付出。这个时候，我们就会升起很多的抱怨。</span></p><p><span>我们再扩大一点来讲，如果我们只关注到自己的付出，以及我身边这些人在付出，我们依然会生活在抱怨当中，我们会怨天尤人，我们抱怨命运对我们不公。我们这一家人没有做过什么坏事，我每天都在辛苦努力地工作，我也从没有害人之心。</span></p><p><span>可是为什么我当下的生活，还是没有过好？同样是我们的眼界太窄，我们的格局太小了，我们有没有去关注到比我们更优秀的人，他们是如何做事情的？他们在生活当中是如何提升自己的？</span></p><p><span>他们是否比我们做了更多有善行的事情？是否他们努力的方向比我们更正确？所以说我们要学会打开自己的眼界，放大自己的格局，不要总去看自己身边发生的这点事情。</span></p><p><span>我们再来看公孙丑，他比绝大多数人的眼界是大得多的，我们看他看到的是什么？是齐国，是管仲，是晏子之功，他是在想，如果老师的学问和德行是否可以让齐国变得更好，而不是放眼全天下。</span></p><p><span>那我们显而易见，孟子的思维和格局要比公孙丑，又要大上许多，他是放眼天下，来看待这个事情。所以他才会周游列国二十年，他无论走到每一个国家，他是没有国家的局限性的。孟子本是邹国人，但是同样他走到任何一个国家，都是希望你可以利民的，是可以称王天下的，对全天下的百姓都要更好。</span></p><p><span>所以我们看真正一个越有仁德的人，他是放眼天下的，而不只是自己身边的事情，自己小家的事情，也不只是齐国或者邹国的事情。所以我们回头，再来看这句话，孟子说你真是一个齐国人，你就只知道管仲和晏子而已矣，而不知道还有更多的人，还可以放眼天下。</span></p><p><span>我们从这段对话当中学习到，我们在生活当中，要把自己的眼界打开，要把自己的格局放大，这个时候心大了，我们身边的事情自然就变小。</span></p><p><span>我们举个例子，在家里照顾孩子、相夫教子的人，通常容易多烦恼，为什么呢？就是我们的眼界，只关注了当下家里所发生的琐事。如果这个时候，我们在家里懂得把眼界不断地放大，我们去关注到更多的人，我们去关注到我们的爱人，他为了这个家庭的生活，在辛苦地打拼。我们去看这个社会上，还有那么多的好人好事，还有那么多的人，想在为社会贡献着价值。</span></p><p><span>这个时候我们发现，家里这些琐事就不会障碍到我们，就不会让你产生那么多的烦恼，所以这就是眼界。我们来总结什么叫做眼界？我们往外看的有多远，从自身开始出发，往外面看得越远，也就是你的眼界就更宽，这个时候，我们的烦恼就会变得更少。</span></p></div>"
},{
    "title": "《孟子》公孙丑上①-2 孟子不愿与管仲比",
    "date": "2022-08-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-2 孟子不愿与管仲比</strong></span></p><p><span><strong>或问乎曾西曰：‘吾子与子路孰贤？’曾西蹵然曰：‘吾先子之所畏也。’曰：‘然则吾子与管仲孰贤？’曾西艴然不悦，曰：‘尔何曾比予于管仲！管仲得君，如彼其专也；行乎国政，如彼其久也；功烈，如彼其卑也！尔何曾比予于是！’曰：“管仲、曾西之所不为也，而子为我愿之乎？</strong></span></p><p><span>孟子要回答公孙丑的问题了，但是孟子并不会直接回答，而是又举了一个曾经发生的事情，这件事情发生在曾西的身上。我们要注意，这里的曾西是曾申，字子西，是曾子的儿子。曾子的父亲叫曾晳。我们看曾经发生在曾子的儿子身上什么事情呢？</span></p><p><span><strong>或问乎曾西曰：吾子与子路孰贤？</strong>有人曾经问了曾西一个问题，吾子是尊称，您的意思，也就是问曾西，您与子路孰贤？这个问题值得注意了。曾西是曾子之子，那么曾子又是孔夫子的弟子，子路也是孔子的弟子，也就是子路与曾西的父亲都是孔子的弟子。差着辈分呢，我们看曾西是如何回答的？</span></p><p><span><strong>曾西蹵然曰：吾先子之所畏也。</strong>蹵有两个意思，一个意思是不安，非常局促不安的样子，另外一个意思是不悦。这个时候曾西又不安，又不悦，故而蹵然曰：“吾先子之所畏也”。先子指的是先父，也就是曾子。子路是我父亲敬畏的人，这个时候他是很不开心的，并且很不安。</span></p><p><span>怎么能问出这样的问题？你去问我一个我父亲都很敬畏的人，问我与他谁更优秀？这不是难为人吗？没有办法去回答，所以就蹵然讲了这样一句话，他是我父亲敬重和所敬畏之人，我怎么可能去比较，既然和子路不能去比较，那么就比较一个其他人。</span></p><p><span><strong>曰：然则吾子与管仲孰贤？</strong>我们看这个问题如此的熟悉，正是公孙丑问孟子的问题，那您与管仲谁更贤德，谁更好一点？</span></p><p><span><strong>曾西艴然不悦，曰：尔何曾比予于管仲！</strong>艴，愤怒。曾西不但不高兴而且很愤怒，脸色一沉，讲到你怎么能拿我和管仲相比？言下之意是很不高兴的，认为没有可比性，为何要这样讲？</span></p><p><span><strong>管仲得君，如彼其专也；行乎国政，如彼其久也。</strong>说管仲得到齐桓公的信任，是多么的专一。他去掌管国政，是那么长的时间。我们首先看这两点，齐桓公是非常信任管仲的，无论大小事宜，都可以交给管仲去处理。并且不计较管仲的一箭之仇，管仲曾经是拿弓箭射过公子小白的，也就是齐桓公未做君主之前。</span></p><p><span>但是齐桓公并不计较，让管仲去做国相，掌管齐国的朝政。我们可以知道齐桓公对于管仲的这种信任程度，并且管仲一生都在掌管着齐国的政权，所以首先曾西说齐桓公信任管仲，那么专一，管仲掌管齐国政权，又那么长的时间。</span></p><p><span>这是非常重要的两点，我们之前讲过一位贤相，是要有一位明君，绝对信任他的君主，否则一个人即使再有才能，也没有发挥的机会。我们用到现在也是如此，即使一个再有才能的员工，如果老板不能全心全意地去信任他，不能给他足够的时间，也没有办法发挥自己身上的才能，所以是彼此成就的关系。</span></p><p><span>有明君才会有贤相，我们看曾西说：管仲得到了齐桓公的绝对信任，并且长时间地掌管齐国的朝政，接下来那个结果是什么样子的呢？</span></p><p><span><strong>功烈，如彼其卑也！</strong>功烈指的是功勋业绩，卑指的是卑小，也就是少的意思。曾西讲：管仲得到了齐桓公的信任，并且那么长的时间，而做到的功勋业绩却那么卑微，那么小。言下之意，曾西是不愿意跟管仲去相比的，因为他认为管仲所做的事情，微不足道。</span></p><p><span>我们这里不禁要有疑问了，管仲是很伟大之人，他帮助了齐桓公称霸天下，九合诸侯，并且把齐国治理得很好，怎么能说他的功业很卑微呢？</span></p><p><span>我们在《论语》当中讲过，孔子对于管仲的看法有赞美，同时也有批评。赞美的地方，说管仲大仁大义，如果没有管仲，我们现在可能已经沦为夷狄，已经没有了文化，所以说他是大仁大义的，并且他辅佐齐桓公称霸天下，不动刀兵。但是也说过管仲不知礼，不知俭，对于君主没有礼节，并且平时的生活作风，也不够节俭。</span></p><p><span>我们再来看这里的曾西，他认为管仲所做的功业是很卑小的，所以不愿意拿自己与他相比。我们这里要讲一个话题了，为什么儒家之人，并不认同管仲的做法呢？这里面是有原因的，在那个时候治理国家，通常有两条策略，第一称之为霸道，第二称之为王道。</span></p><p><span>管仲辅佐齐桓公称霸天下，用的是霸道，什么叫做霸道？也就是以武力征服天下，我让我自己的武力变得更强。我掌握绝对的话语权，代天子发号施令，这就叫霸道。但是王道所走的路，是截然不同的。我们比如说文王，比如说商汤，这些人走的是王道，再比如说尧、舜、禹。</span></p><p><span>何为王道？就一个出发点，一切以百姓的利益为先，一切都是为了百姓着想。用《大学》的话叫做亲民，也叫如保赤子，不停地去帮助百姓，从百姓安居乐业的角度去出发，去实行王道，而天下百姓自来归服。</span></p><p><span>我们看无论是齐宣王还是梁惠王，问到孟子该如何治理国家？孟子一直讲的都是王道，也就是施仁政，不要靠自己武力的强大，去征服天下，而是要对百姓更好，让百姓生活得更幸福，其他地方的百姓，自然愿意来你这里生活，这就是王道。</span></p><p><span>从曾西的角度看来，也是一样的，管仲走的是霸道，不值一提，而儒家推行的是王道，不要想着去称雄天下，也不要去用武力去压服，或者压制别人，而是不停地对百姓做得更好，去想着发展齐国的经济，发展齐国的军事，出发点和王道都是不相同的。</span></p><p><span>王道的出发点，一切都是利民的，利益他人的，而国家自然变得强大。所以从最本质上的出发点，就不相同，故而曾西不愿意拿自己和管仲去比较。</span></p><p><span><strong>尔何曾比予于是！曰：管仲、曾西之所不为也，而子为我愿之乎？</strong>又重复了一句加强语气，你怎么能拿我和他相比呢？接下来孟子作了总结，说曾西是不愿意做管仲所为的事情，而你以为我就愿意那样去做吗？</span></p><p><span>孟子表达了自己的想法，他引用了曾西过去所发生的一件事情，告诉公孙丑，我和曾西的想法是一样的，你以为我愿意和管仲相比吗？我是完全不愿意的。因为我们主张的是王道，实行的是仁政，而管仲治理天下，主张是用霸道，用武力掌握绝对的话语权。</span></p><p><span>正所谓道不同不相为谋，没有谁对谁错，或者谁的更好，谁的不好，只是我们整个的主张并不相同。像我们现在也是如此，我们不是说别人的想法不够好，或者只有我们的想法才是正确的，只不过我们的主张不一样。</span></p><p><span>有的人说，我把我的产品做得更优质，我用我的产品去服务顾客，我赚取更多的利润，没有错误。但是学习儒家文化的人，我没有想去赚取更多的利润，而是想我如何去帮助更多的人，以帮助别人为目的，去调整自己做事情的方向，如此我那个利润是自己来到，而我不需要去强求。所以是完全两个思维，我们不讲对错，只是讲各不相同，而孟子主张的是王道，所以并不愿意与管仲相比。</span></p><p><br/></p></div>"
},{
    "title": "《孟子》公孙丑上①-3 久则难变",
    "date": "2022-08-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-3 久则难变</strong></span></p><p><span><strong>曰：“管仲以其君霸，晏子以其君显。管仲、晏子，犹不足为与？”曰：“以齐王，由反手也。”曰：“若是则弟子之惑滋甚。且以文王之德，百年而后崩，犹未洽与天下；武王、周公继之，然后大行。今言王若易然，则文王不足法与？曰：“文王何可当也，由汤至于武丁，贤圣之君六七作，天下归殷久矣，久则难变也。”</strong></span></p><p><span>我们来回顾上一讲，孟子与公孙丑之间的对话，公孙丑问孟子一个问题，如果由老师您来当政，是否可以恢复到管仲和晏子那个时候的功业？公孙丑问这句话有两种感情在其中，第一是爱国之情，因为公孙丑是齐国人，所以他希望齐国变得更加兴盛，可以兴盛到齐桓公那个时候，称霸于诸侯，可以像齐景公那个时候，齐国是名扬天下的。</span></p><p><span>第二种感情叫师生之情，他希望自己的老师可以在齐国当政，可以把齐国的功业恢复到以前的那种情况。故而问了孟子这样的问题，但是没有想到老师却不屑于与管仲，相提并论，并且引用了曾西身上发生的事情来作对比，并不愿意跟管仲、晏子相比较，因为管仲走的是霸道，而孟子儒家文化提倡的是王道。</span></p><p><span>如何对百姓更好，爱民如子而称王天下？这里涉及到两个角度的问题。首先公孙丑的角度是，自下而上地去看待，比如说我作为一个齐国人，我希望我的国家变得更兴盛。比如说我觉得管仲和晏子的功业做得很多，这是自下而上，他是仰视着看。但是孟子则不同，他是自上而下的，去看待这个问题。</span></p><p><span>他通过学习儒家文化，通过从孔夫子那里学习的王道仁政，他学习的是尧、舜、禹、汤、文王、武王、周公这些人的德行，所以他站在王道的角度往下看，他是不屑于去做这样的事情的。</span></p><p><span>因为两个人的角度，看到的观点并不相同，在孟子和曾西的眼中，管仲和晏子做得事情是微不足道的，并不足够好。但是公孙丑觉得他们已经很伟大，做得事情已经很好，故而他依然是不解。</span></p><p><span>所以接下来继续的问道：<strong>曰：管仲以其君霸，晏子以其君显。</strong>说管仲辅佐齐桓公，让他称霸于诸侯，而晏子辅佐齐景公，可以让景公名扬天下，声名远扬。</span></p><p><span><strong>管仲、晏子，犹不足为与？</strong>难道管仲和晏子还不值得学习吗？为何值得学习呢？在公孙丑的眼中很简单，因为管仲辅佐齐桓公，所以可以称霸于诸侯，因为晏子辅佐了齐景公，所以可以让君显，也就是声名远扬。说这样的人难道不值得我们去学习吗？如果这样的人都不值得我们去学习，我们到底该学习什么呢？</span></p><p><span><strong>曰：以齐王，由反手也。</strong>孟子讲到，如果以齐国的能力，以齐国国土的大小，以齐国的兴盛，要想称王于天下，易如反掌，就像这个手掌，我们把他反过来，如此简单。</span></p><p><span><strong>曰：若是则弟子之惑滋甚。</strong>这个时候公孙丑讲了，老师如果照您这样说，弟子我心中的疑惑就更甚了，怎么可能称王天下，是易如反掌的事情？</span></p><p><span><strong>且以文王之德，百年而后崩，犹未洽与天下。</strong>这就是公孙丑的困惑了，如果老师您认为齐国称王天下，是易如反掌的事情，我想问的是以周文王那么大的德行，百年而后崩，文王活了那么久，也没有完全让天下臣服。</span></p><p><span>历史有记载，文王是活到九十多岁的，未洽于天下，这里的洽是周遍，遍布的意思。也就是文王那么大的德行，治理国家那么久，也没有遍布天下，让天下的百姓去臣服。所以公孙丑心中的困惑是很深的，怎么齐国想要称王天下，就易如反掌，以文王那么大的德行，经营了那么久，还不能称王于天下？</span></p><p><span><strong>武王、周公继之，然后大行。</strong>说文王在世之时，并没有周遍天下，并没有称王天下，而是武王和周公继承了文王的德行和遗志，然后大行。这个时候才大行于天下的，这里公孙丑在讲文王以及武王，以及周公，况且还不止这些。</span></p><p><span>我们经常讲到太王，也就是从文王的祖父开始，已经都是贤明之君，都是大德之人。需要历数这么多代贤君，才可以成王天下。</span></p><p><span><strong>今言王若易然，则文王不足法与？</strong>今天我们讲，称王天下如此的简单，难道文王也不值得我们学习和效法吗？</span></p><p><span>我们再来回顾这段话，公孙丑的疑惑，公孙丑认为管仲和晏子功业是很大的，是值得学习的，但是孟子觉得管仲和晏子并不值得效法，自己也不屑于与他们去相比较。因为孟子认为以齐国当下的情况，要想称王，走王道、施仁政，是易如反掌的事情。</span></p><p><span>这个时候公孙丑的困惑，就变得更深了，如果说称王天下这么简单，我觉得这个道理不正确，因为以文王的德行，在他在世之时，都没有称王天下。而是武王、周公继之，然后大行。可是今天老师您却认为称王天下，如此简单，那难道说周文王的德行和周文王称王天下的方法，也不值得我们去学习和效法了吗？</span></p><p><span>接下来整个这一段，都是孟子回答公孙丑的疑惑。首先讲了一句话：<strong>文王何可当也。</strong>怎么能和文王相提并论呢？没有办法与文王去相比较的。接下来孟子要开始讲，为什么文王在世之时，并没有称王于天下。</span></p><p><span><strong>由汤至于武丁，贤圣之君六七作。</strong>孟子从商汤开始讲起，商朝的开国之君，由汤到武丁中间出现了六七位贤德之君。</span></p><p><span><strong>天下归殷久矣，久则难变也。</strong>因为从商汤到武丁，出现了六七位贤德之君，所以天下归殷久矣，天下的百姓是诚心归服于商朝的。久则难变也，因为归服的时间久，所以他是很难改变，很难被推翻的。因为从商汤到武丁之间，这几位贤君都是为百姓去着想的，所以江山很稳固，百姓安居乐业，所以久则难变也。</span></p><p><span>那我们这里要来延伸讲讲，久则难变也，这个观点在我们生活当中极其重要。比如说一个人的习惯，长久了以后是很难改变的。我们举例子，即使一个人到国外生活多年，依然会用自己小的时候，或者说过去吃的食物习惯和方式去生活。</span></p><p><span>再比如说，一个人的乡音难改，无论你去外地多长时间，多久，你乡音一直都是在的，这就是久则难变也。我们再举个例子，比如说两个人在一起相处久了之后，就形成了习惯，这个人突然有一天离开你的身边，你更多的是不适应，不舍，也就是没有办法习惯。</span></p><p><span>再比如说，生活当中我们也是一样的，当你的行为产生了一个习惯以后，时间越久，越难以改变；比如说，我们写字的握笔方式，即使他不是正确的，但是我们长久以来，都是这样的习惯，即使有人告诉我们，正确的拿笔的方式，我们也很难去改变。</span></p><p><span>再比如说，我们一个人，如果遇事总是喜欢发脾气，总是喜欢抱怨，这也是一种习惯。所以每当遇事情之时，我们都是抱怨的，都是发脾气的，都是以暴力的方式去解决，这就是习惯。所以我们明白这个道理以后，要想改变自己当下的习惯，是需要下大的决心才可以的，一方面是决心，另一方面就是足够的时间，才可以去改变。</span></p><p><span>我们再比如说，一个人总有拖延的习惯，注意这是习惯，因为长久以来形成这样的习惯，故而很难改变。如果我们想改变拖延的习惯，需要有巨大的决心，再加上时间，才会让我们的习惯加以改变。所以这里我们要明白一个道理，我们人是被习惯所支配的，被习惯所掌控的。</span></p><p><span>很多时候，明明不愿意这样去做事情，但是莫名其妙的，就被我们的习惯支配着，又变成了这个样子。所以我们要让好的习惯，去支配我们的生活，不要养成一些坏的习惯，从良好的习惯开始，否则时间越久就越难改变。</span></p><p><span>这是我们用来修正自己，如果我们反过来去观察别人也是一样的，我们通过别人的思维方式，通过别人的讲话，通过别人的行为，我们也可以看到对方的习惯。如果这个习惯我们是可以善加利用的，他就会向好的方向去发展，如果我们懂得去帮助和改变他人，就要懂得从他人的习惯开始下手。</span></p><p><span>我们举个例子，比如说我们的孩子，我们想让他将来变成什么样的人？那么从小我们就要让他养成什么样的习惯。举个例子，我们想让孩子心目中有别人，在生活当中遇到事情的时候，我们就要经常的去教导他，去引导他，去陪伴他，让他懂得为别人着想，久而久之他就会形成习惯，那么长大以后，他就会懂得为别人着想。</span></p><p><span>再举个例子，我们将来想让这个孩子变成一个有礼貌的人，我们从小就要去引导他，懂得与人打招呼，然后做事情懂得守规矩，长大以后他自然就变成了这个样子。所以无论是对我们自己也好，或者我们是教孩子也好，教我们的学生也好，都要养成良好的习惯。</span></p><p><span>养成良好的习惯，就会成为一种自然，而时间越久越不会被改变，就形成了惯性。我们再回到文中，是因为从商汤到武丁，有六七位贤君，所以天下百姓是诚心归服的，而归服的时间越久，就越难被改变，想推翻商朝，是很困难的事情。</span></p></div>"
},{
    "title": "《孟子》公孙丑上①-4 贤人相辅",
    "date": "2022-08-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》公孙丑上①-4 贤人相辅</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。纣之去武丁未久也，其故家遗俗，流风善政，犹有存者；又有微子、微仲、王子比干、箕子、胶鬲，皆贤人也，相与辅相之；故久而后失之也。尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong></span></p><p><span><strong>武丁朝诸侯，有天下，犹运之掌也。</strong>武丁让诸侯来朝见，拥有整个天下，犹如在掌上转动东西一样，就是如此简单，为什么如此简单？因为从商汤到武丁，打下了深厚的基础，并且武丁亦是一位贤君，在武丁这个时期，是被称为武丁盛世的。他自己又是一位贤君，并且从商汤以来一直积累德行，施行为天下百姓着想的仁政。所以到武丁这个时期，掌管天下，就像在掌中运东西一样，如此简单。</span></p><p><span>这里为什么要提到武丁呢？首先因为武丁这个时期是盛世，并且到了武丁这个时候是殷商；</span><span>最后一位贤德之君，从武丁开始一直到商纣王，纣王以后商朝就灭亡了。这个期间又经历了大约一百二十年，我们去看这个时间段，从商汤到武丁，经历了六七位贤君，所以天下是稳固的，治理天下易如反掌。</span></p><p><span>但是从武丁开始到商纣王，殷商灭亡又经历了大约一百二十年的时间，也就是从武丁之后，一代一代商朝的君王，开始失去了德行，开始不施仁政，所以到商纣王那个时候会灭亡。我们就看到了一件事物的规律，他不是一下兴盛，亦不是一下衰亡，他是有个循序渐进的过程。</span></p><p><span>比如说，一个企业经营得很好，不是一年两年的努力，是长时间的努力，逐渐地达到了顶峰。一个企业开始变得衰退，到没落，最后到灭亡，也不是一朝一夕的，是从顶峰一代不如一代，一件事情不如一件事情，最后到灭亡。</span></p><p><span>我们说两个人的感情，也是如此，他从一开始的平淡，不停地升温，最后感情很深厚很稳固。如果随着一些事情的发生，或者时间的推移，两个人经历的事情，越来越不和谐，最后可能导致两个人的感情破裂，所以我们明白这个事物的规律，是让我们懂得及时觉察的智慧和能力。</span></p><p><span>我们要学会在一件事情没有呈现结果之前，及时地觉察到问题出在了哪里。我们再比如说孩子，很多家长会讲，说孩子突然变得叛逆了，其实并不突然，他从不叛逆到叛逆中间，是有一个时间线的，只是我们没有及时地察觉到，没有及时地发现问题，当结果呈现出来的时候，</span></p><p><span>已经晚了。</span></p><p><span>还有人说，我的爱人怎么突然开始不爱我了，他突然开始对我不好了，其实并不是，中间也是有一个过程，是有一个时间线的，只不过我们没有及时地去觉察到，去看到问题。这个时间线的长短，根据事情的大小有所不同。</span></p><p><span>比如说，一个朝代，他可能这个时间线是一百年，是两百年。对于我们企业来讲，可能是三年五年，十年乃至于二十年。对我们的家庭来讲，可能是一年，两年，三年。一些更小的事情，可能是一个月，两个月，三个月，甚至是一天，两天，三天。所以无论任何一件事情。都是有时间线的，都是有过程的，都是有迹可循的，我们要从中去看到规律和痕迹。</span></p><p><span><strong>纣之去武丁未久也，其故家遗俗，流风善政，犹有存者。</strong>这里讲到了纣离武丁，时间并不太久远，一百多年的时间，但是在这一百多年的时间，其故家遗俗，流风善政，犹有存者。故家是指过去的，世代相传的，那些好的遗俗还在。流风善政，过去从商汤到武丁，那些为政的，那些善良的，那些为民请命的，还留下来了，所以叫犹有存者。</span></p><p><span>故而到商纣王时期，虽然已经无道，但是还有很多百姓，并不愿意离开商朝，也并不愿意推翻商朝，并且最重要的还给商纣王，遗留下来很多好的东西。比如说仁政，比如说国家的基础，再比如说，更重要的是贤德之人还有很多。</span></p><p><span><strong>又有微子、微仲。</strong>微子和微仲都是商纣王的兄长，商纣王是第三子，但是为何商纣王可以继承了君位？因为微子和微仲的母亲，在生微子和微仲之时，还不是皇后的身份，但是在生商纣王之时已经变成了皇后，所以这个时候纣王就变成了嫡子。以前是立嫡子为君的，故而商纣王就做了君主，但是微子和微仲是两位贤德之人，一起辅佐商纣王。</span></p><p><span><strong>王子比干、箕子、胶鬲，皆贤人也，相与辅相之，故久而后失之也。</strong>并且还有王子比干和箕子，王子比干和箕子是纣王的叔父，胶鬲是贤臣，臣下的身份。以上所讲的这些都是贤者，因为有这些贤者在，故而想要推翻商纣王，并没有那么容易。因为有这些贤人去辅佐纣王，故而久后失之也，所以要很长的时间，才会失去商朝，才会灭亡。</span></p><p><span><strong>尺地，莫非其有也；一民，莫非其臣也；然而文王犹方百里起，是以难也。</strong>没有一寸土地不是归纣王所有，没有一个百姓不是他的臣子，然而文王只有方圆百里之地起家，是以难也。</span></p><p><span>我们整个再来看，这一段孟子的回答，回答了公孙丑。为什么以文王的德行，在世之时没有称王于天下呢？并不是文王的德行不足够，我们怎么敢和文王去比德行呢？是因为从商汤到武丁，有六七代贤君，所以天下归商久矣，久则难变。</span></p><p><span>这个是很难改变的，况且从武丁到商纣王的时间并不久，一百多年的时间。所以以前的一些好的仁政，还有一些遗俗，并且还有一些贤人，共同留下来辅佐纣王，而文王只是从方圆百里的地方起家。</span></p><p><span>那个时候没有一寸土地，不是纣王的，没有一个臣下不是纣王的，所以文王的起家才如此艰难。并不是文王的德行不够大，而是商朝的根基过于深厚，所以文王在世之时，并没有能称王天下，而需要武王和周公继之。</span></p></div>"
},{
    "title": "《孟子》公孙丑上①-5 乘势而为",
    "date": "2022-08-30",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》公孙丑上①-5 乘势而为</span></strong></p><p><strong><span>齐人有言曰：‘虽有智慧，不如乘势；虽有镃基，不如待时。’今时则易然也，夏后、殷、周之盛，地未有过千里者也，而齐有其地矣；鸡鸣狗吠相闻，而达乎四境，而齐有其民矣，地不改辟矣，民不改聚矣；行仁政而王，莫之能御也。</span></strong></p><p><strong><span>齐人有言曰：虽有智慧，不如乘势；虽有镃基，不如待时。</span></strong><span>我们再来回顾，孟子与公孙之间的对话，公孙丑问孟子如果您来执掌齐国的国政，可以再现管仲和晏子的霸业吗？孟子是不屑于和管仲、晏子相比较的，正是因为管仲和晏子兴的是霸业，而孟子想要推行的是王道。</span></p><p><span>接下来公孙丑就有了疑问，如果实行王道，时间会不会太久？即使以文王的德行，也要武王和周公之才，可以实行王道，他不是一代人可以实现的。接下来孟子又说，不是这样的道理，因为文王那个时期，他从很小的地方开始起家，虽然经历了很多艰难，但是最后不也称王于天下了吗？</span></p><p><span>为什么文王那个时候很难，是因为从商汤到武丁打下的基础很深厚，而从武丁到商纣王仅有一百多年的时间，所以还留下了很多贤臣，还留下了很多仁政，留下了很多故家遗风，所以他是很难的。</span></p><p><span>但今天的情形不同，今天的齐国有广阔的土地，有众多的百姓，并且是万乘之国，而且很久都已经没有出现仁君，去推行仁政，现在是最合适的时机。如果这个时候，实行仁政等于乘势而为，做事情是易如反掌的，想要称王于天下，是非常简单的事情。</span></p><p><span>所以这里孟子在讲齐国的现状之前，讲了一句齐国的谚语：虽有智慧，不如乘势；虽有镃基，不如待时。我们看乘势，何为乘呢？举个例子，我们说乘车，也就是我们自己不用动，车子在动，就可以带我们去想要去的地方；比如说我们乘飞机，我们可以不动，但是飞机它在动，就可以带我们去那个地方，这称之为乘。</span></p><p><span>我们接下来再看，什么叫做势呢？我们经常讲一个成语，叫大势所趋，就是众多人推动着一件事情，众多需求下推动的一件事情，它是自然发展的；我们乘着别人的需求，就可以到达那个地方。</span></p><p><span>比如说孟子讲的，今天齐国如果实行仁政，称王天下，是易如反掌的事情。因为百姓生活在水深火热之中，已经太久了，连年战乱，这个时候的百姓是需要安居乐业的生活，如果这个时候实行王政，这就叫大势所趋。</span></p><p><span>我们再来讲一讲，势的几个特点，首先势是变化的，一直在动；我们举个例子，我们见过海浪，上一秒它可能离我们还很远，那下一秒它就来到了我们的眼前，再下一秒它可能离我们又很远，这就叫势，所以势它是波动的，是变化的。</span></p><p><span>我们再讲，势还有什么特点呢？比如说杯子从桌子上落下来，我们可以把它接得住，这个杯子落下的过程就叫势，但是因为它的势比较小，所以我们可以接得住；但是如果落下来的这个东西比较大，我们用手是没有办法接住的，也就是落下的东西越大，势力也就会越大，这种力量是不可被阻挡的。</span></p><p><span>我们再去看，文王武王之所以可以创建周朝，就是因为势头不可挡，叫势不可挡。比如说，商纣王如果不是荒淫无道，如果百姓不是生活在水深火热之中，文王、武王即使再有德行，也难以得到天下。这是因为所有的百姓生活的并不好，他们是不想生活在商纣王的统治之下，人们是有需求的，这就是大势所趋。</span></p><p><span>因为百姓有太多的怨言，这个时候如果有人是兴仁政的，是有德行的，百姓看得到，自然拥护。文王和武王故而可以得天下，也就是势越大，越不可阻挡。我们知道势的第二个特点，不可被阻挡，不可被改变，它不是以个人的意志或者能力可以转变的。</span></p><p><span>我们再讲势还有什么特点呢？它是积少成多的，最后就成为了势。本来他可能很少，但是需求的人越来越多，或者聚集的东西越来越多，就形成了大势。</span></p><p><span>我们举个例子，比如说过去这些年，房地产行业的兴起，为什么房子会越卖越贵？因为人们生活条件好了以后，都想改善生活，想要买房子的人变得越来越多，所以房价就会不停地上涨，这就叫大势。它不以个人的意志为转移，不是有个别人抗议，觉得房子贵，就可以让房价停下来，因为有太多的人需求，积少成多在推动着这件事情。</span></p><p><span>什么时候房价会落下来呢？需求的人越来越少，大家不再购买房子，它自然就落下来了，这就叫势。所以我们看势它就像一个抛物线一样，最开始处低位，逐渐地上升到高位，到最高的时候再开始下降。</span></p><p><span>我们再比如说，这些年互联网的兴起，是不是一样的道理？以前人们都喜欢在实体店，喜欢逛街，以这种形式去购物，但是随着这种形式长久时间的不变化，人们已经开始没有新鲜感，这个时候开始出现了网络，一开始人们是不接受的，但是随着人们更多地开始追寻一些新鲜事物，逐渐地需要的人变得越来越多，再积少成多的过程，就形成了势。</span></p><p><span>我们这个时候再来回顾，势的几个特点，首先它是变化的，它是一直在动的；其二，这种势越大，这种力量就不可阻挡，无法被改变；其三，它是积少成多的过程。</span></p><p><span>孟子在这里之所以引用这句谚语，就是讲齐国现在正在势头上，如果懂得乘势而行，顺势而为，实行王政去推行仁道，这个时候称王天下是易如反掌的事情。</span></p><p><span>我们在生活当中，如何才能乘势而起呢？我们放到最后，看看孟子是如何讲的？虽有镃基不如待时，镃基指的是锄具，也就是农民耕种所用的锄头，虽有锄具不如待时，你不如待时而动。什么意思？即使你有好的锄具，如果不到耕种的季节，也是没有作用的。也就是齐国即使再强大，但是你不能等到好的时机也没用。</span></p><p><span>比如说，文王即使有德行，如果不是因为商纣王暴虐无道，这个时候你也没有办法得到天下，这就叫时机。所以我们要知道做任何一件事情，都要等待合适的时机，而齐国现在有势，并且正处在合适的时机，只不过看是否能抓住这个时机。</span></p><p><span>我们再讲生活当中很多事情都一样，我们要懂得乘势而为，要懂得抓住恰当的时机去做事情。</span></p><p><strong><span>今时则易然也。</span></strong><span>今天齐国正处在合适的时机上，为什么孟子说现在的齐国处在合适的时机上，我们看孟子接下来是如何讲的？</span></p><p><strong><span>夏后、殷、周之盛，</span></strong><span>地未有过千里者也。夏、商、周之盛，在他最兴盛的时候，地也没有超过方圆千里。</span></p><p><strong><span>而齐有其地矣。</span></strong><span>说今天齐国所拥有的土地，方圆千里，即使过去夏商周在最鼎盛的时期，也没有今天齐国的土地这样辽阔。</span></p><p><strong><span>鸡鸣狗吠相闻，而达乎四境。</span></strong><span>鸡鸣狗吠相闻，它形容的是百姓密集的程度，鸡叫和狗叫可以互相听闻，也就是邻居会比较多，并且达乎四境。不是只有某个地方，人员密集到这种程度，可以到齐国四周的边境，我们可以想象这样一个画面，百姓是很多的。</span></p><p><strong><span>而齐有其民矣，地不改辟矣，民不改聚矣。</span></strong><span>说齐国现在已经有这么多的百姓了，今天齐国不需要再去扩展土地，不需要去增加更多的百姓；因为齐国现在有方圆千里的土地，并且百姓生活的密集程度，已经很多了。所以今天齐国不应该再去扩展土地，也不要去想着如何增加民众，只需要把现有的这些百姓，让他们生活得更好，就足以称王于天下。</span></p><p><strong><span>行仁政而王，莫之能御也。</span></strong><span>如果这个时候齐国实行仁政，是没有办法阻挡的。我们再来回顾这一段，孟子讲齐国想要称王天下，易如反掌，为什么？首先齐国的土地足够大，百姓足够多，即使夏、商、周在最兴盛之时，也没有这么多的人，也没有如此辽阔的土地。</span></p><p><span>这个时候的齐国，不需要想着再向外扩张，不需要称霸于诸侯之间，只需要去兴王政，可以让百姓安居乐业，让百姓过上更好的生活。而其他的国家还在战乱之中，那百姓自然想要来齐国生活，怎么还需要招集更多的百姓，怎么还需要扩展土地呢？</span></p><p><span>如果这个时候，齐国去实行王道，兴仁政，是不可被阻挡的，这就是大势所趋。不会以人的意志为转移，没有办法阻挡这种势。</span></p><p><br/></p></div>"
}]