[{
    "title": "《孟子》梁惠王上①-1 解读孟子（免费）",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上①-1 解读孟子</strong></span></p><p><span>我们今天开始学习《孟子》，孟子出生在战国时期，讲《孟子》之前，我们先对战国时期，做一个初步的了解。孔子是在公元前四百七十九年离世，那个时候是春秋末期。</span></p><p><span>孔子离世后不久，大约在公元前四百七十六年、七十五年，因为这个时间不太确定，开始进入战国时期，一直到秦始皇统一六国，战国时期前后，经历两百五十多年的历史，在春秋末期还是讲礼的，虽然礼崩乐坏，但是还有一个礼在约束，一旦进入了战国时期，开始吞并，战争不停地加强。</span></p><p><span>在战国初期，已经形成了战国七雄的局面，并不等于只剩下七个国家，还有二十多个国家，但是以这七个国家为大国，齐、楚、燕、韩、赵、魏、秦，主要剩下七国争雄，孟子就出生在这个时期。</span></p><p><span>所以孟子的观点，更直接更鲜明，他不像孔夫子，那个时候还有很多人去问政，孔夫子回答的方式，多是温和的，而到了孟子这个时期，已经不再有人问政，而是直接问利，这个时候小国，多数是为了自保，如何不被灭亡，而大国想的都是如何扩张，大家开始变得更急功近利，并没有人有耐心听，以温和的方式去讲。</span></p><p><span>到了孟子这个时候，讲话非常的直接，观点非常的鲜明，每一个时代出生的人，他的性格是各不相同的。举个例子，比如，六七十年代出生的人，和我们现在九零后的人，零零后的人，天然的性格，就各不相同，这是处在出生的那个时代的背景所决定的。</span></p><p><span>所以我们去看孔子和孟子，也是一样的，两个人的性格上有很大的不同，但是在政治主张上，在一生推行的道上是一致的，孟子非常推崇孔夫子的学问，推行仁政。</span></p><p><span>孟子出生在邹国，是现在的山东邹城，邹国以前是鲁国的一个附属国，孟子出生在公元前约三百七十二年，到二百八十九年，八十四岁的高寿。我们现在流行，一句话叫：<strong>“七十三、八十四，阎王不叫自己去。”</strong>而七十三、八十四指的是，孔子和孟子的寿终，由此我们就可以看到，民间对于孔孟，两位圣人的推崇，甚至自己的年龄寿命，都是以七十三、八十四为基础。</span></p><p><span>孟子的经历和孔子有很多相同之处，孔夫子是幼年丧父，而孟子在幼年之时，他的父亲不知去向，孟子的父亲，据说是一位不得志的书生，在孟子幼年开始离开，有人说是离世，有人说去经商，有人说去为官，这个不可考证。自孟子幼年离开以后，再也没有回来过，是孟母把孟子从小带大，给他教育，有我们熟知的孟母三迁的故事。</span></p><p><span>并且孟子同样是周游列国，周游列国前后将近二十年，在这二十年当中，同样是有很多学生，跟随在身边的。在极盛之时，有车数十乘弟子数百人，由此我们可以看到，孟子在战国那个时期所讲的仁政，是有很多人愿意跟着学习，并且愿意跟随，而孟子在讲学的时期，是战国中期。</span></p><p><span>我们刚才讲到，在战国初期，已经形成了战国七雄争霸的局面，到了战国中期，开始休养生息，因为大家经历了连年的征战，吞并、扩张以及自保，百姓连年征伐，已经变得很累，所以在休养生息的阶段，大家都开始求贤若渴。</span></p><p><span>在求贤若渴的阶段，有两种人比较被重视，第一种人是武将，比如，在战国那个时期，我们所熟知的孙膑、庞涓、吴起，包括后期的白起、廉颇、李牧，王翦等等，这些历史的名将，都是在那个时期所产生的，因为战乱自然是需要这些武将。</span></p><p><span>除了武将之外，第二种人就是有谋略之人，或者是懂得变法之人，比如说商鞅、吴起，也是懂得变法的。再比如说像孟子这样，有自己的思想和学术之人，每个人的思想不同，提出来的治国方针就各不相同，在这个时期是百家争鸣的，每个人都会提出自己的治国理念，每个人都会说出自己的学术思想，一旦被哪个国家的君主开始任用，就可以实行自己的政治主张。</span></p><p><span>在这样一个战乱的时代，我们可以想象得到，孟子的思想在当时，并不是主流的思想，所以孟子一生并没有为官，因为没有人愿意全盘采纳孟子的思想，所以他没有办法实现自己的政治主张。</span></p><p><span>孟子一生致力于推行仁政，讲仁者无敌，与民同乐，可是在那样一个时代，大家都在求利，都在想如何可以快速发展壮大，去吞并其他的国家，以及自保，所以没有人愿意去实行仁政，但是这里我们要思考一个问题，既然没有人愿意去实行仁政，那么孟子为什么一定要坚定的推行仁政？</span></p><p><span>在孟子的开篇讲，梁惠王和孟子之间的对话，梁惠王开篇，就问孟子说：“您不远千里而来，有什么可以利益我们国家的方法和政策呢？”孟子直接就开始讲：<strong>“何必曰利，仁义而已矣。”</strong>说大王您不要去谈利，只要谈仁义就够了。</span></p><p><span>我们去试想一下，孟子这样的圣人，会不会知道，自己讲的仁义之道，不会被他人全盘的接纳，别人都是想要快速地发展，快速的求利，而孟子坚持要讲仁义，不能讲利。如果我们从历史发展的眼光来看，时至今日，在当时讲利的，讲谋略的那些人，我们或许还会记得那些人，历史会记录他们的一生经历，和他们在那个时代所做的贡献。</span></p><p><span>比如，我们讲到的苏秦，张仪，商鞅，吴起，申不害，这些人都是曾经变法的人，可是我们到今天，除了记得这些人，以及他们在历史当中所做过的事情，我们知道他们的言行吗？我们还会了解他们的思想吗？好像不会的。</span></p><p><span>所以这里我们要提出儒家学说，非常重要的一个核心，一个叫仁道，另外一个叫立言，是否可以推行仁道，是否能把仁道的思想立言，因为孔子和孟子，都是立言之人。所以到今天我们还可以学习孔孟之道，只有从道的发展，更长远的角度，我们才能理解。</span></p><p><span>为什么在战乱时期，孟子依然要讲仁德之道，而不去谈利？因为无论历史如何发展，人性的角度如何发展，天下大事分分合合，最后都是要归到仁字上，即使当下在求利，当下快速地扩张，可是一旦扩张，乃至于统一以后，还是要推行仁政的，这是道的根本，万变不离其宗。</span></p><p><span>从今天的角度来看，我们去看儒家文化之所以传承，两千五百多年，因为他讲的是道的根本，是国家所需要的，是任何一个社会都需要的。比如说我们去讲其他的，关于纵横的，关于阴阳的，关于法家的文化，可以用，但他是小众。</span></p><p><span>比如，统治者可以去用，处上位的人可以去用，但儒家文化不一样，他是适合全民都在用的，无论是处上位的人，还是处下位的人，都要懂得去修身，无论是天子乃至于庶人，都要懂得去推行仁德之道，都要懂得以仁德为立身之根本。</span></p><p><span>所以我们从这个角度，才能去理解孟子的思想，并且我们才能意识到，孟子究竟有多伟大，无论时势如何艰难，无论别人是否认同，孔子和孟子这样的人，都是明知不可为而为之，坚定的去推行自己的仁政，绝不动摇。我们大概了解战国那个时期的形势，我们再来看，就是在这个时期，孟子来到了魏国，见到了梁惠王。</span></p><p><span>这里我们要有一个疑问了，为什么魏国的君主叫梁惠王？我们先讲魏国的历史，魏国是从春秋时期的，晋国三家分晋而来，韩国、赵国、魏国三家，把原有的晋国，分成了三个国家，成为战国七雄的其三。</span></p><p><span>魏国的第一任国君叫魏文侯，在魏文侯那个时期，战国初期，魏国是非常强大的，当时魏文侯拜了一位名师，这位名师我们很熟悉，他是孔夫子的学生子夏，魏文侯拜子夏为老师，在河西地区讲学，在魏文侯那个时期，魏国的文化是非常鼎盛的，因为文化的鼎盛，所以魏国很强大。</span></p><p><span>在魏文侯之后是魏武侯，魏武侯用了吴起变法，让魏国的武攻变得更强大，魏武侯之后就到了魏惠王，也就是文中的梁惠王，为什么要称为梁惠王？因为在魏惠王的时期开始衰落，有齐国、楚国，还有秦国三个大国，在魏国的四周，这个时候，魏国从南面打不过楚国，跟齐国的战争当中，又失去了自己的上将，并且太子被掳，后来也被杀害，跟秦国的交战当中又大败，割让了河西之地。</span></p><p><span>所以这个时候，魏国从安邑这个地方，迁都到大梁，今天的开封，所以又被称为梁故而称，梁惠王。我们从这段故事当中，可以知道，梁惠王此时候的心情，连年战争，都是战败的情况，并且魏文侯和魏武侯时期，魏国是很强大的，到了梁惠王这个时候屡屡战败，危机四伏，所以他想恢复到魏国的强大，故而开始招贤纳士，求贤若渴。</span></p><p><span>在这种状态下，孟子来到了大梁，和梁惠王之间，产生了一些对话。《孟子》七篇分为上下卷，共七篇十四卷，但是《孟子》和《论语》有所不同，《论语》是孔夫子离世之后，学生和再传学生，共同所编写记录。而孟子是到了晚年之后，带着学生们自己开始编写《孟子》，当然《孟子》一书，并不是孟子自己一个人写成的，而是带着学生们，后期的学生们再加以完善，再加以删减，最后形成了《孟子》。</span></p></div>"
},{
    "title": "《孟子》梁惠王上①-2 义利之辩（免费）",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上①-2 义利之辩</strong></span></p><p><span>孟子见梁惠王，这就是孟子的开篇。<strong>王曰：“叟！不远千里而来，亦将有以利吾国乎？”</strong>我们可以看到梁惠王，开门见山，叟是指的老先生，这个时候，孟子见梁惠王之时五十二岁，而梁惠王这个时候八十岁，也就是比孟子大了二十八岁 ，八十岁的年龄，称五十二岁的人为叟，老先生，里面还是有恭敬和尊重在其中的。</span></p><p><span>梁惠王说：“老先生，您不远千里而来，亦将有以利吾国乎，有什么可以利我魏国的方法吗，有没有什么好的策略？”我们可以体会到梁惠王的心情，魏国开始变得逐渐衰落，并且屡战屡败，甚至割让河西之地，被迫迁都，所以他此时的心情，是非常急迫的，直接就问孟子，有什么可以利益我国的方法吗？</span></p><p><span>我们看孟子是怎么讲的？<strong>孟子对曰：“王何必曰利，亦有仁义而已矣”</strong>，孟子也很直接，说：“大王，您何必曰利，只要有仁义就可以了。”这里的观点非常的鲜明，也形成了强烈的对比。</span></p><p><span>梁惠王开门见山地直接问利，有什么利益我的方法？而孟子亦很直接，您何必去谈利，只要谈仁义就可以了，不需要去谈利的。为什么孟子要如此讲？我们再往下看。</span></p><p><span><strong>王曰：“何以利吾国？”大夫曰：“何以利吾家？”士庶人曰：“何以利吾身？”上下交征利，而国危矣。</strong>大王，如果您讲的是如何利吾国？如何对魏国有利？那么大夫就会讲，如何利吾家？因为每个大夫，有他自己的封地，那么他所想的都是，如何利自己的大夫之家，如何利自己的封地？如何让自己的利益变得更多？</span></p><p><span>士庶人，士是指的为政者，庶人是指的百姓，其他的官员和为政者，以及百姓，就会讲如何利吾身呢？怎样对自己有利？如此上下交征利，而国危矣，我们从上到下，都是在言利的，都想着利益，自己如此充满着欲望，国家岂不是很危险吗？</span></p><p><span>我们注意这里的上下，上行而下效，如果一个国家的君主，从上就开始想着，如何利益自己，大夫、士人、百姓都在想着如何对自己有利，如何满足自己的欲望，国家岂不是太危险了。</span></p><p><span>举两个生活当中的例子，看看是不是同样的道理，比如，我们在自己的家庭当中，如果父母想的都是自己，如何过得更舒服，如何可以满足自己的欲望，置儿女于不顾，如果儿女都是想着自己的欲望，不去管父母，夫妻之间也是如此，如果每个人想的都是利益自己，而不是利益对方和共同的家，夫妻的感情怎么可能变好呢？家庭危矣！</span></p><p><span>如果在一个企业当中，也是如此，企业的老板，如果想的都是利益，如果想的都是满足自己的欲望，那么他下面所有的领导层，都是一样的，进而到每一个员工到客户，大家想的都是自己的利益，那么企业不是危矣吗？</span></p><p><span>孟子这里讲的道理，是从长远来看的，我们自己是什么样子的，身边的人就会跟着变成什么样子，所以大王，您不能去讲利，您要去讲仁义的。</span></p><p><span>接下来，进而又开始说，<strong>万乘之国，弑其君者，必千乘之家。千乘之国，弑其君者，必百乘之家，万取千焉，千取百焉，不为不多矣；</strong>万乘之国，指的是有一万乘的国家，通常只有天子才能称为万乘之国，但是到了战国时期，已经开始大乱，并没有人遵从周天子，所以这里的万乘之国，到了春秋时期，已经变成七雄，齐 楚、燕、韩、赵、魏、秦，这七个国家都是拥有万乘的。</span></p><p><span>千乘之国是指的诸侯国，这里还有五个诸侯国，是可以达到千乘的，所以说万乘之国，弑其君者，必千乘之家。举了一个例子，一个万乘的大国，君主被臣下所弑，一定是身边的人；千乘之国，弑其君者，必百乘之家；同样的道理，说一个诸侯国，国君被臣下所弑，一定是他身边的大夫重臣。</span></p><p><span>万取千焉，千取百焉，不为不多矣，万乘之国有千乘之家，相当于取了十分之一，千乘之国对于大夫来讲，百乘之家也是取了十分之一，不为不多矣，已经拿了国家的十分之一，已经很多了。</span></p><p><span><strong>苟为后义而先利，不夺不饜。</strong>如果把义放在后，把利放在先，不夺是不会满足的，即使拥有一个国家的十分之一，如果利在先，义在后，一定还会继续争夺，这里讲了一个利的害处，如果一个国家，从上到下，看到的都是利，也就是自己的欲望，会不停地膨胀。</span></p><p><span>正所谓官至宰相望王侯，历史上这种事情很多，比如，一个人即使官位做到了宰相，他还要想着更进一步，因为当欲望在不停地膨胀，是没有办法停止的，所以在春秋和战国时期，也同样的道理，因为大家追求的都是利，都是为了满足自己的欲望，所以不停地弑君，甚至弑父，都是欲望在不停地膨胀所导致的。</span></p><p><span>还有很多大臣去弑君，同样是因为这个利和欲望在，这里孟子直接讲出了，问题的核心，如果从国君开始，就是讲利的，那么下面的大臣也是讲利的，最后他会弑其君夺其国，不夺不饜，不得到他是不会去满足的。</span></p><p><span>我们把这个道理延伸到生活当中，也是如此，如果在生活当中，我们不懂得停止自己的欲望，如果任欲望不停地膨胀，最后就会想争夺更多，永远没有满足之时，所以这里讲到看利的危害，讲看利的危害以后，既然孟子提出来的，是仁义而已矣。</span></p><p><span>那么接下来我们看看，孟子是如何讲仁义，为什么一定要讲仁义？</span></p><p><span><strong>未有仁而遗其亲者也，未有义而后其君者也。王亦曰：仁义而已矣，何必曰利？</strong>未有仁而遗其亲者也，如果一个人有了仁，他所追求的是仁，就不会遗弃自己的亲人，这里的亲人，当然首指父母，但是我们把亲再延伸出来，不只是在讲父母，比如父母，再比如亲人，再比如我们身边的人，一个人如果是讲仁的，就不会遗弃和伤害身边的人。</span></p><p><span>我们在刚才已经讲到了，孟子言说的利的害处，如果是讲利的，弑其君者，通常都是身边亲近之人。所以要讲仁，如果我们是讲仁的，身边的人是不会遗其亲者，这个时候自然就不会受到伤害，这里的仁义和利，形成了极大的反差。如果去讲利，就会导致自己和身边人的欲望，不停地膨胀，最后会导致弑君。</span></p><p><span>如果从君主开始，就是讲仁的，身边的人自然就会讲仁，不会做出遗弃亲人，和伤害身边人的举动，未有义，而后其君者也，如果一个人是讲义的，就不会把君主放在后，而是放在前，他是懂得尊重的。</span></p><p><span>我们把这个道理，延伸到生活当中也是一样的，如果我们身边的朋友是讲义气的，就会把朋友放在先，而不是放在后。如果我们自己的企业，是上仁下义的，处上位的人是讲仁，处下位的人自然就是讲义的，是不会把企业的事情放在后的，而是放在先。</span></p><p><span>所以一个人有义，是非常重要的事情，同样如果一个人，看中的是利，那么自己做事情，一定是私欲在前，而公事在后。孟子做了一个总结，先讲仁义，就不会遗其亲后其君，如果我们去讲利，就一定会遗其亲后其君，最后伤害的还是自己。</span></p><p><span>王亦曰仁义而已矣，何必曰利？所以说大王，您只要去讲仁义就可以了，又何必讲利。</span></p><p><span>我们这里要做一个总结了，这里出现了义利之辨，也就是仁义和利之间的辩论。这里要深入的去思考，为什么孟子要把梁惠王这一段的对话，放在孟子的开篇？我们想一想，只有梁惠王会开口问利吗？是不是从古到今，绝大多数人开口言的都是利呢？</span></p><p><span>比如，梁惠王讲何以利吾国，一个大夫讲何以利吾家，我们一个普通人讲何以利吾身，我们现在依然如此，开口在讲什么，我们遇到了一位智者，通常会问智者什么问题？我们怎样才可以赚到更多的钱？我们如何才能找到一段感情？我怎样才可以创业成功？我如何才能升职？我怎样才能获得更好的人际关系？我如何才能让孩子学习变得更好，考上一个好的大学？</span></p><p><span>到如今我们依然如此，开口就在言利，都在想着如何求得一个结果，如何可以让我们自己的欲望，得到满足，所以开篇就讲出来，一个非常重要的课题，并且千百年来依然如此，我们开口都在言利。所以孟子在开篇，就要给我们讲这样一种思想，何必言利，仁义而已矣。</span></p><p><span>一个人开始从思维上扭转，每问的一件事情，都是关于仁义的，比如什么叫仁？懂得为他人着想，帮助更多的人，我们称之为仁。有了仁才有了义，义是做合时宜的事情，义者宜也，如果有了仁心，有了仁的思维，才可能做出合时宜的事情，如果都是利益的思维，那么做的所有事情，都是在满足自己的利益和欲望。</span></p><p><span>所以我们开始懂得仁义而已矣，就会转换我们过去的思维方式。举个例子，我们再去思考和问问题，我们如何才能对这个社会，有更大的价值呢？我在一个企业当中，还能做些什么贡献？我能为我的父母做一点什么？我怎么才能给孩子更好的教育？我对朋友还能付出什么呢？我对自己的客户，可以提供什么样的价值和帮助？这是仁义的思维。</span></p><p><span>再来看仁义和利之间的关系，如果在求利，这是非常危险的事情，会导致我们的欲望不停地膨胀，无法满足，并且会让身边的人，也产生极大的欲望，最后危害自己的家庭工作，乃至自己的一生。可是当我们思维当中，在想仁义这件事情的，想的都是如何帮助他人利益他人，当我们在帮助他人之时，利是自己获得的，这个才叫大利。</span></p><p><span>可是我们这里要注意，千万不要为了利而行，仁义那是假象，我们终将得不到利，当我们思考仁义那个利，是自己获得的结果，并不是我们追求而来的。比如，我们现在正在学习的《孟子》，孟子这一生都在讲仁义，开篇就讲仁义，从来没有讲利，更没有追利，但是如今却得了大利，我们称之为亚圣，称之为圣人。</span></p><p><span>我们再讲到生活当中的一件小事情，亦是如此。比如，我们开一个店铺，做生意，我们不用想着利如何，我们才能赚得更多，我们去想仁义就好了，我怎么才能给客户提供更有价值的商品？如何才能让顾客在我这里得到满意？我怎样可以帮助他更多？</span></p><p><span>当我们帮助到别人更多，利他是自己而来的。所以孟子开篇的义利之辩，就给我们一生定下了一个标准和准则，而这个准则，如果我们真正懂得去践行，会给我们一生带来大利。所以利并不是求来的，而是我们自己修仁义，自然而获得的结果。</span></p></div>"
},{
    "title": "《孟子》梁惠王上②-1 贤者之乐",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上②-1贤者之乐</strong></span></p><p><span><strong>孟子见梁惠王，王立于沼上，顾鸿雁麋鹿，曰：“贤者亦乐此乎？”</strong>这次依然是讲到，孟子见梁惠王。但是显然已经不是上一次的对话，第一次对话，孟子见梁惠王，梁惠王问孟子，何以利吾国？</span></p><p><span>这一次孟子再一次见到梁惠王，王立于沼上，这个沼以前是指的水池，我们后来称之为沼泽或者湿地，也可以把它认为是我们现在的人工湖。所以我们可以看到，王立于水池，或者叫池塘边，在这样一种场景下，见了孟子，相当于是在招待孟子。</span></p><p><span>我们可以看孟子和梁惠王之间，经历了义利之辨，开始变得更加互相的熟悉，所以在这样一种场景下，我们看看梁惠王会问孟子什么问题？</span></p><p><span>一边问问题的同时，这里还有一个场景需要注意，顾鸿雁麋鹿，鸿雁指的是雁的一种，麋鹿指的是鹿的一种。顾是看的意思，但是顾和看不相同，顾是左右的看，也就是形容这片水池是很大的，所以一边顾麋鹿鸿雁，一边问孟子，贤者亦乐此乎？贤德的人，也有这样的快乐吗，会不会也是以此为乐？</span></p><p><span>孟子听到了这段话，自然是有自己的见解要去讲的，但我们明白一个道理，孟子想跟梁惠王讲一件事情，绝对不会为了讲乐，更不会为了讲看鸿雁以及麋鹿，一定是他要讲背后一个深刻的道理，就像第一句，我们所学习的梁惠王，问何以利吾国，而孟子讲仁义。只有仁义才能得到大利，如果是求利，最后一定是得不到利的。</span></p><p><span>我们看看孟子对于快乐，对于贤者，是否享受这样的乐趣，是持什么样的观点？</span></p><p><span><strong>孟子对曰：“贤者而后乐此；不贤者虽有此，不乐也。”</strong>孟子讲了，贤者当然可以享受这种快乐，但是他是后乐于此，也就是先成为一个贤者，先成为一个贤德的人，才能真正的享受这种快乐。不贤者虽有此不乐也，如果不是一个贤德的人，即使有这些也不会快乐，这个此指的是池塘，鸿雁，麋鹿以及当下所拥有的一切，如果我们不是一个贤德的人，即使拥有当下这一切，我们也是不会快乐的。</span></p><p><span>这是孟子提出来的论点，也就是只有真正的贤者，才会快乐，如果不是一个真正的贤者，即使我们有鸿雁麋鹿，拥有当下所拥有的一切，即使是王位，我们也不乐也，并不会真正的快乐。</span></p><p><span>接下来，孟子开始论述自己的观点，为何要这样讲？它的道理和意义到底在什么地方？接下来开始引用《诗经》，《诗经》的这一篇出自于大雅，叫灵台，灵台是写周文王的，周文王在商末那个时期，已经拥有了天下三分之二的土地，是因为自己有德行，所以百姓愿意跟随文王，虽然还是臣，那个时候还是商纣王，但是拥有的土地和人民，已经比商朝更多。</span></p><p><span>当拥有了这么多人民和土地以后，就需要迁都，因为原来的都城，是没有办法承载和容纳的，既然是迁都，就要涉及到建设建造，建立了灵台、灵囿、灵沼，灵台就是一个台子，但是百姓称之为灵台，这个台是举办一些，比如说祭祀活动，比如说观天象，灵囿是指的园林，灵沼就是梁惠王这里所讲的沼，水池，水池是可以有一些麋鹿和鸿雁等等，文王所建的台、囿和沼，被百姓称之为灵台。</span></p><p><span>我们这里就要思考一个问题，为什么文王所要建设的台、囿、以及沼，百姓会称之为灵台呢？用了灵字，说明大家是喜欢的，认为它是一个神圣的地方，百姓是非常愿意去做这些事情的。</span></p><p><span>第一句讲了义利之辩，我们讲了仁义的重要性，只有一个人拥有了仁义，才能获得大利，如果是求利的，最后一定是自我损伤，什么时候才能验证一个人是否有仁义呢？就是当我们遇到事情之时，比如说《诗经》，这篇灵台讲的就是这个道理。</span></p><p><span>当文王需要迁都，需要建台，需要建囿，需要建沼，百姓自发的自愿的去帮助文王去创建，并且称呼为灵台。我们在生活当中也是一样的，比如，我们经营一个企业，什么时候才能验证自己是否有仁义？就是在企业遇到危机之时，员工是否还愿意和我们一起去面对问题、面对困难？</span></p><p><span>朋友之间也是如此，当我们真正遇到困难之时，才是验证我们是否有仁义之时，如果我们遇到困难，遇到困境，身边的朋友还愿意鼎力相助，愿意真心的去帮助我们，说明平时是有仁义的，我们在家庭当中亦是如此，我们真正面对了低谷，面对了生活的不如意，还能愿意留在我们身边，说明我们平时是仁义的。</span></p><p><span>再回到春秋那个时候，如果一个君主，在国家遭受危难之时，百姓的心和他在一起，说明他真的是仁义的，所以平时我们就要懂得仁义为本，去对待他人，当有事情来临之时，别人才会真的愿意帮助，这才是大利。</span></p><p><span>接下来我们看看文王，在建造灵台之时，是什么样的一种场景？</span></p><p><span><strong>《诗》云：经始灵台，经之、营之。庶民攻之，不日成之。</strong>经始灵台，始是开始，灵台指的是建造的台子，经是指的筹划，比如说去筹划，去计划建造一个灵台。经之，营之，经就是筹划的过程，营之就是建造的过程，庶民攻之，不日成之，庶民是指的百姓，攻之指的是完成和攻克，不日成之很快就建成了。</span></p><p><span><strong>经始勿亟，庶民子来。</strong>这里的亟通着急的急，想要建设灵台，只要开始筹划就可以了，自己是不需要着急的，庶民子来，其他的百姓就像自己的孩子，自己的儿子一样，自己就会来帮助。</span></p><p><span>我们再看这句话，很有深意，文王想要建灵台、灵囿、灵沼，不需要自己去着急，也无需自己去动手去做，只要开始筹划，想要去做这件事情，百姓都像孩子一样，自然会来帮忙，不日成之，很快就可以完成的。</span></p><p><span>我们从这里可以看到，文王之德，因为他平时就是讲仁义的，平时就是有德行的，所以他只要想建造一个台子，百姓自发的就会组织，帮助他一起完成，这就是孔孟所讲到，仁义和德行的重要性。</span></p><p><span>想一想，我们在生活当中是不是如此？我们在生活当中，一个有德行的人，当他想要去做一件事情，根本不需要自己去完成，只要他有一个想法，开始筹划一件事情，自然有无数的人出现来帮助去做，这才是真正的贤德之人，才是讲仁义之道的关键之所在。</span></p><p><span><strong>王在灵囿，麀鹿攸伏。麀鹿濯濯，白鸟鹤鹤。</strong>王指的是周文王，王在灵囿，王在园林之时，麀鹿攸伏，麀鹿指的是母鹿，攸伏，伏是伏在地上。我们注意这个攸，攸是闲适之意。当文王在灵囿之时，母鹿都是悠闲的悠然的，闲适的伏在那里。麀鹿濯濯，濯濯指的是肥润并且有光泽。白鸟鹤鹤，鹤是指的干净整洁的样子</span><span>。</span></p><p><span>我们再来回顾这个画面，呈现的是一片祥和的景象。当文王在灵囿之时，这里麀鹿是闲适的，悠然自在的伏在地上，并且他的身体是肥润并且有光泽，百鸟都是整洁的、干净的样子，一片祥和的景象。</span></p><p><span>所以一个人，当我们足够的有德行，有仁义，整个散发出来的都是祥和之气，围绕在身边的人，哪怕是灵囿里的动物，都是呈现一片祥和的景色。但是如果一个君王是暴躁的，围绕在身边的人，哪怕是看到这些麀鹿以及白鸟，它都是慌乱的状态，所以我们可以看到文王的德行，也可以看到一片祥和的景象。</span></p><p><span><strong>王在灵沼，于牣鱼跃。</strong>文王在灵沼之时，于是叹词赞美，牣是满池，鱼跃是鱼儿都争相跳跃。又描述了一个场景，文王在灵沼之时，赞叹呐，满池的鱼儿争相跳跃，又呈现了一个画面，生机勃勃。</span></p><p><span>我们整个看《诗经》的这一段，文王是有德行的，讲仁义的，所以在他需要之时，庶民子来，自然会来帮助文王建设灵台、灵囿、灵沼，这是讲德行。接下来讲，文王在灵囿之时，呈现出来了祥和，唯美的画面，麀鹿攸伏，白鸟鹤鹤，文王在灵沼之时，又呈现出来生机勃勃的景象，鱼儿争相的跳跃。</span></p><p><span>我们看到一个人有德行以后，在我们需要之时，就会有更多的人，愿意来帮助，当一个人有德行之后，呈现出来的是祥和的景象，并且还有生机勃勃的景象。</span></p><p><span>接下来孟子开始做总结，对于《诗经》灵台，也是对于文王，这件事情的总结。</span></p><p><span><strong>文王以民力为台、为沼，而民欢乐之，</strong>文王是以百姓之力，创建了灵台灵沼，但是百姓是非常开心的，并且非常愿意帮助文王去做这些事情，且以此为乐，想一想我们在生活当中，是不是这样的，我们身边有德行的人，或者讲仁义的人，如果对方能需要，我们去帮助他做一点事情，我们也会觉得无比的自豪和无比的快乐。</span></p><p><span><strong>谓其台曰灵台，谓其沼曰灵沼，乐其有麋鹿鱼鳖，</strong>因为百姓是开心的快乐的，并且对文王怀着无比尊敬的心情，所以文王建的台，百姓谓之灵台，建的沼谓之灵沼，而且非常开心，文王可以拥有麋鹿鱼鳖。</span></p><p><span><strong>古之人与民偕乐，故能乐也。</strong>说古代的人，也就指的古之圣贤之人，是与民偕乐的，也就是与民同乐，为何会与民同乐呢？比如说文王所建的灵台，灵沼和灵囿，百姓是可以一起观看的，所以这就叫与民同乐。故能乐也，因为他跟百姓是共享的，所以这才是真正的贤者，才能与民同乐，才真正的会得到快乐。</span></p><p><span>接下来孟子，又举了一个相反的例子，相反的例子讲的是夏桀。因为夏桀是荒淫无道的，所以百姓民不聊生，我们看看描写夏桀的这一段，是怎么讲的？这一段誓词出自于《尚书》，是在商汤伐桀之时，所写的誓词。</span></p><p><span><strong>《汤誓》曰：时日害丧，予及女皆亡！</strong>夏桀把自己比作太阳，把百姓比作月亮，所以夏桀对百姓讲，我是太阳，你们都是月亮，我的光芒是不会灭的，你们的月亮，只能靠着我的光芒，才能得以生存。故而有百姓就说到，时日害丧。</span></p><p><span>太阳什么时候能灭亡，予及女皆亡，我宁愿和你一起去死亡，同归于尽。月亮没有了太阳的光芒，是没有办法存活的。从这句话我们就可以看到，百姓对夏桀的痛恨，宁愿自己不能生存，也想要和他同归于尽。</span></p><p><span><strong>民欲与之皆亡，虽有台池鸟兽，岂能独乐哉？</strong>孟子做了一个总结，如果民都想要与他一起灭亡，虽然他有台池，有鸟兽，岂能独乐哉？他又怎么会得到快乐呢？</span></p><p><span>我们再去看夏桀，因为他是无道的，他只顾自己的享乐，所以百姓痛恨到想与他一起灭亡，即使他有这些台池、鸟兽，拥有整个天下又如何呢？他又岂能独自的享乐。</span></p><p><span>整个这段话引用了《诗经》，以及《尚书》里面的誓词，做了一个对比，一个是文王，他是有德行的、讲仁义的，可以与民同乐，所以这个时候，他才能真正的得到快乐。</span></p><p><span>又举个例子说夏桀，他是只顾自己享乐的，甚至把自己比作太阳，但是百姓想要与他同归于尽，最后夏朝灭亡，被商汤所替代。这里我们就可以看到，即使他拥有很多，甚至拥有天下，如果是没有仁义的，不是贤德之人，也不会真正的感到快乐。</span></p><p><span>我们再回到这句话的主题，梁惠王问孟子，贤者亦有此乐乎？孟子讲只有真正的贤者，才能得到快乐，如果不贤之人，即使得到了这一切，也不会真正的快乐，由此我们就要延伸一个话题了，一个人到底如何，才能真正的快乐呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王上②-2 快乐之方",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上②-2 快乐之方</strong></span></p><p><span>人的一生，到底该如何才能快乐？我们分四个阶段来讲，先看原文当中的，孟子与梁惠王之间的对话，梁惠王认为有麋鹿鸿雁，拥有很多东西就会快乐，所以问孟子，贤者亦乐此乎？贤者也会有这样的快乐吗？孟子讲贤者而后乐此，一个贤者，要把快乐放在后面，快乐也只会在后面，为什么会这样讲呢？</span></p><p><span>一个贤者，是把自己该做的事情，自己的责任和义务，做好之时，无所亏欠，才可能得到快乐。所以我们从这里开始延伸，我们生而为人，就要有很多的社会关系，比如，我们有父母，比如有孩子，有朋友，有爱人，有同事等等，如果一个人没有做好自己本职的工作，是有所亏欠的，怎么可能快乐呢？</span></p><p><span>我们举个例子，比如说做天下的君主，如果没有让百姓安居乐业，怎么会快乐呢？此时在这里看着鸿雁麋鹿，可是离开这里之时，就会有很多烦扰。如果事情来到，比如说民怨四起，比如说战争频发，又如何才能安心的得到快乐？</span></p><p><span>我们在讲生活当中也是一样的，比如说一个人如果没有让自己的父母，老有所养，当别人提及父母之时，又如何去快乐呢？比如说我们的孩子，没有给他一些教育，和生活上的帮助，当提及孩子之时，心里是有所亏欠的，要如何去快乐呢？</span></p><p><span>再比如说，我们在参加工作之时，如果我们每天的工作并没有做好，要如何才能快乐呢？领导问起工作之时，我们要如何交代，同事问我们做的如何、做的怎么样了？要如何交代？</span></p><p><span>再比如说一个孩子，说一个上学期间的孩子作业，就是自己的本职工作，作业没有完成，当父母问及当老师，要检查作业，我们如何才能快乐呢？所以生而为人的第一点快乐，很简单，我们要先做好自己的本职工作，尽好自己的责任和义务，让自己的内心是无所亏欠的，我们才可能踏实和快乐。</span></p><p><span>比如说，我们对于感情上无所亏欠，对于感情这方面就是快乐的，我们对于父母、子女无所亏欠，在这方面就是快乐的；我们对法律层面无所亏欠，没有触犯法律，在这方面，就是踏实和快乐的；我们在道德上无所亏欠，在提及道德之时，我们就是快乐的。</span></p><p><span>所以生而为人，我们要去处理各种关系，要生活在这个世界上，要参加工作，那么我们就要尽好自己本职工作，尽好自己的责任和义务，让自己无所亏欠。如此就可以快乐，那么由此再来延伸第二点，无论我们做到什么样子，都不可能把一件事情做得完美，不能做得圆满，为何呢？因为人的欲望会不停地滋长。</span></p><p><span>举个例子，当我们拥有了一，就想要有二，有了二，我们就想要有三。我们用个具体的例子，比如说对孩子，我们要完成对孩子的教育，但是在教育的过程当中，就会有更多的欲望，想让孩子变得更好，想要给他更多，这个时候我们的欲望，就会不停地去膨胀。</span></p><p><span>再比如说工作也是一样的，我们说做好自己本职工作，无所亏欠，就是快乐的，但是做着做着，我们的欲望开始滋生，我们想要赚的更多，我们想要坐在更高的位置，我们想要得到领导和同事更多的认可，这个时候就因为欲望，而让自己不再快乐。</span></p><p><span>比如生活当中也是一样的，说努力赚钱，买个车子，买个房子，当我们有了这些之后，本应该是快乐的，但是欲望会不停地滋生，会让我们换更好的车子，想要更大的房子，反而又疲于奔命，就不会去快乐。</span></p><p><span>在这个基础之上，我们要懂得第二点的快乐，叫知足之足，常足矣。当我们在按照自己的义务生活的同时，我们就要学会知足常乐，有一个好的心态，只要孩子的教育没有问题，只要我们可以赡养父母，可以去好好的工作，可以让当下的人际关系，处在一个和谐的状态，这个时候就需要调节自己的心态，不要让自己的欲望一直去膨胀，要学会知足，才能常乐。</span></p><p><span>但是它是按照次第而来的，首先我们要去完成自己的本职工作，无所亏欠，在这个基础之上，不要让欲望不停地滋生，我们要学会调整自己的心态，知足常乐。</span></p><p><span>我们进而再延伸第三点，只有一个仁字，才能让我们得到更多的快乐，何为仁呢？简单来讲是付出和帮助他人。《论语》讲，不仁者，不可以长处乐。也就是只有仁者，才能长久地处在快乐上。</span></p><p><span>举个简单的例子，比如说在生活当中，当我们今天在工作上，帮助了一位同事，或者帮助了一个客户，当晚上回到家之时，再去想一想，我们的心里是不是快乐的，是不是开心的？</span></p><p><span>比如说，我们今天在下班回家的路上，碰到了一个人，他并不识得这里的道路，而我们把正确的道路告诉给他，当我们回想起来的时候，是不是有成就感的，是不是快乐的，所以其实人的快乐，非常简单，就是一个仁字，当懂得去付出，当懂得去帮助他人，才会体会到这种快乐。</span></p><p><span>由此我们再讲第四种快乐，这个也是最难达到的，但是我们要尝试着去理解，一个人只有一无所取的时候，才是最高的快乐。我们去体会这个道理，为什么一无所取，才会快乐呢？我们先讲取，注意这里的取不是索取，什么叫索取？说我不停地想要，而取是明明做了很多事情，却可以一无所取，这是至高的快乐。</span></p><p><span>我们先来举例子，比如我们从《论语》到《孟子》，所学习过的尧、舜、禹、孔子、颜回、孟子，这都是一无所取的人，所以只有这样的人，才会得到这世间最高的快乐。</span></p><p><span>比如说尧、舜、禹，并不想拥有整个天下，而是天命传到了那里，不得不为，但是即使在为也，是没有索取的，我们去讲孔夫子、孟子也是一样的，做了那么多事情，做着文化的传承，推行着周礼，推行着仁德之道，但是却没有从中有所取，所以这个时候有了孔颜之乐，粗茶淡饭，曲肱而枕之，居陋巷，乐在其中矣。</span></p><p><span>甚至可以乐以忘忧，废寝忘食，不知老之将至云尔，不知道自己的年龄，已经变得很大了。快乐到什么程度，忘记了自己还有忧愁的事情，我们从这里就要思考了，为什么无所取才会快乐呢？我们去试想一下，我们当下的烦恼从哪里来呢？只要我们有所取，必将给自己带来烦恼和痛苦。</span></p><p><span>比如说我们生了一个孩子，会不会给我们带来很多的烦恼和痛苦，因为我们取了这个孩子。再比如说我们去参加一个工作，因为我们取了工资，就会有很多迫不得已的行为要去做。比如说我们开门做生意，想要赚更多的钱，即使今天不想去开门，想休息一天，我们做不到的，因为我们觉得休息一天，会有损失，会流失顾客，所以但凡我们有所取，就会带来相应的痛苦。</span></p><p><span>比如说两个人谈恋爱，是不是如此？我们只要想取得对方的关心，同样就要承担，更多的责任和义务，就有更多不得已的事情。再比如说我跟客户合作的过程当中，需要赚取他的利润，这个时候就会有很多，迫不得已的事情要去做，所以我们去思考，自己生活当中，所有的事情皆如此，但凡我们有想要所取的地方，就会给我们带来相应的烦恼和痛苦。</span></p><p><span>所以我们讲这个世界上，最高级的快乐是，一无所取，一无所有，当我们什么都不取，当我们什么都不有的时候，才会真正的快乐，没有任何一件事情，可以限制我们，没有任何一个人、事、物，可以束缚于我们，我们是自由和自在的，但是这种境界很难达到，我们无论理解到什么程度，都是可以的。</span></p><p><span>这个时候我们回想，在刚才这一讲课程当中，似乎是有很矛盾的地方，我们说要无所亏欠，后来又讲到最高的快乐，却是一无所有，一无所取，并不是矛盾，是境界的问题。所以我们先讲第一点，快乐就是无所亏欠，去完成自己所要完成的事情，无论是对于感情，对于家庭，对于事业，对于工作，对于朋友，对于法律，对于道德，我们都是无所亏欠的。</span></p><p><span>在这个基础之上，我们到了第二点的快乐，叫知足常乐，要学会调整自己的心态。那再延伸到第三点快乐，只有仁者才可以常处乐，因为不停地去帮助他人，不停地去付出，内在才会有持续的这种快乐。</span></p><p><span>进而我们又要延伸到了第四点，因为我们作为一个仁者，不停地去付出和帮助他人，就一定会获得，因为我们的德行，会给自己匹配很多和我们相应的东西，相应的事情发生在自己身上，这个时候如果还是一无所取的，才能得到这个世间上最大的快乐，也就是我们讲的，尧、舜、禹、孔子、颜回、孟子这些人所得到的，人世间至高的快乐。</span></p><p><span>所以我们自己去对应，我们看看自己当下的修为和德行，我们当下的生活，处在哪一个阶段，我们去对照，相应的如果我们连自己的本职工作，还没有做好，连自己最基本的义务和责任，还没有去做好，我们就要做到无所亏欠，这是我们当下的坦然和快乐。</span></p><p><span>如果我们自己的本职工作，做得很好，我们要学会减少自己的欲望，知足常乐，调整我们的心态，这是我们当下可以获得的快乐，如果我们当下既完成了本职工作，责任和义务，同时又懂得知足常乐，我们就要再去修仁，只有仁者才可以长处乐，我们去帮助，我们去付出，可以让更多的人因此而受益，可以因为有我的存在，让更多人变得不同，当有了仁以后，也就是我们有了德行，有了仁德，我们就会拥有很多。</span></p><p><span>当拥有了很多，我们到了最后一个境界，也就是一无所取的境界，我们不执着于任何事情，这个时候，我们才能得到至高的快乐，所以无论我们在哪一个阶段，我们去相对应的去修身，去让自己得更多的快乐，就可以了。</span></p></div>"
},{
    "title": "《孟子》梁惠王上③-1 五十步笑百步",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上③-1五十步笑百步</strong></span></p><p><span><strong>梁惠王曰：“寡人之于国也，尽心焉耳矣！”</strong>寡指的是自称，寡德之人。以前人讲，高以下为基，越是处在上位的人，越会用这种谦词。处下说，寡人孤，都是皇帝和君王，对自己的称呼。</span></p><p><span>寡人之于国也，说我对于治理国家这件事情，尽心焉耳矣。耳矣是语气助词，加重的意思，说我真的是尽心尽力了。我们接下来看一看，梁惠王所讲的，尽心到底尽在了什么地方？</span></p><p><span><strong>河内凶，则移其民于河东，移其粟于河内，河东凶，亦然。</strong>梁惠王讲，我是非常用心治理国家的，可谓是全心全力了，当河内凶，也就是灾年，或者是战乱，灾年和战乱发生之时，百姓是流离失所的，并且没有饭吃。</span></p><p><span>这个时候会把河内的百姓，移到河东去。这里的河指的是黄河，并且把河东的粮食移到河内。河东凶，亦然，如果河东发生了荒年，百姓吃不上饭的时候，同样也是这样做的。在梁惠王看来，自己对于百姓，可谓是尽心尽力了。</span></p><p><span><strong>察邻国之政，无如寡人之用心者，邻国之民不加少，寡人之民不加多，何也？</strong>这里梁惠王，自己做了一个对比，说我去考察邻国的政事，没有像我这样用心的，可是邻国的百姓，并没有减少，而我这里的百姓，也并没有增加，何也？这是为什么呢？</span></p><p><span>我们去思考，看看梁惠王这番话，所讲的是否有道理，他的思维方式是否是正确的？很多时候跟我们的想法，是不是相同的？比如说我工作尽心尽力，为什么我的工资不见增加呢？为什么老板还不重视我？</span></p><p><span>我对于孩子的教育，可谓是尽心尽力，每天都陪着他写作业，给他吃得好穿得好，我给他找了很多的补习班，为什么孩子的学习还不见好？我对我的家庭，可谓是尽心尽力，我把最好的东西都给了对方，我每天都很付出，很用心的去对待他，为什么我的家庭还是不和睦？为什么对方还会离开我们？</span></p><p><span>我们这样一对应，会发现梁惠王的思维，和我们当下很多时候的思维是一样的，所以这是我们学习孟子，非常重要的原因之一，我们大多数时候的思维方式，都是错误的，但是我们并不知道，自己的思维是错误的，所以就会怨天尤人，正如文中的梁惠王，认为自己非常的用心，可是却并没有什么样的改善，原因到底在哪里？我们看孟子是如何对答的。</span></p><p><span><strong>孟子对曰：“王好战，请以战喻。”</strong>这句话讲得非常之高明，我们看第一个高明的地方，王好战，这三个字，已经讲出，梁惠王的问题之所在，但是讲的不露痕迹，为什么国家的子民不见多？</span></p><p><span>因为大王您好战，当您好战之时，又有什么样的百姓，愿意来到这样的国家，百姓生活图的是一个安稳，一个踏实，可是您是好战之人，好战就要耗费民力，耗费财力，并且大军之后必有凶年。一个好战之人，别人怎么会愿意，来到您的国家。</span></p><p><span>我们再看第二个高明之处，这是讲话的技巧，对方喜好什么，我们就拿什么事情去做比喻，这个时候对方才有兴趣听下去。比如说梁惠王好战，就拿战争这件事情和他做比喻。</span></p><p><span>我们看看生活当中，亦是如此，当我们和一个人在交流之时，要拿他感兴趣的事情去做比方，他才有兴趣去听。我们举例子，说一个人爱好书法，我们想跟他讲清楚一个道理，就拿书法去做比喻，他会有很好的共鸣。</span></p><p><span>再比如说，一个人对于感情，这件事情很重视，我们就拿感情的事情去做比喻，一个人他只想赚钱，对于赚钱这件事情感兴趣，就拿赚钱这件事情去做比方，这个时候他有共鸣，并且愿意听下去。</span><span>所以生活当中，我们一定要学会讲话的，这种智慧和小的技巧，找对方感兴趣的事情，对方喜好的事情，以这个为切入点。</span></p><p><span><strong>填然鼓之，兵刃既接，弃甲曳兵而走，</strong>填然鼓之，鼓是指的击鼓，古代击鼓是进攻的意思，鸣锣是收兵的意思，填然是拟声词，形容的是咚咚的响声。所以填然鼓之指的是，战鼓的咚咚之声响起，兵刃相接，已经两军开始交战。</span></p><p><span>弃甲曳兵而走，弃甲指的是丢盔弃甲，弃甲可能是被别人打掉了装备头盔，也可能自己在逃跑的过程当中，减轻负重，慌乱之中而扔掉。曳兵而走，曳是拖着，兵是兵器，走是逃跑。我们再来看这句话，当战鼓咚咚作响，两军开始交战，丢盔弃甲，拖着兵器而逃跑。</span></p><p><span><strong>或百步而后止，或五十步而后止。以五十步笑百步，则何如？</strong>这里讲了两种人，有的人跑了一百步停止，有的人跑了五十步，而后停止。这里提出来一个问题给梁惠王，当两军交战之时，有的士兵跑了一百步，有的士兵跑了五十步，跑五十步的人，却笑一百步的人，您认为怎么样？</span></p><p><span><strong>曰：“不可，直不百步耳！是亦走也！”</strong>梁惠王说，不可以笑话一百步的人，他只不过是没有逃跑一百步，但是也是逃跑，所以跑五十步和跑一百步，从本质上是没有区别的，本质上都是逃跑而已。</span></p><p><span>孟子要问的正是这个答案，在暗指梁惠王，只不过以五十步笑百步而已，他和其他的国君，和邻国的政事，又有什么区别呢？我们看孟子是如何讲的。</span></p><p><span><strong>曰：“王如知此，则无望民之多于邻国也。”</strong>民之多于邻国也，如果大王您知道这个道理，就不要指望着，百姓可以多于邻国了，因为都是五十步笑百步而已。</span></p><p><span>我们再来回头看这一段话，到底给我们讲述了一个什么道理？首先讲本质的问题，本质都是逃跑，无论是跑五十步，还是一百步，其实并没有区别。所以既然没有区别，又凭什么指望百姓，要多于邻国呢？</span></p><p><span>我们这里可以反观来思考，如果我们作为一个百姓，想要去什么样的国家迁居呢，这个国家是否值得我们弃家舍业，到那里重新去安顿，如果不能比我现在的生活好上数倍，我为什么要去那个国家生活呢？</span></p><p><span>一个国家要想变得强大和兴盛，一定是其他国家的人民心向往之，国家繁荣稳定，我到那个国家的心里是踏实的，可以给我们足够的安全感，可以让我们衣食无忧，才可能去那个国家生活。</span></p><p><span>我们再看梁惠王，亦是如此，他也只是在荒年之时，百姓遇到灾难之时，送去了一些粮食，把百姓换一个地方去安顿而已。从本质上，并没有改变什么事情，依然是战乱的，依然是荒年，依然是流离失所的，所以本质并没有发生变化，如何让百姓变得更多？</span></p><p><span>我们再举几个例子，看看生活当中是不是如此，我们说对爱人付出了很多，认为把最好的都给了他，可是对方依然是不开心的，依然是不满足的，到底又做错了什么呢？我以为已经尽心尽力了，我们去看这件事情的本质又是什么呢，是否让他安心，对方是否喜欢我们呢，如果对方是不喜欢的，付出再多又有什么意义呢？如果我们不能给他安全感，对他再好又如何呢？</span></p><p><span>我们再来拿工作当中的事情，举例子也是一样，有的人说我兢兢业业的，在这个地方工作了很多年，可是对这个企业，真的忠诚不二吗？如果作为企业的领导，即使看到我们有一些能力，可是我们不够忠诚，让他的内心并不踏实，这个时候，又如何给我们更多的重担呢？我们要如何走到这个企业的核心去呢？</span></p><p><span>所以我们去读历史，自古以来都讲，得民心者得天下，那如何才能得民心呢？百姓是安居乐业的，他的心里是踏实的，是安稳的，这时才会拥护。所以我们在生活当中，要学会去修己，要修自己的德行，以给人安全感，要修自己的忠信，以让他人变得踏实，当别人的心安踏实之时，他才会选择跟我们去交往。</span></p><p><span>我们从这里再往前延伸，为什么百姓不加多？本质错了。到底错在哪里呢？我们看刚才已经指出三个字，王好战。我们经常讲喜好和喜爱，也就是我们好什么，或者爱什么，就会导致行为和思维，都会跟着我们的喜好发生变化。</span></p><p><span>比如说梁惠王他好战，这个时候，他的思维和行为导向都是战争。为什么想让百姓变多？是因为好战需要人，要不然需要参军，要不然需要耕种，而创造更多的财富。所以他想要百姓变多的核心目的，还是为了战啊。</span></p><p><span>这个时候，难道其他的百姓感受不到吗？难道其他人看不出来吗？如果其他人知道了，他又怎么想要来到这个国家呢？我们举生活当中的例子，也是一样，当我们爱什么，我们喜好什么，我们的行为就会出现偏差，并且其他人是看得清楚的。</span></p><p><span>我们做生意，如果是好财的好利的，难道其他人看不到吗？一旦我们好财好利，从本质上就错了。《孟子》开篇梁惠王就在讲利，何以利吾国？孟子讲：何必曰利，仁义而已矣。当不再去谈利，去想着如何仁爱百姓，如何做更合适的事情，才能从本质上去解决这些问题。</span></p><p><span>所以孟子跟我们讲的思维，真的需要我们深入的去体会，他讲的实在是正确之极，可是由于我们思维是错误的，从本质上就发生了错误。比如说做生意是好利的，想要赚更多的利润，就会无故的加价，会想着从各个地方，节省费用，会想着，怎么让员工付出的更多，而赚的更少。越是这样做，我们的员工和消费者，离开的就会越快。正所谓，欲速则不达。</span></p><p><span>我们再举感情的例子，也是一样，当我们为对方付出和好的时候，想要的是回报，想要的是回馈，想要的是他和我们在一起，越是着急要回报，我们的思维和行为，都会出现偏差，最后的结果，我们就越是得不到。</span></p><p><span>所以我们去想一想，生活当中，很多事情都是如此。因为我们从思维的根本，本质上就已经发生了错误，所以要改变的是本质的问题，是我们到底好什么，如果我们好战，百姓就不可能变多，如果我们好利，最后的结果得不到利，如果我们做一件事情，想要的是回报，最后我们就得不到回报。</span></p><p><span>我们这里还要再延伸一点，一旦我们的行为，出现了错误的时候，我们该如何去修正和调整呢？这是我们另外一个值得思考的问题，我们去看梁惠王是如何思考的？总结四个字叫怨天尤人，认为自己已经尽心尽力，做了很多，可是并没有改变当下的现状，正像生活当中的我们。</span></p><p><span>认为对孩子付出了很多，可是孩子并不感恩，我们对他的学习付出了很多，他的学习成绩并不好啊，我们对爱人付出了很多，最后他还是离开了，我对工作付出了很多，老板依然不重视，我努力的做生意，也没有赚到钱。</span></p><p><span>我们这些思维，都是怨天尤人的，怪孩子不懂感恩，我们怪别人忘恩负义，我们怪老板不识才，我们怪客户难伺候，当不能怪罪他人之时，我们就怨天了，我们抱怨天道，对我不公，我们抱怨这个时代不好，我们抱怨那个时期的战乱。</span></p><p><span>我们看看还有另外一种思维，就叫修己的思维，当一件事情的结果产生之时，我们有没有思考，自己到底哪里出了问题？比如说，我们从梁惠王开始举例子，有没有想到，我哪里做的是不足的，才导致国家的百姓，并没有变多？我在这个基础之上，还能去做些什么？</span></p><p><span>一旦我们的努力，方向发生了错误，只会南辕北辙。比如说，我们跟爱人相处也是如此，现在我们的感情并不好，有没有思考过，我们的付出真的是他需要的吗？我们要如何去改变自己的当下，才可能让他和我之间变得更好，变得更和谐？</span></p><p><span>比如说对孩子也是如此，我认为我付出了很多，可是我的方法真的得当吗？我真的有通过提升自己，让孩子对学习更有兴趣吗？我们工作当中是不是也如此，我们觉得我们兢兢业业的在工作，可是我们去想一想，做的事情真的有价值吗？</span></p><p><span>我们做的事情真的有效率吗？我们做的事情真的是当下企业所需要的吗？当我们这样去思考问题，我们才会不停地去提升，自己做合时宜的事情，如果我们不懂得去改变自己，不懂得去提升自己，而是怨天尤人的想法，这个想法本来又是错误的。</span></p><p><span>我们的出发点一旦有问题，导致结果就是有问题的，有了问题以后，如果我们再去思考的时候，不懂得从提升自己，反观自省的角度去思考问题，接下来做出的行为又是错误的，所以我们要学习孟子。</span></p><p><span>在整个《孟子》一书当中，孟子和别人之间的对话，都是直指核心，直指他内心和本质上的错误，都是在告诉我们思维方式，本来就错了。我们现在再来回顾，我们所讲的一共三条，第一条，梁惠王开篇就问利，想一想我们有多少人都是开口必言利，而孟子告诉我们，错了，仁义而已矣。</span></p><p><span>我们再看第二条，又讲到梁惠王顾麋鹿鸿雁，这个时候问孟子，贤者亦乐此乎？贤者也有这样享受的快乐吗？孟子又说了，只有贤者，才会真正的得到快乐。如果不懂得去做一个贤者，即使拥有一切，乃至拥有整个天下，也不会得到真正的快乐。所以告诉我们，贤者才是快乐的，否则得不到快乐。</span></p><p><span>到了第三条，梁惠王又开始认为，自己尽心尽力的治理国家，可是孟子告诉梁惠王，也只不过是，以五十步笑百步而已，因为从本质上就错误了，所以我们去学习《孟子》，是从根本上解决我们思维的问题，解决我们那些不正确的，看待问题的角度。</span></p></div>"
},{
    "title": "《孟子》梁惠王上③-2 王道之始",
    "author": "虚空先生",
    "date": "2022-08-08",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上③-2 王道之始</strong></span></p><p><span><strong>“不违农时，谷不可胜食也；数罟不入污池，鱼鳖不可胜食也；斧斤以时入山林，材木不可胜用也。谷与鱼鳖不可胜食，材木不可胜用，是使民养生丧死无憾也。养生丧死无憾，王道之始也。”</strong></span></p><p><span>我们上一集讲到梁惠王，认为自己治国已经尽心尽力，孟子说到，五十步笑百步，因为从根本的性质上、本质上就错误了。我们这一讲先开始探讨，为什么本质上就错误了呢？</span></p><p><span>我们来回忆《孟子》的开篇，讲义利之辩，义和利是有很大区别的，而梁惠王刚开始问的，第一句话，就是何以利吾国？所以从最开始的问题，就可以看到本质，因为从本质上就是在问利。</span></p><p><span>所以这个时候梁惠王讲，我已经对于年荒的时候的民众，做了很多事情，为什么我国家的百姓，没有见到增加呢？还是以利的想法急功近利，一旦这个本质错了以后，就不可能做的事情是合于仁义的。</span></p><p><span>我们往生活当中举例子，也是如此。如果我们在生活当中，做的某件事情，我们的出发点，也就是我们的思维模式当中，考虑的就是利，这个本质就开始发生了错误，会导致后面，所有的思维和行为，都是错误的。</span></p><p><span>比如说感情，我们和一个人在一起，一开始就为了图利，比如说，图他的事业比较好，图他的美貌，图他对我们的关心和体贴，这都是利，当我们以这个为出发点，也就是从本质上就会开始发生错误。</span></p><p><span>这个时候，如果他一旦没有那么美貌，或者遇到一个比他更好看的人，我们的心就会变。再比如说如果图他的才华，当有一天发现，他的才华没有那么好了，或者看到了一个，我们认为比他更有才华的人，这个时候我们的心就会变。</span></p><p><span>再比如说，是因为这个人比较关心我们，这个人比较体贴，所以我们选择跟他在一起，有一天发现，我们不再需要他的关心和体贴了，或者他不再关心和体贴我们，再或者出现了一个人，比他更加懂得关心我们，这个时候我们的心，自然就会发生变化，所以我们讲很多时候，从一开始的思维方式就错了。</span></p><p><span>再比如说我们去教育孩子，如果给孩子，报了一个兴趣班，我们就是为了让他，在这件事情上，有所建树，或者我们给他报的目的，就是为利的，希望他这方面，是有所展现和发挥的。</span></p><p><span>可是孩子学习了一段时间，我们发现，他并没有想象的那么好，他也并没有显现出来，这方面的才能。</span></p><p><span>这个时候，我们就会开始怨天尤人了，说孩子是不是没有天赋，是不是花这个钱没有意义，是不是耽误太多的时间了？</span></p><p><span>所以从一开始思维的出发点，就决定了这件事情的走向。我们再来看《孟子》开篇的义和利之间的辩，是非常重要的事情。他是一个人整体价值观的展现，他是扭转我们整体思维的，一个非常重要的关键之所在。</span></p><p><span>这里我们讲到梁惠王，认为治国尽心尽力，还要追溯到开篇的义利之辩，因为那是根源，也就是我们要学会这种思维方式。在生活当中，当我们遇到一些事情，我们发现结果错误的时候，往往本质也就是从源头开始，就已经发生了问题，只是我们不知道而已。</span></p><p><span>这个时候我们要回到源头，去思考问题。我们去看，是不是从根本上，就发生了错误，也就是做这件事情，最开始的出发点，已然出了问题，所以义利之辩，转变是我们整个的价值观，我们整体的思维体系。</span></p><p><span>如果我们做一件事情，出发点是义还是利，就导致了这件事情结果的不同走向，不光是治国这件事情。我们再举个例子，比如说梁惠王，他拥有自己的庭院，有鸿雁、麋鹿，我们用现在的话，有私人花园，我们看私人花园，到底是做什么用的很关键。</span></p><p><span>比如说我们去看文王也有，但是文王是可以与民同乐的，也就是文王，他是可以共同的去分享，和百姓共同去享用，这时候的乐才能长久。而如果一个皇帝，一个君王自己的东西，都是自己来享乐的，又能享乐多久？</span></p><p><span>我们这里就要再去看，第二段话所讲到的贤者之乐，什么样的人才能真正的得到快乐？与民同乐。作为一个君王，要懂得学会与民同乐，这就是仁义的具体显现。</span></p><p><span>我们延伸到现在，我们的生活当中，当我们拥有了一些东西以后，能选择与多少人共同去欢乐。举个例子，当我们的事业做得比较成功的时候，有没有与我们身边的人共享，也就是有没有惠及到身边的人？</span></p><p><span>比如说我们赚了钱以后，我们的父母，亲朋好友，有没有得到我们的惠施，有没有施予他人？再比如说当我们的企业，如果不断地壮大，做得很大以后，跟着我们的员工，有没有得到惠及呢？这就是与民同乐。</span></p><p><span>再比如说，当一个人学习了传统文化，懂得修身以后，我们有了更多的智慧，有没有帮助我们身边的人，也拥有了智慧，减少了烦恼，这也叫与民同乐。与民同乐，是仁德和能力的具体显现。</span></p><p><span>首先要有仁德，有与民同乐的这种心，其次是能力，即使想与民同乐，要拥有一定的能力和智慧，才可能真正的与民同乐。这里孟子次第讲得非常清晰，首先讲了义利之辩，转变我们整体的价值观和思维体系。</span></p><p><span>我们要知道每件事情，是以仁义为出发点，如果我们以利为出发点，从根源上就已经发生了错误，如何以仁义为出发点，讲到了贤德之人，是要学会与民同乐的，所以去看看在生活当中，我们拥有的，是否可以与民同乐呢？要与身边的人共享，要学会去惠及更多的人。</span></p><p><span>接下来到了第三段，也就讲到了具体的事情。梁惠王讲到了国事，所以这里我们还是能看到，梁惠王是想要成为一个贤者的，所以才会招贤纳士、求贤若渴，并且与贤者去交流和探讨，想要去问，想要去请教，如何才能变成一个更贤德的人？如何才能治理好我的国家？</span></p><p><span>只不过出发点，就已经开始发生了错误。那讲到了具体的事情，梁惠王说，自己对于国家尽心尽力，但是孟子讲了五十步笑百步，因为根本还是好利，那也就是接下来孟子会讲到，如何从具体的事情上去，实施仁义之道？如何惠及更多的人？</span></p><p><span>作为一个君主，当然要惠及自己的百姓。我们接下来看，也就是到了孟子告诉梁惠王，到底该如何在治国当中，用仁义之道？</span></p><p><span>首先第一点是不违农时，民以食为天，自古皆如此。无论是从古代到现如今的我们，都是一样的，人生活在这个世界上，第一件也是最重要的事情，就是吃饱饭，所以第一件事情，自然是不违农时，不要影响农民耕种的时间。</span></p><p><span><strong>不违农时，谷不可胜食也；</strong>谷指的是粮食，这里的胜指的是尽，不可胜食也，就是粮食用不尽，因为不违背百姓的农时，不影响百姓耕种，这个时候粮食是吃不完的，吃不尽的。</span></p><p><span><strong>数罟不入污池，鱼鳖不可胜食也；</strong>罟是网，数是代表的密的意思，数罟也就是密网，密网不入池塘。鱼鳖不可胜食也，鱼鳖是吃不尽的、用不尽的。为什么不用细网去捕？因为细网密网捕的是小鱼，如果把小鱼都捕上来了，它要如何长大呢？</span></p><p><span>不用密网，指的是捕一些大鱼，给小鱼一些成长的时间，长大的时间，等他长大了再去捕捞，这个时候鱼鳖是吃不尽的，是吃不完的。</span></p><p/><p><span>我们去看这句话，在告诉我们不要贪婪，我们在生活当中，其他事情也要明白这个道理，做人做事不能贪婪，不要一网打尽，要懂得给别人，留下一些生存的空间。</span></p><p><span>《论语》讲过，子钓而不纲。说孔夫子钓鱼是不用网的，只取自己所需就好了，这个时候给鱼空间，同时也给别人空间，别人需要的时候再可以去取。我们在生活当中处理问题，也要这个样子。</span></p><p><span>比如说我们吃东西，要懂得够用即可，给别人留一点吃的；我们在企业当中也是一样的，当我们在做事情的时候，要知道事不可以做尽，要给别人留一些空间，要给别人留一些成长的余地。</span></p><p><span>再比如说做生意，关于利润也是如此的，不能自己把所有的利润都拿在手里，我们要给别人再留一些利润空间，这个时候才可能更长久。如果我们更贪婪，都以自己的利益为主，这件事情就不会长久。</span></p><p><span>就像我们文中所讲的捕鱼，如果用一些密网去捕鱼，看似我们当下是多得了，但是一定不长久，我们把这些用掉了以后，就没有鱼可以去捕了，所以我们在生活当中也是一样的。</span></p><p><span>如果我们以自己的利益和欲望为导向，就会多拿多取，会让我们变得贪婪，贪婪的看似当下会让我们多得，但是从长久来讲，会损失更多的利益，我们也会损失掉更多的人，没有人愿意跟我们去合作。</span></p><p><span><strong>斧斤以时入山林，材木不可胜用也。</strong>斤指的是类似于斧头的工具，所以斧斤都是指，砍柴所用的工具，斧斤以时入山林，要按照合适的时节，合适的时间去砍伐木材，这个时候材木不可胜用也，是用不尽的。</span></p><p><span>那我们看以时入山林，同样很重要。什么叫以时入山林？比如说春夏是不能砍柴的，因为春夏木材是在生长的季节，到了秋冬之际，会变得更大更粗壮，这个时候叫以时入山林。</span></p><p><span>因为木材在古时候有很多的用途，首先是取暖，不光取暖，比如说做车，比如说做拐杖，比如说盖房子，建宫殿，都是需要木材的。以时入山林，还有什么意思，要懂得物尽其用。</span></p><p><span>比如说如果我们是取暖所用，要选一些不是那么大的，那么粗壮的木材，或者是一些枝干，就可以用来取暖。所以儒家文化告诉我们，无论做任何事情，都要从仁义的角度出发，不要用那些大的木材，要学会留给别人去用。</span></p><p><span>以时入山林，第一点告诉我们，要掌握合适的时节，不要浪费；第二点以时就是告诉我们，看看我们当下能用到什么，就用什么，不要过度的贪婪，我们这个东西，明明用不了那么大的，但是非要找大的去用，这是一种资源的浪费。</span></p><p><span>同样我们在生活当中，也要学会这个道理。比如说我们生活当中的用品，也是如此，有一些东西，明明跟我们当下不相应不符合，我们干嘛非要去用，要留给别人，留给更需要的人用才对。</span></p><p><span><strong>谷与鱼鳖不可胜食，材木不可生用，是使民养生丧死无憾也。</strong>粮食和鱼鳖吃不尽，材木用不尽，这些是保证可以让百姓养生，丧死无憾的。我们先看养生，也就是安居，让人们生活得更好，他的衣食是有保障的。</span></p><p><span>丧死是指的家里有人去世，无论是正在生的人，还是离世的人，都是无憾的，当一个生人也就是活着的人，他的衣食是有保障的，这个时候家里有人去世，才会把丧礼办得更好。我们可以去试想一下，如果一个活着的人，还不能吃饱饭，这个时候有办法去治丧吗？</span></p><p><span>显然是没有办法的，养生丧死无憾，有粮食吃，有鱼鳖之类的吃，并且有很多的材木可以去取暖。这个时候无论是生者，还是离世的人，都是没有什么样遗憾的，下面这句话是总结了。</span></p><p><span><strong>王道之始也。</strong>始就是开端，这个时候才是王道的开端，我们再来回顾，梁惠王所讲的话，梁惠王认为自己治国，已经尽心尽力了。但是孟子却说五十步笑百步，因为从根本上，就已经发生了错误，也就是他所谓的尽心尽力，还是为了增加百姓，还是为了好战，这些都叫利。</span></p><p><span>可是孟子所讲的不同，第一件事情让百姓安居，这是王道之始。那么第二件事情，就是要讲，如何让百姓乐业？就是生活得更好，不只是温饱的问题，还要更深入的，让百姓生活得更好，所以这一切都是以仁义为出发点。</span></p></div>"
},{
    "title": "《孟子》梁惠王上③-3 安居乐业兴文化",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上③-3</strong></span></p><p><span>我们上一讲，学习到养生丧死无憾，王道之始也。首先解决人们的安居问题，何为安居呢？温饱，温是指的保暖，饱是吃饱肚子，首先百姓要有粮食吃，还要有木材可以去生活取暖，这个时候温饱的问题得以解决，这只是王道的刚刚开始。</span></p><p><span>我们去想一个人，在温饱解决之后，会不会有担忧和担心？因为刚解决温饱的时候，是没有存粮的，没有余。我们现在过春节的时候，经常会讲一句吉祥话，叫年年有余。也就是解决温饱，是刚开始解决温饱之后，我们要思考的下一个问题，如何才能有余？</span></p><p><span>如果百姓手里是有余粮的，其他的物资，生活用品都是有存余的，这个时候他不会担忧，人的心才会稳定下来。那也就到了第二个阶段，叫做乐业。我们可以找一个什么样的事情，让自己有余，让自己可以把生活过得更好，我们看如何乐业，如何才能有余呢？</span></p><p><span><strong>五亩之宅，树之以桑，五十者可以衣帛矣；</strong>五亩之宅，说每一家有五亩宅院，古时候的五亩，跟现在的亩不太一样，那个时候因为人口比较少，所以每一家所分的田地和宅院，都会相对来讲比较大。那个时候的五亩，相当于我们现在的八百平方左右，如果从现在来看，可以算是豪宅豪院了，有八百平方这样的宅院。用来树之以桑，种桑树，桑树可以养蚕，这个蚕是可以用来做丝制品的，同时桑树本身，也有它很多的作用。</span></p><p><span>比如说三年的桑枝，可以做拐杖，十年的桑枝可以做马鞭，十五年的桑树可以做弓，二十年的桑树可以做车，所以我们看树之以桑，既可以用纺织品，同时桑树还有很多的用途。从殷商开始，也就是商朝，就已经开始种植桑树，又到了周朝 春秋，最后到了战国时期，种植桑树的技术，已经非常纯熟完善。</span></p><p><span>所以这个时候孟子讲，如果有八百平方的宅院，这个时候树之以桑，五十者可以衣帛矣，衣是动词穿，帛指的是丝制品，如果可以有五亩的田地，树之以桑，五十岁的人，就可以穿上丝制品了，我们这里要注意了，为什么五十岁的人，才能穿上丝制品？</span></p><p><span>首先这里体现的，第一点叫做尊老，要尊敬老者，先给五十岁的人，去穿上丝制品；那么第二点身体原因，因为五十岁人开始身体，已经开始没有那么好了，他没有那么抗寒，所以丝制品相对来讲，穿得更舒适，并且保暖的效果也更好，所以说如果树之以桑，五十者可以衣帛矣。</span></p><p><span>同时这里也说明了一个问题，如果人人都可以穿上丝制品，就不需要等到五十岁的人，才可以穿上，通过这一句话，我们可以看到，战国时期是很贫困的，绝大多数人都没有办法穿上丝制品，所以当家庭环境得到改善，可以树之以桑，五十岁的人，这些老者，先要去穿上这些丝制品。</span></p><p><span><strong>鸡豚狗彘之畜，无失其时，七十者可以食肉矣；</strong>这里的豚指的是小猪，彘指的是大猪，它是两个品种，彘是体型比较巨大的，可以长到两三百斤的猪，而豚品种就是小猪、鸡豚、狗、彘这些家畜，如果每一个家庭，都可以去饲养这些家畜，无失其时，我们养任何东西，都要有它自己的方法，和它自己的时节。</span></p><p><span>比如说，该怎么去照顾鸡豚狗彘，比如说什么季节该繁殖？按照合适的时节去驯养家畜，这个时候结果就会呈现，七十者可以食肉矣，到了七十岁的人，就可以吃上肉了。</span></p><p><span>同样我们要注意，为何要七十岁？首先依然是尊老，因为要尊重老者，这是我们中华民族的传统美德，第二点依然是身体上的原因，因为人到了七十岁，本来进食就少，吃的东西越来越少，这个时候他的营养是跟不上的，所以家里一旦条件好了起来，这些肉食是要先给老者吃的。</span></p><p><span>我们同样可以看到这样一个画面，是因为大家都吃不上肉，如果人人都可以吃上肉，就不需要七十者才能去食肉，如果人人都可以穿上丝制品，就不需要五十岁的人，才可以穿上，所以我们可以感受一下，战国时期，那个时候的百姓是民不聊生的，温饱都是问题。</span></p><p><span><strong>百亩之田，勿夺其时，数口之家，可以无饥矣。</strong>这里讲田地，那个时候一个成年的劳动力，是可以分百亩的田地的。勿夺其时，这个夺字用得很好，不要去夺百姓耕种的农时，这里为什么叫勿夺其时呢？就说明平时都是夺了百姓的耕种时间的。</span></p><p><span>比如说战争，比如说君王为了自己的享乐，建造宫殿，这些都是要用到百姓的，用百姓去服役的，服劳役，当然就夺了农时。所以我们可以看古代圣明的君王，用百姓都叫使民以时，找合适的时机，他在耕种的时候，这个时候是不能用的。</span></p><p><span>因为只是为了享乐，是为了战争、好战等等，夺了其时，他那一家人，就要挨饿受冻的，所以说一个仁义的君主、圣明的君主，一定不能夺了百姓的民时，民以食为天，如果不夺其时，数口之家可以无饥矣，他整个家庭，都是可以吃饱饭的。</span></p><p><span>这一段在讲乐业，在讲有余，首先人解决了温饱之后，还会有很多的担忧，这个时候心是不踏实的，所以接下来交给百姓树之以桑，蓄养家畜，这个时候就会有存余，并且去改善自己生活的现状，同时数口之家可以无饥，自然就解决了乐业的问题。</span></p><p><span>我们说安居乐业，解决了基本的温饱问题，并且还有一些自己的产业，他是开心的、愉悦的，这个时候人心才会稳定，整个社会才会稳定。</span></p><p><span>我们再去看梁惠王的问题，认为自己尽心尽力，可是为什么百姓，并没有增加呢？因为这里的温饱问题，都没有解决，还有很多人，因为灾年要挨饿受冻的，温饱问题都没有解决，何谈乐业，何谈有余？其他国家的百姓，怎么可能愿意到你这里来？</span></p><p><span>我们学习《论语》的时候讲，近者悦，远者来。如果接触到我们的人都是愉悦的，都是开心的，都有自己的温饱和产业可以解决，这个时候远者自然闻风而到，所以说其他国家的百姓没有来，就说明生活在我们这里的百姓，都没有安居乐业，所以远处的人又怎么会愿意来到？</span></p><p><span>我们看解决了安居乐业的问题以后，下一步我们要做什么事情了，我们思考自己生活也是一样的，当我们很贫困之时，先要解决温饱问题，想努力地奋斗，自己吃饱饭穿得好一点，我们解决了温饱，接下来是不是开始，要有自己的产业，要有自己的存余？</span></p><p><span>比如说我们去买房子，去买车子，去改变生活的方向，让自己的生活更好一点，生活的更好一点以后，我们下一个需要思考的是不是就是精神文明了？我们需要自己的内心，开始变得更愉悦，需要自己的心灵和精神有所寄托。</span></p><p><span>那么第三点就讲到了教育，<strong>谨庠序之教，申之以孝弟之义，</strong>谨是谨慎认真，庠序是指的学校。我们古时候五百户为一党，党当中的学校称之为庠，一万两千户称之为随，随当中的学校称之为序，庠序也就是大一点的学校和小一点的学校，要谨慎认真地去办一些大的学校和小的学校。</span></p><p><span>申之以孝弟之义，申是反反复复的，教给学生们孝悌的道理，<strong>孝。</strong>是尊敬父母，<strong>弟。</strong>是敬爱兄长，这里孝悌之义，只是举了个例子，不光是要反复地，去教导孝悌之义，还要教礼乐，孝悌是礼之根本，亦是人之根本，有了孝悌才可能知礼节，有了孝悌才可能懂仁义。</span></p><p><span>所以这里的孝悌，也只是举了一个例子，告诉我们安居乐业以后，要懂得去办学校了，去教化更多的人，让更多的人知礼节，懂仁义，这个时候文化才会兴盛，每个人的内在的精神层面，才会更加富足，承办教育的结果是什么呢？</span></p><p><span><strong>颁白者不负戴于道路矣。</strong>颁白者指的是头发花白的人，负是背着，戴是顶着，我们可以看以前说，头发花白的人，在拿重物的时候拿不动，所以有的背着，有的放在头上顶着，如果懂了孝悌之义，就不会让这些头发花白的人，背着或者顶着重物，走在道路上。</span></p><p><span>我们看这里有两个原因，第一个原因，如果衣食是富足的，这些老人家怎么还需要负戴于道路上？那么第二点，如果大家都是懂得孝悌之道的，都是知礼节的，又怎么会让这些老者，负戴于道路上呢？</span></p><p><span>所以这句话，我们可以看到当时的情形，第一点是因为衣食不够富足，没有的吃 没有的穿，所以没有办法，头发斑白的人，依然要很辛苦的每天去劳作，以及做事情。</span></p><p><span>那么第二点，温饱的问题都没有解决，何谈教育，所以那个时候的人，已经不知礼节了，我们看整个孟子，所讲的这一段话，首先安居，接下来乐业，再去承办教育，所以这两点缺一不可。</span></p><p><span>即使我们说懂得仁义之道，明白孝悌之礼，如果吃不上饭，依然要负戴于道路上，即使是可以衣食富足的时候，如果人不知礼，不懂得孝悌之道，依然会让这些头发斑白者，负戴于路，所以它解决的是两个事情，一个是物质文明、物质基础，也就是衣食富足。</span></p><p><span>那么第二个解决的是精神文明，礼仪之道，也就是孝悌，是为人之根本，我们从安居乐业讲到了教育。这个时候我们可以看到，社会上呈现出来的是和谐的景象。</span></p><p><span>大家可以解决温饱问题，并且是有存余的，而且大家都可以去学校，学孝悌之道，学仁义之道，那整个社会，自然呈现出来和谐的画面，老有所养，家庭是和睦的，人人生活是富足的。</span></p><p><span><strong>七十者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。</strong>当呈现出来一个和谐的场景以后，结果我们可以看得到了七十者，衣帛、食肉，所有的老人家可以穿上丝制品，可以吃上肉，百姓不饥不寒，大家没有了饥饿，也不会受寒，这个时候温饱的问题，得以解决了。</span></p><p><span>然而不王者，未之有也，这里的王是动词，是归顺的意思。也就是做到了这个样子，天下的百姓自然来归顺，以你为王，所以当做成这个样子，天下不来归顺，没有这样的事情。</span></p><p><span>所以我们可以看到，其实自古即今，都是这个样子的，不光是治国如此，我们去讲一讲生活当中的事情，看看是否也如此？比如说我们去做一家企业，经营一个公司都是一样的道理。</span></p><p><span>首先要解决的是温饱的问题，接下来解决了温饱，要让在这里工作的人，以及我们的客户更加有余，只有在有余的时候，他才不会担忧，不会担心，心是安稳的，有余了之后，我们要给他更多的精神文明，也就是企业文化的教育，这个时候他自然心甘情愿地，在这里做事情。</span></p><p><span>再比如说我们一个家庭当中，也是一样的。我们首先作为一家之主，要解决家庭的温饱问题，解决了温饱问题，我们还要让他有余，这个时候心才会安。有余了以后，我们要追求的是精神文明，是内在心灵的升华。</span></p><p><span>我们现在这个时代，是国泰民安的，是有余的，所以我们这个时候就很幸福，可以直接去追求精神文明，所以接下来的这些年，一定是传统文化复兴的时候，一个民族要想更加兴盛，是文化的复兴，所以我们是幸福的幸运的，我们不用去担心温饱的问题。</span></p><p><span>我们每个人生活当中，实则都是有余的，当我们没有那么多欲望，没有那么多奢求，我们当下的生活，都没有什么问题，这个时候我们更加匮乏的，缺少的就是我们内在的力量，精神文明，我们现在正在学习的传统文化，就是在学习孝悌之义，学习仁义之道。</span></p></div>"
},{
    "title": "《孟子》梁惠王上③-4 王无罪岁",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上③-4王无罪岁</strong></span></p><p><span>我们回顾梁惠王和孟子之间的对话，梁惠王认为自己治国，尽心尽力，但孟子说五十步笑百步，要想让百姓增多，安居乐业教育，这是孟子讲给梁惠王，应该这样去做的。可是我们看看现如今是什么样子的呢？</span></p><p><span><strong>狗彘食人食而不知检，涂有饿莩而不知发，人死，则曰：“非我也，岁也。”</strong>看看我们如今的状态，如今百姓生活的样子，不让人心痛吗？狗彘食人食而不知检，我们去看那些猪狗，他们在吃人应该吃的食物，而不知检，却不知道停止。</span></p><p><span>我们这里可以看的到什么样的猪、狗可以吃人食呢？君主的、官员的、富人的，只有这些富人的猪和狗，才能吃到穷人的百姓的该吃的粮食。</span></p><p><span>可是看看你们这些，高高在上的君主，看看高高在上的官员们，你们的猪和狗都在吃人的食物，而百姓你却不管，你还不去制止这些事情的发生，你怎么敢说，治国就尽心尽力了呢？</span></p><p><span>涂有饿莩而不知发，涂是道路，道路上有那么多饿死的人，而不知发，发是开仓赈济，道路上有那么多饿死的人，难道你们看不见吗，不知道开仓赈济吗？有人死了，则曰：非我也，岁也。</span></p><p><span>你说不是我的过错，是年岁不好，这个时候你开始怨天，觉得是今年的年荒年岁不好，所以才让百姓饿死在路上，难道这不是你治理政治上的错误吗？难道这不是你追求利所得到的结果吗？</span></p><p><span>你追求的是利，你只想要百姓增多，想让邻国的百姓，到你魏国这里来，可是你想一想，你真的有为百姓从仁义的角度去出发吗？如果你从仁义的角度出发，路途上有那么多饿死的人，你不知道开仓赈济吗？</span></p><p><span>你们的猪和狗都在吃着人食，你们不知道制止吗？那么多人死了之后，你却说这不是我的责任，这是年岁不好，怎么能怪我呢？</span></p><p><span>我们回头再来看这句话，当然孟子对梁惠王讲话，是不会用这样的情绪的。因为当用这样的情绪，在对梁惠王讲话，他是对抗的，所以这里孟子只是很淡然的，不露痕迹的，描绘了一下现如今的状态。</span></p><p><span>你去看看这么多人死了，你却觉得不是自己的问题，你却怪年岁。接下来我们看孟子，又举了一个非常有意思的例子，且很恰当。</span></p><p><span><strong>是何异于刺人而杀之，曰：“非我也，兵也。”</strong>我们看这个例子很有意思，说你无异于拿着兵器去杀人，杀完人以后，却讲不是我杀的，是刀杀的，是兵器杀的。</span></p><p><span>我们看这个例子非常的简单，说你拿着兵器杀了一个人，杀了以后你说不是我的错，不是我杀的，是这把刀杀的，是这个兵器杀的。直指梁惠王，非我也，岁也。 有这么多人，这么多百姓都已经饿死了，你却说不是我的错，说是年岁的错，这怎么能说得过去？</span></p><p><span><strong>王无罪岁，斯天下之民至焉。</strong>最后得出来一个结论，如果大王您不怪罪年岁，天下的百姓自然就来到这里了，我们看重点这四个字，王无罪岁，什么意思？说你不要去怨天尤人，不要去怪罪年岁。</span></p><p><span>下面那句话没讲谁的错，自己的错。你不要去怨天尤人，要反求诸己了，如果你能知道，是自己的政治治理是有问题的，是自己为着利出发，而没有为仁义出发，如果知道怪你自己，知道去改变你自己，天下的百姓，自然就会来到这里的。</span></p><p><span>我们看看这个思维，在我们生活当中是否常见？我们在生活当中，经常会讲这样的话，非我也，岁也，非我也，兵也。我们都说这不是我的错，这是事情的问题，这是他人的问题，就像文中的梁惠王，有百姓饿死，在道路上流离失所，他会讲这不是我的错，岁也，这是年荒，是老天造成这个样子，跟我有什么关系呢？</span></p><p><span>我们举生活当中的例子，来思考一下。比如说我们去做一件事情，没有做好的时候，我们说时运不济，我们说老天没给我机会，说社会对我不公平，一定不是我的错误，所以这样的思维，在我们生活当中非常的常见。</span></p><p><span>我们总是找各种理由和借口，去推卸责任，其实就是怨天尤人，所以我们生活当中，要学会王无罪岁，我们不要去怪罪别人，不要去怪罪事情，不要去怪罪时间，要反求诸己。</span></p><p><span>就像梁惠王一样，百姓流离失所，涂有饿莩，我们看看自己哪里，有做的不到的地方，是否是以仁义为出发的呢？我们在生活当中也是如此，当我们做一些事情的结果不好的时候，我们去想一想，自己有没有哪里不足？我们可以反求诸己。</span></p><p><span>比如说我们教育孩子，孩子的学习不好，我们就会怪罪了，怪孩子不聪明，怪孩子不努力，怪老师教的不好，怪现在的学校不行，怪他的父亲不管，或者怪他的母亲不管。</span></p><p><span>我们去想一想，我们又做了哪些事情呢？我们是否又有真的尽心尽力？所以其实无论做任何事情，我们都不要去怨天尤人，王无罪岁，不要去怪罪岁月，不要去怪罪他人，看自己有哪里是不足的？这个时候懂得反求诸己，才可能更好的去解决当下的问题。</span></p><p><span>比如说夫妻吵架也是一样，说今天家里发生了一个什么事情，就会怪他做的不对，怪他照顾的不周全，这个时候自然会引发争吵。可是我们去想一想，自己又做了什么，我们要学会反求诸己，家庭才会变得和睦，我们和别人的关系，才会变得和谐。</span></p><p><span>我们这里再拿梁惠王做个对比，当百姓流离失所，梁惠王他并不懂得责怪自己，他是责怪他人的，可是我们再看看周文王，我们看看商汤，看看大舜，看看禹，看这些圣明的君主。</span></p><p><span>当百姓挨饿受冻的时候，这些人都是在责己的，他在祈请上苍，如果有错的话，降在我一个人的身上。百姓受苦，一定是我哪里做错了，我哪里不足才会这个样子，所以看两种思维方式，就会有两种不同的结果。</span></p><p><span>我们在生活当中也是一样的，看看那些仁义的人，看看那些智者，当出现了问题，他是在思考自己，哪里做的不够呢？自己还可以做一些什么，这是以仁义为出发点的，而另外一种人，不停地怨天尤人，是因为以利为出发点，所以就会怨天尤人。</span></p><p><span>我们这里要做总结了，我们又回到孟子开篇，所讲的义利之辩，如果是从利为出发点的，产生一个结果的时候，一定会怨天尤人，毫无疑问。如果是以仁义为出发点的，无论产生的结果，是什么样子的，我们都会去思考，有哪里是不合于仁义的？</span></p><p><span>这个时候才能反求诸己，我们再用文中的事情举例子，比如说梁惠王，他为什么会有烦恼？说百姓不加多，因为他是为利，所以他一定会怨天尤人。但是圣明的君主，是以仁义为出发点的，他不会去想百姓有没有增加，他只会去想，如何才能让这些百姓安居乐业，给他更好的教育，让他知礼节。</span></p><p><span>所以又怎么会出现，狗彘食人食而不知检，涂有饿莩而不知发呢？他是以仁义为出发的，都在考虑百姓生活的怎么样，如何才能不让他流离失所。这就是孟子讲的仁义之道，如果当你这样去做，天下的百姓自然就来了。</span></p><p><span>越是以仁义为出发点，最后自然会得到利，如果源头就错了，从利出发，最后就会怨天尤人，会讲非我也，岁也，非我也兵也。</span></p><p><span>所以我们学习了这一讲的内容，我们要学会在生活当中，每件事情找到源头，从仁义去出发，自然得利，而要从利出发，最后自然会得怨。</span></p></div>"
},{
    "title": "《孟子》梁惠王上④ 始作俑者",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上④始作俑者</strong></span></p><p><span><strong>梁惠王曰：“寡人愿安承教。”</strong>我们看这句话，愿安承教，我们可以看到，态度有很大的转变，从最开始开篇的时候讲：叟！不远千里而来，何以利吾国？说您不远千里来到这里，有什么对我有好处的，可以利于我梁（魏）国的方法吗？</span></p><p><span>我们看到第二段对话，王立于沼上，顾鸿雁麋鹿，在这样的场景下对孟子讲：贤者亦乐此乎？说你们这些贤者，也有这样的快乐吗？一个是问利，一个是问贤者之乐。那么接下来梁惠王讲自己，尽心尽力治理国家，可是为什么百姓没有增加？我看邻国的政治，都没有我做得好，都没有我做得用心，请问这是为什么？</span></p><p><span>接下来孟子讲到了，如果想让百姓和子民增加，要解决他们的温饱问题，并且要有余，有余之后，要礼乐教化，让百姓知礼节，也就是安居乐业，并且给他教育，这个时候百姓才可能增加。而梁（魏）国的现状，现在显然不是这样的。</span></p><p><span>狗彘食人食而不知检，塗有饿莩而不知发，有这么多百姓死去，却讲不是自己的责任，是年岁不好，这与您持刀杀人又有何异？最后去怪罪是兵器的错误。通过这三段对话，我们可以看到，梁惠王的态度，发生了巨大的变化。</span></p><p><span>愿安承教，承是什么？劳烦您来指正于我，安表示认同，我心是愿意的，心是服气的。之前是不是也有问也有请教，但是请教未必是安心的，未必是心服的。我们去思考平时在生活当中，是不是一样？</span></p><p><span>比如说有一个人，我们觉得他比我们有智慧，比我们有德行，或者是事业做得比我们好，我可能会问他问题，可能会向他学习，但我们未必是安的。</span></p><p><span>当我们通过几个问题交流下来，或者通过在生活当中的一些接触，我们内心开始深深地认同这个人，认同这个人也就代表着认同他的思想，认同他的文化，认同他的行为，这个时候我们才会心悦诚服，愿安承教。我们才能安心的认为在劳烦对方，可以来指教于我。</span></p><p><span>通过这几个问题，我们可以看到梁惠王对于孟子所讲的仁政，有了认同。所以这个时候虚心地劳烦孟子再继续指教，他到底该如何做呢。之前只是指出了梁（魏）国现在的现状，具体要怎么去做呢？</span></p><p><span>我们接下来要讲到，孟子所提倡的仁者无敌。孟子提倡仁政，提倡与民同乐，提倡君轻民贵，这一集所讲的涉及不到仁政，但是我们要明白一个次第。想给他讲仁政之前，先要改变他的心念，改变他的认知，否则去给讲仁政，那是没有办法听的。</span></p><p><span>我们来举个例子，说我们在生活当中，想要改变一个人的行为，直接去讲，如何改变行为是没有作用的，要先去改变他的心性，去改变他现在心里的想法是什么样子的，我们要给他改变成什么样子，要指出他当下的痛点，指出他当下的问题，这个时候，我们才能去扭转他的心念。</span></p><p><span>我们接下来就要学习了，看看孟夫子是如何改变梁惠王的想法，如何指出当下的痛点以及弊端。我们学习《孟子》学会了一点，想改变一个人的想法，首先当然是要举例子，通过举例子由浅入深，层层递进，我们才能去改变一个人的想法，我们看孟子是如何举例子的？</span></p><p><span><strong>孟子对曰：“杀人以梃与刃，有以异乎？”曰：“无以异也。”</strong>问梁惠王，说杀人用木棍和刀刃，请问有什么区别吗？梁惠王说，当然没有区别。用木棍和兵刃，杀人都是一样的，都是杀人，只是工具不同而已。接下来才是重点，孟子又继续开始举例子。</span></p><p><span><strong>“以刃与政，有以异乎？”曰：“无以异也。”</strong>如果用政治和兵刃来杀人，请问有什么区别吗？梁惠王讲，没有区别，用政治和兵刃杀人是一样的。我们这里可以看到，层层递进的关系，其实这句话，孟子已经讲得很清楚了，说梁惠王是在用政治杀人，用政治杀人，和用刀刃去杀人，有什么区别？是一样的。</span></p><p><span>所以我们可以看到，这里的递进关系。如果孟子上来开始讲，用政治杀人，他一定是不服气的，我用政治怎么能杀人？人不是我杀的，那是年岁不好。这个时候孟子举例子了，说用木棍和兵刃杀人，有什么区别？没有区别，都是杀人。</span></p><p><span>接下来再深一步，用政治和兵刃杀人，又有什么区别？梁惠王讲没有区别。所以举例子，是由简单再到深刻，以最简单的例子，别人是可以更好理解的。看似举的例子好像与他无关，但是当再更深一步的时候，这个例子就与他有关联了。</span></p><p><span>接下来孟子就要具体地阐述了，既然孟子讲梁惠王是以政治杀人，我们看看他是如何以政治杀人的？</span></p><p><span><strong>曰：“庖有肥肉，厩有肥马；”</strong>庖是指的厨房，厩是指的马厩，这里指的是梁惠王以及梁惠王的官员，说你们这些官员，做君主的厨房里还有肥肉，马厩里还有肥马，可是你有没有看到百姓的现状？</span></p><p><span><strong>民有饥色，野有饿莩；</strong>你去看看黎民百姓，他们面露饥色，没有粮食吃，路途上都是死尸，这个时候活人都顾不上自己，哪有人去为自己的家人收尸。你还立于沼上，顾鸿雁麋鹿，问我贤者有此乐乎？贤者怎么可能，在这个时候去快乐呢？</span></p><p><span>你就是这样治理一个国家的吗？并且你还想要百姓增多，其他国家的百姓为什么要到你这里来呢？你这就是以政治在杀人，和你直接拿刀刃去杀一个人，是没有区别的。</span></p><p><span><strong>此率兽而食人也！</strong>说你现在执政的这种状态，就是率着猛兽而食人。这里的兽呢，指的就是你的政治，这就相当于，你率着野兽去吞噬百姓的生命。</span></p><p><span><strong>兽相食，且人恶之；</strong>猛兽之间互相蚕食，人们看到都是非常厌恶的。弱肉强食，大的吃小的，强的吃弱的，那你去看看现在的现状，这不就相当于，你带着猛兽在吃人吗？你在吞食着这些百姓，这一切哪有仁德，哪有仁义在其中？</span></p><p><span><strong>为民父母，行政不免于率兽而食人，恶在其为民父母也？</strong>这句话来了一个总结，说你是为民父母的，可是你为民父母，并没有免于率兽而食人，你和其他的国家是一样的，这不是五十步笑百步嘛。</span></p><p><span>你的百姓依然是生活在流离失所当中，甚至道路上还有那么多的死尸，那么多挨饿受冻的百姓，这些人相当于是你杀的。因为你的厨房里还有那么多的肥肉，你们的马厩里还有那么多的肥马，你还有鸿雁麋鹿这些享乐在。</span></p><p><span>可是你有没有想过你的民众，有没有想过你的百姓？所以你怎么去为人父母，如何去为百姓父母？所以看这里的恶，是一个助词，怎么能，怎么能去为百姓的父母。古人讲，治理天下都是爱民如子，如保赤子。说你去看百姓就像你自己的子女，是一样的，你像保护赤子很小的孩子一样，去保护你的黎民百姓，这才是一个真正的仁者，这才是王道。</span></p><p><span>可是你想一想现在的这些行为，你的政治有哪一点是在为民父母，你只是在自己的享乐当中，只是在求利，你还想让你的百姓，让你的子女拥护你，怎么可能呢？枉为人的父母。我们可以看到这一段话，孟子直指痛处，并且言语非常的犀利。</span></p><p><span>我们这里也可以看到孟子的变化，因为梁惠王的态度在变，讲到这一段说愿安承教，所以这个时候，孟子才能直指要害，直指他的痛点。接下来又开始引用，孔子的一段话。</span></p><p><span><strong>仲尼曰：“始作俑者，其无后乎！”</strong>这里的俑指的是陪葬品。我们再往古代来讲，有天子诸侯，这些君王离世之时，是用活人陪葬的，所以我们可以想象的到，何其残忍，后来有人想到了办法，就叫始作俑者，有人开始用俑来替代活人陪葬。</span></p><p><span>这个俑，是按照人的形状来做的，有大小的比例和尺寸，用陶土或者用土或者用陶瓷，还有用铜制品，是仿照人形来做的，我们看孔夫子是如何讲的？始作俑者，其无后乎！说最开始用人形来做俑陪葬的这样的人，其无后乎，他会没有后代吧，会断子绝孙吧？</span></p><p><span>这句话讲得非常得狠，我们去思考一下，一开始用活人陪葬更加残忍，但是用俑去仿照人形陪葬，依然是极其残忍的，为什么呢？</span></p><p><span>这里面没有仁德之心在，如果但凡有仁德之心，为什么要仿照人的形状，真的有爱民如子吗？如果真的有爱民如子，真的在实行仁政，又怎么会用人的形状仿造，去陪葬，心里想的是什么呢？我们看孟子接下来讲。</span></p><p><span><strong>为其象人而用之也。</strong>他讲人们为什么要用陶俑去陪葬呢？因为它像人的形状，因为像人的形状，就说明心里是这么想的，置人的生命于不顾，置人的存在于不顾，所以才会用人的形状去陪葬。</span></p><p><span><strong>如之何其使斯民饥而死也？</strong>怎么能让这些百姓，因为饿而死掉呢？那我们看这句话的延伸部分，也是结尾的部分。说孔子认为，用像人形的陶俑去做陪葬，这都是很残忍的事情，何况今天还有那么多百姓，因为挨饿而死掉的。</span></p><p><span>这就是现在的政治现状，这就是你想求利所得来的结果。如果懂得仁者无敌，如果明白仁义而已矣，从仁义的角度去出发，今天的结果不会是这个样子的。所以我们看孟子，把整个这段话阐述得很清楚，也形象的给我们描绘了，那个时候梁国的现状，不光是梁国如此，战国时期都是那个样子。</span></p><p><span>所以我们不禁要感叹，那个时候的人生活真的很苦，没有吃的，并且随时都有可能饿死在路上，而这些做君主的人，还在想着自己的私利，如何去扩张，如何让自己的国家变得更大，如何让自己的百姓变得更多？谁又愿意去这样一个地方去生活呢？</span></p><p><span>我们从这里再来延伸一点，这段话在指出梁惠王的痛点，在指出如今的现状，所以这是在改变梁惠王的那颗心，是在激发他的仁心，一旦他的仁心升起，才可能去实行仁政。</span></p><p><span>所以下一讲，我们就要讲到底该怎么去治理一个国家，也就是孟子讲到的仁政，仁者无敌。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑤-1 梁惠王之耻",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑤-1 梁惠王之耻</strong></span></p><p><span>我们通过两个人之间的对话，可以看到彼此的心理变化。比如说，文中的孟子和梁惠王，我们看两个人在开篇里讲到：“何以利吾国？”讲到仁义而已矣。怎么才能利益我的国家呢？</span></p><p><span>接下来又问：“贤者是否乐此？”也就是对于眼前的事情，顾鸿雁麋鹿，是否会快乐？孟子讲：只有真正的贤者，才能快乐。如果不是一个贤者，即使拥有很多外在的物质，哪怕是拥有整个天下，也不会真正的快乐。</span></p><p><span>接下来梁惠王又讲，说寡人对于国家尽心尽力，但是为什么治理的还不够好呢，百姓还没有变多？那么孟子讲到五十步笑百步，因为从本质上根本上就错了。是以利为出发的，并不是以仁义为出发点，去利益百姓的。</span></p><p><span>接下来梁惠王态度发生了转变。“寡人，愿安承教。”我想安心的听您的指导、教诲、劳烦您。</span></p><p><span>那么接下来，孟子又讲到魏国当下的现状，是你们这些做官员的人，有很多的肥肉、肥马，还有鸿雁麋鹿，可是百姓却民不聊生，甚至有很多人，都饿死在道路上，这些人又怎么愿意去保卫你的国家呢？</span></p><p><span>我们接下来，今天这一讲，看看梁惠王还有哪些心理的变化？这一点在我们生活当中很重要。</span></p><p><span>比如说，我们在和别人交流的过程当中，要看对方的接纳程度，要看他的心理变化，我们要懂得察言观色，从他的表情当中，从他的语气当中，从他所说的话，我们都可以看到对方的心理变化。</span></p><p><span>当梁惠王讲到愿安承教，这个时候孟子讲话，会变得更直接，讲到了魏国当下的现状，讲到梁惠王治理国家，治理成这个样子，是完全没有仁德的表现，无异于率兽而食人。接下来我们再看梁惠王，有什么样的心理变化？</span></p><p><span><strong>梁惠王曰：“晋国，天下莫强焉，叟之所知也。”</strong>说晋国天下，没有比晋国再强大的了，老先生，这一点您是知道的，晋国被三家分晋，也就是魏、赵、韩，又形成了三个国家，我们可以想象晋国的强大。</span></p><p><span>一个国家可以分为三个国家，并且在战国初期，魏国是非常强大的，他主宰着整个战国的变化。魏文侯，魏武侯时期，魏国都是战国最强大的国家。</span></p><p><span>到了魏惠王这里，也就是梁惠王开始变得没落，所以魏国也是一直以晋国来自居的。这个时候他在回忆，他说老先生，我们晋国以前是最强大的国家，这一点您是知道的。</span></p><p><span><strong>“及寡人之身，东败于齐，长子死焉；西丧地于秦七百里；南辱于楚。”</strong>梁惠王觉得，这是一件很耻辱的事情。我们先这里看第一点，什么样的人才会讲到过去的辉煌呢？</span></p><p><span>梁惠王说过去的晋国，天下莫强焉，那是辉煌，也就是现在过得不好的人，才会讲过去的辉煌，如果现在过得很好，只需要讲，当下的现状就好了。</span></p><p><span>所以我们通过这一点，可以观察身边的人，如果一个人开口讲话，总是讲他过去的辉煌，讲他过去如何如何，就说明他今天过得不够好，他是向往过去的，那种生活状态的，向往过去的那种辉煌。</span></p><p><span>我们再来看第二点，梁惠王讲了过去，晋国的辉煌以后，说到了我现在，简直是一种耻辱。魏国东是齐国，西是秦国，南是韩国和楚国，北是赵国，一开始在战国的初期，魏国本身强大，并且赵、魏、韩，三个国家是联盟在一起的，并且感情深厚，牢不可破。</span></p><p><span>所以这个时候，魏国是没有后顾之忧的，可是到了梁惠王这里，受人挑拨，和赵国以及韩国的关系，变得破裂。所以这个时候，韩国求助于齐国，与魏国开战。</span></p><p><span>那么梁惠王在这里提到，东败于齐，长子死焉，我们和东方的齐国，两国交战，败了，并且败得很惨，长子也就是太子被掳，后来被杀，并且在这一战当中，还损失了一位大将，叫做庞涓，败于孙膑之手，这场战役叫马陵之战，非常的著名。</span></p><p><span>西丧地于秦七百里，在西方又与秦国开战，结果屡战屡败，割让十五座城池。南辱于楚，在南方又与楚国开战，结果又是战败，丧失了八座城池。我们可以想象得到，梁惠王此时的心情，在他之前魏文侯，魏武侯，魏国是非常强大的。但是到了他这里，连年战败，连年失去城池，这是他一生最耻辱的事情。</span></p><p><span>我们这里可以看到，一个心理变化，通常在什么样的情况下，我们才会把心中，最耻辱的，最痛苦的事情，讲于他人听。这个时候对对方是信任的，是接纳的，认为他是有能力，帮助到我们的。只有在这种情况下，我们才能吐露自己的心扉。所以到这里，我们可以看到，梁惠王心理的变化。</span></p><p><span>我们在生活当中也是一样的，我们刚和一个人接触，或者交流的时候，我们只会说一些表面的事情，会说一些抱怨，会说一些别人的不好，可是当我们完全接纳，信任对面的这个人，我们就会开始讲自己的痛处，讲自己真正在意的事情，讲让自己耻辱的事情。</span></p><p><span>所以我们可以看到，这个时候的梁惠王，他是把所有的真心都拿出来的状态，他是诚心诚意的，想要寻求孟子的帮助。</span></p><p><span><strong>“寡人耻之，愿比死者一洒之，如之何则可？”</strong>我真的觉得很耻辱。比是替换，替代，洒是一洗前耻，报仇雪恨的意思。我们看这句话的意思，梁惠王觉得自己真的很耻辱，我宁愿替代那些战死的人，去报仇雪恨，我要怎样去做呢？</span></p><p><span>我们这里还要延伸一点，当一个人觉得很耻辱，把自己内心最痛苦的事情，可以讲出来，第一是因为交心，真的想寻求帮助；第二点很重要，是因为有底气了，是我自己似乎已经知道了，解决的方案，知道该如何去处理这件事情，我们才会这样去讲话。</span></p><p><span>我们自己来思考一下，在生活当中是不是如此？比如说我们和一个人在交流，我们再请问对方一些问题，一些困惑，问着问着，我们开始吐露自己的心事，我们开始敞开自己的心扉。</span></p><p><span>当我们讲出内心最耻辱和最痛苦的事情，其实同时心底，已经有解决问题的方案了，只不过还不够笃定。需要孟子，再给他更加坚定的信心，如果我们没有底气，解决这件事情，不知道解决的方法，我们是不会把最痛苦的事情，讲出来的。</span></p><p><span>我们再举个具体的例子来体会，假如说一个女士，在家里受了家暴，这个时候我跟一个人在交流这件事情的时候，最开始他不会讲，最开始他会抱怨，抱怨对方不好，对方不照顾家庭，抱怨自己过得不开心。</span></p><p><span>那对方呢，会讲很多事情，会讲很多思维方式，那么讲着讲着，当这位女士，开始把自己最痛苦的事情讲出来，说其实对方是有家暴到我的，讲的同时，他的心里隐约已经有解决问题的方法了，只不过还不够笃定。我们通过这里可以观察，两个人之间交流的智慧和心理变化。</span></p><p><span>孟子在这里，只需要再进一步的，笃定地告诉梁惠王，他心中所想的，隐约知道的方法是正确的，只需要再让他更加笃定和坚信。我们接下来看孟子，到底讲了什么？</span></p><p><span><strong>孟子对曰：“地方百里，而可以王。”</strong>说有一个方圆百里的地方，都可以让天下恢复，何况魏国现在还如此的庞大呢？如何可以让方圆百里的地方，能让天下归附呢？接下来孟子给了详尽的答案。</span></p><p><span><strong>“王如施仁政于民，省刑罚，薄税敛；”</strong>如果大王您可以，施仁政于民，省是减少、少用，少用和减少刑罚，减轻税收，只此两项施仁政，因为这两项都是惠及于民的。我们首先看省刑法，减少对于百姓的惩罚，这个时候百姓生活的就会很安心，减少税收，就可以让他的生活有余。</span></p><p><span>我们反过来讲，如果不施仁政的情况下，就会加重税收，为何会加重税收？因为战争是需要庞大的费用的，并且还需要服劳役、服兵役，这个时候百姓生活的压力，就会很大。当加重税收之时，一定有人是交不上的，那交不上之时又会加重刑罚，所以相辅相成。</span></p><p><span>这个时候，百姓的生活就是不安定的，人心就是不稳的。可是施仁政呢，不去主动战争，就会减轻百姓的压力和税收。那么减轻税收，自然也会相应的减少对百姓的刑罚，如此百姓可以安居乐业，生活有余，人心稳定，这就是施仁政所带来的结果。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑤-2 仁政于民",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑤-2 仁政于民</strong></span></p><p><span>当人心稳定，生活富足，我们看接下来会，发生什么事情？</span></p><p><span><strong>“深耕易耨；壮者以暇日修其孝悌忠信。”</strong>深耕易耨，也就是深耕细作，易是勤，耨是除草，它是连贯的，只有在人心安定，时间有余的情况下，才可能深耕细作，勤除杂草。如果大家都是忙着交税收，忙着服兵役服劳役，又怎么可能精心地去呵护田地呢？</span></p><p><span>“壮者以暇日修其孝悌忠信。”暇日就是闲暇的时间，青壮年在空闲的时间，可以去学习孝悌忠信，如果大家的税收很重，百姓的压力很大，又要服兵役，又要服劳役，田地没有人去精耕细作，更没有时间去学习孝悌忠信之道。</span></p><p><span>这里提到的壮年很重要，古时候和现在不一样，那个时候整个社会的发展，都是要靠青壮年的。比如说行军打仗要靠青壮年，耕地要靠青壮年，所以他是整个国家的支柱，这些支柱要学习孝悌忠信之道，如果这些人不懂得孝悌，不懂得忠君爱国，不讲诚信，可以看到一个国家会是什么样子？</span></p><p><span>所以我们再看这里，孟子告诉给梁惠王的次第，要去施仁政于民，减少刑罚，减轻税收，这个时候大家的生活，就会富足稳定，然后精工细作，再去学习更多的文化，孝悌忠信之道。</span></p><p><span><strong>“入以事其父兄”，</strong>这就是孝悌之道。说在家里的时候，要尊敬自己的父母兄长。“出以事其长上”，说在外面的时候，会懂得侍奉自己处上位的人，自己的国君，自己的领导，这也就是忠信之道。</span></p><p><span>所以如果要想施仁政，首先是让百姓富足，时间有余，就可以精心的呵护田</span><span>地，可以学习孝悌忠信，家庭就是和睦的，社会就是和谐的，人人有情有义，这是一种其乐融融的状态。</span></p><p><span>可是如果不实行仁政，就如魏国当下的现状，是民不聊生的，人人内在并没有什么样的情义，更不会有孝悌和忠信，因为连自己的生命都没有办法保障，温饱都没有办法解决，要怎样去孝悌和忠信？</span></p><p><span>可是要施仁政呢，呈现出来的画面是和谐的。如果呈现出来的是人人都幸福，那大家势必要捍卫自己当下的生活，如果魏国的百姓有情有义，家家是富足的，那么人人都想要保家卫国，保护好现在得来不易的幸福。</span></p><p><span><strong>“可使制梃以挞秦、楚之坚甲利兵矣。”</strong>这里做了一个对比，制梃就是制作举着木棍，以挞，挞是打。秦楚之坚甲利兵矣，坚甲指的是坚硬的盔甲，利兵就是锋利的兵刃，如果人人都是幸福的，就会珍惜当下，得来不易的幸福生活。举着木棍就可以打击到，秦楚的坚甲利兵。</span></p><p><span>虽然武器并不好，拿着木棍就可以了。所以这里讲到的是，内心强大的力量，因为人人生活是幸福的，是有情有义的，这种内心的力量会极其强大。即使我们没有好的兵刃，也可以打败那些拥有坚甲利兵的国家军队。</span></p><p><span><strong>“彼夺其民时，使不得耕耨，以养其父母；”</strong>这里的彼指的是秦国和楚国，以及更多的其他诸侯国，彼夺其民时，因为在战国这个时期，不只是梁惠王好战，其他的国家也好战，大家不停地想要去吞并和扩张，所以才称之为战国。那么好战就会不施仁政，所以叫彼夺其民时。</span></p><p><span>因为梁惠王如果这里实行仁政，而其他的国家并不实行仁政，他就是在夺其民时，因为要服劳役、服兵役，要出兵打仗，要交重税。这个时候，他是没有时间去耕种的，百姓自然是怨声载道的，越是这样，越是难能可贵。</span></p><p><span>因为别人都不施仁政，如果梁惠王可以实行仁政，会有更多的百姓，想要来到魏国，过富足的生活。当下生活在这里的人，会珍惜这种幸福，捍卫自己当下的幸福，那么秦国和楚国，即使有坚甲利兵，又能如何呢？</span></p><p><span>我们举着木棍，就可以把他打败，因为夺其民时，不得耕耨，他是没有时间精耕细作的，没有时间去打理自己的田地。以养其父母，他是没有办法养活自己的父母的。当不能去养活自己的父母，不能去尽孝，自己也解决不了温饱的问题，这个时候人的心念会动摇的。</span></p><p><span>他并不愿意真的去攻打其他的国家，他也并不愿意去保家卫国。父母冻饿，兄弟妻子离散，就会导致这样的结果，因为没有办法种田地，所以父母就是挨饿受冻的，兄弟妻子都会离散。</span></p><p><span>这里举了几个例子，说了我们身边最重要的人，父母，兄弟，妻子，如果一个人，不能解决温饱的问题，不能让自己的家庭生活得更好，妻离子散，人又怎么会有幸福可言呢？又怎么愿意真的出去打仗呢？</span></p><p><span><strong>“彼陷溺其民，王往而征之，夫谁与王敌？”</strong>我们看这里的陷和溺，陷是深陷痛苦之中，溺是陷入其中，并且无力挣扎，无力抵抗。说那个时候其他国家的百姓和民众，深陷痛苦之中，并且没有力量去挣扎和摆脱。</span></p><p><span>王往而征之，我们注意这里的征，正义的称之为征。那个时候其他国家的百姓，在痛苦当中无法自拔，这个时候大王您起兵而征之，这是正义的，救黎民于水火之中。夫谁与王敌，谁能与王去匹敌？</span></p><p><span>我们整个看这一段，这个就是尧、舜、禹、文王、商汤，得天下的根本之所</span><span>在。我们去看周朝的文王和武王，就是因为天下无道，百姓受苦，所以文王才会有很多百姓来投奔，他可以占商朝三分之二的土地。</span></p><p><span>到了武王开始伐纣，就是因为百姓民不聊生，深陷痛苦当中，无力抗争，这个时候率兵称之为征之，天下百姓自然就是归附的。我们讲商汤也是如此，夏桀是夏朝的最后一位君王，可是荒淫无道，暴虐无道，所以天下百姓民不聊生，这个时候起兵而征之，天下自然就是归附的。</span></p><p><span>所以我们可以看到儒家，孔子，孟子所讲的，仁政的力量，就在这个地方。如果真的愿意去施仁政，假以时日，这里的百姓生活是幸福的，是有情有义的，自然会珍惜幸福，保家卫国。</span></p><p><span>而其他的国家，他会不停地想要去战争，可是会导致民不聊生，这个时候起仁义之师，自然可以征之，没有人可以与您去匹敌。</span></p><p><span><strong>故曰：“仁者无敌。”王请勿疑。</strong>所以说得出来一个结论，仁者是无敌于天下的。王请勿疑，请大王您不要迟疑，不要怀疑。</span></p><p><span>我们看王请勿疑这四个字，我们讲到梁惠王，可以把自己的耻辱，把自己的痛苦，讲给孟子来听，说明他已经有底气，知道解决问题的方案，只不过需要孟子，更加笃定的告诉给他，仁者无敌的。</span></p><p><span>我们从开篇就讲义利之辩，孟子就告诉梁惠王，仁义而已矣。所以一直在讲，仁者无敌的思维，到这里告诉王请勿疑，您不要怀疑，您听到的这些思维，不要怀疑您自己的想法，仁者就是无敌的。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑤-3 仁者无敌",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑤-3 仁者无敌</strong></span></p><p><span>我们上一讲讲到，梁惠王与孟子之间的对话，梁惠王把自己内心痛苦的，觉得耻辱的事情，对孟子来讲，请求孟子的帮助。</span></p><p><span>同时也讲到，当一个人愿意把内心最耻辱的事情，讲给他人听，说明自己内心是有底气、有信心、有了解决的办法。这个时候只需要孟子给他更笃定。</span></p><p><span>所以最后孟子总结了四个字，仁者无敌。并且告诉梁惠王，王请勿疑，您不要去怀疑，不要去犹疑，仁者无敌这个思维方式。仁者无敌，可以治理好一个国家。</span></p><p><span>同时我们今天要去做延伸，仁者无敌可以解决，我们生活当中的一切问题。为什么会仁者无敌呢？他的理论基础到底是什么？这是我们今天要探讨的话题。首先我们去思考一个问题，当我们在危难之时，别人为什么会帮助我们，凭什么要帮助我们？</span></p><p><span>我们首先举例子，比如说梁惠王，当魏国发生危难之时，百姓为什么，凭什么一定要保家卫国？我们看这四个字，保家然后才是卫国。</span></p><p><span>因为这个家里有他的父母，有他的兄弟，有他的妻儿，他正在过着安逸美好、幸福的生活。所以这个时候，如果有敌人来犯，他会捍卫自己当下的幸福。</span></p><p><span>可是我们反过来想，如果民不聊生的，路上有那么多饿死的人，自己的温饱都解决不了，那他们怎么会去捍卫这个国家呢？因为他自己生活的并不幸福，他是怨恨的，这个时候自然不会出手相助。</span></p><p><span>我们再举个生活当中的例子，也是如此。比如说做生意遇到了困难，别人为什么愿意帮助我们呢？因为我们平时对他是仁德的，给他一些帮助，所以这个时候，他才愿意帮助我们。</span></p><p><span>或者讲的再现实明了一点，如果有人伤害我们，就等同于伤害了他们共同的利益，所以必然，有人站在我们的身后去捍卫。</span></p><p><span>比如说，如果梁惠王对百姓施的是仁政，这个时候有敌人来犯，伤害魏国，就是伤害所有百姓的利益，所以他自然出手相帮。</span></p><p><span>比如说我们在生活当中，是不是如此？如果我们是一个在生活当中，不停地帮助他人，有德行的人，比如说我们的朋友、同事、领导，我们的员工，我们的父母、孩子，平时我们都是帮助他们，给他们付出的，当我们遇到危难之时，所有的人都想要去帮我们，因为伤害了我，等同于伤害了他们所有人的利益。</span></p><p><span>我们看仁者无敌，到底什么叫仁呢？我们不停地时刻想着他人，时刻地在付出，时刻地在给予帮助他人，这就是仁。帮助的人越多，自然就处在，一种无敌的状态。</span></p><p><span>所以我们讲《论语》、《孟子》，可以看到尧、舜、禹、汤，可以看到文王、武王，为什么有那么多百姓，去拥护这些圣贤的君主？是因为他们时刻处在仁当中，他们一直在为百姓谋福利，所以有人伤害这些人，就是伤害所有百姓的共同利益。这个时候，我们伤害了百姓的利益，是不行的，所以大家自然会去保家卫国。</span></p><p><span>这里不禁要有一个疑问，爱国不是一种情怀吗，怎么还谈到了利益？我们去想这个情到底从哪里来？它是在帮助了别人的基础之上，我们利益了别人的基础之上，感情由此升华。</span></p><p><span>比如说，百姓生活的很幸福，这是他得到了利益，在这个利益之上，自然就是有爱国的情怀的。可是百姓如果生活得很痛苦呢，他是怨声载道的，又怎么愿意去保家卫国呢？</span></p><p><span>再比如在生活当中，如果我们对同事，对客户都是有帮助的，是利益到他们的，他这个时候对我们的感情，自然就会变得深厚。</span></p><p><span>夫妻之间不是这个样子吗？是我给他很多的帮助，利益到他了，比如说精神层面的，陪伴、关心、爱护；比如说物质层面的，更好的生活，是因为我们给了他，一些利益和帮助，在这个基础之上，自然会建立深厚的感情。</span></p><p><span>包括我们跟父母，不是一样的吗？说我可以给父母，提供很多的帮助，物质上的，可以改善他的生活，精神上的，可以给他一些陪伴、支持以及孝顺。这个时候，父母自然是重视我们的。</span></p><p><span>所以要清楚的知道，感情的深厚，是建立在我们帮助了对方多少，给了他多少利益的基础之上，所以情感是我们帮助他过后的，升华的部分。</span></p><p><span>我们又回到了仁字上，梁惠王作为一国的君主，有没有思考过，利益过多少百姓呢？他帮助过多少民众，帮助的百姓越多，百姓对他的感情也就会越深厚，就愿意去捍卫他的尊严，捍卫他的耻辱。</span></p><p><span>我们在生活当中，同样的道理，要想在危难之时有他人相帮。我们需要思考，平时我们付出了多少？我们是否有帮助到他人，自然就会有相应的人，愿意来帮助我们。</span></p><p><span>听到这里，或许还会有人有疑问，什么样的疑问呢？如果我对别人仁慈，帮助别人，他不懂得回报要怎么办呢？这里面要思考两点。</span></p><p><span>第一点，我们的付出，本来就没有想求得回报，因为当我们想求得回报，是有目的性的，有目的性，就会不纯粹。这个时候，别人可以清晰地感受到，所以是交换和索取，并不是真正的付出，更不是仁。当我们内心有仁德，只是单纯的想要付出，别人是否回报，那个并不重要。</span></p><p><span>第二点，每个人的性情有所不同，有的人天生热情，有感恩之心，而有的人天生薄情一点。我们不能因为薄情之人，影响了我们自己那颗仁爱之心。</span></p><p><span>总而言之，从大的规律上讲，就是仁者无敌的，我们帮助别人越多，付出的越多，当遇到危难之时，别人所回馈的就越多，自然无敌于天下。</span></p><p><span>讲完仁者无敌的理论思维，我们接下来，再要升华一个部分，也就是思考，思考和自己相关的事情。我们去想一想，自己的价值和意义，到底在什么地方呢？</span></p><p><span>还是从梁惠王开始讲起，梁惠王的价值和意义，到底在哪里呢？一个国家的君主，他的价值和意义，就是帮助了多少百姓，他给百姓带来了什么样的生活，那就是他的价值和意义。</span></p><p><span>我们进而再延伸，我们的价值和意义，在什么地方呢？看我们在人生当中，帮助了别人多少，带给别人什么东西。比如说，我要是做一个企业的人，我给这个企业的员工带来了什么，这就是我的价值和意义。我给我的客户带来了什么，这就是我的价值和意义。</span></p><p><span>如果我们作为一家之主，给这个家庭带来了什么，是陪伴、是呵护、是关心还是良好的物质基础，所以我们要在自己当下的基础之上，不停地去扩大，我们人生的价值和意义。</span></p><p><span>如果我现在只可以，照顾好我这一个家庭，这就是我的意义。如果说我照顾家庭，也没有那么大的能力，我可以照顾好我的孩子，那就是我当下的意义。所以我们在当下的意义的基础之上，不停地再去提升我们自己，去修那颗仁德之心，不停地想要去帮助和付出更多，我们的价值和意义，就会变得更大。</span></p><p><span>所以每个人的价值和意义，都是自己赋予给自己的。但是这里我们要学会去思考，才可能实现更多的价值和意义。比如说我的价值和意义是照顾好孩子，有的人的价值和意义，是为了做好工作，还有的人有更多的使命感。</span></p><p><span>比如说，我不能让这门手艺断了传承，那有的人说，我要去做一些前沿的开发，我要去为这个时代做些什么贡献，有的人说我要做文化的传承，几千年的文化，我不能让他没落，有的人要去引领时代的发展。</span></p><p><span>所以每个人的价值和意义，取决于有多少仁德之心，我们愿意去付出多少，愿意带给这个世界什么，我们愿意带给身边人什么，这些都是从人心出发，我们才可能生起的意义和价值。</span></p><p><span>我们最后再来做个总结，不光是梁惠王，要勿疑，我们每个人都不要去怀疑，不要去犹疑，仁者无敌这四个字，无论我们在社会的任何一个阶层，都是仁者无敌。</span></p><p><span>我们在家庭当中，如果我们懂得去思考，仁者无敌，我们去利益和帮助身边的每一个人，就会变得有更多人，愿意聚集在我们身边，愿意帮助到我们。如果我们是做生意的人，要去思考仁者无敌，我怎么带给我的客户，更多的帮助和价值，那也是我们自己的生命意义之所在。所以我们任何一个人都请勿疑，仁者无敌。</span></p><p><span>讲到这里，我们用《论语》的八个字来结尾，<strong>“其生也荣，其死也哀。”</strong>这是子贡对于孔夫子的概括，用了这八个字。</span></p><p><span>孔夫子他在世，其生也荣，我们会以他生活在跟我们同一个时期而光荣，我会以他是我们的老师而光荣。其死也哀，他离开这个世界，我们每个人都会觉得很悲伤，都会觉得很悲哀。就是因为孔夫子他所做的贡献，就是因为他的价值和意义，在帮助和影响身边的所有人。</span></p><p><span>我们这里不仅还要有一个思考，看看有多少人，因为我们其生也荣，其死也哀呢？如果身边的人，有我们这样一个人存在而觉得光荣，而觉得幸运，这是我们的价值和意义。</span></p><p><span>如果当我们有一天，离开这个世界上，会有很多人觉得悲伤，会有很多人觉得悲哀，是因为我们的离开，伤害到了他们的利益，伤害到了他们的感情。所以当我们这样去思考，就会清晰的知道，我如何才能去给予别人更多，如何才能付出更多，这就是那一个仁字。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑥-1 主动与被动",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》梁惠王章句上⑥-1主动与被动</span></strong></p><p><span><strong>孟子见梁襄王。</strong>梁襄王是梁惠王之子，孟子在见梁惠王之时，梁惠王已经到了八十岁的高龄。也就是在见过孟子之后，不久离世，梁襄王继位。</span></p><p><span>梁襄王继位，这个时候孟子正在魏国，所以孟子和梁襄王相见。这里我们要留下来一个问题，供我们去思考，到底是梁襄王想要去见孟子，还是孟子想要去见梁襄王？</span></p><p><span>这里面大有讲究，我们可能会想谁主动去见谁，真的有区别吗？有区别。它在我们生活当中，谁去主动区别也很大。我们先往下讲，最后我们再回头来思考，到底谁想要主动去相见？</span></p><p><span><strong>孟子见梁襄王。出，语人曰：望之不似人君，就之而不见所畏焉。</strong>孟子在见了梁襄王之后，出，也就是离开。语人曰，对他人讲了，对于梁襄王的评价，如何评价的呢？望之不似人君，望是远看，还没有接近梁襄王之时，远远的看上去不似人君，不像一个君主的样子。</span></p><p><span>我们先说不似人君，这里面有两个含义。第一层含义说，这个人没有架子，说一个圣明的君主，说看上去不似人君，指的是他很温和，很平和，所以说他没有架子。</span></p><p><span>我们在生活当中，也会有这样的看法，我们说领导看上去，不像个领导，我们可能是赞美和赞叹的。说这个人的态度特别平和，和别人接触很容易去交往。第二层意思，不似人君，就实在是不成个样子，没有一个君主的样子。</span></p><p><span>我们这里可以看到，孟子显然说的是第二个观点。说他看上去并不像个人君，我们说远观一个人，从他的行为举止，我们都可以看得到。比如说他的穿着，他的行为他正在做什么。</span></p><p><span>我们用文中这样一个场景，来体会，当孟子来见梁襄王，远远的看上去，他正在做什么呢？是庄重的等待着孟子的到来，还是和别人正在闲谈，或者是正在饮宴呢？他穿着了什么样的衣服呢？这些都可以对一个人的印象，做出很好的归纳。</span></p><p><span>我们从这里就要注意生活当中，我们自己的形象，言谈举止，都可以让别人对我们，有一个很直观的印象，这第一步叫望，接下来自然就是走进。</span></p><p><span>就之而不见所畏焉。就之就是接近，接近的时候发现，并不值得人敬畏。同时他也没有任何的敬畏之心。所以这里的畏，又是指孟子对他生不起敬畏之心，同时也是指梁襄王，他对别人，对一件事情，也并没有敬畏之心。这就是孟子，见过梁襄王之后，对他的印象。</span></p><p><span><strong>卒然问曰：天下恶乎定？吾对曰：定于一。</strong>我们注意这里的卒然，就是突然之间，毫无防备的发问。问什么呢，天下如何才能安定呢？重点来了，我们去看一看，梁襄王对于孟子的态度，卒然问曰，是没有任何的寒暄在其中的。</span></p><p><span>比如说梁惠王，在见到孟子之时，还是有称谓的。说叟不远千里而来，说老先生您不远千里而来，那我们可以看到，梁襄王并没有任何的称谓，卒然问曰，天下如何才能安定呢？</span></p><p><span>难道梁襄王不知道，天下能如何安定吗？不只是梁襄王，或许任何人都知道，天下如何能安定，统一了，自然就安定了。现在为什么天下动荡，民不聊生呢？因为战乱呢。因为每个国家，都在不停地去战争扩张，小国为了保卫自己不被吞并，所以天下才会动荡不安。</span></p><p><span>所有的人都明白一个道理，如果天下统一，自然就是安定的，所以孟子对曰，定于一，统一也就安定了。我们接下来再看，才是梁襄王想要问的重点。</span></p><p><span><strong>孰能一之？</strong>谁才能去让天下统一，是逐渐强大的秦国，还是富饶的齐国，又或是南面国土领域大的楚国，或者是我魏国，到底是哪个国家，才能去统一天下呢？这是梁襄王真正想问的问题。</span></p><p><span>通过这个问题，我们也可以看到，梁襄王的刁难，你孟子不是一个有智慧之人吗？那我就问问你有智慧的人，我问你一个最大最直接的问题，谁能统一天下？这个问题如何才能去回答呢？</span></p><p><span>你能说出是哪个国君可以统一天下吗？如果你认为齐国可以统一天下，你为什么要来到魏国呢？你要认为秦国可以统一天下，那你为什么不去秦国，难道你认为我魏国可以统一天下吗？显然不是的。</span></p><p><span>如果可以统一天下的人，甚至有决心去统一天下的人，绝不会问出这样的话。他会自己默默的强大自己，他会去实行自己的政治主张，以达到统一天下的结果。所以我们通过这些细节，可以看到，梁襄王对于孟子的刁难。我们用生活当中的事情来举例子。</span></p><p><span>当我们想要去刁难，一个人的时候，会问什么样的问题呢？我们会问一个，他根本就没有办法解决的问题，甚至问一个，他根本就没有办法回答的问题。我们接下来要回头来思考了，到底是孟子想见梁襄王，还是梁襄王想见孟子？我们这里可以得出结论，是孟子主动想要去见梁襄王，为何呢？</span></p><p><span>如果是梁襄王想要去见孟子，他自然是有称呼的，不会卒然问曰，他是有寒暄的，是有尊重在其中的，并且并不会去刁难于人。我们再看第二个细节，主动想要去做一件事情的人，他的记忆更深刻，并且感受更多。第一句话就讲了孟子的感受，孟子对别人讲，说梁襄王望之不似人君，就之而不见所畏焉，这是他对于梁襄王的感受和印象。</span></p><p><span>我们这里要来做一个延伸。我们去想一想，在生活当中，但凡是我们主动想要去做一件事情，我们的感受就会更多，付出的情感就会更多，我们的记忆会更加深刻。</span></p><p><span>我们举个例子，比如说两个人谈恋爱，主动的那一方，也就是用情至深的那一方，他会有很多的感受，他会记住很多的细节。举个例子，我是怎么爱上的这个人，我跟他在一起，我具体是什么样的感受；甚至我什么时候想牵他的手，什么时候不敢牵，有什么样的心理活动；在什么样特定的节日下，我跟他在一起经历了什么事件。</span></p><p><span>因为他是主动的那一方，所以他的感受就会很丰富，他的记忆会变得很深刻。但是我们问被动的那一方，他是没有太多感受的，当时我们这些心理活动，他会知道吗？被动的那一方并不清楚。</span></p><p><span>我们再举个生活当中其他的例子，也如此。比如说父母对孩子的爱，我们是主动的爱自己的孩子，所以就会有很多的感受，比如说从小到大，我是如何含辛茹苦的，去培养他；我在什么时候，有什么样的心情，对他具体付出了哪些行动。</span></p><p><span>我在他什么样的年龄段，甚至有什么样的心理纠结，心理活动，都可以很清晰地描绘出来；比如说什么时候失望，比如说什么时候想要放弃；比如说什么时候想要，我自己再努力一点，我们的心理感受和活动会非常多。可这个时候，要是问孩子，他并不清楚，他并不知道。</span></p><p><span>我们说其他的事情，在生活当中比比皆是，我们可以自己去思考，但是这里我们要做出一个结论，通常我们会有很多的抱怨。比如说我们主动的那个人，就会抱怨对方，说我明明给他付出了那么多的感情，他为什么就不懂得珍惜呢？说我对孩子付出我的所有，为什么孩子并不懂得感恩？</span></p><p><span>因为我们是主动的那一个，他是被动的那一个，所以他不知道，我们的这些感受是很正常的。我们这里要学会一个心理平衡，因为我们是主动的人，感受自然就会更多，我们没有必要去抱怨和心理不平衡，它是正常的状态。</span></p><p><span>正如在这一生当中，也会有很多人对我们主动，我们也是被动的那一个，我们也并不清楚，主动的人，他的感受以及他的心理变化。我们从这里再来延伸一点，我们要想让一个人感受变多，想让他的记忆变得更深刻，那么就要引导他，去主动的做事情。</span></p><p><span>比如说孩子，我们要引导他主动的去做事情，才会增加彼此之间的感情和他对我们的记忆。比如说和爱人之间也是一样，我们要想让他记忆变得深刻，要想让他感受变得更多，是我们引导他主动地去思考，主动地去做一些事情。这个时候他用情越多，感受就越多。</span></p><p><span>所以这是我们懂得，反过来应用的一个方法。比如说我们对员工也是如此，要想让他记忆变得更深刻，感受变得更多，我们就要学会引导他，让他主动的为这个企业，去担当什么事情，去付出什么事情，他自己的情感在其中，感受自然就会变得更多。所以这就是我们要讲，孟子和梁襄王，到底谁主动想要相见的意义之所在。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑥-2 天下定于一",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑥-2天下定于一</strong></span></p><p><span>我们看孟子，为何要主动的想见梁襄王，孟子无论见任何人，都是为了阐述自己的观点，都是为了要讲仁政，要讲仁爱之心，所以他身在魏国，当然要去见梁襄王。</span></p><p><span>见梁襄王，也是想讲自己的政治主张，想要说明自己的观点，但是见过梁襄王之后，对他的感受和印象并不好，说他看上去，实在是没有办法，让人生起敬畏之心，我们再继续来延伸一个细节，卒然问曰：天下恶乎定？突然问了一句话，天下如何才能安定？</span></p><p><span>我们可以看到其中的刁难，从刁难当中我们来延伸两点。我们去看孟子见梁襄王，我们把它总结出来，无非可能有两个原因，第一个原因是有求于人，第二个原因去帮助于人。我们先来看孟子，显然孟子是无求于梁襄王的，那也就是他来是为公，是为了给予他人的，是为了给，是告诉他仁政的重要性。</span></p><p><span>但是如果他是有求于梁襄王，也就是想要索取、是要的，当我们有求于人，就会变得卑微，有求于人就会起情绪，所以如果他是有求于梁襄王，面对梁襄王的刁难，就会不知所措，不知该如何去回答。</span></p><p><span>想一想生活当中的我们，是不是一样的，当我们是有求于人的，对方对我们并不尊重，来刁难于我们，这个时候我们会难过，我们会不太开心，会不知如何应对。可是我们去见一个人，并不是有求于他，甚至还想着去帮助他，我们是为公的，就不会起情绪，更不会难过，我们是坦然的可以去面对的，这个时候我们讲出来的话，就是铿锵有力的。</span></p><p><span>所以接下来，梁襄王就问到孰能一之，谁能统一天下？</span></p><p><span><strong>对曰：“不嗜杀人者能一之。”</strong>不喜欢杀人的人，就可以统一天下。所以没有具体讲，梁襄王想要问的，具体谁能统一天下，是齐国、是楚国、是秦国还是我魏国，孟子讲谁都不是。不好杀的人，可以施行仁政的人，就可以统一天下。所以我们可以看到，孟子自己的观点，是非常的明确，面对梁襄王的刁难，很直接的去讲自己的观点。</span></p><p><span><strong>“孰能与之？”</strong>梁襄王的又一个问题出现了，与是跟随的意思，谁能跟随他呢？我们要注意这句话了，梁襄王刚开始问的是孰能一之，谁能统一天下？孟子说不嗜杀人者能一之。接下来梁襄王说孰能与之？也就是在问不好杀人的人，谁能愿意跟随他？</span></p><p><span>我们可以看到，在梁襄王的思维当中，只有强大的好杀人的人，才会有人愿意去跟随。我们听一听，这是多么可怕的思维和想法，我们学习了圣贤文化的人，我们学习过《论语》，学习了《孟子》，我们这里一看，就知道梁襄王的思维，这不是有问题吗？他认为好杀人的人，才会有人跟随。</span></p><p><span>我们看孟子如何讲？<strong>对曰：“天下莫不与也。”</strong>天下所有的人，都愿意跟随不好杀人的人。我们可以看到，孟子和梁襄王的思维，完全相反，梁襄王认为自己强大了，好杀人，才会有人跟随。而孟子说，你施仁政，不好杀人的人，天下没有人不愿意跟随这样的人。完全是两个相反的方向，我们从这里要延伸到生活当中。</span></p><p><span>我们自己来回看一下，自己学习圣贤文化的结果，是不是和绝大多数人的想法，完全相反？比如说大家都在讲利，都在讲好处，都在讲索取，可是我们学习了，圣贤文化之后，讲仁义而已矣，在讲付出，在讲德行，在讲给予。</span></p><p><span>比如说，没有学习圣贤文化的人，他都在想着如何得到更多，学习了圣贤文化以后，我们在想着如何给予和帮助他人，没有学习圣贤文化的人，在想着如何谋食，如何拥有更多的财富。而学习了圣贤文化，我们在想谋道不谋食，忧道不忧贫，我们在想着如何才能合于道，我如何才能帮助更多人？</span></p><p><span>比如说在夫妻感情当中，也是一样，没有学习圣贤文化的人，都在想着如何去索取，都在指责对方，抱怨对方。而学习了圣贤文化，我在想着包容对方，反求诸己，我在想着如何付出，我怎样可以对他更好，所以这是学习和没有学习的人，完全相反的两个思维方向。</span></p><p><span>我们这里再来看，梁襄王的思维，他认为只有嗜杀者，只有自己强大的人，才会有人愿意去跟随。那由此可见，孟子对于他的评价，望之不似人君，就之而不见所畏焉，他实在没有让人值得敬畏的地方。我们再去思考，梁惠王和孟子之间的对话，梁惠王还在问，说如何才能让百姓增加呢？他的心中还有百姓，还有民众，可是到了梁襄王这里，完全没有想过百姓。</span></p><p><span>他在想的是谁能统一天下，进而想的是不嗜杀人的人，怎么会有人跟随，所以才有了孟子对他的印象。我没有办法，去敬畏这位梁襄王，同时他也实在没有敬畏之心，无论是他自己为人君的位置，还是他对待百姓，他都没有一颗敬畏之心，接下来又到了熟悉的环节，孟子要举例子了。</span></p><p><span>这里举了一个很简单的例子，所有人都明白的道理，通过这个道理以及例子，告诉梁襄王，为什么不嗜杀人者，天下莫不与也，只有不好杀人的人，天下没有不愿意，跟随这样的君主的，我们看这个例子是怎么讲的？</span></p><p><span><strong>“王知夫苗乎？七八月之间旱，则苗槁矣。”</strong>说大王，您知道禾苗吧，七八月之间旱，则苗槁矣，七八月之间缺雨水，干旱的，这个时候的禾苗是枯槁的。我们这里要提一下，七八月之间，在战国时期用的是周历，周历是以十一月为正月，也就是七八月，比我们现在的节气要早两个月，也就是相当于五六月份的时期，在五六月份，禾苗是很小的，并且这个季节容易出现干旱。我们现在用的是夏历，也就是夏朝的历法。</span></p><p><span><strong>“天油然作云，沛然下雨，则苗浡然兴之矣。”</strong>油然指的是聚集在一起，说云彩突然聚集在一起，沛然下雨，指的是雨量，非常的充沛充足。则苗浡然兴之矣，云彩突然聚集，并且雨水很充足，这个时候禾苗浡然兴之矣，浡然是指的生机勃勃，兴就是生长。</span></p><p><span>我们去体会一下，这样一个状态，当禾苗很小的时候，遇到了干旱，这个时候，突然下了充沛的雨量，禾苗它是生机勃勃地在生长，舒展开来的样子。</span></p><p><span><strong>“其如是，孰能御之？”</strong>如果是这个样子，谁能去阻挡的住，这里指的是阻挡禾苗的生长，你可以阻挡其中的几颗禾苗，也可以挡住其中一片禾苗，不让它接受雨水，但是你可以挡得住，全天下的禾苗去生长吗？你能挡得住他舒展开来的样子吗？我们看这里，孟子是意有所指的，孟子把禾苗比作了全天下的百姓。</span></p><p><span>现在天下的百姓，就像干旱的禾苗，它是枯槁的状态，没有生机的状态。如果这个时候有不嗜杀人者，就相当于是这场及时雨，它会让全天下的百姓，升起蓬勃的信心，自然全天下的百姓，就是来归顺的。孰能与之，这个时候，谁又能阻挡这些百姓前来归顺呢？</span></p><p><span><strong>“今夫天下之人牧，未有不嗜杀人者也；”</strong>说如今天下的君主，没有不嗜杀人者。这里我们要注意的是，人牧这两个字，人牧指的是治理天下的人，治理人民的人，这里代指君主。我们通常看什么情况下才用牧呢，比如说牧羊放羊的状态，所以孟子用了人牧，其中牧字也是意有所指的。</span></p><p><span>现在全天下的君主，都是嗜杀的人，他并没有把百姓当人看，并没有古代人君的样子，爱民如子，你并没有精心的去呵护它，你只是让他去创造，让他去为国打仗，让他去种田去收税，所以说这里用了人牧。</span></p><p><span><strong>“如有不嗜杀人者，则天下之民，皆引领而望之矣。”</strong>这个时候，如果有不嗜杀人者的君主，则天下归之，天下的百姓都会来归附的。引领而望之矣，引领指的是伸长了脖子，望是期盼，期望等待。如果有不嗜杀人者的君主，这个时候全天下的百姓，都伸长着脖子在等待，在盼望着，想要去归顺这样的君主。</span></p><p><span><strong>“诚如是也，民归之，由水之就下，沛然谁能御之？”</strong>如果能做到这个样子，百姓自然去归顺。由水之就下，沛然谁能御之，这里又打了一个比方，如果现在的君主有不嗜杀人者，天下的百姓，都伸长着脖子在等待，自然会来归顺。</span></p><p><span>好像是水往下流，沛然谁能御之，沛然充沛的，充足的，来势汹涌的，势不可挡的，就像水来势汹汹，势不可挡。谁能御之呢？没有任何一个人，可以挡得住天下的，百姓来归顺的心，没有人可以挡住这种势头。</span></p><p><span>通过这段话也可以了解到，战国那个时期，不只是梁襄王如此，人人都嗜杀，君主都好杀戮，想让百姓对自己产生畏惧，出去战争可以去服劳役。所以这个时候，孟子提出仁者无敌，孟子要讲仁政，如果在这个时期，有君主可以去实行仁政，可以不嗜杀，百姓就像干旱枯萎的禾苗，遇到了这种雨水，它是可以舒展的，可以幸福的生活，可以有蓬勃发展的生机。</span></p><p><span>所以如果有君主懂得这样去做，就像水往下流一样，百姓就会来归顺，没有什么人和事，可以阻挡他人的归顺。整个孟子和梁，襄王之间的对话，我们讲完了。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑥-3 势不可挡",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑥-3 势不可挡</strong></span></p><p><span>孟子和梁襄王之间的对话，讲完之后我们再做两点延伸。第一点延伸，我们先来做一个对比，处上位的人，那个时候叫君主，我们看君主和处上位的人，如何对待百姓和处下位的人？</span></p><p><span><strong>第一种方式亲之，誉之，爱之；第二种方式畏之，惧之，怕之。</strong>我们先讲亲之和誉之，如果百姓对于处上位的君主，是愿意亲近的，是誉之，也就是赞誉他的，是爱戴他的。另外一种对比是畏惧他的，害怕他的。</span></p><p><span>我们看梁襄王的思维，认为如果不嗜杀，那么谁能跟随于我呢？也就是只有惩罚，甚至是杀人，建立自己的这种所谓的威严，是不是百姓才能害怕，才会有人为国出力，才会有人服劳役，才会有人去种田呢？这就是畏之，惧之和怕之。</span></p><p><span>还有一种君主处上位的人，就是施仁政的人，施仁政的人，别人是愿意亲近于他的，并且对他充满了赞誉，是爱之的爱戴的。比如说我们学习《论语》，学习《孟子》，讲的尧、舜、禹、汤，文王、武王，这样圣明的君主，施仁政的君主，百姓都是亲之，誉之，爱之的。</span></p><p><span>相反出现了很多的暴君，比如说我们讲过的夏桀，商纣王，战国这个时期的君主，百姓对他是怕的，是畏之，惧之的。</span></p><p><span>我们举生活当中的例子，来体会这番话，在生活当中，我们或许会处于领导的位置，再比如说我们会为人父母，这都是处上位，当我们处上位之时，我们就要去思考了，我是想让我们处下位的员工以及孩子，对我是亲之，誉之，爱之的，还是想让他畏之，惧之和害怕于我们的，这是两种截然不同的结果。</span></p><p><span>如果大家愿意亲近我们，才可以团结这些力量，如果大家是赞誉我们的，我们之间才会有情感的链接。如果别人是爱戴我的，当我遇到困难之时，大家会愿意和我一起去面对。</span></p><p><span>即使是对我们的孩子也是一样的，如果他愿意亲近我，提到我，他是觉得骄傲的，觉得赞誉的，这个时候，我们和孩子之间的感情，自然会变得更好，我们彼此是爱护的，这个时候才会有力量，家庭才会和谐。我们这种情感的基石，才会更加的稳固。</span></p><p><span>相反，如果我们只是用自己的权威，去压迫别人，让别人对我产生畏惧，他们只会想躲，想离开我们更远。这个时候，我们哪来的情感的链接？</span></p><p><span>就以孩子来举例子，如果孩子是畏惧父母的，他就想躲想远离，当孩子有什么心事，他是不敢跟父母讲的，甚至还有的孩子，会选择离家出走，为什么？因为他不敢跟我们讲，他是害怕我们的，是畏惧我们的，即使有心事，有不开心，他又怎么敢说呢？</span></p><p><span>所以在生活当中，这是非常实用的道理，如果要想让别人亲之，誉之，爱之，我们就要懂得施仁政，我们要仁爱的对待他人，如果我们要想别人对我们畏之，惧之，怕之，我们就可以用一些规范标准和惩罚，我们对他惩罚的越多，他自然就会畏惧于我们。</span></p><p><span>比如说对于孩子，我们可以对他有很多的要求，有很多的规范，然后有很多的惩罚，这个时候他就害怕我们。那么说做一个企业是一样的，我们规范的越多，标准的越多，我们惩罚的越多，他就会越惧怕我们，这就形成了两种鲜明的对比。</span></p><p><span>我们再来延伸第二点，这里讲到当禾苗干旱之时，沛然下雨，这个时候禾苗就会茁壮的生长，生机勃勃，舒展开来，孰能御之？这是势不可挡的，没有任何人可以阻挡。</span></p><p><span>这里我们的观点要讲到一个字，叫势。我们经常提到势不可挡，势如破竹，这个势字在我们生活当中，非常重要。我们在平常的生活当中，时时刻刻都会用到这个势字，我们用一句话来概括这个势字，势是力量，惯性的趋向。</span></p><p><span>注意这句话，力量惯性的趋向，首先它是一种力量，这种力量是极其强大的，那我们接下来讲惯性，什么叫做惯性？就是我们之前在做着什么事情，就会形成了现在的惯性，这种力量加上过去所做的事情，形成现在的惯性，就会有了未来的趋向。</span></p><p><span>我们先来举个例子，比如说风，我们称之为势，那风是如何形成的？太阳照射地面，这个时候地表就会升起热度，这个热度上升，就会遇到冷空气，冷空气遇到热量，就会横向移动，这个时候形成了风。风是由于各种条件组合，形成了这种势。</span></p><p><span>我们要举例到生活当中来了，我们先用一个曲线图，来讲这个道理。我们说几个点就会形成一个线，比如说这里有一个点，这里有第二个点，这里有第三个点，这个时候就形成了线，我们可以看到，这个线的趋势是往上走的。</span></p><p><span>相反如果这里有个点，这里有个点，这里有个点，同样会形成一条线，但是这条线的势，就是往下走的，我们显而易见，当出现第四个点的时候，是不是原来的惯性，就会有了一个趋向。</span></p><p><span>这个就形成了，是这里，重点来了。比如说，我们要想让自己变得博学多识，我们就要平时积累势，说每天进步一点，每天进步一点，最后就连成了线，这个就叫做势。</span></p><p><span>比如说，我们想让自己的身材变得更好，平时多锻炼，积累一点点，那么这些点就会连成一条线，这个线就形成了势。比如说我们工作也是如此，我们要想让自己的事业变得更好，那么我们就平时积累多个点，让它不停地呈上升的趋向，这个时候就形成了势。</span></p><p><span>再比如说，我们和别人的感情也是如此，我们平时要多付出，给对方一些情感，多付出一些关怀和帮助，这个点积累的多，就形成了势。感情是不停地升温的，我们相反也是如此。</span></p><p><span>比如说，我们今天给别人造成一点伤害，今天我们对别人，有过多的指责和苛求，这个点形成的多，就变成了下降的趋势。会让我们的感情，变得越来越薄弱。我们说一个人的状态，也是如此，如果我们每天都是精进的，都是积极的，这个点多了，就形成势。我们会一直保持精神的状态，积极的状态。</span></p><p><span>可是如果我们要任自己的情绪，沉沦下去，我今天有一些抱怨，明天有一些不开心，后天有一些消极，这个点多了，就形成了我们的状态，不停向下走的这种势头。所以说生活当中，无论遇到什么事情，我们都要学会自己去调整这个势。因为这个势，一旦下降到一定的程度，我们是很难再去改变的。</span></p><p><span>我们举一些历史当中的例子，比如说历史当中带兵打仗，如果一个军队是经常胜利的，这个时候就有士气，当士气上来以后，攻无不克，战无不胜。所以一个优秀的将领，都是要学会调整士兵的士气，他不停地需要一些小的胜利，然后不停地来激励士兵的这种士气，当他的士气达到一个顶点，就可以以少胜多，以寡敌众。但是如果他的士气，长期处在下降，就会到一个低迷的状态，即使兵多将广，同样会失败。</span></p><p><span>我们在生活当中，做一件事情也是如此。当我们激情满满地去做一件事情，势如破竹，我不怕苦不怕累，我可以面对一切困难。可是自己整个情绪和状态，如果是处于低迷的势，就会持续下降，会让我们产生自卑不自信，就没有办法，去做成一件事情。所以这里我们要学会平时遇到事情，要不停地去调整自己的势。</span></p><p><span>如何调整？我们再做一个总结，就是不停地去积累，由多个点形成线，最后这个线，就是力量惯性的趋向。因为它本身是一种力量，惯性是由于我们点点滴滴，积累而来所产生的。然后力量加上这个惯性，就是我们未来的那一个走向，所以无论是学习，感情，事业，工作，包括我们自己的身材，包括我们自己整个人的状态，都是有这个势在的。</span></p><p><span>我们这里再举一个例子，生活当中可以用得到，比如说，关于我们家里是否可以存下钱这个事情，它也是一种势。比如说每个月，我们赚多少钱并不重要，但是无论赚多少钱，都要存下一部分。这个时候一点一点的存，我们的势就会向上，这个时候聚集的财富，就会变得更多。</span></p><p><span>相反，我们现在很多人都是月光族，每个月无</span><span>论赚了多少钱，到月底的时候，这个钱都还完了，长此以往，它就形成了势。一旦我们手里有钱，就会有事情，让他花掉，一旦手里有钱，就会有事情，让他花掉，因为我们形成的势，就是如此。</span></p><p><span>所以我们在生活当中，切记这一点，无论我们赚多少，每个月要让它有存余，并且最好是逐步的上升的，那个点是往上走的，最后就形成了势。以此类推，我们生活当中，任何一件事情都如此。</span></p><p><span>我们想让这件事情变得更好，要学会蓄积能量，也就是积累这个势。形成了势，他是自己奔着趋向就去了，不需要过多的努力，是自然而然所形成的结果。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-1 保民而王",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-1保民而王</strong></span></p><p><span>接下来的内容，来自于孟子，与齐宣王之间的对话。</span></p><p><span>我们这里先讲一下，齐宣王是齐国的君主，在位十九年，在位期间，齐国是有短暂的兴盛阶段，并且齐宣王在位期间，做了一件对后世文化的传承，非常有意义的事情。齐国有一个稷下学宫，稷下学宫在齐桓公期间，就已经有了雏形，到了齐威王时期，开始启用、创建，但是到齐宣王这个时候，把他发扬光大。</span></p><p><span>这个时候的稷下学宫，是非常兴盛的，鼎盛时期，有数千人在这里讲学，并且聚集了当时的诸子百家，诸子百家也就由此开始形成。里面有很多的名人在这里讲课，讲自己的政治主张，其中就包括了孟子。</span></p><p><span>并且在稷下学宫，有很多书籍，从这里开始流传，比如说《管子》是在这个时期，由管子的学生们、受益者、传承者所编写，再比如说，《晏子春秋》等等。所以当时有名的人，有自己的政治主张和思想的人，都会来到稷下学宫讲学，并且在这里可以交流，探讨彼此的学问。</span></p><p><span>而且齐宣王非常重视这件事情，对这些人都是厚礼相待的，其中有七十多人，是被齐宣王授予卿位，上大夫，不任职但是可以论国事，也就是在齐国，他并不需要做具体的事情，但是却可以议论齐国的政事。</span></p><p><span>我们可以看到，他对这些学者，有自己思想的人，是非常的重视以及认同的。所以我们从这里就可以看出，他是一个重视学问，重视思想的人，故而齐国在他在位的期间，会有短暂的兴盛。但是后来发生了一件事情，齐国想要去攻打燕国，在攻打燕国期间，齐宣王曾问过孟子，是否可以去攻打燕国呢？</span></p><p><span>孟子是这样讲的，如果是燕国的百姓，欢迎大王您去，那么就可以去攻打燕国，可是如果百姓不欢迎，就不能去攻打。我们要仔细的去体会这句话，这是孟子的学说当中，非常重要的一点。</span></p><p><span>百姓欢迎您，说明您施的是仁政，说明是保民的政策，是与民同乐的。如果百姓欢迎支持您，您去攻打燕国，自然是可以得胜的。可如果百姓不支持，不欢迎您，即使能攻打下燕国的城池，又能如何呢？百姓会反抗的，最后您没有办法治理这个地方，只会给自己带来很多的隐患。</span></p><p><span>后来齐宣王去攻打了燕国，本来齐国攻打燕国，速度非常快，仅用五十天的时间，就打下了燕国。但是攻打下燕国的城池以后，开始屠戮百姓，杀其父兄，烧其宗庙，这个时候，百姓自然是愤恨在心的，开始奋起反抗，并且联合其他的诸侯国，一起来对抗齐国，齐国因此大败，并且从此以后开始衰落。</span></p><p><span>孟子曾经前后两次，来到齐国讲学，讲自己的政治主张，从齐威王的时期，孟子就已经来过，那么第二次，就是齐宣王在位期间，因为孟子认为齐国是最有可能实行仁政的地方，齐国本身就是强大的，并且又开办了稷下学宫，他是重视思想，重视文化的地方，所以孟子对齐国抱有很大的期望。</span></p><p><span>可是经此一战，齐国开始衰落，孟子也因此离开了齐国，并且从此以后，也没有再继续周游列国，也就是齐国是孟子周游列国的最后一站。因此也对这件事情，表示了失望。看来是没有人，可以真正的去推行仁政，最后也是著书立作，把自己所学的文化知识，传承了下来。我们接下来看一看，齐宣王和孟子之间的对话。</span></p><p><span><strong>齐宣王问曰：“齐桓、晋文之事，可得闻乎？”</strong>齐桓指的是齐桓公，晋文指的是晋文公，齐桓公和晋文公，是春秋时期的两位霸主。春秋共有五位霸主，第一位称霸的就是齐桓公，第二位是晋文公。我们这里看齐宣王的问题，他问齐桓公和晋文公之事，可得闻乎，你知道他们的事情吗？</span></p><p><span>我们通过这个问题，可以看到齐宣王在想什么，他是想问齐桓公和晋文公，是如何称霸的？那言下之意，齐宣王是想要称霸于诸侯之间的，所以才想问一问，知不知道他们具体是怎么称霸的，也可以让我去称霸呢？我们看孟子是如何回答的。</span></p><p><span><strong>孟子对曰：“仲尼之徒，无道桓、文之事者，是以后世无传焉，臣未之闻也。”</strong>孟子讲到，说仲尼之徒，也就是孔子的门人弟子，没有去讲，也没有传承下来，齐桓公以及晋文公的事件，所以说我们是没有学习过这些事情。</span></p><p><span>从这段话当中，可以看到两点。第一点，春秋到战国那个时期，是孔子和他的门人学生，在记载着当时的事情，也就是孔子的门人弟子，没有人去记载，所以这些事情，就没有具体的传承下来。我们看到第二点，孟子对于孔子的推崇，因为仲尼之徒，没有传这些事情，所以孟子就不会去学这些事情，也并不想去了解，为什么？</span></p><p><span>从孔子到孟子讲的都是仁政，而齐桓公以及晋文公是如何称霸于诸侯的。我们这里就要讲，称霸于诸侯和王道之间有什么区别呢？</span></p><p><span>称霸于诸侯，靠的是武力，靠的是某一方面的强大和强盛，就可以称霸于诸侯。但是王道则不同，王道推行的是仁政，是以道德治理国家，比如说尧、舜、禹，比如说文王，比如说周公，这是孔孟所提醒的王道，而不是霸道，不只是称霸于诸侯。</span></p><p><span>所以孟子讲，臣未之闻也，我没有听说这些事情，当然我也没有学。这里我们还要注意一个细节，齐宣王与孟子的对话，孟子说臣未闻也，就是以臣自居，为什么呢？因为在齐国讲学，齐宣王是授予孟子卿位，上大夫之俸禄之礼待。</span></p><p><span>所以说我们可以看到，齐宣王对孟子是非常尊重，以及认同的。孟子讲他没有听说，更没有去学习齐桓公和晋文公，具体称霸的事情，但是我却可以给您讲一讲王道，故而接下来说。</span></p><p><span><strong>“无以，则王乎。”</strong>如果您一定要知道，那我可以给您讲一讲王道，如何称王天下？齐宣王本来的问题，是想要学习如何称霸，也就是想在战国这个时期，称霸于诸侯，并没有想过一统天下，也没有想过让天下归附。这里孟子提到了，我可以给您讲一讲，如何统一天下？我们看齐宣王，是如何思考这件事情的？</span></p><p><span><strong>曰：“德何如，则可以王矣？”</strong>需要有怎样的德行，才可以称王天下？我们看齐宣王的想法，首先知道称王天下是好的，可是这里要有一个疑问了，什么样的德行，才可以称王天下，我的德行够吗？为什么齐宣王只问齐桓和晋文之事，并没有问其他更圣贤的君王呢？比如说尧、舜，比如说文王。</span></p><p><span>这里齐宣王知道，自己并没有那么大的德行，我只想称霸于诸侯，并没有想去实行仁政，去让天下的百姓受益。只是这里孟子主动提出，可以给您讲一下，如何称王于天下？那么齐宣王进而就问到了，那需要什么样的德行才可以呢？</span></p><p><span><strong>曰：“保民而王，莫之能御也。”</strong>孟子讲其实很简单，保民就可以称王天下，并且没有任何人可以阻挡，保民也就是孟子所讲的仁政。如何去爱民如子，如何去保障百姓安居乐业，就可以了。</span></p><p><span><strong>曰：“若寡人者，可以保民乎哉？”</strong>齐宣王接着问道，像我这样的人，可以做到保民吗？曰：“可。”孟子告诉他，可以，您是可以做到保民的，也就是可以用仁政来称王于天下。</span></p><p><span><strong>曰：“何由知吾可也？”</strong>这里齐宣王继续问到，您怎么知道我可以的，凭什么我是可以的？我们这里可以看到，齐宣王是一个有智慧的人。他在问为什么认定我是可以的？他不是盲从别人讲话的人，他会有自己的思考在其中。从最开始问齐桓公、晋文公之事，是想问自己如何才能称霸于诸侯？</span></p><p><span>可是孟子讲，他不知道，但是却可以讲王道。这个时候齐宣王又问，需要什么样的德行，才可以称王？所以我们对比之前的梁惠王与梁襄王，齐宣王显然他更有智慧，而且他更可以看到问题的核心，他也明白，要想称王天下，需要有德行。</span></p><p><span>进而孟子讲到，只要保民就可以称王，接下来齐宣王又问，像我这样的人可以保民吗？孟子讲，可以。齐宣王进而又问，您说可以这不行，得告诉我具体什么地方可以，为什么我是可以的呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-2 不忍即仁",
    "author": "虚空先生",
    "date": "2022-07-24",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-2不忍即仁</strong></span></p><p><span>孟子为什么说齐宣王是可以保民而成王的呢？</span></p><p><span><strong>曰：“臣闻之胡龁曰：王坐于堂上，有牵牛而过堂下者，王见之，曰：牛何之？对曰：将以釁钟。”</strong>这里孟子说，我听胡龁讲过一件事情，说有一天王坐在堂上，有人牵着牛从堂下过，这个时候大王您问：牛何之？说这个牛是用来做什么的？牵牛之人说将以衅钟，衅是祭祀，这头牛是用来取血，祭祀钟的，就是这样一件事情。</span></p><p><span>我们不妨来思考一下，当我们看到这样一个画面，会想到什么呢，会不会做出什么样的决定呢？我们看看齐宣王，他接下来做了什么样的决定？</span></p><p><span><strong>王曰：“舍之！吾不忍其觳觫，若无罪而就死地。”</strong>看到这样一个场景，齐宣王讲了一段话，他说舍之，说放了这头牛吧，吾不忍见其觳觫，觳觫指的是瑟瑟发抖，恐惧发抖的样子。若无罪而就死地，因为这个牛，它并没有犯什么罪，可是它却要赴死，我实在是不忍心。</span></p><p><span>我们来体会一下这句话，当齐宣王坐在堂上，看到一个人牵牛而过，问这头牛是做什么的？说是祭钟的，这个时候齐宣王说，放了它吧，我实在不忍心看到它瑟瑟发抖、恐惧的样子，因为它并没有犯什么过错，而却要去就死。</span></p><p><span><strong>对曰：“然则废衅钟与？”</strong>这个时候牵牛之人讲了，难道我们要废弃祭钟这件事情吗？因为齐宣王让他放了这头牛，如果放了这头牛，就没有办法取血祭钟啊。</span></p><p><span><strong>曰：“何可废也？以羊易之。”</strong>不识有诸？说怎么能废弃呢？不能废弃祭钟这件事情。以羊易之，放了这头牛，用羊来替代。不识有诸，这四个字是孟子讲的，因为孟子是听说了这件事情，所以问齐宣王，不知道有没有这样一件事情呢？他在向齐宣王求证。曰：“有之。”齐宣王说是的，有这样一件事情。</span></p><p><span><strong>曰：“是心足以王矣。”</strong>说大王，您现在的这颗心，就足以让您称王天下。我们这里看为什么呢？当齐宣王看到了这头牛，他是没有罪的，却要让他去祭钟，而不忍心，这就是仁心。当有这种仁心，就可以去保民的。</span></p><p><span>百姓皆以王为爱也，臣固知王之不忍也。百姓以为您是不舍得，是吝啬，但是我知道您这是不忍心。王曰：“然！诚有百姓者。”是的，是有百姓这样议论的，有的百姓会说，齐宣王是不舍得，是吝啬，所以才以羊换牛。</span></p><p><span>齐国虽褊小，吾何爱一牛？即不忍其觳觫，若无罪而就死地，故以羊易之也。说齐国虽然很小，但是我又怎么会吝啬一头牛，即就是的意思，我就是不忍心看到它恐惧发抖的样子，好像没犯什么罪，而却要就死地。所以以羊易之，也就是以羊去换了牛。接下来我们就看到，孟子问了一个问题，问了一个什么问题呢？</span></p><p><span><strong>曰：“王无异于百姓之以王为爱也，以小易大，彼恶知之？”</strong>这里的无异指的是不必责怪，也不必奇怪，说大王您不必责怪百姓，以为您不舍得，以小易大，羊为小，牛为大，所以叫以小易大。彼恶知之，彼是指的他们也就是百姓。恶是何的意思，何以，怎么，他们怎么会知道呢？</span></p><p><span>王若隐其无罪而就死地，则牛羊何择焉？这里孟子的问题出现了，说如果大王您是因为牛没有犯过什么罪，而就死地，您却以羊易之，那请问牛和羊又有什么区别呢？因为羊也无罪，为什么您舍得去用羊，而不舍得用牛，区别到底是什么呢？</span></p><p><span>我们这里不妨也去思考一下，我们来回顾，因为齐宣王不忍用牛去祭钟，所以换成了羊，不忍心哪，那可是换成羊，难道就忍心用羊去祭钟吗？这里到底有什么区别？我们看看齐宣王，有没有想清楚这个问题？</span></p><p><span><strong>王笑曰：“是诚何心哉？”</strong>这个时候齐宣王笑了，他说这样一说，我也不知道，我这是什么心理，我也不知道我是怎么想的？这句话把齐宣王问住了，想一想是啊，我这是什么心理呢，难道牛无罪而就死地，羊就有罪了吗？为什么我不忍心用牛去祭祀，我却忍心用羊去祭祀，我不知道这是什么心理了？</span></p><p><span>接下来又说到，<strong>“我非爱其财，而易之以羊也。宜乎百姓之谓我爱也！”</strong>说我并不是因为爱财，才拿羊去换的牛，但是也难怪，百姓会认为我是爱财，为什么？因为连自己都想不清楚，这到底是一种什么心理？所以就难怪百姓，也是这样想的。</span></p><p><span>因为他解释不通，如果说是不忍心，可你换成了羊就忍心吗？所以说别人自然会认为，这是不舍得，是一种吝啬。接下来重点来了，我们看看孟子是如何回答的，这里的原因到底是什么呢？牛和羊到底有什么区别呢？为什么用牛，齐宣王不忍心，而换成羊，他又忍心了呢？</span></p><p><span><strong>曰：“无伤也，是乃仁术也。见牛未见羊也。”</strong>这个时候孟子讲，没关系，是乃仁术也。这是因为您内在有仁德的体现，见牛未见羊也，也是因为您看到了牛，而没有看见羊，看到了牛恐惧发抖的样子，激发了齐宣王的仁心，这个时候，他自然不忍心去伤害的。</span></p><p><span>我们去想一想，在生活当中也是一样的，会因为我们看见很多事情，所以不忍心去做。</span></p><p><span>我们举例子，比如说一个善良、纯真的小孩子，他看到小动物受伤，他就会哭，他会难过，他会不忍心，这就是仁爱之心。我们也是如此的，当我们看到一个人在痛苦之中，我们会不忍心，这就是仁心。当我们在生活当中看到一些可怜之人，看到一些可怜之事，我们就会升起不忍心，这就是我们内在的那颗仁心。</span></p><p><span>所以说，这里孟子提出一个观点，这种不忍心就是仁爱之心，而这种仁爱之心，我们人人都有。只不过这种仁爱之心，它需要一个特定的条件和环境。比如说，我们看到牛在瑟瑟发抖的样子，所以我们不忍心，它激发了我们的仁爱之心。</span></p><p><span>比如说，我们看到一个小动物受伤，我们会于心不忍，它激发了仁爱之心，可是还有更深一层的境界，就是没有看到，也可以生发仁爱之心。如果我们的仁爱之心，强烈到这种程度，那么自己自然是可以去做保民的事情。</span></p><p><span>我们比如说，如果齐宣王，他可以看到很多百姓在受苦，在流离失所，这会</span><span>激发他的仁爱之心，可是更有仁爱之心之人，他不需要看到，他自己去想，就可以想到，百姓过着什么样的生活。</span></p><p><span>所以孟子在见梁惠王之时，讲了魏国的现状，那也是战国其他国家的现状，路有饿莩，路上是有很多死尸的，很多百姓因为战乱都饿死、冻死在路上，所以这个时候，但凡是君子，有仁爱之心的人，看到这样的场景，都可以激发自己内在的不忍心。</span></p><p><span>可是如果仁爱之心更盛，即使不看到，也会想着，如何让百姓过更好的生活？</span></p><p><span>孟子接下来做了一句总结。<strong>“君子之于禽兽也，见其生不忍见其死，闻其声不忍食其肉，是以君子远庖厨也。”</strong>说君子之于禽兽，见其生不忍见其死，因为你见到他生的样子，所以不忍见其死。</span></p><p><span>就像齐宣王一样，他见到了这头牛活着的样子，所以于心不忍，不忍心见到它无罪而就死地 ，闻其声不忍食其肉，说你听到它的声音了，听到它的哀嚎和哀鸣，怎么忍心在吃它的肉呢？</span></p><p><span>不知道大家在生活当中，有没有这样的经历？比如说在杀一只鸡的时候，它会有哀鸣，会有挣扎，这就叫闻其声。比如说去杀一头猪，它是哀鸣的，是很痛苦的，所以君子听到这种声音，是不忍心再吃它的肉的，是以君子远庖厨也，所以说君子是远离厨房的。</span></p><p><span>因为在厨房，就要杀很多的禽兽，比如说鸡，鸭、猪、牛，当你去杀这些，你就见到它的生，你又怎么忍心见它死呢？你听到它哀嚎的声音，你又怎么忍心去吃它的肉呢？所以这是在讲君子，他是有恻隐之心的，他是有仁爱之心的。</span></p><p><span>所以远离这些事情，只要他看不到，那么心里就会好过一点，所以这里也是齐宣王，以羊换牛的关键之所在。因为他看到了这头牛，所以他就不忍心，因为他没有看到羊，所以他就忍心用羊去换。</span></p><p><span>我们延伸到生活当中，也是如此，很多事情，如果我们亲眼所见，我们看到了，我们就会生出很多的不忍心，不忍心去做很多的事情。可是我们没看到，可能我们的内心就会更坦然。我们整个来回顾，孟子与齐宣王的这一段对话。</span></p><p><span>首先，我们去看孟子交流的智慧，齐宣王想要称霸于诸侯，所以来问孟子，齐桓公和晋文公，是如何称霸的？他们靠什么去称霸？孟子说，我不知道，没有学过，但是我却可以跟您讲，如何称王于天下？</span></p><p><span>齐宣王就问道，需要怎样的德行才可以？孟子说保民就可以称王，很简单，齐宣王又问，我可以吗？您当然可以，为什么我可以？因为您有仁爱之心，因为您有这种不忍心就可以了。</span></p><p><span>通过以羊换牛这件事情，可以看到齐宣王的不忍心，他内在的仁心，有这种仁心就可以保民。我们这里可以看到，孟子首先对于齐宣王的肯定，是给他鼓励和支持的，告诉他你是可以的，并且详细地说明为什么可以？这里的智慧，是我们需要学习的，我们在生活当中，与人交流和沟通，包括教育孩子也是如此。</span></p><p><span>当我们鼓励他人去做一件事情，我们要详细的找到具体可行的方案，并且告诉他为什么可以？比如说，我们想让自己的孩子做一件事情，我们要鼓励他给他支持，但是又不能空泛，我们要讲清楚，拿出具体的事情告诉他，你是完全可以胜任的。这个时候他才会有信心，去做这件事情。</span></p><p><span>为什么可以？我们看孟子给齐宣王讲得很清楚，那是因为君子之于禽兽也，见其生不忍见其死，闻其声不忍食其肉，所以给他具体的把这件事情，讲解得很清楚。</span></p><p><span>那么接下来，我们将要学习的内容，又指出齐宣王的不足，难道有这个不忍心，就可以称王天下吗？决然不是，他还不够，我们在生活当中，去交流的智慧，也是如此。我们说一个人，他有潜力去做这件事情，我们首先要给他鼓励和认同，并拿出具体的事件，来给他加以肯定。</span></p><p><span>接下来，给他讲清楚其中的道理，进而再给他指出他的不足，我们要想做成这件事情，还需要做哪些的改变，这里我们可以看到，孟子与人交流的智慧，以及次第，他是有非常详尽的顺序去和他人交流。</span></p><p><span>比如说，我们和孩子沟通，比如说我们和爱人交流，比如说，我们跟员工之间的交流，也是如此，当我们想让一个人去做一件事情，说明我们的心里是有底气的，是我们知道他有能力、有潜力做好这件事情，所以首先我们要通过交流的方式，去引导他，然后找到他的优点，加以鼓励和肯定。</span></p><p><span>接下来，详细地说明其中的道理，再接下来就是指出他的不足，这是我们交流的智慧和所运用的方法。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-3 心之动与不动",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-3心之动与不动</strong></span></p><p><span>我们上一讲,讲到齐宣王，看到了牛，所以心生恻隐之心，不忍再去用牛祭钟，而没看到羊，就舍得用羊去祭钟。我们这里就要思考了，为什么会这样呢？它是什么道理呢？里面的原因、逻辑关系到底是什么？</span></p><p><span>齐宣王看到了牛，生了恻隐之心，我们把它称之为心动，我们进而再去思考，为什么他的心会动呢，因为他的眼睛看到了，他的眼睛看到了这头牛，恐惧发抖的样子，所以导致他的心动了。</span></p><p><span>我们去体会在生活当中，是不是这个道理？当我们看到一个人很可怜，这个时候我们的恻隐之心就会动；再比如说，我们看到一个人很美丽、很帅气，这个时候，我们的爱慕之心就会动；再比如说，我们看一个人很不顺眼，我们看他很讨厌，这个时候我们的心也会动，只不过这个时候的心，可能是厌恶之心，可能是反感的。</span></p><p><span>所以说，我们可以通过这些例子，来思考一个现象，也就是眼睛看到的，无论是好还是坏，都会带动我们的心。除了眼睛看到的以外，我们的耳朵听到的，比如说我们听到了悦耳之声，它会让我们的内心，感觉到快乐，感觉到平衡，感觉到喜悦，可是当我们听到杂音的时候，它会让我们的心也跟着动，我们开始变得反感，开始变得焦躁，心这个时候是无法得到平静的。</span></p><p><span>不光是眼睛耳朵如此，再比如说，我们的嘴巴，当吃到了好吃的东西，我们觉得口感很好，这个时候会带来心动，比如说，可能是愉悦的、开心的，觉得此事真的很快乐，觉得人间值得，可是当我们吃到一个不好吃的东西，它同样会让我们的心动。</span></p><p><span>举例子，别人现在这里做了一盘菜，放在我们面前，我们尝了一口，如果我们觉得不好吃，咸了，这个时候会升起一种心，这种心甚至可以让我们，达到怨恨的程度，他是不是跟我有过节，他怎么做饭这么难吃，他是不是有意的？</span></p><p><span>你看这个时候我们的心，随着我们的嘴巴在动，可能说这个菜，她做的很好吃，我们吃了一口，这个时候我们的心也会动，我们说她怎么这么好看呢，她怎么可以这么贤惠，她做饭怎么可以这么好吃？我们可能由此对她，升起了某种莫名的情感，甚至是爱慕，所以这些都是心动。</span></p><p><span>除了嘴巴，我们去想一想，还有什么可以带动我们的心动？举个例子，我们身体的触觉，比如当我们去抚摸一个东西，可能它摸起来是柔软的，是舒服的，这个时候可以让我们的心动，让我们的心也会跟着变得柔软，变得柔和。</span></p><p><span>可是我们摸一个东西，它是有刺痛感的，好痛，这个时候它也会带动我们的心，我们会觉得是谁把它放在这个地方的，放在这个地方，这不是影响别人吗？你看我不小心都碰到了它，所以我们的心，总是随着我们的五官在动。我们随着外界事物的发展，随着环境在动。</span></p><p><span>你看我们的心，好像没有平静的时候，我们那颗心，总是无法安住在某一种状态当中，随着我们自己的五官，随着外界的环境，不停地在发生变化。再比如说，有人打了我们一下，我们会感觉很痛，这时候我们的心，就会跟着动，我们可能开始变得怨恨他，我们要伺机去报复他。</span></p><p><span>再比如说，别人对我们的很轻缓的动作，比如说轻轻地抚摸了一下我们的头，这个时候我们会感觉很舒服，这个时候我们会觉得很温暖，甚至暗暗升起了某种情愫，所以无论别人的什么样的一个动作，我们看到的，听到的，嘴巴尝到的，都会带动我们的心。</span></p><p><span>我们这里就要思考了，如何才能让我们的心，趋向于平稳，不让他动呢？首先我们要学会用思维去调整。举个例子，说我今天早晨准备出门，发现天正在下雨，我们听到了雨声，看到了下雨，这个时候，有可能会让我们心生烦躁，这我上班不会迟到吧，你看这个时候，我们的心开始变得急躁，一旦心开始变得急躁，接下来我们的行为，就要开始出现乱，出现差错。</span></p><p><span>比如说，我出门可能忘拿了什么东西，比如说，我开车的路上，有可能由于急躁，发生了什么样的交通意外、刮蹭等等，还有可能说，因为路上开车的急躁，即使我赶到了公司以后，会看其他的人和事，依然是不顺眼的，所以从早晨的一个下雨的事件，我们眼睛看到了，耳朵听到了，就导致了后面一系列事情的发生。我们的心动了，心乱了。</span></p><p><span>那如何用思维去调整呢？当下雨的时候，我们要以一颗平常心去看待，天有不测之风云，任何时候下雨，都很正常，无非是早晨、中午、晚上或者是任何一个时间段下雨，又有什么问题呢？我们都要把它看成一种，极其平常正常的事情。</span></p><p><span>那么再举个例子，别人做了一盘菜，无论是好吃，还是不好吃，它都是正常的事情，每个人的发挥都有好的时候，都有不好的时候，他的心情也有好的时候，也有不好的时候，可能在他心情好的时候，他做出来的就好吃，可是在他心情不好的时候，他也是心乱如麻，故而做出来的可能就不好吃，那又有什么问题呢？它只不过是，再平常，再正常不过的事情。</span></p><p><span>所以生活当中，无论发生任何事情，我们都要用正常的心态去看待，一切发生的都是正常的。比如说，今天同事或者是家人，说了一句我不爱听的话，我们可能因此而心动，这个时候我们开始讨厌他，会让我们自己变得烦躁，会影响我们的行为。我们思维当中要知道，一切都是正常的，他也在随着他的心的变化，讲出来的话，也会变得不同。</span></p><p><span>这一刻他的心动了，他是烦躁的，不开心的，有情绪的，所以说出来的话不好听，当他心情好的时候，可能说出来的话，就是令人愉悦的，所以再正常不过了，或者说他就是这样的人，他讲话就是这样的方式，那是他的习惯和他整个人呈现出来的样子，那我们又何必因为他的样子，而让自己的心动了，去产生那么多情绪呢？</span></p><p><span>所以以此类推，无论生活当中，发生什么样的事情，我们思维当中要明白，他是再平常不过的，都是正常的该发生的事情。如此，我们才能不被外界的环境，不被他人的话语，不被自己的五官，乱了自己的心，一旦乱了自己的心，我们整个行为就要出现问题了。</span></p><p><span>我们这里再讲一个，如何去应用？我们说心动，它是中性的，没有好没有坏，但是我们要懂得，如何去运用它。我们先举个反面的例子，比如说，有的人领导来的时候，他就很努力的工作，去表现自己，这是为了什么呢？是不是为了让领导看到，他在努力工作的样子，进而领导的心会动，领导会觉得这是一个优秀的员工，他是一个上进努力的人。</span></p><p><span>可是我们学习了儒家文化以后，我们就要懂得去观察了，我们不是观察他，在我们看见的范围之内，是如何工作的？我们还要看更多的细节，还要看别人看不到的时候，他是一种什么样的状态，所以这个时候，就不容易被人蒙蔽，否则我们看到的有可能是假象，看到的有可能是，别人想让我们看到的样子。</span></p><p><span>我们通过这个例子，再来反过来，是可以自己在生活当中去运用的。比如说，我想要学习，但是我自己有惰性，我没有办法努力地去学习，这个时候我们就要懂得，运用自己五官的力量。</span></p><p><span>比如说，我们多去看看那些腹有诗书的人，他会刺激到我们的心，我们看到那些腹有诗书的人，看到那些有智慧的人，我们的心会动，原来有智慧这么好，原来有才华，是这么吸引人，我们的心动了，就会增加学习的动力。</span></p><p><span>再比如说，我们去找到一个，大家都在学习的环境，当我想停下来休息的时候，我看到的听到的，感受到的，都是别人在努力学习，这个是我们的心，会跟着动，会增加我们学习的动力。</span></p><p><span>再比如说，我想要运动，但是我有惰性，动不起来，我们就去大家集中健身的地方，比如说，去健身房，看到别人的身材那么好，看到别人都在努力的运动，这个时候我的心会跟着动，会激发我对于运动的向往，运动的乐趣，从而让我们自己可以动起来。</span></p><p><span>再比如说，我们可以看到，那些身材好的人，再看看自己，形成了一个强烈的对比，这个时候会刺激我们的心动，进而影响到我们的行动。再比如说，我想要出去走一走，但是我不愿意动，这个时候我们就要学会，让自己先动起来，当我们出去看到了美丽的风景，我们的心会跟着动，当我们看到别人，都在那里玩耍，可能自己的心会跟着动。</span></p><p><span>所以说，我们一定要学会，用自己的五官，以及去带动和影响他人，我们对待孩子也是如此的。我们发现他做一件事情，不愿意动的时候，我们就要学会去带动他，让他用五官去接触，更多的人和事，进而是为了刺激到他的心动。他的心动，才会真正的产生行动，行为由此而产生。</span></p><p><span>我们讲完了，如何用，再回归到如何让自己的心不动，我们刚才讲的，是用思维去调整，但是调整它并不是我们一下就可以做到的，如何才能不为之所动呢？我们学习过《论语》，我们就用《论语》当中的孔子，来举例子。</span></p><p><span>我们看孔子周游列国，明知不可为而为之，有那么多仁人志士，已经开始选择隐居，不去做什么事情，还劝孔夫子，不要去做那么多事情，可是孔夫子依然意志坚定的去做。所以我们注意了，意志坚定的人，就不容易为之所动，所以孔夫子一生都在传承着周礼，都在推行着仁德之道，无论世道是什么样子的，无论他人如何劝阻，自己的意志是坚定的，所以可以不为所动。</span></p><p><span>我们再看，现在正在学习的《孟子》，亦是如此，无论战国是一个什么样的时期，即使大家纷争不断，都在为了利，可是孟子依然坚定地，推行自己的仁德之道，推行仁者无敌，去讲仁政。不为所动，是因为自己的意志非常的明确。用《大学》讲，知止而后有定，他的止、目标、方向，是非常明确的，所以是坚定不移的，不为所动。</span></p><p><span>那我们用在生活当中，极其简单。我们想让自己的心不动，就是我们的目标要明确。比如说学习，我知道我每天的目标，就是学习，修为我们自己，其他的事情，都不为所动。比如说，吃什么穿什么，没有那么重要，比如说，别人是否认同我当下的行为，没有那么重要，别人是鼓励我的，认同我的，还是打击我的，没有那么重要，我清晰的知道，我自己在做什么。</span></p><p><span>我们说在做事业的时候，也是如此。我们看一个人对事业的目标，自己所做的那个事情，是坚定不移的。这个时候他是不为所动的，不会有人影响到他的节奏和脚步。</span></p><p><span>所以我们在生活当中，要学会自己坚定目标，这个时候就不容易被别人干扰，但同时我们要学会，如何去用自己的这种心动，用这种心动，它可以激发我们很多地方，可以变得积极向上。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-4 不为非不能",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-4 不为非不能</strong></span></p><p><span>齐宣王因为看到了牛恐惧发抖的样子，心动了，生了恻隐之心，仁爱之心。孟子清晰地把这个问题，告诉给了齐宣王，当然是对齐宣王的赞扬，说齐宣王是有仁爱之心的，这个时候齐宣王是很开心的。</span></p><p><span>王说，开心之余，引用《诗经》讲了一段话，<strong>曰：“《诗》云：‘他人有心，予忖度之。’”</strong>这首《诗》出自于小雅，叫做巧言，这是一首批判的诗，在批判进谗言之人，同时也是在批判听信谗言之人。为什么会有人进谗言呢？是因为有人听信谗言，所以就有人进谗言。</span></p><p><span>但是后面又讲到，一个君子该如何去做呢？君子要保持自己的行为，不受他人的影响，做自己该做的事情，同时要很清晰地知道，他人心里之所想。那我们看齐宣王引用的这八个字，他人有心，予忖度之，讲的就是这个道理。说他人心里的想法，是很清晰可以看得到的，一个君子是可以清楚地看到，他人是在进谗言，并且为什么进谗言，清清楚楚。</span></p><p><span>只不过这里齐宣王只讲了八个字，用它来形容孟子，就是说孟子，他知道别人心里的想法，很清楚。<strong>“夫子之谓也。”</strong>就是这几个字了，说《诗经》当中的这八个字，说的就是孟子您呐，为什么呢？因为孟子很清楚，齐宣王的想法，他的心里活动。</span></p><p><span><strong>“夫我乃行之，反而求之，不得吾心；”</strong>齐宣王讲，牛这件事情啊，是我把他放走的，不让他来祭祀钟，这是我做的事情，反而求之，就是回过来，想要寻求探索原因的时候，不得吾心，我却不知道是什么原因？</span></p><p><span><strong>“夫子言之，于我心有戚戚焉。”</strong>但是夫子您讲过以后，我的心豁然开朗，戚戚焉就是豁然开朗之意。我们再来看整个这段话，齐宣王引用了《诗经》去讲，孟子可以很清楚地知道，别人心里的想法，甚至这件事情是我做的，当我去探寻内在的原因，我却不清楚，我不知道为什么会这个样子，反而孟子言之，把这个事情讲出来，我豁然开朗，我明白了。</span></p><p><span>我们在生活当中，这种事情经常发生。比如说，当我们自己去做了一件什么事情，真正我们去想，我为什么要做这件事情呢？或者说问题出在哪里呢？可能我们自己想不清楚，如果这个时候有一个智者，他可以帮我们理清楚这件事情，我们就是豁然开朗的感觉，哦，原来是这个样子的，你看我都没有明白。</span></p><p><span>包括我们读书，学习圣贤文化，都会有豁然开朗的感觉。比如说，我们过去可能曾经做了很多事情，无论它是对是错，当我们自己探寻那个原因之时，可能我们自己都不清楚，可是我们去学习《论语》，学习《孟子》的过程当中，可能某几句话，突然就会让我们豁然开朗，原来是这个样子的，我过去怎么就没有想到？说明我们学习的经典，给我们带来了智慧，可以让我们变得豁然开朗。</span></p><p><span><strong>“此心之所以合于王者，何也？”</strong>这里齐宣王还有一件事情不明白，说您说的恻隐之心，这个仁爱之心，我知道了，可是我不明白，我的这颗心，怎么就合于称王天下的道呢？这是为什么？我们这里也不禁要思考了，有这个仁爱之心，恻隐之心就可以称王于天下呢？这其中有什么道理呢，我们看看孟子是如何讲？</span></p><p><span>我们应该可以猜的到，孟子在阐述这个道理之前，是要举例子的。<strong>曰：“有复于王者曰：吾力足以举百钧，而不足以举一羽；”</strong>复是报告，说，假如有人向大王您报告，我们先来看百钧，一钧等于三十斤，百钧也就是相当于三千斤，这个时候孟子举例子了。</span></p><p><span>说有人向大王您报告，说他的力量，可以举三千斤的重物，但是却告诉您不足以举一羽，但是他却举不动一根羽毛。<strong>“明足以察秋毫之末，而不见舆薪。”</strong>秋毫之末，指的是鸟尾巴上的细绒毛，舆薪是指的一车柴火，他的眼睛可以看清楚，鸟尾上的细绒毛，但是却看不到，眼前的一车柴火。</span></p><p><span><strong>“则王许之乎？”</strong>请问大王，您相信这样的事情吗？我们看这里孟子的例子，用了很强烈的对比，说一个人的力量，可以大到举三千斤的重物，但是他却说自己举不动一根羽毛，因为羽毛很轻，他的视力很好，看得很清楚，可以细致到鸟尾上的绒毛，但是眼前有一车柴火，却看不见。请问大王，您相信这样的事情吗？</span></p><p><span><strong>“曰：否！”</strong>不相信。我们去想一想，孟子举这两个例子，到底想要说明什么呢？他想要告诉齐宣王什么道理，我们接下来去看。<strong>“今恩足以及禽兽，而功不至于百姓者，独何与？”</strong>说大王您的恩德可以及禽兽，也就是指的那头牛啊，您可以对一头牛生起恻隐之心，仁爱之心，但是功绩，您的作为却没有恩泽百姓啊，这是什么道理？</span></p><p><span><strong>“然则一羽之不举，为不用力焉；舆薪之不见，为不用明焉；百姓之不见保，为不用恩焉。故王之不王，不为也，非不能也。”</strong>孟子举的这两个例子，在这里呈现出来了，首先告诉齐宣王，您的恩泽可以惠及到禽兽，但是为什么作为、功绩，没有到达百姓，说那根羽毛不去举，为不用力也，不是举不动啊，是你没有想去举，没有想去用力气。</span></p><p><span>说那一车的柴火看不见，不是你看不见，是您没有想去看，说今天我们没有让百姓过上好的生活，没有去保民，不是我们的力不足，是您的恩德没有惠及到百姓。所以说大王，您今天没有称王于天下，不为也，非不能也，是您没有去做，并不是您做不到。我们再看这个例子，为何可以举动三千斤的重物，却举不动一根羽毛呢？</span></p><p><span>非不能也，不为也呀，不是举不动，是您不想去举，为什么看不到，眼前的一车柴火？不是看不到，是您没想去看，为什么今天的功绩，没有惠及到百姓，不是您没有恩德，也不是您没有这个恻隐之心，而是您没有去用，没有把它用在保民上。</span></p><p><span>我们往生活当中，思考也是如此，很多事情并不是我们无能为力，是我们没有想去做。我们举个例子，有的人在工作当中，会说我做不到，会说这件事情我不会，其实并不是，它不一定是我们不会去做，而是我们不为也是，是我们并没有真正的想要去做这件事情。</span></p><p><span>我们再举个例子，很多人说我想要学习，可是我没有时间，并不是没有时间，而是我们不为也，是我们没有真正的，想要去做这件事情，我们以此类推，生活当中类似的，这种事情很多，并不是我们无能为力，只是我们并不愿意。</span></p><p><span>我们不为也，没有想去做。听到这里，我们很多人可能会有疑惑，我不知道什么事情，是我无能为力的，不知道什么样的情况，是我不去作为的，到底该如何区分呢？</span></p><p><span>齐宣王也有这样的困惑，<strong>曰：“不为者与不能者之形，何以异？”</strong>形指的是情形，表现出来的呈现出来的现象，说不能者与不为者，是什么样的情形，它有什么样的区别呢，我该怎么去区分？</span></p><p><span><strong>曰：“挟太山以超北海，语人曰：我不能，是诚不能也；”</strong>这里孟子又举了一个例子，挟是夹着，说一个人要夹着太山飞越北海，对人讲说我不能，是诚不能也，因为确实是不能，它是我们无法做到的。</span></p><p><span><strong>“为长者折枝，语人曰：我不能，是不为也，非不能也；”</strong>又举了一个例子，说为长者折枝，语人曰：我不能，告诉别人说，我办不到，是不为也，这不是办不到，是不想去做，我们看看这里的为长者折枝，关于折枝，很多人都有不同的解释。</span></p><p><span>我们这里把它理解成举手之劳，说为长者折枝，是举手之劳，轻而易举的事情，我们举个例子，比如说，我们看到一个老者走在路上，我们去为他折下一段树枝，有可能是为了让他拄着走路，有可能有其他的用途。所以这个例子，只是让我们明白一个道理，这是轻而易举的事情，不需要我们去费力，但是却告诉别人说我不能，这不是不能，是不为也。</span></p><p><span><strong>“故王之不王，非挟太山以超北海之类也，王之不王，是折枝之类也。”</strong>这里孟子做了一个总结，说齐宣王没有称王天下，不是夹着太山，飞越北海这类的事情，而是折枝这一类的事情，也就是在讲齐宣王，他并不是不能，并不是做不到，他是没有想去做，是不为也。</span></p><p><span>我们讲到过孟子来到齐国，前后两次在齐国讲学，长达十八年之久，是因为孟子对于齐宣王抱有很大的期望，因为周游列国的过程当中，齐宣王是有仁爱之心的，所以孟子认为，齐宣王是最有可能，推行仁德之道的人。</span></p><p><span>故而对他抱有很大的期望，所以告诉齐宣王，说您今天没有称王于天下，不是夹着太山飞越北海，这种人力所不可及的事情，它是为长者折枝之类的，是轻而易举可以去做到的。不是您做不到，是您并没有真的想要去做。既然您的恻隐之心，您的仁爱之心，都可以恩及到禽兽，为什么功不至于百姓呢？只是我们还没有想去做这件事情。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-5 心之所向",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-5 心之所向</strong></span></p><p><span>在上一讲当中，孟子举了两个非常形象的例子，一个是挟太山以超北海，一个是为长者折枝。挟太山以超北海，这是不能也，非人力所及；为长者折枝，这是不为也，非不能也。这里有两个关键点，一个叫不能，一个叫不为。我们今天来重点延伸，不能和不为的区别？</span></p><p><span>我们在生活当中，到底该如何区别，什么样的叫做不能，什么样的叫做不为呢？非常简单，只要是在能力范围之内的，如果没有去做，都称之为不为。如果它是超越了，人的能力本身，叫做不能。比如说孟子讲的，挟太山以超北海，这是非人力所能及，这属于不能。其他的只要是在人的范围之内，可以去做的事情，如果没有去做，都称之为不为。</span></p><p><span>我们举个很简单的例子，来体会一下。比如说我们现在面前坐着一个人，他正在跟我们讲话，可这个时候，我们可能没有听到他在讲什么，我想一会儿我该吃一点什么东西，今天我该去哪里玩，他什么时候才能讲完呢，这个是不为也，不是不能也。不是我们没有能力听清他在说什么，而是没想去听，所以就变成了不为。</span></p><p><span>我们这里就要体会了，是什么让我们变成了不为？心之所向，如果这件事情是我心之所向的，我就会去为，如果它不是我心之所向的，就会不为。</span></p><p><span>我们再来举个例子，比如说一个人二十几岁、三十岁，在家并没有出去参加工作，这个时候，他会找很多的理由和借口，说没有什么工作是适合我的，找的工作不是工资低，就是它的技术含量太高，我做不了，这一听我们就知道了，这是不为， 不是不能也。如果他真的想要去参加一个工作，想要找一份事情去做，他就一定可以找到。</span></p><p><span>我们再来举个例子，一个人对我们讲，他很忙，比如说从来不愿意跟我们联系，不愿意跟我们交流，这就是典型的不为也，非不能也。因为那不是他心之所向，如果是他心之所向，他就一定有时间和我们交流。</span></p><p><span>我们再说在一个工作岗位上，也是如此，我们讲这个事情我不会做，那个事情我不会做，它并不是超越了我们人的能力范围之内，而是我们不想去做，我们那个心，并没有这样的向往，所以我们就不为，不去做这件事情。以此类推，看看我们生活当中，绝大多数事情都是不为，而非不能。</span></p><p><span>还有这里面还涉及到一个情感障碍的问题，什么意思呢？我们用刚才的例子来说明，比如说，有人说我们的孩子二十几岁了、三十几岁，还没有出去参加工作，这个时候作为父母的我们，因为对孩子有深厚的情感在其中，所以这个时候，就会出现障碍，我们会帮他去找理由和借口。</span></p><p><span>我们说这个时候，确实什么都不好干，确实我这个孩子，他没有某方面的才能，那就让他再待上一段时间。我们这种情感的障碍，就会让我们帮他，找诸多的借口和理由，最后他也会顺着这些理由，不停地给自己放大，所以我们要注意，这里情感障碍的问题。</span></p><p><span>我们在生活当中也是如此，比如说，当我们爱一个人的时候，他许久不曾和我们联系，这里面涉及到情感障碍，我们会帮他找很多借口，我说是啊，他确实是没有时间，他顾不上，当我们越是给他找这些理由和借口，他就会顺着这些借口，再去延伸和放大，所以首先我们要明白，什么样的事情是不能，什么样的事情是不为？</span></p><p><span>接下来还要去注意，自己的这种情感障碍，无论我和任何一个人，只要我对他的感情是深的，我就会给自己找到很多的障碍和理由，这个时候我们是在助长他自己不想为的这颗心。我们讲到是什么决定，为与不为的呢？是我们自己的心之所向。</span></p><p><span>我们再来讲讲，心之所向，比如说，一个人特别喜欢吃，对于吃这件事情上，我们就会不停地去向往，所以只要有时间，我就会想着如何吃更好的东西；比如说一个人对于学习文化是心之所向，可能每天都在读书，每天都在学习着文化的知识。</span></p><p><span>如果一个人，对某一个领域是心之所向的，那么他所有的时间和精力，都会去研究他自己的爱好，可是我们在生活当中，好像有些心之所向，并非是正确的事情。</span></p><p><span>举个例子，比如说，我们有很多的不良嗜好，比如说喜欢打麻将，比如说喜欢饮酒，这也是心之所向。当他心之所向，是这些不良的嗜好，他会把所有的时间和精力，都用在这些事情上，我们接下来就要注意一个问题了，当你的心之所向不同。我们再把它换一个词叫喜好，我们喜好的东西不同，它会给我带来不同的行为和气质。</span></p><p><span>举个例子，一个做小生意的人，我可以看到他身上的气质，比如说做小生意的人，喜欢精打细算；再比如说，一个喜欢做销售的人，我们可以看到他身上的气质和行为，这样的人是不安稳的，他喜欢到处走的，所以就没有那么成熟和稳重。</span></p><p><span>再比如说，一个喜欢文化的人，我可以看到他的行为和气质，他是喜欢慢的，喜欢静的，喜欢思考的，所以我们这里要有一个体会，当我们有不同的喜好，就会形成不同的行为，它会让我们整个人的气质和思维方式，变得不一样。</span></p><p><span>我们再举几个例子，比如说，一个喜欢运动，喜欢健身的人，他喜欢身体动，这样的人相对来讲，就不喜欢思考，因为身体在动的时候，他的大脑是不思考的，身体静下来的时候，人的头脑才有诸多的思考在其中。所以不同的喜好，可以培养一个人不同的气质，包括气节，以及他的行为和思维方式。</span></p><p><span>再比如说，一个好利之人，他的特质就是索取，因为他想要的是利，所以凡事都想要去索取，对我有什么好处，一个好仁义的人，他就想的是付出和给予他人，他想的是如何贡献，所以喜好不同，我们的思维行为，整个人的气质，都会变得不一样。</span></p><p><span>比如说，文中的孟子和齐宣王，在讲什么呀？孟子他在改变齐宣王的喜好，战国那个时候，君主都是好利的、好战的，所以</span><span>好利和好战，就会导致民不聊生，他的喜好直接导致他的行为。这个时候孟子告诉齐宣王，要实行仁政，你去好仁义之道，如果他懂得好仁义之道，他的行为就会发生变化，他就想着如何去恩泽百姓，如何去保民。</span></p><p><span>在生活当中的，我们也是一样的，我们要去改变自己的喜好，而改变喜好的过程，我们就称之为修身了。举个例子，比如说我本来是好利的，这是我的心之所向，但是我可以通过喜好，通过学习，让我变成好仁好义的，当我们好仁和好义，我们的心之所向，做的都是付出的给予的，如何提供给他人更大价值的事情，那个结果由此而改变。</span></p><p><span>所以我们再去看看生活当中，我们心之所向的事情，看看我们现在好的是什么，如果我好的事情，它不能让我自己的内心，让我的修养和修为得以提升，我们就要通过改变自己的喜好，最后改变自己的心之所向，我们的思维和行为，以及整个人的气质，就会发生变化。</span></p><p><span>我们再来梳理和总结，这一节课当中的内容，首先我们讲什么叫不能，什么叫不为，如果超出了人的能力范围之内的，我们称之为不能。只要还在人的能力范围之内，我们都称之为不为。可是生活当中，很多时候，我们并非不能，都是不为，没有想要去做，那是什么导致不为的？</span></p><p><span>是我们自己的心之所向，当我们想要去做的事情，我们就会去为，不想要去做的事情，我们就不会去为，不想去做，从而找更多的理由和借口，说我不能做，说我做不到。</span></p><p><span>如何去改变我们心之所向？我们要通过平时的喜好去改变，这个时候我们要学会区分，我们哪些喜好对我们是有益的，哪一些对我们是有害的？如果它对我们没有，注意的是有损害的喜好和行为，我们就要懂得去修正，而这个过程也是修为自己的过程。</span></p><p><span>如果是对自己有益的那些喜好，我们就可以不停地去投入更多的时间和精力，我们的这些喜好，就会变成我们的心之所向。所以要想改变一个人的行为，是要通过改变一个人的喜好，改变一个人的心之所向，这个时候，我们愿意去为更多的事情，也就形成了我们的思维，我们的行为，我们的价值观。</span></p><p><span>孟子讲到齐宣王，恩可以足及禽兽，而功不至于百姓，就是因为齐宣王内在有仁，有恻隐之心，但他并不是好仁，如果他是好仁的，他就会把自己这种仁爱之心，把恩及禽兽的这种行为，推广到百姓当中去，这就是好仁。</span></p><p><span>所以我们在生活当中，也是如此，如果我们通过学习儒家文化，变得好仁、德、忠、信，我们好仁就会愿意去付出，贡献自己的价值，我们好义，就会去做合时宜的事情，我们要好信，就会讲诚信，如果我们好敬畏，我们对万事万物，都是充满敬畏之心的。</span></p><p><span>如此我们整个人的思维、气质和行为、理想、气节，都会随之发生变化，所以这一讲的重点，是在喜好和习惯，我们平时有什么样的喜好，就会养成什么样的习惯，导致我们心之所向，最后就形成了我们的行为。</span></p><p><span>我们再看看生活当中，我们当下做的事情，如果这个喜好是有害的，那么就要懂得去停止了，如果这个喜好，对我们是有益的，它是合于道德的，这个时候我们就要去改变自己过去的习惯。修身之所以难，也就难在这个地方，因为我们要克服自己的欲望，改变自己原来喜好的东西，把它倾向于正轨。</span></p><p><span>举个例子，比如说齐宣王他是好战的，是好利的，这个时候孟子要让他放弃好利和好战，转而改向好仁，这个过程是艰难的。这就像是我们在生活当中，也是如此，比如说我们爱吃，可是由于爱吃，我们自己的身材，已经开始走形，这个时候我们知道是不能再吃的。我们要放下吃这件事情，其实是很艰难的，以此类推其他的事情，也是如此。</span></p><p><span>比如说，我们爱上一个人，但是我们明知道，爱上这个人是不正确的，是不合适的，这个时候我们就要去改变，我们原来的这份爱。所以诸如此类，在我们生活当中，类似的事情很多。</span></p><p><span>我们要学会去改变，我们过去喜好，也就是欲望，把它改向一个正常的合于道的，这也是修身的难点之所在，同时也是乐趣之所在。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-6 推己及人",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王章句上⑦-6推己及人</strong></span></p><p><span><strong>“老吾老，以及人之老；幼吾幼，以及人之幼；天下可运于掌。”</strong></span></p><p><span><strong>老吾老，以及人之老；幼吾幼，以及人之幼。</strong>这两句话流传得非常广泛，我们很多人都听说过。我们看一看他讲了一个什么道理？第一个老是动词，尊敬的意思。我们会懂得尊敬自己的老人，尊敬自己的父母。以及人之老，我们如果懂得尊敬自己的父母，尊重自己的老人，</span><span>我们把它推广出去，去尊敬别人的老人。</span></p><p><span>幼吾幼以及人之幼。我们会爱护呵护自己的孩子，我们推广出去，把它应用到别人的孩子身上，也就是我们如何对待自己的父母，就如何对待他人的父母。如何呵护自己的子女，就去呵护他人的子女。如果能做到这个样子，作为一个君主来讲，自然会爱民如子，也就是推行仁政。</span></p><p><span>我们这里分成三个层次来讲，我们讲第一个层次叫心存仁爱。如果一个人心存仁爱之心，这是他心之所向，自然可以做到这个样子。如果不能是心存仁爱之人，不是心之所向的，我们要讲到第二个层级，这是我们的责任和义务，我们知道应该这样去做。</span></p><p><span>举个例子，比如说君主作为一国之君，首先就要懂得尊重自己的老者，爱护自己的孩子，要把这种尊敬和爱护推广出去，以对待所有的百姓黎民，自然会变成一个推行仁政的君主。</span></p><p><span>我们看第三个层级，就到了我们不得不做这件事情。为何会不得不做呢？举个例子，比如说齐宣王想要称王天下，即使为利，也需要这样去做。如果不这样去做，那么百姓是不会拥护他的国家。我们看分成了这三个层级，它的区别是什么呢？</span></p><p><span>首先讲如果一个人是心存仁爱之心的。这是他心之所向，他乐于去做这件事情，并且他可以生出无限的方法。不需要去学习任何的方法。比如说，当我们真心的尊重自己的父母，爱护自己的孩子，我们用学习方法吗？</span></p><p><span>我们知道该怎么尊重老人，也知道该怎么呵护子女，是因为他是我们心中想要去做的事情，我们自然就会去为之。同时因为是我们的心之所向，所以我们是开心的是快乐的。</span></p><p><span>我们再看第二个层级，如果我们不能做到心之所向，但它是我们的责任和义务。比如说孝顺父母是我们的责任。比如说呵护子女是我们的义务。但它并不是我们真心想做的，这个时候我们虽然会去做，可是我们会觉得很累，会觉得很有压力，我们需要到处去学习方法，因为它不是我们的心之所向。</span></p><p><span>我们看第三个层级，是我们为了利，不得不去做，这个时候就会升起很多的怨气。比如说，我们不得不照顾我的父母，不得不呵护我的孩子，这个时候我们自然心里会生怨，并且我们表现出来的都是假象，一旦得到某个结果，会立马放弃不做。</span></p><p><span>举个例子，比如说我们照顾父母，是为了某种利益，当我们得到利益和结果，立马就放弃不做了。比如说我们这里讲到的齐宣王，也是如此，如果是为了利，为了称霸天下不得不做。当有一天真的如果称霸了天下，立马就不会爱民如子。</span></p><p><span>我们把这三点应用到生活当中其他事情，也是如此。比如说一个孩子的学习，如果他热爱学习，那是他心之所向，他会乐在其中。并且他自己可以找到很多学习的方法，那么如果不能是心之所向，他是责任不得不做，因为我是学生，学习就是我的责任和义务，这个时候他会寻找方法去学习，但他会觉得累，他会有很大的压力在其中。</span></p><p><span>如果到了第三点，为了考试成绩，不得不去学习，这就是为了利，为了某种结果，这个时候他就会生怨气。他会经常去思考，我考个好成绩有什么意义呢？我为什么非要逼迫自己？父母为什么要给我这么大的压力？这个时候就会生怨，并且一旦考试结束，他马上以后不会再学习，立马放下。</span></p><p><span>我们在工作和感情也同样的道理。比如说一段感情，如果我们是心之所向，是爱着对方的，是想方设法的在付出，我们想着怎么能给予对方更多，给他更多的关心和爱护，并且我们是乐在其中的。我们不用学习方法，只要心之所向，自然会生出方法。</span></p><p><span>同样，如果我们觉得他是责任和义务，说他是我的爱人，我没有办法，我得照顾他，这个时候我们会觉得好累，好辛苦。并且会有很多的压力，我们需要到处去学习方法。怎么才能照顾他，怎么才能让他开心，让他高兴？但是这并不是我们心甘情愿的。</span></p><p><span>如果到了第三个层级，不得不做，因为我们为了某种利，某种结果，这个时候会生怨气。我们再回到主题，老吾老，以及人之老，幼吾幼，以及人之幼，看看我们在哪个层级上，如果我们是心存仁爱的，是心之所向的，我们就会乐在其中。</span></p><p><span>这番话是讲给齐宣王的，我们看齐宣王显然不是心存仁爱的，这并不是他的心之所向，所以孟子一直在想转变齐宣王的心。想让他内在是心存仁爱的，自然会去推行仁政，并且会乐在其中。像尧、舜、禹、汤、文王那个样子，他爱民如子，并且自己是快乐的。</span></p><p><span>可是我们看齐宣王做不到，那么就讲了第二个层级了，这是你的责任和义务。作为一个君主，就应该做这样的事情，应该去保民。我们看齐宣王这一点显然也做不到。所以这里讲到的，齐宣王是第三个层级，想称霸天下，那么也需要这样去做，这是讲了具体的方法。</span></p><p><span>老吾老，以及人之老；幼吾幼，以及人之幼。但是我们从中要有所思考，这话不光是讲给齐宣王听的，也是讲给我们每一个人听的，看看对尊敬老人这件事情，呵护子女这件事情，以及我们的学习、工作、生活感情，我们看看我们在哪个层级上？我们要懂得把自己的某一个优点推广到他人身上，这里只是用尊敬老人和爱护子女举了个例子。</span></p><p><span>我们在生活当中其他的优点，也要学会推己及人。举个例子，比如说，我今天的晚餐想吃什么？这是我们自己的想法，我们接下来，就要推广到他人身上了。比如说，我去想一想我的父母，今天晚上我要给他做点什么？比如说，我们的爱人他忙了一天，他想吃点什么呢？比如说，我们的孩子他喜欢吃什么？这就叫推己及人。</span></p><p><span>我们在工作当中，也是如此，当我们在做某一项工作的时候，我们去思考一下我喜欢的这个样子，我领导是否是喜欢，如果我站在领导的岗位上，他希望我把这个工作做成什么样子呢？如果我跟同事之间合作一件事情，同事希望是什么样子？这个就是推己及人的道理。</span></p><p><span>所以我们在生活当中，要自己懂得去思考和运用，可</span><span>以推己及人，如果我们懂得推己及人的道理，我们看看会形成什么样的结果？</span></p><p><span><strong>天下可运于掌。</strong>如果我们学会了推己及人，天下可运于掌中，我们想一想，这是一个什么样的场景？把我们的手掌摊开，像有一个东西在我们的手掌当中转动，也就是想让它转就让它转，想让它停就让它停。</span></p><p><span>这里孟子告诉齐宣王治国的道理，非常简单，只要懂得推己及人，老吾老，以及人之老；幼吾幼，以及人之幼。天下仿佛就在您的掌中一样，可以转动自如。同样的道理，不光齐宣王治理天下如此，我们在生活当中亦如此，如果我们懂得推己及人，懂得用仁爱之心去做事情，什么事情都是孕育掌中的。</span></p><p><span>举个例子，比如说夫妻感情，我们怎么对待你自己，我们就推己及人，怎么去对待他，我们的感情就如此简单和谐。比如说，我们在工作当中，也是如此，我们想怎么对待自己，我们就怎么对待，工作当中的他人以及事情，那工作就是变得如此简单。</span></p><p><span>所以心存仁爱，也就是懂得为他人去思考，我们站在百姓的角度，思考问题，去想百姓他会喜欢连年征战吗？他会喜欢重税重赋吗？如果他不喜欢，我们自然不做这些事情，如果百姓喜欢安居乐业，老有所养，幼有所教，就去实行这些政治策略就好了，所以治理天下就是如此简单。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-7 推恩保四海",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王上⑦-7</strong></span></p><p><span><strong>“《诗》云‘刑于寡妻，至于兄弟，以御于家邦’言举斯心加诸彼而已。故推恩 足以保四海；不推恩，无以保妻子。古之人所以大过人者，无他焉，善推其所为而已矣。今恩足以及禽兽，而功不至于百姓者，独何与？”</strong></span></p><p><span><strong>《诗》云，刑于寡妻，至于兄弟，以御于家邦。</strong>这是《诗经》当中的一篇，《诗经》《大雅·思齐》，我们先讲一下，这首《诗经》讲了什么意思？这首《诗经》的开篇赞美了三个女人，首先赞美了文王的母亲，文王的祖母，文王的妻子，我们先看为什么先赞美文王的母亲？</span></p><p><span>因为有文王母亲的德行和智慧，所以才培养出了周文王这样的孩子。文王的母亲为何会有智慧和仁德？是源于文王的父亲。因为文王的父亲有足够的德行和智慧，所以匹配来了文王的母亲。文王父亲的仁德和智慧是哪里来的呢？来自于文王的祖母，因为文王的祖母也是有德行和智慧的女人，所以培养了文王的父亲。</span></p><p><span>接下来赞美的是文王的妻子，因为文王有德行和智慧，所以匹配来了文王的妻子，我们看他讲了这样一个次第，也就是告诉我们女子的重要性。如果我们身为一个女子懂得去学习圣贤的文化，懂得修自己的仁德和智慧，就可以培养一个仁德和智慧的孩子。男人也是一样的，我们要懂得修自己的仁德和智慧。才能匹配同样的女子，教育好下一代，我们的孩子。</span></p><p><span>我们看《诗经》引用的这一句，刑于寡妻，至于兄弟。这个刑是通模型的型，也就是榜样的意思。这里讲到文王刑于寡妻，文王做了他妻子的榜样，也就是文王自己他是有德行的，这个时候妻子以文王为榜样，自然就变成了一个有德行的女子。至于兄弟，再把它推广到兄弟当中，影响了自己的兄弟。</span></p><p><span>以御于家邦。家指的是封邑，邦指的是国家，再把它用来治理国家。我们再来看这句话的次第，很清晰。首先文王自己是一个有德行的人，他的妻子以文王为榜样，文王又把它推广到兄弟当中去，再进而可以治理整个国家。我们可以看到这是儒家文化的次第，修身，齐家，治国，平天下。</span></p><p><span>首先要修身，也就去修为自己，接下来自然就会去齐家，也就是家里的每一个人都以你为榜样，以你为典范，进而你就可以推广到治国，平天下。所以也就是孟子所讲，老吾老，以及人之老；幼吾幼；以及人之幼。他讲的非常简单，也就是推己及人的道理，我们从自身开始做起。</span></p><p><span><strong>言举斯心加诸彼而已。</strong>言指的是《诗经》的这段话，举是推广，斯心就是这样的心理，加诸彼而已，这个彼指的是其它方面的事情。我们再来看这句话，言举斯心加诸彼而已，把这段话的道理，推广到其他事情上，就可以了，特别简单。</span></p><p><span>也就是《诗经》当中所讲的，文王自己先懂得修德，妻子和兄弟以他为榜样，再把它用来治理国家，我们把这样的道理，推广到任何一件事情，都可以这个样子。</span></p><p><span><strong>故推恩 足以保四海。</strong>推恩，也就是推广这种德行和恩情于他人。足以保四海，这个时候你就可以保有四海，拥有天下。</span></p><p><span><strong>不推恩，无以保妻子。</strong>我们看这句话很重要，如果不懂得去推广这种恩德，不足以保妻子。我们先讲什么叫做妻子，妻子代表的是一个家庭，一个人不能称之为家，当有了另一半，有了妻子称为家。</span></p><p><span>所以这里告诉我们，如果不推恩，不足以保妻子。也就是你不懂得用这种恩德，不懂得修身，连妻子都保不住，也就是无法保住一个家。你连一个家都保不住，又何来的治国平天下呢？是治理不了一个国家的。</span></p><p><span>我们再来思考这句话的道理，如果一个人不懂得修德，不懂得推己及人，连一个家庭都没有办法经营。想一想，如果我们对待妻子，对爱人都不懂得用仁德，对他都不懂得去付出，不懂得去给予，我们怎么能保住这个家庭？</span></p><p><span>以此类推，我们要不懂得用这种恩情，也保不住和父母之间的情感，也保不住跟孩子之间的关系，怎么去保住我们的工作和保住我们的事业。所以当我们懂得这样去推恩，它是不停地向外扩展的过程，当扩展到一定的程度，自然就可以拥有整个天下。</span></p><p><span><strong>古之人所以大过人者，无他焉，善推其所为而已矣。</strong>古代的圣贤君主，之所以远远的超过他人。无他焉，没有什么其他的善推其所为而已。他善于推广自己的作为而已。我们看文王他是有德行的人，所以并没有什么其他的事情，他只是把自己身上的这种德行，推广出去，让更多的人可以变成这个样子，仅此而已。</span></p><p><span>所以这里孟子告诉齐宣王，你想要称王天下，实则非常简单，首先去修你自己的德，让你自己心存仁爱之心，再把这种仁爱之心，老吾老，以及人之老；幼吾幼，以及人之幼。你去推广到所有的人和事身上，你把它恩及到每一个百姓身上，如此就可以保有四海，拥有天下，就可以保民而王。</span></p><p><span><strong>今恩足以及禽兽，而功不至于百姓者，独何与？</strong>讲完了这个道理，接下来又反问齐宣王，今天您的恩德已经涉及到了禽兽，但是对百姓却没有做什么事情。这是为什么呢？就是因为仁爱之心还不够，并没有把它推广出去，是因为齐宣王没有深刻的明白这个道理，如果他是心存仁爱的，是心之所向的，他乐于这样去做，那么自然功绩就会到达百姓。</span></p><p><span>这一段，我们再来做一个总结，齐宣王看到了有人牵牛而过去祭钟，生出了恻隐之心，这说明齐宣王内在是有仁爱之心的。所以孟子就抓住了这一点恻隐之心，去赞扬了齐宣王，因为有这种仁爱之心，所以说齐宣王是可以保民而王，可以称王天下的。</span></p><p><span>但是你想要称王天下，这些恻隐之心是不足够的。所以接下来开始孟子又具体的举例子，说齐宣王是可以称王天下的，是他不为，并不是他不能。他是有能力去做到的，进而又讲到具体该怎么去做呢？无非是老吾老，以及人之老；幼吾幼，以及人之幼。你懂得以自己为榜样，刑于寡妻，至于兄弟，自然可以以御于家邦。</span></p><p><span>我们看《孟子》开篇，讲了义利之辩，又讲了贤者之乐，又讲了仁者无敌。即使你想称王天下或者说想要称霸天下，那么你都要去推行仁政，也就是无论是心存仁爱之心的，还是责任和义务，或者是想称霸天下，是为了某种目的，都要去推行仁政。</span></p><p><span>具体如何去推行仁政？刚才这一段就告诉我们如何去做。把自己喜欢的事情推广到别人身上，把它发扬光大，就可以变成仁政。我们在生活当中，也是如此的道理，你想要让自己事业有成，想让你变成一个优秀的人，或者想要经营好你的家庭，感情，以及人际关系，也是如此简单。</span></p><p><span>你把自己身上的优点推广到其他的人和事身上，比如说，我们自己想要去做的事情，你就把它推广到别人身上，站在别人的角度去思考，而我们自己不喜欢做的事情，那么就不要去做。</span></p><p><span><strong>己所不欲，勿施于人。</strong>这样就可以让我们变成一个更好的人，可以让我们经营好一段感情，做好一件事情。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-8 称心量物",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王上⑦-8 </strong></span></p><p><span><strong>权，然后知轻重；度，然后知长短。物皆然，心为甚；王请度之。</strong></span></p><p><span>一个人要想获得某种成功，或者说一个人想要幸福，唯有一个途径两个字叫做努力，如果问除了努力之外，还有什么重要的因素？就是努力再努力，也就是一个人想要幸福也好，想要获得成功也好，主要靠努力二字。</span></p><p><span>我们先去看成功也好，幸福也好，是以努力为前提的，但除了努力之外，我们更重要的是该知道，如何去努力，通过什么样的方式和方法，用什么样的途径和路线去努力呢？那也就是努力的前提。人是要有目标的，首先我们要有一个目标，才有努力的路线和方向，我们才知道用什么样的方式去努力，才能获得我们想要的成功和幸福。</span></p><p><span>我们来举个例子，比如说无论我们现在身在何地，我要有一个目标，说我要去上海，去北京，去重庆，去深圳，去济南，我们要有个目标，如果连一个目标都没有，又何谈幸福感？又怎么能谈到成功呢？我们是没有方向的，不知道自己要去哪里，我们就谈不到用什么样的交通方式去，也谈不到用什么样的路线，如何去规划路线。</span></p><p><span>比如说我们的目标，想去上海或者想去北京，路线有很多种，交通方式也有很多种，我们可以乘坐飞机，可以乘坐高铁，可以乘坐火车，可以开车前往，所以首先最重要的是目标，是我们知道自己要去哪里，才能选择合适的方式和路线。</span></p><p><span>我们要往生活当中来延伸了，比如说我们参加一个工作，要有自己的目标，我们才有努力的方向和意义，否则我们不知道该如何去努力。再比如说，我们想要的生活方式到底是什么？这是我们的目标，这个时候才有努力的方向。</span></p><p><span>举个例子，我的目标是我喜欢轰轰烈烈的人生，我一定是要做一番事业的。我要有所价值和贡献的，这是我们的目标，这个时候我们自然有努力的方式和努力的途径。我知道一个人不能甘于平凡，要更多的担当，这个时候我们浑身是有力量的。可是如果我们连这个目标都没有，我们每天就会茫然，不知所措，不知所云。我们不知道你自己在干些什么，也不知道每天在说什么，在想什么。</span></p><p><span>再比如说，有的人说，我就喜欢安逸的生活，这也是我们的目标。我这个人没有什么太大的追求，只要生活安逸平和美满就够了。这个时候我们有了这样的目标，我们追求生活开始有了努力的方向。我就努力的让生活当中少一些事端，如此就可以变得平静。可以努力的在生活当中，不要有那么多的争吵，不论是非对错，这个时候我们的家庭关系，就容易和谐，这都是目标的重要性。</span></p><p><span>再比如说一个孩子，如果说一个孩子他的目标，就是考上一所好的大学，这个时候他知道努力去学习，那是他心之所向的事情，所以这个目标也就是我们前面讲所讲到的心之所向。我们看看自己的心，有没有向往的地方，我们那个目标是否是明确的，如果我们有一个明确的目标，这个时候才知道该如何去努力。</span></p><p><span>我们很多人在生活当中，经常会感叹，说我有一身的力气，不知道用在什么地方。因为我们没有目标，所以我们的力量就不知道该用在哪里。我们想要去努力，但是却无从去努力，这个时候我们就要知道，一个人要清楚的知道自己的目标，当我们有了目标有了方向，我们的思维和行为，它是有导向的，是有倾向性的。</span></p><p><span>讲到了目标，我们就要再讲第二点，我们的目标必须是在，正确的价值观的指导下，这个非常重要。只有我们的目标在正确的价值观的指导下，他才可能长久，并且我们才可能说得出口，可以让更多的人，帮我们实现自己的目标。</span></p><p><span>我们来举个例子，比如说一个人做企业的目标，是想要赚更多的钱，请问这个目标你讲得出口吗？你这个目标会长久吗？你这个目标会有人愿意帮你去实现吗？显然这个价值观就不正确。我们再换一个方式，说想经营一家企业，是想为更多的人，去服务或者去实现某种社会的价值和意义，当目标是这样的，自然会有人愿意帮你共同去实现你的目标，因为这个价值观是正确的。</span></p><p><span>我们要举例子，我们看看齐宣王的目标是什么？齐宣王开篇就问孟子，齐桓、晋文之事，可得闻乎？那我们可以看到齐宣王的目标，是称霸于诸侯。如果他是称霸于诸侯的，谁又愿意帮助他，去实现他的目标呢？</span></p><p><span>我们假设他的价值观，如果是正确的是仁爱的，他如果看到的现在战国时期，天下混乱，民不聊生，那他看到百姓生活在痛苦当中，他想要去统一天下，让百姓过上平定安稳的生活，如果他的价值观是这个样子的，你发现会有很多仁人志士，愿意去帮助他实现他的理想和价值，这个就是我们学习儒家文化的重要性，首先要有目标，并且这个目标是要在正确的价值观的前提下。</span></p><p><span>这是《论语》、《大学》、《中庸》、《孟子》，这四书教给我们的道理。比如说，大学之道，在明明德，在亲民，在止于至善。比如说《孟子》开篇所讲的仁义而已矣，他告诉我们那个目标，告诉我们那个止，他是要止于至善的，要止于明德，亲民，要止于仁义而已矣。</span></p><p><span>所以要有目标，我们才有努力的方向，这个目标又是在正确价值观的引导下，他才可能变得长久，他才可能变成更多人，共同的目标。因为是合于道的，合于人心的，如此才可能长久。我们接下来，开始讲《孟子》的原文，孟子的这一段，讲到帮助齐宣王来剖心，剖析齐宣王的心理状态，看看他现在心里装的是什么？他现在心里所想的事情，以及他的行为跟他的目标，是否是相符的，他是否可以达成？我们从中更多地去思考。</span></p><p><span><strong>权，然后知轻重；度，然后知长短。</strong>权，权衡的意思。也就是称一称，称一称才知道轻重。度就是量一量，量一量才知道长短。我们再看权和度，我们生活当中，我们想要了解一件事情，要不然称一称，要不然量一量，比如说，我们称一称这本书多重，我们量一量这本书的尺寸长短。</span></p><p><span><strong>物皆然，心为甚。</strong>注意接下来重点来了，物皆然指的是所有的事物，都是要称一称、量一量的，只有称一称量一量，我们才能变得更清晰。比如说，我面前站着一个人，我们需要称一称、量一量，看看他的体重是多少？看看他的身高是多少？这个时候通过称一称、量一量，他的高矮胖瘦，我们会变得更加清晰。</span></p><p><span>所以，以此类推物皆然，我们想要具体的了解，任何一个人或者一个事物或者一个东西，都要量一量、称一称。但是孟子讲了，心为甚，心尤其如此，我们看这里孟子讲到，我们要量一量，称一称自己的心。</span></p><p><span>上一句，孟子反问齐宣王，今恩及禽兽，而功不至于百姓，独何与？为什么会这样？你要称一称、量一量自己的心，你称一称量一量，你的心中真的装着百姓吗？你有想过百姓的生活吗？</span></p><p><span>我们这里也不禁的要问一问自己，我们在做每一件事情的时候，我们有称一称、量一量自己的心吗？我真的喜欢这件事情吗？我真的想把它做好吗？我真的用心去做这件事情了吗？我真的用心对待我的工作了吗？我真的用心对待我当下的这份感情了吗？</span></p><p><span>我真的用心对待学习了吗？我真的用心对待我当下的事业了吗？我真的用心对待了父母以及子女吗？我真的有那颗仁德之心吗？所以我们要时时刻刻懂得去称一称、量一量自己的心，我们看看自己的心，到底是怎么想的？看看自己的心到底有没有装着这些事情？</span></p><p><span><strong>王请度之。</strong>也就是仔细的思量，仔细的思考。这里孟子先是举了一个例子，说一个物品，你要想知道他的轻重和长短，那么你需要去量，需要去称，天下的事物皆如此。</span></p><p><span>心为甚，我们的心更重要，但是似乎好像我们知道去量一个物品，我们知道去称一个物品，但是却不知道该量一量自己的心，称一称自己的心，还有几分仁爱，还有多少良心在其中？还有多少热爱，还有多少喜欢在其中？所以这是需要我们仔细去思考的地方，我们说一件事情，要想得出一个结论，那么你就去量，你去比较。</span></p><p><span>举例子，说面前放了一盆花，我不知道它好不好看，那么就量一量、比一比，我们再拿来其他的花，放在一起，自然知道哪个更好看。再比如说，我们在生活当中，我不知道我的工作做得怎么样，我们就量一量、比一比、称一称，我们去看看其他的同事，其他优秀的人，都是怎样去工作的，他们的心里是怎么想的？我们去比一比，自然就知道自己的问题和不足出在哪里。</span></p><p><span>再比如说，生活当中，也是如此，如果我们对自己的生活不满意，你去比一比、量一量、称一称，你去看看别人是如何生活的，他们是怎么对待生活的，是什么样的态度，什么样的智慧，什么样的德行？</span></p><p><span>比一比，我们就知道自己的问题和不足，出在什么地方，所以这是量一量自己心的重要性，如果生活当中的其他事情，也是这个样子，如果你不懂该怎么去做，你不知道自己的问题出在哪里，你就找一个参照物，去对比一下，我们就找到了问题。</span></p><p><span>比如我们去学习《论语》，学习《孟子》，也是如此，我们不知道自己的思想和价值观，还有行为是否是正确的，但是我们学习了《孟子》，学习了《论语》，比一比，我们有了参照，我们就知道哪些是正确的，自己身上哪些是错误的，是不足的，加以修正。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-9 缘木求鱼",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><h1><span>《孟子》梁惠王上 ⑦-9 </span></h1><p><strong><span>“抑王兴甲兵，危士臣，构怨于诸侯，然后快于心与？”王曰：“否，吾何快于是？将以求吾所大欲也。”曰：“王之所大欲，可得闻与？”王笑而不言。曰：“为肥甘不足于口与？轻煖不足于体与？抑为采色不足视于目与？声音不足，听于耳与？便嬖不足使令于前与？王之诸臣，皆足以供之，而王岂为是哉？曰：“否，吾不为是也！”曰：“然则王之所大欲，可知已：欲辟土地，朝秦、楚。莅中国，而抚四夷也。以若所为，求若所欲，犹缘木而求鱼也。”王曰：“若是其甚与？”曰：“殆有甚焉！缘木求鱼，虽不得鱼，无后灾。以若所为，求若所欲，尽心力而为之，后必有灾。”</span></strong></p><p><span>孟子告诉齐宣王，要量一量、称一称自己的心，那么接下来就要剖心了。接下来开始去反问，通过反问，让齐宣王清楚的知道，自己的心里到底装着什么？到底在想什么？</span></p><p><strong><span>抑王兴甲兵，危士臣，构怨于诸侯，然后快于心与？</span></strong><span>抑是难道的意思，难道，大王您兴甲兵，也就是动员军队，让您的士臣处于危险之中，和各诸侯之间结怨，难道您就会觉得快乐吗？</span></p><p><span>我们再看这句反问，因为齐宣王想要称霸于诸侯，所以这里孟子去问齐宣王，现在您去动员您的军队，让您的士臣，兵士、百姓都处于危险之中，并且还会和其他的诸侯结怨，请问这样，您的心里是快乐的吗？</span></p><p><strong><span>王曰：否，吾何快于是？将以求吾所大欲也。</span></strong><span>说不是这个样子的，我怎么会快乐？这里齐宣王讲到了，这样做并不快乐，只不过我想要实现，自己心中所想，想要实现自己的愿望罢了。</span></p><p><strong><span>曰：王之所大欲，可得闻与？</span></strong><span>这个时候孟子又问了，说大王您的愿望，可以说来听一听吗？</span></p><p><strong><span><span>王笑而不言</span><span>。</span></span></strong><span><span/>我们看这段对话很有意思，首先孟子问了齐宣王，动员军队，难道您会觉得心里很快乐吗？齐宣王说不会，我怎么会快乐呢？只不过为了实现自己的愿望，孟子又问，那愿望可不可以讲一讲呢？王笑而不言，齐宣王笑了没有讲，为什么不能讲呢？</span></p><p><span>如果他的愿望，他的理想，是在正确价值观的前提下，有什么不可以讲的呢？因为他的愿望，并不是在正确价值观的指导下，所以不能讲，但是大家心知肚明。</span></p><p><span>这里我们还要重点来看，我们看齐宣王想要兴兵，动员军队，这并不是他心之所向，这是被欲望所驱使的，并不是他真的喜欢这件事情，只不过是为了满足自己的欲望，满足自己的愿望，不得已而为之，这就叫欲望所驱使。</span></p><p><span>我们这里又要做延伸了，我们生活当中，想要去做一件事情，首先有的人是心之所向，是我喜欢，所以我去做这件事情。</span></p><p><span>那么还有第二种，如果不是心之所向，那就是欲望的驱使，说我想要满足某方面的欲望，所以我不得不做。当一个人，如果是被欲望驱使，去做事情的，你就会很痛苦，你不会快乐，并且你没有办法讲出口，这就是齐宣王笑而不言的原因。</span></p><p><span>因为他没有办法说出来，但是通过他的问题，我们都可以看到，他的欲望是什么，他见孟子直接就问齐桓、晋文之事。因为齐桓公和晋文公，都是曾经的春秋五霸，问到如何称霸，也就知道他的心中所想，我们也自然就知道，他的欲望到底是什么。</span></p><p><span>所以生活当中，我们要懂得时刻的去称一称、量一量自己的心，我们去看一看做一件事情是心之所向，还是被欲望所驱使？既然齐宣王笑而不言，那么孟子自然是要讲的，因为孟子清晰的知道，齐宣王的心里在想什么。</span></p><p><strong><span>曰：为肥甘不足于口与？轻煖不足于体与？</span></strong><span>肥甘指的是肥美甘甜，难道您是因为肥美甘甜的食物不足于口吗？反问句轻煖指的是既轻快又保暖，难道是因为轻快保暖的衣物，不够满足我们身体所用的吗？</span></p><p><strong><span>抑为采色不足视于目与？声音不足，听于耳与？</span></strong><span>还是因为彩色明亮的，不足够我们去看的呢？还是因为美妙的音乐，声音不足够我们听的？我们回头，再来看孟子反问的这几句，无非是口腹之欲，难道是肥美甘甜的食物，不够吃吗？</span></p><p><span>接下来是我们身体的欲望和需求，是轻快保暖的衣服，不够穿吗？再接下来是我们的目之所及，难道我们看到的彩色明亮的东西，不够看吗？还是我们耳朵听到的声音，不足够听？</span></p><p><span>这几句反问讲出人的需求和欲望，去看看我们生活，当中的需求和欲望，无非就是如此。</span></p><p><span>说我的身体会让他更舒服，我穿得更好，我的口让他吃得更好，喝得更好，我的耳朵可以听到更多好听的，我喜欢听的，可以给我带来美妙感受的，还有目之所及，我们可以看到更多的景色，我们可以看到更多的色彩，我们可以看到更多我们喜欢看的，所以它既是人的需求，也是人的欲望。</span></p><p><strong><span>便嬖不足，使令于前与。</span></strong><span>便嬖是指的得到大王宠幸的人，可以侍奉在前，也就是乖巧的人，我们这句话要去思考一下。</span></p><p><span>首先他是宠幸的人，如果不是他宠幸的人，他就不希望服侍，在自己的身前，所以既是他宠幸的，是他喜欢的，又可以侍奉在前，我们称之为便嬖，这句话同样是反问，说难道您宠幸的喜欢的人，服侍在前的人还不够使唤吗？</span></p><p><span>简单来讲，也就是侍奉您的人还不足够吗？我们看以上的这几句反问，显然齐宣王是足够的，无论是他能吃到的肥美甘甜的食物，还是他穿到的轻快保暖的衣服，亦或是他听到的看到的，包括宠幸喜欢的仆人，显然作为一国之君，都是足够的。</span></p><p><span>这里孟子为什么还要去反问呢？他是在帮助齐宣王，去剖心，去看一看，告诉他你现在拥有的，已经足够多了，你所拥有的已经是别人望尘莫及的。你为什么还是不能关注到你的百姓和你的子民呢？你还是不停地想要去称霸，并没有那么多仁爱之心。</span></p><p><strong><span>王之诸臣，皆足以供之，而王岂为是哉。</span></strong><span>以上所说的这些，即使是大王您身边的大臣，都足以供应和享受。也就是齐宣王的身边大臣，都可以满足以上的一些生活需求。大王您难道是为了这些事情吗？</span></p><p><strong><span>曰：否，吾不为是也！曰：然则王之所大欲，可知已。</span></strong><span>说当然不是为了这些。孟子说如果是这个样子，并不是为了以上所说的这些，那大王您的愿望，可以知道。</span></p><p><strong><span>欲辟土地，朝秦、楚。</span></strong><strong><span>莅中国，而抚四夷也。</span></strong><span>开疆拓土，想称霸诸侯，朝秦、楚，让秦国和楚国来齐国朝贡。这里的秦楚也只是代称，因为那个时候，秦国和楚国是比较强大的，如果秦国和楚国都来朝拜，那就说明，他已经称霸于诸侯了。</span></p><p><span>莅中国，而抚四夷，也就是君临天下，去安抚四夷，就是曾经齐桓公、晋文公所做的事情，其他的诸侯国都来朝拜，这个时候，他是作为霸主的身份，安抚周边的四夷。</span></p><p><strong><span>以若所为，求若所欲，犹缘木而求鱼也。</span></strong><span>以若所为，就是以您现在的行为。求若所欲，想要达到你想实现的愿望。犹缘木而求鱼也，什么叫缘木求鱼？就是爬到树上去抓鱼，你想要去抓鱼，你却顺着木头去抓鱼，显然是错误的。</span></p><p><strong><span>王曰：若是其甚与？</span></strong><span>这个时候齐宣王反问了一句，有这么严重吗？孟子讲缘木求鱼，也就是告诉齐宣王南辕北辙了。这样你是越错越大，越走越远，你想要去抓鱼，你却到木头上去抓，整个的方向都是错的。</span></p><p><span>这个时候齐宣王很不解，我想称霸于诸侯，不就是要动员军队去打仗吗？就是应该好战，才可以让别人去屈服，怎么会像孟子说的这么严重，我们看看孟子是如何回答的？</span></p><p><strong><span>曰：殆有甚焉！缘木求鱼，虽不得鱼，无后灾。</span></strong><span>说比这个还要危险，还要严重，如果是缘木求鱼，虽然得不到鱼，但是没有后患，没有后灾。缘木求鱼，大不了你没有抓到鱼而已，并没有什么后患。</span></p><p><strong><span>以若所为，求若所欲，尽心力而为之，后必有灾。</span></strong><span>如果以现在的行为，想要达到您心中的愿望，心中的所想，如果尽全力而为之后，必有灾。</span></p><p><span>我们再来看这句话，说齐宣王如果总是动员军队兴兵打仗，越是尽心力而为，你后面的隐患就会越大，我们去读历史的时候，果不其然，孟子是言中了的，讲对了，后来的齐国非要去攻打燕国，最后燕国联合了其他的诸侯国，齐国大败，从此以后开始走向衰落，这就是孟子讲的后必有灾。</span></p><p><span>因为他不停地想要动员军队，那么如果你动员军队，你自己的国家就会产生内乱，这个时候构怨于诸侯，跟其他的诸侯之间，都是结怨的，那么必然遭到群起而攻之，这不是后面的灾祸吗？</span></p><p><span>所以孟子讲，它比缘木求鱼要严重得多，缘木求鱼无非是方向走错了，没有得到鱼，可是如果你以这样的行为做下去，齐国是要有很多的灾难和祸患的。</span></p><p><span>这是这一段，孟子和齐宣王的对话，我们可以看到，孟子把齐宣王的心理剖析得非常之清楚。讲到了他的欲望，他的心中所想，又讲到他的行为和他的目标之间，是并不一致的。犹如缘木而求鱼，就是他的目标要想去实现，他并不是这样去做的。</span></p><p><span>如果你想称霸于天下，那么你首先就要安内，是要让你的国内趋向于平稳的，百姓是安居乐业的。你要去施仁政，你才可能称霸于诸侯，否则你是没有办法称霸于诸侯的，这就叫缘木求鱼。也就是你设定的目标，跟你的行为是不一致的，是南辕北辙的。</span></p><p><span>我们这里就要讲缘木求鱼了，看看我们在生活当中，有哪些事情是缘木求鱼的？</span></p><p><span>举个例子，有的人说我出去参加工作，或者说我创业，他有一个目标，这个目标是希望家庭过得更幸福，感情变得更和睦，可是一旦你做了事业以后，你开始变得只有应酬，甚至开始已经不理家里的事情，请问你的这些行为跟你的目标是一致的吗？是不是缘木求鱼啊。</span></p><p><span>再举个例子，有的人说，我希望我的孩子开心快乐就好了，可是这是你的目标，但你的行为却逼着他，做自己并不喜欢的事情，你从来不管他的兴趣，不管他的喜好，他要如何去快乐呢？这不是缘木求鱼吗？</span></p><p><span>再比如说，有的人说想追求清静的生活，没问题，可是当你有了这个目标以后，你还不停地去找更多的事情，这不是缘木求鱼吗？当你想要清静，就是要少事情才对。</span></p><p><span>再比如说，有的人的目标说，我就是轰轰烈烈的要做一番事业，我要实现自己的价值，可是在这个过程当中，你又怕辛苦，你又怕别人来打扰了你的清静，这不是缘木求鱼吗？</span></p><p><span>所以我们首先要有目标，这个目标是要在正确的价值观的前提之下，接下来就是你的行为和你的目标是要一致的，是要相符的，否则就是缘木而求鱼。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-10 寡不敌众",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王上 ⑦-10寡不敌众</strong></span></p><p><span><strong>曰：“可得闻与？”曰：“邹人与楚人战，则王以为孰胜？”曰：“楚人胜。”曰：“然则小固不可以敌大，寡固不可以敌众，弱固不可以敌强。海内之地，方千里者九，齐集有其一；以一服八，何以异于邹敌楚哉？盖亦反其本矣。”“今王发政施仁。使天下仕者皆欲立于王之朝。耕者皆欲耕于王之野。商贾皆欲藏于王之市。行旅皆欲出于王之塗。天下之欲疾其君者，皆欲赴愬于王。其若是，孰能御之？</strong></span></p><p><span>我们再来回顾上一讲，我们所学习的内容，孟子与齐宣王之间对话，齐宣王认为自己的思维和行为是正确的。他想要称霸于诸侯，那称霸于诸侯，当然要用武力去称霸，要去动员我的军队，让其他的诸侯臣服。</span></p><p><span>可是孟子却告诉齐宣王，这是缘木求鱼。方向完全错了，你爬到树上怎么可能抓到鱼呢？这句话自然会引起，齐宣王的兴趣。我们来思考其中的道理，当你认为自己的观点和行为是正确的，这个时候有人对你讲，这叫缘木求鱼。</span></p><p><span>整个方向完全错了，我们自然就会产生兴趣，想要去问为什么我是缘木求鱼呢？我到底错在哪里？我们接下来看孟子为何讲齐宣王在缘木求鱼，他到底方向哪里错了呢？</span></p><p><span><strong>曰：“可得闻与？”</strong>这个时候齐宣王讲了，既然孟子您说我是缘木求鱼，可以说来听一听吗？到底错在什么地方呢？孟子接下来举了一个例子，来反问齐宣王。</span></p><p><span><strong>曰：“邹人与楚人战，则王以为孰胜？”</strong>邹国很小的国家，而楚国是一个大国，邹国很小的国家与楚国很大的国家两国交战，大王您以为谁会胜呢？我们去看这是讲话的智慧，我们举的例子一定是显而易见的，让对方直接可以看到的。</span></p><p><span>如果这里孟子所举的例子，是两国的实力相当，你去问谁会获胜，他是很难回答的。我们这一点要应用在生活当中，我们想给他人讲一个什么样的道理？我们举的例子，一定是显而易见的，对方一下就可以明白，这个时候我们才能继续往下去分享讲解。当然齐宣王的回答是毫无疑问的。</span></p><p><span><strong>曰：“楚人胜。”</strong>那既然是以小不能胜大，邹国不能胜楚国。这里孟子要开始讲这个例子的结论。</span></p><p><span><strong>曰：“然则小固不可以敌大，寡固不可以敌众，弱固不可以敌强。”</strong>这里讲了三个对比，小是没有办法敌大的。寡是没有办法胜重的。弱是没有办法胜强的。</span></p><p><span>我们看这个结论它并不绝对，所以叫然则。也就是由此可见，通常来讲，小是不可以胜大的，寡是不可以胜众的，弱是不可以胜强的，得出这个结论以后，接下来就要开始具体的讲到了，齐国和其他国家之间的关系。</span></p><p><span>我们这里先来延伸思考，看一看我们生活当中想要的到底是什么？我们在生活当中，想让自己变得更大，想要变得更强，想要变得更多。举个例子，我们想让自己的智慧变得更多。我们想让自己的财富变得更多。我们想让自己的能力变得更强。我们想围绕在我们身边，跟随在我们身边的人变得更多。</span></p><p><span>总而言之我们都想要变得更大，变得更强，变得更多，我们就要思考如何才能变得更多呢？</span></p><p><span>如何才能让我们变得更强大，这是我们需要去思考和需要去做到的。如果我们不能去变得更强大，当然你没有办法与别人匹敌，如果我们不能让自己变得更多，你就没有办法让生活变得更好。如果我们不能让自己变得更优秀，你就没有办法去给予他人更多。</span></p><p><span>我们先把这个问题放在这里，如何变大，如何变强，如何变多，我们接下来期待孟子会给我们什么样的答案。</span></p><p><span><strong>海内之地，方千里者九，齐集有其一；以一服八，何以异于邹敌楚哉？</strong>我们来看这句话，海内之地指的是整个中国，方千里者九指的是方圆这么大的地方，有千里国土的国家有九个，齐集有其一，而齐国只占其一，也就是齐国占整个中国疆土的九分之一。</span></p><p><span>那么问题来了，以一服八，何异于邹敌楚哉，如果齐宣王您想用武力去征服天下，那就相当于以一服八，那不就是邹国与楚国为敌吗？刚才齐宣王自己讲到邹国和楚国谁会获胜呢？自然是楚国，因为楚国是大国。</span></p><p><span>以小是不可以敌大的，那么今天您齐宣王的行为，不就是在以小敌大，以寡敌众，以弱敌强吗？请问你只占九分之一，你要如何以一服八呢？我们看服字用得很好，何为服？我们去征战，我们去把对方打服，这个称之为服。你一个国家，怎么可能打过其他国家的联合呢？所以这就叫缘木求鱼，因为你整个方向就错了。</span></p><p><span><strong>盖亦反其本矣。</strong>盖是何不、为何，为何不反到根本上来。我们讲缘木求鱼，整个出发点就错了。你想要以齐国一国之力，对抗其他的那八个国家综合在一起的力量，这就是缘木求鱼。</span></p><p><span>你不可能以小胜大，不可能以弱胜强，要想实现你心中的愿望，不是你动员武力出兵可以解决的问题。你需要反到根本上来，我们去看一看何为根本，到底该怎样去做呢？</span></p><p><span><strong>今王发政施仁。</strong>今天大王您要发布政令，发布改革，要推行仁政，推行仁政会达到什么样的结果。</span></p><p><span><strong>使天下仕者皆欲立于王之朝。</strong>天下仕者指的是有志之士，指的是想要做官之人，如果齐国可以施行仁政，天下有志之士皆欲立于王之朝。都想来到齐国的朝堂来为官，来做事情为什么会这个样子呢？</span></p><p><span>既然是天下的有志之士，说明他学的都是如何为民请命的文化和思维，那么齐国如果施行的是仁政，是德行。这些有志之士自然想来齐国，实现自己的政治理想抱负。</span></p><p><span><strong>耕者皆欲耕于王之野。</strong>耕者指的就是农民指的是百姓。如果齐国可以施行仁政，那么农民百姓都愿意到齐国的土地上来耕种，因为施行的是仁政。对百姓和农民是有益的，有帮助的，那么他们当然想来到齐国种田，可以让自己丰衣足食。</span></p><p><span><strong>商贾皆欲藏于王之市。</strong>商贾，我们现在泛指商人，在以前商和贾是两个概念，商指的是行商之人，也就是走动的经商之人。贾指的是坐商，有自己固定的经营场地场所，所以商贾我们叫做商人。</span></p><p><span>商贾皆欲藏于王之市，我们重点看这个藏字，自古以来皆如此，商人做生意最担心的是不是动乱？或者是偷盗、抢劫所以如果你这个国家施行的是仁政，国泰民安社会上没有动乱这个时候商人才愿意到这样的环境当中来经商。</span></p><p><span>因为商人是有钱的，一旦出现动乱，民不聊生，那么自然会出现抢劫和偷盗，商人是要承受巨大的损失的。所以如果齐国施行仁政，国泰民安，百姓丰衣足食，他是想来到这个地方经商的，因为他可以很安全的，隐藏在其中。</span></p><p><span><strong>行旅皆欲出于王之塗。</strong>行旅指的是旅行者，外出之人，即使我们现在也是如此，我们想到一个地方去旅行，我们首先考虑的是那个地方是否安全，我的人身是否可以有保障，所以如果齐国施行的是仁政，环境是安全的，这个时候其他国家的旅人，自然愿意行走在齐国的道路上。</span></p><p><span><strong>天下之欲疾其君者，皆欲赴愬于王。</strong>疾就是痛恨。天下有痛恨自己国家君主的人，皆欲赴愬于王，都想到齐国找大王您，来控诉、来倾诉，因为您施行的是仁政，所以是正直清明的，跟那些国君是不一样的、不同的，所以他有什么冤屈，有什么痛恨，都愿意来到齐国倾诉。</span></p><p><span>那我们回头再来看一看，孟子所描绘的场景，如果齐国是施行仁政的，那么首先天下的有志之士，想来到齐国为官，那么这些有志之士自然会帮助齐宣王，来治理整个国家。那么接下来，治理好了整个国家，百姓自然愿意到齐国来耕种，他可以丰衣足食，安居乐业，这个时候，民生就有了保障，也就是保民。</span></p><p><span>当为官之人是亲政的，是仁德的，百姓是丰衣足食的，各国的商人就愿意来到齐国经商，因为他可以很好的去做自己的生意，并且没有动乱的事情发生，这个时候其他国家的旅人也愿意出现在齐国，因为这里是繁荣的，是安全的，是富足的。</span></p><p><span>那么这个时候，还有其他国家的人，对自己的国家不满意的，都愿意来到齐国，来倾诉自己心中的烦恼，来寻求正义和帮助。那么如此，这是天下归心的状态，并不是以一服八。</span></p><p><span>以一服八你要动用的是武力，想要用强去称霸天下，怎么能长久呢？可是如果你实行仁政，天下民心自然归附。</span></p><p><span><strong>其若是，孰能御之？</strong>如果能做到这个样子，天下谁能阻挡，没有办法可以阻挡齐宣王您，称霸天下。所以我们学习了《孟子》，我们学习了《论语》，学习了《大学》，学习了《中庸》</span></p><p><span>推行的都是仁政，学习的都是尧、舜、禹、汤、文王、周公这些人。</span></p><p><span>我们可以看到这些古之贤君，都是在施行仁政，所以天下人心归附，这就叫保民而王。他不需要去动用武力，只需要用仁政去治理天下，那么自然就会得到一个好的结果。</span></p><p><span>我们再回到刚才所讲的问题，一个人如何要变大，如何变强，如何变多呢？用孟子的思维来总结，就是发政施仁，作为一个国家，如果你想让自己变大变强，非常简单，不是靠武力变强，而是靠仁政变强。</span></p><p><span>当你去实行仁政，愿意来到齐国的人就会变得更多，你自然就会变大，自然就会变强。我们去看，在生活当中也是如此，你想让自己的能力变强，那么你就要多付出，那也就是仁德的体现。</span></p><p><span>比如说工作，我想让我的工作能力变强，你就多在工作当中去付出，多为别人去着想，为你的领导，为你的同事，为你的客户，你越是在付出，越是在给予，那么这个时候，你的能力自然就会变强。</span></p><p><span>比如说，我想让我的生意变得更大，你就想着如何给我们的顾客和消费者，提供更多的价值和帮助，还是一个仁字，如果你不停地去帮助更多的消费者，更多的顾客因为你而得到了帮助，那么你的生意自然就会变大，你的财富自然就会变多。</span></p><p><span>再比如说，我们如何让跟随在我们身边的人变多，同样这个道理，你要多去付出和给予他人，你所付出的人，你所帮助的人越多，就有越多的人，愿意跟随在你的身边，你要想变大变强变多，其实方法特别简单，就是一个仁字。</span></p><p><span>你不停地去给予和付出给他人，我们自然就会变得更多，比如说感情亦是如此，我如何可以跟他人之间的感情，变得更深厚呢？</span></p><p><span>是你不停地给他更多的帮助，给他提供更多的价值，那么我们之间的感情，自然就会变得更深，一个仁字，它可以让我们的生活变得更好，可以让我们的能力变得更强，可以让我们的智慧变得更多，也可以让我们的生活变得更富足。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-11 恒产与恒心",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王上⑦-11恒产与恒心</strong></span></p><p><span><strong>王曰：吾惽，不能进于是矣。愿夫子辅吾志，明义教我，我虽不敏，请尝试之。曰：无恒产而有恒心者，惟士为能。若民，则无恒产，因无恒心；苟无恒心，放辟邪侈，无不为已。</strong></span></p><p><span>我们在上一讲的课程当中，可以看到孟子对齐宣王，描绘了一个君主喜爱的这样一个场景，当一国之君懂得去推行仁政，所有的有志之士，读书人，想要为官之人，想要来到这样的国家做事情、为政。</span></p><p><span>那么商人想要来到这样的国家经商，因为更安全，可以让自己的货物、财物得到保障。农民愿意来到这样的国家来耕地，可以安居乐业，旅人也喜欢来到这样的国度，因为国泰民安，他的安全出行都是有保障的，对于自己的国家不满意之人，也想来到这样的国家来倾诉。</span></p><p><span>这样一个画面，对于一个一国之君来讲，他是非常具有吸引力的。但是并不是所有人都能做到这个样子，每个人在面对自己想要去做的事情，或者一个美好的场景，都会衡量自己当下的现状。</span></p><p><span>比如说我们也是如此，当别人描绘了一个什么样的场景，在我们的面前，这个时候我们要衡量，我自己当下的智慧，可以达到吗？我自己当下的德行，是否足够呢？我们接下来去看齐宣王，他是如何讲的。</span></p><p><span><strong>王曰：吾惽不能进于是矣。</strong>吾惽指的是头昏脑胀，我没有那么多的智慧，没有那么明达，进就是前进，达到。于是矣，就是孟子所描绘的施行仁政以后的场景，那个状态，所以这里齐宣王讲到，说我没有那么明智，不能前进到您说的这个样子。</span></p><p><span><strong>愿夫子辅吾志。</strong>希望夫子您可以辅助我，实现自己的志向。我们再去回顾齐宣王他的心理变化，齐宣王最开始是想称霸于诸侯，所以问的是齐桓公以及晋文公的事情。但是孟子告诉齐宣王，齐桓公和晋文公的事情我们不清楚，因为仲尼之徒并没有去传述，我却可以讲如何称王于天下，如何去实行仁政。</span></p><p><span>这个时候齐宣王又讲到，他只不过是想实现自己的大欲。孟子去反问齐宣王，难道您动员军队，让你的士臣处在危机之中，结怨于诸侯，会让你的内心觉得快乐吗？齐宣王说不会，我怎么会快乐呢？只是为了实现我心中的大欲。</span></p><p><span>所以接下来孟子又问，您的大欲是什么？可以讲来听一听吗？王笑而不言。欲望是没有办法讲出口的，但是我们注意，到这里齐宣王的心理，发生了巨大的变化。他在讲愿夫子辅吾志，希望您帮助我实现自己的志向，一个是欲，一个是志。</span></p><p><span>我们再看看志向的志，一个士加上一个心。通常我们讲有志之士，什么叫有志之士？也就是有心之士。</span></p><p><span>我们来举个例子，比如说在生活当中，别人会对你讲，说你有心了；领导对你讲，说你有心了；或者你的爱人对你讲，说你有心了；或者是父母对你讲，说你有心了。</span></p><p><span>我们这里要去思考，什么叫有心之士？是你心中有他人，做了利益和帮助别人的事情，所以这个时候，别人会说你有心了。因为你心里装的是他人，我们就可以看到志和欲的区别。</span></p><p><span>欲是满足自己的欲望，是自私的，是为己的。但是有志之士，心里装的是别人，心目中有他人。你去想的是如何为他人服务，所以这里齐宣王说，愿夫子辅吾志。希望您帮助我实现自己的志向，也就是如何去保民。</span></p><p><span>齐宣王最开始的欲望，是称霸于诸侯，但是现在的志向变了，变成了保民，如何让百姓过上更好的生活，一个是欲，一个是志。这两个字在我们生活当中，极其重要。</span></p><p><span>比如说，如果我们自己做一件事情，是为了实现自己的欲望。这个时候，你不会产生强大的力量，并且没有人愿意去帮助你。可是如果你有的是志向，你是心目中有他人，是利益他人的，就会有更多人愿意去帮助你，实现自己的志向。</span></p><p><span>再比如说，如果你心中装的是欲和志，这两者是不同的，会导致你的行为不一样。我们举个例子，比如说一个教学生的老师，我想的是如何可以涨工资，如何可以评上职称，你可以看到他的这种欲望，就会让他的行为去做表面的工作，不会注重实质的对于学生的教育。</span></p><p><span>我们再去想什么叫做志向呢？心目中有学生，如果一个老师他是有志向的，他在想着如何让这些学生变得更有道德，如何让这些学生变得更优秀？那么再大一点的志向，你教育好下一代的学生，这些人会为国家和社会做更多的贡献。</span></p><p><span>你看一个是志，一个是欲。当出发点不同，你接下来的行为，全然是不同的。我们再举一个其它的例子也一样。</span></p><p><span>比如说齐宣王，如果他的欲望是称霸于诸侯，他不会在乎百姓的死活，不会在乎百姓是否安居乐业。可如果他是有志向之人，是心目中有百姓的，他想的不是自己的欲望，不是如何称霸，而是如何让百姓过得更好，生活更幸福，更稳定。</span></p><p><span>他的志向，自有百姓们愿意帮助他，一起去完成。所以我们要学会把心中的欲望，转化成志向，当你是有志向的，你可以坦然地讲出口，并且会有更多的有志之士愿意帮助你，实现自己的志向。</span></p><p><span>我们再来看齐宣王，愿夫子辅吾志，明以教我。希望夫子您可以辅助我，实现自己的志向。明明白白地教给我，到底该如何去做，如何才可以实现我心中的志向呢？</span></p><p><span><strong>我虽不敏，请尝试之。</strong>不敏就是没有那么聪明，反应没有那么快，我虽然没有那么聪明，但是只要您愿意明白的教给我。我愿意尝试着去做去达到，所以我们可以看到齐宣王与梁惠王、梁襄王是有所不同的。</span></p><p><span>我们从《孟子》开篇讲到这里，孟子对于齐宣王讲的话是最多的。因为齐宣王他自己，本有一颗仁德之心，所以才能看到有人牵牛过堂祭钟，而以羊易之。足可以看到他内心的仁德之心，只不过这种仁德之心，没有把他更好的发扬光大，没有把他推广出去，恩及于百姓，那么功不至于百姓，所以就没有办法把这种仁德发挥的更大。</span></p><p><span>通过孟子与齐宣王的交流，齐宣王这里讲，请尝试之。他是愿意照着去做，我们可以看到齐宣王的诚意，并且他诚恳的想要改变自己的欲望，转化成志向。</span></p><p><span>孟子接下来就要去讲，具体如何实行仁政，对于一个一国之君来讲，最重要的是民生问题，保民而王。你关注点应该在百姓身上，如果百姓生活的好，他可以侍奉自己的父母，可以畜养自己的妻儿，可以养生丧死，这个时候，整个社会就是安定的。</span></p><p><span>孟子首先讲了一个定论，<strong>曰：无恒产而有恒心者，惟士为能。</strong>我们看这里两个关键词，一个叫做恒产，一个叫做恒心。产指的是产业，恒是恒定不变的，可以长期拥有的。</span></p><p><span>你要让百姓有恒定的产业，这个时候，他的内心才会有安全感，当他的内心有安全感，就不会动荡不安，去做违法犯纪的事情。我们去想一想，我们中国人喜欢买房买地，为什么呢？是因为恒产二字。</span></p><p><span>我们可以去思考自己的生活，一个有恒产的人，他的内心是更容易安定的。比如说你有自己的房子，你有自己的土地，这个时候你的心会很稳。比如说你生活在某一个城市，或者你生活在某一个乡村，你在这个地方有产业。</span></p><p><span>比如说房子和土地，这个时候你对这个地方，会有深深的眷恋，你觉得这里是你的家，你可以在这里安居，进而乐业。我们再去看恒心，恒心指的是有信念之人，有恒产就会有恒心。</span></p><p><span>举个例子，比如说你有自己固定的产业，这个时候你的信念是坚定的，无论你做任何事情</span></p><p><span>你有根基在，你就不容易动摇。如果没有恒产，就很难去有恒心，你没有办法坚定自己的志向，持之以恒的去做某一件事情。</span></p><p><span>比如说，我们在一个企业当中都一样，如果一个员工，在一个企业当中，他是得到重用的，是被重视的。他的工资拿的是高的，职位做的是高的，这个时候他的信念感是很强大的。因为相对而言，他有一个恒产在，他认为他的工作是稳定的，所以我们可以看到，很多我们身边的朋友，是喜欢长期稳定的工作的。</span></p><p><span>比如说我们讲到的公务员，我们讲到的铁饭碗，是因为他工作很稳定，所以这个时候，他的内心也稳定，就会产生极大的信念感。我们再看这句话，无恒产而有恒心者，惟士为能，如果没有固定的产业，还能有信念有恒心的，只有有志之士，才可以做得到。</span></p><p><span>提到有志之士，我们不禁要想起颜回，一箪食，一瓢饮，在陋巷，人不堪其忧，回不改其乐，贤哉，回也。这是典型的代表。他并没有恒产，并没有自己富足的生活，并没有自己的产业，但是依然有坚定的信念，有恒心，有利他之心，所以我们称之为，有志之士。</span></p><p><span>我们讲了什么叫做志，心目中有他人的人，懂得为他人着想和帮助他人的人，一个人如果没有恒产，还可以有帮助他人之心，这就是有志之士，实在是难能可贵。但是大部分人做不到，大部分人首先都是自私的，他都是为己的，我自己拥有的更多，我才会去帮助他人。</span></p><p><span>所以我们经常可以听到身边的人在讲，我为什么要帮助他人，谁来帮助我呢？但是我们学习了圣贤文化，我们要追求的是，做一个有志之士，无论我们有什么，还是没有什么，都可以达到有恒心，都可以心目中有别人，做一个帮助他人的人。</span></p><p><span>当我们懂得去帮助他人，也就是仁义而已矣。你是在不停地帮助他人的过程当中，利字不用求，结果自然发生。但是我们还是要回到孟子的定论当中，绝大多数人是做不到的。所以告诉齐宣王，想要治理好一个国家，首先要明白一条定论，无恒产而有恒心者，惟士为能。只有有志之士，才可以做到无恒产而且还有恒心。</span></p><p><span>若民，则无恒产，因无恒心。普通的百姓，因为没有固定的产业，因而没有恒心，他是没有自己的志向的，他不会心目中有别人，也就没有办法顾及到礼仪廉耻。</span></p><p><span>大多数的百姓，他先需要安居乐业，有自己恒定的产业，才可能有恒心，具有利他之心，有信念有志气。不光孟子讲这样的道理，春秋时期的管仲，也讲过同样的道理，<strong>仓廪实而知礼节，衣食足而知荣辱。</strong>仓廪实指的有足够的粮食，他有足够的粮食，有足够的生活物资，这个时候才会知礼节。</span></p><p><span>衣食足而知荣辱，他的衣食是富足的，这个时候才在意荣和辱，所以我们去看一个国家的国君，想要治理好一个国家，就是先保民，先保民就是给他恒定的产业，让他可以解决自己的温饱问题，可以安居乐业。</span></p><p><span>在安居乐业的基础之上，才可能会有礼仪廉耻。这里的礼仪廉耻也就是孟子所讲的恒心。所以恒心又代表了一个人的志向，一个人的信念，一个人的礼义廉耻，一个人的道德观念。</span></p><p><span><strong>苟无恒心，放辟邪侈，无不为已。</strong>放辟邪侈指的是肆意妄为去作恶，如果一个人他没有了恒心，这个时候他就会违法犯罪，肆意妄为，他做的事情是恶的，是不正派的。无不为已，什么事情都做得出来。</span></p><p><span>所以我们读历史的时候，可以看到一种情况。如果百姓开始吃不上饭，没有自己固定的产业，这个时候他要开始偷盗，要开始抢劫，因为他的生活得不到保障，当他面对生命危机的时候，他怎么可能还有道德观念，怎么可能还有礼义廉耻。</span></p><p><span>所以这里孟子告诉齐宣王，你想要让一个国家安定，首先要解决的就是百姓最基本的生存问题。我们这里再来延伸一个观念，通常我们说人是高级动物，高级动物也是动物的一种，所以我们可以去看看，动物的特点和习性是什么？</span></p><p><span>我们说燕子，它需要有自己的窝，我们说其它的动物也是一样，它需要有一个固定的住所，让它有安全感，它需要有食物，如果吃不到食物，动物的本性就会暴露出来。</span></p><p><span>我们人是不是如此？当一个人如果吃不饱穿不暖，没有可以让自己遮风避雨的地方，人心是不安的，是浮动的，也就是苟无恒心，放辟邪侈，无不为已。如果没有了这颗安定的心，没有了礼义廉耻，就会肆意妄为，没有什么事情是做不出来的。</span></p></div>"
},{
    "title": "《孟子》梁惠王上⑦-12 王之根本",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》27梁惠王上⑦-12王之根本</strong></span></p><p><span><strong>及陷于罪，然后从而刑之，是罔民也。焉有仁人在位，罔民而可为也？是故明君制民之产，必使仰足以事父母，俯足以畜妻子；乐岁终身饱，凶年免于死亡；然后驱而之善，故民之从之也轻。“今也制民之产，仰不足以事父母，俯不足以畜妻子；乐岁终身苦，凶年不免于死亡；此惟救死而恐不赡，奚暇治礼义哉？”“王欲行之，则盍反其本矣！五亩之宅，树之以桑，五十者可以衣帛矣；鸡豚狗彘之畜，无失其时，七十者可以食肉矣；百亩之田，勿夺其时，八口之家可以无饥矣；谨庠序之教，申之以孝第之义，颁白者不负戴于道路矣。老者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。”</strong></span></p><p><span><strong>及陷于罪，然后从而刑之，是罔民也。</strong>及指的是直到，因为没有给百姓提供恒产，他就没有恒心，没有恒心就会肆意妄为。及陷于罪，直到他开始犯罪。然后从而行之，犯罪国家是要用法律，去制裁这些犯罪之人的。</span></p><p><span>是罔民也，罔民是陷害的意思。这里孟子告诉齐宣王，如果因为你没有给百姓提供恒产，他走上犯罪的道路。你在用刑法去惩罚于他，你这就是在陷害百姓。</span></p><p><span>我们可以看孟子把这句话说得很重，说百姓走上犯罪的道路，不怪百姓，是怪你一国之君。</span></p><p><span>你并没有让百姓安居乐业，所以才发展到了今天。你这不是陷害百姓又是什么？我们可以看到这就是圣人的思维。</span></p><p><span>他总是在自我反省，自我反思，当百姓开始犯罪，他不是看到的百姓本身有问题。他是看到的一国之君，你治理国家的方法有问题。是因为你没有去推行仁政，所以才让百姓走到了今天的地步。</span></p><p><span>这是你在罔民啊，是你陷害百姓，这种自我反省，自我思考，我们要用到生活当中去。比如说为人父母之人，如果你的孩子并不成才，或者他经常犯什么样的错误，难道真的要去怪孩子吗？不是我们没有给他更好的教育吗？不是我们没有给他建立更正确的价值观吗？所以他才走到了今天。</span></p><p><span>我们去经营一个企业也是如此，我们和他人相处也是如此。比如说跟朋友之间，比如说跟爱人之间，如果对方总是犯什么样的错误，难道我们自己是没有责任的吗？</span></p><p><span>所以我们学习儒家文化，学会反观自省是很重要的。当一件事情的结果呈现出来，我们要去思考自己哪里有不足的地方。是什么地方我们没有做到，没有想到，才导致今天的结果发生。</span></p><p><span><strong>焉有仁人在位，罔民而可为也？</strong>怎么会有仁德的君主去做陷害百姓的事情？</span></p><p><span><strong>是故明君制民之产，必使仰足以事父母，俯足以畜妻子。</strong>得出一个结论，一个明德的君主，在规划百姓的产业之时，仰指的是对上，对上足以侍奉父母。俯是对下，对下足以抚养自己的妻儿。</span></p><p><span><strong>乐岁终身饱，凶年免于死亡。</strong>乐岁指的是好的年头，好的年头大家都可以吃饱，即使出现荒年，大家也不至于饿死在道路上。</span></p><p><span><strong>然后驱而之善。</strong>我们看驱，驱赶引导，首先要让百姓吃饱，并且他足以养家糊口。对上可以侍奉自己的父母，对下可以畜养自己的妻儿。在好的年头，大家可以吃得很好，荒年不至于饿死在道路上。</span></p><p><span>在这个前提和基础之下，你要去驱赶他，去引导他向善，也就是我们讲到的恒心，恒心他是有志向的，是有志之士心目中有别人的。他在自己解决了温饱的问题，再去引导帮助更多的人顾及到礼义廉耻。</span></p><p><span><strong>故民之从之也轻。</strong>轻是容易，所以说百姓想要去跟从，也比较容易。我们再来看这一段，如果一个百姓他没有恒产，甚至连温饱都没有办法解决，这个时候你想让百姓向善，是很难的，不容易，但是一个明君不是这样做的，明君在规划百姓的产业之时，是让他足以养家糊口的，对上我们可以奉养父母，对下可以畜养妻儿。</span></p><p><span>这个时候你在驱之向善，他要顾及礼义廉耻，他要有道德，要懂得去帮助他人。这个时候百姓想要去跟随你的教化，是非常容易的事情。孟子首先讲了一个定论，无恒产就没有恒心，如果没有恒定的产业，是没有办法有恒心的。如果有恒心都是有志之士，毕竟是少数人。</span></p><p><span>接下来又讲到，作为一个圣明的君主，在规划百姓的产业，是可以足够的安居乐业。那么接下来，看看我们齐国的现状。</span></p><p><span><strong>今也制民之产，仰不足以事父母，俯不足以畜妻子，乐岁终身苦，凶年不免于死亡。</strong>今天我们给百姓规划的产业，对于上我们没有办法奉养自己的父母，对于下我们没有办法畜养自己的妻儿。</span></p><p><span>即使在好的年头，人们的生活也是很苦的，到了荒年，还要饿死在道路上。所以如何让百姓去有恒心呢？我们不能要求所有人都是有志之士，在没有恒产的情况下，还能有恒心，还能顾及到礼义廉耻，道德观念，大多数人都是做不到的。</span></p><p><span><strong>此惟救死而恐不赡，奚暇治礼义哉。</strong>我们看这里的救死，就是想要活着，不赡是不足够，来不及，达不到。治是管理顾及。一个人连温饱都没有办法解决，想要活着都很难达到。唯恐不及，他又如何去治理自己的礼义道德呢？</span></p><p><span>我们从这里延伸两个角度，第一个角度，我们要做一个有志之士，要做一个心目中有他人的人，即使是没有恒产，也要有坚定的信念，要有一颗利他之心，这是从自己出发的角度。</span></p><p><span>我们还要有第二个角度，就说我们在治理一个国家，或者是治理一个团队的时候，我们要懂得想让他人有恒心，我们必须先让他有恒产。</span></p><p><span>我们举个例子，比如说在生活当中也是如此，说我们跟爱人之间，想让他对这个家有恒定的信心，我们就要给他提供更多衣食上的富足。我们要给他一些恒产，才会让他的内心有安全感。我们不能奢求所有的人，都变成有志之士。</span></p><p><span>再比如说我们去经营一个企业，带领一个团队也是一样的，我们要懂得去给他人建立恒产，让他的内在是有安全感的，他才会有恒心。</span></p><p><span>我们去治理一个国家更是如此，你想让百姓都有恒心，你就要让他有恒产。所以这两个角度</span></p><p><span>我们要学会在生活当中，不停地去转换，自我要求，自己无恒产而有恒心。对于他人，我们要懂得让他有恒产，然后引导他向善，去有恒心。</span></p><p><span><strong>王欲行之，则盍反其本矣！</strong>如果大王你想实现自己的志向，何不返回到根本上去呢？最后这一段话是结论，是告诉齐宣王如何返回到仁政的根本上去，也就是保民而王。接下来这段话我们很熟悉。</span></p><p><span>孟子对梁惠王讲了同样的话，从这里我们可以看到孟子不只是讲给梁惠王，也不只是讲给齐宣王。周游列国二十年，不停地再去推自己的仁政的思想，所以无论见任何人，见任何一个君主，都在讲自己的仁政。想让国君回到根本上来，也就是如何保民。接下来的这一段话，由于和梁惠王讲的相同，我们不再具体的讲解，做一下翻译。</span></p><p><span><strong>五亩之宅，树之以桑，五十者可以衣帛矣。</strong>五亩的宅地种上桑树，这样五十岁的人就可以穿上丝绵的衣服，因为它比较舒适轻快，又保暖。</span></p><p><span><strong>鸡豚狗彘之畜，无失其时，七十者可以食肉矣。</strong>家里去养一些鸡豚狗彘，无失其时，不要错过繁殖的季节，这样七十岁的人就可以有肉吃了。</span></p><p><span><strong>百亩之田，勿夺其时，八口之家可以无饥矣。</strong>规划百姓的产业，并且不要耽误了百姓的务农时间，这个时候八口之家可以无饥矣，对于梁惠王所讲是数口之家，其实意思是相同的。你要分给他更多的田地，并且不要影响耕种的时间，这个时候上足以侍奉父母，下足以畜养妻儿，不会挨饿受冻。</span></p><p><span><strong>谨庠序之教，申之以孝第之义，颁白者不负戴于道路矣。</strong>谨慎认真的去办理大大小小的学校，并且反复地教给大家孝悌的道理，去学习更多的文化。如此，年龄大的人就不会负重的奔波于道路之上。</span></p><p><span><strong>老者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。</strong>如果老人家都可以有轻快保暖的衣服，都可以吃上肉，百姓不饥不寒。这个时候如果还不能称王于天下，未之有也，没有这样的事情。</span></p><p><span>所以我们可以看到其中的道理，老者可以穿上丝质类的衣服，可以吃上肉，这就说明大家的生活已经到达了一定的程度。我们现在对于衣帛食肉，会觉得是平常之事，生活当中我们现在穿的都很好，我们都可以吃上肉。</span></p><p><span>可是在战国时期，并不是这个样子的，如果五十岁以上的人，都可以有好的衣服都可以吃上肉，起码说明年轻人，他是不挨饿不受冻的，所以他是改善生活的部分，百姓不饥不寒了，只要达到这样的基础和条件，就可以称王于天下。</span></p><p><span>由此我们可以看到，我们当下的生活是很幸福的，我们没有出生在战乱的时代，没有出生在战国时期。如果出生在那个时期，通过孟子与齐宣王以及梁惠王的对话，我们可以看到，百姓是如何的贫苦，即使在好的年头，还有人吃不上饭。</span></p><p><span>如果到了荒年，街头上有很多饿死的人，那个时候的老人，是没有办法穿上既轻快又保暖的衣服，是没有条件可以吃上肉的。绝大多数人对于上不能侍奉，奉养自己的父母，对于下没有能力养活自己的妻儿。并且人在去世之后都没有钱去治理丧事，所以我们可以想象它是何其痛苦和残忍的一种现状的。</span></p><p><span>所以孟子致力于推行仁德之政，你不能为了满足你自己的欲望了。你不要想着总是称霸于诸侯，你去看看你齐国现在的百姓，对于梁惠王，你看看你现在魏国的百姓。大家的生活都已经到了这个程度，连饭都吃不上，连自己的父母和妻儿，都没法侍奉和畜养，你怎么还在满足于自己的欲望，讲到这里我们《梁惠王上》已经讲完了。</span></p><p><span>我们可以看到，孟子对于梁惠王、梁襄王、齐宣王都在讲仁政，如何去保民，让百姓安居乐业。但是我们可以从中学到更多的智慧，我们学到了义利之辩，我们做任何事情不要以利为先，我们要以义为先，我们去做合适的事情，去做心目中有别人的事情，去做帮助他人的事情，仁义而已矣。</span></p><p><span>当我们越是去做帮助他人的事情，结果是自然呈现的，由此我们也就成为一个有志之士。心目中装着他人的人，当你是一个有志之士，就会有更多人愿意帮助你，来实现你自己的志向，</span></p><p><span>实现你自己的理想。</span></p><p><span>如果我们成了一个满脑子都是利的人，都是为了满足自己欲望的人，我们那些欲望又怎么讲得出口呢？最后一定是得不偿失，看似当下我们得到了一些利，但是从长久来看，一定是有所失的，会有更多的人远离我们。</span></p><p><span>所以义利之辩，是一个千古的话题。我们要学会从义出发，去生活，去工作，去交友，去和爱人相处。我们再看仁义二字，如果我们与别人交朋友，懂得从仁义的角度去出发，你去想着怎么帮助他，怎么给他提供一些贡献和价值，这个时候自然我们身边的朋友就会变多。</span></p><p><span>如果我们去经商，去做生意，如果从仁义的角度出发，我们是如何给他人提供更多的服务和价值呢？这个时候我们的顾客自然就会变多，我们和爱人相处也是如此，如果总是从仁义的角度出发，对方对我们的感情和依赖以及重视，就会变得更多。</span></p><p><span>所以如何让我们变得更大，更强，更多，也就是推行仁政，这是对一个国君来讲推行仁政。对于我们个人来讲就是仁义而已矣，当我们从仁义的角度出发，我们就会变得更大，变得更强，变得更多。</span></p></div>"
},{
    "title": "《孟子》梁惠王下①-1 交流之智",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>梁惠王下①-1</strong></span></p><p><span><strong>庄暴见孟子曰：“暴见于王，王语暴以好乐，暴未有以对也。曰‘好乐’，何如？”孟子曰：“王之好乐甚，则齐国其庶几乎！”他日，见于王曰：“王尝语庄子以好乐，有诸？”王变乎色，曰：“寡人非能好先王之乐也，直好世俗之乐耳。”</strong></span></p><p><span>今天我们开始讲，梁惠王章句下，在《孟子》的开篇，讲了仁义而已矣。告诉梁惠王、梁襄王、齐宣王要实行仁政。</span></p><p><span>那么到了梁惠王章句下，具体的从每件事情上，去引导实行仁政，我们在生活当中也是一样的，我们先学了《孟子》的开篇，仁义而已矣。</span></p><p><span>学了仁德的光辉，学了老吾老，以及人之老，幼吾幼，以及人之幼。从我们自己身上，尊敬自己的父母，爱护自己的儿女开始，这是人性的光辉。也是我们内在本有的仁德，我们把本有的这种仁德，不停地向外发扬光大，就会把仁爱之心不停地向外扩展和延伸。</span></p><p><span>那么具体遇到的事情当中，我们要如何去思考？如何让自己变得更有仁德？我们接下来，开始进入学习的内容。在讲接下来的内容之前，我们先讲一讲交流的智慧，我们到底要如何与他人更好的交流？这其中蕴含着什么样的智慧呢？</span></p><p><span>我们先来举一个例子，比如说，我们去到一个朋友的家里，我们作为客人的身份，如何与主人去交流呢？这个时候我们是要主动地去寻找某个兴趣点，才能更好地交流。</span></p><p><span>我们举例子说，我去到了一个朋友的家里，我可以讲，你这个杯子很漂亮，是在哪里买的？说你家的窗帘特别好看，很雅致，正好我的家里想要换窗帘，不知道从哪里去买。</span></p><p><span>这个时候你找到一个兴趣点，去询问对方，话题由此而打开，如果我们不主动去找一个话题，对方不知道跟我们去聊些什么。</span></p><p><span>我们以此再来延伸，生活当中会遇到形形色色的人，比如说会遇到领导，会遇到德行比我们好的人，会遇到很多比我们有智慧的人。如果我们是处下位的，或者是对方的智慧比我们更高，这个时候我们要想与对方交流，一定是我们主动的去询问，表示出来与对方讲话的兴趣，对方才会多讲。</span></p><p><span>我们学习的《孟子》当中，可以看到孟子与齐宣王讲的话是最多的，为什么呢？有问有答，因为齐宣王内心他是有仁德的，他对于仁政是感兴趣的，所以他才会不停地去询问，表达了自己的兴趣，愿意去学习，愿意去改变，这个时候孟子对他所讲的话自然就是多的。</span></p><p><span>我们看看在平时的生活当中是不是如此？比如说一位老师和一个学生，如果学生对于所学习的内容是感兴趣的。他可以不停地提出问题，那么老师对他的回答自然就是多的。</span></p><p><span>我们再去看领导和员工之间也是如此，如果一个员工，他愿意改变自己，他是积极进取的，并且他总是能提出工作当中的问题，表现出浓厚的兴趣，这个时候领导是愿与他交流和沟通的。</span></p><p><span>我们再比如说，一个大人和一个孩子，要想更好的长久的有效沟通，要怎么办？这个时候我们很多人可能会讲，说大人当然要去迁就孩子，去找话题和他聊，其实这并不正确。</span></p><p><span>如果一个孩子他自己没有兴趣，如果大人去找话题，请问可以聊多久呢？你可以问孩子几岁？在哪里上学？平时喜欢什么？但这个孩子他并没有兴趣，这个时候话题就不可能变得长久。</span></p><p><span>反之，如果这个孩子有兴趣，他会问我们很多问题，他问的问题越多，我们和他之间交流也就会更长久，所以我们要学会这种智慧。</span></p><p><span>当我们和处上位的人交流，当我们遇到比我们更有智慧、更有德行的人，我们想要向对方学习的时候，我们是要占主动权的，我们要不停地去询问并表达自己的兴趣，以及想要改变的心，这个时候对方就会讲更多的话和更多的内容，我们因此可以学习更多的智慧。</span></p><p><span>我们接下来再去看《孟子》的原文，<strong>庄暴见孟子曰：</strong>庄暴是齐宣王的近臣，有一天庄暴来见孟子，对孟子讲了一件事情。</span></p><p><span><strong>暴见于王，王语暴以好乐，暴未有以对也。</strong>说有一天齐宣王召见了我，然后对我讲，大王他喜好音乐，我却没有任何的回答。</span></p><p><span><strong>曰：好乐，何如？</strong>庄暴继续问道说，大王好乐，您觉得这件事情怎么样？我们这里先要讲一个细节，我们可以看庄暴被齐宣王召见的时候，齐宣王对于庄暴讲了自己的兴趣，他说自己好乐。</span></p><p><span>这个时候庄暴并没有任何的回应，我们刚才讲过，沟通交流的智慧，如果说对方是处上位的或者我们的智慧不如对方，这个时候要顺着讲话的。举例子，可以去问大王，您好什么样的音乐？音乐里面有什么样的内涵呢？</span></p><p><span>他想说明一个什么道理，当你去顺着对方讲话，他就可以讲更多，这个时候你们彼此之间会有更多的共鸣存在，可是如果你并没有应对，没有去回应，这个话题也就因此而终结，所以我们在生活当中，一定要学会去回应对方。</span></p><p><span>当处上位的人，或者智者，或者朋友，或者亲人，或者孩子都一样，他说了对什么事情感兴趣，如果那件事情，我们是不懂的，我们就顺着去回应，顺着去询问，自然可以引发更多的话题和交谈的内容。</span></p><p><span>那么还有一种情况，你比对方更有智慧，当你比对方更有智慧，就不是顺着回应，而是拿回话语的主动权，我们接下来看，孟子就要拿回话语的主动权了。</span></p><p><span><strong>孟子曰：王之好乐甚，则齐国其</strong><strong>庶几乎！</strong>孟子讲了一个观点，如果大王非常喜欢音乐，那么齐国大概差不多，什么意思？孟子讲，如果齐宣王非常喜欢音乐，那么齐国大概是可以治理好的，因为古人讲礼乐不分家，当他喜欢乐也就说明他是明礼的，他是陶冶情操的，他的心性是好的。</span></p><p><span><strong>他日，见于王曰：王尝语庄子以好乐，有诸？</strong>他日指的是另有一天，齐宣王召见了孟子，这个时候孟子问齐宣王，说大王您曾经对庄暴讲过，您好乐，有诸？有这件事情吗？</span></p><p><span><strong>王变乎色，曰：</strong>这个时候齐宣王听到孟子的话，脸色一变。</span></p><p><span><strong>寡人非能好先王之乐也，直好世俗之乐耳。</strong>这个时候齐宣王脸色一变，为什么会变色？因为觉得内心有愧，不好意思对孟子讲，他可以对庄暴去讲自己好乐，但是当面对更有智慧，更有德行的孟子，齐宣王是不好意思讲出自己的爱好的。</span></p><p><span>所以孟子有所问，是否有这件事情，齐宣王脸色一变，说寡人非能好先王之乐也，说我喜欢的并不是圣明的先王所爱好的雅乐，直好世俗之乐耳，我只是喜欢比较世俗的音乐，那么世俗的音乐重的是享乐，自己喜欢听的，觉得好听的，可以让自己享受的。</span></p><p><span>先王之雅乐，它不光是乐，里面蕴含着更多关于仁德的道理。比如说如何去治理国家，比如说如何去祭祀天地祭祀祖宗，比如说民间的民风，他讲的都是美好的，可以包含着很多自我提升的内容。</span></p><p><span>所以我们这里可以看到，齐宣王脸色一变，他心中是觉得不好意思的，我们从这里再看一些细节的问题，首先齐宣王是想在孟子面前，有一个好的形象，所以会觉得自己喜欢世俗的音乐，是否不太正确。</span></p><p><span>第二点，这是齐宣王值得我们赞叹的地方，齐宣王这个人他很真实，他可以真实的面对自己，认为的不足和问题，当一个人懂得真实的面对自己认为的问题，这个时候反而是好教化的。</span></p><p><span>我们举个例子，比如说，我们想要去教育一个孩子，如果他可以真实的说出自己的不足和心里的想法，是不是反而好去教化，好去改变他。</span></p><p><span>比如说，一个领导对一个员工也是如此，这个员工他是真实的，可以讲出自己当下的不足和问题，是不是你更好去改变和帮助于他，所以齐宣王这个优点很值得我们去学习。</span></p><p><span>我们在生活当中，面对处上位的人，面对长者，面对比我们有智慧的人，我们可以真诚坦然的去面对，可以直接说自己的不足，对方才能给我们更好的帮助和引导。</span></p><p><span>可是如果我们总是掩饰自己的问题，对方自然也就不会讲的那么深刻，所以真实的面对自己的问题，极其重要。</span></p></div>"
},{
    "title": "《孟子》梁惠王下①-2 独乐不如众乐",
    "author": "虚空先生",
    "date": "2022-07-22",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下①-2 独乐不如众乐</strong></span></p><p><span><strong>曰：“王之好乐甚，则齐其庶几乎！今之乐，犹古之乐也。”曰：“可得闻与？”曰：“独乐乐，与人乐乐，孰乐？”曰：“不若与人。”曰：“与少乐乐，与众乐乐，孰乐？”曰：“不若与众。”“臣请为王言乐。”</strong></span></p><p><span>齐宣王讲到自己并不是喜好先王的雅乐，只是喜欢世俗的音乐。他自己觉得这其中似乎有些问题，我们看孟子是这样认为的吗？</span></p><p><span><strong>曰：王之好乐甚，则齐其庶几乎。今之乐，犹古之乐也。</strong>孟子讲，如果大王您非常喜欢音乐，大概齐国是差不多的，也就是可以治理好。今之乐犹古之乐也，今天的音乐和古之人所</span></p><p><span>欣赏的音乐是一样的。齐宣王觉得自己喜欢世俗的音乐，应该是有问题的。</span></p><p><span>可是孟子却不这么认为，他说大王只要您喜欢音乐就够了，就可以治理好齐国。但是喜欢什么样的音乐并不重要，我们从这句话当中，可以看到孟子身上的一个优点，我们去看孟夫子其人，他不注重形式，不注重那么多的规矩，没有那么多的标准。</span></p><p><span>我们学习过《论语》的朋友，可以作一些对比，比如说，我们学习的孔夫子，他是非常讲规矩的人。比如说，站有站相，坐有坐相；包括穿着都是要有讲究的；包括喜欢的音乐，只能喜欢雅乐，不能喜欢世俗的音乐。</span></p><p><span>但是孟子则不然，孟子说只要你的思想是正确的就可以了，只要你内心是有仁德的，只要你喜欢乐，至于你的行为是否规范，这个不重要。所以我们可以看到，孔子和孟子这两位圣人身上有他的相同点，就是讲仁德。</span></p><p><span>推行仁政也有他的不同点，一个更注重规则和行为规范，那么孟子更注重的是你的思想，只要你的思维是向仁的，向善的，至于你外在的形式，显得没有那么重要。</span></p><p><span>我们再看这句话，实则也是孟子在宽慰齐宣王。齐宣王觉得心中有愧，故而脸色一变，认为喜欢世俗的音乐，似乎不太正确。但是孟子给了他鼓励和宽慰，说只要喜欢音乐就可以了，至于喜欢什么样的音乐，是古之乐还是今之乐，它是相同的，没有什么不同。</span></p><p><span>所以我们从这里再延伸一个观点，当别人真实的讲他自己的问题和不足，反而更容易得到我们的原谅和宽慰。我们去想一想是不是这个道理。比如说一个孩子，他犯了一个什么错误，如果他直接说了他所犯的错误和不足，通常我们更愿意去原谅他，而且会给他一些鼓励和宽慰。</span></p><p><span>比如说朋友、员工、爱人都一样，如果他们有什么不足和问题，他们是直面问题的，这个时候我们更愿意去原谅。并且会给他宽慰和鼓励，可是如果一个人总是掩饰，他不敢真实的面对自己的问题和错误，他越是掩饰，别人就越反感。当然也就更不愿意去原谅他所犯过的错误，所以真实，他才是有力量的。</span></p><p><span><strong>曰：可得闻与？</strong>这个时候齐宣王又开始有问题了，您可以详细地说来听一听吗？想听什么呢？想听孟子讲为什么说今之乐和古之乐是相同的，并没有什么区别。从大部分人的心理，它是有区别的，先王的音乐注重的是雅，是德行，是美好。</span></p><p><span>而世俗的音乐，注重的是享乐和感受，可是孟子却讲它没有什么不同。都是一样的，所以想接下来去听一听，我们这里再来讲交流的智慧。</span></p><p><span>我们可以看到孟子与人沟通，非常有智慧，他总是可以吸引别人的兴趣。我们再看齐宣王亦是一位智者，他懂得去询问，当孟子讲了一个话题，齐宣王就会去讲，可得闻与？或者讲民以教我？说我没有那么明达，您是否可以教我？</span></p><p><span>他越是这样去交流，那么孟子所讲的自然就会越多。我们接下来看，孟子为何讲古之音乐和今之乐，并没有什么不同？</span></p><p><span><strong>曰：独乐乐，与人乐乐，孰乐？</strong>我们可以看到孟子交流的方式，通常不会直接讲自己想要讲的话，而是要反问，在反问的过程当中，引发别人的思考。这个时候又问齐宣王独乐乐，说您自己享受音乐的快乐，与人乐乐，相比于和别人共同享受音乐的快乐，孰乐？</span></p><p><span>我们自己也不妨思考一下，比如说您自己在享受音乐的快乐，如果这个时候与他人分享音乐的快乐，我们会觉得哪一个更乐？显然是后者。我们可以看到齐宣王他喜欢音乐，所以对庄暴去讲，说我很喜欢音乐。但是庄暴他是一个不喜欢音乐的人。</span></p><p><span>并且不懂得如何去回应，但可以看到齐宣王是想要与人分享他的快乐。想一想生活当中的</span></p><p><span>我们是不是如此？当我们听到一首好听的音乐，是不是想与人分享。</span></p><p><span>比如说我们心中思念的人，比如说我们的亲朋好友，你是想分享给你最在意的那个人，共同去欣赏。比如说你吃到了什么样的美食，这个时候，你就会想到你心中牵挂的那个人。如果能带他来吃就好了，当你看到一个美景的时候，也是如此，你是想与他人分享自己的快乐。</span></p><p><span><strong>曰：不若与人。曰：与少乐乐，与众乐乐，孰乐？</strong>这个时候齐宣王讲，不如与他人分享更快乐。那么与少数人分享更快乐，还是与多数人分享更快乐呢？请问哪一个更快乐？</span></p><p><span><strong>曰：不若与众。</strong>齐宣王讲，当然是与众人与多人分享更快乐。不光是分享音乐如此，再比如说我们学习圣贤文化，如果我们在学习圣贤文化的过程，我们真的喜欢、真的喜爱，这个时候我们是希望与更多人，去分享我们的快乐，分享圣贤文化的美好。</span></p><p><span>我们在生活当中，再比如说我们去看电影，我们觉得这个电影很好看，我们是希望与众多同频的有共鸣的人，一起去欣赏这个电影。所以人是需要有志同道合的朋友，我们志同道合的朋友越多，其实我们快乐自然也就会加倍，变得更多。</span></p><p><span><strong>臣请为王言乐。</strong>孟子的问题反问齐宣王，一个人快乐，还是与他人分享快乐？与少数人分享快乐，还是与多数人分享快乐？那么当然是与多数人分享快乐。这个时候孟子讲了，请允许我为您去讲一讲乐，到底什么样的乐，才是快乐的？到底该如何跟更多人去分享乐，才能快乐？</span></p><p><span>我们去看孟子讲话，他会拿回主导的话语权，就是无论你的问题是什么？无论讲到什么样的话题，孟子的主旨只有一个，就是回到仁政上，告诉齐宣王如何与民同乐，所以讲乐并不是孟子真正的目的。</span></p><p><span>只是通过齐宣王喜欢乐这件事情，表达自己的仁政思想，让齐宣王可以与民同乐。我们去看看在生活当中，如果我们是有智慧的，是不是如此。</span></p><p><span>比如说今天孩子说，他想吃什么，如果我们知道孩子的问题所在，我们想要引导他有一个正确的价值观，所以我们会和孩子聊聊吃的，但并不是为了聊吃的，是为了可以改正孩子的思维以及行为。</span></p><p><span>我们再比如说，我们跟朋友，跟员工交流也是如此，无论员工他讲什么话题，我们的朋友讲什么样的喜好，自己知道想要让他的心变成什么样子，想让他的思维和行为，变成什么样子。</span></p><p><span>我们是有自己的主旨的，所以这个时候，不会被表象所迷惑，去讲他感兴趣的事情，讲他感兴趣的话题。但是为的是表达我们心中不变的主旨，所以我们去学习了圣贤文化，就不要停留在事情的表象，我们可以从任何一个话题，任何人的喜好去讲，我们想要表达的仁德。</span></p><p><span>比如说，我们学习了《论语》，学习了《孟子》，明白了修身的重要性，知道一个人要明德，亲民，仁义而已矣。这个时候，你跟任何人交流，无论谈到任何话题，我们最后都可以讲到修身，都可以讲到明德亲民，都可以讲到仁义而已矣。这就是我们心中的主旨，非常的明确。</span></p></div>"
},{
    "title": "《孟子》梁惠王下①-3 与民同乐",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下①-3</strong></span></p><p><span><strong>“今王鼓乐于此，百姓闻王钟鼓之声、管籥之音，举疾首蹙頞而相告曰：‘吾王之好鼓乐，夫何使我至于此极也？父子不相见，兄弟妻子离散。’今王田猎于此，百姓闻王车马之音，见羽旄之美，举疾首蹙頞而相告曰：‘吾王之好田猎，夫何使我至于此极也？父子不相见，兄弟妻子离散。’此无他，不与民同乐也。”<strong>今王鼓乐于此，百姓闻王钟鼓之声，管籥之音，举欣欣然，有喜色而相告曰：‘<strong>吾王庶几无疾病与！何以能鼓乐也？</strong>’<strong>今王田猎于此，百姓闻王车马之音，见羽旄之美，举欣欣然</strong><strong>有喜色而相告曰：‘吾王庶几无疾病与！何以能田猎也？’<strong>此无他，与民同乐也。”“</strong></strong></strong>今王与百姓同乐，则王矣。”</strong></span></p><p><span><strong>今王鼓乐于此，百姓闻王钟鼓之声，管籥之音。</strong>假如今天大王您在这里鼓乐，欣赏音乐，有钟鼓之声，有管籥之音，这个时候百姓听到了，会怎么样呢？</span></p><p><span><strong>举疾首蹙頞而相告曰。</strong>举就是大家都这个样子。疾首，头痛。蹙頞，皱眉。相告，互相议论。我们再来看孟子描绘的这样一个场景，说假如大王您今天在这里鼓乐，百姓们都头痛皱眉，相互议论。</span></p><p><span><strong>吾王之好鼓乐，夫何使我至于此极也。</strong>大王是喜欢鼓乐的，大王他现在正在欣赏着音乐，可为何使我陷于这样的绝境。</span></p><p><span>我们看这里的极，极它本意是指房屋正中的最高点，也就是极端。那么延伸出来就是，现在百姓正处在水深火热的极端当中。而大王却在欣赏他的音乐，使我们置于这样的境地，什么样的境地？</span></p><p><span><strong>父子不相见，兄弟妻子离散。</strong>大王在享受音乐，可是百姓们父子是不相见的，兄弟和妻子都已经离散了，为什么会这个样子？两点，第一点是，大家没有办法解决温饱的问题，不能安居乐业。</span></p><p><span>那么第二点，并没有礼仪的教化，如果他不能安居乐业，你不能给他礼仪的教化，他如何懂得孝顺父母，如何去畜养自己的妻儿，如何兄弟和睦？</span></p><p><span>我们再去想，一个人在什么样的情况下，才能去享受音乐呢？比如说，我们现在的生活也是如此，你在解决了温饱的问题以后，你才可能有心情去享受音乐。</span></p><p><span>如果我们连生活都堪忧，衣食都不充足，那怎么有心情去享受音乐呢？所以我们这里可以看到，孟子在给齐宣王描绘一个场景，如果只有您自己是衣食富足的，还在享受着音乐，这个时候百姓会觉得头痛皱眉，因为他们的生活并不如意，所以并没有心情去享受音乐，也更不会拥护你去享受音乐。</span></p><p><span><strong>今王田猎于此，百姓闻王车马之音，见羽旄之美。</strong>假如大王您今天在这里打猎，百姓听到了您车马发出的声音，羽旄之美，羽指的是鸟羽。旄指的是牦牛。</span></p><p><span>因为君王出行，他是有非常华丽的阵仗，用鸟的羽毛与牦牛去装饰，可以看到他的与众不同，华贵以及尊贵，大王在这里打猎，百姓看到了您华丽出行这样的场景。</span></p><p><span><strong>举疾首蹙頞而相告曰。</strong>大家都觉得很头痛皱眉，并且相互议论。</span></p><p><span><strong>吾王之好田猎，夫何使我至于此极也，父子不相见，兄弟妻子离散。</strong>还是同样的感叹，大王在这里享受着打猎带来的乐趣，并且出行有华丽的仪式，可是我们父子不能相见，兄弟妻子都是离散的状态。我们百姓又有什么心情去拥护大王？</span></p><p><span><strong>此无他，不与民同乐也。</strong>这里没有其他的原因，只是因为没有与民同乐。我们再来看整个这段话，说齐宣王自己如果去享受音乐带来的快乐，去享受打猎带来的快乐，但是百姓会觉得痛心疾首。</span></p><p><span>会觉得头痛皱着眉，因为他们的生活并不如意，父子不能相见，兄弟不能和睦，妻子不能畜养，整个家都是离散的状态。</span></p><p><span>因为齐宣王不懂得与民同乐，所以才形成了这样的现状，接下来孟子又用了一个相反的场景来描述。刚才所描述的是齐宣王打猎，享受音乐，百姓是痛心疾首的。接下来所描绘的场景，百姓是很开心的，看着齐宣王打猎与享受音乐。</span></p><p><span><strong>今王鼓乐于此，百姓闻王钟鼓之声，管籥之音，举欣欣然，有喜色而相告曰。</strong>眉开眼笑，同样是这样的场景，同样是假如您在这里享受音乐，钟鼓之声，管籥之音。但是大家都是眉开眼笑的，并且相互的转告，相互的探讨。</span></p><p><span><strong>吾王庶几无疾病与，何以能鼓乐也。</strong>百姓们听到大王您在这里鼓乐，欣赏着音乐，大家都是眉开眼笑的，并且相互的探讨到我们的王，差不多没有疾病，所以才能在这里享受音乐。同样的事情，但是百姓的心里会有不同的看法。</span></p><p><span>第一段，百姓会心存怨言，说我们的生活苦不堪言，而大王却在这里享受音乐。而这一段的场景，大王在享受音乐，百姓却是眉开眼笑的。并且感觉到很幸福，大王可以欣赏音乐，是因为他的身体没有疾病，他的健康状态很好。</span></p><p><span><strong>今王田猎于此，百姓闻王车马之音，见羽旄之美，举欣欣然。</strong><strong>有喜色而相告曰，吾王庶几无疾病与，何以能田猎也。</strong>跟上一段是一样的，百姓们看到齐宣王在这里田猎，大家都眉开眼笑，很开心，并且相互的议论到，看来我们的大王是没有疾病的。所以才能在这里打猎，我们会因为大王的无疾病，因为他的健康，因为他还能打猎，我们觉得开心，觉得欣慰。</span></p><p><span><strong>此无他，与民同乐也。</strong>我们去看孟子描绘的这两个场景，享受音乐、田猎是一样的，但是百姓的反应却截然不同，一个是怨恨的痛心疾首，一个是开心的眉开眼笑，区别在于什么呢？</span></p><p><span>前者不懂得与民同乐，后者是与民同乐的。所以这里孟子告诉齐宣王，你要想真正的可以得到快乐，你要想真正的能去享受音乐，田猎给你带来的快乐，你首先要与民同乐，我们看这里的与民同乐是什么意思呢？</span></p><p><span>难道是你在享受音乐的时候，叫百姓一起来听，这个是与民同乐吗？难道是你在打猎的时候，你叫百姓看着你或者一起来打猎，这个叫与民同乐吗？这个问题是值得我们去思考的，显然这并不是与民同乐。</span></p><p><span>我们经常听到一句话，授人以鱼不如授人以渔。就是你给他一条鱼，不如教给他如何去钓鱼的方法，这样他才能取之不尽。我们举个例子，比如说，我们有一个朋友，我们在吃饭的时候总是叫这位朋友，这就是与这位朋友同乐了吗？显然不是。我们是教给他如何可以生活更好的方法，这个才叫与朋友同乐。</span></p><p><span>比如说，我们在不停地提升自己的时候，不是跟他分享我的智慧，而是教给他也能更好地提升自己，这才叫与人同乐。比如说我们更有智慧的时候，我们知道智慧是好的，我们教给他如何变得有智慧，这个叫与人同乐。</span></p><p><span>我们再回到原文，如何叫与民同乐呢？是作为一国之君，你要让百姓过上富足的生活，要让百姓也有心情去欣赏音乐，也有心情去田猎，这个才叫与民同乐。如果你并没有让百姓过上好的生活，你在享受音乐之时，百姓是不会拥护你的。</span></p><p><span>他心中是充满着怨恨的。因为你过着富足的生活，而百姓却民不聊生，所以要想推行仁政，是让百姓的生活过得更好，这个时候你去享受音乐，去打猎，百姓是非常开心的。他们希望你是健康无疾病的，因为你的仁政，真正的利益到了他们。</span></p><p><span>我们看看在生活当中也是一样的，什么样的人会希望我们的身体更健康，是因为我们对他提供了帮助，对他是有价值的，所以他希望我们变得更好，他希望我们变得更快乐，他希望我们变得更强大。</span></p><p><span>可是如果我们并没有用仁德去帮助他人，你的好坏与他人又有什么关系？可能你过得越好，对方心中就会越忌妒，越是怨恨。如果我们是仁德的，对他是有帮助的，对方就会希望我们变得更好，所以在生活当中，我们要学会与民同乐，也就是如何让他人变得更好。</span></p><p><span>比如说，我们让我们的爱人变得更好，他跟我结合组成一个家庭。那么我就有责任让他变得更优秀，让他变得更开心，让她变得更贤良淑德，这是与民同乐。</span></p><p><span>比如说我们去经营一家企业，也是一样的。那么员工来到了这个企业，我们就要学会与民同乐，我们有责任和义务让他可以变得更优秀，让他可以变得更好。与朋友相交也是如此，既然我们成为朋友，我们就有责任和义务让他变得更有德行，让他变得更有智慧，让他成为一个更好的自己。</span></p><p><span><strong>今王与百姓同乐，则王矣。</strong>如果今天大王您能与百姓同乐，则可以称王天下。让天下的百姓归服于您。与民同乐就是仁德的具体实施的方法。我们讲仁德的概念太广泛，那么如何具体地去实行仁德，就是与民同乐。</span></p><p><span>作为一个一国之君，他是要让百姓生活得更好，这叫与民同乐。同时他是一种责任感，既然作为一国之君，你是有责任让百姓生活得更好。</span></p><p><span>我们再把这种责任感，延伸到我们生活当中，我们作为一家之主，你是有责任和义务与民同乐的，让这个家族的每一个成员变得更好。我们与朋友相交，自己是有这个责任与民同乐的，我们要让朋友变得更好。</span></p><p><span>如果我们作为父母，我们是要与民同乐的。我们有这个责任，让孩子有更正确的价值观。我们有责任去教育孩子，让他更好地去成长。</span></p><p><span>我们娶妻也是如此，我们要与民同乐。我们是有这个责任，让她过得更开心，让她过得更舒适。同样我们嫁给他人也是如此，我们要与民同乐。我们有这个责任去帮助他，可以让他更好地展现自己的才能，可以让他对家庭，没有后顾之忧。全心全意地去实现，自己的理想和抱负。</span></p><p><span>所以无论我们与任何人相交，都要懂得与民同乐的道理。我们有这样的责任感去担当，这个时候就会成为一个内心有仁德之人。</span></p></div>"
},{
    "title": "《孟子》梁惠王下② 文王之囿",
    "author": "虚空先生",
    "date": "2022-07-29",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下② 文王之囿</strong></span></p><p><span><strong>齐宣王问曰：“文王之囿，方七十里，有诸？”孟子对曰：“于传有之。”曰：“若是其大乎？”曰：“民犹以为小也。”曰：“寡人之囿，方四十里，民犹以为大，何也？” 曰：“文王之囿，方七十里。刍荛者往焉，雉兔者往焉，与民同之。民以为小，不亦宜乎？臣始至于境，问国之大禁，然后敢入。臣闻郊关之内，有囿方四十里，杀其麋鹿者，如杀人之罪。则是方四十里，为阱于国中；民以为大，不亦宜乎？”</strong></span></p><p><span><strong>齐宣王问曰：文王之囿，方七十里，有诸？</strong>齐宣王问了孟子一个问题，文王指的是周文王。这里的囿指的是没有围墙的园林猎场。齐宣王问，听说文王有方圆七十里的园林，有诸？有这样的事情吗？这是真实的吗？</span></p><p><span><strong>孟子对曰：于传有之。曰：若是其大乎？曰：民犹以为小也。</strong>传指的是《史书》，孟子说《史书》上记载是有的。齐宣王这里有一个疑问，那这个园林岂不是很大吗？在他心中，觉得园林是不是过大呢？孟子说，百姓还觉得小了呢？</span></p><p><span><strong>曰：寡人之囿，方四十里。民犹以为大，何也？</strong>齐宣王讲了，说我的园林方圆四十里。而百姓却觉得很大，这是为什么？</span></p><p><span>我们从这里要做一个思考和延伸，我们看看齐宣王，是不是非常愚蠢的一种思维方式。我们只能用愚蠢这个概念来形容，为什么说是愚蠢呢？我们先说一说最基础的原因，齐国是众多诸侯国当中的一个，而文王那个时候虽然还没有做天子，但是已经拥有天下三分之二的土地。</span></p><p><span>那么我们看从体量和面积，国家所拥有的范围来讲，齐国是远远比不上文王那个时候。所以即使从国家的体量和面积，那么文王也有方七十里的园林。齐国占了天下的九分之一，那么有方圆四十里的园林，百姓都已经觉得很大了，这是最基础的原因。</span></p><p><span>我们接下来要去学习的，才是问题的关键之所在。我们现在即使从最基础的原因，我们也可以看到齐宣王思维的角度。想一想我们很多时候在生活当中，是不是齐宣王这种思维方式，我们只是比较事情的结果。</span></p><p><span>举个例子，别人家的孩子学习为什么那么好？别人为什么可以住大房子呢？我的同事为什么可以涨工资？我们看到的，我们思维的，都是对方所得到的那个结果。这就是愚蠢的想法，那什么叫做智慧？智慧是你看得很通达，你看这个事情的起因，为什么会有今天的结果？</span></p><p><span>举个例子，为什么同事可以涨工资呢？是因为他哪里做的比较好，他做了什么样的贡献和价值？当我们懂得去看那个原因，这是智慧的思维。如果我们只是在比较那个结果，这就是愚蠢的想法。</span></p><p><span>再比如说，为什么他家可以住上大的房子呢？是因为他有什么样的德行，才匹配了这样的房子，是他做什么事情奋斗所得来的，或者是他的家庭给他留下来的某些财富呢？再比如说，别人的孩子学习成绩好，这是结果。</span></p><p><span>我们不能去对比这个结果，我们要去看那个原因，是因为他的孩子天生比较聪慧，遗传基因比较好，还是说学习比较努力，还是父母的引导和教育更好。所以做一个有智慧的人，去寻找那个原因，不要去对比那个结果。</span></p><p><span>当我们被欲望所驱使，就会变得很愚蠢，我们只是想要那个结果，却不懂得探寻那个原因，正如齐宣王他觉得，文王之囿，方七十里，百姓还觉得小，而我自己的园林只有四十里，百姓却觉得大。这是为什么呢？</span></p><p><span>因为他只看到了那个结果，我们刚才讲了最基础的原因，文王占天下三分之二的土地，而齐国只有当时的九分之一，所以从体量上，跟文王也是没有办法对比的。</span></p><p><span>我们接下来看孟子是如何用智慧的眼光，去看待文王。为什么有七十里百姓觉得小，而齐宣王有四十里的园林，百姓却觉得大。</span></p><p><span><strong>曰：文王之囿，方七十里，刍荛者往焉。雉兔者往焉，与民同之。</strong>这里孟子讲到文王的园林猎场，方圆七十里。刍荛者往焉，刍呢指的是草，荛指的是柴。刍荛者指的是割草砍柴之人，都可以来到文王之囿。</span></p><p><span>雉兔者往焉，雉指的是野鸡，代指鸟类。兔就指的是兔子，动物之类的。雉兔者往焉，打鸟，捕兔之人，都可以去文王之囿。与民同之。文王之囿，虽方圆七十里，但是与民同之，和百姓是共享的。</span></p><p><span><strong>民以为小，不亦宜乎。</strong>百姓还觉得小，这不是应该的吗？我们来看，为什么文王之囿方七十里，但是他是与百姓共同分享的，无论是割草砍柴之人，还是打鸟捕兔之人，都可以来到这个园林，来到这个猎场，可以去这里打鸟，可以去这里捕捉动物。可以去这里割草，可以去这里砍柴。所以老百姓都觉得小，这不是很应该的事情吗？</span></p><p><span>因为文王并没有把园林和猎场据为己有。他是跟所有的百姓共同分享的。那么百姓一定是希望他的园林变得越来越大。接下来孟子在讲，到齐宣王的园林，我们去和文王之囿作一个对比，自然就明白其中的道理。</span></p><p><span><strong>臣始至于境，问国之大禁，然后敢入。</strong>臣，孟子的自称。因为孟子在齐国是拿着俸禄的，虽然不参与具体的政事，但是可以议论国政。所以以臣自居，臣始至于境，孟子来到齐国境地之时，开始讲自己的经历和自己的见闻，问国之大禁。</span></p><p><span>孟子回忆，来到齐国境地的这段经历和听到看到的，首先问齐国有什么样的禁忌，什么样的话是不能讲的，什么样的事情是不能做的。然后敢入，然后才可以来到齐国。</span></p><p><span>我们首先在这里，去跟文王做一下对比。文王是一个仁德之君，越是仁德之君，他越没有什么样的禁忌。他的贤明是在外的，而战国时期则不同，那么孟子去到每一个诸侯国，都要问禁令。这个国家什么事情不能做？什么话不敢讲？那也就是说明，那个时候对百姓的禁令很多。</span></p><p><span><strong>臣闻郊关之内，有囿方四十里，杀其麋鹿者，如杀人之罪。</strong>这里孟子就讲到了具体的关于园林猎场的听闻，我听说国都的郊区有园林方四十里，杀其麋鹿者，如果有人杀了园林之内的麋鹿，如杀人之罪，如同杀人是一样的。</span></p><p><span>我们可以想象一下，是不是非常可怕的事情，有哪个百姓敢接近齐宣王的园林，如果不小心杀了其中的麋鹿，像杀人的罪责一样重，是要以命抵命的，所有的百姓自然是不敢接近这片园林的，因为如此的禁忌也就说明了，齐宣王的园林是据为己有的，甚至百姓都不敢去靠近。</span></p><p><span>则是方四十里，为阱于国中。接下来得出了一个结论，这方圆四十里的园林，不是设置个陷阱，在国家之内吗？因为百姓不敢靠近，如果靠近不小心伤害了其中的麋鹿，要犯杀人之罪，如果不小心触碰到了园林之内的其他动物，哪怕是草木，是不是要给百姓治罪。</span></p><p><span><strong>民以为大，不亦宜乎？</strong>那么百姓觉得您的园林大了，不是应该的吗？别说方圆四十里，即使是方圆十里，百姓也会觉得大。因为对百姓来讲，它就是陷阱，它是非常恐怖和令人害怕的事情，不敢去接近。</span></p><p><span>那么即使去误入，也是有所担心和恐惧的。所以方圆四十里，百姓觉得太大了，不是应该的吗？我们通过这一段对比，再来看文王和齐宣王之间的区别。</span></p><p><span>首先文王占了天下三分之二的土地，有了园林七十里，而齐宣王有当时九分之一的土地，有园林四十里，这是其一，最简单的从面积的对比。那么其二两个人的心不同，一个是与民同乐，一个是据为己有。</span></p><p><span>那么文王的园林猎场是跟百姓共同享用的，无论你想要去割草，还是想要砍柴，或是打鸟，或是捕兔，都可以到园林之中。而齐宣王的园林四十里，百姓是不能进入的，甚至不可以伤害这里的一草一木，不可以杀其麋鹿。</span></p><p><span>那么对于百姓来讲，这四十里的园林就相当于是陷阱。放在了齐国的国都之郊区，百姓是不能去触碰的，这个是严重的禁令，所以百姓觉得你的这个园林太大了，不是正常的吗？不是应该的吗？</span></p><p><span>我们由此要去往生活当中，去思考和延伸了，如果你想让别人赞同，你想让别人去支持你，让你变得更大更强，你就要学会给予和分享。如果你拥有的很多，是愿意和大家分享的，别人就会希望你变得更好。</span></p><p><span>我们举个例子，比如说我们的条件很富足，我们可以多和朋友们分享。当朋友遇到困难的时候，我们愿意去帮助他，当亲人遇到困难的时候，我们愿意给他一些物质上的资助。</span></p><p><span>比如说，我们可以多请朋友吃饭，比如说，我有大的房子，我可以给朋友们去共享，可以让他们去居住。这个时候，他们自然是希望我们拥有的更多。</span></p><p><span>再比如说，我们做一个企业，带一个团队，当我们自己赚得更多，我们愿意分享给我们的员工，让他们也可以有所多得。这个时候他们共同的愿望，是希望我们变得更好，希望我们变得更强大，希望我们变得更多，所以我们要学会去分享给他人。</span></p><p><span>就像这一段话当中所讲的，文王他拥有七十里的猎场，他却愿意分享给更多的百姓与民同乐，他拥有整个天下，他却愿意去施仁政，更多地付出给百姓，让百姓可以过上安居乐业的生活。</span></p><p><span>所以要想让我们自己变得更好，变得更强大，是懂得分享，不要想着据为己有。</span></p><p><span>如果我们只是想着据为己有，即使你拥有的不多，别人也认为你拥有的多。因为你所拥有你并不愿意分享给他人，又有什么样的人希望我们变得更好，所以一个有仁德的人，要学会给予和分享，如果你不懂得分享，就很容易遭到别人的恨意和忌妒。</span></p><p><span>举个例子，如果我们在生活当中，你自己拥有的很多，却不想着帮助和分享给他人。别人就会来忌妒，心生恨意，甚至可能会做一些破坏性的行为。我们跟朋友相交也是如此，如果只有我们自己过得很好，我们也不想着去帮助身边的人，他们就会心生恨意和忌妒。</span></p><p><span>这里我们还要换一个角度去思考，如果我们看到别人拥有的更多，我们不要去心生恨意，我们也不要去忌妒他人，因为这是非常愚蠢的想法。我们看到别人今天过得好，我们要去智慧的看待，去看那个原因。</span></p><p><span>他为什么会有今天的结果，我们去追寻那个原因，在因上努力，我们那个结果也自然会变得更好。如果一个人心生恨意和忌妒，会让我们变得迷失方向，会让自己的行为变得偏激。</span></p><p><span>所以对于这件事情，我们要从两个不同的角度去看待，当我们自己拥有的更多，我们要学会分享和帮助他人。当我们看到别人拥有的更多，我们要做一个智慧的人，去看背后的原因，他为什么可以拥有更多，而不要心生恨意和忌妒，它只会让我们的行为变得更加偏激。</span></p></div>"
},{
    "title": "《孟子》梁惠王下③-1 交邻国之道",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong><span>《孟子》梁惠王下</span></strong></span><span><strong><span><span>③-1 交邻国之道</span></span></strong></span></p><p><span><strong><span/></strong></span></p><p><span><strong>齐宣王问曰：“交邻国有道</strong><strong>乎？”孟子对曰：“有。惟仁者为能以大事小，是故汤事葛、文王事昆夷。惟智者为能以小事大，故大王事獯鬻。句践事吴。”</strong></span></p><p><span><strong>齐宣王问曰：交邻国有道乎？</strong>这段话依然是来自于孟子和齐宣王之间的对话，孟子回答齐宣王的问题。我们看齐宣王，如果向一个智者问问题，我们可以直接问自己心中的困惑，困扰自己的事情，那么这个问题既是困扰我们的事情，也是我们最关注的事情。</span></p><p><span>我们接下来看齐宣王，困扰他的事情是什么？他最关注的问题又是什么呢？我们知道齐宣王是喜欢用兵的，也就是好战，所以好战自然他跟邻国之间的关系不会太好。</span></p><p><span>所以这里他问孟子，交邻国有道乎？和邻近的诸侯国相处有什么样的方法吗？我需要有什么样的原则，这里我们先来思考一个问题。</span></p><p><span>比如说，如果我们搬到了一个新的住所，我们要去思考如何和周围的邻居去相处呢。再比如说，我们来到了一个新的公司、新的企业，我要如何与新的同事去相处呢，有什么样的方法和原则吗？</span></p><p><span>我们去想一想，该怎么去做？如果我们自己是有智慧的、是强大的、是有德行的，我们需要对于比我们弱小的人，我们要去仁爱，去给他付出更多的帮助。</span></p><p><span>如果遇到了比我们更强大的人，我们要学会收敛自己的锋芒，这样我们既可以与强者交往，同时也可以与弱者交往，那我们还可以讲一个简单的小智慧。</span></p><p><span>比如说我们与同事，与邻居如何相处呢？我们是不是可以给对方更多的关怀和帮助，我们是不是可以准备一些小礼物，礼多人不怪，那就可以和周围的人很好的去打交道，这是对于我们个人而言。</span></p><p><span>可是对一个国家而言，难道送一些小礼物就可以吗？好像显然是不行的，每个诸侯国之间都有他自己的利益，都有他保全自己国家的方法，以及这样的想法。</span></p><p><span>显然并不是通过一些小礼物，可以解决的问题，但是万变不离其宗，无非是我们要有什么样的智慧，如何与邻近的国家去相处。我们接下来，学习孟子的智慧，要如何与邻国相处。</span></p><p><span><strong>孟子对曰：有，惟仁者为能以大事小。</strong>孟子讲，有方法。惟仁者为能以大事小。你看我们通常的思维是以大欺小，当齐国变得更强大，他就会欺压邻近的小国。</span></p><p><span>我们在生活当中也是如此，当我们变得强大，我们会习惯性的以大欺小，而这里孟子告诉我们以大事小，什么叫是事，事奉，帮助别人做事情。举个例子，说我们在家事奉兄长，也就是服事帮助我们的父亲和兄长，去做事情。</span></p><p><span>比如说我们在企业，我们去帮助和服事领导去做事情。通常我们处下位的时候，我们会愿意事奉处上位的人，愿意服从和帮助他去做事情，可是这里孟子告诉我们，要学会以大事小。</span></p><p><span>当我们强大，当我们处上位的时候，还能服侍于比我们弱小的人，还能去帮助他做事情。惟仁者可以的，只有仁者才能以大事小，历史上有没有以大事小的故事呢？</span></p><p><span><strong>是故汤事葛、文王事昆夷。</strong>接下来孟子讲到，汤是商朝的创造者，开国之君。葛也是一个小的国家，汤和葛以前都是夏朝的附属国。汤比较大，葛比较小。但是汤并没有去欺压葛国，而且是以大事小的，汤和葛之间发生过很多的故事。</span></p><p><span>比如说商汤，既然他是商朝的开国之君，他是开明的，是圣明的，勤于政事的。是爱护百姓的，相反葛国的国君葛伯，这个人是贪婪的昏庸的，并且实行是懒政，并没有什么样的作为。即使那个时候最注重的是祭祀，而葛伯也并不去祭祀，那么商汤知道了这个事情，就去问葛伯，为什么不祭祀？</span></p><p><span>葛伯说，我们没有牛，没有羊，要如何祭祀呢？商汤就派人送去了牛和羊，让葛伯去祭祀，可是葛伯依然没有用牛和羊去祭祀，而是大摆宴席把牛羊吃掉了。这个时候商汤又派人去问，为什么给你送去了牛和羊，你依然不祭祀，而是要把它吃掉？</span></p><p><span>葛伯讲，我们平时没有那么多吃食，好不容易有了牛和羊，我们当然要自己吃掉了。这个时候商汤又派自己国家的人，帮助葛国种粮食，并且派自己种粮食的这些亲人，去给种粮食的人带去食物，也就是不吃葛国的食物，并且帮助葛国去种粮食，这个时候商汤的美名，自然开始远扬。</span></p><p><span>大家都在说商汤的贤德，都在赞扬他，可以以大事小，所以他是一个仁者。而这个时候葛伯自然是被人非议的，葛伯是非常生气的。所以他就阻止这些送给种粮食吃食的这些亲人们，并且还打死了其中的一个孩子。</span></p><p><span>商汤知道了这些事情，非常地生气愤怒，后来就灭掉了葛国。因为这个人实在是不可教化，一而再，再而三的去帮助他，可是却屡教不改，甚至还打死了孩子，因此就灭掉了葛国。</span></p><p><span>文王事昆夷。文王指的是周文王，昆夷指的是西戎的小部落，文王那个时候已经很强大，西戎的小部落也就是昆夷，他们是游牧民族，所以并没有那么多的粮食和财物。</span></p><p><span>这个时候昆夷就屡次来犯周文王的地境，历史上有记载，说昆夷一日三至周之东门，也就是一天骚扰周文王的地方三次，但是文王并没有开城门迎战。</span></p><p><span>而是闭门修德，文王讲他们是没有粮食吃的，我不能去开门迎战，如果开门迎战，甚至是追击，只会造成更大的伤亡，既然他们没有粮食吃，我不如把自己的部落，不停地东移去开疆扩土，所以并没有与西戎的小部落之间去计较。</span></p><p><span>我们来看这一段，孟子讲了两个故事，一个是汤事葛，一个是文王事昆夷。汤和文王都是强大的，他们是强者，但是并没有欺压葛国，也并没有欺压昆夷，同时还愿意去帮助和包容，这些比他更弱小的国家，所以我们这里就看到了，其中的仁德。</span></p><p><span>故而孟子讲，惟仁者为能以大事小，当你内心是存有仁德的，你就可以去帮助那些弱小。所以告诉齐宣王，如果邻国比你弱小，你要做一个有仁德的人，可以帮助这些弱小的国家，让百姓可以可以生活得更好。</span></p><p><span>我们在生活当中，也是如此，无论我们在家庭当中，还是和朋友或者是在公司当中都一样，我们要学会做一个仁德的人，去帮助那些比我们更弱小的，而不是去欺压他们。</span></p><p><span>如果我们懂得去帮助弱小，这就是与周围的人相处之道，别人自然会感恩戴德，知道我们的仁德，从而我们自己会让自己变得更强大。</span></p><p><span><strong>惟智者为能以小事大。</strong>刚才讲的是以大事小，只有仁德的人才可以做到。这里又讲以小事大，只有有智慧的人，才能做到。为什么会说智者，才懂得以小事大呢？孟子同样引用了两个故事。</span></p><p><span><strong>故大王事獯鬻。句践事吴。</strong>大王指的是文王的祖父，古公亶父。獯鬻是太王那个时期北面的邻国，很凶猛、彪悍、战斗力很强，也就是獯鬻，比那个时候的太王，更加强大，既然是强大，他就以大欺小，所以獯鬻总是来攻打太王的地盘。</span></p><p><span>一开始是抢夺珠宝财物，那么太王讲，就把珠宝财物给他们就是了。可是给了之后，獯鬻并不满足，继续去攻打。接下来，他想要太王的土地和百姓，这个时候太王又想，既然我打不过他，为什么一定要和他抗争呢？</span></p><p><span>可是百姓们却不同意，他们誓死要捍卫自己的国家，捍卫自己的土地。可是太王却不忍心让自己的子民，让自己的百姓为了维护土地，维护他的地位，而牺牲流血，甚至是死亡。</span></p><p><span>所以太王决定，既然他要的是土地，我就把土地给他，我自己迁移就好了。后来太王开始迁移到岐山这个地方，也因为迁移到岐山，后来不停地壮大，奠定了开创周朝的基础。因为太王是有德行的人，他不忍自己的百姓受伤，所以很多百姓就陆续的跟着太王，迁到了岐山这个地方。</span></p><p><span>周氏一脉擅长的是耕种，也就是农业。把农业发展得很好，都是为百姓去考虑的，所以百姓聚集的就会越来越多，也因此而壮大。后期有了文王，有了武王，才开创了周朝。我们这里可以看到大王的德行，以及智慧。</span></p><p><span><strong>惟智者为能以小事大。</strong>因为对方更强大，当我们更弱小的时候，我们要有智慧，不要被自己的情绪所带动。不要逞一时之气，如果太王逞一时之气，给自己带来的将是毁灭性的伤害。所以这里孟子讲，惟智者为能以小事大。</span></p><p><span>做一个有智慧的人，是要懂得保全自己的，保全自己以后，才有让自己变强大的机会。我们在生活当中也是一样的，如果遇到比我们更强悍的人。这个时候，我们要懂得保全自己，不要意气用事。要用智慧去收敛自己的锋芒，不要让自己受到伤害。</span></p></div>"
},{
    "title": "《孟子》梁惠王下③-2 畏天保其国",
    "author": "虚空先生",
    "date": "2022-07-26",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》33梁惠王下③-2畏天保其国</span></strong></p><p><strong><span>“句践事吴。以大事小者，乐天者也；以小事大者，畏天者也。乐天者保天下，畏天者保其国。《诗》云：‘畏天之威，于时保之。’”</span></strong></p><p><strong><span>句gou践事吴。</span></strong><span>勾践和吴王夫差交战，后来败给了吴国。这个时候勾践开始请和，说愿意入吴国为奴，只需要吴王放过越国的百姓。这个时候吴王夫差同意了越王勾践的请求，就把越王勾践带回了吴国，给他养马，并且去守吴王夫差父亲的陵墓。</span></p><p><span>在这三年当中，勾践是忍辱偷生的。甚至他可以在吴王夫差生病之时，去尝吴王夫差的粪便，以取得吴王夫差的信任和放心。后来在吴国做了三年的奴仆，吴王夫差看到了，越王勾践的忠心。就把越王勾践放回了越国，越王勾践回到越国以后，开始卧薪尝胆。</span></p><p><span>卧薪指的是住在柴火上，并没有住床。并且每顿吃饭的时候，都会尝苦胆告诉自己，过去这三年的屈辱。后来又用了将近二十年的时间，打败并且灭了吴国，称霸于诸侯。</span></p><p><span>通过这个故事，同样可以看到勾践他是有智慧的。当面对吴王夫差的强大，自己是抗争不过的，所以选择了忍辱。选择了忍受当下的苦难，以寻找合适的时机。</span></p><p><span>如果说太王和勾践，不懂得隐忍，不懂得用自己的智慧，而是用自己的一时之气。可能就会让自己面临着死亡，让自己的百姓面对更多的苦难，所以孟子告诉我们要做一个有智慧的人，才能以小事大。懂得去保全自己，以图东山再起。</span></p><p><span>所以我们在生活当中，无论遇到什么样的人和事，如果我们当下的能力，是不足以抗争的。我们就要学会隐忍，我们不要被自己的情绪所带动，逞匹夫之勇，只会给自己带来更大的伤害和毁灭性的打击。</span></p><p><strong><span>以大事小者，乐天者也；以小事大者，畏天者也。</span></strong><span>这里孟子开始作总结，告诉我们，可以以大事小的人，是乐于接受天命的人，是以天命为乐的人。</span></p><p><span>以小事大者，畏天命者也。可以以小事大的人，是敬畏天命的人。我们接下来看，乐天命者和畏天命者，它是什么道理？我们先讲畏天命者，畏也就是敬畏，畏威，敬畏他的威力。畏天命者也，那我们敬畏天命的力量，敬畏他的威力。</span></p><p><span>我们举例子，比如说天可以刮风、天可以下雨、天可以炎热、天可以寒冷，这种力量是我们任何人，都不可能做到和达到的。所以我们要敬畏天，因为他的这种力量是不可抗衡的，不可抗争的。</span></p><p><span>以小事大，就是畏天命者也，我们为什么要以小事大？因为我们敬畏他的力量，敬畏他的威力，敬畏他的不可抗争。所以说以小事大，是敬畏天命的人，敬畏的是他的力量。</span></p><p><span>那我们放到一个人身上，也是如此，比我们力量强大的人，比我们更优秀的人，我们要去敬畏他，敬畏他身上的力量，敬畏他可以做到我们做不到的事情，敬畏就会懂得收敛和保全自己。</span></p><p><span>一个懂得敬畏天命的人，就会知道什么事情该做，什么事情不该做，就会开始变得克己，不会做那么多出格的事情。可是如果一个人不懂得敬畏天命，不懂得敬畏比我们更强大的力量，我们就会做出格的事情。</span></p><p><span>我们就会做冲动的事情，做伤害自己的事情。所以无论是天命也好，我们说大自然的力量也好，或者是一件事情，一个人当他的力量比我们更强大，我们就要学会敬畏。当你懂得敬畏，我们就成为一个智者，懂得以小去事大。</span></p><p><span>我们再看以大事小，乐天命者，以大事小，孟子告诉我们只有仁德的人，才可以做到，那为什么仁德的人，以大事小，是乐天命者呢？</span></p><p><span>以天命为乐，我们刚才讲到为什么要敬畏天命？因为他有更强大的力量。当我们处强大之时，我们要学习天命的这种力量，我们要学习天命的这种帮助万物的心。</span></p><p><span>我们看天，他是滋养万物的，是帮助万物来化育的，那当我们变得更强大之时，我们乐意接受天命，也就是接受天的这种帮助他人的能力，帮助他人的这种规律，我们也称之为道。也就是当我们变得更强大，我们要学会以大事小，帮助万物。</span></p><p><span>举个例子，比如说我们比别人更有钱，从这方面是强大的，我们帮助那些生活困难的人，就叫做以大事小，也是仁德的体现。也是乐天命者，因为天是乐意帮助世人，帮助万物的。</span></p><p><span>再比如说，我们比他人更有智慧，那乐天命者，以大事小，就是帮助别人，也可以得到智慧。比如说我们在工作当中，我们的工作做得更优秀，什么叫乐天命者，帮助那些工作，不如我们的人，我们去把他教会。</span></p><p><span>再比如说，我们的力量更强大，我们不会用自己的力量，去欺负比我们弱小的人。而我们是帮助他，让他也可以变得更有力量，让他也可以变得更好，懂得以大事小，是有仁德的体现，同时也是乐天命者。</span></p><p><span>我们愿意向天去学习，去帮助万物，帮助比我们更弱小的。以小事大，畏天命者。当我们更小更弱，我们要学会敬畏比我们更强大的人。我们敬畏他的力量，敬畏他的品德，敬畏他的强大，以保全自己。</span></p><p><strong><span>乐天者保天下，畏天者保其国。</span></strong><span>乐天者是可以保有天下的，为什么呢？我们可以去看汤和文王的故事，明明自己是更强大的，并不会以大欺小。同时还愿意以大事小，这就是乐天者，乐意接受天命，去帮助世人，帮助万物。</span></p><p><span>所以才可以保有天下，因为他是向天看齐，学习的是天身上的品质。用仁德不停地去帮助邻国，帮助百姓，因而别人自然就会更加拥护。所以商汤开创了商朝，而文王奠定了周朝的开国基础，这就是乐天者。</span></p><p><span>我们在生活当中也是如此，如果我们更强大，而我们还有仁德之心。去以大事小，帮助那些不如我们的人，帮助比我们更弱小的人，我们就可以保有更多，别人对我们的尊敬，别人对我们的拥护，这都是保有。</span></p><p><span>如果一国之君，可以以大事小，乐天命，就可以保有天下。如果我们一个人可以乐天命，以大事小，你就可以保有更多。</span></p><p><span>畏天命者保其国，懂得敬畏，比我们力量更强大的人，我们就可以很好的保住自己的国家。比如说太王，比如说勾践，因为他们敬畏比我们力量更强大的人，懂得去让自己找机会，重新去崛起，也就是学会了保全自己。</span></p><p><span>其实我们在生活当中，也是如此，比如说，走在路上遇到比我们更强大更凶狠的人。我们何必与他争一时之风，这个时候保全的就是自身。</span></p><p><span>在生活当中，你要做一个智者，要做一个仁者，仁者是让自己保有更多。智者是让我们学会处弱势之时，保全自己。</span></p><p><strong><span>《诗》云：畏天之威，于时保之。</span></strong><span>最后引用了《诗经》当中的一句话，这篇《诗经》出自于《周颂·我将》，是在武王伐商纣王之前，出征的时候，祈请上天。其中说到畏天之威，于时保之。敬畏天的威力，保我国家的福佑福祉。</span></p><p><span>因为武王去伐商纣王，是为民请命。因为商纣王荒淫无道，所以导致百姓民不聊生，生活在水深火热之中，所以这个时候武王伐纣。但是想要祈请上天，祈请上天有强大的威力，畏惧上天的这种威力和威严。</span></p><p><span>但是伐纣，绝不是为了自己的私欲，而是为了全天下的百姓。所以祈请上天保佑我的子民，让这些子民可以得到护佑，得到福祉。武王伐纣之时，既然他是敬畏上天的，也就自然会克己，所以我们在生活当中也是一样的。</span></p><p><span>当你懂得敬畏天地，敬畏自然，敬畏法律，敬畏比我们更强大的人。你自然就会克己，我们会严格的要求自己的行为。做事情要小心谨慎，可是如果一个人没有了敬畏之心，如果你不敬畏天地，你什么事情都敢做。</span></p><p><span>如果你不敬畏法律，你就会做违法犯纪的事情。如果你不敬畏你的领导，你就不懂得尊重你的领导，不懂得做好自己的本职工作。所以一个人要学会有敬畏之心，我们敬畏一切比我们力量更强大的人和事，以及自然。</span></p><p><span>我们自然就知道什么事情该做，什么事情不该做。我们整个再看这一段，孟子和齐宣王之间的对话，齐宣王问孟子，交邻国有道乎？和邻国交往有什么样的方法吗？</span></p><p><span>孟子讲到其实有两个方法，当你更强大之时，你要做一个仁德之人。可以以大事小，当你处弱小之时，你要做一个有智慧的人，可以以小事大。不要逞一时之气，让自己走上绝境，给自己带来伤害。</span></p><p><span>我们把这两个观点，引用到我们的生活当中来。我们在生活当中，既是强者亦是弱者。有比我们更弱小的人，我们有处上位之时，这个时候我们就是强者，就是大的。</span></p><p><span>我们要学会用仁德之心，以大事小，去帮助那些不如我们的人。去帮助那些处下位的人，帮助那些弱小的人，如此乐天者可以保天下，我们可以保有的更多，拥有的更多。</span></p><p><span>当我们处弱者之时，我们就要学会以小事大，去做一个智者，做一个有敬畏之心之人，我们去敬畏我们的领导，以小事大，我们去敬畏比我们更强大的人，敬畏比我们更有智慧的人，以小事大可以保其国。也就是可以保全自己，让自己有机会成长，可以变得更优秀。</span></p></div>"
},{
    "title": "《孟子》梁惠王下③-3 匹夫之勇",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下③-3 匹夫之勇</strong></span></p><p><span><strong>王曰：“大哉言矣！寡人有疾，寡人好勇。”对曰：“王请无好小勇。夫抚剑疾视曰：‘彼恶敢当我哉！’此匹夫之勇，敌一人者也。王请大之。《诗》云：‘王赫斯怒，爰整其旅，以遏徂莒，以笃周祜，以对于天下。’此文王之勇也。文王一怒而安天下之民。</strong></span></p><p><span><strong>王曰：大哉言矣！</strong>我们看这句话有两个意思，首先大哉言矣。齐宣王在赞叹，孟子讲的这番话真的很伟大，什么话呢？齐宣王问交邻国有道乎？孟子讲，当然有，仁者可以以大事小，</span><span>当你更强、更大，却可以去帮助弱者，这是有仁德之人。</span></p><p><span>智者可以以小事大，当你碰到比你更强大的力量，你要懂得敬畏，敬畏他的力量，以保全自己。所以讲到以大事小，是仁德的体现，以小事大是智者的体现。</span></p><p><span>那么齐宣王赞叹，大哉言矣，这番话很伟大。可是还有第二层意思，但是似乎他不能解决我当下实际的问题。</span></p><p><span><strong>寡人有疾，寡人好勇。</strong>接下来齐宣王又讲到说，我有点毛病，疾就是毛病。寡人好勇，说我这个人好勇。我们这里不禁要去想了，勇敢不是一件好事情吗？看你勇敢用在什么地方，比如说，齐宣王的好勇，他是好争斗的。他是好战的，所以他与邻国相交，总是用武力用战争去解决，总是争强好胜。</span></p><p><span>这里我们可以看到，齐宣王讲大哉言矣。这番话很伟大，但是说孟子讲的太大了，我做不到。</span><span>他离我也太遥远，我想问当下具体的，可以解决我这个问题的方法。我是有一些毛病的，我这个人好勇，好勇要怎么才能与邻国更好地去交往呢？</span></p><p><span>我们这里先做一点延伸，显然齐宣王并没有听懂，孟子在讲什么。齐宣王问，与邻国交往</span><span>有什么样的方法吗？孟子讲，有。你可以做一个仁者，以大事小。也可以做一个智者，以小事大。看看像不像生活当中的我们。</span></p><p><span>举个例子。我们会问，怎么才能成为一个更优秀的人？如何才能跟别人，更好地打交道呢？</span><span>如何才能更好地教育孩子？孟子告诉我们，仁义而已矣。告诉我们如何与他人打交道，如果你是强大的，你要懂得做一个仁德之人去帮助弱小的。如果你是弱小的，我们要做一个智者，</span><span>以保全自己。</span></p><p><span>如何才能让自己变得更优秀，仁义而已矣。你只要懂得付出帮助他人，你自然就会变得更优秀。如何才能生意变得更好？仁义而已矣，你只要想着去帮助更多的人，帮助更多的顾客，</span><span>你的生意自然就会变好。</span></p><p><span>如何教育好孩子？我们懂得提升自己就好了，只要你自己变得更有德行，那么你的孩子就会被你影响变得更好。可是我们听到这里，或许也会像齐宣王一样，说大哉言矣。</span></p><p><span>这番话很伟大，但好像我做不到，他离我很远，能不能帮我解决具体的问题呢？说这个孩子不听话怎么办？说我现在的生意就是不赚钱怎么办？我跟身边的人就是没有更好地相处方法怎么办呢？我们看接下来孟子是如何讲的？</span></p><p><strong><span>对曰：王请无好小勇。</span></strong><span>孟子讲，齐宣王您不要好小勇。这里我们可以看到，孟子把勇敢这件事情分为了大勇和小勇。何为小勇呢 ？</span></p><p><strong><span>夫抚剑疾视曰：彼恶敢当我哉！</span></strong><span>这叫小勇。</span><span>夫是助词；抚剑是按着剑柄；疾视，疾就是不太正常的，有些毛病，形容得是怒目圆睁、怒目而视。</span></p><p><span>我们看这里的小勇，抚着剑柄，怒目而视，曰：讲到彼恶敢当我哉，谁敢阻拦于我。我们再看何为小勇？按着剑柄怒目而视，讲到谁敢阻挡于我？看看生活当中很多时候，我们是不是这种小勇？</span></p><p><span>比如说用着自己的情绪，发着脾气，按着剑柄或者叉着腰，谁能奈我何？你能把我怎么样？</span><span>我就是这个样子。</span></p><p><strong><span>此匹夫之勇，敌一人者也。</span></strong><span>说这是匹夫之勇，你可以战胜打败一个人，形容小。何为匹夫？</span><span>指的是一个人，同时也指没有智慧的普通人，我们称之为匹夫。</span></p><p><span>如果一个人总是怒目而视，认为自己很勇敢，这是没有智慧的体现，是一个逞匹夫之勇的人。</span><span>你是没有多大力量的，只可以战胜一个人而已。</span></p><p><span>我们可以看到孟子的语言，是很犀利的。当齐宣王问道，说我这个人好勇，斗狠，比较喜欢战争，好胜。孟子接下来就讲，王请无好小勇，说你可以勇敢，但是不能好这种小勇。这实在是一个没有智慧的匹夫去好的勇。</span></p><p><span>齐宣王贵为一国之君，怎么能做一个没有智慧的匹夫呢？可谓直达齐宣王的痛处，那么既然讲了齐宣王的小勇，一定会举例子做对比。接下来要讲，何为大勇。</span></p><p><strong><span>王请大之。</span></strong><span>告诉齐宣王要把您的这种勇去扩大，向外延伸，变成大勇。</span></p><p><strong><span>《诗》云：王赫斯怒，爰整其旅。</span></strong><span>这一篇是《诗经·周颂》当中的《皇矣》，是赞叹周氏的，赞叹文王的祖父，文王的父亲以及文王。赞叹文王可以以强扶弱，扶助弱国，去伐密伐索。</span></p><p><span>密是密国，索是索国。</span><span>因为密国和索国仗着自己强大，欺负弱小的莒国。我们看这篇《诗经》引用的内容，王赫斯怒，文王发怒，爰整其旅，整合自己的军队。</span></p><p><strong><span>以遏徂莒，以笃周祜。</span></strong><span>遏指的是阻止，这里的莒指的是莒国。文王动怒整顿军队，以阻止欺凌莒国的行为，以笃周祜。笃指的是增加，以增加周国的福佑。</span></p><p><span>我们去看为何文王动怒呢？动怒是因为密国索国，仗着自己强大，欺凌弱小的国家。比如说，莒国，这个时候文王的动怒，是为了扶助弱小。以笃周祜，是增加周国的福祉。</span></p><p><span>为何会增加周国的福祉？因为他的勇是大勇，不是小勇。不是为了自己的情绪，不是为了自己的尊严，而是为了帮助弱小的国家。他越是帮助弱小的国家，越会民心所向，自然也会增加周国的福祉。</span></p><p><strong><span>以对于天下。</span></strong><span>增加周国的福祉，才更好的回报天下人，对周国的期望。我们再来看这段话，一个有德行的人，一个大勇之人，如何报答天下人的期望？就是你做更有德行的事情，不要为了自己的得失和情绪去愤怒，而是要除强扶弱，这会更加增加自己的福祉，去回报给天下人的期盼。</span></p><p><strong><span>此文王之勇也。</span></strong><span>这里孟子给出了结论，说这是文王的勇。言下之意，文王的勇和齐宣王的勇，是不一样的。齐宣王是按着剑柄怒目而视，谁敢阻挡我？这是为了证明自己的强大，这是好斗、好胜、好战，所以称之为小勇。</span></p><p><span>那么文王之勇，为何发怒整顿军队？是帮助弱小的国家，来回报天下人的期盼。如果文王不去做这些事情，谁去帮助弱小，天下之人都在期盼，有人主持正义，有人主持公正，这是文王之勇。他的勇是为了弱小，为了更多百姓的期盼。</span></p><p><strong><span>文王一怒而安天下之民。</span></strong><span>我们可以看到文王之勇，他的怒可以安天下之民，安天下百姓。</span></p></div>"
},{
    "title": "《孟子》梁惠王下③-4 小大之分",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》梁惠王下③-4 小大之分</span></strong></p><p><strong><span>《书》曰：天降下民，作之君，作之师。惟曰其助上帝，宠之四方。有罪无罪，惟我在，天下曷敢有越厥志？一人衡行于天下，武王耻之，此武王之勇也。而武王亦一怒而安天下之民。今王亦一怒而安天下之民，民惟恐王之不好勇也。</span></strong></p><p><strong><span>《书》曰：天降下民，作之君，作之师。</span></strong><span>引用《尚书·周书》里面的《泰誓》，这一篇是武王伐纣之前的誓词。在这篇誓词当中，开篇历数了商纣王的一些行为。</span></p><p><span>讲他如何对待天下百姓的，如何残暴不仁的，历数商纣王的罪行，以后接下来讲到，天降下民，天生万民，说百姓都是老天降生的。老天不光降生了万民，降生了万民以后，作之君，作之师，又降生了君主，又降生了师长。</span></p><p><strong><span>惟曰其助上帝，宠之四方。</span></strong><span>为何要降下君主，降下师长。惟曰其助上帝，是要君主和师长</span></p><p><span>帮助上天，宠之四方，也就是保护天下百姓。</span></p><p><span>我们来看这段话，他在讲什么？首先历数了商纣王的罪行，是如何残暴不仁的，如何对天下百姓的？那么接下来讲到，上天降下了万民，又降下了君主，降下了师长。作为君主和师长，是要帮助上天教化百姓，让百姓过上好的生活，去保护百姓的。</span></p><p><span>可是商纣王他不光不去保护百姓，而且残暴不仁，那么既然如此残暴不仁，天命自然是要换君主的，是要重新换一个更有仁德的君主，代他去管理天下，宠之四方，去保护百姓的。</span></p><p><span>孟子这里又引用了武王伐纣当中的《泰誓》，是想告诉齐宣王，既然你作为齐国之君，你就要去爱护你的百姓。你的勇，你的怒都应该是为百姓而发，绝不是为了自己的私利，绝不是为了自己的面子，绝不是为了自己的小勇，而应该是大勇。</span></p><p><span>我们这里做一点延伸，在生活当中的我们也是一样的，如果你是处上位的人，如果你是做人师长的人，如果是为人父母的人，我们就要懂得宠之四方，也就是保护你所能保护的人。</span></p><p><span>比如说，作为父母，你要保护自己的孩子，这就是天命。比如说，你作为师长，你就要保护自己的学生。比如说，你作为处上位的人，你就要保护跟随在你身边的人。</span></p><p><strong><span>有罪无罪，惟我在，天下曷敢有越厥志？</span></strong><span>有罪无罪，有我在，天下谁敢阻挡这种意志？我们再来看这段话，告诉我们天降万民，同时又降下君主，降下师长，这是上天的意志。</span></p><p><span>那么今天武王去伐商纣王，这件事情到底是有罪无罪，有我武王在，当仁不让。天下谁敢违背上天的意志，何为上天的意志，降下君主和师长，就是要帮助上天保护百姓的。</span></p><p><span>这种意志不可动摇，而今天商纣王，他并没有履行上天的这种意志，他是残暴无道的，所以一定要出兵伐纣，是想替天下万民做主，不能违背上天的意志。</span></p><p><strong><span>一人衡行于天下，武王耻之，此武王之勇也。</span></strong><span>因为商纣王一个人衡行天下，武王觉得这是耻辱，所以出兵伐纣。此武王之勇也，这是周武王的勇。</span></p><p><strong><span>而武王亦一怒而安天下之民。</span></strong><span>孟子又讲到武王和文王是一样的，一怒而安天下之民。我们这里可以做一个对比了，看看文王之勇，看看武王之勇，再看看齐宣王之勇，文王和武王为什么发怒？</span></p><p><span>文王发怒，整合军队去征伐密国索国，是因为天下百姓，因为他欺凌弱小，不修仁德，而武王伐纣，一怒而安天下万民。是因为商纣王没有履行上天的意志，上天降下万民，那都是天的子民。</span></p><p><span>又降下君主，降下师长，是让君主和师长爱护百姓，教化百姓过上幸福稳定的生活，可是商纣王却是残暴不仁的，荒淫无道的，所以武王发怒，整合天下兵马去伐纣，是因为想让百姓过上更好的生活，所以我们这里，可以看到何为大勇？</span></p><p><span>大勇是为了天下百姓的，不是为了自己的，何为小勇？是为了自己的面子，为了自己的尊严，</span></p><p><span>为了自己的强大，抚剑怒目而视，所以齐宣王的勇是小勇。</span></p><p><strong><span>今王亦一怒而安天下之民，民惟恐王之不好勇也。</span></strong><span>孟子讲，如果大王您一怒，也是为了安天下之民，那么百姓唯恐大王您不好勇，百姓是希望您好勇的。</span></p><p><span>我们看整个这一段，孟子讲了小勇，讲了大勇，何为小何为大？小勇是为了证明你自己的强大，也就是自私，是为了私的。而大勇并不是为了自己的强大，是为了安天下之民，也就是为公的，为了帮助他人的。</span></p><p><span>我们由此延伸大和小，我们举生活当中的例子，如果一个人力气比较大，或者比较能打，体力比较强，如果你只是为了争强好胜，这就是小勇，你只是为了证明自己能打，证明自己厉害。</span></p><p><span>何为大勇？当你看到弱者被人欺负，这个时候仗义出手，去帮助那些弱者，这是为别人在付出，在奉献，这就是大勇。</span></p><p><span>所以我们讲见义勇为，见到合于义的事情，见到有人欺凌弱小，这个时候你出手相助，这个称之为大勇。可是如果你只是自己好勇斗狠，这都是小勇。我们看不光勇如此，生活当中，其他的事情也有大小之分。</span></p><p><span>举个例子，我们讲大仁大义，小恩小惠，这里大小做一个对比，何为大仁大义？你做的事情</span></p><p><span>是为了帮助更多人的，我们称之为大仁大义。何为小恩小惠？就是你帮助别人，给他人一些恩惠，是为了自己的利益，是你有所图，为了达到某种目的，我们称之为小恩小惠。</span></p><p><span>举个例子，你帮助他，是为了他给你什么样的赞美，是为了他在别人面前说你的好话。比如说，你送给他什么样的东西，你是为了求得某种回报和利益的，这都称之为小恩小惠。</span></p><p><span>我们看还有什么事情有大小之分，比如说大爱和小爱，何为小爱？爱你自己身边的人，爱你所拥有的，我们称之为小爱。</span></p><p><span>举个例子，老吾老以及人之老，老吾老，这个叫小爱，以及人之老叫大爱。幼吾幼以及人之幼，幼吾幼属于小爱，以及人之幼这就属于大爱。为什么老吾老和幼吾幼这叫小爱？因为是我们自己家的老人，自己的父母，幼吾幼自己的孩子，所以称之为小爱。</span></p><p><span>但是如果我们懂得把这种小爱，不停地去延伸，以及人之老以及人之幼，我们可以爱护别人的老人，别人的父母，我们可以爱护他人的子女，他人的孩子，这个就称之为大爱。</span></p><p><span>我们经常讲说，一个人真的很有大爱，那就是因为他所帮助的人，跟他并没有什么亲近的关系，他可能也并不相识，但还愿意出手相帮，还愿意给予和帮助他人更多，这就称之为大爱。</span></p><p><span>再比如说，我们会讲大人大量，会讲小肚鸡肠，这又形成了鲜明的对比。何为大人大量？就是明明自己是对的，别人是错的，但是不与人计较。</span></p><p><span>我们会讲说，这个事情确实是我做错了，但是请您大人大量，不要与我计较。你看对方是占着道理的，他是正确的，可是却不与人计较，这就叫大人大量。</span></p><p><span>那什么叫小肚鸡肠呢？无论对错，只要对方说的话，我不喜欢听，只要他伤害了我的利益，只要对我是没好处的，我就会记在心上，放在心里。可能更有甚者，还要伺机报复，这就是小肚鸡肠。</span></p><p><span>还有我们讲大智慧和小聪明，什么叫大智慧？你是利他的，是为他人着想的，我们就称之为大智慧。因为你为他人着想，所以你讲的话，你的行为自然就是合于道德的，合于仁义的。</span></p><p><span>有的人讲的话，合于道，合于德，他是仁义的，告诉我们向善的，帮助他人的，我们称之为大智慧。</span></p><p><span>何为小聪明？都是为自己谋划的，在意的都是自己的得失，比如说我做个生意，我自己如何才能赚得更多呢？我告诉自己的孩子，如何才能占得更多的便宜，我在一个企业当中工作，</span></p><p><span>如何才可以不劳而获，或者少做，但是可以多得，这都叫小聪明。</span></p><p><span>我们刚才举了这么多例子，再来总结何为大？何为小？大就是为公的，是为了帮助别人的，是利益他人的，就称之为大。什么叫做小呢？都是为私的，都是为了利益自己的，都是看自己的得失，我如何才能得到更多，这就称之为小。</span></p><p><span>所以人有大勇，有小勇；有大爱，有小爱；有大智慧，有小聪明；有大人大量，有小肚鸡肠；</span></p><p><span>有大仁大义，有小恩小惠。看看我们自己在生活当中，你可以好勇，就像齐宣王一样。但是孟子告诉齐宣王，王请无好小勇，你不要去好小勇，你要像文王和武王一样，一怒而安天下之民，此乃大勇。</span></p><p><span>他是为了天下百姓的，你可以好仁，但是不要为了小恩小惠，为了自己去谋划，为了自己的得失。你要想着去帮助更多的人，给予更多的人，这就是大仁大义。我们可以有爱，但是要把这种爱，不停地去扩大，让我们变成有大爱之人，有大德之人。</span></p><p><span>你可以有聪明，但是不要用小聪明，不要总是机关算尽，为自己谋划。你要想着让自己合于道德，合于仁义，如何去想着用你的聪明，去帮助更多的人，这个就称之为大智慧。</span></p><p><span>生活当中还有很多大小之分，如何区分大小？就一个观点，为公的，帮助他人的，利益他人的，就称之为大。如果是自私自利的，为自己谋划的，在意自己的得失的，就是小。</span></p></div>"
},{
    "title": "《孟子》梁惠王下④-1 乐以天下",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong><strong>《孟子》梁惠王下④-1 乐以天下</strong></strong></span></p><p><span><strong>齐宣王见孟子于雪宫。王曰：“贤者亦有此乐乎？”孟子对曰：“有，人不得，则非其上矣。不得而非其上者，非也；为民上而不与民同乐者，亦非也。乐民之乐者，民亦乐其乐；忧民之忧者，民亦忧其忧。乐以天下，忧以天下，然而不王者，未之有也。”</strong></span></p><p><span><strong>齐宣王见孟子于雪宫。王曰：贤者亦有此乐乎？</strong>雪宫是宫外之宫又被称为离宫，也就是平时齐宣王所住的，宫殿之外的宫殿。齐宣王这个人重享乐，所以他在郊外建了很多的行宫。雪宫是其中之一，并且齐宣王喜欢建园林、挖沼泽、养麋鹿、养各种鸟兽，也喜欢建猎场。</span></p><p><span>所以通过种种行为，我们可以看到齐宣王是非常注重享乐之人，那么这一次齐宣王在雪宫召见了孟子，算是一种款待。雪宫本身就是游乐之用，用来宴请宾客。在这个场景之下齐宣王问孟子，贤者亦有此乐乎？</span></p><p><span>说那些贤德之人，也会有这样的享乐吗？我们从这句话当中延伸两个观点，第一个观点，齐宣王知不知道自己当下这是享乐的，是过于奢华的？</span></p><p><span>那么第二个观点，是不是齐宣王自己也会觉得，真正贤德的人应该不是这样享乐生活的，所以才会有此一问。也就是从齐宣王的潜意识当中，他是知道现在自己很享乐、很奢华，并且隐隐可以感受到，贤者似乎不应该有这样的享乐。</span></p><p><span>那么由此就要有一个思考了，我们是不是也不禁要问，贤者亦有此乐乎？那些贤德的人也会去享乐吗？他们也去享受生活吗？不光是贤者如此，立志想要成为贤者之人，心里会不会有这样的想法和顾虑呢？</span></p><p><span>我想要成为一个贤者或者当我们成为一个贤者之时，难道我们就不要注重一些享受的事情吗？我们带着这个疑问，看看孟子对这件事情是怎么看待的。</span></p><p><span><strong>孟子对曰：有。</strong>孟子讲可以的，贤者亦可以享乐。我们从这里要做一下延伸，贤者是可以享受这种快乐的。但是有一个前提条件，你要把你自己的本职工作做好以后，你才可以享乐，所以叫贤者后乐此。</span></p><p><span>听到这番话是否有些熟悉，梁惠王曾经问孟子，贤者亦有此乐乎？孟子对曰：贤者后乐此。也就是贤者可以有这些享乐，但是，是要放在后面的。作为一个贤者，一定是做好自己本职工作以后，然后才可以去享乐。</span></p><p><span>我们看齐宣王的本职工作是什么？是治理好你的国家，让百姓过上温饱的生活。安居乐业，也就是百姓在安居乐业之后，那么齐宣王您是可以享乐的。正如我们讲的文王和武王，他先是安天下，让百姓过上好的生活，这个时候他才会重自己的享乐，并且与民同乐。</span></p><p><span>我们延伸到生活当中也是如此，举个例子，比如说我们作为一个企业的老板，我们是需要把企业经营好，让员工也过上好的生活，这个时候我们才可以去享乐。</span></p><p><span>否则如果我们自己没有让员工变得更好，没有让企业变得更好，这个时候如果我们享乐就是别人的眼中钉，肉中刺，其他的员工一定会反对我们，记恨于心。</span></p><p><span>就像文中的齐宣王是一样的，如果没有让百姓过上好的生活，自己重享乐，百姓心中是有愤恨的，那么又能享乐多久呢？所以贤者可以有快乐，可以有享受，但是要在完成本职工作之后。否则就会有一种现象出现，我们看孟子讲它是一种什么现象？</span></p><p><span><strong>人不得，则非其上矣。</strong>如果别人得不到这种快乐，就会非议，就会认为处上位的人是不对的，就会抱怨君主，这就叫非其上。比如说齐宣王，自己重享乐，但是人不得，也就是百姓得不到这些快乐。</span></p><p><span>则非其上矣，就会抱怨君主，也就是抱怨齐宣王。我们延伸到生活当中也是一样的，有很多时候我们都处在上位。</span></p><p><span>比如说刚才的例子，我们是做企业老板的，如果只重自己享乐，而没有让员工变得更好，他得不到这些快乐就会抱怨。作为老板这个人是不行的，品德是有问题的，这个时候如果大家都是心生抱怨的，企业又怎么可能长久呢？</span></p><p><span>我们再举个例子，到生活当中也是一样的，比如说作为父母的人是处上位的，如果你自己要求孩子不可以玩游戏，不可以玩手机。可是自己玩手机的时候，却不亦乐乎，很开心的样子，会不会让孩子心生非议？这个时候他就是心存抱怨的。</span></p><p><span>我们要想享乐可以，要先做好自己分内之事，要让别人也得到相应的快乐，这个时候我们的乐，才可能会变得长久。</span></p><p><span><strong>不得而非其上者，非也。</strong>那些得不到的人，自己得不到快乐。得不到更好生活的人，他去抱怨处上位的人。非也，这是不对的。</span></p><p><span>举个例子，一个员工如果没有得到更多，去抱怨老板，这是不对的，要靠自己努力奋斗而去获得。比如说，一个孩子去抱怨父母没有留下更多的财产，没有给他更好的教育，抱怨父母，这是不对的，是错误的。</span></p><p><span>当我们处下位之时，不要去抱怨，要靠自己努力拼搏。而不是看到处上位的人享乐，他得到更多而心生抱怨，这是对处下位的人所讲的话。我们再看看对处上位的人，孟子是如何讲的？</span></p><p><span><strong>为民上而不与民同乐者，亦非也。</strong>为民上也就指的是君主，延伸到生活当中就是我们处上位之时。当我们处上位之时，如果不能和他人共同快乐，共同去享受当下的果实，这个也是不对的。</span></p><p><span>我们看这段话的关系分为两个角度，在给我们去讲述这个道理，当我们处下位之时，不要去抱怨，要靠自己努力获得。越是抱怨，拥有的将越少，失去的将越多。但是当我们处上位之时，就要反过来去思考问题了。如何想着与民同乐，也就是怎样让别人可以获得更多，我们的快乐才会变得更长久。</span></p><p><span><strong>乐民之乐者，民亦乐其乐。</strong>这里提到乐民之乐，我们之前讲过与民同乐。比如说，文王他自己拥有园林猎场，他可以让普通的百姓进入，可以来割草、砍柴、打鱼、捕鸟，这就叫与民同乐。</span></p><p><span>他可以和百姓共享，并且与民同乐还有更深的含义，是我们帮助百姓可以获得更多，可以教给他更多生存之道，可以教给他如何种田，如何捕猎，可以去办教育，去教化于民。这都是在不停地提升民众，称之为与民同乐。</span></p><p><span>我们看这里乐民之乐，我们同样也把它讲成两层的含义，第一层什么叫乐民之乐？举个例子，比如说我们自己面前，有很多我们自己喜欢的东西，这些喜欢的东西可以让我得到快乐，但我们对面这个时候，有一个民众，他也有很多自己喜欢的东西。</span></p><p><span>什么叫乐民之乐？就是你可以跟着他的快乐去走，也可以看到他的快乐而乐。比如说，可以喜欢他的喜欢，可以喜好他的喜好。好比是我们陪孩子在玩某个游戏和玩具的时候，那是孩子的快乐，所以我们要陪他一起玩，让他体会到这种快乐，这是乐民之乐。</span></p><p><span>还有第二层意思是什么呢？是帮助他人完成自己的所需，或者说他期待的快乐，比如说民众想住上更好的房子，那是他的快乐，所以我们去帮助他实现自己的理想，自己所期盼到那个快乐，这叫乐民之乐。</span></p><p><span>再比如说对于百姓来讲，他也想去学习文化，他也想让他的下一代变得有学识，变得更优秀。这个时候去兴办教育，教给他的子女更多的文化，以让他得到成长，这叫乐民之乐。</span></p><p><span>所以我们再来总结，乐民之乐的两层意思，首先不要挑剔、指责、嫌弃他的喜好，我们要跟着他的喜好，去多给他一些支持鼓励，就像我们陪孩子玩是一样的。</span></p><p><span>那么第二层，我们看看他的生活还有什么所需，我们帮助他完成自己的想法，完成他所期待的那些快乐，这叫乐民之乐。治理一个国家，要学会乐民之乐。我们在一个家庭当中也是一样的，比如说，你去看看你孩子当下的快乐是什么？你可以多给他一些陪伴，这叫乐民之乐。</span></p><p><span>还有你看看孩子的期盼是什么？他想得到什么才能快乐，他的需求是什么？我们帮助他完成需求，这是乐民之乐。我们夫妻之间相处不是这样的吗？你要去尊重他的爱好，而不是嫌弃他的喜好和快乐。</span></p><p><span>同时我们去看看爱人他还有什么样的需求？做到什么样子他才会得到更多的快乐？所以这个时候就是在帮助妻子，那也就是乐她之乐。</span></p><p><span>同样的道理，我们延伸到企业当中，和朋友相交都是如此，看看我们的员工，他现在的乐是什么？他所期盼和需要的快乐又是什么？比如说我们交朋友，看看我们的朋友当下的乐是什么？他所需要的快乐又是什么？</span></p><p><span>我们做生意同样的道理，如果懂得去帮助客户，实现他当下的快乐，以及他所需要的快乐，这个时候他自然就会希望你变得更好。所以孟子讲，乐民之乐者，民亦乐其乐。</span></p><p><span>如果作为一个君主，以民众的快乐为乐，这个时候民众自然会反馈回来，以我们的快乐为乐。如果我们以孩子的乐为乐，孩子自然就会反馈回来，以我们的乐为乐。如果我们以爱人之乐为乐，他自然就会反馈回来，以我们的乐为乐。</span></p><p><span>做企业也一样，如果我们把员工的快乐，把他们所需要的快乐放在心中，他们自然想要去满足你更多的快乐，帮助实现我们的快乐。所以我们讲爱出者爱返，爱的作用它是相互的。当我们去帮助别人实现快乐，就会有更多人帮你实现快乐。当我们懂得去付出，爱护别人，别人自然懂得付出来爱护我们。</span></p><p><span><strong>忧民之忧者，民亦忧其忧。</strong>那与乐相反的，相对立的就是忧愁。当我们忧民之忧，民众自然也就忧你之忧。我们讲爱出者爱返，不光爱出者爱返，恨也是如此。当我们去恨他人之时，他人也在恨着我们。</span></p><p><span>所以我们讲力的作用是相互的，爱是一种力量，它是相互的，恨也是一种力量，它是相互的。指责和抱怨都是一种力量，它都是相互的。作为一个君主，让百姓得到快乐，去忧愁百姓的生活，那么当国家受到侵略之时，百姓就会奋起反抗，因为他忧你之忧。</span></p><p><span>当我们做一个企业也是如此，如果总是乐民之乐，忧民之忧。当我们的企业遇到困难挫折之时，我们的员工也会忧我们之忧，会和我们同在，与我们一起面对困难和挫折。</span></p><p><span>我们看看爱人不是如此吗？当我们乐他之乐，忧他之忧，那么当我们遇到困境之时，他也同样忧我们之忧。</span></p><p><span>我们对于朋友也是一样，我们去付出帮助我们的朋友，当朋友有忧愁之时，我们是帮他忧愁，帮他解决的，当我们有忧愁之时，朋友自然就忧我们之忧。</span></p><p><span><strong>乐以天下，忧以天下，然而不王者，未之有也。</strong>当你以天下之乐为乐，以天下之忧而忧，还不能称王于天下，让天下归附，这是没有的事情。所以我们学习过的文王、武王，学习过的尧、舜、禹、汤，我们可以看到这些都是乐以天下，忧以天下的人。</span></p><p><span>他以百姓生活的更好为乐，他看到百姓生活在困苦当中，所以才会推翻上一个王朝，这就是忧以天下，所以这些人乐以天下，忧以天下，故而天下归附，称王于天下。</span></p><p><span>这里讲的乐以天下，忧以天下，是把这种胸怀放到了很大的程度，当我们以天下之乐为乐，天下之忧为忧，就会拥有整个天下。我们再把它缩小一点，放到生活当中，我们去乐多少人的事情，忧多少人的事情，就会拥有多少人的支持，以及帮助。</span></p><p><span>比如说我们做一个企业，我们把三十个人的乐放在心中，把这三十个人的忧愁放在心中，那么就拥有这三十个人的力量。如果可以乐五百人之乐，可以忧五百人之忧，那么你就拥有了这五百人的力量。</span></p><p><span>去看看我们当下的生活，拥有多少人的支持，有多少人愿意帮助我们呢？有多少人愿意给我们力量，我们就要去反思自己了，我们有以他人之乐为乐吗？我们有以他人之忧为忧吗？</span></p><p><span>所以要想让自己变成一个仁德之人，要想让我们变得有所作为，要想让别人去拥护和支持，就乐人之乐，忧人之忧。我们最后再回到齐宣王见孟子所问的问题，问孟子，贤者亦有此乐乎？</span></p><p><span>贤者也会有这样的享乐吗？孟子的答案是有的，但是它有一个前提，就是要把自己的本职工作做好。我们要先乐人之乐，先忧人之忧，这个时候才可以重自己的享乐。李白还有一句诗：“人生得意须尽欢”，我们看何为人生得意？一定是你在某件事情上有所建树，你做得很好，这个时候你才可以尽欢。</span></p><p><span>举个例子，说我们的事业做得很成功，然后围绕在身边的人，他们的生活也过得很好。比如说我们的员工，比如说我们的父母，比如说你的亲朋好友，都过得很好，都得到我们的帮助，那我们是人生得意的，这个时候可以尽欢了，我们可以去享乐。</span></p><p><span>再比如说，我们在感情这件事情上是得意的，我们的爱人，我们的父母，我们的孩子跟我们之间的感情都很和谐，这个时候可以尽欢，我们可以去享受了。</span></p><p><span>如果我们在某一个方面并没有得意，也就是并没有把自己该做的事情做好，又怎么能去重享乐？举个例子，如果我们是做一个企业的，我们并没有让员工变得更好，自己去享乐，这个时候你的企业怎么可能做长久呢？</span></p><p><span>就像我们讲的齐宣王是一样的，只是注重自己的享乐，建立了那么多的行宫、园林、猎场、沼泽，可是百姓生活在水深火热之中，那么齐宣王的这种享乐，又怎么可能会长久呢？因为他招致了别人的怨恨和愤怒。</span></p><p><span>所以我们在生活当中，可以自己重视一些享乐，但前提是把我们该做的事情做好。我们要在某方面是得意的，并且惠及到身边人的，乐人之乐，忧人之忧，在这个前提之下，我们可以去享受自己当下所拥有的生活。</span></p></div>"
},{
    "title": "《孟子》梁惠王下④-2 观于天下",
    "author": "虚空先生",
    "date": "2022-07-13",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下④-2 观于天下</strong></span></p><p><span><strong>昔者齐景公问于晏子曰：吾欲观于转附、朝儛，遵海而南，放于琅邪；吾何脩，而可以比于先王观也？晏子对曰：善哉问也！天子适诸侯曰巡狩；巡狩者，巡所守也。诸侯朝于天子曰述职；述职者，述所职也。无非事者。春省耕而补不足，秋省敛而助不给。</strong></span></p><p><span>上一讲我们讲到齐宣王在雪宫召见了孟子。在雪宫这样一个主游乐休闲的地方，没有那么正式，所以适合闲谈和请教问题。齐宣王在这里请教孟子，贤者亦有此乐乎？说那些贤德的人</span><span>也会有这种奢华的享乐吗？孟子的回答是肯定的。</span></p><p><span>但是贤者是在做好自己本职工作以后，做好自己分内之事才会去享乐。比如说作为一国之君，</span><span>你的本职工作就是让百姓过上安居乐业的生活，在这个前提条件下，是可以有自己的享乐的。</span></p><p><span>同样发生在雪宫的还有另外一个故事，这个故事讲的是齐景公和晏子之间的故事。它来自于《晏子春秋》，当中有记载齐景公曾经在雪宫这个地方，也请教过晏子类似的问题，我们看齐景公问了什么？</span></p><p><strong><span>昔者齐景公问于晏子曰：</span></strong><strong><span>吾欲观于转附、朝儛、遵海而南放于琅邪，吾何脩，而可以比于先王观也？</span></strong><span>首先我们先讲一讲晏子，晏子是齐国的良相，以贤德著称，为齐国是做了很多贡献的。我们在学习《论语》的时候，有数次提过晏子，孔夫子对于晏子其人也是很赞叹的。</span></p><p><span>这里我们就要思考一个问题了，晏子既然是良相，他的君主是不是也是明君呢？起码他是识才，懂得用人的。我们把这个道理延伸到生活当中，也是如此，他是彼此互相成就的关系。因为有明君，所以才会有良相，反过来也是如此，有良相自然会去辅佐明君。</span></p><p><span>你看我们在夫妻当中是不是如此？一个好的丈夫，一个好的妻子，这两个人他是互相成就，彼此付出，互相成长的。老师和学生之间也是如此，这个老师是一位智者，是一个有仁爱之心的人，在遇到一个好的学生，他是努力向上的、懂得感恩的，这个时候老师和学生是彼此成就的关系。</span></p><p><span>朋友之间也是如此，两个人都是重情重义的或者两个人都有某方面的才华，志同道合，这个时候彼此帮助，彼此成就。</span></p><p><span>我们在生活当中，首先要学会去提升自己，当自己变得更好，才能吸引一个更好的伴侣、更好的领导、更好的员工、更好的朋友以及更好的孩子。这个时候才能彼此互相影响，互相成就。我们再来看，为什么讲齐景公也是一个圣明之人呢？他也是一位有仁德的君主，我们看看他问了什么问题？</span></p><p><span>吾欲观于转附，朝儛。转附和朝儛指的是两座山，齐景公问晏子说，我想去观一观，看一看这两座山，遵海而南，放于琅邪；沿着海一直向南行，直到琅邪这个地方。吾何脩，而可比于先王观也？我要去做些什么事情？我的行为是什么样子的，才可以比得上先王之观？</span></p><p><span>我们这里看到齐景公的问题，他说我要做什么，才可以比得上先王？我们先讲一讲，先王这两个字，我们往大了讲是周文王、周武王，那是整个周天下。我们往小了讲，齐国的开国之君姜子牙，他是辅佐武王打了天下的功臣，所以给他封在了齐国，做了第一任的齐国国君。</span></p><p><span>先王是什么概念？既然他可以创造一个天下，开创一个王朝，就说明他是贤德之人。那么既然是先王，也就说明了是智者、仁德之君。</span></p><p><span>我们看齐景公，他想要效法的是先王，无论是文王、武王还是姜子牙，都是有仁德、有才能、有智慧之人，都是心怀天下苍生之人。所以齐景公去问晏子，说我想要出游，去观一观天下之事。</span></p><p><span>我需要以什么样的行为，才能和先王比肩，我要如何去效法先王？所以我们看到齐景公的问题，就可以看到他自己内在的仁德和他想要效仿的榜样。</span></p><p><span>我们还记得齐宣王第一次问孟子，问的是齐桓公以及晋文公之事。我们通过问题，就可以看到这个人心中所想，宣王的第一个问题是想要称霸，而齐景公问晏子的问题是，我要如何做，才能效法先王？也就是如何成为一个贤德之君。</span></p><p><strong><span>晏子对曰：善哉问也。</span></strong><span>这个问题问得好，晏子是一位良相，本身是一位有德行之人，所以当齐景公问出这样的问题，要去效法先王之行，这个时候晏子是赞叹景公的，说问得真好。</span></p><p><span>接下来，我们要去讲一讲观字，齐景公说他要去观天下之事，到底什么叫做观？我们一说观就是看一看，难道是看一看那两座山吗？或者是沿着海去看海吗？到底要看什么？接下来晏子给我们具体来讲，到底什么叫做观？先王到底在观些什么事情？</span></p><p><strong><span>天子适诸侯曰巡狩；巡狩者，巡所守也。</span></strong><span>适是到的意思。前往天子前往诸侯那里叫做巡狩，</span><span>巡狩者巡所守也。巡狩是什么意思呢？就是天子到达了诸侯的地方，观看他所守护的疆土，</span><span>也就是去看看诸侯他都做了些什么事情，有没有做好自己的本职工作分内之事，有没有让百姓过上好的生活。</span></p><p><span>我们再来看这个概念，天子去诸侯那里叫做巡狩，巡狩的意义在于去查看诸侯，是否做好了分内之事，是否做好了为君之责？我们用现在的话，就叫领导视察工作，当一个领导到一个分公司或者子公司来视察工作，看什么呢？去看看工作做的是否到位，看看有没有履行自己的职责和该做的事情？</span></p><p><span>有没有把这个企业的事情做好？有没有照顾好我们的员工？有没有服务好顾客，有没有让公司的业绩变得更好。</span></p><p><span>同样天子去诸侯那里，去看看他有没有爱护百姓，有没有把诸侯国经营得更好，所以我们这里首先看什么叫做观？不是游山玩水叫做观，出去也是在视察工作的，看看他们的事情做得如何？心中有没有装着百姓？</span></p><p><strong><span>诸侯朝于天子曰述职；述职者，述所职也。</span></strong><span>刚才讲的是天子到诸侯那里叫从上而下，接下来又讲了从下而上。诸侯来朝见天子称之为述职；述职是什么意思呢？述职者述所职也。也就是诸侯要向天子陈述自己的职责，去讲述自己都做了哪些事情？</span></p><p><span>我们看这个过程，是有上有下的，天子到诸侯是上到下，诸侯来朝见天子、汇报工作叫由下到上。这个时候他是有来有往的，诸侯朝见天子、陈述自己的职责，他在讲自己都做了什么事情，可是这只是听来的是否属实呢？</span></p><p><span>诸侯的行为是否如他自己所说呢？所以这一切都需要去考察和验证，故而就有了天子巡狩。</span><span>这个时候从上而下，是去看一看他到底都做了哪些事情，跟他自己所陈述的是否一致呢？我们看现在也是如此，上下相通的。</span></p><p><span>比如说作为下属，你要去陈述自己的职责，你都做了哪些事情，作为上级的领导，他是要去视察的，去看一看你到底都做了什么？是否如你自己所说，是否你做好了自己的本职工作，这一切我们总结成一句话。</span></p><p><strong><span>无非事者。</span></strong><span>这一切都是与工作相关的事情，无非是工作好。我们这个时候再来讲何为观天下，并不是让你出去游玩，而是去看一看下面的诸侯，都在做些什么事情？有没有爱护自己的百姓。</span></p><p><span>那么诸侯去朝见天子，也是如此。你要去陈述自己的职责，你都做了哪些事情？你到底为百姓做了什么？当你陈述以后，以待天子来查看你的工作，来视察你的工作，所以叫无非事者。</span><span>晏子给出了一个概念，做的这一切都是工作，既然是工作，那么巡视之时到底看一些什么？</span></p><p><strong><span>春省耕而补不足。</span></strong><span>以前在古代，最重视的是农业，所以到了春天的时候，在你巡视的过程看什么呢？去看耕种的百姓有没有不足的地方，你要去提供帮助。比如说，看看百姓的种子够不够，耕种的器具够不够，水利是否方便，诸侯是否有占用百姓耕种的农时呢？所以叫春省耕而补不足。</span></p><p><strong><span>秋省敛而助不给。</span></strong><span>敛指的是收成，到了秋天你要巡视百姓的收成，如果你发现有的百姓收成不好，助不给，去给他一些帮助，救济穷人。所以我们可以看到一个天子，他在观天下，也是在工作，是在观百姓的疾苦。</span></p><p><span>到了春天，看看他是否在耕种方面有什么不足和需要帮助的？到了秋天去看百姓的收成，是否有不足的？你要去给他提供帮助，救济百姓，让他可以解决温饱。</span></p></div>"
},{
    "title": "《孟子》梁惠王下④-3 流连忘反",
    "author": "虚空先生",
    "date": "2022-07-22",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》38梁惠王下④-3流连忘反</strong></span></p><p><strong><span>夏谚曰：“吾王不游，吾何以休？吾王不豫，吾何以助？一游一豫，为诸侯度。”今也不然。师行而粮食，饥者弗食，劳者弗息；睊睊胥谗，民乃作慝。方命虐民，饮食若流；流连荒亡，为诸侯忧。从流下而忘反，谓之流；从流上而忘反 谓之连；从兽无厌，谓之荒；乐酒无厌，谓之亡。先王无流连之乐，荒亡之行。惟君所行也。</span></strong></p><p><strong><span>夏谚曰：吾王不游，吾何以休？</span></strong><span>夏朝的谚语有云，谚语也就是民间百姓之间所流传的话。说如果我们的王，我们的天子不出来巡游，我们怎么可以得到休息呢？我们看这句话讲得好，百姓是期盼天子君上出游的，为什么？</span></p><p><span>因为君王在出游之时，可以看到百姓的需求，可以看到民间的疾苦，所以叫吾王不游，吾何以休？天子在出游之时看到百姓需要帮助，这个时候他们是得以休息的，得以休养的。</span></p><p><span>可是如果作为天子，看不到百姓的疾苦，他们就需要一直去耕种，一直去劳作，甚至有可能耕种和劳作，也没有办法过上温饱的生活，所以如何去休息和休养？</span></p><p><strong><span>吾王不豫，吾何以助？</span></strong><span>豫是走动，如果大王不出来走动走动，我们怎么能得到帮助呢？</span></p><p><strong><span>一游一豫，为诸侯度。</span></strong><span>说天子走动之间，作为诸侯的榜样。我们再来看，夏朝的这一段谚语，</span><span>百姓是非常希望天子可以出游的。因为他可以看到民间的疾苦，看到百姓的需求，给百姓提供帮助。所以天子在出游之时，不光可以给百姓提供帮助，还可以成为诸侯的榜样。</span></p><p><span>诸侯看到天子是如此的做事情，是如此在意百姓的生活疾苦，给百姓提供帮助，那么诸侯自然会去效仿。我们再，晏子之所以赞叹齐景公的问题，说他善哉问也。这个问题问得真好。</span></p><p><span>因为齐景公想要去观这两座山，去问如何才能比得上先王。晏子告诉他先王，他是在观天下的疾苦，是在看百姓的需求，他出去也是为了尽天子之责。无非事者，出去是为了做事情的，</span></p><p><span>所以在告诉齐景公，你出去观之时，出去游走之时，要想比得上先王，你去看百姓的疾苦，给百姓提供帮助。成为齐国其他士大夫的榜样，你要去做出表率。</span></p><p><span>如果作为齐国的君主，齐景公他是爱护百姓的，在意百姓的生活，自然其他的大夫也会遵循着这个原则，他们也会去在乎百姓，去看百姓的收成如何？这个时候才是真正的为百姓去着想，这是先王所做的事情，同时引用了夏朝的谚语。</span></p><p><span>夏朝的百姓是期盼他们的天子可以出游的，然而今天的现状还是那个样子吗？百姓还期盼君上可以出游吗？那么接下来，晏子讲的是今天的现状和古之先王，形成了鲜明的对比。</span></p><p><strong><span>今也不然，师行而粮食。</span></strong><span>今天却不是这个样子，晏子指出了现如今的情况。现如今包含了春秋，这个时候的周天子，当然也包含了所有的诸侯，包含了齐景公在内，今天的现状是什么呢？</span></p><p><span>师行而粮食，师指的是出行的队伍。我们可以想象得到无论是天子或者是诸侯出行，他都有一个庞大的队伍，这个队伍称之为师。</span></p><p><span>师行而粮食，出游的队伍是很庞大的，这个时候需要征集粮食，也就是出游之时不是在付出，</span><span>不是在帮助百姓。而还要不停地征集粮食，为这支庞大的出行的队伍在做着准备的事情。</span></p><p><strong><span>饥者弗食，劳者弗息。</span></strong><span>饥饿的人没有饭吃，劳累的人得不到休息。</span></p><p><strong><span>睊睊胥谗，民乃作慝。</span></strong><span>睊睊指的是斜视，斜着眼睛看。我们去想一想在什么心态下人们会斜视？会斜着眼睛看，也就是看不惯的时候，看不上心里有怨言就会斜视。胥指的是互相，谗指的是抱怨攻击。</span></p><p><span>我们再来看看这句话，百姓们都在斜视，并且互相抱怨。抱怨什么呢？都是攻击性的语言，</span><span>说出行的人有多么不好，为什么说他不好呢？因为今天出行的君主不再像古之先王。他是给百姓提供帮助的，所以百姓都在期盼着王上可以出游。</span></p><p><span>这个时候，他们可以得到休养，可以得到帮助，而今天不光无法给百姓提供帮助，而且还要劳民伤财。你还要征集大量的粮食，很多人会因此而吃不上饭，很多人会因此而得不到休息，在这种情况下，百姓自然就是怨言的。</span></p><p><span>所以大家都是在斜视，并且互相抱怨，暗地里攻击君王，民乃作慝，这里的慝指的是错误。</span><span>为非作歹，所以百姓也会趁机做一些不好的事情。也就是严重了讲，这个时候君主的出行，会给民间带来很多的抱怨，甚至是动乱。</span></p><p><strong><span>方命虐民，饮食若流。</span></strong><span>方指的是违背，命指的是天命，使命，违背了自己的天命，虐待百姓。</span></p><p><span>饮食若流。</span><span>饮食像流水一样，这里指的是浪费食物，以前的先王他是心中怀着百姓的，所以出游天下是为了帮助百姓。而现在的君主是重享乐的，所以出门要有庞大的队伍，并且要征集粮食。</span></p><p><span>沿途要有官员去接待，这个时候他们是违背了自己的天命，给百姓带来了很多的抱怨，同时重享乐，所以就会浪费很多食物。</span></p><p><strong><span>流连荒亡，为诸侯忧。</span></strong><span>给诸侯带来了很多的忧患和忧愁，我们可以想象的到如今的现状，天子出游，诸侯是觉得忧患，觉得很忧愁的事情。同样如果是诸侯出游呢？每个地方接待的官员会觉得这是一种忧患，何为流连荒亡，我们看有具体的解释。</span></p><p><span>从流下而忘反，谓之流。从上到下，但是却忘了返回，这个称之为流。</span></p><p><span>从流上而忘反 谓之连。我们看这句话很熟悉，我们经常讲的成语流连忘返，也就是玩的高兴却忘记了返回。如果放在这里，我们可以看得到，如果一位天子流连忘返，不想返回。你是要给百姓带去重大的负担的。</span></p><p><span>如果一个诸侯流连忘返，你会给百姓同样带去重大的负担。那我们来以此延伸到生活当中</span><span>也是一样，比如说当你出去玩乐，如果你自己一个人还好，可是如果很多人跟着你，你是流连忘返的，是不是会给别人带去很多的负担和压力呢？</span></p><p><span>如果你是流连忘返的，给你的亲人和朋友的招待上，带去很大的压力呢？所以这里无论从天子也好，到我们一个平常百姓，告诉我们都要有仁德之心，你都要懂得为他人去考虑。作为一个处上位的人，就更要懂得为他人去考虑。</span></p><p><span>因为你的流连忘返，会去给很多人带来影响和忧愁，即使我们一个人也是如此。所以我们可以看到，生活当中有的人去了外地，不需要朋友给那么多的招待，不需要亲人给那么多的招待，就是不想让别人有太多的负担和压力。</span></p><p><strong><span>从兽无厌，谓之荒，乐酒无厌，谓之亡。</span></strong><span>从兽指的是打猎，打猎却不厌倦，永不满足，谓之荒。乐酒无厌，饮酒作乐却不厌倦，不知道满足，谓之亡。我们再看流连荒亡，指的是吃喝玩乐，不厌倦，不满足。我们再来看流连荒亡，为诸侯忧，如果一个天子吃喝玩乐不厌倦</span></p><p><span>不满足，这个时候就会给诸侯带来忧愁忧患。</span></p><p><span>那么一个诸侯也是如此，如果流连荒亡不厌倦，不满足，就会给其他的官员带来忧愁，带来忧患。那我们一个人也是如此，如果我们总是吃喝玩乐，不厌倦，不满足，就会给我们身边的亲人朋友，给我们的家庭带来忧愁，带来忧患。</span></p><p><strong><span>先王无流连之乐，荒亡之行。</span></strong><span>古之先王是不会注重吃喝玩乐，不厌倦这些事情的。</span></p><p><strong><span>惟君所行也。</span></strong><span>这句话晏子是讲给齐景公的，是希望齐景公也可以做到这样的行为，我们再来看整个这段对话，齐景公去问晏子，如何才能比得上先王之观？晏子告诉齐景公，以前的天子出游是为了帮助百姓的，查看民间的疾苦，同时没有这些享乐的事情在其中。</span></p><p><span>他出去也是为了做事情的，心怀天下。所以只要景公您不要重享乐，你的目的不同，行为自然就不同。如果出行是为了享乐，自然会给百姓带去很多的负担，你会注重吃喝玩乐。</span></p><p><span>可是如果你出行的目的，是为了帮助百姓的，你自然不会注重吃喝玩乐。而是想着如何给他们提供帮助，所以最后讲，惟君所行也，告诉景公只要你这样就可以效法先王。</span></p></div>"
},{
    "title": "《孟子》梁惠王下④-4 君臣之乐",
    "author": "虚空先生",
    "date": "2022-07-22",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下④-4君臣之乐</strong></span></p><p><strong><span>“景公说，大戒于国，出舍于郊。于是始兴发，补不足。召大师，曰：‘为我作君臣相说之乐。’盖《徵招》、《角招》是也。其《诗》曰：‘畜君何尤！’畜君者，好君也。”</span></strong></p><p><span>上一讲，我们学习到景公与晏子之间的对话。景公想要出游，但是却问了晏子一个问题，我如何做才能比得上先王？我们这里可以聊一下，景公和晏子之间的关系。两个人是君臣关系， 但是彼此成就，又是亦师亦友的关系。</span></p><p><span>并且景公和晏子之间的故事，在历史上也算是一段佳话。他们之间发生了很多的故事。有一次景公去树上掏鸟，但是发现鸟窝之中的鸟很小，他就把小鸟又放了回去。晏子听说了这件事情，正在赶来的路上，这个时候景公吓坏了，他非常的害怕。</span></p><p><span>因为他一旦有不当的行为，有失君主的行为，晏子都是要批评他的。故而说，他们之间亦师亦友。后来晏子来到并没有批评景公，反而赞扬了景公，说景公您是非常有仁德的，是有慈爱之心的，看到鸟很小又把它放了回去，这就是您的仁慈之心。</span></p><p><span>以此来鼓励景公，要爱护百姓。我们可以看到晏子，但凡找到合适的机会，找到一件事情，都会给景公指出一些问题，或者加以鼓励，让他做好为君之责。</span></p><p><span>还有一次，连续下了三天的大雪，这个时候景公对着晏子感叹，说下了这么长时间的雪，并不冷。这个时候，晏子又找到了合适的机会，他对景公讲说，您看看您现在穿的是什么样的衣服，言下之意在讲什么呢？</span></p><p><span>百姓们并没有这么好的衣服穿，他们也并没有这么好的生存环境，不是您觉得不冷就可以了，</span><span>你可否看到百姓，他是否是冷的呢？那又在告诉景公，当你穿得很暖的时候，你要去看百姓是否在受冻？当你吃得很饱的时候，你要看百姓是否在挨饿。当你很闲适的时候，你要想到百姓他们还在劳作。</span></p><p><span>所以不能只看自己过得舒服，就可以了，正如这一次也是一样的。景公想问晏子，我如何才能比得上先王？那么晏子又一次找到了机会，对景公去教化。他说先王之所以被后人赞叹，是因为他在出游的过程当中，并没有去劳民伤财，也并没有想着自己游乐，却是去观天下之事。</span></p><p><span>看看百姓还缺少什么，到了春天，是否缺少耕种的土地和种子呢？到了秋天他们的收成如何？是否可以解决温饱问题呢？看看还有其他的哪里有不足，要给百姓提供帮助。</span></p><p><span>那么景公您如果想要比得上先王，你也要做这些事情。言下之意告诉景公，您的出游不能是游玩的，不能是享乐的，不能是流连荒亡的，你的出去要想着帮助百姓，如何给百姓给予更多，这个时候你才能比得上先王。</span></p><p><span>通过晏子对景公的每一次的教导，我们可以看到彼此的关系，亦师亦友。同时景公也是一位贤明之君，如果景公没有办法听得进去晏子的谏言，晏子再贤德，又有什么样的用处呢？我们看看关于晏子这一段，拿先王来作比较，景公听了之后，他是什么样的反应呢？</span></p><p><strong><span>景公说，大戒于国，出舍于郊。</span></strong><span>说表示景公非常的开心，非常的高兴。他是从内在的开心，因为他听得进去晏子所讲的话，他不光听进去晏子讲的话，并且身体力行的去做。</span></p><p><span>大戒于国，出舍于郊。这里讲的戒不是戒令的戒，大戒是指的誓师。当有重要的活动之前</span><span>要有誓师的，那么誓师是在讲这一次活动的主旨，要有哪些戒令，要注意什么样的事项，这就好比是，我们现在要做一件重大的事情之前，要开会，讲一些注意事项，以及准备工作。</span></p><p><span>在誓师的会上，景公就做了很多戒令；比如说不可以流连荒亡，不可以打扰百姓，不可以劳民伤财，并且出舍于郊。这里的舍指的是雪宫，因为齐宣王问孟子，贤者亦有此乐乎？是在雪宫，那么孟子引用晏子和齐景公之间的故事，也是在雪宫。</span></p><p><span>这里出舍于郊，景公在听了晏子的话以后，就不在雪宫居住了。驻扎在郊外，为何要驻扎在郊外？因为当你驻扎在郊外，你才能看到百姓当下的生活，你才能听到百姓的声音，你才能看到百姓的不足。</span></p><p><span>如果你是住在自己的宫殿，住在雪宫之中的，那你要如何听到百姓的声音呢？你怎么能看到</span><span>百姓生活的现状。</span></p><p><strong><span>于是始兴发，补不足。</span></strong><span>于是就开始开仓放粮，开始帮助百姓了，并且看到百姓还缺少什么？</span><span>还有哪里不足的？给提供一些帮助，同时景公又做了一件事情，表达自己当下的心情。</span></p><p><strong><span>召大师，曰：为我作君臣相说之乐。</span></strong><span>我们可以看到景公现在的心情，他是非常开心的。所以又召见了大师，大师是乐官之长，叫大师来作乐，作什么样的乐？做君臣相说之乐，君指的是他自己，臣指的是晏子，他是和谐的，和美的状态。</span></p><p><span>君主是可以听得进去贤臣的谏言，贤臣是敢于进谏于君主的。敢于指正君主身上的不足和错误，我们看景公的行为，他是在推广这件事情，可以让更多的人知道，去效仿晏子。</span></p><p><span>君主身上有不足有错误，作为贤臣、忠臣你是可以指出来的，并且如果你讲的是正确的，那么作为君主的也一定会去听从，会去改变自己。所以我们看景公的心情大好，第一表现了这种和谐的状态，第二又赞同并且推广了晏子的这种行为。</span></p><p><strong><span>盖《徵招》、《角招》是也。</span></strong><span>这里君臣相说之乐，指的就是《徵招》和《角招》。《徵招》和《角招》它是古词牌的名字，但是现在已经失传。</span></p><p><span>内容我们不得而知，但是放在这里，我们可以知道这两首词牌，它主旨就是君臣相说之乐。它所表现的君臣之间的这种和谐共处，君臣之间可以互相指证，可以亦师亦友。</span></p><p><strong><span>其《诗》曰：畜君何尤！</span></strong><span>这里的诗不是指的《诗经》，是指的《徵招》和《角招》当中的一句。</span></p><p><span>这一句其中包含了这四个字，畜君何尤！何为畜？当君主身上有过错，或者行为不当之时，你可以去劝谏制止他的行为，而这种行为，就称之为畜。畜君何尤！当你去劝谏，制止君主身上的不正当的行为，又有什么过错呢？</span></p><p><strong><span>畜君者，好君也。</span></strong><span>可以去制止君主身上的错误，这是爱护君主的表现。因为他爱护自己的君主，不想让他犯更多的错误，做不好君主的职责，所以才去畜君。我们现在整个再来看第四段。</span></p><p><span>首先发生了齐宣王和孟子之间，在雪宫的对话，齐宣王问孟子，贤者亦有此乐乎？说贤者</span><span>也会有当下的这些快乐吗？孟子讲，有啊。贤者是有这样的快乐的。你也可以这样去享乐，</span><span>但是你要做好自己分内之事，做好自己的本职工作，这是第一个阶段的对话。</span></p><p><span>但到了第二阶段的对话，话锋一转，说曾经齐景公和晏子在这里也发生了一件事情，景公想要去观天下，想要出游，但是却问了一个问题，如何做才能比得上先王？这个时候晏子讲了</span><span>先王哪有自己的享乐，他想的都是百姓。</span></p><p><span>即使是出游也是在体察民间的疾苦，也是在看百姓的不足，可以提供给百姓一些帮助。我们再看第二个阶段，孟子想要引用景公和晏子之间的对话，告诉齐宣王真正的贤者，怎么会想着自己去享乐。</span></p><p><span>我们举几个例子，比如说我们经常提到的周公一沐三捉发，一饭三吐哺。他会有自己的享乐吗？他会有那样的心情吗？</span></p><p><span>连吃一顿饭都数次的要把它吐出来，连洗澡的时候都有人去打扰，他都要接纳贤才，头发都要分几次来洗的，形容的是周公的忙碌，和他招纳贤才的这种决心。哪怕自己吃饭吃数次，也不能错过贤德之人，也要忙于政事。</span></p><p><span>那我们历史上有鞠躬尽瘁，死而后已的诸葛亮；我们近了讲有我们伟大的周总理，日理万机。我们去看这些贤者，这些伟大的人，这些心怀天下百姓的人，怎么会有自己的享乐呢？所以我们看晏子在对景公的劝谏，景公是听从的。</span></p><p><span>他放弃了自己的游玩，离开了雪宫，驻扎在郊外，去给百姓开仓放粮，去补给百姓的不足，</span><span>这才是一个贤君该做的事情。那么言外之意，也是在告诉齐宣王，你怎么还有如此的想法？还有享乐之心，这说明你不是一个贤德之君，也不是一个贤者。</span></p><p><span>古之贤者，没有想着自己如何享乐的，都是看百姓所需。就像晏子和齐景公之间的对话，当你吃饱了，你要想到你的百姓还在挨饿；当你穿暖了，你要想到你的百姓还在受冻；当你在享乐，当你在闲着的时候，你要想到百姓还在劳作，甚至他们辛苦的劳作，还不足以让他们活下去。</span></p><p><span>路上还有饿死的尸体，你怎么还能有这种享乐？所以我们可以看到孟子的这种仁慈之心，同时孟子讲话的这种智慧，他是有次第在其中的。首先告诉齐宣王，贤者是可以享乐的，但是你要做好自己的本职工作，那么进而开始，又引用在齐国发生的事情。</span></p><p><span>齐景公和晏子用来说明，景公曾经也有这样的问题，也想自己享乐和出游，但是被晏子制止了。而景公也听从了晏子的话，不再去出游，不再去享乐，而是改变自己的行为。去开仓放粮补不足，并且景公因此而喜悦。</span></p><p><span>这种喜悦，他不是出去自己享乐的喜悦，而是帮助了百姓，看到那么多百姓因为你改变了想法，而得到帮助，这种内在的喜悦。</span></p><p><span>所以召见大师，作君臣相说之乐。以此来赞赏晏子这种行为与推广，这种行为希望更多的人可以去效仿，所以我们看整个一段，重点就告诉我们真正的贤者，你不会有那么多时间和心情，自己去享乐，你要看看那么多还在受苦的人。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑤-1 王者之堂",
    "author": "虚空先生",
    "date": "2022-07-18",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑤-1 王者之堂</strong></span></p><p><span><strong>齐宣王问曰：“人皆谓我毁明堂。毁诸？已乎？”孟子对曰：“夫明堂者，王者之堂也；王欲行王政，则勿毁之矣。”</strong></span></p><p><span>《孟子》我们学习到现在，可以看到孟子无论何时何地，无论发生什么事情都在讲王道；也就是如何去保民，如何去实行仁政，如何与民同乐。</span></p><p><span>我们去回顾孟子与齐宣王之间的所有对话。孟子问齐宣王是否好乐，齐宣王讲是的，自己喜好音乐。那么孟子就从好乐这件事情上讲到仁政，齐宣王又问孟子说：‘文王的猎场有七十里’，这件事情是真实的吗？孟子讲是的。</span></p><p><span>文王虽有七十里的园林猎场，但是他与民同乐与民共享，所以百姓并不觉得他的园林大。而齐宣王有猎场四十里，百姓却觉得很大。因为他是不对民众开放的，是自己享乐的，相当于在齐国的郊外，做了一个陷阱，随时是要陷害百姓的。</span></p><p><span>齐宣王又问道：交邻国有道乎？与邻国相交有什么样的方法吗？孟子又讲到了，与邻国相交当然是有道的，要以大事小，这是仁者才可以做到的。要以小事大，这是智者才可以做到的。</span></p><p><span>齐宣王又在雪宫这个地方，召见了孟子，又问到贤者亦有此乐乎？贤者也有享乐的时候吗？孟子讲有的。但是贤者要做好自己分内之事，进而又举例子，讲了齐景公与晏子之间的故事。</span></p><p><span>真正的贤者怎么会去享乐呢？当自己吃得很好，你要想到那些没有吃饱饭的民众。当自己穿得很好，你要想到那些还在受冻的百姓。当你自己在闲适在享乐之时，你要想到那些还在劳作的人民。所以真正的贤者，怎么会顾着自己的享乐。</span></p><p><span>我们可以看到孟子的思维方式，无论齐宣王问什么问题，无论讲到什么事情，最后都有一个主旨是不变的，也就是如何实行王道，如何才能保民。我们可以感受到孟子的这种仁爱之心，他把所有的百姓放在心里。</span></p><p><span>周游列国二十年，不停地去宣讲仁者无敌。告诉所有的君王，所有的大夫，一定要保民。从保民的角度去思考问题，去修正自己的行为。我们接下来看齐宣王问孟子的问题，孟子又要如何作答，如何去讲王道与仁政呢？</span></p><p><span><strong>齐宣王问曰：人皆谓我毁明堂。毁诸？已乎？</strong>别人都劝说我要拆毁明堂，毁诸是毁掉呢？还是不要毁掉呢？我们先讲什么是明堂，明堂在齐国境内，但是却是周天子召见诸侯的宫殿，称之为明堂。</span></p><p><span>以前周天子走到齐国这个地方，召见齐国的诸侯或者在这个地方，召见其他的诸侯，这样一个场所，称之为明堂。但是我们知道在齐宣王已经是战国时期，周天子早已经失威，已经没有了这些先王的德行，也没有那么大的威慑力。所以这个时候，天下诸侯已经开始称雄、称王。</span></p><p><span>在齐景公那个时候，春秋还称之为公。到战国这个时候，齐宣王都已经称王。早已不把周天子放在眼里，在这种情况下，就有很多人建议齐宣王，要拆毁明堂了。所以齐宣王就问了这个问题，问孟子说，明堂我是要拆还是不拆？</span></p><p><span>首先这里我们先来做一个延伸，拆与不拆，我们到底用什么去衡量？比如说，我们在生活当中遇到了一件事情，我们到底该如何去衡量？举个例子，说找个工作离家近的可能工资低、少一点，离家远的可能工资高一点，但是路上需要耽误更多的时间，可能影响我照顾家庭，照顾孩子，这个时候我们到底该如何抉择呢？</span></p><p><span>这里我们去分享一个小的方法，我们去思考这件事情什么不重要？举个例子，说赚的多与少不重要，我们当然就选一个离家近的。比如说，这个阶段对于是否能照顾家庭不重要，我们自然就选个赚钱多一点的。</span></p><p><span>我们在生活当中，遇到其他事情也如此，当我们不能抉择的时候，去想一想什么不重要，去掉不重要的结果，自然也就懂得如何去选择，如何去选择，就是我们的价值观，我们的价值体系。</span></p><p><span>举个例子，一个人如果是有德行的，你就会用德行去衡量一件事情，如果一个人是重礼节的，你就会用礼去衡量一件事情。如果一个人是重情重义的，那么情义就是你恒定一件事情的标准和价值观。所以在生活当中，但凡我们遇到事情，看看自己的价值观是什么？</span></p><p><span>我们学习《论语》讲君子喻于义，小人喻于利。一个君子做事情的衡量标准，是以义为出发点，而一个不懂得修身的称之为小人，他的出发点是以利为衡量标准。我们看对于拆毁明堂这件事情，孟子的价值观和恒定的标准是什么？</span></p><p><span><strong>孟子对曰：夫明堂者，王者之堂也。</strong>首先给明堂赋予了意义。这个明堂它只不过是一个宫殿，但是却是王者之堂也，因为以前这是周天子召见诸侯的地方。虽然现在周天子衰微，已经没有了德行和号召力，但是他的先王是有德行的，这种德行延绵子孙，明堂还有它的意义和价值所在。</span></p><p><span><strong>王欲行王政，则勿毁之矣。</strong>说齐宣王如果您想实行王政，则不能拆毁，为什么呢？你去想实行王政，内在一定是有仁的。你的行为一定是有德的，一定是守礼的。做事情合乎义的，否则你就没有办法称王于天下。</span></p><p><span>如果你内在有仁，行为有德，就注重礼。你怎么能去拆毁这样一座明堂呢？当你去做出拆毁明堂的行为，首先就不合礼，内在不合乎仁，行为不合乎于德。</span></p><p><span>既然齐宣王都不注重礼，都做违礼的事情，那大臣们岂不是争相效法吗？他会效仿于你的行为，你要如何推行王政，你要如何去推行礼仪呢？你内在的仁德在哪里？所以我们看拆不拆毁明堂，看你自己内在的价值观，看你衡量的标准。</span></p><p><span>当我们学习了孔孟之道，我们就懂得约束自己的行为，用什么来约束？就是我们内在的价值体系。比如说一个人重礼，就不需要别人去约束，做每件事情都会合乎礼，都会合乎规矩。</span></p><p><span>如果当我们内心有仁爱之心，就不需要任何人对我们有要求，我们的那颗仁爱之心，就是自己约束和恒定的标准。做一件事情该不该做，问我们自己的仁爱之心。</span></p><p><span>如果一个人是有德行的，我们的价值体系和衡量标准就是一个德字。这件事情我该不该做，我看看他合不合乎于德，如果合乎于德，我就去做，如果这件事情是失德的，我一定不去做。</span></p><p><span>我们通过这段对话，可以看到孟子的价值体系。为什么不能拆毁明堂呢？如果你想实行王道，推行王政，你就不能去拆毁，你不能去破坏仁、不能破坏德、不能破坏义、不能破坏礼。我们在生活当中，即使是一件小事情也是如此。</span></p><p><span>我们走在路上，是否随手扔垃圾，看看自己是否重礼，是否有仁爱之心。如果是重礼的，又怎么会随手扔垃圾呢？如果是有仁爱之心的，我们要知道扔的垃圾，会给别人带来麻烦和烦恼，这个时候你自然就不会去做，这就是你的衡量标准。</span></p><p><span>我们在一个企业当中工作，要不要尽心尽力，这就看自己内在的价值体系。如果我们是重仁的、重礼的、重忠义的、自然会尽心而为，尽心尽力的去做事情。</span></p><p><span>我们去做一个生意，到底要不要给顾客提供更好的服务呢？开一个饭店要不要提供更干净卫生可口的饭菜，看自己的价值体系了。如果是重利的，自然偷工减料，自然能省则省。可是如果我们要是重义的，要是重仁德的，就不会想着怎么去省，而去想着，如何给他人提供更干净，更可口的饭菜。</span></p><p><span>为什么人要学习文化？我们会自我约束，我们的价值观不允许做伤害别人的事情。我们的价值观不允许我们做失德失礼的事情。可是如果没有学习和教化的人，就会肆无忌惮，为所欲为，只是为了满足自己的私欲，而从不在意那么多他人的感受。</span></p><p><span>孟子讲仁政，是告诉每个君王要有仁爱之心，你去看看还有那么多受苦的百姓，你怎么能自己独自享乐呢？所以能约束一个君王的是你自己内在的仁德，外在的礼仪，并不是他人。</span></p><p><span>既然已经成为一国之君，又有谁能约束你，但你要学会自我约束，即使是我们每一个平凡人，也是如此，别人对你的约束能有多少呢？而且也没有办法详尽。但是我们学习修身以后，我们懂得了自我约束，我们知道什么事情该做，什么事情不该做。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑤-2 文王之政",
    "author": "虚空先生",
    "date": "2022-07-18",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》梁惠王下⑤-2文王之政</span></strong></p><p><strong><span>王曰：“王政可得闻与？”对曰：“昔者文王之治岐也，耕者九一，仕者世禄，关市讥而不征，泽梁无禁，罪人不孥。老而无妻曰鳏，老而无夫曰寡，老而无子曰独，幼儿无父曰孤。此四者，天下之穷民而无告者。</span></strong></p><p><strong><span>王曰：王政可得闻与？</span></strong><span>这个时候齐宣王又继续问了，既然孟子说，明堂不可拆，因为你要实行王政，是不能违背仁德和礼义的。那么接下来齐宣王自然要问，您说的王政到底指的是什么？可以说来听一听吗？</span></p><p><strong><span>对曰：昔者文王之治岐也。</span></strong><span>文王指的是周文王。岐指的是岐地。因为当时文王的封地在这个地方，说文王当时治理岐地。</span></p><p><strong><span>耕者九一。</span></strong><span>耕指的是耕种的农民。耕种的农民国家只收取他们的九分之一。那个时候是井田制，我们看一个井字，就把田地分成了九块。其中一块是给国家交税的，其他的都是百姓自己所得，首先讲的利民。</span></p><p><strong><span>仕者世禄。</span></strong><span>仕者指的是为官的，在文王那个时候为官之人，国家会把他们的子女送去学习，</span><span>择优录选。如果学习很好的继续做官，即使是学习不好的，国家管他的吃，也就是还有俸禄。</span></p><p><span>这里的世禄并不是指他要继承父亲的官位，而是要通过自己的学习，如果学习的好自然可以继续为官。即使学习的不好，国家也是给他一些俸禄，解决他生活的问题。讲完了对农民的好处，讲完了对于为官之人的好处，接下来讲到了经商之人。</span></p><p><strong><span>关市讥而不征。</span></strong><span>关指的是关卡，市指的是市场。关卡和市场稽查，但是不征税。为什么要稽查，一定要去查看。比如说你卖的东西是否高于市场的价格，比如说你卖的东西是否货真价实。</span></p><p><span>但是只稽查而不征收税，我们看无论是对百姓，还是对经商之人或是对为官之人，在文王那个时期，都是给他们提供帮助的。</span></p><p><strong><span>泽梁无禁。</span></strong><span>泽梁指的是以前在水中设置的捕鱼的装置。泽梁无禁也就是不禁止捕鱼，我们再把泽梁这个意思延伸出来，比如说包括了砍柴捕鱼，国家是不禁止的。</span></p><p><span>再宽泛一点讲，就是大自然提供的东西，国家是不禁止的，这个是对所有的百姓都有好处的。</span></p><p><span>我们看以上孟子所列举的这几点，既然可以讲给齐宣王听，那就说明当下的政策不是这个样子的。</span></p><p><span>说明耕种的农民，这个时候交的税要高，对于商人也是要征收税的，对于做官之人他的后代是没有保障的，对于普通的民众即使是砍柴和捕鱼，还是有很多禁止的。</span></p><p><span>这个时候就形成了鲜明的对比，其实这几点无非告诉齐宣王一个道理，以前文王所实行的王道，所实行的王政都是对百姓有利的。都是为他人着想的，但是这里我们要再延伸一点，我们不能拿如今的政策和文王那个时候的政策作比较。</span></p><p><span>为什么？时代背景不一样了。我们现在捕鱼不像以前古人捕鱼，现在大量的捕鱼，所以一定是要有禁止的，否则就破坏了生态平衡；现在砍柴伐木跟以前绝不相同，现在都是现代化的工具。</span></p><p><span>农民的耕种，那个时候还要征收九分之一，而现在呢是没有的，不光没有，还要给很多的粮食补助，因为现在的粮食并没有像古人那个时候那么值钱，所以说所有的政策，都在随着时代的变化而变化。</span></p><p><span>但是有一点核心是不变的，他的核心就是如何对当下的人们更有利，如何可以帮助当下的人们生活的更幸福，可以获得更多。所以我们这里总结出来一个观点，无论当下处在什么位置，正在做着什么事情，核心就是为他人去考虑。</span></p><p><span>比如说我们是处上位的，是一个企业的领导，我们要想着如何为员工和顾客去考虑。如果我们是处下位的，作为一个员工，要设身处地的为公司，为客户去着想。如果我们是做儿女的，</span><span>要去为你父母着想。如果我们是做父母的，要懂得为你的子女去着想。那么夫妻关系也是如此。</span></p><p><span>所以什么叫王政？无非是保民，也就是为他人去着想，为他人去付出，这是核心不变的观点。</span><span>至于呈现出来的形式和状态，它会随着时代的变化而变化，它会随着事情的发展而变化。</span></p><p><strong><span>罪人不孥。</span></strong><span>罪人指的是犯罪之人，孥指的是妻儿。有人犯罪但是不牵连妻儿。</span></p><p><strong><span>老而无妻曰鳏，老而无夫曰寡，老而无子曰独，幼儿无父曰孤。</span></strong><span>这里讲了四种人，说到了老年没有妻子的称之为鳏；老年没有丈夫的称之为寡；老年没有儿子的称之为独；幼年没有父亲的称之为孤，也是我们现在讲的孤儿、寡妇、失独。</span></p><p><strong><span>此四者，天下之穷民而无告者。</span></strong><span>穷民就指的可怜和困苦之人，无告者指的是无所依靠。这里说这四种人非常的可怜困苦，他们是没有所依靠的。当没有所依靠的时候怎么办？那么国家要给他们一些依靠和帮助。</span></p><p><span>到了我们今天也是如此，比如说国家会照顾这四种人，会给他一些生活上的支持，发一些钱财，对于医疗等其他方面，也是有所优惠和照顾的，所以这就是王政，不停地在想着如何帮助更多的百姓。</span></p><p><span>耕种的农民我们要对他有所帮助；为官之人要对他有所帮助；经商之人要对他有所帮助；对所有的百姓要提供方便；对于这些孤寡之人，要给他格外的照顾和扶持。</span><span>文王发政施仁，必先斯四者。说文王发行的政令，首先是要先帮助孤寡这四种人。</span></p><p><span>《诗》云：哿矣富人，哀此茕独。这两句诗引用于《诗经·小雅》当中的《正月》，《正月》是一位大夫所作，这位大夫是痛指周幽王的过错。因为周幽王无道，烽火戏诸侯导致西周灭亡。</span></p><p><span>这个时候东周开始，也就是春秋时期开始了。所以这位大夫指出了，周幽王做过的一些不当的行为，但更重要的是深深地感叹和忧虑重重，他看到了百姓民不聊生，生活在痛苦当中，所以作了这首诗经。</span></p><p><span>而《诗经》的最后两句，也就是孟子引用的这两句，哿矣富人，哀此茕独。说富人过得还不错，可是那些茕独可怜之人，过得却非常的不好。我们去想为什么孟子在这里要引用《诗经》的这两句呢？</span></p><p><span>因为齐宣王治下的齐国现状就是如此，大夫们或者齐国那些富人，都过得很好。可是那些茕独之人，那些孤寡之人过得并不好，挨饿受冻，甚至路上还有很多的死尸，所以我们看孟子讲话的智慧。</span></p><p><span>首先讲了文王那个时候是什么样子的，对于耕种者；对于为官之人；对于经商之人；对于孤寡之人；都是有很多照顾的，去发施仁政。可是今天的现状孟子引用了《诗经》当中的两句来暗喻，说富人过得不错，但是穷人孤寡之人过得很不好。我们看齐宣王听到这番话，作何反应。</span></p><p><span>王曰：善哉言乎！齐宣王讲说的好啊！我们一听孟子所讲的，文王实行的仁政，天下百姓可以得到帮助和照顾，我们听上去当然都觉得是好的。讲到文王那个时期，讲到其他的圣明君主治下的百姓，过着幸福的生活，我们也觉得可是听上去，只有好就可以了吗？</span></p><p><span>正如齐宣王听上去很好，可是自己是否有真的去做呢？是否有真的去实行仁政呢？这个就像平时的我们听《论语》，听《孟子》，觉得君子之风真的好，内在有仁爱之心、行为上有德、</span><span>做事情有分寸、讲礼、重情、重义、有担当、有理想、有热血，我们也觉得好啊。善哉言乎，</span><span>可是真好之后呢？</span></p><p><span>曰：王如善之则何为不行。孟子说了，大王既然您觉得好，可是您为什么不去做，为什么您的行为没有改变，为什么您没有去实行王政？没有去想着如何帮助百姓，为什么没有去照顾那些孤苦之人呢？</span></p><p><span>我们看孟子的这句话，如果是处上位的对处下位的人来讲，这句话是很重的。好比是一个领导去问一个员工，你也觉得好，可你为什么不去做，你的行为为什么没有去改变？</span></p><p><span>可是在孟子和齐宣王之间，是下位对上位的人来讲，想一想我们在生活当中，如果被处上位的人问到，</span><span>你觉得好，为什么不去做？</span></p><p><span>如果被处下位的人问到，您觉得很好，你为什么没有去做？在这种情况下，是不是通常我们都会去找借口和理由，比如说当下的环境不允许，当下我有什么样的毛病和问题，我做不到。</span><span>我等等再去做，没有合适的人给我去引领，我们会去找诸多的理由和借口。</span></p><p><span>我们接下来，去看齐宣王也是如此，我们看看他会找些什么样的借口呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑤-3 齐宣王好货",
    "author": "虚空先生",
    "date": "2022-07-19",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》42梁惠王下⑤-3齐宣王好货</strong></span></p><p><span><strong>王曰：“寡人有疾，寡人好货。”对曰：“昔者公刘好货。《诗》云：‘乃积乃仓，乃裹糇粮，于橐于囊，思戢用光。弓矢斯张，干戈戚扬，爰方启行。’故居者有积仓，行者有裹囊也，然后可以‘爰方启行’。王如好货，与百姓同之，于王何有？”</strong></span></p><p><span>我们来回顾上一讲的内容，齐宣王问孟子想要拆毁明堂，该拆还是不该拆。这个时候孟子借着拆明堂这件事情，给齐宣王讲了王政如何去实行。王政无非是保民，如何爱民如子，为百姓去着想。列举了昔者文王的例子，是如何为百姓着想的。</span></p><p><span>当听到过去文王所做的事情，齐宣王说讲得好。那么作为君主，听到了孟子这段话自然是欣喜的赞同的，所以他去赞叹孟子讲得好。天下百姓都来归服，百姓安居乐业，拥戴君主自然是好的场景。</span></p><p><span>这个时候孟子反问齐宣王，既然是好的，为什么没有去做？从这里我们先来做一个思考，做一个延伸，当我们听到一段话会觉得很好，但是觉得很好，却有几种不同的表现。</span></p><p><span>首先第一种表现，对方讲得很好，但是我们沉默不语，不回答。这说明我们内在是对抗的，是抗拒的，不想做出任何地改变。</span></p><p><span>还有第二种情况，我们觉得讲得很好。但是我们却转移话题，顾左右而言他。这个时候说明我们并不想真的去改变，所以我们觉得好，好，很敷衍。</span></p><p><span>那么还有第三种情况，当我们听到对方说得很好，但是表情很庄重。这个时候说明我们是很武断的。虽然觉得对方说得很好，我们依然会按照自己的想法，打定了自己的主意。</span></p><p><span>所以以上这三种情况，我们去体会一下，在生活当中是很常见的。比如说我们听到一个人</span><span>讲的话，我们觉得他是正确的，但是沉默不语。说明我们内心是对抗的，第二种情况我们觉得好，好，我知道了。这个时候我们开始要转移话题，想要聊其他的内容，就说明我们自己的内在并不想去改变。</span></p><p><span>还有第三种情况，对方说完了以后，我们的表情是很庄重的。这说明我们自有自己的打算，</span><span>自有自己的主意，我们是不会听从对方的建议和指点的。</span></p><p><span>我们知道了这三种情况，当我们与人交流的时候，也是如此。我们看到别人这三种不同的反应，我们就知道他接下来的行为会变成什么样子。我们再看齐宣王，显然这三种情况都不符合齐宣王。</span></p><p><span>那么还有第四种情况，会赞叹说讲得真好，讲得真对。但是接下来，这个但是就要不停地找各种借口和理由，告诉对方我是做不到的。我们举个例子，有人跟我们讲要以仁德去管理企业，要用德行去对待每一个人。</span></p><p><span>我们觉得好，觉得说的对，但是我好像没有那么大的德行；但是我这个人好像有什么样的毛病；但是我对别人好，别人不认同，不回报给我怎么办？这个时候说明我们是认同的，但是我们会给自己找很多的借口和理由，以证明自己没有办法做到，没有办法去实行。</span></p><p><span>同时这个时候说明我们在找借口和理由，在心里对对方还是尊重的。因为齐宣王对孟子还是尊重的，所以才会找很多的理由和借口，同时他自己并不想真的改变。想一想我们在生活当中是不是如此，别人对我们讲了一段话，我们去找理由和借口，说明我们还是在意和尊重对方的。</span></p><p><span>如果不在意和不尊重对方，就选择沉默不语，选择无声的对抗。或者选择敷衍和表情庄重，用自己武断的方式，自己的主意去解决问题。我们接下来去看，齐宣王到底找的是什么样的</span><span>理由和借口？</span></p><p><strong><span>王曰：寡人有疾，寡人好货。</span></strong><span>齐宣王讲：说我这个人有疾，疾指的是疾病，也就是有一个毛病，有一个问题；寡人好货，说我好财货，也就是喜欢财物这些事情。</span></p><p><span>我们可以看到，在齐宣王的心里，他认为自己好货这件事情，与王道是相违背的。我是好财货的，我喜欢财富，喜欢拥有得更多。我怎么能去实行王道？</span></p><p><strong><span>对曰：昔者公刘好货。</span></strong><span>这个时候孟子开始要举例子了，昔者指的是曾经。曾经公刘这个人也是好货的，公刘是谁呢？在舜那个时期，有一位重臣叫后稷。后稷这个人擅长农业，擅长耕种。而公刘就是后稷的曾孙，后稷和公刘都是周王朝的先祖。</span></p><p><span>到了公刘这个时候，已经是夏朝了。但是夏朝的君主并不擅长耕种，也不推行耕种，不去推行农业。但是公刘由于祖上后稷，就是擅长农业的。这个时候他就把自己的部族迁到了豳这个地方，也正是因为迁到豳这个地方，才给周朝的先期提供了很好的土壤。</span></p><p><span>迁到了豳这个地方以后，到了太王时期，也就是文王的祖父古公亶父，从豳又迁到了岐山这个地方。周王朝从岐山开始变得兴盛，所以我们由此看到一个家族的兴起，是很多代人努力最后的结果。我们再讲回公刘，孟子说公刘也好货，但我们看公刘的好货，和齐宣王的好货，有什么不同？</span></p><p><strong><span>《诗》云：乃积乃仓。</span></strong><span>接下来引用《诗经》，《诗经·大雅·公刘》。《公刘》是《诗经》这篇的名字，讲的就是迁徙的过程。乃积乃仓积是指的积累，囤积粮食，仓是指的粮仓，囤积粮食，积满粮仓。</span></p><p><strong><span>乃裹糇粮，于橐于囊。</span></strong><span>裹指的是包裹，糇粮指的是自制的干粮。于囊于橐，囊和橐指的是大小不同的两种口袋，囊是大口袋，橐是小口袋。</span></p><p><span>也有人讲，囊和橐口袋的样子不一样。</span><span>囊是有底的这种口袋，而橐是两边都是散着的，没有底，是方便装粮食和方便取粮食。总而言之</span><span>囊和橐指的是两种不同的口袋。</span></p><p><strong><span>思戢用光。</span></strong><span>戢指的是和谐之意，光指的是光荣，思就指的是思考和心中所想。我们看思戢用光，什么意思？大家都在想着以和谐为光荣。我们整个再看这段话，告诉我们囤积粮食，用粮食自制的干粮，装在大小不同的口袋当中。所有人心中所想都是以和谐为主旨，为目的，和谐是光荣的。</span></p><p><span>我们看他讲了一个什么样的场景？首先这个部族想要去迁徙，那么迁徙不能是所有的人一下就可以走到那个地方。也不可以共同前往，一定是有少部分人先前往，去找到合适的地方去开荒。找到合适的地方以后，才会把部族的其他人员迁徙到那个地方。</span></p><p><span>我们可以去想，能去开荒的寻找地方的，是不是都要是部族的主要劳动力。可是主要的劳动力出去寻找地方，出去开荒的时候，家里的人怎么办呢？老幼妇孺要如何办？所以这里就有了积累粮食，囤积粮仓，积累的粮食，囤积的粮仓是给在家里的这些人生活的保障。</span></p><p><span>于橐，于囊带上这些自制的干粮，是给出行的人的保障。思戢用光，指的是无论出行的人</span><span>还是在家等候的人，大家的主旨都是和谐的。所以就出现了一个互相谦让的场景，我们可以去想象，这样一个场景。</span></p><p><span>出门的人让在家里的人足够的粮食，而在家里的人想把粮食多装一些，给路上的人去食用，这样一个和谐的场景，就呈现在我们的面前。所以我们可以看到公刘也好货，带着他部族的人也喜欢囤积更多的粮食。</span></p><p><strong><span>弓矢斯张。</span></strong><span>指的是带着弓箭和弓，随时都是箭在弦上的状态。</span></p><p><strong><span>干戈戚扬。</span></strong><span>指的是四种武器，干指的是盾牌，戈指的是长戈，戚指的是斧头，扬指的是大斧。</span><span>告诉我们，带上各种工具以及武器。因为那个时候野兽是经常出没的，并且还有可能遇到</span><span>其他部落的人，还有可能去开荒。所以带上了各种工具和武器。</span></p><p><strong><span>爰方启行。</span></strong><span>这个时候才开始启行，我们再整个看这一段，什么时候才要出发远行，是所有的准备工作都做得完全以后，家里的人有粮食吃，有生活的保障。</span></p><p><span>出行的人橐和囊之中，装着粮食不会挨饿。同时带上弓箭，带上各种工具以及武器，在路上既可以保护自己，同时也可以作开荒的用途，这个时候才准备出行。</span></p><p><strong><span>故居者有积仓，行者有裹囊也，然后可以爰方启行。</span></strong><span>总结了，在家的人是有足够的粮食吃的；路上的人是有裹和囊的，里面装着的都是可以食用的粮食，然后才可以出发去远方。</span></p><p><strong><span>王如好货，与百姓同之，于王何有？</span></strong><span>孟子最后做了总结，王即使您好货，如果与百姓同之，</span><span>您实行王政又有何难呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑤-4 齐宣王好色",
    "author": "虚空先生",
    "date": "2022-07-24",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑤-4 齐宣王好色</strong></span></p><p><span><strong>王曰：“寡人有疾，寡人好色。”对曰：“昔者大王好色。爱厥妃；《诗》云：‘古公亶父来朝走马，率西水浒，至于岐下，爰及姜女，聿来胥宇。’当是时也，内无怨女，外无旷夫。王如好色，与百姓同之，于王何有？”</strong></span></p><p><span>这段话讲完了，我们再来看其中的不同。齐宣王说寡人有疾，寡人好货。可是孟子举了例子，</span><span>说公刘也是好货的，但是他与百姓同之，所以可以实行王政。而齐宣王认为自己好货，没有办法实行王政，与王政是违背的。</span></p><p><span>显然孟子和齐宣王的想法截然不同，一个认为好货不能实行王政，一个认为好货是可以实行王政的。我们就要去思考了，他们的区别到底在什么地方呢？我们看齐宣王讲寡人好货，问题就出在寡人身上，寡人指的是我（齐宣王），我这个人好货。</span></p><p><span>可是孟子认为的我，和齐宣王认为的我，概念和意义完全不同。我们看孟子认为的我，是什么呢？作为君主我就包括了我自己，以及所有的子民。</span></p><p><span>而齐宣王的我只包括他自己，所以他就与实行王政相违背。</span><span>但是孟子的我是包含了我和所有的臣民，所以这个时候，你好货自然是与百姓同之的，故而可以实行王政。</span></p><p><span>我们来举生活当中的例子，比如说作为一个男人，作为一个一家之主，那么我包含了谁呢？</span><span>不只是我，还包含了我的妻儿老小，这个时候我如果是好货的，有什么问题呢？我是对整个家庭的担当。</span></p><p><span>比如说，我们要是做子女的，我就包含了我们的父母；如果我们是为人父母的，我就包含了我们的子女；如果我们是做企业的，我就包含了我企业所有的员工；我们如果是做员工的，我怎么样就包含了我对企业的态度，这个企业与我有关。</span></p><p><span>所以孟子和齐宣王心中的我，是完全两种不同的境界。当我们这个我，把他放大以后，你所包含的意义和担当都在其中。所以公刘好货，他可以实行王政，因为他的我包含了所有的子民。而齐宣王的我只有他自己，故而讲寡人好货。</span></p><p><span>我们要去思考，在我们生活当中，要有担当的，要有德行，要与民同之。我们如果是一家之主，这个我就包含了我的整个家庭；我们如果是一个企业的领导，我就包含了我的所有员工；</span><span>如果我是做人家丈夫的，我就包含了我的妻子；如果我们是为人妻子的，我就包含了我的丈夫。</span></p><p><span>所以这个时候，你的境界和格局就在不停地放大，你的担当和仁爱自然也就在其中。齐宣王听到了孟子讲的好货的不同，似乎并没有完全听懂，所以接下来，又找了其他的理由和借口。</span></p><p><strong><span>王曰：寡人有疾，寡人好色。</span></strong><span>这个时候齐宣王又讲了，可是我还有一个毛病，我这个人好色。我们看孟子是如何讲的？</span></p><p><strong><span>对曰：昔者大王好色。</span></strong><span>太王指的是古公亶父，也就是周文王的祖父，公刘的后代，孟子说好色也无妨。我举个例子，说曾经的太王古公亶父，他也是好色的。</span></p><p><strong><span>爱厥妃。</span></strong><span>厥指的是其，也就是太王的妃子，说太王也好色，非常爱自己的妃子。因为太王这一生就只有这一位正妃，我们可以看到他对妃子是非常有爱的，并没有娶其他的侧妃。</span></p><p><span>《诗》云：接下来引用《诗经》，这个是《诗经·大雅》当中的一篇叫作《绵》。这篇诗经讲的是古公亶父在迁徙的路上，遇到了这位正妃，我们刚才讲到公刘把部落迁到豳这个地方。后来在古公亶父期间，有西戎来犯，这个时候古公亶父不想与之兵戎相见。</span></p><p><span>因为那个时候自己还很弱小，并不想让自己的百姓受到伤害。所以古公亶父讲，既然对方要的是我的土地，我就给他就好了。所以劝说民众，不要去抵抗，做无谓的牺牲。</span></p><p><span>在这种情况下，古公亶父就把部落从豳这个地方，迁到了岐地，也就是岐山脚下。而这篇诗经当中有描述，随着古公亶父迁徙的人群，像去集市一样热闹。全家老小背着行囊包裹，愿意跟古公亶父去迁移。</span></p><p><span>我们可以看到因为古公亶父的德行，因为他的谦让，因为他的仁爱，所以这些百姓愿意跟着他，迁往其他的地方。《诗经》这篇《绵》就是讲了这样一段故事。绵形容的是绵长，连绵不断，用以形容那个时候的繁荣景象。</span></p><p><strong><span>《诗》云：古公亶父来朝走马。</span></strong><span>来指的是避，就是避让西戎。这个朝指的是清晨，说古公亶父为了躲避西戎，在清晨的时候骑着马。</span></p><p><strong><span>率西水浒，至于岐下，爰及姜女。</span></strong><span>沿着河岸一路向西走，走到了岐山，在这个地方娶了姜氏的长女。这里我们可以看到一点，姜女是当时岐地姜姓的长女，那么古公亶父在这之前是没有娶妻的。</span></p><p><span>而走到这个地方，得到了当地姜氏的认同认可，所以将长女嫁于古公亶父为妻。我们可以看到对古公亶父的认可，因为娶了姜女，所以古公亶父也就在这个地方，开始开疆拓土。把这些人安顿在这个地方。</span></p><p><strong><span>聿来胥宇。</span></strong><span>聿是助词，胥指的是视察，察看。宇指的是宫殿，我们再看这段话，古公亶父为了躲避西戎。所以清晨骑着马，带着部落，沿着河岸，一直向西，走到了岐山这个地方。得到了当地姜氏的认同，并且娶姜氏的长女为妻，一起在这个地方视察，并且开疆拓土，去开发土地，建造宫殿。</span></p><p><span>以此在这个地方定居，当时历史上是有记载的，这位姜氏的长女很有女德，并且柔顺，有智慧，而且很有美貌。在这之后，古公亶父和姜女两个人带着这个部族，在这个地方建造家园，</span><span>开发土地，从此以后过上了幸福的生活，也为周王朝的开启，奠定了基础。</span></p><p><strong><span>当是时也，内无怨女，外无旷夫。</span></strong><span>当是时也，指的那个时候，就是古公亶父和姜女那个时候。内无怨女，外无旷夫。怨女指的是未嫁，并且抱怨的少女。旷夫指的是单身未娶的男子，说在那个时候，没有嫁不出去的少女，也没有娶不上妻子的男子。</span></p><p><span>我们可以想象这样一种场景，为什么没有嫁不出去的少女？和没有单身的男子呢？因为古公亶父和姜女做了很好的榜样，他们两个人是恩爱有加的，并且古公亶父一生就只有这一位正妻。并没有娶其他的侧妃，我们就可以看到两个人的感情，并且一起开发土地一起建造家园。</span></p><p><span>他们部落当中的人，自然是纷纷效法的，所以并没有嫁不出去的少女，也没有娶不上妻子的男子。大家在这个地方幸福的生活着。</span></p><p><strong><span>王如好色，与百姓同之，于王何有？</span></strong><span>孟子又做了总结，如果说大王您是好色的，但是可以为百姓的榜样。对于您来讲，实行王政又有什么难的？我们可以看到齐宣王说他好货，孟子讲公刘也好货，但是与百姓同之。他的心中是有百姓的，所以他是有担当有仁爱的，故而可以实行王政。</span></p><p><span>那么齐宣王又讲自己好色，孟子又讲太王也好色，也娶了姜女，并且形影不离，共同建造家园。可是他是以自己的这种感情为榜样，让百姓去学习和效法，所以太</span><span>王实行的也是王政。</span><span>我们看太王的好色，他是一个正字，他是正确的行为，正确的途径。</span></p><p><span>所以会被百姓接纳并且效法，那么公刘好货，他是心中有百姓，是我这个包含了我的子民在其中。他的好货也是百姓认同的，并且是可以学习，可以为榜样，可以去效法的。</span></p><p><span>孟子告诉齐宣王一个什么道理？你好货也可以实行王政，但是你这个我要把他放大，作为君主，你的我就要包含了所有的子民。</span></p><p><span>你好色也没有关系，但是一定是正确的途径，可以让别人学习和效法的。延伸到生活当中，</span><span>我们也是如此，你可以好货，但是你的好货当中，我的格局要变大。你要有更多的担当与民同之，让更多的人可以受益。</span></p><p><span>你说我做一个企业，我好货好财物。我可以把它跟我更多的员工，更多的客户去共享，这就是在实行王政。你说我这个人好色，但是你要有正确的途径，是可以把它讲给别人听的，可以做给别人看的，可以让别人学习和效法的。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑥ 顾左右而言他",
    "author": "虚空先生",
    "date": "2022-07-24",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》梁惠王下⑥ 顾左右而言他</span></strong></p><p><strong><span>孟子谓齐宣王曰：“王之臣，有托其妻子于其友，而之楚遊者；比其反也，则冻馁其妻子。则如之何？”王曰：“弃之。”曰：“士师不能治士，则如之何？”王曰：“已之。”曰：“四境之内不治，则如之何？”王顾左右而言他。</span></strong></p><p><strong><span>孟子谓齐宣王曰：王之臣，有托其妻子于其友，而之楚游者；比其反也，则冻馁其妻子。则如之何？</span></strong><span>我们看这一段对话很有意思，孟子反问了齐宣王一个问题，问齐宣王说，假如有一个大臣把他的妻子，托付给他的友人。妻子指的是妻子和孩子，也就是把家小都托付给了友人。</span></p><p><span>而之楚游者。</span><span>之就是到，而这个人他去楚国出游。比其反也，等到他返回来的时候发现了一件事情，则冻馁其妻子。发现他的妻子和他的孩子正在挨饿受冻，则如之何？这样的朋友要怎么对待呢？要怎么去办？</span></p><p><strong><span>王曰：弃之。</span></strong><span>这个时候齐宣王讲，当然要放弃这样的朋友。这样的朋友是不能与之交往的，因为他是不负责任的，他承受不了朋友对他的所托。我们去讲托付这件事情，想一想我们平时生活当中，如果遇到了事情，我们会把事情托付给什么样的人？</span></p><p><span>这个人要负责任，他要有责任心，可以把这件事情很好地处理好，我们才会托付于他。比如说孟子问齐宣王说，假如您这里有一个大臣，他要去楚国，把他的妻和子托付给朋友。既然这个朋友接受了，他就有责任和义务照顾好人家的妻子和孩子，不能让人家挨饿受冻，或者说受到其他的伤害。</span></p><p><span>我们在生活当中，其他的事情也是如此，我们把工作托付给一个员工，我们会托付给一个信任的员工。他是有能力，有责任心可以把这件事情处理好，我们才敢托付于他。如果他没有责任心，没有能力做好这件事情，是不值得我们托付的。</span></p><p><span>在生活当中，我们不能所托非人，我们想要托付任何一件事情，我们都要心中去考量，这个人是否有责任心的，是否有能力完成这件事情？否则不要轻易托付。</span></p><p><span>我们换个位置也是一样的，如果有人把事情托付给我们。这个时候，我们有两个选择，其一是接受，其二是不接受，不接受我们可以直接明说。我确实没有时间，或者没有这个能力做到，我们就直接拒绝。</span></p><p><span>一旦我们要是接受了，君子是要负责任的，是要有责任心的。我们就要全心全意的把它做好，否则绝不是一个君子的行为。这样的朋友，这样的人就可以放弃他了。齐宣王回答了这个问题以后，孟子接下来又问了一个问题。</span></p><p><span>我们这里可以看到，孟子用了一种类比的手法。首先问了一个跟齐宣王没有关系的事件，说假如有一个人去楚国，托付自己的妻和子于朋友，而朋友并没有照顾好，还在挨饿受冻。齐宣王说，这样的朋友要放弃，不能与之交往。我们看接下来孟子又问了一个什么问题。</span></p><p><strong><span>曰：士师不能治士，则如之何？</span></strong><span>士师指的是掌管司法的官员，不能治士，士是指自己的下属。我们再来看这句话，一个掌管刑法的官员、司法官，他不能治理好自己的下属，则如之何？那这种情况要怎么办呢？</span></p><p><strong><span>王曰：已之。</span></strong><span>已就是停止的意思，也就是停止、罢免、撤换了他，我们去想为什么掌管刑法的官员，不能治理好自己的属下呢？是不是因为自己持身不正，自己的行为并没有起到表率的作用，所以就没有办法治理好自己的下属。</span></p><p><span>我们看这句话是对应着我们上一句所讲的，齐宣王讲：寡人有疾，寡人好色。这个时候孟子举例子说：太王也好色，爱厥妃，爱他自己的妃子。但是太王和姜女之间是恩爱的，太王的好色是持身中正的，他可以起到表率的作用。</span></p><p><span>这里孟子又去问了一个问题，为什么掌管司法的官员，没有办法治理好自己的下属？是因为他自己持身就不正，并没有起到表率的作用，这样的官员要怎么去对待？齐宣王知道了，这样的人要停止罢免。</span><span>接下来才是孟子想要反问的重点，只不过在之前做了一点铺垫。</span></p><p><strong><span>曰：四境之内不治，则如之何？</span></strong><span>四境指的是一个国家之内，问齐宣王说一个国家之内，不能得到好的治理，这个时候要怎么办呢？</span><span>我们相信齐宣王心里是有答案的，和前两个问题的答案是一样的。</span></p><p><span>弃之，已之，说是要放弃的，不能与这样人交往。说是要罢免和停止的，不能任用这样的官员。齐宣王心中的答案，似乎我们都知晓。我们看齐宣王是怎么做的？</span></p><p><strong><span>王顾左右而言他。</span></strong><span>这个时候齐宣王看看左右，转移话题了，去讲其他的事情，而不再讲这件事情了。</span></p><p><span>我们看孟子与齐宣王的这段交流，孟子举了两个简单的例子，问了两个问题，其实是想告诉齐宣王，现在齐国境内是没有得到好的治理的，这个时候要怎么办呢？</span><span>而齐宣王并没有正面的回答这个问题，顾左右而言他。显然齐宣王是不想做任何改变的，是没有想去实行王政的。</span></p><p><span>我们这里首先延伸一点，与他人交流的智慧，如果我们是处上位的，对处下位的人来讲，讲一件事情，讲一个问题，想要他负起责任，我们可以直接的去讲。甚至可以选择已知，也就是齐宣王的停职和罢免。</span></p><p><span>可是当我们处下位的对处上位的人去讲，我们要有讲话的智慧，我们讲话要委婉，并不能直接讲。而发现处上位的人，在顾左右而言他，我们要及时的停止话题，</span><span>否则讲下去是没有任何意义的。所以这段对话也就到了，王顾左右而言他，停止了，这段话结束了。</span></p><p><span>我们从这段话当中，再来看孟子到底在讲什么？这里面讲的无非是责任心的事情，我们上一讲课讲到我的这个概念和范畴，如果是一个有仁德之人，一个想实行王政之人，我就包含了我以及所有的子民。</span></p><p><span>如果你是一个负责任的男人，这个我就包含了我的妻和子，包含了我整个家庭。如果是一个有责任心的老板，我就包含了我以及全体的员工，如果一个这样有责任心的人，你就会有更多担当。</span></p><p><span>举个例子，比如说我们正在做一个企业，正在做一家公司，我怎么能倒下，我倒下了，我下面的这些员工他们要怎么办？他们要如何去生活？还愿意跟随我的客户他们要怎么办？他们要如何生活呢？这个时候我们就会变得有担当，变得有力量。</span></p><p><span>在家庭当中也是一样的，如果我们是为人夫，我们要去想，我们可以通过自己的努力和担当，让家庭的每个成员过上更好的生活。</span></p><p><span>如果我不去担当，他们就要受苦的，你想一想一个人的担当，可以让你的妻和子过上更好的生活，接受更好的教育，可以让你父母，有更好的生活条件。</span><span>可是我们没有担当，我们的家人就要跟着受苦。</span></p><p><span>我们做一个妻子也是一样的，如果我们可以懂得提升自己，让自己变得贤良淑德，就可以很好的辅助自己的丈夫。就可以很好的教育自己的子女，这都是一种责任心的表现。</span></p><p><span>如果我们是做一个企业的，我们是治理一个国家的，正如齐宣王，如果他是有责任心的，就会想着百姓。我不能治理好我这个国家，就会让我的子民受苦。</span></p><p><span>我不能治理好我的国家，就会导致我的国家灭亡。那么他们将要沦为其他国家的奴隶，他们就要受更多的苦。</span><span>所以一个有责任心的人，就会变得更加担当，就会变得更加有力量。而我们有了这种责任心，才能让别人依附和归附。</span></p><p><span>我们举几个例子，如果我们作为一家之主，是有这种责任心和担当的，那么我们的妻和子就可以依附于我们，他们可以在我们这里找到安全感和幸福感。</span></p><p><span>如果我们是做企业领导的，有了这种责任心，我们的员工就会有归属感，就会有幸福感，他们会愿意依附于我们。如果做一个君主的人，是有责任心的，是爱护百姓的，百姓自然就会归附于我们，这个时候他是相互成就的关系。</span></p><p><span>所以整个这一段，孟子都想要告诉齐宣王，你要负起相应的责任，你要做一个君主该做的事情，做一个君主该有的担当。不光齐宣王如此，生活当中，无论我们处在哪个阶段，处在哪个位置，我们都应该有责任心，都应该有这种担当和付出。</span></p><p><span>在责任心和担当之外，我们再来延伸一点，一个人要让自己变得优秀，为什么呢？一个人变得优秀，就可以影响身边更多的人。</span></p><p><span>我们举个例子，如果我们做人家的父亲，自己变得更优秀，会直接影响你孩子的价值观和他平时的行为。同时我们做母亲也是如此，做母亲的人，如果自己品行是好的，是有智慧的，就会直接影响到你的孩子。</span></p><p><span>我们作为一个企业领导也是如此，如果自己成为一个优秀的人，会直接影响到身边的员工。让他们的行为，让他们的智慧都会变得更好。我们跟朋友相交也是如此，如果我们的品行端正，如果我们的行为是中正的，我们平时做事情是有智慧的，有条理的，有能力的，都会让身边的朋友受益，影响到别人。</span></p><p><span>在生活当中，让我们自己变得负责任，有责任心，且让自己变得更加优秀。不光是我们自己的事情，还要影响着我们身边出现的每一个人，进而我们可以影响更多的人，去帮助到更多的人。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑦-1 用人之道",
    "author": "虚空先生",
    "date": "2022-07-25",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下7-1用人之道</strong></span></p><p><span><strong>孟子见齐宣王，曰：“所谓故国者，非谓有乔木之谓也，有世臣之谓也。王无亲臣矣，昔者所进，今日不知其亡也。”王曰：“吾何以识其不才而舍之？”曰：“国君进贤，如不得已，将使卑踰尊，疏踰戚，可不慎与？左右皆曰贤，未可也 ；诸大夫皆曰贤，未可也；国人皆曰贤，然后察之，见贤焉，然后用之。”</strong></span></p><p><span><strong>孟子见齐宣王，曰：所谓故国者，非谓有乔木之谓也。</strong>何为故国？故国指的是古老的，历史悠久的国家。为什么要讲故国呢？通常历史悠久的国家，说明国富民强，说明他的根基是很稳的。任何一位君主想要治理好一个国家，都是想成为历史悠久的国家。</span></p><p><span>这里孟子见到齐宣王，先讲了这样一段话，说我们去所谓的讲的那些历史悠久的国家，非谓有乔木之谓也。这里的乔木指的是高大的树木，那些历史悠久的国家，并不是因为有高大的树木，这里高大的树木我们再延伸指的是一切的物质，也就是外在的条件和基础。</span></p><p><span>比如说军事力量，比如说国家征了多少税收，比如说国家的国库是否充盈，这些都称之为乔木，也就是所有外在的东西。既然一个国家能成为历史悠久，不是因为外在的物质条件，核心到底是什么？</span></p><p><span><strong>有世臣之谓也。</strong>是因为有人才，世臣是指的世代有功勋的大臣。我们再来体会这句话，孟子讲历史悠久的国家，不是因为有多少外在的物质条件，而是因为有世代可以建立功勋的大臣，不光是齐宣王治理一个国家。如此想一想，我们在一个家庭当中，或者在一个企业当中，是不是同样的道理？</span></p><p><span>比如说，我们一个家庭过得是否幸福，不取决于我们的外在的物质条件，说我住多大的房子，我开什么样的车子，就会让我们去开心和快乐吗？显然并不是。让我们真正快乐和谐的，是人和人之间的相处是和睦的，是两个人彼此恩爱互相照顾的。</span></p><p><span>我们在一个企业当中也是一样，一个企业想要发展的更长久，绝不是因为企业拥有什么样的技术，和有什么样的外在的物质条件。技术是靠人才不停地创新而得来的，所有的外在的条件，都是靠人才努力而获得的。所以人才是根本，从古至今这是不变的道理。</span></p><p><span><strong>王无亲臣矣，昔者所进，今日不知其亡也。</strong>这句话才是孟子真正想要讲给齐宣王的，在这之前是讲了一段故国的事情，说古老的那些国家之所以历史悠久，并不是因为有高大的乔木和外在的物质条件，而是有世世代代的功臣相辅佐，告诉人才是最核心的。</span></p><p><span>接下来要讲重点了，说王无亲臣矣，说大王您现在身边没有亲信的大臣，昔者所进，曾经您任用的那些人，今日不知其亡也，今日已经不知道都去了哪里？我们来看这段话，孟子先举了一个例子，讲历史悠久的国家，是因为有世代的功臣，所以才得以昌盛和悠久。</span></p><p><span>可是今天的齐宣王身边并没有亲信的大臣，曾经即使任用过的那些人，今天都已经不知道去了哪里。孟子讲这番话，是希望齐宣王可以有所思考，可以去看到自己身上的不足，为什么身边没有亲近的大臣了？我们看听到这句话齐宣王作何反应？</span></p><p><span><strong>王曰：吾何以识其不才而舍之？</strong>我们看齐宣王的思维，他说我要如何识别那些不是人才的人，而舍弃不用呢？这里显然齐宣王并没有理解孟子的意图，孟子是想要告诉齐宣王说，大王您现在身边没有近臣，即使曾经任用过的人，都不长久，今天都不知道去了哪里。</span></p><p><span>我们把他用在一个企业当中，我们想一想是多么可怕的一件事情，如果你的企业做了五年，十年，甚至更久的时间，但你发现你身边并没有亲近之人，也没有我们讲的老员工，想一想说明了什么问题？</span></p><p><span>我们反之也是一样的，如果我们到一个企业去工作，一了解这家企业，你发现老板身边，并没有亲近之人，同时也没有跟着这个公司一起发展过来的人，那是不是说明这家公司的老板并没有足够的德行。</span></p><p><span>他并不相信其他人，所以留不下来人那些曾经立下汗马功劳之人，现在已经不知道去了哪里？这是一个非常可怕的问题，可是我们看齐宣王，他不认为说是不是我治理国家的方式有问题，我的为君之道有问题，所以导致我曾经任用过的人，今天都不知道去了哪里？导致今天身边并没有近臣。</span></p><p><span>齐宣王问的是，我如何才能识别那些不是人才的人，我舍弃不用。而孟子是想让他思考自身有哪些不足？如何才能留下人才，留下近臣，留下世代功勋之臣。可是齐宣王想的是，如何舍掉那些没有才华的不优秀的人。齐宣王既然没有听懂孟子在讲什么，我们接下来再看，孟子是如何回答齐宣王的问题。</span></p><p><span><strong>曰：国君进贤，如不得已。</strong>孟子又讲到该如何进贤？并没有首先讲到如何识其不才而舍之，而是告诉齐宣王，首先我们在选择贤者之时，要非常的谨慎，要慎重。我们现在也是一样的，说我们开一家公司，你在选择员工的时候，就要很慎重，去选那些符合你公司价值观的人。</span></p><p><span>如不得已，即使是进贤才也是不得已而为之的事情。绝不是一件很开心的事情，因为只要进贤才进新人，就意味着对过去的这些人是一种冲击，会带来波动。我们同时要去想，为什么说，进贤才是不得已的行为？说明我们过去的这些旧臣是没有足够的能力，治理好当下的朝政，经营好当下的企业。</span></p><p><span>在这种情况我们才会进贤才，既然是在这种情况进的贤才，我们更要考虑他是否符合我们当下的需求，这个人品德是否足够好，所以说从进贤才开始，我们就要很慎重。</span></p><p><span><strong>将使卑踰尊，疏踰戚，可不慎与？</strong>因为当我们进贤才，就会使卑超过尊贵的人，疏超过亲近的人，所以怎么能不慎重呢？我们新进来的贤才，我们称之为卑。在过去的已经在这里很久的，我们称之为尊。</span></p><p><span>所以刚进来的贤才，我们要注意一点，不能让他超越本来在这里的那些大臣，否则整个朝局一定是动荡的。我们经营一家企业也是如此，新进来的员工他所得到的待遇和尊重，一定是不能超过过去的老员工的，否则这个就叫逾越，会产生很多的波动和不安，你让老员工作何感想？</span></p><p><span>疏踰戚，过去的老臣一定是亲近的，而新进来的人是疏远的，所以疏远不能超过那些亲近的人，这是非常要值得慎重的一件事情。我们再来看整个这一句话，需要慎重的两点，第一点，进贤才之时是不得已而为之，所以进来的人才，我们就要严格的把关，一定是他的品德和价值观，符合我们当下的需求。</span></p><p><span>那么第二点，要谨慎和慎重对待的，就是不要卑超越尊，不要疏远的，超越亲近的，否则都会给我们整体带来很多动荡和不安。既然国君要进贤，那么接下来，孟子就要讲到如何进贤？在进贤的过程当中，要注意些什么问题，如何谨慎对待？</span></p><p><span><strong>左右皆曰贤，未可也 ；诸大夫皆曰贤，未可也；国人皆曰贤，然后察之，见贤焉，然后用之。</strong>这里讲了一个远近亲疏，首先左右之人，也就是身边最亲近的人。你身边亲近之人，推举之人，说他是贤德的，这个不可以，还不够。</span></p><p><span>诸大夫皆曰贤，未可也；那些大夫，也就比左右的近臣，关系又远了一点，他们说是贤德的，也不可以；国人皆曰贤，这个时候到百姓了，百姓也认为贤德，那么百姓离君主就更远一点，既然他们也觉得贤德；这个时候，然后察之，要自己亲自的去观察，见贤焉，然后用之。</span></p><p><span>经过自己观察，发现他确实是贤德之人，这个时候你可以任用他了，我们看这句话的道理，到底在什么地方呢？为什么左右之人说他贤德不可以，诸大夫说他贤德依然不可以，国人认为他贤德还不够，还要经过自己的考察，发现真的贤德才可以任用，我们去看这里面是有利益关系存在的。</span></p><p><span>举个例子，比如说身边亲近的左右之人，向你推荐某个人，说他是贤才，这个时候包不包含他自己的利益在其中？可能是他的亲近之人，可能是他想提拔之人，所以这个时候是不可以的。还要去听别人的意见，诸大夫觉得这个人也很贤德，同样和左右之人是一样的道理，可能包含他自己的利益在其中。</span></p><p><span>所以这个时候，我们去看国人怎么说？百姓认为他是贤才，我们这里不禁要有疑问了，百姓认为他有贤才，难道就没有自己的利益在其中吗？固然是有的，可这个不恰恰是我们需要的吗？百姓所推举的贤才，一定是对百姓有利的，恰恰是为君之道。</span></p><p><span>如果他对百姓有利，这样的人我们是可以观察的，最后发现他确实是贤才，这个时候就可以任用了。这个道理，我们用在现实的生活当中也是如此，比如说，如果我们是一个企业的老板，这个时候你的左右之人，也就是身边亲近之人，向你推荐哪些人是可以升职的。</span></p><p><span>这个时候是不够的，因为他推荐的可能有他自己的利益和喜好在其中，所以我们还要去征求更多中层领导的意见，这些人如果说，他也是贤才，还不够，我们要看看最基层的员工以及客户，对这个人的认同感如何？是否认为他是一个贤才?</span></p><p><span>如果基层的员工，以及客户消费者认为他是贤才，这个时候我们再去观察，如果可以，我们是可以任用的。所以孟子主张从进贤才的那一刻开始，就要严格的把关，只有从根源上，从源头上少出错误，那么最后的结果才会变好。</span></p><p><span>我们去读历史的时候，很容易发现一件事情，如果一个人，尤其是处于高位之人，如果用得不得当，他会导致朝局混乱。</span></p><p><span>我们在一个企业也是一样的，如果我们升一个人到高管的位置，一旦用人不当，会导致基层的员工，以及客户有很多的不满意。</span><span>他对于整个企业的安定和谐是起到反作用的，所以说进贤才很重要。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑦-2 为君之道",
    "author": "虚空先生",
    "date": "2022-07-26",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑦-2为君之道</strong></span></p><p><span><strong>左右皆曰不可，勿听；诸大夫皆曰不可，勿听；国人皆曰不可，然后察之，见不可焉，然后去之。左右皆曰可杀，勿听；诸大夫皆曰可杀，勿听；国人皆曰可杀，然后察之，见可杀焉，然后杀之。故曰国人杀之也。如此，然后可以为民父母。</strong></span></p><p><span><strong>左右皆曰不可，勿听；诸大夫皆曰不可，勿听；国人皆曰不可，然后察之，见不可焉，然后去之。</strong>孟子对齐宣王讲了，进贤才一定要慎重，那么不只是进贤才要慎重，舍之也要慎重。同样我们要舍一个人，也是这样的次第，首先左右亲近之人，觉得不可以，这个不要听，我们还要去观察；诸大夫皆曰不可，勿听，还是不要听。</span></p><p><span>国人皆曰不可，这个时候要注意了，从左右之人到诸大夫，再到国人都觉得这个人不可以，然后察之，我们要去观察，最后通过观察发现，确实不可以，然后去之，这个时候就不能再任用了。</span></p><p><span>跟进贤才同样的道理，左右之人想要舍弃一个人，也包含他自己的利益和喜好在其中，所以我们不要轻易的去听从，我们要学会自己去观察和甄别，孟子讲关于进和舍的这一段，是告诉我们不要有自己的喜好，而是尊重客观事实的存在。</span></p><p><span>不要听从自己的喜好，也不要听从身边之人的喜好。所以我们整个看孟子的这段话，没有讲个人是否喜欢，没有讲你喜欢什么样的大臣，你不喜欢什么样的人才，而是告诉我们详细的去观察，尊重客观事实的存在，这个时候才是公正的。</span></p><p><span>但是我们作为人的角度来讲，是很难克服自己的喜好和偏好的。比如说，我们在生活当中也是一样，很多时候我们所做的决定，往往是遵从了自己的喜好。</span></p><p><span>比如说喜欢某一个人，我就给他升了职，给他加了薪，我们不喜欢一个人，我们可能就对他有很多的冷漠，甚至即使他身上有某种能力，我们也忽略掉了。所以我们一定要学会克服掉自己的喜好，不要掺杂自己的喜好和个人的情绪在其中，去选择进和舍，他一定是错误的。</span></p><p><span>去看看别人对他是什么样的意见，从左右之人到诸大夫，最后到国人，大家对他共同所产生的看法，才是客观存在的，而不是凭我们自己的感受和喜好。</span></p><p><span><strong>左右皆曰可杀，勿听；诸大夫皆曰可杀，勿听；国人皆曰可杀，然后察之，见可杀焉，然后杀之。</strong>除了进和舍这两件事情之外，还有一件事情要慎重的对待，那就是杀。因为君主他是掌握着生杀大权的，所以对于生命这件事情，是要敬畏，是要慎重的。</span></p><p><span>还是一样的，左右之人觉得可杀不行，因为他可能包含着自己的利益，包含着自己的得失和偏好在其中，可能有私人恩怨在其中，所以到了诸大夫也是一样的，不是他们说可杀就可杀的，我们要尊重客观事实的存在。但是国人皆曰可杀，百姓也觉得这个人该杀，这个时候还要去观察，发现确实应该杀掉，然后杀之。</span></p><p><span><strong>故曰国人杀之也，如此，然后可以为民父母。</strong>我们看这里做总结了，故曰国人杀之也，并不是君主所杀的，而是国人所杀的。这是大家共同的意见，如此才可以为民父母，也才是为君之道。</span></p><p><span>我们看这个总结很有意思，如果我们按照这样的次第，去思考去观察，并不是君主杀的某一个人，也并不是君主任用的某一个人，也不是君主舍弃的某一个人，他是民心所向，是百姓共同的选择。</span></p><p><span>我们想一想，在生活当中是不是一样的？如果我们学会了这种思维方式，我们不需要去做任何选择，他人和事情自然会给我们来做选择。比如说我们去经营一家公司，去带领一个团队，我们不用去选择要给哪些人升职加薪，而事情和他人自然会去选择。</span></p><p><span>谁可以胜任哪些事情，谁自然就去做。做着做着，大家对他是认同的，消费者和客户对他是满意的，他自然就可以升职加薪。如果在团队当中有些人他是不付出的，不努力的，其他的客户和消费者自然就会对他疏远，他的事情自然是做不好的，这些客观事实的存在。</span></p><p><span>他就一定会被淘汰掉，所以如果我们去做一个企业的领导，我们并不需要用自己的喜好去抉择，我们去观察别人对他的反馈，我们去观察他是否能做好一件事情，当结果呈现出来的，我们不需要去选择让他升职，还是选择辞退。那个事情的结果，就会呈现在那个地方。</span></p><p><span>这是我们学习儒家文化很有意思的地方。我们可以说用道去选择，可以说用事件去选择，而不需要自己掺杂着自己的喜好和偏见，去抉择一件事情。百姓都想要杀掉这个人，你去观察确实可杀，这是百姓杀的。百姓觉得这个人是贤才，可以任用，你去观察发现确实可以任用，这是百姓共同推荐的。</span></p><p><span>生活当中也是一样，如果大家都觉得这个人很好，说明这是大家推荐的，众望所归。如果大家都觉得某个人有问题，你去观察，发现他确实有问题，这个时候就可以舍之了，因为这是众望所归，大家的眼睛是明亮的。</span></p><p><span>通过这段对话，我们再来延伸三个关键点，延伸的第一点叫利益团体，我们要非常的注意这四个字，什么叫利益团体呢？以齐宣王为例，如果他听信了身边左右近臣之言，这个时候齐宣王和身边的近臣就变成了一体，自然就站在了百姓的对立面。</span></p><p><span>一定会共同的剥削百姓，就形成了阶级斗争，如果齐宣王是站在百姓的立场和角度，这个时候齐宣王和百姓是一个利益体，大臣就站到了对立面，当齐宣王的关注点都是以民为本，以百姓的利益为根本，那么身边的近臣自然就想着如何利益好百姓，这个时候一个国家才是稳定的。</span></p><p><span>我们去用现在的生活来举例子，更好的理解，比如说一个企业的老板和高层或者中层领导站在一体，就相当于和基层员工站到了对立面，就相当于和消费者站到了对立面，可是如果一个做企业的老板的关注点，都在如何服务好消费者，那么公司的领导层自然要想着，如何去服务好消费者。</span></p><p><span>如果一个企业的老板是关注基层员工的成长以及待遇，那么领导层自然会去关注基层员工的待遇以及成长。可是如果跟领导层站在一起，终将会被孤立。我们去读历史，可以看到很多这种现象。</span></p><p><span>如果一个君主只想着自己享乐，那么身边的近臣以及大臣也都在想着自己享乐。置百姓于不顾，水能载舟，亦能覆舟。这个时候国家和朝政是要被推翻的。在一个企业也一样，如果一个老板只在意自己的得失和利益，领导层也会变成这个样子，就会不停地去剥削基层员工以及消费者。</span></p><p><span>因为和他们就成了对立面，而和身边之人变成了利益的共同体。所以孟子的这种思维方式很重要。我们要学会和百姓站在一起，和消费者站在一起，和基层员工站在一起。这个时候上下才会一心，大家的价值观和目标才会相同。</span></p><p><span>再延伸第二点，进、舍、杀，不要掺杂自己的喜好在其中。选择一个贤才不是你喜欢这个人就可以了，包括你要舍之，不用一个人，也不是凭着自己的喜好，而是要看众望所归、人心所向。</span></p><p><span>我们在生活当中也是一样的，如果我们去经营一家企业，不要觉得什么样的人好，就去任用他，而是要通过大家对他的评价，大家对这个人的认同感是如何？再加上自己的观察，这个时候才会少出错误。</span></p><p><span>那么基于以上两点，我们要延伸第三点叫做和谐，如果我们懂得找好自己的利益团体，我们懂得不要掺杂自己的喜好在其中，这些都是为了一个核心目的，就是和谐。如果我们有自己的喜好在其中，就一定会出现很多不和谐的因素。</span></p><p><span>举个例子，如果我们去经营一家企业，你因为喜欢某个人，就给他升职和加薪，会不会让其他的人内心不服，产生波动和波澜呢？这个时候就破坏了原本和谐的状态，比如说利益共同体，他也会破坏和谐。</span></p><p><span>比如说，跟高管成了利益共同体，那么这个时候我们的基层员工，一定会产生很多的动荡和波澜以及对抗。这个时候就是不和谐的，可是如果我们总站在基层员工的角度，去考虑问题，以这个为出发点，高管自然会倾斜，他们也会在意基层员工的感受，这个时候大家才能是和谐的状态。</span></p><p><span>齐宣王治理一个国家，更是如此。如果他懂得为百姓着想，懂得为民请命，那么身边左右之人以及大臣，自然为民请命。这个时候大家的想法和行为是一致的，都是以保民为核心，让百姓生活的更好为核心，这个时候才是和谐的状态。</span></p><p><span>所以我们整个第七句话这一段，核心在讲了一个和字，告诉齐宣王他是失和的状态，所以导致身边并没有世代功勋的近臣。曾经任用之人，现在已经不知道去了哪里，整个朝堂之上是不和谐的，整个国家是不安定的。</span></p><p><span>我们去想，只有在不和谐不安定的情况下，人才才会流失。我们看看在一个家庭和在一个公司当中，是不是同样的道理。如果一个家庭是和谐的，人人都愿意在家里生活，如果一个企业是和谐的状态，大家在这里工作是开心的，就会减少人员的流失。</span></p><p><span>如果一个国家是和谐安定的，大家就不愿意去其他的地方生活。如果反之，不和谐的状态就会有人员的流失，就会有百姓的流动。所以万事以和为贵，我们跟朋友交往，要懂得和谐的重要性；我们去经营一家企业，也要懂得一个和谐的重要性；我们治理一个国家，更要注重和谐以及稳定。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑧ 残贼之人",
    "author": "虚空先生",
    "date": "2022-07-30",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑧ 残贼之人</strong></span></p><p><span><strong>齐宣王问曰：“汤放桀，武王伐纣，有诸？”孟子对曰：“于传有之。”曰：“臣弑其君，可乎？”曰：“贼仁者，谓之贼；贼义者，谓之残。残贼之人，谓之一夫。闻诛一夫纣矣，未闻弑君也。”</strong></span></p><p><span><strong>齐宣王问曰：汤放桀，武王伐纣，有诸？</strong>齐宣王问孟子说，商汤放逐夏桀，武王讨伐商纣王，有这样的事情吗？这一句话当中提到了四个人，提到了商汤和周武王，商汤和周武王，一位创立了商朝，一位创立了周朝，而夏桀是夏朝的最后一个君主，商纣王是商朝的最后一位君主。</span></p><p><span>夏桀和商纣王都是历史上的暴君，无道且残暴，所以商汤就取代了夏桀，建立了商朝。但是商汤并没有杀死夏桀，而是流放到一个荒芜之地，所以叫汤放桀。而周武王讨伐商纣王，创立了周朝，这个时候齐宣王问孟子是否有这样的事情？</span></p><p><span><strong>孟子对曰：于传有之。</strong>传指的是史书史籍，孟子说史籍是这样记载的。我们这个时候就要去思考，齐宣王问这句话到底是什么意思呢？难道商汤放逐夏桀，周武王讨伐商纣王这件事情，</span><span>齐宣王会不知晓吗？即使是现在的，我们都知道这两段历史故事。</span></p><p><span>何况于战国时期那个时候的君王，齐国的君主怎么会不知道呢？所以他真正想问的并不是这件事情，而是这件事情呈现出来的状态，什么样的状态呢？</span></p><p><span><strong>曰：臣弑其君，可乎？</strong>我们来看这个时候齐宣王又问了，臣弑君这件事情是可以的吗？我们看商汤他是夏朝的一个部落的首领，武王是商纣王那个时候一个诸侯国的国君，他们是臣，而夏桀和商纣王是君，这个时候他们是属于臣弑君的。齐宣王就问了，臣弑君，这件事情是可以这样做的吗？</span></p><p><span>那我们去想孟子该如何去回答呢？如果孟子回答可以，没有了礼制、没有了仁德；如果说不可以，但是夏桀和商纣王又是无道的，残害百姓的，难道任由他们去残害百姓吗？所以似乎说可以和不可以，都不是合适的答案。</span></p><p><span>我们这个时候再来去想齐宣王的心理，他为什么要问这样一句话，这里面涉及到三个不同的身份。我们先讲第一种，如果是百姓的身份来讲，说百姓说到商汤放逐夏桀，周武王讨伐商纣王，百姓是大快人心的。因为是为百姓着想的，是因为夏桀和商纣王无道，残害百姓。</span></p><p><span>所以百姓提到这段过往，这段故事，他是开心的，是喜悦的，还有一种身份是天子的身份，如果天子的身份提到这段故事，会有一些担忧，是不是我无道之时也会有臣弑君，取而代之呢？</span></p><p><span>我们再看第三种身份就是齐宣王，他的君，还有天子他的臣，还有很多的臣民，大臣以及百姓，所以齐宣王他两种心理都有。第一种心理，是不是我可以取而代之呢？如今的周天子势微，并且并没有什么样的德行，在诸侯之间也没有号召力，我可否取而代之？</span></p><p><span>如果孟子讲可以，臣弑君是可以的，我就可以取而代之。同时他还有另外一个担忧，既然孟子讲了齐宣王那么多不合王道的地方，讲了现在齐国的现状，对外是好战的，对于国内的百姓，也并没有保民的政策，也没有让百姓过上衣食富足的生活。</span></p><p><span>那是不是我也是无道的？难道臣下就可以弑君吗？他的心里对上是想取而代之的，对下又会有隐隐的担忧，所以想看孟子是如何看待这件事情，臣弑君这件事情到底可不可以？</span></p><p><span>我们学习《孟子》到现在，自然了解孟子的智慧，孟子怎么可能跟着齐宣王陷在这个问题之中，其实这个事情的本质并不是臣弑君，而齐宣王只是看到了臣弑君，看到了表面现象。说商汤作为臣却放逐了夏桀，周武王作为臣却征伐了商纣王，这只是事情的表象，而本质并不是臣弑君，我们看看孟子讲的本质到底是什么？</span></p><p><span><strong>曰：贼仁者，谓之贼；贼义者，谓之残。</strong>我们先讲贼，贼是指的贼害，破坏之义。贼仁者，谓之贼，说一个人他是破坏仁的，是贼害仁的，这个人就称之为贼。贼义者谓之残，如果破坏了义，这个人就是在残害他人。</span></p><p><span><strong>残贼之人，谓之一夫。</strong>我们看残贼之人，就指的是不仁不义之人，不仁不义之人。谓之一夫，</span><span>什么叫一夫？就是众叛亲离之人。剩下自己孤家寡人一个人，也就是残贼之人。不仁不义就会众叛亲离，就剩了自己孤家寡人。</span></p><p><span><strong>闻诛一夫纣矣，未闻弑君也。</strong>闻就是听闻；诛就是征伐，诛杀之意。孟子讲，听说诛杀了众叛亲离的纣王而已。未闻弑君也，没有听说弑君这件事情。我们回头再来看孟子这句话，首先孟子把商纣王和夏桀给了一个词去形容，叫一夫。</span></p><p><span>因为他们不仁不义，导致众叛亲离，就成了孤家寡人，所以全天下的人并没有人愿意和他们站在一起。已经大众离心，所以这个时候商汤以及武王才会去讨伐，去诛杀。所以他们诛杀的是一夫之人，并不是在弑君。我们去看背后，他讲了一个什么道理？</span></p><p><span>我们学习了儒家文化，要讲忠、要讲信、要讲孝，但是我们要明白，忠于的到底是什么呢？</span><span>通过孟子的这段话，我们可以看到，孟子告诉我们忠于仁义，而并不是忠于某一个人，并不是忠于某一个位置，如果做君主的失了仁义，失了德行，不仁不义，变成一个残贼之人，这个时候你自然是可以诛杀的。</span></p><p><span>孔子在《论语》当中也讲过同样的道理，叫做当仁不让于师。我们首先讲要尊师重道，但是在仁德，在仁义面前，自己的老师也不能让，也就是我们要尊师重道，但当老师如果不合乎仁德，我们是不能再去追随的。</span></p><p><span>我们把他放在君主，放在其他的位置上，也是相同的道理。我们要忠于君，但是如果君做的事情失其责，失其位，如果开始变得无道，残害百姓，开始变得不仁不义，这个时候也是</span><span>没有办法去忠的。</span></p><p><span>延伸到我们的生活当中，也是一样，我们讲人不能愚忠，不能愚孝，什么意思？我们要忠于感情，我们要忠于父母，要忠于领导，可是如果他做的事情，是不合乎于仁义的，这个时候是不能忠的，也就是我们忠于的是心中的道，忠于的是仁义。</span></p><p><span>我们举个例子，我们说跟朋友之间的感情要互相帮助，这个时候才是情义的体现，可是明明朋友做的事情是错的，难道你还能去帮助他吗？还能忠于这段感情吗？再比如说孩子，我们对孩子是要仁爱的，是要慈爱的，可是孩子的价值观和行为是错误的，难道我们还能去放纵他吗？这个时候的慈，就变成了有问题。</span></p><p><span>所以我们讲忠也好，讲孝也好，讲慈爱他人，讲情感的链接都一样，前提是不能失掉了仁义二字。也就是不能失了道，如果失了道我们就变成了愚忠，变成了愚孝，变成了愚爱，所以我们爱别人是要有智慧的。</span></p><p><span>而智慧的遵循标准，就是仁义之道，我们再看孟子和齐宣王这段对话，齐宣王看到的是臣弑君，这是事情的表象。但是孟子讲不是臣弑君的问题，而是他们做的事情是不仁不义的，并没有为全天下的百姓着想。他们是在残害百姓，那么自然可以去讨伐的。</span></p><p><span>所以我们由此延伸，在生活当中也是一样的，我们要学习仁、义、礼、智、信，我们要敬爱慈爱，我们要衷心对待他人，但是有一个标准就是仁义，也就是不能失了道。</span></p><p><span>这个时候，我们是有自己的分辨能力的，我们是尊敬的忠心的是自己心中的道，他是不会出现偏颇的。他不是忠心于某一个人，不是忠心于某一个职位，不是忠心于某一个岗位，或者某件事情，他的核心就在于仁义二字，只要不失仁义就是可以忠的，如果失了仁义，我们要懂得及时转变。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑨ 术业有专攻",
    "author": "虚空先生",
    "date": "2022-08-03",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑨ 术业有专攻</strong></span></p><p><span><strong>孟子谓齐宣王，曰：“为巨室，则必使工师求大木。工师得大木，则王喜，以为能胜其任也。匠人斲而小之，则王怒，以为不能胜其任矣。夫人幼而学之，壮而欲行之。王曰：‘姑舍女所学而从我。则何如？’今有璞玉于此，虽万镒，必使玉人雕琢之。至于治国家，则曰：‘姑舍女所学而从我。’则何以异于教玉人雕琢玉哉？”</strong></span></p><p><span>这段话是孟子主动对齐宣王所讲，我们在过去的学习当中，孟子和齐宣王之间有很多的对话。齐宣王对于王道是感兴趣的，觉得王道很好，也尊重孟子的想法。但真正孟子想让齐宣王去行王道，齐宣王就会顾左右而言他。也就并不会真正的去做，或者去找很多的理由和借口。</span></p><p><span>他说我好勇，说我有疾，我好货；说我有疾，我好色；就是因为没有办法克服自己的欲望，所以齐宣王的这种心理，也影射了我们很多人在内，很多时候我们觉得对王道，对仁德，对于道德，对于正义我们也是感兴趣，并且我们的心也是向往的，也清晰的知道我该做什么事情，什么事情是不应该去做的。</span></p><p><span>但是我们也如齐宣王一样，没有办法克服自己的欲望，所以就会找很多的理由去推脱，或者顾左右而言他。正是因为齐宣王总是顾左右而言他，所以才有了接下来的这段对话。</span></p><p><span><strong>孟子谓齐宣王，曰：为巨室，则必使工师求大木。</strong>孟子对齐宣王讲了一段话，这段话也是从举例子开始，巨室是指建造大的房屋，大的房子。要想要建造大的房子，一定要让工师去求得大的木材，工师是古代的官名，是主管木匠，主管工人的，这样一个官位。</span></p><p><span>我们去体会这样一个例子，说一个人如果想要建造大的房屋，一定要使工师去求大的木材，因为只有大的木材去做房梁，去做柱子，才可能建造大的房屋。</span></p><p><span><strong>工师得大木，则王喜，以为能胜其任也。</strong>一旦工师得到大的木材，大王就会很开心，很高兴，认为他是可以胜任这件事情的。</span></p><p><span><strong>匠人斲而小之，则王怒，以为不能胜其任矣。</strong>匠人就指的是具体做工的工匠，我们看从工师开始，选择了好的大的木材，因为工师他是有经验的，所以他才能选择好的木材去建造大的房屋。</span></p><p><span>但是到了具体施工的工匠手里，斲而小之，斲是砍削的意思，他把原本大的木材砍成了小的木材。这个时候则王怒，以为不胜其任矣，大王一定会愤怒的认为他没有办法胜任这个工作，没有办法做好这件事情。</span></p><p><span><strong>夫人幼而学之，壮而欲行之。王曰：姑舍女所学而从我。则何如？</strong>夫人幼而学之，指的是一个人，如果从小学了一门手艺，一种技能或者一门学问。比如说我们从小要读书，要学习，这也算是一种技能。</span></p><p><span>壮而欲行之，指的是长大了以后要去践行，要学以致用的。我们看这段话，是讲之前的例子，在讲术业有专攻，说你想建造大的房子，你要去找懂得建造大房子的工师，他才会懂得去选大的木材，足以建造好大的房子。</span></p><p><span>可是这个时候，大王却讲，姑舍女所学而从我。则何如？你要让对方放弃他的所学，而听我的话，怎么样呢？如果你想建造大的房屋，那么你就要让工师去选择大的木材，而不是让他放弃自己的专业，去听我讲该如何去选择木材，这是错误的。</span></p><p><span>我们去想孟子这段话，在讲什么呢？他在告诉齐宣王，如果你想学习王道，想学习治国之道，那么你当然要听我对你讲的治国之道，而不能我讲完之后，你让我听你的话去做，这是错误的想法。</span></p><p><span>就像你建造一所大房子，难道你让工师去听你讲如何选择木材吗？因为你并不专业，在这里我们也要懂得在生活当中去应用。比如说，如果我们是做一家企业的，你找了一个在某方面的专业人才，在专业这个领域，你是要听对方去讲的，你不能让对方放弃了自己的专业，听我们如何去做事情，这是错误的想法。</span></p><p><span><strong>今有璞玉于此，虽万镒，必使玉人雕琢之。</strong>璞玉指的是未经雕琢的美玉，说今天有未经雕琢的美玉在这里，虽万镒，一镒等于二十两，万镒就指的价值连城，指的很贵重。必使玉人雕琢之，即使是非常珍贵的，未经雕琢的美玉也一定要使玉匠去雕琢它。</span></p><p><span>同样在讲术业有专攻的道理，我们放到今天也是这样的道理。比如说我想要去理发，如果我们非常重视自己的形象，那么一定会找一个专业的理发师，给我们整理头发，而不会是自己去理。所以说齐宣王如果您是重视国家的治理，那么你一定会找懂得治理国家的人，帮助你去治理，而并不是随着自己的喜好去治理国家。</span></p><p><span>所以我们可以看到古代圣明的君主，他是懂得去选择人，去选择贤才，一旦选定了贤才，你要让贤才去发挥他的作用。就像建造大的房子，你要去找工师求大木，找工匠去做这件事情。一块美玉，你要找玉人去雕琢它，这就叫术业有专攻。</span></p><p><span>但是我们反观齐宣王，他总去问治国之道，去问王道，真正到实行王道之时，开始顾左右而言他。我们讲到这里不禁要思考，在生活当中很多时候，我们自己是不是也如齐宣王是一样的？</span></p><p><span>比如说我们学习了圣贤文化，很多时候我们是挑着信的，自己有利的我们就相信。当下自己做不到的，我们觉得对自己无利的，我们就开始不相信。所以是没有办法学习好圣贤文化的，</span><span>恰恰是那些我们做不到的，才是可以真正让我们提升的。</span></p><p><span>我们再看这段话，举了两个例子，同时他也在讲一个次第一种顺序。首先告诉我们如何去选择，如果你想要建造大的房子，你要先去选择工师，然后去观察他有没有能力和智慧。选择好大的木材，通过观察你发现，他如果是能胜任的。</span></p><p><span>第二个例子来了，一块美玉一定要交给玉匠去雕琢，也就是说你选择的这个人，他要是能胜任，你是要信任于他，让他得到充分的发挥。</span></p><p><span>包括我们学习文化也是如此，我们先要慎重的去选择，我到底想要学习什么样的文化，我选择听什么样的老师的讲解？当我慎重地选择之后，我再去观察，我发现确实可以让我提升和成长。我就要选择笃信笃行，只有这个时候才会产生力量。</span></p><p><span>这里孟子对于齐宣王讲的比较隐晦，让齐宣王去听一听，孟子讲的这些道理是否是正确的？如果我们觉得是正确的，可以去观察，可以找一件事情去验证，看看他讲的是否有道理。如果经过你的观察，他讲的是有道理的，那么你就要信任和听从，才可能发挥力量。</span></p><p><span>我们之前讲过齐景公与晏子的故事，为什么可以彼此成就，有明君良相呢？是因为齐景公无论从大的国事，还是小的事情，他都愿意听从晏子的话，所以两个人才能共同地去治理好一个国家。</span></p><p><span>包括我们去读历史也是如此，我们看那些明君和一个良臣，两个人之间一定是彼此信任的。这位君主一定是对良相言听计从的，所以才能彼此成就，互相配合，治理好一个国家。所以我们在生活当中，一定要学会这个道理，这是用人之道。如果我们不懂得去选择，不懂得慎重地去观察，不懂得信任一个人才，他是没有办法在你这里发挥足够的力量。</span></p><p><span><strong>至于治国家，则曰：姑舍女所学而从我。</strong><strong>则何以异于教玉人雕琢玉哉？</strong>孟子通过这两个例子给齐宣王讲了一个道理，首先通过建造大的房子，你要懂得选择人才。去观察他是否有能力建造好房子，是否能胜任。如果他有能力胜任，我们要选择信任，把专业的事情交给专业的人去做。</span></p><p><span>举完了例子以后开始讲，为什么到治理国家这件事情，您要让对方放弃自己的专业和想法，而按照您的想法去做事情呢？这何异于你去教给玉匠去雕琢美玉呢？雕琢美玉这件事情是玉匠的专业；建造房子这件事情是工师的专业。</span></p><p><span>治理国家这件事情，你要选定人才，交给这些人才去做。而不是听从齐宣王您自己的想法，所以我们可以看到，古代圣明的君主他都懂得识才，对于带兵打仗这件事情交给武将去做，治理国家这件事情交给文臣去做，这个时候彼此才能更好地去配合，治理好一个国家。</span></p><p><span>但是显然齐宣王做事情，都是按照自己的喜好去做事情，是我想怎么样就怎么样，这是错误的想法。我们现在如果你想带好一个团队，治理好一个企业，同样的道理，在每个岗位上我们要找到或者培养专业的人才，让他们去做具体的事情，这个公司才会正常的运转。</span></p><p><span>讲到这里，我们再来做一个总结，首先我们要学会择人，择人之后要学会观察，一旦选定一个人我们要选择信任和听从，但是我们择人的前提是我们对这件事情是否足够的重视？</span></p><p><span>以我们刚才的例子来讲，如果我非常重视我的形象，非常重视我的发型，就会精挑细选，选择一个什么样的理发师，选择以后你要绝对的相信对方。如果我对一块美玉是很重视的，我要慎重的选择工匠，一旦选择了工匠，我要对他保持信任，这个时候才能雕琢好一块玉。</span></p><p><span>正所谓疑人不用，用人不疑。但是我们反观齐宣王，他是矛盾的，他既想要听孟子的学问，既想要学习王道，但真正要实行之时，却又找很多理由，或者顾左右而言他。所以并没有打算真正的去做，我们学习文化也是如此，要慎重地去选择，因为我们重视的是自己的一生。</span></p><p><span>当我们慎重地选择以后，要笃信笃行，如果我们不能完全地去相信，不能照着去做，你明白再多的道理，又能如何呢？如果我们身边可以有一位智者，他可以指导我们的言行，这是我们的幸运，我们要懂得去珍惜。</span></p><p><span>就像齐景公与晏子之间，晏子在指导或者说教化，或者说总是指出齐景公身上的问题。齐景公懂得去改正，所以两个人才会相互成就。我们去看古代的帝王，通常都会有帝王师，就是因为身在局中，会有很多看不清楚的事情，很容易有喜怒哀乐，有自己喜欢的人，喜欢的事情，厌恶的人和厌恶的事情。</span></p><p><span>一旦有喜欢或者厌恶，行为就会出现偏差，行为就会不正。这个时候帝王师的作用，就是指正你的行为，因为他在局外，跟他没有关系，所以通常帝王师旁观者清，更容易看到你身上的问题。</span></p><p><span>比如我们讲过的齐景公，他想出游，这是满足自己的想法和欲望，所以晏子就会告诉他，古代圣明的先王出游，都是想着如何帮助百姓的。这个时候齐景公可以改变自己的行为，放弃了出游，而选择驻扎在郊外，给百姓以更多地帮助，这个就是修身的过程。</span></p><p><span>如果我们在家里没有良师益友，我们就要学会借助圣贤文化的力量，借助圣人的教诲，以修正我们自己的行为。如果我们学习到的知识，听而不能行，不能照着去做，明白再多的道理又有什么益处呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑩ 齐胜于燕",
    "author": "虚空先生",
    "date": "2022-08-03",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑩齐胜于燕</strong></span></p><p><strong><span>齐人伐燕，胜之。宣王问曰：“或谓寡人勿取，或谓寡人取之。以万乘之国，伐万乘之国，五旬而举之，人力不至于此。不取，必有天殃，取之何如？”</span></strong></p><p><strong><span>孟子对曰：“取之而燕民悦，则取之；古之人有行之者，武王是也。取之而燕民不悦，则勿取；古之人有行之者，文王是也。以万乘之国伐万乘之国，箪食壶浆以迎王师，岂有它哉！避水火也。如水益深，如火益热，亦运而已矣。”</span></strong></p><p><strong><span>齐人伐燕，</span></strong><span>齐国伐燕国。这件事情发生在齐宣王五年，燕国内乱，燕王哙到了晚年自己是不理国家政事的，他把国家交给国相，叫子之去打理。后来又有人对燕王哙进言说，何不效仿尧舜把天下禅让出去，而不是世袭制传给自己的太子。</span></p><p><span>后来燕王哙听信了这样的谏言，所以自比尧舜把君主之位让位于相，子之。但是有人肯定不同意的，我们去想一想什么样的人，不同意这件事情？侵害了谁的利益？自然是太子以及拥护太子的大臣，所以太子是反抗的，不同意。并且有将军也不同意，所以太子和将军之间联合开始了反叛。</span></p><p><span>但是子之是有一定的权位和能力的，很快平定了这场反叛，并且杀掉了太子，在这其中有很多百姓，为此死伤无数，所以在燕国有这样的内乱发生，所以齐宣王发兵讨伐了燕国。</span></p><p><strong><span>胜之。</span></strong><span>当然很容易胜利的，为什么会很容易胜利？因为燕国的百姓是开心的，是高兴的，是希望齐国的军队进来。可以让百姓从这种苦难当中解脱出来，所以当齐国的军队来到燕国很多人放弃了反抗，并且打开城门，迎接齐国的军队进入燕国。发生了这件事情以后，齐宣王问孟子，我们看看齐宣王是如何问的？</span></p><p><strong><span>宣王问曰：或谓寡人勿取，或谓寡人取之。</span></strong><span>在齐国攻伐燕国之前，有人建议齐宣王，不要去攻伐燕国；而有的人则建言建议，齐宣王去攻伐燕国，这里我们要有一个思考，无论我们做任何一件事情，都会有人同意，有人不同意。</span></p><p><span>举个例子，我们想换一个工作，有的人会支持你，同意；有的人不支持你，反对；比如说我们想要出去旅行，有的人支持你，有的人不赞同你。比如说我们想买一个房子，我们想做一个生意，乃至于孩子要报什么样的专业，都会有人支持，有人反对。</span></p><p><span>因为每个人的观点不同，每个人的性格不同，每个人的出发点不同，涉及到的利益各不相同，</span></p><p><span>我们到底该如何取舍，如何去抉择？我们先把问题放在这里。我们看齐宣王与孟子之间的对话，最后我们再去揭开谜底。</span></p><p><span>我们看看圣贤是如何取舍和选择的？后来齐宣王自然是听从了，想让攻伐燕国，这样人的意见。因为齐宣王自己是想要去攻伐燕国的，所以齐人伐燕，并且取得了最后的胜利。</span></p><p><strong><span>以万乘之国伐万乘之国。</span></strong><span>这里摆出一个客观事实的存在，齐国和燕国都是万乘之国，也就是军事力量，同样的强大。</span></p><p><strong><span>五旬而举之，人力不至于此。</span></strong><span>一旬等于十日，五旬就是五十日，同样两个军事相等的国家，齐国征伐燕国，五十日就攻克取得了胜利，齐宣王讲这不是人力可以做到的。</span></p><p><strong><span>不取，必有天殃，取之何如？</span></strong><span>我们看齐宣王的想法，为什么可以五十日攻克燕国，这不是人力可以做到的，一定是天意，我们看齐宣王是有得意的成分在其中的，他想要炫耀自己的战绩，而且想要去表达命该如此，这是天命所归。</span></p><p><span>所以才会讲，这是老天让我做的事情，如果不取，必有天殃。如果天命于此，我都不去攻取，</span><span>那么老天一定会降下灾难的。取之何如？我取的怎么样？言下之意，是想让孟子赞同他的想法，并且告诉孟子，他这么做是正确的，此乃天命所归，这是齐宣王的想法。</span></p><p><span>但是从这段故事当中，我们不妨看得再深刻一点，为什么齐国可以五十天攻克燕国？是因为燕国正在内乱，是因为百姓民心所向，希望齐国的军队可以进来，解救百姓的苦难，所以很多人并没有抵抗，主动地打开城门，迎接齐国的军队。所以才可以如此地顺利，我们看孟子是怎么看待这件事情的？</span></p><p><strong><span>孟子对曰：取之而燕民悦，则取之。</span></strong><span>如果我们攻取燕国，燕国的百姓是喜悦的，是高兴的，</span><span>则取之。</span></p><p><strong><span>古之人有行之者，武王是也。</span></strong><span>说古代有人这样去做，此乃周武王是也。武王为何伐纣可以取得成功，建立周朝呢？是因为商朝末期的百姓是喜悦的，是开心的，因为商纣王荒淫无道，</span><span>百姓生活在苦难当中，所以百姓希望武王去讨伐商纣王，建立一个新的朝代。可以让百姓更好地生活，所以说武王伐纣可以成功。</span></p><p><strong><span>取之而燕民不悦，则勿取；古之人有行之者，文王是也。</span></strong><span>如果攻取燕国，令燕国的百姓不悦，他们是不开心的，则勿取。古代也有人这样去做，周文王是也。因为在文王时期，已经占有商朝三分之二的国土，但是文王并没有起兵讨伐商纣王，为什么呢？</span></p><p><span>武王和文王的区别到底在什么地方呢？为什么武王可以伐纣，而在文王时期却不可以伐纣呢？我们要讲两个字叫做时机，我们看到武王时期，商纣王已经无道到了一定的程度，已经压迫到了最底层的百姓，所以已经民声载道。这个时候，你自然是可以去伐纣的。</span></p><p><span>但是我们看在文王时期，虽然商纣王无道，但是还并没有让所有的百姓抵抗的程度。所以文王宁愿自己赴死，也并没有起兵，可是商纣王杀害了周文王以后，这个时候周国的百姓人人自危，连文王作为君主都可以去杀害，难道周国的百姓可以去幸免吗？</span></p><p><span>所以在这种情况下，周国的百姓才会群起反抗，拥护武王，取而代之。但是在文王未死之前，</span><span>百姓的生活并没有受到迫害，并没有危机感，所以支持的力量，就不会有那么强大。可是文王被杀害以后，到了武王时期，商纣王更加无道，他已经不光是杀害了文王，并且杀害了身边的很多忠臣。</span></p><p><span>而底层的百姓都想要反抗，这个时候时机才是成熟的，就是孟子所讲的民悦，百姓都是希望</span><span>武王去伐纣的取而代之。我们这里再讲到齐宣王，也是如此，之所以五十日的时间，就可以攻克取得成功，是因为燕国的百姓，生活在水深火热之中。</span></p><p><span>他们是希望齐国得以胜利的，故而才可以轻易地获得成功，并不是齐宣王所讲的天意、天命所归，只是找到了合适的时机而已。</span></p><p><strong><span>以万乘之国伐万乘之国，箪食壶浆以迎王师，岂有它哉！</span></strong><span>齐国以万乘之国征伐，同样是万乘之国的燕国，食指的是饭菜食物，箪指的是盛饭菜的竹筐，浆是用米熬成的，壶用来盛酒。</span><span>我们看燕国的百姓，准备好了酒菜以迎王师。岂有它哉，我们看岂有它哉，是在讲欢迎齐国的到来，因为他们生活在苦难之中。燕国的内乱已经波及到了很多百姓，所以他们迎接齐国进来，岂有它哉，是想解救这些百姓的生活，故而才会欢迎。</span></p><p><strong><span>避水火也。如水益深，如火益热，亦运而已矣。</span></strong><span>岂有它哉，欢迎齐国就是为了避水火，避这些百姓生活在苦难之中，可是如果齐国的军队进来以后，让水变得更加深，火更加热，亦运而已矣。运指的是不再指望，是要逃避和对抗的。</span></p><p><span>所以我们再来看整个这一段话，齐国之所以取得胜利，在孟子看来很简单。因为燕国的百姓需要，所以打开城门，欢迎齐国的军队进来，但是如果齐国的军队进来以后，让水更加深火更加热，那么百姓将要不再指望齐国，而是群起而对抗。</span></p><p><span>这个故事还有结尾，我们去想一想，齐宣王为什么要去攻伐燕国？是像孟子所讲或者像文王和武王的想法吗？攻伐燕国是想解救于燕国的百姓于水火之中，显然不是，而齐国的想法是想灭掉燕国，所以他是抱着自己的私心而去的，后来遭到了燕国的疯狂报复。</span></p><p><span>燕国在平息了自己国家的内乱以后，燕昭王时期隐忍几十年，招贤纳士，后来联合了其他的诸侯国，以乐毅为将，攻占齐国七十二座城池。后来齐国在田单的指挥之下，虽然恢复了齐国的全境，但是由此齐国由盛转衰，从一流的国家变成了二流的国家，军事力量不再强大。</span></p><p><span>这件事情的结果，不就是因为当时攻伐燕国之时，并不是为了民悦，而是为了自己的私心，所以最后的结果也就导致了齐国的衰落。我们再看这句话，核心就讲了一个关键点，当我们去做一件事情，该如何取或者舍呢？</span></p><p><span>我们回到最开始留下的问题，圣贤看来非常的简单干净，如何去做取舍？就看是否是民悦的，他人是否是开心的，是否是高兴的？如果这件事情，可以让别人得到利益，可以让别人更开心，那么就可以去做。</span></p><p><span>我们举个例子，比如说孩子在高考以后，我到底该选择上什么样的大学？或者选择去未来走什么样的路，我们该如何取舍？</span></p><p><span>我们先讲一种关系，孩子从出生开始，跟父母之间的关系是什么样子的呢？是不是我们要懂得付出给孩子，要给予，给孩子更多，而且是无条件的付出和爱，孩子到了他长大成人，到了后半生，再给我们去回馈，所以也就是在这个阶段，我们还是要付出给孩子的。</span></p><p><span>我们这个时候该如何去做选择？孩子高兴、对他是有好处的就可以了，但是我们生活当中往往不是这样的，我们有很多的纠结和矛盾。举个例子，我让他去一个好的学校，我会不会经济压力有点大，我会不会供不上。</span></p><p><span>如果我给他去选择了一个好的工作，我们托关系花钱，最后如果他工作的不好怎么办呢？是不是我要浪费了很多钱财等等，这都是我们生活当中的矛盾和纠结的地方。但是如果我们用圣贤的思维，很简单，这件事情对孩子是否是有利的，他是否是喜悦的？如果是，我们尽力</span><span>而为之就可以。</span></p><p><span>我们再举一个其他的例子，比如说我们做生意，现在说天气比较热，我到底该不该开空调呢？</span><span>特别简单，去看对你的顾客是否有好处，顾客是否是喜悦的开心的？如果对顾客是有好处的，那么这件事情，你就可以去做了。</span></p><p><span>再比如说，我们的产品是否要涨价？就去思考，涨价以后对顾客是否是好的，我们的消费者是否可以接受，如果消费者可以接受，那么这件事情就去做，如果不可以接受就不要去做。</span><span>还有一个客观的原因，如果是我们的原材料，在不停地上涨，我相信顾客是可以理解的。</span></p><p><span>但是要是无故涨价，令我们的消费者和他人不满意，那么这个时候，生意一定是没有办法持续下去的。所以我们从这段话当中，要学会一个道理和如何去抉择，当我们人生当中发生一些事情，不知道该如何取舍和选择之时，就去想我要是选择了这件事情，是否可以令他人高兴喜悦，是否可以利益到他人？</span></p><p><span>如果可以利益到他人，那么就可以去做，所以我们称之为这样的想法，叫简单干净，何为简单？没有那么多复杂的事情，只要对他人有益就可以去做。何为干净？没有那么多纷扰在其中，我不会去纠结担心，考虑更多的其他因素，没有任何的杂染，只要是利益他人的事情，我就可以去做。</span></p><p><span>比如说武王伐纣，只要是对百姓有利的，那就可以去伐纣。比如说齐国伐燕，只要是燕国的百姓开心喜悦，那么我就可以去伐燕。军队从那个地方撤离，并不会给那个地方的百姓，带去很多的麻烦和侵占，如此就可以得善终。</span></p><p><span>可是如果齐国的军队去了以后，想要去侵占或者并没有救百姓于水火之中，那么百姓一定要群起而对抗的，这个时候得不偿失，我们在生活当中，也要学会简单干净的思维。</span></p><p><span>举个例子，比如说朋友需要我帮助，我去朋友家里帮忙，帮忙以后，我不会有任何要求对方的回报和索取的心，甚至我不需要他的感谢，不给对方带来一丝的麻烦，转身离开。这个时候别人就是喜悦的，可是如果我们帮了对方以后，不停地去给他添麻烦，本来我们是帮助他的最后，会令人反感和厌恶。</span></p><p><span>我们在生活当中的付出，也是如此。说我们想要对一个人付出，我就对他付出，付出以后转身离开，绝不给对方添麻烦，这就是简单，干净，民悦，所以我们学会了这种思维，在生活当中大大小小的事情都如此，如何去做抉择，对他人有益的可以帮助到他人的，也就是民悦。</span></p><p><span>帮助了他人以后，我们的想法简单干净，转身离开，不掺杂任何其他的索取和想法，这个时候别人自然是开心的，也没有给别人带去烦恼和麻烦。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑪-1 齐宣王之畏",
    "author": "虚空先生",
    "date": "2022-08-03",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑪-1 齐宣王之畏</strong></span></p><p><strong><span>齐人伐燕，取之。诸侯将谋救燕。宣王曰：“诸侯多谋伐寡人者，何以待之？”</span></strong></p><p><strong><span>孟子对曰：“臣闻七十里为政于天下者，汤是也。未闻以千里畏人者也。《书》曰：‘汤一征，自葛始，天下信之。东面而征，西夷怨，南面而征，北狄怨；曰：奚为后我？民望之，若大旱之望云霓也。归市者不止，耕者不变。诛其君而吊其民，若时雨降，民大悦。’”</span></strong></p><p><strong><span>齐人伐燕，取之。</span></strong><span>我们上一讲，讲到齐宣王趁燕国内乱之际，征伐燕国。取之，我们注意这两个字了，什么叫做取呢？本不该属于我的东西，我去拿，称之为取之。因为齐宣王征伐燕国，是想趁机打击燕国，是想把它占为己有，所以称之为取之。</span></p><p><span>那么本不该属于自己的东西，我们想要去占有，去取之，就会带来隐患。我们看接下来，给齐国带来了什么样的隐患？</span></p><p><strong><span>诸侯将谋救燕。</span></strong><span>问题发生了，其他的诸侯国都想去救燕国，救燕国也就意味着联合对抗齐国，其他的诸侯国，不会看着齐国把燕国的土地、人民以及国之重器占为己有。所以联合起来，</span></p><p><span>想要去攻打对付齐国，我们可以看到这个时候，齐宣王是有害怕的心理，他是有所担心的，故而才会问孟子。</span></p><p><strong><span>宣王曰：诸侯多谋伐寡人者，何以待之？</span></strong><span>说诸侯多数都想要讨伐于我，何以待之？我要怎么去办？我要做些什么事情，才能停止让这些诸侯，谋划商量着对策，想要攻打和对付我齐国，所以我们整个看这一小段话，孟子其实已经讲出了问题的关键之所在。</span></p><p><span>因为齐人伐燕，想要取之，所以就招致了其他诸侯，想要去征伐齐国。如何才能解决当下的困境呢？我们在生活当中也是一样的，当我们想要去占有别人的东西，想要取之，就一定会招致别人的对抗。</span></p><p><span>我们如何才能消除这种对抗？就是我们把占有的东西还回去，不要有非分之想。接下来孟子又开始举例子，举的例子是商汤，用商汤的故事，和齐宣王做一个鲜明的对比。</span></p><p><strong><span>孟子对曰：臣闻七十里为政于天下者，汤是也。</span></strong><span>孟子讲，臣听说一件事情，商汤只有土地七十里，却可以称王于天下。</span></p><p><strong><span>未闻以千里畏人者也。</span></strong><span>但是我没听说过，拥有方圆千里的土地，却畏惧于他人。我们这里要看到了，难道孟子真的没有听说过，纵横方圆千里土地，而惧人者吗？并不是。这句话是要引出接下来的重点，首先形成了一个对比，商汤拥有土地只有七十里，却可以称王于天下，无所畏惧。</span></p><p><span>而今天的齐国，齐宣王拥有纵横方圆千里的土地，却惧怕别人的攻打和征伐，为什么会怕？他们之间的区别到底是什么？我们看《尚书》当中是如何讲的，</span></p><p><strong><span>《书》曰：汤一征自葛始，天下信之。</span></strong><span> 来自于《尚书》，商汤讨伐夏桀，夏朝的最后一位君主桀无道，所以商汤讨伐，但是并没有杀夏桀，而是流放到荒芜之地。这个时候商汤是于心不忍的，所以有人去劝导商汤，因而作了这篇《尚书》。</span></p><p><span>我们看看《尚书》的内容，汤一征，自葛始。说商汤征战天下，从葛国开始。我们在之前讲过，商汤与葛国之间的事情，葛国的国君叫葛伯。葛伯这个人是贪婪无道的，并且不祭祀。</span><span>所以商汤就派人去问葛伯，你为何不祭祀？</span></p><p><span>葛伯说，我没有牛羊，要如何祭祀呢？这个时候商汤就派人送去了牛羊，让葛伯去祭祀。但是葛伯却把商汤送来的牛羊，分而食之，宴请了自己的大臣。这个时候商汤又派人来问，你说没有牛羊，我送来了牛羊，为何你还是不祭祀，而是把它吃掉？</span></p><p><span>葛伯讲，我这里的人都没有吃的，有了牛和羊，我怎么能去祭祀？我要把它吃掉。这个时候汤又派人去了葛国，去帮葛国的农民百姓种粮食，并且自己的国人送食物，给这些帮助葛国的人，去吃和用，不麻烦葛国的百姓。</span></p><p><span>因此很多百姓和其他诸侯国的人，都去赞叹商汤的行为。赞叹汤，自然葛伯是不高兴的，所以派人杀了送粮食，送食物的人，并且其中还有孩子。这个时候商汤大怒，起兵攻打葛国，所以说汤一征，自葛始。</span></p><p><span>商汤的征战是从葛国开始的，但是征服了葛国之后，百姓比以前过得更好，更幸福。所以说天下信之，天下之人是信任商汤的，因为他取之，他去攻打葛国，并不是为了自己，而是为了百姓，可以过上更好的生活。百姓是期盼着商汤，来攻打自己的国家的，期盼到了什么程度呢？</span></p><p><strong><span>东面而征，西夷怨，南面而征，北狄怨。</span></strong><span>说商汤去征伐东面，西夷是抱怨的；征伐南面，北狄是抱怨的。</span></p><p><strong><span>曰：奚为后我？</span></strong><span>我们看很有意思，为什么抱怨呢？抱怨为什么把我们放在后面，我们看到百姓这种期盼的心情，就说明他们当下过的不幸福。衣食是没有办法得到满足的，是生活在水深火热之中的。所以期盼商汤先来征伐我们这里，因为征伐了我们这里，我们就可以因此而得救。</span></p><p><span>就像葛国的百姓一样，因为商汤攻打了葛国以后，开始爱民保民，让百姓过上更好的生活。所以其他地方的百姓也是期盼的，为什么要把我们放在后面？要先来攻打我们才对。</span></p><p><strong><span>民望之，若大旱之望云霓也。</span></strong><span>说百姓是盼望的，期盼的，就像大旱的天气盼着云霓是一样的。何为云和霓？云是下雨之前的乌云，霓是下雨之后的霓虹，也就是我们讲的彩虹。</span></p><p><span>云和霓代表着下雨，大雨要来了，因为是大旱的天气，下雨之前的乌云，代表着期盼的心情，我在等待。那么下雨之后出现的霓虹，是代表雨后阳光喜悦的心情，就像大旱的天气，盼望着下雨一样，</span></p><p><span>盼望商汤的到来。</span></p><p><strong><span>归市者不止，耕者不变。</span></strong><span>归市者指的是商人，商人去市场上经商，是不会停止的。耕者不变，</span><span>百姓并不影响耕地。我们看这句话是什么意思呢？说明并没有爆发大规模的战争，商汤就可以征伐整个天下。最后打败夏桀建立了商朝，为何会如此？</span></p><p><span>我们可以看到百姓都没有反抗，所以商人可以继续经商，耕者可以继续耕地。就说明那个时候的诸侯也好，天子也好，都是无道的。所以百姓并不愿意保卫自己的家园，反而希望商汤可以征战这里，这是民心所向。</span></p><p><span>因为大家生活得都不幸福，那么他们是盼望有人，可以来征战他们的国家，让他们过上更好的生活，所以说商人和百姓还过着平常的日子，并没有受到影响。</span></p><p><strong><span>诛其君而吊其民。</span></strong><span>吊是抚慰的意思，商汤征伐每一个诸侯国，只是诛杀他们无道的君主，但是抚慰那里的百姓。</span></p><p><strong><span>若时雨降，民大悦。</span></strong><span>就好像是及时雨来到，百姓是很开心的，大悦。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑪-2 齐取于燕",
    "author": "虚空先生",
    "date": "2022-08-03",
    "html": "<div class=\"B1_text\"><p><strong><span>梁惠王下⑪-2 齐取于燕</span></strong></p><p><strong><span>《书》曰：‘徯我后，后来其苏。’“今燕虐其民，王往而征之，民以为将拯己于水火之中也，箪食壶浆以迎王师。若杀其父兄，系累其子弟，毁其宗庙，迁其重器，如之何其可也？天下固畏齐之彊也，今又倍地而不行仁政，是动天下之兵也。王速出令，反其旄倪，止其重器，谋于燕众，置君而后去之；则犹可及止也。”</span></strong></p><p><strong><span>《书》曰：徯我后，后来其苏。</span></strong><span>徯是等待，后是君主，等待我们的君主。君主来到了以后，</span><span>我们是可以苏醒，可以重生的，可以醒过来。我们看苏字很重要，它代表着苏醒和重生。他们等待商汤的到来，在心里早已经把商汤，当成他们的君主，所以盼望着我们君主的到来。因为君主到来，我们可以获得重生，我们燃起了对生活的希望。</span></p><p><span>所以商汤可以用七十里而征战天下，无所畏惧，因为这是民心所向。大家生活在水深火热之中，商汤的出征是救民于水火，是利益他人帮助他人的，又有何畏惧呢？我们反观齐宣王，为什么会害怕？即使有纵横方圆千里的土地，依然是害怕和担忧的。</span></p><p><span>因为它是要取之，是想要趁乱攻伐燕国，打击燕国，想要据为己有，所以他害怕燕民起来反抗，害怕其他的诸侯国共同伐之。所以我们可以看到，当我们是为别人着想的，为百姓着想的，就无所畏惧。如果是取之，想要占为己有的，就会去害怕。</span></p><p><span>我们这里要做一些延伸，想一想我们生活当中，为什么会害怕？当我们害怕之时，就说明我们于心有愧，做了亏心之事，所以才害怕。我们自己该做的事情没有做好，我们的出发点都是自私自利的，这个时候就会产生担忧和害怕。</span></p><p><span>比如说我们发了财，但是如果是不义之财，我们就会害怕。再比如说，我们工作没有做好，我们内心是有愧的，这个时候我们就害怕领导的问起。再比如说在感情当中，我害怕对方离开，是因为我们知道自己做的不够好。</span></p><p><span>再比如说，我们害怕孩子不孝顺，是我们知道我们自己做的不够，做的不足。因而就会去害怕，所以我们看齐宣王的心理，他知道自己这样做，是不正确的，也知道自己的私心贪欲之所在。当其他的诸侯想要谋共同伐齐，这个时候开始担忧和害怕。</span></p><p><span>所以孟子告诉齐宣王，要想不害怕，我先给您举个例子。先讲商汤的故事，因为他没有私心，并且自己努力而为之，征战了整个天下，并且打败了夏桀，也没有杀夏桀是流放，并且还是于心不忍的。</span></p><p><span>所以有人为了开导汤，就作了这篇《尚书》。我们看商汤的心理，他是想帮助天下百姓的，</span><span>从一开始就没有想去攻打葛国，而是不停地派自己国家的人，去帮助葛国。但是发现葛国屡教不改，无论怎么去帮助他，甚至他还要杀害孩子，让百姓都生活在痛苦当中，所以起而伐之。</span></p><p><span>后来其他地方的百姓，都盼着汤的到来，才去征伐了整个天下。我们再看齐宣王的心理，他是正好相反的。我们也要从中学习到，当我们生活当中有所忧虑，有所害怕，我们就去问问自己，是否问心有愧，是不是明知道当下做的事情不该去做呢？</span></p><p><span>如果我们懂得调整自己，那么你就不会担忧和害怕。孟子举了商汤的事情，接下来又讲了，</span></p><p><span>齐国和燕国的现状，因而就形成了强烈的对比。我们看燕民现在是什么样子的？</span></p><p><strong><span>今燕虐其民，王往而征之，民以为将拯己于水火之中也，箪食壶浆以迎王师。</span></strong><span>孟子说燕虐其民，说今天的燕国虐待自己的百姓，因为燕国发生了内乱，百姓因此死伤无数，所以说这个时候百姓，是生活在水深火热之中的。</span></p><p><strong><span>王往而征之。</span></strong><span>这个时候齐宣王您去征伐燕国，民以为将拯己于水火之中，燕国的百姓以为您是想要去将他们，拯救出现在的水深火热之中，所以准备了好酒好菜，以迎王师。可是齐宣王的心里并不是这个样子的，只不过孟子并没有直接点破，实际情况是什么样子的呢？孟子还是用如果和假设来讲的。</span></p><p><strong><span>若杀其父兄，系累其子弟。</span></strong><span>系累就是连累的意思，囚禁的意思。如果您杀了他们的父兄</span><span>并且连累了他们的子弟。</span></p><p><strong><span>毁其宗庙，迁其重器。</span></strong><span>毁掉了他们的宗庙，迁就是搬走了，搬走了他们的国之重器。何为国之重器？就是以前的礼器，以前的礼器包含了圭、壁、琮、鼎，圭我们在电视当中常常看到，</span><span>就是上朝之时拿在手里的玉圭。</span></p><p><span>壁也是一种玉，是祭祀的时候所用，它代表的是可以通天的。还有琮和鼎，这都是国之重器。而如果你搬走了他们的国之重器，百姓自然是不愿意的。</span></p><p><strong><span>如之何其可也？</span></strong><span>这样怎么可以？我们再来看看现状是什么样子的，本来燕国因为内乱，让百姓生活在水深火热之中，这个时候齐宣王出兵而征之。百姓以为齐宣王是来拯救他们的，所以准备了好酒好菜，迎接齐宣王的到来，迎接齐国的军队。</span></p><p><span>可是齐国的军队到了这里以后，如果杀害他们的父兄，连累他们的子弟，毁掉他们的宗庙，</span><span>迁走他们国家的重器，这样怎么可以？一定会招致燕国百姓的对抗，一定会招致其他诸侯国</span><span>共同讨伐。</span></p><p><strong><span>天下固畏齐之彊也。</span></strong><span>固是本来的意思，天下本来就畏惧齐国的强大。</span></p><p><strong><span>今又倍地而不行仁政。</span></strong><span>倍是加倍的意思，今天齐国又想占领燕国，把自己的疆土扩大一倍，但是又不行仁政。</span></p><p><strong><span>是动天下之兵也。</span></strong><span>这不是招致天下的兵马而来吗？奔着齐国而来，我们可以看到天下，本来就畏惧齐国的强大。而今又把疆土扩大了一倍，但是又不行王政，不行仁政，百姓又不支持。</span><span>这不招致天下的百姓对抗，招致其他的诸侯国，群起而攻之吗？</span></p><p><span>孟子讲了燕国和齐国现在的现状，面对的问题，接下来又给了具体的方法，告诉齐宣王如何才能止住这场祸事呢？</span></p><p><strong><span>王速出令。</span></strong><span>大王您要速速的出令，一刻都不能耽搁。</span></p><p><strong><span>反其旄倪，止其重器。</span></strong><span>旄指的是老人，倪指的是孩子。送返燕国的老人和孩子，停止搬运燕国的重器，不能拿人家国之重器，甚至不能拿人家的财宝。</span></p><p><strong><span>谋于燕众，置君而后去之。</span></strong><span>谋于燕众，和燕国的百姓，和燕国的重臣去商量。商量什么事情呢？置君而后去之，置是选立和择立的意思，和燕国的大臣百姓商量，择立一位君主，燕国的君主，而后带着齐国的军队撤离，离开这里。</span></p><p><span>这个时候就变成了我们齐国征伐燕国，帮他们选立了君主。而后我们一无所取，带着军队离开这里，就变成了帮助燕国，而不是占有和取之。</span></p><p><strong><span>则犹可及止也。</span></strong><span>如此才可以止住这场祸事，止住其他的国家，共同来讨伐齐国。在战国那个时期，有战国七雄，齐、楚、燕、韩、赵、魏、秦，这七个诸侯国都很强大，都想着互相攻打，互相征伐，但是需要合理的借口，和出兵的正当理由。</span></p><p><span>那么齐国这个时候攻打了燕国，想要占有燕国，就给了其他诸侯国，群起而攻之的借口和理由。所以这个时候，如果不及时撤兵，一定会招致大家共同的讨伐，因为齐国本来就强大，其他人已经开始畏惧。</span></p><p><span>所以这个时候，孟子告诉齐宣王及时撤兵，及时止住祸患。并且最重要的是施仁政，如果你去施仁政，天下的百姓就会期盼齐宣王的到来，就像期盼商汤是一样的，否则一定会招致隐患。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑪-3 舍利取义",
    "author": "虚空先生",
    "date": "2022-08-04",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》52梁惠王下⑪-3舍利取义</span></strong></p><p><span>我们再来回顾，齐宣王与孟子之间的对话，齐宣王是想问孟子，如何解决当下的困境？因为齐国趁着燕国内乱，而去伐燕，导致其他诸侯国想要联合起来，共同征伐齐国。这个时候齐宣王是害怕的，因为齐国无论再如何强大，也抵挡不住多国联合。</span></p><p><span>齐宣王是想让孟子出主意，用什么样的谋略可以解决当下的困境？但是我们学习孟子的思维到现在，我们可以发现孟子思维的一个特点，他不会出谋划策告诉齐宣王，怎么解决当下的问题，而是从源头，从根本上去解决问题。</span></p><p><span>根本上他是告诉齐宣王，你做的这件事情出发点就是错误的，不应该为了利去做事情，而应该为了义去做事情。如果能像《尚书》当中所举的例子，如商汤一样去做事情，他是从义的角度出发，是想着如何给予和帮助更多的百姓，救百姓于水火之中，这个称之为义。</span></p><p><span>当你为了义去做事情，就不会有现在的这些隐患。而你为了利去做事情，找到可乘之机，最后你是想要有所得的。虽然平定了燕国的内乱，但是杀其父兄，连累其子弟，毁其宗庙，迁其重器，这些都是为了利，都是你想要得到更多，你想要占有，想要去获取。当你为利去做事情就会留下很多的隐患。</span></p><p><span>我们延伸到生活当中也是如此，比如说我们做生意，如果只图利就会给自己带来很多隐患，并且不长久。无论我们做什么生意，如果你总想牟取暴利，赚客户很多利润，这个时候客户一旦知道了，从你这里买的产品是贵的，是高于别人所给的价格的，下次他就不会再来。</span></p><p><span>我们看似当下得了利，但是从长久来看，一定是埋下了隐患，就像文中的齐宣王虽然这次征伐燕国得了利，可是后来遭到了燕国燕昭王和其他诸侯国的联合，从此以后齐国变得衰落。所以我们生活当中，切记要懂得从源头上去解决问题，不要从利的角度去出发。</span></p><p><span>再比如说，我们谈感情也是一样，如果跟对方在一起之时，就是有所图的，也就是为了利，看似当下好像会得到一些东西，得到对方的关注。可是从长久来看，一旦被别人知道，我们是为了利的，而且也无法隐藏、无所遁形，从我们的思维和行为上，一定可以看到内心到底是怎么想的，最后的结果是得不偿失。</span></p><p><span>可能我们想要得的利，还会失去，并且还会比之前变得更加不堪，可能会失去的更多。所以孟子告诉齐宣王，举了个例子，说商汤那个时候是如何取得天下，他不是在取，而是用义的方式去帮助别人更多，所以可以取之，不取而取。</span></p><p><span>而现在的这种情况，齐国是从利出发，是想要取得更多，想要占有，就会埋下现在的隐患，那要想从根本上去解决，就要扭转自己过去的思维，从出发点开始就要及时的调整。我们要以此为借鉴，在生活当中无论是感情、事业、工作、生意、与人相处都一样，要从义的角度去出发，也就回到了我们开篇所讲的，义利之辩。</span></p><p><span>一个人如果懂得从义出发，我不会亏欠别人，但是别人却可以亏欠于我，当我们亏欠于别人，就会招致别人的征伐，比如说在现实生活当中，如果我们总是亏欠他人的，别人就会到处去说我们的不好，说我们的不足，并且一旦找到合适的机会，就会反过来报复我们。</span></p><p><span>所以说亏欠别人一定会埋下很多的隐患，只不过他从什么情况下，在什么事件，什么时间，什么地点，会爆发出来。我们去亏欠别人，就等于给自己埋下了祸患，从义的角度出发，对别人都是无所亏欠的，但是别人可以亏欠于我们，我们是问心无愧的。</span></p><p><span>这个时候，我们的生活会变得坦然，不会有那么多的隐患。义利之辩，我们讲最好从义出发，不要从利出发，但是已经发生的情况怎么办？比如说齐宣王现在事情的结果，已经发展到了现在，其他的诸侯国，是要联合起来征伐齐国的。那事情已然如此，该怎么去解决？</span></p><p><span>孟子给的方法是及时止损，所以告诉齐宣王快速地下令，返还老人和孩子，停止搬运燕国的重器，并且帮助他们择立新君，而后撤军，也就是把已经拿的还回去，才是及时止损的，最有效的方法。</span></p><p><span>想一想我们在生活当中，是不是如此？当我们拿了别人的东西，已经发现了，这个时候就要出问题，我们最好的方式，是及时把拿到的东西还回去，以此才能避免祸端。但是对齐宣王来讲是很难的，对于我们每一个人来讲都很难，为什么？</span></p><p><span>我们去想一想，生活当中我们拿到手的东西，还愿意交还回去吗？我们已经占有的东西，我们还舍得放手吗？好像我们大多数时候，是有那个贪欲在的，是有占有欲在的，我可以占有，但是让你拿出去的时候，是不舍得的，这种不舍得就会让我们承受更大的损失，承受更多地打击。</span></p><p><span>最后可能现实生活，给了我们更多地打击，我们不得不还回去，可是损失已经变得更大，所以我们讲懂得放下、懂得舍出去是一种智慧，同时需要克服我们的欲望，我们才能把已经占有的东西，已经拿到手里的，再及时的还回去。</span></p><p><span>我们不妨用孟子的这个方法来克己，如果我们因为拿的多，导致一些事情的发生，我们想要及时止损，是要把它还回去的，这个时候才会更有效地去解决问题。既然讲到了拿和给的关系，我们接下来，还要再延伸生活当中，拿和给到底该如何去平衡。</span></p><p><span>比如说商汤，他是给的，给予别人，帮助百姓，从而拥有了整个天下，他的给是纯粹的，没有所取的，没有拿。那反之我们再看齐宣王，他也给燕国的百姓以安定，因为他齐国的军队出兵，帮助燕国平定了内乱，这是给。</span></p><p><span>可是这个给并不纯粹，还更多地是拿。比如说杀其父兄、连累其子弟、毁其宗庙、迁其重器，这都是在拿。一旦你给的少，拿的多，就会招致对方的愤怒反抗。</span></p><p><span>我们举生活当中的例子，大家可以细细地去品味，两个人谈感情，刚开始我们想的多数都是给对方，我们给他爱，给他关心，给他温暖，想着给他买衣服，想着给他送花，想着给他做饭，想着给他买什么样的礼物，这个时候的给是纯粹的，所以两个人的感情会逐渐的升温。</span></p><p><span>但是给着给着，我们就开始想要去拿回来了，我们开始要求对方给我们更多的钱，要求对方给我们更多地关心，要求对方的穿着，要求对方不允许与异性交往，你看这个时候都是在拿，我们要求对方关心，我们实则是在拿，我们要求他这个不许做，那个不许为，其实也是在拿。</span></p><p><span>我们拿的比例逐渐变得越来越多，这个时候对方就要开始反感，反感到一定的程度就要开始对抗，那么两个人的感情就要走向决裂，就像齐国和燕国是一样的，就是因为给和拿的比例，拿占了大多数。</span></p><p><span>教育孩子也是如此，一开始我们对孩子的爱是无私的，都是给很纯粹，可是给着给着，不知道从什么时候开始，我们就要开始拿了，孩子要考好的成绩，这个时候让我有面子，孩子要在学校里听话，因为这样老师才会赞美家长，如果孩子考得不好，或者在学校被老师批评，我作为家长多没面子，这就是在拿。</span></p><p><span>我们对孩子的要求，开始变得越来越多，如果我们给孩子很多爱和付出还可以，可是如果我们给孩子的爱，给孩子的付出，给孩子的关心，给孩子的教育，原本就没有那么多，而我们对孩子的要求，却越来越多，这个时候拿的比例大过了给，孩子开始要产生了叛逆，产生了对抗。</span></p><p><span>他开始不相信我们所讲的话，开始不听从我们讲的话，开始和我们对抗，所以这也像是燕国和齐国之间的关系。我们在和朋友相处，我们在一个企业当中与同事相处，与员工相处，是不是同样的道理呢？</span></p><p><span>所以我们要知道，我们要懂得纯粹的去给就是义，当我们从义出发，我们去给的时候，我们就会得到更多，也就是给等于得，拿等于失，也就相当于是利。</span></p><p><span>我们去想一想，如果对于孩子，我们纯粹地给他更多关心，更多的关爱，更多的教育，我们就会得到更多，得到孩子的认同，得到孩子的孝顺，得到跟孩子之间的亲子关系。</span></p><p><span>我们夫妻感情也是如此，如果我们从义出发，多给对方而少拿。这个时候我们得到的可能是我们彼此一生的陪伴，得到的可能是对方的回报和反馈。</span></p><p><span>我们跟朋友相交也是如此，如果我们不停地去给朋友以帮助，给朋友以安定，这个时候我们得到就是长久的友情，这就是义。可是反之，如果我们给的少，却不停地想着去索取，这就是拿。</span></p><p><span>我们不停地去要求孩子，就会发现孩子逐渐地反抗，所以越是想要拿，那么失去的将越多。</span></p><p><span>比如说爱人之间也是如此，如果我们没有给他那么多，却不停地想要拿，要求他这个，要求他那个，要求他的行为，要求他的言语，要求他多关心我们，这个时候就会失去很多。比如说失去了和他之间的和谐，失去了他对我们起初的那些感情，失去的也有可能是家庭。</span></p><p><span>所以整个这篇，我们又回到事情的核心，义利之辩。我们做任何事情，都要懂得从义字去出发，纯粹的给，因此我们会得到的反而更多。</span></p><p><span>如果我们从利的角度出发，我们就想要去拿，而拿最后导致的是失，我们越想拿最后失去的就会越多。</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑫-1 出尔反尔",
    "author": "虚空先生",
    "date": "2022-08-08",
    "html": "<div class=\"B1_text\"><p><span><strong>《孟子》梁惠王下⑫-1出尔反尔</strong></span></p><p><span><strong>邹与鲁鬨。穆公问曰：“吾有司死者三十三人，而民莫之死也。诛之，则不可胜诛；不诛，则疾视其长上之死而不救。如之何则可也？”孟子对曰：“凶年讥岁君之民，老弱转乎沟壑，壮者散而之四方者，几千人矣；而君之仓廩实、府库充。有司莫以告，是上慢而残下也。曾子曰：‘戒之戒之！出乎尔者，反乎尔者也。’</strong></span></p><p><span><strong>邹与鲁鬨。</strong>邹指的是邹国；鲁指的是鲁国；以前的邹国很小，他属于鲁国的附属国，而孟子来自于邹国。邹与鲁鬨，鬨是指的争斗冲突，邹国与鲁国起了争斗，起了冲突。</span></p><p><span><strong>穆公问曰：吾有司死者三十三人，而民莫之死也。</strong>这里的穆公是邹穆公，邹国的君主；有司指的是有关部门的官员，也就是官吏；邹穆公问了孟子一个问题，说在鲁国和邹国的这场争斗之中，官吏死了三十三人，但是百姓却没有死，没有伤亡。</span></p><p><span>因为这件事情，穆公很愤怒，为何愤怒？因为没有百姓出来保护官吏，所以只有官吏去赴死，而百姓是冷漠的、漠视的、视而不见的，并没有人出来帮忙。</span></p><p><span><strong>诛之，则不可胜诛。</strong>穆公非常愤怒，想要诛杀这些百姓，但没有办法完全杀尽，百姓的数量太多。</span></p><p><span><strong>不诛，则疾视其长上之死而不救。</strong>如果不杀，这些百姓，我又很痛恨，痛恨这些百姓，亲眼看见自己的长官官吏赴死，而不去救。</span></p><p><span><strong>如之何则可也？</strong>我要怎么办呢？我们先来看穆公的思维，发生了争斗冲突这件事情，有官员三十三人被杀掉，可是百姓却没有人愿意去救，愿意去帮忙，漠视着这些长官去赴死，而不相救，因此穆公很愤怒，想要杀掉这些百姓，但是却不可胜诛，没有办法杀尽。</span></p><p><span>如果说不杀又很痛恨，很愤怒，这种愤怒不知道该如何去化解，所以就问孟子，怎么办呢？这件事情，我们先不说孟子会如何去看待这件事情，即使是学了传统文化的我们，学到现在，如果有人问了这样的问题，我们会如何去答复呢？如何去思考这件事情呢？</span></p><p><span>我们去想为什么只有官吏赴死，而百姓却选择漠视不去帮忙呢？是不是因为平时这些官吏就不爱百姓，如果是不爱百姓的，平时对百姓没有关注到，如果平时对百姓的生死是漠视的，那么当他面临危难之时，百姓当然对他是漠视的。</span></p><p><span>看看我们在生活当中，是不是这个样子？当我们遇到了困难，如果没有人愿意站出来帮助我们，为什么呢？我们有没有去想过，平时我们是否有帮助了他人？如果我们在平时并没有去帮助他人，当我们自己遇到危难之时，别人又怎么会出来帮我们？</span></p><p><span>所以我们学习了传统文化的思维，我们就知道这个问题的根本原因，出在我们自己身上，出在这些长官身上，出在君主身上，因为君主和这些长官平时并没有爱护百姓。所以百姓怎么会愿意为这些长官去赴死呢？多么简单的道理。</span></p><p><span>生活当中，当我们遇到了类似的事情，我们要知道从自身去找原因，看看我们平时的所作所为，才得到了今天的结果。我们接下来看孟子是如何回答邹穆公的。</span></p><p><span><strong>孟子对曰：凶年讥岁，君之民，老弱转乎沟壑。</strong>当遇到荒年，百姓吃不上饭的时候，君之民，说穆公您的百姓老弱转乎沟壑。老者和那些弱者，转是从这里到那里，沟就是路边的，或者山边的一些沟、水沟、山沟等等。</span></p><p><span>转乎沟壑指的是饿死的尸体，转什么呢？弃尸啊，每到荒年的时候，老弱是饿死的，并且被弃尸在沟壑之中。我们可以想象一下这样的场景，荒年的时候，穆公您自己又做了些什么？您的百姓，那些老者和弱者，都已经被弃尸在山野和沟壑之中了。</span></p><p><span><strong>壮者散而之四方者，几千人矣。</strong>老弱是被弃尸在沟壑之中的，而壮者已经四方逃难去了，数千人都是生活在这样的环境当中的。我们现在听上去数千人，好像也没有多少人，别忘了那个时期人本来就少，数千人这已经是很大的数目。并且邹国本身就是一个小的国家，所以达到千人数量，已经是很庞大的数目了。</span></p><p><span><strong>而君之仓廩实、府库充。</strong>可是反观穆公，您仓廩实，您的仓库是堆满了粮食的。府库充，您的财宝财物是充足的。</span></p><p><span><strong>有司莫以告。</strong>有司是指的官吏，有关部门，但是却没有去上报这些事情，已经有那么多百姓被弃尸在沟壑之中，壮者都已经四处逃难，百姓民不聊生，可是君主您自己的粮仓是充足的，财宝是充足的，而百姓的这些情况却没有向上去汇报。</span></p><p><span>我们这里要去思考，为什么没有向上去汇报到君主那里呢？是因为君主对这些事情就漠不关心，一位君主关注什么事情，下面的官员自然就会去关心什么事情。说明他一定是报过的，但是君主对这些事情是漠视的，是弃百姓于不顾的，并没有去关心和爱护百姓，所以下面的官员，当然就不会去汇报这些事情。</span></p><p><span>我们把它用到现在，也是一样的道理，比如说：如果我们是做企业的领导，我们关注什么事情，下面的领导层就会关心什么事情，如果我们不去关心的事情，我们的关注点没有放在这个上面，我们下面的员工自然就不会去在意这些事情。</span></p><p><span>比如说做领导的人，如果在乎是否服务好顾客，是否给顾客提供了帮助，我们的领导层和员工自然会关心这些问题。如果我们不去关注，我们不在意，那么领导层和员工当然是不在意的。我们看根本的问题，还是出在穆公自己身上。因为他不去在意这些事情，所以有关的官吏就没有去上报这些事情。</span></p><p><span><strong>是上慢而残下也。</strong>上慢指的是处上位的人是怠慢的。而残下也，这是在残害处下位的百姓。</span></p><p><span><strong>曾子曰：戒之戒之！出乎尔者，反乎尔者也。</strong>这里孟子引用了曾子的话，说谨慎啊！谨慎啊！从你这里出去的，还会返回到你这里来，所以这句话在给穆公作总结，为何百姓漠视长官，在冲突当中死亡却没有去救呢？百姓也选择了漠视，这就是出尔反尔。</span></p><p><span>因为平时君主和这些官吏，就是这样对待百姓的，所以今天百姓，就选择了这样的方式返回去。我们经常讲一句话叫爱出者爱返，当我们去关心别人，就会有别人来关心我们；当我们去爱别人，就会有别人来爱我们；当我们讨厌别人之时，别人也正好在讨厌着我们。</span></p><p><span>比如说，当我们去讨厌一个人，从我们的表情、言语、动作、行为当中，对方都可以看得到，都可以感受得到，所以我们在讨厌他，他也一定在讨厌着我们。那我们爱护一个人也是如此，说我们爱一个人，从我们的语气当中，从我们的神态、动作、行为，对方都可以感受到这种关心和爱。</span></p><p><span>所以他回馈给我们的，返回来的自然就是爱和关心，告诉穆公发生这些事情的根本原因，不在于百姓，而在于百姓民不聊生之事。有人饿死沟壑壮者四处逃难，而您和您的长官却选择漠视，自己的府库是充盈的，却没有开仓放粮去救助百姓。连开仓放粮救助百姓，您都不愿意去做。</span></p><p><span>为什么你去要求百姓为官员赴死，这怎么可能呢？相比于赴死而言，开仓放粮好像更容易，可即使更容易的事情，处上位的人都选择漠视，都没有去做，那么凭什么要求百姓去为官员赴死呢？</span></p></div>"
},{
    "title": "《孟子》梁惠王下⑫-2 反求诸己",
    "author": "虚空先生",
    "date": "2022-08-09",
    "html": "<div class=\"B1_text\"><p><strong><span>《孟子》梁惠王下⑫-2反求诸己</span></strong></p><p><strong><span>夫民今而后得反之也，君无尤焉。君行仁政，斯民亲其上，死其长矣。</span></strong></p><p><strong><span>夫民今而后得反之也。</span></strong><span>夫是助词，民指的是百姓。说百姓只是今天才得以报复，返回去。还是在讲出尔反尔的道理，因为平时作为君主和官员是漠视百姓的，只不过到了今天这个时候，百姓才有返回去的机会。</span></p><p><span>所以当看到邹国与鲁国发生争斗冲突，而百姓选择了返回去这种漠视，并没有人愿意去救助这些长官，看着他们在争斗当中死去。</span></p><p><strong><span>君无尤焉。</span></strong><span>这句话才是孟子真正想讲的话，说君主您不要去责怪他们，不要去责怪百姓，为什么不要责怪他人？出乎尔者，反乎尔者也。因为今天所形成的果是过去的因，是因为平时您并没有重视百姓，没有爱护百姓，所以才形成了今天的结果。</span></p><p><span>百姓也选择漠视，所以君主您不要去责怪他们，错误并不在百姓，而在我们自己，既然错误在我们自己，我们要如何去改变这种现状。</span></p><p><strong><span>君行仁政，斯民亲其上，死其长矣。</span></strong><span>如果您可以实行仁政，去保民，爱护百姓，这些百姓就会亲近处上位的人，就会愿意去为长官赴死，所以想要改变这件事情的结果，不是从结果上努力，而是从因上去努力。</span></p><p><span>想让百姓为长官赴死很简单，我们从自身做起，要去行仁政，爱护百姓，这个时候百姓自然愿意，亲近处上位的人，在有事情发生之时，百姓才愿意为长官去赴死。我们讲完孟子与邹穆公之间的对话，我们再从中来作延伸。</span></p><p><span>我们先来延伸第一点，出尔反尔，我们要去学习这四个字，在生活当中，无论我们如何对待他人，他人就会如何返回给我们。</span></p><p><span>举例子比如说，我们和爱人之间相处，要是多关心他，多爱护他，他自然就会爱护我们，关心我们。</span></p><p><span>比如说，对于同事也一样，我们多给他一些关照和帮助，那么就会有其他同事，来关照和帮助我们。比如说我们对于领导，如果是忠信的，是敬畏的，那么领导对我们自然就会回以仁义。</span></p><p><span>即使我们对待工作也是一样，比如说我们认真努力地工作，工作就会回馈给我们相应的结果。可是如果我们做事情是消极怠工的，那么最后呈现出来的，就会返回到我们自身。可能我们工作没有办法做好，没有办法得到领导和同事的认同，没有办法升职，没有办法加薪。</span></p><p><span>所以一切的作用都是相互的，即使我们对待自己的物品亦是如此。比如说我们穿的这件衣服，如果我们爱护它，那么它就会返回来爱护我们，可是如果不珍惜这件衣服，它会坏掉，那么它自然也就会离开我们。</span></p><p><span>再比如说，我们开的车子，住的房子都一样。如果我们开的车子，自己用心地去爱护它，那么它不出问题，就是在回馈给我们最好的使用状况，可是如果我们不爱护这辆车子，它就会出一些问题，那影响的最后还是我们自己。</span></p><p><span>一个懂得修德之人，在乎的是自己出去的是什么，我们出去的是否是爱，出去的是否是关怀，出去的是否是仁义，出去的是否是忠信？如果我们出去的是仁义，就会得到相应的结果；我们出去的是忠信，就会得到相应的结果。</span></p><p><span>我们要时刻的来审视自己，反观自省，看看我们每天的想法、念头当中，我们的言语，我们的行为当中，出去的是什么？因为我们出去什么，就会回来什么。</span></p><p><span>我们再来延伸第二点，反求诸己。当一件事情的结果，如果是不好的，我们是否有反求诸己呢？比如说，文中的邹穆公，当发生了这件事情，没有百姓去救官员，邹穆公开始陷在情绪之中，愤怒，甚至想要杀更多的人以泄愤，这就是不懂得反求诸己。</span></p><p><span>但是孟子告诉穆公，出乎尔者，反乎尔者也，不懂得反求诸己，发生了今天的结果是自己造成的，错误并不在百姓。</span></p><p><strong><span>《中庸》讲，正己而不求于人，则无怨，上不怨天，下不尤人。</span></strong><span>如果一个人懂得反求诸己，懂得正己，这个时候就不会责怪和怨恨他人，上也不怨天，下也不尤人。如果我们像邹穆公一样，不懂得反求诸己，我们就会愤怒，会怨恨百姓，我们在生活当中就会怨恨他人。</span></p><p><span>我们来举例子，比如说我在工作当中，没有升职，没有加薪，我们可能会抱怨，抱怨是同事抢了我的位置，争了我的功，抱怨是领导不开眼，他为什么不给我加薪，他为什么不给我升职？就会愤怒，就会抱怨，</span></p><p><span>这个时候，我们就要懂得正己而不求于人，则无怨。我们去想一想，这其中的原因到底是什么呢？为什么没有给我升职加薪？我对公司有什么样的贡献吗？我有把工作做得更好吗？我有急人之所急，忧人之所忧吗？</span></p><p><span>我们有没有担忧，我们有没有着急，企业的领导担心和着急的事情？如果我们没有做更多的贡献，怎么会给我们升职加薪呢？所以当发生一件事情，我们不要陷在情绪之中，不要在结果上去努力，而是去找背后的原因到底是什么？</span></p><p><span>就像孟子帮助邹穆公去找原因，为什么会发生今天的结果，我们为什么没有升职加薪？先去找原因，有没有做更多的贡献和价值？如果我们有做过贡献和价值，很努力地去工作，公司也发展得很好，可能由于老板的吝啬，就是不给我们涨工资。</span></p><p><span>这个时候我们找到了原因，也不需要去怨恨和愤怒，我们可以选择离开，去找一个更适合我们的地方。</span></p><p><span>所以这里，我们提炼出来一个思维方式，当一件事情发生了结果，不要陷在情绪之中，不要愤怒，不要抱怨，我们去寻找事情的原因，找到了原因，自然可以很好地解决问题。</span></p><p><span>再比如说，情感之中也是如此，如果有一天我们发现，我们和爱人之间的感情出了问题，这个时候不要去抱怨，不要去愤怒，我们去找为什么会形成今天的结果，是我不够好吗？是给对方的关心不够吗？还是不够体贴，还是不够担当，还是对他过于冷漠了。</span></p><p><span>如果我们去找到原因，确实我们自己都已经做到了，我有反求诸己，而错误出在他身上，我们同样不需要去抱怨，不需要去怨恨，我们可以选择离开，找到更适合我们自己的。</span></p><p><span>我们对孩子的教育也是如此，发现孩子不听话，或者他学习不好，我们先要反求诸己，是不是我们没有给孩子更好的教育，是不是我们的行为，平时得不到孩子的认同，所以他不听我的话？我们去找到原因去提升自己。</span></p><p><span>如果原因不在我，我们也不需要愤怒和烦恼，可能这个孩子的性格就是如此，可能需要更多的时间，更多的耐心，去解决这个孩子身上的问题。</span></p><p><span>总而言之，遇到任何一件事情，当结果已经发生，首先不要愤怒，不要怨恨，不要起任何情绪。</span></p><p><span>第二，不要在结果上去努力，我们要去寻找背后的原因，只有找到原因，才可以更好地解决问题。比如说孟子，他告诉邹穆公，原因是出尔反尔，也就是出在自己身上，不要去责怪百姓，不是他们的错误，那要如何解决呢？实行仁政，你去爱护百姓，去关心他们的疾苦和生活。</span></p><p><span>那么百姓自然愿意亲近于您，自然愿意为长上去赴死。如果看不到真正的原因，只会错上加错，如果这个时候穆公是愤怒的，去杀更多的百姓，只会让百姓更加地漠视和对抗，所以解决不了真正的问题。</span></p><p><span>我们在生活当中也是一样，不要在愤怒和情绪，以及怨恨之中，要静下心来，去找到事情的原因，找到了原因才可以解决问题。</span></p><p><span>如果我们学会了这种思维方式，我们不用去问任何人，发生一件事情，我们就用这种思维方式去思考，去找问题的原因，从根本的原因上去解决问题，那个结果自然会发生变化。</span></p></div>"
}]