[{
    "title": "《大学》第一讲 大学之道",
    "author": "虚空先生",
    "date": "2022-08-04",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第一讲 大学之道</strong></span></p><p><span>为什么从《大学》开始讲？四书五经是以《大学》为首的，《大学》和《中庸》都是从《礼记》里面提取出来的两本，现在成了两本单独的书，所以整个学习儒家经典，都是从《大学》开始入手的，他被排在四书的第一本，也是儒家入门的书籍，所以我们录课也是从《大学》开始讲。</span></p><p><span>大学是什么意思呢？以前是指大人的学问。古人从八岁就开始上学，只不过那个时候学的都是洒扫的功夫，现在没有了。以前那个时候学什么呢？比如说《三字经》，《千字文》，《弟子规》，都是些浅显的道理。</span></p><p><span>从十五岁开始就要上大学了，上大学就是学大人的学问，那大人的学问是做什么的呢？那时是讲齐家治国平天下的，也就是说，十五岁的人开始就要学习，如何齐家治国平天下了。</span></p><p><span>以前的人走上仕途，之前都要读书考取功名的，所以那个时候就开始做这件事情，到了今天我们不需要一定考取功名，我们的行业变得越来越多，时代变得越来越包容，这个时候我们学大学之道，学什么呢？</span></p><p><span>学内在的修养功夫和外在的知识学问、方法的使用功夫，也就是说我们每个人，毕生所要做的两件事情，一个是内在的自我修养，一个是外在知识的使用部分，无论我们今天三十岁也好，大家四十岁也好，正该是学《大学》的年龄，所以《大学》学的就是内在的修养功夫和外在知识的使用。</span></p><p><span>大家去想一想，如果我们内在没有修养功夫，外面用什么？做直播带货的这些人，需不需要内在的修养功夫，需要吧？所以去观察那些真正卖货卖的好的，一定是这个人内在是有水平的，是有修养功夫的。</span></p><p><span>咱们每天跟大家分享的时候，讲的一定不是《论语》，一定不是《大学》，是自己的个人体悟和修养，卖产品不是一样的吗？卖的不是产品，是我们内在的修养和自己的价值观。一个人做企业做得好，一定是这个人内在有修养，有学识，有智慧。</span></p><p><span>比如，我们想做文字翻译的工作，每天讲这么多话，我们怎么翻译，没有内在的修养功夫，不能抓到事情的重点，能翻译吗？翻译不了的。为什么？内在的修养功夫还不够，所以我们懂得这个道理，不是让我们来自卑的，是大家要明白，无论我们做任何事情，我们内在的修养功夫都是最重要的。</span></p><p><span>如果没有这个东西，外面的知识就无法使用，大家一定不要颠倒顺序，如果内在的修养功夫不足，是用不出来的。比如说咱们讲《大学》也是，如果照着书本念，半个小时就念完了，这是我们大人该做学问。</span></p><p><span>“大学之道，在明明德，在亲民，在止于至善。” 明德，先讲这个德，我们经常听到一个词，一个人的品德，一个人的德行，德前面加一个明是什么意思呢？是形容词，光明的意思。这个人有光明的德行，前面又来一个明，叫明明德。</span></p><p><span>第一个明是动词，明就是修的意思，是明达、通达的过程，所以明明德是我们每个人本有的光明的德行，需要通过明， 就是修正，让我们不断地明白，我们自己每个人都本有的光明的德行。</span></p><p><span>这个明德就好比是王阳明讲的致良知，良知是人人本有的。致就是修正的过程，就是把我们的那些欲望、不足的、颠倒的、妄想的、执着的东西修掉，自性圆明就出来了。</span></p><p><span>所以这里的明德，和阳明先生的意思是相通的，因为光明的德行是每个人本来具足的，那我们要修的无非就是一个明字，这个明就是我们内在的修养功夫，不断地在提升。</span></p><p><span>比如说大家在跟着修行的过程当中，不停地向内求的时候是不是明？碰到事情不停地反思的时候是不是明？不停地学习知识的时候是不是明？所以明明德是内在的修养功夫。</span></p><p><span>下一步是在亲民，亲民就是外用了，亲是什么意思？就是亲近他人，帮助他人叫亲民。所以大家想一想，在生活当中有的人说了，我的人际关系不好，那你就需要思考了，你亲近过哪些人没有？你帮助过哪些人没有？如果不没有帮助过哪些人，你的人际关系怎么会变好呢？</span></p><p><span>在一个企业，一个团队当中，是不是这样？有的人说，我的性格就是很孤僻，是啊，你的环境也很孤僻，你的人际关系也很孤僻，你不去帮助他人，他人怎么会你们亲近呢？通常在一个团体当中，最热情的那个人、最爱帮助他人的那个人，是不是人缘最好？</span></p><p><span>他有事情大家都去帮他，比如说做儒家文化也是一样的，古之大德，或者现在这个时代，我们说那个人真的是大善人，或者那个人真有德行，为什么会这么讲？一定是他做了很多帮助他人的事情，我们才能说这个人有德行，他什么都没做，我们能说这个人有德行吗？</span></p><p><span>比如说在咱们这个团体当中也是一样的，如果有一个人经常是帮助他人，一提起他别人会怎么说？“哎呀，那个人特别好，经常帮助人。”他的人际关系自然就变好，你不需要刻意去求的。</span></p><p><span>我们做生意是不是一样的？如果你的生意不好，你要去思考，你帮没帮助过你的客户，如果你没有帮助他，你的关系、你的生意怎么会变好呢？</span></p><p><span>所以大家一定不要本末倒置，一定要知道我们所要做的每一件事情，都是要帮助他人的。</span></p><p><span>当下的朋友每个人都去思考，自己当下所要做的事情是不是帮助他人的？帮了多少人？你帮的人越多，你的范围越大，你的事情结果就越好。</span></p><p><span>比如，我们在翻译文字的时候，就要思考了，这段文字想要帮助什么样的人？他的人群在哪里？我要怎么做才能和他建立关联。比如说我们现在来讲传统文化也是一样的，修行之道也是一样的，你得知道现在人的痛点在哪里？</span></p><p><span>他们哪里是需要我们的，我们讲这个东西，我们才能帮助到他，也就是我们的价值自然而然就得到体现了。</span></p><p><span>大家一定要懂得一个道理，如果你帮助他人的心不够，你亲民的心不够，你的思维是打不开的，如果少了这个东西，谁也没法前进。做生意的生意做不大，你在一个团队当中，你也不可能往上走，修行你也不可能修得更好，所以亲民是个极其重要的事情。</span></p><p><span>还有的人经常抱怨，说在家庭关系中不和谐，七大姑八大姨，跟婆婆这些关系都搞不定，为什么？你去想一想，你都在索取啊，身边的这些亲人，家里的事情你有没有管过呢？你有没有帮过呢？如果没有，你的关系怎么会变好？</span></p><p><span>昨天邻居送来杏和樱桃，通过这件事情我们要去反思，比如我们在的这个村子里面，为什么还有一些人在排斥我们呢？因为我们也确实没做过帮助人家的事情，就是我们自己的德行还没有彰显到去影响身边的这些人，我们只顾着影响更多的陌生人了。</span></p><p><span>为什么这个孩子的母亲会送来这些水果？不是因为他的孩子来到这里，跟他的母亲说，跟老师聊完天或者到我们这里学习完以后受益了吗？是不是亲民了？你帮助到他，他跟我们的关系就好了呀。如果我们没有帮助到他，关系怎么可能会变好？</span></p><p><span>所以通过这个事情我们自己来反思和不断地延伸，我们做其他的事情是不是一样的？如果我们不能去亲更多的民，我们怎么可能让自己变得更好？我们内在的德行又要如何彰显呢？</span></p><p><span>所以一个是内在的修养功夫，一个是外在的使用。如果内在没有修养功夫，外面没法用，因为你内在没有那个德行，你怎么用呢？但是反过来，它俩是相辅相成的，你只有外用亲更多的民，你内在的修养功夫才会越高，儒家经常讲一个词叫内圣外王。</span></p><p><span>什么叫内圣？就是内在是像圣人那样去修行的，内在的德行我们要不断地去彰显的，这个时候往外用的时候，才有人拥护你，有人拥护则为王，自古以来是不是这样的？哪一个王不是被人拥护的？包括在一个团队当中有没有王？</span></p><p><span>一定是谁更拥护他，他的能力更强，他更有能力帮助更多的人，他更有担当，更有承载能力，他内在的修养、素养更好，这个人自然而然就成王了。</span></p><p><span>很多人不懂这个道理，在企业当中不停地向外求，让我升职吧，结果升职后，德不配位，反而做得更累。本来我做一个员工，或者做一个小领导，每天做得还很开心，可是突然升上那个位置，自己开始焦虑不安，为什么呢？</span></p><p><span>内在的修养功夫不够，你也没帮助那么多人，你升上去了大家都不服气，所以就出问题了。</span></p><p><span>到了我们今天这个社会更是如此，一个是向内明德，一个是向外亲民，然后给了我们一个目标——在止于至善。所以整个大人的学问，总结起来就这一条，“大学之道，在明明德，在亲民，在止于至善。”</span></p><p><span>那我们要把什么止于至善呢？把这两项都止于至善，一个是向内在的修养功夫，止于至善，第二个是我们不断地帮助他人的行为止于至善，就是指向最好的。这就是我们每个人所修行的方向，和我们大人该懂的道理。</span></p><p><span>有的时候我们经常会讲一句话，儒释道的文化有相通之处，哪里相通呢？比如说道家告诉我们“正己化人”，正己，是内在的修养功夫。化人，是教化、度化、感化他人，就是不停地去帮助他人。</span></p><p><span>所以叫明德，亲民，止于至善。这三句话就是整个大学的纲领，就是大学之道最重要的其实就是这三句话，我们如果把它搞清楚了，践行到生活当中去，会发现用到哪里，哪里灵。如果不灵，你去思考哪个地方做的不好，就可以了。</span></p></div>"
},{
    "title": "《大学》第二讲 大学次第",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第二讲 大学次第</strong></span></p><p><span> </span></p><p><span>接下来讲的东西都是告诉我们具体要怎么做到明德亲民，怎么做到止于至善。首先告诉我们要先“知止”。</span></p><p><span> </span></p><p><span><strong>“知止而后有定，定而后能静，静而后能安，安而后能虑，虑而后能得。”</strong>这段话我提取了七个关键点，第一个是知，第二个是止，第三个是定，第四个是静，第五个是安，第六个是虑，第七个是得。我给它取了一个名字，叫二因五果。我们首先要知道哪个是因，哪个是果？我们去做什么，接下来事情它自然会发生。</span></p><p><span> </span></p><p><span>这里面最重要的一件事情——<strong>知止而后有定。</strong>第一句话的纲领就告诉我们要止于至善，你只有止于至善，是不是方向有了？你才能不断地去明德和亲民。如果你不能止于至善，你又如何明德和亲民呢？如果做事情你要止于恶，你想的都是坑蒙拐骗的那一套事情。说你要去偷电动车，是不是也是一个止？因为他想去偷电动车他就得研究这家几点没有人，几点天黑，偷完了之后我下一步要怎么办，往哪里跑，跑完了去哪里卖，是不是也是止？只不过他的方向偏了。</span></p><p><span> </span></p><p><span>我们需要知道的第一件事情，是得止恶扬善，得先学习什么是善什么是恶，这样所有的行为我们才不偏。包括我们做一件事情，也是一样的，是不是得先学习？先知道这件事情要怎么做？我从哪里下功夫，如果我们没有知，止从哪里来呢？</span></p><p><span> </span></p><p><span>比如做文字翻译的工作，是不是得先知？我得先知道老师讲的都是什么？要先知道各个平台的侧重点是什么；我得去知道现在人们的需求都在哪里？我们得有更多的知识和智慧，才能看到那个问题，否则会被问题的表象迷惑了。</span></p><p><span> </span></p><p><span>所以第一个最重要的关键字就是“知”，“知”就是我们要不断地去学习，不学习怎么会致更多的知呢？什么都不知道，包括我们也不知道自身的问题，大家有没有这种感觉？比如说到这里待一段时间，发现自己身上的问题越来越多，这就叫自知之明。如果不学习更多的东西，我们会知道自己身上有问题吗？因为没有参照物。</span></p><p><span> </span></p><p><span>《论语》讲：<strong>“就有道而正焉”</strong>，我们没有学习的时候，觉得自己好厉害，觉得自己什么都懂，学习越多的东西会发现，原来自己身上有这么多的问题、这么多的不足。问题越找越多，这个时候说明什么？我们是有了学习的根基，我们才能反过来自知。当我们有自知之明的时候，才能知人。如果我们没有自知之明，能知人吗？</span></p><p><span> </span></p><p><span>我们修行的过程当中特别有意思，当我们解决掉了自己身上的一些问题，这个时候才能看到他人身上的不足和问题，如果我们也有同样的问题，能看得到吗？看不到的。所以这个“知”的范围很广，也是重中之重，我们每个人都是先要致知的，先要去努力地学习。</span></p><p><span> </span></p><p><span>通常在这个时代能做好事情的人，必须具备两个品格。一个是主动性，主动性是不是知的过程？就是我去主动学习，主动研究，主动找到问题，主动解决问题，这是必不可少的东西。修行是不是更是如此？做学问是不是更是如此？如果我们不能主动地学习、主动地修正、主动地去发掘问题，如何成长？成长不了的。</span></p><p><span> </span></p><p><span>所以第一个叫主动性，第二个叫快速解决问题的能力。如何快速解决问题？是不是还得先致知？如果不致知，连问题都看不到何谈解决呢？所以“知”是我们每个人最重要的事情。</span></p><p><span>第二件事情就是止，当我们致知，不断学习的过程当中，才能找到目标。很多人都说：“我的生活很迷茫，做生意很迷茫，说我的家庭关系不好，我很迷茫。”为什么会迷茫，没有止啊。做事情没有方向、没有目标，怎么会不迷茫？所以说一定是先致知，通过不断地去学习，这个时候你才能找到你的目标。</span></p><p><span> </span></p><p><span>《中庸》讲：<strong>“有的人生而知之，有的人困而知之，有的人学而知之”。</strong>生而知之是什么样的人？某一个工作交到他手里，天生就会，不用学，哪个团队当中都有这样的人。比如说孩子你看有没有？有的人家的孩子学习，不用管，自己就写作业了，而且学习态度很好。</span></p><p><span>还有一种人就是困而知之，就是总出问题，只有每次出问题的时候，我才知道找方法去解决，可是困而知之是要付出代价的。很多人是不是感情出了问题，困而知之，我被迫知道，我经常感情受伤、受挫折。还有的人做生意，我生意失败了，碰到挫折了，赔钱了，这时候被迫学习，这都叫困而知之。</span></p><p><span> </span></p><p><span>我们一定要去做学而知之的人，主动前行，只有在大量的学习和提升过程当中才能找到自己的止。我们每一件事情都是需要止的，当我们有了事情有了目标，这样做事情才不迷茫，所以这句话告诉我们什么呢？“知止而后有定”，定力从哪来？是自己的止和方向很明确，你才有定力。什么叫定力？就是不被动摇。是不是越是有坚定目标的人做事情越不容易被动摇？</span></p><p><span> </span></p><p><span>举个简单的例子，有的人在家里带孩子，有的人止很明确，说我这两年就是为了在家照顾孩子，我什么都不干。这时如果别人说你不上班，也不工作，但她心里很有数，是不是不会被别人说的话所动摇？可是没有目标的人，听到别人说“你怎么不上班”她就开始抱怨了：“你看我为了带孩子也不能上班，我也很辛苦”，然后你真让她去上班的时候，她又舍不得孩子。当你的止是很明确的时候，别人所讲的话和发生的任何事情动摇不了你。</span></p><p><span> </span></p><p><span>整个大学之道都在告诉我们，<strong>“在明明德，在亲民，在止于至善。”</strong>这里的“止”，都是内在的修养功夫，都是不断地去帮助他人，目标是止于至善，这个“止”是不是都是利他的？都是为别人奋斗的？而不是止于我们自己赚钱。</span></p><p><span> </span></p><p><span>所以我们思考一个问题，在生活当中也好，或者在工作当中也好，或者去读中国的历史，或者观察现在的社会现状，你看你是帮助他人觉得更有力量、更有动力？还是为自己做事情更有动力？</span></p><p><span> </span></p><p><span>很多人的止偏了，说我止于赚钱，你也不能说他有错，可是你止于赚钱的时候，你的行为就会出现偏差，因为你满脑子都是想着如何赚钱，有没有错？没错。可是越是满脑子想着如何赚钱的人，赚不到钱，因为总想着自己。</span></p><p><span> </span></p><p><span>只有“止”是不断地修行自己、不断地利益他人，以帮助他人为目标的时候，人生的动力就重新就燃起来了。这个时候我们的行为是不是变得不一样？思维也开始变得不一样。</span></p><p><span> </span></p><p><span>所以大家在做事情过程当中，一定要不断地去扩充这个“止”，一定要把“止”立在明德和亲民上。因为你不明德，你自己没有修养，没有更多的智慧，你帮不了他人，心有余而力不足，这就是“知”和“止”的重要性。“知止而后有定”，如果止很明确，不停地致知的过程当中，定力就有了，就不被动摇了。</span></p><p><span> </span></p><p><span>再举个生活当中很小的一个例子，说明天开始有五天假期，这时我们就要思考了，去哪里玩呢？去趟远点的地方吧，费用好像有点贵；去个近的地方吧，去近的地方可惜五天假期了，五天假我能去很远的地方，现在飞机这么方便，能玩一圈……这个时候，你会发现饭吃不香，觉睡不好，天天琢磨，天天查攻略我到底要去哪。或者说我决定去云南，或者我决定去北京，你一旦这个方向，这个止有了以后，你的定力是不是就有了？当做了决定，马上把机票订好，你会发现你就不动摇了。</span></p><p><span> </span></p><p><span>如果在生活当中遇到了事情，最好的、最简洁的方法就是快速做决定。因为那个决定一旦下了以后，你的定力就产生了。你不快速做决定的时候，一纠结这个事情就会无限延长。</span></p><p><span> </span></p><p><span>接下来告诉我们，<strong>“定而后能静”，</strong>当你定力产生了，是不是心就静下来了？比如说我们现在做事情也是一样，我们知道自己的止，知道每天做什么，我们也能定得下来。当你定下来，很踏实地做事情，心自然就静下来了。我们也不着急，慢慢在这录，虽然事情很多，但是我们是“忙而不乱”，一定要记住这四个字，我们做事情要不要忙？你不忙，效率太低了，但是不要乱，越乱，事情越做不好。</span></p><p><span> </span></p><p><span><strong>“静而后能安”，</strong>当我们的心静下来的时候，我们才能懂得什么叫安住当下。安住当下才是一种享受、满足于当下的状态。什么时候有可能会安不住？就是我着急摸索这个事情但是我还没摸索出来，就相当于是你致的“知”不够，你的“止”还不明确，你就没定下来，定不下来你的心就不静，心不静你就不能很享受当下的状态。</span></p><p><span> </span></p><p><span>比如说我们刚开始学开车是不是这样？很拘谨，又得看路又得看什么的，你根本不敢听音乐，但是你一旦开熟悉了以后，开车你就是“静而后能安”的状态，摇下车窗，看着外面的风景，放着美妙的音乐，你坐姿都变得舒适了发现了没有？所以你去看你为什么不安？你的“知”不够，你就不能“止”，你的“止”不够就没有“定”，“定”不够心就不“静”，心不静就不能很安然地享受在当下的状态，这是第一层的安。</span></p><p><span> </span></p><p><span>我们再深一层讲，什么叫安？身轻心安，如何才能身轻心安？是你的欲望越来越少，你的心自然就越来越静。你还有那么多的欲望，你的心如何静？你又如何安？“安”一定是我们享受与满足当下的这种状态，这叫安住当下。我们能安住当下，跟我们外在的环境关系其实不大，跟我们拥有什么关系其实也不大，是你的心静下来自然就安了。<strong>“安而后能虑”，</strong>你才有思虑，你只有在安然的状态下，你思考的都是有智慧的事情，想一想，如果一个人在心烦意乱的状态下，你的思虑会有智慧吗？不太会的。你会找到前方的方向吗？</span></p><p><span> </span></p><p><span><strong>“虑而后能得”，</strong>你虑什么？你止于什么就会虑什么，如果你没有止，哪有虑？每天就会胡思乱想，为什么我们每天不能去深入地思考，是因为你没有止。所以我们在平时生活当中做事情也是一样，做一个工作如果没有止，就不善于思考，因为不知道往哪里思考，“他的事情跟我有什么关系？这不是领导的事情吗？那都是客户的事情”。你自己没有止的时候，就会是这样子。</span></p><p><span> </span></p><p><span>我们想学习也是一样的，我们知道了自己哪里的不足，去给自己定一个方向，就知道我们每天要去学习什么，如果没有止，后面所有的东西都不成立，所以“虑而后能得”，得什么呢？止于什么就得什么。</span></p><p><span> </span></p><p><span>整个《大学》首篇讲的是止于至善，如果我们把止，定于止于至善，那得到的就是至善，如果你的止是把当下的每一件事情做好，你在不停思虑的过程当中，所得到的就是把这件事情做好。</span></p><p><span> </span></p><p><span>我们重新再来反顾这句话，所以我管它叫“二因五果论”，二因是什么？一个是知，一个是止，后面的都是果，这两个是需要我们不断地种因的。知止而后，自然就有了定力；定而后，自然心就静下来了；静而后，自然你就是享受满足、安住当下的状态；你安住当下的状态，你自然就有思虑的智慧；虑而后，自然就能得，止什么就得什么。大家不要反了，不要颠倒，一定要先从“知止”下功夫，后面的结果，它自然而然就发生了。</span></p><p><span> </span></p><p><span>接下来开始总结这段话了，告诉我们<strong>“物有本末，事有终始，知所先后，则近道矣。”</strong>什么叫本末？我们说树，什么是根呢？什么是本呢？树根就是根，就是本。什么是末呢？上面的树枝、上面的花、结的果实，是末。所以很多人都是反的，我们只追求果实，能行吗？咱们外面蔷薇花开了，过几天桃树就结桃子了，如果把关注点都是放在桃子上，是不是本末倒置？我们现在绝大多数人是不是本末倒置的？关注的是桃子，是花，关注的是树枝，可是那个树根才是本，如果根是烂的，上面能长桃子吗？能开花吗？</span></p><p><span> </span></p><p><span>我们学《大学》是不是一样的？什么是根？明德、亲民是根，是本。如果不能不断地提升自己内在修养，不能不断地去帮助他人，而一直向外求——我求人际关系好，我求生意变得更好，我求变得更有智慧。那不是虚妄吗？那不是本末倒置吗？都在求末，而忘了务本，所以我们要懂得本和末。</span></p><p><span> </span></p><p><span>我们讲的这七个次第也是一样的，“知”和“止”是本，后面所得到的定、静、安、虑、得，这是末，很多人都会问：“老师，您就告诉我怎么静心吧！”你还有那么多的欲望，你也没有知，也没有止，你也没有定力，你的心如何静？</span></p><p><span> </span></p><p><span>所以我们做事情一定不要本末倒置。不管我们做任何事情，做到最后所体现的都是你自己内在有多少修为，都是你内在有多少学识，这个东西假不了，任何事情都有本末，事有终始。</span></p><p><span> </span></p><p><span>我们做任何事情是不是都要有一个结果出来？因为那个结果出来大家整体才好往前推进。为什么我们做事情一定要忙而不乱？因为你落下了一个环节，就会影响其他人往前走，那你这件事情就做得没有始也没有终。就是我们在做事情的过程当中，大家一定要互相配合好，哪怕说这个事情做了一段时间，研究了，我没研究明白，是不是也要有个终？也要有个结果？没研究明白，不行，那就换个人上，或者是换一个思路去解决问题。</span></p><p><span> </span></p><p><span><strong>“知所先后，则近道矣”，</strong>刚才讲的是“本末”不要倒置，现在又告诉我们主次要分明，只有这样，我们做事情的时候才更合近于道。</span></p><p><span> </span></p><p><span> </span></p></div>"
},{
    "title": "《大学》第三讲 格物致知",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第三讲 格物致知</strong></span></p><p><span><strong> </strong></span></p><p><span><strong>“古之欲明明德于天下者”，</strong>把明明德，彰显到全天下去，该怎么去办呢？告诉我们要“先治其国”，因为这本著作出在春秋末期，正是天下大乱的时候，整个诸侯国四起、礼崩乐坏的时代背景下，仁人志士都立志要“齐家，治国，平天下”，以匡乱世。匡乱世的人怎么办呢？得把德行彰显到全天下去，想要彰显到全天下去那得先治其国，得把自己的诸侯国治理好，只有治理好诸侯国，才有能力去匡正天下。</span></p><p><span> </span></p><p><span><strong>“欲治其国者，先齐其家。”</strong>那想要把诸侯国治理好，得先齐家，得把自己的家族、家庭管理好。那个时代的家族都比较大，上古时期都是部落，部落其实就是一个大家庭，这一个部落当中，最有德行的那个人，最能亲民、最能帮助他人、最有威信的那个人，就会被整个部落的人推选出来做首领。</span></p><p><span> </span></p><p><span>我们看《大舜》电视剧，他们天下共主的位置哪里来的？是大家共选的，觉得他的德行更好。皋陶大人为什么把位置让唐尧去坐呢？因为他觉得唐尧更圣明，比他的胸怀格局更大。部落的首领，齐家的过程也是一样的。</span></p><p><span> </span></p><p><span>在一个团队当中，最后谁能当家？看德行。看最后谁有这个能力谁就去当家了。我们现在不懂得修行之道的人，是不是天天去争？即使争来了，坐在那个位置上，也做不好。可如果我们不停地彰显自己的德行，被大家推举坐到那里，会有很多人拥护我们，也会把位置坐得更稳，也会把事情做得更好。否则争来的又有何用呢？</span></p><p><span> </span></p><p><span>周朝是怎么得到天下的呢？周文王只是治理好了自己的一个很小的小诸侯国，那时还是商朝末期，但后来他的德行特别好，到后期发展到什么程度呢？他的领域已经占到了商朝的三分之二。所以这些道理都在告诉我们，我们不断地把家齐得更好的时候，就可以治理好一个国；能治理好一个国，就可以影响天下。</span></p><p><span> </span></p><p><span>我们把家定义成团队，或定义成公司，只有把家齐好，把团队的人带好，自然而然就能影响国人，就能影响周围的人，就能去影响更多的客户。那个时代是齐家、治国、平天下，现在这个时代也需要平天下，只不过我们的天下变了。</span></p><p><span> </span></p><p><span><strong>“欲齐其家者，先修其身。”</strong>那个时候的部落首领都是被推选出来，他的行为更有德行，他更有智慧，他每天想的都是大家的利益，大家才会推举他。我们在一个家庭当中不也是一样吗？要求孩子要好好写作业，我们在那打游戏；要求孩子好好坐着，我们却是倚着，这样有说服力吗？为什么我们在家庭当中，孩子跟我们犟嘴、顶嘴、不听话？因为我们都没做到，他怎么会听呢？不会的。</span></p><p><span> </span></p><p><span>在一个企业当中是不是一样的？虽然我们坐在了领导的位置，可要是不懂得修自己的身，不懂得修自己的行为和心念，不能以身作则，别人服不服？是不是不服众？别人就不配合我们的工作，最后我们就会抱怨员工，这招的都是什么员工啊。员工不是我们带出来的吗？所以我们不用过多地操心别人的事情，但是这个过程当中我们要修己，让自己变得更包容。事情只有两种结果，要不然他被同化——进来；要不然不被同化——离开，事情自然而然就解决掉了。</span></p><p><span> </span></p><p><span>我们做事情当中，如果懂得用这种无为法，会很轻松。比如说《大舜》电视剧里，他是不是用的就是无为法？不需要管理那么多事情，去做事情就好了，德行自然影响他人。是不是只剩下了一件事情？就是修身。</span></p><p><span> </span></p><p><span>我经常讲，我们每个人在家学习、修行，应该做的一件事情——把自己修正好。当自己修正好了，会发现身边的事情莫名其妙地发生变化，孩子也听话了，另一半也愿意跟我们交流了，人际关系也自然就变好了。所以这是古人的智慧，这也是古人智慧的次第，这是修身的重要性。</span></p><p><span> </span></p><p><span><strong>“欲修其身者，先正其心。”</strong>怎么才能修身呢？怎么才能让行为变得更好？得“正心”，我们的心念决定了行为。</span></p><p><span><strong>“欲正其心者，先诚其意。”</strong>怎么才能正心？我们要先诚其意，做任何事情我们自己的意是不是诚的。什么叫诚意？一心一意为诚意，如果我们做这个事情都没有一心一意，我们的心怎么会放端正呢？我们的行为怎么会变好呢？比如说一个同事也好，或者一个领导也好，当我们在做事情的过程当中，我们让他人怎么做怎么做，对方心里会想：“他做事情都不专心，他做事情都不那么负责任，领导交给他一个事情他都没做好，他反而要求我。”服气吗？不单影响不了任何人，反而让人家对我们的印象大打折扣，所以我们一定要懂得让自己的“意”要诚。</span></p><p><span> </span></p><p><span>什么叫诚？《大学》讲：<strong>“诚于中，形于外。”</strong>形：是我们的行为。内心有多大的诚意，做出来的行为才有多大的诚意。别人通过我们的行为能不能看到内心的诚意？我们做事情有多努力，就看到内心的诚意有多足了，诚意一定不是我们表现出来的，而是“诚于中，形于外。”我们的行为别人一眼就看到诚意够不够，尤其是比我们高明和有智慧的人，我们是无所遁形的。</span></p><p><span> </span></p><p><span>在一个企业、一个公司当中也是这样的，以为糊弄过去了，其实比我们有智慧、比我们高明的人一眼就看到了。为什么不提拔我们是有道理的，他一定看得比我们更明白，只是我们自己在局中看不明白。所以我们做事情，自己的诚意很重要，为了这件事情我付出过多少，我致了多少知，那是我们的诚意。</span></p><p><span> </span></p><p><span>所以《大学》这本书太好了，次第讲得清清楚楚，一步一步该去做什么，所有的朋友们都可以去反思，我们当下的生活如果还不够好，人际关系如果还不够好，生意如果还不够好，我们去对照是哪个阶段的事情没有做好，按照次第，不断地去修正自己就好了。</span></p><p><span> </span></p><p><span><strong>“欲诚其意者，先致其知。”</strong>怎么才能有诚意？得先致知，当我们的诚意不足的时候，说明还不知道这件事情该怎么做。诚意又从哪里来呢？我们如果在企业当中、工作也是一样的，我做一个文职的工作，或者做行政的工作，或者做销售的工作都一样，我们得把所做的事情的这个领域得掌握清楚，得知道，才能诚其意，如果我们不知道正确的方法应该是什么，诚意从哪里来？所以欲诚其意者，得先致其知，这是第一层，知道的知，是学识，是知识，是技能。</span></p><p><span> </span></p><p><span>第二层“知”，就是王阳明先生所讲的致良知。我们致良知，才能知善恶，才能分好坏，才知道什么事情该做，什么事情不该做，这个时候我们的意才能更诚，心才能更正。</span></p><p><span> </span></p><p><span><strong>“致知在格物”，</strong>致知的起步在哪里呢？第一道门在“格物”，《大学》讲八条目，从格物开始，<strong>“格物，致知，诚意，正心，修身，齐家，治国，平天下”，</strong>格物是进入儒家或者《大学》的第一道门。</span></p><p><span> </span></p><p><span>格物有两层意思，第一层格物是“穷其理”，探寻事物发展的规律。比如说当出现了一个什么事情，是不是都会有一个结果？当那个事情结果出现了，是探寻事物发展的规律。这个视频为什么拍得好？一定有原因，我为什么拍不好？也一定有原因，只不过事情的道理我们没找到，当找到那个道理了，就懂得从事情当中去格物了。</span></p><p><span> </span></p><p><span>以前古人称之为格物，为什么呢？那个时候每件东西不知道叫它什么，而现在我们都知道了，但是我们现在是称为格事。每件事情的发生，我们都去看背后的道理，每件事情结果出来了，我没有做好，为什么做不好？我们去思考，必有原因，没有一件事情的发生是没有原因的。</span></p><p><span> </span></p><p><span>人们经常讲一个词叫叫突然，说我们感情突然不好了，我突然被辞退了，突然生意变得不好了，突然吗？细思极恐，一点都不突然，早已有事物发生的痕迹，只不过我们没有发现而已。</span></p><p><span> </span></p><p><span>感情是突然变得不好的吗？感情是不是突然变好的呢？也不是的吧？是不是一点点的积累？是大家在一起交流相处，才一点一点变好的。比如说三年没见过一个人，三年以后见面了，这个人突然变得有学问了。不突然，人家努力了三年，我们不知道而已。万事发生必有其痕迹，只不过我们自身没发现而已，它怎么会突然呢？</span></p><p><span> </span></p><p><span>无论是做学问、修行、做事情、人际关系都一样，所有的事情都不突然，只是我们没有发现，所以我们要养成第一个：格物的能力，懂得看任何事情发展的痕迹，都是我们点点滴滴积累而来，不是突然的。</span></p><p><span> </span></p><p><span>第二层格物的意思，是格除欲望。让我们自己的心不受役使，这个就是阳明先生所讲的心学。第一层的格物，通过发生的事情看事物的发展规律，是不是每个人看到的都不一样？比如说同样是格物，我们几个人格的一样吗？格的深度一样吗？为什么不一样？因为心性不同，欲望的多少不同，所以我们为什么说旁观者清呢？他没有欲望。</span></p><p><span> </span></p><p><span>比如说两个人谈朋友，我们跟自己的闺蜜或者朋友说：“这不是渣男吗？我知道那肯定是渣男。”那一刻她贪心没起，就看明白了，她一眼就能看清楚。那个男人就是骗人的，你不明白吗？他就是不想理你，你不懂吗？为什么不懂呢？因为心被蒙蔽住了，有欲望了，想得到了，想拥有了，享受在那些状态当中了，所以就不知道了。</span></p><p><span> </span></p><p><span>第二层是格除我们的欲望。当我们的欲望越少，我们的心就越静，我们的智慧也就越足，看事情就会越通透、越清醒，这叫格心。当我们的心不被那些事情驭使和干扰的时候，是不是我们一眼就看透彻了？清清楚楚摆在面前。如果不懂得格心，只懂得格物，我们的智慧很难上升，只能在小范围内把事情做得更好而已，但是呢，也比不懂得格物的思维要好得多。</span></p><p><span> </span></p><p><span>当我们遇见一件事情，懂得格物的思维，发生的时候就会去琢磨，这件事情为什么好为什么不好，我们才能重新去致知，才能学习更多的东西。如果我们浑浑噩噩地做事情，浑浑噩噩地学习，浑浑噩噩地修行，很难有建树的。所以格物是非常重要的，是入儒家的第一道门。</span></p><p><span> </span></p></div>"
},{
    "title": "《大学》第四讲 修身为本",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第四讲 修身为本</strong></span></p><p><span> </span></p><p><span><strong>“物格而后知至。”</strong>当我们不断地格除欲望，格除对自己心的役使，又能格出每件事情背后的规律，很多事情自然就知道了。我们格心，不被欲望驱使，得到的是良知，就是自己本性光明的那个东西。如果格的是物，事物发展背后的规律，我们得到的是知识和方法。所以告诉我们，物格而后知至。</span></p><p><span> </span></p><p><span><strong>“知至而后意诚。”</strong>这个时候做事情就诚心诚意了。如果我们的良知有了，做事情就是一心利他了，那是人最本性的光明。开篇就讲：“明德，亲民，止于至善。”如果我们知道更多事物发展的规律、知识、道理，这个时候做事情我们的意念就不容易被动摇，因为很清楚自己在做什么，要去做什么，就不容易被动摇，否则很容易就被动摇了。</span></p><p><span> </span></p><p><span><strong>“意诚而后心正。”</strong>当我们一心一意地去做事情，心念是正的，心念不动、不偏。</span></p><p><span><strong>“心正而后身修。”</strong>我们的心正了，身体的行为自然就开始变得端正，做事情的行为标准开始变得规范，我们就能影响身边更多的人了。</span></p><p><span><strong>“身修而后家齐，家齐而后国治。”</strong>我们就能影响更多的国人了。</span></p><p><span><strong>“国治而后天下平。”</strong>自然天下就太平了。</span></p><p><span> </span></p><p><span>从古至今，这样的方法都是通用的，只不过我们要懂得，以修身为根基。修身是一个连界点，是内外结合的中间轴。我们从格物开始，格物，致知，诚意，正心，这些都是修身的前提。有了这些才能修身，有了修身以后才能外用，外用是什么？齐家，治国，平天下，所以他是一个中轴线，是重中之重。因为我们内在的诚意和正心，还有智慧，要从哪里体现出来？是不是要通过我们的行为才能体现出来，我们的德行从哪里彰显？要通过行为才能彰显。</span></p><p><span> </span></p><p><span><strong>“自天子以至于庶人，壹是皆以修身为本。”</strong>天子是指以前的国君，庶人就是老百姓，上至天子，下至老百姓，都是要以修身为本，这是《大学》的核心。我们只有把自己修正好了，才能去影响更多的人。</span></p><p><span> </span></p><p><span><strong>“其本乱而末治者，否矣。”</strong>如果“本”乱了，而“末”能治理，那是不可能的。我们读《中国通史》的时候，会发现一个很有意思的事情。一个圣君，他自己是明察秋毫的，他自己是有德行的，自己是有智慧的，是不是在修身呢？好的帝王是不是从小就在修身？从小学骑马射箭，学兵法，学韬略，学四书五经，学占卜，都是在“致知”。长大后，他的行为才会变得更好，当他的行为变得更好，他身边是不是自然就出现贤臣？出现了贤臣自然而然就帮他治理国家。其实一个好的帝王，他做的事情就是一个，就是修身，就是修正自己。他把自己修好了，自然就影响身边更多的人，然后治理全天下。</span></p><p><span> </span></p><p><span>但是呢，人往往向内求是最难的，所以一旦我们转为向内求，不断地修身的时候，我们会发现天下就这样在治理了。比如说我们的德行彰显得更多，我们修身修的行为修得更好，我们所拥有的天下就会越大。古时讲的是朝廷的那个天下，现在我们把天下比作是什么呢？我们的事业，我们的领域和领土。所以我们的行为有多么大的德行，我们所做的事情就有多大的领域和领土。</span></p><p><span> </span></p><p><span>在家庭当中也是一样的，如果我们的德行可以影响身边的亲朋好友，影响自己的孩子、公婆、岳父岳母，那在这个家庭当中，我们就是最有德行的那个人。大家有什么事情，都会找我们去解决。为什么？因为行为修得好。大家每个人都一样，我们在做事情当中，在团队当中，如果自己的行为修得不够好，我们的客户怎么认可我们？领导怎么提拔我们？员工怎么赞同、支持我们？</span></p><p><span> </span></p><p><span><strong>“其所厚者薄，而其所薄者厚，未之有也。”</strong>主次要分明，我们该厚的地方要厚，该薄的地方要薄。做任何事情，都要懂得本是什么。这段告诉我们修身为本，但是在平时的生活和工作当中，大家一定要懂得去应用，当下所做的事情最重要的是什么？一定把它快速地提取出来，才能从当中找到本和末，不至于颠倒。</span></p><p><span> </span></p><p><span><strong>“此谓知本。”</strong>我们每件事情都能找到本，这样做事情就很有规律。大家去观察一个事情，基本上做事情做得好的人是不是会抓重点？重点不就是本吗？他能把重点的地方抓出来，节省了很多无用功，快速地提取需要的点，这样效率就上来了。我们长此以往这样去练习的时候，就形成一种新的思维模式。就好比是我们跟别人聊天，当有一定的思维能力和有一定的智慧，在他大量的话语当中，甚至他只说了两句话，我们快速地就能知道，他问题的根源在哪里，迅速地找出来，这就是知本。</span></p><p><span> </span></p><p><span> </span></p><p><span>做事当中也是一个道理，迅速地在事情当中直接就找到问题的根本，这个是需要我们长期练习的。当我们有这个思维模式的时候，再做事情就简单得多了，所有的事情到我们面前，他说了几句话，直接就能看到问题的根本，这就是穿过事物的表面看本质了，所以这叫知本。<strong>“此谓知之至也。”</strong>这是我们平时需要练习的功课。</span></p><p><span><strong> </strong></span></p><p><span><strong>“所谓诚其意者，毋自欺也。”</strong>什么叫诚意呢？意，是我们的思维和我们的念头。什么叫诚意？就是我们做事情的时候，意念不乱，意念不动，能一心一意地做这一件事情，就叫诚意。</span></p><p><span> </span></p><p><span>当我们做一件事情的时候，如果这件事情做不好，就需要去思考了，我们有没有自诚其意？我们所有的念头，是不是能安住在当下的这一件事情当中呢？如果不能，我们的诚意到底在哪里？比如现在我在做着这件事情，我脑子里想的都是其他事情，这个事情我们是做不好的。经验和方法是会过时的，我们做的事情是载体，我们修的是自己的诚意。</span></p><p><span> </span></p><p><span>无论我们当下在做什么，无论做工作的哪一个环节，要懂得自诚其意，我们对这件事情是不是一心一意的？我们的念头是否是散乱的？如果不是，能把它练到家，这个就是修行的安住当下。</span></p><p><span> </span></p><p><span>比如说我现在做饭，如果能享受在安住当下的状态当中，一心一意，满脑子都是如何把饭做好，对做饭这件事情就叫诚意。如果我们做着一件事情的时候，脑子想的都是其他事情，怎么可能把它做好？当我们懂得这一点的时候，自己就会去探索方法。在录视频的过程当中，如果我们是有诚意的，所有的念头都放在录视频这件事情上，是不是能找到问题？能发现问题，才有能力解决问题。</span></p><p><span> </span></p><p><span>很多人为什么解决不了问题？我没有发现问题。让我录，我就录，这不叫有诚意。学习也是一样，我学习很有诚意，学习的时候，有读不懂的，读不懂就放下了，这叫有诚意吗？有诚意的人不是这样做事情的，如果我不懂这个事情，我一定反复地去琢磨，这就是“格物”和“致知”。</span></p><p><span> </span></p><p><span>为什么诚意在第三步？我们得先格物和致知，这个时候才能看出有没有诚意。做生意是不是这样？或者在企业中工作的员工是不是这样？“我每天很辛苦，我做事情很累，我做了十个小时或十二个小时，为什么我的生意还不好？”那是我们认为的诚意而已，因为并没有去格物，也没有去致知，诚意到底在哪里？所以我们要懂得，一个人能不能做好事情的核心关键点——诚意。</span></p><p><span> </span></p><p><span>《大学》八条目里面，从<strong>“格物，致知，诚意，正心，修身，齐家，治国，平天下”，</strong>格物是第一道门，诚意是第二道门，只有格物还不够的，如果没有那么大的诚意，格物能格得好吗？碰到问题、困难就开始退缩了，都是我们的诚意不足所导致的。所以大家做事情的时候，一定要懂得一点，思维不要散乱，念头不要散乱，意不动，诚才能出来。</span></p><p><span> </span></p><p><span>《中庸》讲：<strong>“至诚如神。”</strong>当一个人达到至诚的状态，做事情像神一般的存在。我们看到过很多人做事情，说：“这个人真神。”神吗？是因为他至诚、至纯、至真，所以就如神了。比如说有的人开车，为什么会称为他神人？他做事情是流畅的，是轻松的，是享受的，是满足的状态，我们就会说那个人神了。这个不是玄幻的色彩，而是他达到了那种状态，就是神的状态。</span></p><p><span> </span></p><p><span><strong>“所谓诚其意者，毋自欺也。”</strong>什么叫自欺？第一层的自欺，我明知道这样是不对的，我还去做。很多人做事情当中，我们自己去体察，有没有自私的状态？有没有自欺的状态？这个事情我明明没有做好，但是我要把它表现得很好；这个事情我明明没有格物和致知，我就说懂了，我就说我明白了，结果就出现了托大，很多人做事情都是这样的。</span></p><p><span> </span></p><p><span>第二层的自欺是什么呢？是来自于潜意识的自我欺骗，这个是很多人自己都不清楚的。举个例子，当我们经历了一个事情，但这个事情是我们没做过的，我们会说：“老师，这个事情我不会，我做不了。”很多人接触一件新的事物，认为我不会，是不是潜意识的自我欺骗？潜意识从哪里来？是我们过去对这件事情的认知，我过去没有做过这件事情，就认为不会做。可是，人哪有什么事情是不会的呢？</span></p><p><span> </span></p><p><span>我们去看，所有的事情，不是人做出来的吗？所有的觉悟者，不是从人开始修上去的吗？我们说圣人，他也是从人修上去的，他只是超凡入圣了而已。只不过是我们自我意识的欺骗，把自己障碍住了而已。《论语》讲：<strong>“今女画。”</strong>天不设牢，是我们自己画地为牢，就是认为自己不会的那个念头，把自己困住了。</span></p><p><span> </span></p><p><span>第一层的诚意是什么？就是我们做任何一件事情的时候，能专注在当下，它是不散乱的状态，所有的全心全意，都在做这一件事情。我们只有这样，才能把事情做好。当我们很沉浸在这个状态当中，我们是享受在当下的，是满足于当下的状态的，会觉得时间过得好快。</span></p><p><span> </span></p><p><span>如果我们不能修成诚意，不懂得诚意的应用，我们就会是生活和工作的奴隶。所以我们做每件事情的时候，一定要懂得时时刻刻调整自己的念头和诚意，一定要把做事情当成是一种修行。在做事情当中，我们从这里面能学到了什么？能修成什么样子？</span></p><p><span> </span></p><p><span>第二层诚意是什么？我们的欲望越少，我们的念头就越诚，就越能安住在当下。想一想，当我们的欲望很多的时候，我们能安住在当下吗？举个例子，我们每天做事情的时候，情绪是不是一种欲望？当我们的情绪是有所动的，这时候他说了一句：“我不开心，宝宝不高兴了。”我们马上就乱了，他做什么我看着都不顺眼，我正在截着视频，也不做了，他在这经过我就难受，过，我就痛苦。“说话怎么那么大声音”我们的情绪动了，意就不诚了。</span></p><p><span> </span></p><p><span>我们在一个企业当中也是一样的，什么叫同事？一起做事一起共事的叫同事，如果因为同事的性格，或者他说的某一句话，他某一个行为影响到我们了，就不能专注在当下了。我们现在叫同事也好，同修也好，同修是干嘛的呢？同修是大家有一个共同修行的爱好或者方向，我们在一起修行而已，但是终究要各自修自己的。</span></p><p><span> </span></p><p><span>所以我们的欲望越少，情绪越少，我们才能越安住当下，不被别人影响，否则就被别人影响了。如果我们的欲望那么多，每天被这些欲望牵着走，意就乱了，所有的时间都浪费在这些事情当中的。</span></p><p><span> </span></p><p><span>当我们意诚的时候，我们的欲望越少，念头越少，什么事情我们自然就看得清清楚楚，心是不散乱的。再举例：我做了好多事情、我喜欢别人赞美我、喜欢每个人对我说话是柔情的、我喜欢每个人都看到我的付出，这时我们就开始做表面功夫了。我做这个事情，有没有人看见呢？有没有人夸我？万一没人看见，我岂不是亏了？如果我们的念头都在这些事情上，我们还能把事情做好吗？</span></p><p><span> </span></p><p><span>我们再反过来讲，一个人他是诚心诚意的，安住在自己做的事情当中，他是很享受在状态当中的，其他的人能不能看得到？并且也能感受得到，所以诚其意者是勿自欺的，是对自己没有任何欺骗的，我们内外是一样的，我们表里是如一的，这才叫诚意。</span></p></div>"
},{
    "title": "《大学》第五讲 自诚其意",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第五讲 自诚其意</strong></span></p><p><span><strong>“如恶（wù）恶（è）臭，如好（hào）好（hǎo）色，此之谓自谦。”</strong>自谦，就是自我满足的意思。如恶恶臭，如好好色，都是一种自我满足的境界。我们返回来讲，当我们的诚意达到至诚的时候，是没有诚意的，不需要诚了，就像我们开篇讲的：<strong>“大学之道，在明明德，在亲民，在止于至善。”</strong>达到至善，就无善无恶了。</span></p><p><span> </span></p><p><span>我们为什么还要止于至善？为什么我们说修行也好，做学问也好，做人也好，要止恶扬善呢？我们止恶，说明还有恶，我们扬善，说明还有恶，当我们达到至善的时候，就无善无恶了，就是王阳明先生所讲的：“无善无恶心之体，有善有恶意之动”，那个本心、良知、自性，是无善无恶、是至真至纯的。别人赞美我也好，误解我也好，是我们认为了以后，产生了情绪。就像这个东西好吃或者不好吃，都是我们的意念在产生分别，所以就产生了痛苦。</span></p><p><span> </span></p><p><span>《大学》里讲的诚意，其实讲到最高的时候，就是没有的，什么都没有。如恶恶臭，如好好色，此之谓自谦，都是自我满足的状态。比如说我们喜欢好的味道，好的颜色，这叫“好（hào）好（hǎo）色”。“恶（wù）恶（è）臭”，这个东西不好看，或者不好闻，我们自己开始下结论了，都是自我满足的一种心理，就是我们做什么都是一心一意的，甚至连欲望念头都没有，没有所谓的好坏善恶，赞美也好，鼓励也好，不解也好，这些东西都没有的。</span></p><p><span> </span></p><p><span>我们坐在这里讲课，有的人说我讲得好，只是和他的当下相应了；他说我讲得不好，也只是和他的当下不相应而已，他说的只是这样一种常态。而我们如果因为那个常态情绪在动，说明什么呢？我们诚意修得不到家，大家去体会，一层一层地往前递进的，随着诚意的修行越来越高，我们下一步才能讲正心，诚意有几分，心就能正几分。</span></p><p><span> </span></p><p><span><strong>“故君子必慎其独也。”</strong>君子要慎独的，慎独是什么意思？我们自己独处的时候，行为和众人在一起时是保持一样的，跟众人在一起相处的时候，我们要保持自己独自清醒的明，是清明的状态的，是独立思考的状态的，是不被他人扰乱的状态的。要不然我们怎么在人群当中潇洒自如？怎么在红尘当中淡若风轻呢？所以这是儒家教给我们要修的慎独。</span></p><p><span> </span></p><p><span><strong>“小人闲居为不善，无所不至。”</strong>懂得修身的人叫君子，不懂得修身的人叫小人。所以以前的小人不是贬义词，只是我们现在把它用偏了。闲居：就是自己独处的时候。不好的行为，就开始出现了，“无所不至”。举个例子，大家在一起聊天的时候，心里产生了一个想法，我看谁是特别不顺眼的，这个时候我不讲的，如果自己独处时，会说：“你看，刚才谁做的行为，气死我了；那个人怎么会是那个样子的？”而诚明的君子不是这样的，无论是很多人也好，或者人少也好，都不会讲这样的话，因为他的情绪根本没动。</span></p><p><span> </span></p><p><span>比如说他的性格很慢、很托大，那是他的性格，并没有影响我。只有我们逐渐地趋向于这个境界，我们的感召能力才越强，德行才越好，才能去承载更多的事情，包容更多的人。现在流行一句话：“你的事情做得有多大，修为有多高，取决于你能包容多少人。”如果我们不能去包容这些人和事，我们的德行拿什么彰显？修为用什么彰显？所以当我们懂得修慎独的时候，即使我对谁有意见我也不讲，我也不抱怨，久而久之，我们的抱怨连升都不升。</span></p><p><span> </span></p><p><span><strong>“见君子而后厌然。”</strong>厌然就是隐藏，看到君子的时候，这个行为就隐藏起来了。<strong>“掩其不善，而著其善。”</strong>把不好的那些地方藏起来了，把好的地方表现出来，这是不懂得修身的人做的事情。用生活当中的事情举例，在企业和团队当中，经常出现这样的事情。说谁在工作时间打游戏或者做私事，这时同事或者领导过来了，他马上就隐藏起来，假装在做计划，我们会发现，他的神色都是慌张的，是不是掩其不善，而著其善？挑好的讲。</span></p><p><span> </span></p><p><span>比如说家里有七八岁的小孩子，他在偷着打游戏，大人过来了，这个孩子一般都会怎么办？藏起来，“我在写作业呢，读书呢”；夫妻之间有没有这样的？在手机上正聊着呢，然后对方来了，“今天明明休息，你说我们老板，天天给我发信息让我加班”，这都是说明什么？大家自己平时很不注意自己的行为，所以见到别人的时候，就把这些事情开始逐渐地隐藏起来，把好的地方拿出来给别人看。</span></p><p><span> </span></p><p><span><strong>“人之视己，如见其肺肝然，则何益矣？”</strong>别人看到我们，就好像看到自己的心肝一样，清清楚楚，这样做又有什么意义？回到刚才的例子，公司的员工在偷着打游戏，别人是不是看得见？孩子在偷着玩游戏，说是在写作业，大人是不是看得见？夫妻的例子也是一样的，对方是不是感受得到？因为神色不是自若的，那时是没有诚意的，别人看得清清楚楚，“如见其肺肝然”，只是我们自欺欺人。</span></p><p><span> </span></p><p><span>所以开篇就讲，<strong>“所谓诚其意者，毋自欺也”</strong>，我们只要是自欺了，别人就看得到，只要没有自欺，做事情是坦坦荡荡的，别人看到的就是坦坦荡荡的，这个有体会吗？所以什么样的人才会隐藏？没有诚意的人，就会每天隐藏起自己的事情。</span></p><p><span> </span></p><p><span><strong>“此谓诚于中，形于外。”</strong>我们内心有多少诚意，别人通过我们外在的行为，就看到了，看得清清楚楚。比如说生活当中有很多朋友都会去抱怨，“我有个特别好的朋友，我们的关系非常铁，无所不谈，可是他自己出去创业的时候，或者做生意的时候，他不叫我，这个人忘恩负义。”知道为什么吗？因为我们平时的行为，别人都看得到，他心里清楚得很，我们可以做朋友，但是做事的风格，是不能一起共事的，他觉得我们是不行的。</span></p><p><span> </span></p><p><span>在企业当中是不是也这样？很多人觉得我付出了很多努力，我在企业工作六年了，为什么他才来了两年，公司提拔他了而没提拔我呢？我们自己会抱怨，可是别人见我们如见其肺肝然，我们做事情内在有多少诚意，人家通过我们的行为看得清清楚楚，只不过我们不知道罢了。所以抱怨有用吗？要相信他能做我们的领导，他能做老板，他一定看事情比我们看得明白，只是我们看不明白就在那里抱怨而已。所以“诚于中，形于外。”无论到什么时候，我们都要慎独，都要懂得修自己。</span></p><p><span> </span></p><p><span>有的家长说：“孩子不听我话，十几岁了，我说什么他也不听。”甚至有的说：“孩子七八岁，我说什么他也不听。”为什么？因为我们的话没有说服力，我们平时的行为不被孩子认同，我们对孩子说：“你要好好学习，天天向上。”那我们怎么还玩游戏呢？告诉孩子：“你要懂得爱护他人。”那我们怎么还天天跟人吵架呢？有的人说：“孩子啊，你不要说脏话，你要说赞美的话。”那我们怎么还骂人呢？是不是我们所有的言行举止，都在深深地影响着身边的人，被每个人都看得到的。</span></p><p><span> </span></p><p><span>所以说，我们每天的修行，不管自己的心念，思维，还是行为，我们都要很严格地去要求自己，这就是慎独。我们只有这样不断地要求自己，不断地去“自诚其意”，我们所展现、所自然流露在大家面前的才是最真实的，我们才不会累。不要等有人的时候，我再去规范自己的行为，来不及了。有人的时候我们表现出来的，就是我们平常的常态，不经意之间就出来了。</span></p><p><span> </span></p><p><span><strong>“故君子必慎其独也。”</strong>君子一定要修慎独的，当我们懂得修慎独的时候，才能诚意，有了诚意我们才能不自欺。如果我们是自欺的状态，其实别人都看得到。所以要想达到诚意的至高境界，一定是从慎独开始修的。我们独处的时候，我们就是这样的思维，就是这样的行为，这个时我们展示在所有人的面前，就是至诚的、至真的、至善的。</span></p><p><span> </span></p><p><span><strong>“曾子曰：‘十目所视，十手所指，其严乎！’”</strong>十是个量词，形容十双眼睛、十只手，对我们指指点点。“其严乎”，我们所做的每一个行为，是不是别人都看得到？刚才我们举的例子，在一个企业当中，我们觉得跟一个人的关系特别好，他创业不找我们，为什么呢？我们平时的行为举止、言行、做事的风格，他并不欣赏，能体会吗？</span></p><p><span> </span></p><p><span>比如说好朋友不也一样吗？我觉得我们的关系有多铁，可是他出去做事情了他并不找我们，因为关系还不错，但是我们平时的行为他都看在眼里的，只是平时不讲罢了。所以大家要知道，当我们身边的朋友都不帮忙、都不跟我们共事的时候，我们要明白，这是我们自己的问题，我们的行为都被他们看在眼里的，才有了那样的结果，抱怨是没有用的。</span></p><p><span> </span></p><p><span>现在很多夫妻的问题都出现在哪里呢？比如说男士和女士出门的时候，是不是都穿得很好？很漂亮，化化妆，收拾得很规矩，把最好的那一面都留给了别人，回家了，开始不注意形象了，把最丑的那一面都让对方看到了。时间长了，两个人就开始出问题了。所以大家听完这节课，一定要注意，在家里另一半的面前，也展现得好一点。但是“好”不代表是拘束，一定是保持自己雅正的样子。</span></p><p><span> </span></p><p><span>我们常常犯的错误就是：把最好的一面都留给了别人，把最坏的那一面都留给了家里。导致家里出问题了，所以说我们自己一定要懂得保持这样的一个常态，只有保持常态，是真实的状态，这个时候我们的慎独是修给别人看的吗？是修给自己的。当修给自己的，这就是“诚于中，形于外。”我们自然而然表现给外人的，就是那个状态，而不是刻意去修整的。</span></p><p><span> </span></p><p><span>从开始修行的时候，我们是不是要用到戒？就是现在这个行为我明明是做不到的，但是我知道了，我不停地去克制我自己，让我自己的行为符合某一个点，当我们长时间地去戒的时候，自然而然就成了那个状态。那慎独不是一样吗？我去修慎独，平时我很注意自己的言行举止，它就成为我们的常态了。</span></p><p><span> </span></p><p><span>举个例子，现在的明星有一个词，叫表情管理。他们是要长时间地去练习表情管理的，不停地要面对镜头，不停地去拍戏，所以他天天去练习，练着练着就成为他新的习惯了。这时，所呈现出来的自然就是那个状态。</span></p><p><span> </span></p><p><span>再比如说，生活当中有很多有修养的男人、很雅致的女子，这些人，我们会发现，他们无论在什么状态下，在家里也好，没人的地方也好，都保持那个状态，每天就是这样的行为规范。很多人会说：“那我在家生活得多不自在，每天还要注意自己的形象。”任何事情都要有度，我们注意自己的形象，绝非拘谨，我们只要有这样的心念，我们的行为自然是这样的。</span></p><p><span> </span></p><p><span><strong>“富润屋，德润身，心广体胖，故君子必诚其意。”</strong>富润屋，人有钱了，是不是开始装饰屋子？我们再把屋扩大一下，当一个人有钱了或者有财富了，是不是可以滋润很多东西的？甚至可以滋润身边的人，可以帮助更多的人，可以让自己的家过得更好，可以让自己的亲朋好友跟着也受点益，可以装饰自己的房子，都叫作富润屋。</span></p><p><span> </span></p><p><span>“德润身”，当一个人有德行的时候，身心是安泰的。大家去观察，有德行的人是不是通常是快乐的？是喜悦的？内心都是坦荡的，这时自然身心皆安。一个人的欲望越多，他的身，就越不安。急匆匆的人，或者每天忧虑的人，每天思虑过多的人，每天烦恼过多的人，爱抱怨的人，身体都不好，为什么呢？他的身心是不健康的，所以有德行的人，是不抱怨的，是喜悦的状态，都是光明的能量，这时他的身心自然就安泰。</span></p><p><span> </span></p><p><span>“心广体胖”，胖就是身心安泰的意思。我们的心越广，身心就越稳。很多人的心量是很狭隘的，一点事情都装不下的。别人的一句指责、别人的一句不在意、别人的一个看法，心就开始乱了。这时身体也会变得不好，心性也会变得很容易波动。所以说，有德行的人，身体就会好，因为他是润身的。心广的人，自然身心安泰。</span></p><p><span> </span></p><p><span>“故君子必诚其意”，我们怎么才能做到身心安泰呢？就是“必诚其意”，当我们不自欺，心性就是光明的。比如说我们在公司搞了一个小动作，是不是担心别人知道？比如说小孩子偷着玩手机了，是不是担心父母看到？只要我们不能诚意，只要还在自欺，我们的身心就不可能安稳。</span></p></div>"
},{
    "title": "《大学》第六讲 躬行君子",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第六讲 躬行君子</strong></span></p><p><span> </span></p><p><span><strong>《诗》云：“瞻彼淇澳yù，菉竹猗猗，有斐君子，如切如磋，如琢如磨。”</strong>引用《诗经》国风里面的一篇《卫风》，形容卫国的一位国君，叫卫武公，九十五岁，当政四十九年，是卫国的第十一代国君。这段话是形容卫武公的行为、德行和他内在的修为。</span></p><p><span> </span></p><p><span>《诗经》那时多数都是借物言情，借赞美一个物，来表达一份情感，或者赞美某一个人、某一位圣贤。瞻：是看的意思。彼：就是彼岸。淇：是淇水。澳：是形容岸边。看对面的岸，淇水边，郁郁葱葱，那么茂盛。“菉竹猗猗”，种了很多的竹子，这一片地方是卫武公种的，也是用来形容岸边茂盛的样子，美妙的、优美的样子。“有斐君子”，斐是才华的意思，君子是有德行的，有这样一位德才兼备的人，就是赞美卫武公的。</span></p><p><span> </span></p><p><span><strong>“如切如磋，如琢如磨。”</strong>什么叫切磋？如果把石头打造成玉器，是不是先得切？把棱棱角角、不好的地方先切掉，然后再磋，磋就是细磨，所以叫“如切如磋”。“如琢如磨”，就是精雕细琢了。有句老话叫：“玉不琢，不成器”，比如以前讲，切磋一下武艺，切磋一下棋艺。</span></p><p><span> </span></p><p><span>整个这段话是形容卫武公这个人的修为的，每天都是“如切如磋，如琢如磨”。现在我们每个人做事情，是不是也需要切磋和琢磨的？比如说我们不停地去探讨，不停地去总结这件事情，是切磋吧？接下来，再去配字幕，再去美颜，再去修声音，是不是就是琢磨的过程？任所以何事情都是“如切如磋，如琢如磨”的。</span></p><p><span> </span></p><p><span>我们修行更是如此，切磋，先止恶扬善，把我们身上不好的行为，大的，能看得见的问题先切掉，接下来就是琢磨，每天我起了一个什么细微的情绪，我觉察到了；我看谁不顺眼了，我知道了；我的包容心不够，我知道了；我不能做到念念利他，我知道了。这就是不断地反复地琢磨的过程。切磋和琢磨，是我们做事情也好，修行也好，做学问也好，一个必经之路，也是每天我们要练习的。</span></p><p><span> </span></p><p><span><strong>“瑟兮僩xiàn兮，赫兮喧兮。”</strong>瑟：庄重的样子。僩：威严的样子。“如切如磋，如琢如磨”是过程。“瑟兮僩兮，赫兮喧兮”是结果，就是很威严，很庄重的样子。赫是光明的，喧兮就是我们不停地彰显光明的、庄重的、威严的样子，所以我们做任何事情不要着急求果，我们把切磋琢磨的过程做好了，光明威仪的样子自然就出来了。</span></p><p><span> </span></p><p><span><strong>“有斐君子，终不可諠xuān兮。”</strong>这里的諠是忘记的意思，有这样一个德才兼备的君子，别人终究不会忘记他的。我们在一个企业、在一个团队当中做事情是不是也一样？这个事情确实是我们经过了很多的努力做起来、打下来的基础，别人是不会忘记我们的功劳的。</span></p><p><span> </span></p><p><span><strong>“如切如磋者，道学也；如琢如磨者，自修也。”</strong>首先我们要不停地去切磋，这个是合道的，如果我们用修行上的话讲，我们不停地止恶扬善，把这些大的、不好的行为去掉，我们才能让自己符合良善，符合道的运作规律。</span></p><p><span> </span></p><p><span>“如琢如磨者，自修也。”这个就是修行了，我们要不停地反复地琢磨，这就是自我修正的过程，所有的事情都一样，先是切磋，让自己合道，去掉那些大的、显而易见的那些不好的，然后接下来“如琢如磨”，精雕细琢，这就是自我修正的过程了。</span></p><p><span> </span></p><p><span>所以我们做的每一件事情都是我们当下的载体，都是用来自修的，所以大家一定要懂得自我觉察，如果我们不懂得自我觉察，做事情就是做事情，如果我们懂得自修，懂得让自己合道，做事情就是我们修行的道场。</span></p><p><span> </span></p><p><span><strong>“瑟兮僩兮者，恂xún 傈lì 也。”</strong>恂就是惶恐的，傈就是战栗的样子，“瑟兮僩兮”是果，庄重和威严哪里来的？我们不停地做每件事情、讲每句话、每一个行为，我们都是惶恐的，都是战栗的。以这样的一种态度做事情，我们就会很小心谨慎，这就是《诗经》里所讲的：“战战兢兢，如临深渊，如履薄冰”。比如说，一个人的行为不端，我们怎么说？说：“请你自重”，如果我们懂得自修自重，做每件事情都是小心谨慎的，我们的庄重和威严自然就出来了。</span></p><p><span> </span></p><p><span><strong>“赫兮喧兮者，威仪也。”</strong>赫兮喧兮，那个光明的样子，也是结果。怎么才能出来光明的样子呢？“威仪也”，我们不停地去恂傈，不停地去慎独，不停地做事情，很谨慎、很是注意自己的言行，我们就有威仪了，就庄重了。我们有威仪以后，自然就是“赫兮喧兮”，那个光明的样子自然就出来了。</span></p><p><span> </span></p><p><span><strong>“有斐君子，终不可諠兮。”</strong>这样的君子，人们是不会忘记他的，因为他的德行，足以彰显。他的光明、他的威严、他的庄重，足以影响身边的每一个人。</span></p><p><span> </span></p><p><span><strong>“道盛德至善。”</strong>这是两个词，一个词是“道盛”，刚才讲，“如切如磋者，道学也”，所以当我们不停地让自己的行为、心念、言行、德行，都让他去合道的时候，我们这个道就会很茂盛的样子，很充沛的样子。道是本，道怎么来体现？用德来体现，所以叫“道盛，德至善”，德行是至善的。</span></p><p><span> </span></p><p><span><strong>“民之不能忘也。”</strong>这个时候人民，别人是不会忘记我们的。我们再来讲德，我们经常会说：“那个人很有德行。”我们为什么会说他有德行呢？有没有可能是那个人什么都没做过，我们说他有德行，没有可能吧？一定是那个人做了很多帮助别人的事情，我们才说：“他这个人真的有德行。”</span></p><p><span> </span></p><p><span>我们现在去学习圣贤的文化，比如我们说孔子很有德行，说舜帝、唐尧很有德行，为什么说他有德行？他一定是做了很多帮助他人的事情，我们才说这个人有德行。在一个企业当中、在一个团队当中不也一样吗？帮助他人最多的那个人，我们说那个人很有德行。</span></p><p><span> </span></p><p><span>我们再去想想生活当中，很多人抱怨说：“我的人际关系不好。”为什么呢？没有帮助过别人，人际关系就不好。反过来讲也是一样的，比如有的人会说：“我特别怀念我的爷爷，或者怀念我的某一位亲戚。”为什么？他对我特别好，有没有人跟爷爷奶奶不亲的？为什么不亲？他没对我好，他的德行并没有惠及我们，所以我们不记得他。</span></p><p><span> </span></p><p><span>再举例，生活当中我们跟某一个老板工作过，或者我曾经有一个朋友，现在有可能不在一起，也不太联络了，但是一提到那个人，我们还会说：“当时他对我有知遇之恩，他确实帮助过我。”说明他的德行对我们用过，所以我们才记得他。</span></p><p><span> </span></p><p><span>所以大家一定要明白这个道理，德行是靠我们的行为不停地去亲民，不停地去帮助他人，所以别人才不忘记我们。这个时代的人们不也一样吗？我们赞美的那个人，一定是对他人、对时代、对国家做过贡献的人，我们才说这个人真的很有德行。</span></p><p><span> </span></p><p><span><strong>《诗云》：“於wū戏hū！前王不忘。”</strong>於戏是一个感叹词，我们是不会忘记前王的，这一段出自于《周颂》，颂扬周文王和周武王的，说人们是不会忘记周文王和周武王的，为什么呢？</span></p><p><span><strong>“君子贤其贤而亲其亲，小人乐其乐而利其利。”</strong>君子是看到了前王的贤德，所以是不会忘记他的。举个例子，现在我们不忘记孔子，不忘记王阳明先生，不忘记《大学》的作者曾子，不忘记孟子，为什么呢？是我们不断地学习传统文化，我们看到了人家贤德的那一面。</span></p><p><span> </span></p><p><span>“小人乐其乐而利其利”，小人也不忘记他，为什么呢？小人受到过他的利益和恩惠，所以不会忘记他的。我们再讲回来，《诗经》的这两句，说人们为什么不忘记周文王和周武王？贤德的人看到了周文王和周武王的圣贤之心，而老百姓为什么不忘记他呢？受了他的恩惠和利益了。</span></p><p><span> </span></p><p><span><strong>“此以没世不忘也。”</strong>因为这些原因，所以后世的人是不会忘记他们的。再举生活当中的例子，很多人在生活当中会抱怨，比如说做企业的抱怨什么？我的员工不给力，我为什么没有优秀的员工；有的人在生活当中抱怨说另一半特别地不好；有的人说我的身边没有贵人，我没碰到好老板。</span></p><p><span> </span></p><p><span>首先我们自己有没有贤德的那一面呢？我们要有贤德的那一面，才能看到他人贤德的那一面，如果自己没有贤德的那一面，又怎么会感召贤德的人呢？即使感召来了，也没有用，他在我们身边也留不下，好的员工不是自己培养的吗？好的朋友，不是自己吸引和感召的吗？</span></p><p><span> </span></p><p><span>我们自己如果是一个躬行君子，就会感召有君子之风的人，如果自己是个利欲熏心的人，也只能感召利欲熏心的人到我们身边来，我们懂得这个道理的时候，我们不用去抱怨，先看看我们自己是不是个谦谦君子？我们懂不懂得修正自己？当我们懂得修正自己的时候，才能感召更好的人来到我们身边。</span></p></div>"
},{
    "title": "《大学》第七讲 自明惟新",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第七讲 自明惟新</strong></span></p><p><span><strong>《康诰》曰：“克明德。”</strong>《康诰》是《尚书》里面叫《周书》的一篇，写周朝的事情。克是能够的意思，要能够明德。一个人做事情也好，一个人的修为也好，一个人治理天下也好，必须要懂得能够去“明德”这件事情。</span></p><p><span> </span></p><p><span><strong>《大tài甲》曰：“顾諟天之明命。”</strong>大甲是商朝商汤的孙子，商朝的开国君主、天子。提到商汤，不得不提到一个叫伊尹的人。伊尹活到一百岁，辅政五十年，辅佐五代君王，太甲是商汤的孙子，也是伊尹来辅政的。当时太甲坐上天子位以后，不懂得明德，不懂得修自己，不懂得爱民。然后伊尹就做了一件事情，把天子流放了，流放到桐宫，就是当时商汤陵墓的附近，说：“你到那里去反思吧，你这样治理朝政是不行的。”让他在那里反思了三年，太甲重新悔悟了，后来又被伊尹接回来，接回来以后，伊尹就作了的这篇《大甲》，就是《尚书》里面的这篇。</span></p><p><span> </span></p><p><span>“顾諟天之明命。”顾是回顾的意思，明命是什么意思？就是“明德”才是天命。看看我们的先王商汤，他这一生都在做着“明德”的事情，他这一生都是爱民如子的，这个是非常重要的一件事情。</span></p><p><span> </span></p><p><span><strong>《帝典》曰：“克明峻德。”</strong>《帝典》是《尧典》，唐尧当时让位于舜帝的时候，写的这篇《帝典》。峻：大的意思。必须要能够去明自己的很大的那个德行，才能治理好天下。唐尧当时为什么让位给舜帝呢？就是觉得他是有德行的，所以作了这一篇《帝典》，来告诉他：“你必须要有更大的德行，你要心怀天下，才能做好天下共主的位子。”引经据典，找了《尚书》里的三篇，都在讲一个事情，就是“明德”。</span></p><p><span> </span></p><p><span><strong>“皆自明也。”</strong>德行都是靠自明的，这个是任何人无法给予我们的，他不像是外物。举个例子，我们没有钱，别人可能给我们；没有某一个东西，别人可能给我们；没有车子，别人可能给我们，但是这个德行，都得要靠自明的，这就是《大学》开篇讲的“明德”。</span></p><p><span> </span></p><p><span>我们现在无论在社会上做任何事情，如果我们的德行不够好，怎么可能感召更多的人？如果我们的德行不够好，我们的客户怎么会愿意跟我们合作呢？比如说我们的人际关系不好的时候，我们是不是要看看自己的德行够不够？如果我们没有做过帮助别人的事情，德行怎么会好呢？</span></p><p><span> </span></p><p><span>所以大家一定要明白，首先是要向内明。我们不断地向内明的时候，我们自己内在有一些仁德，有一些德行和光明的时候，我们开始外用了，外用是什么？就是亲民。《尚书》里面这几位帝王，这几位天下共主，是不是都在讲这件事情？比如说太甲，他被放逐了三年，他回来以后，他修自己的德行，他才能把这个德行用于民。</span></p><p><span> </span></p><p><span>大家想一想，在生活当中也好，在事业当中也好，我们是给不了别人我们自己没有的东西的。我们自己的内在如果都没有德行，怎么可能靠我们的德行去帮助他人呢？</span></p><p><span> </span></p><p><span>很多人说：“我想给别人快乐。”如果我们自己本身都不快乐，怎么能给别人快乐呢？有的人说：“我想给别人智慧。”自己都没有智慧，怎么给别人智慧？我们的内在都是要靠自明的，都是要不停地往内修的。所以每个人一定要注重自我的修养，注重自己的提升。</span></p><p><span> </span></p><p><span>我们在工作当中或在生活当中，遇到事情的时候不要着急去抱怨，看看我们自己的修为够不够？看看我们自己的包容能力够不够？看看我们自己的仁爱之心够不够？看看我们自己的诚意足不足？不要碰到一个事情就是别人的问题，碰到一个事情就是我不会，碰到一个事情就是宝宝太难了。那说明我们的诚意还不够，如果我们的诚意是够的，所有的事情都可以去用心地琢磨，用心地体悟，可以去问其他人的。</span></p><p><span> </span></p><p><span>整个《大学》告诉我们，<strong>“自天子以至于庶人，壹是皆以修身为本”，</strong>这里面举了几个例子，这些天下共主、天子都在向内明，我们这些人也是一样的，大家去想一想，我们当下所做的工作，如果不向内明，我们能把它做好吗？靠外在的贪求和索取，是解决不了我们自己的问题的。所以大家一定要懂得，无论我们做什么事情，大到修身养性，小到工作当中的每一件事情，都要懂得向内求，这就是自明。</span></p><p><span> </span></p><p><span>汤shāng之《盘铭》，汤就是指的商汤。以前人们说过的四大明君，叫尧舜禹汤，就是这个汤。《盘铭》是什么呢？就是刻在青铜器具上的，用于警戒的一些文字。</span></p><p><span> </span></p><p><span><strong>汤之《盘铭》曰：“苟日新，日日新，又日新。”</strong>我们经常在生活当中，在企业当中也好，经常谈到一个词叫创新。新从哪里来呢？不断地致知，不断地学习，从进步当中来。大家一味地追求创新，如果我们没有进步会有新吗？连旧的都做不好，追求创新的时候是表，如果一个人是没有进步的，在任何岗位都无法创新。</span></p><p><span> </span></p><p><span>比如说，我们去学新的学问，我们有新的理解，是不是把之前的东西理解好了才有新的理解？《论语》讲：<strong>“温故而知新。”</strong>历代的文化是不是一样的？比如现在所讲的《大学》，《大学》的作者曾子，是孔子的学生，他是不是也温故而知新呢？他要学习老师的文化，学习孔子的思想，他引经据典，引用《诗经》，又引用《尚书》里的话，是不是都是温故？这就是“苟日新，日日新，又日新”。</span></p><p><span> </span></p><p><span>只有每天学习，是保持进步的状态，我们才有新的东西、新的理解，否则“新”从何而来？所以一定是格除了旧的东西，新的东西才会生成。大家每天应该要求的是自己进步，我每天进步一点点，新就出来了。</span></p><p><span> </span></p><p><span>再举个例子，有的人喜欢乐器，哪怕每天就弹十分钟，三年以后也能是个高手。有的人说，我每天研究一个新的菜，三年以后会有多少？满汉全席。所以每天保持进步一点点很重要，就怕我们没有自我要求，每天人云亦云。然后这一天一看，自己了无所得，安排我做什么我就做什么，我们的进步从哪里来？</span></p><p><span> </span></p><p><span>大家一定要懂得这个道理，这都是自明的过程，我们要自己去追求进步，这个东西没有任何人能给到我们的。大家去看一看，我们经常说的那些优秀的人，可是我们不知道那些优秀的人的背后，比我们努力多少倍，我们看到的都是人家的结果，可是人家背后的进步的程度，何止是日日新。</span></p><p><span> </span></p><p><span>我们修行也是一样的，只有不断地去修正过去的不足，我们才有新的思维，新的心念，新的行为，否则什么都没有。</span></p><p><span> </span></p><p><span><strong>《康诰》曰：“作新民。”</strong>这里的新，当进步讲，一定要做一个进步当中的人，我们越是爱身边的每一个人，我们越是心疼哪一个人，就越要让他成长。所以大家要明白，家里有孩子的，知道该怎么爱他吗？不是说什么都不让他干是爱他，他一点苦都没吃过，我们觉得那是爱，那是没有智慧的爱，将来他什么都不会，他出去经历不了一点点的风雨，别人一个白眼、一个误解，他就受不了了，就别谈做事情了。</span></p><p><span> </span></p><p><span><strong>《诗》曰：“周虽旧邦，其命惟新。”</strong>因为周朝是商朝下面的一个邦国，但是周文王治理有方，已经占了三分之二的领土，但是他并没有起义，后来为什么周朝得了天下？他虽然是一个旧的邦国，但是他在遵循着天命，不停地往前进步，因为天命是惟新的，天道是进步的，我们现在这个时代也是进步的。</span></p><p><span> </span></p><p><span>很多人是不是也经常抱怨：“我做生意明明很努力，我每天工作十二个小时，我在这个公司我来了三年了，我兢兢业业的，我每天付出很多，天天加班，可是为什么老板不给我涨工资？为什么辞退员工的时候，他辞退我了？我这么努力，为什么生意做不好呢？”</span></p><p><span> </span></p><p><span>时代在进步，有的人是不是这样的，出来一个新的东西看不起，“那东西不是正途，那个东西能行吗？”那是停留在过去的认知当中，对这件事情所下的判断，所以抱怨是没有用的。整个这一段都在讲“新”，都在讲进步，天命也是惟新的，可是如果我们自己没有进步，这是非常可怕的事情。</span></p><p><span> </span></p><p><span>接下来总结了，<strong>“是故君子无所不用其极。”</strong>现在很多人一说，无所不用其极，成了坏事了，成了卑劣的手段了，其实以前不是这样的。君子提升自己，把任何一件事情都追求到极致，这叫“无所不用其极”。用现在的话讲，很好理解，生活当中处处都是修行，所遇到的每件事情都是让我们提升自己的，这叫“无所不用其极”。</span></p><p><span> </span></p><p><span>比如说今天经历了谁的不听话，这是来修正我自己的，看看是不是我哪里做的不足？当出现了一个事情我不会，是不是修行的机会来了？不会说明什么呢，这个事情我当下不了解，没有找到合适的方法，我就去不停地格物，是不是就不停地致知？然后就有了诚意，有了诚意就是这个状态。</span></p><p><span> </span></p><p><span>当我们有足够的诚意，就是我做任何事情都是无所不用其极的，为了提升自己，为了把这件事情做好，任何事情都是我修行的方法，我把任何事情都追求到极致，用来提升自己。所以大家一定要明白这个道理，在追求自我的路上，修正自己的路上，学习自己的路上，无所不用其极，这才是我们该有的学习的状态。</span></p></div>"
},{
    "title": "《大学》第八讲 知其所止",
    "author": "虚空先生",
    "date": "2022-07-28",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第八讲 知其所止</strong></span></p><p><span><strong>《诗》云：“邦畿jī千里，惟民所止。”</strong> 邦：以前指的京都。畿：就是郊区。是从京城到郊区数千里，这么大的地方都是让人民居住的，所以叫惟民所止。</span></p><p><span> </span></p><p><span><strong>《诗》云：“缗mín蛮黄鸟，止于丘隅yú。”</strong>缗蛮黄鸟，就是那种小的黄雀，形容这个鸟的叫声，吱吱喳喳叫的小黄雀，它是止于丘隅的，止就是栖息的意思。这样的一只小黄雀，它是栖息在山坡上其中的一个角落的。小鸟也懂得止，也懂得栖息，也懂得它该安住在哪个地方。接下来孔子开始感叹了！</span></p><p><span> </span></p><p><span><strong>子曰：“于止，知其所止，可以人而不如鸟乎？”</strong>于止，“知其所止”这件事情，怎么人还不如鸟呢？很多人不停地奔波、不停地做事情，可自己为了什么都不清楚，连自己的止都没有了。比如说我们每天做事情也是一样的，如果做着做着都不知道这件事情是为什么而做？是不是越做越累、越做越痛苦？就沦为工作的奴隶了。</span></p><p><span> </span></p><p><span>所以我每天都在跟大家讲，让自己放松一点。大家要明白，我们做每件事情，它都是载体，都是为了让我们不停地修正和提升自己的，如果我们把这个东西丢了，就沦为工作的奴隶了。每天的工作只有痛苦，只是熬，快点熬，把这个事情做完，而不懂得我做这件事情，在这里面能看到哪一些不足，如何利用这件事情不断地去修正自己，这才是我们修行的意义。</span></p><p><span> </span></p><p><span>做任何事情，我们都要知道一个止，找到那个止，做事情才有方向。这好比是小鸟一样，飞着飞着累了，它得知道往哪停，所以它会懂得止于丘隅。《诗经》这一段是当时有的文人墨客写出来讽刺的。“缗蛮黄鸟，止于丘隅”写的是什么呢？当时周朝有个周幽王，周幽王总施暴政，人民每天辛苦地劳作，特别的痛苦，所以才有人感叹说：“我们活的还不如个鸟。”鸟还能每天自由自在地飞翔。</span></p><p><span> </span></p><p><span>我们现在是不是经常有人这样说：“宁愿做一只小小鸟。”为什么？鸟儿自由。想让自己做小小鸟的，说明当下不自由，说明当下的生活是很痛苦的，每天是被很多东西束缚的。我们现在自己会怎么讲：“都是被那些事情牵绊的，被家人牵绊的，被孩子牵绊的，被公司牵绊的，被生活牵绊的。”因为还不懂得放下，当我们尝试着放下，根本没有那么多的牵绊，往往我们都觉得是别人离不开我们，但实则是我们放不下别人而已。</span></p><p><span> </span></p><p><span>每次来现场听课的人，会有人说：“我来这里好不容易，老师，我出来听两天课，真是太难了。”到这里两天，如果尝试着往家打一个电话，人家可能活得更自在。我们去体会，生活当中到处都是这样的，比如说有的人，从一个公司离职是不是也会这样想，“公司离了我能行吗？”会发现离开我们是一样的，没有任何区别。</span></p><p><span> </span></p><p><span>大家总是觉得，好像是别人放不下我们，实则是我们自己放不下别人。所以人都是被自己的念头所困，我们不知道每天要干什么，不懂得停止和放下，所以就被这些事情牵绊得很痛苦，一点都不自在。</span></p><p><span> </span></p><p><span>人活一辈子，到底为了什么呢？有的人说了我赚钱，赚钱是为了什么？生活得更快乐对吧？生活得更好，结果我们赚了点钱，自己变得更痛苦了，让全家人变得更累，把自己迷失掉了。那我们赚的那点钱又有什么意义？我们到底在干嘛呢？要是不知道止，是非常可怕的事情。</span></p><p><span> </span></p><p><span>整个《大学》经常提到“止”，止有三层含义，第一层的止是我们到底要做什么？第二层止是我们现在正在做什么？第三层止就是要懂得停止。停止一些让我们不快乐的事情，停止一些让我们束缚、痛苦、还有烦恼的事情。所以我们天天修行，是不是不停地在修止？不停地去掉一些不好的东西，去掉一些不好的杂念和欲望，这都是止，这叫止恶扬善，止住我们那些不好的行为，不好的心念，才能让我们变得更自在、更快乐。</span></p><p><span> </span></p><p><span>整个这一段都在告诉我们止的重要性。每个人都要去思考，我们自己的止到底是什么？我们到底要去做什么？我们能做什么？我当下还有哪一些东西，是需要停止的，是需要修正的，是需要放下的。</span></p><p><span> </span></p><p><span><strong>《诗》云：“穆穆文王，於缉熙敬止。”</strong>庄严肃穆的周文王，於wū是个感叹词。缉熙:光明的意思。敬：周文王所散发出来的光明，是让别人敬重的。止：止于敬重。庄严肃穆的周文王，别人看到他就会觉得很光明，让别人很敬重、很敬畏。</span></p><p><span> </span></p><p><span>我们再讲这个止，我们用到生活当中，比如说，看看别人对我的印象，止于哪里了？别人现在是怎么评价我的？他对我会用一个什么词，就是止于什么了。我们再反过来想，我想用一个什么词，形容身边的哪一个人，就是他止于哪里了。举个例子，这个人很安静，就是止于安静了；那个人抱怨很多，止于抱怨了；那个人好自私，就是止于自私了。别人会用什么来评价我，就是被止于什么地方。所以这段话是告诉我们，人们对周文王的理解，是止于光明，是止于敬重的。</span></p><p><span> </span></p><p><span><strong>“为人君，止于仁。”</strong>我们生活当中会有不同的止。我们延伸一下，当我们处上位的时候，要止于仁。无论我们是谁，只要是处上位的，哪怕下面只有一个员工，我们也是上位。为人君要止于仁，对待下面的人要有仁德，要有仁爱之心。</span></p><p><span> </span></p><p><span><strong>“为人臣，止于敬。”</strong>对我们的上位之人有没有敬重？对我们的君主，对我们的长辈，对我们的领导，有没有敬重之心？敬分成两个：一个是敬人，一个是敬业。也就是敬我们所做的事情。无论当下我们在做生意也好，或在任何一个团队当中工作也好，看看我们有没有敬畏当下所做的那个事情，这叫敬业。所以无论我们做当下的哪一件事情，要懂得敬畏人，要懂得敬畏自己所做的事情，这都是止。</span></p><p><span> </span></p><p><span><strong>“为人子，止于孝。”</strong>我们做人家孩子的，一定要止于孝道，一定要去孝顺父母。</span></p><p><span><strong>“为人父，止于慈。”</strong>如果要是做人家父母的人，我们要慈爱，要对自己的孩子是有慈爱，是有慈悲之心的。</span></p><p><span><strong>“与国人交，止于信。”</strong>这个国人是什么意思？是周围的人，说我们与周围的人相交，要止于信。我们讲话是有信用的，我们这个人做事情是讲信义的。</span></p><p><span> </span></p><p><span>儒家告诉我们有五伦关系，有君臣，有父子，有兄弟，有夫妇，还有朋友，这里面为人君，为人臣，就是君臣的关系有了。为人子，止于孝，为人父，止于慈，父子关系也有了。我们再讲这里面没有的，兄弟之间的关系，有一个词叫“兄友弟恭”，这个止就是做哥哥的人，要友爱兄弟，这叫友。弟恭是年龄小的人对我们的哥哥，对我们的姐姐，要有恭敬的状态，这是兄的止和弟的止。</span></p><p><span> </span></p><p><span>夫妇关系，那夫妇之间该止于什么？第一要止于爱，就是关心对方，爱护他，关心他。第二个就是敬重，要彼此敬重，彼此尊敬。第三点是包容，要容，因为在生活当中，在一个家庭当中，会有非常多的小事和琐碎的事情发生，如果不懂得彼此包容，每天就会不停地争吵和烦恼，所以这是夫妻之间的止。再有就是朋友关系，“与国人交，止于信”，讲诚信的，都要彼此相信的，这是我们延伸出来的儒家讲的五伦关系。</span></p><p><span> </span></p><p><span><strong>子曰：“听讼，吾犹人也。必也使无讼乎！”</strong>这是我经常讲的一句话，也特别喜欢的一句话。听讼，就是审查审理官司的时候，我和别人是一样的，不一样的是什么？是“必也使无讼乎”，这是孔子的止。一般的人的止是什么呢？我审理这些案件的时候，给分辨是非对错，断案到底谁对谁错，但是孔子的止不是这样的，是我不让这件事情发生。我们的止不同，是不是行为就不同？所以孔夫子做教化于民的事情，他不停地去培养人们的德行，不停地让人们懂礼，让这个事情不发生，才是孔夫子的止。</span></p><p><span> </span></p><p><span>很多人都在问：“我如何解决婆媳关系？在公司碰到一个小人怎么办？别人骗我了怎么办？别人不在意我怎么办？”是不是天天都有这样的问题？我们要懂得不断地学习、不断地修行，让我们增加了一些智慧以后不是为了处理哪件事情，今天教给我们怎么处理这件事情，换一件事情就不会了。</span></p><p><span> </span></p><p><span>修行是什么呢？是让我们自己有智慧，回去能面对生活当中的所有事情，那个才是我们的止。是不让事情再发生，是不让大家再沉浸在这些是非对错当中，而不是争辩，与老公之间、与老婆之间、婆媳之间到底谁对谁错？而是让我们能超然物外，不要在这些是非对错当中纠缠不休，这时我们的生活才能自在，才能喜乐。</span></p><p><span> </span></p><p><span><strong>“无情者不得尽其辞，大畏民志。”</strong>这个无情有两层意思：第一层无情是情况不属实的人。在我这里你情况不属实不能讲那么多，到我这里都讲不下去的；第二层是这件事情我们虽然可能占理了，但是情分说不过去。</span></p><p><span> </span></p><p><span>举个例子，在生活当中是不是经常有这样的人——得理不饶人，甚至有的人走在商场，我摔倒了，开始索赔，“你没贴警示牌，所以我摔倒了。”甚至现在有人摔倒了没人敢扶，为什么？扶了我，我就开始找你，就开始告你，赖上了。这些事情占不占理？占理可是不占情分。这里孔夫子教给我们的是：当人们懂得不断地去提升自己内在的道德修养的时候，“无情者不得尽其辞”，情况不属实的人，和只有理但没有情分的人，在我这里不好意思讲这些话的。</span></p><p><span> </span></p><p><span>在生活当中，当我们在一个特别有仁德人的面前，不好意思讲很多，实在讲不出口，所以叫“大畏民志”，都让人民产生敬畏的这种志向。想一想，我们不断学习、不断修行的过程当中，我们的志向会不会发生变化？所以孔子去做教书育人的事情，他才能成为万圣师表，所以这都是因为止的不同。</span></p><p><span> </span></p><p><span><strong>“此谓知本。”</strong>这个才是知本。《大学》讲到：<strong>“物有本末，事有终始，知所先后，则尽道矣。”“自天子以至于庶人，壹是皆以修身为本。”</strong>这一段也是告诉我们，要知止，要懂得修身为本，这才叫知本。</span></p></div>"
},{
    "title": "《大学》第九讲 修身齐家",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第九讲 修身正心</strong></span></p><p><span><strong></strong></span></p><p><span><strong>“所谓修身在正其心者。”</strong>修身的前提要先正心，如果我们的心是不正的，我们的行为很难变得端正。何为正心呢？很多人的理解是不做坏事，善良，心就是正的，实则这里说的正心，不是那个概念。</span></p><p><span> </span></p><p><span>比如说，如果我们斜着拿杯子，能说它正吗？它是歪的，但它不是坏的，只是拿的不端正，如果在动的状态下它也不叫正，所以正心是什么意思？不上不下，不左不右，也就是如如不动的状态，叫正心。</span></p><p><span> </span></p><p><span>我们的心只要是动的，就有情绪，我们的情绪动，我们的心就跟着动，我们的行为自然开始有偏颇。我们心的不正，是从哪里来的呢？从意上来的，意就是念，也就是我们常讲的念头，心和念本为一体，不动的时候叫心，动的时候叫念，所以叫心念。</span></p><p><span> </span></p><p><span>这个念，就是诚意的意，当我们的意动了，我们才会有情绪，当情绪动了，心就不正，心不正，行为就开始偏颇。修身的前提，一定是心正，心正的前提一定是意不乱，没有那么多的情绪，我们的情绪越多，心念就跟着动，心就开始变得不正，是有逻辑关系的。</span></p><p><span> </span></p><p><span><strong>“身有所忿懥zhì，则不得其正。”</strong>忿懥就是愤怒，当我们的心念、意念动了，愤怒了心就开始不正了，所以“有所忿懥，则不得其正”。在我们愤怒、发脾气的时候，心念就开始动，这时行为会是端正的吗？我们常讲，在有情绪的时候不要做任何决定，因为在愤怒的情况下做出来的决定都是错误的。</span></p><p><span> </span></p><p><span>当愤怒的时候，如果正在吵架，就会想动手打人；夫妻之间吵架，随口就说：“不行就不过了。”过后又后悔；跟孩子也一样，愤怒的时候就想派踹他两脚，骂他两句，可是过后又开始变得后悔；做生意也一样，跟客户谈判的过程当中，我们愤怒了、生气了、情绪起了，这时我们所讲的话都是失真的，都是错的。</span></p><p><span> </span></p><p><span>修行我们一定要懂得不断端正自己的念头，平时做事情当中，是不是这样的？如果两个人之间因为某件事情的意见不和，想法不一样，这时情绪动了，接下来心里冒出来的念头，行为开始变得不端正，这就是不懂得修身之道，心不正。大家去想一想，那些背后打小报告的，都是因为情绪在动。</span></p><p><span> </span></p><p><span><strong>“有所恐惧，则不得其正。”</strong>害怕担心都叫恐惧，当我们害怕一件事情的时候，开始患得患失，我们的心还定吗？比如我做了一件什么事情，我怕被谁看到，这时心是七上八下的；我担忧一个明天还没发生的事情，心就是七上八下的；有同学跟着学习的时候总在问：“老师，我的心不静怎么办？我的心不定怎么办？”担忧的事情太多，害怕的事情太多，心如何定下来？心是不稳的状态。</span></p><p><span> </span></p><p><span>很多人内心的心魔，是哪里来的？就是长期的心不安稳，有太多的害怕、担心、恐惧，所以心长期不得安宁。长时间以后，身心就开始出问题了。我们所讲的都是七情六欲里的七情，喜，怒，忧，思，惊，恐，悲，这是中医里面所讲的七情，只要有这些情绪在动，我们的心就不正，接下来就会导致身体出问题。</span></p><p><span> </span></p><p><span>越是修行的人，脾气平和的人，淡定从容的人，越是长寿，身体也不容易出问题。以前修行的人为什么身体都很好？他也不得病，就是因为他的情绪不动，心是正的，身体就健康。所以修行就是让大家的脾气变少，心里没有那么多七情里面的情绪在动，这时我们的心就是正的、稳的、平和的，身体自然就开始健康。</span></p><p><span> </span></p><p><span>比如说，很多同学每天通过直播跟着学习三四个月，有些朋友睡眠开始变好了，为什么睡眠会变好？好像听起来挺神奇的，它不神奇，因为他不再有那么多的恐惧和杂乱的念头，思虑变少了，所以他的睡眠自然就变好了。</span></p><p><span> </span></p><p><span>无论是中医的理论，还是儒释道的文化，其实告诉我们“道”是通的。比如，刚才我们讲的“七情”，出自于《黄帝内经》。《黄帝内经》是道也是医，所以叫道医，医者看的是医，修道的人看的是道，他是通的，理是一样的。</span></p><p><span> </span></p><p><span><strong>“有所好乐yào，则不得其正。”</strong>我们特别喜欢一个东西，或者喜欢一个人，或者喜欢一件事情，我们的心还正吗？人通常赔钱是怎么赔的？气血上涌，一高兴，一兴奋拍桌子说：“这个事能干！”一投钱结果失败了。就是我们“有所好乐”，那一刻兴奋了，也是一种情绪。过度的“喜”，情绪产生了，当下拍板就做了这个事情，结果发现跟当时想象的不一样，因为我们沉浸在“喜”的状态当中，是看不到真相的。</span></p><p><span> </span></p><p><span>比如，我们喜欢一个东西就想占有，喜欢一个人就想占有，这个时候心就开始不正了。人在感情当中，是不是总是这样的？要是喜欢一个人的时候，他跟别人说话，我们的心都在动；他多看别人一眼，我们的心都在动；他赞美别人一句，心都会随着动，这都是“好乐”所产生的。</span></p><p><span> </span></p><p><span>一旦我们“有所好乐”的时候，就想掌控、就想控制，一旦想控制就会过度，心就不正，接下来的行为就会出问题。明明那个人还是不错的，但是由于我们的喜欢，所产生的嫉妒之心，就会把他想得很坏。</span></p><p><span> </span></p><p><span><strong>“有所忧患，则不得其正。”</strong>忧患就是忧虑，更细小的东西了。比如那些没发生的事情会让我们产生忧虑，当下所做过的事情，觉得做得不好，会产生忧虑，当忧虑产生的时候，心也是不正的，这些都是我们的情绪所导致的。</span></p><p><span>《论语》讲：<strong>“君子不忧不惧。”</strong>君子是不惧怕任何事情的，是没有忧虑的。怎么才能做到不忧不惧？内省无疚，就是我们懂得内省，自己不产生愧疚的时候，我们才会不惧不忧。我们为什么会产生忧虑呢？因为这件事情，虽然做了，但是并未努力，也未自省，没反思过我这件事情做的对不对，我这件事情的努力够不够。</span></p><p><span> </span></p><p><span>什么样的人是坦荡荡的呢？我做一件事情，我的诚意十足，我很努力地去做过了，并且我不断地内省，能改的我都改了，因上都在努力了，事后就没有忧虑。只要是没有努力过的、没有自省的，就会产生忧虑。</span></p><p><span> </span></p><p><span>我们做事情也是一样，如果我们做完一件事情之后别人说不好，就开始产生忧虑，为什么会忧虑？因为我们并没有足够的诚意努力过。如果我们已经很有诚意，很努力过了，我们是坦荡的状态，是不忧虑的。</span></p><p><span> </span></p><p><span>超话里有一位同学分享过，特别好，他说：“修行以后，有一天去坐公交车，我看到公交车过来了，我离那个站点还很远，这时我就在想，我追还是不追？跟老师修行以后我想，要因上努力，所以拼命地跑着去追，结果没追上。</span></p><p><span>这时我很淡定，很从容，因为我努力追过了，没追上。”假设他当时没去追，是不是会有忧虑？“我等了半个小时了，刚才我如果去追就好了，万一赶上了呢，我在这多晒了这么长时间的太阳。”很忧虑，很后悔，但是他努力过了，确实没有达到，是不是就没有那么多的忧虑了？</span></p><p><span> </span></p><p><span>我们做所有的事情都一样，要懂得不断地在因上努力。我努力过了，我才不后悔，如果没努力过，一定会产生忧虑的。所以不停地在因上努力就好了，不停地去内省，看看我们自己还有哪些不足的地方，不断地修正，这就是君子，就是坦荡荡的。</span></p><p><span>“小人长戚戚”，我们无论是修行、学习、做事情都是一样的，当我们的诚意十足，我们努力地去种因的时候，果是随缘的，只有这种状态下，我们的心才是坦荡的。比如，我们平时做事情，自己很有诚意、很努力，不会担心别人说我们不够努力，不够优秀。可是如果我们没努力过呢？就会担心，去挖自己内在的潜意识，因为自己都觉得自己努力得不够。</span></p><p><span> </span></p><p><span>为什么我们会有那样的想法？不是别人觉得我们不够，是我们自己觉得不够，当我们做事情诚意十足的时候，自己是坦荡的，不是别人说我们是否坦荡，这种内在的情绪不是别人给我们的。我们要懂得什么样的人才能坦荡荡？就是我不停地内省，我自己的诚意是十足的，这时我们不担心任何事情，所以整个都是由于这些情绪所导致的。</span></p><p><span> </span></p><p><span>这里一共举了四个例子，一个是忿懥，就是愤怒；一个是恐惧；一个是好乐，就是过度的喜欢；一个是忧虑。这些情绪都会导致我们的心不正。王阳明先生讲：“无善无恶心之体”，本身心的本体他是有知性的，没有善恶，他是什么都知道的，为什么会有善恶？“有善有恶意之动”，就是上一篇讲到的诚意，是你的意动了，所以就有了善，有了恶。我们的念头，我们的意动了才有了愤怒，才有了好乐，才有了忧虑，才有了恐惧，才有了对一个人的评价或标准。所以我们的意念动得越少，情绪越少，心就越正，我们的行为就会变得越好。这是《大学》内修的次第。</span></p><p><span> </span></p><p><span><strong>“心不在焉，视而不见，听而不闻，食而不知其味。”</strong>这句话我们从正反两面来讲，第一层，是我们处在某一个情绪当中就是这样的状态。举个例子，当我们在极度愤怒当中，是不是心不在焉？明明别人说了两句话，但我们听不见，什么东西也看不见，吃东西也没有味道，是不是这样的？</span></p><p><span>比如说我们极度地喜欢一个东西、贪婪一个东西，是不是这样的？好像什么也看不见了，吃什么也没有味道了。比如说两个人刚认识，很相爱的时候，我们描述一个场景，这两个人坐在咖啡馆喝咖啡，我的眼里只有你，你的眼里只有我，这时，我们还能看见别人吗？似乎什么都听不到了，咖啡也不知道是什么味道，因为心里的这一刻，只有对方一个人，就什么都看不到了。</span></p><p><span> </span></p><p><span>愤怒的时候也一样的，夫妻两个人吵架，情绪动的时候，孩子可能哭了，我们也听不到了，发生了什么事情可能也不在意，吃东西可能一边吃东西一边流泪，都不知什么味道了。因为已经住在了一个情绪当中，就什么都看不见了。</span></p><p><span> </span></p><p><span>我们处在着急的状态也是这样的。假设现在从这里回济南，有一件很着急的事情需要回去处理，我们在开着车的路上，看不到风景了，因为心里就住在了着急的情绪当中，就会视而不见，听而不闻，食而不知其味了，所以当我们住在情绪当中，就是这样的状态，这是第一层。</span></p><p><span> </span></p><p><span>第二层：是修行以后所达到的境界。也是心不在焉，视而不见，听而不闻，食而不知其味，但是境界不一样了。我们什么境界、什么情绪、什么状态，都不住的情况下就是这样的，我们不执着于任何一件事情，也没有任何的情绪，淡定从容地坐在这里，就是这个状态。</span></p><p><span> </span></p><p><span>举个生活中的例子，为什么我们看他人的事情比较有智慧？因为我们不在情绪当中，不恐惧，也不忧虑，也没有他当时起的贪心，这个时候我们看事情相当透彻，相当明了，为什么呢？因为我们在局外，说明自己的情绪未起，当我们所有的情绪都不起的时候，“心不在焉，视而不见，听而不闻”，但这时不是我们听不到，也不是看不到，是没有分别，但所有的事情我们都能看清楚，因为这个时候我们所有的事情都不住，当我们所有的事情都不住，我们所有的事情才能有所住。</span></p><p><span> </span></p><p><span>比如说，我现在坐在这里讲课，我的心并不住在讲课上，所以每个人的情绪眼神都看得到。如果心住在讲课上，就看不到。所以做企业的优秀的人都是这样的，他在那么多事情当中，却不住在任何事情当中，这样的人才能当领导，才是帅才。一个带兵打仗的元帅，厉害的人都有这个本事的，我这边在打着仗，但是所有的事情我都看在眼里。小兵打仗就只顾着眼前这点事情。</span></p><p><span> </span></p><p><span>我们看古装剧，高手过招是不是这样的？这边跟人打着，其实所有的事情他都看在眼里，他没住在任何的情绪上，他是淡定和从容的。怎么样做我们才能淡定从容？我们不住在任何事情上，如果这个人赞美我一句，我就住相了；这个人误解我一句，骂我一句就住相了。我们的情绪瞬间就起，情绪一起，智慧荡然无存。</span></p><p><span> </span></p><p><span>我们必须要修到，做这件事情的同时，还能看到所有的人所发生的问题，及时给他们指点和修正，我没住在任何事情上，我又住在所有的事情上。什么叫视而不见？是我们不入。比如说直播当中他骂我，我看不见吗？我眼睛又没有问题，我看见了，但是那叫视而不见，因为不入心，所以我的心才正，入了就开始起情绪。</span></p><p><span> </span></p><p><span>比如说别人赞美我们，如果入了，就开始得意忘形，就开始飘飘然了，就开始出问题。我们看工作当中也是一样的，夸我一句我就不知道怎么干了，他说我一句我这情绪就起来了，工作也做不下去了，因为心不正了。修行以后，我们也是要达到正心的境界的，跟刚才住在情绪当中的境界完全不同，所以这是《大学》的妙处。</span></p><p><span> </span></p><p><span><strong>“此谓修身在正其心。”</strong>修身的前提是要正心，正心的前提是要不起情绪，情绪从哪里来呢？从我们的意，从我们的念头当中来，不让自己起那么多的念头，不让自己起那么多的不好的情绪，我们的心才会正，心正而后修身。</span></p></div>"
},{
    "title": "《大学》第十讲 修身齐家",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第十讲 修身齐家</strong></span></p><p><span><strong>“所谓齐其家在修其身者。”</strong>齐家必须要懂得修身。齐：平等、一样。比如，我们摆放一个东西，如果长短不一，它不叫齐，所以齐是平等的，是整齐的。我们再讲家，不是指我们现在有夫妻，孩子，父母的这个家，以前家族也叫宗族，一个家族数百人，是很正常的事情，那时是不分家的，整个家族非常大。再往前讲，一个部落，一个诸侯国可能都称为一个家。</span></p><p><span> </span></p><p><span>数百人的一个家，整齐、平等、不偏私、平衡的这种状态，是不是挺难的？因为他不像治国，用法律就可以了，治家不能都用法，还得重情，重情的同时还得用法，所以叫家法。如何才能齐家呢？所谓“齐家在修其身者”，要想家齐，我们得修身，以前家族的族长，必须是德高望重的人，必须他自己的行为是相当端正的，他才能齐一个家，否则是齐不了。</span></p><p><span> </span></p><p><span>做企业，做公司，做团队是不是一样的？做团队的领导人，他自己的品德，行为要相当之端正，才能齐好家，否则是齐不好的，如果我们做事情总是有偏颇的，总是不平等的，总是有偏袒的，如果是靠着情绪做事情的，是无法做到齐家的，尤其是数百人的家族，尤其注重的是自己的修身。</span></p><p><span> </span></p><p><span>正心才能修身，做团队也是一样的，如果我们每天都有这些情绪在，动不动就高兴得不行，碰到一个事情就想占为己有，有一点利润就想贪婪动不动谁做了点事情不高兴了就起情绪，天天暴怒，这样能带好企业吗？能带好团队吗？越是优秀的企业家，越是淡定从容的，他没有那么多的情绪，他的心是端正的，他的行为也是端正的、是从容的，才能影响到身边的人。</span></p><p><span> </span></p><p><span>治理一个家也是一样的，这个家族的族长，即使他内心有很多的波澜，他也不表现出来，他都是自己在压着，自己消化的。其实大家想一想，做一个团队的老大，真的不易，他只能让别人看到好的那一面，不好的那一面不能让别人看到，他自己不开心的时候只能自己消化。</span></p><p><span> </span></p><p><span>我们现在做企业也是一样的，只有懂得控制自己的情绪，然后我们心正，行为才能变得更好，才能影响好身边的每一个人。我们做一个团队的领导，是不是也一样？我们做领导层，也有自己的小家，也有自己的小团队。</span></p><p><span> </span></p><p><span>再往下延伸，我们现在每个人都有自己的家庭，如果总是动情绪，如果不懂得修身，就会影响身边的家人和孩子，甚至是老人，整个家里都变得不安宁可是如果我们是有修为的，自己如果是淡定从容的，我们才能给自己的家，注入一丝宁静、安宁和从容。一个家庭的氛围，是靠我们每个人组成的，一家之长更是极其重要。</span></p><p><span>整个《大学》告诉我们，<strong>“自天子以至于庶人，壹是皆以修身为本”，</strong>要懂得修身之道的，因为修身这里面有一个内外衔接的作用，《大学》的八条目，从格物，致知，诚意，正心，修身，都是内修。从修身开始，既是内修又是外用，因为齐家，治国，平天下，是靠行为的。我们现在做事情也是一样的，想做好一件事情，我们外在的行为就表现出来了，所以它是一个内外衔接的作用，非常重要。</span></p><p><span> </span></p><p><span><strong>“人之其所亲爱而辟焉。”</strong>辟：偏袒、偏向。当我们的行为，如果对谁是亲爱的，是不是就会偏向？比如我们特别喜欢某一个人、爱某一个人、亲近某一个人，这时候我们的行为是不是就会产生偏袒？别人就开始变得不高兴了。</span></p><p><span> </span></p><p><span><strong>“之其所贱恶而辟焉。”</strong>当我们讨厌一个人的时候，行为是不是开始偏了？当讨厌一个人的时候，他做什么都是错的。现在不是流行一句话吗？“他喘气都有问题。”因为我们讨厌这个人，所以他做什么都是错的；因为我们喜欢一个人，所以他做什么都是对的。</span></p><p><span>很多企业当中，或者在家族当中，往往出现的问题可能给我们带来最大损失的人，是我们最亲爱的那个人，我们特别相信一个人，所以他可能突然做一个重大的决策，我们也没有思虑过，因为亲爱他，认为他可能都是对的，结果出现了很大的问题。</span></p><p><span> </span></p><p><span>我们在生活当中是不是也一样的？太过于溺爱或者亲爱某一个孩子，孩子反而不成才。在我们父辈那一代特别明显，比如说有的人家，孩子四五个的，往往最得宠的孩子，长大以后还不孝顺，还没有出息。因为家人太亲爱他了，反而导致他的不成长，做事情没有坚韧的品格。</span></p><p><span>我们可以亲爱他，但当他走上社会，别人能那样亲爱他吗？别人会把他当亲生的孩子对待吗？将来他要如何独立、如何成长呢？我们一定要懂得这个道理，对自己的孩子，一定要让他努力地去做一件事情，一定要对他有一些要求，不要一味地亲爱，这不见得是好事情。</span></p><p><span> </span></p><p><span>在一个团队中更是如此，如果我们因为亲爱一个人，看不到他的缺点；因为贱恶一个人，看不到他的优点。任何一件事情都有阴阳两面，都有好的和坏的那一面，如果我们的情绪动了，行为就开始偏了，看一个人的时候就看不到他的缺点，那如何让他成长？当我们讨厌他某一点，就看不到人家的优点了，怎么用人呢？我们被自己的这些情绪、心念所产生的行为控制住了，就会变得没有智慧了，看不懂很多东西了，所以修身是极其重要的事情。</span></p><p><span> </span></p><p><span><strong>“之其所畏敬而辟焉。”</strong>当我们过度地畏敬一个人，也会产生偏颇，我们会看不到那个人的问题。所以以前的帝王，都得有忠臣的。包括孔夫子在《论语》中讲：“回也，非助我者也。”说颜回并不是助我的人，为什么呢？我说的所有的话，他都认为是对的、都认为是好的，反而不是来帮助我的人，因为他看不到我的问题，他过于畏敬老师。</span></p><p><span> </span></p><p><span>李世民讲：“以铜为镜，可以正衣冠，以史为镜，可以知兴替，以人为镜，可以明得失。”这句话是在他的贤臣魏征去世的时候，讲的这样一段话。他说我失去了一面镜子，因为魏征敢于提出他身上的不足。</span></p><p><span> </span></p><p><span><strong>“之其所哀矜而辟焉。”</strong>哀：同情。矜：怜悯。当我们产生了同情和怜悯他人的情绪，行为开始有失偏颇，就看不到事情的真相了。我们看不到他很多的不足，就不能给他正确的指点，那如果不能给他正确的指点，又如何能帮助到他呢？</span></p><p><span> </span></p><p><span>举个例子，为什么往往闺蜜出的都是馊主意呢？比如，我们的闺蜜有什么事情找到我们，她上来就给她出主意，直接就站在她的情绪上了。比如闺蜜在我们面前哭，我们就开始起情绪了，肯定都是那个男人的问题，肯定都是别人的问题。我们都还不了解是什么事情，但看到她哭了就开始同情她了，开始心疼她了，这时我们反而助长了她的情绪，而有智慧的人，先问明白这个事情，能站在很中正的、不起情绪的状态下，告诉她这件事情怎么解决。</span></p><p><span> </span></p><p><span>大家修行以后，一定要懂得遇事先不要起情绪，先把事情捋清楚，这个事情才能解决。以前一个家族的家长是不是这样的？他绝对不会听到自己的亲人，自己的家里人说的几句话，马上就下决定，一定是把事情的始末听完，甚至不只是听别人讲，还要旁敲侧击从别人那里了解这件事情，再下结论。</span></p><p><span>这样的人才能做一家之长，否则听的都是一面之词，听的都是一方的情绪，如何齐家呢？所以齐家一定是要懂得修身的，我们自己的行为不偏颇、是中正的，所做的事情才有智慧。</span></p><p><span> </span></p><p><span><strong>“之其所敖惰而辟焉。”</strong>敖是骄傲自满，惰就是懒惰。看到一些敖惰的事情，或者自己身上有一些敖惰的时候，我们的行为就开始出现偏颇。当我们做事情的过程中如果是骄傲自满的，行为就开始走偏了。</span></p><p><span>我很自满，我很自大，我们会觉得自己很厉害，觉得自己无所不能，赔钱的人都是这样赔的。很多人听成功学的课，在会场、在课上的时候，就觉得自己可以改变世界了，这种骄傲自满的情绪就产生了，接下来的行为就开始出现偏差。</span></p><p><span> </span></p><p><span>惰是什么？懒惰，越是骄傲自满的人，越容易懒惰。比如学习也是一样的，我觉得自己很厉害了，就开始行为上不努力了，往往越无知的人，越认为自己有知，觉得自己很厉害。越是有知的人，往往越认为自己无知，认为自己的所学实在是太少了，圣贤的智慧实在是浩瀚如海。为什么我们会这么认为呢？是我们当了很多东西以后发现有更大的天地。</span></p><p><span> </span></p><p><span>《论语》中有一句话讲的很好，《大学》的作者曾子，说<strong>“参也鲁”，</strong>参是指曾参，鲁是很迟钝的意思。曾子他很迟钝，但是迟钝的人却写出来《大学》。为什么呢？因为他认为自己是迟钝，所以他就加倍地努力地去做学问，而认为自己聪明的人，就没有那么努力和刻苦，所以曾子反而有所成。当有这些敖惰的情绪和这样的行为在的时候，就开始偏了。</span></p><p><span> </span></p><p><span>接下来开始整个总结了，<strong>“故好而知其恶，恶而知其美者，天下鲜矣。”</strong>“好而知其恶”，我们亲爱一个人的时候，还能看到他的不足和缺点；我讨厌一个人，讨厌一件事情的时候，我还能看到他的优点和事情背后的好处，这样的人啊，天下很少了。那少，不代表没有，我们努力去做这样的人。我们的心念越正的时候，我们的行为越正的时候，会发现任何事情在我们这里都能看得清清楚楚。</span></p><p><span> </span></p><p><span>一个人好，我们也能看到他的不足；一个人的不好，我们也能看到他难能可贵的地方，这是我们每个人去修行的方向。这样的话我们的行为才是端正的，才能齐好家，生活才能变得从容、自在。</span></p><p><span> </span></p><p><span><strong>故谚有之曰：“人莫知其子之恶，莫知其苗之硕”。</strong>所以谚语有云：“人们都看不到自己孩子身上的问题。”其子，自己的孩子。比如，有的孩子可能做了一件不好的事情，他的家长会说：“不可能，我的孩子特别听话。”</span></p><p><span>为什么会这样？由于他平时心爱这个孩子，看不到孩子身上的问题，所以导致孩子越走越偏。有智慧的人一定是能及时纠错的。所以如果我们不懂得传统文化教给我们的这些知识，怎么才能生活得更好呢？怎么能带出来好的团队？怎么能教育出来好的孩子？</span></p><p><span> </span></p><p><span>“莫知其苗之硕”，就是不满足，看不到自己家里的苗长得好。我们看不到自己拥有什么，看到的都是自己没有什么。比如说我有车子，但我看到的是，他的车子比我的好；我有房子，我看到的是他的房子比我的大；我房子车子都有了，我看到的是他老公比我老公听话；我这些都有了，我看到的是他家的孩子比我的孩子学习好；我家孩子学习如果也挺好的，我看到的是，如果孩子再听话一点，就更好了，永远不满足。</span></p><p><span> </span></p><p><span>看不到自己拥有什么，看到的都是别人还拥有什么，不停地对外攀比，就产生了很多的痛苦，就是不懂得知足。<strong>“知足之足，常足矣。”</strong>我们懂得知足，内在才是满足的，才是富足的。</span></p><p><span> </span></p><p><span>这些都会让我们的行为不端正，所以<strong>“此谓身不修，不可以齐其家。”</strong>告诉我们如果不懂得修身，我们是不能齐其家的。比如我们想齐家，治国，平天下。治国就是影响更多的人，做任何行业是不是都有自己的天下？</span></p><p><span>我们所做的行业、领域，都是我们的天下，我们要不懂得修自己的身，不懂得把我们这个团队齐好，我们怎能影响更多的人？不能影响更多的人，我们怎么可能去救济天下呢？所以身不修，不可以齐其家。</span></p></div>"
},{
    "title": "《大学》第十一讲 如保赤子",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第十一讲 如保赤子</strong></span></p><p><span><strong></strong></span></p><p><span><strong>“所谓治国必先齐其家者，其家不可教，而能教人者，无之。”</strong>想要治理一个国家，要先齐其家。如果自己的家都不能齐不能教，想去教别人是不可能的。我们带团队也是一样的，如果我们自己的团队还没磨合好，我们自己如果还不了解自己的产品，还不了解自己的使命和价值观，要想把事情做好，是很难的。</span></p><p><span> </span></p><p><span>修身养德，以小见大。从修身开始，不停地修正自己的行为，滋养自己的德行，然后开始齐家，影响身边的每一个人，然后才能去治国，这叫以小见大，它是一步一步来的。</span></p><p><span> </span></p><p><span><strong>“故君子不出家，而成教于国。”</strong>所以君子不用出家门，就可以成教于国的。因为在不停地齐家的过程当中，家人就可以影响更多的人了。比如，以前有贤德的君王，他自己是懂得修身的、是圣明的，他自己是有德行的，他的身边自然就能带着一些贤臣，这些贤臣自然就可以去治国了。</span></p><p><span> </span></p><p><span>我们现在这个时代更方便了，互联网的时代、自媒体的时代，足不出户就可成教于国。我们把自己修得更好，我们的学识更好、智慧更好，自己的修为和德行更好，我们就可以去影响更多的人，所以这个时代这样的方法更好用。前提是我们要懂得修身，要懂得齐家，影响好身边的每一个人，把他们齐好，我们就可以去做更多的事情。</span></p><p><span> </span></p><p><span><strong>“孝者，所以事君也。”</strong>孝顺的人，一定能事奉好自己的君主。以前流行一句话，求忠臣必于孝子之门，如果要想找到忠臣，这个人一定是孝子，否则他怎么会忠于你呢。《论语》讲过很多类似的片段，君子是绝不做杀父弑君的事情，弑君等同于弑父，君子是不同意的。</span></p><p><span>《论语》还讲到司马牛问孔子什么叫仁德，因为他的几个哥哥谋反，他是不同意的，他说即使成功了，我也觉得被天下人耻笑，他是不会做这样的事情的，只有这样的人才能做忠臣。所以这里告诉我们，孝顺的人，才能侍奉好君主。</span></p><p><span>往社会再延伸一下，孝顺的人，如果拿孝顺的心态，对待老板或董事长，会是什么样的效果？我们用这样的心去对待，就会恭恭敬敬地对待这个人、对待这些事情，我们拿这样的心态对待居上位的人，他们自然会拿慈爱的心态、仁德的心态来对待我们。</span></p><p><span> </span></p><p><span><strong>“弟者，所以事长也。”</strong>弟者，是兄弟对哥哥尊敬的感受和态度。无论是陌生人或周边的人，跟着一起学习的人，我们在一起做事情、在一起修行的人，我们对待每一个人都是特别尊敬和恭敬的状态，是不是别人回馈给我们的自然也是这个状态？</span></p><p><span> </span></p><p><span><strong>“慈者，所以使众也。”</strong>慈爱的人才能使众。处上位的人，要慈爱地对待每一个人，别人才能心甘情愿地跟我们一起做事情。无论我们是做中层领导的、高层领导的，还是做老板的，都一样，要慈爱地对待每一个人，每一个人才能对我们忠，对我们敬。每个人都是从修自己开始，我们无论在哪个位置上，我们去找到自己该做的事情，懂得修自己。</span></p><p><span> </span></p><p><span><strong>《康诰》曰：“如保赤子。”</strong>《康诰》出自《尚书》里面的《周书》，赤子就是刚出生的婴孩。大家可以想象一下，我们对待一个刚出生的婴孩，是什么样的态度？小心谨慎，担心他冷，担心他热，又担心他摔倒，那种呵护和谨慎的心情。</span></p><p><span> </span></p><p><span>我们要用如保赤子的心情，去对待每一个人，对待我们上面的领导，我们的领导也用这种心情去对待每一个人，所以古话才有“爱民如子，如保赤子”这样的状态。会发现我们对每个人就是敬畏的，就是小心谨慎的。</span></p><p><span> </span></p><p><span><strong>“心诚求之，虽不中，不远矣。”</strong>只要我们的心是如此地诚的，像保护一个赤子一样，虽然还没达到，但是不远了，已经奔向那个方向了。如果我们彼此都像如保赤子一样对待每一个人，“心诚求之，虽不中，不远矣”。比如，我们这两天在研究做新的事情，只要诚心诚意地去做这件事情，虽然可能当下还达不到，但是已经不远了。</span></p><p><span> </span></p><p><span>我们延伸到任何事情也是一样的。只要是有诚意的，心是诚的，想去做那件事情，一点一点的我们就学会了。《大学》教给我们的这些道理特别有意思，也特别实用。所以我们要懂得，我们没有做到、还不会做，是我们的心不够诚，故而不会。</span></p><p><span> </span></p><p><span><strong>“未有学养子而后嫁者也。”</strong>没有先学会怎么生孩子、怎么养孩子，才去考虑嫁人的。鼓励我们很多事情是要先行的，只要我们的心诚，先去做，做着做着就会了。比如开公司，不可能说：“我先学会开公司，我先练几年，然后回头再开。”不是这样的吧？无论任何事情都是一样的。</span></p><p><span> </span></p><p><span>现在流行一句话：“明天虽然是未知的，但是一切都会朝着自己努力的方向发展。”我们努力学习，虽然结果未知，但是会奔着努力的方向去；我们努力地去修正自己，虽然不知道会修正到什么程度，但是一定会奔着我努力的方向去。</span></p><p><span>如果我们不努力，就是没有方向的，所以很多人的时光才虚度啊，三十年如一日。因为未曾真正地努力过，也没有给自己方向，也不知止，也没有心诚求之（这里的求都是向内求），所以我们自然就是迷茫的，没有方向的，不进步的。</span></p><p><span> </span></p><p><span><strong>“一家仁，一国兴仁。”</strong>如果这一家都是兴仁德的，整个国家和周围的人就会兴仁。以前一个大家族，如果这个家族都是仁德的，那么这个国家就是仁德的。用在一个团队或一个企业当中，如果我们每个人都是心怀仁爱、仁德的，接触我们的人、周围的人，一点一点地都会受我们的影响，都会变得有仁德。</span></p><p><span> </span></p><p><span><strong>“一家让，一国兴让。”</strong>同样的道理，如果这一家人做事情都是礼让的，慢慢地所接触到的人，都会被影响，变成礼让的。</span></p><p><span><strong></strong></span></p><p><span><strong>“一人贪戾，一国作乱。”</strong>尤其是上位者，贪是贪婪，戾是暴戾、暴躁。以前只要有一个暴君，是不停地贪财好色的、施暴政的，最后一国就开始作乱。团队当中也是一样的，如果做团队的领导人，每天都是暴躁的，每天都是贪婪的，结果整个团队都会乱的。</span></p><p><span> </span></p><p><span><strong>“其机如此。此谓一言偾事，一人定国。”</strong>其中的道理、其中的因缘，就是这样的。一言就可以败坏事情，一人就可以定国安邦。我们纵观中国通史，每一个伟大的朝代都有一位圣明的君王，这一个人就定国了。如果这个人是暴君，这一个人就坏事情。现在也是一样的，我们如果作为团队的领导，作为一家之长，我们一个人的行为，一个人的修为，一个人的心性，就会导致整个家庭、整个团队最后的走向。</span></p><p><span> </span></p><p><span><strong>“尧、舜帅天下以仁，而民从之。”</strong>接下来给我们举例子了，唐尧和舜帝，这两位伟大的君主，天下共主。他们是兴仁德，推仁政的，所以天下的人民，都跟随他去做这样的事情。</span></p><p><span><strong></strong></span></p><p><span><strong>“桀、纣帅天下以暴，而民从之。”</strong>举了一个反面的例子，桀是夏朝最后一个君王，施暴政。商朝最后一个君王叫纣，商纣，电视剧《封神榜》有演过，我们先不论真实性，但是他施暴政，最后天下就开始推翻他了。</span></p><p><span> </span></p><p><span>现在做企业也是一样的，如果我们推的是仁政，让我们的客户、跟着一起做事情的人，都是受益的，他们就会从之。现代的“施暴政”，就好比是我们收很高的费用，人们可能在没有办法的时候会用我们的，但凡有办法，他就不用了，只要有人揭竿起义，就会有墙倒众人推。</span></p><p><span> </span></p><p><span><strong>“其所令反其所好，而民不从。”</strong>我们举个例子，假设一个做君王的人，他自己是贪财好色的，他自己是贪婪的，这个时候他会对别人说：“你们不要贪婪。”会发现人们是不会听从的。反过来讲也是一样的，如果是一个很贤明的君主，他告诉别人：“你们可以贪一点。”别人也不会贪。</span></p><p><span> </span></p><p><span>在一个团队当中也是一样的，如果做团队领导的这个人，他自己是很仁德的，做事情是很谦逊的，是很为他人着想的，整个团队的人都是这样的。让他们不为他人着想，他们都不同意。但反过来也一样，如果我们每天做的事情都是自私自利的，我们告诉别人要有大爱、要懂得付出、要给予，看他们会同意吗?</span></p><p><span> </span></p><p><span>举个例子，我每天都是吃素的，我一直也是这样要求自己的。如果我告诉你们:“你们一定要吃肉，多吃肉。”你们会吃吗？所以说，“其所令反其所好”，人们就不听我们的了。所以我们一定要内外一致，为什么《大学》反复地教给我们修身为本？就是我们所讲的话、我们的行为是一致的，这时别人才会认可、跟随、跟从，只有这样才经得住考验。</span></p><p><span> </span></p><p><span><strong>“是故君子有诸己，而后求诸人。”</strong>君子都是先要求自己的，自己有了，才去要求他人的。我们自己没有的时候，不要去要求他人。所以我们每个人都要懂得反躬自省。但是没经过修行的人，不是这样的，自己做不做无所谓，我一定要求别人去干，这时别人就不听我们的话，我们自己也会产生痛苦。</span></p><p><span> </span></p><p><span>在家里也是一样的，我们要求孩子学习，自己却在那玩手机，孩子能学吗？我们要求他做的事情，自己不去做，是不行的。现在很多跟着学习的朋友，分享的时候也会讲：“我现在每天跟着学习，会发现孩子不用管，到点自己就学习去了。”因为孩子受到我们的影响了，管理是“有为法”，影响是“无为法”，是不需要刻意的，我们每天去修正自己就好了。</span></p><p><span> </span></p><p><span>所以我们要懂得，影响他人是无为法。我们不停地修正自己，当我们看到别人有问题的时候，怎么办？也是修正自己。当自己的能量、自己的品行、德行，修行到一定的程度，我们就会影响到身边的每一个人。</span></p><p><span> </span></p><p><span>我们每一个人在这里（虚空济）都是这样修行的，整个的磁场就是这样的，进来的人自然就融入到我们这个磁场，融入不进来的自然剥离、淘汰，不是我们淘汰的，是这件事情淘汰的，是这里的“道”淘汰的。</span></p><p><span> </span></p><p><span><strong>“无诸己，而后非诸人。”</strong>我如果不能要求自己，是不能要求他人的。所以整个我们要做的是以身表法，以己正道，我们以自己身体的行为去表法，以自己来正道，别人自然就会受我们的影响，跟我们变成一样的。</span></p><p><span> </span></p><p><span><strong>“所藏乎身不恕，而能喻诸人者，未之有也。”</strong>恕就是忠恕之道，是宽容的意思。自己如果不懂得宽容、包容他人，而能教化他人，是没有的。我们要想感化、影响、教化他人，一定是我们自己懂得包容的，懂得宽容的，我们是严于律己，宽以待人的，我们才能不停地去影响他人。如果反了，我们不懂得宽容之道，而能教化他人，那是不可能的。所以“己所不欲，勿施于人”，就是《论语》讲的忠恕之道。</span></p><p><span> </span></p><p><span><strong>“故治国在齐其家。”</strong>所以说治国，一定要懂得先齐家。只有我们懂得修身，我们把家齐好，才能影响更多的国人，就是更多的身边人。我们每个人都要懂得以身表法，以己正道，我们不是改变任何人，我们也改变不了，所以我们只能靠自己的行为，靠自己的修行，靠自己的学识，一点一点地去影响更多的人。</span></p><p><span> </span></p><p><span><strong>《诗》云：“桃之夭夭，其叶蓁蓁，之子于归，宜其家人。”</strong>这段话出自于《诗经》，夭夭是茂盛的、娇美的样子。《诗经》喜欢借物言情，或者借物表达对一个人的赞美。蓁蓁是内在果实，很茂盛、很丰厚的样子。“之子于归”，形容待嫁的少女。“宜其家人”，是嫁过去以后对男方家人是有益的。以前的女子，都是修女德的。</span></p><p><span>我常开玩笑说：“以前的女子会吟诗，现在的女子会作对。”有些女子除了作对，什么都不会了。同样作为男子，也是一样的。我们要求女子有女德，那自己（男子）是不是也要有德行？否则人家也看不上我们啊，以前都讲门当户对的。</span></p><p><span> </span></p><p><span><strong>“宜其家人，而后可以教国人。”</strong>首先我们对自己的家人是有益的，才能对国人、对身边的人有益。</span></p><p><span><strong>《诗》云：“宜兄宜弟。”</strong>宜兄宜弟，而后可以教国人。我们对自己的兄弟是好的，以身表法，这时才可以影响身边的更多的人，从夫妇到兄弟，都是一样的。</span></p><p><span><strong></strong></span></p><p><span><strong>《诗》云：“其仪不忒tè，正是四国。”</strong>忒是没有差错的意思，仪是我们的仪表行为。首先是我们的仪表、行为没有差错的，才可以影响身边的人，作为他们的表率。</span></p><p><span><strong></strong></span></p><p><span><strong>“其为父子兄弟足法，而后民法之也。”</strong>父子兄弟足以表法，这样别人自然会效法。足法是成为一种标准，一种法则。我们父子、兄弟、夫妇之间就是这样相处的。往现在延伸，我们自己的行为就是这样的，我们自己就是这样的标准，而别人自然而然地就会效法。</span></p><p><span> </span></p><p><span><strong>“此谓治国在齐其家。”</strong>所以治国要先齐家，当我们这样去齐家，就可以影响更多的人了。</span></p></div>"
},{
    "title": "《大学》第十二讲 絜矩之道",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第十二讲 絜矩之道</strong></span></p><p><span><strong></strong></span></p><p><span><strong>“所谓平天下在治其国者。”</strong>若想平天下的人怎么办？要先懂得治其国，春秋那个时候都是各个诸侯国，那个时候的天下指的是天下九州，这是古代的中国，你要有能力，把自己的诸侯国治理好，你才可能去平天下。</span></p><p><span> </span></p><p><span>我们现在做事情也是一样的，我们先要齐家，把自己的这个团队，每个人通过修身，大家都达到一定的德行，能去影响更多的人了，这个时候我们才能去治国，也就是影响更多的身边的人，治理好一个国家，治理好一个诸侯国，要怎么治理呢？</span></p><p><span> </span></p><p><span><strong>“上老老而民兴孝。”</strong>上：处上位的人，也就是那个时候的君主，一个诸侯国的国君。“上老老”，第一个老是动词，也就是说处上位的人，你是尊敬老人、推行孝道的，那人民自然也就跟着你推行孝道。现在也是一样的，我们处上位的人，比如说做领导层的人们，我们去做什么下面的人就会效仿什么，如果我们是懂得尊敬他人的，员工就会尊敬我们。</span></p><p><span> </span></p><p><span>举个例子，现在很多团队当中，常常出现的问题，比如说一个中层领导，跟在你下面的员工，吐槽老板的有没有？说：“你看老板这个行为，你看老板这个人怎么样怎么样。”你会发现你吐槽了很多事情，终有一天你会发现，你不在的时候他们也在吐槽你，这叫上行下效。整个告诉我们处上位的人，你怎么做，下面的人就会跟随着你怎么做。</span></p><p><span> </span></p><p><span><strong>“上长长而民兴弟。”</strong>弟就是恭敬、尊敬的意思。处上位的人你要懂得尊敬他人，尊敬比你年长的人，尊敬比你有才识的人，尊敬比你有能力的人，而下面的人就会随着你的做法去做，你懂得尊敬和恭敬他人的；他们就懂得，如果你不懂得，他们就不懂得。</span></p><p><span> </span></p><p><span>我们每天修行，为什么不停地正念呢？是不是我们一点点从心念上就开始转变了？心念上转变了，接下来我们的思维方式是不是就不同了？我们的行为接着就发生变化，这就是我们的修行，不停地去修正。</span></p><p><span> </span></p><p><span>如果我们这一天，什么问题都没有，说明我们这一天没有自省。哪有一个人一天是没有问题的呢？哪有一个人，这一天是完全做得足够的呢？那是不可能的，除非是我们的标准太低了，我们对自我的要求越高、标准越高，会发现我们每天身上都有大量的问题和不足，这些就是我们的修行了。</span></p><p><span> </span></p><p><span>之前《大学》也讲过，这不就是<strong>“如切如磋，如琢如磨”</strong>吗？“如切如磋，道学也；如琢如磨者，自修也。”什么叫自我修行？反复地琢磨，雕琢，发现一点点不足，发现一点点问题，我们反复地修正，所以这个才叫自修。所以我们是要以身作则的，要以身表法。</span></p><p><span> </span></p><p><span><strong>“上恤孤而民不倍。”</strong>处在上位的人，如果懂得体恤孤寡，是有仁慈的，是有怜悯之心的，而人民就不会违背这件事情。</span></p><p><span> </span></p><p><span><strong>“是以君子有絜矩之道也。”</strong>君子是要有絜矩之道的，絜：一种度量。矩：一个曲尺。絜矩之道是什么意思呢？一种标准，一种法则。君子是有絜矩之道的，我们有自己的标准和法则，别人就会自然而然地受到我们的影响，去效仿我们的行为去做事情，这个就是絜矩之道，就是上行下效。如何去做这个絜矩之道呢？这里面给我们讲了六个方位，上下、前后、左右，也是我们通常讲的，六合八荒里面的六合。</span></p><p><span> </span></p><p><span><strong>“所恶于上，毋以使下；所恶于下，毋以事上。所恶于前，毋以先后；所恶于后，毋以从前；所恶于右，毋以交于左；所恶于左，毋以交于右。此之谓絜矩之道。”</strong>所恶于上，毋以使下，当上位的人，对我们做的事情，我们是不喜欢的、是讨厌的，我们就不要往下再用了。也就是说任何事情，到我们这里开始终止。</span></p><p><span> </span></p><p><span>很多人说讲婆媳关系，“我的婆婆是怎么对我的，我的父母那个时候是怎么对我的，我非常讨厌这样的行为。”那我们就不要这样再对待我们的晚辈、孩子了。在工作当中也是一样的，我非常讨厌我的领导，他对我的一些处事的方式，既然是我们讨厌的，我们就不要再对下面的人去用了，这是上下级的关系。</span></p><p><span> </span></p><p><span><strong>“所恶于下，毋以事上。”</strong>你下面的人对你所做的事情，你是不喜欢的，你是讨厌的，你就不要再拿这些方式对待你上面的人了。任何事情都是到我们这里截止，从我们这里开始修正、开始改变，这是君子之风。</span></p><p><span> </span></p><p><span><strong>“所恶于前，毋以先后。”</strong>比如说之前所遗留的一些事情、一些行为，我是不喜欢的，我们就不要再往后传了。举个例子，我们刚到一个工作岗位，之前这个职位的人他工作的方式和遗留的问题是我们不喜欢的，所以从我们这里就开始修正了，而不让它再往后发生。</span></p><p><span> </span></p><p><span><strong>“所恶于后，毋以从前。”</strong>我们不喜欢或者预见到了接下来要发生的事情，我们从当下就开始改变，也就是说很多事情，我们要是不喜欢那个果，我们从当下开始就不要种那样的因。举个例子，我们自己身上的问题，或者看到他人身上某一个性格特点，是我们不喜欢的，可是我们身上目前还有这个问题，我们不想让它后面还发生，怎么办呢？我们当下就去修正了，所以那个果才不发生。</span></p><p><span> </span></p><p><span>刚才讲到的是上下的关系，这是前后的关系，接下来要告诉我们左右的关系，左右就是平级，我们跟朋友之间是左右，我们跟同事是左右，跟兄弟姐妹是左右。比如说跟父母或领导，跟员工这是上下，跟孩子跟父母这是上下，前后是时间概念，左右是平行的关系，平级的关系、平等的关系也是一样，也就是我们跟同事、朋友、兄弟姐妹相处之道，也是如此。</span></p><p><span> </span></p><p><span><strong>“所恶于右，毋以交于左；所恶于左，毋以交于右。”</strong>道理是相通的，如果别的朋友对我们所做的事情，他身上的某些特点是我们不喜欢的，我们就不要再对其他的朋友这样做了。同事之间、同学之间、同修之间也一样，我们不喜欢他身上某一个特点，我们作为一个懂得修身的君子，从我们这里开始修正，我们不拿这个事情再这样去对待他人，这叫<strong>“己所不欲，勿施于人。</strong><strong>”此谓“絜矩之道”</strong>，到自身这里开始停止和修正。</span></p><p><span> </span></p><p><span>这是告诉我们治国的道理，我们要心怀天下的，能包容上，能包容下，能包容前，能包容后，能包容左，能包容右，就看我们自己心里是多大的格局，我们要做多大的事情，我们是否要让自己变成一个躬行君子。懂得了这个道理，遇到事情的时候是反观自省的，从我们这里停止，开始修正，然后去影响更多的人。</span></p><p><span> </span></p><p><span><strong>《诗》云：“乐只君子，民之父母。”</strong>出自《诗经》里面的《小雅》。和乐、贤德的君子，是人民的父母，指的是和乐的、贤德的人。如果我们不是和乐的，不是贤德的人，我们没有那么多的包容心，也不可能心怀那么多的人，所以我们心怀的人越多，心怀的事情越多，能包容的人和事越多，我们自己自然就是往上走的，自然就有人愿意去跟随我们做事情。</span></p><p><span> </span></p><p><span><strong>“民之所好好之，民之所恶恶之，此之谓民之父母。”</strong>什么样的人能做民之父母？爱民如子的人。别人喜欢的事我们也喜欢，别人讨厌的事情我们也讨厌，这样才叫“民之父母”。以前讲一个词叫“父母官”，什么样的人能做成父母官呢？都是为民谋福利的，都是站在他的角度考虑问题的。</span></p><p><span> </span></p><p><span>咱们之前讲过，<strong>“如保赤子”</strong>，什么样的心是如保赤子呢？比如说婴孩，他不会表达，也不会讲自己的需求，他也不知道自己有什么需求，这时我们就需要猜测——他哭了，原因是什么呢？到底是饿了？渴了？还是哪里不高兴了？还是哪里不舒服？还是哪里热？是不是我们要费尽脑汁地想他的需求？</span></p><p><span> </span></p><p><span>我们做事情也是一样的，什么叫念念利他？就是他想到的我们想到了，他想不到的我们也想到了。我们会从各个角度去考虑他们的感受、他们的需求，这才叫念念利他，要不然我们哪来的念念利他？</span></p><p><span> </span></p><p><span>圣贤的文化为什么讲了这么多？别人想到的、人民所需的，他们把他讲出来了，不需要的、人们看不到的那些道、那些德，那些仁义礼智信，他依然看到了，讲出来了，让别人来吸收，这才是圣人的心，这才是君子的心。</span></p><p><span> </span></p><p><span>同样的道理，《道德经》讲：<strong>“圣人无常心，以百姓心为心。”</strong>他自己是没有需要的东西的，是没有什么标准的，但是他看的是百姓需要什么，他是以百姓心为心的。</span></p><p><span> </span></p><p><span>修行之道，一定是这样要求自己的。我们自己可以没有什么标准，做什么事情都可以，但我们去看看他人需要什么我们就去做点什么，这时我们的境界和心胸就不一样了。我们不会执着于我怎么样，而看到的都是他们需要什么，我就去做点什么，这样的人才叫“民之父母”，这样的人是乐只君子。</span></p><p><span> </span></p><p><span><strong>《诗》云：“节彼南山，维石岩岩，赫赫师尹，民具尔瞻。”</strong>节彼南山，节是高大的、雄伟的、巍峨的。彼是对面、那里。高大雄伟的、对面的南山，维石岩岩。南山是以前的君王都是坐北朝南的，对面的南向都会放一个大的石头，叫维石岩岩。用来时刻警醒自己，所坐在的位置是非常地醒目的，别人都是在看着的。</span></p><p><span> </span></p><p><span><strong>“赫赫师尹，民具尔瞻。”</strong>赫赫是显赫的意思，师尹是周王朝的执政大臣，可以说是一人之下，万人之上，所有的人民都在看着、瞻仰着。“十目所视，十手所指，其严乎？”这里又扩大了，告诉我们所有的人都能看得到师尹的行为。现在也是一样的，有些公众人物，说话就要注意、严谨，因为那么多人都能看着的。</span></p><p><span> </span></p><p><span>我们每个人都要懂得时刻修正自己的行为，因为会越来越多的人看到我们的行为。这里面还是告诉我们要有“絜矩之道”，要以自身为表率，要懂得修正自己的德行和行为。</span></p><p><span> </span></p><p><span><strong>“有国者不可以不慎。”</strong>就是当权的、当政的人，不可以不谨慎。做事情的人一样的，不可以不谨慎的，我们要懂得时时刻刻地严格要求自己。否则“辟，则为天下僇矣。”一旦有偏差的时候，则为天下人僇矣，僇是诛讨的意思，甚至是笔伐。</span></p><p><span> </span></p><p><span>我们去看历史，出现了一个暴君，有的人可能当时就被推翻了，即使没推翻，到后面也一定会被推翻。即使那段历史已经过去了，还会遭到写历史的人的讨伐，赫然地出现在人家的笔下，都是被说的、被骂的、都是声讨的，多可怕的事情。整个儒家告诉我们，懂得修身为本，要时时刻刻注意自己的德行，注意自己的行为，否则一定会被天下僇矣。</span></p><p><span> </span></p><p><span>《中庸》讲：<strong>“素隐行怪，后世有述焉，弗为之矣。”</strong>如果是素隐行怪的事情，就是搞怪的、哗众取宠的事情，即使有人赞同我们，有人支持我们，这样的事情我们也不要干，因为后面的时候一定会被天下僇矣的，这是必然的结果，也是道的一种规律。</span></p><p><span>所以我们每天一定要很注意自己的行为，要修正自己的德行，尤其是处上位的人，因为这里整个讲的都是治国之道。再往下延伸，就是我们每个人，想去做一个君子，都要懂得这样去修正自己。</span></p></div>"
},{
    "title": "《大学》第十三讲 德本财末",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><strong><span>《大学》第十三讲  德本财末</span></strong></p><p><strong><span></span></strong></p><p><strong><span>《诗》云：“殷之未丧师，克配上帝。仪鉴于殷，峻命不易。”</span></strong><span>这是《诗经•大雅》里面的一篇，叫做箴言，也就是劝诫之言，告诉人们要引以为戒的。《大雅》是周王朝所作的，告诉我们周王朝的人，要懂得引以为戒，所以叫箴言。殷朝未丧师，还在推行仁政、没有走向暴政、还合道的时候，是克配上帝的，是符合天道的。</span></p><p><span> </span></p><p><span>我们要懂得以他为表率、引以为戒，要看到他为什么走向没落的，就是以史为镜。整个殷朝的历史，一开始他们的德行，他们所行的道是符合天道的，是能克配上帝的，所以他们是可以治理好天下的，后面为什么不行了呢？是因为不合道，开始暴政了，不得民心了，所以才会这个样子。</span></p><p><span> </span></p><p><span>我们读《中华上下五千年》或者《中国通史》就会发现其中的规律，只要是朝代灭亡的，一定是施了暴政，一定是不合道的，一定是民不聊生的，一定是没有德行的，要不然朝廷不会结束。新一代都是揭竿起义的，从某种意义上讲一定是合道的，一定是为民请命的，故而他才能得天下，建立新的王朝。</span></p><p><span> </span></p><p><strong><span>“峻命不易”，</span></strong><span>峻命：崇高至上。不易：指不变的。峻命不易是告诉我们，崇高至上的使命是不能变的，如果变了就不合道，不合道就会走向衰落。我们现在做事情也是一样，《道德经》中讲：“不失其所者久，死而不亡者寿。”不失其所，我们只有不失其道，不偏离道，事情才能做得长久，一旦我们偏离道，事情必不长久，这是圣贤所讲的规律，已传承了几千年，不会错的。</span></p><p><span> </span></p><p><strong><span>“道得众则得国，失众则失国。”</span></strong><span>行为只要是合道的，只要是得众人心的，就能得国，否则会失国。我们现在做事情也是一样的，只要是得人心的，事情就可以做下去，如果我们是不得人心的，则做不下去。即使我们开一个饭店，也是一样的道理，得顾客喜欢，别人喜欢才得人心，事情才能做得下去，如果不得人心，事情就做不下去，道理是相通的，用在哪里都一样，我们如何才能做的到呢？</span></p><p><span> </span></p><p><strong><span>“是故君子先慎乎德。有德此有人。”</span></strong><span>君子一定要懂得修自己的德行。当有了德行，就会有人跟随于我们。以前圣贤的君主，是不是都有很多人跟随着他？他才能治理好一个国家。我们现在做事情也是一样的，如果我们是一个有德行的人，一定有人愿意跟着我们去做事情。</span></p><p><span> </span></p><p><strong><span>“有人此有土。”</span></strong><span>我们当有了德，有了人，才有自己的领土。用现在的话讲，我们才有自己的经营范围，才能有自己的行业。如果没有人，自己能做起来吗？孔圣人，至圣先师，也得有弟子三千，也得有七十二圣贤。做事情一定不是一个人做起来的，从古至今都不是。一个君王再圣贤，自己能治理国家吗？他一定是有他的德行，通过他的德行感召到很多贤能的人，在他身边跟着做事情，才有自己的土地、自己的领域，我们现在也是同样的道理。</span></p><p><span> </span></p><p><strong><span>“有土此有财。”</span></strong><span>有了自己的领域、有了自己的领土，钱财不是自然就来了吗？我们把事情做好了，服务好他人，钱财自然就来了。</span></p><p><span>“有才此有用。”这个时候挣来的钱是干嘛的？是用来反复地用的。比如我们工作、做生意，赚来的钱财干嘛的？是用的。比如我们想买一个房子，想买一辆车子，想用一个什么东西，或者我们再拿它继续投资，再拿它更好地利民，更好地去亲民，我们只有越用才能越多。</span></p><p><span> </span></p><p><strong><span>“德者，本也；财者，末也。”</span></strong><span>一定不要本末倒置，有德行，这是本，财自然就来了，这是末。颠倒了是不行的。</span></p><p><strong><span>“外本内末，争民施夺。”</span></strong><span>如果这个事情颠倒了，内在是没有德行的，我们不以德为本，心里想的只有财，就会去做很多敛财的事情，就会做一些强取豪夺的事情。我们现在做事情不是一样的吗？如果我们心里没有他人，没有我们的客户，我们没有内在的德行，每天想的就是如何从这些人身上榨取利润、榨取钱财，最后的结果可想而知。</span></p><p><span> </span></p><p><span>我们做生意的很多时候，刚开始都有很伟大的发心，做着做着内在要是失了德行，就会收高价，导致人就会越来越少，最后将自取灭亡。所以说我们每一个念头都要懂得“德者本也，财者末也”，一定不能本末倒置，否则是不行的。</span></p><p><span> </span></p><p><strong><span>“是故财聚则民散。”</span></strong><span>我们把财聚来了，民就散掉了。当时那个时代也是一样的，一个暴君搜取了很多钱财，是不是民心就散了？我们做事情也是一样的，如果只顾着追求利润了我们的客户就散了，跟着我们身边做事情的人就散掉了，就开始本末倒置了。</span></p><p><span> </span></p><p><strong><span>“财散则民聚。”</span></strong><span>如果我们把财散出去了，人就聚起来。比如我们做事情，也是同样的道理。我们没有要那么高的利润，让每个人都能接受、都能承受，让他们每个人都能赚到钱，人心自然就聚在一起了，自古以来的圣贤都在告诉我们这样的道理、这样的规律。</span></p><p><span> </span></p><p><strong><span>“是故言悖而出者，亦悖而入。”</span></strong><span>如果我们所说出来的话，是悖理的、是悖道的、是悖德的，经常讲出去的都是这样的话，“亦悖而入”，很多话就回到我们身上了。比如一个背后经常讲别人坏话的人，经常聊他人的不好，有一天这些话，都会回到自己身上来的。</span></p><p><span> </span></p><p><span>儒家文化告诉我们——慎独、谨言慎行。别说对他人讲不好的话，自己独处的时候，都不会去想别人的坏处，这叫慎独。何况我们跟他人相处的时候不停地讲别人的坏话。我们讲得越多，回到我们身上的就越多。</span></p><p><span> </span></p><p><strong><span>“货悖而入者，亦悖而出。”</span></strong><span>货：东西，财物。如果我们是悖理、悖德、悖义而得到的，一定会有一个地方让我们把财物漏出去。“德不配位，必有余殃。”老百姓经常讲一句话：“占小便宜的人，吃大亏。”今天东家占一点，西家占一点，我们占了很多小便宜，突然出现一个大事，所有的东西都散掉了。《道德经》也讲：“金玉满堂，莫之能守。”我们守是守不住的，只能靠自己的德行，我们不断地修自己的德行，德行越大，所聚来的东西就越多。</span></p><p><span> </span></p><p><strong><span>《康诰》曰：“惟命不于常”。</span></strong><span>道善则得之，不善则失之矣。人之天命，是不固定的，是无常的。虽然是无常的，但却是有迹可循的。我们的行为要是符合善的，就会得；不符合善的，就会失。天命虽然无常，但是有迹可循。得善，则得之，我们的行为若是不善的，就失之。</span></p><p><span> </span></p><p><span>我们一定要懂得积德行善，我们不断地积累自己的德行，所行都是善行，我们就会有所得，否则一定会有所失。《大学》开篇就讲：“在明德，在亲民，在止于至善。”明德是不断地积累自己德行的过程，亲民是行善的过程，这是《大学》教给我们的道理。</span></p><p><span> </span></p><p><strong><span>《楚书》曰：“楚国无以为宝，惟善以为宝”。</span></strong><span>《楚书》是春秋时候，楚国记录自己历史的一本书籍。楚国的一个大夫，叫王孙圉，出使晋国的时候，晋国的一位大夫负责接待，叫赵简子，他问楚国的大夫：“你们楚国有什么宝贝啊？”当时的楚国有很多的美玉，有很多的碧玉。这时楚国的大夫，回复的就是这番话，说：“我们楚国无以为宝，惟善以为宝。”就是“我们不拿那些金玉珠石，不拿这些东西当宝贝的，我们只以善人、以善良做宝贝。”这个大夫为什么会讲出来这样一段话？因为楚国当时推行的是这样的政策，他心里怀的是善念，所以才能讲出来这样的话。</span></p><p><span> </span></p><p><span>楚国也是春秋五霸之一，所以国家强盛必有它强盛的道理。从这番话我们就能看出来，那时的楚国是很重视人才的，是很重视善良这件事情的，所以它只以善良当做宝贝，其他外在的东西，是不以为宝的。</span></p><p><span> </span></p><p><strong><span>舅犯曰：“亡人无以为宝，仁亲以为宝。”</span></strong><span>舅犯是晋文公重耳的舅舅。晋文公流亡在外十九年，国家发生内乱之时，重耳逃出自己的国家，舅犯就跟在他的身边。后来晋献公，也就是重耳的父亲，去世的时候，国家又发生了内乱，这时秦穆公就来劝重耳，让他趁着这个时候回去重新夺取王位。</span></p><p><span> </span></p><p><span>当时他舅舅对重耳讲了这段话：“亡人无以为宝”，就是流亡在外的人，没有什么宝贝。“仁亲以为宝”，这时你的父亲刚刚去世，我们也没有什么宝贝在身，我们怎么能回去争夺位置呢？这样只会让国家更乱。重耳听了舅犯的话，没有回去，后来成为春秋五霸之一。</span></p><p><span> </span></p><p><span>从这里就能看出来，重耳是很有德行的，他不会为了一己之私，为了着急坐上那个位置，回去让国家更乱。举的这些例子都在告诉我们，“德者，本也；财者，末也。”不要本末倒置。</span></p></div>"
},{
    "title": "《大学》第十四讲 忠信之道",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第十四讲 忠信之道</strong></span></p><p><span><strong>“《秦誓》曰”</strong>《秦誓》是《尚书》里面的一篇，是秦穆公写的悔过之词。那时他千里迢迢，要出兵伐郑，结果中了晋国的埋伏。因为他跟晋国之间早已有一些摩擦和纠葛，当他千里出兵的时候，不听百里奚之言（百里奚是一位名臣）非要去攻打郑国，结果失败而归，于是写了这样一番悔过之词。</span></p><p><span> </span></p><p><span><strong>“若有一介臣，断断兮，无他技，其心休休焉，其如有容焉。”</strong>假使有这样一个臣，这个人很明智，懂得决断很多事情，但是没有什么特殊的技能，没有具体的技能，但是这个人很明智、很有决断能力、很善良、很宽宏大量的，就好像一个很大的容器。</span></p><p><span> </span></p><p><span><strong>“人之有技，若己有之。”</strong>因为他自己没有特殊的技能，但是别人有这样的技能的时候，就跟自己有是一样的，这样的人内在是有仁德的，没有私欲的，所以他才有容人之量。</span></p><p><span> </span></p><p><span><strong>“人之彦圣，其心好之，不啻若自其口出。”</strong>当别人有美好的德行的时候，自己是非常喜爱的，就相当于自己有是一样的。啻是我不仅、不只是从口上去赞许，我是真的能容下他。</span></p><p><span> </span></p><p><span><strong>“以能保我子孙黎民，尚亦有利哉！”</strong>就是这样有容人之量的、有仁德的、没有私欲的人，能保护我们的子孙，能保护我们的黎民百姓，这样的人是非常有利的。秦穆公是秦始皇的祖先，所以后面秦始皇能统一六国与秦穆公有很大的关系，因为秦穆公打下了很好的基础。从这段誓词就能看出来秦穆公的贤德，做了一件错的事情，开始悔过，写了这样一篇誓词，告诉他的后人，用这种宽宏大量的、有仁德的人、无私欲的人，这样的人是对国家有利的。</span></p><p><span> </span></p><p><span>我们现实生活中也是一样的，有容人之量的人、有仁德的人，才能做领导层的，技术很强的人很难做领导层，技术越强的人自己越执着，越倚仗自己会的东西，嫉妒或者排挤他人。所以越是有容人之量的人，反而才能做事情。</span></p><p><span> </span></p><p><span>有成就的企业家往往不是最专业的，他却是最有容人之量的，他是心怀天下的。做一个君王不需要什么都会，但是要有容人之量，要有仁德，要有爱民如子之心，这个时候力量就不一样了。我们每个人也是一样的，一定要有容人之量，一定要懂得修自己的德行，我们没有那么大的德行，就没有容人之量。</span></p><p><span> </span></p><p><span><strong>“人之有技，媢嫉以恶之，人之彦圣，而违之俾不通。”</strong>媢嫉是很嫉妒的意思。有这样一个人，别人有技能或美好的德行，自己会嫉妒和讨厌。违之就是反对。俾不通就是使他不要畅通，要去阻碍。比如我们看到别人有美好的德行，我担心他抢了我的位置，我会产生嫉妒，我就让他不通畅。电视剧中是不是经常这样演？当别人做了很多好的事情，他想方设法地阻拦，让他做不成。现在社会当中也是一样的，甚至是那个人有美好的德行、好的技能，我藏着、阻碍着，不要让领导和他人看到。</span></p><p><span> </span></p><p><span><strong>“实不能容，以不能保我子孙黎民，亦曰殆哉！”</strong>这样的人，一定是不能用的，是不能保我子孙黎民的。用现在的话讲，这样的人对整个团队是无益的，是很危险的，是有危害的，这样的人我们一定要远离，是不能留在团队当中的。</span></p><p><span><strong> </strong></span></p><p><span><strong>“唯仁人放流之，迸诸四夷，不与同中国。”</strong>唯仁人才能把这样的人放流之。因为这样的人有仁德，心中有子民，心中有百姓，行为和思维才是这样的，否则是看不到这些问题的。我们自己如果是没有仁德的人，能看懂他人身上的仁德吗？看不懂吧？所以，君子贤其贤而亲其亲。</span></p><p><span> </span></p><p><span>我经常讲一句话：“当我们自己身上有某方面的问题的时候，是看不懂他人的问题的。”比如当我们自己喝酒的时候，我们不觉得什么。假如今天开车，或者有很重要的事情自己没喝酒，但是陪着的其他人喝酒了，我们会发现自己是很反感的，这些人喝完酒怎么会是那个样子的呢？殊不知，我们自己实则也是那个样子，只是我们看不到，因为我们也有同样的问题，当有一天我们没有这些问题的时候，就看懂他人的问题了。</span></p><p><span> </span></p><p><span>只有自己是有仁德的，才能看懂他人的仁德，如果我们是自私自利的，就看不懂他人的仁德。但是同样，当我们有仁德的时候，自私自利的人坐在我们面前，无论他讲什么我们是一目了然，清清楚楚的。我们看得很明白，因为我们内心有仁德，就能看清楚他人是不是有仁德。我们内心是利他的，就能看清楚别人的行为、念头是不是利他的；我们要是心怀天下的，别人是不是心怀天下的，清清楚楚，一点都骗不了人。“唯仁人放流之”，只有自己是仁德的人，我们才能看懂这些事情，把不能容人的人放逐。</span></p><p><span> </span></p><p><span>“迸诸四夷”，四夷：边远的地区。把不能容人的放逐到边远的地区，那时分为中原和四夷，中原是核心的地带，比如我们现在所在的曲阜、泰山，在当时是中原大地。那时分东夷，西戎，南蛮，北狄，这叫四夷，就是边荒、边远之地。比如那个时候，王阳明先生流放到贵州，是属于蛮夷之地。</span></p><p><span> </span></p><p><span>不与同中国，就是不让他在中原待着，要远离这样的人，因为这样的人很有危害的，对于团队也是有危害的，对于整个国家是有危害的。现在就简单了，这样的人我们离他远一点就够了，我们从小的时候家长是不是都教给我们这个道理？说：“谁家那个是坏孩子，不要跟他玩，离他远点。”要跟那些好孩子、学习好的人玩，是希望我们受到好的影响。</span></p><p><span> </span></p><p><span><strong>“此谓唯仁人为能爱人，能恶人。”</strong>只有我们自己是一个仁德的人，我们才懂得爱什么样的人，远离什么样的人，讨厌什么样的人。我们只有自己是通达的才能看明白这个事情。</span></p><p><span> </span></p><p><span>很多跟着学习的朋友反馈或留言说，跟着学习了三四个月，有的人就不愿意跟身边的朋友一起玩了，为什么呢？因为我们改变了内心，变得有仁德了，追求不一样了，跟以前的朋友开始不同频了。说明我们在往上走，该换一个新的圈子了，该换一些新的朋友了，这时再聚来的都是有仁德的人，跟我们同频的人。这是人生成长的必然阶段，只有自己是仁德的人，才能看明白什么样的人仁德，什么样的人不仁德。</span></p><p><span> </span></p><p><span><strong>“见贤而不能举，举而不能先，命也。”</strong>我们见到贤德的人，不能举用，就是不识人。因为我们自己，要是没有仁德，就看不到别人的仁德；自己要是没有仁爱，就看不到别人的仁爱，也用不了贤德的人。不是贤德的人不出现，而是我们看不到、看不懂。“举而不能先”，有的人我们虽然用了，但是没有先用、没有重用。</span></p><p><span> </span></p><p><span>命也，告诉我们是我们自己的命不好。怎么改命？让自己变得有仁德，让自己的行为变得光明、变得良善，就能看到别人的良善、别人的仁德。如果我们看不到，不懂得修正自己，那是自己的命不好，不怪别人。</span></p><p><span> </span></p><p><span><strong>“见不善而不能退，退而不能远，过也。”</strong>见到这些不好的人、不善的人，不好的行为、不善的事，我们不能退、不能远离的（远：这里读四声，是远的意思。）那是自己的过错和过失。</span></p><p><span> </span></p><p><span>比如我们身边的很多朋友不是一样的吗？如果我们明知道他很多行为是不好的，如果我们还不能退，退而不能远，那是我们自己的过错，是会出问题的。《论语》中，司马牛问仁也是一样的，他有兄弟五个，在家里排行是老三，他的两个哥哥和两个弟弟要造反，都要谋反，司马牛劝他们不能谋反，即使得了天下，也被天下人不耻。如果得不到，他就会受牵连了。</span></p><p><span> </span></p><p><span>这时他问孔子什么叫仁，孔夫子跟他聊完以后，他开始离开宋国去了齐国，远离他的弟兄们。后来兄弟几人果然失败，他的哥哥到齐国找到他，他又离开了齐国，又走了，不与他们为伍，虽然是兄弟，但是他们不仁德，做的事情实在不是君子所为。这里告诉我们，如果我们见到不善的人、不善的事，不能远离是自己的过错和过失。</span></p><p><span> </span></p><p><span><strong>“好人之所恶，恶人之所好，是谓拂人之性。”</strong>我们讨厌的东西，都是他人喜欢的，这是违背人性的。尤其是治国，人民喜欢的东西，你非要剥夺；人民不喜欢的东西，你非要强加于人——这是违背人性的，必不长久，结果就出来了。</span></p><p><span> </span></p><p><span><strong>“灾必逮夫身。”</strong>灾难必然要降临到自己身上的。我们现在做事情也是同样的道理，如果我们满脑子都是想着自己如何多得，想着如何剥夺他人，最后我们自己的结果一定是不好的，这是必然的，一定要懂得这个道理。</span></p><p><span> </span></p><p><span><strong>“好民之所好，恶民之所恶。”</strong>别人做的每件事情也在想着省钱，我们尽己所能地给予对方，给予他好的，给予他想要的，而不是我们给一点点东西，卖很高的价，这就相当于施暴政了。所以我们每一个念头都要这样思维的。</span></p><p><span> </span></p><p><span><strong>“是故君子有大道，必忠信以得之，骄泰以失之。”</strong>君子是有自己重大的原则和做事准则的，什么准则呢？这里的忠信指的是要忠于自己的国，忠于自己的子民，要对他们讲信誉，要对他们讲诚信，只有这样忠信地做事情才能有所得，否则“骄泰以失之”，如果是骄纵的、是傲慢的，必然会失去的，治国则失国。</span></p><p><span> </span></p><p><span>我们现在做生意，则会失去生意，君子一定是有自己的行为准则和标准的，这个准则就是忠信之道，我们忠于自己做的事情，忠于自己的消费者，忠于自己的客户。我们忠于身边的每一个事情，我们忠于身边的每一个人，只有这样符合道，才能有所得，否则必然有所失。</span></p></div>"
},{
    "title": "《大学》第十五讲 生财之道",
    "author": "虚空先生",
    "date": "2022-08-04",
    "html": "<div class=\"B1_text\"><p><span><strong>《大学》第十五讲 生财之道</strong></span></p><p><strong></strong></p><p><strong>“生财有大道。”</strong><span>自古以来，无论是齐家，治国，平天下，都是要用到财的，儒家是提倡我们获取财物的，但是不要本末倒置。德为本，财为末，当我们内在有德的时候，财自然而然就会到来。生财有大道，大道就是生取财富的方法，一定是要合道的。</span></p><p><span> </span></p><p><span><strong>“生之者众，食之者寡；为之者疾，用之者舒；则财恒足矣。”</strong>做事情的人多，消耗的、使用的人要少；做事情的人都是积极的、努力的、向上的；用度都是有节制的、都是舒缓的，如此财才能恒足，也就是长久、充足、够用，进大于出，创造的人多。</span></p><p><span> </span></p><p><span>比如我们讲任何事情是一样的，只有进大于出的时候，事情才长久，做企业也是如此。比如一个人的修行、一个人的学识，都是如此。我们得不停地进，才有东西可出。我们常说“词穷”了，不知道说什么了，是我们没有进来新的东西，那我们又输出什么呢？比如一个人的胖，也是进大于出，吃的多，不运动，积累了一堆脂肪，就胖了。但是做事情，学识，正好是反过来的，一定是多进少出，只有这样才能恒足。</span></p><p><span> </span></p><p><span>以前都是鼓励人们多做事情，到现在也一样，修行以后不是什么都不做了，儒家鼓励我们要去做事情，要去担当的，否则也不会讲“齐家，治国，平天下”，要积极向上、积极努力地多去做事情，是可以获取财物的，只不过告诉我们以德为本，以财为末。当我们自己是有德行，再去帮助更多人，做利益更多人的事情，财富自然就多了。</span></p><p><span> </span></p><p><span><strong>“仁者以财发身，不仁者以身发财。”</strong>仁者是以财发身的。身是什么呢？身给我们包含的东西很多，这里告诉我们“修身为本”，一个人的智慧、名声、名望、德行，这都是身，都是身体所带来的东西。所以仁者是以财发身的，是通过这些财物让我们变得更有德行、变得更有名望、变得更有尊严、变得更多地去帮助他人的。财是用的，不是用来贪的。</span></p><p><span> </span></p><p><span>我们有了这些东西，是为了让自己的德行变得更好，让自己变得更有智慧，让自己变得更从容一些，让自己变得更愿意帮助他人。所以仁者，是以财发身的。“不仁者以身发财”，不仁德的人，用尊严、用德行去换取钱财。开始不择手段了，不要尊严了，不要脸面了，不要良心了，不要品德了，也不要善行了，拿这些东西全部用作换财，这就是反了。</span></p><p><span> </span></p><p><span><strong>“未有上好仁，而下不好义者也。”</strong>处上位的人，如果是讲仁德的，下面的人就跟讲义气。《中庸》讲：“义者，宜也。”合适的、适度的叫义。“上好仁下好义”，上边的人讲仁德，下面的人讲义气，是一种什么感受呢？合适的度，“我为人人，人人为我”，在任何一个团队当中都是这样的。包括以前的一个国家，一个诸侯国也是一样的，处上位的人如果他是仁德的、仁爱的、是仁慈的，处下位的人就愿意讲义气，做事情就合度，大家都愿意付出、都愿意努力，上面好仁，下面就好义。</span></p><p><span> </span></p><p><span>比如我们平时生活当中，跟朋友是不是也讲“这个人很讲义。”什么叫义？做什么事情都是适度的，是为他人去着想的，就是“人人为我，我为人人”的一种感受。我们有仁爱、有仁慈的时候为别人着想，别人就对我们讲义气。我们如果对他人不仁不义，他人对我们自然也就不仁不义，所有的东西，都是靠这样影响而来的。告诉我们，无论在做任何事情，我们处上位的时候讲仁德，处下位的时候讲义气，久而久之就会形成一个良性的循环。</span></p><p><span> </span></p><p><span><strong>“未有好义，其事不终者也。”</strong>如果大家是好义气的，任何事情都会有好的结果，都会善终。如果大家都是不讲义的，事情难得善终。以前治国如此，齐家如此，现在我们做事情也是如此。如果大家都不讲义气，如果大家都不懂得为对方付出，果大家都不懂得适度，这个事情很难善终的。</span></p><p><span> </span></p><p><span>为什么企业要经常搞团建？团建就是让大家的凝聚力更强，让大家更好地融为一体。处上位的人好了，下面的人也好；处下位的人好了，上面的人也好了，它是一荣俱荣，一损俱损的事情。我们去为人人做事情的时候，人人自然就为我们做事情。</span></p><p><span> </span></p><p><span><strong>“大学之道，在明明德”，</strong>就是光明自己的德行。仁、义都是德行里面的东西，我们不停地让自己的德行变得更好后，再亲民，我们不停地去帮助他人，做对他人有益的事情，我们目标是止于至善的。</span></p><p><span> </span></p><p><span><strong>“未有府库才，非其财者也。”</strong>治国讲到国库，其实都是你的财；人民手里的财，也都是你的财。《诗经》讲：“普天之下莫非王土。”实则也是说都是你的，你又何必去做私欲的事情，为了一己之私，榨取别人的东西。</span></p><p><span> </span></p><p><span>我们现在做团队也是一样的，整个公司的东西其实都是我们的财，何必都要揽在自己的手里。如果我们都揽在自己的手里，我们的客户、团队、员工，大家都得不到，谁又去跟我们做事情。这段话其实都是在告诉我们不停地增加自己的仁德，所有的事情不要据为己有，不要忘了“德是本，财是末”。</span></p><p><span> </span></p><p><span>我们不停地去对他人好，他人所反馈给我们的自然就是一样的。不要想着所有的事情都占为私有，我们越是这样的话越是守不住。现在做企业是一样的，只要企业做好了，我们会发现从上到下大家都是有钱赚的，都是有利润的。有没有可能说只有老板一个人赚钱，下面的人都赚不到钱？他也做不下去。有没有可能员工都有钱了，老板穷得不行？也不太会的，任何事情它都是这样的。这段话其实告诉我们要有仁德，要有大局观，不要所有的事情都想着自己，越是这样的话越求而不得。</span></p><p><span> </span></p><p><span><strong>孟献子曰：“畜马乘，不察于鸡豚。”</strong>孟献子是当时鲁国的大夫，是一位很贤德之人。他讲了这样一段话，“畜马乘”，就是家里有马乘的人，这样的家里都是非富则贵，通常泛指做官的人。这样的人都是“不察于鸡豚”，豚就是猪，这样的人家就不要在意鸡、猪这些小事情了。</span></p><p><span> </span></p><p><span><strong>“伐冰之家，不畜牛羊。”</strong>伐冰一般指的是卿大夫，就是高官了。只有卿大夫以上的人，家里有人去世才能用冰葬，平时家里才能有冰可用。那个时候冰是很珍贵的，不像我们现在有冰箱，谁家都能用。这样的家庭不畜牛羊，就不要养牛和羊了。</span></p><p><span> </span></p><p><span>这里面有三层意思：第一层是不与民争利，如果已经到这样高贵的身份了还去做这样的事情，给他人留什么出路呢？第二层是做卿大夫的人，要多多关注国事和民生，不要还想着自己养牛羊，心里装着什么呢？在我们团队当中也同样适用，不要去跟下面的人争一些蝇头小利。第三层，要素其位而行，知道自己的关注点在哪里，有更多的事情去做，不要去看牛羊鸡豚的事情。好比是我们要找好自己位置，该做哪个事情，不要盯着小的、琐碎的事情。</span></p><p><span> </span></p><p><span>如果一个企业当中，董事长或老板每天看的都是蝇头小利，看的是每个岗位上人的那点事情，哪有格局和境界可言呢？《中庸》讲：“君子素其位而行，不愿乎其外。”每个人要找准自己的位置，做应该做的事情。</span></p><p><span> </span></p><p><span><strong>“百乘之家，不畜聚敛之臣。”</strong>百乘就是有一百辆马乘的人家，通常这样的人都是封地的，比如在诸侯国，一般是某一个国君的儿子，或者立过重大贡献的人，有过战功的人，通常这样的人会有封地，有封地的人才能有百乘，开始有自己的府库，有自己采邑的地方。“不畜聚敛之臣”，就不要养那些给自己敛财的人。</span></p><p><span> </span></p><p><span><strong>“与其有聚敛之臣，宁有盗臣。”</strong>如果要养这种聚财的臣，还不如有盗臣，偷点东西算了，为什么呢？因为他会毁坏整个基业，败坏明德，廉洁、贤德的人是不养这些聚敛之臣的，但是如果是一个贪婪的人，就会养聚敛之臣。</span></p><p><span> </span></p><p><span>我们现在做事情也一样，比如我们团队做传统文化，讲修行，天天想着如何为他人着想的，我们就不会养聚敛之臣，因为这样的人跟我们的想法完全是不一样的。如果大家做任何事情都是想着如何获取更多的钱财，有一些好的、利他的想法的人，在这里是留不住的，因为大家完全不同频，不是一样的思维。</span></p><p><span> </span></p><p><span>优秀的企业其实都在讲价值观，都在讲使命，但是我们听不懂的时候，就认为人家讲的东西都是虚的，其实恰恰是那些大家认为虚的东西，才是人的精神食粮，是那些东西支撑着人们向前走，绝对不是表面上的利润。当我们把这些事情做好，我们把客户服务好，消费者都满意的时候，怎么会没有财呢？很多时候是我们把顺序做反了而已。</span></p><p><span> </span></p><p><span><strong>“此谓国不以利为利，以义为利也。长国家而务财用者，必自小人矣。”</strong>国家是以义为利的，如果掌管国家的人，很注重财物，所有的出发点都在财上，有这样的想法本身就是一个不仁德的人，当有这样的思维，一定会感召很多小人在身边。</span></p><p><span> </span></p><p><span><strong>“彼为善之”，</strong>对方所做的事情都是来讨好我们的，因为我们是重利的，那找来的人，他一定会不停地讨好我们，叫彼为善之。他讨好我们的同时，是不是他自己也要有所私藏？中饱私囊，因为我们是一样的思维，贤德的君王手下，才能养清正廉明的人。</span></p><p><span> </span></p><p><span><strong>“小人之使为国家，菑害并至。”</strong>如果国家用的都是这样的人，一定会招致天灾人祸的，一定会导致民不聊生的。</span></p><p><span>“虽有善者，亦无如之何矣！”虽然这里面还会有一些善的人，会有一些忠臣，也无可奈何了。整个中国历史都是这样的，有一些昏君出现的朝代，难道没有忠臣吗？只不过他们无法扭转和改变局面，因为太多的小人当道，没有办法，即使有贤臣有忠臣，也改变不了任何事情了。</span></p><p><span> </span></p><p><span>我们反过来讲也是一样的，比如那些比较盛世的朝代，有没有不好的人？不好的臣？但整体都是好的，即使出现个别不好的人也无伤大雅，不会影响整体的。我们现在任何一个团队也是一样的，只要绝大多数人都是积极的、努力的、向上的，足矣。即使有一些不好的也没关系。但是如果反了，大家整体都是不积极的、不努力的、不向上的，偶尔有好的，也没有什么办法，改变不了整体的局势。</span></p><p><span> </span></p><p><span><strong>“此谓国不以利为利，以义为利也。“</strong>治理国家不能以“利”为利，要以“义”为利，当我们内在是有仁德的，当我们是不停地付出的，才能看到世界的美好。我们不停地讲仁德，别人才跟我们讲义气。这时我们会看到，其实每个人都很可爱的，会看到每个人其实都很不容易的，每个人其实都是美好的，所以我们不停地去明自己的德行，才能看到这个世界的光明。</span></p><p><span> </span></p><p><span>如果我们不能去明自己的德行，看到的都是不好的，看到的都是自私自利的，因为我们心里装着的就是这些自私自利，所以看到的就是这样，我们内心如果是装着仁德的，就能看到更多的美好。</span></p><p><span> </span></p><p><span><strong>《大学》开篇讲：“大学之道，在明明德。”</strong>第一个明是动词，不停地明，就是修正的过程，让我们找到我们自己本有的光明的德行，然后开始外用，不停地亲民，目标是止于至善的，一直奔着善的方向，这是我们每个人修正的方向，也是我们做事情的方法。</span></p></div>"
}]