[{
    "title": "《素书》第一讲 原始章第一",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\">            <p><span><strong>《素书》第一讲 原始章第一</strong></span></p><p><span></span></p><p><span>我们先来讲这个素字，在古代什么叫做素？没有经过染色的布料称为素，它是洁白的，是干净的，是没有经过后期的处理和杂染的称为素，见素抱朴，呈现出来最朴素的，最原始的，最干净洁白的样子。</span></p><p><span></span></p><p><span>《素书》是告诉我们如何回到最洁白，最纯净，最干净的样子。有点像《道德经》里所讲：<strong>“去欲还本，返璞归真”，</strong>归到最朴素，最真的样子。</span><span>《素书》的原作者黄石公，一位老人家把这部《素书》传给了张良，很多人因张良而知道《素书》。</span></p><p><span></span></p><p><span>这本书辅助刘邦得了天下，很多人说它是权谋之术。权谋听上去，好像不太好的样子，权谋本身并没有特性，也没有好或者坏。不同的人用，权谋就会呈现出来不同的状态。</span></p><p><span></span></p><p><span>何为谋？谋是提前规划，提前谋划所有的事情，做好提前量，我们说运筹帷幄是不是谋，决胜于千里之外是不是谋？</span><span>何为权？谋人谋事都称为权，尤其是在古代，古代通常人们要想去做一些利益他人的事情，基本上都会通过考取功名，也就是得到所谓的权利，得到所谓的权利，我们才能去谋划更多的事情。</span></p><p><span></span></p><p><span>所以整个《素书》的素，就可见一斑了，告诉我们《素书》的主旨，绝对不在权亦不在谋，权谋只是外用的方法。</span><span>《素书》的根本是修身之道，修身是内在所用的道，权谋只是外在的术，他教给我们的依然是修身养性为本，权谋方法为辅，我们再来讲修身之道。</span></p><p><span></span></p><p><span>自古以来的修身之道，儒家告诉我们《大学》之道，在明明德，在亲民，在止于至善。道家告诉我们正己化人，无论是儒释道的文化，乃至于诸子百家，都告诉我们一个道理，不停地修正自己,再去帮助他人，做利益他人的事情，称为修身之道。</span></p><p><span></span></p><p><span>《素书》也是同样的，当懂得了修身之道，我们要想去亲民，去觉他，去化人，去帮助他人的时候，如果没有方法，只有道体，而道是体，则是不能用的。所以我们就要学习方法了，《素书》就是教给我们方法的。</span></p><p><span></span></p><p><span>何为权谋？圣贤之人用以谋划事情的智慧，称之为权谋。圣贤之人最基本的要守君子之风，走君子之道，要懂得以修身为本，这时权谋就是用来做事，用来安天下的智慧。如果没有修身为本，就不是权谋，是诈谋，是诡诈。</span></p><p><span></span></p><p><span>《素书》还有一个传说，这本著作是不能传到不道、不神、不圣、不贤之人手里的，因为如果不懂得修身之道，用了这个方法，最后是损人损己的。</span></p><p><span>当时黄石公写了这本著作，他要找一个传人，这个人就是张良。张良的家族往上数，五代祖上都是在韩国为相的，后来韩国被秦国所灭，秦始皇统一天下。</span></p><p><span></span></p><p><span>张良开始流亡在外，张良从小就是一个饱读诗书，博学之人，韩国被灭后，他想要去复兴自己的国家，于是变卖所有的家财，要刺杀秦王，后来刺杀秦王没有成功，张良却在忙乱之中侥幸走脱，因此他心里是怀着国仇家恨的。</span></p><p><span></span></p><p><span>后来张良逃亡到下邳这个地方，黄石公已经提前在这里，等待着他的到来。张良在这里遇见了黄石公这位老人家，黄石公还是要试探他一番的，于是黄石公在一座桥上，坐在那里，把自己的鞋扔到了地上，张良从这里经过时，黄石公对他讲：“你把我的鞋捡起来，给我穿上”，而且黄石公的态度是非常傲慢无礼的，张良依然把鞋捡起来，很耐心地给他穿上。</span></p><p><span></span></p><p><span>这里面体现了两点：第一点，张良是一位有仁慈之心，有德行之人，当他看到一位老人家，可以把他的鞋捡起来，给他穿上，这不是常人所能做到的。第二点，黄石公傲慢无礼，这时一个人还能动恻隐之心，很是了不起！我们思考一下，当我们看到一个可怜之人，能升起恻隐之心，跟看到一个傲慢无礼之人，也能升起恻隐之心，孰高孰低，是不是一目了然。</span></p><p><span></span></p><p><span>通常我们看到一位老人家，很可怜的样子，能把他的鞋捡起来给他穿上，已然是有恻隐之心了。可是，当他对我们傲慢无礼的时候，我们依然能升起恻隐之心，能把他鞋给他穿上，这个时候比常人是更高一筹。黄石公心里默默地赞许，孺子可教也，于是对张良讲，明日再到这个地方见面，我有话与你交代，这位老人家就走了。</span></p><p><span></span></p><p><span>次日，张良到这里时，发现老人家已经站在那里了，黄石公讲：“和老人家见面怎么可以来这么晚，回去吧，明天再来”。</span><span>第二天，天刚刚破晓，鸡鸣之时，张良来到了这里，发现老人家已然先他一步，结果黄石公又说了一句：“回去吧，明天再说。”</span><span>又到了第三天，张良考虑到前两天老人家到的比较早，所以半夜前往，在那里守候着，这时看着黄石公默默地走来了。</span></p><p><span></span></p><p><span>黄石公在试探他什么呢？张良本身极具天赋，是一位有仁慈之心，有恻隐之心，有德行之人，但是有这些还不够，还要勤奋和精进的，通过三天的试探，确认此人还是很勤奋很精进的，所以才把《素书》传给了他。</span></p><p><span></span></p><p><span>我们先做一个总结，当一个人本身就具备才识，又博学，有仁慈之心，恻隐之心，有德行，又勤奋精进，他日必成大器。这时黄石公开始对张良交代和嘱托，告诉他，秦朝已到末世，已经开始衰退了，长期地实行暴政，已经民不聊生，民怨四起，让张良千万不要意气用事，莫以家恨为大，当以百姓为大，以大仁大义为主啊！</span></p><p><span></span></p><p><span>我们潜心修习《素书》里所讲的内容，告诉我们如何修身，如何谋划事情，谋划事情可以让我们善始，但是如果不懂得修身之道，不懂得天道，就不可能全身而退。</span></p><p><span></span></p><p><span>我们纵观历史，很多人都是有善始，没有善终的，因为没有学习道家的文化，不懂得天之道。《道德经》给我们讲同样的道理：“功成身退天之道”，“功成事遂，百姓皆为我自然”，这都是天道。</span></p><p><span></span></p><p><span>做了很多事情，功成了，百姓皆谓我自然，百姓以为自然而然就是这个样子的，天道就是这样，做了很多事情，利益万物，普照万物，承载万物，包容万物，却从来不居功。</span></p><p><span></span></p><p><span>所以告诉他，要想善始善终，好好修习《素书》。整篇《素书》分为六章，原始章第一，何为原始？最根本最初始的称为原始，是以修身为根本的，原始章讲的都是修身之道。</span></p><p><strong></strong></p><p><strong>夫道，德，仁，义，礼，五者一体也。</strong><span>夫是助词，一体也是什么意思呢？我们断一下句，道原始也，德，仁，义，礼，与之一体也。道是本体，是无法用的，但是所转化过来的德，仁，义，礼，是道体的外用，是可以用的。</span></p><p><span></span></p><p><span>为什么我们要学习《素书》？《素书》给我们讲了很多方法，告诉我们如何去妙用。儒家讲，明德，亲民，止于至善，我们来体会，明德是修正自己，亲民是帮助他人，止于至善是我们的方向，如何亲民呢？明德是道，亲民是用啊！</span></p><p><span></span></p><p><span>我们再来看这句话，就比较容易理解了，道是体，外用的时候是德，仁，义，礼，告诉我们五者一体也。如果一个人讲话做事是合道的，我们通过什么看出来他是合道的呢？通过他的德行，看他有没有仁爱之心，他做事情讲不讲义，他做事情守不守礼，这都是道的体现的部分，也就是用的部分。</span></p><p><span></span></p><p><span>我们再来延伸这句话，道是原始也，是道体，外用不仅是德，仁，义，礼，还有信，还有善，还有很多很多！这里只是列举了一部分人们能听得懂的，总结性的告诉我们五者一体也。如果延伸，体现道的部分太多了，当我们懂得了道是什么？德就是道，所得出来的果。我们懂了什么是道，我们做事情就是合德的，在天为道，在人为德。</span></p><p><span></span></p><p><span>一个人如何符合天道？如何符合道的运行规律？这个人做事情是有德行的，是可以承载的，是可以包容的，厚德载物，所以德是用，是果，万物以仁，要用仁爱之心，慈爱之心，去对待万事万物。</span></p><p><span></span></p><p><span>处事以义，何为义呢？当我们做的事情都是合适的，都是适度的，这个时候才叫义。通常用义怎么组词？比如，道义、忠义、信义。什么叫道义？做事情是合道的，是适度的，称为道义。何为忠义？做的事情是符合忠的，是适度的，是合时宜的，当我们懂得，以义去处事，都是适度的，都是合适的，才能合道。</span></p><p><span></span></p><p><span>待人以礼，我们接人待物的时候，要以礼相待，要懂得谦卑，要让别人感觉到舒适。礼之用，和为贵，每个人都觉得很舒服的状态，就是和。延伸到我们现在，无论在生活当中，做企业还是工作，还是人际关系中，对方觉得很舒服，和我们交往是自在的，是舒适的，是痛快的。</span></p><p><span></span></p><p><span>我们的谋要用在何处呢？我们想用方法，想齐家，治国，平天下，想在这个社会有立足之地，如果只是学习了权谋之术，而不懂得道的运行规律是什么，不懂得什么叫德，什么是仁心仁爱，不懂得做事情是要讲义的，不懂得以礼待人，那么我们所学的权谋之术，亦不起作用。</span></p><p><span></span></p><p><span>《素书》又告诉我们不道、不神、不圣、不贤之人，不可轻传。在张良所在的时代，基本上只有，考仕途或为官这一条路，可以帮助他人。我们这个时代，各行各业都可以去做利益他人的事情，所以我们不敢因噎废食，不敢让这样一部经典荒废掉。</span></p><p><span></span></p><p><span>现在很多人已经读过《素书》，我们再来解读，是为了方便所有的人，懂得以修身为本，懂得去掉我们这些外在的欲望，外在的贪婪，回到最本真的，最质朴的样子，用《素书》里所教给我们的方法，可以去利益更多的人，这是《素书》的作用和意义。</span></p>        </div>"
},{
    "title": "《素书》第二讲 不知其所由",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二讲 不知其所由</strong></span></p><p><span><strong></strong></span></p><p><span><strong>道者，人之所蹈，使万物不知其所由。</strong>蹈是遵循的规律，道是人人都需要遵循的自然规律。每个人都是要遵道而行的，万事万物同样也是遵道而行的，使万物不知其所由。</span></p><p><span><strong></strong></span></p><p><span><strong>道不远人，</strong>道本身就在天地万物之间，人人都要遵道而行，万事万物都要遵道而行，却不知道什么是道？不知道为什么会是这个样子的？人们并不知道是什么原因？</span></p><p><span></span></p><p><span>比如，四季的变化也是道，夫妇之间，平时生活也是道，万事万物的发展规律也是道，人们不知道，原来这个就是道，不知道，道是如何形成的。道者，人之所蹈，既然每个人都要遵循道的规律运行，我们就要懂得学道了，如果不懂得学道就会不知其所由。</span></p><p><span></span></p><p><span>不知道为什么会是这个样子？生活当中，工作当中，事业上，社会上，时代里发生了一件什么事情，智者一看，一目了然。可是没有智慧的，迷途当中的人们，就不知其所由，开始抱怨，开始怨天尤人。</span></p><p><span></span></p><p><span>为什么会是这个样子的？我很努力为什么会失败？我很努力地经营这段感情，为什么对方会离开我？我很努力地煞费苦心地培养孩子，可是为什么培养不好？我每天朝九晚五地工作，为什么事情还做不好？我比隔壁的店铺，多付出了五倍乃至十倍的努力，我的生意为什么不如他做得好？</span></p><p><span></span></p><p><span>我们如果不能从道的规律当中，总结出来智慧，看什么事情都是不知其所由的状态，不知道为什么就这个样子了，可是智者通过观察事物的规律，就会知道，万事发生必有痕迹，必有原因，必有规律，只不过是我们自己没有发现而已。</span></p><p><span></span></p><p><span>我们停下来思考，很多朋友跟着学习和修行，当经历三个月，五个月，七个月，我们再去看生活当中所发生的事情，是不是就知道，他为什么会有今天这个成果？为什么会形成今天这个局面？都是有规律可循的，而所有的规律，我们统称为道。</span></p><p><span></span></p><p><span>孩子上学有上学的规律，做事情有做事情的规律，讲话有讲话的规律，行善积德亦是一种规律，自然变化亦是一种规律，世事无常亦是一种规律，种什么因得什么果，亦是一种规律。</span></p><p><span></span></p><p><span>道到底是什么呢？没有人能说得清楚，因为道本身就是包罗万象的，我们只能用文字的概念，简称为规律而已。所有的事情都有其发展的规律，都有发展的痕迹，这个时候我们人人都要去学道的，我们学道以后，不仅能知道其缘由，而且按道行事，是不会出过错。</span></p><p><span></span></p><p><span>道前定则不穷，我们要懂得道是什么，懂得提前按道行事，做的事情是合道的，则无穷无尽，否则必是短暂的。道是每个人，还有万事万物都要去遵循的规律，只有我们不停地去学道，我们才能知其所以然，就不会在发生事情的时候，是懵懂的，迷茫的状态，让自己做一个智者。</span></p><p><span></span></p><p><span>为什么每个人都要去遵守道？为什么要去学道？当我们学了道，遵守道，才能妙用。所有事情的发生，我们能看得清楚，这里并没有过多地讲什么是道？我们可以听《中庸》，《大学》，《道德经》，都是讲道的。</span></p><p><span></span></p><p><span>《大学》有大学之道，《中庸》有中庸之道，《道德经》有道德经所讲的道，这里告诉我们道的妙用，我们为什么要去学道？我们如果不学道，就是不知其所由，我们找不到事情的规律，所以会深陷痛苦和迷途当中，无法自拔。</span></p><p><span></span></p><p><span>道者，人之所蹈，使万物不知其所由。第二重境界是什么意思？什么是道？人人都要遵守的规律，当我们合道行事的时候，利益万物，万物不知为何就形成了当下的状态。</span></p><p><span></span></p><p><span>《道德经》讲：“功成事遂，百姓皆谓我自然”，事情做成功了，别人以为这个事情，自然而然就是这个样子的，而不知道是我们从中做了什么，叫做皆谓我自然，这个自然，不是我们讲的大自然的自然，而是自然而然的一种状态。</span></p><p><span></span></p><p><span>举个例子，一个懂得修身的君子，跟在身边时间长的人，自然而然也会变成君子之风，不知道什么时候，不知道什么原因，自己就成了这个样子，这就是自然而然，没有任何刻意的成分，而是自然而然所形成的。</span></p><p><span></span></p><p><span>再举个家庭当中的例子，作为家长，如果我们不停的要求孩子，今天要做这个，明天要做那个，这个就是不自然，孩子就不会愿意去做，并且要求的时间长了，他就会产生叛逆，在企业中要求员工也是同样的道理。</span></p><p><span></span></p><p><span>什么叫自然？自然是不用去刻意，不去治理，不去要求别人，叫无为而治。当我们不停地修正自己，让自己的身，心，意都是合道的，跟在身边的员工，或者孩子，或者身边的学生，会自然而然跟着变成一个样子，这个叫自然。</span></p><p><span></span></p><p><span>《素书》是妙用的，道家精髓的妙用就在自然两个字，很多人理解道法自然，认为自然的然也对，但是不够道家的精妙之处，而应该是自然而然的状态。</span></p><p><span></span></p><p><span>人们常用天比道，我们看看天道，是不是自然而然的？我们看天地，地在承载万物，天在普照万物，包括太阳每天东升西落，该下雨的时候下雨，该干旱的时候干旱，一切都是自然而然的。天地并没有刻意去做任何事情，却滋养了万物，这个就是自然，看似毫不刻意，云淡风轻的，什么都没有做，可是事情已经做完了。</span></p><p><span></span></p><p><span>这部书的作者黄石公老人家，他看到了天下大乱，想要匡扶正道，让黎民百姓少受苦，但是他自己是一个修道之人，实在不愿意抛头露面去做这样的事情，所以他物色了张良。张良得到《素书》，辅佐刘邦得了天下，刘邦有一句名言：“运筹帷幄之中，决胜千里之外，吾不如张良；安邦定国，安抚百姓，不绝粮道，吾不如萧何；带领百万之军，攻必胜，吾不如韩信”。</span></p><p><span></span></p><p><span>人们都知道，汉高祖刘邦，如果不是因为学习《素书》，张良显得没有那么重要。这个就是道家的高妙之处，辅助刘邦得了天下，最后又全身而退，不着痕迹。我们再来看，何为自然？做事情是不留任何痕迹，可以全身而退的，别人看到的样子，就是那么云淡风轻，自然而然所形成的当下的结果，这个叫自然。</span></p><p><span></span></p><p><span>当我们遵循着道的规律做事情，做完事情以后，使万物不知其所由，万事万物不知道是我们在其中做的事情，不知道是道在其中运行的，以为自然而然就是这个样子，这正是道家的高妙之处。</span></p><p><span></span></p><p><span>为什么说自然非常得高妙呢？妙在哪里？如果刻意而为，就会出现阻挠，就会出现障碍，中国的文化告诉我们，棒打出头鸟，木秀于林，风必摧之，这就是刻意而为了，如果把自己彰显出来，风必摧之，必然要受到损害的。</span></p><p><span></span></p><p><span>《道德经》讲：“物壮则老。”当一个物或万事万物，到达了最壮、最鼎盛的时期，就会开始衰败。人也是一样的，为什么会出风头，就是刻意而为之，太出风头的时候，一定会招到损害，就会出现很多的障碍、阻挠、烦恼。所以无为而治，看似云淡风轻，实则非常得绝妙，自然而然的不着任何痕迹地，把事情做完了，别人还以为事情本来就该是这个样子。</span></p><p><span></span></p><p><span>再举一个例子，让大家理解什么叫自然而然？虽看似是自然而然，一切却在谋划之中，比如，众所周知的《三国演义》其中的一件事情，诸葛亮善用计谋，赤壁之战，曹操兵败以后，派关羽去守华容道，诸葛亮心里很清楚，关羽是重情义之人，他一定会放走曹操的，在这种情况下，他依然三令五申，让关羽立了军令状，说不让你去，为什么？</span></p><p><span></span></p><p><span>因为诸葛亮看得清清楚楚，关羽必然是要放走曹操的，就是因为要让他放走曹操，在那个局面下，如果曹操死掉了，刘备是没有立足之地的，马上就会被东吴灭掉，形成不了三足鼎立之势。</span></p><p><span></span></p><p><span>这是诸葛亮心中的谋划，他了然于胸，依然让关羽守华容道，回来以后依然要按军令状处置，所有的人都替关羽求情，最后放他一马，这个就是自然而然。他只不过是用了人性本来的特点，每个人所擅长的不同，性情的不同，从中去谋划，我们看他做了什么事情吗？好像也没有，显现的本来就是，该显现的性情当中的样子，说他没有谋划吗？谋划了的，正是利用了，善用人之道</span></p><p><span></span></p><p><span>我们再看刘邦讲的这段话，运筹帷幄之中，绝胜千里之外，这是张良本身所具备的；带领百万之军，攻必胜，这是韩信的本事；安抚人民，安定国家运粮草，这本身就是萧何的能力。刘邦只是知人善用，看似好像做了很多事情，实则并没有刻意而为。</span></p><p><span></span></p><p><span>我们在生活或企业当中是一样的，看到了每个人性格当中的优点和缺点，在这个基础之上，去用就好了，看似好像什么都没做，不着任何痕迹，但是一切又都在自己的谋划之中，这就是《素书》的妙。</span></p><p><span></span></p><p><span>妙就妙在看似是不着任何痕迹的，看似是淡然处之的，但是一切都在心中，是很妙的。比如说，我们做一件事情，做一个生意，依然如此，在别人看来，我们好像什么都没做，不着任何痕迹，但是一切都在我们的规划之中，并且懂得时时把自己退到后面去，别人看到的是出现的结果。怎么会做成了这样，可能是运气好，可能是福报大，可能只是他下面的人，努力而已，但看不到背后的东西，这就是妙用。</span></p><p><span></span></p><p><span>当我们懂得了道的运行规律，知道人人都要去遵守的时候，按照道的规律，去使万事万物，做成之后，万事万物也不知其所由，不知道为什么就成了这个结果，以为本来就应该是这个样子的，很妙，别人也看不到，而且自己不需要出头，不需要去彰显，这个就是天地之道，所教给我们的。</span><span>学道家的境界，看似都是风轻云淡的，看似什么都没有做，不着任何痕迹，其实后面是有谋划的。</span></p><p><span></span></p><p><span>开篇所讲的故事，黄石公在下邳桥上等张良，难道不是他自己谋划之中的吗？张良是一个什么样的人？什么样的后人？他具备什么样的品性？到这里他要如何去试探，试探以后，要教给他《素书》，告诉他下一步怎么做，一切都在谋划之中，这是道的妙用。</span></p></div>"
},{
    "title": "《素书》第三讲 各得其所欲",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三讲 各得其所欲</strong></span></p><p><span><strong></strong></span></p><p><span><strong>德者，人之所得，</strong>人之所得是什么意思？德是道的妙用，也是道的一种体现形式，是人人都要得到的，是人人都要具备的，如果没有这个德，做事情不会长久。自古以来这些大德都是利益了世人，利益了百姓，利益了万物的，所以我们才称这样的人为大德。  </span></p><p><span></span></p><p><span>为什么用了这样几个词？因为所用的词不一样，道家叫利益万物，儒家说要利益世人，这个概念是一样的，德是人人所必须要有的，只要有了这个德，我们才能更长久。</span></p><p><span></span></p><p><span>所以说:<strong>“故大德者，必得其位，必得其名，必得其禄，必得其寿”，使万物各得其所欲。</strong>这个地方一定要注意，不是满足自己的私欲，千万不要理解偏。</span></p><p><span></span></p><p><span>如果还有自己的私欲，绝不能称之为大德之人，使万事万物各得其所欲，这个欲是需求，当一个人有大的德行的时候，是满足了万事万物的需求，绝不是自己的私欲，这个地方一定要清楚。当一个人有德行的时候，是不是开始滋养万事万物，开始利益万事万物了。</span></p><p><span></span></p><p><span>我们来讲大地，厚德载物，大地的德行厚重，承载万物，滋养万物。</span><span>使万事万物各得其所欲？他承载万物的时候，不会对万物有任何的区分和区别，树长在了什么地方？花花草草长在了什么地方？我们的房子盖在了什么地方？我们的农田生长在了哪里？大地是提供所能提供的土壤，所能滋养的，所能承载的，他只是静静的在那里，去承载和滋润而已。</span></p><p><span></span></p><p><span>我们常听到《道德经》的两句话：“天地不仁，以万物为刍狗”，“圣人不仁，以百姓为刍狗”。这个刍狗就是以前古代祭祀，所扎成的草狗，天地对人是没有偏私的，他对万事万物都是一样的。</span></p><p><span></span></p><p><span>圣人不仁以百姓为刍狗，圣人讲的是大的仁爱，他对所有的百姓都是一视同仁的，才能满足万事万物之所需，没有分别和偏差对待，这个才能称为大德。</span></p><p><span></span></p><p><span>张良为何要去辅佐刘邦？因为刘邦可以利益更多的百姓，据《汉书》记载，刘邦是魏晋之后，为何成为魏晋之后呢？他祖上是魏国人，是晋国大夫之后，到了刘邦这一代，已然是农民出身了，所以他更知人间疾苦，张良才会辅佐刘邦。</span></p><p><span></span></p><p><span>我们再来看一个现象，自古以来修道之人，我们看看他辅佐的都是什么人？都是有德行的人。比如，诸葛亮辅佐刘备。德是道的外用部分，有德行的人，他也自然就是合了道的人。</span><span>自古以来修道之人，都懂得道的运行规律，他绝不会因为远近亲疏，并不是因为与刘邦的私交更好，所以就会帮助他，不是这个样子。</span></p><p><span></span></p><p><span>道家的人都具备这样的风骨，他没有远近或者亲疏，或者我更喜欢这个人，不是这样考虑的，他是使万物各得其所欲，是从万事万物，或者说从百姓的需求角度出发，选择一个什么样的人，对黎明百姓会更好，这是修道之人的风骨，我们就能看出来，德的重要性。</span></p><p><span></span></p><p><span>如果我们没有那么大的德行，这个时候的仁和爱，是不是就是偏私的？我只对某一个人好，那不叫仁，那叫偏爱，我只去爱某一个人，那个不叫爱，是叫宠溺。</span><span>把这个德行再往大，不断地去延伸的时候，我们是在利益更多的人，这个时候才能称为大德之人。</span></p><p><span></span></p><p><span>自古那些大德的例子，是不是他利益了很多的黎民百姓，利益了很多的世人，甚至还在利益百年以后的人，千年以后的人，所以我们称这样的人为圣贤，为大德之人。</span></p><p><span></span></p><p><span>那我们往小了讲，往生活当中讲，也是一样的，我们有多大的德行，才有能力，才有智慧去利益多少人，同时能利益多少人，他反过来，又不断地滋养我们自己的德行。</span></p><p><span></span></p><p><span>《大学》讲：“明德，亲民，止于至善”。我们不断的明明德，自己的德行在不断地扩展，在不断地增加，我们去亲民，帮助更多的人，帮助了更多的人，他又回过来明自己的德行，是反复应用的。</span></p><p><span></span></p><p><span>德者，人之所得，人都是要得到这个德的，当有了这个德，才能使万物各得其所欲。有了这个德，自己也就更合了道，当合了道，也就有更大的智慧和更大的德行，使万事万物，使更多的人，各得其所欲。</span></p><p><span><strong></strong></span></p><p><span><strong>仁者，人之所亲，有慈惠恻隐之心，以遂其生成。</strong>仁者，人之所亲，仁是人人都要亲近的，我们要亲近仁，也就是说人人是要具备仁的。《弟子规》里面讲：“泛爱众，而亲仁”。《中庸》里面告诉我们：“仁者，人也，亲亲为大”。</span></p><p><span></span></p><p><span>都在告诉我们亲仁，所以我们把这句话简单地理解，仁者，人之所亲，就是亲仁，人人都要去亲近仁，我们要去做一个有仁徳的人，有仁爱之心的人。</span></p><p><span></span></p><p><span>有慈惠恻隐之心，我们先讲什么叫恻隐之心？看到别人可怜，同情怜悯他，这个就是一种仁心。惠，恩惠，慈惠，不光要同情他人，是给人恩惠，要给予他人的，什么叫仁爱之心？是看到别人可怜，不光要同情他，还要慈惠于他，要去给予和帮助他人，这是我们每个人都要追求的仁爱之心。</span></p><p><span></span></p><p><span>以遂其生成。只有这样去做的时候才能去生成，生成什么？生成人或者生成事，或者生成万物都是一样的。</span><span>举例来说明，我们看到一个人可怜，同情他，生了恻隐之心，我们慈惠于他，去给予他，去帮助他，这个时候就生成了，是不是又利人，又利己。利己的部分是不是成仁了，我们不停地帮助他人，以增长自己的仁心，以增长自己的仁德，这是利已。利人的部分，我们在帮助他，是不是就在利他了。</span></p><p><span></span></p><p><span>我们在做一件事情，也是一样的。当我们在做一件事情的时候，通过我们有仁德，有仁爱之心，把这件事情做成以后，是不是又利了那件事情，又利益了做这件事情的人，以遂其生成，我们的仁爱之心，恻隐之心，慈惠，给予，用在哪里，就会生成什么事情。</span></p><p><span></span></p><p><span>我们延伸来讲，是包含了人，事，物乃至万事万物的，就看我们这个仁，用在了什么地方，我们的给予，慈惠用在了什么地方，恻隐之心用在了什么地方？</span></p><p><span></span></p><p><span>比如，我们学这部《素书》，张良辅助刘邦得了天下，是不是他也在慈惠天下，对天下百姓生出了恻隐之心，希望辅佐汉高祖刘邦来定国安邦，让百姓安居乐业。</span></p><p><span></span></p><p><span>我们学了《素书》，通过生意去帮助了更多的人，我们生成的就是人和事情，被帮助的那些人和做成的这件事情。</span><span>那有的人学了《素书》，他要救人慧命，帮助了觉醒的那些人，同时也不断地增长了自己的仁。</span></p><p><span></span></p><p><span>我们再来回看这句话，仁者，人之所亲，我们每个人都要不断地去修身，不断地修正自己，让自己去合于这个仁，是人人都需要亲近的，亲近了仁，也就合了道。</span></p><p><span></span></p><p><span>道，德，仁，义，礼，五者一体也，道是那个本体，德，仁，义，礼都是妙用，所以我们去修自己的德，去修自己的仁，修自己的义，修自己的礼，都是在接近道，都是在按道行事。</span></p></div>"
},{
    "title": "《素书》第四讲 赏罚立功事",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第四讲 赏罚立功事</strong></span></p><p><span><strong></strong></span></p><p><span><strong>义者，人之所宜，赏善罚恶，以立功立事。</strong>义者，人之所宜，什么叫宜？适宜。道者，人之所蹈，人人都要遵循的，蹈是动词。德者人之所得，每个人都要去得到的，都要去修的就是德行的德，得道的得也是动词。仁者，人之所亲，人人都要亲近仁，仁德的仁，人人都要有仁爱之心，亲也是动词。</span></p><p><span><strong></strong></span></p><p><span><strong>礼者，人之所履，</strong>礼是都要去做的一种行为，履也是动词。义者，人之所宜，适宜，它是一个形容词，但是要做适宜的事情，是动词。我们要去做适当的，适度的，合于义的，那个事情。  </span></p><p><span></span></p><p><span>道、德、仁、义、礼，告诉我们都是相同的，前面告诉我们道是什么？德是什么？仁是什么？义是什么？后面告诉我们要如何去做，这个时候我们再来讲义，那我们做什么样的事情才是适度的，才是合适的呢？</span></p><p><span></span></p><p><span>义，首先他一定是正的，所以我们通常都讲正义，如果不是正的事情不能称为义。举个例子，有个朋友想去偷电动车，让我们去帮他把风。我去了，我能说我做的是合适的事情吗？</span></p><p><span></span></p><p><span>我们去如何帮助更多的人，服务好我们的客户，做对他人有益的事情，这个才叫义。如果我们在一起研究的，都是如何欺骗和欺诈他人的钱财，这个就是不合时宜的事情，这样的行为，我们都不能去做的。所以我们一定要懂得去分辨，懂得去分别，什么是合时宜的？什么是不合时宜的？</span></p><p><span></span></p><p><span>义，又有大义，又有小义。我们通常讲ー个人有大仁大义，当为国为民的时候这是大仁大义。当我们为一个团队去做事情，这是一个义。当我们去帮助他人做事情，这是一个义。</span></p><p><span></span></p><p><span>自古以来，我们民族的文化，都推崇的是舍身取义，是不是牺牲精神，舍掉自己的身？义的核心就是这个牺牲精神。如果人人都是有牺牲精神的，这个团队的战斗力就很强，这个团队做事情就很容易成功。</span></p><p><span></span></p><p><span>一个军队是不是如此，如果人人都有牺牲精神，军队的战斗力就很强，而这种牺牲精神来自于义。我要保卫祖国和人民的财产和生命的安全，当有了这种义，才能激发出这种牺牲的精神，当有了这种牺牲精神，可以以少胜多，以弱胜强的，如果没有这种牺牲精神，人人就会退缩，遇到困难，遇到险阻的时候，人人开始望而却步，这个时候是没有战斗力的。</span></p><p><span></span></p><p><span>义，又是一种担当的精神，人有这种牺牲精神的时候，才会去担当。如果人没有这种牺牲的精神，是不愿意担当的，遇到事情是喜欢退缩的，让别人去做就好了。当我们这种义在的时候，开始有担当的精神，当我们有担当又有牺牲精神的时候，无论我们去做任何事情，都特别容易感动他人。他人随着我们的影响，而变得也有担当和牺牲精神。</span></p><p><span></span></p><p><span>《大学》讲：“未有上好仁，而下不好义者也，未有好义，其事不终者也”。在一个团队当中，处上位的人，如果是好仁的，处下位的人就好义，未有好义，其事不终者也。</span></p><p><span></span></p><p><span>当所有人都是好义的，所有人都有这种牺牲的精神，做什么事情都是可以做成的。回忆我们自己的人生，当我们年轻的时候，血气方刚，是不是总有那种冲动？我什么都不图，我可以牺牲时间，牺牲我的体力，牺牲我的喜好，牺牲我所有的外在的和内在的东西。</span></p><p><span></span></p><p><span>但是随着年龄的增长，我们很多东西被欲望蒙蔽住了，义字消失了，做什么事情都开始计较得失，开始不愿意付出和担当，做事情反而做不好了。</span></p><p><span></span></p><p><span>通常义是如何组词的？</span><span>道义、忠义、情义、恩义、侠义、孝义、道义，如果道是有牺牲精神的，这个时候就是道义。我们做的事情都是合道的，为了道，我们可以牺牲很多东西的。情义，我们为了这个情，是可以牺牲掉很多东西的，这个情包含了很多。</span></p><p><span></span></p><p><span>比</span><span>如，男女的感情，我们称为爱情，亲情、友情、师徒之情，当情很深厚的时候，是不是为了这个情，我们愿意去付出，愿意去牺牲，愿意去努力，愿意去担当？</span></p><p><span></span></p><p><span>忠义也是一样的，首先我们要有忠，才有义，为了忠这件事情，我们可以牺牲自己的，我们可以勇于地担当。</span><span>义这个时候变成了形容词，得先有道，才能合于道义。得心中有忠，才能合于忠义。得心中有情，才能合于情义。我们得心中有仁，才能去讲仁义。如果一个人的心中没有仁爱的，又何谈去做适宜的事情？</span></p><p><span><strong></strong></span></p><p><span><strong>义者，人之所宜，</strong>我们所要做的事情是要合时宜的，这个合时宜有一个前提，他就是符合义的，符合正的，是有牺牲精神的，是有担当的。</span><span>道家自古以来讲除魔卫道，当我们去做除魔卫道的事情，自然是要有牺牲的，要牺牲掉自己的安逸，甚至要舍掉自己的生命。</span></p><p><span></span></p><p><span>自古儒家，道家，为了传法布道不是在牺牲吗？可能要牺牲了自己的名声，要被世俗的眼光辱骂的，因为世俗看不懂，修行之人一定要义字当头，这个义是一个人的风骨。 </span></p><p><span></span></p><p><span>如果用人来做比喻，这个义就好比是一个人的骨头，如果没有骨头，人是站不住的，有了义这个风骨，一个人才会有担当，当有了这种担当，才会去感动这个世界。 </span></p><p><span></span></p><p><span>比如，我们看电视或者读书或者看历史，什么样的环节可以打动人？就是人人都在舍身取义的时候，人人都有着奉献精神的时候，这个时候我们特别容易被感动到，因为这个义，本身就是天之道。</span></p><p><span></span></p><p><span>比如，古代的君王，当他有仁有义的时候，会爱民如子，是可以感动人的。自古以来，传法布道之人，就是因为心中守着道义，守着传承，他勇于去牺牲自己，面对所有的困难是可以感动人的，我们祖国的烈士也是如此，遇到困难的时候，先烈们英勇的冲在前方的时候，是可以感动我们后辈的。 </span></p><p><span></span></p><p><span>在我们这个时代也是一样的，遇到洪水、火灾，疫情，种种自然灾害的时候，总有那些有义的人，冲在前面去担当，而这些义可以深深地感动着，我们中华的每一个儿女，我们经常讲到一个词，叫义不容辞，这件事情是不允许我后退的，是不允许我推辞的。 <span>为什么？义字当头，义者，人之所宜。</span></span></p><p><span></span></p><p><span><strong>赏善罚恶，以立功立事。</strong>所以人要去做的事情，都是合时宜的，符合义的，这个时候开始赏善罚恶。</span><span>《素书》是告诉我们妙用的，这个时候又提出一个方法，要赏善罚恶。</span></p><p><span></span></p><p><span>在教化人的时候，讲的是隐恶扬善，把他的恶隐起来就好了，但是做事情的时候，绝不能心慈手软，赏善罚恶。这里的善，指的是做合于义的事情，恶就是不合于义的事情，当做的是不合于义的事情，一定要罚的。</span></p><p><span></span></p><p><span>我们去看历史也是一样的，当双方的军队在打仗的时候，什么叫不合义？做逃兵，想要后退，这个时候是不能手软的，带兵打仗之时，会说后退者斩，如果允许一个人后退，所有的人都将后退。 </span></p><p><span></span></p><p><span>在一个团队当中，是不是一样的？如果大部分的人，都有这种担当和牺牲的精神，而其中个别人没有，这个时候必须要罚的，甚至可以把这个人辞退，因为如果他做的是不合义的事情，他会让更多的人，变得和他一个样子，这个团队很容易就瓦解掉了。</span></p><p><span></span></p><p><span>尤其注意的是什么？一个人心中没有义，却能言善辩，这样的人太可怕了。告诉我们赏善罚恶，有担当精神的人，有牺牲的精神的人，一定是要赏的，一定是要鼓励的。</span></p><p><span></span></p><p><span>道家告诉我们，其他的事情都可以包容，但是没有义字是不行的。如果用儒家的话，就是当仁不让，就是该我去做的事情，必须要挺身而出的。如果这个世界没有了这种担当和牺牲的精神，将会缺乏美好和感动，我们文化的魂就没有了。 </span></p><p><span></span></p><p><span>以立功立事。我们讲了这么多什么是义，这个时候我们再来思考，当一个团队有仁、有义、有担当、有牺牲的精神，立功立事，是非常容易的事情。大家都是讲义气的，立功，把事情做好就容易了；立事，把这个事情做成也太容易了。</span></p><p><span></span></p><p><span>举一个生活当中的案例，我们去思考其中的核心是什么？比如，很多朋友在刚开始创业的时候，很容易把事情做上一个台阶的，因为刚开始大家没有所图，都不计较得失，所以每个人都愿意去牺牲更多，完成一件事情，整体会做得很好。可是做了一段时间，开始走下坡路了，为什么？这种牺牲精神没有了，大家都去追求利益了，事情变得越做越不好。 </span></p><p><span></span></p><p><span>我们再去看一个朝代,是不是一样的，建国初期,很容易就能打赢天下。因为这个时候上下ー心，上好仁，下好义，未有其事不终者也，大家都有这种担当和牺牲的精神，都想改变一个时代的命运，都想去推翻前朝的暴政，事情会做得很好。但是新朝代开始以后，不断地腐化，人们开始不愿意去担当，开始贪图安逸，没有了这种牺牲的精神，又逐渐地走向没落！</span></p><p><span></span></p><p><span>很多人会说，我也想要很多的正义之士，我也想要很多，有牺牲精神的人，很简单，我们自己得好仁，自己得是一个讲仁德的人，上好仁而下好义，当自己去讲仁德的时候，下面团队的人，自然就会对我们讲义气。</span></p><p><span></span></p><p><span>所以仁义仁义，先有仁后有义，在一个团队当中，培养仁义，非常得重要，当人人都勇于去担当，有这种牺牲精神的时候，我们这个团队是可以其力断金的。</span></p></div>"
},{
    "title": "《素书》第五讲 成人伦之序",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第五讲 成人伦之序</strong></span></p><p><span><strong></strong></span></p><p><span><strong>礼者，人之所履，夙兴夜寐，以成人伦之序。</strong>礼是一个人的外衣，我们出门一定要穿上衣服的，但是什么场合穿什么衣服呢？什么叫礼？礼是一种行为标准，一种行为规范。</span></p><p><span></span></p><p><span>夙兴夜寐，早起晚睡，形容一个人的勤奋，每天要晚睡并且早起的。以成人伦之序，礼是人人需要遵循的，用来做什么？以维护人和人之间的顺序。 </span></p><p><span></span></p><p><span>举例，礼该如何去用？一个好的服务行业，会把礼变成一种行为标准和行为规范，见人微笑，谦逊有礼，懂得和人去打招呼，懂得从内心去尊敬每一个人，当我们把它变成一种行为规范的时候，是礼之用。 </span></p><p><span></span></p><p><span>《论语》讲：“礼之用，和为贵”，什么叫和？达到大家都舒服的状态，谓之和。比如说，我们去一个地方购物，去一个地方吃饭，如果这个地方给我们的感受是舒服的，人人所表现出来的是有礼的，他的生意自然也就会变好。</span></p><p><span></span></p><p><span>我们在一个团队，在一个企业当中，也是同样的道理，当客户来到我们的公司，来到我们的企业当中，如果他人觉得是舒服的，人人都是很有礼貌的，人人的行为都是规范的，他人对这个地方，就会产生良好的印象，这个就是和。 </span></p><p><span></span></p><p><span>整个《素书》告诉我们，道、德、仁、义、礼，五者一体也。道是本体，德、仁、义、礼，都是妙用，都是如何去用，我们只有用好这些，才能更好地去做事情。</span></p><p><span></span></p><p><span>为什么要把礼放到最后一个？一个人有德行，内心有仁爱之心，有义气，是有奉献精神的，是有担当的，这个时候礼是最外在的东西。礼虽然是外用的，但是他的根本在于内在，如果内在是没有仁义的，如果内在是不懂得真正尊敬他人的，所表现出来的礼，就是不真诚的，别人清清楚楚地可以感受到。</span></p><p><span></span></p><p><span>一个优秀的服务行业，每个人不仅是把礼变成了一种行为规范，从内在是尊敬每一位顾客的，表现出来的行为，看着才是舒服的，才是自然的。</span></p><p><span>我们再提升一种境界来讲，何为礼？礼是一种思想教育。比如说，我们教人谦卑，谦卑是不是一种思想，当我们有了谦卑的思想，表现出来就是谦虚有礼的。</span></p><p><span></span></p><p><span>比如，我们的思想教育，告诉我们要懂得宽爱他人，要懂得包容他人，这个时候是不是思想教育？当我们有了这样的思想，产生的行为，就懂得去包容他人，别人感受到的就是非常得舒服。这个人不但有能力，而且谦逊有礼，对人很宽厚，给人感觉是非常舒服的状态。这个礼一定是高于普通人的标准，才能体现一个人内在的修养。</span></p><p><span></span></p><p><span>举个例子，什么叫基本的规范？什么叫礼之用和为贵？如何体现出他的不同和修养？比如，我们去一个地方吃饭，当我们到这个地方吃饭，我们付钱结账，这都是正常的，如果我们去吃饭，对待这里的服务人员，或对待这里的人，是谦逊有礼的，就比普通人修养更高一层，他虽然是一个服务人员，虽然到这里，我是花钱消费的，但是我内心有仁爱，对每个人都是谦逊有礼的，别人反馈给我们的也是谦逊有礼的。 </span></p><p><span></span></p><p><span>再举个例子，我们开车走在路上，前面有一个车，挡住了我们的去路，我们让对方把车挪动一下，他把车挪动让开路，这是最基本的规范。再上升一个境界，如何体现一个人的修养，对方微笑着对我们讲：“非常抱歉，实在不好意思，挡住了您的去路，我马上把车挪走。”这个时候我们感觉到的，是不是很舒服的？ </span></p><p><span></span></p><p><span>我们就会说，对方是一个很有修养的人。这就是礼的妙用，作为一个修行之人，或者作为一个想立功立事之人，礼是必不可少的，礼是体现一个人的思想教育和自身修养的。</span></p><p><span></span></p><p><span>所以礼是维护人和人之间的秩序，达到和谐的效果，妙用的方法。我们说一个人做事情都是合道的，是有德行的，内心是有仁爱的，又有担当和奉献精神的，如果再加上谦逊有礼，我们会讲这个人的修为很高，这个人很有素养，我们都愿意和这样的君子打交道。</span></p><p><span></span></p><p><span>礼是外在的表现形式，内在的根在于道、 德、仁、义 ，当我们内在有了这个根，很多礼的方法，是不需要学的。比如，我们懂得尊敬一个人的时候，礼自然而然就出来了。我们对待一个人微笑，友善的眼神，谦卑的行为，对方都可以感受得到。</span></p><p><span></span></p><p><span>我们要想把礼用好，更重要的是，提升自己内在的仁义，注重我们的思想教育，当我们的思想教育，当内在的根在逐渐地发生变化，外在的礼，自然而然的就体现出来了。 </span></p><p><span></span></p><p><span>再举一个生活中的例子，我们可以更好地区分，什么样的属于正常的行为规范？什么样的属于升华的礼之用？比如，我们去参加婚礼，正常的行为规范是，我去参加婚礼，去吃饭，吃完饭离开，这个叫随礼，就是正常的基本的行为规范。</span></p><p><span></span></p><p><span>怎么才能体现出来礼之用？我们不仅去吃饭，诚心诚意地去祝福对方，而且我们早去晚归，诚心想着帮人家再做点什么事情，这个地方是真心地为对方高兴，并且是付出的，义就在其中了。我们真心地希望，来参加婚礼的每个人，都可以高兴而来，高兴而去，我们去帮他们做点什么，让婚礼可以进行的得更好，仁爱他人的心，就出来了。 </span></p><p><span></span></p><p><span>比如，在一个企业当中也是同样的，每天早八点开始打卡工作，晚五点开始下班，这是正常的行为规范。除了这些，我们要注重员工的思想教育，我们要友爱他人，包容同事，我们要懂得服务客户，要导人向上向善，这都是思想教育的部分。 </span></p><p><span></span></p><p><span>我们在一个团队当中，更应该提倡的就是这种思想教育，才能让团队当中的所有人去升华，当大家懂得这样用礼的时候，整个团队就是和谐的，就是有内涵的，我们不断地建立，每一个人内在的仁爱之心，内在的担当和奉献精神，内有仁义，外在的表现形式是谦逊有礼的，我们的团队就是有力量的，是可以感动他人的，是和谐的。 </span></p><p><span></span></p><p><span>当我们有仁义，在其中的时候，整个礼就开始升华了，也正是体现个人修养的时候，所以我们要想用好这个礼，一定是超过正常基础的行为规范，这个时候才叫礼之用和为贵。</span></p><p><span></span></p><p><span>如果只是正常的行为规范，体会不到礼的妙处，也体会不到礼的妙用，如此便可成人伦之序，去维护人和人之间的秩序，促进一个团队的和谐。往大了讲，促进一个社会国家和时代的和谐，当我们不断地去培养思想教育，每个人都是谦逊有礼的，都是懂得恭敬他人的，我们管理起来也毫不费力，因为每个人都是有修养的。 </span></p><p><span><strong></strong></span></p><p><span><strong>夫欲为人之本，不可无一焉。</strong>夫是助词，欲为人之本，不可无一焉，想要成人之本一样不可缺少，那我们看看何为人之本？安身立命是每一个人，为人的根本。我们再往上讲，不光是安身立命，在往上就是贤人君子，在往上就是圣人。</span></p><p><span></span></p><p><span>道、德、仁、义、礼，是每个人的为人之根本，无论我们处在哪个阶层，想要安身立命，这也是为人之本，想要做一个贤人君子，这也是为人之根本，想去做一个圣人，这也是人之根本。</span></p><p><span></span></p><p><span>这个根本，取决于我们自己修为的程度，这五点我们做得越高，我们修行得越好，按照这个方式去修行，修行的高度就决定了立身之本。比如，我们把礼、仁、义、道、德，用了一小部分，那我们安身立命是没有问题的，想去做一个贤人君子，就要更加严格地要求自己。 </span></p><p><span></span></p><p><span>按照道、德、仁、义、礼，去严格地修正我们自己，克己，如果我们想去做一个圣贤之人，做一个圣人，这五点是要做到极致的，是要心怀天下苍生的。所以告诉我们这些是立足之根本，一个都不可以缺少，当我们有了这个立足之根本，为人之根本，才能妙用。 </span></p><p><span></span></p><p><span>黄石公在传《素书》给张良的时候，就在讲要以修身为本，最原始最根本的就是这五个字，道、德、仁、义、礼，把这五个字修好的时候，我们就可以妙用了。可是我们很多人不懂得这个道理，不停地向外寻求方法。 </span></p><p><span></span></p><p><span>如何才能让他人变得更有礼？如何让我的团队变得更有仁，更有义？为人之根本已经告诉给我们了，我们自己按照这个标准和要求，去修正自己的时候，就可以无为而治，影响身边的人，自然也就变成了这个样子。 </span></p><p><span></span></p><p><span>举个例子，我们自己没有去修身，而要求他人：“要内心有仁爱，要有义气，要懂得奉献和担当，要有德行，要去承载和包容万物”，我们自己都没有做到的时候，我们要求他人，他人又如何做得到呢？</span></p><p><span></span></p><p><span>我们再去看古代的谋士和一个圣贤的君王，如果他自己是昏庸无道的，自己是贪婪无度的，他去要求他的大臣，要求他的部下去守仁、义、道、德，这可行吗？是不是时间长了，下面的人就开始起义了？只因为位置在上，他无可奈何而已，但是时间久了，必出问题，他的内心是不臣服的，所以君子有絜矩之道，上行下效的。</span></p><p><span></span></p><p><span>作为一个谋士也是一样的，自己的行为要正，自己要博览群书，上知天文，下知地理，这时下面的武将，部将，才会心悦诚服，说的话才有威信，否则威信从何而来？所以我们能用到什么程度，取决于我们自身修为到了什么程度。 </span></p><p><span></span></p><p><span>比如，每个人在用礼的时候，如果自己内在是没有道德仁义的，表现出来那个礼就是假的，别人清清楚楚得可以感受的到，这个时候人们会说，不对！这礼也不好用，为何不好用，是我们自己的根本，没有修好，没有立住，礼又如何好用呢？</span><span>所以用的程度，取决于我们自己修为的高度，我们自己本身修得越好，用起来就越妙。</span></p></div>"
},{
    "title": "《素书》第六讲 抱道待其时",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第六讲 抱道待其时</strong></span></p><p><span><strong></strong></span></p><p><span><strong>贤人君子，明于盛衰之道，通乎成败之数；</strong>明于盛衰之道，如何明？如果我们自己懂得修身，懂得 道、德、仁、义、礼，我们看一件事情的盛或者衰，是不是一目了然？</span></p><p><span></span></p><p><span>我们去看这里每一个人的行为，是不是合道的，有没有德行，内心有没有仁爱，是不是有义气的，大家有没有担当和奉献精神，他们表现出来的有没有礼，只要一对照，就知道这个团队的盛或者衰了。</span></p><p><span></span></p><p><span>古之智者，高人志士，不是谁请都出山的，是不是他要遇到合适的人，贤明的君主，才会出山相助，怎么知道他是否贤德？通过道，德，仁，义，礼，这五个字一目了然。</span></p><p><span></span></p><p><span>符合这几点的人，说明他自己是有道、有德、有仁、有义之人。如果不符合这几点，真正的高人智者，是不会辅佐于他的，因为他不合道，自然要走向衰败。</span></p><p><span></span></p><p><span>现在再去看一个团队，或者说看一个人，可以清清楚楚看得懂，如果我们自己是不断学习和修行之人，懂得了这几个字的妙用，到达了这个境界，再看某一个人的行为，就知道他未来的结果和走向。 </span></p><p><span></span></p><p><span>我们看一个团队，将来是盛是衰，一目了然，清清楚楚，因为万事都有迹可循，这个规律就是道。只不过，我们不知道，道的规律在讲什么？看不明白，不明达。当我们不断地修行，不断地修身的时候，自然会变得明达。当我们变得明达，看事情就很通透，盛衰之道，一目了然。</span></p><p><span></span></p><p><span>通乎成败之数，对于成或者败，是很通透的，看得很清楚。什么叫数？数就是关键点，当我们是一个明达通透之人，任何事情的成败，一眼就可以看到，其关键之所在，就可以告诉对方，要如何调整？ </span></p><p><span></span></p><p><span>古代的谋士军师，不光可以带兵打仗，运筹帷幄之中，决胜千里之外，他也懂得治国之道，因为可以看到每件事情成败的关键之所在。为什么？因为他懂得道的运行规律。</span></p><p><span> </span></p><p><span>举个开饭店的例子，这个案例最普遍，每个人都能理解，我们来体会，能看到关键点和不能看到关键点，区别在哪里？我们去了一个饭店，他的生意不好，看不到关键点的人就会说：“提前把空调开开，早开店门，多营业一段时间，地面太脏了，”这些都是表象。</span></p><p><span></span></p><p><span>能看到关键点的人，是如何看问题的？看看菜价如何？做菜的口味如何？老板做这件事情，他的心里是怎么想的？顾客来的时候，是不是谦逊有礼的？每一个人是不是微笑服务的？周边都住着什么样的人群？别人为什么要来这里吃饭？在这里开饭店能帮助到哪些人？如果内心不想着如何去服务好顾客，不想着提供给他们实惠，或者去满足他们那个口味，想的都是蝇头小利，能省则省，我们就看出来不同了。 </span></p><p><span></span></p><p><span>一个企业或一个团队，也是一样的。从老板到员工，每个人有没有担当精神，有没有奉献精神，企业文化里有没有利他的思想，老板自己本身有没有德行，所有的员工是不是懂得礼的，是不是互相包容友爱的，是不是向善向上的，这就是关键点。</span></p><p><span></span></p><p><span>当我们不断地去修身，掌握了道、德、仁、义、礼，就掌握了道的运行规律，当然只是道的一部分的运行规律，这一部分足以让我们通乎成败之数，每一件问题的关键点，可以看得清清楚楚。</span></p><p><span></span></p><p><span>比如，生活当中的朋友也是一样的，当自己本身是有修为的，对方讲了一番话，他就知道为何会如此了。我们在没有学习圣贤文化的时候，觉得他好像很高深，可是随着大家不断地修行，会发现其实一点都不高深，他无非是掌握了某种规律，看问题就清清楚楚的。</span></p><p><span><strong></strong></span></p><p><span><strong>审乎治乱之势，达乎去就之理。</strong>如果是一个贤人君子，已经有很高的修为了，就懂得审时度势了。</span><span>比如，古代的谋士亦是如此，有人请我出山，是不是要审时度势的，当下的现状是什么？未来的走势是什么？我从中可以做些什么？都包含了。我们去做任何事情都是一样的，当我们是一个贤人君子，不光是修为很高，智慧也已经很高了，看问题就会很通透。</span></p><p><span></span></p><p><span>我们去做一件事情之前，很了解自己的现状，很了解当下的局势，很了解未来的走向，在这个时代背景下，我们自己可以去做一些什么？智者做事情从来都是游刃有余，不急不躁的。因为一切都在自己的掌握之中，看得清清楚楚，有什么可急的呢，去就之理，就是明白要往哪里走，未来的走势，皆在自己的掌控之中。 </span></p><p><span><strong></strong></span></p><p><span><strong>故潜居抱道，以待其时。</strong>这句话可以体现道家的思想，潜，有隐的意思，我们说潜水是不是隐起来了，看不到自己，隐居起来，潜居起来，不只是潜，是要抱道，什么叫抱道？抱住道紧紧不放，我们自己在潜居之时，在做什么？在修道，在修自己的道、德、仁、义、礼，这叫潜居抱道。</span></p><p><span></span></p><p><span>以待其时，我们不停地修为自己的时候，等待时机。有的人说，道家无为，是不是什么都不做？不是的，无为是不刻意而为之，是潜居抱道的，时时刻刻地修正自己，当有合适的时机，就会出来，做匡复正道的事情，做除魔卫道的事情。 </span></p><p><span></span></p><p><span>《素书》的作者黄石公老人家，也是如此，他自己看到了当下的现状，人民在受苦，写了这样一部著作。但是他自己不想出来做事情，所以物色人选，是在审时度势，是潜居抱道的，等待合适的时机出现，寻找一个传人，以匡复正道。</span></p><p><span><strong></strong></span></p><p><span><strong>若时至而行，则能及人臣之位；</strong>当有时机来到的时候，则可位极人臣，就可以去除魔卫道了，如果我们自己平时不是潜居抱道的，即使时机来了，又能如何？</span></p><p><span></span></p><p><span>我们很多人，总是在感叹怀才不遇，因为内在的才，还是不够大，当我们自己真的有这样的德行的时候，合道的时候，天怎么会泯灭一个人才？自有天命所归！ </span></p><p><span></span></p><p><span>道家的风骨，自来都是这样的，我们自己要去修道，所有时势，要了然于心，一旦有合适时机的时候，只要出来，自然可以位极人臣，是因为自己确实有那个本领，是合于道的。</span></p><p><span><strong></strong></span></p><p><span><strong>得机而动，则能成绝代之功。</strong>一旦得到机会，得到机遇而去行动，就可以成绝代之功。绝代，是一个形容词，流芳百世，千古留名的人，大有人在，如果是一个贤人君子，自己不断地去抱道，自己内在有德、仁、义、礼，一旦时机、机遇来到的时候，就可以成绝代之功。</span></p><p><span></span></p><p><span>这两句话的关键字一个叫时，一个叫机，大的称为时，小的称为机，大的时势，小的机会，小的机遇，有一句话，叫生不逢时，如果出生在一个没有大的时势的这样一个时代，机遇会很难得。那怎么办？依然是潜居抱道。</span></p><p><span></span></p><p><span>如其不遇，没身而已。如果没有大的时势和小的机遇，怎么办？没身而已，这一生就淡然处之。这里又有一个关键点，淡然处之，淡泊名利不代表什么都不做，还是要潜心抱道，这才是一个修行之人该做的事情，时时刻刻都是让自己合于道的。</span></p><p><span></span></p><p><span>同样儒家的文化，也告诉给我们这样的道理。“人不知而不愠，不亦君子乎，遁时不见，知而不悔，唯圣者居之”，当自己潜心抱道，即使没有人知道我，我也不烦恼，也不后悔，这才是君子之风。我们当下遇到了，人生当中的挫折困难的时候，更应该是我们潜心抱道之时，所以不要抱怨、蹉跎、荒废自己的一生。</span></p><p><span></span></p><p><span>是以其道足高，而名重于后代。是因为贤人君子的其道足高，就是自己的修为很高，是合于道的，才能名重于后代，即使道家的很多高人，什么都没有做，他也是名重于后代的。</span></p><p><span></span></p><p><span>比如，黄石公老人家，自己并没有出去做什么事情，可是他自己的修为高，写了这样一部著作，找了一个传人，到今天我们依然受着黄石公，这位老人家的恩惠。当自己的修为到了，没有怀才不遇的，天不过因材而笃，栽者培之，倾者覆之，每个人都有自己的天命，但是我们可以领受多大的天命，取决于自己合了多少道，以及道的高度。</span></p><p><span></span></p><p><span>我们再来延伸一句，道是原始，也是道体，德、仁、义、礼是外用，这里指的其道足高，也就蕴含道、德、仁、义、礼都是一也，他本来是一不是二。甚至不仅包含这些仁、义、礼，还有信，还有善，太多太多，这些都是一也。</span></p><p><span></span></p><p><span>当我们自己是合道的，不断地修为自己的，这些外在的用，自然可以炉火纯青。如果自己本身是没有修为的，不能让自己的行为合于道，学习的方法也不妙，因为用起来不灵，是自己本身不合道。我们讲道、德、仁、义、礼，一也，如果没有道，后面的都不存在。我们做事情就是不择手段的，就是被贪欲所蒙蔽的。</span></p><p><span></span></p><p><span>为什么道家讲功成身退，天之道？道家的思想就是这样的，当出现乱世的时候，要潜心抱道，待时而动，等合适的时机而动，做成事情之后，就要功成身退了。</span></p><p><span></span></p><p><span> 为什么？因为抱道的思想是贯穿始终的，出来做事情不为名，不为利，只是为了匡复正道。匡复完正道以后，剩下的名利，实在不是修道之人，所追求的，自然开始功成身退，天之道，至始至终，都是抱道不离道的。</span></p></div>"
},{
    "title": "《素书》第七讲 正道章第二",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第七讲 正道章第二</strong></span></p><p><span></span></p><p><span>《素书》第一章告诉我们，原始章第—，原始，是最根本，最原始的状态，道、德、仁、义、礼 五者一体也，都是原始的状态，所能产生的境界和妙用。</span></p><p><span></span></p><p><span>接下来要告诉我们正道，何为正道？为人之道，为人的正道，是以道、德、仁、义、礼为前提的基础之上。</span></p><p><span></span></p><p><span>我们ー个人如何做是符合正道的，走正确的道路。这一章把优秀的人分为三种，第一种叫俊，人中之俊；第二种叫豪，人中之豪。第三种叫杰，人中之杰，杰出的人。这三种人都是非常优秀的人，我们要去做这三种人。正道篇是告诉我们，如何做人，如何识人。  </span></p><p><span></span></p><p><span>首先我们去做人中之俊杰，才能识人，懂得识人，才能用人。正道篇我们延伸一下，又蕴含了三个方面，第一方面告诉我们做人之本，做人之道；第二方面告诉我们识人之道，我们只有自己是这样的人，才会认识这样的人；第三方面我们只有认识这样的人，才会用人之道。  </span></p><p><span><strong></strong></span></p><p><span><strong>德足以怀远，</strong>告诉我们德是可以怀远的，这个远又包含着时间和空间两个概念。我们先讲时间，什么叫远？一个人有足够的德行，思维方式考虑的才会比较远。</span></p><p><span></span></p><p><span>举一个生活当中的例子，比如，我们教育孩子，有的人说孩子一定要拼命地努力学习，要考上一个好的大学，这是一种思维方式。还有另外一种思维方式，如何怀远？</span></p><p><span></span></p><p><span>有的人懂得，人这一生不只有考大学，这一件事情，我们还要从小教给孩子友爱，包容，懂得如何让自己快乐，遇到问题的时候，懂得如何让自己坚强，这样的家长思考问题是不是就更怀远？</span></p><p><span></span></p><p><span>我们不只是让孩子学习好，考上大学，考上大学后，他的人生从社会的意义上来讲，只是刚刚开始，绝不意味着结束了，绝不意味着考上大学，这一生就这样了。</span><span>或者说考上了大学，这个孩子将来一定可以过得快乐，未必的。当我们的思维是怀远的，我们当下的行为方式，思维方式，行为习惯，都会变得不同。</span></p><p><span></span></p><p><span>比如，我们做事情也是一样的，有的人做企业想做一百年，想做二十年，想做三十年。而有的人做一个生意，只是为了暂时可以赚到钱，只是在考虑当下的利益和得失。所怀的远不一样，就决定了当下的思维不同，当下的行为不同。怀远是可以不断地增加我们的德行的，相互作用，我们有了德行，才可以更好地去怀远，同时我们在不断地怀远，可以增加我们自己的德行。</span></p><p><span></span></p><p><span>比如，我们要想把这个事情做得更长久，我们怀远的时候，就要思考如何利益更多的人，如何帮助更多的人，只有帮助更多的人，才会走得更远，这个怀远是需要我们有足够的德行的，当我们有了足够的德行，就会去思考，如何培养更多的人才，如何培养更多的人，去利益更多的人，去帮助更多的人，才能走得远。</span></p><p><span></span></p><p><span>我们的德行怀远的同时，又回来巩固当下的思维和行为习惯。无德的人，没有德行的人，考虑的都是当下的得失，对错和是非，有了足够的德行，看到的不再是当下，而是后面要达到的方向和止，人生目标。为什么智者的当下都是淡定从容的？因为不在意当下的得失对错和是非，看的更远。</span><span>所以《论语》有言：“人无远虑，必有近忧。”</span></p><p><span></span></p><p><span>举个例子，我们做这个生意，只考虑一年可不可以赚到钱，到了明年的这个时候，就开始忧虑了，因为没有提前做规划，没有提前思考，没有怀远，一年后生意很难做得下去的。</span></p><p><span></span></p><p><span>而别人考虑的是三年，五年，甚至是十年，步步先机，每一步都在自己的规划之内，这个时候懂得怀远，根基才会扎得更深。如果我们只把它当做一年的生意，怎么会有那个仁德之心，去培养人才，怎么会想着让顾客，持续地受到我们的帮助，所以我们会发现没有德行的时候，是走不远的。</span></p><p><span></span></p><p><span>我们经常听到一句话：“不谋万世者，不足以谋一时；不谋全局者，不足以谋一域。”这都是在怀远，我们想把当下一时的事情做好，要谋万世的，这是一个形容词，我们怀的有多远，考虑的有多周全，当下的事情才能做的有多好，我们不再计较，当下的那点得失和利益，我们考虑的是更远的规划，我们想做的更长久，这是时间概念上的远。</span></p><p><span></span></p><p><span>我们再讲空间概念上的远，“近者悦，远者来，”如何才能让远方的人来到我们的身边，一定是近处的接触过我们的人，感觉是喜悦的，是愉悦的，是受益的，这个时候远者自来。</span></p><p><span></span></p><p><span>我们再举个例子，假设我们开一个饭店，饭店的生意，如何才能持续的变得更好，做的更长久？近者悦，接触过我们的人，来这里用过餐的人，都觉得这里是舒适的，价位是适中的，口味是不错的，远者知道了这些事情，自然就会来到我们这里，生意自然就会变好。</span></p><p><span></span></p><p><span>如果我们做生意，只是为了当下的利益得失，就会在意成本，能省则省，不会注重服务，不注重品质，不注重人才的培养，得不偿失的。如果我们在意当下的利益，必然要损害长久的利益，想要长久的利益，也会损害当下的利益。有德行的人，才不会计较当下的得与失，这时我们做事情才是更周全的。</span></p><p><span></span></p><p><span>我们才会以信为本，以服务和帮助好每一个需要我们的人，为我们自己的立身之本。当有这个立身之本，远方的人不停地来到我们的身边，来帮助我们做事情。</span></p><p><span></span></p><p><span>我们再来讲德，我们做的事情有多大，能利益多少人，说明我们有多大的德行，有多大的德行，远方的更有能力的人，更有德行的人，才会因为这件事情，因为我们的行为，来到我们身边，辅助我们做事情。</span></p><p><span></span></p><p><span>自古以来，道家的人是不是这样的？他去辅佐君王得天下，一定是去找最有德行的人，当有足够的德行，做的事情可以利益更多的人，优秀的人才就会奔着德行而来，否则事情是走不远的，也没有能力去感召更优秀的人，来到身边。</span></p><p><span></span></p><p><span>正道篇是教给我们做人、识人、用人的，只有让自己成为有德行的人，别人才可能来到身边，我们有足够的德行，才会识得这个人有没有德行，是否能为我所用，是否能和我们一起去利益和帮助更多的人，这时才懂得用这样的人。</span></p><p><span><strong></strong></span></p><p><span><strong>信足以ー异，</strong>一异，是统一不同的，统一思想、统一习惯、统一行为、统一信念。信足以一异，只有信服这种力量，才可以统一。</span><span>举个文化的例子，我们只有相信《素书》，才能统一我们的思想，我们学过《素书》的人，相信《素书》所讲的内容，这时我们的思想就是统一的，如何持守正道？要先有德行，要有足够的信，我们五者一也，要有道、德、仁、义、礼，这就是一种思想的统一。</span></p><p><span></span></p><p><span>比如，我们这些人都是学习儒家文化的，当我们都是相信儒家文化的，我们的思维和观念就是统一的。</span><span>在一个团队当中也是一样的，如果所有的人是相信团队领袖的，就可以统一不同的意见，统一不同的思维，统一不同的行为，统一不同的习惯，我们经常讲默契一个词，是从哪里来的？就是因为产生了统一。</span></p><p><span></span></p><p><span>我们讲了一件事情，这件事情要如何去做，如果他人跟我们思考的基本一样，或者完全信服，会照着去做，为什么会照着去做？为什么思考的差不多？因为平时学习的是统一的思维方式，就会产生同样的行为习惯，只有足够的相信，才可以统一所有的思维、行为、习惯 、认知、决策等等。</span></p><p><span></span></p><p><span>如果没有统一，团队是没有战斗力的。</span><span>自古以来，每个朝代的更替，建国之本都在一异，都在统一，统一军队的思想，统一大家的行为，统一奋斗的目标和方向，只有统一，才会产生力量。</span></p><p><span></span></p><p><span>我们说，儒家文化传承了两千五百多年，道家文化从老子开始传承了两千五百多年，如果再往上追溯，已传承了近五千年，这个时候他已经超越了时间的概念，是如何传承下来的呢？是因为所有学习道家文化的人，一定是有被统一的人，一定是有可以理解的人，当他理解了，就会去做传承，这就是一种统一，这种信，是可以穿越时间和空间的概念，达到统一的力量。</span></p><p><span></span></p><p><span>《论语》孔子讲：“述而不作，信而好古，窃比于我老彭。”孔子的学说和文化从哪里来的？信而好古来的。</span></p><p><span></span></p><p><span>《道德经》也同样讲信：“信不足焉，有不信焉。”讲了那么多道的规律，什么叫德？有的人信不足，有的人不信，信的人就会统一思想，统一行为。只有信，才可以让文化去传承，只有信，在一个团队当中，才能产生力量，可以排除所有的不同，而达到统一的结果。</span></p><p><span></span></p><p><span>我们来思考，如果团队的人都不信，我们要怎么办？不信我们，说明我们自己没有足够的德行，故而才不信。德足以怀远，信足以一异，别人凭什么信我们，只有自己是有德行的，自己是合道的，别人才可能信服，当有人产生信服的时候，就会形成统一。</span></p><p><span></span></p><p><span>比如，我们到一个新的团队当中，本来这个团队的人都是谦逊的，是有礼的，是博学的，是付出和担当的，新进来的人，很快就会变成和大家一样，因为被统一了，因为这里的思想和行为就是这样的。</span><span>所以我们首先要懂得，要想让别人信服，我们自己得有德行，让自己合于德，合于信，要学原始章的道，我们自己懂得道的规律。</span></p><p><span></span></p><p><span>如何做才是合道的？怎样才可以去帮助更多的人？如果我们是这样做事的，身边的人自然而然就被我们统一。信足以一异，不需要刻意的，我们只是做好自己，修自己的德行就可以了。</span></p></div>"
},{
    "title": "《素书》第八讲 人中之俊也",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第八讲 人中之俊也</strong></span></p><p><span><strong></strong></span></p><p><span><strong>义足以得众。</strong>首先义是有担当和奉献精神的，义足以得众，我们想要得的众是什么？更多的人和我们一样有担当和奉献的精神，这个时候我们整个的团队才有力量。</span></p><p><span></span></p><p><span>如果我们自己没有义，没有担当和奉献的精神，怎么会得到更多有担当和奉献精神的人？有时我们经常抱怨说:“身边的人不好，朋友不好，员工不合适，家人不满意”，首先看看自己有没有，如果我们是利字当头，是看重利益的，利也可以得众吗？只不过我们得来的众和自己一样，都是讲利益的，而利尽则散。</span></p><p><span></span></p><p><span>如果我们义字当头，自己本身就是有奉献精神的，就是有担当精神的，自己做的事情就是正义的，我们要去帮助更多人的，我们就得到了和自己一样的众人。</span></p><p><span></span></p><p><span>所以做任何事情，都要符合正义，师出有名，我们挥的一定是正义之师。每个朝代的更替，皆是如此，都是因为上一个朝代施了暴政，民不聊生，怨声载道，这时有仁爱之心，有德行的人开始揭竿起义，他们出的是正义之师，才有可能重新得到这个天下，平乱世，自己的德行和正义之师，就可以吸引更多的人，前来归顺。</span></p><p><span></span></p><p><span>一个团队做事情，也是如此，如果做的事情是可以帮助更多人的，走的是正义之道，挥的是正义之师，在这个行业当中的一些正义之士，知道了这件事情，就会愿意来到我们的身边，因为首先我们自己讲义，吸引来的众人也是讲义的，整个团队都有这种奉献和担当精神，团队怎么可能做不好呢？国家也是这样形成的，何况我们一个团队。</span></p><p><span></span></p><p><span>《素书》讲的是智慧，讲的是妙用的方法，我们把德、信、义、仁、礼，这五个字学清楚了，自己按照这个去修正，潜居抱道，以待其时，做事情真的很简单，如果我们没有理解到，这几个字的玄妙，说明我们还没有深刻地认识天道循环的规律，认识得越深刻，会发现《素书》讲的这些方法，真的是绝妙的方法，大道至简，我们把他说清楚了，讲明白了，原来是如此的简单，简单的往往是合道的。</span></p><p><span></span></p><p><span>为什么说《素书》告诉我们的，实则是大道至简的，看似简其实又很难，难的是我们能不能时时刻刻地去修己，去持守正道。如果可以，他教给我们的方法很简单，又很玄妙，这种看似简单的方法，别人学不去，很多人也懂得这个道理，甚至也听说过这个道理，但是又如何，我们不能让自己合于众道，不能让自己成为这样的人，怎么识人和用人呢？即使我们识来了人，又能如何呢？</span></p><p><span></span></p><p><span>我们说，这个人是俊杰之才，但当我们相处一段时间，发现他不是贤德之人，就不为我们所用了，所以首先让自己持守正道，会发现极其简单，却又很玄炒。</span></p><p><span><strong></strong></span></p><p><span><strong>才足以鉴古，</strong>鉴，是借鉴，何为借鉴？不断地总结、观察、体悟和应用，何为古？我们经常说古代，古人，过去的已发生的皆为古，鉴古不一定非要借鉴很遥远的事情，一定要借鉴两千年之前，昨天也是古，刚刚发生的事情也是古，我们借鉴和观察已发生的事情，来总结当下的经验。</span></p><p><span></span></p><p><span>《道德经》讲：“执古之道，以御今之有，能知古始，是谓道纪。”我们按照以前的道的运行规律，叫执古之道，以来驾驭和明察当下的事情，如此，就可以知道 道的运行规律。</span></p><p><span></span></p><p><span>唐太宗李世民讲过一句话：“以铜为镜，可以正衣冠；以史为镜，可以知兴替；以人为镜，可以明得失。”兴替是什么？不就是规律吗？我们去借鉴历史发展的规律，什么样的人得了天下？为何而得了天下？什么样的人又失去了天下？为何而失去了天下？规律自在其中。</span></p><p><span></span></p><p><span>孔子同样讲：“不见迹，亦不入于室”，我们如果不踏着圣贤的脚步和痕迹，很难升堂入室的，就是学不到家。只有踏着圣人的足迹，告诉我们道的那些规律，我们才能把知识和学问，学得更好，这就是借鉴的力量。</span></p><p><span></span></p><p><span>举一个生活当中的例子，比如我是一个农民工，即使是农民工，在工地上干活，也要懂得借鉴，也可以比他人做得更好，我去看看其他的老师傅，是怎么做的，他有什么样的经验，我可以去看看过去的，曾在这里干过活的优秀的人，或者干活比我好的人，他们用了什么样的方法？我当下做这个事情，按照原来的方法很难，做起来很累，这时我可以总结其他的方法，来做好我当下的事情。鉴古，我们时时刻刻都用得到。</span></p><p><span></span></p><p><span>比如，我们现在录线上课也是一样的，发抖音也是一样的，什么叫鉴古？已发生的事情都是古，我们去看看人家别人是怎么发的，总结一下别人的经验，别人所用的方法，我们的智慧就在不断地增长，如果不懂得借鉴，是很难增长智慧的，只是在闭门造车，关起门来认为自己的都是对的，我们不去学习别人的方法，不去借鉴，又如何成长呢？停在原地不动了。</span></p><p><span></span></p><p><span>我们为什么要学习圣贤的文化？就是在鉴古，有了这些文化，我们才能就有道而正焉，当我们学习了圣贤的文化，不断地修正自己，我们再看到身边人的事情，我们就知道他为什么是这样的？他的生意做的好，为什么做的好？必有原因，肯定是有规律的。</span></p><p><span></span></p><p><span>这个人当下生活不幸福，为何不幸福？万事发生必有规律，这就是道。人们总说道是一种规律，到底是一种什么规律？每件事情都会有规律，所以在不停地借鉴和总结的时候，就形成了观察事物的规律。我们看任何事情，就知道为什么会有这样的结果了，如果停留在自己片面的认知，会很痛苦，而且做事情也做不好。</span></p><p><span></span></p><p><span>我们学习《素书》，就是在借鉴《素书》里的智慧，我们如何运用到我们的生活和工作当中，这个时候鉴古是相互地作用，我们不停地总结和借鉴古人的智慧，增加我们的才能，不断地增加才能，我们就有更多的智慧，再借鉴已发生的事情，所有的事情都是相互作用的。</span></p><p><span></span></p><p><span>比如，德足以怀远，我们不停地去怀远，可以增加自己的德行，有了德行，可以不停地再去怀远。</span><span>信足以一异，我们增加自己的信，别人信服我们，我们才可以统一思想，统一文化，统一认知，统一行为。如何增加自己的信？我们要先有德行，并且同时我们不断地统一别人的思想，统一别人的行为的时候，我们的信力又在不断地增加。</span></p><p><span></span></p><p><span>我没有才华怎么办？越是没有才华，我们去借鉴已发生的事情，养成总结的习惯，体悟的习惯，这时候他也会反过来增加我们的才能。</span></p><p><span><strong></strong></span></p><p><span><strong>明足以照下，</strong>我们有了这样的才华，不断地去借鉴和总结，就会得出来智慧，掌握了很多的规律，这时我们自然会变得明达。照下就是当下的那个事情，我们有了智慧，才能看明白当下的状态，我们处在一个什么样的环境下，做的事情走到了哪个阶段，自己到了什么样的阶段，到了什么样的境界，我们看清楚当下的事实，才不会迷于其中。</span></p><p><span></span></p><p><span>很多人为什么做生意走不下去了？就是不能照下，看不清楚当下的事情，就找不到未来的路。</span><span>为什么说:“智者不惑”，有智慧的人是不会困惑的，因为所有的事情看得清清楚楚，很明白自己要往哪里走，当下处在一个什么样的状态下，怎么会迷呢？</span></p><p><span></span></p><p><span>整个告诉我们，持守正道要有德、有信、有义、有才、有才这时生成了智慧，有智慧的时候，我们整个都不迷茫，能清晰的知道未来的路，该往哪里走，我们就会很淡定从容地做好当下的每件事情，因为要走的更远，绝不会为当下的利益，而动摇自己最初的心念，不会因为利益，改变我们自己的初衷。</span></p><p><span><strong></strong></span></p><p><span><strong>此人之俊也。</strong>如果可以做到这几点，可谓人中之俊。俊，是高大的样子，在一群人当中，在一千人之中，一万人之中，他是一个高大的样子。是哪里高大？哪里都高大，智慧高大，德行高大，诚信高大，正义高大，才能高大，在人群当中都是属于高大的样子。</span></p><p><span></span></p><p><span>所以高大形容的是一种状态，一种境界，一种样子，别人自然会在人群之中发现他，并且跟随他，愿意和他一起做事情，所以我们自己做成了这样的人，就会有仰慕的人，来到我们的身边，和我们一起前行，因为有智慧，又能看清楚当下的路，知道未来的路，就知道该用什么样的人，怎么用人，一切都是了然于心的，这就是人中之俊。</span></p></div>"
},{
    "title": "《素书》第九讲 人中之豪杰",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第九讲 人中之豪杰</strong></span></p><p><span></span></p><p><span>上一节我们讲到人中之俊，这一段开始讲人中之豪，俊形容的是很高大，人中之俊是心怀大志之人，是可以利大众的。</span><span>人中之豪，豪仅次于俊杰，我们经常用到两个词，一个叫做俊杰，一个叫豪杰，人中之俊，人中之豪都是杰出的人士，都包含着杰，俊杰是更大的才，是可以利益更多人的，是可以胸怀大志的。豪杰是仗义豪爽的，是愿意帮助很多人的。</span></p><p><span></span></p><p><span>通常在一个团队当中，人中之俊可能是一个团队的领袖，人中之豪就是团队的中高层，这个人是可以辅助俊杰去做很多事情的。</span></p><p><span>我们读历史，做帝王的人，通常是俊才，他下面总会有一些元帅，这种都是人中之豪。所以我们首先要懂得识人，人中之豪身上所具备的品质是什么样子的？能做人中之豪的人，他自己有足够的能力，足够的优秀。</span></p><p><span><strong></strong></span></p><p><span><strong>行足以为仪表，</strong>首先看仪表两个字，我们经常提到仪表盘，仪表盘代表的是什么？代表的是一种标准，一种规则，所以说人中之豪，首先他的行为是可以成为一种标准，成为一种表率的。只有这样的人，我们才能称为是豪杰。他的一举一动，一言一行，自己本身就是有一定的标准，一定的准则，可以成为别人的表率，让他人来效仿。</span></p><p><span></span></p><p><span>比如，一个豪杰之人，他首先是仗义的，是正义的，是忠义的，也是讲诚信的，信守诺言的，这些身上的种种行为，都是一种正义的标准，都可以成为别人的表率，可以让别人去效仿和学习的。</span></p><p><span><strong></strong></span></p><p><span><strong>智足以决嫌疑。</strong>同时是有智慧的，以决嫌疑。第一层，他有足够的智慧可以解决各种问题；第二层，决代表着决别，决别嫌疑什么意思？当有一定的智慧以后，是不太出现各种问题的，所以叫决嫌疑。我们经常讲到智者不惑，当一个有智慧的人，可以让自己疑惑和困惑的问题特别少。</span></p><p><span></span></p><p><span>比如，在我们的生活和工作当中也是一样的，越是有智慧的人，即使出现了什么问题，轻而易举的就可以化解掉，可是当没有足够的智慧的时候，每天看到的都是问题，都是障碍，都是嫌疑。</span></p><p><span><strong></strong></span></p><p><span><strong>信可以使守约，</strong>行为可以成为一种表率，有足够的智慧去解决问题，同时又是有诚信的，他起到的是上传和下达的作用。守约，守的是和上位的人，所信守的约定。比如，我们决定同意和处上位的人做了一件事情，是我们自己同意并且认可的，这个时候是信守诺言的，信守约定会照着去做的，不会表面应承。</span></p><p><span></span></p><p><span>我们答应了一件事情，但是私下并没有去做，这就是不守约的行为。我们对下位的人也是要守约的，答应的事情，一定要做到。仗义豪爽的人都是这样的特质，如果不讲诚信的人，我们不能称之为是豪杰，因为自己讲的话不算数，别人是不会认可这样的人，他起不到上传下达的作用。</span></p><p><span></span></p><p><span>比如，我们可以去观察，在任何一个朝代，或在我们一个团队当中，很多处下位的人，往往看不到最上面的俊杰之才，因为看不懂。但是他们第一眼能看到的是那些豪杰之士，这些人是一个团队稳定的基石，能看到人中之豪每天做事情的行为，他们的智慧和诚信，所以做一个豪杰，讲信用是极其重要的，如果不讲信用，不守约定，处下位的人不服气，处上位的人不认可。</span></p><p><span><strong></strong></span></p><p><span><strong>廉可以使分财，</strong>廉洁就是不贪，只有不贪的人，才能恪守中正，中正才能廉洁。如果这个人是贪婪的，他就会贪上位所给予的东西，不给下位的人分，他会给拦截了。</span></p><p><span></span></p><p><span>我们去看一个人是不是豪杰，还得看他是不是有贪欲的，通常我们看电视也好，在生活当中也好，我们能称为是豪杰或者很豪爽的人，通常都是仗义疏财的，他都是愿意把财分给他人的，所以我们才能称他是豪杰，或者说这个人很有豪情，特别仗义，这样的人也是能服众的。</span></p><p><span></span></p><p><span>我们再来看一个豪杰的特质，首先他的行为是可以成为表率的，也就是说这个人要懂得修身，只有我们自己修身，修正自己的行为，才能成为别人的表率，才能成为一种标准，自己修身以后，还要有智慧，因为有智慧，我们才能解决各种问题，才能独挡一面。</span></p><p><span></span></p><p><span>如果我们在做事情当中，不能独挡一面，什么事情都要去请教，或者去询问处在上位的人，我们这个位置则不能服众，也不能获得居上位人的认可。</span></p><p><span></span></p><p><span>所以说智慧很重要，在我们不断修身的过程当中，自然就会有智慧，当一个人懂得修身为本，不断地去修正自己的行为的时候，智慧是随之而来的，所以我们要有智慧解决各种问题，决别各种嫌疑。</span></p><p><span></span></p><p><span>信可以使守约，讲信誉的人上传下达，无论是和谁的约定，都能去践行，同时又具备公正廉洁。当我们不贪的时候，才能得人心，可以使分财，可以使上传下达，可以成为团队当中运行的一块基石，一个顶梁柱，这是豪杰之人的特点。</span></p><p><span></span></p><p><span>《素书》告诉我们的是外用的方法，首先我们要识人，知道什么样的人属于豪杰，豪杰是什么样的特性，我们自己如果是处在中层的人，就要努力地去做一个豪杰之士。</span></p><p><span></span></p><p><span>同时我们要懂得用人，如果我们有更高的智慧，是人中之俊，我们就知道该用什么样的人，我们只有懂得以修身为本，知道如何做人，我们才能去识人，知道识人，我们才知道如何去用人。</span><span>接下来讲人中之杰，俊杰和豪杰，这两种特质的人，已经包含了杰，杰出就是一个优秀的人，最基本要做到恪尽职守，秉持正义。</span></p><p><span></span></p><p><span>守职而不废，恪守自己的本位，恪尽职守而不废，废的另一面就是能立得住，能拿得起来。守职而不废，是说我们做任何事情是可以恪尽职守的，而不</span><span>会让事情荒废掉，我们所经手的事情，所恪守的位置都能立得住。</span></p><p><span></span></p><p><span>处义而不回。什么叫不回？就是不改初衷。什么叫义？这种担当精神和奉献精神称为义，遇到困难是不会退缩的。</span><span>守职而不废，这句话看似容易，其实很难做到的。不废意味着，这件事情我们要立得住，并且做得好。处义而不回，告诉我们要想一件事情立得住，一定是有担当和奉献的精神，不改初衷，才能把自己的本职工作做好。</span></p><p><span></span></p><p><span>比如，我们做销售的，本职工作就是把销售做好；我们做财务的本职工作，就是把所有的账目捋顺清晰；如果我们是做后勤的，就要保障企业运营的所需；如果我们是做医生的，就要去救死扶伤；如果我们是做老师的，就要去教育好每一个学生。只有我们有了这种担当和奉献的精神，才可能把本职工作做好，所以要处义而不回，处在这种有担当和奉献精神的思维和行为当中，不改初衷。</span></p><p><span></span></p><p><span>《中庸》讲：“君子素其位而行，不愿乎其外”，也是同理，君子是要做好自己本位的事情，本位的工作，不愿乎其外，我们会去思考和自己本职工作没有关系的事情，全心全意地担当和奉献，才能做到恪尽职守，其实能做到这样，已经是个非常优秀的杰出人才了。</span></p><p><span></span></p><p><span>见嫌而不苟免，见嫌，只要是我们做事情，一定会遭到别人的嫌疑和误解。不苟免，就是不轻易放弃，当我们在做事情的过程当中，我们不停地担当和奉献的时候，一定会遭到他人的嫌疑、误解、毁谤。</span></p><p><span></span></p><p><span>圣贤之人亦是如此，何况我们呢！自古以来的圣贤，包括孔夫子是一样的，他这一生也是不停地遭到别人的误解和嫌疑，甚至他的弟子也怀疑过孔子，曾经也精神动摇过，信仰动摇过。</span></p><p><span></span></p><p><span>孔夫子在卫国的时候去见南子，子路非常地不理解，质问他的老师，为什么要去见南子？南子是卫灵公的夫人，当时的一个美人。所以我们要想做一个恪尽职守的杰出人士，无论遇到任何的嫌疑和误解，都不改初衷，更不会轻言放弃。</span></p><p><span></span></p><p><span>见利而不苟得，看到利益不会不加思索，千方百计地想得到。不苟得，不会轻易取得。我们看到了一个利益，一般不懂得修身的人，一定是不加思索地据为己有，千方百计地据为己有。可是作为一个杰出的人，不是这样的，见到利益，不会轻易地取得，要看是不是我应该得到的，如果不是我该得的，一点都不要。所以我们讲恪尽职守说起来容易，做起来很难的。</span></p><p><span></span></p><p><span>需要我们以修身为本，需要我们懂得道、德、仁、义、礼五者一体也，用道、德、仁、义、礼，不断地修正我们自己的行为，我们不起贪念，才能恪尽职守，成为一个人中之杰。</span></p><p><span></span></p><p><span>《素书》正道篇，告诉我们如何做人，如何识人，如何用人，首先我们自己修习，去做人中之俊，人中之豪，最基本也要做人中之杰，只有我们自己是一个杰出的人，这个时候才懂得识人。 </span></p><p><span></span></p><p><span>比如，我们自己是杰出的人，我们要识得谁是豪杰，谁是俊杰，我们追随着豪杰和俊杰去做事情。 </span><span>如果我们自己是豪杰，我们要追随着俊杰去做事情，我们要识得杰出的人来跟我们一起做事情。</span></p><p><span></span></p><p><span>如果我们自己是人中之俊，我们也要懂得识人，看看哪些是豪杰，哪一些是杰出的人士，我们只有吸引这样的人士到我们身边来，才能共同地把事情做大，才能共同地去持守正义，我们做的事情是合德的，合道的，大家是上好仁，下好义，又懂得用礼的，这个时候做的事情，自然而然就可以功成了。</span></p><p><span>所以我们作为一个修行之人，最低的起点，也要去做一个杰出之士，去恪尽职守把自己的本职工作去做好。</span></p></div>"
},{
    "title": "《素书》第十讲 求人之志篇",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十讲 求人之志篇</strong></span></p><p><span><strong></strong></span></p><p><span><strong>求人之志，</strong>志，是志向，方向，我们想要的那个东西。</span><span>比如，我们想要才华，这是一种志向。我们想要博学，这也是一种志向。我们想要心静如水，是一种志向。我们想要做好事情，这也是一种志向。</span><span>求人之志，如何求才能得到志向，得到我们想要的？整个第三章，告诉我们求志向是有方法的，首先肯定是向内求的，去求己的。</span></p><p><span><strong></strong></span></p><p><span><strong>绝嗜禁欲，所以除累；</strong>嗜，是嗜好。欲，是欲望。绝嗜禁欲，所以除累，我们才不被事情所累，我们为什么会活得痛苦，会有很多的烦恼，都是因为被事情所累。被什么事情所累？总结起来有两点，第一点，被自己的嗜好所产生的事情所累。第二点，被自己的欲望所带来的事情和困扰所累。</span></p><p><span></span></p><p><span>嗜，是我们自己想要的，喜好的。举个例子，我们特别喜爱喝茶，那可能就会被喝茶这个嗜好所累，当我们出门的时候不能喝茶怎么办？喝不到我们满意的茶怎么办？就开始生烦恼。</span></p><p><span></span></p><p><span>再举个例子，比如，我们习惯睡比较软的床，当外出的时候，如果床和我们喜欢的不一样，就会产生烦恼和痛苦。</span><span>嗜好，嗜这个字就是很重的，不光是喜好，而是非它不可，这叫作嗜。通常我们说，嗜酒如命，是我们对酒的依赖已经很过度了，很严重了，会带来无尽的烦恼。无论我们的嗜好是好的或者是不好的，都会被他所累。</span></p><p><span></span></p><p><span>比如读书，有的人读书一旦过度，成为一种嗜好的时候，也会被读书这件事情所累。无论我们的嗜好是什么，都不能过度，一旦过度，我们就会开始变得身心疲惫。</span></p><p><span><strong></strong></span></p><p><span><strong>欲，欲望，就是我们想要得到的，都称为欲望。</strong>我们想要得更多的名，我们就会被名所累。我们想要得更多的利，就会被利所累。我们想要得到更多的情，就会被情所累。</span></p><p><span></span></p><p><span>这里告诉我们要绝嗜禁欲，绝，是无，没有；禁，禁止，不让他发生，就是我们没有那么多的欲望，也没有那么多的嗜好，我们用什么都是一样的，吃什么都是一样的，去哪里都是一样的，否则就会开始身心疲惫。</span></p><p><span></span></p><p><span>比如，我们出去旅行是一样的，当过度于依赖某件事情的时候，就会产生痛苦。我们依赖于自己开车，习惯于自己开车，一旦没有车开的时候，就会觉得不习惯，不舒适，即使打车也觉得不舒服，坐公交也觉得不舒服，坐地铁也觉得不舒服。这个时候我们出去旅行，反而成为了一种负担，我们出去旅行本身是为了放空的，是为了放松心灵的，是为了得到更多的快乐的，这个时候反而产生了很多的烦恼和痛苦。</span></p><p><span></span></p><p><span>这两个生活中的例子，是想让大家明白，为什么说绝嗜禁欲，我们才不被所累？就是这样的原理。有的人说，我出去旅行，还不至于被这件事情所累，但是我们通过这一个点，可以去无限地延伸，有的事情没有被牵累的那么多，出去旅行还好，但是如果再去做其他的事情，就不一定了。</span></p><p><span></span></p><p><span>只要是涉及到我们的嗜好，我们特别喜欢这件事情，非它不可，被牵累的就会越多。所以如何才能变得清静自然？就是减少我们的嗜好，没有过多的喜好和偏爱，没有过多的欲望，没有什么东西是非要不可的，这个时候我们才能淡然处之，才不被事情所累，不被自己的心所困。</span></p><p><span><strong></strong></span></p><p><span><strong>抑非损恶，所以攘过。</strong>抑，是抑制，非，是不好的事情，过错，不对的事情。损恶，损是减少，恶就是恶行，我们不好的心念，称为恶，不好的言语，称为恶语，我们做伤害他人的行为，称为恶行。抑非损恶，我们要抑制不好的，容易产生过错的，要减少我们的恶语，恶意和恶行。所以禳过，禳是去除，避免。</span></p><p><span></span></p><p><span>我们减少这些不好的心念，不好的语言和不好的行为，可以避免很多的过错，避免伤害他人。不让这些恶行，恶语，恶言去发生，所以我们一边要抑制，一边要不断地通过我们的修身，通过学习圣贤的文化，让它减少，当我们的恶念，恶语，恶行越来越少，我们就达到了这个结果。就可以去除很多的过错，保持了我们自己内心的中正，内心的良善，内心的阳光。</span></p><p><span><strong></strong></span></p><p><span><strong>贬酒阙色，所以无污；</strong>贬，是谢绝，这里读阙（jué ），阙，就是去除。贬酒阙色，就是我们要谢绝酒，去除色，所以无污。这样的话，我们自己就会减少很多污点。我们经常会提到一句话，酒后失态，色能败身，酒后不仅是失态，酒后会失去很多东西的，酒后失德，酒后失信，酒后乱性等等，并且酒后的样子是很难看的。</span></p><p><span></span></p><p><span>通常我们生活当中，会有一些智者和领导，善于观察一个人酒后所说的话，所呈现出来的样子，往往这个才可能是真实的，这是他自己潜意识里的东西，平时在有理智的情况下，懂得抑制自己的情绪，懂得把自己更好的那一面表现出来的，一旦酒后的时候，就开始失态了，开始胡言乱语。</span></p><p><span></span></p><p><span>比如，一个人本来可能是一个谦谦君子，仪表堂堂，本来说话是谨言慎行的，喝完酒之后就开始失态了，样子是非常的难看，这个时候就容易留下污点，别人看到这个人酒后的样子，如此难看和丑陋的那一面，即使回到正常的轨迹和状态，人们也会想起，他喝完酒以后不是这个样子的，喝完酒以后，他是没有德行的，所以就会留下污点。</span></p><p><span></span></p><p><span>阙色，色是一样的，我们说，色能败身，一旦过度地贪恋美色，我们的行为就开始变得偏颇，不公正。跟酒一样也会留下污点，让别人对我们产生不好的印象，而这个污点一旦形成，是很难去除的。</span></p><p><span></span></p><p><span>《素书》的素就是最洁白的、最纯净、最清净的样子，所以我们如何才能回到那个最清净的那个样子？我们要减少各种欲望，绝嗜禁欲，没有那么多过度的嗜好，没有那么多欲望，没有那么多想要的东西。</span></p><p><span></span></p><p><span>我们抑非损恶，抑制住那些不好的行为，不好的事情，减少我们的恶行。贬酒阙色，我们不饮酒，色相的问题不要过度，就是本然清净的状态，这个时候才是无污染的，才能回到素的状态，是告诉我们，如何得到我们想要的方法。</span></p><p><span><strong></strong></span></p><p><span><strong>避嫌远疑，所以不误。</strong>嫌是嫌疑，疑就是疑惑，我们要避免去做一些让人疑惑的事情，减少别人对我们的误解。别人为什么会对我们产生误解？说明我们做的事情，是让对方不理解的，是让他人感觉到疑惑了，既然是让他人感觉到疑惑了，往往说明这件事情，违背了我们的本意，才会招人疑惑。</span></p><p><span></span></p><p><span>举个例子，比如咱们每天录线上课也是一样的，有一些朋友质疑，为什么要收费呢？这是因为他不理解，所以通常这个时候，我们会解释一番的，会告诉大家，因为开发线上课的程序，需要昂贵的费用，大家在观看的时候也会产生流量，产生费用，整个运作团队，每天在制作的过程当中要产生费用。我们这样告知给大家，就会得到理解了，要不然会以为把课程放在那里不会再产生费用了。</span></p><p><span></span></p><p><span>当别人有疑惑的时候，我们讲出来，不是想解释和证明什么，只是告诉大家，这里面还有不了解的事情，这样就能减少误解。我们为什么要去这样做？如果不这样做的话，可能会给很多人心里面留下嫌疑和怨恨，可能因此就误了慧命。我们解释什么？远离误解，往往并非为了我们自己，而是让别人减少困惑。</span></p><p><span></span></p><p><span>比如，以前的军师，行军打仗亦是如此，有的时候部将不理解，为什么这样做？谋土通常会适当地和将领们，去讲其中的道理，为什么呢？让他们远离疑惑，远离疑惑，不产生误解，就会减少事端，否则不停地产生误解的时候，就会有是非发生。</span></p><p><span></span></p><p><span>比如，我们在一个团队当中亦是如此，当出现了很多员工，或者中层领导，都不理解的事情，这个时候通常智者是会解释一番的，解释并不是想去证明什么，而是减少误解，降低是非，否则是非和事端，就会不断的被惹起。</span></p><p><span></span></p><p><span>《素书》是告诉我们如何外用，不是保持我们个性的，如果说误解就误解吧，我也不去解释，不想去证明什么，这是个性。解释都是为了用的，如果不是为了用，无所谓，他人是否理解都一样。</span></p><p><span></span></p><p><span>所以这句话第一点，我们要做到的，尽量不去做引起嫌疑的事情；第二点，我们非做不可的时候，要进行一番解释，减少别人的误解；第三点，如果还没有用怎么办呢？见贤而不苟免，即使有人误解，有人产生了嫌疑，我们依然不改自己的原则和初衷，继续前行就好了。</span></p><p><span></span></p><p><span>为什么要分为三步呢？我们直接见贤不苟免，不可以吗，如果直接这样的话，会多出来很多的是非，所以这个实在不是妙用的基本原则，我们基本原则是不停地减少，不停地减少，降到最低程度的时候，其实就无所谓了，保持自己的初衷就好。</span></p><p><span></span></p><p><span>当我们这样去做的时候，本来的嫌疑可能是十分，经过我们的努力，可能就剩下了三分，本来对我们产生嫌疑的人，假设可能是十人，经过我们大量的努力之后，可能只剩下三人，所以我们尽量减少事端，减少是非。</span></p><p><span><strong></strong></span></p><p><span><strong>博学切问，所以广知。</strong>博学，就是范围很大地去学习，博览群书，切问，切是形容一种急切的心情。比如我不懂，要不停地去问，问就包含了思考体悟，如果一个不善于学习的人，或者不爱学习的人，问出来的问题，也同样是没有智慧的，也同样是无关痛痒的，不能直指事情的核心。</span></p><p><span></span></p><p><span>所以只有不断地博学，不断地问，不断地思考体悟，我们问出来的问题，才是有深度的，才可以有助于自己去修身，这个时候可以广知了，可以增长我们的知识，增长我们的智慧。</span></p><p><span></span></p><p><span>同样的道理，《中庸》讲了五个字，学，问，思，辨，行，博学之，审问之，慎思之，明辨之，笃行之，首先也是要博学的，审问，要不停地去问，慎思之，问过之后，要谨慎地去思考，明辨之，只有我们不断地博学，不断地去问，不断地思考，我们才有明辨是非的能力，才有智慧去分别一些事情，是对是错，是不是属于道，是不是德，是不是符合义，合不合礼的，明辨以后，笃行之，是为了自己要去实践，用来修身的。</span></p><p><span></span></p><p><span>我们经常讲，一个人要懂得修身之道，修身之道到底是什么，我们该依照什么样的方法去修身，都离不开博学，审问，慎思，明辨，我们有了前四步，我们才知道该如何去修身。《中庸》中的学，问，思，辨 行，与《素书》讲给我们的道理是相通的，博学切问，所以广知，这是知道产生了智慧。</span></p><p><span><strong></strong></span></p><p><span><strong>高行微言，所以修身。</strong>如何修身，要高行微言，我们的行为是高尚的，高和微是两个反义词，微就是很小的意思。我们的行为是高尚的，语言却是很谦卑的，如果一个人一旦言高于行，别人就会知道，此人华而不实，讲的多可是做的少。</span></p><p><span></span></p><p><span>在一个企业和团队当中，也是一样的，有的人言高于行，说的头头是道，每天讲很多的话，承诺很多的事情，可是真正做出来的结果并不好，和自己所说的，也并不相同，到处去承诺，讲话是口无遮拦的，自己想到哪里就讲到哪里，也不管自己是不是真正的懂，也不管自己能不能做到。</span></p><p><span></span></p><p><span>久而久之，大家会变得不喜欢这种人了，因为言过其实，讲的太多而做的太少。我们要想让自己成为一个君子，要想让自己去修身，要想让自己变得中正而有智慧，行为是高尚的，但言语是很谦和的，很谦逊的，很低调的，这才是修身之本。</span></p><p><span></span></p><p><span>我们如何修身，怎样才能修好我们的行为？很简单，方法给到我们了，高行微言；我们如何才能变得博学，有知识，有涵养，我们如何才能变得有智慧，很简单，方法告诉给我们了，博学切问。 </span></p><p><span></span></p><p><span>我们如何才能减少别人的误解，生活当中有很多人会问这个问题的，我做事情，别人总误解我怎么办，我生活当中总招小人怎么办，别人总是不信任我怎么办？《素书》告诉给我们了，很简单，避嫌远疑，所以不误，这样就可以减少别人对我们的误解。</span></p></div>"
},{
    "title": "《素书》第十一讲 求人之志篇",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第十一讲 修身自守也</strong></span></p><p><span><strong></strong></span></p><p><span><strong>恭俭谦约，所以自守。</strong>自守就是守身，玉是形容洁白、洁净、透明的样子，所以有一个词叫守身如玉，就是让我们自己回归最简单，最干净的状态。</span></p><p><span>我们现在用守身如玉，好像只是说身体上，其实他的原意是里外都要透明的，无论是我们的身体，还是我们的内在，都是最洁白，最透明的样子，才能做到像玉一样清澈，洁白。</span></p><p><span></span></p><p><span>恭、俭、谦、约这四个字，恭就是恭敬，俭就是节俭，谦就是谦逊，谦虚的样子。约就是简约，这是四种态度。恭敬，是懂得处下位，对人、对事、对物都是最恭敬的样子，是可以克除傲慢的，如果我们不懂得对人、事、物是恭敬的，是怀着敬畏之心的，这个时候我们整个人所显现出来的，就是非常傲慢，好像玩世不恭的样子。</span></p><p><span></span></p><p><span>节俭，我们的生活不要过度的奢侈和浮华，才能回到最干净的样子，静以修身，俭以养德，我们是节俭的人，节俭的生活方式，才能不断地滋养自己的德行。谦逊，我们的念头起处，我们的语言表达方式，我们的行为所体现出来的，处处的都是谦逊。</span></p><p><span></span></p><p><span>简约，我们追求的任何事情都是越简单越好，越简单越舒适，绝嗜禁欲，所以不累，越是简约的方式，越是没有过多想要的欲望，越是没有过多的嗜好，我们不被事物所累，才能回到最清净，洁白的样子。</span></p><p><span></span></p><p><span>所以自守，守住自己的身心，行为，自守我们要回归的状态，守身如玉的状态。举个例子，一张白纸，我们说它是最清净的状态，怎么才能达到白纸的状态，上面没有任何的污染，没有任何污染的时候，就是我们自守的最高境界，本然每个人都是清净的，只不过被后天的欲望，所蒙蔽住了。</span></p><p><span></span></p><p><span>《道德经》讲：“为学日益，为道日损，损之又损，以至于无为，无为而无所不为”，做学问要不断地增加，但是修道却是要日损，要不停的减少的，就是减少我们的欲望，欲望变得越来越少，越来越少，我们自然就回到了清净无为的状态，回到了清净无为的状态，就无所不为了。</span></p><p><span></span></p><p><span>为什么要用恭、俭、谦、约这四个字？道家总用水比道，水是不是这样的状态，可以立万物而不争，恭敬万物，又很节俭，没有那么多浮华的方式，可以随时产生变化，江海之所以为百谷王者，善处下，所以他永远是谦逊的，简约的样子。</span></p><p><span></span></p><p><span>这四个字是形容一个人的状态和行为方式，我们越是谦逊的，越是节俭的样子，越容易回到最初的本来的状态。生活当中，我们只要按照这四个字去修正自己，别人看着就是舒适的状态，我们就不会被过多的事情所累，就不会有别人看不顺眼的那么多缺点。我们如果是奢华的，是高傲的，是不恭敬的，就会有很多人不喜欢。 </span></p><p><span></span></p><p><span>我们按照这四点，不停地去修正自己，就能守好自己的行为，守好自己的心，守好自己的念头。这个时候有的人可能会讲，我们为什么要让那么多人喜欢？</span></p><p><span></span></p><p><span>《素书》是告诉我们妙用的，如果别人都不喜欢我们，我们怎么用，我们如何去帮助更多人，所以让别人喜欢我们，不是我们要追求的，是因为更多的人喜欢我们，我们才有智慧和机会去帮助更多的人，不是追求别人对我们的喜欢，而是别人喜欢之后，我们要去做的那些事情。不要认为说为了让别人喜欢，是不是在讨好他人，不是的，是我们为了用，不是追求那个喜欢和不喜欢。</span></p><p><span><strong></strong></span></p><p><span><strong>深计远虑，所以不穷。</strong>深是指的深度，看问题比较透彻，远虑是思考的比较远，所以不穷，不穷就是无穷无尽，不会停止。我们以做生意举例，我们想要做一个生意，如何才可以让生意做得更长久，首先我们要谋之深远，深就是我这件事情考虑的更深入，做起事情的时候方法更有智慧。</span></p><p><span></span></p><p><span>远就是要考虑生意可以做多久，假设我们不考虑那么深远，做个生意赚钱就好了，那可能做一年以后做不下去了，做两年以后做不下去了，因为我们并没有谋之深远，没有考虑未来，我们到底该往哪里走，我们的事情想要做多远。当我们的思维方式不同，就决定了我们当下的行为方式也是不同的。</span></p><p><span></span></p><p><span>《中庸》讲：“言前定，则不跲，事前定，则不困，行前定，则不疚，道前定，则不穷”。任何事情都可以考虑的深远，当我们在讲一番话的时候，自己要知道我们要讲什么？就是这件事情的中心思想是什么？</span></p><p><span></span></p><p><span>举个例子，我们今天下午要去谈一个客户，在去见客户之前，我们就想好了要讲什么，要去说什么，今天见面的意义和目的是什么，我们讲起话来就是流畅的，就是有自己的中心思想。</span></p><p><span></span></p><p><span>比如，今天我们去找一位员工，和他谈谈心，言前定，要知道他的问题出在哪里，我主要想跟他聊什么，讲话就是流畅的，并且万变不离其宗，无论聊什么，都可以聊到自己的主要话题，不至于出现不流畅中断的情况。事前定则不困，我们做事之前是有自己的规划和谋划的，不容易被困难所阻碍。</span></p><p><span></span></p><p><span>行前定，则不疚，当我们的行为要产生之前，自己提前是有规划的，就不会产生愧疚，有的时候我们做事情，或者讲一番话，是不是很容易产生愧疚，愧疚从何而来？就是没有提前想好，我们一冲动就讲了一番话，一冲动就做了一个行为，过后又愧疚不已，是不是那番话我不该说，是不是我那个行为不该做？就会给我们自己和他人带来烦恼。</span></p><p><span></span></p><p><span>道前定则不穷，这段话主要讲的这六个字，要想做事情无穷无尽，要想深谋远虑怎么办？就是我们自己必须是合道的，才会无穷无尽。</span></p><p><span></span></p><p><span>回到《素书》，我们要想深谋远虑，要想无穷无尽，那我们的谋划必须是合道的，如此才可能长久。我们再去观察中国的历史亦是一样的，只要是不合道，不合德，不合仁，不合义，不合礼的事情，都不会长久的。</span></p><p><span></span></p><p><span>《素书》的开篇告诉我们，道、德、仁、 义、礼五者一体也，欲为人之本，缺一不可，我们要想去做一个修身的人，要想去做一个躬行君子，要想去做一个有智慧的人，要想去做一个仁义，有德行的人。首先我们自己的谋划是必然要合道的，否则就会沦为阴谋，而且做事情一定不长久，必然会终止的。</span></p><p><span><strong></strong></span></p><p><span><strong>亲仁友直，所以扶颠。</strong>我们要亲近仁德的人，交朋友要交正直的人。颠是颠倒。我们越是亲近仁德的人，交朋友都是正直的人，我们的价值观就会受到仁德的人和正直的朋友的影响，自动就扶颠了，很多事情，我们不会再颠倒，不会再违背道义，因为我们亲近的都是有仁德的人，自然会受到他们的影响，我们的朋友都是正直的人，我们自然就受到他的影响，这是自动扶颠的过程。</span></p><p><span></span></p><p><span>我们再来讲，即使我们还有颠倒的事情，可是我们亲近的都是有仁德的人，都是正直的人，当我们把自己的想法和想要做的事情，讲给身边之人听的时候，这些人就会帮忙扶正，“这样的想法是不对的，这样的想法是有违道义的，这样的想法是做不长久的，这样的做法是损害他人利益的”，我们自然就会得到扶正，做事情不会颠倒。</span></p><p><span></span></p><p><span>何为颠倒？不合道的事情就是颠倒的，没有德行的事情就是颠倒的，没有仁义的事情就是颠倒的，不合礼数的事情就是颠倒的。</span></p><p><span></span></p><p><span>求人之志，我们要想达到一个什么样的结果？那我们看看怎么求，就是告诉我们如何去种因，我们要想做事情都是正直而不颠倒的，怎么办？亲近有仁德的人，交正直的朋友，我们做事情要想无穷无尽不会停止，怎么办？要懂得深谋远虑，那如何才能谋划的更深更远？</span></p><p><span></span></p><p><span>道前定则不穷，我们让自己做事情都是合道的，才能无穷无尽。我们如何才能保持最本真的那个样子？我们如何才能守身克己？方法也很简单，我们恭敬、节俭、谦逊、简约就可以了。</span></p><p><span></span></p><p><span>求人之志，后面告诉我们的是果，是如何达到这样的状态，前面告诉我们的是因，是如何去做，就可以自然而然所达到这样的状态。</span></p></div>"
},{
    "title": "《素书》第十二讲 近恕以济物",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十二讲 近<strong>恕</strong>以济物</strong></span></p><p><span><strong>近恕笃行，</strong>恕，宽恕，什么叫恕？推己及人，已所不欲，勿施于人，称为恕。</span><span>比如，我们不喜欢别人对我们恶语相向，那我们也不会恶语相向于他人。我们不喜欢别人对我们的苛责和抱怨，所以我们也不会对他人苛责和抱怨。我们不愿意他人做有损我们利益的行为，我们也不会去做有损于他人利益的行为，这就是恕。</span></p><p><span></span></p><p><span>笃，就是很坚定，很努力地去做事情，近恕笃行，我们为人是宽厚的，是宽恕的，将心比心，懂得换位思考，自己不喜欢的事情，不会对他人去做，我们平时做事情笃行，很坚定，很努力的状态。</span></p><p><span></span></p><p><span>假如我们是处上位的人，自己是否喜欢这样的员工？懂得宽恕，很努力坚定做事情。如果我们是处下位的，我们是否喜欢这样的领导，他是宽容的，懂得换位思考的，可以将心比心的，并且做事情非常地努力、积极和坚定，如果我们喜欢他人是这样的，我们也要去近恕笃行，做一个这样的人。 </span></p><p><span><strong></strong></span></p><p><span><strong>所以接人。</strong>我们以这样的方式接人待物，才能更好地经营我们的人际关系。我们一直在强调《素书》讲的是妙用，如何智慧地去用人？如何智慧地去修己？首先我们修己，让自己变成近恕笃行，别人就会愿意接触我们，别人也会喜欢我们的接人待物之道。</span></p><p><span><strong></strong></span></p><p><span><strong>任材使能，所以济物。</strong>每个人身上都有他自己的优点，都有他自己的才能，我们能知人善用、人尽其才、物尽其用。所以济物，既包括人，又包括物，我们帮助他人称为济人，帮助物品称为济物，那我们看看如何济人，如何济物？</span></p><p><span></span></p><p><span>任材使能，我们要想帮助一个人，人尽其才，这个人身上有什么样的才能，我们帮助他发现自己的才能，并且用好他自己的才能，才能体现自己存在的价值和意义，这是救济他人。</span></p><p><span></span></p><p><span>道家讲，正已化人，我们要先修正自己，再去化人。何为化？是他自己明了，觉醒以后才称为化。举个例子，比如，我们是一个渡人的船夫，在这里划船，当有人来到河边的时候，我们自己渡这个人过河，到达河的对岸，这个称为渡。那什么叫化？我们渡的人之中，愿意留下来和我们一起渡人，这个称为化。</span></p><p><span></span></p><p><span>一个人有变化了，就是跟他原来的样子不一样了，所以文化都是来济事育人的，这是文化的力量，让他自己去觉醒，找到内在的那种圆满和具足，找到自己内在的仁、义、礼、智 、信、道、德、仁、义、礼等等，这个才称为济。</span></p><p><span></span></p><p><span>《论语》讲:“爱之能勿劳乎”,如果我们真正爱一个人，怎能不以勤劳劝勉，所以有时我们生活当中，爱的方式是反的，我们爱一个人的时候，舍不得让他做事情，舍不得让他去吃苦，这个不是真正的爱。真正的爱是以勤劳劝勉，去让他变得积极向上，努力地去做事情，发挥他的才能，这个叫人尽其才。</span></p><p><span></span></p><p><span>物尽其用，我们看看如何济物？举个例子，我们买了一个杯子，对于杯子的价值是什么？盛水，用杯子喝水喝茶，这个物品才有它的价值，如果我们买了一个杯子放在那里，没有人用，那物品也没有它的价值，所以我们提倡要懂得节俭，不要买过多的物品。</span></p><p><span></span></p><p><span>因为买了过多的物品，而又用不到它，如果这个物品是有灵魂的，它会觉得失落的，它的价值就是盛水，可是没有人用它。我们买了一个柜子，它的价值就是用来盛衣物，可是它是空的，是荒废的，这就是在浪费物品。</span></p><p><span></span></p><p><span>不要买太多的东西，不要买太多的衣服，我们穿不到的时候，这个物品就是浪费的，而且给自己平增了许多的烦恼，每一件东西，每一件物品，我们都让它发挥最大的作用，这个才是济物。</span></p><p><span></span></p><p><span>物，包含了人、事、物是一样的，我们如何去济事，事情的事，我们把每件事情做到最好，让这件事情变得有结果，有价值有意义，我们如此就是在济事，所以任材使能，可以用到我们生活的方方面面。</span></p><p><span></span></p><p><span>如果我们真的爱自己的孩子，要发挥他身上的优点，让他人尽其才；如果我们要真的爱自己的物品，要物尽其用，让它发挥价值和意义；如果要真的爱自己所做的事情，要发挥事情本身的价值和意义，让它可以帮助更多的人。</span></p><p><span></span></p><p><span>我们在一个团队当中，也是一样的，如果我们真的爱一个人，不是溺爱他，不是宠爱他，让他什么都不做。我们要发现他的价值，让他体现自己的意义。比如，我们去观察，在一个团队当中，是做事情很多很辛苦，会让我们痛苦，还是根本就没有人用我们，自己会觉得痛苦呢？</span></p><p><span></span></p><p><span>如果我们自己是一件衣服，是天天被人穿在身上，哪怕是出褶，每天不停地去洗，去熨烫来的痛苦，还是一直在那里荒废着，更痛苦呢？可能大多数人都会明白，如果没有人用我们，其他人都在忙碌，其他的人都在体现他的价值，而我没有，可能这个才是最痛苦的吧。</span><span>我们一定要学会，任材使能，所以济物，这才是我们对万事万物的慈悲之心，如此济人，济事，济物。</span></p><p><span><strong></strong></span></p><p><span><strong>殚恶斥谗，所以止乱。</strong>这个殚就是去除、抑制的意思，我们要抑制、去除自己的恶行，斥谗，是斥责，斥止谗言，所以止乱，我们的乱都是从哪里来？是从恶行，恶语，恶意（念头）上来，从谗言上来。</span></p><p><span></span></p><p><span>我们经常讲一句话：“不是是非人，不惹是非事，”比如说，我们经常背后议论他人的是非，不停地去评判他人，我们有了这样的思维，有了这样的行为，会发现我们身边，就会招来很多类似的人，今天有人给我们打一个小报告，说其他人的不好，明天又有一个人，来到我们身边，说他人的不是。</span></p><p><span></span></p><p><span>如果我们总是喜欢听这样的话，或者不懂得斥责，斥止这样的话，我们招惹来的是非，就会越来越多。这时就会有越来越多的人知道，我们是背后听这些谗言的，就会有更多的人来进谗言，如此乱必生。</span></p><p><span></span></p><p><span>我们去看整个历史都是如此，如果一个皇帝君主，是喜欢听谗言的，所有的人就开始不做正事，都开始背后讲谗言，不停地去参奏他人。何为谗言？就是不属实的，不公正的话语，无中生有的或者夸大其词的，称为谗言。</span></p><p><span></span></p><p><span>我们在一个企业当中，更是如此，如果有员工和我们进谗言，我们自己的心就会乱，员工的心亦会乱，他自己也深刻地明白，今天我们可以听他的谗言，明天我们也会同样听其他人的，这候所有人的内心，是没有安全感的，如此下去乱必生。</span></p><p><span></span></p><p><span>所以要懂得，止住一切的谗言，如此才可以防止乱象的发生，我们每个人，很难抵抗浸润的力量，何为浸润？就是长期的听某一种话语，比如说，我们是一个男人，我们的母亲，可能不停地在我们耳边，说儿媳的坏话，或者说她不好的缺点，说她不懂得节俭，不懂得操持家务，她太爱美了，她买的化妆品、衣物太过于昂贵，不懂得好好过日子。</span></p><p><span></span></p><p><span>我们会发现说一次，我们可能会说母亲，这种事情不要去管，因为每个人的价值观不同，我们年代的不同，消费观也不同，可能这样说了一次，我们没往心里去。</span></p><p><span></span></p><p><span>第二次又来说，我们觉得好像也没往心里去，第三次又来说，我们觉得好像也没往心里去，但是突然有一天，我们自己起了一个念头，认为自己的老婆确实不够节俭，不懂得操持家务，当这个念头一起，所有母亲对我们说过的话，在脑海里全部会出现，这个时候，我们脱口而出，数落她所有的不是，</span><span>都是母亲曾经所讲过的话，这就是浸润之谮，出自于《论语》。</span></p><p><span></span></p><p><span>就是这种浸润的力量，在潜移默化地影响我们的心念和思维，只要有一个合适的机缘，一个点触动以后，就会喷薄而出，很可怕。比如说，一个员工总在我们面前，说另外一个人的缺点，我们觉得，好像没有听进去，直到有一天我们也觉得，这个员工有一丁点问题的时候，所有别人说过的话，那一刻都会充满我们的脑海，我们就会给那个人下结论了。</span></p><p><span></span></p><p><span>以前的忠臣，不都是如此被迫害掉的吗？所以我们一定要懂得，让自己保持中正，保持冷静，保持智慧，遏制住所有的恶语和恶行。我们去斥责谗言，我们不听这样的话，就不招惹这样的是非之事和对错之言，背后评论他人的是非，这种事情就不会发生，这样才能保持，自己的团队不乱的状态。</span></p><p><span></span></p><p><span>所以说《素书》里的内容，看似都很简单，比如说博学切问，所以广知；绝嗜禁欲，所以除累；高行微言，所以修身；亲仁友直，所以扶颠；近恕笃行，所以接人；殚恶斥谗，所以止乱。每一句听上去，好像都如此简单，可是我们要懂得以修身为本，我们能做到其中的一两条、三四条，我们这个人就会变得很有智慧，实在是妙用无穷。</span></p><p><span></span></p><p><span>我们经常说大道至简，听上去如此简单，可是做到还是很难的，所以我们要做一个躬行君子，要去近恕笃行，就是坚定地，按照所学习的内容，去修正自己，按照我们所学的内容去用，才能产生应有的力量。</span></p></div>"
},{
    "title": "《素书》第十三讲 设变以解结",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十三讲 设变以解结</strong></span></p><p><span><strong></strong></span></p><p><span><strong>推古验今，所以不惑。</strong>借鉴古人的智慧来验证今天的事情，所有已经发生的事情都称为古道，亦是古。</span><span>何为道？古人不断地总结出来万事万物发展的规律称之为道，道是在万物之前。《道德经》讲：“吾不知谁之子，象地之先”。</span></p><p><span></span></p><p><span>老子说：“我也不知道，道是从哪里来的？在象帝之先，在万事万物之前就有道”。我们过去所发生的每一件事情，都有它事情背后的规律，我们通常说那个规律就是道。</span></p><p><span></span></p><p><span>推古验今，所以不惑。我们从已经发生的事情当中，推演事物发展的规律，验证今天的事情，就不会迷惑。唐太宗李世民讲:“以铜为镜，可以正衣冠；以史为镜，可以知兴替；以人为镜，可以明得失。”以历史为镜，我们是可以知兴替的，就知道了万事万物发展的规律，借鉴古人的智慧，验证我们今天所做的事情。</span></p><p><span></span></p><p><span>我们修身也是一样的，要如何修身呢？我们可以借鉴古人的圣贤智慧，这就是道。</span><span>《素书》告诉我们有素书之道，我们按照《素书》的道来修正自己的行为，用《素书》交给我们的道来做人，修正自己，来识人，来用人，所以不困惑.每当我们遇到困惑的时候，就要懂得去学习，去借鉴古人的智慧，才能解决当下的问题，解决当下的困惑。</span></p><p><span><strong></strong></span></p><p><span><strong>先揆后度,所以应卒。</strong>揆，是掌握事情的来龙去脉。度，是思量如何解决这件事情。遇到所有的事情，我们先要掌握事情的规律，看清楚事情的来龙去脉，然后思量如何解决问题，如此我们才可以应对，每一个仓促之间所发生的事情。</span></p><p><span></span></p><p><span>我们在生活或在工作当中，有很多我们所谓的突发事件，每天都在发生不同的事情，都会出现不同的问题，我们如果懂得先揆后度，先了解事情的来龙去脉，然后再去思量，如何解决问题，如此便可以从容应对。</span></p><p><span></span></p><p><span>但是通常我们绝大多数人，都不是这样解决问题的，当我们遇到了一个仓促之间所发生的事情，很多人是先起情绪的，不会先去了解事情的来龙去脉，再去仔细地思量。</span></p><p><span></span></p><p><span>举个例子，我们今天听说一个员工，好像犯了一个什么错误，我们没有了解那件事情的来龙去脉，直接情绪就起来了，直接就发怒了，直接就开始做决定。</span></p><p><span></span></p><p><span>比如，孩子在学校犯了一个什么错误，我们不去了解事情的来龙去脉，不去思量该如何解决，可能直接就发火，开始骂孩子，甚至是打孩子了。</span></p><p><span>通过这个点，再去往生活当中不断地延伸，我们绝大多数时候，都是被情绪所掌控的，不懂得掌握事情的规律，没有认真地思量，就开始做决定。所以我们经常讲一句话：“人在有情绪的时候智商为零，所有做的决定都是错的。”</span></p><p><span></span></p><p><span>我们去看一个智者，无论遇到任何事情都可以从容应对的，为何可以从容应对？就是这四个字“先揆后度”，先了解事情的发展规律，事情的来龙去脉，然后思考如何应对，这样我们就会变得从容。</span></p><p><span></span></p><p><span>比如，我们去看历史，通常军师都承担了一个这样的职责，有这样的智慧。假如有对方来攻城，通常武将会请求出战，“我们不能受他的侮辱，既然敢兵临城下，我一定要去和他对决”。军师通常是这样的，先要了解对方派何人来战，带了多少兵马，有多少粮草，走的是什么路，对方武将的优点和缺</span><span>点是什么，我方派谁应战，在什么地方和他交战，采取什么样的谋略，这才是一个智者。</span></p><p><span></span></p><p><span>我们在生活当中也是一样的，无论遇到什么事情，不要急着下决定，不要被自己的情绪所带动，而是停下来了解事物的规律，去思量如何应对，才有足够的能力和智慧，去解决每—个仓促之间发生的事情。</span></p><p><span><strong></strong></span></p><p><span><strong>设变致权，</strong>设是采取应用，变，是灵活的手段和方法，权，是变的意思，权变，致权是一种化被动为主动，当我们遇事情的时候，要采取灵活应用的方法和手段，要懂得化被动为主动，如此才可以，不被困在事情当中。</span></p><p><span></span></p><p><span>我们在生活、工作或人生当中，包括我们学习之道都是如此，如果不懂得灵活应用，不懂得去变通，我们很容易被困在其中。引用孟子的一段话：“常谓之经，变谓之权，怀其常经，而挟其变权，乃得为贤。”常谓之经，常态我们称为经，通常我们把天地比作经，经络的经，就是我们身体的经络，故而我们经常用一个词叫经常，不变的谓之经，所以叫经常。</span></p><p><span></span></p><p><span>变谓之权，我们经常听到一个词，叫权变之术，就是不停地发生变化的，我们称之为权，怀其常经，而挟其变权，就是我们要怀着，一个不变的东西，但是不变当中，要经常发生变化，乃得为贤，一个贤明的人，要懂得在万事万物不变的规律当中，找到权变之方法，要懂得灵活地去应用，如此才能称为一个贤明之人。</span></p><p><span></span></p><p><span>儒家讲这段话，曾举过例子说明，一个人的嫂子，掉进了水里，如果按古人的礼节，男女授受不亲，是不可以触碰到嫂子的身体的，这时就要懂得去变通了，救人为第一要务，是要把她救上来的。</span></p><p><span></span></p><p><span>在道的运行规律的不变当中，我们要懂得去如何变通，我们今天学知识，是一样的。我们学了圣贤的文化，因为有不同的时代背景，教给我们的道是不变的，规律是不变的，可是在道和规律之内，我们要懂得去灵活应用，才能真正学到精髓。</span></p><p><span></span></p><p><span>比如，我们学《素书》，黄石公传给张良，是希望他辅佐一位有德行之人，得天下得民心的。如今，我们难道还要学《素书》去得天下吗？不是那个时代了，但是教给我们的修身为本，修好自己的道德仁义礼，不停地往生活当中，去应用的方法是不变的。</span></p><p><span></span></p><p><span>我们一定要懂得温故而知新，学习借鉴古人的智慧，这个是不变的，学来的智慧，要应用到符合当下的时代，符合我们的生活，符合我们的工作当中。可以去创新，有新的体悟，新的收获，新的智慧，新的应用，这个才叫变通。</span></p><p><span><strong></strong></span></p><p><span><strong>设变致权，所以解结。</strong>我们如果不懂得多变通，很容易就困在某件事情当中，出不来。至于我们的变通，能达到什么样的境界，取决于自己的智慧。刚才所举的嫂子落水的例子，这是最基本的变通。如果用在生活当中，用在工作当中，在遇到其他的事情，可能就不懂得变通了。</span></p><p><span></span></p><p><span>我们在学习圣贤的文化，可能我们也变通的没有那么好，所以我们看看整个这句话，变通从哪里来？推古验今，所以不惑。先揆后度，所以应卒。我们不停地去推古验今，先揆后度，我们的思维，我们的智慧，才会变得更长远。</span></p><p><span></span></p><p><span>我们学习的古之圣贤文化越多，这是经，不变的东西是道，我们在道的基础之上，再去不停地变通，所以我们的变通，能应用到什么程度，还取决于我们内在有多少知识，我们有多博学切问，学习的内容越多，越能懂得借古代的智慧，借助圣贤的智慧。</span></p><p><span></span></p><p><span>首先我们那个经是不变的，当懂了更多的道，才能在道的基础之上，去变通，变一定是合道的，不合道的变就成为小聪明了。如我们之前所讲，道前定，则不穷，只有我们符合道，在道的规律当中，不停地变通，这个才能真正地解结，否则沦为小聪明的时候，就会做出来很多不合道，不合德，不合仁，不合义的事情，最后一定是得不偿失的。</span></p><p/></div>"
},{
    "title": "《素书》第十四讲 本德宗道章",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第十四讲 本德宗道章</strong></span></p><p><span><strong></strong></span></p><p><span><strong>括囊顺会，所以无咎。</strong>括囊，是指的扎紧口袋，这里是指的心中有数，学会闭口，学会沉默，就像扎紧的口袋，不要轻易地露出来里面的东西。我们要做到心中有数，不该讲话的时候不要讲，要懂得顺势而为，所以不犯过错。 </span></p><p><span></span></p><p><span>无论在中国的历史当中，在我们平时的生活或工作当中，我们会因为讲了不该讲的话，不懂得顺势而为，给自己招来过错和祸端。尤其是在战国，秦汉时期更是如此，天下纷争，想要做一个谋士，更要懂得顺势而为，什么时候该讲话，什么时候不该讲话，要了然于胸的。</span></p><p><span></span></p><p><span>在我们的今天，也同样是适用的，一个智者，有德行的人，讲话一定懂得顺势而为，行事作风一定懂得顺势而为，不会逆流而上。</span></p><p><span></span></p><p><span>任何一个时代，我们都要懂得推古验今，借鉴古之圣贤的智慧，借鉴历史的兴替，结合我们的当下，看看我们当下的势是什么样的，当下处于什么样的环境当中，才能顺势而为。</span></p><p><span><strong></strong></span></p><p><span><strong>橛橛梗梗，所以立功。</strong>梗梗指的是稻草的梗，植物的茎，一棵稻草随风摇摆却不倒，就是因为有梗，有植物的茎在。橛橛梗梗，是坚定不动摇的样子，只有我们自己是坚定不动摇的样子，才能立功，立事，我们才能把事情做成功，我们才能去做利益很多他人的事情，立言、立德、立功。</span></p><p><span></span></p><p><span>如果我们不懂得不该讲话的时候不要讲话，不懂得顺势而为，没有坚定不动摇的样子，没有坚定不动摇的心志，我们怎么可能立言、立事、立功呢！</span></p><p><span><strong></strong></span></p><p><span><strong>孜孜淑淑，所以保终。</strong>孜孜不倦，勤之又勤，我们称为孜孜不倦。淑淑就是善良美好的样子，我们的行为是要勤之又勤的，我们的心地要始终保持善良美好的样子。</span><span>所以保终，因为我们心地是善良的是美好的，才能有善终，刚开始我们要保持淑淑的样子，这是善始一直保持的样子，这是善终。</span></p><p><span></span></p><p><span>整个这段话，我们连起来理解，我们自己要做到心中有数，讲话的时候知道什么该讲，什么不该讲。做事情的时候，懂得顺势而为，而内心是坚定不动</span><span>摇的，所以才能立功、立事，我们是勤之又勤，孜孜不倦的，又能保持内心的善良美好，保终如此才能有善始，亦有善终。</span></p><p><span></span></p><p><span>我们去看那些成功的人士，古之圣贤，成功人士的特质，通常都是坚定不移的，勤劳的，心地善良的，心怀美好的，都是有智慧的，都是博学的。整个这篇讲的求人之志，我们自己要想有什么样的志向，自己要去做什么样的人。</span></p><p><span></span></p><p><span>《素书》告诉我们很详细的方法，要想广知，我们就去博学。要想身心不被负累，不被牵累，我们要绝嗜禁欲。要想有善终，要保持内心的美好，孜孜不倦，勤之又勤。要想少犯过错，要懂得心中有数，口中沉默，懂得顺势而为，什么话当讲，什么话不当讲，该在何时讲。我们要想立功，立事，要有坚定不动摇的心念。</span></p><p><span></span></p><p><span>如何能增长自己的智慧，借鉴古人的智慧来验证当下的事情。我们要想让自己不颠倒，合道、合德，要去亲仁友直，亲近仁德的人，亲近古之圣贤的文化，交友 交正直的人，如此我们才能合道、合德。</span></p><p><span></span></p><p><span>这一篇所讲的都是成功的特质，都是优秀人身上所具备的特点，都是古之圣贤要教化我们的地方，也是我们自己该学习的地方。一句话总结‘求人之志章’，要想有善始善终，我们一定要勤之又勤，始终保持内心的善良和美好。</span></p><p><span></span></p><p><span>《道德经》讲：“慎终如始，则无败事。”我们一定要有善始亦有善终，很多人刚开始做事情，刚开始进入一个团队，或者刚开始经营一个生意，都有美好的心愿，都是想着做利益更多人的事情，只不过走着走着被利益所驱使，没有了坚定不移的心志，中间没有智慧，没有深谋远虑，而导致我们中途改了心志，改了目标，改了愿景。</span></p><p><span></span></p><p><span>我们一定要懂得慎终如始，则无败事，走到中间的时候，甚至走到快要终点的时候，还能保持最初的发心，还能保持最初的诚意，我们才能有善始，有善终。</span><span>道家一直都在讲功成身退，天之道，贯穿始终的是抱道，是让自己合其德，合其道，合其仁，合其义，合其礼，所以才会讲功成身退。</span></p><p><span></span></p><p><span>我们学习过很多历史典故，有的人刚开始是立了很多功的，但是最终未得善终，并没有得到一个美好的结果，就是因为不懂得功成身退的道理。刚开始出山的时候为了匡复正义，为了救天下黎民于水火之中，可是做完了事情以后，把这件事情忘掉了，忘记了最开始的初心，只是让天下不再暴乱，我们只是辅佐圣主去安天下，我们把这个初心忘记了，就不能全身而退。</span></p><p><span></span></p><p><span>无论做任何事情，都要懂得道家告诉给我们的道理，有善始，亦要有善终，一直保持内心的诚意，保持内心的美好和最初的发心，如此方可终保。</span></p><p><span><strong></strong></span></p><p><span><strong>本德宗道章第四，</strong>本德宗道，君子以德为本，何为本？最根本的东西，一个人想要立功、立言、立事，最根本的就是德。宗道以德为本，以道为宗，宗就是源头，道是源头，德是根本。</span></p><p><span></span></p><p><span>一个人要合道，合德，如此又有源头，有了源头，我们才会遵循道德规律，去修己，去做事情。我们以德为本，修自己的德行，我们才会不断地生成内在的仁、义、礼。</span></p><p><span></span></p><p><span>《素书》开篇讲，道、德、仁、义、礼，五者一体也，我们再把仁、义、礼去掉的时候，就剩下道和德，道是源头，德是根本。</span></p><p><span><strong></strong></span></p><p><span><strong>夫志心笃行之术，</strong>夫是助词，术是方法，志心，我们的志向，想达到什么样的心境，达到什么样的境界。笃行之术是告诉我们怎么去做，怎么才能达到的方法。</span></p><p><span><strong></strong></span></p><p><span><strong>长莫长于博谋，</strong>长，是长久，志心笃行，长久是志心是我们的志向，想让一件事情更长久，怎么做呢？告诉我们笃行之方法，我们要去笃行的是博谋，博就是更多，更广，谋就是谋划，我们要想让一件事情更长久，我们要更深远地，更广博地去谋划，深谋远虑，才可以长久。</span></p><p><span></span></p><p><span>我们修身亦是如此，如何才能让自己合其道，合其德，就是要懂得按道的规律，按照圣贤文化去修正我们自己，这就是笃行，当我们如此去笃行的时候，就会更长久。</span></p><p><span><strong></strong></span></p><p><span><strong>安莫安于忍辱，</strong>安，是内心的安定，内心的从容这是志心说。我们的志向，想达到安定从容的境界，如何去做呢？我们来思考在人生当中，什么时候心是最不安定的？是不是受到忍辱的时候，觉得自己委屈的时候，心就不安定了。别人误解我们的时候，心就不安定了。遇到不如意的事情，我们的心开始不安定了。</span></p><p><span></span></p><p><span>通常别人赞美我们几句或者鼓励我们的时候，其实心还是比较安定平和的，通常我们也会谦虚，“其实没有这么好了，我还要更加地努力践行。”可是我们受到别人的误解，受到了委屈，或遇到了生活当中不如意的事情，这时我们的心开始不安稳了，开始日夜惶恐。</span></p><p><span></span></p><p><span>比如，在企业或在团队当中也是一样的，当有一个人背后说我们很多不好的事情，如果无意当中被我们知道了，我们的心就开始不安稳了，他为什么要去说我呀？因为什么样的事情说的呢？他说我这件事情有多少人知道了？</span></p><p><span></span></p><p><span>我们的心开始不安稳了，所以告诉我们安莫安于忍辱，我们如果懂得修忍辱，在自己受委屈的时候，不如意的事情当中，能保持心境的安稳和平和，这时就没有任何事情可以影响到我们的心境。</span></p><p><span><strong></strong></span></p><p><span><strong>先莫先于修德，</strong>优先，先于，我们要想先于别人，要想事事优先，要想让我们自己比别人更有德行，走在别人的前面这叫先。先莫先于修德，修自己的德行，只有德才能让我们走得更远，才能让我们走在最前列。</span></p><p><span><strong></strong></span></p><p><span><strong>乐莫乐于好善，</strong>我们想追求快乐，追求喜悦，最大的快乐来源于好善，我们经常讲一个词叫乐善好施，施就是帮助他人，我们来体会，生活当中的那些快乐从哪里来？</span></p><p><span></span></p><p><span>比如，我们走在路上，有一个陌生人来到这里，找我们问路，该如何走？我们告诉给对方的时候，细细地去体会，这个时候我们的内心是喜悦的、是快乐的、是美好的。</span></p><p><span></span></p><p><span>在企业当中也是一样的，当我们帮助别人做点事情，看到对方受到了帮助，而露出来快乐或着喜悦的心情，我们这时是最有成就感的，觉得无论多么辛苦，都不会觉得累，我们的内在是美好的。最大的快乐莫过于做善事，做善行，我们做了更多的善行，所得到的快乐就会越多，内心也就会变得越来越美好，越来越富足。</span></p><p><span></span></p><p><span>我们看电视或者读书，或者在生活当中，观察越是善良的人，好像都是乐天派，每天没有那么多不高兴的事情，没有那么多抱怨的事情，好像永远都淡然中透着快乐，透着欢乐。</span></p><p><span></span></p><p><span>在小孩子当中，我们也特别容易看到这一点，孩子在帮助别人的时候，他那个时候的快乐是最简单，最单纯的，因为他没有任何过多的想法，也没有求任何的回报，所以露出来的快乐,是最简单，最清净的。</span></p><p><span></span></p><p><span>回到我们自己身上也是一样的，当我们如果做了一个善行，是为了求回报的，就开始变得不纯粹了。我们只是给对方指了指路，并没有要求任何回报，甚至对方的一声感谢都不需要，我们的快乐里面没有一丝的杂念，都是美好的，都是有成就感的。</span></p><p><span></span></p><p><span>所以《素书》告诉给我们，要想让自己保持快乐，让自己保持持续的喜悦，方法非常简单，就是去做善行，帮助他人不求回报。我们的快乐自然就会变得越来越多，我们的心地也自然会变得越来越美好，这是持续快乐的方法。</span></p></div>"
},{
    "title": "《素书》第十五讲 至诚明知足",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第十五讲 至诚明知足</strong></span></p><p><span><strong></strong></span></p><p><span><strong>神莫神于至诚，</strong>神形容的是一种力量，如有神助，像神一样有力量，那如何才能得到这种力量？至诚。当我们以至诚之心去做一件事情的时候，仿佛有神助一样。</span></p><p><span></span></p><p><span>举个生活当中的例子，比如，有的人做一件事情，他是非常至诚的，是非常努力勤奋的，我们就会讲这个人真的是神了，这个人做饭真的神了，这个人谈客户真的神了，这个人开车太神了。</span></p><p><span></span></p><p><span>我们为什么会形容这样的人神了呢？我们是感觉到他充满了力量，感觉他做事情是那么自如，那么自在，看着他永远都是认真专注的样子。所以《中庸》讲：“至诚如神”，当我们做一件事情，是至诚的状态，一切都是顺风顺水，如有神助。</span></p><p><span></span></p><p><span>反之如果我们一件事情做不好，就要停下来思考，因为自己的诚意还不足，自己还无法做到至诚，总是被困难所阻碍，总是被自己的惰性所阻碍，当我们有足够诚意的时候，任何事情都会变得简单。</span></p><p><span></span></p><p><span>我们学习圣贤的文化也是一样的，去修行也是一样的，去做事情也是一样的，当事情做不好的时候，我们看看自己的至诚之心有几分。</span></p><p><span><strong></strong></span></p><p><span><strong>明莫明于体物，</strong>我们想要成为一个明达的人，想有一颗明达万物之心，怎么办？体察万事万物，从我们观察万事万物当中，加以体悟而得出来的智慧。通常有智慧的人，我们说这个人通透明达，是因为他有智慧看清楚事物发展的规律。回到我们的人生当中，看看我们是不是懂得观察的。</span></p><p><span></span></p><p><span>我们观察一件事情，就会知道事情的原由和规律，我们去观察身边成功的人士，或者不成功的人士，我们看到他们身上不同的特点，不同的行为，不同的思维方式，就可以得到事物发展的规律。</span></p><p><span></span></p><p><span>我们推古验今，去看每个朝代的发展，每个朝代的兴替，就会知道什么样的事情是合道的，什么样的事情是不合道的，万事万物都需要我们自己用心来体察，我们体察的越多，悟到的越多，我们的智慧就会得到增长，就会变得明达。</span></p><p><span></span></p><p><span>孔子用来赞美舜帝的一句话，《中庸》：“舜好问好察迩言，隐恶扬善，执其两端，用其中于民”，迩是近处，舜帝经常去问，不仅是问，而且去观察身边的事物，观察身边的人，任何事情都会找到一个合适的度，持守中道，用于他人。</span></p><p><span></span></p><p><span>我们也是一样的，要懂得体察万事万物，找到一个合适的度去用，就会变成一个智者，变成一个明达之人。一个人的智慧不来源于书本上，书本上所学到的是知识，是告诉我们道的规律是什么，是圣贤所总结出来的智慧，我们要懂得用这些知识，再体察我们当下的万事万物，自己所总结出来的规律，</span><span>这个叫智慧。这个得出来的智慧是我们自己的，谁也拿不走。</span></p><p><span></span></p><p><span>陆游有两句诗：“纸上得来终觉浅，绝知此事要躬行。”我们书本上学来的道，学来的知识，总觉得是浅薄的。我们知道了做学问，修身要自己去躬行，还得自己去践行。</span></p><p><span></span></p><p><span>我们学习的圣贤文化，好比是一个指路的明灯，是一个导航，给了我们方向，告诉我们天地运行的规律，告诉我们为人之道，告诉我们如何去妙用，能用到什么程度，源于我们自己把它转化成了多少智慧。</span></p><p><span></span></p><p><span>如何转化的智慧？就是来源于我们体察万事万物，观察身边的人，观察身边的事情，观察身边的万物，所得出来的智慧，才会让我们成为一个明达的人。</span></p><p><span><strong></strong></span></p><p><span><strong>吉莫吉于知足，</strong>吉是吉祥，好的事情。生活当中发生了很好的事情，我们称为吉祥。好事情是从哪里来的？举个例子，我今天得到了一个心爱的杯子，我们觉得是好事情。我跟朋友说：“我今天得到一个杯子，特别好。”如果对方是一个不喜欢杯子的人，可能他就会说：“我以为多好的事情，原来只是一个杯子而已”。</span></p><p><span></span></p><p><span>再举个例子，假设我们今天从外面工作，拿了五千块钱回来，我们对我家里人说赚了五千块钱。家人可能会说，已经出去一个月了，才赚了五千块钱，是不是太少了。</span></p><p><span></span></p><p><span>好事的概念是怎么来的？是我们觉得它是一件好事情，它才是一件好事。如果我们不觉得它是一件好事情，它不能称为吉祥的事情。吉莫吉于知足，如果我们懂得知足的道理，任何一件事情都是好事情。</span></p><p><span></span></p><p><span>今天我们走到路上，看到一个美丽的花朵，太好了，它让我心情愉悦。今天我喝了一口热水，好舒服，正好我有一点冷，能有一口温水给我喝，太好了，很吉祥。今天我们出去办事情，别人给指点了一下方向，他可能只对我们讲了三句话，但是让我们少跑了很多路，太顺利了，还是好人多。</span></p><p><span></span></p><p><span>在我们心情顺遂的时候，懂得知足的时候，会发现，事事都是好事。每发生一件事情都是吉祥的，如果不懂得知足呢，好像发生的所有的事情都不让我们满意。今天我们出去办事情堵车了，太不顺了。今天我们出去工作，别人说了我几句，太不顺了。吉祥的好事情来源于，我们自己懂不懂得知足。</span></p><p><span></span></p><p><span>《道德经》讲：“知足知足常足矣。”我们要懂得知足，知足就能一直经常保持知足的状态，我们也经常讲知足常乐，当懂得知足的时候，事事都吉祥，每件事情都是好事，这个世界充满着良善，充满着阳光，充满着美好。如果我们不懂得知足，欲求永远是得不到满足的。</span></p><p><span><strong></strong></span></p><p><span><strong>苦莫苦于多愿，</strong>最大的苦来源于哪里？来源于多愿，欲求不满，我们有那么多的要求，有那么多的欲望，想要那么多的索取，所以我们会觉得苦，有求则苦，只要我们是有所贪求的，有所欲求的，就会觉得很苦，形成了鲜明的对比。</span></p><p><span></span></p><p><span>吉莫吉于知足，苦莫苦于多愿，所以苦和乐只在我们一念之间，如果我们懂得知足，每一件事情都是好事，都是吉祥的。如果我们自己有过多的欲求和贪求，无论得到与否，我们都是不满意的，都会觉得很苦，就会不停地抱怨。索取这件事情，是好事情，还是不好，只在我们自己懂不懂得知足。当我们没有过多的欲求，没有过多的贪求，懂得知足的时候，每天都是吉祥的。</span></p><p><span><strong></strong></span></p><p><span><strong>悲莫悲于精散，</strong>最可悲的事情是什么？精神涣散、心如死灰、没有了希望，我们经常说，我们要集中精神去做一件事情。那我们看看可悲是什么样的状态？一个人贫穷并不可悲，可是一个人贫穷，他还不努力，也不去前行，不去努力地工作，让自己变得更好，这个时候我们就会说，这个人真的很可悲。</span></p><p><span></span></p><p><span>比如说，一个人感情经历了创伤，他是精神涣散的，心如死灰的状态，伤痛欲绝。经历了感情的失败并不可悲，可悲的是什么？自己不愿意走出来，沉浸其中。我们经常会说，要调整精神，让自己从中走出来就好了，所以最可悲的是不愿意出来，不能把自己的精神集中起来，努力地前行，所以人生最可悲的事情，莫过于失去希望，不能调动自己的精神，不能让自己从一切的困境当中走出来，这个才是最可悲的状态。</span></p><p><span></span></p><p><span>比如，一个人没有学问，没有学识，这个并不可悲。可悲的是我们知道自己没有学识，没有学问，可是自己不愿意努力前行，不愿意集中精神去学习，这个才是最可悲的。</span></p><p><span></span></p><p><span>何为涣散？就是不愿意拿出精力去改变自己的现状，而每天只是自怨自怜，这个才是最可悲的。所以当我们遇到事情的时候，一定要打起精神，让自己去改变，让自己去前行。</span></p><p><span></span></p><p><span>整个这篇告诉我们，志心笃行之术，我们的志向要想达到什么样的境界？我们的心要想达到一个什么样的境界？我们要笃行。比如，我们不想让自己活成可悲的样子，我们就要笃行，集中自己的精神走出当下的困厄。</span></p><p><span></span></p><p><span>我们不想受那么多的苦，怎么办？笃行，少一点欲求，少一点索取。我们要想变得吉祥，很简单的方法，我们要懂得知足常乐。要想变得明达，我们要学习圣贤的文化，要学习道的规律，用来体察万事万物，我们自然的就会增长智慧，变得明达。</span></p></div>"
},{
    "title": "《素书》第十六讲 莫自恃多私",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十六讲 莫自恃多私</strong></span></p><p><span><strong></strong></span></p><p><span><strong>病莫病于无常，</strong>通常我们是怎么得病的，比如，原本有一个人非常的爱我，本来是爱的，突然不爱了，这就是无常。所以一切都是无常的，一切都是变化的。那个人不爱我们了，我们病倒了，身体开始不舒服，开始茶饭不思，神不守舍，我们的心病了。</span></p><p></p><p><span>原本我们的生意做得很好，突然之间发现生意不好了，无常来了，我们的精神开始涣散，又开始病了。我们身边本来有一个很好的朋友，突然之间他和我们走散了，我们开始病了。甚至有很多人家里养了一个宠物也是一样的，这个宠物的离去，我们开始病了。</span></p><p></p><p><span>《素书》告诉我们，病莫病于无常，最大的病，莫过于我们接受不了事实的变化，我们守着经常不变的那个东西，认为它是实有的，我们守着变幻莫测的世间万物，认为它是一种常态，可是当它变化的时候，我们就身心痛苦，开始病了。</span></p><p></p><p><span>本德宗道第四章，前半部分和后半部分告诉我们两个方向，前半部分告诉我们要如何努力的方向。比如，我们要想让事情变得更长久，要善于博谋。我们要想变得安定自若，我们要修忍辱，忍辱是我们的方向。</span></p><p></p><p><span>我们要想得到长久的快乐，我们要懂得乐善好施，是我们的努力的方向。我们要想变得明达，我们去体察万物，从万物当中去悟得道的运行规律，是我们努力的方向。我们要想变得吉祥如意，事事顺遂，我们要懂得知足，知足是我们努力的方向。</span></p><p></p><p><span>上半部分是我们要努力的方向，下半部分是不要这样去做。苦莫苦于多愿，不要那么多的欲求，我们才不会觉得苦。悲莫悲于精散，我们最可悲的地方是我们没有了志向，是我们的精神涣散，告诉我们人到什么时候都不要精神涣散，要充满着希望和斗志，要努力地向前才不会活成最可悲的样子。</span></p><p><span><strong></strong></span></p><p><span><strong>病没病于无常，</strong>告诉我们要想身心安泰，少得病痛，我们要了解一切都是无常的，一切都是在变的，世间万物都在发生变化。人的感情喜好，所有的东西都是在变的，不要守着那个常态，当我们认为ー切都是正常的，我们的身心才是舒适的，才不容易得病。</span></p><p></p><p><span>《道德经》讲:“飘风不终朝，骤雨不终日，孰为此者？天地。天地尚不能久，而况于人乎？”整个自然规律也是这样的，狂风暴雨不会一直持续的。孰为此者，是天地让刮风和下雨的。天地尚不能让刮风下雨这件事情变得长久，而何况于人乎，而何况于我们。</span></p><p></p><p><span>《道德经》这段话在告诉我们，自然规律都是一直在变的，都是无常的，所有的事情都在持续地发生变化，都是川流不息的。我们也在每一秒钟老去，每一分钟老去，我们的感受也在时时刻刻地发生变化，我们的认知也在时时刻刻地发生变化，我们的喜好也是时时刻刻地发生变化。</span></p><p></p><p><span>比如，我们上一个月喜欢什么类型的人，有可能这个月就开始发生变化了。有可能一年前，我们喜欢吃什么样的食物，现在也在发生变化。两年前我们喜欢穿什么样的衣服，现在也在发生变化。所有的东西都是在变的，我们要深刻地明白和体悟这个道理，所以我们不再墨守着不变的，以为常态的东西，我们才不痛苦，否则一定是身心得病的，所以最大的病莫过于此。</span></p><p></p><p><span>短莫短于苟得，苟得，不择手段的，本该不是我们的东西，我们侥幸得到了这叫苟得，告诉我们最短的事情，最短的得到莫过于侥幸得到的，所以我们不要抱着侥幸心理，去占有和得到本不该属于我们的东西。</span></p><p></p><p><span>《论语》讲：“知及之，仁不能守之，虽得之，必失之。”如果我们的智慧是可以得到某些事情或者得到某些东西，得到某些人的，可是我们没有足够的仁德去守住，虽得之，必失之，本来不属于我们的东西和我们不匹配的，即使我们费尽心智，费尽力气得到了，可是最终依然是守不住的。所以说最短的莫过于苟得，得到了我们不该得到的东西，会发现是枉费心机的。</span></p><p></p><p><span>在社会上，我们经常看到这样的现状，有的人费尽心思，虽然暂时得到了，可后面的时候，会出问题的，甚至老无所依，或者家道中落，都是告诉我们这样的道理。</span></p><p></p><p><span>要想长久，我们还是要合道修其身的，要遵循着道、德、仁、义、礼，如此才可能长久。否则所得一定是短暂的，不光是短暂，而且我们会提心吊胆的，当我们做了一些我们自己明知道不该做的事情，当我们做了一些自己内心并不坦然的事情，我们就会活得诚惶诚恐，这个时候不光无所得，反而有所失。</span></p><p></p><p><span>我们得到的是短暂的，虽然得到了，可是我们反而失去了内心的安宁，失去了内心的光明，失去了内心的坦荡，所以我们经常讲，人莫过于心安，我们心安才能理得。</span></p><p><span><strong></strong></span></p><p><span><strong>幽默幽于贪鄙，</strong> 幽，是最幽暗的，见不得光的。贪，是贪着、贪图。再加上ー个鄙字，手法手段又是卑鄙的，最幽暗见不得光的，莫过于用卑鄙的手段去贪图，去贪着，去拥有，占有和索取。</span></p><p><span><strong></strong></span></p><p><span><strong>孤莫孤于自恃，</strong> 孤，我们经常听到一个词一意孤行，为什么会一意孤行？因为自视甚高，这个事情我们非常有经验，我们是很懂的，怎么会听得进去他人的意见呢！这个时候就变孤了，一个人只要有自恃的地方，就会变成孤。</span></p><p></p><p><span>比如，当一个人觉得自己很有学问，很有修为，则听不进去别人所讲的话，学不进去他人的知识。会认为我们这么高的修为，这么有学问，怎么会理他们呢，是不是变孤了？做一件事情也是一样的，我们觉得自己技术很强，觉得自己很厉害，怎么会和他人探讨和交流呢，变孤了。</span></p><p></p><p><span>我们去看生活当中，工作当中，生意当中，在人际交往的过程当中都一样的，只要有自恃的地方，我们在自恃的地方就会变得孤高，要想不让自己变得孤怎么办？一定不要自恃，无论我们拥有什么，无论我们当下具备什么，都要懂得随时放空，都要懂得处下。</span></p><p></p><p><span>道家的文化讲：“江海之所以成百谷王者，以其善下之。”也是在讲处下的境界。“上善若水，水善利万物而不争，处众人之所恶，故几于道。”水利了万物，但是又不争，就是在处下，是最接近于道的。</span></p><p></p><p><span>《道德经》讲:“高以下为基。”什么叫真正的高？是以下为基的。比如，我们看以前的帝王都怎么称呼自己？孤，寡人，这都是在告诉我们要懂得处下，只有处下的人，才能真正地拥有天下。水低为海，人低为王。</span></p><p></p><p><span>《尚书》讲：“满招损，谦受益。”一个人懂得谦逊，谦虚，就是处下的状态，当我们处下的状态，处下的心境就不会自恃，同样自恃甚高的人也就不懂得处下。</span></p><p></p><p><span>举个例子，假如我们是一个有身份的人，怎么会和他们一起玩耍，我们是一个有修为的人，怎么会和他们一起交流探讨？自恃的东西都出来了。我们是一个很富足的人，怎么会和他们如此贫瘠的人交朋友，这都是自恃，就变得孤独了。在一个企业当中也是一样的，我们很有能力，怎么会理他们这些没有能力的人，这个时候就变孤了。</span></p><p></p><p><span>很多人会讲:“自古圣贤多寂寞。”不是说高处不胜寒吗？我们往上一个境界看，哪一个圣贤之人又是孤独的，他的孤独是来源于心里的境界，可是他的一生所为，并不孤独。老子孤独吗？孔子孤独吗？如果是孤独的，他们又如何去度化他人呢！他们的内心的境界是孤独的，当把这个境界破掉的时候，是可以和任何人打成一片的。</span></p><p></p><p><span>老子的大道学说，那个时候是讲给百姓听的。孔子的儒家学说，也是周游列国到处去讲给百姓听的。如果自己是孤高的，认为自己很有学问，认为自己是一个圣贤，又如何去教化于民呢？所以我们看到的那个孤高，圣贤自古多寂寞，不是形容一个人的行为，而是他内心的境界，虽然不被人理解，也会依然坦荡光明的，做自己该做的那些事情。</span></p><p></p><p><span>所以我们要懂得，圣贤况且如此，我们一定不要自恃过高，不要认为自己很有学问，自己很有修养，自己很有才华，一旦我们这样认知的时候，就会很难进步了，并且会变得孤立，没有人喜欢和我们交往。黄石公把《素书》传给张良之时，就在说:“一定不要自恃，否则自己是孤的，没有人和你走在一起，别人不愿意接近你，又如何去帮助更多的人，又如何去妙用？</span></p><p></p><p><span>所以我们去看心怀天下的人，心怀志向的人，一个懂得修身的人，一定不是在用个性做事情和思维的人。如果说：“我就是这样有个性，你爱理不理，你不跟我走在一起就算了。”这怎么能是心怀天下，心怀大志之人的思维。所以一定要懂得这个道理，不要自恃过高，如此才能不停地去成长，不停地去修正自己，让自己处于众人之中。</span></p><p><span><strong></strong></span></p><p><span><strong>危莫危于任疑，</strong>最危险的事情莫过于在用别人，但是却保持着怀疑的态度。我们经常讲，用人不疑，疑人不用，就是这个道理。当我们在任用一个人的时候，又是怀疑他的，他做事情我们是不放心的，时时刻刻地提防着他，如此我们也累，他也累，很危险的，并且对方一定感知得到。</span></p><p></p><p><span>我们读历史也是一样的，当一个人在任用对方的时候，一直保持着怀疑的态度，对方一定感受的到，最后这个人就会真的叛变通敌了，因为一直对他的怀疑，对方会清清楚楚地感知到，这个时候对方就会想了，既然是怀疑我的，既然如此的不信任我，结果已经形成了，那我何不就叛变，所以这是一个最危险的事情。</span></p><p></p><p><span>我们要切记只要是我们愿意用的人，自己想用的人，我们就以诚心相待，是可以感化对方的。这时大家都会讲仁，讲义，久而久之对方自然会受到我们的感化，即使对方初始之时，对我们有一些不好的想法，不和我们一条心，我们一直用仁 义去感化，他终究会变成和我们一样。</span></p><p></p><p><span>信足以一异，是因为没有产生足够的信任，当产生足够的信任，一定是可以统一思想，统一行为的。所以千万不要用怀疑的态度去用人，去做事，否则极其危险。</span></p><p><span><strong></strong></span></p><p><span><strong>败莫败于多私，</strong>这句话可谓是本德宗道章的点睛之笔，我们最大的败莫过于多私，当一个人开始自私自利的时候，就是失败的开始。那我们看败什么？什么都会败，败德、败仁、败道、败义、败礼、败坏我们做的那个事情了。</span></p><p></p><p><span>我们一旦自私自利的时候，就有损自己的德行了，不是败德吗？当我们自私自利的时候，是不符合道的规律的，不是在败道吗？当我们是自私自利的时候，我们怎么会有仁爱之心呢？</span></p><p><span>败仁，当我们是自私自利的，怎么会去担当和奉献呢，把义又败了。</span></p><p></p><p><span>当我们是自私自利的，怎么可能用出来礼呢？即使有，也是表面的，别人一看就知道了，虚假的礼，没有力量的，反而会让别人产生反感和厌恶。只要我们是自私自利的，会败掉我们当下所拥有的东西。如果我们正在做一件事情，是自私自利的，最终会败坏掉这件事情的。当我们自己是自私自利的，我们身边的人都会跟着变成一样自私自利的。</span></p><p></p><p><span>一个团队如果是自私自利的，怎么可能做出来事情，最后会把这个事情亏空，所有的人都会变成蛀虫了，事情必败无疑。同样我们反过来思考，如果这一群人都是讲仁的，讲德的，讲义的，人人都有德行，都有仁爱之心，都讲担当和奉献，什么事情做不成呢？什么事情又做不好呢？只要是自私自利，这件事情就像一个蛀虫一样，终究是我们修身的蛀虫。</span></p><p></p><p><span>《素书》第一章告诉我们道、德、仁、义、礼，五者一体也，告诉我们欲为人之根本，这是为人的根本，人生最重要的事情是什么呢？有人才有生，有人才有一切，生活、工作、事业、价值、理想等等。</span></p><p></p><p><span>所以我们人生最重要的事情，一定是做好人，作为人的根本就是道、德、仁、义、礼，不可缺也。所以我们永远告戒自己不要自私自利，自己做事情一定要懂得顺道而行，顺势而为。</span></p><p></p><p><span>一定要不断地修自己的德行，要修自己的仁爱，要修自己的义气，要用礼去做所有的事情，这个才是为人之本，也是我们人生可以体现价值和意义的根本之所在。如果没有一个健全的人格，那我们又如何过好我们的人生呢？</span></p></div>"
},{
    "title": "《素书》第十七讲 遵义章第五",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十七讲 遵义章第五</strong></span></p><p></p><p><span>遵义章第五，着重讲一下义，《中庸》讲：“义者，宜也，尊贤为大。”做合时宜的事情叫作义，我们怎么才能做符合时宜的事情，去做正义的事情？尊贤，尊重贤德的人，我们自然受贤德之人的影响，才能做出来合时宜的事情。</span></p><p></p><p><span>遵义章，我们要遵循着合时宜的规律去做事情，告诉我们为人处事，建功立业的方法，我们一定要去合乎于时宜，不能做不合道，不合德，不合适宜的事情。</span></p><p></p><p><span>遵义章是告诫篇，告诉我们不要去做什么样的行为，不要去做什么样的事情，才能符合时宜。这里讲的不合时宜的事情，不是善恶，而是告诉我们更多，更深层次的，我们需要遵循的规律，不要触碰不合时宜的事情，否则很难建功立业，很难为人处事。</span></p><p><span><strong></strong></span></p><p><span><strong>以明示下者暗，</strong>第一个是告诉我们处上位的人，时时刻刻地彰显自己的高明，以自诩高明，对待下位的人，就是不合时宜的。告诉我们导致的结果是暗，什么叫做暗？看不到，听不到，见不得光，称为暗。比如，在我们的生活或工作当中，如果一个处上位的人，时时刻刻都在彰显自己的高明，处下位的人就会变得无能，没有能力去解决问题，没有能力去做事情。</span></p><p></p><p><span>处下位的人看到处上位的人都是高明的，都是自以为是的，有真话也不敢讲，所以我们看不到事情的真相，也听不到事情真实的声音，也了解不到客户真正的需求。我们去看历史的发展也是一样的，如果一个君主，处处在彰显着自己的高明，下面的群臣就开始变得不作为，这个时候就听不到民众的声音，就是暗的状态，见不得光的。</span></p><p></p><p><span>再举一个更容易理解的案例，在我们的生活当中，家长和孩子特别容易出现这种问题，有的家长觉得自己很聪明，很高明，觉得孩子不懂事，不成熟，我们会处处做孩子的主，孩子要吃什么，我们去给规划，孩子买什么样颜色的衣服，要我们来决定，孩子买这个颜色衣服不行的，不耐脏，这个颜色这么难看，不适合，久而久之，导致孩子没有自己的主观判断和思维方式。</span></p><p></p><p><span>而且孩子也不再和我们吐露心声，他心里想的不会跟我们讲的，因为孩子一讲，我们就会以自以为高明的思维方式，把他所有的东西全部压倒。孩子会变得不爱讲话，和家长之间就形成了隔阂，没有交流。很多家长又开始抱怨了，这孩子什么都不跟我讲，我也听不到他内心的声音，这个就是暗了。</span></p><p></p><p><span>处上位的人，一定要懂得以仁爱、平和、谦卑，去对待处下位的人。我们人生当中处处都有上位和下位的关系，家长和孩子一个上位，一个下位。工作当中，领导和员工之间一个上位，一个下位。朋友之间也是有上位和有下位的。</span></p><p></p><p><span>刚才我们讲的上位和下位是一种客观的事实，那我们在讲心里的上位和下位，同样是朋友相交，当我们特别尊重一个人的时候，这个人在我们心中的形象就变得高大了，我们所尊敬的这个人就是处上的。想象一下，我们尊敬的那个人是处上的，如果他时时刻刻都在显示着自己的高明，我们就不再尊敬了，也不会讲真实的声音，这个就是暗。</span></p><p></p><p><span>所以我们切记这一点，无论何时，我们都要懂得仁爱、谦和地对待他人，不要彰显自己的高明，否则我们就会骄傲自满，看不到事情的真相，开始变得自以为是，以高明的手段去示下，就是不合时宜的，这是遵义章所要告诉给我们的内容，要遵循事物发展的规律。</span></p><p><span><strong></strong></span></p><p><span><strong>有过不知者蔽，</strong>有过不知，我们自以为高明的时候，怎么会知道自己的过错，看不到啊。永远认为自己是对的，自己的标准才是正确的，只有我们讲的话才是有道理的，只有我们的方法才是最管用的，这个时候我们是看不到自身过错的。</span></p><p></p><p><span>《道德经》讲:“知人者智，自知者明。”我们要有自知之明，自知之明从哪里来，从不断地学习当中来，我们才知道自己身上有哪些不足，自以为高明的人很难学进去新的东西，学习以后不懂得修身，而是学来要求他人的，就没有了自知之明，没有自知之明者蔽，蔽就是隐蔽，我们自己看不到，被遮挡住了。</span></p><p></p><p><span>当我们不断地学习，不断地修行以后，我们细细地思索，是不是发现自己原来有很多的过错和不足，但是在没有学习，没有修行之前，是不是遇到问题都是别人的过错，都是他人的问题，而看不到自己之非，看不到自己之过错。</span></p><p></p><p><span>《太上感应篇》、《了凡四训》都是告诉我们哪些是过错，哪些事情是不对的，我们要如何去改过，只有我们不断地学习，我们才能看到自身的不足，只有我们看到了自身的不足，不断地改自己的过错，我们才不被遮挡，如果我们是隐蔽的状态，遮挡的状态，看不到自己的过错，这个是很危险的，终究要酿成大错的。</span></p><p></p><p><span>在生活或工作当中，到处都是这样的案例，平时我们不懂得修正自己，看不到自身的问题和过错，被遮挡住了。</span></p><p></p><p><span>久而久之，当有一天，我们发觉的时候，我们的感情已经失去了，生意已经失败了，身边的朋友已经离开了，孩子已经变得不听话了，听不进去我们说的任何东西，也不对我们敞开心扉了，我们是后知后觉的状态，所以暗和蔽都是很危险的，切记不要以高明示下，不知过错，导致的结果一个暗一个蔽，终究会酿成更大的错误。</span></p><p><span><strong></strong></span></p><p><span><strong>迷而不反者惑，</strong>有一个词叫做痴迷不悔，痴迷不悟。当我们痴迷，还不懂得返回，深深地痴迷于其中，导致的结果就是惑。惑是惑乱，惑乱于心，心性就开始变得乱了。</span></p><p></p><p><span>举个例子，比如一个人如果过度地痴迷于财，就会不停地为了财这件事情做出很多不得当的行为，就开始乱了心性，乱了心智。别人就会说:“这个人为了赚钱，真的是不择手段”，就是乱了心性了。</span></p><p></p><p><span>我们再看看痴迷于情的人，是不是也是如此？当一个人痴情的时候，就会做出来很多疯狂的举动，这个时候别人看得一清二楚，已经乱了心性了，做的事情已经没有了自己往昔的样子，这个时候就乱了。</span></p><p></p><p><span>有的人痴迷于游戏的，迷在游戏当中，不懂得返回的时候，工作也不好好做了，家庭也不管了，自己该尽的责任也不尽了，每天痴迷于游戏当中，乱了自己的心性。所以无论我们迷在任何事情当中，都会导致自己的心性变得惑乱，所以我们要懂得迷途知返。</span></p><p></p><p><span>观察我们自己的生活当中，还有对哪些事情是特别迷恋的，要懂得及时觉醒了，全身而退，否则一定会祸乱于心，导致更偏激的行为和事情发生。</span></p><p><span><strong></strong></span></p><p><span><strong>以言取怨者祸，</strong>说话不谨慎，以言语招来很多的抱怨，终究会惹来祸端。看看我们平时生活当中是不是这样的，有多少人不懂得谨言慎行，不懂得注意自己的说话方式，不知道什么话当讲，什么话不当讲，只逞一时口舌之利，而招来了很多别人的怨言，而不自知，实则已经埋下了祸端。</span></p><p></p><p><span>观察我们生活当中的朋友，观察人生当中的事业伙伴，看看我们身边的同事，上下级的领导关系，有多少人是被我们的言语所伤，而我们自己不自知的。</span></p><p></p><p><span>今天我只为了争论一个是非对错，讲了很多话已经得罪人了，对方虽然不动声色，但是已经埋下了隐患，当有一天时机合适的时候，墙倒众人推，必然引来祸端。我们一定要懂得谨言慎行，该讲的话讲，不该讲的话不要讲，伤害他人的话不要讲。</span></p><p></p><p><span>令与心乖者废，我们发出去的命令，与自己的内心是违背的，结果就是废掉。举个例子，比如我们在一个团队当中，今天发布了一个政令，发布了一个命令，或者发布了一个规定，而这个事情和我们内心是不相匹配的，是相违背的，这个时候很难执行下去的。</span></p><p></p><p><span>比如，我们下达了一个计划，我们自己看到这个计划和目标本身，就明白是达不到的，但是依然下达了这样的规定目标或者命令，会发现结果一定是废掉的，执行不下去的。</span></p><p></p><p><span>我们再举个例子，当我们自己下一个命令的时候，还要看所去施行的人，他的心和这件事情相不相符合，可不可以做得到，如果我们能清楚地知道对方是做不到，所要下达的这个命令和他就是相违背的，结果就是执行不下去，废掉了。</span></p><p></p><p><span>我们通过不断地学习，自己是一个明达有智慧之人，我们所讲的每一个政令，所下达的每一个规定和自己的内心是相应的，不相违背，又能看到和他人的当下是相符合的，如此才能执行的下去，否则执行不下去的结果，必然是废掉。</span></p><p></p><p><span>比如，在咱们虚空济也是一样的，常住学生一般在学习一段时间以后，才对他们有要求，比如要过午不食了，不要吃零食。</span></p><p><span>为什么要等大家学习一段时间以后，才有这个要求？因为这个时候他是能做到的，如果刚来的时候，就这样去要求他，是做不到的，执行不下去，就会怎么办？偷着吃。</span></p><p></p><p><span>在任何一个团队当中都是一样的，因为和他当下的心是违背的，他还没有达到那样的心性和境界，这个时候我们所说的话，对方是很难执行下去的，结果就是废掉。</span></p><p></p><p><span>如果我们懂得，或知道每个人的成长，到了一个什么样的阶段，我们再对他有一个相应的要求和规范，他稍一努力是可以做到的，所以这个规定才成。否则就会造成彼此的痛苦，下令者会觉得很痛苦，他怎么就是不听呢，听令者也会觉得很痛苦，我做不到，我只能偷着去做，那怎么办？只能是执行不下去，结果就是废掉了。</span></p><p></p><p><span>所以这个是需要有智慧的，首先我们要做到和自己的心是不相违背的，这件事情我能做到，下发这样的规定，如果下令者自己本身都不能遵从，就不要去讲这样的话，不要去做这样的事情。我们还要去看，执行之人当下的心性，是不是和我们要下达的令是相应和的，不要相违背，这个时候我们说的话才更有力量。</span></p><p><span><strong></strong></span></p><p><span><strong>后令繆前者毁，</strong>繆就是前后完全不统一，我们下的令前后完全不统一，相违背的结果必然是毁掉的。</span></p></div>"
},{
    "title": "《素书》第十八讲 莫慢其所敬",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十八讲 莫慢其所敬</strong></span></p><p><span><strong></strong></span></p><p><span><strong>怒而无威者犯，</strong>发怒但是没有威严，必然会遭到别人的侵犯或冒犯。威，是威严，威仪。威严从哪里来？首先一个人如果做的事情是正义的，讲的话是正义的，自带威严。</span></p><p><span></span></p><p><span><span>《</span>论语》讲：“君子不重则不威，学则不固。”君子不重就不威，自修自重才能有威严。在生活当中，我们也经常会讲一句话，当一个人做的事情，如果是不合时宜的，我们通常会讲请您自重，就是自己要自重，要注意自己的行为了，一个君子只有懂得自修自重的时候，才有威严，才有威仪。</span></p><p><span></span></p><p><span>怒而无威。我们自己是发脾气的，是有怒火的，但是又没有威严，你说的事情又不是正义的事情，你讲的又不是正义的言语，你又不懂得自修自重，威严从何而来呢！所以怒而无威，我们只是发脾气，发怒而没有威严，这个时候所导致的结果，就会遭到别人的侵犯和冒犯。</span></p><p><span></span></p><p><span>举个生活的例子，即使我们是一个领导，经常发怒发脾气，讲的话不合正义，又没有道理，就会有人当面来顶撞我们，是不是一种冒犯，即使对方不当面顶撞，背后对我们议论纷纷或者奋起反抗，是不是侵犯和冒犯，所以我们一定要懂得不要无缘无故地发怒，不合正义，又不合正道，我们又没有自我羞耻，而只是靠发脾气,来彰显我们的位置，必然会得到遭人侵犯的结果。</span></p><p><span></span></p><p><span><span>即使我们对自己的孩子是一样的，我们讲的话有没有正义，是不是义正言辞的，自己有没有做到，孩子也是清楚的。</span>举个例子，在生活当中，如果我们每天打游戏，自己抱着手机不放，我们对孩子发怒，发火，孩子也不听，即使没有办法，他听了。他心里也会默默地产生怨言，久而久之很危险的，他必然要当面顶撞于我们，所得到的结果就是被侵犯，被冒犯。</span></p><p><span></span></p><p><span>我们再反过来理解，当一个人自己是自带威严的，我们是自修自重的，讲的话是义正言辞的，不怒而威。我们不需要发脾气，不需要发怒，自带威严，别人一看到，自然会产生敬畏之心。这个时候对方才是心服口服，心甘情愿的，否则终将埋下祸患。</span></p><p><span><strong></strong></span></p><p><span><strong>好众辱人者殃，</strong>众，是很多人，好众，是当着很多人的面侮辱他人，得到的结果必然是殃，就是有灾难的。我们如果当众去侮辱一个人，对方心里会产生怨恨，虽然当时可能没有发作，由于某种原因或者我们处于上位，或者他现在人单力孤，可是心里会有怨恨，这种怨恨就会导致他要找机会报复的。</span></p><p><span></span></p><p><span>好众辱人，这个辱，区别于指责和批评，比如，我们看到别人的过错，去指责和批评，还不至于达到辱的境界，达到辱相当于伤害对方的人格，伤害对方的尊严，伤害对方最重要的底线，这个称为辱，必然会招致灾难的，我们不断地学习圣贤文化，很少当面指责他人，尤其是平级的关系和对上级的关系。</span></p><p><span></span></p><p><span>民间有一句谚语：“当面教子，背后教妻。”我们教孩子可以当面去讲，教妻子，这个‘妻子’可以再广泛一点，就是我们的朋友，亲属，同级的关系，都不要当面去讲对方太多的过错，而是要背后默默地去讲。</span></p><p><span><strong></strong></span></p><p><span><strong>戮辱所任者危，</strong>戮是杀戮，辱，是侮辱，我们自己所任命的贤臣重臣，既然是自己所任命的，说明他是有一定的位置的，是有一定的高度的。我们如果随意杀戮和侮辱，与对方导致的结果是人人自危，很危险的。</span></p><p><span></span></p><p><span>举一个生活当中的例子，比如，在一个团队当中，我们认命的高管，自己却当众侮辱对方，或者我们当着其他人的面，数落和侮辱我们所任命的人，看似好像显得我们有多高明，而得到的结果就是人人自危。</span></p><p><span></span></p><p><span>其他人这个时候心里也会想，我们这个老板，他自己任命的人，背后还讲这样的话，这个人跟了他这么多年，还有如此多的看法，甚至还会侮辱于他，何况是我们呢。这个时候人人自危的，每个人都在担心自己的将来，都在担心自己的付出，都在担心自己的前途。</span></p><p><span></span></p><p><span>历史也是一样的，当一个君主随意地杀戮和侮辱一个重臣的时候，其他人都是看在眼里的。“我们的皇帝陛下，如此重臣都随意地杀戮和侮辱，那我们又算什么呢！”这个时候人人自危，朝局就会动荡。</span></p><p><span></span></p><p><span>因为讲的事情是没有正义的，如果确实是他所犯的错误，不是随意地杀戮，也不是随意地侮辱。况且一个有智慧的人，有仁爱之心的人，怎么会去侮辱他人呢？都是以宽容的心去对待每一个人，希望每一个人变得更好，所以这里用的是戮和辱，都是极其严重的字。我们生活当中切记这个辱字，不要去做侮辱他人的事情，更何况是我们自己所任命的人。</span></p><p><span><strong></strong></span></p><p><span><strong>慢其所敬者凶，</strong>怠慢本应该敬重尊敬的人，导致的结果是凶，就是不幸。在人生当中我们需要敬重的人有很多，比如我们的父母，我们的老师，我们的领导，曾经帮助过我们的朋友。</span></p><p><span></span></p><p><span>我们做任何行业，我们的衣食父母，往圣的先贤，都是我们该敬重的人，因为救我们的慧命。各行各业在付出的人，都是我们该敬重的人。再来延伸，一个有君子风范的人，一个有仁爱之心的人，是要敬重万物的。</span></p><p><span></span></p><p><span>慢其所敬者凶，我们本应该敬重的人，却很傲慢地对待他，导致的结果就是不幸的。举个例子，假如我们不敬重领导，我们的结果会好吗？我们不懂得敬重先贤，我们怎么会得到他的智慧呢？我们不懂得敬重父母，何来的孝呢？我们不懂得敬重比我们优秀的人，我们怎么可能变得优秀呢？我们不懂得敬重他人，这个时候自然就会升起傲慢之心。</span></p><p><span></span></p><p><span>为什么延伸讲，我们要敬重万事万物，敬重对治的正是傲慢，只要我们心怀敬畏，就不会产生傲慢之心，结果自然是吉祥的，我们的心性才是更良善的，更光明的。一个人对万事万物都怀着敬畏之心，不做恶事，我们的心性也会变得更平和，不忍心去伤害任何人，也不忍心去伤任何一个物品，我们的仁爱之心就会不断地扩大，不断地增长。</span></p><p><span></span></p><p><span>遵义章是在告诫我们，什么事情是不能做的，我们要遵循着这种规律去做合时宜的事情，去做正义的事情。傲慢地对待应该敬重的人，会导致的结果是凶，是不幸的。我们不能去当众侮辱他人，给自己招来很多祸端。不能去杀戮和侮辱自己所任用的人，会导致人人自危。说话要谨言慎行，不要去给自己招惹怨恨。</span></p><p><span></span></p><p><span>我们自己所下的政令，所下的规定，一定要与自己的心相应，一定要与他人当下的心意相合，如此我们所讲的话，才能执行下去，才能让他人心服口服。当我们发觉自己痴迷于某一件事情，某一种爱好的时候，一定要懂得及时返回，否则就会祸乱心性，导致更多错误的行为。</span></p><p><span></span></p><p><span>我们要多学习圣贤的文化，不要有过不自知，当我们没有自知之明，看不到自身的过错，就会被遮挡住，导致我们自己的无明，导致自己无法前行。很多事情当我们发现的时候，结果已然形成，很难挽回，这都是因为我们看不到自身的过错，找不到事物发展的痕迹，就开始怨恨和抱怨。</span></p><p><span></span></p><p><span>他怎么突然不爱我了？我的生意怎么突然变得不好了？这个孩子怎么突然不听话了？我的员工怎么突然就离去了？我的客户怎么突然就不进我的货品了？都是因为我们自身有不足，有过错而不自知，导致结果的发生，这个时候已经为时晚矣。</span></p><p><span></span></p><p><span>所以我们要不断地学习圣贤的文化，才能有自知之明。“就有道而正焉，”语出《论语》，我们不断地去学习道，学习正确的方法来修正自己，不要彰显自己的高明以对待下位的人，否则就会导致处下位的人，是无能的状态，没有能力，处处被我们压制，并且我们看不到事情的真相，听不到真实的声音，就会导致众叛亲离。</span></p><p><span></span></p><p><span>当我们觉得自己很高明的，自己时时处在上位的时候，别人就会觉得很压抑，时间长了以后，自然就会离开我们，所以我们要懂得去学习圣贤的文化，让自己变得仁爱谦和，如此我们的事情才可以变得更长久。</span></p><p><span></span></p><p><span>所以说遵义章都是告诫我们，不要去做什么样的事情，这是为人处事、建功立业的根本，这里不要做的事情，是需要我们细细地去体会，往生活当中去体悟和应用，我们如果不学习遵义章，有很多事情我们是不自知的。</span></p><p><span></span></p><p><span>比如，我们不知不觉就在彰显自己的高明，可是自己并不清楚，有很多的过错，不知改正，而导致了结果的发生，我们不明。所以我们经常发脾气而没有威严，就会遭到别人的冒犯，而我们还不自知，还任由着自己的情绪和怒火。</span></p></div>"
},{
    "title": "《素书》第十九讲 莫名不胜实",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第十九讲 莫名不胜实</strong></span></p><p><span><strong></strong></span></p><p><span><strong>貌合心离者孤，</strong>孤，我们把它分为内在的孤独和外在的被孤立，看看我们内心是如何孤独的？貌合心离者孤，我们的表面上所表现出来的，称为貌。我们表现出来的和我们实际心里所想的不一样，我们自己的内在就是孤独的。</span></p><p></p><p><span>举个例子，假如有一群人找我去喝酒，找我去打牌，找我去唱歌，找我去一些其他的娱乐活动等等，但是我自己的内心是不喜欢的，却依然去了。我们即使坐在人群之中，内心也觉得是孤独的，因为不喜欢这个环境，我们外在却又跟着去了，这个时候就是貌合心离。我们外在的表现是和大家合在一起的，可是我内心的想法不是这样的，和表现出来的是背离的，我们自己的内心就是孤独的。</span></p><p></p><p><span>我们再讲外在的孤立是怎么形成的？我们显现出来的，表现出来的和我们自己内心的想法不一致，久而久之我们就会被他人孤立的。</span></p><p></p><p><span>比如，我们表现出来的是一种样子，讲出来的是一种样子，和我们自己的内心并不相符，我们却伪装成某种样子，称为貌合。这个时候别人是看得出来的，刚一接触的时候可能看不清楚，随着接触的时间越来越长，就能看到我们的表里不ー，别人就会孤立于我们，不再相信我们，有一个词叫做秀而不实，就是这样的道理。</span></p><p></p><p><span>秀，就是貌合，看着很好的样子。随着接触以后，会发现他内在的好，不足以和他表现出来的相合。这个时候别人表面上是恭维的，是貌合的，但是心逐渐地离我们越来越远了，最后结果就是孤立的。无论是内在的孤独，外在的孤立，都是由于我们表现出来的，和我们的内心相违背，相背离。</span></p><p></p><p><span>《大学》讲：“诚于中，形于外。”我们修行一定让自己表里如一，表现出来的和内在是要相应的，我们内在有多少诚意，内在有多少仁爱之心，内心有多少礼，表现出来表里如一的时候，我们自己才不孤独。</span></p><p></p><p><span>我们做自己喜欢的事情，不喜欢的事情不会去做，当我们表里如一的时候，是经得起时间和他人的验证，就不会被孤立，别人才会心悦诚服，否则形成的结果就是孤。</span></p><p></p><p><span>如果我们不能做到诚于中，形于外，别人表面上是恭维的，是貌合的，在什么时候会显出来这个孤？当我们真正遇到事情的时候，别人的恭维将不在，实则是我们早已经种了这个因，而我们自己不自知，我们把他人的恭维当成了真相，自己看不清楚了。可是遇到事情的时候，会发现我们被孤立了，没有人愿意心甘情愿的和我们走在一起，这就是貌和心离者孤。</span></p><p></p><p><span>所以一定要让自己的内在变得充实，让我们内在变得谦卑有礼，变得正直，仁爱，表现出来的才是最真实状态的自己，这样我们自己是喜悦的，是不孤独的。别人看到我们也是表里如一的，才会心悦诚服，如此才可能变得长久。</span></p><p><span><strong></strong></span></p><p><span><strong>亲谗远忠者亡，</strong>亲近谗言，远离忠贤之人，导致的结果是亡，是注定要灭亡的。当我们经常听信谗言的时候，心念，思维，行为是不是都会跟着发生变化，我们听的谗言越多，离忠义之士自然就会越远。</span></p><p></p><p><span>谗言，什么叫谗言？一定是讲很多好听的话，讲很多违背事实的话，讲很多投其所好的话，如果我们不懂得去分别，就会离忠义之士越来越远，通常忠义之士讲的可能是正直的，但是正直的话容易伤人。</span></p><p></p><p><span>我们在生活当中也是一样的，多少人都在讲着恭维的话，又有几人会愿意指出我们身上的问题，敢于讲出来我们身上的问题，所以自己一定要保持中正的态度，不被情绪所干扰，我们才能看清事实的真相。别人赞美几句，我们就找不到自己的方向了，就会认为自己有多么伟大，我们自己有多么厉害，这时一定会逐渐走向灭亡的。</span></p><p><span><strong></strong></span></p><p><span><strong>近色远贤者昏，</strong>这里的色指美色，当我们很亲近接近美色的时候，自然会远贤，远贤的结果就是昏乱。我们去纵观中国通史，上下五千年，只要是贪恋美色的人一定是昏乱的，因为过度沉迷于美色，思维也是昏乱的，政治也是昏乱的，朝纲亦是昏乱的。我们现在也会讲，‘枕边风’，就是身边的人不停地和我们讲一些事情，久而久之我们的思维就形成了。</span></p><p></p><p><span>比如，一个人在我们身边经常讲他人的是非，经常讲别人的不好，如果我们一旦听了进去以后，久而久之我们的思维里面就形成了，就会远贤者，开始听不进去一些贤者讲话，而我们沉迷于其中，导致的结果就是昏，昏就是所有的事情理不清楚，道理也理不明白了。</span></p><p></p><p><span>我们再延伸讲，近色远贤，色，我们再把它扩大一下范围，所有我们贪恋的美好的事物，都称为色。我们越是贪恋美好的事物，我们离贤德这件事情就会越来越远。只有我们不再贪恋那么多美好的事物，我们才愿意去修正自己，让自己变得贤德，才能听得进去贤者之言。</span></p><p></p><p><span>所以圣贤文化都告诉我们，要减少对物欲的贪恋，减少对色相的执着，让我们自己变得贤德，变得仁爱，我们才越接近圣贤，越接近道。</span></p><p></p><p><span>《论语》讲：“贤贤易色”，第一个贤是动词，要注重贤德这件事情，易色就是对所有的物质，要把它变得简单，所以一重一轻，我们越是追求贤德，自然就会变得易色，对于色相的美好的事物，自然会减少执着，而是反过来也是一样的，如果我们是近色的，喜欢这些美好的事物，自然离贤德就会越来越远，离贤明就会越来越远。</span></p><p></p><p><span>自古以来的昏君，多数都是贪恋美色，贪恋财货，贪恋享受，开始变得不贤明了，导致朝纲昏乱。到了我们现在也是如此，一个人只有懂得追求自己的品质，追求自己的品德，让自己变得贤德，让自己变得贤能，我们的思维才是清楚的，我们才不被这些色相所迷惑，反之则是昏乱的。</span></p><p><span><strong></strong></span></p><p><span><strong>女谒公行者乱，</strong>谒是觐见，进言的意思，翻译过来讲，女子干涉政务，必然会导致乱局的发生。这句话我们需要正确的理解，它是有时代背景的，在那个时代是不允许女人干预政治上的事情。</span></p><p></p><p><span>所以这句话严格意义上来讲，并不适合我们现在这个时代。那个时候要求女子修女德，一个女子只要有德行，懂得去包容就好了，不要去抛头露面，去做太多的事情，更不要去干预政事。</span></p><p></p><p><span>但是我们这个时代不同了，有很多有境界，有格局，有胸怀的女子，所以我们懂得这个道理就好了，学知识不要过于死板，但是我们也要注意一点，无论是到哪个时代，无论男人和女人都要修自己的德行，女人要修女德，男人同样也要修，作为男人的德行和承载。</span></p><p><span><strong></strong></span></p><p><span><strong>私人以官者浮，</strong>私相授受，私人以官，比如我们喜欢一个人，欣赏一个人，不管他是否有才能，不管他是否能胜任某个岗位，某个职位，就开始任用，或者由于私利，他给了我们利益，就把某一个职位让他做了，这个时候所得到的结果就是浮。</span></p><p></p><p><span>我们看看这个浮从哪里来？首先讲被授予官位或者职位的这个人，他本人就是浮的。什么叫浮？没有根基称为浮，我们私相授受给他一个官位，一个职位，可是他是没有民众基础的，是不得民心的，这个时候他就是浮的状态，没有根，会发现没有人对他是称赞的，如果一旦这种情況过多，都是私人已官，最后所导致的结果，就是上下动荡，人心不稳。</span></p><p></p><p><span>所以我们看中国历史也是一样的，如果贪官过多，私人受官的事情频有发生，这个时候朝局一定不稳。我们回到当下，在一个单位或一个企业也是如此，如果我们找了很多人，但是他没有民众基础，又没有相应的能力，只是我们个人喜好，或者是亲朋好友所介绍来的人。</span></p><p></p><p><span>我们把他放在了非常重要的职位，一旦这种事情过多，上下就开始动荡，人心就开始变得浮躁，所得到的结果是没有根基，没有根基自然就是不稳的，浮于表面的。这个时候发现我们的团队没有力量，下面的民心不服气，就会导致不稳。</span></p><p></p><p><span>所以我们要切忌这样的事情，任何事情一定是公正的，有能者居之，不要以个人的喜好，个人的情绪，个人的关系，个人的利益决定，什么样的人做什么样的岗位，我们要以非常公正的态度，能者居之，德者居之。</span></p><p><span><strong></strong></span></p><p><span><strong>凌下取胜者侵，</strong>凌，是欺凌，欺凌是一种态度，欺凌下属而取得胜利的人，所得到的结果一定是被下属侵犯。欺凌就是不正当的手段，强横、蛮横、无礼的态度欺凌别人，而所得到的胜利，所得到的结果。最后一定会遭到他人的反抗，即使他人不反抗，也是时机不到，一旦找到合适的时机，一定会奋起反抗的。</span></p><p></p><p><span>自古以来中国的文化都在告诉我们，得民心者得天下，无论我们做任何事情都同理，只有真正的得人心才能得天下，我们所做的事情才能够承载，如果不能得人心，即使我们以欺压的手段暂时得到，一旦被人等到合适的时机，或者我们自己出现问题的时候，一定会被群起而侵犯，得到的结果必然是不好的。</span></p><p></p><p><span>所以无论我们去学习儒家文化，学习道家文化，都告诉我们要以仁爱，慈悲之心，去对待他人。一定要建立别人内心的仁、义、礼。如何才能让他人心甘情愿地去做事情，一定是我们持守中正之道，对他人是仁爱的，是慈悲的，不要以欺凌的态度去做事情，如此我们才能走得更长久。</span></p><p><span><strong></strong></span></p><p><span><strong>名不胜实者耗，</strong>就是我们所得到的名，所拿到的东西，和我们内在的实际是不相符的，是不相应的，得到的结果就是消耗。举个例子，一个人开始有了名望，随着名就会来各种各样的东西，比如荣誉、财富、他人的尊敬。但是我们实际的内在，和我们所得到的名并不相符，这个时候就是在消耗的，消耗我们自己的福德，消耗我们自己的福报。</span></p><p></p><p><span>德不配位必有余殃，我们不足够承载的时候，就是在不停地消耗，这个时候终究是昙花一现。所以太过于出名不是一件好事情，如果一旦出了名怎么办？这个时候更要懂得，去修正自己的内在和德行，让我们的实际和名是相符的，才会变得长久。否则不停地消耗，消耗到一定程度的时候，必有灾祸发生。</span></p><p></p><p><span>我们要懂得厚积薄发，先难而后获，做任何事情一定要经历先艰苦奋斗，艰难的过程，最后才获得，不要想着不劳而获的事情，不要想着容易得到，是一件什么好的事情，这样都是在消耗自己的福德，而我们不自知。</span></p><p></p><p><span>整个《素书》听起来好像平淡无奇，但是他所教给我们的智慧，是非常的实用的，道家都在讲道的规律。《素书》教给我们的道理也是同样的，都在告诉我们道的规律，道的规律是不居功的，是告诉我们不要享用太多，我们有十分福德只享三分。</span></p><p></p><p><span>而我们现在，很多时候有三分福德，非要享受十分，最后得到的结果会是衰败的，会是有灾难降临的。所以切勿过多地去消耗，要懂得俭以养德的道理，要懂得不断地去提升自己内在的德行。</span></p><p></p><p><span>道、德、仁、义、礼五者一体也，欲为人之本，不可无一焉，这是我们做人安身立命的根本，不能离开这五个字，只有我们不停地让自己合于道，修自己的德行，让自己变得仁爱，让自己变得正义担当和奉献。</span></p><p></p><p><span>我们用礼去对待身边的每一个人，对待万事万物。只有我们这样去修正自己，提升自己的内在，我们所得到的才会相匹配。</span></p></div>"
},{
    "title": "《素书》第二十讲 莫自厚薄人",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十讲 莫自厚薄人</strong></span></p><p><span><strong></strong></span></p><p><span><strong>略己而责人者不治，</strong>略己是忽略自己而责怪别人，如果行事作风是这样的，得到的结果就是无法治理，无法治理一个团队，无法治理一个国家，无法治理一个家庭。</span></p><p><span></span></p><p><span>自己所犯的错误忽略不计，觉得是情有可原的，有无数的理由和借口来忽略自己本身的问题和过错，而不停地去苛责指责于他人，这样是无法治理好一个团队的，无法治理好一个企业，也无法治理好一个军队，一个国家，乃至小到一个家庭也无法治理。</span></p><p><span></span></p><p><span>如果我们不停地去苛责我们的另一半，指责我们的孩子，而自己所犯的过错却永远都觉得情有可原，都是有理由的，都是可以忽略的，这个时候别人自然不服气，别人不服气的时候，我们自然也就无法治理。</span></p><p><span></span></p><p><span>《论语》讲：“躬自厚而薄责于人。”我们对自己要有严格的要求，不停地要求自己，修正自己而薄责于人，对他人的指责和要求是很少的，对自己的要求是很多的，这个才是修身之道，修身之本。</span></p><p><span></span></p><p><span>《</span><span>素书》讲的也是同样的道理，当我们不断地去修正自己，对自己严格要求的时候，影响着身边的每一个人，所得到的结果就是无为而治，我们不需要去刻意地做很多事情，只需要不断地要求自己，让自己变得更好，影响着身边的每一个人，别人才会心悦诚服。</span></p><p><span><strong></strong></span></p><p><span><strong>自厚而薄人者弃废，</strong>自厚，这里指的是自己所得的利益是丰厚的，而给予他人的却是很薄的，很少的。这样我们所得到的结果，就是被人遗弃的，这两句话我们连在一起来理解，对于自身的要求是要自厚的，对自己的问题是不能忽略的，而对他人的指责和要求是少的。</span></p><p><span></span></p><p><span>反过来当有所得的时候，要多懂得给予他人，而不要自身所拥有的过厚，得到的过厚，而给予他人的变少，如果长此以往，必然会遭到众人的遗弃，没有人愿意跟随我们一起去做事情。</span></p><p><span></span></p><p><span>一正一反关于修身、修己，严格要求自己，宽以待人，对于所得到的利益，我们给自己不要太多，而要多给予他人，如此两者相辅相成，我们才会得众人之心，才能治理好一个团队，才能治理好一个企业，往大了讲才能治理好一个国家。</span></p><p><span></span></p><p><span>《素书》是黄石公传给张良，让他去找到一个贤明的君主，辅佐他得天下，治理天下。所以告诉他要如何去用人，如何去修身。《素书》里所讲的每一句话，包含了用，要妙用，但是每一句的妙用背后，又告诉我们该要修身，哪一句话也没有离开修身。</span></p><p><span><strong></strong></span></p><p><span><strong>以过弃功者损，</strong>做事情要功过分明，不能因为一个人的过错，而抵消了他所做的功德，所付出的功劳。所以我们在做事情的过程当中，也是一样的，有功劳的地方就是有功劳，有过错的地方就是有过错，有过的时候一定要指出，一定要去修正。有功的时候一定要奖赏，一定要犒劳，一定要赞美。</span></p><p><span></span></p><p><span>不能因为过错而忽略一个人的功劳，如果这样去做所得到的结果就是损，损失了这个人，损失了这个人心，损失了其他人的人心。如果经常是以过弃功，因为一个人犯的过错，而我们就记不起他所做的功劳，这个时候别人必然心生怨恨，所得到的结果必然是两败俱伤。对于整个集体也是有损失的。所以做事情一定是公正严明的，功过分明，功即是功，过即是过。</span></p><p><span><strong></strong></span></p><p><span><strong>群下外异者沦，</strong>把这两句话连在一起看，我们做事情如果以过，而忘记了这个人的功劳功德，群下就是众人都会开始生起异心，开始生起外心，这个时候我们会沦陷的，会沦亡。</span></p><p><span></span></p><p><span>我们长期经过学习和修行的人，看到的事物，通常都是美好的那一面，我们更多的看到的是，一个人身上的优点，而不是他的过错，看到的更多是他的辛劳，是他的功劳，而不是他的问题，我们才会更加的得到人心，更懂得去看到，每一个人身上的优点，看到每一个人身上的美好，加以鼓励，赞美和奖励，这个时候是可以促进，所有的人积极向上的。</span></p><p><span></span></p><p><span>反之，如果我们看到的，都是他人的过错，看到的都是他人的不足，而去横加指责，而看不到他的功劳，这个时候众人就会开始生异心，开始生外心，所导致的结果就是沦亡的，结果是非常不好的。</span></p><p><span></span></p><p><span>我们去读历史的时候，也是一样的，很多大臣如果做了很多事情，可是君上却看不到，而只是抓住他的一些问题，一些过错而加以惩罚，这个时候很多人，就开始生异心了，就开始不效忠于朝廷，结果就会导致沦亡沦陷。</span></p><p><span></span></p><p><span>我们平时做事情或带团队的时候，也要切记这一点，包括在一个家庭环境当中，也是一样的，我们要懂得去赞美，懂得看到对方所付出的辛劳，而不是揪住他的过错不放，这是一个修行人，该心怀的美好。</span></p><p><span><strong></strong></span></p><p><span><strong>既用不任者疏，</strong>既然我们选择用了一个人，但是还不给他任命，不给他相应的发挥空间，所导致的结果就是疏，疏远就会自然离开，尤其是有才能的人。我们既然选择用，说明我们是欣赏他某一方面的才能，如果我们选择了用，但是又不给他任命具体的事情，相应的岗位和职责，这个时候，他一定会变得越来越疏远，因为他在我们这里，实现不了自己应有的价值，实现不了自己的抱负，自然就是疏远的。</span></p><p><span></span></p><p><span>所以要懂得任才使能的道理，我们要发挥每一个人的才能，人尽其才，物尽其用，只有发挥了每个人的才能，让他实现自己的价值，找到自己存在的意义，才能更长久的和我们一起做事情，才能体现他的奉献精神，才能找到自己的工作目标，才能有自己的人生价值，否则得到的结果，必然是疏远离开。</span></p><p><span><strong></strong></span></p><p><span><strong>行赏吝色者沮，</strong>我们在行赏的时候，但是面露吝啬的表情，别人清清楚楚地看得到，这样是令人沮丧的。我们明明是在欣赏的，既然欣赏，一定是对方做了有功的事情，可是赏的时候，我们面露的又是吝啬的表情，别人一看就知道了，想给 但是内心又不舍得，这个时候会令他人很沮丧的，所有的人都看在眼里的。</span></p><p><span><strong></strong></span></p><p><span><strong>多许少与者怨，</strong>我们有很多的许诺，有很多的诺言，但是给予的总是很少，这样所得到的结果，就是人人心生怨言，把这两句话连在一起看，既然是行赏，就要大大方方地给，要不然就不赏，平时少许诺，如此人们才能少怨恨，我们经常提到一个词叫意外，什么样的事情，才会让别人高兴？就是意外的事情，超出期待值的事情。</span></p><p><span></span></p><p><span>比如说我们要行赏，他本来没有觉得这件事情会行赏，可是我们奖赏了，这叫意外，他认为这件事情，可能奖赏的比例，比如是五分，可是我们给的时候，给了六分七分，这个叫超出期望值，这个时候对方内心是喜悦的。</span></p><p><span></span></p><p><span>我们再广泛地延伸一下，在生活当中也是一样的，我们要想令他人高兴，其实方法很简单，给他一些意外之喜，超出他的期望值，对方就很容易高兴。举两个生活当中的例子，比如我们有一个朋友举办婚礼，或开业庆典，如果按照我们的关系，可能正常随礼五百元够了，可是我们去的时候，却随了两千，这个时候我们会发现，他就会快速地记住我们这个人，为什么？因为超出了他心里的预期。</span></p><p><span></span></p><p><span>举这个例子是什么意思呢？我们在生活当中，如果要想妙用，要想找一个人办事情怎么办，就是超出他的期望值，对方就会快速地记住我们。所以说《素书》是妙用的，如果我们要想获得一个人的芳心，是不是一样的呢，我们做的事情，总是超出他的期望值，让他觉得意外的惊喜，他就会快速地记得我们，这个时候就很容易打动人心。</span></p><p><span></span></p><p><span>我们在工作当中也是一样的，如果作为一个领导层，让员工经常体会到意外之喜，他就很容易满足和高兴。那我们做员工的，或者做某一个岗位的人，是不是一样的，我们所做的工作的范围、所付出的价值，总是超出领导的预期和期望值，这个时候，很容易获得领导的赏识和重用。</span></p><p><span></span></p><p><span>反之，如果我们所做的事情总是大大地降低了原本这件事情的标准，所得到的结果就是令人沮丧的，就是会让别人心生抱怨的，心生怨言的。</span></p><p><span>比如，领导也会对员工有怨言，因为做的事情总是不能让人满意，总是说的多，做的少。所以无论我们是处上位或处下位，无论我们在哪一个岗位，都是一样的，少说，少承诺，多做事情。否则一定会社对方心生怨恨。</span></p><p><span></span></p><p><span>高行微言，所以修身，修身之本就是行为要高尚，要多做事情，讲话要谦卑，要少说，无论在生活当中，在工作当中，或者交朋友都是如此。有的人讲话总是讲的很大，总是去保证，去承诺，可是结果做的并不好，久而久之别人必生怨恨，必生抱怨。</span></p><p><span></span></p><p><span>是否生怨恨或生抱怨，取决于我们承诺的事情有多大，如果我们承诺的是小事情，没有做到，对方可能只是抱怨，而我们承诺的事情越大，如果做不到，这个时候别人心里就会生怨恨了。</span></p><p><span></span></p><p><span>所以修身的人，是不轻易许诺的，因为很多诺言是很难兑现的，即使能兑现的时候，说话也留几分余地，所以叫高行微言，多做事情，行为高尚，少许诺，少讲话。</span></p><p><span><strong></strong></span></p><p><span><strong>即迎而拒者乖，</strong>即迎而拒，我们表面上是迎合的，而内心实则是拒绝的，所导致的结果是乖，乖就是分离的意思。</span></p><p><span></span></p><p><span>举个例子，比如我们在家里，有一个朋友想来做客，我们表现的很欢迎的样子。可是当对方来到的时候，我们内心却是抗拒的，我们的脸色并不好看，这个时候对方都看在眼里的，当他走出这里的时候，就产生分离之心了。我以后再也不想来了，他表面上说的很好，可是实际的表现的不是一个样子的，所以导致的结果是必然分离。</span></p><p><span></span></p><p><span>再来举个例子，讲一种现象，有的女孩子总收他人送的东西，送的礼，会让别人产生误解的，难道别人不停地给我们送东西，他有什么样的想法，我们不清楚吗？</span><span>我们清楚啊，可是我们还是收了，这个时候对方会产生错觉，认为他是可以实现心中的想法，认为我们是在接受的，可是当他表达了自己的想法，或者是非分之想，或者是恋爱，或者是其他的某种关系，会发现我们其实是拒绝的。</span></p><p><span></span></p><p><span>这个时候对方心里必生怨恨，得到的结果就是乖，分离。</span><span>生活当中很多时候都是这样的，我们自己如果内心是拒绝的，就不要表示欢迎，不要表示迎合，否则就会让对方心生怨恨。</span></p></div>"
},{
    "title": "《素书》第二十一讲 莫念旧弃新",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》二十一讲 莫念旧弃新</strong></span></p><p><span><strong></strong></span></p><p><span><strong>博施厚望者不报，</strong>博施，是给予或施给别人的很少，但是却希望得到对方丰厚的回报，导致的结果就是不报，不是对方不报，而是自己会大失所望，当我们施给别人的少，想要得到的回报丰厚，如果我们放在心里，就会导致大失所望。如果我们天天挂在嘴上，就会让人起厌恶之心。</span></p><p><span></span></p><p><span>生活当中有很多这样的人，我们帮助了别人一点事情，放在心上不说出来还好，只不过自己有一些期望，会失望罢了。但是还有很多人，我们帮助过别人，天天挂在嘴边，如果当时没有我，他的事业能起来吗？如果没有我，能有他的今天吗？</span></p><p><span></span></p><p><span>就会让人起厌恶之心的，不光是我们帮的那个人会讨厌我们，旁观者或其他人也会生厌恶之心，别人看到就会心里在想了，不能跟这样的人打交道，他要帮我的忙，我也不用，所以很容易让人厌恶的。</span></p><p><span></span></p><p><span>《太上感应篇》讲:“施恩不图报，与人不追悔。”我们帮助别人，是不图回报的。我们给予别人，是不会后悔的。这个时候我们才会坦然，功德也会越大。我们帮助了很多人，并不图回报，这个就是阴德，自然会有天报之。</span></p><p><span></span></p><p><span>《道德经》讲:“天道损有余而补不足”，这一生我们给予帮助了很多人，我们不贪图对方给什么样的回报。当我们在遇到事情的时候，总有人出现来帮我们，天道的规律是循环的。</span></p><p><span></span></p><p><span>我们帮助了一个人、两个人、十个人、一百个人乃至一千个人，可能这一千个人，我们不需要他们给予什么样的回报，天道会回馈给我们的，一定会出现其他的人，其他的事情，来给我们回报，这个时候我们不会失望，才很坦然淡定地去做自己该做的事情。我们想去帮助一个人，只是这一时刻的善心，只是觉得应该帮助对方，仅此而已。</span></p><p><span><strong></strong></span></p><p><span><strong>贵而忘贱者不久，</strong>我们富贵了，但是却忘记了贫贱时候的生活，所导致的结果是不长久。我们经常形容一个人暴富了，一旦暴富以后就会变得张扬，变得奢华，开始找不到自己了，得意忘形，开始挥霍，最后不长久。</span></p><p><span></span></p><p><span>贵而忘贱，富而忘贫，同样的道理都是这样的语境，都在讲着同样的道理。当我们富贵了，忘记了贫贱的生活，忘记了贫困的日子，我们就开始变得张扬，挥霍无度，得到的结果必然是衰败，不长久。</span></p><p><span></span></p><p><span>在工作当中也很容易出现这样的问题，我们在一个工作岗位上表现的比较优异，升职了，我们就开始变得张扬，开始变得傲慢无礼，忘记了我们处在员工的那个位置，心里所承受过的忐忑和不安，我们一朝得势的时候，开始变得傲慢张扬，开始欺凌处在下位的人，这都是忘记了自己原本的样子。</span></p><p><span></span></p><p><span>我们作为一个修行之人，作为一个要想立功立事的人，无论走到什么样的位置，都要体会基础的那些痛苦，要去回忆我们曾经所处位置的无助，才能感同身受，我们自己本身经历了贫贱，经历了处在下位的心里感受。</span></p><p><span></span></p><p><span>我们ー旦有机会变得富贵，变得处上位的时候，一定要懂得体恤他人之苦，如此才可以变得长久，才可以一直走下去，才可以得众人之心。</span></p><p><span><strong></strong></span></p><p><strong>念旧恶而弃新攻者凶，</strong><span>一个人明明有新的功劳，做了很多好的事情，可是我们心里却念着他的旧恶，所导致的结果是凶的，告诉我们做事情的心要不偏私。</span></p><p><span></span></p><p><span>我们很多时候，都会受自己的心性和情绪所带动，一个人过去犯过错误，就以异样的眼光来对待这个人了，哪怕他已经改好了，已经变得很优秀了，可是我们的脑海当中，心念当中，还想着他的旧恶，还在纠结于他过去所犯的错误，导致的结果必然是凶的。</span></p><p><span></span></p><p><span>我们在一个家庭当中，也经常这个样子，比如我们的伴侣犯过什么样的错误，往往揪住这个错误不放，一遇到事情的时候，每当吵架的时候，就把他过去所犯的错误拿出来重复地讲，不断地叙述，两个人将越闹越僵，所得到的结果自然是凶的，肯定是不好的，所以我们要学会一种豁达，叫既往不咎。</span></p><p><span>既然已经是过去的事情，并不是当下所发生的，不要揪住不放，否则一定会变得越来越不好，关系会越来越决裂。</span></p><p><span></span></p><p><span>“人非圣贤，孰能无过，知错能改，善莫大焉。”犯过错误，只要自己不断地改正，我们就把这个事情忘记掉，从此不要再提，而去看他的优点，他的好处，看他的当下变得怎么样。</span></p><p></p><p><span>反之也是一样的，不能由于我们喜欢一个人，就认为他做什么都是对的。我们过去对这个人认知非常的好，觉得他是一个优秀的人，不代表他每一件事情都可以做得很好。当我们的心不偏私的情况下，功就是功，过就是过，他做的不足的地方就是不足，他做的好的地方就是好。</span></p><p><span></span></p><p><span>我们只针对当下的这件事情，对这件事情的表现，对这件事情的功过而做出结论，不要带着过去的认知，过去的偏见，过去的色彩，再来衡定当下这个事情。</span></p><p><span><strong></strong></span></p><p><span><strong>用人不得正者殆，</strong>殆是很危险，什么样的情况下会很危险？用人不得正，我们用的人他是不正的，骨子里是没有正义的，他的行为是不正的，这样的人是不能用的，否则结果一定很危险。</span></p><p><span></span></p><p><span>《易经》师卦有八个字：“将领要贤，用兵要正。”做将领的人，一定要贤德，兵就是每一个人，一定要正，如此我们才能形成正义之师，做事情才不出现偏颇，有的人的正是骨子里来的。比如，有的人天生就有奉献精神，有的人天生就有担当，有的人天生心地就善良柔软，心地就是光明的，这都是正。</span></p><p><span></span></p><p><span>如果底子不正，这个是很难培养的，一个自私自利的人，很难培养奉献和担当的精神，所以《素书》告诉我们，用人一定要正，从选人的那一刻，我们就要知道，只有这个人骨子里是正义的，是善良的，我们才能快速地去用，否则得到的结果一定是危险的。</span></p><p><span></span></p><p><span>并且我们一旦用的不正之人，他会影响其他人的，这种不正之风会蔓延的，既然是妙用的，讲的是手段和术是方法，如果发现有不正之风，一定要快速地斩绝，不能容忍这种风气蔓延，否则很危险的。</span></p><p><span><strong></strong></span></p><p><span><strong>疆用人者不畜，</strong>畜是留不住，什么样的人留不住？勉强而用之，不是心甘情愿的情况下，都是勉强的。一个人留在这里做事情，如果不是自己心甘情愿，一定留不住。</span></p><p><span></span></p><p><span>俗话讲：“强扭的瓜不甜”，因为他并没有心甘情愿，没有成熟到一定的程度，这个时候我们勉强用之，一定留不住不长久，并且如果不是心甘情愿的做事情，内在没有力量的，靠我们不停的要求去做事情，这样的人很难产生价值和潜能。所以我们要懂得，培养一个人内在的精神，培养一个人的意义。</span></p><p><span></span></p><p><span>遵义章第五，我们要遵循合适的，正义的方法去做事情，同时也要懂得培养，每个人内在的意义，去激发每个人的担当和奉献精神，有了这种精神，心甘情愿的去做事情，心甘情愿的去付出，这样的人我们才留得住，他才可能做更多正义的事情，否则我们勉强而用之，即使这个人再有能力，又如何呢？结果一定是留不住的。</span></p><p><span></span></p><p><span>在一个团队当中，如果有人想离开，也不必挽留，没有任何意义，因为他的心已然不在了，即使留下又有何意。在一个感情当中，不是同样的道理吗？如果一个人的心已经不在了，勉强留下又如何，最终依然是留不住的，强用人者不是。</span></p><p><span></span></p><p><span>我们把这句话延伸到生活当中，做任何事情都一样的，不必勉强，不必逞强，只要是勉强而为之的事情，结果都是留不住不长久的，所以要想去做好一件事情，要激发每个人内心的义，我们遵义而行。每个人只有心甘情愿，诚心诚意的去做事情，才可能留得住，我们才是共同前行的人，任何事情都是同样的道理，所以我们要懂得其未兆易谋，在事情未发生的时候，就要开始谋划了。</span></p><p><span></span></p><p><span>比如说我们要想留住一个人，必须要培养他内在的义气，要让一个人，心甘情愿，诚心诚意的去做事情，而不是对方已经心不在了，想离开了，这个时候我们再来挽留，就是勉强而为之留不住的，在感情当中也是一样的，如果一个人的心已经不在了，再去挽留也是没有意义的，他终究会离开。</span></p><p><span></span></p><p><span>这个时候很多朋友就会说了，这不是告诉我们不用去努力吗？不是的，妙用就是妙在这里，要想挽留一个人，一定不要等他心死的时候，其未兆易谋，在事情没有发生的时候，或者是刚刚开始，出现端倪的时候，最容易谋划。我们经营一个团队，同样的道理，我们要想留住一个人，不要等对方去意生的时候才留，而是要在任何事情，没有发生之前，我们用心的去对待这个人。</span></p><p><span></span></p><p><span>这个时候避免了很多事情的发生，《素书》听上去似乎平淡无奇，但是真正在我们的生活当中，在工作当中，在经营企业的过程当中，我们要懂得反复的思索和应用。</span></p><p><span></span></p><p><span>《素书》所讲的内容，既平实又很奇妙，为何张良可以凭借素书，而辅助刘邦，夺得天下，就是这些看似平淡无奇的文字，里面的实用性非常的强。</span></p></div>"
},{
    "title": "《素书》第二十二讲 失其强者弱",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十二讲 失其强者弱</strong></span></p><p><span><strong></strong></span></p><p><span><strong>为人择官者乱，</strong>通常我们都是因岗设人，有一个岗位我们来选择合适的人选，在这个岗位上做事情。但是如果反了，我们是因为某一个人来给他设定岗位，导致的结果必然是管理混乱，所以叫为人择岗者乱。</span></p><p><span></span></p><p><span>什么情况下我们才会为人择岗呢？我们喜欢一个人，我们欣赏一个人，我们偏袒一个人就会徇私舞弊，会为一个人制造一个岗位，久而久之，必然会导致管理一片混乱的。</span></p><p><span></span></p><p><span>所以我们做事情需要什么样的人，就物色什么样的人，让他去恪尽职守，做好自己岗位的分内之事。</span></p><p><span><strong></strong></span></p><p><span><strong>失其所强者弱，</strong>我们失去了自己的优势，自己的优点，就会让自己的力量变得薄弱。举个例子理解，比如，鸟儿的强，它的优点就是有翅膀，如果把鸟儿的翅膀去掉，就是失去所强，它就会变为一个弱者。</span></p><p><span></span></p><p><span>比如，一只羚羊，一只猎豹，它的强势就是善于奔跑，如果它跑的速度慢了，就失去了它的强势，这个时候它就会变为一个弱者。</span><span>我们再来讲，一个人也是一样的，如果我们不能用自己的优点优势去做事情，把优势去掉的时候，我们就会成为一个弱者，力量就会变得很薄弱。</span></p><p><span></span></p><p><span>万事万物都有自己某一个优势，某一个强项，我们每个人也是一样的，人人都不同，有的人强项是讲话比较动听，口才比较流畅。而有的人强项是文笔比较好，有的人强项是做事情比较严谨，有的人强项是比较安静，所以每个人都有自己的强项和优点。</span></p><p><span></span></p><p><span>作为一个用人者，我们要去发掘每个人的优点，每个人的强项，并且加以用之，如果我们舍其优点，舍其强项，而用其缺点和劣势，这个人呈现出来的就是很弱的形象，很弱的状态。</span></p><p><span></span></p><p><span>我们思考自身也是一样的，我们要懂得找到自身的强项和优点，把强项和优点不断地扩大，不断地增强，我们才能变为一个强者，否则力量一定是薄弱的。</span></p><p><span></span></p><p><span>一个企业也是一样的，一个生意也是如此。比如，我们销售一个产品，产品的强项可能是实惠，价格亲民，我们产品的强项，可能是更优质。我们的生意强项，可能是服务更好，但是当把这个强项拿掉的时候，我们就变得薄弱，没有力量。</span></p><p><span></span></p><p><span>用我们自身虚空济来举例子，我们主打的强项，讲的就是修行之道，这是如何在生活和工作当中去修正自身，如何去自觉觉他，帮助更多的人。所以我们可以试想一下，如果我们只是讲文化，只是讲道理，而不再讲修身，不再讲修行，就失去了自己的强项，力量就会变得薄弱，在茫茫人海中并没有任何突出的地方。</span></p><p><span></span></p><p><span>无论是我们个人、一个团队或者是做生意，ー定要找到自己本身的强项，不停地增强我们的强项，增强我们的优势，这个就是我们手里的利器，否则失其强者，必然变成一个弱者。</span></p><p><span></span></p><p><span>《论语》讲:“工欲善其事，必先利其器。”工匠要想把事情做好，必须有一个称手的利器，必须要打磨好自己的兵器。</span></p><p><span></span></p><p><span>民间讲:“磨刀不误砍柴工。”我们平时磨刀，是为了砍柴的时候，不耽误更多的时间。作为一个人也是一样的，要想去做好一件事情，要想让自身有优势，平时就要不停地打磨自己，不停地修正自己，让自己变成一把利器，这里的利器是指自己有很多的优势和优点，我们才能承载更多的事情。</span></p><p><span></span></p><p><span>我们一个团队也是一样的，要想更有优势，要想变得更强，平时不断地提升我们的内部，让自己的产品更有优势，更强，让我们每个人变得更强，变得更有优势，才是我们的生存之道。</span></p><p><span><strong></strong></span></p><p><span><strong>工欲善其事，必先利其器。</strong>要让自己成为一个强者，成为有优势的一把利器，这里的利器是指让自己变得更好，自己的产品变得更好，自己的服务变得更好，自己的优势变得更明显，如此我们才能立于不败之地。</span></p><p><span><strong></strong></span></p><p><span><strong>决策于不仁者险，</strong>如果决策之人是没有仁德的，不是以仁爱之心为出发点的，所导致的结果必然是危险的，不长久。前面课程讲过，德足以怀远，我们内心是有仁德之心的，每一个决策是有仁德之心的，我们才能思虑得更远，我们思虑得谋划得越远，就不会计较当下的得失和利益，这个时候才能更长久。</span></p><p><span></span></p><p><span>如果我们是没有仁德的，思虑的都是当下的得失，计较都是眼前的成败，最后的结果必然是危险的。举个例子，无论做任何生意都一样，如果我们是用仁德、仁爱之心去决策的，就会考虑如何让我们的客户，让消费者变得更好，让生意变得更长久，这个时候我们的服务自然会好，自然会设身处地为对方着想，为对方思虑。</span></p><p><span></span></p><p><span>如果我们的决策不是有仁德的，只考虑当下赚他的钱就可以了，当下让他购买我们的产品就可以了，这个时候结果危不危险？他当下虽然成为了我们的顾客，购买了我们的产品，但是后期他会觉得购买的产品也不过如此，也没有得到什么附加的价值，我们也没有真正地帮助过对方，结果必然是危险的。</span></p><p><span></span></p><p><span>黄石公把《素书》传给张良，是让他谋划国家大事，为人民百姓谋得生存之环境，一定是思虑得更远，谋划得更远。我们不断地学习圣贤的文化，懂得以修身为本，我们每一个谋划，每一个思考问题的角度，都应以仁德为本，考虑得更远。</span></p><p><span></span></p><p><span>从修行的角度讲，我们讲善业、恶业，更是如此，我们以仁爱之心去做每一个决策，甚至每一个心念，每一个思维方式，每一个行为，都应该是更加仁德的，如此才没有危险，恶业才不会到来。</span></p><p><span><strong></strong></span></p><p><span><strong>阴计外泄者败，</strong>有阴计，有阳谋，何为阴计？不能被人知道的计策，通常我们称为阴计，阴计不代表一定是坏的或者不好的，本身计谋是没有属性的，只不过阴计，是不能被他人知道的秘密，一旦不能被人知道的事情，如果泄露，导致的结果是计策失败。</span></p><p><span></span></p><p><span>我们看中国历史，自古以来，谋士或军师，他自己所计划的阴计，不被别人知道的事情，他是不对别人讲的，事情成功以后，他才会说里面的道理，如果一旦提前说出来，被更多的人知道，这个计划就要失败的。</span></p><p><span></span></p><p><span>这句话是在告诉我们什么呢？作为一个思谋者本身，自己要懂得藏得住秘密。团队的每一个人亦是如此，不到时候不能对外人讲的话，一定不能讲，只有到事情尘埃落定的时候，才能讲。</span></p><p><span></span></p><p><span>我们反观自身，现在有很多人，心里是藏不住事情的，有一点事情的时候，恨不得对所有的人都开始讲，可是事情没有尘埃落定，如果讲的过多，别人知道了里面的事情，会导致结果的失败。所以要懂得谨言慎行的道理，有的话该讲，有的话不该讲，有的话不到合适的时机，切记不要讲，否则只会让自己的谋划失败，让团队的谋划失败。</span></p><p><span><strong></strong></span></p><p><span><strong>厚敛薄施者凋，</strong>厚敛，横征暴敛。薄施，寡失恩德。导致的结果就是凋，凋就是衰落，我们给自己敛得过多，而施出去的过少，导致的结果是必然衰落，人心涣散的，人是没有动力的，因为被施予得太少，自己所征敛得过多。</span></p><p><span></span></p><p><span>《素书》这一段讲的是，治国之道，所以我们读历史的时候更是如此，只要一个朝代，是横征暴敛的，只要一个朝代是贪财的，如果是民不聊生的，无法生存下去的，一定会有人揭竿起义，最后导致的结果是必然衰落。虽然讲的是治国之道，但是里面的道理却是相通的。</span></p><p><span></span></p><p><span>我们现在治理一个企业，是同样的道理，如果都是老板自己多得，而给予他人的很少，结果也必然是衰落，不得人心。财散则民聚，我们把财散出去，人民自然会聚在一起。财聚则民散，如果我们只是把财物聚集在一起，这个时候民众就会散掉的。</span></p><p><span><strong></strong></span></p><p><span><strong>战士贫、游士富者衰，</strong>战士，是国家的战士将领，我们说军队，国家的战士将领这是国之利器，国家的一把利器，国家的生存之根本。如果战士将领是贫困的，相反游士却是富的，导致的结果必然衰落。</span></p><p><span></span></p><p><span>何为游士？不停的奔走在各国之间，靠游说得到利益，得到认可的人，我们称之为游士。既然是游士就是游走的人，不是固定在我们自己国家的人，游士既然是游走的，他是为了利益也好，为了自己的名声也好，他不会以国家的利益为出发点，不会以利益为思考点。</span></p><p><span></span></p><p><span>如果让这样的游士去富裕，靠巧言而得了很多名利，可是我们自己苦苦奋斗的战士、将领，却是贫瘠的，导致的结果必然衰落。讲的依然是治国之道，可是我们把这个道理延伸到生活当中，也是一样地应用。</span></p><p><span></span></p><p><span>我们自己团队辛苦奋斗的人，如果我们让他是贫瘠的，而外面来的一些人，可能只是给我们出了一些主意，可能只是用了一些花言巧语，如果这些人从我们这里拿到的过多，必然是走向衰退的，因为人心愤愤不平，大家觉得不公平，觉得自己在这里辛苦奋斗，出谋划策，献计献力，坚守在一线，自然心里会不平衡，导致的结果，就是人心开始浮躁，必然逐渐地走向衰落。</span></p><p><span><strong></strong></span></p><p><span><strong>货赂公行者昧，</strong>货赂就是贿赂，拿财货去贿赂公行人员，或执政的官员，导致的结果是昧，昧就是昏暗的，既然用到贿赂，一定会徇私，徇私就意味着不公平，不公正，就是昏暗的，见不得光，这个时候也会人心不服。</span></p><p><span></span></p><p><span>我们读历史的会用到一个词，政治清明，反过来就是政治昏暗，什么叫清明？就是清清白白，都可以看到光的，是光明的，可以放在明处来讲的。贿赂、徇私、不敢公开、不能被人知道，这都是昏暗的。治理一个国家不能靠贿赂去行事，也不能提倡贿赂，否则一定导致昏暗。</span></p><p><span></span></p><p><span>我们去做一个企业或一个团队，也是如此，我们要提倡公平、公开，所有的事情是光明的。《论语》讲：“举直错诸枉，能使枉者直。”举直，我们自己去推崇、推举什么样的事情，别人自然就会效仿。</span></p><p><span></span></p><p><span>我们读中国历史也好，回到我们现实生活中也好，很难做到完全的公正、公开、光明的，所以我们要有明察秋毫的能力，去看到什么事情是光明的，什么事情是徇私的，这个时候我们才懂得，举直错诸枉，才会懂得举什么样的榜样，立什么样的标杆，我们倡导什么，下面的人就会跟从去做什么。</span></p><p><span></span></p><p><span>所以如果有一个明君出现，即使有徇私之人，也起不了多大的风气，整个政治是清明的。如果是一个昏君就是不够清明，也不能明察秋豪，自身又不贤德，光明的事情就会变少，清明的事情就会变少，而徇私和昏暗的事情就会变多。</span></p><p><span></span></p><p><span>《素书》讲的是妙用，如何去治理国家，如何去得天下，但却告诉我们以修身为本。如果一个人不懂得修身，自己有过多的私欲，过多的情绪，处事不公正，这个时候所治理出来的朝代，自然也是昏暗的。</span></p><p><span></span></p><p><span>我们现在这个时代，同样如此，如果我们自己不懂得修身，就看不到事情的真相，都会随着自己的贪欲和情绪而动，而一个懂得修身的人，是摒弃自己本身的欲望，摒弃自己的情绪，不会随着自己的性格任意而为，我们是依附道、德、仁、义、礼去做事情的，每一个出发点不同，思维不同，行为不同，所导致的结果自然是不同的。</span></p><p><span></span></p><p><span>一个是清明，一个是昏暗，即使我们不能完全做到公正、光明。但是如果我们自己是一个修身之人，最基本在这个环境当中，在我们所领导的事情当中，是趋向于光明，趋向于中正的。</span></p></div>"
},{
    "title": "《素书》第二十三讲 牧人德者集",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第二十三讲 牧人德者集</strong></span></p><p><span><strong></strong></span></p><p><span><strong>闻善忽略，记过不忘者暴。</strong>闻善，忽略不计，不讲，看不到；过错却时时刻刻记在心里，何为暴政？暴政都是这样形成的。我们形容一个人说:“这个人粗暴”。为什么会这样？看到别人的优点，好处不提，忽略的。可是抓住别人的过错却不放手，每天不停地讲他人的过错，讲他人的不足，这个时候我们就会说:“这个人很粗暴”。</span></p><p><span></span></p><p><span>我们做的事情是暴政，就会导致别人胆战心惊，时时刻刻怕自己犯错误，不敢去做事情的，不敢去突破，不敢去创新，没有自己的抉择和想法，因为看不到对方的善，看不到他人的好，而抓住的都是对方的过错不放。</span></p><p><span></span></p><p><span>以前治理一个国家如此，现在我们经营一个团队也是一样的，要懂得多鼓励他人的善行，要看到他人的优点，不要抓住别人的过错不放，这样会让每个人没有担当，会没有国之栋梁，没有人敢去做事情，怕犯更多的错误，这就是暴政，就是粗暴的。</span></p><p><span></span></p><p><span>《素书》所讲的每一句话，看似都是如此简单，做到并不容易，为什么？需要一个人懂得修身，自己是非常清明的状态，看每一件事情，看每一个人才是清晰的，只有清晰的状态下，我们才能做好每一个决定。</span></p><p><span></span></p><p><span>古人讲：“聪以知远，明以察微。”聪是可以知远的，可以看到很远。明以察微，对每一件事情，微小的事情都是明达的，在这样的状态下，我们才能去谋划好每一件事情，看清楚每一个人，所以一切都要回归以修身为本，如果不懂得修身，又如何能看清楚人、看清楚事情？每天沉浸在自己的情绪和喜好当中，没有智慧的，也不会变得明达。</span></p><p><span><strong></strong></span></p><p><span><strong>所任不可信，所信不可任者浊。</strong>所任不可信，用了不可信之人。所信不可任，我们信任的人放在那个位置上，可是又不能承担此任，所导致的结果是浊。什么叫浊？不清就是浊，我们来看看为什么这两种情况都会导致不清，导致浊的状态呢。</span></p><p><span></span></p><p><span>我们用了不可信的人，是不是每天都会提心吊胆，出去办一个事情的时候，我们也担心，对方是不值得信任的，就会担心事情处理得不好，担心他有私心，担心他有私欲，担心里面做一些不如法的动作，不如法的事情。</span></p><p><span></span></p><p><span>所信不可任者，也是一样的道理，这个人我们是信任的，可是他又没有足够的能力，去做好那件事情，我们也同样会担心，虽然他是可信的，但是会担心他所做的事情，行为有偏差，他所做的事情不是我们心中所想，所做的事情不符合我们的精神和道义，这个时候就是担心的状态。</span></p><p><span></span></p><p><span>所以这两种情况，都会让我们心生担忧，担忧的结果就是浊，不清晰，我们自己也不清晰，也不清明，对方也是不清晰的。</span></p><p><span></span></p><p><span>举个例子，比如说，我们现在虚空济正在装修，在那边负责装修的人是不信任的，就会担心会不会中饱私囊，做的事情会不会不符合我们的心意，会不会很多地方在浪费。有很多的忧虑，同样对方也有很多的忧虑。</span></p><p><span></span></p><p><span>我们再反过来讲，也是一样的，这个人是值得信任的，可是他没有那个能力担此重任，我们又担心了，他虽然是可信的，可是他的能力不够，这方面他也不懂，他万一被别人骗了怎么办？他规划安排不好每件事情怎么办？结果就是浑浊的，我们自己也很辛苦，对方也很辛苦。</span></p><p><span></span></p><p><span>我们再看生活当中的哪一件事情，不是如此？比如，我们做线上课，如果交给的人是不信任的，会有担忧，他怎么能做好？反过来亦是如此，这个人虽然是信任的，可是总担心他出错，总担心他的思维和行为有偏差，结果就是浊的，不清晰 不清明，不清明的状态，我们就是不坦然的状态，每日都是忧思忧虑的状态。</span></p><p><span></span></p><p><span>所以怎么办？如何解决？首先我们要用的，一定都是可信之人，不可信之人一定不用。第二点，虽然是可信之人，我们还是要不断地，让每个人和我们一样都要去修身。</span></p><p><span></span></p><p><span>我们学习了《素书》，要明白以修身为本的时候，起码是合道义的，他不偏差，行为不偏差，思维不偏差，心念不偏差，这个时候他才可以委以重任，做什么事情我们才是放心的，不用担忧的，不用忧虑的，这个时候每个人才能变得清明。否则在这一个环境当中，都是浑浊一片。</span></p><p><span></span></p><p><span>刚开始做事情的时候，一定是很辛苦的，因为有一些可信之人，刚开始一定是不能担此重任的，我们就要不停地去提升每一个人，直到这个人是可以胜任的，我们就开始变得坦然，变得不用忧虑，这个时候就是清的状态。所有的事情我们也理得清楚，心也是清的，也是坦然的状态，也是放心的状态。</span></p><p><span></span></p><p><span>我们讲到任何事情的根本，都是以修身为主，根本的东西是不能缺的，当我们懂得以修身为根本，修行过的人出发点是中正而不偏私的，我们不会因为个人的喜好，因为喜欢一个人，欣赏一个人的时候，他做什么都是对的。我们不喜欢一个人的时候，他做什么都是错的，这就是偏私，都是以自己的情绪喜好为出发点。</span></p><p><span></span></p><p><span>所以做事情如何能中正？做不到的，无论是《素书》，还是平时所学习的儒家文化，都告诉我们以修身为本。《大学》讲：“自天子以至于庶人，壹是皆以修身为本。”从天子皇帝到黎民百姓，每一个人都要以修身为本的，如果不懂得修身之道，再去回忆我们过去当中所做的决定，都是自己的得失之心，都是靠着自己的情绪和喜好，都是靠着自己的主观判断去做事情，所以很难中正。</span></p><p><span><strong></strong></span></p><p><span><strong>牧人以德者集，</strong>通常我们说牧羊，牧牛，牧羊人是不是放羊的，牧人以德者集，什么叫牧人？放开让别人是自由的。比如说，牧羊人，羊是自由的，它都是放开的。注意自由的，放开的，有没有约束，有没有一个标准？他肯定不能让所有的羊都跑掉，所以还是有它的范围，有它的约束的，既给了它自</span><span>由，给了它活动范围，但是又不会离开它所有的约束，不会离开那个道。</span></p><p><span></span></p><p><span>牧人以德者集，我们给一个人，给一群人，放开有自由发挥的空间，我们要不要有约束，要啊！以什么为约束？德，牧人以德，我们以德去约束这些人，并且给这些人足够自由的空间，让他是足够放开的状态，结果是集。我们来聚集了人心，聚集了精神，集合了力量。</span></p><p><span></span></p><p><span>靠什么来集聚人以德？我们遵守着一个共同的德心，有着共同的仁德，共同的思维，共同的精神力量，每个人在这种德行的范围之内是自由的，是开放的，是喜悦的。</span></p><p><span><strong></strong></span></p><p><span><strong>绳人以刑者散，</strong>形成了鲜明的对比，一种是以德行来集合所有的人，一种是绳之以刑者散。绳，是捆绑、束缚。绳之以刑，靠严厉的刑法手段，制度去捆绑着别人，导致的结果是散。</span></p><p><span></span></p><p><span>一散一集，两种不同的结果，所以我们来换位思考，我们是更喜欢被人捆绑、束缚着去做事情，还是更喜欢自由开放地去做事情。自由开放，如果没有了约束不行，没有了约束就像那些羊牛一样，会跑丢了。</span></p><p><span></span></p><p><span>我们人也会跑丢，跑丢的不是我们的身体，是我们的精神，是我们自己不合道了，离经叛道，所以不行的。我们懂得修身之道，以一个德为我们约束的载体，做事情是不失自己的德行的时候，在这个空间内，在这一个准则内，可以自由开放去发挥，我们每个人的优势，每个人是轻松并且长久。如果我们靠严厉的手段和方法，绳之以刑，最后的结果，人们肯定会逐渐地散去。</span></p><p><span></span></p><p><span>儒家讲同样的道理，子曰:“声色之于以化民，末也”，我们靠严厉的手段、刑法去教化于民，最末端的方法即是如此。</span></p><p><span></span></p><p><span>我们来看一个企业，一个团队当中，也是如此，如果我们只是靠一些强硬的制度，去规范每一个人的行为，大家是没有生产力的，内在是没有驱动力的，只是按部就班地去做事情，每个人是没有担当和奉献精神的，没有了义字，那义从何而来呢？</span></p><p><span></span></p><p><span>我们看看《素书》讲的顺序，道、德、仁、义、礼，如何才能让每一个人有担当和奉献精神，有这个义字，我们要用道、德、仁、义，下面自然就有了，上好仁 下好义，我们约之以德，用仁爱之心去做事情，以德为约束做事情，我们才能集合众人之心，集合众人之力量，这个时候才有创造力，每个人内在是有驱动力的，做事情自然会更有动力，每个人都会按照道、德、仁、义、礼来做事情。</span></p><p><span></span></p><p><span>我们用这五个字的思维，看《素书》的每一句话，都是一样的，如何让别人集合在一起，我们以道、德、仁、义、礼，去教化于人。决策于不仁者险，如果我们的决策是不符合道、仁、义、礼，结果是危险的。</span></p><p><span></span></p><p><span>所任不可信，我们不能任用不信任的人，我们该去信任什么样的人呢？我们信任有道、德、仁、义、礼之人。这五个字贯穿《素书》的每一句话，我们去理解每一句话的时候，都把这五个字的思维方式，贯穿始终，真的很简单。听上去很简单，可似乎做起来又很难，我们做不到。如果我们理解了这五个字，其实做起来亦很简单，如果我们不懂得修身，不能以这五个字来修正自己，做起来就很难。</span></p><p><span></span></p><p><span>我们反复地讲《素书》平淡无奇，听起来似乎没有什么意思，可是真正用起来的时候又玄妙无比。当我们遇到事情的时候，思考《素书》所讲的内容，当我们不断地修正己身的时候，用《素书》的道理来做事情，是可以其未兆易谋的，在事情未发生之前，就可以提前去谋划，这就是妙用。</span></p><p><span></span></p><p><span>我们要想做事情离不开妙用的，我们以修身为本，修身是根本，可是修身这个根本是没法用的，要用的时候是必然要学习方法的。</span></p></div>"
},{
    "title": "《素书》第二十四讲 莫听谗而美",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第二十四讲 莫听谗而美</strong></span></p><p><span><strong></strong></span></p><p><span><strong>小功不赏，则大功不立。</strong>小功有小的功劳，如果不去奖赏，这个时候人们心中会失去希望，会觉得失望。当觉得失望的时候，没有动力去做更多的事情，立更大的功，做任何事情都有势和节点。 </span></p><p><span></span></p><p><span>我们讲运势，何来势？动起来才叫做势。而人们的心性当中，是需要不断地鼓励，起伏，找到每件事情的节点，这个势才能起来。当我们做的是一个短暂的事情，比如这个事情很快就可以结束，我们要一鼓作气的，要不停地激励和鼓励，保持在一种状态上，快速地把它完成。</span></p><p><span></span></p><p><span>当一件事情，用的时间会比较长才能完成，这个时候我们要注意起伏的。就好比是一个波浪线，要不停地去想办法，用状态，用奖赏，用其他的方式，定期地鼓励和激励着每一个人。</span></p><p><span></span></p><p><span>当状态快要下来的时候，就要不停地去激励，保持一种势头，松弛有度，这个时候才会顺势而为，才能把这件事情做好。当势头不断地再往下降，降到一定的程度，很难再激励起来的，所以无论做任何事情，势头非常重要。</span></p><p><span></span></p><p><span>学《素书》是要用的，我们一定要懂得其未兆易谋，在每件事情要发生之前，我们就掌握了事物发展的规律，这个时候我们会提前应用方法，不让这件事情的势头下来。这是作为一个谋略之人，作为一个用人之人，是必然要懂得的道理。</span></p><p><span></span></p><p><span>绝大多数还没有开始修行的人，不会像我们学习和修行一段时间的人，对于功、过、悲、喜，没有那么大的起伏。我们在用给那些没有修身的人，不是每天都在修行环境当中的人，我们要掌握人的心理，要去讲小功，要不断地去调整一件事情的势头，找好每一个节点，像波浪线一样起起伏伏，我们才能顺势而为，才能建立更大的功，做成更大的事情。</span></p><p><span><strong></strong></span></p><p><span><strong>小怨不赦，则大怨必生。</strong>小的怨恨，小的抱怨，如果不赦免，久而久之，必积累成大怨。我们先讲赦，何为赦？赦并不是遇到问题，不去指责和批评，而是指正批评以后，不再去惩罚，这叫赦免。当我们经常去赦免别人小的过错，小的抱怨，这个时候才会平息，不会生大的怨气和抱怨。</span></p><p><span></span></p><p><span>这两句话结合在一起，告诉了我们一种规律，任何事情都是积累而来，当有小功的时候，我们懂得去奖赏，会积成大功。有小怨，我们懂得去赦免，不让小怨生成，就不会积累成大怨。</span></p><p><span></span></p><p><span>比如，人和人之间的怨恨，不是刚开始就很大，一开始可能只是有很小的抱怨和不满意，有一些地方我们看不顺眼，有的地方不合我的心意，可是这种小的怨恨，如果我们不去管，不把它消于无形，久而久之，就会形成更大的怨恨。</span></p><p><span></span></p><p><span>告诉我们任何事情，都是积累而来的，好的事情，我们让他保持积累的状态；不好的事情，我们要懂得随时消灭于无形，才不会生成更大的怨恨。积土成山，积水成渊，积善成德，积怨成恨，所有的事情都是积累的。</span></p><p><span></span></p><p><span>一座大山，是由土一点一点积累而来的。一个深渊，是由每一滴水积累而来的。我们的德行，是由每一个善念、善行所积累而来的。同样怨恨，也是一点一点积累而来的。</span></p><p><span></span></p><p><span>我们明白这个道理，才能其未兆易谋，很多事情在没发生之前，我们要提前去谋划，提前去解决，就防止了很多事情的发生。用中医的话，是叫治未病，没有得病之前是先预防先治疗的。包括我们的身体出问题，也是同样的道理，当我们的身体刚刚出现问题的时候，尽早发现，尽早解决，才不会形成更大的病痛。</span></p><p><span><strong></strong></span></p><p><span><strong>赏不服人，罚不甘心者叛。</strong>我们的奖赏，不能令众人信服的时候，惩罚让人觉得不甘心的时候，所导致的结果就是叛，叛离，背叛。赏不服人，没有那么大的功劳，我们去奖赏，会有很多其他人不服的。罚不甘心，当我们去惩罚一个人的时候，当事人如果觉得不甘心的，久面久之必生叛离之心。</span></p><p><span></span></p><p><span>在一个家庭当中，也是一样的道理，比如，我们做母亲或者做父亲有两个孩子，我们可能更偏爱其中的一个孩子，就会导致另外一个孩子心有不甘，孩子会认为我们给予他的太少，而奖赏另外一个孩子的太多，他经过一段时间的观察和自己的心理活动，就会叛离，叛离孝道，觉得父母对他是不公平的，心里对父母是产生怨恨的，和父母之间是有了隔阂的，就形成了叛。</span></p><p><span></span></p><p><span>在一个企业当中，也是一样的，我们奖赏某一些人的时候，如果其他人都觉得不服，心里就会产生隔阂。我们去惩罚一个人的时候，也如此，如果他自己觉得对自己的惩罚过重，是不甘心的，就会生起叛离之心，一旦有合适的机会，必然会造成不好的后果。可能离开了这个地方，心有怨气，就会做出一些伤害集体利益的行为，有伤害集体发展的行为。</span></p><p><span><strong></strong></span></p><p><span><strong>赏及无功，罚及无罪者酷。</strong>酷，是残酷，什么样的事情，我们会认为是残酷的？让人无法理解和无法接受的事情，我们称之为残酷。这件事情真的让人无法理解，我们就会认为做事情太残酷了，对我们太残酷了。</span></p><p><span></span></p><p><span>如果我们奖赏了很多没有功劳的人，为什么会奖赏没有功劳的人？通常都是因为个人的喜好，就是欣赏和喜欢某一个人，或者这个人就是讲话比较好听，没有功劳我们也去奖赏，会让其他人无法接受，无法理解。</span></p><p><span></span></p><p><span>罚及无罪，明明没有罪过，没有过错的人，我们还去惩罚，会让当事者觉得无法理解，难以接受，所以就会认为这是一件很残酷的事情。</span></p><p><span></span></p><p><span>我们再来看这四句话，小功不赏，则大功不立，小的功劳，如果我们不去奖赏，不会立大的功劳。小怨不赦，必生大怨，小的抱怨，怨恨，如果不去赦免，抓住不放，一定会生成大的怨恨。赏不服人，罚不甘心的时候就会导致叛离。赏无功者，罚无罪者，就会让人觉得残酷。</span></p><p><span></span></p><p><span>这四句话听起来如此的简单，真正要做起来很难。难在什么地方？这四句话都告诉我们做事情要中正，不偏私，不偏不倚，没有自己的个人喜好，不会感情用事，当我们是中正的态度，不会用私人的感情，去看待事情，去解决问题，会发现其实很简单。</span></p><p><span></span></p><p><span>我们看整个《素书》，尤其是遵义章，我们做事情要合时宜，这句话说起来如此的简单，可是做起来却又很难。为什么会觉得难？因为没有修己身，可是一旦我们知道以修身为本，让自己的行为中正，符合道、德、仁、义、礼，修身之根本，安身立命之根本，当我们有这个根本以后，我们整个人就会变得中正，看问题不带情绪化，不带个人的喜好，其实用起来《素书》非常的玄妙，并且简单实用。</span></p><p><span></span></p><p><span>这四句话对于没有修身的人，懂得了道理，也很难用得出来，可是对一个懂得修身的人，时时刻刻以修正自己的行为，为人生准则的人，这四句话乃是整个遵义章，做起来其实都很简单。</span></p><p><span><strong></strong></span></p><p><span><strong>听谗而美，闻谏而仇者亡。</strong>听谗而美，听信谗言，觉得心里很美。闻谏，别人的忠言，谏言。我们听到以后，心里生仇恨，结果必然灭亡，什么叫谗言？我们喜欢听什么，对方就讲什么，就会忽略了事情的真相和事情本身，别人开始投其所好，而我们自己又认不清自己了，只喜欢听好听的话，只喜欢听赞美的话，别人自然就说我们喜欢听的话，不去管事情的本身，我们不懂得去觉察，不懂得去觉知，还沉浸在自己美美的心理状态。</span></p><p><span></span></p><p><span>当别人讲忠言的时候，讲谏言的时候，我们对人家心生仇恨，结果必然是灭亡的。什么样的人才会讲谏言？没有任何一个人，讲一番话是为了引起我们的怒气的，引起我们的脾气，引起我们的仇恨。讲谏言的人，讲忠言的人，无非是心怀着自己的那颗正义之心。</span></p><p><span></span></p><p><span>我们明知道讲这句话，他可能不高兴，我明知道讲这句话，他可能心生怨恨。但是我们要对得起那颗正义之心，我们要直言不讳的，要把自己最忠心的那个东西讲出来。我们要懂得珍惜这样的人，在我们的人生当中，有几人肯讲我们的缺点，肯讲忠言，敢去讲这种谏言，很难得的。</span></p><p><span></span></p><p><span>尤其是到了我们这个时代，人们都愿意去讲让对方听着高兴的话，可是那些高兴的话，往往会让我们迷失自己的。我们都喜欢别人的赞美，依赖于别人的赞美，沉浸其中的时候，看不到别人讲的只是恭维的话。</span></p><p><span></span></p><p><span>但是懂得修身之道的人，就不一样了，无论对方讲的是忠言，谏言，还是赞美我们的话，我们都不迷在其中，不沉浸在其中，我们很清楚地就能看到，谁讲的什么样的话，是发自真心的，而谁只是简单的恭维。</span></p><p><span></span></p><p><span>整个《素书》都是如此，如果我们懂得不断地修身，所有的事情一目了然，都可以明察秋毫的，清清楚楚地就摆在那里。只不过我们沉浸在其中的时候，都是按照自己的喜好和情绪来思考问题的时候，我们就看不清事实了，每天沉浸在自己的幻想之中，沉浸在他人的花言巧语之中。</span></p><p><span></span></p><p><span>别人说我们很漂亮，信了。可是当有人说我们身上的缺点的时候，心里却生了怨恨，实则这是没有智慧的表现，也是不懂得修身的表现。</span></p><p></p><p><span><strong>能有其有者安，贪人之有者残。</strong>能有其有者，能够心安理得拥有的人心，自然是安的。何为能有？自己和拥有的东西是相匹配的，称为能有。能有其有者，我们自己的心自然就是安的，因为理应得到本有的东西。</span></p><p><span></span></p><p><span>贪人之有者残，反之本来不是我们的，可是我们要贪来，导致的结果残。残分为两个方面，第一个方面是心里的，第二个方面是呈现出来的现状。我们看看心里的残从哪里来？贪人之有，我们的心是不安的。</span></p><p><span></span></p><p><span>比如，我们会看到很多人贪人之有，贪恋别人的东西据为己有，别看这些人表面上说的坦荡，似乎毫无愧疚之心，实则不是的，他的内心一定是不安的，只不过自己在逞强的状态，没有表现出来罢了。</span></p><p><span></span></p><p><span>我们去看做过很多坏事的人，会做噩梦的，为什么会做噩梦？就是因为自己的良心发现了，自己觉得心里是不安的，才会产生恐惧。我们仔细地思考，自己的这一生当中，当我们如果认为是占了别人的便宜，是贪了其他人的东西，心里真的安吗？可能再看到那个人，想到那个人的时候，心里都是不安的状态，这就是残。</span></p><p><span></span></p><p><span>这是天性的东西，不可泯灭的，人人都有那个善良的天性。只不过被欲望掩盖住了而已，可是在夜深人静的时候，心里一定是不安稳的，不健全，所以称之为残。</span></p><p><span></span></p><p><span>我们再来看呈现出来的现状，我们贪人之有的时候，贪到一定的程度，别人必然心生怨恨，产生报复的想法，报复的行为。我们贪得越多，就会导致自己的结果越不好。不该我们拿的东西，天道会惩罚于我们，人道亦会惩罚于我们，所以最后导致自己的结果依然是残的，不健全。</span></p><p><span></span></p><p><span>此心安处是吾乡，人生最难得的莫过于心安，如何才能心安？只拿自己该拿的东西，只拿自己该拥有的，自己相匹配的，这个时候我们身心自然是安泰的。一个身心不安泰之人，怎么可能坦然的面对生活呢？会随着时间的推移，随着年龄的增长，我们的内心变得愈加的恐慌，愈加的孤独和落寞。</span></p><p><span></span></p><p><span>我们读古之圣贤的传记，或者看电视，或者读书也好，看生活当中所发生的事情也好，只要是经常做坏事的人，贪得无厌的人，良心很难安的，随着年龄的增长，很多人的欲望开始变少了，开始变小了。这个时候再回顾自己一生所做的事情，开始觉得有愧疚了，是不是残的状态。</span></p><p><span></span></p><p><span>我们学习《素书》，再回过来看，仿佛每句话都讲到了，我们生活当中的要害，告诉我们去做合时宜的事情，可是他是反过来讲的，告诉我们不要去做什么样的事情，当我们懂得不要去做什么样的事情，所做出来的事情自然就是合时宜的，就会避免很多问题的发生。</span></p></div>"
},{
    "title": "《素书》第二十五讲 安礼章第六",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第二十五讲 安礼章第六</strong></span></p><p><span><strong></strong></span></p><p><span><strong>礼者，人之所履，夙兴野寐</strong>，<strong>以成人伦之序。</strong>这是《素书》开篇所讲到的，礼是人人都要遵守的标准和法则，是人与人之间维持秩序的法则，定尊卑的用处，礼之用和为贵，我们ー切的礼都是以和为贵，以让大家更舒服更和谐的状态为贵。</span></p><p><span></span></p><p><span>安礼章，安，是安而行之，我们很安然地，很安稳地去履行的法则。人生于天地之间要想很安定，很安然地度过，要遵守的礼法，要成为每个人的行为准则，如何才能更安然地去做好事情？如何更安然地行走于天地之间所要遵循的礼法？</span></p><p><span><strong></strong></span></p><p><span><strong>怨在不舍小过，</strong>人为什么会生怨恨是因为不懂得舍小过，比如，别人犯了一些小的过错，我们不舍，就是耿耿于怀，一直放在心上，就会积累成更大的怨，甚至是恨。 </span></p><p><span></span></p><p><span>举个例子，夫妻之间在吵架的时候，有可能把三年以前或三个月以前，所犯的过错，拿出来不停地重复，不停地讲，这就叫不舍小过，越是这样不舍小过，越是如此，争吵的时候，反而让彼此生出更多的抱怨和怨恨。</span></p><p><span></span></p><p><span>什么叫安礼？当不舍小过，两个人不停地争吵就会引起更大的怨恨，这就是不懂礼了，礼之用何为贵，是因为我们不舍小过，让这个环境让彼此开始变得不和谐了，就会生更大的怨恨。</span></p><p><span></span></p><p><span>我们如何能安然和安稳地去生活，去经营好家庭？朋友之间也是一样的，如果我们总是不舍小过，就会让彼此产生更多的抱怨。同事之间也是一样的，如果我们不舍小过，就会让关系变得尴尬，变得不和谐，就会生出更大的怨恨。</span></p><p><span></span></p><p><span>上下级也是同样的道理，如果我们总是不舍小过，每当遇到事情的时候，总是拿过去的小过错来讲，就会让彼此生怨恨。</span></p><p><span></span></p><p><span>一旦开始生这种抱怨和怨恨，不停累积的过程，滋惹祸端，这就是不和谐。当我们出现了这种不和谐，就无法安然地去做事情，无法安稳地立于天地之间，所以只要有怨的产生，就是不和谐，就是没有礼。不懂得用礼去维护每一个关系，不懂得遵守礼法。</span></p><p><span></span></p><p><span>我们再来看礼，绝不是表面的行为上的，我们鞠个躬，握手，微笑就是礼了，不尽然，达到和谐的状态，我们的行为准则，所讲的话，都让大家觉得和谐的，觉得舒服的状态，这个才叫礼。</span></p><p><span></span></p><p><span>我们学圣贤的文化，学知识一定不要死板，一定不要只是停留在事情的表面，安礼章第六，开章就告诉我们，当我们不舍小过，让彼此生怨恨，让对方会不停地抱怨的时候，就是没有礼。</span></p><p><span></span></p><p><span>有怨就是不和谐，就是不能安礼，所以我们要懂得赦免，舍弃别人的过错，别人犯错了，我们在舍的是什么？不会因为这件事情耿耿于怀，既往不咎，已经过去的事情就让它过去，这个就是礼之用和为贵。</span></p><p><span></span></p><p><span>当我们懂得赦免别人的过错，别人心里才是舒服的状态，舒服的状态不生怨恨，这个时候才是和的状态。</span></p><p><span></span></p><p><span>如果在一个家庭当中，是不停地争吵，不停地揪住彼此的过错不放，生出怨恨的时候，别人来到这个环境当中，也会感受到这种不和谐，古话常讲：</span><span>“家和万事兴”，如果揪住过错不放，生怨恨，就没有和。</span></p><p><span></span></p><p><span>万事都兴不起来的，整个家庭的氛围彼此不高兴，孩子不高兴，家里有老人的也跟着不高兴，甚至家庭的亲朋好友也跟着不高兴。</span></p><p><span></span></p><p><span>在企业当中也是一样的，如果同事之间，上下级之间都是揪着过错不放的，会升起很多的怨恨，所导致的状态就是不和谐的，当这种不和谐的状态产生，一个团队如何能有战斗的能力，如何去创造更多的事迹？</span></p><p><span></span></p><p><span>所以都是由于最小的一个开端，看似我们平时不放在心上的小的过错，会积累成怨恨，导致整个环境的不和谐，所以很难安稳地立于天地之间，不懂得安而行之，是做不到的。</span></p><p><span></span></p><p><span>《素书》所讲给我们的道理，真的是可以深入到我们生活的每一个角落，可以去挖掘我们平时自己不在意的那些事情，我们觉得有一点小的过错，又算得了什么，只不过拿来说一说，让他更加的记住自己所犯的过错，我们越是这样的思维，越会起反的作用。</span></p><p></p><p><span>当我们换位思考的时候，如果犯过一个过错，是不是很担心别人再提起，甚至会有一种心惊胆战，“他不会又说我那个事情吧，这都过去三个月了，他怎么还是不忘记呢！”对方越是提及，我们对他产生的怨恨就会越深，久而久之，必引来祸端，让整个环境开始变得不和谐。</span></p><p><span><strong></strong></span></p><p><span><strong>患在不豫定谋，</strong>我们先讲谋，做事情都要讲谋划的，提前规划，人无远虑必有近忧，如果我们不去提前谋划和规划一些事情，一定会有近处的忧患。</span></p><p><span>举个例子，比如我们现在装修，从一开始就要谋划的，哪个地方背景墙装成什么样子，玄关装成什么样子，沙发买什么样的，电视墙做成什么样，卫生间做成什么样，每个卧室装成什么样子，这都是一种谋划。</span></p><p><span></span></p><p><span>如果我们没有提前谋划，装修的期间再来考虑，会发现哪里做的都不合适，电源留的不合适，水跑的也不合适，家具买的也不合适，这就是没有谋划所带给我们的隐患。</span></p><p><span></span></p><p><span>我们看做事情是不是一样的？如果我们不懂得提前去谋划事情，事情临近我们才发现，就会出现祸端隐患，什么叫隐患？就是出现了很多事情，是我们无法掌控的，称为患。</span></p><p><span></span></p><p><span>《中庸》讲：“言前定则不跲，事前定则不困，行前定则不疚，道前定则不穷。”言前定，则不跲。我们讲话之前先要思虑我们要讲什么事情，这个时候讲话才是流畅的。</span></p><p><span></span></p><p><span>举个例子，我们现在想去和一个同事聊一件事情，需要自己先思虑，先谋划我要聊什么，中心思想是什么，说起来才是流畅的。</span></p><p><span></span></p><p><span>比如，今天我们去见一个客户，是不是提前要谋划的，要思虑和谋划，要讲什么事情，要围绕着可能要问出来的问题，或者现在心里还存在的顾虑，我们提前有思量的时候，讲起话来才是流畅的。</span></p><p><span></span></p><p><span>事前定，则不困。在做事之前我们就开始有谋划，开始规划，才不容易被困难所障碍住。如果没有思考，我们冲动地去做事情，做起来事情和我们想象的不一样，很容易知难而退，停止不前了，或者困在其中无法破局，因为提前没有规划过，没有谋划过。</span></p><p><span></span></p><p><span>行前定，则不疚。我们的行为，做事情之前，没有规划，没有定力，做事情就容易产生愧疚，我们在生活当中，工作当中，经常犯这样的错误，产生了一个行为，这个行为做完之后，我们又愧疚后悔了，“是不是不该这样做？是不是不该这样对他？”产生了愧疚。</span></p><p><span></span></p><p><span>道前定，则不穷。如何事情才能变得长久？道前定，我们做的事情都是合道的，都是合于德的，都是向上的，都是向善的。如此我们做的事情才能变得长久。</span></p><p><span></span></p><p><span>引用《中庸》这一段，在告诉我们，我们要谋划的是什么？首先是要合于道的，如果我们的谋划是不合于道，不合于德，不合于仁，不合于义，不合于礼，不长久，必引祸端。</span></p><p><span></span></p><p><span>整个《素书》把安礼章放到最后，用的前提是修身，道、德、仁、义、礼。所以我们再来听谋划，一定不要理解偏了，认为是不是我随意地谋划就可以了？不是的，是我们谋划必然要合于道、德、仁、义、礼，缺一不可，一旦我们缺少的时候，只能得到当下的利益，但是得当下的利益，必然损失长久的利益，一定会有更多的隐患和祸端在其中。</span></p><p><span></span></p><p><span>患在不豫定谋，我们再来讲讲定，定分为两层意思，第一，我们说确定了这件事情，是不是有了方向？第二，定是什么？不偏，我们说定海神针，我们讲定力，不被欲望所动，不被杂念所干扰，非常中正的意思。</span></p><p><span></span></p><p><span>我们再来看看患在不豫定谋，第一，是我们提前在规划方向、目标。第二，是我们的心不为所动，不会偏的。所以我们谋划的事情，也不会偏于道，也不会不合乎礼，也不会让别人觉得不舒服，也是以和为贵，我们的谋划才能变得长久。</span></p><p><span></span></p><p><span>我们千万不要产生误区，很多朋友一听到谋划这个字，好像都是阴谋，实则不然，谋划本身是没有属性的，没有好或者不好，只不过谁来谋划，这个人的修为，这个人的心胸和心念，所谋划出来的东西自然就不同。</span></p><p><span></span></p><p><span>前面我们讲德足以怀远，一个有德行的人，谋划出来的事情，一定是考虑得更长远的，一定不会被当下的利益所动，不会为当下的得失所动，所以同样</span><span>是谋划，一定有人谋划得更合道，一定有人谋划得更长久。同样是谋划，也一定有人谋划得更短暂，是为了利益，为了当下的得失去谋划事情。</span></p><p><span></span></p><p><span>我们要明白这个道理，万事万物都是要提前谋划的，只不过谋划的方向不同。我们刚才所举的例子，即使一个家里的装修也需要谋划，做一个生意也需要谋划，即使人与人之间的聊天，也需要提前谋划的，也需要思虑我要讲什么样的话。</span></p><p><span></span></p><p><span>再来讲谋，《论语》讲:“君子谋道不谋食”，这个食就代表了自己的利益，自己的欲望，自己想要的一切。可是君子不是这样的，君子是谋道的，我做的事情合不合道，我们做的事情能不能方便和利益他人。</span></p><p><span></span></p><p><span>举个例子，要想把一件工作做得好，其实很简单，只需要谋划两件事情就好了，第一，我们在工作的时候，要谋划如何让同事更方便，这里的同事就包含了上级下级和我的平级。第二，谋划的如何让我的客户更方便，怎么样能给客户带来更多的利益和方便，只需要谋这两件事情就好了。</span></p><p><span></span></p><p><span>这样我们的行为就会发生变化，当这样去谋划的时候，何用谋食，怎么还需要计较自己的得失自己的利益，方便了那么多人，怎么会没有我们的利益呢！可是如果我们只谋食，只想着自己怎么轻松，不他人是否方便，只想着自己当下赚到利益就好了，不管客户会不会长久，不管客户会不会舒服，这个时候怎么能谋来食？</span></p><p><span></span></p><p><span>首先我们都是不合道的，就更谈不到自己的那个利益了，所以一定要懂得豫定谋，这个定字用的好，定首先他是方向是目标，但又是中正的，又是不被所扰的，这个叫定，这个时候我们才能更长久，才能让自己变得更坦然。</span></p><p><span></span></p><p><span>注意安礼章，这个时候我们才能安稳，才能很安然地行走于天地之间，行走于我的企业之间，行走于同事和客户之间，很安然的状态，无愧于心，这就是我的行为准则，一切都是以和为贵。</span></p></div>"
},{
    "title": "《素书》第二十六讲 福祸在善恶",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十六讲 福祸在善恶</strong></span></p><p><span><strong></strong></span></p><p><span><strong>福在积善，祸在积恶。</strong>福祸如何来的？我们不停地积善就有福，不停地做恶事就有祸。我们再往前看，我们定的谋划，如果是善的，就会往善道去谋划，不停地积福。可是，如果我们的思维心念是恶的，就会往恶的方向去谋划，最后是害了自己，给自己积累了更多的祸患。</span></p><p><span></span></p><p><span>《太上感应篇》里面讲:“福祸无门，惟人自召，善恶之报，如影随形。”福祸是无门的，都是自己感召而来的。如影随形，像我们的影子一样，时时刻刻跟随在我们身边，甩不掉的。</span></p><p><span></span></p><p><span>福祸都是我们自己感召而来的，但是到现在依然有很多人不相信福祸，不相信善有善报，恶有恶报。我们越是学习圣贤文化的人，越是修行之人，不断地修自己的身心，就会更加的坚信因果不空，更加的坚信善恶有报。</span></p><p><span></span></p><p><span>我们再来讲，善恶和福祸，有的人生活当中，可能会说：“我们明明看他做的不是善事，可是为什么生活还很好？”首先每个人对于善恶和福祸的标准不同。举个例子，我们看到的可能别人是伤害了他人，可是我们不知道他是什么样的发心，不知道他这件事情的背后他做了什么，以我们自己的标准在衡量善恶。</span></p><p><span></span></p><p><span>我们学习《了凡四训》，里面很多地方都在讲，何为善恶，何为是非，何为曲直，何为成人之美。我们的标准和圣人善恶的标准不同的，很多朋友会深有感触。尤其是我们在不断地学习以后，对善恶的标准开始变得不同了，对福祸的标准也不同了。</span></p><p><span></span></p><p><span>我们以前看到的福祸，无非是这个人有钱，就是有福德，现在来看未必尽然。这个人长得漂亮，就是有福德，现在来看不一定的。这个人口才很好，能说会道就是福德，也不好说。</span></p><p><span></span></p><p><span>我们学《了凡四训》的时候，有两个例子，说的是孔子的学生，一个是子贡，一个是子路，当时鲁国有一个规定，只要是从其他的诸侯国，赎回来的人，可以到鲁国去领奖赏的，因为那时的诸候国很多，纷争四起，有很多鲁国人被卖到其他的国家做奴隶，或者做丫鬟。这个时候只要有人把他赎回来，就可以去国家领赏的，领钱财。</span></p><p><span></span></p><p><span>子贡是一个很富足的人，他从其他的国家赎回来人，并没有去领赏，领钱财。孔子听到了这件事情，表示很不满，他说子贡这样做是错的。为什么？因为当时的环境，还是穷人多，富人少，子贡这样做看似是大义的，不为钱财所动，可是他不去领钱财，以后没有人再去其他国家赎人了。</span></p><p><span></span></p><p><span>我们看似他当下做的是一件好的事情，可是没有站在更多人的角度去考虑，这个不是善，是恶。子路看到有一个人溺水，子路把他救了上来，这个人非要把家里的牛送给子路，感谢救命之恩，子路收下了这头牛。孔子知道了这件事情，对子路表扬，内心很欢喜，说：“从此以后，鲁国多救人者。”以后的鲁国人看到有人溺水，还会下去救的。</span></p><p><span></span></p><p><span>如果从我们常人的善恶标准，会认为子贡是善，子路是恶，我们看他救了人怎么还要人家的牛。善恶，每个人的标准不同，同样对于福祸每个人的标准也不同。讲这两个故事，是告诉我们ー定要坚信善恶之道，必有报应的，儒释道的文化都讲这样的道理。</span></p><p><span></span></p><p><span>《易经》讲:“积善之家必有余庆，积不善之家必有余殃。”所以ー定不要去杯疑，善恶终有报，只不过我们当下，衡量善恶的标准和福祸不同罢了，只是我们的认知不同，但是不代表福祸、善恶会有偏差，不会的。</span></p><p><span></span></p><p><span>我们要懂得修身为本，做每一件事情的时候，都要符合自己心中的善道，我们所有的谋划，所思、所想、所行，一定是不离善道的，我们才能减少祸端。如果我们所思所谋，是不合善道的，当下看似有所得，从福祸的角度，善恶的角度，长久来看，必有所失，这亦是隐患。</span></p><p><span><strong></strong></span></p><p><span><strong>饥在贱农，寒在惰织。</strong>饥饿是怎么产生的？饥在贱农，轻贱农业。寒在惰织，到了冬天为什么会寒冷？平时懒惰不织布。这里只是讲了两个例子，因为在那个时代自己吃饭，要自己种地去劳作，自己穿衣要自己去织布，是符合时代背景的。但是这两句话讲给我们的道理却非常的深刻。</span></p><p><span></span></p><p><span>饥</span><span>在贱农，为什么会饥饿？轻视农业，不种地，不劳作。现在是一样的道理，为什么会饥饿？因为我们不努力奋斗，不努力工作，所以饥饿。</span></p><p><span></span></p><p><span>为什么寒冷？我们没有努力地织布。现在也是一样的，我们为什么寒冷？没有努力地进取，因为赖惰，所以让自己饥寒交迫。我们出生在这样的时代，本身是衣食富足的，如果在这个时代还有人吃不上饭，还有人穿不上衣，那是自己实在太懒惰了。</span></p><p><span></span></p><p><span>我们想要什么，自己就要努力地奋斗，千古不变的道理。我们努力的方向不要有差错，积善和积恶两条路，如果努力的方向错了，只会让自己变得越来越不好。如果我们谋划的方向有问题，一定会有祸端发生，这是在讲道家的思想。</span></p><p><span></span></p><p><span>为什么当下我们会贫穷？因为前世所造的业力太多了，就是做过那么多不好的事情，所以形成了恶业，形成了业力，使我们今生的生活变得不好，让我们自己没有智慧，让我们性格有很多的缺陷，都是因为自己前世所造的业力积累而来的。所以这同样也是善恶之报，也是福祸之报。</span></p><p><span></span></p><p><span>再回到当下，我们不管前世所造的善业或者是恶业，当下所呈现出来的，就是当下的这个样子，我们要想变得更好，就要积极地努力种因，我们想吃得更好，可以的，我们努力奋斗。我们想穿得更好，我们去勤奋地工作。</span></p><p><span></span></p><p><span>我们想让自己变得更有学识，就积极地进取，学海无涯苦作舟，勤学苦练。我们想要变得更有智慧，那就要去修自己的身。我们想让自己变得更有仁德，就去多关爱他人，多去利益他人。所以两句非常简单的话，交给我们的道理却是很深刻的。</span></p><p><span><strong></strong></span></p><p><span><strong>安在得人，危在失士。</strong>人和士相对应的，讲的都是一个意思，只不过对仗工整。我们要想很安定的做一件事情，很安定地维护好一个环境，很安然地经营好一个企业，在于得人。危险就在于失士，失去了这个人。</span></p><p><span></span></p><p><span>我们经营一个企业，或经营一个团队，如果人人各司其职，团队就是安稳地前行，就可以安而行之。如果我们失去了恪尽职守的那些人士，我们的企业就是不安的，是动荡的，总出现问题，总出现隐患，总出现危机，这就是人员的不稳定。</span></p><p><span></span></p><p><span>举个例子，比如，在一个企业当中，某一位恪尽职守的人，或中层领导离开了，是不是他所负责的这些事就会变得不安定，就会有危险和隐患，因为我们失去了这个人。同时这里我们还要注意的是，如果发现总有人才流失，是一个很危险的信号，为何会有人才不停地流失？</span></p><p><span></span></p><p><span>说明我们本身是有问题的，说明我们的企业处事风格是有问题的，说明我们的利益是不均等的，说明这些人在这里是感受不到快乐的，这个时候就会失士，失去人士，失去人才，是一个极其危险的信号，我们一定要懂得去观察，自己的团队当中所出现的问题。</span></p><p><span></span></p><p><span>我们做生意，比如我们开一个店铺，做一个小的买卖，可能店铺只有两三个人，可是这个时候我们要观察的是什么？有没有顾客在不停地流失，如果有顾客不停地流失，说明有问题的，人越来越少了，为什么？一定是我们自己谋划、思虑得不够，我们没有去谋道了，没有想着方便和利益更多的人，所以人变得越来越少，很危险的。</span></p></div>"
},{
    "title": "《素书》第二十七讲 富在迎来时",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十七讲 富在迎来时</strong></span></p><p><span><strong></strong></span></p><p><span><strong>富在迎来，贫在弃时。</strong>富在迎来，我们先讲迎，欢迎、欢喜、主动叫迎。要想富足，我们就要欢迎，欢迎什么？这句话特别有意思，我们讲富足，不单单指的是财富，或是物质。</span></p><p><span></span></p><p><span>我们先讲财富，要想让自己变得富，怎么办？迎来，欢迎什么？迎什么就会得什么。当我们想要富裕的时候，想要自己更有钱，那么就去迎着这件事情而上，主动地积极地去创造财富。</span></p><p><span></span></p><p><span>比如，想让朋友更富有，就是拥有更多的朋友，怎么办？迎来，欢迎，主动地去交朋友，是不是我们的朋友就会变多。有的人说:“我想让自己的精神更富足”，迎就好了，我们主动地积极地去学习，去精进，精神就会富足。有的人说:“我想让自己的学识变得更富足”，好吧！主动地积极地去学习，去创造，去体悟，去总结可以了。</span></p><p><span></span></p><p><span>贫在弃时，为什么会贫瘠？放弃之时，一个是迎来，一个是放弃，没有学识又放弃，不愿意努力去学习。我们没有财富，可是又放弃，不愿意去积极进取，就会导致贫。我们放弃了什么事情，在什么事情上就是贫困的，就是贫瘠的。</span></p><p><span></span></p><p><span>这两句话非常的耐人寻味，富在迎来，贫在弃时，我们去思考，生活当中的所有事情都是一样的，要想让哪一方面变得富足，我们就去主动地欢迎什么事情，看一看在哪方面贫困，都是一样的，是我们放弃了。</span></p><p><span></span></p><p><span>有的人说:“我想学习的，我想让自己博学多才”，那只是想，可是我们放弃了，我们有努力地学习过吗？有积极进取吗？所以从这方面就是贫瘠的，就是贫困的。</span></p><p><span></span></p><p><span>有的人说:“我也想拥有更多的朋友”，可是有朋友来找我们的时候，我们也不欢迎。我们也不愿意主动地去和人家交朋友，是我们放弃了，关于朋友就是贫困的贫瘠的。</span></p><p><span></span></p><p><span>财富也是同样的道理，谁不想变得更有钱呢？大家都这么讲，可是我们真的有付出行动吗？有付出多少呢，有多努力呢，有没有给自己积累善业呢。我们做的事情会不会给自己积累福德，如果都没有，这不是在自我放弃吗？结果一定是贫困的。</span></p><p><span></span></p><p><span>我们去看无论在哪方面富足的人，他都是积极进取的，都是主动的，都是欢迎的。一个朋友特别多的人，他很积极地交朋友，很欢迎每一个朋友到他这里来，他的朋友就是富足的。</span></p><p><span></span></p><p><span>一个有财富的人，他每天都在积极地努力，在考虑怎么去做更多的事情，怎么创造更多的价值，怎么把团队做得更大，财富就开始变得更富足了。</span></p><p><span>有的人说:“这个人学识很富足”，有一个很有意思的规律，越是学识富足的人，他越努力地精进地学习。越是没有知识的人，知识匮乏的人，越不努力去学习的。</span></p><p><span></span></p><p><span>交朋友也是一样的，朋友越多的人，越喜欢交朋友。越少的人，越不愿意和人打交道。越成功的人，越努力积极进取。越是贫困的人，越不努力，越懒惰，越松散，是我们自己进入了一种规律和轨迹，而不自知。</span></p><p><span></span></p><p><span>我们一定要明白，及时地修正自己，要想让自己变得更富足，就去主动地迎，发现自己哪方面是贫困的，要想去改变和突破，我们就要不放弃，要主动去出击，主动的去欢迎自己想要的事情，我们才能把自己的轨迹改变。</span></p><p><span><strong></strong></span></p><p><span><strong>上无常操，下多疑心。</strong>操，是操守。做事情没有一定的规律，反复无常。我们讲一个人的操守，指的是一个人的行为，一个人的品德。</span></p><p><span>如果处在上位的人，做事情是没有规律的，是反复无常的。什么反复无常？行为反复无常，品德反复无常，情绪喜怒无常，这个时候就会导致下多疑心，处在下位的人经常有怀疑，心不安稳，心不稳定的状态。</span></p><p><span></span></p><p><span>总是担心他会变，因为他喜怒无常，做事情没有规律，这句话说出来会不会让他暴怒，处下位的人不敢讲话的，这个事情不敢去做，做完之后他会不会苛责，甚至惩罚，所以处下位的人很多的疑心，导致心不安稳，人心是涣散的状态。</span></p><p><span></span></p><p><span>我们要知道上无常操，不是说所有的事情都不能发生变化，很多事情一定是发生变化的，但是主体的价值观不能变，我们的行为，品德，操守是不可被改变的。我们要合于道，这件事情是不可被改变的。我们要合于善，这件事情是不可被改变的。</span></p><p><span></span></p><p><span>我们企业的宗旨是不可被改变的。可变的是，我们每个阶段做事情的方法是不同的，但是我们的主旨绝不能动摇，一旦动摇就会人心涣散，大家不知道该去做什么。</span></p><p><span><strong></strong></span></p><p><span><strong>轻上生罪，</strong>我们轻视处上位的人，会生罪的。再延伸一句话来讲，我们轻视了本应该尊敬的人，会生罪的，会获罪。举个例子，我们轻视了上司、领导，会不会生罪，早晚会获罪的。</span></p><p><span></span></p><p><span>我们现在轻视领导，他当下可能是隐忍的，没有讲，或者装不知道，为什么？时机不合适，现在还得用，将来找到合适人，就不用了。</span></p><p><span></span></p><p><span>我们轻视长辈也是同样的道理，他本应该是我们尊敬的人，可是我们很轻视，很傲慢，当下看似没什么，以后这个长辈和其他人就会说起了，可不要理谁谁谁，这个人的品性非常不好，别人一看，他的长辈都这样去讲，不能跟这个人打交道，就是获罪了。</span></p><p><span></span></p><p><span>我们和朋友相交是一样的，我们对朋友轻视和傲慢，当下好似没有什么损失，可是以后，他和别人再说起我们的时候，这个人傲慢无礼，还有很多不好的行为，会让我们的人际关系变得很差，会失去了本有的一些机会，就是获罪了。</span></p><p><span></span></p><p><span>我们作为一个不停地学习圣贤文化的人，修行之人，我们不要轻视和傲慢地对待任何一个人，任何一个人都是值得我们尊敬的，只有我们去尊敬每一个人，别人提起我们的时候，也会由衷地赞叹，也会同样把这份敬畏，回馈给我们自身，当我们轻视别人的时候，得到的一定也是别人的傲慢和不尊重。</span></p><p><span><strong></strong></span></p><p><span><strong>侮下无亲，</strong>如果我们对待下位的人是侮辱的，就会没有人愿意亲近。在一个团队当中也是一样的，如果一个做领导的人，脾气很暴躁，别人是不是都敬而远之，不愿意亲近我们，不愿意围绕在我们身边，太过于喜怒无常，总是侮辱和欺凌，甚至辱骂他人，谁又敢亲近呢。</span></p><p><span></span></p><p><span>我们把两句连起来看，轻上会获罪，侮下会无亲。我们再把上下的概念破掉，轻视任何人都会获罪的，都会得罪很多人，侮辱任何人，欺凌任何人，都会没有人愿意亲近我们，没有德行，没有仁爱之心，谁又愿意亲近这样的人呢。</span></p><p><span></span></p><p><span>我们反过来思维，要想安然地守礼法，让所有人都变得很舒服，和为贵，很简单，我们去尊敬每一个人就好了，我们去敬重每一个人就好了，我们谦和地去对待所有人就好了，这个时候，别人自然就是愿意亲近我们的，别人自然也就是愿意尊重我们的，如此简单，却有很多人做不到啊。</span></p><p><span></span></p><p><span>为什么做不到？没有修身，如果懂得了修身之道，让自己的行为合于道、德、仁、义、礼。再来看这两句话多简单，我们自己懂得修身，自己本身就是具备道、德、仁、义、礼，五者一体也，这五者统称为道。</span></p><p><span></span></p><p><span>如</span><span>果我们有了这五者，不用刻意去尊重每一个人，表现出来的就是尊重每一个人，对每个人都是谦和有礼的，别人自然就是愿意亲近，想做事情自然有人跟随。想经营好人际关系，何需经营，别人自然愿意亲近，围绕在身边的。</span></p><p><span></span></p><p><span>《论语》讲:“近者悦，远者来。”如果对每个人都是敬重的，不轻视，对每个人都是谦和的，接触过的人都是喜悦的，都是有所收获的。远者自然就来了，甚至他会带着更多的远者来到这里。生意就变简单了，人际关系就变简单了，管理团队就变简单了。</span></p><p><span></span></p><p><span>我们之所以觉得很难，就是因为失了根本，本末倒置了，不懂得以修身为根本。如果我们自己没有修身，把他当成一种方法说:“轻上者罪”，不得不停地提醒自己，我不能轻视他人，可是表面上看似有用，别人从我们的动作当中，从行为当中，从眼神当中，看得清清楚楚，看似是尊敬的，内心却是傲慢的，却是轻视的。</span></p><p><span></span></p><p><span>《大学》讲:“诚于中，形于外”，我们内在有多少诚意，通过行为，通过外在都表现出来了，别人看得很清楚的，只有自己认为好像表演得很成功。</span></p><p><span></span></p><p><span>有的人说:“《素书》说的这么神奇，我照着上面做了，我没做到，他也没有起到效果，是不是圣人讲的东西不对，是不是他讲的东西不符合我们这个时代了？”不是的，是我们没有了解根本，没有去修身，不是从内到外都是这个样子的，所以用出来一定是不好用的。</span></p><p><span></span></p><p><span>《大学》讲:“物有本末，事有终始，知所先后，则近道矣。”不能本末倒置，如果我们不懂得修身为本，而只学了方法，就是徒有其表，用出来的时候就没有力量。不是方法不管用，是我们自己本末倒置了。</span></p><p></p><p><strong>近臣不重，远臣轻之。</strong><span>近臣不重，我们委以重任的人，如果我们不尊重，不敬重，不重视，远臣轻之，离我们比较远的人看到，以后会轻视我们的。我们轻视身边的人，别人看在眼里，同样会轻视我们。</span></p><p><span></span></p><p><span>举个例子，我们自己身边所用之人，如果自己不去重视他，不去重用他，这个时候别人看在眼里会怎么想？“走到他身边也没有什么意思，做到他身边的人那个岗位也没有什么意思，也是得不到重用的，也是不受尊重的。”</span></p><p><span></span></p><p><span>别人是不是轻之？这个轻之的是什么？工作的时候不努力，是不是一种轻？精神上不认可，是不是一种轻视？都是一样的道理。</span></p><p><span></span></p><p><span>我们看中国历史，历朝历代的贤明的君主，都会很敬重老臣或者开国元老，为什么重视这些人？所有人都在看着，敬重这些元老，重视这些忠臣的时候，别人才有积极努力的动力，为国家做过贡献，是受尊重的，受敬重的，甚至后人都是封侯拜爵的。</span></p><p><span></span></p><p><span>我们现在的团队当中，也是同样的道理。首先重视的是身边的近臣，也就是身边的人，我们是敬重的，是重视的，是重用的。别人看到以后就会积极地努力，而不是轻视。如果我们轻视他人，所得到的回馈，就是别人也轻视我们。如果我们敬重和重视他人，别人也是敬重我们的。</span></p></div>"
},{
    "title": "《素书》第二十八讲 自信不疑人",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十八讲 自信不疑人</strong></span></p><p><span><strong></strong></span></p><p><span><strong>自疑不信人，自信不疑人。</strong>讲了两种状态和两种思维方式。自疑，是自我怀疑，一个人自我怀疑的时候，就开始自我设限，思虑很多，每天胡思乱想，这是自疑的一种思维方式和态度。当我们自我怀疑的时候，不光怀疑自己，会怀疑所有的事情，怀疑他人，这个时候我们是充满着负能量的。</span></p><p><span></span></p><p><span>我们非常的不自信，自我犹疑，做一件事情的时候开始自我设限，这件事情我是不是做不好？我肯定是不会的，我肯定是做不成的。同时我们在做事情接触到他人的时候，他人不会这么容易帮忙的，他怎么会轻易的配合我呢，就开始设了很多的自我限制，想象了很多的不可能，都是负能量的。</span></p><p><span></span></p><p><span>自信不疑人，当一个人非常自信，这是一种积极向上的心理状态和思维方式，我是相信可以做好这件事情的。我不会，我可以学。当面对一件事情的时候，我也不会过多地犹豫和思虑，不会想他人会不会配合，我不会想这件事情有多难，而是积极努力地去创造，我们做任何事会变得简单。</span></p><p><span></span></p><p><span>为什么要以修身为本？我们细细地体会，当我们学习一段时间，修行一段时间以后的朋友，做事情都是积极的。富在迎来，贫在弃时，我们做事情都是迎的，都是积极主动的，会非常的自信，思维方式非常地积极，遇到了一件之前没有做过的事情，也不再自我设限，相信是可以突破的，有足够的诚意，是可以积极地迎上去，去面对的。</span></p><p><span></span></p><p><span>我们遇到一个人，会往好的地方想，人人的本性都是纯良的，人人都是善良的，我是可以感化他的，只要我诚心诚意地去做这件事情，没有什么困难的！所以我们经过学习和修行以后，思维会非常地积极，事情就会变得很顺畅，我们的态度也会更加地积极，就进入了一种良性的循环。</span></p><p><span></span></p><p><span>一旦我们是自疑的态度，就进入了恶性循环，遇到事情还没开始做，就开始自我设限，自我怀疑，怀疑事情，怀疑他人，这个时候我们在真的做事情的时候，会发现真的不顺利，因为我们的心念和思维已经自我限制了，当有这样的思维方式，在做的过程当中，遇到一点困难都会退缩的。</span></p><p><span></span></p><p><span>“看看和我想的一样，果然很难，确实他人都不愿意帮助我们，确实人心都是险恶的，都是见钱眼开的，都是为了势利而去做事情的”，更加肯定了自己的想法，进入了恶性的循环。</span></p><p><span></span></p><p><span>而积极创造的人同样也会遇到困难和问题，但不会当成困难和问题，懂得先难而后获的道理，努力地积极进取就好了，想在哪一方面变得富足，就积极地迎上去，让自己变得自信，而不要自疑，这是两种截然不同的生活状态，和我们当下所处的思维方式，有极大的关系。</span></p><p><span></span></p><p><span>我们ー定要努力地去学习圣贤的文化，积极地去修身。我们越是修身，身上的正能量越足，思维方式会更加的自信和积极，碰到任何事情，我们都敢于迎上去，而不是放弃，不是陷入自我怀疑的思维方式当中，会产生大量的痛苦的。</span></p><p><span><strong></strong></span></p><p><span><strong>枉士无正友，</strong>枉就是错的，邪念，邪行，当一个人心生错误的想法，心生邪念，我们称为枉士，这样的人是没有正直的朋友。我们来反观自身，如果是一个非常正直的人，我们会不会去交心有邪念的朋友呢，结果是不是一目了然。</span></p><p><span></span></p><p><span>如果我们是做团队的，做企业的，我们是拥有正直正念的人，会不会招心存邪念的员工呢？如果我们懂得这样去思考的时候，就知道该让自己做一个什么样的人，无论当下的处境如何，无论当下的能力如何，首先让自己做一个正直的人，心存正念，看事情是积极的，都是美好的，只有这样的思维方式和心念才能交到正直的朋友，我们要明白这个道理。</span></p><p><span></span></p><p><span>有很多比我们高明的人，有智慧的人，我们交朋友，肯定希望交比我们更有智慧的，更高明的人，但我们要明白这样的人，有一个特点，他看问题一定比我们当下看得清楚，看得透彻。</span></p><p><span></span></p><p><span>如果我们是正直的还是枉的，错误的，心有邪念的，比我们高明和有智慧的人，看得清清楚楚，无所遁形的。用《大学》的话讲:“如见其肺肝然”，对方清清楚楚地看在眼里。</span></p><p><span></span></p><p><span>我们要想交到更多正直、智慧的朋友，要想找到ー个更好的工作，首先让自己做一个正直的人，如果我们内心是正直的，不用担心，别人看不到，不可能的。同时我们也不要心存侥幸，不要认为心有邪念，别人看不到。</span></p><p><span></span></p><p><span>比我们有智慧的人，看得清清楚楚，只是人家讲或者是不讲，用或者是不用，所以很多人莫名其妙地离开我们，或者不重用我们的时候，其实对方心里是清清楚楚的，只不过我们自己迷在其中，而不自知罢了。</span></p><p><span></span></p><p><span>我们要通过不断地学习，不断地修行，让自己变得自信，可以看到这个世界上的美好，可以看到这个世界的阳光，让自己去做一个正直的人，我们才能感召到同频的朋友，同频的事业，同频的爱人。</span></p><p><span></span></p><p><span>我们要引以为戒的，枉士无正友，只有我们去做一个正直的人，才能吸引相对正直的朋友，和生活或人生当中的一切都是正直的，同频的，是相吸引的。如果我们心里都是存着邪念，都是一些错误的想法和价值观，吸引来的自然也是和我们同频的人，就会变得越来越不正直。</span></p><p><span></span></p><p><span>这句话告诉我们，又回到了问题的本身，我们自身是整个事情的主导，自己是人生的主导，要想交到正直的朋友，首先我们要有正直的想法，做一个正直的人。想找到优秀的团队，想有优秀的人，跟随我们，首先我们自己是一个优秀而正直的人，才能吸引这样的人。</span></p><p><span></span></p><p><span>我们总是想向外求，找一个正直的朋友，找一个讲义气的员工，找一个优秀的伴侣，这些都是果。如果我们自己没有那个因，即使得到了又如何呢，得到一个优秀的伴侣，守不住的，因为我们和他不匹配，想交到正直的朋友，可我们自己不是，他终究会离开的。我们想找义气的员工，可是我们自己并没有仁德，他一定做不长久的。</span></p><p><span></span></p><p><span>我们的人生一定是以自己为主导，想要什么样的人，其实很简单，我们去做一个什么样的人就好了，自然就会感召这样的人，来到我们的身边。</span></p><p><span><strong></strong></span></p><p><strong>曲上无直下，</strong><span>同样这句话也是有因有果。直，是直道而行，用《素书》来理解什么叫直？遵守道、德、仁、义、礼去做事情，直来直往，这叫直道而行。注意，直是有前提的，不是说我们心直口快，讲话不经大脑，伤害了他人，这个不叫直。</span></p><p><span></span></p><p><span>直道而行是有标准的，我们所讲的话，思维，行为，都是遵守道、德、仁、义、礼的，看看我们的行为符不符合这五个字，我们讲出去的话符不符合这五个字，这才叫直道而行。</span></p><p><span></span></p><p><span>曲上无直下，和直相对的就是曲，弯的，可是我们做事情不是直道而行的，就吸引不来直道而行的属下。我们对朋友也是如此，对孩子也是如此，如果我们自己不能做到直道而行，怎么会吸引直道而行的人，即使我们用了当下的权威和利益，我们是曲的，却要求他人直道而行，首先别人做不到，也不会按照我们的话去做。</span></p><p><span></span></p><p><span>第二点核心是，我们如果不懂得什么是直道而行，我们不识人，不知道该怎么直道而行，甚至有直道而行的人，我们也不会重用的，认为当下有利益就好了，为何要讲仁、义、道、德呢，在这个时代还有什么用，我们脑海里没有那样的观念，心念中不是那样思考问题的，所以告诉我们，任何事情有因有果，而主导自己人生方向的，恰恰正是我们自己。</span></p><p><span></span></p><p><span>我们教育孩子也是一样的，如果我们自己不去学习，自己不去修身，自己不能直道而行，怎么会让孩子直道而行？甚至有的孩子讲仁、义、道、德，我们还认为这个孩子思想是不是有问题，是不是不符合这个时代？</span></p><p><span></span></p><p><span>所以告诉我们，曲上无直下，如果自己是弯的，价值观是有问题的，不能做到直道而行，我们也看不懂按道行事的人，更谈不到如何去用好这样的人了。</span></p><p><span></span></p><p><span>在我们的人生当中，总会有很多的羡慕，羡慕别人家的孩子，如此优秀；羡慕别人家的伴侣，如此体贴；羡慕别人家的员工，如此义气，如此贤德；羡慕别人的领导，如此仁爱。</span></p><p><span></span></p><p><span>但是我们自己本身，自己才是人生的主导，所有的因是自己种下的，我们去羡慕的同时，不要看那件事情的表象，而要看跟在这个领导身边的，都是什么样的人，我们去做那样的人就好了，羡慕人家孩子的同时，去看看人家的父母，是如何教育的，自己去种那个因就可以了。</span></p><p><span></span></p><p><span>所以我们不要去盲目地羡慕和跟随，而是要懂得自己积极努力地种因，这样我们才能主导自己的人生。我们在细致地延伸何为曲，何为直？</span></p><p><span>还有一种曲，想的太多，思虑太多，当我们做一件事情的时候，总是犹疑、思虑、徘徊，我们处上位的人，如果是这样的思维方式，会发现处下位的人，会变得和我们一样，做事情的时候，非常的犹疑、思虑、怀疑。</span></p><p><span></span></p><p><span>而直是什么样子的？首先我们讲了秉承道、德、仁、义、礼五者一体，秉承了道、德、仁、义、礼以后，我们做事情非常的直接，这个事情符合道就做，不符合就不做，当我决定做一件事情的时候，不会有任何的犹疑，没有那么多的思虑，大胆地去做就好了。</span></p><p><span></span></p><p><span>当我们是这样的风格和处事行为的时候，处下位的人和我们一样的做事情，都是雷厉风行的，说到就做到，不会有任何的怀疑，这亦是屈和直之间的关系。</span></p><p><span></span></p><p><span>我们有的时候，总是嫌弃员工做事情不果断，总是看孩子身上的性格不果敢，有没有想过，是我们自己做事情，就是思虑过多的，就是不能直来直往，不能去直行的，别人自然也就会是这个样子。</span></p><p><span></span></p><p><span>我们作为一个处上位领导的人，如果是诸多的犹疑和思虑的，处下位的人怎么敢大刀阔斧地去做事情呢？他们怎么敢正气凛然地去做事情呢？因为到我们这里一定会被驳回的，只要我们的前提是秉承道、德、仁、义、礼的，做事情可以直来直去，少一些思虑和顾虑，变得更果感，更直接，这个才应该是我们本来有的样子。</span></p><p><span></span></p><p><span>所以我们是一个雷厉风行的人，下面的人亦如此。我们是一个果敢善良的人，我们的孩子自然也会受我们的影响。</span></p></div>"
},{
    "title": "《素书》第二十九讲 乐贤养人厚",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第二十九讲 乐贤养人厚</strong></span></p><p><span><strong></strong></span></p><p><span><strong>危国无贤人，乱政无善人。</strong>危国，是指岌岌可危，一个国家已经到了很危险的程度，这里的无贤人，并不是这个时代不会有贤人了，一个国家既然能到岌岌可危，说明君主已经没有仁德，君主已经没有智慧，是不懂得去任用贤人的，甚至有贤德的人，提出了很多治国的意见和政策，也不会采纳的。</span></p><p><span></span></p><p><span>延伸到现在，在一个企业当中也是一样的，一个企业已经走到了危险，临近灭亡的时候，我们怎么可能任用贤才，我们听不进去贤人所讲的话，这个时候是没有贤人可用的。</span></p><p><span></span></p><p><span>再反过来思考也是一样的，如果我们懂得任意用贤人，也不会走到今天这一步，也不会沦落到如此危险的境地，乱政无善人。同样当我们都是乱政的时候，已经没有善良的人了，善良的人早就离开了。</span></p><p><span></span></p><p><span>在一个团队或企业当中，是不是一样的道理？当一个企业走到很危险，很乱的境遇的时候，有能力的人早已经走了，正直的人早已经离开了，这里我们是要引以为戒的。</span></p><p><span></span></p><p><span>尤其是贤德，正直的人不断地离开的时候，我们要反思了，要懂得去观察是不是我们自己哪里出了问题？是不是我们的企业，我们的团队哪里出了问题？导致有能力的人离开，如果我们还不察觉，必将走向灭亡，必将走向失败，这个时候已经无力回天。</span></p><p><span></span></p><p><span>学习《素书》为什么说他是妙用呢？他给了我们很多警醒，让我们去自我思考，当我们开始自我怀疑的时候，我们要知道，缺乏自信，开始自我设限，身边如果没有正直的朋友，我们要反观自省，是不是我们自身不够正直？</span></p><p><span></span></p><p><span>如果我们的下属，我们身边的人都是曲的，没有多少正直的人，没有遵守仁、义、道、德、礼的，那我们要去看看是不是自己本身也没有。</span></p><p><span></span></p><p><span>如果我们的团队已经走到了很危险的境遇，那我们去看看，是不是已经有很多贤德之人，有很多有能力的人开始离开我们了，有很多善良的人离开我们了。当我们懂得这个道理的时候，我们要去观察的，看看我们身边的朋友，看看我们团队当中的员工，有多少是善良的，有多少是贤德的？</span></p><p><span></span></p><p><span>如果我们的团队没有心地善良的人，说明我们的团队是有问题的，千万不要只看表象，这个人只要创造价值就可以了，如果大家都不善良，怎么会走得长久呢？如果这里面没有正直的人，又如何走得长久呢？如果没有贤德的人，企业又能走向何方呢？</span></p><p><span></span></p><p><span>所以一定不要只看当下的得失和利益，而忘掉了人性最本有的那些光辉，那些善良，那些阳光，那些正直，那些义气，那些仁爱，那些道德，这是不可或缺的。</span></p><p><span></span></p><p><span>自古以来，圣贤文化都在告诉我们这样的道理，我们去看一部电视，去读中国历史，去读书，去看看哪个兴盛的朝代，不是有很多贤人义士？有很多忠臣良将，有很多人积极善良，如此才能走得更远。如果当下只看利益得失，终将失败的，我们定要引以为戒。</span></p><p><span></span></p><p><span>我们学《素书》反复地强调这番话，听懂了未必有益处，我们做不到，为何做不到？没有修身。所以我们一定是懂得修身之道的，自己的行为是中正而不偏颇的，自己不是利欲熏心的，才能看到人性的光辉，只有看到这些人性的光辉，才知道问题出在哪里，我们去秉承道、德、仁、义、礼去修身，去识人，去做事情。</span></p><p><span><strong></strong></span></p><p><span><strong>爱人深者求贤急。</strong>又讲了一个相反的例子，泛爱众，我们有仁爱之心的时候，就是爱人深者。当我们泛爱众，心怀仁爱之心，就会求贤若渴。渴望有贤德的人，来辅助我们做更多的事情，可以利益更多的民众。</span></p><p><span></span></p><p><span>如果我们没有仁爱之心，怎么会求贤若渴，即使有贤德的人，我们也不重用，为何不重用？他总是顶撞我，明明我们要谋点私利，他非得讲仁爱，我们怎么会重用这样的人呢？</span></p><p><span></span></p><p><span>我们学习圣贤文化，都告诉我们修身为本，只有自己心存仁德，有仁爱之心，就会希望别人变得和我们一样，他们也有仁爱之心，这样才能共同去利益更多的人，因为人都希望別人和自己ー祥。</span></p><p><span></span></p><p><span>举个例子，在一个团队当中，如果我们是一个不作为的人，我们也希望他人不作为，背后就会搞一些小动作，告诉他不要那么努力做事情，领导也看不到，做那么多事情干嘛呢？爱说是非之人也一样，一个爱说是非之人他一定也希望别人变得一样是非。我们是一个什么样的人，我们就会去寻找什么样的人，和我们变成一个样子。</span></p><p><span><strong></strong></span></p><p><span><strong>乐得贤者，养人厚。</strong>我们很乐意，很高兴去求贤若渴的时候，一旦得到了，我们会以丰厚的待遇，去养着这些贤德之人，这里丰厚的待遇包括了很多。比如，以前讲俸禄，现在讲薪酬。比如，你对他的重视，对他的关爱，对他的成长，这都是丰厚的待遇。</span></p><p><span></span></p><p><span>因为我们是一个仁德之心的人，我们ー旦得到了贤德之人，会倍加珍惜和呵护的，英雄惜英雄，我们是有仁爱之心，自然也懂得珍惜，有仁爱之心的人，所以我们一定会对他礼遇有加，我们会倍加地重视和呵护，让他留在我们的身边，共同去做着相同的志向，志同道合。</span></p><p><span></span></p><p><span>我们是合于道的，我们是都喜欢仁德的人，我们有着共同的志向，可以去爱护更多的人，也只有我们更加的呵护和爱护对方，懂得养人之道，对方也才会心甘情愿地跟随我们共同前行。</span></p><p><span><strong></strong></span></p><p><span><strong>国将霸者士皆归，邦将亡者贤先避。</strong>告诉了我们两个自然的规律，国将霸者士皆归，一个国家将要称霸，会有很多人才回归的。我们平时总讲锦上添花，道理是相同的，当我们开始变得富足的时候，别人都开始锦上添花了，在这个世界上，雪中送炭的人很少，锦上添花的人，比比皆是，我们一定要明白一个道理，这个就是自然规律。</span></p><p><span></span></p><p><span>花朵开得鲜艳，蝴蝶自来。这就是自然规律。树木在茂盛的时候，自然会有很多鸟儿来栖息。企业在不断壮大的时候，必有人才，渴望前来。一个国家将要称霸的时候，必有人才想回来做事情。</span></p><p><span></span></p><p><span>我们明白这个道理，不要有任何的抱怨，很多人都会抱怨，人走茶凉，人走茶凉亦是自然规律。我们已经离开这个地方了，离开了这里，为什么别人还要记得我们的好，这不符合规律。</span></p><p><span></span></p><p><span>所以我们懂得这个道理，是要强大自己的，要想有更多的人才，来到我们身边，我们要让自己变得更好，让我们自己变得光芒四射，让我们自己变成一个强者，别人自然就来到我们身边。而不是去抱怨大家如此的势利，“不就是因为他混的好了吗，不就是因为他开一个公司吗，那么多人去巴结他，去奉承他”，对啊，这就是自然规律啊！</span></p><p><span></span></p><p><span>如果我们过得不好，别人为什么要来到我们的身边，不符合规律，不符合道啊。我们明白了这件事情的规律，更要懂得强大自己，更要懂得修身之道，让自己变为一个强者，自然就吸引更多的人，来到我们身边，让自己变成一个有仁德的人，自然就有正义之士愿意跟随。</span></p><p><span></span></p><p><span>邦将亡者贤先避，一个国家将要灭亡的时候，贤者是先避开的，为什么呢？有更多贤德之人，早已看到将要灭亡，无力回天的，无能为力，一定是避开的。我们在一个企业是一样的，当一个企业将要走向衰退的时候，有能力的人一定是先离开的，因为他早已经看到了，无能为力的，也听不进去我们讲的话，我们留在这里还有什么意义呢。</span></p><p><span></span></p><p><span>《论语》也讲同样的道理：“邦有道则仕，邦无道则隐。”国家有道的时候我们要出来做事情，国家无道的时候，就开始隐居了，隐居起来做学问，去做传承，因为已经无力回天。</span></p><p><span></span></p><p><span>我们去读历史，春秋战国时期，隐士特别多，也是诸子百家的时代，百家争鸣，乱世，没有人可以拯救那个时代，所以只能以待时机，更多的人就开始做了隐士，开始归隐山林，开始自己修道。</span></p><p><span></span></p><p><span>《素书》开篇就告诉我们一个道理，潜居抱道，以待其时，我们要自己潜居，什么叫潜居？为何不叫隐居？隐起来谁也找不到。潜居是什么呢？既可以隐，又可以随时浮现出来，可以让别人找得到，这叫潜居，潜居还要抱道，还要让自己合于道，以待其时，等待合适的时机再出来做事情。</span></p><p><span></span></p><p><span>同样，我们要懂得反思的，当有很多贤者不留在我们身边，要去思考了，说明我们已经在走下坡路了，当没有更多的人才，愿意来到我们的身边，说明我们的势头不是向上的。</span></p><p><span></span></p><p><span>所以学《素书》是要学谋划的，要懂得谋道，我们只有了解道的规律，才能谋道，这两句话同样也是在告诉我们规律，如果有很多人愿意前来，说明我们走的是上升之势，这个时候我们一路向上，不停地去谋道，锦上添花。</span></p><p><span></span></p><p><span>如果有很多贤人义士，开始离开我们，就要知道了，在走下坡路了，我们要更加地积极努力，来调整我们的自身，来修正我们的自身，以防止继续下落，这都是在讲道的规律，而明白了道的规律，正是我们该去谋划和积极努力的时候。富在迎来，我们积极地去迎，积极地去创造，才能改变当下的局势。</span></p><p><span><strong></strong></span></p><p><span><strong>地薄者，大物不产。</strong>很简单的道理，如果我们的地不够丰厚，怎么会有大的产量。延伸一下也好理解，如果我们本身没有厚重的德行，怎么能去做更大的事情，怎么能吸引贤德之人，厚德载物啊，我们要想创造更大的事情，首先要让自己变得厚德。</span></p><p><span><strong></strong></span></p><p><span><strong>水浅者，大鱼不游。</strong>如果我们的水很浅，大鱼怎么会在里游呢，浅水的地方都是小鱼小虾。如果我们的德行不厚重，没有博大的胸怀，怎么会有大鱼来到我们的身边？</span></p><p><span></span></p><p><span>我们总是羡慕别人有好的生活，有好的团队，有好的事业，有好的人脉，我们不应该只是羡慕，要积极地去创造，要明白根源是在自己身上的，是我们自己的水太浅，地太薄，所以去加厚自己的德行，去让自己更广博，去让自己更有智慧，让自己更仁爱，我们才能创造更大的事情。</span></p><p><span><strong></strong></span></p><p><span><strong>树秃者，大禽不栖。</strong>我们的树木没有那么茂盛，怎么会有大的飞禽在这里栖息呢？</span></p><p><span><strong></strong></span></p><p><span><strong>林疏者，大兽不居。</strong>我们去看看那些大的野兽，都在很茂盛的森林当中居住，只有在茂盛的森林，在那种原始森林，才会有大的野兽，否则是没有的。</span></p><p><span>整个这四句话告诉我们一个道理，要让自己变得厚重，让自己变得厚德，要让自己的水变得更深，要让自己变得更茂盛，更丰厚，我们才能吸引更大的事情，才能吸引更多的人。道理非常的简单，明白以后，我们要懂得还是以修身为本。</span></p></div>"
},{
    "title": "《素书》第三十讲 衣不举领者倒",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十讲 衣不举领者倒</strong></span></p><p><span><strong></strong></span></p><p><span><strong>山峭者崩，泽满者溢。</strong>讲了两种自然现象，山过于陡峭会崩塌的。沼泽水太多会溢出来的。告诉了我们为人处事的道理，做人不能太过于锋芒，不能骄傲自满，否则是会崩塌的。</span></p><p><span></span></p><p><span>圣贤的文化都告诉我们，谦逊祥和，道家文化告诉我们善于处下，这个也是自然的规律。木秀于林，风必摧之。我们老话也讲：“棒打出头鸟。”所以我们做事情的时候，不能锋芒太露，要懂得谦逊有礼，这个才是和为贵，当我们没有太多的锋芒，让人觉得很舒服的状态，就是和，就是礼之用。</span></p><p><span></span></p><p><span>第六章整个在讲安礼篇，我们安然地按照礼法去做事情，就会让别人觉得很舒服，就会达到和的效果，和的成果。做事情阻力就会变少，如果我们自己锋芒太盛，骄傲自满，就会有很多人觉得不舒服，就是不和，一定会遇到很多人的阻碍，做事情一定要懂得，满招损谦受益，做事做人太满，都会遭到损害的，只有谦逊有礼才能受益。</span></p><p><span><strong></strong></span></p><p><span><strong>弃玉取石者盲。</strong>如果我们取了石头，而把美玉丢弃了，如同盲人看不见，有眼无珠。这句话很简单，哪有一个人会把玉扔掉了，捡一块石头呢，不会的。可是我们往下延伸，形容的依然是我们的智慧和观察能力，因为我们现在已经懂得了，玉比石更昂贵，所以不会去做这样的事情。</span></p><p><span></span></p><p><span>如果我们不学习圣贤文化，如果不修身又如何习得，很多人弃善从恶，看不到人性的光芒，看不到善良，而去做一些利欲熏心的事情，去做一些恶行，说一些恶语，伤害他人，而不自知，这也是一种弃玉取石。</span></p><p><span></span></p><p><span>《素书》告诉我们修身为本，只有自己懂得修身之道，有了道、德、仁、义、礼，才能知道这些品质，是人性的光芒，这些品质才是玉，而不是一些小聪明。我们才知道识人，知道如何用人，知道怎样用员工，用他身上好的品质，像玉石一样完美无瑕，像玉石一样干净的人性光辉。</span></p><p><span></span></p><p><span>如果我们不懂得修身之道，我们就会觉得油嘴滑舌的比较好，就会觉得秀而不实的比较好。我们就会觉得只要创造业绩，就一定是优秀的人，可是我们学习了圣贤文化，未必尽然，我们看的更多的是这个人的道德品质，是这个人心中有没有仁义，有没有奉献和牺牲的精神，有没有利他的念头，这个都是一个人美好的品质。</span></p><p><span></span></p><p><span>通过一个自然的道理在告诉我们，应该如何去取舍，而这个取舍的关键，又回到了修身为本，如果我们自己不修身，不明白这些才是符合道的，才是人性的光芒，只有用了这些人性的光芒，我们自己走的才能更长久。</span></p><p><span></span></p><p><span>道前定，则不穷，否则一定是短暂的。就好比是把最美好的玉扔掉了，而捡起了石头。因为我们当下看着石头比较大，如果我们不认识玉，我们可能就会拿大的捡，这块石头好大，当下的利益好大，我们就计较了当下的得失，就取了石，而弃了玉。</span></p><p><span><strong></strong></span></p><p><span><strong>羊质虎皮者辱。</strong>羊质，我们内在是羊的本质，却披了一张虎皮，这样所导致的结果自取其辱。在现实生活当中，很多时候我们也是这样的，就是虚荣心作祟，有贪念在伪装自己，我们没有那么大的能力，却非要做那么大的事情，就是这样的形容词。</span></p><p><span></span></p><p><span>本质是羊，却披上了老虎的皮，在什么时候会自取其辱？真正遇到危险的时候，我们披了个虎皮。如果真的遇到其他野兽的时候，会面临生死存亡的危险。</span></p><p><span></span></p><p><span>延伸到生活当中，工作当中也是一样的，如果我们是羊质虎皮的，勉强地坐到了那个位置上，可是自己并没有那么大的本领，一旦遇到事情发生的时候，我们是没有足够的能量和智慧去面对的，结果显而易见，自取其辱啊！</span></p><p><span></span></p><p><span>所以修行之道告诉我们，要表里如一，要知行合一的。我们自己内在不足，就不要去虚荣，踏踏实实地去修正自己，让自己内和外都是老虎，而不是羊质虎皮，只会让自己陷入非常危险的境遇。</span></p><p><span></span></p><p><span>在一个企业当中也是同样的，我们可能只追求升职，可是如果内在的品行和能力并没有达到，真正让我们坐上那个位置，会发现苦不堪言的，每天会变得更加焦虑，更加劳累，因为我们的能力是无法胜任的，很多人做生意亦是如此。</span></p><p><span></span></p><p><span>本来我做一个小的生意，其实衣食是富足的，还不错，可是我又不懂得提升自己的内在，不懂得修自己的德行，我们非要去赚那个钱，非想去扩大，结果会发现自取其辱。</span></p><p><span></span></p><p><span>这几句话也是在强调，一个人修身的重要性，只有我们自己懂得修身，才能认识他人身上的美德，防止弃玉取石，也只有懂得修身，让我们内外一致，我们才会不取其辱，不让自己陷入一个危险的境遇。</span></p><p><span></span></p><p><span>我们踏踏实实地去修正自己，提升自己的德行，一切有因，自有果。只有踏实地修正自己，才能享受那个美好的果实，而且是安然自得的去享受</span></p><p><span><strong></strong></span></p><p><span><strong>衣不举领者倒，走不视地者颠。</strong>我们拿起一件衣服，如果不是举着它的领子，这件衣服势必会拿倒的。比如，我们拽着衣服的兜，或者拽着衣服的下襟，这个衣服一定是倒的。</span></p><p><span></span></p><p><span>走不视地者颠，如果我们走路不看地，一定会跌倒的。颠，是跌倒的意思。讲了这样两种生活当中的现象，在告诉我们什么道理，拿起衣服，要拿领子，否则就倒了。</span></p><p><span></span></p><p><span>告诉我们做任何事情要懂得抓住重点，否则一定越做越颠倒。我们走路的时候如果不看地，会跌倒的。做事情首先是要懂得抓住重点，要懂得实地观察，实时观察事情的变化，加以修正，加以调整。</span></p><p><span></span></p><p><span>我们走路，这一段路，看似是平坦的，可是走到了下一段路，还以为它是平坦的吗？那就有可能会被跌倒的。我们现在走的是上坡，走着走着，可能就开始变下坡路了，如果没有注意观察，就会跌倒的。</span></p><p><span></span></p><p><span>这两句话，通过生活当中常见的一种自然现象，却阐述了我们做事的要领。做事情，一定要时时刻刻懂得抓住重点，我们当下重点是什么？否则一定颠倒并且没有效率，只抓重点还不够，还要时时刻刻观察着情况的变化，当下某一件事情对我们来讲是重点，可能过了两个月，这件事情就不是重点了。过了半年我们的重点就开始转移了。</span></p><p><span></span></p><p><span>道家的文化特别有意思，总是用一些自然规律和自然现象，包括生活当中的一些现象，却阐述了我们做事情的道理，看似平淡无奇，意义却非常的深刻。所以我们要保持做事情的敏锐度，时时观察事情的动向和变化。</span></p><p><span></span></p><p><span>如果没有敏锐的智慧，我们看不到事情的重点，抓不住要领。如果没有敏锐的智慧，我们看不到事情的变化，找不到事物发展的规律，这个时候做事情是很容易跌倒的，很容易颠倒的。</span></p><p><span><strong></strong></span></p><p><span><strong>柱弱者屋坏，辅弱者国倾。</strong>如果一个房屋柱子是弱的，房屋会坏掉。辅弱者国倾，我们ー个国家的辅臣，一个国家的栋梁之才，如果是弱的，国家很容易倾倒。又讲了一种生活当中的自然现象，我们住在一个房屋里面，都懂得这个道理，顶梁柱一定是最结实的，粗壮的，否则这个房屋很容易坍塌。</span></p><p><span></span></p><p><span>同样在我们的团队当中，也是一样的，我们手下如果都是没有能力的人，没有贤德之人，如果我们的重要岗位上的人，都是弱的，我们的企业必然倾倒。通过两个自然现象又告诉我们，做事情的规律。通常我们会讲一个词叫栋梁之材，我们做事情的顶梁柱，一定是要非常强大，非常有能力的。</span></p><p><span></span></p><p><span>我们学习了《素书》，不光要找强大的人，还要找符合仁、义、道、德、礼的人。这个时候我们是合道的，合道必然长久，哪怕他的当下并不够强大，可是他有仁、义、道、德，他懂得修身之道，也必然会变得强大。</span></p><p><span></span></p><p><span>这一讲的内容，看原文都很简单，山峭者崩，泽满者溢。衣不举领者倒，弃玉取石者盲，走不视地者颠，柱弱者屋坏，这句话看似简单，给我们阐述的道理却是奇妙无穷。拿衣服如果抓不住要领，就会颠倒。告诉我们的是做事做人皆如此，如果做事情抓不住重点，抓不住要领，大家都做的很辛苦，却没有成绩。</span></p><p><span></span></p><p><span>做人也是一样的，如果我们不懂得按道行事，让自己去利益他人。如果不懂得修身，我们觉得每天很努力很付出，可是也必不长久，依然是颠倒的。走路如果不看路，很容易跌倒。这句话我们谁都懂，可是他要阐述的道理却非常深刻。</span></p><p><span></span></p><p><span>我们不光走路要实地观察，看每一个路面所要发生的变化，做一切事情都要有观察的能力，时时刻刻关注着事情的变化，关注着不同的问题的产生。</span></p><p><span>比如，人们的消费价值观，在发生变化，时代在发生变化，人们欣赏的眼光在发生变化，人们喜欢的物品在发生变化，国家推倡的文化和导向在发生变化。</span></p><p><span></span></p><p><span>这个都需要我们有敏锐的观察能力，通过这些自然现象的背后，我们要看到他那个理，我们才能懂得如何在生活、工作、人生当中，去应用这些自然现象背后的理。</span></p><p><span></span></p><p><span>道家是观察自然而悟道的，看到自然的变化，而引申到我们的人生当中。所以这一讲看似简单，却是需要锻炼我们的思维能力，锻炼我们观察的智慧，我们可以从生活当中观察到大量的自然现象，而自己产生观察的智慧和能力，如此做事情，我们才能变得游刃有余。</span></p></div>"
},{
    "title": "《素书》第三十一讲 见生慎将生",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十一讲 见生慎将生</strong></span></p><p><span><strong></strong></span></p><p><span><strong>足寒伤心，民怨伤国。</strong>讲了一个人体的现象，如果我们的脚受到了寒，有风寒会导致我们的心脏不好。通常我们都知道心脏是一个人身上，非常重要的器官，而脚相对来讲，没有那么重要，但是却有关联，如果脚受到风寒，我们的心脏也会变得不舒服。所以我们关心人的时候，通常都会讲不要让脚受凉。</span></p><p><span></span></p><p><span>民怨伤国，引用了人体的现象，告诉我们治国的道理。民怨伤国，如果人民都产生了怨恨的心理，会伤到国之根本。通常我们去看中国历史，只要是亡国的情况，都是民怨四起，民不聊生，就要开始揭竿起义，推翻王朝了。</span></p><p><span></span></p><p><span>延伸到现在的生活当中，依然如此，每一个员工就好比是足，好比是人民，看似好像没有那么重要，却是我们企业发展的根本。如果我们的员工都是怨声载道，会伤到企业的根本，离企业的崩塌不远了。所以我们要去重视每一位员工，重视每一位客户，那是我们所有利益的根本，那是一个国家的基石。</span></p><p><span></span></p><p><span>自古以来都讲得民心者得天下。同样如果我们去做事情了，就要珍爱自己的员工，呵护每一位员工的成长，去想办法帮助每一个客户，看似他不是一个企业的核心，却是连着核心的命脉。</span></p><p><span><strong></strong></span></p><p><span><strong>山将崩者，下先隳；国将衰者，民先弊。</strong>又开始讲了两种自然现象，山将崩者，下先隳，隳就是动摇的意思，一座山将要崩塌的时候，并不是山峰在动摇，而是最下层开始松动动摇，这个山就开始崩塌了。</span></p><p><span></span></p><p><span>通过这样一种自然现象，又告诉了我们一个道理。一个国家将要灭亡的时候，是民怨四起，动荡不安。一个企业也是同样的道理，一个企业走向衰落的时候，是员工开始动荡，客户开始流失，整个企业就开始变得崩塌。</span></p><p><span></span></p><p><span>国将衰者，民先弊，一个国家将要衰亡，将要衰落的时候，是因为百姓都受到了损害，百姓的利益和人身安全得不到保障，如果人民都受到了伤害，也就预示着国家的衰落。</span></p><p><span></span></p><p><span>综上所述来看这四句话，足寒伤心，民怨伤国；山将崩者，下先隳；国将衰者，民先弊。都是告诉我们要知道一个国家发展的根基，在于人民，要懂得以人为本，护住我们的根本，才能走得更长久，否则一定会留下祸患，下方开始动摇的时候，久而久之，处上方之人，必将崩塌。</span></p><p><span></span></p><p><span>历史给我们了很多借鉴，我们读中国通史的时候，会看到每一个朝代的兴盛和衰落，绝大多数都取决于，有没有一个贤明的君主，有没有栋梁之材，去辅助贤明的君主，国家的人民是否是安稳的，人生是不是可以得到保障的，是不是衣食无忧的，这些都是一个国家兴盛的关键因素。</span></p><p><span></span></p><p><span>我们去看一个企业，也是一样的，要看所有企业的员工是不是心情愉悦的，客户是不是得到帮助和受到利益的，这些都是一个企业生存的根本之道，绝不是只有上层的几个人过得衣食无忧，而下面的人开始怨声载道，如此必有隐患。</span></p><p><span></span></p><p><span>通过这些事物发展的规律，告诉我们为人处事的道理，只有我们养成了观察的能力，会发现生活当中，处处是道，随处可见的事物发展规律。可是如果我们不懂得修身，我们是没有观察的智慧，即使我们懂得那个道理，可是由于自己的贪念和情绪，我们也是做不到的。</span></p><p><span><strong></strong></span></p><p><span><strong>根枯枝朽，民困国残。</strong>树根如果是枯萎的，树枝就会变得腐朽。民困国残，人民的生活，如果是困苦的，国家很快就会残坏。我们去看一个企业，同样的道理，如果每个人都是不幸福的，都是不快乐的，每个客户都是不开心的，都是不满意的，必然走向衰亡。</span></p><p><span></span></p><p><span>我们去看一个家庭，也是同样的道理，如果每个人过得都很不开心，都很压抑，都很困苦，那这个家庭也要面临着分裂，这种压抑的氛围会让每个人都觉得非常不舒服。</span></p><p><span><strong></strong></span></p><p><span><strong>与覆车同轨者倾，与亡国同事者灭。</strong>重蹈覆辙，其他的车子从这里走过，倾倒了，我们依然走这条路，这就叫重蹈覆辙。与亡国同事者灭，我们看到一个灭亡的国家，所做的事情，所失败的地方，我们依然和他做同样的事情，终将灭亡，这就是重蹈覆辙的道理。</span></p><p><span></span></p><p><span>学习圣贤文化，是在告诉我们天道循环的规律，历史更替的规律，我们从当中可以得到大量的智慧，和为人处事的道理，就是为了避免重蹈覆辙。学习圣贤文化之人，学习修身之道之人，不可不读历史，我们一定要懂得历史里面，给我们带来的规律，告诉我们道的循环。</span></p><p><span></span></p><p><span>唐太宗李世民讲:<strong>“以铜为镜，可以正衣冠，以史为镜，可以知兴替，以人为镜，可以明得失。”</strong>李世民说:“我有三面镜子，而其中一面就是历史，我们可以看到历史的兴替，里面就是道，就是规律”。</span></p><p><span></span></p><p><span>我们中国人很大的信仰，来源于中国历史，来自于上下五千年，在中国信仰可以不是某一种文化，但是信仰却来源于历史，因为历史本身就是一种文化，历史本身就是一种宗教，历史本身就告诉我们积极的概念，历史本身就告诉我们人定胜天。</span></p><p><span></span></p><p><span>历史就告诉我们什么样的朝代，什么样的人可以长存不灭，他的精神一直流传了下来，历史就会告诉我们什么样的人遗臭万年，什么样的人背负骂名，这是我们信仰的源泉，这是我们文化的源泉。一定要去读历史的，只有不停的学习历史，我们才有迹可循。</span></p><p><span></span></p><p><span>《论语》中孔子讲自己的一生，述而不作，信而好古。孔子很爱好古人的学问，古人的学问就是从历史当中来。《论语》又讲:“不践迹，亦不入于室。”如果我们不踏着圣贤的痕迹，圣贤的脚步，很难升堂入室的，学不到家。</span></p><p><span></span></p><p><span>《道德经》讲:“执古之道，以御今之有，能知古始是谓道纪。”老子和我们讲执古之道，执古代的圣贤的道理。以御今之有，来做今天当下的事情，能知古始是谓道纪，看到古代圣贤所做的事情，看到天道循环的规律，看到了那个痕迹，是谓道纪，这个就是道的一种记录方式，就是道的轨迹。</span></p><p><span></span></p><p><span>如果我们不懂得不断地去学习，一定会重蹈覆辙的。我们不断地去学习圣贤的文化，学习历史知识就是在推古验今，借古通今，学圣人的文化，让今天当下的事情变得通达。</span></p><p><span></span></p><p><span>荀子在《劝学篇》之中讲:<strong>“不登高山，不知天之高也，不临深溪，不知地之厚也，不闻先王之遗言，不知学问之大也。”</strong>同样告诉我们道理，如果不去学习圣贤之人，所留下的遗言，留下的文化，不知道学问到底有多大。所以我们就会走很多弯路，就会变得困而知之。</span></p><p><span></span></p><p><span>我们在感情当中出现了问题，被迫地知道了，这叫困而知之。我们做生意不知道增长自己的智慧，不知道去做利益他人的事情，生意失败了，我们知道了，可是已然付出了代价，这叫困而知之。</span></p><p><span></span></p><p><span>我们教育孩子，孩子大了，突然发现他不听我们的话，突然发现孩子如此叛逆，突然发现孩子身上没有好的优点，这个时候已经晚了，这叫困而知之。困而知之，我们是要付出代价的。</span></p><p><span></span></p><p><span>《中庸》讲:<strong>“有的人生而知之，有的人学而知之，有的人困而知之。”</strong>我们不懂得学习的人，都是在做困而知之的人。生而知之可望而不可求，有的人天赋就是好，有的人天生就有智慧，那个是我们求不来的。</span></p><p><span></span></p><p><span>我们也要努力去做一个学而知之的人，不要等困难发生了，事情出现了，我们才想着去抱怨，去怨恨，去感叹，已然没有意义。所以我们一定要去努力地学习，防患于未然，让我们自己变得更明达，更有智慧，更有观察能力，懂得去借鉴历史，这个时候我们才少走弯路，我们才能安然前行。</span></p><p><span><strong></strong></span></p><p><span><strong>见已生者，慎将生；恶其迹者，须避之。见已生者，慎将生，</strong>看见已经发生的事情，要很慎重，警惕将要发生的事情。我们看到一件事情的发生，已经有了痕迹，这个时候要警惕了，警惕接下来将要发生的事情。</span></p><p><span></span></p><p><span>举个例子，我们如果是做企业的，已然看见有很多客户在流失，就要警惕了，警惕接下来，将要发生更多客户是要流失的。在生活当中也是一样的，我们已经看见了很多朋友，莫名其妙地，不知缘由地离开了我们，就要警惕，慎重了，接下来可能会有更多的朋友离开，万事发生必有痕迹的。</span></p><p><span></span></p><p><span>比如，我们在一个家庭当中，看到孩子也是一样的，看见孩子最近的行为很反常，这个时候就要慎重和警惕将要发生的事情。我们的孩子突然之间，就开始变得学习不好，接下来要慎重和警惕接下来要发生的事情，如此我们才能避免更严重的错误和更大的问题。</span></p><p><span></span></p><p><span>比如说，夫妻之间的感情，恋人之间的感情亦是如此，我们已经看见了，很多不好的倾向，这个时候，我们就要警惕将要发生的事情。我们如果没有经过学习和修行的人，都是后知后觉的，就会生感叹和抱怨。</span></p><p><span></span></p><p><span>我的生意怎么突然就不好了，怎么突然就不爱我了，孩子怎么突然就不听话了，我的朋友怎么突然就不理我了，万事发生必有痕迹，只不过我们自己没有发现而已。所以我们要养成观察的能力，看到一件事情的走向，我们要及时地开始调整。</span></p><p><span></span></p><p><span>我们在修行当中是如此，家庭当中是如此，经营感情如此，经营企业亦如此，我们看到员工的变化，就要知道接下来要发生的事情，我们及时地调整，就是防患于未然。</span></p><p><span></span></p><p><span>《道德经》讲:<strong>“其未兆易谋”，</strong>在事情没有发生的时候，或者刚刚发生的时候，这个时候非常容易谋划，可以及时地调整。比如，当我们发现孩子，有了不良爱好，如果是刚刚开始，是容易被转变的。</span></p><p><span></span></p><p><span>我们发现客户在流失，及时意识到了问题，及时去解决，是不会出现有更多客户流失的。我们发现员工都在不停地离开，如果找到了原因及时解决，是防止更多人的离开。</span></p><p><span></span></p><p><span>感情当中，我们及时发现了一些问题，及时去调整和改正，会防止感情变得更加恶劣，会防止感情，更加疏远。所以这一切，要是我们自己懂得修身，有了观察事物的能力，懂得事物发展的规律，我们才能解决接下来要发生的问题。</span></p><p><span><strong></strong></span></p><p><span><strong>恶其迹者，须避之。</strong>恶就是不好的行为，不好的事情。我们通过不好的事情，可以发现事情的轨迹，提前避开，同样是一种防患于未然。我们小的时候，父母都会告诉我们一句话，不要和那些坏孩子去玩，不要和那些品行不端的人做朋友。这就是因为大人看到了别人的恶行，看到了诡计，要避开的。否则继续和他一起交朋友，接下来也会变成那个样子，甚至受其连累。</span></p><p><span></span></p><p><span>现在生活当中也是一样的，如果我们发现了身边的朋友，有很多的不良爱好，我们要及时地避开，否则我们自己也会受其影响，受其牵连。同样我们在做一件事情的时候，如果发现身边的人发心都不正，心存邪念，就要及时离开对方。</span></p><p><span></span></p><p><span>我们用员工也是一样的，发现这个人心术是不正的，他做事情是会给团队带来不好的影响的，我们要及时让他离开，这也是一种避，防止后面的事情发生。</span></p><p><span></span></p><p><span>一切的事情都有其痕迹和规律，如果我们总是后知后觉，总有很多不可挽回的事情，如果我们能做到先知先觉，就可以其未兆易谋，在事情没有发生之前就把它解决掉。</span></p><p><span></span></p><p><span>我们修行也是同样的，看到身边的人出现的问题，及时给予调整，及时给予帮助和指正，他快速的修正，就可以避免接下来产生的痛苦和烦恼。我们养成了先知先觉的思维习惯，就会善于思考，善于观察，善于总结，才可以避免很多事情的发生。</span></p></div>"
},{
    "title": "《素书》第三十二讲 吉者百福归",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十二讲 吉者百福归</strong></span></p><p><span><strong></strong></span></p><p><span><strong>畏危者安，畏亡者存。</strong>畏危者安，畏惧危险的人，反而是安全的。举个生活当中的例子，比如，有的女孩子怕出门，“我也不敢，我也害怕，害怕有危险，我害怕黑夜”，这个时候她反而是安全的，就不会遭遇，不会被抢劫啊，因为她害怕危险而不去做这样的事情，反而是安全的。</span></p><p><span></span></p><p><span>比如，一个小孩子，胆子比较小，“我怕开水烫到我，我怕和其他的小朋友打架”，这个时候反而是安全的。修行之人也是同样的道理，有的人畏惧因果，“我不敢做坏事，我不敢做恶事，我怕天道循环的”，这个时候反而是更安全的人”。</span></p><p><span></span></p><p><span>最怕的就是没有敬畏之心，不敬畏因果，也不敬畏他人，也不敬畏事情，反而让自己陷于危险的境遇，而不自知。善恶之报，如影随形，所以我们要懂得畏惧，要懂得敬畏，敬畏天道，敬畏因果，觉得有危险的事情，我们一定不要去做。伤害他人的事情，我们一定不要去做。这个时候我们才能让自己变得安全，让自己的心，变得安稳，变得坦然。</span></p><p><span></span></p><p><span>畏亡者存，害怕死亡的人，反而可以生存下来。有的人说:“我怕死，我不敢吸烟，吸烟有害健康。我不敢喝酒，喝酒会乱性，乱德”。这个时候反而生存了下来。告诉我们敬畏什么事情，在什么事情方面就会安全，就会存在。</span></p><p><span></span></p><p><span>举了两个生活当中极端的例子，比如害怕死亡，不喝酒，不吸烟，是为了让大家更明白他所阐述的道理，而不是开始变得小心翼翼了，我们要懂得居安思危的道理。</span></p><p><span></span></p><p><span>比如，在一个家庭当中也要居安思危，现在家庭是美满幸福的，但是我们也要时时地注意观察，当孩子发生叛逆的时候，我们及早发现，这也是一种居安思危。</span></p><p><span></span></p><p><span>我们做企业也是同样的道理，虽然我们现在在蒸蒸日上，要懂得居安思危，时时观察有没有可能的危险出现，有没有什么动荡出现。我们交朋识友也是要懂得居安思危的，虽然我们现在还有很多的朋友，可是也要看有一些朋友，是不是在发生变化了。</span></p><p><span></span></p><p><span>我们去读书，去看电视，去看电影，经常会看到很多的桥段。不知不觉身边的人，都在发生变化。不知不觉，我们可能就落入了什么样的危险。不知不觉，我们的企业其实是在走下坡路的，只是我们没有发觉。我们要提高自己的警惕性，提高自己的敏锐度，都是为了更好地生活，更好地经营家庭，更好地经营企业。</span></p><p><span></span></p><p><span>有的人可能会说:“一会讲居安思危，一会讲安住当下”，难道不冲突吗？实则它并不冲突，居安思危是我们一种敏锐的思维方式，是一种积极的态度，是一种观察的智慧。</span></p><p><span></span></p><p><span>我们安住当下，同样是一种思维方式，我们当下讲课，就专注的讲课。我们当下吃饭，就专注的吃饭。我们当下的玩耍，就专注的快乐就好了，所以并不冲突，这一生我们会学习很多种思维方式，而这些思维方式，会用到不同的事件上，会用到不同的人身上，会用在不同的人生阶段，所以并不冲突。</span></p><p><span></span></p><p><span>当我们学习了更多的智慧和方法，最后都要归于空的，这个时候空中妙有。该居安思危的时候，我们就居安思危。该安住当下的时候，我们就安住当下。该其未兆易谋的时候，我们就其未兆易谋。该至诚如神的时候，我们就开始至诚。该喜悦的时候，我们就去喜悦。该去发怒是一种方法的时候，我们就去发怒就好了。</span></p><p><span><strong></strong></span></p><p><span><strong>夫人之所行，有道则吉，无道则凶。</strong>开始做总结了，夫是助词，人的行为，有道则吉，无道则凶，我们所做的事情，所有的行为，我们的思维，心念，这都是行为。心念也是一种行为，已经产生了，当心念，思维，行为，所做的事情合于道的，结果就是吉的。如果是不合于道的，背道而驰，结果必然是凶的。</span></p><p><span><strong></strong></span></p><p><span><strong>吉者百福所归，凶者百祸所攻。</strong>如果是合于道的，就是吉的。百福所归，所有的福德自然来到身边。凶者百祸所攻，如果做的事情是不合于道的，就是凶的，必然会有很多祸端来到身边，来攻击的。</span></p><p><span><strong></strong></span></p><p><span><strong>非其神圣，自然所钟。</strong>这两句话玄妙无比，非其神圣，这本身不是一件神圣的事情，自然所钟，自然而然就是这个样子的，这就是道的循环规律，是自然而然导致了这样的结果，非其神圣。</span></p><p><span></span></p><p><span>比如，我们在生活当中经常会赞叹，说这个人真的是神了，做事情如此的顺畅，自然所钟。因为所做的事情是符合道的，符合规律的，结果自然呈现。反之也是一样的，如果做的事情，经常是坑害他人的，损害他人的，这个时候很多人就会说：“看看遭报应了吧”，这个也不神圣，非神圣所为，也不是无形的力量所为，他只是一种天道循环的规律而已,自然而然就会导致了这样的结果。</span></p><p><span></span></p><p><span>如果我们做了很多利益他人和帮助他人的事情，呈现出来的结果自然就是好的，自然就会有很多人愿意来帮助我们，心甘情愿地付出，非其神圣，自然所钟，自然而然就是这样的结果，仅此而已。</span></p><p><span></span></p><p><span>只是一种规律而已，天道损有余而补不足，《道德经》里所讲的话，天道循环的规律就是这样的，当我们吃了亏，道就是用来平衡所有事情的，自然会补给我们。</span></p><p><span></span></p><p><span>在生活当中，我们今天帮助了一个人，他可能没有给我们回馈，帮助了一百个人，这一百个人也可能没给我们回馈，但是当遇到事情的时候，会有其他人回馈的，会有其他人来帮助的。</span></p><p><span></span></p><p><span>同样我们做坏事情也是一样的，我们今天伤害了这个人，可能他没有报复。我们今天骗了这个人，这个人可能还不知晓，可是终有一天，我们会被其他人骗的，终有一天，我们会招来其他的灾祸，道理就是如此简单，仅仅是规律而已。所以非其神圣，自然所钟，一切都是自然而然该发生的。</span></p><p><span></span></p><p><span>一个心地善良之人，生活顺遂的人，更明白这样的道理。我们帮助了很多人，我们没有求回报，可是在生命的关键时刻，总有人帮助我们，也不知道为什么，这就是自然而然。</span></p><p><span></span></p><p><span>还有的人，这个时候就会抱怨了，怎么就没有人帮助我，那我们想一想在这一生,又何曾帮助过他人。我们没有帮助那么多人，没有行善积德，天道怎么会回馈给我们，这也是自然而然规律而已。如果我们自己是做过很多坏事的人，自己也要去思考，我们在不知不觉当中，明知而故意为之，当中伤害了多少人。</span></p><p><span></span></p><p><span>所以当下我们心里是不安的，是忐忑的，或者我们当下混的贫困潦倒，我们也要停下来去思考了，非其神圣，自然所钟，自然而然就是这样的，仅仅是规律而已。</span></p><p><span></span></p><p><span>我们去观察身边的人和事情，都可以得出结论，经常伤害他人的人，自己的福报消耗以后，必然是落寞的结果。经常帮助他人的人，虽然当下生活可能是困苦的，可是他内心却是知足坦然的，将来也必然有发迹，必然有好的结果。只不过我们当下的目光或许是短浅的，只看到了当下发生的事情，而不能看得更长远。</span></p><p><span></span></p><p><span>自古圣贤文化，都告诉我们因果不虚，告诉我们善恶之报，如影随形，告诉我们积善之家必有余庆，积不善之家必有余殃，这些都是真真实实的道理，都是道的循环规律，切不可不遵道而行。</span></p><p><span><strong></strong></span></p><p><span><strong>务善策者无恶事，无远虑者有近忧。</strong>务就是务实，诚诚恳恳地去做。务善策者无恶事，我们诚诚恳恳地心存善念，每一个想法思维都是善的，行为都是善的。无恶事，不会有恶事发生在自己的身上。</span></p><p><span></span></p><p><span>无远虑者有近忧，如果我们不能深谋远虑，近处必然会有忧患，这是两句话分开的意思，我们合成一句，这句话很重要，人无远虑必有近忧，那我们最远的谋略又是什么？上一句话告诉我们了，最远的谋略莫过于务善，去做善事，去动善念，去讲善语，如果我们没有如此远虑，必有优患。</span></p><p><span><strong></strong></span></p><p><span><strong>《易经》讲:“不恒其德，或蒙之羞。”</strong>我们如果不能恒德行去做事情，就会受到羞辱。我们有一件事情不恒德，在一件事上就会受到羞辱。我们有很多事情不恒其德，就会有很多事情受到羞辱。</span></p><p><span></span></p><p><span>比如，我们讲恶口，对他人恶语相向，这是不恒德了，也会遭到对方的羞辱，甚至遭到旁观者的看不起，或者遭到对方心生怨恨，伺机报复，都会承之羞的。</span></p><p><span></span></p><p><span>如果我们做的事情，不是真正的想着帮助客户，虽然得到了暂时的利益，将来也必承之羞辱，他可能离开了我们，可能背后想办法来报复我们，可能到处讲我们的不好，到处去讲我们做的事情是缺德的，缺少德行。</span></p><p><span></span></p><p><span>这里来做总结，切勿把这句话分开来听，不单单是，人无远虑必有近忧，只要我们去多谋划，多思虑就可以了。不够的，我们的思虑和谋划必然是合于道的，合于善念，合于善行的，如此我们的忧患才会变得少。否则善有善报，恶有恶报，我们当下虽然有所得，长远来看，必然有所失，这即是忧患。</span></p><p><span></span></p><p><span>整个《素书》都是告诉我们，修身为本，让我们自己合于道、德、仁、义、礼，合于善，合于信，合于诚，合于迎，当我们有了这些优秀的品质，这都是我们天性之中的光芒，我们用来修正自己的行为。</span></p><p><span></span></p><p><span>《素书》里的方法，我们才能妙用无穷，否则即使听懂了里面的道理，我们依然做不到，因为没有修身。夫为人之本，不可无一焉，我们要为人处事的根本，我们要齐家治国平天下的根本，要修行的根本，我们要做事业的根本，一个都不能缺少。所以这是我们最大的远虑，去谋道，去谋善道。</span></p></div>"
},{
    "title": "《素书》第三十三讲 同志者相得",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>第三十三讲 同志者相得</strong></span></p><p><span><strong></strong></span></p><p><span><strong>同志相得，同仁相忧。</strong>《素书》的结尾部分，每四个字为一组，而每一组词都在告诉我们一种自然规律，让我们认清事物发展的必然性。这是《素书》非常精华的地方，用词很简洁明了，但是告诉我们所有事物发展的规律和必然性，当我们了解了这些事物发展的规律和必然性，我们是可以提前谋划，规避一些事情的发生。</span></p><p><span></span></p><p><span>同时在发生了一些事情的时候，我们也不必烦恼，因为他是必然发生的一种规律，这个时候我们来看同志相得，只有共同志向的人才可以互相得到。</span></p><p><span>举个例子，跟我们合作做生意需要有共同的志向，大家的追求是一样的，才可以互相得到，也才可以共同的得到某种结果。有的人的志向就是帮助更多的人，而有的人的志向是只想要养家糊口，仅此而已。</span></p><p><span></span></p><p><span>有的人只是想赚更多的钱，这个时候两个人虽然做着同样的事情，但是却不同志，互相之间不会得到认可、支持和鼓励，也不会得到多么美好的结果。因为大家的志向不同，心念不同，思维方式不同，行为不同，这个时候必然产生很多的分歧，又怎能互相得到呢。 </span></p><p><span></span></p><p><span>生活当中交朋友，同样如此的道理，为什么要志同道合？如果大家没有共同的志向，因为追求不同，肯定会有很多地方是冲突的，也没办法互相得到，懂得这个道理，无论是我们在生活当中交朋友，还是做事情都要懂得，一定找和自己志向相同的人，如此方可得到。</span></p><p><span></span></p><p><span>否则一定是会有很多的分歧，产生分歧和冲突的时候，我们就明白了，原来是一种必然性，因为我们没有共同的目标，没有共同的志向，怎么能互相得到，不可能的。</span></p><p><span><strong></strong></span></p><p><span><strong>同仁相忧，</strong>同样有仁德的人，忧虑的事情自然就是相同的。《论语》讲:“君子忧道不忧贫，谋道不谋食”，君子忧虑的是道，无法推行下去。而小人不懂得修身的人，我们称为小人，而小人是谋食不谋道，忧食不忧道的，担忧自己的生活不好，担忧赚不到钱，担忧人际关系不好，担忧没有人爱。</span></p><p><span></span></p><p><span>但是有仁德的君子不是这样，总是在担心是不是自己做的事情太少了，是不是在这件事情当中没有贡献自己的价值。是不是我没有为道去做些什么，是不是我没有去行善积德，所以忧虑的就不相同。</span></p><p><span></span></p><p><span>在一个团队当中更是如此，如果大家没有共同的志向，没有共同的仁德之心，所以我们的力量无法放到一起，因为忧虑的事情不同。员工在忧虑怎么能得到更多的钱，为什么老板不给涨工资。而老板忧虑的是如何服务好更多的客户。大家就是不同频的状态，所以力量自然不能聚集到一起。</span></p><p><span></span></p><p><span>整部《素书》我们一直在强调，既有内修，又有外用相结合，要以修身为本。当我们自己去修道、德、仁、义、礼，这个时候我们自己才能感召到，同样有这五者的人来到我们身边，并且我们才有识人之能，才能识得什么样的人，是有仁德的，什么样的人是有道义的，什么样的人是懂礼的，什么样的人能以和为贵，才能做到同志相得，同仁相忧。</span></p><p><span></span></p><p><span>我们的志向是一样的，想要去做共同的事情，有共同的理想，有共同的方向，才很容易沟通，说什么对方听得懂，大家都在修仁德，忧虑的事情都一样，一个修行的践行者，一个文化的践行者，忧虑的都是他人，怎么不能接触到圣贤的文化，他人怎么能不行善积德，当我们都是这样的忧虑，是不是大家都在致力于做同样的事情。</span></p><p><span></span></p><p><span>否则我们感召来的人和我们识别来到我们身边的人，他们只是在忧虑心中的私欲，很难产生力量，团队就是不和谐的，大家不能众志成城，那我们如何能得到一个好的结果。</span></p><p><span></span></p><p><span>《素书》这一部分告诉了我们，很多事物的发展规律，告诉我们很多必然性，当出现问题的时候，要懂得从其中找到规律，为什么会出现这样的问题，大家忧虑的事情，担心的事情不同，说明我们没有同仁，我们再把仁字换掉，忧虑的事情不相同，说明我们在某种意义上，在某种价值观上，不能达到同频，所以忧虑就不同。</span></p><p><span><strong></strong></span></p><p><span><strong>同恶相党，</strong>同样是恶的事情，同样是恶的人，这里的恶分为两种，一种是恶人，一种是恶势，同样是恶的人就会相党，结党营私，有的人行事就是险恶的，这个时候碰到一样险恶的人就会结党了。</span></p><p><span></span></p><p><span>我们再举个例子，同样恶的事情是什么意思？比如，这个人平时是不恶的，挺好的，挺善良的，可是遇到了某件事情，或者当私欲起的时候，想做某一件恶事，又遇到也想做这件恶事的人，这就叫同恶，开始相党，两个人开始结党营私了。</span></p><p><span></span></p><p><span>同爱相求，有共同爱好的人，就会开始互相探求，互相追求，求那个果。我们举例来说明，比如，爱画画的人和同样爱好画画的人，两个人就会相求，互相探讨，互相学习，互相交流，这个都叫求。同样爱好喝酒的人，也是互相求的，但是不同爱好的人就无法相求了。</span></p><p><span></span></p><p><span>举个例子，一个爱好画画的朋友，来到我们家里，可是我们不爱画画，这个时候朋友就问我们：“你们这里哪里有画展？”“我们这个城市好像没有画展。”不会没有的，是因为没有这样的爱好，所以我们不关注。</span></p><p><span></span></p><p><span>再举个例子，一个特别爱好写字的朋友，或者特别爱好修行的朋友，和不爱好学习、写字和修行的人，去聊修行的妙处，他是没有感受的，这个时候就无法相求。</span></p><p><span><strong></strong></span></p><p><span><strong>同爱相求，</strong>我们有了什么样的爱好，才能在哪个领域去探求。我们虚空济在打造一个圈子，或者说我们在打造一个大家的共同体，比如，建群、超话，我们打造虚空济这样一个同频和共鸣的地方，大家在生活当中做了一件善事，可以来这里分享。</span></p><p><span></span></p><p><span>比如，我们生活当中做了一件善事，兴高采烈地去和朋友讲，他可能心里还在想：“干点正事得了，不好好工作，做什么善事。”我们今天学习到了，修行当中的体悟，我们特别的喜悦和兴奋，可是和不同频的人去讲的时候，他会觉得，“这也叫什么感受吗？这也算什么喜悦吗？”他是完全无感的。</span></p><p><span></span></p><p><span>但是我们在大家打造共同的这个环境当中，不是这样的，我们说做了一件善事，大家都鼓励和赞叹。我们说，有了修行上的体悟，大家都有感同身受，“真好，是的，是这个样子，我也是这种感觉”。或者是他们虽然没有那种感觉，可是我们一说，他们就能听得懂。</span></p><p><span></span></p><p><span>就如同两个同样爱好画画的人，虽然有可能没有他的境界高，可是我们说画画里面的感悟和心得，他一定听得明白。可是我们跟一个不同爱好的人，是讲不清楚的。从这些规律当中都可以及时的去调整和规避。</span></p><p><span></span></p><p><span>当我们和别人阐述的问题，对方无感的时候，我们就明白了，原来是没有共同的志向和爱好，所以对方不理解，也是非常正常的，这是事物的发展规律。同时我们明白这个道理，就懂了，要想找到一个相求和相得的人，我们要找到一个有共同志向和爱好的人，大家就保持同频了</span></p><p><span><strong></strong></span></p><p><span><strong>同美相妒，</strong>同样美貌的人，同样美丽的事情，同样好看的一件东西或者一个物件，就会产生同美相妒。我们说事情和物件不好理解，我们说人吧，两个同样差不多美貌的人，就会互相妒忌。</span></p><p><span></span></p><p><span>比如，一个人长得特别美，一个人长得特别丑，他们之间是不会产生妒忌的，因为大家不一样。我们再把这个美去掉，美是可以换成任何东西的，可以换成任何词语，什么意思？只要是差不多相同的人，相同的事情，都会产生妒忌。</span></p><p><span></span></p><p><span>举个例子，通常在生活当中，我们容易妒忌身边的人，为什么？看得见，够得着，比如，同样是在公司做着差不多的事情，我们就会嫉妒别人。如果是一个公司的员工，是不会嫉妒总经理的，也不会嫉妒市场总监，营销总监等等高职位的人，因为大家差的太多了。</span></p><p><span></span></p><p><span>比如，我们生活的环境也是如此，如果生活在村里，很嫉妒邻里之间所发生的事情，因为大家差不多，可以够得着。所以我们生活在村里的人，是不会嫉妒生活在大城市的人，因为大家生活的环境不一样，层次不一样，身份不同，就不会产生嫉妒了。</span></p><p><span></span></p><p><span>比如，我们和身边的同学很容易产生嫉妒，同样是同学，出生的家世差不多，长相也差不多，为什么她可以嫁得那么好，而我不能，就开始生嫉妒了。如果对方的家世很好，而我们的家世不好，反而不会嫉妒，因为大家没有那么多的共同点，这就是同美相妒。</span></p><p><span></span></p><p><span>我们再举个例子，有相同的功用的人，容易产生嫉妒，在一个团队当中，有一个做事情认真严谨的人，同样又找来一个做事情认真严谨的人，他们两个人的性格特点和能力差不多，一起做事情，很容易产生妒忌。</span></p><p><span></span></p><p><span>“我们已经能做这些事情了，为什么又找一个这样的人？是不是不信任我了，是不是开始想要把我换掉了，可以啊，那他能做，让他做吗，那一个人做一半。”这个时候会发现两个人，会互相妒忌的，甚至会互相做一些小的动作。</span></p><p><span></span></p><p><span>我们明白这个道理，第一是要看清事物的发展规律，出现了这种妒忌，首先要明白这是必然的，也是正常的，同时我们要懂得如何去规避，这个才是有智慧人的表现。有一个同样这样性格色彩和能力的人，我们就尽量不找和他相同的。即使是和他相同的，我们安排做不同的事情，就可以避免嫉妒的发生。</span></p><p><span></span></p><p><span>这一切都是要以修身为本的，只有不停地修身，才能变得智慧和明达，才能看清楚一切事物的发展规律，才能做到明察秋毫。我们古人讲聪明，何为聪明？聪以知远，明以察微，我们的聪慧是可以知远的，可以谋得很远，思虑得很周全。我们的明，又可以察每一件细小的事情，这个叫聪明。</span></p><p><span></span></p><p><span>我们要懂得知人善用，人尽其才，物尽其用，否则看不清楚，又如何规避事情的发生，当出问题的时候，我们又如何能及时发现，所以要不停地去学习，不停地去修行，让自己变得更有智慧，让自己变得更明达。</span></p><p><span></span></p><p><span>这就是《素书》的妙处，不仅给我们讲修身之道，更多地是在讲如何用，如何观察事物的规律，为什么会出现这样的事情，都是规律，这个规律我们统称为道。</span></p><p><span></span></p><p><span>当我们看到人和人互相产生妒忌了，如果是明达的，就知道一定是某一个共同点，因为一件什么事情或者某一种心理变化，互相产生了妒忌。我们及时察觉，就可以及时解决和避免以后的事情发生，这个就是修身所带来给我们的妙处。</span></p></div>"
},{
    "title": "《素书》第三十四讲 同声者相应",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十四讲 同声者相应</strong></span></p><p><span><strong></strong></span></p><p><span><strong>同智相谋，</strong>有相同智慧的人，才可以互相谋划，互相探讨和交流。举个例子，比如，一个公司的领导和财务总监，或者和财务部门经理，可以去谋划财务方面的事情。为什么？在这一方面，两个人有同等的智慧。比如说，一个公司的领导，如果和后勤部门的经理沟通财务方面的事情，这就是不同智，是无法谋划的。</span></p><p><span></span></p><p><span>一个公司的领导人，可以和市场部门经理沟通市场的事情，因为大家的智慧是差不多的，可以共同地谋划。但是如果找做饭的阿姨去沟通市场方面的事情，是无法共同谋划的。</span></p><p><span></span></p><p><span>在生活当中也是一样的，我们和什么样的朋友可以去谋划事情，大家的智慧差不多，如果比我们智慧高很多的人，不会和我们共同谋划的，那个叫指点。同样如果智慧差我们很多的人，我们想去和他谋划一个事情，根本说不到一起去，大家的思维智慧完全不同频，这是从大的角度在讲，同智相谋。</span></p><p><span></span></p><p><span>我们再从某一方面讲同智相谋，举个例子，每个人智慧的方向有可能不同，有的人在财务方面有智慧，有的人在管理方面有智慧，有的人在经营方面有智慧，有的人在市场方面有智慧，有的人在做饭方面有智慧，有的人在摄影方面有智慧，这个时候我们和有摄影智慧的人去沟通摄影，有财务智慧的人去沟通财务，有做饭智慧的人去沟通做饭，做事情就会变得简单，有迹可循的。</span></p><p><span></span></p><p><span>在一个人带领团队的过程当中，刚开始的时候，可能来到我们身边的人，他某一方面的智慧，原本就是很显著的。而有的人或许某一方面的智慧不显著，当出现不显著的情况，是需要我们去发掘引导的。</span></p><p><span></span></p><p><span>比如，我们觉得这个人是适合做拍摄的，这个人是适合做文案的，这个人是适合做管理的，我们发掘了他某一方面的优点，或者是智慧的时候，我们去和他不停地沟通，甚至是手把手地去教，一旦找对了某一方面的优点，再不停教会他，就同智了，就可以和他沟通谋划的。再经过一段时间，他的成长，我们和他又不同智了，为什么？他在这方面的智慧已经超过我们了。</span></p><p><span></span></p><p><span>举个例子，我们培养了一个摄影的人，培养了一个录像的人，经过一段时间，会发现他比我们更有智慧，更有方法做得更好的时候，我们就可以闭嘴了，交给他去做就好了。</span></p><p><span></span></p><p><span>在其他方面也是同样，我们发掘了一个人身上的智慧和特点，教会他做这件事情，当他做的比我们智慧更高的时候，就只听不讲了，因为他做饭做的比我们好，我们何必再去教他。他拍出来的东西比我们拍的角度更好，又怎么去教他呢，我们也不需要去和他谋划了，这就是培养人才的过程。</span></p><p><span></span></p><p><span>所以我们只有懂了《素书》里面交给我们的规律，才能看到事情发生而不生烦恼，了解他是一种常态，并且积极地去面对，解决，避开事情的发生。我们再反过来讲，如果我们作为一个在企业当中工作的人，或者在这个社会上立足的人，我们要做到在某一方面的智慧是不可替代的。</span></p><p><span></span></p><p><span>比如，我在做饭方面别人是无法替代的，我在财务方面是别人不可替代的，我在摄影方面是别人不可替代的，我在某一项工作的坐位上的智慧，是别人不可替代的。为什么要让我们自己做成不可替代呢，只有我们自己达到不可替代的，这样的能力，这样的担当，我们会产生自信的。</span></p><p><span></span></p><p><span>什么样的人不自信？“万一把我换掉怎么办？”来了一个和我们差不多的人，我们就开始担忧和忧虑啊，“老板是不是有什么想法呀，是不是开始看不上我了，是不是觉得我不行啊。”如果我们做的事情是不可替代的，怎么会忧虑，怎么会担忧。</span></p><p><span></span></p><p><span>所以一定让自己某一方面的才能和智慧，是在这个团队当中不可被取代的，这个时候我们就是自信的，自信，就不会产生嫉妒之心，自信，就不会迷茫，自信，我们就不会阴暗。</span></p><p><span></span></p><p><span>如果不够自信，一旦有事情，有新的人来，或者今天老板说了我们两句，就开始迷茫了，“这是看不上我了，是又要换掉我吗？”每天生活在担忧和恐惧当中，再来一个新的人，我们可能就产生阴暗的想法了，要想办法把他排挤走，要不然他万一是来取代我的位置，取代我的工作，该怎么办？</span></p><p><span></span></p><p><span>所以，我们要想立足，要不断地提升自己的才能和某一方面的智慧就可以了。我们就很坦然，安住当下，去做我们手里的事情，也是非常自信满满，去积极地面对我们的生活。</span></p><p><span></span></p><p><span>同样的道理，我们延伸到生活当中亦如此。我们交朋友，有某一方面的智慧是不可取代的，就非常的自信和坦然。在感情的经营当中，也是一样的，是有着某一方面的智慧的，是不可取代的。我们就很自信，就不会迷茫，就不会缺乏信心，就不会每天去多愁善感和过多地思虑和担忧。</span></p><p><span></span></p><p><span>所以要让自己增长智慧，如果不能全面地增长智慧，最基本的在某一方面我们是优秀的，是有智慧的，我们才能活出自己的风采和自信。</span></p><p><span><strong></strong></span></p><p><span><strong>同贵相害，</strong>比如，我们去看历史，同样是重臣，或者同样是朝廷的宠臣，或者同样是朝廷的将军，同样是朝廷的文官，这个时候就会产生相害，因为相贵。</span></p><p><span> </span></p><p><span>在一个企业或在一个团队当中，一样的道理，两个人在老板心里的位置差不多，同样是贵的，就有可能产生相害。道家告诉我们，功成身退，天之道。为什么要功成身退？因为同样位高权重的时候，就会有人想害我们的，就会互相伤害，这也是事物发展的必然规律。</span></p><p><span></span></p><p><span>我们去读历史也是一样的，同样是皇子和太子之间会互相伤害的，为了争夺皇位。但是最不得宠的那个皇子，反而是最安全的。因为大家都知道，他是不想争这个皇位的，他也没有那个能力，在父皇的心中也不受宠爱和珍贵，这个时候反而是最安全的一个。</span></p><p><span></span></p><p><span>在一个团队当中，也是一样的，最默默无闻，不受人关注的那个人，反而不受伤害，大家反而愿意去保护他，这就是以弱胜强，为什么愿意保护他，他无毒无害，什么都不争不抢的状态，谁会伤害他呢，反而同样是贵的人，要互相害了。</span></p><p><span></span></p><p><span>当我们学习了《素书》，了解事物发展的规律，我们再去看生活当中发生的事情，再去看团队发生的事情，一目了然，清清楚楚，我们看到了事物发展的规律，原来这是一种必然性。</span></p><p><span></span></p><p><span>如</span><span>果我们没有学习《素书》之前，很多道理好像也懂，但是不够清晰，不够透彻，不够系统，我们学习完《素书》，再去看生活当中发生的事情，非常的明了，不但可以作壁上观，看得清清楚楚，也可以提前去谋划，避开一些事情的发生。</span></p><p></p><p><span><strong>同利相忌，</strong>猜忌、忌惮、忌讳，当两个人出现相同的利益的时候，为了争这个利益就会互相猜忌，互相有所忌惮，有所忌讳。举个例子，比如，我们去读历史的时候，有两个重臣想要争当某一个职位，就是同利，两个人就是互相忌讳，互相忌惮的，甚至不和对方一起走路，忌讳，就是做什么事情，不让对方知道，这个也是一种忌。</span></p><p><span></span></p><p><span>我们现在企业当中也是一样的，有两个人竞争同一个岗位也是如此，两个人就是互相忌讳的，做什么事情也不让对方知道，甚至不愿意多和他讲一句话，都是因为大家有了共同的利益。</span></p><p><span></span></p><p><span>比如，竞标的时候也是这样的，我们同样竞争一个项目，两个人之间是互相忌讳的，互相忌惮的，互相猜忌的，“是不是对方用了什么手段，是不是对方用了什么方法，”都是因为我们有了相同的利益，就会出现这个忌字，这也是一种规律，是一种必然发生的事情。</span></p><p><span></span></p><p><span>同声相应，同气相感。同声，是同一种声音，是可以相应和的。同一种气体，是可以互相有感知，有感受的，这是从物理方面来讲。我们再来延伸，同声相应，声是什么呢？价值观、观点。比如，我们支持什么事情，支持仁、义、道、德，这是一种声音，一种观点，一种精神状态，一种价值观。</span></p><p><span></span></p><p><span>同声相应，同样支持这种观点和这种声音的人，就是互相应和的。在一个团队当中，在一个企业当中，在一个家庭当中，也同样如此。出现了一件事情，如果大家的声音是一致的，观点是一致的，这个时候就可以相应和。</span></p><p><span><strong></strong></span></p><p><span><strong>同气相感，</strong>感应、感动、感受，感知，都称为感。同气的状态下，自然就会相感，我们连在，一起来理解。气，扩大来讲，气会是一种磁场，会是一种气场，会是一种环境，当我们有同样的气场，我们有同样的价值观，在同样的环境下，就会互相有应。</span></p><p><span></span></p><p><span>比如，在一个团队当中，亦是如此，团队的气场是和谐的，别人就可以感受到，这种和谐的氛围。在一个家庭当中，如果这个家庭是吵吵闹闹的状态，互相也能感受到这种尴尬的氛围。</span></p><p><span></span></p><p><span>比如，当我们看一个人不顺眼的时候，其实会散发一种气场的，一种磁场，这个时候，同样对方也正在看我们不顺眼，就是不相感应的。我们慈爱地对待一个人，无论我们用了什么样的方法和手段，甚至可能对他是严厉的，是指责的，可是对方似乎可以感受到，我们的这种慈爱之心，这就是一种气，对方给我们的就是相应和的。</span></p><p><span><strong></strong></span></p><p><span><strong>同声相应，</strong>同气相感，说同一种声音，同一种观点，同一种气场和同一种环境，看似好像无形无相，可是我们细细地思索和感知的时候，无处不在，每个人的身上，都会散发着自己的磁场，甚至不用讲话，有的时候，都在传达着某种观点和声音，这两句话是非常妙的。</span></p><p><span></span></p><p><span>所以我们去观察，比如，我们走到了一个环境当中，或者去观察一个团队，可能他的团队，不需要做什么事情，每个人在讲话或眼神交流，和整个地方所散发的磁场，我们能看出来，声音合与不合，气场合与不合，磁场合与不合，我们的感知能力越强，我们就越能感受到，这种气场的不同和这种磁场的不同。</span></p><p><span></span></p><p><span>比如说在生活当中，我们去到一个地方，可能说不清楚，这个地方是一个什么样的气场，但是我们会有觉知的。比如，在这个地方，我们待着是不是舒服的，我们自己是知道的，我们去到一些地方，待着是不舒服的，甚至我们想要尽快的离开，或者我们去到了一个地方，到了这里之后，是感觉到焦虑的，都是某种气场和磁场，在发生着作用。</span></p><p><span></span></p><p><span>这种气场和磁场，跟我们自己本身所带的磁场和气场，如果是相吻合的，在这里待着就是舒适的，如果是不相应和的，是暗流涌动的状态，我们感受到的就是，在这个地方非常的不舒服，想要尽快的离开。如果我们懂得去打造共同的声音，观点、价值观、态度、气场和磁场，其实这个是蛮高级的，如何才能打造同声相应，同气相感。</span></p><p><span></span></p><p><span>我们自己首先要有正确的声音，正确的观点，正确的态度，要有慈爱之心，我们散发的都是慈爱的光芒，都是利他的精神，都是奉献和担当的精神，这些观点和我们持身中正的态度，看似好像没有什么影响，可是我们的心念，思维和行为当中，如果不停地散发着这样的磁场和气场，会逐渐地感染到身边的每一个人。</span></p><p><span></span></p><p><span>当我们身边的人和我们一起修行，和我们一起去学习，当我们大家打造了共同的磁场和气场，我们所在的地方，就会散发这样的气场。</span></p><p><span></span></p><p><span>比如，我们的团队，整个散发的都是仁爱的和谐的，我们的家庭，都是散发着这种和谐，舒适、温暖的气场，当别人来到这里的时候，是可以快速地融入进来，是感觉舒适的。</span></p><p><span></span></p><p><span>我们中华的文化，自古以来都是以和为贵，家和万事兴，和气生财。《中庸》讲：“致中和，天地位焉，万物育焉。”都在阐述这个和的重要性。和，是大家觉得很舒服的状态。</span></p><p><span></span></p><p><span>比如，有的磁场很让人焦虑，或者我们到这个地方，就会觉得很压抑，这个都是不和的状态，如果出现了不和的状态，负能量的状态，会让别人觉得很不舒服，在这个地方是待不下去的。</span></p><p><span></span></p><p><span>比如，我们去一个店铺吃饭，喝咖啡，读书或者是住宿，都是一样的，有的店铺，整个环境的设置和所占的地理位置，还有一点很重要，这家经营店铺的老板，他是什么样的心念和思维，其实长时间会给这个地方，注入某一种气场和灵魂，我们去到这样的店铺去消费，或者在这里喝咖啡，吃饭或者住宿，会觉得很舒服，有的地方，住在这里，或在这里吃饭，我们想着快速的离开。</span></p><p><span></span></p><p><span>气场，是既有外在装修的设计，又有内在散发的，这种气场和态度。我们可以去观察，凡是经营的比较好的店铺，一定有它的人文色彩，和人的精神、人的态度在其中，比如，有的店铺经营的好，可能是老板很热情，老板很温暖，可能是这个老板很善解人意，很善良。</span></p><p><span></span></p><p><span>我们养成观察规律的习惯，会发现任何一件事情，只要做得好，除了外部环境，一定有人的因素，就是人的心念思维，人的态度，人的气场和磁场在其中。</span></p></div>"
},{
    "title": "《素书》第三十五讲 不可与理违",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十五讲 不可与理违</strong></span></p><p><span><strong></strong></span></p><p><span><strong>同类相依，</strong>相同类型的人，或者发生某一类事情的时候，就会出现相互依靠。举个例子，比如，维权事件，只要出现维权的时候，同样去维权的人，就是一类人，就会相互依靠，相互帮助。</span></p><p><span></span></p><p><span>再比如，我们经常提到一个词，叫病友，我们身体得了某种疾病，我们在医院，或者在其他的特定环境下，认识了很多和我们有相同疾病的朋友，成为病友，这叫同类人，会互相依靠的，这就是同类相依的道理。</span></p><p><span></span></p><p><span>再讲历史典故中，苏秦佩六国相印，就是同类相依的典范，在战国末期，有战国七雄，齐、楚、燕、韩、赵、魏、秦，七个国家，秦国最强大，秦国要逐一地去灭掉每一个国家，其他的六国，人人自危。</span></p><p><span></span></p><p><span>苏秦，是鬼谷子的弟子，他之前去过秦国，因为他知道秦国是最强大的，想要去为秦国效力，最后秦国没有用他，就回到了老家洛阳，头悬梁，锥刺骨，学习了三年，把老师鬼谷子的学术和精髓，认为已经学懂了。</span></p><p><span></span></p><p><span>于是，他开始游说其他六国，这就是同类相依。告诉其他六国，秦国是必定要灭掉我们六个国家的，他提出来合纵之术，就是六个国家结盟，以防被秦国灭掉。六个国家同意了苏秦的建议，给苏秦佩了六国相印，联合抵抗秦国来犯，这就是互相依靠。</span></p><p><span><strong></strong></span></p><p><span><strong>同义相亲，</strong>同样有义气的人，就会互相亲近。比如，同样有义气的人，有奉献精神，有担当精神，当我们碰到同样有义气，有担当精神，有奉献精神的人，自然就会互相亲近，这是英雄惜英雄的道理，即使在不相识的情况下，也可能同义相亲。</span></p><p><span></span></p><p><span>比如，我们自己本身是非常正义之人，是有担当和奉献精神的人，看到其他人也有担当和奉献精神，本来我们可能不相识，可是一旦接触，就会很亲近，因为我们身上有着共同的性格色彩，有着共同的正义。</span></p><p><span></span></p><p><span>甚至我们听说，某一个人是很正义的，会莫名地对他表示亲近，可能我们并不认识另外的那个人，可是我们听说了他的很多事迹，从内心也是向往的，从内心也觉得我们是同一路人，自然就会相互亲近。</span></p><p><span></span></p><p><span>我们再来补充，同志相得，同仁相忧，和这里的同义相亲，是同样的道理。如果我们想要身边有正义之人，有敢于担当和奉献的人，我们要做一个正义之士。我们要想得到有志向的人，首先要做一个有志向的人，才能互相得到。</span></p><p><span><strong></strong></span></p><p><span><strong>同仁相忧，</strong>我们想要有仁爱之心的人，留在身边，就要去做一个有仁爱之心的人，互相忧虑的事情会变得一样。比如，都是有仁爱之心的人，会忧虑他人之苦，会忧虑如何才能帮助更多的人，我们的思维和价值观，自然就是一致的，就会互相忧虑，互相得到，互相亲近。</span></p><p><span></span></p><p><span>归根结底，还是要以修身为本，如果我们是一个没有志向的人，也得不到有志向的人。我们如果不是有仁爱之心的人，也得不到有仁爱之心的人。我们如果不是一个正义肯于担当的人，也得不到其他的正义之士。</span></p><p><span></span></p><p><span>在人生当中，我们经常会感慨，为什么其他公司的员工如此付出，如此卖力？为什么其他公司的老板如此仁爱？可是我们不明白一个道理，是不是和我们当下所感召的事情，是相应和的。</span></p><p><span></span></p><p><span>我们看到其他公司员工的努力，说明人家的老板是感召了同样的员工，所以在生命当中，我们不需要去羡慕任何人，我们想要成为什么样子，想要什么样的员工，想要什么样的朋友，想要什么样的感情，首先让自己成为那样的人，自然就会相互得到，相互亲近。</span></p><p><span><strong></strong></span></p><p><span><strong>同难相济，</strong>有同样困难的人，会互相救济和帮助。我们刚才举的例子，同样是病友，这是同类人，会互相依靠，不只是互相依靠，还会互相帮助和救济，因为大家在经历着共同的苦难，我们的身体都很不舒服，有事情会互相帮助的。</span></p><p><span></span></p><p><span>苏秦佩六国相印的历史典故，亦是如此。六个国家会互相帮助的，因为他们在面对着共同的困难，就会互相帮助和救济，虽然可能是貌合神离，可能是表面的互相帮助，但是在面对同样的困难之时，一定会互相依靠和互相救济，互相帮助。</span></p><p><span><strong></strong></span></p><p><span><strong>同道相成，</strong>共同有道德的人，共同遵守道的行为，共同遵守道的规律，去做事情的人，才会互相成就。</span></p><p></p><p><span><strong>同艺相窥，</strong>同艺，是有着共同的才艺，共同的才能。我们把这个艺，扩大来讲，我们现在经常叫同行业，做同一件事情的人都称为同艺。窥，是暗中察看的意思，同行业之间做着相同事情的人，会互相暗中察看。</span></p><p><span></span></p><p><span>举个例子，比如开了一个饭店，会发现同行业的人，做成什么样子，其实我们心里是清清楚楚的，他家的生意如何，什么样的厨师在做饭，经营的怎么样，谁在做管理，甚至他们家的菜品都是从哪里进的，我们都会清楚，这就是同艺相窥的道理。</span></p><p><span></span></p><p><span>比如，我们经营一个公司，是做某一个行业的公司，其他和我们做同样事情的公司，其实都在暗中观察，他做成什么样子，我们清清楚楚，他做事情到底是为了什么而做的，我们也清清楚楚，懂得这个道理，我们更要持身中正。</span></p><p><span></span></p><p><span>当我们在某一个行业做事情，如果得罪了很多人，或者说持身不够中正的时候，同行业一定会站出来攻击于我们，因为同行业的人，做着同样事情的人，更加清清楚楚地，可以看到我们的缺点，和我们致命的问题。</span></p><p><span></span></p><p><span>好比是我们自己，做某一件事情，同样别人也在做这个事情，我们能看到他致命的缺点，和他真正做这件事情的目的。同行看的是门道，我们了解自己所做的事情，就可以通过他人的行为，了解他正在做的事情，到底是好还是坏。</span></p><p><span></span></p><p><span>比如，我们是讲修行的，是传播传统文化的，有很多其他的老师也在讲修行，也在讲传统文化，难道我偿看不出他的问题所在吗？难道看不出他讲的是真还是假吗？是清清楚楚的。</span></p><p><span></span></p><p><span>再举个例子，假如我们自己是做蛋糕的店铺，难道看不出来其他的蛋糕店里面用的材料，是好还是坏，他卖的价格是值还是不值？同行之间是清清楚楚的。我们更要持身中正，否则一定会有很多缺点暴露，最后沦为被人家攻击的把柄，会出问题的。</span></p><p><span></span></p><p><span>比如，我们在企业当中也是一样的道理，两个同样做市场经理的人，是可以看出对方真的有问题，还是假的有问题，如果他做的不好或许可以欺瞒他人，但是同样作为另一个部门的市场部经理，其实看得清清楚楚，这就是同艺相窥。</span></p><p><span></span></p><p><span>我们再去看历史，也是同样的，一样在朝为官的人，可能欺瞒得了人民，欺瞒得了君上。可是同样作为大臣的官僚，一定可以看出来他身上的问题，因为他也在默默地观察着我们，观察着对方。</span></p><p><span></span></p><p><span>《大学》中讲:“十目所视，十手所指，其严乎。”我们的行为都是被很多人，看在眼里，都是被很多人背后指指点点，非常的严格，我们就更要明白，持身中正是何其重要，否则一定会被内行看出门道，最后一定会身败名裂。</span></p><p><span></span></p><p><span>做事情要以修身为本，我们持守仁、义、礼，去做事情就好了，我们不怕任何人的窥探，在任何人面前，都是光明正大的，这个时候没有隐患。</span></p><p><span><strong></strong></span></p><p><span><strong>同巧相胜，</strong>巧字用的特别好，通常我们把一件事情做得很好，才称为巧。同样是做得好的人，一定会一争高低的，这是自然规律，阐述的道理就是如此的。</span></p><p><span></span></p><p><span>我们生活在这个世界上，竞争是在所难免的，只要同样做得好的人，一定会一争高下。我们去看古人，也是一样的，一个人如果是武林高手，一定会不停地有武林人士，上门挑战，因为他认为自己也是高手，一定要和我们一争高下的。</span></p><p><span></span></p><p><span>我们在这个时代，也是一样的，任何生意都会有人明里，或者暗中和我们一争高下，我们坦然的去面对，一切要发生的事情就好了，我们只需要让自己持身光明，做的事情坦坦荡荡，不惧风雨，也不怕任何的事情发生。</span></p><p><span><strong></strong></span></p><p><span><strong>此乃数之所得，不可与理违。</strong>以上所讲的这些道理，都是自然规律，自然而然发生的，我们是无法违背这些道理的。我们说同美相妒，有没有可能同美不相妒忌，不可能的。同艺相窥，有没有可能做同样事情的人，不会暗中察看，不可能的。只要是做同样的事情的人，一定会被人暗中察看。</span></p><p><span><strong> </strong></span></p><p><span><strong>同利相忌，</strong>只要有共同的利益，一定会互相猜忌，忌惮和忌讳的。这就是《素书》所告诉给我们，自然而然的道理，不可违背，一定会出现的。</span></p><p><span></span></p><p><span>整个这一段话，所阐述的道理，看似简单，但是在应用的时候，却可以千变万化。举个例子，同美相妒，同样有美貌的人，做相同事情的人，一定会相互妒忌。我们用的时候怎么用，首先我们如果处上位，要去避免相同美丽的人做同一件事情，或同一种职位出现，就会避免相互妒忌。</span></p><p><span></span></p><p><span>那如果反着用，两个同样画画的人，如果我们和其中一个人讲，另外一个人的画，比他画得好，就开始心生妒忌了，有的人的妒忌会很明显，有的人的妒忌或许不明显，但是心中一定是不服气的。</span></p><p><span></span></p><p><span>所以我们看宫斗剧，都是这样产生的，都是我们告诉其中某一方，对方所做的事情和他差不多的，甚至有人会觉得比他更好，这就是挑拨离间。</span></p><p><span></span></p><p><span>真正理解《素书》所讲的内容，用起来是千变万化的。同爱相求怎么用？比如，我们要想和一个人，有更多交流和探讨的机会，和他有同样的爱好就可以了。</span></p><p><span></span></p><p><span>比如，我们喜欢一个人，想要去追求一个人，怎么办？去找和他同样的爱好，就有机会交流和探讨。比如，想让孩子和我们有更多的共同语言，怎么办？</span><span>孩子爱好什么事情，我们也去爱好，这个时候自然相求，互相就会探求交流和分享，就达到了某种共鸣。我们经常讲投其所好，就是这个道理。</span></p><p><span></span></p><p><span>《素书》所告诉给我们的内容，在应用的时候可以千变万化，正着用，反着用，都可以的，这就是奇妙之处。</span></p><p></p></div>"
},{
    "title": "《素书》第三十六讲 正己化人顺",
    "author": "虚空先生",
    "date": "2022-07-27",
    "html": "<div class=\"B1_text\"><p><span><strong>《素书》第三十六讲 正己化人顺</strong></span></p><p><span><strong></strong><strong/></span></p><p><span><strong>释己而教人者逆，</strong>释放自己，不去修正己身，而去教育他人，或者要求他人，这种行为，所得到的结果一定是逆的，有人不服从，不服气，不跟随。圣贤的文化都告诉我们，要先修正己身，只有先要求自己，先去修正自己，这个时候再去影响他人，教育他人，教化他人，感化他人，别人才会是顺从的状态，否则一定是逆的状恋。</span></p><p><span><strong></strong></span></p><p><span><strong>正己而化人者顺，</strong>我们说了释己，而教人者一定是逆的。正己而化人者顺，我们先去修正自己，再去感化，教化他人，所得到的结果就是顺的。顺就代表着事情会变得通顺，变得顺畅，顺也会让事情更长久。我们再来看这两句话，给我们讲的道理，放在任何事情上都通用。</span></p><p><span></span></p><p><span>举个例子，管理团队，管理员工，我们懂得修正自己，再去教化他人，感化他人，顺理成章，而且别人也很容易就顺从。因为我们不光言传，还在身教，我们不停地在修己，这个事情就会变得长久。</span></p><p><span></span></p><p><span>可是如果我们做反了，没有去修正自己，而只是要求他人，别人一定是逆的，不顺从，理也不顺，章也不成，做事情自然就是短暂的，终究会破灭。</span></p><p><span></span></p><p><span>我们在家庭当中，教育孩子也是同样的道理，如果作为家长的我们，不能去修正己身，不能给孩子带来好的影响，而一味地只是要求孩子，去教化孩子，他根本就不听从。</span></p><p><span></span></p><p><span>我们在夫妻感情当中也是一样的，我们如果不懂得去修正自己，而只是一味地指责，教化要求他人，时间长了以后他一定是逆反的，一定是不听从的，终究是要破灭的。</span></p><p><span></span></p><p><span>我们和朋友相交也是同样的道理，如果我们自己不懂得修正自身，而只是一味地要求朋友去付出，要求他人去做什么事情，久而久之必产生逆反的心理，不顺从一旦开始出现逆，结果自然就是不好的。</span></p><p><span></span></p><p><span>我们在学习的过程当中也是一样的，我们经常用一个词叫为人师表，是要给别人做表率的，如果我们自己讲的是一种样子，而实际的行为是另外一种样子，这个时候别人一定是逆的，不顺从，不顺从我们的事情，很难进行下去，并且结果必然是不长久的。</span></p><p><span></span></p><p><span>有的人从小家庭教育会比较好，会告诉我们去学圣贤的文化，接受的教育就是要修行自己，不断地去学习，让自己变得更优秀。而很多朋友没有接触过圣贤的文化，也没有接触过修行，不知道是该修正自己的。</span></p><p><span></span></p><p><span>这一生可能都活在抱怨，指责和怨恨当中，不停地去要求他人，不停地去指责他人，不停地去想要得到的更多，一生都在不停地向外追求，会产生大量的痛苦和负能量。</span></p><p><span></span></p><p><span>我们有幸接触到圣贤文化的朋友，有幸接触到修行的人，才知道原来是要正己，才能化人的。原来是要先明德后亲民，原来是要先自觉再觉他。</span></p><p><span>所有的文化都告诉我们，以修身为本。</span></p><p><span></span></p><p><span>《素书》告诉我们道、德、仁、义、礼，五者一体也， 欲为人之本，不可无一焉，我们想要立身之本，不可缺少修身，是我们自己内在源源不断的动力和能量来源。</span></p><p><span></span></p><p><span>《大学》告诉我们:“自天子以至于庶人，壹是皆以修身为本。”告诉我们无论是天子，还是百姓，都要先修己身的，我们再去影响和教化他人，或者说我们再去做事情，顺风顺水，因为我们的言行都可以去做表率。</span></p><p><span></span></p><p><span>我们是持身中正的，我们是先修己，再化人，再去做事情，结果自然就是顺畅的，亦是长久的。</span><span>如果我们没有学习圣贤文化，没有懂得修身之道，可能我们还要不停地向外求，要求员工变得更好，要求伴侣变得更好，要求朋友变得更好，要求父母变得更好，要求孩子变得更好，要求我们的客户变得更好，要求这个世界要温柔地对待，我们就会不停地向外贪求，求而不得就会产生更多的痛苦，产生更多的怨恨。</span></p><p><span></span></p><p><span>可是我们学习了文化，我们懂得修行，就要先正己，我们自己内在的美好，都是不停地修行自己所创建的美好，让我们的心性变得更光明，让我们有道、有德、有仁、有义、有礼，这个时候我们就看到世界的美好，在用自己修身所得到的道、德、仁、义、礼，所得到的良善，所得到的美好，去影响和感化他人，再去做事情，自然就会变得顺水。</span></p><p><span><strong></strong></span></p><p><span><strong>逆者难从，顺者易行，</strong>如果我们是逆的，别人很难跟从，而如果我们是顺的，做事情很容易成功，很容易成事，所以叫顺者易行。</span><span>我们去体会生活当中的事情，尤其是我们学习了一段圣贤文化的人，修行了一段时间的人，我们再去思考，做事情有没有变得很顺畅。</span></p><p><span></span></p><p><span>我们讲话，别人有没有变得更容易接受，是因为先修己身，别人看到，我们是如此讲话的，讲话是这样的道理，可是他会继续去观察，我们平时的行为是不是这样做的，有没有付出，有没有像自己讲的一样，更多的包容，更多的仁爱之心，做了更多善良的事情，有没有处处为他人着想。</span></p><p><span></span></p><p><span>如果自己的行为是有的，做任何事情都很容易行，很容易成功，很顺遂，也很多人愿意去跟随于我们，因为我们的言行是一致的，是先正己再化人。而不是没有修正自己，一味地要求他人，向外驰求，这个时候别人就是很难跟从的，逆者难从。</span></p><p><span><strong></strong></span></p><p><span><strong>难从则乱，易行则理。</strong>如果大家都是很难跟从的，做事情必然是越来越乱，因为大家的言行都不一致，我们是这样讲的，那样做的，别人不愿意跟随，因为他是逆的，即使是跟随也是心口不一，呈现出来的都是乱象，每个人的言行，都是不一致的，说成什么样子，做的又是另外一个样子。</span></p><p><span></span></p><p><span>如果我们一个团队都是这样的风气，肯定是乱的，做事情也必不长久。如果我们在一个家庭当中，形成了这样的风气，每个人讲一样，做一样，每个人的心口都是不一的，表面上说着和谐的话，背地里去做着不和谐的事情，结果可想而知，必然是乱的。</span></p><p><span></span></p><p><span>我们和朋友相处也是一样的，如果我们讲的话和我们的行为有偏差或者偏差过大，这个时候朋友就开始很难跟从，不相信我们讲的话，结果可想而知，必然也是乱的。</span></p><p><span></span></p><p><span>易行则理，如果我们做的事情，都是懂得先正己再化人，说到哪里做到哪里，我们可以给别人好的影响，可以做人之表率，别人就很容易跟随，我们做事情也很容易成，我们讲的话，也很容易让人信服，结果就是理。</span></p><p><span></span></p><p><span>理就是治理的意思，所以这里用的理非常妙，为什么不用治？如果用治，就有治好和治不好，治身，治家，治国。治有可能把自己的家庭治理好，也有可能治理不好。</span></p><p><span></span></p><p><span>可是理不一样，理是结果，是一定是好的结果，是顺理成章的，我们称为理。所以我们做很多事情都很容易行，别人都是在顺从的，在顺承的，做事情都是顺应的，我们讲话也是顺应的，这个时候自然所得到的结果，就是理。</span></p><p><span><strong></strong></span></p><p><span><strong>如此理身，理家，理国，可也。</strong>像如此这般我们就可以理身了，就可以治理好自己的行为，治理好自己的身心。理家可以治理好自己的家庭，治理好自己的团队，治理好自己的企业。理国同样的道理，可也。这个时候我们就可以做到理身、理家、理国。</span></p><p><span></span></p><p><span>我们总结整个《素书》，首尾呼应，开篇讲:“夫道、德、仁、义、礼，五者一体也。”结尾是：“如此理身、理家、理国可也。”一个是内修，一个是外用。</span></p><p><span></span></p><p><span>开篇告诉我们，道、德、仁、义、礼，五者一体，欲为人之本，不可无一焉，这个是内修。我们想要立人的根本，立身的根本，缺一不可。外用如此可以理身、理家、理国。</span></p><p><span></span></p><p><span>开篇讲《素书》的时候说过，黄石公老人家写这本书，告诉给张良，让他去齐家、治国、平天下，去做更多的事情，救人民于水火之中，可是又千叮万嘱，不可以传给不修身之人，不可以传给不神不圣之人。</span></p><p><span></span></p><p><span>因为我们如果不懂得修身，一旦用反就会产生逆的，所以告诉我们，释己而教人者逆，如果我们没有去修身，而只是要求他人，我们没有内修而只是去外用，这个时候得到的结果是逆的，不但损人并且害己，一定会把自己害掉的。</span></p><p><span></span></p><p><span>只有我们懂得修身，作为一个有道德有修养的人，才能更好地去使用《素书》，《素书》每一句话，每一个字都值得我们去深思，甚至我们可以去把它背诵下来。当我们有了修身为本，并且能把《素书》熟记于心，会发现他变化无穷，妙用无穷。</span></p><p><span></span></p><p><span>比如，当我们把《素书》熟记于心，遇到事情的时候，就可以从《素书》当中找到规律。</span><span>比如，团队当中有人起了怨恨，我们就要明白足寒伤心，人怨伤国。</span></p><p><span></span></p><p><span>当我们做事情抓不到重点，就可以想到《素书》当中讲，衣不举领者倒，走不视地者颠，这个时候就开始提醒我们，做事情不光要抓住重点，还要时时观察，当下所发生的变化。</span></p><p><span></span></p><p><span>当我们做事情出现隐患之时，就可以想到，患在不豫定谋。当夫妻争吵出现抱怨，我们就要想到，怨在不舍小过，是因为我们揪住对方的小的过错不放，长久必生怨恨，这个时候就懂得及时停止。</span></p><p><span></span></p><p><span>当我们想让身边有更多懂得奉献和担当之人，就可以想到，同义相亲。当我们做事情想要找到志同道合的人，我们就要想到，同志相得，同仁相忧。</span></p><p><span></span></p><p><span>当我们跟孩子跟身边的朋友和同事，没有更多的共同语言，而我们又想要去交流，想要教育好孩子，还想交这类型的朋友，那我们就要想到同爱相求，如何才能更好的探讨和交流？我们和他保持同样的爱好，就可以互相探求，就可以变得有共鸣。</span></p><p><span></span></p><p><span>当我们观察生活当中，发现有一些事情开始变得异常，做的事情和行为，开始让别人产生妒忌之心，这个时候是有危害的，我们就要想到，同美相妒，是不是我做的事情和对方有哪里是一样的，是不是损害了他人的利益，故而让他产生妒忌之心，及早发现，尽早避免。</span></p><p><span></span></p><p><span>当我们带领团队的过程当中，明白了同美相妒，也可以避免更多事情的发生，避免让同样性格的人，同样性情和能力的人，做同样的事情，以免相互妒忌而产生烦恼和隐患。</span></p><p><span></span></p><p><span>我们想到《素书》当中，同艺相窥，就要懂得持身中正，因为有更多的内行之人，在看我们的行为，如果我们出现有偏差，有遗漏一定会被人抓到把柄，因为同行业的人，更容易看清楚我们在做什么，都是在暗中察看，这个时候我们就要懂得警醒自己。</span></p><p><span></span></p><p><span>当我们把《素书》熟记于心，字字珠玑，妙用无穷，可以在生活当中千变万化。《素书》我们讲到这里，就讲完了，剩下的部分就是我们在生活当中，不停地去练习，不停地去应用，《素书》所教给我们的道理和智慧。</span></p></div>"
}]