[
  {
    "title": "《道德经》道中体会高贵(免费试看)",
    "date": "2025-08-12",
    "html": "<div class=\"B1_text\"><div><p><strong><span>道中体会高贵</span></strong></p><p><span>我们让自己先安静下来，首先是我们的身体，让自己的身体保持不动，即使动，也要缓慢地动。那我们来体会，为什么要不动或者少动呢？什么道理？“<span>道</span>”最初始的状态是“无<span><span>”</span></span>，然后道生一，一生二，二生三，三生万物。越动，后面产生的就会越多，就变成了万物了。所以，我们<span>每天</span>之所以有无数的烦恼，可能是从最开始的一个想法，一个念头上来的，它会生生不息。举例，说我们现在有一个想法，想到了一件不开心的事情，会不会越想越多呀？最后头昏脑胀了。说我们坐在这里，又产生一个想法，那课程结束，我回家要去做点什么呢？我回去要吃顿好的，那吃什么好呢？进而又想了很多，最后发现，徒增烦恼。因为我们平时动得太多了。身体动得也多，想法动得也多，眼睛动得也多，我嘴巴说得也多，是不是就会产生了诸多的事情啊？因为我们总是认为“<span>多</span>”才是好的，所以多买几件衣服吧，多说几句话吧，进而就多争论了，很多的是非对错，遇事情总喜欢多思、多想一点，所以每样都多一点，最后发现衍生出来无数个想法，无数个事件，无数个烦恼。我们学《道德经》，是反其道而行之，让我们自己少一点。我们减少想法，减少言语，减少动作，把所有的东西不停地去减少，这个时候我们会感受到不一样的美妙，<span>一种我们过去的人生没有感受过的平静和美妙的状态。</span>人这一生，我们要懂得去体悟人生，去感受不同的状态。比如我们这三天，跟线上不太一样，线上是学知识，明道理，但线下呢，是去感受，我们把感受到的东西融入到自己的人生当中，这才是最重要的。比如有的人说“某一刻我感受到了平静”，那这个人就多了一丝平静；“某一刻我感受到了一种松弛”，这种松弛就融入了这个人当中；“某一刻我感受到了喜悦”，那这个人就多了一份喜悦。说我坐在这里看着台上，或者有的同学可以看到台下，看到这么多人坐在一起，我突然看到了一种宽广、辽阔，那我就多了一丝辽阔。不光是这三天如此，其实整个人生皆是如此。我们遇到什么样的人，经历了什么样的事情，都会产生感受，都会有体验，都会有体悟，而<span>我们</span>真正感受到的东西，它会融入到我们这个人当中来，久而久之融入的多了，我们就开始发生变化了。就像一杯白水融入了蓝色，我们就变成了蓝色。我们从《道德经》也好，从人生也好，可以融入很多东西，可以有很多体验，把这些体验变成我的一部分。那我们这三天坐在这里，一点一点地去感受，去体验。当内心保持清净的状态，<span>我们</span>看到的世界是缓慢而平和的。当内心急躁，<span>我们</span>看到的世界是波涛汹涌的。人有不同的心境，会生活在不同的世界。我们看世界的样子，实则是取决于我们的心。《道德经》有一个思维叫“<span>天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗</span>”，天地和圣人看万物是平等的，没有区别的。这个时候我们注意啦，有人说：不对呀，万物怎么会是平等的呢？比方说，我看到这个人身高一米八呀，另外那个人身高一米六啊，那么请问，那一米八和一米六，也是平等的吗？为什么是平等的？因为在天地看来，一米六和一米八有没有区别。注意啊！哪里没有区别？不是他们两个实际没有区别，而是在我们的眼中和心中没有区别。所以平等的是谁？是我们的心哦，是我们的思维方式。再举例，说我看到这个人很有钱，看到另外一个人生活比较贫瘠，在我眼中，其实他们两个是平等的。有人说：不对呀，一个有钱一个没钱，怎么会是平等的呢？在哪里是平等的？在我们的认知当中，在我们的思维意识当中。他们两个有没有什么不平等的地方？其实是一样的。那个有钱的人，他可能付出的更多一点，他身上具备了什么样的才能或者出生在一个好的家庭，所以他现在的条件过得比较好。那另外一个人他可能没有那么努力，身上没有那么多的才华，也没有出生在什么好的家庭，所以其实他们两个的本质其实是一样的哟，没有什么区别。我们看，实则有区别的是什么？是人的心，人的认知。当我们的心和认知上没有什么差别，那么我们看世间万物都是一样的，平等的。我们来体会一下，当人有这种感受的时候，是什么状态？我不觉得自己比别人高，我也不觉得自己比别人低，不卑不亢。遇到比我好的人，不需要高看他一眼；遇到不如我的人，也不会低看他一眼。没有任何的情绪变化，不会傲慢，也不会自卑。人为什么会有那么多烦恼？看到比我好的人，自卑了；看到不如我的人，傲慢心又生起了；看到人家长得好看，我没自信了。其实跟我们有没有关系？没有关系，但影响了我们的心呐。看到一个不如我的人，就觉得自己高高在上了，哪里出了问题？我的心出了问题，认知出了问题。<span>我们知道两个字，叫“<span>高贵</span>”，</span>高贵从哪里来啊？有人说高贵，不是因为我拥有很多才高贵吗？不是的，那是外在的、最表面的，真正的高贵，从我们的内心来。所以我们看自古以来修道的人，或者说很多书生，饱读诗书的人，身上有没有一种高贵的气质在？有。他不需要通过外在的任何东西，本身就是高贵的。那我们这个时候来看自己，每个人都是高贵的。我们不需要通过外在的任何东西来证明自己的高贵，需要证明的都不是高贵的。比如说我们现在，此时此刻的所有人，我们坐在这里的这一刻，就是高贵的。我不需要通过任何装饰，不需要通过语言，不需要通过我的家世，也不需要通过我的工作，我本然就是高贵的。当我们有这种状态和心理的时候，有没有发现自己很平静啊？没有什么自卑的想法，也没有什么傲慢的想法；没有看得起谁，也没有看不起谁，就是这样淡然处之，看待世间万物。不光我是高贵的，我看到每一个人也是高贵的。我看到那棵树，它也是高贵的；我看到了一只猫，它也是高贵的；我走在街上，看到一个清扫大街的人，他也是高贵的；我看到了一个开出租车的人，他也是高贵的；路上遇见了一个做生意的人，他也是高贵的，我们生而平等。所以，当我们的心上、认知上，看一切是平等的，这个时候我们的内心有没有变得博大而宽广啊？有没有变得平和而自在啊？人之所以不宽广、不平和，因为不停地在分别。这个人他比我强，我有点<span>自卑</span>；那个人不如我，我还挺好的…… 我们就没有办法保持平和，因为总是被外界的人和事所影响。听到他唱歌唱得挺好，我有点坐不住了；我看到那个人的家里很有钱，突然有点自卑感；我看那个人唱歌还跑调呢，我又来自信了。你发现自己一点也不高贵，活得没有了自我，总是在看环境，看他人，被他人所影响，而迷失了自我。所以每个人都是高贵的，不需要任何东西证明我的高贵。我用这种高贵的心态，高贵的认知，看世间万物，无一不是高贵的，无<span>一</span>不是平等的，没有任何差别。当我们没有任何差别地看待世间万物，我们的心态自然是平静的，自然就是平和的，看什么都一样。既然是一样的，我们的心不动，我们的认知不动，那所有的东西是不是不动的状态啊？当我们懂得不动的时候，自然就回到了道当中来。所以，看似我们坐在一起，其实每个人的认知都不同，生活的世界也就不同。那我们学习道，用道的认知、用道的思维来看世界。我们过去用什么在看世界？用人的思维，用人的情绪，用人的分别心，用人的喜怒哀乐，用人的欲望，用这些在看世界呀。所以看到的世界和用道看到的世界，全然不同。我们从此刻开始，要先放下什么？放下我过去的认知，放下我的喜怒哀乐，放下我过去固有的东西，然后学习道，看看道在讲什么，道的思维方式是什么样子的，圣人用什么样的认知在理解这个世界、在观察这个世界。我们要学的，就是这种道的思维。那我们来回顾一下这段话，首先告诉我们的身心要保持安静，要不动或少动，即使动也是缓慢地在动。进而我们又讲到了，如何才可以保持清净啊？我们要懂得“<span>天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗</span>”，我们要有一颗平等的心去看待万物。什么叫平等啊？从高贵说起，每个人都是高贵的。首先我们要去感受到自己的这种高贵，然后用这种高贵再去看世间万物，我们的心胸是博大的，认知是宽广的，我们再看外面的世界，就不为所动了，看到什么都淡然处之，这个时候，我们就回到了平静的状态。为什么要平静啊？因为道从无到有，再到万物，要是我们不能归于平静，每天的想法很多、分别很多，被外面的世界影响得很多，最后就背离了道了。</span></p></div></div>"
  },
  {
    "title": "《道德经》遵循不同的道(免费试看)",
    "date": "2025-08-12",
    "html": "<div class=\"B1_text\"><div><p><strong><span>遵循不同的道</span></strong><span>人，会不停地去分别，不停地去跟他人做对比，不停地因为外界的环境和人产生想法，产生念头，进而产生行为，最后生生不息，烦恼就没有断过。</span></p><p><span>比方说孩子的学习不如人家的孩子好，我们就认为这个孩子可怎么办呀，学习这么差。这个时候我们的想法就产生了区别，进而就会不停地去焦虑，担忧孩子的未来，甚至不甘心，觉得委屈。凭什么呀，我为孩子付出了这么多，这几年什么都没干，天天陪着他，可是他的学习这么差，将来可怎么办。这一个想法进而就产生了无数个想法。</span></p><p><span>怎么孩子学习不好，就影响他本然的高贵吗？他学习不好，难道就影响了未来他的生活的样子吗？我们每天就是这样，一件小事情就可以产生无数个想法。</span></p><p><span>进而又想了，孩子的爸爸什么都不管，从来没教育过孩子，我怎么嫁给一个这样的人呢？从孩子的学习不好又想到哪里去了？我当初瞎了眼。因为孩子学习不好，最后开始自怨自怜，甚至埋怨身边的每一个人。我们的想法有一个动作，后面就会产生什么？万物啊，就变得越来越多。</span></p><p><span>这只是一件事情，我们每天要发生的事情是不是无数件啊。我们的心，我们的认知，总是动来动去的，一动就产生了万物，最后我们被万物所淹没。</span></p><p><span>《道德经》当中总会讲到这个“贵”，说古之所以贵此者何也，以为天下贵。什么样的思维叫贵呀？我们有讲过“玄同”，当我们有了玄同的思维，“不可得而亲，亦不可得而疏；不可得而贵，亦不可得而贱；不可得而利，亦不可得而害，故为天下贵”，所以什么样的思维叫贵？玄同。</span></p><p><span>什么叫玄同啊？看万物都是平等的。当我们看万物是没有差别，是平等的，故为天下贵。所以我们用高贵的思维和认知来看待自己。我家里一无所有，但是不影响我坐在这里是高贵的；工作当中，我没有领导赚得多，我也没有领导的能力强，但是不影响我是高贵的，我是超凡脱俗的；我遇到一个人，我没有人家有文化，但是不影响我灵魂的高贵；我没有那个人开的车子好，但是不影响我高贵的品质。</span></p><p><span>这是一个人本然就有的东西，天然存在的东西，但是当我们用充满分别和欲望的眼光去看呢？把自己的高贵就丢掉了呀。</span></p><p><span>我们说一个人身上有一种贵气，这种贵气有的人说：那不是因为他有钱吗？其实不是的。有人说：那不是因为他能力强吗？不是，有钱和能力强带来的不叫贵气，叫什么？叫傲慢之气，不是那个东西。</span></p><p><span>其实一个人的高贵，不需要倚仗任何东西，就是我们可以从内在自然生起的。就像刚才这段话，如果我们听得进去，坐在这里的时候，感受到了这种高贵，那它就是我们的。</span></p><p><span>为什么这一段我们要讲这么长时间？想要告诉给大家什么？这就是道啊，道是平等的，看万物是没有差别的，所以他才贵。</span></p><p><span>我们之所以不贵，就是因为不停地在干嘛？在分别呀，我这里不如他，他那里比我强。我们整个人的状态没有办法平静，我们不停地在对这个世界、对自我在分别，所以就产生了烦恼。</span></p><p><span>像昨天那位做老师的大姐，为什么有那么多烦恼啊？不停地去分别啊。“他认知不如我，他说那东西不对，我说这个东西应该做汤，他非要包饺子，他认知不行”，我们不停地去分别这个世界，总认为自己是对的，别人是错的。或者有人认为我都是错的，别人都是对的，烦恼就来了。</span></p><p><span>所以世间万物，生而高贵，本然就平等，没有任何差别。有人说：不对，有差别。有差别的是现象。</span></p><p><span>举例，说我们在看一场演出，前排的价格可能更贵一点，后排的价格就相对便宜一点。假设此刻我坐在后排，我没有觉得有什么问题呀。</span><span>坐在前排看演出的人，人家花的钱怎么样？更多一点，所以他就坐前排啊；我不需要花那么多钱，我坐后排，我可以纵观全场，是不是也挺好的呀。所以我不认为我跟他之间有什么差别啊，这个时候我们的心态是不是平衡的状态，是不是清净的状态啊。</span></p><p><span>可是如果反过来呢，凭什么他坐前排，不就是多花两个钱嘛，有什么了不起的。他坐在那晃来晃去的，就这样的人怎么可能有钱呢，老天真是不长眼……有没有发现，我们演出有没有看得进去啊？没有啊，一直坐那儿品头论足，是不是心态不平和呀。</span></p><p><span>注意啊，我们举的例子是不是一个缩影啊？别的事情，如果我们总用这种分别的思维，是不是自己没有办法获得平静啊？我们会不停地去指指点点：这个人说话还挺好听，那个人说话说不明白；这个人挺招人喜欢，那个人真令人讨厌；这个孩子挺好，那个孩子调皮捣蛋；这个孩子的父母不怎么样，那个孩子的父母很有修养……</span></p><p><span>我们不停地去分别，每天的心都用来干嘛了？是不是用来评判、用来分别呀。这个时候，谁的烦恼多呀？是不是自己的烦恼很多呀。</span></p><p><span>当我们不停地去评判这些东西的时候，注意，我们还贵吗？所以“不分别，看待万物平等”这个很重要啊，这是一种高贵的思维方式，它是道啊，是“天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗”，我看什么都一样。</span></p><p><span>这种思维，让我们的内心可以保持平和，可以接纳，可以包容世间万物，我们就是很安静地坐在这里，很安静地立于天地之间，很平静地看待世间万物，什么都一样。</span></p><p><span>我们在生活当中，可以来体会一下。比如说走到哪一站，通常大家都会问我，比如说来到天津，嬛嬛她们就会问：老师您看，哪里有没有什么问题呀？有没有做得不好的地方啊？通常我会说：都挺好啊。</span></p><p><span>我不是到天津这么说的，上一站成都也是这么说的，再上一站重庆也是这么说的。就是看什么都很好，只不过好与好不同，是不是这样的。</span></p><p><span>可能天津的好，他们把很多事情想得更周全，做得更有氛围；那可能别的地方的好是更简洁；有的地方的好可能是更热情，是不是都是好啊。</span></p><p><span>那我们用这个思维再看身边的人呢？说这个人的好，是因为他能力很强啊；那个人的好，是因为他做事很细心啊；另外那个人的好，是因为他很踏实啊，是不是都是好啊。</span></p><p><span>所以当我们看一切都很好，都挺好，都不错，这个时候我们内心会生起什么？是不是幸福感就来了呀。</span></p><p><span>反之呢，如果我们看什么都不好，能不能幸福啊？这一站准备得不充足啊；上一站总有很多遗漏的事情；这孩子学习还可以，但是平时真的不自律；我爱人赚钱倒还行，但他不顾家呀；我这个倒是顾家，可是他不赚钱……如果我们看到的都是不好，最后就活在了不好当中了。</span></p><p><span>人生活在这个世界，要学会心存美好。注意，不是世界美好，是我们心存美好，我们才能看到世界的美好，然后这种美好又怎么样？返回来了，滋养我们的心。</span></p><p><span>所以不要被世界所迷惑，不要被外面的世界所障碍。我们生活在什么样的世界，决定权在我们自己，在我们自己的心境，在我们自己的认知。</span></p><p><span>我们这三天是来改变什么的呀？改变我们的心境，改变我们的思维方式。不是来改变世界的，也不是来改变身边人的。</span></p><p><span>很多人学习的出发点是不是就错了呀？有的人非要把自己的爱人带过来一起学习，心里默默地在干嘛？“希望他变，希望他变；希望他能听懂，希望他能听懂”，所以在听课的时候，一直在干嘛？就观：他这句话听没听进去？老师这句话明显是说他的嘛。最后，自己一无所获呀。</span></p><p><span>所以我们不是要改变世界，要来改变自己的内心，改变自己的认知，改变我们的道。我们有什么样的道，就会产生相应的结果。所以我们从来不是期盼一件事情的结果，而是干嘛？遵循什么样的道。遵循了不同的道，就会产生不同的结果，选择问题而已。</span></p></div></div>"
  },
  {
    "title": "《道德经》第一章 道在内名在外",
    "date": "2025-08-12",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第一章 道在内名在外</span></strong></p><p><strong><span>道，可道也，非恒道也。名，可名也，非恒名也。</span></strong></p><p><span>我们保持身心放松、自在的状态进入原文，《道德经》的第一句话告诉我们：<strong><span>道，可道也，非恒道也。名，可名也，非恒名也。</span></strong>说“<span>道，可道</span>”，注意了，但凡是可以道的道，已经不是那个恒长不变的道了。那就是一切怎么样？都在变化之中。以此类推，世间万物，一切都在变化之中。比方说在感情当中，我们懂得付出，就可以收获爱情的果实。这句话是不是道？是。它是不是恒道？<span>不是。</span>付出就一定会有收获吗？不一定。举例，说努力工作，就可以获得好的工作成果，这句话是不是道？但是它是恒道吗？不是，有的时候越努力反而结果越差。那“<span>一分耕耘，一<span>分</span>收获</span>”是不是道？是不是恒道？不一定哦。那我们就知道了，其实世间万物，当它产生的那一刻，就已然发生变化了。比如说讲话，当我们话讲出口的那一刻，已然发生变化了。想一想是不是这个道理，所以叫“<span>出口即错</span>”。无论说什么，说出来就错了。举个例子，我们描绘一个场景，大家感受啊。假设我们是老板，现在开了一家店铺，中午跟几个员工正在吃饭，这个时候有顾客进来了，作为老板的我们就要说话啦，“<span>小张，你先去服务一下顾客</span>”，这句话我们说出来了有没有错？错在哪了？真没人性啊，正吃饭呢，让小张服务顾客。注意啊，我们让他去服务顾客，有没有问题？没有问题，但不能说。那不能说怎么办呢？如果他自己去了，就没问题了。来个顾客，小张放下碗去服务顾客了。我们心里想：这孩子不错呀。他自己去了我们没说，有没有问题？没问题，但是我们一说，就有问题了。生活当中很多事情是不是如此，再来一个场景，<span>比</span><span>方</span>说我们跟爱人正在家里，说我有点感冒了，跟爱人说：这太难受了，感冒不舒服。爱人说：“难受我有什么办法呀，我又不是医生，难受你去医院呐。<span>”</span>话正不正确？正确，但是他说出来就错了。说出来我们就觉得：“我这是找了一个什么人，他说他不是大夫。<span>”</span>他确实不是大夫，但不能说，一说就错了。所以有没有发现，两个人生气的时候就这样，话不能说，一说就错，不说还好。这个道理非常有意思，告诉我们：道，可道也，但是非恒道也。天下的道都可以说，但只要说出来的道，他就已然产生变化了，就不是恒常不变的道了。注意啊，人为什么会那么多痛苦啊？我们总在执着一个什么？不变。“<span>你上个月不是答应我了吗？</span>”我们也知道那是上个月；“<span>你去年怎么说的？</span>”那都是去年的事情了。他去年那么说，因为他去年是那么想的，但时至今日，有可能他的想法变了，有可能是环境变了，有可能是客观变了，也有可能是我们变了呀。所以那个“<span>道</span>”，是不是有变化呀。再举例，有人说，教育孩子得多鼓励他，是不是道？那这句话是恒常不变的道吗？不是。孩子能一直鼓励他吗？不能。有的孩子适合鼓励，有的孩子不适合鼓励。所以首先我们要清楚，世间所有的东西都是在变化之中，有变化才是正常的状态。人要懂得接纳变化，并且还要去拥抱变化，还要懂得变化。因为一个事物的变化，会引发无数个事情的变化。当我们生活在痛苦当中的时候，说明什么？我们要主动地干嘛？要主动地去引领变化了呀。比方说，有的母亲会讲：“<span>孩子不听我的呀。<span>”</span></span>那这位母亲就得去看她的过去，如果一直管个不停，一直唠叨个不停，他就会不听。说明怎么样，要干嘛了？<span>这位母亲</span>要做出改变了，要做出变化了。因为原来的方式行不通了，这个时候再用过去的方式是不能改变现状的，需要做出变化才行。<span>这位母亲可能</span>说：“<span>那我过去对孩子也是这么管的呀，他过去很听话呀。</span>”我们看“<span>道，可道也，非恒道也</span>”，就是这个方法在过去它可能符合道，因为孩子还没长大，那现在孩子长大了，那个“<span>道</span>”是不是也变化了呀。再比如说，这两年的生意做不下去了。有的人说：“<span>可是我前些年的生意很好呀，我做生意很有自己的一套呀。</span>”过去的那一套在那个阶段它是符合道的，但是现在怎么样？外面的环境、市场、人的消费能力、消费的人群都变化了，但是你的道没变，是不是就跟不上了呀。我们不能活在固有的、自己认为过去成功的那个道当中，因为昨天好用的道，到今天有可能不好用了。世间万物都在变化，这就是道啊。所以开篇的第一句告诉我们：道是可以道的，世间万物都有道，都有其规律。但是那个道和规律也不是恒常不变的道，他一直在干嘛？产生变化，所以我们要随着变化而变化。那第二句，“<span>名，可名也，非恒名也</span>”，不光是道，“<span>名</span>”，它可以名，但是它不是恒名。什么叫名？名字、名气、名声、名相等等。举例，这个杯子，它的名字会不会变呢？如果我们用它养花呢？变成花盆了；用它养鱼呢？就变鱼缸了；如果摔碎呢？玻璃碴子。它的功能变了，形态变了，它的名字就变了。我们用这只杯子观世间万物是不是皆如此，一个东西的功能变了，用途变了，形状变了，它的名会不会变？会变。比如说我们坐在这里，这三天叫它讲堂，因为在这里讲课。那过几天人家举办婚宴，就变成什么？婚宴厅，变成礼堂了。还是这间屋子，但是功能变了，用途变了，性质变了，它的名怎么样？就变了。一个人是不是如此，当形态变了，行为变了，用途变了，名有没有变？有变。当我们对别人是有贡献的、有付出的，别人怎么称呼我们？觉得我们是有德行的、有大爱的人，但是如果我们的行为都是伤害别人的呢？那这个时候我们的名字就变成什么了？缺德的人，坏人。同样是这个人，但是行为变了，作风变了，名字也在变。所以，世间的“<span>名</span>”是由哪里显现的？是由背后的道所显现的。我们呈现出来的名，是因为我们背后的道在变化，所以产生的名就发生变化了。举例，说张三现在做老板了，名就变成什么？张总；出去工作，名就变成什么？小张；出去跳广场舞，就变成老张了。我们的行为变了，思维方式变了，心变了，背后的道变了，我们呈现出来的名就产生了变化。所以，名是显现在外面的东西，内在的是道，以此类推，世间我们所有看到的、听到的，都叫名。<span>名，可名也，非恒名也</span>。这个名是可以名的，但是它不是恒常不变的名，因为道在变，名就在产生变化。举例，当我们跟一个人感情很好的时候，这个时候我们的名是什么呀？别人怎么称呼我们啊？宝宝。还怎么称呼？觉得我是一个好人，是一个值得托付的人，是一个脱离了低级趣味的人，名都是好的。人家就说：“<span>我这是积了几辈子的福啊，上辈子拯救了银河系，所以今生才能遇见你。</span>”所有的名都是好的，但是有一天，我们跟他的感情不好了，名有没有变呢？“<span>我上辈子造了什么孽呀，我究竟做了多少坏事，今生要这么惩罚我呀</span>”。我们看，道在变，名就在变。所以世间万物呈现出来的样子和现象，其实都是假象，都是名相啊，都不是真实的，我们千万不要掉在“<span>名</span>”当中，也就是现象当中，而是要回到道里。因为道一变，名就产生变化，所以叫名，可名也，非恒名也。</span></p></div></div>"
  },
  {
    "title": "《道德经》第一章 回到无观察有",
    "date": "2025-08-21",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第一章 回到无观察有</span></strong></p><p><strong><span>无名，万物之始也；有名，万物之母也。故恒无欲也，以观其妙；恒有欲也，以观其所徼。两者同出，异名同谓，玄之又玄，众妙之门。</span></strong></p><p><span><strong><span>无名，万物之始也；有名，万物之母也。</span></strong>把<span>名</span>又分成了<span>无名</span>和<span>有</span>名。什么叫无名？什么都没有，这就是最初始的状态。有名是万物之母，一旦有了名就变成什么？母，就可以生育万物。所以我们看一个事物从无到有，无就是还没开始，最初始的状态。到了<span>有</span>就变成了母，就会生育万物了。凡事都是无和有，有和无的转换。比如说我们现在坐在这里，没有任何想法，这是什么？是不是无的状态啊，注意啊，当我们开始有个想法，就变成母了。举例子，说我看旁边这个同学不太顺眼——头发也不好看，动来动去的，翻个书声音那么大。是不是有一个想法了？接下来会不会生起越来越多？“<span>下节课我可不坐这儿了，换个地方</span>”，顺着这个想法，会不会产生的想法越来越多呀，这就是母。所以如果我们知道这个道理，生活当中，当有事情发生，我们要学会干嘛？一旦我们<span>有</span>，就要回到<span>无</span>的状态。我一想到这个人看不太顺眼，就瞬间让自己回到<span>无</span>的状态，什么都没有，是不是及时地把它清零啊，及时地让一切回到<span>无</span>的状态。当我们回到<span>无</span>的状态，后面的一切是不是才不产生啊，这就是无的重要性。我们总有烦恼，是因为我们生活在<span>有</span>当中了。比如说有分别心、有傲慢之心、有自卑之心，但凡活在任何一个<span>有</span>当中，烦恼就来了。比方说今天坐在这里吃饭，一吃，这么难吃。为什么会难吃？因为心里有一个<span>好吃</span>，所以这个就变难吃了。再举例，说为什么会觉得他这样说是错的呀？因为我们有一个对的，所以他一说就错了。我们跟爱人吵架是不是这样的，为什么认为爱人说的都是错的？因为我们认为自己是对的，所以他就变成错的了。实则烦恼是从哪里来的？我们有一个<span>对</span>，有一个<span>好吃</span>，有一个标准，有一个准则，有我们认为的东西，一有，别人的就变成不好的了。所以，但凡是我们烦恼产生的地方，去对应就知道了。因为我们心里有一个<span>有</span>，这个时候烦恼就来了。举例，一个人当他接触的越来越多，见识越来越多，反而能得到的快乐就越少了。为什么？因为心里已经有太多东西了，而有的这些东西都变成了障碍。我们小时候吃东西，是不是吃什么都觉得好吃啊？我们觉得小的时候那个东西很好吃，我们现在回去再尝尝那个东西，还好不好吃？不好吃了。为什么？因为我们吃过更多东西了，经历过更多事情了，就是所谓的见过世面了，然后再回去吃，不好吃了。是不是那个东西变了？不是，而是我们心里已经有了太多东西了。所以，人越长大，越难获得快乐呀。因为小的时候一无所有，长大以后拥有的越来越多，烦恼也会变得越来越多。所以学道，要学会一个本领，就是回到无的状态。《道德经》反复讲：复归于婴儿，复归于朴，复归于无极，都是回到什么？没有的状态，这个状态就是初始的状态。而一旦有了名，也就变成万物之母。一旦有个母，后面就会生生不息。<strong><span>故恒无欲也，以观其妙。<strong>恒有欲也，以观其所徼。</strong></span></strong>所以得出结论了，什么状态是美妙的？恒无欲也。就是回到了<span>无</span>的状态，无欲的状态，无名的状态，这个时候才是美妙的状态。我们来体会，当一个人满脑子都是欲望的时候，他能不能获得快乐？不能。我们作为旁观者看到的不一样，举例，我们说闺蜜“<span>你看你工作也挺好，爱人对你也不错，你有房有车，还有什么不快乐的？</span>”她自己快不快乐？不快乐。为什么？因为她想要的更多，因为她一直生活在不满足的状态。我们觉得她身在福中不知福，但是她自己看不到，因为她的欲望太多了。我们来看自己，很多朋友说：“<span>我学了几年之后，变得越来越开心了，可以发现身边人的美好了。</span>”是生活变了吗？不是。是身边的人有变化了？也不是。那美好从哪来的？是因为要求变得越来越少了，对他们的苛责变得越来越少了，想要的东西变得越来越少了，所以这个时候很容易获得快乐了，这就是无欲啊。故，所以啊。<span>恒无欲也</span>，恒久地保持什么？无欲的状态，回到无名的状态。以观其妙，这个时候看什么都是美妙的状态。恒有欲也，以观其所徼。徼指的是边际、形状、特性，呈现出来的都叫徼。举例，这只杯子是无还是<span>有</span>啊？有。只要有，它就有什么？其所徼啊。它长成什么样子，什么样的材质，有什么样的功能，有什么样的用途，都是它的<span>有</span>所带来的。际：边际、样子、形状。这只杯子是<span>有</span>，我们这个人是不是<span>有</span>？说正在做一件事情，是不是一个<span>有</span>啊；看到了一处风景，是不是<span>有</span>啊。当我们面对<span>有</span>的时候，我们要做什么？要以观其所徼啊。当有了这只杯子，要不要观察这只杯子啊，为什么要观察它？因为观察它之后，是不是才可以更好地与它相处、更好地去用它呀。是要去改变它吗？不是，因为也改变不了它呀。注意，说我们现在生了这个孩子，他就从<span>无</span>变到了<span>有</span>啊，这个时候他已经有了，还能改变他吗？不能，所以我们要干嘛？要观察他的特性，观察他的样子，观察他的形状，观察他的性格特点，观察他的优点和缺点，才能更好地教育他、跟他相处呀。比如说有了一个爱人是不是如此，当我们有了一个爱人，能不能改变他？改变不了。那<span>有</span>了以后怎么办？要观察他呀，他是什么样的性格特点呢，他的为人处事是什么样子的，观察他，是不是可以更好地跟他去相处啊，这就是<span>“有</span><span>”</span>啊。这句话有两个意思，第一个，我们面对世间万物的<span>有</span>，我们要观察什么？它的特性、形状、样子和边际。注意，再换个思维。<span>恒有欲也，以观其所徼</span>，当我们有欲的时候，实则就有了限制，就有了形状，就有了边际。当我们是无欲的状态，它是美妙的，并且是无穷无尽、无边无际的状态。一旦开始有欲，就有了限制，就有了束缚，就开始被困住了，就有了边际了。我们对什么有欲望，就被什么困住；对什么有欲望，就被什么所限制啊。有的人说：“<span>我也想出去旅个行啊，可是我放不下孩子。</span>”孩子就是你的欲望，也是你的边际，你就走不出那个房间，就离不开那个家，最大的圈，你离不开生活的城市。实则是谁困住了你？你的有欲困住了你。有人说：“<span>我这开店开了十年了，我也想出去走一走，可是我出不去啊。</span>”谁困住了你？看似是店铺困住了你，实则是什么？是你的欲望。因为有欲，所以就有了限制，就有了边际，就被困在那个地方了。那么我们就知道了，人的欲望越多，被困住的就越多。所以欲望越多的人，寸步难行啊，走不出来哟。我们再回到这两句话：<span>故恒无欲也，以观其妙；恒有欲也，以观其所徼。</span>无欲的时候是美妙的，有欲的时候就有了限制。<strong><span>两者同出，异名同谓。</span></strong>两者指的是有欲和无欲，有名和无名，有和无。说这个有和无，看似是两者，它们同时出自于道。异名同谓，这就是告诉我们事情都是有两面性的，但这两面<span>实则</span>讲的是一件事情。<strong>玄之又玄，众妙之门。</strong>听起来很玄，但是它是众妙之门。之所以玄，是因为没找到门，找到门它就不玄了。举例，当我们做一件事情，说找到那个门，找到诀窍了，找到规律了，那件事情还难不难？不难。但是我们没找到之前呢？觉得很难，玄之又玄。就好像要进一个房间，没找到门，围着房间转圈跑，就觉得很难。但如果找到了门，就很简单了，从那个门打开，很容易地就进到那个房间，道也是如此。所以第一章首先告诉我们什么是道，说道，可道，但是非恒道；名，可名，非恒名，就是道可以说，但是注意，说出来的道，它不是恒常不变的道，它一直在变。我们看到的世间的一切，皆是名，但是那个名不是永恒的名，它是随着道的变化而产生了不同的名。所以我们想要名变化，就去掌握那个道的变化，因为道一变，名就变了。那名又分成了无名和有名。无名是万物之始，有名是万物之母，所以无名是初始的道的状态，一旦有名就变成了万物之母，就开始生生不息了，会变得越来越多，所以怎么办呢？<span>恒无欲也，以观其妙</span>，让我们回到无欲的状态，也就是回到了无名的和无的状态。<span>恒有欲也，以观其所徼</span>。一旦有欲，就受限制了，就有了边际，就被困住了，世界就不再美妙。那这两者同时出自于道，但是叫的名字不同，讲的是一种状态，就是道的两面性，所以道一面是<span>无</span>，一面是<span>有</span>；一面是无欲，一面是有欲；一面是无名，一面是有名。<span>玄之又玄，众妙之门</span>，听起来很玄，但是它是众妙之门。</span></p></div></div>"
  },
  {
    "title": "《道德经》第一章 无想法无分别",
    "date": "2025-08-19",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第一章 无想法无分别</span></strong></p><p><strong><span>此讲为延伸。</span></strong></p><p><span>让我们自己保持安静，一个是身，一个是心。身体的安静很简单，保持少动就好。</span></p><p><span>那什么叫心的安静呢？上一章讲的，要回到什么状态？恒无欲也，以观其妙。让我们的心保持 “无”，什么都没有，没有任何想法，没有任何分别，不停留在任何一件事情上，不停留在任何一物上。当我们的内心什么都没有的时候，它就是平和的，就是清净的状态。</span></p><p><span>可是往往我们的心里装的东西太多了，以至于我们没办法感受当下的美好，以至于我们睡觉的时候也睡不好。</span></p><p><span>日有所思，夜有所梦，就是平时的心动得太多，会发现晚上就会做各种各样、奇奇怪怪的梦，会沉浸在那个梦境之中。</span></p><p><span>延伸：当我们的内心不能保持平静的状态，有没有一直生活在梦境之中，没有清净的时候？每天白天是不是也像做梦一样胡思乱想？想很多不着边际的事情，想很多过去的事情，还会去忧虑未来还没有发生的事情。这都是因为我们不懂得 “无” 的道理，不懂得让自己的内心回到无欲、无名的状态。无名，万物之始也，这是最初始的状态。</span></p><p><span>我们这三天要充分地去感受 “无” 的状态。当我们此时此刻坐在这里，什么都没想，什么都不需要做，这就是美妙的呀。</span></p><p><span>我们世人总是反的，总想做点什么、想点什么让自己开心。一想，美妙就没了。我们总想去做点什么，好像才能让自己快乐、开心，其实错了。</span></p><p><span>什么都不做，是最开心的；不是要想点开心的事情，而是什么都不想，就开心了；不是去想点美妙的事情，而是什么都不想，就美妙了。</span></p><p><span>所以当我们懂得修道以后，所有的事情都会变少 —— 不再想讲那么多话，不再想做那么多事情。所有的东西都在变少，这时候美妙就出来了。</span></p><p><span>昨天来会场的路上，我跟佳涵和大贝讲了一个道理，问他们：想一想，过去这一年当中我们做事情是不是越来越简单？</span></p><p><span>比方说每次开课前我会理头发，我对大贝说：你想，我出去理发有没有坐过车？没有。我住在哪里，只会选择一家最近的理发店。 为什么呢？但凡让我坐车，用上半个小时去理个头发，那都是没必要的浪费，是这样的吧？</span></p><p><span>再举例，过去这一年，即使到哪个城市去玩，我们都会选择近的地方，基本不开车，要么走着去，要么骑个共享单车，吹吹风，挺有意思的。</span></p><p><span>再想，这几年吃饭是不是都是最简洁的方式，只要吃饱就可以了？穿着也是，都是最简单的服饰，不需要在这件事上浪费更多时间和精力。</span></p><p><span>在哪理的头发有什么区别吗？这次理得不好看，顶多十天就长回来了，十天以后不又一样了吗？是这样的吧？再不好吃的饭，不就是这一顿的事情吗？不用十天，吃饱以后就没差别了。</span></p><p><span>但有没有发现，我们总是在没必要的事情上消耗太多时间和精力？比如吃饭前纠结到底吃哪家、哪家评分更高，纠结了很久。可明天或者吃饱以后，吃的是哪家还重要吗？只有选择前的那一刻觉得重要，结束后这件事还重要吗？</span></p><p><span>不光吃饭如此，很多事情都是这样。三年前我们非常纠结的事情，今天来看还重要吗？不重要了。当时是向东还是向西，有什么差别？当时我们是这么想还是那么想，对今天来讲还有差别吗？没有啊。可当时我们为这件事消耗和纠结得是不是太久了？这就是无谓的消耗。</span></p><p><span>想一想，为什么我们那一刻会纠结那么长时间？因为我们认为有好坏、有差别、有对错。我们认为那家会不会更好一点，没理好是不是自己选择错了。</span></p><p><span>如果认为没理好，即使换一家也会觉得没做好，为什么？因为没有达到我们心中的标准。 我们的“有” 越多，标准越多，越难以满足。但我们会认为是这家没做好，换一家就有可能做好。有没有可能？也有，但不值得，就是我们不需要在每件事情上消耗那么多，去达到一个所谓的好的状态。</span></p><p><span>这一年找会场也是这样。一开始逢阳还总问我，后来我告诉他：你不要问我，而且跟服务组的同学对接会场时，要懂得差不多就行了，没必要消耗太多时间做这件事，没有意义。</span></p><p><span>有人可能会说：不对呀，我们更努力一点去找，不会找到一个更好、更完美的会场吗？会不会？不会。因为世界上没有完美的东西，无非是这个会场有这个问题，那个会场有那个问题而已。</span></p><p><span>我们要懂得这个道理：无论找任何一个地方，都有好的地方，也有不好的地方，实则是一样的。</span></p><p><span>注意，是不是又回到那个看一切都是一样的思维？如果有了这个思维，我们就懂得随顺了。</span></p><p><span>什么叫随顺？出现什么，就是什么好了。</span></p><p><span>说我今天中午出去吃饭，看到哪家店第一感觉还不错，就进去吃；想理头发，看到附近有哪家，就去哪家；孩子学习好，那就好呗，没那么好就没那么好嘛；出去买衣服，符合审美就买，不符合就不买。简不简单？这时候会发现人的思维会变得很舒适。</span></p><p><span>来到会场也是，起得早就坐靠前一点，没起来就悠哉悠哉地到会场，哪有位置就坐哪里嘛。那坐在前面，我可以看得更清楚；坐在后面，我<span>可以看得</span>更宽阔。当我们有这种思维时，看什么都是好的，发生什么是不是都无所谓，怎样都行？</span></p><p><span>前两场重庆场人不算多，大概三百人左右。逢阳和乐乐跟我说：老师，有点难过。我问为什么，乐乐说：老师，这场人是不是有点少啊？</span><span>我说不少，大有大的好，小有小的好。人多的时候是盛大、宏大的感受，人少的时候是亲切、温馨的感受。 少其实是好事情，因为它逐渐变少，是不是这件事走到尽头，我们才有机缘去干下一件事情？如果人一直这么多，那一辈子只讲这一部经典吗？ 好不好理解？就是多的时候和少的时候，我们看到的都是美好的。谁曾想到天津这一场人又多了呢，多了好不好？好啊，说明这件事还可以再持续一段时间。</span></p><p><span>当我们对一件事情没有那么多欲望、没有标准的时候，有没有发现，怎么都是好的。</span></p><p><span>说<span>今</span>天中午吃的饭不好吃，有没有好的地方？好在哪里？正好少吃点嘛。每天吃那么多，各项指标都高啊。饭不好吃，正好少吃一点，有没有发现瞬间就找到好的地方了？</span></p><p><span>所以注意，恒无欲也，以观其妙；恒有欲也，以观其所徼。 当我们无欲的时候，看什么都是美妙的；当我们有欲的时候，看什么都是有限制的，都是障碍我们的，这就是道的美妙。</span></p></div></div>"
  },
  {
    "title": "《道德经》第一章 用无欲看世界",
    "date": "2025-08-20",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第一章 用无欲看世界</span></strong></p><p><strong><span>此讲为延伸。</span></strong></p><p><span>当我们感受到了无欲，知道要守着无名的状态，守着什么都没有的状态，便会发现，什么都是好的。</span></p><p><span>说我们看到这个饭好吃，挺好；不好吃，也挺好。看到这个人让我心生欢喜，好不好？好；看到这个人让我心生厌恶，好不好？好啊。三人行，必有我师焉，看到他讨厌的地方，是不是就是警醒我的地方啊？当我没有那么多标准和欲望的时候，一切的存在、一切的显现，都是美妙的状态。</span></p><p><span>注意，我们说 “两者同出，异名同谓；玄之又玄，众妙之门”，这个好和不好？好吃和不好吃，实则哪里一样？我都是为了饱腹而已。好吃，有好吃的好；不好吃，有不好吃的好。好吃我就多吃两口，不好吃我少吃两口，可能还更健康。这个时候再看“<span>好吃</span>”还是“<span>不好吃</span>”是不是一样了，这就是道的妙处。</span></p><p><span>举例，说这次我们找的是这样的会场，上次我们找的是窄、细、长的，所以大家会排得很远。那排得远的好处是什么呀？比如对于我来讲，好处是什么？不用总是大幅度地动弹（老师左右两边转着头说话）；大家离得远看不清也挺好的，反而认真听了。那这一场面宽宽的，左右都是人，好处是什么？我们可以围在一起。坏处是什么？总得动<span>（总要左右两边转着头说话）</span>。所以这两个会场实则是一样的，没有什么差别。</span></p><p><span>注意，这个思维是很美妙的。如果我们懂得这个道理，来什么就是什么，出现什么它都是好的状态。比如孩子学习很好，学习很好的人有没有缺点？有。学习好的人都不太懂得变通，思维是比较刻板的，认准一个东西不放手。那学习不好的孩子有没有优点？有，他思维比较活跃、跳脱。</span></p><p><span>说我孩子有出息、事业成功，好不好？好。有没有缺点？他不太顾家，不太能照顾得上父母，然后他的生活可能会比较操劳；说我孩子事业不太成功，没有什么出息，好不好？也好。因为他在家里的时间就更长了。所以好和不好，其实都是一样的，都是各有利，同时也各有弊。</span></p><p><span>注意，这个时候，我们就没有了好和不好的思维，是不是就还事物本来的样子啊。说孩子学习好，那就好嘛；孩子学习不好，那就不好嘛。他事业有成，那就有成啊；他事业不成，那就不成嘛。当我们用这样的思维去看待世间万物，不加入自己的主观意识。不加入个人的欲望与要求，看到的才是他最本真、最天然的样子。他是什么样子的，就让他是什么样子好了。</span></p><p><span>这个时候注意，是不是美妙的状态？是。是不是我们对他不苛责呀？当我们自己有欲的时候，就不是美妙的状态了，会不停地指责对方，让他也会不舒服。“看看你的学习，就不能好一点吗？看看你每次都考成什么样子了？”“看看你就学习还行，别的事情你懂得吗？”“你看你这事业虽然做得很好，家里有没有一天能顾得上啊？家里的事情你知道吗？孩子上初几了你知道吗？知道上学期老师叫了几次去开家长会吗？”有没有发现矛盾不断？那是因为我们总用自己的<span>欲望和标准去要求别人、看待世界</span>。所以满眼看到的都是问题，看到的都是不好。</span></p><p><span>恒有欲也，以观其所徼。<span>当心中有欲，认知便有了边际，</span>被什么困住啊？被自己的欲望，被自己的 “有” 困住了。</span></p><p><span>所以我们学道，是感受那个 “无”，<span>感受</span>无欲和无名的状态。当我们用无欲和无名再看世界，就是 “两者同出，异名同谓”，看似是不一样的，但实则是一样的，没有差别。</span></p><p><span>这个道理很多时候我们想不明白，不对啊，那孩子学习好不好，怎么能一样呢？说我爱人懂不懂得关心人，怎么会一样呢？举例，说我爱人懂得关心我和不懂得关心我，他能一样吗？他现在不懂得关心，我们认为是他的缺点。假设我重新又换了一个人，这个人懂得关心我了，这个地方没缺点了，别的地方缺点会不会出来？可能懂得关心你，他也懂得关心别人呢，是不是新的问题就出现了？</span></p><p><span>注意啊，我们总觉得让这个人这个特点转变了，不就好了吗？当他这个东西转变了，另外一个东西就出现了呀。所以任何一件事情都是一样的。比如说玻璃杯，我们觉得它易碎就不好，易碎就是它的缺点。注意，我们认为的，其实它只叫特点，不叫缺点。我们暂且说易碎是它的缺点，那就把它换成一个钢的，不锈钢，不碎了，摔都没事。碎是不碎了，新的问题有没有出现？不好看，拿在手里太沉闷了，同学倒水多难呐，得探头看。那这个玻璃杯还有一缺点，它不保温。好，换成保温的，是，它保温了，其他的问题有没有出现？那实则不是一样的吗？</span></p><p><span>所以，我们懂得道以后，看世间万物的时候，不说它是缺点，只说它是特点、特性。每个人有没有他的特点？<span>就像每只杯子都有其特<span>性</span>。</span>然后我们就不会去想改变人和物，懂得随顺着他用就好了。我们看清每一个人，不需要去改变他，我只需要用他可用的那一面，就可以了呀，这就是道啊。</span></p><p><span>我们学习道，就是观察自己，观察身边的人和事，然后看到他的特点了，能用就用，不能用就放一放，多简单。说这个人我一看，他是这样的人，那我能跟他相处就与之相处，我发现他不适合我，那他就不适合。有没有好坏之分？不能说你不能跟人家相处，就天天指责他有问题，这里有问题，那里有问题，这个人没有智慧……他只是跟我们的特点不相符而已，或者说我们不喜欢这样的，但是能不能说人家有问题？不能。就像我们不喜欢的衣服，有人喜欢；我们不喜欢的颜色，有人喜欢；我们不喜欢吃的东西，也有人喜欢吃。我们能说人家口味有问题吗？</span></p><p><span>所以人为什么总是互相指责呀？因为有一个“对”在。我们总认为自己是对的、自己是好的、自己是正确的，所以他就变成对立面了。这时候 “恒有欲也，以观其所徼”，我们越是有欲、越是有分别，我们的认知被限制的、被困住的有没有越多呀？我们的世界观太小了，就活在自己的认知当中，活在自己固有的对错当中。</span></p><p><span>那我们再回来，当我们充分地感受到了“无”，感受到了“<span>无欲</span>”，用<span>“</span><span>无欲</span><span>”</span>的思维再去看世界，会发现看什么都是一样的，就是“两者同出，异名同谓，玄之又玄，众妙之门”。</span></p></div></div>"
  },
  {
    "title": "《道德经》第二章 无对比体会妙",
    "date": "2025-08-26",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第二章 无对比体会妙 </span></strong></p><p><strong><span>天下皆知美之为美，恶已；皆知善，斯不善矣。</span></strong></p><p><span><strong><span>天下皆知美之为美，恶已；皆知善，斯不善矣。</span></strong>说天下都知道美之为美，就有了恶已。我们知道了什么是美，对应的就出现了丑、恶。皆知善，斯不善矣。知道什么是善的，所以就有了不善的。举例，有了大，就会有小；有了对，就有了错；有了是，就有了非；有了长，就有了短；有了好看，就有了不好看。是不是都是对立的。那大是从哪来的？小。长是从哪来的？短。错是从哪来的？因为有个“<span>对</span>”，所以，一切都是对立而产生的。举例，说<span>我拿在手中</span><span>的</span>这只杯子，请问各位，这只杯子是大还是小啊？有人觉得它大，有人觉得它小。为什么有人觉得它</span><span>大？</span><span>因为我们心里想的是小的</span><span>。</span><span>那有人觉得它小</span><span>，</span><span>因为他心里有一个</span><span>大</span><span>。</span><span>实则它的存在是客观的</span><span>，</span><span>没有大，也没有小</span><span>，</span><span>就这样存在这里</span><span>。</span><span>但是有人觉得</span><span>它</span><span>大</span><span>，</span><span>有人觉得</span><span>它</span><span>小</span><span>。</span><span>同一个人</span><span>，比如</span><span>说我自己</span><span>对它的大和小的看法</span><span>，</span><span>会不会有变化</span><span>？</span><span>一开始可能觉得它有点大了</span><span>，</span><span>用着用着发现</span><span>，</span><span>它也不大呀</span><span>，</span><span>再用着用着</span><span>，</span><span>它变小了呢</span><span>。</span><span>其实它没变</span><span>，</span><span>是我们看它的眼光在变</span><span>，</span><span>我们看它的心在变化</span><span>。</span><span>再换个例子</span><span>，</span><span>假设</span><span>五十块钱买的这只杯子</span><span>，</span><span>请问贵还是便宜</span><span>？</span><span>有人觉得贵了</span><span>，</span><span>有人觉得</span><span>便宜了</span><span>，</span><span>其实它不贵也不贱</span><span>，</span><span>就是五十块钱</span><span>。</span><span>觉得贵的人就不买嘛</span><span>，</span><span>觉得便宜的人就买了</span><span>，</span><span>觉得还行的人就犹豫一下</span><span>。</span><span>其实五十块钱</span><span>，</span><span>只是它的客观存在</span><span>，</span><span>但是到一千个人眼中</span><span>，</span><span>它是不是就产生一千种变化呀</span><span>。</span><span>那再问</span><span>，</span><span>这只杯子好看还是不好看呢</span><span>？</span><span>其实也不知道</span><span>，</span><span>有人觉得好看</span><span>，</span><span>有人觉得不好看</span><span>。</span><span>有人觉得它好</span><span>，</span><span>有人觉得它不好</span><span>。</span><span>哪个是对的</span><span>？</span><span>没有对错</span><span>。</span><span>有人觉得好</span><span>，</span><span>自然就会有人觉得</span><span>不好</span><span>。</span><span>人</span><span>是不是如此</span><span>，</span><span>有人觉得他好</span><span>，</span><span>有人觉得他不好</span><span>；</span><span>有人觉得他是对的</span><span>，</span><span>有人觉得他是错的</span><span>。</span><span>所以其实他本身</span><span>只是一个客观的人</span><span>存在于这里</span><span>，</span><span>是我们不停地在</span><span>产生分别</span><span>。</span><span>因为我们心中</span><span>有一个</span><span>自己认为的对错</span><span>，</span><span>自己的标准</span><span>，</span><span>所以在遇见外面的事物的时候</span><span>，</span><span>就产生了评判</span><span>，</span><span>产生了评定</span><span>，</span><span>产生了喜好</span><span>。</span><span>一切是不是两个东西一对立</span><span>就产生了</span><span>。</span><span>所以世间万物不是独立存在的</span><span>，</span><span>都是</span><span>对立而产生的</span><span>。</span><span>这只杯子放在这里</span><span>，</span><span>不大不小</span><span>，</span><span>但如果</span><span>拿一个更大的杯子</span><span>，</span><span>这个就变成</span><span>小的。若</span><span>拿一个小的杯子</span><span>，</span><span>这个就变成大的</span><span>，</span><span>是不是对立就产生了大和小啊</span><span>，</span><span>产生了美和丑啊</span><span>，</span><span>产生了善和不善</span><span>，</span><span>产生了对或是错</span><span>。</span><span>这个道理很有意思</span><span>，</span><span>那我们明白一切</span><span>都是对立产生的</span><span>，</span><span>对我们有什么启发呀</span><span>？</span><span>对我们的生活</span><span>有没有什么用处啊</span><span>？</span><span>用处在哪里</span><span>？</span><span>不对立</span><span>，</span><span>是不是就不产生了</span><span>。</span><span>所以如何回到</span><span>无欲和无名的状态</span><span>？</span><span>就是我们不要</span><span>产生对立和对比</span><span>，</span><span>就什么都没有啊</span><span>。</span><span>因为我们越是对立</span><span>，</span><span>越是对比</span><span>，</span><span>所产生的事物</span><span>就会变得越多</span><span>。</span><span>比方说</span><span>现在互联网时代</span><span>，</span><span>我们总是不停地刷视频</span><span>，</span><span>就是在干嘛？</span><span>不停地产生什么</span><span>？</span><span>对比</span><span>，</span><span>不停地产生对立</span><span>。</span><span>有没有给我们带来更多的烦恼</span><span>？</span><span>说正在上着班</span><span>，</span><span>本来上得还挺好</span><span>，</span><span>累了我休息一会儿</span><span>，</span><span>然后一刷视频</span><span>，</span><span>人家去新疆旅游了</span><span>，</span><span>我这破班一天都不想上了；</span><span>再刷一个视频</span><span>，</span><span>人家在策马奔腾</span><span>，</span><span>我在这当牛做马</span><span>；</span><span>再一刷视频</span><span>，</span><span>人家又出国了</span><span>，</span><span>我就出不了自己这屋啊</span><span>。</span><span>这个时候什么就来了</span><span>？</span><span>烦恼就来了</span><span>。</span><span>其实这烦恼本来没有</span><span>，</span><span>怎么来的</span><span>？</span><span>对比产生的</span><span>。</span><span>人家去新疆旅游</span><span>，</span><span>我不开心了；</span><span>人家去一趟国外</span><span>，</span><span>我感叹出不出得了这房间了</span><span>。</span><span>其实我们没动</span><span>，</span><span>但是心怎么样</span><span>？</span><span>动了</span><span>。</span><span>所以我们看</span><span>，</span><span>其实我们小时候</span><span>烦恼没有这么多</span><span>，</span><span>为什么？</span><span>我们看世界的窗口没有这么大</span><span>，</span><span>所产生的对比</span><span>是不是就很小啊</span><span>。我们</span><span>没有看到过</span><span>那么多外面的世界</span><span>，</span><span>没有了解那么多</span><span>，</span><span>是不是烦恼反而是少的</span><span>？</span><span>所以我们的烦恼</span><span>往往都是对比出来的</span><span>。</span><span>比如说孩子参加高考</span><span>，</span><span>考完之后</span><span>有三百多分、</span><span>四百分的</span><span>，</span><span>我这考三四百分</span><span>，</span><span>觉得还挺好</span><span>，</span><span>结果一上网</span><span>，</span><span>人家考六七百</span><span>，</span><span>瞬间就觉得怎么样</span><span>？</span><span>不好了</span><span>。</span><span>这个不好从哪来的</span><span>？</span><span>从人家那个好</span><span>对比来的</span><span>。</span><span>这几年</span><span>短视频的兴起</span><span>，</span><span>有没有大大地激发人的欲望啊</span><span>？</span><span>说本来我</span><span>赚着四五千的工资</span><span>，</span><span>生活其实还挺好的</span><span>，</span><span>一刷短视频</span><span>，</span><span>人家都赚五六万呢</span><span>，</span><span>瞬间就觉得“</span><span>我这工作干得没什么意思</span><span>，</span><span>辛辛苦苦这一天</span><span>，</span><span>累死累活的</span><span>，</span><span>到底在干什么呢</span><span>？”</span><span>因为我们看到人家赚得更多</span><span>，</span><span>所以生活变得更加迷茫了</span><span>。</span><span>这些烦恼都是哪来的呀</span><span>？</span><span>一对比</span><span>，</span><span>一对立</span><span>，</span><span>是不是就产生了问题呀</span><span>。</span><span>天下皆知美之为美</span><span>，</span><span>就有了恶已</span><span>。</span><span>皆知善</span><span>，</span><span>斯不善矣</span><span>。</span><span>一对比</span><span>，</span><span>一对立</span><span>，</span><span>好坏对错是不是都要产生了</span><span>，</span><span>大小</span><span>、</span><span>多少</span><span>、</span><span>美丑</span><span>、</span><span>善恶</span><span>，</span><span>是不是都来了呀</span><span>。</span><span>所以怎么办呢</span><span>？</span><span>要回到什么</span><span>？</span><span>无名的</span><span>、</span><span>无欲的状态</span><span>，</span><span>什么都不比的时候</span><span>，</span><span>是不是就回到</span><span>本然清净的状态啊</span><span>。</span><span>人的心理</span><span>，</span><span>总是喜欢对比、</span><span>对立的</span><span>。</span><span>比方说</span><span>，</span><span>今年干了一年</span><span>，</span><span>到年底老板发了一个红包</span><span>，</span><span>我一打开红包</span><span>，</span><span>里面两千块钱</span><span>，</span><span>还挺开心的</span><span>，</span><span>多与少先不说</span><span>，</span><span>起码有个红包</span><span>，</span><span>结果下班跟同事一聊天</span><span>，“</span><span>你发多少啊？”</span><span>“</span><span>我发四千”</span><span>，</span><span>瞬间就觉得不开心了</span><span>。</span><span>本来下班的时候还在想</span><span>：</span><span>我到家以后</span><span>带爱人出去吃饭</span><span>，</span><span>我们去感受一下</span><span>。</span><span>结果一听他发四千</span><span>，</span><span>饭也不想吃了</span><span>，</span><span>沉默寡言了</span><span>，</span><span>老板也不认可我了</span><span>，</span><span>生活过得也没什么意思了</span><span>；</span><span>他都评上职称了</span><span>，</span><span>我没评上；</span><span>我那同学</span><span>，</span><span>我觉得他不怎么样</span><span>，</span><span>怎么他找的人那么好</span><span>，</span><span>那我找了个什么东西呢</span><span>？</span><span>我们不停地在干嘛</span><span>？</span><span>跟身边所有能看到的</span><span>、</span><span>听到的</span><span>在做对比</span><span>，</span><span>结果越对比</span><span>，</span><span>烦恼就越多</span><span>。</span><span>所以</span><span>，</span><span>天下万物都是对立而存在的</span><span>，我们</span><span>不对立</span><span>，</span><span>它就不存在。</span><span>少一些对比</span><span>，</span><span>少一些对立</span><span>，</span><span>少一些对错</span><span>，<span>少一些</span></span><span>是非的分别</span><span>，</span><span>让我们保持“<span>恒无欲也</span><span>，</span><span>以观其妙</span>”</span><span>，</span><span>让自己处在美妙的状态</span><span>。</span></p></div></div>"
  },
  {
    "title": "《道德经》第二章 有和无难和易",
    "date": "2025-08-27",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第二章 有和无难和易</span></strong></p><p><strong><span>有无之相生也，难易之相成也。</span></strong></p><p><strong><span>有无之相生也，难易之相成也。</span></strong><span>万物的关系是复杂而多变的，它是对立产生的。但是万物不光是对立的，它还是相互转换的关系。</span><span>比如说，</span><span>“</span><span>有</span><span>” </span><span>会不会转换成 </span><span>“</span><span>无</span><span>” </span><span>？“<span>难</span>”会不会转换成 </span><span>“</span><span>易</span><span>” </span><span>？<span>容易</span>会不会转换成<span>困难</span>？<span>对的</span>会不会变成<span>错的</span>？<span>错的</span>会不会变成<span>对的</span>？都会吧。举例：前两年有人讲了一段话，在当时听起来可能是错的，但过了两年发现，他说的变成对的了。其实什么在变？所有的一切都在变。再<span>比如同一部电影，</span>在不同的时间段上映，会不会有不同的结果？会。有的题材前几年，恰好社会在某一个节点上，它火了；但是换个时间点，它能不能火？未必。这就是世间万物一切都在变化之中啊。每一个东西不是单独存在的，它既是对立的，又是互相转换的、变换的关系。</span></p><p><span>说买房子的事情，可能不同的时间段买，结果不一样。有的人买升值了，有的人买贬值了。同样是房子，不同的地段会不会有不同的效果？有的人买那个地方贬值了，人家另外一个地方升值了。它有没有固定的东西啊？没有，所有的东西都是在变的。比方说一个孩子，说他从小学习成绩不是很好，这时候我们觉得 “这孩子完喽，这一生可怎么办”；说这个孩子长大以后，创业做得很成功，这个时候我们又感叹什么？“幸亏他当时学习不好，他没把心思用在学习上，他接触了更多的人和事，所以最后成功了”，是不是又觉得他很好了？又过几年，发现这孩子太忙了，从来不回来看我们啊，就说 “这孩子真是不怎么样，虽然做得挺成功，但是他从来也不看我呀，成功又有什么用呢”，是不是又变了？过两年我们又想开了：我这孩子成功，虽然不看我；人家那孩子不成功也不来看，还是成功好。有没有发现，看法是变来变去的？一个是我们自己在变，第二个是什么？世间万物它也一直在变哦。</span></p><p><span>所以我们看，原来对的有可能变成什么？错的；错的也可能变成对的；大的有可能变成小的，小的有可能变成大的。是不是世间万物一直在干嘛？转换、变换当中，没有固定的形态。不光是转换的，还是相辅相成的道理。什么叫相辅相成？说有无之相生也，有和无才可以干嘛？相生。举例：杯子外面的部分叫什么？叫 “有”；中间空的叫什么？“无”。有无之相生也，因为有和无，这个杯子才生起了它的功能和用途。比如说我们现在所处的这个课堂是不是如此，周边是有，地面是有，顶棚是有，灯是有，空调也是有，音箱也是 有。然后中间是什么？空的（无）。有无之相生也，所以既要有 “有”，还要有 “无”，它们两个一结合，这就叫什么？相生。</span></p><p><span>人是不是如此？我们这个人<span>（拍了拍身子）</span>，这是什么？有啊。只有 “有” 行不？不行。我们的嘴巴是什么？张开就是空的，是不是什么都没有（无）？鼻子也是什么？空的（无）。所以不止这些哦，我们看一个人说 “有思想、有认知”，这是有还是无？看似是“有”，实则思想在哪呢？拿出来我看看，能不能看到具体的形状？没有。所以一个人既要有 “有”，还要有“无” 。我们要有 “有” 的部分，还要有看不见的那个 “无” 的部分，它们两个共同组成了这个人。</span></p><p><span>天下万物都是相辅相成的，这个道理有什么作用？我们知道了这个道理，是不是开始不去单独地看一个事物的好坏啊？而是要懂得干嘛？更好地让它们相辅相成。举例：我们有一个员工，这个人有点笨，有没有好处？有啊。这个笨的，给他配一个相对聪明的，他们两个在一起能不能生成很多东西？两个聪明的在一起不打架吗？天天争是非对错了，争谁说了算了，还能不能做好事情？做不好。再比如说，很多事情是不是都要讲结合呀？说 “我吃一个东西，最好再蘸着一个什么样的料”，是不是一种结合？再比如说，我们同一个人对不同的人讲的话，会不会产生不同的结果？会吧。这就是找什么样的人说话，重不重要？重要吧。这就是 “和” ，这就是相辅相成。</span></p><p><span>所以懂得这个道理，我们不会去分别一个东西单独拿出来是好还是不好，我们懂得什么？相辅相成的道理。要是结合得好，产生的结果就是好的。我们看人生当中发生的这些事情，单独拿出来，没有好坏；如果结合得好，就会把不好的变成好的；要是不会结合，可能本来好的，也让我们给变成了不好的东西。</span></p><p><span>所以，我们学习 “道”，是要懂得观察，观察事物本来的样子和特点。当我们知道了事物的样子和特点的时候，才能更好地结合。恒有欲也，以观其所徼。举例：说用玻璃的杯子泡一泡绿茶，是不是就结合得很好啊？泡别的茶可能就没有那么好喝。单独拿出来，玻璃杯子、绿茶或者红茶，没有好坏，但是结合到一起，是不是就产生不同的结果了？就像有的菜，做甜的会更好吃，有的可能做成辣的会更好吃，有的可能做成咸的会更好吃，是不是在结合呀？结合产生不同的结果。</span></p><p><span>我们说用人之道，讲的这个道理，就是单独这个人是聪明还是笨，是勤快还是不勤快，这个没有好坏，但是如何去搭配组合、如何去用这个人，这个时候产生的结果就会不同。</span></p><p><span>这一段在告诉我们 “道” 首先是对立的，然后又是互相转换的、变换的关系，最后它又是相辅相成的道理。难易之相成也，难和易是对立的，也是相互转换的，最后也是相辅相成的关系。</span></p><p><span>那难易是如何相辅相成的呢？用我们的人生来举例：人这一生，既要做容易的事情，还要做困难的事情，才会有所成。为什么要做困难的事情？因为困难可以使人成长，人都是在逆境当中得到成长的。那为什么要做容易的事情？容易的事情可以让人去放松、产生愉悦，可以享受当下的生活。所以人既要做难的事情，挑战自己、成长自己，也要做容易的事情，让自己可以享受生活的美好，得劳逸结合。</span></p><p><span>有的人不愿意面对困难，会发现他的一生是不是少了很多东西？没有办法得到成长。但是有的人一直面对困难，最后是不是就累坏了呀？因为没有享受生活，没有感受到生活的美好，所以叫难易之相成也。</span></p><p><span>当我们看懂这个道理，其实做任何事情，就会懂得一个状态，叫 “阴阳调节” 的状态。就是我们一会儿要去做点难的事情，而当我们不停地面对困难的时候，就要学会让自己去享受一下生活，但是不能一直享受生活，因为它会让人迷失、沉浸其中。所以又要去面对一些困难的事情，最后才能有成。</span></p><p><span>有的人说 “我有点抑郁呀”，有的人说 “我总是焦虑”，为什么呀？因为长期都在做某一件不能让自己开心和愉悦的事情，就变成这样了。所以 “难易之相成也”，“道” 是变幻的，所以人也要学会变幻啊。</span></p><p><span>昨天有一位女士还在讲：“孩子九岁了，从生孩子开始到现在，我从来就没有离开家。” 这些年你一直没有干嘛？没有变化呀。很多人带几年<span>孩子</span>带得很痛苦啊，不是带孩子令你痛苦，是因为这几年你从来没有干嘛？没有产生变化而痛苦的。所以我们知道了，要懂得变。</span></p><p><span>举例：一个人一直上班，他想的是什么？不想干了。所以我们上一段时间班就要干嘛呀？要学会休息一下，给自己放松一下，让自己去度度假。我经常跟学生讲：每个月，你们自己累的时候，要学会休息，而且是下山休息，在山上休息不了，因为在这个环境怎么样？没有脱离出去。所以我说：你们这个月如果哪几天觉得很累，或者状态不好，就要干嘛？下山去玩上几天。然后会得出一个结论：还是有事做好啊。就回来接着做事情了。又做一段时间，“<span>天天干，什么时候是头啊？</span>”出去溜达几天，一溜达，“我还是回去干活吧，太无聊了。”</span></p><p><span>我们的生活是不是一样？有的人说 “我天天在家里生活，这样的日子太难熬了”，那就出去自己待上几天，自然就会想念家里的一切。这个生机是从哪来的？从变化上来。就像我们的房间要经常开窗，在干什么？通风啊。是不是通风了整个房间就有了生机？那我们的人生不需要通风吗？不需要变换吗？要变的，这就是相辅相成的道理。</span></p><p><span>所以不要停留在某一种状态上一直不变，时间久了是会出问题的。比方说夫妻相处，说偶尔两个人出去吃一顿饭，到别的城市住上两天，偶尔一起去逛逛公园，是不是相辅相成的道理啊？是不是相生啊？而不是一种状态持续不变，时间久了感情会不会出问题啊？会。像不像房间从来没有开过窗户？最后一定是味道很难闻的，家里没有办法焕发生机。</span></p><p><span>开篇就讲，世间一切的事物都在干嘛？变化当中。所以我们就要知道，有很多事情我们是要学会变化的，否则在一个状态、一件事情里，时间久了，反而就没有生机了。</span></p></div></div>"
  },
  {
    "title": "《道德经》第二章 音和声先和后",
    "date": "2025-09-02",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第二章 音和声先和后</span></strong></p><p><strong><span>长短之相形也，高下之相盈也，音声之相和也，先后之相随，恒也。是以圣人居无为之事，行不言之教。万物作而弗始也，为而弗恃也，成功而弗居也。夫唯弗居，是以弗去。</span></strong></p><p><strong><span>长短之相形也，高下之相盈也。</span></strong><span>长短是可以相形的</span><span>，</span><span>说一个东西的排列有长有短</span><span>，</span><span>看起来才好看</span><span>。</span><span>在生活当中</span><span>，我们</span><span>都知道用自己的</span><span>长处</span><span>，</span><span>用自己的强项</span><span>，</span><span>但是注意</span><span>，</span><span>学道不是</span><span>，</span><span>既要用<span>自己的长</span></span><span>，</span><span>还要</span><span>用<span>自己的</span>短</span><span>；</span><span>既要用<span>自己的</span>强项</span><span>，</span><span>还要学会用</span><span>自己的</span><span>弱项</span><span>。</span><span>为什么？</span><span>如果一个人总用自己的长处</span><span>，</span><span>是会出问题的</span><span>。</span><span>昨天那位老师</span><span>，她</span><span>就一直在用</span><span>长处 </span><span>—— </span><span>我是老师</span><span>，</span><span>我认知很高</span><span>，</span><span>学生都听我的</span><span>，</span><span>同事都说我很好</span><span>。</span><span>这就麻烦了</span><span>，</span><span>当她总是</span><span>用自己长处的时候</span><span>，</span><span>能不能看到自己的短处</span><span>？</span><span>能不能看到别人的长处</span><span>？</span><span>看不到了，</span><span>这个长处</span><span>就变成了伤人的利器了。</span><span>比方说，一个人的</span><span>事业做得很好</span><span>，</span><span>能赚钱</span><span>，</span><span>注意</span><span>，</span><span>事业干得很好</span><span>，</span><span>这是长处</span><span>，</span><span>那在家庭生活当中</span><span>，</span><span>有没有短处</span><span>？</span><span>什么短处</span><span>？</span><span>没有精力啊</span><span>，</span><span>没有陪伴</span><span>，</span><span>甚至没有心思</span><span>让家里的事情变得更好。</span><span>如果我们知道这个道理</span><span>，</span><span>回家以后对爱人怎么样</span><span>？</span><span>是不是对她是尊敬的呀</span><span>，</span><span>为什么？</span><span>因为人家的长处</span><span>是<span>可以</span>把家里照顾得更好。当我们</span><span>懂得用短处的时候</span><span>，</span><span>才能激发</span><span>对方的长处啊</span><span>。</span><span>我一长一短</span><span>，</span><span>他一长一短</span><span>，</span><span>这个时候</span><span>才是完美的融合呀</span><span>。</span><span>再比如说</span><span>一个领导者</span><span>，</span><span>在工作上有他的长处</span><span>，他</span><span>有没有短处</span><span>？</span><span>一定有吧。</span><span>销售</span><span>做得很好的人</span><span>往往短处是什么</span><span>？</span><span>不太愿意干</span><span>墨守成规的事情</span><span>，</span><span>不太愿意做</span><span>那些按照规矩的事情</span><span>。</span><span>那这些短处</span><span>，</span><span>有没有人身上恰好有这长处</span><span>？</span><span>是不是就很好地就弥补了呀</span><span>。</span><span>举例</span><span>，</span><span>说我自己</span><span>，</span><span>四十年过去了</span><span>，</span><span>我喜欢做有挑战的事情</span><span>，</span><span>喜欢不停地在事情当中</span><span>挑战自我</span><span>，</span><span>不停地去面对困难</span><span>，</span><span>乐在其中</span><span>，</span><span>那缺点是什么？</span><span>就是我不太能长时间地</span><span>守在一个地方</span><span>或者一件事情上</span><span>，</span><span>这个时候怎么办？</span><span>就得找一些可以帮我</span><span>守住的人就好了呀</span><span>。</span><span>比方说，咱们的学生当中</span><span>，</span><span>他们有很多人</span><span>有极其强大的长处</span><span>，</span><span>比如说像陶陶她们</span><span>，</span><span>坐在这直播</span><span>，</span><span>我可以直播三年</span><span>，</span><span>天天播</span><span>，</span><span>不动地方</span><span>，</span><span>是不是优点</span><span>？</span><span>说实话，我做不到</span><span>，</span><span>对于我来讲这就很难</span><span>。</span><span>那我们再看</span><span>，</span><span>说新新</span><span>，</span><span>小白</span><span>，</span><span>正心她</span><span>们截线上课</span><span>，</span><span>一截截六年</span><span>，</span><span>就天天对着电脑</span><span>，</span><span>就干这一件事情</span><span>。</span><span>要是让我做的话</span><span>，</span><span>我坐不住</span><span>，</span><span>这是不是她们的长处啊</span><span>。</span><span>当我们知道自己短在哪里</span><span>，</span><span>知道别人长在哪里</span><span>，</span><span>是不是这个团队</span><span>就会磨合得更好啊</span><span>。</span><span>如果我们认为自己的都是长处</span><span>，</span><span>没有办法看到自己的短板</span><span>，</span><span>不懂得欣赏别人</span><span>。</span><span>会觉得自己处处都对</span><span>，</span><span>哪里都是好的</span><span>，</span><span>这个时候会敬重别人吗</span><span>？</span><span>最后发现</span><span>，</span><span>一个人总是用长处的</span><span>，</span><span>总是用自己强项的人</span><span>，</span><span>身边寸草不生啊</span><span>。</span><span>我们没有给人家生长的空间</span><span>，</span><span>没有给人家生长的机会</span><span>。</span><span>所以</span><span>，</span><span>长短之相形也</span><span>。</span><span>我们要学会用自己的长处</span><span>，</span><span>也要学会用自己的短处</span><span>。</span><span>高下之相盈也</span><span>，</span><span>我们既要用自己的高</span><span>，</span><span>还要学会</span><span>处下</span><span>，</span><span>这时候才可以相盈</span><span>。</span><span>比方说我们是一个团队的领导者</span><span>，</span><span>可是我们还懂得谦逊</span><span>、</span><span>处下</span><span>，</span><span>会不会相盈</span><span>？</span><span>会；</span><span>说一个人在工作上做得很好</span><span>，</span><span>回家以后还懂得谦逊平和</span><span>，</span><span>会不会让家庭更和谐呀</span><span>？</span><span>是不是相盈的道理啊</span><span>；</span><span>说这个人能力很强</span><span>，</span><span>但是跟朋友相处的时候</span><span>，</span><span>从来都是低调和谦逊的</span><span>，</span><span>会不会相盈啊</span><span>。</span><span>所以我们既要有高的时候</span><span>，</span><span>还要用这个高</span><span>，</span><span>让自己处</span><span>下</span><span>，</span><span>这个时候才对</span><span>。</span><span>世间的一切道理都是相辅相成的</span><span>，</span><span>注意</span><span>，</span><span>它是变换的</span><span>，我们</span><span>既要用“<span>有</span>”</span><span>，</span><span>还要用“<span>无</span>”</span><span>；</span><span>既要用难</span><span>，</span><span>还要用易</span><span>；</span><span>既要用长</span><span>，</span><span>还要用短</span><span>；</span><span>既要用高</span><span>，</span><span>还要用下</span><span>，</span><span>它才可以相盈</span><span>。</span><span>它是相互转换的关系</span><span>，</span><span>又是相互成就的关系</span><span>。</span><strong><span>音声之相和也。</span></strong><span>音和声，</span><span>才是相和的</span><span>。</span><span>什么叫声？</span><span>我们讲话的这个</span><span>叫声</span><span>，</span><span>我们敲桌子的这个叫声</span><span>，</span><span>下雨那个叫声</span><span>。</span><span>声是发出来的</span><span>，音是什么</span><span>？</span><span>高低起伏地变换叫音</span><span>。</span><span>所以我们说听话要听音</span><span>，</span><span>那音是什么</span><span>？</span><span>就是他是什么样的态度</span><span>，</span><span>他表达这个话的背后</span><span>到底想说什么</span><span>，这</span><span>都叫音</span><span>。</span><span>声是呈现出来的这个</span><span>，</span><span>音</span><span>是没呈现出来的那部分</span><span>。</span><span>事物</span><span>是如何形成的</span><span>？</span><span>一个呈现在外面</span><span>，</span><span>一个没有呈现出来。</span><span>一个有形，</span><span>一个无形</span><span>，</span><span>共同组成了那个和</span><span>。</span><span>呈现出来的叫名</span><span>，</span><span>没有呈现出来的叫道</span><span>，</span><span>所以道是看不见的</span><span>，</span><span>名是看得见的</span><span>；</span><span>声是听得见的</span><span>，</span><span>音是背后的那个听不见的</span><span>。</span><span>这个音听不见吗</span><span>？</span><span>能</span><span>。</span><span>通过什么听见的</span><span>？</span><span>通过声</span><span>。</span><span>那这个道看不见吗</span><span>？</span><span>能</span><span>。</span><span>通过什么看见的</span><span>？</span><span>通过名</span><span>。</span><span>比如说</span><span>做了一盘吃的东西</span><span>，</span><span>然后问对方“<span>好吃吗</span><span>？</span>”“<span>嗯</span><span>…… </span><span>好吃</span><span>。</span>”</span><span>他说出来的是好吃</span><span>，</span><span>但是我们能不能感受到</span><span>？实则</span><span>不好吃啊</span><span>。</span><span>然后我们问一个人“</span><span>你还喜欢我吗</span><span>？<span>”</span></span><span>“</span><span>喜欢呐</span><span>。”虽然</span><span>他说的是喜欢</span><span>，</span><span>但是</span><span>，</span><span>是不是真的喜欢</span><span>？</span><span>我们不能通过他说出来的</span><span>，</span><span>而是要通过什么</span><span>？</span><span>他平时的行为啊</span><span>，</span><span>态度啊</span><span>，</span><span>说话的语气啊</span><span>，</span><span>是否关心我们啊</span><span>，从这些</span><span>能不能看得到</span><span>？</span><span>能</span><span>。</span><span>注意</span><span>，</span><span>我们看到的东西</span><span>，</span><span>都是要通过看不到的东西</span><span>总结出来的</span><span>，</span><span>那个才是真实的状态。</span><span>所以叫音声之相和也</span><span>。</span><span>这世间的万物很奇妙</span><span>，</span><span>它只会呈现出来一部分</span><span>，</span><span>没呈现出来的</span><span>，</span><span>需要我们通过</span><span>呈现出来的部分</span><span>去观察。</span><span>它们两个加在一起</span><span>才叫</span><span>和</span><span>，</span><span>才是那个事情的</span><span>完整的程度</span><span>。</span><strong><span>先后之相随，恒也。</span></strong><span>说先后是相随的</span><span>，</span><span>一前一后</span><span>，</span><span>会不会变呐</span><span>？</span><span>会。</span><span>有了先</span><span>，</span><span>有了后</span><span>，</span><span>才形成了“<span>随</span>”</span><span>，</span><span>一个能不能叫随</span><span>？</span><span>不能，只有两个以上</span><span>才能叫随</span><span>。</span><span>万物的关系很有意思</span><span>，</span><span>音声之相和</span><span>，</span><span>讲的是一内一外才是和</span><span>。</span><span>那先后之相随讲什么</span><span>？</span><span>一前一后</span><span>，</span><span>过去和将来</span><span>，</span><span>强弱</span><span>，</span><span>先后等等。</span><span>比如说我们想让自己的家庭</span><span>变得更和谐</span><span>，</span><span>先后之相随</span><span>，</span><span>我们要先做那个“<span>先</span>”</span><span>，</span><span>然后后面才会产生啊</span><span>。</span><span>所以告诉我们：</span><span>要想改变现状</span><span>，</span><span>要先从自己开始</span><span>，</span><span>后面才会有</span><span>随的</span><span>。</span><span>然后随着随着</span><span>，</span><span>后面的有可能</span><span>跑到前面去了</span><span>。</span><span>告诉我们</span><span>：</span><span>世间万物的变化</span><span>，</span><span>都是自然而发生的</span><span>，</span><span>但是如果我们想让某件事情</span><span>发生变化</span><span>，</span><span>那自己就要</span><span>先开始</span><span>，</span><span>然后先后之相随</span><span>，</span><span>恒也</span><span>。</span><span>那什么是恒长不变的</span><span>？</span><span>是一直在变化</span><span>。</span><span>这一段一直在讲</span><span>变化。</span><span>有无之相生</span><span>；</span><span>难易之相成</span><span>；</span><span>长短之相形</span><span>；</span><span>高下之相盈</span><span>；</span><span>音声之相和</span><span>；</span><span>先后之相随</span><span>，</span><span>恒也</span><span>。</span><span>所以恒久不变的就是</span><span>：</span><span>一直在变化之中</span><span>。</span><strong><span>是以圣人居无为之事，行不言之教。</span></strong><span>什么叫无为</span><span>？</span><span>无为就是没有刻意而为</span><span>，</span><span>不是按照自己的主观意识而为</span><span>，</span><span>不是我想干什么就叫无为了</span><span>。</span><span>那圣人居的是无为之事</span><span>，</span><span>为什么？</span><span>因为知道世间万物</span><span>有它自己运行的规律</span><span>，</span><span>所以不是我想让它怎么样</span><span>，</span><span>就可以怎么样</span><span>。</span><span>我是要随顺着事情的发展</span><span>而去做的</span><span>，</span><span>行不言之教</span><span>。</span><span>因为是无为的</span><span>，</span><span>所以自然就不会言教。</span><span>人什么时候会言教？</span><span>是不是有为的时候啊</span><span>。</span><span>比如想让员工</span><span>变得更优秀</span><span>，</span><span>就要干嘛了</span><span>？</span><span>是不是要言教了</span><span>？</span><span>天天鼓励他</span><span>，</span><span>给他讲梦想</span><span>，</span><span>让他变得更好</span><span>，</span><span>对吧？比如</span><span>想让孩子去干点什么</span><span>，</span><span>是不是就不停地</span><span>要言教了</span><span>？</span><span>要给他讲很多的道理</span><span>。</span><span>所以越是有为的</span><span>，</span><span>越会言教</span><span>。</span><span>越是无为的</span><span>，</span><span>行的就是不言之教。</span><strong><span>万物作而弗始也。</span></strong><span>圣人居的是无为之事</span><span>，</span><span>行的是不言之教</span><span>，</span><span>让万物自己去运作</span><span>，</span><span>而弗始也</span><span>，</span><span>没有开始过</span><span>。</span><span>万物去作</span><span>，</span><span>但是自己没有开始</span><span>。</span><span>如果是有为的呢</span><span>，</span><span>是不是就反过来了</span><span>？</span><span>我在做</span><span>，</span><span>但是万物</span><span>没有开始</span><span>，</span><span>是不是我们就越做越多呀</span><span>？</span><span>我们对孩子是不是这样</span><span>，</span><span>我们越是有为的</span><span>，</span><span>我们做得很多</span><span>，</span><span>孩子有没有开始</span><span>？</span><span>没开始</span><span>。</span><strong><span>为而弗恃也。</span></strong><span>为了之后</span><span>，</span><span>不会有所倚仗</span><span>，</span><span>这里的为指的是无为</span><span>，</span><span>就是让万物自己开始</span><span>，</span><span>然后随顺万物去为这叫无为</span><span>。</span><span>为而弗恃也</span><span>，</span><span>做完之后不要有所倚仗</span><span>。</span><strong><span>成功而弗居也。夫唯弗居，是以弗去。</span></strong><span>说成功了以后</span><span>，</span><span>不要居在结果上</span><span>。</span><span>只有不居在上面</span><span>，</span><span>才不会去呀</span><span>。</span><span>也就是告诉我们</span><span>：</span><span>不要居在成功上</span><span>。</span><span>进而讲：</span><span>不要居在</span><span>任何一件事情上</span><span>。</span><span>夫唯弗居</span><span>，</span><span>是以弗去</span><span>。</span><span>一旦居了</span><span>，</span><span>就去了</span><span>，</span><span>没有了</span><span>。</span><span>举例</span><span>，</span><span>什么叫居？</span><span>比方说今天中午</span><span>给爱人做了一顿饭</span><span>，</span><span>如果我们居在做饭上</span><span>，</span><span>会不会产生相应的行为啊</span><span>？</span><span>我们认为我中午辛辛苦苦的</span><span>，</span><span>这么热的天给你做了饭</span><span>，</span><span>接下来的行为会是什么</span><span>？</span><span>就希望他多吃一点</span><span>。</span><span>如果他坐那玩手机还不来吃饭</span><span>，我们</span><span>就恨不得把锅扣他头上</span><span>。</span><span>如果他今天中午吃完了饭之后</span><span>，</span><span>下午他什么都没做</span><span>，</span><span>我们就会觉得：这个人怎么回事</span><span>，</span><span>中午那么热我给你做饭了</span><span>，</span><span>下午你什么都不愿干</span><span>。</span><span>当我们居在</span><span>“我</span><span>做了某件事情的成果上</span><span>”，</span><span>接下来的心态和行为</span><span>会不会有相应的变化呀</span><span>？</span><span>所以，夫唯弗居，</span><span>是以弗去</span><span>。</span><span>不要居在任何事情上</span><span>，</span><span>而是当一件事情</span><span>我们做完了之后</span><span>，</span><span>要回到什么状态</span><span>？</span><span>无的状态</span><span>。</span><span>我们在做的时候</span><span>是有的状态</span><span>，</span><span>做完就回到无的状态</span><span>。</span><span>所以注意</span><span>，</span><span>一开始是无的</span><span>，</span><span>做一件事情就是有的</span><span>，</span><span>做完之后呢</span><span>，</span><span>又回到了</span><span>无的状态</span><span>。</span><span>恒无欲也</span><span>，</span><span>以观其妙</span><span>。</span><span>又回到了那个美妙的</span><span>、</span><span>最初始的状态</span><span>。</span><span>第二章的内容</span><span>我们总结几句</span><span>，</span><span>告诉我们：天下万物都是</span><span>对立产生的</span><span>，</span><span>天下皆知美之为美</span><span>，</span><span>所以就有了恶已</span><span>。</span><span>皆之善呢</span><span>，</span><span>所以就有了不善</span><span>。</span><span>进而告诉我们</span><span>：</span><span>它也不是一直对立的</span><span>，</span><span>它也是相互转换的关系。</span><span>美的会变成丑的</span><span>；</span><span>丑的也会变成美的</span><span>；</span><span>对的会变成错的</span><span>；</span><span>错的也会变成对的</span><span>；</span><span>有也会变成无</span><span>；</span><span>无也会变成有</span><span>，</span><span>总是相互转换</span><span>，</span><span>最后又是相辅相成的</span><span>。</span><span>有无才能相生</span><span>，</span><span>难易才能相成</span><span>，</span><span>长短才能相形</span><span>，</span><span>高下才相盈</span><span>，</span><span>音声相和</span><span>，</span><span>先后相随</span><span>。</span><span>所以恒久的是一直在变化</span><span>，</span><span>唯一不变的就是</span><span>“<span>一直在变化</span>”</span><span>。</span><span>圣人知道天下万物都是变化的</span><span>，</span><span>所以居无为之事</span><span>，</span><span>行不言之教</span><span>，</span><span>让万物作</span><span>，</span><span>而自己不开始</span><span>，</span><span>并且是为而弗恃</span><span>，</span><span>成功而弗居</span><span>，</span><span>夫唯弗居</span><span>，</span><span>是以弗去</span><span>。</span></p></div></div>"
  },
  {
    "title": "《道德经》第三章 向下沉不上贤",
    "date": "2025-09-03",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第<strong><span>三</span></strong>章 向下沉不上贤 </span></strong></p><p><strong><span>不上贤，使民不争。不贵难得之货，使民不为盗。不见可欲，使民不乱。</span></strong></p><p><span>让我们的心缓缓地向下沉，向下落，向下扎根……看一个人的状态，去看他的心、<span>看</span>他的情绪、看他的语言、看他的行为，都一样。如果向下沉，这个人就是稳重的、平和的状态。我们发脾气的时候，是向下还是向上？向上，这时候人显得躁动不安。当我们不停地想要做一件事情的时候，是向上还是向下？向上，这时候人的心是浮躁的，进而我们的语言、动作行为，都是浮躁的。我们学道，有一个显著的特点 —— 不停地向下扎根，但是呈现出来的东西是非常少的。如果我们不修道，正好相反。向下扎根的东西很少，但是露在外面的东西很多，这是不稳重的状态。所以人随着经历、智慧、学识、人生经验，拥有得越多的时候，反而越是向下的，没那么多张扬的。当我们越少的时候，就总想显现出来。比如就这么一点钱财，我总想证明自己很有钱；这个事<span>我就</span>占这么一点道理，得理就要不饶人了，一定要证明我是正确的。当我们越想显现出来，越想证明的时候，反而越说明我太少了。因为太少，才要想把它显现出来；当越多的时候，越想把它藏起来啊，不被人看见，不被人发现，这才是好的，叫深藏不露，我们要去找这种感觉。这三天，我们往这一坐，我整个人都是向下沉的，向下扎根的。呈现出来的部分越少越好，就像植物的生长，它的根越深，外面自然呈现，不需要刻意。修道亦如此，不要让我们仅有的那点东西都表现在外。我仅有的那点智慧，仅有的那点情绪，那点喜怒哀乐，那点脾气，都在外面了。我们要把它们通通收起来，向下沉，向内扎根。当我们坐在这里，心是向下沉的，气息也是向下沉的，整个人就开始变得平静了。我们动得就会越来越少。我的心很沉稳，不会胡思乱想；我的气很沉稳，不会心浮气躁。我翻书的每一个动作都很沉稳，不会随意地乱动、乱翻，整个人就静下来了。我们生活当中，总是过于急躁，总是想把有的东西都显现在外面，总是急于去证明一点什么，总是要论一些是非对错。我们学了“<span>道</span>”知道，当我们越是想论一个是非对错，它就会生生不息，衍生的问题就会越来越多。所以我们要懂得把它回到“<span>无</span>”的状态。无名，万物之始也。回到无名、初始的状态，什么都没有。比如说我看这个人有点不太顺眼，这时候怎么办？无名，万物之始也，回到什么？没看他不顺眼之前，这个时候后面的东西就不生起了；说我看这个孩子，越看越烦，控制不住情绪了，这时候怎么办？要回到“无名”的状态 —— 不行，我出去溜达一会儿吧，我到楼下走半个小时，等我心情平和了再回来。有没有避免很多事情的发生啊？这就是无名，就是千万不要顺着那个“<span>有</span>”，否则会变得越来越多。说我看他不顺眼，但人有一特点，越看不顺眼越干嘛？多看他几眼。越是情绪起来了，就到处去找让我不顺的事情，情绪就会积累得越来越大呀。所以我们学道，某种意义上来说，它是反人性的状态，就是我们要往人性的相反的方向去啊。说我越是看他不顺眼，我就越想看，那这个时候要学会什么？不看哦。说我越是静不下来，越是想尽办法让自己安静下来哦；我越是想发脾气的时候，越要学会停止我脾气的生长。当我们反着来，时间长了以后，就会形成一种新的习惯，这个习惯恰好就是道了。比如说我们现在对孩子总是管得很多，导致孩子叛逆，跟我对抗，那相反就是什么？不要去管他呀，当我们养成了不要去管他的习惯，是不是这个阶段的道啊。有的人不一样，说这孩子不太听话，内心比较匮乏，是因为我从来没管过他，所以导致他叛逆、内心缺爱。那这个时候我的相反方向是什么？就是我要多管一管他，多给他一些关心和关爱，时间久了，形成了新的习惯，是不是这个阶段的道啊？好，管着管着，发现一开始挺好管，时间长了又出问题了，那这个时候父母的道是什么？又是不管。所以道，可道也，非恒道也，他是变化的呀。每个不同的阶段的道，都是产生变化的。这里有一个特点，就是我们跟现阶段怎么样？反着来，就是这个阶段的道，叫反也者，道之动也；弱也者，道之用也。我们用这个道理可以解决很多问题的。比如说跟一个人的关系，最近打得过于火热，那就要学会干嘛？稍稍地降降温，冷静一点。说最近跟这个人的关系过于冷淡了，那就要学会干嘛？我要加一点热情主动进去。是不是就找到道了呀。别的事情也如此。说我最近工作太努力了，太努力会怎么样？人会很累，会产生逆反心理、对抗心理。当我们太过努力的时候，要学会让自己放松一点，不要那么累。但是过一段时间发现过于放松了，这时候怎么办？要努力一点，让自己再加把力气。道不是一成不变的，他一直在变，根据自身的情况，根据外界的环境、事物的发展，一直在变，所以叫道，可道也，非恒道也。名，可名也，非恒名也。他不是恒常不变的。第三章的内容<strong><span>不上贤，使民不争。不贵难得之货，使民不为盗。不见可欲，使民不乱。</span></strong>不上贤，什么叫贤？我们说贤德、贤能、上贤，什么意思？去崇尚和追求好的东西，这就叫上贤。不上贤，使民不争。不去追求、不去崇尚好的东西，百姓就不会去争。我们想一想，什么道理？为什么上贤就会去争？比方说我们都觉得应该去读一个好的大学，是不是上贤？这个时候人们都在争着干嘛？去读一个好的大学，但是注意了，当人人都去争这个东西的时候，会不会丢掉了事物本来的样子？再比如说，大家都觉得创业是一件好事情，所以人人都要争着去创业，那其他的工作谁做呢？所有的人都适合创业吗？不是。所有的人都能考上一个好的大学吗？也不是。所以当我们去追逐一个好的东西的时候，实则丢掉的是什么？我们本来的特性，本来的特质。举例，如果每一个杯子都觉得透明是好的，那所有的杯子都想争做透明的杯子。可是有的杯子把自己改造了N年，二十年<span>三十年</span>，发现依然没有办法透明，那毁掉的是什么？这三十年的杯生啊。因为它觉得透明的才是好的，而忘记了有的杯子是透明的，而有的杯子它不透明，所以其实作为杯子的这一生，很简单，是什么样子，就形成什么样的杯子就好了嘛。说我是透明的，那就做玻璃杯子嘛；如果我是保温的，就做保温杯子嘛；如果是黑色的材料，那我就做一个黑色的杯子，也不错呀，这叫百花齐放。那用到人身上同理，有的人从小就给孩子规划了，说将来希望你成为一个什么样的人，这句话本身就错了。错在哪里了？不是我们想让孩子成为什么样的人，而是看他能成为什么样的人，是不是这个道理。《论语》讲：朽木不可雕也，粪土之墙不可圬也。假设我们是一个木匠，首先就要明白一个什么道理啊，是不是需要认识各种材料啊，说这个木头是可以雕刻的，而那个木头是朽木，是不可以雕刻的。作为一个木匠，如果拿着朽木雕了三个月，谁有问题？木匠有问题呀，不懂做木匠最基本的道理。雕了三个月，抱怨朽木不可雕也，这不行啊。说教育孩子，首先我们具备的第一个本领是什么？得认识孩子，知道他是一个什么样的人，他有什么样的特质，然后顺着他的特质去雕，这就叫圣人居无为之事，行不言之教。是无为的，不是不为啊。不是按照我想要的样子去为，而是找到事物本来的特性再去为。但是我们为什么找不到事物本来的样子啊，因为已经有了一个理想当中的样子，有了标准，上贤了。说孩子就一定要变成一个什么样的孩子；爱人一定要成为什么样的爱人；我必须要找一个什么样的员工…… 麻烦了，上贤了。一旦上贤，就会改变事物的本来样子，就会引起纷争不断。我们想让孩子变成什么样的孩子，可是他不是那样的孩子，我们之间会不会起矛盾？冲突来了。<span>我们</span>想让爱人变成什么样的人，但他不是那样的人，我们之间是不是不停地就要干嘛了？纷争啊，不停地产生矛盾啊。所以，当我们具备了道的思维，就知道不上贤，使民不争。不要去追逐贤德的东西，不要去追逐认为好的东西，而是要做什么？回到事物本然的样子，这叫不上贤。有人可能又说：不对啊，不对不对。哪里不对呢？说人想要变得更好，这难道错了吗？不是这个道理，不上贤，不是不让变得更好，而是不要追逐那个更好。比如有的孩子学习好，那他自然就学习好，是不是上贤？不是啊，他本然就这样啊。就像这只杯子，它本然就是透明的，不是它追逐要成为透明的状态。所以，每个事物有它不一样的特质，每个人有不一样的性格，道讲的是道法自然，是回到那个自然的、原本的状态，就是我们常讲的话：让树成为树，让花成为花。而不是我想让他做什么，这就是追逐。</span></p></div></div>"
  },
  {
    "title": "《道德经》第三章 虚其心实其腹",
    "date": "2025-09-08",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第三章 虚其心实其腹（5页）</span></strong></p><p><strong><span>是以圣人之治也，虚其心，实其腹，弱其志，强其骨。恒使民无知无欲也，使夫智不敢，弗为而已，则无不治矣。</span></strong></p><p><span>不贵难得之货，使民不为盗。不去贵难得之货，百姓不为盗。什么叫贵难得之货？就是我去追求贵重的东西。那没有追到的人怎么办呢？就沦为了盗贼。比如说我一定想要开一台好的车子，是不是贵难得之货？这时候人的行为会不会为盗？盗了什么？那有的人可能用信用卡、网贷，有的人可能让父母给钱了，有的人提前透支自己的生活了，这算不算为盗？算。什么叫为盗？就是打乱了正常的生活秩序。比方说，我如果不买那台好的车子，可能生活状态蛮正常的，每到周末带着家人、孩子，可能去哪玩两天。但是如果非要去买那台好的车子，别的地方和生活就会被不停地压缩，有没有被打乱节奏啊？这种行为是不是一种盗？所以我们看生活当中贵的，任何一个难得之货，因为世间万物是相互影响的，这个东西我们消费得多了，会不会影响其他的地方？会。这是我们特别要注意的。生活的节奏，其实讲求的是平稳，就是我非常平稳地去生活。但是人们现在的生活是不是欲望过多呀？总想要好的东西，总想去贵难得之货，结果其他的生活是不是就被打乱节奏啊？当一个地方被打乱节奏，<span>两处、十处跟着乱</span>，<span>最后</span>生活可能就会坍塌，就会出问题。就像一个房子，它本来是平稳的，但是某个地方少了一块，会不会引发相关的问题？然后问题越来越多，最后房倒屋塌。所以我们一定要注意了，生活当中的上贤、贵难得之货，最后都会出现问题。举例，很多人会说：我要倾尽全力让孩子读一个好的学校。这个思维是正确的吗？不是。是不是我们刚才举的例子，最后会不会导致房倒屋塌？一定会的。说我拿出全部的积蓄去买某样东西，最后<span>会不会</span>导致房倒屋塌啊。所以我们学习道，要明白一个道理：任何一件事情，都不能出全力，一旦出全力的时候，接下来就会产生枯竭，时间久了，就会产生毁灭。我们做任何一件事情，要学会有所保留，去做自己力所能及的事情，凡事都要留上那么几分余地，这才是生活之道。这里要注意，不是说不可以买贵的东西，而是要在自己的能力范围之内。说买了这个东西，并不影响我生活的正常运行 —— 好理解哈？别听完了之后说：我贵的一律不许买了。不是，只要不影响正常的生活秩序，就没有问题。可是往往我们做的事情，都是干嘛？影响了正常生活秩序的事情。刚才讲的是贵重的，那还有一种难得之货，是我们现在没有的，就觉得它难得了。有的人说：我从小没有得到过父母的关爱，所以我就想得到父母的认同。当我们想得到父母认同的时候，行为会不会出错？出什么错了？我们把全部的时间和精力都用来干嘛了？在父母面前证明自己，想要获得父母的认同 —— 有没有让我们的生活秩序全部打乱呢？再比如说，我就想让孩子这次考一个好的成绩，那我们把所有的时间和精力都放在这件事情上，自己的生活有没有被打乱？孩子的生活有没有被打乱？都会出问题的呀。所以难得之货，一个是贵重的，一个是我们现在没有的东西。人千万不要盯着自己没有的东西疯狂地追逐，会出问题的。有的人说：我爱人不懂得关心我，所以我就一直想要获得对方的关心。越是想获得对方的关心，行为越出错呀，结果生活变成了一团乱麻。那如何应对呢？<span>用什么样的心态</span>去面对生活当中缺乏的这些东西啊 —— 没有就没有嘛，每个人总有他得不到的东西。我现在没有的东西，可能别人有；那我有的东西，别人可能也没有啊。所以每个人实则都拥有很多，同时其实每个人都缺失很多，没有一个人可以同时拥有所有的东西。所以我们去看这个世界的规律，非常有意思。比如说我们年轻的时候，胃口好啊，能吃能喝，但是好像没那条件吃喝。等有条件吃喝了，吃也吃不了，喝也喝不了了。有的人说：我想出去旅行，可是没钱，有钱的人他没时间，是不是永远都没有完美的状态啊。有的人说：我就羡慕他有闲，他还羡慕你有工作呢。说我就羡慕那人单身，自由自在，他还羡慕你有人陪伴呢。<span>人生本就没有完美状态，得到一样就会失去另一样，失去一样也会得到另一样，<span>得无所得，失无所失，</span>得与失本质上没有区别，不过是平衡罢了。</span>那不上贤，使民不争；不贵难得之货，使民不为盗，是不是就回到事物本来的样子。说我得到什么，自然就得到嘛；我失去什么，自然就失去嘛。说我从小没有得到父母的关爱，那就没得到嘛，少了这个部分，有没有多出一个部分？自立了，独立坚强。那有的人说我从小就得到父母的关爱，父母对我很好，我的生活衣食无忧，注意，我们得到这些，有没有相应的失去，失去什么呢？好像没有那么自由，父母管得多，还有呢？会发现，从小一直到大拥有的很多，现在想要获得幸福难不难？难。因为过去拥有的越多，现在能达到满足你的条件反而就变得越少了。如果我们看懂这个道理，那我从小是得到关爱好，还是没得到好啊？是不是我本来是什么样子的就是好的？得到了也好，没得到也好，那这个时候还要去追逐一定要变成什么样子吗？没有了吧，这叫不上贤，不贵难得之货。不会去向外追逐的，不见可欲，使民不乱，不呈现可以产生欲望的，这样百姓就不乱。我们来体会一个道理，说我们的心，我们的行为，总是很乱。为什么会乱呢？乱从哪里来的？就是我们看见的越多，欲望就越多，是不是心就乱了呀。我们现在的这个时代，可以接触到的、可以看到的是不是太多呀，所以我们的生活就是乱的。我们不停地去向外看，然后看得越多，产生的欲望越多，最后百姓的生活就是乱的呀。举例，现在很多家长都会认为：我得带孩子多出去见见世面，多看看不同的地方。会发现如果他见识了很多以后，回来还能学得下去习吗？因为他心里装的东西已经太多了，有没有分散他的精力啊？所以最后就<span>学不进去</span>了。我们注意啊，一个没有办法做好一件事情的人，有没有一特点？什么特点？他的心怎么样？太乱，太散，装的东西太多。有的人什么都想要，又想吃得好，又想玩得好，又想更轻松一点，还想再追追剧，他还有精力做事情吗？没有。能做成一件事情的人，他的生活是更复杂还是更简单？更简单，因为他满脑子就这一件事情，甚至睡觉做梦都在想，他的心没有那么乱，没那么多欲望，更容易在一件事情上获得结果。所以这句话告诉我们：不要看那么多，不要听那么多，不要让自己看见那么多的欲望，不要让自己的心和行为是乱的。举例，现在很多人说晚上睡不着，其实不是睡不着，是诱惑太多不想睡 —— 一会儿想刷刷视频，一会儿想看看什么东西，一会儿查查明天的天气预报，明天什么天气还影响你睡觉了吗？但我们的心总想看更多、了解更多，最后得出一结论：我睡不着。我们看孩子就好观察了，让他睡觉他就说什么，我睡不着睡不着。说你躺那我陪你玩一会儿，一躺下睡着了，是他睡不着吗？他不想睡，为什么不想睡啊？他还想玩嘛。放到大人身上是不是这样，不是睡不着。有人说：你坐这学习吧。“<span>我听不进去</span>”，不是你听不进去，是你想要的东西有点多，东一下西一下，心就乱了。我们学道，尤其是当下这个时代，要学会变得越来越少。少想一点，少看一点，少听一点，<span>少动<span>一点</span>，少刷手机、少说两句、少吃两口，让身心安静下来，不陷在欲望里，</span>这个时候状态更加清净，更加平和，<span>才能感受到从内在生发的喜悦。</span>整个这三段话，告诉我们不上贤，不贵难得之货，不见可欲，那圣人怎么做呢？<strong><span>是以圣人之治也，虚其心，实其腹，弱其志，强其骨。</span></strong>圣人如何对治呢？虚其心，什么叫虚其心？让自己的心回到虚无的状态，无名，万物之始也；恒无欲也，以观其妙。然后实其腹，什么叫实其腹？简单来讲就是吃饱肚子就可以了，满足最基本的生活需求，多余的东西不需要。那什么叫腹？我们说腹有诗书气自华，什么意思？我们不要向外追逐，而是要填充自己的内在，丰盈自己的内心世界，这叫实其腹。弱其志，强其骨。志向也是向外追求的东西，弱其志就是但凡向外追求的都要学会减弱。强其骨，强大我们的骨。骨也是内在，我们说这个人有风骨，什么叫风骨？有自己的原则，有自己的操守，有自己的信念，有自己为人处事的准则，这都叫骨。我们看这四句，就是我们向外追逐的东西都要减少，减弱，然后要向内，虚其心，实其腹；弱其志，强其骨。<strong>恒使民无知无欲也，使夫智不敢，弗为而已，则无不治矣。</strong>我们恒久地使自己、百姓处在无知无欲的状态，因为我们知道的越多，欲望就越多；知道的越少，欲望也就越少。使夫智不敢，我们使自己和百姓处在无知无欲的状态，即使有智慧，也不敢去为，不敢去用。弗为而已，则无不治矣。那如果智慧不敢为，什么都没做，则无不治矣，没有不能治理的东西。我们看什么道理，越是用智慧，越是向外追逐，产生的问题就越多，就越需要治理。反过来呢，如果使人懂得无知无欲的道理，没有那个智慧敢去做的时候，什么都没为，就不需要去治理啊。我们再来提炼一下，这段话当中有四个字叫无知无欲，我们的生活要保持无知无欲，不光我们的生活，假设现在教育孩子，也要懂得无知无欲。那怎么教育孩子？不要让他有那么多的欲望，不需要让他看那么多，不要让他接触那么多，是不是无知无欲啊？但是注意，往往我们从小都在教给孩子什么？欲望。比方说，“<span>这个衣服是品牌哦，这个价位贵啊</span>”“<span>你知道这牛排多少钱一份吗？</span>”“<span>我给你买这虾都是最好的虾</span>”，我们生活当中是不是这样讲的，不停地在教给孩子什么？这个好那个贵，这个对那个错，所以他就知道了，我吃牛排贵，他跟同学就说什么？我跟你说，昨天我妈领我吃的牛排可贵了；你知道我这个衣服是什么牌子的吗？会发现这个孩子在不知不觉间，欲望已经不停地增长，然后他自己会不会延伸？我们教他的是一个，他延伸出去就变成十个了。“看我这衣服，好看吗？这可是牌子的<span>”</span>“<span>你知道我这双鞋是我爸在哪给我买的吗？</span>” 看，问题出来了。因为人生活在欲望的世界里，而我们还总想证明自己，所以就不停地用欲望的眼光和思维与人相处，然后教育孩子，结果教育出来的孩子问题越来越多。所以我们回到无知无欲的状态，对待自己、与他人相处，都保持无知无欲，这个时候自然就是不上贤，不贵难得之货，不见可欲，然后我们保持虚其心，实其腹；弱其志，强其骨。</span></p></div></div>"
  },
  {
    "title": "《道德经》第四-五章 挫其锐解其纷",
    "date": "2025-09-16",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第四-五章 挫其锐解其纷（7页）</span></strong></p><p><strong><span>道盅，而用之又弗盈也。渊呵，似万物之宗。挫其锐，解其纷，和其光，同其尘。湛呵似或存，吾不知其谁之子也，象帝之先。</span></strong></p><p><strong><span>天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。天地之间，其犹橐籥与？虚而不屈，动而愈出。多闻数穷，不若守于中。</span></strong></p><p><span><strong><span>道盅，而用之又弗盈也。渊呵，似万物之宗。</span></strong>说这个道，他是盅而用之又弗盈也。我们看道的特质，喝一杯水就可以看清楚了。盅是什么？是不是就向杯子里倒啊？那什么时候倒？需要喝的时候或者水少的时候。现在如果水多，就不能再倒了。注意，在它少的时候，在它需要的时候，我们就倒，这就是盅。那道盅而用之又弗盈也，不要倒满。倒这杯水，我们就看到道的规律了。延伸到生活中，比如跟孩子讲话，什么时候讲话？在需要的时候，或者少的时候，是不是才倒啊？并且倒也不要倒满。我们教育孩子怎么教育的？闲着就倒，闲着就倒，不闲着创造闲着倒，所以孩子对抗，有问题吗？就像我们一直往杯子里倒水，杯子就流满地啊，谁让你倒的嘛，非倒非倒，倒它就出来，倒它就出来。注意，我们一旦做得多了，是不是就违反了道的运行规律啊。所以我们去看，每一章都在描述道，但是如果我们认真思考，其实发现每一章都是在讲生活，都是在讲心态，都是在讲我们平时的行为举止，我们平时如何跟他人相处的。所以我们看道的特点，他只有在少的时候、在事物需要的时候，才会盅而用之。但是又弗盈也，没有那么多。那我们跟孩子讲话，什么时候讲？在他需要或者少的时候才讲，但是一下也不会讲那么多，因为讲多了他也吸收不了，最后是不是都浪费啊，都跑到地上去了，所以少讲一点。再比如说，跟爱人之间的相处，如果总是管得很多，总是要求得很多，对他总是唠叨得很多，结果是不是一样的？要出问题的。渊呵，似万物之宗。道，像一个深渊，是万物的宗旨和根本。这句在讲什么？道是深邃的、博大的、宽广的，是可以包容更多的人和事的。当我们有了更加宽广包容的胸怀，会发现很多事情就会化于无形。我们来看一下，烦恼从哪里来？现在想象我们的心像一面湖水，我们的心如果像深渊，生活当中即使有事情发生，就好比一块石头、一个石子，扔到湖水和深渊当中，怎么样？迅速地就会被淹没，沉底了，即使起了那么一点浪花和涟漪，很快就消失不见了。我们的心如果像大海一样宽广，像深渊一样，像一面湖水，那发生的所有的事情，我什么都不用做，是不是就被化于无形？这就是我们内心的这种宽广。当我们有了宽阔的内心，很多事情的发生，就如同没有发生。如果我们的心很小呢？像杯子一样，但凡有一粒石子进来，会怎么样？杯子就打破了。所以，心小的人，是不是天天崩溃啊，一会儿崩溃一会儿崩溃，一天崩好几回。孩子不听话我可崩溃了；爱人还没回来我可崩溃…… 这老崩溃，心怎么样？太小了。但凡有点事情就碎掉了，但凡有点事情就碎掉了。每个人讲课的侧重点不一样，那我们讲课的侧重点在哪里呀？在于修身，在于生活，所以我们讲的每一句道的特质都往哪里延伸？生活当中。就是我通过这句话，通过对道的描述，我能看到自己的什么呢？我在生活当中如何可以把自己变成道啊？这里道讲了两个特质，第一个特质是：盅而用之又弗盈也；第二个特质是：渊呵，似万物之宗。<strong><span>挫其锐，解其纷，和其光，同其尘。</span></strong>道还有什么作用呢？挫其锐，解其纷；和其光，同其尘。道会挫掉那些锐利的、有棱角的，解决掉那些纷纷扰扰，最后达到和其光，同其尘，所以一个人要想合道，就四个字 —— 和光同尘。那如何才能和光同尘？我们需要挫其锐，解其纷，挫掉那些锐利和棱角，解决那些纷纷扰扰，然后才可以和光同尘，<strong><span>湛呵似或存。</span></strong>湛指波光粼粼的若隐若现的状态。说道，是似或存的，就是一会儿有，一会儿没有；一会儿隐，一会儿呈现出来。若有若无，若隐若现。<strong>吾不知其谁之子也，象帝之先。</strong>说我不知道“<span>道</span>”是谁的孩子，但是我知道他在天地之前就已经存在了。第四章很简单，告诉我们道是盅而用之，又弗盈也，像深渊一样是万物之宗，他可以挫其锐，解其纷，达到和其光，同其尘。他是湛</span><span>呵，似或存，若隐若现，若有若无，我不知道他从哪里来，他是谁之子。象帝之先，天地之前就有了道，就有了事物运行的规律。那这个事物的运行规律，这个道是如何运行的呢？</span><strong>天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。</strong><span>天地和圣人是不仁的，没有仁，也没有不仁，所以以万物为刍狗。刍狗是什么？就是用草做成的祭品。学道也好，生活当中也好，要不要学会抓重点？就像这句话的重点在讲天地不仁，但是有的人学《道德经》，就研究这刍狗到底是什么狗。像不像我们的生活呀？说两个人在研究孩子学习的事情，就非抓住他那句话是不是说错了，刚才他什么态度，实则重点在把孩子学习这件事情探讨出来一个结果，但是往往人们在探讨的过程舍本逐末，把最根本的东西丢了，在那研究上对错了。最后又聊到<span>三年前他有哪件事情做得不对</span>，“<span>五年前的事我都没稀罕提</span>”“<span>我怎么就嫁给你呢</span>”“当时我不也是眼睛有毛病吗<span>”</span>…… 从孩子的学习最后聊到身体残疾了，所以往往我们把重点丢了，去拿那个不重要的事情，不停地在这里琢磨，舍掉了根本，追逐末端的东西去了。我们回到这一句，第一句话就是重点。天地不仁，就是没有仁，也没有不仁，他看万物都是一样的，视万物如草芥，没有区别。我们去想一想，为什么天地看万物没有区别呢？举例，换个视角，假设我们是天，转换一下变成老天的思维，这个时候有人找我们说：老天，你帮帮忙吧，我门口有条河，河老淹我，老天你帮帮忙让这河改道吧，那山上有两头猪，你去淹</span><span>猪去别<span>淹</span>我。我们会不会帮他？为什么不帮他，河就不是生命了吗？如果我们是老天，有没有发现在老天的眼中，人也好，河也好，猪也好，都是一样的。你觉得河影响了你的生活，那你就想办法离开这里，换个地方就好了嘛。求老天，老天能为你做什么吗？所以叫自助者天助。其实老天没帮助你，但是你自助了，老天就帮助你了。我从河边搬走了，换了一个地方生活，在这个地方生活得很开心，就会说：感谢老天爷。其实老天爷什么都没做，是因为自己选择了努力。这个道理其实很妙，我们总是把自己看得很高贵，然后把别人看得很低贱，是不是就出问题了？实则我跟别人、跟那棵树、跟那个小河，都是平等的。如果知道我们都是平等的，实则我去改变自己，就好了。《论语》当中孔夫子讲过八个字 —— 获罪于天，无所祷也。就是如果我们得罪了天，去哪里祷告都没用。但是注意了，天会不会被我们得罪啊？不会，就是形容如果我们做了很多错的事情，求谁都没用啊。那反过来说我们要是做对了，谁也不用求。老天不会惩罚，也不会奖励，我们的惩罚和奖励实则都是从哪来的？都是从自己的行为来的。说感谢老天爷帮忙，说我获罪于天了，老天爷惩罚我，其实老天想说：我什么也没干。都是我们自作自受的结果。我们再来看，天地不仁，<span>其实</span>他没有动，没有做任何事情。以万物为刍狗，什么都没做，是万物自己在做。所以我们做了不同的行为，最后自然产生了不同的结果。天是什么都没做的，因为天是不动的。那圣人不仁，以百姓为刍狗，圣人也是不仁的，他看百姓都是一样的状态，没有区别。接下来就解释了为什么天地要不仁。</span><strong>天地之间，其犹橐籥与？</strong><span>说天地之间就好像一个风箱。我们小的时候有没有拉过风箱？不拉动就没风，一拉动就有风，拉得越快风越大，风越大火就越大。</span><strong>虚而不屈。</strong><span>不屈是无穷无尽，虚是什么都没有，天地之间就好像一个风箱，它既是虚的，又是无穷无尽的。</span><strong>动而愈出。多闻数穷，不若守于中。</strong><span>风箱它一面是虚的，一面是无穷无尽的。不动它就是虚的，动起来就是动而愈出，越动就越多，所以多闻数穷，不若守于中。我们越是想多闻，越是数穷啊，就是没有穷尽的时候。所以不如守着中，就是不动的状态。我们再来看，为何天地不仁？如果天地一动，事情就会变得无穷无尽。刚才那个人找老天去帮忙了，说你把河给我改道啊。如果老天改了道，河会不会来找他？“你凭什么改道？”那庄稼也会找他，“<span>你凭什么改道把我淹了</span>”，是不是越动事情就越多呀，没完没了啊，动而愈出啊，多闻数穷，不若守于中。如果我们听懂了天地不仁这段话，是不是就不动了呀。比如说爱人想吵架，就不跟他吵了呀，说“你先酝酿酝酿情绪，我出去溜达一会儿<span>”，</span>走了，剩他自己在屋里酝酿呗，最多我们走了他跟狗吵一顿，骂狗去了，不理就好了。因为一旦跟他吵上，会引发的事情越来越多。这个道理其实非常美妙，如果我们知道动而愈出，知道虚而不屈，所有的事情都是有两面性的，一面是虚的，什么都没有；一面是无穷无尽的。不动就是虚的，动就是愈出，无穷无尽。如果知道这个道理，很多事情我们就不动了。当我们不动的时候，就没有那么多问题产生了，就能保持清净自在的状态啊。所以我们看，其实一个内心越清净、越平和的人，会不会与人计较和争执啊？不会。是不是不动啊？因为动而愈出，我们越动，产生的问题就越多，所以就回到不动的状态。注意，天地不动是不是更高级啊，天地不仁，以万物为刍狗。天地什么都不动，看万物都是一样的、平等的，不为所动，这个时候就保持了虚无的状态，所以人想保持清净、虚无、无为的状态，就要学会不动。</span></p></div></div>"
  },
  {
    "title": "《道德经》第六-八章 不自生能长生",
    "date": "2025-09-16",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第六-八章 不自生能长生（11页）</span></strong></p><p><strong><span>谷神不死，是谓玄牝。玄牝之门，是谓天地之根。绵绵呵若存，用之不勤。</span></strong></p><p><strong><span>天长地久。天地之所以能长且久者，以其不自生也，故能长生。是以圣人退其身而身先，外其身而身存。不以其无私与，故能成其私。</span></strong></p><p><strong><span>上善似水。水善利万物而有静。<strong>居众之所恶，故几于道矣。</strong></span></strong></p><p><span><strong><span>谷神不死，是谓玄牝。玄牝之门，是谓天地之根。绵绵呵若存，用之不勤。</span></strong>第六章把“道”比作“谷神”，这个道好比是谷神，他是不死的。是谓玄牝，牝是母的，可以生育万物。玄牝就是可以一直生育万物。那这个玄牝有一个门，一个根本所在。是谓天地之根，它是天地的根本。那么天地的根本是什么呢？绵绵呵若存，用之不勤。那要想让一件事情生生不息，还有一个根本，这根本就是绵绵若存，用之不勤。是不是用得很少啊？少到什么程度？绵绵若存，就好像有，又好像没有的状态。我们说绵绵细雨，什么感觉？好像下了，又好像没太下的样子。实则下没下？下了，但看不出来它下了，甚至走在雨中，都感受不到它在下雨。我们把这个状态用到人生当中来：要想让一件事情长久，就绵绵若存，用之不勤。动得越少，用得越少，它就越不容易死掉。一旦用得多了，用得勤了，会怎么样？会迅速地枯竭呀。再看道的特质，总在讲“少”。比如我们的话如果少一点，是不是就没有那么得罪人、不惹人生气？就可以更长久一点。如果我们不喜欢逞口舌之利，凡事不与人计较，会不会更长久一点？少发一点脾气，少一点情绪的波动，会不会让自己更长久一点？都会啊。所以第六章的主旨，就是“<span>绵绵若存，用之不勤</span>”，要少用，少动。第五章讲的是不要动，多闻数穷，不若守于中。所以能不动的我们就不动，能少动的就少动，如此就可以长久。第七章继续讲的长久。这个时候老子观察自然了，那自然当中什么最长久？<strong><span>天长地久。天地之所以能长且久者，以其不自生也，故能长生。</span></strong>天地之所以能长且久，为什么呢？这里面有一个道理，以其不自生也，故能长生。我们看天地，因为它不自生，故能长生，什么叫不自生？天地有没有想生？没有，那更不要说为自己而生了。连生都没想，所以它就长生了。我们来体会一下：为什么不想生反而能长生呢？也就是越想生，反而死得越快。什么原理？大家可以回顾自己的人生经历：如今所拥有的、觉得比较好的东西，是不是当时想生的东西？假设说有一个好的儿子或者好的女儿，是自己想象来的吗？怎么来的？不知道怎么来的。比如说现在遇到一段很好的感情，我们很知足，这段感情是我们想象中的样子吗？当时想找一个高大帅气的，想找一个貌美如花的，不都没实现吗？说我们曾经某一个阶段的生意做得很好，是想出来的吗？说提前想了很多：我一定期盼一个什么样的事业，是这样的吗？甚至都没想过，不知道为什么，<span>就</span>把那个事情做好了。在说什么道理？是不是“<span>不自生故能长生</span>”啊？我们去思考，为什么不自生，反而能得到想要的东西？如果总是为了自己生得更好，<span>想要的</span>能不能来？举例，跟一个人谈恋爱，我们每天都在想着：如何让我变得更好。能获得爱情吗？说我每天都在想着“如何让自己更开心、过得更好”时，实则就在伤害对方。他不关心我呀，他也不够爱我呀，他对我不好啊，他对我付出得少啊，有没有发现，我们看到的，都是他做得不好的地方，那我们自己有做过什么没有？比如做生意，越是想着我如何多赚钱的时候，实则是在损害对方。我们想着多赚点，每个产品多加上一点钱，最后别人承受不了，我们还能做得下去吗？我们看这里面的逻辑：当越是想让自己生得更好，就想方设法压榨别人。当我们越是想生得更好，别人就生不好。别人生不好，我们能不能好？我们越是不自生，没想生，没想让自己生得更好，当不想生的时候，就不会去压迫别人，就能踏踏实实地做点事情，结果反而得到了长生。这个逻辑非常简单，但是一旦我们想要什么东西的时候，这个道理就被我们的欲望淹没了，被我们的想要淹没了，最后结果就死得越快。<strong>是以圣人退其身而身先，外其身而身存。</strong>所以<span>圣人知道这个道理，</span>懂得退，就是什么事情我向后退，我没想要，最后反而得到更多。外其身而身存，我把自己放在外面，什么都没想要，最后反而身存，得的更多。<strong>不以其无私与，故能成其私。</strong>这不就是因为圣人是无私的嘛，所以最后反而成就了自己的私。回顾第七章，要想让天长地久，不自生故能长生，退其身而身先，外其身而身存，不以其无私与，故能成其私。翻译过来：越是想要的东西，费尽心力反而得不到。越是没想要的东西，它自己就来了，这就叫不自生，故能长生。无私，故能成其私。第八章给我们讲什么叫上善之道，就是上等的善是什么样子的。<strong><span>上善似水。水善利万物而有静。</span></strong></span><strong>居众之所恶，故几于道矣。</strong><span>上善是一个抽象的概念，怎么去形容上善呢？打个比方，上善似水，像水一样，那水的哪些特点是符合上善的呢？水善利万物而有静。说水是善于利益万物的，并且利益了万物之后，它是有静的，又保持了安静的状态。先看水善利万物。水是善利万物的，为什么？水的特点是改变自己的形态。遇圆就变成圆的，遇方就变成方的，遇到有障碍就换个方向流动，遇热就变成蒸汽了，遇水就结成冰了。水不停地在变换着自己的形态，道是不是不停地在变换着自己的形态，以顺遂万物的生长啊，那我们是不是也要学会这一点呢？我们需要改变自己的形态，改变处世法则，才能迎合、顺遂事物的发展规律。人有一特点，什么特点？不改变自己，总想改变别人。我们教育孩子通常都怎么说？我像你这么大的时候，是不是这样讲啊。我当时上初中的时候，都已经给父母做饭了；我像你这么大的时候，都能洗衣服了。这句话讲出来，就是固执的表现，为什么？因为还在拿过去时代的经验，来要求现在的孩子，那能行吗？行不通啊，都过去好几十年了，道有没有在变化？有。但是我还在固执着过去的生活经验，是不是还没变？这个时候会出问题，矛盾就产生了。所以我们要学习水的特质：改变自己的思维方式，改变自己的形态，然后才可以利益万物。我们也一样，从出生到死亡，有几十年的时光，会经历很多的变化，比如时代的变化、消费观念的变化、生活用度的变化、各种喜好的变化，包括我们自己心态的变化、身体的变化，太多太多了。所以我们要像水一样，随着事物的变化而变化，而不是抱着一个固有的东西不变，这就会产生痛苦和烦恼。水之所以能善利万物，是因为水是善于变化自己而随顺万物的发展，这就叫水善利万物而有静。</span></p></div></div>"
  },
  {
    "title": "《道德经》第八章 居善地心善渊",
    "date": "2025-09-17",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第八章 居善地心善渊（13页）</span></strong></p><p><strong><span>居善地，心善渊，予善天，言善信，政善治，事善能，动善时。夫唯不争，故无尤。</span></strong></p><p><span>水善利万物而有静。什么叫 “有静”？我们来体会一下：比如给孩子做了一顿饭，做完后安安静静地陪孩子坐下吃饭，没有情绪波动，心态稳定，这就叫“有静”。那如果我们做完饭把孩子叫过来，就开始念叨：“我饭都给你做好了，你怎么还没洗手？你坐着能不能好好吃？你能不能快点吃？你慢点，能不能多嚼两口？你能不能喝点水啊？” 这是不是我们的生活常态？我们总是会去说很多话，这是不是“有静” 的状态？没有了。有没有发现，本来做顿饭是好事，结果好事就变成了坏事，因为做完这顿饭产生了诸多的矛盾。跟孩子相处是这样，跟别人相处不也一样吗？</span></p><p><span>我们做一件事，如果不懂“有静”，做完后会不自觉地有所倚仗，就要说很多话了，结果说得越多，指责得越多，最后带来的问题就越多。有静是什么状态啊？不居功，不自傲，做了事情以后不认为自己做了什么，做完之后没有什么想争的，不想去证明自己做的是正确的，这些通通都是。</span></p><p><span>所以这个有静，是很重要的事情。举例：我们但凡做一件事，做的时候是动的，但是动完之后，如果没有一个静在，一定会出问题。比如运动完的人，运动完了之后说话跟平时会不会不一样？哪里不一样？会比平时更亢奋、更生硬，气势会更足，声音不自觉变大，甚至觉得自己能改变世界，感觉自己无所不能了。因为动完之后，没有一个“<span>有静</span>”的状态。再举例：说正在炒菜，夏天很热呀，炒菜的过程满头大汗，然后炒得也很辛苦，这个时候刚做完饭，是动的还是静的？动的。有没有发现这个时候都是汗，觉得很累的时候，有没有看什么都不顺眼？我刚做完饭，看他还在那玩手机，我就恨不得把盘子飞过去，虽然盘子没飞吧，我也得吼他几句。这个时候甚至看见狗都得踢两脚，因为正处在动的状态、亢奋的状态，这个时候所表现出来的就是失常的。—— 看见家人玩手机想吼，甚至看见狗都想踢两脚，这都是没 “静” 下来的缘故，整个人处在失常的亢奋中。</span></p><p><span>所以，有一动，就要有一静。我们要学会这个思维，当做完饭很热，都是汗，这时候先坐下来，扇扇子，擦擦脸，让自己安静下来。当一安静下来，是不是心平气和呀，这个时候再讲话、再做事情，是不是不出错呀。所以这个有静，一定要在动之后。要跟一个什么？静的状态。我们看水善利万物，是不是动了？动完之后呢，静一静。咱们每一节课是不是这样的，我坐下第一件事情，让大家干什么？先保持身心安静。因为刚才可能彼此说话，还很大声，如果我上来就讲，是不是不太容易进得去啊，所以先让大家干嘛？静下来，然后再开始讲。等讲上一个半小时，你也快按捺不住了，我也下课了，然后下一节课重新再保持安静的状态哦，这就是静。所以这个有静，我们真的要去修为的。要养成这样的习惯，就是每动一下，我们就要回到有静；每做一件事情，就要回到有静。看我们的情绪，为什么总是波动得那么大？就是一直在干嘛？动动动…… 越动，是不是就越多呀，没有安静的时候。比方说刚知道了一件事情，这个时候恨不得马上就要去处理，那我们<span>如果</span>懂得静下来一天，再去处理，处理方式会不会有所不同？一定会，这就是静的力量。我们看一个人，当足够有智慧和包容性的时候，遇事情不会着急去解决，而是要学会先安静下来，消化一下再解决。</span></p><p><span>去年去唐山，我们从沈阳到唐山，唐山的下一站是北京，这里面发生一个小事情，可以给大家聊一聊，蛮有意思的。当时在唐山马上要开课了，那时候跟逢阳他们聊天，逢阳说：大贝不行啊。我说：不行怎么办呢？要不把他换掉啊？逢阳说：那行。我说：好，听你的，把他换掉，那你觉得换谁比较合适呢？他说：我觉得要不就换赵阳吧。我说：行。那唐山马上要开课了，我现在马上让他回去换人呢，还是讲完唐山再换呢？他说：那这时候换不太好吧，等讲完唐山站再换吧。我说：行。然后唐山站讲完了。我说：是现在让他从唐山回去呢？还是我们到北京以后再换呢？他说：到北京吧。我说：好。到北京我问他，说：现在还用换吗？他说不用了。有没有发现，在这个过程，内心已经逐渐地开始变平静了。就像孩子犯错，恨不得<span>当下就</span>揍他，后来别人劝我们：明天再打好不好，明天是黄道吉日，适合打孩子。我们一听，行啊，明天再打吧。结果明天他说：你今天有事情在忙，你忙完这个事再打他。那行，我再忍一天。后天我们还想打他吗？算了吧。看，因为在这个过程，已经静下来了，内心已经开始平复下来了。当内心安静下来的时候，再看那个事情，变得不一样了。</span></p><p><span>所以往往人做事情，是不是叫冲动啊。一冲就怎么样？动了。只要我们一静下来，就安住了，就没问题了。所以遇事后第一件事情，不是去解决事情，而是要干嘛？让自己保持安静哦。当我们保持安静，所有的事情会发生变化。上善之道的第一句话就是善利万物而有静，居众之所恶，故几于道矣。说水可以居在众之所恶，就是大家都不喜欢的讨厌的地方。故几于道矣，所以它就接近了道的状态。我们来体会，水有没有好恶之分？没有。它会不会觉得低处是不好的呀？没有。它会不会嫌弃衣物太脏？都没有。所以如何才能居众之所恶？没有好恶之分。别人觉得恶，但是我并不觉得恶，才能居在上面。也就是当一个人懂得上善之道，没有那么多好恶，对事情没有那么多分别，这个时候才能居众之所恶，接近于道的状态。</span></p><p><span>综上，上善之道有三个特点。第一个特点：善利万物。第二个特点：在利了万物之后，保持的是有静。第三个特点：没有好恶之分，才可以居众之所恶。那如何达到这种上善之道呢？老子给出了步骤。</span></p><p><strong><span><span>居善地，心善渊。</span></span></strong><span>让我们的身体和行为居在善地，让我们的心处在善渊。积水成渊，就是我们的身体，我们的行为，我们的内心都是处在善上面，时间久了就变成了渊，就会越积累越多。<strong><span>予善天。</span></strong>当我们的心、身体和行为都是善的，积累得足够多，自然就学会了给予和付出，并且像天一样广博。<strong><span>言善信。</span></strong><span>我们的</span>行为、心念都是善的，我们学会了给予和付出，讲出来的话别人自然就是相信的，为什么呀？因为符合了善道，自然可以取信于人。<strong><span>政善治</span></strong><span>。</span>有了前面的积累，我们的每一个政令，下的每一个决定，自然都是对他人有利的。<strong>事善能。</strong>这时做事情就能成了。怎么成的？不是靠自己的能力，而是靠上善之道。当我们的行为是善的，心是善的，言语是善的，每一个想法和决定都是善的，这个时候做事情，自然就能成，是道在推动它成。我们回顾上一章，“不自生，故能长生；无私，故能成其私”，我们没有想自生，只是符合了上善之道，然后事善能，道自然会帮忙推动事情做成。不是靠自己的能力，不是靠自己想要，而是靠道的推动。我们看，在整个人生当中，只要我们做的事情是对他人有益的，会发现这个事情就<span>很容易</span>做成，因为不是只有你一个人在努力，背后有道在推动它。好的文化为什么可以传承几千年？就是因为对人有益，不需要刻意推广，几千年依然还在流行，还在被人学习，这就是善道的力量。这一章承接了上一章的内容。上一章告诉我们：无私，故能成其私。不自生，故能长生。那什么叫不自生，故能长生？就是上善之道。怎么做呢？居善地，心善渊，予善天，言善信，政善治，事善能，这个时候我们做事情可以成，是道的推动。<strong><span>动善时。</span></strong>做任何事都要讲究时机，时机很重要，即使我们想去帮助一个人，也要讲时机，在对方需要的时候再去帮助他，时机对了，才能产生力量。所以天下的事物，无论做什么，都要讲究动善时。</span></p><p><strong><span>夫唯不争，故无尤。</span></strong><span>所以我们知道只有不争，才没有忧愁。</span><span>一旦争了，还能不能居善地呀？不能了吧，被欲望支配了。如果一争，还能心善渊吗？不能了吧。如果一争，还能保持有静吗？如果一争，还能不能动善时？人一争的时候，还会等待时机吗？什么都不会。所以一争，就把上善之道丢了，然后忧愁就来了。<span>所以，夫唯不争 ，故无尤。</span>只有不争，才能守住善道，才会没有忧愁。</span></p></div></div>"
  },
  {
    "title": "《道德经》第八章 像天地像大海",
    "date": "2025-09-23",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第八章 像天地像大海 （13页）</span></strong></p><p><strong><span>此讲为延伸。</span></strong></p><p><span>我们讲过 “天地不仁”“天长地久”。天地高不高远？我们也高远。从根本上讲，我们和天地没有差别，和圣人也没有差别。正如孟子所言：\"人人皆可为尧舜\"。人人都是圣人，人人都与天地同在，没有任何差别。刚才这段话，大家认同吗？认同，那就没区别了嘛。我们坐在这里，就可以感受一下：我们就是天地。以这样的思维来看待问题，是不是第一节课讲的“<span>高贵</span>”？我们和天地一样高贵，没有任何区别。所以我们要学会看到自己的那个根本状态，也就是道，就是天地，就是与圣人无二，没有差别哦，都是一样的。有人可能说：不对呀，既然都是一样的，可是呈现出来怎么差别这么大呀？那是因为我们还没有找到那个根本状态，还没有回去而已。大家的起点都是一样的，终点也是一样的，只是我们迷失在路上了，所以看到的不一样。我们此时此刻，把自己放空，坐在这里感受：我就是大海，辽阔而广博；<span>我就像天，</span>像天地一样高远；我就像大地，可以承载<span>万物</span>、包容万物；我就像那一片草原，让万物自由生长，这就是我的状态，可以变成任何一种形态，变成任何一种样子。我坐在这里的这一刻，原来我内心可以如此平和，可以如此安静；原来我的头脑可以如此清净；原来我的心可以不滞于物，像大海，像深渊，像湖水，像大地，像天空一样。我们无所不在，可以成为任何一种形态，可以不受任何束缚和限制，可以如此地辽阔和高远，这就是“<span>道</span>”，也是我们本然的状态。当我们坐在这里的时候，就深深地爱上了自己。我看到自己身上的任何一个特点都是好的，都是当下该呈现的样子。就像大树，它在作为树苗的时候，也很好啊；那长歪了，歪脖树也很好啊；当它开出花朵的时候，很美丽啊；当它结出果实的时候，硕果累累，<span>很好啊</span>；当结完果实树叶掉落的时候，也很好啊，自有一种孤寂之美；当它有一天被砍倒了，倒了也很好啊；被劈成柴火烧了，烧了也很好啊；烧完化为灰尘了，化为灰尘也很好，又回到天地之中去了。任何一种状态都是好的，任何一种形态都是美妙的，我们要用这样的思维来看待自己，来看待每一个人，都是好的，这就是道。世间万物<span>本来</span>都是美好的，像天地一样，像花草树木一样，像大海，像山谷，像草原，像湖水。我们也一样哦，可以保持平静而美好，淡然而喜悦，本来就是具足的，我们本来就拥有，只不过被欲望掩盖了，迷失在路上了，看不到本真的样子，被外面的世界所束缚了。修道的人境界是高远的，不是因为他拥有了什么，而是内在精神世界达到了，我们叫悟道了。庄子的生活其实是比较贫困的，但是不影响他的境界是高远的。庄子往那一坐，讲庄周梦蝶了；往那一坐，就描述道了 —— 北冥有鱼，其名为鲲。鲲之大，不知其几千里也。化而为鸟，其名为鹏，其翼若垂天之云……一个人坐在这里，就天上地下的。一会儿北冥，一会儿飞到天上去，最后又向南冥飞去，乘六月之息，与天地精神共往来，这就是内在的意境。颜回一箪食，一瓢饮，居陋巷，人不堪其忧，回不改其乐。别人觉得是忧愁的事情，但是颜回 \"不改其乐\"，没有改变本来的乐。其实每个人都是这个样子的，只不过我们一向外看，就把本来拥有的东西丢掉了。我们这三天一边学习道，一边要找回自己。往这一坐的时候，要找回我们的清净，找回我们的美妙，找回我们本然的从容。往这一坐，我看自己哪里都好。看<span>看</span>我这稀稀拉拉的头发，多好。虽然有的时候它像蒲公英一样，一吹就散了，那也挺好；看看我这微起的肚子，每次上课和下课都得扶着它点，要不这块不好进来，那也不耽误它好啊。当我们懂得欣赏自己，整个人就变得更从容一些，不会那么挑剔和指责自己。同样，当我们懂得这样欣赏自己，也就懂得这样欣赏他人，我们看一切都是平和的状态。一个总看自己不顺眼的人，看别人能顺眼吗？也不顺眼。我们挑剔自己，同时也在挑剔他人。所以我们要学会爱上自己，欣赏自己。每个人<span>身上</span>本然都有道的特质，只是我们把它丢掉了，我们自己迷路了。所以我们这三天通过道的描述，通过道的特质，不停地找回自己。此时此刻，往这一坐，我们可以清楚地看见自己的双手摆放在什么位置，无论摆放在哪里，都是那么舒适；双手插兜，挺酷的；手摆放在桌子上，挺从容的；<span>手</span>放在双腿上，挺和谐 —— 在哪里都很好。说看到我的双腿很正，或互相交叉，或者它们两个比较顽皮，都很好啊。无论我们放在哪里，什么状态，都是和谐美妙的。我能看到双脚，甚至能闻到它的味道，还挺好闻的，自有一种独特的气质在 —— 当我们懂得欣赏自己的时候，会发现我们的心情很好，内心很愉悦。假设我现在袜子上漏了个洞，脚趾头还总出来，别说，还挺凉快。它不是让我们自卑的理由，我们<span>一样</span>可以很从容；说我衣服有点污渍，还挺好看的，作为点缀了。当我们内心是美好从容的，会不会因为某一件衣服、一双袜子，或者某一个事情没有做好，而自己闷闷不乐？不会。无论呈现什么样子，都很好啊。当我们内在是从容、自信的时候，不会被这些东西所影响，依然保持我们的从容和乐观，这就是道。如果我们还被外面的世界所影响，还被某一个东西的好坏所限定，总被他人的评价或者别人的眼神所伤害，<span>那是因为内在还没有达到。</span>其实我就是我，我无需受他人影响，我不会比任何人低一等，也不会比任何人高一等 —— 我们本质上都是平等的。甚至我看天地，看圣人，与我没有什么差别，大家的本质都是一样的。当还不一样的时候，只是我还没有找到本质，我还没有找到那个玄之又玄的众妙之门，当我找到了，都是一样的，无差别。我们要学会欣赏自己，去寻找自己。遵循道的足迹、道的特质、道的特征，去找回那个久违的自己，本来就是圆满当中状态的那个自己。这种平静和喜悦，是我们可以感受到的。我们这三天，能不能记住什么，不重要。说“<span>我听了三天，老师讲的话一句没记住，就记住我这脚还挺好闻的</span>”，够了，这一句就够了。说“<span>我连这句也没记住</span>”，那也够了。我们某一刻的感受，体会到的东西是真实的。某一刻我突然觉得好放松；某一刻我内心好喜悦；某一刻我突然明白了，什么事情都不叫事情，那一刻释然了；<span>我听了两天，发现心态变平和了，不再那样暴躁了，不像过去那样动不动就挑剔和指责了；</span>这是我们从道上有所收获。所以，我讲了什么，不重要，重要的是我们感受到了什么、体验到了什么，这是最重要的。我们坐在这里三天，突然某一个瞬间，好像觉得这个空间内只有我自己，没有他人的存在，了无一物。这一刻的感受，对我们来讲很重要，因为我们突然明白了：其实无论我身边有多少人，最后剩下的，实则只有我自己；无论我生活在多么嘈杂的环境当中，实则我能保持的也只有我自己。这三天我们所有感受、体验到的东西，都是我们自己的收获，所以我们不需要刻意，不需要记得那么多东西，也不需要用力地非要听懂什么，都不需要。就这样淡淡地坐着，静静地感受着，感受某一刻的美好，某一刻的平静，某一刻的辽阔和踏实。当这些美好的感受注入我们的生命当中，我们整个人的身心，会自然发生变化……</span></p></div></div>"
  },
  {
    "title": "《道德经》第九-十章 身心合二为一",
    "date": "2025-09-23",
    "html": "<div class=\"B1_text\"><div><p><strong><span>第九-十章 身心合二为一（15页）</span></strong></p><p><strong><span>第九章  </span></strong><strong><span>持而盈之，不若其已。揣而锐之，不可长保也。金玉盈室，莫之守也。贵富而骄，自遗咎也。功遂身退，天之道也。</span></strong></p><p><strong><span>第十章  </span></strong><strong><span>载营魄抱一，能毋离乎？抟气至柔，能婴儿乎？涤除玄鉴，能毋疵乎？</span></strong></p><p><span>什么叫不争啊？如何才可以做到不争呢？我们看第九章的内容。<strong><span>持而盈之，不若其已。</span></strong>持：端着、拿着。盈之：总想要得更多，倒得更满。与其端着，想要得更多，不如适可而止，现在就很好，够用了。这是两种心态。有的人总想要得更多，是不是一直活在得不到满足的状态啊？而反过来，还有一种人，永远都觉得知足：我这很好啦。我们看有的人的思维，人家说：“我们这工资也不高。” 他说：“挺好啦，虽然工资不高，但工作清闲，没有那么多事，我还有时间自己读读书，周末还能出去玩一玩，很好了。” 有没有发现，这样的人很幸福啊？所以，如果<span>我们</span>总想“持而盈之”，是不是就会不停地去争啊？总想争得更多，总想要得更多。这个时候丢掉的是什么？丢掉的是上善之道，还有丢掉了自己原本平静的生活状态，丢掉了现在。其实拥有很多幸福，是不是都没有了？当我们一争，就丢掉了很多东西，所以叫持而盈之，不若其已。与其总想要得更多，不如保持现在的状态就很好。<strong><span>揣而锐之，不可长保也。</span></strong>如果我们总想要得更多，就要揣而锐之了。揣：敲击、敲打。我们需要不停地敲打自己，让自己变得尖锐，结果不可长保也。越是尖锐的东西，越是不可长保的。所以，一个人不能过度地努力，不能过度地追逐，不能过度地想要得更多。因为要得越多，就越需要不停地敲打自己，让自己变得尖锐，结果就是不可常保也，不是长久之道。<strong><span>金玉盈室，莫之守也。</span></strong>并且，即使追到的东西堆满整个房间，结果也是莫之守也，最后守不住。追到再多的东西，能不能守得住？越守，是不是越犯错呀？举例啦，有的人想守住感情，能不能守得住？越想守，做的行为会不会越多？管的和要求的会不会越多？越想守，反而丢掉得越快。所以告诉我们：世间万物，即使“金玉盈室”，也 “莫之守也”—— 守不住。那怎么办呢？守不住就放手嘛，不要去守就好了。当我们不守的时候，反而是更平稳的时候。举例，说好不容易碰到一个优秀的员工，“我可不能让他走了。” 当有这种想法的时候，接下来会干什么？我给他涨涨工资吧；跟他签个合同吧；给他点分红吧；每天总看着他点吧，动不动拿话敲打敲打他。我们要是不做这些，本来还挺好的。当做完这些，他可能跑得更快了，出的问题会更多。所以，越是想守，做的动作就越多，失去的也就越快。<strong><span>贵富而骄，自遗咎也。</span></strong>当我们不停地向外追逐，拥有了以后，就会产生贵富的心理。一旦有贵富的心理，就骄傲自满了，最后自遗咎也，反而给自己留下了更多的过错。我们来看这个状态，什么叫贵富而骄？当我们认为拥有什么，是不是都是贵富？会不会骄傲？比如说， “我这个人能力很强”，会不会骄傲？“我这个人认知比他高”，会不会骄傲？会吧。“我这个人工作能力更好”，有没有骄傲在？“我这个人比你有学问多了”，有没有骄傲在？当产生这些贵富而骄，会不会犯更多的过错呀？我们的言语之间有没有伤害他人呢？我们的行为、眼神、姿态，是否伤害到他人？这叫自遗咎也。当我们产生这种心理的时候，只会给自己带来更多的过错。<strong><span>功遂身退，天之道也。</span></strong>所以我们要学会什么？功成身退。就是成功了以后，我们要学会退，这个叫 “天之道也”。是不是不居那个功啊？不要那个结果呀？不争那个果实啊？这是天道的规律。我们体会一下，如果我们去争，犯的过错<span>就会</span>越来越多；如果我们懂得向后退，是符合天道的，是符合上善之道的，符合“不自生，故能长生”，符合“无私，故能成其私”。举例来体会一下，当我们做好一件事情，懂得向后退，是什么样的感受啊？比如说在家里做了一顿饭，做完饭之后，我也没有什么情绪，也没有什么脾气，也不认为我付出了什么。这个时候别人会不会看到我们的付出？会。但是如果我们一争，一想证明点什么，越想守住自己的功劳，我们的功劳还有没有了？夫唯弗居，是以弗去。我们不居，它就不去。我们一居，它就去了。再举例，假设朋友家里有事情，我们去帮忙了，帮完之后，说人家也挺忙的，这个时候我们悄然离去了，首先洒不洒脱？是不是又洒脱又自在啊？然后我们走了之后，发现，我们就一直留在他心中了，是不是这样的？是以圣人退其身而身先，外其身而身存。因为我们退了，把自己放在外面了，反而我们存住了。可是如果我们一直在那等着呢？一直认为自己付出了很多，我们总跟朋友说，总上他面前擦汗，还有没有功劳？他就想：我知道你出汗了，至于这么擦吗？还上我面前擦，再有事我可不找你了。我们其实挺辛苦的，满头大汗，但是他心里反而对我们留下了一个不好的印象。</span><span>所以，一个争，一个退，结果截然不同。</span><span>我们不懂 “道” 时，总以为争才能得到更多；真正懂 “道” 后才明白，功成身退，才是天道。</span><span>因此，我们无需与任何人争。反而应在事情成功后，主动向后退一步。</span></p><p><span>那我们再来看第九章，整个告诉我们，不要持而盈之，与其持而盈之，不若其已。因为只要我们想要得更多，就会揣而锐之，结果不可长保也。即使我们追到很多，又能如何呢？金玉盈室，莫之守也，不光守不住，贵富而骄，还要自遗咎也。所以功遂身退，是天之道。那退到什么程度呢？就到了第十章的内容，退到只有我们自己的身心，没有了天下万物。<strong><span>载营魄抱一，能毋离乎？</span></strong>营和魄，营是精神，魄是身体。说我们的精神和身体可以抱一而不分离吗？能不能做得到啊？有没有做到的时候？什么时候？睡觉，不一定哦。有的人睡觉还分离呢，人在这躺着，心不知道跑哪去了，精神早都已经飘远了。什么时候是抱一的时候？说我们专注在当下的时候，就是抱一的时候。<span>然而，</span>我们抱一的时候太少了。我们吃饭的时候，都想要干嘛？刷刷手机、看看电视、追追剧，现在流行叫电子榨菜。我们上班的时候，总想干嘛？查查周末去哪玩、下班以后吃什么、我快递到哪了、偷偷刷会儿网看一会儿什么东西…… 我们的工作能干好吗？干不好。甚至我们跟爱人拥抱的时候，都在想什么？明天还得加班呢。所以我们就没有办法感受到生命的美妙。注意，我们上一段讲了“<span>持而盈之，不若其已</span>”，告诉我们“<span>夫唯不争，故无尤</span>”，我们为什么总是身心分离？我们在干嘛？总想要得更多。<span>吃</span>饭的时候还要看点东西；上班的时候还要顺便干点别的事情；拥抱的时候都得想一会儿别的问题 —— 我们在不停地去争，总想要得更多，所以就会让我们的身心分离。我们说向后退，退到哪里？身心合一。所以我吃饭的时候，就静静地吃饭，尝每一口美食；走路的时候，就静静地感受脚下的每一步。这个时候就是很美好的。我们来体会，比如说到每一个城市，通常有时间我会带他们几个走一走，比如这次来天津，我们又去到那个海河，我就静静地走，隆荷就静静地拍，其实我们两个人都是沉浸其中的。我沉浸在哪里呀？风景之中，走路之中。隆荷沉浸在哪呀？拍我之中，这个过程其实非常美妙。所以隆荷做出来的视频看上去就会觉得很美好啊，美好在哪里？是因为那一刻心无杂念、心无旁骛，我们的身心是合一的。如果我们不合一，走起路就像要偷东西一样，因为心已经跑掉了。想一想，如果我们一边走路，一边在想事情，出现的画面美不美好？不美好。如果我们一边跟人聊天，一边在玩手机，美好吗？一点都不美好。因为什么？我们的身心不合一，就是我们总想干很多事情，当我们想干的事情越多，实则我们离道就越远。比方说坐在这里听课，如果我们的身心可以放松、放空，其他的事情都不做，也没有什么杂念，我们就沉浸其中，自然就是美好的。如果这个时候我们的身心是分离的，身体坐在这，心早回家了或者去干别的事情了。比如人在天津，心去北京旅游了，我们就不美好了。所以这种美好不在外面的世界，不是我们向外去追逐，而是干嘛？向内，让我的营魄抱一，让我的身心合二为一，它们两个是不分离的状态，这就是美好的。<strong><span>抟气至柔，能婴儿乎？</span></strong>抟：聚集。我们聚集起来的气可以像婴儿一样吗？我们看婴儿的气，是不是柔软的、平顺的？我们来体会啊，人<span>的气</span>什么时候是至柔的？是不是我们身心安静的时候气就是至柔的呀？比方说我们坐在这里，我的身心都在这一件事情上，我们去感受自己散发的气，是不是柔和的？是吧。再比方说陪孩子玩，如果我们非常专注地陪孩子玩，气是不是平和的？是吧。假设我们现在一边陪孩子玩，一边在处理工作，这时候气还柔和吗？孩子过来跟我们说话，“<span>去去去，一边去儿<span>”，</span></span>对吧。我们的气<span>不自觉地</span>就很冲撞，很暴躁。为什么？因为我们的身心这一刻是分离的状态。比如跟爱人一起吃饭，如果这个时候我的身心都在对方身上，我们说话是不是柔情似水啊？吃什么都好吃，香、甜、美好。如果这个时候我们的心里在想着别的事情呢？甚至在想着别的人，我们发现他吃饭吧嗒嘴，坐椅子也不好好坐，喝个水还那么大声音，有没有发现全是嫌弃的状态？因为我们的心怎么样？跑掉了。我们的心一跑，气就不柔和了。所以当我们的身心合一的时候，抟气自然就是是柔的，像婴儿一般的。<strong><span>涤除玄鉴，能毋疵乎？</span></strong>涤除玄鉴，扫除、洗涤我们心，这个时候可以没有任何瑕疵吗？这三段话实则讲的是一件事情。当我们的营魄抱一的时候，自然就是抟气至柔的，自然就是涤除玄鉴，而没有任何的瑕疵，干净、纯净、没有杂染。那什么叫没有瑕疵？就是当下的这件事情没有任何杂质。比方说杯子，什么叫瑕疵？说这个地方有个黑点。再举例，说我们正在读报纸，这时念头总是乱飞，对于读报纸这件事情，这就叫什么？瑕疵。因为它不属于当下的这件事情。以这个道理来看，有没有发现我们生活当中充满了瑕疵？到处都是问题。吃饭的时候我们想着工作，工作的时候我们又想着吃饭；活到现在又去担心未来，到未来我们又去回顾过去。我们一直生活在这样的状态当中，是不是我们的身心就不能合一啊？我们的气就不能至柔啊，我们的内心就不能纯净。所以这三句话，告诉我们如何修为自己 —— 营魄抱一，抟气至柔，涤除玄鉴。修为自己的方式不在外面，而在我们的身心合二为一。当我们的营魄抱一的时候，我们的心和身体在一起的时候，这就是最好修为自己、滋养自己的方式。很多同学说线下课《道德经》听了很多次了，为什么还会喜欢听呢？就是因为这三天可以让我们找到美妙的状态啊。这种美妙是从哪里来的？是通过我们听《道德经》的过程，让自己的身心合二为一，这一刻我们的身心是清净的，是自在的，是平和的。我们的心和身体这三天是在一起的，就感受到了那种美妙的状态。所以这种美妙，是通过我们的身心抱一而产生的。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十-十一章 有为利无为用",
    "date": "2025-10-08",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十-十一章 </strong></span><strong><span>有为利无为用</span></strong><strong>（16页）</strong></p><p><span><strong>第十章 爱民治国，能毋以智乎？天门启阖，能为雌乎？明白四达，能毋以知乎？生之畜之，生而弗有，长而弗宰也，是谓玄德。</strong></span></p><p><span><strong>第十一章 卅辐同一毂，当其无，有车之用也。埏埴为器，当其无，有埴器之用也。凿户牖，当其无，有室之用也。故有之以为利，无之以为用。</strong></span></p><p><span><strong>爱民治国，能毋以智乎？</strong>说爱百姓、治理国家，可以不用智慧吗？那不用智慧用什么呀？爱民治国，只用爱就可以了，这就叫没有任何的瑕疵，把一件事情变得极其简单。爱民治国，不需要那么多智慧，不要用那么多方法，只要懂得爱就可以了。<strong>天门启阖，能为雌乎？</strong>启阖：开启和关闭。天门：跟外界相交相感的器官。比如说眼睛、耳朵、鼻子、嘴巴，还有身体，这些都是我们跟外界产生交感的器官。那我们这些感官开启和关闭，可以视为雌的吗？雌对应的是雄，雄代表什么？主动的、强大的、处上的、多的、大的。那雌<span>代表什么？</span>被动的、弱的、处下的、小的、少的。<span>我们来体会一下：天门的启阖</span>可以是被动的吗？可以是少的吗？可以是小的吗？可以是柔弱的吗？那被动的、小的、柔弱的有什么妙处？轻松，还有没那么多消耗。举例，<span>我们中午吃的盒饭，人家炒什么我们就吃什么。</span>妙处在哪？我不需要<span>消耗</span><span>任何精力</span>，到时间了我就吃，吃完了我就休息。那如果不让人家准备这饭，我们会不会消耗很多？十一点半下课，十一点可能就要合计：中午吃什么？我自己去还是找两个同学一起去？我就需要找到底吃这家还是那家呀，这家看着还行，但是评论好像不怎么样，上那家评论倒是挺好，但是有点远…… 这个过程有没有消耗很多？注意，这只是一件事情，那如果生活当中每件事情都这么消耗，我们就知道为什么活得那么累了。因为我们总想更好，总想更主动，总想更多，就消耗更大。反之，我们如果是被动的、是小的、是少的，我们的消耗就变得很少，这就是为雌的特点。体会一下这个道理：当我们没有那么多欲望以后，自然就是这样的。当欲望变得越来越少，会发现我们非常容易得到满足，这样也行，那样也行；有这个就吃这个，没有就吃那个，其实挺好的。<span>这就是 “雌” 的状态，是被动、柔弱、微小的状态。</span><span>可一旦人想要的更多，还能保持 “为雌” 吗？</span><span>总想要追求更好，还能保持被动吗？</span>是不是都丢掉了？<strong>明白四达，能毋以知乎？</strong><span>想明白四达，能不能不通过 “知道”？如果不通过 “知道”，又要通过什么？</span>通过知道外面的事情，可以明白四达吗？不可以。<span>那要通过什么才能知道？</span><span>要通过我们内在的清净，通过内在的营魄抱一，通过我们内在的平和。</span>注意，<span>“道” 不是</span>从外面来的，外面来的是现象，是我们通过外面的现象，<span>借助自身内在的清净，</span>所以明白四达，能毋以知乎。<span>要想明白四达，不必通过对外界的 “知道”，而是要依靠内在的营魄抱一、身心清净，这样才能真正明白四达。</span><span>我们回头看前三段话，</span>告诉我们<span>该</span>如何修为自己<span>：营魄抱一、抟气至柔、涤除玄鉴。</span><span>之后该如何运用这些修为？被动地去用。</span>爱民治国，不需要用智慧；天门启阖，不要用强，不要主动，不想争那么多，反而是被动的、少一点、小一点、懂得柔弱的。明白四达也不用通过外界，而是通过内在的宁静。所以，修为自己，保持营魄抱一。对外用的时候，也是被动的、用弱的。<strong>生之畜之，生而弗有，长而弗宰也，是谓玄德。</strong>说我们什么都没做，保持营魄抱一，保持内在的清净，<span>连天门启阖也处于被动状态时，</span>生之畜之，从哪里生？是不是道给我们生的呀？当我们符合了道的时候，道就会帮我们生之畜之。我们来体会：当我们身心合一地做一件事情，那件事情会不会有结果？会。是不是我们求来的？不是。道给我们生之畜之。这个时候生而弗有，长而弗宰也，在生长的过程，我们不要据为己有，不要去主宰。是谓玄德，这个是很深的德行。因为是道生的，道为何会生？因为我们什么都没想要，只是营魄抱一，只是符合了道，所以道就给我们生了。如果我们想据为己有，想要去主宰，是不是背离了道？所以生而弗有，长而弗宰也，是谓玄德。要想有很深远的德行，我们懂得不要去据为己有，不要去主宰万物的生长，这个就叫玄德。我们看十一章，这一章主要讲最后两句。<strong>有之以为利，无之以为用。</strong>有的是利，也就是条件、土壤、具备的因素。但是有了条件、土壤和具备的因素，真正产生作用的是无，无之以为用。我们来看三个例子。<strong>卅辐同一毂，当其无，有车之用也。</strong>我们小时候骑过自行车，中间空的那个叫轮毂，插在里面的叫辐条。说辐条插在轮毂当中，因为轮毂是空的，当其无，有车之用也。第二个例子更简单。<strong>埏埴为器，当其无，有埴器之用也。</strong>我们用的这个杯子，就叫器具。<span>正因为杯子中间是空的（当其无），它才能发挥作为容器的用途（有埴器之用）。</span>注意啦，有之以为利，无之以为用。外面有的，这叫条件，具备的环境、土壤、因素。因为有了这些条件，让我们产生作用的是什么？无之以为用，中间是空的。<strong>凿户牖，当其无，有室之用也。</strong>户牖，一个门，一个窗户。说凿开了门和窗户。当其无，有室之用也。中间是空的，所以可以作为房间。就像这个讲堂，有门，有窗，中间是空的，有室之用也。<span>我们来体会一下：如果这个房间堆满杂物，</span>还能不能用？没法用了。堆的杂物越多，<span>可</span>用的空间就越少；里面的东西越少，<span>可</span>用的空间就越大。杯子也是如此，中间是空的，就有用。如果它装满水，还能用吗？装一半，<span>只剩</span>一半的用途。我们看这一章，在讲什么道理啊？<span>其实是说我们总做不到清空自己、放空自己。</span>一个人知道的越多，反而用途越少，是不是这样？举例，一个企业当中，如果一个员工资历很老，其实还挺可怕的一件事情，可怕在哪？他知道的太多了。知道的越多，是不是他就越不空？他的心里堆满了过去的东西，堆满了过去的经验，他还能不能更好地工作？其实很难。再举例子，但凡一个东西多了就这样，有的朋友学习多了也这样。<span>比如我坐在这讲课，有些同学</span>听很多了，<span>脑子里会带着固有的思维：我刚讲上句，他就开始想下句是什么。</span>有<span>这时他还会思考我讲的内容吗？</span><span>还能吸收新东西吗？不会了，新内容进不去了。这就是因为不懂得 “无” 的道理。</span>所以，如果人不懂得让自己回到“<span>无</span>”的状态，其实用途就不大了。<span>比如跟老员工沟通，常能发现一个特点：</span><span>我们刚说上句，他就说 “明白了”。</span>其实我们这次想表达的不是那意思，但是他以为他清楚了，这可不可怕？跟这个人一讲话，没等说完<span>他就 “明白”，</span>明白什么呢？这个时候这个人还有没有用途了呀？没有用途了。问题出在哪？装得太满了，<span>活在 “有” 当中了。</span><span>再比如感情，</span>有的人谈过几段感情后，就很难再获得幸福了，是不是这个原理？因为他有的东西太多了。“<span>我上一段感情当中受到了伤害，所以这段感情我就不敢投入了</span>”，是不是这样想的？我们看，无之以为用，就是我们<span>到了新的感情里，</span>不能保持<span>无</span>的状态，还能不能产生作用？没了，作用不在了。通过这些例子，要让我们时刻回到无的状态。有之以为利，无之以为用。真正产生作用的是无的状态。<span>但我们往往被 “有” 障碍住了。</span>说我过去有两段感情，它就障碍住了我现在；过去我有工作经验，就障碍住了我现在；过去我做过领导，障碍住了我的现在。所以通过这三个例子，让我们回到最原始、最开始的无的状态。有之以为利，无之以为用。那我们看，没有“有”行不行？没有“有”就是没有利，没有条件了，也不行。所以又讲到了有无之相生也，既要有“有”，我们还要把“有”回到无的状态，所以叫有之以为利，无之以为用。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十二章 减少欲回归简",
    "date": "2025-10-26",
    "html": "<div class=\"B1_text\"><div><div data-docx-has-block-data=\"false\" data-lark-html-role=\"root\" data-page-id=\"R19fdSu8bod1x9xeeqFc65w6nEc\"><div><strong><span>第十二章 减少欲回归简（20页）</span></strong></div><div><strong><span>五色使人目盲，驰骋田猎使人心发狂，难得之货使人之行妨，五味使人之口爽，五音使人之耳聋。是以圣人之治也，为腹不为目，故去彼取此。</span></strong></div><div><span>让自己的身心安静下来，然后我们静静地感受当下。当我们的心可以安静下来的时候，所感受到的世界是纯粹的。可以感受到山河的壮丽，可以感受到大海的辽阔，也可以感受到柴米油盐的温情。可以感受到诗词的美好，可以感受到平静的喜悦。当我们身心安静的时候，就是营魄抱一，抟气至柔，涤除玄鉴，没有任何的杂质，这个时候感受到的一切，它是纯粹的，它是美好的。</span></div><div><span>所以当我们感受山河的壮丽，就只有山河的壮丽，没有其他的杂染。当我们回到生活当中去，就是柴米油盐的温情，没有其他的杂质。当我们此时此刻坐在这里听课，就只有道的美妙，没有其他的任何杂质，这个状态就是美好的。我们要学会身心安静，学会营魄抱一，学会淡定从容。当我们身心安静，淡定从容地看待一切事情的发生，无一不是美妙的，任何一件事情都是充满着美好。</span></div><div><span>但是有一个前提，我们要学会保持营魄抱一。上一章最后两句话讲的是什么呀？有之以为利，无之以为用。我们保持虚无的状态，这个时候用起来是不是才美妙啊，这就是那个无。我们现在的身心皆无，我们的心和身体什么都没有，什么都没有做，只是安静地坐在这里感受，坐在这里倾听，无<span>之</span>以为用。</span></div><div><span>当我们开始有，我们的身心就会分离。说脑海当中有很多的想法，身心就分开了，一分开其实用途就变少了。就像一个房间堆满了杂物，像一个杯子里面装了石子，用途就变少了。这种纯粹的美好，简单的快乐，源于我们的身心合一。</span></div><div><span>来体会一下，古时候的修道之人和那些书生，在我们心中都是什么样的形象？是不是非常简单纯粹的人啊。修道的人很简单，那个时候的书生也很简单，所以我们叫书呆子。什么都没有，简单而纯粹，所以他的生活充满快乐，充满阳光，总是那么美好、令人向往。我们看过那些聊斋故事，通常狐狸、女鬼、天上的仙女都会喜欢什么样的人啊？就是那呆子，对吧。简单纯粹什么都没有，这个人很单纯，很善良，是不是招人喜欢呐。</span></div><div><span>其实我们也一样的，当我们开始变得简单、纯粹、干净的时候，其实身上散发的光芒，自然就是招人喜欢的。因为这种气散发出来是舒适的，是可以让人感受到美好的，所以我们不停地去修为自己。修为自己不是向外，是向内，是回到那个简单、纯粹的状态，回到没有那么多杂念、身心干净的状态。因为我们生活在这个世界上，总会有很多东西来杂染我们，有那么多的勾心斗角，那么多的利益往来，总会有各种各样的事情发生，这些东西都是来杂染我们的。我们如何不被杂染，是一生的修行，这是有意思的事情。</span></div><div><span>我们去看那些修道之人，那些书生们，看儒家文化的这些儒者，学过《论语》的人，会熟悉孔夫子的那些弟子们，是不是都是很纯净快乐的呀？颜回一箪食一瓢饮，子路充满着义气，性格简单纯良。这些实则是值得我们学习的，因为他们的身上有一种简单，有一种干净，但是这种简单呢，它充满力量，让人无限向往。</span></div><div><span>我们学道就是复归于朴，复归于婴儿，回到简单的状态。营魄抱一，能毋离乎，抟气至柔，能婴儿乎，像婴儿一般的状态。涤除玄鉴，能毋疵乎，我们的心上没有任何的瑕疵。用的时候也这样，爱民治国，能毋以智乎，没有那么多智慧，不需要方法，不用勾心斗角，只是单纯去爱就好了。那有人说不行啊，我只是懂得爱，不会吃亏吗？对不起，没想过，因为一想亏不亏，就说明根本不懂什么叫爱呀，如果你爱你的孩子，会考虑吃不吃亏吗？不会吧，那叫爱呀，没有那么多复杂的想法呀。</span></div><div><span>这个时候天门启阖，能为雌乎啊，所有器官的开合，跟外界的相交相感都是柔和的、处下的，都是小的，被动的状态。又说明白四达，能毋以知乎，对世界、对万物的通达，不需要通过知道，不用眼睛看，不用耳朵听，只是内在的那份简单，那份纯净，就可以明白四达。当一个人懂得这样去修为自己，懂得这样去用，那道就给你生之畜之了，不用去求任何东西，不需要去上贤，不需要去贵难得之货，道自己给你生之畜之，不是追来的，不是求来的。</span></div><div><span>进而又到了十一章的内容，告诉我们有之以为利，无之以为用，真正产生作用的是那个无，是那个简单纯粹的质朴的无才有用。到了第十二章就讲有了，如果我们的心里、眼睛里、耳朵里都是有，会是什么样的结果呢？</span></div><div><strong><span>五色使人目盲。</span></strong><span>如果我们的眼睛里面是有的，总想看更多的颜色，总想看的更多，结果怎么样？使人目盲啊，用老百姓的话，看多了以后就看花眼了。看的越多，反而眼睛越没有用途了。就像人知道的越多，反而就不知道了。看得越多的时候，反而就目盲、看不清楚了。</span></div><div><strong><span>驰骋田猎使人心发狂。</span></strong><span>这指的是我们的心。当我们心里总是执着地追逐一些东西，就叫驰骋田猎，骑着马打猎，不停地去追猎物，追着追着就心发狂了，你的内心已然不受控制了。</span></div><div><span>比方说一个人在年轻的时候跟另外一个人谈恋爱，这时候别人说了，实则他根本就不喜欢你，并没有想跟你走到一起。但是迷在其中的人能不能看得到？看不到，因为她的心是发狂的，她认为可以追到。</span></div><div><span>再比方说有的人做生意、做事情，别人告诉他你这条路行不通，别人早都尝试过了，最后惨败。他自己能不能听得进去啊？他会觉得万一我行呢，万一我可以呢，万一我能从中赚到钱呢。是不被迷在其中了？这就叫心发狂啊，就是内心是不受控制的，说明心里对这个东西是不是执着的太深呐？所以心就不受控制了。</span></div><div><span>我们再看啊，有的人有一个小爱好的时候，有没有可能越陷越深呐？比如说喜欢什么东西，买起来就停不下来呀？总想凑齐，这样的我有了，我得买一个什么那样的。那样的有了，我得换个材质再买，换个形状再买，换个功能再买，最后发现家里摆不下了，其实这个过程心已经怎么样？发狂了，控制不住了。所以懂得修道的人，是不是随时可以回到那个无，那个简单的状态，可以清空啊。</span></div><div><strong><span>难得之货使人之行妨。</span></strong><span>行妨是行为失常。一个人的行为、身体、动作，如果去贵难得之货，最后就失常了。有很多年轻的孩子们，生活当中可能透支很多的贷款，甚至用信用卡去生活，为什么会这样啊？因为在贵难得之货，所以行为会不会失常啊。不光是年轻人，其实很多人都如此。当我们的能力不能让我们拥有什么东西，一定要学会及时停止，否则如果去贵了难得之货，会不会让我们的行为失常，从而就会打乱我们所有的生活节奏。</span></div><div><span>这三句是不都是因为有带来的呀，眼睛总想看得更多，结果是目盲。内心总想追逐的更多，结果是心发狂，行为总是贵难得之货，最后行为就会失常。</span></div><div><strong><span>五味使人之口爽，五音使人之耳聋。</span></strong><span>总想吃到更多的美味，总想听到更多的声音，结果就是口爽和耳聋。口爽就是伤了脾胃。因为当我们总想吃更好吃的，总想吃的更多，脾胃就会受到伤害。总想听的更多，最后反而就听不到真实的声音了。就像有的人从小习惯了听鼓励，习惯了听赞美，所以但凡别人说不好的地方，都不喜欢听，这叫不叫耳聋啊？有些东西你听不见了，听不到真实的声音了，听不到你认为反面的言语了，整个行为都要出问题的。</span></div><div><strong><span>是以圣人之治也，为腹不为目，故去彼取此。</span></strong><span>腹就是基本的需求，目就是欲望、想法、目的。所以圣人只满足最基本的需求，去掉那些多余的目的，只取最简单的东西。</span></div><div><span>来体会一下什么叫腹呢？比如说对于吃的东西来讲什么叫腹啊？吃饱即可，多余的东西不需要。对于眼睛什么叫腹？能看见路，走路不撞墙就可以了，多余的东西可看可不看。说我们的耳朵只要能听到声音就可以了，至于好不好听，是不是赞美之言不重要，这就是最简单的道理。</span></div><div><span>所以学道是让自己回到那个无，最简单的状态，为腹不为目，不要去追求那么多多余的东西，不要有那么多的目的，不要有那么多的欲望，这个时候人是最纯净的，是不是也是最好的养生的方式啊。</span></div><div><span>人们现在都喜欢养生，其实养生的核心不是越来越多，而是越来越少，不需要那么多。就像咱们虚空济的孙菁，有时候我们开玩笑还在讲，我说孙菁以前最卖力气的事情就是吃保健品，因为她身体不好，所以每天就吃各种养生的东西，后来跟着上山以后这些东西都不用吃了。我说实则你吃这些东西，没有什么太大的意义，为什么呀？你每天那么多的杂念，总是那么要强，心里惦记、放不下的事情那么多，吃什么又有什么用呢，没有意义呀。</span></div><div><span>所以实则我们要想养生，就是让自己变得越来越少，少一点心思，少一点想法，眼睛不要看那么多，耳朵不要听那么多，胃里不要总吃那么多，不要去追逐那么多外在的东西，这就变好了。</span></div><div><span>《道德经》也好，《庄子》也好，这些道的文化，都是极简的文化，后面很多是不是都是后人加上去的呀？实则如果我们想找到那个最根本的状态，找到最朴素的状态，他就是什么都不添加，什么都没有的状态。当我们内心保持虚无，我们的眼睛少看一点，耳朵少听一点，把我们的欲望和杂念减少一点，为腹不为目，故去彼取此，这就是最好的状态了。</span></div><div><span>我们随着学习道，随着岁月的积累，随着自己每个人变得更加成熟，生活当中有没有在不停地减少啊？比如什么在减少啊？好像吃的东西变得越来越少了，买的衣服也变得越来越少了，甚至朋友也变得越来越少了，需要交际应酬的事情变得越来越少了，这就是说明什么在减少啊？欲望在减少。而有的不是欲望在减少，是功能在衰退。说我这吃多了睡不着，吃多了消化不了。这不是欲望少了，是功能衰退了，所以自然就减少了。总之人生越往后，按照自然规律来讲也是越来越少的，决然不是越来越多的。</span></div><div><span>整个十二章，讲的是什么道理呀？是不是减少啊，减少到无的状态，因为无之以为用，如果有的越多，反而障碍的就越来越多。</span></div></div></div></div>"
  },
  {
    "title": "《道德经》第十三章 宠为下寄天下",
    "date": "2025-10-26",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十三章 宠为下寄天下<strong><span>（21页）</span></strong></strong></span></p><p><span><strong>宠辱若惊，贵大患若身。何谓宠辱若惊？宠之为下。得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身也；及吾无身，有何患？故贵为身于为天下，若可以托天下矣；爱以身为天下，如可以寄天下。</strong></span></p><p><span><strong>宠辱若惊，贵大患若身。</strong>这两句话讲出了人们的两个痛苦的来源，一个是精神上的，一个是身体上的。精神上的烦恼来自于什么？宠辱若惊。说有宠辱出现的时候，我们就好像受到了惊吓一样，贵大患若身，我们把它看得很重，就像我们的身体得了一场大病。那我们要如何去解决这两个问题呢？我们先看宠辱若惊。<strong>何谓宠辱若惊？</strong>什么叫宠辱若惊？<strong>宠之为下。</strong><strong>得之若惊，失之若惊，是谓宠辱若惊。</strong>首先告诉我们一个道理：宠之为下。宠是一个下的、不好的东西。但是往往我们把宠当成什么了？好东西了。因为宠辱是对立存在的，我们想要受宠，结果就会受辱。得之若惊，失之若惊。如果我们认为宠是好的东西，得到了也像受到了惊吓。为什么呀？怕失去嘛。那失之若惊，失去的时候也像受到了惊吓，痛苦不堪。因为我们得失之心太重了，所以就有了宠辱若惊。我们的宠辱，来自于我们的得失之心，把宠辱这件事情看得太重要了，太在乎外界的声音了。别人赞美我的时候，就很开心；当别人不赞同我的时候，就很难过。这都是得失之心在作怪，都是因为我们把宠看成了一个好的东西。举例，一个孩子如果从小他受到的都是宠爱，会不会容易出问题？长大后受不了别人的不认同，甚至别人说的话但凡重一点，自己就痛苦不堪。在他看来，受到了刺激呀，这就是因为从小受的宠太多了，就会出问题。要想没有宠辱若惊，我们就要没有得失之心，知道宠之为下，宠不是一个什么好的东西。当我们不认为它是好的东西，就没想得到啊。当<span>我们</span>没想得到，没有得失之心，自然就没有了宠辱若惊。<strong>何谓贵大患若身？</strong>什么叫贵大患若身？<strong>吾所以有大患者，为吾有身也；及吾无身，有何患？</strong>说我之所以有大患，是因为我还有“<span>身</span>”。及吾无身，有何患？如果我没有<span>“身”</span>，那何患之有？所以我们的患来自于哪里？来自一个“<span>有</span>”。因为有身，所以身就变成了我们的患。因为我们有得失之心，所以得失就变成了我们的患。注意，你有什么，什么就成为你的患。比方说你把情感看得很重，情感就变成你的患了，它<span>就会</span>一直缠缚着你，让你痛苦不堪。我们在什么事情上痛苦，就说明对这件事情是执着的，所以并不是那件事情令人痛苦，是对那件事情的“<span>有</span>”，对那件事情的执着，而产生痛苦。所以我们说人是感情动物，往往折磨我们的就是感情问题。有的人可能是夫妻感情，有的人是跟孩子之间的感情，有的人是跟父母之间的感情，那还有的人可能是跟同事之间的感情——说我跟他共事了这么久，为什么他还能离我而去呢？都是人的执着。我们任何痛苦的点，都是因为我们在那个地方是“<span>有</span>”的状态，所以《道德经》告诉我们回到“<span>无</span>”的状态，无之以为用；虚其心，实其腹；弱其志 强其骨。就是不要把外面的这些东西看得那么重要。因为看得越重要，自己越深陷其中。<strong>故贵为身于为天下，若可以托天下矣；爱以身为天下，如可以寄天下。</strong>如何解决这个问题？如果可以把天下看得比身体还贵重，就可以托天下了，可以托起整个天下。爱以身为天下，如可以寄天下。如果爱天下胜过于爱自己的身体，天下都可以寄存在你这里。这两段话讲一个什么概念呢？我们要找一个超越身体的东西的存在，有一个更重要的东西，就把这个东西扔掉了。举例，说现在丢了一个手机，这个时候有人给了你一个新的更好的手机，你还会因为丢手机而难过吗？可能会觉得：幸亏丢了，丢得真好，因为有个更好的东西出现了。是不是旧手机就不足以令你痛苦啊？所以我们看，为什么古人都喜欢修道？就是他找了一个更高的生命意义，找到一个更高的人生价值，就可以朝闻道，夕死可矣了。说我早晨闻道，晚上我死而无憾。因为找到了一个更高的存在、更高的价值。我们看从古到今，这样的人多不多？其实很多，因为很多人都在寻找更加崇高的生命意义、更加崇高的价值。当我们找到这个东西的时候，自己的身体、宠辱就变得没有那么重要了。所以修道是一种超脱的智慧，超脱于我的身体、我的宠辱，超脱于世间所有物质对我的束缚。当我们超脱了这个东西的时候，就不再恐惧了，就不再担忧了。我们看自古以来有那么多传道之人，他们把什么看得最重要？传道，所以生命不值一提了。我们学《论语》，看到过子路，他可以为了义而牺牲自己，所以在义面前他的生命不值一提。历史上我们可以看到那么多忠臣义士，为了忠君爱国，明知道是一条死路，但是我宁愿去，因为他把忠义看得更重要，所以自己的生命不值一提。这样的人，都是找到了更高的生命意义，找到了更高的价值，他不再为人的身体，甚至生命，不再为了宠辱，不再为了一时的得失而痛苦不堪。所以我们说这样的人是超脱的人，是超脱于人们对于世间上的这些欲望的执着。我们再回过来看十三章，它给我们拉高了一个境界去看我们自己呀，因为人有两种痛苦，一<span>种</span>是精神上的，叫宠辱若惊；一<span>种</span>是身体上的，贵大患若身。所以人要是想突破精神和身体上的痛苦，是我们没有得失之心，甚至连自己的身体也不在乎了，找到一个更高的寄托，这个时候就超越了本身的生命价值，就不再被事情所束缚，也就没有了烦恼和痛苦。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十四章 道复归于无物",
    "date": "2025-10-26",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十四章 道复归于无物<strong>（23页）</strong></strong></span></p><p><span><strong>视之而弗见，名之曰微。听之而弗闻，名之曰希。捪之而弗得，名之曰夷。三者不可致诘，故混而为一。一者， 其上不皦，其下不昧。寻寻呵不可名也，复归于无物。是谓无状之状，无物之象，是谓忽恍。随而不见其后，迎而不见其首。执今之道，以御今之有，以知古始，是谓道纪。</strong></span></p><p><span>我们再来看十四章的内容，依然在讲道，描述道的特质，如何去用这个道。<strong>视之而弗见，名之曰微。</strong>说看，不足以看得见，因为道的名字叫微。就是很微小，微细，所以不足以看得见。<strong>听之而弗闻，名之曰希。</strong>说听，也不足以听得到，因为他的名字叫希。希就是接近于无声的状态，有声，很微小。因为微小，接近于无声。所以听，听不见；看，看不到。<strong>捪之而弗得，名之曰夷。</strong>捪：抚摸。说你想去抚摸道，摸不到，因为他的名字叫夷，平坦的。因为它是平坦的，所以摸起来就好像什么都没有，摸不到。<strong>三者不可致诘，故混而为一。</strong>说这三者不能追问究竟，因为他是混在一起的。道是不能追问究竟的，因为他有太多的因素混在一起。以此来举例，我们生活当中的其他事情能不能追问究竟？不能。为什么？它是不是单一因素形成的，是混而为一的。举例，说问一个人“<span>你为什么不喜欢我呀？</span>”能不能追问究竟？你说“<span>是因为我的年龄吗？是因为我的长相吗？是因为我的身高吗？是因为我是哪里人吗？</span>”是不是某一个单一因素啊？不是，所以没有办法追问究竟。然后又问“<span>没事，你要觉得哪里有问题，我改</span>”，能不能改得了？改也没用啊，所以告诉我们凡事不可执着，不能追问究竟。再举例，说一个公司面临倒闭了，找高人请教一下，“我为什么公司做不下去呢？难道是我不够努力吗？还是我哪里没做好吗？”是不是某个单一原因吗？不是。万物当中皆有道，也就是每件事情都不可以追问究竟，因为因素太多了，有能说的，还有不能说的。有有形的，还有无形的。问到最后，人家说“<span>我没感觉</span>”，这个东西能说得清楚吗？说不清楚。所以人要学会淡然处之，面对事情不要总想去追问究竟。总想追问究竟的人，是不是固执的人啊？从某种程度来讲，是不是极端的人啊？告诉我们，三者不可致诘，故混而为一。那既然混而为一，我们看看一是什么。<strong>一者， 其上不皦，其下不昧。</strong><strong>寻寻呵不可名也，复归于无物。</strong><strong>是谓无状之状，无物之象，是谓忽恍。</strong>说一者，其上不皦，其下不昧。皦是明亮，昧是昏暗。说这个一者，往上看它不是明亮，往下看它也不是昏暗，就是没有具体的样子。寻寻呵不可名也。说想去寻找，但是它无边无际，不可名状，没有办法说得清楚，复归于无<span>物</span>。有发生过，但是发生过之后复归于无<span>物</span>，又回到无物的，像没有发生的状态。举例，就像微风刮过我们的脸庞，当风没有了，就是复归于无物了。有没有发生过？有，但它结束的时候就是没有了。说前两天下过雨，有没有留下痕迹？有，地上湿了，可能车座子被淋脏了，然后过两天雨过天晴，又会复归于无<span>物</span>，没有了，什么都不在了。再比方说，我们在这里开了三天课，在这三天当中会不会留下很多痕迹在啊？会。那开完课几天之后，对于这里来讲，复归于无物，是不是又什么都没有了呀。是谓无状之状。没有形状的形状。有没有形状？有，但看不见，这就叫无状之状，无物之象，没有留下什么物。但是发生的过程，有没有象留下来？有。是谓忽恍。就是一会儿有，一会儿没有的状态。那我们看这个道，说你想去寻找，无边无际啊，他会复归于无物，是无状之状。又是忽啊恍啊，这么热闹，在说什么呢？什么都没说，就是告诉我们道就是这样的，一会儿有，一会儿没有，好像看到他，过一会儿又看不到了。想听呢，听不到；想看呢，看不见；想摸呢，摸不着。而且还不能追问究竟，追问也追问不了，因为他不是单一因素，是混而为一的。那这个一，我总能知道是什么吧？也不能，这个一不是明亮的，不是昏暗的，他是变来变去的。想寻找呢，无边无际，不可名状，道就是这样的状态。<strong>随而不见其后，迎而不见其首。</strong>因为他没有具体的形状，你想追随他，不见其后；你想迎接他，不见其首。那我们也不知道“<span>道</span>”在说什么呀，那只是描述道的一种状态，道是什么样子的。那我们如何去用这个道，就是最后的四句话了。<strong>执今之道，以御今之有，以知古始，是谓道纪。</strong>说你要执着今天的道、驾驭今天的事情，那么今天的道从哪来？以知古始，是谓道纪。道会留下痕迹的，痕迹在哪显现呢？古始就是过去发生的事情当中，会留下道的规律和痕迹，再结合今天的道，这个道就产生了，翻译过来很简单叫古今结合。我们既要了解古时候的道，还要结合当下的道，把这两个融合在一起，你才能用。举例，我们看做任何事情都是如此，说我们讲文化，要不要了解古时候的道？要，要知道圣人在讲什么、知道“<span>道</span>”的规律是什么。但是只学了古时候的道，能不能用？不能用，因为时代变了，人们能听得懂的语言也在变，所以既要了解古时候的道，还要结合今天人们的生活现状 —— 今天人们有什么样的烦恼、可以听得懂什么样的语言，两个结合起来，就是你的道啊。执今之道，以御今之有；以知古始，是谓道纪。比方说教育孩子是不是如此，既要了解古时候的教育孩子的道，还要了解今天教育孩子的道，把这些再结合到自己孩子的身上。因为每个孩子的性格特点不一样，我们把这些结合得很好了，这个时候的道才能用。所以前半段告诉我们：道，看不见、摸不着、听不到，但是有没有痕迹留下来啊？有。我们从发生过的事情当中找到那些痕迹和规律，再结合当下的道，这个时候就是可以用的道。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十五章 冬涉水其若客",
    "date": "2025-10-26",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十五章 冬涉水其若客<strong>（26页）</strong></strong></span></p><p><span><strong>古之善为道者，微妙玄达，深不可识。夫唯不可识，故强为之容。曰：豫呵其若冬涉水。犹呵其若畏四邻。严呵其若客。</strong></span></p><p><span><strong>古之善为道者，微妙玄达，深不可识。</strong>说古时候善于为道的人，微妙玄达。微是什么？很微小，所以不容易看得见的。妙呢？我们讲恒无欲也，以观其妙，什么时候是妙的？无的时候。所以当一个修道的人，如果他没有那么多欲望，容不容易看得见他呀？他不显现啊。玄达就是也不知道他是怎么达到的，深不可识。因为他隐藏得很深，不轻易显现，所以<span>深</span>不可识。<strong>夫唯不可识，故强为之容。</strong>因为他不可识，所以只能勉强地形容一下。我们注意老子说<span>这几句话</span>的语境，他说深不可识，因为不可识，所以只能勉强形容一下，这种语境是什么样的语境？举例，说有人问你“<span>你教育孩子怎么教育得这么好？</span>”你说“<span>其实我也不太清楚，我只能勉强地形容一番</span>”，是不是这样的感受？如果你感情经营得很好，别人问你“你感情怎么经营得这么好啊？”你说“其实我也不太清楚，但是既然你问到了，我只能勉强地跟你分享一下，我也不知道我分享得对不对”。我们看，这种语境在表达什么？首先她是一种什么态度？谦逊的态度。注意，不只是谦逊哦，她是一种什么态度？就是能不能把如何经营好感情表达得全面，你说十年也说不全面，所以她是一种什么态度？懂得道以后的态度就是这样的了。当懂得道以后，会知道成功的路径是不是有千条万条啊，能不能把所有的条件都说清楚？不能。所以这里老子讲话的语境，告诉我们一个道理：如果我们在某件事情，越是懂得道，越是了解他的广博，是不是我们讲话越谦逊？因为知道除了说的这个之外，还有太多没有办法说得清楚的东西，所以说我也只能勉强地来形容一番，我只能形容我看到的这一部分。<strong>曰：豫呵其若冬涉水。</strong><strong>犹呵其若畏四邻。</strong>豫和犹都是小心谨慎的样子。说豫呵其若冬涉水，小心谨慎，就好像冬天涉水。冬天涉水是什么感觉？是不是恨不得走一步，退两步？水真凉，一面前进，一面想后退。 当我们懂道，做事情就是这样的。不会冲动地做一件事情，只会不停地干嘛？试探性、尝试性地去做。比如说我们去动物园，去森林，有没有观察过猴子、大象？这两种动物吃东西的时候，都怎么吃？拿给它一个东西，它会不会一下就拿过来？它会试探着拿，是非常小心谨慎的，直到没有危险的时候，是不是它才会做呀，这就是犹呵豫呵的状态。昨天看到播放的视频，真的会带动我很多的回忆，其中有一个画面是沈阳中秋节的夜晚，第一场，沈阳那时候赶上十月一，中秋节，连讲两场，然后第三场就到了天津。讲这个过程，我们就能看到小心谨慎是一种什么感觉。当时沈阳报了有差不多六百人，那时候分成两场讲，因为第一场，不知道究竟是一种什么效果，所以沈阳第一场，课堂就能坐大概两百五六十人，讲完一场，觉得可以，然后第二场就换了一个大一点的场地，三百五六十人。后来我们到天津，那天跟嬛嬛聊天还在说，我说上次那会场大还是这个大，她说上次的大。大家知道上次天津场坐了多少人吗？大概四百五十人，后面空老多的地方了。为什么那时候不敢报了？太多了，这报四百多人，不能再报了。所以那时天津场其实有很多人，包括沈阳没报上名的，因为咱们早早就喊停了。后来到北京依然是这情况，当时北京报了一千人 —— 这一千人一下不行吧，分成两场来讲，我们看，如果到今年这一千人，是不是就一场就讲了呀？给大家描述这个过程，是不是做每件事情都在干嘛？试探性地一点一点地去做啊？在不停地尝试和摸索的过程。但是有没有发现，不懂修道的人总是干嘛？恨不得一下把所有的事情都做了。所以，应是不停地尝试着。想象冬天涉水的<span>画面</span>，说冬天去过那个水的时候，是不是走一走，停一停，走一走，观察一下有没有危险？这时候才会向前走。如果我们懂得这个道理，生活当中会不会少犯错？而且是在经历当中不停地锤炼自我的，让自己不断地提升，然后是不是才向前走啊，这是修道的特点。所以修道，不是让我们一下变得有多大，也不是追求快的、猛烈的，而是缓缓的，试探性地向前行走。犹呵其若畏四邻。很小心谨慎，就好像害怕四周的邻居。如果很害怕邻居的时候，行为是什么样子的？是不是回家都是悄悄的？甚至踮着脚尖走，关门的时候都得扶着慢慢关。当我们懂得这样，有没有合上道？就合上道了。这时对别人是不是没有影响和伤害性啊？而不是 —— 哐！就把门摔上了。所以这种小心谨慎，是道的特质。当我们越是小心谨慎，既不伤人，也不伤己，就好像冬天涉水、若畏四邻。注意，这其中有没有德行在？有。如果我们不伤害自己，也不影响、不伤害他人，既符合道，又符合德，人就变得有德行了。我们无形当中总是会伤害到他人，实则伤人的时候就是在伤己，会不会再反回来啊？会的。<strong>严呵其若客。</strong>修道的人对自己要求很严格，往哪方面严格？让自己像一个客人一样。客人的特点是什么？是不是懂得收敛、不会放肆啊？是不是凡事也会少一点？我们去别人家做客，饭都吃得少了，是这样的吧？别人说“<span>我再给你盛一碗<span>”</span></span>，“<span>不不我在家也吃这么多</span>”，是不是这样的？“<span>你多吃两口菜</span>”，“<span>不不我最近减肥呢，吃得很少的</span>”看，是不是一下就变少了呀？甚至去人家洗手间洗手，是不是都不擦的呀，人家说“<span>那有毛巾</span>”，“<span>不不我都喜欢自然干</span>”。当我们作为客人的时候，会发现，既有礼在，是不是又有德在啊。到人家那做客，关门是不是很小心的样子，整个行为是不是自然就合道了。我们之所以不合道，认为自己是主啊。比如为什么对孩子强势啊？“<span>我生的，我是你妈</span>”，看，是这状态吧？所以我们一旦认为自己为主的时候，人就开始变得强势、霸道，就变得有伤害性啊。一旦我们<span>知道</span>自己是客的时候，是不是就懂得收敛自己的行为啊。《道德经》有三个地方讲到了客，第一处就是这里，严呵其若客；第二个地方，讲乐与饵，过客止；第三个地方，用兵有言曰，吾不敢为主而为客，吾不敢进寸而退尺，所以“<span>客</span>”是很重要的。当我们把自己当成天地之间的过客，行为就是收敛的，不会那么放肆，也不会那么执着。举例，说我们在这里学习三天、住了三天，房间窗帘的颜色是不是我喜欢的，重要吗？不重要啊。说桌子这个颜色我太讨厌了，重要吗？不重要。因为我们知道我们是什么？过客。最多在这里停留三四天，就要离开了，所以它的好与坏是不是没那么重要了。那如果我们知道，我们只是彼此人生的过客，还有那么多执着的东西吗？就是因为我们深陷其中，认为自己是主。通常结婚的时候，是不是有一个成语叫相敬如宾？互相敬重，把彼此当成什么？宾客一样。有没有发现，两个人刚开始相处的时候都很敬重啊，是不是彼此很客气啊？可是一旦走进婚姻，还客气吗？可不跟你客气，一不客气，问题是不是就出现了呀?所以人千万不要认为自己可以主宰什么，一旦认为我可以主宰的时候，就要开始背离道了。我们去想象这句话所描绘的画面，严呵其若客，我们把自己当成天地间的过客，平时生活也像去别人家做客一样，行为自然就是有尺度的、懂得收敛的。如果我们把爱人和孩子当成人生的过客来看待，是不是就没有那么多强势啊？就不会处处要求和束缚他，当我们这么做的时候，自然就符合了道的规律。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十五章 其若朴不欲盈",
    "date": "2025-10-29",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十五章 其若朴不欲盈（26页）</strong></span></p><p><span><strong>涣呵其若凌释。敦呵其若朴。混呵其若浊。旷呵其若谷。浊而静之徐清，安以动之徐生。保此道不欲盈，夫唯不欲盈，是以能敝而不成。</strong></span></p><p><span><strong>涣呵其若凌释。</strong>凌释是冰融化的样子。修道的人有一个特点，他可以涣散、涣化万物，是自然的道理。就好像冰遇到了阳光，自然开始融化。所以修道的人，当我们身上具备了道的特质，别人看到我们的那一刻，在我们身边的那一刻，自然可以融化掉，我们什么都没做呀。比方说做父亲的人，如果我们身上具备了道的特质，是不是孩子见到我们就会有安全感？是不是无为啊？我们什么都没做，但是有没有帮助到孩子？说夫妻两个人相处，只要他一回到家，我内心就满满的安全感。有刻意做什么吗？没有，这就是身上具备了某种特质，就可以涣化万物。再比如说有的人性格很开朗，当我们一接触这个人，瞬间也会觉得变开朗了，心情都变好了。这就是修道的人，当我们身上具备道的特质，不用做任何事情。涣呵其若凌释，万物见到我们，就好像冰见到了阳光，自然就会开始融化。<strong>敦呵其若朴。</strong>修道的人是敦厚的、质朴的。修道是越修越简单，越修越回到敦厚、质朴、没有什么修饰和杂染的状态，就叫敦呵其若朴。<strong>混呵其若浊。</strong>修道的人是浑浊的状态。什么叫浑浊？说我凡事没有那么强的分别之心，不会明察秋毫。我们曾经讲《了凡四训》讲过两句话：水至清则无鱼，人至察则无徒。人如果是至察的，身边就没有人跟随我们了，无徒啊。生活当中夫妻两人如果总是明察秋毫的，日子能不能过好？很难过好的。我们想一想：如果一个做老板的人，总是明察秋毫的，什么事情都放在眼里，什么都要管，这家企业能不能做得好？做不好。所以，修道是反过来的状态。混呵其若浊，他保持一种浑浊的状态，凡事没有分得那么清楚，不起分别心，不会把什么事情都看得那么明白，这就叫浑浊的状态。只有我们是浑浊的状态，才可以容纳很多东西，才可以去包容更多的事物，这就是浑浊。<strong>旷呵其若谷。</strong>修道的人心胸是宽广的、空旷的，就好像山谷一样。因为山谷是宽广的、空无一物，所以万物可以在其中生长、发展，这就是旷。所以学道会让我们的心胸变得更加宽广、容纳更多的事物。只有我们没有那么挑剔，凡事没有那么多要求，没有那么严格的时候，才可以像山谷一样。这个时候我们所包容、能容纳的事情就会越来越多，我们身边才会生机盎然呐。所以我们看，越是强势的人，越是斤斤计较的人，凡事都精明算计的人，身边能不能留下人？留不下呀，甚至寸草不生。反过来，旷呵其若谷，混呵其若浊，敦呵其若朴，这个时候我们可以容纳得更多。最后告诉我们：修道的人，懂得阴阳平衡的道理。<strong>浊而静之徐清。</strong>当浑浊的时候要静下来，徐徐地变清。<strong>安以动之徐生。</strong>那静得久了，又会过于安逸，这时候怎么办？动之徐生，动一动，让它徐徐地升起。所以阴阳平衡很重要，当我们总是动，就会变浑浊。变浑浊怎么办？我们就要静，让它变轻。那我们静得久了呢？又会过于安，这个时候我们就要动一动，让它徐徐地有生机。所以一会儿动，一会儿静，不停地去达到一种平衡的状态。<strong>保此道不欲盈。</strong>就是我们不要想盈，不要想满的状态，不要极静，也不要极动。<strong>夫唯不欲盈，是以能敝而不成。</strong>说只有不欲盈，才能敝而不成。敝是什么？就是保留一个缺口。所以凡事我们要保留一个缺口，不要让它干嘛？不要成。就像我们倒水，要不要保留一个缺口啊？什么缺口？就是不要倒满嘛。那我们倒得太满，没有缺口，还好不好用？不好用了。所以这个敝而不成，我们可以用在任何一件事情上。人的思维总想追求什么？满、追求盈、追求的更多，但是道的思维告诉我们不欲盈，告诉我们敝而不成，就是凡事我们都要保留一个缺口，不要让它成，不要让它满。为什么？因为水满则溢，月满则缺。当我们有一个成的时候，接下来必然要面对一个什么？失败的地方。所以凡事不要追求完美，不要追求极致，反而要懂得凡事留一个缺口，要懂得自己损。《易经》当中其中有两卦，一卦叫损卦，一卦叫益卦。损在前，益在后，损卦的下一卦就是益卦。所以我们真正懂得道的时候，凡事就学会自己损了。就是我们自己会愿意去自损，然后保留一些缺口，而不让它那么满，这个状态它才平衡。所以学道，一定不是追求那个最完美、最好的状态，反而是处处都留点余地，处处留点缺口、留点弊端，不要让它成；凡事不会追求极致，懂得阴阳平衡的道理。我们来回顾一下十五章的内容，告诉我们善于修道的人有几个特点。第一个特点：小心谨慎的样子。就好像冬涉水、若畏四邻。第二个特点：对自己的要求很严格。往哪方面严格呢？不要去为主，而要懂得去为客。当人为客的时候，我们做事情不会满、懂得收敛、懂得少一点、没有那么执着。第三个特点：涣呵其若凌释。身上具备了一种特质可以涣化万物，就像冰遇到阳光，自然就会融化，而不需要我们去做什么。不光可以涣化万物，那修道的人，他是敦厚的、质朴的，他回到了那个最纯粹、最质朴、最敦厚的样子。同时他又是浑浊的状态，对万物没有那么多区分，没有那么多分别。因为他是浑浊的，才可以变成旷呵其若谷。他只要是浑浊的，心胸可以宽广，像山谷一样包容万物。最后一个特点：他是懂得阴阳平衡的，不是一个状态保持不变。是浊而静之徐清，安以动之徐生。想保此道不欲盈，不要去追求盈，不要追满的状态。夫唯不欲盈，是以能敝而不成。所以才可以凡事保留一个缺口，不会去追求那个成的状态。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十五章 身在哪心在哪",
    "date": "2025-10-29",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十五章 身在哪心在哪</strong></span></p><p><span><strong>此讲为延伸。</strong></span></p><p><span>我们看向这里啊，专注一下，要是不愿意看我呢，看看别的地方也行。总之，让我们的身心关注到某一个点上，它可以让我们快速地集中。在生活当中也是一样的， 我们如何快速地集中精力啊？就是关注到某一个固定的点。比如说我看一棵树、看一盏灯、关注一个杯子，就是我们的眼睛到哪，心就到哪，就可以让自己快速地安静下来。借助某一个东西，<span>让自己的身心</span>快速地合二为一。我们平时为什么会散乱？就是我们的心和身不在一处。比如眼睛在看着树，心里在想着事情，这就散乱了；嘴巴正在吃饭，眼睛却在追剧，又散乱了。其实每一件事情，只要我们身心合一的那一刻，它都是美妙的。说我正在拖地，这一刻就是安静的。当我们安静拖地，其实其中就有喜悦。让我们喜悦的不是拖地，是拖地这件事情让我们身心合一。说我正在吃饭，吃饭本身就是一件美妙的事情。当我们身心都在吃饭上，会发现吃饭可以无比地快乐；当我们喝一杯水的时候，身心是合一的，那杯水就是甜的，这就是喜悦感。其实每个人内在都有喜悦感，我们要有意识地去修为自己。其实修为自己真的很简单，就是营魄抱一，就是让我们的精神和身体合二为一。这一刻无论我们在做什么，都是喜悦的，都是充满着美妙的。但是因为我们的心，总是容易动来动去的，总是想向外追逐很多东西，驰骋田猎使人心发狂，所以这种喜悦感就没有了。当我们不再向外驰骋，我们只是安安静静的，和自己在一起，内在的喜悦和平静就出来了。道有一个特点，就是非常地平淡、平静。对什么事情都不放在心上，什么事情都不重要。当什么事情都不放在心上，都不重要的时候，我们就不被外面的事情牵着走啊。吃什么不再重要，有一口吃的就好了。没有任何的波动，别人是什么眼光看待我不重要，我让自己合于道就好了。所以我们就没有了宠辱若惊，别人认不认同我，不重要，我要学会的是自我认同，这时候我们就非常地平静。我们不需要任何的表现，也不需要任何的证明，内心平淡如水。当我们散发出来是这样的感觉，不用去求着别人如何对我们，别人自然会对我们好，这就是道。因为人人都会向往好的东西，就像向日葵，它一定想向着太阳，太阳不需要做任何事情。我们总是把太多的精力用在没有意义的事情上了，不停地向外求，向外去追逐 —— 想要获得别人的认可，想让爱人变得更好，想让孩子变得更听话，都是徒劳的。持而盈之，不若其已；揣而锐之，不可长保也。我们总是想要的更多，所以叫功遂身退，天之道也。退到哪里去？营魄抱一，抟气至柔，涤除玄鉴，这个时候一切自然会变得更好，而我们不需要做任何事情。大家可以去想象一个画面，我们跟平时的自己做个对比。我们跟孩子动不动就咆哮、唠叨很多事情。我们换一个道的思维，我不跟他咆哮，也不会跟他唠叨那么多事情。当我遇事的时候，身心总是安静的，总是平和的、淡然处之的，孩子用不用我们管？不用。他自然就愿意接近我们，他自然从我们身上就能感受到这种力量。比我们喊了一大堆要管用得多呀，这就是道。我们跟爱人的相处，不再不停地要求他。我们想象一下自己美好的身影，说我们做饭的时候，就是安安静静地做饭，自己乐在其中。没什么事我自己往<span>沙发</span>一坐，也是舒适、平和的状态，用要求爱人回家吗？他自己日思夜想都得回来，这么舒服的状态，不回来行吗？所以，当我们真的懂得去修为自己的时候，其实我们什么都不用做，是不是无为啊？但是无为不等于我们什么都没做，我们做了一件最重要的事情 —— 修为自己。让我们自己的状态变得更舒适，不再向外寻求。我们听过“清净无为<span>”</span>这四个字，什么意思？不是什么都没做，而是我们要懂得修为自己，让自己保持清净。当我们保持清净的时候，就可以无为了，什么都不做。去过小住的朋友会知道，茶餐厅最中心的位置挂的就是这四个字，中间是虚空，咱的名字，然后一<span>边</span>是清净，另一边是无为。从虚空济最开始的那一天，我们就用这四个字为主导的方向。因为这四个字真的很美妙。所以老朋友都知道，在咱们虚空济，我什么事情都不管，其实我就是修这四个字。当我们懂得修<span>“清净无为”</span>的时候，身边的人自然会受我们的影响，我们什么都不用为，他们自会去为之。当我们清静下来的时候，就像一面湖水一样波澜不惊，像大海一样宽广包容，像山谷一样可以容纳万物，像天地一样寂静辽阔。当我们有了这些东西在，身边所发生的事情，其实根本不用解决，它会化于无形的。举例，说我们往这一坐，自己是这样的状态。即使我们的员工还有什么想不开的事情，我们往这随便一坐，聊点什么都可以，是不是迅速地就归于平静啊？就这么简单，不用刻意做任何事情。我们平时的生活正好活反了，眼睛总是向外看，耳朵总是向外听，总是想从外界不停地解决问题，方向不对。前段时间我一个朋友听了一场我线下的《道德经》，说长亮，你们讲的这个我觉得也挺好，但是我想问一个问题：是不是因为你不用去做具体的事情，所以你才可以讲清净无为啊？但是我的工作不是，我每天要做很多具体的事情，所以我是不是不能这个样子？我说，其实你说反了，是我们有什么样的思维和认知，就会过什么样的生活。不是因为我今天不用做具体的事情，我才是这样的想法，而是我有这样的想法，才不做具体的事情。如果一个公司三十多个人，我们看那个老板，是不是事事都得管？什么事情都得操心，如果按这个规模来讲，他要比我们的工作岗位事情多得多。别说三十多个人，即使我们开一家店铺，会发现我们有忙不完的事情。 再<span>说</span>小一点，就说一个人家里带俩孩子，我们一天都忙得不得了，是这样的吧？所以，说反了，不是因为我们没有那么多事情，才有这样的想法，而是我们有了这样的思维，自然就没有那么多事情。因为很多事情不会去管，也不会向外看那么多，生活当中往往我们都想反了。人们都会觉得：等有一天我什么都不干，就能修为自己了。错了，当我们什么都不干的时候，还有那么多机会修为自己吗？没有了。就是因为我们现在每天还有一大堆事情困扰着，还有孩子让我们烦恼着，还有爱人让我们不太如意，是不是我们才能修为自己啊？如果有一天这些东西都很顺遂，都是如意的，还能修为自己吗？我们就没机会了呀。前段时间他们开《论语》课，我就跟他们讲：要感恩每一个来听课的同学，因为他们真的是来助我们修为自己的。我们一期一期地这样去开，只有在长期的开课当中，我们才能锻炼自己。因为一旦长期讲，会不会有很多情况发生？比如说我们自己某一天很困，算不算？我们某一场课情绪不佳，算不算？可能我们某一场课身体不太舒服，甚至赶上我们生病，是不是都是？注意啊，只有在这些情况，才是我们最好修为自己的时候。心情好、状态好的时候，谁都能讲，但是赶上不好的时候，我们还能讲，这叫功力。就像生活一样，事事都如意，谁都能过好，体现不出什么。但是有不如意的时候，我们还能过得好，这才叫修为。所以我们一定要有一个正确的认识，不是说一帆风顺了，说家里什么事情没有，我才能修行，那个时候没得修了，正是因为我现在有一大堆的问题，身边有一堆的烦恼，孩子也不省心，爱人也不太关心，事业充满坎坷，我们说要不然，我们人生<span>来</span>做什么来了？一定不是为了吃饱了再走，一定是在这些所谓的逆境当中来锤炼自己啊。所以，当我们有这样的认识，我们不会去抱怨生活，因为每个人的生活是大同小异的，你有你的烦恼，他有他的烦恼；<span>你</span>有<span>你</span>的不足，他有他的缺点；<span>你</span>有<span>你</span>解决不了的事情，他有他解决不了的问题，其实都一样的。这个时候我们要回到自身来，回到如何让自己的心态变得更平和、更淡然、更从容和洒脱地看待身边一切的人和事。当我们什么事都不挂在心上，不放在眼里，就是一个自由自在的人，这个时候我们就变成了道的样子，是非常洒脱、自由、松弛地生活在人世间，没有任何东西可以束缚、困住我们。实则困住我们的，都是自己的认知、自己的心，比我们认知高的人，就不会困在我们现在的问题上，所以我们不停地提高认知就是在不停打破我们人生<span>的</span>枷锁。玄之又玄，众妙之门。我们推开一扇大门，走进去看看圣贤们讲了什么道理，他们是如何认识这个世界的，是如何面对人世间的这些事情的。所以我们看《道德经》，前半段讲道，后半段会有一个句式，是以圣人之治也，虚其心，实其腹；弱其志，强其骨，是以圣人退其身而身先，外其身而身存。后半段在讲什么？是以圣人是怎么做的。那圣人的这种行为是从哪里总结出来的？从道当中。道描述了一个规律，一种现象，然后圣人就知道该怎么做了。所以我们推开这扇大门，去看看道，去看看圣人的行为，去看看圣人是如何生活在天地之间的，是如何修为自己的。那我们从中体悟点什么，感受到一点什么，这个时候为我所用。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十五章 身在哪心在哪",
    "date": "2025-10-29",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十五章 身在哪心在哪</strong></span></p><p><span><strong>此讲为延伸。</strong></span></p><p><span>我们看向这里啊，专注一下，要是不愿意看我呢，看看别的地方也行。总之，让我们的身心关注到某一个点上，它可以让我们快速地集中。在生活当中也是一样的， 我们如何快速地集中精力啊？就是关注到某一个固定的点。比如说我看一棵树、看一盏灯、关注一个杯子，就是我们的眼睛到哪，心就到哪，就可以让自己快速地安静下来。借助某一个东西，<span>让自己的身心</span>快速地合二为一。我们平时为什么会散乱？就是我们的心和身不在一处。比如眼睛在看着树，心里在想着事情，这就散乱了；嘴巴正在吃饭，眼睛却在追剧，又散乱了。其实每一件事情，只要我们身心合一的那一刻，它都是美妙的。说我正在拖地，这一刻就是安静的。当我们安静拖地，其实其中就有喜悦。让我们喜悦的不是拖地，是拖地这件事情让我们身心合一。说我正在吃饭，吃饭本身就是一件美妙的事情。当我们身心都在吃饭上，会发现吃饭可以无比地快乐；当我们喝一杯水的时候，身心是合一的，那杯水就是甜的，这就是喜悦感。其实每个人内在都有喜悦感，我们要有意识地去修为自己。其实修为自己真的很简单，就是营魄抱一，就是让我们的精神和身体合二为一。这一刻无论我们在做什么，都是喜悦的，都是充满着美妙的。但是因为我们的心，总是容易动来动去的，总是想向外追逐很多东西，驰骋田猎使人心发狂，所以这种喜悦感就没有了。当我们不再向外驰骋，我们只是安安静静的，和自己在一起，内在的喜悦和平静就出来了。道有一个特点，就是非常地平淡、平静。对什么事情都不放在心上，什么事情都不重要。当什么事情都不放在心上，都不重要的时候，我们就不被外面的事情牵着走啊。吃什么不再重要，有一口吃的就好了。没有任何的波动，别人是什么眼光看待我不重要，我让自己合于道就好了。所以我们就没有了宠辱若惊，别人认不认同我，不重要，我要学会的是自我认同，这时候我们就非常地平静。我们不需要任何的表现，也不需要任何的证明，内心平淡如水。当我们散发出来是这样的感觉，不用去求着别人如何对我们，别人自然会对我们好，这就是道。因为人人都会向往好的东西，就像向日葵，它一定想向着太阳，太阳不需要做任何事情。我们总是把太多的精力用在没有意义的事情上了，不停地向外求，向外去追逐 —— 想要获得别人的认可，想让爱人变得更好，想让孩子变得更听话，都是徒劳的。持而盈之，不若其已；揣而锐之，不可长保也。我们总是想要的更多，所以叫功遂身退，天之道也。退到哪里去？营魄抱一，抟气至柔，涤除玄鉴，这个时候一切自然会变得更好，而我们不需要做任何事情。大家可以去想象一个画面，我们跟平时的自己做个对比。我们跟孩子动不动就咆哮、唠叨很多事情。我们换一个道的思维，我不跟他咆哮，也不会跟他唠叨那么多事情。当我遇事的时候，身心总是安静的，总是平和的、淡然处之的，孩子用不用我们管？不用。他自然就愿意接近我们，他自然从我们身上就能感受到这种力量。比我们喊了一大堆要管用得多呀，这就是道。我们跟爱人的相处，不再不停地要求他。我们想象一下自己美好的身影，说我们做饭的时候，就是安安静静地做饭，自己乐在其中。没什么事我自己往<span>沙发</span>一坐，也是舒适、平和的状态，用要求爱人回家吗？他自己日思夜想都得回来，这么舒服的状态，不回来行吗？所以，当我们真的懂得去修为自己的时候，其实我们什么都不用做，是不是无为啊？但是无为不等于我们什么都没做，我们做了一件最重要的事情 —— 修为自己。让我们自己的状态变得更舒适，不再向外寻求。我们听过“清净无为<span>”</span>这四个字，什么意思？不是什么都没做，而是我们要懂得修为自己，让自己保持清净。当我们保持清净的时候，就可以无为了，什么都不做。去过小住的朋友会知道，茶餐厅最中心的位置挂的就是这四个字，中间是虚空，咱的名字，然后一<span>边</span>是清净，另一边是无为。从虚空济最开始的那一天，我们就用这四个字为主导的方向。因为这四个字真的很美妙。所以老朋友都知道，在咱们虚空济，我什么事情都不管，其实我就是修这四个字。当我们懂得修<span>“清净无为”</span>的时候，身边的人自然会受我们的影响，我们什么都不用为，他们自会去为之。当我们清静下来的时候，就像一面湖水一样波澜不惊，像大海一样宽广包容，像山谷一样可以容纳万物，像天地一样寂静辽阔。当我们有了这些东西在，身边所发生的事情，其实根本不用解决，它会化于无形的。举例，说我们往这一坐，自己是这样的状态。即使我们的员工还有什么想不开的事情，我们往这随便一坐，聊点什么都可以，是不是迅速地就归于平静啊？就这么简单，不用刻意做任何事情。我们平时的生活正好活反了，眼睛总是向外看，耳朵总是向外听，总是想从外界不停地解决问题，方向不对。前段时间我一个朋友听了一场我线下的《道德经》，说长亮，你们讲的这个我觉得也挺好，但是我想问一个问题：是不是因为你不用去做具体的事情，所以你才可以讲清净无为啊？但是我的工作不是，我每天要做很多具体的事情，所以我是不是不能这个样子？我说，其实你说反了，是我们有什么样的思维和认知，就会过什么样的生活。不是因为我今天不用做具体的事情，我才是这样的想法，而是我有这样的想法，才不做具体的事情。如果一个公司三十多个人，我们看那个老板，是不是事事都得管？什么事情都得操心，如果按这个规模来讲，他要比我们的工作岗位事情多得多。别说三十多个人，即使我们开一家店铺，会发现我们有忙不完的事情。 再<span>说</span>小一点，就说一个人家里带俩孩子，我们一天都忙得不得了，是这样的吧？所以，说反了，不是因为我们没有那么多事情，才有这样的想法，而是我们有了这样的思维，自然就没有那么多事情。因为很多事情不会去管，也不会向外看那么多，生活当中往往我们都想反了。人们都会觉得：等有一天我什么都不干，就能修为自己了。错了，当我们什么都不干的时候，还有那么多机会修为自己吗？没有了。就是因为我们现在每天还有一大堆事情困扰着，还有孩子让我们烦恼着，还有爱人让我们不太如意，是不是我们才能修为自己啊？如果有一天这些东西都很顺遂，都是如意的，还能修为自己吗？我们就没机会了呀。前段时间他们开《论语》课，我就跟他们讲：要感恩每一个来听课的同学，因为他们真的是来助我们修为自己的。我们一期一期地这样去开，只有在长期的开课当中，我们才能锻炼自己。因为一旦长期讲，会不会有很多情况发生？比如说我们自己某一天很困，算不算？我们某一场课情绪不佳，算不算？可能我们某一场课身体不太舒服，甚至赶上我们生病，是不是都是？注意啊，只有在这些情况，才是我们最好修为自己的时候。心情好、状态好的时候，谁都能讲，但是赶上不好的时候，我们还能讲，这叫功力。就像生活一样，事事都如意，谁都能过好，体现不出什么。但是有不如意的时候，我们还能过得好，这才叫修为。所以我们一定要有一个正确的认识，不是说一帆风顺了，说家里什么事情没有，我才能修行，那个时候没得修了，正是因为我现在有一大堆的问题，身边有一堆的烦恼，孩子也不省心，爱人也不太关心，事业充满坎坷，我们说要不然，我们人生<span>来</span>做什么来了？一定不是为了吃饱了再走，一定是在这些所谓的逆境当中来锤炼自己啊。所以，当我们有这样的认识，我们不会去抱怨生活，因为每个人的生活是大同小异的，你有你的烦恼，他有他的烦恼；<span>你</span>有<span>你</span>的不足，他有他的缺点；<span>你</span>有<span>你</span>解决不了的事情，他有他解决不了的问题，其实都一样的。这个时候我们要回到自身来，回到如何让自己的心态变得更平和、更淡然、更从容和洒脱地看待身边一切的人和事。当我们什么事都不挂在心上，不放在眼里，就是一个自由自在的人，这个时候我们就变成了道的样子，是非常洒脱、自由、松弛地生活在人世间，没有任何东西可以束缚、困住我们。实则困住我们的，都是自己的认知、自己的心，比我们认知高的人，就不会困在我们现在的问题上，所以我们不停地提高认知就是在不停打破我们人生<span>的</span>枷锁。玄之又玄，众妙之门。我们推开一扇大门，走进去看看圣贤们讲了什么道理，他们是如何认识这个世界的，是如何面对人世间的这些事情的。所以我们看《道德经》，前半段讲道，后半段会有一个句式，是以圣人之治也，虚其心，实其腹；弱其志，强其骨，是以圣人退其身而身先，外其身而身存。后半段在讲什么？是以圣人是怎么做的。那圣人的这种行为是从哪里总结出来的？从道当中。道描述了一个规律，一种现象，然后圣人就知道该怎么做了。所以我们推开这扇大门，去看看道，去看看圣人的行为，去看看圣人是如何生活在天地之间的，是如何修为自己的。那我们从中体悟点什么，感受到一点什么，这个时候为我所用。</span></p></div></div>"
  },
  {
    "title": "《道德经》第十六章 致虚极守静笃",
    "date": "2025-11-04",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十六章 致虚极守静笃（28页）</strong></span></p><p><span><strong>致虚极也，守静笃也，万物并作，吾以观其复也。夫物云云，各复归于其根。归根曰静，静，是谓复命。</strong></span></p><p><span><strong>致虚极也，守静笃也。</strong>一个指的是精神、是心，一个是身体。致虚极指的是我们的精神，极是形容词。致虚极，就是虚到一定的程度。守静笃。笃也是形容词，就是让我们的身体守着那个静，让我们的心去达到那个虚无的状态。也就是身心安静的状态，身体是静的，心是虚的。这个时候<strong>万物并作，吾以观其复也。</strong>我们的身心是安静的，但是万物在干嘛？并作呀，在按照他自己的规律在作。吾以观其复也，我就可以看到事物循环往复的规律。我们先讲人，大家体会。比如说我们跟一个人相处，无论是朋友也好，情侣也好，陌生人也好，客户也好，注意，这个时候，我们身心是安静的，身体是静的，内心是虚无的，什么都没有，我们可不可以非常清楚地看到对方是一个什么样的人？因为在干嘛？万物并作。他在按照自己的性格在干嘛？在动。当一个人很安静，有智慧的时候，看一个人是非常清楚的，因为我们没动，他在动。这叫旁观者清，我们看得很清楚啊。所以，想去了解一个人非常简单，我们只要自己不动，经历上几次见面、事情或者讲话，能不能看清楚对方是什么样的人？清清楚楚。不光是人，所有的事物都如此。每件事情的发生，其中都是有规律的，只要我们身心是安静的，想看到规律其实非常简单。为什么生活当中的我们看不到？一个是我们的身体没静下来，还有我们的心怎么样？没有保持虚无。脑子里一大堆事情、心里装的东西很多，所以我们就看不到事物发展的规律，没有用我们的心去观察呀。为什么那时候<span>我们</span>没用心呢？因为心装着别的东西，没用上。什么时候有用？有之以为利，无之以为用。因为我们那颗心，它不是无的状态，所以它就没用嘛，用不了啊。比如大家坐在这里听课，如果这时候我们心里什么都没有，是不是就听得进去啊？当我们在想着别的东西，就听不进去了。有的同学就说过：听了三天，就看老师了，一句没听懂。所以我们看，这没见过世面吧？长得不好看，看我做什么？得听听内容嘛，所以要让我们的内心保持虚无。当我们保持虚无的时候，身体是安静的。万物并作，吾以观其复也。那所有事情的规律，都在我们心中看得很清楚。注意，那我要始终让内心保持虚无吗？它是一种修为和习惯。就是我们开始是要有意识地保持虚无的状态，时间久了不用保持，它自然就是这样的。就好像我们坐在这里，心里就是什么都不会想，我们每天的心里就是空空如也，什么都没有啊。这不是一种刻意，是我们逐渐地养成了一种行为和习惯的<span>状态</span>。就好像开车，当我们开的时间久了，是用记忆去开车，<span>每一个动作</span>很自然地就出来了，是不加思索的、不用思考，它已经形成了一种惯性，一种习惯，所以人是被习惯所支配的。好比打球，为什么千百次地练习，投篮也好、跑步也好，变成自然，不用头脑。用头脑已经怎么样？就慢了一拍，不用头脑才是正确的。但是人们恰恰喜欢用头脑，其实用头脑已经慢了。比如说大家发言的时候有没有发现，要是我们<span>在想“<span>要说什么？</span>”</span>基本上是说不好的，说得好的人都没想。注意，我们跟朋友聊天是不是这样？我们说有一天聊的内容，我自己都想拍案叫绝 —— 这是我说出来的话吗？想一想，那一刻我们讲出来的东西，是我们想的吗？完全不是，这就对了。所以其实人这个心里呀，是有巨大宝藏的，但是我们总是用脑，总是思考，就把这个东西丢掉了，没了。举例，我坐在这里讲三天课，其实我都不知道下一句要讲什么，就是因为我不知道才能这么讲，我要是知道了就讲不了了，好理解吗？它不是我想出来的，每一节课我往这一坐，我也不知道说什么其实。那坐在这说着说着，就说了很多，完全不需要思考，是不是只有这样，它才是流淌出来的？如果我用大脑，一思考，坏喽，出不来了，卡住了。我们看，用头脑的特点是什么？一说话就“<span>这个这个…… 那个那个……</span>”、“然后这个是……”就像我们往外倒东西，一倒一卡，一倒一卡，所以我们不要用头脑，用心、用感受，用我们的感知能力。这个就需要我们长期修为自己，不要总是那么多的思考，不要总想那么多东西，要不停地致虚极，守静笃；要虚其心，实其腹；要有之以为利，无之以为用。时间久了，我们就变成内在是一种虚无的状态，这个时候万物并作，吾以观其复也，一切事物循环往复的规律，我们都可以看得很清楚。<strong>夫物云云，各复归于其根。</strong><strong>归根曰静，静，是谓复命。</strong>夫物云云就是天下万物。各复归于其根，复就是回去，说明原本就是那个样子的。那各复归于其根，都会回到那个根本状态。根本状态是什么？是不是那个虚无的、无的状态？天下的事物是从无到有，最后还要干嘛？回到那个无，回到根本。所以，我们修为自己，不停地让自己回到哪里去？是不是那个虚无的状态？跟天下万物是一样的，都要回到那个根本。归根曰静，静，是谓复命。那归根的过程，或者叫修为的方式，就一个字，叫静。当我们静下来，才能回到那个最根本的状态。举例，说我们因为孩子的事情生气了，根本的状态是什么？是没生气。那因为孩子的事情生气了，怎么回到根本状态？是不是静下来？安静下来，最后气消了，回到根本状态了。所有的事情皆是如此，最开始都是没有的，后来它有了，然后我们要懂得静下来，它又没有了。所以归根曰静，静，是谓复命。这个静是在干嘛？修复生命。因为有这个静，有这个复命，我们才能回到那个无的状态。举例，当一个人状态不好的时候，都想干什么？我想静一静。当我们静下来，睡上一觉，或者这两天我们什么人都不理，静下来，有没有发现，我们的状态<span>又开始</span>变好了呀？所以我们要学会一个道理：当我们很累的时候，状态不好的时候，心情烦躁的时候，怎么办？静，是谓复命。但是人有一个习惯，什么习惯？越是状态不好的时候，越要想事情；越是身体特别累的时候，越着急做决定，是不是这样？这个时候我们就要反其道而行之了。我前两年跟一个朋友讲过这个话题，我这个朋友是做企业的，开公司，是一个脾气很大的人，然后跟我聊天经常会讲他，总是很冲动，但是他很聪明，就是过后一想又总后悔。我就告诉给他一个修为自己的方法，我说：我们要是想少犯错误，切记要控制一点，因为本身我们是个很聪明的人，只需要控制一点，就是我们永远记住 —— <span>自己</span>在情绪不好的时候，状态很差的时候，我们把自己关起来，不要讲任何话，不要做任何决定。好理解吗？因为<span>我们</span>在状态不好的时候，我们讲的任何话都是错误的，做的任何决定都是有问题的。但是当平静下来的时候，我们说的话、做的决定，是不是就没有问题啊？回忆一下，我们说的最错的话，做的最错的决定，都是在什么时候？心情不好的时候，身体不好的时候，遇到一些问题的时候<span>，对吧？</span>所以这个时候，其实我们要做的是：静，是谓复命。我们先复命，否则我们以残血的状态，说的话能对吗？做的决定能没问题吗？</span></p></div></div>"
  },
  {
    "title": "《道德经》第十六章 知常容容乃公",
    "date": "2025-11-05",
    "html": "<div class=\"B1_text\"><div><p><span><strong>第十六章 知常容容乃公（28页）</strong></span></p><p><span><strong>复命常也，知常明也；不知常，妄，妄作，凶。知常容，容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。</strong></span></p><p><span>夫物云云，各复归于其根。归根曰静，静，是谓复命。要学会致虚极，守静笃。这不光可以看清楚世间万物，还可以修复自己的生命状态，所以我们要懂得静。一个人特别累的时候，我们会嘱咐他什么呀？你好好睡觉 什么都不要想，是这样的吧？他什么都没想，觉睡好了，是不是就复命了呀？那如果他继续什么都想，然后觉也睡不好，这不是玩命吗？所以，道，其实人人都知道一点，这些话是不是在生活中都是常用的呀？我们也知道静是在复命，只是不系统、不深刻。当我们认识得越深刻的时候，其实就知道该怎么修为自己。再讲“静<span>”</span>，其实我们这一天当中，需要无数次的静。比如说，我们白天是静还是动？动。那到了晚上就是静下来，所以只要晚上休息得好，第二天就是活力满满的。那自然界的春夏秋冬，什么时候是静？冬天。因为冬天静下来休养生息，然后春天是不是才可以生啊？夏长，秋收，冬藏了。自然界都有静的时候，人也一样哦。所以我们每天不光是晚上要静，时刻要学会干嘛？安静下来，一动一静，一动一静。那我们要是再修为一下自己，即使在动的时候，内在也是静的 —— 我安静地吃饭，安静地讲话，安静地读书，安静地走路。所有的动，内在都有一个静在，随时在充电的状态，这才是最好的。所以一个懂得安静的人，他的状态会一直保持得很好，因为他一直在干嘛？复命。静，是谓复命。<strong>复命常也，知常明也。</strong>懂得复命，这是常识，也是常态。我们要知道复命这个常识，才可以把很多事情变成常态，静。当我们把<span>静</span>变成常态的时候，就像我们刚才讲的，动的时候，内在也是有静的。如果我们一直处在“<span>静</span>”常态上，是不是一直在复命啊？消耗的就少。知常明也，知道这种常，就是明达的。<strong>不知常，妄，妄作，凶。</strong>如果不知道这种常，不懂得“<span>静</span><span>，</span><span>是谓复命</span>”，这就叫什么？妄，妄作，凶。不知道静下来，人就会妄作、妄想、妄为、妄动，结果就是凶的。所以，我们不懂得静，不懂得复命，是不是一个很可怕的状态？如果不懂得安静下来，首先我们自己会产生巨大的消耗，然后身边的人烦不烦？也很烦哦。我们如果每天都是躁动不安的，每天都是很强势的，每天讲话都是很大声的，什么事情都想管一管的，身边的人是不是也很烦恼啊？因为我们一直在动啊，所以很多人都会觉得委屈 —— 我为这个家辛辛苦苦地付出这么多，天天当牛做马的，每天忙个不停，可是怎么人人都对我不好啊？就是因为一直在干嘛？动个不停嘛。一直在动，就是妄啊，妄作结果就是凶，不好的。所以要懂得让自己干嘛？静下来，是谓复命。<strong>知常容。</strong>如果知道这种常，就是包容的、宽容的。什么意思？我们来体会，一个人安静下来的时候，还是动起来的时候，更容易包容？是不是安静的时候<span>更容易包容？</span>人安静的时候，包容性会变得更强。比如说我们现在心态很平和，很安静地坐在这里，是不是发生什么事情都无妨啊？这个时候有人手机响了，我们连看也不太会看。我们动的时候什么状态，人家手机一响，恨不得用眼神杀死他。所以我们讲课的这三天，大家可以看到一个明显的变化。第一天的时候都是这样（眼神杀），第二天的时候习以为常，第三天可能看都不会看了，这个过程是不是逐渐变得内心安静从容了呀？我们的包容性就变强了。<strong>容乃公。</strong>有了这种包容、宽容，人就是公的，公平公正，这个时候看待一切就会用一种更加高的、更加公平、公正的视角，去看待世间的问题。举例，说现场有的同学的手机响了，一眼看过去 —— 这个同学年龄有点大。这时，什么叫包容和公正啊？“哦，<span>可能他不太会调</span>”。那有的同学因为手机响了，他很慌张地着急弄，这说明什么？他自己都有点不好意思了。有没有发现，当我们用宽容的心态看待一切，我们看到的东西就不一样了呀。比如说，孩子犯错了，可能是家里没太有人去管，这个时候我们对他不是指责和抱怨，反而升起了仁爱之心、包容的心。再比如，有的人说：我妈从小对我很强势，对我也不好。当我们能更包容的时候，可能看到的是：她从小也没得到过爱呀，那个时代她为了活下来都已经很难了，如果她再不强势一点，她能活到今天吗？能把我养大吗？看，当我们有包容的心态，看待问题就变得不一样了，这才叫公的心态，就是我们不再用私心去看。私心无非只有自己的得失嘛，当我们用一颗公心去看问题的时候，全然不同啊，这就是安静。安静，是谓复命。这种安静，可以让一个人变得包容、宽容、公正，用一颗公心去看待一切事情。<strong>公乃王。</strong>如果有了“公”，这就叫王，就是王道的意思，人世间正确地看待事物的方法。<strong>王乃天。</strong>这个王道是符合天道的运行规律的，是广博的、无私的，是包容世间万物的。<strong>天乃道，道乃久，没身不殆。</strong>这种天是符合道的。符合道才可以长久。长久到什么程度呢？没身不殆。就是我的身体都没有了，依然没有危险。回顾十六章的内容，主旨就六个字，叫致虚极，守静笃。有了“<span>致虚极，守静笃</span>”，“<span>万物并作，吾以观其复也</span>”，这是我们可以看到世间万物的规律。它不光如此，因为天下万物都会各复归于其根，归根曰静，静，是谓复命。所以这个静，既可以看天下万物循环往复的规律，又可以修复自己的生命状态。也就是万物想要复命，都要通过这个静啊。如果知道复命，这就是常。知道这种常，这是明达。如果不知常呢？就会妄，妄作就会凶。人不懂静下来，不懂复命，就是凶，结果是不好的。如果知道这种常，就是包容的。容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。</span></p></div></div>"
  }
]