[
  {
    "title": "第一讲",
    "author": "虚空先生",
    "html": "<div class=\"B1_text\"><h2>今天我们来分享心经，般若波罗蜜多心经。</h2><p>全篇一共260个字加上标题8个字一共268。但是呢，我讲的不是佛经，我也没有那么高的智慧和能量去讲佛法。名不正言也不顺，我也不是出家人，所以我讲的也不是佛法。我只是把心经当中的一两层意思拿出来和各位朋友分享。可以指导我们的休息，让我们看一看心经里面都再讲什么样的智慧。我们按照心经里面的智慧去修正自己。让自己可以变得更自在，可以变得更从容，可以变得更有智慧。所以我讲的实在也不是佛法，如果按照佛法的讲解会过于高深。我们绝大多数朋友都听不懂，所以呢我往生活化了讲。如果有佛法更高深的朋友呢，你也不要去挑剔和指责我，因为实在是水平有限。所以我们只来讲一讲心经，如何在生活当中去修正我们自己的行为，我们让绝大多数的朋友。让没有那么深的佛法基础的人都能听懂心经在讲什么？我们也不要把心经过于神话，当我们把心经过于神话的时候。我们往往更不容易理解他在讲什么。佛陀自己说他是无神论者。佛陀本身也是觉悟的人。观世音菩萨也是觉悟的人，所以我们把他当成人给我们讲的话。我们再来理解心经，这样它才能变得简单，而不是那么复杂和难以理解。所以我也只能讲讲心经的最浅最浅最浅的解释，其中的一层两层所以我也讲不全面，我们也讲不到那么高的境界。心经是《大般若经》其中的一段，《大般若经》一共600卷，这是其中的一段的精华。心经的版本有很多，流通的范围最广的版本。是唐三藏玄奘法师所翻译的版本，所以我们来分享也是分享玄奘法师所翻译的这个版本，般若波罗蜜多心经，般若啊这两个字呢？用汉文来理解，用我们的文字来理解，翻译过来就是智慧。这里讲的智慧呢，是出世间的智慧，他的原意也是指的出世间的智慧。但是我们现在来理解呢，我们把智慧分成两层，第一层叫世间的智慧。叫世智辩聪，世间的智慧。我们世间的智慧是用来做什么的呢？让我们在这个红尘中，让我们在尘世间生活得更好的智慧，叫世间的智慧。我们每个人都有世间的智慧啊，只是多与少。比如说，我们会开车，我们会做饭，我们懂得生活的道理。我们知道该如何去工作，这都是世间的智慧啊，无非是有的人更聪明一些，有的人没有那么聪明。有的人看事情更通透一些，而有的人没有那么通透。这都是世间的智慧，就是让我们可以生活的更好的方式。这就是世间的智慧，但是这里讲的般若呢，是超世间的智慧。超世间的智慧啊又分为三种，第一层叫文字般若，第二层叫观照般若，第三层叫实相般若，文字般若是什么呢。这是我们通过学习圣贤的文化我们通过学习佛经，这都是文字可以给我们带来的智慧，到了我们现在这个时代就更便利了，通过视频，通过讲解，通过圣贤的文化，通过书籍。这都是文字般若，当我们有了文字般若的时候，我们才能明白更多的道理。这个时候到了第二层，观照般若，就是通过观照自己的起心动念。通过观照自己身边所发生的事情，这个是自己所体悟到的。自己所观照到的，自己所悟到的，这个叫观照般若，比如说，我们现在大家每天都在用的超话。就是观照般若的地方了，我们看到别人的分享啊我误到了一个什么道理。我通过观察自己的生活，看自己身边所发生的事情，我又悟到了什么道理？这个悟到，就是自己观照而来的智慧，自己看问题开始变得通透的智慧。当我们有了文字般若，有了观照般若，这个时候就到了第三层，叫实相般若，我们只有学习更多的。佛法学习更多的圣贤文化，有了更多的知识，再加上我们自己不停的观察生活当中的事情。观察别人，观照自己的念头，观照自己的行为，这个时候自然就会升出实相般若。但是这里面我们要注意的是。往往我们世间的智慧越多，反而离出世间的智慧越远。这个是我们所有的心念，所有的念头，都放在了世间的智慧。如何让我生活的更好？如何可以赚到更多的钱？如何可以学习更多的技能，这个时候反而离出世间的智慧越来越远了。出世间的智慧啊。其实每个人也都或多或少的有。举个例子，有的人说我相信因果。当我们相信因果的时候，就已经有了出世间的智慧了，我们用个比例来说。当我们明白因果的时候。可能我们有了20%的出世间的智慧，知道了不好的行为，不好的事情我是不能做的，因为我做了要违背因果。要自己承担业力的，这个就是出世间的智慧了，只不过还没有那么深。所以其实出世间的智慧每个人都有，但是我们可以通过不断的学习佛法，不断的学习圣贤文化。通过文字般若，再通过观照般若，让自己生更多的实相。明白更多的人生无常。这个时候，我们的出世间的智慧就会不停的去增长，再举个例子，什么叫出世间的智慧。比如说我们人很容易产生两种间接，一个是断见，一个是常见。什么叫断见呢，说我们这一生过去了就没有了。只把当下活好就好了，人死如灯灭呀。你管他什么来世呢？也不一定有。这个就是断见呢，还有叫常见，什么叫常见呢？我们老百姓经常讲一句话，没关系，18年以后依然是一条好汉，等来是我再好好做人。就是我们认为我们可以一直是做人的，这个都叫常见呢。来是我们能不能做人，不一定的，佛家是讲六道轮回的。如果我们这一生做的都是恶业。来是不一定可以投胎做人的，包括生活当中发生的事情，我们总认为它是固定不变的。说我今天跟一个人有感情。那什么叫常见呢？认为他生生世世都不会变，起码这一生当中是不会发生变化的。我今天的事业是顺利的，我就认为这一生我都是顺利的，这都是常见的。所以就因为我们有了这种常见。所以，才会产生痛苦和执着。当我们身边的事情发生变化的时候，我们就开始苦不堪眼，开始抱怨，开始痛苦，这是常见。断见也是一样的。当我们自己没有学习那么多的出世间的智慧。我们开始下断言，我们认为的这个一定就是对的。这个都是我们自己的主观臆断，所以断见和常见都会让我们产生痛苦。那我们出时间的智慧只有通过不断的学习文字般若。才能懂得更多的出世间的智慧，才能增加出世间的智慧。只有我们通过文字般若不断的学习，我们才可以懂得去观照，观照也是对照啊。观察自己，照见自己的行为，观察身边的事情。是不是和我们学的文字般若，你相对照？相参照，这个时候，我们才能从里面升出实相般若，所以实相般若是通过文字般若。和观照般若不断的总结体悟而得到的实相。波罗蜜多，我们汉译过来叫波罗蜜，波罗蜜呢，就是到彼岸的意思。同样，波罗蜜多也是到彼岸的另外一种说法，智慧。到彼岸，我们来先讲到彼岸。我们有多少个彼岸呢？是不是人生会有很多彼岸呢？每一件事情都有每一个事情的彼岸，我们为什么要到彼岸去呢？说明我们当时当下在某件事情上是生活在苦海当中的，所以我们才需要去彼岸呢？这个彼岸有无数个，有的人修行的境界高一点的。他到达的是了脱生死的彼岸，再高一点的。它是达到佛的彼岸。彼岸成佛呀。那有的人说，我当下因为感情痛苦，我需要度过当下的痛苦。那就过我们当下的这个彼岸。有的人因为事业痛苦，我生活在这个痛苦的河流之中，生活在痛苦的苦海之中，那这就是我们当下所要过的彼岸。我们当下所要过的河要到达的彼岸，我们讲一个小故事啊。有一个小女孩，有一天呢，走在一个海边，这个小女孩呢？她是无依无靠的。他觉得特别的无助，不知道自己怎么就到了这里，发现身边也没有朋友。也没有人，所以自己就很痛苦很无助。这个时候啊，来了一条鲨鱼，这个鲨鱼呢，就对小女孩讲话。说，小女孩，你来自哪里呀？你想要去哪里呢？这个小女孩又看着那个鲨鱼呀，就问。说，为什么你长得那么大，而我长得这么小呢？他说，因为每个人。当下所呈现的都不一样啊。你当下所呈现的就是你现在。该有的那个样子啊。又问，小女孩，你要去哪里呢？小女孩说，我也不知道我要去哪里啊，然后这个鲨鱼就对她讲。我要把你留在岸上呢，你又没有地方可去。可是我要带着你去海里，你也生活不了啊，他说，要不然这样吧。我知道海的另外一边有很多人生活在那里。那个地方呢？很好。小女孩说，那个地方有多远呢？这个鲨鱼说，很远，可能要走很久。但是那个地方我觉得特别好。小女孩说，那你觉得好未必是我觉得好啊。鲨鱼说，对啊，我觉得那里的人们生活的很快乐很幸福。可是你未必那样觉得。所以说，我给你两个选择，要不然你留在这里，要不然你跟我去到那里，小女孩说，我不想去。我也不知道走多久，我也害怕我不能去的，鲨鱼说，如果你要实在不去，我就自己走了。小女孩想了想说。要不然我去吧，因为我在这里确实也很无助，如果你也走了，我也不知道要去哪呀，我也不知道在这里要呆多久。所以，这个小女孩就跟着鲨鱼去了。他们走了很久啊，到了一个地方，这个小女孩下来了。下来了之后，他看到这里有很多人。有高的。有矮的，有胖的，有瘦的，有男的，有女的，有长得好看的，有长得不好看的。但是他看到这里的人好像都很快乐。也没有人来欢迎这个小女孩，仿佛所有的人都看不见他，但是这个小女孩却感受到这里是快乐的。然后呢，他就无形当中就融入到这里，他也变成了快乐的一份子。这个时候，他似乎忘记了他是从哪里来的，也忘记了那条鲨鱼。他就继续往前走，开始了她新的生活。在这里他很快乐，很平静。这个时候，那条鲨鱼呢就默默的走开了，又来到了海边，这个时候又出现了一个小女孩。这个小女孩依然重复的那个话题，你是谁呀？我在这里很无助啊，能不能告诉我我能去哪里呢？鲨鱼又开始重复着他所做的事情，这个故事讲完了。为什么是鲨鱼呢？因为鲨鱼看上去。是凶恶的，看上去是那么不被人喜欢的，那为什么是小女孩呢？当我们无助的时候。当我们痛苦的时候，谁又不是那个小女孩呢？古论的脾气有多么暴躁？无论我们表现的有多么强悍。无论我们长的是好看的还是不好看的，无论我们是男还是女，但你最脆弱无助的那个时候。你生活在苦海的边缘的时候。谁又不是那个无助的小女孩呢，所以生活才会有苦难呢，才会有感情的挫折呀，才会有事业的不顺呢？才会有世事无常的变化呀，当这些变化来临的时候，我们都是那个无助的小女孩。我们都想找一个那个丑陋的鲨鱼，甚至我们平时都想远离它，可是这个时候我们是无助的，我们是无奈的。我没有请求他帮忙。可是他看上去是那么的吓人。但凡我们有一点办法，我们都不想跟他去到彼岸。但是我们实在无助了，好像他也成为了最后的那根救命的稻草啊。可是当我们如果早点觉醒的时候呢，早点去探访一下那个彼岸，我们就能减少一些无助。我们才能减少一些痛苦，当我们以人的眼光去看人的时候，就会有丑陋。就会有美丽，就会有强大，就会有弱小。可是你要以那条鲨鱼的眼睛去看人呢。无论你是男的女的，高的，矮的，胖的，瘦的，无论你表现的有多么强大。你都是弱小的。你都是无助的，那如果我们学习佛法与佛心与佛眼在看人呢？无论你当下是快乐的。是痛苦的是强大的还是脆弱的？你都是那个无助的众生啊。你都需要到彼岸去，因为你在这个人世间一定会有痛苦。一定会有苦恼，一定会有无助的时候，所以我们为什么不能早点去探索一下那个彼岸呢？般若波罗蜜多呀，如何才能探索那个彼岸呢？我们要学习出世间的智慧。不要苦苦的执着在自己当下所拥有的那个世间的智慧上。往往我们追求的世间的智慧越多。我们就看不到出世间的智慧，所以这个小女孩为什么最后会跟着鲨鱼走了呢？太痛苦了，太无助了，这个时候才想着去彼岸。那你看，我们今天的很多人不是一样的吗？到了最无助的，最痛苦的时候才想着去彼岸，可是不晚呢。这些佛法天天都在给我们讲，要放下身边的这一切，要明白事事的无常。要增加出世间的智慧。要到达彼岸去。彼岸有很多让我们痛苦的事情，也有很多，我们要不停的去增加自己的智慧。自己去度过每一条让我们痛苦的河流。到达每一件事情的彼岸，无论有多少种智慧，无论有多少条痛苦的河流。最后都要归到自己的心呢，所以叫《心经》，经是什么呢？就是方法，就是道理，所以我们要学习的。是智慧的，可以到达，可以过每一条河流，到达彼岸的心里的方法，所以，经题叫般若波罗蜜多心经，最后我们要修心的。我们每个人都有一颗妙明真心。可是这里的心经指的不是妙明真心，是我们当下的这颗虚妄之心。我们当下有烦恼的心，有嫉妒的心。有称恨的心。有贪婪的心，有索取的心，有让我们快乐的心，那我们不停的去学习智慧。就是让我们这颗动的心不停的随着事事变化的心。不停的让我们产生痛苦的心，去往妙明真心的路上啊。我们不停的学习智慧，不停的。过每一个苦海的河流，到达的每一个彼岸，就是我们不停的明心的过程。我们不停的增加智慧，不停的明心。我们才能见性，所以叫明心见性。见性，那个性就是我们本有的那个妙明真心，所以说修佛就是修心。从我们当下的这颗心开始修，我们原本的那个妙明真心都是一样的。都是与佛没有差别的，只不过我们当下所显得心不同。我们当下是人，就是人心。我们当下如果是神仙，就是神仙的心。我们当下是那个小女孩就是小女孩的那个心我们当下如果是那个鲨鱼，就是鲨鱼的那个心。那我们身边还有很多的动物啊，比如说那个猪就是那个猪心，那个小狗就是那个狗心可是那个心。终究要回到妙名真心。回到那颗佛心，它是和佛无二的，它是一样的圆满，所以这个就是我们不断的修行的过程。所以无论我们当下在哪里。我们当下有多么的无助。我们要知道，唯一的路只有我们不停的去增加智慧，去过每一条苦难的河流。到达那个对岸，不停的让自己回到那颗妙明真心。所以整个心经就是指导我们的方法。</p></div>"
  },
  {
    "title": "第二讲-观自在菩萨",
    "html": "<div class=\"B1_text\"><h2>观自在菩萨行身波若波罗蜜多时。</h2><p>我们先讲观自在菩萨。是指的一个人一位菩萨，也就是我们熟知的观世音菩萨。菩萨有很多的圣号。佛有很多的圣号。每一个圣号表的都是一种法。所以是一个名自，也是一个法，在表什么法的时候，就会用什么样的圣号。那我们看整个心经的开篇，观自在菩萨表的是如何自在的法？何为自在呢？不被万事万物所束缚叫做自在。比如说当我们被绳子捆住的时候，我们会觉得自在吗？我们举个例子啊，说一个小鸟，你把它放在一个笼子里面。缺少食物的时候会给它食物，渴的时候呢旁边也有水。这个小鸟呢，在这个笼子里面可以跳来跳去，但是他想要飞出去是不可能的。所以你看，小鸟，它自在吗？不少吃，也不少喝，可是呢？好像它也不是很自在。那观自在呢？我们要学会观自己自不自在，看看自己哪里不自在。鸟有可能被鸟笼所困，不自在。那我们自己人会被什么所困而不自在呢？人都是被自己的念头所困的。当我们被自己的念头困住的时候，就开始变得不自在。</p><p>为什么叫心经啊？困住我们的是心念了。</p><p>比如说，当我们想要更大的房子，求而不得，就会产生烦恼和痛苦。当我们想要一个东西，没有达到我们的满意，求而不得，我们就会很痛苦。我们当下想让自己清静一点，可是清静不了就会产生不自在，就会痛苦。所以整个这些让我们束缚的，都是我们的念头，都是由我们的心念所产生的。所以我们自己来观，哪里是自在的，哪里是不自在的。哪里不自在，我们就要修哪里了，哪里不自在，我们就要放下哪里了。那我们再来看观自在菩萨，菩萨它是大自在的。它是自由自在的，自在是一种境界，是一种状态。那我们反观自己，我们达不到自在的境界，那我们就观不自在。我们哪里不自在，我们就去修正，哪里被什么念头所困，我们就舍弃掉什么念头。这个念头要如何舍弃呢？你得舍掉那个欲望。我们生而为人，已然不自在了，因为我们有色身。我们需要吃，我们需要穿，我们需要喝，我们还需要那么多复杂的欲望，财色名食睡，样样都想要，所以已然变得不自在了。观自在菩萨这个境界。不想吃的时候就可以不吃啊，不想喝的时候就可以不喝呀。我们不行啊。不吃饭我们饿呀，不喝水，我们渴呀。所以这是我们人的最基本的欲望，除了这个以外的欲望都会让我们产生不自在。所以修行为什么要不断的减少欲望呢？只有我们的欲望变得越少，我们才相对变得越自在。我们的欲望变得越多，我们苦苦的向外寻求，越求越不自在，我们被束缚的就越多。起码我们做人。可以达到的那个自在的状态就是我们的欲望极其少，我们的生活非常的简单。当我们以这个简单作为自己行为的标准。所有在得来的，你会发现，都是我们可以享用的，都是我们可以享受的。我自己的心念，只要吃饱就可以了。我只要有衣服穿就可以了，这个时候你会发现我们已经拥有的很多了。我们为什么会不自在呢？我们的期望总是过高？而现实好像达不到我们期望中的那个样子，就产生了念头，就产生了痛苦。当我们对自己的标准要求如此。第一的时候，只要满足我们最基本的生命的需求状态就可以了。这个时候你会发现你的自在就会变得多一点，那当修到一定的境界的时候。这些我们可以舍掉，包括我们的肉身都可以舍掉。本来佛法就告诉我们，四大皆空，我们的身体都是假和而成。当最后我们再把身体空掉的时候，才能入圣贤之流。才能达到观自在菩萨的境界。所以我们的烦恼，皆是因为多余的欲望太多。这些多余的欲望就是囚禁我们的牢笼。鸟是被，鸟笼所囚我们自己是被自己的心牢所囚都是自己的念头，让我们变得不自在了。所以我们看以前修佛法的人，是不是一无所有啊。一钵千家饭，孤身万里游就可以了，只要吃的饱。去乞食，有饭吃不饿肚子能保证生命的存活，其他的都不需要。这个才是大自在的境界啊，比如说我们从小去看的电视剧济公活佛。看看济公是不是这样的状态。我们再去看看，儒家和道家的人也同样如此，我们去看看道家的人什么都不需要，何其潇洒，飘然无外。我们去看看，儒家也是一样的，孔子说，取功而正有，粗茶淡饭，乐就在其中了。颜回说，”一箪食一瓢饮，人不堪其忧回不改其乐”。一碗水一碗饭足以啊。现在就是因为我们的欲望太多了，才让我们不自在的。我们想要的东西越多，我们就越不自在。那这个时候我们再回过来讲。当我们把自己的欲望和期望值放的那么低的时候。你会发现并不是你不要了，而是你不被物所缚，不执着在其中，这个时候你才能自在。那我们回头再来讲，“观”观自很重要啊。刚才我们说了观自在，观不自在。看看自己哪里不自在，就修哪里，哪里不自在就舍哪里。那观自在用什么观呢？用身体可以观得到我们自不自在吗？观不到吧，要用心观了。用心去观我们的念头，哪里不自在？我们的思维哪里不自在？我们的感受哪里不自在？再举个例子。比如说我们对面坐一个人。在和我们聊天，他说，有很多的烦恼，有很多的痛苦，有很多的不自在。你用眼睛可以看到这个人的不自在吗？看不到吧。你要跟他聊天，通过他表述他的生活现状，他为什么而痛苦和烦恼。这个时候你才能观到知道他的不自在并且去给他方法。那我们观自己更是如此，是用心观的。观自己哪里自在，哪里不自在，我们都是被自己的心念所缚。那个心念才是我们的牢笼。所以我们不停的去观自己的心念变化。观自己的思维变化，被什么事情所束缚，我们就修掉？什么事情我们就舍掉，什么事情才能得那个自在。我们可以去观我们的念头，去了哪里啊？去追一个衣服。去追一个更大的房子，去追一个车子，去追一个票子，去了哪里呢？去了哪里就是我们那个念头让我们不自在的地方，所以我说，我们的念头每天都是杂念纷飞的。为什么有八万四千烦恼啊，因为我没有八万四千个念头在飞呀。有八万四千的念头在跑，这些念头让我们不自在。所以当我们懂得止住自己的念头的时候，才能变得自在。否则，就是杂念纷飞的，我们这个心就是静不下来的，所以首先要学会观。观自在菩萨，菩萨是什么呢？菩萨叫菩提萨埵，菩提是觉的意思。觉悟觉醒萨埵是有情。有情，众生的有情，所以菩提萨埵是觉有情。菩提萨埵还有另外一个理解道理是一样的。菩提是佛道，萨埵是成就众生。所以什么叫菩萨呀，用佛道成就众生的人，叫做菩萨。所以我们再来讲观自在菩萨。不是一个人，是一种精神。是一种境界，是一种状态。是自觉以后再去觉他。是用佛道在成就众生，这一类人都叫做菩萨。它是一种精神，它是一种状态啊。所以我们每个人都可以是观自在菩萨。先观自己是不是在。自己自在了，再去觉醒他人，让他人也变得自在，这个就叫做菩萨呀。比如说我们在生活当中，是不是有人经常用菩萨这个人来形容他人？说我身边有一个什么样的朋友像菩萨一样？说明他在不停的帮助他人呢，他在救人慧命。他自己觉醒了，在帮助他人觉醒，这样的人，我们都可以称他为菩萨。正在行菩萨道，所以我们每个人都可以是菩萨。我们生而为人，我们未必能做到样样自在。可是呢，我们哪里自在了，我们就可以用我们自在的这个方面去帮助他人。让他人也变得自在。行深般若波罗蜜多时。首先要观，观以后要干嘛呢，要行啊，所以叫修行。行深般若波罗蜜多时，说回想当初，那个时候，是时间吧，行深般若波罗蜜多时，这个是时间概念。我们先要理解时间概念，我们接下来再讲行深般若波罗蜜多时。有观还要有行，行深，深是只达到了一定的境界。般若是智慧，波罗蜜多是到彼岸，我们在行深到达彼岸智慧的时候，照见五蕴皆空，度一切苦恶。在什么时候能照见五蕴皆空呢？行深到彼岸的智慧，那个时候。达到了一定的境界，自然就出现了，那个果叫照见五蕴皆空。我们刚开始观是不够的，自己哪里不自在，要去修哪里？要去行啊，行深般若波罗蜜多时，行到了一定的境界的时候。照见五蕴皆空，发现原来五蕴都是空的，一切都是空的。这个时候度一切苦恶，这个时候你才能解脱，度脱一切苦恶。所以很多人经常问呢，我如何才能没有烦恼啊。先观后行，你行到一定的程度的时候。你才能照见五蕴皆空，你突然发现啊。原来五蕴都是空的，世间所有的一切都是幻想。这个时候，你才能度一切苦厄。我们为什么会有那么多的苦厄呀？就是执着于所有的事情，所有的东西执着于房子，不了解它是空的。执着于车子不了解它是空的，执着于感情不了解它是无常的。执着于世界万事万物，认为它是永恒不变的，所以才产生了痛苦啊。那我们如何才能得自在呢？你得了解这些空性智慧。你要知道它。凡所有相，皆是虚妄。你把这些虚妄的相都破掉的时候，你再回到当下。这个时候你会发现你的念头才会变少。所以只有观是不够的，你要不停的去行深般若波罗蜜多时，行的是什么呀？是到彼岸的出世间智慧。不是世间智慧，世间的智慧，你行得越多，陷得越深，更不得自在。人们总是认为我拥有了更多。我就变自在了，我就变幸福了，我就变开心了。实则不是这样的。你拥有的越多，你越难放下，你也就越不自在。行的越多，我们的智慧自然也就在不断的增加，我们的境界就在不断的提高。我们的自在就会多一份。我们到达彼岸的智慧自然也就多一分，我们就多照见了一层空性。直至圆满为止。</p></div>"
  },
  {
    "title": "第三讲-五蕴皆空",
    "html": "<div class=\"B1_text\"><h2>照见五蕴皆空度一切苦厄。</h2><p>当我们照见五蕴皆空的时候，就可以度一切苦。照见五蕴皆空，他首先是一个果。它的因在行深般若波罗蜜多时。当我们去行，到达彼岸的智慧到一定的程度的时候。出来的结果就是照见五蕴皆空。那接下来五蕴皆空又成了一个因。度一切苦厄，又成了一个果。当我们照见五蕴皆空的时候，自然就度一切苦厄。就没有了所有的苦厄和痛苦，那我们先来讲什么叫五蕴皆空？我们暂且把五蕴称为念头。当我们的念头都空掉的时候，就没有痛苦和烦恼了。如果我们讲把念头都空掉的时候，这个念头不好理解。所以佛法把它分为五蕴。蕴就是集合，念头的集合，成为蕴。把它分为五种念头的集合，也就是五蕴，五蕴有”色受想行识“这五蕴，首先，我们来讲色蕴，色蕴在佛教当中有狭义的和广义的，狭义的解释。我们能看到的都成为色。所以六尘还叫色声香味触法，那里的色就是指的狭义上的。我们能看到的一切美好的事物，能看到的一切相都成为色。那还有广义上的色，我们看到的，听到的，闻到的。尝到的的身体所触碰到的都成为色。这里的色是指的广义上的色。我们讲六根的前五根“眼，耳，鼻，舌，身，意”，都是来取色相的，比如说：我们眼睛看到的称为色。我们耳朵听到的称为色，我们鼻子闻到的称为色，我们的身体通过触觉。所感受到的也是色。所以广义上的色，我们看得到的，看不到的，只要是取回来的相都是色。那我们用什么取的相呢？金刚经有句话：“若心取向，即着我，人，众生，寿者”。这里的“心”是第六意识心，我们刚才讲的，眼，耳，鼻，舌，身，再加上意，统称为六根。这个意是来取相的，意来支配我们的眼睛，支配我们的耳朵，支配我们的鼻子，支配我们的身体，支配我们的舌头。比如说：我们看到一个东西，我们首先。是不会产生任何的想法的，比如说我们看到一朵花，它只是一朵花。这个时候，我们的意识来开始分别，它是红色的。白色的还是紫色的？我们的意识来开始分别我喜不喜欢这个颜色。当我们听到别人一句辱骂的话语，首先，这是耳朵的功能，听到。用我们的意识接下来才去分别。他说的话是好听的还是不好听的？让我产生了高兴还是不高兴的？所以意识来支配我们的眼耳鼻舌身的统称为六根。那我们这里的色是指的眼耳鼻舌所取回来那个相。是这些色相，那我们的“六根”，对应的叫“六尘”。“眼耳鼻舌身意“叫六根，”色声香味触法“叫六尘。六根也叫六入。为什么叫六入呢？所有的尘都是从六根入的。六根就是六个根本，说我们有眼睛啊，这是一个根本，有眼睛这个工具，我们才能看到。有耳朵这个工具我们才能听到。有鼻子这个工具，这个根本，我们才能闻到，有身体，我们才能产生触觉。所以六根对应的是六尘，眼睛对应的是色，看到的色相。耳朵对应的是声音听到的声音。鼻子闻到的是香臭，好闻或者不好闻。舌头尝到的是味道，好吃或者不好吃。身体对应的是触觉说我碰到一个东西呀。不舒服，他很坚硬，扎到我了，说，我感觉现在好冷，感觉现在好热。这都是身体产生的触。意产生的是法，当我们的意识学到了一个什么东西，接触了一个什么新鲜事物就产生了法，举例：我们看到一朵花朵，在我们不认识这朵花朵的时候，我们是没有法的，我们不知道它叫什么花朵。这个时候有人告诉我说这个叫做玫瑰花，这个时候我们这个“意”。就是能思考的，能思维的那个东西叫“意”。这个时候有人告诉我们它叫玫瑰花，我们一就产生了法，从此以后，我们就知道他叫玫瑰花。所以“意”对应的是法，还有叫六识什么叫六识呢？“眼耳鼻舌身意”六根。对外面的“色生香味触法”六尘，中间的功能叫六识。所以合起来又叫做十八界。那我们再回来讲五蕴的色，我们能听到的，看到的文道的身体，触觉所产生的一切相和一切物质。都成为色了。色受想行时，有了色，我们就会产生受，比如说我们取回来的相，我们就会产生感受了。比如说，我看到了一朵花，我就产生了感受，这个花真漂亮。我听到了一句不好听的话，我就产生了感受，我非常不舒服，他为什么要骂我呢？我听到了一句赞美的话，我就产生了感受，我这会很高兴。我触碰到了冷，我就产生了感受，哎呀，好冷，好不舒服啊。我的身体取了相。太热了，我就开始有感受了。所以受是应色而生的。受又分为苦受，乐受和舍受，比如说：别人说了一句不好听的话，我觉得很痛苦，这个就是苦受。我看了一个美好的景色，我很快乐，很高兴。这个就是乐受。舍受就是无苦无乐的，比如说我们生活当中经常有这种感受啊，发生了一件什么事情。你是没有感受的，没有什么可高兴的呀，也没有什么可不高兴的，这个就叫舍受，无苦无乐。接下来，就到了“想”色受想取了色相。有了感受，接下来就有想法了，这个时候，想法就是思维。开始有思维，开始思考了。举例，我们看到了一朵花，这是色相。感受它很漂亮，这个时候有了受，接下来就要产生想法了。我想把它摘下来。想法就出来了。他刚才说了一句不好听的话这个是相感受我很不舒服。接下来就开始产生想法了，我恨他，我讨厌他，我要找机会报复他或者我当时我就要骂回去。这都是“想”思维开始出来了。“色受想行”，接下来就到了”行“了，“行”这个时候是心念心行。我们讲的五蕴都是心法，所以这里的行不是行为是心行。一个念头接着一个念头不停叫做”行“。比如说：刚才我们看到的这朵红色的花。我们产生了想法，想把它摘下来，这个时候我们就产生行了下一个念头好像不好啊。摘下来别人看不到了算了，我管它呢，我把他摘下来再说嘛。你看这个时候，一个念头一个念头开始不停，他刚才说了一句不好听的话，让我觉得很难受。我心里很怨恨他，我也想骂回去，这个时候行就是更深一步的心行。我要骂回去不行。他对方人多我骂回去万一打不过他怎么办？哎呀，他是那样没有素质的人，我又何必骂他呢，可是不骂他我也很生气，等我以后有机会，我一定报复他。你看，我们的心上的想法，念头，一个接一个的不停息。这个时候我们就产生痛苦了。这个叫做行，行，也是造业的前身。我们先开始心上行，心上行产生了一系列的想法和念头。接下来就产生了行为了。比如说我们要产生一个善的行为，我们要去帮助他人，就有善意了。接下来，比如说他不停的骂我，我要想办法去报复他，这个时候，我们的行为产生就会产生恶意了。所以行也是业的前身，当我们不停的在心上行的时候。行到一定的程度，我们就会变得愤怒。我们就会变得有所行动。这个时候就开始产生业力了，当我们思考一件事情的时候。不会一个念头起就止住的。比如说我们现在，想相一下下午要发生的事情，是不是不是一下就想完了。一个念头接着一个念头，不停的去想，这个就叫行。色受想行识。这个时候就产生了“识”。这个识就是我们能思考的，能思维的，所得出来的法。能思考的所得出来的法中间的那个功能就叫做”识“。我们是有意识的，这就叫识。如果没有意识的人就是植物人呢？他是不能思考，不能思维的就是没有意识的。这里识比较复杂。识又分为八识。眼识，耳识，鼻识，舌识，身识，意识。这是前六识。我们绝大多数的朋友都知道的“眼耳鼻舌身意”。我们的眼耳鼻舌身，这是五根，不是识。对应的色生香味触那叫六尘，中间起作用的这个叫做识。比如说我们的眼根看到一朵花，我们觉得它是好看的。或者觉得它不好看的这个功能叫做识。然后眼耳鼻舌身，我给大家举个例子。如果在一个企业当中眼耳鼻舌身就相当于员工。意识这个意，就相当于领导，这个领导是支配着员工的。比如说我们眼睛看到一个东西是通过意识。来告诉我们，它是一朵花，它是一个草，它是一个杯子，它是一个房子。比如说我们的耳朵听到一个声音是意识。再告诉我们，这个声音好听还是不好听，是赞美我的还是辱骂我的？我们刚才举例子提到过，没有意识的人成为植物人，你看，植物人他的眼睛还在。他懂得分别是什么东西吗？是不是不懂的？植物人他的耳朵还在。他知道你是骂他的还是赞美他的吗？他是不知道的，因为没有意识去分别和分辨。所以，意识是支配着我们前五根所产生作用的。我们每个人的意识又是不相同的。举个例子：有的人看到花觉得它好看，有的人觉得它不好看，有的人喜欢红色。有的人喜欢白色，有的人喜欢粉色。当发生一件事情的时候，每个人所思考出来的法是不是也不一样了？我们的每个人的意识都是有差别的，这个差别从哪里来呢？从我们的生存环境。从我们的生活环境，从我们学习所得到的认知不同。我们学习和没有学习的人同样面对同一件事情，是不是你所有的法是不同的？举个例子：我们现在正在这里拍摄视频。面前我们做着十个人，那我们这十个人是不是对于拍视频这件事情，有的有法有的没法呀。有的会拍，有的不会拍，为什么呢？学习过的东西不一样，所产生的法就不同，我们每个人从小生活的环境不同。接受到的思想，接受到的社会，接受到的认知不同，就会导致我们每个人的意识不同。所得出来的法不同，所以当我们遇到一件事情的时候。我们每个人都有不同的想法，不同的法。举个例子，比如说在一个企业当中，同样碰到一件事情，你会发现事情是一样的。基层员工和部门经理还有董事长来解决这件事情的方法是不是不一样啊？是不是越高境界的人看这个事情越小，解决起来越容易？为什么呢？意识不同，思维不同，所得出来的法就不同？所以，这个意识是通过我们自己的认知不断的学习所建立起来的。</p></div>"
  },
  {
    "title": "第四讲-五蕴皆空",
    "html": "<div class=\"B1_text\"><p>然而。”眼耳鼻鼻舌身意“这六识是我们平常都要用得到的。接下来，第七时叫末那识，第八时阿赖耶识。第七识和第八识是我们用不到的，也看不见的，我们再从第八识开始讲。学佛有一句话叫自性圆满，人人都有一颗妙明真心。人人皆具佛性，众生皆可成佛。我们每个人，每个众生都是有。佛性的都是有佛心的，这个成为自性。自性一体两态两种形态，迷的时候叫阿赖耶识。不迷的时候叫自性，他是圆满成佛的。我们被迷住的时候，就是阿赖耶识。所以说自性是一体两态，举个例子：好比说是水。水，在它原本的状态下，它叫水。冻了冰以后，他叫冰，这个时候你能说冰不是水吗？它是水，但是你也不能说冰就是水啊，因为它不是原来的那个水呢。所以，自性也是一样的，觉悟的时候就是佛呀。就是自性圆满的，迷住的时候，就是阿赖耶识这个时候阿赖耶识。要随着业力去轮转投胎了。所以当我们众生被迷住的时候，那个自性的。另外的一面一体两态，叫阿赖耶识，它就出现了，我们就开始投胎入轮回了。举个例子：为了大家好理解，我们把原本的那个自性比作是面粉，说原本那个自性是通透的。是圆满的那个就是佛就是佛，性就是佛心，它就是面粉。当有一滴水进来的时候，面粉就成了面团。当这个面粉成了面团，就是迷住的状态。迷住的状态就叫做阿赖耶识，就是我们粒子当中的面团。当我们成为这个面团的时候，下一步就是要投胎的。那投胎到哪里去是根据每个众生的业力不同。所投胎的地方就不同。佛家讲六道众生都是随业力所转，比如说我们这个面团，就是那个阿赖耶识。这个时候我们成为面团，就是迷了，从面团开始。我们投到六道当中，就要产生不同的形态。比如说要想做成饺子这个面团，就要成为饺子皮，要想成为包子，就会成为包子皮。要想成为面条，就会被擀成一条一条的，这样的面条，我们下一步就成了饺子，包子面条。这个时候开始，我们成为了包子，饺子，还有面条，就是第七识。就是末那识我们的第八识的状态像一个面团。还没有成型，但是接下来要去投胎了，当我们投胎成为一个固定的形态。比如说面条，包子，水饺。这个时候，我们就是有了第七识了，叫末那识，比如说。我们从阿赖耶识投台到人，投胎到动物，投胎到天人道，投胎饿鬼道，这个时候我们就有了第七识成为末那识。当我们有了第七识末那识的时候有了自己的形态，比如说人道，动物道。比如说成为包子，成为水饺。这个时候，我们的第七时就产生了，也就有了我们平时所讲的先天的习性。比如说有的人天生就聪明。有的人天生就愚笨，有的人天生的脾气就暴躁，有的人天生就比较勤奋。这个时候就是我们先天的习性，我们之所以投到人道。畜生道或者天人道，是由于我们阿赖耶识的业力不同。我们所产生的形态就不同。同样身为人，我们每个人先天的习性又不同。比如说，我们刚才举了这些例子。是告诉我们，每个人先天的习性就不同。为什么会不同呢？他跟我们阿赖耶识里面的业力是相关联的。所以学佛有一句非常著名的话，万般带不走，唯有业随身。我们这一生所有的东西我们都是带不走的。无论我们有多少金钱，我们有多少房子，我们有多少产业，都是带不走的。但是，唯有业随身。只有你的善业和恶业是跟随着你的。我们所造下的这些善业和恶业。决定了我们阿赖耶识里面所储存的业力，决定了我们下意识投胎到哪里去。决定了我们同样生而为人，我们天生的习性和性格各不相同。所以我们修行的第一步啊，都是止恶扬善。不要去做恶业，先去做善业，这样我们下意识的头胎才能变得好一点。即使同样身为人，我们的福报更多一点，智慧更高一点。我们的习性更好一点。我们天生更良善一点，这些都是由我们自己的业力所轮转的。当我们有了第七识的时候，就有了先天的习性，接下来开始我们人。开始出生，随着我们的出生，就有了前六识眼，耳，鼻，舌，身，意。我们是有眼睛的，是有耳朵的，是有鼻子的，是有舌头的，是有身体的。这里的意啊，是能思考，能思维的那个第六意识心。是生而为人，他就有的。所以这个时候，我们从自性产生了业力开始。从第八识阿赖耶识要准备开始投胎了，从第八识要投胎的时候，得转化一个形态。又产生了末那识，随着末那识，我们要开始出生就产生了眼耳鼻舌身意再加上。末那识，阿赖耶识统称为八识。那为什么说人人皆可成佛呢？比如说我们成为了水饺，成为了包子。那我们水饺和包子当中，有没有原本的自性的那个面粉呢？是不是都有啊？都有，可是他又不是面粉，就像我们，我们现在有了眼耳鼻舌身意。那我们这里面有没有自性呢？还有自性，只不过他被迷住了。就像水饺和包子，虽然里面还有面粉。但是他还掺杂了很多其他的东西，所以这个时候就见不到自性。就好比是我们是一个水饺，是一个包子，我们这个时候见不到面粉本身了。所以修行。就是不断的去掉我们眼耳鼻舌身意。所取的像我们不取相，不造业，让自己回归本来清明的状态。也是明心见性的过程，才能见到本来的那个自性。那我们了解了自性有什么好处呢？我们了解了第八识了解了第七识，是为了做什么呢？让我们知道，眼，耳，鼻，舌，身，意前六识都是假的。都是我们被迷住的众生采用眼耳鼻舌身意，所以我们要知道，我们所有的取回来的相都是假的。我们明白这个道理，是告诉我们不要执着，当我们以饺子的眼光去看包子。就会说，你肚子怎么这么大？你怎么那么富有啊。为什么我不能变得那么大？我们是饺子，又看到了面条，你怎么那么苗条啊。你怎么可以那么长啊？你怎么可以那么好看呢？为什么我不能如此的苗条呢？你会发现，当我们以这些假相，以我们的前六识去看待这个世界。就会生出来这样的想法和攀比之心，但实则它都是假的。我们回归到原本的状态，都是自性的状态。人人皆是佛，本来都是那个面粉所演化而成的。他当下变成包子，他当下变成面条。只不过是和我们的业力不相同而已。那我们再举个例子方便理解，比如说。我们现在是个矿泉水瓶，是个饮料水瓶。是个塑料杯子，那我们原本的那个状态。都是一摊塑料啊。当这些杯子，瓶子被回收的时候，它又重新变成了一堆塑料。那下一步这个塑料可能原本瓶子的变成杯子，杯子的又变成瓶子了。所以我们人也是一样的，都是随着自己的业力所轮转，我们今生是瘦的。来世可能变胖，我们今生是人，来世可能变猪。我们今生是人，来世也可能变成神仙，它都是随着我们自己的业力所轮转。所以说，万法皆空，为因果不空。所有的法都是空的，都是方便法，都是告诉我们这些道理和智慧的，但是因果是不空的。造了什么样的业，就会得什么样的果。我们经常听到一句话呀。佛眼看世界，看众生都是平等的，无善无恶，无美无丑，什么都没有。但是我们用肉眼看世界，就有高矮胖瘦美丑啊。为什么佛眼看世界它是平等的，无差别的，一切都是空的呢？因为佛眼看世界用的是自性。我们如果明心见性，用那个自性看世界，他也是空的，一切也是平等的，什么都没有。所以告诉我们，照见五蕴皆空，度一切苦厄。当我们行深般若波罗蜜多时。到一定的境界的时候，所呈现出来的果，就照见了五蕴皆空。什么都是空的，色受想行识都是空的，所以这个时候就回到了自性的状态。就是我们所称的觉者，当觉悟的回到自性的状态，他本来就是圆满的度一切苦厄。没有一切的苦和厄，照见五蕴皆空，度一切苦厄，圆满成佛了。那当我们做不到赵建五蕴皆空的时候，我们可以往下一层再讲一讲。按照我们接地气的想法去讲，如何在生活当中用。可以不入色声香味触法，我们修不到无，我们可以不入。比如说听到他骂了我一句。我知道了这件事情的本质，我可以不生气，不愤怒，不烦恼。比如说他骂了我一句，本质是什么呢？本质他骂的这句话他只是一个声音。他骂的这句话和赞美的那句话，和鸟叫和猪叫和狗叫和外面过去一个汽车的声音，它的本质都只是一个声音而已啊。那这个时候，我们意识不去分别，不去分辨的时候，他说的一句话就是一个声音。他赞美的一话，又是一个声音，现在外面还有鸟叫，这个鸟叫也是一种声音。我不会因为这个声音而产生烦恼和痛苦，这个就是不入。当我们懂得不入的时候，我们生活当中的烦恼，痛苦就会变少。我们少取色相，这个时候我们的烦恼就会少一层。所以我们去看，修持佛法的人，有一定的修为的，是不是看什么事情都是淡然的？看到一个美丽的事物也不贪着，看到一个别人觉得不顺眼的事情，自己也很淡然，听到了一句不好听的话，自己呵呵一笑了之。这都是不入的表现和境界。当我们达到不入的时候，我们的烦恼也会变少。所以这是我们生活当中关于不入的用处。我们一下达不到五蕴皆空，但是我们可以次地而行，从不入，再到空。比如一朵花也是一样的，我看到一朵花它的本质就只是花呀。没有什么好看和不好看，这个时候我们就不起贪着之心。我们就不取相，我们就没有那么烦恼。当我们觉得花非常漂亮的时候，我们特别喜欢一朵花的时候，你会发现，就会起贪着之心。当它凋零了，我们就会痛苦。我们特别喜欢一个东西的时候，如果他丢了，我们就会痛苦。我们特别喜欢一个人的时候，当他(她)离开我们了，我们就会产生痛苦，就是因为我们入的太多了。所以烦恼和痛苦自然就会多。那我们再反过来讲，那我不贪着，是不是我就不要了呢？不是的。是我们要，但是我们并不贪着于要，这个就是不迷的状态，如果你很贪着，就是迷。举个例子啊：我们喝茶，如果你很贪着，必须要喝红茶，喝别的茶，我就不高兴。我就不开心，我就产生苦恼。这个就叫迷，什么叫不迷呢？我可以喝茶呀。有红茶我就喝红茶，没红茶我就喝绿茶，又有什么区别呢？有没有茶都一样，我喝水也是可以的，这个就是不迷。比如说我们平时在做事情当中也是一样的。有的人做事情我只为了追求利益，只为了追求名望。这个时候，你就是迷在里面的。因为迷，你就会产生很多过激的行为，就会造业。那什么叫不迷呢？我也积极努力的去做事情，结果来了，有财富我可以要啊。有名望我可以要啊，但是我不是为了追求名望和财富而去做事情。我是为了把因种好，把事情做好，既来之则安之，这个时候你就是不迷的状态。五蕴皆空度一切苦厄了。当我们还不能五蕴皆空的时候，我们可以循序渐进的去修行。所以我们了解了五蕴，了解了八识就是为了让我们次地而行。一步一步来，我们行得一分。行深行得一分，到达一个境界，我们就减少一层苦恼。</p></div>"
  },
  {
    "title": "第五讲-度一切苦厄",
    "html": "<div class=\"B1_text\"><h2>度一切苦厄，“度”是救度脱离的意思。</h2><p>度一切苦厄，我们先讲讲苦，苦啊，有无量无边的苦。太多了说不清楚多少种苦。所以呢，我们简单的来讲，它又分为三苦和八苦，三苦呢，有苦苦。坏苦和行苦。我们先来讲讲苦苦，比如说疼，或者身体的痛，冷或者热，这都是苦苦。坏苦是乐过之后的苦，叫做坏苦。比如说，我们特别喜欢这个杯子，这个杯子丢了，就是坏苦。我们特别喜欢一个人，这个人离开我们了，这就是坏苦，我们特别喜欢一件衣服，这件衣服不能穿了就是坏苦。就是乐过之后所产生的苦。任何事情都是相对的，有乐就不乐呀。有我们喜欢的事情就有不喜欢的事情。有让我们高兴的事情，就有让我们不高兴的事情。当我们喜欢赞美的时候，当他不再赞美我们了，就开始产生坏苦了。所以你看，我们生活当中这样的苦太多了，我特别喜欢一个人，我当时是很快乐的。突然他（她）有一天不喜欢我了，他有一天离开我了，你有多快乐，就有多痛苦。我喜欢这个杯子，你有多喜欢，过后就会有多痛苦。所以这是坏苦。行苦，事物不停的变迁所带来的苦叫行苦，比如说我们随着年龄越来越大了。也会产生痛苦啊，我不再年轻了。做很多事情力不从心了，再比如说我们原本是富有的，开始变得贫穷了。产生痛苦啊。我们原本生活在繁华的都市，现在回到了冷清的小镇，开始痛苦啊。我们原本的生活状态。是很安逸的，很潇洒的，很自在的，我突然开始工作了。压力变得很大，每天变得很忙碌。痛苦啊。所有的随着事物变迁所来的苦，都成为行苦。人生最大的行苦，是不停的轮回啊。今生做人，下一世有可能做天人，有可能做阿修罗，有可能去畜生道，有可能去恶鬼道。不停的轮转，不停的轮回，这是最大的行苦啊。照见五蕴皆空，度一切苦厄，否则我们生在人世间，身心皆苦的。刚才讲了三苦，还有八苦，生，老，病，死，求不得，爱别离，怨憎会，五阴炽盛，还有着人生八苦啊。</p><p>生苦，比如说我们是一个胎儿，刚开始入胎的时候，在母亲的腹中就开始说苦，比如说：母亲吃了凉的我们会不舒服，吃了热的我们也会不舒服，比如说母亲弯腰的时候我们觉得不舒服。肚子被碰到的时候，我们也觉得不舒服，所以从生开始就有苦啊。</p><p>老苦，当我们随着年龄不断的增长，我们的身体机能在不断的退化。我们的经历也开始变得不好，被各种病痛所折磨。到老了以后呢，还不一定有人照顾你。即使有人照顾我们，我们也是难受的，也是痛苦的，很多事情想做也不能去，做了做不了了。所以当老人也是苦的。病苦呢，我们这一生当中，要各种疾病。围绕着我们，即使是一个小小的感冒，我们也是很不舒服的。况且，到了我们这个时代，随着人们业力不断的增长，各种疾病变得越来越多。各种癌症变得越来越多，所以我们要承受病痛的折磨，病苦，死苦。当我们面临死亡的那一刻。还有诸多的放不下。还有诸多的恐惧，临死之时犹如扒皮波谷。</p><p>所以也是很痛苦的求不得，当我们有贪欲得不到满足的时候而产生的痛苦。我们这一声不停的向外去追逐。想吃的更好，求而不得，就会痛苦。想穿的更好，求而不得就会痛苦。我们特别喜欢一个人，但是对方不喜欢我们，或者由于种种原因得不到。求而不得，就会产生痛苦，求生观做不到痛苦，求发财求不到痛苦。爱一个人爱而不得也会痛苦，所以有求则苦，爱别离苦啊。当我们爱一个人不得不分开的时候，痛苦亲人离世的痛苦。我们有一个很好的朋友，两地分开。痛苦啊，即使我们有一个心爱的宠物，没了丢了也会痛苦啊。我们有一个心爱的东西丢了痛苦啊。所以我们这一生，要承受诸多的爱别离，只要是相爱的人,爱人，亲人，友人，我们喜欢的物品。和我们产生了分离，产生了别离，都要痛苦的怨憎会我们讨厌一个人的时候。痛苦啊。我们讨厌一件事情的时候痛苦,我们很讨厌一个人，还不得不和他在一起工作。痛苦啊!我们在婚姻当中明明不爱一个人了，还不得不生活在一起痛苦啊！为了孩子放不下呀，我明明不喜欢一个工作。不行啊，我得赚钱养家呀。痛苦呀！我明明不喜欢做这件事情，我不得不做，痛苦啊！我住现在的这个房子，我住的不开心，太小了，太破了。我想要一个更大的房子。可是没有办法我实现不了啊，痛苦啊。</p><p>五阴炽盛五阴。就是我们刚才所讲的五蕴，照见五蕴皆空的五蕴。五阴炽盛是什么？像火焰一样燃烧五阴炽盛，也是我们一切痛苦的根源。被迷住了，不停的颠倒妄想，认妄为真呢。每天活在颠倒里面，是整个我们的身心都是被迷住的。被五蕴所颠倒的。每天沉浸在五蕴的”色受想行识“当中，才产生了诸多的苦恼和痛苦。所以我们去学心经，就是让我们迷途知返。让我们不再颠倒，让我们知道，我们现在所看到的一切都是假的。告诉我们原本还有一个自性，还有一个妙明真心。我们要去学习出世间的智慧，去到达那个成佛，回归自性的彼岸。我们不能一下到达彼岸的时候，我们要懂得次地而行。去过我们生活当中一条一条的苦海，过一条岸，我们的烦恼，痛苦才能少一分。我们现在所讲的“三苦”和“八苦”，不足以总结我们众生无量无边的苦。这八苦和三苦，是我们在日常的生活当中，在我们的人生当中经常遇见的。所以只能是举例说明，告诉我们人生还有诸多的苦，而只有我们自己懂得不断的去修行。让自己不断的去增加智慧，才能到达那个彼岸。</p><h2>度一切苦厄。</h2><p>苦讲完了，我们再讲厄，厄就是灾难。灾难有很多，比如说自然现象。地水火风，地呀，我们要承受很多大地给我们带来的灾难，地震了。水还有水灾呀，发洪水呀，火还有火灾呀风暴风雨啊。台风啊这些自然现象都会给我们带来灾难。除了自然现象以外，我们生活当中也会有很多的灾难发生，有很多的意外发生。所以，越是不顺利的人，越会讲，我的生命当中真的是多灾多难。所以我们生而为人，就是有这些苦厄的。只有我们照见五蕴皆空，圆满成佛，回归到那个自性，我们才能度一切苦厄。自然也就没有了人世间的苦厄，自然也就没有了六道众生的苦。我们讲苦和厄，又讲到有灾难，众生最大的灾难就是不得闻正法。一直在颠倒妄想当中，无有出期呀。这是众生最大的难。我们在今天这个时代还能去听闻正法。说明我们是有福报的，说明我们是有善根的。所以我们要懂得珍惜，要懂得不停的去修持正法，让我们回归原本的那个佛性。回归原本的那个圆满，才能度一切苦厄呀。我们不停的去学习正法，就是文字般若。通过不停的学习正法，我们不停的观照自己的心念行为。不停的观照生活当中所发生的事情。这个是观照般若通过观照自己所体悟到的智慧，生出实相般若。所以说，我们现在还能闻正法，闻正法，还能懂得去观照。还能懂得去观照自己的起心动念，还能生出实相，这是我们现在的福德。所以我们要更加懂得珍惜，更加懂得行持正法的难得和可贵。我们这里对于上几节课我们做一个总结。有一个人叫观自在菩萨。线观自己自不自在？自己自在了以后呢，去觉悟有情众生。观自在菩萨，行深般若波罗蜜多时，自己行持到一定深度的时候。照见了五蕴皆空。啊，原来五蕴都是空的。原来，人人都有一个自性，它是圆满的。原来人人皆可成佛，度尽了一切苦厄。没有了人世间的苦厄，没有了六道的苦厄。接下来，开始。我们再来一遍观自在菩萨这个时候自己自在了。用佛道来成就众生。又来告诉我们，行深般若波罗蜜多时，我就是这样行持的。我把他告诉给众生，大家也要这样去行使，当你也行持到一定的境界的时候，也会照见五蕴皆空，自然和我一样，度尽一切苦厄。这个时候都回归自性的时候，没有你我之分，人人皆可成佛。自性本然圆满。</p></div>"
  },
  {
    "title": "第六讲-色不异空",
    "html": "<div class=\"B1_text\"><h2>舍利子，色不异空，空不异色，色即是空，空即是色。受想行识亦复如是。</h2><p>有一女子眼睛明亮，长相端庄，叫做“舍利”，生子叫做“舍利子”。亦叫“舍利弗”，是佛陀的十大弟子之一以智慧著称，智慧第一。这里指的就是舍利弗，《心经》是大般若经的精华部分，是舍利子问观世音菩萨如何到彼岸的智慧，如何究竟解脱的智慧。有智慧的人才会问出来有智慧的问题，观自在菩萨开始。是阐述性的话语，这里开始是对话的模式。观世音菩萨在对舍利子讲话。“色不异空，空不异色，色即是空，空即是色”。我们想把这两句话听懂，先听懂两个概念，一个概念叫“色”，一个概念叫“空”。什么叫色呢？从狭义的解释眼睛看到的叫色，从广义上来解释眼耳鼻舍身。看到的，听到的，闻到的，所接触到的，有形的，无形的都成为色。这个世界上有我们很多看不到的东西，也有很多我们听不到的东西，但是不代表它不存在看得到的，看不到的。都称之为色。我们再往广义上来讲，眼耳鼻舌身意。意我们所思考出来的东西，我们所起的念头，也称为色。我们再往广义上讲。五蕴色受想行识皆为色。这里的识。就包含了前六识也包含了第七识“末那识”，也就包含了第八识“阿赖耶识”。只要是我们被迷住的那部分自性，随着阿赖耶识开始轮转，我们所有产生的一切意识形态的。也都称之为色。我们众生都是迷住的那个自性变现出来的。就是我们之前所举的例子，那个面粉。本来我们的自性就相当于那个面粉，但是我们被迷住了，开始随着阿赖耶识开始轮转。变成了包子，变成了水饺，变成了面条，我们所有被迷住的这些都成为色。所以我们说我们是被迷的，众生觉悟的时候，就圆满成佛，回归自性了。所以我们的念头也是色，所以我们再来讲一个词，一念一世界。这个世界是由我们的念头形成的。所有的色相也是由我们的念头形成的，我们先往生活化来讲，比较好理解。举个例子，今天发生了一件事情。别人得罪到我了。这个时候，如果我一念是宽容的。这个事情算了吧，他也是无意之失，他正在情绪当中，我不与他计较，这个时候他是一个世界。他发生的事情会不同。那再举个例子，我当时的情绪也是暴躁的，我就产生了更激烈的行为。可能两个人就开始了打架，开始了斗殴，甚至产生更严重的后果。这是所产生的另外一件事情的发展，也就是另外一个世界。所有的事情都是我们的念头形成的。举个例子说，这个杯子也是由于我们的一念形成的。是我们从某个地方，从互联网也好，从我路过哪一个店铺，我看到了这个杯子。我喜欢上它，我着于这个色相，这个时候，我就会把它买回来，这个杯子就成为了我的杯子，所以它是由于我的念起而成为我的杯子。那有的人说了，那如果这个杯子是别人送的呢？别人送的，也是我们的念头所产生的。别人送这个杯子，我们无论出于什么原因把这个杯子留下了这个念头起，这个杯子就成为我们的了。比如说我们当下住的房子车子都是一样的。说，我们当下住的这个房子，是我们想要买这样一个房子，念头起了。然后我们看到了这个房子，我们觉得条件都合适，我们就购买了，这个时候房子就成为我们的了。从源头起，都是一念所形成的，比如说我们的身体也是四大假合而成。当我们由于因缘和合，来到了这个娑婆世界，父精母血，本来我们是没有的，没有我们这个人的存在啊。只有一个阿赖耶识，在随着业力轮转有了父精母血。我们才产生了这样一个身体，后来经过母亲的十月怀胎，我们生出来了，我们出生了。我们出生了以后才有了这个身体，我们的身体也叫四大假合。所以我们都听过一句话叫四大皆空，这四大就指的“地，水，火，风”。当我们身体临终的那一刻，四大就开始散去了，最先散的是风，我们没有了呼吸，这个人就不在了。接下来是火，我们没有了温度，体温没有了，接下来是水。身体的水分没有了，肌肉开始萎缩，再接下来是地。我们的头发、皮、骨、会随着时间的推移尘土归土归土就开始消散了。所以他是空的呀。本来他就是从没有从空当中生出来的有最后还要归于空。比如说举个例子：这个杯子也是一样的道理，本来它不叫杯子，本来它可能是一堆玻璃。经过因缘和合而成的杯子，比如说，有工人，有生产线，有玻璃，有浇水。那比如说这个杯子如果碎了呢？他因缘不和了，碎掉了。他就不叫杯子了，我们就管他叫玻璃，可能就扔掉了。如果有回收的呢，他又回到了什么都没有的状态。那可能他在做成物品的时候，有可能就变成了一个瓶子或者一个盘子。所以什么叫空啊，无自性故空，它是不长久的，它是随着因缘和合而变化的，所以叫空。再举例子说：我们面前有一本书。这本书也是空的呀，空的不是说它没有不存在，是因为它不长久，无自性。比如说这本书，它的前身是没有书的。比如说：他只是纸张，再加上了印刷的技术，再加上了墨水。然后装钉而成，因缘和合成了一本叫做书。那接下来，如果这个书损坏了。被烧掉了，或者被扔掉的时候，就把它当成垃圾了。他这个时候就不叫做书。然后如果再被回收回去，他又打破了他原来的状态。所以你看，我们的人轮回头胎亦是如此。都是从空到有，又归与空这样的一个过程。我们再往大了讲，山河大地亦是如此。山河大地已属微尘呢。他也是微尘，他也是有寿命的。包括我们讲，地球也是有寿命的。沧海桑田也是会发生变化的，四季也是轮转的。所有的东西都不是永恒普遍的，都会随着因缘的聚散。而聚散所以说一切皆空，都是没有自性的，都是不长久的。我们在讲会生活当中也是一样的，一个人的富有，他也不会一直富有啊。包括两个人的感情，它也不会一直感情如胶似漆呀。时好时坏，时而顺利，时而不顺。我们的身体也是一样的，要承受着生老病死啊，从出生那一刻就意味着你要死亡的。这是万事万物发展的必然规律，所以才要明白无常的道理。所以告诉我们，这一切都是空的，都不会久住，那我们要何须执着呢？所有的只不过是色相而已啊，如梦幻泡影，如露亦如电。所有的物质，所有的色相，都是如梦幻泡影如露亦如电的，所以你看梦、幻、炮、影、露、电是不是都是不长久的？所有的事情都是不长久的，都会发生变化的，都会从无到有，从有又归于无。所有的事情都是在发生变化的，所以佛家告诉我们，这一切都是空的。你又何须去执着呢？我们再举一个。大家都能听懂的例子再告诉我们什么叫空，比如说海浪，有风的时候，他就形成了浪了。风走了以后，开始变得风平浪静，浪就不在了。那你说那到底是在还是不在呢？当有风的时候，在涨潮的时候，浪就在。退潮了，风停了，浪就不在，所以说它是空的。他是不长久的，就好比我们的身体也是一样的。你说他不在吗？他在呀。他真真实实的在啊。可是呢，你要知道，他也是因缘和合，从什么都没有开始到现在，实实在在的有这个身体。但是随着岁月的流失，我们将要老去，四大开始消散。尘归尘，土归土，他就不在了。包括一个杯子，一本书，都是同样的道理。那我们的身体都是假和而成的，何况伴着我们身体而来的那些东西，它也终究会消散的。包括我们那些想法，那些感受，那些烦恼，那些痛苦，它即将不复存在啊。所以一切都是空的，我们了解了空性的智慧，是减少我们的执着和痛苦。不要在梦幻泡影当中苦苦外寻，苦苦追求，苦苦的执着而不得解脱呀。所以照见五蕴皆空的时候，就度一切苦厄了。注意啊！我们这里只是明白了空性。即使我们的身体消散了，我们这一世结束了。我们下一世开始轮回的时候，主要我们的“识”还在啊。五蕴色受想行识，我们身体没有了识，还在随着我们的业力轮转又来到了下一世。所以照见五蕴皆空，是所有的念头都没有了，识也没有了。就是我们被迷住的那个自性，叫阿赖耶识，就是我们成为面团的那个东西。它还在，只要它还在，还会随着业力不停的轮转，什么时候它也空掉了，就回归自性，圆满成佛了，所以这个时候才是照见五蕴皆空。刚才我们讲的这一段是让大家明白空性。我们还没有正到空性的时候，你也要看空。你对于当下的生活和整个生命的状态，才能减少执着，痛苦和烦恼。所以了解了空性智慧，把我们的眼界放长。你站在前世今生的视角在看当下。是不是生命就变短了？人生就变短了，是因为你的眼界放长了。在佛家叫“解脱见”，在道家叫“高见”。当你站在高处再往下看的时候，你的事情就变小了，烦恼就变少了。我们的身体都是从空中而来，最后回到空中而去。无所从来，亦无所去呀。所以你看看烦恼、痛苦、迷茫不是一样的吗？我们生活当中的烦恼是因为因缘生因缘灭。今天我的痛苦是因为他说了一句让我不高兴的话，是不是因缘生？随着这件事情过去，我的痛苦就消失不见了。只不过有的痛苦长，有的痛苦短。最长的痛苦，在我们的认知内莫过于跟随我们的一生。但是他终究会幻灭，消散到空中去。所以我们越是懂得空性的智慧，你会发现人生哪有什么可执着的呢？所以我们老百姓总讲一句话，人生在世，除了生死，都是小事。那如果我们要听得懂心经，生死也是小事啊，本来就无生无死啊。我们所谓的生死只不过换了一种形态而已。那这个时候，我们在看我们这一生还有什么放不下的，还有什么可执着的呢。万般带不走，唯有业随身呢。今生我们所追求的外在的所有的东西。都将幻灭，我们都是带不走的，你带不到下一世，你带不到你的阿赖耶识。只有你的善业和恶业存在那里，决定了你下一世去哪里。那我们如果再往高一个境界，善业，恶业都没有。这个时候才能回归自性，圆满成佛，不着任何相。</p></div>"
  },
  {
    "title": "第七讲-空不异色",
    "html": "<div class=\"B1_text\"><h2>我们了解了什么是色，我们又了解了为何叫空。</h2><p>这个时候告诉我们，色不异空了。色和空是一样的，没有区别呀！所以叫：色不异空，只不过我们是执着于色中，执着于吃喝玩乐。执着于财色名食睡，当我们了解了，它都是空的。都是不长久的，这个时候我们才能享受在当下呀。说我吃还是吃，可是这个时候我已经不执着于吃了。我喝还是喝，可是这个时候我已经不执着于喝了，这个时候就不迷在其中。所以色不异空，色和空是一样的，是一体两态。一体两面，这就好比是道家讲的有无相生啊。”色不异空“，色和空是一样的，前后皆空。色只是中间的过程啊，所以说色不异空。那接下来我们再上升一个境界，叫空不异色。我们现在已然是有色了，我们色身已经来到这里了。那空不异色什么意思呢？我们色身已然存在，我们就从容应对，但不执着于色身。这个杯子因我们念头而生，它已然存在，我们就从容的去用这个杯子。而不执着于这个杯子。比如说我们很多学佛的朋友啊。一定要注意，这里有一个误区，很多人执着于顽空，那个是假的。比如说我执着于放下。我听说了空，我执着于空，举例啊，说感冒了。我身体是空的四大假和。不用吃药，我念佛就行了，不行的，因为你的身体已然存在了，我们不执着于这个身体，但是。不代表感冒了，我们不吃药啊，所以不要落入这个假的和顽空。怎么区分呢？假的和顽空无法用，不能用，而空是可以用的。它是有妙用的，所以空中妙有，你先空的时候，你才能有妙用。举例子还是感冒，说什么叫空中妙有呢？我知道身体是四大假和而成。我知道人要经历生老病死，那我当下，生病了，感冒了，我知道前后皆空啊，我为什么会感冒呢？往前推啊。昨天受风了，没盖好被子，穿的少了，或者中暑了，在感冒之前它是空的呀。那当下已然感冒了，那我就吃药啊。但是我并不痛苦，我也不怨恨，哎呀！感冒这么难受。哎呀感冒了可怎么办。那我就吃药就好了，他终究会过去，归于空啊。就关于感冒之前的状态前后是皆空的。再比如说什么叫顽空。有的人经历了生活的磨难就开始抱怨。这都是我的业力呀，都是我上辈子没做好事，造了什么孽呀，今生才承受这样的负担，今生才这么多的苦难，我就忍受吧。我就忍受就是消业，我来世要有好的去处。这都叫顽空啊。那什么叫空呢？空是有妙用的。我了解了因果啊。我当下经受的苦难，原来佛告诉我们，是由于我们过去的业力所导致的。那我知道了这个事情，我要懂得安住当下，努力的修行自己。去种善因自然就会得善果呀。告诉我们一切都是空的，那我当下的苦难也是空的。所谓的当下的苦难，只不过是当下所显的一个相。在这之前是空的，在那之后也将归于空。所以我没有什么抱怨的，我不恨世界，我也不抱怨自己，我也不颓废，我努力的去种因。安住在当下，这个有妙用，这个时候才是空。所以一定不要执着于求空，越求空越不空。落入那个顽空人就很容易消极和抱怨。为什么有的人会误解佛法，说佛法是消极的，告诉你一切都是空的，不用努力了？那是顽空啊，不是真空。当你懂得真空，是懂得安于当下，积极努力的去种因，这个时候才是真空。空中才能妙有，这个时候，你是有妙用的。</p><h2>“色不异空，空不异色”。</h2><p>我们不执着于色，不执着于空，不落于色，也不落于空。就是这样一种感受和状态。执着一色，它是假和而成，执着一空，就会落入頑空。所以告诉我们，色和空都是一样的，空和色是没有区别的。这个时候，我们就上升了一个境界，叫做空中妙有。相当于是把我们的思维带出去看一下再回来。“如来说世界，非世界，是名世界”。异曲同工之妙，但是不完全是空不异色的意思。放在这里引用是为了大家更好的理解。“如来说世界，非世界”，如来告诉我们，这个世界不是你想象的世界，不是你肉眼所见到的这个世界。但是接下来重点又来了，“如来说世界，非世界，是名世界”。又告诉你，回归当下，你生活在这个世界上。你就要按照这个世界的规律和法则回到当下，但是这个时候。你的眼界不同了，你已经不迷在其中了，你知道了这个世界原来。不是我想象的，我过去的肉身的这个认知的世界。当明白这个道理的时候，还要再回到当下的”是名世界“。举个例子啊，就好比是我们生活在这个村子里。我们出去看过世界。我们增长了很多见闻，这个时候我们再回到这个村子。你会发现，境界是不是不一样的？虽然同样还在这个村子里面，可是你已经增加了很多的见闻。增长了很多的智慧，看到了世界的不同样子，这个时候你再回来。安住当下的时候，你的境界，眼界不同了，你就不迷在其中了。所以告诉我们，“色不异空，空不异色”，是我们懂得了这些道理，不落于色。落于色就执着执迷于其中。但是也不能落于空，落于空，相当于是我们回到这个村子里生活，我们满脑子想的还是外面的世界，这个时候落入顽空。就会痛苦不堪，所以再回来是名世界。从色告诉我们，一切都是空的，所有的色都是从空中来，最后要回到空中去。这个时候我们要空中妙有。活在当下的这个世界，但是不执着，我们知道什么该做。什么不该做，我们往哪个方向去修行，这个时候又回来了。“色即是空，空即是色”。又来告诉我们了色即是空，色就是空，空即是色，这是一体两态。我们迷住的时候叫色，不迷住的时候就叫做空。再举个例子，方便大家理解。比如说水，水也可以是一体两态。这样的时候，他叫做水啊。冻住了以后呢，他叫做冰。但是你能说冰不是水吗？他也是水，但是你能说冰就是水吗？他也不是水。迷住了叫冰，未迷叫水，所以这里也是一样的。迷住的时候叫阿赖耶识，那个面团儿。不迷的时候叫自性，它是圆满的，是我们比喻的那个面粉。“色即是空，空即是色”，也同样的道理，迷住的时候，叫着于色相。不迷住的时候叫做空。但是呢，它本为一体两种不同的形态而已。所以告诉我们，色即是空，空即是色，是一样的。当我们没有迷住的时候，是那个自性，是那个面粉就是空的。被迷住的时候就展现出来各种形态，包子，水饺，面条，就是被迷住了。那我们被迷住了，就会呈现各种色相，天、人、阿修罗、人道，畜生道，饿鬼道，地狱道呈现出来不同的形态，就是色被迷住了。产生了四大假和的身体，所以破迷开物的过程，就是回归自性的过程，当你不被迷住的时候，就是空。但是空之后，我们还存活于红尘之中。我们还在娑婆世界，那么接下来就要上升一个境界，叫“空中妙有”了。这个时候我们来讲一心三藏，一心三藏：不空如来藏，不空如来藏修的是色法，举例啊！放生。做善事，积累功德，帮助他人。这都是修的不空如来藏，见色不见空。做了很多善事，让我们自己变得更好，这叫不空如来藏。修行的次地也是如此的。所以刚开始修佛法的朋友们都要去修色法呀。说我要积德，我要修善，我要放生，我要多去帮助他人。你在不停的积累善业的时候，随着你的智慧的增长。你就进入了第二个境界，叫空如来藏。这个时候你了解了所有的事情都是空性的，都是无自性的，都是不长久的，这个时候，我们就落在了一个空上。落在了空上，我们才在增长智慧。佛家有一个词叫福慧双修啊，我们在修色法的时候，不停的积累善业积累功德，修的是福。空性智慧，修的是慧呀，所以叫福慧双修。我们既要修不空如来藏，去修色法，行善事积功德，这是增幅，又要修慧。懂得空性的智慧。只有智慧才能让我们没有烦恼，减少痛苦啊。你说我做了很多善事，我去放生，可是我依然痛苦啊。那个是福不是会啊。所以我们只有不停的去增长智慧，了解一切都是空性的，不可执着。一切都是从空到色，色只是短暂的。短暂的因缘和合又会归于空。所以这个时候，我们不再对世间的一切产生执着，你才能减少痛苦，这叫慧呀。所以福慧双修，这就到了第二层境界，叫“空如来藏”。还有很多朋友啊说佛家就是讲空性智慧的。其实呢，还不究竟。到了空性智慧的时候，还有第三层境界，因为你到了空没法用啊。你空怎么能用呢？所以就到了第三层境界，叫“空不空如来藏”，也就是我们常说的空中妙有。因为空你是没有办法用的，这个时候你进入了空不空的境界，这个时候你要入世的。空是没有办法做事情的，但是空中妙有的境界你才可以去做事情。那我们去看一看，佛菩萨不是在普渡众生吗？是不是也在做事情啊？那如果都空掉了，就不要做事情了，做事情干嘛呢？这个时候，是到了空不空的境界，是空中妙有的境界，所以才有倒驾慈航，千百万亿化身来度脱众生啊。自己是不迷在其中的，是空的。这个时候空的状态才能产生妙有，返回来又开始度脱众生。所以别人看到的我们在做事情，说你也没有空啊，空了不就不做事情了吗？是只看到了第二层，没有进入第三层的境界，是空中妙有。比如说我们去看历代的高僧大德，难道不在做事情吗？儒家的圣贤难道不再做事情吗？道家的人难道不在匡政天下之事吗？都在做事情啊，但是他已经到了空不空如来藏的境界。举个例子，方便大家去理解吧。比如说我们都看过《西游记》，孙悟空有七十二班变化。举个例子啊说，孙悟空想要变成一头牛。说原本这里有两头牛在这里吃草。这个时候，孙悟空也变成了一头牛呀，悟空啊，他悟到了空性，才有了七十二班变化。佛菩萨为什么有千百万亿化身呢？因为是空的，才可以无限变化，才有无限的化身，所以这个时候，悟空变成了一头牛，和这三头牛一起在这里吃草。那我们体会一下这个时候孙悟空的境界，和另外两头牛的境界是不是一样的？肯定不一样吧，他们两个是用牛眼看世界。而孙悟空是用悟空的眼睛在看这个世界呀。所以，看到的世界也是不一样的，这两头牛在吃草的时候，可能念头纷飞啊。胡思乱想啊，一会儿还要耕地的，不好好努力要被卖掉的，我的牛生太痛苦了。但是这个时候的孙悟空是不是不一样了，他吃草的时候很享受啊。那既然我化成一头牛，我就好好的吃草啊，让我去工地。哎呀，这没体验过，很好非常好。所以这个时候，就是空中妙有了，他不迷在牛的世界当中。这就是“不空如来藏”和“空不空如来藏”的区别。所以觉悟的人，他也生活在这个红尘之中，也在和我们一样在做事情。只不过他不再痛苦，不再迷茫，不再执着。在举例啊，这个时候，孙悟空从牛这里离开了。他又开始去变化了，他变成了一个凡人，来到了这个世界。你会发现，和刚才的案例一样。悟空和我们看到的世界是不一样的，他不会执着于当下的得失。不会执着于当下别人对自己的看法。不会直追这些痛苦和烦恼当中。所以这个时候，看似是一样的，实则境界已然不同。所以我们都说过一句话呀。以心去看这个世界，以佛眼去看这个世界，你看到的世界是不同的样子。</p></div>"
  },
  {
    "title": "第八讲-受想行识亦复如是",
    "html": "<div class=\"B1_text\"><h2>受想行识亦复如是</h2><p>”色不异空，空不异色，色即是空，空即是色“。把五蕴又分开了讲。所以接下来就说，受想行识亦复如是，受想行识也是一样的。如果要展开来讲，就是“受不异空，空不异受，受即是空，空即是受。想不异空，空不异想，想即是空，空即是想。行不异空，空不异行。行即是空，空即是行。识不异空，空不异识，识即是空，空即是识”。所以展开来就是这样来讲的。都是一样的呀，都是本人一体两态两种作用。为什么这里开始？“色不异空，空不异色”展开讲受想行识不需要展开讲了呢。五蕴的想行识都是因为见色而起啊。之前我们讲五蕴皆空的时候讲过了，因为取了色相才有了受想行识，当空和色不起向，不执着的时候，自然也就没有了受想行识，一切归于空。我们在这里举几个例子。往我们生活当中讲，让大家去区分何为迷？何为不迷？我们讲迷住的时候，叫做阿赖耶识，不迷的时候叫做自性。迷的时候是面团，不迷的时候是面粉。迷的时候是色，不迷的时候是空。所以我们往生活当中讲，如何才能不迷在事情当中，不被事情所困惑？当我们迷在其中的时候，执着于其中的时候，就会产生痛苦。这样举例了，比如说我们陪孩子玩捉迷藏，当你陪孩子玩捉迷藏的时候，你是不是就不迷在其中的？你会因为找不到孩子而着急吗？不会吧，甚至他就藏在那里，你还假装看不见。“哎，这孩子真会藏，哎，藏哪去了？怎么找不到你呢？你要藏好了，我找了半天都没有找到你啊“。你看你是不是就不迷的状态？然后你找了一会儿，突然呀，我找到你了。你显得很高兴的样子。你是因为找到他才高兴的吗？不是吧。是你陪着他玩，你看着他高兴，你高兴的。这个时候你就是不迷的状态啊。再举个例子，现在是网络时代，我们大家都听过一个词叫水军喷子。比如说举例子啊，有一群水军受雇于人说你去黑某一个人，我们告诉你几个关键点，几件事情，你们围绕着这个事情随意发挥，随意喷就好了。那你看这个时候的水军，它有情绪吗？没有吧，雇我的让我骂我就骂他，是不带任何的感情色彩的，他是没有恨的，他只是受雇于人来做这件事情。所以针对于这件事情来讲，这些水军是不迷在其中的。当然这件事情是违背道德的，只是让大家明白这个道理，何为迷，何为不迷。再举个例子，当你真正恨你一个人的时候，你在骂他，你迷没迷在其中。迷了吧，你是有情绪的，你是愤怒的，你是真的恨他，你恨的咬牙切齿。你在骂他的时候，痛苦的却是你自己，而水军在骂他却不痛苦，这就是迷和不迷的区别。所以我们如果迷在一段感情当中的时候就很痛苦啊。我们不迷在一段感情当中的时候，同样也在有着这段感情，可是我们不执着。我们懂得在没有这段感情之前他是空的，终究他也会归于空啊。那所有的事情不是一样的吗？我当下正在经历了人生的苦难，我的生意失利了，我赔钱了。本来这些钱在这之前就是空的呀，它是属于你的吗？你出生的时候，自己扛着麻袋背着钱来的吗？没有吧，你什么都没穿呢，连衣服都是父母给的。那我们活到今天，我们所有的东西都是众生给的呀！车子，众生的钱给买的。或者父母的钱，或者朋友的钱，那不都是众生的钱吗？你住的房子，你用的杯子，我们现在的摄像机，你现在的手机。你看看是不是都是众生给的？在你走的时候你能带着手机走吗？说我怕下一世没有手机用，我拿一个去。不行拿俩能走得了吗？带不走吧。所以终归还要归于空的，那只不过当下所呈现的一个相，说我现在贫困，我失忆了，那失忆了以后我们就活在当下。努力的奋斗，努力的种因就好了。这就是迷和不迷的区别，在举个例子说，我是做企业的。今天公司当中发生了一些事情。我这一看，这些人不努力工作呀，我再不发点脾气站不住了。那这个时候开会那发了脾气。那你会发现在这种状态下发脾气，自己真的生气吗？没有吧，它是一种手段和方法呀，这个时候你就不是迷在其中的。所以，发完脾气该干嘛干嘛，但是迷在其中的是什么样子，真的生气了？发完脾气了，员工没怎么着，自己气的直哆嗦，一会气大了，打120了。这就是迷在其中啊，那你看看你的生活是不是如此。孩子写作业不听话你又迷了，孩子没怎么着把自己气够呛。在生活当中发生一个小事情，自己又迷住了。感情上发生一个小事情，自己又迷住了，事业上发生一个小事情，自己又迷住了？走到大街上，小狗冲我叫了两声，迷住了这给我气的，不是他有毛我都去咬他去。所以你看这种状态，就是迷在其中的痛苦不堪呢。所以讲了点生活当中的案例，让我们了解何为迷何为不迷，你们才能减少生活当中的痛苦和迷茫？不要那么执着，前后皆空啊。“空不异色，色不异空，空即是色，色即是空”。终归要归于空的，“人生不满百，常怀千岁忧”。我们人生不满百岁呀，可是让我们愁的事情好像像一千年那么多。所以淡然的，从容的去面对我们的人生，不要事事都迷住啊。这个时候，我们才能变得轻松自在，从容一点。当我们知道了一件事情的来龙去脉，是不就不容易迷住啊？所以我们学心经，就是了解来龙去脉啊。了解了空性，又了解了一切色相都是假和而成，又懂得了空中妙有。在一件事情上，我们知道来龙去脉的时候，我们就不迷茫，不痛苦，不困惑。那对于修行也是如此，我们了解了事情的来龙去脉。我们就减少执着。所以佛说，众生的痛苦，皆因无明，都是因为不明白啊。我们在用一个字来总结。迷和不迷的区别是什么呢？在一个“觉”字啊。时刻保持独觉的状态，才能淡然处事。觉是其中的妙用，当我们懂得时时刻刻有觉在。就不容易被迷，当一件事情发生了，我们及时的觉知到了，我们被迷的就少一点，举个例子，我们现在正在发脾气了，可是发着脾气。我突然意识到了我不该发脾气，这个时候觉知了。然后及时的收住了，就被迷的少一点。照见，照我们再聊聊这个“照”字。觉是过程，在这个事情的发生，念头的发生的过程叫做觉。说我正要发脾气或者已经发脾气了，但是我意识到了这个过程叫觉，结果叫照，当我们保持觉的妙用在其中的时候，就不容易迷。我们再来回顾这一段，“色不异空，空不异色，色即是空，空即是色”。让我们去学习这些，就是减少我们的迷惑。虽然我们不能一下修回自性，但是我们了解了整个八识的作用，就是减少在生活当中的迷和执着。再给大家举个例子，让我们去体会八识之间的关系，比如说我们在一个。办公的场景，一共有八排座位。你坐在第几排更容易看见全貌啊？是不是坐在第八排啊？当你坐在第八排，坐在最后一排的时候，你往前看。末那识你的意识身舌鼻耳眼，这个时候你坐在第八排，再往前看，是不是看得更清晰？看得更清楚啊。这个时候你才能保持觉。少取色相，少执着，这个时候你自然就减少了痛苦。少迷在其中，所以我们要学会这样的方法。去站在第八时往前看，这个时候我们就能觉察到。自己的眼耳鼻舌身意的变化。我们情绪起了，我们就知道。当我们因为一件事情开始产生迷惑了，我们及时的保持觉知就减少痛苦。我们听到一个不好的声音要开始产生痛苦了，我们就保持觉知。我们看到一个我们不喜欢的人要产生情绪了，我们就保持觉知。当我们吃到一个我们不喜欢的味道，刚要发脾气的时候，我们保持觉知。在生活当中反复的练习，反复的应用，这个时候就会减少我们的迷。减少我们的痛苦。所以举这样一个例子，是为了让大家在生活当中。更好的去应用和修行实践。如果从《心经》的角度，是要五蕴皆空的。但是我们绝大多数人都做不到，所以讲了这样一个方法。我们自己去，减少我们的谜，减少我们的执着，时刻保持决在其中。</p><p></p><p>朋友们，课程录制，现场问答环节到了。这是谁跟谁的对话呀？观世音菩萨和智慧第一的舍利弗他们两个之间的对话，所以他这么简短就行了啊。况且那个时候的人都能听得懂，那我们现在在举例子这个杯子。或者我们举例子，面粉，水饺，包子，对吧？再过1千年以后呢？比如说过了1千年以后，人们研究这段话。包子是个什么东西？因为那个时候他们可能没有包子了。我们就研究查呀，在2020年那个时候，包子是有馅有皮合成的。是不是他们就得反复的去找那个时候的杯子是什么意思什么叫杯子？那个时候可能人家叫盆了，所以他就会研究这杯子是什么？其实在这个时候是很好懂的，同样，在那个时代，他们之间的对话很好懂的。只不过隔得久远，我们现在觉得他难懂。你想一想，当时他在讲法的现场，能不能讲的话，大家都听不懂。不会吧，所以他讲法一定是与会大众，起码绝大多数人都能听得懂。所以他讲的是那个法，是因为我们离那个东西太远了。离那个智慧太远了，为什么越往后是越难修行？欲望越来越重，欲望越来越多，诱惑越来越大，所以听不懂了不是人家的东西难。你像那个时候，比如说咱们学《论语》，那你说子路来问：“如何事君”。孔子告诉他了：“勿欺满，不要欺满他，而犯之”。“勿欺之，而犯之”你不要欺满它，但是你可以直言相劝。是不是很简单一句话，他能不能说子路问完之后，孔子说了半天，子路没听懂没了，不会吧。那不是对话，那也不更不是智者的对话。所以那个时候论语之间的对话就是。孔子和弟子之间的日常聊天，就像我们现在聊天是一样的，他一定是大家都能听得懂的。</p></div>"
  },
  {
    "title": "第九讲-是诸法空相",
    "html": "<div class=\"B1_text\"><h2>舍利子、诸法空相，不生不灭、不垢不净、不增不减。</h2><p>接下来我们要讲到诸法空相了，诸法空相到了心经的中心思想，从开篇开始讲，有一位观自在的菩萨行深般若波罗蜜多时，到了一定的深度和境界，照见了五蕴皆空，度一切苦厄。在给我们讲什么？讲方法，在讲到彼岸的智慧和方法，当照见五蕴皆空的时候，就度尽了一切苦厄。又告诉我们一个方法和一种智慧，色不异空，空不异色没有区别，又告诉我们色即是空，空即是色，是一体两态，迷住的时候叫色，不迷的时候叫空。接下来又告诉我们了，之前给我们讲了五蕴的智慧，讲了色受想行识亦复如是，它都是空的，但是空中又有色，色中又有空，一体两态，那些都属于法方法，出世间的方法，智慧都是法的范畴，这个时候又开始给我们破法相了。所以接下来又说舍利子诸法空相。我们在讲什么叫诸啊？所有的很多无量无边的叫诸，很多的意思，我们来讲法，什么叫法？法我们之前讲过分为世间法和出世间的法，比如说世间的法，我们学会了做饭，这是世间的法，我们学会了如何吃饭，这是时间的法。我们学会了很多工作的技能，生活的技能，比如说开车，我会电脑，我会拍摄，我会软件制作，这都是让我们生活更好的方法，都称为世间的法。我们在讲出世间的法，我们要增长到彼岸的智慧，我们知道了照见五蕴皆空，就能度一切苦，照见五蕴皆空的五蕴也是法。我们讲六根，六尘六识都是法。我们在讲我们学习佛法，佛法也是法，我们去学习孔子的思想，儒家文化也是法，我们去学习道家文化、道家的法，所以告诉我们诸法空相，所有的法都是空的，都是方便法，都是为了让我们到达彼岸的，出世间法都是空的。我们讲回世间法也是一样的，我们学习了这么多生存的技能和生存的方法，都只是为了让我们在这个地方生活得更好而已，它都是因缘生因缘灭，都是因为事情而生的法。举个例子，我们现在很多人学会了包包子，这是法。怎么出来的包子呢？在远古时代不需要会包包子，因为也没有包子，甚至没有面粉，后期是因为有了小麦，有了面粉，人们一代代的发展和变化，我们会包了包子，你看是不是因缘而生的？是因为事情而生的法。我们学儒释道的文化同样如此，我们在哪一个阶段需要去做什么样的事情，需要提升自己的某一方面，这个时候去找到了相应的法，所以都是因缘而生。当我们学会了这个法以后，要懂得把法放下的。举个例子，我们在吃饭的时候用的是会吃饭，这个方法我们在工作的时候需要用的是工作的技能，我们需要开车的时候需要的是开车的技能，可是我们开完车要懂得把方法放下，我们吃完饭要懂得把筷子这个方法放下，我们工作了以后要懂得把工作的方法放下，而用的时候它自然就出来了。所以这个时候告诉我们诸法空相，是告诉我们所有的法一是空的，不要执着于任何的方法，当我们执着任何的方法的时候，就会产生法执，依然会痛苦。我们再举个例子，比如说我们吃饭这件事情是为了吃饱，我们干嘛要执着方法？举个例子，我们只有吃馒头才能吃饱吗？吃米饭是不是也可以吃饱，吃面条是不是也可以吃饱，吃包子是不是也可以吃饱，吃面包也可以吃饱。我们这件事情的彼岸就是吃饱，用什么方法吃什么东西，又有什么区别呢？当我们懂得这个道理的时候，你才不生执着才不痛苦，否则就会不停的执着妄想和颠倒。我只能吃米饭，我只爱吃水饺，我只能吃馒头。你会发现这个时候你就是不懂得空的，你就开始痛苦。我们再讲回修行是不是也一样的？很多人说了，佛法才究竟别的法都是外道，金刚经告诉我们修一切善法即是佛法，你只执着于佛法才能让你觉悟吗？佛法也是空的，有的人说了，我只学习儒家文化，其他的形式上上的我不学，那个都是不对的，都是迷信色彩，那是你认为的，难道只有学习儒家文化才能让我们觉悟吗？朋友们课程录制现场问答环节到了。我说那是不是我们做事情的时候，应该止于结果？对，不要执着一个过程。而不光是不执着，而且你还会想出多种方法，举个例子什么呢？这件事情的结果就是我把它完美的呈现出来，过程你会发现你这个方法行不通，你就会换一个，但是你要指着一个方法就完了，我就得这样，我老师就这么教的，就得这么干呢，你就不不懂创新就干不好。因为你只作为在法上而修佛法也告诉你，你还在执着说我不行，我必须得修五蕴，你又错了。他只是给你举例子，观世音菩萨总不能说所有的法门给你讲一遍吗？可能他讲到无始劫都讲不完，一般培训都会玩那游戏，就是说从这边到这边，你想办法过去，但是不能重样，有的人说走过去，有的人一直腿跳，有的人翻，反正各种方法对吧？你会发现无论会场有多少人一定不重要，有的人走过去，有的人爬过去，反正最后你会发现每个人都能过得去，说明所有的事情的方法都是一样的，无量无边，修佛法更是如此。所以心经开始，观世音菩萨只是举了人们能听得懂的常见的例子，告诉你五蕴皆空，就度一切苦厄了，告诉你色不异空，空不异色，色即是空，空即是色，又告诉你受想行识亦复如是。好比我们是讲一件事情不是一样的吗？说你去把这个软件做好，我告诉你给你举几个例子，你都要注意哪些方面，比如说你要注意声音，不要有杂音，要降噪，配字幕，不要有错别字，看上去要舒适，画面整个要有清晰度。举完例子了，难道除了这些你就不注意其他的事情了吗？不能吧？所以你有没有可能把所有要注意的事情都讲完，讲不完的。一样的。所以你会发现法是无量无边的。刚才说的非常对，你要懂得你做这件事情的结果，那个止是什么？当你很明确止的时候，你就不会执着于方法。记不记得前两天咱们说一个什么事情，说有一段视频要用，然后他就说这也不行，那也不行，我说我告诉你一个明确的指这段视频是必须要用的，怎么用你去想方法，你看这个时候指明那种或者那时候我知道了，我想办法，因为只是明确的就像我们现在去找到场，我们找到厂这件事情是势在必行，这个时候你会发现这个不行，换一个这个方法不行，换一个不停的去找，总有一天会找到。可是如果我们的止不明确，这不行，你还不想花钱。还得找那么大的上哪拿多少钱对吧？你看就这样子。所以你会发现当我们那件事情的止很明确的时候，你就会想无尽的方法去解决它，切莫执着于法，你把法空掉的时候，你会发现你就会生无量法，能不能明白这句话？你只有把法空掉，你才能生无量法，你执着于某一法，你就不会生出来更多的法。你比如说举个例子做饭是不是一样？比如说很多人做饭我就会煮方便，我就会炒西红柿炒鸡蛋，你就会你只会你不会去做更多的东西，因为你破不掉，你只会西红柿炒蛋这个法，你要把这个法忘掉，你会发现你可以会做那么多东西，最近他做了很多新的花样，他以前会吗？不会吧？但是他只很明确我就想做，那就厉害了。你看做任何事情不是一样的，当你的止很明确，我就要把这件事情做好，你把你当下的法破掉，你才可以生无量法，如果你当下的法不能破掉，你生不出来更多的法，所以为什么很多人一辈子就会做那件事情，出不来他的思维框架，破不了自己的法执，只按照自己的方法去做事情。你看现在很多人跟不上时代的发展了，开始抱怨，要回去过去那个时代多好，你说我们那个时候人们多努力，你会发现他执着于他过去的法，法是怎么来的？意对着法，眼耳鼻舌身意，对色声香味触法。法是什么？是你的意识所得出来的认知的结果叫法，你的意识得出来的那个东西叫做法，所以他停留在过去的认知当中，出不来了，所以产生痛苦开始抱怨了，时代是回不去的，时代是在发展的，社会是在进步的，天道是唯新的，它是往前走的。所以这个时候如果你的法不能破掉，你还在执着于过去的法，你就跟不上，你就开始产生痛苦。所以要懂得把自己的法破掉，你才可以生无量的法。好比是我们自己不是一样的吗？让讲什么法我们就讲什么法，跟随我们一起修行的朋友是什么样的根器，我们就尽量讲他们能听懂的法。这个时候你不局限于任何法，这个时候你才能生出无量法，能不能听懂？所以这个是很重要的。你们在做事情的过程当中切忌如此，当你法行不通的时候，你要换法的，说我这样做他不行，结果不好，你就要懂得换法，你要把你自己的法再破掉。我这样发不行，引不起别人的兴趣，你要懂得把法破掉，你才能生出更多的法。你会发现这个时候人人的思维是进步的，你的认知是前行的，你才可以生出更多的法，所以其实生活当中的法执会让我们痛苦，工作当中的法执是让我们无法前进，修行当中的法执让我们难以解脱。所以任何一个法都可以到达彼岸的，不拘泥于任何一个法，所以告诉我们是诸法空相。所有的法最后皆归空。</p></div>"
  },
  {
    "title": "第十讲-是诸法空相",
    "html": "<div class=\"B1_text\"><h2>是诸法空相</h2><p>所以人就是因为不懂得诸法也是空的，所以才不停的执着、妄想和颠倒。让我们深深的迷在其中无法自拔。就是不了解，一切都是空的，包括《心经》讲给我们的五蕴也是方法，也是要归于空的。我们讲一切法都是“度海之舟法”，我们是为了到达彼岸去，中间用什么去，怎么会那么重要呢？可是往往我们把它沦为望月之手指，我们手指指月是为了看向月亮的，可是呢。我们产生法执的时候忘了看月亮而盯着手指不停地看。所以产生这种执着，生了法执很难觉悟的，你又执着在你的那个手指上了。你又执着在法上了，你执着于佛法上，你执着于儒家文化，你执着于道家的法，你执着于吃饭的过程，我只吃馒头。我只吃米饭。你又开始产生法执了。我们再举个世间的例子。比如说我们从北京出发，要去到上海。到达上海那个彼岸，是不是有很多方法呀？我们这个时代有飞机，有火车，有汽车，你也可以骑行，你可以走路去。这个时候有的人说了，那坐飞机啊，坐飞机多快呀？那是你觉得坐飞机快，那可能他没有那么多钱呢。他坐不了飞机啊，那还有可能他恐高啊，他坐飞机他就不舒服，所以他由于种种原因不能坐飞机啊。这个时候有的朋友又说了，你坐火车呀，火车又经济又实惠，可是有的人又说了，我没有那么多的时间去坐火车呀。我坐不了火车呀。那有的人说了，你要坐动车呀。可能价格也适中，还快动车对我来讲也贵呀，我坐不起呀，那我可能。只能坐火车前往。那有的人说了，那我心疼啊，我不着急走的那么快，我要步行去上海啊。所以你看在讲什么呢？是不是所有的法都可以到达彼岸？并且因人而异，每个人当下的状态不同，你的条件不同，慧根不同，所以你选择的方法自然就不同了。但是呢所有的方法都是空的，都是了无自性的，不要执着于任何一种方法。我们再举例，那修成成就的法门也是多种多样的，无量无边的。比如说。楞严经里所讲的二十五圆通法门，每位菩萨觉者。所修的法门都不相同。比如说我们熟知的观世音菩萨，修的是耳根圆通法门。二十五圆通法门。眼耳鼻舌身意六根。色声香味触法六尘。眼识耳识鼻识舌识身识意识，这六识称为十八界。再加上七大。地水火风空见识，一共二十五圆通法门，通过这二十五圆通都可以。修到觉者，修到菩萨都可以有所成就。我们熟知的观世音菩萨耳根圆通得以成就。虚空藏菩萨空大圆通得以成就，观到虚空无量无边大，证到了空性智慧得以成就。《心经》里所讲的舍利弗眼识圆通得以成就。金刚经里所讲的须菩提，意根圆通得以成就，我们熟知的弥勒菩萨，识大圆通得以成就一切法为心识所现。通过识大得以成就啊。普贤菩萨通过耳识圆通得以成就，楞严经也在给我们表法。讲了二十五圆通法门。通过不同的方法都可以得以成就啊，菩萨的果位是一样的，菩萨的圣号却不同。代表着他所修行的方法和某一法门，但是都可以达到菩萨的那个果位。所以告诉我们，出世法到达彼岸的智慧也是无量无边的。那楞严经里也只是列举了二十五个法门。还有无量无边的法门，数不胜数啊。就好比是我们吃饭，我们只学习了几种方法，但是其实吃饭的方法。也是无量无边的。那我们工作只是学习了我们自己需要的那个工作技能就可以了，工作的方法也是无量无边的。但是最后所有的法都要归于空，所以诸法空相所有的法，无量无边的法，最后都是空的。都是因缘生，因缘灭。所以不要执着于法。当我们执着于法的时候，就会产生了我执和法执只认为我认为的我听说的。我知道的那个方法才是正确的，其他人都是错的，这个时候很容易又开始着想，开始产生痛苦。比如说修六度，佛家讲六度具足万行布施、持戒、精进、忍辱，禅定，般若，从六度的任何一门也可以得以成就。啊，有的人说我就布施，我不停的舍，可以呀。有的人说我就修持戒，我不停的持戒。可以呀。有的人说我就不停的修忍辱。可以呀。你不停的修精进，从精进一门也可以得以成就啊。所以佛法有一句话叫“闻贵多行贵简”一门深入，同样可以成就。这就好比是我们生活在这个红尘之中，娑婆世界，我们想要过上更富足的生活，我们多赚点钱。难道只有一种方法才能赚钱吗？是不是每个人赚钱的方法都不一样啊？因为每个人所处的境界不同，身份不同，地位不同，你所擅长的不同，所以只要能满足自己的生活所需。用什么方法有那么重要吗？所以你要做的是达到你的目的，赚到钱那件事情，而不是必须执着于用什么方法去赚到钱。所以我们修到彼岸的智慧亦是如此，所以不要去执着任何一种法执着就会产生痛苦。有很多学佛的朋友特别容易走入这个误区。我开始学了一点佛法以后啊，别人讲的都不对。只有我学的才是对的，只有佛法才是好的。我学禅宗的只有禅宗的法才对，其他的都不对。我学净土法门呢，只有净土才是对的，其他的都不对，都开始落入了法执。我们再来讲“相”，什么叫“相”呢？我们常说的色相，法相，人相我相众生相，寿者相都是相。我们那个见解认知所得出来的那个结果叫相。金刚经讲我相人相众生相、寿者相，这个相又叫见我见人，人见，众生见，寿者见。这个见解所得出来的叫做相，也就是我们认知的那个结果所得出来的那个结论，称之为相。举个例子，我看到一朵花。感叹这朵花真美，这个叫相。比如说我去到一个地方，这个地方真破这个叫相。我看到一个人，这个人长得真好看，叫做相。我又看到一个人，这个人真讨厌，这叫相，为什么呢？那是你的见解所得出来的结论。你觉得这个人好看的时候，可能有的人觉得他不好看。你觉得这个人真讨厌，可能有的人正好就喜欢这个人。你觉得很破的地方，那是你的对比所得出来的破。如果在更破的地方待过的人到这个地方他会觉得很好了。所以我们所得出来的那个见解都称为相，说我们的身体也是色相啊，它也是因缘和合而生的。比如说我们坐在这里，有的人觉得我们很帅。有的人觉得我们长得很难看。有的人觉得我们很白。有的人觉得我们很黑，哪来的呢？对比来的呀，他比你还。白黑的人觉得你白，他比你白的人觉得你黑。那你就坐在这里讲话，有的人觉得你讲话太慢了，有的人觉得挺快哦。因为大家的认知不同，所得出来的结论不同，所以这些都是相。为什么呢？空相啊。最后他都是空的，都是从你的认知里来的。注意认知里的是什么呀，法呀。你认为它好看？那是你的法，你认为它不好吃，那也是你的法，诸法都是空的，你所得出来的相也是空的。所以我们讲色相是空，法相是空。我们再讲一讲金刚经理反复所提到的。我相人相众生相，寿者相，先讲我相什么叫我相啊，执着于我的认知而产生的傲慢。比如说只有我认为的才是对的。我的发型才是最帅的，我选择的衣服才是最有眼光的。我才是最聪明的，我的口才才好。我是很有能力的时候，你会发现我执重的时候就会产生傲慢心，瞧不起其他人其他事情都不如我。还有觉得一切都是我的，你是我的，衣服是我的房子是我的，工作是我的朋友，是我的闺蜜是我的，我执越重越痛苦。当无常到来的时候就开始痛苦了，他不跟我好了，他不爱我了，老板不器重我了，我的财富变少了。我喜欢的衣服坏了，我的自尊心受到伤害了。你看都是我呀。所以我执重的人非常痛苦，这就是我们常讲的我执。</p></div>"
  },
  {
    "title": "第十一讲-不生不灭",
    "html": "<div class=\"B1_text\"><h2>不生不灭，不垢不净，不增不减</h2><p>“人相”分别心呢？比如说区别于我之外的，叫做人相。比如说他那么低级，我怎么会理他呢，他长得那么丑我不跟他玩。他那个智慧，我怎么会和他一般计较呢？这都是我相。既有我相，又有人相。看向自己的时候叫我相我比他聪明，这个时候是我相。他不如我，这个时候又变成了人相，我比他有智慧，你看既有我又有人。对内的时候是我向对外的时候是人相，所以这个时候就很容易产生区别对立。认为别人不如我有智慧，别人不如我长得好看，别人不如我懂得多。这个时候就有区别啦有分别，并且同时张三不如李四。a同事不如b同事。b朋友不如c朋友，这个时候，你会发现你到处充满着分别，故而痛苦。我们生活当中的很多痛苦就是源于分别心呢。不光对人的分别，对物的分别也是一样的。比如说我只喝红茶绿茶不好喝。我只吃馒头，米饭不好吃。我只吃水饺，包子不行，我只吃肉不吃素菜，我只吃黄瓜不吃西红柿。所以你会发现，分别就会产生痛苦啊。因为你喜欢红茶的时候，不一定时时都能喝得到红茶呀。当出现绿茶的时候，你就不高兴了，我只吃馒头，不能吃米饭。当没有馒头的时候，你就不高兴了。所以我们怎么能做到食欲而安呢？我们怎么能做到物来则应呢？破出我相和人相很难。但是呢，我们也要一点一点的去破除。当我们的分别少一点，我执少一点，我们的痛苦自然就减少一分。所以我们从生活当中不断的去修行，减少分别心。减少对人的分别，减少对食物的分别。减少对事情的分别，这个时候我们才能坦然淡定，从容的看着身边的一切。所以我们去看看我们身边的那些智者和谦和的人。是不是很随意呀，喝什么哈什么都行，今天中午吃点什么哈，吃什么都可以。我们到哪里去玩啊？都可以随你呀。大家去哪里高兴我们就去哪里。这个时候，你会发现，智者的行为通常都是这样的。因为他自己是没有过多的欲望和分别的，所以随顺大家就可以了。我们在生活当中减少一点执着，减少一点分别，减少点我相减少点人相，这个时候，我们的痛苦自然一个随之而减少。当破了我相和人相的时候，就进入了众生相的阶段。说我对人和我没有那么多的分别心，没有那么多的执着，这个时候还有众生相呢？举例子，我还会觉得佛菩萨高高在上，我还会觉得猪和狗是不如我聪明的，嗯注意啊，这都是众生相。这个时候很多朋友都说了你这样讲不合适啊。你上比佛菩萨，中间拿我们自己比喻，下面又说猪狗大不尽了，这就是众生相啊。佛说众生是平等的，那个自性都是圆融的，人人皆具佛性啊。我们原本都是那个佛都是自性圆满的，猪和狗亦如此。只不过我们当下被迷住了。畜生到的也是被迷住了，而佛菩萨觉悟了而已啊，所以这个就是众生相了。当我们都能真正的明白众生平等的时候，这个时候你才能破掉众生相，寿者相。一层一层的在扩大。我相是执着于我啊，人相是执着于我和其他人。众生相是执着于所有的众生，这个时候又开始扩大了寿者相。什么叫寿者呀？所有有生有灭的都成为寿者。山河大地也是有寿命的呀，沧海桑田也会发生变化。包括我们说的，地球也是有寿命的。所以告诉我们，破寿者相。所有的一切本来皆是空的。我是空的，人是空的，众生是空的，寿者是空的。这里讲的寿者，就包含了天地万物都是有寿命的，都是有生命的。所以，无我相无人相，无众生相无寿者相本体都是空的。是诸法空相，不生不灭。不垢不净，不增不减，这里开始给我们举了例子。举了六个相来加以说明生灭垢净增减这六个相。因为这六个相是我们在生活当中最容易着的相。生灭，我们总是认为任何事情有生有灭。包括我们人来到这个世间从出生开始。我们兴高采烈到一个人灭亡，一个人去世的时候，我们痛苦流泪。我们认为他是有生有灭的孤儿才痛苦啊。可是，佛法告诉我们，他是没有生灭的，不生不灭啊。我们人来到这个世间，只是有了肉身这样一种形态而已。当我们去世以后并不意味着我们所认知的死亡，他换了一种形态。又去其他的地方轮回了，他随着阿赖耶识的业力所流转又换成了一种形态去轮回而已，所以他是没有生灭的。比如说我们讲沧海桑田的变化已是如此，它随着因缘合合的产生。大海可能变成高山，高山可能变成河流。河流有可能变成高山，陆地也可能变成海洋，它只是沧海桑田的变化。实则他本性是空的，无生无灭。我们不空的是原本的那个自性。除了自性以外，所演化出来的所有的形态都是空的不生不灭。我们举一个大家比较容易理解的例子来解释。比如说：我们讲的孙悟空，孙悟空会七十二变。我们假设它的本体，我们只能用假设，这是方便说，是为了我们大家理解的。说假设他的本体是孙悟空这个人，或者说这个猴子他会七十二班变化，他变成了一头牛。那它的本体变没变本体是不是还是那只猴子，它又变成了一条狗。它又变成了众多的猴子猴孙。那它本体有生灭吗？没有啊？它是不生不灭的。不增不减呢？比如说它化身变成了100只猴子，它的本性有增减吗？没有吧，还是那只猴子，它千变万化变化出那么多猴子。变化出来了牛变化出来了房子变化出来了小狗而已。他的本性还是不生不灭，不增不减的。我们自己的那个自性亦如此。所有事物的空性的那个本体亦如此。他都是不生不灭的，所以孙悟空那个性没有变。那我们也是一样的，我们那个本性，那个自性，并没有变。只不过被迷住的时候。随着业力不停的轮回展现出来不同的形态而已，但是实则那个本性，不生不灭，不垢不净，不增不减。我们再来讲讲，不垢不净，我们之前举过水晶球的那个案例。上面布满了灰尘。无法显露我们本来的光明和自性。这个时候，我们不停的去修正，不停的去擦拭，让他露出来本来的光明。主要这个时候是不是已经有了垢净之分了？所以六祖坛经之中所讲神秀大师所做的四句偈。“身世菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃”。写完这个句子之后，五祖看到了这个句子就明白了，神秀大师并未彻底觉悟啊。为什么呢，时时勤拂拭勿使惹尘埃还落在了垢净之上，落在了垢净就还是落在了有之上。所以这个时候六祖慧能大师又说。“菩提本无树，明镜亦非台。本来无一物，何处惹尘埃”。本来无一物，何处惹尘埃，本来他就是空的，哪有尘埃呢？不垢不净。说的是究竟法门，所以五祖把衣钵传给了六祖慧能大师啊。所以神秀大师还落在垢净，就是落在了有之上。我们在中庸之中举例子讲过。我们无神秀不慧能，因为我们很多人不是顿悟的根气。所以时时勤拂拭，勿使惹尘埃。就是这里的含有垢和净，但是究竟法门是本来无一物，何处惹尘埃。没有垢净啊，这个时候是落在空上的。所以六祖坛经之中也会讲，当神秀大师说了时时勤拂拭，勿使惹尘埃，五祖说了一句话让众师弟按照神秀所说的去修行不堕恶趣。就是你时时勤拂拭勿使惹尘埃，你虽然落在有字上。你修的是色法，但是不堕恶趣。却把衣钵传给了六祖慧能大师。因为悟到了不生不灭，不垢不净啊。不增不减，没有任何的增和减，它本来就是空的，哪来的增和减呢？就像我们刚才举例所讲。孙悟空他千变万化，变化出很多，小的猴子，变化成牛。他自己的这个本性，他依然是不增不减的。本人就是空的，又何来生灭垢净增减呢？所以这里只是给我们举了六个相。告诉我们生灭垢净增减，如果我们不断的延伸，可以举很多例子，比如说。是诸法空相，不黑不白。不高不矮不胖不瘦，不丑不美不善不恶。朋友们，课程录制现场问答环节到了。我们为什么执着于“法”？举个例子啊，生活当中的诸法空象好理解。比如说我们现在要准备吃午饭了吧。这个时候做饭的人是不是开始要考虑做什么？吃饭的人是不是要考虑吃什么？我想吃什么，我喜欢吃什么？这个时候我们是不在寻求法，寻求做什么想吃什么，这都是法。再过一个小时我们吃完饭以后。吃饱了，这个时候你回头再想，你还会再去想我要吃什么吗？我喜欢吃什么，你会发现人吃饱了什么都不想，看什么都够。什么都不想吃，这个时候，当你达到这个境界的时候再回去看法是不是空的？吃什么是不是一点都不重要，所以什么人才执着于法？没吃饱的人，没到达彼岸的人才执着法。真正你看为什么觉悟的人都说本来无一物，何处惹尘埃？你不要执着于任何法，任何法都能让你解脱。这都是觉悟的人的讲的话。用刚才这个案例，你吃饱了是不是就懂得这样讲话了？比如，吃饱了，问你你想吃什么，什么都不想吃。什么都一样，吃饱就行。这是吃饱的人讲的话。没吃饱的人是不是就执着，可是你还没有吃饱之前？你还在执着你听听吃饱的人讲的话呀。所以我们听听那些觉者讲的话，本来无一物，何处惹尘埃呀。我们去听听观世音菩萨所告诉给我们的诸法空相。不生不灭，不垢不净，不增不减，何必执着呢？我们听听佛陀所讲的话。无我相，无人相，无众生相，无寿者相，若见诸相非相，则见如来呀。所以我们听听吃饱的人所讲的话。不要听你自己的那个我执和法执，因为你还没吃饱呢，你还没有到达彼岸呢。所以听觉者讲话。听智者讲话。听佛菩萨所讲的话。听圣贤告诉给我们那些道理，因为人家是到达彼岸又回来度化我们的人。所以不要指着你当下的想法，因为你在执着于当下的那个法，所以才有了我执和法执。</p></div>"
  },
  {
    "title": "第十二讲-是故空中无色",
    "html": "<div class=\"B1_text\"><h2>是故空中无色，无受想行识。</h2><p>空中无色告诉我们空中本来是没有色受想行识。那我们回头再来整个看心经和我们所讲的，听到这里可能很多朋友会很迷惑，刚开始告诉我们空不异色，色不异空。又告诉我们空即是色，色即是空。这里又开始告诉我们空中无色。这是讲的三个阶段和三个境界，讲给不同阶段、不同境界的人所听的。我们从最浅显的开始讲起，开篇告诉我们照见五蕴皆空，度一切苦厄，告诉我们五蕴原本都是空的。为什么要告诉我们照见五蕴皆空？这是讲给我们这些迷在色当中的人给你讲空，说五蕴是皆空的，是针对我们迷途的众生所讲。没有迷之前叫自性是如来藏，被迷之后叫阿赖耶识。然后我们开始有了第七识，开始随着我们这个报身，我们有了四大假合的身体，开始有了眼、耳、鼻、舌、身、意。因为这个时候已经是着于色相，故而告诉我们照见五蕴皆空，回归本性的时候，度一切苦厄，告诉我们色不异空、空不异色，色和空本然是一体的，没有区别。接下来第二个境界又开始告诉我们，色即是空，空即是色，空色本来就是一体两态，被迷住的时候叫做色，不迷的时候叫做空。但是本然一体又告诉我们空和色是一样的。再往后告诉我们诸法空相，五蕴也是方便法呀，告诉我们照见五蕴皆空，是让我们通过五蕴日常最常用到的色、受、想、行、识，把这个再给我们空掉，所以告诉我们诸法空相。我们了解了诸法空相之后，接下来告诉我们不生不灭、不垢不净、不增不减，因为他回归自性的状态，回归如来藏的状态。它本来就是空的，故而不生不灭、不垢不净、不增不减，是故空中无色、无受想行识。因为不迷的状态，它本来就是空的，那个空中自然就是无色的五蕴是因为心取了色相而起的感受、想法、心行、识，当我们不取色相的时候，无色自然也就无受想行识。所以一切本然空的状态。这里讲了三层境界。第一层境界就是色，在色相里面，比如说我们最初级的时候是迷于色相的，当我们整个人一出生，就已经是迷在色相之中。所以第一层的境界告诉我们色不异空，空不异色，色和空是没有区别的。当我们到了第二层境界，了解了色原本是空的，让我们了解了空性的智慧以后，又告诉我们第二层境界，色即是空，空即是色。他本然一体两态，当我们懂得色和空本然是一体不同的两种形态，迷的时候称为色，不迷的时候称为空。我们了解了这层空性智慧以后，又上了第三层境界，告诉我们诸法也是空相的。我告诉给你们的五蕴，告诉给你们的色即是空，告诉给你们的色不异空，都是方便法，这些法也是空的。当把这些法也空掉的时候，就来到了第三层境界，也就是我们最原始的状态，自性它本来就是圆满的，本然就是空的，什么都没有。所以我们再来延伸诸法空相，接下来不生不灭、不垢不净、不增不减，是故空中无色、无受想行识，我们再延伸一层好理解，是故空中无法呀。连法也没有啊，因为本然就是空的，何来法呢？是我们投胎到人世间，着了色相才生了万法。告诉我们五蕴皆空是方便法。可是我们在不迷之前，在自性的那个状态，本然它就是空的，又何来的法呢？所以空中连法也没有，所以佛说本没有佛法可讲，所讲出来的一切法都只是方便法，讲给迷途中的众生所听。可是你回到原本自性的状态，本然就是空的，什么都没有，无眼、耳、鼻、舌、身、意。无、色、声、香、味、触、法、无眼界乃至无意识界，整个这一段合起来称为十八界，每一法都是一界，所以一共有十八种法，称为十八界。什么叫法呢？比如说我们的眼也是法，我们的身也是发，我们的舌也是发，我们的鼻也是法，这称为六根，眼、耳、鼻、舌、身、意称为六根。六根对应的外面物理世界叫做六尘。色、声、香、味、触、法。我们讲的眼、耳、鼻、舌、身、意，用医学的角度来讲，这是生理的功能。比如说眼睛，比如说身体、鼻子、舌头、耳朵。意就是脑我们的大脑能思考的那个大脑，这是生理对应的外在的六尘，就是物理世界，这是十二种法。当我们的六根和外面的六尘产生作用的那个功能，识别的那个系统叫做识，眼识、耳识、鼻识、舌识、身识、意识，一共十八个法，所以又称为十八界。整个这一段告诉我们，无眼耳鼻舌身意，无色声香味触法，无眼界乃至无意识界，无眼无眼耳鼻舌身意的眼开始到无意识界。我们说的意识一共是十八法，中间是省略的部分，无眼界乃至无意识界十八个法没有必要一一讲解，所以从这里开始给我们结尾了，从眼界开始一直到意识界都是没有的。所以我们回头再来看这句话，本然是在自性圆满的那个状态，本然是在如来藏的那个状态，又哪有色、声、香、味、触、法呢？连五蕴都没有，我接下来的十八界自然也就没有啊。比如说我们的眼睛是不是随着我们的报身而来？我们大脑能思维的那个意识是不是也随着我们的报身而来？如果连身体都没有，这些是不是自然也就没有的？比如说外界的六尘也是一样的，我们如果没有来到这个世界上，怎么能感受到这个世界的冷暖？怎么知道这个杯子好看还是不好看，所以它都是不存在的。那我们接下来再详细的讲何为六根呢？眼、耳、鼻、舌、身、意被称为六根。根就是根本的那个东西，可以生长的那个东西。比如说我们说树有树根，树是因为有了树根才能生长。那我们的六根也是用来摄取和生长万物的。我们把眼睛想做一个摄像头，眼、耳、鼻、舌、身、意都是如此，它是摄取外界的物理的工具。比如说眼睛，我们才能看到这个世界上的人、事和物；有耳朵，我们才能听到这个世界的声音；有身体，我们才能触碰到这个世界的冷、热、硬或者软；有鼻子，我们才能闻到这个物理世界的气息、味道；有舌头，我们才能尝到酸甜苦。所以六根是摄取的工具也叫六入。为什么叫六入啊？它对应的外面物理世界的六尘，对应着色、声、香、味、触、法。我们眼睛看到才会取色，耳朵听到才会取声，鼻子闻到才会取香，舌头尝到才会取味，身体碰到才会起触，意识有思维才会取法。所以六入是对应着六尘的。这个时候注意啊，我们眼睛看到了这个杯子，我们只是看到了这个杯子，这个时候我们还不知道他叫杯子，什么时候会知道他叫杯子呢？这个时候发生作用的是眼识，所以又叫还有六识啊，我们看到了这个杯子，杯子是尘，是外在物理世界的一个东西叫做尘。我们有眼根，当我们的眼根看到外面物理世界的这个色相，这个杯子，这个时候我们是不知道他叫杯子的，什么时候知道呢？这个时候旁边有一个人告诉你，这个叫做杯子，它是白色的。这个时候我们的眼识开始发挥作用，它是杯子，它是白色的。这样呢？下次我们再看到相同的类似的物品，我们就知道了它是白色的，它叫做杯子。这个时候那个识，是让我们分别它叫什么样的物品。我们看到一朵花，比如说我们刚出生的小孩子，他是不知道它叫做花的。这个时候有人告诉这个叫玫瑰花，这个叫百合花、这个叫牡丹花，然后你会告诉它颜色，这个是红色、这个是蓝色，这个是白色。这个时候它开始摄取了外界的信息，摄取的这个功能叫做识，有眼识、耳识、鼻识、舌识、身识还有意识，我们前五识只是起到了摄取识别的功能，这个时候意识开始产生。比如说我喜欢红色的花，我讨厌白色的花，他喜欢蓝色的，不喜欢红色的。这个时候意识开始产生分别，我喜欢听他赞美的声音，我讨厌他辱骂我的声音，我喜欢听音乐，我不喜欢听狗的叫声。这个时候意识开始产生分别，这个时候我们的眼识和耳识都起到一个入和输出的作用，入就是摄取啊六入啊。比如说他告诉我这个杯子是白色的，它叫做杯子这个时候是入。当我们又一次看到的时候，我们可能会告诉别人或者不告诉别人，我们自己也知道了它是白色的，它叫杯子。这个时候就在输出，然后我们的意识是在什么时候起作用呢？我喜欢这个杯子或者我不喜欢这个杯子，这个时候开始意识又开始起作用了。当我们的意识起作用的时候，就开始分别是非对错，就开始起贪念了。</p></div>"
  },
  {
    "title": "第十三讲-无眼耳鼻舌身意",
    "html": "<div class=\"B1_text\"><h2>无眼耳鼻舌身意，无色声香味触法</h2><p>当我们的意识起作用的时候，就开始分别是非对错，就开始起贪念了。比如说举个例子，我们面前放了一个黄色的东西，原本我们并不认识它，这个时候有人告诉我们，这个黄色的东西叫做黄金价值连城.这一小块儿就可以换取很多的财富。那这个时候是不是我们通过眼识知道了它叫黄金，通过耳识听到了别人的讲解，知道了它价值连城，这个时候我们的意识开始分别，我喜欢黄金，是不是开始就要起贪念了？那我们下次在逛街的过程当中，看到了那个柜台里面有黄金，我就想让身边的人买给我，如果他没有买，我可能就起情绪啦，这个情绪从哪里来呀？从你意识的贪念而来。这个时候如果我的老公没有给我买，我就开始抱怨。你看看你是如此无能，我要一块黄金，你都不能给我买，你看看别人家某某老公是怎么样做的。这个时候你的意识由于贪念就开始产生了情绪，接下来有可能要开始造业了。一个是你在不停地去抱怨他，第二个他如果没有满足你的贪念，你有可能就会去想其他的办法。或者说当他受到了你的这番侮辱，他有可能对你产生不好的行为，或者是他想证明自己就开始去做一些其他违法的行为。这一系列都是由于我们意识的那个贪念所起的。所以在生活当中也是一样的，本来我们看到这个杯子，我们看到一朵花，只是前五识发生作用，这个时候是不产生念头和行为的。但是第六意识心这个时候开始介入，就要开始产生念头和行为了。我贪恋一朵花，我就想要拥有，我贪恋财富，我可能走的就是不正当的行为，可能要做损害他人的事情。我贪恋一个人的美色，我有可能去走极端，所以这个时候心为王啊，都是我们的第六意识，心主宰着我们的前五根，去贪恋这个世界的外尘。我们常常讲的财色名食睡，这个时候就要开始产生不好的行为了。所以这里我们是在分享我们的六根和六尘，还有六识是如何产生作用的。只有我们了解它是如何产生作用的，我们才能知道要如何去修正。如果按《心经》来讲，这些都是没有的，无眼耳鼻舌身意，无色声香味触法，无眼界乃至无意识界。因为它自性是圆满的，本然就是空的自然都没有。可是呢我们已经降临在这个娑婆世界，红尘之中，已然着了色相，所以我们要明白它的原理，要知道色不异空，空不异色。你贪恋的那个黄金，你喜欢的那朵花，你追求的财富，你暗恋的某一个人，终究要归于空。所以告诉你，色不异空，空不异色。所有的都是不长久的，都是短暂的，终究要归于空性都是没有的。朋友们，课程录制现场问答环节到了，如何做到不起分别心呢？前五识只是起了一个记忆的作用，它不起分别的作用，就是我只知道它是白色的。那比如说眼识或者耳识，因为它有的时候会同时用，比如说你看别人告诉你这个杯子是不是你耳识和眼识同时起作用，可是他们起的作用只是记忆功能。白色的杯子，这个时候意识不进来的时候，你是不贪着的，也不会分别它好看还是不好看，它就是个杯子，白色的它只是它原本的样子，大家不断的减少欲望，是不是越来越自在，没有那么多的分别啊。你说喝水它不就是杯子吗？用什么杯子又有什么区别呢？用哪个就用哪个吗？你比如说泡茶也是，你泡什么茶就是什么茶嘛。你比如说吃饭也是吃什么，又有什么区别呢？这个时候你是不是就不起贪着。可是呢？如果你只爱吃肉，你是要杀生吧？杀生是不是就造业？比如说很多人，我想要更多的财富，我贪恋更多的美色，那是不是你要付出行动，付出行动就是在造业，所以它的根源都是那个意识，意识所起的那个贪念，这个贪念开始让我们做出来很多不好的行为或者说是恶行，就开始造了恶业。那比如说这是对外在的，还有的人对其它的呢，比如说我总是看不上什么样的人、什么样的人什么样的人，这也是你的意识在分别啊比如说我只喜欢什么样的人，不喜欢什么样的人，这都是你的意识在产生分别。所以产生分别你就产生痛苦。我看他不顺眼你就烦，你看比如说我哎呀我看到他我就特别高兴，我每天很开心，注意啊，你看到他很开心，有一天他不在的时候你就不开心了，所以最后还是苦的。所以无论你喜欢什么还是不喜欢什么，最后的结果都是苦的，因为你喜欢他。啊他不可能永远在你身边，他也不可能永远那么好看，他会老的。就像我们喜欢一朵花，喜欢花，它刚开始那两天好看呢，过几天你看着就不好看，它要枯萎的。哎你看，所有的事情都会发生变化的，你喜欢一个东西不是一样吗？我就喜欢这个杯子，别的杯子我不能喝水。那他丢了呢，他要坏了，你是不是就极其愤怒、痛苦？你看，现在很多人丢个小狗哭得死去活来、痛不欲生，就是因为贪恋呢。可是当我们不去贪恋这些事情的时候，我们不贪恋这个杯子，难道我们不用了吗？还用吧！只是你不再贪恋，他只是一个杯子，我们难道不要吃饭了吗？要吃饭呢。但是呢圣人为腹不为目，只要吃饱肚子就好了，目的不重要，吃什么哪有什么那么重要的呢？只要是填饱肚子的就可以了。这个时候你会发现，你是不是就没有那么多的执着和痛苦了？比如说特别想吃桃子，我们家没种，可能买你又一下买不到那么合适的，当下你是不是就偷别人家的桃子了？可是我对他没有贪着，有我就吃，没有我就不吃。这个时候你是不是意识不动，你的行为就不产生了？小郑以前还说呢，没修行之前要看着桃子树就只剩树了，那就是你的贪念。起了你的那个贪念，就指使你的行为就去做了不好的事情。可是你要没起那个贪念，你怎么会去摘人家的桃子呢？可是他不起贪念，不代表他不吃，有我就吃，没有我就不吃，这个时候你就不痛苦。所以都是被我们的意识主宰的。比如说你看我们的意识就是我们的这个心啊，这里讲的就是第六意识心啦，我们的这个心、我们的这个意识主宰我们好色，我们是不是就会产生很多好色的行为？它就指使我们的眼睛到处去看到处去看美色，对吧？然后看到一定程度不行，他又指导我们的身体要去触碰啊能体会吗？那我们贪婪财富不也是一样的吗？也是这颗贪婪的这颗心，这个意识去主导我们去看更多的关于财富的事情，接下来看着看着不行了，看已经不能满足我了啊，所以接下来就要产生更多的行为了。所以你看都是这颗意识心，他在主导着牵引着我们的五根不停的造业，这就是痛苦的来源。所以你这颗心不再动的时候，你不再起分别和贪念的时候，你就不痛苦。问：那我们不能一下子做到这种就是心不动，怎么样？一开始我们应该如何去一点一点的让心做到不动？修行有很多种方法，比如说我们刚才所讲的十八界，我们可以从断六尘开始，也可以断六根，也可以断六识，我们刚才所讲的是断六识，当你的第六意识心不在起分别。不在贪着的时候，你自然就不产生不好的行为。色生香味触法叫断六尘。我们再延伸一个词，佛家的出家人，我们在说什么？说这样的出家的师傅是远离红尘的，什么意思呢？是不是在断六尘呢？不睡高广大床是断触啊，不让自己住得那么舒服啊，是断触啊。比如说我们吃素色生香味触法，是不是断味道啊？不要对味道起贪着，这就是断尘啊。再比如说我们在山上修行，是不是断色呀？这个色是广义的，就是少被物质的东西诱惑，这就是断尘呢，这就是断六尘的方法。刚开始我们修行为什么要守戒呢？说你要吃素，说你要过午不食，说你不要贪恋更多的衣服，说你其实不需要每天都在化妆，这都在干嘛都在断尘呢？就是我们少一些被这些尘世间的这些物欲所干扰，这个时候你会发现你的心会跟着变清净，就是这个第六意识心。当你通过戒的行为不断地去断外在世界的尘，这个时候我们的心，第六意识心就会变清净变清净，你是不是自然少起分别少起贪着妄念起的就少。所以发没发现大家跟着一起越来越修行，你对生活的要求越来越简单呢？因为你已经离开了那么多的尘，自然你的贪着就会变少。比如说我们去看古人修行为什么容易成就啊？那个时代的欲望少啊，没有那么多的干扰，而我们现在这个时代的欲望太多了，人们不停地索取和贪求，所以就导致我们的意识牵引着我们的前五根眼耳鼻舌。不停地向外探，去不停地去贪着，所以人们离智慧越来越远越来越远了，很难回到最初原本清净的那个状态。所以儒释道的文化都在教给我们修行要减少欲望。道德经也讲：“为学日益，为道日损，损之又损，以至于无为，无为而无所不为”。说学习呀为学日益，益就是增加要不断地去增加自己的学识、自己的学问，为道是要日损的。说你要修道，你要是不断地减少减少你的欲望，才能返璞归真，去欲还本，回到你自己原本最初的那个状态。中庸开篇讲：“天命之谓性，率性之谓道，修道之为教”也在告诉我们同样的道理，我们本来每一个人都有的那个天性，我们率的那个天性就是道，可是我们那个天性丢失了，这个时候怎么办呢？修道之为教，所以你要按道的规律去不断地修正自己。你看，都在告诉我们要减少欲望，可是我们到了这个时代，我们没有学习出世间的法，我们就会不停地增加，不停地向外求，不停地贪取。这个时候你会发现我们六根不得清净啊。这个时候我们通过戒的方法对外面的尘少起贪着的时候，我们的心才能变得清净，我们的意识才能变得清净。意识减少了贪着、分别，就不再牵引六根去不停地摄入，这个时候叫六根清净。你六根是清净的，你的烦恼自然就是少的。</p></div>"
  },
  {
    "title": "第十四讲-无眼界",
    "html": "<div class=\"B1_text\"><h2>无眼界，乃至无意识界</h2><p>我们这个时候反过来再讲讲断六根，我们说眼、耳、鼻、舌、身、意，这是六根。比如说我们都见过或者身边的朋友，有的人会是从小眼睛看不见的盲人，盲人的世界他是不知道黑白，对吧，它是不知道红、黄、绿，这个时候当眼根没有的时候它是不摄入的，那没有眼根的时候，他会不会因为看到什么而产生烦恼和痛苦啊？不会了吧？断掉了。可是呢眼根断掉了以后，还有其他的痛苦和烦恼啊？还有耳朵呢？还有鼻、还有舌、还有身，还有意呢？比如说我眼睛看不到，但是我的意识特别渴望看到，会不会产生烦恼和痛苦？对吧？再比如说，当眼睛不能摄取的时候，要靠耳朵、鼻舌来摄取的。举个例子，你放到盲人面前一块豆腐，他不知道豆腐是什么。这样子的，这个时候他可能要摸一摸啊，它是方的、是软的啊它闻上去是有味道的，我记住了，这个味道我摸出来了它的形状是不是识别？这个时候下次再闻到这个味道和摸到这个形状的时候，它就知道了这个是豆腐。比如说我们是用眼睛看到一个人的样子，看到一个人进到了这个房间，可是盲人看不到的时候，它是用耳朵来摄取的。嗯有人开门，有人进来了。因为我听到过他的走路听到他走路的声音，我就开始知道是谁进来了，他一张口说话我就。知道是谁进来了，所以它是用其他的功能在产生分别。当眼根不产生作用的时候，不会因为看见什么而痛苦和烦恼。所以这也是一种断啊。可是呢你眼睛看不见，你还有身体的触觉让我们痛苦，你还有耳朵听到的声音让我们痛苦。比如说他说了一句不好听的话，外面小狗的叫声很吵，我们会因为这些我们不爱听的声音，它由第六意识开始主导分别，我们又开始产生了痛苦和烦恼。所以佛家讲一个词叫做”不入“啊！当你不入的时候就没有了痛苦和烦恼。我听到了小狗的叫声，我是不入的，它是不干扰我的意识的，它是不干扰我的这颗心的，这个时候我就不产生痛苦。他说了一句不好听的话，我是不往心里去的，是不入的状态，这个时候你就不痛苦和没有烦恼。当我们看到一个东西，我们看到了这个杯子这个杯子的实相，它只是喝水的一个工具，我不会入进去，我不贪着，我没有什么样的杯子，我不能喝水，这个时候你就不痛苦。那当我们去吃饭，今天中午做什么饭我就吃什么饭，我的意思是不起分别的，这个时候你会发现你就是没有烦恼和痛苦的。那我们讲说不入难道是没有味道吗？比如说我吃饭，我吃不出来它是咸的还是辣的嘛，吃的出来啊，只不过吃的同时我的意识不起。分别说我因为吃咸我不高兴，因为吃辣和我平时的饮食习惯不一样，我就开始产生烦恼和痛苦。只是我们不在其分别这个时候我们不起分别的时候，我们的六根就只是一个摄取的工具，工具是没有好坏的呀。我们看到的花就是红色的，我们听到的声音，音乐也好，小狗的叫声也好，它的本质都是一种声音。我尝到了酸甜苦辣，它本身都只是一种味道。这个时候我们不起分别的时候，自然也就没有痛苦和烦恼。当我们已经来到娑婆世界，已经着于色相，这个时候我们要不断地修行自己的意识，从意识开始断是最容易断的。我们总不能把自己的眼睛抠掉，你抠掉也没有用啊，抠掉也痛苦，为什么呢？你过去已经存下了你过去的认知眼识里面有概念了，所以你现在即使看不见你更痛苦，听不到你更痛苦，所以从根上六根上断，不是把工具拿走，是没有用的，是不再入，不再起分别，这个时候你会发现你的痛苦和烦恼就变少了。我们再来讲这个工具，我们看到东西是用眼睛看的吗？不一定，眼睛只是个工具，看到了什么却取决于我们自己的心。跟大家举例子啊，比如说我们现在心里有急事，有很着急的事情，我们现在开车去另外一个地方，比如说我们开车需要半个小时的时间。这个时候因为你心里有很着急的事情，啊你去回忆这样的场景，你有可能没有看到路两旁的风景，你有可能没有看到过往的车辆。那你说难道这个时候你眼睛没有睁开吗？睁开啦，可是你却没有看到路边的风景啊，因为你的心不在路边的风景上。我们再举个例子啊，说我们现在中午在吃饭，我下午有很着急的事情，我要快点吃饭，吃完饭我要出去办事。这个时候你会发现你的舌没有用了，好像忘记了今天吃饭的味道，酸甜苦辣，吃完了之后，嗯。我忘记了吃什么了，为什么你的心没有在这件事情上？再举个例子，恋爱中的男女，经常出现的，比如说我形容一个场景说恋爱中的男女坐在一个地方喝咖啡，可能你们坐在这个咖啡馆是人来人往的，这个时候你会发现当你深深地爱着对方的时候，你好像看不到过往的人群，你也忘了时间，因为你那一刻你的心里只有对方那个人。好像外面下雨了，你也不知道外面刮风了你也不清楚，这里过往走过那么多的人坐下，那么多人又离开，那么多人，似乎你都不知道，这个时候你的眼睛还在呀，你的耳朵也在，可是你看不见，听不见了，因为你的心里只有那一个人，这就是心之所向，所以心是为王的。你会发现当我们心不在焉的时候，视而不见，听而不闻，食而不知其味，因为你的心不在这里。所以我们要知道，是我们的意识、心在控制着我们的眼耳鼻舌身。这个时候我们懂得这个道理的时候，你要从意识上去开始修少起分别贪着，这个时候你会发现你的痛苦和烦恼自然就会变少，你的自性就会回归一分。你离本人的那个样子就会更近一分。所以我们再去看智者，是不是都是淡定和从容的，遇事情的时候呵呵一笑，为什么呢？他的意识不起分别，没有那么多的好坏、美丑、善恶、是非和对错。因为你所谓的善恶、是非、美丑，喜欢还是不喜欢，都是你的第六意识心所起的分别妄念，这一切本身就是空性的，只是我们不了解才不停地去分别。当你不停地分别，就会产生妄想和执着。当我们的意识断掉以后，开始不分别、不贪着、不起欲望，这个时候你会发现前五识也在慢慢的淡化。我们前五识讲了眼识、耳识，鼻识、舌识、身识，当我们第六意识开始断掉，不起作用的时候，前五识也会开始退化。举例子啊，说以前我们喜欢白色的杯子，我们以前喜欢黑色的衣服，我们以前喜欢红色的花，那个都是存在于我们前五识之中的，因为你已经摄取进来的信息，这个时候随着你第六意识开始不起分别，你会发现原本不是黑色的衣服是不穿的，你会发现你也穿了，原来我是无肉不欢的。你会发现经过不断的学习和修行，你也忘记了吃肉。有的人说，以前我很在意自己出门是不是化妆，现在你会发现，随着你第六意识的不起分别，你不化妆同样可以出门。甚至有的人经常想，我今年多大年龄了，我好像忘记了，是因为你第六意识不起分别。不再贪着这些事情的时候，你前五识内所存的信息也会不断地去淡化这个。然后你的分别就会越来越少越来越少。这个就是“时时勤拂拭，勿使惹尘埃”呀。说你不断地把第六意识开始断掉，你过去所存在的那些分别会随着我们的修行不停地去擦拭不停地去擦拭，你上面的尘埃就会越来越少，你自己就会变得越来越清净。所以这是我们现在建修的方法。当我们不断地往上修的时候，最后你还要把这些法都要破掉的，所以又开始回到了诸法空相，不生不灭、不垢不净、不增不减，是故空中无色、自性本然的状态，什么都没有的，都是空的，无受想行识，无眼耳鼻舌身意，无色生香味触法，无眼界，乃至无意识界。所以我们刚才讲的义是也是没有的，我们所讲的一切法都只是方便法。当我们不停地向上修的时候，你要明白这些法相都要破掉刚才我们所讲过的所有的话，都把它忘掉就可以了。</p></div>"
  },
  {
    "title": "第十五讲-无无明",
    "html": "<div class=\"B1_text\"><h2>无无明，亦无无明尽</h2><p>我们这里列举了断六尘六根断六识的一些例子，方便我们现在去理解。我们这里着重讲了断掉自己的意识，不起分别，因为这个意识是我们最常用到的，我们在用楞严经二十五圆通法门来举例。二十五圆通法门就是通过六根、六尘、六识合起来叫十八界，再加上七大地、水、火、风、空、见、识，一共二十五个法门。通过这二十五个法门都可以修成就的。我们举个尘的例子，比如说二十五圆通法门讲到香严童子，他是通过“香尘”悟道的，他看到比丘在燃沉水香，这个时候他看到这个香在燃起的过程，他就悟道了非烟、非火、非空、非有这个香燃烧以后的这个烟是从哪里来的呢？不是从火上来的，也不是从空上来的，也不是从木上来的，它是因缘合合而成，需要有香、需要有火，需要有点香之人，才有了这个烟这个气体。那这个烟燃烧以后他去了哪里了呢？它又变成什么了呢？他又回归于空啊，本来它就是空的，由于因缘和合成了烟，又由于因缘散去，随风而走，又归于空，所以呢由此悟到了空性智慧。还有药王药、上两位法王子，无始劫为世良医，说无始劫以来啊都是在尘世间做一个良医啊、行医的医生。这个时候他们尝遍了世间的种种草药，最后会发现每一种草药都有它原本的味道，可是当你把这些草药结合在一起的时候，又形成了不同的反应，产生了不同的味道。有的草药本身无毒，几种草药加在一起变得有毒了，有的草药是有毒的，可能集中草药合合而后又变成了无毒。所以从味尘因为他尝草药的味道，从未味尘悟到了一切都是因缘和合，悟到了空性智慧得以成就。所以说我们从十八界，从七大任何一个法门都可以悟道成就的。所以我们刚才用到的断六识。断六根断六尘，为何要讲断呢？是针对有来讲的，我们现在已经有色了，我们已经不空了，迷住了才讲断。那我们在上升一个境界来讲，当五蕴皆空的时候，色、受、想、行、识都没有，无眼耳鼻舌身意，无色声香味触法，无眼界，乃至无意识界，什么都没有，空掉的时候还何来断呢？连断字也没有了。所以以上我们所讲的断只不过是方便法门方便我们去理解，方便我们去修行，方便我们去参照，这是渐修的次第。朋友们，课程录制现场问答环节到了，为什么很多事情真的没有对错？你看放在哪里，放在谁身上它就不一样了。你看包括佛讲法四十九年，为什么从最浅的开始讲啊？因为他讲给的众生听不一样，你去看每部佛经的缘起啊，什么样的人在参会，讲给什么样的人听，你就知道他在讲什么了。所以最后金刚经佛不是说嘛是法平等，无有高下，哪有高下？还有一点啊，很多人总迷惑，听佛经的时候很有意思，哪部经都告诉你这是无上法门，《地藏经》这么说，《心经》也这么讲，你看这个《金刚经》也这么讲，”未发大乘者说未发最上乘者说“。这怎么哪部经都是最上呢？怎么哪部经都是最好的呢？对呀，他对于当下听这些与会大众，它就是最好，它最适合你的不就是最好的吗？最后什么叫无上啊？无上就没有高低之分，所以叫是法平等，无有高下。上和下不是对立来的吗？丑和美不是对立来的吗？你都没有无上了，都都上面都没有边，无上的时候就无上无下了，没有上下都一样，适合你的就是最好的。这个时候你再去听”七处征心、八还辨见“，你就明白他到底在说什么了。因为那个里面讲的”七处征心、八还辨见“讲的都是妙明真心的事情，为什么阿难绕不出来？因为他还在执着于第六意识心，他还在执着于这个意识心，是那颗心，是那个自性，其实不是《楞严经》里所讲的那颗心。是你能见的那个性是不变的，它讲的是那颗妙明真心。所以人们听楞严经很难听得懂，就是没有把它分开啊，就是不懂，它讲的不是一个东西。这就是佛常讲的认妄为真。我们总是认为这颗妄心才是我们的那个真心，不是的，它不是一个东西，所以人们就很容易迷迷在其中啊所以让我们痛苦的不是眼睛，人们说那我要不看到就好了。不是的，不是你的眼睛，是你那颗那颗贪恋的心指使的你的眼睛去做的。所有的人他就是坚韧不拔，我没有手了，用脚都能写字。因为他那个心没断，那个意识没断，所以断六根，断那个根是没有用的。他说我就贪恋美色，我就喜欢好看的衣服看看。美丽的花朵。我把眼睛抠下来，抠起来有用吗？没有用的，因为你想看那个意识是还在解决不了问题。老子在道德经当中所讲的“无知无欲”，很多人说这老子讲的不是愚民政策嘛？其实你不了解老子在讲什么。老子说“常使民无知无欲”，为什么呢？因为你没有那么大智慧的百姓，你会发现你知道的越少，你的欲望就越少。所以无知无欲就是相当于佛法的断六尘嘛。比如说你去看一看我们爷爷奶奶那一代人为什么幸福指数很高啊？他不知道那么多东西，我不知道开豪车我没有去全世界看过，我也没有见过那么多的奢侈品，是不是他的生活就很容易幸福啊！你会发现到西藏，你就会知道那里的人幸福指数非常高，为什么呀？无知无欲啊，他知道的少，他就没有那么多的贪恋，我们就是知道的太多了，就不停的攀比，这个时候不停地产生欲望，你就不停地产生执着和痛苦。所以我们再去看，修行的人为什么生活都很简朴，都很简单呢？不需要这些外在的东西，不再起贪念，这个时候烦恼和痛苦就会变少。所以你会发现，越是向外索取所产生的痛苦就会越多。就好比现在家长给孩子找学校，越是那种好学校、贵学校、热闹就是闹市区的学校就反而给孩子造成的痛苦越多。因为他经受的诱惑多呀，他见得太多了。可是人们不太理解，他说那你这说的不对呀，那孩子不应该去接受最好的教育吗？不应该去上最好的学校吗？可以呀，但是注定孩子的一生他就会很累，它会不停地向外去索取。所以修行之道正好是和那个相反的，是讲究的减少欲望，不需要那么多的身外之物啊所以修行的人都简单。而生活在红尘当中的人不停的去让自己生活得更好，不停的去让自己拥有的更多。所以为什么现在有很多富足的人开始向内追寻了，开始要走上修行之路了。开始要探寻文化了呢？因为你会发现拥有了那么多，内在并不快乐。注意啊，这个时候物质条件不好的人都怎么说呀？等我要是有钱我就不痛苦，可是你看看那些有钱的比你还痛苦，只是你不知道而已，也就是贫困山区的那些孩子们，那些大人那样。是我们看着他哭，因为他是无知无欲的，是你那是你的认知，你说人家过得好苦，其实你会发现他们的笑容很天真呢。你给他一件衣服他就很高兴，他吃饱肚子他就乐得不行，这就是无知无欲啊。可是人们认为是你得住上豪华的房子，你得开上好车，你得穿得很漂亮的衣服才是幸福。你穿上了，可你幸福吗？啊是你那。是在不知足所导致的。所以有一种苦叫你看着别人哭，就像你妈总是看着你冷一个道理，因为那是她觉得你冷，你不一定那么觉得。今天我想要一个更好的东西，得不到你自在吗？你明天又想吃一个更好的东西，你没吃好自在吗？给你了，你吃完了之后你自在吗？又不自在。所以人们都是不停地不停地索取，当拥有的时候又害怕失去，说我就想得到这小伙子啊，我费劲了九牛二虎之力，好不容易得到了你，越是得到的艰难，你越是想抓在手里。我得到了，我就怕失去。你看，你就开始痛苦，所以每天就不停的在这个痛苦之中啊，所以你看只要你想要的东西都会给你带来痛苦。本来是不是只是一个念头起，可是啊注意啊，你在追逐的过程当中会越陷越深，能听懂吗？比如说我追一个人，我喜欢他，我为他付出了很多，得不到我不甘心，我就不停的做偏激的行为，有没有？比如说我追求财富，本来我没想那么多，我要点儿就行，可是你越要越贪，你的行为越来越偏激，你走的路越来越歪，最后回不来了，就是越迷越深。你比如说对于孩子是不是一样呢？我本来就想发个脾气，或者本来我就想我说这孩子啊我生出来我就不管他了，能吗？你生出来你还得管，你说没事儿，我给他上完小学我就不管了，等上完小学不行，我得上上完初中呢。你你等孩子寄出宿呢，没事，你等孩子结婚了，结完婚不行，你等我给他看完孩子了。你看是不是越走越远？那你看爱情不是这样的吗？为什么往往在，在谈男女感情过成中越是觉得自己付出越多的越放不下，因为它起贪着了。你看什么样的人比较轻松？我付出就付出了，我结束就结束，一切都是空的，最后还要归于空。你看，豁达的人谈恋爱是不痛苦的，可是世人把那叫麻木，是你不懂，因为他不贪着。但是你看，你要觉得不行呢，我在你身上花这么多钱，你看他就不能分手，你分手他就痛不欲生，他就开始产生更多偏激的行为。对吧，那有的人说不行啊，我把我的青春都给你了，好像别人没有青春似的。对吧？所以你就知道，为什么呢？他觉得他付出的多了，他开始就贪着，所以他就不放手，你看在一家企业是不是，我都付出了这么多精力，我怎么能不干呢？你会发现这个时候开始采取了很多激烈的、偏激的行为。业力越来越多，迷得越来越深。所以众生你想一想，本来他是佛呀，他刚开始下来的时候他迷得并不深，可是他越来越迷，越来越迷，越来越迷，最后就不知道沦落到哪里去了。</p></div>"
  },
  {
    "title": "第十六讲-无老死",
    "html": "<div class=\"B1_text\"><h2>无无明亦无无明尽，乃至无老死亦无老死尽，</h2><p>从无明开始一直到老死，这是佛法中的重要的基础理论，叫做十二因缘法，简称十二因缘。十二因缘从无明开始，无明缘行,行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死。我们先从无明开始讲，这是十二因缘的缘起。十二因缘讲的是三世因果，因果是相续的、不断循环的过程，我们整个人来到这个世间就是十二因缘，任何事情的发生也是十二因缘。由于有了无明，才会缘起那个行为，叫”无明缘行“。我们先来说说无明，什么叫无明呢？就是不明白呀。人生最大的无明就是不了解空性，就是不懂的一切都是空的，所以才产生了行为。我们先举个生活中的例子，方便大家去理解。比如说家里有孩子的朋友说，我们的孩子不听话，他不努力学习，不刻苦认真地去学习，这个时候我们就开始生气，开始暴躁，开始发脾气，为什么呢？无明啊，不明白每个孩子的本性不同啊，有的孩子自律，有的孩子不自律，有的孩子聪明，有的孩子就是相对愚笨一些，他的本性如此啊，难道他会因为你的发脾气，因为你的情绪？本不聪明的孩子他能变得聪明吗？那有的孩子天生就是贪玩儿啊，贪玩儿亦是孩子的本性。那有的人又说了，那有的孩子就不贪玩了。对呀，人人的本性本来就不同，那我们到了今天，那我们每个人的本性相同吗？这个本性是指的人生于世所形成的那个性格，不是原本的那个自性。那你看看我们是不是有的人聪明一点，有的人性格天生就温顺，有的人天生就有天赋。你比如说孩子也是如此，有的孩子学习画画、学习跳舞、学习唱歌，一学就会啊有的孩子怎么学都不会，每个人的天赋不同，所以我们只有明白了这个道理，这个时候你加以引导就好了。孩子学成什么样子，是在他的这个本性的基础之上，让它变得更好就可以了，你再去强求也是没有用的。什么叫”无明缘行“呢？当你不明白这个道理的时候，接下来是不就产生行为了？你愤怒、发怒、暴躁，甚至是打骂孩子，你会发现你的行为就产生了，这是世间的无明。我们再讲讲出世间的无明，我们人生在世最大的无明。就是不了解空性，就是不了解轮回。我们认为我们这一生来到这里，它就是一个长久的，就是一个永恒的，所以才苦苦的执着和贪恋人世间的一切。当你不明白的时候，不明白一切都要归于空性。这个时候开始”无明缘行“，你就开始因为你的贪恋，因为你的贪着不停地产生行为，当你产生行为的时候就开始造业了。我们刚才讲了世间的智慧和出世间的智慧，那到底出事件的智慧更高明，还是世间的智慧更高明呢？其实用心经的理解来讲，无有高下呀，没有高低之分。为什么呢？我们固然要有出世间的智慧，我们才能了脱生死，但是我们已经入了色相，已经有了无明，我们才来到这里的。如果没有无明，我们是不来轮回的，就是因为有了无明，我们才来这里轮回。既然已经在这里轮回了，我们同样也需要世间的智慧啊。如何教育好孩子，需要世间的智慧，如何赚取更多的钱财养家糊口需要世间的智慧；如何带领好你的团队？需要世间的智慧，如何做好人际关系？需要世间的智慧，所以这个时候我们要世间的智慧和出世间的智慧相结合，等于空中妙有，出世间的智慧是空性的，世间让我们生活更好的智慧是有的，所以空中才能妙有。当我们有了无明就产生了行为，这个时候产生了行为，就有了善业、恶业和无记业。我们做的是善良的，是好事情，就会给我们自己积累善业，我们做的是不好的事情，就会给自己积累恶业，还有不好不坏的成为无记业。那我们是如何造业的？又分为身、口、意，身就是我们的行为，当我们做了不好的行为就造了恶业，做了善行就造了善业。还有口呢？我们每天会讲很多话呀，如果你讲的都是不好的话、都是负能量的话、都是抱怨的话，你也造了恶业。如果你讲的都是正向的，都是导人向善的，都是救人慧命的，就造了善业，那还有意呢？念头啊当我们的念头起的时候，已然开始造业了。所以为什么修行要讲修起心动念呢？当我们一个念头起处，你口还没有说话，行为还没有产生，但是它已然有业力的形成，所以要修我们的身口意。我们常听到一句话，万般带不走，唯有业随身就是我们”无明缘行“，我们的身口意的行为所产生的业力，我们到了下一世，我们什么都带不走，我们的阿赖耶识里面什么都没有存，只存了业，就是你的善业、恶业和无记业，它也存不下任何事情，说你这一生做了什么事情，你这一生是什么样的身份，你有多少财富都没有，里面只有善业、恶业和无记业，说你这个行为是善的，就有善业；你这个行为是错的，就有恶业。十二因缘每一个都是因果相续的。比如说无明是因，行是果，无明是行的前身，形是由于无明所产生的果，”无明缘行“，“行缘识”，又开始因果相续了，是因为无明是因有了果，产生了行为造作了业，这个时候行又变成因，有了你造业的这些行为，行缘识，识又变成了果。十二因缘都是这样因果相续的，说我们有了行为、有了善业、有了恶业，有了无记业，这个时候行缘识，由于行就缘起了识，识是阿赖耶识啊，这个时候由于无明产生了行为，由于行为所产生的善业和恶业，接下来开始有了阿赖耶识，有了阿赖耶识，我们要入轮回啦。我们在之前所讲到的，人人原本都是有自性的，都是有佛性的，那为什么还会来投胎呢？既然你原本都是佛，怎么会来投胎呢？就是因为一念无明起，就生成了一个世界。当一念无明起的时候，有了行为就有了业力，当有了业力就开始有了识，有了识就是我们的阿赖耶识，就开始入了轮回了。那有了识开始时，识缘名色有了阿赖耶识就缘起了名色。这里的名色呢就是我们讲的第七识”末那识“，什么叫名色呀？我们先把名和色分开讲，明是投胎之前的那个思维体那个状态，它是有受想行识的那个思维体，色是已经形成的那个胚胎，医学的叫法叫做胚胎佛法叫它色。当一个胎儿入胎的时候，已经成了形状成为色，没有成为形状等待投胎的那个思维体成为名，所以合起来叫做名色。当有了阿赖耶识，的业力会随着业力的轮转，接下来开始产生了名色，我们就来到了这个人世间，来到了娑婆世界，名色缘六入随着我们来到这个世间，在母亲的腹中，这个时候开始就有了六入了，就是我们讲的六根呢，眼、耳、鼻、舌、身、意。比如说我们在做胎儿的过程当中，在母亲的腹中是不是就开始有了眼耳鼻舌身，还有意识都有了，就形成了器官，形成了思维，这个时候六入缘触。当我们有了六根，有了这个六入，有了身体的器官，有了思维意识开始就有触觉了。当孩子四五个月的时候，你会发现特别有意思。当你触碰到孩子母亲的那个肚子的时候，你会发现他是会动的，因为他已经有触觉了。或者比如说做母亲的人如果吃得过是辣、过凉或者过热他都是有感受的，所以这个做母亲的朋友应该都有感同身受。比如说五六个月、六七个月、七八个月，孩子越大的时候，他的触觉越明显。比如说你晚上睡觉的姿势不舒服，如果压到他了，他都是有触觉的。所以我们从胎儿的过程当中就已经开始有了触觉，到孩子出生以后，它的触觉就会越来越明显、越来越强烈。随着我们逐渐的长大的过程当中，这个触觉一直都是在的。包括到今天为止，我们的触觉随处都在呀，比如说怕疼、怕冷、怕热，这都是触觉。再比如说胎儿在母亲的腹中的时候，一点点随着他耳朵的生长，这个时候他也有了听觉啊比如说他是不能受到惊吓的。为什么说在怀孩子的过程当中要尽量的安静呢？环境要尽量的舒适呢？就是因为胎儿已经开始有了各种觉知的能力，有了触觉，有了听觉。</p></div>"
  },
  {
    "title": "第十七讲-无老死尽",
    "html": "<div class=\"B1_text\"><h2>无无明亦无无明尽，乃至无老死亦无老死尽，</h2><p>触缘受，当有了触觉以后就有了感受。比如说即使孩子在腹中的时候，当他有触觉的时候，他是有感受的。比如说不舒服，他就会换个姿势动一下。那随着我们呱呱落地的时候，我们的感受就更多啦。所以随着我们来到这个人世间，随着我们接触的外界的尘。我们之前讲的六尘呢，六尘也只是个概念，色、声、香、味、触、法，除此之外还有太多的尘，六尘也只是概括。所以当我们来到这个人世间，我们接触了很多的尘，我们的感受就会变得越来越多。举个例子，孩子在刚出生的时候就有感受，比如说有的孩子喜欢喝奶粉，有的孩子不喜欢喝这就是感受啊，有的孩子喜欢喝的浓一点，有的孩子喜欢喝的淡一点。随着孩子的长大，有的孩子喜欢这样的玩具，有的孩子喜欢那样的玩具，有的人呢孩子喜欢安静，有的孩子喜欢吵闹，有的孩子。喜欢被抱着的感觉，你不抱他时候他就开始哭，这些都是感受。随着我们逐渐的成长，这一生的感受会越来越多。我们之前讲五蕴的时候讲过呀，我们为什么会有那么多的痛苦呢？都是因为取了色相而产生的感受让我们痛苦的。比如说在生活当中发生了一件事情，这个事情可能已经过去了，但是那个感受还在，所以我们就会一直痛苦。举个例子，两个人谈感情分手了，那这个时候分手那件事情可能已经过去了，一个月、三个月、一年，可是你还痛苦啊，为什么呢？你的感受还在呀。比如说一个人做生意失败了，做生意失败那件事情可能是两年以前的了，也可能是三天以前的，那个事情已然过去了，可是你失败的感受还在，所以就痛苦啊就是因为不了解一切都是空的呀。这些都是“尘”，我们上一讲举例楞严经的香严童子，它就是通过“尘”悟道的呀。说燃的这个沉水香，非空、非有、非火、非木，它本身就是因缘和合的，终究要归于空的。那如果我们从这些尘当中也能悟到空性，不就没有痛苦了吗？比如说我们举的例子，两个人感情的相处，最后分开了，它是必然的呀，因为它本来就是空的，它是随着因缘和合而聚散的，就像那个香一样，这个香燃完之后就没有了，燃之前它也是没有的呀。那两个人谈感情，在这段感情之前它也是空的，之后它也是归于空的。那你做生意失利了也一样，这个就是从“尘”上去断呢，就说我们太多的人不了解空性的智慧，执着于那个有，执着于这个受，才产生了无尽的痛苦。整个十二因缘讲了两重因果。第一重因果，由于过去世的因，我们把它称为前世。由于前世的无明缘行，然后有了今世的果。注意啊，什么叫今世的果呢？行缘识，识缘名色，名色缘六入，六入缘触、触缘受，这都是今生的果呀。为什么会有今生的阿赖耶识？为什么会有今生的明色？有了今生的六入，有了触，然后有了这些让我们痛苦的感受呢，是因为过去世的无明和造的业那个行为所形成的。这今世的果啊，我们已经来到了这个人世间，有了这些触和感受，这就变成了我们当下的因。所以当下的因接下来又会结果的，接下来的果受缘爱，爱缘取，取缘有啊。所以你看，我们今生有了感受，那有了感受开始受缘爱。我们有了感受，是不是就有了贪爱啊？比如说孩子喜欢被抱着的感觉，他就贪爱被抱着，不被抱着就哭。比如说我们喜欢上了昂贵的化妆品，是不是就产生了贪爱它？不买我就不高兴，我就想方设法去买。比如说我们有了感受，我喜欢一个人，接下来就有了爱了，我要贪恋她的美色，贪恋它的色相。这个时候你开始有了执着了，又开始产生心念上的贪爱了，这个时候还只是心念上的。比如说我喜欢很多名牌的包包，我喜欢豪华的车子，我喜欢漂亮的房子，这都是感受。有了受就会有爱，你就会起贪爱之心起贪爱之意。那接下来爱缘取，这个时候又要产生行为了，我贪恋他的美色，我就想得到和占有，我贪恋名牌的包包、豪华的车子、漂亮的房子，这个时候我就会想办法据为己有，这个时候就开始产生行为了。产生行为是不是又开始造业，又开始不断的种因呢？所以取缘有，取这个时候已经就产生行为了。取缘有什么意思啊？产生了行为是不是又有了业力了？它是循序渐进的。爱缘取的时候，爱是有了意识。是有了想法，有了念头，爱缘取取开始有了行为，开始去占有，开始去贪着取缘有，有了行为以后开始就产生了业力，所以叫有啊。又开始不停地去造善业、恶业和无记业，又开始种下了轮回的种子。这又是我们今世中的因呐。我们前边讲从无明缘行，这是过去世的因。有了过去世的因，我们开始有了识，有了名色，有了六入，有了触，有了受，这是我们当下结的果。这个果转而成因，就是因为有了识，有了名色，有了六入、有了触，有了受，我们着了这些色相，这是因。有了这个因，我们又开始种果呀，就开始爱开始取开始有，是不这个时候开始又要结果了，又因为结了这些果，这个又变成了因，因为你又重新有了业力，这是这一世的因，又导致了下一世的果。下一世的果是什么呢？有缘生，生缘死，又开始了下一世的轮回，所以能不能听明白？这是整个讲的三世因果呀，过去世的无明和行，导致了今生我们的识、名色一直到受。有了今生的这个因，我们又开始起贪爱，我们要占有，我们开始又重新造业，又成了今世重的因，又有了来世的生和死。所以十二因缘是因果相续，让我们不停的轮回，有缘生，有了业力啊，所以下意识又开始出生了，又从阿赖耶识开始轮回了，八识又开始转了。生缘老死，是不是有生就会有老死啊？我们先讲讲什么叫老死？老和死是分开的。什么叫老啊？诸根皆衰败谓之老。什么叫诸根呢？比如说我们常讲的六根，当我们的这些根，比如说眼睛、耳朵、鼻子、身体、意识开始衰败，谓之老啊。你看我们人老了以后，是不是意识也不清晰了？也开始变得糊涂了，身体也不灵光了，我们的耳朵的听力也没有了，眼睛也看不见了，牙口也不好了，也吃不出来味道了，这就是老啊。所以当我们的所有的根那个器官，包括我们身体的机能在衰败，衰败到一定的程度就谓之老。什么叫死呢？生坏命中谓之死啊，我们的身体坏掉了，我们的生命终结为之死。这个时候我们这一生就结束了，随着十二因缘又开始了不停的轮回啊因为有业力在啊，那一念无明起，我们就会随着那一念无明不停地产生行为，不停地产生时，不停的明色六入触受爱取有生老死，就这样一世一世的轮回。整个十二因缘讲了两重因果，第一重因果，过去世的因，我们把它称为前世，“无明行”这是前世的因，有了今世的果，“识明色六入入触受”，这是第一重因果。第二重因果，又有了今世的因，“爱取有”又有了来世的果，“生和老死”，所以这是三世因果。里面讲了两重因果，不停的相续，我们就不停的轮回，”无无明亦无无明尽，乃至无老死亦无老死尽“，这句话完整的说应该是空中无无明亦无无明尽，空中本来它是无无明的，没有无明啊，所以亦无无明尽。尽就是到了尽头啊结束的意思啊。空中它本来是没有无明的，自然也就没有无明的。所谓尽头和结束本然它就是空的，什么都没有啊，乃至无老死，没有无明、没有行，没有业力，不随着业力的轮转，自然就没有老死啊亦无老死尽，也当然没有了老死的尽头啊。所以整个心经告诉我们，一切都是空的，当你无无明的时候，后面所有的因缘都不起呀，你没有无明就没有行，没有行你没有产生业力，你自然也就没有识，没有阿赖耶识。没有阿赖耶识你也不会轮回不会轮回你也不会有名色，不会有名色，你哪来的六入呢？没有六入你就没有触，没有触你也没有感受。没有感受你不起贪爱不起贪爱，你不会取，不会占有就不会造业，没有取就没有业力，没有业力自然也就没有生，没有生自然也就没有老死，所以整个告诉我们都是没有的。可是呢我们已经来到了人世间，那说明我们已经开始有色了，那有色怎么办呢？我们要想再不入轮回，过去的因我们断不了啊我们讲过去世的因是无明和行，那个我们断不了，我们已经来到这里了，但是这里讲的两重因果，我们可以断今世的因果，今世的因是什么呀？爱取有，我们可以从贪爱开始断呢？我们不再那么贪爱，不再那么执着，我们不再看到任何东西都想占为己有。我都想执着的时候，你自然就不会取啊，不会产生行为，这个时候你不产生行为，也就没有了接下来的业力没有了接下来的业力就没有下意识的生和老死。啊所以从当世的因开始断，就是因为我们有太多的贪爱，所以才不得从轮回当中解脱呀。我们贪着孩子，我们贪着财富，我们贪着爱情，我们贪着名利、财色名食睡呀，你样样皆贪，样样皆留业力下一世你就还得来。我们本然从空中来中，中间有是一个人生的过程，终究要回到空中去。我们为什么回不去呀？就是因为不停的贪爱、不停的索取、不停的占有、不停的造业，才有了一世又一世不停的轮回呀。所以佛法是让我们舍弃一切归于空的。</p></div>"
  },
  {
    "title": "第十八讲-无苦集灭道",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>“苦集灭道”四个字在佛法中被称作叫四圣谛。我们先来解释这个谛是什么意思呢？在梵语当中是不颠倒的意思，翻译过来就是真理。这“苦集灭道”这四个字就是四条真理。圣是什么意思呢？就是圣人。何为圣人呢？解脱之人四条经过圣人解脱之人实证过的真理，所以叫四圣谛，就是“苦集灭道”四个字。“苦集灭道”四个字里面包含着两个因果，一个是现实的因果，一个是出世的因果。我们先来讲讲这个果，现实的果就是苦，我们人生当下所呈现出来的状态就是苦的。六道之中轮回的众生都是苦的，所以这个是现实的果。为什么会有这个现实的果呢？是因为有集这个因集呀就是一个集合体，是由于有了业和烦恼的集合体，才有了现实的这个苦果。一个是业过去世的那个种子种下的那些业力，导致了有我们现在四大假合的身体无明缘行啊，我们上一节课讲到的无明缘行十二因缘讲到过我们人为什么来轮回，有了现实的这个苦果，是因为有了过去世的那个业所种下的因，和我们当下的烦恼的集合体，有了我们当下人生的苦。佛说有八万四千烦恼，是形容烦恼之多。这是现实的因和果，苦是果，集是因。还有出世的因和果，出世的果就是灭，苦集灭道的灭。什么叫灭呀？就是涅盘解脱生死成为灭，这是果。那如何才能解脱生死达到灭的这个果呢？这个时候这个因就是道，道是什么呢？就是方法呀。要想达到解脱生死出世的这个果，那得学习解脱的方法，也就是道。道这里面包含的比较多，包含了三十七道品，有四念处、四正勤、四如意足、五根。五力、七觉知、八正道。接下来啊我们会开始详细的讲解这三十七种解脱的方法。三十七道品讲的就是三十七种解脱生死的方法。我们来先讲一讲四圣谛的来源。当时佛陀做太子的时候啊叫悉达多，这个时候啊他要出去寻找解脱之道，净饭王给派了五个随从，五个人来侍奉悉达多王子。这五个人都是婆罗门种姓，都是高贵的种族，让他们陪着。那个时候还不叫佛陀，叫太子去修行，经过了六年的苦修。后来的时候啊，佛陀体悟道苦修是不能得解脱的。后来呢他就吃了乳糜，乳糜是什么呢就是用奶做成的粥。他吃了这个粥以后啊，就无比丘呢就认为啊佛陀放弃了苦修，也就是放弃了修行。这五个比丘呢就不再跟随佛陀身边。那由此可见这五个比丘啊它是“依法不依人”的，它并不与它是一个太子，我们就一定要跟着他，他觉得放弃了苦修，他放弃了修行，我们不会再跟在他身边的，我们要远离这个人，说这个人已经不修行了，他已经不再追寻解脱之道了，所以这五个人就离开去了鹿野苑自己去修行了，这五个人以憍陈如为首，最年长的一个比丘，也有经典记载啊，叫憍陈那。这五个比丘呢在每部佛经当中记载的名字都不太一样，所以这个事情我们无需过多的执着，只要提到五比丘就是指的这五个人。当时佛陀是因为悟到了缘起而觉悟成佛的，什么叫缘起呢？诸法因缘生，诸法因缘灭，所有的事情都是因缘和合而成的。我们讲到十二因缘的时候就是缘起法。这个世界上没有任何一件事情是独立形成的，都是因果相续，有了前一个因就有了下一个果。有了当下的因，就会有了接下来的果。所以所有的事情都是因缘和合而成，缘起性空，所有的事情都是因缘而起、因缘而灭，但是它的本性是空的，所以称为假和或者说假有。所以当时佛陀悟到了缘起，觉悟成佛了。那这个时候佛陀呀就开始想，我悟到了缘起，觉悟成佛了，我要如何讲给迷途中的众生听呢？他们听不懂啊，所以呢他就讲“苦集灭道”四圣谛，所以“苦集灭道”是非常基础的佛法理论，也是最简单的解脱之道，它比十二因缘更简单。很多朋友在听十二因缘的时候，我可能还是听不明白。没关系，四圣谛讲的更简单，告诉你苦是如何来的，告诉你如何去解脱生死，所以就讲到了“苦集灭道”。所以这个时候佛陀呢他想啊我第一批要度脱的人就是当时跟在我身边的五比丘啊所以这个时候佛陀又去了鹿野苑，去找那五比丘。当佛陀远远地走来的时候啊，无比丘这几个人就在说，说他来了以后呢我们不要去理他，他是一个放弃了修行的人。结果佛陀走进了五比丘，当佛陀走进五比丘的时候，五位比丘感受到了佛陀无比的庄严和寂静，看到那个庄严的样子、慈悲的、寂静的那个样子，不自觉地就开始想要听佛陀讲法。这个时候佛陀就对五比丘讲了四圣谛，这个地方啊佛陀三转法轮，也就是反复地讲了三次四圣谛，五比丘当即得解脱，其中憍陈如过去是悉达多做太子的时候的老师，所以它的慧根是更好的，当即就证到了二果罗汉，其他的四比丘呢也挣得了初果罗汉。这个时候五比丘其中有一位叫阿说示也有的意为阿示说都是一个人。他去舍卫城乞食的时候啊碰到了舍利弗，也就是我们心经所讲的舍利子。舍利子是智慧第一。当时在守卫城的时候，舍利弗就看到了阿说示，说这个比丘的神态如此的庄严，所以他就过去问他说：你的老师是谁啊？你们修的是什么法门？这个时候阿说示对着他讲：我们的老师叫做佛陀，他给我们讲了很多法，其中最重要的就是诸法因缘生，诸法因缘灭。也就是讲的缘起，舍利弗是智慧第一啊，所以当他听到这句话的时候，当下即得解脱，证得了大阿罗汉的果位，已经了脱生死了。所以这个时候舍利弗就回去找他的同修好友目犍连，是佛陀的十大弟子神通第一的人，舍利弗是智慧第一。那个时候他们两个人的修行很好，已经两个人带着五百弟子在修行了，所以这个时候他听到了缘起的这个法门就特别的兴奋和高兴，因为当即就得解脱了。所以回去就和目犍连又讲了这件事情，目犍连听后也是当即即证的了大阿罗汉的果位。所以这时候两个人就带着他所有的弟子去拜在了佛陀门下，皈依了佛陀，这是这个故事的背景。那在讲什么呢？告诉我们四圣谛如此简单的方法，我们按照去修行就可以得解脱的。所以这是佛陀最初所讲的法门，它又是简单的，又是实用的，苦集灭道，首先我们要认识苦，只有我们认识苦、感受到了苦，我们才能去修行啊，为什么说人道好修行呢？因为人道有这些痛苦的经历啊人生八苦啊，生、老、病、死、求不得、怨憎会、爱别离、五阴炽盛。就因为有了这些苦，才会让我们升起出离之心呢？我们讲六道轮回，天、人、阿修罗、畜生道、饿鬼道、地狱道，这六道众生天人道太过于享乐，没有那么多的苦，所以也升不起出离之心。而下三道的恶鬼道、畜生道和地狱道，它又没有人的智慧，所以呢很难去修行。为什么说人道好修行啊？既有苦人又有智慧，所以在人道是最好修行的。所以当我们人生如果碰到一些苦难和当下觉得很痛苦的、难以接受的事情，其实真的不需要执着，就是因为有了那些苦难，我们才生出离之心呐。大家想一想，如果我们生活很顺遂、事业很顺、家庭很顺、爱情很美满，生活当中处处都是如意的，又如何生起修行之心呢？所以这个苦是让我们来认识的。佛说了众生皆苦啊，说神仙也是苦的，他也要经历生老病死啊，神仙也会衰老的，当福报享尽的时候，你也会往下落的。所以最大的苦本来就是无常啊无常就是苦，一切都是发生变化的。所以首先我们要认识这个苦，我们要知道人生当中处处都是苦难，六道之中处处都是苦难，所有的事情都在发生变化，那些感受会让我们痛苦，我们的六根所取的相会让我们痛苦，我们的认知的那个意识会让我们痛苦，外界的这些尘境会让我们产生痛苦，所以痛苦的原因实在是太多了。首先我们要认识这个苦是非常重要的，只有我们认识了这个苦，我们才能去找那个原因，就是集。那我们刚才说过了，痛苦的原因是由于“业力”和“烦恼”所产生的，所以我们只有找到了这个痛苦的原因，接下来之后，我们才能去想追求那个出世的果，也就是那个灭。我们认识到这个苦，我们再去找到让我们痛苦的原因，这个时候我们才去思索解脱的方法就是灭。这个时候在思索解脱的方法的时候，我们就会想如何去治愈我们众生的那个苦，这个时候就是访道就是修道，也就是三十七道品，我们接下来要讲到的内容。这里我举个例子，让大家更好的去理解什么叫“苦集灭道”。举个生活当中的例子，我们每个人都生过病，对吧？生老病死啊，死我们还没有接触啊，还不清楚啊。所以这就是苦啊那我们就讲讲病，是不是每个人都得过病啊？当我们得病，你看看是不是就是“苦集灭道”四步，第一步是苦，使我们感受到了苦，难受啊我身体不舒服，我头痛或者胃痛，或者身体受伤了，是不是？首先是感受到了痛苦啊，当我们感受到痛苦的时候怎么办？是不是找原因啊？我头痛为什么痛啊？我脚痛为什么痛啊？我受伤以后为什么痛啊？是不是得开始去找原因了？这个时候就是集，那灭是什么呢？比如说我们来到了医院，我们是不是得寻找方法呀？那我这个病能不能治好啊？那医生说可以啊。所以佛说可以啊可以解脱的，为什么不能解脱呀？只要你有出离之心，你不再贪着于世间的这一切。当你了悟了，原来一切都是因缘和合的，它的本来就是空的，都是没有的，我何必要执着呢？缘起性空啊。所以这个时候我们来到医院，是不是要问解脱的方法了？能不能治好？医生说可以治好的，那这个时候是不是就来到了第四步啊？找方法就是道。用什么样的方法去治疗呢？或者打针、或者吃药，或者手术，是不是治疗的方法呀？所以我们去体会生病的过程就是“苦集灭道”的过程，我们先感受到了痛苦，我们要去找痛苦的原因，为什么痛苦啊？接下来开始，能不能治疗呢？那第四步用什么样的方法去治疗呢？所以我们当时得的什么病，我们就用什么样的方法来治疗。那我们讲四圣谛，我们用什么方法治疗呢？就是接下来我们要讲的三十七道品，这里面又包含了四念处、四正勤、四如意足、五根、五力、七觉支、八正道这三十七种方法。那这个时候我们再来思考，当我们得病治疗的过程痛不痛苦啊？是痛苦的吧，你打针疼、吃药苦、手术躺着不能动，都是苦啊。所以我们在修习佛法的过程当中，这个过程是不是苦的？可是你是要为了离苦得乐的，况且这个时候的苦也只是假名为苦啊。当我们懂得安住当下的时候，以喜悦的心情来修行的时候，苦亦不是苦。</p></div>"
  },
  {
    "title": "第十九讲-三苦八苦",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>我们这节课呢重点来讲讲苦。上一讲啊我们举了一个例子，苦集灭道就好比是我们自己生病的这样一个过程和次第，还拿生病的这件事情举例子，比如说如果是一个感冒，其实我们也觉得没有多苦，或者说忍一忍挺一挺就过去了，不太当一回事情。可是如果身体生了一场大病的时候，我们就会急于寻找治疗的方法，去找到那个病因并且加以解决。那你看看我们的人生是不是如此啊？那苦是我们现世的这个果，所以通常来讲，经受了重大的痛苦和变故的人，会有机缘走上修行。比如说你看有很多朋友在生活当中得了大病，突然觉得一切都没有那么重要了，身体才是最重要的。说我经历了一场生意上的巨大挫折，突然就看淡了很多事情，说我经历了很多的生离死识别。我突然就想明白了，生活当中生命的意义到底是什么，我到底该去追求什么？这个时候都是因为看到了或者经历了重大的痛苦，我们才会生起出离之心，寻求解决之道。那还有另外一种人，我看到了生命的无常，我看到了身边人的苦，我就升起了修行之心。比如说我们讲的释迦牟尼佛，他是看到了别人的生老病死，去寻求解脱之道。比如说我们说孔子，他是看到了礼崩乐坏，看到了民不聊生，看到了文化礼仪的没落，所以升起教化世人的心，看到众生都是苦的世人都是苦的。所以我们现在的生活当中也有很多这样的朋友啊，可能我自己没有经历重大的痛苦，但是我看到身边的人太苦了，所以呢我想寻求解脱之道。这样的人是慧根极其深厚的，也是自己夙世积累而来的福德。我们当下这一世的果是由于前世的因所形成的，当下的这个果那也是因为前世积累了很多善业，积累了很多慧根，所以今生我们讲慈悲心。我们讲菩提心，我们讲仁爱之心才会更盛，看到别人的苦就会寻求解脱之道。不光是解脱自己呀，还要去觉悟他人，这就是心经开篇所讲的观自在菩萨呀。菩提萨埵不光自己要觉悟啊，还要觉悟有情众生，还要成就他人，上求佛道，下化众生。就是看到了众生的苦所生起来的出离之心，去寻求解脱之道。所以当我们的人生经历痛苦的时候，反而是走上修行的机缘。因为不够，苦无我们不会升起来。我想要脱离茫茫的苦海，我不想再轮回了，没有经历重大的痛苦是没有这些体会的。我们还每天贪图享乐在世俗的繁华之中，而不知道其实已经造了很多的业，导致下意识的因果会更不好。所以整个佛家讲的都是因果循环的规律。为什么有苦啊？这个苦是现世的一个果，是由于前世的那个因所造成的当下的这个苦果。所以往往越是承受了痛苦，越是经历了痛苦，我们才开始想要去修行，去寻求解脱之道了。我们去体会一个非常有意思的事情，我们反而越修行。越能体会到很多的苦，越能觉察到众生的苦。我们没有开始修行的时候，我们会觉得有的时候是苦的，有的时候是乐的。但是你越修行越发现所有的事情变幻无常，都是苦的。尤其是你修行了一段时间以后，当你具有了一些智慧和慈悲心的时候，你再去看身边的人，再去看身边的众生，你会发现太苦了。大家因为一件衣服也执着，因为别人看你不顺眼，说了两句不高兴的话也产生痛苦，因为别人的不理解、不认可也痛苦，夫妻吵架也痛苦，孩子不听话也痛苦，工作之间产生的矛盾也痛苦，你看别人不顺眼也痛苦，自己每天不知道为什么不高兴也痛苦，你会发现身边的人太多太多的痛苦了。可是我们没有修行之前，为什么没有觉察到这一切呢？是因为我们自己还带有情绪，还在那个苦之中。所以我们越是修行，你自己越自在、越喜乐的时候，你越能看到自己和众生的苦。比如说举个例子，你看小孩子哭不哭啊？想玩儿，我不爱学习啊，不行啊，身不由己，小孩子也挑食啊，我想吃的东西大人总是以各种理由不让我吃，你看苦不苦啊？不能自主的。那大人为什么挑食的情况少呢？因为你还有自主的权利啊，你为什么不挑食啊？你买的都是你喜欢吃的，而孩子不行啊，你买的都是你喜欢的，就会有他不喜欢的，所以他是不能做主的。你看看苦不苦？你看看，人老了苦不苦啊？身体的机能也在衰退啊，很多事情也做不了主了，你得听孩子的，让你去哪里住你就去哪里住，给你安排吃什么你就吃什么，要给你送敬老院就得给你送敬老院，你做不了主的呀。你想思考一个什么问题，你会发现哎呀一时糊涂了，我想出去走走啊，腿脚也不那么好了，我想睡个好觉，精神方面可能也不太好了，导致我的睡眠也不舒服，也不好。那你看看人病了以后苦不苦啊？不是这里疼痛，就是那里疼痛。甚至有一些在承受病痛的人们说我一死算了，你该承受的罪没有承受完，走不了的要还的呀。你看很多人都说死了算了，一死就痛快了，痛快不了啊，有业力在身呢，你没有承受完相关的那些罪恶和痛苦，你怎么受得了呢？那你看看我们每天的生活不是热就是冷，还要承受大自然环境的变化，还有很多地方有自然灾害，这都是苦啊。那除了这些我们不可抗拒的痛苦，还有呢我们的情绪给我们带来的痛苦，我们的贪婪给我们带来的。我们的不自信给我们带来的痛苦，我们的焦虑给我们带来的痛苦，我们的喜好给我们带来的痛苦。也有的人说了，喜好怎么会是痛苦的呢？是啊，当我们喜好一件东西、喜好一个事情、喜好一个人的时候，你看看是不是如此？你求不得就苦啊，得到了之后你又怕失去，又开始哭。所以我们之前讲过人生八苦啊，生老病死、求不得、怨憎会、爱别离、五阴炽盛，都是苦的。往大的讲又分为三苦，苦苦、坏苦和行苦。那苦苦就是说我们的身体给我们带来的苦，身体的疼痛、生病、冷热，还有坏苦。什么叫坏苦呢？高兴过后所带来的痛苦。所以说呀高兴即是痛苦，没有区别。过去了这个高兴就开始变得痛苦。比如说喜欢吃一个东西，吃的时候摊主高兴啊，吃过以后没有了。你看小孩子表现得淋漓尽致。吃没了，哭啊，你怎么给我吃没了呢？我还没吃够呢，开始苦啊。我们喜欢一个人痛不痛苦啊？你喜欢的过程爱得死去活来，可是当感情发生变化，你看看痛不痛苦啊？所有的事情都是一样的，只要你有贪着，你有高兴，你有喜好。这个高兴和喜好过后就是痛苦的，所以叫坏苦。还有行苦，世事无常变化，只要是无常的都会变得痛苦啊。比如说他原来那么爱我，为什么现在不爱我了呢？他以前不是这个样子的，他以前对我温柔体贴呀，爱护有加，可是现在他为什么又变了呢？我接受不了痛苦啊，父母离世我受不了那事事都是无常的，人生下来就要有生老病死啊，生意失败了痛苦啊，这都是行苦啊。我以前的生意那么好，我为什么突然的生意就不好了呢？我现在每天还是这么努力啊，我以前在工作的时候，老板特别欣赏我他变了，他现在不欣赏我了，我很痛苦啊，我原来身边那个闺蜜跟我的关系那么好啊，现在怎么突然跟我关系就不好了呢？痛苦啊。孩子长大了，不听话了，他要出去上大学了，他要出去工作了，娶了媳妇忘了娘，痛苦啊。那一切都是在变的呀，这都是行苦啊。所以你看，人生其实处处都是苦，而这个苦是怎么来的呢？我们讲十二因缘呢，“无明缘行、行缘识、识缘名色”。当我们投胎来到这个世界上，这个果就已经形成了，这是人道的苦。佛法讲六道众生皆苦啊，天、人、阿修罗，这是上三道，还有下三道，畜生道、饿鬼道、地狱道都是苦的。大家读地藏经的时候会有讲啊，你看饿鬼道和地狱道的痛苦，每天生活在无间地狱，忽冷忽热，不能吃啊，有的不能言，都是因为造了很多的恶业才下了地狱呀，更苦啊。那你看畜生道的苦不苦啊？尤其是现在互联网时代、自媒体时代，我们从很多短视频上会看到那些动物都在流泪呀，被杀害的那一刻不痛苦嘛？不光被杀害呀，还要放在锅里煮，还要被其他人吃啊。那你再去看看动物世界啊，弱肉强食啊，每天睁开眼睛就要不停的奔跑啊，跑得慢，强者饿死，弱者被吃掉，这就是生存法则呀。你看看，强者为什么会饿死啊？你跑得慢呢，你没有食物就会饿死啊，弱者你跑得慢就被吃掉了。那比如说我们再讲一讲，现在是夏天，蚊子为了吃一口血，冒着生命的危险被打死的，所以你看看苦不苦啊？那你再去看看，神仙也苦啊，神仙也有生老病死的，他的福报享尽的时候也要往下落的，他也要承受着无常的。我们讲六道皆苦啊，神仙也在六道之中。</p></div>"
  },
  {
    "title": "第二十讲-六道皆苦",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>那我们再往大了一点延伸，这是六道皆苦。还有一个词叫“三界”，我们经常听到这个词吧，不在三界内，跳出三界外，经常讲这个词。什么叫三界？欲界、色界、无色界。我们讲的六道众生皆在欲界，佛家一共讲二十八重天，我们讲六道众生都在欲界，色界还有十八重天。这个“欲”字啊就说明了一个问题，都是有欲望的，都是有贪着的呀，所以神仙也有欲望啊，也在轮回之中，所以依然是痛苦的。那到了色界，色界开始就没有了欲望了，在修禅定，按照禅定的深浅又分为十八重天。色界还有形状，到了无色界就变成了无形无状了。可是到了无色界还是在三界内，所以依然是痛苦的，因为没有超越轮回。这就是佛家讲的二十八重天，欲界六重天、色界十八重天、无色界四重天合起来叫二十八重天，六道三界内的众生都是苦的。那只有过了二十八重天，到了四圣道开始才能解脱，才能超越轮回。我们这一讲重点呢在讲苦，我们要知道人生的本质就是苦啊不光是人，六道三界都是苦的。所以我们首先要知道苦是本质就是人从生下来那一刻开始，就要承受着诸多的痛苦。我们刚才讲的三苦，苦苦、坏苦、行苦，又讲了人生八苦，生、老、病、死、求不得、爱别离、怨憎会、五阴炽盛，这也只是概念和总结性的，我们说主要的苦有这些，也只是举例说明，那还有太多太多的苦了无量无边。所以当我们经受了这些苦的时候，不要抱怨它是正常的，只要我们投胎来到了这个娑婆世界，只要还在轮回之中的众生皆苦啊，所以首先我们要正视这个苦，就是因为有了这些苦的现状，有了这些苦果，我们才更要生起出离心。这个苦是从哪里来的呢？是从“集”，“集”是因。有了集，这个集合体这个因，才有了那个苦果。集主要分为两个部分，也就是说我们痛苦的原因来源于两个部分。第一个部分：业力里的业。第二个部分：烦恼。这个业是过去世的因所形成的业力，就是因为有了过去世中的那些因，产生了业力，才有了我们今生的轮回，也就有了现世的那个苦果。第二个部分就是烦恼，佛说我们人有八万四千种烦恼，这八万四千种烦恼就会让我们。产生无尽的身口意的行为，有了这些行为又产生了新的业力，所以也就造成了下意识的苦果。那我们分为两个部分讲，先讲第一个部分“业”，这个业我们又把它分为“身口意”。身就是行为，我们的行为所产生的业力，口就是我们所说的话，我们所讲出去的有害他人的话，恶语相向、挑拨离间、骗人的话等等，这都是要造口业的。意就是我们的思维，我们的念头，我们总有一些不好的念头，诅咒他人的念头，这都是要造业的呀。当我们的行为做了好的事情，当我们的口讲了好的话语，有利于他人的话语，当我们的意我们的起心动念都是向好的、向上的、向善的，都是有益于他人的，就会积累善业，形成了善报。那反之，我们的行为都是损害他人的，都是骗人的，都是为了一己私利的，都是有害他人的，我们讲出来的话都是恶语相向的，都是伤害到他人的，都是挑拨离间的。通过我们说的话给别人造成了不好的影响的，我们的念头起初都是有损于他人的，都是内心在咒骂他人的，我们这些都是在种恶因，就是恶业就形成了恶报，所以又分为善业、恶业，还有无记业。善恶很好分辨了，我们刚才讲过了，只要你的身口意是善的，就会形成善意，深口意是恶的就会形成恶业。还有无记业，什么叫无记业呢？比如说我们做了一件事情，或者我们说了一番话，或者我们起的一个念头。我在做这件事情的时候，说这番话的时候，起这个念头的时候，无善无恶呀，他也不是善的，也不是恶的，我什么都没想，我就去做了这件事情，这就叫无记业。那无记为什么还会有业呢？你当时虽然什么都没想，我什么念头都没起，但是也会造成了不同的结果。在生活当中经常发生这种事情啊，说哎呀当时我做这件事情我什么都没有想啊，可是却有人因为我当时的无心的举动受到了影响，对他产生了很大的帮助和益处。你看啊，这个时候我们当时起心行动念，并不是为了行善，可是那个结果却是善的，所以它也会形成业力。那反之这种情况更多见了，说我只是心直口快，我说的话并没有想到会伤害他人，可是结果呢我们讲出了很多不恰当的话语，虽然当时你没有恶意，可是有可能对他造成了伤害呀。他听到了这番话，它产生了什么样的行为，做了不好的事情，或者由于我们这番话，由于我们的一个行为给别人带去了深深的坏的影响和榜样，这个时候它所产生的那个果是不好的。所以就产生了恶业，这就是无记呀。那业力呢又分为共业和不共业，共业就是大家共同所产生的业力，不共业就是你自己的行为了。举个例子，什么叫共业呢？说在一个村子里，大家共同做了一件善事，共同做了一件利益他人的事情，这个就叫共业。共同的善业同样还有共同的恶业呀。举个例子说，我们五六个人一起做了一件坏事，一起去偷盗，这就是共业，共同犯下的罪业，每个人都要承受业力的。那又分为定业和不定业。定业就是确定的业力，比如说你杀生，这是确定的，肯定是产生不好的业力的。比如说恶语相向，这是确定的，肯定要产生业力的。比如说我帮助了他人，这个也是确定的，是肯定要产生善业的。那还有不定业，不定业就是在因缘和合的情况下所产生的那个业，有可能报，有可能不报，什么时候报不一定，他要看因缘和合的。比如说很多人都会讲啊，念佛有功德呀，诵经有功德呀，有没有功德呀？有啊，说念佛消业呀，能不能消业呀？可以呀。消的是什么业呢？就是这个不定业。比如说举个例子，你实实在在的是造了恶业的，你造了的是定业，念佛、诵经都不能消你的定业。举个例子，自古以来有很多这样的事情，有的人比如说弑父、弑母啊，那必须要下地狱的，这是定业。你念多少佛没有用的，诵多少经没有用的。但是我们这个时候诵经，我们来念佛，所消的业就是那个不定业和那个无记业说我无心之失啊，造了很多业力。这个时候我们通过念佛，通过诵经是可以把这部分业力消掉的。所以说这个不定业告诉我们一个道理，它和无记忆是有点相关联的。因为有的人会担心啊，有的朋友说了，那我也不知道有的时候无形之师是不是造下了很多业。没关系的，不用担心，我们通过自己不断的学习、不断的修行或者去诵经，都可以把那部分业力消掉的。但同时也在警醒我们，恶业确定的那个业力是不能消除的，所以说无心之失所犯下的过错不用担忧，但是也要时刻的警醒自己，不要去做实实在在的有害他人的行为都要造业的，这是因呐，你造了这个业就会形成这一世和下一世的苦果呀。所以善有善报，恶有恶报，不是不报，时候不到啊，当因缘和合形成了该有果报的时候，它是必然显现的。所以不要去羡慕身边的人，你看有的人就会说，明明我身边有很多人他做了很多不好的事情，明明很坏，为什么他的生活还过得很好啊？你再去看他的晚年呢，你看有很多人来的是不义之财，你看看结局怎么样啊？结果都不好啊，他该到了显现的时候，它必然会显现的。所以不要去羡慕这样的人和事，不是不报，他时机还不到而已。还有一部分原因，我们只看到了人家当下的不好，那人家过去可能积累了很多的福德，是我们没有看到的。所以不要因为我们看到了中间的一个部分就去怀疑因果，因果是不虚的。所以佛法常讲“万法皆空，因果不空”，因果是不空的。法最后说了诸法空相，但是因果是实实在在，所留下的业力不会空的。</p></div>"
  },
  {
    "title": "第二十一讲-贪",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>《佛说十善业道经》是佛家的基础理论，那我们来讲讲十善业道就是有十善业呀，这十善业就是从身、口、意所延伸出来的。那我们看看都有哪十善业呢？不杀生、不偷盗、不邪淫，这是身就是我们身体的行为所产生的。那反过来，十善业就是十恶业呀，如果去杀生、偷盗、邪淫，就是造恶，也就是十不善。何为十善业？如何去积累善业呢？首先要做到身体的这三点，从行为上要约束自己，不杀生、不偷盗、不邪淫。那我们再来讲讲口，不妄语、不两舌、不恶口、不绮语、不妄语就是不讲假话呀，不两舌就是不做挑拨离间的事情。你看我们生活当中是不是经常犯这样过失而不自知？背后说一些什么话，导致别人之间的关系不好，挑拨老板和同事之间，挑拨夫妻，挑拨其他的朋友之间的关系，这都是两舌啊，都是要造业的，都是要形成苦果的。不恶口不对别人恶语相向，对别人恶语相向也是造业的。我们常听到一句话呀，“良言一句三冬暖，恶语伤人六月寒”，就形容的对别人恶语相向给别人所带来的伤害，所以呢不要恶口，我们多去讲有益于他人的话。多去讲鼓励和赞美的话，不要去讲伤害他人的话，不要为了自己的情绪就对别人恶语相向，既伤害了他人，也给自己造了业力，不绮语就是花言巧语，不要去花言巧语而欺骗他人，这都是造业的呀。所以怎么去分别这个绮语呢？你不是以花言巧语去骗取别人的什么？比如说骗取别人的钱财，骗取别人的感情、骗取别人的客户、骗取别人的信任，这都是绮语的。所以我们怎么想的我们就怎么说，而不是以满足自己的私欲为目的呀，这就是花言巧语啊。意业又分为了贪、嗔、痴，因为贪、嗔、痴都是由于我们的念头，也就是我们的意所形成的。所以我们要注意这十善业，这十善业就会形成果报，有了业力就形成了我们现在这一世的苦果。所以很多人经常问，修行到底该怎么修啊？我们修行的起步阶段，止恶扬善，就从这十善业开始修啊，不杀生、不偷盗，不邪淫、不妄语、不两舌、不恶口、不绮语、不贪、不嗔、不痴，那反过来就是十恶业。所以我们从这十个方向去开始不断地去修正我们自己，就会减少我们的苦，就会减少我们的业力。所以苦第一个部分是从过去的业力当中所产生，那我们少造业就少受苦，不造业就不入轮回了，就一点苦都没有了，就无苦集灭道啊，无苦集灭道前边还有两个字啊，叫空中无苦集灭道。当我们所有的业力你都没有的时候，我们就回归那个不迷的自性了，就回归那个空性的空中无色受想行识，一直到无苦集灭道什么都没有就彻底的解脱了，没有那个苦了。可是我们当下生活在这个娑婆世界还有这么多的苦，那怎么办呢？就是守住十善业，少造业、少受苦。因为这个苦果我们今生会有现世报，来生还会有果报，所以要想去断除这些苦的根本原因，要从业力上断。所以守好我们的十善业，不要去造恶业。自然苦会变少，无苦集灭道。我们上一讲讲到“集”，这个苦的因分为两个部分，第一个部分业，第二个部分烦恼。我们讲了十善业的时候啊，最后讲到了“意”。意里面又包含了贪嗔痴，这个贪嗔痴又是造业的，同时也是让我们产生烦恼的。我们烦恼从哪里来呀？从贪、嗔、痴上来。那我们再延伸一下，贪、嗔、痴称为三毒。我们今天呢不光讲三毒，我们来讲五毒。佛家的五毒讲的是贪、嗔、痴、慢、疑这五毒，那你看看这个词啊，就像毒一样，在我们的生命当中，在我们的生活当中，毒害我们这叫五毒。我们先来讲贪，贪就是贪图各种欲望啊。你看看我们人生在世，贪财、贪色、贪吃、贪睡、贪名、贪利、贪权、贪玩儿，你看看是不是贪的东西太多了？有贪会产生烦恼啊？不光会产生烦恼啊，还会产生业力啊，我们贪色，是不是就开始要产生行为了，我一定要得到它，不择手段。那你看这个时候不就造业了嘛，我贪图老板只能信任我。这个时候你看你从意就开始不停地去诋毁别人了，心里就开始形成了，然后接下来开始可能就产生了两舌恶口绮语，所以你看看，“不行，我们老板只能信任我，不能信任某某人”，这个时候我的念头是不是形成了？就已经形成业力啦。然后接下来就要开始说话啦，他什么什么什么什么不好，他曾经做过什么什么什么对不起公司的事情，就开始不停的两舌，不停的恶口、不停的绮语、花言巧语，以骗得老板对我们的信任。就开始造业，那我们谈一段感情的时候，是不是开始骗人。开始绮语花言巧语骗得她的芳心，那接下来可能要产生行为，为了满足对方的需求，为了得到她的欢心而产生一系列的不好的行为。那我们为了贪财，是不是要骗人呢？卖假货去做不好的事情，以谋取暴利，以谋取利润，那我们贪名那我们贪权是不是也开始不择手段了？所以只要是我们“贪”的东西，就会让我们产生烦恼进而就会产生业力，就开始造业了，所以又开始苦啊。但是这里注意啊，不要落入顽空。有很多人说了，“那我不贪就是什么都不做了呗“，我什么都不干了呗，那就变成了消极的了，不是这样。贪是什么呢？就是不停的贪求贪取那个欲望啊，而不贪是什么呢？我只是努力的种因，我不贪财啊，我不需要去求财呀，我只是踏踏实实的种因去做好我自己该做的事情，那个财顺便就来了呀。所以我们去看看很多企业家怎么讲话呀，我只是想做更多利益社会的事情、利益时代的事情、利益他人的事情，我解决了多少人的需求。你会发现，当你把这个因种好，你解决了他人的需求，那个钱不用贪呐，他自己就来了，说我贪色不用贪。当你喜欢一个人的时候，你努力地去做好自己就好了，当你自己变得有吸引力的时候，他自然就来到你的身边。你不需要通过贪娶，通过造业才能形成那个果呀，那个是苦果。而我们努力地去种好因的时候，那个果是自然而然就出现的。比如说我不需要贪得老板的认可呀，我不需要通过两舌、通过恶口、通过绮语去完成那样的苦果，而我自己把自己该做的事情做好啊，去努力的服务好客户。为公司着想，那这个时候客户是满意的，公司自然就会看到你的价值，同事自然就会看到你的付出，你那个果自然就来了。所以你不需要通过贪求而产生业力才得到，那个得到的也是苦果，只会越来越苦而不自知。而且这个时候你还落为向外求，不停地求别人的认可，求别人的满意，求别人的支持、求别人的赞同，你不停地向外求，越求越苦。求本身就是一种苦，再加上产生一系列的身口意不好的行为，又得到了更多的苦果。而我们懂得不断地向内求的时候，这个时候是积极的。不停的种因就好啦。这个时候再形成的那个果它是良性的，它不是通过造业所形成的，所以这个是努力的种因。那我们再讲啊，我们就破一下相要不然很多朋友就执着了。我们这个努力的种因，这个不贪是针对贪来讲的不贪，那如果再往上修的时候，善业也没有，所以一定要注意，我们是针对贪而修的不贪，所以我们努力的、积极的种因就会得善果。但是如果从无苦集灭道的角度来讲，你有善因也会来投胎，依然会苦，只不过受的苦要少一些。比如说我们同样生而为人，我们经常听到一句老话呀，人人平等。那你看看平等吗？你看从生下来开始，智慧平等吗？生活条件平等吗？能力平等、学识平等吗？家境平等吗？，是不是都是不平等的呀？”那不对呀，这人人平等，骗人的，明明都不平等，人家出生就是富二代，我出生就贫困潦倒“，那这个不平等恰恰是最平等的。为什么呀？你自己的业力福报相匹配而来的呀。所以看似表面的不平等。实则是背后的平等，因为业力不同。所以说了为什么要种善因呢？就是即使你来到了娑婆世界，你投生在人世间，你的福报和别人也不相同。所以这是针对贪所讲的不贪，我们去种善因得善果。但是从究竟的角度来讲，来投胎就是苦的，只不过你的苦比别人少一点啊。所以这里给大家破一个相。</p></div>"
  },
  {
    "title": "第二十二讲-嗔痴",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>“嗔”就是在逆境的时候，在委屈的时候所产生的愤怒、愤恨。你看，往往我们在逆境是不是容易产生嗔恨之心呢？不如意的时候就开始恨，开始抱怨，开始愤怒，开始产生情绪，这都叫“嗔”。当我们在逆境或者觉得自己委屈的时候开始产生了负面的情绪，这个时候意是不是就开始造业了？同时呢还有可能不断地延伸，开始造口业呀，咒骂他人，恨么愤怒么？起情绪么？心里可能把那个人默默的已经骂了一千遍了啊，不解恨一千零一遍。那再有甚者由于愤怒愤恨就会产生具体的行为啦，比如说打他，我背后做一些迫害他的事情，让他去承受更多的损失。这个时候是不是既有烦恼又造业呀？因为愤怒的是我们自己呀。佛陀曾经举过一个例子，愤怒就像一团火焰。当我们愤怒的时候，这团火焰首先是在我们手掌燃烧的，然后我们才把它扔向他人。嗔恨、愤怒这件事情，这种情绪首先伤害的是自己，给自己已经带来了烦恼，接下来伤害他人又不停地去造业。所以这个“嗔”字在生活当中处处都是。人生哪有那么多如意的事情呢？大部分的时间都是不如意的。为什么不如意啊？我执很重啊。哪来的不如意？不如我意嘛。他说的话我不高兴了，我不如意，他说的话我不喜欢听，我觉得我委屈了。你看今天他回来以后都没关心我，他变心了，我心里开始产生情绪，开始产生嗔恨。你看老板，别人加工资了，为什么没有给我加？我来了三年了他才干两年他升职了，你看这是不是全是不如意啊？这个时候我们内在开始产生情绪，更有甚者，既然是这样的，不能给公司节约了，我跟客户说点公司的坏话，让公司产生的损失，是不是造业？并且你自己烦恼是不停的不断，这个嗔恨心对我们身心是有极大的伤害的。我们再举个例子，比如说今天在公司，我和同事之间闹了点矛盾。他说的话我不高兴了，他今天处理一件事情让我非常的不爽，这个时候我们心里开始产生嗔恨心，注意啊，这个时候这个嗔恨心起的时候谁痛苦啊谁起谁痛苦啊。对方没当回事，人家该忙什么忙什么去了，人家该喝茶喝茶，该下班下班，该看电影看电影，可是我们自己嗔恨呢，你会发现这个时候你自己这个情绪久久不息呀，你自己的这个感受让你很痛苦。再举个例子，即使在马路上也是啊，我看到一个人让我很不顺眼，你会发现人家该干嘛干嘛去了，我们自己回家还气愤，还嗔恨呢。那你看看，痛苦和烦恼不是我们自己，不光痛苦，烦恼还会造业，所以这个嗔恨心是很可怕的，它在不停地腐蚀我们的身心健康，而我们自己还不自知啊，“痴”就是愚痴，没有智慧去明辨是非、不明事理、不明真相、不明无常，这都是痴啊。“痴”吃是什么呢？就是没有智慧，痴迷不悟，做很多事情的时候特别直。你会发现痴的人还有一个特点，别人说什么都听不进去呀，我执非常重，别人的都是错的，只要是不对我的心思和我的想法不同，和我的行为不一样，都是错的，而且别人讲什么都听不进去。比如说曾经有一个人，我们之间的感情是很好的，世事都是无常的呀，感情一时无常的，变了，对方不再爱我了，我不明无常就开始执迷了。都是对方的错，对方伤害了我，他变心了，所以才有情痴啊。你对于这个情这个字是极其的痴迷的，你不明真相，你不知道变化才是正常的呀。那做生意也是一样的，客户不进货了，开始产生怨恨，他为什么不进货了？明明我对他这么好，我这几年我给了他那么多的优惠。那你不明白吗？事事都是变化的呀，所以痴的人就是执迷在其中，不醒悟啊。你不了解一切都是在发生变化的。感情会变，我们的身体会衰退，生意会变、时代会变、季节会变，所有的东西都在发生变化，所以我们要懂得去不断地破除我执，不断地去学习新的思维，不断地去了解无常，这个时候你才不会愚痴啊。愚痴是没有智慧的表现，是看不透事情，是看不懂无常，所以痴迷在其中，执迷不悟很痛苦。所以你痴于什么，什么就会让你痛苦，痴于情就会深陷其中。那有的人痴迷于玩，那还有的人痴迷于孩子，把孩子紧紧地攥在手里，他结婚了，我们开始产生痛苦，他去外地工作了，我们也产生痛苦，这都是痴带来的。所以我们要了解，世事都是无常的，所有的事情不停的产生变化，这个才是正常的，所以不要痴迷于任何一件事情，沉浸在其中无法自拔，这是非常愚蠢的行为和非常愚蠢的念头。“慢”，贡高我慢。我们经常听到这样一个词啊，就是认为自己很高明，看不起别人，尤其是我们学习和修行一段时间的人，非常容易出现我慢。所以我们千万要切记，为什么会这样呢？因为我们学习和修行以后会有一些智慧的，当有了一些智慧我们就出来了。举例啊，你看看，我也不杀生，也不讲伤害他人的话，“你看他天天还在吃肉呢，看不起他的”，他因为一点事情天天跟别人计较，”你看我比他强多了“，这都是我慢。所以修行的人切记，不要看不起任何人，比如说出去旅游吧，你看我们在旅游的过程当中会看到很多这种情况。从景区出来以后，有很多游客就开始抱怨了，这个地方门票这么贵不值，一点儿也不好玩儿，累死了，吃也吃不好，睡也睡不好，水也那么贵，服务那么差劲，开始不停的抱怨、痛苦啊。那这个时候我慢的人是怎么做的呀？“没有见解，什么都不懂，你出来玩儿有什么可抱怨的？你看我就不会像他那个样子”。所以修行人切记，不要走入这个误区。那我们要怎么对治呢？生慈悲心。比如说还是同样这个例子，我们看到他诸多的抱怨，这个时候我们应该生起慈悲心呐。“你看看众生多苦啊，本来是为了出来玩儿的，结果不但没玩儿好，还产生了这么多的嗔恨之心，还产生了这么多的抱怨，众生太苦了”。所以你看，当你生起慈悲之心的时候，你再看到不如你的人，你还会傲慢吗？你甚至会惭愧的。“我要有更大的能力度脱他就好了，我要有更大的影响力影响他就好了，他要是也能一起修行就好了”。所以你你这个时候是慈悲的，而不是傲慢的，而不是看不起别人的，这个时候你才有更强大的动力去修正自己去影响他人。所以说千万不要我慢，当我们自己生出傲慢之心的时候，自己实则是痛苦的，并且也会产生业力呀。由于我们一个傲慢的行为，有可能别人就不信佛了。你看看有很多这种情况啊，我以前经常看到，比如说举个例子啊，我去菜市场买菜。我就会看到有很多学佛的朋友，人家在那里买鱼或者买肉，他就在那儿说：“不能吃肉啊，你不能买鱼呀，你买鱼是要下地狱的”。你会发现这个时候在旁观者，如果是不信佛的人的心里是怎么想的吗？“可不能信佛呀，这些人太魔障了”，可能你把人家的慧命都断了而不自知啊，这就是我慢呢。你总是觉得自己高高在上，觉得我学佛了我有多了不起，觉得我修行了，我有多厉害，我学了几天文化，我有多高尚，这都是我慢的。所以一定要生起慈悲心去对照我慢。“他还在吃肉，是因为它还不明呢”，所以这个时候不应该去打他呀。而他其实真的挺苦的，如果有机缘，我真的让他跟我一起修行，如果没有还是我的能力不够，我去默默地修正自己，而不是不断的指责和抱怨他人。所以说我们每一个正在学习的人、正在学佛的人、正在修行的人，千万不要落入我慢这个误区啊，非常容易到这里面去的，因为生出来了一些智慧啦。你看明白一些事情的时候，反而我慢会不停的生长，所以我慢是毒啊五毒之一呀。不停地在侵害着我们的慧命，侵害着我们的生活，而我们不自知。所以啊切记我们共同的自我勉励。</p></div>"
  },
  {
    "title": "第二十三讲-疑",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>“疑”怀疑呀，疑虑怀疑别人、怀疑事情、怀疑自己。你看我们生活中有很多这样的朋友啊，不相信他人的，比如：”他可能怎么可能做好事情呢？他背后肯定有什么目的？这件事情我跟你说一定不这么简单，他一定有什么不可告人的秘密“。还有的人我不相信自己，“我怎么能做好这件事情呢？我怎么能听懂佛法呢”？怀疑圣贤文化，“圣贤说的不一定对啊，两千五百多年前讲的东西现在怎么会实用呢？你别听他那么讲，没有用的，根本就不适合这个时代，落伍了”。这都是一样。当我们不停地去怀疑自己、怀疑他人、怀疑这个时代、怀疑这个国家、怀疑社会，你会发现你就看不到生活的美好啊，每天都是一副愁眉苦脸的样子，看什么都不高兴，看什么都是心存疑虑的，看什么都觉得背后有不可告人的秘密。这个时候你会发现整个人是缺乏自信的，缺乏阳光的，看不到世界的美好，看不到世界的良善，心中没有光，所以这也是烦恼的根源。人的本性当中就带着疑，这个疑是没有根据的，没有因的怀疑。什么叫没有因的意义呢？就是我不知道为什么怀疑啊，反正遇到一个事情我就是怀疑的，遇到一个文化我就是怀疑的，遇到一种关系我也是怀疑的，所以就会产生无尽的烦恼和臆想自己猜测的想法。比如说总怀疑老公或者老婆是不是有其他的事情啊？比如说兄弟之间是不是他总是占我便宜呀？背后他是不是做了一些小动作呀？老板是不是不信任我了？这些疑都是没有根据的。没有根据，其一是生烦恼，其二会造业的。比如说我怀疑别人可能就采取了行动，我可能心中就产生了怨恨，怀疑别人呢我可能就产生了什么样的行为和行动，所以都是要造业的。那有的朋友又说了，那不行啊，不是防人之心不可无嘛？如果我不去怀疑，我总是被骗呢，实则不然。被骗是因为贪心起意，而一个智者或者说一个觉悟的人不是凭空怀疑的，它是有因的，是有证据的。举个例子，比如说我们去问一个有智慧的人，你会发现有智慧的人不轻易给我们答话的。比如说我怀疑我的兄弟出卖了我，我怀疑老板不信任我，我怀疑我的另一半儿是不是出轨了。你看一个智者都会怎么回答呀？那拿出来证据呀，为什么要这样讲呢？你说说看，说我想做一个生意，一个智者不会轻易说行或者不行的。那你说说看呢，你去描述一下这件事情，你有什么样的因？你为什么要这样去想啊？这个时候你会发现这个不是怀疑，这是一种觉知的能力，他跟怀疑是两个东西。而我们总是把它分不清晰，认为那那不是防人之心嘛？防人之心绝不是怀疑，它是两个东西。我们这里呀引用论语中的一句话来更好的理解这个意义。不逆诈，不意不信。意义先觉者是贤乎，不去凭空怀疑别人欺诈我们，不去臆想别人不相信我们，这都是”疑“。那接下来又说了，”抑亦先觉者是贤乎“，抑亦，第一个抑反之的意思，说我们不去凭空怀疑别人不相信我们不去凭空怀疑别人欺诈我们，反之却能先觉者是贤乎。你看，这样的人是贤者呀，为什么说这样的人是贤者呢？他不会凭空无缘无故的怀疑臆想，而是抑亦先觉者是贤乎，反之却能在事情刚发生的时候，我们觉知到了。你看这样的人是贤者呀。<b>没有因的疑，</b>会让我们生出很多的烦恼，造很多的业。那有的朋友说了，我也不想疑，我知道很痛苦可是呢就是控制不住莫名就有那样的想法那怎么办呢？因为这个疑是我们人性当中自带的一个部分、一个特点。所以说我们学习了心经要懂得观照观自在呀，还要懂得观照我们的贪、嗔、痴、慢、疑这五毒。比如说我们现在的心念动了，为什么动呢？我想要求别人的更多贪心起来。比如说发生一件事情，我莫名的就产生情绪愤恨，嗔心起了。当碰到事情的时候，我们不明事理，颠倒黑白，痴心起啦。当我们遇到一件事情还没有发生，甚至什么都不了解的情况下，就开始怀疑自己、怀疑事情、怀疑他人、怀疑佛法、怀疑圣贤文化疑心起了。当我们觉得自己有智慧，我们觉得自己很厉害，看不起他人，看不上他人的时候，我们的傲慢之心起了。所以要懂得时时刻刻去观照，观照自己是什么样的心起的，起了什么样的心念，我们就把它灭掉。起了什么样的心念，我们就把它灭掉。这就是我们不断地在观照，不断的修行的过程。所以这个五毒啊是要破的。其实我们痛苦的根源、烦恼的根源不只是这五毒，但是这五毒可以基本概括我们日常生活中所起的所有的念头，我们去把它归类它属于贪心的。我们意识到了这是贪心，属于疑心呢我们意识到这属于疑心，我们不停地去观照，不停的去修正我们的念头，我们就会变得越来越自在、越来越有智慧，变得越来越平静、越来越随和，集是由于业力和烦恼两个部分所组成的这个因就有了苦这个果。我们来总结一下，业是过去世的那个因所形成的现世的这个果。我们再来讲两个字叫“业力”。<b>在我们的生命当中，仿佛有一种无形的力量在推动着一切事情的发生。</b>比如说比较顺利的人经常讲什么话呀，我做什么事情都特别顺利，总在关键的时刻有人出来帮我呀。为什么会这样呢？你善的业力在推动啊。那有的人又说了，屋漏偏逢连夜雨，我做什么都不顺，越不顺的时候越出现一些不好的事情。为什么呀？不善的那些恶业，那个力量在推动着你所以这个力量叫做业力。<b>所以越顺利的人，你会发现做事情越顺利，越善良的人做事情越有人帮助你越是不顺的时候，</b>为什么呢？这个时候你就感召了更多过去世的那些恶业聚集在此，形成了力量，叫做业力。那集的第二个部分是烦恼，我们把烦恼做了一下总结，贪、嗔、痴、慢、疑这五毒，这五毒是我们烦恼的根源，也是形成下一世的业力的缘起。贪、嗔、痴、慢、疑，这五毒不足以形容我们的烦恼，所以一切只是方便法。通过贪、嗔、痴、慢、疑这五毒来做了一个概括，告诉我们烦恼的根源都是因为这五毒而起的。我们生而为人都会有这五毒啊，所以这五毒就是我们的习性。你说贪、嗔、痴、慢、疑，哪个人没有呢？哪个人都有这五种习气。那这五种习气是从哪里来的呀？又是从业力上来的呀？因为我们有了业，我们才出生在这个世间，出生在这个世间就带着五毒的习性。所以我们知道了苦，知道了集，知道了这个原因是由于业和烦恼所形成的，所以我们天生就有了习性，就有了五毒。当我们知道了我们的苦是从哪里来的，是不是就到了灭谛了？四圣地的灭谛灭谛就是寻求解脱之道啊，如何才能解脱呢？怎样才能不再受苦？到底修到什么境界才没有了这些苦呢？“无苦集灭道”，这个灭是出世的那个果，道呢是出世的那个因，道就是方法。我们要用什么方法才能达到出世的这个果，叫灭。我们首先体会到了众生的苦，体会到了娑婆世界的苦，也知道了原因，我们体会了当下的这个苦。这个是现世的果。我们知道了集是我们为何会得到这个果的因，是由烦恼和业力而来的。我们知道了这一切，这个时候开始啊我们说得解脱呀，要离苦得乐呀。那想要离苦得乐所追求的那个果，就是灭出世的这个果，灭掉一切烦恼得解脱。如何得解脱呢？学习解脱的方法就是道，也就是我们接下来要讲的三十七道品。那我们现在先来讲灭。这个灭呀在佛家的名词叫涅盘。涅盘不是灭，灭是一个过程，涅盘是一个结果，我们不停地去灭掉自己的烦恼，不停地去灭掉自己的业力，达到的那个结果叫做涅盘。所以这个灭既是结果又是过程，我们不断地去修行自己的过程。不断的去灭除自己烦恼的过程，灭的彻底的时候，所得出来的那个出世的果叫做涅盘。当我们脱离轮回，就是彻底的解脱了，不再受苦了，不再有生死了。</p></div>"
  },
  {
    "title": "第二十四讲-入流果位",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>我们想要脱离轮回，想要不再轮回没有生死，就需要证得果位。证得果位它又分为四圣道，我们先讲的是超越轮回的果位。那么第一个果位叫罗汉，罗汉又分为四果罗汉、初果罗汉、二果罗汉、三果罗汉和四果罗汉。初果罗汉有它的名字叫须陀洹，还有一个名字叫入流，入了圣人之流，所以说到达初果罗汉的时候才入了圣人之流。二果罗汉叫做斯陀含，三果罗汉叫做阿那含，四果罗汉就是我们大家经常听到的阿罗汉，也叫大阿罗汉，这是四果罗汉。当证到四果罗汉的时候，就彻底的了脱了生死。入初果罗汉叫做入流，入了圣贤之流，不再轮回，但是还没有了脱生死只是不再轮回了，但是那个生死和我们这里所理解的生死是不同的，已经不再入轮回了，到了四果罗汉、大阿罗汉的时候，才会彻底了脱生死。罗汉的果位是如何证得的呢？罗汉是听闻佛陀讲法而证得的果位，听佛陀讲什么法呢？讲四圣谛，讲苦、集、灭、道而觉悟了就证得了罗汉的果位，所以罗汉又称为声闻，就是听闻，通过声音听闻佛陀讲法而成就的果位，所以叫做声闻。声闻也就是我们讲的罗汉，罗汉属于小成佛果，为什么叫小乘佛果呢？罗汉是自觉的、是自了的，不去度脱他人，所以是小乘佛果。我自己听闻佛法觉悟了，我自觉了，了脱生死了，不再受苦了，但是还没有去觉他，所以这是小乘佛法得到的小乘佛果叫做罗汉，又称为声闻。再往上一个果位，叫做辟支佛，辟支佛出生在无佛法时代，自证自悟而觉醒的，自己悟到了缘起法，<b>诸法因缘生，诸法因缘灭，</b>悟到了缘起性空，所以这个时候自己觉悟了，也就是我们之前所讲的十二因缘。出生在没有佛也没有佛法的时代，但是自己通过缘起悟明白了轮回的根本觉醒了，证得了辟支佛的果位。那我们听到这里啊，有的朋友就说了，那这辟支佛这么厉害，怎么自己就觉悟了呢？辟支佛的前身都是罗汉前身通常都是初果罗汉和二果罗汉。刚才讲过啦，初果罗汉和二果罗汉，他脱离轮回了但是还没有了脱生死，只是不再入轮回了。这个时候呢他又开始有生就有死啊，这个时候重新出现在某一个地方，但是那个地方正好没有佛法没有佛，但是他前身听闻过佛法，已经觉悟了，已经证得了罗汉的果位，只不过还没有了脱生死。这个时候他有那个根器，也就是我们讲的生而知之。所以呢自己又悟到了缘起，自己觉悟了，所以呢又叫做缘觉，就是悟到了缘起法而觉悟的，同时又被称为独觉，就是。自己独自觉悟的啊，这个称为辟支佛、辟之佛呀它属于中乘佛果。如果按大的分类来讲，只分为大乘和小乘，小乘里面如果细分又分为小乘佛果。小乘佛法中乘佛果中乘佛法，所以辟支佛属于中乘，因为他是自己觉悟的，悟到了十二因缘，悟到了缘起，比苦集灭道更深一层，所以被称为中乘佛果。小乘佛果里面的小乘和中乘和大乘佛果有一个区别，区别在于没有去做觉它的事情。只是自觉了，自己了脱了生死了，脱了轮回，不再受苦了。接下来第三个果位菩萨，菩萨比辟支佛比罗汉多了一个心，这个心叫菩提心。上求佛道，下化众生，不光自己要觉悟，自己要成就，还要帮助受苦的众生去觉悟、去成就，所以成为菩萨。我们心经开篇就讲，”观自在菩萨行深般若波罗蜜多时“，菩萨菩提萨埵，菩提就是自己觉悟了，萨埵是成就众生，所以又叫觉有情能成为菩萨。我不光自己觉悟了，在自觉的基础之上又去觉它帮助众生，所以呢我们称之为菩萨。你看看在我们平时的生活当中是不是也是这样的？我们看到有很多人在帮助他人，是不是？我们就赞叹了，哎呀这个人真是一位老菩萨，这个人真的心地善良，像一个菩萨一样。如果他没有去帮助他人，他只是关门过好自己的日子，我们会成为他菩萨吗？不会吧？所以菩萨比罗汉和辟支佛又多了一个菩提心，我是要觉悟众生的，我不光体会到自己的苦啊，我看到那么多迷途的众生还在受苦啊，所以我要去救人慧命，要去觉他这是菩萨所做的事情，所以菩萨又被称为大乘佛果。菩萨根据自己的修行深浅又分为五十二阶次，这五十二阶次就相当于五十二个等级去去往觉行圆满的路上，觉行圆满就成佛了。菩萨这五十二个等级又分为十信、十住、十行、十回向、十地、等觉、妙觉，一直修到觉行圆满就成佛了成就佛果。觉行就是自己的“觉”圆满了，”行“就是帮助众生觉他，不停地在自觉不停地在觉他，自觉和觉他都圆满的时候，觉行圆满，成就佛果了。成就佛果的时候又称作一乘佛法，或者叫无上乘，从大的分类来讲，分为小乘佛法和大乘佛法。小乘佛法里面再分一下就是小乘佛果和中成佛果，小乘佛果，罗汉中乘佛果、辟支佛。大乘佛法里面如果再细分，又分为大乘佛果和一乘佛果无上乘，大乘佛果菩萨。无上乘佛觉醒圆满了，当我们修到罗汉、辟之佛、菩萨、佛就彻底的解脱了生死不再受苦了。那有的朋友一听，这也太遥远了，我也修不到啊，这我什么时候能成佛呀？似乎跟我也没有什么关系呀。我们上一节课讲到灭既是过程，也是结果，最后达到那个果成为涅盘成就了，彻底的了脱生死了。可是灭又是过程啊，我们没有彻底了脱生死的时候，难道就不修了吗？也是在不停的往上修啊。不停地往上修，我们的苦虽然没有灭的彻底，但是也在变少啊，也在变小啊。所以我们讲完了四圣道，我们再往下讲，看看我们现在在哪里。四圣道再往下就是二十八重天，我们经常说六道轮回，天、人、阿修罗、畜生道、饿鬼道、地狱道，二十八重天都在天道，二十八重天最上层的四重天叫做无色界，再往下还有十八重天叫做色界，再往下的六重天叫做欲界。而我们人就是生活在欲界的。色界、无色界、欲界称为三界，所以我们都是在三界之内的。欲界不光包含欲界六重天呢，上至六欲天，四天王天、忉力天、夜摩天、兜率天、化乐天，他化自在天，这是天界的六欲天。我们熟知的神仙就是在第二重天忉利天。有的人就会说呀，做神仙多好啊，神仙是不是就不受苦了？神仙也苦啊，你看神仙在六欲天，欲啊！也在欲界呀。所以我们看电视经常会看到神仙也要谈恋爱的，神仙还有那么多的欲望，神仙还有那么多的性格呀，所以有欲望皆苦啊。那整个欲界上至六欲天，中至人界四大部洲啊，东胜神洲、西牛贺洲、南瞻部洲、北俱芦洲。我们现在这个地球上生活的所有的人、所有的生物，我们统称为南瞻部洲。所以人界不只是只有我们这里是有四大部洲的。我们引用一下《西游记》是为了让大家更好的理解一下四大部洲。孙悟空出生的那个花果山是东胜神洲，后来孙悟空出来访道，第一个来到就是南瞻部洲。来到南瞻部洲来寻道，后来没有找到说这里的人争名夺利几时休，早起迟眠不自由，骑着螺驴思骏马，官至宰相望王侯。这里的人欲望太多了，没有我要找的道，就从南瞻部洲离开了，去的西牛牛贺洲就是那个斜月三星洞。从那里访的道学习的筋斗云和七十二般变化。引用《西游记》这一小段是让我们对四大部洲有个概念就好啦。</p></div>"
  },
  {
    "title": "第二十五讲-修行是什么",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>下至八大地狱，我们讲的地狱道啊、恶鬼道啊都是在八大地狱的。所以整个欲界的范围很广，上至六欲天，中至人界四大部洲，下至八大地狱，整个都是在欲界的。所以出生在欲界的众生啊生来就有欲望啊，欲望越多我们所受的苦也就越多。为什么和大家补充一下三界的知识呢？是让我们清楚地知道我们现在在哪里，我们想要去往哪里，我们未来的路到底该往哪里走啊，所以即使有的人不能立地成佛，那我们也要不停的往上修啊。你看我们在人道的众生是不是比畜生道的众生受的苦要少得多呀？是不是比饿鬼道、地狱道的众生受的苦要少得多呀？同样，我们再往上修的时候，修到四天王天、忉利天、夜摩天、兜率天、化乐天、他化自在天，虽然还有欲望。可是呢他的痛苦也要比人间相对更少一点，可是往往人间却也最好修行苦难多呀。我们只有感受了到那个苦，我们才会去了解那个集。我们知道了那个集，我们才能升起来想要求那个出世的果，也就是说我们现在讲的灭。那知道了这一切，我们才要去想着我们要如何修行去离苦得乐。我们下一节要讲的三十七道品。所以往往苦难亦是我们修行的助缘，只不过我们要了解空中无苦集灭道，我们住在这个苦的相上呢，我们就每天痛不欲生。如果我们不住在这个苦的相上，了解一切都是空的。实则我们看似三界，看到四圣道，好像离我们很遥远，其实也并不遥远呢。我们经常听到一个词叫福德，还有一个词叫功德。那我们修行到底在修什么呢？举例子啊，比如说有的人去放生，有的人去做善事，有的人呢去做财布施，这个是属于福德，就是给自己积累福报让自己变得更好，让自己的下一世变得更好，在不停的往上走。所以我们经常听到一句话呀，善满三千自然成仙就是你不停地去做善事，做到三千件就可以成神仙了，所以看似很难，其实往上修一点都不难。那还有一个词叫做功德，修功德是可以出三界的，注意啊修自己是有功德的，罗汉也是在自觉呀，他是有功德的，修自己就是自觉呀，自觉是有功德的，觉他亦是有功德的呀，去做法布施啊、做无畏布施啊，救人慧命啊，这是功德呀。那我们再深入地讲一层，福德和功德往往还取决于我们的起心动念。举个例子，我放生挺好的，可以给自己积累点福德，可以让自己长寿，这个时候你在积累的就是福德呀。比如说我去帮助他人，我心里在想，我多帮助他人，给自己积累善业。就像我们学《了凡四训》所讲啊，不停地去帮助他人，我自己可以求一个官，不停地去做善事，我可以求一个子。那我们怀着这样的起心动念，就是在给自己积累福德呀。那我们这个时候再上升一个境界，金刚经讲无相布施，什么叫无相呢？我不认为我在帮助别人，我不认为我在行善。你看这个是无相了，没有我相、没有人相、没有众生相、没有寿者相，这个时候了不得呀，有功德了，所以无相布施就是功德了。举个例子，我还是在放生，我没有想过放生会让我变得长寿，我没有想过会给自己积累福德，我去行善的时候我自己没有所求，这样的起心动念就是无相布施了。所以金刚经就是讲无相布施的，无相布施是有功德的。修福德、修功德都是在不停的往上走的过程。我们刚开始修行的人做不到无相的，我帮助人家我心里就是想着那样，我的起心动念就是要帮助他人的。所以没关系啊，我们在修福德，让让自己变得更好，让自己不停地往上走。当我们的福德修到一定的程度，我们在破相啊，不着相、无相的去布施，我没有认为我在帮助别人，我只是做了我该做的事情，我去放生，只是看到众生可怜，众生苦啊，我想着去救人慧命，是名救人慧命啊，只是这么说呀，说是在普渡众生，我并没有认为自己在普渡众生啊，而是菩提心起呢，看到众生的苦不忍心呐，所以你就去不停的做事情，不停地去法布施，不停的无畏布施，减少别人的痛苦。这个时候你不着这个相，这个有功德了，我们的每一念都在灭，每一念都在离苦，所以说起心动念很重要啊，我们灭的彻底，我们就解脱轮回了。我们没有灭的彻底，没关系，慢慢灭呀，不停地去修我们的起心动念，不停地去修我们的行为，不停地去守我们的口，修。我们的身口意啊。所以这个时候我们再来看二十八重天，再来看四圣道，说远也远，说近实则也近。比如说我们老一辈的人，包括生活当中也有很多这样的人不懂佛法呀，我也没有学习过圣贤文化，可是他做的事情都是善事啊，他做的事情都是帮助他人的事情，他做的事情从来不损害他人，你会发现这样的人都成了神仙了，因为他在不停的积累善业呀，他在不停地做着福德呀，只是他自己不清楚。虽然自己不清楚，不影响它往上走。所以我们学习佛法就是让自己变得更明了。我们要知道我们要去哪里，我们现在生活在哪里，我们想要去做一个什么样的人，我们将来想修到什么样的位置，为我们指明了方向。所以并不要一听三界、二十八重天、四圣道就被吓到了，觉得很远，其实再远也是一念之间呢。如果我们不停地去做着自觉做着觉他的事情直至觉行圆满，就成就佛果了。所以难与不难往往在一念之间，看似很远，实则也很近。为什么要讲以上这几句呢？实则很远，实则也不远，是为了给大家生起信心呢。不同的人听到佛法就会有不同的感受。有的人听闻佛法升起了菩提心，说我太苦众生太苦了，我不光要自觉，我还要去觉他呀，我不能沉迷于在欲望的世界里。有的人听闻佛法，升起了菩提心，有的人呢听闻佛法升起了退转心，太难修了，我也成不了佛呀，成佛又有什么意义呢？又有什么区别呢？这个时候反而退转了，有的人听闻佛法涕泪悲泣啊，触动神识了，有的人听闻佛法犯困有业障的阻碍，所以不同的人听闻佛法会有不同的感受。为什么会这样呢？看似是我们在选择佛法，何尝不是佛法在选择我们呢？举个例子，有的人刚开始修行说：我一定要修大乘佛法，我也要去帮助他人，我也要去觉悟他人，你会发现做着做着依然是自私自利的。有的人说我先不考虑去觉悟他人，我也不想去帮助他人，我先修自己就好了，我自己还没觉悟呢。可是你会发现修着修着就去做了帮助他人的事情。所以为什么说呀？看似是我们在选择佛法，我们在选择一条路往前走，但实则不然，实则是路在选择我们。为什么呢？因为我们宿世的根器不同，宿世所修不同，宿世所带来的那个思维和业力不同。所以有的人去自觉，有的人退转了，有的人生起菩提心，不停地去觉悟他人，都是源于我们宿世所积累的那个根器、那个慧根。我们当下所有的这个慧根都是生生世世所积累的，所以无论我们当下有多大的智慧，甚至是我听闻佛法就是犯困的，那我们也要继续前行。只有我们不断地继续前行，才能给自己增加更多的福慧，也才能给下一世做更多的积累，我们可以循序渐进地去离苦得乐，所以不要去执着，有的人说我听不懂，别人都听懂了，不行我就不学了吧，不行我就退转了吧。这只是你看到的当下的一个相，你没有看到人家过去世的那个修行，所以无论我们在什么样的阶段，都不要放弃，也不要生执着。<b>修行就是不断地修正自己，让自己的苦难变得更少，让自己变得更有智慧，变得更自在，变得更喜悦、变得更有福德，又不是和他人比的。</b>所以整个这一段告诉我们，听到这里的朋友不要生执着，不要去对外攀援，更不要退转，误了自己的慧命。</p></div>"
  },
  {
    "title": "第二十六讲-四念处",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>无苦集灭道的“道”就是方法。我们先感受到了、认识到了我们的苦，我们又讲了“集”找到为何会苦的原因，是因为有了过去世的业力，有了我们当下的这个苦果。由于我们的烦恼、贪、嗔、痴、慢、疑，又造成了下一世轮回的业下一世轮回的因。我们有讲过了灭如何才能离苦得乐呀？要超越轮回，超越轮回，我们不再有生死的时候，不再随业力轮转的时候，自然也就没有了苦。那接下来我们要讲了到底该如何解脱呢？如何才能不再苦呢？这个时候就要讲到道了，讲到解脱的方法，苦集灭道是最基础的解脱的方法，道里面又讲了《三十七道品》、三十七种方法，难道只有三十七种方法可以解脱吗？不是的，可以解脱的方法有千千万，那佛学里所讲的三十七道品。是给我们归类总结，就好比是我们的烦恼难道只有贪、嗔、痴、慢、疑这五毒吗？不是的，用这个五毒来概括我们的烦恼，同时用这三十七道品来概括修行的方法，概括解脱之路。所以我们一定要懂得这个道理，切勿执着。我们很多人学佛法呀很容易执着，认为是不是只有三十七道品？我不是按照这三十七道品修的，难道就不得解脱吗？不是的，方法有千千万万种，而三十七道品所讲的三十七种方法，是佛陀给我们举例归纳，告诉我们该如何去修行。要想离苦得乐，首先要认识到苦啊，要观到苦观到人生处处都是苦的。那有的人就说了，那这不是消极的吗？这个是真相吗？本身我们的人生处处都是苦啊，只不过我们没有开始修行，没有更深的智慧的时候，看不到人生的苦，看不到众生的苦。因为还沉迷在娱乐之中，还有那么多的欲望，还有那么多的贪求，所以呢才有了及时行乐，而看不到自身所受的那些苦。三十七道品又分为七个部分，四念处、四正勤、四如意足、五根、五力、七觉支、八正道。那我们先来讲四念处。念就是念头啊，处就是我们当下的处境，用四种智慧的念头去观我们当下生存、生活的处境，这个叫四念处。<b>观身不净,</b>注意啊，用智慧的念头去观照我们的处境，如果不用智慧，我们怎么会观到身不净呢？你用智慧的眼光，你用解脱见再去观我们的身，观身不净我们从投胎开始，是父精母血，就是因为欲望而生的呀，男女之间有了情欲，有了爱欲，这个时候才有我们的出生。所以你看看是不是从出生开始就是不净的？那你再去观我们的身体都是血肉模糊的，你看这个完整的身体我们看不到，可是我们看到一些受伤的画面、流血的画面，你看看是不是不净的？包括我们老死的时候啊，你看看身体是不是不净的。还有那些生活不能自理的人呢，你看看你看到的是不是都是不净的？人老死的时候啊，当断了气以后，埋在土里就开始生蛆了。看看身体干净。所以首先我们用智慧的眼光去观我们这四大假合的身体，它是不净的、不干净的。观身不净让我们可以减少执着和贪着呀，不去执着自己的美貌，不去执着自己身上的器官，因为它都是假的，它本身也是不干净的，同时也会减少我们的贪着呀，不再那样贪恋美色呀。当你看上一个女子，看上一个男子的时候，或许是因为他的年轻漂亮，这叫贪图美色呀。可是他又人老珠黄的时候，然后你再懂得去观他的身体也是不洁净的，不干净的、是污秽不堪的。所以我们只有拥有了智慧，你才懂得观身不净。当我们观身不净以后啊，你会发现不再执着自己，我必须得打扮得多么漂亮，不再执着于他人的色相。这个时候你会发现我们才能活得自在和从容，才不被自己这个贪着所带着走。否则每天贪恋自己的身体，贪恋他人的身体呀，殊不知都会让我们不停地去造业的，让我们不停地产生痛苦，<b>观受是苦.</b>我们观一下我们自己的感受啊，他是痛苦的呀。今天谁看我不顺眼了，你看，是不是感受又来了？今天谁说了一句话让我很不高兴，感受又来了？今天我感受很热、很焦躁啊我感受我很冷，你看，身体的触觉带来的感受也是痛苦的。我今天感受我很疲惫，我今天感受我很兴奋，我很高兴，高兴过后又开始不高兴，我今天吃的不合我的意，我感觉不舒服。所以你看看我们的感受，处处是苦啊，可是我们没有学习、没有修行的时候啊，我们看不到。原来处处都是苦的，这个苦才是真相啊。也只有我们观到了这个苦，才会生起出离之心，才会想要解脱，才会去寻找解脱的方法，而不执迷于我们的欲望和贪着之中。我们很多时候都在追求感受的满足啊，可你发现感受是满足不了的呀，感受是时时刻刻都在发生变化的。很多在不停学习和不停修行的朋友，你会发现修行一段时间以后啊，有很多人开始变得流泪了，甚至我看到一个视频，一个动物被杀害都流泪了，我看到身边人在受苦啊，我流泪了。这个时候说明我们的智慧在增长，我们的慈悲之心也在增长。这个时候你会发现，你看到的这个世界它就是苦的。恰恰是感受到了、看到了这种苦，才生起我们要求解脱之心，我们才会去寻求解脱的方法，才会不停地去修正自己。所以这个苦绝不是消极的，而是看到了这个苦之后所产生的慈悲心和出离之心。<b>观心无常。</b>我们观了身体的不净，对身体不再贪着。好像身体也没有那么重要啊，我们人生这一世啊都会讲什么话呀？只要身体健康就可以了，只要不生病，其他的都不重要。可是你用解脱见来观身体也不重要啊，是不是又减少贪着？那接下来又观受是苦啊，我们的身体虽然健康，可是很多感受让我们痛苦啊。所以我们要是明白了受是苦，就不再追求感受，不再贪着感受了。再接下来观心无常啊，你看看我们的心是不是也是无常的？这里的心指的我们的第六意识心，比如说孩子考上大学了，心生欢喜。那你看，观心无常，这个欢喜是从哪里来的呀？是从孩子考上大学这件事情来的欢喜。孩子没考上的时候就痛苦、就悲伤啊！一个人很爱我的时候，心生欢喜，不再爱我了，心生悲伤，心生愤恨。我们的心多么无常啊，都是随着事情而欢喜、悲伤、愤怒、焦虑。每发生一件事情，我们的心就跟着在动，有高兴的、有喜悦的、有悲伤的、有愤怒的、有抱怨的。可是我们要了解呀，这一切本然就是空的，它只是因缘和合所结成的这个果啊。比如说对方不再爱我们了，说明因缘不再具足啊孩子考上大学，说明各方面的因缘是具足的，有什么可高兴的呢？孩子没有考上，说明因缘不具足啊，说明努力还不够啊有什么可悲伤的呢？那再重新去种因，在努力的去学习就好了，所以这个时候你会发现你的心就定了，你知道一切的事情都是因缘和合的，我们的心何必要跟着动呢？他今天说了一句我不高兴的话，那是他的习气啊。我怎么会受他的影响，我的心就开始跟着动，我的感受就开始变得痛苦呢？所以你看，都是连锁的反应。所以我们要懂得心是无常的，我们要懂得万事万物都是因缘和合，都是无常的。那这个时候我们的心是不动的，不会随着事情的起伏而起伏。当我们不再随着事情而起伏的时候，我们就是淡然的。当我们是淡然的以后，这个时候我们才能体会到空中妙有。什么叫空中妙有啊？孩子上大学了，我该不该高兴？我里面的那颗心、那颗意识是不动的，因为我知道孩子考上大学了。只是因缘具足了，但是我表现的是很高兴的。这个人在爱我的时候，我内心是不动的。我知道当爱情来临的时候，说明当下因缘是具足的，我表现出来的是高兴的，可是当他离开我的时候，我也没有什么不高兴的，因缘具足了而已啊所以你会发现这个时候才是妙的。孩子没有考上大学，我也不悲伤，我知道可能还是平时我照顾孩子照顾的不够，可能还是我的孩子学习努力程度不够。那接下来我们再去调整就好啦。有什么可悲伤的呢？这个时候你会发现你了解了，这一切本来就是空的，你知道了自己的心是无常的，是随着事情而变化的，把它空掉你再呈现出来的就是妙。所以同样发生一件事情，比如说生意赔钱了，比如说遇到挫折了，比如说碰到他人的误解了，你看有智慧的人都是淡然处之啊，而没有智慧的人呢？不懂得观心无常的人就会随着事情而起伏，每天不停的痛苦、纠结、愤怒、苦不堪言。看看我们这颗心，让我们受苦啊而不自知。你去看看当你有了智慧，是不是看什么都是苦？那我们再来说，难道你观到了这些苦？是消极的吗？不是啊，是你看到了这些苦，把自己的心修得很豁达、很从容、很有智慧的时候，你永远内在透露出来的都是淡淡的喜悦。这个喜悦是由内散发出来的。所以我经常讲啊，你看看咱们一路跟着学习和修行过来的朋友，没有事情发生啊，你是很喜悦的。为什么喜悦呢？我也不清楚，这个就是修行过后内在所呈现出来的那个法喜。甚至在生活当中，经历过一些别人的误解、别人的不理解啊，甚至是别人说了一些不好听的话，那我们内在竟然还是淡淡的喜悦。所以我们要认识到苦它是呈现出来的那个相，也是那个本质。但是我们观到了这个苦，不断地去修行自己却可以让自己内在是充满着喜悦的。</p></div>"
  },
  {
    "title": "第二十七讲-四正勤",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p><b>观法无我，</b>什么叫法呀？除了自己的心以外都叫做法。这个心是什么心呢？妙明真心呢？我们没有迷住的那个自性，除了它以外都是法。比如说我们生起的念头，我们生起的思维，我们看到这个世界上的万事万物都是法，都是呈现出来的相，观法无我，无我再把“我”去掉，没有我了，我执没有了无我了。你会发现这个时候你就是不迷的觉者，你再去观你生活的处境，再去观娑婆世界的万事万物，你是具有妙明真心的，你是自性圆满的，淡然地看着这一切的显现，看着这一切的显相，你会发现当下的我还在沉迷其中，我还在随着事情的发生而贪着而贪婪。产生感受，执着，分别而我的心还在跟着动，跟着事情的起伏。你要知道观法无我，这个不是本来的我，本来的我是自性圆满的，是那个佛性这一切都不是本来的我呀，这一切都是一个空字啊，什么都没有。这个时候你会发现你开始不执着了。那法是如何产生的呢？法也是因缘和合的产物，它也是时代变化的规律。无论时代如何变化，我们那颗心是妙明真心，我们那颗心是不迷的佛性，你会发现法。时代，它如何变化都不能影响我。所以我们去看电视也好，去读书也好，去看佛陀传也好，去看这些佛家的高僧大德也好，永远都是步履从容的穿梭于红尘之中，完全不为所动，因为那是觉者的行为，我怎么会被这个世界显化的相和那些因缘和合的法而困扰呢？所以你看，永远都是那么淡定和从容，不被人事物所束缚，没有贪着，没有自己的感受，自己的心亦不会随着外界的变化而变化。因为知道法里这本无“我”，我本然就是那个妙明真心，就是自性圆融的，就是人人皆可成佛的那个佛性。这个时候我们就不会沉迷于自己的意识当中，不停的去颠倒、执着、分别和妄想。我们为什么会颠倒、执着、分别和妄想呢？就是认假为真，认为感受是真的，认为我的第六意识心所产生的认知和分别是真的，不懂得观身不净，认为我们的身体是真实存在的，所以在其中颠倒啊，认为当下我住的这个房子就是我的，认为我的孩子就是我的。认为我的另一半他就是我的，认为一个人就应该永远爱我，认为老板就应该永远信任我，认为客户就应该永远跟随我，都是认假为真啊，别人的跟随是因缘和合呀，是一种法。孩子能留在我们身边多久是因缘和合是一种法，对方能爱我多久是因缘和合是一种法。而法中本无我，当我不执迷于其中的时候，我就不会颠倒妄想、执着，自然呢就没有了痛苦。当我们以这四种智慧的念头去观照我们当下的处境。你会发现就少了许许多多的烦恼和贪着呀。所以解脱的方法如此简单呢？<b>观身不净，观受是苦，观心无常，观法无我，</b>这是智慧的念头，这就是四念处。我们以这四种智慧的念头每天去观看看我们还在贪着什么？我们还在受着什么而感受？我们的心还会随着什么而变化？我们还执着于什么事情当中？我们还贪恋于什么事情当中？我们还在什么地方颠倒妄想和执着呀？所以当我们懂得了那个空，什么都没有，所以我们再回到空中无苦、集、灭、道，空中不光没有苦、没有集、没有灭，也没有道啊，空中无四念处啊，空中无观身不净、无观受是苦，无观心无常、无观法无我，本来我们那个自性里面是什么都没有的。那无我们为什么还要讲呢？因为我们还在其中颠倒执着啊，所以你才要有这四种智慧的念头去观、去修正。当你修到没有的时候，就是无苦集灭道，当然亦无轮回啊，<b>四正勤</b>\"勤\"就是努力勤奋，四正勤就是四条正确的勤奋修行的方法，或者换一个词叫做精进,<b>已生恶法令断</b>已经生起的恶法，我们要把它断掉啊。那我们看看恶法都有什么呀？“身”我们的身所产生的行为，不好的那些行为就是恶法呀。我们的口所讲出去的不善的话语、不善的语言、伤害他人的语言，这就是恶法呀。我们的意念头所生起的那些抱怨、愤恨，甚至有害他人的想法都是恶法呀，所以我们要让已经生起的这些恶法断掉。<b>未生恶法令不生</b>，没有生起来的恶法不让它再滋生。当我们时时刻刻保持觉知的时候，不会生恶念、不会出恶言、不会有恶行，这就是未生恶法令不生，不让他生起，不给他机会，不给它生存的土壤。有很多朋友啊，我们一起学习修行了半年的、三个月的、四个月的，你会发现一个很奇妙的事情，当我们不断的学习，不断的修行，这个时候你会发现你的恶念变得很少，你的恶言变得很少，你的恶行变得更少。你会发现再让你做有害他人的事情，你做不出来的，再让你说话去恶语伤人，你做不出来的。但有的时候我们可能还控制不了自己的念头，有的时候一个念头起可能还是抱怨的，还是愤恨的，因为念头本就最微小、最不容易察觉，以最难修正。所以我们要懂得时时刻刻观照自己的念头，有没有抱怨他人的念头、嫉妒他人的念头、贪婪的念头及时制止，不让这些恶法生起。<b>未生善法令生，</b>还没有生起来的善法，我们一定要让他生起。我们如何去帮助他人，这是善法呀。我们如何去做财布施、法布施，无畏布施，这都是善法呀。我们如何去觉醒他人，这都是善法呀。我们不断地去学习，见贤思齐就有道而正焉，多闻佛法，这都是不断地在生起我们的善法。我们在没有开始学习和修行之前，认为自己已经很善良了，可是我们不断地去学习佛家文化，不断地去学习圣贤的文化，会发现我们做的远远不够啊。我们看到佛法里所讲的啊，原来我这些都是痛苦的，原来我这是贪嗔痴啊，我这都是恶念呢，我还有恶口，还有两舌、还有绮语，只是我不懂啊。可是我们不断地去学习，我们就懂了，这就是在不断地去生起我们的善法啊。<b>已生善法令增长，</b>当我们通过不断的学习、不断的修行，已经生起了很多的善法了，已经生起的善法我们更要勤加精进，让它不断地去增长。我们已经有了一些慈悲心了，我们还需要不断的勤加精进，让我们的慈悲心更盛。我们已经有了菩提心啦，我们可以让我们的菩提心变得更盛，我已经不停地在帮助他人了，我再让帮助他人的范围更广、深度更深。四正勤，我们用四个字来总结，就是止恶扬善。已生恶法令断，未生恶法令不生。这就是止恶呀，把恶的那些全部止住，停止不再造业。未生善法令生，已生善法令增长，这就是扬善呢。所以止住我们那些恶的、不好的身口意的行为，扬起我们那些善良的、好的身口意的那些行为。所以修行的过程，亦是不断的止恶扬善的过程，会随着我们的精进，我们对善恶的标准也不同。比如说我们刚开始修行的时候，认为不伤害他人就是善，我们再往上修大乘佛法的时候，会发现帮助他人才是善，不帮助他人你有一个不好的念头生起，都已经是在作恶了。所以善恶本无标准，会随着每个人当下的境界不同，对善恶的标准也不同。所以止恶扬善这四个字又是最初级的人该修的，同时也是终其我们一生要去修正的方向。我们不停的止当下的恶，不停的扬更多的善，这就是我们不断的勤加修行的过程，被称为四正勤，四个正确的勤加精进的方法。所以我们每天不停地来观照自己还有没有恶念？还有没有恶语？还有没有恶行？我们在不停地去观照自己有没有生善法呀？有没有生善念？有没有生善心去帮助更多的人？所以勤加精进，我们就会解脱越来越近。</p></div>"
  },
  {
    "title": "第二十八讲-四如意足",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>《三十七道品》讲了三十七种方法，我们现在讲了四念处，讲了四正勤。那如果说我们只修其中的任意一种方法，可以得解脱吗？可以呀，我们就修任何一个方法，你把它修到极致都可以得解脱的，都可以证果位的，我们如果观身不净观到极致，直接就观到空了，什么都没有，你要观法无我，都可以观到空啊，都可以证悟到空性。你去观心无常，你观受是苦，都可以证到空性的。我们之前讲心经，讲过楞严经二十五圆通法门，二十五种方法都可以证得果位的，一样三十七道品、三十七种方法，任何一个法修到极致，都可以超越生死轮回的。那我们说我不停的扬善，不停的去帮助他人做到极致，超越轮回。我们不停地止恶，自己一丝的恶念都不起，修到极致。也可得解脱呀。我们讲果位的时候讲过罗汉的果位啊，罗汉是声闻，你看看罗汉声闻做了什么？没有啊，什么都没做呀，也没有做善行啊。可是呢？听佛法，证到了缘起，证到了诸法因缘生，诸法因缘灭，悟到了佛陀所讲的苦、集、灭、道、四圣谛，证得了罗汉果位啊，不再轮回了。所以三十七种方法，任意一种方法修到极致都可得解脱，所以说佛法很难。佛法也很简单，难在人们不信的，有不信焉，信不足焉。有的人是不信的，有的人虽信，但是信心不足啊，不是完全相信的。挑着信。佛说从不打妄语，告诉我们人人皆是佛呀，只不过被迷住了。这里讲苦集灭道，又告诉我们，实则成佛真的很简单，这三十七种方法皆可离苦得乐。除了这三十七种方法以外，还有千千万万种方法都可得解脱呀。所以我们去看我们当下。适合什么样的方法，我们就用什么样的方法去修正自己，同时这些方法又互有关联，我可不可以同时修啊？可以呀。我不停地去止恶扬善，同时我又观身不净，不再贪着，观受是苦，不再追求那么多的感受，观心无常，不再随着我的意识心不停地随着事情而动荡。观法无我，我不再执着于我，也不再执着于任何事情、任何法。我可以步履从容地走在红尘之中，我可以悠然自得地飘然物外，我可以淡定从容地去觉醒他人。所以三十七道品给我们总结了三十七种方法，我们按照这三十七种方法不停的去修正自己，就是走在解脱的路上。<b>四如意足</b>又称四神足，我们先讲如意，什么叫如意呀？是不是达到我的目的叫如意呀？四神足。我们从字面先理解一下，神足，有了神足是不是你想去哪里就能去哪里呀？这叫神足。所以你看四如意足啊，就是可以如意的达到我们的目的，仿佛有了神足，有了神的力量一样，想去哪里就去哪里。四神足。第一个。“欲”如意足，这里的“欲”，注意啊，不是欲望的“欲”啊，是你想要。我们再换一个词，愿力的愿。这个“欲”呢我们理解成愿望。你想要去哪里呀？欲如意足浴。我们现在在讲苦集灭道啊，那我们想要去哪里呀？想要解脱呀，想要离苦得乐呀，我们想要修行啊，我们要有出离心，我们不想在这里受苦了，我们不想看到众生受苦了，这个时候我们的愿力就生起来了。只有我们生起了这种愿力，我们才能精进的去修行。我们再来讲讲这个“欲”。不光是修行，在生活和工作当中也离不开。说我有愿望想要去做好这个工作，这个时候你会发现你会生出很多的方法，你会不停的精进和勤奋努力。我们有强烈的想要的那个愿望，就会让我们变得很勤奋，就会让我们去学习很多的方法。所以我们再回到修行更是如此。只有有了这个愿，有了这种欲如意足，我们才能让自己不停的精进，不停的前行。有了欲如意足，它就可以带我们走上解脱的路。所以当我们有这个愿的时候。愿意去修行、愿意去解脱、愿意去证得果位，就有了一个神足。我们有了欲如意足，有了那个愿，我们愿意去修行，我们愿意去求解脱，甚至我们有了愿力去解脱他人，去觉悟他人。那这个时候呢就到了<b>念如意足</b>，念住在这个愿上，念念住在修行上，当我们念念住在修行上，这个时候我们就有了觉知的能力，遇到的所有的事情我们都会保持觉知，都会保持觉悟。这个时候我们会观到生活的方方面面发生了一件小事情，我观到了苦，发生了一个事情，我观到了无常；发生了一件事情，我观到了感受；发生了一件事情，我观到了贪念；发生了一件事情，我观到了执着，因为我们念念住在了修行上，你会发现所有的事情都可以让我们来修行。有的人说我很忙，怎么修行啊？我每天工作没有时间，我要如何修行呢？当懂得念念住在修行上的时候，越是忙碌，越是修行时，因为我们的事情多，我们的体悟就会更多。因为我们每天很忙碌，去做大量的事情，我们在从中才有更多的觉知、更多的体悟、更多的观照。只不过是我们不懂得用不懂得念头住在修行上，念头住在精进上，念头住在觉知上，念头住在体悟上。这个时候你会发现你观察到的万事万物都可以让我们增长智慧。如果我们不懂得念头住在修行上，你看看很多人的念头它是纷飞的，今天念头随着一个事情跑了，一会儿念头随着一个事情跑了，一会儿念头随着一个感受跑了，一会儿念头随这一个无常跑了，一会儿念头随着一个事件又跑了，一会儿念头随着一个情绪又跑了。所以念头是纷飞的，就会带来更多的烦恼和困惑。所以我们要懂得让念头住在体悟上，让念头住在观照上，既要观照自己，又要观照外界的万事万物。所以当我们有了念如意足，又多了一个神足，这个时候有两个神足带领我们到达解脱的彼岸，<b>进如意足</b>精进我们不光念头要住在修行上，我们还要精进的去学习善法，我们精进的去学习善法，懂得了更多的法，我们的念头才会住在更多的善法上。我们学习了更多的善法，在不断的自觉。我们学习了更多的善法，我们还要去觉它，去帮助他人觉醒。当我们有了精进，又多了一个神足啊这个时候有三个神足带领我们去解脱的彼岸。<b>慧如意足</b>，我们的智慧是一个神足，会带领我们到达解脱的彼岸。那我们看看智慧从哪里来呀？四如意足，从第一个欲如意足，我们有愿，我们想要修行，想要解脱，想要到达彼岸，有了想要的这个愿，我们念念都住在修行上，念念都住在觉醒上，就有了精进。我们在不停地学习善法，不停的自觉，不停的觉他，这个时候就生起了智慧。所以智慧呢它是一种果，是由于我们有愿，我们念念都在觉醒，我们不停地去精进，不停地去学习善法，这个时候就得到了智慧。当有了智慧，就又多了一个神足带领我们达到彼岸。信为能入，智为能度。信是要让我们入进来的。所以佛法讲啊，佛度有缘人，可是佛的发愿明明是普度众生的，但是也只能度有缘人呢。因为信为能入，你只有信你才能入得进来，佛才能度我们呢。佛陀是名为“度”，都在给我们不断地去讲佛法告诉我们要自度的，所以我们不信是入不了门的。智为能度啊，入了门以后，我们要增长智慧的，我们终究要自度的，那我们自己没有智慧又如何自度呢？所以这个时候我们生起愿，想要去修行，想要去到达彼岸，念念都住在修行上，念念都住在到达彼岸的智慧上，不断地去精进，去自觉去觉他，自然智慧就生起了。这个时候就有四个神足带我们达到解脱的彼岸。所以我们再回过头来观，看看四个神足，我们哪里做得不够啊？我有没有那么深的愿？我的念头是不是一直都能住在觉知上？我有没有那么精进？我有没有不断地去生出智慧呀？所以哪里不够我们就去修哪里，哪里不够，我们去补足哪里。这就是我们不断修行的路，这就是我们渡海之舟筏呀。“是日已过，命亦随减，如少水鱼，斯有何乐”。每过一天，我们的命就减少一天。如缺少了水的鱼呀，何乐之有呢？”当勤精进，如救头然，但念无常，慎勿放逸“。无常随时随刻都会到来的，千万不要放纵自己。”欲念进慧“看看我们的愿力够不够？要生起我们的愿，念念住在觉醒上，不停地去精进，增长我们的智慧，无慧不解脱呀，时间每天都在流失，而我们还在不停的贪着、颠倒，还在妄想，看看我们修行的愿够不够？是不是念念都在解脱上，是不是能保持不断的去精进？这三点我们都做到了，自然就增长了智慧，有了智慧才能得解脱呀。所以慎勿放逸，不要贪图享乐而误了自己的慧命，不要每天被自己的感受所困扰，不要随着万事万物的发展而痛苦，而贪着、而颠倒。</p></div>"
  },
  {
    "title": "第二十九讲-五根五力",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>五根：“信根、进根、念根、定根、慧根”。五力：“信力、进力、念力、定力、慧力”。五根五力互相关联。所以我们一起讲什么叫根呢？能生长万物的叫根。比如说我们说树根，我们说草根，所以这个根是那个根本的东西啊，它可以生长万物的，它可以增长的那个叫根。我们经常听到一句话，天雨虽大不润无根之草，佛法无边不度无缘之人。因为它没有那个根度不了，它自己不会生长。信根是五根的总根，信为能入，如果不信，什么都入不了。比如说我们信佛法才能入进来啊，才能去学习和践行佛法。我们信儒家文化，我们才能去学习仁、义、礼、智、信，去当仁不让，去践行仁、义、礼、智、信。包括我们去讲生活当中的案例也是一样的。我们想创业，我们首先得信，信为能入，如果不信，怎么能把它做好呢？你看做一个工作也是如此啊，你得先信呢，你不相信这个事情可以做成，你不相信自己可以很好地把它完成，你怎么可能做好呢？那我们再举个反面的例子，被骗也是一样的，有的人说我被骗了，为什么会被骗呢？你信了才被骗的，你要不信怎么会被骗呢？所以我们要明白，无论是正向的还是反向的，无论是好的还是坏的，都是由于你信了才入的。所以这个时候我们信什么就会入什么，入什么就会行什么，行什么就会得什么，所以它都是有次第的呀。所以总根就是信，信才能入，不信则不入。我们相信佛法，相信因果、相信轮回，相信佛所说之法，皆是真实语。这个时候我们相信了因果才不做恶事啊，越是深信因果的人越不做坏事啊，恶有恶报的呀。越是相信轮回的人越不贪着呀。人生这一世只是分段生死啊，只是我轮回当中其中一段。那既然是其中一段，只有让自己觉醒才是最重要的事情，让自己解脱才是最重要的事情，其它的贪着又有什么意义呢？都是短暂的，信不足动力就不强。有不信焉，信不足焉。有的人不相信，而有的人相信，但是信的不足，所以就会导致动力不强。有很多人第一次听闻佛法，“讲得好啊，佛法真的是有智慧，我相信因果呀，我相信轮回，我相信业力”，这个时候动力就足。还有的人“我听闻了佛法我也不信，我不相信因果真的有轮回吗，我把这一生过好了就行了”。所以当有这样的想法的时候，就是信不足焉，信不足焉也就不会产生修行的动力呀。都是边走边疑虑的。还有的人是挑着信呢，有的人听闻一段佛法，说呀这段讲得好，跟我想的一样，我讲的对，有智慧我相信。再读到下一段儿，“这段儿我做不到，我不理解哎这讲的不对，也不可能全对，你信就信，不要全信”。所以你看这都是挑着信，当你挑着信的时候，不产生力量的，包括我们做工作不也是一样的吗？你要很坚信的时候，你会发现你是可以克服一切障碍和困难的。可是你要不坚信呢？顺风顺水的时候相信吗？遇到困难和挫折不行了，这东西我肯定是干不成的，这个东西肯定是不对呀，这个时候你会发现你就没有行动力了，就停在这个地方了。所以信根越强，我们的步履就会越坚定。信根越强，我们的力量就会越大。所以注意啊，力量越大，这个就是信力。我们的信根越深，所产生的信力就越强大，信力越强就不退转。如果信力不强，精神就会动摇。比如说别人说啊。你天天学习修行有什么用啊？你都学了两个月了，你有变好吗？你又学了两个月，你怎么没有赚更多的钱呢？你看，你天天沉迷于学习当中，你是不是入了魔呀？你走火入魔了。所以你看，这个时候我们的信根不强，所产生的信力就不足，很容易就生退转之心呐。信力是从信根上来的，那根是从哪里来的呀？那我们去想一想，植物的根是从哪里来的？从种子种了种子的。我们今天听闻了佛法，我们昨天听闻了儒家文化，我们前天听闻了道家文化，那这是不是种子啊？种子种下了。早晚会生根发芽的。所以我们的根从哪里培养啊？你不停地学习善法呀你不停地学习善法，终有一日他会生根发芽的。你看我们一路学习过来的朋友是不是就是这样的？我今天跟着学了，明天跟着学了，跟着学了一个月了，跟着学了两个月了，诶突然有一天我的信根就坚定的，所以我们不停地去种种子，终有一天会生根发芽。当我们信根还不足的时候，我们就不停地去种种子。当我们自己有了信根，有了信力，我们要去做什么呀要去给他人种种子啦，我们要不停的给别人普及善法，你要相信终有一天因缘和合之下，它也会生根，也会发芽，也会产生信力的。我们要以身作则呀，要以身表法，我们不停地去修正自己，不停地去影响他人。别人看到了这个人经过修行以后变得特别平和，变得特别睿智，变得特别有智慧，这个时候他受到了我们的影响，他也会生根发芽的。所以这就是在不停的去觉他了。你会发现在你不停的觉醒他人，给他人种种子的时候，是不是我们自己的信根也会更深，我们的信力也就会更强？朋友们，课程录制现场问答环节到了。昨天有人在超话当中分享了一篇文章，这样讲：“说他抽空就会看到一个感情主播的人，听直播，他说一开始听啊也总是很感动，他就帮忙这些人解决问题，也确实解决了一些问题，让很多人很感动。后面他说突然有一天发现了，越解决问题越多，说解决完解决去。他虽然说当时是给那个人一帮助，给了，可是问题就越解决越多，然后呢发现解决的都是别人的问题，比如说谁受欺负了啊，找他连接一下，后来发现越解决问题越多。他说后来听先生的这个直播啊，突然明白一个道理，什么问题也没有给我们解决，但是我们所有的问题却奇怪的消失了没有了。这就是法的力量。你说佛给你解决问题了没有啊？孔子给你解决问题了吗？它唤醒了你的良知，他告诉你该如何解脱，道家告诉你什么是道，什么是德，你醒了以后啊，每个人都是佛呀，怎么还用别人给你解决问题吗？难道你以为你能解决的了别人的问题吗？而且问题是解决不完的，你会发现越解决越多，所以我们要做的就是一件事情就是觉醒嘛，就是觉他是自觉觉他觉啊，那觉是干嘛的？是让人们觉醒的。当人们觉醒了以后啊，很多问题你自己就能解决了，他人帮助你能解决什么问题呢？解决不了的。那什么样的人才能去觉醒他人呢？你自己得醒过来，你自己不痴迷其中，你自己起码是醒着的状态，你没有那么多自己。当我们还沉浸在自己的那么多的感受当中，自己顺不顺眼，自己爽不爽？合不合我意，我看着舒不舒适，还停留在这些当中，怎么去觉醒他人呢？所以修佛修的是舍，舍掉你原来的脾气，舍掉你的性情、舍掉你的习气、舍掉你的贪婪、舍掉你的感受，你才能取得那个义，义理，取得佛理，取得儒家文化的那个理，取得道家的那个道。否则你什么都取不到，取的都是自己的贪婪、自己的脾气、自己的感受、自己想要的什么什么样的。佛陀也好，孔子也好，你看佛陀后期传法，前期讲法。他讲什么？你看讲苦集灭道，是不是告诉那些正在痛苦当中的人们要觉醒啊？这是讲给痛苦的人听的。后期他的讲法讲给谁听的？讲给传法之人听的呀。你看看佛陀后期讲法是不是都是这些尊者啊、菩萨呀？他讲给传法之人，传法之人再去传法呀，你否则靠佛陀一个人能度多少人呢？度不多少人呢？所以大家所有的心思应该在道场上，注意啊让你们把心在道场上，不是为了道场，也不是让你的心真的在道场上。是这个地方可以服务更多的人，这个地方我们去想让他觉醒更多的人。所以最后我们的心思还是落在他人上，不要本末倒置，所以每个人都要懂得思考问题的时候，多站在替他人想的角度。所以你看这些圣人都是无我的。那佛陀走的时候，阿难哭啊，佛陀说：你哭什么呀？我在不在有什么用呢？法留下就行了，我在是没有意义的，有法在就行了。很多人不明白法，然后说什么呢圣贤怎么都活的那么岁数小啊，有能耐他多活几年，他怎么还长病呢？他怎么就不能长病呢？他那个肉身哪有那么重要啊，他留下的精神才是最重要的，“不失其所者就，死而不亡者寿”。他的精神留下了，这个文明才会不停的去发扬和传承，才能度过更多的人出苦海啊。他那个人留下有什么用啊？能帮人做什么呢？只不过是一个取暖、一个皮囊、一个躯壳而已，实在是没有任何意义。所以把心都放大一点。不要天天停留在自己的那点感受上，不要停留在自己的那一点得失上，否则你会发现你看到的都是人家的问题，这个人没有素质，这个人修行不够，那这个人怎么是这个样子的呢？你会发现你看到的全是这些，因为无非是你拿你的标准在恒定他人吗？在恒定未来我们要想去觉醒的那些人，因为他们还沉迷于欲乐之中，还不明白你在不停地造业，只会让你迷得更深，堕落得更久。可是他们不知道啊，就是因为他有各方面的不足，就是因为他没有醒，我们才去做这样的事情啊。</p></div>"
  },
  {
    "title": "第三十讲-五根五力",
    "html": "<div class=\"B1_text\"><h2>“无苦集灭道”</h2><p>有了信根才有进根。进、精进我们不相信是不就不会精进，包括工作也一样啊，我们不坚信这份工作的时候，你会发现你做事情就不会精进，遇到困难就退缩了，遇到障碍就停滞不前了，遇到问题就抱怨、指责和推脱了。可是我们的信根深的时候就会不停地去精进。我们坚信佛法的时候，碰到这里我不懂，说明我自己的境界还不够，我还理解不了，我会更加精进的、努力的去学习。而信根不足的人就放弃了，学这个没有用，就停滞不前了。所以只有我们的信根够深，我们才会不停地去精进，精进的同时就会产生进力啊，所以根和力是相互的关系。不停地精进，是不是就会不停地产生进力？我们不停地在产生进力的时候，我们的进根也就越深。这就好比是工作当中我们遇到了困难，我们是坚信的，我们不停的精进去解决问题。越是解决一个问题回来之后，我们的信根也会越强，信根越强我们的进根就会持续不断地增加，所以它是循环的作用啊。所以说修行要发勇猛心的，勇猛向前，勇猛精进。当我们勇猛精进的时候，我们的进力就会强大。进力强大可以破除一切倦怠，破除一切懈怠，我们不会觉得疲倦，我们不会松懈。你看，这个是我们的勇猛之心就出来了。越是有勇猛之心的时候，我们的进根越强，进根越强，我们的进力越足。当我们有了进根，有了进力，下一步就来到了念根。这里的念呢我们把它分为两个念头。一个念头是自觉，一个念头是觉他。我们是勇猛精进的，我们的念头一直都住在自觉和觉他上，当我们的念头住在自觉和觉他上，我们的生命中就剩下两件事情，一件事情呢是不停的自觉，一件事情是不停的觉他。这个时候我们的一切杂念、邪念就会被排除掉，我们念念都住在自觉上，念念都住在觉他上。当我们一个邪念起了，一个杂念起来，我们就观照自己的念头是不是自觉的，是不是觉他的。这个时候我们不停的去修正自己的念头，我们的念力就会加强。当我们的念力加强的时候。就可以破除一切的邪念，邪念不生，生不起来。因为我们的念力足够的强大，一直住在自觉和觉察上，稍有偏差，就把自己的念头又重新的拉回到自觉和觉察上来。当我们的念力越足，接下来就产生了念根，当我们的念根越是深，念力越足就来到了定根，有定力了。有的时候我们经常说“哎呀我没有定力呀”，为什么会没有定力呀？你的念头总是纷飞呀，总是有杂念起，总是有邪念起，所以你就没有定力啊。当你的念头纷飞，总有杂念和邪念的时候，是不是你的口就会造业，就会讲恶语，你的行为就会造业，就会做不好的行为。因为念头是指导我们的思维和行为的，所以当我们的念头不在自觉和觉他上，这个时候如果生起了杂念，如果生起了邪念，我们就会产生邪行。或者说即使不是邪行，我们杂念起，是不是我们的行为就开始变得懈怠，开始变得懒散了？当我们一直住在自觉和觉他这样的念头上，我们的念力越足，这个时候我们的定力自然而然就生起了，没有杂的念头啊，没有不好的念头，连不好的念头都没有，更谈不上有不好的行为了，从念头这个地方就止住了，这个时候止无所止啊，用止住念头吗？不用啊，念头都没起呀。所以念力足到一定的程度定力自然生起，不需要刻意的定力是个果。所以试想一下我们的念头不停的纷飞，不停的散乱，碰到一个事情你就跟着起情绪了，遇到一个事情我们又看不顺眼了，我们没有住在自觉和觉他上，这个时候何谈定力呀？所以定力是果不用求的。当我们的信根、进根、念根、信力、进力，念力有了以后，自然而然的就有了定。有了定根，定根所产生的力量就叫定力。所以说一个人为什么说它有定力啊？那念头不散乱，行为没有偏差，不会轻易地起情绪，不会发脾气，不会有那些不好的邪念，什么都没有，因为念力十足。那我们再讲一层破相，当念力十足的时候，不需要住在自觉上，不需要住在觉他上，不动念就是平静的，但凡动念都是自觉和觉他的，所以不需要住念。一念不起时就是空的一念起时都是觉他的，念念都是正念。当有了定力，在一切环境之中都不会被烦恼和欲望所迷呀。有了定根，有了定力，接下来就是慧根，智慧自然生起。有了慧根就可以辩明真理、辨别是非、懂善恶、明因果。所以大家去回忆我们的生活当中也是一样的，当我们有了慧根的时候就会产生慧力。当我们有了这个智慧以后，你再去看生活，再去看工作当中的人们，他们的所思、所行、他们的痛苦，你看得清清楚楚。因为这个时候我们已经有了定力，已经不被烦恼和欲望所迷，自然而然就产生了智慧。当你有这个智慧，你再去看世间所发生的一切清清楚楚的，所以慧是果呀，定能生慧。我们讲到定根的时候，定是果呀，定和慧放在一起讲的时候，定是因慧又成了果了，所以佛家的法都是因果相续的，有了定力自然就产生了智慧。所以说智慧怎么还用修呢？我们每个人原本就是具足的，为什么没有了智慧啊？因为你没有了定力啊，我们每天都跟着虚妄心跑，跟着烦恼跑、跟着欲望跑，这个时候哪来的智慧呢？可是当我们有定力产生的时候，智慧是不用修的，我们本来就有，定力增加一分智慧自然也就增加一。当有了慧力就可以破除三界的困惑、迷惑，而终得解脱。从信力、进力，念力、定力、慧力。信为能入，信我们才能入得进来。有了信，才会有精进，有了精进才能念念住在自觉和觉他上就会生定力，有了定力就会生慧力，这个时候有了智慧了，智为能度，信为能入，智为能度。我们有了信才能入进来，入进来不是得度了，刚入进来而已，如何才能得度啊？到最后产生了智慧。所以智为能度，只有我们自己有了智慧才能得解脱。所以三十七道品都是最基础的方法。佛陀给我们讲了最基础的方法，这个时候是告诉我们如何到达彼岸，如何去修行的。我们要相信才能入得进来，相信只是入进来了不代表得度了，不代表得解脱了。如何才能得解脱呀？按照次第的去修行，我们生起了智慧，智为能度。所以说慧力是可以破除三界的迷惑而终得解脱的。五根越深，无力就会越足，所以它是循环的作用，我们不停地扎根。我们不停地再去产生力量，我们不光让自己扎根，不光让自己产生力量，我们还要念念去觉他。自觉和觉他，它又是一个循环，我们不停地去觉他反过来我们自己的五根也会越深，五力也会越足。朋友们，课程录制现场问答环节到了。然后啊注意啊学佛法很有意思，就是我们既要不停的入相，还要不停的破相。比如说举例，刚才我们讲到一定要念念注在自觉上，念念住在觉他上，这个是不是让大家入相，但是还要破相啊？什么意思呢？你为什么让你念念住在自觉和觉察上？因为你还有那么多杂念和散乱的念头和不好的念头。但是当你住到一定的程度，不好的念头、杂念变少。所以刚才我又讲什么？你不需要住念，就是你不用住在自觉和觉察的念头上，所以它是相对而言的。所以这就是佛法玄妙的地方，既让你入又得破，为什么让你入？因为你还有那么多杂念和不好的念头，为什么又让你破？因为你那些念头没有了，你都是自觉和觉察的念头，何须再住呢？不用住了，所以它是很玄妙的，你们刚开始还没有达到念念都在自觉，念念都在觉他上，那你们就要把念头要观照自己的念头住在上面。当你们有一定的境界的时候，不需要住念的甚至念头都不用起，因为你随便起一个念头都是觉他的都是自觉的，没有杂念，不会再有困惑、烦恼和痛苦。这就好比是我们讲论语的时候讲啊，你看孔子说什么？“七十随心所欲，不逾矩”。什么叫随心所欲啊？就是他随便起一个心起一个念，都是合天道的，不需要啊回归天性的状态就是这样的。所以一个觉者就是这样，他随便起一个念头都是自觉都是觉他的。这个时候何须住在什么念头上呢？这个时候就要上升境界了，金刚经所讲的境界：应无所住而生其心，什么都不住，你随便起一个念头就是正念，可是刚开始做不到的时候，你要住念，再往上破相的时候就无所住了，什么都不住，所以它是非常玄妙的。</p></div>"
  },
  {
    "title": "第三十一讲-七觉支",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>七觉支</strong></h2><div class=\"text-indent\">《三十七道品》三十七种通往解脱的方法，既是三十七种方法，又是次第而行的方法。有了四念处，我们有了智慧的念头去观照自己的处境，观身不净、观受是苦、观心无常、观法无我。当我们有了智慧的念头去观照我们的处境。做了四正勤去止恶扬善，不停地去精进；有了四神足，生出了五根五力，在五根五力的基础之上生出了七种觉悟，就是我们接下来要讲的七觉支。什么叫觉悟呢？我们经常生活当中会用到一个词，嗯这个人真有觉悟。比如说一个人在企业当中，你不需要去吩咐，他就会积极努力地去做事情。有的人天生就爱帮助别人，我们就会说这个人真有觉悟。一个孩子你不需要去要求他放学之后他就知道回家要努力的写作业呀，这时候就有人问这个孩子，你为什么要这么努力的写作业呀？没有为什么呀？我放学不就是应该写作业吗？你去问那些天生善良的人，你为什么要帮助他人呢？我帮助人不是很正常的吗？不是就应该导人向善的吗？你问那些积极努力工作的人，那我努力工作、积极的工作，这不是应该的吗？这个就是天生所带来的觉悟，不需要强迫，不需要逼迫，自然而然的知道按着正确的方法，向着善良的方向去做事情，去要求自己，这个就是一种觉悟。七觉支就是七种觉悟。第一个，择法觉支。我们要选择一个正法。比如说我们学佛的可以选佛法，学儒家文化呢可以选儒家的方法，学道家文化的可以选择道法。每个人要有智慧去选择一个适合自己的当下的学习和修行的法。所以首先我们要懂得择法，如果不懂得佛法，我们就没有正确的方向。很多人说我想学习，可是不知道学什么。我们每个当下的感受、念头都会不停地发生变化，所以说我们当下对什么法感兴趣，我们觉得什么法是适合我们的，我们就选择一个法继续的前行就好了。你会发现，当你择一法前行的时候，在其中自然会找到你的出路。举个例子，有的朋友，刚开始我可能学习佛法，学着学着佛法，我突然发现我对道家文化很感兴趣，或者说我对儒家文化很感兴趣，乃至于我对诸子百家的某一法感兴趣都没关系呀，那你就择法前行就好啦。当有一天我学着学着我突然哎呀我通过学习儒家文化，我突然又觉得其实佛法很好的，我又开始回归佛法继续学习。没关系啊，只要你择一正法往前走，你会发现你就会前行。如果我们不懂得佛法，是不会前行的。这段话呢我把它讲得宽泛了一点，如果按照佛法的讲法，那一定要择佛法前行的。但是既然我是按照儒释道的文化去修正自己的，我就把它讲得更宽泛一点。那如果您说我就是学佛法，我对其他的法不感兴趣，可以呀，那我们就择正法、择佛法去前行就好啦。那这是大的范畴，小的范围呢即使我们去选择佛法，佛法还有那么多法门呢？比如说我们现在讲到的有三十七道品，有六根六尘十二处，再加上六识还有十八界，还有禅宗，还有密宗、还有净土，还有唯识宗那么多的法门，那我们要选择一个适合我们当下的去前行。择法相当于给了我们一个方向，给了我们一个导航，给了我们一条路。那有了择法以后呢，第二，精进觉支。当我们择一法的时候，我们就不停地去精进。如果我们不懂得择法，你是没有方向的，你不知道该往哪里走。所以这个时候有了择法，就有了第二个觉支，精进觉支。我们按照我们自己所选择的方法，不停地去前行，不停地去学习，不停地去修正自己。我们之前讲过般若、分为三种，第一个呢文字般若，第二个观照般若，第三个实相般若。我们择法就是文字般若呀。精进，我们不光要精进的学习正法，还要观照呢？观照我们身边发生的事情，每发生一个事情我来体悟，用什么来体悟啊？用你择的法呀，说我学习了佛法，遇到一个事情的时候，我有了方向，我心中有佛法，我就懂得从这个事情上去观照，从我自己的念头上去观照，从身边的人去观照，这个时候呢就会生实相般若，就生实相的智慧。当我们在不停的精进的时候，它是循环作用的。我们不停地精进，是不是我们可以更好的择法呀？你看，首先我们先择法，我们不停地去精进，随着不停的精进，我们懂得去观照，生出来了实相的智慧，接下来我们就更加的知道。该去择什么样的法，因为每个法是会变的，我们所择的法是会变的。为什么呢？因为我们不停地在变呢，我们选择的都是适合自己当下的法。举个例子，说我现在择法，我用持咒，因为我的念头很多呀，念头纷飞，我不停地去持咒，这是一种择法。可是我随着自己不断的精进，我念头变少了，这个时候我要懂得把持咒放下，重新去选择其它的法的。因为我们选择持咒的时候，可能是为了让自己的念头清净，可能是为了让自己的杂念变少，不要胡思乱想。可是相当于这个彼岸我们已经过去了，所以这个时候。我们要懂得把这个法放下，重新去择一个适合我们精进过后的当下的那个法，所以它是循环的作用。当我们不停精进的时候，就会生出法喜呀。有的人说我听法也有法喜。对啊，我们听佛经可能开始产生喜悦。这个是法喜吗？是啊，可是它是短暂的，所以很多人都会讲啊，我听的时候都懂了，真正事情来临的时候，境界现前的时候，什么都不会了，又被打回原形了。所以听也是有法喜的，就是文字般若呀。那接下来更大的法喜从哪里来啊？从我们不停地精进，你从事物当中实证到的。那个喜悦才是长久的。所以就来到了第三个觉支，叫喜觉支。随着我们不停地学习文字般若，我们不停地去观照生出来的实相般若，这个时候我们就法喜了就是喜觉支，我们内在是喜悦的。这个是闻思修的过程。我们首先闻就是多闻呢，多听佛法，并且去思考、体悟，和自己的当下相结合，和生活当中的事情，和工作当中的事情相结合，就是思考和体悟的过程。接下来我们所思所体悟的，用来修正自己的身、口、意就是心。儒家文化，讲学，而。而时习之不亦乐乎一样的。我们不光要学呀，还要习呢。习就是不停地体悟、思考、温习、实践、应用，用佛法叫闻、思、修。我们不光要择法，不光要精进，还要体悟，还要观察，然后再不停的去择法，再不停地去精进。通过文字般若、观照般若生出来的实相般若，这个时候我们内在就法喜了，当法喜存在的时候，你会发现我们的烦恼就变少了，我们学习才是快乐的，否则我们越学习越痛苦啊我们越学习佛法，发现痛苦反而越多了，为什么呢？因为所学的我们都没有去行，没有做到啊所以我们。反而会成为一种负担。朋友们，课程录制现场问答环节到了，你想你天天观受是苦，最后你观到空性就觉悟了，就这么简单的东西。就不知道受是苦啊，天天围着感受跑，天天围着感受转，你就不知道观心无常啊，你就不知道观身不净，你就不知道观法无我。当你要懂得观的时候，你会发现其实就是这么简单。你会发现我们去学习佛法的时候，包括读楞严经后面讲的二十五圆通法门，香严童子。就是因为观香啊，就这么一个事情，观到了空性成就了，就这么简单。你说复杂吗？真的很简单，可是你说对于我们现在的人们就是这么难。为什么呀？贪着，欲望太多了，而且很多东西不是正道的，是听来的。听完之后呢我也知道是空的，没证到，你只是知道是空的，可是你还在执着呀，还在贪恋呢。你知道了感受是空的，你没有证到，所以你还会随着感受跑，你知道那一切是无常的，可是当无常来临的时候，发生一些变化的时候，你还是痛苦，你没有证到。其实有的时候再说，其实佛法真的很简单，也真的很难，就是一念之间，这一念难转。就像西游记所讲的，其实孙悟空的一个筋斗云就是十万八千里，为什么要经历九九八十一难？你看看很多人的念头，是不是要经历了九九八十一难才能转过来？你告诉他这一切都是幻象，不要执着。你告诉他，感情都是假的呀，他只是当下两个人的感受，不信呐，最后遍体鳞伤啦，信了。你告诉他，不要执着于这些财富啊，不要追求这些名利啊，它都是假的。如果你因为追求这些名利造了很多业，是要受苦的，是要受果报的，不信呐，直到身体出了问题了，哎呀我发现钱都没有用，只要我身体健康就行了，你就要经历九九八十一难才信的。但是有慧根的人一听就信了，讲过那个故事啊，佛陀在觉悟以后悟到了缘起诸法因缘生，诸法因缘灭。可是我要怎么给别人讲呢？别人也不信呢，他们也听不懂啊，所以他就讲了苦集灭道。那苦集灭道，憍陈如听完了以后，当下就证得罗汉果位了。后面五比丘阿示说，又讲给了舍利弗，舍利弗一听，诸法因缘生，诸法因缘灭。当时即证的罗汉果位啊。那舍利弗又讲给了目犍连，目犍连一听就证得了罗汉果位。他一听诸法因缘生，诸法因缘灭。哎呀厉害呀。是啊，所有的一切都是因缘和合，有什么可执着的，本来就是空性的，当下就证到了。其实你看佛法多简单，可是现在我们做起来就是那么难。因为欲望太多了，所以你去看看，为什么古人好修行，欲望少啊！所以是因为我们的欲望多了，所以你会发现我们越是修行的时候，欲望越少的时候，你会发现很多事情你就越淡然，虽然还没有挣到什么，还没觉悟，很多人可是呢痛苦也在变少，但是感受难断感受难断。所以你们去体会啊，给你们带来痛苦的都是感受都是你们因为事情的变化而产生的感受就痛苦，所以你看看是不是都是苦啊？但是话说回来了，当下一听就证果的，人家宿世修行的根器不同，所以这个东西也比不来。</div></div>"
  },
  {
    "title": "第三十二讲-舍觉支",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>舍觉支</strong></h2><div class=\"text-indent\">择法、精进、喜、三觉支，这三个觉支是生出来智慧的方法。智慧从哪里来啊？你要不停地去择法，你才有前进的方向，你才有文字般若。择法之后，我们要不停地去精进，不停地从事情上去体悟，从念头上去体悟，从观察身边的人去体悟。观照般若生出来的是实相般若。这个时候我们就有智慧啦，我们有智慧，可以看清楚身边的事情，可以看清楚自己的念头，可以看清楚自己的情绪，这个时候我们法喜是充满的。所以说这三个觉支是我们生出智慧的方法。当我们有了智慧、有了法喜，就来到了第四个觉支。第四个觉支叫轻安觉支，身轻心安的状态。所以我们体会一下，当我们有了智慧，有了法喜，你整个人就是轻安的状态。意识里什么都没有啊，没有那么多的烦恼，没有了压力，没有了焦虑，没有了烦躁，没有了不安，这个时候你会发现我们整个人就是轻安的状态。每天很闲。人是很轻松，心很淡然、很平静、很平和，这就是一种轻安的状态。可是我们绝大多数没有修行的人，您思考一下，是不是都是昏沉的，每天焦虑的、都是烦恼的，都是各种不安、各种担忧、各种焦虑呀？轻安觉支是智慧之后的果实，我们有了智慧，有了法喜，就是轻安的状态。轻安是怎么来的呢？没有烦恼自然就是轻安的。所以我们去思考一下，我们生活当中的那些身轻心安的时刻，我现在很悠闲、很闲事，没有什么烦恼，没有什么事情放在我的心里，这个时候你就是轻安的状态。轻安是没有烦恼之后的身轻心安。那如何才能没有烦恼呢？去除贪、嗔、痴、慢、疑，这五毒就没有烦恼了。我们不去贪着，不去嗔恨、不去痴迷、不去傲慢、不去疑虑，你看这个时候你就是很坦然的状态，就是轻安的状态。所以说轻安是慧之后的果，智慧之后的果实啊。没有智慧的时候，我们不停地活在贪、嗔、痴、慢、疑这五毒之中，烦恼不断又如何轻安？当我们有了轻安之后，更深一层的境界就来到了第五个觉支，叫定觉支有了定力了，什么叫定力呀？一心不乱就是定啊，也就是我们平时所讲的安住当下，身轻心安之后，更深一层的境界，不光是身轻心安，我们一心是不乱的，遇到什么事情我们也不烦恼，我们的心也不散乱，我们也不焦虑，也不迷茫，这个时候定力就产生了，就可以随时的都可以安住当下。举生活中的例子啊，我们好了解，比如说读书有定力是什么状态呢？读书我就坐在这里读书。没有什么事情和念头是可以干扰我的，但是我们没有定力的时候不是这样的。我这边读书的时候啊，开始杂念纷飞了，我有个快递是不是要到了？哎呀孩子，是不是快放学了？我突然想起来昨天有个微信还没回，晚上我要做什么饭呢啊一会儿我还得看看抖音，读着读着书发现我也看不懂了，要不然不读了吧，你会发现坐这里一个小时还没等读书呢，念头到处飞呀。所以这就是没有定力的表现呢。那比如说吃饭坐着吃饭的时候，脑子里还在胡思乱想啊，我下午的工作要怎么办呢？我上午谈那个客户好像没有谈好，今天中午吃的不可口味，晚上我一定要去吃什么？呃什么什么什么什么什么，你会发现念头又开始纷飞了。工作的时候也是一样的呀，我正在工作的时候开始想什么时候下班啊，后天那个会我要怎么开呀？你会发现满脑子都是杂念，这是我们自己内在的念头对我们形成的干扰。外在的事情也是一样的，我们正在这里读书，旁边有人说话，读不下去了，接个电话，接完电话以后开始陷入思考，又读不进去了。你会发现我们每天的时光都是这样消耗掉的。为什么会消耗掉呢？因为我们的心是散乱的，不能安住在每个当下，吃饭的时候不能好好吃饭，工作的时候不能好好工作。想读书的时候不能好好读书，睡觉的时候不能好好睡觉。一到睡觉呢开始胡思乱想、杂念纷飞，所以我们不懂得安住当下，每天都是痛苦的，每天都是烦恼的。再给大家举个例子，前段时间我有一个朋友，他是做企业的，他说他每天特别辛苦，很敬业。我说怎么说？他说我每天睡觉的时候也睡不好，满脑子都在想着如何做业绩，如何把团队带好，如何把客户服务好。他说：我吃饭的时候也在想这些事情啊，特别辛苦、特别累。当时我就笑了笑，我说：你这个或许不叫敬业。他说：嗯？这很敬业呀。我说呀这个或许不叫敬业，这个叫散乱，因为你的心时时刻刻都是散乱的。我说你自己去思考，你说你在吃饭的时候都在想着工作，你在睡觉的时候都在想着工作。同样啊，你在工作的时候也在想着吃饭呢，你在工作的时候也在想着睡觉啊你在公司开会的时候，你在想着如何搞定下一个客户，你在和客户谈判的时候，你就在想着如何开好下一个会议。我说你整个都是散乱的状态，你不能安住在每一个当下呀，你没有轻松自在的感觉呀，你可以想象你的公司是什么样子的，你是这样的思维方式大家都是这样的思维方式啊，我说你要懂得让自己安住当下。我吃饭的时候就好好吃饭，谈客户的时候就好好谈客户。我说绝大多数人的思维都是慌乱的，我在谈着这个客户的时候，我就在想下一个客户要怎么谈，到了下一个客户的时候，你又在想哎呀上一个客户没谈好，如果当时这么谈就好了，你会发现你整个一天的念头都是散乱的，没有定力呀。你会发现我们没有定力的时候，每天脑子就是昏沉的，意识就是混沌的，每天忙来忙去也不知道自己在忙什么，片刻都不得安宁，就是没有定的表现。第六个觉支叫舍觉支，舍，我们要舍一切虚妄之行，不执着于任何一境一事要向内舍掉自己的情绪，舍掉自己的贪婪，舍掉六根、六尘，舍掉六识，所有的东西都舍掉，还要舍掉我们所学习过的一切方法，这个叫舍。为什么要舍呢？我们如果不懂得舍掉过去的那些东西，就不会进来新的东西。所以我们在重新回顾现在讲过的这六个觉支。首先我们要择法，择法是为了精进，给我们的精进指明方向。有了精进之后，我们要不停地去体悟，才能生法喜，喜觉支。有了喜觉支，我们又有了智慧。有了智慧，我们可以轻安觉支，有了轻安，功夫再深一层，我们有了定。有了定，到这里要节制一下啦，有了定干嘛呢？舍呀，把之前所学过的方法全部舍掉，我们有这个定力，有这个智慧，可以啦，轻安觉支、定觉支、舍觉支，这是生出定力的方法。我们到了定觉支这里，我们接下来再开始修舍觉支，我们要有舍的觉悟。这个时候我们注意啊，这个时候我们已经升起了慧，升起了定，有了定和慧，就要把之前所有的方法全部舍掉，不要啦，这个就是渡海之舟法，都是方便法。但是我们很多朋友在学习佛法的时候很容易走个误区，抱着船不放啊，我们已经过了河，还在抱着船。比如说我们持咒，我们的念头已经开始不散乱了，你干嘛还要再持咒呢？我们读经，这个经完全不理解他在讲什么，也没有去精进，也不能生起法喜，也不能去修正自己的行为，让自己变得轻安，变得有定力。那我们学它的意义又在哪里呢？这都是抱着船不放啊。举个生活当中的例子，这样好理解。比如说会开车的朋友都有这个体会吧，我们在考驾照的时候，教练教给我们的开车的方法都是按照步骤的。但你会发现，当你真正上路开车的时候，你能按照教练教的方法去开吗？开不了吧？停车都得五档、四档、三档靠路边停车，那我们平时开车是这么停的吗？不是吧？这个时候你会发现，一个真正会开车的人是把教练教的方法全部忘记了、舍掉了，这个时候你才会开。再举个例子，我们现在孩子学走路都有那个代步车，就孩子站在里面，然后扶着那个车去学习走路。那个就是渡海之舟发呀，可是这个孩子已经学会走路了，难道你还让他用代步车吗？不用了吧？你要把那个方法舍掉。就是我们很多人在学习佛法的时候不懂得舍。我学一个方法抱住不放，我从上一年级开始学的内容，我现在已经二年级、三年级、四年级了，我还抱着那个东西不放，你会发现这个时候你不能把过去的东西舍掉，你无法更进一步的。当我们舍掉了过去的那个法，我们再开始折法、精进法喜，又上升一层智慧，这个时候我们又开始有轻安定力。接下来我们再舍，再上一层，就这样循环往复的不停地去学习，不停地去精进，不停地去舍。所以这里面很玄妙，我们又要不停地精进，又要不停地舍。如果你不懂得舍，只有不停的精进的时候，你会发现前行不了了。因为你始终抱着一个法，你已经在不停地发生变化，那个法对你来讲已经不管用了。就好比说我们上学你已经上了五年级了，你不可能回头再去学四年级的知识，你也不可能在五年级一直学着五年级的知识不改变不行的，你上初中了一定要有新的法新的课文儿，新的老师来教我们。所以同样的道理，我们要懂得去舍掉过去所学的那些方法。</div></div>"
  },
  {
    "title": "第三十三讲-舍觉支",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>舍觉支</strong></h2><div class=\"text-indent\">所有的一切法皆是方便法，都是渡海之舟筏。金刚经讲：若人言如来有所说法即为谤佛，不解我所说故，须菩提说法者，无法可说，是名说法。如果有人说如来有所说法就是谤佛呀，不解我所说故，不理解我在说什么，须菩提说法者无法可说。是名说法说所谓的说法者，其实无法可说，是名说法而已。为什么呢？我所说的法都是方便法呀。所以我们在讲回心经的主题在讲什么空中无色受想行识，无眼耳鼻舌身意，无色声香味触法，没有啊，空中无苦集灭道，空中无三十七道品，空中无四念处，四正勤、四如意足，空中无五根五力，空中亦无七觉支，都没有啊。可是都没有，我们为什么要讲啊？因为我们已经有了，我们已经迷在其中了，所以才告诉我们。七种觉悟的方法。可是注意啊，这个时候你通过择法精进，有了法喜这三种觉支生出来了智慧有了轻安，有了定力，这个时候你还要把它舍掉的不要了，都舍得。这个时候既有了智慧，又有了定力，所有的法都不要了，空中没有这些东西，没有七觉支，没有苦集灭道都没有。这个时候你会发现你留下了智慧，留下了定力，我们继续前行就好啦。所以舍掉一切内和外，内在的所有的方法，还要心舍，把我们意识心之类的，分别舍掉、情绪舍掉、六层舍掉。这个时候我们。境界就上来了。七、念觉支，念觉支啊！有的人呢把它放在第一个觉支来讲说第一个是念觉支，有的人呢把它放在第七个来讲。这里我是把念觉支放到最后来讲的。念觉支是用来做什么的呢？时时刻刻关照自己的念头，令、定、慧、均、等。念觉支是用来均衡的，均衡定和慧、轻安觉支、定觉支、舍觉支，这是增长定的方法。择法觉支，精进觉支、喜觉支，这是增长智慧的。而念觉支是来平衡的令定慧均等，也就是令六个觉支均等。一边要择法精进，喜觉支，不停的精进，不停地前行，一边要保持轻安，保持定力、保持舍。这个时候我们去体会一下，就可以在很轻松、很闲适、很安然的状态下精进。所以念头要时刻保持均衡的，如果有定无慧不进取，有慧无定则容易散乱。比如说我们有智慧，但是我们没有定力呀，是不是很容易散乱？但是呢我们有了定力却没有智慧，是不是开始不精进呢？定了，定在这儿不学习了，不精进了，你会发现这个时候就会提不起精气神，没有精神。你说我现在心里什么事情都没有，你说也很安静，对什么事情也不感兴趣，掉入误区了。这个时候你会发现思想是消极的，我什么都不想做，不是这样的。真正的定慧均等是什么呢？就是我现在是很安定的状态，很平静的状态，可是我是有喜悦在的，我内在是积极的、是向上的，这个时候是定慧均等，所以缺一不可。这个念觉支很重要，它是用来时时刻刻保持念头的觉悟来均等。我们现在发现自己内在是消极的，没有喜悦啊。不再去学习和精进了，这个时候你要知道要调整了，这个是有问题的。这个时候我们要增长自己的智慧了。那这种状态下怎么办呢？择法呀。我们去选择一个适合自己当下的法，找一个自己感兴趣的。比如说有的人说了，开悟的楞严成佛的法华，《楞严经》好啊，《法华经》也好啊，可是我拿起来一读，我发现读不进去啊，那就要果断地放下，重新去择一个其他的法。我随便拿一本经说，我拿起来无量寿经，我拿起来《观世音菩萨普门品》，我拿起来《地藏经》，我拿起来《金刚经》、我拿起来《圆觉经》，我拿起来《阿弥陀经》，我拿起来《维摩诘经》都可以啊，我一读哎呀我对这个经感兴趣。这个时候你内在就会生起一种感受，我愿意去学习的。这个时候我就开始精进，又会生出来法喜，就会把我们现在这种昏沉的状态、不进取的状态把它调整过来。那比如说当我们的心是很浮躁的状态，我们去体会这样一种感受。我现在很喜悦，我特别开心。可是坏了哦，我虽然很喜悦，我心定不下来啊，我坐在这里像万马奔腾一样，我定不住啊。我很喜悦，做事情我就散乱呢。你让我做事情，然后打坐、持咒，工作不行，定不下来，这个时候你会发现不好咯，有慧无定。那这个时候怎么办呢？我们就开始用到了轻安觉支、定觉支和舍觉支了，我们要保持轻安的状态，我们要保持定力。这个时候我们要收摄自己的心念，让自己安定下来。我把所有的事情都放下，都不要做，我哪怕出去走一走，出去透透气，或者闭目养神，让自己安定下来，让自己保持身轻心安的状态。经过一段时间的调整，说我们定下来了。好，这个时候我们才开始一边保持精进，一边保持轻安的状态。所以我们用一句简单的话来总结，闲是一种心态，忙是一种状态，我们一定要不停地去精进，这是一种状态上的忙碌。我们要择法呀，要不停地去学习，要不停地去体悟。这闲是一种心态，我们的心是有定力的，不散乱。所以念觉支是用来均衡定和慧的，定和慧就相当于我们自己的两条腿，只有我们两条腿健全的情况下，我们走路才会走得快。如果只有一条腿，你会发现你可以想象啊，我们一条腿蹦的蹦的蹦的蹦的是不走得很慢，可是两条腿走路又稳又快，可以快速的达到解脱的彼岸。朋友们，课程录制现场问答环节到了，主动思维能力就是慧，这就是定慧均等，我不停的要主动去思考，是不是择法？你看你做事情不要择法嘛，说我这个事情这样做方法不行，那你在换方法，是不是择法？一样的择法。接下来就是精进，就是不停的努力去做，当你做的过程，你体悟的过程有结果了，是不是法喜就出来了？这就是喜觉，知觉出来，这是增长智慧的方法。所以如何增长智慧啊？就是你不停的主动思维去寻找新的方法，并且不断地去实践和体悟，生出来那个喜悦，这个时候你会发现智慧不来啦。但同时是不是还要保持定力啊？这事我还得申请心安，否则你做得很焦虑。你看很多人不修行，做事情是不是很焦虑、很痛苦？所以我不停地去改变方法，把每天自己做得很忙碌，忙得心浮气躁，不行喽。没有轻安，没有定啊，没有舍，你舍不掉你过去的那些东西，你舍不掉你的法还不行呢。举例啊，你在不停地寻找新的方法去做事情，去主动思维。那你这个时候要不要懂得舍？这个方法不行你就舍掉，这个方法行了过一段时间又不管用，你还要懂得舍掉，所以你不舍还不能精进。所以七觉支就是七种觉悟，非常的关键。为什么我要把面具是放到最后来讲？因为念觉支是用来调动和均衡的，你看自己心浮气躁了，我得让自己轻安，我得让自己定，我得懂得去舍，这个时候我们才能稳下来。但同时你太稳了就沉闷了，太稳了你会发现很容易就落入消极的状态，什么都不想做，不是这样的。所以这个时候开始怎么办？要调动智慧，当我们什么都不想做的时候怎么办？泽法呀！去选择一个新的方式。选择一个新的东西。这个时候你会发现，择法之后再不停的精进，再不停的生法喜智慧又出来了。所以念觉支是让我们定慧均等，这是两条腿，缺一不可，所以很多人都是一条腿走路的。有的人不停的求智慧，有的人不停的修定力，这两个缺一都不行。你会发现只有定力的人他是不精进的，旨在修出来智慧的人他是散乱的。虽然这个人很有智慧，最后我们发现这个人是挺有智慧的，可是每天怎么急三火四的呢？没有定力，遇到事情的时候智慧荡然无存了，开始散乱。所以七觉支就是七种觉悟的方法，这七种觉悟的方法各有各的用处，前三个觉支是增长智慧的，后三个觉支是增长定力的，而念觉支。我们把它放到最后，是用来均衡我们的两条腿的。今后我们的左腿和右腿只有两条腿走路，我们走得更快并且更稳，不容易出问题。所以你会发现这七觉支不光修佛法能用，你去看一看，在生活当中都能用，在工作当中都能用。比如说你接下来工作，你就去想这七觉支，我们首先要用自己的念头，念头要觉支是哪里出了问题，定出了问题我就从后三个觉支开始修。如果我的慧出了问题，我就从前三个觉支开始修，然后不停地去调整，让我们自己走得很稳、很好用的七个方法。比如说你去看佛陀也好，你看这些佛家的高僧大德也好，为什么叫定慧双修呢？两个都得修，去体会啊。管有定力很容易就消极，很快就消极。你要光有智慧呢，整个人就是散乱的，不行的。六祖慧能那是开悟的人呢，人家也不停的在求智慧，不停地修方法啊那佛陀也是，为什么讲死生地，我跟他讲缘起什么听不懂啊所以这时候他是不要思考，他要择法，只不过他择的是如何给别人听得懂的法。那你说咱们每天不也是在择法吗？这么讲你听不懂，换一个，你这么不行，我再换一个是不是再择法？你想告诉人们点东西总能折到一个好的方法。那你说拍电影的人，人家不是在择法吗？人家只是以他的方式在讲给人们一个什么道理，这都是在择法。</div></div>"
  },
  {
    "title": "第三十四讲-八正道",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>八正道</strong></h2><div class=\"text-indent\">三十七道品最后八正道正见，正确的知见，正确的见解。这个正见是需要修行一段时间以后才会出现的正确的见解。先举例子，比如说在生活当中有的人天性他就是善良的，说我不能去做欺骗他人的事情，不能去做欺诈的事情。我学习的时候就应该是努力学习的、工作的时候就应该是努力工作，为他人创造价值的，这个就是与生俱来的正见。这个是世间法的正见。那佛法讲出世间法的正见，我们经过学习、经过修行一段时间会懂得因果轮回，会懂得无常，会知道人生皆苦，会知道苦集灭道，会知道善有善报、恶有恶报，知道了十善业，知道了十恶业，知道了我们原本的自性是圆满的，人人是具有佛性的，我们当下被迷住了而已，所以才不停地颠倒妄想和执着，这个都是正确的见解、正见。你可以说出来八万四千个正见，太多太多了，所以说这个正见它是一个概念，没有一个具体的到底什么叫做正见？简而言之就是正确的见解。每个人对于正见的理解也不同，因为你所处的境界、高度和你的所学皆不相同。我们学习的越多，你自己修正的越多，这个时候你的正见就会越多。所以说正见是在我们学习和修行一段时间以后，自然出现的正确的见解。这个时候我们跟着一起听心经，从第一讲听到现在的朋友们，你已经拥有了很多对于佛法、对于因果轮回，对于如何去追求解脱道的正见都有了。有了正见以后呢，我们就会有正确的思维方式。所以第二个讲的是正思维，正思维是建立在正见的基础之上，我们有了正确的知见，有了正确的见解，这个时候我们才有正确的思维方式。我们用在世间法上也是一样的，世间法告诉我们不能欺骗他人，告诉我们做事情一定要符合善道，这是我们的知见。当有了这样的知见，你的思维就会随着你的知见而产生变化。同样你要有邪见呢，我为了利益可以欺诈他人，你有了这样的见解，就会有不正的思维。所以我们有什么样的正见，就会有什么样的思维，这个时候你的思维方式都会随之而发生变化。当我们知道了是有因果轮回的，我们就不做恶业；当我们知道了生命是无常的，当变化到来的时候，我们就不会执着和痛苦。当我们知道我们烦恼的根源是因为贪嗔痴慢疑淫嫉见，我们有了这样的知见，有了这样的见解，这个时候遇到事情的时候，我们就会随着我们的之间而发生。正确的思维方式，我不能太贪着这个是毒啊。我做人不能太傲慢这个是毒啊。我做人不能痴迷不醒这个是毒啊。我不能有嗔恨之心这个是毒。这都是正确的思维方式，所以它会随着你有多少正见，我们的思维就有多正。同样反之，也是一样的道理。如果我们都是邪知邪见，都是抱怨的、嗔恨的、苛责的这样的见解，那我们也会相应地产生这样的思维方式。当我们有了正见，有了正思维接下来就要产生行为了。所以接下来产生的行为，第三个叫正语，讲话也是一种行为，我们有了正确的知见，有了正确的思维方式，这个时候我们才能讲出来正语。之前我们讲过十善业里面的口业，如果我们没有正确的知见，正确的思维就会有妄语、恶口、两舌、绮语，可是我们有了正确的知见，口是要造业的，是要伤害他人的，我们就有了这样的思维。我们做事情的时候不能伤害他人，我们讲话的时候不能对他人恶语相向，不能两舌、不能妄语、不能花言巧语、不能奇遇，这个时候你会发现它就变成了我们的行为准则。所以正语已经是一种行为了。当我们有了这样正确的见解、正确的思维，我们就会多讲赞美他人的话，多讲鼓励他人的话，多讲真善美的话多讲觉醒他人的话。具体你讲出来什么样的话，它跟你的境界和高度也不同。有的人说我没有那么高的正见，但是我起码知道不能讲他人的坏话，不能对他人恶语相向，那这就是我们的正思维产生了我们的行为有了正语。那有的人正见更高一点，我不光是要鼓励和赞美他人，我要教他人去行善道、去做善事，因为它是有因果轮回的。那我们有这样的正见，我们就会产生这样的正语，那我们再高一点的正见，我不光要自觉呀，我还要觉醒迷途之中的众生。那你有了这样的正见，就产生了这样的思维，有了这样的思维你就产生了这样的行为呢。你再讲出来的话，就是觉醒他人的，就是救人慧命的。所以这个正见是我们需要不停地去增长的，会随着我们不停的学习、不停的修行，我们的正见的境界也会越来越高。随着我们正见的境界的高低，思维会发生变化，接下来我们的行为语言就会发生变化。正语接下来第四正业，这个正业是指的行为是我们有了正确的行为，我们有什么样的正见，就会有什么样的思维，有了什么样的思维就会产生什么样的行为。第一个行为是正语，是我们所讲出来的话。第二个行为叫正业，就是我们正确的行为方式。所以我们的正语和正业都是建立在我们的正见和政思维的基础之上的。比如说我们有正见的朋友我们有正见的人去做觉醒他人，去做救人慧命的事情，这个时候你就产生行为了，你的行为就会去做决他的事情，去做救人慧命的事情。这个时候如果我们的正见是不能伤害他人的，多讲鼓励和赞美的话，这个时候我们口是这样讲的，我们的行为就会变成也多去鼓励他人、多去赞美他人，多去做温暖他人的行为。接下来正命就是正确的谋生手段。我们生活在这个娑婆世界，我们要谋生的，所以这个时候让我们要按照正确的、正当的、不损害他人的利益、不损害他人的生命、不损害众生的生命去为我们自己谋生。同样的道理，我们有什么样的见解，有什么样的思维，讲什么样的话，产生什么样的行为，我们就会有什么样的谋生手段，所以它整个都是次第而行的。一个有正见的人，一个自觉和觉他的人，你会发现最后选择的谋生手段也是觉他的，也是救人慧命的。那我们再往下讲，我们的正业和正命本身我们的行为和谋生手段就包含了佛家所讲的不杀生、不偷盗、不邪淫。那这个时候我们自己就来思考了，起码我们做的事情是不杀生的、是不偷盗的、是不欺诈的，不以这样的事情来谋生，这是最基本的正命。那我们再往上讲一层，有的人说我做的行业只要是不杀生的、不偷盗的、不损害他人利益的、不去欺骗他人的，这个就是正命了比如说我去卖服装，比如说我去卖化妆品等等这些行业在一定的范围和一定的境界上来讲，它是正命的。可是注意啊，正见、正思维、正语、正业、正命，八正道里所包含的内容皆如此。它会随着境界的提升，你会有不同的八正道的守则。所以我们再去看呢，修到最后的时候，你去看佛家的高僧大德都去做什么事情了都去做传法布道、救人慧命的事情。我们再去看儒家的圣贤，修到最后修得好的都去教化世人了，这个也是正命啊，这个要求就比较高了。是你在行菩萨道的人。我们心经开篇就讲啊，观自在菩萨，什么叫菩萨呀？觉有情，不光要自觉，还要去觉他的，所以这个叫正命，这个叫正见。讲到这里呢不是要求我们所有人都要去做这样的事情，也做不到，只是让大家明白八正道的概念，它是因人而异的，所以我选择一个适合我当下的正见，正思维、正语、正业和正命就好了，我去选择一个正当的谋生手段，我刚开始修行，我只要不去做杀生的事情，因为杀生会给自己带来很多的恶果，我不去做偷盗的事情就可以了。那随着我自己不停的在往上去修行，那我可能在做的事情就是要帮助他人的，说我做某一个生意或者我做一个工作是不是对他人有益的，是不是能帮助到他人的？那我们再往上一个境界，不光要帮助他人了，帮助他人还不够，我做的事情是不是能觉醒他人的？是不是能救人慧命的？所以不同的阶段有不同的正见，就会产生不同的正业和不同的正命。</div></div>"
  },
  {
    "title": "第三十五讲-八正道",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>八正道</strong></h2><div class=\"text-indent\">正见、正思维。有了正见，就会有正确的思维。有了正确的正见和正思维，接下来就会产生行为，行为就是正语、正业和正命，所以它们是有次第的关系的。有了正见和正确的思维，在产生了正确的行为，正语、正业、正命、正确的谋生手段。接下来第六个就要讲到正精进。精进什么呢？以上所有的皆要精进，不停地学习修正，不停地去精进，我们会增长我们的正见，不停的增长我们的正见，我们就会有更正确的思维，就会有更正确的行为。整个正精进是贯穿始终的，包括我们整个讲过来，三十七道品是不是处处都有正精进？我们讲的七觉支也有精进觉，我们再把这两个字拆分开来讲，精进就是闻思修的过程，多闻、多学习呀、思考和当下体悟相结合，去观照身边所发生的事情，我们自己要体悟，然后用体悟所得来的智慧来修正自己，这就是不停的精进的过程，也就是闻思修的过程。用儒家的话，家就是学习这两个字。论语开篇第一篇就是学而篇，学而时习之，不亦乐乎？不光要学，还要习呀，这个习就相当于佛家讲的修，不停地去应用实践，去修正自身、去修身。所以呢闻思修也就是我们不断的精进的过程。那我们回来再去看正见，就是多闻呢，正思维就是多思考。接下来我们就会产生正语、正业、正命，就是不断地以我们闻道的知识、学到的知识，以我们的思考和体悟来修正自己的行为。所以精进是贯穿始终的，我们要不停地去精进，不停的闻、思、修。所以佛家讲的法是非常的积极的法门，绝不是消极的法门。很多人说佛法是消极的，其实不是的。还有什么比修行的人更精进的吗？修行的人是不停的闻思修不停的闻思修，不停地去修正自己身上的问题，所以它是一种非常积极的状态，它是一种非常积极的思维方式。当我们不停地去精进的时候，接下来就会产生了正念正确的念头，时时刻刻保持正确的念头。这个正确的念头是如何来的呢？我们有了正见，有了正思维，有了正语，有了正业，有了正命，接下来我们开始正精进，不停地去精进，当我们的身、口、意都已然形成一个固定的标准的时候，是不是你的念头就产生了？说我不停地去做觉他的事情，你就有了觉察的念头啊你的念头念念都是觉他的。反之说我不懂的正见，不懂得正思维，不懂得正语、不懂得正业，不懂得正命，我都是邪知邪见，我做的都是欺诈他人的事情，久而久之你的思维和行为是这样的，是不是你的念头就都是这样的？遇到念头就想着我要怎么欺骗他人，遇到念头我就想着我怎么偷懒。遇到念头，我就想着怎么发脾气，起来一个念头就是如何抱怨，起来一个念头就是如何指责他人。它是由于你长时间的见解所形成的思维所带来的行为方式，就形成了一个固定的念头。所以我们不停地去精进的时候，这个时候我们的念头就会停留在我们长期的闻、思、修所得来的那个果上。所以我们念念要是觉他的念念要是行善的，这个时候我们的念头不散乱，就住在觉醒上，住在行善上。当我们了解了佛法，有了正见，就会知道众生皆苦。你看，这就是念头。当我们看到了生命的无常，我们就知道了人生八苦、生老病死、求不得、爱别离、怨憎会、五阴炽盛，这就是我们的念头。它是由于我们的长期的见解思维行为，再加上我们不断的精进巩固的过程所得来的这个果。这个时候我们有了正念，就会有正定。所以八正道最后一个讲的是正定，有了定力了。什么叫有定力呢？举个例子，生活当中发生了一件事情，别人很生气、很暴躁、很焦虑，可是有定力的人并不焦虑，也并不生气，为什么呢？有正确的念头啊。当别人做了一个我们看不顺眼的事情，我们就知道了是我们自己的感受在作怪，是我们自我的认知在作怪。我们的心取向了，这个时候你会发现你是有定力的，你就是不为所动的。当孩子出现了不听话的事情，你就知道了每个孩子的习性不同啊所以这个时候你会发现你是不起情绪的。当我们的生意遇到了挫折，你就知道了任何事情都会发生变化的，万事皆有因缘，当我们的生意出现了问题，其中必有原因，只是我们还没有发现。所以这个时候有什么可生气，有什么可愤怒的呢？当我们感情失利的时候，有人离开我们了，我们就懂得了啊，可能还是哪里做的不合适，因缘不合了而已呀，错过了这段时光罢了，有什么可执着的呢？况且一切终究归于空的。你会发现，这个时候你的念头就起作用了。所以定又是一个果，使我们不停地有正确的见解、正确的思维、正确的行为、正确的精进、正确的念头，这个时候我们的定力自然产生，这个果就出来了。所以我们去看，越是修行好的人，不轻易起情绪的，什么事情都那么淡然，因为你有正确的见解，你有正确的念头，所以你自然就是有定力的。当你有定力的时候，智慧自然从中升起，所以这个定是含智慧的。你为什么有定力呀？因为你有智慧啊，你知道一切本来就是空的，一切本来就是变化的，没有什么东西是你能掌控的，它都是因缘和合而已。这个时候你会发现智慧在其中，你就有定力。正定，我们把定再拆分，分为两个字，一个字叫止，一个字叫观。“止观双运”这两个字在佛法当中极其重要。什么叫止呢？止它从某种意义上是一种定，从某种意义上来讲是一种戒。举个例子，什么叫止？当发生了一个事情，我要起情绪了，这个时候我及时察觉了，止住，这个就是戒，我要止住自己的念头，有什么可发脾气的呢？发脾气我也解决不了这件事情，有可能只会让事情变得更糟糕，这个就是止。当我要起嗔恨之心的时候啊，我有正确的见解和正确的思维。不能嗔恨，我嗔恨呢会给自己造业，不光伤害自己，也伤害他人呢。及时的止住，这就是戒。当我们要产生一个不好的行为的时候，我们知道了我们不能去做这样的事情，因为我们有正确的见解，我们有正确的思维，我没有正确的行为方式，这个时候我是不能做不好的事情的，及时的止住了。所以这个时候的”止“它不是解决问题的根源，它只是暂时的降服了我们的烦恼，暂时的克制了我们自己的情绪。所以从这个角度它是戒，那我们再换一个角度，它又是定，只有我们有了一定的定力的时候，我们才懂得克制自己呀。所以我们去看看很多朋友没有修行过的朋友。遇到事情就开始烦躁、压力、紧张、开始发脾气，开始起情绪。有人惹到我们了情绪就起了，没有人惹到还自然自己生气啊、自己发怒、自己臆想，然后开始产生情绪。所以这个时候我们有了定力的时候，不会轻易起情绪。当别人出现了一个什么样的事情让我们产生了不高兴，这个时候我们有一定的定力才能止得住，否则是止不住的。所以这里的指又是戒，又是定。那我们再来讲“观”，什么叫观呢？观就是智慧在其中了，慧在其中，比如说止还需要我们降伏住烦恼。还需要我们克制自己的情绪，克制自己的念头，观是不需要的。当发生了一个事情，念头都不起呀，说孩子不听话，呵呵一笑，什么叫观呢？就是智慧就是观。我们智慧在其中啊，孩子不听话是正常的，是不是？其中有什么原因？是不是？孩子当下有什么情绪？是有哪里不高兴的，那我看到了，要去给他疏导。当别人说了一句不顺我们耳的话，它只是一种声音罢了，他只是还不了解很多事情，他只是当下的情绪起了，其实他这一刻是很苦恼的，他是很痛苦的，这个就是观所以它是一种智慧。当我们有了这种智慧，发生什么事情你是非常的了然的，你是非常的淡定的。这个就是慧，你会发现当你有这个慧的时候，你才真正的有定力、有正定。发生什么事情都是不动的，发生什么事情都是坦然的。所以止是当发生了一个事情，我要去控制降服住它。观是什么？是我压根儿不生气，压根儿没有起情绪，它是自然而然的一种状态。这个就是定，当我们有了正定，它就是一种禅定的状态。这种禅定的状态啊就是不散乱，说我无论行住坐卧都是不散乱的，无论发生什么事情。都是不散乱的，因为我们有智慧在其中，有定力在其中，它就不散乱。我们讲到八正道啊，离不开三个字，戒定慧，戒定慧被称为三无漏学，我们来讲戒，我们平时不停地去克制自己的行为、克制自己的情绪、克制自己的念头。包括佛家有很多的戒律，比如说不吃肉、不杀生、不饮酒、不邪淫等等，这都是戒律。戒就是为了生定的，我们为什么没有定力呀？被诱惑太多，欲望太多呀，太多的贪婪，财、色、名、食、睡都要贪，所以就没有定力。当我们不停地通过戒律就会产生定力，当有了定力就会生智慧。</div></div>"
  },
  {
    "title": "第三十六讲-以无所得故",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>八正道-戒定慧</strong></h2><div class=\"text-indent\">我们再来讲戒定慧和八正道之间的关系。正见和正思维是慧。我们有智慧才会有正确的见解、正确的思维方式，正语、正业、正命、正精进，这是戒，刚开始我们要控制自己的行为啊我们要克制自己的行为，我们要知道该讲什么样的话，不该讲什么样的话。正精进也是戒，我们一开始是有惰性的，我们是不爱学习的，是不愿意去面对自己的问题的，是不愿意去修正自己的。所以这个时候就要用到戒，去强制自己去修为自己，去强制自己去学习，去强制自己去讲好的话，不讲伤害他人的话，不恶口、不绮语、不两舌。正念和正定就是戒定慧里的定。当我们有了定力，时时刻刻都会保持一个正确的念头，我们时时刻刻都会有定力。那我们再来讲戒和定是分不开的。戒是起初的约束自己行为的方式，当达到了不戒而戒的时候就是定。所以这个时候呢。再来看正语、正业、正命、正精进，我们刚才讲过，这属于是戒，起初用到戒，当你达到不戒而戒的时候，它就变成了定力。比如说我们每天不停地去精进学习，去修正自己，刚开始用戒约束自己的行为，当你达到一定的程度的时候，不戒而戒，你不需要来约束自己的行为，你自然而然的就会努力去精进、去学习、去修正自己，这个时候就变成定力啦。比如说正语，一开始我们要用戒，我们要让自己讲好听的话要让自己讲赞美的话要让自己讲觉醒他人的话不能去讲恶口，不能去两舌。刚开始要用到戒来约束自己的行为啊，可是你达到了一定的程度，你所讲出来的话都是对他人有益的，伤害他人的话没有了，没有那样的思维方式，没有那样的念头，讲不出来那样的话，所以这个时候它就变成了定，所以戒和定是分不开的。前期的戒就是为了约束自己，当你不需要再约束自己，不需要再强制不戒，而戒它就变成了定，这个定力有了自然就生智慧。因为遇到事情我们是不被所动的，遇到事情我们是不起情绪的，这个时候你的智慧自然就出来了。所以我们这个时候再来简化八正道，八正道讲了什么呢？我们记住六个字就就好啦。闻、思、修、戒、定、慧，就这六个字，不停地去多闻、思考和当下体悟，然后不停地来修正自己，不停地去戒约束自己的行为。当不戒而戒的时候就是一种定力。这个定力有了，我们不被烦恼、情绪、欲望牵着走的时候，你的智慧自然就生气。所以呢其实并没有那么难，只要我们不停地去闻思修，不断地用戒定慧去修正自己的行为，智慧自然就在其中了，无智亦无得。我们先来讲一下智就是智慧，这里讲的无智亦无得，这里的智慧是指的解脱的智慧。我们之前从色、受、想、行、识、五蕴，眼、耳、鼻、舌、身、意六根，色、声、香、味、触、法六尘、眼识、耳识，鼻识、舌识、身识、意识这六识，我们又学了十二因缘，又学了苦集灭道，又学了三十七道品，所有所讲过的一切的法都是解脱的智慧，都是解脱的方法。这里接下来又开始告诉我们，空中无智亦无得。自性本来就是圆满的，性本然就是空的，空中是没有这些智慧的。可是我们为什么还讲了这么多的智慧呢？因为我们迷途的众生深深的痴迷于其中，所以我们讲了这么多智慧的方法如何去解脱到达彼岸。这个时候我们要明白，空中无智亦无得，本来就是空性的，就是圆明的什么都没有，自然也就没有这些智慧。我们知道性本然是空的，那我们学来的这些智慧是用来妙用的，所以叫做空中妙有。这些智慧是我们经过后天的学习总结而来的智慧，这个时候我们再把所学的智慧破掉，空中无智，没有了智慧什么都没有。亦无得，既然没有智慧，也就没有所得。我们经常会讲到，我得到了智慧，我得到了法喜。这个时候无智亦无得，把智慧破掉，再把德也破掉，了无所得呀，什么都没有得到。我们说学习解脱的法门，到达彼岸，证得果位，你才能超越轮回。注意，这个时候无智亦无得，得到什么吗？得到了智慧，没有。得到了果位吗？没有啊，什么都没有得到，因为本然就是空的，人人皆具佛性，我们原本就是那个佛，那个自性本然就是圆满的，只不过我们被迷住了。所以这个时候一定要注意啊，它是了无所得的，我们没有得到果位，没有得到智慧，为什么呢？空中本来就没有这些，我们每个人的智慧本然就是具足的，本来就是圆满的，原本即是佛，又哪有所得呢？我们再举个例子，加深大家的理解，比如说我们说春、夏、秋、冬，春夏秋冬也是我们后来给它赋予的名字和对于季节的称呼，说春天是花开的季节，万物复苏的季节。到了夏天，它是炎热的季节，是万物生长的季节，是漫山遍野的绿色；到了秋天，它是一个收获的季节。到了冬天，它是一个寒冷的季节，我们人给它赋予了春、夏、秋、冬的名字，这个时候我们方便记忆，方便所有的人达到共识。所以举这个例子是让我们明白春、夏、秋、冬也只是方便法，说我们这个杯子，我们的古人给他起名叫做杯子。这个时候我们所有人就达成了这样一个共识。所以这个杯子只是是名为杯子。比如说我们这里有一本书，我们给它赋予了名字叫书。以前最早书可能不叫书叫做竹简一样的，只不过我们大家有一个共同的名字、共同的认知，让我们知道这个叫做书。所以你看所有的万事万物都只是方便法，只是为了方便人们达成共识，方便人们知道它，仅此而已。所以注意啊，这个时候我们再讲回来，五蕴、六根、六尘、六识、十二因缘、苦集灭道、三十七道品都只是佛法里的方便法，是为了佛陀方便人们理解，赋予给他一种说法，一个名字。所以这个时候又告诉我们，空中无智亦无得，空中是没有这些智慧的，也了无所得。包括我们讲的四圣道，也只是方便法，赋予给它一个名字而已。所以金刚经反复的说一个排比句。如来说世界，非世界，是名世界。如来说众生非众生是名众生。如来说说法者无法可说，是明说法。所以这个时候要给我们破相。我们要懂得诸法空相，什么都是没有的，自然也就了无所得。这个时候所有的相全部破掉，我们才能空中妙有。我们知道所有的一切本来就是空的，只是一种方便法，方便我们拿来用。所以接下来开始要讲果了，我们之前都在讲因。从色、受、想、行、识、五蕴开始，一直到苦集灭道，到无智亦无得，都在告诉我们如何才能达到彼岸，如何去种因，如何去修行、如何去用。这个时候接下来讲果啦，以无所得故菩提萨埵，因为没有所得呀，所以才成就了菩提萨埵，觉有情菩萨呀，当我们把一切相都破掉的时候才能成为菩萨。小乘佛法认为这一切智慧、果位都是我自己修来的，所以还落得一个有法，还没有把法舍掉，所以只能到罗汉。但是整个金刚经是菩萨在讲法，所以这里告诉我们果，以无所得故菩提萨埵，就是因为了无所得把所有的东西都破掉了，也没有法呀。所以这个时候开始菩提萨埵。这个时候才能成就菩萨果位。注意啊，也只是是名菩萨叫菩萨的名字而已，是我们赋予给他的名字叫做菩萨。我们再来讲一遍，方便大家理解，如何才能成就菩萨果位呢？以无所得故菩提萨埵，就是因为什么都没有得到，也没有智慧，也没有任何的所得，没有得到智慧，没有得到果位，没有得到解脱，了无所得。这个时候破掉了一切相，因为本人就是空的，什么都没有，所以才成就的菩提萨埵。</div></div>"
  },
  {
    "title": "第三十七讲-心无挂碍故无有恐怖",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>心无挂碍故无有恐怖</strong></h2><div class=\"text-indent\">当还认为有所得的时候，就会认为还要去求解脱的果，还有一颗解脱的心，还有我在。所以这个时候就是不究竟的，这个时候反复的我们再强调以无所得故，了无所得。这个时候就没有我啦，我没有得到什么，我也没有得到果位。我也没有得到智慧，一切了无所得，这个时候才能成就菩提萨埵，才可以去觉有情。因为没有我在呢，把我自己抽离出来了啊这个时候我们再换一个角度来讲，把我自己抽离出来了，是不是？我也就融入于天地之间，融入于所有的众生之内。所以这个时候佛菩萨的眼里是没有众生的，是平等的，人人都是佛呀，你没有了我也就没有了人，没有了众生，没有了寿者相，所以无我相人相众生相寿者相。把你自己破掉的时候，其它的相也就破掉了，所以是了无所得才是菩萨的境界。当还认为有果位的时候，就会去求果位，认为有功德的时候就会去求功德，所以这个时候还是落在一个求上，还是落在一个得上，我还在。所以把这个我破掉的时候，没有功德、没有众生、没有所求、没有解脱，本来就什么都没有啊，空中无智亦无得，空中无功德，空中无解脱。因为本然就是解脱的，我们人人本人就是佛，只不过当下迷住了而已。所以这个时候我们一定要明白一个道理，是要把所有的相破掉的，没有什么智慧了，没有什么所得了，没有什么烦恼了，这个时候就成就了菩提萨埵。灭度一切众生已，而无有一众生实灭度者，何以故？若菩萨有我相、人相、众生相、寿者相即不名菩萨。这是金刚经所讲，告诉我们灭度一切众生已已经灭度完了，已经在度化众生，已经在觉有情。但是无有一众生实灭度者，没有一个众生是得我灭度的，为何呢？因为还认为是我在渡众生，就着了我相、人相、众生相和寿者相啊因为你还认为我在度众生，还有我相还有众生相，既不名菩萨，这就达不到菩萨的境界，所以了无所得、没有智慧、没有所得、没有解脱、没有我、没有菩萨、没有众生，因为人人本然，皆具佛性，成就菩提萨埵。所以空中没有五蕴、没有六根、没有六识、没有十八界、没有十二因缘，没有苦集灭道，没有智慧，亦无所得，什么都没有，一切法都只是方便法。因为了无所得，以无所得故，菩提萨埵，所以呢成就了菩萨位。所以这个时候我们不执着一切法啦，有的人说我必须要打坐吗？我必须要读经嘛？我必须要去布施嘛，我必须要去学十二因缘，我必须要学苦集灭道嘛？不一定，我们之前讲过楞严经所说的二十五圆通法门。从哪一个法门都可以证得果位，都可以长久的。所以这个时候我们要破掉一切法，不一定所有的人都要修同样的法，所以佛法才讲八万四千法门，任何的法都只是方便法。最后我们用过既破，用过以后都要把这个相破掉的什么都没有。所以这个时候我们所学的一切有都是拿来用的，切勿执着。为什么空中没有？我们又讲了这么多的法，讲了这么多的智慧呢？这些智慧都是方便法，都是为了拿来让我们用的。我们越是明白这个空性。你越能用好这个方便法。这个时候空中妙有不执着，不执着于空，不执着于有，不执着于法，不执着于解脱了无所得。这个时候我们才能懂得安住在当下，才能把所学的一切法用来妙用。依般若波罗蜜多故，心无挂碍，无挂碍故无有恐怖，远离颠倒梦想，究竟涅盘。依般若波罗蜜多故，我们依照着依靠着到达彼岸的智慧。所以这个时候你看，又告诉我们了，空中妙有了，要依照着到达彼岸的智慧。我们之前所讲过的心经的内容，讲的那些有的部分都是告诉我们到达彼岸的智慧。我们依照着这些智慧，心无挂碍，无挂碍故，无有恐怖。当我们心里没有了挂碍，就没有了恐怖。我们首先讲什么叫挂碍，像网一样把我们挂住了，碍有障碍阻挡着我们前行，这叫挂碍。比如说我们在听心经的过程当中，我们在学习心经的过程当中，我们去体会一个很奇妙的感受。有的时候我们好像也没有记住那些名词。比如说我们现在再去回忆五蕴讲什么、六根讲什么、六尘、六识、十二姻缘、苦集灭道好像有印象，又好像记不住了，你会发现似乎是了无所得。但是呢很多事情我们开始懂得放下了，我们不再执着了，我们不再痴迷了，我们开始变得身心自在了。为什么呢？是因为我们在不断的学习的过程当中，很多事情不知不觉地已然放下，因为挂碍少了，你的烦恼就变少。烦恼变少，我们的恐怖就会变少。我们再来讲恐怖。恐是来自于外界的影响和反应，外界发生一个什么事情我害怕了，这是受外界的影响，怖是什么呢？是内在世界自己的害怕，是我们自己心里生出来的害怕。比如说很多人啊会无缘无故的害怕，不知道什么原因，有的事情也没有发生自己就开始害怕了。比如说我们谈了一个爱人，怕爱人离开我，今天没有给我回信息，我就害怕他是不是有事情啊？他是不是不爱我了？我的孩子出去上学，我也很担心，出去工作我也很害怕，这个时候都是因为我们的挂碍太多，我们做生意的时候，我们也总担心客户是不是会不进货了？会不会离开我们了？你看这些都是自己内心生出来的害怕。当我们心里的挂碍越多，我们的恐惧也就会越多，我们内在的害怕也就会越来越多，我们对外界的反应也会越来越大。举个例子，有的人说害怕鬼神说怕鬼啊，有鬼会伤害到我。当我们听完心经以后，你知道一切都是空的。我们的生命也是四大假合而成，我们的人生也是分段生死，只是我们众多轮回当中的一段而已。所以生死有什么可怕的呢？只不过是换一种状态去生存罢了。这个时候你会发现你还会怕外界的伤害吗？这个时候你的恐和你的担心开始逐渐的消失的时候，这个时候你的人才是自在和喜乐的。我们又了解了万事万物都是因缘和合的，难道会因为你的害怕事情不发生吗？说我害怕顾客离开，顾客就不离开嘛，说我害怕我的爱人不爱我了，难道你害怕能解决问题吗？我害怕我的孩子将来不孝顺他，不会因为你的害怕而变得孝顺。那我们懂得了因缘和合的道理。第一，万事万物我们不执着，我们只是因缘和合的一部分。那么第二，我们要想让这件事情的结果更好，我们所能做的就是积极努力的去种因果上随缘就好啦。所以这个时候我们心里的挂碍越少，我们的贪欲越少，我们的恐怖也就越少，我们才可能变得坦然，才可能变得自在。所以说心无挂碍，无挂碍故是因为没有了挂碍，无有恐怖就没有了恐怖。当我们究竟解脱的时候才能没有恐怖啊，可是我们一下达不到怎么办呢？也是逐渐的修行的过程，让我们的挂碍变得越来越少，我们的恐怖自然也就越来越少。那么最后修到无有挂碍，什么挂碍都没有，也就什么恐怖都没有，无有恐怖，远离颠倒梦想。颠倒梦想、梦和想，我们白天叫做想，我们的第六意识心叫想，晚上叫做梦。所以我们去看，我们白天你在想什么？你的意识当中有什么，你做梦就会梦到什么。比如说我们白天是很刻苦努力学习的，你会发现晚上你就会经常梦到自己在学习。如果我们白天是担心恐惧的。你会发现晚上就会做噩梦。我们白天对一个人是有执念的，是有思念的，你会发现晚上就会做这样的梦。当我们不断的学习，不断的修行以后，我们会发现我们的梦变得越来越少了，变得越来越简单了。因为我们平时的想法少了，意识动的少，晚上做梦也自然会变少。很多人晚上经常做噩梦都是因为恐怖太多了，平时你有太多的恐怖的意识，所以做梦的时候就会做相应的恐怖的梦。我们再回来讲颠倒啊，当我们众生有了业力，开始轮回被迷住的时候，就已然事事颠倒了。所以当我们心里没有挂碍的时候，没有恐怖的时候，就开始远离颠倒梦想。我们就是因为产生了这些恐怖，我们的第六意识心，也就是虚妄心，才不停地在动，导致晚上也在不停的做梦，所以每天痛苦不堪，不得片刻的宁静。</div></div>"
  },
  {
    "title": "第三十八讲-远离颠倒梦想",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>远离颠倒梦想，究竟涅槃</strong></h2><div class=\"text-indent\">远离颠倒梦想，究竟涅槃，涅槃灭掉生死，灭掉烦恼，达到解脱，这个叫做涅槃。没有烦恼了脱生死了即为涅槃。涅槃又分为有余涅槃，举个例子，何为有余涅槃？比如说我们讲释迦牟尼佛。佛陀三十一岁的时候在菩提树下证悟成佛，然后呢并没有离开，因为看到了众生还在生死轮回当中不得解脱，留下来讲法四十九年，这四十九年就是有余涅槃，有余涅槃的全称叫做有余依涅槃。依依什么呢依肉身说佛陀证悟了佛果，三十一岁悟道成佛，其实当下即得解脱了，当下就已经了脱生死，直接挣到佛果了。所以这个时候呢没有走留下来又讲了四十九年法依托于肉身这个四大假合的身体，这个就是有余涅槃。到了佛陀八十岁的时候，这个时候开始肉身也舍掉了，不要了，这个时候就是无余依涅槃，无余没有任何的依托了，不需要了，这个时候开始就是无欲涅槃了。我们再讲罗汉也是有余涅槃。罗汉了脱了生死是了脱了我们有肉身的这个生死，但是还有依并没有完全了脱生死，要从初果罗汉灭度以后修到二果、三果，最后到大阿罗汉的时候，才到了无余依涅槃，不需要依靠任何肉身，不需要有任何的生死，所以这个时候就进入了无余涅槃。我们很多人学佛呀有一个误区，认为是不是说我身体死了以后我才能涅槃，我才能得解脱？不是这样的。我们还是说释迦牟尼佛，释迦牟尼佛在三十一岁正悟成佛的时候已然涅槃了，但是呢他没有走，继续留下来，这个时候就是有余涅槃。身体灭度以后，这个时候开始进入无余依涅槃。所以这个时候我们一定要注意啊，修佛不是修来世，说我死后我去追求涅槃，不是这样的。如果我们人身肉身还在的时候就正得果位了，我们就解脱了，了脱生死，这个时候是有余涅槃当身体舍掉不要的时候就直接进入无余依涅槃，所以有余涅槃是去往无余涅槃的必经之路。包括罗汉也是一样的，罗汉了脱这里的生死以后，他还有变异生死还要从初果罗汉到二国罗汉，到三国罗汉、到四国罗汉，也就是大阿罗汉，这个时候才进入无余涅槃，所以说有余涅槃是必经之路，才能达到无余涅槃的境界。这个时候我们再来讲在生活当中应用，有没有涅槃呢？我们经常听到一个词叫涅槃重生，所以我们再来讲涅槃的概念。涅槃它是一种概念，一种形容，每个人的涅槃都不一样。举例就好比是幸福、优秀这样的词。幸福有一个固定的概念没有？是不是没有啊？优秀也没有固定的概念呢？有的人认为达到这样的高度就是优秀，有的人认为达到这样的高度才叫优秀。那对于幸福的指数，每个人的追求也不同，有的人说我自在喜乐就是幸福；有的人说，我必须得住上大房子，开上好车，这个才叫幸福；有的人说，我必须儿女双全，这个才叫幸福；有的人说，我了无牵挂已然就是幸福。所以每个人对他理解的标准不一样，所以涅槃重生即是如此。比如说一个人开始新的思维、新的生活方式。很多人以前说我没有接触过佛法，我接触过佛法以后，我突然明白了很多道理，我事情不再执着，它改变了我的心念和思维方式，这也是一种涅槃重生。只不过这个涅槃并不究竟，这是我们在生活当中可以用到的部分。接下来我们再继续讲心经中所讲，远离颠倒梦想，究竟涅槃。当我们远离颠倒梦想的时候，就可以得到究竟涅槃。我们在接着往下讲何为究竟涅槃？我们刚才讲的有余依涅槃，无余依涅槃，还不是《心经》中所讲的究竟涅槃，自性清净涅槃这个是修大乘佛法才有的。什么叫自性清净涅槃呢？举个例子，比如说我们在学习佛法，听到自性本然清净、缘起性空，原来一切本来就是空的。你会找到一种失而复得的感觉，这个就是自性清净，就是我体悟到了是原本就是这个样子的。这个东西好像我之前就知道它本来就属于我的，只不过我不知道什么时候把它丢掉了，这个时候就是体会到了自性清净涅槃。反之，有的人听佛法不是这样的，有轮回吗？说的是真的吗？我们原来都能是佛吗？我们有那么高的智慧吗？这个因果轮回它到底是真是假呀？有一些佛法当中说到的，我看不到，我也不相信呢，或者我相信，但是并没有十足的信念。所以你看这个时候就会产生不同的想法。当我们觉得嗯本来就是这样的，确实人人是可成佛的，这个就是自性清净涅槃了，是我们自己体悟到了，他本然就是这个样子的。小乘佛法不是的，小乘佛法用不到这里，小乘佛法认为一切智慧和果位都是自己修到这里的，所以他不认为。是自性本然清净，所以但是大乘佛法才用到的自性清净涅槃。那我们再来往生活当中讲生活当中的小用，如何叫自性清净呢？比如说我做事情不执迷于其中，自性就是清净的。我们之前举过例子啊，比如说我们在陪孩子玩儿捉迷藏的游戏，你看孩子是很认真地痴迷在其中的，他会因为你找不到他而自己着急，又会因为找不到你而自己伤心难过，甚至是哭，玩了生气了，因为它是深深地迷在其中的。这个时候你在陪孩子玩游戏的时候，你会发现你是不迷在其中的，这个时候你就是清净的状态啊！再比如说，我们说生活当中有很多的智者，别人是沉迷在这些痛苦和欲望当中的，可是这些有智慧的人他是不痴迷在其中的，这个时候保持的就是自性清净。只不过这个自性清净有大有小，我们往生活当中小用，大家可以去体悟，当你懂得把自己从其中抽离出来的时候，很多时刻是可以保持自性清净的。只不过在不停的往上修的时候，随着你的境界越高，你会发现你是可以时时刻刻守着自性清净的，你时时刻刻都是清净的，都是不被万物所扰的，这个时候你会发现你就没有烦恼。很多事情你看得清清楚楚，永远都是那样的淡定和从容，就是自性清净涅槃，你看是不是涅槃？当下你就没有烦恼啊，当下你就到达彼岸。这个时候我们来讲自性清净涅槃。无住处涅槃，这个是大乘佛法要用到的，远离颠倒梦想，究竟涅槃，这里的究竟涅槃指的是无住处涅槃。无住任何地方都不住，不住于涅槃，亦不住于生死轮回，不住于苦集灭道，亦不住于任何的方法。所以这个时候我们就要用到金刚经里所讲的应无所住而生其心没有所住也没有被住，不住在任何事情上，我也不求解脱，不住在解脱相上，我也不住在苦相上。说人生本来就是苦的，不住在既没有苦相，也不住在解脱相上，无智亦无得，没有所得呀，没有智慧啊，什么相都不做，这个是究竟涅槃，远离颠倒梦想究竟涅槃。究竟涅槃指的是无住处涅槃。为什么要无住处呢？因为要自觉觉他呀，如果住在涅槃上就不来度众生了，如果住在众生的苦相上，又着了众生相了，无法觉悟啊，和众生一样。痴迷在其中，颠倒在其中，又如何去度脱众生呢？所以这个时候懂了一切都是空相的，懂得了自性本然就是清净的，这个时候证得了空性，证得了自性本然就是清净的，证得了自觉觉他是需要无所住的，不住在自觉上，亦不住在觉他上，应无所住。哪里都没有住，故而哪里都有所住，入什么道显什么相。比如说来到了娑婆世界，显得就是人像，这个时候知道自己是来度脱众生的，就没有什么可执着的。当没有什么可执着的时候，我们不痴迷在其中的时候才能去妙有，这个时候看到了众生的苦，才能告诉众生如何去解脱。所以整个心经，观世音菩萨和智慧第一的舍利弗之间的对话，所以告诉舍利弗该如何解脱，如何达到菩萨埵。当达到了菩提萨埵，告诉我们什么样才是究竟涅槃。注意这里的关键词，远离颠倒梦想，究竟涅槃。当我们远离颠倒梦想的时候就已然是究竟涅槃。所以我们听到这里的时候，想告诉给所有的人一个道理，涅槃并不难呢。我们听到涅槃这个词认为是不是只有成佛才是涅槃呢？只有成菩萨才是涅槃呢？听上去是这样的，可是还有一个极其简单的方法，远离颠倒梦想，究竟涅槃了。当我们离一切颠倒梦想不再迷于其中的时候，自性清净的时候，就已然是究竟涅槃了。所以说何须修来世，何须盼身亡呢？当下即得解脱，当下即是涅槃呢。</div></div>"
  },
  {
    "title": "第三十九讲-究竟涅槃",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>远离颠倒梦想，究竟涅槃</strong></h2><div class=\"text-indent\">我们再想一个画面，我们提升一个境界和感受，这个时候我们把自己想象成为本然就是佛菩萨再来，倒驾慈航来度脱众生的。这个时候你再去想一想，你还会因为今天买个菜两块钱跟他争吵嘛？今天孩子学习不好，我就开始担惊受怕，今天生意不好，我就开始变得痛苦，别人说了一句不高兴的话，我就开始烦恼，我失去了一样东西，我就开始执着。空中什么都没有啊，连身体都没有，那还有什么呢？难道眼前的这个杯子是我们的吗？难道我们家里存的那点钱最终会是我们的吗？难道我们那个孩子他究竟就是我们的吗？他只不过是我们当下所显现的一个缘分而已啊难道我身边的老公、老婆他一直会是我们的吗？它只是我们当下的缘分，我们的父母难道生生世世都是我们的父母吗？不是的，他只是当下的缘分的一个显化而已。空中本然没有这些呀。所以这个时候我们明白这个道理，你该怎样生活怎样生活，你该如何教育孩子如何教育孩子？你该如何做生意如何做生意？只不过我们不再执着于其中，这个时候你才能空中妙有，你才能远离颠倒梦想，究竟涅槃。所以说当下即是涅槃，当下即可解脱。只不过我们要保持自性清净，远离颠倒梦想，当下即得解脱。所以我们再讲一句，要去自觉和觉他，这个才是无住处涅槃。所以总结一句话很简单。“远离颠倒梦想即可当下解脱“，当下没有烦恼，不需要有任何的期盼。当我们无所住的时候，才能事事有所住，念念有所住，当我们懂得念念去觉他的时候，念念用来自觉修正自己的时候，直到觉行圆满。那我们再回头来讲，刚才我们说了一个话题，我们想象一下自己是佛菩萨再来，是想象吗？我们本来就是啊！人人皆具佛性啊，只不过迷住了而已。那你当下你认为我已经无住处涅槃了，那就是无住处涅槃。你说当下我已然是佛菩萨啦，我要去觉悟众生。那对呀，你当下既是佛菩萨啦，因为你本然即具佛性，注意啊，加上一句，这句话不能对外人讲。如果你对身边的人说我已经是佛菩萨了，他说你是妄想，所以自己清楚就好啦。提升你自己的境界，不要乱讲啊。朋友们，课程录制现场问答环节到了。这样啊，我们说无所住，是不是？什么都不住，连涅槃都不住，众生的苦也不住，自然也不住，在自觉和觉他。可是我们要讲的时候，你要不要讲自觉和觉他？你要讲啊，你不讲不知道在说什么，所以他讲出来的都是方便法。这个时候你不需要住在自觉上，不需要住在觉他上，所以你去看佛菩萨讲话，比如说我们金刚经怎么讲灭度一切众生已。已是什么意思？是不是代表已经做完了？无有一众生实灭度者，却没有一个众生实际得你灭度，因为你要认为还有众生得你灭度，即着我、人、众生、寿者、即不名菩萨，这不是菩萨的境界。所以你看佛菩萨在度众生，却认为自己并没有度众生。然后我们再举个生活当中的例子，你就好理解了。比如说有的人去做善事，你说你真善良，你看真正善的人怎么讲话？没有啊，我这个还叫善事吗？我觉得我应该这样去做呀。你比如说你看有的人见义勇为，你说你真的很善良，说今天有人跳水了，你当时是怎么想的啊？你为什么要下去救他？你考没考虑过他会不会有什么其他的行为？报答你也好啊，或者有没有可能产生什么误会？你会发现他那一刻什么都没想，他那一刻只有一个念头就是我该去做这件事情，其他什么都没想。你能体会我在说什么吗？就是他认为这是己任，而不认为我在度脱众生，我在帮助他人，那是你们觉得我在帮助他人，是你们觉得我在度脱众生，实则我只是认为那是我该做的事情。然后比如说咱们的很多粉丝朋友也在说，说你们真的是帮助了很多迷途中的众生。那你看咱们自己，你想一想，没有啊，我们真的没有说刻意去帮助谁，我们只是在觉得这么多人痛苦，这么多人颠倒迷茫，这么多人不能生成智慧，不能更好的面对生活，我们只是讲了一些自己的修行所得，谁有缘分谁就去听。我们没有去执着于帮助任何人，或者我们去执着于我们必须要度脱多少人，我们只是随缘做一些我们自己认为该做的事情，仅此而已。这个时候你会发现就是无所住，你没有住在自己上，每天我要自觉没有？你只是认为修正自己它是一个理所当然的事情，我去帮助一下他人，本性使然，这个时候就是无所住，然后你会发现你也不会去求涅槃。你也不会去求我要远离苦海，那就着相了。所以你会发现你当下没有烦恼的时候，当下即得解脱呀。所以当我们还在的时候，你证到了以后就是有余涅槃嘛，那就了脱了那个烦恼。或者其实我们再往佛法玄妙处讲，其实人人本来就是佛，只不过这句话说出去没有人敢信，那本然人人就皆具佛性啊。所以让大家想象自己是佛菩萨再来，所以你去想象，如果你现在是佛菩萨再来，你看你的境界是不是一下就下来了？你还会跟他计较那点小事吗？你还会去计较那点生活的不顺利吗？然后我们说了，他也只是是名想象把你的境界提上来，当有一天你突然证到了，悟到了，你会发现所有的东西。你放下的时候，当下即是解脱，当下即是涅槃。佛法的玄妙在于我们觉得它离我们很遥远，你会发现当你真正理解的时候，他一点都不遥远。但是奇妙的是你把它说成很简单的时候，会有很多人不理解，反而他觉得不对，不可能这么简单，怎么能这么简单呢？实则它本然就是这么简单，只不过它用了太多的名词，我们不了解那些名词在讲什么，就把我们绕晕了，实则它并不难。在这个时代我们是需要把这些法不停地去简化，让大家一听我就懂了，否则人们会产生距离感，一听你别修了。佛离我太远了，你不知道你本来就是佛，涅槃是不是等我死了以后啊？不是的，你当下即可得解脱，只不过你没有证到而已。所以咱们不停的为什么往生活化讲，往浅了讲，因为你越用佛法的知识，大家越听不懂，所以这个就是无所住的这样一种状态。我们不住在任何事情上，这个时候你会发现你才能回归当下。当你回归当下，你专注在每一个念头、每一件事情上的时候，你会发现这一刻你是没有烦恼的。哪有什么烦恼啊？其他的事情都放下了，就是我们心里有太多的挂碍嘛。说你看我们坐在这里还在想晚上吃什么呀？那孩子上学上得怎么样啊？我那个快递是不是快到了？我怕我那个生意明天是不是会受影响。你想你看，我爱的那个人现在都没有给我发信息，他是不是不爱我了？今天派出去的员工谈的那件事情怎么还没给我来？结果呀有没有可能被别人撬走了，这个生意没有了。你看你那么多的挂啊，那么多的欲望，你会发现是不是就生出来各种恐怖，就各种担心？当你心里没有挂碍的时候，当你知道一切本来就是空的，连我们自己都是空的，哪有什么事情是有挂碍的呢？所以还有一个修行上的事情，是以一般人他所不知的或者所不了解的。你会发现随着越修行的人和身边的人的关系、亲人会变得越来越淡薄，变得越来越淡越来越淡，为什么呢？就要灭因，又要灭果的。你看我们去学十二因缘的时候不是讲过吗？就是因为有这些业力和缘分，有这些因果在，所以我们才不停的轮回。举个例子说我们过去是造的那个因已经做过了，那个是没法去挽回的，是不是就形成了今生的这个果？所以我们要想求解脱的人，或者说不停地往上修行的人，是不是要把今生这些果灭掉？那灭完这些果，你下一次要不要来？要来。为什么要来呢？我们先不说渡不渡脱他人，你还有过去是种的因你还得灭了呢你还得灭掉呢，这个时候你又要灭果，又要灭因。所以注意啊，人们都听过一句话，叫菩萨畏因，众生畏果，都听过吧？很多人把它理解成什么呢？说众生畏果，菩萨畏因是意思是不造恶业，只做善业，只种善因、留善果。不是的，你要再往一个深境界理解菩萨善因也不重要，你种善因还得得善果呢？所以为什么金刚经也好，心经也好，都告诉我们诸法空相，都让我们破掉相呢？你不要认为你在帮助他人，你要认为你在帮助他人就中善因了，你还会得善果的。所以越是修行的人，为什么身边的缘分会变得越来越淡薄呢？父母的缘分、孩子的缘分、亲人的缘分，甚至你去看很多佛家的人为什么都没有孩子、没有婚姻呢？但是世人不理解呀，那是因为这些因果，你要不断地去种因，不断地结缘分，你后面就会产生不断果走不了的往哪里走啊？解脱不了的啊出不去。所以我也经常跟你们讲啊，我说咱们到场不养活物，为什么呢？举例啊，今天你养两只小狗，你养他了，你对他有养育之恩的，他要来抱你的，你以为养完就完了，不是的。所以你会发现善因也不种，恶因也不种，你把所有的相破掉的时候，我们再去做着觉他的事情只是是名觉他，我们并没有认为我们在觉他只是我们做什么总要做点什么有意义和有价值的事情，也只是我们觉得有点意义和有点价值，我们就去做这样的事情。所以我们不求任何人的回报和感激，我们不去种这些因。自然就不会结那些果。这个时候你会发现整个一个人才是自在从容的，了无牵挂。所以我们当下身边所有的亲人、父母啊，有的人有孩子的呃、有伴侣的、朋友的，都是我们自己的这些因缘，都是过去世种的因而已。所以既要灭果，又要灭因，这个时候就涅槃了。所以为什么说不结太多的缘分呢？你看，修行它不是次第而行的嘛？就像比如说你看我们整个讲心经，空中无色受想行识，我们怎么还讲色受想行识，空中无苦集灭道，我们还怎么讲苦集灭道？因为已经入了啊，所以要不停地先去有，我们讲一心三藏不也是一样吗？先是不空如来藏，再接下来就是空如来藏，空完了以后再空不空。所以刚开始大家你们要有这样的发心，所以一直在跟你们强调，你们要有利他之心，要有觉察之心，否则你们怎么能做好当下的事情呢？会随着你们境界不断的提高，当你已经起心动念，念念都是觉他的，这个时候你就不住在上面了，因为你起心动念都是对他人有益的，都是想着如何去觉醒他人的，你就不住在上面了。就好比是学论语的时候讲，孔子说七十，随心所欲不逾矩。他随着这个心是什么心呢是什么心，就相当于佛法的这颗妙明真心，这个自性。只不过用儒家它叫天性，天命之谓性嘛，他率着是那个天性，说随心所欲不逾矩。为什么他说七十可以随心所性了呢？都是善呢，没有恶呀，你就随便起一个念头，随便讲一句话，随便一个行为，念念都是觉他的。所以这个时候你没有任何负的东西，没有任何不利于他人的东西，这个时候你就不需要再去刻意了。所以金刚经和心经讲到最后是讲给什么样的人听的呀？心经是谁问谁答，舍利弗智慧第一啊，所以是讲给有智慧的人听的。那金刚经呢？须菩提问的，须菩提是解空第一啊，所以你看，什么样的人能问出来什么样的话。所以你看解空第一的人，他问的一定是跟空性有关系的，智慧第一的人他问的都是和智慧有关系的，所以金刚经是用来破相的。是你不要着这些相你才能修到菩萨的境界。心经也是一样的，上来就观自在菩萨。</div></div>"
  },
  {
    "title": "第四十讲-三世诸佛",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong>三世诸佛</strong></h2><div class=\"text-indent\">三世呢指的是过去世、现在世和未来世。三世也只是一种概念，因为过去有无数的世，我们把它称为过去世，现在世和未来世，那三世呢也就代表着生生世世。三世诸佛这里告诉我们，过去世、现在世、未来世的所有佛依般若波罗蜜多故得阿耨多罗三藐三菩提。过去世、现在世、未来世，所有的佛都是依照般若波罗蜜多心经的智慧，都是依照此到达彼岸的智慧，得阿耨多罗三藐三菩提就是无上正等正觉。我们先来讲这里的关键词，正觉，正确的觉行、正确的解脱之道称为正觉。正觉它是区分于无觉、不觉悟，没有情的、没有悟性的那些众生和邪觉，不是按照正确的知见和方法去觉悟的。过去、现在、未来世所有的佛都是依照此心经的智慧得了无上正等正觉。我们再来讲无上，无上就是至高的，没有比它再高了无上正等，我们再把这个相破掉，何为正等啊？佛说众生平等的，人人皆具佛性。所以佛说在佛的眼中没有善恶美丑之分，没有众生之分，只不过当下被迷住的多或者是少。那我们说既然是正等的，既然是平等的，那也就没有无上，没有无上即没有无下都是一样的。这个时候我们再来理解这句话，三世诸佛，既然。人人都是佛。那这里的三世诸佛指的是什么呢？过去世已然成佛的，现在世觉悟成佛的、未来即将成佛。三世诸佛，那这样来理解指的是所有的人、所有的众生啊所以佛法是极具包容性的，人人皆可成佛，众生皆是平等的。那这个时候有的朋友不理解呀，那既然都是平等的，为什么还有佛、还有菩萨、还有辟支佛、还有罗汉、还有二十八重天，还有人、还有畜生道，还有地狱道，还有饿鬼道呢？这都是方便法，方便说呀，是名为佛、是名为菩萨、是名为罗汉、是名为人、是名为畜生。是名为恶鬼而已，只是方便我们区分这一切名称也只不过是方便法。就好比是我们之前举的例子杯子，我们给它定义成一个杯子是为了人们方便理解，书我们大家都管它叫做书，是为了我们方便记忆和共识，所以佛法是极具包容性的。这里的三世诸佛其实指的就是所有的众生，当下是众生，未来终究会成佛果的，只不过什么时候觉醒。那这个时候我们再来看三世诸佛，过去世、现在世、未来世所有的人、所有的众生依般若波罗蜜多故，得阿耨多罗三藐三菩提都要依照着般若的智慧，都要依照着心经讲给我们的到达彼岸的智慧，得无上正等正觉。所以这个时候我们又讲到既然是正等，就是无上亦无下。对无上亦只是方便说正等正觉，这个时候可以觉悟成佛果，故知般若波罗蜜多是大神咒、大明咒、无上咒、无等等咒。所以说呀我们要知道般若波罗蜜多是无上咒啊！所以说我们要知道般若波罗蜜多是无上的，因为过去世、现在世和未来世的所有众生都要依靠般若波罗蜜多的。智慧去到达解脱的彼岸。所以说故知般若波罗蜜多是大神咒开始讲咒了，前面讲的都是经，后面在讲咒这里的经和咒，我们给它简单的做一个区分，经是用来做什么的？经是显说，明显的说是为了让我们增长智慧的。从心经的一开篇就告诉我们，观自在菩萨行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。开始给我们讲法、讲因、讲果，讲了很多智慧的方便法，又告诉我们破除一切相，这些都是在告诉我们如何去增长智慧、如何去修行让自己回归那个佛性。所以经是显说增长我们的智慧的咒，是用来增长我们的福德的，所以咒它是不需要翻译的，它和经具备同等的力量。说我诵经可不可以？可以呀？我诵咒可不可以呀？可以呀，我直接诵心经所讲给我们的咒，它是具备同等的力量的，所以经是用来增长智慧，咒是用来增长我们的福德。整个心经前边所讲的都是经结尾的部分开始介绍这个咒，所以整个心经告诉给我们的是福慧双修，学习经文是增长我们的智慧，持咒是增长我们的福德。有福又有慧，故知般若波罗蜜多是大神咒、大明咒、无上咒、无等等咒。大神咒它是具有神力的具有神力，可以带领我们到达解脱的彼岸。大明咒它是光明的，它是可以明心见性的，它充满着无限的光明。无上咒没有比它再上的咒了，最好的咒语，那我们再把无上破掉的时候，就是无上无下。我们去读佛经，很多人会不理解，哪部经典都在说是无上咒啊？金刚经在说为发大乘者说，为发最上乘者说，哪部佛经都在讲是无上的经典，为什么都在讲无不上的经典？缘起不同，它讲给听佛经的在场的众生不同，所以这个时候适合的就是最好的，又哪有上和下呢？无等等咒没有和他同等力量的咒语了，无等等我们刚才说过了，没有和他有同等力量的咒语。那我们再看它背后讲的是什么呢？五等等绝不是落入这个只有心经是最好的这种相。那看到无等等背后要告诉给我们的皆是平等的，哪部经都是最好，只不过当下的人困惑不同，所要学习的方法自然就不同。是法平等，无有高下。我们现在在学习这部经典。所以我们要知道过去世、现在世、未来世所有的众生依般若波罗蜜多才能到达彼岸。所以说我们要知道般若波罗蜜多是大神咒、是大明咒、是无上咒、是无等等咒，能除一切苦，真实不虚。这个时候开始给我们回应了。开篇的时候告诉我们照见五蕴皆空，度一切苦厄。这里开始告诉我们能除一切苦，真实不虚的，所有的众生、所有的佛，皆是依照般若波罗蜜多的智慧到达了解脱的彼岸，所以说它是可以除一切苦真实不虚的。观自在菩萨，观世音菩萨在讲这部心经，所以在告诉我们它是真实不虚的。我观世音菩萨亦是这样修行过来的，也是行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄的。所以讲的是自己修行过来的心得和经历，它是真实不虚的，可以度脱一切苦厄，到达解脱的彼岸，圆满成就。故说般若波罗蜜多咒即说咒曰。所以说呀说般若波罗蜜多咒即说咒曰。接下来这十八个字就是心经的咒。它和经文是具备同等的力量。揭谛揭谛波罗揭谛波罗僧揭谛菩提萨婆诃。用这十八个字的咒结束了心经。咒啊我们说是不翻译的咒就好比是一个密码，我们举个例子来理解，比如说我们的银行卡密码，它是由六位数字组成，这六位数字没有什么特殊的含义，有的人可能用到自己的生日，用到其他人的生日或者说自己比较重要的、喜欢的数字所组成，但是它具体并没有什么更深的含义，虽然它没有更深的含义，这几个数字就可以打开银行的密码，这几个数字却可以打开手机的密码这几个数字就可以打开保险柜的密码。这个咒啊就相当于平时我们设计的那个密码，它是通往我们要到达的那个地方的钥匙，所以咒即是同理。这里的咒我们简单地来翻译，揭谛揭谛波罗揭谛波罗僧揭谛菩提萨婆诃。就是来吧来吧(去吧去吧)，都到彼岸来吧(去吧)。这就是这个咒语所要表达给我们的力量。所以说整个心经是福慧双修的。前面的部分是告诉我们如何去增长智慧，后面的咒语我们去持这个咒语的时候是可以增长我们的福德，增长我们的力量我们在生活中总会遇到很多我们想去帮助去帮助不到的人，他不听我们的。或者说还没有到达那个机缘可以听懂佛法。那这个时候我们不妨在心里默念：“揭谛揭谛波罗揭谛波罗僧揭谛菩提萨婆诃”，来吧来吧，都到彼岸来吧，希望大家都来吧来吧，都到彼岸来吧。这个时候你会发现我们的慈悲心就在不断的增长，我们看到众生都那么苦啊，我们虔诚的发愿，希望所有的众生都可以来吧来吧，都到彼岸去吧。这个时候我们就没有了我们自己过多的感受把我相破掉的时候，我们的慈悲心就在不停的去增长。我们看到那么多迷途中的众生，看到那么多受苦的众生，我们就希望我们自己。即在心里可以默默地去做点什么，自己去虔诚的发愿，我们去自觉，我们去觉他。揭谛揭谛波罗揭谛波罗僧揭谛菩提萨婆诃，来吧来吧，都到彼岸来吧。</div></div>"
  },
  {
    "title": "用于不用",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\"><strong></strong></h2><div class=\"text-indent\">慢慢听啊，别着急，有点绕。我们先用论语切入吧。首先这个人你看他有痛苦，有烦恼吗？没有，这心大，什么事情都不往心里去，就在他那里什么都不叫事情，这是生而知之的部分，好不好？好，本质好，真的好，这样的人没有烦恼的，真的没有什么事情在他那里都是小事情，因为他不在意。但是他说的话找不找人听？找人定吗？不找人听。别人听不进去。什么听不进去。他不跟你讲道理还好，他跟你讲的道理一句都进不去的。就相当于你讲了道理，我还把你好好的。嗯不行。为什么呢为什么会这样呢？因为他没有经历那些别人的痛苦，没有感同身受，没有共鸣，什么都没有什么共鸣、共情什么都没有，为什么会没有呢？他人家这个部分好是生而知之的。我们再举个例子啊，不着急，这个话题很很妙，也很深。如果你把它听懂了，这个姑娘啊如果她要听懂了。要真的去修过来，这个人我告诉你就厉害了。我们举个例子啊，你看生活当中有没有很多我们身边的朋友或者亲人，心很大，甚至家里吃不上饭了，这样人都不管。有这样的人吧，你看这样的人没有烦恼，没有痛苦的，你发没有什么事都揭不开锅了。那揭不开就揭不开吗？啊哈不痛苦，但是这个不痛苦能不能用？不能用。我们再用论语的话来解释啊，【不忮不求，何用不臧？是道也，何足以臧？】他本来就是这个样子的，他怎么用啊？我们讲修行的过程，所以一开始我们从有要修到空。不到无，最后有无相生可以用。它本来就是空的，他从空到空，他想用的时候用什么？没得用。那我们再讲，比如说一个人的性格本来很快、很急，他修修修把自己修慢了，修中和了，是不是可快可慢？这个时候它可以用，用之则行，舍之则藏。那本来这个人就骂，行吧？那行，他做事情没有效率，做不成事情快不了。缺了一半。我们再讲，一个人，他经历了很多的挫折，有痛苦、有烦恼，但是他从里面走出来的时候，他能不能理解他人的哭？能，这个时候可以用。我们再举个例子，比如说我们经常提到的子路，这个人很勇猛，然后他跟孔夫子学习，接受教化，内在开始有仁德、有中性，他那个勇猛可不可以用？可以，如果他压根就不是一个勇猛的人呢？不可以用。我们再举个例子啊，说一个孩子他很聪明，但是他不爱学习，这个时候如果你把它调整。到正确的道路上来，他又聪明又学习，是不是可用？而一个孩子他本身不那么聪明，但是他很认真学习，未必有用，能不能学会？你再举例子，说一个孩子他很调皮，如果这个调皮好动，你给它调整过来以后，它不那么调皮了，但是那个调皮还在不在？在它可以用。所以这是从有到无的过程，再到有无相生的过程，从有到无，从有到空，而它是从空到空，没法用的。呃大家有没有体会啊？好，我们再来讲说同样有两个人，一个人心很大，他从没有烦恼、没有痛苦，这个程度是一样的。另外有一个人他心没有那么大，他有很多的烦恼和痛苦，但是修到了没有烦恼和痛苦，这两个人一样吗？没有痛苦这件事情是一样的，但是用出来的时候是不是不一样？你再举个例子啊，比如说一个人本来是骑自行车的，十年以后他还在骑自行车，而有一个人是从一无所有到开汽车、开豪车，最后又回到骑自行车了，看似骑自行车当下是一样的一样吗？一个可用，一个不可用。你再举个例子啊。一个人是有能力的、有才华的，但是我不追求名利，和一个人压根儿就没有能力追求，看似两个人都不要一样吗？为什么不一样？一个可用，一个不可用。可用这个叫有无相生，空中妙有，叫中庸之道，发而皆中节。那你没有的时候你没得发呀，你怎么会中节呢？不一样的。所以修行我们要先取中、起，完中以后呢，用之则行，舍之则藏。我们再举个例子说，一个人口才很好，这是天生的优势吧。但是呢你经过了学习以后，你就知道什么。的话该讲，什么样的话不该讲，你有自己的正确的价值观和准则，这个时候可不可以用？然后你会发现口才很好的人，平时也不太讲话的，没什么可说的呀，尤其是对他人没有帮助的话，不讲和一个本身就不爱讲话的人一样吗？它可以用。呃那个不可以用啊。这玄妙的地方就在这里，能听懂吗？嗯所以我说他对论语是空白的，但是这个人要真的把论语学明白了，他这方面如果有了这个人厉害的文质彬彬，现在是制胜文则也。他讲那个东西有没有道理？有道理，但是是空的。因为它没有那个过程，他们有经验，他不是经历，是你没有学识，没衍生成智慧。哎然后我们再讲回来，他说了，我生意没做好，是对朋友太仁慈了。不是的，是你没了解什么叫人。他讲的话呀你从这里你都听得出来，句句伤人呐，但他不觉得，你看，没有智慧的人讲出来的话就是这样的。我们举个例子啊，一个修行过的人和没修行过的人就讲同样一句话，你听着看一不一样？举个例子，我旁边坐着流光，他讲了很多生活的烦恼，你看他这性格上你有什么可烦恼的？就这么点小事，有什么可烦恼的？人家说你站着说话不腰疼，对吧？那你修行过后的人怎么讲啊？先讲讲。讲讲道理，对吧？用你的智慧、方法讲道理，你有什么可纠结的？有什么可执着的？同样的话他感受到的一不一样？一个有灵魂，一个没灵魂。我们再举个例子，这同样说当下我们说没没赚到米啊，一个人他压根没能力赚到，一个人是我有能力赚到，但我不需要。他跟第三个人交流的时候，第三个人可不可以感受得到？听第一个讲瞎了，听第二句。哎呦厉害，高人呢？插在那儿的。所以他没法用。我们说你看是道也何足。勋章本来就是这个样子的，本来就心大，本来就没有那么多的烦恼，怎么能称道成善呢？他没有经过修饰的，没有经过学习的、没有智慧的。所以我说真的要感谢这位美女啊，他身上所展现出来的问题，让我们今天可以聊到这个话题，这个话题真的太妙了。生活当中无论你是什么样的性格，你去思考这段话都很妙，这就是修行的意义和美妙之所在啊。我们再举个例子啊，你看，比如说我这里收的。每个常驻地址吧，他身上都有一个质的东西，但是如果他是没有经过修行的，那个道心没出来就没法用，就会落入完空。我举个例子啊，比如说加寒，我经常说这孩子相当之有担当、有奉献精神，身上有侠女的风范，你看这是它本质那个东西。但是任何事情都是两面性的，当他有这些品质的时候，是不是他的性格就会过于生硬啊？过于扎人？那个时候我形容家寒，我说他刚来的时候像一匹野马背着一个刺猬跑，见谁扎谁，就这个刺可以飘出去三丈开外，就这么厉害。但是注意啊，修行以后，他把这个东西。拔掉了磨掉了，这个人好不好用？好用吗？他有那种担当仗义的精神，这种奉献付出的东西他有力量，你看这个时候是不是就能用了？而且还能看大用呢？但是一个本来就没菜的人行不行？还行，不好用，没法用。所以看似一样培养他。这个时候你看他把这个刺拔掉以后，是不是用之则行，舍之则藏？你说人没有这个刺能做成事情啊，做不下来，唯唯诺诺的人能做成事情吗？能去担当，能去奉献吗？能有这种仗义的精神吗？没有的。我再举个例子哼。然后呢大家熟知的孙静同学、孙经同学天生有优势啊，亲和力好，从小孙宁就说坐在墙根跟老太太聊天长大的，你看，所以他就爱聊天。现在亲和力也好，愿意跟别人聊家长里短的事情。那你看他这个东西如果不经过修饰的，行不行？不行。有这聊没这聊不行，但是它经过修以后，哎呦这个东西厉害了，他天生就喜欢聊天，它可以解决很多人的问题和烦恼。出来了。所以这就是修行的妙了。我之前一直跟大家讲啊，我以前性格是非常急的人。甚至可以用暴躁来说很急。那经过修修修修诶能用。你想一想，如果一个人性格当中没有极没有雷厉风行，哪来的破裂？你什么敢做呀？真的不敢坐。但是魄力又不等于冲动，这个时候用之则行，舍之则藏。好，我们再举个例子啊，今天就弟子专场吧，比如说坐在面前的刚才大家看真好看的婷婷。好啦，比如说婷婷，婷婷这个人呢嗯国学综合素养很好，什么都会，什么都懂。但是以前。能用，这个人没修好没修好，那颗道心、那颗利他之心、那个担当精神没修出来，你会发现你会很多东西其实反而是一无是处，那这就是道的两面性。可是他这个东西一旦修好，你会发现这个人干什么什么行，干什么都可以拿得起来。所以呢我们要经过为什么我们说一定要学习儒家文化，要学习论语的，要不然你本来那个特质你用不出来。你想一下，我们生活当中真的有很多人的本质特别好，比如说有的人聪明，比如说有的人有灵性。比如说有的人口口才好，比如说有的人敢担当，比如说有的人胆大，这都是优势。可是要没有经过修身，他用不到正地方啊。举个例子说一个孩子很聪明，可是这个时候你要没给他建立内在的仁义道德，他聪明是不是往往会害了自己啊？但是如果你给他建立这些以后，他的聪明会转化为智慧，那是他生而知之的部分。那好了，我们再说刚才这位这位姑娘，你看他人家天生心大，没有那么多烦恼，没有那么多忧虑，如果他一旦学得好、修得好，他本来就没有烦恼，是不是在用这些智慧和知识可以帮助很多人的？他比很多人少走了一大段路啊。就是很多人还在解决自己的烦恼、困惑、执着、纠结的东西，而他不用，但是他如果没修好，没把这个地方补全，说话伤人的说话有道理，但是不找人听的。我们再反复地讲这一段，这段真的很重要，当我们听懂了之后，就该知道怎么修自己，怎么培养孩子，怎么看别人的优点。那我们再来看论语啊，你看孔夫子弟子三千七十二圣贤，孔夫子何曾改过弟子们的性情和性格呢？没有吧？子路还是子路？颜回还是颜回？子贡还是子贡？子由海。是自由，但是内在的这个文这个修养有了，再加上它本质的这个东西，文质彬彬，然后君子。我们再讲一句话，今天我跟涵涵江涵，我们在爬山的路上，我们讲了这段话，我说我们常说江山易改，本性难移。嘉涵就问我：师傅呢，那我这性格怎么移？我说：你为什么要移呢？他愣了一下，我说你不用，一看用在哪里？看怎么用啊？哎他说我懂了。对呀，你姨她干嘛呢？你把它内在的那个文的部分，内在的修养的那个部分给它补齐，你看它是不是就有正用了。我们举个例子啊，说我们看这种古装剧吧，一个人武功高强，如果他没有侠义之心，这是内在的，没有这个东西是不可能为祸武林的。但是有了这个东西是吧？行侠仗义啊，你何必要改它本身武功高强这件事情呢？对，你比如说子路果敢，你改他国干干嘛呢？你也改不了啊，但是内在的道德修养有了，人家从众去了，人家可以治理千胜之国呀。所以你看整个儒家文化从来都没有告诉你改变性格，都在告诉你建立内在的仁、义、礼、智、信。改变我们的认知、改变我们的思维、改变我们的心念、改变我们的行为性格。不用动，你还是你。哎这个时候文质彬彬了，德才兼备哦。啊我们再讲个道理啊，比如说所以董新二在这里吗？比如说这段话讲给你的注意听啊，比如说星儿留他在这里当。鞠躬，我就待一段时间看看怎么样吧。比如说这个人他很踏实，很尴尬。你说让这个人变聪明、口才伶俐，可能吗？太难了，几乎不可能。但是这样的人难道就没用了吗？合适。他如果内在的这个修为、这个利他之心上来了，可不可以啊？可以呀，他就可以做很多踏踏实实的，别人做不了的事情，可是如果他这个内在没修上来，没法用，用不了。就他既不踏实，还得好高骛远，还得去看别人干的东西我能不能干，完了不能用了。我们再举个例子，这里的宋姐大家都知道，每个人来都说从宋杰身上学到了很多东西。那你看宋杰阳光、快乐，愿意给大家做饭，愿意付出。好了，这是他的本质上的那些东西，他天天跟在这里学习儒家文化，听论语是不仁义道德都有了，好不好用？如果没这个东西好用吗？它即使会做饭又如何呢？会做饭的人多了，但没有这个东西它能做好饭吗？那天那个胖哥哥不是问宋杰吗？一百顿的饭怎么做？速其味而行啊。你太有哲理了，做饭和中庸怎么有关系？太有关系了。所以你看咱们这里留义工也好，留弟子也好，留什么样的人？悬起。其本质而不是财啊，才没用的，有多少个人是有才的？想留在这里，留部下，你没有那个本性的东西，那个东西或者不足，你只有财有什么用啊？所以我们学习完论语之后，你是不是就知道怎么识人、怎么取人、怎么培养人呢？清清楚楚了。所以我们说半部论语治天下呀，你真把论语的思维和他自己的取人和修身之道学来了，哎呦太美妙了，里面的东西处处可用啊。你看我们有了论语的思维，我们是不是知道怎么培养孩子了呀？从小我们教给他是他的认知，是他的思维模式，是他去怎么看待这个世界。这个孩子就变得不一样了。你可能有点一知半解哈。啊那就好了。内修。然后就因为是我我因为是刚开始接触也没学。嗯是的。嗯行，跟一跟吧，你把论语要跟上，我跟你说这个人可以的。哦我先说人鱼哈。哎你就学论语就好了，你就抱着这一个，你要把它学明白了，因为它有天生的优势，它有生而知之的部分，只不过现在没发挥出来。嗯啊好聪明啊，所以我们是不是得感谢他？真的要感谢他，所以他聊了这样一个事情，我们看到他身上的问题，你看我们再来用论语的思维跟大家讲这其中的道理。修行的美妙就在这里了。所以你看我们是不是先取中，我们说快的你修慢，慢的你修快，太强硬的你修温和，太温和了你修点强硬。诶当你取到钟以后就可以用之则行，舍之则藏。所以我说学论语太好玩儿了，就是你生活当中、生命当中的事情，你去挨个对照的，哪里都能用。我喜欢中庸。论语当中，我们在延伸的部分，处处都在讲中庸之道啊。</div></div>"
  }
]