[
    {
        "title": "【病苦】-佛教如何看待病苦",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>病苦</h2>\n<p>　　病苦（vya^dhi-d.）∶指由四大增损而引起的病患苦恼。北本《<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经》卷十二云∶‘病谓四大毒蛇互不调适。’盖病有身病及心病二种。身病是色阴之病，乃四大不调所致，有因水风热产生，也有因杂病或容病等产生。若地大不调，则举身沉重；若水大不调，则举身胖肿；若火大不调，则举身蒸热；若风大不调，则举身倔强。所谓容病，是指遭遇刀杖之难、为鬼魅所附等。心病是指恐怖、忧愁、愚痴等，一切心理上的苦恼。</p>\n<p>　　人自呱呱堕地之日起，就与病结下不解之缘。少年的病如天花麻疹，中年的病如胃溃疡肺结核，老年的病如高血压心脏病，也许有人说，科学进步，新药日出，只要有钱，何愁治不好病？其实不然，特效药固然层出不穷，新的疾病也日有所见，如小儿麻痹症，癌症，在近年来日渐增多。进一步说，即是药物能治愈身体上的疾患，但由于社会竞争剧烈而致精神紧张憔虑所引起的神经衰弱，精神分裂，<a href=\"/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>狂，躁郁狂等心理上的疾病，又岂是药石所能奏效的？</p>\n<p>　　本来四大假合之身，难免有寒热失调的时候，病了，就要躺在病榻上挨受痛患，短时间还好受，倘长年缠绵病榻，日与药物为伍，这种<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，岂可言喻？</p>\n<h2>转病苦为道用的具体修法（转自<a href=\"/fjrw/zcrw/cichengluozhukanbu/\" class=\"keylink\" target=\"_blank\">慈诚罗珠堪布</a>开示）</h2>\n<h3>　　具体的修法包括三个部分：</h3>\n<p>　　（一）视病痛为功德，从而清净罪业；</p>\n<p>　　（二）视病痛为善知识，认真取舍因果；</p>\n<p>　　（三）视病痛为<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>顺缘，促进六种波罗蜜多的修习。</p>\n<p>　　当我们生病的时候，要这样去思维：从无始以来到今天，每个众生都在充满痛苦的轮回中不由自主地<a href=\"/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>不止。我在前几天也讲过，不论是从宏观的角度而言，或是从轮回的每一个阶段、每一个细节的角度而言，轮回都是充满痛苦的。</p>\n<p>　　在这种痛苦的环境下，如果是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>徒，还要好一点，虽然我们现在还没有彻底地<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，但毕竟已经开始思维轮回的痛苦，并开始为摆脱痛苦而努力了。然而，对于不<a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的普通众生来说，虽然不情愿轮回，但在轮回的当下，又不会去思维轮回的痛苦，一直都认为在这个轮回当中有什么幸福、快乐可以追求。如此一来，就会将全身心都投入其中，拼命地追求轮回当中的幸福和快乐，但是，由于轮回本身就不存在什么幸福和快乐，所以，想从中获得幸福和快乐，纯粹是缘木求鱼。要知道，所有为了在轮回当中获得幸福所做的一切努力，最终都是没有结果的，我们应该做一些真正有意义的事情。</p>\n<p>　　那么，什么是真正有意义的事情呢？那就是修行。除了修行，再没有什么真正有意义的事情了。这个道理，是很多人不了解，同时也不以为然的。</p>\n<p>　　当然，每个人看问题的角度都不一样，每个人都有各自不同的主观认识，所以不可能所有人的看法都一致，但是，无论这么认为也好，不这么认为也好，轮回本身的真相就充满了痛苦，它的本性就是这样。它的真相不会随着人的主观意志而改变，除非是通过修行从轮回当中解脱，否则它永远都是痛苦的，因为它的本性永远不会有什么改变。</p>\n<p>　　但是，有很多人却并不这么认为，他们认为：轮回当中有幸福、有快乐，充满了可以追求的目标，因此，他们就会把所有的精力、所有的时间，都花在努力获得轮回当中的幸福上面，其它诸如解脱、修行等等的事情，却一点都不去想。我们前面也分析了，轮回本身就不存在什么幸福，既然如此，又怎么可能从中获得幸福呢？这是根本不可能的！我们从无始以来到今天，所有花在这上面的时间和精力都白费了，只有依靠修行而令自他脱离轮回，才是我们的当务之急。</p>\n<p>　　那么，现在我们应该怎么办呢？</p>\n<p>　　就是利用一切机会，哪怕是在生病的时候，也要抓住时机精进修行。</p>\n<p>　　生病的时候怎么修行呢？</p>\n<p>　　首先，就是要了知病痛的功德。病痛是大家都不愿意接受的，它还有什么功德可言呢？它还是有功德的。对于一个修行人，一个希求解脱的人来说，病痛也有很大的功德，而且是<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>所谓的幸福、快乐所无法取代的功德。</p>\n<p>　　这个功德是什么呢？</p>\n<p>　　第一个功德是：虽然我生了病，在肉体上感受到了一定的痛苦，但是，如果不是这场比较严重的病来警告我，也许我永远都不会去思维人生的痛苦。以前我也知道有生老病死，却没有这么深刻的印象和体会，以致于把病痛、轮回的痛苦都忘了，一直不断地往外追求，从来也没有为了解决自己的生老病死而修行过。</p>\n<p>　　第二个功德是：如果我一生都没有病痛，一直都很<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>的话，那我根本就不会认识到轮回是这么痛苦；如果我不认为轮回是这么痛苦的话，则修行最根本、最基础的出离心就绝对没有办法培养起来。</p>\n<p>　　通过这次生病，让我亲身经历了生老病死的其中之一，我终于深深地体会到：原来人生是如此的痛苦！如果不能彻底获得解脱，在以后漫长的轮回过程中，像这样的痛苦还会经历无数次！</p>\n<p>　　即使我这次生病能够痊愈，但也并不代表我以后就不会再生病，就永远解脱了，在以后的生生世世中，我还会再生病，还可能会生更严重的病。此时此刻，我们就会开始感觉到，轮回不是那么完美，人生也不是那么完美。于是，我们才会开始寻求解决生老病死的方法。</p>\n<p>　　在整个世界上，唯一可以解决生老病死的方法，就是<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。其他世间的任何学问——哲学、科学等等，都没有办法彻底解决这些病痛。众所周知，科学家们也会生病，最后也都会死去，甚至有些科学家最后会死于精神分裂症，或者是科学至今无法攻克的癌症，因为他们也是普通凡夫，所以在生病的时候，也不会有什么解决办法。</p>\n<p>　　通过这样的思维，我们的眼光自然而然地就转到寻求解脱、解决生老病死的问题上面来了，因此，生病正是培养出离心的一个大好机会。这些都是病痛的功德，病痛确实也有这样的功德。</p>\n<p>　　尤其是对讲经<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的法师，修断法（即古萨里修法）的<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，或是其它的修行人而言，生病还是检验修行功力的最佳时机。</p>\n<p>　　在平时没有遇到任何痛苦，一切都很好的时候，我们总是劝别人要修行、要如何如何……，一直自认为自己是一个修行人，并觉得自己很不错等等，但自己究竟是不是一个真正的修行人呢？这次就可以见分晓了。</p>\n<p>　　如果我们在病痛的折磨下，也能真正用上前面的那些修法，那就可以自称为是修行人；否则，如果发现自己并没有承受病痛的能力，这次病痛就成了一种警告，它告诉我：现在你连面对一个这么小的痛苦都没有办法，可见你的修行程度还不够深，你以后不能老是原地踏步，一定要继续往前努力，一定要修行！一定要进步！</p>\n</div>"
    }
]