[
    {
        "title": "【比丘尼】是什么意思？是哪类人的称呼？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x6BD4;&#x4E18;&#x5C3C;&#x3011;-&#x4F5B;&#x6559;&#x6BD4;&#x4E18;&#x5C3C;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022304962.jpg\" /></p>\n<h2><a href=\"/rmgjc/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>尼，梵文 Bhikkhuni 又作苾雏尼、比呼尼、尼、除女、董女、<a href=\"/rmgjc/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>尼，俗称尼姑。满二十岁<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，受了具足戒的女子，称为比丘尼。中国第一个比丘尼是净检。在东晋升平元年（三五七年）受了具足戒，正式成了比丘尼。</p>\n<h2>记载</h2>\n<p>　　依《大爱道比丘尼经》所载，比丘尼的出家，始于<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>的姨母摩诃波阇波提（大爱道），她誓守八敬法，而被允许出家<a href=\"/rmgjc/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。在我国，依《比丘尼传》卷一所述，西晋建兴年间（313～317），尼僧净检从西域沙门智山剃发、受<a href=\"/rmgjc/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>。升平元年二月（357），请昙摩羯多立比丘尼戒坛，净检等三人共于坛上受具足戒，这是我国比丘尼的开始。在日本，司马达等之女善信等人从高丽僧惠便出家，后至百济受具足戒，是其滥觞。</p>\n<p>　　关于比丘尼的戒律，在佛灭后、部派分裂以前，教诫极严。至部派分裂再分裂后，对比丘尼较为放宽。然而，因相传女人障重，故戒条亦多，依《四分律》所载，比丘须守二五〇戒，比丘尼则须守三四八戒。</p>\n<h2>我国历史</h2>\n<p>　　在我国佛教史上，比丘尼之贡献虽不如比丘之多，然其中亦不乏戒行精严、学优行粹之<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者。依《比丘尼传》书中所载，由晋代迄梁武帝之间，我国佛教界即已有不少杰出之比丘尼。如道容‘戒行精峻’（卷一），令宗‘学行精恳，开览经法，深义入神’（卷一），慧果‘常行苦节，不衣绵纩，笃好毗尼，戒行清白’（卷二），慧耀甚且烧身以供养三宝（卷三），凡此皆足令人钦仰。</p>\n<p>　　古代世俗女子虽有读书识字者，然真能登台讲说者则极少见。《比丘尼传》书中所载之比丘尼，则颇有能登台讲解经律、著书立说者。晋穆帝时，妙相‘每<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>度人，常惧听者不能专志，或涕泣以示之’（卷一）。齐武帝时，昙彻‘才堪机务，尤能讲说。剖毫析滞，探赜幽隐。诸尼大小，皆请北面’（卷三）。智胜研读律藏，‘自制数十卷义疏，辞约而旨远，义隐而理妙’（卷三）。由此诸例，可以窥见比丘尼在我国早期佛教史上地位之一斑。</p>\n<p>　　至于二十世纪的后半阶段，比丘尼也是台湾佛教的中坚分子。不唯人数远较比丘为多，且颇多能独当一面，弘法利生者。如证严创办慈济功德会，兴办大型医院及大学，其弘<a href=\"/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>业规模之大，为前此之台湾所未有。恒清为美国威斯康辛（Wisconsin）大学博士，身任台大哲学系教授，且掌理法光佛教文化研究所，对台湾佛教高等教育有相当程度的影响。其他方面之杰出比丘尼，在台湾亦为数甚多。种种迹像皆显示出，在现代台湾佛教僧团里，比丘尼有相当重要的地位。</p>\n<h2>历史故事</h2>\n<p>　　比丘尼，是出家修行的女教徒，讲求六根清净，<a href=\"/rmgjc/sidajiekong.html\" class=\"keylink\" target=\"_blank\">四大皆空</a>，与朝廷素无瓜葛，但明朝的比丘尼却遭受到了前所未有的侵扰和追捕。永乐十八年(1420)，明成祖朱棣突然下令，将全国所有的比丘尼以及女道士，统统逮捕送到京师逐一审问，验明真实身份。这场史无前例的大索天下比丘尼案，既打破了<a href=\"/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>千年来与世无争的静雅，也让后人感到莫可名状的疑惑。那么，朱棣为什么要捕捉天下比丘尼呢？</p>\n<p>　　而事情的起因，却是一场发生在山东境内，由唐赛儿(女)领导的农民起义运动。据《<a href=\"/ctwh/ershisishi/mingshi/\" class=\"keylink\" target=\"_blank\">明史</a>》及清代有关野史杂钞记载:唐赛儿于永乐十八年二月，在家乡蒲台(今山东滨州)聚集数千白莲教徒，以红白旗为号，揭竿而起，对抗朝廷。这场发生在山东境内的农民起义，因为规模小、持续时间短，且没有震动明朝政权，所以连历史教科书上没有记述，但当时的皇帝朱棣却“甚为震惊”，不但派出了“京营”五千精锐人马，还把正在山东沿海“抗倭”的军队，也用在了镇压这场农民起义上面，很有股子“攘外必先安内”的架势。</p>\n<p>　　朱棣为何如此兴师动众?据笔者分析有以下原因。其一，起义发生在“迁都北京”前夕，直接影响到皇帝的“形象工程”和“政绩工程”，朱棣决不允许在这种时候出任何乱子;其二，起义军以“白莲教”为依托，教徒对唐赛儿死心塌地，惟命是从，朱棣决不允许“邪教”蛊惑民众;其三，起义军队伍不断壮大，屡败官军，且唐赛儿对于朝廷的招安不理不睬，使朝廷和朱棣颜面扫地。种种原因，使朱棣对唐赛儿分外仇恨，对起义军进行疯狂镇压。因为寡不敌众，腹背受敌，起义军只坚持了三个月就失败了，但唐赛儿却下落不明。</p>\n<p>　　为了消除心中忿恨，为了防止死灰复燃，为了能够杀一儆百，朱棣下令严察唐赛儿的行踪，但搜捕工作没有任何进展。民间搜不到，朱棣决定调整工作重心，把搜捕唐赛儿的重点放到了佛门。朱棣之所以这么做，笔者认为有以下原因:一者，搜捕人员为了推卸搜查不利的责任，有可能以唐赛儿入佛门来搪塞朱棣。二者，佛门<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>远离世俗，官府一般不介入，唐赛儿兵败后极有可能混入佛门避难;三者，唐赛儿起义时，曾自称“佛母”，朱棣以此认为唐赛儿与佛门有着某种关联。史料中也有相关记载，朱棣因“唐赛儿久不获，虑削发为尼或处混女道士中，遂命法司，凡北京、山东境内尼及道站，逮之京诘之”。</p>\n<p>　　于是，朱棣下令将北京、山东的比丘尼、女道士统统逮捕，押送朝廷审讯。同年七月，朱棣又命段明为山东左参政，继续搜索唐赛儿。段明为了完成这一任务，不仅把山东、北京的比丘尼逐一搜查，全部捕捉，甚至还逮拿了全国范围内的数万名出家妇女。关于此事，《明史》也有简单记载:永乐十八年二月，山东蒲台唐赛儿反，唐赛儿不获，溟逮天下出家比丘尼万人。一直到朱棣病逝，他一心想捉拿到唐赛儿的愿望也没能实现。明朝强大而又严密的特务、巡察机构，在捉拿唐赛儿的问题上，因为不得民心，即使想出通过捕捉天下尼姑的荒唐、极端的办法，最终也无济于事，得到的结果是“赛儿卒不获，不知所终”。唐赛儿究竟哪儿去了?多少年来，不少历代史学家，为了寻觅这位巾帼英雄的最后归宿，穷经皓首，至今仍无定论。</p>\n</div>"
    }
]