[
    {
        "title": "不二法门",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　不二法门（bu er fa men)，佛家用语，指平等而无差异之至道，今用以称独一无二的门径、方法。法门：指<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>入道的门径。原指不靠言语传授，只靠内心思考求得大彻大悟的<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>门径。后指最好的或独一无二的方法。</p>\n<p>　　语本《维摩诘经·入不二法门品》：“如我意者，於一切法无言无说，无示无识，离诸问答，是为入不二法门。” 唐裴漼《少林寺碑》：“ 空心 、 元粹 、 惠性 、 淹远 ，传不二法门，有甚深道业。”</p>\n<h2>简介</h2>\n<p>　　佛教用语，指显示超越相对、差别之一切绝对、平等真理之教法。即在佛家八万四千法门之上，能直见圣道者。维摩经入不二法门品载有三十三种之不二法门。今之俗语多援引佛教‘不二法门’一语，转指学习某种学问技术唯一无二之方法。</p>\n<p>　　在佛教中，对事物认识的规范，称之为法；修有得道的<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>都是这里证悟的，又称之为门。佛教有八万四千法门，不二法门是最高境界。入得此门，便进入了佛教的圣境，可以直见圣道，也就是达到了超越<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>的<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>境界。从佛教哲学观来看，“不二”即是“非此非彼又即此即彼”、“众生平等”、“自他平等”、“心佛平等”等，是佛教认知世界万事万物的方法与观念，演绎阐述的是<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>万物本质与表象的关系。</p>\n<p>　　《维摩经所说经》记载：问文殊师利：“何等是<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>入不二法门？”文殊师利曰：“如我意者，于一切法，无言无说，无示无识，离诸问答是为入不二法门。”文殊师利问维摩诘：“我等各自说已。仁者当说，何等是菩萨入不二法门?”维摩诘默然不应。文殊曰:“善哉善哉。乃至无有文字语言，是真入不二法门。”[2]</p>\n<h3>　　不二法门</h3>\n<p>　　不二之法门也。不二之理，佛道之轨范，故云法。圣由之趣入，故云门。佛教有八万四千法门。不二法门，在诸法门之上，能直见圣道者也。维摩经载文殊师利问维摩诘：何等是不二法门？维摩默然不应。殊曰：善哉善哉！无有文字言语，是真不二法门也。肇曰：言为世则谓之法，众圣所由谓之门。十二门论疏上曰：‘净名以理为门，一道清净，故称不二。真极可轨，所以云法。至妙虚通，故云门。’见不二条。</p>\n<h3>　　什么是“不二”</h3>\n<p>　　一实之理，如如平等，而无彼此之别，谓之不二。菩萨悟入一实平等之理，谓之入不二法门。维摩经入不二法门品说三十三人所得之不二法是也。维摩经入不二法门品：‘什曰：有之缘起，极于二法。二法已废，则入玄境。肇曰：离真皆名二，故以不二为言。’大乘义章一曰：‘言不二者，无异之谓也，即是经中一实义也。一实之理，妙寂离相，如如平等，亡于彼此，故云不二。’十二门论疏上曰：‘一道清净，故称不二。’</p>\n<p>　　不二：世间万物千差万别，皆是相对而论，其实没有什么不同。</p>\n<h3>　　来源</h3>\n<p>　　据说佛家有无量法门，而不二法门为第一法门，人一旦进入门，就是进了超越了生死的涅境界便可以成佛了。当然这只是从思想境界上而不是从空间上来说的。法门可以理解为一种门道或途径，所有修行的人只要依着这样的途径去不断修行便可以获得正果。既然说它是一种思想境界，它又体现了什么样的思想呢？不二是一种非常深奥的理念，也不是我们言语可以说清楚的，简单的说，不是一，不是二，没有彼此的分别就是不二。佛教认为世界上的万事万物尽管在现象上有千差万别，但从<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>上来看都是没有分别的，只不过是因缘凑合，都是虚无的，没有相对，也没有绝对。</p>\n<p>　　传说古印度有位叫维摩诘的人，他是释迦牟尼门下著名的<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>，也是一位在家菩萨，维摩诘与其他菩萨不同的是，其他菩萨都没有家室，而维摩诘却不仅有娇妻美妾，而且拥有大片的庄园田地，是当地的一位富翁，但他即虔心侍佛，刻苦修行，同时也积极参加世俗的活动，他这种即<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>又不出家的举止实在令人捉摸不透。有一次他声称病了，释尊便派<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>文殊等前来探病，与他进行了一场<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>真理的大辩论，维摩诘以他高深的佛学底蕴和超人的口才回答了众人的提问。他认为只要心中清净，佛土也就清净了，虽然他有眷属良田，但他的心却不为贪念所蒙蔽，虽然他的行为不同于其他菩萨，但他实在是在追求佛道真理。所以一切都不必拘于形式，而在于自己内心如何把般若智慧运用于<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中去，于是他便证实了出家和在家的不二。谈到最后，<a href=\"/fjrw/zhufopusa/pusa/66965.html\" class=\"keylink\" target=\"_blank\">文殊菩萨</a>又问维摩诘：“那么你认为到底什么才是不二呢？”维摩诘听后闭上了眼睛，什么是也不说。文殊赞叹道：“妙啊，没有文字、言语者是真正的不二。”</p>\n<p>　　佛家不二法门文化，其中主题人物是维摩诘菩萨，佛家大乘经典《维摩诘所说经》，共十四个章节四万字。</p>\n</div>"
    }
]