[
    {
        "title": "禅坐",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p>　　谓<a href=\"/rmgjc/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>端坐静修。 唐 王维 《过福禅师兰若》诗：“欲知禅坐久，行路长春芳。”</p>\n<h2>基本禅坐</h2>\n<p>　　拼音：chán zuò</p>\n<h3>　　【词语解释】</h3>\n<p>　　『禅』是宇宙中一切万物的真理、生命和智慧。包括大自然界中所有的生物与非生物，以及宇宙万物，它们的生命变化、智慧、能力、生态…等等，统统都属于禅的范围；大如行星，小至细沙，当然也包括了人类。</p>\n<p>　　比方说人与人之间有很多离不开的关系；人与天气、地理以及大自然界也是分不开的。因此『禅』的意义整体而言，使指整个宇宙万物是「一体」的。</p>\n<p>　　广义的『禅』是宇宙「纯真」、「至善」、「完美」的境界，具足<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>与<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。在于人就是真、善、美的<a href=\"/rmgjc/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>由『禅』而来，人可以因禅的力量而超越凡夫，进入圣境。</p>\n<p>　　禅的特质是一种「大自然性」，比方说，大自然中的每一种生物既然是生存在地球上，它就有它生存的空间，而且希望都能欣欣向荣，尤其人类是地球上的主宰者，他就更应该发挥人类高超的智慧及爱心来照顾大自然的环境，这就是禅的特性，就像太阳系这个星系的星球一样，地球是围绕著太阳在运转，月球则是绕著地球在运转；都有一定的规则；而这个规则就给人类一个启示及一种警惕，也就是人在社会上是一种大自然性，是一种自然法则性，而且它是充满了和平、自然的。</p>\n<p>　　一个懂得抓住『禅』之精神的人，每天都很愉快，没有烦恼，而且不做作，待人很诚恳，当然别人都喜欢和你做朋友。</p>\n<h3>　　修禅原因</h3>\n<p>　　『禅』是每个人天生就具有的智慧，是<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的指南。因为人自懂事以后，始终就为生活而忙忙碌碌，身心都被这些外来的人事束缚得紧紧的，造成自己生活的空间越来越小，甚至忙到身不由己，到最后又是一无所成，这就是人生的<a href=\"/rmgjc/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。</p>\n<p>　　我们如何找回自己呢？只有在禅坐中，当你的身心静下来，那份安详、宁静，属于你自己<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>的空间，才能真正找到自己。虽然它是一片空白，但也只有在这空白的意识中，才能珍惜自己存在的可贵；当你有这样的开悟，智慧就在此成长，你才能放下人<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>一切束缚，找回自己的生活空间，这就是你已经找到了幸福。</p>\n<p>　　我们从禅修中，身心会达到平衡点，也就是身体和心理会产生变化，从内分泌的协调到身体及精神体的清净，会使我们很自在，不会再为人世的俗念而执著，也就是对生活中的人、事、物，不会很固执的当作是自己所拥有的，心不会再受到五官六识的引诱而迷失自己。当你有这样的开悟，一切会放得开，就能活得自在；不管在哪个环境中，都能以平常心去<a href=\"/rmgjc/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>，心中时时充满知足与法喜。所以禅修者说，吃饭、睡觉、工作、洒水、扫地即是『禅』，也就是说他们心中无所求，任何环境都是出自于自然的情况而作的，那种安详和满足的心境，叫做“禅”。</p>\n<p>　　凡是经过禅修以后，对自己有了悟性，经过开悟之后，会知道在生活中如何尽自己的本份，做自己该做的事，然后会很自在，很圆满，很有乐趣的，这才是真正的<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>；不是什么事都不做，这样心理反而始终牵挂，心放不下，就是迷失。</p>\n<p>　　只有从禅修中，才能深知平凡的可贵，一个人生活在平凡之中，才能体会人生的本质，也才能珍惜自在的清净。在平凡之中不受任何压力，才能让自己随心所欲，做自己必须要做的事，这个平凡－就是『禅』。</p>\n<p>　　所以说，『禅』是智慧，是人生的指南；生活中没有『禅』就失去人的可贵。修禅除了让我们获得一份自在圆满的心灵之外，在人生的<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>中『禅』还能点燃我们心灯，提升人格层次，所以人应该要修禅。</p>\n<h3>　　<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>特性</h3>\n<p>　　我们的自性本来是个清净的灵光体，却被自己的身体、心理与潜在意识产生的业力所覆盖。<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>就是要突破「色身（生理）、意识（心理）与业障（潜在意识）」这三大障碍，让自性回复原有的光明。</p>\n<p>　　如何突破这三大关卡？一定要靠禅定。因为在禅定中可以超越生理、意识及潜意识的层次，直接进入到心灵的智慧境界，那是一个光明的世界，无法以人脑想像，惟有在进入禅定之后才能够显现。</p>\n<p>　　也许有人会问，为什么很多修行人修了半天却不能成就？那是因为他们用知识、用头脑、用「人」在修，所以再怎么修，也是那些知识。修<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>是要修灵性，解脱自在，可是灵性看不到，如何修呢？就是要靠禅定。</p>\n<p>　　观自在<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>在《<a href=\"https://www.guang5.com/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">心经</a>》上说：「行深般若波罗蜜多时，照见<a href=\"/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>皆空，度一切苦厄」。所谓「行深」，就是禅定、深定。观自在菩萨在禅定中发现，当五蕴皆空－也就是「<a href=\"/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>」的时候，一切的烦恼与<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>就解脱了，观自在菩萨就是在定中得到这个清净的大智慧而证得大自在成就。</p>\n<p>　　在禅定中，你的心会更坚固，同时智慧也会持续成长。你将会发现自己的本性发出光芒，也能体会出这种自性本体的光芒是来自何处，你也会明白，原来每个人都有同样的灵光，而且都来自同一个生命本源。当你见到自性后，慢慢会见证到这种宇宙万物一切平等的法性，而不会处处只想到自己的利益；此时的你，所想的、作的，就是一个大菩萨的作为。如果真正得到这种力量与智慧，等于已经成就一半了，在这一生一定可以成就无馀<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。</p>\n<h3>　　准备步骤</h3>\n<p>　　在开始学禅坐之前，先要了解一些基本常识：</p>\n<p>　　肚子六分饱：饭后一小时再打坐，而且不要吃得太饱，约五、六分饱即可。因为少吃一点，可以让肠胃有更多的空间来装灵气；如果吃得过饱，胃里充满浊气，不但人会昏沉，打起坐来也容易睡著。至于饮食的内容则以清淡为主，不要太油腻。</p>\n<p>　　自在<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>心：在心情方面，一定要很法喜、很自在。如果正在<a href=\"/rmgjc/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>或是心情不好、不愉快的时候，就不要坐。因为即使勉强去坐，效果也不佳。</p>\n<p>　　疲累去休息：身心疲累的时候也不要坐。因为疲累的时候打坐会打瞌睡，达不到禅坐的效果。如果觉得累，还是赶紧去睡觉。</p>\n<p>　　何时禅坐佳：什么时候打坐最好？基本上，随时都可以；但晚上十二点以后到第二天清晨五点之间不要坐，因为这是睡眠时间；该休息的时候就应该去休息。</p>\n<p>　　环境要通风：禅坐的地方最好要通风良好，但要注意风不可直吹后脑，否则后脑会胀痛。另外光线也不宜太强或太暗。</p>\n<p>　　服装宜宽松：打坐的服装以宽松为宜，女性应避免穿短裙，以免姿势不雅。</p>\n<p>　　眼闭心法喜：打坐时，虽然眼睛轻闭，但还是要保持法喜的面容，不要一付愁眉苦脸、痛苦紧绷的样子。</p>\n<p>　　每日一禅坐：最好养成每天禅坐的习惯，一段时间后，自然能体会出禅坐的好处。</p>\n<p>　　禅坐是一件很快乐的事，若是能在禅坐之前做好这些准备，以很轻松的身体、很愉快的心情来坐，就已经向入定的阶段迈进了一步。</p>\n</div>"
    }
]