[
    {
        "title": "禅思（佛教名词）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x7985;&#x601D;&#xFF08;&#x4F5B;&#x6559;&#x540D;&#x8BCD;&#xFF09;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022339839.jpg\" /></p>\n<h2>禅思（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　有两种性质的禅思。一种是心智集中的开发（奢摩他或三摩地），亦即专精一心（心一境性）。借着经中所述的各种方法，引导上升至于最高的神秘境界，诸如：“无所有处”或“非想非非想处”。所有这些神秘的境界，根据<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>所说，都是心造、心生、因缘所成。它们与实相、真理、<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>无关。这种性质的禅思早在佛陀之前就已存在了。虽然它不是纯粹的佛教，但它也不被排除在佛教的禅思之外。然而，它并不是体证涅弊所必要的。佛陀本身在他正觉之前，曾在不同的老师之下修习这些瑜伽禅，并达到最高的神秘境界；但他并不满足，因为它们并未能给他完全的<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，它们并未具备证入最终实相的内明。他认为这些神秘的境界只是“此生存在的快乐<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>”而已，或者是“安详的生活”而已，如是而已。</p>\n<h2>心智的修习</h2>\n<p>　　佛陀说：“<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>们，有两种疾病。那两种呢？身体的疾病和心理的疾病。有些人似乎一、二年 ……甚至一百年或更多年，身体都不会生病。但是，比丘们，在这世界上，除了那些解脱烦恼的阿<a href=\"/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>之外，就很少有人的心理上能够片刻不生病的了。</p>\n<p>　　佛陀的教导，尤其是他的禅思方式，目的就在产生一个完美的心理<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>状态，平衡而宁静。不幸的是，佛陀的任何其它教导，几乎没有像“禅思”那样，受到佛教徒和非佛教徒的误解。当提到“禅思”的时候，就会让人想到逃避日常生活，采取一个特殊的姿势，就像在远离人间的洞窟里或寺院龛室里的一座雕像一般，沈思默想着，或专注于某种神秘的思想或恍惚状态中。真正佛教的禅思，全然不是这类的逃避；在这个主题上，佛陀的教导如此地被误解，甚或极少被了解，所以到了后来“禅思”的方式就退化了，几乎堕落成为一种例行技术性的仪式或典礼。</p>\n<p>　　大部份的人对禅思或瑜伽感兴趣，是为了要获得某些灵性的或神秘的力量，例如别人所没有的第三只眼。不久以前，印度有个佛教女尼，虽然仍然拥有完美的视力，她却试着要开发用耳朵来看的能力。这类的观念无非是“精神上的颠倒”罢了。那永远是贪欲的问题，权力的渴爱在作祟着。</p>\n<p>　　用(英文)Meditation一词来替代(巴利)原文的Bhavana 是不恰当的，原文意指“修习”或“开发”，也就是心智的修习或心智的开发。佛教的修习一词，恰当地说，全意是指心智的修习开发。它的目标是在净除心意的杂染和困扰，诸如：淫欲、憎恨、恶意、怠惰、焦虑不安、猜疑等，并开发诸如专注、清明、智慧、意志、精进、分析的能力、自信、愉悦、宁静等品行，最后导致如实知见事物本然之性的最高智慧，并证得最终的真理——涅盘。</p>\n<h2>禅思的性质</h2>\n<p>　　他因此发现了另一种性质的“禅思”，称为毘婆舍那，亦即深入事物本性的内明，引导至于心意的完全解脱，证知最终的真理——涅乐。这是佛教必要的“禅思”，佛教的心智修习。它是一种基于念住、清明、注意、观察的分析方法。</p>\n<p>　　在区区数页中，要处理如此广泛的一个主题是不可能的。然而，在此就其实用的方式，就真正的佛教禅思——心智的修习或心智的开发，来做个简略的观念介绍。</p>\n<p>　　在心智的开发(禅思)上，佛陀所开示的最重要的一场<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>就是“念处经”(长部第二十二经或中部第十经)。这篇说法在传统上备受尊重，不仅在佛教寺院里定期地被诵念着，同时在佛教<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>里，也以虔敬之心，围坐而聆听着。通常，比丘在临终者的床畔诵念这部经典，以净化其最终的思想。</p>\n<h2>禅思的方式</h2>\n<p>　　在这篇说法中的“禅思”方式并未与生活脱节，也不逃避生活；相反的，它与我们的生活、我们的日常活动、我们的悲喜、我们的言语思维、我们的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>与心<a href=\"/fjrw/jsrw/zhihang\" class=\"keylink\" target=\"_blank\">智行</a>业，息息相关。</p>\n<p>　　这篇说法分为四个主要部份：第一部份讨论身体，第二部份讨论感受，第三部份讨论心意，第四部份则讨论各种道德和心智上的课题(法)。</p>\n<p>　　无论是那一种方式的“禅思”，心里都要清楚明自，重要的就是念住或清明，注意和观察。</p>\n<p>　　一个最为人们所熟悉、喜爱而实用的，关于身体的“禅思”，就是念住入、出息(安那般那念)。只有这种“禅思”，经中才提到特别而固定的姿势。这篇经文里所提到的其它形式的“禅思”，你可以随你所爱的坐着、站着、走着或躺着。但是，修习念住入出息的时候，就必须坐着，根据经文: “盘腿、保持身体端正和意念警觉。”但是盘腿对各国人们而言，尤其是西方人，并不实际也不容易。所以那些觉得盘坐有困难的人，可以坐在椅子上，“保持身体端正和意念警觉。”对这种练习而言，禅思者必须坐正而不僵硬，那是非常必要的；双手舒适地放在腿上。这样坐着，你可以闭上眼睛，或注视着你的鼻尖，随你方便。</p>\n<p>　　你日夜呼吸着，但从未注意到它，从未有一秒钟专注于它。如今你正想要这么做，那么照常地呼吸，不要有任何的勉强或用力。现在把你的心意专注于吸入和呼出；让你的心意观察着吸入和呼出；让你的心意清明、警觉于呼吸。当你呼吸时，有时是长呼吸，有时则否，这都没关系。正常地、自然地呼吸就可以。只有一件事，当你长呼吸时，必须清楚明自它们是长呼吸，依此类推。换句话说，你的心意必须完全地集中在你的呼吸上，以便念念分明于它的动作和变化。忘掉其它所有的事情——你的周遭，你的环境；不要睁眼去看任何东西，试着练习五到十分钟。</p>\n<p>　　开始的时候，你会发现要把心意集中在呼吸上，是非常地困难。你将会被心意的奔驰所惊骇——它就是停不下来，你开始想到各种事情，你会听到外面的声音，你的心意纷扰而散乱，你会沮丧而失望。但是，如果你每日早晚持续这样练习两次，每次五到十分钟，渐渐地，你的心意就会开始集中在呼吸上了。过了一段时期之后，你将会体验到这么一瞬间：你的心意完全地集中在呼吸上，你不再听到附近的声音时，外在的世界消失了。这瞬间是了不起的经验，充满着喜悦、快乐和宁静，因此你将乐于持续着它，但你仍然办不到，不过，如果你继续规律地加以练习，你将会一遍又一遍地体验到愈来愈长的时段。这就是你在念住呼吸中完全忘我的片刻，只要你惦记着自己，就没办法专注于任何事物之上了。</p>\n<p>　　这个念住呼吸的练习，是开发<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>到达非常高超果证的一种最单纯和最简易的修习之一。此外，禅定的力量对于任何一种深入事物本性的知见、彻悟、内明，包括涅盘的体证，都是必需的。</p>\n<p>　　除了这一切之外，这念住呼吸的练习也有立竿见影的效果，它有益于你的身体健康、放松、熟睡，而日常工作更有效率，它让你平静而安宁。即使在你紧张或激动的时候，只要你这么练习个几分钟，你自己就会看到自己马上变得平静和安详(中译注：即身观察缘<a href=\"/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>知)，你会觉得自己好像已经从安憩中醒来一样。</p>\n<p>　　另一种非常重要，实用而且有效的“禅思”方式，就是念念分明并念住你所作的任何事情，不论是身体上或口头上的，在你日常生活的例行工作中，私事、公事或职业上的一切事物，不论是行、住、坐、卧或睡，屈伸手足，瞻视周遭、穿衣、语默、吃喝，乃至大小便利——一切活动中，你都必须念念分明并念住当下的动作。这就是说，你必须活在现前的瞬间里，在现前的行动里。这并不是说你完全不可以想到过去或未来，相反的，在与现前的瞬间和行动有所关联时，你要想到它们的相关性。</p>\n<p>　　人们通常并未生活在他们当下的行动中，他们活在过去或未来之中。虽然，他们现在似乎正在这里忙着某些事情，然而他们却活在自己脑海中的另一个地方，在他们虚拟的问题和忧虑之中，通常是活在过去的追忆之中，或是活在对未来的渴盼和揣测之中。因此，他们既不活在所做所为的当下，也不能享受到现前之乐。所以，他们对现前的瞬间和当下的工作都不快乐、不满意，而自然地，他们也就不能完全地投入自己的工作之中。</p>\n<p>　　有时候，在饭店里你会看到有人一面吃东西，一面阅读着——很常见的情景。他给你一个“大忙人”的印象，忙得甚至没有时间吃饭。你不知道他是在吃东西还是在阅读，也许可以说他同时都在做。事实上，他两者都没做，也都没享受到。他紧绷着，心意纷扰，不能享受到当下所作的乐趣，没有活在当下的生活中，而是心不在焉地、愚蠢地在逃避生活(这不是说吃饭的时候不可与朋友谈话)。</p>\n<p>　　无论如何尝试，你都无法逃避人生，只要你活着，不论是在城市里或在洞窟里，你都必须面对它活着。真正的人生就是现前的瞬间——既不是已经消逝的前尘往事，也不是尚未生起的梦幻未来。活在当下的人才是过着真实的人生，他是最快乐的。</p>\n<p>　　当有人问到，为什么佛陀的<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>日中一食，过着简单而安静的生活，却如此神采奕奕呢？佛陀回答说: “他们既不追悔过去，也不杞忧未来。他们活在现前，所以他们神采奕奕，愚人因为杞忧着未来又追悔着过去，就像骄阳底下被割断的芦苇一般，枯槁憔悴。”</p>\n<p>　　念住或念念分明并不是说你必须想到或<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>到“我正在做这个”或“我正在做那个”，正好相反，当你想到“我正在做这个”的片刻，就成了自我意识，于是你就没有活在行动之中，而是活在“我”的观念之中，结果你的工作也被弄糟了。你必须完全地忘掉自己，忘我地去做事情。当一个演讲者变得自我意识，而想到“我正在对听众演说”的时候，他的演说就受到了干扰，思绪也中断了。但是，当他在演说的主题中忘了自己，那就是他最佳的表现，他讲得很好也解释得很清楚。所有伟大的杰作——艺术的、诗歌的、智慧的、心灵的——都是它们的创作者，在完全忘我的行动中所产生的，当他们全然忘了自己时，也就从自我意识中解脱了。</p>\n<p>　　佛陀所教导的这个念住或念念分明于我们的活动，就是活在现前的瞬间，活在当下的行动中(禅法主要就是基于此教导)。在这个方式的禅思里，你不必实行任何特殊的活动来开发念住，你只要专注并念念分明于你所做的任何事物就好了，你将不必多花费一分一秒宝贵的时间在这特殊的“禅思”之上，你只需要在你的日常生活中，经常日以继夜地，开发念住和清明。上述所讨论的两种方式的禅思，是关于我们的身体方面的。</p>\n<p>　　接着，关于我们所有的感受方面——不论是快乐的、不快乐的或中性的，也有一种修习禅思的方法，让我们举个例子：你正体验着一种不愉快、悲伤的感受。在此状态下，你的心意是阴霾的、灰暗的、不开朗的，它是沮丧<a href=\"/rmgjc/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>的。有时，你甚至不清楚自己为什么会有那种不愉快的感受。首先，你必须学习，不要为不愉快的感受再感到不愉快，不要为忧虑更生忧虑。要设法去看清楚，为什么会有不愉快、忧虑或悲哀的感受。设法去检查它是如何生起的，它的缘起；它是如何消失的，它的止息。设法去检查它，就好像你正从外面在观察着它一样，不要有主观的反应，就像科学家在观察某个对象一样。这儿也是这样，你不能主观地把它看成是“我的感受”，你必须再度忘掉虚妄的“我”执。当你看到它的本性——它如何生起和消失，那么你的心意就不再被那种感受所束缚了，因而解脱<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>了。对所有的感受而言，都是一样。</p>\n<p>　　现在，让我们来讨论关于心意方面的禅思方式。不论何时，当你的心意是贪欲的或离欲的；被瞋恨、恶意、嫉妒所掌控着，或是充满着仁爱、慈悲；愚痴的或是清明的；凡此种种，你都必须要完全地念念分明于其状况。我们必须承认，我们经常会害怕或羞于观察自己的心意，所以我们宁愿逃避它。必须勇敢而真诚地观察自己的心意，就像在镜子里观察自己的面孔一样。</p>\n<p>　　这里不需要用批评或裁判的态度，也不是分辨是非和<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>，只是单纯地观察、监看、检查。你不是法官而是科学家，当你观察心意，并清楚地看到它的真正本性时，你就不再被它的情绪、情感和心态所束缚了。如是解脱自在了，你就能够如实知见事物的真相了。</p>\n<p>　　让我们举个例子，假设你真的<a href=\"/rmgjc/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>了，被愤怒、敌意、瞋恨所支配着。奇怪而矛盾的是，愤怒中的人并未真正地意识到、注意到他在生气。当他意识到并注意到心意状态的时候，就是他看到愤怒的时候，若是如此，它就会觉得羞愧而开始减退了。你必须检查它的本性，它是如何生起，如何消失的，这里再度必须记得，你不可以想着“我在生气”或“我的怒气”。你只须要念念分明并注意愤怒的心意状态。你只要客观地观察着并检查着愤怒的心意就好了，这是对于所有心意情感、情绪和状态应有的态度。</p>\n<p>　　然后，有一种关于道德、心灵和智慧方面的禅思方式。凡是我们在这个主题上所学习的、阅读的、讨论的、会谈的、思虑的，都包括在这种“禅思”之内。阅读本书，深思这里面所讨论的主题，就是禅思的一种方式。稍前提到的(本书中未译出)差摩迦和一群比丘之间的对话(中译注：见杂阿含一○三经)，就是一种禅思的方式，它导至涅盘的证悟。</p>\n<h3>　　所以，依据这种方式的禅思，你可以学习、忆念并深思着五种障碍(五盖)，亦即：</h3>\n<p>　　一、感官的欲望。</p>\n<p>　　二、恶意、瞋恨或愤怒。</p>\n<p>　　三、昏沈和<a href=\"/rmgjc/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。</p>\n<p>　　四、激动和沮丧。</p>\n<p>　　五、犹疑不定。</p>\n<p>　　这五项被认为是通往任何清明知见的障碍，事实上，也是通往任何进步的障碍。当一个人受着它们的支配，又不知道如何袪除它们时，那么，他就不知道是非或善恶了。</p>\n<h3>　　<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>也可以“禅思”七个正觉的因素(七觉支)。它们是：</h3>\n<p>　　一、念住觉支，也就是念念分明并专注于身心的一切活动和动作之中，如前所述。</p>\n<p>　　二、择法觉支，细察详究<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>律，包括我们所有教义的、道德的和哲理的学习、阅读、研究、讨论、会谈，乃至参加有关于正法律的演讲等。</p>\n<p>　　三、精进觉支，坚决地努力，直到结束。</p>\n<p>　　四、喜悦觉支，与<a href=\"/rmgjc/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>的、忧郁的或悲伤的心理状态正好相反的品行。</p>\n<p>　　五、轻安觉支，身心的轻松，勿令身心僵化。</p>\n<p>　　六、禅定觉支，如前面所述。</p>\n<p>　　七、舍弃觉支，也就是能以平静、安详、不乱的心意来面对生活中的一切变故。</p>\n<p>　　要开发这些品行，最需要的就是一个真诚的愿望、意志或性向，至于其它许多开发各种品行所需的物质和精神条件，则在经典中另有记述。</p>\n<p>　　行者也可以“禅思”诸如“<a href=\"/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>”之类的主题，详细察究着“什么是众生？”“那称为『我』的是什么？”也可以四圣谛做为主题。学习和察究这些主题，就构成了这第四种禅思的方式，它导致最终真理的证悟。</p>\n<h3>　　除了这里我们所讨论的之外，还有许多禅思的主题，传统上有四十种，其中必须特别提到的是四梵住：</h3>\n<p>　　一、慈心无量地对待一切有情众生，不分轩轾，如母亲钟爱独子一般。</p>\n<p>　　二、悲悯地对待一切<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>、烦恼和苦难的有情众生。</p>\n<p>　　三、<a href=\"/rmgjc/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>着别人的成功、幸福和快乐。</p>\n<p>　　四、舍心面对人生的一切变故。</p>\n</div>"
    }
]