[
    {
        "title": "大悲心",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p>　　大悲心就是菩提心，就是阿褥多罗三藐三菩提心、就是大慈大悲心、就是救苦救难普度众生心，就是佛心。</p>\n<p>　　那么<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>到啥样的程度才会有大悲心？才会是大悲心？修行到<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>果位以上就有了大悲心，才是大悲心，修行到<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>佛的时候，就是圆满的大悲心，圆满的大慈大悲心。圆满佛就是自性光，就是圆满智慧，就是<a href=\"/rmgjc/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>，就是常寂光。</p>\n<p>　　<a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>人如何才能具足大悲心？从学佛之日起，学习<a href=\"/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>为我们留下来的经典，<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。这些经典就是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>会我们得到大悲心的方法，就是成佛的方法。通过学习佛经或听佛经讲义，就达到了听经闻法，通过听经闻法就可以达到明理，明白佛所<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的道理，就是成佛的道理和方法，越来理越明白，越来越有悟处，当悟处出来的时候，真的就会明白一切都是假的，虚妄的，都不真，也就做到了，不再对任何产生执着，对任何都不贪恋，也就是做到了万缘放下而<a href=\"/rmgjc/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>善待有缘。也就会对任何事不起心不动念，做到了一念不生，这时候就得到了真正的清净心，真正的清净心就是圆满的智慧，圆满智慧就是无量觉。无量觉就是自性，自性就是佛。自性就是光，就是佛光，圆满自性就是常寂光。其心就是大悲心。</p>\n<p>　　大悲心如何起作用？当具足大悲心的时候，就是圆满智慧，就是佛。就是阿弥陀佛。就是光，佛光，具足圆满智慧德能的佛光，常寂光，就是阿弥陀佛的德能之光。普照尽<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>遍法界。在尽虚空遍法界现无量无边身，每个身都具足无量无边相，无量无边好。每个身都是应众生的感而化现出来的，众生们在每个修行程度上，都需要佛在这个程度上给予<a href=\"/rmgjc/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>，佛光就会化现众生们所喜爱的佛身而为之说法，演说<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。所有佛，包括十方佛都是自性光、佛光所化现的所有佛，所有菩萨及众生的自性都是一个，十一不是二。成佛了，就是自性了，就是自性光了，就都是一个了。所以佛只有一尊，无论过去佛，现在佛还是未来佛、它方世界佛，十方诸佛，都是一尊佛，因众生所感而化现出来的，所以佛只有一尊，就是阿弥陀佛，其它佛都是方便说。佛一念不生，如如不动，就具足了，无量德能，时时演说自性法，供养尽虚空遍法界一切众生。其智慧显现出来的就是圆满佛光，普照尽虚空遍法界。一切有缘众生都会因此得度，有缘众生，就是真信佛的，真学佛的，即将成佛的，就是根即将成熟的，这些众生的缘成熟了，也就得度了，其他众生的缘也会随时成熟，<a href=\"/rmgjc/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>的会变成有缘的，就是说，都是有缘的，只是机缘不同，时间不同，缘分不同，归根结底都是有缘众生，都会得度，都是未来佛，都会成佛。当机缘成熟时，就会感受到佛光普照，就会见到佛为之说法，就会得度。</p>\n<p>　　我们大多数学佛人所说的大悲心或大慈大悲，都是在学佛期间的某种明理程度之上，而理解的大悲心，大慈大悲心，也就是说还不是真正的明理，真正的明理是悟道，没有悟道就是没有真明理。这时候所理解的大悲心就是用我们的<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>心而理解的大悲心，可以说还是凡夫知见，用这样的大悲心做事，就不会很圆满，可以说就是帮人忙，做些好事而已。因为都是用某些想法在做事，某些念头在做事，这种做法就是凡夫在做，不是真正的大悲心。真正的大悲心是不起心不动念、无念，是佛。</p>\n<p>　　所以我们必须发起大悲心，就是成佛之心，以至诚之心，学习经教，明理、悟道、见性成佛，见性成佛了，就真的具足大悲心了，就可以普度众生了，众生得度都成佛了。这才是真正的大悲心，大慈大悲心。真的是大悲，大慈大悲，阿弥陀佛！</p>\n</div>"
    }
]