[
    {
        "title": "【读经】-佛教读经须知",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x8BFB;&#x7ECF;&#x3011;-&#x4F5B;&#x6559;&#x8BFB;&#x7ECF;&#x987B;&#x77E5;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022340608.jpg\" title=\"&#x3010;&#x8BFB;&#x7ECF;&#x3011;-&#x4F5B;&#x6559;&#x8BFB;&#x7ECF;&#x987B;&#x77E5;\" /></p>\n<h2><a href=\"/rmgjc/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　读经就二个字，一个是“读”，一个是“经”。字面上很容易搞清楚，但是在实践的过程中，这二个字常常被曲解，从而让读经教育存在许多的变数，令人无所适从。</p>\n<h2>概念</h2>\n<p>　　读，就是读，不是背，不是理解，更不是照着行动。你读就好了，坚持去读，一天二天，没有什么效果，没关系，一周二周，没有什么效果，也没有关系。你就是读，读熟，读透。总有一天，你突然就明白了，突然就懂了。即使你永远不明白，不懂，也没关系，仍然是读，轻松地读，起码对你也没有什么坏处，我相信没有一个人，永远也不明白一点点的。要不然古人也不会那么看重读书了。</p>\n<p>　　经就是六经四书的简称。</p>\n<p>　　传统六经是指《<a href=\"/ctwh/sishuwujing/shijing/\" class=\"keylink\" target=\"_blank\">诗经</a>》《<a href=\"/ctwh/sishuwujing/shangshu/\" class=\"keylink\" target=\"_blank\">尚书</a>》《<a href=\"/ctwh/sishuwujing/liji/\" class=\"keylink\" target=\"_blank\">礼记</a>》《<a href=\"/ctwh/sishuwujing/zhouyi/\" class=\"keylink\" target=\"_blank\">周易</a>》和《春秋》，《乐经》。</p>\n<p>　　六经四书是赖国全老师首先提出的国学经典的简称。</p>\n<p>　　六经是指《易经》，《黄帝内经》，《诗经》，《<a href=\"/ctwh/mengxuejingdian/xiaojing/\" class=\"keylink\" target=\"_blank\">孝经</a>》，《<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>经》，《<a href=\"https://www.guang5.com/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚经</a>》。此六经，以儒家为主，涵盖佛家、道家内容。与传统的六</p>\n<p>　　经：《诗经》《尚书》《礼记》《周易》和《春秋》，《乐经》，有所不同。</p>\n<p>　　四书指的是《<a href=\"/ctwh/sishuwujing/lunyu/\" class=\"keylink\" target=\"_blank\">论语</a>》《孟子》《大学》和《中庸》，与传统的四书没有区别。</p>\n<h2>原则</h2>\n<h3>　　读经有八大原则。</h3>\n<h3>　　第一是当下读经的原则。</h3>\n<p>　　以前我们不知道，也没有方法，但是现在知道了，从今天晚上，从明天就要开始。我们大人读经，没有小孩读经那么厉害，但是不厉害也没有办法，他读一遍就能背下来了，我们呢？就读十遍，我们要笨鸟先飞。中庸里说“人一能之，己百之；人十能之，己千之。”所以读经并没有年龄的限制，就看你用不用心，这是当下读经的原则。</p>\n<h3>　　第二是全家读经的原则。</h3>\n<p>　　所以我们在这方面做了点尝试，我们准备了1+1套装，1+2套装。一家如果是二个人读，就需要二套教材，如果是三个人读，就需要三套教材，每天到了时间大家就开始一起读。这个是全家读经的原则，会收到很好的效果。</p>\n<h3>　　第三是科学读经的原则。</h3>\n<p>　　读经非常好，方法也重要，如果方法不好，要坚持下去做不到。有人说读经不需要方法，只要老实读经，大量读经，天天读经，一天读十小时，读他十年。那如果我们换成这样说，吃饭很好，不要方法，老实吃饭，大量吃饭，一天吃十小时，吃他十年，大家会不会觉得很可笑。因为读经跟吃饭就是一个道理，读经就是<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，生活就是这样简单。读经就像开车一样，不能说只踩油门，越快越好，一定还要注意踩刹车，这个路好走时可以踩油门，这个路不好走呢，不行的时候要踩刹车，过收费站还要交费。这是很综合的，要科学读经，不讲方法是不行的，会翻车的。读经很好，但不懂方法，出问题的不少，我们遇到很多读经翻车的孩子，读经出故障的孩子。</p>\n<h3>　　第四是系统读经的原则。</h3>\n<p>　　什么叫系统？我们就说盖房子吧，钢筋很好，那我们就光用钢筋行不行？不要水泥、火砖可以吗？还有其他材料，需要科学搭配，这就叫系统。</p>\n<p>　　还有，我们认为读经教育在实施过程中要做到“四不离”原则：</p>\n<p><strong>　　第一，不离<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>的原则。</strong></p>\n<p>　　小孩子读经很好，把孩子放到私塾，只说明一件事，你想偷懒，你自己不想读，把孩子交给别人，让别人负责对不对？也有家长说我很忙，没有时间，这样做我们会失去与孩子共同成长的良好机会，我们不主张孩子离开家庭，除非不得已。一个小孩长期在没有父母的环境中成长，心理各方面是有问题的，起码亲情会缺失；一个家庭长期没有孩子，<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>之间可能也会有问题，所以读经最好不离家庭。中国文化讲究修身，下面还有什么？是齐家。一个孩子长期不在家里，如何学习齐家？父母吵架也要让他学一学，否则他结婚以后也会不知道如何吵的，面对吵架他可能会无所适从。孩子要学会生活的方方面面的道理，所以要不离家庭。没有办法，选择私塾的孩子，最少也要一周接回家里一次，长期远离家庭，几个月，甚至长年不见父母的做法，我们是不提倡的。</p>\n<p><strong>　　第二，不离社会的原则。</strong></p>\n<p>　　有些读经推广人士认为社会很混乱，很容易污染我们的孩子，所以觉得放在没有污染的地方就好。我们要思考一下，一个孩子长期在所谓没有污染的地方能不能成才？好比一棵树苗，放在温室里，能不能长成参天大树？不能。池塘里的最漂亮的莲花，是长在在污水里？还是清水里？如果水很清，很干净，什么污泥都没有，那里根本开不出美丽的花来。</p>\n<p>　　那么一个人的成长，应该在什么样的环境里才合适呢？我们纵观历史，几乎所有优秀的人才，杰出的人才，可以说没有一个是在完全的顺境中成长的。我们会担心孩子在社会这么复杂的环境成长，难道真的不会受污染吗？会的，所以要读经典，让经典去引导他，给他一盏指路明灯，这就是经典的力量。如果不学经典，我们才真的要担心他。我们看，一本小小的《<a href=\"/ctwh/mengxuejingdian/sanzijing/\" class=\"keylink\" target=\"_blank\">三字经</a>》里面就有很多智慧：“为人子，方少时，亲师友，习礼仪。”长期的朗读就会潜移默化地知道要“亲师友，习礼仪”；“子不学，非所宜，幼不学，老何为？”孩子经常朗读，自然就知道小时候要努力学习。所以，经典会引导，会慢慢地渗透进孩子的心灵，熏陶孩子，让孩子知道生活中应该怎么去判断是非，在复杂的环境里完成自己的判断，才能最终成为人才。而关在温室里的孩子，在一个完全没有，自己认为完全没有污染的地方，事实上恰恰是培养不出人才的，所以要遵守不离社会的原则。</p>\n<p><strong>　　第三，不离生活的原则。</strong></p>\n<p>　　读书就像吃饭，读经就跟吃饭一样，要不离生活，生活会告诉我们很多道理。有人说读书，读了又不懂，对不对？所以他就不读，你不读又怎么会懂呢？生活告诉我们，如果说吃饭，吃一口又不饱，吃了又不饱，所以就不吃，你什么时候能饱？不吃又怎么能饱呢？吃了不饱怎么办？小朋友，吃了一口饭不饱怎么办？（场下孩子回答：接着吃！）接着吃，对不对？这不就对了吗，接着吃不就行了吗，一碗饭不饱再吃一碗。那读经呢，读了又不懂怎么办？（场下回答：接着读！）再读不就行了吗？一遍不懂，再读再读，读他几十遍读他几百遍，我看懂不懂？读他十年读他二十年，看看懂不懂。</p>\n<p>　　其实懂不懂是不要管的，就像我们吃饭不需要管饱不饱一样，这是不要管的，吃多了自然会饱的，这都是生活给我们的道理。开车也一样，读经像开车，开车要方法，开车大家知道，其实开车包括很多层面，第一，你的车好不好，好车，坏车，差别很大；第二，路好不好；第三，油好不好；第四，开车人的技术怎么样。这些因素都要考虑，是不是？那么我们读经，培养孩子，这个孩子怎么样，还有这个家长怎么样，还有我们选择使用的教材怎么样，方法怎么样，都有关系，这就是生活给我们的智慧，跟生活是一样的，不是说这个不重要那个重要，统统都重要，都要去注意到，这就是不离生活原则。</p>\n<p><strong>　　第四，不离圣贤教诲。</strong></p>\n<p>　　所有的经典都会告诉我们如何做人，做事，我们要不离圣贤教诲，圣贤告诉我们，凡事积小成高大，不需要我们做大事，我们只要把每一件小事做好，做不到的事我们不要考虑。读了要懂，这个是做不到的，谁知道懂不懂啊，读了以后马上就去应用，这个更是做不到的。但是，我们能做到的是什么呢？我们能做到的就是读，所以我们只有把读做好，该懂的时候就懂了。吃饭我们就吃，吃是能做到的，什么时候饱，不知道，所以我们就只管吃，吃好了饱就会自然而来，读好了懂就会自然而来，懂了应用也是自然会来，懂了我们就会应用。我们只要把能做得到的做好，做不到的先不要考虑。</p>\n</div>"
    }
]