[
    {
        "title": "堕胎_堕胎的果报",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x5815;&#x80CE;_&#x5815;&#x80CE;&#x7684;&#x679C;&#x62A5;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022238100.jpg\" /></p>\n<h2><a href=\"/rmgjc/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a></h2>\n<p>　　堕胎又称中断怀孕或人工流产，故意结束妊娠，取出胚胎或者导致胎儿死亡的行为。在中国，人们普遍不对堕胎做任何生命伦理方面的讨论，在一胎制的背景下很多人采取自愿堕胎，或被有关部门实行强制堕胎。而在许多国家（特别是西方国家）堕胎是备受争议的一种行为，主要为<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>、<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>和女性身体权问题。</p>\n<h2>史料记载</h2>\n<p>　　公元前1550年，已知世界最古老的医书《Eber莎草书》留下了古埃及最早的堕胎记载。 中国见于史书记载的堕胎行为从汉代就开始了，并且形成三种堕胎技术。唐宋以后，由于人口增长的压力，堕胎在一些地区出现了普遍化倾向，导致堕胎的公开化和职业化。但由于传统重生育、反堕胎观念的存在，堕胎技术一直受到歧视，得不到完善，人们为此付出了长期的血的代价。</p>\n<p>　　堕胎从古至今一直是颇有争议的社会现象，作为客观事实，始终存在于人们的<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中。汉代对此已有记载，《<a href=\"/ctwh/ershisishi/hanshu/\" class=\"keylink\" target=\"_blank\">汉书</a>》卷97《元后传》记，“西汉成帝时，皇后赵飞燕和妹妹赵合德‘姊弟专宠十余年，卒皆无子’，但她们为了固宠，又逼迫怀孕宫人堕胎‘掖庭中御幸生子者辄死，又饮药伤堕者无数’。</p>\n<h2>堕胎形式</h2>\n<p>　　堕胎经过多年的发展与演变，主要形式有：人工流产（负压吸引术）与药物流产。</p>\n<h3>　　人工流产</h3>\n<p>　　大部分的堕胎是在前十二个星期内进行的，胎儿仍然很小，可以用一个强力的抽吸器把他吸出，这个抽吸器的能力是普通家用吸尘机的二十五倍。这个方法叫做抽吸割除术（suction curettage），抽吸器的力量撕裂或者绞拧胎儿的身体，将肢体逐部撕开，直至只剩下头部来。胎儿的头部太大，不能从吸管中通过，所以堕胎的人需要用钳子插入子宫内，攫获这个单独漂浮的头部，然后将它钳碎，直至能够通过抽吸管，那么头部也就被挪走。</p>\n<h3>　　流产药物</h3>\n<p>　　90年代流产药物的引进和使用，无疑给意外受孕的女子带来了极大的福音。米非司酮配伍米索前列醇片等抗早孕药物在临床上广泛使用，取得了较为满意的效果。不动手术就可使止孕的梦想变成现实，不能不让人欣喜。的确，与人工流产相比，药物流产避免了手术器械对生殖器官的损伤，而且<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>小、副反应轻、后遗症少，服药者心理压力也不大，易于让人接受。有现代医学技术“保驾护航”，无烦无恼无忧愁，抗早孕药物还有一个名字叫“催经止孕药”，望文生义，从中也可以看出研制者的用心良苦——有过性生活史的女子，只要月经超过几天不来，就有怀孕的可能，这时趁它“立足未稳”，立即服药催促月经来潮，从而达到终止妊娠的目的。在药物的作用下，孕囊可以排出。</p>\n<h3>　　其他方法</h3>\n<p>　　另一个堕胎方法是盐水法（Saline method），就是盐毒法，是用在第四到第七个月，是1970年代最常用的方法。这个手术是用一支三吋半到四吋的针，从母亲的腹壁插到羊膜囊（ammiotic sac）中，抽出200mm的羊水，然后以一种强度的浓盐水替换。在这个程序中，胎儿是把盐吞掉，在盐中「呼吸」，基本上，胎儿全身的皮肤被盐熨伤，慢慢被毒死，于是母亲开始分娩，排出一个死的、烧伤了的，和枯萎的婴儿。偶尔有些婴儿在这个手续中幸存，生下来就有严重的并发症，因为在这个过程中，婴儿的组织和器官 都因出血而破坏，动脉静脉破裂而在身上留下巨大的青肿。</p>\n<p>　　用前列腺素（prostaglandin）激发：前列腺素包含一些贺尔蒙类的化合物，当被注射或使用在子宫肌的时候，可以损坏胎儿的血液循环，剧烈的收缩，然后被排出。因为前列腺素不是对未诞生的胎儿直接有毒，这样的堕胎方法结果比盐水法产生更多因打胎失败而出生的胎儿。打胎失败使医药工作人员十分麻烦，尤其是母亲：婴儿为生存奋斗，喘不过气来，到处抽动乱移。</p>\n<p>　　还有一个办法，叫做子宫切除术（hysterotomy），用在六到八个月期间，这个办法和剖腹产术（Caesarean section）只有一个不同之处，整个手术是为了谋杀婴儿，不是为了救他。这个手术是把肚子切开，直入子宫，取出婴儿，不照顾他，让他死去，或者早在母亲体内先勒死他（婴儿是不能在子宫外被勒死的）。一旦婴儿是在子宫外，他不可以被杀死 ；否则医生就犯了谋杀罪。</p>\n<h2>主要危害</h2>\n<h3>　　堕胎的危害主要表现在以下几点：</h3>\n<p>　　一、可能导致月经失调，少数患者周期不规则，经期延长，较多的患者堕胎术后出现经量增多；</p>\n<p>　　二、可能导致宫颈或宫腔粘连，宫颈粘连可致宫腔积血；</p>\n<p>　　三、可能导致子宫腔内感染 ；</p>\n<p>　　四、有可能导致日后习惯性流产，堕胎次数越多流产可能性越大；</p>\n<p>　　五、有可能导致终生不孕；</p>\n<p>　　六、子宫穿孔：妊娠周数愈大，危险机率愈高；流产次数愈多，穿孔机会也愈大。其它如子宫位置、形状异常或以前动过手术的子宫（如剖腹产或肌瘤切除）皆有较大的穿孔机会；</p>\n<p>　　七、子宫颈或内膜粘黏：在进行人工流产时，如果医师的手法太过粗鲁，就很有可能导致子宫颈或内膜受伤、发炎，就有可能产生术后的子宫颈或内膜粘黏、并会引起月经异常，如无月经或月经量过少。严重者会在以后产生不育症的情况；</p>\n<p>　　八、子宫颈受伤：在人流的过程，如果不小心，扩张宫颈口的速度太快，都有可能造成子宫颈的损伤，并造成以后怀孕较容易流产的情形，尤其是第一次怀孕或尚未生育过的妇女比较容易发生；</p>\n<p>　　九、不完全流产：如果手术施行不完全，少量胎儿组织残留于子宫内，可能影响子宫收缩而造成持续出血或造成粘黏、感染等情况。最好再仔细做一次手术清除残余的组织。子宫的位置或形状不正常，一般比较容易造成此后遗症；</p>\n<p>　　十、细菌感染：如果器械消毒不完全，或是手术者本身未注意无菌过程，即可能造成子宫内感染，甚至继续往上传染侵犯输卵管及骨盆腔，严重时会造成以后容易宫外孕或不孕的后果。</p>\n<h3>　　心理影响</h3>\n<p>　　堕胎会让人产生罪咎感、<a href=\"/rmgjc/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>的冲动、退缩、遗憾懊悔、失去自<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>、降低自尊、怀有敌意愤怒、绝望无助、憎恨与堕胎有关的人、结束与伴侣的关系、失去性欲、不能原谅自己、引发恶梦等心理障碍。.</p>\n</div>"
    }
]