[
    {
        "title": "放生（佛教名词）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x653E;&#x751F;&#xFF08;&#x4F5B;&#x6559;&#x540D;&#x8BCD;&#xFF09;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022343392.png\" /></p>\n<h2><a href=\"/fangsheng/\" class=\"keylink\" target=\"_blank\">放生</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>术语）</h2>\n<p>　　中国汉地的放<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>动古已有之。狭义单指人命；广义则指一切人命与禽兽。《<a href=\"/ctwh/zhuzibaijia/daojia/liezi.html\" class=\"keylink\" target=\"_blank\">列子</a>·说符篇》载：“正旦放生，示有恩也。”“客曰：‘民知君之欲放之，竞而捕之，死者众矣君如欲生之，不若禁民勿捕，捕而放之，恩过不相补矣。’简子曰：‘善！’”可见，早在春秋战国时代，中国汉地即有在特殊日子放生的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，甚至已出现了专门捕鱼鸟以供放生的情况。但持续、广泛的放生习俗的形成，还是在佛教传入中国之后。</p>\n<h2>春秋战国放生渊源</h2>\n<h3>　　先秦源流与形成</h3>\n<p>　　中国汉地的放生活动古已有之。狭义单指人命；广义则指一切人命与禽兽。《列子·说符篇》载：“正旦放生，示有恩也。”“客曰：‘民知君之欲放之，竞而捕之，死者众矣君如欲生之，不若禁民勿捕，捕而放之，恩过不相补矣。’简子曰：‘善！’”可见，早在春秋战国时代，中国汉地即有在特殊日子放生的说法，甚至已出现了专门捕鱼鸟以供放生的情况。</p>\n<p>　　不忍是很多人的常情， 放生作为零星的事件， 在古代各大文明区应该都有。略略读查几本经典， 就发现 “放生” 于先秦中土， 并非仅是罕见个例， 而是一种影响很大的文化， “放生” 高级动物则是一种亚文化、 仁道式理想文化； 《吕氏春秋》 那种纯属实用目的、 不非时杀的不杀幼鸟， 并非仁者提倡的行为。</p>\n<p>　　1、西周祭神以陶俑代替活人， 相对于商代的习惯， 就是对一批人牺的制度性放生。 西周时代人文精神的勃兴是东周时期人文精神发展和仁及 （高级 ） 生命论的重要前提。</p>\n<p>　　2、《<a href=\"/ctwh/sishuwujing/lunyu/\" class=\"keylink\" target=\"_blank\">论语</a>》 里<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>云 “始作俑者， 其无后乎！” ， 相对于陶俑制， 推进了不忍和推爱。</p>\n<p>　　3、《孔子家语》 “五帝德” 章云 “仁厚及于鸟兽昆虫” ， “困誓”章云鸟兽避不义之人。清儒多以此书为伪作。 但伪作论只是猜测， 没有实据， 故难成立。而且， 1973 年河北八角廊西汉墓所出 《儒家者言》 ， 与 《孔子家语》 大致相同， 可谓其不同版本， 今人多信 《家语》 不伪。</p>\n<p>　　4、春秋时期， 晏子认为， 大仁爱应该推及 （部分 ） 禽兽。</p>\n<p>　　《晏子春秋》 杂上第九章云： “景公探雀鷇， 鷇弱， 反之。 晏子闻之， 不待时而入见景公…再拜而贺曰… ‘君探雀鷇， 鷇弱反之， 是长幼也。 吾君仁爱， 曾禽兽之加焉， 而况于人乎！ 此圣王之道也。’ ” 西汉刘向的 《说苑》 也有这个故事。鷇为初生之小鸟。</p>\n<p>　　景公是性情中人， 因鷇弱而非鷇小而返之， 是出于不忍之心而非出于实用目的。晏子的顺势引导， 也表现了春秋时期贤人的看法： 圣王之道的仁爱， 应该推及 （部分 ） 禽兽。</p>\n<p>　　而景公的整体为政如何呢？酷刑广泛、 酷税祸民、 暴虐人民。 孔子所谓 “苛政猛于虎” 讲的就是齐景公。 虽有晏子的缓和，但没有完全改变其暴政性， 以致景公死后不几年， 姜齐就亡于田氏。 周革殷命后， 最大的变国事件就是田氏革姜。 齐景公为政接近于桀纣， 实乃亡国之君。</p>\n<p>　　可见， “放生” 来自佛教论， 把先秦中土人们的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>水平整体地降低到桀纣层次， 完全违反中华文明的实际情况。</p>\n<p>　　5、齐宣王对牛的放生事例</p>\n<p>　　据 《孟子 · 梁惠王上》 第七章： 王坐于堂上， 有牵牛而过堂下者， 王见之， 曰： “牛何之？” 对曰： “将以衅钟。” 王曰： “舍之。吾不忍其觳觫， 若无罪而就死地。 ” 对曰： “然则废衅钟与？ ” 曰： “何可废也？以羊易之。” 觳觫即惊恐发抖。</p>\n<p>　　这里， 齐宣王对牛， 就是放生。 他后来解释道， 不是爱财， 是出于不忍。 站在齐国这个大国的君主的位置看， 单论财力， 王室的<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>活动可以不在乎几头牛： 故宣王之释可信。</p>\n<p>　　或曰： 齐宣王以羊易牛， 博爱不够。 不错。 因此， 孟子在肯定宣王仁心的同时， 也委婉地批评了他以小易大。</p>\n<p>　　其实， 先秦仁爱一般都是推爱、 等差之爱 （墨家的博爱也非泛爱众生） ： 由亲人推及无辜旁人； 由活人推及死人和俑人； 并把生命分出贵贱， 由最贵之人推及某些灵长类生命。这符合人的情感之边际递减性， 现代很多人同情蚂蚁， 但一般不同情蚊子。 齐宣王以羊易牛， 因为在贵贱台阶上， 牛贵于羊； 论推爱， 贵者优先。</p>\n<p>　　6、孟子的 “君子远庖厨” 论</p>\n<p>　　《梁惠王上》 孟子对齐宣王曰： “君子之于禽兽也， 见其牛，不忍见其死； 闻其声， 不忍食其肉。是以君子远庖厨也。” 并云“恩足以及禽兽” 、 “推恩足以保四海” 。</p>\n<p>　　7、“大德曰生” 是先秦的流行思想</p>\n<p>　　大德曰生， 论完整关系， 不仅有天地对万物的生育， 还有人对人、 人对其它生命的生育和保护。</p>\n<p>　　可见，在先秦，放生，在齐景公 （消极放生 ）、齐宣王（半积极放生 ）那里都有个例； 而且，是出于纯粹德心而非功利；而且， 行为是被赞颂的， 旁边有一种影响很大的文化。孟子的“君子远庖厨”论，几乎接近佛教的泛爱众生，只能作为小众的自律理想。</p>\n<p>　　佛家的博爱广度，儒墨不及；但儒墨（晏子可谓墨家之祖）的道德深度，佛家不及：佛家的博爱，似为道德之极， 但佛教倡不<a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>多是为免恶报、积善多是为得偿，有功利性；舍身伺虎只是难以复制的传说或误传；佛家还是有我的，人的需要之本性决定了佛家博爱的上限，没有看到以辛勤劳动来饲养众生的佛说及 “墨佛”流派， 相反是靠施舍养己，以他人为工具， 也有自私：大众化宗教的后面是功利。另外，至少中土佛教的放生是兼顾功利和灵长，如放生对象是自然生长的龟、蛇、鱼，而非家养的猪、 鸭。儒墨作为入世学派， 异于佛家的出世性， 不可能实行广泛的放生，那样一来，生产难继、且需安置游牧人群，人群必恶 （生存压力内卷化）；但放生据次位时， 有补益， 故赞颂。可见，中土的放生有不同类型； 若论文化倡导，道德层次高于<a href=\"/rmgjc/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>的放生。</p>\n<p>　　《列子》 所载赵简子对鸠的放生，正符合正常的推爱范围。据《周礼》 卷三十，“献鸠以养国老”，当时的鸠乃贵重动物，且灵性高，故属于放生范围， 异于鸡鸭蚂蚁。而且他的放生是为示恩，乃功利， 低于孔、 晏所倡，低于景、 宣所行，实属平常。但持续、广泛的放生习俗的形成，还是在佛教传入中国之后。</p>\n<h2>形成发展</h2>\n<p>　　一些人之所以面对外界的种种非议仍执着地出钱出力放生护生，原因固然很多但关键在于<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>的大力提倡和历代高僧大德的推动。<a href=\"/rmgjc/fodan.html\" class=\"keylink\" target=\"_blank\">佛诞</a>放生是时下流行甚广的宗教民俗之一。每年农历四月初八,作为佛诞节仪之一,各地寺院多有放生活动。考此宗教民俗起于宋代,成于杭州,与<a href=\"/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>僧人关系甚密。一放生之事古已有之,《列子·说符篇》：“邯郸之民以正月之旦献鸠于(赵)简子。简子大悦,厚赏之。客问其故,简子曰：‘正旦放生,示有恩也。’”然其蔚然成俗则是佛教传入以后的事,尤其是<a href=\"/rmgjc/liudaolunhui.html\" class=\"keylink\" target=\"_blank\">六道轮回</a>观念为人们普遍接受之后。</p>\n<p>　　放生习俗的开展，成为宋代以后佛教深入社会的重要传统之一。放生习俗的形成，既有佛教戒杀护生的思想根源，同时亦受到儒家好生思想的推动。南北朝以来，在皇权贵族的支持下，逐渐以天然海湾为放生池的屏障，形成<a href=\"/\" class=\"keylink\" target=\"_blank\">中国佛教</a>的放生习俗；宋朝以后，僧人在寺院设置放生池，供民众放生，使放生习俗深入民间。明清以来，云栖祩宏修订放生仪规，成立“放尘会”，积极提倡放生。</p>\n<h3>　　放生习俗的渊源</h3>\n<p>　　先秦时期，孔子以舜为好尘榜样，强调环境保护；孟子则强调恻隐之心，并以仁义思想启发梁惠王，《吕氏春秋·异用》、《列子·说符》等已经开创戒杀放尘的风气。佛教传入汉地后，昙无谶译《金光明最胜王经·流水长者子品》为佛教放生提供了理论依据。</p>\n<p>　　商汤之所以讨伐成功，除了擅用万物之外，更懂得珍惜生灵，不让一切生命被赶尽杀绝，其治国所行仁爱之风，山“成汤解网”事迹可见一斑。《吕氏春秋·异用》记载：</p>\n<p>　　汤见祝网者，置四面，其祝曰：“从天坠者，从地出者，从四方来者，皆离吾网。”汤曰：“嘻!尽之矣。非桀其孰为此也?”汤收其三面，置其一面，更教祝曰：“昔蛛蝥作网罟，今之人学纡。欲左者左，欲右者右，欲高者高，欲下者下，吾取其犯命者。”汉南之国闻之曰：“汤之德及禽兽矣。”四十国归之。人置四面，未必得鸟；汤去其三面，置其一面，以网其四十国，非徒网鸟也。’</p>\n<p>　　成汤仁民爱物，强调放尘为上合天心，下顺民意，仁君不忍见猎人四面布网，有违上天好生之德，于是去除三面，仅存一面：并更改祝祷词，化杀<a href=\"/rmgjc/liqi.html\" class=\"keylink\" target=\"_blank\">戾气</a>为和祥之气，表现了统治者若行放生将比杀尘较易获得民心。</p>\n<p>　　“成汤解网”对后世影响很大，明代莲池《戒杀放尘文》仍然引用其故事。《列子·说符篇》记载了“周简子正旦放生”的故事：</p>\n<p>　　邯郸之民，以正月元旦献鸠于简子。简子大悦，厚赏之。客问其故。简子曰：“正旦放生，示有恩也。”客曰：“民知君之欲放之，竞而捕之，死者众矣。君如欲生之，不若禁民勿捕。捕而放之，恩过不相补矣。”简子曰：“然。”’山此可知，邯郸在春秋时代已经出现专门捕鱼鸟以供放生的风俗，但是民间放生主要是表示对生灵的恩惠，先捕生灵然后再放之，则功过难以相抵。当时，周简子听众门客劝导，将“捕物放生”的作法改为“禁民捕捉”，这是中国禁止屠钓的早期记载。</p>\n<p>　　春天生物滋长，古人已有保护生物措施，《<a href=\"/ctwh/sishuwujing/liji/\" class=\"keylink\" target=\"_blank\">礼记</a>·月令第六》说：“孟春之月……命祀山林川泽牺牲毋用牡，禁止伐木，毋覆巢，毋杀孩虫、胎天、飞鸟，毋麛毋卵。”：在春天万象更新之际，切勿伐木营生、覆巢嬉戏、残害幼苗等，否则有失大地万物生存之道。</p>\n<p>　　“成汤解网”和“正旦放生”说明了放生习俗在中国文化具有深厚的思想背景。昙无谶译《金光明最胜王经·流水长者子品》为佛教的放生提供了自身的资源，内容简录如下：</p>\n<p>　　流水长者子不忍鱼为日所曝，乃求其国王，与以二十大象，暂往负水，济彼鱼命，王允其请。长者子乃及请二子，至象厩中，随意取二十大象，双从酒家多借皮囊，往决水处，以囊盛水，象负至池，泻至池中，水即弥满，还复如故。流水长者子救起濒死之鱼，予之水、食，为其解说大乘经典，诸鱼闻经后，皆生忉利天。’</p>\n<p>　　《流水长者子品》对佛教的放生习俗具有重要的影响，如<a href=\"/rmgjc/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>法、诸佛<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>圣号、<a href=\"/fangsheng/wenku/gongde/\" class=\"keylink\" target=\"_blank\">放生功德</a>偈、放生程序、<a href=\"/fangsheng/yigui/\" class=\"keylink\" target=\"_blank\">放生仪轨</a>等。流水长者子救鱼放尘的情节，增进了中原人士对佛教放尘思想的理解，更易于接受和传播。</p>\n<p>　　儒家的放生思想源于恻隐之心，如“子产畜鱼”等具有影响力。所以，佛教的放尘结合了儒家的号召力，能够顺利推行于民间。</p>\n<h3>　　宋以前的放生活动</h3>\n<p>　　南北朝以来，放尘习俗逐渐流行。北魏献文帝下敕，勿用牲畜祭祀天地宗社，每年活七万五千牲畜的性命。北齐文宣帝实践佛教的慈悲教法，积极断绝肉食。天保七年(556)五月，文宣帝认为肉食是违反慈悲，故不食肉。天保八年(557)四月庚午颁诏禁取虾、蟹、蛤、蚬等，只准捕鱼；同月乙酉，不论公私禁绝以鹰、鵄猎狩。天保九年(558)二月下诏，限令在阴历十一月和一月准许烧野，此外一律不准用火。、</p>\n<p>　　梁武帝撰写《断酒肉文》，下敕以蔬果为宗庙祭祀用品。而且，梁武帝造十三无尽藏，实践放生与布施二科。萧子显《御讲摩诃般若经序》说：</p>\n<p>　　别敕至到张文体， 日往屠肆命切鼎俎，即时救赎济免亿数，以此为常。文休者先为运吏，辄散运米与贫民，应入大辟，上愍其一分，恻然不许。非唯赦其重奉，乃加以至到之目，既非凭暖之市义，又无汲黯之请罪。人微宥重，过于昔时。文休既荷嘉贷，未尝暂怠， 日中或不得食，而足不得息，周遍京邑，行步如飞，击鼓扬幢，负担驰逐，家禽野兽殚，四生之品，无不放舍焉。是时朝臣至于民庶，并各<a href=\"/rmgjc/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。</p>\n<p>　　梁武帝命令张文休每天去屠宰场，买下即将被杀的生物，然后放生。王公贵族以及市民受梁武帝的影响，积极参与、推广放生。</p>\n<p>　　梁元帝(55l—554在位)下诏建立放生亭，并且撰写《荆州放尘亭碑》：</p>\n<p>　　鱼从流水，本在<a href=\"/sushi/yaoshan/taohua/\" class=\"keylink\" target=\"_blank\">桃花</a>之源；龙处大林，恒捻浮云之路。岂谓陵阳垂钓，失云失水；<a href=\"/ctwh/zhuzibaijia/daojia/zhuangzi.html\" class=\"keylink\" target=\"_blank\">庄子</a>悬竿，吞钩天饵。虽复元龟夜梦，终见取于宋王；朱鹭晨飞，尚张罗于汉后。譬如黄雀伺蝉，不知随弹应至；青鹤逐兔，讵识杠鼎方前。北海之食，鹦鹉未始，非人西王之使传信，谁云贱鸟。故知鱼鸟之观，俱在好生。欲使金床之膈更返，街阳之侣，雪山之鹿，不充食萍之宴。</p>\n<p>　　梁元帝将古人好生的典故重新整理诠释，显出他怀仁心以治天下，广收<a href=\"/rmgjc/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>民心之功效；</p>\n<p>　　陈宣帝太建十三年(581)，智颢劝请陈宣帝下诏禁止采捕。智颉目睹民众以捕鱼网罟相连四百多里，于是购买江海弯典型段为放生池：并且为渔民讲《金光明经》，渔民闻法改行转业，好生从善，并献临海江沪溪梁六十三所，达三四百余里，为放生池，徐陵树碑阐明因缘。</p>\n<p>　　时至唐代，放生习俗非常盛行。《续高僧传·道胄传》记载，道胄于诸州建造放尘池一百余所，多有灵感。’“安史之乱”后，政局动荡不安，人心惶惶，民生凋敝，饥荒四起。唐肃宗于乾元二年(759)下诏，设立放尘池八十一所，从山南道、剑南道、黔中道、荆南道、岭南道、江西道、浙江道诸道，一直到升州的江宁、秦淮太平桥及临江带郭上下五里，颜真卿撰《放生碑文》。诏书中所谓的临江海一带上下五里各置放生池，与智颉以天然的海湾为放生池屏障之形式相雷同。</p>\n<h3>　　宋代放生习俗的流行</h3>\n<p>　　宋代以来，放尘在朝廷的推动和民众的参与下更是盛行。宋太祖下诏民间二月至九月，不许采捕弹射。宋真宗天禧三年(1019)，杭州天竺<a href=\"/rmgjc/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>寺慈云遵式上奏朝廷，以西湖为放生池，而且自制“放尘慈济法门”。《<a href=\"/rmgjc/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>统纪》卷四十四说：</p>\n<p>　　宰相王钦若出镇钱唐，率僚属诣天竺灵山，谒慈云法师遵式，请讲法华。叹曰：此道所未闻，此人所未见也。即为奏锡天竺旧名。师奏请西湖为放生池，每岁四月八日，郡人会湖上纵鱼鸟，为主上祝寿。</p>\n<p>　　放生为慈悲济世法门，为求皇帝延年益寿、长命百岁，所以恳求皇帝于每年四月八闩佛诞节时，大行放尘会，为天子祝圣，获得恩准。</p>\n<p>　　《金园集》收录了遵式的《放尘慈济法门》，在序言的开篇说：“儒冠五常谓之仁，释御四等谓之慈，皆恶残去杀，推惠广爱之谓也。然后果五福之曰寿，证四德之日常，实唯不杀，放生之大统也。”“这是以放尘融合了儒家的“五常”和佛教的“四无量心”。遵式以叙山、呪水、请加、归依、称佛、说法、忏愿七章，制订了放尘的仪轨。</p>\n<p>　　放生的流行不仅受到政府的支持，而且在宗教<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>上获得灵感。守<a href=\"/ctwh/sishuwujing/shangshu/\" class=\"keylink\" target=\"_blank\">尚书</a>屯田员外郎知越州诸暨县事潘华撰《梦鱼记》，潘华依《普贤观经》，令人不得捕池沼江湖内鱼。景德四年(1007)，潘华奉诏还阙，梦江湖中鱼哭泣。’这种灵感故事的流行，说明了放生在宋代的盛况。</p>\n<p>　　天圣三年(1025)，四明山延庆寺知礼亦奏请在佛诞节放生，为皇帝祝寿，并请求以南湖为永久放生池。知礼为了使放生法会顺利进行而制订放生仪轨，并撰《放生文》以定其仪轨，当时的枢密使刘均奉敕为此撰写碑文，记载这种盛事。</p>\n<p>　　遵式、知礼奏请皇帝赐放生池，显示了僧人主动影响皇帝；而天禧元年(1017)，宋真宗下诏重修放生池，并禁止在淮州郡淮水上下五里内捕鱼，这可能是受当时修建放生池风气的影响。欧阳修撰写《跋放生池碑》，显扬宋真宗对万物的恩德：</p>\n<p>　　右放生池碑，不著书撰人名氏，放生池唐世处处有之，王者仁泽及于草木昆虫，使一物必遂其生而不为私惠也。惟天地生万物所以资于人，然代天而治物者，常为之节使其足用而取之，不过万物得遂其生而不夭三代之政，如斯而已。易大传曰：庖牺氏之王也，能通神明之德，以类万物之情，作结绳为网罟，以佃以渔，盖言其始教民取物，资生为万世之利，此所以为<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>也。<a href=\"/rmgjc/futu.html\" class=\"keylink\" target=\"_blank\">浮屠</a>氏之说，乃为杀物者有罪，而放生者得福，苟如； 其言，则庖牺氏遂为人间之圣人，地下之罪人矣。</p>\n<p>　　宋代的放尘习俗延续了唐朝，并且扩展到民间百姓的生活中。</p>\n<p>　　各地放生池的兴衰，亦是当地佛教发展的盛衰。自从智颉首创放尘池以来，当佛教兴盛时，如唐肃宗、宋真宗则下令扩展放生池；当佛教没落时，放生池则成为捕捉鱼族之区。</p>\n<h3>　　明清佛教的放生习俗</h3>\n<p>　　随着江南社会经济的繁荣，临近江海的杭州、宁波一带，盛产水产，民众喜好进食，加速水产和肉食的消耗；同时，江南蚕丝业发达，势必伤害许多生命。针对江南社会的生活方式，明清佛教界积极提倡放生，尤其是云栖祩宏，如憨山德清《云栖莲池宏大师塔铭》所说：“极意戒杀生，崇放尘，著文久行于世，海内多奉尊之”，对明清佛教界影响极大。</p>\n<p>　　“戒杀护生”是佛教生命观的重要体现，云栖祩宏提出“畜生有<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>”、“畜生有知觉”、“畜生能轮回往尘”、“畜生也会伤心<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>”等思想，试图改变社会民众对动物的观点，以达到戒杀扩生的目的。祩宏从“凡厥有心，定当作佛”的佛性论出发，表示动物<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>亦能往生，他在《阿弥陀经疏钞》说：</p>\n<p>　　善男子女人者，善有二义：一是宿生善因，一是今生善类。男女者，通指缁素利钝，及<a href=\"/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>一切有缘众生也。……又鬼畜<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>，雌雄牝牡，亦可均名男女。但念佛者，俱得往生，是通一切众生也。</p>\n<p>　　祩宏将“善男子善女人”解释为“六道一切有缘众生”，畜生有心可以“以念生定”，畜生亦具有生成佛的可能性，这是从<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的角度提升了动物的生命地位。既然动物与人类的佛性是平等，杀害动物则是“以强凌弱”的非正义行为。如《竹窗二笔·杀罪》说：“据含灵皆有佛性，则蚁与人一也，何厚薄之足云?如其贵欺贱，强陵弱，则人可杀而食也，亦何厚薄之足云?”：祩宏强调人们应该无有厚薄、平等地对待动物。</p>\n<p>　　其次，祩宏强调动物与人一样，亦有<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>和知觉，以此劝导不杀。《竹窗随笔·汤厄》说：</p>\n<p>　　予见屠酤之肆，生置鳖缮虾蟹之属，于釜中而以百沸汤烹之，则谕之曰：彼众生力弗不汝敌，又微劣不能作声音。若力敌，则当如虎豹瞰汝；若能作声，冤号酸楚之声当</p>\n<p>　　震动<a href=\"/rmgjc/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。’祩宏是从汤烹动物的情形，让人们去想象动物的痛苦，“不忍其痛”从而达到戒杀护生的目标。另外一方面，动物刃；有亲人，不愿意同亲人分开，如<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>父母爱好，“一切禽兽亦各爱其子”。</p>\n<p>　　祩宏劝导民众反思自己的生活与感受，想象动物亦有类似的感受，从而引发同理心、同情心、不忍心。在《戒杀放生文》中，他要求民众在尘日、生子、祭先、婚礼、宴客、祈禳、营生时都不可以杀生。而且，祩宏用<a href=\"/fjgs/yggs/243547.html\" class=\"keylink\" target=\"_blank\">因果报应</a>故事，形象地阐明戒杀放尘的功德。同时，戒杀放生不仅是慈悲心的体现，更是得尘<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>的法门，如《戒杀放尘文》说：“净业三福，慈心不杀实居其一。今能不杀，又放其尘；既能放尘，又以法济令生净土。如是用心，报满之时，九晶莲台高步无疑矣。”这是将戒杀放尘纳入修行法门，从人性的同情引向宗教的解脱。</p>\n<p>　　祩宏不仅宣扬戒杀放生的思想，而且在实际行动上于杭州城南北设上方和长寿二放生池，以利十方信众行放尘之善行。依祩宏《重修上方寺凿放尘池记》的记载：上方寺建始于后梁贞明七年(593)，明景泰四年(1453)寺庙衰败，土地被民众占用，仅存十分之一的土地。沈善能<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>原来占有土地，嘉靖二十三年(1545)升官，将土地出租，产权留给女儿。他的女儿出嫁王氏后，遵父亲的遗嘱，将土地产权交给云栖寺，于是恢复为僧地。王氏夫妇去世后，当时宋化卿居士听到这件事非常赞叹，便拿钱赠送给王家的子孙，而且定好契约。祩宏在众居士的帮助下，节衣缩食，将上方寺故址赎回。当时，居士们建议在旧址建立寺院，祩宏观察地理形势，修渠疏通湖与土地，建成放尘池；并且修整一座废弃的房子，让两三个诚信的僧人守护修行。‘祩宏在修建上方寺放尘池后不久，又续建了长寿庵放尘池。依《北门长寿庵放生池记》，长寿庵是后唐时期翔鸾院的旧址，年久荒废，祩宏与仁绅募款兴建为放生池。</p>\n<p>　　放生池的修建是一项大工程，在财力、人力、物力等方面都需要有大投入。首先，祩宏通过讲经说法传播自己的戒杀放生思想，劝导当时的仕绅接受他的思想。《居士传·虞长儒传》记载：“时宏公方坐南屏演《<a href=\"https://www.guang5.com/fojing/yuanjuejing/\" class=\"keylink\" target=\"_blank\">圆觉经</a>》，募钱赎万工池，立放生社，缁白数万，伽陀之音震动川谷，一时清节之士多与其会，实长孺倡率之。”’祩宏演讲《圆觉经》，于是受到当时仕绅的协助，尤其是虞长儒这样的仕绅领袖宣传，倡导、率领。同时，《北门长寿庵放生池记》记载，居士、<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>、士大夫有的提供金钱援助，有的带来食物，有的亲自参与劳动。</p>\n<p>　　同时，放生池的维持也需要庞大的资金，一方面为居士信众的捐款，另一方面则是寺庙僧众自行挪省供给。如《云栖纪事》说：“云栖在山中设放生所，飞走各类充仞其中；既有生食，众僧复减口以养之；除萏茭，约费粟二百石；城内外放生二池岁费百余金，自来无缺乏。”可见，放生池的修建和维持，是戒杀放生思想、制度、实践融合的结果。</p>\n<p>　　在明代结社风气的影响下，祩宏成立了“放生会”，依《上方善会约》可知有“上方善会”、“西湖放生社”。《上方善会约》规定了上方善会的宗旨、定期、读诵、治供、议论、主会等事项。“上方善会”的宗旨是“读诵大乘戒经，兼之放生念佛，是诸上善人同会一处”，“大乘戒经”是指《梵网经》，可见“上方善会”是一个持戒、念佛、放尘的在家修行聚会。在每月朔望前一日，聚集于上方寺，愿意参加者签名于本上，以记录参加人数，可见是有固定的参会日期。众人到齐后，由一位僧人领众，诵《戒经》一卷，念佛五百声或一千声。诵经完后，饼果三色作茶供；念佛后，饭菜三色作斋供。茶供、斋供的费用山每位参加者各出五分银，由守院僧置办。法会后，大众可以交流<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>义理。对于放尘银，则各各随便出，不拘多少或者有无，或者自己购买宋放生。在“上方善会”的组织里，会首是轮流依次作主，因为会资是固定的五分钱，会首的主要工作是准备香烛茶汤，记录参加的会员。总之，祩宏是希望保持“放生会”的平等、简单、易操作等特点，这样才能久存。</p>\n<p>　　同时，祩宏在四明知礼放尘仪轨的基础上，对《放生仪》进行改造，使其简便易行。其步骤主要有默想、洒水、说法、忏悔、发愿，祩宏最大的改变是在增加了念诵《往生净土神咒》和《十方<a href=\"https://www.guang5.com/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">华严经</a>·十回向品》，是希望休现放生的意义在于回向众生与往生净土。</p>\n<p>　　祩宏在明末结社风气的影响下，凿建放生池、召集放生社团、修订放尘仪轨、制定放尘会约，对佛教的放生进行制度性的建构，从而使放尘成为具有阶层组织、定期定量的制度，从而使放生在精神上符合时代价值、在形式上组织制度化。在祩宏的影响下，放尘盛行于明末清初的佛教界。湛然圆澄、密云圆悟等高僧，以及冯梦祯(1548-1595)、虞淳熙(1553-1621)、陶望龄(1562-1609)等居士，亦多支持放生之业。虞淳熙在西湖组织胜莲社，鼓励社友放尘救众，《武林掌故丛编》收有虞淳熙撰《胜莲社约》。陶望龄、张子云等亦曾在万历二十九年(1601)，于杭州城南创放生会。</p>\n<h2>放生的方法</h2>\n<h3>　　如何放生</h3>\n<p>　　放生的活动是基于众生平等的慈悲精神以及轮回<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>的因果观念。所渭“吃它半斤，还它八两”。如果能够既戒杀又放生，当然功德倍增，此等感应灵验的事例，史不绝书。</p>\n<p>　　现代社会科技进步，人口密度膨胀，生活空间缩小，要想求得一个绝对安全可靠的放生池和放生区域，是相当困难的。其难处除了渔、猎的网捕射杀与打捞之外，也有自然环境的限制。如今日的台湾与美国，只有野生动物保护区。此外，有人基于爱心或保护自然环境的立场，劝导社会大众不要乱捕滥杀，以免破坏生物互相生克的自然协调，也是为了挽救珍稀动物濒于灭种的危机，这些跟佛教放生的本意虽相应但不相同。如果我们仅把要放生的生物无限制地流放在自然景观动物保护区，到了饱和程度，也会有人以控制繁殖和适量的捕杀等方式来调节其生活空间的。</p>\n<p>　　因此，我们到哪儿放生？应该如何放生？如果是鱼，有人用钩钓、网捞；如果是鸟，有人用枪射、网捕。而且今日的鱼市场和鸟店，所售的商品很少是野生的，多半是来自人工繁殖的鱼池和鸟园。那些动物，根本没有适应自然环境而自求生存的能力，放生，也等于杀生。放小的，被大的吃掉；放大的，就进入餐馆的厨灶。鸟类，尤其是鱼类，都有它们生存的习性。一定的鱼类必须生存于一定的水质、水深和水流的环境中；买淡水鱼放于大海，买海鱼放于淡水都是大问题。如果是鸟园繁殖的鸟类，它们不曾在自然界觅食，便可能甚至不知草丛树林间的草种树果等也可以作为食物；如果放之于原野，不是饥饿而死就是被其他动物或鸟类捕食而亡。在这种情况下，我们是否还需要放生？是否还应该放生？</p>\n<h3>　　关于如何放生要注意事项：</h3>\n<p>　　1．时间：放生在每月初八、十五、二十五、三十或佛菩萨的纪念日较为<a href=\"/rmgjc/shusheng.html\" class=\"keylink\" target=\"_blank\">殊胜</a>，尤其在神变月（藏历正月）的功德更大。但也可以不定期放生。</p>\n<p>　　2．地点：宜在放生池、以及远离捕杀之水域、山林等尽量能使所放众生生存悦意且能长寿之地。</p>\n<p>　　3．类别：虫类、鱼类、飞禽、畜类等，所放众生之躯体越大，则所获之功德也越大。</p>\n<p>　　4．方式：动作轻柔，若有<a href=\"/rmgjc/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>丸、解脱丸等则预先化于水中，在放生前洒在所放动物上。用<a href=\"/rmgjc/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>《系解脱》在其上方加持则更为殊胜。</p>\n<p>　　5．发心：应发利益众生之清净心，一心一意为其获得暂时之安乐及究竟之解脱而祈祷。</p>\n<h2>放生发愿三个程序</h2>\n<h3>　　洒净诵偈</h3>\n<p>　　放生仪式开始前，于放生处设香案，备净水杨枝，中供<a href=\"/fjgs/gygs/243621.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>像。放生仪式开始，众等即以慈眼视诸众生，念其沉沦，深生哀悯，复念三宝有大威力，能救拔之。法师手执水盂，默念想云：一心奉请十方慈父、广大灵感观世音菩萨，降临道场，加持此水，具大功勋。洒沾异类，念彼身心清净，堪闻妙法。法师边洒净水边诵《香赞》：“杨枝净水，遍洒三千，性空八德利人天，福寿广增延。灭罪消愆，火焰化红莲。”然后三称“南无大<a href=\"/rmgjc/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>世音菩萨”。诵毕，法师与大众同诵《<a href=\"/fozhou/dabeizhou/\" class=\"keylink\" target=\"_blank\">大悲咒</a>》若干遍，并且于众生灵处边绕行边洒净水。接着，再诵《<a href=\"https://www.guang5.com/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">心经</a>》一遍，《<a href=\"/fozhou/wangshengzhou/\" class=\"keylink\" target=\"_blank\">往生咒</a>》三遍，三称“南无甘露王菩萨摩诃萨”。</p>\n<h3>　　说<a href=\"/rmgjc/sanguiyi.html\" class=\"keylink\" target=\"_blank\">三皈依</a></h3>\n<p>　　法师拈香，启请尽<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>、遍法界十方<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>佛法僧三宝。然后，法师代这些水陆飞行、为他网捕、将入死门的诸众生行忏悔，忏悔毕持咒。接下来，法师向众生传授三皈依法说：“诸佛子，汝等不闻三宝，不解皈依，所以轮回三有，今堕畜生。我今授汝等三皈依法，汝今谛听。”然后法师念道：皈依佛，皈依法，皈依僧。皈依佛两足尊，皈依佛不堕地狱；皈依法离欲尊，皈依法不堕饿鬼；皈依僧众中尊，皈依僧不堕畜生。皈依佛竟，皈依法竟，皈依僧竟。法师说一遍，大众答一遍，如是三遍。法师授“三皈依法”后，再说“十二因缘”，以令众生“了知生灭之法，悟不生灭之法”；再为众生称“四弘誓愿”，望其“依佛发愿，依愿修行”。发愿词为，先诵“众生无边誓愿度，烦恼无尽誓愿断，法门无量誓愿学，佛道无上誓愿成”三遍，再诵“自性众生誓愿度，自性烦恼誓愿断，自性法门誓愿学，自性佛道誓愿成”。然后，法师又为众生三称七佛名号：南无多宝如来，南无宝胜如来，南无妙色身如来，南无广博身如来，南无离怖畏如来，南无甘露王如来，南无阿弥陀如来。复称赞佛的十种通号：如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师、佛<a href=\"/rmgjc/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。</p>\n<h3>　　放生发愿</h3>\n<p>　　法师在放生前对众生叮咛道：“唯愿汝等，既放以后，永不遭遇恶魔吞噬、网捕相加，获尽天年。命终之后，承三宝力，<a href=\"/rmgjc/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>往生，持戒修行。”又说：“更愿放生，菩提行愿，念念增明，救护众生。……愿捕生人等回心向善，同得解脱，共证真常。”最后，法师拈香念佛，将众生灵轻轻放去。大众即同念<a href=\"https://www.guang5.com/fxrm/rmbd/339642.html\" class=\"keylink\" target=\"_blank\">回向偈</a>：“愿以此功德，庄严佛净土，上报四重恩，下济三途苦，若有见闻者，悉发菩提心，尽此一报身，同生极乐国。”</p>\n<h2>仪规与要求</h2>\n<p>　　中国汉传佛教寺院在长期的放生法会中形成了独特的《放生仪规》。一般说来，按<a href=\"/rmgjc/xianxing.html\" class=\"keylink\" target=\"_blank\">现行</a>《放生仪规》，放生全过程可分为洒净诵偈、说三皈依、放生发愿三个程序</p>\n<h3>　　最简单最有效的放生仪规：</h3>\n<p>　　1、称名：南无本师<a href=\"/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>！南无西方<a href=\"/rmgjc/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>阿弥陀佛！南无观世音菩萨！南无<a href=\"/fjrw/zhufopusa/pusa/66971.html\" class=\"keylink\" target=\"_blank\">大势至菩萨</a>！南无清净大海众菩萨！（念三遍）</p>\n<p>　　2、忏悔：往昔所造诸恶业。皆由无始贪嗔痴。从身语意之所生。今在佛前求忏悔。（念三遍）</p>\n<p>　　3、皈依：皈依佛。皈依法。皈依僧。皈依佛两足尊。皈依法离欲尊。皈依僧众中尊。皈依佛不堕地狱。皈依法不堕饿鬼。皈依僧不堕傍生。皈依佛竟。皈依法竟。皈依僧竟。（念三遍）</p>\n<p>　　4、念佛：南无阿弥陀佛！（念数遍）</p>\n<p>　　5、放生：希望你们，被放以后，获尽天年。临命终时，乘佛愿力，往生极乐。（念三遍）</p>\n<p>　　6、回向：愿以此功德。平等施一切。同发菩提心。往生安乐国。（念三遍）（结束）</p>\n<h2>放生回向</h2>\n<p>　　所有十方世界中 三世一切人师子 我以清净身语意 一切遍礼尽无余</p>\n<p>　　普贤行愿威神力 普现一切如来前 一身复现刹尘身 一一遍礼刹尘佛</p>\n<p>　　于一尘中尘数佛 各处菩萨众会中 无尽法界尘亦然 深信诸佛皆充满</p>\n<p>　　最胜衣服最胜香 末香<a href=\"/rmgjc/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>与灯烛 一一皆如妙高聚 我悉供养诸如来</p>\n<p>　　我以广大胜解心 深信一切三世佛 悉以普贤行愿力 普遍供养诸如来</p>\n<p>　　各以一切音声海 普出无尽妙言辞 尽于未来一切劫 赞佛甚深功德海</p>\n<p>　　以诸最胜妙花鬘 伎乐涂香及伞盖 如是最胜庄严具 我以供养诸如来</p>\n<p>　　我昔所造诸恶业 皆由无始贪嗔痴 从身语意之所生 一切我今皆忏悔</p>\n<h2>放生意义</h2>\n<p>　　中国汉地放生习俗历史悠久，也已形成传统，对于唤醒世人的恻隐、仁恕、慈悲之心，为天下苍生祈福，德被万物，起到了积极作用，而且客观上也有利于生态保护。</p>\n<p>　　近百年来，随着科技发展、工业革命，世界发生了翻天覆地的变化。一方面给人们的物质生活带来极大的富足和便利，另一方面则造成环境污染、生态失衡、各种自然资源加速流失。从人文层面看，更是出现了精神空虚、道德沦丧、战争威胁不断、恐怖主义盛行；从生物界来看，各种生物种类正以空前的速度在减少，大多数野生动物不是被人类大量捕杀，就是因人类的活动而失去美好的家园，各种动物的权益受到空前的大规模的剥夺，甚至受到残酷的虐待。这一切已引起广大有识之士的极大关注和反省，越来越多的人<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>到，动物是人类的朋友，它们的权益应当得到维护，正如当年非洲黑人和印第安土著人的权益应当维护一样，一些大众媒体为此仗义直言，各种环境保护组织、动物保护组织纷纷建立，一些欧美国家还制订了各种保障动物福利的法律。这一反对物种歧视、为动物争取福利的运动，是在20世纪随着反对种族歧视和争取妇女权利运动而兴起的，这个运动的目标，是把利他主义的精神从人类自己扩大到非人类动物，因为那些动物也同人们一样，能够感受痛苦与快乐。伟大的科学家爱因斯坦说过：“我们的任务是要解放我们自己，这需要扩大我们同情的圈子，包容所有的生灵和美妙的大自然。”哲学家康德说：“人必须以仁心对待动物，因为对动物残忍的人对人也会变得残忍。”一些社会学研究证明，儿童时期对动物残忍的人，成年后犯罪率升高。</p>\n<p>　　因此，在21世纪，佛教放生护生的理念不仅没有过时，而且具有特殊而积极的意义。提倡佛教放生护生的理念，有利于人心向善，抑制杀戮和恐怖主义，提高公民的文明程度，建立和平、和谐的社会；有利于保护生态环境，抑制不合理的消费和奢靡、腐败之风，改变不良的餐饮习惯，促进人们的身心<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>；从佛教修行来说，更是增长慈悲心，减少罪障、疾病，增福增寿，感得现世与来生善果的功德之行。当然，当代佛教徒在放生护生形式上应更灵活一些，不宜拘泥于传统；在内容上应结合现实，作相应的扩充，充分发挥其积极的影响，避免消极的影响。</p>\n<h2>放生的好处</h2>\n<p>　　现在暂无科学依据证明放生会“给人福分”。从实际来看，放生的动物大多不合适：①蚯蚓之类的小动物，繁殖快，放入更多反而挤占生存空间；②家禽、家畜完全无法在野外生存；③捕来的受伤动物，如钩破嘴的鱼，不经处理很快就会死掉，而很少有人会去考虑这点；④购买野生动物已经犯法，若真想让它们得救，便应报警，打破这个产业链</p>\n<h2>放生功德</h2>\n<h3>　　根据佛教说法：</h3>\n<p>　　一、放生就是救命放生就是救护那些被擒、被抓、将被宰杀、命在垂危的众生的命，而众生最宝贵的就是自己的生命得以重拾生机，救他们的命，他们感激最深，所以功德至大！</p>\n<p>　　二、放生就是还债人们今生及累劫以来所造的杀业早已无量无边，放生就是出钱、出力来救赎众生的性命，以偿还以前人们所积欠无数的杀债。</p>\n<p>　　三、放生就是救急放生与其他的功德不一样，是救命在旦夕，随时将被宰杀的生命得以重拾生机，是千钩一发、刻不容缓的行动，就好像是医院的急诊急救一般，一个<a href=\"/rmgjc/chana.html\" class=\"keylink\" target=\"_blank\">刹那</a>、一全行动便可挽救成千上万无数的生命，所以功德至深。</p>\n<p>　　四、放生就是慈悲佛心就是大慈悲心，慈悲心是<a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的根本，而放生则是为了解除众生的苦难，起慈悲心予以救赎的一种行为。放生可以长养我们的慈悲心，在放生的过程中，慈悲心获得最大的培养。常常放生，慈悲心常常滋长，与佛心更相契，与佛更容易感应道交，学佛道业更容易成就。</p>\n<p>　　五、放生就是<a href=\"/rmgjc/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>任何一个众生的佛性与我相比毫无或缺，无二无别，因而每一个生命都是平等珍贵的。在放生中让我们觉悟到众生皆知贪生怕死，皆知趋吉避凶，皆有喜怒哀乐，与我相比，完全相同；众生更皆具备真如佛性，一旦业尽情空，未来皆能成佛，所以救一众生如同救一佛子，更等于救一未来佛。</p>\n<p>　　六、放生就是实践与其空口说得万言，不如老实行得一字，学佛最重要的就是实践。在放生真实的行动中，真正去培养慈悲，真正去解救生命，真正去为众生皈依、念佛、忏悔、回向，真正去体会众生平等一如、皆具佛性、皆能成佛的道理，真正做到自利利他，这样的修行才能真正得到利益。</p>\n<p>　　七、放生就是积极吃素与放生是学佛人行持上极重要的二件事。但吃素只是止恶。是消极地不再造杀业，不再积欠新的杀债；而放生却是扬善，是积极地救赎生命，偿还以前所欠的杀债。吃素而不放生，以前欠的杀业还是有果报的；放生而不吃素，所修得的功德又因为吃肉杀生都赔光了。所以吃素放生是一体的二面，需要相辅相成的，同时并行，效果才会显著。</p>\n<p>　　八、放生就是方便当天放生，当天无数身陷牢笼的众生马上获得了自由，无数濒临死亡的生命马上重拾了生机，无限的功德当天马上可以获得。并且不管一人多人、钱少钱多、任何时间、任何地点，只要发慈悲心，任何人都可以进行放生。放生不像其他功德，不需要等待机缘，自己可以主动进行；不需要依赖别人，自己可以独立完成；千千万万人一生中做不到的功德，我们可以经由放生短短的时间内独自一人完全成就，若更能以此广为提倡，功德更加不可思议，所以放生功德最为第一，非其他小善所能比！</p>\n<p>　　九、放生就是改命今生的<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>遭遇是因为多生以来所造就无数的<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>因缘所呈现的一个结果，造善因就得善果，造恶因就得恶果。但未来的命运却完全掌握在人们自己的手中。通过积福行善，诚心忏悔，人们的命运可以完全改变过来。而放生的功德最大，既直接又快速，改变命运的力量最为显著。</p>\n<p>　　十、放生就是解冤每一个众生在多生累劫以来，都曾经与人们结过冤仇，冤仇既结，怀恨在心，必当伺机报复。而放生正可以解冤释结，化敌为友，避免彼此的冤冤相报！</p>\n<p>　　十一、放生就是消灾灾难不幸之所以发生，都是源于人们以前所结的冤业、所造的杀业而来。放生解救众生的命，免除了众生的死难，也同时消除了我们的宿业，免除了未来原本应该偿受不幸的业报，这是因果必然的道理。</p>\n<p>　　十二、放生就是<a href=\"/rmgjc/zhibing.html\" class=\"keylink\" target=\"_blank\">治病</a>其实疾病绝症之所以发生，就是因为以前我们杀生所感召的杀业而来。既造杀因必结杀果，既造成杀业必受杀报，解决之道就是放生，偿还杀债，消除了疾病根本的杀因，病苦自然好转。</p>\n<p>　　十三、放生就是救亲每一个众生在无始的轮回中，都曾与我们互为父母、子女、手足、亲眷，只因彼此业缘不同，今朝我幸而为人，彼不幸沦为畜牲，放生就是救拔我们累世以来的亲友眷属，使其重拾生机，安享天年！</p>\n<p>　　十四、放生就是延寿每个人都希望长寿，放生救赎生命，延长了无数众生的生命。也必然同时延长了自己的<a href=\"/rmgjc/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>，这是因果永恒不变的真理。</p>\n<p>　　十五、放生就是福善救人一命胜造七级浮屠，而每一条生命都是平等珍贵的，所以救一众生，功德已无量无边，更何况救众多生命！放生就是积最大的福！放生就是行最大的善；积福行善，所有功德，莫过放生！</p>\n<p>　　十六、放生能助生西放生三施俱全，财布施、法布施、<a href=\"/rmgjc/wuguo.html\" class=\"keylink\" target=\"_blank\">无畏</a>布施，放生一举尽得。修行人以念佛（念佛--忆念觉悟的意思）为主，放生为辅，如此修行，如顺风之帆、顺水之舟，用力少而成效多，以此无上殊胜的功德回向往生西方极乐世界，往生大业必能稳操胜券，高登西方九品莲台必是指日可待。</p>\n<p>　　然而，佛教之外并没有对这些的证实，自然也不会被科学界赞同。</p>\n<h2>放生乱象</h2>\n<h3>　　淳安县千岛湖违规放生巴西龟</h3>\n<p>　　日前，淳安县渔政部门及时制止了一起外地游客在千岛湖违规放生巴西龟的行为，并暂扣了350多只巴西龟。</p>\n<p>　　据调查，该批巴西龟系温州佛教协会一行购买携带，并准备在千岛湖旅游码头放生之用。巴西龟又称红耳龟，是世界公认的生态杀手，性格凶猛，动作灵活，比较好斗，会大量掠夺同类生存资源，已经被世界环境保护组织列为100多个最具破坏性的物种，多个国家已将其列为危险性外来入侵物种，中国也已将其列入外来入侵物种，严禁“放生”野外，避免危害自然生态环境。</p>\n<p>　　渔政部门提醒，根据《水生生物增殖放流管理规定》、《浙江省渔业管理条例》等法规要求，单位和个人自行开展规模性水生生物增殖放流活动的，应当提前15日向当地县级以上地方人民政府渔业行政主管部门报告增殖放流的种类、数量、规格、时间和地点等事项，接受监督检查。禁止使用外来种、杂交种、转基因种以及其他不符合生态要求的水生生物物种进行增殖放流。建议广大群众在放生前，与渔政等相关部门联系，多做一些准备工作，多了解一些放生对象的生活习性，物种特性等，避免“放生变杀生”的情况发生。</p>\n<h3>　　三亚放生海龟最高卖5万元</h3>\n<p>　　海南三亚的南山文化旅游区内，有一个明码标价的放生点，该放生点内除了放生小鱼，还能放生国家二级保护动物海龟。根据海龟的大小不同，放生价各不相同，最高价可达5万元。</p>\n<p>　　景区放生点的工作人员明确表示，海龟是从正规的养殖场采购的，他们也不会捕捞放生龟重新卖给游客，景区还经常出动快艇驱逐在放生海域违法捕捞的渔民。</p>\n<p>　　2014年10月2日当天上午，南山海上观音的放生点已放生20多只大小海龟，其中有一只巨型海龟。</p>\n<p>　　不注意动物检疫，随意放生可能传播疾病野生动物、养殖动物体内都可能有一些危害动物和人身体健康的病毒、病菌，如果我们不对动物进行检疫，随意放生，很可能会造成这些有害的病毒病菌的四处扩散，不仅可能造成野外动物的大量死亡，生态环境平衡被打破，也可能造成人的疫情，因此不能掉以轻心。放生出于慈悲，但是真正的慈悲从来都是要善观缘起，一定要符合智慧。执著外在的形式，执著自身的福报和功德，而不全心全意从众生的福祉出发，这种放生不仅是违背科学精神，也是违背放生本意的。</p>\n<h2>放生要究竟</h2>\n<p>　　《华严经》云：“亡失菩提心，修诸善法，是为魔业”。我们经常参加放生活动的人绝不能一放了之，而应该在以心量所能及的时间、地点、方式上，在从买生至放生的各个环节上作周密的考量，悲悯所有的众生，帮助所有的众生，利益所有的众生。除了如理<a href=\"/rmgjc/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>的放生外，我们能做的事情俯拾皆是：当您看到地上的蚂蚁、窗台上的麻雀、水里的游鱼、林中的小鸟……，能否为它们施舍一点食物;当您路遇屠杀小动物的现场，能否为它们称念一下佛号；当您在餐桌上看见被煮食的众生肉，能否暗暗为其称念三皈依；当您有机会的时候，可以劝劝身边的人戒杀、持素、放生；有条件时候的为困苦的人伸出援手，等等…等等…，只要发心去做，您就能帮助无量的众生、行无量的善行、成就无量的功德。</p>\n<h2>放生注意事项</h2>\n<p>　　<strong>一、不要预约放生</strong></p>\n<p>　　与卖鱼者直接或间接、明确或暗示将要买生放生，使卖者闻讯捕捞，违背施无畏的基本定义。如此可令这些众生本几日后死，如今因预约卖者数量、品种等，使其提早被捞，虽汝意为放生，然而其中势必有不堪折磨而早夭的众生，由于其提前死亡出于你的预约，使自己的善举偏于形式了。要在不预先告知的情况下突然去采买物类放生</p>\n<p>　　<strong>二、要观察地点、水质及什么环境适合所放生物生存</strong></p>\n<p>　　如果被放之众生，能放其为适于它生长的环境，则对其有极大好处。反之，若只顾放而不观察所放的地点，则对其害处多多。如鳝鱼泥鳅在河里活不了几天 因为河底是泥沙 不能形成洞穴 田螺放在河里也活不了几天 把海水鱼放到淡水流域中，其必死无疑。 放鱼子一定要将母鱼买下 否则 只买鱼子 母鱼就要被杀 且鱼子就象没有怀足月的婴儿被<a href=\"/rmgjc/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>一样 还有不能将野兔置于众人处，不能将飞鸟放于易捕地，不能将鱼儿放入被化工原料污染的确无法生存的河流水域等。</p>\n<p>　　<strong>三、不固定时间地点采买，不固定时间地点放生</strong>，尽量不要让人知道放<a href=\"/sushi/yaoshan/shengde/\" class=\"keylink\" target=\"_blank\">生地</a>点或选择人烟稀少之地或大江大河的的水中间放生（“一次我去吉林松花湖放鱼，一位回族年轻人告诉我‘昨天长春来了四个人在松花湖的江边上放鱼，他们走后，鱼不往江中间游，都叫别人捞去了’！”。</p>\n<p>　　<strong>四、禁放养鱼池等小水区</strong></p>\n<p>　　严禁将鱼及水生动物放入养鱼池，以养鱼池为卖鱼杀生之来源处，将众生放入其内，乃间接杀生也。也不要放鱼在小的湖水里，小型湖水水面有限，鱼儿无处逃生。也不要把鱼放在小型水库里 冬季不要放夏候鸟，放了反而会被冻死饿死。也不要放家养的鸟，它自己不会打食，会被活活饿死。放鸟，要买野生的鸟，要把它们带到草木茂密人烟稀少的地方放飞，一旦剩下几只奄奄一息的小鸟，就轻轻的把他们放入深深的草丛中，免被游人捉去。</p>\n<p>　　<strong>五、放生仪式宜简单隆重</strong>，放生过程宜迅速确实，千万不可因人为因素拖延搁置，害笼内众生多受不必要之苦。</p>\n<p>　　不要组织大队的同修过于张扬的放生，以避免有心机的人伺机捕捉。放生仪规要根据物命的情况来决定简繁，必要时先放生，再做仪规。仪规一定要用虔诚心去做,否则没有意义!</p>\n<p>　　<strong>六、不得区分大小贵贱</strong></p>\n<p>　　一味追求数量，而对某部分众生远离慈心。如见两盆鱼，心想若放这盆躯体小的众生，则价钱和数量要比放那盆躯体大的合算。或思维买一大堆田螺的钱，还不够买一只甲鱼的金额。因而弃大舍贵，择小选贱。这样一来，势必会造成未被解救生命的众生怨恨与嗔怒。孰不知躯体越大，价格越昂贵的众生，你放了它，功德也越大。所以放生时不要带着选择和预备买何品种的心去买生，应当遇见什么，就买什么。</p>\n<p>　　<strong>七、要善回向</strong></p>\n<p>　　很多人因为自以为不去执着功德利益，而凡有放生皆不去好好回向。孰知因果成熟，是必然之势。不重视回向，会导致放生功德转化为人天福报，为将来往生乃至成佛，形成阻碍。所以每个修行的人，一定要使功德转向出世间的种种成佛利益。如回向庄严西方极乐世界</p>\n<p>　　<strong>八、未知己知彼，勿随意劝说</strong></p>\n<p>　　轻易不要对无<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>者(尤其是卖鱼的人)宣布和劝化说我买鱼是为了放生做功德，你应当怎样等等。因为并不了解对方对于因果之取舍观念，一旦被其把握和摸索出放生者出没的时间规律，所偏重放之品种，即便每次给放生者开诸方便，放生亦流于形势而形成弊端。使卖者为了放生者的需要而购抓某种众生，而放生者并不见得一次都能将卖者的货量都买掉，使未被放的另一部分众生伤心埋怨。所以轻易不要让卖者知道目的，通晓规律。</p>\n<p>　　对于有的地区已形成此局面者，应亡羊补牢，注意宣传给新的放生者这个道理.</p>\n<p>　　<strong>九、倘使工作失误，勿轻易自咎</strong></p>\n<p>　　释放与解救他人的生命，永远没有过失。许多放者因为工具、因缘及种种不利因素，使所购众生不能全数尽活，便于亡者自愧有<a href=\"/rmgjc/zuie.html\" class=\"keylink\" target=\"_blank\">罪恶</a>感。实际众生从生到死，皆受制于因果，假如你尽力做了，它还是于放前死亡，实属因缘所使。彼既便如此，亦要比被人刀刃烹煮者幸之万倍，据说畜生之苦，不但苦于死时之剧痛，死后之剖解、烹食、乃至被消化后，其痛苦的知觉方无。故这对于被放者而言，使其少苦而终，且免受死后之剧烈痛苦，仍具备不小贡献。况且你把放生的功德回向给他们，对其今后，仍具备积极深远的意义。</p>\n<p>　　<strong>十、放生场所需注意清洁</strong></p>\n<p>　　放生场所选择应当以环境清洁适宜生命成长之地为好，尤其水源应是大河、活水、无工业污染，最好是国家保护区域；放生对象尽量选择能自己独立生存的生命，如：猫、狗、鸟、鱼等。</p>\n</div>"
    }
]