[
    {
        "title": "法身",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x6CD5;&#x8EAB;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022257701.jpg\" /></p>\n<h2>法身（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　梵语dharma-ka^ya，巴利语 dhamma-ka^ya。指佛所说之<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>、佛所得之无漏法，及佛之自性真如如来藏。二身之一，三身之一。又作法佛、理佛、法身佛、自性身、法性身、如如佛、实佛、第一身。据大乘大义章卷上、佛地经论卷七等载，小乘诸部对佛所说之教法及其所诠之菩提分法、佛所得之无漏功德法等，皆称为法身。大乘则除此之外，别以佛之自性真如净法界，称为法身，谓法身即无漏无为、无生无灭。</p>\n<p>　　三身分别为法身、报身和<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。法身经常用明镜、明月等来譬喻。如果不受贪嗔痴慢疑五毒的侵害，自性是清净无暇的。这就是法身。</p>\n<h2>摄论</h2>\n<h3>　　三卷</h3>\n<p>　　十四页云：诸<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>身，以何为相？应知法身略有五相。一、转依为相。谓转灭一切障杂染分依他起性故；转得<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>一切障，于法<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>转，现前清净分，依他起性故。二、白法所成为相。谓<a href=\"/rmgjc/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>多<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，得十自在故。此中寿自在、心自在、众具自在、由施波罗蜜多圆满故。业自在、生自在、由戒波罗蜜多圆满故。胜解自在、由忍波罗蜜多圆满故。愿自在、由精进波罗蜜多圆满故。神力自在、五通所摄、由静虑波罗蜜多圆满故。智自在、法自在、由般若波罗蜜多圆满故。三、无二为相。谓有无无二为相。由一切法、无所有故；空所显相、是实有故。有为无为无二为相。由业烦恼、非所为故；自在示现有为相故。异性一性无二为相。由一切佛所依、无差别故；无量相续现等觉故。此中有二颂。<a href=\"/rmgjc/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>、不有故；于中无别依。随前能证别，故施设有异。种姓异、非虚、圆满、无初故；无垢依、无别；故非一非多。四、<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>为相。谓真如清净相故；本愿所引故；所应作事，无竟期故。五、不可思议为相。谓真如清净，自内证故；无有<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>喩能喩故；非诸寻思所行处故。</p>\n<p>　　二解　无性释九卷五页云：法性卽身，故名法身。或是诸法所依止处，故名法身。</p>\n<p>　　三解　成唯识论十卷十四页云：此牟尼尊所得二果，永离二障，亦名法身。无量无边力<a href=\"/rmgjc/wuguo.html\" class=\"keylink\" target=\"_blank\">无畏</a>等大功德法所庄严故。体依聚义，总说名身。故此法身、五法为性。非净法界独名法身。二转依果、皆此摄故。又云：卽此自性、亦名法身。大功德法所依止故。</p>\n<p>　　四解　佛地经论七卷十二页云：自性法者：卽是如来初自性身。体常不变，故名自性。力无畏等诸功德法所依止故；亦名法身。又云：又法身者：究竟转依真如为相。一切佛法平等所依。能起一切自在作用。一切白法增上所显。一切如来平等自性。微妙难测，灭诸分别，绝诸戏论。故契经言：诸佛法身、不应寻思，非寻思境；超过一切寻思戏论。又云：法身清净真如为体。真如卽是诸法实性。法无边际，法身亦尔。遍一切法，无处不有。犹如<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，不可说其形量大小。就相而言，遍一切处。</p>\n<p>　　五解　<a href=\"/rmgjc/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身有何等相中说。</p>\n<h2>指佛</h2>\n<h3>　　正法</h3>\n<p>　　佛所得的无漏法，及佛的自性真如。二身之一，三身之一。又作法佛、理佛、法身佛、自性身、法性身、如如佛等。《大乘大义章》卷上载，小乘诸部对佛所说的教法及其所诠的菩提分法、佛所得的无漏功德法等，皆称为法身。大乘则除此之外，别以佛的自性真如净法界，称为法身，谓法身即无漏无为、无生无灭。大乘之中，唯识家分法身为总相、别相二种。总相法身为三身之总称，即一大功德法身，以五<a href=\"/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>理为体。别相法身则指三身中的自性身，以清净法界之真如为体。</p>\n<h3>　　佛之真身</h3>\n<p>　　也。其释名性相二宗各异其义。相宗据唯识论谓法身有总相法身与别相法身二种，总相法身者，兼理智二法，与金光明之如如及如如智，谓为法身之义同，是以所证之真如与能照之真觉为法身也。以三身言之，则自性身与自受用报身之二身合见。依此义释之，则法身为理智显现，有为（智）无为（理）一切功德法体性之所依，故名法身。又成就庄严一切之功德法，故言法身。唯识论十曰：‘此牟尼尊所得二果永离二障，亦名法身，无量无边力无畏等大功德法所庄严故。（中略）此法身五法为性，非净法界独为法身，二转依果皆摄此故。’别相法身者，即三身中之自性身，唯为清净法界之真如也。此真如为佛之自性，故名自性身，又此真如具真常之功德（是无为也），为一切有为无为功德法之所依，故亦名法身。惟不得言成就庄严功德法，故名为法身，何则？以此法唯为理之法身，不含摄有为之功德（即智法身）也。唯识论十曰：‘即此自性亦名法身，大功德法所依止故。’佛地论七曰：‘力无畏等诸功德法所依止，故亦名法身。’述记十末曰：‘离所知障，具无边德，名为法身，（中略）功德法依名法身。’唯识枢要上本曰：‘出缠位功德法本，名曰法身。’义林章七本曰：‘成唯识说，清净法界为自性身。庄严论等说，自性身本性常故。赞佛论说，佛自性身无生灭故。’若依性宗之义，则真如之理性，有真实觉知之相，理智不二，与真如之无为同，真智亦无为也。又性相不二故，真如即法性，则真智亦法性也。此理智不二法性之隐，谓之</p>\n<h3>　　如来藏</h3>\n<p>　　积始觉之功，显其法性，谓之法身。即言以法性成身，故名法身。或言以法性显现之有为无为一切功德法成就庄严之身，故名法身。胜鬘经曰：‘<a href=\"/rmgjc/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>！过于恒沙，不离不脱不思议佛法成就。说如来法身，如是如来法身不离烦恼藏，名如来藏。’同宝窟下末曰：‘法身者，即是实相真如法也。此实相正法隐，名如来藏。此实相法显，故名身。唯是一实相法，约隐显不同，故有藏之与身。又法者，谓诸功德法，法之所依名身。故摄论云：与功德<a href=\"/rmgjc/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应，名法身。’嘉祥法华疏四曰：‘以正法为身，故曰法身。’起信论曰：‘从本已来，自性满足一切功德，所谓自体有大智慧光明义故，遍照法界义故，真实识知义故，自性清净心义故，常乐我净义故，清凉不变自在义故，具足如是过于恒沙不离不断不异不思议佛法。（中略）满足无有所少义故，名为如来藏，亦名如来法身。’同义记下本曰：‘隐时能出生如来，名如来藏。显时为万德依止，名为法身。’维摩经慧远疏曰：‘佛以一切功德法成，故名法身。’法华玄义七曰：‘本有四德隐名如来藏，修成四德显名为法身。’大乘义章十八曰：‘言法身者，解有两义：一显本法性，以成其身，名为法身。二以一切诸功德法而成身，故名为法身。’梵Dharmak&amp;amacron;ya。</p>\n<h3>　　无漏法</h3>\n<p>　　及佛之自性真如如来藏。二身之一，三身之一。又作法佛、理佛、法身佛、自性身、法性身、如如佛、实佛、第一身。据大乘大义章卷上、佛地经论卷七等载，小乘诸部对佛所说之教法及其所诠之菩提分法、佛所得之无漏功德法等，皆称为法身。大乘则除此之外，别以佛之自性真如净法界，称为法身，谓法身即无漏无为、无生无灭。</p>\n<h3>　　大乘</h3>\n<p>　　之中，亦有数种<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>：(一)唯识家，分法身为总相、别相二种。总相法身为三身之总称，即一大功德法身，以五法事理为体。别相法身则指三身中之自性身，以清净法界之真如为体。(二)三论家，以真如实相不可得之真空为法身。(三)大乘起信论，全论之核心思想旨在阐论自性清净、妄法无体之说，而于论究万法时，以体大、相大、用大等三大来判释众生心，乃至宇宙法界等，例如论及法身说时，即以真如之用大来凸显法身之意义。大乘起信论（大三二·五七九中）：‘除灭无明，见本法身，自然而有不思议业种种之用，即与真如等遍一切处，又亦无有用相可得。何以故？谓诸佛如来唯是法身智相之身，第一义谛，无有世谛境界，离于施作，但随众生见闻得益，故说为用。’此即立理智不二之法身，而谓诸佛如来即是法身智相身，以其不可思议之用大而随应于众生机缘各异之见闻，令皆得化导之益，故真如之用大乃用即无用而益用无边之妙用。此种法身说盖为华严、<a href=\"/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>等一乘家立说之根柢。(四)天台家，持三身相即之佛身观，故其所言法身，非仅指遍一切处之如来，而系谓法身即报、应身，报、应身即法身。(五)华严家，以十身具足之毗卢遮那法身佛为教主，主张十身（菩提身、愿身、化身、力持身、意生身、相好身、威势身、福德身、法身、智身）相即融摄于法、报、化三身。(六)<a href=\"/rmgjc/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>家，以地、水、火、风、空、识六大为大日如来之法身，又称法界身、六大法身。此六大法身具有本来色相，能以言语说法。此外，自性、受用、变化、等流四身皆称为法身，加六大法身，则称五种法身。[无上依经卷上、<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>璎珞本业经卷上、卷下、<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>论卷四、金刚般若论卷上、成唯识论卷十、注维摩经卷三、胜鬘经宝窟卷下末、清凉玄谈卷三、辨惑指南卷三、法华玄论卷九、大乘法苑义林章卷七本、华严五教章卷三]（参阅‘自性身’2525、‘佛身’2629、‘象征主义’5275）</p>\n</div>"
    }
]