[
    {
        "title": "【风水】-风水知识",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>（玄术）</h2>\n<p>　　风水是汉民族历史悠久的一门玄术，也称青乌术、青囊术，较为学术性的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>叫做堪舆。风水是自然界的力量，是宇宙的大磁场能量。风就是元气和场能，水就是流动和变化。风水本为相地之术，即临场校察地理的方法，也叫地相、古称堪舆术，它是一种研究环境与宇宙规律的哲学，人既然是自然的一部分，自然也是人的一部分，达到“<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>合一”的境界是再平常不过的了。相传风水的创始人是九天玄女，比较完善的风水学问起源于战国时代。风水的核心思想是人与大自然的和谐，早期的风水主要关乎宫殿、住宅、村落、墓地的选址、座向、建设等方法及原则，为选择合适的地方的一门学问。</p>\n<p>　　风水有两种释义，其一水肿病的一种，多由风邪侵袭，肺气失于宣降、不能通调水道、水湿潴留体内所致。其二指住宅基地、坟地等的自然形势，如地脉、山水的方向等的体系。</p>\n<h2>古文出处</h2>\n<p>　　何谓“风水”，从古至今给风水下定义者不计其数，可历史上给风水最早下定义的为晋代的郭璞，在其名著《葬书》中有云：“葬者，乘<a href=\"/rmgjc/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>也，气乘风则散，界水则止，古人聚之使不散，行之使有止，故谓之风水，风水之法，得水为上，藏风次之。”可见风水之术也即相地之术，核心即是人们对居住或者埋葬环境进行的选择和宇宙变化规律的处理，以达到趋吉避凶的目的。风水学又有阳宅和阴宅之分。</p>\n<h2>风水详细解释</h2>\n<p>　　1.风和水；风和雨。《宋书·武帝纪上》：“公中流蹙之，因风水之势，贼舰悉泊西岸。” 唐 李远 《咏雁》：“关山多雨雪，风水损毛衣。”</p>\n<p>　　2.风寒与湿气。</p>\n<p>　　北周 庾信 《为阎大将军乞致仕表》：“加以寒暑乖违，节宣失序，风水交侵，菁华已竭。”</p>\n<p>　　3.风光，风景。</p>\n<p>　　唐 李绅 《移九江》诗：“ 楚 客喜风水， 秦 人悲异乡。”《水浒传》第一二○回：“其山秀丽，松柏森然，甚有风水，和 梁山泊 无异。”</p>\n<p>　　4.指遥远而阻隔的路途。</p>\n<p>　　元 辛文房 《唐才子传·李季兰》：“或以从军万里，断绝音耗；或祗役连年，迢遥风水。”</p>\n<p>　　5.指宅基地或坟地周围的风向、水流、山脉等形势。就生者之屋宅而言，谓之阳宅；就死者之坟地而言，谓之阴宅。<a href=\"/rmgjc/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>者认为“风水”的好坏能决定宅主或葬者一家的祸福。旧题 晋 郭璞 《葬书》：“经曰：气乘风则散，界水则止。古人聚之使不散，行之使有止，故谓之风水。”《古今小说·汪信之一死救全家》：“此间 武彊山 广有隙地，风水尽好，我先与你葺理塟事。” 清 袁枚 《新齐谐·诸廷槐》：“或问：‘可是 诸 府祖宗功德修来乎？’曰：‘非也。是他家阴宅风水所荫。’” 郭沫若 《我的童年》第一篇三：“在他的意思，以为我们母亲把 杜 家的祖坟山上的风水一个人占尽了，所以只发我们这一家。”</p>\n<p>　　6.指看风水的人。《儒林外史》第四四回：“他越发慌了，托这风水到处寻地，家里养着一个风水，外面又相与了多少风水。这风水寻着一个地，叫那些风水来覆。”</p>\n<p>　　7.比喻情势。</p>\n<p>　　元 郑廷玉 《楚昭公》第三折：“大家要看个风水。实是船小，载不起这几个人。” 朱道南 《在大革命的洪流中·广州起义》：“这两个家伙不看看风水，尽在‘赤子赤孙’面前出洋相。”</p>\n<p>　　8.中医学病症名。谓受风邪而致肺部肿胀、痰涌等症。</p>\n<p>　　汉 张仲景 《金匮要略·肺痿肺痈咳嗽上气病》：“上气喘而躁者，属肺胀，欲作风水，发汗则愈。”[1]</p>\n<h2>溯源</h2>\n<p>　　风水，可以追溯到悠久的远古时代。</p>\n<p>　　“形法”与“理法”：中国风水“形法”主要为择址选形之用；“理法”则偏重于确定室内外的方位格局；此外，还有“日法”</p>\n<p>　　用于选择吉日良辰以事兴造；“符镇法”为补救各法选择不利的措施。中国风水学按照应用对象：又分阳宅风水，即阳宅相法，专司生人居住的城郭住宅的择址布形；阴宅风水，即阴宅葬法，专司死者的陵墓坟冢的择址布置。 　中国风水对于住宅所处环境不同，又有所谓井邑之宅、旷野之宅、山谷之宅等区分，如《三元地理》，在风水学应用上，又各有所侧重。对于旷野之宅和山谷之宅，因其与周围自然地理环境关系密切，多注重形法；而井邑之宅，则因其外部环境的限制，常以形法、理法并举。中国风水的形势派，注重觅龙、察砂、观水、点穴、取向等辨方正位；而理气派，注重阴阳、五行、干支，八卦九宫等相生相克理论，并且，建立了一套严密的现场操作工具枣罗盘，确定选址规划方位。中国风水学无论形势派，还是理气派，尽管在历史上形成了众多的实际操作方法，但是，都必须遵循如下三大原则：天地人合一原则；阴阳平衡原则；五行相生相克原则。风水理论实际上就是地球物理学、水文地质学、宇宙星体学、气象学、环境景观学、建筑学、生态学以及人体生命信息学等多种学科综合一体的一门</p>\n<p>　　自然科学。其宗旨是审慎周密地考察、了解自然环境，利用和改造自然，创造良好的居住环境。古代汉族人民常说：“宅以形势为身体，以泉水为血脉，以土地为皮肉，以草木为毛发，以舍屋为衣服，以门户为冠带。若是如斯，是事俨雅，乃为上吉。”这是把住宅人性化，说明格局搭配得当，对住宅与人都是很重要的。</p>\n<p>　　天地人合一：风水贯穿在中国传统建筑活动的各个过程。从选址规划、建筑单体、园林小品、室内外装修设计到施工营造，几乎无所不在，从现代房地产品牌策划角度，以现代居住区建筑布局进行风水规划，应首先树立几个风水观点：太极泛存观；场气万有观；场气导引观。</p>\n<p>　　1.太极泛存观：一个城市，一个村镇，一个庭院，一幢建筑、一户住宅，一个房间……都是一个太极，只是层次不同而已。住宅建筑布局，既看其自身的太极，也看建筑组群的太极，建筑群布局，应以地形方整、太极完整为宜。不宜缺残某部分建筑的位置。建筑地段布局应十分注意太极图的场气效应，慎重选择空地，建筑群组团内的小游园绿地，应选在中心地段，并应有建筑小品布置。在住宅设计中，一幢住宅也不宜缺角。住宅楼层内部各户不宜交错分户，造成各户平面缺残某角。</p>\n<p>　　2.场气万有观：风水学的五大要素龙、穴、砂、水、向，其本质是气。寻龙，捉穴，察砂，觅水，定向，是在于察寻适于人体的吉气，避开不利于人体的煞气，趋吉避煞，在于对气的趋，避。物物之间存在场，气来自场。现代科学已初步察证，人体有场气，植物有场气，建筑物有场气、万物之间皆有场气。恰如万有引力一样，场气也是万有的。一幢建筑可以无足轻重，但如组成建筑群，场气可能剧变。</p>\n<p>　　3.场气导引观：风水之气，是宇宙场气、地球场气、地域场气、建筑组群场气、植物场气和人体场气的统一场气中的气。宇宙、地球、地域的场气，为大场气。大场气，虚处来，实处止。阳宅多选在类似盆地、半盆地（山环、山湾）中，这种地域，土肥水上，宜于民生，利于接纳大场气。场气的性状，是螺旋式运动的，任何局部某一层次的螺旋式运动的场气，都是宇宙大环境的一部分。</p>\n<h2>流派</h2>\n<p>　　在理气的方法上，大致可分成两个大的流派，下统诸多分支。直接采用八卦卦理理气的流派是卦理派。</p>\n<p>　　包括八宅派、玄空飞星派（内有六个大的派系，统百多个小的派别）、奇门风水、河洛风水、大三元易理派、金锁玉关等。采用河图、洛书和先后天八卦的阴阳五行原理理气的流派是五行派。包括赣南杨公风水术、新三合派、命理风水、正五行风水术等。中国风水学已经发展为多流派的风水学，每一派的风水学都有不同的理论，下面为你详细介绍：</p>\n<p>　　形势派：（1） 峦头派、（2）形象派、（3）形法派；</p>\n<p>　　理气派：（1）八宅派、（2）命理派、（3）三合派、（4）翻卦派、（5）飞星派、（6）五行派、（7）玄空大卦派、（8）八卦派、（9）九星飞泊派、（10）奇门派、（11）阳宅三要派、（12）廿四山头派 （13）星宿派、（14）金锁玉关派；</p>\n<p>　　命理派：根据人的出生时间阐述地理环境对人产生的影响。</p>\n<h2>风水水法</h2>\n<p>　　风水实践中最主要的是水法，所谓水法就是调整建筑物朝向与流水之间的关系，使之处水最佳位置，现代风水中的“水”则泛指一切流动的气场，如道路，水管等。下面列举风水水法的主要流派。</p>\n<h3>　　十二长生水法</h3>\n<p>　　水口在：丁未坤申庚酉，生在甲卯，旺在乾亥，墓在丁未。水口在：癸丑艮寅甲卯，生在庚酉，旺在巽已，墓在癸丑。水口在：辛戌乾亥壬子，生在丙午，旺在艮寅，墓在辛戌。水口在：乙辰巽已丙午，生在壬子，旺在坤申，墓在乙辰。此为杨公十二长生水法。如：未山丑向，乙辰方来水，水口在乾亥：辛戌乾亥壬子，生在丙午，旺在艮寅，墓在辛戌，所以乙辰方来水为冠带水论。</p>\n<h3>　　四大救贫水法</h3>\n<p>　　杨公水法四大局，阴阳四局辰戌丑未四墓库。凡天造地设的真龙城局必有水口地户。二十四山四十八向，四局四墓之内，龙凡养、生、沐、冠、临、旺之六龙可取，故杨公曰：金龙。凡衰、病、死、墓、绝、胎六龙不可取用之。</p>\n<h3>　　羊刃禄堂水法</h3>\n<p>　　杨公水法真诀莫不是师承，非师传之真诀，必定被误导，因为历代师者不轻易外传，以上所述也无非是托名杨公的伪作。杨公水法是以真龙真穴为体，消砂纳水为用。若只顾在立穴而收砂收水，不顾龙穴的真假，就落入弃本置末之下乘作法。得不到真龙，砂水皆不为我所用，尽管消砂纳水做得巧夺天工，也是枉然的。一切祸福，皆在龙真穴的、收山出煞上。若是龙不真，穴不的，收不得山来，出不得煞去，“峦头为体，理气为用”是<a href=\"/rmgjc/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。如果能掌握杨公水法的“羊刃、禄堂”之分，算是初步掌握了杨公风水收放水之法，但其中又有八煞、黄泉，及救贫黄泉等之法，如能正确撑握，富贵荣华尽在期间。杨公水法，精简快捷，真假立辨。雌雄配合，阴阳交媾，就是“杨公水法”的玄关。所谓交媾，就是说物物自具雌雄之性。雌雄与山水之理相应而生旺，如“乾山乾向水流乾，乾峰出状元”是也。</p>\n<h3>　　正神零神水法</h3>\n<p>　　正神正位装，即要将“龙顶”装在正神位上，正神方位内的山峰要百步始成龙气，而零神方位里的水，则不论其水面的阔狭，水源的长短，只要能低空而不填实，就可论为吉祥。山龙是如此用法，水龙也是如此用法，交媾的原理，是以不变应万变，用之于四海而皆准。“山上龙神不下水，水里龙神不上山”是杨公风水的天机妙诀。“绝地诀”、“贫单绝”、“城门诀”“玉辇经”“门楼经”等之理论，是杨公水法阴阳造化之玄机。</p>\n<h3>　　中火星水法</h3>\n<p>　　杨公水法的“挨星”理论是指三元九运星气的旺衰得失；以“排山掌诀”来定。“中星”“火星”顺逆是杨公水法又一个秘诀，“中星归库永代兴，火星归库永世贵”是也。山水合阴阳有情，廿八宿为用，龙砂向水相配合，才能称之为“杨公水法”。</p>\n<h3>　　进神水法</h3>\n<p>　　杨公水法曰：明堂里面要平地，明堂里面有储水，第一宽畅平整为贵。龙真穴正而误立向，葬下一样可以发达，其虽发达得功名，可有祸隐不测，何故？是因为水法错误，犯了“羊刃”“禄堂”之向，向上吉气收不进来，向上来去之水不能为我所用，水主财禄，禄即是奉禄官禄，官禄不为我所用，焉有不丢官之理？真龙真穴得运又水法吉向，才能“催财催贵”。何谓吉向？一不犯“黄泉曜煞”，二不犯“羊刃禄堂”，三砂水要“生入克入”。如此之后再以八卦论吉凶，一卦纯清者大吉，二卦者兼生旺可富贵，三卦者杂气不吉。</p>\n<h3>　　七星打劫</h3>\n<p>　　\"七星打劫\"是杨公风水的秘诀，非真传<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>难以了解，市面上流传的“七星打劫之法”一般都不可信，以下摘录一些零散的文章，以满足读者好奇之心。</p>\n<p>　　先天八卦讲：天地定位、山泽通气、雷风相搏、水火不相射。确定了一个立体的自然环境模式，以及其自然现象。后天八卦：其内容讲：坎离定南北，帝出乎震。一讲地平方位，一讲天体运行所产生的气候变化规律。地理之学，根据后天八卦所述规律，在先天八卦立体模式中，寻找人居的地理环境和地平方位。故地理“城门一诀”，讲求先后天互用。以上观点，应该属于形势范畴，形势家从先后天八卦中所寻找的理论依据。无非山水左右旋的形势配合（一如太极图之阴阳鱼图形），结合天元龙立天元向的规则。考察很多古坟，也是如此制作的。古来大地皆有留存，何以？元运不合也。此乃《玉函》讲求的主要内容。所谓真传一句话，讹传万卷书，有缘之人方可得之。杨公秘诀“七星打劫”序：“天上北斗司元气化育万物者也，斗柄指东天下皆春……阴阳二宅在囗囗囗囗在囗元而发丁财……”。</p>\n<h3>　　文昌水法</h3>\n<p>　　“一白水，为魁星生旺，少年科甲，名播四海，多生聪明智慧男子，……四绿木，为文昌，生旺文章名世，科甲联芳，女子容貌端妍，联姻贵族。”《玄机赋》曰：“坎元生气，得巽木而附宠联欢”，“名扬科甲，贪狼在巽宫”，“木入坎宫，凰池身贵”。《紫白诀》曰：“四一同宫，准发科名之显”。“四绿为文昌之神，职司禄位;一白为官星之应，主宰文章。还宫复位固佳，交互叠逢亦美。”《地理精纂》曰：“一四同宫主科名，号青云得路，有文笔砚池水，鼎元之兆也”。这些论述，都表明文昌位的作用是准发科名。现代社会以文章取科，文章盖世者，即能青云得路，所以在文昌位读书，是很有作用的。</p>\n<p>　　文昌位有固定和随运而转两种。按固定而言，地盘的巽宫，就是文昌位。巽在东南角，在此角读书，可以得文昌之辅。按宅性而言，坤宅，巽位得四一同宫。如果立二运坤艮向，巽位得四四一，文昌星还宫复位。同时，坎位亦得一一四，文章魁星也还宫复位。这两个位置对读书人非常之好。还有，兑宫也有一四同宫，对读书人也很有利。所以，二运得坤宅的人，家中必有著名人才出世。艮宅，坎位得一四同宫。如果立八运艮山坤向，坎位得一一四，文章魁星还宫重位。同时，巽宫亦得四四一，文昌星也还宫复位。这两个位置对读书人非常之好。还有兑宫也有一四同宫，对读书人也很有利。按随运转变的方法去找寻一四同宫，也不困难，各个山向之宅，都有文昌位，只是组合有些不同而已。</p>\n<h3>　　八煞黄泉水法</h3>\n<p>　　杨公水法是指杨公风水在实际操作过程中对山水调整的操作方法，主要是根据罗盘二十四山来推定吉凶。“乾山乾向水朝乾，乾峰出状元；卯山卯向卯源水，骤富石崇比，午山午向午来堂，大将值边疆；坤山坤向坤水流，富贵永无休”。此诗明确了杨公风水八卦先后相配之要诀。又如：“八煞黄泉水法”，“救贫黄泉水法”，“九星水法”；诗云：“壬山沧沧水云囗，龙碓磨坊一同寻，囗囗有路人吊死，若有圆墩食药人，囗囗有树头上枝，囗囗有桥出仙人，囗囗有石高照破，两宫相会破<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>。”，“羊刃禄堂水法”则云：“羊刃来水见花休，水流疾病产下忧……”。杨公水法是杨公风水的精华之所在。</p>\n<h3>　　水法的继承与发展</h3>\n<p>　　风水学是一门学问，更是一种文化，同时也是人与自然和谐相处的方法。在风水的实践过程中，建筑是体现风水文化的重要载体，许多牌楼、桥梁、庙宇、宗祠、住宅及坟墓以及皇宫丘陵都烙有“风水学”文化的痕迹，杨公风水作为中国风水学传承的主要流派，历代杨公的弟子正是这种文化的继承者与传播者。如曾文辿、刘江东（刘七碗）、黄妙应、厉伯绍、叶七、刘淼等堪舆名流均是杨公的真传弟子。其后，堪舆学即“杨公风水学”在赣南口口相传。“文革”期间，由于杨公风水学发祥地江西兴国三僚村杨公嫡传弟子对风水文化的竭力保护，才使其完整保留延续至今。当代杨公水法的知名学者也有很多，如曾氏一脉传承的第36代弟子梁惟朝，刘氏一脉传承的第37代弟子刘国胜等等均系“杨公风水学”的嫡系传承者，为杨公风水学后继有人奠定了基础。</p>\n<p>　　杨公风水学既重形势、重龙脉，又重于理气。凡得到杨公真传的历代堪舆师大多技艺精湛。杨公及其高徒所堪定的古坟、古墓历经千年而不衰。不但赣南，在广东、福建、广西等各省的许多望族的族簿上都记载了他们的名字。历史是最好的证人，事实证明杨公的堪舆活动，使堪舆文化迅速传播，大量的建筑实践，杨公风水有了用武之地，并逐渐影响到整个中国。</p>\n<p>　　随着时代的发展，科技的进步，风水水法理论已经被许多有识之士所认同，学习水法也不乏其人，从白发苍苍的老人，到80后90后，甚至国外的一些中国文化爱好者，均对风水产生了深厚的兴趣，相信未来风水这一自然和谐的风水理论一定会在世界建筑和文化史上留下一席之地。</p>\n<h2>科学性</h2>\n<p>　　古代汉族人民搞风水，最初的原因有两个方面：一是有利于农业生产，二是有利于居住。在衣食富足以后，古代汉族人民搞风水的根本目的就出现了，由以上两个方面转变为为了富贵或长寿，可富贵或长寿的前提条件是吃饱肚子，住得踏实，因此说风水的科学性就体现在好风水有利于农业生产，有利于人类居住。</p>\n<p>　　风水的标准主要有六项：山环、水抱、朝案有情、水质甘甜、土地红黄细腻有光泽、得地还应得时得向。</p>\n<h3>　　山环</h3>\n<p>　　山环指一个地方（指平原）要三面或四面有山环抱，山环抱之地多是平原，平原又称冲积平原，冲积平原的土来自于周围山上被雨水冲刷下来的风化土，另一方面，环抱的山如同一个容器使风化土聚集而不是向外扩散，土层越来越厚，有利于农业生产的冲积平原就逐渐形成了。因此环抱冲积平原的山既是平原的土质来源，又是平原的支持维护者。与山环相反的是山反背，山反背之地由于无法聚集被雨水冲刷下来的风化土，平原也就无法形成。</p>\n<h3>　　水抱</h3>\n<p>　　水抱，就是好风水的所在前面有河流环抱。前面河流环抱有什么好处呢？前面我们说过，阴阳宅一般都选在冲积平原上，冲积平原是如何形成的呢，是河水冲刷四周环抱山上的风化土而来，因此，环抱的山为冲积平原提供的是土质来源，冲积平原形成的动力来源就是河流。</p>\n<p>　　从中国的地形图上看，代表平原的绿色地区基本上都在大江大河的中末端，说明这些平原都是大江大河冲刷上游山上的风化土形成的，大江大河是冲积平原形成的动力来源。</p>\n<h3>　　朝案有情</h3>\n<p>　　就是冲积平原前面必然有朝山和案山，他们有情的标志就是环抱冲积平原。</p>\n</div>"
    }
]