[
    {
        "title": "佛诞",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x4F5B;&#x8BDE;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022239298.jpg\" /></p>\n<h2>浴佛节（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　同义词 <a href=\"/rmgjc/fodan.html\" class=\"keylink\" target=\"_blank\">佛诞</a>一般指浴佛节</p>\n<p>　　浴佛节，又称佛诞日、佛诞节等，为每年的农历四月初八，是<a href=\"/rmgjc/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>释迦牟尼诞辰。</p>\n<p>　　史书记载<a href=\"/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>生于周昭王二十四年（西元前1027年），是迦毗罗卫国（今尼泊尔境内）王子。传说降生时一手指天、一手指地，大地为之震动，九龙吐水为之沐浴。现世界各国各民族的佛教徒常以浴佛等方式纪<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>祖诞辰。</p>\n<h2>节日简介</h2>\n<p>　　浴佛又称灌佛，在古印度佛教中即为一种重要仪式，其源则在释迦降生的历<a href=\"/ctwh/ershisishi/shiji/\" class=\"keylink\" target=\"_blank\">史记</a>载之中。据《过去现在因果经》卷一所记载，摩耶夫人怀胎临近产期之时，路经蓝毗尼园，行至无忧树下(亦称婆罗树或波罗叉树)，诞生了悉达多太子，此时，难陀和优波难陀龙王(另一说有九龙)吐清净水，灌太子身。这一历史传说在古印度时即已流行，近代在印度<a href=\"https://www.guang5.com/fxrm/fxcs/347329.html\" class=\"keylink\" target=\"_blank\">鹿野苑</a>和阿摩罗伐底出土的佛传雕刻，都有反映这种情景的构图。后世浴佛是在<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>诞生之日举行。</p>\n<p>　　在3000多年前的古印度（现尼泊尔），有一个富庶的迦毗罗卫国，国王称为净饭王。净饭王有两位妻子，一曰摩耶夫人，次曰摩诃波波提。净饭王仁慈和善，善理国政，只可惜多年没有子嗣。有一天，摩耶夫人梦见有一匹六牙白象进入她的身体，随后就有了身孕。当时的印度有一习俗，女子在生产之前要回到娘家去。摩耶夫人也在此时动身回家。当她走到蓝毗尼园婆罗树下时，心中异常欢快。这时，摩耶夫人突觉腹痛，随后太子降生。小太子生下来就会走路，双脚各踩一朵莲花，一手指天，一手指地，说：“天上地下，惟我独尊。”这一天适逢中国农历四月初八，即为佛诞日。是日，各地佛教<a href=\"/rmgjc/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>均云集庙内，参加浴佛。在佛殿上，供奉着太子佛像，四众<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>顺序用小铜勺盛满香汤浴灌太子佛。在此前后还举行相关的法会，称为“浴佛节”。</p>\n<p>　　南传佛教也非常重视这一节日。傣族全民族<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>南传佛教，过节时，他们无论男女老少，都在清晨到各个佛寺中敬佛、斋僧，举行送旧迎新的仪式，行浴佛礼，给佛像洒清水“洗尘”。而后便开始互相泼水，嬉笑追逐，进行放高升、赛龙舟、赶摆、丢包等活动，这就是著名的傣族泼水节（另有7女除魔的神话阐述泼水节的另一来历）。藏传佛教同样重视这一节日，称为“四月法会”，一般活动要延续好几天，包括诵经、跳欠（也称为跳布扎、跳法王舞、跳神等）、到各个佛殿<a href=\"/rmgjc/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>等，而泼水的习俗，仅在年轻的小和尚之间进行。</p>\n<h2>历史源起</h2>\n<p>　　顾名思义，佛诞即释迦牟尼佛祖诞生之日。</p>\n<p>　　如来生期，多有异说。虽则皆有理致，究不如周昭王二十四年者为恰当。即公元前1027年，农历四月初八，佛祖诞生在北印度，有天上九龙吐出香水为太子洗浴。因此典故，便有了庆祝的重要内容之一：以香水沐浴佛身。所以，浴佛节又名佛诞节。</p>\n<p>　　每年的农历四月初八，是一年中最隆重的佛教节日之一，是释迦牟尼佛的诞辰日，又称佛诞节，是从求福灭罪的一种<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>要求传衍而来。中国东汉时仅限于寺院举行，到魏晋南北朝时流传至民间。浴佛时间在史籍中有不同记载。蒙古族、藏族地区以四月十五日为佛诞日，即佛成道日、佛<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>日，故在这天举行浴佛仪式。汉族地区佛教在北朝时多在农历四月初八举行，后不断变更、发展，北方改在农历十二月初八(腊八节)举行 ，南方则仍为农历四月初八举行 ，相沿至今（俗称“四月八”）。傣族的泼水节在傣历六月（夏历四月）举行 ，清晨，男女老幼沐浴更衣，到<a href=\"/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>寺院<a href=\"/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，就带有浴佛的性质。</p>\n<p>　　唐朝</p>\n<p>　　<a href=\"/rmgjc/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>普照遍长安，吃斋诵经建寺庵。</p>\n<p>　　<a href=\"/fxwd/jsrwwd/\" class=\"keylink\" target=\"_blank\">居士</a>男女多布施；为求来生结善缘。</p>\n<p>　　相传夏历四月初八日为释迦牟尼生日，佛寺常于此日诵经，以各香浸水灌洗释迦之太子诞生像；纪念佛之诞生，称为浴佛节。唐代佛教信仰极盛，长安善男信女多于此日施舍。此风迄宋明依然。《东京梦华录》：『四月八日佛生日，十大禅院各有浴佛斋会，煎香药糖水相遗，名曰浴佛水。』《日下旧闻考》：『京师僧人念佛号者，辄以豆记其数。至四月八日佛诞生之辰，煮豆微撒以盐，邀人于路请食之，以为结缘。今尚沿其旧也。』</p>\n<h2>文化传承</h2>\n<h3>　　精神作用</h3>\n<p>　　1、浴佛是藉外在的佛来洗涤我们内在的尘垢，让自性显发，同证如来的清净法身。</p>\n<p>　　2、除缅怀佛陀之外，就是要我们净心，以浴佛的功德度脱七世父母及累劫怨亲眷属早离厄难，使法界<a href=\"/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生出离<a href=\"/rmgjc/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。</p>\n<p>　　3、今日社会人心不古，平常我们身体脏了可以用水洗净，衣服脏了也可以用水洗清；但人心的污秽黑暗，则要用佛的法水洗涤，故举行浴<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>会，实际上是籍此来洗涤我们的心灵。</p>\n<p>　　4、浴佛是提醒我们时时保有一颗清净心，透过浴佛节观照自己内心是否清净。</p>\n<h3>　　文化意义</h3>\n<p>　　三千多年前，释迦牟尼佛诞生在印度北部的兰毗尼园。传说佛陀降生时，园中百花齐放，天空出现九条龙，由龙口吐出香水为婴儿（佛陀）沐浴。据《佛本行集经．树下诞生品》记载：“生已，无人扶持，即行四方，面行七步，步步举足，出大莲华。”这就是说，悉达多太子诞生不久，就面向四方各行走七步，每走一步，足下生出一朵莲花。并且一手指天一手指地，说道：“天上天下，唯我独尊。”</p>\n<p>　　四月八日这一天是普天同庆，具有纪念性的日子。因为<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>在这一天降生人间。这一天佛陀诞生了，他的智慧，他的慈悲，使我们从无明和黑暗中见到了光明。我们平常人都是凡夫，凡夫就是跟着凡夫的心态转，转得乱了，烦恼无尽，苦海茫茫。而佛陀大转法轮，他要把人生的真理，智慧的真理遍布给大地上颠倒而烦恼的众生，要把众生的思考、观念扶正，要指导他们有一条很正面、很光明的道路。这就是佛的救世精神，关怀众生，救度众生的精神。在两千五百多年前的这一天，有了这位出生在人世间的大智慧者，我们才会有今天的省察，才知道人生的生命价值，才知道要怎样把纷乱的心，轮转成清净光明的心，回归正觉，所以我们要充满<a href=\"/rmgjc/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>。</p>\n<p>　　四月初八日，这一天在日本，称为“华节”，也很隆重，要以各种鲜花供佛。而在中国，就称为“浴佛节”，这一天所有的佛教徒在寺庙里都举行浴佛仪式。为甚么要浴佛呢？庆祝，只要到寺院拜佛就好，为甚么还要浴佛呢？其实，佛本来就是清净的，那里需要洗浴呢？这只不过是一番象徵。我们回溯佛陀出生时，这一天是四月初八，圣人出生，觉者降临世间，人出生总是要沐浴，何况九龙吐水？这就是在纪念那一天，释迦牟尼出生时，要沐浴身体，所以叫庆生，纪念圣人的出世。</p>\n<p>　　浴佛的真实意义，还在一个更高的层次上：释迦牟尼佛的诞生为世间带来清凉的佛法，更为迷失的众生找到一条<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之道，因此希望藉着浴佛仪式，来清净人们自身、洗涤我们的烦恼妄心，去妄离执，时时以承续佛法慧命为业，让佛的慈光永照人间。浴佛的意义，除了缅怀佛陀之外，更是要我们净心。浴佛是在洗涤我们的尘垢，让自性显发，同证如来的清净法身。所以浴佛的意义，就不仅是洗浴太子神像，而是洗涤我们内在身心的浊染，让我们身心能得到洁净、轻安。使我们获得无上功德。</p>\n<p>　　浴佛节我们在浴佛时，要唱诵经偈。其中云：“我今灌沐诸如来，净智庄严功德海”，就是说我们用水灌浴佛时，要用虔诚的心，用清净香水灌浴，更重要的，是庆祝“净智庄严功德海”。虽然我们浴佛用的水不多，但是我们观想，观想净智庄严智慧如海，功德如海。清净的香水沐浴佛身，也沐浴了大江南北，沐浴了人类的自我心灵。同时，这又寄托了我们一份虔诚的期待，就是“五浊众生离尘垢，同证如来净法身”。我们在浴佛时，内心要有这分虔诚，我们是凡夫，凡夫在五浊恶世里，感恩佛陀来到人间，他的佛法能洗除众生的无明烦恼，能使众生增长智慧，所以说“五浊众生离尘垢”，达到“同证如来净法身”的崇高境界。这就是我们的期待。</p>\n<p>　　能不能“同证”呢？我们在浴佛身，实在也是在净化我们自身，愿我们自身，也能清净如来身。如来身就是法身，如来的法身，清净身跟我们众生原为一体，众生本来就有<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，与佛是平等的。只要我们把五浊不净的染污洗除了，自然就与佛同心，证到清净的法身了。</p>\n<p>　　浴佛是在提醒我们时时保持一颗清净心，庆祝浴佛节我们应观照自心是否清净，这才是最为重要的真义所在。</p>\n</div>"
    }
]