[
    {
        "title": "佛教对【佛事】的定义",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>佛事（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　凡发扬佛德之事，称为佛事。又作立地。据维摩经卷下载，<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>将一切事均视为佛事，以此表示佛之德性。于<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>，用以指举扬<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之行事，如开眼、安座（安置佛像于堂内）、拈香、上堂、入室、普说、垂示等，均为佛事。后世泛称于佛前举行之仪式为佛事，又称<a href=\"/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>、法会，或指<a href=\"/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>亡灵之诵经。</p>\n<h2>简介</h2>\n<p>　　在葬仪中担任导师之人，称为佛事师。于禅林中之三佛事（奠茶、奠汤、秉炬）、五佛事（起龛、锁龛、奠茶、奠汤、秉炬）、九佛事（入龛、移龛、锁龛、挂真、对真小参、起龛、奠茶、奠汤、秉炬）等，分别由三人之佛事师、五人之佛事师、九人之佛事师负责。又在葬仪、法会中所得之金钱，称为佛事钱。敕修百丈清规卷七板帐式之夹注（大四八·一一五○上）：‘仍量唱衣钱多寡，则排日、表嚫、讽经、看经、添奠茶汤、转龛骨等佛事。’又导入佛法之方便，称为佛事门或庄严门。[禅苑清规卷四殿主钟头、行持轨范卷三丧仪法、临济录示众]</p>\n<h2>观音香会</h2>\n<p>　　每年农历二月十九观音圣诞日，六月十九观音成道日，九月十九观音<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>日，为普陀山三大香期。此三月之初十前后，国内外<a href=\"/rmgjc/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>纷纷上山，十八、十九日达到高潮。十八日三大寺例行庄重的祝诞普佛和观音法会，词条解释不全面、完整。通常有上千僧众和信徒参加。晚上数千人在圆通殿内外坐香，齐诵大<a href=\"/rmgjc/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>世音名号。翌晨，三步一拜上佛顶山。十九日中午，各寺庵上大供，由住持带班顶礼祝福，设斋供众，晚卜举行随课普佛。此时，大众齐声唱念顶礼诸佛<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>名号，拜愿此起彼落，庄严肃穆。同时，普门、地藏、普贤、文殊诸殿诵拜各类经忏，寺内灯烛辉煌，通宵达旦。香会期间，各地信徒及旅游观光者常达一二万人。</p>\n<p>　　三大香期起源于观音应化诞生或成道等日。据载，唐元和年间（8O6—82O），观音<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>庞蕴之女灵照，制作鱼篮供父修禅，后代父涅梁，<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之日，传为观音诞日。陕西省西安<a href=\"https://www.guang5.com/fjsy/fengmao/6503.html\" class=\"keylink\" target=\"_blank\">五台山</a>回光寺，旧有元代至正元年（1341）僧普明所撰碑记，载隋仁寿年中（6OI—6O4）此山有毒龙残害生灵，大士化<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，以妙智力，伏彼妖术，朝廷建寺请为住持。翌年六月十九日，恬然寂灭，于空中现瑞丽相。是为六月香期之来历。另有传说，二月十九日为大士转劫诞生日，六月十九为舍身披度日，九月十九日为得道日。</p>\n<h2>祭祝</h2>\n<p>　　岁时追荐、春秋祭祖乃饮水思源、慎终追远之事，向为注重报恩之释子所崇，既表师承有序，又示崇敬师恩。本山各寺院庵堂继承汉传佛教传统，立有祖堂，以便朔望<a href=\"/rmgjc/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>，岁时祭祖。前后两寺更对道行卓著、有功于寺院之住持专立公堂；对复兴护持三宝有功之檀越立词供像，以使后人于祭拜之时，发见贤思齐之心。如潮音和尚建“先觉堂”奉普陀列祖暨历代诸师。也有某师派下之公堂，如“立三老人派下子孙公堂”。祭祖个人的则有永悟公堂、别庵公堂、通智公堂化闻公堂等。奉把檀越的则有副帅何公生祠、黄公祠、前、后的寺之蓝公词、法雨寺陈黄二公词、施公生词等。民同间只存少数词学和公堂，其后渐圮毁。现除二大寺仍有祖堂外，其余庵院尚无祖堂恢复，三大寺的祭祖，也只在岁时大节和重要法会活动时才举行。扫塔古制在冬两次扫塔，以为不忘祖恩，并载入寺规。《普陀洛迦新志》卷八《法雨寺规制》中有：“开山祖塔，木本所在，每岁冬二十四日，春清明正日上午，集各房静室拜扫。若普同塔、苏公塔、明公塔，随例举行。下午，则<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>人众拜<a href=\"/fgsl/slt/\" class=\"keylink\" target=\"_blank\">舍利塔</a>，各房静室从便。若属中兴子孙，系铁祖法派者，随班俱集。”“观音洞扣公塔，两节于礼祖次日，住持领众拜扫。”这是与祭祀并行而相得益彰的传统，本山历来重视。</p>\n<h2>个人佛事</h2>\n<p>　　超度亡灵、求学、求子、求财、求寿、求福等求佛之事，均可在寺庙道场，请出家僧人主持，举行庄严而隆重的求佛仪式，即为个人佛事。整个过程涉汲：僧人诵经、打表升疏、施焰火、施斋饭、<a href=\"/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>许愿等等。</p>\n<h3>　　打表升疏释意：</h3>\n<p>　　打表升疏乃佛家法事，如开启宝库之钥匙，简单快捷，直接传递心灵信息。升疏者先把心愿录于黄表、红表，在佛前燃升，以达旨意。可立显佛法之匡扶，得法事以周隆，愿望天成，齐家获福。</p>\n<h3>　　打表升疏须知：</h3>\n<p>　　凡打表升疏者，请在佛前先上三柱香，然后将自己的住址、姓名、生辰及所求之事叙述清楚、完整。代别人升疏者，可以写当事人名，也可以写委托人名。疏封好后，双手虔诚接过，以双手拇指、食指掐住疏皮两侧底边，封面朝前，平端于胸部。跪在佛前默祷所求之事，待疏燃尽，随磬声磕三个头，即可。打表生疏是各种佛事必务的一道手续。您定会得到吉祥和幸福。</p>\n</div>"
    }
]