[
    {
        "title": "夫妻（名词解释）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x592B;&#x59BB;&#xFF08;&#x540D;&#x8BCD;&#x89E3;&#x91CA;&#xFF09;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022342220.jpg\" /></p>\n<h2><a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>（词语解释）</h2>\n<p>　　即人类只有如此才美好的人生形态，是指生理成熟的男人和女人以<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>为纽带结为一体的各自以自己所能无条件帮助和成就对方需要的<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>主要角色关系，男人叫丈夫，女人叫妻子。夫妻一旦结为一体，就自然形成有次序的家庭角色关系。若非一方包容和隐忍，夫妻关系就名存实亡甚至解体。夫妻双方各自只有<a href=\"/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>分享自己所有、帮助和成就对方需要的义务，没有要求对方按照自己期望满足自己需要和做对方行为判官的权力。</p>\n<h2>探源</h2>\n<h3>　　夫字由来</h3>\n<p>　　“丈夫”在古时指成年男子，有时候也指男子中的杰出者。《榖梁传·文公十二年》：“男子二十而冠，冠而列丈夫。”古时男子每到二十岁，便要举行冠礼，之后就进入了丈夫的行列。“夫”是指戴冠男子，而“丈”则是指成年男子的身高，大多成年男子的身高都已超过“一丈”。一丈为10尺，夏尺只有今市尺的4寸8分，则夏时一丈约为1.6米高。人们在描述男人特点时，经常会用“男子汉大丈夫”一词表述。不过当今“丈夫”一词指已婚女子的配偶。</p>\n<p>　　人们通常谈到夫妇时，夫多被称为“丈夫”，妻子则被叫做“老婆”。这两种叫法、习俗相沿至今。</p>\n<p>　　“丈夫”一词的由来有两种<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。一种是源自母系时代的夫妻传统礼仪而得来。众所周知那是女尊男卑的时代，男女结为夫妻后，男的怕女的被其他男人抢走，就天天跟在女的后面一丈之远。不能近了不能远了，大概就是不能在视线之外，故男的被人称之为“丈夫”。另一种说法是，在我国有些部落，有抢婚的习俗。女子选择夫婿，主要看这个男子是否够高度，一般以身高一丈为标准。一丈约等于七尺，有了这个身高一丈的夫婿，才可以抵御强人的抢婚。根据这种情况，女子都称她所嫁的男人为“丈夫”。[3]  夫婿，如“坐中数千人，皆言夫婿殊。”（汉乐府《陌上桑》）；夫子，尊称。如“夫子所学，当日知其所亡。”（范晔《乐羊子妻》）；夫君，如“夫君初破黑山归。”（高骈《闺怨》）；君子，敬称。如“未见君子，忧心忡忡。”（《<a href=\"/ctwh/sishuwujing/shijing/\" class=\"keylink\" target=\"_blank\">诗经</a>·召南·草虫》）；郎，昵称。如“出门愿不闻悲哀，郎在任郎回未回。”（王建《镜听词》）；郎伯，如“郎伯殊方镇，京华旧国移。”；良人，“妾家高楼连苑起，良人持戟明光里”。；官人，宋代，这是南北文化交流的时代。；老爷，仅限于官宦人家对老公的称呼。其在家中的尊贵地位不言而喻。；相公，元无名氏《举案齐眉》第四折：“ 梁鸿 云：‘娘子请穿上者。’正旦云：‘相公，吾不敢穿。’”；先生，近代以来，也称“丈夫”为先生。</p>\n<h3>　　妻字由来</h3>\n<p>　　“妻”最早见于《易·系辞》：“人于其官，不见其妻。”但妻在古代不是男子配偶的通称。《<a href=\"/ctwh/sishuwujing/liji/\" class=\"keylink\" target=\"_blank\">礼记</a>·曲礼下》载：“天子之妃曰后，诸侯曰夫人，大夫曰孺人，庶人曰妻。”看来那时的“妻”只是平民百姓的配偶，是没有身份的。后来，“妻”才渐渐成为所有男人配偶的通称。</p>\n<p>　　“妻”的别称很多。古代无论官职</p>\n<p>　　大小通称妻为“孺人”。卿大夫的嫡妻称为“内子”，泛指妻妾为“内人”。妻还被称为“内助”，意为帮助丈夫处理家庭内部事务的人。“贤内助”成为好妻子的美称；旧时对别人谦称自己妻子为“拙内”、“贱内”；而在官职较高的阶层中对妻子的称呼却反映出等级制度来。如诸侯之妻称“小君”，汉代以后王公大臣之妻称“夫”的人（夫人），以及有钱有势的皇亲贵族家的公主千金婚配后的称呼，唐、宋、明、清各朝还对高官的母亲或妻子加封，称诰命夫人。进入现代后，则出现了书面与口语两种说法。不同的地方也有不同的叫法。口语最常见的有老婆，此外还有堂客、太太、内子、爱人、亲爱的、女人、孩子他妈（娘）、母（闽南语，国语谐音“某”）、牵手（源自平埔族语）、另一半、蜜糖、甜心……等等，因人而异，有多种变化，可随场合与心情随意使用。书面用语则仍然保留“内子”、“内人”等对他人称自己妻子的名称。</p>\n<h2>相关</h2>\n<h3>　　伦理关系</h3>\n<p>　　基于爱情为基础的现代婚姻关系，是爱情伦理关系与婚姻伦理关系的复合存在。</p>\n<p>　　婚姻伦理关系，中国是民政局婚姻是登记产生，第三方管控介入，（婚姻制度各国各时代情况都不同），以婚姻管控产生，以婚姻管控算起。属于管控型伦理 。婚姻本质属于管控的范畴。被安排忠诚对象，或在限定条件下选择忠诚对象。</p>\n<p>　　爱情伦理关系，自主产生，全世界总体是一男一女，与爱情有必然关系，以双方自愿爱情信念（<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>）产生，以自愿爱情信仰（爱情伦理关系）产生算起。属于自愿型伦理，无管控方存在。是产生于爱情情感又超越情感的爱情关系。</p>\n<h3>　　结婚基础</h3>\n<p>　　《中华人民共和国婚姻法》规定，男女双方结婚必须自愿，并且男不得早于二十二周岁，女不得早于二十周岁。晚婚晚育应予鼓励（自2016年1月1号起晚婚奖励取消）。</p>\n<p><strong>　　1.自尊心</strong></p>\n<p>　　人的自尊心从小就有，一旦受到损害，便会<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>不已。如果受到尊重，则会感到欣慰和满足。夫妻间的相互尊重、信赖，是深化爱情和事业成功的基本保证。任何训斥或轻视贬低爱人的做法都会损害对方的自尊心。</p>\n<p>　　人人都希望按自己的思想和意志办事。这就是自主的需要。每个人都希望在别人面前表现自己，尽可能发挥自己的才能，运用自己的智慧创[4]  进。</p>\n<p>　　社会是人<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>乐趣的源泉。那种不准爱人与他人交往的做法，不但不能保证爱情的专一，还会破坏对方的心理平衡，对家庭生活感到厌倦，对爱人产生反感，其结果只能使婚姻破裂。</p>\n<p>　　每个人的爱好不同，应尽可能满足对方的心理需求并为对方提供方便。<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>的需要以爱为中心，持久的爱会使对方得到最大的心理满足。否则，失落感便会油然而生，不满、烦恼、怨恨也会接踵而至。</p>\n<p>　　爱人心里不痛快时，总想找人诉说一番，一吐为快。这种宣泄的对象当然是自己的爱人，夫妻均以对方为宣泄的最佳对象。因此任何一方都不应责备对方心胸狭窄，或嫌对方唠叨。而应主动接受对方的宣泄，并进一步劝慰、疏导，排解其内心的痛苦，使对方从内心矛盾中<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>出来，建立新的心理平衡。这样内心的痛苦便会烟消云散，夫妻感情也会进一步得到加强。</p>\n<p><strong>　　2.感情培养</strong></p>\n<p>　　感情的来源需要从小时候培养，人的理解力与道理的分析能力，处事的方式受父母言行的影响，处理事情的能力与接受的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>教育，有着直接的关系。成长过程：小时候与父母和玩伴之间的交流中，就应该让他（她）们懂得相互尊重、相互谦让、文明用语、爱护环境；懂得学习与生活有关的知识；懂得怎么自救和如何正确帮助别人；懂得任何爱的相互传递，都将影响到一个人性格的确立；懂得如何正确的换位思考问题；懂得了解父母的辛苦；懂得帮助父母做力所能及的事情；懂得如何珍惜相互的感情。等到这些孩子结婚了，就能够做到夫妻间的尊重、理解、关爱、信赖，也是爱情的基础和事业成功的前提因素。</p>\n<p><strong>　　3.感情基础</strong></p>\n<p>　　夫妻之间，彼此言语与肢体的力度、尺度、深浅的把握要恰到好处。夫妻之间的信赖，源于彼此之间，换位思考的心里触动感受与真诚。</p>\n<p><strong>　　4.矛盾的原因</strong></p>\n<p>　　夫妻之间爱好、习惯、生活方式、说话方式，处事方式的不同，是导致夫妻矛盾的根源。如果找到一个品行优良的配偶，夫妻间的感情自然而然会很和谐。如果有一方品行不端，做事不讲理，言语尖酸、刻薄、蛮横无理、冷漠、不懂悔改都是夫妻感情恶化的导火索。</p>\n<p><strong>　　5.配合与协调</strong></p>\n<p>　　生活中需要协调与配合，如相互之间不能分开就要学着珍惜，缓和矛盾使彼此间的关系与生活气氛保持融洽，因为相互之间的习性已经很了解了，所以不要做相互厌烦的事情，尽量想一个适合又合理的办法来化解冲突，这样双方都不会受到伤害，还能让夫妻生活更加和睦温馨，这就是智慧的体现。能得到对方言语的赞赏与正确的评价，也是一个人工作与操持家务琐事的动力。夫妻间优雅智慧的交流技巧，可使压抑的情感，巧妙释放。</p>\n<p><strong>　　6.交往误区</strong></p>\n<p>　　相互朋友间交往的尺度把握，也是一种学问，智慧的人把握的恰到好处，无知的人产生了婚外恋。逃避使他（她）们坠入更深的深渊不能自拔，移情别恋伤害了一个又一个与他（她）们亲近暧昧的人。如果没有感情了，就应该选择分手，不要纠缠不休，不要由爱生恨彼此伤害。理智的做法比冲动的做法更值得提倡。那种控制他人正常社会交往的做法是错误的，需要引导爱人怎样换位思考，让对方了解相互的感受。[4]</p>\n</div>"
    }
]