[
    {
        "title": "【感情】-佛教说的“感情”是什么",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x611F;&#x60C5;&#x3011;-&#x4F5B;&#x6559;&#x8BF4;&#x7684;&#x201C;&#x611F;&#x60C5;&#x201D;&#x662F;&#x4EC0;&#x4E48;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022232558.jpg\" /></p>\n<h2><a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a></h2>\n<p>　　感情解释：①对外界刺激的比较强烈的心理反应、动作流露。②对人或事物关切、喜爱的心情。</p>\n<h2>内涵</h2>\n<p>　　感情，是人内心的各种的感觉、思想和行为的一种综合的心理和生理状态，是对外界刺激所产生的心理反应，以及附带的生理反应。如：喜、怒、哀、乐等，感情是个人的主观体验和感受，常跟心情、气质、性格和性情有关。</p>\n<p>　　感是思维概念，是感觉，情是依托依赖。思想的相互依赖就是感情。感情是对一系列主观认知经验的通称，是多种感觉、思想和行为综合产生的心理和生理状态。最普遍、通俗的情绪有喜、怒、哀、惊、恐、爱等，也有一些细腻微妙的情绪如嫉妒、惭愧、羞耻、自豪等。情绪常和心情、性格、脾气、目的等因素互相作用，也受到荷尔蒙和神经递质影响。无论正面还是负面的情绪，都会引发人们行动的动机。尽管一些情绪引发的行为看上去没有经过思考，但实际上<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>是产生情绪重要的一环。</p>\n<p>　　查尔斯·达尔文在1872年写过一本《人与动物的感情表达》。达尔文认为，情绪帮助动物们适应环境。表达情绪和表现动物的身体特点有同样作用，例如，狗在地盘被侵略的时候愤怒狂吠，让敌人认为它比实际上更具有攻击性。达尔文认为，情绪大多有目的性，因此是自然选择的产物。</p>\n<p>　　为了生存，人类必须探索环境（好奇）、吐出不小心吃的异物（恶心）、建立社会关系（信任）、避免伤害（恐惧）、繁衍（爱）、战斗（愤怒）、寻求帮助（哭泣）、重复做对自己有利的事（欢乐）。在原始人类的日常<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中，情绪可以让人类自动趋利避害，做出更利于生存的选择。尽管愤怒看起来没什么好处，但在原始部落里，可以让一个人被人害怕并建立起威望。羞耻和骄傲可以促使一个人维护自己的社会地位。</p>\n<p>　　在社会生活上，情绪帮助我们：</p>\n<p>　　与其他人交流感情（如婴儿不会说话也能成功交流）。影响其他人对我们的态度。表示善意（如不是出于喜悦，只是礼貌性的微笑）。</p>\n<h2>生物学解释</h2>\n<p>　　本来，就主体存续而言，对肯定或否定的状态变化作出评价的主观的现象。但因为同时也产生身体的表现，所以生物学上就有可能对此进行研究，客观地考察感情的发生、经过的条件及其机制。感情状态变化较弱而持续的称心情（mood），比较强而且急剧的称激动或情绪（emotion，喜、悲、恐、怒、惊等）。因为激动有一定的统一过程，此时身体有显著变化，所以对人以外的许多动物也容易进行生物学的研究，亦即激动时。</p>\n<p>　　行为方面：</p>\n<p>　　例如肌肉变得不能随意地运动，或不随意地哆嗦，出现平时看不到的混乱状态。</p>\n<p>　　因此，作为生物学上研究激动的手段。对人除了进行表情、姿势等肌肉反应的观察外，还要测定呼吸、脉搏、血压、脑电波以及皮肤所产生的电阻等情况，最后一项特别灵敏，对激动现象的精密分析非常有效。这种现象被认为是因植物神经中枢和交感神经的兴奋，引起皮肤的分泌腺细胞（汗腺、粘液腺）的离子透性增大，以及由分泌物本身的电传导所致，所谓“测谎器”就是依据此理。</p>\n<p>　　男女的情欲有四个层次，这四个层次本质是一样的，但是程度有差别。</p>\n<p>　　第一层次是色。也就是贪着外在的美貌。</p>\n<p>　　第二个是情。所谓情是两个人心灵有了沟通点，不管任何沟通点，都会产生情。不但情侣之间如此，朋友之间也是这样。所以，有时专家建议<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>或伴侣之间要找共同的爱好，其实就是找沟通点，也就是感情的培养。</p>\n<p>　　第三个是爱。爱已经是一种执着，就是不管你爱不爱我，反正我爱你！这跟情是不一样的，它是不需要沟通的。</p>\n<p>　　第四个层次是淫欲。淫欲是生理的反应，比较污浊，不管有没有色、情、爱，它只是一种须要解决的心理反应。</p>\n<p>　　这四个层次，就是情侣之间互相贪恋的情感。</p>\n<h2>定义</h2>\n<p>　　1、心理学对于“情感”的定义。</p>\n<p>　　心理学把情感定义为：“人对客观现实的一种特殊反映形式，是人对于客观事物是否符合人的需要而产生的态度的体验。”</p>\n<p>　　2、对于“情感”定义的转换。</p>\n<p>　　从这个心理学定义可以了解到：情感是一种主观体验、主观态度或主观反映。属于主观意识范畴，而不属于客观存在范畴。辩证唯物主义认为，任何主观意识都是人对客观存在的反映，情感是一种特殊的主观意识，必定对应着某种特殊的客观存在，问题的关键在于能否找到这种特殊的客观存在。</p>\n<h2>辩证关系</h2>\n<p>　　情感与价值的关系是主观与客观、意识与存在的关系，而后者是哲学的基本问题，因此价值与情感的关系问题也是价值理论和情感理论的基本问题。价值与情感是一个辩证统一的关系，主要表现在四个方面。</p>\n<h3>　　情感以价值为基础。</h3>\n<p>　　情感是人对价值的主观反映，尽管这种反映总会或多或少地存在着一些偏差，甚至还会存在着严重的偏差和完全的颠倒，但从总体上讲，情感的变化总是以价值为基础，主要表现在：情感的基本状态取决于价值的基本状态，情感的总体规模取决于价值的总体规模，情感的变化范围取决于价值的变化范围，情感的作用方式取决于价值的作用方式，情感的强度与方向取决于价值的大小与正负，价值一旦变化，情感迟早要发生变化。对于商人来说，互利互惠的经济往来是维持和发展彼此情感的客观基础，如果没有这种互惠性，商人之间的情感是不能持久的；对于政治家而言，政治上的相互支持、相互配合是维持和发展彼此情感的客观基础，如果没有这种互助性，政治家之间的情感是不能持久的；对于青年男女而言，工作和生活上的相互支持与配合是维持和加深爱情的客观基础，如果没有这种支持与配合，男女之间的爱情是不能持久的；朋友之间的友情主要取决于他们之间的利益关系，只有不断加深彼此的利益联系，其友情才会越来越深厚，如果彼此产生了根本的利益冲突，则其感情迟早会衰减下来，并最终会转化为仇恨。</p>\n<h3>　　情感对价值的反作用</h3>\n<p>　　情感对于价值并不是完全被动的，可以产生一定程度上的反作用，主要表现在：</p>\n<p>　　一是，情感可以在一定程度上阻止、压抑、诱发、转移、强化或诱导人对某种价值的需要，可以相对自主地选择生存环境和发展方向。人有时可以有意识地压抑自己对于某种价值的情欲，时间一长，这种情欲可能真的基本上消失了，人对这种价值的客观需要也确实发生了改变或转移；人通常愿意主动帮助那些主观感觉良好的人，并主动与之建立互惠互利的关系，同时回避那些主观感觉不好的人，甚至有意中断已经存在的互利互惠的利益关系；人有时在某一个地方工作或生活得不开心，就主动辞职或搬家，并能很快地适应新的生活和工作环境。</p>\n<p>　　二是，人在情感的驱动下，可以对事物施加反作用力，并使之发生价值增值。这是人类与其它动物的根本区别。当然，这种反作用不能任意地和无限地施加，只能有条件地和相对有限度地施加，它在整体上受制于或服从于价值对情感的决定作用。人在情感驱动下所进行的价值创造活动必须严格地遵循基本的价值规律，并在其允许的范围内进行。</p>\n<h3>　　情感的相对独立性</h3>\n<p>　　人的情感产生并运行于大脑，这就不可避免地受到大脑内部众多因素的制约和干扰，从而在一定程度上偏离它所反映的价值，情感的这种偏离现象就是情感的相对独立性，主要表现在以下几个方面：</p>\n<p>　　1．时间上的异步性 如果价值形式发生了变化，与之相对应的新情感需要迟滞一段时间才能形成与发展起来。也就是说，新情感的产生、发展与消失并不能与新价值的产生、发展和消失保持同步，需要迟滞一段时间。例如，当一个陌生人突然成为你的妹夫或连襟时，你对他的亲情通常不会马上建立起来；人通常会留恋或怀念那些已经离别或逝世的老朋友。</p>\n<p>　　2．量度上的差异性</p>\n<p>　　如果价值量发生了变动，情感的强度难以与之保持同步变化。例如，有些女性在遭到自己所钟爱男性的伤害或遗弃后，竟然不怎么恨他；相反，有些人仅仅因为几句话不投机，就大动肝火，事后又会悔恨不已。</p>\n<p>　　3．方式上的局限性</p>\n<p>　　价值关系的变化方式是无限的，而情感的反映方式却是有限的。人有时对于某些复杂的、隐含的价值关系及其变化产生不了情感，表现出麻木不仁的精神状态。例如，当受到某些有毒物质的伤害时，人往往感觉不到；当受到指桑骂槐的攻击时，人有时还蒙在鼓里；当购买商品受到他人“温柔”地宰一刀时，人或许还感谢他的“优惠”价格；当面临灭顶之灾时，人或许还在寻欢作乐。</p>\n<p>　　4．机制上的异化性</p>\n<p>　　某些特殊情感完全脱离了价值关系的客观基础，甚至与之背道而驰，这是由于人的情感机制产生了某种异化。例如，畸形<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>培养出否定自我、否定社会的宗教情感，精神类毒品产生怪癖、虚幻和不能自控的情感，过度的生理与精神刺激导致变态的情感，过度的肉体<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>引发病人对于死亡的向往，民族仇视容易引发人对战争狂人的崇拜，极端的阶级斗争引发极端的阶级仇恨，等等。不过，情感的这种异化现象在总体上讲只是局部的、暂时的和相对的。</p>\n<p>　　情感的相对独立性限制了人对于复杂价值关系的应变能力，限制了人对于复杂环境的适应能力，但这将有利于排除各种外部或内部因素对情感运行过程的干扰，有利于保持价值消费活动和价值创造活动的连续性和稳定性。</p>\n<h3>　　情感与价值存在复杂的对应性。</h3>\n<p>　　⑴它是一种多元变量的函数对应关系，而不是一种一元变量的函数对应关系。</p>\n<p>　　⑵它是一种统计概率的对应关系，而不是一种个体动力学的对应关系。</p>\n</div>"
    }
]