[
    {
        "title": "观念（佛教名词）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>观念</h2>\n<p>　　观念是人们对事情的主观与客观认识的系统化之集合体。人们会根据自身形成的观念进行各种活动。利用观念系统（观念体系）对事物进行决策，计划，实践，总结等活动，从而不断丰富<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>和提高生产实践水平。观念具有主观性，实践性，历史性，发展性等特点。形成正确的观念和观念清晰（观念可视，能用文字清晰表达）有利于做正确的事情，提高生活水平和生产质量。观念与理念密切相关，观念是形式基，理念是基本。理念与观念关联。没有观念就没有理念发（产）生。</p>\n<h2>基本信息</h2>\n<p>　　词目：观念</p>\n<p>　　拼音：guān niàn</p>\n<p>　　注音：ㄍㄨㄢ ㄋㄧㄢˋ</p>\n<p>　　同义词：看法、见解、观点</p>\n<h2>基本解释</h2>\n<p>　　(1) [Idea;Concept;Sense];</p>\n<p>　　(2)思想<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>：传统观念;</p>\n<p>　　(3)客观事物在人脑里留下的概括形象;</p>\n<p>　　(4) 关于某方面的认识和<a href=\"/rmgjc/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>;</p>\n<p>　　我们怎样解决这个问题呢?就是要在观念上，把党外凡是能够争取的、能够和我们合作的人士，当成党内干部一样来看待。——《团结广大人民群众一道前进》</p>\n<p>　　(5) 经历后的思想上的一种总结。</p>\n<p>　　（6）面对客观现实而产生的思想。《载敬堂集·江南靖士诗稿·即事》：“桃价不如花价高，时人偏嗜以钱豪。桃农便有新观念，只卖<a href=\"/sushi/yaoshan/taohua/\" class=\"keylink\" target=\"_blank\">桃花</a>不买桃。”</p>\n<h2>基本含义</h2>\n<p>　　观念从通俗意义上来理解，,就是人们在长期的生活和生产实践当中形成的对事物的总体的综合的认识。它一方面反应了客观事儿的不同属性，同时又加上了主观化的理解色彩。所以，正确地理解，观念是人们对事儿主观与客观认识的系统化之集合体。由于人们自身认识的历史性和阶段局限性，就决定了人们的认识会因时间的变迁而出现与时代不符合的意念。从这个意义上来理解，观念更新与否是区分旧观念与新观念的分水岭。例如，解放初期，我国人口不足，生产力水平也比较低，急要更多的人力。人们自然形成人多力量大的观念。在这种观念影响下，我国人口迅速增长。再加上经济水平的逐步改善，战争的平息，人口以前所未有的势头发展。由于观念更新不及时，导致今天我国的人口增长成为一种问题。</p>\n<h2>引证解释</h2>\n<p>　　(1)<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>语。对特定对象或义理的观察思维和记忆。 唐魏静《序》：“物物斯安，观念相续；心心靡间，始终抗节。” 唐宋之问《游法华寺》诗：“观念幸相续，庶几最后明。”</p>\n<p>　　(2)思想意识。章炳麟《驳康有为论革命书》：“李自成者，迫于饥寒，揭竿而起，固无革命观念，尚非今日广西会党之侪也。”巴金《序》：“不合理的社会制度，不自由的<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>，传统观念的束缚，<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>的专制，不知道摧残了多少正在开花的年青的灵魂。”魏巍《东方》第六部第五章：“每个民族几乎无例外地都需要清除私有制度以及它在观念上遗留下来的垃圾。”</p>\n<p>　　(3)观点；概念。胡适《序》：“他的主要观念也只是‘ <a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a> 之道不合现代生活’的一个观念。”瞿秋白《饿乡纪程》十三：“可惜他所说都是零星片断，不能给我一明晰的观念。”</p>\n<p>　　(4)观念也就是人们通常所说的看法，不同的人对同一事物的看法是不一样的，而不同看法在不同领域又有不同的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，如：政治观念，人文观念、经济观念、法律观念等。</p>\n<h2>基本定义</h2>\n<h3>　　观的定义</h3>\n<p>　　其中的方法是为观。观是行为的方法。</p>\n<p>　　主体通过思想达成的目的的方法，会在主体的运动的意识里进行着一种对事物形态在抽象的形式里进行认识的行为，对思想的主体进行的其中的这样的行为就是观的实质。观在行为上表示了一种方法的进行，在意识里是抽象的认识形式。</p>\n<h3>　　念的定义</h3>\n<p>　　动机的产生是为念。念是形式的内容。</p>\n<p>　　差异产生的问题存在，是为达成目的一致的准备。思想的主体在抽象认识的基础上形成的对于问题事物将要进行的行为在主体的运动意识里的达成是为念的内容，对于这种内容在形式上的称谓就是念的本身，念的本身也就是形式的内容。</p>\n<h3>　　观念定义</h3>\n<p>　　思想所表达出的主体的意识形态是为观念。观念是意识形态的表达。</p>\n<p>　　观念来自于思想而不是意识，这是因为意识的事物只达成了事物的形态，这种形态是单一的具体的，这种单一的具体事物形态并不能引起主体意识的行为动机，在主体没有进行抽象的形式进行行为的进行时，就达不成观的实质形式，所以，意识本身并不能引起主体观念的产生，只是达成观念的条件。主体在意识形态的差异里引起的意识的运动，是思想的开始，思想的开始是问题的存在，在主体为达成目的引起的思想里，形成了抽象而来的方法的产生和形式的内容，这是观念的内容，所以，观念的形成是思想的结果，对于这种结果的表达，是主体的意识形态的表达，在思想的作用里表达出的形式的称谓是为主体存在的观念。</p>\n<p>　　思想只是意识运动的其中形式，思想的本身，并不能直接达成主体的行为，行为的主体的行为达成，是在思想的作用里在行为前形成于意识里的观念，这种观念的形成就是将要行为进行的形式方法，当主体某一行为的动机产生后，就直接通过行为来进行了。</p>\n<p>　　事物具备的共通性的表现是事物的规律性的具备，主体的某一观念在具备的规律性的事物存在着稳定性，这种观念的稳定性是思想主体自身的惰性所达成的。任何一种行为的进行，都要进行能量的消耗和转化，即便是思想的进行，而被消耗和转化的主体在惯性的作用里有保持原状的特性，这就达成了思想的主体在没有差异的情况里不能引起意识的运动。瞬时性的观念表现是意念的产生，意念是由主体自身存在意识行为里达成的对事物的感性判别的行为表达。意念是随着思维的进行而瞬息万变的，不具备稳定性，主体自身所形成的难以改变的观念的稳定性最终形成了主体的习惯性。</p>\n<p>　　所有具备思想的高级动物，都有具备各种观念意识的潜在能力，具备思想能力的对某一类似事物带有习惯性行为倾向的高级动物，是拥有了观念行为的高级动物。一切观念行为的对象都是处于主体的客体形式，这类处于客体的具体事物，都是存在着的观念表达对象。本身形成的观念，是思想的发展结果，有着明显的个体色彩，观念的形成，是一切是非<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>概念形成的原始形态，没有观念，就没有是非与善恶的判断标准。</p>\n<p>　　主体的行为，由意识驱动，行为的性质，由观念决定，观念的形成来自于思想，思想来自于主体本身意识能力和成长环境。没有思想，就不会有观念。具备的本能意识和存在的具体环境决定着本身的思想，本身的思想决定着自身的观念，自身的观念决定着自身的行为。个人的行为呈现了思想，思想呈现了观念。有什么样的意识能力和环境条件就会有什么样的思想，具备什么样的思想，就会有什么样的观念，有什么样的观念，就会有什么样的行为。自身形成的各种观念成了自身一切是非善恶的判断依据。</p>\n</div>"
    }
]