[
    {
        "title": "【婚姻】-婚姻是什么？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5A5A;&#x59FB;&#x3011;-&#x5A5A;&#x59FB;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022230619.jpg\" title=\"&#x3010;&#x5A5A;&#x59FB;&#x3011;-&#x5A5A;&#x59FB;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;\" /></p>\n<h2><a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a> （社会学名词）</h2>\n<p>　　东汉班固等编撰的《白虎通》说：“婚者谓昏时行礼，故曰婚，姻者妇人因夫而成，故曰姻。”</p>\n<p>　　先秦的礼仪选集《<a href=\"/ctwh/sishuwujing/liji/\" class=\"keylink\" target=\"_blank\">礼记</a>》则说：“昏礼者，将合二姓之好，上以事宗庙，而下以继后世也。”</p>\n<p>　　婚姻是<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>和社会的总开关，是子女成长、成才的基石，婚姻会涉及到经济、人事等多种问题，婚后会涉及到计划生育、抚养子女成人的主体责任，好的婚姻需要精心设计，从实际出发，根据个人的身份做出调整，也要防止婚姻因为经济和机遇问题，丧失理智，退化自己的社会功能，导致子女遗传人格变质。好的婚姻可使家庭和谐，事业顺利。婚姻是牵扯多方面而又长远需要考验的问题，不是单单的两个人的生理或<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>上的结合。配偶的结合。追溯到原始时代，就有了所谓的婚姻，这是一种群居高等生命的本能属性，自然法则会用异性相吸的力量，使哺乳类生命繁衍生息。科学的意义上看，如果没有婚姻，很多血统就会出现混乱，不利于人们的优良繁衍。</p>\n<h2>历史</h2>\n<p>　　追溯到原始时代，就有了所谓的婚姻，这是一种群居高等生命的本能属性，自然法则会用异性相吸的力量，使哺乳类生命繁衍生息。人类的婚姻存在形式以及结合方式，受人类社会环境的影响。不同时代和地区的社会环境，造就了多样的婚姻模式，以及结合方式。科学的意义上看，如果没有婚姻，很多血统就会出现混乱，不利于人们的优良繁衍。</p>\n<p>　　值得指出的是，由于婚姻产生于私有制，所以它一直与人的财产关系密切相关。由于男子是私有制社会的主体，所以女子一直被看作男子的财产，于是多数古代社会是一夫多妻制。而且抢婚、买卖妻妾等现象也源于此。由于私有制的财产由血缘关系中的男性继承，为了保证血缘的纯净，就有了“处女情结”和对女子性行为的严格约束。</p>\n<p>　　当出现了部落和国家等社会组织之后，婚姻又成了一种政治筹码。从部族的通婚，到国家统治者之间的“联姻”，都是试图通过婚姻来达到政治目的。直到今天，婚姻仍被富豪家庭用于结盟和理顺财产继承关系。</p>\n<p>　　至于在自然小农经济社会中，婚姻则是一种劳动的分工组合，即所谓“男耕女织”，“男主外女主内”。而在现代社会中的老百姓，婚姻则是为了组成一个家庭，在满足人的正常生活需要的同时，承担为家族和社会养育后代的责任和义务，也是人的一种归宿。</p>\n<p>　　综合看来，婚姻是自然的法则，违背这一法则的人，会给自己带来一些烦恼。人类的婚姻发展史大约经历了这样几个阶段：杂乱性交时期、群婚（血缘群婚、族外群婚）、对偶婚、一夫一妻制。</p>\n<h3>　　群婚及对偶婚</h3>\n<p>　　男人的力量优势开始挑战母亲的权威，同时也挑战父亲的权威，这必定在性的分配上有了冲突，而大冲突，争夺性伴侣，甚至会导致群体灭亡。人类学家发现十几万年前，欧洲有一个被称为尼德特人的种族，根据骨骼化石表明，其身材高大，体魄强健，后却神秘消失。是否就是在这样的内部争斗中相互残杀而亡的呢？一方面是生存的本能和性的本能促使力量强大者要获得权利和地位，从而瓦解现有的族群；一方面则是人类的发展要求维持稳定的群体。怎么办？苏联史学家谢苗诺夫《婚姻和家庭的起源》认为，原始人依靠“性<a href=\"/rmgjc/jinji.html\" class=\"keylink\" target=\"_blank\">禁忌</a>”来维持相对时间的稳定。“性禁忌”要求在狩猎时期或者捕鱼时期，禁止任何的性交活动，甚至禁止接触与女人有关的东西，否则就被认为是触犯神明，乃是死罪。因为狩猎和捕鱼的活动，关系族群的生存，这时候如出现因为性的争夺引发的内乱，势必导致族群的覆亡。</p>\n<p>　　但是，随着狩猎和捕鱼时期不断延长，“性禁忌”也越来越频繁，这不能解决问题，必须有新的限制。恩格斯认为，人类最古老的家庭形式是群婚，他将群婚阶段分解为：一、血缘家庭，即仅仅排斥祖先和子孙之间、双亲和子女之间互为<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>，其他兄弟姐妹皆可。二是，普那路亚家庭，即同胞（母方的）姐妹和兄弟间，不可性交。他没说明为什么要有这样的限制。至于限制嫡亲间的通婚是为了保证后代质量的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>也被证明是不科学的。而谢苗诺夫所说的，为了避免内部的混乱和冲突的提法是可认同的：第一种形式，为了防止犯上作乱；第二种，是维持成年雄性的相互<a href=\"/rmgjc/kuanrong.html\" class=\"keylink\" target=\"_blank\">宽容</a>，消除嫉妒。</p>\n<p>　　普那路亚家庭形式，必定会使得族群分化为一些氏族。在同一个氏族中，姐妹与兄弟之间，不可通婚。这就开始了不同氏族之间的通婚，进入了族外的群婚阶段。一群男人，共同地与另一氏族的一群女人通婚，反之也是。族外婚，维持了本氏族的和谐，消灭了嫉妒，发展了族群。族外群婚发展到新阶段，就是对偶婚，即，一个男子以一群女子为妻子，其中有个主妻；反之，一个女子也有一群男子为夫，其中有主夫。现代中国云南摩梭人在正常的一夫一妻制下，还维持“走婚”的形式，其实就是对偶婚的残留形态。</p>\n<p>　　但是，随着男性在生产活动中的地位越来越高，必定要挑战母权，久而久之，女人从属于男人，成为了男人的财产。</p>\n<h3>　　一夫一妻制</h3>\n<p>　　父权的确立，财产的私有化，为了保证后代子息能够继承父亲的财产，要求子息血脉的纯洁性，同时孩子须确认父亲的身份。这就意味着对偶婚中，将以一夫多妻的形式保存下来；也对女子的贞洁性提出了要求。而血脉的正统性要求，即便是一夫多妻制，也需有个主妻，像亚伯拉罕的妻子撒拉，为了让儿子以撒继承财产，将使女夏甲及其孩子赶走。而一夫一妻制的家庭，是这种要求的最终结果。</p>\n<p>　　所以恩格斯说，一夫一妻制是不以自然条件为基础的，而以经济条件为基础的，是私有制对原始公有制的胜利。家庭就是一个经济结合体，女人是男人的从属物，是财产。因而，不存在婚姻的离异性。但是，现代的婚姻家庭，要求以爱情为基础，而男女的独立，尤其是经济的独立，消解了经济结合体是必需的形式，女性也不再从属于男性，而同时，爱情也并不一定能够持续。这就是为什么现代家庭离异现象日趋严重。那么，这是否意味着，应该解体一夫一妻制，寻求以爱情或性本能维持的婚姻关系呢？值得讨论。</p>\n<h2>本质</h2>\n<p>　　构成婚姻是有前提条件的；前提条件可能是自己有的，对方没有，或者双方的某些地方都比较薄弱，需要结合互补来达到强盛和繁衍的目的；结婚的本质也是有目的的,就是为自己生活的更好.所以“婚姻”这个词条，不仅限用于形容人类<a href=\"/rmgjc/yinyuan.html\" class=\"keylink\" target=\"_blank\">姻缘</a>的结合关系，还可以用于形容事件、物体的结合关系。</p>\n<h2>婚姻关系</h2>\n<p>　　婚姻的第一重点就是处理好夫妻关系，即<a href=\"/fjgs/zhgs/40152.html\" class=\"keylink\" target=\"_blank\">两性关系</a>。你需要处理的是：你和他的关系，你和他的前任的关系，你和你的前任的关系，你和第三者的关系……而你和他的关系又衍生出很多内容：比如私人空间，比如经济大权，性关系等等。</p>\n<p>　　第二，职场关系。不管男人还是女人，都是要工作的。特别是如果你或者他是工作狂，那处理工作和伴侣之间的关系，那就尤为重要。当然，在工作中，你要处理和上司、同事、下属、客户的关系。很多人就会把职场中的关系带到家庭中带到夫妻关系中来，那就容易产生矛盾。所以，通常夫妻店最后都要分家，那就是关系没分开，混为一谈，互相影响了。</p>\n<p>　　第三，家庭关系。这是婚姻中最难处理的关系，也是最复杂的关系。其中，婆媳关系是最关键的一环。七大姑八大姨以及亲妈和婆婆的关系，这些都是最为微妙的。而与孩子的关系也是最让人操心的，一旦没处理好，绝对能把一段原本稳固的婚姻给瓦解了。</p>\n<p>　　第四，朋友关系。朋友关系在婚姻中的位置变得不再那么重要。很多女人甚至因为家庭而放弃了朋友。这点当然也是不可取的。处理好了朋友关系对婚姻是一个润滑剂。</p>\n</div>"
    }
]