[
    {
        "title": "【家庭】 佛教家庭",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5BB6;&#x5EAD;&#x3011; &#x4F5B;&#x6559;&#x5BB6;&#x5EAD;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022233873.jpg\" /></p>\n<h2><a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a> （词语概念）</h2>\n<p>　　家庭是指<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>关系、血缘关系或收养关系基础上产生的，亲属之间所构成的社会<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>单位。[1]  家庭是幸福生活的一种存在。</p>\n<p>　　家庭有广义和狭义之分，狭义是指一夫一妻制构成的社会单元；广义的则泛指人类进化的不同阶段上的各种家庭利益集团即家族。</p>\n<p>　　从社会设置来说，家庭是最基本的社会设置之一，是人类最基本最重要的一种制度和群体形式。</p>\n<p>　　从功能来说，家庭是儿童社会化，供养老人，是满足经济合作的人类亲密关系的基本单位。从关系来说，家庭是由具有婚姻、血缘和收养关系的人们长期居住的共同群体。</p>\n<h2>基本解释</h2>\n<p>　　[family；household;house and home] 以婚姻和血缘为纽带的基本社会单位，包括父母、子女及生活在一起的其他亲属</p>\n<h2>引证解释</h2>\n<p>　　1、犹言家中。《<a href=\"/ctwh/ershisishi/houhanshu/\" class=\"keylink\" target=\"_blank\">后汉书</a>·郑均传》：“ 均好义笃实，养寡嫂孤儿，恩礼敦至。常称疾家庭，不应州郡辟召。”</p>\n<p>　　2、以婚姻和血统关系为基础的社会单位，成员包括父母、子女和其他共同生活的亲属。 唐刘知几《史通·辨职》：“ 班固 之成书也，出自家庭；陈寿之草志也，创於私室。” 宋欧阳修《刘丞相挽词》诗之二：“平昔家庭敦友爱，可怜松檟亦连阴。” 明邵璨《香囊记·义释》：“家荡散，业飘零。携筐还负筥，离家庭。两口无依倚，身如蓬梗。” 叶君健《火花》二：“这个儿子就是没有家庭观念，讲也没有用。”</p>\n<p>　　3、院落，庭院。《宋史·章得象传》：“ 得象母方娠，梦登山，遇神人授以玉象；及生，父 奂 复梦家庭积笏如山。” 清 东轩主人 《述异记·虾蟆蛊》：“奉之者家庭洒扫清洁，止奉蛊神。” 魏巍《壮行集·幸福的花为勇士而开》：“他们还有宽裕的时间栽种花木，把家庭收拾得十分舒适。”[2]</p>\n<h2>基本含义</h2>&#13;\n　　书中“家”字&#13;\n<p>　　《说文解字》释“家”：“□也，</p>\n<p>　　从宀”。清段玉裁注：“本义乃豕之□也，引申□借以为人之□”。家庭一词是后起的，基本含义是指一家之内。如南朝宋《后<a href=\"/ctwh/ershisishi/hanshu/\" class=\"keylink\" target=\"_blank\">汉书</a>·郑均传》：“常称疾家庭，不应州郡辟召”。在古罗马，Famulus（家庭）的意思是一个家庭奴隶，而Familia则是指属于一个人的全体奴隶。古罗马人用 Familia一词表示父权支配着妻子、子女和一定数量奴隶的社会机体。</p>\n<p>　　对家庭含义本质的认识是从近代才开始的。K.马克思、F.恩格斯认为：“每日都在重新生产自己生命的人们开始生产另外一些人，即增殖。这就是<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>之间的关系，父母和子女之间的关系，也就是家庭。”（《马克思恩格斯全集》第3卷,第32页）奥地利心理学家S.弗洛伊德认为家庭是“肉体生活同社会机体生活之间的联系环节”。美国社会学家E.W.伯吉斯和H.J.洛克在《家庭》（1953）一书中提出：“家庭是被婚姻、血缘或收养的纽带联合起来的人的群体，各人以其作为父母、夫妻或兄弟姐妹的社会身份相互作用和交往，创造一个共同的文化”。中国社会学家孙本文认为，家庭是夫妇子女等亲属所结合的团体。中国著名心理专家郝滨认为：“人类的家庭是由婚姻、血缘或收养等关系所组成的社会生活的基本单位”。中国社会学家费孝通认为家庭是父母子女形成的团体。</p>\n<p>　　家庭有广义狭义之分，狭义的指一夫一妻制个体家庭；广义的则泛指人类进化的不同阶段上的各种家庭形式。在英文中也有这样一种<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>：family中的f代表father，a代表and，m代表mother，i就是我，l指love，y是you。连起来就是father and mother I love you。也就是爸爸妈妈我爱你们。</p>\n<p>　　家庭的组成必要关系：婚姻关系，收养关系，生育，赡养。</p>\n<h3>　　社会细胞：</h3>\n<p>　　家庭是社会最基本的细胞，是最重要、最核心的社会组织，也是最重要、最基本、最核心的经济组织，还是人们最重要、最基本、最核心的精神家园。家庭<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>的可持续发展是社会稳定发展、国家稳定发展的基石，“家”破是“国”亡的催化剂。</p>\n<h3>　　功能论者：</h3>\n<p>　　功能论者看来，在以前，家庭大多是自给自足，满足家庭成员的大多生理、心理的需求的单位、群体，融有经济生产、安全保卫、教育、社会化、<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>等功能，进行物质、人口、精神<a href=\"/rmgjc/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>再生产。如今，家庭的部分功能由教育、宗教等其他社会设置分化了。但功能主义者认为家庭的社会化、<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>陪伴、经济合作、性规范功能，依然为社会的良性运行起到重要的作用。</p>\n<h3>　　冲突论者：</h3>\n<p>　　冲突论者认为，家庭是性别不平等的主要场所，因而是社会中许多不平等的基础。马克思主义者认为，男性主导的家庭，为社会提供了一些重要的不用付费的劳动形式，维持妇女的从属地位，极大促进了资本主义的产生。所以如果资本主义制度不推翻，性别平等就不可能减弱。</p>\n<h3>　　家族、亲属、家庭的区别</h3>\n<p>　　亲属或者家族：是指具有共同的祖先、血缘，或具有姻亲关系、养育关系的人所组成的社会网络。亲属并不一定居住在一起，以群体的形式发挥作用，但是他们彼此承诺，承担一定的责任和义务。亲属网络中的确切成员是由特定的文化规范规定的，在中国，亲属家族一般是以五服为界。</p>\n<h3>　　宗族：同宗同姓同地域的家族结成的群体。</h3>\n<p>　　家庭：是亲属中较小的户内群体，是共同生活居住、共同经济核算、相互合作发挥作用的人组成的单位。我们一生中，大部分人属于两种家庭。出生，并进行大多社会化的家庭是出身家庭；因结婚、生子而建立的家庭是生育家庭。现代社会，人们主要忠于自己的生育家庭。</p>\n<h3>　　家庭世系</h3>\n<p>　　亲属和血缘关系世代相传的方式。</p>\n<p>　　父系继嗣，家庭中父亲这一边是亲戚和财产继承的基础，男性沿男性继承财产。</p>\n<p>　　母系继嗣，反之，财产由母亲留给女儿。</p>\n<p>　　双系继嗣，孩子们的亲戚和父母两边家庭相关联。无论男孩还是女孩都有权继承父母双方家庭的财产。</p>\n<h2>家庭结构</h2>\n<p>　　按照家庭的规模划分的家庭结构有：</p>\n<p>　　<strong>核心家庭：</strong>由一对父母和未成年子女组成的家庭。</p>\n<p>　　<strong>扩展家庭：</strong>分为主干家庭和扩大联合家庭。</p>\n<p>　　<strong>主干家庭：</strong>由一对父母和一对已婚子女（或者再加其他亲属）组成的家庭。</p>\n<p>　　<strong>扩大联合家庭：</strong>由一对父母和多对已婚子女（或者再加其他亲属）组成的家庭。</p>\n<p>　　扩大家庭曾经是中国人的梦想，人们常常用“子孙满堂”来表述长辈的成功与幸福。有人指出，中国传统社会是以大家庭为主其实是一种误解。人们确实是以大家庭为理想，但并未普遍存在过所谓的大家庭。事实上，所谓的大家庭主要存在于世族门阀之中，而且这样的人毕竟是少数，绝大多数庶民是以核心家庭或者主干家庭为主的小家庭，扩大家庭式的大家庭并不广泛存在。</p>\n<p>　　这是对传统家庭的理解，现代的家庭模式已经远远超出简单的三分法，并正向更加多元的方向发展。</p>\n<p>　　<strong>非传统家庭结构：</strong></p>\n<p>　　1、单亲家庭：由单身父亲或母亲养育未成年子女的家庭。</p>\n<p>　　2、单身家庭：人们到了结婚的年龄不结婚或离婚以后不再婚而是一个人生活的家庭。</p>\n<p>　　3、重组家庭：夫妻一方再婚或者双方再婚组成的家庭。</p>\n<p>　　4、丁克家庭：双倍收入、有生育能力但不要孩子、浪漫自由、享受人生的家庭。</p>\n<p>　　5、空巢家庭：只有老两口生活的家庭。</p>\n<p>　　<strong>其他家庭结构：</strong></p>\n<p>　　断代跨代家庭，无父母的未婚子女共同居住家庭，以及由实体婚姻产生的其他多人共居组合家庭。</p>\n<strong>现状和趋势：</strong>\n<p>　　家庭结构的不同主要是由于社会经济因素 ，全世界的家庭结构正在逐渐朝核心家庭的方向转变，这种趋势，与城市化、工业化以及现代化相关联。</p>\n</div>"
    }
]