[
    {
        "title": "【戒定慧】-戒定慧是什么意思？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x6212;&#x5B9A;&#x6167;&#x3011;-&#x6212;&#x5B9A;&#x6167;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022224578.jpg\" /></p>\n<h2><a href=\"/rmgjc/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　戒定慧合称为三学，即三项训练。  <a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>教导我们需要培育的就是这三学：</p>\n<p>　　<strong><span style=\"color:#b22222;\">1. 修戒</span></strong>——完善<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>品行；</p>\n<p>　　<span style=\"color:#b22222;\"><strong>2. 修定</strong></span>——致力于内心平静；</p>\n<p>　　<span style=\"color:#b22222;\"><strong>3. 修慧</strong></span>——培育智慧。</p>\n<p>　　戒定慧三学是次第的关系，即循序渐进的关系。先要完善自己的品德；有了品德，就应尝试让自己的心平静；内心平静了，应进一步提升智慧。</p>\n<p>　　有些经典也将戒定慧三学分为八个部分，称为“八支圣道”：<a href=\"/rmgjc/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>、正思惟，正语、正业、正命，正精进、<a href=\"/rmgjc/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>和正定。其中，正见和正思惟属于慧学，正语、正业和正命属于戒学，正精进、正念与正定属于定学。也就是说：修习八支圣道即是在培育戒定慧。</p>\n<p>　　不要认为<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>就是枯坐蒲团、不吃人间烟火。所谓的修行，就是修习戒、定、慧，培育品德、平静和智慧。</p>\n<p>　　烦恼根深蒂固，想要断除烦恼不是件轻而易举、想断就断的事，它是一个漫长的过程。</p>\n<p>　　烦恼由粗到细分三个层次，修行也是由低到高分三个阶段。修行的三个阶段分别可以去除三个层次的烦恼，即：</p>\n<p>　　1. 通过持戒去除违犯性烦恼；</p>\n<p>　　2. 通过修定去除困扰性烦恼；</p>\n<p>　　3. 通过修慧去除潜伏性烦恼。（编辑整理：念定寺释德政）</p>\n<h2>持戒</h2>\n<p>　　道德品行，佛教称为“戒”。许多人将“戒”片面地理解为消极的禁戒，认为有了戒就不自由了，这个不能做，那个也不能做[1]  。</p>\n<p>　　然而，“戒”的巴利语为sãla，含有行为、习惯、品质、本性、自然等意思，通常也指道德规范、行为准则、好品德、良善的行为等。</p>\n<p>　　从“戒”的原意来看，它是主动地培育好的行为习惯，养成良善的品德、素养。</p>\n<p>　　一个人只要有良好的道德品质，就不会去做损人利己，甚至是伤天害理、损人不利己的事情。有道德、有戒行的人，不会做出对他人会造成伤害、对自己会受到良心谴责的事情。</p>\n<p>　　戒，也叫做“学处”，即学习规范、训练规则。戒可以分为<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人的学处和在家人的学处。出家人的学处有很多，例如<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>最基本的学处就有227条，其他细小的行为规范则不计其数。不过，虽然学处很多，但最终的目的却只有一个——断除烦恼。</p>\n<p>　　相对来说，在家人的学处就少得多了，最基本的行为规范也不过五条，称为“<a href=\"/rmgjc/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>”(pacasatilde;la)。这五条学处是通过远离、避免五种不良的行为来达成，即：</p>\n<p>　　1. 远离<a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>；</p>\n<p>　　2. 远离不与取（偷盗）；</p>\n<p>　　3. 远离欲邪行（邪淫）；</p>\n<p>　　4. 远离虚妄语；</p>\n<p>　　5. 远离放逸之因的诸酒类（麻醉品）。</p>\n<p>　　这五条学处是做人、做好人、做善人的基本行为规范。有些人也许不理解遵守这五条学处的意义，那么，我们可以用“推己及人”的方法来认识持守五戒的必要性。</p>\n<p>　　例如：出于对生命的尊重，我们不应该杀生。任何有生命的东西都爱惜生命、贪生怕死；自己不喜欢被人伤害、被人杀害，为什么要对其他的众生施暴、要杀害别人呢？正是因为自己不希望受伤害、被杀害，所以不应该伤害、杀害其他众生。这是对生命最基本的尊重！</p>\n<p>　　自己不希望所拥有的财物被偷、被抢，所以不应该去偷、去抢、去占有别人的财物。</p>\n<p>　　自己希望拥有幸福的<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>，希望家庭和谐、<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>和睦相处，所以不应该在外面乱搞男女关系，拈花惹草、红杏出墙。</p>\n<p>　　自己不喜欢受别人欺骗，希望自己所讲的事情被别人相信，所以要言而有信、言行一致，不应当说假话、骗人的话。人们都知道吸烟、酗酒、吸毒是不好的，既浪费钱财又损害<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，甚至会危害社群。喝酒能使人丧失理智，醉酒后什么事情都可以做出来。远离这些消遣性的麻醉品，常保神智清醒。</p>\n<p>　　总之，当一个人想要完善自己、提升自己，首先要有<a href=\"/rmgjc/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。有了品德、戒行，就不会在言行上做出伤害他人、危害社会的行为，就不会成为违犯性烦恼的奴隶。通过持戒、培育品德，可以去除违犯性的烦恼。</p>\n<h2><a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a></h2>\n<p>　　定就是内心处于平静、安宁、专一的状态。培育定的方法叫做“止”，即止息烦恼、致力于内心平静的意思[1]  。</p>\n<p>　　佛陀曾经教导过许多修定的方法，《清净道论》将之归纳为四十种业处。业处(kammañntilde;hàna)，即心工作的地方。所有四十种业处都有一个共同的特点，即通过心专注于单一的目标来达到内心的平静。</p>\n<p>　　为什么让心专注于单一的目标就能够达到内心的平静呢？</p>\n<p>　　举个例子来说：假如一个人没有工作，他就可能游手好闲，甚至到处惹是生非。如果帮他找一份工作，让他安下心来上班；只要他有工作做了，就不会无所事事、不务正业了。我们的心也是这样，如果没有一个好的引导方向，它就会随顺着自己的喜好，追逐欲乐、飘浮不定。让它专注于一个特定的目标，它就能够逐渐平静下来。这就是培育<a href=\"/rmgjc/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>的原理。佛教是从事心灵工作的，教我们如何引导这颗心，善用这颗心，让它朝着好的方向、善的方向发展。</p>\n<p>　　在经典中，通常将培育到某种高度的定力称为“禅定”。禅定，即心处于高度专注的状态。一个人若达到禅定的境界，其心能够持续地维持在极度喜悦、快乐、宁静和<a href=\"/rmgjc/shusheng.html\" class=\"keylink\" target=\"_blank\">殊胜</a>的状态一段很长的时间。</p>\n<p>　　佛教将禅定分为八个层次，包括四种<a href=\"/rmgjc/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>禅那和四无色定：初禅、第二禅、第三禅、第四禅，空无边处定、识无边处定、无所有处定和非想非非想处定。这些定境是越往高处越殊胜的。在高级禅定中，即使连喜悦、快乐都消失，内心只处于极度宁静、微妙和殊胜的状态。</p>\n<p>　　此外，还有一种心虽然专注但层次比较低的定，叫做“近行定”，意思是接近禅那的定。</p>\n<p>　　在缅甸、泰国、斯里兰卡等南传上座部佛教国家，这些培育定力的方法至今仍然普遍地被教导和实践着。包括许多在家人在内的禅修者依照比库们的教导，都能体验到不同程度的禅定境界，亲自证明佛陀教导的可行性和实用性。</p>\n<p>　　当禅修者在进入禅定的时间内，他的心不会出现任何的烦恼，甚至连杂念都不会生起。其间，困扰性烦恼完全被强大的定力所镇伏。</p>\n<p>　　想要去除潜伏性烦恼，根除内心的烦恼，就应该修慧、培育智慧。唯有通过智慧，才能把烦恼连根拔除。</p>\n<p>　　这里所说的智慧，并不是指脑瓜转得快，理解能力强，记忆力好；也不是指在商场、官场、战场、考场能打败对手，青云直上。这些能力只能叫才华或聪明，不是佛教所说的智慧。佛教所指的智慧，是能够彻知人生真相、洞察<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>本质的智慧。</p>\n<p>　　培育定力的方法叫“修止”，培育智慧的方法叫“修观”，即如实观照名色法、观照世间无常、苦、<a href=\"/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>的意思。因此，培育定力和智慧的方法合称为“止观”。</p>\n<h2>智慧</h2>\n<p>　　我们需要透过智慧来观照名色法，了解名色法无外乎是由眼、耳、鼻、舌、身、意所构成。眼、耳、鼻、舌、身称为五根，即五种感官，它们构成了这个色身（肉体之身）。意呢，有六种，即六识：眼识、耳识、鼻识、舌识、身识和<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。这六识分别认知六种对象：颜色、声音、气味、味道、触觉和各种现象（法所缘）。我们<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>在这个世界，就是自己的身心和这六种对象的互动[1]  。</p>\n<p>　　当我们看到美丽的东西、听到悦耳的声音、吃到好吃的食物等等时，很容易生起贪心，想要追求这些东西。当心接触到不喜欢的对象时，心会排斥、抗拒，很容易生起嗔心。不了解事物的本质，叫做痴。贪嗔痴都是不善心，亦即是烦恼。</p>\n<p>　　我们应当用这样的方法来观照名色法是如何构成的？它们如何运作？在什么情况下生起的是善心，什么情况下生起的是不善心？应当如何培育善心，如何避免不善心？</p>\n<p>　　了解名色法之后，还必须进一步追查造成名色之因、生命之因。有果必有因，生命作为一种结果，也必定有其因。为什么会有生命呢？因为有烦恼，有贪爱、有追求，想要这东西、想要那东西，于是会采取行动，造作善业或不善业。当这些善业或不善业遇到因缘成熟的时候，则产生相应的果报。生命以及生命中的不同境遇，就是这些行为的结果。一旦拥有了生命，就执着生命；身心接触到不同的外境，又会产生新的烦恼。于是，烦恼、业与果报三者互为因果，形成一种恶性循环。如果不致力于斩断这条锁链，中止这种循环，轮回之苦将是了无尽期。</p>\n<p>　　了知名色与名色之因后，还必须观照它们都是无常、苦、无我的。包括身心在内的世间所有现象都不是永恒的，一切都在<a href=\"/rmgjc/chana.html\" class=\"keylink\" target=\"_blank\">刹那</a>刹那地生灭变易着，这称为“无常”。万物都在遭受生灭的逼迫，所以是“苦”。因为无常、苦，其中根本不可能有一个所谓的“自我”、“灵魂”、“实体”、“本体”存在，这称为“无我”。</p>\n<p>　　如此透过无常、苦、无我的智慧来观照一切世间，包括自己的身心，他人的身心，无论过去、现在、未来，一切都是无常、苦、无我的。通过观智如此透彻地观照，当他的观智成熟时，即可以断除烦恼、<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>一切苦。</p>\n<p>　　智慧跟四圣谛息息相关。在经典中，将如实地了知四圣谛称为智慧，而智慧所了知的对象就是四圣谛。</p>\n<p>　　通过智慧了知名色法属于苦圣谛；了知名色法之因即是集圣谛。观照名色法以及名色法之因为无常、苦、无我的智慧称为观智。亦即是说，观智所观照的对象即是苦圣谛和集圣谛。当禅修者的观智成熟时，即生起超越世间（出世间）的智慧——道智。道智能彻底地断除相应的烦恼，证悟<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。涅槃即是灭圣谛，是道智的目标。证悟涅槃的道智即是道圣谛。另外，从道圣谛是导致苦之灭尽的途径来说，也可以把培育戒定慧的过程称为道圣谛。</p>\n<p>　　当禅修者彻底地断除一切烦恼之后，他即称为“漏尽者”——断尽一切烦恼的人。又可称为“阿拉汉”——值得礼敬、尊重、供养的圣者。</p>\n</div>"
    }
]