[
    {
        "title": "【极乐世界】-佛经说的西方极乐世界什么样",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x6781;&#x4E50;&#x4E16;&#x754C;&#x3011;-&#x4F5B;&#x7ECF;&#x8BF4;&#x7684;&#x897F;&#x65B9;&#x6781;&#x4E50;&#x4E16;&#x754C;&#x4EC0;&#x4E48;&#x6837;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022215777.jpg\" /></p>\n<h2><a href=\"/rmgjc/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a> （阿弥陀佛的国土名）</h2>\n<p>　　梵名Sukha^vati^ 之意译。音译作苏诃缚帝、须摩提、须阿提。即指阿弥陀佛之<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。又称极乐净土、极乐国土、西方净土、西方、安养净土、安养世界、安乐国。自此<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>向西而去，经过十万亿佛土之彼方即为极乐净土。关于该净土之情况，在阿弥陀经中有详细之解说，而阿弥陀佛今仍在彼处<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。据<a href=\"https://www.guang5.com/fojing/wuliangshoujing/\" class=\"keylink\" target=\"_blank\">无量寿经</a>等所载，往生于该佛土者身受诸种快乐，例如，身上有如佛之三十二相，且具五眼六<a href=\"/rmgjc/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>，五官之对境非常微妙，心中舒畅清凉，在心中闻法，供养佛<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>，即得开悟。然在该净土中，有所谓边地、疑城、胎宫等处，乃为怀疑阿弥陀佛之救度者之往<a href=\"/sushi/yaoshan/shengde/\" class=\"keylink\" target=\"_blank\">生地</a>。</p>\n<h2>极乐世界的无限美妙</h2>\n<p>　　我们从净土三经中，获悉西方有一尊伟大的阿弥陀佛，和那里有一个无比庄严、清净、美妙的极乐世界！</p>\n<p>　　极乐世界的美妙，天下没有一个词足以用来形容它，它就如阿弥陀佛四十八愿中之第三十九愿所说的那样：</p>\n<p>　　“我作佛时，国中万物，严净光丽，形色殊特，穷微极妙，无能称量。其诸众生，虽具天眼，有能辨其形色，光相名数，及总宣说者，不取正觉。”</p>\n<p>　　由于极乐世界之美，就连具有天眼的人都不能尽说其美妙，所以，我们现在从净土三经中去看极乐世界，所看到的只是亿万分之一而已。换句话说，只是一个粗略的认识。尽管如此，已足以令人称羡、惊叹不已了！</p>\n<p>　　●<strong>极乐世界没有三恶道（即畜生、饿鬼、<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>）。</strong>悭贪是饿鬼的因，嗔恚是地狱的因，愚痴是畜生的因。极乐众生，思衣得衣，思食得食，一切自然俱足，根本无贪；全国都是诸上善人，互相爱护，根本无嗔。一切众生，恒闻妙法，心开意解，根本无痴。因无贪嗔痴的恶因，故无三恶道。</p>\n<p>　　●<strong>人人具三十二相，都有五眼六神通，往生的人都可以不再退转。</strong>极乐世界是一个绝对清净平等的世界，人人六根清净，无有爱欲情事，而且人人的身形样貌都跟阿弥陀佛一样具三十二种大丈夫相。</p>\n<p>　　●<strong>极乐世界，广大无边</strong>，就是十方无量世界的众生一齐往生到那里去，也不会有人满之患。</p>\n<p>　　●<strong>气候温和</strong>。没有四季、寒暑、阴雨的变化，永远是那么凉爽舒适，令人心旷神怡。</p>\n<p>　　●<strong>地势平坦</strong>。世间的地有崇山峻岭，也有万丈深渊，那是世人的心不平，故地不平；极乐世界的人，心地清净平等，因心平故地亦平。</p>\n<p>　　●<strong>黄金为地</strong>。实际是七宝为地，黄金为七宝之首，举其首已摄其余矣。七宝者，金、银、琉璃（青色宝）、玻璃（水晶）、砗磲（青白色宝）、赤珠（赤色宝）、玛瑙。世间也有七宝，但都是些凡品，若以之与极乐世界的极品相比，简直天渊之别。</p>\n<p>　　●<strong>有宫殿楼阁</strong>。其宫殿楼阁非常的奇特，能随人之意而大、而小，可在地上，也可浮于空中，全由一宝、二宝乃至七宝自然而成，其富丽堂皇更胜过六欲天主之天宫百千万倍，那是往生之诸上善人的居处，也是大家聚会讲经说法的地方。刚刚往生的人，先在莲胞之中静修，等到花开时，证得法身，就可进住楼阁了。</p>\n<p>　　●<strong>有色树</strong>。在楼阁外面的空地上，有一行行排列得很整齐的色树。所谓色树，即由一宝乃至七宝和合而成的色彩缤纷的树。其树有的高一百由旬（由旬有大中小三种，大由旬约八十里，中由旬约六十里，小由句约四十里），有的一千由旬。树的上空还弥覆著由金缕珍珠百千杂宝所结成的罗网，美观极了！最神奇的是，这些色树，微风吹来，就如百千种乐器，同时演奏，令人想起三宝的功德而<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>、念法、念僧（其所念之三宝乃自性三宝，非我们所念之住持三宝）。</p>\n<p>　　●<strong>树现佛刹</strong>。极乐世界的色树，还能在树与树之间映现十方佛国庄严美好的人、事与物，让观赏的人好像在镜子里看到自己的面相一样清楚。</p>\n<p>　　●<strong>有七宝池</strong>。有无数由七宝所成的水池，其面积由十由旬、二十由旬乃至百千由旬，犹如大海一般，而且皆以金沙铺地，不同我们这里全是砂石污泥。</p>\n<p>　　●<strong>有八功德水</strong>。在无数的七宝池中，还盛满了具有八种不可思议妙用的水：一、澄净，非常澄清洁净，一点杂质也没有；二、清冷，即清净凉冷，永远保持同样的温度；三、甘美，即甘甜味美，非常可口；四、轻软，即水的性质轻浮柔软；五、润泽，即滋润滑泽，有益身心；六、安和，即安宁和平，沐浴其中，安稳舒适；七、除患，即喝了这种水，不但可以止渴，还可以除饥；八、增益，即喝了这种水，或在水中沐浴，可以增长善根。除此之外，其水还有三种的特色：一、随意，即水能随人之意，或增，或减，或冷，或暖；二、说法，即当池水往复激荡时，能发妙音，宣讲妙法；三、进道，即入水浴已，使人道业猛进。</p>\n<p>　　●<strong>有宝花</strong>。在极乐世界的七宝池中，在八功德水之上，有著无量无数‘微妙香洁’的莲花。微者，七宝所成，此方绝无；妙者，其色无量，又能放光：香者，异香远闻，四时不散；洁者，出自德水，体至洁净。其花大小不一，由一由旬乃至百千由旬，这是因为念佛的众生有勤怠之分，故莲花便有大小之别。这些莲花，就是我们将来往生之花胎，谁在此世界信佛念佛，极乐世界的七宝池中即长出莲花一朵，上标其名，将来往生时，即在此莲花中化生。极乐世界的一切景物均不生不灭，惟独莲花变化无常，如人念佛努力，七宝池中的莲花就愈念愈大，如改信其他法门，或停止完全不念，此花即随之而枯萎，可见它没有一定的形状，变化而有，<a href=\"/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>所现。</p>\n<p>　　●<strong>有珍禽</strong>。极乐世界尚有百千种奇妙杂色之鸟。鸟属畜生，极乐世界没有三恶道，哪来这许多的鸟呢？原来这些鸟儿都是阿弥陀佛欲使法音不停宣流，而以不思议神力变化出来的。这些化鸟到处发出柔和优雅的声音，宣讲人人心中所欲听到的<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，实在微妙极了！阿弥陀佛变诸鸟，莲宗九祖蕅益大师说：‘凡情喜此诸鸟，顺情而化，令<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>故；鸟尚说法，令闻生善故；不于鸟起下劣想，对治分别心故；鸟即弥陀，令悟法身平等，无不具，无不造故。’所谓‘无不具’，即<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>六祖惠能大师开悟时所说的‘何期自性本自具足’，‘无不造’即‘何期自性能生万法’。</p>\n<p>　　●<strong>常作天乐</strong>。极乐世界，时常天乐鸣空，随各人之意愿而听到自己所喜欢的音乐。</p>\n<p>　　●<strong>天花缤纷</strong>。那里还昼夜不停地从天空飘落曼陀罗等众妙天花，又天花一著地，不须洒扫，自然消失。</p>\n<p>　　●<strong>极乐世界，下从地起，上至<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，一切万物，皆放光明</strong>，不但人有光，连七宝、宫殿、楼阁、宝池、色树、莲花等等都放光，故极乐世界，不须日月，自然光明。</p>\n<p>　　●<strong>极乐世界，不但是一个光明的世界，而且是一个极其芬芳的世界</strong>，因为那里的一切，都是无量宝香和合而成的，所以在在弥漫香气，处处散发芬芳。</p>\n<p>　　●<strong>极乐世界，不但没有不善的事，连不善的名字都听不到</strong>，这是因为那里的人、事和物，无不尽善尽美的缘故。</p>\n<p>　　●<strong>又极乐世界，处处皆有花台，上坐阿弥陀佛，及<a href=\"/fjgs/gygs/243621.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>、<a href=\"/fjrw/zhufopusa/pusa/66971.html\" class=\"keylink\" target=\"_blank\">大势至菩萨</a>，为诸行人，说微妙法</strong>，所以那里的人，不但随时都可以见到佛菩萨，还可以随时听闻到妙法，这是娑婆众生所梦寐以求的事啊！</p>\n<p>　　像这样一个美妙绝伦的世界，可以说宇宙中再也找不到第二个了！毕竟它是阿弥陀佛集十方诸佛刹土之美好于一身的佛国，自然样样皆奇特稀有，与众不同了！</p>\n<p>　　真实不虚的西方极乐世界</p>\n<p>　　除此之外，<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>向来强调‘因果’，而极乐世界，是阿弥陀佛在因地时发了愿，后经无量阿僧祇劫修诸功德，以不思议愿力、功德所成就的净土，因此它极符合‘有如是因，得如是果’的因果定律。所以，它绝对不是无中生有的、纯属虚构的神话故事。</p>\n<p>　　若问极乐世界为何要如此之庄严美好？答案是：佛愿如此。佛要未往生者，生稀有想，栖神净域，一心念佛，求生其国；若已生者，一切俱足，不作他想，一心求道，直至成佛。</p>\n<p>　　有人或还会问：极乐世界的众生，六根所对之境，一一无非乐受，岂不妨碍道心？答案是：这就是极乐世界之妙，其处众生虽受诸乐，但无有乐想，常在寂静之中，这是弥陀愿力加持所致。弥陀第十二愿里说：‘生我国者，远离分别，诸根寂静。’这即是说，往生的人，六根已不入六尘，所以六根清净，一尘不染。也因此虽受诸乐，并不妨道。</p>\n<p>　　相信还有人会追究一个现实的问题，那就是：阿弥陀佛，十方赞誉，极乐世界，无比庄严；但世上到底有谁见过阿弥陀佛和极乐世界呢？于此我们要举几个实例，以证明见过的人很多：</p>\n<p>　　（一）<a href=\"/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>为韦提希讲《观无量寿<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>》，当讲完经时，韦提希夫人及五百侍女皆亲眼见到<a href=\"/rmgjc/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>庄严的阿弥陀佛、观世音和大势至菩萨，还清清楚楚的见到极乐世界无比美妙的胜境。</p>\n<p>　　（二）净宗初祖慧远大师，一生曾三次见过阿弥陀佛，也见到西方极乐世界，与经上所说完全一样。</p>\n<p>　　（三）古今中外，许多念佛有成就的人，都能在现生见到佛和极乐世界，有的在定中见，有的在梦中见，更多的是在临终时见佛亲来接引，而且西方的胜境，分明在目前。</p>\n<p>　　对此，蕅益大师在其著名的《弥陀要解》里，有很精彩的问答如下：</p>\n<p>　　问：西方去此十万亿土，何得即生？</p>\n<p>　　答：十万亿土，不出我现前一念心性之外，以心性本无外故。又仗自心之佛力接引，何难即生。如镜中照数十层山水楼阁，层数宛然，实无远近，一照即了，见无先后。</p>\n<p>　　一言以蔽之，我们的心性是尽虚空遍法界的，而极乐世界虽在十万亿佛土之外，实未离于法界，亦即未离于自心。所以，极乐世界，看似遥远，但往生乃<a href=\"/rmgjc/chana.html\" class=\"keylink\" target=\"_blank\">刹那</a>间事。</p>\n</div>"
    }
]