[
    {
        "title": "即身成佛（名词解释）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>即身成佛（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　即身成佛的简单解释，即是不须改变现在的肉体，能够成为正知正觉的佛。</p>\n<h2>简介</h2>\n<p>　　即身成佛是<a href=\"/rmgjc/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>密教立教<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的目标。这里所说的即身成佛有两个特点：</p>\n<h2>特点</h2>\n<h3>　　一是“即生”成佛</h3>\n<p>　　《大日经》曰：“于无量劫勤求，修诸苦行，所不能得，而真言门行道诸<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>，即于此生而获得之。”（《悉地出现品第六，卷三》）也就是说，是在这一生获得成就，而不是依赖下一世。藏密的无上瑜伽部所说的三类成佛，其上者就是如唐密的“现世成佛”。（见《密宗道次第广论》卷二十二）</p>\n<h3>　　二是“即身”成佛</h3>\n<p>　　《发菩提心论》曰：“若人求佛慧，通达菩提心，父母所生身，速证大觉位。”</p>\n<p>　　密宗的即身成佛不同于<a href=\"/jtz/\" class=\"keylink\" target=\"_blank\">净土宗</a>所说的“即心是佛”，也不同于<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>的“见性成佛”和<a href=\"/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>宗的“六即佛”。唐密提出三种即身成佛，称为“理具成佛”、“加持成佛”和“显得成佛”。所谓“理具成佛”就是依据“体”的六大，“加持成佛”是依据‘相大’的四曼，“显得成佛”是依据“用大”的三密相应。而所求的不是“理具成佛”，也不是“加持成佛”，而在于“显得成佛”。有兴趣研究者，可以参考辽代慧苑的《大日经义释演秘钞》卷一、持松法师的《即身成佛》、《贤密教衡》等文。</p>\n<p>　　但“即身成佛”并非垂手可得。顿超三大阿僧祗劫，同样需要有无量劫积累资粮作为基础。《大日经》曰：“真言门修行诸菩萨，无量无数百千俱胝耶庾多劫，积集无量功德智慧，具修诸行，无量智慧、方便皆悉成就，<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a><a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之所归依，出过一切声闻、辟支佛地、释提桓因等，亲近敬礼。”（卷一）不仅如此，在修学密法之时，还要符合一系列的条件，如通达显教，打好大乘基础，而成就堪受密法之基，再选择明师，得灌顶，坚守三昧耶戒，精修生起、<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>两种次第，时时处处事事三密相应，“稳速得现证，现身定成佛！”否则，离开这些条件，“即身成佛”就成了痴人说梦。</p>\n<h3>　　三是并非究竟佛</h3>\n<p>　　密宗“现身成佛”或云“即生成佛”，此与禅宗“见性成佛”之话相同，皆称其工夫湛深之谓，不可认做真能现身成佛。须知现身成佛，唯<a href=\"/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>一人也，此外即古佛示现，亦无现身成佛之事。无知之人，每每错认，其失大矣。（复周志诚<a href=\"/fxwd/jsrwwd/\" class=\"keylink\" target=\"_blank\">居士</a>书一）</p>\n<p>　　现身成佛与宗门明心见性，见性成佛之语大同，仍须断惑，方能证真，方可了生脱死。若谓现生即已三惑[1]净尽，二死[2]永亡，安住寂光，了无事事，则为邪说，为魔话。（复温光熹居士书一）</p>\n<p>　　[1] 三惑：即见思惑、尘沙惑、无明惑。</p>\n<p>　　[2] 二死：即分短<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>、变易生死。</p>\n<p>　　还有密宗即身成佛的话，纵然听起来，是如此动人，但是事实上，并没有如此快便。即身成佛的意义，是说密宗工夫，修到成功的时候，现身就可成道。然而这样成道，不过是了生死而已，勉强说做成佛，或亦可以。如果是真的当做成了五住究尽，二死永亡的佛，那就大错特错了。（下略）</p>\n<p>　　要知道我们这个世界，在释迦牟尼佛的<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>当中，只有释迦牟尼佛一人是即身成佛。再要到了<a href=\"/rmgjc/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>佛下生的时候，才可算又是一尊即身成佛的佛。在这个释迦灭后，弥勒未来的中间，要再觅个即身成佛的，无论如何，亦是不可得的。即使释尊重来应世，亦无示现即身成佛的道理。（由上海回至灵岩开示法语）</p>\n<p>　　以上摘自<a href=\"/fjrw/hcrw/yinguangdashi/\" class=\"keylink\" target=\"_blank\">印光大师</a>《佛法修行止偏法要》</p>\n<h2>语义</h2>\n<p>　　即身成佛的简单解释是：不须改变现在的肉体，能够成为正知正觉的佛。“成佛”是<a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的人所期望的唯一目的，无论是学显教或者密教，都希望从生死的凡夫转入到佛果的圣位，不过因为显教和密教在开始发心和修行过程中所使用的手段和方法不同，因此达到这一目的的时间就有迟速不同，而肉体和精神的关系也有“即”、“离”之分。即身成佛就为了说明这一——迟、速、即、离——理由。密教的即身成佛、和显教成佛的理论，大约有下面的几个差别：</p>\n<p>　　（一）“即身”和“隔世”的差别。显教如华严宗说：极疾三生得果，一见闻生，二解行生，三证果生，可算最快的了，但总要隔世成佛。又如依弥陀愿力，往生西方，也是隔世。密教则即以父母所生的肉体成就大觉佛果，如说：即日、即时和隔日、隔时是不同的。</p>\n<p>　　（二）即身和“历劫”的差别。佛教最普通的教义，说成佛要经历四十二位，或五十二位的阶段，从初发心直到成佛，又要经历三大阿僧祇劫的悠长时间。因为显教有“过患”、“功德”二际的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，过患是无始旷劫的积习，不可顿除，必须借远劫修行，消灭过患，然后功德成就。密教则自身“全体舍那”，不须添一点功德，也不须除一毫过患，只有迷悟之分，及迷即成悟，别无所作，贪嗔痴等，也成了佛果大用，不但不须消灭它，相反地要积极发挥它的正用，如《大疏》第八解释茅草的一段说：“此草两边多刺，若无方便，持之反为所伤，若顺手将护之，则不为害。一切诸法亦然，若顺谛理观之，一切尘劳皆有净用，若失方便，则损坏智身，故以为法门表像也。”又《义释》第七说：“譬如善调御师，调恶马作良马之用，一日驰骋千里，同一马也，岂易体而治之哉？佛调御亦尔，能调刚强生死，作普门法界之用，亦调刚强烦恼，作普门世界用，故如来三业三毒，普胜世间。”又《开心抄》说：“近代学者，多执两边，执当相是道者，以为恣行惑业，即是道行，执厌恶求善者，以为迷悟隔界，生佛体别。此二俱失教旨，当知迷悟虽异，其性是同，譬如猛火与利刀，不善用者烧财伤身，善用之者，利益甚大，岂能因烧财伤身故，使世人废除刀火？”这说明过患和功德，是即而不离的，只一念悟得，即知一切烦恼，无非佛事，所以不须经历劫数，勤苦修行。</p>\n<p>　　（三）即身和即心的差别。《观经》说：“是心作佛，是心是佛。”天台说：“一切佛法，即心而具。”禅宗说：“直指人心，见性成佛。”这都是在说理一边，认为<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>本有，而真正的成佛，必须从性起修，经历阶位，华严宗所谓<a href=\"/rmgjc/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>不离行布。密宗则就在<a href=\"/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>和合的色身上布置——五大，五轮，五佛曼荼罗——当体即是，所以叫即身而不叫即心。《大疏》十四说：“若<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>能了达如是不动之轮（阿字菩提心）而布诸明——即同毗卢遮那。”《慈氏轨》说：“或起于一念，我身是凡夫，同谤三世佛，法中结重罪。”又如《金刚顶经》的“五相成身”、《大日经》的“五大严身”等都说明即身而不是即心。</p>\n<p>　　（四）即身成佛和“顿悟渐修”的差别。显教把因缘事相当作是假名无实，是过患，把真理当作无色无形，只有无分别智可以证到。所以说：“理则顿悟，乘悟并销，事非顿除，因次第尽。”要借种种对治方便，来遣除一切事法，故有渐修之义；密教则当相是道，即事而真，一切差别事法，都是本具无尽庄严，即体全真，不是妄法熏染所成，只要认识，不须排遣。如果说对治，也像《大日经疏》第十所说：“如佛常数，以慈治于瞋，以无贪治贪，以<a href=\"/rmgjc/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>治邪见。今乃以大忿怒除忿瞋，以大贪除一切贪，此则最难信解，故云怪哉也。”</p>\n<p>　　（五）即身成佛和天台六即佛的差别。有人认为密教立三种即身成佛，和天台六即佛相同，这是不对的。天台的“理即佛”、“名字即佛”是理而不是事；而“观行即佛”、“相似即佛”到“分证”、“究竟”也是要经历位次，破除九品无明，然后成佛的。密教的三种即身成佛是：1.理具成佛，理不是指真如实性，而是指无尽庄严的条理，宛然具足；2.加持成佛，是由三密加持自身本有的三部——佛部、莲花部、金刚部——都尊速疾显现；3.显得成佛，是三密成就，如实证得。而这三种是因果同时，不经劫位，不断烦恼，不转凡身，法然不动的，所以三种都叫即身成佛。显教因为三密不具，五相不具，所以纵然说即此便是，也只是理论而不是事实。</p>\n<h2>实践即身成佛的方法</h2>\n<p>　　即身成佛的实践方法，就是三密，所谓密，并非隐密不可告人，而是此等法身内证之德，在凡夫尚未认识之前，幽深难测，不能显现它的作用，所以叫密。佛的大悲心，为了使凡夫成佛，将他最捷径的修行经验三密法门，告诉我们。身结本尊印契为身密，口诵本尊真言为语密，意观本尊字种或三形、尊形为意密。用这种方法，可以很快地得到法身三密的加持。凡夫的三密和如来的三密，“入我”、“我入”无二无别，谓之三密相应。因为如来的三密，我的三密，同是六大所成，遍法界无所不至，因此在法性上是平等平等，一相一味，如来的功德庄严，也因为这种加持力量，完成显现到我身上来了，所以叫“三密加持速疾显”。</p>\n<p>　　“加持”就是法身和行者的信念互相涉入，融洽无碍，因此不再经三大阿僧祇劫，就是现在父母所生之身，可以成佛，而实践法身大我的活动。这种三密平等加持，譬如一室千灯，四壁加以镜照，只见光光互摄，重重无尽，彼即此，此即彼，而亦此不往，彼不来，不同而同，不异而异，而十法界不相杂乱，譬如<a href=\"/fjrw/zhufopusa/hufatianwang/67066.html\" class=\"keylink\" target=\"_blank\">帝释天</a>宫里的珠网相似，所以叫“重重帝网名即身”。[3]</p>\n</div>"
    }
]