[
    {
        "title": "佛教常说的【六道】是哪六道？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x4F5B;&#x6559;&#x5E38;&#x8BF4;&#x7684;&#x3010;&#x516D;&#x9053;&#x3011;&#x662F;&#x54EA;&#x516D;&#x9053;&#xFF1F;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022236570.jpg\" title=\"&#x4F5B;&#x6559;&#x5E38;&#x8BF4;&#x7684;&#x3010;&#x516D;&#x9053;&#x3011;&#x662F;&#x54EA;&#x516D;&#x9053;&#xFF1F;\" /></p>\n<h2><a href=\"/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　六道又作六趣。</p>\n<p>　　<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>众生因造作善不善诸业而有业报受身，此业报受身有六个去处，被称为六道。六道是佛根据业报身所受福报大小划分的。分别为：天道、阿修罗道、人道、<a href=\"/rmgjc/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>、饿鬼道、<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>道。</p>\n<p>　　天道又分为欲界天、<a href=\"/rmgjc/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天、无色界天。</p>\n<p>　　人道和天道为善道，其中众生造作善业多于恶业，乐多苦少。</p>\n<p>　　阿修罗道虽然享有<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>福报，但其心因缘受种种染污，造种种不善业，待其天人福报结束后，便会随恶业业力堕入人、畜生、饿鬼、乃至地狱道中。</p>\n<p>　　畜生、饿鬼、地狱称作三恶道，其中众生造作恶业多于善业，苦多乐少。其中地狱众生以识为食唯苦无乐。</p>\n<p>　　六道的真实情形甚深不可言说，佛通过种种譬喻让大众对六道的各种”乐“、苦有一个直观感受 ，为如何能够离苦得乐指引方向。而智者则由譬喻得佛甚深真实义，成就大悲心，救度众生永离烦恼<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>，<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>快乐微妙真实。</p>\n<p>　　众生因造作善不善种种业而随业力<a href=\"/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>受生业报身。佛根据业报身所受福报大小划分为六个去处：天道、阿修罗道、人道、畜生道、饿鬼道、地狱道。人天道称作善道，乐多苦少；畜生饿鬼地狱三道称作恶道，苦多乐少。其中阿修罗虽然拥有天人福报，但其心已由于对福报的贪着退转，以往累积的善根被贪着的大山盖障，起种种不善念，造作种种恶业。地狱为其未来去处。</p>\n<p>　　具体去往何处是由所造诸业决定的。畜生的业因主要为痴、邪淫（于男女和合之\"乐受\"有贪着是为邪淫）、吸毒。饿鬼的业因主要为贪、偷盗、赌博。地狱的业因主要为嗔、杀人、毁谤<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>及佛。不造做三恶道的业因就是人的业因。天道的业因主要为<a href=\"/rmgjc/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母、奉事师长、听闻正法、不妄语、不两舌（诤斗）、不恶口、不绮语（戏谑嘲笑）、不贪、不嗔、不痴、调服断除乃至越欲贪、灭离言语念、灭离觉观念、灭离喜念、灭离出入息念、不作诸色想、不作诸识想、不作有所有想、不作想想、非想想。</p>\n<p>　　业报身的生死不完全等同于色身的生死。色身的死亡必然导致当前业报身的结束，但色身不死业报身也可消灭。或是当下业报身福报耗尽而灭；或是新的业力逐渐取而代之而灭。这个过程或一念或一日、两日乃至七日、乃至七七四十九日。上一个业报身称作前阴身，下一个业报身称作后阴身，中间称作中阴身。所以《<a href=\"https://www.guang5.com/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>》上说“若<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>有我相、人相、众生相、寿者相，即非菩萨。”。将色身的缘生缘灭看作“我”的生死就是有寿者相。</p>\n<p>　　为什么是一念或七日乃至七七四十九日呢。当业力足够强时，一念即生；若业力较弱或新业力尚未形成，则还有一个业力在中阴身期间逐渐成就的过程。业力的成就以七日为单位是一种表法，1.初造新业；2.遇缘再次造业导致新业业力增长；3.业力继续增长无外缘也造作新业；4.<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>造作新业甚于旧业；5.<a href=\"/rmgjc/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>不复造作旧业；6.遇缘也不造作旧业但业力仍现前；7.旧业业力不复现前、新业力成就。一种业力成就后可能会在外缘的染污下再次经七步演变为新的业力，辗转多次乃至无量次。故言“乃至七七四十九日”来加以表法。</p>\n<p>　　所以六道其实并非只是死后的事，当生即有<a href=\"/rmgjc/liudaolunhui.html\" class=\"keylink\" target=\"_blank\">六道轮回</a>。万不可以为离死尚早，随意造作恶业。比如，一个人性本良善（天人）；开始经商；经商产生利润（福报）；因利润得“乐”受；因\"乐\"受于利润产生贪着；由贪着开始陪客户种种应酬缠缚种种不善念；由贪着开始弄虚作假造作种种不善业；由贪着与人攀比嫉妒烦恼；谋划如何赚更多钱焦虑烦恼；其他种种因贪着生烦恼；因前种种烦恼及不善业饱受苦毒不复快乐却因种种烦恼缠缚不能自拔（入饿鬼道）。如果此人因过去曾修诸善业广植善根故得遇<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，于正法前暂得清净幡然悔悟过去种种恶；则此人即于是时于饿鬼道命终还复人身；深信因果勇猛精进，断除过去种种恶，广修善业增长善根，<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>坚固乐闻正法得正知见，行<a href=\"/rmgjc/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>戒忍坚固得诸智慧，发救度一切受苦众生弘誓大愿，净己国土乃至逐渐能净诸佛国土。是故此人不久得入大菩提道，修诸功德，命终得生阿弥陀佛极乐<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>，见阿弥陀佛与大菩萨众，究竟必至一生补处，至成佛道。</p>\n<h2>六道详解</h2>\n<h3>　　地狱道</h3>\n<p>　　地狱道是根据印顺导师在《成佛之道》的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，地狱可分四大类：</p>\n<p>　　八大地狱：八大地狱是此道的最根本，到处充满火焰，所以也叫做“八热地狱”，与基督教所说的“永火”相近。最底层就是令人闻之丧胆的阿鼻地狱，亦即无间地狱。</p>\n<p>　　游增地狱：八热地狱的每一热地狱都有四门，每门又有四小地狱，总共一百二十八地狱。凡是从八热地狱出来的众生，要一一游历此处受苦，所以称为“游增”。</p>\n<p>　　八寒地狱：极为寒冷，此处众生经常因寒冷而悲号，身体也为之冻得变色。</p>\n<p>　　孤独地狱：这是在人间的山间，江边等，过着孤独、非人的<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，可说是人间地狱。总计八热、八寒、游增、孤独，地狱共有十八处。</p>\n<h3>　　饿鬼道</h3>\n<p>　　据《<a href=\"https://www.guang5.com/fojing/yujiashidilun/\" class=\"keylink\" target=\"_blank\">瑜伽师地论</a>》所载，饿鬼在饮食上会受到三种障碍：</p>\n<p>　　1.外障：此类饿鬼因为常受饥渴，所以发乱面黑，形容枯槁，唇口干焦，只能以舌舐口，虽然四处奔走求食，所见的池水却都变成脓血而不能饮用。</p>\n<p>　　2.内障：此类饿鬼咽细如针，口大如炬，腹鼓如山，然而即使得到食物，却因喉细而不能吞咽。</p>\n<p>　　3.无障：此类饿鬼饮食虽没有障碍，但是不论所受食物为何，皆会燃烧成火，仍受饥渴大苦。</p>\n<p>　　因为前世造作的<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业不同，在饿鬼道所受的果报也会不同。若依鬼的生活境遇贫富，大致可分为有威德鬼与无威德鬼两类；无威德鬼生活非常贫困，有威德鬼则非常富足，民间<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>所祭祀的鬼神，即多为此大威德鬼。</p>\n<h3>　　畜生道</h3>\n<p>　　畜生道有情对人类而言，虽有可爱不可爱之分，或有所谓有害、有益之别，但整体而言，它们最主要的特质是苦多于乐的，就如《过去现在因果经》中所记载的，它们不但生得杂丑的外形，也因为身上的骨、肉、筋、角、皮、牙、毛、羽被人类视为“宝物”，而遭捕捉杀害；或被人类抓来负荷重担，以致饥渴疲累；还有种种穿鼻、钩首、鞭挞、捆绑的折磨，或甚至彼此互相伤害，置身弱肉强食的情境惊恐惶惑。</p>\n<p>　　因此畜生道众生在轮回的六道当中，被列入苦难悲惨的三恶道之一；此外，也因为它们智慧不高，甚至仅有神经的反应，因此无法了解佛法，连<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的机会也没有，只能等待临命终时，随宿世业力流转他趣。</p>\n<p>　　若以品类及数量来看，畜生道是六道当中为数最多的一类，《正法念处经》中甚至指出畜生共有三十四亿种之多，早已超出人类所能想像的范围。而这些品类众多的有情，彼此的相貌、体态差异极大，饮食、生活习性也都不相同，以活动范围区分，可分陆行、空行及水行三大类，依生活习性来分，则可归类为昼行、夜行及昼夜行三种。</p>\n<p>　　畜生道有时也称为“旁生”，若从梵文音译，也有称为“底栗车”(tiryanc)的。畜生之名是指它们常为人所蓄养，但事实上，其涵盖的范围远超过此，甚至扩及天上、地下种种不可思议的天界、地狱、神异处。而旁生的意思，则是说它们的形状有别于人的直立，而且行走方式、生活方式也是旁横不直的。它们的<a href=\"/rmgjc/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>就与众多的种类一样参差不齐，有短如蜉蝣那样朝生暮死的，也有长如龙王一样达一中劫者。</p>\n<p>　　针对这么繁复的种类，佛教经典里也分别记载了各种不同的业报成因。这些因缘当中，有些属于畜生、恶鬼及地狱等三恶道的共通业因，也有单纯属于畜生道的。例如《辩意长者子经》中就指出会堕入畜生道的“五畜生事”，包括常常犯偷盗罪、负债不还、喜欢<a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>、不喜听闻经法，以及造作种种因缘阻挠他人办法会等。</p>\n<h3>　　人道</h3>\n<p>　　而依<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>说法，人分别居住在东胜神洲、西牛贺洲、南瞻部洲、北俱庐洲等四洲。在《长阿含经》中叙述道，世界的中心是须弥山，四周有七金山围绕，七金山之外，则是浩瀚无边的咸海，四大洲即分散在此。四洲中居住着不同的人类，之间完全隔绝，互不相通。而我们亦即地球上的人类，则是居住在南瞻部洲，又名“阎浮提”。四洲的人各具特点。四大部洲的叙述，散见于《长阿含经》、《楼炭经》、《立世论》、《俱舍论》、《造天地经》等经典中，各洲各有特点，例如西牛贺洲以多牛、多羊、多珠玉为特点；东胜神洲的特色则是土地极广、极大、极妙，所谓极妙是指土地肥沃；而北俱卢洲的人没有肤色、种族优劣之差别，也没有忧悲啼哭，但这里是佛法中视为八难之一的地方，因为这里只有纯物欲的享受，而缺乏崇高的精神生活。</p>\n<p>　　而我们南瞻部洲的人，最大的特点，则是有无数的欲望，所以能造种种善、恶业行，但也由于具有思惟能力、惭愧心，所以，能够修行，当然最重要的，还是因为人类具有忆念、梵行、勇猛心三种特性。形诸于外的则是为了他人的利益，宁可牺牲自己；可以忍受各种苦的意志力、毅力；勇猛心则是展现出难行能行，难忍能忍，难受能受的“菩萨道”精神。</p>\n<p>　　在六道中众生是不断在天道至地狱道之间轮回的。一旦堕入地狱需要花费无量劫的时间才能勉强得入畜生道，在畜生道遇到恶缘造作恶业还有可能再次回到地狱道，偶尔才能有机会得生人身，即使这样也因为根性差而不闻法不见佛，一旦遇到恶缘造作恶业，很可能又回到地狱去了。所以,《<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经》卷三十二有言：“人身难得，如优昙花”。好不容易才得人身，如果不听经闻法，依法奉行，断恶修善，开诸智慧。难免会再次堕入三恶道重新受苦。</p>\n<p>　　但是对大多数人而言，面对世界人口不断增加的事实，以全球人口来说，目 前已超过五十亿人，不免要问：“人身会难得吗？”事实上，若从六道众生来看，要投生为人还真是不容易。在《中阿含经》有一个故事譬喻投生为人的困难，如同有一只瞎龟在茫茫汪洋中，要刚好遇上一块浮木，这块浮木上必须又恰好有一个小孔，这样的机会已是少之又少，而这只乌龟的头又要恰好从浮木孔伸出来，这样的机会真可说是难上加难，经典中便以此来形容得人身之难得。</p>\n<p>　　那么如何才能投生为人呢？据《成实论．六业品》指出，投生人道的众生，是因为过去生曾造作了人道的业。关于受生人间的业因，在《杂阿含经》卷三十七：“若行不善业则<a href=\"/sushi/yaoshan/shengde/\" class=\"keylink\" target=\"_blank\">生地</a>狱，后若<a href=\"/rmgjc/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>人中则受诸难，又若行十善业则得生天上，后若转生人中可免诸难。”所以，《法华文句》说道：“<a href=\"/rmgjc/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>为人，十善生天。”过去生若能遵守五戒，终生奉行，来生可得人趣之果报。</p>\n<h3>　　阿修罗道</h3>\n<p>　　阿修罗道众生专指那些具有天人的福德，但因遇到的缘不善，心染污种种不善，造作种种不善业的众生。特别是那些虔诚信佛，但因遇到被五阴魔附体的邪师说法误行魔行的人。阿修罗女表法忉利天以上众生不造作只有阿修罗道众生才造作的种种恶业，其中就包括魔行诸业。</p>\n<p>　　忉利天人因尚未断除对欲的贪着，因此常常在贪念的驱使下试图造作恶业，此时他过去造作善业所留下的业力会与贪念形成的恶业业力发生争斗。这就是<a href=\"/fjrw/zhufopusa/hufatianwang/67066.html\" class=\"keylink\" target=\"_blank\">帝释天</a>带着夜叉天众与忉利天众与众阿修罗大战的真实含义。由于夜摩天众生能以<a href=\"/rmgjc/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>和戒律调伏贪念，所以不会由于贪念造作种种恶业，也就没有恶业业力在身。所以佛说夜摩天人从不与阿修罗争斗。</p>\n<p>　　阿修罗另被称为不饮酒神，居住在海底的阿修罗原本是很爱喝酒的，但是因为他们喝的是由海水酿成的酒，总是味道咸苦，所以一气之下就发誓再也不喝酒。饮酒代表痴，痴就是沉迷一种业不出离，比如沉迷电脑游戏沉迷画画沉迷收藏就是痴行。由于阿修罗是造作恶业的原天人，所以他的福德暂视还在，由于阿修罗的业都是相当严重的恶业，也就是海底的咸水，沉迷恶习会与他原有的福德产生抵触，令他感到难过，所以阿修罗从此不再饮酒。 转生到阿修罗道者，《业因差别经》详细条列出十项业因，包括身行微恶、口行微恶、意行微恶、起骄慢、起我慢、起增上慢、起大慢、起邪慢、起慢慢与回诸善根。</p>\n<p>　　因业力的牵引，阿修罗再次转生可分为胎、卵、湿、化四生。卵生者身在鬼道，能以其威力，展现<a href=\"/rmgjc/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>入空中；胎生者身在人道，投生的原因是原本在天道中，却由于降德而遭贬坠；湿生者身在畜生道，住于水穴口，朝游<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，暮归水宿；化生者身在天道，也就是得遇大善缘中途悔悟的阿修罗。</p>\n<p>　　据《观佛三昧经》说，世界刚刚形成山海大地时，光音天上贪玩的仙人便到人间游戏。其中一位仙人在大海洗浴时，因“水精”入身而生一肉卵。这肉卵经八千年后，终于生出一个女怪，身长有如须弥山，具一千只眼睛、二十四只脚，头、口与手数皆为九百九十九，样貌好不骇人，即为阿修罗始祖。</p>\n<p>　　女怪后又产下一男怪名毗摩质多，因有无比威力可自由来去天上人间，所以在看到天人身旁皆有无数美女环绕后，也想娶妻。女怪便替其子向美冠群芳的干闼婆女求婚，结果干闼婆欣然同意婚事，于是阿修罗一族日渐繁盛。毗摩质多风情万种的女儿，使得已有妻妾亿万的天界帝释为之倾心，娶为嫔妃。不料帝释婚后喜新厌旧，阿修罗女将委曲告之父亲，引发前所未有的一场大战。就在阿修罗将帝释所居的须弥山团团围住，千钧一发时，帝释想到佛曾说若遇大难，只要念般若波罗蜜咒，便能破解鬼兵。果然一持咒，空中忽然飞出四只大刀轮，几乎削尽阿修罗王的手足，幸好遁入藕孔方避过此难，但是元气大伤难以复仇。</p>\n<p>　　然而天人与阿修罗的战争，并未自此划下休止符。在经过多年后，帝释又爱上一位罗喉罗阿修罗的女儿，便命天界乐神带聘礼，透过歌曲威胁利诱罗喉罗应诺婚事。不料罗喉罗因气愤帝释欺人太甚，不但将乐神驱逐出宫，并立刻发兵攻打天人。就在骁勇善战的阿修罗攻下天宫时，帝释又忆起上次的神咒，于是阿修罗军被杀得节节败退，只好退入<a href=\"/sushi/shucai/lianou/\" class=\"keylink\" target=\"_blank\">莲藕</a>藏躲。</p>\n<p>　　就在帝释掳走了全部的阿修罗女后，罗喉罗派出一位使者前往谈判，指出帝释身为<a href=\"/rmgjc/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>，不应犯戒偷盗。双方几经谈判最后达成数项协议，帝释承认犯下偷盗戒，愿归还阿修罗女，并赠送天上<a href=\"/rmgjc/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>；阿修罗则除将爱女献与帝释，并自愿受持三皈五戒，成为佛<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，此战终得<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>落幕。</p>\n<p>　　在天界的战争中，有一位阿修罗王与帝释作战时，因手能执日月，障蔽其光，而被称为罗恸罗阿修罗，罗恸罗意即为障月。他能有以手障日月，形成日月蚀的威力；是因他过去生为<a href=\"/rmgjc/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>时，见到大火烧塔，灭火而使塔不坏，而以此救塔之福德为因，愿得大身。然虽有此愿，仍不信正法，常爱斗战，故死后堕入阿修罗道。</p>\n<h3>　　天道</h3>\n<p>　　天道众生遍及欲界、色界及无色界等<a href=\"/rmgjc/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。其中在欲界有六欲天，色界有四禅十八天，无色界四天，共有二十八天。</p>\n<p>　　在天界的众生当中，欲界的六天还有男女之别，也有<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>嫁娶，但是不像人间的男女关系。以他们满足欲望的方式而言，四大王天、忉利天是以气和合阴阳；焰摩天则只要互相靠近，兜率天藉着互相牵手，化<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天彼此深深对看，而他化自在天只要短暂的对视即是。</p>\n<p>　　而色界的众生则已经摆脱了对欲望的执着，只是尚未从形体的束缚中<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。所以无论是居住的地方，或是本身的形体已经十分净妙，但是仍有形质。而他们与欲界众生最大的差异，是他们已经离了淫欲，只有清净微细的形色，所以他们已无男女之别，而以光明为他们的语言与食物。</p>\n<p>　　至于无色界的四天，更是超越了物质世界的存在，是厌离物质色想而修四无色定的有情众生死后所生的天界。在这个天界里，自然没有男女相之别。</p>\n<p>　　天人们所过的生活，在《过去现在因果经》中，有着迷人的形容，例如他们的身体极为清净，不受尘垢染污，就像琉璃一样充满着光明，两眼更是清澈明亮。只要心有所想，就能心想事成，因而心态上能时常保持欢悦适意。平日更以仙乐清扬作为娱乐，乃至饮食衣物，就似魔术幻化一样，只要心念一动，就应念而至。</p>\n</div>"
    }
]