[
    {
        "title": "【迷信】-迷信的意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x8FF7;&#x4FE1;&#x3011;-&#x8FF7;&#x4FE1;&#x7684;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022319900.jpg\" /></p>\n<h2><a href=\"/rmgjc/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a></h2>\n<p>　　迷信专指人对事物的一种痴迷信任状态、迷惘地相信；更指盲目的相信、不理解的相信”。迷信的本义是“相信了错误的东西”。</p>\n<p>　　民间记载中，《记栗主杀贼事》（【清】潮声）：“迷信者云：‘命中犯披麻，杀人不用刀。’”</p>\n<p>　　佛学中迷信一词在唐朝译经师翻译文献时首次使用。</p>\n<p>　　迷信具体指人类对超自然力量的崇拜和<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>，是对客观世界的一种虚幻的歪曲的反应，是愚昧落后的表现。</p>\n<h2>基本定义</h2>\n<h3>　　字面定义</h3>\n<p>　　Encarta百科全书上对“迷信”的定义：非理性地相信某种行为或仪规具有神奇的效力。</p>\n<p>　　科学不是知识主体而是方法，科学无迷信</p>\n<p>　　科学不是知识主体而是方法，科学无迷信</p>\n<p>　　迷信是对某一些事物迷惘而不知其究竟，可又盲目地相信其说。“迷信”的含义更多的倾向于“盲目的相信、不理解的相信”。</p>\n<p>　　理论上，如果不具备科学素养，都存在着“迷信”的可能性，即使是有些从事科学工作的人，如果没有科学素养，也会抱某种迷信(如迷信巫医、易经、<a href=\"/rmgjc/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>、<a href=\"/rmgjc/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>）。与迷信对立的是科学的方法。科学是一种允许自我证伪的动态开放的可靠方法（科学不是任何科学理论），讲究的是形式逻辑和证据。而迷信是无条件接受，不允许质疑、没有形式逻辑、不需要可靠证据，是盲目相信。说迷信科学，就如同说迷信数学——未来人可以说今天的人“迷信”落后的数学理论（如平面几何），但不能说迷信数学，因为数学就是方法。</p>\n<p>　　1980年代以来，中国人的“迷信”现象具备了现代特色，或假借科学名义，或以弘扬传统为使命，而迷信主体则由农村转向城市，转为有知识、高学历人群，甚至转向了国家官员。特别是1990年代中叶以来，中国社会出现了一种频频使人困惑的“官场迷信”。这种官场迷信，萌生于官场之中各级官员对其上司的供奉和迷信，大多源自于官场民主的缺失，把自己的上司、顶头上司视为官场的主宰，左右了权力的运作及其个人的遭际和升迁的<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>。在身处官场的个人仕途难以自我把握的时候，这些官员往往另辟蹊径，依托迷信，视之为自己的“护官符”和升迁秘径，以保证自己的官运亨通。究其根本原因，是“迷”在官场、“信”在权力，是一种社会权力的崇拜形式。</p>\n<h3>　　本质定义</h3>\n<p>　　迷信的本质定义就是相信了不该信的东西。人们的立场不同，所指称的迷信内容也不同。在基督教看来，不信基督教而信仰别的<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>，就是迷信。其他宗教，也是一样。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>就辩称自己是神圣的信仰，所以不是迷信。也就是说，迷信的本义，乃是“相信了错误的东西”，而不是“入迷的相信”。</p>\n<p>　　没有“迷信科学”或者“科学迷信”的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。迷信是没有理由的相信，而科学恰恰是追寻理由的地方。科学把道理讲得如此明白，让你觉得不相信就未免太傻。所以“迷信科学”或是“科学迷信”就像“方的圆”或“圆的方”一样，是自相矛盾不能成立的概念。只有受教育程度所限，无法理解科学道理的人，才会把科学看得像神话一样不可思议，说出“科学迷信”这样不通的话来。[3]</p>\n<h2>佛教解释</h2>\n<h3>　　原文1</h3>\n<p>　　大乘庄严经论卷第四 明信品第十一</p>\n<p>　　释曰。信相差别有十三种。一者已生信。谓过去现在信。二者未生信。谓未来信。三者正受信。谓内信。四者似受信。谓外信。五者他力信。谓粗信。由善友力生故。六者自力信。谓细信。由自力生故。七者有迷信。谓恶信。由颠倒故。八者不迷信。谓好信。由无倒故。九者现前信。谓近信。由无障故。十者不现前信。谓远信。由有障故。十一者听法信。谓闻信。由闻生故。十二者求义信。谓思信。由思生故。十三者观察信。谓修信。由修生故。</p>\n<h3>　　原文2</h3>\n<p>　　释曰。障者相违义。多忘者。于已生信为障。<a href=\"/rmgjc/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>者。于未生信为障。行迷者。于正受似受信为障。如先所受能受执着故。恶友者。于他力信为障。以倒法令受故。善羸者。于自力信为障。邪忆者。于不迷信为障。放逸者。于现前信为障。少闻者于听法信为障。不听了义故。闻喜者。于求义信为障。少思惟故。思喜及定慢者。于观察信为障。少修及不细观察故。</p>\n<p>　　现代社会上认为迷信通常在儿童时代养成，佛学上有不同的观念。由于佛学认为有轮回，因此一个人前世如果迷信，今生则很可能继续迷信，<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>是迷者人格的一部分，难以被轮回改变（否则谈论轮回就没有意义）。</p>\n<p>　　有人认为迷信是佛学上首先提出的字词，而在文化上经过演变而成为一个普遍性的字词。</p>\n<p>　　“迷信”的一个义项是佛学术语。</p>\n<h2>广义的迷信</h2>\n<p>　　所谓迷信，就是对人或事物的盲目信仰和崇拜。狭义的迷信即封建迷信。从广义来说，迷信应当包括宗教信仰，因为任何宗教信仰都是迷信的表现。</p>\n<p>　　严格说来，宗教和封建迷信并不是一回事。每个具体的宗教和宗教团体，都有某一既定的崇拜偶像，如基督教、天主教的上帝、佛教的<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>。伊斯兰教虽不崇拜偶像，但信奉真主安拉，有<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>的明确目标、有教义、教规、活动场所和宗教仪式等。封建迷信则很难说有什么共同一致的崇拜物，也没有什么既定的宗旨、规定和仪式，更不会有什么共同的活动场所。封建迷信的对象可能是神仙鬼怪，也可能是山川树木。封建迷信和宗教相比则显得更原始，其活动多是在局部地区或<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>范围内。</p>\n<p>　　一般说来，对于个人的迷信活动，只要不妨碍社会政治<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>和经济生活，不违背国家宪法和法律，政府并不干涉。但是，对那些破坏民族团结和社会的迷信活动，对那些装神弄鬼骗财害命、破坏生产、残害群众的人，则必须分别情况予以严肃处理，情节严重的还要依法惩办。对反动会道门，则要坚决取缔。[4]</p>\n<h3>　　科学、宗教与迷信</h3>\n<p>　　学者：宗教和迷信当然不是一回事，但是也并非毫无关系。迷信是非理性的、没有科学基础的信仰，而宗教是对超自然力量(特别是对人格化的上帝，即有<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>、有智能和掌握人类命运的神)的崇拜，这种崇拜也是非理性的、没有科学基础的，因此宗教其实就是迷信的系统化和抽象化，尽管抽象出了许多超越迷信的内容(例如世界观、<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>观)，甚至有了一些合理的因素，但是仍然包含着许多迷信的因素。并不是一打上宗教的招牌，再荒诞的说法就都不成其为迷信了。通过修炼能够以石头、花香为食，不仅没有科学基础，而且与科学原理相违背，就是一种迷信。[5]</p>\n</div>"
    }
]