[
    {
        "title": "涅盘",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\">　<img alt=\"&#x6D85;&#x76D8;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022252772.jpg\" /></p>\n<h2><a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　涅槃，调理自己的思想，断除大脑里面不好的思想、程序、情感，最终达到没有烦恼，超脱<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>的境界，也就是无所得，无执着，<a href=\"/rmgjc/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>。佛教认为，轮回是一个必然过程；人死去以后，“识”会离开人体，经过一些过程以后进入另一个刚刚出生的新生命体内，该新生命体是人类，天尊经常听到有人要做牛做马可以是动物。</p>\n<p>　　涅槃又译为般涅槃、波利昵缚男、泥洹、涅槃那，意译为圆寂、灭度、寂灭、无为、<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>、<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>、安乐、不生不灭等。佛教教义认为涅槃是将<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>所有一切法都灭尽而仅有一本住法<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>而寂静的状态，所以涅槃中永远没有生命中的种种烦恼、<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，从此不再受后有，也就是不再有下一世的<a href=\"/rmgjc/liudaolunhui.html\" class=\"keylink\" target=\"_blank\">六道轮回</a>。</p>\n<p>　　这个术语最早源自于古印度<a href=\"/rmgjc/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>教，当时众说纷纭也都无法实证什么是涅槃？后因<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>降生示现成佛转法轮，教导<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们才渐渐有人实证涅槃，也就是声闻四果阿<a href=\"/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>、辟支佛舍寿时取证有余涅槃，也是生命的本际，而证得佛果的人，是取证无余涅槃。当有佛教的<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者过世时，许多人会尊称他们进入涅槃或圆寂了，而涅槃也经常被一般人认为是死亡的同义语。</p>\n<p>　　指幻想中没有烦恼，超脱生死的境界，也用作僧尼死亡的代称！</p>\n<h2>出典</h2>\n<p>　　涅槃《涅槃无名论》中的记载如下：“无名曰：夫至人空洞无象，而万物无非我造。会万物以成己者，其唯<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>乎！何则？ 非理不圣，非圣不理，理而为圣者，圣人不异理也。故天帝曰：般若当于何求？善吉曰：般若不可于色中求，亦不离于色中求。又曰：见缘起为见法，见法为见佛，斯则物我不异之效也。所以至人戢玄机于未兆，藏冥运于即化，总六合以镜心，一去来以成体。古今通，始终通，穷本极末，莫之与二。浩然大均，乃曰涅槃。</p>\n<h2>分类</h2>\n<p>　　依自性涅槃只有一种。依分别的根据则成两种：有余涅槃界与无余涅槃界。依不同的方面，涅槃有三种：空、无相与无愿。</p>\n<p>　　涅槃是一个不能再分解的究竟法。它是完全出世间的，而只有一个自性，那就是完全超越有为世间的无为不死界。依分别的根据则成两种；该分别的根据是（体验它的）<a href=\"/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>是否还存在。</p>\n<p>　　阿罗汉所体验的涅槃界名为“有余涅槃界”（sa-upādisesa-nibbānadhātu），因为虽然一切烦恼已灭尽，但由于过去执取所产生的诸蕴还存在。在注疏里也被称为“烦恼之灭尽”（kilesa-parinibbāna）。在阿罗汉死时所证得的涅槃界名为“无余涅槃界”（anupādisesa-nibbānadhātu），因为五蕴已完全被舍弃，不再后有。在注疏里也被称为“诸蕴之灭尽”（khandha-parinibbāna）。依不同的方面，涅槃有三种：</p>\n<p>　　涅槃被称为空（suññata）是因为它毫无贪嗔痴，也因为它毫无一切有为法；被称为无相（animitta）是因为它毫无贪嗔痴之相，也因为它毫无一切有为法之相；被称为无愿（appa?ihita）是因为它毫无贪嗔痴的渴望，也因为它毫无渴爱之欲。</p>\n<h2>特点</h2>\n<p>　　涅槃只能被亲身作证的圣人们完全理解。尚未证悟涅槃的人们至少应当知道它的三个特点。</p>\n<p>　　涅槃是常，即“不生、不长的非缘生法”，不是因缘和合而生的，是无条件的存在。涅槃是乐，即由于此处无诸苦。 涅槃<a href=\"/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>，就是指涅槃不为我所有、不是我、不是我的自我、在我里面没有涅槃，在涅槃里也没有我。“入灭”、“般涅槃”、“取涅槃”不能理解为进入了某个被称为涅槃的地方或境界。涅槃并无来、去、进、出这些概念。</p>\n<h2>定义</h2>\n<h3>　　原始佛教阐述</h3>\n<p>　　涅槃一词在佛陀出世前，印度《奥义书》思潮就已经在使用了，原先涅槃系指回归于包含一切且常乐我净的清静梵我，这个在耆那教教义中可以看明。 而佛陀<a href=\"/rmgjc/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>后，明白“因缘法”，对涅槃一词有新的定义和解释。</p>\n<p>　　如实正观世间集者，则不生世间无见；如实正观世间灭者，则不生世间有见。世间指五受阴：色受想行识，亦指十八界，即六根六境六识。世间集，指五受阴的<a href=\"/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>变异是随无明贪爱因缘驱动支持而有生命现象，是实实在在的现前一切，所以不会说一切都没有。世间灭，指五受阴的流转变异随着无明贪爱因缘灭除而不再有生命现象，所以不会说一切的存在都是实有永恒。所以要明白佛陀所定义的涅槃，必须先了解因缘法。生是依因缘支持而生，不是本来就有。而凡生起之一切，皆会随其赖之生起的因缘灭而灭，不会恒常存有。而随着因缘的灭尽，称之“灭”，此为佛陀所定义的涅槃。</p>\n<p>　　平时我们所以为的生灭，是以为事事物物自己在那边生灭，但事实上并非如此。事实只是依着五受阴因缘相互影响而不断再改变，只是改变并未灭去。只有随五受阴因缘灭尽，才是灭，而\"灭\"无因缘可记说。生命的升起，是依种种因缘条件才有的现象，随着五受阴因缘和依无明和贪爱驱使之条件的变异，而不断变化生命型态。</p>\n<p>　　只有随着无明和贪爱的灭除，驱使五受阴增长的因缘消除，无依此因缘影响的未来生命现象升起，是为灭。依因缘灭而灭，不能说去哪里或在哪里，只是无生命升起的因缘。并不是什么都没有，也不是有什么。纯粹是探讨因缘的流转影响变异，并非有什么存在，也不是一切虚假，真真实实随因缘生而生，随因缘变而变，依因缘灭尽而灭，灭尽不起，无因缘可记说。</p>\n<h3>　　分别说部诠释</h3>\n<p>　　分别说部这个名称来自第三次结集前阿育王和帝须尊者之间的问答：“王复更问。大德。<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>云何。答言。佛分别说也。”，这个部派的现代承继者是南传上座部佛教。涅槃被称为出世间，以及是由四道智所证得。它是道与果的所缘，被称为涅槃是因为它离去渴爱这一个纠缠物。在词源学方面，<a href=\"https://www.guang5.com/fxrm/fxcs/333528.html\" class=\"keylink\" target=\"_blank\">巴利文</a>Nibbāna 是源自动词 nibbāti，意为‘被吹灭’或‘被熄灭’。因此它是表示熄灭了世间的贪、嗔、痴之火。诸巴利论师较喜欢解释它为渴爱的纠缠（vāna）的不存在或离去（nikkhantatta）。只要人们还受到渴爱的纠缠，他们还被绑在生死轮回里（sa?sāra）；但在灭尽一切渴爱时，人们即会证悟涅槃，解脱生死轮回。</p>\n<h2>涅槃意义</h2>\n<p>　　涅槃是梵语，正音为波利匿缚男，旧云涅槃，今顺古亦云涅槃。又名泥洹，或云涅槃那，皆音之讹略，或楚夏不同。旧译为灭度，或云寂灭、无为、解脱、安乐、不生不灭等，名虽异其义则同。今单举灭度和寂灭二义释之：灭度，即“灭”除烦恼，“度”脱生死的意思。寂灭，寂谓理性“寂”静，灭谓烦恼“灭”除。亦可说，证得“寂”静之体性，自然烦恼“灭”除；烦恼灭除，自然证得寂静体性。“智论”云：涅名为出，槃名为趣，谓永出诸趣生死，则亦可译为出趣也。</p>\n<p>　　若据新译——玄奘法师则译为“圆寂”，此义比较来得完善，因为寂灭、灭度、解脱等译，不过仅约断德方面，言断灭生死烦恼。圆寂则统明智断二德。今略释之：</p>\n<p>　　具足一切福德智慧叫做“圆”；永离一切烦恼生死叫做“寂”。简单的说：即德无不“圆”，患无不“寂”。详细的说：即福慧二严做到圆满无缺（圆），三惑烦恼彻底清除，二种生死完全度脱（寂），永远不再被烦恼生死所困扰，回复“圆”明“寂”照的本有心体，而获到一种纯善纯美的庄严解脱。这就是涅槃的境界——圆寂。圆约进善方面言（成就一切福德）；寂约灭恶方面言（断惑灭苦）。据此研究起来，圆寂似乎大乘无为的涅槃，寂静、灭度等为小乘涅槃。</p>\n<p>　　要之，圆寂也就是指得“圆明寂照之真心”。因为它——真心——本具一切功德（圆），永离一切烦恼（寂）故。成佛即证此真心，故涅槃并非诸佛的专有品，不过凡夫一向为梦想所蒙昧，因此不能证得。所谓迷则颠倒梦想，悟则究竟涅槃。</p>\n<p>　　当知梦想，根本是由本觉真心而起的，我人如能灭一分梦想，即证一分真觉（如镜子去一分尘埃，即现一分光明），乃至全灭全证。至此则一切功德无不复归“圆”满，一切烦恼生死无不毕竟空“寂”，是证到大乘究竟涅槃的境界。佛原本是国王，为了超脱苦，是饿死的，尸体火化了。</p>\n</div>"
    }
]