[
    {
        "title": "婆罗门",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a></h2>\n<p>　　婆罗门（印地语: ब्राह्मण）源于梵天之口，婆罗门意为“祈祷”或“增大的东西”。祈祷的<a href=\"/rmgjc/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>具有魔力，咒语可以增添福祉消除灾难与<a href=\"/rmgjc/zuie.html\" class=\"keylink\" target=\"_blank\">罪恶</a>，因此执行<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>祭祀的神职者被称为婆罗门。婆罗门是祭司贵族。婆罗门阶级主要掌握神权，占卜祸福，垄断文化和报道农时季节，在社会中地位是最高的。婆罗门教将人分为四个种姓，婆罗门是最高种姓。</p>\n<h2>地位职责</h2>\n<p>　　印度四姓中，最高级种姓、祭司和学者的阶级。为古印度一切知识核心人群，印度社会中最崇高的种姓。长阿含卷六小缘经、卷十五种德经、慧琳音义卷二十九等皆载此阶级由梵天之口生，颜貌端正，清净高洁，以习吠陀、司祭祀为业。依摩奴法典规定，四姓中婆罗</p>\n<p>　　门有六法，即学习吠陀、教授吠陀、为自己祭祀、为他人祭祀、布施、受施。故四姓中除最下之首陀罗族外，其余三姓皆得诵吠陀、自作祭祀，然为他人祭师、教他人吠陀、受施等则仅限于婆罗门。</p>\n<p>　　婆罗门由于职责和地位的特殊可享有许多特权。他们可以免交各种税，因为人们认为，婆罗门已经以自己的虔诚行为偿清了这种债务，他们不得被处以死刑或任何类型的肉刑，因为婆罗门是神圣不可侵犯的。向婆罗门赠送礼物的人则得到祝福，他们将在今生或者来世，获得一定的善报。最受欢迎的礼物是土地，它可以“解除赠送者的一切罪孽”。因此婆罗门占有大量地产，常常是整座村庄。</p>\n<p>　　婆罗门多数为<a href=\"/rmgjc/sushi.html\" class=\"keylink\" target=\"_blank\">素食</a>者，但阿萨姆婆罗门有许多非素食的食物，其中大多是鱼、鸡、鸽、羊肉和鸭蛋(多数是祭神后的牲礼)。孟加拉的婆罗门吃鱼。</p>\n<p>　　除了祭司外，他们也担任宫廷文士、科学家(星象家，数学家)，教师和公务员。在二十世纪上半叶。婆罗门在某些领域政府职位占75%。</p>\n<h2>起源</h2>\n<p>　　古代的印度社会洋溢着浓郁的宗教气氛，祭司被人们仰视如神，称为“婆罗门”。“婆罗门”源于“波拉乎曼”（即梵），原意是“祈祷”或“增大的东西”。祈祷的语言具有咒力，咒力增大可以使善人得福，恶人受罚，因此执行祈祷的祭官被称为“婆罗门”。</p>\n<h2>影响</h2>\n<p>　　婆罗门教对缅甸文化影响较大。首先婆罗门教是缅甸人最早信奉的宗教，婆罗门教神被作为<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>的保护神而引入佛教的范畴，<a href=\"/fjrw/zhufopusa/hufatianwang/67066.html\" class=\"keylink\" target=\"_blank\">帝释天</a>作为缅甸至今仍然<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>的37位传统神的第一位大神而备受崇拜；其次，婆罗门教的宗教仪式被广泛吸收和应用在缅甸封建王朝的各种仪式中，缅甸历代封建王朝宫廷中都聘用婆罗门祭司，用婆罗门教礼仪主持宫廷大典和国家大典；再其次，婆罗门教的花纹图案普遍被应用在缅甸的佛教和民用建筑艺术上；第四，婆罗门教的占星术传入缅甸，至今流行于缅甸社会；第五，婆罗门教的神话故事传入缅甸，形成了传统节日；最后，婆罗门教的故事对缅甸文学也有较大的影响，罗摩衍那戏剧至今长盛不衰。</p>\n<h2>思想</h2>\n<p>　　婆罗门教是多神教而又带著一神教的色彩，崇拜各种自然的神碉，盛行祭祀祈祷以招福禳灾，而以梵（Brahma）为创造宇宙万物的主宰。梵从口生出婆罗门，从肩部生出刹帝利，从腹部生出吠舍，从足部生出首陀罗，以此定四姓的贵贱，这就成为种姓制度的根据。人应当服从梵天的意旨，因此应当信奉《吠陀经》，奉事婆罗门，严格遵守种姓制度。后来婆罗门教义有所发展，它把‘梵’抽象起来做为宇宙的本体，或宇宙生起的最高原理；一方面又从个人观察，认为‘我’是个人的主宰和本体，人的身体由‘我’而生，人的活动由‘我’而起，外界万物也都因‘我’而存在。由此推论出‘我’与‘梵’本来不二，人所应当努力的就是经过<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>以达到梵我一致的境地，这样才能免去轮回之苦而得到大<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。</p>\n<h2>佛教中婆罗门</h2>\n<p>　　佛教本来就是由婆罗门教（印度教）衍生出来的分支，两者的相同之处大于不同之处，印度在孔雀王朝时期曾极力推行过支持种族制度的佛教，并将其广泛传播至中亚和东南亚等地。另外，种姓制度不是用来区分社会阶层的，而是用来区分入侵南亚、西亚的雅利安人和当地土著的种族隔离制度。种姓制度起源于雅利安人，不是印度教的产物，在唐代以前，波斯的种姓制度要比印度的来得出名，比如著名的“波斯不净人出身婆罗门的更多。释迦牟尼禁止奴隶入教。在佛典的律藏中，有很多关于这方面的规定。比如《根本说一切有部毗奈耶<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>事》卷三说：“从今已往，汝等苾刍不应与奴出家。若有求者，当可问之：‘汝是奴不?’若与奴出家，得越法罪。”第23卷，第1033页中。</p>\n<h2>婆罗门教</h2>\n<p>　　在古老的印度次大陆，哈拉巴文化时期便有了宗教的萌芽，其内容主要是崇拜自然，有着图腾崇拜的原始痕迹。公元前1500年左右，雅利安人大举侵入，与当地的土著文化相融合，于公元前1200年至公元前1000年期间编纂了原始的宗教文献《吠陀》，并在此基础上创建了婆罗门教。与世界上的其他宗教相比，由于婆罗门教诞生的时间较早，所以内容也较为庞杂。一方面，它不像基督教或伊斯兰教那样，有《圣经》、《古兰经》之类的根本经典。而是将《吠陀》、《奥义书》、《往事书》，以及其后的各类法典统统作为教义的源泉。另一方面，它也不像基督教和伊斯兰教那样，有单一而明确的神，而是将成千上万个神明作为顶礼膜拜的对象。</p>\n<p>　　与世俗<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中的种姓制度相一致，婆罗门教的神也是分层次的。最高层次的神是梵，它不是一种人格化的神，超越时空，不具有任何形式，但却是隐藏在宇宙背后的绝对实在、终极本体。第二层次的神是梵的具体形态，显现为梵天、湿婆、毗湿努三大主神，以及他们的各种<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>、配偶和子嗣。作为梵的具体化身，三大主神功能不同，梵天是世界的创造者，湿婆是世界的破坏者和重建者，毗湿努是世界的维护者。第三层次的神是人格化了的自然对象，如太阳神、月亮神、地母神等等，种类各异、名目繁多。从这里，不难看出：层次越低的神，越具有图腾物的原始痕迹；图腾越高的神，越具有远离图腾物的抽象色彩。值得注意的是，“吠陀教诸神中除了占主要数量的自然神灵外，还有一些属于祖先和英雄人物的行列，是祖先崇拜和英雄人物崇拜观念的延伸。因此，吠陀中有一个鲜明特点就是，既崇拜自然神灵，同时又尊敬亡人。”</p>\n</div>"
    }
]