[
    {
        "title": "【烧香】-佛教的烧香是什么意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x70E7;&#x9999;&#x3011;-&#x4F5B;&#x6559;&#x7684;&#x70E7;&#x9999;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022215350.jpg\" /></p>\n<h2><a href=\"/rmgjc/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　烧香，原指敬神<a href=\"/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>的一种仪式。<a href=\"/rmgjc/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>时把香点着插在香炉中，表示诚敬。有的时候，烧香是为了取其清雅而燃香，是一种中国类似插花的传统雅文化。现代社会中，烧香有时也比喻为求人办事儿请客送礼。</p>\n<h2>基本解释</h2>\n<p>　　1、 [burn joss sticks (before an idol)]∶烧香<a href=\"/rmgjc/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>时点着香插在香炉中。</p>\n<p>　　2、[bribe]∶比喻为求人办事而请客送礼。</p>\n<p>　　有些地方风气不正,办事得先烧香。</p>\n<h2>引证解释</h2>\n<p>　　1、 敬神礼佛的一种仪式。礼拜时把香点着插在香炉中，表示诚敬。</p>\n<p>　　唐 寒山 《诗》之六三：“烧香请佛力，礼拜求僧助。”《红楼梦》第五四回：“咱们明儿到阎王庙去烧香。” 老舍《神拳》第四幕：“当初你可那么虔诚，在自己的花园里设起坛来，天天磕头烧香。”</p>\n<p>　　2、 为取其香气或清雅而燃香。</p>\n<p>　　唐 杜牧 《送容州中丞赴镇》诗：“烧香翠羽帐，看舞郁金裙。” 宋 陆游《移花遇小雨喜甚为赋二十字》：“独坐闲无事，烧香赋小诗。” 元 张雨 《玄文馆省郎牛仲庸诸贤雅集筹韵赋诗》：“烧香 鲍靓 室，促席 桓伊 筝。”</p>\n<p>　　3、比喻为求人办事而请客送礼。</p>\n<p>　　《人民文学》1982年第1期：“我父亲一伸腿，我们就成了平民百姓，再也没人上门来烧香了。”</p>\n<h2>历史</h2>\n<p>　　香料历史悠久，可追溯到五千年前的皇帝神农时代，早有采集植物作为医药用品来驱疫避秽。当时人类对植物中挥发出的香气已很重视，闻到百花盛开的芳香时，同时感受到美感和香气快感；将花、果实、树脂等芳香物质奉献给神，芬芳四溢而达到完美的<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>境界。因此，上古时代就把这些有香物质作为敬神明、祭祀、清净身心和丧葬之用，后来逐渐用于饮食、装饰和美容上。在夏商周三代，对香粉胭脂就有记载，张华博载“纣烧铅锡作粉”，中华古今注也提及“胭脂起于纣”，久云，“自三代以铅为粉，秦穆公女美玉有容，德感仙人，肖史为烧水银作粉与涂，亦名飞云丹，传以笛曲终而上升”，可见脂粉一类产品早在三代已使用。春秋以后，宫粉胭脂在民间妇女中也开始使用。阿房宫赋中描写宫女们消耗化妆品用量之巨，令人叹为观止。“作为一种<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>情调要烧，所谓对月焚香，对花焚香，对美人焚香，雅而韵，妙不可言；作为一种门第身份。</p>\n<p>　　中国烧香的历史，大体可分为三个时期。前两个时期视为做香料，香水用，后期为宗教敬神拜佛烧香。初始期其间所烧的香有以下几种：</p>\n<p>　　柴，玉帛，牲体，香蒿，粟稷，脂等。</p>\n<p>　　烧香的作用是唯一的，用来祭祀。</p>\n<p>　　周人升烟以祭天，称作“禋”或“禋祀”。《<a href=\"/ctwh/sishuwujing/shijing/\" class=\"keylink\" target=\"_blank\">诗经</a>·周颂·维清》：“维清缉熙，文王之典，肇禋。”笺：“文王受命始祭天。”即是说，这种祭制始于周文王。</p>\n<p>　　其具体祭法为：将牲体和玉帛置柴上，燃柴升烟，表示告天。《周礼·春官·大宗伯》：“以禋祀祀昊天上帝，以实柴祀日月星辰，以熈燎祀司中司命。风师雨师。”《十三经注疏》 注：“禋之言烟。”“三祀皆积柴实牲体焉，或有玉帛，燔燎而升烟，所以报阳也。”疏：“禋，芬芳之祭。”</p>\n<p>　　可见，所谓禋祀，一是点火升烟，二是烟气为香气。以香烟祭神，那么这就是后世所谓“烧香”了。</p>\n<p>　　这一期，香事有以下特点：一是香品原始；二是自然升火，不用器具；三是专用于祭祀，即，烧香还没有生活化。明周嘉胄《香乘》引丁谓《天香传》谓：“香之为用，从上古矣。所以奉神明，可以达蠲洁。三代禋祀，首惟馨之荐，而沉水熏陆无闻也。”</p>\n<p>　　《诗经·大雅·生民》：</p>\n<p>　　诞我祀如何？或舂或揄，或簸或蹂。释之叟叟，烝之浮浮。载谋载惟，取萧祭脂。取羝以軷，载燔载烈，以兴嗣岁。</p>\n<p>　　昂盛于豆，于豆于登，其香始升。上帝居歆，胡臭亶时。后稷肇祀，庶无罪悔，以迄于今。</p>\n<p>　　可见《诗经·大雅·生民》中所载烧香蒿、脂、烧牲体以祭祀。</p>\n<p>　　《梦溪笔谈·药议》：“至深秋，馀蒿并黄，此蒿独青，气稍芬芳。”可见香蒿气味芳香，是当时的一种香料。烧香蒿是谓“烧香”，以香气用来祭祀。</p>\n<p>　　烧香历史的第二个时期，即是从汉武帝到三国，可称引进期。汉武帝于中国香事的发展，有特殊重要的意义。</p>\n<p>　　其一，武帝奉仙，为求长生，是神就敬，而打破了以往“香祭祭天”的垄断。</p>\n<p>　　其二，武帝时期香品渐走向实用化，如置椒房储宠妃、郎官奏事口衔舌香等，打破了香必用祭的垄断，使香进入生活日用。</p>\n<p>　　其三，也是最重要的一点，武帝大规模开边， 就在这一时期，产自西域的香料传入中国。 宋·吴曾《能改斋漫录》称：“又按汉武故事亦云，毗邪王杀休屠王，以其众来降。得其金人之神，置甘泉宫。 金人者，皆长丈余，其祭不用牛羊，唯烧香礼拜。 然则烧香自汉已然矣。”此外，武帝曾遣使至安息国（今伊朗境内），《<a href=\"/ctwh/ershisishi/hanshu/\" class=\"keylink\" target=\"_blank\">汉书</a>》称：“安息国去洛阳二万五千里，北至康居，其香乃树皮胶，烧之通神明，辟众恶。”树皮胶，即树脂，是为香料。</p>\n<p>　　由于有了西域的香料，使武帝时的香事变得格外繁盛起来，后世野史笔记屡称不绝。什么焚“月支神香”解除长安瘟疫（《香乘》卷8），燔“百和之香”以候王母《汉武外传》，用东方朔“怀梦”香草在梦中与李夫人相见，直至烧“返魂香”使李夫人还魂。这个传说还传到日本（《源氏物语》）第48回）。</p>\n<p>　　香事繁盛，香具应运而生，不久，中国第一个香炉也发明出来了，称为“博山炉”。传说上面还有刘向的铭文：“嘉此王气，崭岩若山。上贯太华，承以铜盘。中有兰绮，宋火青烟。”（《香乘》卷38）。刘向为宣帝时人。从此，香品与香炉配，使中国的香事进入一个新阶段。</p>\n<p>　　然而，从武帝时引入西域香料始，降及东汉三国，在这三百多年间，香的使用还仅限于宫庭和上层贵族之中，极为名贵，难得进入寻常百姓之家。《五色线》称：“魏武与诸葛亮书云：今奉鸡舌香五斤，以表微意。”为馈赠之礼品。《<a href=\"/ctwh/ershisishi/sanguozhi/\" class=\"keylink\" target=\"_blank\">三国志</a>》称：“魏武令云：天下初定，吾便禁家内不得熏香。”足见焚香即使在宫庭中也还是一种奢侈。</p>\n<p>　　第三期，是普及期。香的走向普及，是隋唐以后的事。普及的原因有二：一是“西香”（西域）由“南香”（两广、海南）所取代。“迨炀帝除夜，火山烧沉甲煎不计其数，海南诸香毕至矣。”（《香乘》卷1）</p>\n<p>　　南香的大量涌入，使香的价格降低，为普及提供了物质准备。二是佛道二教从六朝以来大发展，轮番跻身于国教的至尊地位；二教尚香，“返魂飞气，出于道家；旃檀枷罗，盛于缁庐。”（颜氏《香史序》）从而，<a href=\"/rmgjc/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>汹汹，风气大展，造成烧香走向普及。只不过，这时固有儒教还与释道二教时相对抗冲突，传统士人抵制特别是佛教，而使繁盛的香事略为减色。</p>\n<p>　　迨至宋代，三教融合，烧香之俗，也便御风而行，为大家一致崇尚，香道也自此产生。明屠隆总结道：“香之为用，其利最薄。物外高隐，坐语<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>，焚之可以清心悦神。四更残月，兴味萧骚，焚之可以畅怀舒啸。晴窗塌帖，挥尘闵吟，温灯夜读，焚以远辟睡魔。谓古伴月可也。红袖在侧，秘语谈私，执手拥护，焚以熏心热意。谓士助情可也。尘雨闭窗，午睡初足，就案学书，啜茗味淡，一炉初热，香蔼馥馥撩人。更宜醉筵醒客。皓月清宵，冰弦曳指，长啸空楼，苍山极目，未残炉热，香雾隐隐绕帘。又可祛邪辟秽，随其所适，无施不可。”</p>\n<p>　　香与美已融合为一，大量诗文专门写香。兹举北宋陈与义（字去非，与黄庭坚、陈师道齐名）的《焚香》 为例：</p>\n<p>　　明窗延静书，默坐消尘缘。</p>\n<p>　　即将无限意，寓此一炷烟。</p>\n<p>　　当时<a href=\"/rmgjc/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>，妙供均人天。</p>\n<p>　　我岂不清友，于今心醒然。</p>\n<p>　　炉香袅孤碧，云缕霏数千。</p>\n<p>　　悠然凌空去，缥缈随风还。</p>\n<p>　　世事有过现，熏性无变迁。</p>\n<p>　　应是水中月，波定还自圆。</p>\n<h2>含义</h2>\n<p>　　1、表示虔诚恭敬供养三宝，以此示范接引众生。</p>\n<p>　　2、表示传递信息于<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>法界，感通十方三宝加持。</p>\n<p>　　3、表示燃烧自身，普香十方，提醒<a href=\"/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a><a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>无私奉献。</p>\n<p>　　4、表示点燃了佛教徒的戒定真香，含有默誓“勤修戒、定、慧，熄灭贪、嗔、痴”意，佛并不嗜好<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>大香贵香，但却喜欢<a href=\"/rmgjc/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>的戒、定、真、香。</p>\n<p>　　上香以三支为宜。此表示戒、定、慧三无漏学；也表示供养佛、法、僧<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>三宝。这是最<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>且文明的烧香供养。上香不在多少，贵在心诚，所谓“烧三支文明香，敬—片真诚心”。一般在大雄宝殿前上三支香就行了。</p>\n<p>　　把香点燃后应插在香炉中间，第一支香插在中间，心中默念：供养佛，觉而不迷；第二支香插在右边，心中默念：供养法，正而不邪；第三支香插在左边，心中默念：供养僧，净而不染。</p>\n<h2>道教敬香</h2>\n<p>　　敬香有两种，一是殿主烧香，此皆用立香，以三炷为准，插于大香炉内，炷与炷之间距，三炷平列以不过寸宽为合格，故有[烧香不过寸，过寸神不信]之谚。二是坛主拈香，此香以<a href=\"/sushi/yaoshan/tanxiang/\" class=\"keylink\" target=\"_blank\">檀香</a>为之，敬拈檀香，非常讲究，每炷檀香长短粗细，长不过寸，粗不过分。坛主拈香时，初炷香插入炉中间，二炷插于左，三炷插于右，三炷香平列并拢。香炉左盒盛香面，右盒盛檀香。</p>\n<p>　　叩拜，叩拜礼，是我国民族传统礼仪，有不同的敬意和不同的仪规，用不同的礼节以表示，故有九拜之仪。[擎拳恭手]，是以表示恭敬之意。后世演变成叩头作揖礼，直到现在，道教仍行叩头作揖礼。</p>\n<p>　　叩头有三叩、九叩之别。 　道教以一揖三叩再一揖，为一礼。与上圣高真祝寿、庆贺道场毕要行三礼九叩。叩头虽用拜垫，实际是五体投地，即双足，双手着地，头磕下去时要头着手。足站成八字形，双膝与手同时着地，左手搂着右手，手心皆向下，成十字形，身为一，表示着[八十一化]。</p>\n<h2>佛教阐述</h2>\n<p>　　<strong>佛教的香</strong></p>\n<p>　　佛家认为香与圆满的智慧相通。</p>\n<p>　　佛家认为，香于人的智慧、德性有特殊的关系，妙香与圆满的智慧相通相契，<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>有成的贤圣，甚至能够散发出特殊的香气。</p>\n<p>　　佛家认为香能沟通凡圣，为最<a href=\"/rmgjc/shusheng.html\" class=\"keylink\" target=\"_blank\">殊胜</a>的供品 。</p>\n<p>　　<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>住世时，弟子们就以香为供养。佛家认为“香为佛使”，“香为<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>之使”，所以焚香上香几乎是所有佛事中必有的内容。从日常的诵经打坐，到盛大的浴<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>会、水陆法会、佛像开光、传戒、<a href=\"/fangsheng/\" class=\"keylink\" target=\"_blank\">放生</a>等等佛事活动，都少不了香。特别是法会活动，必以隆重的上香仪式作为序幕。</p>\n<p>　　佛家用香辅助修持 。</p>\n<p>　　佛家认为香对人身心有直接的影响。好香不仅芬芳，使人心生<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，而且能助人达到沉静、空净、灵动的境界，于心旷神怡之中达于正定，证得自性如来。而且好香的气息对人有潜移默化的熏陶，可培扶人的身心根性向正与善的方向发展。好香如正气，若能亲近多闻，则大为受益。所以，佛家把香看作是<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>的助缘。</p>\n<p>　　佛家以香<a href=\"/rmgjc/zhibing.html\" class=\"keylink\" target=\"_blank\">治病</a></p>\n<p>　　佛家香品的种类十分丰富</p>\n<p>　　由于香的尊贵、神奇及其在佛教中的悠久传统，还有他为诸佛乐道的神圣，在今天的佛教之中几乎是无处不“香”了。</p>\n<p>　　僧人打坐以烧一炷香的时间为准，谓之“坐香”； 围着佛像“绕佛”，三圈、七圈或更多，既是礼佛也是以“经行”作修持，谓之“行香”，若是跑步绕佛，则谓之“跑香”；</p>\n<p>　　用于警策修行的形如宝剑的木板，谓之“警策香板”，用于惩戒的谓之“清规香板”；用于警醒昏沉者的谓之“巡香香板”； 若修持者犯了错，还有罚去“跪香”；</p>\n<p>　　佛殿谓之“香殿”，厨房谓之“香厨”，而佛家寺院更是被尊称为“檀林”。</p>\n<p>　　佛家烧香一般都是<a href=\"/rmgjc/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>香</p>\n<p>　　这是由于烧三根香代表供养佛，法，僧。 烧香时，第一根插中间，默念供养佛，觉而不迷。第2根插右边，默念供养法，正而不邪，第3根插左边，默念供养僧，净而不染。</p>\n<h2>注意事项</h2>\n<p>　　<strong>常识</strong></p>\n<p>　　1、关于烧香的一般常识 南岳进香分为山顶和山脚的大庙两处。烧香分为高香、保香、许愿香和还愿香等，一般人去都是烧保香，保佑平安<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>、升官发财什么的，这样一般可以不用专程去还愿，烧高香一般是求具体什么事，需要再去烧还愿香。具体烧什么香在选择香的时候就要定好。</p>\n<p>　　2、关于进香用品 进香用品一般包括香、烛、包和拜香。如果有多人同去一定要各付各的钱，这个是不能请客的，切记。当然先由朋友代购，然后再付钱给朋友是没问题的。</p>\n<p>　　3、关于写香包，大庙是佛道一体的，一共有八位神轼，所以一共有八个香包，大家要在每个香包上写明自己的姓名、住址、烧的什么香和年月日，日期用天干历，比如庚寅年什么的。记得地址写详细点，要不神仙可找不到你也不能帮你了。</p>\n<p>　　4、关于烧香的顺序（先烧香，后拜佛），提着香包、香、烛等供品，举着拜香（男左女右），大庙从前门进，先在圣帝大殿前的左香炉前祷告，然后把供品投入香炉，只留下一束最长的大拜香不投入（在这里补充一下，留下的大香上记得写上：名字，“某某某 诚心叩拜”，等到各殿拜完后再投入香炉，这里反正有很多人，实在搞不清就看别人怎么做吧），烧完包就可以依次到各殿拜了，要注意的是未婚女性不要去拜注生娘娘殿，在外面行个礼就行了。因为那是管送子的，到时候中标了可别怪娘娘哦。</p>\n<p>　　<strong>上香</strong></p>\n<p>　　在寺庙内有很多<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>,如果你愿意,可以一尊一尊的拜过去,如果时间不允许,只需在大雄宝殿前烧.步骤如下:</p>\n<p>　　自己请自己的香,不能由别人付香火钱.</p>\n<p>　　最好用自己的火点燃香(三支即可,不需要大把大把的烧),面朝大殿的大门(为了防止火灾,一般不可以在大殿里烧香),双手轻握三支青香(男的左手在上,右手在下,女士反之),突然向上方一提,燃烧的火随即会熄灭,千万不能用嘴去吹灭.</p>\n<p>　　上香时先上香后礼拜，很多人抓着一大把燃着的香到处拜，滚烫的香灰在寺院到处飘着，阵阵浓烟熏着人们的眼睛，以为香越高，越大把心越诚，这些都是不懂的表示，其实三根香就够了，敬在一个炉中即可，“万佛一炉”然后经过没一座佛堂时，合掌拜三下就可，佛教根本就没有诸多讲究，最主要你有没有清净自心。</p>\n<p>　　<strong>拜香</strong></p>\n<p>　　把香举至额头一般高,闭眼许愿;然后三拜.（举香的高度不得底于下身）</p>\n<p>　　右转,面朝东方(一般大殿的门是朝南的),按第3步方式许愿,三拜;然后朝南,朝北.</p>\n<p>　　拜完后即可将香插到香炉内,注意:应该用左手燃香，因为右手<a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>，左手相对来说要平和，不可往香炉内一丢了之.</p>\n<p>　　<strong>女人大姨妈来的时候不要去上香.</strong></p>\n<p>　　进庙烧香，意思是点燃自己的心香，点灯是点亮自己的心灯，这时就可以得到佛菩萨的加持，使自己得到智慧等等。所以烧可以烧一枝，可以烧两枝，最多烧三枝。不必多烧。进庙烧香，可以自己带，也可以从外头买，不过一般大殿上都备有香，所有你可直接用，如果经济条件允许，你可以往功德箱中放点功德钱，如果困难，放心菩萨不会怪罪你的，你拜了佛也一样有功德。</p>\n<p>　　不过见过很多信佛的人请上一串<a href=\"/rmgjc/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>挂在脖子上，师父说这样做一般人是承受不起的。所以希望朋友们以后如果请了念珠，请把他带在手上。</p>\n<p>　　焚三支清香，一支敬佛，一支敬法，一支敬僧；</p>\n<p>　　庙里的垫子中间是给<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人拜佛用的，在家人男人跪拜用左边的，女人用右边的；</p>\n<p>　　<strong>在庙里按顺时针方向行走拜佛</strong></p>\n<p>　　进庙前沿尽量不要走中间，沿阶梯边沿而上，男左女右，进门时尽量不要走正门，因为方丈门朝晚课时都是从正门进的，而<a href=\"/rmgjc/shami.html\" class=\"keylink\" target=\"_blank\">沙弥</a>等从偏门进，所以为了和寺院一致，大家都尽量应该从偏门进，男左女右，进去时尽量跨右脚，出门时也从偏门出就是，不要踩在门槛上（一般寺院门槛做得很高）。进庙门的时候,千万不要踩门槛.（据说门槛是神的肩膀还是啥了，踩了就是不敬）</p>\n<p>　　先，心要虔诚，要茹素，手要干净，不要在庙堂里大声喧哗以及说无关的“唠叨话”，不要用手指点佛像，不可大声喧哗和讲不敬的话语。还有比较重要的一点，不可以随口胡乱许愿，因为许愿一定要还愿的，如果没把握做到，就千万别许愿。别求发财，佛不是保佑你发财的。可以求平安，求健康顺遂。不要随口许诺给佛什么供养，然后又抛到脑后。佛又不争你的一柱香，这个<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>是要让我们不要随意承诺，所谓做人应该有言必践吧。佛所恼的应该是这些虚妄之言吧。</p>\n<p>　　不要跨过蒲团，因为也会给人一种不庄严的感觉，而你后拜，却站在正在上香的香客前面，也是不礼貌的行为，因为可能会让别人起嗔念、贪、痴就是修行路上的三毒。三毒不灭难见真如本性。</p>\n<p>　　去道观许愿是要还愿的。一年愿望实现后回来，方法进去问人就可以了。如果没许愿光是拜，就不用。寺院一般是不用还愿的，但是你最好许个做多少善事的愿。就发愿来促使你本身的许愿。</p>\n<p>　　不要不经寺院同意采摘寺院管理范围的花果，私自拿供品等物，这也是不对的行为，叫“偷盗四方常住”也要获果报的。</p>\n<p>　　<strong>不要在寺院吃荤食。</strong></p>\n<p>　　寺院通常有经书赠送的，不要忘了请几本，世间之物还有什么比经书更珍贵的</p>\n<p>　　请来的经书护身符不可随意放置，应该取干净的书柜放好。同房时房间切不可有<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>护身符等法物，因为护身符等是<a href=\"/rmgjc/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>护身的，沾上邪气将会起不到作用，这才是切记的。</p>\n<p>　　如果是因为被邪魅债主缠身，拜完时做回向时念将拜佛功德回向给冤亲债主，他们也会高兴的。</p>\n<h2>方法</h2>\n<p>　　上香时，用大拇指、食指将香夹住，余三指合拢，双手将香平举至眉齐，观想佛菩萨显现在我们的眼前，接受香供养。如果人很多时，将香直竖向上，以免烧到他人，然后走到距佛像三步远的距离，举香观想拜佛。上香时以一支为宜，若要上三支香，则将第一支香插中间（口念，供养佛）、第二支香插右边（口念供养法）、第三支插左边（口念供养僧）、合掌（供养一切众生，愿此香华云，遍满十方界，供养一切佛，尊法诸贤圣）。</p>\n<h2>其它相关</h2>\n<p>　　<strong>烧香对身体的危害</strong></p>\n<p>　　宋人李琳曾言：“韦应物扫地焚香，燕寝为之凝清；黄鲁直隐几炷香，灵台为之空湛。”清初文人钱曾亦说：“古人命笔虽小道，不感聊尔成书。……书馆琴窗，萧晨良夜，静对此谱，如烧大象藏香一丸，兴光网云，覆<a href=\"/rmgjc/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>味国，尔时鼻观先参者为何如也。”以现代医学观之，香因不完全燃烧所产生的烟会有一定危害，与二手烟类似；而且如同品质好的烟因为没有警示性的臭味、危害反而更高一样，品质好的香对健康的效应也只是自我安慰，大多含有丙酮、甲醛、甲苯、二甲苯、氯苯及多环芳香烃等有毒物质，除了有致癌风险[2]  ，也会引发肺水肿、气喘、肺尘症。</p>\n<p>　　改用隔水加热精油的方法可以减少危害，但不一定无害，精油可能含有有害物质。</p>\n<p>　　烧香还是PM2.5的源头之一。</p>\n<p>　　<strong>达摩大师对烧香的开示：</strong></p>\n<p>　　“烧香者：亦非世间有相之香，乃是无为<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>之香也；薰诸臭秽无明恶业，悉令消灭。其正法香者，有其五种：一者戒香，所谓能断诸恶，能修诸善。二者定香，所谓深信大乘，心无退转。三者慧香，所谓常于身心，内自观察。四者<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>香，所谓能断一切无明结缚。五者解脱知见香，所谓观照常明，通达无碍。如是五种香，名为最上之香，世间无比。佛在世日，令诸弟子以智慧火，烧如是无价珍香，供养十方诸佛。今时众生不解如来真实之义，唯将外火烧世间沉檀薰陆质碍之香，希望福报，云何得？</p>\n<p>　　如何敬佛，许多细节上都有讲究的。</p>\n<p>　　首先说选门进，寺庙建筑都有许多道门，从哪一道门进入都有讲究的。据说只有开了光的寺庙才有资格修十三道门。正中间的三道门，才是供人出入的。普通游客，进门只能走右边的那道门，中间那道门叫空门，只有出家人才可以出入的。</p>\n<p>　　进门时，女客先迈右脚，男客先迈左脚，都要注意，一定不能踩在门槛上，而且这步子，需迈得越大越好。</p>\n<p>　　烧香的话，三炷为自己祈福，六炷为两辈人祈福，九炷为三代人祈福。而十三是一个极致，十三炷香就是功德圆满的高香。</p>\n<p>　　是烧香再叩头。烧香的话，应该是左手拿香，右手拿烛，因为常人用右手杀鸡剖鱼，如果是左撇子的话，则反之。</p>\n<p>　　烧香时，先点燃香，要越旺越好，人们就常说香火旺盛嘛。左手在上，右手在下握住香，高举过头顶作揖。</p>\n<p>　　作揖后，把香插在香灰里，就可进门叩头了。叩头的话，要认准<a href=\"/rmgjc/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>菩萨或<a href=\"/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>。比如，你不能向<a href=\"/fjrw/zhufopusa/pusa/66964.html\" class=\"keylink\" target=\"_blank\">地藏菩萨</a>一阵猛叩头。</p>\n<p>　　跪拜的姿势是这样的，双膝跪在蒲团上，双手合什，注意，这个双掌合什要注意手心处呈空心状，高举过头顶，向下至嘴边停顿，可许愿，再向下至心口，默念，再摊开双掌，掌心向上，上身拜倒。</p>\n<p>　　祈福还有一个仪式叫\"开光\"，当然是由得道高僧来主持最好。平时开光的东西置于家中，须得初一十五净手焚香，否则为不敬。但如果是很特殊的开普光，则不同，开光的物件可随身携带。供开光的物件只能是象牙、金或玉制品。</p>\n<p>　　把开光的物品和写上被祈福人的姓名和生庚八字(记不住生庚八字亦可不写)的纸用红纸或红锦囊包好，递上<a href=\"/rmgjc/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>一份(最好是以三六九数字相关)，请大师帮忙开光。言语需恭敬，否则冒犯了大师，不给你开光。</p>\n<p>　　开光的过程是把所有的开光物件放于一托盘，置于佛前，大师念经数篇，即算是<a href=\"/rmgjc/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>普照。你的物件因些而赋于灵气与法力，可以带在身边保佑你了。</p>\n</div>"
    }
]