[
    {
        "title": "【杀生】-杀生是什么意思？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x6740;&#x751F;&#x3011;-&#x6740;&#x751F;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022253428.jpg\" title=\"&#x3010;&#x6740;&#x751F;&#x3011;-&#x6740;&#x751F;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;\" /></p>\n<h2><a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a></h2>\n<p>　　<strong><span style=\"color:#b22222;\">杀生，指宰杀牲畜、家禽等生物。佛家指杀害一切生灵。</span></strong>语出《<a href=\"/ctwh/zhuzibaijia/fajia/guanzi.html\" class=\"keylink\" target=\"_blank\">管子</a>·海王》：“﹝ 桓公 曰：﹞‘吾欲籍于六畜。’ 管子对曰：‘此杀生也。’”</p>\n<h2>基本解释</h2>\n<p>　　1，指宰杀牲畜、家禽等生物。佛家指杀害一切生灵，并以为十恶之一。<a href=\"/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a><a href=\"/rmgjc/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>中第一是不得杀生。不杀生。</p>\n<p>　　2，绝贪生之念，达于不生不死之地，故长生。</p>\n<h2>佛家含义</h2>\n<h3>　　概述</h3>\n<p>　　一般初<a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的人，对众生的定义不明，而且现在更有人说，植物也有生命，植物也有<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>，若说不杀生，应该既不杀动物，也不杀植物。其实生命有它的层次，植物是无情众生，动物是有情众生。所谓众生，可分作三级，高级的为人类，具有三个条件：一、有活的细胞；二、有神经的反应；三、有思想及记忆。低级的为植物，只有活的细胞，没有神经和记忆，虽有<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>的反应，没有苦乐的感觉，更没有思想及记忆，所以叫做无情。中级的是动物，只有少数如狗、猴子、马、象等高等动物有若干的记忆力，但没有思想力。至于下等动物除了神经的本能反应，没有记忆和思想，然其既有神经就有<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，就会怕死。所以虫蚁都会自然地知道逃避死亡的危险，植物则不然。因此，杀生的界定，就是能够知生怕死的动物而不及于植物。</p>\n<p>　　佛戒<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>不可砍伐草木，是因低级的鬼神，依草附木，以草木为庇护，为了慈悲鬼神，不使鬼神生嗔，故不去破坏其居处，并非为了草木不可杀的理由。</p>\n<p>　　微生物如细菌，从生物学上看，它是介于植物与动物之间的生物，既没有神经更没有记忆和思想，不属于有情众生，可以说是活动的植物，所以，杀菌不是杀生。</p>\n<p>　　关于水中的微生物，除了细菌之外，尚有比较高等的生物，他们虽也没有神经，但已可以算在动物之列，因此，佛世的比丘，用水需要通过滤水囊的过滤，把比较大的微小众生滤出，比较小的就不管了。这是基于慈悲的观点，不忍目见生物而不救度。如果肉眼不能见，或虽见而不能分辨是有情或无情众生，那就理会不到了。</p>\n<p>　　<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>主张不杀生，主旨在于众生平等的慈悲精神，一切众生都有生存的权利和自由，我们自己怕受伤害、畏惧死亡，众生无不皆然。众生的类别虽有高低不同，但众生的生命绝没有贵贱、尊卑之分，如果人人发扬这种平等、慈悲的精神，我们的世界一定是和谐、和平、互助、互敬、互爱、融洽无间，将没有一人会受到故意的伤害。虽然<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>中说，杀生有果报，杀人偿命，吃它半斤，还它八两，这是说明了因果不爽的事实。但是我们不必把不杀生的著眼点摆在害怕受报的观点上，果报是有的，但也并非绝对不可以改变的；养成慈悲心，才是不杀生的重点，也是佛<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>化世的精神。</p>\n<h3>　　职业杀生</h3>\n<p>　　职业性杀人。有两种情况，一种是小规模杀人，一种是大规模杀人。小规模杀人，指紧（防和谐错字）察、刽子手、特勤等情况；大规模杀生，特指战争（地震等灾难问题自己搜，不方便宣之于口）。</p>\n<p>　　很显然，这里所说的职业杀人者，是常人社会法律法规的执<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，他们是无罪的。而常人社会的法律法规，本来就是<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>在常人社会的体现，尽管层次很低，但却与宇宙特性是一脉相承的，因而佛也同样认为他们无罪。其中，小规模的职业杀生，就是在执行轮回；大规模的杀生，则是在部分销毁垃圾（参见佛家关于“人类起源”部分“销毁垃圾”的解释）。</p>\n<p>　　职业性杀害其它生物。主要指餐饮行业的屠宰工等情况。首先可以肯定的是，这类杀生由于没有多少恶意，造成的业债不多。其中，又分为“不得不”和“可以不”两种情况。为庄稼灭虫，就是“不得不”的；在餐厅负责杀鱼，则是“可以不”的。后者造成的业债会稍多一点。</p>\n<h3>　　其它杀生</h3>\n<p>　　其它杀生。这才是所有修佛者需要注意的部分。</p>\n<p>　　说到这儿，便想起唐僧“扫地恐伤蝼蚁命，爱惜飞蛾纱罩灯”的故事来了。如临深渊、如履薄冰，真要这样战战兢兢的，那修佛岂不是太辛苦了？</p>\n<p>　　扫地，留意一下，倒是可以做到不伤蝼蚁。但是，那地上可不止蝼蚁，还有许多很可能肉眼都看不见的其它微粒，譬如真菌和细菌。一粒沙子里就有可能藏有三千大世界，你那一扫帚下去，不知道毁了多少生灵。那么你不扫地了？</p>\n<p>　　不。地还得扫，而且你根本不需要战战兢兢的扫。修佛是堂堂正正的，放开手脚去扫吧。因为你的扫地而死亡的生灵，原本就是该那个时候死的。而什么三千大世界，你也不用管——你都还不能契合那个层次，根本就毁不了那些世界。</p>\n<p>　　有人说，我为了不杀生都改吃素了。啊哦，告诉你，植物也是有生命的。问题还远不止此。家里有了苍蝇、蚊子怎么办，叮人怪难受的，落在食物上还会传播细菌，打不打呢？我告诉你，修佛的人倒是不能无故杀害生灵，但是我们也不能做那种谨小慎微的君子，老是着眼于这些小事。如果走路都怕踩死蚂蚁，跳着走，活着都累，那不又是执著吗？</p>\n<p>　　我们人活着就具有维持活着的权利，所以<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的环境也得适应人的生活需求。我们不能有意伤害生灵，但是我们又不能够太拘泥于这些小事情。比如蔬菜和粮食都是有生命的，我们也不能因为它有生命就不吃不喝了。比如你在走路的过程当中，蚂蚁、虫子被踩死了，那它就是该死了；因为你不是有意去伤害它。生物界中或其他微生物界中同样也讲生态平衡，多了也会泛滥的。所以我们要堂堂正正修炼，大度一些。家里有了苍蝇、蚊子，我们把它轰出去，安上纱窗不让它进来。有时轰不出去，那么打死也就打死了。你是修佛的不怕，有抵抗力；你家人却不是修佛的，是常人。不能因为有蚊子，我们都得上外面找地方去住，也不能因为粮食也有生命、蔬菜也有生命，我们就把脖子扎起来，不吃也不喝了。我们应该摆正这个关系，堂堂正正地修佛，不要刻意伤害生灵就行了。</p>\n<h2>必备条件</h2>\n<p>　　杀人必须具备三个条件：一、知是人，二、预谋而有杀念，三、杀死；否则，叫做伤害或过失，不成杀人罪。至于人，是不论年龄、贵贱，不论成形或未成形，有知或无知，凡被肯定是人者，皆不可杀。所以，不得<a href=\"/rmgjc/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>，也不得以安乐死的名目来处理自己求死或已无<a href=\"/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a><a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>的植物人；否则，就是杀人罪。此点请参考《正信的佛教》和《人生》第三十六期的社论。</p>\n<p>　　迄目前为止，医疗界呼人体器官的捐赠和移赠，比如眼角膜、肾脏以及其他脏器的捐赠，是将没有使用能力的人体，局部令其复活，这是值得鼓励的事。如果在生前捐赠，当然已经获得捐赠人的同意，然在死后移植，也必须预先取得死亡者生前的首肯，否则亡者对于遗体尚有一分贪恋和执着，便会引起他的恨及怨怒，甚至影响他的<a href=\"/rmgjc/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>善道或往生<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>的去向。</p>\n<p>　　自然死亡的人，通常于十二小时之内，神识未离，尚有部分知觉。从医学上判断已经死亡的人，从佛学的观点看，未必就已真正死亡；但如果立下遗言，捐赠器官，为了挽救另一人或数人的生命，这是舍身救人的菩萨行为，因此，若生前确立有遗愿，移植人体器官当不成问题。</p>\n<p>　　在我们的日常生活中，为了维持环境卫生的原因，必须处理蟑螂、苍蝇、蚂蚁、蚊子，乃至于老鼠等问题，这在佛世已有成例。当比丘们的浴室、浴池由于多日未用，满生小虫，负责清理的比丘，不知如何处理，佛说∶「除尽污水，清洁浴室。」比丘说∶「会伤虫！」佛说∶「不为伤虫，是为清理浴室。」于是比丘释然。这个例子是说为了维护人类生活环境的卫生，予以清理打扫，目的不为杀伤虫类，因此，不算杀死。当然，不得用药物喷射杀虫，只能以打扫、清理、消毒的方式来防治或退治虫蚁的进入和繁殖。如果环境经常保持整齐、清洁和消毒完善的状态，纵然有虫蚁，也不会太多。</p>\n<p>　　如果在耕种时，难免会伤及虫蚁，但为了我们自身的活命，不用说耕种，就是日常行走及其他劳务，也会无意杀死虫蚁。所以，只有经常多念阿弥陀佛，愿愚痴而无知的众生，于死亡之后，转生善道或超生净土，不算犯杀生戒。当然，能够小心防止，减少杀伤虫蚁的机会，是慈悲的表现。如果明知杀生而心无悔意，便是没有慈悲心。</p>\n<p>　　至于毒蛇、猛兽，以及毒虫之类，是他们过去世的业力使然，他们伤人，不出于预谋，虽有恶行，没有恶心，所以，并不算造杀业，应受到人类的同情和保护。以今<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>类的社会而言，不仅可以防治受其伤害，也可以划出特定的空间范围，令其生存，或做到限制他们的繁殖，不令其成为人类的灾害。此所谓宜用防治法，不宜用歼灭法，不仅培养了人类的仁慈心，也对大自然的生态尽了维护的责任。</p>\n</div>"
    }
]