[
    {
        "title": "【摄心】-摄心是什么意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>摄心（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　摄心：摄散乱之心于一也。遗教经曰：“常当摄心在心。”</p>\n<p>　　摄心，亦即收摄自己的心念，不使它忘失或散乱，也就是把心从过去境及未来境中收回来，只缘现前境之后，进一步将现前境的范围缩小，对于现前环境里所发生的种种状况，虽然可能都看得到、听得到，但是不要被它们所影响而生起情绪反应。</p>\n<p>　　如果时时刻刻摄心、分分秒秒平静，轻松<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>地欣赏、享受<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，这就是禅的<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>生活，也是非常踏实、充实的生活，不会有挑剔、怨恨、误解、猜测、怀疑、不满等等烦恼心出现，生活也因而有条理、有规律、有趣味。（摘录自：<a href=\"/fjrw/hcrw/shengyanfashi/\" class=\"keylink\" target=\"_blank\">圣严法师</a>《圣严法师教默照禅》）</p>\n<h2>什么是摄心<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>？</h2>\n<p>　　至于念佛，心难归一。当摄心切念，自能归一。摄心之法，莫先于至诚恳切。心不至诚，欲摄莫由。既至诚已，犹未钝一，当摄耳谛听。无论出声默念，皆须念从心起，声从口出，音从耳入。（默念虽不动口，然意地之中，亦仍有口念之相，）心口念得清清楚楚，耳根听得清清楚楚，如是摄心，<a href=\"/rmgjc/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>自息矣。如或犹涌妄波，即用十念记数，则全心力量，施于一声佛号虽欲起妄，力不暇及。此摄心念佛之究竟妙法，在昔宏<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>者，尚未谈及。以人根尚利，不须如此，便能归一故耳。（印光）以心难制伏，方识此法之妙。盖屡试屡验，非率尔臆说。愿与天下后世钝根者共之，令万修万人去耳。所谓十念记数者，当念佛时，从一句至十句，须念得分明，仍须记得分明。至十句已，又须从一句至十句念，不可二十三十。<a href=\"/rmgjc/suinian.html\" class=\"keylink\" target=\"_blank\">随念</a>随记，不可掐珠，唯凭心记，若十句直记为难，或分为两气，则从一至五，从六至十。若又费力，当从一至三，从四至六，从七至十，作三气念。念得清楚，记得清楚，听得清楚，妄念无处著脚，一心不乱，久当自得耳。须知此之十念，与晨朝十念，摄妄则同，用功大异。晨朝十念，仅一口气为一念。不论佛数多少。此以一句佛为一念。彼唯晨朝十念则可，若二十三十，则伤气成病。此则念一句佛，心知一句。念十句佛，心知十句。从一至十，从一至十，纵日念数万，皆如是记。不但去妄，最能养神。随快随慢，了无滞碍。从朝至暮，无不相宜。较彼掐珠记数者，利益天殊。彼则身劳而神动，此则身逸而心安。但作事时，或难记数，则恳切直念。作事既了，仍复摄心记数。则憧憧往来者，朋从于专注一境之佛号中矣。大势至谓都摄六根，净念相继，得三摩地，斯为第一。利根则不须论。若吾辈之钝根，舍此十念记数之法，欲都摄六根，净念相继，大难大难。又须知此摄心念佛之法，乃即浅即深，即小即大之不思议法。但当仰信佛言，切勿以己见不及，遂生疑惑，致多劫善根，由兹中丧，不能究竟亲获实益，为哀也。掐珠念佛，唯宜行住二时。若<a href=\"/rmgjc/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>养神，由手动故，神不能安，久则受病。此十念记数，行住坐卧皆无不宜。卧时只宜默念，不可出声。若出声，一则不恭，二则伤气，切记切记。（增广文钞卷一复高邵麟<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>书四）</p>\n</div>"
    }
]