[
    {
        "title": "【寿命】-佛教对寿命的解释",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5BFF;&#x547D;&#x3011;-&#x4F5B;&#x6559;&#x5BF9;&#x5BFF;&#x547D;&#x7684;&#x89E3;&#x91CA;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022310279.jpg\" /></p>\n<h2><a href=\"/rmgjc/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a></h2>\n<p>　　所谓寿命，是指从出生经过发育、成长、成熟、老化以至死亡前机体生存的时间，通常以年龄作为衡量寿命长短的尺度。由于人与人之间的寿命有一定的差别，所以，在比较某个时期，某个地区或某个社会的人类寿命时，通常采用平均寿命。平均寿命常用来反映一个国家或一个社会的医学发展水平，它也可以表明社会的经济、文化的发达状况。</p>\n<h2>词义</h2>\n<p>　　【词目】寿命</p>\n<p>　　【读音】shòu mìng</p>\n<p>　　【释义】生存的年限。后亦比喻存在的期限或使用的期限。</p>\n<p>　　【出处】《楚辞·大招》：“永宜厥身，保寿命只。”《<a href=\"/ctwh/ershisishi/shiji/\" class=\"keylink\" target=\"_blank\">史记</a>·李斯列传》：“祷祠名山诸神，以延寿命。”唐·韩愈《欧阳生哀辞》：“寿命不齐兮人道之常，在侧与远兮非有不同。”</p>\n<p>　　【示例】《古今小说·闹阴司司马貌断狱》：“常言‘人有可延之寿，亦有可折之寿’，所以星家偏有寿命难定。”孙犁《秀露集·读&lt;蒲柳人家&gt;》：“其实是自促自己作品的寿命。”</p>\n<h2>人类寿命有多长</h2>\n<p>　　究竟人的寿命有多长？这个极具吸引力的问题一直困扰着人们。</p>\n<p>　　科学研究人员认为，目前人类的寿命正在缓步增长，而且这种增长没有界限。从前，研究者将120岁视为人类年龄的极限，几乎没有人能超越。但是，通过人的寿命正在延长这一实例可以看出，人类的寿命很可能是可以无限增长的，没有统一的上限标准。</p>\n<p>　　科学人员对瑞典过去240年中出生和死亡的情况进行分析后发现，仍然健在的老寿星年龄呈上升趋势。截至20世纪90年代，瑞典老寿星的年龄已经升到109岁。</p>\n<p>　　寿命的长短受多种因素影响。先天禀赋的强弱、后天的培养、居住状况、社会制度、经济状况、医疗卫生条件等等都会对人类的寿命产生影响。</p>\n<p>　　准确地估算出一个确定的寿命上限是不具备科学依据的。如今，人类寿命的长短正发生着改变，在生理学上寿命已经不再是一个固定的常数，但是它是否还能无限地延伸下去还有待科学研究。人类是物质文明和精神文明的缔造者，长久以来，不断地打破着生命的极限。</p>\n<h2>寿命观点</h2>\n<h3>　　性别与寿命</h3>\n<p>　　男性一般出现心脏疾病或中风的时间比女性早大约10年，在百岁老人中，女性占85%，而男性只有15%。女性在绝经期（平均为51岁）后与男性相比的这种优势趋于减弱，因此有些科学家推测雌激素在这种优势中发挥作用。另有一种学说认为是慢性缺铁（由月经导致）造成了女性的这种优势。铁是我们细胞制造导致老化的自由基的关键，这种自由基是导致心脏病、中风、老年痴呆和癌症的因素。</p>\n<h3>　　<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>与寿命</h3>\n<p>　　有趣的是，新英格兰百岁老人研究协会的数据显示婚姻（或<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中拥有伴侣）对您预期寿命的影响取决于您的性别。近100%的男性百岁老人都是已婚或晚年才失去配偶。也就是说，对于终身未婚的男性，其寿命必然会受到影响。</p>\n<h3>　　家人与寿命</h3>\n<p>　　与您的家人或亲如家人的朋友保持频繁的联系有益于帮助您舒缓压力，同时也可能延长寿命。</p>\n<p>　　良好的<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>凝聚力和与家人频繁的联系是百岁老人的一个显著特征。研究者指出与亲人关系疏远的人拥有更弱的心理承受能力和更重的社会和心理压力。心理压力可能导致疾病、多种癌症和更高的死亡率。</p>\n<h3>　　<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>与寿命</h3>\n<p>　　世界卫生组织的研究结果对各项影响健康因素的重要性做了提示：个人的健康和寿命有60%取决于自己，15%取决于遗传，10%取决于社会因素，8%取决于医疗条件，7%取决于气候的影响。这充分说明，个体的健康主要与自己做出的与健康有关的选择有关系，这也有力地印证了健康离不开健康生活方式的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。</p>\n<h3>　　压力与寿命</h3>\n<p>　　您是个幸福的人，没有压力的生活无疑会让您长寿，无论生活条件是否优越，是否感到有压力关键决定于您对生活的态度，中国人常说的“<a href=\"/rmgjc/zhizuchangle.html\" class=\"keylink\" target=\"_blank\">知足常乐</a>”就很好地说明了这一点。</p>\n<h3>　　睡眠与寿命</h3>\n<p>　　很好！您拥有适当和高质量的睡眠。适量睡眠也是健康的一个信号。</p>\n<h3>　　教育与寿命</h3>\n<p>　　您的受教育程度也很大程度上对您的长寿有重要贡献。受教育程度与寿命之间的确已被证明有紧密的联系，这其中潜在的原因包括更好的社会地位、更健康的生活习惯以及更好的医疗保障发挥的作用，同时也与大脑功能更好的发掘有关，后者同时也可以通过阅读知识书籍和脑力活动如脑筋急转弯、学习外语或者学习演奏乐器等得到提高。</p>\n<h3>　　工作与寿命</h3>\n<p>　　最近一个日本的工作时间与心脏病之间关系的研究显示出一个有趣的结果，一天工作少于7小时的人群也处在心脏病的高风险中。如果您最近的工作负量很合适的话，不妨好好利用起闲暇的时间参与一些健康积极的活动，将对您有好处，并继续干这个好工作吧！</p>\n<h3>　　空气与寿命</h3>\n<p>　　呼~深呼吸一口清新的空气吧！生活在一个无烟、洁净的环境中是一件令人愉悦并能显著延长寿命的事。</p>\n<h3>　　汽车与寿命</h3>\n<p>　　您也许知道关于在车祸中幸存的事件中使用了安全带与没有使用的情况的数据统计。即使有了安全气囊，使用安全带仍显著使您在车祸中最大程度减轻受伤或幸免于难。一定要坚持使用您的安全带啊！</p>\n<h3>　　饮茶与寿命</h3>\n<p>　　日常饮茶是一种能实实在在延长寿命的健康习惯。茶里所含的抗氧化剂会减小心脏病与癌症的发生几率。茶里含有一种强效的抗氧化剂——茶多酚。然而绿茶是否比红茶含有更多可以被人体吸收的茶多酚仍然具有争议，但不管怎样，饮茶不会有错。</p>\n<h3>　　吸烟与寿命</h3>\n<p>　　二手烟的吸入：尽全力避免二手烟的危害吧。如果您和您的爱人或其他人住在一起，就鼓励他们戒烟吧——就算不是为了他们着想也该想想他们的家人和周围的朋友。避开二手烟是非常重要的习惯，因为二手烟比吸烟者吸食的过滤烟更具有毒害性，仅仅一点剂量就会对肺部乃至全身有毒。</p>\n<h3>　　饮酒与寿命</h3>\n<p>　　酒精的摄取：有足够的证据说明有节制的适量饮酒是有好处的。有的人由于医学或其他原因无法忍受沾哪怕是一丁点的酒精饮料。如果您喜欢在晚餐时佐一点酒，那么它同时也是对您有好处的。节制的饮酒还可以降低心脏病风险。</p>\n<h3>　　药物与寿命</h3>\n<p>　　人们已经注意到，每日81毫克的阿司匹林可以显著降低患心脏病的风险，这种功效可能得益于阿司匹林中含有的抗血液凝固物质。</p>\n<h3>　　防晒与寿命</h3>\n<p>　　日晒和肌肤加速老化之间的关系很明确。阳光中的紫外线直接破坏DNA，越多的日晒意味着越多的皱纹，同时也意味着更高的致命皮肤癌风险。过多的日晒大体上同时对身体也有毒害作用。</p>\n<h3>　　性爱与寿命</h3>\n<p>　　由高危性行为传播的病毒，如HIV病毒，不仅导致艾滋病，同时还导致包括淋巴瘤在内的多种癌症。这类病毒改变DNA，并因此可能导致衰老。您有一个固定的性伴侣，这对于健康是很重要的，固定的性伴侣不仅能预防性传播性疾病，还非常有益于身心健康。</p>\n<h3>　　刷牙与寿命</h3>\n<p>　　口腔清洁：坚持注意清洁牙齿，每天两次刷牙！不仅仅因为它能使您拥有更长久的接吻，还能让您的心脏更健康。最近的科学研究证据表明，慢性牙龈问题可以出现牙斑，将形成的某些炎症、有毒物质和某些特定微生物被释放进血流，并最终导致心脏病。这一过程同时可能增加中风和器官功能衰退的风险。</p>\n<h3>　　排便与寿命</h3>\n<p>　　排便：最少两天一次的排便可能降低结肠癌发生的风险。</p>\n<p>　　坚持“肠运动”间隔不超过20小时似乎能降低结肠癌的发病率，原因可能是运动肠子可以减少肠内壁与食物中的致癌物质接触的时间。</p>\n<h3>　　血压与寿命</h3>\n<p>　　收缩压：您拥有正常的收缩压。锻炼，合理的压力控制以及减轻体重（如果您超重的话）可能会更进一步降低收缩压。越接近100至110越好。血压由两种力量组成。第一种是有心脏收缩将血液送至动脉再经整个血液循环系统，这被称为收缩压。第二种是动脉压迫血流时产生的压力，这被称为舒张压。</p>\n<p>　　收缩压超过140便被认为偏高，这意味着您处在心脏病和中风的高风险种。这种风险则与血压成正比。</p>\n<p>　　舒张压小于85说明您拥有很好的舒张压。百岁老人普遍在生命中的大部分时间内拥有这个范围内的舒张压。</p>\n<h3>　　体检与寿命</h3>\n<p>　　医疗检查：定期的体检是很重要的。您所需要的体检频率依据您的年龄和您所拥有的其他医学或临床相关问题所决定。通常，任何40岁及以上的人需要每年一次体检。完善的检测和预防是长寿和健康的关键。</p>\n<h3>　　吃肉与寿命</h3>\n<p>　　少吃快餐，包括油炸食物和汉堡宝这些高热量和高脂肪的食品。它们增加您的体重，同时增加您心脏病，中风，甚至癌症的风险。</p>\n<h3>　　烧烤与寿命</h3>\n<p>　　避免烧烤有助于为您避免因以过高温度烹饪肉和鱼类所产生的致癌物质。烧烤很美味，但并不利于健康，不仅易产生致癌物质，还会破坏一些营养素。</p>\n<h3>　　补钙与寿命</h3>\n<p>　　晚年适量摄取钙可以延缓骨质随着年龄增加的流失。除了奶制品，加钙的饮品、面包、谷物都是很好的摄取来源，一些非处方补钙药物也都是不错的选择。</p>\n<h3>　　甜食与寿命</h3>\n<p>　　甜食的摄取：甜食的存在对于我们始终是一种诱惑。世界卫生组织（WHO）曾调查了23个国家人口的死亡原因，得出结论：嗜糖之害甚于吸烟，长期食用含糖量高的食物会使人的寿命明显缩短。</p>\n<h3>　　肥胖与寿命</h3>\n<p>　　肥胖是低效率的能量制造和细胞中不断增加的氧自由基所导致。这无疑是增加了癌症，心脏病，加速老化的风险。当然，还有可能导致糖尿病。</p>\n<h3>　　补铁与寿命</h3>\n<p>　　铁的摄取：如果可以的话，远离铁来源和含铁丰富的食物——尤其是红色肉类——是一个明智的选择。越来越多的动物和人体研究证据表明铁可以导致老化以及老化引起的疾病。</p>\n<h3>　　运动与寿命</h3>\n<p>　　运动习惯：一周至少抽时间做三次运动（每次30分钟以上）是很重要的。别忘了平衡有氧运动和力量训练。两者都很重要。高负荷的健身和高对抗性的运动，则应避免。</p>\n<h3>　　病史与寿命</h3>\n<p>　　在您的家庭中没有关于心脏病、癌症或者糖尿病的病史，要好好的珍惜基因给予的优势。</p>\n<p>　　研究表明，长寿基因也是会遗传的。如果您的先辈、父亲和母亲在80岁后活的很好。这可能意味着您的家族遗传长寿，如果她在90岁高龄或者更老的时候还很健康，那么这一点更加明显。</p>\n</div>"
    }
]