[
    {
        "title": "【疏文】-道教疏文怎么写？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a></h2>\n<p>　　从狭义来讲，疏文是各种法会、<a href=\"/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>之上，凡人祈求于神仙的文函，是沟通仙凡之间的桥梁。</p>\n<h2>疏文介绍</h2>\n<p>　　从广义来讲，凡是敬奉神佛、祭祀天地、先祖的文函都属于疏文，是沟通天地、仙凡、阴阳之间的桥梁，是供奉神佛、敬天法祖的正式文告。</p>\n<p>　　“疏文”一词，亦有称之为“文疏”、“表文”、“天地疏文”等。疏文可细分为“章表”、“祝文”、“祝章”、“哀章”、“表文”、“吊词”等等。正式的疏文格式，一般都是法师自用秘藏不传，祈望大家皆能借助各种专用疏文开运转运、祈福求财、请神送佛！</p>\n<p>　　疏文是以文字形成的章表文函，是沟通仙凡之间的桥梁，不论个人所求， 还是国家大事都可为之。从疏文类型可分为两个大的部分，即阳事与阴事道场。 疏文的书写格式、文字编排都有严格的规范要求，其内容语言也比较严谨。 更要注意写清神仙的宫阙与其圣号，必须相称。一般疏文在神仙的圣诞日都要祝寿庆贺，上章拜表，或黄道吉庆日为善信做祈福等斋醮活动。</p>\n<h2>源于道教</h2>\n<p>　　疏文起源于道教，最早只在道教使用。简单地说：疏文就是凡人祈求于神仙的文函，它的功用与人之间交往的书信类似；疏文是祈福神灵，敬天祭祖语言信息的表达形式，是人们将自己所求的事由，通过叩拜，存思天神恩佑；书之于纸，彻于琅函，焚化后由神职司四值（年月日时）功曹，飞云捧送天尊，再上达天庭，架起仙凡之间的桥梁，从而沟通人与神所表达的愿望，来实现人们所祈求的目的。</p>\n<p>　　道教疏文最早应用渊源于古代“天子祭天地，或祭五岳四渎”。东汉祖天师将祭天、地、水的祭祀仪式最初的范本《三官手书》继承应用。《三官手书》内容要求在上元节（正月十五），将所求“<a href=\"/rmgjc/qiyuan.html\" class=\"keylink\" target=\"_blank\">祈愿</a>”写成文函，再经过焚化，意存上天到天官那里，以求天官赐福。在中元节（七月十五），将“消罪”事写成文函， 再经过焚化埋于山上，存想到达“地官”宫殿处，以赦其一切罪业（罪过）。在下元节（十月十五），将释冤事写成文函，再经过焚化投于水中，以求水官除一切灾难厄劫。因为天、地、水三官主宰人间、阴间之祸福，故将疏文呈递三官的宫殿“三元妙纬宫”与“三元都会府”。</p>\n<h2>升疏上表</h2>\n<p>　　升疏与上表，又名打表升疏，乃是道（佛）教专有法事，是简单快捷，直接传奏心灵信息的祈祷方式。升疏（表）即是通过把心愿录于疏（表）文，在神前燃升，达于各宫神明，以求愿望达成，齐家获福。打表升疏法事，如开启宝库之钥匙，简单快捷，直接传递心灵信息。升疏（表）者先把心愿录于黄（红）表纸，在佛前燃升，以达旨意。可立显道（佛）法之匡扶，得法事以周隆。</p>\n<p>　　打表升疏分吉祥疏（表）和<a href=\"/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>疏（表）两种。吉祥表：请福延生，消灾免难。祈求诸事顺达，财源广进，学业、事业有成。必得神明保佑，所求如愿。超度表：超阴度亡，解冤拔罪。祈求先人亡灵离苦得乐，超生人天。</p>\n<p>　　上表升疏是向神佛陈情之章奏，需严肃慎重。凡升疏（表）者，需在疏（表）文中明确自己的住址、姓名、生辰及所求之事。代别人升表者，可以写当事人名，也可以写委托人名。，凡打表升疏者，请在神佛前先上三柱香，洗心涤滤，宣读疏（表）文完毕，入焚化炉。待疏（表）燃尽后三拜，定得吉祥如意，神明护佑！</p>\n<h2>疏文种类</h2>\n<p>　　升疏上表乃是道（佛）教各种法事必务的一道手续。各种法事皆有专用的疏文。疏文的种类可以分飞道教疏文（表）、<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>疏文（表）。</p>\n<p>　　疏文的种类可以分飞吉祥疏（表）和超度疏（表）两种。吉祥疏表：请福延生，消灾免难。祈求诸事顺达，财源广进，学业、事业有成。必得神明保佑，所求如愿。超度疏表：超阴度亡，解冤拔罪。祈求先人亡灵离苦得乐，超生人天。</p>\n<p>　　常用的疏文。不管是道教还是佛教，每一种法事都使用疏（表）文，因此疏（表）文的种类繁多。较常用疏（表）文主要有三大类：</p>\n<p>　　1、迎神请神专用疏文。比如接<a href=\"/rmgjc/caishen.html\" class=\"keylink\" target=\"_blank\">财神</a>专用疏文，神佛祝寿疏文等等。</p>\n<p>　　2、祈福疏文。比如植福祈嗣佛七文疏，礼念<a href=\"/fjgs/gygs/243621.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>求子疏文等等。</p>\n<p>　　3、超度疏文。比如荐亡生西佛七文疏、立亡魂房契(坟契)文疏等等。</p>\n<h2>使用方法</h2>\n<p>　　当您拜神明或祭祖之时，若能够事先慎重的备妥一份合乎格式规范的疏文，把自己想表达的事情写清楚，在祭拜时朗诵出来，再随着纸钱一起焚化呈送，以示恭敬。用疏文来请神求佛、祭拜祖先，可起到事半功倍的效果。</p>\n<h3>　　疏文的使用方法：</h3>\n<p>　　1、不同法事需用不同的疏文，不可混用；</p>\n<p>　　2、疏文制作完成后，必须盖印，押上日期、宫号、姓名等并经法师开光；</p>\n<p>　　3、疏文于法事时同供品等放置于供桌上。请神后，取出朗诵全文；</p>\n<p>　　4、朗诵后于焚化纸钱时随同焚化；</p>\n<p>　　5、部分庙宇将疏文置于封套之内焚化，焚化即可。如果没有使用封套，单独疏文焚化，必须从“文首”先开始焚化；</p>\n<p>　　6、污损的疏文不可使用。</p>\n<h3>　　如何请疏文</h3>\n<p>　　正式的疏文格式，一般都是法师自用秘藏不传，社会大众很难获取疏文。祈望大家皆能借助各种专用疏文开运转运、祈福求财、请神送佛！</p>\n</div>"
    }
]