[
    {
        "title": "数息观",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x6570;&#x606F;&#x89C2;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022222398.jpg\" /></p>\n<h2>数息观（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　数息观在印度话是安那般那，为<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>所教导<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a><a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>法的门之一，由于此观法对治散和不净观（对治贪欲）一样很有力，所以被称为“二<a href=\"/rmgjc/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>门” 这两个甘露之门可以让我们获得禅定，同时，<a href=\"/rmgjc/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>的思维可以获得无漏的智慧，所以称为甘露门。它也是我们汉传佛教修行人修定的基本法门。</p>\n<h2>名词详解</h2>\n<p>　　（杂语）五停心观之一。数出入之息，停止心想散乱之观法。梵名，阿那波那。</p>\n<p>　　又云：阿那般那观、安那般那念、念安般、安般守意。意译为念入出息、念无所起、息念观、持息念。简称安般、数息。乃五停心观之一，八念之一，十念之一。即计数入息或出息次数，以收摄心于一境，使身、心止息。此为除散乱，趋入正定之修法。</p>\n<p>　　又将数息观细分，有算数修习、悟入诸蕴修习、悟入缘起修习、悟入圣谛修习、十六胜行修习等五类。</p>\n<p>　　[杂阿含经卷二九、修行道地经卷五、大安般守意经卷下、俱舍论卷二二、<a href=\"https://www.guang5.com/fojing/yujiashidilun/\" class=\"keylink\" target=\"_blank\">瑜伽师地论</a>二七]</p>\n<p>　　梵语 a^na^pa^na-smr!ti。又作阿那般那观、安那般那念、念安般、安般守意。意译作念入出息、念无所起、息念观、持息念。简称安般、数息。乃五停心观之一，八念之一，十念之一。即计数入息或出息之次数，以收摄心于一境，使身、心止息。此为除散乱、入正定之修法。梵语 a^na，原为遣来之意，转指入息；apa^na，原为遣去之意，转指出息。亦即先入息、后出息之调息（呼吸）法。然亦有主张“先出息、后入息”之方式，而意译为“念出入息”者。又若将数息观细分，则有算数修习、悟入诸蕴修习、悟入缘起修习、悟入圣谛修习、十六胜行修习等五类。（杂阿含经卷二十九、修行道地经卷五、大安般守意经卷下、俱舍论卷二十二、瑜伽师地论卷二十七）</p>\n<p>　　禅定的修持方法之一。指计算出息（呼气）或入息（吸气）之次数，令心摄于一境，以对治散乱的修持法。为五停心观之一、八念之一、十念之一，与‘不净观’同为初心入道的修法。音译阿那般那观、安那般那念、阿那波那、安般守意、安般念、安般；又称念出入息、念无所起、息念观、持息念、息念、数息。《俱舍论颂疏论本》卷二十二云（大正41·942a）︰‘经言阿那阿波那念。阿那者，此云遣来，谓持息入，是引外风令入身义；阿波那者，此云遣去，谓持息出，是引内风令出身义。’《杂阿含经》卷二十九云（大正2·206a）︰‘尔时<a href=\"/rmgjc/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>告诸<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，（中略）若比丘修习安那般那念，多修习者得身心止息、有觉有观、寂灭纯一明分想，修习满足。</p>\n<h2>修行方法</h2>\n<p>　　首先开始调身、调息、调心，这三条是一致的。</p>\n<p>　　我们先调身。先端身正坐，正坐就是半跏趺或双跏趺坐。如果是半跏趺坐，把左脚放到右脚上，拉近身体就可以了。如果有人要用双跏趺坐的话呢，也可以，如果你的单跏趺，可以盘半个小时的话呢，你可以上双跏趺。在单跏趺的基础上把右腿从下面拉上来。接着就是正手，就是左手放在右手上重叠起来，放在小腹之前。</p>\n<p>　　次正头。平面正坐，头要不偏、不斜、不低、不昂。不要太昂，也不要太低。然后闭口，唇齿相拄，舌向上腭。接着就是闭眼睛。眼睛微微闭上。有的人喜欢半睁半闭也行。这样就是调身。保持身体的不宽不急。</p>\n<p>　　接着就是调息。息有四相：风、喘、气、息。什么是风相呢？就是坐的时候，鼻中气息出入觉得有声音。这就是风相，这是不调的，这个是不正确的。喘相，就是在坐的时候，息虽然没有声音，但是它被节制了、不畅快，叫做喘相。第三种情况就是气相。气相，在坐的时候，这个息虽然没有声音，而且出入也不节制，但是不够细。</p>\n<p>　　风、喘、气这三种情况都是不调相。第四种，息相，是调相。什么是息相呢？呼吸既没有声音，而且很通畅，不节制，而且很细、不粗，出入绵绵，若存若亡，这个情况就是息相。</p>\n<p>　　在数息时达到息调相才能入定，守息则定。前面的不调相时，你要是呼吸声音很大，那么数息时会“观风则散”，你的心则定不下来；“观喘则结”，“观气则劳”，这个气要是很粗的话，还不能观，只能数。到了这个息相现前的时候才能够守息，守息就能得定。</p>\n<p>　　我先把调息的这四种情况给大家讲了一遍。现在身调好了，怎么去调息呢？热气起心，当我们的心很细的时候，这个息也就细了。息调好后，众犯不生，息心亦定。</p>\n<p>　　调的方法有三种：一个是安心，就是将你的注意力先放在肚脐下面二指，在腹部的中间，就是肚脐稍微下一点，先把心安在这个地方。接着全身放松，放宽胸心，然后观想，气息遍入毛孔，出入无障。</p>\n<p>　　这三种情况做好后，你不要着急，气息自然慢慢地就调匀了，你的呼吸就很自然了。</p>\n<p>　　这个呼吸一定是很自然的，不要去控制呼吸，调的方法就是把注意力放在丹田的部位，把身体放松，全身心放松；当然也不能太松，太松容易瞌睡。</p>\n<p>　　身体不能垮下来，要自然挺起，然后观想气从遍身的毛孔出入无障，你的呼吸就像毛孔在呼吸一样，只是“就像”，这是“像这样”，这是你的“观想”。这样你的心就会渐渐细下来，这就是调息。</p>\n<p>　　调身和调息、调心是一致的，在讲话中稍微有一点次第，但其实是一致的，是同时的。我们调心时，这个心要宽急得所，不要太放松，心要是太放松的话，容易昏沉。如果心的念力太精进的话，容易紧张。心既不要太紧张，也不要太松懈、不要太<a href=\"/rmgjc/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。心要不宽不急，这是心调相。</p>\n</div>"
    }
]