[
    {
        "title": "【算命】-算命的意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x7B97;&#x547D;&#x3011;-&#x7B97;&#x547D;&#x7684;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022245555.jpg\" /></p>\n<h2><a href=\"/rmgjc/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>（推测人<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>休咎之行为）</h2>\n<p>　　算命，是推测人命运休咎之行为，属玄学范畴。研究算命的学术叫易学，也叫命理术数。其理论核心是阴阳五行、天干地支及八卦易经，理论系统较为复杂深奥。狭义的算命即是对人生辰八字（四柱八字）的预测，广义的算命则包含紫微斗数、面相手相、八卦六爻、奇门遁甲、六柱预测学等等。古代的占卜、青乌术、筮法，均属于算命。</p>\n<h2>简介</h2>\n<h3>　　应用意义</h3>\n<p>　　占测这门类玄学在中国历史上源远流长，其起源有据可考可追溯到最早的伏羲氏，之后周文王演八卦，则算命开始逐步得以发展，具体的发展过程比较漫长，每一代都有或多或少的贡献。算命只是人们趋吉避凶的一种心理安慰，命运是不可预知且时刻存在变数，人的命运掌握在自己手中，民间多用于各类未来事占测，它是一种与科学技术无法预测时一种辅助手段，若没有实际行动一切都是枉然，不可痴迷其中。</p>\n<h3>　　原理解析</h3>\n<p>　　算命是一门略带神秘的玄学，以《易经》为根基、以阴阳五行体系为理论依据的学问，算命虽不是<a href=\"/rmgjc/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>，但亦没有如有些江湖术士所吹嘘的那么神乎其神。不要认为算命什么都可以算得准，其实算命术没那么神奇，也不要因某些测不准就全盘否定这门学问，对算命这门学问要用科学的态度去看待。预测，是根据已知的某些条件去找出该事物的规律，并依据其规律去推算事物的发展趋势。万事万物之中，既存在“定数”（规律）又存在“变数”（无规律），预测某一事物其“定数”的一面是可以测出来的，而其“变数”是无法预测的，为什么“变数”一面无法预测？了解过“蝴蝶效应”定律便不难理解。既有定数又有变数，此乃天地之道，人禀命于天，其理亦然。</p>\n<p>　　各门类学问之理论源泉是《易经》，何为《易》？一是变易，一种混沌现象，一个微小的变化能影响事物的发展（蝴蝶效应）；宇宙万物，变幻无常，时刻变化，人事也是如此。二是简易，一阴一阳，囊括了万种事物之理；有天就有地，有男就有女，有上就有下，有前就有后，都是相反相成，对立统一。三是不易，虽<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的事物错综复杂，变化多端，但是有一样东西永远不变的，那就是规律；天地运行，四季轮换，寒暑交替，冬寒夏热，月盈则亏，日午则偏，物极必反，这便是规律。《<a href=\"/ctwh/sishuwujing/zhouyi/\" class=\"keylink\" target=\"_blank\">周易</a>[1]  》起源于伏羲八卦，伏羲八卦又源于“河图洛书”。《易·系辞上》说：“河出图，洛出书，<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>则之。”从河图洛书到八卦符号再到解释八卦的卦爻辞，可以看出中国文化的发展走向，是取法自然又以人们的经验充实其中的一种思维方法。</p>\n<p>　　万事万物的发展均有定数与变数，定数有规律可循而变数无规律可循；定数中含有变数，变数中又含有定数，无论定数还是变数其大局均不变。古今来多数习易者未区分开定数与变数，混淆这概念。“定数”（规律）可根据事物的规律性预测其发展轨迹，“变数”（无规律）因变幻无常、可变因素太多无法准确预测。</p>\n<p>　　万事万物虽错综复杂、变化多端，但亦有永恒不变的规律，既然存在有规律的一面，那么依据这些事物某些已知的因素结合易理即可推算出其发展轨迹及趋势。</p>\n<p>　　如四柱八字为例，影响人命运的诸多因素中主要有：八字、<a href=\"/rmgjc/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>、社会环境、时代背景、人的主观<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>等等因素。相同四柱八字的人，其风水、社会环境、时代背景、主观意识不同而命运也不相同。测算四柱八字只是测算影响人命运的诸多因素中先天定数因素，从这定数中可反映出其人生命运轨迹主线，这仅仅是命运轨迹主线，并不是命运的全部。所以，就算完全测对了四柱八字也不能完全准确预知其人的具体命运，因四柱八字只是影响人命运的其中主要因素之一，还有其它诸多变化无常的变数因素对人的命运存在影响。在求测时那些术士很肯定地告诉你某些很具体的某事会怎样怎样的，那是忽悠你的。看过天气预报吧，现代科技这么发达，用先进的科技手段尚不能准确无误的测出某月某日具体某个地方会下雨，因为风云无时无刻在变化着，播报天气预报时也只是能告诉你某月某日局部地区会有雨（局部地区，这个范围可大可小），况且预报有雨但实际上这雨是否会下可不一定，在预测上有下雨迹象只能说明会下雨的可能性很大而已，也会有不下的情况。</p>\n<p>　　认清这些后便不难理解为什么同年同月同日同时辰出生的人（如双胞胎）而命运不太相同以及有时测事测不准的原因了，因为有变数的因素。此外预测理论体系的不完善也决定了预测的准确率。当然，测不准的原因除了这些客观因素外还有预测者的水平原因，由于知识面及认知能力的局限，社会上真正懂的没多少，似懂非懂的居多。</p>\n<h2>种类</h2>\n<h3>　　四柱八字</h3>\n<p>　　<strong>应用</strong></p>\n<p>　　四柱八字亦称“子平术”，应用是用来推测人命运之休咎。从历法查出的天干地支八个字，用天地天干地支表示人出生的年、月、日、时，合起来是八个字。根据干支历法、阴阳五行等理论推测人的事业、<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>、财运、学业、<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>等的学问。</p>\n<p>　　四柱八字的主要概念是命，或称命局。简而言之，一个人出生的年月时天干地支的排列组合（即八字）就是命。但是仅凭八个天干地支，没法推算贵、贱、吉、凶。于是和阴阳五行纳配，使天干地支具有了阴阳五行的属性，具备了相生、相克的关系。并且衍生出刑、冲、害、合等多种关系。</p>\n<p>　　利用天干和地支来准确记录年、月、日、时的方式，由“年干，年支”、“月干，月支”、“日干，日支”、“时干，时支”，共八个干支所组成（共八个字），年、月、日、时的干支组合称为“柱”，形成“年柱”、“月柱始于唐朝时期，初以年柱为主体，以生年干为本命，辅以纳音法推命。唐代的李虚中改以年为主，取年、月、日、时四柱推命。五代的徐子平改以日干为我（日主），查四柱间之五行生克制化、刑冲会合为推命重点，并发扬光大。由“年干，年支”、“月干，月支”、“日干，日支”、“时干，时支”，共八个干支所组成（正好八个字）。每一个组合称为“柱”，形成“年柱”、“月柱”、“日柱”、“时柱”，故八字又称为“四柱”或“四柱八字”。以日干为我（日主，命主），查四柱间的五行生克制化、刑冲会合为推命的重点。</p>\n<p>　　<strong>渊流</strong></p>\n<p>　　唐宋以来在上层社会中的那种把论命做为雅谈的风气至明朝有增无减。诚如明人宋濂在 《禄命辩》中所说的\"近世大儒于禄命家无不嗜谈而乐道者\"。以至于达到了\"士大夫人人能讲，日日去讲，又有大谈他人命者……\"的程度，各种命理学著作也大量付梓、充斥书肆，这使得时人有了\"自学成才\"的入门途径，所以交流研讨命理，往往成为士大夫们茶余饭后继琴棋书画的又一文雅的消遣。另外，自唐宋以来到明朝命理学热潮由上层社会下移到民间的势头更猛，使得举朝皆迷命理的浓厚民风。染化得平民百姓皆谙命学并成了一代风尚。</p>\n<p>　　据载，权贵孟无忌单马出巡，在江汉边遇到一个渔夫，提着一条大鱼让路于左，孟无忌问他年庚，不料生辰八字完全与自己相同，遂十分惊异，想邀请渔夫一同回去给他一个官做。渔夫谢绝道，我虽然和您年庚相同，但您生在陆地，所以命贵，我生在船中，水上漂浮，所以命贱，我每天以渔为生计也自足了，若一旦富贵，命薄之人反而会不胜福份而暴死，说罢辞谢而去。一个朝廷重臣，一个江野渔人，但对命理精蕴的理解不分仲伯。这一特殊社会文化现象，使得我国封建社会晚期的算命习俗别俱特色。</p>\n<p>　　<strong>去伪存真</strong></p>\n<p>　　由于明清以来我国命学热潮波及了上至帝王将相下至黎民百姓，而命学各流派，门户也繁杂泛滥，这就势必形成泥沙俱下，鱼龙混杂的状况，有的术士对命学精典体会不深，持论有悖命理精蕴；有的根本就不在命理上下功夫，而用哗众取宠。没有来头的花拳绣腿炫人耳目，混迹江湖；有的机械套用命诀格局，将变化无穷的命理编排成死格式而对号入座（当今的电脑算命及软件算命），以致无法自圆其说；有的以上诸种情况兼而有之，根本没有准确率可谈。</p>\n<p>　　更有甚者，有的人把预测机理稍加改头换面便自称是自己的发明创造，从古人的故纸堆扒拉出来的东西也纷纷付梓，即时国内易坛上真是即纷呈异彩又乌烟瘴气。所以在这轰轰烈烈的看命热潮中又潜伏着一种\"学术不精则信者必寡\"的<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>危机，命学要想巩固和提高自己的社会地位，进一步取得自身的发展，对命理文化就必须进行一番\"去劣取精，去伪存真\"的系统的整理工作、这项工作从明朝初年即已开始。</p>\n<p>　　<strong>技法</strong></p>\n<p>　　八字，也叫四柱，是从历法查出的天干地支八个字，用天地天干地支表示人出生的年、月、日、时，合起来是八个字。八字（八字命理，八字命理学）是按阴阳五行法则推命的一种命理学。</p>\n<p>　　八字算命术的主要概念是命，或称命局。简而言之，一个人出生的年月时天干地支的排列组合（即八字）就是命。但是仅凭八个天干地支，没法推算贵、贱、吉、凶。于是和阴阳五行纳配，使天干地支具有了阴阳五行的属性，具备了相生、相克的关系。并且衍生出刑、冲、害、合等多种关系。此外还与四时五方、昼夜阴晴等因素相结合，拼凑成一个算命体系。生克关系又代称为正印、偏印，伤官、食神，正官、偏官，正财、偏财，比肩、劫财十种，统称“十神”。</p>\n<p>　　<strong>八字算命与科学</strong></p>\n<p>　　四柱预测是我国人民聪明智慧的结晶，它是经过几千年风风雨雨、大浪淘沙和历史无数预测学家不断努力反复实践总结出来的宝贵经验。古今中外大量实践证明：四柱预测不仅具有独特神奇的超前预测、超前反映的功能，而且有着极其深奥的科学理论和极为宝贵的使用价值，以其强大的生命力和科学性流传至今，为国内外众多学者所重视。</p>\n<p>　　因此，四柱预测学是科学，不是什么“封建迷信”，是辩证的唯物主义，不是“<a href=\"/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>主义”。有人说，自己的命运自己掌握。本质上看，这话是对的，但必须以预知自己命运如何为前提。若不知道自己的命运如何，却要掌握自己的命运，那只是一句空话，是自欺欺人；预测的本质是以阴阳变化为原理、以五行生克制化为法则，以人的出生时间为依据而进行命运预测的，是教人趋吉避凶的一门学科。</p>\n<h3>　　六柱预测</h3>\n<p>　　六柱预测学是由湖南省龙山县善于发明创造的学者型大师发明出来的新算命术，近十年发明创造出几十部著作，六柱预测学是其中之一，作品六柱预测学于2006年面世的。算命有很多种类，但在众多种类里，四柱八字算命的影响最大，几乎成了算命的代名词。而在四柱基础上增加了太阳律月亮律比四柱多了两柱更是完整的表达形式，这就是发明的六柱预测法，即算命术。</p>\n<p>　　六柱预测学是破译了阴阳五行、干支运气理论的千古之谜，在2003年发明与完善了四柱太阳律月亮律的基础上，于2006年面世的。这种利用人的出生时间为依据的预测方式与方法，具有验证过去、把握今天、预见未来和验证出生时间时分秒功能的技术面世，开辟了预测科学的新纪元！</p>\n<p>　　根据选点取面的科学原理，在原来的年月日时时间概念的基础上，分别在年柱与月柱之间穿插一个季柱（春夏秋冬四季季柱的干支），在日柱与时柱之间直接穿插一个阵柱（下半夜、上半天、下半天、上半夜等四阵阵柱的干支），就属于六柱预测学立六柱的基本方法。</p>\n<p>　　创新是一个民族进步的灵魂，创新其实就是站在他人不曾站过的高度，形成崭新的能从更深的层面反映事物本质与规律的认识。宋子平、李虚中、李淳风、袁天罡、任铁樵等先辈，揭开了阴阳五行、干支运气的千古谜底，继之在发明和完善了四柱太阳律、月亮律预测模式，发明出让世界震惊的六柱预测学。</p>\n<p>　　六柱预测学的问世，改写了“八字”数千年来演绎命运的历史，使生命预测科学跨入以更多层面的信息模式为载体、以准确率为亮点的新纪元。彻底弥补了四柱预测模式的不足与缺陷，完成了预测科学从主观判断向客观求证的历史性转型，成为无可争议的创新第一人。</p>\n<p>　　在发明和完善了四柱太阳律、月亮律的基础上，根据选点取面的科学原理更高层次的发明。不是吹的正因为六柱比四柱选点更全面、更深入，所以它的应断率、吉凶祸福信息的应事应人等，不仅是四柱预测模式无法企及，而且传统上所有的疑难或问题都将自然得以消除或解决，属于四柱预测模式的升级换代之作。它的核心内容只用明白了与四柱预测模式的区别后，就能彰显出来。鉴于北宋人徐子平在李虚中的三柱法的基础上发明了四柱法以“子平算命术”命名。</p>\n<p>　　《六柱预测学》（玉珍算命术）主要由六柱的立法、六柱节律的起法、六柱太阳律、月亮律的综合起法，六亲人事时空定位法等15章组成。</p>\n<p>　　四柱太阳律月亮律属于四柱预测的完整表达形式，六柱预测学是破译了阴阳五行、干支运气理论的千古之谜，在2003年发明与完善了四柱太阳律月亮律的基础上，作品《六柱预测学》于2006年面世的，并于2006年在湖南省版权局作了登记。</p>\n<p>　　近年来，有赖于众徒子不遗余力的在网络上宣传推广，现《六柱预测学》已在业界略有名气，预计不久算命术将跨入算命界的主流。</p>\n<p>　　从三柱到四柱，包括大运小运的发明，发展到四柱【含六柱预测学】太阳律月亮律的最高预测模式，历经了一千多年。在漫长的演变过程，历代的先圣先贤程度不同为其发展做出了贡献，都值得我们崇敬与称道。但相对而言，能对四柱预测模式完善做出独特贡献的只有李虚中、徐子平、无名氏、等大师。科学的发展没有捷径，关键在于基础理论的创新。正是揭开了阴阳五行干支运气的千古谜底，才有可能破译四柱密码，发明与完善能验证古今中外任何一个人的四柱太阳律月亮律预测方式与方法。人体生物节律学开辟了科学预测的新纪元，六柱预测比四柱预测多了两柱，也就是说准确率也相应提高了25%。况且六柱预测在版权局作了登记，而四柱预测没在版权局作登记，所以六柱预测比四柱预测更具权威性。有人说，算命术（六柱预测）是当今世界上最准确的算命术。</p>\n<h3>　　占卜</h3>\n<p>　　<strong>应用</strong></p>\n<p>　　占卜，意指以小明大、以微见著，通过微观与宏观的联系为原理，用龟壳、铜钱、竹签、纸牌或占星等手段和征兆来推断未来的吉凶祸福，为咨客分析问题、指点迷津的方法。占卜所需的物质材料分两类，一类是显示卜兆及刻辞用的载体，即龟甲、兽骨等，另一类是整治甲骨及刻辞用的工具，有锯、凿、钻、刻刀等。占卜流行于全世界各个时代的文化中，而且方法多种多样。早期的占卜和<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>密切相关，其发展受到宇宙观和民族心理的影响。常见的占卜方式有询问性占卜（如中国民间的求签）、鸡卜、鸟卜、鸟占、水占、星占、纸牌占卜等。这些占卜方法可信度虽不高，但在古代广泛流行。</p>\n<p>　　<strong>渊流</strong></p>\n<p>　　“占”意为观察，“卜”是以火灼龟壳，认为就其出现的裂纹形状，可以预测吉凶福祸。它通过研究观察各种征兆所得到的不完全的依据来判断未知事物或预测将来。在许多社会里，占卜仅仅是操作者在将行某事时，由于没有把握而借助某些器具或现象寻求信息或解答，由此满足心理需求的行为。占卜所需的物质材料分两类，一类是显示卜兆及刻辞用的载体，即龟甲、兽骨等，另一类是整治甲骨及刻辞用的工具，有锯、凿、钻、刻刀等。占卜流行于全世界各个时代的文化中，而且方法多种多样。早期的占卜和宗教密切相关，其发展受到宇宙观和民族心理的影响。常见的占卜方式有询问性占卜（如中国民间的求签）、鸡卜、鸟卜、鸟占、水占、星占、纸牌占卜等。黄泓露先生更是在国内让算命回归科学和合理。</p>\n</div>"
    }
]