[
    {
        "title": "宿命（佛教名词）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x5BBF;&#x547D;&#xFF08;&#x4F5B;&#x6559;&#x540D;&#x8BCD;&#xFF09;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022321615.jpg\" /></p>\n<h2><a href=\"/rmgjc/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　宿命，指前世的<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>。佛家认为今生的命运是由前世行为的<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>决定的。</p>\n<h2>基本解释</h2>\n<p>　　[predestinate] 指前世的命运。</p>\n<p>　　<a href=\"/rmgjc/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>问佛,以何因缘,得知宿命,会其至道?——《<a href=\"https://www.guang5.com/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>》十三。</p>\n<h2>引证解释</h2>\n<h3>　　1．前世的生命。</h3>\n<p>　　佛教认为世人过去之世皆有生命，辗转轮回，故称宿命。</p>\n<p>　　《四十二章经》十三：“沙门问佛，以何因缘，得知宿命，会其至道？” 唐白居易《自解》诗：“我亦定中观宿命，多生债负是歌诗。” 宋李昌龄《乐善录》卷下：“颍川一异僧，能知人宿命。时 欧阳永叔 领郡事，见一女妓，口气常作青莲花香，心颇异之，举以问僧。僧曰：‘此妓前生为尼。’”</p>\n<h3>　　2．犹言生来注定的命运。</h3>\n<p>　　南朝 宋刘义庆《<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/guoxuerumen/17074.html\" class=\"keylink\" target=\"_blank\">世说新语</a>·尤悔》：“ 阮思旷 奉大法，敬信甚至。大儿年未弱冠，忽被笃疾。儿既是偏所爱重，为之祈请三宝，昼夜不懈。谓至诚有感者，必当蒙祐。而儿遂不济。於是结恨释氏，宿命都除。”</p>\n<h3>　　3．犹言生来注定的命运。</h3>\n<p>　　章炳麟《四惑论》：“其始本以对越上神，神教衰而归敬于宿命，宿命衰而归敬于天钧，俞穴相通，源流不二。”廖仲恺《钱币革命与建设》：“输入超过输出，已成 中国 国际贸易上之宿命。”郭沫若《反正前后》第一篇六：“然而一被举出，我总还是要去担任，或许也怕是我生来便赋有一种愚而好自用的宿命罢。”[1]</p>\n<h2>历<a href=\"/ctwh/ershisishi/shiji/\" class=\"keylink\" target=\"_blank\">史记</a>载</h2>\n<p>　　中国古代哲学中把天当作神，天能致命于人，决定人类命数。“天命”说早在殷周时期已流行。从古器物发掘中所见到的甲骨卜辞，彝器铭文，“受命于天”刻辞的不只一次出现，说明早在殷周时期，天命观就已经在人们的头脑里扎根了。</p>\n<p>　　这用《易经》的话来说，叫做“乾道变化，各正性命一。对于这里的命，后人注释道：“命者，人所禀受，若贵贱天寿之属也。</p>\n<p>　　在古人的思想观念中，人们的富贵贫贱、吉凶祸福，以及死生寿夭、穷通得失，乃至科场中举、货殖营利，无一不取决于冥冥之中非人类自身所能把握的一种力量，即命运是也。</p>\n<p>　　命运的观点，在古代源远流长。由夏经商历周，至春秋时，<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a><a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>子夏说：“死生有命，富贵在天”(《<a href=\"/ctwh/sishuwujing/lunyu/\" class=\"keylink\" target=\"_blank\">论语</a>·颜渊》)。可见孔门弟子是信奉命运的。孔子进一步指出：“富而可求也，虽执鞭之士．吾亦为之。如不可求，从吾所好”(《论语·述而》)。宋国的桓魑有一次想谋害他，孔子声称：“天生德于予，桓魑其如予何”(同上)!</p>\n<p>　　总之，在孔子看来，一个人的<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>存亡、富贵贫贱完全与高悬于天的命运有关，绝非尘世碌碌众生的力量所能改变。故孔子又说：“不知命，无以为君子也”(《论语·尧日》)。</p>\n<p>　　儒家祖师爷孔子是位极度信命的老夫子。按理说，孔子是个知识渊博的大儒，对于人类社会有着深刻的认识，怎么就会信起命来呢?原来，他早年风尘仆仆，奔走列国，到处推销自己的政治主张，很想干一番轰轰烈烈的事业。可是到了后来，当他碰了一鼻子灰以后，才深深地省悟到，命运之神竟是如此这般的厉害，然而这时他已是个五十左右的人了。“五十而知天命”，就是他从不知命到知命这一思想转化过程的最好说明。与此同时，他不仅“知命”，他和他弟子还不遗余力大肆宣扬“死生有命，富贵在天”，“不知命，无以为君子”，“君子属易以俟命，小人行险以侥幸”的思想。这里他的说教是，一个人的生死贫富，都是命里早就注定了的，作为一个君子来说，非得知命不可，否则就够不上做“君子修的资格。正因为君子是“知命”的，所以他能安分守己，服从老天爷的安排，但是小人却不这样，他们不肯听从天命，往往冒险强求，希望有幸，意得个好结果。</p>\n<p>　　当然，看问题也不能攻其一点，不及其余。《孔子袋语》记录孔子的话说：“古<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>君子博学深谋不遇时者众矣，岂独丘(我孔丘)哉!贤不肖者才也，为不为者人也，遇不遇者时也，死生者命也。”这里，他认为贤和不肖是根据才华来划分的，干和不干是人们自己可以把握的，至于机遇好和不好，是时间的问题（既在对的时间遇到错的人；或在错的时间遇到错的人；或在对的时间遇到对的人；或在错的时间遇到对的人），而是死还是活，那就只得看老天的旨意了。</p>\n<p>　　作为儒家学派的创始人，孔子的这种天命思想，又在后来大儒孟子身上得到了新的反映。《孟子·万章》上篇说：“莫之为而为者，天也，莫之致而至者，命也。”意思就是，没有人叫他干，而他竞干了，这就是天意，没有人叫他来，而他竞来了，就是命运。同时他还举例说明，尧、舜的儿子都不肖，是因为舜、禹为相的时间太长．所以尧、舜的儿子不有天下；禹的儿子启贤能，而禹为相的时间义短，所以启能得到天下。以上这些，都不是人力所为而自为，不是人力所致而自至。从理来说，这属于天意，对人来说，这属于命运。天和命。实在是一致的。在《孟子·尽心上》中，孟子还说：“夭寿不贰，修身以俟之，所以立命也。”又说：“莫非命也，顺受其正。是故年n会善不吉亚粤健'下 尺甘；首而而芒．币会十h．坯地环老．非币等待天命，这就是安身立命的方法。后者是说，天底下人的吉凶祸福。无一不是命运，只要顺理而行，接着的就是正命。所以懂得命运的人不站立在有倾倒危险的墙壁下面。因此，尽力行道而死的人所受的是天的正命，犯罪而死的人所受的不是天的正命。这里，孟子虽然认为天命的力量无可抗拒，但是不管怎样，我还是应该按照我的仁义而行，不能<a href=\"/rmgjc/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>无故地白白送死。无疑，这对孔子的天命观来说，有着补充的一面。此外，先秦诸子信命的还很多，而以儒家的势力为最大。</p>\n<p>　　天命观经过先秦学者的一阵鼓吹，其时从上到下。从统治者到平民百姓，信命的风气一时很盛。早在殷商时期，当时的统治者们，就已习惯于在每做一件事之前，总要先占卜一下天意如何，是凶是吉?后来，又由于人与天地相应观念的影响，更使得人们普遍认为，整个天下的命运和每个个人的命运，都和天时星象有关。《周礼·春官》记载：“冯相氏掌十有二岁，十有二月，十有二辰，十日，二十有八星之位，辨其叙事，以会天位。”“保章氏掌天星，以志星辰日月之变动，以观天下之迁，辨其吉凶。以星土辨九州之地所封，封域皆有分星，以观妖祥。”这是说冯相氏和保章氏，是专管岁时星象，并从而窥探命运从而推测人间吉凶祸祸福的一种职官。</p>\n</div>"
    }
]