[
    {
        "title": "【痛苦】-痛苦是什么",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a></h2>\n<p>　　一种广泛的而复杂的人类感受，意指会让人经验性地感到不舒服、不快乐等负面情绪的任何事物，它通常与受伤，或会让你受到伤害的威胁连结在一起。肉体受到伤害而产生的痛苦感受，通常被称为疼痛。</p>\n<h2>基本解释</h2>\n<p>　　1.【Agony;Pain;Suffering】</p>\n<p>　　2.指人心理感到难过或不愉快而表现出来的一种情绪状态。</p>\n<p>　　如：他心中就像与情人永别那样痛苦。</p>\n<p>　　3. 使精神或身体感到非常难受的事情</p>\n<p>　　如除令人痛苦的婚约。</p>\n<p>　　4.【Ache】∶指身体疼痛苦楚</p>\n<p>　　5.希望的破灭而出现的一种心理不平衡状态。</p>\n<h2>引证解释</h2>\n<h3>　　1.指人心理感到难过或不愉快而表现出来的一种心理。</h3>\n<p>　　汉王充《论衡·变动》：“李斯、赵高谗杀太子扶苏，并及蒙恬、蒙毅，其时皆吐痛苦之言。”《隋书·儒林传·王孝籍》：“痛苦难以安，贫穷易为蹙。”魏巍《壮行集·祝福走向<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的人们》：“懂得了生活就是斗争，就不会因一点点小的挫折而痛苦。”</p>\n<h3>　　2.使身体或精神感到非常难受的事。</h3>\n<p>　　巴金《家》三：“‘你也有痛苦？你有什么痛苦？’ 觉民 惊讶地问。”老舍《全家福》第二幕：“据我看，他们都不光为顾全封建性的那点体面，而是有实在说不出口的痛苦！我们必须帮助他们解除了痛苦。”杨沫《青春之歌》第一部第五章：“隐隐的幸福和欢乐，使 道静 暂时忘掉了一切危难和痛苦，沉醉在一种神妙的想象中。”</p>\n<h3>　　3.疼痛苦楚。</h3>\n<p>　　《古今小说·吴保安弃家赎友》：“那新丁最恶，差使小不遂意，整百皮鞭，鞭得背部青肿，如此已非一次。仲翔熬不得痛苦，捉个空，又想逃走。”《说岳全传》第七三回：“只见黑风滚滚，飞戈攒簇其身，痛苦非常，血流满地。” 清刘大櫆《方氏庶母传》：“及大夫病且革……﹝ 林氏 ﹞因割肉和药以进。盖 林氏 固知大夫疾不起，而心冀其生，不自知其痛苦也。”</p>\n<h3>　　4. 指使疼痛苦楚。</h3>\n<p>　　晋葛洪《抱朴子·博喻》：“忍痛苦之药石者，所以除伐命之疾。”</p>\n<h3>　　5.犹沉痛，深刻。</h3>\n<p>　　毛泽东《我们党的一些历史经验》：“对民族资产阶级要采取‘又团结、又斗争’的政策……只有斗争，不要团结，是‘左’倾错误；只有团结，不要斗争，是右倾错误。这两种错误我们党都犯过，经验很痛苦。[1]  ”</p>\n<h2>其他相关</h2>\n<h3>　　精神痛苦≥肉体痛苦</h3>\n<p>　　诗人千百年来就一直在向我们倾诉爱情带来的痛苦磨难。现在科学家证明，这原来不光是想像的东西，而是确实可以用仪器检测出来的事实。</p>\n<p>　　“你跟<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>受到创伤的人交流，经常都会听他们用描绘肉体感觉的字眼诉说精神痛苦，诸如脑袋要炸开了，肠子要搅断了等。其实这两种疼痛有很多雷同。”位于苏格兰阿伯丁市罗伯特·格登大学的创伤研究中心主任戴维·亚历山大教授多年来帮助许多人治愈了自然灾害和工伤事故所造成的心理创伤。他对这种发现丝毫不感到惊讶。</p>\n<p>　　美国加州大学神经科学家玛丽·弗朗西丝·奥康纳，近年来一直推动对情感痛苦的研究。她说，“我们现在终于进入了可以观察大脑与情感关系的年代。”她在加州大学的同事内奥米·艾森伯格利用大脑扫瞄，确定了大脑内感受精神痛苦的区域。</p>\n<p>　　艾森伯格利用专门设计的电子游戏，故意让做游戏者感到自己受到旁人的冷落排斥，使得他们受到感情上的痛苦。同时对他们进行的大脑扫瞄显示，这时的疼痛反应与肉体疼痛反应非常相似，都呈现在大脑的疼痛感觉区域——“前扣带回皮层”。</p>\n<p>　　为什么会这样呢？艾森伯格的解释是，社会关系对于人类的生存是至关重要的。在危险时刻，单独一个人难以生存下去，但是结为集体的话，机会就大一些。“形成社会依赖体制，并且把这种体制的运作施加在肉体疼痛感觉之上，有助于确保我们和周围的人保持紧密关系。”</p>\n<p>　　艾森伯格说，肉体疼痛警告我们不要做这样或那样危害身体的事情，譬如脚受伤了就不要用它走路。情感的疼痛也能起到类似的警告作用，“就好比是告诉你，以后要尽量躲开能让人精神痛苦的事情。”</p>\n</div>"
    }
]