[
    {
        "title": "同性恋",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x540C;&#x6027;&#x604B;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022221253.jpg\" /></p>\n<h2><a href=\"/rmgjc/tongxinglian.html\" class=\"keylink\" target=\"_blank\">同性恋</a></h2>\n<p>　　同性恋有三个分别的意义：同性恋倾向、同性恋行为，同性恋权利运动（又称同志运动）。在人类以外的其他动物中，也普遍存在同性行为，但这与基于高级<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>的人类同性恋爱不可同日而语。</p>\n<p>　　性取向是只有本人自己，通过自己的直觉，感觉性吸引和感情欲望，才能做出判断的，而他人是无法判断的。一般说来，性取向与性行为是没有固定的对应关系的。</p>\n<p>　　从恋爱的角度来说，爱情观的不同决定了人们更愿意与同性还是异性恋爱。信奉柏拉图爱情理论的人坚信只有同性间存在真正的爱情，异性之间无非是为了维系社会构造。</p>\n<p>　　在一些国家和地区，通过了同性<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>，为人们提供了多样的选择，这是人类文化多元化发展的一种具体表现。</p>\n<h2>概念释义</h2>\n<p>　　同性恋有三个分别的意义：</p>\n<p>　　一、同性恋倾向，或称同性爱、同性吸引等。女同性恋（Lesbian）、男同性恋（Gay）为性取向的种类，是相同性别之间的个体产生爱慕、情感、性吸引及性行为吸引的现象。</p>\n<p>　　二、同性恋行为或称同性恋<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>模式。基于同性吸引，从而选择这种包括同性之间的情感依赖及性行为的生活模式。</p>\n<p>　　三、同性恋权利运动。或称同志运动（LGBTsocial movements）。 这是一场高度政治化的社会运动，推动者未必有同性恋倾向或行为。自由主义者及性解放运动人士形容同性恋是一种自我身份认同和社会标签。由于基督教文化的影响，同性恋曾经被认为是一种性心理障碍，随着时代的发展，这种谬误已经得到澄清。</p>\n<p>　　个体和异性发生了性行为，不一定表明其性取向一定是异性；个体和同性发生了性行为，不一定表明其性取向一定是同性。  并不是所有和同性有过性关系的人都是同性恋者或双性恋者，有些异性恋者享受和异性做爱，但也能和同性做爱，他们喜欢这种刺激感，由此产生了许多跟风的异性恋者去尝试同性之爱；而许多接连和异性结婚，甚至生儿育女的也不代表他们是异性恋，无论男女同性恋者都有可能因为各种外界压力而和异性结婚，例如：著名的性感女神玛丽莲·梦露被爆曾亲口承认与琼·克劳馥、芭芭拉·斯坦威克、玛琳·黛德丽、伊丽莎白·泰勒等同性艺人有过关系，而梦露的前夫乔·狄马乔也向纽约一家报纸的专栏作家透露，他和梦露离婚的真正原因是梦露不喜欢与他同房，梦露的心理医生拉尔夫·格雷森十分肯定的一点是“梦露既没有和肯尼迪兄弟也没有和任何其他男人真正发生过关系。”  因此，区分同性性行为、同性性吸引和同性恋自我认同是很重要的，因为它们并不一定是一致的。</p>\n<h2>产生原因</h2>\n<p>　　性取向是一个复杂的问题，各种性取向并无优劣之分。关于性取向的产生有很多种理论，当今大多数科学家、心理学家、医学专家认为性取向是先天决定的，无法通过后天改变，不是一种选择，也不是自己可以控制的。总之，重要的是应当认识到性取向是因人而异的。</p>\n<h3>　　遗传因素</h3>\n<p>　　从生物遗传学来说，携带有同性恋基因的个体细胞，在适宜的条件下，易于发展成同性恋细胞。这就说明，同性恋的性取向有70%是遗传基因所产生的结果。</p>\n<p>　　部分同性恋在12岁时，就已经清楚的<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>到自己的性取向了。另一部分同性恋要在12岁~16岁的阶段继续探索自己的性取向并逐步确定下来。绝大部分同性恋在20岁的时候都能清晰的知道自己的性取向了。但是也有一些同性恋可能在40~50岁时，才突然意识到自己的性取向并深信不疑。</p>\n<p>　　这些情况都是正常的，同性恋意识到自己性取向的早晚，与个人经历、所处的社会和文化环境，有很大的关联。这是因为异性恋在数量上占据碾压性的优势，同性恋很难在周围充满异性恋的环境下，像异性恋一样从小认知自己的性取向。年幼的同性恋者充其量只会疑惑自己为什么不像周围人一样对异性感兴趣，但不会发觉自己是同性恋。这就是“后天同性恋”的由来，实际上这些“后天同性恋”只是过晚意识到自己性取向的同性恋罢了。</p>\n<h3>　　心理因素</h3>\n<p>　　虽然性取向是先天性的，但有些经历会更快的促进同性恋者确定自己的性取向，并对异性产生更大的抵触。</p>\n<p>　　<strong>一、不幸福的<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>和父或母性格恶劣的家庭</strong></p>\n<p>　　不幸福的家庭或父母关系不和睦家庭的同性恋者会更快的确定性取向，长大后对婚姻关系失去信任感。父亲的品性恶劣粗暴且大男子主义会增加女同性恋者对男性的厌恶抵触，母亲的性格蛮横泼辣且蛮不讲理会增加男同性恋者对女性的厌恶抵触。</p>\n<p>　　<strong>二、父爱和母爱缺失</strong></p>\n<p>　　如果父母双方工作忙或因为各种原因没有时间陪伴孩子，那么同性恋者确定性取向的速度更快。因为同性恋者会在同性朋友的陪伴和安慰下成长，能更快发觉自身对同性的依恋。如果有同性的亲生哥哥或姐姐，那么在父爱和母爱的缺失下，会把一切的亲情依赖全部注入到哥哥或姐姐身上，也能更快的确定自身的性取向。</p>\n<p>　　<strong>三、生活在优越富裕的环境</strong></p>\n<p>　　生活在优良环境中的同性恋者接受的信息教育也更广泛优良，在接受正确优秀教育的同时也不会把同性恋当成心理疾病，能以更好的心态面对自己的性取向。</p>\n<p>　　各种调查数据显示：学历越高的人越支持同性恋平等，也越可能是同性恋。调查显示女同性恋者多为研究生、公务员、高层白领、企业高管，山东大学第二医院心理科统计了女同性恋者的人数和职业，最后发现高学历女性能占女同性恋总人数的三分之二以上。就连金赛的性学报告中也出现了女同性恋的人数比例和学历高低成正比的现象，由人数最低的10%的中小文化到最高的33%的研究生。墨尔本大学的Mark Wooden教授与圣地亚哥州立大学的Joseph Sabia教授共同对同性恋的收入问题进行了研究，研究结果表明：女同性恋普遍要比女异性恋的收入高出33%；而中国疾病预防控制中心对男同性恋者的学历和工作进行了调查统计，结果有46%的男同性恋者有较高的学历和稳定的工作。西蒙斯市场研究局最近的调查数据显示，一名同性恋消费者拥有度假屋的可能性是异性恋者的2倍，拥有家庭影院系统的可能性是后者的5.9倍，而拥有笔记本电脑的可能性则是后者的8倍。所以生活在优越环境的人更有可能是同性恋是有根缘的。</p>\n<p>　　忠告：性取向是不会轻易改变的，没有科学研究证明“改变性取向”的治疗是安全或有效的。事实上，对于同性恋者或双性恋者，这些治疗通常会带来巨大的负面影响或心理阴影，请同性恋者的家属不要轻信声称能改变性取向的庸医。</p>\n<h2>取向分析</h2>\n<p>　　一些人对同性恋进行了多方面的研究，这包括生理学理论、心理学理论、学习理论、互动理论、社会学理论等。传统观点认为：纯粹的男同性恋者表现出明显的女性化特点，纯粹的女同性恋者则表现出明显的男性化特点，这被证实为是错误的。</p>\n<h3>　　误区</h3>\n<p>　　性别认同障碍、易性癖、双性恋皆不属于同性恋</p>\n<p>　　同性恋中有的人很异性化，要是不说他是男/女的，甚至都看不出来，这种人在女同性恋圈子里被称为爷T、纯T、帅T、铁T，男同性恋则是C、CD、娘受、CC。女性理男式短发、裹胸、穿男装，行为举止和男性相同；男性发型不定，喜欢偷偷在家化妆或穿女装、嘟嘴卖萌，行为举止和女性相同，这些人大多是性同者（性别认同障碍），而不是同性恋。虽然同性恋者与性同者喜爱的对象皆为生理上的同性，但同性恋者没有性别认同障碍，他们认可自己的性别并为此骄傲，不存在变性或将形象装扮往异性靠拢的需求。</p>\n<p>　　性别认同障碍是一个由心理学家和医生所定义的精神医学用语，是指一个人在心理上无法认同自己与生俱来的性别，相信自己应该属于另一种性别。这是一种精神医学上的分类定义，通常用来解释与变性、跨性别或异性装扮癖相关的情况。</p>\n<p>　　世界精神病学会很明确的将性同者归类到了LGBT中的Transgender（跨性别）行列，在DSM-IV的诊断判定中也详细的介绍解释了跨性别的定义。但社会民众仍然会无意或故意的将性同者、异装癖、异性化和同性恋划上等号或扯上关系，生活在这种社会环境的性同者本身也很缺乏这方面的知识，自然会误认为自己是同性恋。</p>\n<h3>　　异装癖和性别认同障碍</h3>\n<p>　　有一类人不是同性恋，也不是恋物癖，只是通过穿异性服装，做异性打扮来获得心理的平衡和满足，这就是心理学上所说的异装癖。异装癖者和性同者是有显著差距的，性同者认为自己属于另一种性别，异装癖者只是喜欢做异性打扮，但并不觉得自己是异性。另外，异装癖者几乎都是异性恋，同性恋中的异装癖者可谓寥寥无几。</p>\n<h3>　　异性化的人很受同性恋欢迎？</h3>\n<p>　　无论是从心理学的角度来讲，还是根据各种调查统计来讲，真正的同性恋都对异性化的同性无感，甚至讨厌。因为同性恋喜欢的是同性，要他们去喜欢一个异性化的人，那他们还不如去喜欢一个真正的异性。有些同性恋者甚至比异性恋更加厌恶异性化的同性，因为他们认为异性化者不爱惜自己的性别魅力。</p>\n<p>　　同性恋者认为，自身性别特征越明显，则越有魅力。为了吸引优秀的同性，他们首先会努力让自己变得优秀来吸引对方，但没有同性恋者会喜欢往异性化发展。同性恋者不会对异性产生爱意和性欲，所以对异性的特征不会产生好感，没有同性恋者会希望自己身上有太多的异性特征，更加不会去喜欢异性特征特别明显的同性。如果一个同性恋者长得过于异性化，那他则会通过后天的努力来改变这种形象，无论是以什么方式，他都会通过凸显其他的性别特征来掩盖异性化的部分，而不是往异性化发展。</p>\n<p>　　不仅仅是同性恋者，异性恋者和双性恋者也不喜欢异性化的同性。喜欢异性化同性的人恰恰证明他对异性的迷恋至极，拿女性举例子：当异性满足不了或仍不满足她对男色的渴求时，她就会在异性化的同性身上找寻男色来充饥，男性也同理。有相当多的心理学数据表明：无论是异性恋、双性恋还是同性恋，女性都容易被相貌漂亮、有女人味+性格中性化的同性所吸引；男性更是偏倒性的欣赏相貌和性格都具有男人味的同性。如果有人喜欢异性化的同性，那说明这个人需要的是异性而不是同性。喜欢异性化者的人群中也有跟风者的存在，虽然不喜欢同性，但还是因为各种因素去尝试同性之爱。正因为他们不喜欢同性，所以会找异性化的同性谈恋爱。而异性化者极其容易吸引这几类人群，这也造成了异性化者恋情的不稳定性。</p>\n<p>　　1和T是指男/女同性恋性爱中的施动者，而0和P是受动者，不是指形象上有所区别，甚至还有句话叫：真正的同性恋不分这些。而现在这个概念也被异性化者、喜好异性化者的伪同性恋、媒体报道、娱乐影视作品所歪曲。[16]</p>\n<h3>　　同性恋中性别特征明显的人是双性恋？</h3>\n<p>　　有许多人认为：les中很有女人味和gay中很有男人味的大多是双性恋，这些人都很喜欢异性化的同性，并且很容易被“掰直”，这个观点其实很可笑。</p>\n<p>　　先来算算异性化者有多少。根据统计，中国最多有500万的跨性别者（其中还包括了变性人、异装癖、性同者），而同性恋是7000万。假设所有跨性别者都认为自己是同性恋，那么混在同性恋群体中的异性化者就有500万，异性化者也只占了同性恋总人数的7%。再除去变性人、异性恋的异装癖，不认为自己是同性恋的跨性别者，那么同性恋中的异性化者最多100万，也就是说异性化者仅仅只占了同性恋总人数的1%。</p>\n<p>　　再来看看喜欢异性化同性的人有多少。多项心理学调查研究表明，人类无论是异性恋、双性恋、同性恋都不会喜欢异性化的同性，喜欢异性化同性的人仅占每国总人口比例的0.25%~0.3%。算中国喜欢异性化同性的人有0.3%，那么总共有420万人喜欢异性化的同性。假设这420万人里所有的人都认为自己是同性恋，那么混在同性恋群体中喜欢异性化同性的人就有420万，也就是说喜欢异性化同性的人仅仅只占了同性恋总人数的6%。如果再除去不认为自己是同性恋的人，那这一比例又会下降。</p>\n<p>　　综上所述，异性化者和喜欢异性化同性者最多只占了同性恋总人数的7%，如果说同性恋中性别特征明显的人大多是双性恋，那么真正的同性恋可谓寥寥无几了。人们拥有这种想法主要是因为异性化者通常会在网络和圈子中十分活跃，所以这些人会更多的出现在公众视野中，因此人们会认为同性恋中异性化者很多，从而产生了同性恋=异性化的刻板印象。简单来说，觉得性别特征明显的同性恋大多是双性恋的观点，也是因同性恋=异性化的想法而生的。但其实绝大部分同性恋者是不混圈子，也不向公众公开性取向，和异性恋几乎没什么两样的，区别仅限于同性恋者只喜欢同性。</p>\n<h3>　　中性化和异性化</h3>\n<p>　　中性化指有异性特质的男女，但和异性化是有区别的，中性化在有异性特质的同时也保留了自己本身的性别特质，而且要明显大于异性特质。异性化指一个人的外貌形象或行为性格明显的偏向异性，有些时候甚至看不出他们本身的性别特征，还会被人误认为异性。异性化的男女甚至有丝毫不差的样貌，让人分辨不出到底是异性化男性还是异性化女性，这种就叫做异性化。</p>\n<p>　　忠告：跨性别是正常的，但不应该把LGBT群体混为一谈。没有意识到自己是性同者的人，需要积极正面的意识自己的内心，正确的认识理解自己。异性化≠喜欢同性，性同者也有喜欢生理上的异性的，而且比例不少，更何况性同者属于跨性别；而异装癖患者几乎都是异性恋，所以不要看到异性化者就认为是同性恋。</p>\n</div>"
    }
]