[
    {
        "title": "唯心（佛教名词）",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　宇宙所有存在，皆由心所变现，心外无任何实法存在。亦即心为万有的本体，为唯一的真实。《华严一乘十玄门》载︰‘<a href=\"/rmgjc/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>虚妄，唯一心作’，即是此义。因为有情生存于迷界（三界），皆是一心所变现，若谓心外有实在之物，乃纯属<a href=\"/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>所致，故言︰‘三界唯一心、心外无别法。’六十《<a href=\"https://www.guang5.com/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">华严经</a>》卷十有偈曰：‘心如工画师，画种种五阴，一切世界中，无法而不造；如心佛亦尔，如佛众生然。心佛及众生，是三无差别。’此外，如‘一切从心转’、‘一切唯心造’、‘心造诸如来’等语，皆为佛典中常用来表示此一思想之典型用语。</p>\n<h2>两大主义</h2>\n<h3>　　主观主义</h3>\n<p>　　主观唯心主义认为万事万物都是“我”的感觉、观念、意志、情感等等的产物，没有“我”就没有世界。如在中国，宋代的陆九渊认为，“万物森然于方寸之间，满心而发，充塞宇宙，无非此理。”“宇宙便是吾心，吾心即是宇宙。”明代的王守仁认为，“人者，天地万物之心也；心者，天地万物之主也 。心即是天，言心则天地万物皆举之矣。”“心之本体无所不赅”，“心外无物，心外无事，心外无理，心外无义，心外无善”。</p>\n<p>　　在西方，18世纪英国的贝克莱认为，物质是“不存在的实质”，“感性实物”是“观念的集合”或“感觉的组合” ， “对象和感觉是同一个东西”，“存在就是被感知”。18世纪末至19世纪初德国的J.费希特认为，“自我”是自身的原因和世界的本原，“自我”周围的现实世界是“自我”创造的“非我”。这些都是主观唯心主义的表述。19世纪30年代以后，主观唯心主义在西方的主要趋势是抹煞哲学的基本问题，宣称物质与<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>何者是第一性是无意义的问题，而以“经验”、“要素”、“事件”、“心理的东西和物理的东西”等“中立”的名词取代物质和意识的科学概念，自称为超越唯物主义与唯心主义之上的“新”哲学，如实证主义、新康德主义、马赫主义、实用主义、新实在论等。还有些主观唯心主义流派把意志、情感说成是第一性的东西，宣扬非理性主义，如唯意志论、存在主义等。</p>\n<h3>　　客观主义</h3>\n<p>　　客观唯心主义的特征，是虚构某种脱离物质、脱离任何个人的“客观”精神，并把它当成万物的创造者。在中国，西周时代的天命观是具有初步理论色彩的客观唯心主义。汉代董仲舒的神学目的论是系统的客观唯心主义体系，他认为“天”是“百神之大君” ，“万物之祖” ，“万物非天不生”；三纲五常的封建秩序是“天”有意志有目的安排的。魏晋玄学把神秘的精神实体作为万物的本原。王弼认为“万物皆由道而生”，而“道”是“无状无象，无声无响，故能无所不通，无所不往”的独立存在的精神。宋代的朱熹认为“理”是天地万物的创造主，“未有天地之先，毕竟也只是理，有此理便有此天地。若无此理，便亦无天地，无人无物，都无该载了。有理便有气流行发育万物”。在西方，古希腊柏拉图的理念说是最早的客观唯心主义体系，他认为“理念”世界是唯一真实的存在，由具体事物构成的“感性世界”则是由“理念”派生出来的不完善的“摹本”或“影子”。欧洲中世纪的托马斯主义和实在论也是客观唯心主义的体系。近代最大的客观唯心主义代表是G.W.F.黑格尔，他认为“绝对精神”是宇宙的本原和基础，自然界、人类社会和思维现象都是“绝对精神”在自我实现、自我认识的辩证发展过程中的外部表现。现代客观唯心主义的主要流派有新黑格尔主义、新托马斯主义、人格主义等。</p>\n<h2>发展</h2>\n<p>　　真正的唯心非应以“主义”而冠名，是以本质为实在的绝对真实，佛教就是这样的“<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>”，主客与客观其实都是邪见、外见，佛说这是“外道”，为何？没有见到本质！只见到了表面，如同只见到了波浪，没见到水的质体，你以什么观点都不对，唯从对自心本质的认识或离开事物的表相去察看与思考，你才能达到真正深层次的理解，了解什么才是真正的唯心、唯质，事物只是本质运动的现象、表相，而不是绝对真实，所谓真理，就是发现这个绝对不变的真实，而不是以主观与客观非要去“看”到什么，就如远看成岭侧成峰，远近高低各不同，不识本质真面目，只缘身在此山中。</p>\n<p>　　唯心主义能够长期存在根源之一在于人的认识过程本身包含着陷入唯心主义的可能性。</p>\n<p>　　主观唯心主义和客观唯心主义两者都把虚构的脱离物质的意识当作现实世界的本原，在这一根本点上是一致的，两者在唯心主义哲学体系内部也往往互相混杂或交错。</p>\n<p>　　人类最初的、最简单的抽象中就存在着认识的二重化和唯心主义的可能性。唯心主义作为一种社会意识，它的产生、发展还有一定的社会根源。在阶级社会中，阶级利益对哲学的存在和发展起最重要的制约作用，它规定哲学家概括现实和利用思想资料的倾向。</p>\n<p>　　辩证唯物主义认为，唯心主义的基本出发点是把精神、意识说成物质、自然界的本原，从根本上颠倒了世界的本来面貌，因而是与宗教同样谬误的世界观。有的唯心主义本身就是精制了的采取理论形态的宗教教义；有的唯心主义虽然对宗教采取回避的、存疑的甚至反对的态度，但就其理论实质来说仍与宗教相通。辩证唯物主义不是简单地笼统地抛弃唯心主义哲学的一切内容，而是把它们放在一定的历史条件下进行辩证的批判，具体地揭露其谬误的性质、程度、根源和影响，并利用其中可能包含的合理因素。这样才能真正不断地战胜以各种形式出现的唯心主义，丰富和发展辩证唯物主义。</p>\n</div>"
    }
]