[
    {
        "title": "相由心生",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x76F8;&#x7531;&#x5FC3;&#x751F;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022216285.jpg\" title=\"&#x76F8;&#x7531;&#x5FC3;&#x751F;\" /></p>\n<h2><a href=\"/rmgjc/xiangyouxinsheng.html\" class=\"keylink\" target=\"_blank\">相由心生</a>（解释）</h2>\n<p>　　相由心生是指人的仪容外表总受心灵思想因素的影响。换言之，人的思想<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>心灵情志必然表现在人的仪表上。也即一个人的精神世界虽是内在的，不可见的；但实际也给人外在的直观感受。比如一个小偷流氓，外表给人猥琐的感觉，是丑；一个内心善良帮人助人的人，外表给人阳光温暖的感觉，是美了。</p>\n<h2>出处</h2>\n<p>　　“相由心生”源自一个典故：据说唐朝裴度少时贫困潦倒。一天，在路上巧遇一行高人。高人看了裴度的脸相后，发现裴度嘴角纵纹延伸入口，恐怕有饿死的横祸，因而劝勉裴度要努力修善。裴度依教奉行，日后又遇一行高人，高人看裴度目光澄澈，脸相完全改变，告诉他以后一定可以贵为宰相。依大师之意，裴度前后脸相有如此不同的变化差别是因为其不断修善、断恶，耕耘心田，相随心转。</p>\n<p>　　裴度年轻未达时<a href=\"/rmgjc/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>先生说他有牢狱之灾，一段时间之后那位算命先生又见到了他，可却惊奇地发现他的灾祸已经破解了，于是他问裴度是怎样化解的。裴度说他没做过什么，只是归还了主人一条自己偶然拾到的玉带而已。先生说正是这件善事救了裴度一命，而且以后会大富大贵。“裴度还带”的唐传奇故事说明了凡事都有转机，人生在不断变化。</p>\n<h2>考证</h2>\n<h3>　　<strong>心理学的理解</strong></h3>\n<p>　　从心理学的层面来说，每个人的面相都反应着其相对应的身体和心理的状态，比如一个身体<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>、身心愉悦的人，其通常在相学中都天庭饱满、红光满面、神采奕奕。相反，一个身体有病，或者苦恼忧愁的人通常愁云密布、眉头紧锁，其多半是很难有顺心的事。眼界即是心界，而面相即为心相，相由心生就是这个道理。</p>\n<h3>　　<strong>玄学解释</strong></h3>\n<p>　　在玄学中“相”的意义一般是指面相，也概指整个相貌，相由心生即是说有什么样的心境，就有什么样的面相，一个人的个性、心思与作为，可以通过面部特征表现出来。这里的“相”不是指一时相貌的改变，而必须从长期的角度来理解，流传甚广的裴章的故事便是如此。在《四库全书》（康熙版）中关于看相的内容有这样的论述，如“七尺之躯不如七寸之面，七寸之面不如三寸之鼻，三寸之鼻不如一点之心。”另有，“未相人之相，先听人之声，未听人之声，先察人之行，未察人之行先观人之心”。</p>\n<p>　　宋初陈希夷有说：心者貌之根，审心而<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>自见；<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>心之发，观行而祸福可知。</p>\n<h3>　　<strong>科学解释</strong></h3>\n<p>　　道家认为心念即生，必然影响身体，比如愉快，心里舒畅，神清气爽，遇事便达观宽厚，便有助气血调和，气血调和，五脏得安，功能正常，身体康健，而此又反之影响心态。良性循环，自然满面光华，一团和气，双目炯炯， 神采飞扬，让人看了眼前一亮。反之，若总是工于心计，或郁郁不舒，自然凡事另眼而观，无法如常人言笑，如林黛玉，遇到点事就往不好的地方想，长久如此，气不舒，血不畅，营无养， 卫无充，五脏不调，六神无主，如此身体状况，脸上青黄腊瘦,暗淡无光，表情也常是蹩做一团，双目无神，半死不活，等等，让人一见就郁闷，起码不舒服，人缘自然也就差得远了。所以，身体发肤， 既然授之父母，但这张脸让人看后是何感觉， 还要发于己心。日久则生是相， 并非相家妄论。</p>\n<p>　　人体由骨骼、皮肤、毛发、血液等组成，骨骼是支撑，而心则维系着生命，如自然的动植物一样，人的心情、心念主导着人的身心，它是生命支配者、是中枢的中心，身体的其他器官受他支配并相互影响着，内在的心理状态会通过外在的器官表现出来，并通过时间的累计影响、改变着外在形态。</p>\n<h3>　　<strong>佛学的理解</strong></h3>\n<p>　　“相由心生”一词在<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>和相学中都是有据可考的，佛学的“相”一般而言是指事物的表现形式，与“性”相对，性一般是指事物本质，相学的相则是指面相。</p>\n<p>　　所谓“相”，即是我们平日<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中所见到的诸事物之表象。梵语攞乞尖拏Laks!an!a。指事物之相状，表于外而想像于心者。大乘义章三本曰：“诸法体状，谓之为相”。唯识述记一本曰：“相谓相状”。法华嘉祥疏三曰：“表彰名相”。花是相，草木是相，男女是相，美是相，丑是相。所谓相由心生，即是阐述了一种超脱的<a href=\"/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>主义哲学，《<a href=\"https://www.guang5.com/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚经</a>》有云：凡所有相皆是虚妄。 说的是世上景象，不过光影；爱恨情仇，都是<a href=\"/rmgjc/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。之所以见相，是由于心中有相。如来说勿着相，也就是让<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们不要为尘<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的幻象所蒙蔽，应当一心求<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，求大同，求真理。</p>\n<p>　　《金刚经》云：“一切有为法，如梦幻泡影，如露亦如电，应作如是观。”一切事物和现象都是以阿赖耶识中的名言种子，二取种子及业种子为因，依他（众缘）为缘，两相结合而生起。这些事物和现象都是无常的，是虚妄分别。然而众生为无明所盲，不明依他缘生法的真实相，起颠倒梦想，生我法执著，迷事迷理，故于依他起性上不证圆成实性，而得遍计所执。</p>\n<p>　　<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>六祖惠能于黄梅得法后，至广州法性寺，值印宗法师讲《<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>经》，时有风吹幡动，一僧曰风动，一僧曰幡动，议论不已，惠能进曰：不是风动，不是幡动，仁者心动。 佛曰：命由己造，相由心生，世间万物皆是化相，心不动，万物皆不动，心不变，万物皆不变。佛家说的“相由心生”，应归源于“维识宗”。“相”不是简单指“面相”，而有更广泛的意义：状态。我们现在所处的状态都是众生的“心”所造。</p>\n<h2>唯物观点</h2>\n<p>　　小议“相由心生”</p>\n<p>　　有人说相由心生的相是指面相，“恶心，就是满脸横肉相，善心，就是慈眉善目相”。如是如此，恶心则相恶，张飞、李逵是不是恶人呢？有谚云：“青竹蛇儿口,黄蜂尾后针,二者皆不毒,最毒妇人心”，如是善心则相善，那蛇蝎美人又如何讲？</p>\n<p>　　“相由心生”源自<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>《无常经[1]  》：“世事无相，相由心生，可见之物，实为非物，可感之事，实为非事。”</p>\n<p>　　“相由心生”如何解，先要明了何谓“相”。</p>\n<p>　　所谓“相”，在被引申之前（本意）一般而言是指可以被眼睛所能见到的外在。大乘义章三本曰：“诸法体状，谓之为相”。有物则有体，有体则有形，有形则有相。当然这里所说的相一般（常用）是指用眼睛能看到的相，眼睛只是“一识”，还有其他“五识”可以“识”到的相，比如让你闭起眼睛然后给你一个球，你会感到这是一个圆的东西。所以“相”绝不是单纯的指“面相”，而且除了本意之外还可以延伸出更多层次的意义。</p>\n<p>　　那么“相”与心是什么关系呢？在明了这个关系之前要先明了心和脑的关系。有人学过生理解剖学之后说：“哈！我们通常都说心想，心怎么能想呢？应该是脑想啊！看来是因为古代没有科学知识，所以古人搞错了！”这是典型的概念混淆，是数典忘祖的肤浅认识！</p>\n<p>　　中国传统“心”的概念是包含脑的。《黄帝内经》有云：“心者，君主之官也，神明出焉。”所谓“神明”就是指人的思维<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>，而这是人脑的功能，也就是说中国传统“心”的概念中包含了人脑的功能。生理解剖学“心”的概念是西方传来的，其在被翻译之时选择了“心”这个汉字，但此心已非彼心。现代人由于教育的关系，多识此心但不识彼心，却说彼心是吾心，谬哉！</p>\n<p>　　人的眼睛就是一部光学仪器，我们所能看到的圆的、方的、扁的、高的、矮的、黑的、白的、红的东西都是光线经过我们的眼睛变焦投射到视网膜上成像，这个像刺激视觉细胞产生脑电波再传导到大脑皮层，于是我们“觉”到了像。也就是说，我们“看”到的“像”不是眼外之物本身，而是“觉”到的由“心”所间接生成的像（只是这个过程时间非常短暂，我们觉察不到），而在一般概念中又把这些“像”称为“相”，所以才有“相由心生”之说。《金刚经》为什么说：“凡所有相皆是虚妄”呢？因为从“相由心生”的角度看，相本质上不过都是些“脑电波”而已。</p>\n<p>　　禅宗六祖惠能于黄梅得法后，至广州法性寺，值印宗法师讲《<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经》，时有风吹幡动，一僧曰风动，一僧曰幡动，议论不已，惠能进曰：“不是风动，不是幡动，仁者心动。“六祖为什么说是“心动”呢，因为“相由心生”，相动心亦动也。六祖说不是风动，不是幡动，并不是否定风动，否定幡动，而是在“悟”到了最终动的是“心动”的这个更高层面的认识之后，通过那两个不动的对比，来强调和突显“究竟”动的是心动。否则，风不动，幡如何动？幡不动，心如何动？假如当时有僧人甲和其他99个常人在一起听法，甲说不管风如何动，幡如何动，他的心就是不动，这时天空突然下来一个炸雷把甲的脑壳打个四分五裂，甲的“心”倒确定是不动了，但风依然动，幡依然动，那99个人的心依然动。</p>\n</div>"
    }
]