[
    {
        "title": "【孝顺】-孝顺的意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5B5D;&#x987A;&#x3011;-&#x5B5D;&#x987A;&#x7684;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022229994.jpg\" /></p>\n<h2><a href=\"/rmgjc/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　孝顺原指爱敬天下之人﹑顺天下人之心的美好<a href=\"/rmgjc/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。后多指尽心奉养父母，顺从父母的意志。</p>\n<h2>孝顺</h2>\n<h3>　　基本信息</h3>\n<p>　　词目：孝顺</p>\n<p>　　拼音：xiào shùn</p>\n<p>　　基本解释：[filial piety] 赡养父母尽心尽力,遵从父母意志</p>\n<p>　　词义：</p>\n<p>　　1.指尽心奉养父母，顺从父母。</p>\n<p>　　2.指用其他方式讨好人家。</p>\n<p>　　3.指贿赂官吏或尊长的财物。</p>\n<p>　　4.特指献给皇帝的贡物。</p>\n<p>　　5.指东汉孝顺帝刘保。</p>\n<p>　　反义词： 不肖 忤逆</p>\n<p>　　同义词： 孝敬、孝顺、<a href=\"/rmgjc/xiaoxin.html\" class=\"keylink\" target=\"_blank\">孝心</a>、<a href=\"/rmgjc/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>、孝义、孝情、孝悌。</p>\n<h3>　　引证解释</h3>\n<p>　　1.原指爱敬天下之人、顺天下人之心的美好德行。后多指尽心奉养父母，顺从父母的意志。《国语·楚语上》：“勤勉以劝之，孝顺以纳之，忠信以发之，德音以扬之。” 晋 袁宏 《后汉纪·安帝纪上》：“观人之道，幼则观其孝顺而好学，长则观其慈爱而能教。”《京本通俗小说·志诚张主管》：“这 张主管 是个本分之人，况又是个孝顺的，听见娘说，便不往铺里去。” 老舍 《柳家大院》：“可是，爸爸‘文明’，儿子也自然是要孝顺了，打吧！”</p>\n<p>　　2.指以财物贿赂官吏或尊长等。《水浒传》第九四回：“﹝ 何才 ﹞与本州库吏最密，当下探知此事，他便撺掇库吏，把信赏钱大半孝顺州官，其馀侵来入己。”《红楼梦》第十五回：“我想如今 长安 节度 云老爷 和府上相好，怎么求太太和老爷说说，写一封书子，求 云老爷 和那守备说一声，不怕他不依。要是肯行， 张 家那怕倾家孝顺，也是情愿的。”</p>\n<p>　　3.指用其他方式讨好人家。《金瓶梅词话》第七四回：“ 李桂姐 道：‘三位师父宣了这一回卷，也该我唱个曲儿孝顺。’”</p>\n<p>　　4.指贿赂官吏或尊长的财物。《二刻拍案惊奇》卷五：“大凡做贼的见了做公的，就是老鼠遇了猫儿，见形便伏；做公的见了做贼的，就是仙鹤遇了蛇洞，闻气即知。所以这两项人每每私自相通，时常要些孝顺，叫做‘打业钱’。”</p>\n<p>　　5.特指献给皇帝的贡物。《<a href=\"/ctwh/ershisishi/mingshi/\" class=\"keylink\" target=\"_blank\">明史</a>·李邦华传》：“是时 神宗 好货，中官有所进奉，名为孝顺。疏中刺及之。”</p>\n<h2>辨析</h2>\n<p>　　古讲孝道，并没有说要孝顺。<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>和孟子都说要孝，但不一定要顺。该顺则顺，不该顺时就一定不能顺。</p>\n<p>　　《<a href=\"/ctwh/mengxuejingdian/xiaojing/\" class=\"keylink\" target=\"_blank\">孝经</a>》谏诤章第十五曾子曰：“若夫慈爱恭敬，安亲扬名，则闻命矣。敢问子从父之令，可谓孝乎？”子曰：“是何言与！是何言与！昔者，天子有争臣七人，虽无道，不失其天下。诸侯有争臣五人，虽无道，不失其国；大夫有争臣三人，虽无道，不失其家。士有争友，则身不离于令名；父有争子，则身不陷于不义。故当不义，则子不可以不争于父，臣不可以不争于君，故当不义则争之。从父之令，又焉得为孝乎！”</p>\n<p>　　孔子的<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>曾参问孔子：“冒昧的问您下，子女顺从父母就可以说是孝吗？”</p>\n<p>　　孔子立刻回答道：“这是什么话！这是什么话！当父母有不义的地方，就要设法婉转的去劝阻他们，这样才能使他们不会陷入不义之中。如果一味的顺从，使父母陷入不义之中，这样又怎么能够称为孝呢？”</p>\n<p>　　<a href=\"https://www.guang5.com/ctwh/sishuwujing/mengzi/mengzi.html\" class=\"keylink\" target=\"_blank\">孟子说</a>过不孝有三，无后为大。然而孟子并没有说出其他二不孝具体是指什么。后来汉代人赵岐指出：“于礼有不孝者三者，谓阿意屈从，陷亲不义，一不孝也；家贫亲老，不为禄仕，二不孝也：不娶无子，绝先祖祀，三不孝也。”其中第一种不孝就是一味的顺从父母的话，陷父母于不义。</p>\n<p>　　对父母尽孝是天经地义的，上到天子，下至平民老百姓都是一样的。同时孔子和孟子都指出要孝但不一定要顺。该顺则顺，不该顺就不顺。</p>\n<p>　　从群经之首《易经》来看，孤阴不生，独阳不长。阴中有阳，阳中有阴。有顺则有不顺。孔子是非常精通《易经》的，所以当他的弟子曾参问他顺从父母就是孝顺吗？他会和吃惊连说了两个是何言与！至于什么时候该顺，什么时候又不该顺，则可以借助孔子孟子的观点。</p>\n<p>　　因此用孝顺是不是准确有待商榷。是否用孝敬会更好点。</p>\n<h2>孝的历史</h2>\n<h3>　　“不孝有三，无后为大”的误传</h3>\n<p>　　中国自西周开始就开始有孝道。影响最广的，是以孟子为代表的儒家思想。而最让人熟悉的就是——《孟子·离娄上》：“不孝有三，无后为大。” 原文是“孟子曰：不孝有三，无后为大，舜不告而娶，为无后也，君子以为犹告也”。</p>\n<p>　　把孟子的话翻译成现代汉语，意思是：“不孝有三种，以不守后代之责为大。舜没有告知父母就结婚了，这就是无后，但君子以为，和告知了差不多（因为舜<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>在外，而且是尧要把女儿嫁给他）。”也就是说，孟子的原话里，并不是大众所谬传的——不生孩子就是不孝。而是认为最不孝的，是对长辈没有尽到后代的责任。孟子原话中并没有说其它的两种不孝是什么。</p>\n<p>　　后来汉代赵岐写了《十三经注》。阐述了他个人对于孟子这段话的理解：“于礼有不孝者三事，谓阿意曲从，陷亲不义，一不孝也；家穷亲老，不为禄仕，二不孝也；不娶无子，绝先祖祀，三不孝也。三者之中，无后为大。”</p>\n<p>　　翻译成现代文：一味顺从，见父母有过错而不劝说，使他们陷入不义之中，这是第一种不孝，即最大的不孝；家境贫穷，父母年老，自己却不去当官吃俸禄来供养父母，这是第二种不孝；不娶妻生子，断绝后代，这是第三种不孝 。</p>\n<p>　　可见赵歧把”无后为大“曲解成不娶妻生子，断绝后代为第三种不孝。于是开始了二千多年的误传。</p>\n<p>　　有人误以为这是孟子说的话，并且大骂孟子泯灭人性，说孟子没人情。实质上是汉代人赵歧的个人理解。而孟子为赵歧无端地背上了黑锅。</p>\n<p>　　正因为这种误传，而使得封建社会中识字不多的老百姓都信以为真，把“不孝有三，无后为大”都曲解为“没有传宗接代是最大的不孝”。在“忠孝”为主题的封建时代，这句话就有了无上的魔力。老百姓为了不断后，无论世家还是贫民，都无所不用其极。随之产生的便有过继等一系列特殊的社会现象。</p>\n<p>　　虽然孔孟是一道，但是孟子时代的儒家思想，已经较孔子时代的有一些进步了。从儒家学者赵歧所说的不孝的第一条，即最不孝——“阿谀曲从，陷亲不义”就可以看出一味顺从，见父母有过错而不劝说，使他们陷入不义之中，这是第一种不孝。而在孔子时代，孝和忠的表现，就是哪怕明知道长辈有错，也要认可，不能指出。不管父母说的对与错，都要全盘接受，不得反抗。由此可见，孔子思想对人伦（人权）的压制。从现代的眼光看，儒家对孔子的修正、补充是一种进步。</p>\n<p>　　对于第二条，也是与孔子时代的思想相背道。孔子的思想是认为“用天之道，分地之利，谨身节用，以养父母，此庶人之孝也。”</p>\n<p>　　如此看来，“无后”反而排在第三位，并不是什么真正的“为大”。我们可以通过孔、孟儒家思想的发展，看出“不孝”定义的发展。当然，孟子的 《离娄上》也好，孔子的《孝经》也好，其所宣扬的孝道，与当时的政治利用也不无关系。所以现代社会看待孝这个问题，要辩证的看待。</p>\n<h3>　　孝的核心是子女与父母的关系</h3>\n<p>　　<strong>1.真正的孝道是父慈子孝</strong></p>\n<p>　　儿女确实应该感谢父母的抚养，但“报恩”的<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>是没有根据的。父母抚养儿女是职责，做不到就根本不具备做父母的资格。报答父母的抚养，不意味就必须任由他们决定自己的一生。中国古代虽然有过所谓“父母要你死你也要死”的话，但即使在古代，也并不认为这就是孝顺，而是人伦丧失。</p>\n<p>　　中国真正的古训，是父慈子孝，也就是父母要慈祥，儿女要孝顺，这是双方的责任。如果父母不顾你的本质，逼你放弃一生的幸福，这样的父母已经不具备被孝顺的权力了。</p>\n<p>　　<strong>2.从全社会的心理上看：父要子亡　子不得不亡</strong></p>\n<p>　　在封建社会，长期以来有这么这一个至高的生存准则，那就是我们经常听说的“君要臣死，臣不得不死；父要子亡，子不得不亡”。这跟我们社会长期存在的一些不<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>心理和民族素质有关。</p>\n<p>　　在这个被普遍信奉的准则里，“君”、“父”他们对臣子对子女来说都是至高无上的，不存在像我们所说的什么“同事情谊”、“父子情谊”。父亲不满意，就可以打孩子，也不需要孩子犯错误，什么理由也不需要，只要我是你的父亲就可以，甚至是名义上的父亲也可以。</p>\n<p>　　在这种观念的影响下，父亲、甚至是母亲就自以为自己是“天”了，可以对自己的孩子随意打骂、可以决定孩子的生杀予夺，这种观念严重影响了子女心理的健康成长，某些认识到这一点的子女，会在成长历程中一直处于深深的随时会被杀死的恐惧之中。</p>\n<p>　　这种封建社会的几千年的人生观，一直影响到当今社会，而且不是几年、十几年就可以改变过来的。改变需要一个过程，需要全民的观念转变，等到大家都觉得，打骂孩子是一件违法的事情时，这个观念就差不多改变过来了。</p>\n<p>　　<strong>3.从全民族素质来看：孩子与父母人格平等　父母只是监护人</strong></p>\n<p>　　应该承认，我们当今的全民素质还不是很高，能接受“孩子和父母平等”这一观念的人并不多。但孩子确实生下来就和父母是完全平等的，父母只是孩子法律上的监护人。</p>\n<p>　　我们经常可以看到邻居家经常打骂小孩，就包括我们小时候也是这样，看到这样的打骂，我们第一反应不会想到是父母在虐待孩子，只会认为是父母教育方法的问题，很少有人会主动上去劝说，更不要说通过报警来保护这个孩子。缺乏邻里的监督，<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>虐待就少了一个最容易发现问题的渠道。</p>\n<p>　　孩子不是父母的私有财产，也不由父母任意处置。像当今很多父母会打着关心的旗号偷看孩子的短信、邮箱一样，他们这样做的时候，就没有考虑到孩子与成人一样人格平等。严重一点来说，父母侵犯孩子的隐私也是违法的。</p>\n<p>　　这种尊重孩子的生存权、尊重孩子的人格，尊重孩子的隐私也需要社会各界积极引导。</p>\n<p>　　<strong>4.从权利和义务的角度来说：打骂孩子不是父母的权利　抚养孩子是父母的义务</strong></p>\n<p>　　在很多人眼中，父母悉心抚养我们，投入了很多期望，子女是应该报恩于父母的。如果反过来让父母伤心、失望，显然是大逆不道的。有些父母甚至会打骂孩子，是因为他们认为孩子是自己生、自己养的，孩子所有的一切全都是自己的赋予，所以自己对孩子有很多很多的权利。</p>\n<p>　　父母生孩子，是要负责任的。孩子并没有要求被生下，他们来到这个世界，是父母行为的直接结果。父母的责任，就包括无条件地接受孩子，除非孩子做了坏事。</p>\n<p>　　很多人觉得自己是同志伤害了父母，但是，同性倾向并非个人的选择，也不是犯错的行为。如果你因为去抢银行被抓住，这时你确实伤害了父母。然而，你的性倾向是你自己不能控制的，就像你不能控制自己生来是男是女一样。假如社会歧视矮个子，而你只有1.55，你父母受歧视，是谁伤害了他们？是偏见与歧视，并不是你。</p>\n</div>"
    }
]