[
    {
        "title": "孝道",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x5B5D;&#x9053;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022235117.jpg\" /></p>\n<h2><a href=\"/rmgjc/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>（传统文化）</h2>\n<p>　　中国最早的一部解释词义的著作《尔雅》下的定义是：“善事父母为孝”。汉代贾谊的《新书》界定为“子爱利亲谓之孝”。东汉许慎在《说文解字》的解释：“善事父母者，从老省、从子，子承老也”。许慎认为，“孝”字是由“老”字省去右下角的形体，和“子”字组合而成的一个会意字。从这里我们可以看出，“孝”的古文字形与“善事父母”之义是吻合的，因而孝就是子女对父母的一种善行和美德，是<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>中晚辈在处理与长辈的关系时应该具有的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>品质和必须遵守的行为规范。</p>\n<h2>孝的起源</h2>\n<p>　　“孝”作为一个伦理观念正式提出是在西周。在西周，孝的含义有：</p>\n<p>　　一、尊祖敬宗。施孝（尽孝）的方式主要是祭祀，在宗庙通过奉献供品祭祀祖先，尽孝的对象是死去的人，这带一定的<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>形式。</p>\n<p>　　二、传宗接代。在周朝的人们看来，祖先是我辈的生命之所生，因此，崇拜祖先就是把祖先的生命延续下去，生生不息。总之，西周时期的孝是一种封建宗教伦理。</p>\n<h2>现代孝道</h2>\n<p>　　此处的孝道，乃是子女与父母之间的关系，讨论此话题，是因为在<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中无法避免此类问题，因而需要探讨一个符合理性的处理方法。</p>\n<p>　　有的人认为自己出生是父母的恩德，这是不假，没有父母，我们依何因缘得此人身呢？</p>\n<p>　　然而“生育之恩”的另一方面，对于作为父母的人来说，也是一种极大的喜悦获得。否则为什么许多人去<a href=\"/rmgjc/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>求子呢？</p>\n<p>　　至于养育儿女，于他们自然也有许多天伦之乐的获得，因此，生育，养育之恩德，究其根本并非是单方面你欠父母的，父母也同样欠你的。</p>\n<p>　　基于互相感激，<a href=\"/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>才得以维持的长久。所谓“母慈子孝”，即是显著一种通俗的因果关系，便是讲述的一种理想状态。如此每个人都能获得自己想要的，关系才能稳固。</p>\n<p>　　然而，如果只是某一方，一味的付出，而没有任何回报，任谁也会寒心。所以善巧的维持平衡，父母子女的关系才能维持的长久，不要拘束于世俗礼教的教条，追求一味的付出，那可能会换来 一方变得理所当然的冷漠，以及自己的竹篮打水式的寒心，最终所导致的是<a href=\"/rmgjc/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>与愤怒。无论是“焦仲卿”的哀怨，还是老汉怒杀亲子的伦理悲剧，都本身源自于对于孝道，单方面无条件的误解而得来的。</p>\n<p>　　孝道和<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>万法一样，也是有条件的，有因有缘，有赖于父母和自己共同维系。把孝道看作是单方面的无条件的，在逻辑上，违背了因缘法则，敢问，有为法有非因缘和合而成者？如此便落入了“无因生”的外道论。</p>\n<p>　　【注意:我们这里只谈世俗伦理，而不谈神圣道德，神圣道德是指无条件关怀的 慈无量，悲无量，喜无量，如果用神圣道德的标准，则任何一个众生，都是获得无分别的对待。既然孝道是对于特定个体的行为，那么当不适用神圣道德】</p>\n<p>　　因此，孝道的实践，并非在于一味的付出，而是有条件的，依靠智慧维持平衡状态，从而使得每一个人都从中有所收获，如此才能长久稳定。</p>\n<p>　　悲剧见“焦仲卿”，\"贺双卿\".......</p>\n<p>　　既不赞成一味的追寻传统礼教，玩一场竹篮打水一场空的寒心游戏，拘束自己的自由和幸福。</p>\n<p>　　也不赞成受之无愧的享乐主义，把父母的恩义看做理所当然，由此而增长内心的麻木不仁。</p>\n<p>　　应该赞成的，乃是琴瑟和鸣的和谐境界，以有限的付出，以智慧，换取自己需要的情感或物质补偿。即，有付出而有回报的因果机制，如此可以确保良性发展。</p>\n<p>　　有道是养不教，父之过。</p>\n<p>　　善业成熟而生善趣，人天生即存善良之秉性，童稚无知，父母若施以合适的关心与教育，怎么可能会出现“不孝”的情况呢，既然出现了不孝的情况，父母当占了很大因素，何以唯把不孝归为子女的责任，其论何其怪哉！</p>\n<h2>孝道文化</h2>\n<p>　　中国传统孝道文化是一个复合概念，内容丰富，涉及面广。既有文化理念，又有制度礼仪。从敬养上分析，主要包含以下几个方面的内容，我们可以用十二个字来概括，即：敬亲、奉养、侍疾、立身、谏诤、善终。</p>\n<p>　　1、敬亲。中国传统孝道的精髓在于提倡对父母首先要“敬”和“爱”，没有敬和爱，就谈不上孝。<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>曰：“今之孝者，是谓能养。至于犬马，皆能有养，不敬，何以别乎?”这也就是说，对待父母不仅仅是物质供养，关键在于要有对父母的爱，而且这种爱是发自内心的真挚的爱。没有这种爱，不仅谈不上对父母孝敬，而且和饲养犬马没有什么两样。同时，孔子认为，子女履行孝道最困难的就是时刻保持这种“爱”，即心情愉悦地对待父母。</p>\n<p>　　2、奉养。中国传统孝道的物质基础就是要从物质上供养父母，即赡养父母，“生则养”，这是孝敬父母的最低纲领。儒家提倡在物质生活上要首先保障父母，如果有肉，要首先让老年人吃。这一点非常重要，孝道强调老年父母在物质生活上的优先性。</p>\n<p>　　3、侍疾。老年人年老体弱，容易得病，因此，中国传统孝道把“侍疾”作为重要内容。侍疾就是如果老年父母生病，要及时诊治，精心照料，多给父母生活和精神上的关怀。</p>\n<p>　　4、立身。《<a href=\"/ctwh/mengxuejingdian/xiaojing/\" class=\"keylink\" target=\"_blank\">孝经</a>》云：“安身行道，扬名于世，孝之终也”。这就是说，做子女的要“立身”并成就一番事业。儿女事业上有了成就，父母就会感到高兴，感到光荣，感到自豪。因此，终日无所事事，一生庸庸碌碌，这也是对父母的不孝。</p>\n<p>　　5、谏诤。 《孝经》谏诤章指出：“父有争子，则身不陷於不义。故当不义，则子不可以不争於父”。也就是说，在父母有不义的时候，不仅不能顺从，而应谏诤父母，使其改正不义，这样可以防止父母陷於不义。</p>\n<p>　　6、善终。 《孝经》指出：“孝子之事亲也，居则致其敬，养则致其乐，病则致其忧，丧则致其哀，祭则致其严，五者备矣，然后能事亲”。儒家的孝道把送葬看得很重，在丧礼时要尽各种礼仪。</p>\n<h2>历史作用</h2>\n<h3>　　积极作用</h3>\n<p>　　作为中国传统文化的核心，孝道文化在中国历史发展过程中的作用是多方面的：</p>\n<p>　　1、修身养性。从个体来讲，孝道是修身养性的基础。通过践行孝道，每个人的道德可以完善。否则，失去孝道，就失去做人的最起码的德性。因此，儒家历来以修身为基础。在今天，倡导孝道，并以此作为培育下一代道德修养的重要内容仍然具有重要的现实意义。</p>\n<p>　　2、融合家庭。从家庭来说，实行孝道，可以长幼有序，规范人伦秩序，促进家庭和睦。家庭是社会的细胞，家庭稳定则社会稳定，家庭不稳定则社会不稳定。故此，儒家非常重视家庭的作用，强调用孝道规范家庭。在新时代，强调子女尊敬和赡养老年父母具有同样重要的作用。</p>\n<p>　　3、报国敬业。孝道推崇忠君思想，倡导报国敬业。在封建时代，君与国有时候是同一个意思。据此，儒家认为，实行孝道，就必须在家敬父母，在外事公卿，达于至高无上的国君。虽然其对国君有愚忠的糟粕，但蕴藏其中的报效国家和爱国敬业的思想则是积极进步的。</p>\n<p>　　4、凝聚社会。儒家思想产生于乱世。孝道的思想可以规范社会的行为，建立礼仪的一些制度，调节人际关系，从而凝聚社会，达到天下一统，由乱达治。客观地讲，孝道思想为封建社会维持其社会稳定提供了<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>形态，为中国的一统起到了积极的作用。</p>\n<p>　　5、塑造文化。中华民族文化博大精深，源于诸子百家，历代都有损益变化，但孝道的思想和传统始终统领着几千年中华民族文化的发展方向。中华民族文化之所以能够同化无数外来文化，其根本原因在于孝道文化。中华民族文化之所以经久不衰，成为古代世界文明延续至今的唯一的古文明，其根本原因也在于孝道文化。</p>\n<h3>　　消极作用</h3>\n<p>　　孝道文化作为历史上形成的思想文化，经历了孔子、孟子以及后来历代儒家特别是统治阶级文人的诠释修改，已经成为一个极为复杂的思想理论体系，其消极的一面也是突出的：</p>\n<p>　　1、愚民性。中国历史上的孝道文化强调“三纲五常”等愚弄人民的思想，其目的是为了实行愚民政策。孔子也说：“民可使由之，不可使知之”。历代统治者也正是在孝道思想的掩盖下，实行封建愚民政策，利用孝道思想的外衣为其封建统治服务。</p>\n<p>　　2、不平等性。儒家孝道思想中“君臣、父子”的关系以及“礼制”中的等级观念渗透着人与人之间的不平等。这利不平等的关系表现为上对下、尊对卑的单向性服从，虽然也有尊老爱幼的思想，但长永远在上，幼永远在下。无论是家庭生活、政治生活还是社会生活，充斥着扼杀平等的价值观念。</p>\n<p>　　3、封建性。儒家思想在本质上是为封建统治阶级服务的思想体系，并成为几千年来中国历代封建王朝的意识形态。在封建阶级处于上升趋势过程中，相对于奴隶制来说，具有进步性。但是，在资本主义开始萌芽、封建阶级处于没落趋势时，儒家思想几乎成为封建阶级的最后避难所。</p>\n<p>　　4、保守性。儒家思想作为中华民族文化的核心，从政治上来说，在封建社会后期演变成为统治阶级的思想武器，扼杀创新力量，强调对圣贤的思想理念的守成；在文化上就是文化守成主义，不思进取，给中华民族文化蒙上落后的色彩，而且，根深蒂固，即便是在今天，仍然难以肃清其保守性的影响。</p>\n</div>"
    }
]