[
    {
        "title": "【小乘】-小乘佛教-小乘佛法",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>小乘（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　小乘佛教又称上座部佛教，上座部佛教主张恪守戒律，严守原始上座部佛教的戒律，注重上座部<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众的自身的戒律<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。</p>\n<h3>　　简介</h3>\n<p>　　佛教于公元1世纪左右开始分化，分成大乘教和小乘教。小乘佛教主要在弘扬与南印度与锡兰一带，该派尊崇 释尊 为伟大的教师，而非神明，其经典为比较古老的<a href=\"https://www.guang5.com/fxrm/fxcs/333528.html\" class=\"keylink\" target=\"_blank\">巴利文</a>经典。上座部佛教主张恪守戒律，严守原始上座部佛教的教义。<a href=\"/fxrm/rmzs/2314.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>则不然，认为按照原始教义，只有少数人才能<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>成佛，所以应该拓宽渠道，主张不但比丘众可以圆寂，一般四众也可以达到圆寂的境界，主要盛行于北部印度、外蒙古、中国西藏和日本等地。该派宣扬 释尊 的 <a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，并且用梵文颁布了一套新的法典。公元6世纪左右，大乘佛教在前印度地区衰落，印度教兴起，但大乘佛教的影响并没有消失，在世界扎下了根，成为世界三大<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>之首。</p>\n<p>　　现代很多佛教学者用大小乘做分类，已并无褒贬之意。一般认为现在的小乘佛教主要流行于斯里兰卡、泰国、缅甸、老挝、柬埔寨等南亚及东南亚各国，但他们自称“上座部佛教”或“声闻佛教”，不接受“小乘”的称号。中国云南上座部佛教，也属于这个宗派。</p>\n<h3>　　佛教传播</h3>\n<p>　　佛教发展于古印度，后来向世界传播发展，分成两大系统：向北方流传的，经过中央亚细亚传到中国内地及西藏，再传到韩国、日本、越南等亚洲地区，属于北传佛教；向南方流传的，传到斯里兰卡，然后再传到东南亚的缅甸、泰国、柬埔寨、老挝，及中国云南傣族等地区，属于南传佛教。</p>\n<p>　　南传佛教因其<a href=\"/rmgjc/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>及注释使用巴利语，故又称巴利佛教。也有人称为南方佛教，因为这一宗派的佛教，是由古印度恒河流域向南方流传，传到斯里兰卡，再传到东北南亚，这些地区都在印度之南。如就所属部派来说，凡是<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>南传<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>及皈依教团的，都可称为南传佛教，如盛行中国云南傣族已有一千三百多年的上座部佛教，流行越南南部的上座部佛教。</p>\n<p>　　佛教在公元前后开始由古印度向北方和东方传出世界，上座部佛教与大乘佛教同期传入中国，中国开始有大量由梵文译作中文的<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。这些佛经为魏晋南北朝佛教在中国的传播有著重要的影响。但其后上座部佛教在中国的地位被大乘佛教所盖过。大乘佛教在中国获得了辉煌的实践与发展，隋唐时代中国即取代前印度帝国成为世界佛教的中心。目前，中国保留的佛教三藏经典也是最完善的之一。</p>\n<p>　　另一方面，佛教亦传至南亚和东南亚地区。传说公元前3世纪阿育王时代，上座部的一个分支-分别说系的铜碟部传入锡兰（古斯里兰卡）的孔雀王朝。之后，又分化为大寺上座部和<a href=\"/rmgjc/wuguo.html\" class=\"keylink\" target=\"_blank\">无畏</a>山寺大乘上座部。两派出现长期激烈斗争。公元前19~27年，锡兰的大寺派僧人用僧加罗语写出了南传的五部《阿含经》。无畏山一派在很长时期内一直兴盛远超大寺。但随后的历史中，在皇室的偏好下，斯里兰卡佛教最终为大寺一派所一统[1] 。至缅甸阿努罗陀王朝时期，其势力使上座部佛教渗入暹罗北部和中部地区。经过锡兰于12世纪举行第七次结集，整顿佛教教团，使上座部佛教于锡兰臻于隆盛，期后透过与比丘<a href=\"/rmgjc/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>教习，传返暹罗，促使当时素可泰王朝倾向上座部佛教。现今在斯里兰卡﹑泰国﹑缅甸﹑老挝有很多上座部佛教信众，当中泰国的上座部佛教徒占该国信众的90%。</p>\n<h3>　　佛教分类</h3>\n<p>　　在佛教创始圣者 释尊 入—大—涅—槃后，佛教内部由于对 释尊 所说的教义有不同的理解和阐发，先后形成了许多不同的宗派。按照其教理与发心等方面的深浅不同，可归纳为上座部佛教和大众部佛教两大基本派别。</p>\n<p>　　请注意：大小乘的概念是佛教内的词汇，主要是从教理与发心上加以区别，用于专门针对佛法三乘菩提中的声闻、缘觉二乘<a href=\"/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>而言，以区别于<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>乘或佛乘。该分类与三大语系及传承时代的分类完完全全是两码事。</p>\n<p>　　三大语系是按照所承载语言地区划分。事实上三大语系中，汉传佛教内上座部佛教派曾有多个，汉传佛教目前保存的小乘经典资料相当丰富。而南传也并非就等于上座部佛教，他们也并不认可自己就是小乘佛教。至于时代划分，更是另一个概念，事实上，从现有的佛经与其它资料的明确记载来看，上座部佛教经典《阿含经》也都处处提到大、小乘或三乘佛法及“菩萨乘”等概念。所区别的仅仅是各个时代流行的侧重不同而已。</p>\n</div>"
    }
]