[
    {
        "title": "信仰",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x4FE1;&#x4EF0;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022304532.jpg\" /></p>\n<h2><a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a></h2>\n<p>　　信仰指对某种主张、主义、<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>或对某人、某物的信奉和尊敬，并把它奉为自己的行为准则；信仰带有情感体验色彩，特别体现在宗教信仰上，极致甚至会丧失理智。</p>\n<h2>词语解释</h2>\n<p>　　指对某种主张、主义、宗教或某人信奉和尊敬，拿来作为自己行动的指南或榜样。</p>\n<p>　　《法苑珠林》卷九四：“生无信仰心，恒被他笑具。”</p>\n<p>　　周恩来 《抗战军队的政治工作》：“要以耐心说服诱导的精神，争取官兵和人民的信仰，团结他们在革命主义与政纲的领导下而坚决奋斗。”</p>\n<p>　　巴金 《小人、大人、长官》：“对长官的信仰由来已久。多少人把希望寄托在 包青天 的身上，创造出种种离奇的传说。”</p>\n<h2>哲学概念</h2>\n<h3>　　心灵产物</h3>\n<p>　　信仰是心灵的产物，不是宗教或政党的产物，宗教或政党只起了催化剂的作用。没有宗教和政党，人同样可以拥有信仰。</p>\n<p>　　信仰是个人的<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>行为，靠集体建立起来的信仰难以长久，靠集体的信念建立起来的信仰会随着某个宗教、政党、组织的解体而烟消云散。信仰的内容五花八门，千奇百怪。<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>合一信仰、上帝信仰、佛信仰、科学信仰、对权利、地位、金钱、声誉、美色等的痴迷和崇拜也是信仰，“及时行乐”、“做一天和尚敲一天钟”、“得过且过”等也是信仰。</p>\n<p>　　信仰是一种灵魂式的爱、关爱，它是人类最基本的一种情绪。信仰的东西往往超脱于现实，所以神、已故的亲人，或者以人为灵魂主导的团队、国家、宗教等。在这里我们就可以看到国家、宗教是人们的信仰所发展的一种文化—国家文化、宗教文化；信仰最根本的就是以自身一样为根本的同类所产生的一种爱，通过人的情绪，大脑所激发的无限的渴望。</p>\n<p>　　信念跟信仰是不一样的，信念是你坚信的东西或者事情，信仰则是人们灵魂的标注。对某种主张、主义、宗教、某人或某物极其相信和尊敬，拿来作为自己行动的指南或榜样。不过，信仰很少是对人身上的，宗教并非信仰物件，而是信仰的表现形式，表现形式不可作为信仰物件。</p>\n<h3>　　哲学意义</h3>\n<p>　　信仰，即是你的信任所在。</p>\n<p>　　与信任不同：信仰同时是你价值的所在。</p>\n<p>　　信仰是人们对<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>所持的某些长期的和必须加以捍卫的根本信念。不管科学技术发展到何等程度，人的有限性是不会改变的，虽然我们知道的比2000年前的人们多得多，随着知识的增加，在一些问题的认识上获得了进展，可一些新的困惑又会产生，而在有些问题上，比如在死亡所引起的恐惧这一人生终极问题上，则几乎没有取得进展。人类在欲知和未知、在有限和无限之间的鸿沟，与他们的祖先相比，缩小的幅度可能远没有想象的那么大。在这道鸿沟里，既生出希望，也生出恐惧，这就给信仰留出了地盘。人类永远需要信仰，要依靠信仰尽力拉近有限和无限的距离。</p>\n<p>　　因此信仰和人们一般所说的信念有所不同。信仰回答的是人生日常关切最有深度的方面。信仰的对象也是崇拜的对象，在人类经验领域内的万事万物，一切无不是有限的，也只有有限的价值，这些只具有有限价值的事物很难作为信仰对象。信仰是为了超越，超越一切有限，惟有超越现实的无限才能真正成为弥补人自身局限性的希望。“上帝”的真理便是人类寻找到的超验真理，对“上帝”的信仰不是任何经验命题可以相提并论的。</p>\n<h2>原始信仰</h2>\n<h3>　　1.神话信仰</h3>\n<p><strong>　　（1）创世神话</strong></p>\n<p>　　在中国古代神话里，世界的开始来源于盘古的创造。相传在遥远的太古时期，宇宙好像一颗硕大无比的鸡蛋，里面漆黑一片，没有东南西北，也没有前后左右。在这样的世界中，诞生了一位伟大的英雄——盘古，开辟鸿蒙，分出了天地。从此，出现了<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>万事万物，并开始繁衍生息。</p>\n<p>　　古希腊诸神</p>\n<p>　　古希腊神话中，一切皆从混沌（Chaos）开始，混沌生出了地神盖娅（Gaea），之后出现了在大地的底层塔尔塔罗斯（Tartarus）出生的厄瑞玻斯（Erebus）和在地面出生的尼克斯（Nyx）。</p>\n<p>　　在巴比伦神话中，天地的生父是阿布苏（Apsu），生母是提阿马特（Tiamat）。世界原为一片混沌，提阿马特和阿布苏这两个精灵创造了包括提亚和马尔杜克在内的诸神。后来诸神造反，提亚杀了阿布苏并以阿布苏的身躯为基础建造了第一座神庙；马尔杜克则撕裂了提阿马特，再以此为原料创造了世界和人类。</p>\n<p>　　在印度神话中，有一个叫布尔夏的巨人，又千头千眼，他通过献祭和肢解创造了世界。</p>\n<p>　　尽管各个民族的神话不尽相同，但是几乎在所有的神话中都有对世界来源的解释，可以说创世神话反映了人类寻求世界本原的精神本性。</p>\n<p><strong>　　（2）复活神话</strong></p>\n<p>　　人类对于死亡的恐惧，反映在神话中，就体现为对复活的渴望。</p>\n<p>　　其中最具代表性的就是古埃及奥西里斯（Osiris）的复活神话。相传，奥西里斯原是埃及之王，其弟赛特（Seth）用计将其杀死，并割裂其尸弃于四方。他的妹妹兼妻子伊西斯（Isis）通过苦心寻找，将碎尸拼合，并化作一只鹰伏于其上，用翅膀为之扇风，从而使奥西里斯奇迹复活。</p>\n<p>　　在中国的神话中，也有凡人因为行善积德，以肉体死亡的形式化羽升天，成为长生不死的神仙，得到永久的复活。</p>\n<p>　　复活神话，满足了人类对来世生活的美好遐想，从而帮助人类克服对死亡的恐惧。</p>\n<p><strong>　　（3）英雄神话</strong></p>\n<p>　　人类的精神特质注定了其与生俱来的英雄情结。人类通过反观自身，看到了人类的缺陷和不足，这种认知让人类沮丧而又不安，因此英雄的创造就成为必然。被创造出来的英雄具有完美的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>和无穷的力量，弥补了人类的缺憾，也成为判断人类行为的价值标准，并且引领着人类不断前行。</p>\n<p>　　因此，在中国神话中就塑造了“刑天”这个英雄角色。《山海经》中写道：“刑天与帝争神，帝断其首，葬之常羊之山，乃以乳为目，以脐为口，操干戚以舞。”据说刑天与黄帝激战，一直杀到常羊山地方，黄帝看准机会一剑砍下刑天的头颅，但是，刑天并不示弱，以两只乳头当做眼睛，肚脐当做嘴巴，挥舞武器，继续呐喊战斗。</p>\n<p>　　在希腊神话里，普罗米修斯（Prometheus）违反了天神宙斯的旨意，盗取火种带给人类，人类因此有了火。而普罗米修斯却因此受到宙斯的惩罚，被锁在高加索山上，受到秃鹰啄食肝脏的无尽折磨。</p>\n<p>　　英雄神话中寄托了人类对超越自身的美好期望。</p>\n<h3>　　2.其它原始信仰</h3>\n<p>　　除了神话信仰之外，原始信仰还包括其他一些形式。</p>\n<p><strong>　　（1）图腾</strong></p>\n<p>　　原始社会物质资源极为匮乏，种族之间常常因为生存而发生战争，这就需要同</p>\n<p>　　一种族有赖以维持团结的精神力量，于是图腾就出现了。不同种族往往会有不同的图腾信仰。</p>\n<p>　　一般来说，原始人类会把某些动物、植物或者无生命的物质当做自己种族的祖先或者保护神。图腾被视为力量、勇气、好运的来源和主宰。这些传统被保留下来，并流传至今。例如，中国大多数民族把龙视为图腾，而北方的狩猎民族则膜拜野猪神，纳西族尊奉神牛，北方许多游牧民族则信奉马神……</p>\n<p><strong>　　（2）巫术</strong></p>\n<p>　　巫术是一种广泛存在于世界各地和各个历史阶段的宗教现象。它的通常形式是通过一定的仪式表演来利用和操纵某种超人的<a href=\"https://www.guang5.com/fxrm/fxcs/340902.html\" class=\"keylink\" target=\"_blank\">神秘力量</a>，影响人类生活和自然事件，以达到某种目的。</p>\n<p><strong>　　（3）<a href=\"/rmgjc/jinji.html\" class=\"keylink\" target=\"_blank\">禁忌</a></strong></p>\n<p>　　与巫术相对的，禁忌则是避免去做某些行为，以免招致灾祸。一般而言，各个民族都会有自己的特定禁忌。尽管随着时代的变迁，这些禁忌已经渐失神圣性，不再是一种严格意义上的信仰，但是却以风俗习惯的形式保留下来。</p>\n<h2>宗教信仰</h2>\n<p>　　目前世界上最主要的宗教有基督教、伊斯兰教、<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。在中国一向提倡宗教信仰自由，因此各宗教派别在中国都有或多或少的发展，除了以上三种宗教，还有中国特有的“儒教”、“道教”，宗教也是源于对自然的未知，与民间神话一样，它们也有自己的神话传说，彼此相互串联。</p>\n<h3>　　（1）佛教</h3>\n<p>　　佛教相信每个人的<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>都掌握在自己手中，以成佛信仰为核心内容。佛教其实并不推崇科学的敌人——<a href=\"/rmgjc/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>，相反，佛教是反对迷信、注重<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>的，只是用因果业力将现实因果律扩展到三世轮回，将一切串联其中以使人产生敬畏之心，达到超自然的，向往<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的心灵寄托。</p>\n<h3>　　（2）儒教</h3>\n<p>　　儒教又称“孔教”“圣教”。先秦被称为道教，以“儒家思想”为最高信仰，以超凡入圣（成圣）为终极目标。后为和崇尚黄老列庄等道家思想的道教区分，从南北朝开始叫做儒教又被称作圣教，跟佛教、道教并称为三教。“儒教是中华民族土生土长的宗教[2]  ”，儒教是礼乐文明的代表，上古宗教的直接继承者。</p>\n<p>　　“儒教是中华民族特有的传统宗教，凡是生活在中国这块古老土地上的各民族，包括汉族以外的少数民族，如北方的辽、金、元，西夏及清，历代王朝都以儒教为国教，<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>为教主(这是孔子生前没有料到的，正如老子被道教奉为教主没有被老子料到一样)。……儒教利用政教结合的优势得以成为国教，儒教的神权与皇权融为一体，不可分割[3]  。”</p>\n<h3>　　（3）道教</h3>\n<p>　　道教以“道”为最高信仰，以神仙信仰为核心内容，以丹道法术为修炼途径，以得道成仙为终极目标，追求自然和谐、国家太平、社会安定、<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>和睦，相信<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>积德者能够幸福快乐、长生久视，充分反映了中国人的精神生活、宗教意识和信仰心理，它是中华民族的精神家园。</p>\n<h3>　　（4）基督宗教</h3>\n<p>　　基督宗教（天主教、东正教、新教）提倡包容、进步精神。敬仰并<a href=\"/rmgjc/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>基督（对基督宗教创始人耶稣基督进行感恩，他为拯救人类的<a href=\"/rmgjc/zuie.html\" class=\"keylink\" target=\"_blank\">罪恶</a>而死），基督教号召自由、民主、仁义、义气与道义。消除内心的不良欲望，对犯下的过错和自身的罪恶进行忏悔，净化心灵。基督宗教认为，世上的人有善有恶，将来基督从天降临，审判地上的活人和死人，善人将进入天国获得永生，恶人将被抛入<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>受永罪，教会把天堂描绘成一个<a href=\"/rmgjc/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>。</p>\n<h2>哲学信仰</h2>\n<h3>　　（1）儒家信仰</h3>\n<p>　　「人本」和「性善」是儒家重要信仰：人天生固有的人性是善的，要知足、常乐。同时崇尚“礼乐”和“仁义”，提倡“忠恕”和“中庸”之道。主张“德治”、“仁政”，重视伦常关系，而后面的都是行为。著名论断：“子不语怪力乱神”。</p>\n<p>　　人本由孔子提出，主要由四方面组成：</p>\n<p>　　第一：强调个体人格的独立性和主动性。</p>\n<p>　　第二：尊重人的利益要求。</p>\n<p>　　第三：尊重人的物质欲望。</p>\n<p>　　第四：倡导“仁政”。</p>\n<p>　　人本妨碍君本，在“普天之下，莫非王土；率土之滨，莫非王臣”情况下，除了被民本取代别无选择。在自然经济条件下，民本事实上是农本。其主要内容包括：</p>\n<p>　　（1）轻徭薄赋，藏富于民。</p>\n<p>　　（2）勿伤农时，给农事活动提供方便。</p>\n<p>　　（3）实行常平仓制度，防止谷贱伤农。</p>\n<p>　　（4）刺激人口增长。</p>\n<p>　　（5）抑商贾，禁技巧。</p>\n<p>　　（6）设庠序，学而优则仕。</p>\n<p>　　（7）纳谏。</p>\n<p>　　（8）及时赈灾。</p>\n<p>　　性善：</p>\n<p>　　孟子的“性善说”，是在他自己的那套心、性观基础上建立起来的主要有以下两点内容：</p>\n<p>　　第一，它是“道德层面”的心性，不是“情欲层面”的心性。</p>\n<p>　　第二，这个\"道德层面”的心性具有仁义的内在先天规定性。</p>\n<h3>　　（2）科学理性信仰</h3>\n<p>　　理性一般指我们形成概念、进行判断、分析、综合、比较、进行推理、计算等方面的能力。理性和感性相对</p>\n<p>　　，指处理问题按照事物发展的规律和自然进化原则来考虑的态度，考虑问题、处理事情不冲动，不凭感觉做事情。</p>\n<p>　　社会学角度来讲，理性指能够识别、判断、评估实际理由以及使人的行为符合特定目的等方面的智能。理性通过论点与具有说服力的论据发现真理，通过符合逻辑的推理而非依靠表象而获得结论，意见和行动的理由。</p>\n<p>　　理性的意义在于对自身存在及超出自身却与生俱来的社会使命负责。</p>\n</div>"
    }
]