[
    {
        "title": "心中心法",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/xinzhongxinfa.html\" class=\"keylink\" target=\"_blank\">心中心法</a>（解释）</h2>\n<p>　　心中心法，唐密、藏密红教、东密各有传承。心中心法在西藏和日本都是不轻传之密法，不经过一番艰苦的修习，不具备相当的密法基础，是很难得到的。在上个世纪二十年代重新崛起的无相密乘心中心法，既不是来自东密，也非来自藏密，而是我们汉地独有之传承，远在唐密中就有的。</p>\n<h2>内容</h2>\n<p>　　心中心法有六个手印和一个<a href=\"/rmgjc/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>，修法简便易学，既不用修加行与前行，更不须观相或观想，因为和<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>一样从第<a href=\"/rmgjc/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>起修，且有佛力加持，故易直下见性。密咒为佛、<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>于<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>中将自己的心化作的密语，如同发电报时所用的密码；手印则如文件加盖的印信，又如电视机上的天线。通过结印持咒，使学人与佛、菩萨之心灵沟通，打成一片，故加持力大，证道迅速。心中心的六个手印作用各不相同，依次修习可以净除学人业习，巩固入道之基，进而证体起用。</p>\n<p>　　<strong>第一印为菩提心印。</strong>乃教学人立大志、发大愿，上求佛道，下化众生，巩固<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之初心。如造百丈高楼，须先打好地基，基础如不牢固，楼要倒塌。学道如不立大志，不发大愿，势必知难而退，遇挫即止，绝不能百折不挠地奋斗到底，证成圣果。所以此印最为重要，在密宗的一万六千余种手印中，以此印为诸印之王。</p>\n<p>　　<strong>第二印为菩提心成就印。</strong>修习此印可以消除宿障，治疗诸病，为开慧之前奏。《佛<a href=\"https://www.guang5.com/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">心经</a>》上说：“若善男子善女人，得此契持者，转业消障，速证无上正等菩提。常持此契，得闻持不忘，於诸法要自然通达。从久远来所未持者，应心所作，皆悉契合。”修持此印者常会出现腹泻现象，盖得此印加持之力，将宿世污染、垢秽尽从大便排除之故。</p>\n<p>　　<strong>第三印为正授菩提印。</strong>乃诸佛、菩萨发光加持学人，推之前进，迅速入定之要印。学人于修法期间，若遇事烦心乱,修持此印，即能迅速改观而深入禅定。如远方有亲朋好友生病，或有不如意的事，为其加修此印，亦能于修法后痊愈，或转好。</p>\n<p>　　<strong>第四印为如来母印。</strong>是为开慧、成道与往生<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之要印。《佛心经》上说，修持此印者“诸佛长生，我亦长生；诸佛成道，我亦成道；诸佛度人，我亦度人；诸佛无碍，我亦无碍；诸佛<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>，我亦化身；诸佛放光，我亦放光；诸佛寂定，我亦寂定；诸佛三昧 ，我亦三昧；诸佛<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，我亦说法；诸佛不食，我亦不食；乃至种种诸佛所作之事，皆悉能为能作。”所以当六印修完开始专修二、四印时，第二印只修一天，而第四印须修六天，可见此印之重要。很多同仁都是在修此印期间打开本来，得见真性的。</p>\n<p>　　<strong>第五印为如来善集陀罗尼印。</strong>乃集合诸佛密咒之功德 、威力与妙用于一体之印。其力至大，其势飞猛，能降服魔障，破除外道邪法，而且能移山填海，消除翻种子等的烦恼。故修心中心法无入魔之虞，亦无受外道邪法困扰之患。</p>\n<p>　　<strong>第六印为如来语印。</strong>若<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>修持此印，所有诸佛所说之经与菩萨所造之论，均能一目了然，理解通达，无稍疑惑。持此印契并能召请诸佛、菩萨的加持，满足诸愿。当我们把贪、嗔、痴、慢、疑和各种欲望都化空了，依靠佛菩萨加持的力量，能迅速显发本具的<a href=\"/rmgjc/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。</p>\n<p>　　心中心的修法是定慧双修之法。上座之时心念耳闻, 重在修定，慧在定中，是为以定养慧；下座之后历境练心，以慧照力觉破一切<a href=\"/rmgjc/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>，是为以慧摄定。由定慧交资、而定慧<a href=\"/rmgjc/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>、而定慧等持，故修持此法作用明显，见效奇快，数十座内打开本来者并不鲜见。</p>\n<p>　　心中心系密法，未经灌顶不可公开传示，故不详言修法。有志者请觅师灌顶传授，依之修习，自有是处。</p>\n<h2>心法心得</h2>\n<h3>　　心法</h3>\n<p>　　一切众生，本来是佛，本不用修法以证佛果，只以积垢深重，虽遇明眼人直示心性，又不肯自信承当，故不得不假法<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，以作黄叶止啼之举。而诸修法中又以善巧方便不同，修习即有快慢迟速之殊。参禅动辄数十年始能得个消息，甚或迷闷终身而不悟。修其他宗派者，又多不敢言明心见性，此以<a href=\"/jtz/\" class=\"keylink\" target=\"_blank\">净土宗</a>尤甚。上述之心中心密法，可谓方便快捷多矣，亦复要修千座，约须三年之久，方能亲见本来面目（此就最慢者言，根利速成者并不须坐满千座）。克实言之，这都是无辜而披枷带锁，无事而走冤枉路。等到打开桶底，见到本来，方知本来现成，多此一举。</p>\n<p>　　一念回光见性者，修心中心法一千座见性者与参禅数十年见性者，其时间之快、慢、迟、速，曾不可以道里计。但多走冤枉路者亦不无补偿、值得之处。以冤枉路多走后，脚劲毕竟锻炼出来了。彼未走过冤枉路者，脚劲虚弱，一经上路——即对境遇缘时，即觉力有未逮！何以故？因上述三种人所悟之理虽无二样，但在力用上大有差别。一则以悟来甚易，未经习定磨练，心恒随境动摇，不能自主，故力量不足；一则久经打坐，习定功深，参究锤炼提撕观照，一旦开悟，故能洒脱自如，不为尘境所左右。古德所谓：“功不唐捐，法不浪施！”雪窦云：“数十年来曾辛苦，为君几下苍龙窟，屈！屈！堪述，明眼衲僧莫轻忽！”即颂此也。</p>\n<h3>　　心得</h3>\n<p>　　修心中心法约用三年的时间，仗佛力加持，可以开悟，虽较一念回光者多花了些时间，但比三十年勤<a href=\"/sushi/yaoshan/kushen/\" class=\"keylink\" target=\"_blank\">苦参</a>禅者省去了十倍的辛劳，而且可以得到同样的力用和效果。我们这些末法时代的子孙，除了深自庆幸何来如此福德遇此大法，和深切感谢佛菩萨的慈悲恩德外，还有什么话可说哩！</p>\n<p>　　复次，心中心法除了可以明心见性，即生成就外，还可以发愿求生西方<a href=\"/rmgjc/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>。如<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>不得力、圣境不能现前者，可假此法修习，以证三昧，往生西方极乐世界即有十足把握。此法虽名密法，实际是熔禅净于一炉的圆妙大法！有志者应探求修之！ 阿弥陀佛！</p>\n</div>"
    }
]