[
    {
        "title": "【学佛】-什么是学佛？学佛有什么用？",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x5B66;&#x4F5B;&#x3011;-&#x4EC0;&#x4E48;&#x662F;&#x5B66;&#x4F5B;&#xFF1F;&#x5B66;&#x4F5B;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF1F;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022338888.jpg\" title=\"&#x3010;&#x5B66;&#x4F5B;&#x3011;-&#x4EC0;&#x4E48;&#x662F;&#x5B66;&#x4F5B;&#xFF1F;&#x5B66;&#x4F5B;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF1F;\" /></p>\n<h2><a href=\"/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　学佛，学习<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>，佛学院教导的内容。学佛者为<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，在家是供佛，出家成佛者称为法师有<a href=\"/rmgjc/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。</p>\n<h2>解释</h2>\n<p>　　(1).学习佛法。唐方干《贻亮上人》诗：“人间学佛知多少，浄尽心花只有师。” 唐黄滔《送僧》诗：“纔年七岁便从师，犹说辞家学佛迟。” 五代徐夤《山寺寓居》诗：“披缁学佛应无分，鹤氅谈空亦不妨。” 宋李觏《回明上人诗卷》诗：“学佛有馀力，吟诗过一生。”</p>\n<p>　　(2).指<a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>或研究佛教。 唐郑愚《潭州大沩山同庆寺·大圆禅师碑铭序》：“知余学佛，求为赞说。”《新五代史·杂传·马胤孙》：“ 胤孙 既学 韩愈 为文，故多斥<a href=\"/rmgjc/futu.html\" class=\"keylink\" target=\"_blank\">浮屠</a>之说，及罢归，乃反学佛，撰《法喜集》、《佛国记》行於世。”</p>\n<h2>学佛课程</h2>\n<h3>　　戒淫</h3>\n<p>　　阿难：云何摄心，我名为戒？若诸世界，<a href=\"/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生，其心不淫，则不随其<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>相续。汝修三昧，本出尘劳；淫心不除，尘不可出。纵有多智，<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>现前，如不断淫，必落魔道，上品魔王，中品魔民，下品魔女。彼等诸魔，亦有徒众，各各自谓，成无上道。我灭度后，末法之中，多此魔民，炽盛<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>，广行贪淫，为善知识，令诸众生，落爱见坑，失菩提路。</p>\n<p>　　四种清净明诲中，第一种就是戒淫。其他经论，言及根本大戒，皆以不<a href=\"/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>居首，唯独本经，旨在令人速离生死，得证菩提；而淫欲正是众生，沉溺生死的主要原因，淫心不除，尘不可出，故佛第一先说淫戒。‘清净’，是遵守莫犯，终生严谨受持，令身心皆清净；‘明诲’，是十方古今诸佛，明明白白公布世人，令众皆知的教诫与训诲。</p>\n<p>　　人因内心充满贪嗔痴，策动于身口，故有杀盗淫妄种种不<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>的<a href=\"/rmgjc/zuie.html\" class=\"keylink\" target=\"_blank\">罪恶</a>行为，若能摄心一境，不起<a href=\"/rmgjc/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>，对顺境不贪，<a href=\"/rmgjc/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>不嗔，一定可以身心不犯，所以佛教我们断淫杀盗妄，先要从内心做起，若能身心俱断，是名持戒清净，所以说：‘云何摄心，我名为戒。’</p>\n<p>　　‘诸世界’，是约秽土而言，秽土众多，因名诸世界。世有过去，现在，末来三世；界有东南西北四维上下十方。世代表时间，界代表空间，在十方三世无量时空之中，充满无量的生命，而无量生命中，又有四圣六凡的分别。诸佛<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>，与二乘<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，已经断烦恼，了生死，超越时空，不再受时间与空间的限制。唯有天，人，阿修罗，<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>，饿鬼，畜生等六道众生，皆以淫欲而正性命，因此<a href=\"/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>六道，生死不断。如果其心不淫，则苦因既断，苦果不生，必然可以出离生死。</p>\n<p>　　‘三昧’译名正定。‘尘’指外界色等六尘，能染污人的身心；众生不知六尘境界，无常苦空，幻妄不真，心起贪嗔，追求不舍，遂终日为六尘而奔波劳碌，身心不得安息；烦恼是尘劳因，能扰乱人心；生死是尘劳果，令人此死彼生，劳累不止，因名尘劳。修耳门圆通金刚三昧的人，目的是超出尘劳，<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>生死，今因淫心不除，不但尘不可出，反而堕落魔道。纵然有博学多智，善说诸法，或于世间禅定，能入善出，如不断淫，皆是魔业，必然沦为魔眷。视其所修世间禅定境界的深浅，及福业的厚薄，‘上品’，禅定胜于淫心堕为魔王；‘中品’，禅定与淫心相等堕为魔民；‘下品’，禅定劣于淫心堕为魔女。不管是魔王，魔民，或魔女，都自己说已经成无上菩提。此是我慢习气使然，非果计果，大妄语成，福报享尽，必堕地狱。佛告阿难：我灭度后，在末法时期，此类魔鬼眷属，充斥人间，以广行淫欲，为善知识，使人生前受其蛊惑，死后堕为魔眷。</p>\n<p>　　‘落爱见坑’，爱指思惑，见是见惑，即被见思二惑缠缚，以广行淫，为<a href=\"/rmgjc/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生的手段，不修学佛的<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，而失却趣向佛果菩提的正路。</p>\n<p>　　汝教世人修三摩地，先断淫心，是名如来，先佛<a href=\"/rmgjc/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，第一决定清净明诲。</p>\n<p>　　修三摩地，即修习耳门圆通，亦即修首楞严王大定。佛嘱阿难转教世间，修学大定的人，必须先断淫心，不止身不行淫，心亦不起淫念。这样才是：‘如来先佛世尊，第一决定清净明诲。’如来，指今佛，先佛，指古佛。无论古今，十方诸佛，教导众生修习禅定，皆以先断淫心，令身心清净，为第一种明确的教诲。</p>\n<p>　　是故阿难，若不断淫，修禅定者，如蒸砂石，欲其成饭，经百千劫，只名热砂。何以故？此非饭本，砂石成故。</p>\n<p>　　佛借譬喻以明淫心，非菩提根本。蒸喻修禅定，沙石喻淫心，热沙如烦恼，饭喻无上菩提。淫心不除，而修禅定，欲成菩提，犹如蒸沙成饭，纵经尘劫，终不可得。因为沙非饭本，因果不类，徒自疲劳，益增烦恼而已。必须先断淫心，以不生不灭心为本修因，方可证入菩提<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>，不生灭性。</p>\n<p>　　汝以淫身，求佛妙果，纵得妙悟，皆是淫根，根本成淫，轮转三涂，必不能出；如来涅槃，何路修证。</p>\n<p>　　此以法合喻。初二句合蒸沙石，次二句合经百千劫，只名热沙；皆是淫根等四句，合此非饭本。因为淫心不除的人，<a href=\"/rmgjc/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>田中，存有淫欲的种子，遇境逢缘，必引发淫行，因此名为‘根本成淫’。由此恶业，必招三恶道的果报，不能出离恶道，然则人身尚不可得，何况修证佛的菩提涅槃？</p>\n<p>　　必使淫机，身心俱断，断性亦无，于佛菩提，斯可希冀。如我此说，名为佛说，不如此说，即波旬说。</p>\n<p>　　‘机’即动机，身行淫的动机，是由心而发，而心淫的动机，则基于邪念的习惯性。若然邪念的习气不除，则身心淫机的因缘未了；必须断除邪念的习惯性，然后可以断除淫行淫念的动机，令身心清净无染，最后，连能断除此邪念习气之念亦不可得。故言：‘必使淫机，身心俱断，断性亦无。’</p>\n<p>　　若身断淫机，即得律仪戒；心断淫机，得定共戒；断性亦无，得道共戒。身心的淫机俱断，是‘此根初解，先得人空。’断性亦无，是‘空性圆明，成法解脱。’自此得入菩萨正位，继续进修，于诸佛所证的菩提果位，始有希望。</p>\n<p>　　梵语‘波旬’，译名极恶。是欲界天顶的天王，因贪恋五欲尘劳，障碍他人<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，能坏人善根，害人慧命，被称魔王。特别是末法时期，佛魔难分；故佛以四种根本大戒，以辨别邪正真伪；令末法修学佛法的人，知所鉴别。</p>\n<p>　　若果如释尊所说：修三摩地，必须先断淫心，便是佛说，便是正法，应当信受奉行；否则，若说行淫，不碍真修，或诱人作不道德的行为，而说是什么双修法，即是波旬魔王所说，不应轻信。佛教一向主张依法不依人，故凡是说：修习禅定，必须先断淫机，连断性亦无的人，虽然是凡夫，其所说亦等如佛说；反之，知名度很高的人，若说行淫不碍真修，即使自称圣人，亦是魔鬼所说。所以是魔是佛，当听其言，观其行，是否身心断淫，持戒清净，作为判别的准则。</p>\n<h3>　　戒杀</h3>\n<p>　　阿难，又诸世界，六道众生，其心不杀，则不随其生死相续。汝修三昧，本出尘劳；杀心不除，尘不可出。纵有多智，襌定现前，如不断杀，必落神道。上品之人，为大力鬼；中品则为飞行夜叉，诸鬼帅等；下品当为地行罗刹。彼诸鬼神，亦有徒众，各各自谓成无上道。我灭度后，末法之中多此鬼神，炽盛世间，自言食肉得菩提路。</p>\n<p>　　戒是能防的善法，杀是所妨的恶法，能所并称，名为戒杀。杀生亦是生死根本之一。杀生之人，必负命债，将随恶业所牵，轮迥六道，不能出离生死。佛劝世人戒杀，不但身不杀生，心亦不起杀念，身心都不杀，苦因既断，苦果不生，自可解脱轮回，不致生死相续不断。</p>\n<p>　　‘三昧’，在修因时名止观，在果位名定慧。止是定，能破散乱心；观是慧，能除昏沉。修习三昧的人，定中有慧，慧中有定，定慧均等，即可断烦恼，了生死；今因杀心不除，故‘尘不可出’。纵然拥有世智辩聪，也能深入世间有漏禅定，但不戒杀，结果不免堕落神道。</p>\n<p>　　‘神’，是鬼道中有福德的一类，若然禅定与智力胜于杀业，神通福报俱大，则为大力鬼王，统领一切鬼神，宫殿楼阁，享用<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。若禅智与杀业相等，神通福报次于鬼王，则堕在飞行夜叉的一类，作为鬼神的统帅，势力与享受，皆不及鬼王。若禅智劣于杀业，则报堕地行罗刹，或为魅魑魍魉，神通力薄，福报次于鬼帅，属于鬼道兵卒之类，以众生血肉为饮食，每用神通惑人，或显灵作怪，令人倾心摄伏，杀生祭祀，以供享用。</p>\n<p>　　据说：中国宋朝，有高僧名戒阇黎，是<a href=\"/fjrw/zhufopusa/pusa/66965.html\" class=\"keylink\" target=\"_blank\">文殊菩萨</a>的<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。当时有一五郎祠，时常显灵，令当地居民，杀生祭祀。有一天知道文殊菩萨化身的戒阇黎，必经此地，便化一虎，阻档去路。戒阇黎至，用手拨开老虎，而说偈言：‘汝是一郎至五郎，妄兴祸福宰牛羊；老僧为说无生法，免得冤家累世偿。’之后，神祠无火自焚，居民不再受其干扰。</p>\n<p>　　此等鬼神，亦各有徒众，皆自言已经成无上道特别是佛灭度后，在末法时期，很多此类鬼神，出现人间，或托扶乩显灵，或附人身<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，虽然行为怪异不一，但同言食肉不碍修行，亦得菩提之道。</p>\n<p>　　阿难，我令<a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>，食五净肉，此肉皆我神力化生，本无命根。汝<a href=\"/rmgjc/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>，地多蒸湿，加以沙石，草菜不生；我以大悲神力所加，因大慈悲，假名为肉，汝得其味。奈何如来灭度之后，食肉众生，名为释子。</p>\n<p>　　五净肉是：一不见杀，二不闻杀，三不为我杀，四自死，五鸟残。佛恐人问，既然食肉必堕神道，何以佛在世时，比丘乞食，亦食五净肉？故佛言：‘我令比丘食五净肉，此肉皆我神力化生，本无命根。’或问：佛既可以用神力变化五净肉，何以不变化蔬菜之类？佛解释言：‘汝婆罗门，地多蒸湿，加以沙石，草菜不生。’印度属于沙漠地带，天气酷热，蔬菜不易生长，且释尊成佛之前，以婆罗门为国教，人皆以牧羊食肉为生；若然佛用神力，变化五谷蔬果，供给<a href=\"/rmgjc/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>专用，将违反世间现象，释尊为了维持‘佛法在世间，不离世间觉。’的原则，所以由大悲心，化五净肉，令佛<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们，暂得肉味，聊养色身，实则，是没有生命的假肉；如现代<a href=\"/rmgjc/sushi.html\" class=\"keylink\" target=\"_blank\">素食</a>，假鱼假虾，假鸡假鸭之类。奈何末法众生颠倒，不知食肉，伤害慈悲，更不知五净肉，是释尊慈悲的变化，竟然食肉，名为释迦如来的弟子。</p>\n<p>　　汝等当知，是食肉人，纵得心开，似三摩地，皆大罗刹；报终必沉生死<a href=\"/rmgjc/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>，非佛弟子。如是之人，相杀相吞，相食未已，云何是人，得出<a href=\"/rmgjc/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>？汝教世人，修三摩地，次断杀生，是名如来先佛世尊，第二决定清净明诲。</p>\n<p>　　‘汝等当知’，是教诫诸修行人，应该知道，食肉必堕。即使修习禅定，暂得心开，亦不过是相似三摩地而已，非真三昧。梵言罗刹，译名恶鬼，以其凶狠恶毒，食人血肉维持生命故。杀生食肉的人，生前类似罗刹，一期<a href=\"/rmgjc/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>报尽，终必沉沦生死苦海，永作鬼类，‘非佛弟子’。学佛的人，志在提升自己，希望断烦恼，出三界；今因杀生食肉，欠负命债，来生当被人杀，如是互相杀害，互相吞食，血债未了，怎可以出离三界？是以释尊敕令阿难，转教世间学佛修禅的人，欲想修习耳门圆通，深入首楞严王大定，必须先持淫戒，次断杀生；因为淫能障碍禅定，杀生则损害慈悲，应该严持不犯。此是古今诸佛，教化众生，第二种决定不移的明确训诲。</p>\n<p>　　是故阿难，若不断杀，修禅定者；譬喻有人，自塞其耳，高声大叫，求人不闻，此等名为欲隐弥露。</p>\n<p>　　佛再引用譬喻，说明若不断杀，终难解脱。‘有人’，指不断杀而修禅定的人。‘自塞其耳’，喻修禅定；‘高声大叫’，喻杀生食肉；‘求人不闻’，喻食肉以为无罪。欲想无罪，必须戒杀，今不断杀，而欲无罪；犹如欲人不闻，反而高声大叫，正是欲隐弥彰。修习禅定，希望解脱，如人‘欲隐’；但杀生食肉，难出三界，譬如‘弥露’。</p>\n<p>　　清净比丘，及诸菩萨，于岐路行，不蹋生草，况以手拔？云何大悲，取诸众生血肉充食？若诸比丘，不服东方丝绵绢帛，及是此土，靴履裘毳，乳酪醍醐；如是比丘，于世真脱，酬还宿债，不游三界。何以故？服其身分，皆为彼缘，如人食其地中百谷，足不离地。必使身心，于诸众生，若身身份，身心二涂，不服不食，我说是人，真解脱者，如我此说，名为佛说，不如此说，即波旬说。</p>\n<p>　　我们受持不杀戒，不止要戒杀因，还要戒杀缘，方名清净，始得解脱。‘清净比丘’，是小乘<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，‘诸菩萨’’是修学大乘的人，无论是小乘或大乘，凡持戒清净的人，皆应心怀慈悲，于岐路行，尚且不用脚踏，有生命的青草，何况用手去拔？更何况称为大慈大悲的释子，岂可杀害众生，取其血肉任意食啖？</p>\n<p>　　‘东方’，是在印度之东，即指中国，‘丝绸绢帛’，是中国特产；丝由蚕出，因为养蚕的人，用沸水烫蚕取丝，亦属杀生。‘此土’指印度本土，‘靴履’是用牛皮制造，‘裘’是兽皮，‘毳’是马毛，皆与杀生有关。‘乳酪醍醐’，出自牛身，虽非杀生，食之与牛结下不解之缘，将会障碍解脱。持戒比丘，不止不杀生食肉，亦不食不用与众生身份有关之物，则于世间，得真解脱，无须为酬还宿债，再来三界受生。</p>\n<p>　　‘如人食其地中百谷，足不离地。’是引劫初之人为喻。<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>记载，世界初成，光音<a href=\"/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>，下生人间，原可飞行自在，既善良，又美丽，后因食地中产品，致使足不能离地，而且品性质素与相貌，皆每况愈下。佛言；持戒之人，必须令身心清净，于诸众生，不起杀害之心，以及不起饮食服用之想。众生血肉骨髓，是属于身，裘毳乳酪等是属于身分；求出三界的修行人，必须使自己身无杀业，心无杀念，对于一切众生的身与身分，亦不食其肉，不用其皮，不负命债，不结恶缘，‘身心二涂’，俱断杀因与杀缘，如是三界生缘既断，始得真解脱。</p>\n<p>　　‘如我此说’以下四句，是判决邪正。若如我佛所说：修三摩地，必须次断杀生，则是佛所说的正法，否则，若说食肉，不碍真修，何止伤害慈悲，抑亦令人堕落恶道，不能超出生死，故同于魔说。</p>\n<p>　　1992年，<a href=\"https://www.guang5.com/fjgs/rsgs/344430.html\" class=\"keylink\" target=\"_blank\">王菲</a>皈依<a href=\"/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>：“信佛以后，最大的改变，是整个人宁静起来，不再像以前那么浮躁。”</p>\n<p>　　2008年4月23日，四川，王菲、那英两位歌坛好姐妹到<a href=\"https://www.guang5.com/pic/msgc/gcms/emsfjsd.html\" class=\"keylink\" target=\"_blank\">峨眉山</a>万年寺<a href=\"/rmgjc/chaosheng.html\" class=\"keylink\" target=\"_blank\">朝圣</a><a href=\"/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，受到万年寺监院常性法师及僧众的热情接待。</p>\n<p>　　2009年5月8日，王菲参加陕西<a href=\"/fgsl/slt/29832.html\" class=\"keylink\" target=\"_blank\">法门寺合十舍利塔</a>落成暨<a href=\"/fgsl/fsl/29908.html\" class=\"keylink\" target=\"_blank\">佛指舍利</a>安奉大典大型晚会“法门”的排练，并献唱歌曲《<a href=\"https://www.guang5.com/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">心经</a>》。</p>\n<h3>　　戒偷</h3>\n<p>　　阿难，又复世界，六道众生，其心不偷，则不随其生死相续。汝修三昧，本出尘劳，偷心不除，尘不可出。纵有多智禅定现前，如不断偷，必落邪道；上品精灵，中品妖魅，下品邪人。诸魅所著，彼等群邪，亦有徒众，各各自谓，成无上道。我灭度后，末法之中，多此妖邪，炽盛世间，潜惹奸欺，称善知识，各自谓己，得上人法，弦惑无识，恐令失心，所过之处，其家耗散。</p>\n<p>　　世间物各有主，凡未经他人许可，私自盗取他人财物，或非法强求，都属于偷；偷亦是生死根本之一，故应当戒除。佛言：若果六道众生，其心不偷，则不致随其业力所牵，生死相续不断。否则，诸修行人，原本志在超出尘劳，今因偷心不除，何止尘不可出，反而堕落邪道；即使具有世智辩聪，又能修习有漏禅定，如不断偷，亦难幸免堕落。</p>\n<p>　　‘上品’，指禅智胜于偷心的人，则堕落精灵一类；盗日月的精华，窃山川的灵气，附山托水，惑人祭祀，如山精海怪等，为妖怪的领袖。‘中品’，是禅功智力与偷心相等，则堕为妖魅，即魅魑魍魉，盗人物的津液，窃山川的润气，伺机作孽。‘下品’，是偷心胜于禅定，则堕为邪人，个性邪僻，每为精灵所附，妖魅所迷，诳言欺世，诡异惑俗。</p>\n<p>　　此等鬼怪，亦各有徒众，邪知邪见，邪言邪语，欺世盗名，受人供养，各各自谓，己‘得上人法’；上人之法即是菩萨法，以菩萨居声闻之上故。尤其是佛灭度后，末法时期，此类鬼怪，或潜迹于都市人潮中，或藏匿于偏僻郊野之间，妖言妖行，称善知识。或自言是佛菩萨再来，散播谣言，或言大水将至，应急避之；或言世界末日，大祸临头，要择地搬迁，诱惑无知无识的人，令人恐怖，对现实环境，失去<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>而求助于他，乘机骗取金钱，使遇上他的人，家财为之耗散。</p>\n<p>　　我教比丘，循方乞食，令其舍贪，成菩提道。诸比丘等，不自熟食，寄于残生，旅泊三界，示一往还，去已无返。云何贼人，假我衣服，稗贩如来，造种种业，皆言佛法？却非出家具戒比丘，为小乘道，由是疑误，无量众生，堕无间狱。</p>\n<p>　　佛制比丘乞食的原因，目的是令人舍弃贪心。因为贪心是根本烦恼之一，不除贪心，绝对不可能成就菩提。佛制比丘，不得自己烹饪熟食，必须循方行乞的意义有四：一福利众生：因为三宝是世间最上<a href=\"/rmgjc/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>，乞食能令施者种福故。二折伏憍慢：乞食可令贵族出家的人，折伏昔日骄慢的习气故。三知身是苦：佛制乞食之法，次第行乞七家，若不得饮食，便应受饥饿，令知身是苦本，而精进办道故。四除滞去执：小乘人执著，滞留深山，离群独居；故佛制乞食，令深入社会，接近大众，以便<a href=\"/rmgjc/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>教化众生故。因为比丘受供完毕，必须为斋主说法，以法施回报众生的财施。</p>\n<p>　　据说：佛在世时，有一位初出家的比丘，虽然没有学问，但很用功，有一天，接受一对老年夫妇的供养。斋毕，夫妇俩敷设高座，请比丘登座说法；自己则跪在座下恭听。初学比丘，既未多闻佛法，又缺乏口才，苦苦思索，不知如何说好，不觉脱口而出：‘苦呀’夫妇俩听了，觉得比丘说的很对，自己年老无子，又疾病缠身，实在太苦；于是叩头礼谢，请师父继续开示。可怜初出家的比丘，想了半天，仍然不知，应该说些什么？但夫妇俩却非常虔诚地等待著，不禁著急起来，大声的说：‘真实是苦呀’说罢离座，急急跑回精舍。岂料，年老的夫妇听了，却共同进入沉思的回忆中，想起贫穷困苦的童年，想起<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>坎坷的少年，再想起艰难奋斗，辛酸劳累的壮年，又想起现在众病煎逼，年老无依的晚年，啊.自己的一生，都是与苦结下不解之缘，想呀，想呀，终于给他们想透了人生真实是苦的<a href=\"/rmgjc/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>，结果，断见惑，证初果。正当他们法喜充满，举头谢师时，己经人去座空，唯有匆匆赶去精舍，当面礼谢法乳之恩。</p>\n<p>　　正在一角<a href=\"/rmgjc/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>的初学比丘，见他们赶来，双双拜倒在前，以为又是请求他开示佛法，心里一急，突然灵光一闪，无漏智慧立即显发，断尽见思烦恼，证得阿<a href=\"/sushi/yaoshan/luohanguo/\" class=\"keylink\" target=\"_blank\">罗汉果</a>。竟然辩才无碍，滔滔不绝的为他们讲解人生真理，令他们知集是苦因，慕灭<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>；而夫妇俩也因圣人比丘的开示，激发善根，立刻舍俗出家，修学佛法，终成圣果。如果初学比丘，不实行佛制乞食，就失去度脱这对夫妇的机会，而自己的道业，也不会被逼速成，由此故事证明乞食，的确是可以随缘教化众生，利己利人。</p>\n<p>　　还有乞食，一可以永除贪欲，令知止足故；二可以永断谄曲，无希望故；三可以现离众苦，无追求故；四可以所在安乐，无积聚故；五可以远离恐怖，不畏盗故；六可以道业易成，无顾恋故。有如是种种因缘，故佛制比丘实行乞食，即使是日无供，也不应自己烹饪熟食。由于饥饿因缘，令知有身是苦，而此无常苦空的色身，只暂时寄居三界而已，终非故乡；犹如旅泊之人，必须回家。在陆地投宿曰旅，在水上住宿曰泊，出家人寄居三界，等如旅客投宿旅泊，应该精进办道，求一生成就，希望有朝一日，子缚既断，果缚亦灭，即可超越三界，一去不还，岂可为此暂时寄居三界的残躯，贪求名闻利养，愚惑众生？</p>\n<p>　　‘云何贼人’以下，是佛痛斥冒充弟子，形似出家，心不入道的人，假借僧服，以助其经营货利，贩卖如来，破坏佛教；或将佛法作人情，以套取他人的供养；或非法说法，法说非法，炫惑世人，却说是真正的佛法。对于真正出家修行，具足<a href=\"/rmgjc/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>，三衣一钵，不积蓄金钱的佛弟子，反被诽谤，视为小乘；而身披袈娑，经营货利，贩卖如来的贼人，却妄自称为大乘菩萨。由于以假乱真，令无量众生，真假莫辨，心生疑惑。或误信邪说，或起邪行，结果，此等贼人，弟子与师，都要堕落无间地狱。</p>\n<p>　　若我灭后，其有比丘，发决定心，修三摩提，能于如来形像之前，身燃一灯，烧一指节，及于身上，燃香一炷。我说是人，无始宿债，一时酬毕，长揖世间，永脱诸漏，虽未即明，无上觉道，是人于法，己决定心。若不为此舍身微因，纵成无为，必还生人，酬其宿债，如我马麦，正等无异。</p>\n<p>　　此是佛教比丘，舍身忏悔。佛灭度后，末法众生，障深智浅，如有出家二众，发大乘心，决定舍诸有为，欲想从耳根进修如幻三摩提者（即修习首楞严王大定的人）。能于如来圣像前，在自己身中，燃灯、烧指、或燃香一炷，以供养佛，必仗佛力加被，销除宿业。</p>\n<p>　　‘无始宿债’，是指众生自从无始时来，因贪心偷盗他人财物，所欠负积累的业债，‘揖别’意即永辞，‘世间’指三界，‘诸漏’指见思二惑，凭此舍身忏悔的功德，即可酬还完毕无始业债，而能长期揖别有漏世间，永远脱离见思二惑，不再漏落三界受生。虽然一时末能明了五十五位真菩提路，但对佛果菩提之法，已经有了进取的决心；终有一天，成等正觉。若然不燃灯燃香，舍身供佛忏悔，则宿债未清，虽得无漏，还要受报；如紫金光<a href=\"/rmgjc/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>，已证圣果，仍为阿阇世王污辱，即使己成佛道，也要来人间酬其宿债。</p>\n<p>　　‘如我马麦，正等无异’，是佛引自己作证。据传记说：昔日舍卫国，毗兰邑，阿耆达王，请佛与五百比丘，到王宫结夏安居，接受三个月的供养。国王非常恭敬，每日亲自入厨，督促厨师设斋供佛及僧。至第七日，为魔所惑，在内宫耽恋五欲，竟然忘记供佛的事，宫人未奉王令，不敢擅自设供。当时有一马夫，减半马麦，供佛及僧，如是三月期满，解夏回精舍时，王始记起，立即设斋供佛，求哀忏悔。</p>\n<p>　　阿难问佛因缘，佛言：过去毗婆尸佛，受王供养，佛僧食毕，为病比丘，取一份供，途经梵志山，梵志闻香心生妒忌，恶口骂言：‘此秃头应食马麦，何与其甘馔’；当时梵志所教的五百童子，亦随其师口出恶言，唯独其中有二人说：此等大德，诚应受人天供养。当时的梵志，就是释尊的前身，五百童子，即今的五百阿<a href=\"/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>，赞佛二人，是现在的<a href=\"/fjrw/zhufopusa/shidadizi/66953.html\" class=\"keylink\" target=\"_blank\">舍利弗</a>与目建连，<a href=\"/rmgjc/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨，就是当时的病比丘。因宿世作此口业，今虽成佛，尚且不免受报，何况盗他人财物，或食众生身分，岂可幸免，不受<a href=\"/rmgjc/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>。所以修行人，非舍身燃灯燃香，供佛忏悔，仰仗诸佛威神之力，销除宿业不可。</p>\n<p>　　汝教世人，修三摩地，后断偷盗，是名如来先佛世尊，第三决定清净明诲。</p>\n<p>　　佛命阿难，转教末法众生，若想修习成佛的大定，应先断淫，次断杀，后断偷。因为淫能障定，杀伤慈悲，偷者负债，都是障道因缘，非断不可。无论古今诸佛，皆以断偷，作为公开教诫众生的清净而又明确的训导。</p>\n<p>　　是故阿难，若不断偷修禅定者，譬喻有人，水灌漏卮，欲求其满，纵经尘劫，终无平复。</p>\n<p>　　佛以譬喻，说明偷盗的过失。若不断偷，以偷盗之心而修禅定的人，犹如有人用水灌入破漏的瓶中，欲想其满，纵然经过尘沙劫数这么长的时间，终不可得。‘卮’是承酒之器，漏喻偷心，水喻定慧，如不断偷，而入三摩地，欲得成就定慧，犹如用水灌入漏卮，欲求其满，縰经尘劫，终无平复。</p>\n<p>　　若诸比丘，衣钵之余，分寸不蓄，乞食余分，施饿众生。于大集会，合掌礼众；有人捶詈，同于称赞；必使身心，二俱捐舍；身肉骨血，与众生共。不将如来，不了义说，回作己解，以误初学；佛印是人，得真三昧。如我所说，名为佛说，不如此说，即波旬说。</p>\n<p>　　释尊劝导修定的人，应舍弃贪嗔痴慢及名利之心。因为杀盗淫的行为，皆导源于人心的贪嗔痴，特别是贪心。由于贪利者夺利，所以社会上处处都有损人利己的人；由于贪财者谋财，所以社会上关于明抢暗偷，谋财害命的新闻时有所闻；由于贪名者盗名，故社会上常有沽名钓誉，自赞毁他的事情发生；由于贪色者劫色，故社会上充满非礼、强奸、轮奸种种罪恶行为；由于贪食者杀生食肉，盗取生物的性命，故社会杀风炽盛，杀家禽，杀走兽，杀海产，杀敌人，杀亲人，甚至杀害自己；使社会充满奸淫邪盗外，还要互相残杀。因此，佛教修行人，要舍贪。一个持戒清净的比丘，除了三衣一钵外，一分钱，一寸衣，亦不积蓄；即使次第行乞所得饮食，多余的亦应布施给饥饿众生，以断除贪心。</p>\n<p>　　‘于大集会，合掌礼众。’是教舍憍慢心，因为<a href=\"/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>平等，一切众生，皆是未来诸佛，应该恭敬<a href=\"/rmgjc/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>，不可轻慢。</p>\n<p>　　‘有人捶骂，同于称赞。’是教舍嗔，虽然被人捶打怒骂，亦应视同赞叹，<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>接受，不生嗔恨。</p>\n<p>　　‘必使身心，二俱捐舍。’是教舍身，亦即舍痴。一般愚昧众生，于自身执为实我，于身外之物，执为属我所有，每为满足个人的占有欲而贪，贪不得就欺骗奸诈，强夺巧取，明抢暗偷，偷他人私有的财物，偷社团公有的物品，偷十方<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>所有的僧物，如是穷年累月，多生多世，由偷心而欠负的业债，必须偿还，三界尚且不可出，何况佛道？因此佛教人舍弃贪嗔痴，断除我法二执，外财固然要舍，连自己身命的内财亦舍，视自己的‘身体骨肉’，与众生所共有，而能实行布施内外之财，广作佛事，心舍身亦舍，身不偷心亦不偷，方可成就不偷之心。</p>\n<p>　　‘不将如来，不了义说’等四句，是教舍名，不了义说是佛权巧方便施设的小乘教，而诸佛教化众生之目的，是欲令一切众生，开示悟入佛的知见，皆共成佛道。犹如本经所显示的如来藏性圆三谛理，正是了义大教。欲修证此了义大教，当戒淫，戒杀，戒偷，还要断除贪嗔痴慢，使身心清净，成就<a href=\"/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>大悲精神，舍巳济人，自利兼他；不应该以如来方便所说的不了义教，作为解释不实行大乘佛法的理由，以维护自己的过失，令初发心学佛的人，发生误解。不淫、不杀、不盗是身清净；不贪、不嗔、不痴、不慢，不求名利，不维护己短，是心清净；身心皆清净，必然得证圆通，故：‘佛印是人，得真三昧。’</p>\n<p>　　‘如我所说’以下，是结成分辨邪正的原则。末法时期，若果有人如佛前面所说：修三摩地，先断淫，次断杀，后断偷，不欺世盗名，不曲解佛意，不文过饰非，才是真正的佛子，即等如是佛所说，否则，持相反的意见，唱相反的论调的，就是属于魔鬼的话，不可轻信。</p>\n<h3>　　戒大妄语</h3>\n<p>　　阿难，如是世界，六道众生，虽则身心，无杀盗淫，三行已圆，若大妄语，即三摩地，不得清净。成爱见魔，失如来种，所谓未得谓得，未证言证；为求世间尊胜第一，谓前人言：我今已得须陀洹果，斯陀含果，阿那含果，阿罗汉道，辟支佛乘，十地地前，诸位菩萨。求彼礼拜，贪其供养，是一颠迦，消灭佛种，如人以刀断多罗木，佛记是人，永殒善根，无复知见，沉三苦海，不成三昧。</p>\n<p>　　妄语，即是说谎，凡颠倒是非，乖曲事实，虚伪夸张，或借词掩饰自己的过失，皆是妄语。若修行人未得开悟言己得，未证圣果言巳证，欺诳世人，贪求名闻利养，是大妄语；大妄语成，必堕无间地狱，永劫沉沦，如何修证佛道？所以佛告阿难，在三界六道之中，假设有人，虽然身心都‘无杀盗淫，三行已圆’，但若犯大妄语戒，则于所修的三摩地，不得清净；必须若身若心，都不诳不妄，言必真实，方名清净。</p>\n<p>　　三行，指慈行，<a href=\"/fjrw/jsrw/zhihang\" class=\"keylink\" target=\"_blank\">智行</a>，梵行。身心不杀，可以成就慈行，是应身如来种；身心不盗，可以成就智行，是报身如来种；身心不淫，可以成就梵行，是法身如来种；修行人断杀盗淫，成就三身如来，是名三行已圆。今因存有贪求名闻利养之心，妄起邪见，口出诳言，犯大妄语戒，则前断淫，断杀，断偷等戒行尽失，已经没有成佛的希望，故言：‘成爱见魔，失如来种。’梵言魔罗，译为扰乱，障碍，破坏，夺命等义，因为烦恼魔能扰乱人心，五阴魔能障碍人修道，天魔能破坏人善根，死魔能夺人性命。修行人贪求名闻利养，求他人尊重自己，是爱魔，妄起邪见，自言证圣，是见魔。</p>\n<p>　　‘所谓未得谓得’以下，是展示其大妄语的行相。大妄语之人，自己未得菩提，而自言已得，未证圣位，而自言己证；其目的无非是追求世间的尊荣<a href=\"/rmgjc/shusheng.html\" class=\"keylink\" target=\"_blank\">殊胜</a>，位居第一。须陀洹，译名预流，是小乘初果；斯陀含译名一来，是二果；阿那含译名不来，是三果；阿罗汉是四果圣人，含有无生，杀贼，应供等三义。辟支佛译名缘觉，位居四果之上，阿罗汉但断见思烦恼，辟支佛兼除习气。‘十地地前诸位菩萨’，正显其妄语之大，不仅对人言：自己已证二乘圣果，甚至说：自己已经是十地以前，十住，十行，十回向三贤位的菩萨，或自称是地上菩萨；希望他人尊重供养，向自己礼拜忏悔。</p>\n<p>　　‘一颠迦’，亦名一阐提，译名无善心，或断善根。大妄语之人，出言诳妄自大，梵行不立，唯名利是求，成佛无望，如恶心狂人，故名一颠迦。‘多罗木’，又名贝多罗树，树叶长广光滑，古印度人往往采用此树叶写经；但其树身一枝直上，以刀断之，则不再生。佛以此譬喻大妄语人，以魔刀剑，自断善根，故‘佛记是人，永殒善根’，无复正知<a href=\"/rmgjc/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>，将永远沉沦三涂苦海，纵有禅智，只是魔业，不能修成真三昧。</p>\n<p>　　我灭度后，敕诸菩萨，及阿罗汉，应身生彼末法之中，作种种形，度诸轮转。或作<a href=\"/rmgjc/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>，白衣<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>，人王，宰官，童男，童女，如是乃至淫女寡妇，奸、偷、屠、贩，与其同事，称赞佛乘，令其身心，入三摩地；终不自言，我真菩萨，真阿罗汉，泄佛密因，轻言末学。唯除命终，阴有遗付，云何是人，惑乱众生，成大妄语。</p>\n<p>　　末法时代，魔强法弱，众生特别苦恼，所以佛敕诸大菩萨再来人间，现种种身，说种种法，教化众生，摧邪显正。‘作种种形’，是随类应身，应以何身得度者，即现何身而为说法。‘度诸轮转’，是令众生舍邪归正，解脱生死轮回之苦。‘或作沙门’等四句，是现顺行，‘如是乃至’等三句，是现逆行，无论是现顺行或逆行，都是实行菩萨四摄法中的同事摄，目的是要深入社会，与各阶层人物接触，或与其同事共行，伺机教化，令入佛知见，以收潜移默化的效益。</p>\n<p>　　虽然此等出家勤修<a href=\"/rmgjc/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>，息灭贪嗔痴的沙门，或白衣居士，甚至‘奸偷屠贩’之辈，都是菩萨再来的应化身，但在世时绝不会对人言，自己是菩萨，是阿罗汉，以泄漏佛敕令再来救世的秘密；反而轻言自己是晚辈、是末学。‘唯除命终’二句，显圣人应世，住则不泄，泄则不住；故除临终舍报，暗中遗言付嘱外，绝不自认是菩萨再来，或是佛应世。</p>\n<p>　　如丰干禅师，是阿弥陀佛应世，出自寒山大士之口。据传说：丰干禅师，住于<a href=\"/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>山国清寺碾米房，常骑虎出入，众皆不知其是何人。一日丰干邀寒山、拾得同朝<a href=\"https://www.guang5.com/fjsy/fengmao/6503.html\" class=\"keylink\" target=\"_blank\">五台山</a>言：‘与我同行，是我同流；不与我同行，不是我同流’。寒山问：‘汝朝五台作什么？’干言：‘朝礼文殊’。寒山言：‘汝不是我同流，我不与汝同行’。于是丰干独行，至杭州，适有闾邱胤被朝廷派任台州剌史，忽患头痛，医药罔效。丰干特别往访，取一杯水，持咒完毕，以水置手心，向其头三扑，痛即止；胤非常感激，问来自何处？丰干答：‘住在天台山国清寺’。问：‘寺中大师有道行者几人？’干言：‘我无道行，寺中高僧如文殊化身的寒山子，普贤化身的拾得，皆在寺中游化人间’。胤备厚礼酬谢，丰干不受而去。</p>\n<p>　　三日后，刺史去国清寺礼佛，问知客师：寒山、拾得二大士何在？知客师说：此二人是疯僧，可命来相见。胤言：不可，坚持要亲往拜见。知客遂陪往厨房，见寒山、拾得，正在灶门烘火，二人且言且笑，他人都不识其所言何语。胤上前即拜，二人狂奔，胤追至寒山岩，二人入，寒山回头说：‘贼.贼.丰干饶舌，弥陀不事，礼我何谓？’胤随入岩中，不见二人，自此不复再见寒山、拾得，出现于人间。又如弥勒菩萨，应身布袋和尚，将舍寿时，留偈示人：‘弥勒真弥勒，化身千百亿，时时示世人，世人那得识。’所以古人说：‘真人不露相，露相非真人。’</p>\n<p>　　‘云何’，是斥责词，‘贼人’，指失如来种，成爱见魔的人。真是佛菩萨再来，是阿罗汉应世，尚且不露真相，而此堕爱见魔的人，未得菩提而言得，未证圣果而言证，迷惑扰乱世间无知众生，正是妄语中最大，罪业最深重的大妄语。</p>\n<p>　　汝教世人修三摩地，后复断除，诸大妄语，是名如来，先佛世尊，第四决定清净明诲。</p>\n<p>　　佛敕令阿难，于末法时代现身说法，教人修习首楞严王大定时，在断淫、断杀、断偷之后，还要断除诸大妄语。不得自称圣人，愚惑众生。此不但是今佛如来，亦是过去诸佛世尊，第四种清净决定，明智的教诲。</p>\n<p>　　是故阿难，若不断其大妄语者，如刻人粪，为栴檀形，欲求香气，无有是处。</p>\n<p>　　佛以譬喻，说明妄语之过。凡夫妄语如人之干粪，诸佛功德，如栴檀木；禅定真修，犹如雕刻。以妄语的秽因，欲求佛果妙香，正如雕刻人粪，欲成为栴檀形，因果不类，怎可成功？故言：无有是处。</p>\n<p>　　我教比丘，直心道场，于四威仪，一切行中，尚无虚假，云何自称，得上人法？譬喻穷人，妄号帝王，自取诛灭；况复法王，如何妄窃？因地不真，果招迂曲，求佛菩提，如噬脐人，欲谁成就？</p>\n<p>　　佛教诫修行人，必须断大妄语。直心，即无虚伪歪曲的真心。依不诳不妄的真心而修，必然成就道业。故言：‘直心道场’。维摩经亦说：‘直心是道场’，<a href=\"https://www.guang5.com/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">华严经</a>说：‘菩提妙法树，生于直心地。’所以佛教出家比丘，于行、住、坐、卧四威仪中，尚且要正直，无得虚假。怎可以妄自称大，说自己已经证得菩萨上人之法？三乘圣人，尚不可窃其位，何况佛是出世法王？修行人未得谓得，未证谓证，即是因地不真实，必招堕落三涂的结果，正如穷苦的人，自称为王，一定被国法所诛，自取灭亡。口脐相距，噬之莫及，喻妄语人，已灭佛种，离佛菩提，日益遥远，欲成就佛道，终不可得。</p>\n<p>　　若诸比丘，心如直弦，一切真实，入三摩地，永无魔事。我印是人，成就菩萨，无上知觉。如我此说，名为佛说，不如此说，即波旬说。</p>\n<p>　　此显示断大妄语的利益。修行人能断大妄语，则心如弓弦之直，无有纡曲之相，行住坐卧，一切时处，悉皆真实，则能直入三摩地，永无魔事。魔事邪险乖曲，今心行正直，魔不得其便，故能永远离诸魔事。佛印证是断大妄语的修行人，必定可以成就菩萨所修的无上知觉。无上知觉即圆通无上正觉的因心，菩萨修习圆通，以无上正知觉的直心为因，以求无上正知觉的佛果菩提，正是因果相类，因果相契。</p>\n<p>　　若能如我佛所说，修习大定之前，一定要断淫、断杀、断偷、断妄，则是正法，名为佛说，不然，即是波旬魔王所说。</p>\n<p>　　以上所说：四种清净明诲，是以正拣邪，令末法众生，去邪就正，否则，修行无益，反增魔眷，岂可不慎？故佛告：</p>\n<p>　　阿难，汝问摄心，我今先说入三摩地，修学妙门，求菩萨道，要先持此四种律仪，皎如冰霜，自不能生一切枝叶，心三口四，生必无因。阿难，如是四事，若不遗失，心尚不缘色香味触，一切魔事，云何发生？</p>\n<p>　　此文是佛结答。因为阿难大开圆解之后，心迹圆明，悲欣交集，欲想利益未来众生，故稽首白佛：‘大悲世尊，我今已悟成佛法门，是中修行，得无疑惑。常闻如来说如是言：自未得度，先度人者，菩萨发心；<a href=\"/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>己圆，能觉他者，如来应世，我虽未度，愿度末劫一切众生。世尊！此诸众生，去佛渐远，邪师说法，如恒河沙；欲摄其心，入三摩地，云何安立道场，远诸魔事，于菩提心，得无退屈？’佛答：‘摄心名戒，因戒生定，因定发慧。’又言：‘云何摄心，我名为戒？’随即宣说以上四种决定清净明诲。今结答言：因为汝阿难问：云何摄心，入三摩地？故我于前先说的四种清净明诲，正是入三摩地应该修学的微妙法门。发心求菩萨道的人，一定要先受持此‘四种律仪’，身心不犯，皎洁清净，犹如冰霜，则于菩提道上，自然不会发生一切烦恼枝叶。</p>\n<p>　　‘心三’，指贪嗔痴，‘口四’，指妄言、绮语、两舌、恶口；贪嗔痴是根本烦恼，身的杀盗淫，与口的妄言、绮语、两舌、恶口皆是枝叶烦恼，人因心有贪嗔痴，所以策动身口作业，今不仅身不杀，不盗，不淫，连心的贪嗔痴亦不起，则根本烦恼既除，枝叶烦恼无从生起，故言：‘生必无因’。</p>\n<p>　　‘如是四事’，指不淫，不杀，不盗，不妄语等四重律仪，若能严持不失，则身心常住于清净律仪中，尚且不攀缘外界的色声香味触法等六尘，又怎可能发生一切魔事呢？当知魔事发生，皆由人内在心魔所引起，今持戒清净，心魔不生，外魔自然不能侵扰。据此可知，四清净明诲，何止是入三摩地的微妙法门，亦是降魔的宝柱，成佛的根本，所以学佛修行的人，非首先受持，佛前面所说的四种清净明诲不可。</p>\n<p>　　其实，不仅是学佛修定的人，要严持以上四种清净明诲，断除杀盗淫妄；即使是普通一般人，亦应该戒杀，戒盗，戒淫，戒妄。因为不杀是仁慈，不盗是正义，不邪淫是守礼，不妄语是守信，仁义礼信，是做人的基本原则，如果做人没有原则，将失人身，堕落三恶道，永劫沉沦，不得超生。</p>\n<p>　　凡是有生命的动物，无不贪生怕死，耐庵道人说：‘有命尽贪生，不分人与畜。’我们爱护自己生命，亦应该爱护他人的生命，不但爱人如己，还要爱护畜生，不应该蓄意杀害一切生物。中国儒家<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>言：‘君子之于禽兽也，见其生，不忍见其死；闻其声，不忍食其肉。’正是居于仁慈爱物之心，不应杀生。</p>\n<p>　　佛在涅槃经说：‘从今日始，不听食肉，应观是食，如子肉想；夫食肉者，断大悲种。’因为佛眼观见六道众生，多生多世轮回六道，曾经互为父母、子女、或师长；何况佛性平等，只因迷悟不同，作业不一，招致果报的形躯各异而已。黄庭坚诗言：‘我肉众生肉，名殊体不殊；原同一种性，只是别形躯。’我们杀生食肉，即等如杀害自己宿世的父母、师长、与子女，甚至可以说：是杀害未来诸佛。既伤慈悲，又损<a href=\"/rmgjc/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>，是以不可杀生食肉。</p>\n<p>　　还有，基于因果定律，杀生食肉的人，必欠负命债，佛说：‘假使百千劫，所作业不忘；因缘聚会时，果报还自受。’从前，有一屠夫以杀羊为业，姓金，人皆称为金屠夫。有一天，金屠夫捆著一头肥羊，正举刀要杀，刚巧文殊菩萨化身的戒禅师经过，待死的羔羊，看见禅师，立即咩咩大叫，希望禅师救它。师对羊说：‘两脚不修，遭此活剥。’羊闻言突然停止呼叫，闭目待死。金屠夫见状，顿悟<a href=\"/fjgs/yggs/243547.html\" class=\"keylink\" target=\"_blank\">因果报应</a>之理，放下屠刀，皈依佛门，乞戒禅师为其剃度出家，法名可化；自此随从禅师学佛，颇有心得。一日向禅师告假，欲往天台山参拜石桥禅师，半途被一群强盗捆绑在树上，正要动手，活剥其皮，盗首走来命众人放他，可化死里逃生，不敢前进，退回戒师处，将途中遇险事奉告，师言：‘不是老僧救汝，己还他八两。’原来及时出现的盗首，正是戒师旳化身；由此故事，可知菩萨度生的权巧方便，也知杀生业报的可畏。所以我们不应该蓄意杀害他人，或杀害一切生物，甚至杀害自己，无论是亲手杀，派人杀，教人杀，直接杀，或间接杀，暗杀，谋杀，凶杀，残杀，一律都要禁止，以免招致冤怨相报的悲惨命运，或引发战争，破坏和平。因为战场上的杀戮，亦是众人同业所感的报应，古人说：‘千百年来碗里羹，冤深似海恨难平；欲知世上刀兵劫，但听屠门夜半声。’</p>\n<p>　　何况肉类含有毒素，肉类带菌，容易传染疾病。因为动物被捕杀时，其恐怖，愤怒，怨恨，悲哀，苦恼的情绪，使其细胞产生毒素；人类将含有毒素的肉类，吃入口中，藏在体内，日积月累，人体细胞自然含有大量毒素，因而引发很多意想不到的疾病。再说：动物本身亦患有种种疾病，人类食用患病动物的血肉，无异是将动物体中各种病菌，直接移植于自己体内。现代科学，已经证明，人类导致肝病，癌症，心脏病，高血糖，高血压，动脉硬化等疾病，皆与肉食有关。我们无论是为了长养慈悲，为了不负孝道，为了避免偿还命债，或是为了<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，都应该戒杀<a href=\"/fangsheng/\" class=\"keylink\" target=\"_blank\">放生</a>，不食众生肉。</p>\n<p>　　可是今日世界，每一角落，都充满杀机，令人恐怖。被称为万物之灵的人类，何止喜欢杀生食肉，还喜欢杀人食人。例如：现在被美国政府拘禁在牢狱中的杀人王，已经杀食十一个人了，而罗马利亚一个变态的心理学家，运用隔地催眠术，在两年内杀害三十七个与自己无怨无仇的人，只是为了试验他的妖术。此外，有人杀害自己的亲生父母，有人杀害自己的亲生骨肉，亦有人杀害曾经与自己山誓海盟，同患难，共困苦的枕边人；甚至有些邪教，强迫教徒集体<a href=\"/rmgjc/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>。也有人不甘受苦，又不愿意独赴黄泉，实行合家自杀，强迫家人随同自己走向死亡，以为这样就可以了结一切恩怨；殊不知自杀是绝对无法解决问题的，反而背了一身罪孽，在阴间流离浪荡，做个无依的孤魂野鬼，直至生缘具足，再来做人，还要继续承受宿生末了的业债。所以佛教世人，皆应戒杀放生，长养慈悲，扩展爱心，不仅要爱护他人，也要爱护自己，不可杀害生物，也不可以自杀。使人与人间，物与物间，互爱互助，互相依赖，共同生存，直接可以停止杀业，保障一切生命的安全；间接可以取消暴力，阻止战争爆发，给人类世界，带来幸福与和平。</p>\n<p>　　偷盗，是属于犯法的行为，既扰乱社会治安，同时威胁他人生命财产的安全，所以修行人固然要断偷心，即使一般市民，亦要戒除偷盗的行为。</p>\n<p>　　偷盗的范围很广，不限于直接明抢暗偷，凡是用不正当的手段，所得非份的财物，都属于偷。因此一个正人君子，应该不贪非份之财，不谋非份之利，不欺骗他人，不强夺巧取，不利用职位令人馈赠财物，不炫耀自己，贪求名闻利养，做到：‘正其义而不谋其利，明其道而不计其功。’以建立完美的人格，以保持人身不失，免堕恶道，酬还宿债。</p>\n<p>　　传说：中国明朝，有一个开设杂货店的人，很快就变为一个大富翁。而且拥有一个儿子，两个孙子，<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>相当美满，但无常终于到来，难免一死。临终时拿一杆称子，交给他的儿子说：这是我赚钱致富的绝招，因为此称杆是特别制造的，中心灌入水银，可以随意运用。他的儿子，想不到自己的父亲，竟然出此下策，欺骗顾客，非常难过，毁了此称杆后，即变卖不动产，救济贫苦大众，为父亲赎罪，忏悔修福。不久，家财已经散尽，那是他们夫妇俩心甘情愿的事，岂料两个儿子，不久相继死亡，使他们痛不欲生，怨恨上天不公平，行善的人，结果不得好报。</p>\n<p>　　一晚，他梦见自己进入一座非常华丽的宫殿，看见有一个类似大官的人，端坐正中，告诉他说：你父致富，是他前生布施修福所致，他今生心术不正，运用卑劣手段，欺骗他人，至死不悟；故天帝派遣两个耗星，做你的儿子，败尽你的家业后，再降火灾，令你衣食不足，短命而死，幸而你存心善良，三年布施，为父忏悔，因此上天收回两个败家子，不久，将降贤子，光耀门户，并增加你的寿命，你应该继续行善修福，不要埋怨上天不公平。但不明因果的人，每为满足私欲，而损人利己，甚至不择手段，欺骗奸诈，谋取厚利，积蓄<a href=\"/rmgjc/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，留给子孙享用，殊不知为富不仁，永无久享，除了要接受法律惩罚，还要接受因果报应，是以佛教世人断偷，以杜绝社会罪恶，以净化人的身心，然后以清净的身心，进修禅定，自可断惑证真。</p>\n<p>　　淫欲，何止是生死根本的根本，亦是违反道德的罪恶行为，所以佛制出家修行，要绝对戒淫，必使淫机，身心俱断，断性亦无，于三摩地，始得清净。在家佛弟子，亦要戒除邪淫，不邪思，不乱伦，不涉足舞场妓馆，不强 暴非礼，做到‘非礼勿视，非礼勿言，非礼勿听。’以免制造人间纠纷，导演<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>悲剧，眼前招惹官非，受人非议，来世还要受妻女不贞，眷属不和的果报。</p>\n<p>　　可惜现代社会，道德沦亡，色 情氾滥，非礼强 奸，偷 情乱 伦，时有所闻。而低级电 影，谈情小 说，黄色架步，充斥市场；致使一般青年，小小年纪，就懂得奸淫邪盗，未婚妈妈，无父孤儿，彼此皆是，何止制造问题儿童，抑亦促使人口膨胀。纵目四观，世界各地，人口膨胀率最高的地方，都是物质缺乏，教育落后的民族；相反，物质富裕，接受高等教育的家庭，大多数都能实行节育。可知纵欲与人口膨胀，皆与教育有关。我们正本清源，要取消社会罪恶，解除人口膨胀的危机，非提高居民的教育水平不可。</p>\n<p>　　特别是要推行佛教的道德教育，实行戒淫，使人清心寡欲，洁身自爱，不致被色 情诱 惑，邪淫乱行，不致见色起心，侵犯他人妻女；即使<a href=\"/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>关系，亦不可恣情纵欲，以保健康。正如八大人觉经所说：‘虽为俗人，不染世乐。’‘志念出家，梵行高远。’做个身虽不出家，心已入道的正信佛弟子，以免堕落色情陷阱，沉溺爱河。当知：‘爱河千尺浪，苦海万重波；欲免轮迥苦，当念阿弥陀。’奈何世人沉迷酒色，不肯学佛，往往爱之深，恨之切；爱之欲其生，恶之欲其死；爱时卿卿我我，山誓海盟，恨时何止一刀两断，且一刀碎尸万段，甚至炸尸食尸，残忍无道，生前要受法律裁判，死后要堕无间地狱，罪毕为人，还要偿还情债、命债，实在苦恼。所以佛制在家佛弟子，要<a href=\"/rmgjc/jiexieyin.html\" class=\"keylink\" target=\"_blank\">戒邪淫</a>。</p>\n<p>　　言语，是人类社会沟通的工具，亦是人与人间情感维系的桥梁，所以当我们运用语言表达意见，或与他人交换意见时，必须据理直说，真实可靠，不可妄言绮语，乖曲事实，不可颠倒是非，虚伪夸张，不可口出恶言，或妒害谗谤，或讥诮辱骂他人；以维护彼此的权益，以保持人格的尊严。</p>\n<p>　　当知言语，可以利人，亦可以伤人，所谓：‘一言兴邦，一言丧邦。’不可不慎。古人说：‘赠人以言，重如珠玉；伤人以言，甚于剑戟。’西哲苏格拉底说：‘天与人以两耳两目，但只有一口，欲使其多见多闻而少言语。’但我们面对的不是你虞我诈，口诛笔伐，就是挑拨离间，恶口漫骂；或自赞毁他，抬高自己，或妄言绮语，欺骗他人。何止破坏人际公共关系，障碍社会正常发展，且制造人间纠纷，世界混乱，令人误解，加深仇恨。</p>\n<p>　　所以佛教弟子，言行要正直，见恶不传，闻过不宣；不为名利而妄自夸大，不因妒忌而挑拨离间，不因嗔恨而恶口粗口骂人，不因取悦于人而花言巧语，不为满足自己，而欺骗对方；直接建立自己的信誉，受人尊敬，保障自己的安全：间接平息社会纷争，维持正常公关，保持彼此信用。特别是修行人，更不可以未得<a href=\"/rmgjc/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>而言已得，未证圣位而言己证，以诳惑世人。否则，若犯大妄语戒，必堕无间地狱，受苦无量，罪毕为人，还要受以下十种恶报：一口气常臭，二善神远离，三虽有实语，人不信受，四智人谋权，常不参预，五常被诽谤，丑恶之声，周闻天下，六人所不敬，虽有教敕，人不承用，七常多忧愁，八种诽谤业因缘，九身坏命终，当堕地狱，十若出为人，常被诽谤（见大智度论）。</p>\n<p>　　综上可知，凡是佛弟子，无论出家或在家，皆应严格遵守，诸佛如来的四种清净明诲，断淫，断杀，断偷，及断大妄语。出家佛弟子，严持四清净明诲，近则梵行清净，远离魔障，出生功德，利己利人；远则，超出尘劳，解脱生死，成就大定，圆证佛果菩提。例如佛在世时，有一比丘，严持妄语戒；一日外出，见一难产妇人，生命危殆，忽然大悲心生，自言：我自皈依如来，严持妄语戒，若然清净，愿以持戒功德，令此难产妇人，脱离危险，顺利生产。刚言毕，哇的一声，婴儿出生，母子平安。由此故事，证明持戒功德，不可思议。</p>\n<p>　　又过去印度迦湿弥罗国，有一毒龙为患，附近有毗诃罗寺，住有五百大阿罗汉，为除此患，共同入定，用尽神通，亦不能驱逐此毒龙。后有一游方僧人至，闻毒龙为害，居民不安，特别往见毒龙，弹指作声，对毒龙说：‘请远离此地’。龙闻言即自动离去。五百大阿罗汉问僧人，入何定可以降伏毒龙？僧人说：我不入定，也不用神通，只是生平严持佛戒，即使轻微小过亦不犯，故能令毒龙害怕，自动离去；可知持戒功德，神通莫及。只要受持一戒清净，功德己不可思议，何况断杀盗淫妄，身心都清净？</p>\n<p>　　在家佛弟子，受持不邪淫戒，可以保障<a href=\"/rmgjc/hunyin.html\" class=\"keylink\" target=\"_blank\">婚姻</a>安全，而建立美满幸福的家庭；受持不杀生戒，可以保障一切生命的安全，令人长养慈悲，扩展爱心；受持不偷盗戒，可以保障人类财产的安全，取消社会罪恶，令人安居乐业；受持不妄语戒：可以保障人间权益的安全，令人建立品德，提高彼此信用，使人际与国际关系，和睦亲善，共存共荣，共享太平。</p>\n<p>　　因此，我们为了个人的修证，为了社会群体各方面的安全与改善，甚至为了保持人身不失，免堕三恶道，都要严持不犯，以上十方如来，所教导的四种清净明诲。</p>\n</div>"
    }
]