[
    {
        "title": "虚云",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x865A;&#x4E91;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022238370.jpg\" /></p>\n<h2>释<a href=\"/rmgjc/xuyun.html\" class=\"keylink\" target=\"_blank\">虚云</a></h2>\n<p>　　虚云禅师（1840--1959），籍湖南湘乡人，生于泉州，俗姓萧，名古岩，字德清，六十岁后改字幻游，号虚云，乃近代“一身而系五宗法脉”之<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>大德。</p>\n<p>　　虚云禅师，十九岁<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，二十岁依福州鼓山涌泉寺妙莲老和尚受具足戒；四十岁发心朝<a href=\"https://www.guang5.com/fjsy/fengmao/6503.html\" class=\"keylink\" target=\"_blank\">五台山</a>，以报父母深恩，由普陀山法华寺起香，三步一拜备受饥寒而道心愈朗，三年遂愿；终于到达五台山，亲见<a href=\"/fjrw/zhufopusa/pusa/66965.html\" class=\"keylink\" target=\"_blank\">文殊菩萨</a>金颜。后在滇中阐教近二十年；九十五岁返曹溪，重建南华，中兴云门。历任福建鼓山、广东南华、云门大觉诸大寺院住持。1953年发起成立<a href=\"/\" class=\"keylink\" target=\"_blank\">中国佛教</a>协会，被选举为名誉会长。时年，当选为全国政协委员。</p>\n<p>　　虚云禅师一生一衲、一杖、一笠、一钟行遍天下，由自度而度人。于一九五九年农历九月十二日元寂，世寿一百二十岁，戒腊一百零一。</p>\n<p>　　虚云禅师作为近代禅门泰斗，其主要<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>界所做出的贡献除了上述恢复重兴寺院功德之外，更重要的是为后世禅宗复兴而选择培养储备了大量的<a href=\"/rmgjc/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a><a href=\"/fxwd/jsrwwd/\" class=\"keylink\" target=\"_blank\">居士</a>和弘法高僧，其门下嗣祖<a href=\"/rmgjc/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>较为著名的有十余人，其中释一诚[1]  、释传印[2]  两位大德高僧先后担任中国佛教协会会长。</p>\n<h2>人物生平</h2>\n<p>　　虚云禅师，原籍湖南湘乡，俗名萧古岩，字德清，别号幻游。出生在福建泉州，出生年有不同<a href=\"/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，岑学吕编年谱言出生道光二十年（1840年）；出生时母亲就去世，后由庶母抚养长大。父亲萧玉堂公宦游福建，在永春州衙任幕僚，后来受聘入泉州府幕。虚云禅师幼时，从师读儒书，18岁离湘至闽，19岁至福建鼓山涌泉寺出家，拜常开为师。次年依妙莲(1824－1907)<a href=\"/rmgjc/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。</p>\n<p>　　清光绪十八年（1892）受<a href=\"/cz/czwj/244396.html\" class=\"keylink\" target=\"_blank\">临济宗</a>衣钵于妙莲和尚，受曹洞宗衣钵于耀成和尚。出家后勤修苦行。27岁离鼓山，先后在江浙名山大刹参访耆宿，研习经教，参究禅宗。此后又参访陕西终南山、四川<a href=\"https://www.guang5.com/pic/msgc/gcms/emsfjsd.html\" class=\"keylink\" target=\"_blank\">峨眉山</a>、拉萨三大寺，并由西藏到印度、锡兰（今斯里兰卡）、缅甸等国，朝<a href=\"/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>迹。由缅甸回国，<a href=\"https://www.guang5.com/rmgjc/chaobai.html\" class=\"keylink\" target=\"_blank\">朝拜</a>云南鸡足山，经贵州、湖南、湖北等地，礼安徽九华山，再至扬州高旻寺参加禅七法会，在赤山法忍和尚处获悟。</p>\n<p>　　光绪二十七年（1901）至终南山结茅潜修两年。后至鸡足山主持钵盂庵，自往南洋等地募缘建寺，至宣统元年（1909）自北京请得《龙藏》全部回鸡足山，敕改钵盂庵为护国祝圣寺。</p>\n<p>　　1912年中华民国建立，出现逐僧毁寺风潮。滇军师长亲自督军上山捉拿虚云，虚云只身与其讲理，被折服而一改初衷支持虚云。民国七年(1918），虚云自南洋请玉佛回祝圣寺，并重建庙宇。此后，应滇、粤、闽军政大员之请，曾移锡昆明华亭寺，住持鼓山，重兴曹溪六祖道场南华寺。民国三十一年冬赴重庆主持护国息灾大悲法会，历时3个多月。民国三十二年冬，规划重兴粤北云门山大觉寺。</p>\n<p>　　1952年4月虚云离云门北上，11月在北京出席中国佛教协会发起人会议，并被推为首席发起人。1953年6月3日中国佛教协会正式成立，虚云被选举为名誉会长。是年，虚云被聘为全国政协委员。1959年10月13日，<a href=\"/fjrw/hcrw/xuyunfashi/\" class=\"keylink\" target=\"_blank\">虚云法师</a>在江西云居山真如寺圆寂。世寿一百二十，戒腊一百零一。</p>\n<p>　　在现代佛教史上，坚持苦行长达百余年，历坐15个道场，重兴6大祖庭，以一身兼承禅门5宗，法嗣<a href=\"/rmgjc/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>达数百万众的高僧，唯有禅宗泰斗之誉的虚云。</p>\n<h3>　　降生</h3>\n<p>　　之父玉堂公年逾四十无子，他的夫人颜氏在永春州的观音寺祈子，夫妇二人夜间同梦一长须著青袍者，头顶观音跨虎而来，跃卧榻上，二人惊起互告，颜氏遂有娠。第二年在泉州生下了虚云和尚。据老和尚的《自述年谱》上说，他初生下来时是一个肉团，颜氏夫人骇恸，气壅而死。第二天有卖药翁来，剖开肉团，得一男婴，这就是后来的虚云和尚。所以虚云自幼是由庶母王氏抚育成人的。</p>\n<p>　　他幼时在泉州府衙，从师读儒书。十三岁的时候，祖母逝世，他随父送祖母及生母灵柩返湘乡安葬。家中作佛事，他见佛像经书、三宝法物，心生<a href=\"/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。十七岁时潜离家乡，想到南岳衡山出家，行至半道被截回。玉堂公怕他再出家，为他娶了两房妻子-他兼祧他的叔父，所以早几年就为他订下田氏和谭氏二妻。他婚后与二女同居而无染。</p>\n<h3>　　出家</h3>\n<p>　　虚云禅师自幼即厌荤食，性喜恬淡。十三岁，跟随父亲奉生母祖母灵柩回老家安葬。葬礼之中，初见三宝法物，有喜欢之心，从此渐弃举子业而嗜佛典。随之，萌发弃世出俗之愿。十七岁，曾只身欲往南岳衡山出家，行至半道被截回。后来又被父亲强徙至福州，并为之娶回田、谭二氏，强禁锢同居于一室。虚云却居内而无染。久之，出尘之志益坚。到清咸丰八年（1858），赋《皮袋歌》留别田、谭二氏，偕从弟潜至鼓山涌泉寺，投常开老人坐下出家，取法名古严，又名演澈，法号德清，即虔心奉佛，诵<a href=\"/rmgjc/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>书，习学仪规。次年，依妙莲受具足戒。这时玉堂公仍在泉州，曾派人四处寻访。虚云和尚怕被家人找到，便隐居在山后的岩洞中不敢露面。他在洞中礼万佛忏，<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>不辍。这样在后山一住三年，后来听说玉堂公已告老返回湘乡，他才回到寺内，担任职事。</p>\n<p>　　他在鼓山寺任过水头、园头、行堂、典座一类职事，过了四年之久，然后辞去职事，又回到后山岩洞中修苦行。在后山，居则岩穴，食则松果，渴饮涧水，髡发覆肩，衣不蔽体，如此又过了数年。后来受到一位行脚禅人的指点，便到<a href=\"/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>山的华顶龙泉庵，参谒融镜老法师。融镜见他蓬首垢面、衣不蔽体，问其所以，他略述在岩洞中修行的经过。八十多岁的老法师责之曰：你的这种作为，近于外道，而非正路，枉费了十年功夫，就算你修行有成，证到初果，亦不过是个自了汉。发菩提心，上求下化，自度度人，才是修行的正途。这时老法师赠他衫裤衣履，令他剃发沐浴，留他在庵中住下来。他从老法师学天台教观，过了两年，老法师又命他到国清寺参学“禅制”，到方广寺习《法华》，他也常回茅庵与老法师作伴。到光绪元年，是年他已三十六岁。他到高明寺听敏曦法师讲《<a href=\"https://www.guang5.com/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>》完毕，辞别融镜老法师下山，行脚天涯，参访学道。</p>\n<h3>　　参悟</h3>\n<p>　　他初渡海到普陀山，遍参各寺刹；继到宁波阿育王寺拜<a href=\"/fgsl/fsl/\" class=\"keylink\" target=\"_blank\">佛舍利</a>，到杭州礼天朗和尚，到天宁寺礼清光和尚，到焦山礼大水和尚，到金山亲近观心、新林、大定等和尚，到扬州高旻寺礼朗辉和尚，他到焦山时，清廷名将彭玉麟督水师驻焦山，曾数度约他谈论<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>及修行途径，对他深生敬信。到了光绪八年（一八八二年），他二度朝礼普陀，为报亲恩，再礼五台。是年七月一日，自普陀法华庵起香，三步一拜，一直拜到五台山。初开始时，有偏真、秋凝等四僧附香，渡海由宁波登陆，向北前进，过了苏州、常州，天候渐冷，四位附香者先后退出。他一个人<a href=\"/rmgjc/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>前进，经南京渡江到浦口，在狮子山寺挂单过年。过了春节，再由狮子山寺起香，经苏北入河南，经<a href=\"https://www.guang5.com/fjsy/sydq/5601.html\" class=\"keylink\" target=\"_blank\">嵩山少林</a>寺、洛阳白马寺，到了腊月，拜到黄河边的铁谢渡。渡过黄河，错过宿店，在路边一个茅棚中度夜。后半夜大雪纷飞，黎明后积雪盈尺，过往无人，他在茅棚中枯坐<a href=\"/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>，饥寒交迫，日复一日，到了第六日终至陷入昏迷状态。后来得一姓“文”名“吉”之丐者相救，得继续前进，拜到豫北怀庆府，在洪福寺挂单过年。正月初二再起香前进，拜到五月底终于拜到五台山的显通寺。自光绪八年七月由南普陀起香，到十年五月到显通寺，途中足足跪拜了二十三个月，这种毅力，实不是常人所能及！</p>\n<p>　　这年下半年，他礼拜北岳恒山、西岳华山。翌年春抵西安，礼慈恩寺大雁塔、华严寺杜顺和尚塔、清凉国师塔，及兴教寺玄奘法师塔。然后入终南山，在南五台结茅修行。这时在南五台结茅的，还有觉朗、冶开、法忍、体安、法性诸师，虚云与诸师同参究，他<a href=\"/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>甚有<a href=\"/rmgjc/raoyi.html\" class=\"keylink\" target=\"_blank\">饶益</a>。在终南结茅两年余，他下山后，在西安附近，礼道宣祖师塔，礼鸠摩罗什道场，然后越秦岭，入子午谷，经汉中，入剑门到了四川。第二年到成都，上峨眉山金顶进香。然后渡泸水，经打箭炉入西藏。到了拉萨，礼布达拉宫（达赖活佛坐床之所）；也到了札什伦布，礼札什伦布寺（班禅活佛坐床之所），他这一年登山涉水，遍游川藏，岁暮在拉萨过年。</p>\n<p>　　光绪十五年（一八八九年），这一年他年已五十岁。因不愿在西藏久留，开春南行，经不丹国，翻越重山峻岭（事实上就是喜马拉雅山），到了印度。朝礼圣迹后，又渡海到锡兰，然后又到了缅甸。这样兜了个大圈子，是年七月启程回国，由腊戌过汉龙关。入云南境，到了大理。他回国的初愿是朝鸡足山，礼迦叶尊者道场。七月底，他到了鸡足山，进香礼拜。又登山顶天柱峰，礼楞严塔。鸡足山全盛时，有三百六十庵、七十二大寺。而虚云和尚到时，全山不足十寺，都是子孙庙，不许外地<a href=\"/rmgjc/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>挂单。他叹息不已，下山而去。</p>\n<p>　　以后两年，他仍在各地参访。到衡阳岐山寺礼恒志和尚，到武昌宝通寺礼志摩和尚，学“大悲忏”法，到庐山海会寺礼志善和尚，到九华山礼宝悟和尚，到宝华山礼体性和尚；以及到宜兴礼仁智和尚，到句容礼法忍和尚。光绪十七年（一八九一年），在南京净成寺，与杨仁山居士往来，讨论《因明论》、《般若灯论》。以后又到九华山结茅修行。这样到了光绪二十一年（一八九五年），扬州高旻寺住持月朗约他到扬州做<a href=\"/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>，他渡江时失足堕水，甘自一昼夜，为渔者所救，把他送到宝积寺，醒过来时，七孔流血不止。后来到了高旻寺，月郎分派他职事，他不接受，只求在堂中打七，月朗以为他“慢众”，当堂打香板，他顺受不语。后来宝积寺僧到了高旻，说出他堕水获救那一段事，才免去禅堂职事，他得便专心修行。</p>\n<h3>　　开悟</h3>\n<p>　　虚云禅师在高旻寺禅堂修行那段时间，万念顿息，工夫“落堂”。昼夜如一，行动如飞。一夕，夜间放香时，他开目一看，见大光明如同白昼，内外洞彻，隔墙见香灯师供水，远及河中行船，岸上树色，悉皆了见。到腊月的第八个禅七中，第三天夜晚，六枝香开静时，护七照例冲开水，热水溅手，茶水外溅，一声破碎，顿断疑根，如从梦醒-他开悟了。他述偈曰：</p>\n<p>　　杯子扑落地，响声明历历。</p>\n<p>　　<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>粉碎也，狂心当下息。</p>\n<p>　　这年在镇江金山寺过戒期，在扬州重宁寺助理道明和尚。智通法师在焦山讲《<a href=\"https://www.guang5.com/fojing/lengyanjing/\" class=\"keylink\" target=\"_blank\">楞严经</a>》，请他讲偏座；翌年他又重到宁波阿育王寺礼<a href=\"/fgsl/\" class=\"keylink\" target=\"_blank\">舍利</a>，燃指供佛，<a href=\"/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>慈亲。宁波七塔寺请默庵法师讲《法华经》，请他去任附讲。讲经毕，又到丹阳，助结森、宝林二师重修仙台观，以后又到赤山与法忍和尚结茅共修。到了光绪二十六年（一九〇〇年），他年已六十一岁，在江浙一带参访也时近十年，他又动远游之念，想再朝五台山，然后到终南山潜修。他辞别法忍和尚，先到扬州朝云台山，继到山东朝东岳泰山，再到牢山礼憨山老人的海印寺，以后又到曲阜礼孔庙、孔陵，再西行北上到五台山。在五台行香毕，原想到终南山，这时义和团之乱日炽，行旅不便，就近回到北京，驻锡城南龙泉寺。这时他已颇著声誉，肃亲王善耆的太福晋对他执<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>礼，一些王公大臣也来参叩。</p>\n<p>　　到了五、六月间，京中团乱愈烈，杀德国公使，围攻使馆区，清廷且下诏与各国宣战。六月天津失守，七月北京沦陷。西太后挟光绪帝匆匆西逃。这时朝中有参谒过虚云和尚的王公大臣，关心他的安危，劝他同众人随驾出京，他就在兵荒马乱中随扈跸西行，到了西安。这时护驾大臣岑春煊请他在卧龙寺建息灾法会。佛事毕，他以西安嚣烦，十月间潜离西安，到终南山结茅修行。山中同<a href=\"/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>侣不少，翌年赤山法忍老人也到了山中。</p>\n<p>　　这一年岁暮，大雪封山，严寒彻骨，他独居茅棚，身心清净。一日他在釜中煮上<a href=\"/sushi/shucai/yutou/\" class=\"keylink\" target=\"_blank\">芋头</a>，结跏趺坐待熟，不觉入定。到了新岁，邻棚的复成师等去给他贺岁，见棚外虎迹遍满，入棚见他在定中，乃以磬开静，问他吃饭否？他答：“尚未，釜中的芋头大约已熟了。”开釜一看，釜中坚冰如石，原来他入定不觉已半月之久。他自此改名“虚云”。在此以前，人都称他为德清师。</p>\n<p>　　是年下半年，他再礼四川峨眉、云南鸡足，年终前到了昆明，在福兴寺<a href=\"/rmgjc/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>，年余后出关，在归化寺讲《<a href=\"https://www.guang5.com/fojing/yuanjuejing/\" class=\"keylink\" target=\"_blank\">圆觉经</a>》、《<a href=\"https://www.guang5.com/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>》，皈依者三千多人。秋季在筇竹寺传戒。继之大理的提督张松林，亲率官绅，迎他到大理府，住三塔崇圣寺，讲《法华经》。皈依者亦数千人。这时张提督和一位李军门欲留他住持崇圣寺，他希望在鸡足山能够有一个地方，开单接众，以恢复迦叶道场。众人称善，乃命宾川县知县办理。知县在山中觅得一破院，名叫钵盂庵，交给虚云和尚居住，至此他终偿宿愿，在鸡足山有了立足之所。</p>\n<h3>　　弘法</h3>\n<p>　　他在钵盂庵开单接众，四众闻风而至者颇伙，这时他急于重修寺宇，必须募化，但这不是边郡民力之所及，所以他留下一位戒尘师料理内务，他自己只身往南洋。途中在南甸太平寺讲《阿弥陀经》，在仰光、<a href=\"/sushi/shuiguo/binglang/\" class=\"keylink\" target=\"_blank\">槟榔</a>屿各有停留，在麻六甲青云亭讲《<a href=\"https://www.guang5.com/fojing/yaoshijing/\" class=\"keylink\" target=\"_blank\">药师经</a>》，在吉隆坡<a href=\"/rmgjc/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>寺讲《<a href=\"https://www.guang5.com/fojing/lengjiajing/\" class=\"keylink\" target=\"_blank\">楞伽经</a>》。各地均有弟子皈依，前后万余人。这时接到云南全体僧众来电，谓政府要征提寺产，宁波天童寺的寄禅和尚有电来约，促他及早回国。他在光绪三十二年（一九〇六年）春季回到了上海。</p>\n<p>　　在上海与佛教会代表寄禅等会合，同进京请愿，抵京住在贤良寺，朝中的僧录司法安、龙泉寺住持道兴、观音寺住持觉光等接待他们。肃亲王善耆也请他到府中为大福晋说法。庚子年在京中相识的一些王公大臣也都来探视，研究如何给皇帝上奏章。由于诸护法的相助，光绪帝下了一道上谕，谕知地方官不得勒捐寺产，著征提寺产风波始告一段落。</p>\n<p>　　虚云以清朝开国以来，对云南一地没有颁发过《<a href=\"https://www.guang5.com/fojing/dzj/\" class=\"keylink\" target=\"_blank\">大藏经</a>》，商请诸位护法奏请朝廷，给云南颁发一部《龙藏》。此事由肃亲王发起上奏，光绪三十二年（一九〇六年）七月奉到上谕，把鸡足山的钵盂寺改名护国祝圣禅寺，钦赐《龙藏》一部，銮驾全副护送《龙藏》到山，赐虚云和尚紫衣、玉印，并赐封号为“佛慈弘法大师”。这在当时是一份难得的殊荣。</p>\n<p>　　光绪末年那一段时间，虚云到南洋弘化，并为祝圣寺募款。他在暹罗龙泉寺讲经时，一日趺坐入定，一定九日，这一来哄动了暹京，自国王大臣至善男信女咸来罗拜，国王请他到宫中讲经，百般供养，官民皈依者数千人。这一次南洋弘化两年余，直到宣统元年（一九〇九年）始由仰光回云南。</p>\n<p>　　宣统三年（一九一一年），虚云和尚在鸡足山祝圣寺传戒，继之又结禅七七四十九日。九月武汉革命的消息传到滇中，地方大乱。统兵官李根源排斥佛教，率兵入鸡足山，欲拆寺逐僧，经他出面解释，李根源<a href=\"/fxrm/fxkb/xgfjlhh/1086.html\" class=\"keylink\" target=\"_blank\">皈依三宝</a>，引兵而去。以后李氏维护佛教甚力。</p>\n<p>　　民国元年（1912），虚云和尚已七十三岁，老和尚是年在云南成立了佛教分会，该会初创，许多事情要和官厅接头，而民政长罗容轩对佛教有成见，事多阻碍难行。滇督蔡松坡时为调解，亦不得<a href=\"/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。民国二年（1913），老和尚到北京请内阁总理熊希龄帮忙，熊把罗容轩调到北京，以任可澄为云南巡按使，老和尚亦回到云南，推动佛教会事务。翌年他把会务委人办理，回到鸡足山。</p>\n<p>　　民国七年（1918），滇督唐继尧派员迎他到昆明，年底到达，住圆通寺。适欧阳竟无带著弟子吕秋逸，为筹募支那内学院经费之事亦到昆明，同住圆通寺，老和尚请竟无为他讲《摄大乘论》。民国八年（1919）春，老和尚在昆明忠烈祠建水陆道场49日。是岁留在昆明。民国九年（1920）春又建水陆道场，法会结束继之讲经。这时唐督请他复兴昆明西山已荒废了的华亭寺，就是后来的云栖寺。他接受了唐督的聘帖，担下了重建云栖的重任。民国十年（1921），顾品珍督滇，二月以后，天雨不止，城内可以行舟；七月以后，干旱不雨，到了冬天，河内可以扬尘。秋天时疫流行，死人数千。在这种情形下，重建云栖的事就搁置下来</p>\n<h3>　　建寺</h3>\n<p>　　一九一二年，应僧众电请，抵沪联络僧界，并为代表赴宁谒孙中山先生。次年，参加筹组中华佛教总会并出席成立大会。返回滇省，主持省分会会务。一九一八年主持昆明云栖寺修复，同时参与或主持兴福寺、节竹寺、胜因寺、松隐寺、太华寺、普贤寺等的修复。为此艰辛操劳，长达十余年之。到一九三四年，应闽省主席扬幼京等之请出任福州鼓山涌泉寺方丈。从此，又积十八年心血，全心护持祖庭。兴规矩，肃寺风，颁规约，创办佛学院，培育僧才。同时，应结外缘，多方募化，修葺寺宇，重建楼阁，添买田亩，兴办林场，弘扬农禅。数年之后，寺貌一新，名闻遐迩。期间，亲自主持整理佛籍，重秘本修纂山志。</p>\n<p>　　民国十一年（1922）才开始动工。老和尚逐日亲督工作，惨澹经营，为时三年，规模粗具，以后即每年在寺中开单接众，传戒讲经。到了民国十七年（1928），他为筹募云栖圣像款，与王九龄居士同到香港。这时陈铭枢主粤政，接老和尚到广州，想请他住持曹溪南华寺，他谢绝，经厦门转福州，回到他七十年前出家的鼓山寺探视，并在寺中讲经。讲毕，再到宁波阿育王寺拜舍利，朝普陀山，回上海度岁。翌年回到福州鼓山寺，闽省主席杨树庄，及前主席方声涛，率官绅恳切劝请，留他主持鼓山寺。他以鼓山是他剃染初地，缅怀祖德，义不可辞，遂就任。以后数年，在鼓山讲经传戒，修缮寺院，并整顿鼓山佛学院，请慈舟法师主持院务。这样到了民国二十三年（一九三四年），鼓山寺方理出头绪来。而此时驻兵粤北的绥靖主任李汉魂坚请他到粤住持南华寺。他以六祖道场有重修的必要，这样又到了南华。</p>\n<p>　　南华寺是唐代大鉴禅师六祖惠能的道场，寺中有六祖的真身在。但已荒圮多年，无人过问。老和尚初到南华时，殿宇已倾，房屋破坏。只得搭盖葵蓬竹屋，暂以住众。然后筹募款项，购材募工，开始了南华重建的工作。经他惨澹经营，历时十年，直到民国三十三年（一九四四年)始竣工。他写了一篇《重兴曹溪南华寺记》以记其事。在这十年之中，民国二十六年（一九<a href=\"/sushi/yaoshan/sanqi/\" class=\"keylink\" target=\"_blank\">三七</a>年）年开始八年抗战，二十六年广州沦陷，各地僧人都投奔南华寺。南华容纳不下，他重修了韶州曲江的大鉴寺和月华寺作为南华下院，以容纳各地来投的僧侣。民国三十一年（一九四二年）他应国府主席林子超的邀请，到重庆启建了一场息灾法会。民国三十三年（一九四四年）南华重建告一段落，他又担起了中兴云门的重任。</p>\n<p>　　云门寺是云门宗始创者文偃禅师的道场。数年前老和尚途经该地，见荆棘丛中残存破寺及祖师肉身一尊，老和尚见祖庭沦落至此，凄然泪下。便中言之于广东绥靖主任李济深、省主席李汉魂。到南华工程结束，二李又请老和尚重兴祖庭，并亲送老和尚至云门驻锡，老和尚又开始了筚路蓝褛、重建云门的生涯，而是年他已高龄一百零五岁。</p>\n<p>　　由民国三十三（一九四四年）年到民国三十八年（一九四九年），云门的殿宇堂寮完成了十之八九，殿中圣像八十余尊，也铺金设座告竣。</p>\n<h3>　　遇劫</h3>\n<p>　　1951年的春节期中，发生了震惊全国的“云门事变”。三月，寺中在开戒期间，一日，地方干部及民兵百余人包围了云门寺，将老和尚拘禁于方丈室，将百余僧侣分别囚于禅堂及法堂，干部大肆搜索，上自瓦盖，下及地砖，搜了两日，未搜到金银财物，乃殴打众僧，亦无所获，最后数大汉以木棒铁棍殴打老和尚，逼其交出金银财物，打得老和尚五窍流血，肋骨断折。老和尚深入<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，苦乐俱捐，多次殴打始终不死，干部们不敢再打。直到五月间“云门事变”传到韶州，大鉴寺僧人通知海内外同门，联合营救。后来北京方面电令地方政府严查，云门之围始解。</p>\n<p>　　一九五二年春，北京政府电粤，派员护送老和尚入京。七月抵京，李济深、陈铭枢、叶遐庵、<a href=\"https://www.liaotuo.com/wenda/jushi/78064.html\" class=\"keylink\" target=\"_blank\">赵朴初</a>等迎老和尚于火车站，驻锡于广化寺。中国佛教协会成立，要推举老和尚任会长，老和尚坚辞，挂了个名誉会长的名义。十月到上海主持了一场祝愿世界和平法会，一九五三年回到云门。</p>\n<p>　　在云门最后几年，他仍开堂传戒，日有开示。</p>\n<h3>　　新生</h3>\n<p>　　一九五三年五月，师在北京出席中国佛教协会成立大会，并被礼请为名誉会长。期间，撰文发表感想，盛赞中国佛教协会的成立。会议结束后，师专程赴山西云岗石窟礼拜后取道武汉，于六月来到江西庐山，养病于大林寺。此时，师有意在江西住下，却感到大林寺人来人往难于清静，于十月二率侍者冒雨登上云居山，住进茅蓬。当夜与僧众商议，礼请职事。数日之后，即率从开垦荒地。不久，四方衲子近百人闻讯而至。次年，为弘扬百丈家风，主持成立真如禅寺<a href=\"/rmgjc/sengqie.html\" class=\"keylink\" target=\"_blank\">僧伽</a>农场，将僧众分为农林与建筑两队。农林队开春即事开垦，癖出水田数十亩，旱地十余亩，当即下种，秋天收引稻谷数百担，旱地所种<a href=\"/sushi/shucai/hongshu/\" class=\"keylink\" target=\"_blank\">红薯</a>也获丰收。建筑队挖土烧砖，具炉铸铁瓦，年内二层楼铁瓦砖木结构的藏经楼千竣。在此悬挂沩仰宗钟板，每日昌晚上殿，坐香习禅。此后，仍率僧众<a href=\"/rmgjc/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>修持，农禅并重，种地栽禾，修建寺宇，年复一年，日继一日，到一九五七年，主持真如禅寺重建修复工程大体完成。寺宇规划悉仿当年南华寺格局，前有重建的赵州关，而后山门、天王殿、韦驮殿、大雄宝殿、法堂、藏经楼等一字直排，左右两侧相对而建的虚怀楼、云海楼、客堂、功德堂、祖师殿、伽蓝殿等。东、西禅堂、斋堂、方丈室、库房等也一应俱全。各殿堂佛像塑建如法循制，尊尊装金饰彩，端庄严肃。同时，师主持整顿寺规，严肃道风，每年夏讲经，冬禅七，创办[佛学研究苑]，培育僧才。一九五五年，应众戒子之请，开自誓受戒方便法门，为数百戒子授受三坛大戒。与此同时，以百余岁高龄，亲率僧众实践[农禅并重]，经营数千亩山林，水旱田地百余亩。到一九五七年，寺内实现粮食自给有余，每年产竹木和茶叶也获可观收入。</p>\n<h3>　　圆寂</h3>\n<p>　　1959年初，自感身体日渐衰弱，应继安排有关事务，主持岑学吕宽贤重新编辑的《云居山志》刊印<a href=\"/rmgjc/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>，亲自为之撰序。师分别对真如禅寺诸职事作了交待。最后，谆谆告诫自己的侍者，今后如有把茅盖头或应住四方，须坚持保守此一领大衣，但如何能够永久保持呢，只有一字曰“戒”。并留下将自己身后的骨灰撒入水中，与水族结缘的遗嘱后，于农历九月十三日在云居茅蓬内圆寂，世寿一百二十岁，僧腊一百零一年[3]  。荼毗之后，得五色<a href=\"/fgsl/slz/\" class=\"keylink\" target=\"_blank\">舍利子</a>数百粒。</p>\n</div>"
    }
]