[
    {
        "title": "【业力】-什么是业力",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x4E1A;&#x529B;&#x3011;-&#x4EC0;&#x4E48;&#x662F;&#x4E1A;&#x529B;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022244425.jpg\" /></p>\n<h2>业力（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　其作为直接推动生命延续的力量，业力在我们的生命历程中具有重要作用，甚至可配合缘起论与无始无明化世界。<a href=\"/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>所说的业力，根据行为属性，有善业、恶业之分；根据受报与否，有定业、不定业之分；根据受报范围，有共业、别业之分；根据受报差别，有引业、满业之分。其中，善业、恶业分别由不同行为构成，比较容易理解。 《<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>念处经》卷七之偈曰：“非异人作恶，异人受苦报；自业自得果，众生皆如是。”</p>\n<h2>词语解释</h2>\n<p>　　一种认为一个人的行为在<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>上所产生的结果会影响其未来<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>的学说。</p>\n<p>　　“办事”--- 僧团按照戒律的规定，处理<a href=\"/rmgjc/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>个人或僧团事物的各种活动，如<a href=\"/rmgjc/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>羯磨、忏悔羯磨等。</p>\n<p>　　（* 印度传统<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>包括印度教、锡克教、佛教、耆那教都有业力的观念，</p>\n<p>　　梵语，梵文，它是印欧语系印度-伊朗语族印度语支的一种语言，也是印欧语系最古老的语言之一，和拉丁语一样，梵语已经成为一种属于学术和宗教性质的专门用语。）</p>\n<h2>佛教词语</h2>\n<p>　　《<a href=\"https://www.guang5.com/fojing/ssydj/\" class=\"keylink\" target=\"_blank\">十善业道经</a>》一切众生心想异故，造业亦异，由是故有诸趣轮转。龙王！汝见此会及大海中，形色种类各别不耶？如是一切，靡不由心造善不善身业、语业、意业所致。</p>\n<h3>　　定业和不定业</h3>\n<p>　　所谓定业是受报时间及轻重皆已决定，反之则是不定业。如何判断某一业力属于定业或不定业呢？主要通过两点。首先，根据行为动机判断，考量这一行为是否故意造作。若是有心为之，便属于定业。若是<a href=\"/rmgjc/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>造作，如无意间伤害到其他众生，虽也造下业力，多属不定业，将来可能受报，也可能不受报；可能报得重，也可能报得轻。</p>\n<p>　　其次，根据对治情况判断。若是我们造业之后立即以忏悔进行对治，即使所造是定业，也可能因此产生变化，成为不定业。就像我们做了错事之后，若能诚恳地向对方道歉并补偿，可能扭转原有矛盾，化解原有问题。反之，非但不求忏悔，甚至为自己的所作所为自鸣得意，可能加深对方的仇视，加重未来的<a href=\"/rmgjc/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>。佛教特别提倡忏悔法门，以此消除业障和违缘。</p>\n<h3>　　共业和别业</h3>\n<p>　　所谓共业，指相同行为形成的业因，将会感得同样的果报。比如<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>在同一个城市，面临着同样的空气污染、交通拥挤、气候冷热。所谓别业，是指个别不同的业因。对于每个人来说，身体有强健、衰弱的不同，容貌有端庄、丑陋的不同，生活条件有富裕、贫困的不同，这些都属于别业所感。共业，取决于众生共同的行为，或是有共同利害关系的行为。比如同在屠宰场工作，并不是每个人都直接参与宰杀。其中，有一部分人可能担任财会、后勤等工作。虽然他们没有直接造作杀业，但只要处在这个利益集团中，收入中包含因屠宰而产生的利润，就不能脱离与杀业的关系。将来招感果报时，自然也要承担相应的罪业。就像法律在惩处犯罪集团时，其中某些人虽然未直接参与杀人、抢劫或诈骗，身处犯罪集团，参与其他相关事务，并从犯罪所得中获利，那么，同样会受到相应的法律制裁。 我们所处的自然及社会环境，都是共业所感。我到过澳洲多次，那里风调雨顺，少有灾害，环境非常和谐。生活其间的人，对自然怀有真诚的关爱之心，不会随意践踏一草一木，更不会随意伤害动物，哪怕是微小的动物。所以，大自然也呈现出一派宁静、祥和，让人们在它的怀抱中得到滋养。反之，如果不懂得保护自然、尊重生命，只是不计后果地盲目开发，将生态环境破坏殆尽，那么，最终的受害者还是人类自己。</p>\n<p>　　别业，则取决于个体行为，由此招感属于个人的业报。比如在普遍富裕的国家中，也存在一无所有的赤贫者；在普遍贫穷的地区里，也存在应有尽有的富贵者。又比如，常人所看到的景象，在色盲者眼中，又是另一番景象；常人所听到的音声，在重听患者的耳中，也会有所不同。这些，都是别业所感，是由不同业力招感的个别果报。</p>\n<h3>　　引业和满业</h3>\n<p>　　所谓引业是业力招感的总体果报。有情生命在延续过程中，是上升天道、继续做人，或是堕落<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、沦为畜生，皆由引业决定。引业牵引我们投胎，其作用，就像火箭推动卫星上天。假若没有引业作为动力，<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>也就随之结束了。《唯识三十论》中，有这样两句话：“前异熟既尽，复生余异熟。”前面的业力结束，新一轮的业力又继续产生，然后再次结束、产生。无始以来，众生不断造业，所以，没完没了地流<a href=\"/rmgjc/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死，循环往复。所谓业力无尽，生死无穷。</p>\n<p>　　所谓满业是业力招感的差别果报。比如同样生而为人，有长寿和短命的不同，有贫穷和富贵的不同，有庄严和丑陋的不同。同样沦为畜生，有的流落街头，只能从垃圾中觅食充饥，还要随时面临被宰杀、残害的恐惧。而有的却被主人百般宠爱，精心照料，生活水准甚至超过许多普通百姓。所有这些差别，正是由不同的满业所决定。</p>\n<p>　　从造业到招感果报，还需要缘的成就。如果说业力就像播下的种子，那么，还须同时具足水分、阳光、泥土等条件，才能扎根发芽、开花结果。这些果报，根据因缘的不同，又有现报、生报、后报、不定报之分。有些业力造下后，现世即能招感果报，为现报；有些业力须待来生方能受报，为生报；还有些业力则须多生后才能受报，为后报；至于前面所说的不定业，招感果报尚未决定，为不定报。比如某人犯罪后，可能立即被公安部门逮捕归案，也可能在几个月或一年后才被捉拿，还可能在几十年后才落入法网，这完全取决于各种因缘的成熟。正所谓“<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>到头终有报，只争来早与来迟”。</p>\n<h3>　　业力的推动</h3>\n<p>　　“由是，故有诸趣轮转。”由于每个人造作业力的不同，才会在“诸趣”中<a href=\"/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>不休。“诸趣”，指五趣或六趣。趣，为趣向之义。众生所以受报，皆是由因趣果，故名。五趣，为天道、人道、饿鬼道、<a href=\"/rmgjc/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>、地狱道，是五种不同的生命处境。六趣，则在天道和人道之间增加阿修罗道。其中，以天道众生福报最大，生活环境也最为优越。而我们所处的人道，则是有苦有乐。至于畜生道、饿鬼道、地狱道的环境，则一道苦于一道。尤其是地狱，其<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>之惨烈，难以名状。从根本上说，五趣的差别，正是取决于“心想异故”。因为众生的观念、想法不同，故造作种种善恶业力，导致“诸趣轮转”的结果。如果说生死轮回根源于心，<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>万物也根源于心，那么，是否和西方哲学所说的<a href=\"/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>论相当呢？其实不然。唯心论所说的心，是作为第一性的存在，乃永恒且固定不变的精神实体。而佛法所说的心并不具有永恒性，更非固定不变的实体。此外，唯心论所说的心，能派生万物，而不从他物所生。而佛教则认为，心是缘起的，不是独立、单一的存在。唯识宗认为，眼识九缘生，耳识八缘生，鼻舌身三识七缘生，<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>五缘生，说明心是相互依赖地存在，与唯心论具有不同的性质。</p>\n<h3>　　业力业果</h3>\n<p>　　<a href=\"/fjrw/hcrw/jiqunfashi/\" class=\"keylink\" target=\"_blank\">济群法师</a>《十善业道经》启示：“如是一切，靡不由心造善不善身业、语业、意业所致。”所有这一切，都根源于众生的心。因为“心想异故”，所以造下善或不善的业力，由此招感相应的苦乐果报。有情造业的渠道主要有三方面，分别是身体的行为（身业）、语言的行为（语业）、思想的行为（意业）。通常，能够表达出来，并能直接利益或伤害他人的，主要是身业和语业。比如为他人提供帮助或制造障碍，又如对他人进行赞叹或肆意辱骂，都是通过行为和语言进行表达。但意业却不然，如果内心充满嗔恨，表面却伪装得仁慈和善，就很容易迷惑他人，须行之于身口，才会对他人构成直接伤害。不过，如果经由某些特殊训练，心力特别强健，也能以意念直接杀人。《唯识二十论》就记载了这样一个故事：古印度有位国王，得罪了仙人，令其嗔心大起。仙人一怒之下，以意念下了场冰雹，令国王所在的城市毁于一旦。可见，意念同样具有杀伤力。作为<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人应特别注意观察自己的起心动念，绝不可随意生起不善心念。因为身、语、意三业都能造作善或不善的业力。</p>\n<p>　　总之，由众生心念的差别，导致行为的差别，进而导致世界的差别。</p>\n</div>"
    }
]