[
    {
        "title": "【一贯道】-佛教中的一贯道是指什么",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2><a href=\"/rmgjc/yiguandao.html\" class=\"keylink\" target=\"_blank\">一贯道</a>（解释）</h2>\n<p>　　一贯道起源于明清时期，属于五教合一的多神教，也是中华人民共和国成立前在全国范围内流传势力最大、活动最为猖獗、危害非常严重的反动会道门组织，1950年在中国大陆被铲除，其在台湾的分支到21世纪初已发展成一个<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a><a href=\"/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>组织。</p>\n<h2>一贯道 - 简介</h2>\n<p>　　一贯道又名中华<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>慈善会，是中国流传最广、势力最大、危害最严重的一个反动会道门组织。 发源于清末光绪年间的中国大陆、在20世纪30年代至50年代期间成为帝国主义与国民党反动派掌握和利用的工具，是欺骗与陷害落后群众的封建<a href=\"/rmgjc/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>组织，在1950年被中国政府取缔。</p>\n<p>　　21世纪初发展成为主要兴盛于台湾的宗教信仰，在香港亦有流传，称为天道佛堂，而在有不少台湾移民的地方亦设有道场，称为佛堂。</p>\n<h2>一贯道 - 历史</h2>\n<h3>　　起源</h3>\n<p>　　起源于明朝中叶，盛行于明末清代。最早的教派是明朝的“罗祖教”。“罗祖教”是一个从<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>的旁门左道滋生出来的异教，由山东即墨县猪毛城一个叫罗孟鸿的人创立，他诡称自己的初祖是佛教的<a href=\"/cz/\" class=\"keylink\" target=\"_blank\">禅宗</a>，抄袭<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>和神话传记，编撰成“龙经”《五部六册》，作为传教的主要经典。“罗祖教”以后又繁衍、分裂出“先天道”、“老爷道”、“归根道”、“三花道”、“西华堂”、“东震堂”等。</p>\n<p>　　清末王觉一借用《佛说皇极金丹九莲证性皈真宝卷》及《开示经》中的偈语，建立“东震堂”，接续先天道统。以无生老为信仰主神，标榜<a href=\"/rmgjc/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>佛三阳信仰，并以儒家为中心，主张三教合一；在形式上，夹杂着中国古老的谶纬图说；在组织上，无<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>之说，而由俗家信众求道后称为道亲。</p>\n<p>　　1882年，山东青州人刘清虚接手“东震堂”，传至路中一（道中称其为第17代祖师）时，取《<a href=\"/ctwh/sishuwujing/lunyu/\" class=\"keylink\" target=\"_blank\">论语</a>》中“吾道一以贯之”，改名“一贯道”。路中一自称“弥勒佛”下凡，在山东济宁一带传道十余年。</p>\n<p>　　1925年路中一死，1930年，其<a href=\"/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>张光壁篡夺了一贯道的掌道权，把总坛设在济南，派人到全国各地“开荒”建坛。</p>\n<h3>　　解放前</h3>\n<p>　　1933年，旧军人出身的一贯道点传师栗春旭被张光壁派到北平“开荒”办道。栗春旭很会争取上层人士，当时加入者多是军阀和失意政客，有曾任袁世凯政府财政部长的周子齐、军阀唐天喜等。</p>\n<p>　　日寇侵华期间，日军认为一贯道宣扬的“万教归一”，“吾道一以贯之”等符合日本统治者所谓儒佛神道的精神统治需求，于是将一贯道作为麻痹民众，为其侵略扩张服务的工具加以扶植和利用。为了寻求支持，张光壁也迎合日寇，大小汉奸纷纷入道。</p>\n<p>　　1939年1月，张光壁在北平市北新桥<a href=\"/rmgjc/caishen.html\" class=\"keylink\" target=\"_blank\">财神</a>庙2号设立一贯道总坛。至1946年前后中层以上坛已达1360余个，<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>佛坛无数，道徒20余万人，成为当时北平地区最大的反动封建会道门组织。</p>\n<p>　　1947年解放前夕，张光壁携家离平逃往四川成都后病毙，其子张英誉与孙素珍相互争夺道权，一贯道从此分为“师兄派”和“师母派”两大阵营。北平道长张五福追随“师母”孙素珍，他要求北平的道徒效忠师母。孙素珍不甘心北平的道务落入不迷信的共产党的手上，于是制订了“撤销佛像，化整为零”的隐蔽策略，并于1948年从四川派了一名姓白的点传师潜入北平，协助张五福以开办“忏悔班”的名义，召集大小道首传达“师母”旨意，转移佛堂，藏匿财产，抵抗共产党。一贯道成为了一个彻底的反动政治组织。</p>\n<h3>　　被铲除经过</h3>\n<p>　　1950年1月24日，中共中央发出指示，开始在新解放区实行土改运动的准备工作，孙素珍传出“母训”，不许道徒入农会，对抗农村土地改革。</p>\n<p>　　朝鲜战争爆发后，一贯道散布“第三次世界大战快起来了，美蒋军要来北京，八路军要完了”等言论。在一贯道散发的反革命传单中，公然号召道徒反抗人民政权，孙素珍还给道徒们封官许愿：一贯道的首领即是将来的真主，点传师都将任县长以上职位。张五福则抛出一篇名为《指路灯》的秘密铅印件，指示各坛“当进则进，当牺牲则牺牲”。在此煽动下，有的道首号召道徒不惜以武力对抗人民民主专政的打击，一些坛主还组织道徒练武，购买 枪刀等，只待道长一声令下，进行武装暴乱，梦想复辟。</p>\n<p>　　1950年10月10日，中华人民共和国政府宣布一贯道属于反动会道门组织，宣布予以取缔和打击。</p>\n<p>　　1950年12月18日，北京全市统一行动，130名一贯道首要分子几乎同一时间内被逮捕。北京取缔一贯道工作历时两个月，先后逮捕反动道首381人；枪毙反动道首42人；登记点传师720人，坛主4775人，“三才”663人；声明退道者178074人；封闭大小坛1283个。北京的一贯道从组织上和思想上被彻底摧毁。12月20日，中共机关报《 人民日报 》发表《坚决取缔一贯道》的社论。</p>\n<h3>　　在台湾的发展</h3>\n<p>　　1948年后，大陆的一贯道<a href=\"/rmgjc/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>开始到台湾传道，一度获得迅速发展，但1953年被台湾当局以一贯道“涉及迷信及妨害地方治安”为由，进行取缔或打击，但并未能完全阻止其进入地下活动。</p>\n<p>　　1987年，台湾当局解除对一贯道的禁令，一贯道因此获得迅速发展，影响力迅速扩大。到2000年，一贯道道场达3124个，居台湾各宗教的第四位；教职人员2281人，信众84.5万人。另设有34所学校，29所医疗机构，30个出版社。</p>\n<h2> 一贯道 - 教义</h2>\n<h3>　　历史教义</h3>\n<p>　　一贯道训称：人有十条罪，劝一人入道可立一功，赎一罪，多立功，多赎罪，入道者要劝亲友人道，道徒不劝道就是心不诚。这听起来多少有些像是当今的传销和卖保险，先把自己的亲朋好友拉下水。</p>\n<p>　　一贯道的大小坛主多是城镇富豪、恶霸权势、乡村地主富农等，为了多“渡人”，他们散布“入道避灾免祸”、“死后冬不挺尸夏不臭”等迷信谎言，并利用手中权势强迫群众人道。</p>\n<p>　　道徒们一人道便成为敛财的对象，“入道费”、“功德费”、“行功费”、“献心费”、“尽孝费”、“免冤费”等费用五花八门。仅入道时每人交的“功德费”一项，就合十几斤白面。当时北平市共有20多万道徒，“功德费”聚合起来就有5万袋白面，大多落入少数道首账下。</p>\n<h3>　　当代教义</h3>\n<p>　　当代台湾一贯道以“敬天地，礼神明，爱国忠事，敦品崇礼， 孝父母，重师道，信朋友，和相邻，改恶向善，讲明五伦八德，阐发五教<a href=\"/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之奥旨，恪遵四维纲常之古礼， 洗心涤虑，借假修真，恢复本性之自然，启发良知良能之至善，己立立人，己达达人， 挽世界为清平，化人心为良善，冀世界为大同”为口号。</p>\n</div>"
    }
]