[
    {
        "title": "【欲界】-欲界是什么意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>欲界（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>用语）</h2>\n<p>　　佛教把世界分成欲界、<a href=\"/rmgjc/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、无色界，合称<a href=\"/rmgjc/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。</p>\n<h2>欲界起源</h2>\n<p>　　从六趣本身，又将天、人、阿修罗称为三善趣或三善道，将<a href=\"/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生称为三恶趣或三恶道。又有佛、<a href=\"/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>来此度生及有<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>成圣果者，又称凡圣同居地。人天合为十善趣。此立足于人，地狱在下，最底层是无间地狱；天在上，他化<a href=\"/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天位居最上。 欲界是没有摆脱世俗的七情六欲的众生所处境界。</p>\n<h2>欲界六重天</h2>\n<p>　　欲界六重天包括四大王天、忉利天、须焰摩天、兜率（shuài）陀天、化乐天、他化自在天。</p>\n<p>　　“阿难，诸<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>人不求<a href=\"/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>，未能舍诸妻妾恩爱，于邪淫中，心不流逸，澄莹生明，命终之后邻于日月，如是一类名四天王天。</p>\n<p>　　“于己妻房淫爱微薄，于净居时不得全味，命终之后，超日月明，居人间顶，如是一类名忉利天。</p>\n<p>　　“逢欲暂交，去无思忆，于人间世，动少静多，命终之后，于<a href=\"/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中朗然安住，日月光明上照不及，是诸人等自有光明，如是一类名须焰摩天。</p>\n<p>　　“一切时静，有应触来，未能违戾，命终之后，上升精微，不接下界诸人天境，乃至劫坏三灾不及，如是一类名兜率陀天。</p>\n<p>　　“我无欲心，应汝行事，于横陈时，味如嚼蜡，命终之后生越化地，如是一类名乐变化天。</p>\n<p>　　“无世间心，同世行事，于行事交，了然超越，命终之后遍能出超化无化境，如是一类名他化自在天。[1]</p>\n<h2><a href=\"/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a></h2>\n<p>　　欲界具含六道，曰天，曰人，曰阿修罗，曰鬼，曰畜生，曰地狱。前三名三善途，后三名三恶途。六道所由成，各缘藏识所伏种子之成熟。（每由旬约四十里）其外分布七香水海，七金山。再外有咸海，有铁围山。咸海之中，东南西北各现一大洲，大洲边附以二小洲，日月绕须弥山而行。东洲名弗婆提，南洲名阎浮提，西洲名瞿耶尼，北洲名郁单越，此皆人道所居。</p>\n<h3>　　人道</h3>\n<p>　　人之所以为人，为夙修十善得其中者之果报。而其间又有差等。东西南三。洲苦乐状态。大致不甚悬隔。北洲则以善因较胜。故所享亦较愉快。衣食器具。皆由植物直接供给。不假工作。地产釜鍑。中置焰火珠。投米于中。珠自发热。饭熟乃已。男女相悦。则会于林中。如无血统关系。树为之合。若帷帐然。否则不合。男女自散。不敢强所欲也。顾此等欢会。终身不逾五次。非纵欲无度者可比。女子怀妊。七八日即产。置诸道周。喜之者抚而喂之。七日即长大成人。男入男群。女入女群。随手取衣饰于岸。不必原物。其人民不私己有。有如是者。（此举大略，欲知其详，可参观长阿含经）吾辈南洲。人力少一，资生之具即减一分。今世电炉电灯等物，疑若较为省事，不知乃他种人力之变相，非焰火珠可比。人民为维持<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>计，不得不私所蓄。既有私蓄，斯有夺，此乱之所由来也。政治社会诸问，任如何研究，终无绝对实效可期，盖利之所在，弊即寓焉，福之所起，祸即伏焉。欲与北洲并美，无此事也。然因苦心志，劳筋骨，行拂所为，正所以促成上探大道之念，则远非北洲所能望焉。</p>\n<h3>　　天道</h3>\n<p>　　夙修十善，得其上者业种成熟，即生天道。天之所以胜于人，约有三事。一为化生，化生者，机缘一至，即托境现身，无处母胎之苦也。二为身胜，人中之痰涕，精涎，便溺，垢腻等一切不净物，诸天皆无之。而天女姿色，美好特甚，任吾人倾城倾国之容，傅以香花香水之饰，自天视之。惟觉劣陋臭秽，不堪亲近。三为衣食，思之自至，宫室受用现成，视北洲取资于植物犹嫌不便，勿论南洲须待胼手胝足也。</p>\n<p>　　天之层次有六，以属欲界，常称六欲天。</p>\n<p>　　初曰四王天，居须弥山腰。</p>\n<p>　　二曰忉利天，居须弥山顶，此二天属地居。三代以前，人民业障较薄，于帝释彰善瘅恶之举，每能有所感觉，故诗中累举上帝以为颂。后人业障较深，对于帝释，冥然罔觉。</p>\n<p>　　空居四天，较为尊贵，不与人间相接，故吾人尤难与知。此四天所以能空居，为兼修未到定之力。定者，结跏趺坐，排除<a href=\"/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，俾心安定。（欲知其详，可取台宗止观研究之）或本<a href=\"/rmgjc/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>略名曰禅，或合称<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。未到者，以未能舍离情欲，非根本之禅也。夜摩，义为善时。以生此者时时唱快乐故。兜率，义为知足，以生此者于诸欲能知足故。</p>\n<p>　　化乐者，于境变化自娱。（如欲乘象马，则化象马骑之以为乐）</p>\n<p>　　他化自在者，假他所作乐境，以成己乐也。若夫情欲之娱，则形式逐层递简而愈乐。地居二天，有交媾之形，无泄精之秽。夜摩则惟抱持，兜率不过执手，化乐共笑，他化相视。（此本俱舍颂及立世论，若起世经则征异）此等欲事，只为纵乐而然，与胎育无关系。以诸天化生，不由母胎故，惟纵乐不已，藏识所伏种子，适为下坠恶途之因，斯可惧耳。及命将终，则有五种大衰相现：一为衣染尘埃，二为华发萎悴，三为两腋汗出，四为臭气入身，五为不乐本座，是诚六天之通病也。</p>\n<h3>　　阿修罗道</h3>\n<p>　　阿修罗，具含无天、不端正、无酒等义，以其乏天之德。而男子貌奇丑，又少和气，不能成酿也。所居在须弥山岩窟中，或散在海滨，或潜在海底。夙修十善，而瞋慢疑三习特盛者生之。其生也，多忿怒，好斗争。所享之乐，宫室华美，衣食亦出自然。然判在人道之下者，为日中不免自然之苦，避之不得。如享盛馔，末箸入口，化为淤泥，是其例也。（其它种类住处，及诸典实，楞严，<a href=\"/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>念，增一阿含等经均有详载，未及具引）至吾人所能发现之处，于瞻波国有修罗宫，唐使王玄策曾三度过其地。（出西国志）而玄奘法师之游西域，又别有所得。</p>\n<h3>　　地狱道</h3>\n<p>　　阎浮提二万由旬下，有地狱道。其中众生身形，虽与人同，而处境则惟苦无乐。狱之重者为八大狱：一等活狱，生其中者，铁爪长利，怀瞋互攫，又以刀剑递相斫刺脔割，或身碎，或肉坠，想以为死，冷风来吹，则若复活。二黑绳狱，恒为热铁绳所迫，皮肉骨髓皆焦，其中兼受斩锯之苦。三众合狱，中有大石山两两相对，众生入其间，山自然合，堆压其身，骨肉糜碎。四嗥叫狱，镬汤熬煎，苦极而叫。五大叫狱，乃煮煎尤惨者。六炎热狱，受烧炙之刑。七极热狱，乃烧炙之甚者。八阿鼻狱，义为无间，此为八大狱之最下层，众生坠此，受苦无间，乃世间最凄惨处也。大狱之旁，各有十六小狱，未及细举，此外尚有轻狱，散布铁围山间，及东西南三洲山林江海等处。此道众生，所以饱尝苦况，原因对十恶业曾作重大过犯。世有走无常，于地狱形相，亦有所亲见，故能言之如绘。明永乐宣德间，有酆都令尤和者，素辟地狱之说，卒以走无常勾摄其弟付狱事，确确凿凿，无致疑余地，遂大为帖服，且刻石于酆都观纪其实，以示前此坐井观天之失。（出语怪）后之硬主无地狱者，又将为尤和之所怜愍矣。</p>\n<h3>　　鬼道</h3>\n<p>　　鬼道住处，有正有边。正住，在阎浮提下五百由旬。边住，散居诸处。凡曾犯十恶，其业尚轻者生之，身形亦如人。中分有威德无威德二种；有威德者，得住地居天，及四洲海滨山谷之间，皆有宫室之御，享用过人，世俗崇奉之神，即此类鬼也。无威德者，杂处东西南三洲人道之间，或依粪秽，或附草木，或凭冢墓，或隐屏厕，并无舍宇栖止。业较微者，尚能一饱，业较重者，饥火长焚，去人远矣。曰：彼所以乐，由昔日布施种子随机成熟耳，（布施义详世法篇）虽号为神，而昼伏夜游，虚怯多畏，依然鬼道本色也。我国鬼神之谈，散见经史子集者，何可胜道。而通幽扶鸾诸术，又往往有奇验。西人于鬼之事实，渐有所征。鬼神问题，亦认为有研究价值。（且有影鬼相之事）昔人无鬼论，诚无立足余地矣。</p>\n<h3>　　<a href=\"/rmgjc/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a></h3>\n<p>　　畜生广义，凡吾人所能知之动物，除人类外。上至巨兽，下至微虫，皆为所摄。非仅局于家所豢养，其身形特称旁出，异于五道。此为夙昔对于十恶，作普通过犯之业报也。顾吾人所能知，只在阎浮提与人同居之一部，其实畜类住处。诸道咸有，狱道之畜，如蛇如鸱，如黑驳狗，如百足虫，自无足以迄多足之毒类，皆生其中。鬼道则益以狐狸象马之属。混居人道者，东西南三洲现象略同。北洲则惟有鸿雁象马不恶之畜，无足多足之属概不与焉。六欲中天，空居四天，只有二足之畜，如妙色鸟之类。虽有象马娱乐，乃是幻化所成，非若地居天实有其物，以供乘御也。畜类之大者，以难陀，跋难陀，因之幻象亦渐次微变，若循一种轨迹焉。进化学者乃视为莫大之秘奥，强作生物演进之证据，夫吾人所能考察之地层，充其量能有几何年，以此等年较世界无量时间，以所居地，较世界无量空间皆，所谓无穷小数中之无穷小数。于此微乎其微，末乎其末，时空中所得之幻影，欲以断定世界无量时空之一切现象变态，何其妄也。今夫平圆，孰不知其为循环之圈乎？而于其中取无穷小弧，则弧线与切线若合为一。因其合一之故，从而下断语曰：弧者直线也。累弧成圆，则圆者亦一直线也。是人之妄。不问可知。然知是人之妄易，而知进化论之妄难，则习焉而不知察之过也。</p>\n</div>"
    }
]