[
    {
        "title": "斋日",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x658B;&#x65E5;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022302821.jpg\" /></p>\n<h2>斋日（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　斋日：斋日也就是指斋月中某一天或祖师圣诞或有斋醮科仪等活动时，道教徒必须严格按照道教仪范所规定内容行事。斋日是一月之中应持斋戒的日子。这一几天必须严格遵守道教戒律，这样行法时才能有天神护佑，才会有效。</p>\n<h2>斋日的概念</h2>\n<p>　　道教在制定戒律的同时，还特别设立了斋日，斋日是一月之中应持斋戒的日子。这一天必须严格遵守道教戒律，这样举行仪式时才能有天神护佑，才能有求必应，心神感应。</p>\n<p>　　道教的斋日有十直斋日、八节斋日、三元斋日、四始斋日、三会斋日。</p>\n<p>　　①十直斋日：每月一日，八日，十四日，十五日，十八日，二十三日，二十四日，二十八日，二十九日，三十日(小月可取二十七日)。</p>\n<p>　　②八节斋日：立春日，春分日，立夏日，夏至日，立秋日，秋分日，立冬日，冬至日。</p>\n<p>　　③三元斋日：正月十五，七月十五，十月十五。</p>\n<p>　　④四始斋日：正月一日，四月一日，七月一日，十月一日。</p>\n<p>　　⑤三会斋日：正月七日，七月七日，十月五日。</p>\n<p>　　这些斋日是持戒做斋的特定时间，斋日里必须严格持戒、护戒，这样才能真正以身正<a href=\"/rmgjc/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>世人，以净心感，化世人。</p>\n<p>　　⑥违戒的处罚：违戒谓<a href=\"/rmgjc/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>道士违背所应受持的规戒条律。<a href=\"/rmgjc/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>谓道士受持规戒后重又违犯规戒。对违戒、破戒者，原本都有统一规定，后来各宫观以清规作为处罚的标准，现在基本是以批评教育为主，直至催单(开除)。</p>\n<p>　　⑦<a href=\"/rmgjc/xianxing.html\" class=\"keylink\" target=\"_blank\">现行</a>主要斋日：现在各全真庙宇中的斋日与传统定制有些变化，十方<a href=\"/rmgjc/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>主要以农历每月初一、十五及祖师圣诞日等作为斋日，子孙庙里还以传统定制斋日为主。</p>\n<p>　　⑧佛教中也有斋日这一设定[1]</p>\n<h2>道教诸斋日详解</h2>\n<p>　　岁六斋：正月一日、七月四日、三月二日、九月五日、五月三日、 冬月六日（於此六日持斋诵经，可除十苦，得免厄会）</p>\n<p>　　月十斋：一日（北斗下）、八日（北斗司杀下）、十四日（太一使者下）、 十五日（天帝及三官俱下）、十八日（天一下）、 廿三日（太一八神使者下）、廿四日（北辰下）、 廿八日（下太一下）、廿九日（中太一下）、 三十日（上太一下）</p>\n<p>　　注：从下、中、上太一下日，地水一切尊神都下凡并周行天界，检察<a href=\"/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>，宜焚香持斋，忏悔愆尤。 初一、十五上庙进香的习俗，源於此。</p>\n<p>　　甲子日斋：甲子日有太一简阅神只查人善恶。</p>\n<p>　　庚申日斋：庚申日为身中三尸之神言人罪过。</p>\n<p>　　本命日斋：本命日有本命星君、赏善、罚恶尊神计人功行，宜斋戒礼斗，可得长生。</p>\n<p>　　八节日斋：八节日即：立春、春分、立夏、夏至、立秋、秋分、立冬、冬至，此八日均有值神记人善恶。</p>\n<p>　　三元斋日：三元即:正月十五（上元）、七月十五（中元）、十月十五（下元），此三元日，是天、地、水官考校罪福之期，应该沐浴斋戒，虔诚献礼香花灯水之仪，可上祈天恩，下谢诸过。</p>\n<p>　　三会斋日：正月七日是“举迁赏会”、七月七日是“庆生中会”、十月十五日是“建功大会”，此三日是三官考核功过之期，当庆戒身心，奏表上章，祈福解厄。</p>\n<p>　　五腊日：正月一日是天腊、五月五日是地腊、七月七日<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>腊、十月一日民岁腊、腊月腊日王候腊，此五腊应祭祀先亡祖祢，荐福追思，可以孝感天，祖先得度。</p>\n<p>　　注：其余日子若祭祀先亡，名“淫祀”，不但不能<a href=\"/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>先灵，反而自己带过。但可以在三元亦名“八解”日，设净供求福。</p>\n</div>"
    }
]