[
    {
        "title": "止观",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<h2>止观（<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>解释）</h2>\n<p>　　<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>属功德边，布施、持戒、忍辱、精进属福德边。福德可以给人，功德不能给人，亦如财物可以赠送他人，聪明智慧无法赠送他人，功德是自己专有的。宝志公为观音<a href=\"/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>，主持梁皇忏只能将郗氏夫人<a href=\"/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>到忉利天，再上去要靠<a href=\"/rmgjc/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。<a href=\"/fjrw/zhufopusa/shidadizi/66953.html\" class=\"keylink\" target=\"_blank\">舍利弗</a>智慧第一，有人问佛：<a href=\"/fgsl/\" class=\"keylink\" target=\"_blank\">舍利</a>弗何以有如此智慧？佛答：舍利弗心内如鼓，空空如也。一念不生，这是大定。随问随答，一经过考虑即落在<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>心上，必须要用无分别智，无分别智与佛心，心心相印。教下的止观也是定，方法不一样，目的则同。</p>\n<h2>名词解释</h2>\n<p>　　止，巴利语samatha，音译作奢摩他；义为平静，乃是心处于专一、不动、无烦恼、安宁的状态，亦即禅定的<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>法门。</p>\n<p>　　观，巴利语vipassanà，音译作毗婆舍那；乃是直观觉照一切名色法（身心现象）的无常、苦、<a href=\"/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>本质，亦即智慧的修行法门。[1]</p>\n<h2>止业处</h2>\n<p>　　南传上座部佛教把修习止的方法归纳为四十种业处。禅修者可以选择其中一种适合自己的禅修业处来作为入门的方便。然而，在四十种止业处当中，最为禅修导师们推崇与教导的应该是入出息念。</p>\n<p>　　<a href=\"/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>于《大念处经》等诸经中教导入出息念的修行方法。佛陀于该经中说：</p>\n<p>　　「诸比库，于此，比库前往阿兰若，前往树下，或前往空闲处，结跏趺而坐，保持其身正直，使<a href=\"/rmgjc/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>现起于面前。他只念于入息，只念于出息。</p>\n<p>　　1、入息长时，了知：『我入息长。』</p>\n<p>　　出息长时，了知：『我出息长。』</p>\n<p>　　2、入息短时，了知：『我入息短。』</p>\n<p>　　出息短时，了知：『我出息短。』</p>\n<p>　　3、他学：『我将觉知全身而入息。』</p>\n<p>　　他学：『我将觉知全身而出息。』</p>\n<p>　　4、他学：『我将平静身行而入息。』</p>\n<p>　　他学：『我将平静身行而出息。』」</p>\n<p>　　开始修行时，可以先找个安静且适合禅修的地方，以舒适自然的姿势坐着，上身保持正直，然后将正念安住于禅修的目标——呼吸。应尝试觉知经由鼻孔而进出身体的气息（呼吸时的鼻息）；只应借助在鼻子的正下方（人中）或鼻孔出口处周围的某一点来感觉气息的进出，而不要跟随气息进入体内或出到体外。如果跟随气息进出，将难以成就禅定。反之，只是在气息与皮肤接触最明显的那一点觉知气息，将能培育及成就禅定。这就是止禅！</p>\n<h2>观业处</h2>\n<p>　　观业处的所缘必须是究竟法（paramattha）。根据《阿毗达摩》，究竟法有四种，即：心法、心所法、色法和<a href=\"/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。其中，涅槃属于无为法，并非观业处的目标；而心法和心所法合称为名法。名法和色法，亦即精神现象和物质现象，乃是由因缘和合而成，因此也称为缘生法、有为法、<a href=\"/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>法、行法等。修习观业处，就是如实地观照诸行法的无常、苦、无我三相。如果还未能知见究竟法，就不能修习真正的观业处。为了如实地知见究竟名色法以及名色之因，禅修者在修习观业处之前必须先修习：</p>\n<p>　　1.色业处 (r?pa kamma??hàna)，辨识究竟色法；</p>\n<p>　　2.名业处 (nàma kamma??hàna)，辨识究竟名法；</p>\n<p>　　3.缘起 (pa?iccasamuppàda)，透视过去、现在、未来三世名色法之间的因果关系。</p>\n<h2>色业处</h2>\n<p>　　有两条修习观业处的途径：第一条途径是先修行止业处达到禅那，然后进一步修行观业处，这类禅修者称为「止<a href=\"/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>」（Samatha yànika）；第二条途径是以四界分别培育专注力达到近行定，但尚未达到禅那就直接修行观业处，这类禅修者称为「纯观行者」(Suddhavipassanà yànika)。然而，无论依循哪一条途径，禅修者在开始修行观业处之前，都应当先修行「四界分别」。</p>\n<p>　　要修行四界分别，首先应逐一地在全身辨识地、水、火、风四界的十二种特相。根据《法聚论》，这十二特相是：</p>\n<p>　　1.地界：硬、粗、重、软、滑、轻；</p>\n<p>　　2.水界：流动、粘结；</p>\n<p>　　3.火界：热、冷；</p>\n<p>　　4.风界：支持、推动。</p>\n<p>　　有系统地熟练辨识全身的十二种特相后，再辨识它们为地、水、火、风，使心平静及获得定力。继续以四界分别观培育定力，并趋向于近行定。此时，禅修者发现全身呈现为一团白色物体。继续辨识白色物体中的四界，将发现它变得晶莹透明，犹如冰块或玻璃。持续专注于此光中的四界，即能达到近行定。禅修者将发现透明体粉碎成许多微粒即「色聚」（r?pa-kalàpa）。达到此阶段时，称为「心清净」，禅修者可借着进一步分析这些色聚而培育「见清净」。</p>\n<p>　　辨识个别色聚里的地、水、火、风四界，将发现这些色聚非常迅速地生灭。由于还未破除三种密集，即：相续密集、组合密集与功用密集，禅修者还看到色聚是有体积的微小粒子，所以还停留在「概念法」的领域，尚未达到究竟法的境界。更进一步分析四界，直到能在单独一粒色聚中见到四界。随后再逐一地辨识眼处、耳处、鼻处、舌处、身处与心所依处里诸色聚的四界，分析每一粒色聚中至少含有八种基本色法，即：地、水、火、风、颜色、香、味与食素。</p>\n<p>　　在分析了诸色聚里的八种基本色法之后，进而分析个别色聚里的其余色法，如：眼净色、耳净色、鼻净色、舌净色、身净色、心所依处色、命根色、性根色等，直到分析一切种类色聚里的所有色法，并依次辨识六处门与四十二身分里的业生色、心生色、时节生色和食生色，以此来修习「色业处」。之后，即可进而转修「名业处」，也即是辨识名法。</p>\n<h2>名业处</h2>\n<p>　　名法可分为能认知对象的「心」与伴随着心生起的「心所」；「心」可以分为八十九种，「心所」可以分为五十二种。如果禅修者已能达到禅那，那么分析名法可以从辨识与禅那相应的心和心所开始。禅修者先进入初禅，出定后辨识初禅的五禅支，直至能够辨识在每一个初禅速行心的心识<a href=\"/rmgjc/chana.html\" class=\"keylink\" target=\"_blank\">刹那</a>里的所有三十四种名法。之后再辨识初禅心路过程里其他每一种心识刹那中的所有名法。</p>\n<p>　　能够辨识禅那心路过程名法后，还应以同样的方法系统地辨识眼门、耳门等六根门在取相应的颜色、声音等所缘而生起的所有六门善与不善速行心路过程里名法。在分析了内在的名色法之后，还必须以直接的观照力分析外在的名色法，乃至把观照的范围逐渐扩大至整个宇宙。如此辨识内外的名色法时，能够暂时断除「有身见」，因为当时不见有众生、男人、女人等等，只不过是名与色而已。于是证得了「名色识别智」，达到「见清净」。</p>\n<h2>缘起</h2>\n<p>　　此后，禅修者应进而修习缘起，即分析名色法之因。由于令禅修者获得此生的因是前一世临死时成熟的业，所以必须照见自己过去世的名色法。禅修者需要辨识过去、现在、未来的<a href=\"/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>，之后再辨识在这三世之间因与果的关系。</p>\n<p>　　禅修者可以先培育定力，然后把智导向过去，渐次地观察自己过去的名色法：一天前、两天前、三天前、一个月前、两个月前、三个月前、一年前、两年前、三年前、十年前、二十年前、三十年前……直到今生结生（入胎）时的那一刹那。然后再以智慧之光照向过去，禅修者将会见到前一世临死时的名色法，或临死速行心的目标。该目标将是业（kamma）、业相（kamma nimitta）或趣相（gati nimitta）三者之一。如果能准确地找到该目标，就能够找到作为今生果报五蕴之因的行与业有，以及围绕着该行与业的无明、爱和取。辨识前一世的无明、爱、取、行与业这五因，造成今世的结生识、名色、六处、触与受这五果，以此方式来观照前世与今生名色法之间的因果关系。此后，以同样的方式逐渐地向过去辨识以前的第二世、第三世、第四世……如此尽能力辨识过去多世。</p>\n<p>　　借着辨识过去世因果而培育起观智的力量之后，可以用同样的方法来辨识未来世的因果，一直辨识到证悟阿拉汉果以及般涅槃之时。那时，禅修者能辨识到因为无明灭所以色法灭等等。能用这种方法辨识缘起后，也应继续学习<a href=\"https://www.guang5.com/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>与义注中教导的其他种辨识缘起的方法。此时，禅修者能暂时断除断见、常见、无因见、无作见等邪见，亦能断除对过去、现在与未来世的疑惑，从而证得「缘摄受智」，达到「度疑清净」。</p>\n<h2>观业处</h2>\n<p>　　在分析了究竟名色法与缘起之后，应进而修习观业处，观照它们为无常、苦、无我。因为观业处的所缘必须是究竟名色法与缘起，所以在还不能够辨识它们之前就修观并不能算是修习真正的观业处。</p>\n<p>　　第三种观智是「思惟智」，培育这种观智需要将行法以分组的方式进行觉照。将行法分为——两组：名与色；五组：五蕴；十二组：十二处；十八组：十八界；十二组：十二缘起支。于此阶段，禅修者必须逐一观照每组行法的「无常、苦、无我」三相。以智观照一切行法的生灭本质为「无常」，不断受到生灭压迫的本质为「苦」，没有永恒不坏灭的实质或我为「无我」。</p>\n<p>　　在「生灭随观智」阶段，禅修者必须观照一切名色法直至它们的当下刹那（kha?a paccuppanna），并很清楚地观照到它们极其迅速的生灭。从「坏灭随观智」开始，禅修者不再作意行法或名色法的生起，而只作意其坏灭，观智成熟时，将会只看到行法的坏灭。此时，禅修者在观照称为「所知」（¤àta）的行法之同时，也必须修习「反观」（pa?ivipassanà），即观照称为「智」（¤à?a）的观智也是无常、苦、无我。禅修者如此观照所有内、外、过去、现在、未来行法的坏灭为「无常、苦、无我」之后，会看到没有任何东西可执取的诸行法之过患，并因此对它们感到厌离，内心之中自然会产生从它们当中获得<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的愿望，寻求唯一的无为法——涅槃。</p>\n<p>　　如果禅修者在过去生中累积了足够的巴拉蜜，而在今生又足够精进地修行观业处，当观智成熟时，就能够证悟以涅槃为目标的道智与果智。此时，禅修者将发现所有的行法止息了，而内心却能完全地觉知寂界涅槃，获得四圣谛的真实智慧，现法亲证涅槃。</p>\n</div>"
    }
]