[
    {
        "title": "知足常乐",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x77E5;&#x8DB3;&#x5E38;&#x4E50;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022217910.jpg\" /></p>\n<h2><a href=\"/rmgjc/zhizuchangle.html\" class=\"keylink\" target=\"_blank\">知足常乐</a></h2>\n<p>　　知足常乐，谓自知满足则心常快乐。语本《老子》：“祸莫大於不知足，咎莫大於欲得，故知足之足常足矣。”况周颐《蕙风词话》卷二：“委心任运，不失其为我。知足常乐，不愿乎其外。”王西彦《古屋》第一部四：“一个快乐主义者首先得有知足的修养，就是古训所谓‘知足常乐’。”</p>\n<h2>词语解释</h2>\n<p>　　<strong>注：</strong>本词中的“知”是知道的意思，与知识无关，“知足”并无知识充足之意，更与《孙子》无关。</p>\n<p>　　<strong>出处：</strong>《<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>经》第四十四章，“名与身孰亲？身与货孰多？得与亡孰病？甚爱必大费，多藏必厚亡。故知足不辱，知止不殆，可以长久。”第四十六章，“天下有道，却走马以粪；天下无道，戎马生于郊。罪莫大于可欲，咎莫大于欲得，祸莫大于不知足。故知足之足，恒足矣。”</p>\n<p>　　<strong>译文：</strong>“天下有道，退马还田以耕种。天下无道，兵马驰骋于郊。祸患没有比不懂用兵之道更大的了，过失没比中敌人利诱之计更大的了。所以知识充足之足，才是恒常之足”。孙子曰：“故善动敌者，形之敌必从之；予之，敌必取之。以利动之，以卒待之”。</p>\n<p>　　<strong>本意：</strong>知道满足，就会经常（长久）的快乐。</p>\n<h2>详解</h2>\n<p>　　很多人把知足常乐仅仅理解为，知道满足总是快乐的。把快乐定义在所得到和满足的欲望上，片面的定义了知足常乐的含义，比较消极和安于现状，这样的满足所带来的快乐其实是不能够长久的。</p>\n<p>　　老子要告诉我们的是何时该终止自己的欲望，怎么样才能终止自己的欲望，如果不及时终止无穷的欲望会有什么样的后果（戎马生于郊）。只有由知道满足而获得的富足，才是长久的富足。这个由字，指出了长久快乐的根源（故知足之足，恒足矣），这才是老子的大智慧啊！</p>\n<p>　　在道德经中老子告诉我们只有拥有充足的知识和无比的智慧，把快乐建立在对事物通透的认识和理解上，看透事物发展的规律，明白无穷欲望带来的后果，及时终止自己的欲望而免遭损失和灾难，只有这样才会获得长久的平安富足和快乐（故知足不辱，知止不殆，可以长久）。而不是把快乐定义在所得到和所满足的欲望上。</p>\n<p>　　墨子曰：“知止，则日进无疆”。隋朝中<a href=\"/ctwh/zhuzibaijia/daojia/wenzi.html\" class=\"keylink\" target=\"_blank\">文子</a>王通：“大智知止，小智唯谋”。<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>《大学》：“知止而后有定” 。魏·王弼：“天下有道，知足知止，无求于外，各修其内而已”。便是其印证。</p>\n<p>　　即使在现代汉语中，知道也是在知识的范畴之内。知识的解释已经包含了知道，它本身就是知识的一部分。知道的本意就是指知识，是一种认知水平！</p>\n<p>　　由此可见只有拥有足够的知识才能经常长久的快乐。没有足够的知识和认知水平怎么可能知道什么时候该满足？当你有了足够的知识和见解，足够的认知水平，那么你看待事物的眼光，对待名利的态度，对待<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中的一切以及世界观价值观才会有正确的认识，才会长久的快乐！</p>\n<p>　　这里的“知”不作知识解，“知足”也不作知识充足解。</p>\n</div>"
    }
]