[
    {
        "title": "【中阴】-中阴的意思",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x4E2D;&#x9634;&#x3011;-&#x4E2D;&#x9634;&#x7684;&#x610F;&#x601D;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022232230.jpg\" /></p>\n<h2>中阴</h2>\n<p>　　中阴：<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>说，人死后以至往生轮回某一道为止的一段时期，共有四十九天。此时期亡者的灵体叫做中阴（Antrabhara)。</p>\n<h2>定义</h2>\n<p>　　中阴又称「中蕴身」、「中蕴有」、亦称「中阴有」、「中阴身」。藏文「中阴」意为「一情境结束」与「另一情境展开」间之过渡时期。断气、甫亡谓「死有」，来世投胎（即转世）时曰「生有」。中阴：佛教说，人死后以至往生轮回某一道为止的一段时期，共有四十九天。此时期亡者的灵体叫做中阴（Antrabhara），据说如童子之形一般。佛教以为在这七七四十九天中，延请僧人为亡者做佛事，则亡者能得益。如此，每七日为一期，叫做‘做七’。‘命终之人在中阴中身如小儿，罪福未定，应为修福，愿亡者神，使生十方<a href=\"/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>’（随愿往生经）。‘父母兄弟和上阿阇梨亡灭之日，及<a href=\"/sushi/yaoshan/sanqi/\" class=\"keylink\" target=\"_blank\">三七</a>日、四七日，乃至七七日亦应读诵讲说大乘经律’（梵纲经下）。[2]</p>\n<p>　　如果生了致命的大病，则是从发病开始，逐渐走向死亡，直到死后法性中阴出现之前的过程，就是临终中阴；在临终中阴之后，开始看到强光、听到嘈杂的声音、出现很多愤怒本尊等景象的过程，就是法性中阴；从投胎前寻找身体以及开始投胎的过程，就是有中阴，或说轮回中阴。在这三种中阴期间，都有获得<a href=\"/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的机会。[3]</p>\n<h2>阶段</h2>\n<p>　　中阴要经过三个阶段：临终中阴 法性中阴 轮回中阴。</p>\n<h2>详细内容</h2>\n<p>　　它们都属于极度不确定的时段。就拿此生为主要例子吧！当四周的世界变得更为混乱时，我们的<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>就会变得更加支离破碎。由于接触不到和远离我们自己，我们就变得焦虑不安和经常胡思<a href=\"/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。一个小危机就会刺破我们赖以隐藏的策略气球。一个<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>的时刻，就可以告诉我们一切都是那么不确定和变动不居。生活在现代世界，就是生活在明显的中阴界；你不必等到过世才会经验到中阴。</p>\n<h2>其他实相</h2>\n<p>　　中阴是机会，但能够让我们抓住机会的中阴又是什么呢？答案很简单：它们都是心的不同状态和不同实相。</p>\n<p>　　在佛教的训练里，我们透过禅修来准备，正确地发现心的各种相关层面，并娴<a href=\"/sushi/yaoshan/shudi/\" class=\"keylink\" target=\"_blank\">熟地</a>进入<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>的不同层面。在整个<a href=\"/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>轮回中，我们所经验的各个中阴状态和意识层面，两者之间具有清楚而确定的关系。所以，不管是我们存活着或去世后，当我们从一个中阴进入另一个中阴时，意识会相应改变；我们可以透过<a href=\"/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，很切身地认识这些改变，最后则完全掌握。</p>\n<p>　　死亡中阴所展开的过程，埋藏在我们的内心深处，因此它们也会在我们活着时，在心的许多层面显现出来。譬如，我们在睡梦中的细微意识，就很类似与死亡有关的三种中阴：</p>\n<p>　　．入睡类似临终中阴，各种元素和思想过程在这个时候溶化，进入地光明的经验中。</p>\n<p>　　．做梦类似受生中阴，在受生中阴阶段你具有敏锐的觉察力，还有活动性很强的「意生身」( mental body )，会通过各种经验。在梦中境界，我们也有类似的身，称为「梦之身」( dream body )，会通过各种梦境的经验。</p>\n<p>　　．在临终中阴和受生中阴之间，有一个很特别的明光境界，我称它为「法性中阴」。这是会发生在每个人身上的经验，但只有很少数人会注意到它，能够完全经验到它的人更是少之又少，因为只有修行老练的人才能认出它。这种法性中阴，相对地等于入睡后、做梦前的阶段。</p>\n<p>　　当然，比起睡梦的状态，死亡中阴是更为深沉的意识状态，也是力量更为强大的时刻，但它们的各种细微层面，却彼此相关，就好象意识的所有不同层面。上师们常常利用这个特别的比较，来显示在中阴里要维持觉醒是多么困难。当我们熟睡后，有多少人能觉察到意识的改变呢？有多少人能觉察到入睡后做梦前的时刻呢？甚至当梦到我们正在做梦时，又有多少人能觉察到呢？因此，请想象在死亡中阴的混乱中，想维持觉醒有多困难！</p>\n<p>　　你在睡梦中有什么样的心，显示你在相应的中阴会有什么样的心，譬如，你对梦、梦魇和困难的反应方式，显示出你死后可能会有的反应。</p>\n<p>　　这就是为什么在为死亡而做的准备中，睡梦瑜伽会扮演如此重要的角色的原因。一位真正的修行人所该做的，就是不分昼夜持续对心性觉察分明，因而直接使用睡梦的不同层面，来认识和熟悉临终中阴和死后中阴即将发生的事。</p>\n<p>　　所以，我们发现还有其他两种中阴也被包含在这一世的自然中阴里：睡梦中阴和<a href=\"/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>中阴。禅定是白天的修行，睡梦瑜伽则是夜间的修行。在《中阴闻教得度》所属的传统里，这两种中阴被加在上述四种中阴之上，形成六种中阴。</p>\n</div>"
    }
]