[
    {
        "title": "【自杀】-佛教怎么看待自杀",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center\"><img alt=\"&#x3010;&#x81EA;&#x6740;&#x3011;-&#x4F5B;&#x6559;&#x600E;&#x4E48;&#x770B;&#x5F85;&#x81EA;&#x6740;\" src=\"https://www.guang5.com/uploadfile/2017/0412/20170412022231445.jpg\" /></p>\n<h2><a href=\"/rmgjc/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a> （社会现象术语）</h2>\n<p>　　自杀是指个体在复杂心理活动作用下，蓄意或自愿采取各种手段结束自己生命的行为。自杀作为一种复杂的社会现象，学者们对其分类有不同的看法。</p>\n<p>　　19世纪末，法国社会学家涂尔干因其对自杀原因的解释和分类信受学者的重视。涂尔干认为，自杀并不是一种简单的个人行为，而是对正在解体的社会的反应。由于社会的动乱和衰退造成了社会、文化的不稳定状态，破坏了对个体非常重要的社会支持和交往。因而就削弱了生存的能力、<a href=\"/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>和意志，导致自杀率明显增高。涂尔干还依社会对个人关系及控制力的强弱，把自杀分为四种类型。</p>\n<p>　　美国国立精神卫生研究所自杀预防研究中心分类为“完全性自杀（CS）、自杀企图（SA）、自杀观念（SI）”</p>\n<p>　　Bowsell（1963）把自杀分为“自杀姿态、矛盾的自杀企图、严重的自杀企图、完全性自杀”。</p>\n<p>　　其他分类有：习俗性自杀、慢性自杀、疏忽性自杀、不完全放意性自杀、精神病性自杀等。</p>\n<p>　　根据自杀的结果，一般分为自杀意念、自杀未遂和自杀成功三种形态。</p>\n<h2>类型</h2>\n<h3>　　利他性</h3>\n<p>　　利他性自杀指在社会习俗或群体压力下，或为追求某种目标而自杀。常常是为了负责任，牺牲小我而完成大我。如屈原投身汨罗江，以死唤起民众的觉醒；孟姜女哭长城，殉夫自杀；疾病缠身的人为避免连累家人或社会而自杀等。这类自杀者的共同心理是死是有价值的，是唯一的选择。涂尔干认为在原始社会和军队里这类自杀较多。在现代社会里越来越少。</p>\n<h3>　　自我性</h3>\n<p>　　自我性自杀与利他性自杀正好相反。指因个人失去社会之约束与联系，对身处的社会及群体毫不关心，孤独而自杀。如离婚者、无子女者。涂尔干认为这类自杀在<a href=\"/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>气氛浓厚的社会发生机会较低。</p>\n<h3>　　失调性</h3>\n<p>　　失调性自杀指个人与社会固有的关系被破坏。例如，失去工作、失去学习能力、失去（没有）自理能力、亲人死亡、失恋等，令人访惶不知所措而难以控制而自杀。</p>\n<h3>　　<a href=\"/rmgjc/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>性</h3>\n<p>　　宿命性自杀指个人因种种原因，受外界过分控制及指挥，感到<a href=\"/rmgjc/mingyun.html\" class=\"keylink\" target=\"_blank\">命运</a>完全非自己可以控制时而自杀。如监犯被困的密室中、<a href=\"/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>徒为主而献身。</p>\n<p>　　中国学者把自杀分为情绪性自杀和理智性自杀两类。</p>\n<p>　　情绪型自杀常常由于爆发性的情绪所引起，其中由委屈、悔恨、内疚、羞惭、激愤、烦躁或赌气等情绪状态所引起的自杀。此类自杀进程比较迅速，发展期短，甚至呈现即时的冲动性或突发性。</p>\n<p>　　理智性自杀不是由于偶然的外界刺激唤起的激情状态导致的，而是由于自身经过长期的评价和体验，进行了充分的判断和推理以后，逐渐地萌发自杀的意向，并且有目的、有计划地选择自杀措施。因此，自杀的进程比较缓慢，发展期较长。</p>\n<h3>　　传染性</h3>\n<p>　　在有关自杀的研究中，自杀的传染性是一个受重视的现象。不少研究都介绍过因影视、广播等媒体详尽报道一些自杀事件，而使社会上自杀或企图自杀者增加的事实。日本曾出现一位走红女演星跳楼自杀事件，此后的几个月中，连续不断出现采用类似方式而自杀的事件，其中女学生居多；筑波大学发生过一男性教师从理工大楼7层跳楼自杀，一年中在同一地方先后以同样的方式自杀3人。</p>\n<p>　　研究表明，自杀的模仿性现象及潜<a href=\"/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>引导确实存在。对1973年～1979年美国电视报道自杀事件的研究报告指出，电视报道自杀事件确能导致青少年自杀率上升，越多媒体报道，内容越详尽，则引致自杀率上升幅度也越大。青少年女性自杀率上升约13%，男性上升5%.</p>\n<p>　　学者们认为最容易引发模仿性自杀的新闻报道有以下特征：详细报道自杀方法；对自杀而引致的身体伤残很少提及；忽略了自杀者生前长期有心理不<a href=\"/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>的问题；将引发自杀的原因简单化；自杀者知名度高，社会影响大；使人误认为自杀会带来好处等。</p>\n<p>　　为减低自杀的传染现象，学者们强调大众传播媒介注意在报道自杀事件时应该持谨慎态度，应尽量指出自杀者实际有很多其他可以选择的途径，自杀不是唯一出路，以便尽量减少那些有自杀意念的人认为自杀是一种正确处理困难的方法，自杀是一种可以理解的选择。</p>\n<h3>　　补充：自杀也可以细分以下7种类型</h3>\n<p>　　1、现实型</p>\n<p>　　这类自杀由这样一种情形促成，确认自己必死无疑，且死前很<a href=\"/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。</p>\n<p>　　2、利他型</p>\n<p>　　个人行为屈从于团队的<a href=\"/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>标准，这个团队要求至少是赞成自杀行为的，比如二战时期的神风特攻队。</p>\n<p>　　3、<a href=\"/rmgjc/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>型</p>\n<p>　　个人摆出自杀的姿态企图影响或控制他人，结果错误的判断导致了意料之外的死亡。</p>\n<p>　　4、泄愤型</p>\n<p>　　与无心自杀一样，这种自杀的焦点也是指向他人，但自杀的意图是真的，旨在通过自杀让他人陷入自罪和谴责。</p>\n<p>　　5、怪异型</p>\n<p>　　个人的自杀是因为幻觉（有声音命令其自杀）或者<a href=\"/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>（坚持自杀会改变世界）。</p>\n<p>　　6、失范型</p>\n<p>　　经济或社会爆发的动荡（比如大萧条时一夜间倾家荡产）显著的改变了一个人的<a href=\"/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>。个人无法应对，所以选择自杀。</p>\n<p>　　7、消极自我型</p>\n<p>　　长期的<a href=\"/rmgjc/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>或是长久的失败感与无能感结合在一起，导致反复的自杀尝试，最终自杀成功。</p>\n<h2>情绪缓解</h2>\n<h3>　　自杀情绪的形成</h3>\n<p>　　自杀行为的形成相当复杂，涉及生物、心理、文化及环境因素，根据精神医学研究报告，自杀的人70%有忧郁症，精神疾病者自杀机率更高达20%。</p>\n<p>　　在社会环境因素中社会的脱序现象---暴力、犯罪、毒品、离婚、失业等，以及个别情况因素中的家庭问题、婚变、失落、迁移、失业、身体疾病、其它自杀事件的影响与暗示等，都是影响自杀的成因。研究显示任何单一因素都不是自杀之充分条件，只有当它们和其它重要因素合并发生时才发生。</p>\n<h3>　　特征</h3>\n<p>　　在认知上错误地觉知或解释外界的刺激，在思考上有不合逻辑的推论形式，而令个人形成负向的感受、较低的自尊、甚至形成<a href=\"/rmgjc/zuie.html\" class=\"keylink\" target=\"_blank\">罪恶</a>感或无助感，最后即可能造成忧郁。</p>\n<p>　　在自杀行为发生前，于脑海中围绕着对死亡的看法，是不会动了、是不会回来了、是愉快的、不愉快的、是可逆的、不可逆的等，影响对自己、对未来、对社会的判断，是有价值的、无价值的、是有希望的、无希望的等，并会以文字、语言、或行为来表达「想死」的企图。</p>\n<h3>　　调适</h3>\n<p>　　当有人谈及自杀念头时，你要认真考虑相信他的话，因为他可能有了麻烦，他正发出求援讯号，他也可能正打算把这想法付诸于行动，所以你不要忌讳，一定要做些什么。首先，你要对他----</p>\n<h3>　　助人篇</h3>\n<p>　　建立关系：对他表明你真诚的关切，主动关心他、鼓励他。</p>\n<p>　　聆听：一个想自杀的人最需要有人聆听他的心声、听出他的感受，这就是一种支持的力量。</p>\n<p>　　求援：当有立即的危机可能，请不要抛下他，你可与任何可咨询的机构或信赖的人寻求支持，或报警处理。</p>\n<h3>　　自助篇</h3>\n<p>　　所有发生于我，对每一个人来说它都会是相同不愉快的经验</p>\n<p>　　我没有任何理由需要独自扛下全世界的重担。</p>\n<p>　　我心中的痛苦与恐惧祗要说出来，就会像放下重担，让我松口气。</p>\n<p>　　若有需要，可以向我的家人与朋友寻求协助。</p>\n<p>　　经由电话与危机中心的心理咨询师或学校的辅导员谈话可以帮助我纾解情绪、提供救援。</p>\n</div>"
    }
]