[{
    "title": "佛说波斯匿王太后崩尘土坌身经 第122部",
    "author": "法炬 译",
    "html": "<div class=\"B1_text\"><p>佛说波斯匿王太后崩尘土坌身经</p><p>西晋<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法炬译</p><p>闻如是。一时婆伽婆。在舍卫城祇树给孤独园。尔时拘娑罗国波斯匿王太后崩。时年百岁老无壮势。<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>修善法。时波斯匿王供殡送母。日正中还。尘土坌身步往诣园至<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所。头面礼足在一面坐。时世尊问王言。今王何故尘土坌身步来至我所。时波斯匿王便涕泣不能自胜。挥泪白世尊言。太后崩。世尊。太后<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。如来。年在期颐无少壮力。积修善法甚恋痛念。夙夜<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>未曾违志。命可赎者世殒身寿。若象马车乘赎命可得者。尽当持赎。以人民众赎命可得者。亦当持赎。莫使我母命过。若以金银赎命可得者。亦当持赎。若以珍宝赎命可得者。亦当持赎若以金银珍宝赎命可得者。亦当持金银珍宝赎命。若以奴赎命可得者。亦当持奴赎命。若以婢赎命可得者。亦当持婢赎命。若以奴婢赎命可得者。亦当持奴婢赎命。若以村落赎命可得者。亦当以村落赎命。若以城廓赎命可得者。亦当以城廓赎命。若以村落城廓赎命可得者。亦当以城廓村落赎命。若以一方赎命可得者。亦当以一方赎命。若以地人民赎命可得者。亦当以地人民赎命。若以人民一方赎命可得者。亦当以人民一方赎命。莫使我母命过。尔时世尊告波斯匿王言。如是大王。如王所说。若以白象赎命可得者。便可以象赎母命。若以马车人民珍宝金银奴婢村落城廓一方人民赎母命可得者。便当以一方人民赎母命。莫使我母命过。是故大王。当思惟无常想。当广布无常想。当广布死想。尔时世尊便说偈言</p><p>一切人归死无有不死者</p><p>随行种殃福自获<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>果</p><p><a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>为恶<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>者必生天</p><p>明慧能分别唯福能遏恶</p><p>如是大王。有四恐畏。大恐畏无能避者。亦不可以力刀杖避。咒术药草象马车乘人民。珍宝金银奴婢村落城廓一方人民。珍宝金银奴婢村落城廓一方人民。云何为四。老为大恐畏。肌肉消尽。不可以刀杖避。乃至一方人民皆无能避。病为大恐畏。无强健志。不可以刀杖避。乃至一方人民。死为大恐畏。尽无有寿。不可以刀杖避。乃至一方人民。恩爱别离为大恐畏。不可以刀杖避。乃至一方人民。是谓大王有此四大恐畏。不可以刀杖避。咒术药草象马车乘人民。珍宝金银奴婢村落城廓一方人民。珍宝金银奴婢村落城廓一方人民。譬如大王有大云起雷电霹雳。斯须还散亦不久停。如是大王。人命极短寿极百岁。其中出者亦少少耳。譬如大王有四大山石无有空缺。四山皆等一时相磨。树木药草不可以刀杖避。如是大王。有四大恐畏至。不可得避。云何为四。老为大患。肌肉消尽。不可以刀杖避。药草咒术而得避者。病为大患。无强健志。死为大患。身永灭。恩爱别离为大患。不可以刀杖避。咒术药草而得避者。大王。广修无常想。广布无常想。所以然者。已修无常想。当布无常想。尽断一切欲爱。尽断一切色爱。尽断一切无色爱。一切无明尽断。此间所有爱亦断。譬如大王草藁积薪积以火往烧。大<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>若台阁舍此亦如是。若修无常想。广布无常想。尽断欲爱。尽断色爱。尽断无色爱。尽断无明。尽断此间所有爱。是故大王。当以<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>治化。莫以非法治化。如是大王。当作是学。尔时波斯匿王白世尊言。此法名何等。当云何奉持。世尊告曰。名除忧患经。此法除去忧患。时波斯匿王白世尊言。如是世尊。除忧患经。如是世尊。除忧患经。所以然者我闻此法已。世尊。所有恋慕愁忧皆悉除尽。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>身体柔软<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。尔时世尊与王波斯匿。具说微妙法劝令欢喜。时波斯匿王即从坐起。头面礼足绕佛三匝而去。尔时拘娑罗国波斯匿王闻佛所说。欢喜奉行</p><p>佛说波斯匿王太后崩尘土坌身经</p></div>"
}]