[{
    "title": "佛说伏淫经 第65部",
    "author": "法炬 译",
    "html": "<div class=\"B1_text\"><p>　　佛说伏淫经</p><p>　　西晋<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法炬译</p><p>　　闻如是。一时婆加婆。在舍卫城祇树给孤独园。彼时<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>阿那邠祁至<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所。到已礼世尊足却住一面。阿那邠祁居士却住一面已。白世尊曰。唯世尊。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>有几伏淫而可知者。汝居士。世间有十伏淫。云何为十。此居士。或一伏淫。非法行淫干彼。非法求淫干(无所方便为苦)已。亦不自安身。亦不安父母及妻子客使奴婢沙门<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。不有益事。为善得善得生天上。如是居士。是一伏淫。复次居士。或一伏淫。非法求淫干彼。非法求淫干已。自安身父母妻子客使奴婢。而不施沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。非法求干彼非法求干已。自安隐身父母妻子客使奴婢。能施沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>求财。彼如法求财已。不自安乐身。不为父母。不为妻子。不为奴婢。亦不施沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。如法求财。彼如法求财已。而自安乐身及父母妻子奴婢。不施与沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。如法求财。彼如法求财已。而自安乐身及父母妻子奴婢。施与沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。如法求财不干彼。如法求财不干已。亦不自安乐身。亦不为父母妻子奴婢亦不施与沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。如法求财不干彼。如法求财不干已。自得安乐身及父母妻子奴婢。不施与沙门婆罗门。为善得善身生善处。如是居士。是一伏淫。复次居士。或一伏淫。如法求财不干彼。如法求财不干已。自得安乐身及父母妻子奴婢。施与沙门婆罗门。为善得善身生善处。彼得钱财于中染着。极染着不见祸变。亦不知弃而贪食之。如是居士。是一伏淫。复次居士。或一伏淫。如法求钱财不干彼。如法求钱财不干已。自得安隐身及父母妻子奴婢。施与沙门婆罗门。为善得善身生善处。彼得钱财亦不染亦不着。亦不于中乐。亦不于中住。亦知是祸变。亦能弃舍而食之。如是居士。是一伏淫。此居士。彼或一伏淫。非法求钱财干彼。非法求钱财干已。亦不自安隐身。亦不安隐父母妻子奴婢。亦不施与沙门婆罗门。为善得善身生善处。是为居士。如是伏淫。伏淫我说此弊恶。此居士。或一伏淫。非法求钱财干彼。非法求钱财干已。自安隐身及父母妻子奴婢。不施与沙门婆罗门。为善得善身生善处。此居士。此伏淫此伏淫此小胜小胜此居士。彼或一伏淫。如法求钱财不干彼。如法求钱财不干已。自得安乐身及父母妻子奴婢。施与沙门婆罗门。为善得善身生善处。彼得钱财不染不着不持不乐。知是祸变弃舍离而食之。如是居士。食淫最胜最妙最上最好无上胜。犹若居士。有牛乳因乳有酪。因酪有醍醐。因醍醐有酥。因酥有酪酥。此是最胜最妙无上说。如是居士。此诸伏淫如是伏淫。最胜最妙极妙最上。无上无上说颂偈曰</p><p>　　非法聚钱财　　如法如法施</p><p>　　不施不食之　　亦不施为福</p><p>　　二俱为悭浊　　恶行食此淫</p><p>　　如法求钱财　　欲以施为福</p><p>　　亦施及食之　　亦能作福德</p><p>　　二俱不悭浊　　皆有此伏淫</p><p>　　有能行<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>　　伏淫随所行</p><p>　　知变有知足　　知足而食之</p><p>　　有能行智慧　　最妙能伏淫</p><p>　　佛如是说。居士阿那邠祁闻世尊所说。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>而乐</p><p>　　佛说伏淫经</p></div>"
}]