[{
    "title": "一、正法念处经原文：云何偷盗乐行多作。云何乐行多作。盗已堕于地狱。此恶戒人。性自偷盗。近恶知识。若恶知识近住之人与彼相随。则行偷盗。",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p/><p>一、正法念处经原文：<strong>云何偷盗乐行多作。云何乐行多作。盗已堕于地狱。此恶戒人。性自偷盗。近恶知识。若恶知识近住之人与彼相随。则行偷盗。</strong></p><p><strong>有下中上。何者为下。谓王法等。如前所说。何者为中。非福田所。偷盗彼物。此盗为中。何者为上。佛法僧物。微少偷盗。是则为上。</strong></p><p><strong>彼佛法僧。若盗僧物。佛法能净。盗佛法物。僧不能净。若盗众僧现食用物。堕大地狱。头面在下。若取属僧所常食物。则堕无间阿鼻地狱。宽广闇等。以重福田。微少偷盗。以有心念。乐行多作。彼少偷盗。堕于地狱畜生饿鬼。若复忏悔。不生随喜。心中生悔。彼不定受。若偷盗人。无量方便而行偷盗。以如是故。名为偷盗。</strong></p><p>这里讲偷盗最严重的是盗取三宝物，偷盗业中这条最重，盗取佛法僧三宝物。所谓盗取，就是说属于三宝物，不经同意，自意取之，当作自己物自作主张而用。即使非常微少之物，果报也极重，譬如纸巾、毛巾等等之类，如果盗取比这贵重物品，果报更重。如果有犯者，自己想办法弥补以减轻罪障。经常到寺院里去的人，自己多反省检讨自己有没有盗取之事，包括蝇头小利。</p><p>布施三宝能得无量福，但盗取和占有三宝物能得无量罪和无量的债。三宝是世间最大的福田，得福最大，得罪也最大。地藏经说寺院一棵草拿之都有罪，不要说比一棵草还要贵重的物品了，包括水、电、煤气、食物、茶和各种用具。</p><p>侵占也属于盗的范围，不仅包括饮食和物品，还包括属于三宝的各种权利和职责，本来属于三宝应该行使的权力和职责，他人非要擅自替三宝作主，动用和调配属于三宝的人、财、物，欺压在三宝头上，这个罪更大。占有和夺取三宝的功德、地位和名声，也属于盗，这个罪可能就更大了。</p><p>这些戒律，我们如果能严格守持不犯，心自然就会清净下来，不再想着要得什么，占什么便宜，把心收摄起来，自然就有禅定了。一个人心定不下来，肯定是心里有事，如果把这些事都放弃，不再惦念了，何愁修不出禅定？</p><p>养成不占任何人和团体的便宜的习惯就好了，有了这个好习惯，就会少欠很多的债务，少失去很多的福德，得便宜处正是失便宜处。世界上根本就没有能占得的便宜，因为有因果存在，每占一分便宜，各自如来藏都有记录，因缘成熟都会千倍万倍无量倍的还回去，还的越晚，孽息越高，还的越多。</p></div>"
},{
    "title": "二、五戒中盗戒的范围",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>二、五戒中盗戒的范围</p><p>盗，就是不予取，不是自己的，却要占为己有。凡是得到了不属于自己所有的东西，都属于盗。其范围都包括哪些？</p><p>比如说在一个团体中，甲是第一好的人，而乙却说自己是第一好。乙把第一好的名誉归为自己所有，甲的第一好的名誉就被乙占有了，乙的行为是否属于盗取了甲的名誉？</p><p>某项工作明明是甲做的，而乙却说是自己做的，乙是否盗取了甲的工作业绩？一个团体中甲拥有某种权力，而乙却不自觉的行使了这种权力。乙是否盗取了甲的权力？这种盗，也可以说是妄语。一种身口意行可以触及两种戒行，同时犯两种戒。</p><p>其实五戒只涉及身和口，不涉及意，不管意如何，只要身口不犯，就不算犯戒。所以五戒不戒心，只戒身口，属于小乘戒，看住身守住口，守好了，做人的修为也就好了，来世可以继续做人，也可以断我见证果，但要想开悟还要受菩萨戒，守菩萨戒。</p><p>守好五戒，就有德，有人格修养；不能守持五戒，人格不全，修为不够好，人德不具足。如果凡夫的人格修养都不具足，那就不可能断我见成为圣贤人，超越于人。</p><p>如果五条戒都不能守好，也不敢受，那么出家人的几百条戒，该如何守持呢？那么多在家居士总是诽谤出家人如何如何不好，可是自己又怎么样呢？与出家人的舍弃世俗背离世俗的心行以及能受几百条戒律约束的心行，相差究竟有多大？</p><p>五戒只有五条，看似简单和容易，其实并不简单和容易。能完全守住五戒的少之又少。盗戒和妄语戒不好守，极大多数人并不明确了解其中内涵和范围。</p><p>守五戒，也就是做人，如果连人都做不好，还谈什么果不果的，来世三涂。不少人都没受五戒，就暗示自己证果了开悟了。小乘五戒的身口如果都不能守住，如何能守住大乘菩萨的心意戒？守意是最难最难的，起心动念不造恶业，很难做得到。那么瑜伽师地论中的菩萨戒就更难更难守护，不断除烦恼，连想都不要想，那是断除烦恼的地上菩萨所受持守持的，只管起心动念，不管身口行为，只要能利益到众生，该做的一定要做，否则就犯菩萨戒。这样的戒，地前菩萨都做不到，何况凡夫众生，可是也有不少人在学这个戒并且受这个戒，不知道这样的菩萨戒体从哪里能得到。</p><p>身口是六识的造作，意是意根的心行。能管住意根，身口必然不犯；反之，即使意根心念不正，意识强行压制，假装清净，身口也可以不犯，身口不犯，五戒就不犯。管住意根压伏意根非常难，把意根熏修成功，断除烦恼自动自觉不管用就更难了。</p><p>不断烦恼，意业必然会犯，所以断除烦恼一定是要断除意根的烦恼，才能自动自觉，不用意识强行压制。如果只断除意识的烦恼，只能算作压制烦恼，不是断烦恼，当意识疏忽大意时，意根就会突然现行出烦恼，河水就决堤泛滥了。</p></div>"
},{
    "title": "三、关于盗墓罪和供佛的问题",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>三、关于盗墓罪和供佛的问题</p><p>盗墓者偷盗的物品是属于谁所有的？盗的是谁的东西？墓穴中的物品一律属于墓主所有，墓主是死者，不是死者家属，家属有监护监管的责任和权利。陪葬品都属于死者所有，因为陪葬品是送给死者的，理上事上都归于死者，死者是墓地里物品的主人。死者有意根，有阿赖耶识，可以拥有陪葬品，不管能否用得着，不管执著不执著这些物品。直至陪葬品腐烂为止，不允许他人动用，除非墓主托梦于人拜托如何使用，否则拿走即为盗，包括家属也不可以动用。</p><p>死者身体虽然灭了，没有功用了，但是死者仍然是有情众生，有意根和阿赖耶识不灭，可以拥有、守护和使用陪葬品，即使有身体的活人，一切物品也都是识心拥有和使用，身体被识心所用，识心理应照顾爱护身体。不管主人高兴不高兴，物品永远属于主人所有，陪葬品不管死人执着不执着永远属于死人所有。哪管死人变成了鬼畜和天人，那些物品也属于那个人所有，别人不可以随意拿走使用，除非交换什么物品，用以代替。比如说你买了一套家具放在家里，然后就出国定居了，不一定回来。你那套家具和房子还是属于你所有的，不管物品有用与否，该是谁的东西，永远是谁的东西。不管主人慈悲与否，宽厚与否，大度与否，只要主人物主允许，否则任何人动用都属于盗用。</p><p>比如说佛是最大最高最尊的圣人，佛最慈悲最宽厚，无执而大度，可是供佛的物品属于佛所有，随便拿来用，就是盗佛物。盗佛物盗三宝物可是比盗普通人物品要严重无数倍，而且越有德行越慈悲越宽厚的人，盗他的物品罪越大，所以不能以物主是否宽厚大度来定有罪与否。</p><p>偷盗罪的定罪不是由佛来定，不是由护法神来定，更不是由物主来定，而是自有因果律来定，由如来藏执掌因果律。比较大的因果佛不会去干预，小的结果要看偷盗者忏悔的诚心和善根，以及与佛的缘分，佛可以消除一部分遮障，护法神可以遮挡一下，其余的由因果来酬尝。忏悔是减轻果报的最有效方法，灭去偷盗心，从根本上消除罪业的源头，罪业才能消除一部分或者是全部。</p><p>由此可知，有情众生供佛的物品，属于佛所有，佛是物品主人，即使供佛的人也不可以随意取用，否则就是盗佛物。如果想用供佛之后的物品，就要在供佛的时候跟佛说：我供养佛陀菩萨这些物品，佛陀您做完佛事，受用精华完毕，剩余的外壳我要取回自用，佛陀用不上的部分归我使用。这样打好招呼，香燃烧完毕，就可以把供佛物撤下来了。或者是用其它的物品再代替佛陀用过的物品，作为交换。</p><p>既然佛是受用物品精华部分，那我们应该知道什么是精华部分。对于这部分我们要注意，一定不要去动，给佛留着，否则就是欺骗佛。骗佛的意思是说，佛本来是嗅香尝味的，你供佛的东西自己先把美味和香气给嗅尝了，佛需要的东西就没有了，或者是没有那么多了，先于佛而食，对佛是不尊重的，不能得福。供佛的物品，佛用了，众生得福，佛不用，众生还是得福，因为有供佛的真诚心交换得福，但是得福的差别非常大了。</p></div>"
},{
    "title": "四、五戒戒体的作用",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>四、五戒戒体的作用</p><p>三皈依不等于受五戒，受戒有戒体，皈依没有五戒戒体。戒体有遮止犯戒的作用，也有戒神守护，能够防非止恶，不受少受恶业果报，修行快速。如果刚刚受戒就犯戒，说明没有得戒体。没有得戒体的原因是因为自己的罪业没有忏悔清净，受戒时有遮障，需要再重新忏悔清净再受戒，直至得到戒体。</p><p>如果给自己授戒的师父本身犯戒，失去了戒体，自己从他那里受戒也不得戒体。所以为了保险起见，可以多受几次戒。如果授戒师修行好德行好，诸佛菩萨护法神护持就好，受戒时加持力大，感应大，受戒后改变大，道业提升的比较快。</p></div>"
},{
    "title": "五、受五戒和不受五戒恶业果报有区别吗？",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>五、受五戒和不受五戒恶业果报有区别吗？</p><p>凡是造恶业都是因为有恶心烦恼心的缘故，都属于心性不好，因此都有性罪，性罪的果报不管受戒与否都一样。因为众生都有贪嗔痴性障烦恼，所以众生都在六道轮回里受报，尤其是三恶道众生占极大多数。没有受戒的人，心性不与戒律相应，有所违法，心性上的果报与犯戒的人果报相同。</p><p>比如一个人虽然没有受五戒，杀人之后仍然要下地狱酬尝恶报，从地狱出来遇见那个人，还要偿还被杀者一条命，杀畜生也是这样，都有罪，需要受报需要偿命。犯其它方面的戒律也是一样，该受什么恶报还是要受什么恶报。如果没有受五戒，但是身口意行顺从五戒，心性善，就会受善报，得福享乐。并且所利益的众生，也会回报给他相应的利益。</p><p>但是受戒与否还是有一点差别，那就是受戒的人如果犯戒了，多了一条戒罪，违犯戒律的罪，明知故犯本身就是不尊重戒律，因而有罪。明知故犯与不知而犯的，烦恼还要重，因此果报要重一些。</p></div>"
},{
    "title": "六、盗自己前世物是否属于盗？",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>六、盗自己前世物是否属于盗？</p><p>假如一个人过世后仍然轮回做人，机缘巧合下他挖开自己上一世的墓穴，因为隔阴之谜自己又不知道这个墓穴是自己的上一世，这时他如果拿走陪葬品，算不算是物主的允许，如果不算这是不是盗呢？</p><p>这个人盗的虽然是自己前世的物品，但是这个行为仍然属于盗，因为有盗心。一切罪福业以心为主，无心则无罪福。但是由于这个人盗的是自己物，并没有侵害到他人，物品没有从他人那里转移到自己这里，物主没有更替，盗业不完全满足，得罪轻微。</p><p>有人明明是去别人家里偷某种东西，可是翻来翻去，却没有找到那种东西，与此情况相同。或者是正要把东西带走，可是主人回来了，只好放弃东西，自己逃脱。也与此情况相同。</p><p>这些实例说明，盗心存在，盗业不完全成立，物品没有转移，无法定罪，处置的会轻微，果报会轻微。</p></div>"
},{
    "title": "七、盗三宝物罪",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>七、盗三宝物罪</p><p>如果是在寺院，不管这任何东西寺院里有没有用，在家居士都不要擅自取用，更不要拿走。因为寺院里的所有物都属于十方僧物，包括娑婆世界以外的他方世界的僧人，十方世界的僧人都有权享用。你个人取用，盗的是十方世界出家人的物品，根本还不清，这个罪就是地狱业，甚至是无间地狱业。</p><p>十方供养，是十个方向的众生的供养，就是东、南、西、北、上、下、东南、西南、东北、西北。十方僧物，是十个方向世界的出家人的物品。世界有大有小，大的世界指围绕娑婆世界十个方向的佛国土，小的世界是指娑婆世界里面的十个方向的世界。比如娑婆世界三千大千世界的一个小世界包括四大洲、四大海、七金山、四天王天、忉利天、兜率天、夜魔天、化乐天和他化自在天，以及初禅天。一千个小世界是一个中千世界，一千个中千世界，是一个大千世界。</p><p>凡是犯了这个罪业的人，要在佛前殷重忏悔，直到见到好像为止，这个盗三宝物的罪业才能消除。如：佛来摸顶安慰你，告诉你罪业消除了，或者是见到莲花开敷，或者是闻到空中的香味，佛菩萨过来加持。否则这个罪业还在，命终就要下地狱受报。</p><p>故意或者是无意浪费寺院物品，就是浪费消耗了十方僧物，这个罪也不小，欠十方僧的债，也不容易还清。所以每个人在寺院里都要节俭，不要浪费，损坏东西一定要马上赔偿。过期就要加倍或者是多倍的赔偿。戒经里讲，如果一个人犯戒而不忏悔，过一夜，罪业要翻一倍，过二夜，再翻一倍，就是四倍了欠三宝债也是如此，过夜就翻倍。凡是曾经私自拿走寺院任何一个物品的，或者损坏物品的，或者浪费物品的，包括水电煤气之类，自己都要想办法弥补赔偿。属于偷盗性质的，不仅要赔偿，一定还要每天努力殷重忏悔，争取见好像。要想恶业消除，不受或者是少受恶报，一是忏悔，二是补救，金钱财产的补偿。</p><p>每个人无论在家，还是在工作单位，还是在寺院，以及所有公共场合，都要搞清楚，各个物品的主人是谁，不要侵犯物主的所有权力，用物先问主。包括自己的家人的权力，自己的父母孩子配偶的所有权，也不要侵犯和冒犯。这就是做人的修养和品德，清净做人，必有清净的果报。</p><p>如果是寺院故意放在某处的佛经等等结缘品，那都是免费结缘给大家的，可以自主取用，不必告知寺院主管人员。某些东西都是有特定人员管理，如果想用，要经过特定人员同意。如果不是特定管理人员，即使同意也不可以，取用那就属于盗。要看某人是否有那个权力和职责，不能随便找个人允许就行的。</p><p>有些居士到寺院，就喜欢替寺院师父当家做主，也不管师父是否愿意和允许，自己就夺取了一切权力，什么都擅自做主，好像在自己家里一样，不仅管事，还要管钱，更要管人。这个罪业相当大，能不能忏悔清净，都不知道。</p><p>甚至有些人到寺院里，连出家人都要管一管，出家人干什么与不干什么都要听自己指挥，指示出家人做自己安排的事，以满足自己的贪欲和心愿，以下犯上，蔑视三宝和三宝的尊严。出家人不归任何在家人管理和指使，只有出家人本人的师父有权力管理教育，以及所在寺院的主持和出家管事者有权管理。出家众最主要是受十方诸佛菩萨教育和管理，连土地神等等护法神都没有资格和权力，因为出家人直接是佛陀的弟子，不是护法神的弟子，出家人只可以礼拜佛菩萨，不可以礼拜护法神。所以如果在家人的权利欲太大的话，要尽量克制自己，实在克制不了，就远离寺院，远离出家众，免得造下地狱业，受地狱苦。</p><p>还有一些在家人，喜欢穿出家服，喜欢用出家人的名字。还有人喜欢冒充出家人，获得恭敬，获得各种供养，这是盗中大盗。还有一些在家居士，非要声称我们也是三宝，应该有三宝的待遇，侵犯三宝的名誉名声，影响相当恶劣，这是大贪大盗，不通忏悔，忏悔也没多大用处，仍然要到地狱里报道。</p></div>"
},{
    "title": "八、讨论盗的问题",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>八、讨论盗的问题</p><p>问：公园里有一颗枸杞子树，并不结枸杞子，每年这棵树如果不修枝剪叶，这棵树就长不好，剪去枝叶，树木长得会茂盛。如果有人去采摘树上的叶子回家吃，这算不算盗？</p><p>甲答：首先这个树不是自己的，如果有盗心或者占便宜的心思那就算偷盗。</p><p>乙答：算。公园枸杞树，为全体人民所有，若未经允许偷吃，就是偷盗。以偷心移动，就是偷盗。</p><p>丙答：根据现行法律规定，地面及地面上的物产，在没有指定所有人时，其归属权为全民，属于社会全体公共财产。</p><p>那么，我们去荒山采摘果子，也是属于偷盗行为。因贪心而采摘枸杞带回家，和饿了无意摘下吃掉，都算偷盗，但果报肯定差别很大。</p><p>问：如果是公园默许呢？如果摘掉叶子，树长得会更好呢？如果摘掉叶子，就省去了公园管理人员再去修枝剪叶的劳动了呢？如果叶子对于公园没有用呢？</p><p>甲答：修剪叶子，让树长得更好，这是功；知道叶子有药用作用，而私自带回家，这是过。为了树子长得更好，修剪枝叶属于功；没有获得许可，而把叶子带回家，分两种：叶子对公园作用大，则果报大；也只纯粹对公园无用，果报小。如果为了树子长得好而修剪枝叶，有功；但修剪枝叶导致树子死掉了，这有过。个人认为，很多事情都同时具备善恶两面，只是看哪一面占比更大些，择其善而为之。</p><p>例如你布施给乞丐一万元，按理是大善事，但实际上，你也间接的促使了乞丐的偷懒、依赖心，这应该属于大善里的小恶</p><p>乙答：默许，就不算偷盗吧。也是哦，应该大家都是默许的。到最后，就要看发心了。</p><p>丙答：算不算盗，依摘取得物是否有主人和摘取的人是否有盗心决定的。主要还是在发心上。众生共业的产物，没有确定哪一个是主人。</p><p>丁答：还是要看动机，月亮上采矿，地球人以为是公共的，实际上是隐形外星人的呢，咋办。</p><p>总结：要看公园种树的目的是什么？是为了美化环境，不是为了获取树的枝叶和果实。如果公园管理人员不在意树叶子，那么采摘就无过，没有损害公共利益。</p><p>取用无主物，不属于盗。但是树属于公园管理部门所有，关键在于管理部门是否在意和需要树叶，如果是默许，就不属于盗。如果是管理部门无奈没能力管，就属于盗。是否属于盗，一要看物主是否同意或者默许；二要看取物人是否有盗心；三要看结果，是否损人利已了。只利己没有损人，不在此条之内。</p></div>"
},{
    "title": "九、盗的究竟义",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>九、盗的究竟义</p><p>一切天地万物，取之都是盗，执取都是业行，都有生死果报，只是业行的轻重善恶差别而已。不管善恶，只要是有为法，必感召生死苦。因为天地万物，没有一样东西属于你所有的，包括你的色身和识心，都是盗如来藏的。彻底断我见以后，就不犯盗戒了，不犯盗戒才能成佛。</p><p>如果一个人想要送给你某些东西，要观察他是真想送给你，还是假送，有其它想法其它目的。同理，我们如果想要别人的东西，要观察他是否真正愿意施予，是意根同意，还是意识愿意而意根不同意的无奈。如果意根不愿意施予，但行为上意识不得大方的给与，那么后果可能很不好，他会想办法讨回来。</p><p>如果一个人知道对方内心不愿意施予，也知道对方会顾虑面子等等差不多能施予，于是就张口求取，结果对方确实勉强给与了，心里却非常不高兴。这种情况，几乎属于明抢了。</p><p>明抢和偷是什么关系？都是不经过对方意根的同意而夺取，明抢是明着夺取，偷就是暗中夺取，强盗等同于小偷或者大偷吗。这样的话判断一个人是君子还是小人，基本上就能分清楚了，君子是不夺人之美，己所不欲勿施于人，坦荡荡磊落落，不暗做手脚使手段。而小人则常戚戚，阴森森，使手段耍计谋，心里都是鬼，鬼主意鬼道道，阴暗面多。</p><p>与人做交易，使劲砍价，甚至达到或者超过对方承受的底线，这也等于抢和偷。所以买东西的时候，不要要过于讲价，要让人过得去，要照顾对方的心理情绪和承受能力，这也是做人的修养和修为，所以佛讲五戒十善，就是教我们做人。观察当前末法时期，真的有很多人不会做人，既然连人都不会做，断我见成为圣人就不可能了。</p></div>"
},{
    "title": "十、盗盗者物同样是偷盗",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十、盗盗者物同样是偷盗</p><p>秋天田里收获庄稼的时候，就会有田鼠偷一些粮食，埋到自己的洞里，这是它们一个冬天的食物。临到冬天的时候，有人就会专门找田鼠的洞，挖出它们储存的各种粮食带回家，一个洞能有好几斤甚至十斤粮食。田鼠回到洞里，发现粮食没有了，有的就会绝望的自杀死掉，要不然冬天没有吃的也会饿死。挖走田鼠的粮食，属于偷盗行为吗？</p><p>所谓盗者就是不予取，不经过物主的同意偷偷拿走，擅自移动到自己身边和名下，归自己拥有。物主一定是有情众生，偷盗者是怀着盗心偷心，主动拿取，中间还要设施了一定的方便手段，最后物离开物主，到自己所在地，成功的拥有了所盗物。</p><p>田鼠的行为属于盗，一是有盗心，偷偷的拿走，不让人知，二是用嘴叼走，采取了方便手段，三是粮食离开田地，放到了自己的洞穴里，成为自己的所有物。既然是盗，盗来的粮食一定是归田鼠所有了，否则就不属于盗，盗就不成立。</p><p>如果人类再去挖田鼠洞里的粮食，就属于盗田鼠的东西。如果田鼠不是盗，是替人类保管，人类去挖，就不是盗田鼠的，而是盗其他人的。</p><p>同理，把小偷偷的东西，偷偷拿走，这种行为也是偷盗的行为。因为小偷通过一定的方便手段，成功的把东西偷到自己所在地，成为了东西的新主人，如果物主没有更换，偷盗不成立。别人再把小偷的东西偷偷拿走，采取了一定的方便手段，成功的把东西拿到自己的所在地，成为了新物主，这个行为属于偷盗。如果中间有其它发心，不是想占有小偷的东西，那就不一定是偷盗。</p></div>"
},{
    "title": "十一、说僧过即是恶",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十一、说僧过即是恶</p><p>佛教从有出家人那天开始建立，出家僧团灭，佛教就灭，这是有佛经依据的。凡是剃度受出家戒律的，都属于三宝，起表法作用，代表佛教。至于表得怎么样，那是僧人和僧团的内部事，外人无权干涉。</p><p>出家人有戒律有因果约束和规范，即使犯戒也不允许在家人说。所以佛不允许在家人看出家人的戒律，以免按照律条来比对出家人的言行，然后生出慢心，举罪和宣传出家人的过失，造成诽谤三宝之恶业，果报可畏。出家人有僧团来管理，僧团会对出家人的过失和罪责做处理，没有僧团的，或者是僧团不能管的，有护法神和因果来管理，但在家人没有资格管，绝对不能说僧任何过错。</p><p>出家人自恣日，自举所犯律则，互相举发所犯律则和过错，不允许在家人偷听。如果有人偷听，护法神会拿剑斩头。就是不让在家人知道出家人所犯戒行和过错，然后指责和宣传。如果在家人指责和宣传出家人过错，无论是否有其实，都是诽谤恶业，命终果报三恶道或者地狱。恶业大的，活着就有现世的花报，等不及后世的果报。</p><p>有些人光看出家人不是之处，出家人所舍弃的世俗利益怎么就看不见呢？即使出家人经常犯戒，常常造恶，难道还有在家人造恶多？在家人天天鱼肉，常常贪欲难以割舍，相互比较来说，谁的业大？要不然那么多人自视清高，为什么不出家拥有出家人的身份？出家很难吗？并不难，就是因为放不下世间里的种种贪欲种种享乐，世间里的利益很难割舍。所以就以在家人的身份为尊为大，处处指责出家人和僧团。既然僧团如此不堪，为何不发大心，舍弃世间贪欲，为佛教为众生为自己长远劫的道业而勇敢的出家，以出家身护佛教和众生岂不是更有利？</p><p>佛世时提婆达多和善星比丘，无论怎样造恶，都由佛和僧团制约管理，别人无权干涉。如果佛管不了，僧团管不了，有因果制裁，活着下地狱。佛世时六群比丘造恶无数，佛涅槃后仍然是比丘。佛涅槃时六群比丘喝酒吃肉，大声喧哗庆祝佛涅槃，佛无奈掩天人耳目，不让天人听闻，但佛并没有现神通制裁他们。</p><p>佛在世，以佛为大，佛涅槃，以戒律为大，谁的戒律势力大，就以谁为大为尊。以戒为大，表现是：一、出家人和在家人不混居，戒律不同的人不混居，即使都是出家人戒律有差别也不能混居；二、行走坐卧、做佛事、布萨时，都是先受戒在前，后受戒在后，出家菩萨戒先于在家菩萨戒，在家菩萨戒先于在家五戒八戒。</p></div>"
},{
    "title": "十二、阿难是否算犯戒？",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十二、阿难是否算犯戒？</p><p>问：楞严经中讲阿难证得了初果，却被摩登伽女诱惑，差一点犯戒，如果不是被楞严咒所救，会不会因为破戒而下三恶道？</p><p>答：阿难是被摩登伽的母亲用外道邪咒诱骗尽淫女屋中的，不是他主动走进淫女屋里的。阿难初果的禅定力显然不足以抵挡得了外道强有力的邪咒，邪咒对阿难就有阻碍作用，会失去抵挡力，但阿难绝对不会主动犯任何一个戒律，不会下三恶道。就像一个人因为禅定力不足，就抵挡不了酒精的迷惑力，酒精入心，就会昏沉不清醒。这个酒精也许不是自己自愿所饮，而是被他人强行灌入，或者用计策灌入。</p><p>阿难的情况属于被外道强行施了咒法，由于功力不足，抵挡不了，不是阿难愿意接受邪咒。邪咒一旦入心，阿难也没办法再清醒。一个人受了迷幻药的迷幻作用，就会不自觉了，这不是个人的意愿，不是主动愿意迷失自己。所以不属于心有烦恼的主动破戒行为，就不会下三恶道。如果阿难在被迷惑的时候，不生起贪欲心，那么无论怎样，阿难都不属于犯戒，也不属于是被动破戒。完全不动心没有贪欲，这要修到三果以上，断尽贪欲才行，一般人需要意识的控制，而意识容易被外力所控制，所以只修意识，广学多闻，道力就不可能健全起来，结果就是阿难这样。</p><p>如果有极强的外力作用，一个修行人在道力不足的情况下，那就难免不受影响，因为五阴当中的色阴没有尽，就要受色阴的影响，五阴中的受阴没有尽，就要受受阴的影响，想阴没有尽，就要受想阴的影响，这是没有办法的事。</p><p>什么时候才能不受五阴的影响，而得色阴尽受阴尽想阴尽？最低要在修出四禅定的时候才行，在四禅定里才能断尽色阴和受阴、想阴，否则任何人都会受五阴的影响。有身即有此大患，无身则无患。所以才要修道，才要修禅定，才需要修到意根这里，以求断除五受阴，心得解脱。</p><p>小乘人判断一个人是否犯戒破戒，只看外表行为来判断，只要行为符合五戒比丘戒比丘尼戒，就说是不破戒。而大乘判断一个菩萨是否犯破戒，主要是看菩萨的心是否犯戒，是否在行为当中有所动心，如果没有动心，就是清净的。但是一般人只能看外表的行为，看不出一个人真正的心行，误判的情况就会非常多了。如果一个人表面在做善事，表面在利益他人，而其心行全部是为了个人利益，其行为是一种遮掩和假相，心的目的与行为不一致，那么这个人就不是在做善事，不是在利人，而是在利己。这样以行为作为假相的欺骗，不仅无福，而且有罪。</p></div>"
},{
    "title": "十三、任何人学习佛法都不属于盗法",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十三、任何人学习佛法都不属于盗法</p><p>所谓的盗就是不与取，佛法里除了戒律，不受戒不可以读和学之外，所有佛说的法都是为众生而说，都是说给众生的，都是公开于众生的，众生学习佛法就不存在不与取这个事。佛陀就是为众生讲法，让众生学法，无条件的，不收取任何费用，佛陀的心无私无我，一心为众生解脱生死苦恼，所以根本不存在不与取。</p><p>甚至外道人都可以随意读和学习佛法，尽管外道有可能是为了挑漏洞，为了诽谤，但读佛经挑毛病都不属于盗佛法。关键是佛陀心量大，一切为众生，不为个人私利。如果佛陀不允许众生随便学法，要有前提条件才能学习，不具备条件而学习就是盗法。但佛教里没有这个规矩，都是让众生正大光明的学习修行。</p><p>而戒律，如果没有受相应的戒律，就不允许学习，因为一是怕众生知道里面内容就不敢受戒了，二是没有受戒而去学习，就会拿戒律去比对受戒的人，这样就有罪过。受戒的人高于没受戒的人，佛教不允许以低而指责高，即使有事实依据也不可以，都有过错。尤其是出家人的戒律，在家人绝对不能去看，更不能拿着戒律去说出家人如何如何，即使出家人犯戒了，也不允许在家人去指责，否则就有过错，或者有罪，有因果和罪业。有根据的指责出家人也属于谤僧，属于有根诽谤；如果没有事实根据而指责宣传出家人过失，属于无根诽谤，罪过更大，因果更重。</p><p>盗法有一个特例，就是以盗心把佛法原封不动搬到外道当中，变成外道他们的法，佛法的所属人改变了，就属于盗法。把别人的东西拿回自己家，说是自己的，东西的主人改变，才属于盗。佛法没有更名为外道法，就不属于盗。如果是外道派来特意盗法的，把佛法变成外道法，为外道服务，就有盗法罪。</p></div>"
},{
    "title": "十四、两舌业因什么而起",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十四、两舌业因什么而起</p><p>两舌俗语就是挑拨离间，对甲方说一套，对乙方说一套，目的是让二方互相误会，自己从中渔翁得利。两舌也含有不实语，不管有心和无心，都是罪业。在三宝中只要离间了四众关系、师徒关系，就是无间地狱业。其中还涉及到出家师父所摄受的弟子，不再信受师父，不再跟随学法，而转学其它不能解脱的错误法低劣法世俗法，那么同时就对师父的弟子有极大的误其法身慧命的罪业，后世两人之间会有极大的纠结关系，自己还要背负这部分罪业果报。</p><p>造作两舌恶业，也有因由嫉妒而起。嫉妒心大多数人都有，或者说所有人都有，关键是能否降伏下来，不让自己的嫉妒心现行出来，以造作大恶业。心中有我有他有人，想要自己突出出来，得到某种利益，希望他人羡慕尊重仰慕跟从自己，而不得志，才会产生嫉妒心。嫉妒心是无能的表现，如果自己能，一切好处都会自己得，何必要去嫉妒他人？</p><p>每个人都希望自己第一第二，希望自己站在最高峰，在众人顶上，如果你真能，德行品德才能应该是最高最好的，想当第二屈尊人下都不可能，躲在人群中都躲不住，一定会显露出来。想要占据第一位，要掂量自己的德在第几位，德要配位，你才能有那个位，否则必有灾祸。超出自己的德能范围和程度了，很难承受得了，比如说你本来身体承受只能有五十斤以下，非要背上一千斤的份量，后背脊梁骨都会压折压断的。</p><p>每个人想要得到某种利益的时候，首先要掂量自己的德，再掂量自己的能，再兼顾自己的人格品性，最后再衡量自己能否担当得了那个位和势，别给自己增加过多的烦恼和苦恼，德不配位不如不要那个位。</p><p>超出自己能力太大的心，叫作野心，野心太大就会疯狂，疯狂太大就会消亡，命会绝矣。而修道人对世间一切都要看淡，都尽量要无心无欲无求，这样品德才会越来越高，品德高到一定程度，就会具有菩萨的格，进入菩萨位，成为菩萨摩诃萨。菩萨位是无心得，没有靠斗争嫉妒排挤他人能得到圣位贤位的。</p><p>人在任何一个团体里，第一第二不是争来的，不是斗来的，不是自我夸耀来的，不是打广告招来的，不是拉选票选来的，是德行感召来的。德行感召来的，推都推不掉，藏都藏不住。靠手段争取来的，一旦福德尽，势力尽，就会退堕下去，期间如果有罪业，还会退堕到深谷，得不偿失。烦恼是因为我见我执而来，我执太重，就会为我而造作恶业了，把我看得太重一点好处也没有。我越重，下堕就会越深；反之，心越无我越轻松，就越会飞升。是上是下，完全在于对自我的把握。在日常遇缘对境当中，不断的反思自我的虚妄不实，反观自己的心行，反思观察得越好，对自我的把握就会越好。</p></div>"
},{
    "title": "十五、什么是破僧罪",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十五、什么是破僧罪</p><p>破僧包括破坏僧团和非僧团里的僧。四个出家人以上组成的团体名为僧团，这四个出家人都必须是已经受了具足戒的，有出家戒体的僧人。如果在僧团里搞斗争，最后剩下了三个僧人也就不成其为僧团了，这样僧团就散了。把僧团斗散的人，就造作了无间地狱罪，命终就有无间地狱果报。</p><p>三人以下的出家众，虽然不能称为僧团，也叫作僧众，如果也要在其中搞是非，挑拨离间，叫作斗乱僧众，罪过也是地狱罪。一个出家人带领众弟子，虽然不能组成僧团，但如果对佛教起的作用也相当大，挑拨离间师父与弟子之间的关系，分崩离析师徒，这个罪业也是相当大的。如果这个出家人身份相当特殊，对佛教的未来和发展有举足轻重的影响力，对众生也有很大的摄受力，有人对其诽谤，分崩离析其弟子，这样的罪业就相当相当的大，大于破坏其它僧团的罪业，当然更是无间地狱业。</p></div>"
},{
    "title": "十六、为什么诽谤三宝罪最大",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十六、为什么诽谤三宝罪最大</p><p>佛经都是佛的真实语，佛不欺诳众生。很多人都觉得自己任意一句话，不会有什么，没什么大不了的，可是这一句话的份量可能是相当大的，自己往往不知不觉。一念善就是升天享乐之因，一念恶就是无间地狱之因，在佛法僧三宝中所言所行，尤其重大，非同在世俗法里的言行。如果一句话破坏诽谤了三宝，不管如实和不如实，都是地狱因。一句不和合语，叫作两舌，挑拨了僧团的和谐，挑拨了僧人之间居士之间僧人与居士之间的和谐关系，都是地狱因。造业最多的就是口，要想免遭恶果，应该善护口业，谨防祸从口出。没事时不说话，有事时少说话说好话，忌无事找事无事生非。这样自身清净，不留过患，这是聪明智慧人所为；反之就是愚痴烦恼深重之人。</p><p>诽谤分为无根诽谤和有根诽谤，根就是证据事实的意思。没有其事而说有，有其事而说无，颠倒事实，就是无根诽谤；事情确实，所说是事实，叫作有根诽谤，对于三宝来说，这两种情况都属于诽谤，罪过很大。说僧过恶，是大罪，即使有其事，有心无心说向他人都是罪，恶心宣传其罪更大。</p><p>为什么在三宝中造业罪最重？因为三宝对世间众生恩最大，功德最大，能带给众生解脱，让众生离苦得乐，是众生最大福田。在自己的福田里造作恶业，当然是其罪最大，影响也最大。如果因为自己的诽谤，让众生对三宝失去信心，就等于断绝众生解脱之道，这个罪肯定是比什么罪都重。</p><p>在世间里，对于对自己有恩之人施恶，也是为人所不耻，被世人所唾弃，何况在佛法当中对能带给自己无量劫解脱功德的三宝施恶，其罪怎么能小？</p><p>凡是造作恶业的人，都是因为烦恼，都是因为心中有我无他的缘故。贪嗔痴慢疑，因为心中有贪，贪不得，得不到而造作恶业；心中有嗔，不顺己意而嗔；心常愚痴，不知善恶是非好歹，无知而造作恶业；心中那个我炽盛，掩盖不住而发，凌灭他人而造作恶业；心中有疑不能确定善恶因果而造作恶业。</p><p>所有恶业，无不是因我而造，所有烦恼无不是因我而来，我就是个罪魁祸首。不断我见，轮转三途，三恶道不免，苦恼无穷无尽。所以每个学佛人应该下大决心，一定要降伏那个罪魁祸首，最后消灭那个罪魁祸首，自己才能离苦得乐，自心才能太平安宁，天下才能太平。所以断我见能福及天下，福佑众生，最大受益者还是自己，虽然没有我了，没有我才真正好。</p></div>"
},{
    "title": "十七、善意的盗有善报",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十七、善意的盗有善报</p><p>盗，几乎所有人都会犯，不予取就是盗，一般人都不懂。我就犯，而且还明知故犯。以前我就喜欢多余东西送人，有布施的习惯，也希望自己家人也能布施修福，舍弃悭吝习气。别人我管不了，只能管管我母亲，可是她有点吝啬 不听我的，东西太多还没有用就是不送人，我没办法就偷偷的拿走她不常用的东西去送人，然后她每次找不到东西，就说是我偷走送人了。其实偷偷拿自己家人东西也有果报，将来的果报是什么呢？东西送人得千倍福，这个谁得？</p><p>如果是我得福，就不止千倍万倍得了。但是东西不是我的，我怎么得福？布施这种行为是我造作的，当然是我得福，身份不同，得福多少不同，出发心不同，得福多少也不同。但是东西是我母亲的，她也应该得福，但没有布施心得福有限，且因为我得福，没有我她就不能得福。我将来得福时需要还回去一部分，我只得发心这部分福。</p><p>和自己的亲人之间互相欠债，由此缘分，来世还会在一起，即使还债也挺好，毕竟有机会度他们。亲人之间本来就是一笔糊涂账，没人能算得清，由此债务关系，生生世世纠结在一起，善缘就快乐，恶缘就痛苦。与一切人等多结善缘，未来世就会快乐，没有痛苦。</p></div>"
},{
    "title": "十八、人类派鸡鸭去灭蝗虫算杀生吗？",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十八、人类派鸡鸭去灭蝗虫算杀生吗？</p><p>唆使他人造作杀业，比自身造作杀业罪业还要重。为什么这样说？因为自己杀生，是你自己一个人造作恶业，与众生结恶缘。而教唆他人去代替自己杀生，他人造作是杀业，同样有自己的一份，自己的杀心仍在，又让他人结恶缘，造作恶业，污染他人，这是双重恶业。</p><p>让鸡鸭代替人类杀蝗虫，蝗虫是因为人类而死的，属于人类杀的，鸡鸭只不过是人类杀蝗虫的工具罢了。同时鸡鸭又与蝗虫结恶缘，来世还要受恶报，这是人类造成的。所以派鸡鸭灭蝗虫，比自己灭蝗虫，恶业要大。</p><p>但是遇到这样大蝗虫灾难应不应该去灭蝗虫呢？如果蝗虫威胁到人类的生存，当然需要灭，因为比较人类的生命比蝗虫不知贵重多少倍，二者相比较还是应该首先保障人类的生存。人是道器，能做极多的善业，对三恶道众生都有益处，只要人活着，其它事情都好办。只不过后世有一些恶报而已，比现在被蝗虫夺命，或者被灾难困住要好得多。</p><p>每个众生无始劫以来造作的杀业太多太多，大大小小数不清，所以每个众生业障都深重，恶缘都很多，哪管你再好，也有要杀你的，也有打骂你的，也有侮辱陷害你的，也有毁谤你的，也有看不上你的，说你不好的敌对者很多。</p><p>遇到逆缘和灾难，不得不去造作杀业，这本身就是无福的表现，就是业障，是恶业的果报。如果没有业障，就不会遇到必须造作杀业才能解决自己的生存问题。诸佛菩萨恶业消灭，就不会感召到这样的逆缘，不会迫不得已去造作杀业。即使遇到恶缘，也会化险为夷，遇难成祥，也会用自己的无量功德去弥补和救度敌对者。</p></div>"
},{
    "title": "十九、梦中与醒时造业的区别",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>十九、梦中与醒时造业的区别</p><p>梦里与梦外的区别是，梦里没有外相分，什么也没有改变，而梦外有外相分的改变，有利益他人和损害他人的实事发生。所以梦里造业，没有实质和具体的果报，梦外造业就有实质和具体的果报。除此，梦里梦外都一样，都是虚幻不实的。</p><p>梦中虽然布施了一千元钱，可是并没有实质的钱被布施出去，也没有实质的人得到这笔钱，所以实际上并没有真实的布施行为，只是有一种布施的心行存在，有一种慷慨为人的心行存在，有一种不吝啬的心行存在，就是意根的心行。梦中意根的心行善，说明这个人心性是真善，善心生福，会有福报和善报，心有多善，福就有多大，果报就有多大。梦中布施，说明意根心性善，性善就有善报，死后就会去善道，到与意根心性相应之处出生和生活。善有善福，这就是心性的善报。意根心性恶，会损福报，到与意根心性相应的恶处受报，这就是善恶果报。</p><p>如果是梦外布施了一千元钱，就有实质的钱被布施出去，有实质的人得到这笔钱，加上有布施的行为，三者具足，果报就会具足受。将来至少会有百千万倍的钱财回馈，也会生出相应的福德，有善报和福报。如果意根由于心性的善恶，指挥六识造作了善恶业行，除了心性的果报之外，还有业行的业报，业报是非常具体的果报，锱铢必较，一定要酬尝业果的。</p><p>梦中杀人与醒时杀人的区别也是同理，梦中没有实质的人被杀，没有实质的杀人行为，但有杀人的心行，其果报以心行为主，因其心性恶不善，就会损其福德，投生到与心性相应的恶处，受恶不善的果报。梦外杀人，有实质之事，就有酬尝杀人的业果，将来会有恶心不善心性的果报。比如说受戒之后犯戒了，有的犯戒的行为，不仅有心性上的罪，还有业行上的戒罪，二者合一起受报。而没有受戒的人，造作了恶业不善业，虽然没有戒罪，但有心性恶之罪，仍然有恶果报。做恶事，受戒与不受戒都有恶报，受戒对自心有一定的约束力，对于修行更有利。</p><p>意根代表一个众生的根本心性，意识可以粉饰和伪装，意根不行，装不了，不能弄虚作假，绝对真实的表现自己的心性。在梦中意根是绝对的作主，意识的作用非常弱极其弱，几乎起不了调控意根的作用，所以梦里不能造假不能伪装，体现的都是意根的心性，最真实。</p></div>"
},{
    "title": "二十、佛说优婆塞五戒相经（关于大妄语戒）",
    "author": "生如法师",
    "date": "2021年12月24日",
    "html": "<div class=\"B1_text\"><p>二十、佛说优婆塞五戒相经（关于大妄语戒）</p><p>原文：佛告诸比丘。吾以种种呵妄语。赞叹不妄语者。乃至戏笑尚不应妄语。何况故妄语。是中犯者。若优婆塞。不知不见。过人圣法。自言我是罗汉。向罗汉者。犯不可悔。若言我是阿那含。斯陀含。若须陀洹。乃至向须陀洹。若得初禅。第二禅第三禅第四禅。若得慈悲喜舍。无量心。若得无色定。虚空定识处定。无所有处定。非想非非想处定。若得不净观。阿那般那念。诸天来到我所。诸龙夜叉。薜荔毗舍阇。鸠槃荼罗刹。来到我所。彼问我我答彼。我问彼彼答我。皆犯不可悔。</p><p>释：佛对诸比丘们说：我用种种方法呵责妄语者，赞叹不妄语的人。修行者就连说笑都不应该妄语，何况故意妄语，更不能犯。如果真有犯妄语戒者，如果是受过五戒的优婆塞（优婆夷）并不知道也没有证得超过凡夫人的圣人法，却对人说我是阿罗汉，我是向阿罗汉，我是阿那含，我是斯陀含，我是须陀洹，我是向须陀洹，我证得了初禅，我证得了二禅，我证得了三禅，我证得了四禅，我获得了慈悲喜舍四无量心；</p><p>我证得了无色界的空无边处定、识无边处定、无所有处定、非想非非想处定，我获得了不净观，我修成了阿那般那念，诸天人来到我身边，诸龙、夜叉、乾达婆、毗舍阇、鸠盘荼、罗刹来到了我身边，和我对话，他们问我答，我问他们答，这样的说法就犯了妄语戒，犯了以后就不能忏悔了，即使忏悔也不能消除妄语罪业，仍然有罪，命终堕于三恶道受妄语报。</p><p>以上是佛陀对妄语戒的开示，主要是针对大妄语，是对非常重大的事件的不实谎言，小妄语没有说。重大事件就是出世间法的实证，这个问题绝对不能妄语说谎骗人，冒充圣贤这个罪业非常大，冒充国王都要被斩头示众，株连九族，何况冒充远远超胜于世间凡夫国王的圣贤人，其罪更大，不可忏悔，必堕恶道。所以每个人对于重大的出世间法一定要谨言甚行，小心翼翼，没有百分之百把握，没有确凿证据，切不可随意散布自己得了某种出世间法。也不管是何等人印证的，如果不实，就一定会承受严重恶报。希望一切学佛者慎之慎之，勿犯大妄语罪，一失人身，再难得遇。</p><p>为什么不少人都喜欢向外宣示自己得了什么什么法，有了什么什么果，这是什么心理呢？深究起来，无非是想要证明自己优秀、优越，超越于其他人，我胜于其他人，其他人都不如我；或者是想要得到他人的尊崇、敬仰和钦佩，想要其他人臣服于我，想要出人头地等等，以此自傲自恋自慢。这都是基于心中有我也有人，我相具足，人相具足，并没有断除我见，并没有得什么法，因此还是我见具足的凡夫。想要得圣人法的人，一定要深究自己的内心，把自己内心中的我都挖掘出来，破除掉消灭掉，不要让那个我再出来惑乱自己，给自己增添烦恼惑业苦。</p></div>"
}]