[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>内 容 简 介<span> </span></strong></p><p>如来藏乃是世出世间一切法的发源地，贯穿一切法的始终，是世人所不识的摩尼宝珠，具足一切法的种子，随缘应物无不周。本书从不同的侧面阐述了如来藏的各种功能作用，尽显如来藏主人公的真面目，让学人透彻的了解世出世间一切法全部都是如来藏的真实法界，全体皆真如，无二无他。从五蕴十八界的所有现象界上，仔细剖析了一切法如何都是如来藏的真实功用，其中最深细的部分是如来藏与科学，从科学的角度更细微的剖析出如来藏在其中的生成与执持作用，这样使得大众对如来藏是万法源的真理信受不疑，从而有力的否决了外道断灭论。</p><p>书的后部分介绍了实证如来藏的方法和意识与如来藏的体性区别，分清真心与妄心的区别，并且按照这些方法去实修，能保证学人证悟如来藏而不是错悟生灭的意识。证悟以后定力有所提升，就能逐渐观察如来藏在五蕴十八界上的种种运作，智慧不断的增进，与无我相应，心越来越空，解脱的功德受用越来越大，这就是证悟如来藏的利益。证悟如来藏非常重要，希望广大学人都能依止此书，精进修行，早日证得如来藏，发起甚深的解脱智慧，以快速圆成佛道！</p></div>"
},{
    "title": "如来藏功德颂",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>如来藏功德颂</strong></p><p><strong><span>我有侍者，日夜相守；百般随顺，孝养备至。</span></strong></p><p><strong>我若向东，祂不向西；我若坐卧，祂不站立。</strong></p><p><strong>我若吃饭，祂不饮茶；我若视物，祂不闻声。</strong></p><p><strong><span>我若为人，祂不做鬼；我若上天，祂不入地。</span></strong></p><p><strong>我若行善，帮我积德；我若作恶，助我一力。</strong></p><p><strong>我若修行，随我出世；我若随流，与我入俗。</strong></p><p><strong><span>我若思惟，赠我识种；我若息心，赐我寿暖。</span><br/></strong></p><p><strong>我若行乐，祂则随喜；我若寻死，祂也顺我。</strong></p><p><strong>一切秘密，祂全掌握；善业宣扬，恶也不藏。</strong></p><p><strong><span>人说祂痴，祂实无私；公平公正，平等一如。</span><br/></strong></p><p><strong>成佛由祂，流转依祂；成事是祂，成人也祂。</strong></p><p><strong>诸佛国土，由祂成就；阎罗地狱，由祂变造。</strong></p><p><strong><span>无量功德，聚于一身；是褒是贬，祂全不顾。</span><br/></strong></p><p><strong>自性清净，不缘尘俗；在圣不增，在凡不减。</strong></p><p><strong>净染皆存，自体不污；不慕诸佛，不弃凡愚。</strong></p><p><strong><span>历劫无名，心性无我；寿量无尽，不生不灭。</span><br/></strong></p><p><strong>具足万法，一无所得；无价珍宝，不享分毫。</strong></p><p><strong>本为豪贵，屈尊示贫；入我身中，穿弊垢衣。</strong></p><p><strong>摩尼宝珠，光照大千；若不随祂，永处暗宅。</strong></p><p><strong><span>与祂相较，惭愧疚耻；今我发誓，向祂学祂。</span><br/></strong></p><p><strong>擦洗弊腻，去除无明；显祂尊贵，示我德能。</strong></p><p><strong>福慧二足，常乐我净；圆满一切，慧日朗照。</strong></p></div>"
},{
    "title": "第二十九章　如来藏与内外尘的关系",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十九章　如来藏与内外尘的关系</strong></p><p>一、问：如来藏是否只缘实法，比如十色五根五尘，也就是地水火风？那么我们看到的山的高低、树的大小，是实法还是假法，如来藏是否能缘？如果不缘，那么是谁造成了器世间的差别，物体的大小形状形色的差别？</p><p>答：实法就是外五尘，色声香味触尘，但是也包括外法尘，就是五尘上同时具有的法尘，比如说色尘上的形色表色和无表色等等，离开法尘也没有五尘。那么外面山的高低、树木的大小也是实法，如来藏也能缘。因为如来藏出生一种色法时，不仅仅要出生色尘的显色色彩，而且必须要同时出生色尘的形色表色无表色等法尘，否则色尘就只有色彩一种相貌，不是完整的色尘了。声尘、香尘、味尘、触尘也如是，都有外法尘同时存在和显现。</p><p>如果没有外法尘，色尘只有显色色彩的话，所有的色尘就会只有色彩，没有形色表色无表色，那就没有形状、高低、大小、长短方圆和厚薄，没有品种种类的差别相，没有美丑、巍峨、挺拔、气势、年轮、软硬等等表色无表色，宇宙器世间的色尘也就只有色彩的差别，除此之外，就模糊一片，混沌不分了。</p><p>这样不但业种无法实现，如来藏变现万物也就极简单了，大千世界只有色彩斑斓，毫无形质，也就没有什么实用价值了。众生看到的也就是色彩一片，没有长短方圆大小美丑之分，那么一切色尘物质都不可用，众生也无法在这样的器世间生存。</p><p>而实际上，如来藏在出生色法时，是要用四大种子完整的变现出各种不同的色法物质，包括色彩、形状、姿态、品质、软硬度等等内涵；然后众生见色时，如来藏依外六根，传导完整的色尘到胜义根，包括法尘。意根主导见色，眼识和意识才能共同了别出完整的色尘，这就是所说的如来藏如镜现像的原理，所现的像与外色尘相似相同。而不可能没有外法尘，就能出现内法尘。</p><p>众生的五阴色身也属于色法，属于实法，包括一切形象，在母胎里时就存在了，都是如来藏亲自所缘。如果没有外法尘，人就只有色彩，没有四肢、头颅、五根、性别、年龄、相貌、气质、高矮、胖廋、学识、修养等等形色表色无表色。如来藏在出生色身的时候，如果只出生色彩显色的话，所有的人都不叫作人，不知道是何物了。所有的色尘，也就都不知道是什么东西了，世界将是混沌一片，只有色彩，这样的事不存在。</p><p>因此说，形色表色无表色等法尘也是实法，如来藏既出生，又能缘，能依之变现内法尘，众生了别的就是完整的色尘，所有的信息都具足存在，不是无中生有后变出来的内法尘。其它几尘，也是如此，都有外法尘，依外法尘而有内法尘，不是依内五尘出生内法尘。</p><p>如来藏把实法传导到胜义根，变成假法，意根缘之，如果感兴趣，想要细致了别，可是自己了别不了，如来藏就在根尘相触处，出生六识了别。眼根与内色尘相触时，如来藏在其中出生眼识；耳根与声尘相触，如来藏出生耳识；鼻根与香尘相触，如来藏出生鼻识；舌根与味尘相触，如来藏出生舌识；身根与触尘相触，如来藏出生身识；意根与法尘相触，如来藏出生意识，这样六识就能现行了别内六尘。</p><p>二、问：物质的形色如高低大小姿态等等，是在外界就已经存在，还是在胜义根里才出现的？</p><p>答：如来藏如实变现一切法，外界没有的，如来藏如何依之而变现内法？在外界的色声香味触法六尘上，有差不多固定多的四大种子，不断的向外放射四大微粒，每个色法的四大微粒是不同的，这些微粒不可能是无序的堆积在一起，其排列肯定都是有序有规则的，那就有形状；既然有形状，就有形色这种法尘，同理就要有表色这种法尘，有的还要有无表色这种法尘。所以法尘在胜义根之外，是早就存在着的，是如来藏用四大出生的色法尘，是实法，是外界本来就已存在，如来藏再依之变现内色尘，六识缘之才能了别出来。</p><p>如来藏变现万法就如镜现像一般，变现出与外境一模一样的影像，或者相似的影像。一模一样和相似是什么意思？比如我们看见一个人，这个人就是自己心里的影像，不是外面的真正的人，不是本体的样子，但是与本人应该是一致的、一模一样或者相似的。我们所见到的胜义根里的影子，是自己的如来藏依据外面的真人如实变现出来的，外面的真人只有如来藏能见到接触到，那么外面的真人有没有大小高低长短方圆和高矮胖瘦呢？肯定有，而且是在母胎里他的如来藏出生的，包括四肢头脚、轻重、高矮大小等等法尘。他人见此人，他人的如来藏就会依此人的原貌，在自己的胜义根里变现同样或者是类似的内六尘影像，他人就同时见此人的色彩，见此人的高矮胖瘦、大小、五根的形状、性格脾气秉性等等法尘相。</p><p>因此说，如来藏变现自己的五阴身的时候，也同时变现自己的高矮胖瘦形状重量，别人看时，如来藏就能依之变现出他人心里一模一样的影像，他人才能如实了别到此人的大小高矮胖廋和重量。自己心里显现出来的他人的肢体形状、高矮胖瘦、气质、神态等等法尘，不可能是自己的如来藏在胜义根里创造出来的，只能模拟胜义根外的真人的形象如镜显像一般的映照出来的。</p><p>潜水艇的潜望镜、坦克车上的类似潜望镜的折射镜，镜中所显都是和真实场景及人物一模一样，分毫不差。这与如来藏的镜像原理相同，佛说的镜像观就是这样。如果眼根有问题，如来藏采集的信息通过眼根时发生形变，到达胜义根处的信息也会发生形变，那么如来藏给出的镜像也将出现形变。眼识和意识看到的就是扭曲的，可能是色彩或是形状的失真。除去业力相同和五根健康的约束条件，如来藏变现出的镜像与实物肯定是几乎一摸一样的。</p><p>我们可以拿自己色身来推论，如来藏是否给自己变造出了四肢和头，我们看见的他人的头和四肢是否应该与他人本人差不多，他人看我们自己的四肢和头，是否与自己真实的四肢和头差不多。如果说如来藏没有给我们变造出四肢和头的形状这些形色外法尘出来，那每个众生凭什么知道自己有头和四肢、能看见内法尘的头脚、四肢、五根和高矮胖瘦？凭什么能有身根的各种用？这些内法尘，不可能是无中生有的，不可能是没有依照物就能出现的，一定是如来藏在母胎里就出生了众生的头和四肢等等形色、表色和无表色。其他的物质色法也如是，在最初形成时，一定有形色、表色和无表色外法尘。</p><p>三、外五尘上的法尘是否存在</p><p>五尘上的法尘，也叫作法处所摄色，是意根和意识了别的内容。在色尘上，分为显色，是眼识了别的，这是内色尘；形色、表色和无表色是意识了别的部分，这是内法尘。形色是指长短方圆大小薄厚，如果内法尘有此形色，这是如何出现的？从哪里来的？没有外形色，是否能有内形色？表色和无表色也如是。</p><p>比如一个桌子的形状是形色，意识见到的是内形色，如果没有外形色，也就不能有内形色。比如人工制作桌子的时候，肯定也要制造桌子的形色，本质境的桌子一定要有长短方圆的形状；如果本质境的桌子没有形状，那么工人们制造的是什么样的桌子？不同厂家所制造出来的桌子就没有区别了；不仅如此，还与其他物质色法也没有什么区别了。因为所有这些东西只有显色这种色彩，没有硬度和软度，也没有质量之说，其他信息都没有。那么如来藏如何依照本质境的桌子，如镜现像一般的幻化出胜义根里的一模一样的桌子？</p><p>一切物质色法在形成的时候都有形质，以互相有所区别，显现自己的本有的特色，否则物质与物质之间就没有差别了。比如众生在母胎里，如来藏一定要出生色身的四肢现状，身体的大小和胖瘦，有肉质的表色，还有结实健康与否、可爱与否的无表色。出母胎以后，每个众生还是要有四肢、头脚、高矮胖瘦等等形色，以及表色和无表色。四肢等形色对于他人来说是外形色，他人看见的则是内形色；如果众生本身没有四肢的形状，他人就不能看见众生的四肢等等形色，也不能知道众生是否健康活波好动、脾气性格秉性等等表色和无表色。</p><p>如来藏如镜现像，如实显像，内色尘与外色尘一模一样，内声尘与外声尘一模一样，如果不一样，就不是如镜现像了（业力的原因除外）。好比一个人站在镜子面前，镜子现出与本人真人一模一样的影子，镜子不会做任何加工，因为镜子无心。因此说，一切物质色法都有外法尘，包括声音、味尘、香尘、触尘，都有形色和表色外法尘。又比如外色在视网膜上会形成倒影，树在河水里也能形成倒影，色尘有正有倒有邪，有上有下，有左有右，有里有外，说明色尘是有形色的，有形色，就有外法尘，经过意根传导到胜义根里，让意识了别。</p><p>四、外相分一定包括外法尘</p><p>外相分如果只有五尘，没有法尘，那么进入眼睛里的影子，就不会有倒影了，正倒就是法尘，是形色。如果外相分没有法尘，进入眼睛里就是一片色彩，没有形状和姿态，没有质量质地之别。每个人可以观察一下，他人眼睛里的像都是什么样子的，那就知道了。比如照镜子，镜子外面的相，就是外相分，镜子把外相分的影子摄受过来，在镜子的表面形成的相，叫作内相分。没有外面的相，就没有镜子上的相，事实就是这样。</p><p>而镜子上的相一般来说都是与外相差不多的，外面有什么，镜子上就有什么，外面的的相是什么，镜子上的相就是什么。那内相上有法尘，外相怎么能没有法尘呢？如来藏如实现像，如实，就是与外面一样，外法尘的形色表色无表色，都会通过镜子显现出来，与外面的相是一样的。无论从定中现量观行，还是逻辑推理，结论就是这样的。</p><p>五、根尘触，如来藏生识，是根先触尘，还是尘先触根？</p><p>六根触六尘，根尘是同时触到一起的。当如来藏把六尘变到胜义根里时，根尘就互相触了。而意根触法尘时，意根有主动性，因为意根先作意以后，才能触。意根触尘以后，如果不感兴趣，或者不想细微了别，如来藏就不产生六识。意根作意，并且决定了别，如来藏才能产生六识。</p><p>六识灭掉时，比如在睡着无梦时，意根接触到的法尘如果特殊，与平常有所不同，意根作意决定要仔细了别，如来藏就生六识来了别；如果六尘不重大不特殊，意根了解个大略，知道没有什么大事，就让身体继续休息，意识就不知道有什么事发生。</p><p>如来藏是外识，能够接触外六尘，然后把外六尘变为内六尘，通过五根把物质四大微粒传导到后脑胜义根那里，变现出五尘和五尘上的法尘。如来藏通过五根摄像，将外六尘变为内六尘，意根感兴趣就作意，如来藏随顺意根产生六识来识别，六识了别的是如来藏变现的内尘。</p><p>众生只要有生命体存在，如来藏就要不断的变现六尘，供养众生，包括在中阴身里也从来不休息，除了在无余涅槃当中不工作，其余的时候，一直都在工作。在世间里都是如来藏自己在玩转一切法。祂任劳任怨，做了无数又无数的工作，从来不厌倦，又不喊累，也不抱怨，菩萨们远远不如祂，因此需要永远向祂学习，直至成佛。</p><p>六、问：眼的胜义根是四大组成，也是实法，如来藏能亲自缘；内色尘如镜像，是假法，如来藏是否也能缘？如果如来藏不能缘内色尘，祂是如何在根尘相触处出生眼识，把眼识种子输送在根尘相触处？</p><p>答：法法皆真如，没有一个法不是真如所变，不是真如所缘，不是真如所执持，其实质全部是真如。因此说，内色尘，内六尘，也都是如来藏所出生和变现的，实质也是如来藏，如来藏也缘，而且是亲自所缘，独自缘。而外六尘，是所有有缘众生的如来藏共同出生，共同而缘，那么单独的如来藏缘外六尘与缘内六尘，其方式就有区别。</p><p>外六尘，是所有如来藏输出四大种子以后，形成四大，所有如来藏共同用此四大共同变现和执持，其生住异灭变化得相当缓慢。比如娑婆世界的生住异灭需要一大劫，其他佛国土要更长的时劫；众生所用的各类色法的生住异灭的时间可能要几天几年几十年几百年不等。</p><p>众生如来藏单独执持的色法，其生住异灭相对来说周期就短，其中色身的生住异灭时间是从几分钟到几年几十年几百年几千年不等。而胜义根里的内六尘，由于六根所接触的境界不断的转换，如来藏随之所传输到胜义根里的内六尘就要不断的转换，其生灭的时间相对来说就更短了。这表明如来藏要不断的切换六尘境界，不断的让内六尘生住异灭。由此可知，如来藏单独变现的法，由于所受到的制约和限制比较少，出生和变异就比较灵活，生灭和改变得就快速。</p><p>七、问：六祖说的不是风动不是幡动，而是心动的公案，这个心动的心，指的是哪个识？</p><p>答：如果七识不动，风幡境界就不能出现在心中，意根如果不攀缘风幡，就不会有眼识和意识了别风幡，因此说七识是动的，因为有了别性，有个知，有了知的结果，那就是动的结果。</p><p>内心里的风幡动是依七识心外的本质境而来的，外界的风幡也一直在刹那生灭着，如来藏又不断的把风幡的影像传导到胜义根里，那就是说如来藏在不断的出生和变现着风幡，祂一直在动着变现着。但是这种动是一种假相，如来藏却从来没有因此而动心过，从来不为此而起心动念，从这个角度来说，如来藏就是动而不动的。</p><p>外界的风幡，其实也是不动的，因为风幡是物，是生灭法，四大种子刹那刹那向外释放四大微粒，风幡就刹那刹那的生灭变异着。所有的物质色法都没有自体性，因此物不自动，因如来藏才有相似的动相。从实质上来说，一切法的出现，还是如来藏动的结果。而如来藏无形无相，动也是不动，从哪里也找不到祂的动相。</p><p>因为意根动，如来藏不得不随之现起意根所需之法，如来藏有为性动性就显现出来了，祂以这种有为的动性永远全心全意为意根服务，无我无私的为众生服务。</p><p>八、外物是第一次从无到有的虚幻的变现，是本质境，只是相对的真实，绝对的真实法只有如来藏。六识所接触到的内相六尘是第二次虚幻的变现，是性境和带质境，假上加假，因此说凡所有相皆是虚妄，都是虚幻不实的。外界事物与我们心里认知的六尘境界相比，是实际存在的，都是由无数个如来藏共同变现和维持的，实际上还是虚幻出来的假相，只是六识见不到罢了。</p><p>九、问：人眼所见的山河大地都是自己如来藏参与共同变现的那一分山河大地；人眼所见的动物、昆虫以及我们的亲人、花草树木，是否是对方流注出来的四大种子所出生的影像？</p><p>答：有情众生的色身也都是由四大组成的物质色法，这个物质色法也是由他们自己的如来藏单独变现出来的，跟其他众生没有关系，其他众生的如来藏不参与变现。当我们看见这些有情众生时，我们自己的如来藏把对方众生的色身如镜现像一般，在我们自己的胜义根处变现出内相分，而众生的色身对我们来说是外相分，跟我们没有什么关系。我们的如来藏把有情众生色身变成我们自己的内相分，变成内相分以后，就产生六识，六识再了别这个内相分，那么我们就看见了对方人、昆虫、各种动物以及鬼神、天人之类的有情众生。</p><p>凡是对方有如来藏存在的，有八个识存在的，或者是少于八个识存在的，都是有情众生，他们的色身就是他们自己的如来藏变现的，跟我们没有关系。我们看见了，是我们的如来藏摄取了对方的四大影像，变成我们自己的内相分，这个内相分才跟我们有关系，跟我们的如来藏有关系。外相分的有情众生跟我们自己的如来藏就没有关系。</p><p>就像我们自己的身体，是我们自己的如来藏单独变现的，与其他的众生都没有关系，与佛也没有关系。但是别人看见我们身体的时候，是他的如来藏把我们的身体变成了内相分，他才能看得见。这和看山河大地这个关系不完全一样，外面的山河大地，那是我们的依报环境，这依报环境有我们参与变现的那一部分。我们如来藏摄取过来，也是摄取自己参与变现的那分外色尘，然后再变成内相分，我们才能够攀缘得到，能够识别出来，能够看得见，我们看见的花草树木也都是如此。</p><p>十、外六尘与内六尘是如何形成的</p><p>外尘叫外六尘，通过外根传导到内根，形成了内尘，这整个过程全部是如来藏所为，不是外根和内根本身所为。外根和内根由四大组成，它没有什么作用，如果没有识在里生发作用，外根和内根就与石头、木头和无情物是一样的。正因为有识在外根、内根、在四大色身上运作，四大色身就好像有作用了，这个外根和内根就好像能够传导物质色法，就有了能接受物质色法的作用了，其实这些作用全部是如来藏所为。外根本身的作用是如来藏所为，内根本身的作用是如来藏所为，内根和外根的构造是如来藏给创造出来的。外面的一切物质色法六尘也是如来藏所创造出来的，那么如来藏通过外根把外六尘传入到内根里，形成内六尘，也是如来藏所造作的。</p><p>内六尘是微细的四大组成，也是如来藏产生出来的，是用四大种子生成的，外尘和内尘都是四大种子的堆积物。但是四大种子有区别，外尘是本质境，是实的四大种子所组成，内尘就不是本质境了，是依据外尘所幻化出来的影子，是更加微细一些的四大种子所组成，构造稍微有点差别，所以叫影子。就像那个镜子，镜子外面那个物是实物，叫外尘，镜子里面那个，就不是实的物质了，所以叫影子，虽然它也是由四大组成的，这个有点不好理解。影子和外面的形状是一样的，但本质不一样，是有区别的。</p><p>十一、如来藏是如何知道根尘相触的</p><p>根，不管是外五根，还是内五根，还是意根，都是如来藏亲自变现出来的，如来藏都要时时刻刻缘着和执持着，那么五根的大略信息如来藏都知道，意根的运行情况如来藏也知道。</p><p>尘，不管是外六尘，还是内六尘，都是如来藏变现出来的，外六尘属于实质色法，如来藏刹那都在缘着，其所有变化，如来藏都知道；内六尘是如来藏亲自传递到胜义根里的，与内六尘须臾不可分离；那么内六尘传递到哪里，如来藏一定知道，不会传递到非胜义根处。</p><p>这样的话，内六根，如来藏也缘也触也知，内六尘，如来藏也缘也触也知，根尘相触处，如来藏当然也缘也触也知，这不是什么困难的事。再根据意根的作意和决定，如来藏就会出生六识，六识在胜义根里触内六尘，就能了别六尘法。</p><p>十二、筷子放在水里出现折射现象的原理</p><p>比如外面的阳光照射进入房间里，中间没有玻璃的阻隔，其光与外面的阳光完全相同，没有差别，是同样的四大微粒组成。外面的阳光通过一层白色的玻璃进入房间里，进入房间里的阳光中的四大微粒受到白色玻璃四大微粒的阻碍和影响，就有所改变，与外面的阳光有所不同。如果阳光通过深色的玻璃进入房间里，深色玻璃的四大微粒与白色玻璃的四大微粒有所不同，对阳光的阻碍和影响也不同，进入房间里的阳光又产生了一定的差别。</p><p>如果白色的玻璃加厚，由五米毛变成八米毛的或者十米毛的玻璃，玻璃的四大微粒又有所变化，对阳光的阻碍作用增大，进入房间里的阳光又有所不同。如果两层玻璃之间有一定的距离，阳光透过两层玻璃，进入房间里，其光又有所不同。也就是说，中间的介质不同，透过来的光泽就有所不同。这是物质四大微粒之间的阻碍和影响作用。这些仅仅是物理作用，还不涉及化学作用，如果能发生化学反应，那结果就更复杂了。</p><p>放在水中的筷子也是这样，筷子刹那都要往外散发四大微粒，水外面的筷子，由于没有水中四大微粒的阻碍作用，散发出来的微粒不发生改变，而水里的筷子散发出来的四大微粒就要受到水中的四大微粒的阻碍，其形成的筷子的相状与水外面的筷子的相状就有所不同，发生了一定程度的改变。两截筷子连起来，不是在一条线上，这就是所谓的折射现象。</p><p>那根放在水里一半的筷子，在水面开始是折的了，一根筷子看起来就折成了两段。即使没有一个人看这根筷子，筷子也是那个折射的样子。所以不要想的太多，又是胜义根问题，又是别业问题，又是眼识意识意根有问题的。也别弄出什么带质境，什么境的，都不相干。弄出那么多的唯识名称，就是缠裹自心。</p><p>想想宇宙混沌未开之时，地球无有一人之时，一个生命都不存在之时，天地之间，日月穿梭、斗转星移，与众生的什么胜义根、意根、意识、五识有关系吗？（当然还是与意根有关系，只是显得不那么太紧密。）没有关系。那水里的筷子是什么样子？还是折射的样子。为什么是那个样子？你在与不在，物质世界就是那个样子的。什么样子？人类在地球上都灭绝了，世间照样还是风吹树摇，该是什么样子就是什么样子，不会因为有人去看而发生改变。不管人是否站在树边，风吹时树自然要摇摆的，折射的筷子，不管有没有人看，该折还是要折，不该折的就是不折，人为干涉不了。</p><p>但是，以上所说只是从一个侧面来说，并不全面。全面的话，要一大篇子的语言描述。人类在与不在，自然界的现象并不完全相同。就像房子长期来说几年之内，有没有人住，其变化是截然不同的。里面有很多道理，有人住的房子，意根执，那么他或者说他们的如来藏就会维持房子的存在，尽力的保持房子的现况，所以房子毁坏速度慢。而没有人住的房子，没有意根去执持，也就没有如来藏维护，房子毁坏的就快一些。但与水里的筷子折射是两回事。</p><p>如果没有一个人去看那根筷子，而是用一个自动摄像机自动录下来拍摄下来，然后我们把录像机里的视频拿到电脑上看，结果是什么呢？摄像机并没有胜义根没有六七识，没有如来藏，那个影像会是怎么样的？就是应该成为的那样，是折射为两段的。野外生物学家经常用这个办法录制野生动物的生活状况，那些状况有人看与无人看，有什么不一样的吗？没有不一样的。没有识心的时候，有没有苹果和筷子的自然现象和区别？我们都睡着了，水里的筷子仍然是折射的，不会变成直的了；醒着时看孩子是漂亮的，睡着没有六识，孩子仍然是原来的样子，不会变成丑陋的；白天家里的鲜花看起来很美丽，睡着了或者没有人看时，鲜花仍然是美丽鲜艳的，不会变成难看的样子。这些人和物不会在人前和人后是两个不同的样子。</p><p>在父子合集经里，世尊描述了世界毁灭时的情形，那时早已经没有人类了，可那些自然现象还是照样存在和生住异灭着，不管有没有众生和识心分别。孩子没有出生时，是没有父亲和母亲的名义名称存在，但是这两个人还是存在的，不管孩子出生与不出生。没有鲜花的名字和美丽的名词存在，但还是有鲜花的美丽的状态存在着。就像一个人的性别，并不在于是否有人去分别而发生改变，生来就是固定的。如果性别不是固定的，是随着识心的分别而出现的，那娑婆世界就有意思了。</p><p>唯识界发明了那么多的名词概念，搞出那么多的名相，把研究者的心搞得混沌一片，还是解释不清楚事实真相。钻进那些名词概念里的人，是否有人钻出来了？如果像福尔摩斯那样的头脑，进入唯识界，佛法就会完全不一样了。学佛人的智慧并不比世俗人的智慧高。我们所学的唯识再不究竟，有一定的错误，智慧不足的人全盘照搬，就会受到错误理论的影响，知见扭曲，还以为自己掌握了真理，别人都是邪见。其实是自己过于自信，过于信他。那些唯识名相，只有智慧很深的人才能不被缠绕，不被羁绊，不被误导，那么多人都陷在其中，不能自拔，还津津乐道。</p><p>如来藏形成的物质四大微粒的问题，是甚深的唯识种智问题，即使古代唯识，也没有几人具有唯识种智，把唯识讲对讲透彻了。好多都是没有开悟的人逞能，非要著书立论，留给后人苦恼和笑柄。即使开悟的人，那个智慧也离唯识种智的智慧相差很远，根本也弄不明白唯识问题，还要著书立论，贻误他人。后人不知，还跟随其后，追捧不已，可叹！</p><p>十三、问：科学家们用亿万倍显微镜放大镜观察物质时，是观察的胜义根里的物质色法，还是观察胜义根外边的物质色法？如果科学家观察到的是胜义根里的内尘，那么这个内尘经过了多少次的转折变现，才成为眼识意识所见到的极细小微粒的波动态？</p><p>答：只要眼识意识知道了，就是知的内尘，永远不可能知外尘。仪器本身没有了知性，六尘境界都是意识观察出来的。科学家观察的是内尘，外尘不知道是什么状态，与内尘不可能是完全相同状态。因为四大微粒在传导过程经过显微镜，经过肉眼，经过各种传导神经，最后才到达胜义根。经过每个程序时，都出现一定的阻碍，四大微粒就要改变一些，到达胜义根究竟改变了多少，我们就不清楚了。</p><p>中间经过的程序越多，改变的越多。经过十层玻璃，和不经过玻璃眼识直接通过眼根所见到的色法，肯定有区别。有兴趣的可以试一试。外尘本质境经过每一层玻璃镜片，四大微粒都要发生改变，玻璃镜片就会阻挡或者过滤掉一些比较粗的粒子，最微细的粒子才能通过各层镜片和眼根的玻璃体以及传导神经，其中色彩要改变，物质的形态等等要发生改变，清晰度要小。如果镜片不是白色的，而是彩色的，四大微粒通过时，阻挡和过滤掉的粒子可能要更多，即使是不同种类的白色镜片，四大微粒通过时，受到的阻碍也不同，最后到达胜义根里的粒子形成的影像就有差别。</p><p>研究来研究去，意根是否对物质色法感到虚幻了？意识研究，意根绝对不同步，意识证，意根不能同时证。需要修定观行，意根才能给与认可认证。</p><p>十四、为什么六尘境界越远了别的越不清晰</p><p>不管众生有没有五色根，意根依如来藏都能缘一切法，只要如来藏能见一切法。其中如来藏缘外六尘的时候，摄取外六尘的四大微粒，立时形成与外六尘一模一样的影像，意根就能缘到这个影像。如果有五浮尘根和胜义根，如来藏再传导到五浮尘根那里，意根仍然能缘到，再传导到胜义根那里，意根更能缘到。如来藏在摄取外六尘的一刹那，一直到传导四大微粒到胜义根里，这一路的影像是在不断的生灭变异的，中间有介质的阻碍作用，四大微粒的数量以及排列结构要受到影响而发生变化，影像就会发生变化，与胜义根的距离越大，影像变化越大。</p><p>所以我们看到远处的物质就会模模糊糊的不清楚，越远处的声音听着声音越小越不清晰，越远处的香尘越淡，阳光越远热量越小，那都是因为六尘影像受到中间介质阻碍影响四大微粒发生改变的结果。</p><p>因为意根能缘到传导到胜义根之前的六尘，所以遇到重大而突然的六尘境界，意根就会非常快速的提前有了反应，好像提前有了准备似的。</p></div>"
},{
    "title": "第三十章　如来藏的四分和心所法",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十章　如来藏的四分和心所法</strong>　</p><p>一、八个识的四分</p><p>四分就是见分、相分、自证分、证自证分，八个识里，不仅六识有四分，有证自证分，第七识也有证自证分，第八识如来藏也有证自证分。八个识都有四分，只是对没有观行能力、不能实证的人不说罢了。有很多甚深的法，佛对信根不具足，智慧力不具足的人，或者是不说，或者是曲曲方便说，而不是直接说，因为直接说众生无法理解，徒增其疑心。</p><p>随着修行的不断加深，烦恼的降伏和断除，智慧力的不断提升，八个识不仅识性要不断增强，智性也越来越强，越来越深。每个人的七识功能绝对不一样，也就是心所法绝对不一样，这就是修行与不修行的区别，修行得好与修行不好的区别。</p><p>随着修行的不断深入，不仅第六识有所变化，第七识的变化也越来越大，最主要表现在心所法的转变上，表现在识心的智慧上，也就是说修行成功的标志就是转识成智。即使没有修到入地，其识心智慧，也应该与凡夫不同，也在暗暗地转变着，只是众生有没有能力观察到而已。没有能力观察，就说明其识心的智慧性还是不够好，还有遮障。对于没有观察能力信根又不足的人，那就不能再说甚深法了。</p><p>二、如来藏也有四分：见分、相分、自证分、证自证分，所以如来藏也有知，祂知的范围非常广泛。因为如来藏有了别性，能了别意根和身根器界，了别业种，这个了别性就是如来藏的见分，而身根器界就是如来藏的相分。如来藏因为有了别性，所以如来藏就有知。这个知，就是自证分，能够亲自证知意根的作意和思心所，证知身根器界，证知业种。</p><p>如来藏也有证自证分，能够反观自己，知道自己了别了意根的心行，知道自己了别了身根器界和业种，但是如来藏不知道自己，也不执自己，因此如来藏是无我的。如来藏的见分极广，也就是说祂的了知了别范围非常广，了别七识，了别身根器世间，了别业种，这种了别性，就是如来藏的见分。</p><p>三、如来藏的四分都是什么</p><p>如来藏的见分，就是对众生的根身器界的了别性，如来藏能够了知意根末那识的心所法，了知以后配合意根现起三界世间万法，因此如果没有意根，如来藏就不能运转出生一切法。如来藏的见分也体现在能了别众生的根身器界和业种上，如来藏的见分能见一切法，祂除了不知境界为何物，其余祂都知。如来藏的相分，包括外六尘和内六尘，以及众生的五阴身、宇宙器世间和七识心。</p><p>如来藏的自证分，就是如来藏能够亲自证知祂所了别的对象，如来藏了别意根和根身器界之后，如来藏就有个知，这个知就是自证分，所以如来藏有知，对于六尘祂虽然是无知，不知具体相貌，没有名言、定义和概念，对于其它的法都能知。如来藏的证自证分，依地上菩萨的现观智慧来观察，如来藏能够了知证明　自己已经了知了意根的心行，已经了别了根身器界，已经了别了业种，就是说如来藏能够反观自己的运行状态，能够反观到自己正在做什么，这就是如来藏的证自证分。</p><p>如来藏对于六尘，还是有觉有知的，只是觉知的方式方法与内容，不与七识相同，意识无法了知到如来藏的那种觉知性和内容，到底如何，因为根身器界也属于六尘。</p><p>四、问：关于如来藏的见分，从圣教量和理论上来推论，如来藏既是识，就有了别的功能。但现观如来藏的见分，应当在明心后的总相智和别相智阶段就可以现观。比如从祂配合七转识运作一切法上，是否就可以现观祂能了别七转识的心行？这就是维摩诘经中讲的：知是菩提，了众生心行故。</p><p>答：现观如来藏的见分，必须要有悟后的别相智和道种智，才能观察如来藏的更深细的运行，才能证得如来藏具体的了别性，只有开悟的总相智，还是不能了知如来藏的了别性，这种所谓的了知也只是依圣教量想象出来的，不是实证。而要证得如来藏的见分，观察如来藏的见分，必须要有道种智才行，至少要有极深的别相智。</p><p>五、如来藏是否有相，运行的行相是否属于如来藏的相</p><p>金刚经所说的凡所有相皆是虚妄，是说世俗法的所有相是虚妄的，不是指真如心体。真如心体本身是无相的，虽然无形无相，但是祂在五阴上能与五阴七识和合运作，既然能运作，就有运作的行相存在，这种行相，也不是世俗的法相，因此也是无相的。譬如风无形相，肉眼不能见，但是通过风对物体的作用上，从物体被吹拂的形态上，可以观察到风以及风的大小，物体表现出的形态，就属于风的运行行相，但风本身还是没有形相。同理，如来藏的运行行相是在五阴身的变化上体现出来的，如来藏本身还是无相的，那么如来藏的运行行相也不是真实的，五阴一灭，其在五阴上的行相就消失了。</p><p>六、八个识都有证自证分，所谓的证自证分就是识心对自己心行的反观，对自己心所法的反观，对自己运行程序的反观。如来藏也有这种反观的能力，否则祂在出生万法的时候，就不能避免错乱，有可能要重复出生或者是有缺漏，这样就不能完全如实的按照业种出生万法，不能客观公正的实现众生的因缘果报。</p><p>那么如来藏的证自证分体现在何处呢？首先说如来藏在了别众生业种的时候，祂知道什么业种缘熟了，什么业种缘没有熟，缘熟的业种祂要现行出来时，就要输送四大种子，或者是七大种子都同时输送出来实现业果，这些工作祂不一定都能在一时间内完成，祂要循序渐进按部就班的按照业种逐渐的完成。有的业种的现行需要很久时间才能全部实现，祂就需要花费很久的时间来逐渐的完成业种的现行，所以业种是慢慢的一点一点现行出来的，现行了多少，实现了多少果报，祂是清楚的，往下还需要实现什么样的业因果报，祂也是清楚的。这些事都是祂自己做的，祂都清楚。</p><p>这个所谓的清楚，一个是祂的自证分的功能，一个是祂的证自证分的功能。自证分的功能是祂了别了业种，了别了作业的程度；而证自证分的功能是祂自己能证知自己了别了业种，能证知自己都做了什么，能了知自己实现业种的程度和过程，以此就能知道自己下一步还需要做什么，直到完全把业种都现行出来为止。</p><p>其二，如来藏完全实现了业种以后，祂自己也知道，那就不再了别此业种，不再实现此业种，就要转移到下一个业种的了别中，让下一个业种现行出来，这就是如来藏的证自证分功能，这样祂才能有条不紊的不断的实现众生的业因果报。下一步还需要输送哪一部份的业种，要实现众生什么样的果报，祂都很清楚，所以如来藏生成一切法，都是有条不紊的。祂法尔如是的了别业种，输送业种，现行业种，实现众生的果报，在运行过程中祂能反观自己运行了多少，到了什么程度，这就是祂的证自证分，这样祂才能知道下一步还需要如何运行。</p><p>在输送业种变生众生色身的时候，整个色身全部变完，一个业种才算实现完了，但是变完色身得需要多长时间呢？也许几个月也许几年也许更长时间，在这其中如来藏要不断的输送四大种子，一点一点的变生色身，祂时时都能知道色身已经变化到什么程度了，变现出了多少，下一步应该接着变化哪部分，输送四大种子的比例成分是多少，输送到哪个部位，多长时间输送完，还有什么没有实现的，如来藏都知道。变生众生的头，变生众生的手，什么时候变，变多少，变什么样子，祂都知道，所以自己在做什么，还需要做什么，祂都能够证得和了知这些内容，有反观力，这就是如来藏的证自证分。</p><p>其实大多数时候如来藏要同时现行多个业种，有善业种，有恶业种，还有不善不恶业种，这些业种混在一起，如来藏都能逐个同时了别，不会混乱不清；也能同时把这些业种都现行出来，同时实现众生的善恶业果报而不错乱，如此复杂的程序，如来藏都能有条不紊的运行，让善有善报恶有恶报。在这些复杂程序的运行当中，如来藏能反观到自己的了别状态和运行情况，所以才能刹那抉择后面要如何运行，要输送出怎样的四大种子，让各个果报都如何的实现，这就是祂的证自证分的功德。</p><p>其三，如来藏在了别众生五阴身的时候，五阴身现在是什么情况，下一步五阴身应该要如何变化，是变得更好，还是变得不好，哪里应该变得好，哪里应该变得不好，输送什么样的四大种子，是否是协调的，如来藏依业种都能知道。因为众生有因缘果报，什么时候应该出现什么病况，这个病什么时候消失，如何输送四大种子以改变色身的状况，改变了多少，还要如何改变，是否还需要改变，如来藏都能知道。在这一系列的运行当中，祂自己的行为造作自己都能知道，这就是如来藏的反观力，就是证自证分。</p><p>因为有这种反观力，有这样的证自证分，如来藏才能接续进行下一步的运行，不会重复从前的运行，不会重复以前的行为造作，不会变出五个手指头以后，还要再重复变出五个或多个手指头，不会变出一个头以后，还要再重复的变出一个头；也不会把眼根变出一半，就不再变出下一半。这些证自证分都不是在对于六尘的分别性上，都在于分别众生的业种，分别众生的根身的运作上。因为祂要维持众生的五阴身，五阴身的情况祂都能掌握，当祂输送四大种子维持着五阴身的时候，输送什么样的四大种子，自己输送了多少，应该再怎样输送，祂都知道；自己在某个法上的运行到什么程度了，祂也都清楚，所以祂既有自证分，也有证自证分。</p><p>其四，再说了别器世间的时候，如来藏因为能了别业种，就知道宇宙器世间要如何变化。祂要输送四大种子，来维护和变化器世间，那么祂维护到什么样子，器世间应该有什么样的变化，变到什么程度，祂都清楚，什么时间出现什么样的灾难，或者这个灾难什么时间消失，祂都知道。在这期间，祂自己的运行情况都能掌握和了知，所以祂能知道下一步应该如何的运行，不会重复运行，也不会有所缺漏。既然如来藏有这些方面的知，祂就有自证分，也有证自证分。</p><p>因为如来藏能了别业种，也能了别五阴身，那么五阴身下一时刻，下一分，下一秒，色身该如何变化，如来藏应该都清楚。因为能了别业种，就知道此时该现行什么业种，业种现行后五阴身的四大种子就要发生改变，身体就随之发生变化，与业种一致。五阴身之所以能一直悄悄的变化着，就是因为如来藏有了别业种的功德所引发出来的，祂根据业种输送四大种子，四大种子随时随地在发生着改变，四大种子是调和的还是不调和的，输送的比例是多少，这些如来藏都知道。祂自己对于这些改变完成了多少，到了什么程度，还需要如何运行，如来藏都知道，那么这里不仅有如来藏的自证分，还有证自证分，如来藏清楚自己的运行情况，这就是证自证分，如果不清楚，就无法完全按照业种现行果报，因果就要错乱了。</p><p>其五，四大和五蕴的改变实际上是刹那刹那在变化的，我们的觉知心根本了知不到。等到这个色身变化到一定程度的时候，觉知心就知道了，但是身体已经出现病障了，或者是已经变化很明显了，某个部位出现了不适，这时众生的五阴才感觉到，也包括往好的方向转变。其实色身是刹那刹那一直在变化的，五阴不容易觉知到，等积累到一定程度，非常明显了，我们六识才感觉得到，众生的觉知心都是后知后觉，如来藏才是先知先觉，如来藏在了别业种时就知道这些情况了。</p><p>有些特别重大的业种要现行出来时，如来藏了别到，意根依之也能了别到，意根就会警觉意识，引起意识的注意。如来藏和意根有时要提前一年或更长时间让众生意识知道，但是意识心往往无法猜测出来要有什么事情发生。如来藏对业种的了别，自己是确定不疑的，所以才会发出信号，意根了别再警觉五阴，让五阴知道。无始劫以来，如来藏从来没有做过错乱的了别，如来藏对自己的确定不疑，就是祂的证自证分。</p><p>因为如来藏能了别业种，根据业种就能知道五阴身和器世间要发生的变化，所以如来藏叫作先知先觉，宇宙器世间没有发生变化之前，祂就根据业种先知道了，业种缘熟时，祂就输送四大种子来运行和变化宇宙器世间，让宇宙器世间的改变符合业种，当然这不是一个众生的如来藏所能单独完成的事情。宇宙器世间该毁坏时，如来藏会输送变异的四大种子，四大种子的比例在悄悄的发生着变化，使得宇宙器世间慢慢的发生了改变。</p><p>当宇宙器世间变化到一定程度时，我们这些人类或者其他众生才觉知到宇宙器世间发生变化了，是如何变化的，是变好了，还是变不好了。只有器世间的变化积累到一定程度，众生才能了别到自己的生存环境变成这个样子了，再往下变成什么样子，我们可能就不太清楚了，但是如来藏始终是知道的。</p><p>而在宇宙器世间没有发生变化之前，如来藏就了别了业种，知道要发生的变化，知道该怎样变生宇宙器世间，该怎样输送四大种子，以形成或者毁坏宇宙器世间，所以如来藏叫作先知先觉。如来藏在变化宇宙器世间的时候，祂能知道已经变化到什么程度了，还需要如何变化，能知道自己是如何运行的，还要如何运行，这就是如来藏的反观力，就是证自证分，没有这种反观力，祂的运行就会混乱，不能如实变化器世间，与业种就不一致了。</p><p>众生的五阴身都是在渐渐的成熟，然后再渐渐的衰老，只有变化到一定的时间和程度，才发现自己长大了，自己改变了，或者发现自己衰老了。但是每个众生成熟和衰老的时间早晚都是不一样的，因为前世所造作的业行不一样，业种不一样。众生该什么时候开始衰老，衰老到什么程度，如何衰老的，色身如何变化，如来藏都会根据众生所存的业种了别到，祂就知道该如何变化色身，缘熟时祂就输送四大种子形成和改变色身，让色身一点点的发生变化，变化到一定程度，众生就觉知到老了，长白头发了，腰弯了，腿走路不灵巧了，脸上出现皱纹和色斑了。</p><p>其实在这之前如来藏一直在输送着四大种子，使色身一点点的发生着变化。在改变色身的运行当中，如来藏都清楚自己的运行和造作，祂不时的了别业种，依业种往下运行，继续变造色身改变色身，既不重复也不缺漏，按部就班，有条不紊。因为祂有反观力，能知道自己运行到了什么程度，就知道下一步该如何运作，这就是如来藏的证自证分功能。</p><p>其六，众生到临终的时候，很多人不知道自己要死亡了，也不知道什么时候要死亡，但是如来藏了别业种以后，就知道众生到什么时候应该死亡。临死之前如来藏依据业种，知道生命还有多长时间，现在身体状况是怎么样的，下一时刻身体应该是什么状况，如来藏都知道，因此在众生死亡之前，如来藏要发出一些警觉信号来告知众生。</p><p>其实是让意根了别，还不是有意让意根了别，如来藏永远是无意的运作，无心的运作。意根了别到如来藏运作出来的一些法，就知道即将要发生的事情，一年两年或者是更长时间要发生的事情。意根知道以后 再想方设法警觉意识，让意识知道，这是主动性的，有意的，有思心所的运作，而如来藏却没有这方面的心行。这是如来藏的运作与七识运作的差别，虽然如来藏也有自己独特的心行。</p><p>因为众生的第六识不了别业种，是后知后觉，不能先知先觉，所以第六识不一定能感觉到自己要死亡了，需要如来藏和意根的警觉暗示，得到暗示以后，第六识也不一定能觉察到，如果第六识比较敏感，也许能感觉出来自己可能快不行了，这一生快结束了。</p><p>如来藏能刹那改变色身，显现色身的各种状况，意根能了别色身情况，知道身体的状况意味着什么，只是第六识不太清楚，等到如来藏把死亡的征兆都显现出来时，第六识就能完全了知，没有疑问了。如来藏对于业种的了知，和对于众生要死亡的了知，是确信无疑的，因此就要警觉众生，让众生知道自己要死亡了，让众生心里有所准备，这个确信无疑，就是如来藏的证自证分。</p><p>从以上的分析和整理当中，我们应该知道，如来藏不仅有见分和相分，还有自证分和证自证分，这四分都很重要，功德都很广大。如来藏依此四分，就能成就三界世间万法，如理如实的实现众生的因缘果报，让众生的所作所为都功不唐捐。这四分几乎都体现在如来藏在有为法上的运作，虽然祂有这么多的有为法的运作，可是如来藏从始至终都是一种无为的心行，从不贪着任何一个法，也不执著任何一个法，为众生显现出来的都是一个心量广大的大人相，我们的七识心真的应该好好向祂学习，才能获得无比的自在。</p><p>七、见分和相分本质都是如来藏</p><p>八个识的见分是识的体性，也是识的用，自证分是识的体性，也是识的功用，乃至于证自证分也是识的体性，也是识的功用。</p><p>识种子是清净的，形成的识是清净的，可是识的用就不清净了，因为心所法参与辅助运行，心所法不清净，识的功能就不清净。但是这些功用也没有不清净相，因为本质都是如来藏，全体都是如来藏性。就像黄金做成的马桶，相是黄金相，本质是黄金，性质是金性。七识的本质是如来藏，性用是如来藏性，没有不清净之说。这是万法最了义的内涵，是了义中的了义，不能再了义了。一般根性的人吃不消，这是肯定的了，那就从虚妄的相上来说，相有不清净相。</p><p>相分，包括色法相、心法相和非色非心法相。心法相本质是如来藏性，是清净的；而色法相和非色非心法相，是如来藏出生和显现出来的，本质同样是如来藏性，同样也是清净的，但是不妨碍虚妄相上的不清净。</p><p>八、对于凡夫来说，如来藏没有返观自己的功能，所以说祂没有证自证分。证自证分的功能能够证明自己的存在，感知自己的存在和运行。能够感知自己存在的七识心有我性的心，能自认自己，自证自己的存在和运行。</p><p>意识心能观法尘，观境界，观五识和第七识，明心后能观如来藏。意识心也能观自己，所以祂不仅有自证分，也有证自证分，祂能了知到自己在了知法尘境界，了知自己的运行状态，了知自己的心行。而真觉如来藏没有我性，祂是无我性的心，从来不认为自己是真实的，也不做主宰，也不观六尘。因为祂不觉知六尘相貌，所以祂对境界不起心动念，没有烦恼和习气，没有无明，没有想法，没有知见，清净无染。</p><p>明心悟道以后，智慧增长时，就会观察到第七识和如来藏也有证自证分。学大乘法总的原则就是，如来藏不是在五阴十八界里的世俗心，是没有我性的心，祂不认为有我和我所。而七个识心都是有我性的，总是在说我怎样怎样，总是在说我和我的，都有我与我所。</p><p>九、之所以对普通众生说如来藏没有证自证分，第一，是说凡夫和地前菩萨观察不到如来藏的证自证分，所以不说如来藏有证自证分；第二，如来藏的证自证分的内容与意识的证自证分的内容不同，也与其他妄识的证自证分不同。如来藏无我，不知有我，但是祂也能知道运行了哪些法，已经运行了的，祂不重复运行，没有运行完的要继续运行，知道要如何运行。</p><p>如来藏无我性的证自证分，语言很难说清楚。就像如来藏的了别性了知性一样不容易对普通众生说清楚。如来藏是否了别六尘？当然了别，否则祂如何变现六尘、改变六尘、执持六尘。但是第八识的这种了别，又不能如六识一样了别具体内涵，了别了六尘之后，知道了别是什么东西。如来藏了别六尘之后，什么也不知道，然后再继续了别和运行。如来藏机械化的那种了别方式就像电脑了别程序一样，电脑也能了别字体，写出字体，但不知字体是何东西，而意识就知道字体是什么，有什么意义。</p><p>如来藏的那种了别也像洗衣机了别指令洗衣服一样，但洗衣机不知道指令的具体内容意义是什么，意识就知道。如来藏的运作了别了知性犹如机器人那种无心，工作了却不知道究竟做了什么，而意识就知道。</p><p>十、八个识的证自证分是否能时时现前运行</p><p>证自证分，也就是反观力和觉照力觉知力，七识心的证自证分不能时时出现，因为禅定力和智慧力不足，识心就不会有能力反观反照自心。第八识可以时时有反观力有证自证分，因为第八识的定慧永远存在永远不改变，永远不增不减，不用修行就存在。</p><p>比如意识的证自证分，时时觉照自心，需要很强的定力，慧力也要好。佛在大念住经中教导的观行方法就是觉照自心的方法，自己在做什么都要知，有这个知，心就有定，不知心就散了。佛为什么这样教导呢？因为众生心都是散乱的，不能觉知自心。觉知自心是证自证分，不能觉知自心，就没有证自证分。</p><p>能有反观力，能觉知自心的人，一方面是有一定的慧力，一方面有一定的定力，学佛与不学佛都是如此。所以每个人的智慧不同，有的人了解自己，有的人不了解自己。同理，其祂几个识心也是这样，证自证分不能总是现前运行。</p><p>证自证分就是反观力，能观察自己在做什么，已经做了什么，有什么打算。这里面当然离不开见分和相分，离不开自证分。做什么的“什么”，就是相分，做就是见分，做什么就是自证分，知道做什么了，就是证自证分。</p></div>"
},{
    "title": "第三十一章　如来藏的心所法",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十一章　如来藏的心所法</strong></p><p>一、五遍行心所法中的一切俱，是指五遍行心所法与一切识心俱，与一切法俱。只要有识心在运行，一定有五遍行心所法在运行着，如果离开五遍行心所法，识心就不能存在，无法运行，不能有了别活动。那么在一切法上都有识心的五遍行心所法，因为在一切法上一定至少有第八识和第七识的运作，五遍行心所法必然要伴随着两个识运作。</p><p>五遍行心所法互相俱生的意思是，这些心所法是聚集在一起出生运行的，比如第八识要出生一个法，五遍行所有心所法都要伴随第八识至始至终的运行，一个都不缺少。而六七识则不一定，六七识作意以后，如果不感兴趣，就不会触，尤其是第七识意根；触了之后，未必要受，尤其是第七识意根；受之后未必要想，尤其是第七识意根；想之后未必要思，尤其是第七识意根。意根心所法如果不往下运行，六识就不能出现，即使出现也会消失停止运行，尤其是意根的思心所法不出现，六个识都不能出现。可见意根的王者统治地位，祂的权利有多大。</p><p>佛法甚深，思惟稍微不得力，就会出现偏差，而极大多数人思惟都是有偏差的，自己无法发现，也不愿意承认。很多人就是因为自己思惟不得力，没有办法只好百分之百信受名人的言论，依止一个现成的答案，以为究竟，认为这是保靠的，错也不知。这是目前佛教界极其普遍的现象。</p><p>二、心所与心王的关系</p><p>心王是主，心所是随从，是主的用；心王每一刹那都以心所法的形式运行，不能离开心所法，心所法离开心王，也就不能存在、不能运行了。心王出现的时候，就以心所法的形式运行，没有心所法的运行，肯定就没有心王。其中五遍行心所法与八个识刹那都不能离开，其他心所法只是个别时候才伴随心王运行。心所相当于心王的柱杖一样，心王犹如皇帝，心所就如黄袍和皇冠。</p><p>识心的运行，就是心所法的运行，没有心所法，就见不到识，见到心所法的运行，就等于见到了识。其中作意、触、受、想、思心所法，就是八个识对所缘境生起的识别作用，心所法就是八个识的工具，心王从来离不开工具，就像一个人走路必然要用腿和脚一样，离开腿和脚就不能走路。八个识相当于身体，心所法就像两条腿，身体要走路必然用腿，八识要运行造作，必然用心所法。</p><p>为了便于理解心王与心所的关系，我们可以把八识比喻为色身，心所法比喻为眼睛、耳朵和鼻子；色身要活动，就要依靠着眼睛、耳朵、鼻子等等，如来藏要运行，就要依靠心所法。或者把心王比作机器人，心所法比作机器人的四肢，机器人要运作，就依靠着四肢，四肢活动起来，就表明机器人出现和工作了。</p><p>其中五遍行心所法与如来藏最密切不可分，分秒刹那都不能离开；五别境心所法在其次，别别现行，不是时时都能出现；善十一心所法则时有时无，烦恼心所法，也是时有时无，最终都要灭去。那么心王要运行，每刹那都用五遍行心所法，有些时候就要用五别境和善十一心所法，烦恼心所法不一定每个心王都有，如来藏天然就不具烦恼心所法，七识的烦恼心所法，通过修行，最终要灭尽。</p><p>除了五遍行心所法一直不变的跟随着识心运行，其他心所法如五别境心所法只是在某些个别时候起用，烦恼心所法也不是一直都要起用的，而且随着识心的清净程度，烦恼心所法要逐渐减少和灭除不用。用得太频繁的人，一定是烦恼重的人。心行还没有修善的人，善十一心所法不容易起用和现前，心行变善的人，善十一心所法要常常现前起用，起心动念与善相应。</p><p>有的时候，几种心所法可以并行起用，比如说五遍行心所法肯定是刹那都在运行的，同时识心里生起了欲望，欲心所出现了；同时心里还有念头，这是念心所；同时自己还知道有念头，这是慧心所在运行；再同时生起惭愧心认为不应该有欲望和念头，这是善心所起用；如果同时心里想起某人某事，心里起了恨意，这是烦恼心所运行出来了，这时善心所就没有出现，二者只能有一。</p><p>善恶心所法不能并行，意识正对一个法起善心时，不会有恶心出现。贪心所是恶，不贪是善，二者必居其一，不能同时存在现行，有贪就没有不贪，二者只能有一，或者一个也没有；嗔是恶，不嗔是善，二者必居其一，不能同时存在和现行，嗔与不嗔是一对，有不嗔，就没有嗔，二者只能有一。修行好的人，善心所要增加，现行的时候多；定力好，心清静的人，善恶心所都很少现起，心就不善不恶，对境而不动。</p><p>五别境心所法和五遍行心所法可以并行，与善恶心所法二者之一种，可以并行。因为识心有明就没有无明，有无明就没有明，对立的法不能同时现行，可以前后现行。修行得越好，证量越高，在日常生活中，心思就相对简单一点，也就是并行的心所比较少。即使是五遍行心所法，其现行时，运行过程也比较简单而不复杂，五别境心所法中定心所法现行时间比较多和长，欲、念、胜解心所法就很少现行，烦恼心所法更是少于现行。</p><p>三、如来藏的五遍行心所法</p><p>三界唯心的意思是说，三界世间一切法都是从如来藏心体当中出生的。为什么如来藏能出生万法呢？因为如来藏心体里具足一切法的种子，有种子就能出生一切法，种子是出生义。一切法的种子就是如来藏心体中的七大种子，同时有业力种子配合，三界法就能被如来藏现行出来。如来藏在三界世间法当中运行，是以心所法的方式运行，当祂运行时，同时就输出业种和七大种子，如来藏用七大种子生出心法和色法，心法和色法具足，三界世间法就具足。</p><p>众生位的如来藏只有五遍行心所法，其中如来藏的作意，是对种子作意，对五阴身作意，对七识作意，对器世间作意。如来藏的触心所，是触业种，触五阴身，触七识心，触宇宙器世间，触外六尘。触之后是受心所的运行，对触的那些对象领纳和领受，也就是接纳下来，在其中并不生起苦和乐觉受，没有苦乐受，完全是舍受，也就是没有觉受。纳受之后，想心所运行出来，想是了知、了别，然后就取相、持相，如来藏这种取相和持相的方式与七识有截然不同的区别。最后思心所起用，思量抉择，决定要造作，于是就输出七大种子开始变造，于是乎三界世间法就出现了。</p><p>四、如来藏的思心所有什么功能作用</p><p>思心所的作用主要是抉择，做决策和决定，然后开始实际行动。八个识都有思心所，都有抉择性，都能作出决定，只是抉择的内容不同，权利大小的不同。八个识都是根据什么作抉择呢？八个识在作抉择之前，都有各自不同的心识活动，如果没有任何心识活动，就不能作抉择。五遍行心所法是八个识都具有的识心活动，对相分的作意、触、受、想、思，这些识心活动运行到最后，就对所了别的法生起决定心，准备有所造作和行动。</p><p>比如如来藏的思心所的造作，如来藏创造了一部分耳根，祂要时刻决定下一刹那如何再创造剩下的部分。如何创造，在哪个位置创造，创造成什么样子的，什么色彩什么形状的，如来藏都要不断的作决定。这些决定是在如来藏了别业种和耳根状态时决定的，其了别过程中有对业种的作意、触受、想、思的识心活动，也有对耳根已经变造部位的作意、触、受、想、思活动，然后就在相应的部位输出与业种相应的地水火风四大种子，耳朵就慢慢的形成和完善了。</p><p>再比如胖人要减肥，如来藏就得随顺意根，根据业种和现行的业缘，决定输出四大种子，吸取色身上的四大微粒，不断变化四大种子的比例结构和排序，同时配合七识进行身体运动和调节饮食结构，最后身体就发生变化了。当然如来藏没有五阴和色法的概念，也不具体了别色法的相貌，祂只是了别业种，了别意根的思心所，再根据色身所摄取的四大和业缘，也许能让色身逐渐瘦下去；如果业种不允许，业缘不具足，瘦下去就很困难。</p><p>一切法的运行，如来藏都要有思心所作决定；而作决定之前，祂一定有心识活动，作意触受想思，只是一般人无法了解到。第七识只知道决定要身体瘦下来，第六识只知道让身体变成某种样貌，具体如何改变意根就不知道了，反正改变色身也不是祂改变的，尽管意根认为都是自己所为，实际却不是。第六识观察智慧不足时，也不知道身体具体是如何瘦下来的。如来藏帮助色身减肥以后，六七识就觉得自己可瘦下来了，好像祂付出了什么代价似的，实际上意根只是作个决定，其余的事，都是如来藏完成的。</p><p>如来藏了别意根的心行，就像机器人了别人的指令似的，就像电脑读取数据似的，就像电脑识别人手的操作似的；如来藏了别业种就像电脑读取程序似的；如来藏输出和实现业种，就像电脑完成某个程序似的。所以如来藏虽然造就了一切法，就像什么事也没有做似的，祂的了别，根本不是了别具体的人事物的样貌，而是一种抽象的了别，像了别符号似的；就像音乐家识别乐谱，就能谱曲一样。</p><p>五、如来藏的运行，依自体的五遍行心所法：作意、触、受、想、思。五个心所法在本质境上运行，就能对业种，对众生的根身器界有了别作用，有见分作用，就能见一切法、照了一切法，这一切法都是如来藏所见的相分。而如来藏的思心所运行之后，就能显现出带质境，是如来藏思心所变造出来的，带质境就是如来藏的相分，是如来藏见分运作的结果，是见分所显示出来的法尘。</p><p>第七识依如来藏的见分，也就能缘到如来藏见分带起的相分——带质境。所以第七识虽然能缘如来藏的见分，但与如来藏所见的相分是不同的，一个是本质境，一个是依本质境所变起的相似境，如镜子中的火，是幻化的。虽然如来藏见分所见的本质境也是如来藏幻化出来的，第七识所见的带质境是幻中幻，是二次变现。</p><p>胜义根处的相分是带质境和独影境。带质境包括真带质和假带质，分为变带和狭带，有色法也有心法，还有非色非心法。如来藏所缘的本质境是四大组成的微粒，是比较粗重的，比较实的色法；而带质境的色法虽然也是四大微粒组成的，但却是微细的色法，不太实了，比较虚幻。就像人类的色身与鬼神类的色身的差别似的。本质境比如说是四大组成的火和水、大地山河等等，带质境就好比是镜子里的火和水、大地山河等等。一个实，一个虚，七识只能了别虚法，不能了别实法，实法只能由如来藏了别。</p><p>六、如来藏里的识种子输送出来形成了七个识，七个识一现行开始运作时就以心所法的形式运行。首先是五遍行心所法，然后五别境心所法不定时跟随着运行，也有善恶心所法不定时跟随着运行，七个识有时善有时恶，有时善恶都不现起，但五遍行心所法一定时时刻刻跟随七识现前运行。可是这些心所法都没有种子，七大种子里没有五遍行的种子，业种里也没有心所法的种子。但是七识一现行，五遍行、五别境与善恶心所就跟着出来运行，于是身口意的业行就生出来了。</p><p>识种子像水滴一样，水滴连续起来形成水流，水流相当于七识的识流。但是七识本身依赖着心所法才能运作，要有心所法的辅助运行才有七识的功能作用。七识出生后就对所对应的法作意、触、受、想、思，这就是七识的运作过程，其中夹杂着其它心所法。识种子本身是清净的，形成的识流也是清净的，可是心所法参与运行的时候，七识就不一定清净了，因为心所法有不清净的，有染污的，那么七识带着心所法所形成的业种就不一定是清净的了。如来藏里存的是什么样的业种，意根就有什么样的表现，所以意根一定与业种相应。</p><p>如来藏根据业种现行七识，业种染污，七识的心行就染污；业种清净，七识的心行就清净。染污种子成熟了，意根就要现行染污业，染污业又作为种子存进如来藏，而识种子回到如来藏里，仍然是清净的。七识所造作的恶业种缘熟时现行出来，在现报中又生起不善的心行，依不善的心行又去造作不善业，又以这个为因产生了不善的果，业果就是这样周而复始，生死轮回不绝。七识所造作的善恶业种遇缘现行而了，业种虽然消失了，但一切法一切心行都像档案一样永不消失。众生无始劫所经历的越多，这个如来藏存的就越多，历劫生命长河里的东西一点一滴如来藏都存档。如来藏无形无相，如果不是无形无相就储存不了这么多的档案，那么档案也是无形无相的。</p><p>七、如来藏在无余涅槃里心所法是否还存在和运行</p><p>阿罗汉如果还能出无余涅槃，一定是某种业种成熟，如来藏依业种再运作，出生意根，然后意根和如来藏一起投胎出生五阴十八界。业种成熟时，如来藏一定能了知到，业种不成熟时，如来藏也应该能了知到。那么如来藏这个知是什么？</p><p>如来藏依业种运作的时候，是思心所的造作，思心所运行之前，有想心所的运行，想心所就是了别取相，了别业种，取业种成熟与否的相。想心所之前是受心所，接受领纳业种，受心所之前是触心所对业种的触，触之前一定要作意于业种。如来藏在无余涅槃里没有其他什么事，只此一件事可作，就是用五遍行心所法了别业种。</p><p>而如来藏运作这一件事，自身必须存在和不断的运行，才能保证能不断的了别业种。如来藏自身的存在，不断运行，依靠如来藏自身的识种子不断的流注，形成连续不断的如来藏识流，五遍行心所法伴随着如来藏不停止的运行，这就是如来藏相续不断，不生不灭的原理。</p><p>八、如来藏的知和意根的知，内容完全不同。比如意根证得如来藏，知道如来藏时，如来藏却不能证得自己，不知自己。当意根证得色身非我非真实时，如来藏并不能知道色身非真实非如来藏自己。如来藏的思心所所思的内容与意根思心所所思的内容完全不一样，差别很大。所以意根证得的法，如来藏不能证得，意根的抉择决定，如来藏不能作同样的抉择决定，只是配合随顺意根的抉择罢了。</p><p>当意根参究一个法时，什么时候能参究出来，如来藏是不知道的，但是如来藏能了别意根的思心所，了别因缘，了别业种，主要是提供意根所需要的识种子，配合意根思量参究。而具体事相上的事，如来藏都不了知。这是如来藏与七个识的区别。</p><p>九、如来藏本身是无相的，但是祂有运行的行相，有踪迹可寻。这个无相的行相，不需要如来藏变现，因为这样的行相不是如虚妄的五蕴世间法那样的相，比生灭法更虚幻不实，没有实法，所以不用如来藏出生，就像雁过虚空了无痕一般。如来藏本身是真法，真法不需要变现就能显现出来，因此说如来藏不属于内外相分，只要如来藏有所运作，就能被有智慧的第六识发觉，抓住祂无形无相的踪迹。</p><p>如来藏心所法的运作，也是有行相的，转识成智的第六识完全可以现前观察得到如来藏心所法的无形无相的运作方式。我们从物体的摇晃上，完全可以观察出风的势力有多大，风的势力就是无形无相的相，第六识完全可以现前观察得到，但风的行相和势力无须如来藏出生，是风本身所具有的相貌，如来藏出生风时就有了，观察如来藏的运行行相也是如此。观察如来藏心所法的运作，与观察如来藏的运行行相，还是有些微的差别。</p><p>意识观察到如来藏的行相，这个行相不用如来藏变现，因为它既不是假，也不是真，比如说如来藏的真实性与如如性，既不是真，也不是假，也不是实法，实法只有如来藏本体和佛性。</p><p>在阿罗汉的无余涅槃里，像佛那样的无上智慧，都观察不到如来藏的本体，也观察不到如来藏的运作行相。所以说如来藏是无相的，不可见的。其运行的行相也是依如来藏的运作在五蕴的虚妄法上才能显现出来，是附属于如来藏的功能作用，不是实体。</p><p>如来藏运行的行相，不管意识心智慧认知怎样，意识存在不存在，这种相永远存在，是如来藏运作时显现出来的，不是变现出来的，意识没有智慧时就识别不出这种行相。再比如如来藏的心所法的运行，是一种法尘相，不管意识是否存在，不管意识是否有智慧识别，这种法尘相永远存在，不是如来藏变现出来的，是如来藏运作时自己显现出来的。就像人在白天太阳光下行走坐卧，就能有行走坐卧的影子出现，这些影子不是人主观变现出来的，二者的道理相似，但不完全相同。太深细的法，无法讲得太清楚和细致，有观察智慧的人之间能心领神会。</p><p>十、心王、心所是否各有其运行行相</p><p> 心王的运行行相体现在识种子的流注和运行上，心所的运行行相体现在善心所法、恶心所法，还有不善不恶的心所法上，以及五遍行心所法和五别境心所法上，这些心所法不是从识种子带过来的，和识种子不是一体的，各有各的运行行相。但是它们能完美地融合到一起，配合的天衣无缝。</p><p>心王的心所法中，五遍行心所法和五别境心所法的运行，与识种子的运行和流注不好区分，虽然如此，二者也不是一体的，各有各的运行行相。因为心所法是要不断变动的，不仅能够增加和减少，还能变得更完善，它的运行和识种子的运行，还是有一些区别的，这个区别非常不好区分与观察，即使观察出来，语言也不容易表达清楚。</p><p>比如说五别境心所法中的定心所，七识心王能够定下来，出现禅定，这个定能增加，也能减少和消失，定心所是不断变化的。这些变化肯定不是识种子带过来的，识种子的流注是受如来藏支配和决定的，当然如来藏是随意根动转的。定心所法是从另外一个处所来的，比如从业种带过来，随着业种出现。如果心所法与业种混在一起，心所法前后世就有一定的连接性，比如前世修过禅定的人，今世稍微修禅定，定心所就容易出现。心所法虽然和业种有关系，但是心所法没有单独的种子，和前世的身口意行的种子是捆在一起的。</p><p>再比如说胜解心所、念心所、欲心所，每个心所法都会产生变异，心所法不是固定的，能够增加，也能减少，还能产生变异，这个不是从识种子那儿一起出来的，也是和业种有关系，但是又没有单独的业种，这里的内容非常深。</p><p>比如五别境那个慧心所，肯定是随着环境的熏习要不断增加或不断减少，是不断在变异的。可是心王的识种子却不是变异的，识种的本身永远是那样的清净，只不过种子流注的是集中的还是分散的，有这个区别。</p><p>识种子流出来就形成了心王本体，心王本体是清净的，因为识种子是清净的。识种子没有染污性，也没有善与恶性，但与心所法和合在一起，以心所法的形式运行后，识心就有善与恶、不善不恶的心行出现。所以八识心王的心行和心所法的心行其实就是一个，心所法就是心王的心行，八识心王运行起来，是以心所法的形式运行，尤其是以五遍行心所法的形式运行。</p><p>弥勒菩萨的《瑜伽师地论》第一章里讲，五遍行心所法是心王的助伴，心王只要运行，必须以五遍行心所法为助伴，没有五遍行心所法，心王就不能运行，这是《瑜伽师地论》第一卷所说。比如识种子要出生之前，必须要有一个出生的方位，要确定它出生在何处，例如出生在眼见花的花色上，意根确定了这个处所后，识种子就奔胜义根那个花的色尘处出生出来；或者奔向某个声音的处所，在胜义根声尘出现的处所出生，或者在其它意根想要了别的处所出生。所以识种子出生之前有个作意，作意就是有出生的方向，出生的位置，在识种子没有出生之前作意心所法就开始运行。心所法和心王运行的行相就完美的融合在一起，行相应该是完全一致的，表面上体现的都是心所的运行行相，也隐藏着心王识种子流注的运行行相，二者虽然是一致的，却各有各的运行行相。</p><p>还有五遍行心所法最后一个思心所，思心所的作用是抉择决定，最后功能作用就是造作，思心所造作完了，就等于心王造作完了，于是识心在此法上灭去，转移处所，那么心所法在此法上也就消失了。从这个原理上说，心王和心所的运行行相是一致的，它们的运行是扭在一起的，行相是体现在心所法运行的行相上，隐藏着识种子流注的运行行相，它们是不可分开的。</p><p>十一、八识心王的了别，是借助于心所法完成的，没有心所法的运行，八识心王就不能了别，了别就是心所法对识心的辅助作用。比如意识的了别，要通过作意心所法对相分的作意，要有触心所对相分的触，要有想心所的取相执取性，要有受心所的接纳和感受作用，要有慧心所的智慧分别；有的时候要有定心所的专注力，之后意识要有对相分的胜解力，有的时候还要有欲心所和念心所的辅助和引发作用，其中可能还要有善恶心所法的参与作用，使其行为造作具有一定的善恶性。因此说八识心王的了别就是通过各种心所法实现的，没有心所法，识心就无所作为。</p><p>心法必须要依赖心所法才能显现和运行，心法的作用，就是心所法的作用，心所法的作用就是心法的作用，心所法一定要刹那刹那伴随心法，二者不能离开须臾。心法的了别，一个是通过心所法的运行实现的，一个是通过见大种子形成的佛性实现的。</p><p>十二、八识的舍受　　　　　　　　　</p><p>舍受的特征是对境无心，既不感觉苦，也不感觉乐，是一种不苦不乐的心境。八个识都有舍受，第七识舍受的出现，一是因为祂对六尘不能具体和细致的了别，无法觉知到疼痛、酸甜苦辣等等六尘境界，因此心里就没有苦乐受；二是所对的境界不重大，心里也就平静和平淡、没有苦乐受，只有舍受。一旦六识了别到重大而有特别意义的六尘境界，尤其是对自身自我影响和意义都不一般时，意根就有苦乐受，不是舍受了，祂就有情绪，有可能迫使六识表现出自己的苦乐受，如：高兴得手舞足蹈兴高采烈、气得浑身发抖、痛苦得哀嚎大哭等等，都是意根的情绪发泄。</p><p>六识的舍受，与第七识稍微有些区别。六识是直接了别六尘，了别以后，并不觉得六尘有多好和多不好，心境属于中性一些，平和一些，中庸一些，觉得六尘有无都可，六尘不会对自己产生什么影响，既不喜也不厌，也无所希求，这样六识对六尘不感觉苦，也不感觉乐，这就是六识的舍受。</p><p>如来藏也有舍受，但是如来藏的舍受，与前七识又不相同。如来藏的舍受，是因为如来藏面对着六尘境界，不知六尘境界为何物，分别不了境界的好坏美丑，不知善恶是非，不知兴衰利弊，因此如来藏没有什么感受，方便说为舍受。而七识的舍受，是对六尘的受，七识对六尘的时候，既不感兴趣，也不厌恶，是这种舍受，是分别了六尘以后又不具体了别的受。如来藏因为其本身不能分别六尘的好恶是非大小长短方圆，因此自心没有感受，没有情绪，真心和妄心的舍受有这种区别。</p><p>舍受就是对境界既不是喜欢，也不是厌恶，而是觉得无所谓。见六尘也行，不见六尘也行；有六尘也行，没有六尘也行，七识心就是这种感受，这叫作七识的舍受。如来藏这种舍受，是分别不了具体境界的受，不知具体究竟为何物，对境界没有定义和概念，也没有觉观，因此第八识就是平淡无奇的那种舍受。如来藏还有一种舍受，是祂了别相分以后的舍受。祂了别什么呢？了别众生的根身器界，了别业种，了别七识心行，了别七识心行以后，如来藏也不知道七识心行的善恶，不会说七识太清净了，或者认为七识心太污秽了，因此祂就不会对七识生起喜欢和厌恶的感受，祂是完全的舍受，根本不在意七识的心行如何，照样会配合七识的运行。如来藏了别了众生的业种以后，不会说，这个业种很好，那个业种很糟，因此祂就不会喜欢业种，也不会厌弃业种，照样会如实的输出业种，实现众生应有的果报，这就是如来藏的舍受。</p><p>如来藏在记录、收存众生的业种时，不会说，这个业种太糟糕了，记录下来，这个众生将来可就惨了，我就隐瞒不作记录，也不收存了吧。如来藏也不会说，众生造作的这个业行太好了，我可得好好收存，不要丢失了。因此如来藏对于众生的业行，不会生起乐受或者苦受，祂完全是舍受。当如来藏了别了众生的根身器界时，不会说这个根身器界有多好，也不会说这个根身器界太糟糕了，我要给往好点变造。因此，如来藏就不会对根身器界生起苦受和乐受，也是完全的舍受。</p><p>十三、心王与心所，所缘一定是同一个，不可能不同。心所是识心的助伴，是伴随和辅助识心运行的，心所不可能离开识心的所缘境界，而单独去缘其他的境界，这是不可能出现的事情。没有识心，就没有心所，心所不陪伴识心运行，识心就不能有任何作为，那就要灭去。比如一个没有腿的残疾人，只要走路，就用柱扙，离开柱扙就寸步难行。因此不可能说人在一个地方，而柱扙则在另一个地方，二者所在地不同，那这个人要如何走路呢？</p><p>学佛人尽量不要去背诵名人名言，这是世俗人所作的事情，佛教里只要不搞崇拜，佛教发展就会快速，众生智慧就能增长，理论就会越来越完善。崇拜就把智慧卡死了，把佛教卡住了。过去唯识宗的十大论师，还是多少大论师，他们的唯识观点仅仅是他们自己的唯识观点和理念而已，并不保证百分之百都正确无误，因此不可全部照搬。如果都正确，各大论师的观点应该完全一致才对，至少应该没有什么大的差别和出入，可是他们的观点并不一致，争论起来没完没了，究竟谁对谁错，有可能都错，但绝不可能都对。</p><p>任何一位菩萨的智慧都是有限量的，所说不是完全正确无误，不可完全照搬，不可完全随顺。只有佛的智慧才是圆满无漏的，必须百分之百信服和接受。几千年前的唯识理论，不可全部随顺，应该带着疑问来修学。但是极大多数人是不会有智慧生起疑问的，往往都是要全盘接受，如果全盘接受的话，道业就会受阻碍，其错误部分就要流传到后世，贻误后人。</p></div>"
},{
    "title": "第三十二章　如来藏是如何记录业行输出业种的﻿﻿﻿﻿﻿﻿﻿",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十二章　如来藏是如何记录业行输出业种的﻿﻿﻿﻿﻿﻿﻿</strong></p><p>一、意识欺骗他人的行为，如来藏如实记录，即使不是故意欺骗他人，说话不算数，不实现诺言，如来藏都如实记录，将来果报不虚。如果告诉他人说，自己要布施多少钱财，帮助做什么事情，结果并没有做，有心无心做，如来藏都如实记录，都有果报。那么答应他人的事，要翻倍偿还。因为答应要做的事，如来藏马上记录，业种存下，钱财就换新主人了，所有权归新主人，不管钱财在谁的手里。如果不按照自己答应的事去做，就是欠人家的，将来连本带利一起还。口说出去的话，就像泼出去的水，说把钱布施给人家，就已经属于人家的了，至于钱在谁手里，那不重要。有心做是意根想做，意识也想做，无心做是意识口头说说而已，意根不想做，这就有点欺骗人的意思了。</p><p>很多人就愿意不负责任的许诺，意识像是说着玩似的，为了博得他人欢心，不够真诚，结果人家是欢心了，事没给人家办，那么将来翻倍还。有些人还故意欺骗父母，总是许诺父母很多事，可是从来都不实现，将来的果报，一是需要偿还更多倍，二是也被人同样的欺骗，到时也很苦恼。</p><p>我们应该记住一个最重要的事：说话的当时，意识的心行和意根的心行，如来藏都要刹那刹那存档作记录，档案是要建立的，我们就要为这个档案负责任，不可能是说话等于没说一样。如果你说给人家一元钱，那么一元钱就是人家的了，钱可以暂时放在你手里，但是所有权已经不是你的了，你就没资格使用。如果不给人家这一元钱，那么将来还人家至少一千元。前提，这个人是普通人，如果不是普通人，那就更翻倍。</p><p>如果能现前观察如来藏的运作，一言一行自己都会小心，不敢轻易造作，意根想做的，意识才说，说了就要实现，意根不想做的，意识就不要骗人。无知者才无畏，什么话都敢说，什么事都敢作，胆大包天，这种人非常多，学佛人也不少，并不比不学佛人好到哪里去。</p><p>当你对他人说话和承诺的时候，两个人的如来藏同时记录存档，两份档案，将来都要翻开对账。如果对他人造了恶业要忏悔，就要在那人面前忏悔，两个人的如来藏重新记录存档，让两份业种都消失。如果那个人不在面前，忏悔也有一部分作用，作用不是最大最好的。</p><p>当有人在自己面前许诺时，你可以不动声色，当他以后根本不再提这个诺言时，你照样不作声色，为了将来大丰收，要带高额利息的，连本带利一起收。如果是被人逼迫许诺，不是真心许诺，不是从内心深处情愿许诺，意根不真正同意，不真正认可，业就轻微不严重，果报也轻微。总结起来说：坏事不要诚心去做，好事一定要诚心去做，将来的果报不可思议。</p><p>二、很多人都不知道如来藏能够在自己身口意造作的同时，就记录和收存了自己的所有业行，缘熟时如来藏就会根据自己的业行输出业种，自己就会得到相应的果报。因为不知此理，就怀着侥幸的心理妄造恶业，以为不会真有什么果报。有一些人虽然知道如来藏能记录和收存业种，但是也不知道如来藏当时就做了所有的记录，一丝也没有遗漏，于是迷迷糊糊地知道有因果，但还是不知道如来藏是如此细密地记录了所有的业行，于是就有一些心存侥幸的心理，在身口意上仍然要造作一些恶行，以为能躲得过因果，可是最终没有一个因果能躲得过去。</p><p>那么如来藏究竟是如何记录收存业种，祂又是如何输出业种，来实现众生的因缘果报的呢？这个问题很重要，有必要讲一讲，让大家都清楚，之后就能小心自己的身口意行，少受恶报，少吃亏。</p><p>如来藏记录、收存业种，然后再输出业种，这一切都是如来藏的法尔如是的功能作用，祂本来就具备这样的功能，祂是任运而为的。什么叫任运而为呢？祂自己会随着七识的运转而运转，会随着六识的身口意行而运转，运转的同时随时随地就记录了六识的身口意行，记录了第七识的心行，这些心行就作为种子存储在如来藏的心体里。而如来藏在这其中，没有自己的任何心行。没有心行的意思，就是说祂没有一个选择性，祂没有自己的观点、意见和看法，毫无选择地就把六识造作的身口意行作为种子存了起来。</p><p>祂没有能力去分别这个是善的，那个是恶的，这个有是非，有对有错的，祂不会生起喜厌的心行去作任何一种分别和选择。祂把一切法全部是任运而为地存储到自己的心体当中，祂没有心行没有思想的就做了这些事。就是说，祂不是有为的去做，不是参与了自己的观点、意见、看法去做；祂不是有为的主动的造作，祂是法尔如是的，就这样运行下来了。祂所存的种子，就是六识的身口意造作的业行，这个业行造作的同时，就作为无有行相的种子，任运而自然的就存到如来藏心体里。如来藏也不是主动的要作记录，也不是主动的去存储种子，祂没有主观能动性，祂做一切都不是主动的，而是任运的，被动随缘的去做这个记录和存储工作，这就是祂本身所具备的功能体性，不是有心去做，这称为没有心行。因为祂不分善，不分恶，不管是非与对错，这说明祂就是一种无记性，无记性就是其心行没有善性也没有恶性，行为造作不属于善业，也不属于恶业，所以如来藏是无记的。</p><p>三、如来藏是如何记录和收存业种的呢？那就要看如来藏在这六识的身口意行当中都做了什么。如来藏因为有七大种子，其中一个就是识种子，如来藏有识种子，识种子分成七个识的识种子。祂能同时分别为这七个识输送各自的识种子，输送出来以后，这七个识现行出来，就能运作了。七识的运作是靠五遍行心所法和五别境心所法运作，还有贪嗔痴等等烦恼心所法的运行。比如说六识在运行当中不仅有五遍行心所法；有时还有五别境心所法；还有一些善十一心所法，虽然有时候善十一心所法不具足现行；还有些贪嗔痴这些烦恼心所法，都会现行出来。</p><p>第七识意根也是如此，祂除了五遍行心所法，还有其它的烦恼心所法，比如贪嗔痴慢疑等等。七个识一运行出来，相应的心所法就会表现出来，识心是以心所法的形式来运行的。而心所法有清净的，有染污的，有不属于清净和染污的，有时都要现行出来。识种子一生出来，七识就能运行了，而且是刹那生、刹那灭。生，是从如来藏里生出来，识种子灭了，它会灭到哪里去呢？如果这个种子灭了，就等于自然而然的消失了，那么如来藏当中会有多少识种子不断地生出来，而不会流失殆尽呢？那些个识种子生了就灭，生了就灭，如来藏里面是不是要不断地在产生识种子呢？不是这样的，再也没有产生识种子的法存在了。</p><p>识种子是本来就存在如来藏里的，是不生不灭的。没有出生识种子的法，识种子就是法尔如是的存在如来藏里的，其数量虽然是非常非常的多，但总数量是固定的。既然数量是固定的，那么识种子出生以后灭了，灭到哪里去了？灭了以后又回到了如来藏里。这样如来藏当中的识种子的数量就是固定的，不断的生出来，又回去，输出去又回来，输出去又回来，数量就是不变的。</p><p>如来藏总是用这么多数量的种子来产生七识，识种子输送出来，就形成了七识的心行活动。七识的心行产生出来，就分为染污的、清净的和无记性的。如果心所法是染污的，七识就造作染污的业行，心所法是清净的，七识就造作清净的业行。而识种子一回到如来藏当中，就把七识心所造作的心行以及所了别的内容，全部带回到如来藏当中，这叫作如来藏法尔如是的记录，法尔如是地存储众生的身口意行，将来再法尔如是地输出业种，法尔如是地实现众生的因缘果报。</p><p>而这一切都不是如来藏主动的记录，不是主动的存储，也不是主动的要输出业种。如来藏没有这些心行，祂是无为法，无为的心行不会主动和有打算的去造作什么，都是祂法尔如是的功能体性，祂本来的工作就是这样，祂存在的作用也就是这样。不是说祂有什么心行，我一定要记录众生的业行，而且要分善分恶，祂没有这样的心行。祂输出识种子，了别、造作业行之后，识种子又回去。回到如来藏当中的时候，随即就把七识的心行、了别的内容、造作的行为，也带到如来藏里，就作为业种子存储起来了。但是业种子与识种子不在一起，不是同类，一个不生不灭，一个是生灭的；一个是清净的，一个是染污的。</p><p>这样，如来藏就把七识了别的内容，七识的心行，也存储起来。如果心行是善的，就作为善种子存到如来藏里；如果心行是恶的，这个身口意行就作为恶业种子存到如来藏里；心行如果是不善不恶，身口意行就作为无记业存在如来藏里。这就是如来藏记录、存储七个识业行的运作，众生的身口意行就是这样被记录下来的。</p><p>身口意行造作的同时，一点一点的在记录着，一点一点地在存储着。识种子是连续的输出也连续不断地回到如来藏中，这样记录、存储的内容就形成了一个事件。这个事件完成了，就作为整个的一个业种收存了。如来藏是一点一点一点的记录，一点一点一点的收存，最后形成一个总的业行、业种。在这当中，一丁点的心行都没有丢失过，最微细的心行如来藏都没有遗漏过。为什么呢？因为所有的识种子都是连续不断的，一个一个的回到如来藏中，七识了别一点存一点，了别一点存一点，最后，了别的内容连续起来，就是整个事件。</p><p>这整个事件是善的，是恶的，还是无记的，都作为种子存下来。这些心行和业行，如来藏是不会有一点点改变和变动的。如来藏也不会作任何选择，不会说这个业行记录，那个业行不记录，祂没有选择性，种子都回去了，都回去就都收藏到库房里。输出的识种子回来以后，再把了别的内容及造作的内容带回来，全部作为业种子存到这个库房里。存到库房里以后，等到将来遇缘时，如来藏再从库房里把这些业种子输出去。</p><p>具体用水泵作比喻，来说明如来藏输出识种子和收回识种子的整个过程。水泵输出的是循环水，所谓循环水，就是水出去了还会回到水泵当中，然后再输送出去。如来藏好比是水泵，如来藏输出的识种子犹如水滴，水泵能把水一滴一滴的输送出去，形成水流，水流相当于如来藏输出种子形成的识流。水泵把水输出去以后，水流所经过的路线就把周围的泥土、沙尘、草木、珍珠等等物质都带回来，水流经过的地方，会把那些地方的杂物带回来，因为水泵是循环水。</p><p>如果水泵里有杂物，就会顺便把杂物也一起带出去，有金刚砂就带出金刚砂，有泥土就带出泥土，有杂草就带出去杂草。然后水流在一路上所经过的路线，还会顺路把一些杂物又带回到水泵当中。这样水就不是输送出去的原来的水，而是带着杂物的水，这些物品也许是脏物，也许是清净的宝物，其中有泥土，有尘沙，还有一些水草之类的东西；也许还带着什么金刚沙、珠宝之类的宝物。水流所经过的路线相当于六尘境界，水流就相当于身口意行，六识了别六尘境界时，所发生的身口意行也都带回来，有染污的业行和清净的业行。</p><p>水泵里存储的是些什么东西呢？存储的不仅有水，还有水这一路上所带过来的所有的杂物，不管是脏物也好，清净物也好，金刚沙珠宝也好，石土泥沙也好，全部都带回来。带回来的东西越多，将来随着水输出的就越多。水泵里存多了存满了，就容易输出去，带的东西越多，缘越容易成熟，水泵越容易把这些杂物输送出去。如果带的金刚沙多，缘成熟了，水泵在输出水的时候，水就带着金刚沙被输送出去，带着宝贝的水流是很珍贵的。</p><p>如果水流在一路上带的泥土、沙尘比较多，存储到水泵里，水泵在输送水的时候，也会把泥土、沙尘、石块或者是杂草这些杂物也一起输送出去，这样的水，就叫作污水，相当于识心的恶业，这个过程叫循环。输送出去以后，水流再回来，这一路上带回来的东西可能还不一样，也许又带回金刚沙，也许又带回沙土，也许又带回其它的东西，也许把金刚沙甩掉了，也许把泥土甩掉了，这都不一定。</p><p>同理，如来藏输出识种子，出生七识，就会有身口意行的造作，六识身口意行所造作的善恶业是不一定的，随时随地会发生变化。造作什么样的身口意行，一个是要看所遇的缘是什么，就是周遭的环境，这就相当于水流经过的区域；一个是要看如来藏输出的业种是什么，相当于水泵输出的水质。而六识的身口意行所造作的内容，要作为种子存到如来藏里。这相当于水泵把水输送出去以后，这一路上水流里发生的变化，它的含容物、所裹挟的内容物又会回到水泵里，水里的含容物可能要发生变化。内容物不一样时，水也许更浑浊，也许变得更清凉，那都不一定，就看这一路上所经过的区域是什么，遇到了什么物质，让水流给裹挟过来，一起带回水泵里。</p><p>而原来水里带出去的杂物，可能会因为有阻力而被卡住，没有被带回水泵里。这些杂物也许是珠宝，也许是沙土烂草。这说明身口意造作的时候，善恶性也是不一定的，在于遇到什么样的境缘。如果遇到的是恶缘，输送出来的识种子，虽然是清净的，但是还会造作恶业。识流就会把这个恶业一点一点的带回到如来藏当中，最后形成一个完整的业行，作为种子存储下来。也许如来藏输送出来的是染污的种子，可是遇到的是善缘，六识的身口意造作的可能是善业，善业就随着识心的流动一起被带回到如来藏里存储起来，如来藏里的种子就发生变化了。</p><p>那么如来藏是不是如实记录了众生造作的业行呢？祂一点都不含糊，一点遮蔽隐藏的都没有，一点选择性都没有。如来藏即使有心行想选择，也没办法选择，识种子就像水流一样，刹那刹那回到如来藏里，所有了别造作的内容，全部带进来收存了，没办法选择，祂没有过滤器，况且也没有那个心行，如来藏什么都不分别。</p><p>这样，七识的心行，六识的心行，身口意的造作，全部点滴不漏地存到如来藏里。如来藏里存的业种越多越重大，业种越容易成熟。同样的业行存的越多越深刻，缘越容易成熟。比如贪的业越大，贪的业行越容易现行；嗔的业越大，嗔的业行越容易现行；清净的心行越大，清净的业种越容易输送出来。好比积聚物越多，越容易流露出来。</p><p>整个身口意的造作，清净和染污的业行存下来以后，业缘成熟了，如来藏再把这七个识的识种子输出去，同时还可能把业种一起输出去，善、恶和不属善也不属恶的无记性的业种都被输送出去，之后七识开始运行，识心就有了清净性和染污性。六识造作的身口意行也许是清净的，也许是不清净、染污的，也许是不善不恶无记性的，那就不一定了。</p><p>这里还涉及到六识造作的心行熏染意根，意根的改变再熏染六识的情况。在这身口意行造作当中，六识遇到一定的环境，也许会受熏变得清净，也许会受熏变得染污。不管是变得清净还是变得染污，六识都会来熏染意根，都可能会改变意根。因为六识了别思惟的内容信息刹那刹那传递给意根，意根依此信息再生起思心所，来思量这些法，那就有可能受到熏染。其中意根的心行也会熏染六识，因为六识是要按照意根的指令而现行的，其心行要遵从意根的心行。身口意造作的一切行为，包括第七识意根本身的所有心行都会作为种子存下来。</p><p>种子存下来以后，就作为意根的习气种子，意根就带有相应的习气。六识的种子输送出来时，六识现行出来，一方面要符合意根的心行，因为意根是作主识，主导六识的身口意行；一方面会遇到新的环境，会受环境的熏染。就像水流过一个区域，有可能把这个区域周围的杂物也带着混到一起，水就会受到熏染一样。六识遇到的环境不一样，身口意的造作可能就不一样了，六识受到熏染以后，会反过来熏意根。</p><p>比如六识，原来心行是染污的，现在忽然间遇到佛法，就学佛修行了。学了佛法以后，懂了因果，就知道什么应该做，什么不应该做。然后意识要把自己所明得的理，传递给意根，让意根也明白，这样就熏了意根。六识学佛的身口意行就作为种子存到如来藏里，意根如果受熏了，其心行也作为种子存在如来藏里。如来藏再把种子输送出来，身口意行就符合佛理，这样就把意根熏染了，意根的心行就改变了。</p><p>在这当中，一切身口意行，意根起着决定作用，如来藏存储身口意行的业种，意根是如来藏和六识联系的纽带或中转站，如来藏存储业种和输送业种，意根都是一个很重要的枢纽。因为意根对具体六尘的了别慧比较劣，对六尘不能做具体的了别，六识具体了别的内容刹那刹那都要传给意根，这样意根就了别了六识所了别的内容，然后意根就生起思心所，决定要如何的造作。这些决定，也许是按照意根自己的习气惯性而做出的，也许是按照六识的思惟分析而做决定，这是不一定的。</p><p>意根也许是随顺于习气，也许按照六识新熏的内容、新了别的信息和意识的思惟判断来作抉择。是自己的习气起主导作用，还是六识的思惟判断起主导作用，那就不一定了。意根思量做了抉择以后，如来藏了别到祂的心行，就会生出六识，按照意根思量的内容，按照意根的心行来生起身口意行的造作。身口意行如何造作，意根的思量抉择是很关键的。</p><p>而意根了别完六识所了别的信息以后，祂如何思量，如何抉择，起什么心行，心行是染污的还是清净的，如来藏也会如实的做记录，存储心行的种子。如来藏也把意根的心行，所有的心行，不管是善的恶的，都带回到如来藏当中，作为种子存起来。意根的心行是什么呢？一个是自己原来的习气，再一个是六识所了别的内容对意根的影响，也就是说六识身口意的造作，也会通过意根存储到如来藏当中。其中在这个身口意行当中六识是什么心行，如来藏就记录存储什么心行；第七识意根是什么心行，如来藏就记录存储什么心行，相当的如实，一点也没有遗漏，而且是刹那刹那的同时存储，一点环节都没有遗漏过，都存储下来以后，整个事件就作为业种存起来了。</p><p>比如说，我和某一个人在谈话，在谈话当中，我的意根的心行是清净的还是染污的，都会作为种子存到如来藏里。我的前六识了别的所有内容，所有的造作，所有的心行，是带着贪，还是还带着嗔的，还是属于无记不善不恶的心行，都会作为种子存到如来藏里。因为识种子是刹那刹那地回到如来藏里，连带着了别的内容，所有的心行，也全部存到如来藏里。</p><p>与这个人谈话结束以后，整个事件，整个过程，就毫无遗漏地全部存下来，最后做一个总的存储。我和这个人谈话的整个事件，具体的心行表现是什么，包括时间、地点、心理的表现、面部的表情，用什么语言等等，全部的过程细节，如来藏全部存储，存储了以后就是业种了，业种成熟以后，就有果报。如果存储的越深刻，所谓越深刻就是六识越用心，七识越用心，越感兴趣或越憎恨，那么存储的业行就越清晰，越明显，业果就越容易成熟。</p><p>当业缘成熟时，如来藏就把这个业种输送出来，再遇到这个人时，我和这个人因为从前的关系，那么见面时表现就不一样了，就带着从前的心行出来。原来是憎恶的心理，遇到这个人就讨厌；原来是喜欢的，再遇到这个人，心就带着一种喜欢的心理，就会喜欢这个人，心行就会完全地表现出来。我与这个人见面时的身口意行，就与从前存的业种有关系，与意根的心行有关系。</p><p>识种子从输出到收回，就像循环水泵似的。如来藏记录业种、收存业种、输出业种的整个过程，就是如来藏任运而为的过程，祂没有心行、没有主观，完全是无为的。说是有为，表面上如来藏一直在运行着，一直在生成一切法，可是实际上祂都是任运而为，没有主观能动性，没有作主性，都是无为性的心行。因为祂没有心行，没有选择，不了别善和恶，也不拣择善和恶，无论善业和恶业，祂一律收存。祂收存业种也不是主动收存，而是识种子输送出去，了别了六尘，造作了身口意行以后，识种子就会自然的把造作了别的内容带回来，把身口意行整个业行都给带回来。</p><p>其中的心行，贪嗔痴性和清净性的心行都带回来了，自然而然的法尔如是地就做了存储。不是如来藏主动去存储，主动去收存的，而是法尔如是，自然而然的，本来如此的一个过程，整个过程点滴不漏的都收存了。什么叫点滴不漏？每个识种了别的内容都会收回来，一点点的遗漏都没有，这叫点滴不漏。并不是如来藏自己要一点也不漏，或者是有意漏点，都不是，而是识种子自然而然带回来了，祂没办法作任何一种选择，也不会去作选择。六识的身口意行造作出来了，如来藏就没有一点选择性，没有说存与不存，没有说存什么不存什么的选择，根本就没有。</p><p>所以我们身口意行的造作，一定要小心谨慎，造作的不管是善还是恶，哪怕是一丁点善和一丁点恶，都作为种子存储起来，将来就有输出种子受果报的那一天。因为识种子会回到如来藏里，心行就要如实的带到如来藏里。就像水流这一路上经过了什么地方，冲刷了什么，就把什么东西带回来一样，自然而然就是如此。如来藏也不会做选择，就自然而然的存进来，然后水泵自然而然把带回来的那些东西，不管是金刚沙也好，沙土也好，都收存下来，然后再输送出去。</p><p>水泵把水输送出去以后，肯定要把金刚沙带出去，要把沙土、泥土、烂草之类的东西带出去，从水泵里和水一起输送出去。输送出去的水就分为清净的和染污的。我们身口意行也是这样，如来藏把收存的业种输送出去的时候，肯定带着清净性和染污性，业种本身就分为善恶和染污的。我们六识的身口意或者第七识意根的心行，就带着善恶性，带着清净和染污性，然后再造作，再存储。如果都造作恶业，众生就没办法脱离生死轮回的苦海了。</p><p>如果我们的业缘比较好，有一定的福德，就会遇到善缘，身口意就会随着造作善业，同时再熏染意根，转换意根的染污性，种子就会得到汰换，心地就会逐渐清净下来，将来就会得到善报。六识遇到一个好的缘分，遇到清净的外部环境，就像水泵把水输送到有金刚沙的地方，有珠宝的地方，水流就会裹带一些金刚砂和珠宝回来，把沙土和烂草撇掉一些，水里的内容物就发生转变。我们的六识遇到一个清净的环境，善的境界，就会造作清净的、善的业行，识种子就会把清净的、善的业行带回到如来藏里存下来，将来就会得善报。</p><p>如果没有善缘，六识遇到的环境不好，境界不善，我们六识也许会随着恶的环境，而造作贪嗔痴的恶行，恶业就会被记录存储，将来就会输出，受到恶果报。就像水流再把那些沙土、肮脏物带回来，肮脏物就会越来越多地存储到水泵里，再输出的时候，都是脏物，都是污染。我们身口意行的造作如果越来越染污，业种都存储在如来藏里，输送出来全都是染污，只有受恶报的结果，不会有善报，那么在生死轮回中，就会活得相当痛苦。</p><p>我们了知了如来藏记录、收存、输出业种的整个过程，就要对身口意行小心的造作。如果我们的心行具有贪嗔痴烦恼，非常恶劣的，就要作为恶业种子存下来，缘熟就要受恶报，受染污的果报。嗔有嗔的果报，贪有贪的果报，愚痴有愚痴的果报，只要造作了业行都会有相应的果报。业因果报是丝毫没有遗漏的，因为一切行为造作全都存在如来藏里，祂早晚有一天都会给输送出来的，不可能永远存在如来藏里，输送出来时，就是受恶报之时。</p><p>所以说，我们身口意行造作的时候，一定要小心又小心，谨慎又谨慎。身体造作什么，一定要慎思；口要说什么，一定要慎思；心里要想什么，一定要慎思。不要随便不注意地就造作不好的身口意行，给自己带来不好的果报，那样得不偿失。即使遇到不可意的恶劣的境界，我们也要尽量忍耐下来，仔细思惟，小心行事，不随恶劣的境界而转，把持好自心，不造作恶行。等意根被善缘熏染到一定程度，再遇到任何恶的境界，也能不造作恶业行，那时就好了。</p></div>"
},{
    "title": "第三十三章　参禅与证悟1",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十三章　参禅与证悟</strong></p><p>一、如何证得自性如来藏</p><p>学佛要想证得自性如来藏，明心见性，成为真正的菩萨，就要修菩萨所修的法，菩萨修什么法呢？菩萨就要修六度波罗蜜和菩萨四摄法，六度波罗蜜就是布施波罗蜜、持戒波罗蜜、忍辱波罗蜜、精进波罗蜜、禅定波罗蜜、般若波罗蜜；菩萨的四摄法是布施、爱语、利乐、同行。作为菩萨一定要先修布施波罗蜜，布施一方面能与众生结善缘，让众生信受我们，跟我们一起学佛修行，就会成为我们度化的弟子，我们才能够带着与自己有缘的大众，不断地在菩萨道上迈进，将来我们成佛时，这些众生都在佛国土里精进护持佛法，所以布施很重要。布施的另一方面能快速地积累福德，福德具足，才能保证道业不断增进，最终才能明心见性，入到佛门里。</p><p>六度波罗蜜的第二条是持戒，因为持戒心能清静，持戒不犯就不受恶业果报，也不会有恶业拖累和障碍道业的增进，不受生死轮回苦。因为持戒心得清静，才能有禅定的出现，有了禅定才能观行，才能参禅，才能明心证得如来藏，所以持戒也很重要。如果一个菩萨还不能持戒，说明他的性障烦恼还很重，离真正菩萨的标准还很远。要想当一个真正的菩萨，一定要持戒，一开始由严格约束自己守戒，到后来自动自觉持戒、守戒，再最后就达到无戒可持。因为他的心已经清净下来，没有犯戒的心行，一切的行为造作都与自性清净心相应，这个时候不用再主观的持戒，时时处处身口意行都合乎戒律，不越矩，符合佛法，这是不持而持的持戒。</p><p>六度第三条是忍辱波罗蜜，修忍辱行也能使心得清净，从而降伏自己的性障，与众生结善缘，化解恶缘，虽然众生带给我们很多辱境，如果能忍伏下来，不回报于众生，不嗔恨于众生，就和众生化解了冤仇，自己的性障烦恼也能够得到降伏，与真正的菩萨心性相应。忍辱的另一方面是于闻所未闻法生忍，于甚深法生忍，于未证法生忍，这样智慧才能得以提升，道业才能不断地进步，才能尽快的得证甚深法。</p><p>六度第四条是精进波罗蜜，作为菩萨一定要在佛法上精进修行，不能懈怠，在各个方面都要精进。在布施度上精进，在修福德与众生结善缘上精进，在持戒上也精进，在忍辱上也要精进，在修禅定上也要精进，在修自己的般若智慧方面也要精进，时时处处精进，善法就会得以快速的增长，这是菩萨第四度精进度的修行。</p><p>第五度是禅定波罗蜜，菩萨心一定要有定，这个定一方面是指四禅八定，有四禅八定的功夫，尤其是初禅定和初禅之前未到地定，必须要修持出来，在这两种定中才能很好的做观行，有观行能力才能参禅，进而实证，由定而出生佛法的大智慧，定也能生福，叫定福。定的另一方面是指心定，心得决定，对于甚深大乘般若实相法，心已得决定，不可移转，确信不疑般若经典是走向成佛之道的重要法宝，从而精进修持。</p><p>菩萨六度最后一度就是般若波罗蜜，菩萨一定要修般若智慧，所谓般若就是指自性清净心如来藏，祂是不生不灭的，般若经典就是六百卷《大般若经》，主讲般若实相心如来藏的体性，以《心经》《金刚经》等经典为主，宣说般若心体的殊胜功德，引导众生悟入实相，开启大智慧。这些经典菩萨们要修习，要理解，理解了以后在禅定中参证，时节因缘具足时，就能证得般若心体如来藏，从而获得般若大智慧。</p><p>作为菩萨主要是修这六波罗蜜，最后一条般若智慧是最重要的，我们现在都在熏修般若智慧，熏修如来藏法。每个菩萨熏修的时劫不同，证悟的快慢就有所不同，因为我们历劫以来，都非常执着五阴的假相，执着十八界的假相，把虚妄法都当作真实的，于是就遮蔽了真实之心相，我们只能认假相，不认真实法。</p><p>因此很多菩萨就要先修小乘法《阿含经》，先求断我见，成为初果、二果、三果、四果以后，内心把假相都一一排除掉，然后就在假相里寻找真相，断我见以后就容易找到那颗不生不灭、常放光明的摩尼宝珠。在没断我见之前，就容易把五阴中的某些法当作明珠，真正的自性如来藏这颗明珠就不容易找得到，因为混在一起不容易区分，等我们把五阴十八界都排除掉以后，就容易证得自性清静心如来藏，这样明心也就很快了。</p><p>二、修足菩萨六度才能证悟</p><p>世尊拈花微笑的公案里，世尊拈花微笑，迦叶顿悟。迦叶顿悟时不是明白了花是生灭幻化的假的，而是顿悟了如来藏，找到了佛的无垢识在佛身上的运作行相，他就明心开悟了。公案是引导开悟明心证得如来藏的。至于佛拿的花以及万法都是如来藏幻化出来的，是生灭幻化的假象，但是从这些假象当中，我们可以悟得一个真相，把那个真相找出来就明心开悟了。</p><p>要想开悟，证得如来藏真心，要怎样修行？要修行菩萨六度：布施，持戒、忍辱、精进、禅定、智慧。布施就是修福，我们得在大乘佛法里种福，福德积累够了才能成为明心见性的菩萨，所以福德是必须要修的。没有福德也不可能获得禅定和智慧，福德是修行一切法的基础。布施之后要持戒，因为持戒能够摄心，让心不散乱，持戒心就清净，不造作恶业；心清净以后就能生定，定力生起来，就能住于定境当中思惟佛法、观行佛法，这样才能够把佛法参究出来，就能证果和明心见性。</p><p>明心见性还需要什么条件？需要般若智慧，要懂得如来藏的体性，才能知道在五阴万法的运作上如何寻找如来藏；需要把般若的体性，如来藏的体性弄清楚，然后在五阴万法的运行上证悟如来藏，因此需要我们把五阴运行的脉胳弄清楚，清楚五阴是如何运作的。这样五阴搞清楚了，如来藏搞清楚了，六个识七个识搞清楚了，在禅定的状态下，在识心的运作上、在五阴上参究如来藏，因缘具足就能够证得如来藏了。</p><p>布施、持戒、忍辱、精进、禅定，般若智慧，这些条件具足了，就能明心见性。佛法已经给我们指明了道路方向，只差自己实际去修行了。修行修什么？修布施修福德、修精进行、修禅定、修般若智慧，修忍辱改变心行，这些内容修好了，就能开悟。</p><p>三、阿罗汉和缘觉佛们都把三界世俗法放下了，放得再彻底也没有了，仍然没有悟得自性清净心。他们在行住坐卧的四威仪中，时刻不起念想。眼看色时，眼识接触到色，就停住，不往下进行了，不再产生受想行等身口意的行为，更不去分别这个色，不起心动念，其它几个根也是这样。六根对六尘只是接触就移开，保持心的清净，有谁比他们更有修行，然而他们只能得个小乘的涅槃。而菩萨们不怕六尘境界，很清楚六尘都是自心所变的幻化相，根本不去执著。该用六尘时照样用，可是六尘根本侵扰不了菩萨的心。</p><p>所以要想悟道究竟成佛，就要修菩萨的法。修菩萨六度，具备福德，守持戒律，精进修般若智慧，有相应的定力参话头，才能悟得那个心，这是最正道和根本的修行。</p><p>百尺竿头的意思是说还在竿子上，在世间法的顶上，这是落在一无所有的空上了，还不究竟，还需要进一步找到五阴世间背后的实质的东西，能够支撑和凸显五阴世间虚幻存在的东西。有的人内心里没有念想，就认为是空了，但这不是实相境界，是一种定境，还有一个真实的有，不生不灭的，能产生万法的，要去证得祂。那就需要在百尺竿头上，再往上更进一步，这样就证得了那个真实有的空性心了，就从空落到了有。本来无一物，就是在百尺竿头，后来悟得了应无所住的心，才知道这个心不空，能产生万法，这才是证实相。</p><p>四、第六识如何才算是证得如来藏</p><p> 第六识有见分，就是第六识的知性、觉性，见分能够感知到一切法，了知到一切法，这些法包括色法和心法。第六识的相分，就是第六识能够知和觉的对象，只要能被第六识觉知观察到的法，都是第六识的相分。第六识知和觉的对象，包括六尘色声香味触法和七个识的心法和心所；除此，第六识也能够觉知到如来藏以及心所法，那必须是在第六识找到证得如来藏以后，证得如来藏就是明心证悟了。</p><p>第六识在有般若智慧之时，能够证得如来藏，也能够觉悟如来藏，能够找到如来藏，能够观察如来藏，如来藏就可以是第六识的相分。但是如来藏祂本身却没有一个形和相，也没有色彩，来让眼识、让耳识、让鼻识去感知祂，只能由第六识来觉察到、觉悟到如来藏的运行行相，在祂运行的法相上来证得如来藏。</p><p>虽然如来藏的运行法相也是无形无相的，但是第六识能够觉知到、领悟到。第六识察觉到如来藏以及祂的运作，是有很多前提条件的，这些条件不具足，第六识就不能感知到如来藏，不能觉知到如来藏的运作。那些菩萨条件具足了之后，第六识是如何觉知到如来藏的运作呢？怎样才能算是证得、找到如来藏呢？</p><p>证得和找到如来藏，不是在眼识见祂的色彩色相上，不是在耳识听到如来藏的声音上，因为如来藏没有色彩，没有形相，没有声音。但是如来藏还是有运行的法相，祂无始劫以来一直在不停息地运作着，那么祂就有运行的相能够被意识心所了别到，无形无相的法相也能被识别出来。就是说如来藏有运作的行相和法相。</p><p>这里用个比喻来说明如来藏的运作，然后就能知道如何去证得如来藏。可以把如来藏比作风，这个风不管是大风、小风还是微风，都没有任何形相，但是我们这个第六识心，还是能够知道有风吹过来了。这个风既然无形无相，我们的眼睛肯定看不见，虽然大风刮起来有声音，但是耳识听不到风本身的声音，风本身是没有声音的，我们听到的声音不是风的声音，而是风与物或者是虚空中的气体相接触撞击所发出来的声音，风的势力越大，碰到物体发出的声音越大，因为有冲击力和撞击力。但是意识知道有风吹过来，仍然需要眼识耳识鼻识身识的共同运作，才能知道有风了；同理找到如来藏虽然是意识的发现，但是也离不开眼识耳识鼻识舌识和身识的密切配合，需要意识在五尘六尘上六个识和合运作找到如来藏，实际上是八个识和合运作证得了如来藏。</p><p>那第六识要想知道有没有风，是不是风刮过来了，是多大的风，第六识要从哪些方面来观察了知？那就从风所起的作用上来观察。风能起什么作用？风的势力不同，所起的作用不同，带来的影响和物体的状态就不同。那大风起的作用是，大风一来了，大树都会摇晃起来，再严重一些，树倒屋塌，大风就起这个冲击和毁坏的作用，它能够吹折一切。大风吹过来时，甚至房屋就能被吹倒塌了，树也能被吹倒连根拔起，或者把一些物品给吹飞上天，从这些相上，第六识心就能知道，这是暴风刮来了，就证得了暴风。所谓证得风，不是见到了风，而是见到了风所起的作用。那小风吹过来，只是树叶摇摇晃晃，树枝摇摇摆摆，小草晃晃动动，风的作用比较小，意识心就知道这是小风，这样就证得了小风。这个证得也不是看见了风的形相，不是听到了风的声音，而是从风所起的作用上，来证得和找到了这个风。</p><p>从风与物体撞击所发出的声音上也能知道风，知道风的大小，这也是证得风。虽然风刮到树枝上，或者刮到吹到各种物体上，会出现各种各样的声音，物体不同，发出的声音就不同。那就说明这些声音不是风本身所发出来的，如果是风所发出来的声音，风如果有声音，那我们听到的声音应该都是一样的。可是风吹到各种物体上，祂所发出来的声音都是不一样的。可见这个声音不是风所发出来的，而是风吹到物体上，风与物体和合运作，互相接触撞击到一起，所产生出来的声音。实际上，不管是刮风，还是风与物体的撞击，还是风声，都是如来藏的作用。《楞严经》里讲都是如来藏性，都是如来藏所起的作用，其实都是如来藏性，这里暂时先不说。</p><p>微风也有微风所起的作用，比如说我们拿个扇子来扇，风产生出来时，我们看不见摸不着，也听不到，但是我们能感觉到清凉凉爽，薄薄的衣服会有浮动现象，我们就知道有微风吹过来了，这就在微风所起的作用上证得了微风。一个是凉爽的感受，再一个是能产生物体微微的动相，从这些方面我们就找到和证得了微风。那大风小风，各个不同的风，都要从风运作过程中所产生出来的形相上来识别、认取、了知、觉知到风。</p><p>如来藏也类似于风，也是无形无相的，那么我们就不能从色相上来看见祂，不能从声音上，不能从嗅觉上、味觉上，不能从触觉上，来证得找到如来藏。只能用意识心来观察、捕捉如来藏祂所起的那些利用，当然这种观察必须要与五识一起观察。当我们般若智慧打开时，在五蕴运作起来的时候就能发现其中的秘密了，知道如此如此之作用，就是如来藏所起的作用，而且要把与五蕴本身的虚妄作用区别开。</p><p>虽然入地以后，会观察到五蕴的实质就是如来藏，但是初悟，不可能证得此点，只能把五蕴与如来藏所起的作用严格区分开，不能混淆不清，否则那就是悟错了。如来藏就像风一样无形无相，怎么找到祂？观察如来藏所产生的一切相，这些相都是祂运作的结果，在这些相上就能观察到如来藏的运作，就能证得如来藏，和风的作用是一个道理。</p><p>刚证得和捕捉到如来藏的时候，有可能捕捉到如来藏作用的一刹那，偶尔的这一刹那，就是如来藏的一点点小作用，没有把祂的作用连成一条线，也没有连成一片。发现祂的出现只是在一个点上，在一个刹那上。这悟的层次就非常非常浅，是刹那刹那的悟，如来藏的作用是断开的，没有连成一条线，也没有连成面和片。严格来说，这不算悟，悟至少要证得如来藏的作用是连成线的，最好是连成一片，大悟彻底之人，是连成了一大片。</p><p>所以说验证一个人悟没悟，各有各的标准，手稍微一松，就可能毁了一个人后续的大智慧的开发，使得往后的路非常难走，困难重重，不仅能耽误这个人的前程，有可能会影响佛教事业的稳定发展。在悟得如来藏刹那的作用的时候，应该乘胜追击，继续参究，把一个事情搞得水落石出，把智慧再扩展开来，把如来藏的功能作用由点连成线，在整个一件事情上要悟透，然后再从线到片。</p><p>最初找到如来藏是在某一处起用，再深入思惟参究，就知道了这里是如来藏所起的作用，那里也是如来藏所起的作用，那边也是如来藏所起的作用。这些点还是分散开来的，没有连成线，慢慢的再给祂连成线。那么最初可能在眼根上，在见色法上找到如来藏，但却不是找到如来藏的色彩形相，而是意识发现了如来藏是如何运作的。</p><p>最初在眼根上发现如来藏的运作，然后就会在其它几个根上也发现如来藏的运作，知道祂在六根上都是如此运作的，这样就在六根上都观察到了如来藏的运作行相。但是有的人可能是证得如来藏的刹那起用，不知道祂是如何连续运作的。再渐渐通过观察参究，智慧打开的时候，就能把如来藏的起用连成线连成片。</p><p>我们知道，如来藏是一直都在运作不断的，不可能有刹那暂停不起用之时，祂遍一切时、蕴、处、界、地，遍一切法。但是这里所说的一直，还不是无始无终的那个一直，只是一段时间内的一直，那么悟得如来藏在一个事件上的运作，其智慧还很浅。那就再参究，把智慧再打开一些，不仅要悟得如来藏的更广泛的运作，还要悟得如来藏更深细的一些运作。</p><p>再观察时就会发现，如来藏是无始无终遍一切法的，在五阴色身上，在一切事物上、在一切相上，在六根上，十二处上，十八界上，祂都是这样运作的，从来没有停止过，每时每刹那都在这样地运作着。到这种程度，悟得的智慧可能就要连成面，或者是连成一片了，这一片也分小片、中片和大片。根据证得的如来藏运作的范围有多大，这个片有多大，说明智慧就有多深。以此来判断每个人的智慧程度。观行的智慧越深，连成大片时，就可能到了牢关，甚至可能过了牢关，再可能到达初地。那么最初证得如来藏的运作，只是在某一点上，某一处上，然后连成线，那只能是菩萨七住位，智慧还不够深，然此已经相当不容易了。</p><p>第六识找到和证得如来藏，就是捕捉到如来藏所起的那些利用，最初证得的智慧非常浅，可能在一刹那上，捕捉到如来藏是这样起作用的。然后捕捉的面积稍微扩大一些，范围稍微广一些，证得如来藏的作用就能有一些连续性。最后悟的程度可能就要深一些，从方方面面都能观察到如来藏的运作，那么此人的别相智就出现了。</p><p>如来藏配合五蕴的运作非常深细，都是刹那刹那连续性的，每个人证得如来藏的运作的程度都是不同的，其智慧程度就不同。因为悟前第六识的智慧深浅不同，证得如来藏，捕捉到如来藏运作的程度和深度就不同。有的人在参究时，心非常细致，定力也够用，参究的范围比较广，参究之处也比较深入细致，悟的就可能透彻一些。</p><p>相反，定力不足，心比较粗，悟得就非常浅，其智慧就可能根本没有被开发出来，尤其是被人几乎是明白告知的人，他只是知道如来藏起了某种作用，其它一概不知，根本观察不到如来藏的运作情况，严格来说，这不能属于证悟。真正证悟的人，最初可能观察不到如来藏和五蕴、七个识是如何在一起和合运作的，但是他马上就会思惟整理，尤其是被智慧深细的过来人所指导，就会观察到如来藏与五蕴七识的和合运作情况，了知到了如来藏运作的一些细节，那么以后的观察智很快就能具足。</p><p>有的人悟后，可能到了牢关那个境界，甚至过了三关，这种人极其稀有难遇。有的人悟了，只是七住位，就悟了一个小片面、小片段，如来藏的运作根本连不起来。那么智慧再深一些的人，能把如来藏所起的作用都能连起来，在六根上（不止是在眼根和耳根上）祂都能知道如来藏是如何如何起作用的，每一个简单的事件具体是如何完成的。</p><p>再以后，就能知道如来藏在五蕴上、十二处上连续的功能作用，其细节内容了知的也比较多了，到最后就会由只知道如来藏初浅的作用，到能够观察到如来藏所起的更深细的作用，再最后智慧比较深，过牢关以后，就能够观察到如来藏心所法的运作。在此之前根本观察不到，因为这属于比较深细的智慧境界，等你悟了能够观察如来藏心所法运作的时候，那就已经成为地上菩萨了。对于如来藏的观行智慧，有深浅广狭的不同，证得的如来藏的智慧程度的不同，其大乘果位就不同。</p><p>五、如何撇开虚相顺藤摸瓜抓住如来藏</p><p>在一切法的运作上都有第七识和如来藏的和合运行，二者互相依赖，缺一不可。不可能在一个法上只有如来藏的运作而没有意根，也不可能在一个法上只有意根的运作而没有如来藏的运作。那么只要证得意根，就能顺藤摸瓜，抓住如来藏，那是不难的。当第七识决定不要命根的时候，如来藏绝对管不了命根，众生必死无疑。有情众生和无情物都有如来藏的执持作用，那要看是哪种有法，无情物上如来藏和第七识不能亲自和单独的执持无情物，都是所有众生的如来藏共同执持的。</p><p>其实证得如来藏还是很容易的，知道任何一个法都有如来藏的运作，在各种生命活动中，都是如来藏维持的结果，七个识的运行，都是如来藏护持的结果，色声香味触法的出现，都是如来藏变现的结果。没有哪个法的出现，不是如来藏的功劳，一切事业都是如来藏成就的。只要能把虚相撇开不认，就能发现如来藏的功能作用，那就能证得如来藏，抓住如来藏了。</p><p>虚相法是什么？就是五阴的活动，五阴的活动严严实实的遮蔽了众生的双眼，使得众生只见五阴的活动，不见其背后如来藏的功能性。只有把五阴的活动观察清楚，认清其不实性，虚假性，就把五阴像枯枝败叶一样拨开，从而露出如来藏这只鲜花。</p><p>怎样认清五阴活动的虚妄，断除我见？应该要把五阴的功能作用都找出来，概念弄清楚，内涵捋清，活动规律抓住，再思惟其来龙去脉，证得其虚妄性。然后就能把五阴活动都撇开，托显出如来藏的功用了，从而证得如来藏，就像证得风的存在一样。</p><p>如来藏在第七识后面垂帘听政，就像演双簧戏一样，一唱一和，配合得天衣无缝，所以有人才说潜意识里有一部分如来藏。如果能把潜意识和如来藏的功能作用分开，当下就证得了如来藏。打字，是如来藏、第七识、第六识、身识共同作用的结果，有生灭法也有不生灭法，能清清楚楚的分得开，才是智慧。</p><p>要在一切法上顺藤摸瓜，摸到如来藏，首先要找准藤条。如来藏犹如瓜蛋子，瓜蛋子是结在藤节上的。藤节就相当于五阴当中的十二处，就是六根六尘处，这是最活泼的，简直活灵活现，生机盎然，贼人在此猖獗，君子在这里处事，可谓凡圣同居，龙蛇混杂，一切交易都在这里进行。此时就看当人的眼力，辨得出君与贼、凡与圣、龙与蛇，若有火眼金睛之人，必能擒贼又能识君子。</p><p>六、如来藏遍十八界，十八界就是六根六尘六识。那就是在六根的用当中找到如来藏，在六尘的显现当中找到如来藏，在六识的活动当中找到如来藏。这就是所谓的生缘处处。而六识的活动，包括了受想行识的四阴活动，那就是在色法的五根、色声香味触、法处所摄色上有如来藏的显现，在心法六识上有如来藏的显现。在这之前，要观行色法的虚妄，观行心法的虚妄，就能证得五阴非我，断我见了，然后再参禅，就容易证悟。</p><p>要想悟得彻底，就要在十八界任一个法上都找到如来藏的运作，不要丢掉任一个法，这样智慧就会非常深利。在欲界当中，一切法都是六识的作用，有识就有一切法，所以一定要把六识的体性作用搞透彻，那时再来悟，就能彻底，这叫作大悟成片，而不是只悟得一个小片段。只悟个片段，智慧非常的浅，无法观察如来藏的运行。</p><p>所以学佛，一定要把小乘的基础打好，底子厚厚的，再参究大乘法时才能顺利，容易证悟，也容易悟得透彻，获得的智慧比较深。</p><p>七、譬如萎花枯叶，遮蔽了花中俏丽而生机勃勃的鲜花，要想显露出鲜花的峥嵘和芳香，就要除去萎花，剥落败叶，美丽的鲜花才能跃然于眼前。同理，五阴的萎花败叶，正遮蔽着真如自性，我们也要拨开五阴的遮障，排除七识的掩蔽，真如之性，就会大放光明。那就需要我们认清五阴的虚幻，认清七识的虚妄，不认这些假法为真实，那么真我就能渐渐显露头角，跃然于心，从此识得主人，归家稳坐，天下太平。学佛要把六七识的体性认清楚，把如来藏的体性认清楚，然后修出禅定，在定中观行妄心的虚妄，真心的作用处，就能实证真如。</p><p>八、佛为什么不能找到无余涅槃里的如来藏</p><p>在无余涅槃里没有了五阴身，如来藏没有依托，就不能显现出自己的行相。没有运行的行相，佛的任何一个识，就无法发现如来藏。</p><p>找到如来藏，观察如来藏，只能在五阴身上，观察如来藏要在五阴身上的运作上来观察。没有五阴身，就观察不到如来藏，就像观察风，必须在树上、在物体上来观察风，没有树、没有物体，那么虚空当中有风，它没法表现出来，如来藏与风的情况应该是一样的。</p><p>无形无相的东西，必须通过有形有相的法，才能够显现出来，否则无形无相，怎么被发现呢？比如说你发现了风，必须发现风吹在自己身上的凉爽性、清凉性，或者衣物飘动起来、树飘动起来、物体动了，才能发现风。如果没有自己五阴身，那怎么发现风呢？没有外界的树和草的揺动，你怎么发现风？发现风就得从这些物质色法上、从风的运行行相上动性上找到风，从物体的飘动性上找到风，从风吹到身体感觉到的清凉性、凉爽性和寒冷性或者是热性上发现风。</p><p>那么找到如来藏也是同样原理，必须通过五阴身的运作，通过五阴的活动上来感知。有五阴活动，就表示如来藏在色身上执持着、维系着、运转着。如果没有五阴身，如来藏无法显现其运行的轨迹。</p><p>佛在十二因缘经里说名色二者是互相依赖的，名色缘识，识缘名色。名色就是指五阴，识就是指阿赖耶识如来藏。五阴能缘着如来藏才能够运作，没有如来藏就没有五阴。识缘名色就是说，阿赖耶识必须缘着五阴身，才能够显现自己的存在和运行，没有五阴身，如来藏就没法运行。</p><p>九、如何悟才是最根本的悟</p><p>找如来藏最贴切的作法就是像寻找风一样，从作用上发现风的踪迹，发现如来藏也是从如来藏的踪迹上发现的。虽然如来藏无影无踪，但是祂遍界不藏身，到处都是祂的影子，就是不见祂本人。从四大种子的作用处不容易发现如来藏的踪迹，证得如来藏都是从识大种子的作用上，来发现如来藏的运行行相，所以才有唯识之说。这样悟就悟在六个识上，最利根的人就悟在第七识意根上，这是深层次的悟，最究竟的悟，最根本的悟，最彻底的悟，是唯识宗的悟，而不是粗浅的禅宗的悟。</p><p>十、如何现量证得八个识</p><p>八个识都是无形无相的，发现八个识，就是发现八个识的运行行相，看不见八个识的识体。可以用风的那个比喻，八个识犹如风，我们看不见风，只能发现风的作用；同理，我们也看不见八个识，只能发现八个识的作用。如果只有如来藏，没有五阴时，如来藏就不能显现出来，这时佛也发现不了如来藏本身。</p><p>风吹大树时，树一摇动，就知有风，就证得了风；五蕴就是大树，七识本身，也可以是大树，也可以是风，识心就像风，五蕴这棵树摇摆起来，就知道识心的风现前了，就知道有识心风的存在，就证得了识心风。意识也是无形无相的，意识却能发现祂自己的运行行相和心所法，了别自己的思想念头和心行。这些识心和心行都是无形无相的，可是却能有了别性，能被证得和感知。</p><p>如果根据树的摇晃，证得了风，这个证悟是比量了别还是现量？当然是现量了别，因为树确实在眼前摇晃，摇晃确实是风的作用，这不用与其他法比较，直接就能了知。如果根据如来藏的运作来证如来藏之心体，这个同样是现量，而不是比量。风吹到脸上，感觉凉爽，就知道有风，这个绝对是现量了别和证得，除此没有其他途径现量证得风。</p><p>一个人在房间里觉得憋闷时，就知道房间里氧气不足，于是就到屋外透气。觉得氧气不足，是现量了别还是比量了别？肯定是现量了别和证得，因为亲身经历了，最能说明问题。当你看见太阳光觉得刺眼时，就躲开了，这时就知道自己的眼识看见了太阳光，同时就证得了眼识；知道自己看见眼前物，就知道是眼识看见的，就现量证得了眼识。</p><p>当你思惟时，就知道意识心现前，就证得了意识，这也是证得意识自己，是证自证分，是自我反观力。这是现量证得意识，不是比量了知。喝水时，觉得水是凉的，这个感觉就是身识的觉，是现量证得了身识，不是比量了知。因此得出一个结论就是，只要当下能了知到的，不是比较得出的结论，都是现量境界，都是亲证。</p><p>十一、如果想参禅寻觅证悟如来藏，不仅要了解如来藏的体性，更要知道祂都在哪里显露头角，在何时何地何处露出踪迹。这样，我们才能在某时某处某种境界上去捕捉祂，与祂相认，从而携手归家稳坐，其乐融融。如来藏出现的时和处都是什么呢？如来藏祂时时刻刻都存在和显现着，时时刻刻都在起利用，祂与五阴身从不相离片刻须臾。</p><p>在六根处，在六尘处，在六识处，在十八界上，在五阴上，到处都有如来藏的显现，处处都是见祂的缘，因此处处都能得逢渠。就像过去禅师所说的生缘处处，就是这个意思；哪里没有祂，哪里不是祂，没有祂的出现，就没有哪里，祂活活泼泼的，触缘皆是，无一处不是，那么找到祂的机缘，就有无限之多。那就没有必要让意识尽量不分别，如果意识不分别，如何能识得自家宝贝，如何能识得久违的父母双亲，而在分别之处，也正是祂大显身手的时候！</p><p>如来藏自心本来就是离念的，祂不分别六尘，不念诸法，也不行诸法，本体就是这样的功能体性，与意识的有念无念没有关系，与意识的分别与不分别也没有关系，因此就不用我们刻意把意识心也修成无念，修成不分别了。修成的无念，无论如何也不是本来就离念的如来藏，心体不同之故。就像白薯漆成红色，也不可能是红薯，本质不同之故。</p><p>所以参禅，寻觅自心如来藏，不用我们把意识心离去念想，根本没有这个必要，相反我们还要善于利用意识的念想，来参证如来藏。如来藏不仅在意识离念时显现，更是在意识念念动转时显现，而且生机勃勃。如来藏的踪迹，遍一切时，遍一切地，遍一切处，遍一切界，遍一切法，那么任何时候，任何处所，如来藏都在灵灵活活地显现着，从来不会隐藏丝毫，只是意识心在因缘不具足的情况下，很难发现和证得祂而已。如果意识心离念时，就有如来藏，或者离念的意识就是如来藏，那么意识心又有念时，又该怎么办？有念、无念本是生灭变异法，如来藏心体永远不生灭，不变异。</p><p>还有人说，如来藏是无所住的心，要想证得如来藏，我们的意识心就要念念不停留，也要做到心无所住。暂且不论意识心能不能做得到无所住，即使意识心真修到无所住了，那也仍然是意识心，不会变成如来藏，本质不同之故。如来藏的无所住，是本来就无所住，根本不管意识心的住与不住。而当意识心念念攀缘的时候，也正是如来藏大露风光之时。我们尽管停留，尽管住，停留之处，住之处，就有如来藏的身影，这时识得祂，就可回到祂的家乡故里，但只恐怕这时只顾追逐六尘缘影，不能识得出真心如来藏了。</p><p>如来藏既然遍一切处，哪里不是祂，何处没有祂；没有祂，就没有一切，也没有何处，也没有哪里；有祂，就有一切，就有何处，就有哪里。如来藏是多么灵活的法，不必把意识弄得死死板板，也不必在意识心上大作文章。我们只要让意识心反观，观其来处，观其起处，自然就能找到归家之路。找到证得祂以后，大智慧自然就会生起，从而发起实相般若智慧，等到智慧圆满具足时，就成就佛道了。</p><p>十二、要证得如来藏，就要找出前七识，把前七识排除，不与如来藏混淆，就能容易证得如来藏了。首先要了解意识心的体性，以及意识心在各种法当中运行的各种相貌，把在各种情况下出现的意识，都要找出来，就能全部证得意识心了，前五识的体性也要弄清楚，要一一找出来。然后再了解意根的体性，在每时每刻做决定、做主宰的心就是意根，在某件事情当中那个做抉择的心就是意根，如果心思能细致一些，就能发现找到意根。</p><p>最后就剩下如来藏，将来找出来时就是明心开悟了。我们只需要把八个识分一分，看看各自都是做什么用的，哪个是生灭性的，哪个是不生灭的，这样我们心中就能清楚了几个识的体性和功能作用都是什么，对佛法就不再迷惑不清了。八个识心，每个识自己都要亲自去找出来现前观察。</p><p>修行佛法，需要我们去修的是妄心七识，真心如来藏不用我们去修，但是需要找到，找到祂就能真正明白祂，观察祂的运作，明白祂的运行情况叫作明心。明心以后，观察智慧越来越深，智慧就会越来越增长，增长到极限，就圆满了，圆满了就成佛。我们在无量劫的生死轮回中无明深厚，要做到这些是非常不容易的，但是如果不做，那就更不容易，在生死流转中所遭受的生死苦恼就会无穷无尽，永远没有出期。因此需要我们忍于一切难懂的佛法，知难而进，就会渐有所成，最终就会证得无上菩提。</p><p>十三、如何参禅</p><p>所谓离相，是让六识心离开世间一切虚妄相，不认这些虚妄相为真实，继而能破除虚妄的我见，识得世出世间的真实相。而真正的离相者，是本来就离一切相、没有任何一种相貌的如来藏心体。</p><p>所谓的离，就是剥离、排除的意思，所谓的排除，是不认世间生灭的虚妄法为真实，观察世间所存在的任何一个法，都是无常的、生灭的、变易的、苦的、幻化的，凡是具备这几个特性的法，都不是真实的法，那么内心当中就不能再把这些法当作真实。</p><p>把这些虚妄法一一都否定之后，我们就可以寻找在这些虚妄法当中，究竟哪一法是本来就离一切相的、不生灭的、常在的，哪一法是不变易的，是不空而有真实作用的。如果我们找到一法，认为那就是真如，就是真正的自己，那我们就要比对一下心经中所讲的空性心的体性，观察这一法是否有增减、有变易，是否有生灭和无常的现象，是否是变化无常的，是否是不自在的，是否是因缘生的，是否是受很多因缘条件所制约的。</p><p>如果是这样，那就是生灭的虚妄法，如果不是这样，确实是符合心经中所说的不生不灭、不垢不净、不增不减、不空不有的体性，那就是真实永恒不变的真如如来藏，这样才是找到了真正的实相心，才真正的证悟了如来藏本心。</p><p>所以剥离法不是灭掉什么，而是确认世间法的虚妄不实性，不认它为真，都剥离之后，剩下一个不生灭、不变异的才是真。这个方法不是让我们打坐修定，把觉知心都灭掉，如果把觉知心都灭掉了，就不能知道哪个是真如如来藏，不能明心开悟了。</p><p>证悟真心如来藏也不一定是在打坐修定时觉知心稍微清净一点，没有妄想了，认为这就是开悟。因为这时候意识暂时没有妄想，好像是清净了，等一会儿意识心的妄想还会出现，不可能永久保持清明，没有一丝妄念。即使永远没有妄想，永远清净，那也仍然是意识心，祂永远不能变为真心。这是妄想的法尘境界生灭变异的现象，不是不变易的真如心，这时是一种暂时而有的某种定的境界，不是开悟的境界，所以不可以当作真实法去认取。</p><p>那么世间的虚妄法都是什么呢？世间法，就是世俗法，是五阴世间法，包括六根、六尘、六识。六根就是眼根、耳根、鼻根、舌根、身根、意根；六识就是眼识、耳识、鼻识、舌识、身识、意识；六尘就是色、声、香、味、触、法。与眼根所对应的是色尘，与耳根所对应的是声尘，与鼻根所对应的是香尘，与舌根所对应的是味尘，与身根所对应的是触尘，与意根所对应的是法尘。</p><p>五阴是色阴、受阴、想阴、行阴、识阴，五阴十八界就是整个三界世间，其中每一法都是虚妄的、生灭变异的、无常的，五阴世间都是有为法，有行为有造作的法，是后天出生的法，所以才是虚妄的。出世间法是指如来藏，祂不在三界世间里，祂没有任何相对立的法，所以才是真实的法。</p><p>十四、枯木龙吟，修行到某种程度，定力非常好时，有一天就会觉得五阴色身确实像一个枯萎的木头似的，好像是一个空壳，并没有实质的功能作用，表面上的那些五蕴作用看似有，实际就像被操纵的一个机器人，只是被动地动转罢了。就像木偶被人牵线，才有舞戏杂耍的产生，实质没有什么意义。就像一个大力鬼附身，身口意一切造作都是大力鬼所为。我们只需要找到这个大力鬼，找到这个牵线的人，找到机器人的开关按钮，那么无穷无尽的奥秘就会全部揭开。枯木里只要有龙在，枯木就逢春，然后发芽开花结果。只要有龙在，铁树也开花，一切都会万象更新，欣欣向荣，一片生机盎然。听……听……龙吟了。</p><p>十五、问：如来藏的作用无处不在，就是这个无处不在，才无从下手。如来藏如何寻找？用哪个手段？</p><p>答：必须修好定力时再参究，否则解悟成分多；如果是解悟就不能观察到如来藏的运作情况，不能知道如来藏究竟是如何出生五蕴的，智慧也就不能增长，只有真正的证悟才与如来藏相应。如果定力不足，暂时不要下手参禅。</p><p>断我见以后，很容易证得如来藏，把五阴的功能作用全部否定，如来藏的作用就显现出来了。如果还把五阴的作用当作真实，如来藏的作用就感觉不到，证得祂就很难。当福德、定力和慧力具足，菩萨六度修行成就，用参禅参公案的方式，就能证悟，那时就有下手处了。</p><p>十六、龙牙和尚居遁颂</p><p><strong>龙牙山里龙，形非世间色。世上画龙人，巧巧描不得。唯有识龙人，一见便心息。</strong></p><p>释：龙牙山指五蕴，龙指阿赖耶识，五蕴之中有阿赖耶识在隐居着，供养着五蕴身，执持着五蕴身，五蕴身才得以运作。世间色都是物质色法，有形有相，看得见，摸得着，听得见，嗅得到，触得到。而这个阿赖耶识却不是这样，祂无形无相，看不见，摸不着，听不见，嗅不到。世上最会画龙的人，也描画不出阿赖耶识的形象，因为阿赖耶识没有三界世俗相，那就没有比照，也就没有下手处。只有懂得阿赖耶识的人，以智慧之眼识得祂，就再也不向外攀缘了。因为只有这个是最真实的，其余的都是祂所变现出来的幻化假相，认识到此点，心就止息下来，不再外求了。</p><p>既然阿赖耶识无形无相，那么如何才能寻觅到五蕴身中阿赖耶识这条龙呢？那就要了解阿赖耶识的体性，知道祂是如何出现的，都是在哪里出现的，然后在祂出没处，看着祂。五蕴身中，有眼耳鼻舌身意六个洞口，虽然这条龙无身不出洞，但是祂会从六个洞口里，常常鸣吼，当祂鸣吼时，只要能识别到祂的声音，就能找到祂的踪迹。从此，就可以循声认得自性，找到归家的路。</p><p>十七、有学人问百丈和尚云：<strong>对一切境如何得心如木石？百丈和尚答：一切诸法本不自言是非垢净，亦无心系缚人，但人自虚妄计着，作若干种解，起若干种见，生若干种畏爱。但了诸法不自生，皆从自己颠倒取相而有，知心于境，本不相到，当处解脱。一一诸法，一一诸心，当处寂灭，当处是道场。</strong></p><p>解：有个学人对百丈和尚说：对一切境界时，如何才能让心像木头石头一样不动，不起念想呢？这个学人，是在意识觉知心上用功夫，想要强压抑意识心不起念想，让意识心面对着六尘境界时，就像是没有看到没有觉知到一样无觉无知，好坏不管，善恶不分，是非不计，木然无所用心。那这是干什么呢？这是在修定，让觉知心对六尘境界不起分别，不起观照作用，尽量把觉知心灭掉才好。</p><p>那么这样修的结果是什么？结果就是觉知心能够深入定中，无念无想，无觉无知，像木头一样，与石头无别。但是这样是不会有智慧出生的，因为内心不起观照，就不能有智慧识别各种境界，更不能识得境界背后的真如心体，那就不能明心见性，也不能观照諸法断除我见了。其结果就是不出六道生死轮回，不断苦，没修灭，没证道，不得解脱，也不能知諸法实相，不具般若智慧。这个学人只知道修定，不懂观照诸法实相，这是修行的大忌，也是修行的邪路，因为解脱是依赖智慧解脱，成佛是依赖智慧而成佛，禅定仅仅是出生智慧的一个助缘，不是主修，深定不出生智慧。</p><p>百丈和尚回答说：<strong>一切诸法本不自言是非垢净，亦无心系缚人。但人自虚妄计着，作若干种解，起若干种见，生若干种畏爱。</strong></p><p>解：一切诸法本来就不会自己说是对是错，是染是净，都是众生的识心去分别諸法的是非、对错、垢和净；一切诸法也没有心行，想去把众生的识心系缚住，让识心生心动念，不得解脱。但是众生自己却虚妄地计较诸法，对诸法起种种知见和见解，生起种种的贪爱和憎厌。</p><p>百丈和尚接着说：<strong>但了诸法不自生，皆从自己颠倒取相而有，知心于境，本不相到，当处解脱。</strong></p><p>解：我们只要明了，诸法不会自己就能出生，都是因为识心自己种种颠倒执取于相，诸法才出生了，识心对于境界来说，根本就不能与境界相接触，根本不能触到境界，那就是说，本没有境界。没有境界，我们却虚妄的强行去分别，当然是徒增系缚了。如果我们把心看空，把境界看空，知道识心本无，境界也本无，那我们当下就能得到解脱，也不会有境界来系缚自己的心了。同理，虚妄的识心，也本不有，那就不会有心再被境界所系缚了。这样来作观行的话，无心也无境，心境不相到，还有什么不是解脱的呢。</p><p>百丈和尚说：<strong>一一诸法，一一诸心，当处寂灭，当处是道场。</strong></p><p>解：一一诸法，一一诸心，当下就是寂灭的，虚妄相本不存在，实质就是那颗寂灭的真心，这样一切心境所在之处，就是我们修行的道场——自心真如。</p><p>这样观照诸法，何愁心不了境，何愁不见诸法实相，何愁心不寂止，何愁不得解脱，何愁不成无上菩提。</p><p>十八、黄龙禅师有偈云：<strong>“春有百花秋有月，夏有凉风冬有雪，若无闲事挂心头，便是人间好时节。”</strong></p><p>这是描述禅师们过牢关的境界，过牢关的人，心得清净，内心不再贪恋世间，生活在世间，一事也不牵挂，一法也不再留恋，对自我五阴不再执著，对自己所证得的真如也不执著，内心坦坦荡荡，不留一物。虽然在人间生活照样经历一年四季春夏秋冬，可是心中却无一法可当情，景是景，色是色，人是人，物是物，一切法各住法位，与我不相干，活在世间照吃照喝，却不贪执世间，内心已经得到解脱，没有拘执。</p><p>十九、只有因缘条件具足才能悟道</p><p>证果和明心的条件如果具足，遇到相应的因缘，不管是什么因缘，人为设计的也好，自然环境也好，只要能触动内心，就能证果和明心。如果遇见佛讲法更能证果和明心见性了，佛的威德加持力是非常大的，佛讲法的法会磁场效应也是非常大的。况且佛世的修行人普遍都有甚深禅定，心地都很清净，都有出离心，烦恼都轻微，善根福德都深厚，所以一闻法，就能随着佛的音声观行思惟，立即就能证果和明心。</p><p>如果学佛还没有修到位，内心没有疑情，没有起心参究，心里没有念兹在兹，即使遇到很多应该悟道的缘，也会白白的错过去，不能悟道。我们末法时期的众生跟佛世的众生没法比，善根轻鲜福又薄，内心浮躁，都没有禅定，佛法即使讲的再细，也不能入心，所以都无法真正的实证什么果位，最多理解理解，就很不错了。</p><p>正因为众生普遍都没有禅定，无法具足禅定，所以就出现一种说法，不用修定，直接就可以观行佛法，可是没有禅定如何有观行能力？能观行出什么？能观行多长时间？每个人自己可以试验一下，修定之前的观行，与修定之后的观行，其效果差别到底有多大，可以说差别太大了，结果有本质上的区别。</p><p>一个法义，有禅定时思惟和没有禅定时思惟，简直天差地别。所以很多人思惟佛法，根本不能真正理解，错会误会太多，无法理解真实义，要想实际证得和现量观行，那真是太难太难。即使这样，很多人还非常相信自己的理解力，动不动援引一段经文，以证明自己的观点。其实经文的意思和自己的观点并不一致，自己错会很多，也不自知。不少研究经典的人，根本不能如实理解透彻经典的真正义理，还觉得自己很能。其实佛法根本不是搞研究能研究得出来的，必须甚深禅定的如理思惟观行参究，才能真正理解真正实证。研究不能实证。</p><p>一些人往往是看佛经里记载，众生在听佛讲法的当下就证果和明心了，那些人也没有修禅定，直接就证果了，好像是只要能闻法，稍微一思惟就能证果，不用特意修定。这个误会是相当大的，不知道那些闻法当下证果的人，都已经具足了禅定，善根福德都深厚，只差因缘了，遇见佛讲法这样最殊胜的因缘，当然会非常容易的证果和明心见性了。这些人只能看见最后的结果，看不到证果的人之前已经走过了多长的修行路程，听佛讲法之前是如何用功的，如何发心和行持的，如何努力修禅定的，这些必要条件都不看，专门截取最后证果这一段，这是最严重的断章取义了。</p><p>现代人浮躁得都想走捷径，越简单越直接越好，佛所走过的路都不想走，以为自己的办法比佛还实用，还直接，不用那么辛苦。难道说一个凡夫比佛高明，比佛还有智慧吗？佛的修行都是绕弯子，自己走的路最直接，不用打基础，不用付出任何代价，不用辛苦修定降伏自心，研究研究就能取得很大成果吗？痴人说梦，研究出的果，都是纸糊的，风一吹就散坏了，遇火就化掉了。如今世间假果太多，盖的都是萝卜印章，抵不住风吹草动，死后果报自知。</p></div>"
},{
    "title": "第三十三章　参禅与证悟2",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十三章　参禅与证悟2</strong><br/></p><p>二十、修行就是依真修妄而不是借妄修真</p><p>除了如来藏本体，都是虚妄法，包括学佛修行，包括行善度众生，包括成佛这个法，所有的佛法也都是虚妄法，由如来藏出生，生生灭灭。只有如来藏不生不灭。涅槃也是虚妄法，第八识的圆成实性也是虚妄法，第八识的真如性也是虚妄法，依靠如来藏才能显现出来。五蕴身心更是虚妄，这些虚妄法，我们要如何对待？</p><p>我们应该依靠真心如来藏修行妄心七识，去除七识的无明和染污，无明尽，究竟转识成智。而不是修真，因为如来藏不用我们修，祂本具如来智慧德相，戒定慧也圆满具足，无无明，具足一切善法功德，心体无为，自性清净。因此无烦恼，无生死，无轮回，本自无缚，自性解脱。如来藏自己不修行，我们也不用去修祂，只需要七识像如来藏一样清净，不再有生死，就解脱自在了。所以需要七识证得如来藏，才能有所依靠。</p><p>二十一、事修和理修的区别</p><p>一切法分为事和理两部分，事就是相，理就是如来藏理体。在谈论事的时候，就要从相上来破除相的真实有性，这时候就不能从如来藏理的角度来说了。那会让有些人认为相就是真实的，就会生起执著，从而心被束缚，不能解脱。</p><p>小乘法都是从相上来破有，大乘法是从理和事两方面来修行，从理上来破相，认理就好办，但是也不废相，不会执理而废事，要求理事圆融在一起，不可偏向任何一方，否则佛法就不成就。修到究竟理事圆融的程度，那就是佛，理事圆融还不究竟的那是地上菩萨和等妙二觉。明心以后的菩萨也许能圆融一点点，如果观察力不具备，那就一点也不能圆融。</p><p>如果没有证果也没有明心的人，告诉他五阴十八界法，世间一切法都是不生不灭的，他就会认为是真实的，那执著这些没有错，没有什么不好，因此就不会想办法去灭除自己的贪爱和执著，这样的话，众生的生死问题就不能解决了。一切法皆真如，这是地上菩萨以及佛的现量观行结果，凡夫只能一步一步从基础五阴十八界的生灭相上来修行，不能直接就把五阴十八界当作不生不灭的真如来对待，没有人能现量观察到这个理。</p><p>四禅八定是事修，是修相，相必定有生灭，没有不生灭的相，除了第八识的空相，空相无相，所以不生灭。四禅八定里的六识从相上看就是生灭变异的，第七识从相上看也是生灭变异的。谈论生灭变异的法，修相的时候，就要有生灭变异的相。如果这时候要说七个识和四禅八定，都是不生灭的，那就显得不伦不类了。既然都不生不灭固定不变了，那我们就没有什么好修行的了，已经完美了。</p><p>二十二、如何悟后起修</p><p>五祖说：守本真心，自是妄念不生。五祖的意思是让我们认自性清净心为不生灭的真心，不要去认虚妄的五阴身为自己，也不要认生灭的妄心为自己，只要做到这样，就是真正的明心悟道之人，才能够免得生死流转。</p><p>而证得真心以后，也不需要去守护看着祂，因为真心不管你守不守护，祂都在运行着；祂也不跑，祂也不丢，祂也不灭亡，你守祂作什么？只要我们意识心依止于真心如来藏的体性，改变自己，心就能越来越清净，不是说让我们看住抓住祂。这个守是依止认可的意思，以祂为真，再不向外贪求。我们的六识心身口意行应该依止于如来藏的清净体性来造作；依止如来藏的清净体性，也要清净自己的妄心七识，这也是守。</p><p>悟后没有必要成天去看住真心，执著真心，这样反倒增加束缚，增长执著；内心一旦不执著真心，也不执著三界的法，就能到牢关，然后再过生死牢关。有些人说开悟以后需要保任，而需要保任的是意识心，保任意识心不起妄念，他们认为起了妄念，就不是真心了，因此就需要让自己尽量长时间地无念，认为这就是守真心了。实际上他们守的是意识妄心，真正的真心，不用守，祂本来就那样，本来就如此，不跑不丢，不变异，更不消失。但是需要守的是，明心以前知道真心为真我，认取真心为自性，明心以后应该依止于真心的体性，来改变自己的心行，降伏自己的贪嗔痴慢等等烦恼，心得清静，不起私心慢心，是这样守法。</p><p>二十三、问：证得如来藏后能现观其体性，这个现观如何理解，用意识心去观，还是用父母所生的肉眼观？</p><p>答：如来藏无形无相，肉眼肯定观察不到，因为眼识只能见有形质的色，意识心才能观察到无形无相的如来藏的运行情况。意识出生般若智慧以后就能观察到如来藏的运行行相，就知道了祂在各个方面是如何配合七识五阴而成就一切法的，知道祂的各种体性。这样就具有了有关如来藏的别相智，智慧再增进又能出生道种智，道种智圆满具足，就成就了一切种智，那时就是一尊圆满的佛。</p><p>因为如来藏在运行当中是有行相的，这个行相就是法相，只有意识心才能了别和证知这个法相，这是意识心的见分和自证分的功能作用。八个识本身的运行都是有行相的，意识心都能够了别观察得到。意识观察自己本身运行的时候，就是证自证分，祂能够证明自己的存在和运转，以及自己本身所处的状态，这叫作反观。其祂几个识的这种反观性，悟前观察不到，地前也很难观察到。</p><p>二十四、悟后起修的内容</p><p>修禅宗的人通过参禅明心开悟以后，再接续往下修行，叫悟后起修。因为悟前没有证得真心如来藏，他的智慧没有发起来，就没法真正的修什么，悟后因为证得如来藏，智慧生起来了，就知道自己需要修什么内容，悟后进了门里，发现需要修的佛法内容非常非常的多，于是就迫不及待的想把所有时间用在佛法上，不想在世俗里耗费精力，耽误时间，有的人就选择了闭关修行，这时自己修行一般来说不会走错路了，对于法义有了一定的辨别力，只要用功，道业就能增进。</p><p>悟后修什么法呢？悟后修禅定是一个内容，修四禅八定，让自己的定力道力更增强，获得初禅定就能断烦恼，心得解脱，就有能力过禅宗三关，进入如来家，成为真佛子。悟后的各种观行，都离不开禅定，否则就不能过三关，不能证得更深的佛法。再一个悟后需要读佛经，看经典，三藏十二部经需要慢慢通达。因为证得如来藏以后，就能比从前更容易看懂佛经，通过看佛经增长自己的般若智慧，发起后得智。悟后要修到十住位、十行位、十回向位，过禅宗三关，或者入初地，这都是悟后起修的内容。</p><p>悟后修的法非常非常的多，禅宗祖师一般都选择悟后才去闭关，悟前都不去闭关，悟前是到各个道场去寻找善知识来参究，想尽办法寻求开悟，他们都不选择闭关，因为不知道佛法的来龙去脉，不懂参禅，闭关没有用，只能浪费时间。</p><p>悟后才选择闭关，因为获得了佛法的总相智，有智慧观察和参究如来藏，修行不会走偏了。在闭关静修当中，要来观察如来藏在各种法上的运作，以获得更深的别相智，也要学习佛经来提高和增进自己的智慧。悟后修行的内容，初关过去了，还有二关，还有禅宗三关，这都是悟后需要静心修行的，尤其是大乘经典三藏十二部，需要闭关来静修，需要专门的时间来修行，才能不受世俗法的打扰。</p><p>六祖悟了以后，因为他没有文化，不能修学三藏十二部，他就选择修禅定了，在猎人队里十五年都在修禅定，同时也在定中观行如来藏与五阴的和合运作，般若智慧越来越深。修了十五年以后，他的禅定修成功了，神通修出来了，这个时候六祖觉得弘法的因缘到了，他才从猎人队里出来。</p><p>六祖悟后十五年，讲了那本坛经，从来没有说悟后需要保任的事情，因为他打坐不是保任什么意识心不起念想让心清净，恰恰相反，六祖知道真心本来就是清净的，不用再让祂清净，多此一举。况且真心本来就是那样子，外力改变不了祂，只能改变妄心。六祖从来也没有说过打坐入定要保任如来藏这个事情，因为如来藏不需要保任。他开悟证得了如来藏以后，认定如来藏真心就绝不再退转了，还保任什么呢？不需要保任。六祖所修的内容就是四禅八定，再观察如来藏的运作，具足了别相智，然后过禅宗三关，这是六祖修的内容。其他禅宗祖师修的内容各各不同，都有差别，不过大致都是为了获得更深的智慧。</p><p>二十五、悟后修行的次第</p><p>开悟以后的修行，有两种途径，一种是要眼见佛性，证得如幻观，感觉身心世界都像幻化的一样，进入十住位；然后继续往上修行，证得初禅定，断除贪嗔烦恼，成为三果，再观行证得阳炎观，成为十行位菩萨；再参禅过禅宗三关后，观行证得如梦观，就有能力入初地，以后次第修行到八地到佛地。这是一种修证的方式途径。</p><p>另一种途径是，可以不经过眼见佛性的阶段，只要九地菩萨之前能够眼见佛性就行，开悟以后努力观行修定，淡薄贪嗔痴，成为二果人；再发起初禅，成为三果人，继而再进行各种次第观行，分别证得阳炎观和如梦观，以后入初地、二地，直至八地九地，最后圆满成就佛道。</p><p>证得如幻观时，能感受到身心内外都是假相幻化相，非真实有，不再把五阴世间的一切法当作真实，从此贪嗔痴烦恼非常微薄，几乎没有，禅定就会生起。明心以后逐渐感受到身心内外都不实如幻化，从此贪嗔痴都非常微薄。再以后禅定会增进，达到初禅时，断掉贪爱和嗔恚，就是三果人，如果断得干净，就能次第过禅宗三关，通达三乘法，有能力入初地。当然这其中还需要有很多证量，就不一一细说，因为大家现在离到初地还很远。</p><p>如果不明心，直接证二果，贪嗔痴淡薄，不能证得如幻观，即使修到四果也不能成为七住位，更不能进入十住位。但是大阿罗汉们一旦明心，就不一定是七住位了，也许更高，大乘道的修行会非常快速。有一种戒定直往的初地菩萨，修得神通，可以飞往百佛世界，面见百佛。但是智慧不深，不能为众生讲法，这是只靠禅定神通就能入初地的例证。</p><p>二十六、学法修行，不管学什么程度的法，没有断我见的人，要思惟观行这一切法都是无常变异生灭的，都是如来藏所出生和变现的，都不是我，也不归我所有。没有明心见性的人，要思惟观行，这一切法都是如来藏所出生和执持的，都是如来藏运作出来的，要如何寻觅到如来藏的踪迹，证知一切法都是如来藏出生和运行的。明心证悟以后的菩萨，要思惟观行，如来藏是如何出生这一切法的，如何运行这一切法的，与五蕴都是如何密切配合的，与七识如何和合运作的，让智慧越来越深广。</p><p>这样的话，我们无论接触什么层次的佛法，都能发起深思，都能得到受益，学法功不唐捐，各种观行智慧都能出生，并且得到增长，以后才能慢慢做到理事圆融。理，通常指如来藏心体，而如来藏对六尘境界是无知的，祂不是能知六尘的心体，也就不知事。而事本身无根，事的来源是如来藏理体，所以事的根源就是如来藏理体。</p><p>明心以后，见得佛性，证得如幻观，身心世界感觉如幻如化，不实在。观察一切法都是如来藏幻化出来的，感觉身心世界并不真实，这是实际感觉，不是想象出来的，因此心行改变，对自我和世界的看法改变。对自我身心的改变，是意根认识到佛性真实、自我五阴幻化不实的真理，因此放松对色身的控制，身心松动，就出现轻安愉悦等等殊胜的境界。在此观行中，由于意识现量证得佛性，现量感觉到佛性的殊胜美妙，意根了知并认可佛性真实，能够显现出六尘境界，自我五蕴就是幻化出来的，于是不再束缚五蕴身，色身就此得到某种解脱，出现轻安舒适等等一系列的转变和变化。意根认可就是现量证，这时贪嗔痴烦恼都轻微，但还没有断除，相当于小乘二果的薄贪嗔痴。修学大乘之人，没有见佛性，没有证得如幻观时，不能薄贪嗔痴，就不是二果人；如果觉得自己贪嗔痴轻微，那仅仅是一种感觉而已，不是现量证得二果。</p><p>初禅之后，观行自他的七识心，犹如阳炎一样，就像沙滩在强烈的太阳光照射下返上来的热气形成的虚幻的河水一样不真实，这是实际观行亲身体验，不是想象出来的。证得阳炎观以后，能现量观察每个人的心识非常的虚假，于是就除去一分对自他的执著和贪爱，识心觉受非常，因为触动了意根。这个观行，没有禅定，也不可能现前实际观行出来，不能亲证。</p><p>禅宗过三关之后，能亲自观行出世间一切人事物理，就如在梦中一样，都是那样的不真实，也能观行到自己过去世的经历都像是梦里的一样。前世的事情，自己能了解到一些，知道一些自己前世的身份，所做过的事，接触的人等等。这也是亲证的境界，不是想象出来的，不是理解的。所有理解的理和法，都苍白无力，没有解脱的功德受用。要想不仅仅是理解和想象，就要在禅定中观行实证，除此没有其他途径。</p><p>二十七、佛法修证的步骤</p><p>许多事实摆在面前，如果不进行认真思考，就不会得出一个结论。只有对这些事实生起疑问，反反复复仔细的思考，才能发现事实背后的真理，才能得出一个结论。这个结论就是新的认知，也是智慧的结晶。日常生活中是如此，佛法的修证上也是如此，都必须经过收集证据、发现事实、生起疑情、专心思考各个阶段，然后得出结论，就破除无明出生智慧了。</p><p>这里哪一步是最难的？收集事实资料、发现事实、生起疑情，还是专心思考最难？生活中的事实很多，我们往往视而不见、麻木不仁，不会对这些事实起疑，更不会思惟这些事实背后的道理是什么，于是就不能有所发现，不能颠破从前的错误知见，不能增长智慧。不能起疑，就是不觉悟。</p><p>二十八、修行的次第</p><p>习气的消除在明心见性修到初地菩萨以后直至八地菩萨为止。先明心见性，后断除烦恼，再以后才能断除烦恼习气，这是修行次第。烦恼以见道的智慧加上禅定才能断除，没有智慧没有禅定不能断除烦恼，更不能断除烦恼习气。</p><p>如果把明心见性比喻为开灯的话，这仅仅是打开了一盏小小的灯，还不够光明，成佛时最后的明心见性，才是最辉煌的，所有的灯都打开了。如果把明心见性比喻为从梦里清醒过来，那么刚开始的明心见性还没有从梦里彻底清醒过来，是小醒，成佛了才是完全从梦里醒过来，从此不再做梦了。</p><p>二十九、开悟是否还会退转</p><p>关于开悟以后是否能退转，这里涉及到两个问题：一个问题是开悟是真开悟还是假开悟，是如何开悟的，开悟的过程如何；另一个问题是什么叫作退转，退到哪里去，转向哪里了。</p><p>第一个问题，开悟这个概念，是开启自心，悟得真心自性如来藏。开启自心是非常不容易的，无始劫以来我们一直把五蕴身心当作是实有的我，一直对之执取不断，非常贪爱和执著。把这样贪爱执著的心扭转过来，让六七识否认五蕴身心，去认一个从来没有见过面的非常陌生没有把捉的真心如来藏，这个难度是非常大的。这件事非大丈夫而不能为，需要相当大的善根和福德，需要相当大的勇气和毅力，去一步步的降伏自心固有的错误知见，不断的否定无始劫以来的认知习气；需要不断的与旧有的思想偏见进行搏斗，直到完全否定了自己的五蕴身心，树立身中有不生灭的真实心如来藏为我的正确观念，心性得到了调伏，对于真心自性有了柔顺忍，才能有因缘找到证得真心如来藏。</p><p>在找到证得如来藏之前，需要观行五蕴身心的虚幻不实性，不断的否定五蕴身心，不断的打倒五蕴身心，直到断除五蕴身心为我的邪见，才能有办法真正的认得真心自性。也就是说五蕴身心必须倒下死去，才能在死尸当中找到那个活泼泼的自性如来藏。必须有一死，才能证得那一生龙活虎的，不然还把死人当活人，就不可能去认那个真正的大活人。所以在开悟之前必须断我见，哪管在断我见之后的一小时一天几天时间里找到真心如来藏，也是先断我见，死去五蕴身心，才证得真正的如来藏真心。没有这个断我见的过程，不可能真正明心开悟，那就是假悟，心没有打开。</p><p>另外一个问题是，凡夫无始劫以来从来没有悟过，第一次悟必须有一个很长时间的参究过程，在这过程中七觉分都要发起来，都要具足，八正道也要修完，三十七道品都要修好，都要成就，菩萨六度的条件也要都满足，心性调柔下来，初步具备了一个大乘菩萨的品质和心地，才能明心开悟，成为真正名副其实的菩萨。这样开悟的人才是真悟，不是假悟。真悟的人，经过长期辛辛苦苦参究过程才得到果实的人，会非常珍惜和看重这个得之不易的果实，就不会退转于真心自性如来藏。</p><p>第二个关于退转的问题，退是从真心如来藏退出去，不认如来藏为真实的不生不灭的真心，而回到从前认五蕴的功能作用为真实为不灭的我的知见上，从真心转向妄心七识，继续认妄为真。</p><p>出现这种情况，最主要原因是所悟不真，知见不牢固。其中一个原因是没有经过断我见的过程，五蕴为我的我见没有断除，五蕴没有死，或者是没有死透。</p><p>另一个原因是没有长期参究如来藏的过程，对于如来藏没有一个越来越清晰透彻的认识，没有忍可于如来藏那种无我的体性，没有忍可如来藏那种无形无相的默默无闻的运行机制。对于如来藏就像雾里看花，最多就是一个理解，根本没有真正的找到和证得如来藏。也根本观察不到如来藏在五蕴身心上的运作，观察不到如来藏在五蕴身心运行当中那种清净性和无我性，以及真实性。</p><p>因此对如来藏这种朦朦胧胧的认知，就不实在，震撼不了自己的内心，也就无法宝爱真心自性如来藏，只能再去执取好像真实的五蕴功能作用为我。这就是退转以及退转的原因。真正的实实在在的明心开悟，五蕴死透，所悟非常真实，能现前观察真心的运作，不会再执取五蕴的功能作用。所以任谁劝说和误导，都不会退转于如来藏无上菩提。</p><p>三十、开悟以后转依成功的问题</p><p>关于开悟和转依成功的问题，真正彻底转依如来藏清净无为性成功的人是佛世尊，其心已经彻底究竟清净无余，无明尽，染污尽。佛世尊经过三大阿僧祇劫的修行，明心开悟以后，不断的在自他五蕴身心的造作上观察如来藏在造作世间有为法时的清净性无我性，六七识就一点点的受到了感染和震撼，一点点的随学过去，一点点的转变其染污性为清净性，越来越无我。先是断除了我执，后又断除了法执，内心越来越空，越来越无为，越来越与如来藏相像，转依的程度越来越深，直到彻底无我，断尽无明，转依才究竟成功。</p><p>其余的菩萨都是从真正开悟明心以后，六七识才开始一点点的转依如来藏的清净体性，转依一部分，染污性消除一部分，清净性增加一部分，菩萨的智慧就增长一部分，果位就跃进一个阶位，直至成佛。</p><p>如果没有真正开悟，而是解悟和假开悟，只是得知一个密意，知道一个结果，没有中间实修的过程，那就不能涉及到转依如来藏的问题，与转依如来藏不沾边。因为并没有证得如来藏，不能现前观察如来藏的运作，不知道如来藏是如何清净的，六七识没有找到榜样，那就无法随学，其心就不会变得清净。</p><p>榜样的力量是无穷的，所谓近朱者赤，近墨者黑，近如来藏必像如来藏一样无我和清净，在有为当中其心越来越无为。没有真正证得如来藏，就与五蕴近，与烦恼近，其心就无法清净，不能变得无为，没有无为性。</p><p>现在佛教里为什么流行退转之说？就是因为很多人没有真修实证，没有中间参究的过程，更没有观行断我见的过程，所以都没有实修实证。再加上大部分人禅定不足，定力不好，也不会观行思惟，不会参究，所悟不真，只知道个结果，不是打听来的，就是猜测出来的，都不是真悟，所以就有退转之说。其实根本没有修到如来藏这里，谈不到退转的问题，也谈不到转依如来藏的问题。如果非要说转依如来藏成功才是开悟，那么在转依成功之前最多就是个解悟，不是证悟。</p><p>三十一、意识也有无分别智，在证得如来藏时，就具有了观行无分别性的如来藏的般若智慧，转识成智以后，就有唯识种智的智慧。</p><p>转识成智，需要明心见性以后，修出初禅定，断除烦恼，成为三果人，然后过阳炎观和牢关，再过如梦观，具有一分唯识种智，就转识成智了。</p><p>证得如来藏以后，定力和慧力要相当好，才能观察到如来藏在各个方面的运作，甚至还能观察得非常深细，具有别相智。</p><p>三十二、明心开悟的实质内容</p><p>（一）开悟是悟本来，本来就是本来面目，就是禅师们常说的主人公，就是自性清净心。过去禅师们喜欢问来参访的学人：有主还是无主。意思是你找到主人公，还是没有找到主人公。那么我们就知道了，主人公一定是存在的，是实有的，祂不是一个虚构的假名词，不是空一无所有的概念，祂是有实体的，只是无相。那我们就不用把心放得空空的，以求与本来面目相应，因为觉知心无论怎样空，都是妄，永远不能变成真心。</p><p>众生人人都有自己的本来面目，祂是什么样的，具有什么体性，只有通过参禅才能清楚，就像六祖开悟时说：何期自性本自具足，何期自性能生万法，何期自性本自清净，何期自性本不生灭，何期自性本不动摇，五个何期。这就是找到主人公以后，智慧显发出来，证得了世出世间的事实真相，证得一个真理。</p><p>如果我们修定，让意识心处于安详状态，或者没有念头状态，见个一无所有，或者认为当下虚妄，当下皆空，当下就是，这样就是悟，那么六祖说的五个何期自性怎么解释呢？怎么能知道自性产生万法呢？怎么能知道自性出生五阴十八界呢？这些悟道内容怎么与六祖悟的不一样呢？</p><p>维摩诘经中说：菩萨举足下足皆从道场来，如果悟了自性，就应该懂得这句话的内涵，不懂一定没有悟。如果悟了自性，禅宗的那些公案应该懂一部分，般若经典也应该看明白一些，这时就应该知道佛在经中都已经把我们的本来面目，明白地告显示给我们了。如果不是这样，那么我们所悟的方向就不对了，应该及时换个方向，重新寻找参禅的目标和下手处。这样才不会耽误自己的道业。</p><p>（二）明白如来藏某些道理，只是明白了理论，并不代表证得如来藏，不代表明心开悟。开悟是要发现证得如来藏具体在何处运作，如何运作的，能观察祂的真实存在性，能观察祂运作的法的不真实性，从而真正懂得了世间的事实真相，内心真正能生起五阴身心虚无不实的感受，对如来藏生起喜乐好奇心。</p><p>真正开悟以后对如来藏的描述都有自己独到之处，非常具体真实，不是对理论的一种空洞的描述。</p><p>（三）明心见性，是明了如来藏这个心，证得如来藏自性清净心，见如来藏性，就是见佛性。这是妄心见真心，因为妄心一直有无明，不知道法界的实相是什么，把五阴世间当作真实，当作我我所，才有我执和法执，证得如来藏这个法界实相以后，才知道一切法都是如来藏变现显现出来的，不是真实的，就会慢慢断除我执和法执，从而断尽无始无明以及尘沙惑，成为一切种智。</p><p>（四）五八果上圆，不是指到佛地才证得五识，而是说在取得佛的果位时，五识和如来藏才能彻底的转变，究竟圆满的转识成智。所谓的证得五识，就是找到和知道了五识，能现前观察五识。证得五识和转变五识，距离相差极大，五识彻底转变要到佛地，而证得五识凡夫就能证得，不必是圣贤人才能证得五识。住位菩萨就能证得如来藏，转变习气要从初地菩萨开始，中间距离很大，需要修行接近一大劫之久。就像我们要找眼镜，发现了眼镜，就是找到眼镜，证得了眼镜，能拿到手里，现前观察它，看着它，这就是亲证。</p><p>发现以后，能现前观察，就是证得。而思惟到的，不一定是证得，无法现前观察，心里就没有信心；现前能观察到的，才是证得，心里有底气，信心具足。就像思惟如来藏，理解如来藏，都不是证得如来藏，而亲自发现和找到如来藏，才是证得如来藏，因为知道祂在哪里，能现前观察祂具体起什么作用，这是实际证得，不是思惟理解和想象出来的。</p><p>只有迷人才开悟，有迷才有悟，七识有迷，无始劫以来因为无明，迷失自心，通过修行，找回自心，从此就觉悟了自我。而如来藏没有无明，从来不迷，祂不需要开悟；即使是如来藏开悟，如来藏证得了自己的存在，七识还是迷茫不知，还是有无明，七识如果不开悟，仍然是凡夫一个。如来藏从来不是凡夫，也不作圣人，既不迷，也不悟。</p><p>（五）三界万法是有，这种有表面上看是存在的，是有作用的。但实质上，这些有法，就像魔幻师所幻化的一样，而且还要魔幻师时时刻刻分秒刹那的幻现着。魔幻师一旦停止心念，不再幻化时，一切有顿时消失，荡然无存。所以一切法都属于魔幻师所有，一切法都是魔幻师所为，由魔幻师掌握。魔幻师就代表了一切法，而魔幻师本身不是一切法，但有魔幻师就有一切法。既然一切法都是魔幻师所为，那么在一切法的生灭变异中，就可以找到魔幻师。这个魔幻师是谁呢？如何幻化万法的？解决这个问题是至关重要的，能直至解脱，不再有生死苦。</p><p>（六）亲证的重要性</p><p>很多人没开悟之前，各种想象真如佛性，可是开悟亲证以后，却发现，原来真如佛性是这样的，从前都是错会了。从别处听来学来的，再加上自己意识的思惟加工，与现实的差距可谓不小。想象对的，无始劫以来有几人？可能一个人也不能有。所以还是老老实实的修定观行意根亲自证明的最靠谱，要想亲自证明，就要亲自思量考量，不能把意识思惟的结果直接接受下来，当成自己的现量结论，差之毫厘，谬以千里。这点对于学佛修行，是至关重要的。</p></div>"
},{
    "title": "第三十四章　如来藏与科学",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十四章　如来藏与科学</strong></p><p>一、书本放置时间长了为什么会泛黄</p><p>书本泛黄的原因是因为纸张长期与空气中的离子等颗粒接触，发生化学反应的结果。空气中有各种化学物质，虚空中漂浮着各种气体的原子、分子、离子等等，这些原子分子离子是由四大种子组成的颗粒，四大种子是如来藏输送出来的，原子离子等颗粒由如来藏出生。书本和气体颗粒都是共业众生的如来藏共同执持的，书本泛黄是气体离子把书本氧化的作用，实质也是共业众生如来藏共同作用的结果，是众生的业力使然。一切法的生住异灭，成住坏空，都是如来藏的功用，三界世间一切法，每个角落和边缘，都有众生的如来藏共同运作。离开如来藏，世间就一无所有，也没有三界世间，也没有大千世界。</p><p>正信佛子都应该明了一切法都是如来藏的功能作用。而已在如来家的佛子，应该时时发现和感知，所接触的一切法都是如来藏的功能作用，除此无他。空气当中的原子离子之类的，就是由如来藏输出四大种子生成的，氧原子再作用于书本，起化学反应，书本就泛黄。这些无情物虽然本身没有单独如来藏的亲自执持，但是也属于众生的色尘之一，属于众生的十八界之一，因此就有共业众生的如来藏执持作用；有情众生的如来藏一直在执持维系着自己的十八界法，包括无情物。无情物的生灭毁坏，都与众生的如来藏有关，但是无情物本身确实没有如来藏变现的识心功能作用，不是众生，不是有情，是共业众生的如来藏共同执持的无情物，因此没有五阴活动。</p><p>二、各种能量都是物质色法，由夸克、中子、质子、电子、原子核、原子、分子等等颗粒组成，这些颗粒实际上都是单独存在而静止的。而在人类眼里，尤其是科研人员眼里是处于运动状态，而且是按照一定的轨道运动着。为什么实际上是静止的物质而表面上看却是运动的呢？这与四大种子的生灭流注有关系。</p><p>四大种子刹那刹那输送出来，生成了最小的微粒物质，微粒物质又互相组合，形成更大一点的微粒物质，依此类推，就组成了众生肉眼看得见的物质色法的存在现象。而四大种子生成的微粒，也是刹那生灭的，互相之间刹那组合和分散，就形成了微粒的运动形态。而且是按照一定趋势的组合分裂，就好像微粒是沿着轨道运行的一样，由于运行作用就有一定的势能和能量。</p><p>各种物理化学的反应变化，就是物质四大的变化，四大的变化就是如来藏的作用。而如来藏自己不会无事生非，一定是有意根的执取作用；意根的执取，也与六识的分别执著有关，世界一切事物的生住异灭，都是八个识共同所显现变现出来的。</p><p>任何一种能量都是四大微粒生灭变化产生出来的，四大种子组成的微粒，里面和外边如果没有空间，也就谈不到有势能和运行轨道，也谈不到有能量的作用了。四大微粒，按照一定的轨道和区域，不断组合，不断生灭，这样就产生了动能，微粒按照一定的轨道运行变化，就是所谓能量的传播。这种传播表面上就具有了一定的力度，就是所说的引力和重力之类的力量和能量。</p><p>一切物质的运动和变化，实质就是四大种子生灭代谢的作用；物质的运动，也就是生灭代谢的结果，生灭的表面也能表现出一种趋势和能量。量子物理学中认为，夸克、轻子、玻色子是目前科学已知的构成物质的基本粒子，它们组成了质子、中子、原子、分子直到宏观物质。那这几种基本粒子，还能再分吗？分到不可分处又是什么呢？有质量还是没有质量？人类的科学到这时就很难观测和测量了，因为在这个量级上，已经没有更精密的仪器能够观测得了的，人类的肉眼功能也不能更微细，已经到极限了，物质颗粒接近于四大的状态，肉眼和仪器已经没有办法了，只有佛的天眼、法眼和佛眼才能观察最极精细的物质颗粒。所以佛是无上士，佛法永远超越于人类的科学，永远能解决人类所无法解决的问题。</p><p>量子力学的理论和广义相对论本身就有一些无法调和的矛盾，所以又有科学家提出了弦理论。虽然弦理论最开始是要解出强相互作用力的作用模式，但是后来的研究则发现了所有的最基本粒子，包含正反夸克，正反电子，正反中微子等等，以及四种基本作用力“粒子”（强、弱作用力粒子，电磁力粒子，以及重力粒子），都是由一小段的不停抖动的能量弦线所构成，而各种粒子彼此之间的差异只是这弦线抖动的方式和形状的不同而已。</p><p>不少科学家认为，弦理论很可能成为终极理论，这个理论还在探索发展中，无法获得实验证明的原因之一是，目前尚没有人对弦理论有足够的了解而做出正确的预测。另一个原因则是目前的高速粒子加速器还不够强大，科学家们使用目前的和正在筹备中的新一代的高速粒子加速器，试图寻找超弦理论里主要的超对称性学说所预测的超粒子。</p><p>从我们佛学的角度来说，我们也同样认为弦理论更接近于真相，因为我们知道一切物质是四大种子在连续的刹那生灭中产生的一种现象，这与弦理论中认为所有粒子都是由一小段不停抖动的能量弦构成很相似，如果弦理论进一步的研究成果出现，可能就会发现，这个能量弦的不停抖动其实就是四大种子刹那生灭所产生的一种现象。</p><p>四大种子从如来藏生出，又回到如来藏里，前一个生灭与后一个生灭极其快速地连续起来，给我们的错觉就是出现了各种粒子的运动状态，产生了能量，产生了运动，产生了整个物质世界。四大种子构成的物质的宏观表现是成住坏空，微观表现是刹那生灭，宏观和微观都是生灭无常，这些都是物质发生改变的秘密。</p><p>现代最伟大的科学家爱因斯坦在其自传中说过，“未来的宗教将是宇宙的宗教。它应当超越个人化的神，避免教条和神学，涵盖自然和精神两方面。它的根基，应建立在某种宗教意识之上，这种宗教意识的来源，是在把所有自然的和精神的事理作为一个有意义的整体来经历时得到的体验。佛教正是以上所描述的那种宗教。如果有一个能够应付现代科学需求，又能与科学共依共存的宗教，那必定是佛教。”</p><p>中国著名科学家朱清时在其演讲《物理学步入禅境——缘起性空》一文中最后说：“科学家千辛万苦爬到山顶时，佛学大师已经在此等候多时了！”由此可见，佛法不是一个宗教，它是包罗宇宙森罗万象的真正的智慧，而我们修证佛法，就是打开自己的心量，最终获得最大而全部的智慧。</p><p>三、问：把酸和碱两种物质放一起，会发生反应，生成新的物质“盐“，酸和碱为什么会自动发生中和反应？</p><p>答：物不自物，因心故物。楞严经中佛说过，如果认为一切法都是自然性，那就是自然外道；如果认为一切法都是因缘性，那就是因缘外道。一切法的本质都是如来藏性，才符合真理和事实。物理化学反应都是如此，都是如来藏性，酸碱中和反应不会自动自觉出现，都是如来藏在其中所起的作用。</p><p>酸碱化学物质当中的分子、离子等等物质，是由如来藏四大种子组成的，四大种子刹那刹那生灭，形成了分子离子等等的运动，四大微粒的生灭代谢，造成了离子的运动，产生了叫作能量的东西，能量与能量之间，会产生吸引和排斥现象，有吸引和排斥力，就会发生化学和物理反应。</p><p>能量是由于四大种子的不断变化，不断生灭运动而产生的。一切物质的生灭变化，都是由于四大种子的输出又回收造成的，物质只要四大种子的数量比例成分发生一点点变化，物质一定会发生变化。四大种子生出来，又回到如来藏中，这个循环过程，就有能量的产生。</p><p>而且火大本身就是能量，风大的作用也会产生能量，地大和水大的作用，都能形成能量，所以物质能够伤害到众生，有破坏作用，地大有坚硬支撑作用，水大有滋润润滑作用，也有承托等等作用。四大组成的原子分子结构不同，物质所具有的能量就不同。化学反应，原子分子运动中各种能量之间的反应，都是四大种子的数量比例在其中发生变化的结果。</p><p>四大微粒生灭变化不一样，原子电子等等的运动就不一样，形成的能量趋势也不一样，或者叫作运动的方向不一样，那么两种物质遇到一起，就会出现两种情况，或者相互吸引，发生化学反应，或者相互排斥，不会发生化学反应，物质本性就不变。同类物质里的电子原子运动的形式方向相同，就没有引力作用，也就不会发生化学反应。物质性质的变化是因为四大种子数量比例结构发生变化了，物质就改变了属性。而酸和碱是两种不同属性的物质，其化学分子式不同，物质结构不同，四大种子的形成的微粒的运动方向和形态就不同，物质颗粒运动时，遇到以前，就会产生相互吸引的作用，就会形成一种新的物质“盐”，这就是化学反应的奥秘。</p><p>四、减肥的原理</p><p>某人嫌弃自己180斤的体重太胖，通过运动和减少饮食，瘦身到140斤的标准体重，此人减掉的40斤肉哪里去了？肉由地水火风四大种子组成，四大种子从哪里来？是从如来藏里输送出来的。如来藏根据众生的业缘，不断的输送四大种子来维持和改变色身，其中四大种子的比例成分和种子数量要不断的发生改变，与众生业力和业缘相应。那么有人通过运动和减少饮食，想要减肥，如来藏配合意根的想法，通过调用和不断改变四大种子，就会排除多余的脂肪和水分，身体就瘦下来了。</p><p>可见减肥的实质，是如来藏在背后配合五阴、意识和意根所完成的，还有前五识。如果减肥不成功，一是因为众生的业缘所感，二是手段方法还不适当，因缘不成熟，如来藏暂时满足不了意根的要求。每个人为了未来世有个匀称庄严的外貌，就要多造善业，不造恶业，尤其是不造杀业，身体就会健康，就不会感得不合心意的外貌。</p><p>真实的情况是，色身是刹那刹那生灭变化着的，既然身体是刹那变化的，从四大种子的角度来思惟，种子是刹那生灭的，四大种子随时随地在调换，种子能输出来又能回到如来藏中，这样身体也就能随时随地发生改变。</p><p>四大组成的最微小的微粒是什么？在身体里是细胞，细胞里有质子、电子、原子、分子，这些颗粒最后组成了细胞。细胞组成了什么？细胞不断的累积组合，最后组成了血肉、筋骨、五脏六腑等等物质器官。物质器官刹那刹那都在发生变化，后一刹那已经不是前一刹那的物质了，所以色身是刹那刹那在不断生灭变化的。而色身的变化，要依循着自己的业缘，不会违背前世和今世的业种和业缘。所以一个人的高矮胖瘦，美丽丑恶，都由自己的业所决定，由如来藏来实现。另一方面，也与生存的环境和临时因素有关，比如气候条件、不适当的饮食等等。</p><p>如来藏是如何实现色身改变的呢？如来藏吸收饮食里的四大营养元素，让细胞不断新陈代谢，身体就不断发生变化了。细胞由水、蛋白质、脂肪、微量元素、矿物质组成。水是由氧原子和氢原子组成的分子结构，原子是由原子核和电子组成，原子核是由质子和中子组成，中子是由夸克组成，夸克是由地水火风四大种子组成，四大种子来自于如来藏。同理，矿物质、蛋白质、微量元素等等也是由分子、原子、电子、中子、夸克组成，最终由地水火风四大种子组成，由如来藏变造。细胞里各种物质的四大不同，细胞的营养就不同。饮食不同，如来藏吸收的营养不同，细胞的组织结构就不同，新陈代谢就不同，身体的机能就不同，健康程度就不同，高矮胖瘦也就不同。细胞发生变化，肌肉就发生变化，人就有胖瘦；运动消耗能量，排除水分，身体就能改变，或胖或瘦。那么减掉的四十斤肉哪里去了？实质是来无所来，去无所去，物质色法生灭代谢而已，四大种子刹那生灭而已，如来藏依业缘不断变造而已，没有实质的物质色法肌肉之说。</p><p>五、物体重力和地球引力是如何产生的</p><p>所谓的重力和引力实质都是如来藏的功能作用。共业众生的如来藏依据众生的业力，不断的输出四大种子，以维持地球的自转和公转，维持地球的存在和运行。共业众生的如来藏也不断的输出四大种子以出生和维持各种物质的产生和存在。由于物质色法中四大种子不断的生灭变异，形成了一种物质生灭的运动趋势，能使得地球按照一定的轨道运行。地球内部的原子、质子、中子、核子、电子之类的运行也有一定的轨道，这些轨道也是四大微粒生灭变异形成的，是四大生灭的痕迹，这样地球物质内部的运动也有一定的趋势，会产生一种能量，于是地球就有了向心力和引力，地球上的物质要受到地球运动产生的向心力的影响，好像就有了重力。</p><p>物质在内部四大种子形成的微粒不断的生灭变异过程中，能产生各种运动的力量和能量。这些运动的力量是四大微粒在相互的作用中，各个方向、各种不同性质的力能形成一个合力方向，这就是事物运动与形成的方向，就是物质运动的趋势，就是一种能量和惯性作用。四大微粒作用的合力与分力，又会促成其他物质的运行与产生，这就涉及到了物质微粒的裂变。裂变能形成正负，正负和合，又产生聚变，各种层次的正负又杂和，如此聚变与裂变交相混杂，就在能量变化中实现了宇宙的生成。裂变又是如何形成的呢？是什么在裂变呢？又是什么促成了裂变呢？裂变和聚变都是如来藏依众生的业力输出四大种子形成的微粒生灭变化的作用，是如来藏出生物质色法的法则，也是如来藏促使物质灭去变异的法则。</p><p>如果只说共业别业创造了世界，这还不够深细，特别是在当今世界量子物理学、多重空间、弦理论、平行宇宙等理论已如此深入的情况下，我们大乘菩萨尽量要能配合前沿科学，把佛法把宇宙器世间探讨得更微细更细致，为众生解决更多的谜团。宇宙的生成特别复杂，如同我们背后拉着橡皮筋走迷宫，虽然走到繁杂混乱到极致，但我们顺着背后的皮筋，感受着它的弹性牵拉，总是可以走出来，这就是对佛法修行的贯通。依止于如来藏，学佛就是提纲挈领，抓住如来藏以及七大种子的纲领，我们就不会被各种复杂的现象所迷惑了。</p><p>一切物质的生成和发展都是如来藏所现起的幻相，这些现象就好像大海的潮起潮落、浪生浪灭一样。海水的起落促使海中的物体被动的在海中飘动，被动的涌向岸边，实际上物体本身是不动的，是海浪的生灭变动促使了物体按照波浪运动的方向而漂浮。大海相当于如来藏，海浪相当于四大种子，海中物相当于如来藏用四大种子生成的物质，物质本身是不动的，由于四大种子的刹那生灭，而且有一定生灭的方向和趋势，于是导致了物质的生灭变异有一定的趋势和轨道。实际来说，物质的运动现象是假相，物质没有能动性，也不能动，是四大种子刹那生灭导致物质的刹那生灭，其生灭的迹象和趋势，造成了物质运动以及运动轨道的幻化相，都是不实的，是如来藏的功能作用使然。</p><p>宇宙中各个星体的运行规律都不一样，地球有引力和向心力，在其他星球上就没有引力和向心力，物质也就没有重力，到其它星球上就会有失重的现象发生，这实际上也是由众生的业力所决定和感召的一种宇宙器世间存在的现象，是由众生的业力所决定的。比如恒星世界有恒星世界的运行规律，行星世界有行星世界的运行规律，地球有地球的运行规律，月球有月球的运行规律，生活在不同世界的生命就要受到相应规律的制约和限制。就像众生在六道中的生存环境不同，其自由度就不同，不同星体的众生生存环境不同，其自由度也不同，就是因为所处世界的运行规律和法则的不同。观察现实生活中，我们能发现任何事物与现象的形成与发展，都是有一定规律的。规律是由业力决定的，宇宙器世间的所有现象和运行规律、物理化学和各种科学的规律，也都符合众生的业力，与众生的业力息息相关。</p><p>宇宙器世间一切法都是如来藏创造出来的，但是如来藏创造一切法，是有其规律的，祂完全依据众生的业种，不能随意而造。同样一个物质，由于众生福德不同，所显现出来的品质也不同，这就是业力的作用，也是各自的如来藏的作用。任何事物的运动与形成，都是业力作用的结果。万事万物看似杂乱无章，纷繁复杂，不可捉摸，但只要我们在现实生活中运用佛法的智慧，仅仅围绕着如来藏，仔细观察与思惟，就会发现，一切都是业力作用的结果，都是如来藏执持与变现的结果。当众生的业改变了，规律就改变，正报的色身和依报的生存环境就改变，改变到彻底究竟，不能再改变时，就是佛的正报和依报，众生即成佛。佛眼里的世界和我们众生眼里的世界，差别太大了，就是因为福德和业的差别不同所致。</p><p>为什么如来藏输出四大种子，种子不断的生灭变异，就能形成物质色法的运动和能量呢？我们想想打台球时，球的碰撞，一个球碰撞另一个球，不断的传导下去，就是一种运动趋势，也有一种能量。每个球体就好像是一个种子一样，球的静止就相当于种子灭去一样，在一个球体上施加某种程度的力量，就相当于如来藏输出种子一样，然后球体的传导，就形成了运动趋势，就是所谓的能量。这也相当于四大种子的生灭，使得物质不断的生灭变异，这样就促成了物质色法的表面运动，这种所谓的运动就产生了所谓的能量。为什么台球相碰到最后变成了静止？因为由于众生业力所致，四大种子生灭的趋势总要发生变异，趋势要减弱，减弱到最后就静止。四大种子就像台球一样，不断生灭又生灭，就形成了一种趋势，一种能量，而且有一定的运动规律，有一定的运行轨道。这样就形成了物质色法的运动和能量。</p><p>物质之间的能量能相互转换，比如水能转换成电能，物质运动能转换成热能，说明物质四大组成的微粒，其生灭变异是有能量伴随着出生的。物质不同，能量的形式不同，各种能量之间能够互相转换。物质运动的能量是如何产生的呢？是如来藏输出四大种子形成的微粒生灭变异的结果。水能转换成电能是因为什么？是如来藏输出四大种子形成的微粒不断的生灭变异的结果。动能转换成热能又是因为什么？是如来藏输出的四大种子形成的微粒不断的生灭变异的结果。四大种子形成的微粒是一种生灭幻化的假相，这个相的变化可以反映出如来藏的实质运作规律，我们可以籍此再向上推导，那就能推导到一切法的源头了，到最后就能证明整个世界就是一真法界。</p><p>六、问：大地里的种子在阳光雨水具足时自然就发芽了，如来藏是否一定要去变现这些树木植物？</p><p>答：三界唯心，三界里的一切法都因有如来藏而存在。如果说地里的种子是自然生长的，无异于自然外道，离开真心而说有物能独立存在，就是心外求法的外道。如果没有如来藏，就没有大地；如果没有如来藏，就没有阳光；如果没有如来藏，就没有雨水，如果没有如来藏就没有物种；如果没有如来藏就没有物种的发芽和生长，众生也就没有食物可吃。</p><p>其实三界这一家子事，不管是宇宙器世间，还是山河大地、动植物，所有的有情无情，都是如来藏变现和执持的，没有一个物不是如来藏祂老人家操劳出来的。如来藏养了五阴三界这一大家子人，添置了无数的财物，事无巨细，全部包办，可是从来不喊辛苦，真是神人也！地里生长植物，大地是管不了的，大地不是有情，没有心，没有主动性，它只是出生植物的一个缘而已，因此所有东西都不是大地生的，大地没有能力出生，它自己还得靠如来藏管理，都不能做主，没法管理植物的生长。</p><p>我们众生的五阴身都是受如来藏照顾着的，所需要的一切都是第八识如来藏给予的，众生知恩报恩是非常不容易的。何况无数众生无明深重，还不知道如来藏的存在，不知道如来藏是干什么用的，众生并不知如来藏的恩德，没有证得如来藏，看不见祂如何耕耘之故。</p><p>有人做一点事就叫苦不迭，要功劳要苦劳，可是如来藏，无始劫以来做了多少事，一句话都没有说过。光是地水火风这四个原材料的搭配组合，就已经让人头晕，无所适从了，可是如来藏给搭配调和得井井有条，井然有序，丝毫不违背因果，谁能做得到？养的七个孩子是那样的不听话，成天惹是生非，打打闹闹，纠葛不断，如来藏既要容忍，还得要给祂们喂食喂料，事事照料，多么不容易，可是如来藏从来就没有呵责过七识一句，也从来没有抱怨过。对比之下，就能感觉到如来藏的伟大是没有任何词汇能够形容得了的，我们只有完全的学习效仿祂，才能向祂一样的自由自在，无有生死，了无挂碍，得大解脱。</p><p>七、问：地球、天界、四大海水、七金山以及宇宙星空中的所有星体都在虚空当中存在，是虚空承载和执持了这些星体吗？虚空能起这些作用吗？物质色法是有法，所以物质色法能增加和减少，能改变，能毁坏。但虚空能改变能毁坏吗？虚空有什么用呢？</p><p>答：接触认知到的一切法，都是相；色声香味触法、五阴色身、七识心都是相。物质色法有边际，虚空没有边际，说明虚空不是什么东西。十方诸佛国土都在虚空当中建立，虚空也不减少。当我们这些众生都成佛时，都有自己的佛国土，而这些佛国土都在虚空当中建立，虚空也不减少，仍然是无边无际。乃至于将来所有的细菌蚂蚁也成佛时，也各有自己的佛国土，这些佛国土都在虚空当中建立，虚空也没有改变，不增不减，仍然毫无边际，不可限量。如果虚空有边际，就能增加和减少，那也就不叫作虚空了。</p><p>宇宙当中星体之间靠着相互的引力和重力以及众生的业力来存在和运行，不是靠虚空承载。重力引力就是能量，能量有四大种子本身特有的属性，四大种子形成的微粒，无数个生灭相续形成了微粒虚妄的波动现象，波动就能产生能量。四大种子形成的微粒生灭相续，互相撞击传导能量，使得微粒能够按照一定的轨道而生灭相续运行，也就形成了引力和重力。物质之间就会互相吸引、执持和排斥。</p><p>物理作用和化学反应，也是如此道理。都是众生的所有如来藏共同生成作用的结果。一般来说，物体越大，共业的有情越多，参与变现的如来藏越多，其能量越大，生住异灭的周期越长。物体越小，参与变现的共业有情越少，形成和生灭的越快速，能量也越小。宇宙器世间当中某个星体的形成，三界九地当中的某一地的生存环境的形成，都是共业有情的如来藏共同成就的，依着众生的共业来变造。必须是所有共业众生的业种都同时成熟时，各自的如来藏才能同时都输出业种，输出四大种子，然后所有的如来藏共同用这些四大来变造各种生存环境，互相都是协调一致的，所以共同变现的物质色法是有很多条件制约的。</p><p>共业的范围越小，有情数量越少，各自如来藏共同变现的越快速，其制约的条件越少。因此三千大千世界的变造是极其缓慢的，可能需要几个大劫，一个星体比如地球的形成需要四分之一大劫，也就是二十小劫。而某个地区的变造其时间就要相对少些，比如某地山脉河流的形成，某个国家的建立等等。范围再小些，某个小区域的建设，某一处房屋田宅的建设，就比较快速。更小的桌椅板凳的制造，单件衣服的缝制，那就更快速了。因为涉及到的有情数量非常少，参与合作的如来藏少，业种实现的就快。</p><p>宇宙器世间各种色法，形成的过程漫长，其毁灭的过程也同样漫长。娑婆世界星体的毁坏也要四分之一大劫，就是二十小劫的时间，暂住的时间也是二十小劫，彻底毁坏以后的空无时间也是二十小劫。然后再经过一大劫的时间，再从头开始生住异灭。而涉及到共业比较少的物质的生住异灭，其周期就短，地球上的苍海变桑田，桑田变沧海，其周期就在几百万年之间。</p><p>八、世间的能量都是如何形成的呢？能量是由生灭的现象所产生的，一生一灭，一生一灭就是动，这个动就是能量，而且四大本身就具有各自的能量，这个动性就是四大种子的生灭性。四大种子总是在生灭变化着，而且生灭变化得非常快，还是沿着一定的轨道来生灭，那就产生了能量，能量就按照这个轨道发射出去，都是由生灭现象所产生的能量。</p><p>七识心也是一样，识种子也是在刹那刹那的生灭，这种生灭现象就有一定的能量，但是这个能量与物质的能量是截然不同的；这个能量指的是一种能力，能够识别了别的那种力，这是一种力量。能量也是一种力量，包括心的力量，也包括物质的力量，物质的力量就是物质运动的力量。物质运动也就是四大的生灭变化作用，还要加上外力，使得四大的变化沿着一定的轨道，这些东西可能就是现代科学家量子力学研究的方向。这个力是这么产生的，力的产生是由生灭现象散发来，反映出来的；没有生灭，就没有力；有力就代表世间一切法都是生生灭灭的，无穷尽的生灭下去。或者力是在一段时间内，物质的生灭现象所产生的能量。</p><p>九、量子力学最根本的理论之一：远隔很远距离的物体可以瞬间互相作用。</p><p>这是如来藏的作用，一切物理现象、化学现象、数学问题、心理现象和生理现象等等一切世俗科技现象，都是如来藏的作用，离开如来藏一个现象也不存在，一片空无，连空无也没有。</p><p>如来藏里没有距离，多远的物体都受如来藏调控和左右。如来藏也没有时间，所以说一个光速，已经是很慢了。物体里四大种子不断的刹那生灭，一生一灭的过程，向外传递四大微粒，也就是能量。所以物体即使是静止不动，也有其相应的作用，有磁场效应，有引力作用，物体之间就存在着相吸和相斥的作用。</p><p>同样人体之间也存在着这样的效应，存在着磁场，有相吸和相斥的现象。两个人之间，不仅存在着前世的因果因缘关系，肉体的磁场作用也不可忽视。我们经常看到两个人或者是多个人相处，与某个人接触，心里有种反感和堵心的现象；而与另外的某个人接触，就产生愉悦感，身心舒畅，这不仅是缘分的问题，也与色身的磁场有关。当一个人安静独处时，另一个人过来，内心就不安静了，那个人的磁场把自己的磁场破坏了，两个磁场起了冲突，当然也有相反的现象存在。</p><p>物体之间，存在着共振现象，都是磁场作用，是物体的引力作用，实质都是如来藏的作用。如来藏依据业缘，不断的执持和改变物体的四大种子，物体上就要不断的改变四大种子，向外释放四大微粒，产生磁场效应。也就出现了量子力学、量子纠缠现象，其中四大微粒的运行生灭的速度，就决定了能量散放的速度。这些现象都是如来藏不断调动、输出和收回四大种子的结果，当然是共业众生的如来藏共同作用的结果。</p><p>还有风水问题，也是磁场效应的问题，也是如来藏的作用使然。不仅外界宇宙空间山河大地的风水影响一个人的磁场和心境，与色身最近的房间里的风水，也能影响一个人的色身和心境。所以在不同的环境修定，其身心反应也不同。房间里物品太多又凌乱，能扰乱磁场，致使身心不安宁，不清静，修定效果就不好。</p><p>磁场信息是一种能量，这种能量能存在一定的时间，才能完全灭除。比如一个人离开房间，房间里还有这个人散发出去的体温和气味，以及我们暂时还认识不到的其他物质能量，有神通的人能感知到，味觉灵敏度高的动物如狗能感觉到，公安局破案靠这样的信息，蛇也能感觉到一段时间以前有人住此，就会循着气息的痕迹追到人。人走过的脚印里，就留着人的气息，狗就可以一路追踪。这些气息都是如来藏执持着，可能要变成共业众生的如来藏共同执持。</p><p>十、物质色法的虚妄性</p><p>眼镜能辅助眼根见色的原理是，透明的物质能够传导色尘，也就是说色尘能够通过透明的镜片之类的物质，不被这样的透明体所遮障。眼睛近视或者是老花眼的人，外色尘进入眼根就有障碍，在后脑胜义根变现的内相分色尘就会与外色尘有差别，影像模糊不清，眼识意识就了别不清。如果带上近视眼镜或者是老花镜，就能辅助眼根传导外色尘，如来藏就会通过眼镜镜片的传导作用，在胜义根变现出清楚一些的内色尘，眼识意识就能把内色尘了别的清楚一些了。</p><p>再比如放大镜，能把外色尘上的光波光子稍微分散开，这样色尘就变大了；放大了的光波光子通过眼根的视网膜和传导神经系统传导到胜义根，眼识所见就是一个放大了的内色尘——外色尘的影像，这样眼识就能了别得到，看得清楚。可是放大了的色尘，与没有进入放大镜的外色尘是有一定差异的，眼识了别后，就会感觉不真实，影像不够清晰。那么通过放大镜所见的色尘，就是虚幻的，不实的。眼根所见也类似于使用放大镜和眼镜的原理，也是不真实的。</p><p>外色尘是由四大构成的物质色法，包括色声香味触。四大最初先组成极微小的最微小的微粒，比如夸克之类的粒子，粒子又不断的聚集，形成越来越大的微粒，比如核子、电子、原子、原子核、分子、离子、光子等等，再聚集就形成有形的物质色法。物质色法不断的生住异灭，因为如来藏要不断的输出和收回四大，四大种子要不断的生灭变异，那么物质就会不断的生成和释放四大微粒。</p><p>如果眼根要见色，与物质上释放出的微粒或者叫作光子的东西相接触，如来藏摄取这部分光子，这部分光子通过眼球的玻璃体，通过光电效应激发出电子，电子通过神经系统传导到后脑胜义根，最终成为内色尘——物质的影像，被眼识了别到，就叫作见色，色尘就在心中显现出来了。这中间经历了这么多的转化和传递，已经和真正的外部世界的物质有了一定的差别。即使眼根完全正常，色尘上的微粒光波光子等通过眼根的传导也会出现一定的变异，不完全是传导之前的色尘了。</p><p>这就像你用眼睛看，和用放大镜看，用显微镜看，看到的世界现象就不能完全一样。也就像物体在水外和水里，经过水的折射作用，其所显现出来的影像，就与水外的物体有所差别，不完全一样。也就像我们带有色眼镜所见的物体与不带眼镜时所见的物体有一定的差别，不完全一样。在眼根出现眚病时所见的色尘与正常眼根所见的色尘有一定的差异，不完全一样。从这些事例可知，物质色法经过各种传导器的传导，就会出现改变和变化，不完全与传导之前的色法完全一致，其中的改变，是随着传导器的不同而不同。</p><p>眼镜是一种能够传导色尘四大微粒的透明器具，对光波和光子没有阻碍作用，可以作为传导光波光子的传导器，以辅助眼根的传导功能，弥补眼根功能的不足和缺陷。但是其传导功能与眼根还是有一定的区别，并不能完全如实的传导所有的光波和光子，因此通过眼镜传导的光波和光子，到达外眼根和胜义根以后，就与外界没有经过传导的光波光子有所不同，那么众生所见就与外界实际色尘有差异，并不能完全如实的反映出物质色法的原貌。可见，众生所能见到的世界是不真实的，是虚幻出来的。而众生所见不到的外部世界原貌，也是共业众生的如来藏在不断的出生、执持和改变着，因此也是虚幻不实的。</p><p>同理，助听器也能辅助耳根传导外声尘，让耳识能听清胜义根内的内声尘。外声尘是四大组成的物质色法，其微粒能够透过不同的物质色法进行传导，而且声尘之间没有障碍，不像色尘那样互相之间有遮蔽的现象。声波相对于光波更加微细一些，其障碍比较少，可以穿过墙体、铁器、木器等等非透明物质，也能穿过透明物质。因此人类就能通过助听器来传导声波，把声音的微粒传导到后脑胜义根，形成内声尘。</p><p>当然不管是透明物质还是非透明物质，都不能主动的有任何传导作用，世间一切的现象都是心识使然，是心识的功能作用，非心的色法没有什么作用，其作用也都是如来藏的作用，是如来藏通过各种物质器具传导色尘和声尘，以及香尘、味尘和触尘，任何物质都没有主动传导的作用，只是不阻碍如来藏的传导作用，和出生万法的作用罢了。因此说，一切的物质色法，包括色声香味触法都是被出生，被变现，被传导，被整合，被幻化出来的，都是生灭变化不实的，我们都不可以认为是实有而去执著。</p><p>十一、地球、天界、四大海水、七金山以及宇宙星空中的所有星体都在虚空当中存在，是虚空承载和执持了这些星体吗？</p><p>物质有增减性，能增加和减少，能改变，能毁坏。物质色法是有法，但是虚空不是物质色法，是物质色法边际的一种无物质的色，不是四大组成的色，是空大种子形成的色，因此没有物质那种增减性，没有变化性。眼识见之，是见个一无所有的空，见不到物质色法，空是可见之法，见个无物的相貌为见空。虚空既然不是物质的，就不能改变，不能增加和减少，也不能毁坏，物质才有这些现象。</p><p>虚空没有边际，说明虚空不是什么东西，是没有什么东西的东西，才没有边际，没有界限。十方诸佛国土都在虚空当中建立，虚空也不减少。当我们这些众生都成佛时，都有自己的佛国土，而这些佛国土都在虚空当中建立，虚空也不减少，仍然是无边无际。乃至于将来所有的细菌蚂蚁也都成佛时，十方世界再也没有众生时，所有诸佛也都各有自己的佛国土，这些佛国土都在虚空当中建立，虚空也不会改变，仍然不增不减，没有边际，不可限量，因为它是空的。</p><p>宇宙当中星体之间是依靠着相互的引力和各自的重力以及众生的业力来存在和运行，不是靠虚空承载的。虚空是一种特殊的色法，都是如来藏的变现和执持作用，是如来藏输出空大种子产生的现象。</p><p>其中星体物质的重力和引力可以说是一种能量，能量有四大种子本身特有的属性，四大种子形成微粒以后，微粒的无数个生灭相续形成了虚妄的波动现象，波动就有力量，就有能量。四大种子形成的微粒生灭相续，互相撞击传导能量，使得微粒能够按照一定的轨道而生灭相续运行，也就形成了引力和重力，物质之间就会互相吸引、执持和排斥。</p><p>十二、波粒二象性</p><p>四大微粒具有波动性和粒子性。波动性，说明粒子态极其微细，肉眼不可见，因为微细，才呈现波的状态，也说明四大微粒非常多。动，是四大种子的不断生灭，导致了粒子有规律的波动状态。说是混乱，其实都是有规律可循，粒子是有轨道生灭的，呈现运动状态。之所以粒子能运动，里面有空大种子形成的空间和空隙，那么所有物质都是由五大种子构成。</p><p>不过科学家发现的物质没有实质的物质，都是波动的形态，这是符合佛法的。色法由四大组成，四大微粒不断的生灭变化，如果有透视眼，看到的就是微粒波动的各种不同现象，一堆粒子的动态，没有实质的物质色法，这就是如来藏的功能作用，是如来藏性。科学家观测到的接近于事实了。我们学佛者只是信佛说，观察不到事实，不知其所以然。</p><p>光和光速是两个概念，光是物质色法，光速是心不相应行法，不属于心所有。量子力学里面有我们佛法所需的重要证据，里面涉及到如来藏出生的四大种子运行方面的秘密，这可以更深入的了解和观行如来藏对万法的出生和执持作用，也能了解到如来藏在宇宙器世间运行当中所起的作用。</p><p>能量也是四大微粒，属于物质色法，是四大微粒运动的趋势所形成的，有时单独存在，有时依物质存在。物质分到最后微尘的时候，是极其微细的物质色法，叫作能量也可以。依义不依语，只要是正确的意思，表达有误都没关系。</p><p>时间是心不相应行法，并不是真正存在的东西，依物质色法而有，比如依太阳的转动，依地球的自转和公转，才能有时间的显示，所以时间不能划分为暗物质里，它不是物质，也不是心法。</p><p>物质世界也来自于三个能变识，如果科学家、物理学家、生物学家等等都知道是有第八识创造和维护一切物质色法，也知道有第七识意根在推动第八识的创造和变革那就好了。创造物质的想法来自于第六识，第六识的想法传递给意根，那么意根做决定，做决定之后，第八识配合，三能变识和合，创造了物质世界。</p><p>世俗里各个领域的研究者，只要能信受如来藏，再证得如来藏，那个智慧就了不得。可是他们缺少善根和大乘法的福德，心不皈依佛门，不皈依三宝，对不生不灭之理就接触不到，掌握不了。</p><p>像这些内容都属于道种智方面的，很深细，娑婆世界的佛经里没有。佛不讲太具体和深细的唯识种智内容，只讲个大框，让众生能修到地前菩萨的层次就可以了。深细而具体内容专门给地上菩萨讲，跟在佛身边才能学到。</p><p>我们现在应该明白了，佛说自己已经讲出来的法如手指甲里的土，没有讲的法，就像大地上的土那么多，道种智的内容该有多么深、广和细，包括了方方面面，世间各个领域。</p></div>"
},{
    "title": "第三十五章　如来藏杂谈",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十五章　如来藏杂谈</strong></p><p>一、如来藏里的信息是共享的</p><p>如来藏都在互联网里，随时随地往外发布自己五阴的信息，一点也不保密。然后如来藏从另一个如来藏获取的信息，让意根知道了，意根就了别到那个五阴的信息，这就是众生之间的感应和互通的关系，也叫作如来藏信息共享。如来藏能随时随地摄取五阴身外界的一切信息，意根也能随时随地缘到六尘境界，对自己有用的，重大的信息，就要警觉意识知道，不重要的信息，意根自己就处理了，或者是不理，或者是存在如来藏里。</p><p>如果众生六识之间能够共享信息，没有隐藏，都是透明的，没有阴暗角落，就没有杀盗淫妄，那世界该有多好，活着该有多轻松愉悦。诸佛之间的心都是透明的，没有遮掩的，有神通的菩萨之间，心也是透明的，没有遮掩，这样的生命质量才是最高的。</p><p>二、诸法实相，是说在诸法生生灭灭当中，有个真实而永远不生灭的实相心存在。因为有这个不生灭的实相心存在，才值得我们无量劫去努力追求，坚定不悔地奔向佛道，不管遇到多少挫折和困苦，直至圆满成就佛道。如果没有这个实相心存在，那么一切的努力都将化为泡影，因为众生死亡后，就会一了百了，所修一切都会化为乌有。既然如此，我们学佛就没有用处，修那些善法也没有用处，因为善恶业都不能存种子，后世都将没有果报。</p><p>正因为有这个实相心存在，我们所修行的一切善法种子才能够得以收存，下一世以这个善业为基础，又能接续往上进修，那么学佛修行就功不唐捐。因为每个人实相心里所存的福德种子和业种千差万别，那么修行到成佛的时间，长短就不一，所受的业果报就不相同，因此离开实相心而修行，就犹如水中捞月。</p><p>阿罗汉们修行虽然证得五阴我空，没有证得如来藏实相心，但是都信佛语，首先都知道有个不空的所知依实相心存在，他们才能断我见，断我执，然后才敢灭掉自己，入无余涅槃。因为他们知道灭掉自己以后，还有个不灭的存在，不是断灭空。小乘是先知法住，后证果位和涅槃。知法住就是知道有真实的实体法存在，所以他们证果后，没有一个会谤大乘如来藏的，知道大乘如来藏的重要性。</p><p>这个实相心是如此的重要，没有祂就没有一切，了解和证知如来藏，就能破除无明，消除业障，了知越多，破除的无明越多，无明破尽，生死了然不相干，那就再也不用惧怕生死。其实菩萨们在证得真如时，就知道生死是一种假相，能了生死而不了，在一次次的生死当中，自由穿梭往来，度尽苦难众生，魔王一点办法也没有。</p><p>三、胡来胡显，汉来汉现。如来藏就像一面镜子，谁来照谁，一切法犹如镜中像，都是由如来藏如镜现像般地所显现出来的。大地山河犹如镜中像，色声香味触法犹如镜中像，镜外无物，心外无有一法。但是众生心不同，所现像也不同，因此一个像现出来，各人的心不同，就会生出不同的观点、意见和看法，互相争执，互相纷争，世界就不太平。</p><p>昔有三人去印度朝拜观音菩萨，进入石洞中，三人面对同一观音菩萨像，由于修行道行不同，所见的像就有差别，一个人见的是观音菩萨的出家像，一个人见的是在家像，一个人见的是观音菩萨带帽像，且所见的身色也大不同。外相分都是相同的，各人看到的内相分却有差异，那就说明各人心的境界不同。</p><p>同样是一条河，人看是河水，天人看是琉璃，饿鬼看就是火焰，福德不同，所现的像就不同。可见像是唯识所变，八个识和合变出来的。众生修心，心变清净了，娑婆世界的土地就会变成黄金地，与极乐世界不差分毫。是心作佛，是心作饿鬼，心完美清净了，还用求生西方，又求生东方的吗？迷人修相，不修心，修得百劫不见相好。</p><p>四、有人说自性本来就有，不用找，众生本来就是一尊佛，还用找什么求什么，一切法都是如来藏的妙用，因此不用找自性。如果不用明心见性，不用找到如来藏，如来藏本来就没有失去过，所有众生本来就是佛，这个论调完全背离修学佛法的宗旨。</p><p>如来藏就是众生本有的摩尼宝珠，是众生最宝贵的资财，虽然是本有，如果不找出来，仍然不能得到真实的受用。就比如你家里的金银财宝，本来属于你所有，但是放在哪里不知道了，而你说不用找，我本来就有那么多钱财，我是个大富人，任我的财产埋藏在哪里都无所谓。那么你没有找到财宝，怎么能享用福德呢？那就与贫人一样靠打工生活，或者沿街乞讨过活，找不到金银财宝，你就不是富贵人，只是名义上的假富人。</p><p>同理，不找到如来藏，不明了祂，我们仍然不能真正地依止于祂，不能真正地皈依于祂，也不能了知祂更多的功能体性获得大智慧，也不能修学如来藏里所含藏的种子，那么无明缚不能去除，生死也不能了。如来藏的无量功德不挖掘出来，我们就不能得到真实的受用，只是名义上的佛，不是真佛，没有佛的德能。</p><p>如果说一切法都是如来藏的妙用，我们不用刻意去做什么，不用刻意去断除什么，那么下地狱受苦报也是如来藏的妙用，众生为什么不愿意在地狱里好好地享受这个妙用？杀人放火也是如来藏的妙用，为什么众生都不愿意这样做？造恶业也是如来藏的妙用，佛为什么给我们制定戒律，禁止造恶业？</p><p>即使不学佛的众生，也都有如来藏的妙用，三恶道众生也都有如来藏的妙用，都可以认可这个妙用，那么我们何苦来学佛修行呢？愚痴也是如来藏的妙用，也是佛性的显现，佛性也并没有失去，那我们是否愿意永远愚痴着，永远享受着佛性的这种妙用？如果不用断除愚痴，我们就会永处黑暗，苦患无穷。众生学佛，不明佛经的义理，胡乱任意地思惟想象佛法，以为究竟，自误然后再去误人，甚可哀怜。</p><p>五、戒本无戒，意思是说戒法是因缘所生的法，本来没有，因为娑婆世界众生的身口意不清净，心地染污，佛陀才制定了戒法用以约束弟子们的身口意行。如果没有五阴身，就不会用戒法来约束了，如果五阴修行以后达到清净无为了，也不用戒法来约束。另一方面来说，本心如来藏没有色身，没有身口意行，没有染污，根本也用不着戒法来约束，祂不受戒，不守戒，更不犯戒，是五阴色身需要受戒、守戒，有时要犯戒，所以说戒本无戒，戒是后天形成的，有生有灭的法，就是虚妄的法。</p><p>    六、六根互通的原理</p><p>比如大家在看手机屏幕上的字体，同时心里能够知道是什么内涵，而手能够触动屏幕翻页，知道看到哪里应该翻动屏幕了，然后心里又有想法，忍不住就会打字提问。明明是只有眼睛在看字体，其它几根却能互相配合，搞出一系列的活动。这说明一根动，六根都能动。</p><p>为什么六根都能动呢？其背后肯定有一个共同的东西，把六根统摄在一起，虽然是各个不同的六根，实质还是一，没有什么不同。因此，修到一定程度，六根是能够互通互用的，没有区别和障碍。</p><p>世尊在楞严经第五卷中说：（六根）在毕竟同中，生毕竟异。意思是说，六根之体本来是一个，没有什么不同，可是因为众生无始劫以来不守自性，欲向外求，故在一根之中，生出各个不同的六根。如果通过修行把六根都解开消去，那么最后一根也没有，全部是真如自性，别无少法，这样众生就住于本来之中，回归自性，不再流转。</p><p>七、只有如来藏能产生一切法，因为如来藏有一切法的种子，种子是能生义。第七识是产生六识的一个缘，一切法都是如来藏依第七识的无明和愿力产生出来的，没有第七识，如来藏自己什么法也不能产生。如来藏产生前六识必须通过第七识，第七识是无始劫以来就存在的，无余涅槃时才会灭去。    </p><p>八、涅槃不系缚任何一法，因为涅槃心没有主宰性，祂不攀缘一法，也不束缚一法。祂是一种随缘性的心，万法有因缘出生，祂就生万法，缘不具足时，祂就不生万法。所谓的缘就是业种以及业种现行的条件，比如家具的制成要有人工、木板、胶、油漆、铁钉以及工具等等，但是家具肯定不是这些因缘生出来的，而是如来藏藉这些因缘输出四大种子出生的，家具的最根本最基本是由四大种子构成的，只有如来藏有四大种子，能给予四大种子。万法的好坏，要看是善业种还是恶业种，如来藏不强行地变生什么，也不主宰生什么和不生什么，一切都看五阴造业的种子和缘，祂很会了别业种，从来没有错乱过。如来藏一点也不糊涂，祂没有无明，完全按照特有的规律而运行。</p><p>九、执著佛法到底好不好</p><p>关于执著，对于自我五阴的执著，四果罗汉以前都有；对于佛法的执著，没有修到大乘无学位的菩萨都有，灭了法执就成佛，八地菩萨修行达到无心无为，在佛法修证上还有很多法要修行，也没有断尽法执。</p><p>佛法是灵丹妙药，是众生脱离苦海的指路明灯，是摩尼珠，是大宝聚，是生死海中的航船，是救命稻草，凡是好言都可以用在佛法上。各个佛经里已经说得很多很好很清楚了，也有极多的譬喻。佛法就是渡河的船，到岸才能弃船，众生在生死海中漂泊，如果不紧紧抓着船，掉到海中就会被淹死。没有得道的凡夫众生更应该抓着佛法，救自己的性命，以期离苦得乐。</p><p>凡夫人极大多数是不执著佛法的，执著佛法的人太少了，如果能执著佛法，就不会再执著自我、执著世俗法，造成生死轮回不断。执著佛法是好现象，都学通达了，贯通了，再把法执断尽，就能登上彼岸。如果还属于生死凡夫阶段，就不执著佛法，那肯定是要执著世俗法的，在佛法的修行上就要懈怠。一个身体懈怠心也懈怠的人，肯定不执著佛法，修与不修无所谓，修什么也无所谓，怎样修也无所谓，毫无疑问是这样。最初学佛修行，能执著佛法还是有很多益处的，贪佛法也是善贪，对自己只有益处、没有坏处。这样能把对自我对世俗的执著转移到佛法中来，把贪五阴自我贪世俗五欲六尘转过来，执著佛法贪佛法，心地就能得解脱，等到佛法通达了贯通了，再一步步去掉对佛法的贪和执著，然后才能成就佛道。</p><p>十、第八识是否属于识蕴</p><p>识蕴，主要指五蕴中的六识的蕴集作用和第七识的蕴集作用，都是生灭性的。因为蕴就是生灭性的造作，识蕴就是生灭无常无我的，空的。</p><p>第八识能蕴集业种，但是这种蕴集作用就像机械化的一样，是无心的，是法尔如是的作用，是法界的自动规则，没有人为的造作和安排，没有心行。所以第八识的蕴集作用不是生灭性的，不能归于五蕴的生灭的蕴集作用里。 </p><p>十一、佛为地上菩萨讲甚深的种子功能，也就是道种智，不特意为没有明心的凡夫众生讲甚深的道种智，也不会为声闻缘觉们讲甚深的道种智。所以佛说：“一切种子如暴流，我于凡愚不开演”。这个凡，就是凡夫，愚就是二乘人，他们愚于大乘的实相法，没有般若智，更没有地上菩萨的道种智，因此甚深的如来藏法，佛不是为阿罗汉、辟支佛们来开演的，更不为凡夫而开演。</p><p>十二、四大禅病：止，作，任，灭。止：如来藏这个禅，不是把妄念止下来就有，不止就没有的，如来藏是本来就存在的，不管你心止与不止。</p><p>作：如来藏这个禅，不是通过修行而修出来的，而是本来就有的，不管你意识心如何折腾，如来藏天然就存在。</p><p>任：如来藏不是你把意识任心随意，随缘自在，不修福德禅定六度，就能找得到，寻觅得到的；如来藏虽然不是修出来，但是不修也是不能证得的。</p><p>灭：如来藏本来就存在，时刻在显现，时刻在起利用，不是你把意识心止灭、灭掉，如来藏才能显现和出现的。</p><p>十三、一切法都是真妄和合而生，真就是真心，妄就是妄心七转识。五阴世间里一切活动都是八个识共同和合运作的结果，菩萨的生活起居、学佛修行以及弘法利生，都离不开真，也离不开妄，众生永远都依赖于真和妄才能得以生存。有真，才能变现出妄，所以真很重要；如果没有妄，只有真，众生就不能存在，一切法也就不存在了，所以妄也很重要。</p><p>七识心虽然是生灭变异的，但是也不能灭除，既然不能灭除，就要加以改造，改造好了，就成佛。所以我们学佛修行就是修七识妄心，破尽七识所有的无明，转化七识的所有染污，七个识由无明的识性转化成智慧性，转识成智以后，修行就圆满结束。所以修行的目的不是要灭掉七识，而是要转变七识，也不是要灭掉一切境界，而是要转变一切境界。三界世间一切的虚妄法都要转变成清净、纯净无杂染的，那就是佛的境界了。</p><p>十四、日用而不知，本心时刻刹那都在生起利用，只是众生由于无明不能了知，更不知祂是如何起用的。本心时时在用，祂自己知道如何去运作，如何去出生万法，祂会按照祂自己的运行规律去起相应的利用，不用我们去用祂去操纵祂。事实上我们也操纵不了，祂的运行规则里我们完全插不上手。但是在凡夫阶段，我们的本心现在都是在帮助我们造作染污的业行，造作很低俗的事业，造恶业的时候多，而祂自己却从来不抱怨这些。</p><p>相反佛的本心用的就很圆满，达到了极致。七识心越清净，本心用的就越好，越有智慧，用的越好；七识心越染污，本心用的就越不好。这个本心既然时时都在用，那我们就应该想办法找到祂，了知祂到底是如何用的，如何能用得更好，更完美，更究竟，如何能达到像诸佛世尊那样的用，这就是我们无量劫所追求的目标。</p><p>十五、每个有情众生都有自己的本来面目，而且本来就大放光明，时时都在起利用，维持和显现着万法，这样众生才能有正常的生命活动。不管众生执著不执著，不管众生有妄想无妄想，颠倒与不颠倒，本来面目都在清净地显现和作用着，根本不用把烦恼、妄想、颠倒都消尽才能证得祂。菩萨都是在烦恼当中觅得菩提，因为烦恼就是菩提显现出来的，有烦恼肯定有菩提，那就能在烦恼出现处找到菩提。</p><p>烦恼灭尽了就是阿罗汉，妄想颠倒灭尽了就是佛世尊。这都是修行证得菩提以后的结果和果报，六道生死业障的凡夫，在他们身上，同样有本来面目，照天照地，洞彻无碍，因此凡夫在烦恼当中证得本来面目，就不是凡夫了，以后才能慢慢断除烦恼，断除所有执著，去除颠倒妄想和染污，究竟成佛。</p><p>世尊刚一成道时就说：奇哉！大地众生皆有如来智慧德相，只因烦恼妄想，不能证得。世尊的意思是说，众生本来就有本来面目，只是不能证得而已。而要证得，也非必把烦恼妄想颠倒都灭尽。</p><p>佛说，菩萨不离烦恼而证菩提。就是说菩萨们是在烦恼当中找到菩提心，找到菩提心之后，烦恼就会渐渐脱落，最后烦恼消失灭亡，习气也灭尽，无明也能断尽。没有证得菩提本来面目之前，不可能灭尽烦恼习气和颠倒妄想。</p><p>十六、如来藏不是相对待法，祂不与万法为侣，不与一切法相对。因为三界世间一切法都是如来藏所出生的，一切法都灭，如来藏不灭。没有一切法存在的时候，如来藏照样能够存在，祂不依赖任何缘而有，不属于三界法，独尊于三界。三界里的法，都不能与如来藏相比对，所以如来藏当然是无对待法。而如来藏这个真，是绝对待的真，三界世间法当中没有一法与祂相对比、相比较，而三界外又无法，更没有与祂相对待的。</p><p>因此如来藏就是没有相对的绝对的真实法。世俗法当中的真是与假相对待的，相对待的真也是假的真，是有生灭的法，如来藏不是这样。如果认为如来藏不是真实的有，是假有，是因缘生的有，那么这个知见会让自己永处黑暗的深坑，不得出离。</p><p>我们学佛的目标是要找到那个不生不灭的真实我，破除五阴为我的邪见，进而让五阴假我依止于真我如来藏，从而破除一切的无明，成就佛道。如果不开悟，不找到如来藏真我，就不能破除无明，更不能破尽无明，也就不能成佛了。我们仍然要处于无明当中，生死不断，苦恼不断。开悟找到如来藏，般若智慧就会生起来，有了智慧，就能解脱，就能成佛。</p><p>十七、如来藏没有来去，没有生灭，没有增减，没有垢净，但是祂所产生的法有生灭，有来去，有变化，有增减，有垢净。只有这一个心体没有生灭，其余都是生灭幻化的，包括应身佛、化身佛能出生，也能灭去，所有大菩萨的色身也能出生和灭去。所以佛和菩萨们到这个世间来，本身就是不生灭的如来藏和生灭的五蕴的组合体，佛菩萨就是在世间的生灭法中来来去去。因为世间的一切法都是生灭的，佛菩萨到这个世间来，就要接触这些生灭法，利用这些生灭法来广度众生。</p><p>如果没有这些生灭法，佛菩萨只剩下如来藏，那就无所作为了。单独一个如来藏的存在，就是阿罗汉的无余涅槃境界。佛经常告诫菩萨们不要取这样的涅槃，取了这样的涅槃，就不能成佛。佛自己永远也不取这样的涅槃，佛地的涅槃是无住处涅槃，心不住一法，也不住在涅槃里，而处处现身，随缘现出无量无边之多的色身五蕴，度化诸众生。而现出的色身五蕴就是有生有灭的，随时可以灭掉，灭掉以后，还会现出无数的五蕴身在十方世界利乐有情。</p><p>十八、佛法中的平等，是指每个生命体的如来藏真如心的体性是平等的，每个众生的真如如来藏体性都相同，没有差别，没有高低、大小、胜劣、强弱等等，与十方诸佛的真如心也是平等无差别的，体性清净，自体不污，不染六尘，能够平等地显现一切法，不分善恶是非好丑男女等相。真如体性虽然平等，但不妨所变现出的相的不平等，因为众生的业缘不同，业种不同，相就有不同；如果相上也要平等，那就是不平等的，违犯了因果律。平等心的真如心体依缘显现出不平等的幻相，这才是平等又平等，是真正的平等，平等一如。一切不平等的相都是平等的真如理体，平等无差别，一体无二。</p><p>十九、即见处便有不见；居见闻之境而见闻不到；居思议之地而思议不及。此三句话都是说如来藏离见闻觉知性，我们六识的见闻觉知也不触及如来藏，正符合心经中所讲的如来藏的空性体性。</p><p>第一句即见处便有不见。在我们眼根触色尘之处，眼识看到色尘的时候，就有个不见色尘的如来藏存在着，我们眼睛既见不到如来藏，如来藏无眼也不见色。</p><p>第二句居见闻之境而见闻不到。在我们见色闻声六识分别六尘境界时，有个如来藏，我们见闻不到，分别不到，因为如来藏没有六尘相，眼识就看不见色，耳识就听不见声，六识就不知六尘。</p><p>第三句居思议之地而思议不及。当我们思考、回忆、想象各种境界法尘时，有个如来藏，是我们六识思议想象不到的，因为如来藏是不可思议的，不能用情思意解的方式去猜测和想象祂，要如理如法地参究，依一定的轨则，去细心地寻觅，才能证得如来藏。</p><p>二十、楞严经中有一句话：知见立知，即无明本；知见无见，斯即涅槃。知见立知，即无明本，意思是众生都有见闻觉知心，能见能闻，能觉能知，但是如果我们把这些知性，当作真实，树立知六尘境界的知性为真，为常住不灭的我，能去到未来世，那么这种见解就是邪见，是无明的根本，那样就会流转于六道生死轮回中，不得解脱。</p><p>知见无见，斯即涅槃。如果我们通过观行，了知到这些见闻觉知性，都是生灭变异的妄心，不能常住，不能永远存在，也不是真实的我，心中就再也不认见闻觉知性为我了。这样的知见确立起来以后，就断了我见，将来就能断我执，证得无余涅槃。如果能在见闻觉知上，证得那个没有见闻觉知性的自性清净心，就证得了本来自性清净涅槃。</p><p>再确切地解释这句话，知见无见的意思就是说，在六识的各种知见上，同时有一个没有任何知见的本心如来藏，祂在背后一直在运作着；斯即涅槃，祂就是涅槃境界里的不生灭的本心如来藏，也就是涅槃心。</p><p>二十一、时间不是四大组成的实法，是与心不相应的行法，不是由如来藏直接出生的，是如来藏出生物质色法以后显现出来的一种假相，不是外尘，如来藏不能缘。只有把眼识意识生出来以后，才能依物质色法判断和了别时间。没有眼识意识时，比如睡觉时，意根也能判断时间，也是依如来藏出生的物质色法来了别判断。所以没有单独的时间这个法，也不属于外相分和内相分。意根也能了别不属于外相分和内相分的心不相应行法。</p><p>二十二、语言只是一个指头，不是如来藏本体，无论怎样说，说的本身不是如来藏，而是指头，语言可以指向如来藏，他人顺指就可以证得如来藏。我们面对着一幅画，语言可以随意表达，只是表达出来的都不是那幅画，但是他人可以根据语言描述，理解那幅画，认识那幅画，想象那副画。</p><p>所以说，他人证得如来藏用语言描述出来以后，自己可以理解，但不代表是自己证得的。只有自己亲自现前观察到了，不管能不能用语言描述，都是现量观察如来藏，都属于证悟了如来藏。所以语言虽然虚幻，可是有用，这是见法的不可缺少的工具。乃至于一切妄法，都是一种道具，都有用处。各种名相，都是指月之指，都是道具，都是通向如来藏的地图，也都有用。只是不要把地图画错了，把指头指错了方向。</p><p>二十三、涅槃是否是生灭法</p><p>涅槃的状态是如来藏幻化的，不是实有的，是通过修行得到的，不修行就没有涅槃状态，之后还要从涅槃状态出来。涅槃状态是会消失和改变的，这说明这种涅槃是有生有灭的，因此说涅槃也不真实，只有如来藏本体才是真实不虚的。如来藏显示出来的寂静的涅槃性是真实的，但也是相对的真实，依如来藏本体才能存在。有余依涅槃和无余依涅槃，以及佛地的无住处涅槃，都是先无后有，后天生出来的，因此是虚幻的现象，是生灭的现象。除了佛地的无住处涅槃永远不会消失，但是有生，也是依无垢识本体才能显现出来，因此不是实有法；有余涅槃和无余涅槃都不能长久不灭，也是生灭变异法。只有如来藏显示的涅槃德是真实的，不变异的，不生不灭的。</p><p>把一个定义定错了，不至于影响证果，定义正确，也不一定能证果。证果与否，实修与否不在于概念的定义。四果阿罗汉还有不会讲法的，凡夫也有讲四果阿罗汉修证境界的，修行不在于如何讲法，而在于实证和心行。</p><p>二十四、众生能否度尽</p><p>一个如来藏对应一个众生，所以如来藏也叫作众生界。心经中说如来藏不生不灭，众生界不增不减。不增不减就是不变异，不生不灭就是永远不灭，所以如来藏的数量永远是固定的不变的，而且是无穷无尽之多。因为众生太多，如来藏太多，无法数得清楚，所以才说是无量数。</p><p>这么多数量的如来藏对应这么多的众生，众生是否能被度尽？只要众生界不再增加，佛菩萨越来越多，众生早晚都被度尽，再多也有度尽那一天，只是时间不定，无限长远，不可说不可说的无限长。众生都成佛时，没有可度的众生，诸佛住世也就没有什么必要，没有意义了，应该都会涅槃去了，诸佛们没有必要无事找事，十方世界也没有存在的必要。最后成佛的那些众生，修行非常省力，一尊佛护持着一个众生，修行就像做火箭似的。最后一批众生没有机会造恶业，无明业种消除非常快，不用度众生就能成佛，因为没有无明时就成佛了。</p><p>二十五、问：金刚经说一切圣贤皆以无为法而有差别，是不是说对如来藏法证悟的程度不同而有差别？也就是对空性的证悟程度不同？</p><p>答：圣贤人包括声闻阿罗汉和缘觉辟支佛，还有菩萨和佛，叫作四圣，其中小乘初果二果是贤人，明心以后至初地菩萨之前是贤人。前两种声闻和缘觉人是小乘根器，不走大乘成佛之路，不参究大乘如来藏法，也没有证悟如来藏，只有大乘菩萨才能参究如来藏证悟如来藏，这是大乘菩萨与小乘声闻缘觉的区别。</p><p>佛所证得的无为法，是最究竟彻底的，不但我空，法也空，我执法执全部断尽，心中空空如也，连如来藏法也空也不执。证得大乘如来藏的菩萨是证得了如来藏这种出世间无为法，以后七识心也会越来越无为，像如来藏一样在有为法的造作中心行却是无为的，既有为又无为；而小乘声闻人是证得了五阴无我的我空，这是小乘的无为法；缘觉证得了十二因缘的缘起法，一切法都是因缘所生，所以是空，这也是一种无为法。之后声闻缘觉的心就要无所造作，七识也要无为，这种无为性与如来藏有所不同，如来藏是在一切有为法的造作心行是无为的，是不废有为的无为，而声闻缘觉是要废弃有为的那种无为，连成佛度众生这样最有意义的大事都不为，佛说为焦芽败种的无为。</p><p>声闻和缘觉证得的无为法是一种假相，是依真正无为的如来藏才有的，既不究竟也不真实，还把法相当作真实有的，把三界和六道当作真实有的法，把苦受当作真实有的。不知道都是如来藏幻化出来的，实质是没有的，都是如来藏性，所以他们证得无为法的层次很低。菩萨虽然证得了如来藏无为法，层次比声闻缘觉要高，但是由于修为程度不够，没有完全依止于如来藏，心行还不是完全的空和无为，也是不究竟的，只有佛才是究竟的彻底的无为。</p><p>有人说声闻缘觉也证得了如来藏，如果是这样，那么声闻缘觉也是菩萨，与菩萨没有区别，发心应该一样，愿力应该一样，都应该继续深入修行如来藏法，走菩萨之道，自利利人。可是他们的行为却与菩萨道相违背，慈悲心没有发出来，害怕三界苦，害怕自己轮回，不肯继续修行，不肯救度众生，选择了入涅槃，完全不是菩萨心行。</p><p>如果声闻缘觉也证得了如来藏，那他们就应该知道如来藏在五阴身上是如何运作的，是如何出生五阴身执持五阴身的，就不应该害怕有为法和三界苦而选择入涅槃，可他们对如来藏法完全无知，不知道五阴苦也是幻化的，不用害怕躲避。证悟如来藏应该能现前观察如来藏，如果只是听到如来藏的名字就相信有如来藏，那离证悟还有十万八千里。所以声闻缘觉绝对没有证悟如来藏这种无为法，而是证得小乘五阴无我和十二因缘这种无为法。由于证得无为法的不同，圣贤们才有大小高低不同的差别，菩萨们也因为证得如来藏的程度不同，而有智慧和果位上的差别。</p><p>外道也有无为法，修到四禅定的时候，就是不动无为，身心都不动，没有呼吸，没有脉搏，没有心跳，没有分别，没有心念；修到无想定，意识灭了，心更无为；修到非想非非想定，意识灭去受和想两个心所法，叫作想受灭无为。不做不行不动，就是生灭法的无为。</p><p>二十六、心不住法，明心见性，定慧一体，无有顿渐。</p><p>心不住法，一个是觉知的妄心不再把五阴十八界当作真实的我，不再把意识心的各种变相当作真实的我，在五阴的运行当中就能排除妄法，找到真实的如来藏，从而明心见性。另一个是，找到如来藏以后，发现祂根本不住在任何一法上，祂不知六尘境界，不知好恶、是非、长短，不识别任何境界相，包括定境法尘，祂总是如如自在，不动心念。</p><p>定慧一体，如来藏即在定，也在慧。定，是心永远不散乱、不攀缘、不动转、不动摇，祂对六尘不分别，不起心念，没有贪嗔痴。慧，祂没有无明，不愚痴，不愚于万法，含万法种，变万法，显现万法。而变万法、显现万法，是要有极大智慧的，我们觉知心七个识的智慧望尘莫及，永远也做不到。如来藏定慧同时具备于一身，就是定慧一体。无有顿渐，当我们找到如来藏的时候，当下就悟，悟是顿时悟，但离不开渐修。顿悟的前提是渐修，需要一点一点地累积福德定慧资粮，资粮满足了，才能顿悟。</p><p>二十七、六祖讲的坐禅，是七识妄心面对一切六尘境界，不着善恶境界相，境界虽然有好丑，而心不起非。真正的坐禅人，在各种境界上，只见真如自性这个禅心，而不着一切虚妄相。道人心在行走坐卧、语默言笑中，见的都是真如自性的起用，六根触六尘时，无非都是自心本性如来藏，这样念念打成一片，名为真如三昧。而尽管妄心着相，时时要分别一切法，真如自己却不着一切相，心本不动，性自清净。</p><p>尽管妄心见境思境，贪嗔炽盛，真如本心自不生念，每日二六时中，心常在定，从不起非，从不起念，此则名为那伽大定，也名为首楞严定。那伽常在定，无有不定时，因此祂没有出定入定时，即为真定。而妄心定，有出有入，出即散乱，入则一心，妄心入的定还有心行有生灭，即非真定。　</p><p>楞严是一种最坚硬的宝，用它来比喻如来藏的不可毁坏、不可摧折的坚固性，楞严经中讲的楞严定就是指如来藏的如如不动性。如来藏常在定中，祂不对应六尘，从不散乱地攀缘六尘，也从不昏沉掉举，对于六尘无念、无觉、无知。如来藏的这种定，没有入时，也就没有出时，任何人事物都不能破坏祂的禅定，都不能让祂出定，不能让祂散乱和放逸。所以如来藏也就不用受戒和持戒，因为祂永远不犯戒。</p><p>想要证得这种楞严大定，就要通过参禅明心见性，证得如来藏，这样就获得楞严大定了，到这时最低是第七住位的菩萨，往后还有十住位，十个行位，十个回向位，十个地位，等觉菩萨，然后就是妙觉菩萨，最后就成佛了。</p></div>"
},{
    "title": "第三十六章　问题解答",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三十六章　问题解答</strong></p><p>一、佛的八个识的妙用</p><p>问：当阿闍世王放大醉象要杀佛陀时，佛陀对于此事的反应是怎样的？在这些反应当中，都有哪些心参加？</p><p>答：当佛陀看见大象凶猛地冲过来时，佛的意识心所转成的妙观察智，马上就知道大象来的目的，以及它的危险性。但是世尊是不会生起恐惧心和嗔恨心，不把大象当作仇敌，更知道眼前的一切都是虚幻相，没有真正的大象。</p><p>世尊的意根转成的平等性智，立刻决定入慈心三昧来降伏它，于是佛陀就入慈心三昧，大象吓得失粪，并且匍匐在地，给世尊顶礼，皈依于佛。</p><p>世尊是用什么看见大象的呢？金刚经上说佛有五眼：肉眼、天眼、慧眼、法眼和佛眼。这五个眼佛有时是单独用一种眼，有时是二种或五种眼都用。在看见大象时，佛不会用天眼，因为没有这个必要，那么肯定用肉眼，肉眼见色，眼识转成的成所作智，了知了大象的相貌，那这样是不是分别了大象呢？成所作智是否起作用了呢？当然世尊的这种对境界的分别是非常殊胜的，不带有烦恼和无明，我们无法想象和猜测。</p><p>那么佛的耳识所转成的成所作智是不是能听见大象奔跑过来的声音呢？佛的鼻识所转成的成所作智是不是能嗅到大象扬起的尘土味道呢？佛的妙观察智是不是知道大象来做什么，是谁放的大象，目的是什么呢？妙观察智是不是要分析该怎么办？平等性智是不是要决定该怎么办呢？佛的大圆镜智是不是也要配合七个识起相应的作用呢？如果说佛在这个世间作事，与众生打交道，是用一个心，是用哪个心呢？其余的心留着做什么用呢？还是说根本没有其祂的心，只有一个心，那么佛的五眼都是做什么用的？佛长着肉眼有没有用？佛的耳朵有没有用？佛的六根有没有用？还是只是一个摆设？</p><p>综上所述，得出一个结论：佛也有八个识心，其功能作用大大优异于众生，不含藏烦恼及烦恼习气，也没有无明。而众生的识心当中就有无明，有烦恼习气，或者有烦恼，应对人事物时，心不清净，有染污，因此识心的心量就小，功能作用就有局限。修行就要不断的打开心量，心量越大，功能作用也越大，成就也越大。</p><p>二、问：佛有化佛化菩萨，这些化佛化菩萨是不是都用佛的一个如来藏变化的？佛的如来藏的妙用与众生的如来藏的妙用是否是一样的？</p><p>答：佛的如来藏应称作大圆镜智或者是真如，或者是无垢识。佛的大圆镜智因为已经转识成智，没有了七识恶业种子的缠缚，脱离了染污种子的束缚，完全恢复了自己的本来面目和本来德能，能够现起无量的化佛和化菩萨，这是佛的如来藏的妙用。</p><p>佛的妙用是依已经转换成平等性智的意根和已经转换成妙观察智的意识而现起的，但是佛的大圆镜智无垢识也能单独现起利用，起妙行。无垢识没有了七识无明的拖累，已经具有了我性，有我的作用，并且是常乐净的。</p><p>三、问：如来藏有七大种：地水火风空见识，四大形成的法是色法，识大形成的法是心法。但心法与色法有时候很难划分，比如说无表色，一个人的年龄、性别、气质、风度、学识、修养、性格、脾气、秉性等，这个无表色是意识比量或非量了别的相分，到底应该是色法还是心法？</p><p>答：这些无表色是在色法上显现出来的色法尘，是色法的一种，依靠着五尘色才能显现出来的法尘，是五俱意识了别的相分。</p><p>法，包括了色法和心法、非色非心法。七识和心所法是心法，如来藏和心所法也是心法。色法和心法和合运作，形成了一切法。无表色是色法，是用四大种子生出来的，由微细四大组成，意识可以现量了别。鼻识所嗅的气味都是四大组成，色尘上的无表色同样是四大组成的色法，阳光照到色身上的暖融融的触尘都是色法，何况色尘上的无表色，更是色法。既然已经叫作色了，就属于色法。</p><p>四、问：无情物没有如来藏，不能成佛，为什么说有情无情同圆种智，这里的种智是否指一切种智？</p><p>答：圆种智就是圆满一切种智。一切种智，就是指有关如来藏里的所有种子的功能作用，全部都证得都了知，一点遗漏也没有，就圆满成佛了。这时世出世间法就会全部都知晓，再也没有不懂的了，即使是极细微的法，也没有不知道的；一切众生来问难，没有能被难倒，而回答不了、应对不了的，这就是佛陀的无上智慧。</p><p>但是佛陀会观众生的根基，知道众生还没有办法理解的问题，或者暂时理解不了可能会谤的问题，佛就不予回答，告诉众生说此是无记法。其实在佛陀那里，一切事情，无论大小巨细，都是洞明无碍的，如来的智慧是不可思议的，众生没有成佛时，永远没办法搞明白。</p><p>至于无情也能圆成种智，这个说法，在佛经里没有出处，这是后人自己创造的说法。无情是物质色法，四大组成，没有心识，就没有了知性，世间法就不知道，何况还能知道佛法；更不能明心见性，以及观察如来藏里的种子功能，它连如来藏都没有，要如何观察呢？它没有七识心，又如何去观察呢？它用什么工具来做这一切事呢？但是无情物是可以转变的，随着有情众生识心的转变，无情物也要变得更加的圆满和庄严，直到成佛以后，佛所接触到的无情物都是极其殊胜的。只有众生成佛时，随着佛的无情物就是最有名殊胜的，是佛力所感召化现的。</p><p>有五蕴的叫作众生，没有五蕴的就是无情物，物与众生非一类。人就是人，石头就是石头，归不到一起。所以从任何一个角度来说，无情不能成佛，不能圆种智，这些物最低等的识别能力都没有，何况能识无上大法，但物能随众生而转。</p><p>但是从另一个角度来说，无情物也属于种智里的一部分内容，有情众生通过修行成佛以后，随众生而有的无情物，就会转变四大，成为清净而完美的无情物，物质的属性得到了转化，这是众生修行之功所致，属于众生的依报。众生成佛以后，正报色身和依报的物质色法，全部都得到彻底的转变，圆满而达到极致。比如佛的所有色身都是三十二相、八十种好，而所在的世界国土，都是七宝所成，百宝所成，众宝装饰，美妙无比。这些无情物都是随佛的一切种智而有，是佛的无垢识清静无余，所感召的极其殊胜的果报。</p><p>五、问：打乒乓球时，球来来往往回合很快，总是需要迅速反应并指挥步法招数，手臂肢体全部配合好，才能准确回球。有的时候，对手打来的球太快，于是本能的就有回应，不像是意识指挥出来的，请问这个过程怎样解释？</p><p>答：在打球时，有八个识的密切配合，才能完成打球的比赛活动。其中，意根是总指挥，辅助调动六识对球的了别和处理运作；意识配合意根，负责分析判断，前五识和意识收集六尘信息，尤其是色尘的信息，球来的方位和角度。意识最忙碌，要随时随地分析判断球来的方位、角度和速度，以及思惟和分析如何应接，不敢轻忽怠慢，把分析抉择迅速的报告给意根，由意根决定具体如何出手应对，六识服从。</p><p>六识接收的所有信息都要汇总到意根，由意根统一作决断，之后七个识和如来藏一起配合，完成下一步的活动。如果对方的球来的太快，或者对方出其不意，意识没有防备，来不及反应和分析、判断，这时意根就根据以往的经验，快速地做决断，作出回应，当然有些时候就措手不及，不能准确的接住球。如果不是这种情况，中间就有意识极其快速的思惟、分析、判断的机会，然后再把判断的结果交给意根，由意根做决断该如何出手回应。意根能了别色身和六识的状况，不断的接收六个识的信息情报，又要刹那刹那思量决断，其工作量要超过第六识，可是意根本身从来不感觉累。</p><p>八个识密切配合，天衣无缝，其中最最忙碌的还是如来藏，如来藏比七个识的工作量都大，祂有自己本身的工作，还要兼顾七个识，以及根身器界。虽然祂内外兼顾，但从来都是有条不紊，从来都不忙乱出错，总是运作有序，没有情绪，没有起伏，没有波澜。隐藏身份，毫无怨言，默默无闻，输赢无畏，不争功名，不要利禄，大德威威，真乃我等，学习典范。</p><p>七、忏悔灭罪的原理</p><p>罪从心起将心忏，心若灭时罪亦亡，心亡罪灭两俱空，是则名为真忏悔。这个忏悔偈的真实义是什么？</p><p>这里的心灭，可以理解为：妄心七识因为证得了如来藏实相心，就不再认为自己是真实不灭的我，同时就断了七识的我见，不再认七识为我。心灭是断我见的意思，不是真正灭除七识，不让七识起作用了；七识心若灭除不起作用，那就是无余涅槃境界，那样众生也就不能存在了。</p><p>全偈释义如下：</p><p>众生五阴造作罪业之行，都是由于七识心的贪嗔痴烦恼所引起，既然是七识心造业，那么就要让七识心来忏悔自己的贪嗔痴烦恼性障。真正的忏悔，是要认识到五阴七识本身的虚妄不实性，断除七识的我见，我见一断，依五阴七识之我而造作的罪业也就随之消灭，未来不复再下堕三恶道中。</p><p>而要深切地认可五阴七识的虚妄非我性，就要参禅证得真正的主人如来藏，证得如来藏时，就知道七识是由如来藏所生，都来自于如来藏，那么七识当然就不是真正的我，不是真正的主人，而是暂住的客人；客人由如来藏输送的识种子刹那刹那变现出来，生灭不已既非我，这样就彻底断除了七识为我的我见。</p><p>这同时就知道了五阴七识所造作的罪业，也是如来藏所幻化出来的虚妄相，当体即空，三恶道业即消，未来永远不下三恶道。不但七识心是虚妄空幻不实的，七识所造作的罪业也是空幻不实的，这样心灭罪消，才是真正有效的忏悔，自心才能得到佛法的真实利益，这才是大乘菩萨的实相忏悔。</p><p>正如永嘉禅师所说：证实相，无人我，刹那灭却阿鼻业。其灭罪的原理是：证得实相如来藏时，就知道七识都是如来藏所生，本没有七识，都是如来藏的功用。从如来藏的角度来讲，本没有人，所有众生都是幻化的，那就没有造业者，也没有受报者，也没有罪业，一个幻化的众生，造作的业行也是虚妄的，都是如来藏的功用。真证得此理，就可以灭除三恶道的业，永远不下堕三恶道中受恶报。大乘的无生忏，就是如此地忏，重罪必消。</p><p>八、问：大悲忏里有句：南无大悲观世音，愿我早同法性身。这句话何意？</p><p>答：法性就是一切法的实质性，一切法的真正性质。一切法本来是由如来藏所出生，因而本质上就是如来藏的性质，所以法性就是指如来藏性。如来藏是在缠的因地法身，被七识的无明所缠裹着，而佛地的真如无垢识是出缠的真正的法身，没有七识的无明所缠裹了，也叫作法性身。如来藏有自体的真实而如如性，因而是法性身。这个身，虽然没有实体的色相存在，但祂的体性是真实的，祂有真实的功能作用，因此是实相心，那么这个法性身就是指自性清净心如来藏。</p><p>观世音菩萨引导我们发愿早同法性身，其用意就非常明显了，这是让我们修行菩萨道，最终成就佛道，成为无上尊。同，就是要让七识妄心与如来藏的清净无为性靠近，转依于如来藏的清净性，让七识心转识成智。这里涵盖着菩萨六度万行的修行，也告诉我们，发如此清净的大愿，最后就能引导我们奔向佛地的终点站，圆满一切种智，福慧两足尊，究竟成佛。</p><p>九、问：众生的第七识执取五阴世间，如来藏就会出生三界世间万法，但是佛的第七识已经没有无明，不执取五蕴世间了，为什么还出生五蕴十八界，出生世界国土呢？</p><p>答：佛的第七识已经不执取任何一个法了，完全可以不出生一切法，但是佛是靠愿力来出生三界世间法，永不取灭度，不会灰身灭智入无余涅槃。地上菩萨的第七识也不执取五蕴，也可以灭去五蕴，但是依靠清净的十无尽愿，永远不取灭度。</p><p>菩萨在入初地之前和之后一定要发十无尽愿，因为发了这个愿以后，由愿力牵引，就能随愿往生十方世界，普度众生，永远不取无余涅槃，生生世世有五蕴出生来实现自己的清净大愿，直至成佛，也不灭度自己。所以佛是永远也不灭度的，如果有人说佛是真的涅槃了，那就是谤佛，不解佛意。</p><p>十、问：前五根等待着接收五尘，如来藏通过五根接收着五尘，意根了别着重大法尘，是这样吗？</p><p>答：五根不是识心，像木头一样无知没有分别性，是被识所用的，不可能有心等待着接收五尘六尘；五根就像一个摄像机，是被意根操纵的，自己本身没有等待的心，什么想法知见都没有。如来藏通过五根摄取五尘的微细四大物质，变成内相分以后，意根攀缘，六识出生。其中意根接触法尘以后，也知法尘，只是不能了别具体内涵，只能是意识来了别具体内涵，然后将了别的内涵传递给意根，意根才了别到法尘的具体内容，并且以此来作思量和决定，下一步的身口意行就产生出来了。</p><p>意根默容一切法，所有法意根借着如来藏的见性全部都能接触和了别，不管大小轻重缓急，一律了别，然后判断重要与否、紧急与否，有选择性的让意识进一步了别和处理。意根不是像某些人说的只能了别重大法尘，微小法尘更多，意根都了别，然后意识才能出生仔细了别这些微小的法尘，有的时候细微的呼吸声和心跳的声音都能了别到，当然重大法尘更能了别到了。</p><p>十一、鬼神能附体吗？</p><p>众生有八个识，楞严经第一卷中，佛说妄心七识不在色身里，也不在色身外，也不在中间，俱无所在，如来藏也是不在色身的里外和中间，但是八个识要和合起来支配控制着色身，色身才有五蕴的活动。自己的八个识都不能真正地附在色身上，何况其他众生的八个识。但是其他众生的识心也能够控制自己的色身，就是说自己的色身也能够被其他众生所利用，使得自己的识心不由自主，不能自我作主。</p><p>过去的时候，如果有人死在外地，尸体要运回家乡，那时又没有车，于是家人就雇人念咒，让那个尸体自己起来走路，一直走回家，念咒的人必须一边念咒，一边跟随着尸体才行，念咒人一旦停下来，不念咒了，尸体也就倒下了。这是为什么呢？因为那人念咒能招揽鬼神附体，念咒时，就有鬼神控制尸体，让尸体站起来走路，肯定是鬼神的识心在控制着尸体，只有如来藏是不能单独控制尸体的，只有七识，也不能控制尸体，鬼神的八个识中至少有四个识和合在一起才能控制尸体，尸体才能像活人一样走路，但是鬼神的识心不能真正地附在尸体上，也不在尸体的里外和中间，我们活人也如是。</p><p>所以有人念咒有感应了，就觉得很好，那不一定是佛菩萨加持的，念一些鬼神咒，就有鬼神的加持，有时也是感觉不错的，也能把病治好，也能解决一些小问题，但是得到鬼神的加持和帮助是要付出代价的，往往得不偿失。</p><p>十二、问：楞严经中八还辩见里讲的“见精明元 ”是指什么？第一月、第二月、月影都指什么？</p><p>答：楞严经第二卷原文是：且汝见我，见精明元，此见虽非妙精明心，如第二月，非是月影。佛所说的妙精明心，是指第一月如来藏，此月是能幻化万法的摩尼宝珠，是能明了一切法的微妙心体；见精明元，是指如来藏性，就是佛性，佛性是依如来藏本体而有的能见一切法的性质，与如来藏不一不异，如来藏是体，佛性是用。</p><p>如来藏是第一月，佛性是第二月，第二月是捏目所成，是第一月的复制品，而其他的一切法都是月影，月影是不真实的，幻化出来的，完全是生灭变异的假相，得也得不到，执著也执著不了。七识就是月影，五阴十八界就是月影，万法都是月影。所以当七识影月有见时，同时就有真月如来藏的见，那么如来藏的见，一个是如来藏本体的见分，一个就是第二月佛性，佛性也是不生不灭的。佛性在六根上都能运行并被发现，眼根、耳根、鼻根、舌根、身根、意根上，六识都能见到佛性的妙用。</p><p>　　十三、我们如何才能快速成佛</p><p>六祖说，但用此心直了成佛。六祖说的此心，就是真如自性如来藏，如来藏是成佛的真体。众生因为有如来藏，把自己所修行的功德和福德累积在如来藏里，累积圆满了，就成佛。如果没有如来藏，众生生生世世所修行的功德就要散失掉，那样永远也不能成佛，况且如果没有如来藏，众生就没有未来世，更谈不上成佛了，所以六祖才说，但用此心直了成佛。</p><p>众生学佛修行，要在三个无量劫中，把世出世间一切法，全部都了知无余，这样无明就断尽了，无明断尽即成佛。佛必须要有一切种智，没有一丝无明，如来藏里所有种子的功能作用全部了知，就是一切种智。我们要把八个识所共同现起的三界世间一切法，八个识的全部体性都证得，世出世间一切法就能全部了知和掌握，所有的无明才能都断尽，智慧就圆满通达无礙，我们就成佛。如果我们学佛修行不懂八个识的体性，尤其是如来藏的体性不懂，就不能证得如来藏，不能明心见性，大智慧不能生起，修行就被卡住，关口越不过去了。</p><p>成佛的方法，就是以修学般若智慧，明心见性证悟真如如来藏为主修，只要能证得如来藏，智慧和福德就会逐渐增长，成佛有期。历代的祖师们都是这样修行的，他们所讲的法也都是围绕着真如如来藏而展开。六祖讲的但用此心直了成佛，也直接体现了这个主题，明了真如如来藏，才能成佛。因为明了真如如来藏，才能直了成佛，这既是主修也是正修。</p><p>六祖在坛经中处处都讲真如的体性，把真如自性的总相讲得很清晰，理路很清楚。修行之后所获得的智慧都是围绕着八个识而获得的，等到道种智圆满时，就是一切种智，那就成佛了。菩萨的修行路线就是这样，学八个识的理是正修行，之前都是在打基础，为证得如来藏明心见性做准备。所有的祖师开悟，都是悟得真如如来藏，以这个为基础，最后就能直了成佛，用这个如来藏直了成佛。</p><p>六祖说，菩提自性，本来清静，这也是讲的如来藏的体性，六祖从来就没有离开真如自性讲过法，历来的祖师们没有一个离开如来藏清净自性讲过法，他们都是围绕着自性清净心这个主题来讲法的。因为自性如来藏是现起三界世间一切法的因，明了这个因，才能直了成佛。</p><p>十四、楞严经中讲的因地心和果地觉同是什么意思？</p><p>因地就是还没有成佛的时候，正在菩萨阶位时，果地就是已经成就的佛地阶位。众生在因地菩萨位所证悟的心，应该是与佛地的那颗圆满觉悟的心是同一个，不能是两个，否则因地心，就不能到佛地去，那就是生灭性的妄心，不是真心如来藏。菩萨明心时所悟的那个心，应该是不生不灭的真实心，不能是有生灭性的妄心七个识。明心悟道时，要悟得真，不能悟错了，悟错了就不能成佛。</p><p>很多人悟得意识心偶尔没有妄念时，就认定那就是原本清净的自性如来藏了，这个误会就大了。如果像这样认贼为子，就要自劫家宝，最后将要一贫如洗，颠倒轮回，不得解脱，既不得真实受用，更谈不到成佛了。</p><p>成佛的真体就是自性如来藏，这个心一直到佛地都不灭失，妄心不能一直到佛地不变不灭，也没有什么真实的功德，都是如来藏赋予的功能作用。当菩萨时所悟的心应该原本就是清净没有妄念的自性如来藏，不用通过修行来强求克制自己不生妄念，然后再认为这个压制了妄念的心就是真如，这个假真如不是佛地那个具足常乐我净的真如，不能认此贼为亲子，否则就不能成佛。</p><p>十五、如何善护自心如理的修行</p><p>悟前和悟后的心都有两种，一种是真心，一种是妄心。善护其心有两个意思，一个意思是要善于护持妄心，使妄心去除染污和邪见，逐步获得清净的智慧，明了更多更深的般若之理，这样才能保证自己走在成佛的正路上，没有偏离正轨。善护其心的另一个意思是，悟前要通过学真心般若之理，明了如来藏是成佛的真体，只有修学如来藏法，才是正修行，要明了如来藏的体性，认如来藏为真实不生灭的我，是实相心体，是出生五阴十八界我的本心，这样才能证悟如来藏，从而获得大智慧。悟后也要善于学习和观察如来藏的功能体性和运作，广修福德，才能不否认如来藏为真心，才能不退回到妄知妄觉之中，成为不退道的菩萨。</p><p>实际上真心不用我们护持，祂不贪不喜不厌，没有无明烦恼妄动，是一尊本来大好的天然自在佛。每个修行人所要做的就是善护七识妄心，要让妄心具备开悟的菩萨所应具备的条件，让妄心与圣性靠近，修行菩萨六度，好好地行持戒定慧，修学正确的般若理，修学正确的禅定，才能满足菩萨六度的条件。悟后也要福慧双修，不能只修慧而不修福，只有福德具足的时候，心性才能柔软和调和，才能接近于大乘的菩萨的心性，从而能承担起菩萨引导众生、教化众生的重任。</p><p>十六、有情与无情的区别</p><p>有情有如来藏在身中运行，如来藏亲自执持色身，众生就有血肉之躯，有受想行识的功能作用。无情没有单独如来藏的亲自执持，就没有肉体和色身的功能作用，没有受想行识的功能作用。众生生存就需要有色声香味触这些无情物来作为供给所需，无情物是众生生存的环境依报，是众生赖以生存的器具。</p><p>没有众生的七识，也就没有无情物的出现，无情物依众生的如来藏第七识而有。器世间既有有情众生，也有无情物，都是共业众生的所有如来藏共同执持着，也不离如来藏而有。当我们吃蔬菜水果的时候，蔬菜水果是共业众生的如来藏共同执持的，我们吃时，进入口中，就会渐渐地成为自己的如来藏单独执持的了，只是执持的方式与执持五阴七识有所不同罢了。因为无情物没有肉体和识心，也就没有觉受，因此就不会痛苦。</p><p>十七、佛法怎样在世间里得到应用</p><p>世间是指五蕴六尘，五蕴十八界的一切法都包含在世间里，五蕴修学佛法，就是在世间里修行，修行以后五蕴得到受用，就是在世间里受用。修行所得到的受用，包括自受用和他受用，他受用也是世间里的受用，所有的受用都在世间里，不出世间外。佛法的修行必然是在世间里应用，只要是必须在世间里修行，就要应用在世间里。我们所学所修的大小乘法，都要在三界世间里得到应用，学得好就能用得好；学不好就用不好，不学就更不能用。佛法不能在世间里得到应用时，众生永远造作苦业而不自知，然后再受苦果，在生死轮回中受苦不断，没有止境。</p><p>修学小乘法，断了我见，不再认五阴为我，渐渐就不再为五阴假我造作恶业，心渐转清净，达到无为，能了生死苦，这样所学所修就在世间里得到了应用，而且应用得很好，能灭除一切世间苦恼。修学大乘如来藏法，明了如来藏的清净无为性，对比自己的妄心心行，就知道自己的妄心七识是多么污秽，生起惭愧心以后，就会逐渐减少恶业，心行越来越清净，福报也越来越大，乐报就会越来越多，世间生活也就会越来越自在，同时也能度化有缘之人，让他人也能得到佛法的滋润，这样佛法也在世间得到有效的应用了。</p><p>修学佛法，不仅能解决自身身体上的疾病，更重要的是能解决心理上的所有困扰，内心里的烦恼越来越轻微，最后心能得到清净和解脱，这样的受用是无穷无尽的，也都是在世间里的受用。最究竟的受用，就是佛的受用，佛不仅彻底解决了三界世间的生死大问题，而且也断除了内心当中所有的无明和黑暗，其佛法修证的智慧不仅照亮了自己，也照亮了一切有缘众生，这一切都说明了，佛法就是在世间里得到应用的。</p><p>十八、众生本来是佛，是否还用修行再成佛</p><p>众生虽然本来都是佛，都有佛性，可是佛性却被七识的无明所遮障，众生一直在恶用佛性，造作恶业，受恶果报，还不能起到佛的善用，所以众生要学佛修行。如果不学佛修行，虽然有佛性，一直在起作用，但是我们的妄心还有无明和染污，还在迷惑颠倒地不断造作恶业，五蕴身就要长久地处于生死轮回中，受无量惑业苦。而自己的自性和佛性又不能代替五阴身去受轮回苦，虽然受苦这样的果报也是虚妄，但是这种虚妄法毕竟存在着，不能消失，因此就有必要把虚妄法变得清净、愉悦、适意，都是乐受才好。</p><p>要想把虚妄的五蕴变得清净适意，就要通过修行佛法，懂得五蕴万法虚妄的真实道理，破除无明，心得清净，一切无明烦恼就消失殆尽，那时身口意行都是清净的，造作的都是善业，所得的果报都是善报，所有的感受都是乐受，最后就能证得佛地的常乐我净，获得究竟彻底的清净无为的寂灭乐。如果不修行，五蕴虽然是空，但是内心不能承认，实际的行为造作还要把五蕴当作实有，烦恼不能降伏和消灭，就要广造无量恶业，仍然要受恶业的果报，五蕴身就要随着业行而受生死轮回苦。</p><p>修行也是要找到真实的不生不灭的真我，依赖祂修除七识妄心的无明染污，七识妄心没有无明了，才与自性清净心相应，才能得到究竟的解脱和获得究竟的寂灭乐，才能究竟成就佛道。</p><p>我们的自性虽然是本来就清净无染的，但是内里却含藏着众生造业的业种，使得众生的五蕴恶报不断，受苦无穷。修行就是要破除七识五蕴的无明，转变染污性，心得清净，得大自在；修行就是修七识妄心，不是要修本来自性和天真佛性，所以众生虽有佛性，还是要修行。众生的自性虽然本来是佛，而众生的五蕴却不是佛，要把五蕴七识修得清净，没有无明了，才是真正的佛。众生现在还只是理上的佛，事上却还是生死业障的凡夫，因此需要修行。修行就是想办法让五蕴也与自性清净心一起作佛，那样才是真正的佛，是究竟大解脱的佛世尊。</p><p>十九、问：前五识、第六识、第七识都起什么作用？为什么说八个识都懂就成佛？</p><p>答：八个识都懂还不行，必须都证得，然后再把如来藏里所含藏的所有种子都证得明了了，才能成佛。</p><p>前五识是眼识、耳识、鼻识、舌识、身识。眼识了别色尘，耳识了别声尘，鼻识了别香尘，舌识了别味尘，身识了别触尘。第六识是意识心，了别的是法尘，起思惟、推理、判断、计划、打算、回忆、妄想等等的心理作用。第七识也叫作末那识，也是意根，是时时处处作主宰的识，能刹那刹那主宰身口意行的出生和演变。如来藏是真心如来藏，是出生五阴身和三界万法的根本识。</p><p>佛也叫作一切种智，如来藏里所含藏的一切种子功能和体性，全部都要了知修证到，一法也无遗漏，没有一丝无明，智慧已经达到究竟圆满，不能再有所增加了，已经达到了大小乘的无学，无需再修行了，福慧两足都尊，就是一切智人佛世尊。所以学八个识之理，是正修行，都学通达，就成佛；如果还有一个法不知不懂，那就不是一切种智的佛，还需要去修证。所以学佛修行，最后把如来藏里的种子都修证到，八个识的所有法都要全部彻底通达，这样就能破尽无明，清净无余，八个识都转识成智，就是三界至尊。</p><p>一切种智里包含了七识心的所有功能体性，万法万万法也都包含进去，这些法全部证得，了知无余，就是佛，八个识全部了知无余，就成佛。三界世间一切法，都是八个识和合运作出来的，一切法都能用八个识来解释，八个识的所有体性全部了知，一切法的本质，就全部了知，世出世间一切法就全部证得了，这只有佛能做得到。佛法就是唯识之理，离开识，就没有一切法，一法也无。</p><p>如来藏用七大种子造就了一切万法，用地水火风四大种子造就了五蕴身和宇宙器世间，用见大和识大出生了七识心，八个识共同和合运作产生了一切法。这些法究竟是如何产生，又是如何运行的，如来藏是如何实现这一切功能利用的，如何实现这一切的因缘果报的，这些都要一一地修证到，这样慢慢地就能破除所有的无明，不愚于任何一法，全部明了，那就圆满了一切种智，达到无学，成就佛道。<span> </span></p><p>未完待续</p></div>"
}]