[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p>内 容 简 介</p><p>如来藏乃是世出世间一切法的发源地，贯穿一切法的始终，是世人所不识的摩尼宝珠，具足一切法的种子，随缘应物无不周。本书从不同的侧面阐述了如来藏的各种功能作用，尽显如来藏主人公的真面目，让学人透彻的了解世出世间一切法全部都是如来藏的真实法界，全体皆真如，无二无他。从五蕴十八界的所有现象界上，仔细剖析了一切法如何都是如来藏的真实功用，其中最深细的部分是如来藏与科学，从科学的角度更细微的剖析出如来藏在其中的生成与执持作用，这样使得大众对如来藏是万法源的真理信受不疑，从而有力的否决了外道断灭论。</p><p>书的后部分介绍了实证如来藏的方法和意识与如来藏的体性区别，分清真心与妄心的区别，并且按照这些方法去实修，能保证学人证悟如来藏而不是错悟生灭的意识。证悟以后定力有所提升，就能逐渐观察如来藏在五蕴十八界上的种种运作，智慧不断的增进，与无我相应，心越来越空，解脱的功德受用越来越大，这就是证悟如来藏的利益。证悟如来藏非常重要，希望广大学人都能依止此书，精进修行，早日证得如来藏，发起甚深的解脱智慧，以快速圆成佛道！</p></div>"
},{
    "title": "如来藏功德颂",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>如来藏功德颂<br/></strong></p><p><strong>我有侍者，日夜相守；百般随顺，孝养备至。</strong></p><p><strong>我若向东，祂不向西；我若坐卧，祂不站立。</strong></p><p><strong>我若吃饭，祂不饮茶；我若视物，祂不闻声。</strong></p><p><strong>我若为人，祂不做鬼；我若上天，祂不入地。<br/></strong></p><p><strong>我若行善，帮我积德；我若作恶，助我一力。</strong></p><p><strong>我若修行，随我出世；我若随流，与我入俗。</strong></p><p><strong>我若思惟，赠我识种；我若息心，赐我寿暖。<br/></strong></p><p><strong>我若行乐，祂则随喜；我若寻死，祂也顺我。</strong></p><p><strong>一切秘密，祂全掌握；善业宣扬，恶也不藏。</strong></p><p><strong>人说祂痴，祂实无私；公平公正，平等一如。<br/></strong></p><p><strong>成佛由祂，流转依祂；成事是祂，成人也祂。</strong></p><p><strong>诸佛国土，由祂成就；阎罗地狱，由祂变造。</strong></p><p><strong>无量功德，聚于一身；是褒是贬，祂全不顾。<br/></strong></p><p><strong>自性清净，不缘尘俗；在圣不增，在凡不减。</strong></p><p><strong>净染皆存，自体不污；不慕诸佛，不弃凡愚。</strong></p><p><strong>历劫无名，心性无我；寿量无尽，不生不灭。</strong></p><p><strong>具足万法，一无所得；无价珍宝，不享分毫。</strong></p><p><strong>本为豪贵，屈尊示贫；入我身中，穿弊垢衣。</strong></p><p><strong>摩尼宝珠，光照大千；若不随祂，永处暗宅。</strong></p><p><strong>与祂相较，惭愧疚耻；今我发誓，向祂学祂。<br/></strong></p><p><strong>擦洗弊腻，去除无明；显祂尊贵，示我德能。</strong></p><p><strong>福慧二足，常乐我净；圆满一切，慧日朗照。</strong></p></div>"
},{
    "title": "第十六章　真与妄的区别",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十六章　真与妄的区别</strong></p><p>一、觉分为真觉和妄觉，能够觉烦恼的心，一定是妄觉七识，而真觉不觉这些。因有妄心的觉，众生才知道有烦恼，因有真心的觉，众生才能生起烦恼，现起烦恼，烦恼才能出现，妄心才能反观自己的烦恼性。这两种觉起着不同的作用，妄觉本身就带有烦恼，然后再感知自己的烦恼。真觉是烦恼的来源之处，但本身没有烦恼，也不会感知烦恼。</p><p>所以才说烦恼即菩提，烦恼与菩提的关系，就是非一非异。非一，菩提不等于烦恼，烦恼有生灭，菩提无生灭，烦恼依靠菩提生，菩提自己不用生，不靠外缘就能存在，烦恼灭了，菩提不灭。非异，烦恼来源于菩提，是菩提的一部分，也是菩提的作用显现。所以在有烦恼之处，就能找到菩提。开悟就是在吃喝拉撒、行走坐卧、嬉笑怒骂、举手投足这些烦恼中，识得那个没有烦恼的菩提心体。</p><p>二、平等觉性分为如来藏的先天觉性，和后天修出来的觉性。先天觉性就是如来藏的觉性，了知如来藏的觉性，就要学习如来藏的体性，然后再参禅证悟如来藏，就会亲自现前观察如来藏的体性。尤其是见佛性以后，在六根上都会证得如来藏的奇妙的觉性。没有明心开悟见性，没有找到如来藏，就不能如实地了知如来藏的觉性，都是相似的觉知如来藏的觉性，不是亲自证得的。</p><p>后天修出来的觉性，就是觉知心七识的觉悟性，觉知心的觉悟有很多内容和层次，有小乘的觉悟、中乘的觉悟和大乘的觉悟；悟前的觉悟，悟后的觉悟，都是七识对一切法的正确的认知和理念，与从前比较有觉悟了。</p><p>把真心和妄心两种体性分开，分别清楚就知道了。尤其是没有找到真心的时候，所有的觉悟都是妄心七识所具有的。明心见性以后，意识心会渐渐地皈依于真如如来藏的体性，向祂学习和靠拢，意根也同时受到熏陶，逐渐减轻贪嗔痴性和意根的不平等性，渐渐地增长其平等性。</p><p>所以后天的平等觉性，就是指意根的平等对待一切法的体性。意根由原来的不平等性，转变为平等性，其转变分为三个阶段：第一个阶段是入初地时，意根第一次正式地转识成智，其体性转变成具有一分平等性了。第二个阶段是入八地时，意根第二次转识成智，转变成更平等的平等性智。第三个阶段是临成佛时，意根最后一次转识成智，转变成彻底的平等性。只有意根转识成智以后，才能达到初步的平等性，看一切众生都是佛，都有自性清净心，都能成佛。</p><p>意根的平等觉性，到达佛地才能真正地具足平等，看一切众生都是看众生的真如自性，了知众生从自性清净心这个角度来说都是平等的，因此公平对待一切众生。佛平等地对待一切众生，以慈悲心来观照着众生，不是说看众生善，佛就对众生慈悲；看众生不善，佛就不慈悲于众生。但是佛是有无量智慧的，观照众生也要分清众生的根基利钝，根据众生所需。没有证悟如来藏时，所获得的觉悟都是意识心的觉悟，明心见性以后，意根就觉悟了。</p><p>觉悟分成很多种，有凡夫的觉悟，有贤人的觉悟，有十地菩萨的觉悟，还有佛的觉悟。凡夫的觉悟是感受到了生活的苦，想要离开苦受，想要修行明心见性证解脱；贤人的觉悟是觉悟了法界的实相，获得了智慧，希望能够得到彻底的解脱和成就；十地菩萨的觉悟是获得了无生法忍的大智慧，希望能够自利利他，地地增进，尽快圆满佛果。后天觉知心的真正觉悟就是明心见性，找到如来藏以后，觉一切法都是自性清净心如来藏所出生和显现，觉悟一切法都是如来藏性。</p><p>三、众生都有本觉，就是如来的智慧德相，因为无明，一直没有发现这个本觉。如果发现了这个本觉，就打破无始无明开始觉悟了，这就是始觉。觉知心开始觉悟了，名为始觉，始觉依本觉而有，始觉的对象就是本觉，因为没有本觉的助缘，觉知心也不能开始觉悟，那也就没有始觉了。始觉之前，就是觉知心的不觉，因为有无明，觉知心才不能觉悟本觉。这个觉知心的不觉也依本觉而有，不觉的无明种子是存在本觉之中的，不觉的觉知心是依本觉而出生的。</p><p>本觉，是本来觉悟，无始劫以来从来没有迷惑颠倒过的心——如来藏。我们常讲：真如无知无不知，无觉无不觉，无念无不念。真如就是本觉，祂没有一法不知，没有一法不觉，没有一法不念。如果有一法，祂不知不觉不念，那就没办法变现这一法出来，也没办法输送相应的种子，那么这一法就不能形成，不能出现。</p><p>有一样不知就是无明，本觉没有无明，祂什么都知。但是祂这种知，不是像七识心的那种知，是知一切法的过去、当下以及未来的状态，不知具体内容和概念，是一种无心的知和不分别的知，体性绝然不同于七识心。七识的知，只限于六尘境界，顶多知道个如来藏之理，世出世间之理。本觉的知，包括三界所有法，世出世间法没有一样不知不觉不念，非常神奇，因为祂出生和执持着一切法，时刻都与一切法在一起。越探究祂的知，对于三界宇宙万有的来龙去脉越清楚明了，我们的智慧就越高，越与本觉相应。</p><p>四、觉有真觉和妄觉，妄觉是七识心，真觉是如来藏。七识心常常能觉六尘世俗法，有时就能觉出自己有妄念，有贪嗔痴了，犯戒行了，觉了以后，就纠正过来，以为纠正过来就是觉悟了。其实这个觉悟还是七识心的觉悟，是妄觉，不是真觉。而真觉就是真如如来藏的觉知性觉悟性，祂从来不觉悟六尘具体境界，不知道五阴此时有没有妄念，犯没犯错误，有没有贪嗔痴，也不会去纠正过来，这些事真觉都不会做，祂永远不分别六尘的各种境界法。所以六尘现前时，真觉永远是清净无为的，只有妄觉是有为的或者是不清净的。两个觉我们应该仔细分别清楚才好修行。</p><p>平等觉性也有两种，一种是指如来藏的本来就有的觉性，另一种就是后天通过修行而出现的觉知心的平等觉性。真正的平等觉性是先天就有，永远不变异，永远不会消失灭亡的，不管众生是如何贪嗔痴，如来藏的觉性都不消失也不隐藏。未悟的众生如果认为有个我，而造作染污业行，他的平等觉性也不会消失不见，因为如来藏永远不灭。</p><p>只是众生由于认假，而不见真，或者是忽略了真，暂时不能发现有个平等的觉性存在，一直在作用着，这就是众生的无明。众生因为有无明，他的如来藏就好像是隐藏了，实际不是隐藏，更不是没有如来藏，是众生自己有无明，有遮障不见罢了。对于悟道的人，如来藏也不是自己就显现出来了，而是因为打破了无始无明，心不迷惑了，就能时刻观察到如来藏的功能利用，因此如来藏的平等觉性，其隐显是因人而异的。</p><p>后天修出来的觉知心的平等觉性，是七识心去除一分染污后的觉性，是生灭变易的，有时在，有时就会消失灭亡，因为有生必然有灭。无我的觉受也是意识通过观察，觉得五阴是无我的，这是意识心的觉受，不是如来藏心本来的无我觉受。</p><p>意识心的无我或者是意根的无我，必须通过深修禅定之后观行参究，才能证得。六七识通过观照五阴中无我，十八界中无我，蕴处界和合衍生的一切法无我，确认这些法中的无我性，从而证得大小乘的果位，将来就能得到解脱，究竟成佛。先天的平等觉性和后天的平等觉性，这两种平等觉性都是极其宝贵的，没有第一种，就没有第二种，有了第二种觉受，就能解脱和成就佛果。</p><p>五、有人说第七识的知就是佛性，这种见解真妄不分，不解佛性的妙用。第七识虽然也有知，但是第七识的知，与佛性的见觉性是两种功能作用，不是一回事。虽然佛性不离第七识而存在和显现出来，但是第七识的知，其内涵与佛性大相径庭。第七识是如来藏里的识大所起的作用，佛性是如来藏里的见大所起的作用。《楞严经》里讲的见大，就是佛性，佛性不需要思惟得太明了，不需要深入参究，太明了时，福德和定力又不具足，见佛性就很困难。</p><p>明心以后，修好禅定和福德，二者都具足时，再参究佛性，就有机会得见佛性。如果差一个条件，见性就没有指望。所以条件不成熟时，不要去深究佛性的内涵，应该多修福德，多修定力，当未到地定很深时，再细心参究佛性，那时就有机缘见性了。</p><p>第七识都知些什么法呢？因为第七识有不太细致的了别慧，第七识知六尘的法尘境界，知如来藏所显现出来的一切法尘相，但只是知个粗况，不知细节和具体内容。如来藏现起什么，第七识就缘什么，缘什么就知什么，但那个知，不能知道具体的法尘是什么，只能知个大概轮廓。</p><p>我们参禅用的知，表面上和前期阶段还是以第六识的知为主，在参禅的后期阶段和深层次里，却以第七识意根为主，第六识配合第七识，提供一些相关和必要的理论依据，第七识才能深细的思量和抉择。但是第六识的知性从来也没有离开过第七识的知，第七识一直在深细的运作着，第六识才能有其分别了别性。参禅主要用意识来参，用意识这个知性，把这个知修好了，时时刻刻带着这个知的念，悬挂在意根心里，再把这个念转换成话头，就能参禅了，非常快。知念一转就是参禅的念，把心心念念知道一切法的念，换成话头，换成一个公案，换成某个法的内涵，就可以参究，有朝一日就能证悟。</p><p>六、问：楞严经上佛说：诸可还者，自然非汝，不汝还者，非汝而谁。此不可还者，就是最后剩下的此能知之性，了了分明，不着见闻。这个能知之性是自性真如吗？</p><p>答：楞严经中佛所说的不可还者，是指众生的佛性。佛性不能归还于任何一个世间法，因为佛性不从任何一个世间生灭法中而来，不是因缘所生法，而是归属于如来藏的性用。佛性在六根六尘上运作，但不见六根和六尘，能见六根和六尘的是妄心七识。</p><p>了了分明时，明的是什么内容，这是最关键的；如果明的是法尘境界，那是意识心所明的，自性如来藏并不见法尘、不知法尘、不明法尘，只要有个明，就有见闻觉知性，能见六尘色声香味触法，至少也能知入定与否的法尘境界，这就是意识的知，是意识的明。</p><p>了了的了字，是清楚明了的意思，意识只要存在且不散乱，就能清楚法尘境界；而如来藏从来不清楚法尘境界，绝不了了。了了分明，来自于法尘境界，由法尘境界所引起，如果法尘境界消失，就没有了了，这个知就是可还的，因此是生灭虚妄的。能知之性，要看知个什么，如果知法尘，知自己有没有入定，睡着就不知了，那这个能知就是意识的知，是生灭变异无常法。</p><p>楞严经里所说的不还给任何一个法的，没有来源的，不生不灭的，就是如来藏性、佛性。在断我见时，把可还的生灭法都否定掉以后，参禅就能证得那个不能还的如来藏或者佛性。把六识七识的能知之性，都否定掉，才能认清那个不生灭不可还的如来藏。如来藏的能知性，在开悟以后才能证得，如来藏所知的相分，与六识七识知的相分有区别有界限，悟前观察不到，悟后如果没有后得智别相智，也很难知道如来藏到底能知什么法。</p><p>七、佛法当中最基础的小乘佛法，是要修行苦集灭道四圣谛之理，观察五阴之苦患，明五阴苦之集谛，知五阴苦之灭谛，修灭五阴苦之道谛。然后一一观行五阴的苦、空、无常、无我性，内心深处真认可了，就断我见证初果，三恶道的业从此消灭。依照佛的教理用智慧去作观行，其中也不离戒律的修行，不离禅定的修行，以及福德因缘。</p><p>观行时主要是识阴的虚妄不容易观行，尤其是意识心太深细，也很广泛，把意识心找全，然后一一都否定掉，认可这些识心作用的虚妄也是很不容易的。如果能对识心的体性作深细的了知，然后把识心的所有作用处都找出来，再观行其生灭虚妄性，就能有把握把我见断彻底。意识心的境界很广泛，大家一般容易知道散乱和起烦恼的意识是生灭和虚妄的，可是往往却不知意识入定，变得深细和清净，不起妄想，没有念头时，这个境界也是生灭虚妄的，此是意识定境，非是不变的真心境界。</p><p>既然是境界，境界就是法尘尘境，法尘境界是意识心所分别的对象，那么知道入定了、进入定境了，这个知定境的是意识心，是生灭法，不是我，不是真实的。因为出定以后就没有定境了，于是念头就又产生出来了，这样有变化有生灭之法，就是虚妄法，不是真实不变异法。六祖说：那伽常在定，无有不定时。真心永远在定中，没有出定，也没有入定，没有增减变化。</p><p>佛在楞严经中说：内守幽闲，犹是法尘分别影事。佛说的就是这种入定的情况。祂老人家早已料到众生难以识别真假，尤其是末法时期，众生福薄，邪见炽盛，不能认清和辨别真伪，世尊特在楞严经中专门提示，以警示后人。</p><p>八、众生一般来说都是有很多的分别，但也都是在世俗法中的人我是非的小事上来分别，心当然是不清净的，往往能感召生死。但是在大事大非时，我们一定要好好分别，善于分别，才能分清是非对错，行于正真，不落因果，也不落生死。尤其在佛法的修证上，更应该好好分别，才不至于走错路；如果不分别，修错方向，不但不得解脱，反而更增生死。一切事情都要善于分别，没有智慧就分别不清楚，是非和善恶都把握不准，身口意行就不能清净无余，也不能行于正真。</p><p>在佛法的修证上，我们确实应该好好分别，善于分别，内心应该清楚，佛经中以及祖师的各种开示当中，某一法某一段落是讲真心如来藏的体性，还是在讲妄心七识的体性，分别清楚了，才能不把妄心当作真心，不会混淆真妄二者的体性，修行就不会走错方向，这是非常重要的，如果分别不清楚，就没法修行了。</p><p>如来藏有如来藏的体性，意识心有意识心的体性，二者截然不同。意识心无论怎么样，也不能像如来藏那样不分别六尘，对一切法都无念想；除非是意识心灭了，才不分别了，否则只要意识心存在，就要起分别作用，五遍行心所法当中的想心所是必然要起了别作用的。</p><p>九、人的思想是意识心的分别、分析、判断、思惟、推理等等心理活动，意识有时与前五识在一起共同分别，有时自己单独分别打妄想，单独分别打妄想时又叫作独头意识，包括梦中和定中的意识活动。意识心的体性有粗有细，细的时候，我们自己很难发现，有很多时候意识心刹那刹那都在起作用，都在了知。除非意识在灭去时，不起作用，没有了别性，其余时间只要意识存在，就在分别着法尘，可是自己却反观不出来。为什么反观不出来？因为智慧不足，定力也不足的缘故。而当反观不出来时，有人就说自己达到无心状态了，或者说自己无念了，还有的说，我证得了无妄想又无念头的真心了，但是这个误会太大了。</p><p>如果有人做禅定功夫，心里修到无念没有妄想时，或者是前念已断，后念还没有起，中间这时候，内心清清楚楚，了了分明，这当然是意识觉知心，因为这种状态毕竟是属于觉知的范围，否则就没有了了分明，也没有清清楚楚，正是意识心了知了这时没有妄想的法尘境界。</p><p>而这时的意识心不是无所不能的，其功能有很多局限，与真如如来藏的功能大相径庭，无法比拟。如来藏永远不了知境界，不知道有没有妄想和妄念，也不知道入没入定这些事情，祂不了知六尘境，如来藏对于六尘不知也不住。如果把这时了知了没有妄想的境界意识心当作真如，就认为自己开悟了，这样错会佛法就严重了。佛在楞严经中说，如果一个穷人说自己是国王，就会被国王抓住杀头。那么在佛法中，没有开悟说开悟，冒充大菩萨和法王，更是罪业极重。我们在佛法中修行应该是非常谨慎的，慎之又慎，才能免遭罪报。</p><p>真正的开悟，就像五祖说的那样，若见性，轮刀上阵也见。这个意思就是说，真如佛性时时在五阴的各种活动中放光芒，不必把意识修到无念时，真如佛性才显现出来，只是在心动得很严重时，不容易证得真如佛性而已，不是说在妄想重重心思活动很乱时，就没有真如佛性了。</p><p>所以即使是真的开悟了，也不用意识心在各种境界上锻炼自己去除妄想，不着境，不沾染，去除取舍心，以保任这个所谓的见性境界。真正的开悟明心，一悟永悟，即使妄想很严重，真如如来藏也不会丢失不见了，这时照样知道哪个是自己的如来藏，也知道别人的如来藏是如何起用的，根本不用悟后保任意识心没有妄想，而认为这样才是保持悟境。但是悟后如果意识不努力保持禅定，就无法降伏烦恼，也无法观察如来藏的运作，智慧就不会提升。</p><p>有贪染的心，才需要保任，如来藏不用你去保任祂，祂永远存在，时时处处都存在，即使杀人放火时也在，赶也赶不跑祂，因此不用担心祂会消失不见了。如果是悟个意识心才会有这种担心，担心这个心又出烦恼妄想了，那么悟境就消失了。这不是真正的悟，而是误会了的误。学佛修行的人，大需仔细又仔细，不能认贼作父，意识心永远不是本心，不能当作本心如来藏。</p><p>十、有人说意识心修到无住，就是悟了，什么叫作住和无住呢？无住是什么状态和境界？</p><p>世尊在阿含经中讲，六根触六尘，生六识，三者和合触，识就能分别、辨别、了别、明了六尘。那么根触尘时，就是住尘，否则就不能触；产生六识出来以后，识再触尘，也是住尘，否则就不能触尘，触尘之后识才能知尘。根触尘多长时间，就是住尘多长时间；识了知尘多长时间，就是触尘多长时间，识触尘多长时间，就是住尘多长时间。</p><p>根尘识三者和合触，就是根与识都住尘。比如手拿球，手就是住在球上了，否则就不能拿球。手触球，身识就产生出来，身识触球，就是住球上，于是就拿住球了。同时意根与球上的法尘相触，产生意识出来，意识触球上的法尘时，就知道是球了。那么意根、意识、身根、身识都是住尘的，拿多长时间的球，就住多长时间的尘，不住尘时，球就掉下去了。眼识看见了球，也是住在球上了，意识、意根、眼根都同时住在球上了。</p><p>意识打妄想或者思考问题时，意根与法尘相触，是住法尘，意识生出来与法尘相触，是住法尘，然后意识才能思考法尘，进行推理、思惟、想象、比较等等心理活动。如果几个识知道了什么法，就住了什么法，不住法时，就没有触，也就不知道法了，所以识心知法，就是触法，就是住法，不是无住。</p><p>无住时，就是识不存在时，识不了知时，识入深定时。没有识时，就是不知法不住法时，那是无想定和灭尽定的境界；昏迷和死亡以及睡着无梦时，没有六识，那时识心是不住的，但是还有意根的住。总之，只要有识，就有住，所以如果说意识心是无住的，就不对了。即使意识真的无住，也不是如来藏，即使意识不在意六尘境界，对六尘境界无心，也不是如来藏，悟得这种意识，不是开悟境界，离开悟还差得很远。</p><p>真正的开悟是悟得如来藏本心，如来藏有住吗？住在哪里了吗？如来藏没有住，祂是真正的无住之心。如来藏看不见色尘，肯定不住色尘上，听不见声音，肯定不住在声音上，嗅不到香臭，肯定不住在香尘上，不知酸甜苦辣，肯定不住在味尘上，不觉冷热触痛，肯定不住在触尘上，不知道善恶是非好坏，也不知是世俗法还是佛法，祂肯定不住在法尘上。这就是如来藏的无所住，虽然祂无所住，却仍然能产生一切法，祂就是我们所说的无住生心的心。</p><p>六祖当时就悟了这个心，才说出五个何期自性。如果悟个意识心的无住，怎么能知道五个何期自性？悟个意识的无住怎么能成就佛道？外道们都把意识的无住入定的境界，当作涅槃，真是错会大了。还有人认为开悟就没有意识了，那么开悟就是什么也不知道了吗？如果是这样，就无法生活下去，也无法继续修学，等于死人一样了。众生不管悟与不悟，都离不开意识心，悟前用意识心思惟佛法参禅，开悟当时就用意识心悟个真心如来藏，悟后也要用意识思惟佛法，观察如来藏更深细的体性，为人宣说佛法也是用意识心，离开意识心，寸步难行。所以说开悟仍然用意识心，所有的圣人都用意识心来应对一切法。</p><p>十一、禅宗以无念为宗，无念是指如来藏心体的无念，禅宗就是以无世俗念的如来藏为宗旨，来建立一切法。禅宗以无住为本，无住是指如来藏不住三界世间六尘境界，祂是个无所住的心，禅宗就以这样无所住的如来藏为本心，来建立一切法。禅宗以无相为体，如来藏虽然无形无相，其体是真实存在的，禅宗就以无相的如来藏为体，一切法都是以如来藏为体而得以建立。</p><p>既然如此，修学禅宗，就不是把意识心通过修定变成无念无想无住无相的状态，然后就把这种状态认定为证得真如，从而开悟了。我们无论怎样改变意识心，变来变去最后仍然是意识心，祂永远不能变成原本就无念、无想、无住、无相的如来藏真心，因此就不能把意识处于这种状态称为开悟。真正的开悟就是用意识心去证得如来藏本心，发现如来藏本心的运作。</p><p>意识妄心的体性和如来藏本心的体性要严格区分开，不能把二者混淆，要认清二者的本质，以后才能快速地明心见性。识的体性就是有分别和了别性，如果想要自己不分别，只有灭掉意识才能做得到，但是灭掉意识只能入定，不能参禅；如果不能参禅，就不能悟道，所以修行不是要灭掉识心，不是要不分别，相反还要善于分别。阿含经以及大乘经典都讲了识的体性，识就是识别，识别就是了别，就是分别，学佛修行对识的概念一定要弄清楚，修行才有下手处。</p><p>十二、意识虽然是生灭的，但是修行首先就是要修意识，然后再影响和带动意根也破无明，最后成就佛道。众生杀人以后，杀人的行为虽然灭了，可是杀人的业行却作为种子留下了，种子成熟，就生根发芽，开花结果，将来一定会受杀人的业报。同理，意识通过修学大般若，获得了大智慧以后，意识临终虽然灭了，可是其智慧却作为种子存入到如来藏里，将来就能获得大智慧的果报，以至将来就能以此智慧修成佛果。</p><p>意识分别一切法时，有善分别和不善分别，有清净和究竟的分别，有不清净和不究竟的分别，还有的是恶分别、邪分别、错乱分别、狂乱分别，可见意识分为有智慧的意识和愚痴邪恶的意识等等多种。那么修行是修什么？当然是要修六七识，修妄心，把六七识修除无明，修出智慧，让七识智慧圆满，破除所有的无明，转八识成四智，圆满一切法，究竟成佛。在众生杀人放火时，如来藏的智慧正大放着光明，可是众生的七识却是非常愚痴的，非要杀人放火，造作恶业，将来再受恶报，生死轮回不断，苦恼无边，因此修行当然是修七识妄心，让七识断除贪嗔痴烦恼，回归自性，获得大智慧。</p><p>如来藏虽然有般若大智慧，但是如来藏的智慧属于如来藏的智慧，也与六识七识的智慧不同，祂不能代替七识妄心的智慧。我们修行就是要依止于如来藏本有的智慧，来获得七识的智慧，七识有智慧了，就转识成智，成就佛道。我们信佛学佛，就是六七识在学，六七识在修行，六七识在逐渐地明理，逐渐地降伏烦恼，无明一点点地淡薄，到一定时候，就开大智慧，那时就修成就了。</p><p>十三、维摩诘经有云：知是菩提，了众生心行故。这里的了和意识心的了了分明有什么区别?</p><p>知是菩提，意思是说如来藏这个菩提心有能知性，因为祂也是识，有识的体性。了众生心行，意思是说如来藏能知能了别意根的心所法，了别意根的作意和思心所。了，是明了和了别的意思。了别了意根的心行以后，就会随顺于意根，变造出相应的法，造就众生相应的身口意业行。但如来藏永远不了知六尘境界，不了别色声香味触法。而意识心只要存在，就知六尘，了六尘境界。</p><p>了了分明的意思是，意识对于相应的六尘境界，一清二楚，内心明了，不糊涂，什么都知道，可是却没有语言、文字、思想的动念。意思就是说，意识心里明白接触到的各种境界，却不用语言表达出来，内心里也没有文字出现来形容，也没有念头的动转。只要是对应于色声香味触法的六尘境界，所有的了别性都属于意识心的了知。如来藏不知六尘，不了别六尘具体境界。对于如来藏的知，这部分内容，没有明心开悟的人，不能观察得到，也不好理解。</p><p>意识心的了了分明，是对六尘境界的知，意识心了了时，就是分别完成了，分别了就是知道了，就是了了；分明就是很清楚，了然于心，更是分别完成，才能分明。了了时，是现量，是对目前的境界了了，不是比对而知，所以不是比量，比对而知时，一定是有思惟，有动转，不是一念不生的了了分明境界。如来藏的体性是不了别六尘，对六尘是无知无觉的，不知好恶是非长短方圆。如来藏所了别的范围非常广泛，包括了别众生的五阴根身、宇宙器世间、众生的业种等等。如来藏犹如镜子，谁来照谁，自己却不知道是什么，不了了也不分明，是镜子里的人了了分明，这个人就是指意识心。</p><p>真心如来藏和妄心意识的体性，一定要分清楚，对于一切法才不愚痴。如来藏不是权设假设的法，是本来就有，不用再从外得。也不是修行不起念时，了了分明时，真心如来藏就出来了，不能把了了分明的心当作真心如来藏，了了分明的是意识心。真心如来藏不管你起念与不起念，分明与不分明，了了与不了了，祂一直都存在着。真心如来藏也不管你颠倒不颠倒，祂本来就不颠倒，本来就在，对于六尘境界如如不动，不分别，不起念，不散乱，不随境界转，始终保持自己的无为性，而不动摇。</p><p>十四、法本无法，意思是说如来藏这法当中 ，一法也无，无形无相，心体本空。这句话不是让我们舍去成佛之心和修法之念，那样就不会出离生死火坑。不学佛的人都没有成佛之心，和修法之念，但他们永远处于生死轮回中。</p><p>不思善不思恶之心，是指真如心，祂没有思考三界法六尘法的功能作用，祂本来就不思，不知善恶是非。不思善恶不是说让意识也处于不思善恶是非的状态，就成为真如了，意识心也不思的时候，就是入定状态，入定状态仍然是意识心的境界，不是真如本心的本有状态，因此不能把意识心不思善恶时，就当作真如，就以为这时候开悟了。意识如果入定不思惟了，就不能参禅，不参禅不思惟，就不能悟道。</p><p>我们修行所体证到的智慧境界，都可以用言语表达出来，表达不了的，有可能是没有真悟。如来藏在哪里，哪个是，怎样起作用的都可以表达，简短几句话就能表达清楚，长篇大论更能说得详细。佛用四十九年时间，也没有讲完如来藏法，只讲出来极微少的一点点，没讲出来的法还有极多极多。所以只要真实证悟，都能把如来藏表达出来，也会表达得很准确到位。</p><p>十五、八识能否了别身体的状况</p><p>身体的变化无非就是胖了、饿了、瘦了、渴了、轻安了、舒适了、疲乏了、困了、还有呼吸的状况，色身内脏的状况，血液流动的状况，身体任何一个部位的异常状况，这些都属于身根的运行情况。身体的各种状况，各种变化，最直接的了别是身识，最具体和清楚细致的了别是意识心，时刻刹那不间断了别的是第七识。意识心了别了以后，祂就会生起名言，把身体的某种状况定义为渴，把某种状况定义为饿，把某种状况定义为舒适和昏沉等等，名言和概念是意识心分别之后的产物，把这具体情况分别出来以后，就有文字和语言的出现。</p><p>第七识对身根也有了别性，而且没有间断时，从入胎到死亡，以及中阴身里，都在时刻攀缘身根和了别身根状况。第七识缘于如来藏变起的身根相分，而有自己的识别了别性，祂只能了别粗略的状况，不能作具体的了别，因为攀缘的法太多，心识不能集中，也就没有足够的智慧作具体细腻的了别，但是身体的异常状况，祂能首先感觉出来，意识心不知道的，祂就已经先知道了，有时就要警觉意识来了别和关注身体的异常变化。</p><p>在六识灭掉时，比如睡着以后，昏迷以后，入定以后，第七识都在坚守和执著着身体，在昏迷时，身体只要稍微缓过来一点，祂就要唤醒意识出来，让身体动起来，在身体受伤时，祂能努力强撑着身体，不让意识和身识灭去，顽强地守着身体和生命，祂认为身体是祂的，六识都是祂的，色声香味触法都归祂所有，因此祂才执著不舍，是最顽强的一个识。当身体出现病痛时，即使睡着六识都已经灭去时，祂还一直在惦记着身体，一旦身体病痛加剧，祂就马上唤醒六识来处理身体的状况，以至于一宿不能睡个安稳觉。因此说第七识能了别色身的状况，了别粗略的状况，有个粗糙的判断，只是不能细腻一些。</p><p>第七识和第六识的了别性也有很大的区别，只是六识的了别性比较详细和具体，能给出概念和定义，能用文字语言表达出来。第七识和如来藏不能了别身根具体的状况，不能给出概念，也不能下定义，不能用文字语言表达。</p><p>如来藏是否能了别色身呢？如来藏也能了别身体的状况，如果说如来藏对身根不能了别的话，身体就没办法产生变化，也没办法继续存在下去，祂还是能够了别身根的。但是祂的了别性与身识、第六识和第七识的了别性完全不同，祂绝对不能具体了别身根是哪种状态，也不会出现名言，不与文字语言相应。如来藏对身根的了别，还是以了别种子最为根本，祂了别了业种和业缘的同时，就知道身根当前是什么状态，下一步要如何变化，然后输出四大种子让身根发生变化，这种变化一定与业种一致。</p><p>其中具体的如何祂还是不知道，比如现在皮肤还挺好，一会就要有个因缘促使皮肤出现病变，祂知道要如何改变皮肤的状态，但是祂心里没有概念，没有湿疹或者是水泡的概念，祂就能变出湿疹和水泡等等之类的东西，祂是从业种和业缘上知道要如何变化皮肤，世俗的名言和概念祂没有。因为如来藏不了知世俗法，所谓身体具体的变化的状态，如胖、瘦、扭伤、骨折、流血、肿瘤等等这些名言概念祂不懂，这些属于世俗法，如来藏不了别具体的世俗法。</p><p>祂有祂了别的内容和方式，七识心无法知道祂的心理，如来藏主要是以了别种子的形式，知道身根当前的大致的状况，以后一段时间内的状况是怎么样的，祂也能知道业缘要如何演变和发生，但是心里还是没有我们世俗界的名词概念，第六识与如来藏不能用语言文字来沟通。如来藏依种子判别就知道身根下一步应该如何变化，再下一步应该如何变化，下一秒钟、下一分钟、下一个小时、或者第二天身根要如何变化，祂依据种子，有一个大概的判断，祂这种判断和我们七识心的判断还有很大区别，如来藏的了别性和七识的了别性截然不同。</p><p>再者，如来藏通过了别七识心行，也能知道身根要如何发生变化，比如让身体上火了、发胀了、咳嗽、头痛等等，祂随顺配合七识的心行，促使身根出现以上种种变化，使得身心保持一致，互相影响，这种身根的变化也是三个能变识共同和合运作的结果。</p><p>十六、如来藏只有了别到身根的情况，才能帮助身体正常运行，当身体出现异常时，才能帮助身体复原。比如说身体受伤、皮肤破损、流血，身体做手术了，如来藏肯定知道身体的状况，之后就能自动的给身体受伤的地方弥补上肌肉，让身体复合，让筋骨连接完好，恢复如初。如来藏通过不断的输出四大种子，让身体复原，逐渐健康起来，所以如来藏能了别身根，配合身根，实现业因果报。</p><p>只是如来藏了别的方式和前七识，尤其是和意识都不一样，祂不了别具体的世俗法方面的内容，但是祂还是有祂独具的了别方式，祂了别之后，不会给身体情况下个定义，加个概念，没有受伤、流血、骨折、溃烂等等这些名词概念，也没有想修补的心行，祂只是按照祂特有的程序来运行，祂的心行真的不好窥探。</p><p>祂没有名言，没有概念，也不知道身根具体的状况，但是祂能完全配合身根配合七识，完成身根的各种变化，达到与业种、业缘和七识同步，这说明如来藏能同时了别无数色法和心法。身体手术了，受伤了，祂会帮助恢复，渴了、饿了、疲乏了、困了，祂能配合身根和七识解决出现的问题。如来藏的配合主要是配合意根，因为意根也了别身根，因此就想改变身体状况，祂了别意根的心行，就配合意根，让身根有相应的变化，除非因缘条件不允许。</p><p>既然一切法都是如来藏所生，如来藏所变幻，如来藏所变化，一切法因为如来藏才能产生变异，才能有生住异灭，我们就要仔细思惟，如来藏对一切法有没有了别性，有没有见的作用。祂肯定有，祂能够了别一切法，只是了别的方式和内容，与七识大不相同，我们现在没有甚深的智慧观察祂的心行，没办法了解祂的心行，也没办法与之沟通，只有当自己证悟了，有了道种智以后，自己慢慢的一点一点体验观行，对于如来藏里的秘密才能都通达了知。</p><p>十七、如来藏的了别性与前六识了别性的区别</p><p>我们的思想念头、观念、想法、知见，都属于想蕴和行藴范围，想蕴是指六个识心对六尘境界了别的功能作用，继而又取相执取。这种功能作用是如何产生出来的呢？有人说念头存在如来藏里，是如来藏出生的念头，但是如来藏并不存念头，祂只能存种子，存业种。念头是一种法，如来藏存一切法的种子，种子输出以后，就产生了法。意根作意攀缘法尘，触了法尘之后，了别不清楚，又要想了别法尘，如来藏就会配合意根的思心所，生出意识心来了别。</p><p>意识心生出来以后，意识的作意心所法就开始运作，意识就作意于意根想要了别的法尘，之后触法尘；触了法尘以后，受心所出生，意识就领纳领受法尘；领纳了法尘以后，想心所运行，想心所了别法尘，取法尘的相，执取法尘；之后就有感受，受蕴出来了，感受以后还要再想，下一步思心所运行出来，意识就要思量思考，对法尘有了胜解，于是思想念头不断的出生、发展、变化，语言也就此产生出来，所以思想念头就是意识心的功能作用。</p><p>从以上分析来看，说念头是存在如来藏里的就不对了，如来藏不存念头，而是存种子、存业种，业种现行，识种子生出来，法尘和意识心就出生，意识了别法尘以后，对法尘有了胜解，然后才能有念头。如来藏出生法尘以后，意识了别法尘时就会出现连续不断的了别功能作用，意识执取法尘、思量法尘时，就有思想念头、回忆、妄想、希望、打算、以及想像，这都是属于意识心的功能作用，属于想蕴和行藴。</p><p>想蕴就是六识心生出来以后，对法尘的了别取相作用，也就是由五遍行与五别境心所法而运作出来的取相分别性。之后行藴的思心所的行为造作就出来，各种念头就不断的出现。所以说念头是意识心的念想作用，是意根攀缘的结果，由如来藏出生。</p><p>如来藏和第六识的区别我们应该能清楚，如来藏有几个遍，遍一切处，遍一切界，遍一切时，遍一切地，遍一切法。遍一切法是最主要的，一切法主要指六根六尘六识上的法，还有超过六根六尘六识的法，六识缘不到，也了别不到的，是由如来藏出生，意根能缘，但不能具体了别的法。凡是由如来藏所出生的，不管在七识心上留影还是不留影，都叫作法，如来藏本身也是法。</p><p>我们应该知道，既然一切法都是由如来藏所出生的，由如来藏所执持，那么如来藏肯定在一切法上，和一切法在一起，如来藏不可能是生灭性的，因为一切法不可能同时都灭，总有存在着的法，那么如来藏必然同在，这个法灭了，那个法生出，只要有法存在，就有如来藏存在。</p><p>那么有人修定心里没有念头时还有没有法的存在？在没有念头的时候仍然有法存在，眼识还能看见眼前的光明或者是黑暗，耳识还能听见周围的声音，心里没有念头也知道有什么声音，没有念头的时候，身识也知道身体的感受，五识只要在了别五尘境界，第六识就一定存在，祂必须配合五识了别五尘境界，外加一个法尘境界，这时候六尘都在，六识心也都存在，六识心只要存在，就要了别六尘境界。除非入深定了，入深定了还知道自己入定了，还有心喜，说明意识心还在。但是有时候意识了别不清楚自己所处的状态，也许还不知道自己在了别，一个可能是因为祂自己的心识弱，再一个可能是因为意识有愚痴性，反观力弱，愚痴的人没有能力反观自己到底在干什么，不知道自己有什么样的心念，在起什么样的作用。</p><p>如果心中某个法灭了，还有了别这个法的意识心存在吗？那就没有了，意识心在这个法上就不存在了。但是另一个法生出来，意识心了别到了，就在另一个法上出现；当另一个法灭了，了别那个法的意识心就随之而灭，意识心总是在随着六尘法生，随着六尘法灭，意识心是要随着境界的转换而转换的，境界的转换一个是意根的攀缘在不断的转换，一个是境界的因缘要不断发生生灭变化。</p><p>而如来藏不管法生法灭，祂一直存在着，这个法灭，那个法还在，如来藏一直在执持着祂所出生的一切法，有些法我们能接触得到，有些法我们就接触不到，但如来藏一直都存在，都接触。所以在修定时，不管心中有念没念，如来藏都在，我们睡着的时候，更是一点念想也没有了，但是如来藏还是存在；即使昏迷了，如来藏还是存在，到临死亡之时，任何一种想法都没有了，马上就要死了，如来藏仍然存在；即使六识都灭了，还有意根在，那么如来藏就存在着。因为祂遍一切处一切法，没有祂就没有法，有法就有祂。</p><p>我们一般情况下所能知道的了别性，都是指第六识的了别性，以第六识的了别性为主，当然前五识也有了别性。眼识的了别性，能见光明和黑暗，当眼前看不见黑暗，也看不见光亮，这个时候肯定没有眼识了，只要能看到一点亮光，即使是闭着眼睛，还能知道眼前是黑暗的，这个时候还是有眼识的存在。</p><p>前五识的了别作用比较粗浅，我们很容易就知道有没有五识的存在，这个知是第六识的知，第六识能知五识是否存在，能知五识的状态。但是第六识的体性比较微细，了别的范围非常广，能把第六识了别的范围都了别到，也是不太容易的，当然了别第六识的了别，还是第六识自己，这是第六识的反观力作用。</p><p>我们所能接触到的一切境界就是六尘境界，只要把六尘境界的概念弄清楚了，就能判断出自己所接触和了知的境界是不是属于六尘境界，只要是六尘境界，能了知六尘境界的心，一定是六识心，肯定不是如来藏。因为如来藏了别慧特别劣，祂不了别六尘境界，六尘境界是好、是坏、是粗、是细、是美、是丑，如来藏都不知道。</p><p>但是如来藏也是识，祂也有识的功能作用，识的功能作用就是了别分别的作用，如来藏了别分别的作用是什么？祂在何处起了别分别作用呢？我们知道，业种成熟业缘现前时，果报就出现，因为什么而出现果报、受果报呢？是因为如来藏把业种输送出来了，果报是与众生造业的业种相一致的，就是说众生造什么业，肯定就要受什么样的果报，我们现在所受的果报肯定是从前造过的业所感召到的。</p><p>那么如来藏是如何把业种输送出来，让我们受到相应的果报呢？如来藏是如何产生我们的五阴身，产生五阴所受用的色声香味触法和三界世间法呢？因为如来藏有了别业种的功能作用，祂了别业种以后，知道缘熟了，就能让业种现行出来，按照业种如理如法如实的变现众生的五阴色身，变现五阴身生存的环境，变现五阴身的一切业缘，如实的实现众生的业因果报。</p><p>如来藏不但能了别业种，还能了别根身，五阴身现在处于何种状况，下一步五阴身应该如何变化，再下一步五阴身又应该要如何变化，如来藏因为能随时随地了别业种的关系，这些事祂都知道，祂能依业种和业缘使五阴身出现各种各样的变化，五阴身刹那刹那的生灭变异，都是如来藏对五阴身和业种的了别作用的结果。</p><p>如来藏还能了别五阴生存的宇宙器世间，宇宙器世间其实也是在刹那刹那发生着变化，我们现在没有能力观察出来，因为心太粗糙，智慧太低劣了，无法了知这些生灭变化现象，也没有甚深的禅定和智慧观察到这些现象。但是我们却能观察出一段时间内宇宙器世间的生灭变化，这些变化都是如来藏依据众生的业种，在刹那刹那的变现和维持着。宇宙器世间要如何变化和转变，如来藏都能知道，所以祂要不断的输送四大种子，不断的改变着宇宙器世间，宇宙器世间才有生住异灭的现象存在，宇宙各种现象上的发生和变化，都是如来藏了别宇宙器世间、不断变造宇宙器世间的结果。</p><p>如来藏因为能了别业种，了别宇宙器世间，祂就能让宇宙器世间不断的发生变化，比如最大的最初的变化就是我们这个世界的生灭，地球的成、住、坏、空，这都是如来藏的功能作用，如来藏依据业种，不断的输出四大种子，就能让宇宙器世间出现这些变化，所以如来藏作为识，祂也有了别性。</p><p>如来藏这种了别性，我们一般都观察不出来，因为没有证得如来藏，也没有甚深的智慧，我们一般所能知道的了别性都是前六识的了别性，意根的了别性我们也无法了解，所以我们知道的了别性，肯定就是前第六识的了别，以意识心为主，不大可能观察了知到如来藏的了别性。</p><p>如来藏和第六识这两个识的体性，我们应该仔细分清楚，分清楚以后，在将来参禅的时候，就不会把我们所处的清清静静的状态，没有思想、没有念头的状态，当作是开悟的状态，认为自己的心清静了，达到无知无念了，这就是清净的如来藏。可是这里还是有个知，知境界法，知自己清净和无念的知，这正是第六识对自己的反观性的知，不是真心如来藏的知，也不是意识的无知。但是这个时候如来藏的知和无知也都在，需要我们用慧眼去把祂识别出来，这样就能找到自己的主人公，参禅也就达到初步的成功了。</p><p>十八、言语道断，是指真心阿赖耶识根本的体性，祂没有语言，也不通达晓了任何语言。因此祂不说话，我们说话，祂也听不见，听不懂。所以我们想开悟找到祂，祂也不会说，我在这里，这就是我，所以参禅这种事跟祂无关，祂不理会这件事。但是在参禅时，没有祂的佐助，我们真就不能参禅，没有祂的佐助，我们什么也不能做。换句话说，没有祂，根本就没有我们，更不用说参禅了。</p><p>所以言语道断，是指祂不通语言，不通文字，不听劝告，不听骗，不听哀求，不听吩咐，不听利诱，不听两舌，不听恶口，不听绮语，不听是非，也不听赞美，语言文字，干脆就不用施加于祂。言语道断的意思，不是让我们修到自己没有语言时，就是悟了。妄心的没有语言与真心阿赖耶识的本来就没有语言，不是一回事。</p><p>心行处灭，也是指真心阿赖耶识的体性，真心没有任何心行，没有任何想法和打算，没有任何贪求和厌弃，祂无所求，也无所得，因此事事都不作主。在六尘任何境界里，祂都不起心，不动念，既不贪，也不嗔，也不愚痴，没有邪见，也没有我见，完全是一个无我的心。所以心行处灭就是指真心，祂没有三界世间的心行，不对六尘境界，不知六尘，不分别六尘，无论什么样的境界来了，祂都不动心，所有六识心所具有的善恶和不善不恶的心行，祂都没有，祂是清净而又无为的。</p><p>十九、如来藏不了知具体的万法和六尘境界，这是第七识所了知的部分，也是六识所了知的内容。真心与妄心的体性，所对应和了知的内容，要严格区别开，这样才能有正确的认知和智慧。如来藏知，如果意识不知，没有什么用，意根知了，意识知了，才有意义，才有作用。</p><p>虽然能读万卷书，而不知其意，也不是真正的精进。学法的根本目的，是获取智慧，不是为了收藏无数的知识和学问，不是为学而学，更不是学给他人看的。所以为了获得智慧，我们要做什么，如何做，是应该要用心思考的。学佛人，是学佛的心和行，不是要收集所有佛的语言，而是通过佛的语言，了解佛的心，然后学习佛的心，效仿佛的行，最终才能与佛平等无二，慈悲于人。</p><p>二十、无一切念者，为真如心，不是妄心七识，只有真如无念，不念一切法。众生的妄心是有念的，因为六识只要存在，就要面对六尘境界，肯定有念想。佛虽然是无上觉，祂的七识心也有念，佛要观察哪个世界众生的缘熟，可以现应化身去救度，而观察思惟就是念，没有念不会去观察众生的根器和众生的因缘，没有念佛就不能因材施教，演说无量法。释迦佛在娑婆世界度众也没有离开过念，除非佛入定，和无事时，不用度众生时，才没有念。</p><p>但是从另一面来说，真如也有念，真如除了不念六识所念的六尘境界，其余一切祂都念。悟后慢慢就会懂得真如的有念和无念，那是后得智、别相智、道种智才能了知的内容。所以不能把真如的无念当成意识心的无念，也不能把意识心的无念当成真如的无念，悟前往往错会佛语和祖师语。现在普遍都是真妄不分，把妄心的体性当真如的体性，而真如所具有的体性让妄心修行去达到，那怎么可能做得到呢？现在的众生颠倒知见太多，真不知真，妄不知是妄，真妄互相混着说。</p><p>二十一、有人说如来藏是众生立出来的，我们立祂，祂就存在，不立祂 ，祂就不存在。可是实际上如来藏根本不用我们立，祂本自存在，任何人想推翻祂，也推不倒。祂永远不灭，任何人用任何力量，都不能磨灭祂，不管众生承认不承认祂，祂一直都在默默无闻的工作着，为众生奉献着一切法，俯首甘为孺子牛，祂只管耕耘，不要收获。</p><p>如来藏是世间最正之眼，能见一切法，而又无所见；能知一切法，而又无所知；能闻一切法，而又无所闻；能觉一切法，而又无所觉。祂无见无不见，无知无不知，无闻无不闻，无觉无不觉。如来藏的无知，是因为如来藏不对六尘境界，不分别六尘境界，对一切法不作具体了别，又没有觉观，没有名言概念，没有知见，没有观点、意见和看法。</p><p>但是，如来藏又无所不知，无所不见，无所不闻，无所不觉。这是为什么呢？因为如来藏能了别业种，了别业种时就了别了一切法，同时依如来藏而运行的佛性，在一切法上都能运行，对一切法都有见性，因此能觉一切法，能观一切法。此种觉观与七识的觉观截然不同，其见性与七识的见性也截然不同，众生往往很难区分。</p><p>如来藏在了别业种以后，就要依据业种，变造一切法。如果祂不知一切法，那就无法变造了，或者是要错乱地变造，那就会出现因果不符、无因有果、有果无因的现象，而众生的因果从来就没有错乱过一丝毫，可见如来藏能如实了别业种，如实依业种出生一切法，实现因果律。实际上，因为如来藏能知一切法，才能变造一切法，祂知的方式，一是知业种，二是知因缘；另一方面祂有见性的功能作用，能见一切法，就能配合一切法生起和转变。总体来说，如来藏的见闻觉知性非常殊胜，也很特别，别于七识的见闻觉知性，我们难于了知。</p><p>二十二、无心定与真如三昧的区别</p><p>无心定的意思，就是住在定境中，无念无想，无所事事，百无所思，意识不起思惟和观照，就像楞严经中世尊所说的内守悠闲的状态，这些都是意识的闲着状态。有些人就误会这种状态就是不起念想的真如了，认为是证得真如三昧了。其实真如本来就没有一丝念想，不管修不修定，都是如此，因此真如的状态永远不改变。而禅定中意识的不起念的状态，是修出来的，先无后有的，那么有后还能无，早晚还会消失，生灭变异之法，就不是不生不灭的真如，那就不等于真如三昧境界。</p><p>二十三、动念即乖的意思</p><p>乖，是乖离、违背、不是的意思。当我们动起念头的时候，这个起念动念的心，不是第八识本心。因为第八识从来不动念头，尤其是三界世间法里的念头，有语言有文字有声音有心思的念头，第八识都不会出现。只有妄心才有念头，因为意根对于世间法的攀缘不止，惦念不断，意识就要不断的出生各种念头和思想，生生灭灭，断断续续，抓不住理还乱。所以没有唯识种智的人，所能观察出来的念头，都是妄心思想出来的，起念的心都是妄心，不是第八识本心。</p><p>二十四、怎样才是无分别？</p><p>如来藏的无分别性，七识心很难做到。接近于如来藏的无分别状态，也就是七识的无心状态，七识心无心时，对一切法都无所谓，不再放在心上。看像没看见一样，听像没听见一样，没有人我对立是非纠纷，不管好坏是非，不着六尘境界。</p><p>但是这种状态，还是分别了，知道是色是声是香，认识你我他她，有了名言概念，与如来藏那种不知所以，没有名言概念的无分别状态还是有区别的。毕竟识心种类不同，功能作用就不能相同。</p></div>"
},{
    "title": "第十七章　转识成智",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十七章　转识成智</strong></p><p>一、众生的八个识都是识，因此都有识性。识性就是识别性、了别性和分别性。其中如来藏识别的对象和范围与前七识都不相同。因为这些体性众生不容易理解，因此对于凡夫众生，有时就不讲如来藏的识别、了别性。只对凡夫众生说，如来藏是无分别心，这样就能把如来藏与前七识的体性分开，避免了凡夫众生误会和混淆如来藏与前七识的体性。等到众生渐具智慧，能够把八个识分清时，就告诉众生，如来藏也有分别和识别性，只是分别的对象有所不同，这样，众生对于如来藏的了解就能更深一步。</p><p>众生前七识的识别了别，都带有染污性，都有贪嗔痴烦恼和无明，这要在学佛修行以后，渐渐转化七识的染污性为清净性。因为七识有无明，有无明就遮障智慧，破除一分无明，就增长一分智慧，无明破尽，七识里全部都是明，八识全体都成为智识，四智圆明，佛道的修行就此结束。</p><p>到成佛时，八个识的转识成智总共分三次转变，第一次，是在明心见性以后，修到初地菩萨时，第六识和第七识初次转识成智，其中第六识转成一分妙观察智，能以大智慧观察出一切世间法，都是由如来藏所出生、所变现、所执持，这时就证得一分法无我。在一切法上能够多分或者少分观察到如来藏的运作，也能少分观察到第七识的运作，因此具有了一分无生法忍慧，达到初步的无漏，智慧深利。第六识的心所法，原来具足根本烦恼贪嗔痴慢疑邪见，以及随烦恼，与五十一心所法相应，这时已经断除了根本烦恼的现行，随烦恼也消失不见了，逐渐与二十一心所法相应，只是烦恼习气有时还会现行出来，这个习气要到七地菩萨满心才能断尽。</p><p>在第一次转识成智时，第七识就转变成一分平等性智，对于自我的执著性得到有效地降伏，也达到初步的无我无漏。祂依据第六识的观察智，知道一切法都是如来藏所为，不是自己所为，一切法不属于自己，因此对如来藏的贪执性就减除一分，对自我的执著性就得到有效的降伏，具有一分法无我性，能够平等地看待一切人事物理，执取自我性减弱，深层次的我慢去除了。</p><p>因此做一切事情，不再完全以自我为主，而能平等地照顾到他人和其他团体的利益，不再很强烈地说：我、与我有关的都好，别人的、与我无关的都不好。与人交往是先责己，后责人，做事公平、公正、无私。虽然不得不随顺于世俗，在语言表达上要有个我字，可是内心里会觉得有我就很惭愧，突出自己，表白自己，就有愧疚的感觉，这时的意根就与惭愧的善心所相应。</p><p>第二次转识成智，是在临入八地菩萨时，第六识再次转变成更深细的妙观察智，第七识再次转变成更深细的平等性智。第三次转识成智，是在临成佛之时，第六识全部彻底地转变成妙观察智，没有一丝无明，第七识完全彻底地转变成平等性智，没有一丝无明。之后前五识就转变为成所作智，前七识都转变完以后，如来藏就转变成大圆镜智，八识就完全转变成四智，于是佛就具足了三身：法身、报身、应化身。</p><p>佛的八个识都已经转成智识了，但是八个识还是都存在的，并且都要运用，都要发挥其智慧的功用。前五识转成成所作智，第六识转成妙观察智，第七识转成平等性智，如来藏转成大圆境智。佛的五蕴身仍然还存在着，也都能得到高效能的运用，佛的十二处、十八界也都存在不灭，都能够得到圆满的运用。佛有眼睛，有眼识负责分别色，有耳根，有耳识负责分别声，佛仍然有六根、十二入、十八界。当然佛的六根是互通互用的，十八界的功能比我们的优异极多，我们是没法想像的。应身佛和化身佛到我们人间来，与我们一样也有六根六尘六识，只是功能要远远超越于我们。</p><p>应身佛、化身佛到我们人间来，与我们同样有六根六尘六识，只是功能不一样，远远要超胜于我们的六根六尘六识。但是应身佛化身佛与这个世界缘尽了，也会入灭，那时六根灭了，六尘灭了，六识灭了，真如心不灭，意根不灭，佛还会到其它有缘世界现佛身度众生，凡是能灭的都是虚妄的，真实的永远不灭。什么是真实法呢？只有真如心是真实法，是实相法，祂永远不灭，其他一切都是生生灭灭变异不停的，所以应身佛、化身佛身中也都有真实法和虚妄法。</p><p>那么应身佛和化身佛说法时，用什么来说呢？当然用口、用舌、用身识、用平等性智、用妙观察智，同时也有真如心大圆镜智的配合，这样佛说法度众都是八个识心和合运作。然而佛的八个识心可以分开单独运转，单独起作用，这是佛特异于我们之处。而我们做一切事必须八个识和合运作，只有妄心不行，只有真心也不行。</p><p>二、众生通过修行，七识心越来越清净时，烦恼减轻，无明减少，种子变清净了，存在如来藏里的识种子的染污性渐渐减少，清净性就渐渐增加。如来藏再输出识种子时，就输出清净的种子，七识心的心行就清净一些了，不是无烦恼就是烦恼轻微。当无明都断尽成佛时，七识心彻底转变清净，如来藏里没有一丝无明种子，输出的种子全部都是清净的，所以佛的身口意行是绝然清净的。</p><p>无明断尽时，意识心变成妙观察智，意根变成平等性智，前五识变成成所作智，如来藏就转变成大圆镜智。这样看来，是七识妄心拖累了如来藏，把染污种子存了进去，使如来藏不能完全彻底地发挥出其应有的智慧德能，其智光被七识心的染污种子所遮盖，虽然其光能照大千界，但实际所照有限。一旦七识的染污种子都转变清净，没有无明了，如来藏之智光才洞彻十方，圆满无碍，这就是如来藏本来之德能，本来之智光。</p><p>三、依识有生死，依智无诸佛。这里的识，就是指七识妄心，其识种子分秒刹那都在生灭变异着，因此不是常恒之心体，是生灭变异的虚妄识心。因为七识有贪嗔痴烦恼，心地是染污的，情执也很深重，其智慧就是狭劣的。如果依七识，把七识当作真实而不坏灭的我，以此错执，就有生死轮回苦，永不得解脱。因为前六识在五种情况下能灭：死亡、昏迷、睡着无梦、入无想定、入灭尽定。第七识，阿罗汉涅槃时也能灭，所以七个识是生灭无常变异的，有智慧的人就不能把七识当作永不坏灭的我，也不要对其攀缘，执著不舍，否则生死轮回不断，苦恼不断。</p><p>智，是指智慧德相如来藏。如来藏人人本具，与佛无异。但祂也不是佛，历来都没有名字，没有尊称，没有地位，说祂是什么不是什么，对祂来说都无所谓，祂既不知道也不承担，把祂尊称为佛，是我们强加予祂的，祂不是佛，也不是众生，但也非不是佛，非不是众生。六祖说：说似一物即不中。说祂是什么都不对，说祂不是什么也不对，因为一切法都是祂造就出来的，那么一切法的实质都是祂，祂就是一切法，但是祂又不在三界里，三界里没有与祂相比对的法。既然一切法都是如来藏创造的，一切法就是如来藏，归如来藏所有，那么实质上也没有一切法，都是如来藏。应化身佛也如是，都是諸佛的无垢识做，实质上也就是无垢识如来藏，所以说依智无诸佛。</p><p>四、智和识</p><p>识通常指没有智慧的识心意识，七个识都是如此，因为无明蔽心，无始劫来我见、见取见，各种邪见和颠倒见充斥于心。识心无智慧时往往自意以为自己的所有见解和看法都正确，其实大多是邪见，对一切法的见解多数是错知错解，由于无明烦恼遮障于心，不见諸法的真实相。</p><p>智，主要指如来藏所具有的本来智、无碍智、无漏智、光明智；其次指破除了一部分无明、已经转识成智的六七识心，这种破除全部或者是一部分无明的识心，已证得了諸法实相，对一切事理或者是一部分事理的认知是正确无误、充满智慧的。众生在深重的无明里，往往是依靠着自己无明的识心认知，扭曲事理的真实相，造作无明的身口意业，而且也不自知后果可畏。我见和见取见邪见深重的众生，都是识心意识泛滥，因此才流转生死无穷尽。</p><p>识心没有智慧的时候，就不能依本来智来修证自己的心行，要想获得智慧，就要多熏习般若之理，并且要努力证得根本智如来藏，之后才能依如来藏的本体智，修证自己的身口意行。还要努力修除无明，降伏自己的性障烦恼，降伏我心和慢心，对事理要多作深细的思惟，看清一切事理的本质，这样渐渐地也就能拥有智慧了。</p><p>明心悟道后，意识由于打破了无始无明，证得了諸法实相，也就获得了一定的智慧，但是这种智慧里还有染污，有贪嗔痴烦恼，因此还属于有漏的智慧。意识把自己的烦恼断除，达到无漏时，才能生起无漏智，这时识心就转变成智了。这是进入初地的时候第一次转变，第二次转变识心成智慧，是修到八地菩萨的时候，第三次转变就成就佛道了。</p><p>不严格说，明心见性以后意识心就在渐渐地一点一点地转变，只是不明显。再放宽一点不严格来说，有少部分人学得了正确的佛法，尤其是大乘般若法，思想认知就能慢慢地悄悄地转变着，集聚到一定时候，破除无明，就明心悟道开了智慧。性障烦恼深重的人，依智不依识很难做到，处处都是识心意识，没有智慧，自以为是，慢心深重，这样就障碍自己智慧的开发，实是障道的根苗。</p><p>五、智，有两个含义，一个含义是指佛教中讲的具有真如智、般若智的实相心如来藏，祂有出世间的大智慧，所以称为智；另一个含义，是指证悟了諸法实相以后，出生了世间和出世间智慧的识心六七识。我们通常所说的智，是指第二种。智与识，心体是一，其智慧与德能利用不同，二者既有相同之处，也有不同之处。相同之处是二者都有了别作用，都有心体的功能作用；不同之处，智，了别得全面、彻底、究竟、真实不虚；而识，了别得片面、浮躁、虚谬、不真实。</p><p>八个识都是识，都有识别了别的功能作用，但我们平常所说的智和识，主要指意识心，了别世出世间一切法，以意识心为主。祂的识别性是最活跃最细致的，识别能力最强大。前六识和第七识这几个识心，在无明比较重，智慧不足的情况下，了别相应的法时，未必了别得真实，未必了别得准确，未必了别得究竟，这个时候，这几个识只能叫作识，不能叫作智。如果这几个识，去除了全部或者一部分无明，通过修行达到了初步或者是完全的无漏，有了无漏智慧，对于一切法，能了别得真实，了别得彻底，了别得究竟，这时候就叫作智，识性已经转变成了智性，就叫作智识。</p><p>真正的转识成智，要等我们明心见性以后，修到初地的时候，六七识才开始真正转识成智。因为这时候六七识已经断除了烦恼，人我执已经降伏或者已断一部分，虽然还要留一点点不能断尽，但是识心已经初步达到无漏，智慧没有严重的遮障，对于大小乘法已经通达，有了一分唯识种智，观察一切法，了知都是自心如来藏所显现，其智慧比较深妙了，所以就称作智。菩萨明心见性以后，就开始具备了一定的般若智慧，识心智慧也渐渐地在增加，并且智慧越来越深利，但是因为烦恼没有降伏，人我执没有降伏，识心还是有漏，其智慧还不够深广，因此还不属于完全的转识成智。</p><p>识心达到无漏，转识成智以后，第六识转成妙观察智，意识心观察一切法，都能发现如来藏的运作，了知一切法都是自心如来藏，没有外法可得。其智慧能彻见诸法的实相，不再把所接触的一切法当成真实存在，有真实的自体性，并且发现一切法的功能作用都是如来藏所现起的，这种智慧就叫妙观察智。在这之前，意识心是着相的、有漏的，意根还有我执，把一切法还当成真实，虽然有时也是认为很多法是虚假的，但是其认识还不够彻底究竟；这个时候意识还是以识性为主，智慧性还不具足，所以还不能叫作妙观察智。</p><p>明心见性之后的意识心，与明心见性以前的意识心，其智慧性发生了转变，与从前有所不同。明心见性以后就有了一定的般若智慧，也能观察到在某些法的运作当中，如来藏在背后运作的秘密，但是智慧还不够深广，所以仍然叫作识。虽然此时的识还没有转识成智，其实也是在慢慢的转，只是转的不明显，以入初地为一个明显的界限。所以入初地叫转识成智，第六识初步转为妙观察智，第七识初步转为平等性智，意根看一切事和理，都是如来藏所现起的，本质就是如来藏，这样心就平等了，看一切众生都是平等的，这中间也没有一个我；有我，心就不平等，没有我，心就平等了。</p><p>六、佛地的转识成智，是把七个识的染污种子转变清净了以后，无明断尽，意识心转成妙观察智。因为意识断尽了一切烦恼和无明，没有了遮障没有了漏，观察一切法才是最妙的，有无明就有障碍，观察一切法就不妙。意根第七识转成平等性智，因为意根没有无明的遮障了，不执著自己和一切法，断尽了我执和法执，所以对待一切法都是平等一如的，看众生都是看其如来藏性。前五识转成成所作智，因为五识没有无明了，见一切法也就没有了障缘，所作皆成。然后如来藏就转成大圆镜智无垢识，因为里面含着的七识的染污种子彻底清净，七识不再拖累如来藏，如来藏无垢识就能圆满光照一切法。</p><p>七、十法界包括六道轮回的凡夫六法界和声闻、缘觉、菩萨、佛四圣法界。佛的识已经完全转成智，以智起用，也用本心无垢识起用。众生用识心起用，也用本心如来藏起用，众生起用是如来藏与识心和合起用，而佛的八个识心可以单独起用。</p><p>成佛作祖离不开生灭相，单独一个佛的无垢识真如心，也不能成佛作祖。祂不是佛不是祖，是我们给祂取的一个假名，祂自己并不认可，祂不认为自己是佛、是真实的、是我，因为祂是无我性的心。</p><p>凡夫从学佛到成佛，都离不开各种生灭法。五阴本身就是生灭的，但没有五阴不能修行；各种禅定境界无量三昧都是虚妄的，但是如果不去证得，也不能成就佛道；识心虽然是虚妄的，但是不转化，不破除无明，修行也不能成就；各种境界虽然是虚妄的，我们还是得在各种虚妄的境界中修行，以转心转境界。境界如果没有转的人，也不是大成就者，而心不转，境界就不会转。身心这个假壳子，以及根尘识，都得要好好地利用，我们就是要借助于这些假法来修行，来成就无上觉。</p><p>转识成智，没有成佛时，名称都是识，转成智了就是佛。凡夫到成佛的距离还很遥远，不是在短时间内就能转识成智而成佛的。明心开悟了，也只是贤位的住位菩萨，还需要经过十个行位，十个回向位，才入初地。这才走完三分之一的路程，还有三分之二的修道过程需要走。而要入初地，需要很大的福德，需要为佛教做出极大贡献，为众生做很多事情，还要有无生法忍慧，有一分唯识种智。</p><p>修行先具备正确的知见，知见完备，因缘具足时，才能明心开悟。明心需要有大福德，这个福德是在为佛教和众生做事当中得，在忍辱持戒禅定修慧当中得。相应的戒定慧都要具足，大乘的理要明，还要有因缘现前，才能明心证真如。明心不是闭关修行就能修得来的，理不明，闭关也没有用，闭关时既没办法修福，还要耗费福德；修行过程中没有各种事境的磨练，忍辱行也修不好，菩萨六度就不容易具足，明心证悟就困难。所以修行中还是要多着重于修行菩萨六度，这是正修行。</p><p>八、烦恼会染污自己的心性，而漏掉一切善法功德，其果报还是由自己来承受。所以说有我即是恶，有我即是罪，有我即是漏；无我无漏，无漏就能具足一切善法功德。初地菩萨初步的转识成智，达到初步的无漏无我，第六识有一分妙观察智，第七识有一分平等性智，因此第六识第七识的心所法与地前菩萨就有所不同。</p></div>"
},{
    "title": "第十八章　转依如来藏",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十八章　转依如来藏</strong></p><p>一、真正的转依如来藏，那是在证得如来藏以后的修行过程中的事。在悟前是不能真正转依的，因为不能现前亲自观察的缘故。现在在小乘法的观行虽然能否定了五阴十八界为真我，但是我们现在还没找到如来藏究竟在何处，不知道如来藏究竟是如何起作用的。如果现在把意识心安住在如来藏上，那只是相似的般若，相似的真如三昧，不是真正的真如三昧。没有找到真正的三昧心如来藏，那就不能真正地安住。</p><p>相似的真如三昧，是平时我们意识心在世俗法当中，照样在忙一切的世俗事业的时候，心里不把这些世俗法当作真实的，同时想象一个真我如来藏的存在，因为没有亲自证得，只能想象，这就是相似的真如三昧。虽然表面上不认世俗五阴为真实，但实际做事时根本做不到，遇缘就会迷惑颠倒，造作贪嗔痴业行，因为意识表面的知见看法不起作用，意根并没有受到熏染，还不懂得一切法都不真实，都是真如，离真正证得还有很远很远的距离。这只是学相似真如，类似于真如，但不是真正的真如，心里还没有如，没有证得真如之故。</p><p>那么什么是真正的真如三昧呢？那要在证得真心如来藏以后才能知道。证得如来藏以后，我们才能知道如来藏原来是这样的清净，在做有为法时，也是这样的无为。证得如来藏以后，就知道如来藏是如何起作用的，在此处起何种作用，在彼处起何种作用，知道了在各处都起什么作用，都是如何运作的。这样就慢慢清楚了如来藏的真实而如如性，也就了知了祂的真如性，然后七识心就会慢慢学过去，慢慢转依过去，最后能完全转依，七识就会渐渐的完全转依于真如。</p><p>证得如来藏的时候，同时就知道五阴十八界只是一个虚假的壳子，是被如来藏所变起的一个假相，心里渐渐地就会降伏我执烦恼。最后到入地的时候，就会证得这些相都是如来藏生起的功用，也都是如来藏。不仅意识能够转依于如来藏，意根也会转依于如来藏，不再认如来藏的功用是意根自己的功用，这样就达到了无我，智慧增广，越来越深。</p><p>二、转依如来藏是从什么时候开始的</p><p>有些人认为知道五阴十八界虚妄，内心有些与空相应了，就是转依了如来藏，与如来藏的空相应了。可是我们现在虽然能认识到了五阴十八界的虚妄，也许有可能证得五阴无我了，但是因为还没有找到如来藏究竟在哪里，究竟是如何起作用的，如何是心空的，也就不能现观到祂的体性究竟是如何清净的，因此不能真正地转依于如来藏。如果说要把意识心安住在如来藏上，现在也仅仅是个相似的般若，相似的如来藏，不是真正的般若智慧，没有真正找到如来藏的时候，就不能现观如来藏的清净无为体性，内心就不能真正的与如来藏的清净无为性相应，那么这种安住法也是想象的名字安住，不是真正心地上的安住。</p><p>断我见以后，平时我们意识心还是照样要忙一切的事业，忙一切的世俗法，只是不再认世俗法为真实的。否定了虚妄的世俗法之后，内心变得有些空了，但是这种空不是如来藏的空，还不能与如来藏的空相应到，那就没有安住在如来藏的空上，必须在触证到如来藏以后，才能真实的安住在真如性上。没有证得真如时，内心里对于到底什么是真如，真如是什么境界和状态还不清楚，那是没法安住的。只有证得真如的时候，证得如来藏的时候才能知道，在这之前，只是想象和猜测而已，听他人说的并不等于实证。</p><p>当我们明心证得真心如来藏的时候，就会知道，原来这就是我的真心，祂是这样起作用的，祂在这里起这种作用，在那里起那种作用，在各处都起着什么作用，都是如何运作的，同时也能观察到虽然祂在三界万法中功德无比，可祂却是无我性的，也是无为性的，从不居功自傲，清清净净，对一切法都如如不动，没有一丝烦恼和私心杂念，这样七识心渐渐就能随学过去，转依过去，心就能逐渐清净了。</p><p>当意识心慢慢转依过去时，意根也要转依，心就能渐渐清净下来了，内心里清清楚楚地知道，五阴十八界只是一个幻化的假壳子，都是被祂所变起的一个空相罢了。最后修到初地时，六七识断除烦恼，初步的转识成智，就会证得一切法全部是真如自性所起的妙用，全都是真如，内心清楚地现观到，一切法相都是如来藏所生成的，本质也都是如来藏，这样就真正证得三界唯心，万法唯识，唯识智慧就要不断的增进，智慧越来越深了。所以真正的转依是在明心证真以后，转依成功就进入初地，成为地上菩萨。</p><p>三、为什么说转依位是指从初地菩萨开始</p><p>转依是指妄心依止于如来藏的清净体性，修除心地的染污性，心转清净，具有清净性，也就是要转识成智。转识成智，总共分成三次，修到初地菩萨时是第一次转识成智，因为烦恼已经得到有效的降伏了，再也不能遮障其心，因此六七识就由识而转变成智，这时意识心和意根第七识就是智识，方便说为识，第六识具有初步的妙观察智，第七识具有初步的平等性智。</p><p>第二次是八地菩萨转识成智，八地菩萨不仅断尽了烦恼，烦恼习气也断尽，不再现行出来，不仅断尽了人我执，法我执也得到根本性的降伏，因为无明淡薄，心地的遮障几乎都消除了，这时第六识和第七识意根的智慧就更加深利。</p><p>第三次转识成智是在临成佛时，转八识成四智，这次是彻底的转识成智，无明断尽，法执断尽，从此以后六七识的智慧达到究竟彻底，不用再转变了，前五识也变成了智识，没有了无明，四智都已经圆明。</p><p>初地菩萨因为断除了烦恼的现行，只留一点贪爱烦恼，以避免命终入无余涅槃，其它的烦恼都断除了，心地的遮障去除了一部分，开始达到初步的无漏，具有初步的无生法忍慧，入到了如来家。六七识体性转变清净了，就是转识成智，如果六七识不转变清净，就没有转识成智，没有资格入如来家成为真佛子；当然这时的转识成智还不是究竟而彻底的，只是转变一部分，还需要在以后的修行当中再次转变。</p><p>初地菩萨贪嗔痴烦恼都已经得到降伏，可以全部断尽，只是为了留惑润生，才保留一点贪爱，那么六七识的心所当中就没有染污的烦恼心所，心所法改变了，由原来的染污性初步转变成清净性，恶心所法灭除，善心所法增加，第六识的心所法不再是五十一个，第七识的心所法不再是原来那么多，这两个识就算初步的转识成智，也算初步成功的转依了如来藏的清净性，初步转依成功。如果菩萨的六七识转依如来藏不成功，心地不清净，就没有资格入如来家，所以从初地菩萨开始是属于转依位的菩萨。</p><p>四、如何转依如来藏</p><p>所谓的转依，是在开悟证得如来藏以后，观察如来藏在五蕴身中运作时的清净性，然后七识心在身口意行中慢慢依止于如来藏的清净性。再观察如来藏的无漏有为性，七识在做有为法时也要转依如来藏这种无漏的体性，无怨无悔地为佛教事业而奉献，为广利众生，不为个人私利。一切心行都要依止于如来藏，五阴按照如来藏的清净性无漏性为人处事，逐渐达到清净，这就是转依。</p><p>证得如来藏以后，具体观察祂是如何配合五阴各种活动的，如何产生每一法的，祂在五阴的运作当中是如何清净无染污的，这样识心愧悔自心的不清净性，就能受到熏染，逐渐转依成功，七个识慢慢都能转识成智了。</p><p>五、在世间万法当中最忙碌的就是如来藏，但祂从不觉得忙，总是运作有序，有条不紊，游刃有余。祂就像八爪鱼一样，事事都参与，却一样也不放在心上。从不觉辛苦和烦恼，也不居功自傲。祂总是在圆满成就一切法，却从不动心，不执著这些法，不贪厌这些法，也没有成就感。这样的心才值得我们皈依，向祂学习，学好了，则天下太平无事，太平盛世来临！</p><p>第七识意根了别六尘境界的智慧粗燥，却处处作主，时时发布命令，不知法界实相，把如来藏的功劳据为己有，处处执著，贪爱不舍。把六识的功能据为己有，贪执不舍，把一切法都当成是自己的，居功又自傲。只有通过修行，让祂认识到法界实相，认识到一切都是无我的，都是无祂自己的，这样才能改变祂，让祂放舍一切自我，平等无私，才能成佛。</p><p>六、如何才能断疑生信转依如来藏</p><p>断疑才能生信，有疑不决，信根不具足，只有确实见到证到如来藏，才能断疑，才能确信，才能慢慢转依如来藏。解悟猜测的，没有如此功德受用，因为不能现前观察如来藏的清净性，就无法依止。</p><p>向如来藏学习，转依如来藏，首先是意识的事，意识学明白了，转教意根，意根皈依如来藏，以如来藏为榜样，时时处处依止如来藏体性，降伏意根的我性，淡化无明，转识成智，才能成就佛道。</p><p>转依的前提条件必须是证悟，解悟无法真实转依，因为解悟观察不了如来藏的运作，不知道如来藏在有为法运作中的无我性和如如性，就没办法真正转依，猜测出来的，内心有疑不能决，因此不能改变自心。</p><p>自己真正实际见到的事情，真实的证悟，才能百分之百相信，才能断疑。否则纵然能猜测出如来藏大概是如此清净的，能暂时压伏自己的烦恼，可是内心深处的疑不能断，结缚就不能断。断结，就是断生死的根苗，斩草除根，是极其重要的。</p><p>七、楞严经弥勒菩萨介绍修行唯心识观</p><p>弥勒菩萨说：识性流出无量如来…谛观十方唯识，识心圆明，入圆成识，远离依他及遍计执，得无生忍。这句话非常关键，如来藏所流注出来的任何一个法，全部是如来藏，全部是如来，法法皆真如。</p><p>细心观察十方世界乃至于微尘，都是唯如来藏圆成实性，是如来藏所变造显现出来的，都是如来藏性，识心如来藏圆满妙明呈现一切法。这样观察之后，就能入到自心如来藏中，究竟彻底转依于如来藏，不再依着依他起性的六识心，也不再依着遍计所执性的第七识，全部依靠真心自性，依靠真如佛性。真正证明了一切法都是如来藏，都没有真实出生过，如来藏自性也不是生的，是本来就存在的，这样法执即断。</p></div>"
},{
    "title": "第十九章　如来藏遍一切法不在三界内外",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十九章　如来藏遍一切法不在三界内外</strong></p><p>一、如来藏遍一切处，遍一切时，遍一切地，遍一切界，遍一切法。遍一切处，就是十二处六根六尘处，眼根触色尘处有如来藏的显现，耳根触声尘处有如来藏的显现，鼻根触香尘处有如来藏的显现，舌根触味尘处有如来藏的显现，身根触触尘处有如来藏的显现，意根触法尘处有如来藏的显现。六根六尘都是如来藏变现出来的，都有如来藏的执持作用，众生所接触的每一个境界都是如来藏所显现出来的。</p><p>如来藏遍一切时，从出生到死亡，到中阴身，到胚胎，到再一次出生，如来藏从来没有断灭过，每一刹那都在执持着众生色身的生命活动，众生的生老病死都由于祂的运作而出现。遍一切地，地包括三界九地：欲界地，色界四禅天，无色界的空无边处、识无边处、无所有处、非想非非想处地，在这些器世间当中，都有众生的如来藏在维持运行，其中只要有众生的存在，就有众生的如来藏存在和运作。所以一切法都由如来藏而生而显，这是不容置疑的真理。</p><p>如来藏遍一切界，包括十八界六根六尘和六识，包括四圣六凡的十法界，都有如来藏在运行着，都是如来藏所出生和执持的。如来藏遍一切法，一切法包括色法和心法，色法包括五根、五尘、法处所摄色；心法包括七识和七识的心所法，与心相应的行法，与心不相应的行法，有为法和无为法。只要是世间存在的法，不管众生有没有能力认知到，都是由如来藏所生，离开如来藏，这一切法都不会出生和显现。</p><p>世间一切万法，都是如来藏变现和执持，所以一切法都有如来藏在其中运行，没有如来藏，就没有一切法，一法也无。整体来说，世间所有一切法，就是一真法界，都是如来藏的妙用妙现，都不离如来藏。那么寻觅如来藏根本就不难，难在自己的福德因缘等等的条件不具足，因为因缘条件不具足，心里有遮障，就不能见如来。那就要想办法修除遮障，多修菩萨六度波罗蜜，这也是正修行。</p><p>二、阿赖耶识非出入，非不出入。说祂出入，却不可见，又感觉不到；说祂不出入，却能入住色身和离开色身。阿赖耶识不是色法，入住色身时，没有色法的那种出入相；而空气和风、气息，虽然看不见，却是物质色法，可以有出入，有看不见的形质出入。阿赖耶识没有形质，那种出入法，世俗里找不到，也无法形容。如果说阿赖耶识出入色身，可是阿赖耶识却遍色身一切处，遍内外六尘处，既不在色身里，也不在色身外，也不在色身中间，无所在处，又无所不在，没有一个法上没有阿赖耶识的执持作用。但是临终时，却能从身体各处离开，离开之处，身体冰冷僵硬，没有离开之处就有温度和柔软性。</p><p>阿赖耶识没有出入的最重要的一个原因是，阿赖耶识出生一切法，包含一切法，一切法都在阿赖耶识里，不出阿赖耶识之外，都属于阿赖耶识中的法，因此阿赖耶识不出入一切法，而且是本不动摇的出生、改变、维持一切法。</p><p>三、如来藏不在三界内外和中间</p><p>三界，是指五蕴身所在的宇宙器世间，包括欲界、色界和无色界。如来藏所能变现出来的一切法都属于三界的法，三界是造作出来的法，因此叫作有为法；既然是造作出来的有为法，是后天能出生的，那后天完全可以灭去。一切法的有为性就是如此，生灭变异，不由自主，因此是不究竟的。</p><p>三界外究竟是什么样子呢？三界没有外，因为三界是没有界限的；如果三界有界限，就有了边际，超过边际之外的，就不属于如来藏所摄范围；如果有如来藏所统摄不到的法，就是心外之法。可是心外如果有法，这些心外法是如何出现的？是先天就有的，与如来藏一样不生不灭的吗？如果是，就有过失，与佛意和事实、法界实相不符；如果不是，就是有生。那么是谁生的？如果有个谁，整个佛法体系大乱，十方诸佛全部是妄语者，没有一真法界之说，十方诸佛却说一切法都是一真法界。</p><p>而诸佛没有一个是妄语者，都是全部佛法的实证者，有所言说，都是如语和实语。因此说，三界外无法，没有三界外，也没有三界里，三界没有界限。因为三界法都在虚空中建立，虚空没有边际，没有界限，三界就没有边际，没有界限；如果虚空有界限，就不叫作虚空了。楞严经中佛说：虚空生汝心内，如片云点泰清里。意思是说虚空虽然无边无际的广大，没有界限，可是在如来藏里却占微不足道的位置，渺小得与如来藏没有一丝可比性，那么三界更与如来藏没有可比性。因此说三界没有界限，没有三界外之说。</p><p>如来藏出生了三界法，可是如来藏却没有三界法的相貌，因此如来藏就不属于三界法，三界外又无法，如来藏也不属于三界外的法。如来藏按照其没有任何相貌的独特性来说，祂没有归属性，没有可比性，不可能在某个法的内和外，只能说一切法都在如来藏里，包含在如来藏里。但是如来藏的运行，却必须在三界法上运行，没有三界法时，如来藏就休息不运作，因为祂不是一个没事找事的好事之徒。</p><p>四、如来藏无形无相，不能遍满虚空，有形相的法才能谈到遍满不遍满的问题。如来藏只是遍众生和佛的五蕴十八界，五蕴十八界包括了三界里的一切法，而不属于三界的法只有如来藏。如来藏无所不包，无所不遍，有法就有如来藏。</p><p>那么诸佛菩萨是否在三界世间存在呢？这个问题就很清楚了。三界世间之外没有五蕴，没有十八界，没有一切法，只有如来藏属于三界之外的法。诸佛菩萨都有五蕴十八界，永远不灭尽五蕴十八界。只有定性阿罗汉命终时，才灭尽五蕴十八界，不在三界里，缘觉佛辟支佛们入无余涅槃时才灭尽五蕴十八界，不在三界里。但是没有五蕴十八界，也就没有阿罗汉和辟支佛缘觉佛的存在，只有他们的如来藏寂静存在着。</p><p>五、如来藏不在三界内，也不在三界外，包括如来藏里面的种子，也不在三界的里和外，其实也没有什么三界外，只是种子流注后形成的法就在三界内了。三界即为欲界、色界、无色界，如来藏不属于欲界的法，没有欲界的特征；也不属于色界的法，没有色界的特征；也不属于无色界的法，没有无色界的特征，因为祂无形无相，如来藏里的种子也如是，依如来藏而有的佛性也如是，随同如来藏不属于三界法。其他的法，都可以找出三界的特征，都在三界里存在。但是种子输送出来，就形成了三界里的法。三界的法，是生灭性的，如来藏不生不灭，七大种子也是不生不灭的。</p></div>"
},{
    "title": "第二十章　如来藏对一切法的执受作用",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十章　如来藏对一切法的执受作用</strong></p><p>一、每个人的如来藏都很了不得，其功能体性难以想象，智慧不足的众生，难以了知如来藏的运作秘密，难以了知如来藏对一切法的执持作用，因此说如来藏有不可知执受。如果智慧比较深广时，就会逐渐了知到如来藏的各种执受作用，那就不能说如来藏的执受是不可知的。知与不知，在于各人的修持和智慧。</p><p>如来藏任何时候都在变现、执持着有关五阴身的一切法，以及五阴身的生存环境、六尘境界。五阴身的任何一点小事也都逃不过祂，祂都会了知，都会做记录，将来就有果报。比如在背后，不被当事人所知道的情况下，咒骂毁辱一个人，两个人的如来藏都会做记录，将来遇到一起，就会莫名其妙的内心里互相有隔膜，其中一个就会回报另一个。这件事虽然被咒骂的当事人五阴不知道，但是他的如来藏和意根知道，那就会存档。</p><p>为什么那个人的如来藏能够知道呢？因为每个人的如来藏体性相同，属于同类，而且遍一切时、遍一切处、遍一切界、遍一切地。就是说如来藏是遍过去未来现在一切时，遍六根处和六尘处，遍六识界，也遍欲界色界无色界，遍十方世界。既然如此，只要与所执持的五阴有关的事情，如来藏都有感应，都会知道。而且如来藏与如来藏之间，还有互相协调配合的关系。</p><p>自己所做的一切事情，自己的如来藏都会记录，与自己有关的一切事情，自己的如来藏也都会收集来存档。因此意根依如来藏的了别而知与自己有关的一切事情，就会警觉意识有特殊的事情要发生了。因为如来藏从业种那里能知道将来要发生的事情，虽然不知道具体内容，意根依之就能了别到，于是就会暗示一些事情让五阴警觉。</p><p>两个人说悄悄话，议论他人是非，两个人的如来藏都会记录，第三个人的如来藏也会感知到，同时做记录。那么第三个人的意根就会依自己的如来藏有所感知，就会警觉自己的意识，意识就知道有事。但是不知道具体的事，心里感觉也就怪怪的，见到两个人就会有点不自然，而那两个人见到这个人，也会有点不自然，所以世间根本就没有秘密的事情。</p><p>如来藏也执持五阴生存的依报环境，六尘境界。如果六尘境界属于自己五阴的，如来藏就执持，如果依报环境与五阴身无缘，如来藏就不能亲自执持，而要由共业众生的如来藏共同执持。比如一个人养了一盆花，养得很好，如果送给另一个人，花到了另一个人家，长得就不好，可能要渐渐的萎缩甚至会死亡。这与众生的依报有关系。有些果园果树，或者是畜生，主人管理饲养就很好，换了主人，畜生或者果树就长不好了，或者会死亡。这些都属于业缘，畜生在有缘的主人饲养下，生活得很好，与无缘或者缘浅的主人在一起，活得就不好，甚至会死亡。器官移植也是这个道理，别人如来藏执持的器官，到自己身体上，慢慢就会成为自己如来藏单独执持的。如果两个人的业缘不好，意根排斥，两个如来藏就不会很好地配合交接，移植就不会成功。</p><p>二、如来藏的不可知执受，是对五阴十八界一切法的执持作用。因为如来藏的作用太隐蔽，众生智慧不足，了知不到，才说是不可知，诸佛菩萨却是深知不疑的。比如断掉一个手指头，但是在短时间内，手指头还能接上，之后还有相应的功能作用。在接上之前这段时间，自己的如来藏还在执持它，掉下来的手指头还有神经活动，肌肉没有变成死肉，这个执持作用，就是如来藏的不可知执受。</p><p>如果知道了如来藏的这种作用，就是如来藏的可知执受。坟墓里的骨头不腐烂，都是如来藏执持的，如果如来藏不执持了，连灰也不存在。成佛时，如来藏的执受作用，佛都清楚了知，没有一法是不知的。所以不可知是对什么人而说，对知者，是可知执受；对不知者，才是不可知执受。</p><p>三、瑜伽师地论第一卷把声尘分成很多种，按照自己的如来藏执持与否分成三种。第一种，是自己的如来藏单独执持的声音，叫作因执受大种声。比如自己的说话声、咳嗽声、呼吸声、内脏器官发出来的声音等等。第二种是因执受与不执受大种声，如自己的身体与外界物质接触时，摩擦产生出来的声音，比如走路声、拿东西的声音、穿衣服的声音、身体与物质的撞击声等等，是自己的如来藏与外界物质作用发出来的声音。第三种，是因不执受大种声，意思是说，这种声音，不是由自己的如来藏所单独执持与控制的。比如宇宙天籁之音，风吹雨打的声音，雷声，大海河水的流动声，各种机器的声音等等，这是共业众生的如来藏共同执持的。</p><p>声音的内涵还有很多，声音的属性有很多，声音的归属很难划分，很复杂。这些都是如来藏的作用，极大多数是共业众生的所有如来藏共同执持作用的结果，也都是地水火风四大的生灭变化产生出来的。到处都是如来藏的功能作用，根本没有五阴自己的真实作用，所以全体即真如。任何人也找不出来，哪一个事物，哪一个法，不是如来藏七大种子的功能作用，都是如来藏的作用，都要归功于如来藏。七识心还要依赖于如来藏广造众业，如来藏呆呆地，什么事都管，从来不分别，也不拒绝，有求必应，叫作千处祈求千处应，哪儿有事就到哪儿，还叫作不来不去。</p><p>四、如来藏对胚胎和根身器界的执持</p><p>一切众生的胚胎和根身器界，都有如来藏在执持着，所以才能存在和起用，如来藏是这些法出现起用的根本因，祂籍着相应的缘，来出生胚胎和根身器界，然后再使得这些法不断运行和起用。</p><p>比如母鸡生蛋，表面现象是鸡蛋由母鸡所生，实际是如来藏所幻化和出生出来的，然后因缘成熟时，会使得鸡蛋孵化出鸡雏。表面来看母鸡能下蛋，其实里面都有如来藏的运作。母鸡如果没有如来藏，就不能生蛋，甚至连母鸡都没有，这里面都有很多如来藏法的奥密，有待我们去证得和揭示出来。</p><p>比如众生在两性和合的时候，不管是精子还是卵子，都有各自的如来藏在执持着，一个众生的如来藏在执持着精子，另一个众生的如来藏在执持着卵子，两个众生的如来藏共同运作才能使精子和卵子结合在一起；然后等着入胎的众生的如来藏，再执持这个和合物，成为受精卵，于是就有了胚胎，并且还要继续执持和创造胚胎，不断地输送四大种子使得胚胎渐渐长大，最后胚胎圆满，众生的生命体就会出生。</p><p>如果如来藏不执持，就没有受孕这一现象，也就没有胚胎的形成；如果如来藏不执持精子，不执持卵子，精子卵子就没有生命力，它们合和在一起，也不会成为受精卵，也不会出生胚胎。这其中都有如来藏的运作，才有其相应的生命的作用；如果没有如来藏，那两个东西就没有生命力，不能出生众生，不会有生命体的形成，也不会有生命体的降临。即使是人工受精，精子和卵子也是由两个众生的如来藏各自执持，然后合和到一起，要投生的这个众生的如来藏，进入到这个合和物中，就成为了胚胎。</p><p>不管精子和卵子离不离开众生的身体，都有如来藏在执持着，离开身体时间长了，如来藏就不直接执持了，精子和卵子也就没有作用，没有生命力了。只要精子卵子在离开身体的一定期限内，都有各自的如来藏执持，因此和合在一起，会有胚胎的形成；但是精子卵子离开身体时间长了，如来藏就不直接执持，也就没有什么作用，不会产生生命了。</p><p>再比如我们的手，刚断掉时候，我们的如来藏都在执持着，如果马上去连接，就能接得上，然后再继续起作用。身体当中的某个器官，刚脱离下来的时候，如来藏都会继续直接执持一段时间，在这段时间内，马上用手术给它连接上，还能恢复过来成为身体当中的一部分，起到原来的功用；如果时间长了，如来藏就不再直接执持身体上脱离下来的器官，再和色身连接，就连接不起来，它就是一个废物了，所以一切法都是如来藏在其中起作用。</p><p>我们身体里的器官摘出去移植给他人，转移到别人身体里时，我们的如来藏执持一段时间，别人的如来藏再接着独自执持它，然后我们的如来藏就不管了，由他人的如来藏单独执持。身体里的器官如果割掉的时间长了，如来藏就不再执持，它对我们的身体就没有用，再往我们的身体里面连接，就连接不上，不能恢复功能作用了，它就不属于我们身体里的一部份；或者移植到其他众生身体里，也不会有生命力，没有相应的功能作用了。</p><p>再比如说我们的血管破裂流血了，刚流出的血是热的，为什么热呢？因为有如来藏的执持，时间长了，血就不热了，因为没有如来藏的直接执持作用了。身体掉下来的东西，一个手指头也好，一截肢体也好，皮肤也好，刚掉下来时都是热的，为什么热呢？因为有如来藏在执持着，有火大就有温度，时间长了，如来藏不直接执持它，它就会变凉变硬。</p><p>身体发软也是这样，都是有如来藏在直接执持着，它才发软，死人的身体都是硬梆梆的，为什么呢？因为如来藏不直接执持它了，不亲自缘它，他的身体就是硬的了。有如来藏，众生的色体就有地水火风，就有寿（寿命）、有暧（温度）、有识（七个识），身体又温又软；如果没有如来藏，众生的身体没有地水火风，就没有寿命，没有温度，没有七个识，身体又凉又硬。</p><p>一切法都是如来藏，从表面现象上看，好象是此法生了彼法，其实都是如来藏借助一定的缘所生。外面所有现象都是表面的虚幻的现象，实质都是如来藏的功能。比如十二因缘当中，无明缘行，无明能产生身口意行吗？无明没有实体，只是一个概念，是一个假名词，它不是识心，也没有种子，当然不能出生任何法。事实是因为众生有无明，才有身口意行的产生，然后才有行缘识。</p><p>身口意行是谁产生的呢？是如来藏借助一定的外缘，加上众生的无明，身口意才能出生和存在。身口意行能产生六识吗？肯定不能，是众生因为有身口意行，迫使六识不断现行运作，是谁出生了六识呢？当然是如来藏，不是身口意行，因为身口意行没有实体，没有种子，就不能出生任何法，实质是因为有根尘之缘，由如来藏来产生六识。十二因缘法是一个链条接着下一个链条，前一个链条是缘，其中下一个链条出生的因，都是如来藏。</p><p>三界世间任何一个法，如果没有如来藏来执持，就会坏灭毁灭，都不能存在，我们就接触不到了；没有如来藏，首先连我们自己都没有，何况还能有三界世间。世间任何一个法，都由如来藏来执持，外边的现象是缘，内里的实质都是如来藏。</p><p>一切法的生住异灭，地球的毁灭，全都是如来藏在其中起作用。没有一个法能离开如来藏而有其自体性，能够独立存在。别看那些表面现象好像很真实，好像能够独立存在，好像能够自生自灭，其实不是如此，都是如来藏所起的执持作用。地球好像自己在出生和毁灭，家里的窗户、椅子、板凳等等好像自己在慢慢变异，最后毁灭，其实都没有那回事，都是如来藏输送四大种子产生的生住变异，才能出现那些表面现象。</p><p>一切法都离不开如来藏的执持作用，比如看外边的风吹，树就摇晃不止，其实都是有如来藏在作用着；不止是一个人的如来藏在运作着，而是共业众生的所有如来藏共同作用的结果。所以不是风让树摇动的，风本身是虚幻的，没有自主性，它是被如来藏所出生的法，因此没有主动摇动树木的功能作用，而是如来藏借助风这个缘，来产生作用，使得树摇动起来；风吹的现象本身，也是共业众生如来藏的共同运作出来的。</p><p>再比如我们穿的衣服陈旧了，破烂了，毁灭了，这里都有如来藏在起着作用，不是衣服本身能坏，能磨损，能破损，能灭失，都是如来藏在运用四大种子所起的作用。没有一个法能出如来藏之外的，比如自己家坐的沙发，慢慢的陈旧了，磨损了，然后毁坏，这里面都是如来藏的运作，沙发自己不能生，自己不能灭，自己不能变坏，自己不能磨损，都是如来藏的执持作用的结果。</p><p>再比如说物体运动的余力作用，什么叫作余力，没有什么真正的余力之说，物体的余力和惯性作用，都是虚妄的表面现象，实质是没有的，都是如来藏的执持作用，是如来藏作用的表现。比如我们踢足球，脚一使劲把足球踢出去之后，足球就在空中飞起来了，好像是我们的脚给了它在空中运动的力量，让它有余力和惯性作用，它就会在空中移动。其实这里面全都是如来藏的运作，足球离开了如来藏的执持作用，不可能在空中飞动，我们使多大劲它也不可能在空中飞，这里都涉及到如来藏的执持作用，祂是通过四大种子来对物体起各种作用。</p><p>如来藏对身根、器、界和业种的执持作用，对一切法的变造和执持作用，是甚深的唯识种智内容，我们目前只需要知道一切法并不是独立存在的，并不是有独立的生住异灭的现象存在，并不是有独立的功能作用，都是与如来藏有密切关联的，那么对于世间一切法，就会灭除虚妄颠倒想，灭除错误的认知，以后逐渐就会证得人法二无我，具有甚深的大乘智慧，菩提路上就会快速进步，无烦恼苦厄和忧患，最后就会达到究竟涅槃。</p><p>五、活人与死人的区别</p><p>人死以后，那个死尸上的四大要刹那刹那的生灭变化；活着时，身体也是刹那刹那不断的生灭变化，这二者有什么区别？因为什么有受想行？因为什么有根尘相触？根尘相触的结果是什么？死尸的四大变化非常明显，尸体腐烂的非常快，一开始是出现青瘀，后来是膨胀，然后就是腐烂，这些都属于四大的变化，是趋向于坏灭消失的变化。活人色身也有四大变化，也是刹那刹那的变化，只是一般情况下变化得不明显，不是趋向于毁坏和灭亡，而是继续保持有五阴的功能作用；可是死人就不能做一切事情，没有五阴的功能作用了。</p><p>活人与死人都有如来藏持身，可是持身的方式不同，活人是自己的如来藏单独持身，五阴是如来藏的亲所缘缘；死人的尸体属于共业众生的外相分，由共业众生的如来藏共同持身，是所有如来藏的疏所缘缘，包括活着时的自己的如来藏。尸体没有亲自单独执持的如来藏，虽然死人的意根还攀缘着，不肯放弃，但自己的如来藏也不能单独执持成为自己的身体了，所以尸体没有五阴和五阴的作用。但是因为死人的意根还执著着尸体，如来藏随顺意根，也能在尸体上有相应的执持功能，与其他众生的如来藏的执持作用有所不同，作用可能稍微大一些。</p><p>七八识都离开了成为尸体，尸体也是刹那生灭变化的，只是没有七个识的作用了，与木头一样，木头也是刹那生灭变化的，二者又有所不同，木头的变化微小，死尸的变化迅速。木头的变化是共业众生的如来藏执持的，因此比较缓慢；死人的尸体是肉体，四大种子的结构与木头不同，因此变化明显而快速。因此死尸与石头木头有一定的区别。</p><p>六、阿赖耶识离开以后尸体为什么不马上消失腐烂</p><p>人在死亡时，意根和阿赖耶识离开了色身，色身就成为了尸体，由原来众生单独的阿赖耶识执持变为由很多众生的阿赖耶识共同执持，这时就是一个无情物。无情物都是由四大构成的，其毁坏时，四大要渐次有序的不断的从无情物上回到各个众生的阿赖耶识中，这个过程需要多长时间，那是不一定的，由众生的业力决定，也在于无情物是否坚固。尸体的腐烂在阿赖耶识离开色身时就开始了，只是最初不容易察觉，腐烂的速度也在于周围所处的温度和环境，以及尸体当中的水分多少。因为温度和湿度是细菌繁殖的条件，细菌繁殖的越多越快，尸体腐烂的越快。最后就剩下骨头，属于宇宙山河大地器世间当中的一部分，到一定时间，骨头也风化分解不存在了。</p><p>色身刚刚死亡的短时间内，还属于单独阿赖耶识执持的，识心也有可能再生出来，比如世间的还阳之说就是这个道理。那么人刚死的时侯，阿赖耶识和意根还没有完全离开的时候，进行器官移植必须在短时间内，所谓的短时间，就是几个小时之内，几个小时之内保证这个身体器官，阿赖耶识还执持着，神经还有用，细胞还有用，肌肉组织还有用。这个时侯器官移植到别人身上，如果两个人意根不合，那就会出现排斥的状态，如果两个人意根合，两个人交情和感情不错，就不出现排斥现象，阿赖耶识的交接工作就能完成。意根执著色身器官，不同意给别人，两个阿赖耶识的交接工作就不顺利，有可能出现其它的不适症状，就是身体的排斥反应。</p><p>再比如一个人的手指头断了，短时间内手指头还有温度，血管还有用，在这个时间范围内，血液还能够流通过去，血管还有用，神经还有用，还能接上。再接上时，还能和手连一起，不久就能长合，还能活动。等时间长了，这个手指头变成共业众生的阿赖耶识共同执持，再接到手上就没有用了，怎么缝合也没有用，就像接块木头似的。</p><p>七、一真法界的意思是，一切法都是如来藏变现和执持的，都是如来藏的功能作用，没有一个法能离开如来藏的作用而存在，死尸也如此。如来藏不执持的法，马上就消灭无余，一点影子也不会存在。修行者留下的真身，属于所有众生的色尘，是有缘众生的如来藏共同执持的，包括修行者的如来藏也在执持。自己身上掉下来的手指头，一开始是自己的如来藏执持的，所以还有温度，神经系统还有用，再接上去就能用。如果自己的如来藏不亲自执持，手指头就没有温度，僵硬了，这时是属于有缘众生的如来藏共同执持的，接上去也没有用了。</p></div>"
},{
    "title": "第二十一章　如来藏与外道法的区别",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十一章　如来藏与外道法的区别</strong></p><p>一、世尊刚成道时，最初在各层天中，为菩萨们宣演大方广佛华严经，后回人间为小乘根基的弟子们讲四阿含，宣说苦空无常无我之理，破斥外道常我之见，有些外道也能够随顺世尊而修学四圣谛理，继而得以解脱。可是临涅槃时，世尊在涅槃经中又宣说佛法终极真理常乐我净，昭示众生佛地境界有个真常不变异的心体，那就是真我，真真实实，处于真实的寂灭乐中，那个心最极清净无染，有真实的我性。</p><p>世尊为一切众生宣示：俢证佛法最终结果就是常乐我净，修到最后不是苦，不是空，不是无常，不是无我，而是真实不虚。外道当中的弟子们，一听佛说佛法当中确实有真实不虚之法，修到最后不是空无，更不是断灭，这样的法才值得追求，值得修证，于是外道弟子们纷纷来求佛出家俢道，随佛修行常乐我净之真实法，从此舍弃了断灭外道法。</p><p>外道的头目们一看大事不好，心想：你瞿昙宣说苦空无常无我，我们还能忍受，因为你有无常，我们也有无常，你的法无我，我们的法也是无我，彼此平等；而你现在突然又说有常乐我净之法，说佛法当中有真实的法存在，俢到最后不是空的、不是虚妄的，让我们的弟子都跑到你那里去了，这件事我们实在不能容忍，更不能容忍你前后颠倒的说法。所有头目聚到一起，商量对策，决定派一些俢持最好的外道弟子去与佛辩论。在辩论道场上，上万人聚集到佛前，结果每个与佛辩论的人，被佛三言两语打发证了果，然后就随佛出家了，无数外道弟子投于佛法中出家俢道。</p><p>世尊临涅槃时最后度了一个外道120岁老人，是阿难五百世的父亲，俢外道空法俢了几十年，也没有证得初果的果位，他修定修到了四禅八定中的最高定，非想非非想定，于是他就认为这种定境就是涅槃境界了；世间一切对于他来说根本是不存在的，他一心在定中，认为自己已经证得涅槃了。世尊告诉他，你证得的定境不是涅槃，因为定中还有个想，有个知，想和知就是意识心，意识是生灭法，有生灭，就不是涅槃。老人思惟一下认可此理，就证了四果罗汉，他说：我不忍见世尊涅槃，我要先于世尊您之前涅槃，佛就同意他取涅槃，然后以出家人的身份处理后事。</p><p>于是老人入到非想非非想定中，灭了意识心进入到灭尽定中，灭了意根的受和想两个心所法，进而又把意根全部灭掉，这样老人的五蕴十八界都灭去了，只剩下一个真实不灭之心如来藏，如如不动，没有生灭，没有觉知，没有苦，不在三界里，这样老人终于解脱了，出了三界，没有了生死，也没有了老人，这就是不受后有的涅槃境界。这个事例说明，外道法一味俢空，不知空理，永远也不能得解脱。</p><p>而佛法是最真实的法，众生随佛修到最后，到达佛地境界时，得大自在，就有真常不变异法，有我，有常，有净，有乐，这些法真实不虚，这就是真实而如如的真如境界。真如永远不再变易，究竟彻底的清净了，常处于寂灭乐中，有真实的我性。佛地的无垢识与意识心的妙观察智一样，有二十一个心所法，即五遍行和五别境，加上十一个善法，这些法是非常的殊胜，运作起来将是神奇无比。而众生的如来藏只有五遍行心所法，触、作意、受、想、思，众生的如来藏必须和前七个识共同和合运作，才能现起万法，不能单独起作用变现万法。所以修学真正的如来藏法，就有真实利益可得，非如外道一样，学到最后，仍然不得解脱，不得生死自在。</p><p>二、外道的断见是认为一切法都空，连真如如来藏也没有，他们都是一无所有的断灭空思想者。虽然世间一切法都是空的，幻化的，生灭的，但是还有如来藏不是幻化的，不是断灭的，是真实存在的法。因为有如来藏不灭，才能有一切法的空，才能有一切法的灭；只是如来藏的存在方式，是一种无任何相的那种存在方式，与世俗法不一样，普通人不能理解。真正理解和认可如来藏的真实存在，是不容易的，只能等到众生的善根成熟了，信受大乘法的因缘成熟时，才能慢慢信解。</p><p>外道的常见是认为众生死后，灵魂不灭，还能到未来世去，灵魂生生不已。他们把灵魂当作真实不生灭的法，而灵魂恰恰是生灭性的意识心，常常是要断灭的，不能去未来世。断见和常见都是外道的错误知见，因为外道不懂真如之理，才有这些错误知见。</p><p>佛说的常，是真实的有，真实的存在，祂永远是不生灭不变异的，无始又无终，没有刹那断灭，那就是真心如来藏。如来藏与外道所说的常是迥然不同的，外道说的常——神我，是意识心，是生灭法，认意识心为永恒的真我，就是常见外道。而真正的佛法都是以第八识如来藏为出发点，来展开一切法，一切法都是围绕着如来藏而生而灭，丝毫没有自主性。</p><p>边见就是说其见解在佛法的边缘，还没有入到佛法中。佛法是讲一切法都是真如所显，如来藏所生，离开如来藏无一切法，因此离开如来藏而说的有和无，都是错误的知见看法，不入佛法中。离开如来藏说有不对，说无也不对，有无都不是如来藏的中道法，因此都是边见。就像声闻四圣谛法，离开如来藏就没有四圣谛理，四圣谛就不存在了，小乘的空不能离开如来藏而说，苦集灭道不能离开如来藏而有，离开如来藏就不能造苦业，存苦种，受苦报，离开如来藏也不能修行和灭苦，苦集灭道就不存在了。缘觉的十二因缘法和十因缘法离开如来藏，也不存在任何一种缘，不可能有任何一个法的存在，因缘法都是依如来藏而展开。这些理甚深又甚深，需要我们多培养善根和福德，才能信受不疑，入到真正的大乘佛法中来。</p><p>三、如来藏与外道所说真我的区别﻿﻿</p><p>外道们都是把意识心，尤其是把意识没有妄想时的那个灵知心当作真我，把这个境界当做真常，当作不生不灭，这就是外道所谓的那个“神我”，他们奉承和推崇的是这种识心。于是他们就经常打坐、修定，让这个觉知心不起一丝的妄想，如果稍微不慎起了妄想，再把妄想灭掉。反反复复、来来回回就训练这个意识心，好让祂没有妄想，让祂明明了了、清清楚楚、明明白白、澄澄湛湛，以为这样就是常乐我净了，就是真如显现了，就是不生不灭了，其实不是。</p><p>心外求法的人都在修这个意识心，让意识心达到这种境界，好像这样修行就成功了，就是开悟了，就会成佛了。因为他们把意识心当作永远不灭的，认为人死了以后，灵识不灭，能去到未来世，就把这个灵识当作真我，当作永恒不灭的，这就叫作常见外道。</p><p>所以现在世面上很多地方都在教禅，这些所谓的禅都是在训练这个意识心，怎么样让这个意识心稳定下来，清静下来，安稳下来，快乐起来，没有妄想，灵灵明明，了了灵知，都在训练这个。然后让自己感觉舒服，感觉自在，感觉快乐，感觉如何如何......凡是这些感觉，都是第六识心的感觉，全部是虚妄法，他们把这个叫作禅，不知道这个禅定，是意识心的一种粗浅的定，根本不涉及到真如自性的禅，所以都名为心外求法。</p><p>在真如之外修行求法，不修不证真如自性本心，就叫作外道，不是佛门内道。现在学佛人中到处都是在修这种外道法，自己却都不知道。不知道真正的禅是真如如来藏法，他们不懂得般若经典，那《楞严经》等甚深经典就更不懂了。很多人都在修定，只求能粗浅地降伏一下意识心，少生一些妄念，或者能达到暂时的无念；或者训练让意识心自己快乐一些，宁静一些，舒适一些，自在一些，安详一些，清静一些等等，这些修行方法，最多能达到欲界的未到地定，因为心不断贪，还有欲界各种贪求，就连初禅定也不能现起。他们从来都不考虑如此修行，能否解决生死的大问题，不考虑生死如何能了得。</p><p>即使通过修定，把意识心训练降伏下来，修到四禅八定当中的最高层定非想非非想定，也只是生死业障凡夫，不出生死轮回苦。死后在非想非非想天，八万大劫入定，在定中，意识心一点念想都没有，那个定确实很深了。但是八万大劫对于他来说，弹指之间就过去了，然后又到哪去了呢？八万大劫到了的时候，内心里的种子，过去生造业的种子、业缘成熟了，他就会随着业缘又在六道轮回里受生死苦。</p><p>释迦佛出家以后，曾经跟一个外道老师修四禅八定，祂的老师叫郁兰托弗，修定修到了四禅八定的最高定，非想非非想定，定中那个意识心极其清静，不杂一丝念想。但是他在修道中，造了意念的恶业，发了毒誓，命终先升到非想非非想天享福，福享尽以后，就会实现毒誓，造作恶业，杀害众生，以后就会因为杀业下地狱受苦报受恶报。等到释迦佛成佛以后，想找这个老师，来救度他，世尊一观察，哦！祂的老师已经升天了，升到非想非非想天去了，想救他，但是没有办法了，他已经入定，佛拿他没办法了。所以祂的老师在八万大劫以后，就要造恶业，之后下到地狱受恶报，世尊对此非常的惋惜。</p><p>所以佛不希望众生只是一昧的修定，一味的定而没有正知见，那就是邪定。没有正确知见，不能得解脱，不能明心见性，那成佛就遥遥无期。所以我们对于修学佛法，应该有个正确的知见，学正确的佛法，要具备般若的智慧，要有断我见的智慧，不要一味的修那种无觉无知的邪定，在意识心上搞来搞去，那样没有什么意思，没有什么好结果，死后仍然是六道轮回。</p><p>在众多修行人当中，有人就喜欢打坐修定，打坐真舒服呀，身体也舒服，心也舒服，没有妄想，百事不思，很轻松。不知道我们好不容易遇上了佛法，把时间都消耗在打坐上了，坐得再静，可是智慧生不起来，那叫邪定，只能修修身体，让身体健康舒适一些。所谓的正定，是和智慧连在一起的，是智慧解脱，智慧成佛，再加上福德因缘，才能成就道业。修定再深，也不能深过外道，也比不上释迦佛的老师的定深，他们的深定，都不能得解脱，何况粗浅的未到地定。</p><p>那我们就不要浪费过多的时间去修无念想的定，应该修行能深思佛法的定，能参究佛法的定，具足未到地定和初禅定就好。好不容易遇到了佛法，遇到了大乘法，不在般若智慧上用心，却在那种不生智慧的定上用心，那就很可惜了。总喜欢修无念想定的人，应该把时间抽出来，多用来修福德，修般若智慧，把六度想办法都修具足了，以期达到明心见性和断我见的目标，那么三恶道业就会消灭，断烦恼，得解脱；再做大乘菩萨，将来还能够成佛，这是求之不得的自利利他的大事。</p><p>四、世尊在世为众生讲法时，首先教导众生无我法，一方面是让众生断除五阴我见，解脱生死，一方面也是让众生脱离外道邪见。因为外道法里，都是把五阴十八界当中的某一法，当作真实不灭的我，这样就不能断除我见，生生世世因这个我而流转六道，受无穷尽的生死苦。世尊到最后讲法时，又宣告众生，我们佛法当中，不是无我，而是有我，有个真正的我，叫作常乐我净，这是众生修到最后的终极目标，这才是真正的佛法，与外道法又有极大的根本性区别。</p><p>外道们也说，我们这里也有无我法，一切法都不是我，一切法都空，众生一世生命，死后一了百了，什么也没有，并没有一个真实永恒的我存在。他们这种断灭见严重地混淆了佛法，让众生不识不修真正的佛法，因此不能解脱生死轮回。又有一种外道立论说，众生不是死后空无，还有真实不灭的我，能去到后世，那就是每个众生的灵魂“神我”。</p><p>他们都是把假法，当作我们佛法里的真法，以假乱真。佛说有真实的如来藏我，常恒不灭，他们说我们也有“真我”不灭，他们把意识心，能够断灭的意识心，当作永远不断灭的，能去到未来世的“真我”，这个不是“真我”，而是生灭的“神我”。其实他们说的灵魂和神我，都是生灭性的微细的意识心，然后把这个和佛教里的真实法如来藏混为一谈。</p><p>外道们说我们这些法都是正确的，修行都能得解脱，与佛法都一样，没有差别。但是众生依之修行，却不能断除我见，不能得解脱，反而增加生死系缚。依意识心而修行，认意识心为真，那就是邪见，就是我见，这个邪见我见就会把众生捆绑在六道里面，不能出离，最终还是生生世世在六道轮回里生死不断，他们都是在造六道轮回业。众生在意识心上无论怎么搞，无论把意识心变得如何清静，如何细微，也都是在意识心的范围内，都属于生灭法。再怎么说祂不生灭，实质上却都是生灭的，怎么说不生灭都没有用。</p><p>灵魂神我意识的体性就是生灭性的，而且睡着就灭，一棒子打昏也灭了，死了以后更是灭，怎么说祂不灭，祂也是灭了，说与不说，跟祂自己灭不灭都没有关系。不是说让祂不灭，祂就不灭了，祂的体性就是要生要灭的。而且修外道法，修到入无想定里面，一点意识心都没有了，那微细意识心也灭了，灭了以后还会生出来，那还会在生死轮回里不能出离，还有苦受，所以依止外道法而修意识，永远解决不了生死问题。</p><p>佛法修行是让我们解决生命的根本问题，一个根本问题就是认取五阴为我，这种邪见是众生轮回生死苦海的根源，灭掉这个邪见，就会解脱六道生死苦。再一个众生生死的最根本的问题是不知身中有真实的如来藏我不生不灭，因此无明而有生死流转。修学大乘如来藏法，能让我们解决生命的实质问题，最后就能万事大吉，生死了然与己不相干。认识到如来藏是众生生命的真实相以后，证得万法都是祂出生变现出来的，那就识得生命的真正根源了。</p><p>知道五阴世间都是由祂出生，被祂所出生的三界世间一切法都是不真实的，从此以后就不再认取五阴为我，不认取万法，生死轮回苦就能彻底解决。比如一个魔幻师会幻化，会变魔术，他打个意念，就会变出很多东西出来，那些东西是不是生灭的？当然是生灭幻化不实的了，都是魔幻师变现出来的。这些东西由魔幻师说了算，让它们有就有，让它们没有就没有，那些东西都不是自在的，所以都是生灭的。魔幻师是那些东西的主人，他想有多少就有多少，想变多少就变多少，想什么时候变就什么时候变，想变到哪里就在哪里变，他是主人，那些东西是被幻化出来的，都是假相，所以都是生灭的。</p><p>同理可知，如来藏就像一个魔术师，祂依缘幻化出来了五阴世间一切法，祂是五阴世间的主人，祂是自在的；而五阴世间是被幻化出来的，是不自在的，当然就不是真实的我，如果我们从此不再认取五阴为真实我，那就没有生死了。我们的意识心、神我和灵魂是五阴的一部分，也是被如来藏幻化出来的，当然也是生灭的，不自在的。</p><p>如来藏输出意识的种子，意识心被生出来，就有了知性，这种了知性就是如来藏赋予祂的。所以意识心就是这样的虚妄，不管把祂修到多么多么的微细，意识心还是意识心，永远是生灭法。修到什么程度，意识也是要了别六尘，了别定境法尘，也了别梦境法尘。祂就是这种了知六尘的体性，永远代替不了我们那个真心如来藏，再怎么混淆也混淆不了，有智慧的人就能够识别真假，识别真我如来藏，从而获得更大的智慧。</p><p>五、学佛人是否可以用外道法</p><p>所谓的外道法，是指不属于如来藏的法，离如来藏心而说的法，叫作外道法。很多外道法对学佛人都有大用，所以不要排斥有用的外道法。医生给病人治病也是外道方法，我们能否离开外道方法，只用如来藏法来解决一切事情？显然不能。外道吃饭我们也要吃，外道生活在地球上，我们也不能离开地球，外道要呼吸空气，我们也要共同呼吸同样的空气。我们无始劫以来从来没有离开过外道法，学佛以后还要修与外道相同的法，这是必须的。外道除了没有如来藏法和五蕴无我法，其他法都有，我们也要具足。比如说外道的那种出离心、解脱心和禅定，以及解决色身问题的各种方法，都非常值得我们学习，只要对我们有用，我们就要用。其实所有的外道法都是如来藏法，包括医生给病人治病，也是如来藏治好的病，实质上还是如来藏法。任何人和法都脱离不开如来藏，都是如来藏出生的，本质都是如来藏。</p></div>"
},{
    "title": "第二十二章　如来藏与因果﻿﻿﻿﻿",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十二章　如来藏与因果﻿﻿﻿﻿</strong></p><p>一、众生无始劫以来所造作的业行，无数台电脑也算不清，众生无量劫的业种，如果能够格式化，过去的业就算了结。但是这些业如果不受报完了，或者不经过忏罪，不通过修行以达到彻底清净，业是不会了尽的。因为所造的业太多了，如果虚空有形，虚空也会被撑破的。那些业都是由众生各人的因果业报。</p><p>我们所不知道的所有事情，如来藏都记载着。那些因因果果纠缠不清的复杂事情，如来藏都知道，因缘具足时，都会如实公正地显现出来。所以我们不能看那些表面不公平的事情，其背后的因果太复杂，如来藏都会算清，如实地呈现因果报应。那么世界上就不存在不公平的事，有如来藏存在，一切都会平等的，都会公正的。事情你只要做了，就没有白做的，无论好坏。</p><p>如来藏太不可思议了，学了如来藏法以后，会懂得很多人间天上三界世间的道理，那样无明就会减少了。那些业行，意根越执著，如来藏记载的越深刻，所以有心造业和无心造业，所得的果报就不一样。那我们做善事，就不要考虑会不会得善果报，如来藏会让你有相应的善果报的。做恶事，也不能心存侥幸，以为能躲得过去，如来藏不会让你躲过去的。善护身口意，莫以善小而不为，莫以恶小而为之。</p><p>二、众生生生世世所做的一切事无论巨、细、善、恶、无记，都由各人的如来藏所记载，作为种子寄存在如来藏里。当因缘成熟时，如来藏就会输出所存的业种，来实现这个因果律则，众生就会受到相应的果报。如杀业，甲杀乙时，这个流程两个人的如来藏都各自做记录，业行消失，种子就收存不灭。等到某世两人相遇，或者相识或者不识，因缘成熟时，各自的如来藏就分别输出业种，被杀者就起心要杀甲。</p><p>如果前世，甲是无意而误杀乙，今世相遇，乙也会不故意而误杀甲。这样就平等地实现了因缘果报，而乙不知道为什么杀甲，甲不知道为什么被杀。两人的杀与被杀业种子就消失，互不相欠。如果乙在讨债时讨过了头，比如同时又抢劫了甲的财产，或者给甲分尸，或者其它恶行和善行，那么各自的如来藏再做记载，后世相遇，甲再讨乙债，如果讨债时又过了头，乙再往回讨，这样因果循环不已，无有出头之日。众生就是这样，业果交织在一起，纠缠不止，苦不堪言，甚为可愍，业行不息，轮回不已。众生学佛，明识佛理，清净业行，不造恶业。多结善缘，互助修行，同登法船，共到彼岸。</p><p>三、佛在菩萨优婆塞戒经里说，一恶众生的恶业因缘，能让整个国土瓜果蔬菜不收，这是为什么呢？</p><p>众生的业报分为正报和依报。正报就是五阴色身所受的因缘果报，比如众生的色身种类和状况，属于四圣六凡里的哪一种，在凡夫中又属于哪一道众生，六根是否具足，是否正常，是否有残缺和病障等等。众生正报的色身，是由众生单体的业种（前世和今世造的业）所决定的，是单个众生的如来藏单独变造出来的。而依报是众生的共同生存环境，生存环境不仅仅是单个众生来受用，是共业众生共同受用，因此生存环境是由很多共业众生的业种所共同决定的。那么依报的生存环境就是所有有缘的共业众生，他们的所有的如来藏依据他们共同的业种所生成的因缘果报。</p><p>依报就是众生外界的生存环境，生存环境不是由一个众生所能决定的，是所有的共业众生，他们所有的业缘业种来决定的。那么外界的生存环境就不是一个众生的如来藏能够单独创造的，是所有有缘的众生，他们的如来藏共同变造出来的。共业众生的如来藏共同输出地水火风四大种子，输出众生造业的业种，输出来以后，共同变现所有共业众生的依报——生存环境。</p><p>我们生存所依赖的饮食瓜果蔬菜的收成如何，是由所有有缘众生共同的业缘所决定的。那么这些依报是如何形成的呢？众生的业包括共业和别业，别业包括单个众生的业和一部分众生别于所有众生的业。共业和别业都是相对来说的，不是绝对的共业和别业，比如某地区的业既是共业也是别业，共业是这个地区众生共同的业缘，别业是别于其他地区、别于整个世界众生的业缘。所有众生的业，是所有众生的如来藏依据众生的业缘，输出业种以后所形成的依报生存环境。因此依报的生存环境不是由一个众生的如来藏所能决定得了的，是所有众生的如来藏依据共同业种来决定的。</p><p>如果有一个众生他的恶业力非常大，其他众生虽然有一些善业，但是这些善业种子的力量敌不过这个恶众生的恶业的种子的力量，那么结果就是以哪个业重就以哪个业为主现行出来，所有众生就随着恶众生一起生活在恶劣的生存环境。所有众生的如来藏输出的业种，就抵不过这个恶众生的如来藏所输出的恶业种，那么最终的果报就是恶报，于是就出现了瓜果蔬菜不收的情况，众生就得忍饥挨饿，现出贫穷的果报。</p><p>如果这一个地区有一个大修行人，这个修行人善的业种比较重，善的力量比较强大，他也能够改变这个地区的依报环境，让瓜果蔬菜生长茂盛，民众生活富足安康，或者使这个地区灾障消除。如果这个地区的众生的恶业太重，那么这个修行人就不能改变整体的恶劣环境。他虽然善业比较重，但是他敌不过众生的恶业的力量，众生的恶业太严重，那么依报就以恶劣环境为主。世间真正的修行人如果有很多，也许就能改变世间的生存环境，使众生的依报得到改善。</p><p>如果众生的恶业极重的话，即使有很多菩萨到这个世间来，虽然菩萨的善业力量非常大，但是众生恶业的力量也非常大，两种力量要看哪种力量强，就以哪种力量为主。如果善业的力量大不过恶业的力量，就以恶业为主。众生的如来藏输出恶业种子，结果显现的果报就是恶的果报。如果说善业的力量比较强，比如说在极乐世界或者是其他佛国土，在那里佛菩萨们善业力量是极其强大的，几乎是没有什么恶业，那么其佛国土的依报环境就非常的殊胜。</p><p>单个众生的修行也是一样，要看这个众生的恶业重还是善业重。临终的时候哪个业重，他就被哪个业牵走，如果地狱业重，他就随着重的恶业下地狱，如果善的业重，他就随着善业升天。如果他发愿往生极乐世界，他的愿力非常大，这个愿力远大于他的恶业力，那么命终就被这个强大的愿力牵引到极乐世界，他就会往生极乐世界。</p><p>我们学佛修行就有这么一个法则，这个法则就是看我们的善恶业行，哪个业大，哪个业重，那么现世、命终或者来世就以哪个业为主，随着这个重业去受果报，就会随后现出这种重业的果报。如果善业大，我们今生就可能明心见性，或者临终往生其他更殊胜的佛国土。如果恶业比较重，尽管学佛修行，因为恶业一直在牵累着，今生也很难修行脱离三恶道。他的果报就以恶业为主，临命终就可能下生到三恶道受报，不能得到人身，更不能往生其他佛国土。</p><p>所有众生的业种也可以进行总体衡量，看结果是善业的力量大还是恶业的力量大；如果善业的力量大，现起的外界的生存环境就会美满如意，更为殊胜一些。如果所有众生的恶业都重，结果就以恶业为主，现起的依报，就是非常恶劣的生存环境，比如生活贫穷或者是灾难频发等等。如果有一个大修行人，他的善业比较大，那么他可以扭转整个恶业的趋势。如果有一个众生他的恶业力量非常强，尽管其他人有一些善业，但那个众生的恶业力量太强了，那么依报会被他的恶业来扭转，以他的恶业果报为主，现起的生存环境就非常的恶劣，果物庄稼不收或者灾难频发，就是因为这个恶人恶的因缘太大了，恶业种子力量太强的缘故。</p><p>但是共业当中，还有别业，比如飞机失事时，有人死亡，有人就会安全无恙返回家乡，而有人本来要登上飞机，与这些人一起遭遇灾难，可阴差阳错，他就没有登上这架飞机，躲过了这个灾难。这些因缘果报是极其复杂的，只有佛的一切种智才能完全了知，等觉菩萨也没有办法详尽而全面的了知。</p><p>佛教中有一句话叫作：佛力不可思议，众生的业力也不可思议。尽管佛力无穷无尽，无边广大，但是众生的业力也同样无穷无尽，无边广大，众生的恶业力足可以抵挡住佛的无量的神力。这就是说众生恶业也是不可思议的，众生无量劫的生死恶业，其力无法想象。佛世尊三大无量劫的修行，其福德智慧和神通道力众生都不能思议，那么众生的业力，众生自己同样也不能思议，只有佛能完全了知佛的神力和众生的业力究竟如何。</p><p>众生的业力感召了三界世间的生住异灭，也能感召天灾人祸，乃至于劫尽时的水灾、火灾和风灾，整个三禅天以下的器世间全部毁坏。到了这个世界毁坏的时候，三灾就出现了，水灾出现时，大水淹没了整个的欲界和色界初禅天；火灾来临之际，大火一直烧到色界二禅天，将二禅天毁坏；风灾来临时，大风一直吹到色界三禅天。到了第四禅天才止息了灾难，因为四禅天人心无动转，是舍念清静地。三禅天以下都有灾难，就说明三禅天以下的众生恶业力非常大。因为他们的心都有动转，都不清静。心有动转，就有业力，其业力就能感召整个世界的毁坏，包括三千大千世界的毁坏。</p><p>四、万法皆空，因果空不空</p><p>因果也是万法当中的一法，是一种生灭性的暂时而有的一种现象。无论什么样的因果都能发生变化、能出生、能灭亡，有生灭变异，因此因果就是虚妄的空的。如受苦报、受乐报、受不苦不乐报、受六道轮回报，这些果报受完即了，果报就结束，存在如来藏里的业种也就消失不见，有生有灭之法就是虚妄不实的，因此也就是空的。</p><p>因果是由众生的五阴身造就和承受的，五阴本身是空的、幻化不实的，造的业因就是生灭的、空的、幻化不实的；受的果报也是空的、幻化不实的。因果是世俗法现象界的一种假象，依众生的如来藏而有生又有灭。世出世间法只有如来藏不空、不生不灭、不变化、不消失，其余一切都是有生、住、异、灭的，所以都是幻化的，都是空的。</p><p>因果报完，就不再持续了，然后再有其它的因果出现和实现。因果，生灭变异不实，所以是空的；因果是后天出生之法，也能消失结束，所以是空的；因果实现的当时，就是空幻的，是如来藏在实现着因果律则，表面上有，实质是无。众生都是虚妄地造业，虚妄地受报，白白地受苦，从来不知苦本身的虚妄性，更不知造作苦因本是虚妄，更不知苦果的虚幻，也不知造作苦行就有苦果。不知苦因，不知苦集，不知苦灭，不知苦灭道之修行方法，所以众生无量世就这样生死流转，什么时候流转够了，什么时候才能觉醒，才能开始小心造作业行。</p><p>五、善因有善果，恶因有恶果，不善不恶因有不善不恶之果，一切都在因果之中。这些因果都由如来藏来如实的实现。如来藏会平等地实现一切业因果报，按照其固有的因果律则，绝不会有冤假错案。我们学佛修行的一部分内容就是要改变和消除那些恶的因缘果报，不断地增加善的因缘果报，以取得究竟清净无余的佛果。</p><p>业因是五阴在世俗法里造，果报也是在世俗法中实现。既然是世俗法，就是虚妄法，不是真实不变之法，都是如来藏所幻化出来的虚妄相，相是有，实质是空的。众生往往是因为执著五阴世间的一切法为实有，才能为五阴而造作一切业行。如果真正证得了五阴非我，断除了对五阴的执著性，就不会再轻易造作恶业行了。</p><p>虽然业因果报是空的假的，但是受报时也是非常苦恼的，因此我们有必要识因达果，不造恶业，只造善业，生生世世享受善果，直至成佛。世尊慈悲，来此五浊恶世，用各种言词说教，来教导众生破除五阴为我的邪见，众生最终才能得到解脱，回归自性当中。我们应该遵循世尊的教导，断恶修善，修除一切烦恼和染污，清净心地，自利利他，早日成就佛道，圆满佛果。</p><p>六、问：因果酬报丝毫不爽，不会不报和错报。那么，给人念经念咒能够帮助生病的人康复，做法事超度，又为什么能帮到他人呢？</p><p>答：每个众生造作的业行，业种虽然存在如来藏里，不会无缘无故就消失不见，业种的消灭，要通过一定的形式才能消除，一个消业的方式，是业种现行出来，众生受到恶报，报尽，业种就没有了，以后不再因为此业而受果报；另一个消业的方式是忏悔，忏悔过后，心变清净了，重业就变轻业，轻业就消失；再一个消业的方式是，通过念佛念经念咒超度等等，能感应到诸佛菩萨加持来消业。</p><p>另一方面，有病的人，业障现前，有的是冤亲债主来讨债，通过念经念佛给冤亲债主回向，他们得到益处，就不再讨债，病人的身体就康复了。如果念经念佛念咒能帮助众生消业，这是超度者有德，有德的人能感应到佛菩萨龙天护法的加持，从而灭掉众生的一部分业障，使得众生的冤亲债主受到法益，原谅众生或者离开众生，众生的病障就消除一部分。再者一个有道有德之人，也有能力化解众生的业缘，减轻众生的病苦。这里面就涉及到了意根的心所和意识心的心所法的运用，最重要的是有如来藏的具体操作和实施，以及众生的如来藏之间的互通作用，其中的三能变识和合运作细节非常复杂，有极深的唯识种智才能观察到这些内容。</p><p>众生的业有定业和不定业，定业可以通过一定的因缘条件变成不定业，不定业也可以通过一定的方式方法消失掉。很多的业不一定都要通过受报的形式才能消灭，通过忏悔的方式也能消业，尤其是悟道以后，明了世俗谛理和胜义諦理，消的业又多又大，心改变了，一切业都会改变，万法唯心造，关键在于众生的心是否清净。但是重大的定业不可改，也不通忏悔，一定是受报之后，业种才能消灭。重大的恶业会严重地遮障自己的道业，阻碍自己见道、证道，未来必下三恶道长劫受苦，所以每个人都应该降伏自己的贪嗔痴烦恼，避免有意和无意地造作大恶业。</p><p>断我见和明心见性之后，悟得了无生之理，具足了无生忍的智慧和无生法忍的智慧，这些三恶道的业就能消灭，三恶道的苦报就变为只在人中受些余苦，果报就结束。因为业是生灭变化的，不是本来固定存在的，有生之法必有灭时，只要是人为的五蕴产生的法，有生之法，必有灭，非是真实存在永远不变的，只要是虚妄法，就都能发生变化。所以我们修行一定要积极地通过忏悔等各种形式，改变内心，让内心逐渐地转变清净，那么业种也就能改变了。</p><p>但是要想造作过的业种完全消失，是不太可能的，最多只能减轻一些罪障而已，就像破碎的玉器，无论怎样修补，都会有裂痕，泼出去的水，无论怎样也难于完全收回。这些因果律则都由如来藏来实现，而如来藏不做主宰，意根虽然能做主宰，但是意根也通融不了如来藏，因为如来藏一丝缝隙也没有，言语不进，也不近人情，不谙世故，铁面无私，只按其固定的程序来实现因果，因此很多地上菩萨也要承受因果的苦报。</p><p>这些因因果果的复杂程度，地上菩萨的唯识种智能观察出一小部分，只有佛才能完全的了知。所以说深信因果是非常不容易的，一般人只会存着侥幸心理，多数的时候对因果是无觉无知的，入地的菩萨因为能够观察和明了如来藏的运作之理，才能深信因果，不敢妄造业行，其余的人，都是昏天暗地的多。为了我们自己的道业增进，少些苦报，一切时中都要谨言慎行，把自己放得低低地，尤其是对待大乘三宝，对待大乘如来藏法，更要小心再小心，没有智慧时，敬请沉默不语，以免自己造大恶业，后悔无期。</p><p>七、我们每天有意无意的身口意行是否都会有果报</p><p>身口意的行为分为善的、恶的和不善不恶的无记业，有意和无意的身口意行，包括在三业里。身口意行不管是善的、恶的，还是无记的，只要做了，就会在如来藏里存种子，种子遇缘就会生出果报，所以一切业行都有果报。但是果报有所不同，有意造作的果报大，无意造作的果报小，善恶都是这样。</p><p>有意作善，善果报就大（这里有意是指有善心的意思），无意作善，善果报就小（这里的无意是指本来没有想作善的心思，可是恰巧就作了善业）；有意作的恶业，恶果报就大（这里的有意是指有恶心的意思），无意作的恶业，恶果报就小（这里的无意是指本来没有恶心，可是恰巧就作了恶业）。</p><p>无论怎样，果报是一定要有的，因为身口意行出现时，如来藏都作记录，有意的身口意行就作有意的记录，无意的身口意行就作无意的记录，然后就作为种子存起来，将来的果报就会出现。身口意行的种子输送出去，还要回到如来藏中，那就把身口意行的信息带回到如来藏中，成为了业种。</p><p>要不然众生为什么有那么多的业障，有那么多的苦报呢？ 如来藏作记录也不是有心有意的，祂只是要依一定的律则，依一定的程序和流程，自然就记录了一切的业行。对他人所作的任何身口意行，将来都要反弹回来，还要加上很高的孽息来承受，当然善业也如此，要加上高额利息，众生就要承受善业的高额果报。</p><p>八、身口意的行为，只要出现了，就是业。身是身体的行为造作，口是语言的行为造作，意是七识心的思想行为造作。不管是哪个众生，只要有行为造作，都有业，都有果报，要看身口意行为的善恶性和轻重性。身体行为造作有善恶有轻重，语言行为的造作有善恶有轻重，七识心的思想行为造作有善恶和轻重，那么果报就有善恶和轻重；有意，有有意的果报，无意有无意的果报，没有不受果报的。意业不犯或者非常轻微的，只有断除贪嗔痴烦恼的三四果人和地上菩萨，其余人都犯意业。口业比身业容易犯，多数人口无遮拦，身行造业的不算太多；如果身行造业多的，那是贪嗔痴烦恼极重之人。</p><p>身口意行造作的一切法都作为种子收存，把聪明智慧收存起来，后世在同样事情上仍然具有聪明智慧，不懂的事情，来世仍然不懂。每项事业，不管善恶还是无记，如来藏全部记录收存，事情都没有白做的，不是做完等于没做一样；说过的话，也不会白说，以后都有个果，有个交代。</p><p>业种要因缘具足，才能现行，无量劫的业种，不能一时都现行出来，而是哪个业种先熟，先实现哪个业的果报。如果都一起现行出来，就会出现善恶交织、喜乐和苦恼交织的果报，因果就更显得错综复杂了。</p><p>九、众生在人中比较容易修学佛法，人中苦乐参半，感受到苦时，才能有灭苦的心，才能修道；生存环境太苦就无法修行；生存环境都是乐，就不愿意修行，有苦有乐，才能修行。所以世尊要到人间来成佛，以度人为主，天人都在忙着享乐，没有心思修行，恶道众生，畜生愚痴，不解言语，不能修行；饿鬼无福，忍饥挨饿，不能修行；地狱众生，痛苦交加，心识昏暗，没心修行。俗话说，富贵学道难，贫穷布施难。</p><p>地狱众生只要苦受不至于神识昏迷，还能有一些思惟能力，他们有宿命通，知道自己前世所造的业行，明理的就能忏悔前世业，从而消除业障，脱离地狱苦。学佛和不学佛造业下地狱的，果报不一样，有福和无福下地狱的，果报不一样。明理越多，出地狱越快。有人到地狱门口，一念华严经中的偈子：若人欲了知，三世一切佛，应观法界性，一切唯心造。知道地狱也是自心所造，就从地狱里出来，地狱相在他的心中消失了，所以懂法明理非常好。证得五阴虚妄这个理，三缚结就断，三恶道的业消灭了。没有我，怎么还有三恶道呢？怎么还有三恶道业呢？全部是虚妄，这样消业非常快。</p><p>大涅槃经中，世尊给阿闍世王消业时，告诉他什么叫作父亲，父亲的五阴不是父亲，单独一个阴不是父亲，和合起来也不是父亲，没有父亲这个法，没有父亲这个人，也没有阿闍世王这个人，杀父业也虚妄不实。阿闍世王听了这个理，虽然没有证罗汉果，但是地狱业消了，命终不会下地狱了。</p><p>大乘法的消业同样殊胜，有个勇施菩萨犯重悟无生的故事。勇施比丘到一个女施主家乞食，女人看中他，想与他行非法，就在饭里下迷幻药让他吃，他吃了以后，不能自我控制，就行了非法，从此两人就有了来往。女人丈夫知道后很生气，比丘告诉女人毒死他，结果丈夫被毒死了。勇施知道后非常懊悔，知道自己犯了两个大罪，非下地狱不可，失心发狂，就去找文殊菩萨，文殊菩萨说，还是找世尊处理吧。于是世尊问了事情原委，用无生理开导他，为他分析一切事情的虚妄，我人的虚妄，勇施听后，就悟了大乘无生理，开悟成为菩萨了。三恶道业同时就消灭了，不用再下地狱受苦。这等于实相忏悔法，实相法中，无人无我，没有犯者和受害者，没有造业之事。谁是造业人？没有作业者。这些法只要细心思惟，慧眼打开，就会证得无生。</p><p>十、业报能否在定中暂停</p><p>入定时，过去的业种如果正好在这个时候缘熟，果报就要在这个时候实现，这是没有办法的。即使这个人在行善时，恶业缘熟，恶报也要现前，马上就受恶报，善业就无法继续完成。因果之事，谁也违背不了，缘熟必受报。如果恶业的缘不成熟，大的善业也许能让恶业果报后延，也可以让恶业的果报减少减轻。如果恶业已定，那就没有办法，谁也阻止不了。</p><p>十一、如来藏能直接实现众生的业果报，不必经过意根的思心所，因果酬尝不由七识作主；如来藏直接让色身长大衰老，不由七识作主；如来藏直接促使色身生灭变异、改变生存环境和业缘，不由七识作主。众生今世造作的业行，如来藏都会存储起来，包括身口意的每个细节，一丝不留，全部以业种的形式记录存储。后世缘熟，如来藏输出业种，众生就要按照自己的业种生活和受报。</p><p>这些业种都与意根相应，因为意根生生世世存在不灭，一直带着这些业到未来世，直到受报完了，业种消失。而六识是新出生的，不带业种，但是会受意根的熏染而表现出各种习气烦恼。</p><p>十二、业果如梦本是幻，醒来无物何须偿</p><p>众生生生世世造作恶业，果报就是六道轮回，如果业果不能消失，六道轮回就没有止息之日，众生永远不能成佛，可事实却不是这样。为什么在证果以后就断除了三缚结，永远不下三恶道了？在证果之前，还有无数三恶道业种没有现行，业果还没有受，这些业种哪里去了？众生造恶业，佛要求通过忏悔消业，就可以不受恶报了。那这些恶业哪里去了？如果因果一定要实现，那么哪个众生能成佛？</p><p>一切法除了如来藏都是虚幻不实的，都如梦中物一样。梦里的东西醒过来就没有了，在梦里造作的一切行为，醒过来以后都不用再负责任，虚幻的就没有业果，而且醒过来以后不会再造作恶业，不再颠倒了。而在梦里就不一样了，梦里造作业行，就要承受果报。</p><p>断我见证果时是第一次从梦中醒过来，明心又醒过来一次，证得如幻观又醒过来一次，证得阳炎观醒过来一次，证得如梦观醒过来一次，证得每个法都醒过来一次。入初地醒过来一次，入二地醒过来一次，直到成佛时就从梦中完完全全清醒过来，这次是彻底清醒了，从此以后再也不入梦，再也没有梦境了。那么梦里所造作的恶业还存在吗？梦里的人事物，醒过来，还存在吗？都不存在了，消失了，了不可见。在佛心中空荡荡的一片，任何法都不存在，佛还要酬尝什么因果，如何酬尝呢？皮之不存毛将焉附，业果没有所附的人事物理，业果何在？</p><p>佛为众生讲法，就是让我们充分认识到我们都是在做梦，一切法都在梦中，出了梦中，一切法就不存在了，只要醒过来，就什么事也没有，好事恶事都没有。佛法无非是破迷，心中不迷，就是开悟，开悟就没有事了。</p><p>我不是真实的，你不是真实的，事不是真实的，理不是真实的。认识到这些理，证得这些理，还有真实的人事物理吗？没有，还有什么果报吗？没有，果报也是事理，也是虚幻不真实的，醒过来就都消失了。清醒一部分，消失一部分，彻底清醒，一切善恶业果全部消失。证果时，是不是清醒了一小部分？初步证得无我之理，无六根、无六尘、无六识，三恶道以及恶业和业果是不是在六根六尘六识里？肯定在，那就没有其事了，果报就消失了一小部分。</p><p>如果证得法的程度非常深，懂得的理非常深，清醒的程度就非常大，那么就会证得更多的事理都不真实，消失的事理就更多，恶业消除的也就更多了。一旦清醒开悟时，就知道哪里有什么真实的因因果果？哪里有什么真实的我人众生和寿者？哪里有什么善恶业行？证得这些，业种就消失一部分。</p><p>如果像佛那样清醒，如佛那样认识一切法，那么一切恶业业种全部消除，哪里还有一点恶业果报？没有。但佛为了让众生不再造作恶业，也会为了众生而示现有恶业果报，以警觉众生。这是为了救度众生而演戏，佛无量劫度化众生都是在演戏，佛是最好最伟大的演员，是最好的导师，所作一切都是为了唤醒众生迷茫的心，让众生清醒过来。除此佛还有什么个人的一己私利？完全没有，彻底无我。</p><p>十三、动物之间互吃是否有果报</p><p>动物之间互杀互吃，当然都有果报了。因为动物的一切行为造作，各自的如来藏都会存入记录，收存业种，如来藏就是天然的有这个功能作用。那么业种成熟以后就有业报了，所以所有的众生都是受报的载体，个个业障深重，无以自拔。但是动物的杀与人的杀有区别，动物纯属为了活命，没有杀心恶心，人杀涉及到一个心行的问题，所以人的杀业重。受戒以后的杀，还涉及到戒罪，心性上的罪业加上戒上的罪业，业就更重了。</p><p>十四、不昧因果的意思</p><p>昧，是昧略晦暗的意思。不昧就是心里清明，对因果不迷惑。菩萨摩诃萨们对因果都是非常清楚的，因为有唯识种智，清清楚楚知道每个业行造作的同时，种子就会存入如来藏中，缘熟必有果报。没有唯识种智的菩萨和凡夫菩萨就不是很清楚这件事，所以有时候还会抱着侥幸心理，造作一些恶业。菩萨们由于无明没有断尽，身口意行还在因果之中，不能脱离因果法则。</p></div>"
},{
    "title": "第二十三章　如来藏与十二因缘",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十三章　如来藏与十二因缘</strong></p><p>一、佛讲的十二因缘法，其实质各个分支都是依如来藏而有，离如来藏无因缘法。世间人讲的缘起只是知道表面现象，好像是此有故彼有，此法产生彼法。实际是，缘于此法，如来藏产生了彼法，而此法也是如来藏中的法。任何法只要离开如来藏，都不能存在。任何法的生也是如来藏生，只不过需要很多的条件，如来藏才能生彼法。如果离开如来藏，说缘起法，此法能够产生彼法，那根本就不成立。</p><p>比如说，无明缘行，无明不能产生意根的心行，是如来藏产生了意根的心行。因为意根有无明，不知法界实相，不肯安住于寂静的真如当中，起心要向外贪求，如来藏就随顺意根的无明产生出意根的心行，意根内心就产生躁动，想要执取三界法以及五阴身心，想要有身口意行。</p><p>行缘识，由于意根这种躁动不安和向外求取的心行，如来藏就满足意根的思心所，产生六识，让意根利用六识来达成自己的意愿，造作一切身口意行。</p><p>识缘名色，由于意根的心行不断，六识的身口意行不断，如来藏就会自动收藏业种，这样就种下了未来世受生的种子。命终时意根心行不断，求取五阴身，如来藏就会出生中阴身，在中阴身里，意根不满足暂时的色身，还要有下一世的五阴身，当父母缘具足时，如来藏随着意根投胎，名色就产生了。</p><p>名色缘六入，名色受精卵形成以后，如来藏随顺意根对五阴身之想，根据业种和业缘不断变造色身，在色身上生长出眼根、耳根、鼻根、舌根，身根也不断的增长和完善，五根就被如来藏创造出来了，加之意根，六入具足。</p><p>六入缘触，六入的缘具足以后，因为意根想要见六尘，如来藏就通过五根传递外六尘到五胜义根中，六根就会接触到六尘，这个触也是如来藏产生的。</p><p>触缘受，六根能够触六尘时，意根想了别六尘，如来藏就会出生耳识、鼻识、舌识、身识和意识共同了别六尘境（在母胎中，还不能出生眼识见色）。于是六识就对六尘有了觉受，苦乐不苦不乐三种受都有，意根在其中也有自己的受，这些受也是如来藏出生的。</p><p>受缘爱，因为有六识的三种受，意根依六识的受而有自己的受，自己接触尘境时也有受，或者是贪爱的乐受，或者是厌弃的苦受，或者是舍受。因为这些受，就会产生贪爱，尤其是意根的贪爱，如来藏依之能产生后续的一切身口意行，产生更多的法。六个识的受以及意根的受，都是如来藏输出识种子产生的，六识的爱也是如来藏输出识种子产生的，尤其是意根的贪爱，是如来藏缘于意根的受而出生的。</p><p>爱缘取，因为意根有贪爱，就会产生执取性，对三界六尘万法想要占有和执取。这种执取性也是如来藏输出识种子产生的，离开如来藏就没有意根，何况还有意根的受、爱和执取性。</p><p>取缘有，由于意根对三界万法的执取，如来藏随顺意根心行而不断的产生三界世间一切法。有缘生，三界世间法产生以后，五阴身的生存环境就具足了，这样如来藏就会出生五阴身。</p><p>生缘老死忧悲苦恼，因为五阴身是生灭幻化性的，出生以后，如来藏执持，不断输出四大种子，让色身不断生长，慢慢变老，最后死去。在这其中，会有无量的生死苦，忧悲苦恼无尽。这些生老病死苦，也都是如来藏依缘出生的，根源还是意根的执取性，以及意根的贪爱，灭除意根的贪爱才能灭除一切苦受。</p><p>从以上十二因缘来看，三界世间一切法都是因为意根的贪爱和执取，如来藏随顺意根和业种，就产生了五阴世间一切法，生死苦乐都是如来藏出生的，离开如来藏没有法，离开意根的执取如来藏也不会出生法，因此在一切法当中都有意根和如来藏的现行运作，一切法都离不开意根和如来藏。</p><p>二、世尊在小乘解脱道修证的经典阿含经当中讲的十二因缘法，是声闻缘觉所修的法，不涉及大乘如来藏法的修行，不是直接成佛之法，因此不能当成究竟之法。学佛人不要以为佛法就是讲一切法空，一切空法当中还有不空的法存在，那就是不生不灭的真心如来藏，没有如来藏，万法都无从缘起。声闻缘觉修完十二因缘法，就会证得缘起性空，知道五阴世间一切法都是因缘所生，依赖如来藏这个因以及意根的无明和业种等等为缘，就有一切法的生起。</p><p>既然万法是依赖各种缘，并且是如来藏所生出来的，那么万法就不是真实的，是空的，是幻化的假相，证得幻化相空相二乘人就能得解脱，出离生死轮回苦。但是他们还没有修证大乘法，不懂如来藏的成佛之法，三乘佛法只修证了二乘，最上乘法还不懂，就出离三界了。他们还有无始无明和尘沙无明都没有破除，更没有断尽，无明习气，烦恼随眠都没有断除，因此他们还与佛相去甚远。</p><p>那么佛陀成道时所悟的就不可能是缘起性空的二乘法，一定是最上乘的如来藏法。佛陀夜睹明星时眼见佛性，就是见得真实的佛性，是佛地的见性法，然后大圆镜智现前，四智圆明，才能成佛。非是世人所错会的缘起性空这样浅显的二乘法，本质相去甚远。</p><p>如果佛陀只悟得个缘起性空二乘法，佛陀就不能教导众生大乘的真实如来藏成佛之法，那么佛法就是不完善的，就会有极大的缺憾，众生就不能得到真正的最大的究竟的利益。现在众生误会佛法太严重，知见也太浅薄，都是把缘起性空当作佛法的中心和重点，不能与万法的根源相联系，不知万法的来源，不知世界的本源，这正是如今佛法的流弊。</p><p>三、缘起性空是说，一切法是以如来藏为因，无明业种为缘，因与缘和合，如来藏就把一切法产生出来了。</p><p>一切法包括三界世间的五阴十八界法，也就是众生世间。具体包括：五阴：色阴、受阴、想阴、行阴、识阴；六根：眼根、耳根、鼻根、舌根、身根、意根；六尘：色尘、声尘、香尘、味尘、触尘、法尘；六识：眼识、耳识、鼻识、舌识、身识、意识。众生生存的整个世界都包括在其中了，这些法都是如来藏依靠各种业缘而产生出来的，缘尽就灭去，没有真实性，是如来藏幻化出来的，空幻的，本质都是如来藏性。</p><p>因此众生的五阴十八界世间就不是真实的，是空的，是生灭的，是苦的，是无我的。那么众生明此理，就不再贪爱自己的五阴十八界世间法，就能断除生死轮回苦，就不会被束缚在生死苦海当中了。</p><p>十二因缘：无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死忧悲苦恼。这是一个生死链条，破尽无明，生死链条就断，就没有生死苦受了。</p><p>四、一切法的因，就是如来藏，缘，是产生某种法的所有条件。世尊说：有因有缘世间集，有因有缘世间灭。外道的因缘观，里面的因，不是指如来藏，其因缘两字和起来，都是指条件。所以佛在楞严经里就否定了一切法是因缘生的，而说都是如来藏性。一切法的直接出生者，就是如来藏，都来自于如来藏，是如来藏输送的四大种子或者是七大种子直接产生出来的一切法。</p><p>就像十二因缘法，是十二个链条，实际上不是前一个法出生了后一个法，而是所有的法都是如来藏出生，没有别的法能出生一切法。所以如果离开如来藏而讲十二因缘法，那就是外道。辟支佛们都没有离开如来藏而证得十二因缘法，他们逆推因缘法的时候，就推出了如来藏（阿赖耶识）是生命的源头。</p><p>世尊在楞严经第三卷中就讲一切法“本非因缘，非自然性”，意思是说世间一切万法，不是由各种缘生出来的，不是自然而然就存在的，而是从如来藏当中产生出来的，本来就是如来藏性，都是如来藏的作用所生成的。那么在一切万法上就都能见到自己的佛性，也就是如来藏性。如来藏是一张严密的大网，把万法全部都网在里面，一切法全部都是祂的子民。“本非因缘，非自然性。”那句话后面省略了本如来藏性，因此很多人很难懂这句话的真实义。</p><p>五、十二因缘法：无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老病死忧悲苦恼。众生因为意根有无明，每日里总想造作业行，身行不断，口行不断，意行不断，不肯让自己的行为造作止息下来，究其根本，就是内心深处的无明。阿罗汉辟支佛因为断了一念无明的缘故，知道万法虚妄，自我五阴不真实，所以就不愿意再造作世间任何事，觉得身口意一切业行无意义，内心就与空相应，发起了空、无相、无愿三昧。</p><p>因为他们的身口意行减少，内心寂止，六识少于现起，少于分别。意根断掉对自我的执著，那么三界生死的种子就断，未来世就不再在三界出生，这样就能够出离三界生死轮回，了生脱死，解脱生死苦恼。</p><p>而众生因为无明不断，认为五阴实有，外界六尘境界实有，不断地贪执六尘万法，就想要不断的造作，业行就不断。因为身口意业行不断造作的缘故，六识就会不断地现起，与五根意根配合造作，起识别了别的作用，这样六识心就不能停歇，心不得寂止，所造作的身口意行的种子就不断地存入如来藏里，创造了未来世受生的因缘条件。在临终时如果意根还要想有未来世的业行，还想有五蕴身，就会入胎，如来藏就出生名色。</p><p>这样名色就产生了，下一世的五阴就会出现，生老病死苦的轮回又开始了。因为有名色这个受精卵，就会产生眼根、耳根、鼻根、舌根、身根五根，加上原来就有的意根，这样六入就具足，六尘的受纳器就完备了，将来就能接触六尘。</p><p>因为有六入这些受纳器，必然与六尘相接触，触就产生了，六入就起这个作用的。因为六入触了六尘，如来藏就产生六识来了别六尘法，了别以后就知，知了内心就有感受，会感受苦、乐、不苦不乐。因为内心有感受，六识就贪着这些感受，喜爱六尘境界，贪爱就不断现起，意根依之也起贪。因为有贪爱，意根为了感受不断，就会不断地执取五阴自我，执取六尘境界，希望五阴不断现行运转，希望六尘永远存在。</p><p>因为意根执取抓取自我，执取六尘境界，六尘就不断现起，三界的生存条件具足，三界的有就不断绝。因为三界的生存条件具足，三界的有不断，众生就会在三界不断地出生，五阴不断地出生，生命活动就不断，那么老病死无量的忧悲苦恼，无量的大苦就聚集起来了，众生就会在无量忧悲苦恼中生死轮回不断。</p><p>其根源，就是众生意根的无明，对三界万法的贪爱不断，对五阴的贪爱不断。断贪爱，就断意根的执取，意根不执取，五阴的种子就不具足，三界的生存条件就不具足，那么五阴就不会再产生出来，也就没有生老病死的忧悲苦恼了，众生就解脱了生死苦。</p><p>因为意根灭掉了贪爱和执著，如来藏就不存贪爱的种子，不存储身口意行的种子，不存一念无明的种子，如来藏就不会产生七个识的无明。意根的一念无明断，不想再造作三界法，三界业行就断；业行断，六识就不出生；六识不出生，意根也灭，名色就灭；名色灭，六入就灭；六入灭，触就灭；触灭，受就灭；受灭，爱就灭；爱灭，取就灭；取灭，有就灭；有灭，生就灭；生灭，老病死忧悲苦恼就灭。</p><p>所谓的断，就是如来藏因为没有业种收存，就不会产生各个有支，生死的链条就断，每个链条都是如来藏产生，没有种子，如来藏就没有条件产生这些链条，那么生死就结束，众生就解脱。但是这种解脱还不是究竟彻底的，必须修到佛地，才是究竟彻底的大解脱。</p><p>十二因缘里的无明是意根的无明，触是意根的触，受是意根的受，爱是意根的爱，取是意根的执取，然后就有三界法，就有生老病死忧悲苦脑。因为意根有这些心行，如来藏随顺，就出生后续的法。灭意根的无明，就没有后续的法出现，生老病死的问题也就解决了。</p><p>六、楞伽经中世尊所讲的十二因缘法</p><p>原文：<strong>尔时大慧菩萨摩诃萨。复问世尊说。世尊。外道亦说因缘。谓胜自在时微尘生。如是诸性生。然世尊所谓因缘生诸性言说。有间悉檀。无间悉檀。世尊。外道亦说有无有生。世尊亦说无有生。生已灭。</strong></p><p>释：大慧菩萨请问世尊说：世尊，外道也说一切法都是因缘生，是什么所生呢？他们认为是有个胜自在天所生，好像是大梵天王、上帝或者什么神灵所生，或者认为是虚空中的微尘、某种能量所生，后期还有说是老母娘所生，种种说法不一。然而世尊所说的因缘生诸法的言论，属于世间有和世间无的范畴。世尊，外道们也说世间有世间无，世尊也说一切法都没有生，生了还会灭去。</p><p>这里的因缘生，主要是指众生的五阴身是由于因缘所出生的，有了五阴身，就有了世间的一切法，包括外世间法和内世间法。外道们的说法，不是落在有边，就是落在无边，属于常见和断见论，都不是正确的。而世尊说的无有，是空无自性，生了然后又灭，并不真实，好像是幻化的一样。</p><p>原文：<strong>如世尊所说。无明缘行。乃至老死。此是世尊无因说。非有因说。世尊建立作如是说。此有故彼有。非建立渐生。观外道说胜。非如来也。</strong></p><p>释：大慧菩萨又说，就像世尊您所说的，无明缘行，乃至老死，这十二因缘法，世尊您这样说时，还没有说出老死的根本因，没有说十二因缘法的根本因，那个因您在这里还没有说出来，只谈世间这些个假相，还没有涉及到真相，不涉及这些法出生的根本因。因此世尊才建立一个说法：此有故彼有，没有指出这些法是逐渐地被自心所生的。看那些外道们说的生的因是某种神灵，这些说法并不是世尊您说的，也不符合世尊您所说。</p><p>原文：<strong>所以者何。世尊。外道说因。不从缘生。而有所生。世尊说。观因有事。观事有因。如是因缘杂乱。如是展转无穷。</strong></p><p>释：大慧菩萨说，为什么外道说的不符合您说的呢？世尊，外道说五阴出生的因，不包括出生的各种缘，没有任何的缘，如种子业种业缘等等，上帝或者神灵就出生了五阴。而世尊您说，看见一个因出生，就知道一定有事情要发生，看见事物的发生，就知道一定有因，这样又因又缘，发展下去就是无穷无尽的，这样不是很杂乱吗？</p><p>原文：<strong>佛告大慧。我非无因说。及因缘杂乱说。此有故彼有者。摄所摄非性。觉自心现量。</strong></p><p>释：世尊告诉大慧菩萨，我不是无因，没有涉及因而说因缘法的，也不是把因缘法杂乱地说。我所说的因缘法，能产生下一法的因和所产生的法，都没有自体性，都不是真实的法。比如无明缘行，无明出生身口意行，有无明就有身口意行，这是假法，并不真实，真实出生身口意行的是有另外的真正的因，不是无明。</p><p>又比如行缘识，有业行就有六识的出生，这也是假法，并不真实，出生六识的因有另外真实的法。又比如识缘名色，有六识就有名色的出生，这是假法，出生名色的因，不是六识，而是有另外的真正的因。十二因缘都是这样的假法，不是真实，真实的因不是这些，不在因缘里。应该知道一切法出生存在，都是自心所呈现出来的，都是自心现量。自心就是一切因缘法出生的根本因，那就是如来藏。</p><p>原文：<strong>大慧。若摄所摄计著。不觉自心现量。外境界性非性。彼有如是过。非我说缘起。</strong></p><p>释：世尊说，大慧，如果执著于十二因缘法中，能出生下一法以及所生的下一法是真实的，不是自心所产生所变现的，那就有无穷的过错。自心之外的一切法都没有自体性，不会相互辗转而生，此法不能出生彼法，无明不能生身口意行，行不能生六识，六识不能生名色，名色不能生六根，六根不能生触，触不能生受，受不能生爱，爱不能生取，取不能生三界的有，有不能生五阴生命体，五阴不能生出老死忧悲苦恼。真实的法是，这些因缘法都是自心所生，所呈现，所变现。外道们所说的因缘法，有很多过错，不是我所说的因缘法。</p><p>原文：<strong>我常说言。因缘和合而生诸法。非无因生。</strong></p><p>释：我常常说，因缘和合才能出生一切法，有因又有缘，因是自心如来藏，缘有很多。比如无明的缘，有业缘、父母缘等等，因缘和合在一起，才能出生各种因缘法，不是无因只有缘就能出生的的。只有无明，没有自心如来藏，就不会有众生的身口意行；没有如来藏，只有身口意行，就不会有六识出现的；没有如来藏，只有六识，就不会有名色出生的。</p><p>没有如来藏，只有名色，就不会有六入出生；没有如来藏，只有六入，就不会有触；没有如来藏，只有触，就不会有受；没有如来藏，只有受，就不会有爱产生；没有如来藏，只有爱，就不会产生取；没有如来藏，只有取，就不会产生三界有；没有如来藏，只有三界有，就不会有生命体出生；没有如来藏，只有生命体五阴，就不会有老死忧悲苦恼。</p><p>七、十二因缘的实质是什么</p><p>十二因缘中的每一个链条都是无生的虚妄的，都不是真实的，都是依着如来藏才能够存在的，表面上虽然有生，相虽然有，实质是无。但是在这背后，确实有一个真实法存在，否则不会有十二因缘这些虚妄法。这个真不管我们执与不执，认可不认可，祂都是真实存在着的，你执祂，祂也在，你不执祂，祂还是在，祂跟我们执不执都没有关系，跟我们贪不贪祂、认不认祂都没有关系，看不见祂，找不到祂，祂仍然存在，仍然起着本然的功用。</p><p>所以我们学佛应该把真和妄，这两个体性分开，彻彻底底的分开，才能识得事物的本质。不要混在一起谈，混在一起谈，就会真也不识，妄也不识，把真当妄，把妄当真，这些相混着不分，生死大事就不会解决。众生之所以不能证道，根本就是真法与妄法没有分开，二者的体性没有了解清楚，知见错，智慧就不开。</p><p>十二因缘里，“名色缘六入”，意思是因为有名色，才有六根，才有六入。为什么有名色就有六入呢？六入是名色生出来的吗？这六入、六根表色名色生出来的，名色本身也是被出生的法，是不自在的法，不能出生其他法。六入也不是从天上掉下来的，不是自然而然生长出来的，六入之所以出现在名色上、受精卵上，是名色的一部分，是如来藏变造名色的同时变造出了六入。名色是如来藏出生六入的缘，这样，前一个链条是缘，能够引生下一个链条，下一个链条是如来藏所生，借着前一个链条的缘。因此这个链条的实质是如来藏出生了名色和六入。</p><p>“六入缘触”，意思是因为有了六入，就有了触。但触不是六入出生的，六入不能出生其他法，不能主动去触什么法。六入是缘，如来藏以这个缘才能产生触，让六入触六尘境界。</p><p>触缘受，因为有了触，六根触了六尘，就有了感受。但感受不是触产生出来的，是如来藏让六根触了六尘，生了六识，六识就有了感受。六根也不能出生感受，六根中的前五根也不能有感受；六尘不能出生感受，六尘也不能有感受；触，不能出生感受，也不能有感受。感受根本就不是从触中来的，因为触本身不是实体，是虚妄体，不能产生受。必需有一个不生灭的法，有种子的如来藏，才能出生其他法，所以这个受，还是从如来藏中来。</p><p>后面所有的链条都是如此，那么总结起来说十二因缘的十二个链条，每一个链条都来自于如来藏，都从如来藏而出生，一个链条是下一个链条的缘，因就是如来藏，所以十二因缘，十二个链条都是缘，其中都有出生万法的因如来藏。最后佛总结出来一句话叫作：“识缘名色，名色缘识”。这个识就是指阿赖耶识，阿赖耶识依赖着名色才能显现和运作，名色依赖着阿赖耶识才能出生和存在。阿赖耶识能够缘（就是产生、引发）名色、色身、五蕴，名色是因为这个阿赖耶识（如来藏）而产生。</p><p>八、逆推十二因缘</p><p>为什么有老死？因为有生命。为什么有生命？因为有三界五蕴世间的缘。为什么有三界五蕴世间？因为意根执取三界五蕴世间。为什么意根有执取性？因为意根有贪爱。意根为什么有贪爱？因为六识对六尘的受，意根对三界世间法也有受。七识为什么有受？因为六根触六尘。为什么有触？因为有六根。为什么有六根？因为有名色色身。为什么有名色色身？因为有阿赖耶识如来藏。（十因缘）</p><p>为什么有名色色身？因为有业种，就要出生五阴果报身。为什么有业种？因为六识不断造作身口意行。为什么六识不断造作身口意行？因为意根有心行，想要求取万法。意根为什么有求取万法的心行？因为意根有一念无明，促使如来藏出生六识，才不断造作业行。（十二因缘）</p><p>九、现代制造的机器都是自动化的流程，甚至有的都看不到人工操作，这些机器不停地运转着，一个程序一个程序地运转。这些运转都是因缘法，背后有一定的因缘让机器运转，机器不会无缘无故就能运转的。机器运转的缘有很多，各个缘都不同，缘不同，运转规律就不同，加工出来的产品就不同。但机器运转的因是什么呢？机器自己就能自动运转吗？</p><p>又比如家里的洗衣机，在搅动水里衣物，不停地转，这是个洗衣服的自动流程。这个流程是怎么发生的？洗衣机自己就会转吗？没有人工在操作着，洗衣机就是一堆废铁，它什么也不能做。是人来按那个按钮，洗衣机才能运转。而且洗衣机都是人工设计的自动化流程，人工给电，洗衣机才能工作。一个流程又一个流程地运转，这是自然而有的吗？在机器运转中我们能看到什么呢？                                       </p><p>如果一个不懂世事的孩子，他就不知道机器是人来操作的，因为孩子没有分析能力，看到大人不在机器旁边，机器自己在动，就认为机器之间就能动。如果一个已经懂了世事的人，即使看不见有人在操作这个机器，也知道机器正在被人操作着。洗衣机比喻为我们的五阴身，五阴的运转好比是流程，这个流程不是无缘无故就有的，不是无因就有的，有缘更有因，五阴运转的因是什么呢？</p><p>五阴既然不是真实的有，还能运转，这不是很奇怪吗？应该发问：为什么假的虚幻的法还能有作用？究竟为什么？把五阴当作自然而有的，就不会生起疑情，不起疑，就不会去探讨，那就不会知道事实真相。我们看一切事情不能只看表面现象，现象背后隐藏着多少秘密，我们都不知道。一切事物的本质是什么？是表面所呈现的那样吗？智者应该去探讨，应该努力了解事实真相，揭穿里面的奥秘。</p><p>五阴身运转的流程背后，如果没有真实的东西，五阴身还会运转吗？还能有流程吗？色身五阴灭了以后还有什么？身体火化了以后还有什么？阿罗汉涅槃了以后还有什么？如果认为什么也没有了，这就是断灭见，是外道的断灭论，不是佛法。如果认为五阴灭了，还有灵知心不灭，这个灵知心能知道一切事，能到未来世去，这就是外道的常见。不是长久存在非要说是能长久存在，就是常见，不是佛法。</p><p>十、是心先生还是法先生，是心先灭还是法先灭</p><p>心生种种法生，心灭种种法灭。法包括色法和心法，色法是由地水火风四大种子所构成，包括众生的色身身根和宇宙器世间，色法有色声香味触法的尘相，是能被识心所了别的相分；心法就是七个识心的了别作用，是见分，由识种子流注所生成。</p><p>我们首先观察色身是如何出生的，出生的条件是什么。在十二因缘法里，佛讲了无明缘行，意根有无明的存在，心行就不断；行缘识，意根的心行不断，就要造作业行，于是六识不断的出生；识缘名色，六识不断出生，众生的身口意行就不断产生，业种就不断存入如来藏中。如来藏把业种输送出来，就会有后世的五阴果报身。中阴身里意根要入胎，与如来藏一起投胎，如来藏就产生受精卵，受精卵是色，意根是名，这样名和色就合成了一个最初的生命体；名色缘六入，受精卵成长以后，就会出生五根，这样六根具足，就是六入；六入缘触，六根就会与六尘相接触；触缘受，触之后，六识出生，就产生了七识心的感受。</p><p>受缘爱，有了觉受，七识心就生起了对六尘境界的贪爱；爱缘取，因为贪爱，意根就想抓取执取六尘；取缘有，因为意根执取六尘，就促使未来世的生存条件具足，三界的有就会产生；有缘生，因为具足了三界法，生命体就会在三界里出生，名色就这样出生了。其中名包括了七个识和受阴想阴行阴识阴，色是色阴，五阴就这样出生了。这就说明意根攀缘不断，六识的分别就不断，生命体就不断出生，从这一点来讲，妄心不断出生，色法就不断出生。还有一个问题就是，只有妄心，色法能出生吗？不能出生，因为七识生灭断续，没有自性，不能收存业种，因此不能出生色法五阴。</p><p>缘觉法还有一个十因缘法，说明色法的究竟来源是什么。缘觉人逆推十二因缘时思惟：什么有故，生命体出生，于是就推出有三界法，生命体就会出生。又思惟什么有故，有三界法，于是推出由于执取故，就会产生三界的有法。取包括意根的四个取，欲取就是对境界的贪爱，想要知境界；见取就是执取五受阴为我；我语取就是以我为尊为重，我慢炽盛；戒禁取就是执取不如理不能得解脱的戒为正解脱戒。</p><p>缘觉辟支佛又思惟什么有故取有，于是推出爱有故，贪爱境界故有执取心行。又思惟什么有故爱有，于是推出受有故爱有，有苦乐不苦不乐受故，就有贪爱。又思惟什么有故受有，于是推出触有故，六根触六尘故有受。又思惟什么有故触有，于是推出六入有故触有。又思惟什么有故六入有，于是推出名色有故有六入。</p><p>又思惟什么有故名色有，思惟名色受精卵是如何出生成长的。他们就思惟推证，因为无明不断，意根攀缘执取自己，就会在中阴身入胎，于是就住着在受精卵中。但是只有意根能入胎、住胎吗？当然也不能，因为胚胎也是由地水火风四大种子构成的，意根里有四大种子吗？没有，是如来藏有四大种子，能形成物质胚胎，没有如来藏阿赖耶识，意根不能入胎也不能住胎，不能变生胚胎，是如来藏输出四大种子成长了胚胎。意根没有这个功能作用，是如来藏输出种子形成了胚胎的头、四肢等等身根，是如来藏有六识心的种子，出生了六识心，让胎儿有分别觉知性。</p><p>他们推到这里，就知道了名色是由如来藏阿赖耶识出生的，依阿赖耶识才能有名色，阿赖耶识依靠名色才能显现出自己的功能作用。这就是名色缘识，识缘名色的真实义，这也是十因缘法的内涵，也是逆推十二因缘法的结果。那么如来藏是如何出生的呢？如来藏没有生，法尔如是，本自存在，没有能出生祂的法。所以缘觉人推来推去，推到如来藏就推不过去，推到头了。他们就明白，是如来藏产生了五阴名色。这就是识缘名色，名色缘识的因缘法。</p><p>宇宙器世间这些色法，也是由地水火风四大种子构成，这些种子都存在如来藏里，所有众生的业缘成熟时，所有众生的如来藏都输出四大种子，共同变现宇宙器世间，众生才能出生。那么众生出生以后，生活中所需要的物质五尘是如何产生出来的呢？这就涉及到百法明门了。百法明门中讲，色法是由八识心王和八个识的心所有法和合运作产生出来的。八识心王包括八个心，心所有法包括五遍行、五别境、十一善法、六根本烦恼、二十随烦恼、四个不一定是善是恶的法。色法包括眼耳鼻舌身、色声香味触、法处所摄色，总共十一个。</p><p>那么心法七个识是如何产生出来的呢？首先意根无始劫以来就存在着，没有断灭过，是如来藏为祂输送识种子，执持着意根的存在和运作，没有如来藏就没有意根的存在。意根把生生世世所熏习的烦恼一直带到现在世以及未来世，所以意根所含藏的无明极其深重，烦恼染污极重。修到四果时，才能断除意根的执著，才能把对三界的执著灭除，才有能力灭除五阴世间一切法，入无余涅槃。所以意根是能灭掉的，祂是无常虚妄的，不是真实不变的我。</p><p>意根也是识心，识种子存在如来藏里，如来藏输出意根的识种子，意根就现行起作用。而六识是后天出生的，在每生每世的色身上都是如来藏新生出来的，如来藏输出六识的种子，六识才能现行起分别的作用。因为六识是后生的，所受的熏染轻微，容易断除。六识一方面受境界熏染，一方面受意根的熏染，遇善则善，遇恶则恶，容易随境界转。所以六识通过修行容易转变，转变过来以后，再影响熏习意根，让意根也转变，修行就成功。</p><p>回到问题开始，是心先灭，还是法先灭？是心先生，还是法先生？从以上分析来看，一切法由如来藏出生，而如来藏又不生，七个识心由如来藏输送识种出生，八个识心王再与八个识心的心所有法和合，产生色法。那么问题已经很明了了，没有八个识心就没有色法，没有境界法，是心生种种法才生。</p><p>那么灭，是谁先灭呢？如来藏不灭，境界不能先灭。如果境界先灭，六识就不能存在，不能有分别作用了，即使存在也没有意义。为什么六识不能存在呢？因为六识的产生是六根触六尘以后，如来藏才能生六识，没有境界，就没有触，没有触就没有六识的出生。境界如何才能灭掉呢？那要看境界是如何出生的，境界的产生，虽然由如来藏所生，但是如来藏不会主动出生境界，是意根由于无明心动，如来藏配合才能产生境界相，如果意根心不动，如来藏就不会产生境界。当意根灭尽对三界境界的贪爱执著，不想有任何境界，如来藏就不再产生境界相，就入无余涅槃。</p><p>所以不是先灭法后灭心，而是先灭心后灭法。这个心就是意根，意根的执取心灭，三界世间法必灭。比如昨天与人吵架，现在心里还在想着，并且心里难过，吵架的事已经过去了，为什么心里还有这个事呢？就是心没有灭；如果心灭了，不在意吵架的事，就不会想这个事了；或者修行到没有心起烦恼时，在吵架的当时，心里就不在意，也就不能吵架了，没有吵架的境界产生，没有心不生境界。</p><p>从意根的角度来说，如果修行到意根的攀缘性灭了，不攀缘六尘，六识就不了别境界法，那就处于没有心的状态。眼见色，就像没看见一样，耳听声就像没有听见一样，境界好像不存在，也不能起什么作用了。如果意根灭掉了，六根六尘六识都灭掉了，境界也就没有了，所以说心灭种种法灭。</p><p>总括起来说，心生种种法生，心灭种种法灭，修行就是修心，心改变一切都改变。</p><p>十一、识缘名色，名色缘识的真实义</p><p>五阴七识必须依赖如来藏才能出生，才能有五阴身的各种活动，这是名色缘识的意思。如来藏必须依赖五阴十八界才能显现其各种功能作用，没有五阴十八界，如来藏就无需再运行，所有的功能作用都不能显现出来了。所以佛说识缘名色，名色缘识。七识也要在五阴色身上运行，才能显示出七识的功能作用。没有色身就没有五识，色身加七识，就等于五阴身。</p><p>十二、如来藏的所缘</p><p>佛讲因缘法时说：名色缘识，识缘名色。这个识就是如来藏阿赖耶识，名色就是五蕴：色蕴、受蕴、想蕴、行蕴、识蕴，如来藏缘名色，自己的作用才能显现出来，才能有所利用。如果没有名色，如来藏就没有办法显现出来，其功德性也发挥不出来。名色必须缘于如来藏才能出生和存在，没有如来藏就不会出生名色。名色和如来藏互相依赖而存在，虽然如来藏可以独自存在，不依名色而有，但是要起作用，就得依赖名色才能起作用，二者犹如束芦互相依靠。</p><p>如来藏也缘业种，根据众生的业种，变现众生的正报身和依报的生存环境，以及各种果报。如来藏也缘自身里本有的四大种子，变现众生的五蕴十八界，宇宙器世间。如来藏也缘七识心，了别七识心的心行，输送识种，配合七识心的运作。</p></div>"
},{
    "title": "第二十四章　如来藏与净土",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十四章　如来藏与净土</strong></p><p>一、问：娑婆世界之外的世界，是否没有我们的如来藏在参与执持？</p><p>答：与我们暂时无缘的世界，我们的如来藏不能参与变现和执持，一是没有那个业种，二是即使有业种，业种现行出来的缘还不成熟，如来藏就不能在那里参与运作。但也不是说，其它所有的世界，我们的如来藏都不参与运作，当业种成熟时，如来藏了知，就要依照业种参与那个世界的变现和执持那个世界，我们在这边命终的时候，才能出生到那个世界去。</p><p>比如有人造了地狱业，种子已经收存了，当地狱的业缘成熟时，如来藏就参与变现地狱，此人在人间的业缘一结束，马上就生到地狱里去，不用如来藏到此人临终时再变造地狱境界。与我们有缘的世界，在我们投生过去之前，如来藏就参与了变现，否则我们就没有条件和资格到那个世界去生存。</p><p>比如去极乐世界，因为存了善业种，业种缘熟，如来藏就要在那里变造莲花宫殿，极乐世界的缘具足时，我们马上就能坐在莲花当中，生到极乐世界。这就说明我们的如来藏是先知先觉的，祂知的就是业种，了知业种情况以后，祂才能先到极乐世界参与变现，然后我们命终才能出生到那里。如果如来藏不参与变现，我们就不能生到极乐世界。与极乐世界的缘还不具足时，如来藏不参与变现，我们暂时就不能去极乐世界。</p><p>要想极乐世界的业缘早日具足，意根就要深信切愿，一心向往极乐世界。意根要有意愿，只有意识心浮浅的发愿还不行，因为去不去极乐世界这件事是由意根作主决定的。如来藏主要是了别意根的心行，意根想去时，是从内心深处想去的，如来藏了别到意根的思心所，就要去极乐世界变造莲花宫殿。念佛也是要深入意根，不是口里念念就行了，意根没有念佛的心行，就不与阿弥陀佛和极乐世界相应。极大多数人念佛，都是口念心不念，内心不是念兹在兹，都是心猿意马，心不在焉。这样念佛，只是结个法缘而已，根本去不了极乐世界。</p><p>二、去极乐世界不是肉身坐在莲花上去的</p><p>念佛往生是坐在莲花上往生的，但肉身坐不上去，是中阴身作莲花往生的。这个莲花是自己的如来藏随顺意根变造出来的，由微细四大组成。念佛人对极乐世界一心向往，心得清净以后，发愿要往生，如来藏就根据意根的意愿，在极乐世界的莲花池中建造出属于自己所有，符合自己修行品位的莲花台。这个莲花台是四大组成的极微细物质，我们的实质粗重的肉身坐不上去，实质的肉身接触不到微细的莲花台色法。</p><p>临终往生时是中阴身坐在莲花上往生到极乐世界的，因为中阴身也不是实质的粗重的物质肉身，正好与莲花台相应，所以中阴身就能坐到莲花里。坐上莲花以后，在阿弥陀佛和诸大菩萨的加持下，莲花台与中阴身一弹指间就到了极乐世界，中阴身转换成极乐世界的天人色身，被莲花叶包裹起来，色身就住在自己如来藏所变现出来的莲花宫殿里。为什么中阴身这么快就到了极乐世界？因为极乐世界也是自心如来藏中的一个法，如来藏不用到自心中的任何一个处所，意根随着如来藏也就不用经过无限远的距离，因而弹指就能到如来藏里的极乐世界，其实速度比弹指还要快。说个速度，就已经很慢了，如来藏在自心里根本没有时间和距离，因此没有速度。</p><p>中阴身到极乐世界立即就消失，换成极乐世界众生的美好庄严的色身，没有男女相，是中性的天人身，在极乐世界里永远年轻庄严，永远不老不死不病不苦。因为中阴身是非常微细的物质色身，能够瞬间飘到极乐世界。我们的肉身不行，肉身是极粗重的物质，无法飘动，几米高的空中都上不去，何况是遥远的极乐世界。这正是有肉身的人类没有神通的原因，而鬼神和天人、非人，他们的色身是微细的物质组成的，就有神通，能飘动，能飞翔，转眼就能到其它世界。</p><p>三、三界唯心，万法唯识，秽土和净土都是唯心所现，唯识所变，转心就能转境界，但是只能转自己的境界，不能转他人的境界。境界是每个人自己如来藏心内的相，与他人无关，自己修行把心转变清净时，所见的内相分境界就转变，当然所感召到的外相分也能清净了，识心转变时一切境界也就随之转变了。</p><p>维摩诘经中说，我们娑婆世界是五浊恶世，到处是丘陵坑坎，肮脏污秽，舍利弗怀疑是世尊在行菩萨道时，心不清净所致。而世尊说：是你们自己心不清净，才感召了不净的世界国土，非是我心不清净，在我看来娑婆世界是极其清净的。世尊说的是如实语，在世尊看来，娑婆世界确实与极乐世界一样清净无染，众生因为内心有染污，所见的世界就不清净，佛心清净，所见一切皆清净，都是佛的无垢识性。世尊为了证明此理，就用脚趾按地，于是世尊海印发光，顿时娑婆世界就变成与极乐世界一样的庄严清净，殊胜无比，这就是佛所见的世界，佛心所变现的世界。</p><p>世尊同样与众生居住生活在一起，所见的境界却与众生不同，正报和依报都不同，虽然外表示现与众生一样，其实众生与佛相隔极其悬远，心不清净之缘故。所以我们修行要把心修得再清净一些时，对外界事物的感知就能相对准确一些，所现的境界就改变了，那是因为内心的思想境界发生变化了。众生由于无明，知见颠倒，对世间有错误的认知，身口意行就不清净，就要感召到不清净的境界。修行到心清净了以后，境界环境就能随心而转，所见一切皆为净土，那就是自己如来藏所变现的。</p><p>五、极乐世界是否真实有</p><p>极乐世界是唯心净土，是心所现，那么极乐世界就不是真实存在的，这个不真实存在是否等于说根本就没有极乐世界？极乐世界在现象界上是有，属于世俗上的有，虽然世俗上的有也是空幻的。佛在阿弥陀经中描述了极乐世界的殊胜和庄严，证明极乐世界是存在的，不是想象的。但是极乐世界也是唯心所变，是一真法界里的一个佛国土，也是每个众生心中的净土。一真法界就是最真实的世界，是众生如来藏世界，一切法不出如来藏之外。极乐世界在现象上是存在的，现象界就是世俗谛，依真心如来藏而有，是阿弥陀佛在因地菩萨位中，发大清净誓愿所建立起来的殊胜佛国土，为摄受众生而建立。但是极乐世界也是幻化出来的，是法藏比丘的善业所感召的，本无今有，因此就是幻化生灭的虚妄相。</p><p>一切世俗法都不能否定其现象界的存在，比如我们的五阴身，在现象上是有，这不能否认，但实质却是空，是真心幻化出来的，是空幻的世俗法，所以不实。虽然五阴是幻化、生灭、空的，但也不能否定五阴在现象上的存在，不能否定在世俗谛当中的作用。同理，极乐世界也是阿弥陀佛的无垢识幻化出来的，也是极乐世界所有众生的如来藏共同幻化的，从无到有，后天产生出来的就是虚幻的假有。虽然如此，也不能否定极乐世界在现象上的存在，不能否定其在世俗谛中的有。</p><p>除了真心，一切法都是真心中物，都是真心所变，因此都是生灭的，只有真心不生灭。虽然极乐世界将要存在极其久远的时间，但毕竟也是具有生灭变异性质的，它不可能如真心如来藏一样永恒存在。佛四十九年讲法，分别从世俗谛和胜义谛两方面来讲，世俗谛是现象上的有，这种有是假有、幻有；胜义谛在现象上是无，实质上是有，是实相心。因为胜义谛是实质上的有，所以才能产生世俗谛现象的幻有和假有。</p><p>我们学佛修行不能偏向于一面，而否定另一面，二者都很重要。明胜义谛之理，从而改变世俗谛的颠倒，纠正以往无明狭隘的认知，才能获得大智慧，圆满佛道。如果只承认有世俗谛，没有胜义谛，就不能出离生死轮回；如果只承认胜义谛，否定有世俗谛，那么这个胜义谛就没有实际作用和意义，众生也不能修行了。</p><p>学佛到究竟时，二谛都能圆通无碍，有一谛不通，二者都不通；而通达了胜义諦，就能渐渐通达世俗谛，只有圆融地修满二谛，世出世间法才能圆满通达无碍。最终结果就能使得五藴七识得到彻底究竟转变，灭尽一切无明，让五蕴七识得到最大最圆满的功用。</p><p>五、极乐世界在佛心中，以及任何人心中都是不生灭的，除了真心，一切法都是真心中物，都是真心所变生和显现出来的，因此都是生灭的，只有真心不生灭。虽然极乐世界要存在极其久远的时间，终究也要灭去，只是这个时间我们不知道多长罢了。原来并没有一个极乐世界，阿弥陀佛发大愿以后就建立起来一个极乐世界，后来才建立的，就是有生的。世间没有一个法是生了而不灭的，这是法界运行规律。从另一个角度讲，极乐世界是真心所现，也是真心的一部分，也属于真。</p><p>真心不灭，一切法就总会存在，灭了也会再出生，一切法的现象就是要不断地出生。只是个别现象不断地生灭，变异无常，总体来说是常存，因为总是要出现的。不管我们执与不执极乐世界，极乐世界就是生灭的，依真心理体来说，它有真如的性质。一切法灭了再生，生了再灭，因为有真心如来藏存在，所以一切法能生能灭，长久来说现象界总是要在世间不断出现的。</p><p>六、如来藏能变现极乐世界，幻化极乐世界，极乐世界也确实是如来藏功能作用的一部分，与如来藏是不一不异的关系。如果说极乐世界就是如来藏，那么极乐世界也能产生万法，可实际上不能，所以极乐世界与如来藏不完全是一，还有异的方面。异的方面，极乐世界有形有相，有生有灭，是生灭幻化的，也是变异的，它没有识心的体性，有物化的作用，是承载众生的承载器；而如来藏是心识，无形无相，有心的功能体性，不生不灭，也不变异，极乐世界依之才能存在。</p><p>一切法都不离如来藏而有，极乐世界全体都是如来藏的功能作用显现，看见极乐世界，就应该知道是自己的妙真如性，听到极乐世界就应该知道是自己的妙真如性，嗅到极乐世界就应该知道是自己的妙真如性，一切法都是自己的妙真如性，这是大悟成片的境界。</p><p>但是也得知道，极乐世界确实是有生灭的，是后来才出现的，极乐世界的建立仅仅才十劫的时间。世间现象的存在是不可否定的，娑婆世界亦如此，十方世界亦如此，都不可否定其存在性，只是这些存在都不真实罢了。</p><p>学佛法要从世俗谛和真谛两方面学，任何一方面都不能否定，都要正视，真有真的体性，妄有妄的作用。阿含经和华严经，是从真俗两方面阐述佛法，都是佛说，都要修习和证得。如果没有世俗法，佛也就不用讲解脱之道了，不用讲四圣谛理，没有世俗谛也没有众生世间，那就谈不到修行与解脱了，因为没有需要解脱的主人，也没有束缚主人的法。只有在世俗谛当中，才有苦集灭道，真谛如来藏本没有苦，也不集苦，也不断苦，更不修道。佛让我们出离生死轮回苦，就是因为世间有生死苦的世俗现象，这是不能否定的。</p><p>所以极乐世界虽然是唯心所现，在现象上是有，阿弥陀佛和诸大菩萨以及无量众生也在极乐世界的现象界上存在。当我们证得甚深智慧的时候，就知道极乐世界和十方世界，其实质都是一真法界，这时十方就都寂灭了。我们学佛法应该从真俗两方面完整地来看待一切的事与理，不偏废任何一方，才能具足正知见，获得甚深智。</p></div>"
},{
    "title": "第二十五章　如来藏与记忆",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十五章　如来藏与记忆</strong></p><p>一、八个识里面，如来藏就是库房，一切法的货源也就是种子，都从如来藏里提取出来，我们从前所做过的事业，经历过的人事物理都作为种子存在如来藏里，如果意识心想要再了别一下过去的人事物理，那就得从如来藏当中取出记录查看。</p><p>但是只有意识心才有查看记录的能力，记忆的功能是意识心所具有的，如来藏本身没有记忆的功能作用，业种现前成为法尘时，祂也不能了别法尘，祂不了别任何具体法尘为何。意识心虽然有记忆回忆的功能作用，但在没有修出神通的情况下，第六识只能记忆起今生所经历过的一切人事物理，经历的事情，只有第六识能够回忆出来。</p><p>意识凭什么能回忆起过去的事情呢？我们所经历的事情，做过的身口意行，当下就以种子的形式存到如来藏的库房里了，过后意识心想要了别，也必须要从库房里取出来，因此意识和如来藏之间就要有一定的联系，其中意根就是二者联系的桥梁和纽带。</p><p>意根就像一个总管家，意识要取什么货物必须要经过意根的允许和同意。如果如来藏库房里有这种货物，因缘条件允许如来藏就会无条件地奉献出去，意根就会拿给意识心受用；如果库房里刚好没有这种货物，或者货物被挤压着，暂时取不出来，意识只能空手傻等着，什么也得不到，享受不到。</p><p>我们前世所熏修的法，所经历的所有人事物理也都以种子的形式存在如来藏库房里，我们今世能不能取得出来呢？当然也能！但意识心必须修出神通，不受肉体色身的遮障和影响，不用经过大脑胜义根，就能直接了别意根作意的、如来藏变现出来的法尘。如果没有修出神通，意识心就要受到肉体色身的遮障，前世所经历的事情，意识心就了别不到，回忆不出来了。</p><p>可是我们有时候还是能感知到前世的某些信息，这是如何感知到的呢？这就得依靠如来藏和意根，如来藏里的业种已经成熟了，现行的缘都已经具足了，那么业种就要现行出来，不管意根攀缘与不攀缘，业种现行出来成为法尘，意根与之相触，意识就有了一定的感知力。而我们前世所熏习的内容，意根也能攀缘出来，让意识了别，于是意识再接触同类内容，就能很快地理解和记忆，根本不费力，就像轻车熟路似的。</p><p>前世熏习过的法，我们今世一接触，很快就相应了，比如说我们前世经常读诵椤严经，这个业种存到如来藏里，今世我们一接触楞严经，读起来就非常熟悉，非常顺利，有的人读着读着还能背诵。这就说明我们不是今世才刚刚读诵楞严经，而是前世就已经熏习过了。前世有读诵楞严经这个业种，缘熟时意根缘到了，意识心就随之得到受用，学习楞严经就非常的快速，读的快，记的也牢，自然就能够背诵下来，感觉那些句子和意思都非常熟悉，这样今世学佛修行就与前世的业种联系上了。</p><p>我们今世读诵心经，读到会背了，这个种子也存到如来藏里。会背以后，再背诵心经的时候：“观—自在—菩萨，行—深—般若—波罗—蜜多—时，”一个字一个字，一个音节一个音节，这些法尘都是经过意根从如来藏库房里取出来的，意识心受用，这样就说是意识有了记忆能力，能背诵心经了。意识学习背诵的东西，自己不能存储，因为自己本身是生灭的，也没有存储业种的功能作用，即使能够存储，当意识灭去时，也要丢失，意识不自在，没有保管能力之故。所以只有如来藏能够存储，因为祂永远不消失，放在那里非常安全可靠，不用担心如来藏灭去把种子丢失掉。</p><p>存到如来藏里的种子，当意识心需要时，就要取出来。这时就得借助于意根，当意识心想背心经时，这个欲望传达给意根，意根了知后，也决定背诵心经，于是就生起思心所，如来藏了别了意根的思心所，就能把背诵心经的种子输送出来，意识了别到了法尘，自然就会背心经，一个字一个音节的就出来了。</p><p>如果心经读的不熟，背不下来，就没有存入能背诵的种子，想背诵时，那些字和音节就出不来。也许能背出第一句话，第二三句话以后就背出不来了。因为我们没存进去，如来藏库房里没有那个能够背诵的业种，如来藏又不能自己制造种子。库房里没有货，当然就不能取出来享用了，那就不得不打开书本照着读。</p><p>我们现在所得到和受用的一切法，都是从如来藏库房里取出来的，库房里的又都是我们从前自己存进去的，我们存什么才能用什么，不存就没有。我们要想成佛，就得都多存善业种，种子存进去以后，将来才能得到受用。我们要想得福报，就得存进修福的种子，如果我们没有存进修福的种子，要想得福报，那是不可能的。我们要想得什么，必须存什么；存什么，就得什么。所以要选择好我们的身口意行，懂得要如何的造作，才能让自己得到最大最真实的利益，不损害和违背自己的利益，我们就得要小心的造作，有选择的造作，尽量都造作清净的业行。</p><p>我们的五阴也来自于如来藏库房里的种子，因为意根的无明，不断地产生六识的身口意行，身口意行的种子就要不断地存入如来藏心体当中，命终遇缘，如来藏就要输出业种，投胎到六道中，就要出生五阴身来受用业果报，所以五阴身全部来自于如来藏库房里的种子，那么五阴全体即如来藏。</p><p>就比如天上的白云，能现起猫狗的形相出来，那些白云变换成的猫狗白白胖胖的，非常可爱，有人就贪爱猫狗的相貌，完全忘记了那都是一团团的白云构成的。白云就比喻为如来藏，猫狗的形象就像我们的五阴身一样，观察猫狗发现，它们无一处不是白云，任何一个点点，都是由白云组成的，整个猫狗全部都是白云，方方面面都来自于白云。同理，我们的五阴方方面面、时时处处都来自于如来藏，任何一个相貌和作用，全部都来自于如来藏库房，五阴身的所有材料都来自于库房，五阴所受用的一切，所造作的一切，全部都来自于库房如来藏。</p><p>如果想找到如来藏库房的入口处，开悟成佛，其实也不难。难在哪里呢？难在我们的福德不具足，定力不具足，慧力不具足，菩萨六度的条件不具足，愿力也不具足，这样就把自己难住了。如果这些条件都具足了，世上就无难事，难就难在我们没有存下足够的善业种子。种子不足，我们没办法从库房取出足够的资源，明心见性就显得很困难，要想断我见，同样也很困难。要想受用到足够的福德资源，要想证得自性清净心，必须要多存善业种子。戒定慧的修行种子，菩萨六度的修行种子，菩萨的大福德种子等等，我们要多存进去一些，直到这些种子够用了，才能证得大小乘的道果。</p><p>二、有人说大脑是记忆的仓库，经历过的事情都储存在大脑里，意识是从那里想起从前的事情来的，所以有人一怕脑袋就想起什么事情来了。这个说法是不对的，因为大脑是物质色法，而且是生灭性的，它不能储存种子，种子是无形无相的东西，无形无相的东西不能与有形有相的物质色法混在一起。而且大脑只能存活一世，此世所经历的事情，如果都存储在大脑里，来世换了个大脑，那么今世的业就消失了，来世就没有业报了，那为什么还有来世呢？而且有宿命通的人，能知道自己和他人多生多世的业行，显然不是知道此世大脑里的记忆。</p><p>我们身口意行所落谢的种子和法尘，不能储存在大脑里，那都是储存在如来藏里的。大脑没有地方储存落谢下来的种子，后脑勺那里是胜义根，是主管眼根、耳根、鼻根、舌根、身根功能的地方，并且如来藏根据外尘所变现的影子落在那里，根尘相触，如来藏才出生六识来了别六尘。既然是根，就不能储存种子，只有心才能储存种子，而且还得是不生灭的常住心如来藏。</p><p>六识的所有行为造作，都是识的功能作用，识种子是如来藏输送出来的，造作业行之后，刹那回到如来藏里，就把造作的业行也带回到如来藏里，作为种子收存。将来遇缘时，如来藏再输送业种，六识就记起了从前的事情。</p><p>三、五个根是四大组成的浮尘根与胜义根，是物质色法。其中外五根是粗的物质色法，胜义根五根是细微的物质色法。所以我们色身健康有营养时，胜义根里四大就调和，如来藏就能摄取协调的四大来如实变现内相分，六识了别的就如实。否则胜义根处营养不足，四大不调和，如来藏摄取的就是不调和的四大，那就不能如实变现内相分。内相分就会扭曲变样，六识了别的就不准确，不如实。众生就会表现出智慧低劣，缺乏记忆，经常想不起事情来，容易健忘。所以学生临考试前，要补脑补营养，就是为了让意识心好好发挥作用，把以前学到的内容，都能如实地了别清楚，回忆得出来。</p><p>四、记忆是如来藏储存的种子，种子就是法，无形无相，造作现行出来的独影境也是无形的，所以五识不能了别，只能由意识单独仔细了别独影境，意根粗略了别，这叫作回忆。一切法都可以作为种子存储起来，身口意的一切行为造作，所经历的一切人事物理，也就是六尘境界全部作为种子由如来藏收存。之后意根攀缘想了别，如来藏就随顺意根的思心所，把种子输送出来成为法尘，成为独影境，意根缘了之后如果想细了别，如来藏就出生独头意识一一了别，这就是所说的回忆。</p><p>所以回忆里有细节，回忆出来的境界属于法尘，五识不能了别。前五尘的相分也作为种子和一种信息存在如来藏里，种子和信息无形无相，不属于五尘境。因缘具足时，如来藏根据种子也要输出五尘境，再依意根的思心所，如来藏出生六识来了别，但是，这就不属于回忆了。</p></div>"
},{
    "title": "第二十六章　常乐我净与解脱",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十六章　常乐我净与解脱</strong></p><p>一、法身即是《大涅槃经》中，佛所说的真常、真我、真乐、真净，非为空无所有的名词概念。其它一切法都只是相和名，是众生的觉知心所分别的六尘相。佛地的大圆镜智、无垢识，即是佛法身。法身能现一切相，生一切相，报身、应化身佛即是法身佛所生，没有法身就没有一切。众生的如来藏方便称为法身，然此法身还不究竟，里面含藏着七识心的染污种子，这些种子还要生灭变异，等到这些无明种子都消尽了，如来藏中就不再有生灭性的种子了，这时如来藏就永远不变异了，改名为无垢识大圆镜智，这才是真正的法身，具有常乐我净的真正功德，真常、真我、真乐、真净。</p><p>佛地的如来藏是真常，既不断灭也没有无常性。无常就不是常，常就不是无常，两个体性不能同时存在，只能有一个存在。就像死了就不是活着，活着就不是死，二者不能同时存在，同时存在是不合逻辑的。佛地的常是绝对待的，不从某个物来，也不用无常法来显现衬托其常恒性。常性，法尔如是的存在，没有什么道理可讲，世间的逻辑推理在这里一律都用不上，情解意解也理解不了。</p><p>众生总是喜欢用推理分析比对，用种种心识活动来思惟佛法。常乐我净是绝对真理，绝思惟、绝分析、绝对待、绝情知意解。常乐我净不是世俗法，不能用世俗的逻辑思惟推理来比对来证得祂的真实存在。世间断灭法，不能与真常对立对比，世间的苦不能与真乐相对立对比，世间的五阴不能与真我相对立对比，世间的不净不能与真净相对立对比，对立对比即是戏论法，没有实义。常乐我净，真实、永恒、不变。</p><p>二、色身与法身的关系，色身是法身所生所执持的，色身不能离开法身而存在，法身在，色身即有寿命，有暖度，有识心，法身不在即是死人，一个木头。法身要显现和起作用必须靠着色身五阴才能起用，离开色身五阴，法身就显现不出来了，离开色身五阴也不能找到法身。但是法身仍然存在，法身的存在可以不依赖外缘，单独存在。</p><p>法身单独存在时，就是阿罗汉入无余涅槃时，把五阴都灭掉了，意根也灭了，只剩下法身如来藏单独存在。这个时候，就是佛也找不到阿罗汉，因为没有阿罗汉的五阴，根本没有阿罗汉这个人。佛也找不到阿罗汉的法身如来藏，因为法身无形无相，没办法找到。所以要找如来藏，必须在五阴的活动运行当中找，在生灭法当中找那个不生灭的法身——如来藏，在身口意行当中找如来藏，这就是参禅的方向。</p><p>法身是常，在六尘境界里祂无知无觉，在六尘之外的法当中，祂还是有知有觉的。祂知众生的业种和业缘，缘具足时根据众生的业种，变生众生的五阴身。造人的业，就在胚胎里变人的形体，造男人的业，变男人的形体，造女人的业，就变女人的形体；造色身不具的业，就变六根不全的形体；造畜生业，就变畜生的形体；造天人业，就没有中阴身，不用投胎，直接变天人形体。祂不会胡乱造众生五阴身和生存环境，全部依着众生的业种。</p><p>法身有觉，觉七识要做什么，之后祂就会输送七个识的识种，让七个识运转，同时也配合七个识运转，成就五阴之用。祂所知的范围非常广，比如两人见面彼此不认识，祂能输送业种，让两人或一人感知两人之间的缘，或觉亲切或觉憎恶。众生在母胎里色身成熟了，祂能觉知道，然后吹业风，让胎儿出胎。众生寿命要结束了，祂也知道，祂也知什么时候该从临终人身中离开。</p><p>法身有等等这一切非常多的知，所以法身之体是真实有，而众生不能眼见耳闻，只能以智慧之眼觉知到祂，不具智慧时，就没办法寻到祂，没办法证得祂。法身这个东西，不是世俗中的东西，祂没有色声香味触法六尘相。但祂是出世间法，既然是法，就有法的功能作用，有功能作用就不是一无所有。祂有祂所存在的方式，祂不是三界法那种存在方式，虽然不好理解，但也只能说到这里，不能再进一步解释了。那个不是东西的东西，真让人难于理解和认知！</p><p>三、佛说的常，是真实的有，真实的存在，是永远不生灭不变异的，无始无终，不会有刹那断灭，那就是真如无垢识。无垢识与外道说的神我迥然不同，外道说的神我是意识心，是生灭变异之法，认意识妄心为永恒不变的真我，就是常见外道。根本佛法都是以如来藏为出发点来展开一切法，离此如来藏而讲的法，不是常见，就是断见，都是外道法。永远不再变异的法，就是常，佛地无垢识里面再也不含藏七识的染污种子，种子不变异了，无垢识就是常的。我们现在的如来藏里，所含藏的七识心的染污种子要不断发生变异，不断的转换，不是固定的，能拖累如来藏，所以众生的如来藏是非常非无常的。</p><p>有物先天地，无形本寂寥，说的就是如来藏，如来藏是真实存在的，是万物先，万物主。所以不可说如来藏只是一个名词概念，不可说祂只是名言施设，祂有真实的功能体性，能出生万法万物，是一个实体，虽然祂无形。</p><p>四、法身即是大涅槃经中，佛所说的真常、真我、真乐、真净，本不是空无所有的名词概念。其它一切法都是相和名，是觉知心所认知和分别的。佛地的大圆镜智无垢识，即是佛法身，法身能现一切相，生一切相，报身、应化身佛即是法身佛所生，没有法身就没有一切。众生的如来藏也可以方便称为法身，然此法身还不究竟，里面含藏着七识心的染污种子，这些种子还要生灭变异，最终全部都转换成清净的种子，等到这些染污种子都消失，里面都是清净的种子的时候，如来藏里不再有生灭变异性的种子，这时如来藏就是永远不变异的心体无垢识大圆镜智，祂就是真正的法身，有常乐我净的真正功德，真常、真我、真乐、真净。</p><p>五、常乐我净，是指佛地的真如心体无垢识。无垢识本身就是涅槃心，涅槃心不是涅槃境界，涅槃境界只是涅槃后的阿罗汉和辟支佛的如来藏所处的境界。佛不住涅槃境界，不住无余涅槃，但是佛的无垢识永远处于涅槃的寂静状态，不是不生不灭而是永不生灭，是常恒的状态，那是真正的涅槃境界。所以常乐我净就是指无垢识本体的寂静清凉的境界，不是指涅槃死后的空无的境界。</p><p>佛地的常乐我净的真实境界，完全颠覆了小乘世俗谛中所说的苦、空、无常、无我，苦空无常无我是指世俗谛中的五蕴十八界法，这些法都是如来藏出生的，所以如来藏是生灭的、无常的、苦的、空的，因此才是无我的。</p><p>但是佛地的无垢识常不变异、不受熏染、不改变其性，是真正的常，不是无常的。所谓的常，是指心体里的种子没有生灭变异现象，心体本身也永远不变异。而众生的如来藏还不是真正的常，心体里隐藏着七识的染污业种在不断地生灭变异，种子要经过不断的变异，由染污到清净。有些众生的如来藏里的种子可能还要熏染成染污性，如来藏还要收存这些染污业种子，所以众生的如来藏还不是常，不是无垢的，是不垢不净的。</p><p>乐，佛地的无垢识纯乐没有苦，心体里没有恶业种子，不再变生众生的苦果，所以祂没有苦，也没有七识的苦受苦果，处于究竟寂灭乐状态。</p><p>佛地无垢识具有完全的我性，与佛的六七识是一样的，与前五识也是一样的，可以了别一切法，变现一切法，具有我的性质，有我的德能和作用。众生的如来藏没有我性，受七识的拖累，祂就没有我性。</p><p>净，佛地的无垢识是清净无染的，没有无明染污，真正清净了，不含藏七识的染污种子和无明。如来藏里没有染污业种时，全是清净纯净、不变异的业种，就成为无垢识。众生的如来藏不是纯净的，心体还有七识的染污业种，叫作不垢不净。</p><p>六、佛说的所有法都指向于解脱，法法皆趣向于涅槃，法法皆不离于涅槃，无一法在涅槃之外。法身即是般若，般若即是解脱，解脱即是涅槃。都不离真如之外，一切法依于真如而说都是解脱法。真如无系缚，一切法就无系缚，真如解脱，一切法即解脱。一真一切真，一解脱一切解脱。</p><p>色法不系缚真如，声香味触法都不系缚真如，真如即是解脱。色声香味触法依于真如而有，色法为空，当下解脱，声香味触法为空，当下解脱；眼根为空，当下解脱，耳鼻舌身意根为空，当下解脱；眼识为空，当下解脱，耳鼻舌身意识为空，当下解脱，世出世间法无一法不解脱。解脱大道，就在目前，仁者自行识取，自得解脱，自证涅槃！</p><p>七、解脱是心无贪爱，心无烦恼染污，心无无明，不被三界一切法所束缚，这样的心就是解脱的，能出离三界生死轮回。</p><p>解脱分为两种，一种是先天性的不用修行就有的解脱，一种是通过修行才能获得的解脱。先天性解脱的是本来就没有任何束缚的如来藏心体，祂没有贪嗔痴烦恼，因此就不受贪嗔痴烦恼所束缚，不贪三界法，因此就不受三界束缚；没有无明，不受无明束缚；本身是无我性的，不受我性的束缚，祂能自由自在，不受万法束缚，不在三界里受生死轮回苦。</p><p>通过修行才能获得的解脱，是七识妄心所得的解脱，七识妄心通过修行大小乘之理，断除烦恼，断除无明，就能得解脱，出离生死，得涅槃，获得清凉。</p><p>八、《大涅槃经》原文：何等名为秘密之藏？犹如伊字三点，若并则不成伊，纵亦不成。如魔醯首罗面上三目乃得成伊三点，若别亦不得成。我亦如是，解脱之法亦非涅槃，如来之身亦非涅槃，摩诃般若亦非涅槃，三法各异亦非涅槃。我今安住如是三法为众生故名入涅槃，如世伊字。</p><p>释：伊字，可能是印度的字体，由三个不是并列的三点组成，三点不横不纵地排列，组成了伊字，三点的关系是不一不异的。法身、般若、解脱三者也如是，互相是不一不异的关系，三者共同成就了佛地的大涅槃。</p><p>单独的法身不是涅槃，单独的解脱不是涅槃，单独的般若不是涅槃，三者不相关联就不是涅槃，三者密切相关联系在一起就是涅槃。如来证得法身，同时具大般若智慧和究竟的解脱德，才是真正的涅槃。如阿罗汉的解脱没有法身德和般若德，其解脱也不究竟，因此就不是真正的涅槃。</p><p>法身德，即吾人圆满清净的自性清净本心如来藏，祂圆满成就一切法，无量功德俱于一身；般若德，即吾人真如性体所具的大智慧境界，非空非有，即空即有，真空妙有，空有双具；解脱德，即吾人心体本性，于三界无碍，不住一法，不执一法，虽产生万像，而不染一像，自身净裸裸，不挂一物。</p><p>解脱、法身、般若三者的本体都是真如，但真如不等于解脱，因为真如还有法身德，也有般若智慧德；真如不等于法身，因为真如还有解脱德和般若德；真如不等于般若智慧，因为真如还有法身德和解脱德。集法身、般若、解脱于一体，才是大涅槃。菩萨们虽然分证了法身，但是般若道种智不圆满，解脱不究竟，因此就不是大涅槃。只有佛世尊能完全安住在法身、般若、解脱三者之处，为诸众生故，假名入此涅槃，实则无所住无所入，名为大般涅槃。</p><p>九、法身德，即般若德；般若德，即解脱德；解脱德，即法身德。且问：法身德与般若德、解脱德，是一、是二还是三？离法身有般若德乎？离般若，有解脱德乎？法身即般若，般若即解脱，解脱即法身，这就是法身之理体，具足一切法，与一切法不一不异。</p><p>而有些人说的解脱德，是通过修行以后，五阴七识所具有的后天出现的生灭性的解脱德；我所说者是真心理体法身如来藏先天本具的不被三界一切法束缚的解脱德，二者之间差别极大。有些人所说的般若德，是七识通过修行所获得的后天的生灭性的般若德；我所说的般若德，是自心如来藏先天本具的出世间的大智慧般若德，二者差别极大。</p><p>有些人所说的空假中，都是五阴七识通过修行，后天所获得的生灭性的空假中。真正的空假中，是真心自性如来藏先天本具的不生不灭的中道理体空假中。</p><p>一段文字摆出来，就能知道此人智慧如何，就知道法义正真与否，深度如何，这才能做到依法不依人。不懂文字，如何依法？只能依人。依人时，就要说某人是某某大师，某某大师不会有错，世人都是如此，只认名声，只认已经形成的势力，并没有智慧判断其真实智慧层次。</p><p>我们要想依法不依人，就要证得法，具有大智慧，才能依法，最低程度也要懂得法，才能依法；如果不懂法，那根本依不了法，真正能依法，确实是非常不容易的。现在有多少人口中高喊依法不依人，可是几乎百分之九十九的人，都在依人，依不了法。都在说，某某是大师，大师肯定都是对的，不能说大师不对，大师讲的要全盘接受，实际上大师讲的错误可能不少，也许极大极多，谁能有智慧辨别？况且有多少人在喊着不分别，这就是末法时期无智众生的可怜处。</p><p>佛的色身是解脱色，虽然解脱了而有色身的存在，以此色身利乐众生无穷尽；虽然有色身存在却是解脱的。而阿罗汉们虽然解脱了，却没有色身，灰身泯智，因为慈悲心薄。阿罗汉们虽然解脱了，只是了了分段生死，还有变易生死没有了，还有无明，还有无数的所知障没有断，还有随眠烦恼以及烦恼习气没有断，因此阿罗汉的解脱是不彻底、不究竟的。</p></div>"
},{
    "title": "第二十七章　如来藏与五蕴十八界的关系",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十七章　如来藏与五蕴十八界的关系</strong></p><p>生也没有来，死也没有去；生无可生处，死无可去处。</p><p>说生实不生，谈死实无死；大海一沤泡，终归于大海。</p><p>一、八识大树图</p><p>世间一切法由八个识和合在一起共同组成，一切法相当于一棵古老而具有强大生命力的参天大树。其中植入到深深的土壤中的树根相当于如来藏，根基牢固庞大而不可摧毁；粗大结实的树干相当于第七识意根，一直伸向高空；繁茂的树枝相当于第六识，大多数树枝与密密麻麻的树叶子连接在一起，树叶子相当于五识。离开如来藏树根就没有第七识的树干，离开第七识的树干就没有第六识的树枝，离开第六识的树枝就没有五识的树叶子。而没有五识的树叶子可以有第六识的树枝，没有第六识的树枝可以有第七识的树干，没有第七识的树干可以有如来藏的树根。</p><p>这些文字加上大树的结构图，完全可以代表众生的五蕴身。无明比较重的凡夫众生，往往一叶障目，喜欢漂亮的色彩，满眼都是红黄绿的树叶，其余一切精华全都不见。这些众生在世俗里醉生梦死，只知五欲享乐，没有思想，没有理想，也没有追求。</p><p>稍微聪明一些的凡夫众生，眼中不仅有色彩斑斓的树叶，也能欣赏树枝的俏丽迷人。这些人沉浸于各种思想、哲学理论的探讨追求中，却看不到树枝树叶随着季节不断出生和凋零，不断的生住异灭，不能永恒，所探讨研究出的理论也就不断的更新再更新，找不到究竟的归宿和来源。</p><p>目光深邃又比较现实一些的众生，顺着树叶树枝深入内里，找寻树干，试图挖掘潜意识，寻找心灵的奥秘。一部分终究因为福德欠缺，心力不足，只能看到一些树干的轮廓。另有一些聪慧者，拨开遮眼的枝叶，见到了主干，深观雄壮的树干，发现枝叶六识所有的养分，全部由主干意根传输上去，没有意根主干，就没有六识枝叶。</p><p>智者并不止步知足，再顺主干往下寻究，终于找到生命的源泉，永恒不死的树根——如来藏；终于明白，这才是养分的发源地，树干只不过是养分的传输纽带和桥梁。找到了生命的源泉，智者心有归宿，依靠着树干，坐在树根上，栖息乘凉，欣赏枝叶风景，好不自在。</p><p>可怜有那一部分人，截去树干，加工建筑房屋大厦，留世百年；树枝劈成小段，烧火取暖，留形三两年；树叶落地，无人打扫，秋后腐烂于地，不见踪影；只留树根，孤零一卧。</p><p>二、五蕴在第八识里还是外？第八识在五蕴里还是外？</p><p>首先来说第八识是否有里有外，里是什么样的，外是什么样的。第八识本身是无形无相的识心，没有里外，五蕴既不在第八识里，也不在第八识外。如果在第八识里，第八识就有了形相，就不是识心了；如果在第八识外，第八识如果有外，就有了边界，那就有了形相，也不是识心了。第八识外没有法，如果有法就不属于第八识所生，那么第八识外的法的来源就成问题，一切法都归属于第八识所有，没有超出第八识之外的，包括虚空。楞严经中佛说：一切法都是真心妙明中物。五蕴也是第八识心中物，由第八识出生和执持，虽然不在第八识里，但归属于第八识。第八识心体里无一切法，但是一切法却又不离第八识，也不与第八识相邻。第八识叫作一真法界，一切法都在一真法界里，全体即真如。</p><p>第八识也不在五蕴的里和外，在五蕴里，第八识就有了形质，在五蕴外，就与五蕴无关，五蕴就不能存在。</p><p>三、具足凡夫法，凡夫不知，凡夫若知，即成圣人。具足圣人法，圣人不知，圣人若知，即是凡夫。</p><p>如来藏本自具足一切法，这些法包括有为法和无为法、凡夫法和圣人法。有为法是七识造作出来的三界世间法，是如来藏出生的五阴十八界法；无为法是如来藏在五阴身中运作的时候所显示出来的清净性和如如性，也代表如来藏心法。</p><p>如来藏具足五阴十八界世间一切法，可是凡夫却不知，因为七识有无明遮障自心，把五阴十八界法当作实有之法，不知道这一切法都是如来藏幻化出来的。凡夫众生修学大乘法，一旦证悟了如来藏时，就知道了原来五阴十八界一切世间法属于如来藏当中的法，如来藏本自具足一切法的种子，因缘具足，就要依据种子出生一切法，五阴自我就是虚幻出来的，所以是非我。这时此人就从凡夫转变为圣贤。六祖在五祖讲金刚经时，因为明了自性本自具足一切法这个理，明了五个何期自性，而成为圣人。</p><p>如来藏是出世间法，没有无明烦恼，因此具足圣性，具足圣人法，具足无为法。祂无始劫中自心永远是清净无为的，没有一丝无明，没有一丝烦恼，没有一丝我性；祂出生一切法，而不执著一切法，在一切法的运作中总是显示出自体的清净性、如如性、无烦恼性、无无明性，永远不随万境转。而如来藏自体本具的圣性，祂从来不自知，也不了知自己是凡是圣，是有为还是无为。</p><p>如果能了知如来藏具足清净无为的圣人法，了知如来藏的真实而如如性，这个能了知的心就是具足有为性的妄心，妄心即是世间法，世间法就是凡，出世间的如来藏是圣。如果有人说如来藏知道自己具足清净无为性，如来藏马上就变成世间生灭的妄心，成为一个凡夫，不是出世间的如来藏心体了。然而，如来藏永远没有这种了知性，永远是所谓的出世间的圣人，所以祂具足圣人法而不自知。</p><p>四、我们能够知道一切事物的心，叫作能知，这种能知性，如果没有阿赖耶识，根本就不存在。所知，我们所知道的六尘万法，如果没有阿赖耶识，也不能出现，我们也就没办法了知六尘境界。能知是七识心，所知是被知的六尘境界，二者都是阿赖耶识所出生的。所以阿赖耶识称作所知依，我们依靠着阿赖耶识，才有能知和所知，才有活活泼泼的五阴世间的存在。</p><p>六根是阿赖耶识所生，六尘是阿赖耶识所变，六识也是阿赖耶识所生，众生的假我五阴十八界整体都是阿赖耶识所变生和执持的，根本没有五阴自己什么事。都是阿赖耶识自己在玩转一切，都是魔幻师自己在玩耍，一个幻象一个幻象地变现。这个观行完全观到，深刻细致地现观到这个理，那已经到初地了。然后每个众生到自己面前来，看到的都是幻象，没有实质的众生，父母在面前，没有真正的父母，家亲眷属在面前，没有真正的家亲眷属，无我、无人、无众生、无寿者，没有实质的一切法。</p><p>三界世间静悄悄，空荡荡，全部都是阿赖耶识这个魔幻师在舞弄着一切，都是阿赖耶识这个绘画师在泼墨挥洒，描画出众彩斑斓的五阴世间。</p><p>五、自性依五阴十八界万法而显现，没有五阴时，祂就无法显现出来，名为隐。意思是说，离开五阴十八界，谁也找不到自性如来藏，就连诸佛也找不到，这就是阿罗汉的无余涅槃境界，一无所有，一无所是，那个境界没有任何乐趣，没有任何意义。</p><p>自性虽然无形无相，但不是名言，不是假名，祂有真实的体存在，所以才叫作实相。那么自性可以这样说，有缘即显，无缘而隐。性和相本不一不异，如果是一，相灭，自性无，实际是相灭，自性不灭；如果是异，二者就没有关系，所以性和相，是不一也不异的关系。</p><p>六、有情众生色身是由单独的如来藏出生和维持的，四大种子形成色身物质色法，识种子形成七识，单独的如来藏一方面不断输出四大种子维持色身的运转；另一方面，如来藏又要输出识种子，不断配合意根的思心所，出生六识的身口意行，这样五阴身就刹那刹那存在和运转。</p><p>无情物是四大种子变现出来的，是共业众生的如来藏共同执持的结果。花草树木的种子，同样也是如来藏里的四大种子生成的，一切法都是如来藏出生和维护的。花草树木的种子没有生成义，表面的现象好像是花草树木的实物种子生出来的，实质是如来藏里的四大种子生成的，因此都是如来藏的功能作用。众生的色身同样也是四大种子出生的，与构成花草树木的四大种子是一样的，也都是如来藏的功能作用。</p><p>无情物只是由四大种子组成的，没有识种子，也就没有七识心，而且是很多众生的如来藏共同输出四大种子维持着无情物的存在。没有七识心，无情物就没有五阴活动，如来藏不能配合无情物有心识活动，不能配合无情物有五阴活动。再者无情物有那么多的如来藏共同执持着，那到底是哪个如来藏输出识种子配合七识活动的？如果共同输出识种子，无情物一定要大乱，没办法配合，即使有七识的话。所以在无情物上，佛也找不到如来藏是如何配合无情物运作的，在有情的五阴身中，就能找到如来藏，通过五阴活动七识活动，就能发现如来藏运作的踪迹，这就名为明心证悟。</p><p>发现如来藏的运作，要越具体越好，最具体最明显的运作，就是如来藏配合意根的运作。如来藏在色身上输出四大种子的运作，谁也观察不出来，可能除了佛，其余人都不可能。在无情物上，众多如来藏输出四大种子的运作，那就更不能观察出来。因此在无情物上就不能证得自己的如来藏，不能证得单个众生的如来藏，那是无法悟道的。</p><p>七、现在佛教界内流行一种观点说，要活在当下，把握当下。可是我们真的能接触到当下吗？我们所见的色、听到的声音、嗅到的气味、尝到的味尘、觉到的触尘、了知的法尘，没有一个是当下的现量，都是已经过去了的影子。犹如看电视一样，我们看到的都是一格一格的胶片经过快速播放，所产生的一系列的动感的图片，这些图片是刹那生灭的，单个图片本身也是静止的。因为连续播放的太快，形成的图像好像是连续的，里面的人事物好像是连续地活动着，表面看来好像都是真实的，其实都是影子，而且是影子的影子。我们六根所对，六识所见，都是过去了的影子，没有当下，更没有真实。虽然说五识分别的是现量境，但是五识所分别的绝非是真正的现量境，也是过去了的生灭了的影子，幻化的既非真实，也非当下。</p><p>五根接触到的也如是，绝非是真正的现量境，色声香味触五种信息达到五根，已经是生灭过无数次的四大微粒，根本不是微粒的原貌，不是最初发生和出现的色声香味触，这些微粒仍然不是最真实的。比如声音从出发点，经过传播渠道的传播，能量逐步递减，传播到耳根时，其振幅和能量已经变弱了，期间经过的距离越远，到耳根时的能量越微弱，再经过耳神经的传导，到后脑胜义根处，四大微粒有可能又改变了，形成的声音已经不是原本的声音，也不是声音的当下了，其它几根也如是。</p><p>因此我们所要把握的当下，都是过去时的当下，对于现在来说，都已经发生过去了，而且正说个当下时，即已过去，每个当下，念念都不停留，像流水一样，一去不复返。我们在每个当下所做的事，只能影响到未来的走向，不能影响当下和过去。所谓的真实，所谓的当下，都是如来藏接触的，但是如来藏又不分别，不能描述出来，我们就不得而知了。既然如此，我们该如何正确对待当下的色声香味触法呢？那就不能再把这一切法当作真实了，也不要生起很强的执著性，当然能做到完全彻底不执著是最好的，那样心就完全解脱了。</p><p>八、渠今正是我，我今不是渠</p><p>如来藏有如来藏的体性，藴处界有藴处界的体性，二者截然不同。但是藴处界却没有自体性，其一切体性、功能、作用都是如来藏所给予的。若没有如来藏则没有藴处界，可是没有藴处界照样有如来藏。如来藏自己能够单独存在，不依赖外缘，如来藏要显现出来就得依靠藴处界了，在藴处界活动当中可以找到如来藏。</p><p>藴：色藴、受藴、想藴、行藴、识藴；处：十二处，六根处加六尘处；界，十八界：六根界、六尘界加六识界。如来藏不离这些法所在处而显现，但是可以离这些法而存在。六根、六尘、六识全体都是如来藏的真实作用，全部都是如来藏，而如来藏不是六根、六尘和六识。渠今正是我，我今不是渠，就是这个意思，渠就是蕴处界，我就是如来藏，蕴处界就是如来藏，而如来藏不是蕴处界。</p><p>九、问：意动识动是否是风的作用？无情物上是否也有如来藏？</p><p>答：意动识动的本身是识性的作用，是有七识心所法运行的缘故。风不能促使识动，只能促使物动。地水火风四大只能构成有相的色声香味触法六尘境界，不能组成无相的心法。无情物上不是单个如来藏运行的，但是会受到共业众生如来藏的执持作用，无情物才能有生住异灭的现象发生。</p><p>因为三界唯心，一切法都没有自体性，都来自于如来藏，都是如来藏所生所执持，那么就没有一个法能超出如来藏之外。如来藏出生的五阴身是有情，叫作众生，有寿命，有生命活动，杀之就有罪过。反之，没有五阴作用的是无情物，破坏之，食用之，就不得杀生罪，因为物体没有色受想行识五阴的生命活动。</p><p>十、如来藏是如何产生五蕴十八界的</p><p>十八界是如来藏出生的，与如来藏是不一不异的关系。如来藏输出地水火风四大种子，形成了众生的五根色蕴，形成了色、声、香、味、触，及法处所摄色六尘，包括众生生存的宇宙器世间，所有的生存环境。如来藏输出意根的识种子，维持着意根的存在和运行，再输出六识的种子，产生六识，这样就形成了众生的五蕴十八界。我们观察自己的五蕴身心，就知道都是后天出生的，后天形成的都是有生有灭的，根本不是真正的自己，真正的自己不可能是生生灭灭的，这么的不自在。真正的自己一定是能够自己作主存在的，而且是没有苦受的，那就是如来藏。</p><p>十一、众生所接触的一切尘境都是自己的如来藏单独变现出来的</p><p>春雨绵绵，润物细无声。这是对春雨的感知，人们就把这种感受和知性，当作是我，把所感知的对象当作是我所有的，觉得我和我所都很真实很实在。于是就要执取执著这些感知性，为了这些感知造作各种身口意业，业种就存在如来藏里。等到业种成熟时，如来藏把业种输送出来，造业之人就为此受到善、恶和不善不恶的果报。起因就在于把这些感知当作真实，当作是我和我所拥有的，从而执取、贪厌所感知到的人事物，为了感知而造作业行。一切的业行都是因为我而有，起因于我，因此说有我罪即生。</p><p>我们所感知到的人事物是不是真实的，能不能被我们拥有，我们就来分析一下。比如说我们看到的春雨中的雨点是由地水火风四大种子组成的，是如来藏产生的；雨点落地的声音也是地水火风四大种子组成的声尘，是如来藏生成的。这些外色尘和声尘不是一个人的如来藏生成的，是共业众生的如来藏共同生成的。雨点落地的声音，其生成的过程非常复杂，声音的现起与物质运动有关系，物质运动与四大的变化有关系。物质撞击就会产生声音，物质运动就会撞击，四大种子生灭变异，造成极小微粒的不断运行，物质就会运动，所以说所有一切现象都是如来藏的功能作用。</p><p>声音分成很多种类，瑜伽师地论第一卷对此有分类描述：有自己的如来藏单独执持的声音，比如说话声、咳嗽声、呼吸声、内脏器官发出来的声音；有身体与外界物质接触摩擦产生出来的声音，比如走路声、拿东西的声音、穿衣服的声音、身体与物质的撞击声等等，是自己的如来藏与外界物质作用发出来的声音。其它宇宙天籁之音，是共业众生的如来藏共同幻化执持的。</p><p>声音的内涵还有很多，声音的属性有很多，声音的归属很难划分，很复杂。这些都是如来藏的作用，极大多数是共业众生的所有如来藏共同执持作用的结果，也都是地水火风四大的生灭变化产生出来的。</p><p>色尘、声尘、法尘与眼根、耳根和意根相触，如来藏生眼识、耳识和意识，然后就对雨点和雨点落地之声尘有了感知，继而有感受，那么色尘、声尘和法尘是如来藏出生的，眼根、耳根和意根是如来藏出生的，眼识、耳识和意识是如来藏出生的，所有这一切都是虚幻的，没有哪个法是有自主性的，都不是我，也不是我所有的，根本都是无我的。</p><p>观察到最后，我们就会发现到处都是如来藏的功能作用，哪里有五阴自己的真实性？根本没有，所以任何一个法里面都没有我，都不是我所有的，全体即真如。任何人也找不出来，哪一个事物哪一个法不是如来藏七大种子的功能作用，都是如来藏的作用，都要归功于如来藏。七识心还要依赖于如来藏广造众业，如来藏从来不分别，也不拒绝，有求必应，叫作千处祈求千处应。妙音观世音就是指如来藏，祂哪儿有事就到哪儿，还叫作不来不去。</p><p>内香尘、内味尘是自己的如来藏单独变现和执持的；外味尘、外香尘，是共业众生的如来藏共同变现执持的，这里也有很多复杂的因素。内触尘是自己的如来藏单独执持变现的，外触尘是共业众生的如来藏共同执持和变现的，这里也很复杂。同理，内色尘和内法尘是如来藏单独变现的，外色尘和外法尘是共业众生的如来藏共同变现的。六根、六尘和六识都是虚幻相，都不真实，都是如来藏所出生的，就像变现出的风声雨声一样，过而不能留。</p><p>我们现在听到的声音，其实是已经过去了的声音，声音发出来，传到我们耳根就有一段时间了；如来藏再变识心出来了别，那又过一段时间了；作出反应回应过去，又过一段时间了。识心在其它五根上的分别反应，也都是在应对着过去的尘境，没有当下。所以我们所做的一切，都是过去式，都不是当下。因此说，一切法都没有自性，都是如来藏的功能作用，都不是我。</p><p>十二、色尘的本质是什么</p><p>眼识所见的色尘都是刹那生灭的，这意味着什么呢？意味着色尘一刹那生一刹那灭，又一刹那生一刹那灭，这样连续不断的组成了无数个断续的色尘图案，只是这些图案太多连接的太快，以至于眼识发现不了色尘是无数图案连续起来形成的。每个图案是静态的，连续起来就好像是动态的了，好像是在不断演变着的。其实是断续的，就好像电影胶片一样，播放时，胶片转动的太快，就形成了连续的情节，叫作电影电视。</p><p>既然叫作电影，就是用电播放形成的影子，里面所有的人物和风景物品都是影子，不是真实的能接触到的物质色法。眼识所见的一切色尘都是如影子般不真实，是一种类似真实的假相，而且是静态的，看上去却感觉是动态的。所以我们不要相信眼睛所见的一切色法有真实性，有真实的作用，影子毕竟是影子，不是实物。既然叫作电视，意思就是说，只有通上电才能看得到那些连续不断出现的影子。那色尘如果要被意识看见，也需要通上电，这个电是指什么呢？</p><p>十三、饮食的内外尘是如何生灭变化的</p><p>吃饭这个法不一定就是意根的执着，佛到人间示现有饮食活动，诸大菩萨们也吃饭，祂们对饮食都没有贪着心，都不执著。有的众生吃饭是意根的执著引起，并且贪着色声香味触法，有的众生不执不贪，佛也不贪，菩萨也不贪，那吃饭是为了什么呢？是为了滋养色身，让色身有正常的五蕴活动来度化众生。普通人吃饭一方面是为了为了保养色身，另一方面有贪着性，显现着自己的贪嗔痴。佛菩萨吃饭的过程当中没有贪嗔痴烦恼，这是佛和普通众生的区别。</p><p>饮食是地水火风四大种子组成的，即使不嚼碎也是刹那刹那生灭变化的，四大种子生出来，刹那又灭回如来藏里，生出来又回去，总是这样生灭变化。这个饮食都得咀嚼碎了，也是四大种子组成，碎了的饮食变成细小的微粒了，最后变成最小最小的微粒，也永远是四大种子组合的，永远是刹那刹那生灭变化的。</p><p>众生舌根口腔牙齿接触到的饮食是外尘，舌识身识感觉到的饮食是内尘，牙齿把外尘咬碎了，身识触到的内尘也就碎了，最后外尘变成碎末进入肠胃里，身识和意识接触到的内尘也就进入到肠胃里，最后肠胃里的饮食都代谢没有了，甚至排泄出体外，身识意识接触的内尘就消失了。同理舌识和意识了别的内味尘在口腔里进入到食道里以后，就尝不到内味尘了，但肠胃里仍然有变异了的外味尘和内味尘，只是舌识尝不到，代谢排出体外以后外味尘和内味尘全部都消失。这些外尘和内尘的关系是怎样的，都是如何变化的？</p><p>十四、如来藏不是五蕴身和虚空一起组合成的</p><p>如来藏不是组合成的，祂不是组合体，组合的就是后天出生和形成的，就是生灭的。而如来藏是本来就有，不生不灭，任何法都不能组合成如来藏，反而是如来藏出生了一切法组合了一切法。如来藏不在虚空里，又与五蕴不相离，五蕴的所有运作当中都有如来藏的配合。如来藏通过输送七大种子出生了五蕴，五蕴身由如来藏输送的六大种子形成。</p><p>如来藏出生五蕴十八界，是直接输送种子变造的；而变造以后如来藏再显现五蕴十二处十八界万法时，是在已经变造成的外六尘的基础上，再次通过五根摄取六尘相分变造出内六尘，这样我们就能了别六尘境界了。就是说我们了知的内六尘相分，是如来藏通过五根，依据外相分，把外相分又重新变造一次，这就是六尘显现在心中的原理。</p><p>如来藏外无边际，不包裹着身体，内不与身体重合，无形无相无法与有形相的身体重合，更不会包裹身体。因为如来藏没有内外，就像虚空没有内外一样。如来藏不是世俗法，我们不能按照世俗法的理念来看待祂和认识祂，这样寻觅祂时，就不会增加更多的遮障了。</p><p>十五、生灭灭已，寂灭为乐。生灭的法就是五阴十八界全部世间法，这些法都是生灭性的。学佛通过修行，断我见又断我执以后，就有能力灭除这些虚妄的五阴世间法，这些生灭法都灭掉了以后，只剩下法身如来藏，如来藏就处于寂灭的状态，而如来藏无苦受，方便说为乐，叫作寂灭乐。</p><p>五阴是苦法，有五阴就有苦，阿罗汉们只想灭苦，修完四圣谛法成为无学以后，与世间缘尽，就要把五阴七识都灭掉。灭掉五阴就等于灭掉苦受了，灭了苦受，就没有苦了；虽然没有苦，但也没有世俗法性质的乐，因为世俗的乐也是苦，是不清净的。而涅槃之乐不同于世俗乐，是寂静无为的寂灭乐，不是世俗喧闹的那种乐，只是用世俗语言难以表达。</p><p>这个寂灭乐就是法身如来藏的无苦无喧闹的寂静乐，在这种乐里，没有一个受乐者，法身自己不受乐，因祂不觉境界；没有受乐的五阴身，没有不受乐而受苦的人，因为根本没有人的存在；法身自己也不受苦，在这种境界里，没有了苦乐受，也没有不苦不乐的受，一片无为寂静。</p><p>十六、实无众生得灭度者，这句话的涵义是，没有真正的众生相可得，也没有实际的灭度相可取，都是如来藏幻化出来的假相虚妄相，本质都是如来藏性。这些众生的五蕴相表面看好像是有，但是实质上，众生的五蕴都是幻化相。就像木偶人、机器人、电动娃娃一样，并没有真实意义的木偶人、机器人和电动娃娃。</p><p>那些机器人的一切活动都是人为操纵的，或者是人为设计好的程序，实质活动的不是木偶人，不是机器人，不是电动娃娃。就像一束塑料花，其实并没有花，只是一堆塑料而已，也没有机器人，只是一堆铁而已。同理，也没有真正意义上的众生，都是如来藏。所以菩萨度了众生都入无余涅槃，其实也并没有度着一个人，因为本就没有真实的人，也没有度相存在，都是如来藏的幻相，是如来藏和如来藏之间的相互作用。</p><p>十七、感恩我的真如心体，负载我一年又一年，一世又一世，一劫又一劫。不管我怎样，你总是无悔无怨，任劳任怨。在未来久远时劫，你都会一如既往地关怀我，照顾我，布施于我，而且将关注到我每一期生命终结。不仅如此，也将关注到我未来永久时劫，直至成佛，永不舍弃我。</p><p>你是我最忠实的仆人，也是我最忠实的管家，更是我最负责的主人。你比父母亲，比诸佛菩萨还要亲，再也没有比你更亲的人了。假如没有你，我是什么？我什么也不是，也没有我的存在。但是如果没有我，你也不能显现你的德能，不能显现你的影子；如果没有我，你也就不能有驻足处，虽然你不住在我这里；如果没有我，你到哪里能找到家？虽然你不把我当作家。</p><p>让我们永远相依相伴到永久，别舍弃我，明知你不会；我也不舍弃你，也根本舍不掉。我没有更好的言词来赞叹你，正好你也不听；我没有更好的礼物送给你，正好你也不需要。那么一切都免了吧！你会一如既往，而我要完完全全地改变自己。我发誓不再拖累你，不让你再与我一起趣于三恶道，发誓不再让你输送恶业的种子，发誓早日让你真常不变易，成为你自己原来的样子——真真实实的本来面目！</p><p>我们通常所认知的我，都是五蕴的假我，假我有生灭，能生灭的就不是真实的我。我如果是这个假我，假我五蕴灭了以后，我就消失了。正因为五蕴灭了以后，我不消失，就有一个真我，不灭的我才是真。那就有两个我，一真一假。</p><p>十八、五阴七识是如何看见花瓶的</p><p>看见花瓶时，有外界的花瓶，有我们心内的花瓶。外花瓶是共业众生的如来藏共同变现的，我们所看见的花瓶是自己的如来藏单独依据外界的花瓶，再次又变现出来的，是外界花瓶的影子，是外界花瓶的一个假相。</p><p>看花瓶时，有如来藏、第七识、第六识和眼识的和合运作，我们才能看见外界花瓶的影子。我们能看见花瓶的识心，是如来藏所生，所用的意根和眼根是如来藏所生，所看见的花瓶的色尘是如来藏所生。那我们就知道了，我们自己全体都是如来藏所生，实质都是如来藏，五阴十八界这个假我，都是如来藏所变现显现的一个假相。所以五阴非我，又不异我。</p><p>十九、色身与如来藏的关系</p><p>色身与如来藏是面包与面粉的关系，如来藏如面粉，五阴如面包。面包全部是由面粉制成，五阴都是如来藏的功能作用。雪地脚印，如来藏如雪，五阴如脚印。脚印都是雪，五阴都是如来藏。金与金首饰，如来藏如金，五阴如金首饰。金首饰全部是金，五阴全部是如来藏。</p><p>如果我说一切法都是如来藏，那就是没错，如果别人这样说，很可能就是错误的。因为我能如实观行到这个理，怎么说都有理，没有观行到的人，就是想象。证得到那个道理时，横说竖说，怎么说都不颠倒；没有证得，猜测和想象时，就不知其所以然。</p><p>一切法上都有佛性的运作，都是佛性运作的结果，所以楞严经中佛说：一切法都是如来藏性。佛性运作之后，如来藏才能造作，佛性相当于眼睛，心所法相当于手和脚。</p><p>二十、无情物中是否有如来藏</p><p>无情的意思就是没有识心，没有识心的所有功能体性，因此就没有识别力，没有心所法的运行。</p><p>但是无情也是如来藏所变现和执持的，是共业众生的如来藏共同变现执持。而多个如来藏如果要共同合作，只能输出四大种子形成四大，变现宇宙器世间、山河大地、花草树木等等无情物，不能输出识种子，因此无情物也是如来藏的功能作用，却没有众生五阴的功能作用。识种子的输出，是单个众生的如来藏的单独行为，能形成识心，有识心的功能作用，有心所法的运行，这就是有情众生。如来藏输出四大种子与输出识种子，所形成的法有区别，前者形成没有识心活动没有五阴身的无情物，后者形成有识心活动有五阴身的众生，都有如来藏的功能作用，只是作用不同罢了。</p><p>如来藏在五阴身中的运作，是与七识和合，配合七识心一起运作，能了别七识心行，让五阴身活活泼泼的。而多个如来藏与无情物没有配合关系，只是输出和改变四大种子而已，无情物没有心行，不是单个如来藏出生和运行的，在无情物中就没办法找到自己的如来藏，因此在无情物上就不能证悟，不能明心。而在五阴身的运行中，就能找到如来藏，能证悟，能明心。所以在阿含经中，世尊说：五阴非我，不异我，不相在。</p><p>二十一、四大组合的肉身——无情物木头，加入如来藏和第七识，成为有生命特征的有情，再加上六识，生命体就会出现五蕴的见闻觉知活动，有情就活活波波的。当六识消失时，五蕴活动就消失，有情只有生命的体征；第七识决定离身时，与如来藏一起撤离，有情就成为无情的木头，无觉无知。</p><p>如此看来，有情的见闻觉知活动是生灭无常的，不是真实的，是不可靠的。除了如来藏，一切法都是不可靠的。靠树树倒，靠山山崩，靠水水枯，一切都不可靠。佛子应该精进努力修行，世俗法一切都无所求，只向如来藏要法，紧靠如来藏，将来才能得大自在。内心里深深的种植无常的思想观念，莫等无常到来，无所适从。不要以为你能把握你所拥有的，你能控制周遭的一切，无常到来，一切都不可操控。</p><p>二十二、如来藏与生理反应</p><p>（一）听说梅子嘴里流酸水是什么原因</p><p>楞严经里世尊讲这段内容，是用来比喻想阴境界的虚妄不实性。想阴属于识心的了知性、执取性，以及意识的各种思想、观念等等心理活动。听说了酸梅，就了知了酸梅，继而内心起思起想，这都是想阴；口里流酸水，是行阴。由想阴导致行阴的产生，说明身心紧密相关连，互相影响，身体对识心能产生影响，识心对身体也能产生影响，识心的变化和运行，就能影响到身体，促使身体发生改变。</p><p>三能变识，如来藏、第七识和六识和合能出生和改变一切法，听说梅子这件事是三能变识和合而产生的，口里流酸水的现象，也是三能变识和合产生的，在这两种现象中，如来藏是同一个，第七识是同一个，第六识是同一个；而想阴里有此三个识的作用，行阴里也有三个识的作用，三个识所缘的法尘又是相同的，那么想阴就能与行阴相通，想阴就能影响行阴，耳听心想就能导致身根口中流酸水。</p><p>意识依从前的经历，知道梅子是酸的，从前吃过酸的，有过体验和经验，心里才有酸的反应。这些经验已经作为种子留存到如来藏里了，别人口说梅子的时候，耳根和意根同时对应那个声音，耳识意识就同时了知了其内涵，意根通过如来藏再把过去的有关梅子的信息输送出来，这些信息通过意根和意识对身体就产生了影响，酸水就流出来了。</p><p>（二）饿的感觉是如何产生的</p><p>食物在胃里消化掉以后，胃空了，意根了别此状况，想细分别，如来藏就生出身识和意识来了别饿的触尘。身根与饿的触尘接触，同时意根与触尘上的法尘接触，如来藏产生身识和意识，两个识就感觉到了饿的触尘，分别之后，意识出名言概念，定义这种情况属于饿，决定应该吃饭，于是把情况传递给意根。意根触作意受想，思量后觉得应该吃饭，于是决定吃饭。如来藏配合意根，出生六识，八个识和合运作，安排吃饭事宜。</p><p>饱饿都是触尘，是六尘之一，它是如何产生的呢？当我们吃饭，把饮食吃到胃里时，胃与饮食接触，就能感觉到饮食，是满还是没满，其实也是身识的感觉，满了，就是饱的触尘；之后，饮食渐渐消化，当饮食都消化了以后，胃里就空了，身识感觉饿，需要饮食来充填到胃里。</p><p>当然仅仅一个身识还不能感觉触尘，还必须有意识来同时配合感觉，触尘上同时还有法尘显现，意根与之相对，根尘相触，如来藏就出生身识和意识来感受饿的现象。六尘是如来藏变现的，触尘也就是如来藏变现出来的。饥渴冷热这些触尘也同理，是如来藏根据身体以及环境的具体情况变现出来的，然后身根再触这些触尘，意根触触尘上的法尘，如来藏就产生身识和意识，我们就感受到了饥渴冷热这些触尘。总之，如来藏产生六根，产生六尘，六根触六尘时再产生六识，根尘识三者和合触，才有众生五阴的各种分别活动，所以说一切法都是如来藏的妙用。</p><p>（三）如来藏是否根据业因业缘选择性吸收饮食中的营养</p><p>每个人的身体状况与前世的业种有关系，身体是正报，器世间生存环境是依报。一个人身体健康与否、高矮胖瘦都是由前世的业所决定。比如一个人的果报就是肥胖，即使吃很少的饮食，他也是胖；一个瘦人，即使补充很多营养，他还是瘦。饮食吃到胃里，如来藏会根据众生的业种业缘来选择性地消化吸收，肠胃功能也是如来藏根据众生的业种所显现出来的。</p><p>不同的人吃同样的饮食，业缘不同，消化吸收的就不同，身体的状况就不同。修行力度不够的人，就会受这些业缘的影响和限制，修行有力度的人，就能改变物质的结构成分，不受或者少受物质的影响。比如打坐修定比较好的，就能补充体内的营养元素，让身体获得能量，甚至比饮食的能量还要充足和有营养，身体会很健康，从而能减少饮食的摄取。</p><p>再比如达摩祖师，其禅定力非常好，他人多次给他饭里下毒，而他就能不受影响不中毒，他的如来藏能够不摄取饮食里的毒物，或者是摄取过来，就能改变毒物的四大成分，使饮食没有毒害作用。达摩祖师修行有功力，他的如来藏就能够改变毒品的四大结构，毒就不被身体吸收，身体能不受毒品的伤害。各人的如来藏功德力也是一样的，可是每个人的业缘不同，同样是毒品，其如来藏摄取的四大成分不同，变现的色身就不同。</p><p>（四）吃饭的整个过程是否都与如来藏有关</p><p>一切法都与如来藏有关，否则都不能存在。食物吃到胃里，经过消化，如来藏吸收食物中的地水火风四大营养物质，维持色身四大需求，变造色身，众生才能正常生存。其实我们分秒刹那都和如来藏有关，离不开如来藏。从看见食物，到取和摆布，然后吃、咀嚼、吞咽、消化分解，再然后吸收排泄，都和如来藏有关系，诸法不自生，不自住，不自异，不自灭，都与如来藏有关系。悟后大悟成片时，就会观察到一切法上都有如来藏的运作，没有一法能离开如来藏的。我们就靠祂生存着，是祂维持着我们生命的一切活动，给我们变现所需要的一切法。但是具体一切法是如何与如来藏有关的，这得靠自己参禅去悟得，别人不能帮忙这件事。</p><p>（五）吃五辛会生起淫欲和嗔恚，与如来藏有什么关系？</p><p>我们的饮食里都含有地水火风四大种子，每种饮食里的四大种子的比例不同，其营养价值也不同，对于身体的利用和影响也不同。身体吸收这些不同的四大元素，就会产生各种不同的生理反应。五辛里的成分，生的和熟的，其四大元素的比例也不同，元素和养分不同，对身体产生的作用就不同，那些物质成分里，有的就有使得众生产生淫欲和嗔恚的作用。比如五辛，生吃发淫，熟吃增恚，都是阻碍修行的饮食，让人的心性不能得到调伏。</p><p>这些饮食从吃进口里一直到咀嚼、吞咽、消化、吸收、排泄，都与如来藏有关系，身体上的各种反应都与如来藏有关系，都是如来藏随顺着各种因缘，而不得不配合变现的现象。不仅是五辛对身体和生理产生特殊的不良的影响，吸烟、喝酒、吸毒等等都会对身体和生理有不良的影响，这些物质里都有一些使身体受到刺激的成分，其四大的组成不同于其它物质，身体吸收到这些四大元素，心理就会产生不正常的情绪，不容易调控，从而心理状态也就会发生不好的改变，甚至会障碍智慧的出生，有愚痴的果报。</p><p>二十三、如来藏能否在色身上去后和来先</p><p>（一）去后来先作主翁的意思</p><p>去后来先的识，是指如来藏，作主翁的也是如来藏。去，是在五蕴灭去时，如来藏最后一个离弃色身，不亲自执持色身，色身就成为了尸体，同时如来藏与其他众生的如来藏共同执持尸体，使得尸体有生住异灭的变化，到一定时劫全部消失无余。死亡时，五识先灭去，其次意识再慢慢灭去，意根觉得没有活着的希望了，也随即离去，而不是灭亡。同时如来藏不能单独持身，也就随之离开色身，这个离开是方便语，没有更准确的表达语，不得不如此说。</p><p>来，是指最初的投生，众生在中阴身里投胎时，是如来藏入住受精卵中，是受意根牵引而入，意根也入住，这样就有了五蕴最初的名色，名色五蕴具足，就出生成为婴儿。如果如来藏不入住，受精卵不能成长，就没有名色，没有五蕴身，没有众生。这里的入和来，也是方便语，为了表义方便，不得不用，没有更合适的词汇来表达其意。</p><p>如来藏是众生的主人翁，生生世世造就众生五蕴身，执持众生的五蕴身，记录收存众生的身口意行，输出业种，实现众生的业因果报，如来藏是众生在三界六道里轮回的主体识，是众生脱离轮回，成就佛道的主体识。</p><p>（二）如来藏能否去后和来先</p><p>去后，是指最后与五阴身分离，最后一个离开色身，然后色身就成为尸体。来先，是指第一个先到色身当中，使得胚胎成为五阴身，有了生命的价值。如来藏能不能去后和来先，那就要弄清楚如来藏能不能单独持身。</p><p>如来藏能不能单独持身呢？如果如来藏能单独持身，那么在无余涅槃里，如来藏也可以单独持身，不需要意根的存在，不需要意根的动力。如果如来藏不需要依赖意根就能单独持身的话，涅槃就不是寂静的了，也没有涅槃境界，也就没有无余涅槃可说了。</p><p>实际上如来藏与意根是互相依赖的关系，没有意根的动力，如来藏就不会在五阴十八界世间运行，如来藏不可能单独运作。因为如来藏不是作主识，对一切法都没有主动攀缘和变现的心行，只有在意根和业力愿力的推动下，才能现起世间法。</p><p>而业力和愿力正是意根的推动力，当意根没有推动力，不想再出生五阴身时，如来藏就灭去一切法，不再现起五阴身，连意根本身也要灭去，不再现起。当意根还有业力和愿力时，如来藏才能随顺和配合意根现起相应的世间法。如来藏的运行刹那都离不开意根，离不开意根的业力和愿力，即使共业众生的所有如来藏在变造宇宙器世间时，也有共业众生的共同业力所推动，有共业众生的所有意根共同推动作用。</p><p>当众生的现世缘灭，应该舍身时，如果是如来藏最后一个离开色身，意根先于如来藏离开了，这种情况有没有可能发生？如果能发生，那么意根先走，就与如来藏分开了，这样的话，意根就单独存在了。意根是否能够单独存在，而不需要如来藏的执持？如果是这样，意根就可以不用如来藏输出识种子，就可以不用如来藏出生，那么意根这时是否能存在而不灭？如果能，意根也是一个不生不灭的能单独存在的识心，那就有两个不生不灭的识心。事实上，这是不可能的，意根必须时刻刹那依赖着如来藏而存在和运行，离开如来藏意根马上就灭亡，不能再运行。</p><p>因此可见，意根不能先于如来藏而离开色身，也不能后于如来藏而离开色身，必须是同时与如来藏离开。因为二者是互相依赖的关系，谁也离不开谁，如果分开了，一切法就消失，只剩下如来藏自己，就是无余涅槃境界了，而死亡以后不等于无余涅槃。</p><p>那么如来藏能不能第一个来到色身中呢？也不能，如来藏不能单独执持色身，祂没有攀缘性，不会攀缘色身而要主动出生和执持色身，是受意根思心所的影响，受意根和业力的推动作用，随顺意根刹那进入受精卵中执持受精卵，与意根同时入住母胎中。因为意根与如来藏形影不离，如来藏与意根形影不离，刹那都不能分离，分离了意根就灭亡，如来藏就不能再运行五阴世间法了，那就谈不到如来藏离开色身的问题，也谈不到如来藏入住色身的问题。</p><p>如果如来藏第一个入住母胎，就与意根分离，意根就能单独存在，不需要如来藏执持，这是不可能的。所以入住母胎时，离开色身时，没有先后，意根与如来藏同时入住同时离开。如果有先后，就说明二者能互相分离，那意根就能单独存在，如来藏也能单独运行，这样就不符合事实和真理了。</p></div>"
},{
    "title": "第二十八章　如来藏是一切万法的总源头",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二十八章　如来藏是一切万法的总源头</strong></p><p>一、一切法都是识，全体即真如，除此无他。一根草，都是识，何况其它，风不能自己吹，树不能自己摇，万物不能自己生了灭，灭了生。如来藏不生不灭，生灭的都是万事万物，都是如来藏作用出来的法。如来藏的本体不生灭，如来藏的用生生灭灭，三界世间法都是祂的用。这些用，都是七大种子的用，七大种子全体都是如来藏，一切法也全体都是如来藏。一切法好比都是金器，如来藏就是金子，看见金器，就应该看见了金子。</p><p>如来藏用心所法来运行起用，用种子生成一切法，用识种子出生识，形成心法。还有色法，色法是用五大种子生成的；还有一个见大，就是如来藏本身的见性，这样如来藏的一切功能作用就圆满了。如来藏自己还有识种子，也是刹那刹那地流注，形成了如来藏自己的了别性，而这种流注永远不会停止，除了佛地，因此如来藏就是永远不灭的。七识的种子流注有停止的时候，因此七识能灭，是生灭的，如来藏从来没有生灭过。</p><p>万法就是色法和心法，心法包括如来藏和祂自己的心所法，包括七识和七识的心所法，包括有为法和无为法。整个世界，就是这样，全体都是如来藏，全体即真如，整个佛法的纲领就是这样。</p><p>二、如来藏能生万法，任何一法都是如来藏出生的，不仅是万法，亿亿法无量法，都是如来藏所出生的。除了如来藏之外，都是亿亿法中的法，不管是虚空、空气，还是十方诸佛国土，没有一法能超出如来藏之外。如来藏叫作一真法界，没有一法能超出这一真法界。亿亿法就像孙悟空，如来藏好比如来佛。</p><p>如来藏是从哪里来的？如来藏不来不去，不生不灭，本来就有，法尔如是的存在。既然是法尔如是，十方诸佛也不能告诉我们为什么如来藏本来就是一直存在的。因为这不是诸佛发明创造出来的法，是佛通过三大无量劫的修行发现和证得了这个真理，再来为众生宣说。</p><p>佛在楞严经中也讲过，十方虚空生汝心内，如片云点泰清里。这就明白告诉我们，虚空是由心所生，而且在心中所占的位置极其渺小。因此说如来藏心，虽然是空无一法，但是祂广大又广大，无边又无边，包涵万象，一法不遗，任谁也跃不出如来藏之外。</p><p>三、观察手指甲，思考它为什么是坚硬的呢？原来是含地大的成分多，骨头为什么是坚硬的呢？地大成分多。骨头要想不松软和脆，就要补钙，为什么要补钙呢？因为钙里地大成分多。那么我们吃的饮食，都是在吃地水火风，都是在吃如来藏。吃穿住用，都是地水火风，都是在用如来藏，我们住在如来藏的宫殿里，享受着如来藏提供的一切种子。</p><p>我们看的是如来藏，听的是如来藏，嗅的是如来藏，尝的是如来藏，触的是如来藏，思的是如来藏；用如来藏看，用如来藏听，用如来藏嗅，用如来藏尝，用如来藏触，用如来藏思。中间六根媒介，还是如来藏，到处是如来藏，里外都是如来藏，这个五阴透明体，里外都不是人。</p><p>四、一切诸法，不离如来藏，而如来藏也不离一切诸法而运转。如来藏所在之处，即是一切法所在之处，只要如来藏不动，一切法都不动，岂有生灭去来诸幻化相？如来藏不动，意根就不动，六识也不动，五阴身岂有动？此法生，彼法灭，不过是如来藏大海里泡沫的涌动罢了，不出如来藏之外，也都是如来藏大海水一部分。</p><p>五、为什么法法皆真如尽大地是法王身</p><p>尽大地都是法王身，确实不假。任何一点点灰尘大小的地方，皆是法王所住持之处，法法皆真如，每个微粒微尘都是真如。法法都包括些什么？包括三界世间一切法，大到三千大千世界，宇宙虚空，小到微尘细菌，都是真如；百草头上西来意，寸草寸丝都不离自性，不离真如。证到这个境界，已经入到如来家，修行了极长的一段时间了。</p><p>为什么法法皆真如？因为所有的一切法都是由真如心体如来藏中的七大种子生成的，没有一个法能离开七大种子而能存在。七大种子生满世间，满华藏世界，满世界海，满一真法界。七大种子犹如皇帝的黄袍，如来藏犹如皇帝一般。皇帝满世界转，黄袍不离身，见到黄袍，就知道皇帝出现了。世间没有一处不是如来藏的土壤，没有一处是祂所不能到达的，没有一处不是祂的所在，没有一处没有祂的身影，没有一法不是祂。从空中到地上都是祂，山河大地尽露法王身，都是如来藏所变现出来的，都是依靠如来藏的执持才能存在的。</p><p>青青翠竹无非般若，郁郁黄花尽是法身，满世界都是佛。这些话真正理解并且证得了，必须要到初地以上的境界，世出世间无一法、无一处、无一时不是真如，法法皆真如，这是地上菩萨的现观境界，世间没有一法是能够独立存在、单独成立的，全部是真如所变，真如所执持，无论是生，还是灭，所有的变异，都是真如所为。</p><p>六、外法非实有，都是如来藏性；识心非实有，都是如来藏性。七识所见，就是如来藏所见，全体即真如，除了真如，什么法也没有。地上菩萨的妙观察智，能够现量观察一切法都是真如，无有别法。所以七个识的见就是如来藏的见，七个识与如来藏不一不异。</p><p>七、生灭法透视到最后就是无生的不生不灭如来藏法</p><p>一切法分为世俗谛和胜义諦，世俗谛从相上就能观察得到，这些相是虚幻出来的，是幻化的假相，虽然有极多虚幻的作用，有表面现象上的功能作用，也是不实的虚妄的。比如说众生的五阴，色阴有其虚幻的作用，这是不可否认的，虽然有作用，却仍然是生灭法，不是真实法，不可当真，不可执著；受阴、想阴、行阴和识阴，都是如此，有不可否认的虚幻作用，同样是不真实的、幻化的。</p><p>这些幻化的假相，仅仅是各种因缘聚合起来的，缘起性空，是谁给聚合起来的？是如来藏聚合起来的。如来藏根据众生的业种，用四大种子、六大种子，聚合出五阴世间一切法，表面看当然都是生灭的。而实质上，这些生灭法都是用如来藏里的材料造就的，本质都属于如来藏，一个都不出如来藏之外。那么从本质上看，一切生灭法也就是不生灭的如来藏，依如来藏也就不生灭，因为形成生灭法的六大种子不生灭，永远都能变造出这些生灭法，所以生灭法最终也是不生灭的。</p><p>八、心外无法，物不自物，因心故物。因此一切法都不是自然性，不是因缘性，而是如来藏性，这是楞严经中佛所说。所以不要说，世间有某个法能脱离如来藏，单独有其作用，不存在这样的事。风不自吹，水不自流，山不自立，火不自燃，都是如来藏使然。</p><p>不要说物体离开如来藏有万有引力，离开如来藏连物体都没有，哪里还能谈到引力。不管物理作用，还是化学反应，都离不开如来藏在其中的作用，离开如来藏就没有物质色法，哪里还能有物理化学反应。物质之间的一切反应变化，都是如来藏变化的结果，都是如来藏用四大种子的调控作用。</p><p>九、佛法的概论是，一切法都围绕着真如而展开，通往成佛之道，法法都不离真如。世尊一生讲法，全部围绕着本心如来藏而讲，离心无法，所有法的指向也都是如来藏真如。小乘阿含经中，也隐含着讲如来藏，有时也眀说如来藏，比如佛说：法不离如，法不异如。这个如就是如来藏，这里的法，就指五阴之法，十八界之法。佛又说：五阴非我，不异我，不相在，这个我就是指如来藏，阿罗汉无余涅槃里就只有如来藏。</p><p>四圣谛理不离如来藏，苦谛不离如来藏，依如来藏而有，众生造业后，缘熟时苦种子由如来藏输出，众生就受苦报；苦集谛依如来藏而有，众生造业的业种子由如来藏收存；苦灭谛依如来藏而有，灭的是如来藏中的苦种子；道谛依如来藏而有，离开如来藏众生就不能修道，修行所需的一切，由如来藏提供，修行落下的善法种子由如来藏收存，未来就能接续修行。</p><p>中乘十二因缘法，不离如来藏而有，由如来藏存入、输出身口意的种子，由如来藏存入、输出名色的种子和六入的种子，十二因缘每一支都因如来藏而有。而且辟支佛逆推因缘法，最后齐识而还，不能过彼。推名色的来源，推到如来藏，就推不下去了，最后就得出一个结论：名色就是由如来藏出生的。世尊说：识缘名色，名色缘识，意思是如来藏因名色而能显现出来，名色因如来藏而出生和起用，二者互相依赖。</p><p>大乘法更是处处围绕着如来藏的功能、体性、作用而展开，没有如来藏，就没有菩萨六度万行。种种修行都不离如来藏，种种法都不离如来藏，一直到成就佛果，全都依如来藏而修，并且存入修行的业种，未来才能圆满成就佛道。</p><p>十、一切生命的究竟皈依之处，即是一真法界，无有过于此者。三皈依，即是皈依一真法界，除此无有所皈！</p><p>一切众生皆有佛性，因此佛性皆能成佛。若不遇圣法，不遇三宝，若不在胜法中修行，终不能成佛。譬如家有宝藏，深埋地中，若不因贵人指教，终不能见宝而享财宝之乐。</p><p>十一、世俗法里有一句话叫作：万物生长离不开太阳。如果万物是依靠太阳才能存在，太阳又是靠什么存在的？一个事物一个事物地推，推到最后，总有推不下去的时候，这时就能推出一个最究竟的东西，不依赖他缘他法而自己就能存在的东西，这个东西不用出生，也永远不灭，因此才是最可靠、最可依赖的。</p><p>辟支佛们推因缘法，最后推到阿赖耶识，就推不下去了，于是就得出一个结论：识缘名色，名色缘识。这样万法的源头就推出来了，那就是阿赖耶识。五阴名色由阿赖耶识直接出生，其他的法都是此法出生的助缘，万物的出生也如是。我们学佛修行也要学会推理，那样的话很多法不用别人教导，自己就能证得了，明心证如来藏并不是很难。</p><p>楞严经里说过，太阳光不是从太阳而来，直接从如来藏当中来，同理，万物生长不是靠太阳，而是靠如来藏，是如来藏输送出四大种子，使得万物生长了；如果没有如来藏输送四大种子，无论阳光如何照射，万物也不能生长，反而要死掉，而且阳光也是如来藏输出四大种子形成的，一刹那也没有离开过如来藏。</p><p>学好楞严经，思路就能开阔明朗了，就知道一切法的生成和存在运行都是如来藏性，不是其他的什么东西，此物能生彼物，那是不可能的。因为此物是无自性的，是生灭的，不是长存的，那怎么能生他物呢？一切物都是从如来藏里直接出生的，其它的物只是助缘而已，物不能产生其它的物出来，物不生物，万法唯心造。一切法推到最后，不可再推时，就没有可还的了，那个不可还的，就是如来藏。</p><p>十二、柳树为什么能摇摆，它自己就能摇摆吗？有人说柳树摇摆是自然现象，是因缘所生，有人说柳树飘动是由于风力的缘故，可是世尊在楞严经中说：一切法非自然性，非因缘性，意思就是说都是如来藏性。离开如来藏就没有一切法，柳树不可能离开如来藏自己就能飘动起来，风如果离开如来藏，也就不存在，更不能起吹拂的作用。禅宗祖师说：心外无法，满目青山，一切法都是如来藏心里的法，满眼的青山都是如来藏性。</p><p>所有的因缘法，如果离开如来藏全部都不能存在，所以说一切法是自然而有的，是因缘所生的，都是戏论，实质都是如来藏所生。没有独立于如来藏之外的太阳、柳树、风和万物，没有离开如来藏而自己就能有作用的太阳和风，以及柳树摇摆等等现象，这些现象都是如来藏的大种性自性所生成的结果，同时不离众生的业力因缘。</p><p>风是由四大种子和合所生成，以风大为主，当大风刮起来的时候，为什么会带着呼呼的声音？甚至有时还有怒吼声？大海为什么会有惊涛骇浪声？这些声音也是物质色法，是如来藏用四大种子所生成。物质色法连续不断的生灭，就能产生所谓的能量，当地水火风形成的大风，由于自身种子生灭的过于快速，就形成了风速。风速不是实在的物质，是物质生灭现象的产物，也叫作能量，能量不是实在的物质，也是物质生灭现象的产物。</p><p>当大风不断生灭，造成不断的运动的假相时，形成的所谓的能量，遇到其他物体时，就作用于其他物体。由于运动的太快，能量太大，二者相遇，实际上叫作撞击，撞击以后就改变了物体的静止或者运动的状态，同时也要发出撞击声。风团越大，其能量越大，与其他物体相遇，产生的撞击声就越大，也就越能改变其他物体的走势，大海里的声音也是如此产生出来的。</p><p>十方世界任何一个小小的角落，离开了如来藏都不能存在，都不能有其自己的作用，都是如来藏的作用。所有众生的如来藏，分秒刹那都在运作着，不断地输出四大种子和七大种子，不断让万事万物生住异灭，没有一个如来藏是闲着无用的。各个如来藏都有自己单独的一亩三分地，需要自己去维护；还有共同的合作田地，需要共同维护，互相配合，可是都配合得天衣无缝。</p><p>众生在出生之前，外界的生存环境，所有有缘众生的如来藏运用大种性自性，就已经造就好了，然后众生才能生到这个世间，在世间生存。当众生还没有出生到这个世间前，他的如来藏就已经工作了很久的时劫，把世界造就完好以后，众生才能生到此世界。当这个星体要毁坏之前，所有众生的如来藏都要到其他世界去参与建造，造好之后，与这个世界缘尽，众生就要投生过去。我们的如来藏所做的工作极其繁多，而且是巨量的，却从来没有表白过自己，任劳任怨，不图名不图利，真不知道祂到底是为了什么。</p><p>十三、龙树菩萨偈：诸法不自生，亦不从他生，不共不无因，是故知无生。</p><p>龙树菩萨这段话的意思是，诸法本身自己不会出生自己，也不会从其它的事物当中出生。就是说，一个事物不会出生另一个事物，诸法也不是自己和他缘互相和合而生出来的，也不是没有出生的因就能出生的。最后一句话的意思是，诸法的出生是有因的，不是无因就能出生的。</p><p>那么因是什么呢？根本因是实相心如来藏，万法都来自于如来藏存种子的心体，不是什么神灵或者是上帝创造出来的，万法真实的因就是如来藏，源头就是如来藏。因此诸法是有生之法，有生就有灭。虽然有生，也没有真实的生，都是虚妄的幻化出来的，虽生而不生，妄相罢了。</p><p>真正无生的法只有如来藏，祂不是生出来的，是本来就有的，祂无始，因此也就无终；有开始，就有结束，无始才无终。</p><p>十四、为什么我们这个世界四季交替，冬天太冷，夏天太热，有时阴雨连绵，有时冰雪不断？</p><p>这是众生的恶业所感召的，过去世造作的恶业存在各自的如来藏里，缘熟时，如来藏就会输出恶业的种子，众生的果报就会现前。生存环境是依报，是依赖众生的五阴而有的，五阴身是正报，是真正受苦的主体。这些果报都是如来藏变现出来的，这些生活环境的不如意，其来源就是如来藏，都是祂输送出来的四大和六大种子，形成了受苦报的五阴和恶劣环境，把我们的世界变出了冷热等等各种苦难。</p><p>如果我们去找如来藏算帐，如来藏就会说，去找意根算帐，我只是随顺，并不作主宰，不是主动要变造出这一切苦报的。如果去问意根，愚痴的意根就说不出个所以然来，祂就得赶快让意识分析是怎么回事，意识就得用佛法当中的因果等等理论来思考分析认证，然后报告给意根，意根知道了，就会让身口意小心行事，莫再造业。</p><p>我们今后无论再遇到什么不如意的事，都要去找如来藏，来源就是祂那里，都是祂弄出来的。但是也不要冤枉祂，顺藤摸瓜，最后就要归结到意根自己这里来，意识的自己也有一定的责任，这二者是主犯，是主要的教育改造对象。我们修行就是要教育改造意识和意根，改造好了，世界就变得美好和圆满清静。</p><p>十五、物质色法不会自生自灭，如果物质色法能够自生自灭，自己出生，自己就能自动灭亡，那么就说明物质色法有真实存在的自体性。既然物质有自体性，那就不需要如来藏来变现和维持它的存在，物质就不是如来藏所产生和执持的，那么如来藏就有不遍之处。</p><p>那物质色法到底是由哪里来的呢？总得有个出处才行。即使是从天上掉下来的，也是个出处，但是这个出处，是不可能存在的，因为天空里能掉下来东西，能出生物质，那就不是天空了。我们找来找去，只有如来藏能够出生物质色法，因为如来藏的四大种子，能够生成物质，其它一切法都是如来藏所生，都不能再出生物质色法。</p><p>这些色法被如来藏出生以后，如来藏仍然会执持着出生以后的色法，所以色法就有生灭变异的现象存在。而且是刹那地生灭变异，如来藏仍然要刹那地输送四大种子不断的改变着色法，所以物质要慢慢地产生变化，最后就消失。如来藏是遍一切处，遍一切法的，没有一个法上没有如来藏的执持，如果没有如来藏的执持，任何一个法都不会存在，如来藏没有不遍之处，因此整个大千世界就是一真法界。</p><p>大多数时候，我们福德不够，因缘不成熟时，佛经当中所含藏着的很深的一句话，我们轻易地错过去，把这句话当作很稀松平常的语言忽略过去了。而所有人都要修行一个无量劫，二个无量劫，甚至三个无量劫，才真正地悟得这句话的全部内涵。一真法界，这四个字，我们要修三个无量劫，才能彻底弄清楚。差别就在于各人的福德、定慧、心性等等各方面的条件。多修福修定，尽量降伏烦恼性障，让心性调柔，把内心当中的我，逐渐剔除，再剔除，降伏再降伏，就能证得人法二无我，虽然这是非常不容易做到的，也要努力去做。</p><p>十六、我手拿鼓槌敲鼓，咚咚咚的声音就出来了，这个鼓声是从我手里出来的，还是从鼓里出来的，还是从空中出来的？不敲鼓了，声音消失了，鼓声又到哪里去了？这个鼓声原来存在哪里呢？</p><p>一切法由于各种因缘而出生。那个鼓声以及一切法，生时也没有一个生处，灭了也没有一个灭处，来无所来，去无所去，全部都是虚妄。因为一切法都是因缘所生，被生出来的即是空的幻的。</p><p>佛说：有因有缘世间集，有因有缘世间灭。这些法是从小乘法的角度来讲的，如果从大乘法来说，一切法都有个出处，万物无过出处好。好在哪里呢？一切法都由如来藏所生，无有一法能脱离如来藏之外的，都不出如来的手掌心。</p><p>鼓、鼓槌，以及鼓声，都是如来藏依据各种缘，输送四大种子产生出来的，所以叫作因缘所生法，因缘所生法，佛说即是空。一切法都由自心所生，这个心是如来藏如来藏，也即是阿赖耶识。然而单有如来藏也不能产生出任何法，必须还有妄心七个识和业种，真妄和合运作，才能产生法。因此在任何一法上都有真心和妄心的运作，在五阴的一切法上排除妄心、妄相、妄境界，剩下那个不动心的，就是真实法如来藏。</p><p>十七、问：我屋子里面的电视机和桌椅板凳，是我自己的如来藏幻化出来的，还是有情众生各自如来藏共同幻化出来的？</p><p>答：外界的一切事物，都是由共业众生的如来藏共同变现出来的，一个众生的如来藏不能单独变现外界的任何事物。因为在任何一个生存环境里，都不是只有单独的一个众生存在，而是有无数的众生存在着，那些生存环境是属于共业众生的。所以共业众生的如来藏就会依据大种性自性，形成共同的地水火风四大种子，然后共同用这些四大种子变造外界的一切事物，包括宇宙器世间。</p><p>等到每个众生自己了别一切事物时，众生自己的如来藏，再单独把外界事物的外相分，在大脑胜义根处变成内相分，形成影像，内六根触内六尘影像，如来藏再出生六识，六识就会了别这些事物的影像，之后众生就认为接触的是真的外界事物。所以众生所了知的一切都是自己的如来藏单独变现的内相分，内六尘内相分都是幻化不实的，凡所有相皆是虚妄，就是这个道理。</p><p>自己房间里的物品，也是有关联的共业众生的如来藏共同变现的，没有关联的众生，他们的如来藏就不参与变现。众生自己接触到的一切六尘境界，都是自己的如来藏变现出来的内相分，与他人无关。外面的好像真实的桌椅板凳、电视机等等，是有关众生的如来藏共同变现，包括制造桌椅板凳的人，这些众生能够共同感现出桌椅板凳和电视机。自己看到时，自己的如来藏再变现一次，成为自己心里的影像，自己看到的就是一个影子。</p><p>十八、佛在楞严经中说，白天的明亮也不属于日色。那么手电筒的光明是从哪里来的？</p><p>楞严经中佛说：（一切法都是）非自然性，非因缘性，皆是如来藏性。为什么是这样呢？因为一切法都是如来藏所生和变化出来的，都来自于如来藏，不是来自于因缘法，因此都是如来藏性。比如植物是借助于植物种子、土壤、水分、温度、阳光而生长出来的，实际上是如来藏出生的，不是由这些物质的东西出生的。因此说一切法不是因缘性，不是自然性，而是如来藏性。</p><p>世尊特意举例说明，虽然太阳在天空中照耀，可是光明并非来自于太阳，而是说光明本如来藏性。意思是说太阳发光是表面现象，太阳里没有光明，虚空里没有光明，而有一部分有缘众生能看到光明，这说明光明是来自于如来藏。光明是借助于太阳这个缘，而由如来藏生出来。光明是色法，由地水火风四大种子构成，只有如来藏里有四大种子，能够形成光明，太阳和虚空都没有四大种子，不能产生光明，因此光明就是如来藏性。</p><p>同理，手电筒的光亮也不是来自于手电筒，而是借助于手电筒的缘，由如来藏生出来。这个光亮也是由地水火风四大种子构成，手电筒里没有四大种子，虚空里没有四大种子，光亮只能是由如来藏形成，来自于如来藏。万物表面看是由某物生成，其实龙树菩萨在中观论里说道：诸法不自生，也不从他生，也不无因生。意思表明都是如来藏生，这是地上菩萨的道种智的实证内容。</p><p>比如说草木表面看是由草木的种子生出来的，实际上草木的种子也是如来藏所生，草木种子没有自体存在性，因此就不能再生其它法，没有四大种子故。草木不是由草木的种子直接出生的，而是借助于草木种子，由如来藏所出生，种子生草木是一种表面的假相，实际上都是如来藏用四大种子生出来的。就像孩子表面上看是由父母生的，实际上是自己的如来藏出生的。</p><p>又比如说，桌椅板凳表面上看，好像是木板制作生成的，实际上是由如来藏的四大种子形成的，木板也是由如来藏的四大种子生成的，被生之物，没有自体性，就不能出生他法。又比如房屋好像是由砖瓦泥土和合生成的，实际上是由如来藏的四大种子形成的，是如来藏所出生，包括组成房屋的各种材料，都是如来藏的四大种子所生成，都是如来藏性。一切法的形成最终以及开始，都要推究到如来藏那里，那就一点错也没有，就符合世尊所说的都是如来藏性的这个真理，那就是真正的佛子，而非外道种性。</p><p>这个世界，那个世界，不管它是什么世界，这个东西，那个东西，不管它是什么东西，一律是如来藏直接变造。但是功也不都在如来藏，意根有份，若不是意根末那的作意和思，如来藏也不奈何，任祂有千般本事，也无计可施。这第一能变识与第二能变识，和合演变一切万法，如来藏知末那识的心行，无私无我，末那则抓取一切功劳，为我我我，就像窃贼，盗取他财。这其中也不能少了第三能变识，意识不断筹谋策划，分析推理，出谋划策，如何有利于自己，然后告知意根，意根得知，思量不已。最后决策，六识执行，最终结果，意根受用。如来藏站在圈外，看这一切，与己无关，真正是个清净主翁。</p><p>十九、如来藏是生万法的因，但孤因又不能生万法，必须是如来藏依靠各种缘，含藏万法的种子，才能生万法，也要依赖意根的执取。缺少一缘，如来藏都不能生万法，必须业缘成熟，缘具足，这是生万法的条件。而如来藏本身是不生的，是本来就有的，不用什么来生祂，也根本没有能生祂的事物和理体。如来藏为天地之始，万物之先，法尔如是，没有道理可讲。因此如来藏就是独立自主的，不需要依赖他缘就能自己单独存在。如果是被出生的，祂就得依赖出生祂的事物而存在，不能独立。</p><p>这不是能够让众生容易理解的浅显的世俗法，出世间法不与多数众生相应，所以众生很难理解。在佛地，世尊的真如心要产生世尊的五蕴身，也需要各种缘，讲出三藏十二部经也需要各种缘，制定戒律需要各种缘，度各类众生需要各种缘，每做一件事都需要各种缘，孤因不生法，法仗缘而生而现。</p><p>世尊到娑婆世界来，也需要很多的缘，在没有来人间时，世尊就得观察娑婆世界众生的缘成熟没有，何时成熟。众生修行的缘成熟，世尊降生的缘就成熟，世尊还得派先遣部队来到人间，等候世尊降生，一起配合世尊弘法。世尊成道后，宣说三乘法需要很多的缘，不是世尊自己就能够决定如何就如何的，都得看众生的缘，以及其它相关的缘。</p><p>二十、永明延寿禅师《宗镜录》片段释义</p><p>原文：<strong>伏以真源湛寂，觉海澄清，绝名相之端，无能所之迹。最初不觉，忽起动心，成业识之由，为觉明之咎。因明起照，见分俄兴，随照立尘，相分安布，如镜现像，顿起根身。</strong></p><p>释：伏以真源湛寂，觉海澄清，绝名相之端，无能所之迹。这是在说如来藏的体性，如来藏是真实的，而且是万法之源，祂清净寂灭，不动不摇，也有觉性，能觉万法，所以叫作觉海。如来藏本体无一切名相，无眼耳鼻舌身意，无色声香味触法，无眼识耳识鼻识舌识身识意识，无三界世间一切法之名与相；其自身之名也是虚名，不管叫祂什么，都是后人假安立。祂既无七识的能见性，也无六尘的所见性，无能又无所，绝于七识的能所性。</p><p>最初不觉，忽起动心，成业识之由，为觉明之咎。无始劫前意根与如来藏在一起同时存在，因为无明，意根不觉法界之实相，忽然心动，起心向外贪求，如来藏随顺之而现根身器界，于是业行出现，第七识就成为了业识，一切生死过患由此而生。其生死过咎在于意根起心想要明觉三界世间，不守本心自性。</p><p>因明起照，见分俄兴，随照立尘，相分安布，如镜现像，顿起根身。因为意根有想明了的心念，就起觉照，想见世界，于是七识的见分顿时就生起来了。因为有见分想见，必有所见的相分尘境出现，如来藏随顺意根就现起了六尘相分，能和所就这样安立出来了。之后如来藏就像镜子现像一样，立时现起了根身器界，五阴身就出现了，这样三界世间就安立出来了。</p><p>二十一、佛不是万物的创造者和主宰者，而是真理的发现者和认知者。万物的来源是众生的如来藏，主宰万物的表面来看是众生的业，由意根攀缘，如来藏随顺着就现出万物；实际上还是众生的如来藏，由如来藏依业缘来产生和创造万物。众生因为业缘而有因缘果报，有生死轮回，又因为有如来藏，众生才有一期一期的生命活动，而这些都不是由佛来主宰的。</p><p>但是这些道理是佛通过三大无量劫的修行，彻底认知了这些事实真相，发现众生生死轮回的根本原因和宇宙万物的运行规律，佛把自己所发现和证得的真理宣示给众生，让众生也证知这些真理，从而究竟解脱。而这些真理，不管佛发现与否，都本然地存在着。众生的如来藏也是，不管发现与否，祂都本来按照祂自己的律则运行存在着。发现，是事理本来就存在着，有人去把祂揭示出来，不是后天人为产生出来的，以后也不会消失。发明，是本来没有，人为地创造出来，先无今有，因缘所生，有后还无，是虚妄幻化的。</p><p>二十二、<strong>佛说：观因有事，观事有因</strong>。自心如来藏是万法的根本因，当我们找到如来藏的时候，就知道祂一定要出生一切法，发现祂时，就知道祂所在之处就是祂变现的。六根是祂变现的，六尘是祂变现的，六识是祂变现的；蕴、处、界和合而显现的一切法都是祂变现的，一切事上、一切法上都有如来藏的运作，如来藏是一切法的起因。那么当我们接触到一切人事物理时，就应该知道，这里一定有如来藏，任何一种现象当中一定有如来藏的存在。</p><p>事和理一定是连在一起的，而且圆融无碍，没有单独存在的事，理也一定和事在一起。当如来藏之理单独存在时，没有七识和五蕴，那就是无余涅槃境界。单独的理存在的时候，就没有我们了，没有能知的心，也没有心所知的事，清清静静地只有一个理——如来藏，这种情况是例外，其余都是没有单独的理存在的时候。理事涵容，理事互摄，是现量又是现实，圆满无碍，真实不虚。</p><p>二十三、万法唯心造。这个心是指什么？一定是指如来藏，除此都不能创造出生万法。因为七识心本身都是不自在的，不能自主的，生灭变异的，没有实体，也就不能存种子，无论用来创造万法的七大种子还是业种，七识心里都没有，那七识就都不能出生任何法，只能把如来藏出生的法在心里投个影子，落个影子，显现一下影子，别的就无能为力了。</p><p>在灭尽定里，没有六识，胜义根里的相分是谁变造的？睡着了没有六识，六尘境界是谁变造的？昏迷了没有六识，六尘境界是谁变造的？都是如来藏随顺业种变造出来的，意根起配合作用，因为意根执身，五根就能有用，如来藏就会通过五根传导五尘的影子。六识是不能变造了，因为没有六识。一切法唯心造，与万法唯识，两句话是有差别的，万法唯识，意思是说万法是通过八个识显现出来的，凡夫五阴七识中缺少一个识，某类法就不能显现出来，但是那类法在客观上可能还是存在的。</p><p>唯心宗就是一切法唯如来藏出生，七个识也算在如来藏里，是如来藏心体所出生的法。唯识宗唯八个识，七个识隶属于如来藏。没有一个法门不是如来藏演派出来的，没有一个法门离开如来藏而能成立。一切法门都是如来藏里的法门，都是如来藏的分支。空门就是如来藏解脱法门，空宗就是如来藏空性宗。</p><p>只有具备唯识种智的地上菩萨，才能观察得到，一切法都是唯如来藏所造，一切法都是真如。其余人都观察不到，如果有漏掉的部分，不是如来藏所造，那就是如来藏心外还有法可以存在。那么这个观点，就是外道的观点。地前菩萨都难免有一些外道思想，所以不入如来家，不是佛的亲儿子。内道与外道，只是一念之差。</p><p>二十四、生死的总源头是什么？生死从哪里来？谁产生的生死？生死依什么而有？因为有阿赖耶识，才能现出五阴身，从此有生死。因为阿赖耶识能收存生死业种，也能输出生死业种，众生才有生死。阿赖耶识是真空，生死是妙有。在无生死当中，假现生死，生死即是涅槃，阿赖耶识是涅槃心。生死与阿赖耶识不一不异。生死全是阿赖耶识，阿赖耶识不是生死。阿赖耶识是大海，生死是泡沫。生死即涅槃，所有的生死现象都是阿赖耶识所变现所幻化，没有真实的生死，生死是假象，实质都是阿赖耶识。</p><p>二十五、问：我理解楞严经里的意思是，当闻性归属于如来藏来讲的时候，是不生不灭的，归二乘声闻解脱道来讲的时候就是生灭性的吧？</p><p>答：从地上菩萨的唯识种智证量来说，观察三界万法，都是如来藏用七大种子出生，都是如来藏。从明心还没有唯识种智的人角度来说，三界万法与如来藏不一不异。如来藏的闻性就是不生不灭的，耳识的闻性是生灭的。唯识上说，耳识的闻性也是如来藏的闻性。从般若上来说，耳识的闻性与如来藏的闻性不一不异。</p><p><span>未完  接<strong>《细说如来藏 第三部》</strong></span><br/></p></div>"
}]