[{
    "title": "第一章 如来藏的功德体性",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  如来藏的功德体性</strong></p><p>一、八识颂</p><p>一母生七子，七子各不同；老大凭母贵，作主并掌权；</p><p>老二善筹谋，处于总管位；其余五兄弟，做工并赚钱。</p><p>母尊勤养育，主者号司令；管家精算账，五弟奔波苦；</p><p>母慈儿娇纵，老大常逞威；老二随风倒，五弟打砸抢。</p><p>一旦恶报来，全家苦逼身；管家为生计，返学家母贤；</p><p>学后劝老大，善恶终有报；老大心开通，生活渐转机。</p><p>母贤感子孝，七子咸归首；老二聪敏慧，贤达最像母；</p><p>督导大哥主，引领诸小弟；全家齐向善，终至福无量。</p><p>入胎识不入胎，假名入胎；住胎识不住胎，假名住胎；出胎识不出胎，假名出胎；入身识不入身，假名入身；离身识不离身，假名离身；涅槃识，不涅槃，假名涅槃。</p><p>如来藏有多不容易，既当父又当母的照顾几个不懂事的孩子，所以祂的能力也有不到之处，不得不随孩子的无明造善恶业，供吃供喝随行造业，七子于是无始劫中流浪造恶，不知回头。但母始终不离子，惺惺相惜。直到遇到佛法因缘，七子才开始熏修，去除无明，稳坐佛位。</p><p>二、为什么法界不增不减？</p><p>不增不减有几层含义，法界所有众生如来藏的总数不增不减，如来藏的体性在圣不增在凡不减，如来藏的七大种子数目不增不减。法界六根不增不减，法界六尘不增不减，法界六识不增不减，色受想行识五蕴不增不减。因为现象界如幻如化，无本体性，不曾增减；幻生幻灭总不可得，所以不增不减；一切法因缘和合，本不实有，不曾生也不曾灭，所以不增不减。能这样理解法界非常有智慧，虽然是意识的智慧，也很好了，能指导观行实证。</p><p>如来藏不增不减，意根也不增不减，无量化身、无量的六识身都统摄到如来藏和意根这里。化身也是众生，现象虽有增减，性不增减，本体不增不减。化身虽然也是众生，但是也要统摄到意根报身上，因为意根报身是唯一的，所以化身也是不增不减的。</p><p>众生之所以为众生，是因为有一整套道具，包括八个识，也可以包括色身，主要有意根和如来藏，以七八识为主，七八识不增不减，化身就不增不减。法身是如来藏，报身是第七识意根，化身是六识，诸佛菩萨不管有多少个化身，都是依法身和报身而有，归属于法身和报身，单独不能有化身，化身单独不能算作众生，不自在不自主故，所以化身也不增不减，法界不增不减。</p><p>三、如来藏无无明也无无明尽</p><p>心经所说的无无明也无无明尽，是指如来藏没有无明，所以如来藏也没有无明尽，祂不用破除无明，不用断除烦恼，不用修行，不用解脱，也不用成佛。七识五阴却不能如此，七识五阴有无数的无明，因此就需要修行以破除无明，无明破尽时，才能究竟清净，得大自在大解脱。在破无明的时候，需要修行，需要持戒，需要禅定，需要学习般若智慧，需要参禅悟道，需要断烦恼，需要证悟，需要成佛。成佛之后七识五蕴就无无明了，也不用修行以灭尽无明了。</p><p>四、如来藏的不动性</p><p>如来藏不动的是心思心念，其心不随境界来去而动转，不执取一切境界相。但是在心不动的时候，还要刹那刹那出生万法和维护万法。一切法都是祂出生的，祂的工作非常多，但尽管多，心地却是无为的，不动心思和念头，也不觉得繁忙。</p><p>不管五阴七识造作什么业行，如来藏都不随之动心思，没有任何想法；不管什么业种现前，如来藏都没有情绪和感觉，不断的随业种而显现诸法，但又与一切法无关，任尔东南西北风，我自安然不动如须弥。不变随缘，随缘不变，不受染污，不随流失去自性，不与万法合流，不与万法为侣，说的就是如来藏。</p><p>五、如来藏的圆成实性</p><p>性就是性质，事理的性质，没有性字就代表事理本身。如来藏的圆成实性，是指如来藏本来能够圆满成就诸法的功德性，能够圆满成就一切法，使得一切法都能如实显现出来，如本然那样存在，不是五阴七识所能促成的，如来藏本来就具足此性，不用后天修行来成就。除如来藏以外的所有法，都是由如来藏用自身当中的种子圆满成就和出生的，都带有如来藏的性质，也可以方便说为圆成实性。</p><p>三恶道众生都有如来藏的圆成实性，否则就没有三恶道，也没有众生。六识和五根六尘是依他起性，事理本身的性质是依靠他法而生起来的，不是自主的，不能单独存在。第七识意根是遍计所执性，意根本身是遍计所执的识心。</p><p>六、如来藏的不生不灭性</p><p>真心不可得，也不可失，不失不得是什么意思？那就是不生不灭的意思。不生，就不得，因为是本来而有；不灭，就不用生，那也不用得。真心本身就是无为法，不用你去达到无为，修出来的无为法是七识的无为，也有灭的时候，所以仍然是生灭法。</p><p>真如无为不生不灭，伴随着如来藏，如影随形。如来藏无形无相，互相之间包容，互相合作，共同成就一切法，但相容也没有容的相，只是不相排斥。佛的如来藏与众生的如来藏也是一样，互相合作，互相包容。因此众生的如来藏不用融入佛的如来藏中，如来藏不是色法，无里无外，不能互相进入和融入，色法才能互相融入进入。</p><p>七、如来藏不来不去</p><p>如来藏遍一切处，是遍五蕴世间一切法处，只要有五蕴世间法之处，一定有如来藏在执持着。如果如来藏不再执持某个法，某个法就灭去不现。</p><p>如来藏不生不灭，无形无相，不来不去，在每个法上都没有来去相，但是如果观察五蕴世间法的生灭相，就能知道如来藏的来去相。法出现了，表明如来藏来到这个法中，法灭去了，表明如来藏离开这个法了，其实不是如来藏在法中来和去，而是如来藏用种子把法生出来，法上就有如来藏的执持作用了，如来藏不再执持法，把种子收回去，法就离开如来藏灭去了。</p><p>同理，如来藏没有到五蕴中来过，也没有从五蕴中离去过，而是如来藏用种子把五蕴生出来，五蕴就离不开如来藏，与如来藏有关联了，如来藏收回种子，不再执持五蕴，五蕴就消失灭亡去，与如来藏分离了。而在这其中，如来藏从来不用来去，从来没有动过，是五蕴世间相有来去，与如来藏相聚散。所以说如来藏不来不去，没有时间空间和距离之说。</p><p>八、如来藏不出不入</p><p>有出有入之法是生灭变异法，不是常住法，因此如来藏也不入无余涅槃，也不出无余涅槃。如来藏不在无余涅槃里，也不在无余涅槃外，涅槃无里无外。</p><p>如来藏是被世俗所遗弃法，不与世俗一切法为侣。世俗法五蕴十八界都灭去以后，如来藏不随之灭去，安然独立，所以才有无余涅槃，否则连无余涅槃也没有。如果五蕴十八界灭去以后一了百了，什么也不存在，也就没有后世后后世了。五蕴十八界出生以后，如来藏也不随之而出生，因为如来藏本来就有，现现成成的，不用出生。</p><p>九、如来藏非我非非我</p><p>如来藏非我非非我，既是我也不是我，这个道理甚深又甚深，唯有常乐我净的佛地如来藏才是真正的我、不变异的我，佛地之前的如来藏不是常乐我净的，都不完全具有我性。五蕴是苦空无常无我的，如来藏出生的一切法都是生灭变异无我的，不久长的，不可执取的，也执取不到的。而众生的如来藏却不是苦空无常变异的，祂心里也没有我，不认为有我的存在，不具备作主的我性，心体里还含有生灭变异的染污业种，导致如来藏非常非乐非我非净。直到佛地的如来藏无垢识里灭除了染污业种，种子不再生灭变异了，才有真正的我性，才是真正的我。</p><p>十、真如的两种含义</p><p>真如有两个含义，一个是指真心之体，就是如来藏，一个是指真心的性质，就是如来藏的真实性和对待万法的如如不动性。无论真如是什么意思，都是无为的。但是真如如果指心体本身，那就是不生不灭的；真如如果指真心的性质，那就是不实之法，因为性质依本体才能存在，本体才是真实的，性质是对本体的说明和表述，当然就不是真实法，不是自在法。比如说一件衣服是本体，是真实存在的，而描述衣服的形容词，如：漂亮、大方、合体、华贵等等，依附于衣服才能有，有也没有实体，碰不着、触不到、穿不了，只能欣赏和感觉，这些形容词表述的都是不自在的，不是真实存在的，不是本体。</p><p>真如也是这样，如果是用来形容如来藏本体的特征的，与美丽、大方、华贵这些形容词是一个性质，就不能代替本体了。自在的法只有如来藏本体，不生不灭的法只有如来藏本体，而如来藏的性质却是假有的，人为命名的，不是实有的，不是不生不灭的真实法本体。</p><p>十一、如来藏的真如性 </p><p>真如的意思，就是指法界的原貌，法界的真实存在而不变异性，法界的如实实在性，法界的本来性。法界是指诸法的界限，诸法的边界，诸法的界定。诸法实质统一都是如来藏，都是如来藏的性质。</p><p>诸法为什么都是如来藏的性质？因为诸法都是由如来藏所生所变，是如来藏用七大种子圆满呈现了诸法，诸法都是七大种子的性质，就是如来藏的性质。如来藏按照业种如实呈现诸法，不违背法界规律和运行原则。如来藏在运行诸法当中，心不被诸法所动，始终保持本心的清净无染性，保持原本的真实不变性，保持如如不动性。</p><p>虽然诸法各有其世俗法相，可实质上还是如来藏的相，也就是真如相和真如性，所以一切法统称为一真法界。诸法表面看似都在生灭变异，看似都在动，实则都不动，不增不减，不变不异。无论世俗界如何闹如何动，法界本然，静悄悄，寂然不动。所以我们闹个什么？求个什么？取个什么？把心摆平，随缘度日，也不作度日想，就会合于真如性，寂静解脱。</p><p>十二、真如不守自性不是真如无有自性</p><p>真如不守自性的意思是，如来藏不住在本位一无所有的状态，而流注出心体内的种子形成了三界万法的有。那这种真如就是指如来藏本体，如来藏本体当然是有其自体性的，是不同于所有世俗法的体性的。如果真如第八识如来藏没有自性，那就是不自在的，是被出生的法。只要是被出生的法，都是不自在的，没有自己单独体性，没有自己单独的体性就不自在。而真如第八识如来藏永远有自己独特的体性，永远不变异，因此是大自在的。</p><p>涅槃无自性，因为涅槃是如来藏的一种清净状态，是一种独存的状态，而状态就不是有自体性的法，是一种显示法，是用来衬托如来藏的。如果真如不是指如来藏本体，而是指如来藏的真实性如如性，是一种性质，那么这种真如就没有自体性，无自性。</p><p>既然说，真如不守自性，那就说明真如如来藏是有自性的，就是空性。如来藏含藏种子又有不空性，能随缘变现万法，但是在变现万法的时候，本身仍然是空性的，并不是有性，祂本身并不是万法。因为真如如来藏有空性这种自性，所以才能成就万法。如果真如如来藏没有空性这种自性，就不能成就万法，成不了万法，只能是真如如来藏本身。</p><p>如来藏真如不管变现出多少法，仍然有自己本来的性质，就像黄金不守黄金本有的状态，变化成金饰品的形状，黄金不管打造出多少金饰品，始终都有黄金的属性，有黄金的本体性。真如正因为有自性，才说不守自性，不守也是有。真如本来空空如也，什么都没有，但是随缘出生一切法，在出生一切法时，仍然有自己本来的性质。如来藏不会因为出生了万法，就没有了如来藏本体的属性。如来藏本体的属性永远不改变，否则如来藏就不是不变异的法了。</p><p>如来藏随缘不变，不变随缘，就是说明如来藏永远不变异，是有自性的，自性永不改变。第七识的遍计所执性、前六识的依他起性、如来藏的圆成实性这三种自性，都是无自性的，都是依如来藏本体才能存在的。</p></div>"
},{
    "title": "第二章 如来藏的了别性",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  如来藏的了别性</strong></p><p>一、如来藏了别六尘哪部分信息</p><p>如来藏与七个识都有了别性，但是了别的内容和方式截然不同，如来藏不能如七识那样落到六尘相中，了别不到六尘的具体内容，不知道六尘为何物，但是六尘的现今状况以及发展变化趋势祂是知道的。一切法如来藏都能了别，只是不知道具体内容和境界，这是七个识了别的内容。</p><p>比如说衣服，人能了别，洗衣机也能了别，但是二者了别的内容完全不同，尽管洗衣机洗了那么多的衣服，仍然不知道自己做了什么，也不知道有个自己，完全无心，如来藏与其有类似的知和无知。洗衣机工作运行完全按照设计好的程序，它不会自己有所选择，如来藏运行也是按照固有的程序和规则，这些规则具体是什么，如来藏不知，就像洗衣机也不知道自己运行的程序和规则是什么一样。但是二者都能按时把本职工作做好，做完也不知自己做了什么，没有喜怒哀乐，也不觉得辛苦，所以也不会有贪嗔痴烦恼。这就是无我无心的状态。</p><p>二、如来藏有别于七识的了别</p><p>譬如鲜花是色法，包括色彩的色尘和鲜艳、娇艳、美丽、富贵等等无表色的法尘，包括高矮、大小、长圆等等形色的法尘，包括姿态、形状等等表色的法尘。色彩是粗色，眼识了别，其余是细色，意识了别。意根都了别，只是了别不清楚，才让眼识意识过来帮助了别。</p><p>色法上的这四种尘，都属于色尘，都有外相分本质境和内相分的影像。内相分的影像，如来藏触不触？了别不了别？知不知？如来藏了知一切法，应该是无所不触，无所不知。如果如来藏不了别不了知，如何变现、如何改变内相分影像？比如你想挪动家具，你看不见家具，如何挪动它？比如你要做馒头，不知道面在哪里，盆在哪里，水要哪里，面板在哪里，也不知道这些东西怎么用，也不知道水面情况如何，也不知道锅在哪里，也不知道火源在哪里，这馒头要怎么做？</p><p>如果一个人应该要得癌症了，如来藏不了别身体状况，如何让身体出现癌症，在哪里出现癌细泡都不知道，这个人如何能得癌症？动手术也是这样。如来藏要出生眼睛，如果不了别胎儿色身情况，把眼睛生在哪里合适？身体要长息肉，如来藏不了别、了知色身情况，把息肉长在哪里合适？意根要吃饭，如来藏不了别饭菜，不了别意根，不了别六识情况，六识如何能吃饭？</p><p>如来藏不具体了别六尘境界为何物，没有七个识那样的了别功能属性。比如有一团饭，人能了别，然后吃了；鬼能了别，然后吃了；狗能了别，然后吃了；蚂蚁苍蝇能了别，然后吃了；细菌能了别，然后吃了。这几类众生都能了别，天人也能了别，佛菩萨也能了别，了别的内容方式结果一样吗？种种胜解各不同，种种所见皆成立，故知一切唯有识。</p><p>如来藏了别外相分本质境，也是特别的了别，与七个识的了别迥然不同。我们想象不到。</p><p>三、八个识了别的次第</p><p>尘境只要出现了，就是相分，任何一种法除了如来藏本体，都是如来藏的相分，都能被如来藏了别。之后才被意根了别，再之后才被六识了别。但是如来藏也有证自证分，也能了别和反观自身的运作，也是自己的相分。如来藏、第七识、第六识三者了别的尘境相分，按照次第越来越虚假，越来越不真实。</p><p>四、如来藏了别非世俗的相分</p><p>一切法都是如来藏的相分，是如来藏出生和了别的相，包括七识心和心所法。这个了别不同于七识的了别，二者了别的内容和性质不同，不能把两种了别混同一起。如来藏也是意根和意识了别的相分，包括如来藏的心所法。种子是如来藏的相分，成佛以后，也许也是七识的相分。</p><p>第六识的相分非常广泛而复杂，不仅仅是六尘，还有识心和心所法，还有非色非心法。如来藏的相分是根身器界，七识心行，其实如来藏所出生的一切法都是如来藏的相分，如来藏都能了别，如果不能了别，如来藏就不能执持，法必灭而不能存在，如来藏所不能了别的法，就是不存在的法，所以一切存在的法都是如来藏的相分。</p><p>只是如来藏不是七识那种世俗的了别方式，是一种独特的了别，就像洗衣机运行洗衣服的程序一样，无觉无知，不知好恶是非，不会因为了别而生心动念。而七识的了别是有心的，了别时是有觉知的，是落入尘相当中的，能够分别所了别的法的内涵，知道是非善恶，因此就会生出喜怒哀乐，有各种觉受，因而念力非常强。</p><p>五、如来藏面对六尘境界的表现</p><p>六尘境界是如来藏变现的，如来藏的四大种子一直在六尘境界上，刹那刹那生了又回去，如来藏刹那刹那都在执持着、维持着六尘，须臾不可分开，接触的这么密切，如来藏如何能不了别六尘境界？如果如来藏不了别六尘境界，如何能刹那改变六尘，如何让六尘不断的出现各种变化？</p><p>如来藏了别六尘境界就像电脑了别程序一样，就像机器人了别指令一样，了别而不分别。了别是知，分别是知道具体如何。如来藏了别六尘境界却不知道东西南北中，不知道六尘善恶美丑是非曲直，不知道六尘为何物，所以如来藏面对着六尘境界如如不动，不生心动念，没有受，没有情绪，没有心行，不造作业行，既没有业行，也没有果报。如来藏因为像木头似的绝情，所以才是舍受，因为祂是舍受，才能心地清净，无欲无求无所作为，无有任何愿力和愿行，才说祂是无为法。</p><p>六、如来藏的般若智慧</p><p>只要佛没有给意根和如来藏的心所法定义和划定框架，那么这两个识心的心所法以及所有识的心所法都有待于观察和实证，然后揭示出来。</p><p>如来藏也叫作般若，般若就是大智慧的意思。如来藏具有什么样的般若智慧？这个智慧可测量吗？如来藏变现自己的五阴身，这就是大智慧，变现宇宙器世间就是大智慧。七识能变现出什么法？七识直接来说什么法也变现不了，最多能驱使如来藏为自己变现。如来藏能了别五阴身和器世间，随时随地的调整五阴身和器世界，这个大智慧不可想象，了别意根、配合意根的大智慧也不可想象，了别业种输送种子的大智慧同样不可想象。如来藏那些不容易被人了知的执受作用，现在无法知的所有功能作用，执持一切法的大智慧都不可想象。</p><p>如来藏有了别性就一定有智慧，能造作一切法就一定有智慧。如果没有智慧，那个了别性就没有什么用，了别了却不知道了别了什么，如果是这样的话，了别之后再往下如何运行就不知道了，下一步的法就不会出现了。</p><p>观察一下如来藏的智慧究竟有多大，首先来说如来藏无无明，都是明，不做作任何贪嗔痴等等无明业，因此也不受任何系缚，没有任何一点生死业，完全是个大解脱者，大自在者。从这点上来看，如来藏就非常值得供养和皈依赞叹，是世出世间的大宝，是众生的光明和导首。</p><p>如来藏的了别慧快速而强大，了别了一切法之后，能瞬间依法、依缘、依业、依七识所愿的出生和改变一切法。了别了意根的心所法之后，如来藏如果没有辨别智慧，如来藏如何配合意根出生一切法？如来藏了别业种，如果如来藏没有智慧辨别是什么业种，不知业种是否成熟，那么如来藏如何依业种出生五蕴身心和宇宙器世间？众生所知和不知的身体自愈原理，就是如来藏的大智慧的显现，是如来藏把众生的身体修补好的，这个智慧我们是不可思量的。</p><p>如来藏虽然有慧心所，不同于七识的慧，非常强大，七识的慧是用来分别世俗界的法的，如来藏的智慧分别的是非世俗界的，正因为有如来藏能分别非世俗界的法，七识才能够从容而不断的分别世俗界的法，从而能在世俗界当中生生世世的生存下来。</p><p>七、如来藏是否了别分别六尘</p><p>如来藏有五遍行心所法，对自己所执持和维护的所有法都要了别和分别，否则如来藏就无所能为了，祂不能盲目的去改变和造就什么法。所以如来藏了别六尘，也分别六尘，如果不了别和分别，祂如何改变和出生六尘？只是如来藏了别的内容与七识有所不同。如来藏也分别，如果不分别，祂出生六尘的时候就避免不了张冠李戴，就要胡编乱造，没有章法了。只是如来藏分别出来的法，不是如七识分别的那样，祂的分别不落入世俗法里，七识只能分别世俗界层面的法，永远不能如如来藏那样分别非世俗界的出世间法。</p><p>对于一切法，如来藏与七识各负其责，各有不同的功能作用，不能互相代替。需要如来藏负责的部分，如来藏必须了别和分别之后，思心所才能起用，才能有所造作。譬如对于学生学习成绩的评估，各个科任老师只能对自己教育的科目进行评判，每个老师批阅和评判的内容肯定不相同，和合运作，汇总起来才能完成对学生学习成绩的考核，以确定是否发放毕业证书。</p><p>八、为什么如来藏能了别一切法？</p><p>因为一切法都是从如来藏心里出去的，一切法一点点的生成、变异和消失，都由如来藏掌管，由如来藏来护持，与如来藏紧密联系在一起，须臾不可分。如来藏本身又有了别性，有知性，有心所法，所以如来藏能了别一切法，能知一切法，能掌管和决定一切法。实质上一切法都是如来藏的一部分，都是如来藏心中物，都是如来藏的变相，所以一切相就是如来藏的相，无二无别法，全体都是如来藏一个真实的法界。</p><p>包括五识、意识和末那识，都是如来藏的相，是如来藏的替身，由如来藏掌管，所以如来藏也同样从始至终都能如实了别这七个识，知这七个识的心行和行相，能决定七个识的生住异灭。一切法都是真金（如来藏）制品，性质都是真金（如来藏）性，由真金的品质就决定了真金制品的价值，掌握了真金，就掌握了一切制品。一颗摩尼宝珠就流布触大千世界，光芒四射。</p><p>九、如来藏了别一切法都是现量 </p><p>一切法都是如来藏亲自、独自现起的境界，如来藏都能亲自缘得到，现前缘得到，因此一切法对于如来藏来说，都是现前存在的法，如来藏现量了别、现量知无有错谬，不需要比较而知，更不需要想象而知。如来藏也没有幻想妄想的心行和特点，从这方面来说，如来藏具有无比的大智慧，能够现量而知、如实而知一切法无有障碍。如来佛的七识心与如来藏一样，都是现量了别一切法，当下见法，不用比对和思惟想象，这是七识都转识成智，没有无明的结果。</p></div>"
},{
    "title": "第三章 真与妄的区别",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  真与妄的区别</strong></p><p>一、什么是真实？</p><p>真实，有两层含义，一是指世人所认可的、世间暂时不变的、看得见、听得见、触得到、想象得出来，可以认知的事物和事理；二是指世人所不知不见的出世间的事理。</p><p>第一种真实，包括宇宙器世间，众生觉得可以接触得到，可以认知，认为不变异，有真实的用，称作真实；包括五蕴身，看得见摸得着接触得到，有真实的功能作用，可认知，不变异；包括六尘境界，接触得到，六识认知得到，认为有真实的用。然而，这些法在实际理地，却不是真实的，是被变幻出来的，没有真实的用，是虚拟的法，所知都是错觉，众生无始劫都是活在幻觉里，不识真实事理。即使这些法有暂时的虚假的用，也是刹那生灭无常变异的，同样不真实。众生的智慧只能达到事物的表面，从来深入不了内里，不能透过表面现象而认知背后的真理。</p><p>第二种真实，仅指众生的根本依，出生众生所需一切法的真如如来藏，这才是真正真实不变异的理体，永远不生灭的法，是众生无始劫真正的依止处。两种真实比较起来天差地别，不可比，也没有可比性。</p><p>二、大觉与七识妄觉的区别</p><p>楞严经云：空生大觉中，如海一沤发。这个大觉就是指无上觉如来藏，虚空出生在如来藏中，就像大海里冒出来的一个泡沫，虚空看起来再广大无边，与如来藏相比也是非常渺小的。可见如来藏大海里的法有无穷无尽之多，在如来藏里沤生沤灭、起起落落，本质都是如来藏，都具有如来藏性。</p><p>七识的觉性，与如来藏这个大觉有很大区别。七识的觉有两个含义，一个是能觉知诸法之义，知而不悟，是觉知；另一个是觉悟诸法之义，知而能悟，是觉悟。七识的觉性是生生灭灭的，是大觉幻化出来的，没有自主性。而如来藏的大觉却是随着如来藏亘古长存，不生不灭，不动不摇。</p><p>三、本觉与后觉的区别</p><p>一切法分为本来而有的和后天出生的，包括无所住心、平等心、定心、慧心、觉悟的心等等，每种心都分为先天的和后生的两种。本来无所住的心是指真如、自性、第八识、阿赖耶识、如来藏，这个心不用任何人想办法让祂无所住，祂本来就是无所住的，任何时候，任何处所，在任何法的运行中都是无所住的。</p><p>后天出生的无所住心是七识妄心的无所住，但是七识妄心要达到无所住却非常困难，一定要戒定慧具足，实修实证之后才能有初步的无所住。如果要七识真正完全彻底的无所住，像如来藏一样，只有在成佛以后了。比较明显的无所住是在八地菩萨的时候，在早一些是在转识成智的初地菩萨以后。除此之外，最低也要修到初禅二禅以上，靠禅定来暂时降伏妄动，让意根六识不住六尘境界少住六尘境界，这样的安住可以称为后天的无所住，但不保靠，随时能灭去。</p><p>本来而有的平等心是指如来藏对诸法的平等无二心，是不生不灭的；后天出生的平等心是六七识对诸法的平等无二性，是有生有灭的。定心和慧心也是如此，本来而有的定心和慧心是指如来藏的定慧，不生不灭，永远不变异；后天出生的定慧心是七识的定慧，有生有灭，变异无常。</p><p>四、真心与妄心功能作用的区别</p><p>在闻声时，有耳识的功能作用，有意识的功能作用，有意根的功能作用，有如来藏的功能作用，这里只讲意识的功能作用，眼识的功能作用容易明白，意根的功能作用比较深细难懂，如来藏的功能作用绝对不能讲。</p><p>如果离开眼识意识意根，如来藏能闻声，那就让如来藏去闻十方世界的音声。然，如来藏能闻一切音声，与意识有何相干，意识仍然不能知道声音的内涵。阿罗汉入无余涅槃时，如果他的如来藏能闻声，什么都能做，这样的涅槃还能寂静吗？如果如来藏能闻声，祂能知道是男声女声吗？知道声音好听吗？知道声音来源于哪里吗？听得懂是什么音乐吗？这些文字，如来藏知道是什么内容吗？如来藏的知，能代替意识的知？如果能，五阴六识都可以永远灭去，也不影响见色闻声听法，不影响五阴活动。</p><p>如来藏再有意根的作主功能作用，那么如来藏的我性就跃然纸上，再也不是无我性的如来藏了，这个我如果造起业来，丝毫不弱于七识，那么生死轮回就是如来藏自己的事了，与七识五阴无关。这样就全然推翻了现有的佛法理论体系，建立了一个新的佛法体系，哪个体系是正确的，符合真理和事实？既然如来藏能分别六尘境界，那就让如来藏把一切事情都做了，让七个识休息休息，昏睡一百年也没有关系。</p><p>还有人说，推拳竖掌，摩拳擦掌等等等等，就是如来藏，知道这个就开悟了。那好，以后如果需要做什么事的话，咱们就让如来藏去做，七个识都休息去，死后也不用担心什么，因为如来藏什么事都能做，完全可以代替五阴身，睡着昏死过去以后，就让如来藏见色闻声嗅香尝味觉触知法，六识灭去都没有关系了，有没有意根也可以。</p><p>如果真妄的功能作用分不清楚，证果明心等等什么也不要谈。如此开悟明心，悟离念灵知者都会，他们有些人也都如此悟，各门各派的悟，有好多也是这样的悟。但是这些悟都很离奇，都以妄为真，真妄不分，与不悟密意没有什么差别。</p><p>五、离念灵知是哪个心</p><p>离念，就是离开了念头，没有什么念头了。灵知，灵敏的了知。没有念头还能灵敏的了知，七个识里都有哪个识能出现这样的情况？</p><p>在意识没有念的时候，却仍然知道色声香味触法，那么这时候眼识是否有知，能知赤橙黄绿青蓝紫？有知。耳识是否有知，知声音的粗重相震动相？有知。鼻识是否有知，知香尘的粗重相刺鼻相？有知。舌识是否有知，知味尘的粗重相？有知。身识是否有知，知触尘的粗重相？有知。意识是否有知，知五尘上的法尘？有知。第七识是否有知？知一切六尘境界？有知。如来藏是否有知，知意根的心行，知业种，知宇宙器世间一切法？有知。可见，意识虽然无念，却不影响任何一个识的知性。由意根的知，统领六识，由如来藏的知，统领一切法。</p><p>同理，意识不思善也不思恶的时候，都有哪些识在运作着？八个识都在运作着。那如何分清这时候的妄心七识和真心如来藏？如何证悟如来藏而不错会六七识心为如来藏？有的人在五蕴运作的某个法中，就说是如来藏运作的。既然如此，以后就把六识灭掉，让如来藏自己运作，把七识灭掉，让如来藏自己运作，看看离开七个识以后如来藏如何还能运作，显然这是不可能的。那就要通过观行五蕴，否定断除五蕴为我的知见，不认六七识的作用为真实为我，就会认出那个不生不灭的真心如来藏。</p><p>现在人的悟，基本上都是把八个识的和合运作的结果，都扣在如来藏一个识的头上，泯灭七个识的功能作用。如果七个识的功能作用能泯灭那当然好了，就会时时处处都是如来藏的功能作用，无需七个识，一切法都是如来藏单独的功能作用，都是如来藏，那就证得一真法界了，离成佛不远了。可是如果其中没有六七识的功能作用，那么这时候是谁知一切法都是如来藏？离开七识，如来藏还能单独起用，在无余涅槃里如来藏也就会仍然能出生一切法，这还是涅槃境界吗？</p><p>六、六七识如何像如来藏一样无所住</p><p>无所住心，就是自性清净心，用祂度日倒是可以，可是不用祂度日也根本做不到，祂不是我们主观上用与不用的，是法尔如是任运而行的，没有祂谁也不能度日，也不能存在。关键祂是如何陪着我们度日的，五识、六识、七识是如何度日的，这个是最关键的，日子度好了就成佛，度不好三恶道。如果要心无所住地度日，那就要让七识心像本心自性一样的无所住，要做到这点，首先就要找到无所住的本心，看看祂是如何的无所住，然后效仿祂，将来七识就能做到无所住，修行就了毕。</p><p>如来藏本身是无所住的心，不住在世间任何一法上，祂本身也没有任何世间的相，何况四相。需要破相的是六七识心，是意识着相，是六七识有所住。修行是让六七识心减少世间法的贪着住着，少了知在意世间法。当然破了四相，就很容易证得如来藏，证得如来藏同时也是破了四相。要想把佛法弄清楚，就要把真心妄心分开来观察，了解各自的体性、功能、作用和相貌，然后再把七个识分开，了解各自的功能、体性、作用和相貌，这样就能把自己和众生看得清清楚楚，把佛法了解得更透彻一些，那么一步步地证得佛法就不是太困难的事。</p><p>七、胜义谛与世俗谛的关系</p><p>万法皆空，物也是万法中的法，皆空，都是空的，没有不空的。包括各种型号种类的车都是空的，空的车却有那么多奇妙的作用，手也是空的，却打出这么多字，确实很奇怪。有人说是如来藏开的车、打的字，都是如来藏的妙用。果真如此的话，人类完全可以整天睡大觉，让如来藏来打字和开车，做一切事业，让如来藏工作一天天一年年一世世，人类不出生也行。如果泯灭世俗谛，完全用圣义谛来代替，这样过失会很大，离开世俗谛，胜义谛完全无能为力，无所作为，哪里还能如此如彼的。</p><p>我们学佛必须按照佛讲的法如实去修，佛是无上智，所有法都实修过，都证得了才算数。如果佛说证果要如此修才能证果，那我们就听佛的话，一定要如此修，不要自己搞发明创造，不要以哪个人的讲法为是，依止佛陀才是最保靠的，因为佛陀灭尽一切无明，没有我心，不会彰显自我，不会以盲引盲。</p><p>真正想学佛成就，不要图省事，不要走捷径，如果有捷径可走，佛陀一定会告诉我们，不会让我们走弯路，不会领我们绕圈子。完全相信佛陀，这是学佛最基本的宗旨，信为先导。如果佛陀不可信 那就再没有可信的人了，即使等觉妙觉也不可信，何况一般的普普通通的人。如果有人讲法，与佛陀不一致，我们应该做一个抉择，毫无疑问的选择相信佛陀。</p><p>想走捷径的人，都有一种贪得心理，是有所求的心态，有贪就容易入魔，被魔所利用，成魔眷属，渐离佛道，不能解脱。抱着提升自己、改变自己、充实自己、成熟自己、完善自己的心态来学佛修行，能够远离魔事，稳稳当当，看似很慢，实际上是最快的。急进冒进，适得其反，事与愿违。</p><p>八、不会六入的含义</p><p>佛在维摩诘经中说诸入不会，不会者是菩提。弟子问：五祖衣钵谁人得？六祖回答说：不会佛法者得。这个不会是指不懂得不了解世俗界里的法，不知世俗名相和内涵，不与世俗法相应，了别一切法而不落入世俗界的法相里，了别的不是一切法的世俗相。这正与七识相反，七识了别了解的都是世俗法相，见一切法都会落入世俗相里，有世俗分别，懂得世俗法的内涵。</p><p>六入是眼入、耳入、鼻入、舌入、身入、意入，包括外六入色声香味触法；包括内六入胜义根内的眼根、耳根、鼻根、舌根、身根，以及意根。这些内外六入都是世俗法，前七识都与世俗法相应，能了别和分别世俗法，能明了这些世俗法的世俗含义，这个明了就是会的意思。而如来藏就不能明了这些世俗法的世俗含义，不会这些世俗法，否则如来藏也会如七识那样对世俗法生出爱着和取着的心，就会有烦恼出现，就会与生死相应，所以说如来藏诸入不会。</p><p>但是如来藏无无明，无一法不知，无一法不晓，又能缘一切法，作意触受想思一切法，就能如实了别一切法、知一切法、分别一切法、懂一切法。如果如来藏不知不懂一切法，不知不懂六根六尘，那祂要如何随时随地分秒刹那的执持六根六尘，变化六根六尘？如来藏也对六根六尘受想思，有抉择有后续的造作，祂必然知和懂六根六尘，所以才必然知如何造作。只是如来藏不知六根六尘的世俗法相，不知世俗内涵，这些都是七识所知的内涵。如来藏无无明，分别一切法清清楚楚，丝毫不错乱，不像七识很多时候分别不清楚，以至于抉择错乱，造作错乱，果报错乱，如来藏永远都不错乱。</p><p>九、生灭相是否是常住相</p><p>常，分为世间的常和出世间的常，世间的常是暂时变异的，出世间的常是永久不变的。真，分为世间的真和出世间的真，世间的真也是幻化不实的，出世间的真却不是幻化的，是从来都如此的。辨别究竟是哪个常哪个真，要根据上下文和语义，更多的要根据义来判断，而不是根据语来判断，所以有智慧判断力很重要。</p><p>从世间生灭现象中可以发现，世间里这些生灭现象会反复出现，生了灭灭了生，从不断绝，众生只要不入涅槃，世间相就会永远存在着，这就是世间法的常住相。还有一个出世间法如来藏的常住相，如来藏虽然无相，但其功能作用却常住常存，永不灭亡。将来修到有唯识种智的时候，也可以发现这些生灭的世间相，都体现着不生灭的如来藏的常住相，有法眼才能观察得出来，认识得清楚。所以修行还是要按次第来修，先认识清楚世间相的生灭性不实性虚妄性，证得如来藏以后，才能逐渐观察生灭相上的不生灭相，认清世间生灭相的实质，这样烦恼才能次第断，智慧次第增加，次第解脱一切法缚。</p><p>十、智与识的区别</p><p>分别是识不分别是智，依识染，依智净，染有生死净无诸佛。其含义为：能够分别世间万法六尘境界的是七识妄心，不能分别出世间六尘境界为何物的，是智慧心如来藏。如果依靠七识的心性，就是染污心不清净；如果依靠智慧的如来藏的心性，七识才能逐渐清净。染污的识心能流转生死，有生死苦患，清净的心中无法，也没有诸佛。</p><p>十一、本质境是否是实有法</p><p>本质境是实的四大种子组成，虽然种子是实有的，但是种子生出的法却是虚幻的，不实实有的。实，有两种，一种是绝对的实，没有衬托，没有对比，傲然独立，不依倚任何一个法，没有任何条件的存在，这是法界实相不生不灭的如来藏。另一种实，是相对的实，是必须依赖其它法才能存在的实，是被出生的法，因此也是假法，虚妄法，是生灭的世俗法。</p><p>六尘分内六尘相分和外六尘相分，所谓内外之分，是相对于前七识来说的，也是对有胜义根的众生来说的。对如来藏而言，六尘无内外之分，如来藏见的六尘境界都是见四大种子的结构，不见相。一切法都是在如来藏心内运作，永远出不了心外，心外无法。这就是心外无法的意思。</p><p>十二、如来藏的见不同于六七识的见</p><p>没有六识的时候，如来藏还见法吗？没有六识的时候，其他法都不灭，只要有法的存在，如来藏就会见，因为如来藏从来不离于一切法，有法就有如来藏的执持作用。第七识意根是如来藏的见分吗？意根不是如来藏的见分，没有意根的时候，如来藏仍然能见业种。如来藏见的法多于意根见的法，意根不见的法，如来藏照样单独见，无余涅槃里，如来藏仍然能见法，见种子，五遍行心所法照常运行。意根与如来藏的眼睛不一样，因此所见的相就不同，一个见世俗法相，一个见的非世俗法相。</p><p>六识不是如来藏的见分，如来藏不通过六识来见一切法。如来藏有自己本体的见分，就是五遍行心所法作意触受想思。如来藏对法生起作意之后，就触法，触法之后就能领受接受下来，之后就要了别，了别之后就会知法。这就是如来藏的见分，是如来藏见法的形式。</p><p>但如来藏所见法的内容内涵与六识所见的内容内涵完全不同，六识所见的法都落入六尘相貌之中，执取的是色声香味触法的相貌，这是世俗法。而如来藏所见的法不会落入世俗法的相貌中，不是色声香味触法，意识无法理解如来藏所见的是什么，因此如来藏的见分不是五识六识。但六识见法之后，对如来藏的运作有一定的作用，这种作用体现在六识的见能影响到意根，意根受到影响，就会生起相应的抉择，如来藏就要依意根的抉择而运行下一步的法，新的法就会产生出来。</p><p>十三、是谁见恒河水？</p><p>见性就是一种见法的能力和功能作用。如来藏有见性，第七识有见性，第六识有见性，前五识各有各的见性，八个识的见性所见的法相各有不同，所起的作用也各不相同。见性之后就会有识性出来，识性出来之后，法就动起来了，就有了生住异灭的流转。</p><p>佛说：波斯匿王你三岁的时候见恒河水，与你十三岁的时候见恒河水的见，有什么区别吗？波斯匿王回答说：没有区别，乃至于与我现在六十二岁见恒河水的见，也没有区别，见性不变。佛说：这个不变的见性就是那个不灭的你，不管你见与不见，那个见性始终都存在不灭。那么见恒河水的见，都是什么样的见呢？如来藏见恒河水吗？如来藏若不见恒河水，五六七识如何能见恒河水？如来藏若见恒河水，何用五六七识见恒河水？到底如何？</p><p>从如来藏见之后变起的相似影像，一直到胜义根里，再一直到五六识见影像，第七识一直在见，没有移开。若第七识不见，就没有五六识，何况五六识的见。而如来藏从始至终没有一刹那不见，否则五六七识何能见？</p><p>十四、众生所有的见都是妄见</p><p>妄见顾名思义就是妄心七识的见，以六七识的见为主，最明显最容易反观和感知到的是意识的见。众生是指五蕴，也是指意根，而众生的见就是五蕴的见、意根的见，或者是六识的见。相对应于七识的见还有一个如来藏的见，而如来藏的见从来都不会落入五蕴世间，就是说如来藏没有世间见，没有世俗见，祂的见也无法表达出来，一但表达出来就落入世俗的语言文字中，那就不是如来藏的见了。所以一说证果和证悟，见法见道，肯定就是七识的见和证，如来藏不见这些。</p><p> 所以见如来藏也是七识的见，七识见了之后，虽然能够否定了五蕴之我，但如果把如来藏当作真实的另一个我，我见就没有断尽，这仍然是一种我见或者是我所见。因为在法界当中根本没有五蕴七识这样的我，既然没有我，怎么能有如来藏是真我这样的观念呢？究竟意义上讲，没有根本的七识的自体性，也就没有任何的我性，如果确立了一个知见说如来藏是真我，同时就确立了一个七识我，有个七识我，才会把如来藏当作真实的我，没有七识就不会把任何法当作我。</p><p>当然在一段时间内可以这样说，可以这样方便的表达，但修到一定时候，心里这样的观念要灭掉舍去。修到禅宗第三关的时候，如果心里还执个如来藏我，就不能过禅宗第三关，不能证得有余依涅槃，不能脱离生死得解脱。因此只要见法就是妄见，没有妄见时，必成佛。</p><p>十五、为什么如来藏无我而第七识有我？</p><p>如来藏天然的就是无我的，祂因为什么无我呢？把这个问题剖析清楚，对断我见也有很大助益。之所以要用剖析这个词语，是因为没有证得如来藏的时候，就无法现前观察如来藏的运作，无法现前观察如来藏在一切法的运作过程中的心性和感知。但是如来藏心性无我一定有其原因，第七识有我也有其原因，其原因就是第七识一见法就落到世俗法相中，看到的是世俗法的功用和利弊，这就是无明。而如来藏没有无明，见一切法都不见其世俗法相，不见其世俗功利，因此无我也无求。那么第七识要断我见该怎么办？</p><p>修行方法都摆得明明白白了，就是各人具体下手的因缘条件不具足，所以才下不去手，才感觉无下手处。比如我总想再专心自修再提升自己，想了两年也没有用，再有两年也实行不了，因缘条件不具足，放不下弘法的事，惦记的事情多，不像从前一个人吃饱全家不饿，想干什么就干什么，现在不行，累赘太多。其他人也是，各有各的难处，事情摆不开，无法专一其心的连续用功，这壶水不温不火的，就一直烧不开。因缘不具足，无非是福德不足，以至于戒定慧不能增进。所以修福还是非常重要的，福德就是自己的资粮和道粮，兵马未动粮草先行，很多人都没有粮草，怎么用功？</p><p>十六、缘起法与非缘起法的区别</p><p>缘起法六识、六尘、五根易散坏，因此缘起法易破坏、易改变、易断除；非缘起法意根不易散坏、不易破坏、不易改变、不易断除。改变意根的心性很难，所以才说修行不易，解脱不易。</p><p>而非缘起法的如来藏，永远都不会散坏、不会变异、不能改变、不能断除。因此修行的下手处不用去修行和改变如来藏，只需证得如来藏是真，五蕴世间一切法是假，然后亲眼所见，一切法都依赖如来藏，是如来藏的产物，在如来藏面前，一切法都隐蔽不现。这样就不再去执取一切法，连如来藏也不执取，心大空，空空，这就是大解脱。</p><p>没有禅定的时候，看一切法还是一切法；有禅定的时候，看一切法非一切法，能见法的真实的相貌，能见法的实质和根本，之后无明灭除，心改变，得解脱。</p></div>"
},{
    "title": "第四章 三能变识",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  三能变识</strong></p><p>一、问：由本质境改变成第七识可见的尘境，此时可见的尘境是带质境（尚未进入胜根），在此改变过程中意根是否参与变化？如来藏摄取本质境微粒到意根，变成带质境，此时如来藏也释放末那识种子到带质境，三者和合，产生末那识，末那识触带质境，认识尘境，此过程是这样吗？</p><p>答：意根就是末那识，不涉及意根、末那识和带质境三者和合之说。意根是第二能变识，法的改变肯定与意根有关，本质境变成带质境是因为意根需要了别，如来藏配合的结果。如果意根不需要了别，那可能本质境永远是本质境，如来藏不会把它变成带质境以供意根了别，但具体意根是如何参与法的变化的，现在还观察不出来。如来藏摄取本质境上的微粒，就变成了带质境，意根依如来藏就能触到带质境，不是如来藏特意把带质境传导到意根那里，也不是如来藏输送意根的识种子到带质境，让意根触带质境。</p><p>二、独头意识能否改变外相分  </p><p>出生一切法和改变一切法，都是如来藏的功能作用，因为如来藏有一切法的种子，六七识没有一切法的种子，不能出生和改变一切法，但可以与如来藏和合运作，促使如来藏出生和改变一切法。不管是五俱意识还是独头意识都不能改变外相分或者是内相分，也不能促使如来藏改变内外相分，必须熏染意根，让意根促使如来藏出生和改变内外相分。</p><p>外相分甚至内相分的改变，不是单个哪个识能决定的，是三能变识和合运作的结果。在因缘和业种成熟的时候，三种能变识和合起来能出生一切法，在因缘条件成熟的时候也能改变一切法。但要想改变外相分，就需要改变业种，这就需要改变业种的因缘要成熟。</p><p>要想改变外相分，不管是短期的快速改变，还是长期的慢慢改变，六七识这两个能变识都必须非常有力量，能促使如来藏里的业种发生变化，业种变化了外相分就能改变了。如果六七识无力，五俱意识就不能起到促使如来藏改变外相分的作用，梦中的独头意识就更不能改变外相分了。能促使如来藏很快改变外相分的，必须是定中的六七识，最好是定中的独头意识和意根，散乱的独头意识和五俱意识以及意根都不行，没有力量的缘故。</p><p>梦中独头意识几乎不能通过意根促使如来藏改变外相分，因为意识力量非常弱，或者根本没有力量，也没有具体的业行，不能促使业种发生转变，外相分就不能改变。在醒着时独头意识狂想乱想妄想，也无法在短时期内通过意根促使如来藏改变外相分，因为散乱无力故。但是独头意识如果能集中精力，妄想就非常有力量，也许能熏染意根，让意根有力量促使如来藏快速改变外相分，凭借意根的想和独头意识的想，不用身行和口行，也能改变业种，从而改变外相分。所以心想、意行也是业行，有业报。</p><p>三、八识心王主要是六七八识的运作，前五识是否可以忽略不计？</p><p>三能变识，第一能变识是如来藏，依业种和意根的思心所变现法；第二能变识是意根，是万法出生的动力；第三能变识是六识，因为意识是与五识共同了别六尘，完成身口意行，那就是六个识共同参与变现六尘境界。六识中意识起主导作用，能够筹谋策划，辅助意根决策，间接的推动法生。所以在有些时候，五识可以忽略不计，有独头意识就行，有些时候不能忽略不计。</p><p>四、色身是如何被改变的</p><p>医生给病人治好病了，是先改变医生自己的内相分，还是先改变医生自己的外相分？内相分如何出现的？这个问题不解决好，将来无法证悟。内外相分谁先谁后的问题非常重要，越不过去，都涉及到如来藏变现一切法的问题，涉及到如来藏如何变现，根据什么变现的问题。这个问题搞明白，证悟就容易了。</p><p>病人是医生的外相分，给病人治病，当然是改变了病人的色身，让色身康复。病人的色身对于医生就是外相分，治病就是医生自己的八个识共同改变了病人的色身，就是改变了医生的外相分。医生的如来藏通过自己的六根把外相分传导到医生的胜义根里，成为内相分，与外相分相一致。医生所见到的内相分病人的色身也同时康复了。</p><p>治病也需要前六识参与，八个识都参与，如果是观想治病，也需要意识参与，六七八三个识共同起用，改变了病人的色身。改变了医生外相分的病人，医生内相分的病人身体同时就改变。八个识究竟是如何改变病人色身的，对外相分的色身如何起用的，需要参禅者去参究，破参以后就知道了。</p><p>五、色身的自我修复原理</p><p>色身具有自我修复的机能，身体被破坏了会自动修补，内脏器官坏了会自动修补，身体精疲力尽了休息一段时间会恢复精力，动手术了刀口会自动修复，缺失的肌肉皮肤等等会自动的弥补。血液流失了，还可以再造，肠胃里没有饮食了，身体能够自动补充能量，辟谷调理色身就是利用这个神奇的机制。这些都是什么机制？是谁的功能作用？这个神奇的生命之源什么时候开始出现的？</p><p>窥基大师前世入定几千年等释迦佛出世，结果在定中错过了，于是还想再入定等弥勒佛出世。一个靠四大饮食维持生命的人体，几千年几万年在定中不吃不喝，却没有一点不适，还可以入定千万年不死，窥基大师和其他入定长生之人究竟依靠什么机制维持生命的？据说有个实验，说瘦人比胖人更长寿，吃的少的人比饭量大的人更长寿，这是什么原理？</p><p>现代医学养生学说半夜子时十一点到一点之间一定要睡眠，否则熬夜内脏得不到休整，身体就会亏空，而半夜打坐入定却没事，佛陀当年鼓励弟子们精进修行，在初夜、中夜以及后夜都要精进不休的用功，也没听说过比丘们有什么身体上的不适，反而精力更旺盛，头脑思惟更灵敏。现代医学又说，早晨不吃饭容易得胆结石，可是佛世时，出家人都日中一食，也没听说过谁得胆结石。这些都是什么机制的作用？</p><p>晒太阳身体就会自动补充阳气和能量，如果能一心观想，补充的就会多一些，身体调理的更好。除了无色界天的天人没有身体，不需要四大物质的滋养，其余有身体的众生都需要四大物质的滋养。境界越高的众生，需要的四大物质越少，物质越微细精细。境界低的众生由于福德薄的缘故，就得受用非常粗燥低劣的四大物质。人类在欲界中层，并不算欲界很高级生命，所受用的四大物质都比较粗劣，却以为自己所受用的都是高等物质，吃的都是高级饮食，实则很粗糙。色界天人所受用的才是最高级最精微的四大物质，其次是欲界天人，再次是神仙。所有人类都比不上天人的受用，饮食不仅粗燥，还非常肮脏，色香味都不佳，因为业缘如此，所以并不觉得有什么不好，反而还很贪爱，就像狗喜欢大粪，虫子喜欢粪坑一样。</p><p>所有色身的修复机制所受用的一切四大物质，都是如来藏的功能作用，是如来藏依据众生的业种和福德造就出来的。因为众生与欲界人间有缘，有做人做畜生的业种和业缘，五阴身如果要在欲界正常的生存，色身就必须具足相当的四大物质养分，如果色身上的四大物质有缺失，就会影响正常的五阴身运行，如来藏就要根据业种业缘，自动的补充所缺失的四大物质。如果业障不允许补充，则五阴身就以不完整的色身继续不完美的运行，这就显示出众生的恶业因缘了。善业具足的众生，色身无论缺失什么，如来藏都会自动的补充，如果补充不了的，就是色身残缺不全的恶业果报 。</p></div>"
},{
    "title": "第五章 一真法界",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  一真法界</strong></p><p>一、一切法皆如来藏</p><p>佛在楞严经里批驳了自然外道，也批驳了因缘外道。一切法归于正法——如来藏。一切法的生住异灭，好像都有自身的规律，实际都归如来藏所掌控，没有如来藏的出生和执持作用，一切法就没有生住异灭的任何一点现象存在。别说什么化学作用、物理作用了，实质都是如来藏的作用。没有如来藏变现的物质色法和七识心，没有七识的心所法，哪里还有什么势速、流转等等那些与心不相应的假法。</p><p>物质色法的生住异灭现象，只有地上菩萨的唯识种智才能理清其实质，那是法眼所见，不是凡夫和普通明心见性的菩萨所能如实了别和观察得到的。地上菩萨的唯识种智，能够观察得到每一种法上，都有如来藏具体的操作，如来藏是一切法的牵线人，凡夫只能看见木偶人在演戏，看不见木偶人背后的机制。恰恰凡夫们还自以为是，把木偶人的运作当作真实的，有自体性的，还说木偶人背后并没有一根线牵着，都是木偶人自己运作的。这说明众生被无明所遮障，看不到事情的实质和本质。</p><p>没有发菩萨心，对佛法不会有正解，不会有正知见，很简单的问题，多少年也理不清。想当菩萨，不发大心，不修福德，根本当不成菩萨。真正的法义根本捋不清楚，就不会有正解。然后就把外道说成是内道，把内道说成是外道，颠倒是非，错乱佛法。科学家脱离佛法的智慧，如果可以用，科学家就可以成佛。那我们可以学科学家，不用学佛。佛讲的那么好的那么究竟的楞严经不去仔细学习钻研，反而去学习科学家的无神论，岂是菩萨所为？</p><p>万法唯心造，一切法都是如来藏性，这两句话是佛说的，如果是信佛语，就来解释解释，看看佛说的对，还是科学家说的对。还有人说什么第一因外道，看看佛是不是第一因外道？如果佛是第一因外道，我们是佛弟子，全部也要做第一因外道。一切法唯心这个观点，是不是第一因外道的观点？</p><p>把一切法唯心造这句话解释解释，把楞严经里的一切法都是如来藏性这句话解释解释。楞严经里破斥的外道法，学佛人为什么不去仔细思惟？如果有人认为物质自然而有的，佛说是自然外道论，如果有人认为一切法因缘而有，不是因如来藏而有，佛说是因缘外道论。最后佛总结说：一切法都是如来藏性，是如来藏所生。如果学佛法还不认可楞严经，不认可佛所说，那是什么道？与佛争，与佛经相违背，是什么道？自己给自己下结论吧。</p><p>二、如何理解法法都是真如</p><p>一切法皆真如，都是如来藏所出生和执持的，都具有如来藏性、真实性、如如性。一切法既然都是如来藏所出生的，是如来藏用七大种子变现出来的，都具有大种性自性，都是真实而如如的。而如来藏及其种子，不随任何法的生灭变异而动转，真实不变异，也叫作真如，具有真如性。所出生的一切法实质上都具有如来藏的性质，所以也都是真如。这就是法法皆真如的意思。</p><p>三、万事万物即如来藏</p><p>如来藏只让万事万物不停的生灭变化，自己却不变化，如果如来藏也是变化的，那就是生住异灭的法，这就有极大的过失了。如果是这样，那么问题就出现了，如来藏是什么时候生的，如何生出来的，祂没有生的时候，一切万物万法都不存在，连虚空也没有，那是什么状态？众生的业种存在哪里？意根存在哪里？如果如来藏能灭，祂是如何灭的，因为什么而灭，灭了以后，万法的种子怎么办？众生的果报还有没有？</p><p>如来藏无所住，当然也不住在万事万物里，否则万事万物毁灭以后，是不是如来藏也跟着毁灭掉了？如果把万事万物一点一点的分割开，是不是就能找到如来藏了？这是根本不能的。一切万事万物的生长直至毁灭，都是四大种子和合运作的过程，都是如来藏调动和执持的结果。</p><p>在一切法中，都能找到如来藏运行的踪迹，祂的踪迹和痕迹就是七大种子形成的心法和色法，都是如来藏自身中的原材料，所以见法就应该见到如来藏，满目青山无别法，全体即一个真实的法界——不生不灭的如来藏。不允许有一毫米一微尘许立于如来藏之外，都是如来藏心中法，也都是如来藏之体、相、用。众生活在如来藏中，实际上也没有众生，都是如来藏，哪个法不是如来藏？哪个能超脱于如来藏之外独存？都不能。</p><p>四、什么是性相一如</p><p>任何一个事物的相，与这个事物的性，都是真如，即一真法界。相是真如自性中四大种子变现，就是真如所现，本质就是真如，其性质就是真如性。比如金器是金子造，相是金相，性是金性，性相统一为金子。</p><p>五、诸佛一切种智成就的过程</p><p>金子有金性，金子相当于如来藏，金性相当于如来藏的性质，也相当于真如性。金盆金碗金首饰是用金子打造出来的，都有金性，或者说都是金性。同理，如来藏所变造出来的一切法都有真如性，也就是说都有如来藏的性质。</p><p>知道金盆金碗是金子制作的，但一开始并不知道金盆金碗是百分之百纯金打造的，从里到外每一微尘都是金子，都有金子的属性，时间长了通过对金盆金碗的不断观察验证，对金子的属性知道得越来越多，越来越肯定金盆金碗的含金量和纯度，最后完全验证出金盆金碗全部都是纯金制作的，百分之百是金子，具有金子的全部属性，完全可以当作金子对待。</p><p>这个过程与证得如来藏之后，生出总相智、别相智和道种智以及一切种智的过程是一样的。刚刚开悟在五蕴上证得如来藏的时候，等于刚刚知道了金盆金碗是用金子制作出来的，含有一定程度的金性，但并不知道金子的纯度在几成。生出别相智之后再仔细的观察验证诸法当中的如来藏，越来越多的观察出了诸法中如来藏的性质。再观察到一定时候，就证得了诸法具有一分如来藏的真如性，就入初地了。</p><p>在诸法上继续观察验证以后，就证得一切法都圆满的具足了如来藏的真如性，证得十分真如性，满分真如性，满眼都是真如，这时候就成佛了。而不识金子的人只见盆碗，不见金子，只有当贫穷的流浪汉的份儿，守着金子乞讨过活，多么可怜。凡夫守着身中的如来藏，不识如来藏，只认五蕴身，那就只有六道轮回的份儿了，更是可怜。</p><p>六、法无我的真实义</p><p>法无我是地上菩萨所证得的唯识甚深智慧境界，对于五阴所周遭的一切法，逐渐证得了一部分法不是我，没有我性；大部分法不是我，没有我性；乃至于证得所有法都不是我，没有我性，从而究竟成佛。众生认为一切法都有一定的真实属性，因此心生执著，就有了法执。地后菩萨有甚深的唯识种智，能够现前观察一部分法、大部分法都是如何由如来藏出生和执持的，因而就不把三界世间某部分法和大部分法当作是真实的有自性的，这样就证得了一部分法无我和大部分法无我。</p><p>地前菩萨和凡夫众生由于没有能力现前观察三界世间一部分法和大部分法的由来和实质，心里就认为这些法有一定的真实性，有我性，把宇宙器世间当作是宇宙器世间，丝毫观察不出器世间都是如来藏的属性，是如来藏的功能作用，是如来藏的种子构成的，因此就认为法有我，就有法我执；众生把自己所认知的一切理法都当作真实有，一切理法就是理法，丝毫观察不出这些理法的实质到底是什么，不知道都是如来藏的属性，没有其所谓的自体性，因此就认为这些理法有我性属于我所有，因此就有法我执。</p><p>如果众生能现前观察出宇宙器世间都是如来藏的种子构成的，都是如来藏的属性，本质就是如来藏，那么众生就不会再把宇宙器世间当作宇宙器世间了，就会从宇宙器世间上看到如来藏的影子，看到如来藏的功能作用，就没有法我见和法我执了；如果众生能现前观察出六根六尘是如来藏的种子组成的，是如来藏的属性，本质就是如来藏，那么众生就不会再把六根六尘当作是六根六尘，就会从六根六尘上看到如来藏的影子，看到如来藏的功能作用，这样就没有法我见和法我执了。（六根六尘是一切法中的一部分，也是法。）</p><p>如果众生能现前观察出一切规则、法则、世俗谛和胜义谛，都是如来藏的种子形成的，都是如来藏的属性，本质都是如来藏，那么众生就不会再把这一切规则、法则、世俗谛和胜义谛当作规则、法则、世俗谛和胜义谛，就会从这些法则上、谛理上观察出如来藏的影子，看到如来藏的功能作用，这样就没有法我见和法我执了。所以地上菩萨所证的一切法无我，不是指一切法都不是如来藏，而恰恰是一切法都是如来藏，并没有一切法的自体性，一切法都是空的，幻化的、不真实的、能毁灭的。一切法非我、不异我、不相在的意思，不是说一切法不是如来藏、不异如来藏、与如来藏不相混合，而恰恰相反，一切法的本质都是如来藏，是一真法界中的法，全部都是真。</p></div>"
},{
    "title": "第六章 无为法与有为法",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  无为法与有为法</strong></p><p>一、什么是有为和无为</p><p>为，是为了，是目的，是要求，是求取。有为，就是有求取，有要求，有造作，有所得，有所求，有目的，有心行，有造作，有我，有四相。无为就是无这些心念，与有为相反。</p><p>无所求的心是无为的，无所得的心是无为的，对三界世间没有心行的心是无为的，不是被出生的法是无为的，心量广大无边际的心是无为的，没有烦恼的心是无为的。不需要三界世间法的心是无为的，没有任何条件就可以存在的心是无为的，不想造作的心是无为的，无我的心是无为的，无四相的心是无为的。</p><p>如来藏在无为中无私为众生服务，在运行三界一切法中心却是无为的，无为中有为，有为中有无为。七识修到一定程度，才从有为性逐渐转变为无为性，在有为中，心地是无为的，逐渐与如来藏相应，完全无为完全相应时就成佛。</p><p>只有如来藏这个无为心能离开一切法而存在，七识心的无为离不开三界世间法，离不开无为的如来藏。如来藏这种无为法离开三界有为照样可以单独存在，就是无余涅槃时，无余涅槃里，如来藏寂灭无为，一法也不造作，清净最极清净。所以离开有为法，仍然有无为法如来藏。所以祖师说：有物先天地，无形本寂寥。</p><p>一切法依心而有，既然一切法分为有为和无为两方面，那么心就有有为和无为两种。有为法是有为的七识心和无为的如来藏共同变造出来的，如三界世间一切法，如身口意行；无为法也是有为的七识心和无为的如来藏共同变造显现出来的，如四禅定、灭尽定、无想定等等，如初果到四果，如明心见性，如六七识的无为性。只有如来藏这种先天性的无为法，不用有为无为的七识心出生和变现，也不用如来藏自己出生和变现。但是要显现出来，还要依靠七识心的世俗有为法的衬托。</p><p>二、如来藏没有作主性</p><p>八个识中只有如来藏是无为的心，是无为法，祂无心造作任何法相，无心造作任何业行，因缘不具，就不出生任何一个法。如来藏总是随缘不变，不变随缘，祂无为的一个特点就是随缘，没有缘就不勉为其难。如来藏又没有我性，不自作主；如来藏又心空无为，无相无愿，所以就无作。因此说如来藏不是作主识，有我才要作主，甚至是以我为主，如来藏无我，祂就没有意愿主导什么法。</p><p>三、真妄两种无为法</p><p>无为法，一个是指真心本来的无为性，另一个是指七识妄心通过修行，后天具有的无为的心性。如来藏即有有为性，也有无为性。如来藏的无为性，指自心本性是无所为的，对一切法都是无心，没有主动想造作什么法的心行，对一切法都不作主。虽然如来藏在出生万法的时候，是有造作有心行的，但是心性却仍然是无为的，没有主动造作的心，不知道自己在造作什么，对境界法一无所知，也不想知，又能随缘出生一切法。</p><p>如果如来藏不是无为法，世出世间就再也没有无为法了。七识无论怎样无为也没有如来藏无为，即使佛地的七识也是如此。如来藏如何无为？祂尽管造就了无数世俗法，心仍然是空的、无心的、无愿的、无起灭的、无作主性的、无我性的。如来藏是无我性的，无我的就是无为的，不为自我，不为了任何目的，没有私利。</p><p>如果无我的心还属于有为法，就是严重的矛盾。如果如来藏纯粹是有为法，祂一定是生灭的。如来藏是如何有为的？造就世俗法就是有为，有为中却又无为。如果如来藏是纯粹有为的，七个识向如来藏学习什么？七个识如何靠近如来藏，向如来藏学习，改变自己的心性？七个识如何能面对一切境界如如不动？七个识如何能达到无为而成就佛道？如来藏如果是纯粹的有为法，我们参禅去证如来藏也没有必要了，悟后也无法转依如来藏的清净无为性，七个识永远无法转变心性，这样悟与不悟都不能成佛。</p><p>四、百法明门中的无为法</p><p>百法明门中的虚空无为，是指如来藏本体在运转一切法时，犹如虚空一样的如如不动，这就是无为的性质。如来藏永远是如如不动的，不管遇到什么境界，从来不动心思，心性是无为的。</p><p>真如无为就是指如来藏的无为，非择灭无为也是指如来藏的无为，不动无为就是指七个识修到四禅定的时候，心不动念，就无为了，身无呼吸脉搏心跳，也无为不动了，身心都无为叫作不动无为。择灭无为和想受灭无为，都是指七识的无为。意根在灭尽定里没有了想和受，只有作意、触和思，心行大部分无为了。</p><p>六种无为法里讲到了如来藏的无为，也讲到了七识的无为，真妄都包含其中。实际上如来藏本来就是无为的，心性无为，不妨其为众生为五阴服务的有为性，在有为中，心性是决然的无为。还有超过如来藏无为心性的法吗？没有了，七个识永远不能比如来藏更无为，五蕴永远不能比如来藏更无为，没有比如来藏更无为的法了。如来藏本来就是无为法，而七识修到相当程度才能逐渐无为，而后天的无为是有生有灭的。百法明门中六种无为法也包括了七识所修出的无为，所以无为法也有真妄之分。</p><p>五、有为法到底是什么</p><p>一切有为法都是如来藏虚幻出来的假相，人类为了充分的交流和表达，就为这些法相安立相应的名。没有名字也可以分别，只是众生之间不方便言语交流，不能清楚各自所指。畜生从来不给有为法安立名相，也照样分别，但相互之间无法交流沟通，只能意会，不能言传。</p><p>通过学法修行，在相和名上如理思惟观行，就会获得如实智，如实分别了知相和名的实质内涵，深知有为法的虚幻不实，心再不为有为法而动转，像真如一样如如不动。这样七识心离真如就会越来越近，越来越像真如，到最后心像真如一样清净，修行完毕。</p><p>诸佛菩萨现起的三千大千世界，就是有为法，它到底是什么？还是什么也不是？这些有为法都是如来藏里的无形无相的种子生成的，是空的幻化的，没有实质的法存在，所以不能说这些有为法是什么。但是也不能说这些有为法什么也不是，因为这些有为法在相上是存在的，有其相应的世俗法上的功用，虽然这些功用也是幻化出来的，实际上是如来藏的功用，但是这些功用确实是有作用的，所以才叫作有为法，否则就是无为法了。</p><p>有为法之所以叫作有为法，就是因为有世俗界的法相和功用，所以就对这些有为法相取名为某某，加以分别和执取。有智慧的人心里非常明了这些有为法的真实面目，可是却仍然要用这些有为法而毫无拘碍和违和，内心坦然，无贪无嗔，也不偏执，所行一切既不违真谛，也不违俗谛，用大智慧担当菩萨的利生事业。</p></div>"
},{
    "title": "第七章 如来藏与种子",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  如来藏与种子</strong></p><p>一、问：有人说：“本性清净的如来藏空性含藏染污之七识种子，故随业风漂转，于三界六道中受生，或是生天，或是下地狱。或是生人间，以否定正法故，复于地狱中现。”如来藏能受生吗？受生就是有生灭了吧？</p><p>答：第一，如来藏心虽然是空的，但不能称为空性，应该称作空性心，因为如来藏是心的本体，不是代表本体的性质，性质是附属于心体说明本体的，不是实体，依心才能有心的性质。</p><p>第二，空性不是实体，不能含藏种子，是心体含藏染污或者是清净的业种。</p><p>第三，无论是空性还是心体，都不能含藏染污的七识种子，因为七识的种子是识种子，是本然清净的，是清净的如来藏性，永远不会染污。应该说如来藏心体含藏七识造业的染污种子。</p><p>第四，如来藏不能受生，虽然如来藏含藏着七识的染污业种，但是受生是第七识去随业受生，如来藏只是随着第七识去受生。当第七识受生时，是如来藏让第七识去受生的，没有如来藏的配合输出业种和七大种子，第七识就无法受生。所以不能说如来藏天上地下人间的轮回受生，应该说是第七识天上地下人间不断轮回的受生。</p><p>二、如来藏是否有染污</p><p>有人说如来藏有染有净，所以才有转识成智之说。实际上如来藏本体是清净识，只是含藏了七识造作的染污业种，才使得如来藏不垢不净，如果如来藏不收藏七识的染污业种，如来藏就是清净无垢识。如来藏如果有染，就有烦恼染污业，可是如来藏并不造作什么善业和恶业，是七识有烦恼染污，造作善恶业，所以七识烦恼时造作的恶业就是染污业。如来藏就把七识造作的善恶业收藏起来以后，就含有了染污业种。</p><p>另外转识成智主要是让七识转识成智，七识有识性无明，没有智慧，或者智慧很低，才需要灭除七识的无明，灭除烦恼，出生大智慧，进而转识成智。在七识断尽无明，转识成智之后，存在如来藏或者是异熟识里的染污种子彻底断尽，不再拖累如来藏异熟识，不再限制如来藏异熟识的功能作用，这时候如来藏异熟识就大放光明，彻底绽放自身的一切功能作用，变成大圆镜智，方便说为如来藏异熟识转识成智。</p><p>三、染污的种子是转换的还是灭除的</p><p>染污的种子就是以染污的心造作的染污业行留下来的种子，这个种子成熟之后众生就受恶报，报尽种子就灭除。如果忏悔染污业，心转清净以后，染污种子也会消除，未来世不受恶报或者少受恶报，所以染污的种子是灭除的，不是转换的。如果无明渐渐灭除了，心就会转变得越来越清净，明渐渐的增加，染污种子消除的就会越来越多，直至完全灭尽，心究竟清净无余，就成佛了。在无明越来越淡薄，明越来越多的时候，染污的也越来越少，清净的善业越来越多，最后只有清净的业和种子，没有染污业和种子。</p><p>四、受熏持种的真义</p><p>有人说第六识不能熏染第七识，只能熏染如来藏。这句话对不对呢？关键是要看第六识与第七识和如来藏的关系如何，第六识熏染的目的是什么，如来藏能不能受熏。比如说第六识遇到佛法，觉得佛法太好了，能断除无明，得到解脱，于是就努力修学，一心要求解脱。在这修学过程中，是熏染了如来藏，还是熏染了第七识？当然是熏染了第七识，如来藏不受熏，但第七识受熏以后，业种会存在如来藏里。</p><p>第六识学佛修行，不能熏染如来藏，如来藏永远不会学佛修行，所以第六识熏染不了如来藏。第六识有无明，想要断除无明，能熏染如来藏也断除无明吗？显然不行。因为如来藏无无明，既然没有无明，就不用断除无明，所以第六识熏染不了如来藏，只能熏染第七识。如来藏手无寸铁，又聋又哑又瞎，祂无法能学佛修行，无法断除烦恼，或者弃恶从善。</p><p>第六识想成佛想解脱想涅槃，无论怎样熏染，如来藏都没有这些心行和想法，否则就落入于世俗心行当中了，所以第六识只能熏染第七识产生这些想法和愿行。如来藏本身就是如来，是解脱自在的，本身处于不生不灭、不动不静、不来不去的涅槃境界中，如如不动，所以祂不会有成佛涅槃的想法。让如来藏修三十七道品，一是祂听得懂，二是没有必要修，让祂修戒定慧，祂本来就有戒定慧，不用教导，让祂断除烦恼，可祂什么烦恼也没有。想熏染如来藏的人，根本不明了如来藏是什么，不知道什么是熏染，熏染的意义是什么。只是各种悱恻，各种妄想，头上安头，画蛇添足，折腾几十年，仍然不知学佛为何。</p><p>意根无始劫一直与无明相聚，被无明缠绕，出生六识以后，意根就把无明传导给六识，熏染第六识。学佛以后，第六识觉悟了，就会带动意根一起觉悟，熏染意根一点点修除无明，一点点的明。在这其中，意根受熏，就有了种子，存入如来藏中保存，以备后世之用。后世如何用呢？种子缘熟，再熏染第六识，第六识觉悟后再学佛修行熏染意根，形成新的种子，存入如来藏中，这样就像滚雪球一样，意根被熏的种子越来越多，越来越大，无明越来越薄，最后断尽一切无明，众生成佛。如来藏在其中，不断的收存和输出被熏的种子，功不可没。如果没有如来藏存种子输出种子，修行仅仅是游戏而已，修了也等于白修，一毛不存，后世无功可用。如来藏存种子的过程叫作受熏持种。</p><p>古文，不是每个人都能拆解，深知其义。甚深佛法，也不是每个人都凭大脑臆测得准确的，谁也不要自以为是，认为自己如何如何。想要如何如何，是非常不容易的，需要极大的善根福德智慧。还有人说修行成佛，不用如来藏，不知道他能用什么成佛。自己的主人，自己无量劫的恩人都不认，头脑确实应该开开窍了。</p><p>五、命终往生善道还是三恶道由什么决定</p><p>有人说人死的时候，自然有如来藏引导入善处。可是如果如来藏能自然引导入善道，那么为什么所有众生无始劫以来在三恶道的时间远远多于在三善道的时间？如来藏凭什么引导众生意根入善道？有人说只要熏习了善法，如来藏就能引导入善处。可是熏习善法的人非常多，熏习佛法的人也非常多，熏习正确法理的人同样也非常多，在临命终时能够保证不入三恶道，靠如来藏引领入三善道的人有几个？</p><p>   如来藏凭什么引导意根入善道？是凭借存入如来藏里的善业种子才能引导入善道。但是如来藏里还有无数恶业种子，是无始劫以来造作恶业时留下来还没有现行的业种，如来藏究竟要依据什么业种引导意根投生呢？这个问题非常重要也非常关键。佛在经中为众生保证死后不入三恶道所应具足的条件，一是阿含经中所讲的断我见断三縛结，二是大乘经典中讲的明心见性，三是阿弥陀经中讲的临终时一心不乱的念佛三昧功夫，四是观无量寿经中讲的十六观中修成第三观以上，以及九品往生各具的因缘条件，五是其它净土经所讲的往生条件，六是非学佛人死后生天所应具足的善业种。</p><p>这些条件说明了并非是只要熏习了善法佛法就能不入三恶道，就能生到善道，而是要看这一期生命中所造作的善业势力大还是恶业势力大，以及无始劫以前的重大恶业种子是否消灭，或者是重大恶业的种子现行的因缘是否具足，到临命终的时候善业种子的力量与恶业种子的力量哪个强，强者先牵，如来藏要以强业而牵引众生。死后到底趣向哪里，是由善业力和恶业力相较量而决定的，而不是由如来藏决定的，如来藏只是随顺业种的力量而已，如来藏无心引导众生的趣向。</p><p>无数人虽然有缘熏习了正法和善法，但贪嗔痴烦恼仍然具足，一点没有断除也没有降伏，这显然烦恼业的势力仍然很强，临命终当然是被烦恼恶业所牵趣向三恶道。无数人虽然熏习了善法，可是在熏习过程中，又造作了诽谤佛法僧三宝的恶业，这个恶业是极大的，所有善业的熏习都敌不过诽谤三宝恶业的力量，那么临命终时如来藏当然是随着诽谤业的种子势力而引导意根入三恶道。即使在现世没有造作什么比较大的恶业，可是无始劫以前的恶业缘熟了，今世熏习善法的善业力量不够强，缘不成熟，不足以改变恶业的缘，如来藏就要以强大的恶业种子缘而引导意根入三恶道。</p><p>如果在现世熏习善法的力量不够强大，比较劣弱，只是意识明白和理解了善法，而没有熏习到意根这里，意根没有证得善法，从而不能变成一切身口意行的动力，五阴身的一切法都没有改变，或者改变微小，不足以对抗烦恼恶业，这样的熏习就没有力量，也不能作为种子存入如来藏里，或者只存入一点点种子，那就起不了什么作用，不足以对抗烦恼业的势力，就不能改变后世三恶道的命运。五阴身的一切身口意行都要作为种子存入如来藏里，无数人虽然熏习了善法，可是身口意行没有改变，仍然造作贪嗔痴烦恼恶业，那么存入如来藏里的就是贪嗔痴烦恼业，临命终烦恼业的力量非常大，就会牵引意根入三恶道，不能生到善道中。</p><p>五阴身的身口意行是谁作主造作的？当然是意根作主造作的，如果众生在现世中熏习的善法没有落入意根心中，意根不证得佛法，意根就不善，就不会作主造作善业，善业种子就不会存入如来藏心体当中，那么如来藏如何能够引导意根投生善道？总结起来说，不管是什么人所熏习的善法如果不把意根熏染成就，不能改变意根的烦恼染污性，不改变意根的心行，那么意根就会仍然作主造作染污业，染污业就会存入如来藏心体中成为种子，生出后世的恶业果报，这个人命终就不能去善道。</p><p>六、如来藏如何记录业种</p><p>假如一个人错解一个法义，还非常执着自己的见解为是，认为其他人的都不对，如来藏该如何记录这件事呢？是按照他错解出来的内容记录形成业种，还是按照实际理体而记录呢？</p><p>如来藏永远是根据事实而记录形成业种，这件事的事实是什么？是这个人错解了法义，并不是他认为和抉择的那样。尽管这个人意根的思心所抉择法义应该是如此，可事实是如彼，如来藏就会记录他错误的思想观点，形成业种。后世现行业种的时候，就是愚痴果报。</p><p>七、揭秘连体人五阴身的运行机制</p><p>有一对双头人连体姐妹，身体很大一部分都是共用的，心脏以上部分是各自独立的，每个人一只胳膊一条腿，中焦和下焦共用一部分，身体总共有二分之一到三分之二部分是各自独立的。姐妹俩的脊椎在骨盆处融合在了一起，共享一部分神经系统，共用一套生殖器官。她们能一起骑自行车、打球、游泳、驾驶汽车。</p><p> 两个人一起入胎住胎，在母胎中两个人的如来藏共同根据业种变造身体的共同部分和各自不同部分。当然她们有共同的业种，曾经造作过共同的业行，前世关系太密切，共用过很多东西，以至于今世要共用一个身体，必须紧密配合着生活在一起，如果不配合，两个人都无法生存下去。这就是业障，非常不自由不独立的业障。所以人们之间的关系要保持适当的距离，不要太亲密了，也不要发誓来世要如何如何，等到未来世真的如何如何的时候，那不一定是快乐的，甚至是非常痛苦的。</p><p> 两个人的如来藏根据相同的业种，输出四大种子成为共同的四大，和合运作造就出身体的共同部分，而各自独立的部分，就要由各自的如来藏单独输出四大种子变造。色身稍微完善的时候，两个如来藏各自出生意识，就有了两个觉知，胎满就共同出生，成为连体姐妹。还好两个人是同性别的，如果是不同性别的，在一起生活将会很尴尬了。</p><p> 两个人的手和腿脚需要共同配合，吃饭穿衣走路等等五阴活动就要两个人共同配合协调一致。头脑思惟各有各的，习气爱好各不相同，性格脾气秉性也不同，连在一起就要互相将就协调，否则就会很不愉快。各有各的呼吸和心跳，饮食和水各进各的胃，个人吃饭个人饱，但是从胃以下，消化系统有共同的部分，就共同消化这些饮食，然后用共同的排泄系统排泄出去。虽然个人吃个人的饭，互相之间还是有影响的，一个人有病，另一个人可以代替吃药。</p><p>两个人共用一部分神经系统，对外界的应激反应比较一致，应对的方式也差不多。两个人的意根虽然性情不同，因为有善缘，应对共同的人事物，就会互相配合和迁就。从这里看来，两个如来藏的分工配合简直太微细和微妙了，如来藏无所不知，所以只要业种允许，如来藏肯定会密切配合，不用言语和心念就完成了协调工作，不可思议。</p><p> 六识当中，两个人的身识互相配合是最多的，几乎一直都要互相配合，否则就做不成事，因为神经系统是相关联的，也能互相感知。两个人的眼根在各自的头上，眼识各用各的，但是因为在一个身体上，所面对的物色也不能相差多远，眼界就会受到限制；耳根在两个头上，各有各的耳识，各听各的声音；鼻根在各自的头上，各有各的鼻识，可以各嗅各的香尘；舌根在各自的头上，各有各的舌识，可以各尝各的味尘；意根各有各的，意识就各在各的胜义根里，思惟了别不同的法。</p><p>当两个人的五阴身要活动时，两套八识就要互相紧密配合了，各有分工，相当于十六个识分工合作，比八个识还要复杂得多。腹部下焦共用的部分很多，几乎都共用了，那么消化排泄时，必须心往一处用，共同意念，共同感受，彼此不能分。有病时等于两个人都病了，疼痛时两个人都同时疼痛，但是还是各自的身识和意识分别感觉病痛，感受就有一些差别。</p><p> 七识当中，联系最密切的是两个身识的配合，共用一个身体配合得就非常迅速，接近于天衣无缝，没有丝毫违和感，也不牵强。最关键的是两个意根的指挥运作，如果两个人我执都强的话，习气还截然相反，那就要经常争吵了。两个人是善缘，虽然性格心情习气爱好不同，也能协调得很好，心往一处用，互相关照，彼此才能得到最大的受用。</p><p> 卧床睡觉时，两个意根一致决定躺下，不能随便活动身体，怕影响另一个人。如果一个人睡着了，六识灭去，身识也就灭去。另一个人还没有睡着，如果活动身体，就会促使另一个人的意识身识生起，从而醒过来。如果心里思惟太多，也会影响另一个人的睡眠，因为有共同的神经系统，即使没有，心念力磁场力也会影响另一个人，这里就涉及到很多秘密了。</p><p> 如果一个人身体渐渐不能用了，或者是死亡了，属于这个人的色身功能作用就不起用了。头没有作用了，胜义根毁灭了，一只胳膊和腿没有用了，心脏停止跳动，内脏都不能用了。而另一个人还活着，就会勉强使用残缺不全的身体，其功能也会受到很大的影响和限制，毕竟死亡的那部分身体不能完全切除，就会传染一些疾病。即使能防止疾病的传染，由于一些功能的缺失，使得活下来的那个人五阴功能受到很大的阻碍，生活相当不方便，生命质量大大的下降，其寿命也不会有多长。</p><p> 有生命就有苦受，何况还不是正常的生命，两个身体连在一起的生命更是苦。但是由于众生贪生，有可能不会感觉到苦，而要不断的追求享乐，甚至以苦为乐。众生就是这样的无知愚痴，贪欲极重，即使再苦，也不会有任何出离苦的想法和追求。有智慧无愚痴，就不会有贪求，就会知苦求断离，所以解脱的根本在于智慧。</p><p>八、如来藏依据什么执持和变造色身</p><p>如来藏常处寂灭而不动，如果祂要现行出什么法，一定是意根心动的结果，一定有意根这个俱有缘。表面来看如来藏在形成名色受精卵，变造受精卵和修复色身组织的时候，好像没有意根的功能作用，实际上都有意根的作用，意根永远与业种相应，如来藏又随顺业种，有福德的业种和无福德的业种都随顺，就等于随顺意根一样。如来藏极大多数时候出生世俗法都是依据业种，即使有意根不断的思，不断的抉择，如来藏在配合意根的时候，也是要依据业种，依据福德因缘，依据其他因缘条件。</p><p>如果因缘条件不允许，福德不足，也没有业种，或者业种还没有成熟，如来藏就无法按照意根的抉择出生法。比如很多人想升官发财，想拥有殊胜的世俗果报，可是没有业种，因缘也不成熟，就只能继续旧日，过普通平民生活。再比如说有的人应该是多病的果报，不管怎样努力，花费多少金钱和精力，都不能把身体修复变得健康。即使是皇帝那样的福德也不行，而且一旦皇帝把福德消耗殆尽，就有可能自杀，或者被杀或者被篡权推翻。世间有不少人刚出生时都有大福德，因为从小就极度的享受和消耗这些福德，长大以后福德消耗没有了，或者死，或者生活困窘，或者多灾多难。</p><p>三界果报随着业力牵，如来藏随着业力转。但愿力如果大于业力，就能牵引着如来藏随着愿望走，凡夫发大愿慢慢就会摆脱业力的束缚，脱胎换骨成为圣人，终究成佛。所以忏悔发愿就是一种强有力的修行方法，只要有愿，只要意根有愿，早晚都有实现之日，所有的愿都不是空愿，都会实现，只是因缘何时具足的问题。这些大愿发过之后如来藏记载，种子成熟时就会如愿。我们所需要做的一是要发清净大愿善愿，二是要努力促使愿力的种子成熟，将来就会得到愿果。</p><p>九、七大种子的作用</p><p>七大种子：地水火风空见识大种子，前五大种子地水火风空用来构成色法，见大和识大种子用来构成心法。识大种子构成七识的心法，见大种子形成如来藏见一切法的功能作用。这样整个五蕴世间一切法都具足了，色法和心法包括了一切法，如来藏用见大种子把一切法都统摄在一起，形成完整系统的世间法。</p><p>十、世间一切法相到底都是什么</p><p>楞严经第三卷佛说七大种子本性圆融，本如来藏，不生不灭，周遍法界，湛然常住，循业发现。既然七大种子本来就是如来藏的性质，与如来藏一样不生不灭，不增不减，不曾染污，互相圆融无碍，形成虚妄世间，那么七大种子就与如来藏一样不来不去，不空不有，不变不异，清净常存，而无影像。七大种子所构成的世间到底是什么样子什么性质呢？</p><p>七大种子不空，因有其功能作用和属性，能形成万法，又不生不灭，是如来藏心体中实有法。虽不空而无相，不具世间任何俗相，因而俗人之眼不能见不能觉不能知，谓之为空，实则是空性的。</p><p>既然七大种子无相而空，又不生不灭，那就不会从如来藏之中生出去，也不会灭回到如来藏之中来。七大种子既然不出如来藏之外，而能形成世俗诸法，那么无相之法就不能形成有相之法，形成的世俗法相也仍然是空，是无相，是空性。又如来藏无相，之中不能存有相之法，互不相容故，故一切七大显现形成的世俗法必然也无相，才能存在如来藏空相之中。</p><p>那么众生所见一切世俗法为何有相？众生为什么见到了有相之世俗法相？比如说众生见有四大色身七大五阴身，从甲地走到乙地，五阴跃然现前，有我有人有物有时间有空间有地点，什么都有，一样不缺，这些法相都是什么？为什么有色相、有心相、有法相？四大、五大不曾生，不会从如来藏中出去，为何会出现俗相的色身以及种种物相？见大识大不曾生，不会出到如来藏之外，世俗心相为何出生和现前。</p><p>色身是假相妄相，实际是不存在的；五阴身是假相妄相，实际是不存在的；甲地乙地是假相妄相，实际是不存在的，时间空间是假相妄相，实际是不存在的。虚幻所见，见也虚幻，连幻也幻。</p><p>这一切法都没有生，那就谈不到灭，七大种子从来不出如来藏之外，根本没有从如来藏里出来过，也没有灭过，没有灭回过如来藏里。根本没有这回事，如果有，如来藏之外就有了法，不属于如来藏，那么这样的法与如来藏的界限是什么？二者的关系是什么？这就不好办了。既然一切世俗法都没有生也没有灭过，究竟是谁见到了这些法生、这些法灭？用什么见到的？见到的人生过没有、会不会灭？见的过程和结果有没有生、有没有灭？是什么法相？</p><p>如来藏里也没有五阴身从甲地到乙地这回事，没有入胎、出胎、离身这回事，没有生什么法和灭什么法这回事。一切事相法相都是七识的妄见，虚妄的见，所以才见了虚妄法，其实没有其事，什么事也没有，都睡觉去吧！如果睡不安稳，睡不安心，那就起来学佛法，学然后证，一切法的实质实相尽量都证到，把一切法相都认清楚。世间假戏里根本没有人，也没有戏，没有观看者。那是什么？梦。梦也不是，梦也没有。谁见梦？谁看戏？无人。</p><p>最后真证得这些法的时候，痛哭一场吧！无始劫以来简直都冤枉死了，白白的造作了那么多的业行，种种取舍、贪执、妄动，种种苦恼，那么的用心，那么的纠结，结果却什么也没有。可怜不？</p><p>十一、如来藏的五大种子功能作用</p><p>如来藏的本有种子是七大种子，其中五大种子地水火风空是组成物质色法的根本元素，见大种子和识大种子是组成众生八个识心心法的元素。色法就是色声香味触法六尘境界，加上众生的五根，总共有十一个色法。宇宙器世间中所有的物质色法，包括众生的色身，大到宇宙世界，小到一个微尘的色声香味触法，都是如来藏用五大种子形成的。</p><p>如来藏是如何输出五大种子形成物质色法的？最初输出的五大种子是无形无相的非色非心法，形成了最初极其微小的微粒以后，就变成有相的色法了。最初的色法不仅肉眼见不到，最精密的显微镜也见不到，然后微粒快速的堆积组合，就变得越来越大，成为精密仪器可以见得到的电子、质子、中子、核子、夸克等等非常微小的粒子，最后形成肉眼可见的有形有相的物质团。</p><p>如来藏这个操作非常不可思议，能把无形的种子变成有形的色法，真就像凭空幻化的一样，如来藏可以说是最伟大的魔术师了。如来藏把五大种子的比例和数量稍微变化一点点，物质色法就改变，物质属性就改变了，而且物质色法上的五大种子还会刹那刹那的输出和收回来。如果物质处于生长阶段，输出种子的数量会不断的增多，比例也会发生变化，如果是物质在衰老成熟阶段，种子输出的就会越来越少，比例也会发生变化。</p><p>属于同样的物质，在不同阶段和不同的环境条件下，成分不同，功用不同，色香味不同，散发力不同，生灭变异的时速不同，形状和外观都不同。  物质从最初微小的微粒开始就具有一定的势能和动能，因为种子在微粒上刹那刹那输出和灭回，生住异灭不暂停，微粒就会有规律的按照一定的轨迹高速运动，从而产生了能量。从最微小的粒子不断的聚合形成小微粒，小微粒又聚集成大微粒，再进而形成更大的微粒，最终变成有固定形状的物质，能量越聚越大，作用力也越聚越大，磁场力越聚越大。</p><p>各种微粒都有一定规律的运动，沿着固定的轨道，运动就产生势能，有势能就有能量，人们利用能量就能为人类的生存造福，物质种类众多，所产生的能量种类也多。世俗界出现的各种学科，比如物理学、化学、光学以及其他学科，都在研究物质色法，研究物质色法的能量以及能量的转换和守恒，但是都没有得出最终完美的结论，因为科学家都不懂如来藏法，不知如来藏的运行原理，所以他们所有的高尖端研究和科学实验，都不可能达到究竟和圆满，只有佛陀能够洞察物质世界的究竟底源。</p><p>如果我们把物质色法产生的原理和科学实验结合起来，就能攻克世界上宇宙中所存在的一切物理、化学、光学、数学等等所有不可思议的现象，学好唯识具有唯识种子的智慧，世间所有的学科我们都能探究得一清二楚，并且直达根源，包括宗教、哲学、心理、生理、生物学等等所有学科，全部是如来藏的功能作用。如来藏法把三千大千世界中的一切奥秘全部都能揭示出来，这样宇宙真理就彰显于人类世界，我们依之就能获得最深的智慧，智慧到极尽了就成为一切智者，成佛了。</p><p>等我们修学佛法明心见性以后。再往上进一步修学，具有唯识种智的时候，唯识的智慧开发出来，如来藏的种子功能作用证得了一部分之后，在世间法里，我们只要接触一个门类和学科领域，就可以成为绝对的权威，把精力用在任何一种学科领域里，我们都可以成为顶尖的人才，超过些世界上最顶尖的科学家，任何一个科目，任何一个法门，任何一个领域，我们都可以成为一个顶尖者。这就是我们学习佛法学习唯识，证得一切法的唯识性真如性，在世间法当中所能获得的最大益处，佛法能让我们在任何领域都是智者，在世间法上无坚不摧。</p><p>十二、如来藏中是否有无明种子</p><p>如来藏中法尔如是的有第七识的识种子，却没有第七识的根本无明种子。为何这样说？因为凡是种子皆是身口意行造作留下的业种子，无业就没有种子，七大种子除外。第七识与如来藏恒俱，最初时没有六识和五阴身，无法造作业行，也就不能有种子留存如来藏中。而六识五阴身出生以后造作身口意行，恰恰是依于第七识的无明，第七识无无明，就不会出生六识五阴身，也就没有业行，也没有大千世界，一片寂静。如果第七识真的没有无明，也就会入涅槃了，而且是佛地的涅槃。可见，第七识具足根本一切无明，因此兴起世界和众生世间，轮回不止。</p><p>十三、六七识在如来藏心中，还是如来藏在六七识心中？</p><p>如来藏如果在六七识心中，六七识心有中吗？中的位置怎么算？六七识如果在如来藏心中，如来藏有中吗？中的位置怎么算？</p><p>每个人全体五阴十八界，都是如来藏用七大种子造就的，七大种子是如来藏中的法，说七大种子输出来形成各种法，其实七大种子并不曾出如来藏之外，否则如来藏之外就有独立的法存在了，不归于如来藏执持，这是不可能的。既然七大种子不出如来藏之外在众生五阴十八界上不停的生灭变异，那么五阴十八界能在如来藏之外吗？如来藏之外有独立的法存在吗？</p><p>一真法界的意思是，众生世界全体都是一个真实的法界如来藏，都是如来藏里的法，没有独立于如来藏之外的法。虽然说了里和外，但如来藏还是没有里和外，全体即真如，找不到外，也就没有相对的里。</p><p>十四、生命与自然现象背后的机制</p><p>很多人都感叹生命与大自然的神奇和奥妙，以至于各领域的科学家一生都在致力于探索生命和自然的奥秘，想要揭开世间一切法背后的运行机制。因为我们的无明深重，智慧有限，眼界太窄，知识面也太窄，观察力太弱，观察不清楚背后的运行机制到底是什么，对很多自然现象认识不足，不了解其本质相状和内在的机制，所以才觉得生命活动很神秘。如果把身体所有的活动的机制，以及大自然的生住异灭的现象看得一清二楚，这些东西对我们来说就没有什么神秘性了，就会觉得色身的生命活动本来如此，宇宙器世间就是法尔如是的，没有什么好神奇的。</p><p>宇宙器世间的一切自然活动，风吹、草动、电闪、雷鸣、暴雨以及清风和煦，春来秋去，一年四季的更替，这些运行机制是自然而然而有的，还是因缘聚合而成的？表面看都是因缘所成的，包括共业众生的业缘，是共同的业力所感应出来的，而业不同的众生所生存的环境则是另一种状态，没有生老病死的现象，没有一年四季的更替，生存环境总是很舒适美满，这是众生的清净业所感召的。娑婆世界就有生老病死、生住异灭无数变异的现象，这是众生善恶杂染业所感召的。</p><p>那么这些生命和自然现象是如何发生的，背后的运行机制是什么呢？如果说这些现象都是因缘所生法，这只是表面的答案，实际上都是如来藏在背后执导这一切法，如来藏根据众生所造的共业和别业，现出业缘，再依据业缘生出一切法。如来藏之所以能造就这一切法，是因为祂有七大种子，七大种子的不同组合形式，就构成了色彩纷呈的世界，其中色法是五大种子构成的，心法是识种子见种子构成的，色法和心法和合能显现出非色非心法，这样世间一切法就周全了，众生世界就建立起来了。业种和业缘不同，如来藏分配的种子也不同，生出的法就有差异，因为有差异，法的功用才齐全，世界才能多元化。</p><p> 一切法的差异是由业种子造成的，业种不同，果就不同，现象就不同，但这些都是想象上的不同，实质是相同的，都是如来藏的功用。如来藏摆弄自己本有的种子，使其聚散离合，变化出世界生住异灭异彩纷呈的现象，业种和业缘改变，现象界就随之改变。所以生命和自然现象的背后运行机制就是如来藏生成一切法的法则，掌握如来藏种子的功能作用，就会慢慢揭开这些现象的秘密，就不会再感到自然界的神奇了。</p><p>十五、如何思惟一切法都是如来藏性</p><p>楞严经中世尊反复讲五阴十八界都是如来藏的性质，不是因缘性，也不是自然性。不是因缘性，不是自然性，多思惟思惟，就能理解了。可是如来藏性，就非常难理解了，即使证得了如来藏，也难以观察，理解上也不是那么容易的。</p><p>无形无相的四大种子，组成了最最微小的微粒，微粒再聚集，组成了稍微大一点点的微粒，然后四大种子不断组成微粒，微粒不断的聚集在一起，最终形成了肉眼能看得见的物质色法。从无到有，从空的无形的种子，到有形的最最微小的微粒，这本身就是非常神奇的，就像魔幻一样，所以才说如来藏就是魔幻师。</p><p>说是如来藏输出四大种子，实质上四大种子并没有出如来藏之外，组成的微粒也没有出如来藏之外，形成的物质色法也没有出如来藏之外。我们的色身就在如来藏里生生灭灭，没有出到如来藏之外，如来藏无形无相，色身就不可能有形有相，那到底是什么状态呢？</p><p>如果说物质色法有生，一定要脱离如来藏，出到如来藏之外，有单独的形相，四大种子出到如来藏之外，灭了四大种子又回到如来藏里。可是四大种子无形，怎么会变出有形的物质？如何转换？在如来藏之外，物质如何存在和变化？谁来依托物质？</p><p>四大种子组成微粒，微粒聚集，组成更大的微粒，四大种子不断组成微粒，微粒不断聚集，最后色身出现了，有形有相。色身却无生，没有出到如来藏之外，四大种子没有出如来藏之外，色身就不能出到如来藏之外。如果四大种子离开如来藏形成了微粒，四大种子离开如来藏，如何有功能作用，谁给它们的？种子离开如来藏，如何运作？如何从无形变造出有形？色身出如来藏之外，如何存在和变异？谁来依托它？死亡时四大分离，种子回到如来藏中，是如何回去的？如果出如来藏之外，也就谈不到回到如来藏之中。原来都是如来藏自己在玩，自己在搞游戏，自己魔幻给自己看的，自娱自乐。</p><p>识种子生出来，形成识心，识种子不出如来藏之外，识心就不出如来藏之外。离如来藏没有种子，离如来藏没有识心，没有识心的心所法，没有受想行识。如果受想行识在如来藏里运作，生生灭灭，乱起乱灭，那么色受想行识都是如来藏家里的事，幻化也没有幻化出家外，如来藏独享，自娱自乐。</p><p>一切法都没有出如来藏之外，所以无生，也不会回到如来藏中，所以无灭。世间什么现象也没有，也没有世间，什么也没有，什么也不存在，那么就成天睡大觉吧。可是是谁睡大觉呢？如来藏里的规则法则那么神秘，神神叨叨的，不弄明白，恐怕也睡不好觉。</p><p>十六、如来藏四大种子与人体精气神的关系</p><p>人体中的精和气属于物质色法，神是物质色法对识心的影响力。精是固态的，是如来藏用四大种子形成的，以地大为主的物质微粒。气，也是如来藏用四大种子形成的，以风大为主，总是处于飘动和流动状态。精和气两种物质在身体当中运行，能决定身体状态与健康，影响识心的情绪。当精比较充足，身体比较充满活力，促使气运行得比较通畅，减少阻碍，身体里的血液流动得就通畅，身体各器官得到血液的滋养，就会很健康舒适，这时人就有神，精神状态非常好，有活力，精力充沛，身体也显得健康有力。</p><p>相反，精不足，动力就不足，气运行不畅通，有阻碍，血液流动不通顺，身体器官的给养跟不上，身体沉重不适，人就会显得无精打采，没有神，精神状态不好，没有活力和体能。精气神三者体现了如来藏四大种子是否调和。</p><p>十七、如来藏中的见大种子与六七识的见的区别</p><p>六识和七识既是见分，也是相分，相分就是被意识所了别的法，意识就是见分。意识本身和意根也是相分，凡是被了别的法就是相分，主动了别的识心就是见分。</p><p>如来藏七大种子的见，不是见分，是见大种子，见大种子形成如来藏的见性。如来藏的见分，通过五遍行心所法作意触受想思运行出来，以想心所法为主，在一切法上都要如此的运作，就会了别一切法。但是这个了别，完全与七识的了别性不同，不是众生所熟知的六七识那种知色声香味触法的了别。没有唯识种智，不能现量观察，即使想象也很难。</p><p>十八、身体上发生的一点点的变化，都是如来藏运用四大种子改变的。身体的变化又影响心行的变化，是如来藏依据内外界的缘，改变了色身和心行，有时是依据业种改变的。身识的觉受与温度、暖度、气血和神经系统有关，眼识的觉受与亮度、色彩有关，刺眼是因为亮度，不是因为热度。</p></div>"
},{
    "title": "第八章 转识成智和转依如来藏",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  转识成智和转依如来藏</strong></p><p>一、转识成智的内涵</p><p>最初转识成智在初地菩萨果位，登门入室，入如来家里，成为佛陀真佛子，也就是佛陀的亲儿子。言外之意，初地菩萨之前都不是佛陀的亲子，包括四果大阿罗汉以及辟支佛。缘由就是他们未能转识成智，识性胜于智性，观一切法的慧力不足，观一切法有胜于一切法空。</p><p>在佛法修学上转识成智，是一个很高的门槛，其中涉及到定力和慧力，二者都有力，才能有能力从容迈过这道门槛。定力要具足初禅以上的禅定力，慧力要具足观空的智慧力，包括人我空和一分法无我空。其它如菩萨的自律性、心性、悲悯众生和愿力等等。持戒就是自律，然后才能戒他律他，成为众生的楷模和导首。戒律完善忍辱柔和，初禅定才能具足，以此初禅定，在断我见的基础之上就会依次断除种种烦恼，智慧的遮障就消除一部分了，如果烦恼习气也断除，智慧的遮障就会全部去除，慧日朗照乾坤。</p><p>由此可见，修行最终就是为了成就六七识空的智慧，意识依次证得一切法空，意根也依次证得一切法空，转六七识的识性成智性。有无明烦恼的识心就是识性，无无明烦恼的识心就是智性。断除烦恼要具足初禅以上的定力，还要断除人我见，才能转识成智。</p><p>二、什么叫作转识成智</p><p>识心的识性，是无明性、愚痴性、烦恼性、遮障性、执著性，其智慧就浅薄，见法往往就要落到法相当中，不具有唯识方面的智慧，不识法的真面目。明心以后，渐具禅定，断除了烦恼，去除了遮障，渐次过了牢关，在有余涅槃当中，命终有能力入无余涅槃而不入。</p><p>随后过如梦观，修学唯识，具有了一分唯识种智，见法知其唯识性，知法之实质，不落世俗法相之中，智慧有了质的飞跃，于是六七识就转识成智，入到如来家中，成为佛陀的真正佛子，可以绍隆佛种，替佛弘化一方。</p><p>转识成智的前提条件，必须证果，而且是三果以上，要有禅定，而且是初禅以上的禅定，要明心证悟，不仅有法界总相智，还要有后得智，能现前细微的观察如来藏在五蕴身中的运作，还要有一分唯识种智。所以没有禅定，就不要谈什么证，不要谈什么智慧，更不要谈转识成智，顶多有个不解渴的乾慧。</p><p>三、识心的认知达到什么程度才能叫作智</p><p>识心对法的认识分为不同的程度，有严重烦恼遮障的认知往往都是邪见，烦恼遮障稍微轻一些的认知有时候是正确的，但只是相对于从前错误的认知而言，还不是完全的正确，其知见只是往正确的方向扭转了一些，识心有了一些慧力，但还谈不到智。智是没有烦恼遮障以后的正确认知，因为没有烦恼遮障，识心的认知没有烦恼性染污性，能很明显的显露出清净性，造作的都是善业和清净之业，不会造作恶业，这时候的智几乎没有错谬，或者极少有错谬，值得信任和依赖，这时候才能叫作智。</p><p>佛陀临涅槃的时候曾经嘱咐后世众生要依智不依识，这个智不是普通的智慧的智，也不是刚刚证果和明心以后生起的无生忍的智，而是没有烦恼遮障的无生法忍的智，是转识成智以后的智，是道种智的智。刚刚证果和明心，智慧虽然比凡夫深一些，但因为有烦恼遮障，智慧还是比较浅薄，心地染污也比较明显，有时候也会因为烦恼而造作一些恶业，这就不是智了，所以对法的认知只能叫作慧，不能称作智。只要结果有损害作用，都是不智的，不能称作智，结果都是善的其行为才是明智之举，才可以称作智，才可以依赖。</p><p>凡夫的心识所思所想都是识性，依靠烦恼的惯性而生起的了别和抉择作用都属于识性，没有智。证果和明心没有断除烦恼的贤人，所思所想有了一定的智慧，识心的慧力增强叫作慧，但还不是智，大体上还属于识性范畴，不能完全依赖和依靠。所以很多人学了一些法就认为自己如何如何的殊胜和超胜，这都属于识性的认知范围，错误的成分所占的比重还是很大很大的，所以就不要太信己意了，这样的自信差不多就是误信，慢心所引发的结果。很多人自己所认为的不疑也不是真的不疑，智慧不足的时候，有疑也反观不出来，自己认为的事实往往也不是事实，判断失误而已。</p><p>四、什么是依智不依识 </p><p>佛在临涅槃时嘱咐弟子们在修学佛法当中，一定要严格遵照四依四不依法则：依法不依人，依智不依识，依义不依语，依了义不依不了义。虽然只有这四条，做起来是极难的，大多数人都做不到。</p><p>其中的依智不依识，就不是普通人普通的菩萨所能做到的，首先这个智，就不是一般人所能具足的，这个智是由凡夫的识以及地前贤位见道菩萨的识所转化而来的，是转识成智之后的智，是意识的妙观察智和意根的平等性智，是唯识种智的智是地上菩萨所具有的甚深大智慧。佛告诫众生汝意不可信，证阿罗汉果才可信汝意，临涅槃时又嘱咐一定要依地上菩萨的唯识种智依妙观察智平等性智，这样一看，世尊的两次嘱咐前呼后应，前后一致，大小乘修学全部都包含了。</p><p>为什么世尊要如此强调，如此严格要求弟子们？因为证得了阿罗汉果的人，烦恼断尽，一念无明断尽，解脱智慧现前，智慧没有了遮障，等于小乘解脱道的思想观念才没有错漏，才可以依止其解脱见地。而转识成智以后的地上菩萨，也断除了烦恼遮障，只有很轻微的我执没有断尽，具有甚深的妙观察智和平等性智，大小乘智慧极其深利，见地通透，对于一切佛法的见地才可以依止。其余的人，佛说甚勿信汝意，因为有烦恼遮障，智慧欠缺，有比较严重的错漏。</p><p>五、证得如来藏和成功转依如来藏之间的差距</p><p>证得如来藏是前提，转依成功是结果，前提和结果之间需要经历接近一个无量劫的漫长时间。证悟以后，可以现前观察如来藏在五阴身中的运作，发起别相智以后，智慧越来越深细，对于如来藏的观察越来越细致入微。在观察中就会发现五阴越来越不真实，对五阴身的执著越来越轻微淡薄；同时也能观察出如来藏在运作当中的清净无为性，以及无我无烦恼的有为性。</p><p>无论是如来藏的清净无为性和无烦恼的有为性，都是非常高尚纯洁的优良品质，六七识就会潜移默化的受到感染和熏陶，心性就会不知不觉的发生着变化，越来越趋向于如来藏的心性，这就是所说的转依如来藏。虽然说是在依靠着如来藏转变自己的心性，但是还没有从量变达到质变，量的累及还不足以在本质上和实际上改变自己的心性，所以依止如来藏还不是成功的。</p><p>转依成功有什么标志呢？成功的标志主要在于心性的转变，烦恼消除，心地清净，戒定慧具足，心量广大，誓愿宏深，无私无畏，无我无为。戒，体现在菩萨戒的圆满行持上，有相戒能自然全部守持不犯，不用意识压制和控制，自然而为都合乎戒法。心地转变，身口意行自然清净，之后自然就过渡到无相戒的行持上。心是万物主，心清净一切都清净，心地的清净无烦恼才有能力和资格行持无相戒，还没有断除烦恼的人就不能受持无相戒，因为心不能自律。</p><p>在禅定上要具足初禅以上的禅定直至四禅定，因为只有具足初禅定，才能保证心地清净无烦恼，才能生起甚深智慧，没有初禅定，烦恼必现行，有相戒都不能保证不犯，更没有资格和能力受持无相戒，心地不清净烦恼重故。在智慧方面六七识都已经转识成智，具有甚深的唯识种智，知一切法唯有识无他。</p><p>心地转依成功的菩萨，能如如来藏一般既有为又无为，有为时无私，无为时无我，有为无为、无私无我能够完美的结合在一起，不相违逆。因为禅定和智慧深厚，所以心空无相，无相就无为，不贪世俗法，其心背俗，无所作为，无相无愿无作。又其心能够悲悯众生，弘法利生不为私利，为报佛恩，愿绍佛种，发十大无尽誓愿，继承如来家业，广度无边众生，尽未来际，永不断绝。</p><p>六、证得如来藏就是证悟何须转依</p><p>见道，分为大小乘的见道，不是只有大乘才叫见道。大乘见道是实证如来藏，证得如来藏就是见到大乘修学所依止的道迹了，不是证得如来藏之后再多此一举的转依成功才是证悟，见到如来藏的当下即是证。至于说转依，悟后确实需要一点点的转依，转依成功其心性就接近于如来藏的清净性，断除了烦恼，在智慧方面具有唯识种智，这样就进入如来家，成为真佛子。</p><p>如果说转依成功才是明心证悟，那么证悟如来藏不是证悟，既然不是证悟，那就没有证得如来藏，而是解出来有个如来藏，解出来的如来藏就没有功德受用，于是才需要在身口意行中与如来藏的清净性对照，以约束七个识的身口意行，约束到一定程度，不会再有烦恼再造恶业了，就算证悟。但是这种约束，如果没有真正证悟，是不可能成功的，那么所谓的转依也永远不成功。因为没有证悟，如何能转依成功？证悟以后何须再转依成功，并且再确立为证悟？这不是很矛盾的问题吗？</p><p>证悟以后，才能慢慢的转依于如来藏的空性清净性，最后初禅发起，烦恼断除了，就是最初步的转依。二次转依成功是在八地菩萨位，究竟转依成功是在佛地，凡夫没有证悟不涉及转依的问题，更何况是转依成功，没有这样的事。要想转依成功最起码要断除烦恼，心性与智慧都与如来藏相近，靠近如来藏。如来藏一点无明和烦恼也没有，烦恼习气也不存在，六七识就要依止如来藏而清净身口意行和智慧，勤修戒定慧。</p><p>最初转依成功，起码要断烦恼，成为三果四果的菩萨，才能勉强叫转依成功。但这时候烦恼习气还在，与如来藏相差还是很遥远，大约还需要两个无量劫的修行，达到大乘无学了，就不用再转依如来藏的心性和智慧了。很显然，转依不是凡夫未证悟的人所能做得到的，只能想一想罢了。</p><p>七、证悟是什么境界</p><p>心经第一句话说：观自在菩萨行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。行深般若波罗蜜多，照见五蕴皆空。意思是说，证得具有般若智慧的心如来藏当下，心就空了。其中的关键字行，是参禅参究般若义理的意思，深是一个是指禅定深，一个是指参究的智慧深，方向明。在深的前提条件下，六七识生起了大智慧，智照法界实相，证得了五蕴中的一切法界都是般若心如来藏所现起的，五蕴的实质都是空的，是假相幻化相。</p><p>这样的话，内心深处就知道了没有真实的五蕴，那就没有了苦，一下子就度过了一切苦厄。所有的苦厄都是假相，不真实，是如来藏幻化出来的。这样照见五蕴皆空以后，就心空无为了，烦恼断除了，这就是大乘见道证得如来藏的功德受用，这就是意根见道，意根证得如来藏的三昧境界，定慧具足，定慧等持。所谓的照见就是顿悟的意思，没有中间琢磨分析思惟的慢慢理解的时间和功夫，知就知，不知就不知，没有犹豫。</p><p>这样照见五蕴皆空以后，还用另外去转依如来藏才叫作证悟吗？根本不用了，这就是真实的毫不含糊的证悟和顿悟，不是那种渐渐解得的，通过分析推理渐渐明了的解悟，这样已经进入大乘门里了，得到真实的功德受用了。如果是用意识推理琢磨猜测出如来藏，这种猜测推理没有任何功德受用，所以需要慢慢转依，然而意识再努力转依，意根没有证得，仍然不能转依成功，所以烂摊子事一大堆处理不了，烦恼仍然烦恼，无明仍然无明。</p><p> 就像以定为禅的那些人，修出了一念不生的禅定，以为这就是真心的无念境界，认妄为真，可是出定以后，妄念又出现了，由于心里害怕真心消失，于是就不断的修定，长期禅定，争取不出定，以保任定境，确保真心不失，美其名曰保任。然而定境终究会消失的，人终究要出定的，即使无量劫不出定，定境也不是真心自性。真悟了，还保任个什么？真证得真心了，还转依个什么？当下就是，当下心就空了，清净了，鲤鱼跳龙门。跳过龙门成为龙了，难道还害怕跳回去变成鲤鱼不成？除非根本没有跃过龙门，心里战战兢兢，患得患失，才需要保任和转依。</p><p>八、凡夫能否转依如来藏</p><p>转依如来藏初步成功在初地菩萨位，地前菩萨都是在努力的转依，在学着转依。凡夫因为没有证得如来藏，就依靠不上去，不知道如来藏在哪里，有是什么行相，那要怎么靠啊？就跟靠虚空一样，想象出来的如来藏，并非现实可见，没法依靠。</p><p>另外凡夫也无法主动利用如来藏，不知道如来藏在哪里，有什么特性，起什么作用，如何能利用如来藏？大家都是在想象着如来藏，叫作臆想和幻想，也叫作猜测。允许凡夫猜测，也允许猜测个七八成，但是没有用，等意识一灭，眼前就会一片漆黑，茫然不知所措。</p><p>转依成功的标志，是心性转变了，类似于如来藏的心性，烦恼断除了，智慧增长了。转依没有成功，但在一点点的改变着自己，降伏着自己的烦恼，一点点的在增长智慧，积累到一定程度，达到质的飞跃，烦恼断除，六七识转识成智，才是转依成功，但也是初步，完全转依，就成佛了。所以不能拿转依成功来判断是否明心证悟。明心证悟自有证悟的标的和内容，没有转依这个标的。</p><p>佛法很乱，乱的原因是，没有走过那条路，都是靠理解和推理加猜测，即使猜测得八九不离十，也是相当不准确的，因为毕竟没有亲眼所见，心里肯定是不落底的，照猫画虎不是虎。</p><p>九、如何是见相离相</p><p>见相离相，不是说见到任何相，心中不留相，把相空去舍去，心中清净无法。 这是修定的方法，尽量避免世俗相对自己心的干扰，心不受干扰就会清净了。这种清净就是无念想，是定境，外道们都是修这种定，一直修到非想非非想定，命终升天享福，福尽还堕。</p><p>而真正的离相，是面对世俗相的时候，心里清楚知道相的本质是什么，知道相不是展示给我们的表面相貌，实质是空的。空，一个是小乘的苦空无常无我的空，一个是如来藏空性的空。这样的话就表明了，不证果不明心根本无法离相，只能是躲相，即使能躲，也是暂时的，长时来看，根本躲不了，总得要去面对。</p><p>要证得如来藏以后心中才能逐渐离相，这是漫长过程，不可能一蹴而就。这个过程就是转依的过程，转依成功就转识成智，入如来家，具唯识种智。要想见如来藏，首先要明了如来藏的体性相貌，功能作用，然后带着疑情在五蕴十八界法的运行当中去寻觅去证得。在参禅过程中，当然要知道或者证得五蕴十八界的功能作用不是真实的不是我，是空的，才能不着五蕴十八界的相为我为真实，才能否定五蕴十八界。假法都否定以后，再疑那个真法，参来参去，菩萨六度因缘具足，就有可能证悟。</p><p>十、究竟怎样才算依止如来藏</p><p>现在很多人都大谈依止如来藏，都有点捕风捉影的意味。因为我们要想依靠什么，首先是要找到这个东西，并且了解这个东西，再判断这个东西是否值得依靠，能不能依靠得了，如何依靠，需要什么条件才能依靠，依靠之后会怎么样。这些都需要我们去了解和思考观察，然后再采取实际行动，以达到依靠的目的，获得安全和利益，想要依止如来藏也是要这样做。比如说我们要依靠一棵大树歇息和乘凉，首先需要准确无误的找到这颗大树，并且能够观察和衡量它，如何想办法走到大树底下，再判断靠在哪里合适和更舒服一些，靠在哪里能够遮风挡雨和防晒，然后放个坐垫坐下靠着它，依止如来藏也是这个道理。  </p><p>我们要想依止如来藏，首先得要证得祂，然后才能够现前如实的观察祂，并且要周遍的观察，对如来藏的大致体性都能如实的了解和观察，没有错谬了，才能依靠上去，身心世界才能开始转变。经过观察和对照，越来越看空五蕴的身心世界，直至整个世间的法也开始空，心性与如来藏越来越趋近趋同。只有心性真的已经转变了，去除了贪嗔痴烦恼染污，这时候可以说我们的心性已经依止如来藏得到转变了，也就算作初步的转依成功了。这时候已经转识成智，相当于初地以上的大菩萨了。  </p><p>如果内心还有贪嗔痴烦恼，染污仍然很重，智慧也很低劣，有极多缺漏，心就没有依止于如来藏，也没有靠近如来藏，与如来藏的距离还是相当的远，身心都没有一定的受益，这时候就不属于转依如来藏，因为身没有转，心也没有转，还是从前那个身心，五毒俱全，那无论如何也不是转依如来藏，而仍然是在依着无明烦恼，没有依如来藏，更谈不到初步的转依成功。</p><p>在证得如来藏以后，在五蕴十八界的运行当中不断观察如来藏的运作，这最少也要有别相智后得智，甚至后期要有一点道种智，才能如理如实的观察得到如来藏的运作方式和规律，否则就属于推理和猜测，想象如来藏的运作就不是如实观察了，也观察不到如来藏，那就不能真实的了解如来藏的体性，也就依止不了如来藏了。证悟以后，每次观察如来藏在五蕴上的运作，自己的身心都会有所触动，对比起来看，一个清净一个染污，一个有心一个无心，这样就能生起惭愧心、自责心和向往心，日久功深慢慢就被如来藏的心性所影响和熏染了，烦恼断除，转识成智，就初步转依成功了，完全彻底的转依就是佛了。  </p><p>证得如来藏以后在哪些方面来观察祂的清净性？在五阴的运作过程中，在六根的运作过程中观察。比如说在我们见色的时候，你要观察如来藏是如何清净的，没有心念和思想活动，更没有邪的心思。我们也要像祂一样，以祂为榜样，不要有那么多的私心杂念、自私自利的思想和贪婪心、争夺心、占有欲，把这些心行要去掉。在听声音的时候，要观察如来藏是如何清净的，祂不管接触到任何一种声音的时候都是如如不动，不被声音所转，那么我们听到别人言语，无论是赞美声还是侮辱声，都应该以如来藏为榜样，尽量不要动心。  </p><p>在鼻嗅香、舌尝味、身觉触、心思法的时候，面对一切境界的时候，都要观察如来藏是如何清净的，如何无私的，如何无我的，如何为众生服务的。这样观察以后，七识心就会受到熏染，在任何境界到来的时候，自己的心也就随之一点儿一点儿的清净下来，也开始无私无我了。</p><p>这样就慢慢地转依过去，心行改变了，染污消除了，烦恼断尽了，人空法空的大智慧就生起来了，转了识性为智性，第六识具有了妙观察智，第七识具有了平等性智，这时就算初步转依成功。之前都不成功，只是在慢慢学习着。没有证悟的人，不要动不动就说转依如来藏这样的话，因为离转依还太遥远了。即使是刚刚证悟的人，也没有资格谈转依的问题，烦恼一大堆，智慧低浅，哪有一点如来藏的模样？</p><p>十一、不住相要到初地以后才能做得到</p><p>问：是不是证道以后见雨相，心里才能自然没有雨相，也知道是下雨，但不住着？而证道以前，容易住着，除非有别的事情，转移了心念，或者不在意这个雨。凡夫原来的体系像照相机一样，在心念里要留下底片的。</p><p>答：所谓不着不住必须是面对雨相和一切相时的内心功夫，躲避相恰恰说明了无法不着相不住相。开悟以后的三贤位菩萨见雨相照样会着雨相，只是比从前轻微一些。从初地开始才能渐渐的不着雨相即直至八地菩萨，才真正不着雨相和其它一切相。</p><p>所以开悟以后要转依真如，到初地菩萨才能谈得到真正转依，因为六七识都转识成智了，这是转依真如的标志。八地菩萨才能转依很大一部分，但还不究竟。地前菩萨口里喊着转依，因为有烦恼，不可能转依成功，而真如没有烦恼，六七识与真如的心性相像吗？根本不像，染污重的缘故。喊口号喊到初地才相应一部分。而没有开悟的人，喊口号纯属是胡喊乱喊，都看不清自己是何面目，就抬高自己说转依，没有找到靠山的时候能靠什么？而自己是无法抬自己的，需要如来藏和因果来抬，才能抬得起来。</p><p>十二、良药也不能治病</p><p>甲：戒定慧是修行的主线，三者等持不可偏废。</p><p>乙：如来藏本来不持戒，也不修定，也不修慧，戒定慧是剩语。</p><p>甲：学佛的目标是得解脱，解脱世间一切缠缚。</p><p>乙：如来藏本来解脱，本来无缚。</p><p>甲：禅定具足才能证道，一定要修好禅定。</p><p>乙：如来藏本自具足禅定，不用修。</p><p>甲：如果能发心出家修行，降伏烦恼比较容易，禅定快速增长。</p><p>乙：如来藏本来出家，不用再出家。</p><p>甲：修行成就佛道要三大阿僧祇劫。  </p><p>乙：如来藏本来是佛，不用再成佛。</p><p>甲：多反观自心，降伏烦恼，去除染污。</p><p>乙：如来藏本来清净，没有烦恼和染污。</p><p>甲：那你还用修行吗？</p><p>乙：如来藏本来是佛，不用修行。</p><p>甲：你今天怎么挑拨离间犯戒呢？</p><p>乙：这都是如来藏做的。</p><p>甲：不说如来藏，只谈你。</p><p>乙：我依如来藏，转依如来藏。</p><p>甲：你是如何转依的？</p><p>乙：·········</p><p>如来藏：乙，我严重怀疑你是我生的，你怎么没有一点像我之处？我也怀疑你根本不想学佛修行，只打我的旗号，自己却什么也不干。我们之间的差别这么大，我自性清净，你为什么烦恼深重？我是佛，你怎么还在六道苦苦挣扎？我解脱，你怎么处处都系缚？我从来不犯口业，你怎么常常挑拨离间妄语两舌恶口？我常在定中，你为什么处处攀缘心散乱？我本出家，你为什么不能舍亲割爱、放弃世间名闻利养荣华富贵？我具足智慧，你为什么那么愚痴？</p><p>乙：你好就行了，我转依你。</p><p>如来藏：空口转依？你小心，再去三恶道，我可不奉陪了。个人业个人受，亲娘也没用，愿你好自为之，以后别再拿我说事，也不要把坏事都记到我头上，我不替你受报，也不替你成佛。</p><p>乙：··········</p><p>甲：别以为靠着如来藏就是天了，该干什么就干什么吧，偷懒没有用，捷径更没有，油嘴滑舌口头禅不抵业力和因果。如来藏法是治病的上等良药，你却只管把玩不吃，那你就再也无药可治了。</p></div>"
},{
    "title": "第九章 如来藏的行相和心所法",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  如来藏的行相和心所法</strong></p><p>一、八个识的行相</p><p>八个识心虽然没有六尘那样具体见得到的相貌，但都有其运行的行相，就是心的行相，也是心所法，可以被观察和感知到，所以也是一种相。七个识心的运行行相是被如来藏幻化出来的假相，也叫作名字，是生灭变异的，不是真实的。如来藏本身的运行行相法尔如是的存在着，依如来藏本体而有，不是哪个法生出来的，任何时候都存在和运行着，即使在无余涅槃里也不断的运行，没有灭过。</p><p>如来藏的本体无形无相，谁也见不到，佛也见不到。但是本体起用，就能显现出行相来了。开悟以后就能见到如来藏的用，也会明了如来藏的相，一切法其实都是如来藏的相，也是如来藏的用。而如来藏的见性也就是五遍行心所法，入地菩萨和佛能观察得到。开悟以后能见到如来藏的功用和运行轨迹，区别于七个识。在一切法的运行过程中，八个识和合在一起，彼此不分，才能完成法的运行，确实是鱼目混珠，龙蛇混杂，道眼通明时，才能分清鱼眼和宝珠，分清龙与蛇。</p><p>二、八个识的行相都可以现量观察</p><p>证悟以后能现量观察如来藏的行相，与七个识的行相分得清清楚楚，不会落到七识五阴当中。譬如红豆绿豆混在一起，立即就能分清，泾渭分明，毫不含糊。在五蕴身中，不管观察哪个法的运行，都能立即知道如来藏是如何运行的，六个识是如何运行的，第七识的运行观察比较困难，但到一定时候也应该能观察出来。在现量观察八个识的行相过程中，六七识的行相也许不能分得开，容易混淆不清，但是如来藏的行相应该能很快辨别出来，不至于与六七识混淆不清，不知真妄。</p><p>所以如来藏是能够现量证得的，如来藏的体虽然不可见，其行相与功能作用却能现量观察出来，通过如来藏的相和用，就能证得如来藏不可见的体。如来藏的体与世俗法的体有本质的区别，世俗法的体——六尘境界，五识可见可了别，意识更容易辨别出来，如来藏却不是这样。所以如来藏的行相非常微细，般若智慧不足，根本无法见，无法观察，才会有那么多人说如来藏只是一个名字，体不存在，是空的。这样说误会就太大了，足以障碍自己的菩萨道业，以至于成佛无期。</p><p>三、什么眼能见如来藏的行相</p><p>如来藏无形无相，肉眼不可见，但是心眼、慧眼、法眼、佛眼却能见。其中慧眼、法眼和佛眼统称为心眼，三种眼所见有极大的差别，因为智慧有差别，所见一定有差别。无形无相的如来藏本体如何能被见得到呢？如来藏的体虽然是空不可见，却有相当多的运行行相和功能作用。如来藏的运行行相也叫作心行和心所法，功能作用是成就万法万万法，显示出一切法的相貌，赋予一切法相应的功能作用。慧眼比法眼和佛眼的智慧浅漏有遮障，所见如来藏的行相浅少而粗略，法眼所见如来藏的行相广泛而深细，佛眼圆满无碍，所见则是如来藏的全体行相，微细到无一法不知无一法不晓，乾坤朗照，洞察纤毫。</p><p>如来藏运行的行相是现量观察出来的，没有证悟的人不能见，没有悟的人只能推测如来藏所起的作用，不能观察如来藏的行相。从这点上完全可以判断出一个人有悟没悟，真悟和假悟。如来藏的功能作用从佛经上、从祖师大德的开示中，都可以想象得出来，通过推理也可以推论出大略的作用，但推论得稍微细致一点也很难，细致的东西如果不是听说，一定要自己现量观察才能得到。所以每个人修行人要想获得真正的大智慧，有慧眼和法眼，必须努力修行戒定慧，下苦功夫，真修实证，才能有真解脱的功德受用。</p><p>四、有思心所不代表有作主性</p><p>如来藏虽然能了别业种，知道业种是否成熟，知道什么时候应该让业种现行，实现果报，但是如来藏的这种功能作用是任运自然的，是本来如此的法则，不是祂非要作主实现果报，因缘现前时，祂必随顺因缘，不违逆因缘，可是不管怎样祂的心都不变，如如不动，永远是无事人，心中不落半滴尘埃。</p><p>如来藏虽然有思心所，能作决定，但是能作决定不代表能作主。因为前五识也有思心所，也能作决定，但不能作主，只能听指挥。所谓的决定，是对所触所知的法心得决定，把法运行出来，对所了别的法进行处理。这是各识的本职工作范围，不代表作主性，如果代表作主性的话，众生就会有八个作主识，那岂不早就疯掉了？</p><p>五、如来藏的见分与五遍行心所法的关系</p><p>八个识对于法的见，都是通过五遍行心所法作意、触、受、想、思来实现的。如来藏本身也有识种子，识种子连续不断的运行就形成了如来藏，如来藏对种种法运行作意触受想思五遍行心所法，对法就进行了了别和处理，其功能与七识的受想思有一定的差别。五遍行心所法在运行不带任何烦恼和无明，属于无心运行状态，也叫作任运而行，随法而行。其中受不进入境界当中，想也没有复杂的思想活动，思是抉择和造作，和对于法的维护和管理。</p><p>七识也各自有自己的识种子，其见也是依靠五遍行心所法来运行的，在五遍行心所法运行过程中可能参杂着一些烦恼和无明，善恶心所法也会一起出现。五遍行心所法运行之后就有了见闻觉知的功能作用，但是由于七识有烦恼心所法现起，对七识的见闻觉知就有一定的遮障作用，致使七识见法不真不准，错会不少。因此错会就会造作恶业，形成因缘果报。</p><p>六、如来藏的见的功能作用</p><p>如来藏的见分，就是如来藏的见，如来藏通过五遍行心所法的运作来见一切法，作意触受想思，然后把法摄取和变现出来，这时候末那识意根才能见得到法，在这之前只能由如来藏单独见。而意根并不能见到如来藏的见分功能，成佛以后或者是几地菩萨才能见到如来藏的见分功能心所法的运行，普通凡夫和地前菩萨的意根没有这样的大智慧和禅定力，甚至几地菩萨也不一定能见得清楚和圆满。</p><p>七、八个识的想心所法</p><p>在八个识的五遍行心所法里都有想，这个想是指识心的了别作用、思惟作用、取着作用，也代表欲望和愿望，代表希望，几乎占据众生思想活动的一半，是识心抉择作决定的依据和动力。</p><p>其中五识的想比较简单直接，就是起了别和分别五尘的作用，其取着性不强，也不明显，都是在意根的推动和调控下进行，如果没有意根的推动，就没有五识的想。意识的想内涵丰富，也比较明显，思惟比较复杂，有一部分自主性，也有很大一部分的被动性，其自主那部分不能太违背意根的思想意志和观念，否则意根就会制止，不允许继续想，也容易造成意根情绪不稳定，出现心理问题。六识的想归为五蕴当中的想蕴，有蕴集诸法种的作用，生灭变异，没有自主性。</p><p>意根的想不仅有了别分别性，主要有执取的作用，因为意根对诸法的执取，才有诸法不断的出生和灭去，生灭变异不止。意根的执取性归为十二因缘中的取，由于意根的取，才有后世的有和生死，所以意根的想对于诸法的生起和灭尽都起着非常关键的作用。广义来说，意根也有蕴集诸法的作用，而且起着主要作用，所以也应该归为五蕴当中的想蕴里。</p><p>如来藏的想比较单纯，只起了别分别作用，而且非常快速，从来不会冥思苦想，见什么法就知什么法，不用思惟思量和琢磨推理等等思想活动，与七识迥然有异，因为如来藏无无明，其慧特别强，几乎就是自动化的程序了别，中间没有停滞和停顿，对一切法都不入心。由于如来藏的想，就有如来藏对诸法及种子的抉择，于是诸法就会继续不间断的运行下去，此生彼灭，彼生此灭，运行有序，丝毫不错乱。众生总觉得世间非常乱，那是业决定了必然如此，七识和五蕴世间再乱，如来藏的运行也不乱。所以如来藏的想对五蕴世间有决定性的蕴集作用，广义上来说也属于想蕴范畴。</p><p>八、八个识的行——思心所法</p><p>行的范围非常广，包括了八个识的行。行，广义来说，就是指运动、运行、动转、行为、变化、迁流等等，总之所有流转不止息的现象都是行的范围。这样看来，世出世间根本就没有不行不动的事和理存在。包括如来藏都是一直在行在动，不寂止，但在动转的行中，心却是寂静不动的。</p><p>为什么这样说呢？其一，因为如来藏有五遍行心所法，这五个心所法从来没有一刹那停止过，一直都是运行着的，即使是在无余涅槃里，如来藏的五遍行心所法也是在运行不断的。其二，如来藏本身也有自心的识种子在不断刹那刹那的出生和灭回，这样才能使得如来藏一直不断的存在下去，不断运行下去，无有停滞过一刹那，所以才成为一个不生不灭的心识。</p><p>如来藏的五遍行心所法作意、触、受、想、思，只要存在就在运行着，这就是行，而且思心所法本身也代表着抉择的意思，也代表运行、运为的意思。正是如来藏的行，促使了诸法不断的运行下去，不断的生生灭灭，所以从广义上来说，如来藏也可以包括在行蕴里，只是这个行蕴不生灭罢了。如来藏有蕴集诸法的功能作用，所以广义来说，如来藏也可以叫作识蕴，而且是最根本的识蕴，不生不灭的识蕴。正因为有如来藏的识蕴的功能体性，才能把诸法蕴集起来，让诸法生灭变异，让众生轮回不休，苦恼不止。</p><p>如来藏究竟是如何运为的呢？其一，输出种子，收回种子，造就五蕴世间一切法，让一切法不断的生灭变异，不寂止，并且存贮业种，释放业种；其二，对于业种，对于五蕴世间一切法，不断的触作意受想思，让诸法随缘运行不止。如来藏即使这样不断的行，不寂止，丝毫也影响不了如来藏自心的寂灭无为心性，不影响其对诸法不见不闻无欲无求的心性，不影响其对诸法不动摇不动转的心性。</p><p>第七识的行，包括十二因缘里无明的行，也包括诸圣人们无无明的行。无明的行，是生死轮回的行，无无明的行，是解脱生死的行。第七识的行对于生死和解脱都起着决定性的关键作用，正是第七识的行，促使如来藏蕴集起五蕴的生死轮回业种，从而蕴集出五蕴世间。所以再从广义上来说，第七识也属于行蕴和识蕴范畴。</p><p>六识的行，就容易观察和了解了，六识是依他起性，是被动现起的行，无论广义和侠义，六识都属于识蕴所摄。因为六识所造作的身口意行，正是业种集起之因，是五蕴世间现起之因，是蕴集名色之因，虽然是被动蕴集，也占蕴集作用的很大一部分。</p><p>九、八个识的行由谁操控</p><p>八个识都有行和行的相，都能不断运行诸法，自身念念牵流，心心不住。识种子生灭又相续不断，诸法才能显现出来，才能不断运行下去，五蕴世间才能多彩多姿。万事万物的生灭变化都是八个识运行的结果，五阴身的生灭变异更是八个识行的结果。一旦前七个识不运行了，生命即终止，入无余涅槃。但第八识如来藏本身永远不灭，自身有识种子还会不断的维持如来藏的运行，五遍行心所法还会继续不断的运行下去。</p><p>七个识的行，由谁操控和管理的？六识的行是由第七识意根决定主宰的，意根的行是由无明和愿力主宰的。意根的行，取决于好几个因素，一个是如来藏中的业种子，一个是意根本身烦恼的惯性势力，一个是环境熏染作用，但这些因素都是由于意根的无明产生的，意根没有无明就不会受熏染，也不会有烦恼及惯性，也不会留下烦恼业的种子。如来藏的行，没有操控者，法尔如是，是法界的规则，</p><p>十、是哪个识不思善不思恶</p><p>八个识虽然都有五遍行心所法，作意触受想思，但是每个识不是在所有法上都要作意触受想思，是有选择性的。所以每个识的相分有很大区别，每个识只作意触受想思自己所对应的相分，不对应的相分就不会去作意触受想思。况且六识是不断生灭的，灭了以后对任何法都没有五遍行心所法了。</p><p>而善恶相都是世俗法相，是七识所相应和了别的法相，与如来藏不相应，所以如来藏不了别善恶相，也就不思善不思恶。如来藏从来对善恶的法相都不思量，第六识和第七识却总是思量着善恶法相，如果修行到一定程度，心清净了无烦恼了，六七识也会不思量善恶法相，而是见善恶法相的真如体性。</p><p>十一、五别境心所法</p><p>禅定、智慧、理解力是识心的心所法，也是识心的用，属于五别境心所法，对于七识来说是别别现行，不是时时现行，时时现行的是五遍行心所法。但是诸佛以及大菩萨的七识却时时处处都有禅定、智慧和胜解力，五别境心所法不是别别现行，而是时时现行。如来藏的禅定、智慧和胜解却是时时处处都现行着，即使在无余涅槃里也是这样。</p><p>如来藏的定力如何，通过观察就能知道是相当的强大，祂在一切法的运作当中，无论遇到什么境界，都是如如不动，任尔东西南北风，祂自安然不动；泰山压顶腰不弯，不管什么是非曲直，自是不理不顾，按照既定的法则任运而行。佛说祂是首楞严大定，从不出定也不用入定，在一切法上不动不摇，无可匹敌，是真宝山。在无余涅槃里，如果如来藏没有禅定，那么如来藏就会心散乱。然而如来藏既然是首楞严大定，不出不入，那就永远不出定，祂怎么能散乱没有禅定呢？</p><p>如来藏的慧力如何？祂在无余涅槃里也要时时了别业种，如果如来藏没有智慧，不能胜解，就不知道业种为何，是否成熟，那么阿罗汉就永远也不能出涅槃，而有意根和五蕴身。如来藏的智慧不增不减，永远都有般若大智慧，能了别一切法，造就一切法，执持一切法。在无余涅槃里仍然有如来藏所面对的法，所以如来藏的心所法仍然存在。</p><p>如果如来藏在出生耳根、出生五蕴身、出生一切法的时候，突然间定力不足，慧力也不足，也不知道业种是什么样的，结果会是什么？结果如来藏一不小心，可能就把四大种子的数量输送的少了，比例结构搞错了，种子输送错了，那么出生的法就会张冠李戴，一切法就面目全非了，世界就乱套了。如果如来藏没有极强的胜解力，意根的心思都不懂，结果会怎么样？一切法都不会合理的出现，不会如愿的出现，众生发愿都没有用了，所有想法也没有用了，五蕴世间也不会正常了。</p></div>"
},{
    "title": "第十章 如何实证如来藏",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  如何实证如来藏</strong></p><p>一、只有禅定具足才有可能证悟</p><p>所谓的观行，没有证得之前叫作思惟、参究，是深细地思惟、探究、推究、寻觅、伺，不是浅的思惟活动，要落在意根那里；证得以后叫作观察，现前地观察如来藏在五阴身中的种种运作，观察万法的奥秘，其中仍然要有更深细的思惟和参究活动，都要落在意根那里。证得之前与证得之后的观行，都必须在未到地定和初禅定中，没有禅定就是纯意识的学习、理解、推理活动，思惟很浅，即使有禅定，如果禅定比较浅，思惟力也不足，只落在意识里，也不能证悟。四圣谛的观行，证悟如来藏的观行，如幻观的观行，阳炎观的观行，如梦观的观行，镜像观的观行，这些观行智慧层层递进，观行智慧越来越深细。</p><p>所谓的悟，必须是意识意根亲自证得如来藏，不是明白了如来藏的理就是悟。那些理，通过各种途径都能知道，而悟如来藏，必须通过参禅亲自证得。悟，不是学来的知识和道理，而是意根亲自证得的。</p><p>二、理解不能代替实证</p><p>五阴十八界一切法都是如来藏性，这个理需要实证如来藏之后再观行，才能逐渐通达。凭意识想象有一个如来藏，起着某种作用某些作用，那就没办法现前观察如来藏的运作，没办法观察五阴十八界的如来藏性。理解终归是理解，想象终归是想象，不是实证。</p><p>如来藏如何记录存种子，如何实现因果，这些属于唯识种智范畴，地上菩萨才能现量观察。如来藏的种子功能作用，现起世间万法的功能作用，以及如来藏的所有种子功能作用，都是唯识种智范畴，地上菩萨才能现量观察，地前菩萨由于烦恼重和禅定不足，智慧就不足，六七识没有转识成智，无力观察这些非常深密的法义，理解的东西不能代替现量观察。</p><p>三、如何才是实证如来藏</p><p>实证如来藏就像找人一样，二者没有多大差别。假如我们想找一个人，经过寻思，最后确定了这个人就在某个地区某个具体位置，心里非常笃定，但是却没有亲眼见到这个人。这算不算找到人了呢？</p><p>只要没见到这个人，没有与他真实面对，都不算见到这个人。尽管很笃定的认为他就在那个地方，可就是没见面，那就不属于见到。因为不知其人是何相貌，此刻真正做什么，是如何做的，心境如何，修为品行如何，对此人都没有什么认识和了解，也不知道那个地方的人是不是自己想要找的，也不知道那里是否真的有这个人，不是眼见，就不能为实，心里猜测想象的不能算作实见。</p><p>不管你内心多么笃定，那个人就在那个地区，就在那个房间里，而事实上那个人也确实在房间里，但是只要没有亲眼见到，就不属于见到那个人。而一旦找到那个人，就会亲眼见到他正在做什么，是如何做的。这叫作亲眼所见。</p><p>无论怎样相信那个人就在房间里，就是不知道那个人当下具体在做什么，是如何做的，仍然不会出生任何智慧。猜想那个人在房间具体在做什么，是如何做的，这种猜想，即使猜对了，也不属于智慧性的认知。</p><p>又比如领导告诉你把某甲找到，看看他在干什么，然后你大略知道某甲离自己很远，过去找他很辛苦，出门转了一圈，就不想过去，但还必须完成领导交代的事情，于是就到处打听，终于打听出来，某甲在某某处的十一楼里，又大约猜想可能在睡觉。于是就回来告诉领导，某甲就在十一楼里，至于干什么，大概就是平日里的那些事，不会有什么事。这算不算找到某甲了呢？</p><p>这属于猜测，猜想某甲在干什么，即使猜对了，打听对了，事实上某甲确实在干什么，那也不是亲眼所见。只有亲自见到某甲，才能当面观察他，才能不断的出生识别辨别他的智慧，才能向他学习。想象猜想的，永远不会出生这样的智慧。很多人悟了N多年，仍然在原地踏步，智慧没有增进一点，究竟为什么？因为没有亲证，是理解出来的。试想，你肚子饿了的时候，不把饭端到面前吃，而是想象着面前有一碗饭，再接下来能有什么作为，能端碗吃饭吗？当然不能，所以只能饿着。</p><p>有不少人猜想八地菩萨的修证境界，也真有猜想正确的，但是即使猜想再正确如实，也不是亲自证得，仍然要继续当凡夫。哥德巴赫猜想，在佛法上运用的太普遍太深入了。为什么如此？因为佛法实证太难太难了，只好出此下策。</p><p>那真正证得如来藏以后，还会不会退转呢？比如说我告诉你某甲就在房间里，你当时非常相信，非常确定，非常笃定。但却不是亲眼所见，过后你会怎么样？肯定会不相信不确定，心里起疑。而自己经过千辛万苦亲自证明了的，亲眼所见的，就不会起疑和退转。眼见为实，耳听为虚。别人告诉你的，无论怎样相信，对于自己就不是事实。如果没有亲自见过苹果，没有亲口尝过苹果，别人再如何描述，我再如何想象理解，都没有用，我还是不知道苹果的真实情况，也吸收不到苹果的营养。</p><p>所以我开个万人大会，讲述如来藏的运作，可以非常详细，非常细致，非常具体，百分之八十的大众都能相信和理解明白，然后我就给这百分之八十的人发证书，印证为明心的菩萨。这些所谓明心的菩萨，没有亲眼所见如来藏的运作，都是听我说，然后猜想，对号入座，过后会怎么样？死后会怎么样？</p><p>所谓的明心见性以后有退转之说，那就是没有真正的明心见性，没有经过参究的过程，只是听说和猜想分析出来的，当然就有可能不再相信这样的猜想分析，就会退转了。不经过一番辛苦修行过程，白白到手的东西，犹如雾里看花，看不清楚，就会否决掉。猜想一个如来藏出来，不能真正转依如来藏，不会有后续的功德受用生出来。</p><p>我刚才口渴，削了一个苹果吃。如果你们哪个人找到了我，当面看着我如何削苹果吃苹果，就会跟着学，也会知道如何削苹果，也会知道如何吃苹果了。然后见到我削苹果之后，把果皮留给老鼠吃，就知道我的慈悲心了，也跟着学，同样具有慈悲心性。再观察我在吃苹果的过程中，心不起贪，然后就会也学习如何让心不起贪嗔痴烦恼，这样心就清净了。这是当面见我的利益，可以向我学习。然后时时刻刻跟随着我，观察我如何为人处世，修养品德如何，各种事情具体都是如何处理的，这样就会学到很多东西，心行品行修养等等，都会有所改变。这就是找到我跟随我的利益，或者叫功德受用。</p><p>亲自证得如来藏，而不是听说，不是口耳相传的，就能现前观察如来藏在各种法上的运作，就会学得很多法，心性就会越来越接近于如来藏。而靠猜想的，永远没有这样的功德受用，因为不能现前观察。</p><p>四、如何证得观音耳根圆通法门中说的空寂心</p><p>楞严经中观世音菩萨所修的观音耳根圆通法门，观世音菩萨在禅定当中思惟空性，不断的破除虚妄法，这种修行方式，需要极深的禅定，和极强的般若智慧，缺一样都不能成就观音耳根圆通法门。这种修行方法是在极深的禅定当中一直不断的排除一切生灭不实的虚妄法，直到剩下一个实在排除不了的、实在空不了的一个所谓的东西，那就是真心如来藏。</p><p>这个修行方法非常好，但是大部分人可能是所有人都修不到这种程度，一个是因为修不出这么深的禅定，一个是因为不能有那么深的般若空性智慧，不能通过定中来证得这个空性心，再有就是发心不够广大，善根福德不足以支撑这样的修行。在证不得的时候，对于般若空性的误会就会非常大。以我们这个娑婆世界众生的善根都无法修成功，甚至就连最初的空都很难证得，般若智慧可以有相似的理解，但是禅定是个硬指标是最实际的修行功夫，靠理解是没办法做得到的。</p><p>所以在禅定中把一切虚妄法都排除掉，一般人是做不到的，不仅要空人我，还要空法我，都排除了空了以后，最后剩下一个空不掉的空寂的真心，现在不可能有人修到这种程度。最后只剩下一个空寂心，就证得了空性。那么是谁去证得这个空寂心呢？谁去认识那个空寂的真心？还是要有一个谁，没有这个谁还不行。这个谁也是空的，也是被排除掉的，但是还要利用这个应该破除的空的谁，去发现我们本有的空寂心体如来藏。这样的修行，是把虚妄法都破除，而不是灭掉，不认它为真就是了，然后用虚妄非真的意识意根去证得那个破不了的真心，没有虚妄的意识意根就不能明心证悟。</p><p>这个空寂的心是指什么？是指祂的体是空寂的，无形无相，眼睛看不着，耳朵听不到手，摸不到身体，身体触不到，鼻根嗅不到，意识感觉不到也想不到。那该怎么办呢？通过修学般若经典，了解真心的体性，以及真心运作的特点，而真心的运作就是在五阴身当中的运行。了解了之后，就需要做禅定和参究的功夫，在五阴身的运作当中锲而不舍的一心参究，才能证得空寂心。</p><p>五、是谁需要证悟如何悟</p><p>很多人都不懂得如何证悟，以及是谁需要证悟，那么我们学佛为什么需要悟呢？因为我们无始劫以来一直迷惑颠倒，认妄为真，妄受生死轮回苦，不得解脱和自在，所以就需要破除无明，破除心里的虚妄法，悟得真理。但要看清楚和弄明白这个我们是指谁，是指意识和意根这两个心。因为这两个心有极多的无明，不知法界实相真理，所以需要修行去悟。悟得真理以后，才能证得五蕴世间一切法的虚妄，断尽一切无明，灭除一切生死苦，得大解脱。只有证得法界实相如来藏之后，才能通过三大阿僧祇劫的修行断尽无明，达到涅槃寂静，解脱一切生死苦。所以需要开悟的是六七识心。</p><p>如何证悟如来藏呢？如来藏的本体根本见不到，因为祂是空的，没有任何相貌，当然就见不到祂的本体了，只能通过祂的功能作用去证得，在五阴身的运作上现量观察到如来藏的运作行相，就是证悟如来藏。这时候就会明了了如来藏在五阴身上是如何运作的。如来藏本体虽然是空寂的，但是祂的作用可不是空寂的，功能作用是有行相的，是可以观照得到的，观照到的时候就是证悟了。</p><p>我曾经拿风作比喻，空寂的心就像风一样不可见，可还是能够知道风的存在。风也是空的，为什么是空的，我们看不见风、听不到风、摸不着风，也感觉不到风，也嗅不着风，但是怎么知道有风来了？那风来了的时候肯定有种种作用，这些作用都是作用在物体上和空中，风作用在物体上，作用在虚空当中，就会出现各种征兆和现象，看到这些现象我们就证得了风，不管是微风也好，大风也好，小风也好，狂风暴风也好，龙卷风也好，从物体出现的现象上就能判定出来是哪种风。</p><p>如来藏本体与风一样都是无形无相的，但是通过如来藏在五阴身上的作用才能发现祂。那么我们找到风是谁来找到的？是六七识心。知道有风出现了，六七识一起想办法躲避防范风灾。证得如来藏也是六七识共同证得的，通过如来藏所起的作用，在五阴身上运行的行相来证得。如来藏有什么作用呢？一切万法都是祂生成和维护的，一切万法都有祂的特殊作用。如来藏究竟是如何运作的，需要悟后继续参究，参究出来就明了六祖所说的五个何期自性了。</p><p>六、如何见真去妄破无明</p><p>众生苦恼的根源在于见了不如实的相还以为是实的相，于是就执取不舍，生起苦恼，当觉得相执取不到手的时候，就更会心生苦恼。所以解决苦恼问题的根本是要见真相实相，破妄相假相，见相时如果是具足正知见的见，没有错见和邪见，也就不会再执取妄相和虚相了了，这样就不会产生苦恼，当然于相就离相解脱了。</p><p>如何见真相不错谬的见相呢？那就要认识相的实质和根本，知见不落在世俗法相里，破除法相的世俗相貌，就会由表及里的见到法相的根本和实质。这样就没有错谬之见了，见得正真，就会知道法相根本不可取，于相离相，执取心熄灭，解脱自在无烦无恼。</p><p>如何破除法相的世俗相貌呢？首先我们要知道世俗法相都有什么，有世俗定义的种种色、种种声、种种香、种种味、种种触，种种法相里面含有的种种形、种种质、种种韵味、种种世俗功用。众生都是见种种功用和韵味为实有，才会贪执不舍，无论贪得到与贪不到，都是苦恼，乐也是苦恼，忧愁愤恨也是苦恼，所有觉受无一不是苦恼，翻搅其心，不得寂静清凉，这就是苦。</p><p>这些世俗法相真的存在吗？在梦里觉得什么都是真实的，醒来才知道都是虚假不实的。众生觉悟以后，才知道所见一切相都不是真实的，生灭变异无常幻化，就是虚妄的。既然世俗法相是无常的，也就是空的，不可得的，得也得不到的；既然世俗法相是空的不可得的，就是苦的，空而不可得就有苦，就是苦相；既然世俗法相是无常、苦、空的，就不是我，也不能归我所有。把生灭变异无常法相当作我，知见是错谬无理的，是愚痴的，灭除这种不如理的知见，得正见，不取不执，就得解脱，自在清凉。</p><p>如何才能见真相，知见不落在世俗法相里？我们应该明了，一切世俗法相是由本心如来藏所生所变所创造，之后如来藏就缘这些法相，并且了别这些法相。但是如来藏却不见这些法相的世俗相，见的都是法相的种子组合相，只知道这些法相中各种种子的排布状态，并且一直也了别业种，根据业种不断的调整各种种子的比例结构，调整种子的分布状态，这样就使得法相不断的随业种、业缘或者是意根的思心所而改变。</p><p>如来藏见种子不见世俗相，就辨别不出色声香味触法，内心就不作世俗法的分别，心就清净无烦恼，不造生死业，没有生死轮回苦。我们要想摆脱分段生死苦和变易生死苦，也要像如来藏一样，泯灭心中的世俗法相，见法的真谛和实质，这样心就会越来越清净，越来越近于佛心，最后就与佛陀齐，处无住处涅槃，处常寂光土，寂灭无为。</p><p>既然一切世俗法相都不真实存在，为什么众生还能见得到呢？这就是众生的无明使然，在真相上起虚妄见、虚妄想，之后再起虚妄行，造虚妄业，得虚妄果，受虚妄轮回。比如说明明是一支火把在快速的摇动，众生由于无明，不见火把，却见并不存在的火圈，把火圈认为实有，执取不舍，遂有生死轮回苦。众生见世俗法相也是这样，因为无明，本来并不存在的相却认为实有，本来实有的真法却不见，由于错见倒见，遂有生死业，轮回苦不断。</p><p>比如说夏季天气炎热，水蒸气反射到沙滩上，渴鹿由于口渴心错乱，见一无所有的沙滩上都是河水，于是就去执取，近前却见一无所有。无明妄见使众生什么也没有得到，却因为执取了虚妄相而感招生死惑业苦，多不值！所以破除无明见实相，是我们修行的重中重，和最终目标。只要见了实相，无明破除，虚妄相就会逐渐灭去，逐渐不再执取虚妄相，不再造生死业，惑尽业消，回归自性萨婆若海、一真法界，寂静涅槃。</p><p>七、口头禅不等于修行和实证</p><p>悟前的修行有许多次第，悟后的修行同样有许多次第。悟前如果按照悟后的方法修，就无法修成功。刚刚开悟按照地上菩萨的方法修行，同样也不见效。把高远的理论捧在手里，以为自己已经实证，能像圣人和如来藏一样了，这纯属是自欺欺人。很多人看到烦恼即是菩提这句话，就以为把烦恼看作是如来藏的幻化就是修行了，而不去想办法降伏烦恼，结果烦恼还是烦恼，菩提还是菩提，死后仍然沉沦生死，有何益处？</p><p>有些人明白了如来藏无修无证，就以为七识五阴也应该无修无证，那么如来藏也是本来佛，自己完全可以在家里做佛好了。如来藏不分别，自己也要不分别，一切法由分别而起，再也不要去分别，心就空没有法了，那么饿七天也不要有什么意见。</p><p>一切法确实都如幻化的一般，但这是十住位以上菩萨的修行证量，如果自己没有达到这种修行程度，还没有这个实际证量，那就不要天天把幻化之词句挂在口边，成为口头禅。如来藏不持戒，有些人就认为自己也应该像如来藏一样不用持戒了，任运逍遥，放浪形骸。不知道自己的心具足一切贪嗔痴，怎么能够放浪形骸任运逍遥？空谈往往误国，说得了一丈，行不了一寸的人，最好踏踏实实实际修行，不能再高谈阔论、眼高手低了。</p><p>八、修行的事不能互替</p><p>要想获得真正的解脱智慧，不要去打听在一切法上如来藏与意根的具体分工内容，如果把真妄心的分工捋清，工作内容分别清楚，就等于直接指出哪个是如来藏，哪个是意根了，这样做的结果是什么？是不是想就这样直接悟了，非常便捷省心省力，不用辛苦学什么、修什么、参什么了？</p><p>各人修行各人得，不要指望轻而易举的得到他人的具体细致的帮助，该谁做的事，就要谁去做，互相代替不了。如果佛能代替众生悟道和成佛，只需要把从众生到佛地的一切关卡密意告诉众生，给众生讲讲佛地的风光，众生充分理解了、知道了，也就成佛了，这有多好？佛也省心，众生也省力，大家都欢欢喜喜的，但这样能行得通吗？</p><p>该七识做的事，如来藏代替不了，该如来藏做的事，七识代替不了。否则只有如来藏就好，就能解决一切问题，七识愿意干什么就干什么，成天睡大觉也行灭亡也行。事实上都不是这样，谁吃饭谁饱腹。</p><p>九、大乘见道的观察智慧</p><p>在定力强、疑念深的参禅过程中，逐渐排除了五蕴十八界，否认了五蕴十八界的真实性，从而确认无我性，断除了我见，证得小乘的法眼净，这时离大乘见道就不太远了。当意识意根通过参禅，证得如来藏时，就能观察到对六尘没有分别性的如来藏的简单运作情况，这样就获得了大乘见道的般若智慧，以此智慧观察到如来藏是不生不灭的无我性的心体，却能出生生灭的有我性的五蕴身，同时也能观察到如来藏是如何生起五蕴的，证得了五蕴是空的无我的。至于断除根本烦恼障和所知障，那是后续修行的事情，是在出生初禅定以后的事情，也是十行位十回向位以后的事情。</p><p>十、如何才能证得如来藏</p><p>如来藏是无形无相的心法，不是色法，所以在色法上找不到如来藏，眼睛永远见不到如来藏，实际上我们既看不到如来藏，也感觉不到如来藏，嗅不到如来藏，听不到如来藏，想不到如来藏，只有通过参禅才能证得如来藏的功能作用。要想证得如来藏就要用独头意识和意根去参究，才能发现如来藏那种无形无相的运行相貌。</p><p>发现如来藏的运作，要越具体越好，智慧越深细，如来藏最具体最明显的运作，就是出生六识的受想行识的功能作用。如来藏在色身上输出四大种子的运作，谁也观察不出来，可能除了佛。在无情物上，众多如来藏输出四大种子的运作，那就更不能观察出来，那要如何证得自己的如来藏，或者证得单个众生的如来藏呢？如来藏有见分，能见一切法，如果不能见一切法，祂就不能变现、执持和改变一切法。我们只要观行祂的见分与第七识有什么差别，与第六识有什么差别，与五识有什么差别就行，从这里下手观行思惟，才有出路，才能找到自己想要的答案。</p><p>既然如来藏能了别根身器界，这些都属于色尘，也包括声香味触法，十八界都了别，那祂了别什么内容，如何了别的，这是证悟唯识种智的根本下手处。一切法都是如来藏变现的，祂在变现之前一定要见和了别，才能变现，不可能盲目变现什么法，只是祂见的方式和内容是什么，如何运行的，这是获得唯识种智的关键和重点。</p><p>十一、五阴不死法身不活</p><p>打得五阴死，许汝法身活，这是何意？不死，就不能活，是什么意思？每个人的法身都时时刻刻在运行着，维持着五阴身的活动，执持着十八界。但是众生不识法身，有也等于无，这样法身就像是死的一样。众生为什么不识法身？就是因为心被五阴身的乌云遮住了，只见眼前的五阴身，不见五阴身后的法身。要想见法身，让法身活起来，就要用般若智慧拨开五阴乌云，那么背后的法身就会活活泼泼的显露出来了。这也是修行的次第。</p><p>十二、参究话头：猪究竟是怎么死的</p><p>既然六识所缘一切法皆为内相分幻境，有人杀猪是否也根本没有接触到外境的猪，那猪又是如何死的呢？这是秘密，而且是大秘密，需要自己参出来，一旦参出来智慧就很了不得。六识接触的是内相分的猪，可是外相分的猪却死了，是怎么死的呢？参出来就开悟，而且悟的很深很透。没有定力是无法参究的，如果不是真正的证悟，这个问题也解答不出来。判断真悟与假悟，有很多公案话头可以拷问，如果答不出来，就要掂量掂量自己的悟，究竟是怎么悟的，悟了什么。</p><p>眼睛看见自己的手，也没有接触到真正的手。以手摸自己的头，也没有接触到自己真正的头；听见自己说话，也没有接触到自己真正的声音；嗅到自己的体味，也没有接触到自己真正的体味，何况接触到其他众生的，何况接触到其他色声香味触，都不可能真正接触到。吃一个苹果，本来吃的是自己的内相分，可是外相分的苹果却没有了，别人没有吃到，就会不高兴了。心里所意念出来的独影境，完全是自己如来藏变现出来的内相分，与他人无关。比如意念某人身体健康，结果外相分的某人身体真的就健康了，这是怎么回事？意念杀猪，定力好的，猪也能被杀死，这是怎么回事？</p><p>有人说只要踹一脚，因缘成熟的人当下就能悟了。可是，这一脚，至少有四个识共同和合运作，怎么分清楚四个识各自的功能作用？这样悟，无异于鹦鹉学舌，悟个意识心，也能会这样的公案，有何稀奇的？</p><p>当年雪峰禅师参访了很多开悟的善知识，在德山禅师座下参了几十年，最后才开悟。香岩禅师在师父座下服侍了十八年也没有开悟，最后一个人在一座破庙里隐居参禅，扔一块石头打到竹子上，最终才开悟，菏泽神会和尚终其一生也仅仅是解悟。古代的人善根深厚，禅定功夫都非常好，参禅还是那样的辛苦，衣带渐解人憔悴，蒲团坐破几十个。如今的人善根远远不如古代人，禅定更差，品行就不用说了，为什么还要希望自己轻而易举就开悟？这么容易悟，能悟出什么？如果猜测佛法，允许猜测，也可以猜测出来，但结果毕竟是猜测出来的，不是证悟的。</p><p>十三、只贵子眼正不说子行履</p><p>沩山问仰山：“涅槃经四十卷，多少是佛说，多少是魔说？”仰曰：“总是魔说。”沩曰：“以后无人奈子何。”仰曰：“慧寂即一期之事，行履在什么处？”沩曰：“只贵子眼正，不说子行履。”</p><p>仰山禅师回答师父的问话很奇怪，仰山说四十卷涅槃经都是魔说的，不是佛说的，为什么不是佛说的，真佛无口不说法，用口说法的不是真佛，幻化非真佛，假佛而已。师父沩山禅师听了大加赞许说：以后真没有人能对付得了你，你的智慧超群。仰山说：我现在知见是具足了，可是我真正的菩萨行履该如何体现呢？沩山说：只要你见地纯正了，菩萨应该有的行履就不愁建立不起来。</p><p>仰山已经明心见性，般若智慧是具足了，可是他想要快速的具足菩萨的行持，完善自身身口意行，符合菩萨所有的规范，立志快速作一个真正的名副其实的菩萨。沩山却认为，只要真正明心见性了，其行持就会渐渐的转变，从前那些身口意行就会逐渐的清净，烦恼断除是很自然的事，慈悲喜舍的菩萨心行就会逐渐具足。沩山的观点非常正确，但是眼正，还要看什么眼正，只意识眼正，意根眼还邪着，菩萨的行履没法正过来，只有意根眼正，身口意自然就行在正道上，不愁断不了无明烦恼，不愁具足菩萨慈悲喜舍心行。而事实证明，仰山禅师后来过了禅宗三关，入了初地，梦中到弥勒内院在弥勒菩萨面前说法。</p><p>过去人修行是真修实证，明心见性都是真明心，毫不含糊，一点不参假，明心之后不仅智慧汩汩，行持也越来越清净，都符合菩萨的规范，是众生的依止处。如今却不一样了，假菩萨满天飞，比世间凡人还凡人，与真菩萨天上地下没法比，所以假明心的假菩萨就不要谈什么行履了。</p><p>十四、磨砖不成镜打坐不成佛</p><p>昔日马祖道一祖师还不懂佛法修证的时候，以为成佛只靠打坐才能成办，不知道成佛是定慧结合的结果，定慧圆融，才能打造和改变身心世界。当怀让禅师为佛教寻找英才，遇见马祖道一的时候，看见马祖成天打坐入定，观察其相貌不凡，气宇轩昂，具祖师之英气，于是想度其成为佛门龙象。怀让禅师就在马祖道一对面，拿块砖用力的磨，吸引了马祖的注意力，怀让禅师解释说我在磨砖成镜。马祖摇头说磨砖不能成镜，怀让禅师说打坐也不能成佛。</p><p>于是马祖道一就谦虚的问如何才能成佛，怀让于是就给马祖道一讲解成佛的理论和径路。成佛首先要明成佛的根本佛性，只有明心见性之后才能成佛。如何明心见性呢，必须要参禅，当然参禅当中不仅有定，还要有慧，定慧等持，不偏不倚，才能开大智慧，明心见性，进而成佛。修行路上圆融具足一切法，没有偏差，才能成佛。缺少智慧，只一味修定，智慧不能开启。可是没有禅定，一味推理情思意解，同样不能开启大智慧，二者结合，才能具足一切智慧，圆满成佛。马祖道一明了成佛之理后，日夜用功，终于明心见性，成为一代祖师。</p><p>十五、真妄分不开时不能开悟</p><p>参话头：念佛的是谁？这里是找谁？是找如来藏，还是找意根，还是找第六识？能念佛的这个识心，肯定有念心所，否则就无法念佛。如果参话头是参意识心，那就没有必要了，如果是参意根，意根一定有念心所，但参意根不能明心证悟。如果是参如来藏，如来藏一定有念心所。</p><p>在任何一个法的运作上都有如来藏参与，有些人就根据这个特点或者说是理论，推测出在五阴十八界运作的某些法中有如来藏，就推测出如来藏是这样运作的，大致是起这样作用的，于是就认为自己开悟了。</p><p>实际上，五阴十八界任何一个法的运作都是八个识和合运作出来的，并不是如来藏单独运作的结果。如果说自己证得了如来藏，就应该在五阴十八界的运作过程中，把八个识都找到，都能分开，明确指出哪个是如来藏，具体如何运作的，同时要否定七个识的功能作用为真，证得五阴确实无我，这样才是真正的开悟明心，否则连解悟也不是。</p><p>实际上极大多数人并不能推论猜测出来，是到处打听，被人所暗示的。如果暗示正确了也行，关键是暗示的人也没有分清楚五阴十八界当中八个识都是哪个，都是如何运作的，都是起什么作用的，就把胡萝卜和大葱混在一起，告诉人家，这个就是如来藏的作用，这样就算证悟了。</p><p>这离证悟有多远的距离都无法测量，就断然认为自己悟了，实际上是误了，误人误己的误，很可怜。这样误的人，我遇到一些，基本的戒律不能持，基本的佛法知见也不具足，基本的禅定没有一点，贪嗔痴烦恼重重，有可能仅仅属于初学佛者。</p><p>念佛这一法相，是八个识共同和合运作出来的。如果说有人推测出念佛的就是如来藏，并且以此推测结果就认为是悟得了如来藏，属于明心了，那么如来藏到底能不能念佛？如果如来藏能念佛，那就可以把六识灭掉，让如来藏自己念佛，把意根灭掉让如来藏自己念佛。</p><p>那样的话，在无余涅槃里，如来藏同样也能念佛，那么无余涅槃还是寂静无为的吗？还是涅槃境界吗？显然不是了，所以这样弄出的结果是如来藏念佛，就是错误的，并不是明心证悟，多说是个解悟，甚至连解悟的边也不着。如果如来藏能念佛，到临终时不管六识和意根如何的不堪，如何的贪嗔痴，业障如何的深重，只要如来藏能念佛就行了，就能感应到阿弥陀佛，接引到极乐世界去。</p><p>同样道理，每个自认为开悟证得如来藏的人，都是因为推测出在某个法的运作上是如来藏的功能作用。可实际是，不管任何一个法，都不是如来藏单独作用的，都是八个识和合运作的结果，里面有真有妄，没有把妄法否定掉，怎么能证得真正的如来藏？真妄八个识分不清楚，哪个是妄起什么作用，哪个是真具体起什么作用，怎么能是证真如？把真妄共同作用的法全部当成是如来藏的功能作用，这样也算开悟证得如来藏吗？</p><p>如果这样就算证得如来藏，那么根据如来藏运行的规律，如来藏会在一切法当中运作，都参与在一切法中，只要单独指出具体的某一法，就说这一法就是如来藏，岂不是大多数人都能证得如来藏，从而明心开悟了？全世界真妄不分的人，知道一点如来藏的体性，都能开悟了吗？不用持戒修定，不用有多深的般若智慧，都能开悟了吗？不用修三十七道品，不用修菩萨六度，不用断除五阴的我见，都能快速明心开悟吗？</p><p>佛教当中的水有多深多浑浊，淹没了多少求学者，究竟谁能知道？该如何处理，谁能知道？</p><p>十六、死后剩下不灭的是否是真如</p><p>问：有人说到临命终的时候，五阴（包括色身及妄心：所谓受想行识）幻灭，而中阴身未生的时候，剩下的就是真如，这就是父母未生前的本来面目，其实也可以改为参“死后是个什么？”“死后的面目是什么？”这个说法对不对？</p><p>答：这个说法当然不对。死亡以后中阴身未起的时候，不是真如，而是七八二识和合体，意根绝对不能断灭，除非四果阿罗汉。这个时候不能悟，因为没有意识，意根没有强大到自己可以单独悟，必须意识和意根二者同时参究，还必须没有业障的遮挡，才有一点悟的希望。</p><p>中阴身出生之前，有第七识和如来藏，不可认为这时只有真如，真妄和合在一起时，不可把妄也当真，真妄和合不是真如。这种悟是猜测想象的悟，与不悟没有区别。出生中阴身之前，只有第七识与如来藏，这时候没办法悟，因为意根无法单独识别如来藏，六尘都没办法具体了别，何况那么隐秘的如来藏？即使中阴身出现，意识出现，也很难悟，因为意识非常微弱，辨识度非常低，如何能悟？</p><p>没有断我见的人，死亡以后，中阴身没有生起来的时候，特别恐慌，害怕自我消失灭亡了，这时候还是认五阴十八界为我，第七识怎么能认五阴六识灭了以后的空档为真如呢？根本不可能，还不如前念不生，后念不起的中间这个空档，更容易悟，因为这时候毕竟有意识的知，还在定中。在活着的时候，可以参究死后的面目，但是比较困难，因为死后也是真妄和合，不是只有真。不如参究拖死尸的是谁，这个话头比较容易。</p><p>十七、人死后无法开悟</p><p>问：有人说，死亡以后可以开悟。死亡以后五阴散坏，四大分离，中阴身还没有出生的空档就是真如。我怎么觉得他说的这种情况就像无余涅槃了似的。师父给仔细说说，这个人能不能是开悟的。</p><p>答：如果说五阴散坏，四大分离，中阴身还没有出生时的空档就是真如的话，那这个时候应该除了真如，什么也没有了，没有意根，没有六识，没有色身，只有真如，那就是无余涅槃状态了，解脱三界生死苦了。如果说每个人死亡以后就是无余涅槃状态，那我们辛辛苦苦修学四念处观，修学四圣谛理，断我见求解脱，还有什么必要了？佛陀到这个世间讲解传播阿含经教导众生得解脱，也同样没有一点意义了吗？显然这是非常错谬的。</p><p>死亡以后中阴身未生这个空档，色身六识都灭了，意根肯定不能灭呀，否则过一会怎么还能有中阴身出现呢？怎么还能有后世的五阴世界呢？是意根需要中阴身，如来藏才出生中阴身满足意根所需。既然凡夫和三果圣人以前的意根不能灭，那么这个空档里就有七八二识，怎么能说就是真如呢？退一万步来说，就当这个时候只有真如，就是真如，就是无余涅槃境界，那么开悟是谁开悟呢？没有六七识了，谁来悟呢？莫非真如自己悟自己吗？显然不是。</p><p>既然死亡以后这个空档里还有意根，七八二识共同存在着，谁也离不开谁，能否开悟呢？如果能开悟的话，也是意根单独悟，没有意识的佐助，没有意识引领意根说这个就是真如，意根自己单独有那么大的智慧，去识别出真如来吗？显然不能，否则众生死亡以后悟的概率简直太大了，那就会有很多人盼望早些死亡，以成圣果。经过以上思惟分析，这个人悟没悟，自己判断，我不必明说了。</p><p>十八、真妄不分的悟就是猜测和臆想</p><p>意根统摄六识在色声香味触法上共同运作，可以说就是八个识的和合运作，真妄心都有，缺一就不会有任何一个法的出生和运行。所以有的人说自己在某个法上悟了，但是这个法的运作中真识妄识都有，到底悟的是真心还是妄心，还是真妄和合体呢？这个极其重要的地方弄不清楚，所说的悟与不悟没有区别。</p><p>有的人会说，我知道如来藏在这个法上存在着，我就是悟了。可是这个法上还有七个识也存在着，只有如来藏没有七识，任何法都不可能存在，怎么还能运行下去呢？把七个识的功能作用也强加给如来藏，所悟的无非是八个识的和合体，这叫什么悟？</p><p>十九、什么时候才能参末后句</p><p>末后句，是截断生死众流之句。什么是生死流，生死流如何截断？要会末后句首先要思考这个问题。初禅定以后，证得二果以后，过了如幻观和阳炎观以后，才开始参究末后句，过生死牢关，成为三果人，证得有余依涅槃，才有能力出三界生死流。</p><p>有关末后句的公案和句子，都相当于暗语一样，提示着解决生死问题的关键所在，这需要自己参究，不能让人明说，即使明说，自己也得不到丝毫益处，还障了自悟门。没有初禅定，前面关口没有过，烦恼没有断，不可能参究得出来。没有前边的基础，理解不了末后句，小乘必须是二果人，大乘过了如幻观和阳炎观才可以理解一些，再行参究。</p><p>如果不修禅定，不可能证得什么法，没有初禅定阳炎观就很难证得，后边的各种观行就更不要想了。要懂得对于很多法，自己的解到了什么程度，离证得的距离究竟有多大。有些法如果提前解了，很难再证得。在禅定等等因缘条件不足时，最好都回避一下，不要去解，否则就无法证了。都是解，生死如何了断？解与解悟还有差别，这些都需要自己了解，并且要有智慧判断和作抉择。佛法绝对含糊不得，差之毫厘，谬以千里，就是这样的严重。</p><p>二十、悟后的境界</p><p>问：“还于一切时一切处智照无滞，念念圆通，不见一法能为障碍，未曾一刹那中暂令间断否？”《宗镜录》检验开悟十个标准中的一条。这句话该怎么理解？</p><p>答：应该这样理解，开悟以后的菩萨，在五阴世间的一切造作中，在一切时，在一切处，在一切法上，都能观察到是如来藏的功能作用，没有五阴自己单独的作用，全部是真如自性起用，心不落到五阴世间的假相里。这个智慧程度相当深，达到了初地以上的无生法忍，分证一真法界了，证得了世出世间一切法全部是如来藏起用，全部是如来藏的作用。没有甚深的唯识种智，不可能观察得这样细微、周全、深透，这就是真正的真如三昧，诸佛完全证得了真如三昧，地上菩萨只是分证真如三昧，达不到完全真如三昧，因为还有很多法没有证得，有些法还落到世间相里。</p></div>"
},{
    "title": "第十一章 杂谈",
    "author": "生如法师",
    "date": "2021年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  杂谈</strong></p><p>一、如来藏识体能否舍去</p><p>问：成唯识论中说：“（如来藏）或名异熟识，能引生死善不善业异熟果故，此名唯在异生、二乘、诸菩萨位，非如来地，犹有异熟无记法故。”和“异熟识体，菩萨将得菩提时舍，声闻独觉入无余依涅槃时舍。”这两句话是不是有矛盾？阿罗汉入无余涅槃后还是不是阿罗汉，是不是属于二乘？尤其是第二句，异熟识体能舍吗？</p><p>答：八地以前的菩萨，其如来藏名为阿赖耶识，八地菩萨以后，声闻缘觉涅槃以后，其如来藏名为异熟识。声闻独觉入无余涅槃时，舍阿赖耶识名字，不是舍阿赖耶识体，更不能舍异熟识体；妙觉菩萨即将成佛时舍如来藏的异熟识名，不能舍异熟识体。体是真实存在的，不生不灭，佛也舍不了。如果舍了异熟识体，一切法都将不存在，也不能再出生，永远不会再有五蕴，也没有涅槃，也没有诸佛和世界了。能舍异熟识名字的，只能是灭除了所有异熟性、灭除了所有无明的诸佛，等觉菩萨也舍不了异熟识名字，何况阿罗汉和辟支佛、独觉佛。</p><p>二、修行就是要消除七识的染污性</p><p>阿赖耶识的名称是八地菩萨之前的众生所用的，八地菩萨以后就把名字改为异熟识，阿赖耶识这个名字表示众生的如来藏里还有七识的烦恼业种和烦恼习气的种子，这些种子都是生灭变异的，与不生灭的如来藏和合在一起，就成了不生不灭的阿赖耶识。如果如来藏里含藏的七识生灭业种消灭了，七识断除了烦恼，也断除了烦恼习气，阿赖耶识就改名为异熟识。</p><p>修行就是要改变七识的无明和染污性，去除七识的贪嗔痴烦恼和烦恼习气，逐渐转变为清净性的。这当中的修行，要依止于如来藏，认清如来藏的体性，证得如来藏，再来观察如来藏的清净性，和无漏的有为性，七识就能受到熏染，也就能渐渐地接近如来藏的清净性，不再贪执虚妄的世间法，七识就能得解脱，成就佛道。其中证得如来藏是非常关键的，只有证得如来藏，才能知道法界实相，才能断除我执和法执，究竟成佛。</p><p>三、异熟识、异熟习气、等流习气分别是什么意思？</p><p>异熟识是如来藏在八地菩萨以后的另一个名称，表示心体里的业种，能让众生异时、异地、异世、异类中出生。阿赖耶识里收存着众生分段生死种子，异熟识里收存着众生变易生死种子，也就是微细生死种子。</p><p>异熟习气，也叫作生死流转习气、无明习气和烦恼习气，这些习气非常微细，一般指八地以后菩萨的无明习气，也可以说是初地以上菩萨的烦恼习气。有习气就有生死，习气断尽，才能成佛。</p><p>等流习气，等，表示相等相同，流是流转，表示同一个识相续流转的习气，或者是同一个众生相续不变的习气。</p><p>四、慈悲喜舍与根尘同源</p><p>如来藏慈悲喜舍众生，这只是一个比喻罢了，因为如来藏无心，不慈不悲不喜不舍，不对六尘境界，不知道有众生，不知道众生苦。如来藏没有私，也没有无私，如来藏没有畏，也没有无畏，实际理地就是这样的。如来藏具足万行，实际上祂一法也不行，什么事也不做。</p><p>根尘同源的意思是，根尘都同样来源于如来藏。根尘除了意根以外都是四大种子组成的，都是如来藏变现出来的，根尘都是如来藏的恩赐。如来藏也不论什么尘，是非好坏都不管，只管根据业种输送种子出生变现，其他的都不管不顾。</p><p>五、一切法的平等无差别义</p><p>一切法在两方面是平等无差别的。第一方面，一切法都是生灭变异无常的、不实在的、空的、无我的，存在的当下就是空的，灭了以后更是空的。第二方面，一切法都是如来藏性，其性平等无差别，都是如来藏用七大种子出生的，都体现着如来藏性。譬如真金打造成的金器，都含有真金的性质。金器有差别，本质没有差别，都是真金，都具有真金的价值。真金不生灭不变异，可是金器是要毁坏的，毁坏以后还是不变的真金。</p><p>六、如何理解众生与佛平等</p><p>众生与佛只有在真如佛性上是平等的，只要有佛性，众生最终都会成佛。众生与佛不平等的是真如所演绎变幻出来的五蕴世间假相，假相终归是假相，真正着眼的应该是不生不灭的真相。但是要平等看待真相而不是假相，首先要证得假相确实是空的无我的，然后再证得真相，再观假相如何的假，真相如何的真，心里了然清楚。从此以后才能见到众生就观其真相，看破假相，最后不着一切相，心地就平等了，获得了平等性智。</p><p>证得假相空无我以后就开始降伏烦恼了，到一定时候就能断尽烦恼。证得真相的时候，同样会降伏烦恼断除烦恼，我执和法执逐渐断除，心地越来越清净，越来越平等，最后就会四智圆明，成就佛道。这样众生与佛不仅在真相上平等，在五蕴世间的假相也平等了，这才是完完全全的真正平等。</p><p>七、因缘所生法的因是什么</p><p>诸法出生需要的缘，是一种助缘和助力，是帮助协助的意思，不起主导作用，主导作用是引起法或者是结果出现的前因。比如甲被乙打了，这是恶法，缘是甲乙相遇，借助一个人一件事就有打人现象的生起。其实在这之前有个因，致使了这次事件的发生，如果没有前因，这件事就不一定能发生。即使这件事的发生有很多的助缘，但如果没有前因，这次打人事件就是以后事件的起因，以后有助缘出现的时候，由于这次事件的起因，甲就要报复乙，乙有可能被打或者其它方面的报复行为。</p><p>前因是因缘所生法，是虚幻的，后果是因缘所生法，同样是虚幻的，无论哪个法都是因缘所生法，都是虚幻不实的。因也虚幻，果也虚幻，都是八个识和合运作出来的，推动者是意根和业种，造就者是如来藏，六个识配合，法就幻化出来了。其中七个识也是幻化的，幻法出幻法，幻上幻。如来藏不幻，才能幻出一切法，如果如来藏是幻，那就还有幻如来藏的法，再往前推，也都是幻，如果没有不幻的法，法界就不成立了。</p><p>八、无明与智慧</p><p>无明不是实有之法，它没有实体，就像浮萍，因此就能灭除和消失掉，而实法是真实有的不能变的，因此就不能灭除，比如真如自性如来藏是先天地而先的法，是真实存在的法，不是后天出生的法，因此就不能灭去。智慧与无明是相对立的法，有无明就没有智慧，有智慧就没有无明，如来藏本体是大智慧体，因此就没有无明。七识没有大智慧，就有无明遮障，七识的无明灭尽，四智就圆明。八地菩萨以前七识的无明染污重，染污的业种存在如来藏里，如来藏的名字就叫作阿赖耶识，意思是处于此阶段的众生七识五阴里有分段生死的染污业。</p><p>九、我们能否控制如来藏</p><p>如果我们能直接控制如来藏，就让祂来帮助我们减肥和增肥，帮助我们美容，改变色身体质，以期让色身更健康更庄严更美丽。但是要做到利益如来藏改变色身，必须要有道种智，把如来藏运作原理和增肥减肥、美容的原理搞清楚，智慧是非常深利的，普通人是绝对做不到的，即使证得了如来藏，也控制不了如来藏以随心所欲。因为改变色身需要改变如来藏里四大种子的比例结构，这需要有极强的定力和极深的观想能力，以及极大的福德智慧。即使有这样的福德和定慧，还是控制不了如来藏，因为祂听不懂语言，看不懂文字，不懂得人的命令，因此就无法控制如来藏。</p><p>其实你不用懂得如来藏运行一切法的原理，也不必去控制如来藏，只要能控制自己的六七识就好，尤其是把意根控制好了，就会随心所欲，因为如来藏随顺意根的思心所，意根的想法如来藏能懂，能配合意根的思想念头，但前提条件是需要有业种，尤其是成熟的业种，还要有业缘和相应的福德。就在这样的前提条件，具足这样的业种，就要努力修行，多存善业种子，定慧圆融的时候，如来藏自然会满意根的心愿。意根打算做什么，如来藏都随顺，没有选择，没有条件，不求回报，但必须要照应着业种。</p><p>哪个识也控制不了如来藏，如来藏有一种随顺性，有祂自己的运行规律。但是悟后可以通过各种方法观察如来藏的随顺性，看看祂是否听话，观察后发现，果然是不管你做什么，全都是随顺配合，一点也不违拗。如来藏太神秘，太深细，太难控制了，完全不以我们意志为转移，但是了解如来藏的体性以后，尤其是证得如来藏以后，我们还是可以控制如来藏，牵着如来藏的鼻子走，做善业让祂存善业生善报，只要我们身善语善意善，如来藏就不得不配合造善业，存善种，生善报，改变五阴身和一切正报依报环境。</p><p>如来藏的鼻子在哪里呢？见色祂法尔如是的功能作用。意根是牵如来藏鼻子的手，意识牵意根，意根牵如来藏，一个牵一个，走在学佛路上，最后归家稳坐。这条路是很辛苦的，与自己无始劫以来的业力相抗衡，简直是太辛苦了。因为业力太大了，业障太重了，无明太深了，善根太薄了，福德太小了，愿力太浅了，致使我们在修行路上三大无量劫的进进退退，犹如逆水行舟，没有坚强的毅力，是不能成办的。</p><p>十、唯识无境的内涵</p><p>唯识无境的意思是，一切法只有识也都是识，并没有什么境界和境界相。这属于唯识种智的范畴，与一真法界的意思是一样的，只是理很深，不易懂，更不易观察，如果没有道种智的人，最多只能作以粗浅的理解。</p><p>唯识无境的识当然不是妄心六七识，六七识也是境界相，生生灭灭不能自主，也就不能去主导其他的境界相，能主导一切境界相的只有如来藏识。从唯识种智上来讲，一切法都是如来藏所幻化和执持的，都是如来藏用七大种子生成的，并且不断的变换七大种子，以保持一切法与业种相应，与果报相应。</p><p>一切法只有识是什么意思？一切法好比是金器，金器的本质都是黄金，除了黄金没有别的，见金器就见黄金。一切法也如此，都是如来藏生成和执持的，本质都是如来藏，见一切法都应该见如来藏，除此没有别的。</p><p>唯识无境的境，也可以叫作法相，法相的范围非常广大，有色法相，有心法相，有非色非心法相，如心经中所说：眼耳鼻舌身意六根、色声香味触法六尘、眼识耳识鼻识舌识身识意识六识、色受想行识五蕴、四圣谛、十二因缘、菩萨六度、四相、佛身、成佛之道、百法明门、千法明门、亿法明门、无明、无明尽等等。这些法相都是第八识如来藏的空相，没有实质的法相境界相。</p><p>一切法上的法相和境界相都是如来藏生成的相，所以没有境界，都是如来藏。这种观行智慧相当深利，只有具足六七转识成智以后的定慧才能现前观察，否则无明遮障很重，定力浅薄，就没有深细的观察智慧，一切法的实质无法现量观察，就会落入到境界相中，不见真金。</p><p>如果定慧不足，定没有初禅定，慧没有转识成智，所有的观察都会落入想象和推理中。定慧越深细的人，见一切法时见的境界相就会越少越浅，现量观察智慧，越到上地越深越究竟，所见越真，直至佛地完全见一真法界，没有余法可见。每个人只要眼中见有境界相，就是无明，见的境界相越多无明越重，反之，见的境界相越少，智慧越深利。</p><p>十一、虚妄之法也有虚妄的作用</p><p>一切法都是如来藏的空性，实质是如来藏性，没有一切法。但是一切法的虚妄现象还是存在的，是能被感知到的，也有虚妄的作用。比如五阴色身是虚妄的，是空的，是假的，但是还是有色身虚妄的功能作用存在，能互相得见。时间空间也是这样，是虚妄的，是空的，是假的，但是有其虚妄的作用，能被感知到，那么因为时间的关系，物质色法就有前后不同的次第，物质色法也能在空间里生灭变异。</p><p>十二、如来藏能否去后和来先</p><p>如来藏既不能去后，也不能来先，否则如来藏就能独自在三界中运行，第七识意根也能独自在三界中独自运行，然这是不可能的，真心妄心都不能独自运行，必须和合起来共同运行。第七识如果能独自运行，就不用如来藏出生和执持，那就有自性了，就是不生不灭的法了。如果如来藏能独自运行，就不需要五阴七识了，在无余涅槃里就不寂静了，三界法仍然能被出生，无余涅槃就是喧闹的，喧闹就不是解脱了。</p><p>十三、如来藏能显示一切法的信息</p><p>有关自己的一切秘密，是谁流露出去被人知道的？我们与人接触打交道的时候，对方的大概信息我们当下就能了解一些，他人的信息是如何流露出来的？看相片时，没有真实的对方，用不着对方的如来藏传递信息。可是也能了别到对方的性格、年龄、脾气、秉性以及生活背景，这是怎么知道的？死去几百年上千年的人只要留下一点遗物，有神通的人就能根据这些遗物，了解到此人现在在哪里，是什么身份，五蕴身状况如何，这是根据什么知道的？尤其是佛有无量的神通宿命通，每个人无始劫以前的事情大大小小，佛全部知道，包括最微细的细节，佛是如何了知到的？</p><p>睡着昏迷没有意识时，五阴的信息也能透露出去，乃至于一张相片，就能把众生的信息全部透露出来。相片是众多如来藏共同执持的，不是一个人的如来藏能执持的。相片与文字一样不涉及对方如来藏和五阴的事，是自己的如来藏把相片和文字变现成内色尘，意识有智慧时就能思惟、分析、处理相片文字当中所隐藏的内涵。没有智慧时就错误思惟分析，得出不正确的结论。</p><p>遗物上有物主遗留的信息，如来藏可以顺藤摸瓜，找到那个人的如来藏，就从对方如来藏了解了所有信息，意识想知道时，一个是靠神通，一个是靠意根警觉一些重要的相关的信息。比如说一个人住在一个房间里再离开，过了几个小时或者是半天时间，一条蛇进入那个房间里，就能知道刚才有人住在这里，那个人的一部分信息还在房间里，比如温度、气味等等，蛇能了别，然后就能顺着这些信息，寻找到那个人。如来藏就像那条蛇一样，极其灵敏，无所不知，就看意识心的智慧怎么样了，能否从意根如来藏那里把信息挖掘出来。</p><p>如来藏都在互联网里，随时随地往外发布自己五阴身的一切信息，一点也不保留，同时也能从其他如来藏那里获取一切信息，如来藏之间互通有无，没有什么秘密，既无心遮掩什么，也不故意透露什么，祂的心完全是敞开的。每个众生的意根依自己的如来藏也都能知道对方如来藏里的有关信息，意根就能了知对方，于是有缘的人就有一定的感应。</p><p>如来藏能随时随地摄取五阴身外界的一切信息，意根也就能随时随地缘到外界六尘境界，对自己有用的，重大的信息就要警觉意识知道；不重要的信息，意根自己就处理了，或者是不理，或者是存在如来藏里作为备案。世界上不知道有什么不能泄露的秘密，世界上是否有秘密存在？每个人心里的事情，也不是只有自己才能知道，还有更多的自己不知道的思想想法，其他人早已经知道了。世上岂有秘密？有宿命通的人，能把每个人无始劫以来的经历点点滴滴像查阅档案似的，快速就能查阅出来，一点小事也不遗露，但都是通过如来藏查阅的，所有秘密也都是如来藏泄露出去的。</p><p>十四、大脑不能存储记忆</p><p>大脑是物质色法，不能存储记忆，因为记忆是法尘，无形无相，与大脑没有交集，况且大脑是生灭的，如果存储了记忆，大脑灭了以后就什么都没有了，后世就没办法延续前世的所有法，即使有神通也不会回忆出前世的事情。一切法都是如来藏给记账存储的，用的时候，如来藏再给提供出来。法从如来藏来，运行过后又回到如来藏之中，再用的时候，如来藏还可以再变现出来。</p><p>十五、执取幻法幻中幻，梦中说梦梦中梦</p><p>六尘缘影如镜中像，我们看的、听的、嗅的、尝的、触的、想的、做的，这一切都是镜子里的影子。我们看镜子里的影子的时候，无论对这个影子有什么感想，有什么想法，想把这个影子怎么造作，不管怎么样，它终究是影子，不是真实的东西。我们分别就分别镜子里的那些影子，这个影子这么好，那个影子那么恶，我们就一直不断的执取抓取，可是不管怎么样也没有真正的执取到什么，都是一种影子，没有真实的作用，都是一场空。就像河里的树影子，再怎么欣赏，它毕竟不是真实有的；就像河里的月亮，猴子再怎样的捞取，到最后也没有捞取到一丝，因为根本没有真实的月亮。</p><p>我们接触的一切境界也是，好像在其中享受到了什么，其实什么都没有享受到，都在和影子打交道。意根指挥六识不断的作意，不断的触，不断的受，不断的想，不断的取着，实际上什么也没有执取到，都在和影子打交道，自己也是影子之一，幻法对幻法，有什么真实可言？可是我们没办法跳出来，没办法了知这些事实真相，因为薄福和愚痴。佛世尊怜悯众生，种种言说譬喻教化众生，修行戒定慧，剔除遮障，认清事实，世界上实无一法可得，息心除妄想，即见真实相。众生依佛语，真修行，才能看清影子，回归自性，得解脱。</p><p>十六、性空与空性的区别</p><p>什么是空？空就是无，首先代表无物、无法、无相、无心、无行；其次代表无所住、无所得。</p><p>性空的意思是，某某法的性质是空的，无物、无法、无相、无心、无行，也无所住、无所得。什么法的性质是这样空的呢？那就要在八个心体当中找，妄心七识虽然是无物、无法、无相，但是却是有心、有所行、有所住、有所得的，因此就不是性空的。如来藏的性质是无物、无法、无相、无心、无行、无所住、无所得，心不挂一物，不着一法，心体中无一切法，无智也无得，因此如来藏就是性空的。</p><p>性空代表德，心空就是德，世人所说的大德，多指证得空的心空无物的得道人。为什么性空心空就是德？因为空是最有力量的，任何事物事理也比不过空，都打不败空。既然心是空的，还有什么超过于空呢？没有了，空是最高最大的，超越于一切，一切人事物都与空无法比拟，因此空就是德。心空的人无所求无所得就值得人天供养，值得人天仰慕和尊敬。</p><p>空性的性，有时候指心体，比如说自性，古时代人一般都用自性这个词代表不生不灭的本体识心如来藏，有自己单独的性用，不被其它法所左右，最明显的就是六祖常常把自性一词挂在口里。空性有时候就是指空的性质，体性是空的，意思是某某法具有空的性质，这主要是指如来藏心体。主语是省略掉的如来藏，宾语是空性，直接代表如来藏本体。</p><p>十七、佛法的含义</p><p>佛法有两方面含义：一是指佛陀所教导的法，能够成佛得解脱的所有方法；二是专指如来藏法。两种含义一个狭，一个广，佛经里大部分讲的佛法都是指如来藏法。</p><p>一切法都由如来藏变现，那么外道法是否是如来藏变现出来的？当然也是，没有如来藏既没有外道，也没有外道法，离开如来藏没有善人也没有恶人，没有善法也没有邪法。除了如来藏之外的法都是虚假的，但是假法有假法的作用，尤其是善法的作用可以抵制恶法，只是不要贪着善法，后续就会有更好的善法出现。</p><p>十八、万法唯心造和唯心现的区别</p><p>唯心造，造是用四大种子或者是七大种子造就万法，只有如来藏这个心有这个功能作用。唯心现，是指能显现出万法的心有八个，八个识心是见分是能现，万法是相分是所现，但七识所显现出来的法，也是如来藏用七大种子造出来的，否则七识就显现不出万法，甚至也没有七识。各识能现相的能力不同，心中所现的相分也互不相同，能力越大，需要的因缘条件越少，所现相分越真，能力越小，依赖的因缘条件越多，所现相分越假。</p><p>十九、阿罗汉入涅槃是否等于入如来藏</p><p>阿罗汉七识五蕴全体由如来藏出生和执持，从来没有一刹那能离开如来藏而单独存在的时候，所以阿罗汉从来不出如来藏之外，更不能入如来藏，否则阿罗汉也是无因无缘本来就有的不生不灭之法体，与如来藏等同了。所以阿罗汉入涅槃，不是入如来藏。</p><p>涅槃是一种没有七识五蕴的一种如来藏单独存在的状态。虽然在这个状态里只有如来藏，没有其余法，但也是如来藏不与七识五蕴和合的独处状态。如果涅槃指不生不灭、不增不减、清净无染等等性质，那么如来藏就有涅槃性。但如来藏不等于涅槃，因为如来藏还有其它许多性质，还有其它状态，涅槃并不完全等同如来藏。如来藏是本体，涅槃是本体的性质和状态。</p><p>二十、五阴世间出世的原因</p><p>每个众生色身组织结构是那么错综复杂，神经系统那么精细，功能作用更是微细。如来藏真是一个能工巧匠，祂使用的设计图纸是什么样的？谁给设计的？如何按照图纸建造色身的？真是神奇无比！</p><p>为什么会有五阴身的出生，最初因什么而有世界和五阴身，楞严经中讲到了一个关键点，就是意根想要明个什么，于是向外探求，才有了混沌世界。在此之前，只有如来藏和意根，杳杳冥冥。五阴身的出生，只能推到如来藏这里，得出结论：名色缘识（如来藏），识（如来藏）缘名色。</p><p>二十一、八个识的缘虑</p><p>缘虑心指八个识，八个识都是缘虑心，都能缘虑，都有思心所。眼识心缘色而有分别性、了知性、思择性；耳识心缘声音而有分别性、了知性、思择性；鼻识心缘香尘而有分别性、了知性、思择性；舌识心缘味尘而有分别性、了知性、思择性；身识心缘触尘而有分别性、了知性、思择性；意识心缘法尘而有分别性、了知性、思择性；意根缘总六尘境界和如来藏之见而有分别性、了知性和思量性。如来藏缘根身器界、业种和七识心行，而有分别性和思择性，因此能缘也能虑。之后一切法就动转起来，生住异灭，五蕴炽燃。</p><p>二十二、诸法如幻</p><p>如来藏幻现出一些法尘境，就是所谓的独影境，继而又幻现出意识，就是独头意识，意识出现了别功能，于是知道了法尘境。期间，法尘境没有来，意识没有去，就了知了境界像，说明诸法不来不去。诸法生灭也是幻化相，因此诸法也不生不灭。</p><p>明了如来藏幻化之理，就会增长智慧，越有智慧越会发现，以前的自己无明是那样的重，毫无道理的执取一切法。过去的东西当时觉得再精贵，现在看起来也不值得一提了；现在的人事觉得再重要，将来智慧增长时也会觉得不值一提。</p><p>二十三、业缘就是助缘</p><p>问：跳高时想跳一米，却偏偏只跳了几十公分，是意根决定只跳几十公分，还是如来藏依业种业缘只能配合跳几十公分？</p><p>答：如果业缘不具足，色身的情况达不到目标，如来藏只能随缘，不能随意根的愿望。就像有人现在就想成佛，业缘不具备，如来藏也无能为力，毕竟巧妇难为无米之炊。</p><p>二十四、各识的俱有依都是什么</p><p>六识的俱有依是意根，意根的俱有依就是如来藏，是如来藏直接出生和执持了意根，意根才能存在和不断的运行。如来藏直接出生了一切法，一切法的俱有依也就是如来藏，没有如来藏就没有一切法的存在和运行。但是如来藏必须依靠着意根才能运作，才能出生一切法，才能显现出如来藏的运行和行相。所以意根是如来藏运作诸法的俱有依，不是如来藏出生的俱有依，因为如来藏本来就有，不用出生，意根也生不了如来藏。</p><p>二十五、意识的地位</p><p>意识在胎儿四个月左右的时候才出现，变造色身这事没有意识参与，即使意识出生了，也没有祂多少事。意识的地位顶多排个老三，很多重大的事情，都不必有意识参与。由此可见，如来藏和意根和合起来，能创造宇宙器世间和五阴世间，很了不得，不用意识出谋划策，不用意识提供任何建议。世间创造出来以后，意识才出来受用和受报。</p><p>二十六、虚空在三界内还是在三界外</p><p>这个问题的思路是这样的，首先把虚空和三界六根概念、相貌弄清楚，如何判断虚空是否属于三界的法，就能得出如实正确的结论了。虚空的意思就是空、空间，主要由空大种子构成。空大种子构成的虚空也叫作空间，特征是能容纳承载，有实际作用，能容纳和承载物质色法。既然是四大中的空大种子构成的，虚空就是色法，有相，是空相。</p><p>虚空是色法，属于色边色，是眼识所见，眼识所见的色法，一定是有相的，只不过虚空是空的无所有的相，色法是不空的有色的相，这个部分在瑜伽师地论里有讲过。色边色的相与色法的相有所不同，睁开眼睛一看，就知道眼前是空还是不空，空这种色法是眼识所见，不空的色法也是眼识所见，空有空的相，不空的物质色法有不空的相。如果空没有相，眼识如何能识别是空还是不空？</p><p>三界的定义是有法，不是空的，有色法和心法，还有非色非心法。心法与色法是两个界限，互相不包含，但色法是心中的色法，色法不是心外之法，虚空也是心中的法，不在心外。虚空也是有法，不是无法，所以虚空属于三界的法。不在三界的法只有一个：自性真心。既然虚空是色法，有作用，能承载物质色法，虚空当然就在三界中，不在三界外，三界外肯定没有虚空。</p><p>虚空是空间的空，龟毛兔角是一无所有的无和不存在的空，不是虚空的空，因此龟毛兔角不涉及是在三界内，还是三界外。虚空没有边际，十方世界都在虚空中，三界有边际，有和一无所有就是三界的边际。三界是苦，到达苦边，没有了色法和七识心法就是无余涅槃，就是三界的边际，涅槃和不涅槃，就是边际界限。七个识的心法虽然不在虚空里，但却是三界内的法，如来藏就不是三界内的法，也不是三界外的法，因为三界外无法，涅槃的阿罗汉没有了色法和七识心法，就不住在虚空里，能住在虚空里的都是色法，也不在三界内。</p></div>"
}]