[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>内 容 简 介</strong> </p><p>如来藏乃是世出世间一切法的发源地，贯穿一切法的始终，是世人所不识的摩尼宝珠，具足一切法的种子，随缘应物无不周。本书从不同的侧面阐述了如来藏的各种功能作用，尽显如来藏主人公的真实面目，能让学人透彻的了解到世出世间全部都是如来藏的真实法界，全体皆真如，无二无他。具体事例从五蕴十八界的所有现象界上，仔细剖析了如何都是如来藏的真实功用，最深细的部分是如来藏与科学，从科学的角度更细微的剖析出如来藏在其中的生成与执持作用，这样使得大众对如来藏是万法源的真理信受不疑，从而有力的否决了外道断灭论。</p><p>书的后部分介绍了实证如来藏的方法和意识与如来藏的区别，分清真心与妄心的差别相，并且按照这些方法去实修，能保证学人证悟如来藏而不是错悟生灭的意识。证悟以后定力有所提升，就能逐渐观察如来藏在五蕴十八界上的运作，智慧不断的增进，心越来越空，与无我相应，解脱的功德受用越来越大，这就是证悟如来藏的利益。证悟如来藏非常重要，希望广大学人都能依止此书，精进修行，早日证得如来藏，发起甚深的解脱智慧，以快速圆成佛道！</p></div>"
},{
    "title": "如来藏功德颂",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>如来藏功德颂<br/></strong></p><p><strong>我有侍者，日夜相守；百般随顺，孝养备至。</strong></p><p><strong>我若向东，祂不向西；我若坐卧，祂不站立。</strong></p><p><strong>我若吃饭，祂不饮茶；我若视物，祂不闻声。</strong></p><p><strong>我若为人，祂不做鬼；我若上天，祂不入地。<br/></strong></p><p><strong>我若行善，帮我积德；我若作恶，助我一力。</strong></p><p><strong>我若修行，随我出世；我若随流，与我入俗。</strong></p><p><strong>我若思惟，赠我识种；我若息心，赐我寿暖。<br/></strong></p><p><strong>我若行乐，祂则随喜；我若寻死，祂也顺我。</strong></p><p><strong>一切秘密，祂全掌握；善业宣扬，恶也不藏。</strong></p><p><strong>人说祂痴，祂实无私；公平公正，平等一如。<br/></strong></p><p><strong>成佛由祂，流转依祂；成事是祂，成人也祂。</strong></p><p><strong>诸佛国土，由祂成就；阎罗地狱，由祂变造。</strong></p><p><strong>无量功德，聚于一身；是褒是贬，祂全不顾。<br/></strong></p><p><strong>自性清净，不缘尘俗；在圣不增，在凡不减。</strong></p><p><strong>净染皆存，自体不污；不慕诸佛，不弃凡愚。</strong></p><p><strong>历劫无名，心性无我；寿量无尽，不生不灭。</strong></p><p><strong>具足万法，一无所得；无价珍宝，不享分毫。</strong></p><p><strong>本为豪贵，屈尊示贫；入我身中，穿弊垢衣。</strong></p><p><strong>摩尼宝珠，光照大千；若不随祂，永处暗宅。</strong></p><p><strong>与祂相较，惭愧疚耻；今我发誓，向祂学祂。<br/></strong></p><p><strong>擦洗弊腻，去除无明；显祂尊贵，示我德能。</strong></p><p><strong>福慧二足，常乐我净；圆满一切，慧日朗照。</strong></p></div>"
},{
    "title": "第一章　如来藏的名称",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章　如来藏的名称</strong></p><p>一、如来藏这个名称通用于从凡夫地到佛地的真如心体，佛地的如来藏里没有七识的无明，佛地之前的如来藏里都含有众生七识的无明，如来藏里的无明是收存的七识的无明，如来藏自心本体却没有无明。为了区别佛地的如来藏与众生的如来藏，就把没有无明的佛地如来藏叫作无垢识，把八地菩萨以上的如来藏称为异熟识，八地菩萨以下的如来藏称为阿赖耶识；统称都叫作第八识和如来藏。</p><p>阿赖耶识是八地菩萨果位之前的如来藏的一个别名，从凡夫位到八地菩萨都用阿赖耶识这个名称。菩萨通过修行，七个识心转变清净了，阿赖耶识里所含藏的七识的染污性减少，烦恼断尽，我执断尽，烦恼习气也断尽，无明淡薄，分段生死结束，菩萨就修到八地果位。这时阿赖耶识的名字就改名为异熟识或者第九识，名字虽然改了，心体还是原来那个不变，就像一个人由于身份不同，称呼也要随之改变，称呼虽然改变了，但人还是原来那个人。</p><p>阿赖耶识为什么要改名称？因为阿赖耶识里所含藏的内容种子改变了，名字就要随着改变，这叫名实相符，心体的名称代表着菩萨七识修行的阶段和程度，代表着七识清净的程度。菩萨再修到把七识的无明都灭尽，到佛地时，阿赖耶识、异熟识这些名称还要改，就改为无垢识或者是大圆镜智，或者是真如，或者是第十识，但心体仍然是原来的那个心体，只是心体含藏的种子改变了。</p><p>众生从凡夫到佛地，始终是同一个心体，只是心体里所含藏的内容不同，所用的称谓不同而已。所以有人说如来藏能出生阿赖耶识，在根本上就是错误的知见，同一个心体，没有出生与被出生的关系，祂们本来是一个心体，不能自己生自己。就像一个人的名字，从小到老分别叫作婴儿、儿童、少年、青年、老年，在家里身份不同，称谓就要不同，一个男人，可以叫作儿子，也可以叫作父亲，也可以叫作老公，都是指这男人自己，称谓虽然不同，但都是同一个人。</p><p>二、如来藏，祂的名字有极多个，在众生修行的不同阶段分别要有不同的名字，在各个经中，因为表达的侧重面不同，就要使用不同的名字。如来藏是心体的总名称，意思是祂含藏着众生的业种，有能藏性，有所藏性，也有执藏性，祂是众生成佛的真体。如来藏里七识的染污性彻底清净，无明灭尽，再也没有生灭变异的现象时，如来藏就是无垢识。如来藏心体与七识的染污和生灭法和合时，就是异熟识和阿赖耶识。不管与生灭和合或不和合，如来藏与阿赖耶识永远都是一个心体，只是里面的业种不同而已。就像是一间屋子，如果是睡觉用的，放一张床就是卧室；起居用的，就是客厅；放杂物的，就是库房，本质却是同一个房子。</p><p>三、第八识的称谓，是根据前七个识而排序命名的，因为祂也有识别了别的体性，也称为识，所以就把祂排在七识后面，叫作第八识。祂是总名称，表示与七个识不同，但祂也是心，有心的性质，有识别的功能作用。第八识本身是清净无染的，因为有存业种的功能，又不管好坏业种一律收存，于是就含藏了七识的染污业种。七识心每次造作的贪嗔痴染污业都存进第八识里，使得第八识整体不清净，整体就具有了生灭性，就叫作阿赖耶识，而不是阿赖耶识第八识本身不清净。佛在楞伽经里说，阿赖耶识异熟识的体性甚深难懂，凡夫众生不容易理解，世尊恐怕凡夫错会，所以在一些经典里都不显说。</p><p>各个经中对第八识的称谓有很多，名字有无数个，如：无边际，无老际，无死际，无尽际，无苦际，无生际，生死依，自依，法依，自洲，法洲等等，名字极多，都是从第八识真心的各种体性上来命名祂的。我们应该把真心的体性都了知通透，佛法就能通达了。</p><p>四、阿赖耶识与如来藏是同一个心体，如来藏性就是阿赖耶识性，就是如来藏生起妙用的性质，也叫作佛性。如来藏比如是灯体，佛性比如是灯体发出的光，没有灯就没有光，灯体起用就有光。如来藏本体是不生不灭的，只要是有情众生都有如来藏，也就都有佛性，都能成佛。所以若有人说阿赖耶识会转变为如来藏性，那就是错误的，因为名字后面多个性字，就表示由心体转变成佛性了，而心体与佛性之间不能转变，心体永远是心体，佛性永远是佛性。如来藏性也不能变成如来藏，如来藏与阿赖耶识是指一个心，只是名字不同而已。如来藏生起见性的作用就是佛性，如来藏与佛性之间根本不能互相转变，如果能转变，如来藏就没有了，那也就没有了佛性。</p><p>明心开悟时是证得第八识如来藏，这是禅宗第一关；见性时是见佛性如来藏性，这是禅宗第二关；二者之间层次不同，内容不同，所以如来藏与如来藏性之间不能互相转变，阿赖耶识与如来藏性之间也不能互相转变，因为一个是本体，一个是本体的见性作用，是互相依赖的关系，不能互相转变。</p><p>五、若离菩提，就没有菩萨道，也没有声闻缘觉道。因为有菩提，才有一佛乘道；因有菩提，才有大小乘法道；因为有菩提心，才能施设出声闻缘觉解脱道，施设出菩萨道，施设出一乘成佛之道。若没有这个菩提心，就没有一切佛法，更没有成佛之法，世界就会静悄悄，也没有世界。所以真如菩提自性，是一切法的源头，是万法的总纲。</p><p>这个菩提就是指自性清净心，阿赖耶识、如来藏、第八识、本觉，就是异熟识、无垢识、真如……等等无量个名字，说的都是一个菩提心。就像一个男人，对于父亲，他是儿子，对于儿子，他是父亲，对于妻子，他是丈夫，对于领导，他是下属，对于下属，他是上司。在不同团体，有不同称谓，与不同人交往，有不同别名，但都是一个人，没有第二第三。我们只认人，不管他什么称呼。对于真心也如是，别管祂什么名字，都是指真如心体。</p><p>六、阿赖耶识是凡夫至八地菩萨之前所用的真心的名称，表示心体里面含藏着众生的分段生死，含藏着七识的无明，含藏着七识的烦恼和烦恼习气。阿陀那识这个名称，也就是异熟识，表示里面不再含藏众生七识的烦恼和烦恼习气，但是还有深细的无始无明种子没有转变清静，所以这时的菩萨还没有成佛，还有变易生死。异熟识，是指八地以上菩萨的如来藏，这个如来藏里没有分段生死的种子，但是还有变易生死的种子。</p><p>七、众生的如来藏与佛地的大圆镜智有区别，众生的如来藏里含藏着七个识的无明和染污业种，这些种子在如来藏里不断的生灭变异，使得如来藏整体具有了不生不灭、不垢不净的体性；而佛地的大圆镜智，就是佛在菩萨地时的如来藏，祂是修除了七识心的染污种子所转化成的，二者本是一个心，只是所含的种子不同，功能利用不同而已。大圆镜智有二十一个心所有法，众生的如来藏只有五遍行心所法，佛地的大圆镜智是常、乐、我、净的，众生的如来藏是非常非无常，不垢不净的，因为有生灭变异，就有苦受，不是纯乐，又是无我性的。</p><p>八、有人说第八识不是如来藏，如来藏不是阿赖耶识，阿赖耶识不是异熟识，这样的话，众生就有很多个真如心体了，就与佛说相违背，这样说法有很大过失。众生总共就有八个识，如果如来藏不是阿赖耶识，那么就多出一个识，如果第八识不是如来藏，又多出一个识，这样就不符合圣言量和事实。妄心有七个，真心只有一个，多出来的真心要如何用？几个真心在一个众生身上是什么关系？这样自己没法作答和解释了，因此，真心所有的名称都代表一个心体，名字不同而已，如来藏的名称有无数之多，都是从各个角度各个层面来说的同一个真心心体。</p><p>第八识如来藏阿赖耶识相对于七识来说，是真心是真我，但是众生这个真心里还含有七识的恶业种子，这些种子要不断的生灭变异，使得第八识如来藏阿赖耶识成为了不垢不净的心体，因此，阿赖耶识还不完全是真真正正的我。真真正正的我是佛的无垢识真如，无垢识里的业种全部是清净无垢的，再也不会生灭变异了，是常乐我净的我，是最真实的我，具足了我性。佛地的无垢识比阿赖耶识更真，比异熟识更真，这个才是真真正正的真我。无垢识是纯金，阿赖耶识异熟识是含杂质的金，金体是一个，杂染不同。</p></div>"
},{
    "title": "第二章　如来藏的八不中道",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　如来藏的八不中道</strong></p><p>八不中道是讲如来藏心体本具的中道之理，含有八个不和无量个不的中道性。具体内容为：不垢不净，不生不灭，不增不减，不来不去，不空不有，不一不异，不常不断，不真不假。无量个不在楞严经第四卷中世尊讲过一些，在三界世间十八界上就是非大非小，非长非短，非青非黄，非男非女，非人非鬼，非佛非众生，非在三界非不在三界，非东非西，非南非北，非上非下，非这样非不这样，非那样非不那样。在五蕴上的体现就是：非吃非不吃，非喝非不喝，非坐非不坐，非说非不说，非走非不走，非卧非不卧等等。</p><p>非，不是的意思，即，就是的意思。如来藏即是这些法又不是这些法，不在这些法里又不离这些法，这就是中道。真正的中道，是不在两边，不离两边，也不在中间。只有如来藏具有这个体性，所以如来藏是中道心，七识妄心总是在两边，非是中道性。</p><p>如来藏非如此，非不如此，比如说如来藏没有口，祂不能说话和吃饭，但是如来藏又不离五阴的说话和吃饭这些事。同理，如来藏什么都没有，祂什么都不做，但是如来藏非不做这些事情，一切法都不离如来藏的参与，都是如来藏所做的。如来藏非男女，非不男女，如来藏没有男女相，但是男女相是由如来藏所变所执持，众生造男女业行时，如来藏记录收存业种，缘熟时再输出业种，众生就有了男女相。众生在母胎里，如来藏根据男人的业种变男身，根据女人的业种变女身。如来藏本来不是男也不是女，而变现出的五阴就分为男相和女相。众生如果造纯净善业，色身就不分男女相，比如色界以上的天人就不分男女，其它佛国土的众生也不分男女。</p><p>如来藏非人、非鬼、非佛、非众生，因为如来藏没有相，说祂是什么都不对，说祂不是什么也不对，因为一切法都是如来藏所出生和显现出来的，哪一法不是祂？如果深细而全面的讲如来藏法，如来藏的体性，如来藏的功能，如来藏的中道性，几大劫也讲不完。只有众生修行证得了祂，这些法自己就能慢慢地观察出来，智慧就有所增进，这叫悟后所得的别相智或后得智。刚开悟时往往是悟得如来藏的总相智，就是心经般若经里讲的如来藏体性的轮廓，以后慢慢地就能知道如来藏在各个方面的比较详细的个别体性和功能作用，这是别相智，别相智圆满通透了，就有道种智。</p><p>其内涵义理如下：</p><p>一、不垢不净</p><p>（一）如来藏的本体是清净的，称作自性清净心，祂没有污染，没有烦恼，没有习气，没有无明，但能记录五阴身的善、恶、无记三业，收藏三业业种，前七识所造作的染污业种存在祂心体当中，使得如来藏整体也有了染污性，如来藏自身的清净性与七识业种的染污性和合起来，就成为了不垢不净的心体阿赖耶识。就象一只干净的杯子，人为地加入了污水，使得杯水不干净了，倒出来的就是污水，但杯子本身始终是清净无染的。用另一个比喻来说，如来藏比喻为一个新房子，房子本身是清净的，但是却装进了一堆污物和垃圾，使得房子成了垃圾房，从房子里拿出去的东西就是肮脏污秽的。新房子犹如如来藏，垃圾房就如阿赖耶识，二者是一个房子，因为所存物的关系，名字就有不同，这就是如来藏的不垢不净体性。</p><p>要想恢复如来藏自性清净心的本来面目，七识就要不断地熏习善法，从而汰除染污种子，变得究竟完全清净，如来藏就成为佛地的无垢识。修行就是通过善法的熏习，先断除烦恼，再断习气，进而破尽尘沙无明惑，种子全部清净以后，众生就成就佛道。</p><p>（二）如来藏本来就是自性清净心，因为存了七识心的不净业种，祂才成为不垢不净的如来藏，由于执藏了染污业种，如来藏就要依据业种变生众生染污的七识心，染污的身口意行，变现出众生的种种恶业果报。如来藏出生这一切法，有祂自己独特的运行规律，按照祂所收存的业种来显现一切法，不是我们七识能够主动去运用和支配的。即使我们不想用祂，不想让祂现出各种恶业果报，祂也得照样按照因果规律运行。如来藏造什么变什么，祂自己也不能作主说的算，祂也不能随意乱造什么法，要变造什么样的法，都是要依据众生缘熟的业种来决定。</p><p>我们所要作的，就是修妄心七识，不用管真心如来藏怎样运行，以及祂给我们变生什么，其实我们也根本管不了，控制不了。我们自己如果把妄心修好了，心行由恶转善，由无明转变为明，多行善业不造无明业，善业种子存在如来藏里，缘熟时如来藏输出这些善种，自然就造出清净美满的世界，生出我们庄严的色身和清净的心行。要想让如来藏出生我们所满意的一切法，妄心七识就要多造善业，不造恶业，多存善种，剔除恶种。修行就是把自己的七识心改变了，断恶修善，最后心地变得清净无染，才能让一切法都完美无缺，达到究竟，如来藏就会从不垢不净，转变为清净无垢的无垢识。</p><p>二、不生不灭</p><p>（一）如来藏从无始劫前就本然的法尔如是的存在着，祂不是被谁创造出来的，不是被生出来的。祂在未来时劫永远也不会灭去，任何人任何物也不能毁坏祂，祂就是金刚不坏体，因此如来藏就是不生不灭的。修行是要改变祂所含藏的业种，并不是改变祂的自体性。祂的体性不变，本体不生不灭，所含藏的种子有生灭。</p><p>如来藏虽然是不生不灭的，七识妄心所造作的一切法却都是有生有灭的，五阴七识本身也是有生灭的。比如妄心修的八正道，在很多种情况下，不能一直坚持修下去，没学佛时，不修八正道，修八正道以后，还会退转，修完八正道，也就不用再修了，所以修八正道就是生灭法。如来藏不修八正道，祂根本不学佛、不修行，也不想成佛、作佛，祂不受戒、不守戒、不犯戒、不修定也不修慧，因为祂本自具足一切法，什么也不欠少。</p><p>七识妄心有修行和不修行的现象存在，住于两边，有生有灭；如来藏不住两边，非修行非不修行，祂就没有生灭。如来藏非不修行，在五阴七识修行时，祂帮助输出五阴七识修行所需要的所有种子，同时收藏修行的业种，记录修行整个过程和结果，将来就能实现修行的因缘果报，修行就离不开如来藏。如来藏也不在中间，因为没有一个什么法叫作中间，如果真有个中间法，这个法也是边。如来藏任何法都不住着，祂是无所住的心，当然不住中间和中道。</p><p>四圣谛法也是妄心七识修的，非是中道。五阴有苦、有集、有灭、有灭道，如来藏没有苦集灭道，如来藏非苦集灭道，非不苦集灭道。为什么如来藏非苦集灭道？因为苦集灭道法是依如来藏而有，众生造业受苦报，是如来藏把业种输送出来，众生才有苦受。众生由于贪爱而造业，集藏了未来世的苦种，业种存在如来藏里，如来藏有集藏业种的功能作用。</p><p>如果没有如来藏收藏业种，众生任意造业，也不会有果报。包括修八正道的善业，也是存在如来藏里的，众生依如来藏才能修八正道。没有如来藏，连五阴身也没有，何况修行。五阴身全靠如来藏执持着，各种修行全靠如来藏配合着，否则五阴什么也不能做。所谓的灭也是如此，修道以后灭了苦的业种，也是灭如来藏里存的苦业种，所以一切法都与如来藏有关。</p><p>缘觉的十二因缘法也如是，无明种子是存在如来藏里的。身口意行是如来藏执持的，六识是如来藏生的，投胎、住胎、变生胎儿，都是如来藏所为。六入是如来藏所生，生长五阴身是如来藏所为，六根、六尘是如来藏所变，受阴、想阴、行阴、识阴都是如来藏的功能作用。辟支佛修十二因缘法，如来藏输送种子帮助他修十二因缘法，帮助记录收存善业种。思惟观行时都是如来藏配合输送识种子，缘觉辟支佛灭了无明，也是灭了存在如来藏里的无明。</p><p>如果离开如来藏来谈十二因缘法，那就是戏论。因为离开如来藏，就不存在其中任何一个缘，何况是十二个缘。所以因缘法也不是中道，因缘法是生灭法，其中所依赖的如来藏才是中道法。所谓的名色缘识，识缘名色，这个识就是第八识、阿赖耶识、如来藏，所以这个识是中道法中道性，离开识就不成立因缘法。大乘法依如来藏而说，围绕如来藏而讲，小乘法也同样离不开如来藏，离开如来藏就没有苦空无常无我，没有苦集灭道，没有五阴的存在，也就谈不上修行和轮回了。</p><p>（二）如来藏是生万法的因，但孤因又不能生万法，必须是如来藏依靠各种缘，有万法的种子，才能生万法，同时也要依赖意根的执取。缺少一缘，如来藏都不能生万法和一法，必须缘熟，缘具足，一切法才得以出生，这是生万法的条件。而如来藏本身是不用生的，祂本来就有，不用什么来出生祂，也根本没有能生祂的法存在。</p><p>如来藏为天地之始，万物之先，法尔如是，没有道理可讲。因此，如来藏就是独立自主的，不需要依赖他缘，就能自己单独存在。如果是被出生的，祂就得依赖出生祂的理体而存在，不能独立。这些道理很深细难懂，久修之后才能有些悟入。</p><p>在佛地，世尊的真如心要出生世尊的五蕴身，也需要各种缘。讲出三藏十二部经典，也需要各种缘，制定戒律，需要各种缘；度各类众生，需要各种缘，每做一件事都需要各种缘，孤因不生法，法依缘而生而现。世尊到娑婆世界来，也需要很多的缘，在没有来人间时，世尊就要观察娑婆世界众生的缘是否成熟，何时成熟，众生修行的缘成熟了，世尊降生的缘就成熟。世尊还得要派先遣部队来到人间，等候世尊降生，配合世尊一起弘法。世尊成道后，宣说三乘法也是需要很多缘，不是世尊自己能够决定要如何就如何的，都得看众生的缘，以及其它相关的缘。因此如来藏所出生的一切法都是生灭性的，不是中道法，只有不生不灭的如来藏，才是中道法。</p><p>（三）阿赖耶识到底是不是生灭的</p><p>阿赖耶识本身不生不灭，而所含藏的七识的业种是生灭的，七识的业种存在阿赖耶识里，使得阿赖耶识里的种子生灭变异不停，因此整体的阿赖耶识就具有了生灭性，祂是不生灭的本体与生灭的业种和合组成的心体。但是业种无论怎样变异，阿赖耶识心体始终不变。比如一个杯子，装满了水，里面的水总会发生变异，但是杯子本身是不变的。杯子和水和合成为杯水，那我们才能说，这杯水是干净的，那杯水是不干净的，无论干净与不干净，都无关杯子的事。阿赖耶识就像杯子，七识就像杯子中的水，所以说阿赖耶识是生灭与不生灭的和合体，有生灭变异性。</p><p>现在末法时期众生普遍存在断灭思想，因为如来藏阿赖耶识之理很难理解，更难寻觅到，所以众生往往就认为如来藏阿赖耶识只是一个名词概念，心体并不真实存在。但是这个阿赖耶识，却是非常实在的，因为祂是实在的，所以五阴才是不实在的，佛才讲阿含经，让众生断除五阴我见，不认五阴为实在的我。世间法当中有实在的法，也有不实在的法，如果认为阿赖耶识是生灭的，不是实在的，那么就要认取五阴当中的某些法是实在实有的，比如认有某种程度禅定的无念的意识为真实的，是不生灭的，这是众生根本的邪见。如果五阴和意识是实在的，那么佛陀就不会讲四圣谛法，让众生断除五阴我见，来否认五阴的真实存在性。所以阿赖耶识本体是不生不灭的，其含藏的种子是生灭变异的。</p><p>三、不增不减</p><p>众生如来藏的功能作用不增加也不减少，祂不会通过修行增加什么，不会因为不修行而减少什么，因为祂不修行；祂不会因为持戒变得更清净，使得染污更少，因为祂既不受戒，不持戒，也不犯戒，自体也没有染污性；祂不会通过学习，变得更聪明，因为祂不学习；祂也不会因为不学习或年老，而变得愚痴，祂也不老；祂也不会因为勤恳或懒惰，就变得富贵或贫穷，因为祂所含藏的地水火风种子，及前七识的种子不增加不减少，其功能作用永远如此。</p><p>相反，前七识的功能作用，总是有所增加和减少，心所法也不断发生变化。前七识可能要变得聪明或愚痴，可能要增加或减少善业种和恶业种子，可能要变得清净或污秽，可能要明白或忘记一些事情，七识时刻都在发生着增减变化。以此就可以判断出：我们认识事理、了知一切法的识心，是真心还是妄心，妄心要经历从不认识真理到认识真理，由无知到觉悟的阶段，而真心永远不改变。</p><p>四、不来不去</p><p>（一）如来藏无形无相，祂没有来来去去的生灭法相，有形有相才能有来去相。祂无始劫以来就存在着，本然就在，没有什么法能变生、出生祂，所以祂没有来处。当众生五阴灭去，世间法也灭去时，如来藏不灭，祂永远存在，所以如来藏也不去，祂没有所去之处。又因为如来藏遍五蕴、遍六根六尘十二处、遍十八界、遍一切法、遍一切时，时时维持着五阴和十八界的活动，所以如来藏在五阴身上没有来和去，在六根上没有来去，在六尘上没有来和去，在六识上没有来和去，在三界世间里都没有来和去，所以如来藏不来也不去。</p><p>如来藏没有来去，没有生灭，没有增减，没有垢净，但是祂所产生的法却有生灭，有来去，有变化，有增减，有垢净。只有这一个没有生灭，其余都有生灭。包括应身佛、化身佛能出生，也能涅槃灭去；所有菩萨摩诃萨的色身也是要出生和灭去。所以佛和菩萨们到这个世间来，本身就有不生灭的如来藏和生灭的五蕴，佛菩萨就是在世间的生灭法中来来去去。因为世间的一切法都是生灭的，佛菩萨到这个世间就要接触这些生灭法，利用这些生灭法来度众生。</p><p>如果没有这些生灭法，佛菩萨只剩下如来藏，那就什么也不能做。单独一个如来藏的存在，就是阿罗汉的涅槃境界，佛一再告诫菩萨不要取这样的涅槃，取这样的涅槃就是走歧路，很难成佛。佛自己也不取这样的涅槃，佛证得的是无住处涅槃，祂不会住在涅槃里，而是随缘变现无量个色身五蕴，来度化众生。佛变现出来的色身五蕴却是生灭性的，随时可以灭去，然后再在其它有缘世间广度无量众生，没有停止之时，释迦佛的无数个色身，就是生了灭，灭了再生，永无穷尽地利乐众生，无有疲厌。</p><p>（二）真心没有来和去，虽然真心到处出现遍一切处，因为祂无形无相，没有来去相。又因为祂遍一切法，所以就不能说，祂从这一法来，到另一法上去，如果这样说，那祂就有不遍之法了，这就有过失了。真如没有来和去的现象存在，谁也不能看见祂来和去，风可以有来去，空气可以有来去，因为它们是有形有相的色法。而虚空就没有来去，因为虚空无形无相，没有办法来去，真心就像虚空一样，不来也不去，遍一切法地存在着。</p><p>真心来了，也没有来相，祂一直和意根在一起，住胎时，也没有住相；五阴死亡时，真心离开五阴，也没有离相。真心来无所来，去无所去，不来不去，名为如来。如来，心不动地来，没有动相地来；如去，心不动地去，没有动相的去，祂始终表现为如，如如不动，恰如其性，有动相，即非如。</p><p>如，就是原来，就是如一，与原来保持一致，保持原样，不变动。因为如，因为不动，祂就能遍一切法，含一切法，执持一切法。从此可见，祂真是大悲，一法也不舍。舍法，就没有法，有法，祂就不舍法。真心的如，是因为祂无形无相，祂不像雾和空气一样有动转来去，祂没有来去相，不动而如。又因为祂没有心行，没有主观，没有意志，没有观念，没有思想，不做主宰，不对六尘境界，所以说祂如如不动，法尔如是的如。</p><p>（三）如来，好像来了，其实没有来；如去，好像去了，其实也没有去，这就是不来不去的、诸法实相的究竟如来义。如来变现世间一切万有，与世间万有和合在一起，祂好像来到世间万有当中，其实是不来，因为祂无形，就没有来去相。祂没有形色、质量、广博、方圆相，祂就没有来去，随缘现身，却无身可现。世间相灭，真如离去，祂也没有去相，只因无身。若有来去，如来到此，就不能到彼。而如来同时存在世间所有相中，平等显现，遍布于五蕴、七识、六根、六尘、十二处、十八界，天上地下同时显现，七识心所在处，就有祂的影子，从无空缺。</p><p>如来虽然在世间显现，却不在世间中过活。要想找到这个如来，就要在诸相当中，寻觅一个不是世间相、不是七识相、没有任何一个相的心。这个心在平等运行一切法，又对于诸法相如如不动，不起心行，没有贪厌，没有嗔痴，不执于我，无量功德聚于一身。这个如来，与众生同体，等施众生，无有限碍，无求无取，不依他缘。</p><p>（四）没有任何些微法在如来藏之外，因此如来藏缘一切法时，也是缘自心，不来不去，不动自心道场而遍周自心法界。法法皆真如，如来藏不用从此法到彼法上去，也就没有来去相。意根随着如来藏天上地下，如来藏不来不去，意根也就不用来和去，一切法上也都有意根，意根也没有来去相。</p><p>比如说如来藏要到极乐世界，可是极乐世界也在自己的如来藏中，极乐世界与如来藏没有空间距离，无有隔碍，也就没有时间差，甚至全部宇宙虚空也在如来藏中，那么如来藏还用去极乐世界吗？那就不用了。意根随之，也不用动，弹指间就到极乐世界。因此说众生命终往生极乐世界，实则不往，生则虽生，也只是生个相，其性还是如来藏性，谁能出如来藏之外？</p><p>五、不空不有</p><p>（一）如来藏具备空性和不空性两方面的体性。空性，是说祂无形无相，看不见、听不着、嗅不到、尝不到、摸不到，祂无眼耳鼻舌身意这六根，无色声香味触法这六尘，无眼识、耳识、鼻识、舌识、身识、意识这六识，也就是无十八界；又无色受想行识这五蕴；又无无明、行、识、名色、六入、触、受、爱、有、生、老病死这些十二因缘法，无苦集灭道这四圣谛，又无智慧，又无所得。总之祂什么也没有，是一个空的心体，叫作空性心。如来藏又具备不空的——有的体性，祂有真实的功德作用。因祂含藏众生无量的业种，和能出生五阴三界世间的大种子，就能变现十方世界、宇宙器世间，能变现众生的色身五阴。</p><p>（二）任何一法都是如来藏出生，不仅是万法，亿亿法、无量法都是如来藏出生。除了如来藏之外，都是亿亿法中的法，不管是虚空，还是十方诸佛国土，没有一法能超出如来藏这一真法界之外。亿亿法就像孙悟空，如来藏好比如来佛，孙悟空永远跳不出如来佛的手掌心。如果要问如来藏是如何来的，心经中讲如来藏不来不去，不生不灭，本来就有。这些道理不是諸佛制定的律则和真理，而是十方諸佛共同发现了这个真理，才为大众宣说出来，让众生都能证得此理。</p><p>楞严经中佛说：十方虚空生汝心内，如片云点泰清里。这已经明白地告诉我们，虚空是由如来藏所生，而且在如来藏心中所占的位置极其渺小，虚空仅仅是如来藏所出生的万亿法中的一种，世间无一法不由如来藏所造，这是如来藏不空的一面，所以说如来藏不空不有，即空即有。</p><p>（三）如来藏其本性为空，无有一个相存在，这是指如来藏空的一方面，祂又有不空的一方面，祂含藏万法的种子，能出生万法，空有双具。悟后既要修学祂的清净无为的体性，也要修学祂的不空的体性，修学祂的清净无漏的有为功德性。这样才能生起大智慧，渐具后得无分别智，进而得道种智，入如来家，并且地地增进，直至成佛，这一切全靠修学如来藏不空的部分，祂所含藏的种子部分，这是唯识增上学。</p><p>如来藏的存在，只能以意识心去认知去证得，如来藏自己不能认知自己，祂没有这个功能，即使如来藏能认知自己，意识和意根还是不能认知如来藏。所有的修行以及认知，大多数以意识心为主，没有意识心，众生就不能分别，不能取舍，也不能修行。意识心如果不分别不认知了，众生或者是处于死亡状态，或者是入无想定、入灭尽定状态，或者是处于昏迷状态。</p><p>证悟是识得如来藏是哪个、在何处、如何运作、如何变生各种法、怎样配合七个识运作的。六祖说：何其自性本自清净，何期自性本不生灭，何期自性本自具足，何期自性本无动摇，何期自性能生万法。这五个何期，就是真实证悟之后的体会。那么其他人证悟时，即使不能悟得这样深，也要悟得如来藏的总体功能作用，否则就是理解性的悟，不是证悟。</p><p>（四）大乘真如的有</p><p>大乘经典中都说有个“有”的存在，这个“有”就是真如如来藏，是佛法修证的根。没有这个根，就没有一切法；万法由于这个“有”、这个根而存在，当然这个“有”是极其重要的。千经万论不离其中，都离不开这个“有”，离开这个“有”来谈佛法，就是外道法。内道和外道的根本区别就在于这个真如的“有”，外道不信有真如佛性，更不能证得这个“有”。外道只有一无所有的断灭空，有一法也没有的空无；佛法却不是这样，佛法讲世间存在的一切法都依这个真如而存在，没有祂就没有一切法。</p><p>缘觉的十二因缘法也依于这个“有”而有，没有真如这个“有”，十二因缘法也不成立，离开真如之体而说一切法是有是空都是戏论。缘觉们修行因缘法，推生死的源头，推到真如如来藏，就推不过去了，齐识而还，不能过彼，就知道没有一个法能离开如来藏而能出生和存在的，哪个法也不能越过如来藏，于是得出一个结论：识缘名色，名色缘识。那就是说五阴身的生死由如来藏而有，如来藏产生名色五阴，名色五阴缘于如来藏而有。十二因缘法，无明缘行，意思是没有无明，就不会有身口意行，但是无论是无明还是身口意行，如果没有真如如来藏，也是不存在的，离开如来藏没有无明，也没有众生，更不会有众生的身口意行。身从无相中受生，就是从无相的如来藏中生，不是从一无所有中来，不是没有处所就能来，这当中就有生命的源头如来藏，抛开这个，别谈受生，不会有生命的出生。</p><p>声闻的四圣谛法也依于真如这个有而存在，否则也是戏论。苦集灭道四圣谛，依如来藏而有苦，依如来藏而召集苦，依如来藏而修道，依如来藏而灭苦。阿罗汉们能够证果，并且敢于灭掉自己，就是因为信受佛说有一个生死依，死后不是全部灭去，还有不灭的生死依存在。罗汉们都知道有个生死依，涅槃以后并不是断灭，这样才能证果，涅槃时才能灭除自我。世尊在世时，如果有人说断灭法，说涅槃以后一无所有，世尊就会叫来那个人，当面指责纠正他，让他信受身中有不灭的生死依如来藏。</p><p>现世的学佛人对于真如之理，多数没有明了，没有弄懂。没有明了时，对于真如的空与不空部分，总是含糊不清，对于空相和空性，也是含糊不清，这些理搞不清楚，不可能证得真如。没有证得真如，也不懂真如的人，当别人谈论真如时，往往都要生出错解。如果错解以后，口中再错误评论，那就是谤法行为，与事实不符，就是谤，这种谤，很容易产生，后果很严重。如果证得了，对于真如第八识阿赖耶识如来藏，就能够表达清楚，没有证得就含糊不清，前后颠倒，自语相乱。没有证得的人，因为不知真如到底是什么，是怎样的无相，没办法弄懂这些理，就认为真如的无相就是无。因为不懂，没有证得，别人谈论真如时，不解其义，就说着相着有、心里没有空。这样就恰恰说明了自己对于真如的所知甚少，多数都认断灭空的空，不认空性的空。</p><p>能够把真如之理讲清楚，讲细致，讲祂的不空部分，产生万法部分，储存种子部分，是大智慧的成就。如果把真如如来藏的存在说成是假有，就等于否定了真如的存在，就是断灭空论。假有的法不能有真实的功德和作用，而真如确实含藏无量之多的种子，具有无量之多的功德，因此才说祂真实不虚。菩萨开悟以后能逐渐的了知如来藏中的种子功能，这样智慧才能逐渐增长，如来藏中的种子功能都证得了，就是佛所证得的一切种智。</p><p>真如如来藏所产生的一切法、一切相都是梦幻泡影，而真如不是梦幻泡影，是真实有，不知此理，就不能证真如，不能悟道。真实有的法才能证得，探求祂才有意义，一无所有的法探求到最后也是空，就像芭蕉一样，剥开它的皮，剥到最后是一无所有，那就什么也得不到，追求它也没有意义。而真如不是芭蕉，探求祂，会有无量的智慧生起，终究要成就佛道。否则一路空下去，就是外道的空，到头来一无所获。</p><p>即使阿罗汉的那种空，佛也不希望菩萨去修证，不希望菩萨们把一切法都灭掉不用。菩萨应该走自利利人的菩萨道，不能一味的追求空；菩萨们的修行都依于真如而修，追求开悟，证真如，然后依止于真如，修证自己，最终成佛。总起来说，佛法世俗法都依真如而有，真如理甚深极甚深，难于了知，没有证得时，都要小心口业，千万别肯定说什么，不要把自己的知见当成结论，错误的部分要自食其果，大家要慎之又慎之！</p><p>（五）虚空的概念，世尊在《楞严经》中讲过，它就是虚无和空无，没有色之处就称为虚空。虚空也称色边色，是一种没有色相的色，其本身也是虚妄的，是如来藏所显，不出如来藏之外，本是如来藏性。一无所有才叫作虚空，有一点点的存在就不是虚空。真空妙有是指如来藏的体性，如来藏本身无有一法，是真空，却含藏着万法的种子，能出生一切法，这是妙有，真空与妙有二者结合起来，就是如来藏的完整体性，虚空却没有这些功德体性。</p><p>六、不一不异</p><p>不一不异是指万法与如来藏的关系，二者不是一体，也不是二体或者多体。万法包括三界世间一切法，五阴十八界的一切法，都是由如来藏所生。那么五阴十二处十八界与如来藏的关系就是不一不异的。如果说是一体，那么五阴十八界若灭，如来藏也就灭了。事实上，无始劫以来五阴十八界生生灭灭无数次，而如来藏从来就没有灭过，还是原来那个心体，这就说明二者不是一体。如果说二者不是一体，是二体，那么二者之间应该没有联系，各有其主宰性，事实上，五阴没有自主性，不能自己主宰自己。</p><p>五阴十八界刹那刹那都要依靠如来藏输送种子而维系着，就象一个水泵不断输送水流，五阴十八界这个机器才能不断运转。若二者不是一体而是多体，命终之时如来藏离开色身，众生应该能照样存活，事实上却不能。二者的关系有如胎儿与母亲的关系，不是一体也不是二体。若是一体，胎儿死时，母亲也应死；若是二体，母亲死时，胎儿应该可以继续存活。可见二者非一体，非不一体。如来藏就像广阔无际的大海，万法就像海中的泡沫，泡沫生来灭去，大海不变，若没有大海，泡沫也无。二者非一体非不一体，是非一非异的关系。</p><p>七、不断不常</p><p>（一）如来藏的不断性，是指如来藏本身从来没有断灭过，从无始劫以来到现在一直存在，未来永远也不会灭去，无始无终，相续长存。如来藏的不常性，是指如来藏本身，也是由自身的识种子刹那刹那输出，形成了连续不断的如来藏本体，如来藏才能存在不灭，才能有一切功能利用。这个如来藏，其自体的识种子一直在刹那生灭，所以是不常。而本体的运行却永远不会断灭，即使在无余涅槃里，如来藏本体也是在不断地运行着，因为祂自体的识种子仍然在不断流注输出，不断地在维持着如来藏本体的存在。</p><p>如来藏的不常性的另一个含义是，如来藏的心体里含藏着七识所造作的染污种子，这些种子要不断地进行转换。学佛修行，要把染污种子，逐渐转换成清净的种子，所以如来藏里的种子要不断发生变化，祂不是永远长存不变的。因此，由于七识业种的不断变化，拖累如来藏就要不断地发生转变，由染到净，由净到染，不是常不变异的，因此如来藏就不是常。直至成佛，七识业种完全转换清净了，如来藏中含藏的种子才能永远不变异。如来藏心体里的内容才能不发生改变，如来藏也就是真常的无垢识了。因此，从总体上来说，众生的如来藏就是不断不常的。</p><p>（二）禅堂无禅也无道，从不谈禅不说道。非空非有非断常，不立二边也无中。</p><p>非断非常，指众生的第八识如来藏，本体是常恒不变异的，里面的种子是生灭变异的。而且如来藏自身还有识种子，在刹那刹那输出，刹那刹那生灭，这样就保持了如来藏本体的不生灭和常恒性。</p><p>八、不真不假</p><p>如来藏本身叫作真心，是真实存在的心体，也叫作法界实相，因此祂具有真实性。但是其心体内含藏着七识生灭法的种子，含藏着虚妄法的种子。因为含藏着这些种子，如来藏才能不断地产生各种生灭法，产生各种虚妄法。也因为如来藏含藏着这些有为法的生灭变异的种子的缘故，如来藏就与虚妄的生灭的假法和合在一起了，使得如来藏具有了不真不假性。若说祂真，奈何祂含藏着七识的虚妄法种，若说祂假，自体却是真实存在的，具有真实的体性作用。因此如来藏也就具有了不真不假性、即真即假性。</p><p>以上是讲如来藏的中道体性，如来藏的中道体性与外道所谓的中道有本质的区别。佛法当中讲的中道，是指真心如来藏的中道体性，如来藏有八不中道以及无量个不的中道体性，都是在说祂既不如此也不如彼，离开两边，也不在中间的状态。而离开如来藏心法讲的中道，就是外道讲的中道，名为心外之法。世俗法中所谓的中道，其实都是边，都在生灭性两边打转，不离两边，都属于边见和邪见，不是佛法里的如来藏中道性。</p><p>有人认为天地万物人和就是中道，这是中庸之道，中庸之道属于生灭法，有生有灭之法就不是中道，正是在边上，属于两边之法，因此这些都是生灭的两边之法。所谓的中道，是离开生灭、明暗、空有、来去、垢净、断常等等两边的一切世俗法，离开对立和统一的一切世俗法，祂不是混合体，也不是融合体，也不是对立统一体。</p><p>有人说安详也是中道，安详是意识所处的状态，是对立的两边之法，意识心中有安详之时，就有不安详之时，有此就没彼，二者不能调和在一起，因此安详就不是中道法。一剂麻醉药，就无法安详了，一个交通事故身体损伤，就再不安详了，临终四大分解，犹如活龟剥壳，只有难言的痛苦，哪里有安详，哪里还有正受，即使是一个小小的逆缘出现，内心也就不安详了。</p><p>世人活的再潇洒、再自在、再有诗情画意，也都是生灭法，全部是生死轮回中事，情意重的必下三恶道。古来那些诗人、画家、文人墨客，极大多数都在鬼道受苦，因为他们都有贪爱，而且有的还是极重的贪爱。楞严经中说：情多想少，流入横生，就是畜生；七情三想，沉下水轮，就是饿鬼；九情一想，下洞火轮，就是地狱，所以众生如果有一爱好，而贪着爱着，那就是生死业，根本没有中道。</p><p>离开真如如来藏而谈的中道，即是边见，又是邪见，全部是世俗法，不涉及出世间法；而中道性的如来藏，既不在世间里，又不在世间外，既不生又不灭，祂不住两边，也不在中间。如果有个中间，还是个边，真正的中道，没有中间，没有中道，祂一法也无，一法也不住。 说个安详，说个自在，说个洒脱，就已经是有对立的边了，但是这里还是有非边的中道法，只是普通人难于体会，因为众生只见安详的妄心相，不见无相的不感受安详的中道心如来藏。</p><p>因此，任何一种边见、邪见当中，都有中道心如来藏在运作着，都是如来藏所生起的法，所以边见和邪见也即是正见，离开正见的如来藏，也就没有邪见，离开中道，也就没有边见。所以一切知见，即是正见，一切色即是佛色，一切声即是佛声，一切香即是佛香，一切味即是佛味，一切触即是佛触，一切法即是佛法，那么解脱之道就在一切法当中，就在目前，仁者要用智慧自行识取。</p></div>"
},{
    "title": "第三章　众生不共用一个如来藏",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　众生不共用一个如来藏</strong></p><p>一、众生不共用一个如来藏，一个众生一个，虽然如来藏无处不在。各人有各人的如来藏，各人有各人单独的一套八个识，不互相混用，否则因缘果报就会错乱。众生无量劫的业种都是存在每个众生的如来藏里，不是所有众生的业种都存在一起。如果业种都存在一起，众生共有，因果就要错乱，那么一个业缘成熟了，让哪个众生去受报呢？一个人的业成熟了，如来藏却给另一个人输出业种，让另一个人去受果报，这就不公平了，因此说众生都有自己单独的如来藏。</p><p>每个真心如来藏自扫门前雪，各管自己所生的五阴的事，管不了别的五阴。如来藏又有持身的功能，祂与五阴同在时，众生就有寿暖识；祂不与五阴同在，众生就没有寿暖识，也没有五阴，身体就是死尸。如果众生共用一个如来藏，如来藏就没办法持所有众生的五阴，祂在一个五阴身上，就不会在另一个五阴身上。因此，一个众生一个如来藏，一个五阴身一个如来藏。</p><p>如果众生共用一个如来藏，这个如来藏在哪里呢？如果在虚空，祂就和每个众生无关，就不能单独持众生五阴身，不能起五阴作用；如果众生共用一个真心，一个人成佛了，所有人就都会跟着成佛，其他众生就不用再修行。现见十方世界那么多佛都成就了，我们为什么还是这个样子？还需要修行？因此众生不共用一个如来藏，各人有各人的如来藏。十方世界有无量个诸佛国土，一个佛国土就是一个三千大千世界，由一尊佛所住持着。也就是说一个众生成佛了，就有一个国土、一个三千大千世界，度化和祂有缘的众生。无量尊佛就有无量个国土，都由佛的真如与所有有缘的众生的如来藏共同变现。</p><p>虽然如来藏能够实现自己所造就的五阴身的果报，但是所有众生的如来藏，也要共同实现所有众生的共业果报。共业是指众生共同造的业行，作为业种存在各自的如来藏里，将来缘熟，就会共同感召共同的果报。比如一部分众生共同到河里捕鱼，造作杀业，将来这些鱼成为人类的时候，就会与这些捕鱼的人进行战争，捕鱼的人就会被杀死。</p><p>这个战争和死亡，就是这部分捕鱼众生的共业果报。众生共同造业，也是每个人的业行种子存在每个人的如来藏里，缘成熟时，所有众生的如来藏都共同输出每个人的业种，大家就共同受报。众生共同造业，造的都是同样的业，就会感召同样的果报。还有别业，一部分众生单独造的业或者单个众生造的业，叫作别业，是有别于所有众生的业，缘成熟时，则众生单独受报。</p><p>二、有人说，众生同一法身，共同受用一个如来藏，这是误解法身平等的含义。众生同一法身的含义是指，众生的如来藏真如心，其体性是平等的，每个众生的如来藏体性相同，没有高低、大小、胜劣、强弱等等差别，与十方诸佛的真如心体也平等无差别，体性清净，自体不污，不染六尘，能够平等显现一切法，不分善恶、是非、好丑、男女等相。</p><p>众生的如来藏体性虽然平等，但不妨有各个事相上的不平等。众生的业缘不同，事相上的果报就不同。如果造作的业行不同，业种不同，事相上也要平等，那就是不平等了。平等心显现不平等的相，才是平等又平等，是如来藏真正的平等性，平等无差别地显现五阴果报，没有私情，正是如来藏平等一如的公正体性。一切不平等相都是平等的真如理体，叫作平等无差别，相与真如一体无二。</p><p>三、众生不共用一个如来藏，各有各的如来藏，你的如来藏负责你那五阴十八界的事，我的如来藏负责我的五阴十八界的事，各管各的事，实现的是自己生出来的五阴的因果，不管他人的因果事，不负责记载他人的身口意业行，不负责收存和输出他人的业种。</p><p>如果众生都用一个如来藏，为什么这个如来藏给你变成那样的五阴，给我变成这样的五阴，这是不公平的；让你实现那样的果报，让我实现这样的果报，这是不公平的；让他上天，而让她入地，这是不公平的；而如来藏叫作平等觉性，公平公正平等一如。如来藏没有不公平的心行，不会看谁顺眼，看谁不顺眼，祂不会分别人事物理，这是很简单的道理，多思考法义，让自己更契合真理。</p><p>诸佛也是因为各有各的如来藏，因此在因地所发的愿不一样，所修行的内容不同，所经历的事件不同，那么成佛时佛国土就不同，弟子就不同，佛法住世的时间就不同，寿命长短就不同，这些都属于各自的如来藏实现各自的因果范畴，不出因果之外。众生的如来藏不是一个，各有各的如来藏，即使到佛地，也不可能只剩下一个如来藏，让诸佛共用，因为如来藏不生不灭，没有任何人能够把其它的如来藏消灭掉，就剩下一个如来藏。如来藏就是法身，法身就是佛地的无垢识、真如、大圆镜智，一个佛一个法身，含藏不同的善业种子，绝不能共用。</p><p>众生为什么不共用一个如来藏？唯识经典中说如来藏的识种流注出来，形成七个识，七个识分别活动之后，识种子又回到如来藏中，这样自己的身口意行的一切造作，就作为种子带回到如来藏中，如来藏就收存记录下了自己的一切身口意业行，这样就形成了业种。将来缘熟时，如来藏再把业种输出来，自己就受报。</p><p>从这里看出，如来藏只能形成自己的七识，配合自己的七识，记录自己的身口意行，存自己的业种，实现自己的业报。不可能记录他人的身口意业，不可能把其他众生的业种也收存进来，不可能去出生其他众生的七识，不可能出生其他众生的色身，不可能实现他人的因缘果报。否则因果就打乱了，世界就真的无理可讲了，因果错乱，众生学佛修行也就不能有应得的果报。</p><p>四、每个众生都有自己的如来藏，不共用一个如来藏。而且都是众生自己造业以后，业种自动存到自己的如来藏里，缘熟就要承受自己造业的果报。学佛修行以后，渐渐地就能清净自己如来藏里的业种，心地由染污转化成清净，种子全部清净了就成佛。所以每个人都是清净自己如来藏里的种子，不能替别人清净，别人也不能来清净自己如来藏里的种子，否则佛清净了，我们也都清净了，没有这样便宜的事。</p><p>每个众生的如来藏负责实现自己的因缘果报，种瓜得瓜种豆得豆，众生必须把自己的瓜种子种到自己的瓜田里，不能种到别人的瓜田里。然后收获自己瓜田里的果实，不能到别人的瓜田里去收获，即使偷盗也偷不来，否则别人修福，自己就借光得福。这样的话，佛已经是福慧两足尊了，众生只需用佛的福慧就可以了，不用自己辛苦修行。众生只要享受佛的修行成果就可以了，也不用自己修行。</p><p>那么一人成佛，十方世界无量无边的众生就都成佛了。现见十方世界已经有无量诸佛在住持，可是还有不可数的众生在忍受着生死苦，不知什么时候能把这些众生度尽，也不知能不能度得尽，所以佛才让菩萨摩诃萨们发十个无尽大愿，尽未来际广度无量众生，心里永不疲倦。因此说，自己吃饭自己饱，自己修行自己了，都是在自己的如来藏里吃饭、造业、修行、成佛，不能互相代替。</p><p>五、有人说，众生的阿赖耶识是通用的，我可以到你的阿赖耶识里面取我有用的，你也可以到我的阿赖耶识里面取你有用的，这是愚痴无智的说法。如果我造恶业，存在阿赖耶识里，你到阿赖耶识里取了这个恶业种子，然后受恶报，这合理吗？如果你造了大善业，存在阿赖耶识里，然后我到阿赖耶识里取了那个善业种子，我受善报，你就不能受善报，这合理吗？没有人愿意与别人通用一个阿赖耶识。</p><p>若我们与佛通用一个阿赖耶识，佛已经成就，有了无上的大智慧，有无量的福德和德能，我们能不能把佛的果报、福德和智慧德能取来用呢？如果能取来，我们都不用修行，直接取佛无垢识里的就好，我们马上也是佛。那么十方世界就没有众生，三恶道全部消灭，六道轮回全部止息。现见十方世界已经有无量多的佛存在，为什么还有更多数量的众生在受苦呢？众生总是喜欢按照自己的臆想，随意编派佛法，以此来自误误人，根本不懂因果。</p><p>六、众生不共用一个如来藏的证据</p><p>众生的第八识在修行了三个无量劫以后，七个识的无明断尽，最后一次转识成智，第七识变成平等性智，第六识变成妙观察智，前五识变成成所作智，同时第八识就转换成大圆镜智，圆满光照一切法，再也不被七识的染污种子所限碍和遮障，八个识共同成就佛道，这个众生就成佛，走完了三大阿僧祇劫的成佛之路，再也不用修行，成为无学的三界尊。而其他没有成佛的众生，其第八识还没有转变成大圆镜智，还含有七个识的染污种子，含有污垢，不是无垢识，其智慧德能就要受到七个识的染污种子的遮障和限碍，不能圆满光照一切法。因此说众生的第八识不是共用的，一个众生一个，与佛的第八识名字和功能都有所区别。佛的第八识是二十一个心所法：五遍行、五别境、十一善；而众生的第八识只有五遍行心所法，功能作用就逊色于佛的第八识无垢识，不是大圆镜智。</p></div>"
},{
    "title": "第四章　如来藏的分别性和不分别性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　如来藏的分别性和不分别性</strong></p><p>一、如来藏的不分别性，是指祂不分别三界六尘万法。对于六尘法相，祂不做具体了别，只能了别业种，如机器人一般的运作三界六尘法，变造出色声香味触法而不知是色声香味触法，不知色声香味触法为何物，虽然这些法都是由祂先了别和分别，然后不断的执持和改变。</p><p>有一句话叫作真如无念无不念，那么祂也就无受无不受，无行无不行。为什么如来藏无念、无受、无行呢？因为如来藏不分别六尘为何物，所以不念六尘，对六尘境界没有感受，对六尘境界没有心行。如来藏无念却又无不念，世间里没有一法，不是如来藏念出来的，包括六尘境界。真如无受无不受，虽然如来藏不感受六尘境界，祂感受不到六尘境界是好是坏，因此没有苦乐受，对六尘完全是舍受，但是祂能领受世间一切法，因此才能变现出世间一切法。真如无行无不行，如来藏虽然对世间六尘万法不生起任何心行，祂什么不做也不想做，都是五阴七识去做，但是一切法都由祂出生、执持和变化，实际上没有一个法不是祂在做，不是祂在行。</p><p>如来藏的非无分别性，是指祂要分别众生的七识心和业种，了别众生的根身器界，众生的第七识要做什么，打算什么，思量什么，决定什么，祂都能了别到。了别以后，如来藏就为七个识分别输送识种子，配合七识造作一切法。祂能分别众生的业种，就能根据业种，造就众生的五阴身的依报器世间。该造众生什么形状的色身，四肢头眼耳等都安在哪里，皮色、个头、样貌都是什么样，何时出生，何时死亡，祂都知道，这是如来藏对于业种的分别性。</p><p>如来藏的不分别性表现在，如来藏是个和事佬，众生作善作恶祂都不管，一律都随顺、都配合，五阴上天堂下地狱祂都陪着去，可是也没有去；五阴要想吃什么，吃好吃坏，吃多少祂都随顺，撑死饿死祂也无所谓，喝毒药也不管，想自杀跳悬崖，也陪着不离开，祂就这样随缘不变，在不变当中又随缘。</p><p>五阴想成佛，祂配合着一起修行，把善业种存起来，但这一切对祂来说都无所谓，因为祂不分别，无所住地应付着众生的一切，时时出生众生的七识心，让众生象活人似的，执著抓取一切法。其实是谁在执著抓取呢，没有人，都是空幻假相，哪有一切法，一法也没有，幻像而已。总之，如来藏既然是识，祂就有识的体性，有知性。只是不知六尘，但祂知业种，知七识心的心行，祂有很多有别于七识心的知，悟后就能把这些内容一点一点地弄清楚了。</p><p>如来藏离于分别，不分别六尘法，但祂能配合七个识心起分别。祂能分别众生的业种，根据业种来造就众生，做人的业就造人身，做畜生业就造畜生身，从不错乱，永远都是按照众生的业种来实现众生的业果报，丝毫不差，根据众生的业种造就众生的生存环境。祂能分别七个识心的心行，七识要做什么祂都知道，然后就输送识种、业种，让七个识运行。这些分别作用很多，无法一一细说，只能在悟后自己去慢慢观察。</p><p>二、诸法寂灭非寂灭，远离此二分别性；知诸分别是世见，入于正位分别尽。</p><p>具足万法的如来藏是寂灭的还是非寂灭的，这是七识妄心能做的分别。我们不能把这种分别性当作是真心的自体性，那就不会认贼为子，慢慢就不再有生死流转了。我们应该了知能分别万法的心，是三界世俗法里的妄心七识。当我们证得如来藏胜义谛时，观察如来藏的体性，就知道了如来藏根本不对五阴世俗法做任何具体分别，对于六尘祂没有任何分别知见。</p><p>对于色声香味触法的分别性，是世间法里的七识心所具有的，因此是属于三界世俗里的知见。出离三界世间时，就是阿罗汉们取得了四果罗汉的正果，断尽了意根对于三界世间法的一切执著性。取证了无余涅槃，在无余涅槃里，五阴七识全部灭尽，那当然七识心的分别也都灭尽了，只剩下如来藏的无觉无知境界。</p><p>诸法寂灭相，不可以言宣。具足一切法的如来藏，无形无相，无言无说，无所示，无念无想，无来无去，无所行。祂的本体是寂灭性的，其相是空。因此诸佛菩萨只能在言语上表达说明一下祂的体性，言语所表达的，都是指向如来藏这个月亮之指，让众生顺着这个指头，就能觅得真实的月亮如来藏本体。诸佛菩萨也都不能举出如来藏这个月体本身，任何言语都不能把如来藏本体说出来，说出来的都不是祂，而是标月之指。</p><p>三、阿赖耶识能了别众生根身器界，因为阿赖耶识里有七大种子，还有众生的业种，业种存在阿赖耶识里，阿赖耶识能了知到，知道业种是否成熟，什么时候成熟。然后输送七大种子，造众生的五阴，祂了别五阴业种，一定知道众生应该有什么样的五阴，才能如实地变造五阴。变造出来以后，五阴的一切情况，阿赖耶识都知道，因为祂时刻维系着五阴色身，不断地输送和改变种子，色身才能相续存在，并且不断地发展变化。器世间是所有众生的阿赖耶识共同变造的，所有的阿赖耶识都了别自体里的器世间的业种，才能输送四大种子变造出宇宙器世间，之后还要共同维持器世间，让器世间能够生住异灭。</p><p>阿赖耶识了别根身器界，才能知道如何变造，否则就没办法变造，祂不是随意乱造，一定有个规律和原则，祂是按照因果律则来变造和执持一切法。变造身体以后，仍然要了别身体，知道该怎样变化，就让身体怎样变化，都是根据因果律则，法尔如是地运行。祂不是像六识那样，对五阴身，对器世间有各种名词概念，知道具体情况如何，祂没有这种了别性，不会作具体了别，犹如机器一样无心，虽然做了很多工作，但从不知道做了什么。</p><p>祂也没有分析思惟判断的功能作用，祂的知性，完全不同于六识的知。我们每天吃的饮食，祂摄取其中的四大成分，用来再变造身体，祂知道摄取多少，知道怎样变造。业不同的众生，虽然饮食一样，生活环境一样，可是身体却是不一样，就是因为业力不一样，阿赖耶识变造的就不一样。</p><p>四、如来藏也是识，有祂自己的功能作用，有祂特有的识别内容，不与七识同。如来藏能识别众生的根、身、器、界，识别众生的业种。除了七识所识别的六尘，如来藏不做具体名言名相的识别，其余的都是如来藏所识别的内容。如来藏识别众生的业种以后，才能变现众生的五蕴，实现众生的业果报；识别业种，才能产生众生生存的环境，才能变造宇宙器世间。</p><p>如来藏通过流注七识的种子，现起七识，流注四大种子，现起根身器界，如来藏了知众生的心行之后，就要配合众生的七识五阴，生起目前所需的法。如来藏如果没有识别的功能，就不能实现业果报，不能变现众生以及众生的生存环境。如来藏完全是按照业种，输出四大种子，形成色身，形成生存环境，形成宇宙器世间。如来藏的分别性，是悟后学习和具体了知的内容，悟前观察不到。</p><p>五、如来藏的分别性，很深细难知，如来藏能够了别业种、根身器界和七识的心行，因为祂的了别性，才能配合七识出生根身器界，实现业种。如来藏的了别性是以五遍行心所法的形式起用的，五遍行心所法刹那刹那都在伴随着如来藏的运行，首先如来藏要作意于业种和根身器界，触业种和根身器界，接纳业种和根身器界，了别分别业种和器界，取业种根身器界的相，这就是想心所法的作用，然后思心所起用，做抉择做决定，最后开始造作，输出七大种子和业种，万法就运转起来了。</p><p>如来藏在分别之后，才能输出种子，对不同的业种和根身器界，输送不同的种子，变造不同的色法和心法，这是祂分别以后的结果。比如说如来藏变造胎儿的身体，在哪里变造什么组织，变造什么器官，变造什么形状什么色彩等等，祂都知道，这就是分别以后的结果。再比如说如来藏执持和改变众生的色身，能对色身生起分别性，同时也能分别业种，然后根据业种，根据业缘，随时随地变化色身，色身就要常常发生变化，或者变好或者变坏，或者死亡，这都是不一定的，都是如来藏根据业种产生的变化。</p><p>如来藏的分别与六七识的分别，不同之处，就是如来藏取一切的相，没有执著，没有情绪，没有感情色彩，没有喜厌心行，完全是以舍心、机械化的模式运行，按照祂特有的程序，法尔如是的运转。因为如来藏了别时，没有情绪色彩，境界映入心中时，就如镜现像一般。但是六七识与如来藏是有区别的，如来藏完完全全如镜现像，没有喜厌，没有贪厌，没有心行，没有烦恼和烦恼习气，七识了别时，境界现于心中，不完全如镜现像，因为眼识等五识有贪心所法，有粗燥的苦乐受，有喜有厌，所以眼识对于喜乐的色彩，会一直作意触下去，一直了别下去，这就是贪；对能感知苦受的境界，会自动选择躲避，这就是厌，是眼识等五识的心行，六七识更有贪等烦恼心行。而如来藏不管什么境界，既不贪也不厌，既不执取也不躲避，按照其应该运行的程序和法则一直运行下去，直到完全实现了业种为止。</p><p>六、如来藏也是识，祂也有识的体性，有知性，虽然知六尘的存在，但不知六尘为何物，祂知业种，知七识的心行，有很多有别于七识心的知，悟后就能把这些内容一点一点地弄清楚。如来藏有无为的部分，也有有为的部分，有为的部分，就是收存业种，输出业种，配合五阴的活动，输送七识的种子，产生万法。这些都是如来藏的有为性，是祂本身所具有的功能作用。</p><p>种子是被如来藏识别的对象，被如来藏处理输出的对象，种子本身没有了知性，因为种子不是识，只有识才有了知性。如来藏的心体有了知性，依靠着心所法，就能起了别性。七个识的作用，也依赖七个识的心所法，才能产生作用，但是必须是如来藏为七个识输送识种子，七识才能以心所法的形式运行，才能分别和了知六尘万法。</p><p>如来藏本身也有自己的识种流注，在阿罗汉的无余涅槃中，如来藏自身有识种流注。诸佛三大劫修行，就是修行七转识妄心，消除妄心的无明，有一法不懂就是无明，灭尽无明以后，世出世间没有一法是不懂的，全部了知证得，就具足一切种智。而诸法所依的正是如来藏，所以要证悟如来藏，了知如来藏，所有的内容都通达了，七识的无明断尽，就成就佛道。所以学八识的理是正修行，是非常重要的。</p><p>七、如来藏既然不分别，又是如何了别众生心行的呢？如来藏本身既了别也不分别，要看祂了别什么，不分别什么，有些法祂能分别，有些法不能分别。祂的不分别，是在三界世间万法里，祂不能分别六尘万法的具体内容和对象，这是六识妄心所分别的内容和对象。如来藏不分别色声香味触法六尘境界，不分别世俗法，不分别各种名词概念，因为有这种不分别性，祂就不知道六尘是什么，也就不知道六尘的好恶，所以如来藏面对六尘不起任何心念，能做到对境无心，心地极其清净，没有染污，没有贪嗔痴烦恼。</p><p>另一方面，如来藏也有分别性，祂所分别的内容是，了别众生的心行，了别众生的业种，了别众生的六根，了别宇宙器世间，了别众生的十八界。了别众生的心行，心行是指七识心的心所法。祂把七识的识种子输送出去，就形成了七个识，七个识的心所法就会运行起来，心识所有活动就产生出来了。七个识心所法运作的整个过程，以及七识了别的内容，祂都知道。</p><p>如来藏依据七识的作意和思心所，而配合七识，产生万法。七识运作之时就是造作业行之时，业行造作的同时，业种就随时存到如来藏里。因为识种子生出来，又会回到如来藏中，那么七识造作了什么业行，如来藏都知道，业行就作为种子存下来。所以我们所做的一切事，如来藏没有不知道的，没有不记录的。</p><p>如来藏也能了别众生的身根，身根包括了眼根、耳根、鼻根、舌根，这五根。因为这五根再加一个意根，是由如来藏亲自执持的，身根的样貌，都是如来藏根据业种随时变现的，身根出现了什么情况，应该出现什么情况，如来藏都知道。因为应该出现的情况和正在出现的情况、已经出现的情况，都不离因果，就是说不离如来藏的执持和变现。身根出现的各种情况，和要出现的各种情况，第七识依如来藏的见分就能了知到，七识就会生起保护身根的想法，如来藏就会根据业种配合七识心，改变和维持五根身。</p><p>如来藏了别宇宙器世间，宇宙器世间是共业众生的如来藏共同变现和执持的，如来藏能亲自缘器世间，不断地参与变现着器世间，因此才有宇宙器世间的成住坏空。这个器世间从前是什么状态，现在是什么状态，未来应该是什么状态，如来藏根据业种都能有所了知。祂了知以后，意根第七识依之就能知道要发生什么事情，灵敏的众生内心就会感知到预感到，考虑提前采取对策。</p><p>如来藏了别十八界，六根和六识，已经说过了，还有一个六尘。因为如来藏不能了别六尘的具体内容，但是六尘境界毕竟是如来藏亲自变现和执持的，祂既然能了别种子，六尘从前是什么样子，现在是什么状态，以后应该变成什么样，祂依据种子和记录，都能有所了知。祂依据种子变六尘，虽然能够变现六尘，也不知道具体的色声香味触法到底是什么，只是知道变，还知道变成什么状态，就是不知道内容，然后再执持自己所变现出来的六尘。</p><p>这样整个世界，都在祂的一手掌控之中，意根表面看好像是能作主宰，实际上能够主宰一切法的，却是这个主人翁。这个主人翁看似能够主宰一切法，其实祂并没有主宰的心，祂无心于一切法，完全随顺意根，随顺业种，按照世间应该有的相貌，去如实地呈现出来，丝毫没有自己的主张和意见，因为祂没有我性，不作主。</p><p>这样分析，我们就应该知道了，如来藏能分别什么，不能分别什么，知道祂到底有没有分别性。证得如来藏以后，各种智慧产生出来时，就能慢慢地从各各侧面来观察祂。没证得如来藏的时候观察不了祂，祂的很多功能体性就不知道，智慧就不能一步步地增长。所以证悟如来藏，是极其重要的，我们修行的初步目标应该是这个。</p><p>八、如来藏不用我们立，祂本自存在，我们想推翻祂，祂也不灭，任何人用任何力量，都不能磨灭祂，祂是最真最正之眼，虽然能见一切法，而无所见；虽然能知一切法，而无所知；虽然能闻一切法，而无所闻；虽然能觉一切法，而无所觉；虽然能念一切法而无所念。祂无见无不见，无知无不知，无闻无不闻，无觉无不觉，无念无不念。</p><p>如来藏的无知无识无见性，是因为如来藏不对应六尘境界，不能作具体的了别，祂也没有世俗的名言和概念，因此祂不见六尘境界，不知六尘境界，也不生起觉知的功能作用。但是，如来藏又无所不知，无所不见，无所不闻，无所不觉，这是为什么呢？因为如来藏有见大种子，能出生如来藏的见的功能作用，如来藏就有见的功能作用；祂就能见一切法，见一切法之后，才能出生世间一切法，出生七识的见性。如来藏能了别业种，了别业种以后，就要依据业种，变造一切法。如果祂不知一切法，那就不能变造一切法；实际上，因为祂能知一切法，才能变造一切法，祂知的方式，主要就是知一切法的轮廓，不知具体相貌，意根虽然也知一切法的轮廓，但比如来藏知的更具体一些。</p><p>九、不分别是智，分别是识。此句的意思是指，阿赖耶识是大智慧心，具有智性，祂不会六入故，对于六尘万法不了别，祂是智识，不同于七识心的识性。七转识也就是前七识有分别作用，主要是能分别六尘境界，具有识性，是识心，尤其是第六识，分别性最强，而第七识对六尘的分别慧就比较劣，分别性弱。只要七识存在，就要分别。如果七识不分别了，要么是入到深定中，要么是灭掉，众生在睡眠中或者昏迷中，或者是死亡，那这样的话，众生就不能正常的生存了。</p><p>而阿赖耶识虽然不分别六尘境界，但是祂有自己所分别的内容，因为毕竟祂要存在和运作，祂要出生三界世间一切万法。祂一定是分别了之后，才能产生万法，要不然祂凭什么产生万法。祂依赖业种来产生万法，那么祂一定能了别业种，依据业种出生万法。</p><p>祂能出生和执持宇宙器世间和众生的五阴身的存在，那么祂一定会了别宇宙器世间，了别五阴身的状况，不然祂无法维持器世间的生住异灭，无法维持五阴身的生老病死。祂也一定能了别七识的心行，不然祂就没法配合七识，与七识和合运作来完成一切法的现行和运转。而阿赖耶识的智与七识的识，总是在一起运作的，才能真妄和合出生一切法。</p><p>十、如来藏是如何了别众生的根身器界和业种的</p><p>如来藏了别众生的根身器界和业种，是用如来藏的见分来了别，用如来藏的心所法来了别。如来藏的五遍行心所法：作意、触、受、想、思，作意是把心引向根身器界和业种，触是如来藏与根身器界业种相接触，受是领纳了根身器界业种，想是了别知道了根身器界业种，思是决定造作。于是输出七大种子或者是四大种子开始造作五阴十八界和宇宙器世间，万法就出现了。在变造的过程当中，如来藏要不断地作意，不断地触，不断地受，不断地想，不断地思，直至变造完毕。</p><p>其过程是刹那刹那地变造，其结果可能是顿现一切法，有可能是渐现一切法，要看其业种而定。宇宙器世间的形成毕竟不是一件简单的事，而是个非常庞大的工程，涉及到了无量众生的共业种子。造作起来，就非常复杂，需要所有共业众生的如来藏共同合作，需要一大劫的四分之一时间，就是二十小劫，才能形成宇宙器世间。而众生个体色身的形成，业种的实现，所需要的时间就比宇宙器世间的形成要短极多极多。</p><p>因为毕竟是只涉及到单个众生的业种，是众生自己的如来藏单独变造，相对来说就不太复杂，但是我们的意识心也无法想象，没有种智的缘故。而各类众生的业种不同，形成完整的众生色身的时间长短就不同，这里也涉及到众生色身大小的问题，出生的形式问题，也就是业种的问题。湿生、卵生、化生、胎生，其形成色身的时间长短都不同，同样是胎生众生，形成色身的时间长短也不同。同样是人，有三年出生，有十月出生，还有更短时间出生，都是因为业种不同所致。</p><p>十一、如来藏对器世间、五阴身和意根心行的了别</p><p>如来藏了别外五尘，不仅了别五尘的种子，还能了别五尘现前的大致相状和微粒的形态。因为如来藏能摄取四大微粒，一定了别微粒状态。如来藏了别身根和器世间，这是种子形成的状态，无数的四大种子混在一起，刹那生灭，如来藏一定了别器世间所处的大致状态和结构等等，但不是六识那种了别的方式和内容。如来藏知道器世间现在的状态，未来的状态，于是就能维持和改变器世间的状态，这样祂了别的就不仅仅是种子，因为种子已经成为物质色法了。</p><p>如来藏的行相与七识不同，心态差别很大，智慧的差别更大，七识无论如何也比不上如来藏的那种出世间的大智慧，那种创造、变现、执持一切世间法的大智慧。</p><p>如来藏对五阴色身也是刹那的执持和改变着，祂一定能了别五阴身的目前状态，知道下一刹那，要如何改变五阴身，不断的保持五阴身与业种相一致。下一时刻，五阴身是否应该出现病痛，身体是否应该变坏或者是变好，下一时刻应该发生什么变化，如来藏都知道，什么时候应该吐出最后一口气，如来藏都知道，于是就依据业种和业缘促使色身发生改变，随缘造作变化色身，以符合业种，实现因果。</p><p>如果七识心想要发财，如来藏了别意根的心行后，再了别业种，看看有没有相应的业种，发财的缘是否成熟。如果缘熟了，如来藏配合创造发财的机会，制作种种事件，然后钱财到手，否则如来藏对此事就无动于衷。</p><p>十二、分别亦非意是《六祖坛经》里六祖所讲，六祖说的分别亦非意的分别，一般人往往理解为妄心七识的分别性，但六祖这句话的真实义是指如来藏本心的分别性。这个法很深，六祖的讲法全部落在真如自性如来藏上，他讲的一切法都是围绕真如自性，而不落在虚妄法上。</p><p>分别亦非意的真正意思是指如来藏真如自性的分别性，如来藏虽然能分别万法，但是祂没有心去分别，没有特意想分别的心行，不是主动的想去分别什么法，却自动的任运的分别了一切法；无心的分别一切法，而不起任何挂碍，无心于事，无事于心，随缘自在，了一切法相，而无所了，作一切事业而无所作，这样的心犹如虚空一样，自在又自在，悠哉又悠哉。</p><p>如果七识心也像如来藏这样，世间还有什么苦可说，还有什么负累可说，还有什么世间可说，心里空空如也，行于世间犹如行在虚空中一样，这样的大自在，就是佛心的自在，是诸佛的境界。那么如来藏是不是非常值得我们学习和效仿呢？太值得了，即使付出无数的生命代价，也要去皈依归顺于如来藏，况且归顺于如来藏，恰恰就解脱了我们无量劫来的生死苦恼，常饮无所著的甘露，自在逍遥，究竟大乐。</p><p>如来藏的分别性，比如说分别种子，哪个种子缘熟了，哪个种子缘没有熟，应该实现什么果报，不应该实现什么果报，如来藏都能了别到，祂就有这种分别性。但是祂这种分别性是法尔如是的分别，有其自身的运行规律，祂不是有意要分别造作，所以祂这种分别是无意的，没有自己的心意，没有自已的心行，祂是这样来运作一切法。祂对一切法有没有分别性呢？都有分别性，也同样是没有心行，无心无意任运而转的。这种分别性，没有明心的人，很难相应，体会不到这种分别性，有可能把这种分别性和前七识的分别性混在一起。但如来藏没有前七识的那种分别性和心行，没有用心，所以如来藏的分别是无意的。</p><p>十三、楞严经中佛言：如来藏唯妙觉明，圆照法界。法界一是指十八法界：六根六尘六识，二是指十法界：四圣六凡，三是指三界：欲界、色界、无色界。如来藏是一个非常微妙的觉性之体，明而没有无明。明，就是说祂无所不知，没有一法不知道。虽然众生的如来藏，也在时时放光照射着六尘境界，但是祂不知六尘的具体境界，与六识能够具体了知六尘境界的体性截然不同。</p><p>所以有一句话叫作：真如无知无不知。无知，就是指祂不知六尘具体内容，无不知，就是说祂世出世间法，没有一法不知道的。祂圆满地照着法界，四圣六凡当中都有祂存在，三界九地都有祂出现，六根六尘六识上都有祂在作用，一切法都在祂的关照之下。祂是如何关照的呢？这需要自己参，参出来了，佛法的理路就通了。</p></div>"
},{
    "title": "第五章　如来藏的有为性与无为性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　如来藏的有为性与无为性</strong></p><p>一、如来藏有有为性和无为性两部分内容。有为的部分，一个是如来藏能够记录、收存众生身口意行的业种，然后再输出这些存入的业种，实现众生的业因果报；另一个是如来藏能够运用七大种子，产生众生的五阴十八界，产生宇宙器世间一切万法，之后又主导这些万法的生住异灭，了别众生的根身器界，配合五阴七识造作的一切活动。</p><p>三界世间一切法，都是如来藏的无漏有为性所变现出来的，这些运作的功能性，就是如来藏的有为性。如果没有如来藏的有为性，也就没有三界世间一切世俗法的存在和运行，也就没有众生五阴的存在和运转，那就属于真正的涅槃境界了，在这个境界里，一切法都不生也不存在，只有如来藏自体不灭。</p><p>如来藏的有为性，是祂本身所具有的功能作用，祂的有为性有很多，都是不与贪嗔痴烦恼相应的无漏法。比如祂为七个识输送种子，配合识心的活动，输送地水火风四大种子，造就众生的色身，创造宇宙器世间，变生众生需要的六尘境界，产生六识。众生的一切行为造作都离不开祂，祂所作的工作，分秒刹那都没有停止过，众生死时，祂不死，仍然继续工作，在众生活着时工作，死时工作，死后工作，中阴身工作，入胎后工作，出生后工作，无始劫来就没有停止过；而且祂不图感恩，不计报酬，不居功不自傲，又清净，又无为。</p><p>如来藏的无为性，是指如来藏心体在运作过程中，所表现出的如如不动性、不分别性，也就是祂的真如性。尽管如来藏能够产生三界世间一切法，但是祂对于这些法，都不作了别分别，不生心动念，不贪取和厌离，没有任何心行造作，善恶好坏都随缘，祂是一个不知好歹的心。正因为祂对一切法都不生起心行，对一切法心都不动摇，所以祂才能常处楞严大定，不出不入。世间八风利衰毁誉称讥，都不能触动祂一丝毫，如果众生的七识心也能做到这样，修行就已到佛地了，成佛有余。</p><p>如来藏的无为性也表现在，祂不造作任何身口意行，因为祂没有六根六尘六识，就作不了这些事，在三界世俗法中，祂不对六尘，不分别六尘，不知六尘的好恶，祂的无为性，从祂的清净性上就可以看出来。</p><p>二、有人说如来藏纯是无为，没有有为性，其实如来藏有为的不能再有为了，没有任何法比祂更有为。祂从来没有歇息过一刹那，任劳任怨地执持着里外一切事，无论巨细，都是亲力亲为。祂变现出根身器界以后，还要亲自去管理，并不是撒手了事。一切法都是祂幻化出来的，众生在良心还没有发现的时候，不懂得感恩戴德。从小到微尘和细菌，大到华藏世界和世界海，十方诸佛的无量色身，没有一样不是祂有为幻化出来的，虽然不费祂吹灰之力。</p><p>那么我们就不能说祂是与世无争的纯无为法，有为性和无为性和合起来，构成了如来藏的德性，离开一面来谈，都是埋没屈辱了祂。如果说祂事事不管，是个甩手掌柜，那就是个不知恩义之人。如来藏如此地被人误解，就因为祂默默无闻，就因为祂不居功不自傲，就因为祂不好表露自己，就因为祂的彻底无我性。但是一旦证得了祂，以后就会逐渐地发现祂的无量功德性，发现祂越来越多的有为法，然后随学过去，逐渐地达到彻底而圆满地无为和有为，那时就是大乘的无学——佛世尊。</p><p>如来藏在有为法的运行当中，其心都是无为的，所以祂叫作无为法。本质上其心不会主动造作一切法，也没有造作的心行，祂无作、无愿、无求。如来藏的无为性，是无作而作，作而无作；无念而念，念而不念，无为而无不为，多么好的心行，只有佛心才能如如来藏真如一般无二，我们的心，根本就做不到，其间的差距何等之大！</p><p>三、漏，就是心行当中有贪、嗔、痴、慢、疑、恶见等等这些烦恼；无漏，就是心行当中没有这些烦恼。有为，就是有所造作，就是运转，就是行为，包括身口意行；无为，就是没有造作，没有身口意行，不运转。如来藏是无漏无烦恼的无为法，在三界世间里祂没有心行，没有身行、口行和意行，什么也不造作，也没有烦恼，所以就叫作自性清净心。</p><p>但是祂也有有为法，祂无烦无恼地无间断地输出七个识的种子，输出七大种子，不断地变生和显现一切法，收存业种，输送业种，实现业果，这就是如来藏的无漏有为部分。如果没有无漏有为法部分，众生的五阴世间就不能存在了，祂对五阴世间纯粹是无我性的无私奉献，没有一点贪得心理，所以说是无漏的；而五阴的有为往往都是有私心有企图的，心里都有我，所以是有漏的。这种有为法，我们应该好好学习，既要学习转依祂的清净无为的体性，更要学习祂的无私奉献不求回报的有为法，这两方面我们都学习好，彻底转依成功了，修行也就到达终点。</p><p>断除五阴有漏烦恼的前提是要断除我见，然后在修到初禅以后，就开始断贪爱烦恼，嗔恚烦恼也相继断掉以后，就是三果人，贪嗔痴慢烦恼断尽，我执断尽就是四果罗汉。外道们修行，因为没有断我见，不管他们心地如何清净，那都是伏烦恼，不是断烦恼，所以他们不断六道轮回。当他们福德享受完，定力退失以后，还会生起烦恼，所以只靠修定是不能出离生死轮回的，必须配合断我见的智慧，依赖智慧才能出离生死轮回苦。</p><p>无漏的有为法，也就是三、四果圣人所造作的一切身口意行；有漏有为法，是三果人以下的身口意行，尤其是凡夫的身口意行为造作。三果人因为只断除一部分烦恼，没有全部断尽，所以是一半有漏，一半无漏。有漏的无为法，是烦恼还没有断或者还没有断尽的人，入到定中，意识心渐趋衰弱，少于现行，心行淡漠或者消失，就是有漏的无为法。</p><p>四、百法明门中讲六种无为法，除了真心的无为，也包括妄心的无为。因为这些无为法的差别，每个人的禅定深浅也不一。妄心的无为有前五识的无为，第六识的无为，意根的无为。意根断执，在灭尽定中要灭去受想两个心所法，就有一部分的无为。四果罗汉意根断执，对于三界世间法就不感兴趣了，这也是一种无为。修到四禅，觉知心不动，呼吸、脉搏停止了，也是一种无为，初果二果人，证得五阴自我的虚妄，对于自我和五欲六尘的欲望念想就淡薄了，这也是一种无为，智慧和禅定越深，无为的程度就越大。</p><p>妄心七识有有为之法，也有无为之法，如来藏有无为的一面，也有有为的一面。有为的方面就是祂要布施众生所需要的一切，必须维护众生的五阴世间的生活。祂必须记录众生的身口意行，存储众生身口意行的业种，并且缘熟再输送出来。祂的有为法有很多，这才能有三界世间法和众生生命活动的存在。</p><p>五、如来藏有有为性，也有无为性，祂的有为性是指如来藏能如实地依业种，用七大种子变生三界世间万法，变生众生的根身器界，变现众生的七识，出生众生的身口意行，三界世间里的一切法，都是如来藏的有为性有为幻化出来的；如来藏幻化出一切法之后，祂还要刹那刹那地执持着一切法的存在和不断的生灭变异，自身运用心所法在一切法上不断地运行，不断地造作，其佛性的功能也不断地在一切法上运作显现着。</p><p>但是如来藏在做这些有为事业的同时，祂的心行却是无为的。因为祂根本没有任何主动造作的思想观念，祂没有任何一种心行想要主动去生成什么，没有任何心念和想法，都是随顺于业种和七识的心行，按照一定的运行规律，法尔如是地运行。祂没有贪嗔痴烦恼，也没有烦恼习气，没有无明。祂既然没有心行，就没有想要得到什么自身利益的想法，不会想到我要如何又如何，也不会主动去做什么，祂也没有作主性，对任何事情都不作主宰，这是祂的清净无为性。</p><p>那么我们明心开悟证得祂以后，就要现前地观察祂在一切法上的运作情形，观察以后我们就能发现，祂运作时是这样的有为，有为的同时，祂又是这样的无为，有为性和无为性完美结合，使得祂能够成就一切法，又不被一法所束缚，祂天然就是个大解脱者。既然祂有这两方面体性，我们观察到了祂的清净无为性，就可以向祂看齐，皈依于祂，我们在做一切有为法的时候，在身口意行造作的时候，也要尽量地清净，尽量地无为，那么也就能得到大解脱了。</p><p>无为，就是没有任何的心行，没有任何的观念，没有任何的求取心，没有任何的有所得心，没有任何的我性，没有一丝的贪嗔痴烦恼，没有任何的私心和自利心。观察学习如来藏的这些体性以后，也就越来越接近于如来藏的心性，在不弃有为的同时，也渐渐的清净无为，这样的修行，成佛就不是很难的事情了。观察学习如来藏的有为性，从而发起菩萨性，任劳任怨，永远不知疲倦地为众生、为佛教事业而付出，永远不计个人利益。</p><p>所以证悟以后，学习如来藏清净的大智慧，学习祂的有为法性和无为法性，将来就能得到一切种智，那个时候对一切法都能圆融无碍了。因此明心证悟如来藏是极其关键和重要的，不证得如来藏，智慧和心量就不能打开，内心的一切障碍都不能突破。</p><p>六、十方诸佛都已经成佛了，成佛以后，佛还有没有有为性呢？佛如果没有有为性，祂就要永远住在常寂光净土，不再变造三千大千世界，不再分身无量地在十方世界广度无量众生，而每一尊佛都在永不知疲倦地分身无量世界，广利无量众生。为什么释迦佛成佛了，还要到娑婆世界来呢？而且释迦佛已经来了八千次了，祂来此娑婆世界，就是有为来了，为了开启众生大智慧而来，为了让众生证得如来智慧德相而来，为了广利无量众生而来。到我们娑婆世界这样污秽的世界来，跟我们这些无明深厚的众生打交道，付出那么多的辛苦，就是想要多利益众生，救拔出更多的苦难众生，这些都是佛的有为性。</p><p>佛要想做这些有为事业，祂必须是自心要达到绝对的无为，丝毫不为自身利益着想，完完全全彻彻底底的无我无私，才能做得到，有一点我心和私心，佛都不能广利无边众生，也不能成佛。佛做有为事业，要依靠无为的无垢识，来造就自己的五蕴身，造就世间法出来，那么无垢识也同时是在有为了。但是仅仅一个无垢识，还不能完全做到这些有为，还必须有妄心七识的平等性智、妙观察智和成所作智的配合，才能有为出一切法，而有究竟大智慧的七识，也是无垢识有为出来的，所以如来藏无垢识就有有为性。</p><p>佛的无垢识也产生佛的五蕴，产生佛的三十二相，配合着五蕴，佛宣讲出三藏十二部，配合着五蕴，广度无量无边的众生，这都是无垢识的有为性。同时也是佛的五蕴、七识的有为性。在这有为的同时，如来藏无垢识，祂又是无为的，清净无染，没有一丝贪执和无明。佛的心，是彻底清净无为的，不管祂成就了多少事业，利乐了多少众生，却从来不执著自己造就了什么，不执自己度了多少众生，内心里纯净无比，所以佛又是最清净无为的。</p><p>　　七、真如的无为性是，祂不造作任何身口意行，因为祂没有六根、六尘和六识，在三界世俗法中，不对六尘，不分别六尘，不知六尘的好恶，祂不做任何世俗法。祂的无为性，一方面从祂的清净性上可以看出来；另一方面，祂对于一切法都不作主宰，虽然祂出生了一切法，但都不是祂主动的要去出生，祂没有心行和主观的造作，都是法尔如是地按照祂的运行规则去运行。祂没有自己的观点、意见和看法，不对一切法作评判和监督，也不想改变一切，祂永远是完全随缘。</p><p>八、无为法，是指第八识，不是依有为法而相对的假立法，是真实法，本来而有，不生不灭，非假法。第八识相对于五阴七识假我，而说为真我，在凡夫和菩萨位还有生灭种子，还不属于完完全全的我，到佛地时，消除了染污的生灭变异的种子，就成为常乐我净的真真正正的我。</p><p>九、如何理解金刚经中“一切贤圣皆以无为法而有差别”</p><p>贤圣分为四种人：声闻初果到四果、辟支佛、菩萨和佛，其中菩萨和佛都证得了真正的无为法涅槃心，佛的心行全部是无为的，与涅槃心无垢识是一样的，完全依止了无垢识的心性，菩萨的心行其无为的程度不同，也在于禅定的证量不同，智慧的证量不同，其无为性就不同。阿罗汉和辟支佛没有证得根本无为法涅槃心，他们的无为与禅定有很大的关系，与小乘的解脱智慧有关系，与涅槃心没关系，他们临终灭去五阴身，灭去五阴身的一切活动，不起一点利乐众生事业，也不想继续修学佛道。活在人间时，多是入定，心不着境界，少于人间事。</p><p>而菩萨的无为，是证得无为的心如来藏，依无为性的如来藏而起有为的修学佛法和利乐众生事业，既有为的修福，又尽量减少有为性，最后以无为的心性去行有为的佛教事业，混在三界里而不着三界法。这种无为，阿罗汉和辟支佛远远比不上。这就是一切贤圣皆以无为法而有差别的意思，其心行不同，一个是为自己得解脱离苦，一个是为自己和众生得解脱离苦，为自己和众生都成佛道。</p></div>"
},{
    "title": "第六章　如来藏的无所得性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　如来藏的无所得性</strong></p><p>一、如来藏是一个无所得的心，对于一切法祂都不得，祂不拥有任何一个法，是空空净净的一种心体，一尘也不染。为什么如来藏是无所得的心体呢？因为祂对三界世间法，不知不见，无欲无求，对出世间法也是无欲无求，即使对于成佛这一法，仍然是无欲无求，丝毫不贪恋任何一个法，那么祂当然对一切法都是不得的。如来藏具有一切法的种子，一切法都是如来藏所生成和造就出来的，本质都属于祂所有，祂没有必要再向外贪求什么。虽然如此，祂也不自知拥有一切法，因为祂不知，也就更不会再去贪得了。</p><p>通常来说，有所得的都是七识妄心，因为七识对世间法有贪求，有爱乐，也有执著，因此才能有所得。但是七个识心表面上好像是有所得，实际上也没有得，根本得不到任何一个法。因为七识自身都是生灭变异而不自在的，还需要被如来藏输送识种来出生和配合运行，自身才能存在，才能有功能作用。七识自体都是这样的虚妄不实在，更何况还能得其它的法，况且也无有存放之处，自体之外的其它法同样也是被如来藏所变现出来的，同样虚妄的法，那更是了不可得，梦中说梦一样。</p><p>因此自身如果没有真实体性，就不能再得外物外法，七识表面的得也是一种虚幻的假像，梦幻泡影，没有实际意义。众生都是在幻相当中得来失去，得失之法也都是幻有幻灭，晃人眼目，迷人心识而已。七识无量劫贪求、迷执五阴，每一世的五阴却都消散和灭亡。哪一世的五阴都没有抓住，也没有执取到，只是一堆堆业障的累积，然后又不断幻化出后续的业障身，让七识游戏于其中，自生忧悲苦恼。</p><p>虽然如来藏不得一切法，七识也没有真正得到什么法，世间一切相都是虚妄，而了不可得。但是这些虚妄相还要虚幻的存在，起虚幻的作用，我们就要正确对待这些虚妄法，善于处理这些虚妄法。处理好，运用好了，就是佛用，于己于他就有大利益。五阴身虽然虚妄也要存在，不能舍弃，要用来造作清净无为的无贪染的业行。众生一切身口意行虽然都是虚妄的，但也不能都止息，只是一定要有与善相应的身口意行，六道轮回是虚妄，但是我们也要想办法出离不受虚妄的苦患。如何正确对待和行持这些虚妄的法，是每个修行人要解决的问题。</p><p>烦恼虽然是虚妄，我们也要尽量断除，地狱虽然是虚妄，也要远离，其实我们就是生存在世间一切虚妄相当中，离不开虚妄的假相，因此就要把这些虚妄的假相变得更美好，更完善；成佛这件事也是虚妄不可得，但是也要不惜一切，勇猛精进地成就佛道；众生虽然是虚妄，但是菩萨也要大做梦中佛事，度化更多幻化的众生；因果虽然是空，但我们也要识因知果，多造善因，不造恶因，多受善报，不受恶报。总而言之，世间的一切假相我们都不能离开，只能把所有的虚妄相变得更好，世出世间道理就是如此，别无选择。</p><p>二、自性是否是因缘生的</p><p>自性，顾名思义叫作自体的性质，是某种法自己本身存在的体性，是一个事物本身所具有的常恒不变的属性，也就是一个事物本有的体性。能够真实存在的，不依赖外缘而存在的事体、理体才能有自性，否则就没有真实的自性，因为自己都决定不了自己的存在，自己都不能自主，不能自在，那就不可能有自性了。</p><p>如来藏有自体性，有祂自己独立存在的各种体性，祂不依赖外缘而能独立存在，也没有生住异灭的现象。但是众生的如来藏要显现出来，让众生了知，就需要依赖众生的名色，依赖众生的五阴，依赖众生的十八界，这样才能显现出来。我们要想证得如来藏，就要在名色五阴的运行上证得祂。</p><p>自性这一个词汇，通常都是指真实存在的如来藏心体，因为如来藏能不依赖外缘而独立存在，能够自主，能够自在，因此才有自性。而万法就无自性，因为万法不是真实有，是被如来藏依缘所幻化出来的，幻化的事理没有常恒不变的体性，因为这些法本身是不自在的，没有自己本身的自在性，是生灭变易的，需要有许多的外缘才能存在，因此是无自性的。</p><p>自性非因缘生，是本来就有的，是唯一一个无因无缘就存在的法，是实相心，祂真实存在，不生不灭。除此之外都是因缘所生法，是自性所幻化出来，空幻不实的。比如说山河大地花草树木，都没有自体性，它们本身需要依赖种种的缘，由共业众生的如来藏共同变现。它们自己不能决定自己的生住异灭。</p><p>万法与自性不一不异，自性如来藏包含于一切法，一切法都在如来藏理体中。如来藏与万法不相混合，万法灭，如来藏不灭。虚空是万法中的一法，也在如来藏中，是如来藏中极微小的一部分，十方世界都在虚空中，虚空无边际。每个众生无始劫以来的业种都存在各自的如来藏中，那些业无论如何无数台电脑也算不清，如来藏都收存着。如来藏有多大多广阔？如来藏无形无相，无量无边，未来无量又无量劫的业种，都能存得下。因为如来藏无形无相，所以没有大小，多大都是小，多小都是大。</p><p>三、什么叫作有自性和无自性</p><p>不由他法所决定而自己本身就能存在，是本来就存在的，才能有自己的真实体性，叫作有自性，只有法界实相心如来藏才是有自性的。自性清净心有自性，自性三宝有自性，自性就是指有自己的真实而独立的体性，自皈依，就是皈依我们自己的自性三宝如来藏。</p><p>一切法无自性的意思是，除了如来藏之外的一切法都是无自性的，都没有自己的体性，都是本心如来藏依着业缘业种、依着七识心而幻化出来的法，是被如来藏假借各种缘而出生的，因此没有自性，都是如来藏性。因为这些法是不自在的，不自主的，是被变现出来的，不能自己决定自己存在的，不能自己掌控自己的，所以叫作无自性。</p><p>比如说五阴众生，不是由众生自己能够决定自己本身的存在，是被如来藏出生，由如来藏来决定，本身就不是自在的，那么众生五阴的自性就更不自在了。众生五阴本是一种虚幻的假象，生生灭灭，灭灭生生，因此就没有真实的自体性，叫作无自性。一切法都是因缘所现，因是如来藏，还有业缘，因缘所生法也就是缘起法，缘起法就是没有自己的体性，是不由自主的。</p><p>四、万法无自性的意思是说，六尘万法都是被生出来的，是不自在的，都不能自己决定自己的存在，不能自己想生就生，想不灭就不灭的。一切法，除了如来藏，都没有自己存在的真实体性，都是虚幻的，不实的，空的，没有我性的，因此都不是我。</p></div>"
},{
    "title": "第七章　清净性与染污性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　清净性与染污性</strong></p><p>一、如来藏心体中有七大种子，是如来藏的本有种子，清净无染，遍一切处，遍一切法，遍一切时，遍一切地，遍一切界。而如来藏当中同时也存有众生作业的业种，包括善业种、恶业种和不善不恶的无记业种。因为有这些种子的存在，如来藏才能依此而变造出三界世间一切法，才有众生五阴的因缘果报，才有三界器世间的成住坏空。七大种子在如来藏里，只有如来藏才能充分的运用来变造三界世间一切法，业种存在如来藏里，只有如来藏能识别，只有如来藏收存、输出和处理这些业种，实现众生的因缘果报。</p><p>如来藏在出生三界世间法之前，对这些业种作意、触、受、想、思，然后再依据业种，输出七大种子或者四大种子，开始造作五阴世间法，三界世间就运转起来了。七大种子本身不是识，没有识的了别性，也不会主动去生成什么法，只能由如来藏运用来出生万法，同时如来藏再识别众生的业种，就会依据业种而产生五阴万法。</p><p>如来藏心体本身有了知性，因为祂也是识，识就有识的了别功能作用，就有识的心所法的运行。祂运作时完全依靠心所法来运作，用自身的见大作用来了别，用七大种子来生成一切法。七个识的作用，也依赖七个识的心所法才能有自身的功能作用，但是必须有如来藏输送七个识的识种子，七识才有心所法的运作，七识才能分别和了知六尘法。</p><p>如来藏本身也有自己的识种流注，才能保证如来藏心体不断运行，连续不断地出生一切法，显现一切法。即使在阿罗汉的无余涅槃当中，如来藏自身也有识种流注，才能保证如来藏心体不灭，将来缘熟时，再出生阿罗汉的意根，然后再出生阿罗汉的五阴，这样阿罗汉才能再出生在三界世间，修学大乘，利乐众生。</p><p>尽管众生的七个识心有贪嗔痴烦恼，造作业行之后业种就存在如来藏里，但是如来藏心体从来都不受染污，无论何时何地也不生出自身的贪嗔痴烦恼，也不生出恶见邪见，永远清清净净的在三界世间法当中运行。然而如来藏又包容一切法，无论众生造作的善法、恶法、无记法，祂都无所谓，不喜不厌，都会如实的记录、收存、输出业种，并且永远配合七个识造作所有善染业行。祂不分别七个识心是善性的还是恶性的，也不分别造作的那个业行是善行还是恶行，全部随顺，祂是个完全不分别是非的心，因为这种不分别性，祂才是一个自性清净心。</p><p>而七个识心就是对应六尘、分别六尘万法的妄心，既然分别六尘境界，就要对六尘境界起喜厌的心行，在没有修到断除烦恼的阶段，不容易把五阴六尘看空，身口意的行为造作有时就带有染污性。要去掉七识的染污性，首先就要看空五阴六尘，然后渐渐消除识心对五阴自我的执著。明心和证果以后，就证得五阴人我空，再通过不断的观行和禅定的修行，烦恼越来越轻，心地的染污性越来越少。如果能真正地依止于真如，随顺于真如，那么破除意根的我执也就很快了，烦恼就能很快断尽，达到心地的无漏。</p><p>妄心七个识，有贪嗔痴烦恼，有染污，有无明，造作业行之后，业种就自动存在如来藏里，这是业种的生；将来实现了因果，业种就灭，这样如来藏就含藏了有生灭性的染污种子。使得本来清净的心体，成为了不垢不净的心体，而祂自己本身却是清净无垢的。如来藏没有贪嗔痴烦恼，没有无明，因为祂不对六尘境界，不分别六尘，所以对六尘不起心、不动念，没有念想，祂不会生起烦恼染污的心行。又因为如来藏没有无明，能了知三界世间一切法，因此才能变现出一切法。</p><p>修行到最后，把无明灭尽，七个识都清净无余，如来藏心体里含藏的染污种子都转换清净，祂就能恢复自己的本来面目，心体的不垢不净、不断不常、不生不灭的体性就改变，也不是无我性的了，而是真真实实的常、乐、我、净，成为本来的一尊大好佛，这时就要把祂的名字改成无垢识、真如、大圆镜智，心体完全就是真实而如如了。</p><p>二、如来藏心体是本来就清净的，叫作自性清净心，祂不假修行就如此清净，所以我们也不用去修祂。前七个识有染污，有无明，才需要我们修行，通过修行消除这些染污性和无明，识心就转染为净，转识成智。七识的染污的种子都存在如来藏里，如来藏与这些染污种子和合在一起，就使得如来藏具有了不垢不净的体性。通过修行，六七识明理以后，烦恼断除，无明减轻，心变清净以后，那些污染的种子就消灭了，七个识的染污性就消融转化为清净性的了。</p><p>证得如来藏以后，虽然打破了无始无明，但是还有尘沙无明没有断尽，七识心体还没有究竟清净，这就需要我们通过学习经论，不断地进行深细的观行，把如来藏心体中所含藏的种子功能作用全部了知，最后就把尘沙无明都破尽。学佛修行，懂一个理，破一点无明，成佛路上不懂的理，就像灰尘和沙子一样的多，需要我们在无量劫的修行中，一点一点地明得，无明一点一点地减少，最后就能全部断尽，究竟清净，佛果就成就了。</p><p>因为我们轮回的时间太长久了，无明也太深厚了，短时间内很难都破尽，就像一个粪桶，花很长时间把污秽洗刷掉了，那个臭味还需要很长时间的慢慢消除。所以佛说成佛要三大阿僧祇劫。修行越精进，成佛所需要的时间越短，善根越深厚，修行的速度就越快，成道所需的时间就越短，所以我们修行就要多积累善根福德，精进不懈，勇往直前，才能越过生死河，登上彼岸，永远居住在常寂光净土。</p><p>三、真实心如来藏不生不灭、不垢不净，自心是清净无染的，可是心体里却含藏着七识造业的业种，其中多数是染污的种子，这样就把如来藏变得不垢不净了，其实祂本来是自性清净的，因为存储了七识心的染污业种，祂才依据业种变生众生恶劣的正报色身和依报的生存环境，实现众生的种种恶业果报。</p><p>如来藏有祂自己法尔如是的运行规律，祂法尔如是的按照所存的业种出生和显现一切法，我们不能主动去运用和支配祂，谁也支配不了祂，也不能与祂沟通，如果能主动的运用和支配祂，那我们个个都成佛有余，不可能有三恶道和六道生死流转。即使我们不想用如来藏，不想让祂实现恶业果报，我们也没有办法阻止祂，祂也照样按照因果规律来运行。至于说祂造什么，变生什么，祂自己也不能作主，不能说得算，祂不会随心所欲随意乱造什么法，造什么样的法，祂完全根据众生造业的业种，由业种决定。</p><p>我们所要做的，就是修好妄心七识，去除染污，去除无明，不造无明业，不存无明业种，造清净的业，存清净的业种，如来藏就能让我们得大自在。不用管如来藏怎样运行，给我们变生什么不变生什么，我们根本管不了，也控制不了，只有把自己七识心修好了，内心里清净无无明，清净的善业种子存在如来藏里，缘熟时如来藏再输送出这些善业种，自然就造就出我们庄严的色身和殊胜的生存环境，造就出一方净土让我们受用。要想得到大自在，让一切法都满心愿，妄心七识就要多造善业，不造恶业，多存善种，灭除恶种。修行就是把自己的七识心改变，断恶修善，心地变得清净没有无明了，如来藏所变造出的一切法才能都尽善尽美，究竟圆满一切法。</p><p>四、阿赖耶识本身是清净无染的，祂没有无明，没有贪嗔痴烦恼，也没有烦恼习气，对六尘境界不见不闻不嗅不尝不触不觉，不了知六尘，本自清净。但是八地菩萨之前的众生，不包括八地菩萨，他们七识心造作的染污业种存在阿赖耶识里，那么阿赖耶识出生的七识心就有染污和无明，在因缘果报上还有恶报。因为阿赖耶识存进来什么业种，遇缘时就要输送出去什么业种，不会无缘无故的随意出生什么法，而且拿出去的都是七识心存进去的，不是阿赖耶识本身所有的。</p><p>因为阿赖耶识含藏着七识的染污种子，我们就说阿赖耶识是不垢不净的，又因为业种在阿赖耶识里不断的生灭变异，众生通过修行，染污的业种减少了，善业种子增加了，我们就说阿赖耶识是生灭与不生灭和合的，其实阿赖耶识本身是不生不灭的。到八地菩萨时，因为菩萨的烦恼和烦恼习气断尽了，分断生死没有了，生命就不是一段一段的，寿命非常长久，表面上好像没有生命体的死亡现象，其实还含藏着变易生死，还有生死现象的存在。</p><p>这时的阿赖耶识就改名为异熟识或者是菴摩罗识，心体里面还含藏着七识心的尘沙无明没有断尽，这时也可以把祂方便叫作第九识，其实还是原来的那个如来藏，只是依据心体里包含的内容不同而改个名字罢了，这样的话，祂只是名称改了，心体不变，还是原来那个，并不是又多了一个识。</p><p>等到无明都断尽时，祂的名称还得要改，叫作第十识、无垢识、大圆镜智或者是真如。因为这时七识心已经没有无明、烦恼和烦恼习气了，是完全彻底清净的，第十识的心里再也不含藏七识心的染污业种，已经无垢了，又叫无垢识，其实祂本来就是无垢的，是七识心连累了祂，所以成佛以后也不是又多了一个识，仍然是八个识，这样八识就改名为四智。</p><p>五、真如无形无相，不能以眼见，不能以耳闻，不能以鼻嗅，不能以舌尝，不能以身触，也不能以意识心臆测。但是可以用意识心去明白、去了知、去寻觅、去证得，证得之后，用意识心观察祂的运作，了知祂的各种功能、体性，了知祂含藏的种子，观察祂的清净性、无为性和有为性，相续不断灭性，这样悟后的智慧就会不断地增进，越来越深利，悟后所得的智慧，就是通常说的后得智。</p><p>真如如何清净呢？当我们眼见色时，眼识和意识同时分别色尘，不是贪就是厌，意识就要不断的生心动念，起觉受，生起各种心行，造作各种贪嗔痴业行。但真如无眼不见色，绝不对色起心动念，不会对色有任何心行，也不起惑造作业行。我们喜欢什么，祂都不喜欢，我们厌恶什么，祂都不厌恶。而又能协助我们看色，让我们喜欢和厌恶，祂对这一切都无所谓。当我们耳听声时，六根触六尘时，意识不断的起心动念，心生染着，造作贪嗔痴业行，而真如没有六根，不对六尘，不起心不动念，没有染污性，也不造业行。</p><p>对于六尘是什么，不是什么，祂无所谓，对于七个识做什么，不做什么，祂无所谓，而且都能随顺配合，让七个识完成想作的一切事。我们吃饭挑美味，祂无口不吃，我们吃饭吃什么，祂无所谓。吃毒药，祂不管，吃甘露，祂也不管。我们穿衣服挑挑拣拣，祂无身不穿，穿什么祂都无所谓。</p><p>我们学善法，祂无所谓，不会生起欢喜心，还配合我们一起学。做恶事，祂无所谓，还会配合我们一起做。我们享受娱乐时，祂无所谓也不享受，还会配合我们享受。我们自杀时，祂无所谓，不劝导不阻拦，还会配合自杀。总之，祂就是一个无所谓的心，事事都与己无关，心地极其清净，任何时候都清净，永远都是清净的。</p><p>真如其体性为空，无有一个相存在，可是一切相都是祂出生的，祂真空能生妙有，空有双具。悟后既要修学祂的空性、清净无为的体性，更主要修学祂的不空的体性和功德作用，这样才能生起大智慧，得到后得无分别智，进而得道种智，入初地，地地增进，直至成佛。</p><p>地上菩萨的道种智内容，主要是修学真如不空的部分，祂所含藏的种子部分，这是极其难学的。真如的存在，只能以意识心去认知，祂自己不能认知自己，自己不能证得自己，即使祂能认知自己证得自己，妄心还是不知道，无明仍然存在，生死业障就不能了尽。所有的修行以及认知，大多数都以意识心为主，没有意识心，众生什么也不能分别，什么也不能明了，因此意识心是一个非常重要的修行工具。</p><p>六、如来藏是一尘不染的心，尽管七个识心有贪嗔痴烦恼，造作业行之后又把业种存在如来藏里，但是如来藏本体还是不受业种的染污，永远不具有贪嗔痴烦恼性，祂无论如何也不生出贪嗔痴慢疑的烦恼，也不生出恶见邪见。然而如来藏又包容一切法，无论善法恶法无记法，祂都无所谓，都负责收存业种，并且配合七个识造作各种业行。祂因为心地清净，不分别七个识心是善是恶，也不分别哪个业行是善是恶，都会配合造作。</p><p>祂是个完全不分别六尘的心，因为不分别，祂才是一个清净心。而七个识心就是对六尘的心，分别六尘万法的心，遇到六尘境界，肯定会起心动念，所以不容易把五阴六尘看空，很容易带有染污性。要去掉七识的染污性，首先就要看空六尘境界，尤其是对自己五阴更要看空，然后再破识心对自我的执著。明心或证果以后，就证得了五阴的人我空，通过修行烦恼减轻，染污性减轻。如果能很好地依止于真如，随顺于真如，那么破意根的我执也会很快，烦恼就会很快断尽，进而达到无漏。</p><p>七、在缠与出缠的如来藏</p><p>如来藏本身是清净没有染污的，因为七个识的染污种子存进如来藏里，使得如来藏的整体包含了染污业种，就好像一个华丽高档的包装盒，里面却包裹着一些污秽的东西，但是包装盒本体是光滑无垢、不受染污的，不管里面的内容物是如何的不净，污物并不影响包装盒本体，也不能染污包装盒，不能使包装盒失去其本体的整洁华贵性。如来藏也是如此，不管七识存进去多少染污的业种，如来藏本身却是不染污的，祂永远不会造作恶行，也不会起一丝贪染之念，善的心念祂都不起，更别说恶的心念，七识无论存入多少染污种子，都染污不了如来藏本体。</p><p>但是如来藏和这些染污种子合起来，却形成了不生不灭、不垢不净、有染有净的整体——阿赖耶识。虽然七识的业种不染污如来藏，但是因为有七识的染污种子存在，还是能够影响到如来藏，拖累如来藏，因为如来藏必须与七识以及业种和合在一起，如来藏不能抛弃七识而单独运作，那么如来藏必然要受到七识的拖累。由于七识的染污性，使得如来藏必须配合染污的七识造作染污的业行，不能全部造作清净业行。如来藏受到拖累的时候，就只有五遍行心所法伴随着如来藏运行，五遍行心所就跟随着如来藏而运行，没有五别境心所法和十一个善心所法。</p><p>修行修到七个识都清净时，如来藏心体里所含藏的种子就全部清净，如来藏就不再受拖累了。那么如来藏本体的所有功用和德能就会全部都发挥出来，心所法就改变了，增加到二十一个，祂就有了五别境心所法和善心所法，原来没有那么多心所法，现在就有了。原来如来藏没有胜解，现在就有胜解了，原来没有念，没有定，没有慧，到佛地时，就有念有慧有定有胜解，五别境心所法就现行出来了。</p><p>因为如来藏再也不受七识染污业种的拖累，就脱离了染污业种的缠绕，脱离了七识的无明缠缚，如来藏就叫作出缠的法身，原来是在缠法身。如来藏被七识的染污种子缠住了，就是在缠的如来藏。而出缠的如来藏就是无垢识，祂没有七识的染污种子来缠绕，祂就解脱了束缚，祂的功能德用就得到彻底的发挥，一切光明就全部展现了出来，光天照地，圆满无碍。</p><p>八、如来藏的含藏有三个方面，一个是指能藏性，能藏种子，藏身根和器世间的种子，生成万法；一个是指所藏性，是众生的业种所藏之处，包括七个识心的染污业种和善业种，还有不善不恶的无记业种；一个是执藏性，能被意根第七识执藏为我。如来藏是成佛的真体，是将来要转变为大圆镜智和真如的心体，有祂就能成佛成如来。种子有本有的七大种子和七识心造作的业种子。同样的如来藏，佛是善用妙用，众生是恶用，同样是用，众生用来贪嗔痴，佛用之利乐众生。</p><p>九、阿赖耶识就是不思议熏的结果</p><p>众生的业种熏习了如来藏，使之成为具有生灭性的阿赖耶识，生灭与不生灭和合起来，就是阿赖耶识。不思议熏，就是说的第七识，修行以后的不思议熏，一个是指熏了意根，一个是指熏了阿赖耶识，熏习成功，阿赖耶识就转成异熟识或者是无垢识。如来藏是第七识存在和运行的因，不思议熏的如来藏就是出生现识第七识的因。</p><p>分段生死，到八地菩萨为止，八地菩萨以上有变易生死。四地菩萨以上有意生身，如果初地菩萨有修四禅八定及神通的话，初地菩萨就有一百个意生身，不修就没有。二地菩萨如果修神通，就会有一千个意生身，不修就没有。三地菩萨如果修神通，就会有一万个意生身，不修就没有，但是三地菩萨必须修四禅八定，否则就不能进入四地。这个意愿有意识心的也有意根的，以意根的意愿为主，然后意识作意、触、受、想、思，想变出多少色身，就能变出多少个分身，但是分身的数量，八地菩萨以下还是有限量的。</p><p>十、阿赖耶识自性清净而有染污，这句话的正确含义是，阿赖耶识的本体是清净的，没有染污，清净与染污不能共存，二者只能有一，否则就互相矛盾，成为一个矛盾体。</p><p>阿赖耶识本体没有染污，却为什么说有染污，还不能叫作无垢识？因为阿赖耶识是含藏识，心体里保存着七识无始劫以来造业的种子。七识无始劫以来造作的业行，染污业居多，极大多数是染污业，因此业种是不清净的。因为第七识意根无始劫以来就有无明，就会不断的促使六识造作染污业行，之后把业种存入阿赖耶识中，这样阿赖耶识就含藏了无数的染污种子，成为了不垢不净的心体，因此才说祂自性清净而有染污。</p></div>"
},{
    "title": "第八章　真如无我性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　真如无我性</strong></p><p>一、真如这个概念，有两个涵义：一个涵义是指真心如来藏所具有的真实性和如如不动性，这里的真如就是指依赖如来藏而有的体性，它不是实体，是如来藏的属性和性质；另一个涵义是指真心的心体，也就是如来藏的本体，与如来藏是平行并列的概念，是如来藏的另一个别名，佛地的无垢识有时也用真如来表达，真如就代替无垢识的名称。在不同的经论里，真如有时是指心体，有时是指如来藏的性质、属性。我们要分清楚真如的两个概念，在不同的经论里分清真如这个名词是指心体本身，还是指如来藏的属性和性质，这样就能看懂经论了。</p><p>有人说真如就是佛，这个说法，是把心体和佛的意涵混淆了。真如是如来藏心体，或者是如来藏的真实性和如如性，是没有形象的，而佛往往是指有形象的有五蕴的佛，因此真如不等同于佛。佛是有形象的，有五蕴的样貌，而真如没有。真如是真心的如如性，不动性，而真心是成佛的真体，众生都有真心如来藏，将来才能成就佛道。我们称真心为佛，祂也不认可，祂也不自知是佛，因为祂没有我性，不知道自己是真实的，也不知道祂是成佛的真体。所有的名字都是我们给祂的，所有的定义都是我们给祂定的，祂无所谓，做不做佛也无所谓，祂是一个无所谓的心。</p><p>做佛的还是我们未来世成佛时的觉知心做，第六识变成妙观察智，第七识变成平等性智，前五识变成成所作智，如来藏变成大圆镜智。都变成有智之识，无明都灭掉。这样八个智识合在一起就是一尊佛，而成佛之时也不是现在的五蕴，六识也不是现在的六识。只是第七识没有改变，仍然是现在的第七识，染污无明都没有了。大圆镜智、无垢识还是现在的真心如来藏，体是原来的心体，没有改变，心体里面不再含七个识的无明，永远没有染污种子，永远不受熏不变易。佛的无垢识比众生的如来藏多了十六个心所法，就是五别境心所法：欲，胜解，念，定，慧，及十一个善心所法，这就是佛的心，常乐我净的心。</p><p>真如心体无形无相，不能以眼见、不能以耳闻、不能以鼻嗅、不能以舌尝、不能以身触，也不能以意识心臆测，但可以用意识心去明白、去了知、去证得。证得之后，用意识心观察祂的运作，了知祂的各种功能体性，了知祂含藏的种子，观察祂的清净性、无为性和有为性、相续不断灭性，这样智慧才能不断地生起，这就是后得智，即悟后所得的智慧。</p><p>真如如何清净呢？当我们眼见色时，眼识和意识同时分别色，而生心动念起觉受，贪嗔痴生起，造作业行。但真如无眼不见色，绝不起心动念，没有贪嗔痴，不起业行。我们喜欢什么，祂都不喜欢，我们厌恶什么，祂都不厌恶。却又能让我们看色，让我们喜欢和厌恶，祂对这一切都无所谓。</p><p>当我们耳听声，六根触六尘时，对六尘境界起心动念，心生染着，造作贪嗔痴业行。而祂没有六根，不对六尘，不起心动念，不染污，不造业行。对于六尘，祂无所谓；对于七个识做什么，祂无所谓，还能配合七个识，让七个识能够做想做的事。我们吃饭时挑美味，祂无口不吃；吃什么，祂无所谓，吃毒药，祂不管，吃甘露，祂也不管，但没有祂我们什么也不能吃。</p><p>我们穿衣服挑挑拣拣，祂无身不穿，穿什么祂都无所谓，还会配合我们穿。我们学善法，祂无所谓，不会觉得欢喜，完全是舍受，但是却能配合我们学佛。我们做恶事，祂无所谓，不会有厌恶的感觉，完全是舍受，而且能配合我们做。我们享受娱乐时，祂无所谓，也不享受，对于娱乐是舍受，却能配合我们享受。我们自杀时，祂无所谓，既不担心也不害怕，完全是舍受，还配合着自杀。总之，祂就是一个无所谓的舍受的心，极其清净，任何时候都清净，永远都清净。</p><p>真如的真实性，体现在真心的圆成实性上，圆成实性就是真心能够圆满成就世出世间一切法的体性。真心如来藏中有地、水、火、风、空、见、识大种性自性，如来藏依此大种性自性就能产生众生的根身器界，产生众生的五阴和宇宙器世间，产生依他起性的前六识，产生遍计执性的第七识；能够圆满实现众生的业因果报，使得众生的因果如实实现；也能够让修行的众生，所修行的善法种子，得以留存和集聚，让众生得以解脱，成就佛道。</p><p>既然三界世间万法与众生的生死轮回和解脱，都是由真如心体如来藏圆满成就的，那么真如心体就是真实有，有实体存在，有真实的作用，祂就是实相心。不是像某些人所认为的，真心只是一个名词概念，没有实体存在。很多人认为，真心既然无形无相，就是没有，他们以为相不存在，心体就不能存在，这个观念根深蒂固，最不容易扭转。</p><p>一般众生都认为，有体就等于有形有相，真心无形无相，心体就不存在。而真心无形无相的那种存在方式，智慧不足的众生无法想象出来，他们只认个有形有相的三界世间法的那种存在方式。而真心是出世间的一种存在方式，非是三界世间法的那种存在方式，只认三界世俗有法的人无法思惟和想象。</p><p>虽然真心没有三界的任何一法，但是祂也仍然存在，是实体，有其真实的作用，所以就是真实的。所有悟道明心的人都悟得了祂，知道祂在哪里，哪个是祂，如何配合五阴起利用。这就说明了真心的真实有，是真实存在的。而且佛也说过祂是成佛的真体，众生因为有祂才能成佛。</p><p>那么总结起来说，真如心体是真实有，因为祂有地水火风空识的大种性自性，有能藏性和所藏性，也能让七识去执藏祂为我。真心能够产生世间万法，祂有无量数的心体功能作用。这些功能作用都说明了真如心体的真实性，实体的存在性，这个体就是无任何三界世间相的体。祂确实不太好理解，但也要认可祂的存在，才能去参禅寻觅祂，从而能明心找到祂。</p><p>二、真如的如如性，这里的真如就是指真心的属性和性质，不是指心体如来藏。如，就是如实性、如理性、如法性、不动性；如，就是保持不动，心不动转，不随境界而起心动念，总是如一，永远是原来的状态和心境。真如有如实地呈现一切法的功德，能够依照世界所应该呈现的原貌而呈现世界，依照众生的业种而如实地呈现众生的业因果报，丝毫不错乱因果。而在如实地酬报众生的业因果报时，真如心体丝毫不随众生的业报而动转，而生心动念。</p><p>众生受到盲聋喑哑的果报或者是三恶道的痛苦时，真心丝毫不觉痛苦和无奈，祂对此无感觉，不觉知这些，祂也不会后悔和惭愧变现出这一切苦恼境界。当真心如实地酬偿众生的善业果报时，祂同样不生起快乐和欣喜之情，也不沾沾自喜地认为这一切都是我变现出来的，是我的功劳，祂不觉知这些，不享受这些境界。当众生修行获得解脱时，祂丝毫不觉得我终于得道解脱了，因为祂本来就没有系缚，也从不修行，就谈不到解脱。当众生终于成佛了，祂也不说我终于坐上了佛的宝座，因为祂不做佛，不取佛的果位，也从不当众生，但也并非不是众生不是佛，离了祂，什么都不存在。</p><p>当众生眼见色，生起喜欢和厌恶之情时，真心却不见色，因此就不会对色喜欢和厌恶；当众生耳闻悦耳的音乐而心怡流转时，耳听恶骂而怒气横生时，真心却听不见，祂不随声音而心潮起伏。当众生修定进入深定，身心轻安、内心喜悦、舒适无比时，真心依然故我，不觉知这一切，不感受这一切；当真心变现出庄严而又殊胜的诸佛国土时，祂对佛国土的美妙，依然默默无睹，内心平静，无有波澜。真心自无始劫以来，在三界世间现起任何境界的时候，从来没有喜怒哀乐过，从来没有生心动念过，因为祂从来没有觉知过这些世界，因此就没有觉受。</p><p>真心的如如性也表现在祂能够如实地呈现众生的果报，祂历来都没有私心，祂不会想到说，这个众生的五阴是我变现的，他造的恶业我就不要记录了，免得他以后受恶报；众生的恶业缘熟了，祂也不会想到说，我不要给他输出恶业种子，免得他痛苦不堪；祂也不会想到说，我不给他变造畜生身，不给他变造地狱身，不给他变造六根不具的色身，给他换个美妙的天人色身吧。真心永远不会这样想，更不会这样作。</p><p>祂一直都是如实地公正地对待业因果报，丝毫不错乱因果。众生造善，真心如实记录善业，如实显现善果；众生造恶，真心如实记录恶业，如实显现恶果。并且自心从不对善恶业加以分别和起心动念，从不对世间法产生分别和起心动念，祂永远保持自己的清净性、平等性、不动转性。以上就是真如的如如性的概略述说。</p><p>三、如如不动，是指真心，住于无所住的本位，本来就不动转的体性。真如心对于六尘万法，从来不动心念，没有念想，对于六尘境界不动转，不攀缘。因为祂没有六根和六识，所以对六尘，就没有见闻觉知，祂不随色生起喜怒哀乐，就是于色不动转。祂没有耳朵不听声，不随声音而动转，无鼻不嗅香，无舌不尝味，无身不觉触，无心不觉法尘。不随六尘转，祂对于六尘万法，对于善恶是非，对于众生五阴的业行，都是如如而不动的。</p><p>而我们的六识心，总是对六尘，了知六尘。了知就是分别，分别就是动，之后就会有身口意行的造作，这就是动转，六识必然如此。我们学佛修行，要想转变六识，六识对各种六尘境界时，尽量不生起喜怒等等的感情色彩，看淡一些，平淡一些。当六识生起定力时，粗重的分别就会减少，了别的就会少一些，轻淡一些，微细一些，动得能够平稳一些，缓慢一些。但永远不能像真如心那样不著于六尘，心念保持不动，因为六识的体性，就是要分别六尘，否则众生就没法在世间生存了。</p><p>四、六祖说何期自性本不动摇，那么如来藏自性如何出生一切法呢？如来藏永远随顺于第七识的心行，虽然随顺，也不动摇，也不生心动念。如来藏能够随缘变现一切法，而不改变自体的清净性，祂虽然对于一切法都心不动转，但是祂也要随顺于第七识，这叫作随缘不变，不变随缘。</p><p>不动摇的意思是，心不随境界动转，对任何境界心都不起念想，不起觉受，对一切法都是无动于衷。如来藏了别第七识的作意和思心所，而不起任何贪嗔痴烦恼，了别了以后就知七识的心行，知之后就会配合造作，随顺第七识来变造五阴身和三千大千世界，变造一切法。</p><p>变造时，如来藏也不动心思，没有主观性，不做主宰，不随自己的意志来变造，而是随顺业种来变造一切法。如来藏虽然永远是随顺第七识变造一切法，但是并没有来和去，于诸法中，祂不来不去，因为如来藏本自存在，无形无相，无边广大，遍一切处，遍一切时，遍一切地。因为祂遍一切法，包含一切法，所以在一切法上没有来去。有来去，则有动转，有来去，则有生灭，来了就是生，去了就是灭，如来藏不生不灭，不来不去。如来，无所从来，也无所去，如来藏即是如来之性，如来之义。如来藏显现一切法，如如不动，其心不随任何法而生起动摇性。</p><p>五、如来藏没有我相，祂不认为自己是真实的，是真我，是真心，祂没有这个观念，也没有这个知见。而我们的五蕴十八界法都是从如来藏来，由祂变生和显现，因此都是不真实的，能生能灭的，能有变化的，就是无常的。所以因缘所生的法，都是不可靠的，不自主的，是空幻的。证得这个，才能断我见，无人我，证小乘初果，去掉三缚结的束缚，不下三恶道。未来只是在人中受苦报，证得四果罗汉，命终入无余涅槃，就会暂时解脱三界生死。</p><p>六、法是世出世间存在的事物和理念，能够被七识所认知、感知、觉受、分别的对象，包括一个理体、道理、意涵。法有实法，有虚法；有真法，有假法；有缘生法，有非缘生法；有有为法，有无为法；有四大组成的物质色法；有概念理念的非四大组成的心法；有大如宇宙虚空十方无量无边的诸佛世界的法，有小到肉眼看不见的微细法；有愚痴的三恶道众生也能感知的法，也有只有佛的无边智无等等智才能了知的法。</p><p>这些法，除了诸佛的无垢识真如大圆镜智是具有真实永恒的我性的法，其余一切都是无我性的。那么对于众生来说，就是诸法都无我。我，是真实的，非缘生的，不生灭的，不变易的，不苦的，清净无垢的，不断灭的，也就是常、乐、我、净的，没有这些体性的法都是无我法。</p><p>众生的如来藏虽然是真我真心，不生不灭，但是祂还有七识的染污种子在生灭变异，所以也不完全是我。祂还是无我性的，因为祂没有对自我认知的能力，不知自己的存在，没有我见，不像意根和意识心总能够感知到自我的存在，总是我、我、我，对自我执著不舍，考虑问题首先是想到自己，我要怎样、我是如何的，下意识当中就把自己推销出去了，让他人也了知自己、重视自己、夸耀自己。</p><p>而如来藏没有私心我心，不知道有自己的存在，因此从来都不会考虑打算自己，更不会推销卖弄自己让众生了解和重视，没有与众生争过什么利益、是非、短长，这样的心就是无我性的心，祂事事不作主，完全随缘，心中不执一法。七识心与此相反，贪嗔痴慢疑邪见烦恼具足，普遍计度执著一切法，时时处处事事作主，自我性强烈。</p><p>诸法无我，包括人无我和法无我。如来藏的无我性，就是大乘所证的法无我内涵之一。人无我就是阿含经所说，阿罗汉所证的五阴十八界非我。从五阴上看，色阴，从无到有，生灭无常，非为是我；受阴，念念迁流，变化不定，非为是我；想阴，生灭无常，念念迁流，变化不定，非为是我；行阴，生住异灭，不能久住，非为是我；识阴，刹那刹那生灭变迁，生了灭，灭了生，非为是我。五阴因缘所生，非为是我。</p><p>从十八界上看，前五根从无到有，从有到灭，不可把捉，非为是我，第六根意根，识种流注，刹那生灭，阿罗汉涅槃时也能灭掉，非为是我；六识就是识阴，生灭变易，非为是我；六尘，色尘声尘香尘味尘触尘法尘，从无到有，从有到无，缘生缘灭，变化不停，非为是我。十八界法缘生缘灭，无常变易，非为是我。</p><p>这是总体来说五阴十八界的人无我。小乘的法无我，是说五蕴六入十二处十八界辗转和合而生的一切法当中无有我。如眼看色，耳听声，六根触六尘，行走坐卧，穿衣吃饭，言谈语笑，做善做恶，内心思惟，领会、分析、研究等等七个识心的活动，这一切法都非真实，缘生缘灭，无常变易，不能久住，这一切法，都没有我性，即非是我。</p><p>大乘菩萨的人无我和法无我，是从如来藏这个角度来观察五阴十八界人我的虚妄不实性，观察蕴、处、界和合衍生的一切法都是如来藏的功能作用，没有实体。除了包括前边讲的小乘的人无我和法无我之外，还包括证得如来藏的无我性，也包括七识心的能取空、所取的六尘空，就是能所都是空。五阴十八界的人空无我部分，是因为如来藏在供给五阴的种子和十八界的种子，才能维持着五阴十八界的一切活动。</p><p>如来藏的无我性，一是指如来藏里还含藏着生生灭灭的种子，种子还要变异不固定，因此如来藏不是真实不变异的，不是常恒的，那就还不是完完全全真真正正的我；不生灭变异的，才是真正的我。二是指如来藏不知道自己是真实的法，祂也没有作主宰性。第七识就是有我的，能作主宰，祂把一切法都当作我，如来藏与第七识正相反。如来藏是真我，但是这个真我，是无我性的。五阴是假我，表面却是有我性的，如来藏是真我，这是我们给祂封的，祂自己并不认为如此，也不清楚这件事。</p><p>五阴十八界辗转和合所生的一切法，也都是如来藏的执持作用而显现出来的，如果没有如来藏，也就没有这一切法，因此一切法是无我虚妄的，没有五阴自己什么事。这样证得一少部分法无我，就有道种智。入初地以后，就要证得百法当中无我，就有如镜像观的成就；入二地以后，就要证得千法无我，就有如光影观的成就；入三地以后，就会证得万法、无量法当中都无我，智慧就会越来越深。那么诸法无我，其内涵无量无边广阔，只有诸佛世尊能够完全彻底证得，成为究竟的圆满的无上智者。</p><p>在大涅槃经中，佛说佛地的无垢识，叫作常乐我净。常，就是已经究竟，再也不变异了，所含藏的种子再也没有生灭变异的现象。我，无垢识有二十一个心所法，是真真正正的我，完完全全的我，具足我性。诸佛是彻底无我的，这意思是指佛的七识心，已经达到究竟、完全彻底的无我，在此之前，还不是究竟彻底的无我，还有一部分或者是一小部分的我没有断尽，所以还不能成佛，断尽就能成佛了。识心有证自证分，有反观自己的能力，那就是有我性的，佛地的无垢识，就能自己证明自己的存在，能够反观自己，所以就有我性。</p><p>没有我，一切法中都无我，那是小乘修的法。外道的断灭空，也是说一切法都是空的，没有真实，没有我，一了百了，他们不承认有真实不灭的如来藏真我的存在，所以叫作外道。小乘声闻人，都承认有个真我如来藏存在，只是不能证得而已，外道们都不承认，所以叫作外道。</p></div>"
},{
    "title": "第九章　自在与无所住性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第九章　自在与无所住性</strong></p><p>一、如来藏如何自在呢？祂没有六根，不触六尘，因此不生起任何心行，没有贪嗔痴烦恼，也不造作业行，就不会随业行而生死流转。祂没有眼睛不看色，不被色所迷惑，对于色不颠倒，不被色所束缚，因此是自在的。面对什么好色，什么宝贝祂都不贪求，好色恶色祂都不见，不随色而动转，对于色祂是自在的。无论是称赞祂，辱骂祂都无所谓，祂无耳听不见，不起贪嗔痴烦恼，因此对于声音祂是自在的；对于色法祂是自在的，对声法祂是自在的，对于色声香味触法这六尘，祂都是自在的。因为祂无眼耳鼻舌身意，不对六尘，就不生心动念，对于六尘如如不动。</p><p>那么我们众生的七识心对于六尘自在吗？不自在，眼见色就被色束缚住了，耳听声就被声音束缚住了，鼻嗅香、舌尝味、身觉触都被束缚住了。七识心脱离不开这些色声香味触法，见色住色，听声住声，嗅香住香，尝味住味，觉触住触，知法住法。如来藏对这些法不见闻觉知，祂不沾染，不缚着，不颠倒，所以祂是自在的。</p><p>这段是讲如来藏的体性，悟后根据祂的体性，就可以转依如来藏。悟前如果知道了如来藏的这些体性，在身口意造作的当下，就想想如来藏是什么样的体性，有多么清净，那就可以让自己随学过去，对六尘境界时，也不要现起贪嗔痴烦恼，也要清净一下。这样虽然不是真正的转依，但是也有很大的作用，常常这样的熏习，心就能转变。</p><p>二、何为观自在菩萨呢？菩萨可以分为真菩萨和假菩萨两种：真菩萨是指没有生灭的如来藏心体，祂无微不至地关照着菩萨的五蕴身，从来没有停息过；另一种是有生灭性的五蕴身的菩萨。</p><p>自在也分为两种，一种是如来藏本身的自在性，祂不依靠任何法就能单独存在，什么也不需要，不生也不灭；另一种是五蕴身的自在，五蕴得解脱才能自在，不得解脱就是不自在的。</p><p>这位有五蕴身的观自在菩萨，祂的定慧非常深，能够任心自在地观察思惟甚深义理，这是自在；能够随时随地观察自己的真心体性，这是自在，前提条件是已经证悟了真心，才能作深刻细致的观察。这位菩萨能够观察自己的真心体性，如何运作，如何与五阴和合运作产生万法，也能够观察出其他六道众生的真心如何运作，如何显现的，如何配合五阴的，这是自在。</p><p>这位菩萨的心是自在的，能够不被五阴和万法所束缚，不贪染于万法，心能够离于万法，不执著万法，这是自在。这位菩萨也能够观察所有众生的真心，都是本来就存在，不是被任何一个外缘所产生出来的，是不依赖任何外缘就能单独存在的。真心就是自在的，妄心不着相、不执著时，不被万法所染，也是自在的。</p><p>达到这种自在时，菩萨的五蕴身就能在十方諸佛国土随意来去，所有的色身都能随缘变现，这是自在的，而且是无比的自在。一个大千世界能够随意变现，不用作意加行，这是多么自在啊！前提条件是必须证悟这个自在心——如来藏、阿赖耶识。这位菩萨能够显现无量神通，应以何身得度，即现何身而为说法，四圣六凡的色身随意变现，这是大自在，前提是必须行深般若波罗蜜多，证得甚深般若智，心得自在。</p><p>三、心本自有，不由他缘，祂是唯一没有任何条件就存在的法，是不需要因缘而有的不生之法，不管缘存在与否，祂永远不生不灭，因此祂就是实相心。除此之外，其他一切都是因缘所生法，只要条件具足就会出生，缘生缘灭幻化无定。既然是缘生缘灭的法，就是没有自性的法，其存在与否不由自己说了算，也不能自主。</p><p>而这个实相心是有自性的，有祂自己真实的自体性。祂也是自在的，不由他法而生，无条件的无因缘的存在，有不生不灭等等体性，什么也限制不了祂，什么也控制不了祂，本然地就存在着。所以缘起法是没有自性的，非缘起法就有自性。缘起法就是此生故彼生，这些个生都无自性，因此都不是中道。而那个不是生出来的，本来就有的，就有自性，祂就是中道法。</p><p>而世间一切万法是由实相心产生出来的，是后天出生的，那一定是先有实相心，然后才有各种法和现象。心不依靠各种现象而存在，但要找心，就得在现象上找，离开现象，离开五阴，离开十八界，就找不到心。因为这些现象的存在和运行，正说明心也存在和运行着，心若离开了，现象马上就灭，五阴马上变成尸体。所以参禅要在六尘的各种现象上参，在五阴的活动当中参，在六根触六尘时参，找这些法当中运行着的心，等到智慧满足，定力具足，时节因缘具足时，就能证得到这个实相心。</p><p>四、金刚经里的应无所住而生其心的心，是指自性清净心、真心如来藏，不是指意识心无所住地应对一切法，不是让我们把意识心修到无住，就是开悟，这种情况不属于明心证悟。明了意识心的住与不住，与如来藏的般若智慧无关。意识心只有灭掉的时候，才是无住的；意识只要存在，一定住在法尘上，否则祂就不知道法尘，也不知道自己无住，也不知道自己入定与否。如果祂知道入定，知道无住，就住在无住的这个法尘上了。</p><p>开悟是悟得自性清净心，六祖大师在听五祖讲金刚经时，也是悟得这个本来就无住的自性清净心。无所住而生其心，不是指在某个当下突然间心无住了，清静了一下，这时的心就是真心自性如来藏，这时属于开悟境界；那如果过一会儿心不清静，又有住了，开悟的境界不就消失了吗？如果说开悟是指悟得意识心的无住，那六祖就没有悟得本来就无住的自性清净心，就没有开悟。</p><p>但是六祖绝对不是悟得意识心的无住，而是悟得原本就无所住的真心自性如来藏，这个心不用你去让祂无住，祂本来就无住，从来不住在任何一个法上。所以无所住而生其心的心，就是真心如来藏。如来藏本来就无住，不是后修出来，后变成的无住。而前七识只要存在就是有住，都有对应的尘相，住在尘相上。如果七识不住尘，就不知道尘相；既然知了，就是住了。比如两手相触，如果不住，就没有触，触了就是住了。如果说是不住，那么身识和意识也不会知道手触到一起。根、尘、识三者和合触，识才知道六尘，识一定是触尘了，才能知道尘。这个知道就是分别了、了别了，那是住尘之后的结果。</p><p>五、佛也有八个识，八个识也在起作用，佛的八个识是有住还是无住？</p><p>住，是接触的意思，不住是心不在意、心不攀缘执著的意思。前七识只要存在，只要了别了六尘，肯定是与六尘相接触了，才能了别；而接触了六尘，就是住了六尘。但是有修行的人，虽然接触了六尘，了别了六尘，心也不执著攀缘六尘，并不在意六尘，这就是一般人说的不住，也是我们通过修行所要达到的目标。如来藏也有了别性，但是不了别六尘，那就是不住六尘，更是无心于六尘，不起六尘上的心念，对六尘无动于衷，是真正的无所住的心。而自心的识种子却在刹那刹那地出生着，如来藏才能不断地运行运转，这就是无所住而生其心的道理。</p><p>佛与众生都有八个识，识的功能就是分别了别。前七识了别六尘，如来藏了别的内容与前七识了别的内容不一样，如来藏了别众生的根身器界和业种，与根身器界相接触，然后就领纳了别，生起思心所，决定如何造就根身器界，如何输出业种，实现众生的因缘果报。虽说如来藏是不住于六尘不了别六尘，但祂分别根身器界及种子，如果祂不与根身器界和种子相触，就不能了别，也就不能遍照一切法，所以如来藏还是有住，只是不住六尘境界上。</p><p>佛的前七智识也和六尘接触，接触了六尘，分别了知了六尘，也是住六尘。但佛的七智识住六尘和我们现在所说的住六尘还是有极大差别的。佛的智识住六尘只是触六尘，但是心绝对不在意六尘，不把六尘当作实有的现象，不会对六尘生起一点点的贪执，心中了无痕迹。</p><p>心在意六尘，即是真正住六尘了，这是普通众生的七识心行。心不在意六尘，心于六尘就是无所住的，这是有修行的人才会如此。所以一般人所说的无住，就是指心不在意六尘。大菩萨阿罗汉和佛也不在意六尘，也可以说不住六尘，也可以说住六尘。住六尘就是触六尘的意思，不住六尘就是不在意六尘的意思。</p><p>六、平时要做到心无所住，不是六识对六尘时不分别，不分别是纯粹的修定和降伏烦恼的方法。要想与智慧相应，应该在六根触六尘时，观行六尘境界的虚幻不实性，了知六尘境界是如来藏所变现出来的影子，是如来藏镜中物，属于如来藏所有，是如来藏性，不是实有的境界。要起这样的心念，才是正念，才能与实相智慧相应，脱离境界的束缚，得心解脱。</p><p>心无所住是结果，修到最后，七识心就像如来藏一样清净，就成为无学的大乘行者。很多人学佛，越学越有所住，不仅没有减少执著和烦恼，没有减少世俗法的贪执，还增加了世俗法的系缚，增加了烦恼和执著。这就是忘失了菩提心学法的结果，学法而有严重的世俗法的所求造成的结果。</p><p>七、问：无所住六尘，不住六尘，不妨碍了别六尘，了别之后但不留痕。这可能就是最了义的对于应无所住而生其心的开示了。因为但凡六尘都是如来藏镜像，有智之人知道无法对镜像有所住，有所住也是无住。如果是明心人，可转依如来藏的不住之识性。问题是，应无所住而生其心是指悟前还是悟后？</p><p>答：应，如来藏应缘现行万法时是无所住的。七识应该也要这样面对六尘境界面对一切境界无所住。这就是应的意思。</p><p>应无所住而生其心，如果指七识无所住，是在悟后；如果指如来藏无所住，是在悟时以及悟后。找到那个本来就无所住的心，就明心证悟了，证悟以后，不断的在五阴身心的运作上，观察如来藏在出生五阴身心时的无所住性，观察如来藏出生六尘执持六尘时的无所住性，七识心才觉得这样的心才是清净的，才是佛的心，于是七识就加以对照，慢慢的受如来藏的熏染，在世间活动中，也逐渐对六尘境界无所住，心越来越清净。这样就能逐渐转依于清净的无所住的如来藏，这是真正证悟后的转依。不是解悟时再转依，转依成功才能成为证悟者，这是大误会，没有解悟以后转依才能证悟之说。</p><p>八、应无所住而生其心，有两种意思：第一种最根本的意思是我们的真如自性如来藏本性，不住一切法而不断的往外生心，这个生心的意思就是指祂能够出生万法、改变万法，这是真如本性的体性。第二种意思就是我们妄心（七识心），也要向如来藏修学，向祂一样不住一切法而能在一切法上运作，五阴身运作的时候，在世俗法和佛法上来修学的时候，也应该像如来藏一样不住于一切法。</p><p>要想让我们的妄心五阴像如来藏本性一样无所住而生其心，就应该通过熏习大乘真如本性如来藏之法，证得如来藏，以后就能逐渐观察如来藏的清净体性，我们的五阴才能慢慢的向如来藏靠拢，向祂一样做一切世俗法和出世间法，在造作有为法的时候，也不住在一切法相上，不着在一切法相上行菩萨道。</p><p>把一切法的法相都归于真如自性如来藏上，在悟前需要方方面面的熏习，在没有证得之前，那只是一种相似的安住，相似的向如来藏学习，其实没有证得的时候，你的心不可能依止于如来藏本性来造作世俗的有为法。在悟前是熏习，在悟后才能够如实的、现量的观察如来藏的运作，并且一边观察，一边向祂学习并靠拢了，心行慢慢就转变了，到最后才能够做到心无所住而生其心，生心是指七识心一生起来，就要运作三界世间法。</p><p>本心如来藏也在生心，所谓的生心是指祂要不断的出生三界的有为法，三界世间的一切法都是如来藏所生出来的，所以如来藏本性是有心行的。五遍行心所法就是如来藏的心行，祂运用五遍行心所法来广造一切的世间法相，但是祂却是不住在一切世间的法相上，这就是应无所住而生其心的意思。这里有根本义，还有世俗义，两个义都有，只说如来藏的义，世俗人无法理解，所以就要讲两种义，这样意思就完整了。</p><p>九、应无所住而生其心的心，就是真心如来藏。如来藏对于一切法，都是不住着的，因此对一切法不会起心动念。如来藏有五遍行心所法，时时刻刻都在启用着，五遍行心所法一运行，就输送七大种子和业种，出生众生五阴世间的一切法。</p><p>如来藏的生心，一方面是祂的心所法的运行，但祂却是不住六尘境界地起用心所法，因此如来藏是无所住地在生其心。另一方面，如来藏自身也有识种子在刹那刹那地流注着，才能使得如来藏运行不断。即使在无余涅槃里，如来藏自身的识种子仍然在刹那流注着，将来才能再出生阿罗汉的意根，再配合意根的运作，就会再出生阿罗汉的五阴十八界，阿罗汉又在三界世间出现了。</p></div>"
},{
    "title": "第十章　如来藏与诸法空相",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十章　如来藏与诸法空相</strong></p><p>一、心经中所说的如来藏，即是空性也是有性，既不空也不有，学习如来藏的体性，要全面的来观察其空有性，不能只看祂空的一面，不看祂有的一面；也不能只看祂有的一面，不看祂空的一面，祂是空有双具，具有双重性的。为什么是空，为什么是有，把这些弄清楚，对如来藏的体性才能有一个全面的理解和认识。</p><p>空的一面是指什么？是指如来藏本体没有任何一个世俗相的体性，世俗法这些相祂一个都没有，都不具备，祂的相是空的，所以心经说如来藏无眼耳鼻舌身意，无……甚至成佛这个法的内容都没有。因为祂是空相，一个法相也没有，所以叫作空性心，这是讲祂空的一方面体性。</p><p>祂还有不空的一方面体性，就是有性。什么是有?那就要看三界世间万法都从哪里来的，佛说三界唯心，唯如来藏这个心，一切法都是从如来藏里来的。为什么从如来藏里来？因为如来藏中蕴藏着三界万法的种子，包括本有种子和业种，有种子就能生果，世间一切法都是果，也就是妙有，那就说明如来藏有不空的一面，祂含藏万法种，所以才能出生万法。如果如来藏不含藏万法的种子，祂就不能产生万法，既然有种子，祂就不空。所以说从这两方面体性全面来讲，如来藏不仅有空的一方面，也有不空的一方面。祂既空又有，空有双具，这样就把如来藏的体性表达完整了。</p><p>心经中讲到一个诸法空相，什么叫诸法空相呢？诸法包括如来藏本身，也包括五阴十八界法，包括三界世间一切法，这些法相都是空的。意思是说，如来藏本身的相是空的，祂所产生的五阴十八界的相，三界世间的一切相也是空的。所以空相包括两方面含义，如来藏本身的相是空的，祂没有世俗法相的存在，祂所产生的三界世间相，虽然表面是有，其实质也是空的。 </p><p>为什么是空呢？因为世俗相是由如来藏变化出来的，不是真实有，其表面的功能作用，也都是如来藏赋予的。我们看见这些世间相好像是有，但是却犹如阳炎，只是恍人眼目罢了；其生住异灭，都是如来藏的作用，自体了不可得，因此都是虚相和假相，所以叫作诸法空相。因为这些法不是实有的东西，虽然有作用也是如来藏的妙用。所有的相都来自于如来藏，根本没有这些相本身的什么实质的作用，就像一个木偶人没有实质的作用一样。所以诸法空相包括如来藏本身的相，也包括如来藏所产生出来的相，这些相都是空的。</p><p>二、心经中的空，是指空性心如来藏，心经是讲不生不灭的真心如来藏的体性，不是讲一切法空的一无所有的空。一无所有的空，是小乘经典讲的内容，大乘经典都是围绕着如来藏而展开。如来藏之相为空，祂没有六根、六尘、六识等等，无形无相，祂本身的相是空无的。虽然祂无相，但是祂能出生一切相，祂产生色法，色法由祂而生，那么色法就是如来藏的一部分，与如来藏的关系就是不一不异。从这个角度说，就是色不异空，空不异色。</p><p>这个空性心如来藏，是离色之外的实有之体，色不实有，由祂而生；祂是实相，是真实有的无相的相，因为祂是实有之心体，才能不断地出生一切法。寻觅祂，观察祂，都需用慧眼和法眼，肉眼观不见，因为肉眼只能见色，观不见无色的如来藏。如果肉眼找不到如来藏，我们也不能说祂没有或不存在，否定祂就是断善根的一阐提人。</p><p>佛法之所以让众生不惜身命无怨无悔的追求，就是因为有这个真体的存在。如果没有这个真体的存在，佛法也就与外道空法没有本质的区别，修到最后还是一无所有，修行就没有意义了。佛到这个世间来，就是来给众生开示这个心体，让众生悟入，如来藏若不真实存在，佛到世间来也没有意义了。如来藏若不真实存在，众生就不会有一世又一世的色身五蕴；如来藏若不真实有，众生造业的种子就不能存放和处理，因果也就不能实现，众生也就没有因缘果报了。佛说如来藏是实相心，实相就是真实有的相，不管众生能不能见得到，其他一切法都是虚相。如来藏就如一颗摩尼宝珠，含藏万法种子，随缘显现一切法，是世出世间最宝贵之“物”，无数祖师来到这个世间也为了祂，否则就没有什么值得大动干戈的了。</p><p>三、如果我们学习大乘般若法，修行一段时间以后，都能像观自在菩萨那样，行深般若波罗蜜多，在禅定当中进行深细思惟观行，证得了真心如来藏，那时就知道：我们的五蕴色受想行识本来就是虚幻的、无常的、不真实的、空的、无我的，都是如来藏所变幻出来的，那时就出生了般若大智慧。有了大智慧以后，慢慢就能出离生死苦海，出生大智慧时也就证得了生死也本来是空，都是依如来藏而有，是如来藏所幻现出来的，不实如空花。</p><p>而如来藏本体并没有生死，也没有苦厄，祂变现出的五蕴身有苦厄，五蕴身的苦厄也是幻化不实的，没有真正的苦厄，这时内心里就度过了苦厄。生死皆如空花，本不实有，菩萨们证知这一点以后，就不用再害怕生死，可以在生死当中来来回回，度脱无量众生，出离生死苦海。</p><p> 四、如来藏自己本身是清净没有染污的，祂没有贪嗔痴，没有无明，不对六尘境界，不分别六尘，不起心不动念，没有念想。如来藏的空性，就像心经中所说，无……无……无……，祂本身什么都没有；虽然没有，但祂却含藏万法的种子，依种子而出生一切法，心体是有，相却是空。体有就说明如来藏是真实存在的，相空说明祂是空性的，祂是空性心。而所有的妄法在相上是有，其自体性却无，没有自体性的有，这种有就是假有。</p><p>如来藏的空与世间妄法的空，体性截然不同，不可混淆，妄法无自体性，了不可得，因为妄法都没有自性，不是自在的。而如来藏在相上虽无，心体里无任何一个法相，但心体是存在的，是无形无相的那种存在方式，不是世间相那种存在方式。这就很难让人理解，所以佛法是不容易修学的，学佛时间短的人，很难理顺其中的机关奥秘，所以才有那么多人误会佛法。</p><p>把如来藏理解为本不存在，没有真实心体存在，这都是断灭空的思想观念，这是在否定实相心如来藏的本有实在性，与心经经义相违背。心经中虽然讲真心如来藏里什么都没有，无眼耳鼻舌身意，无色声香味触法，无眼识无耳识无鼻识无舌识无身识无意识，无大小乘法，无一切法，但是心体是存在的，能执藏种子，祂有真实的种种功能作用。</p><p>而有一些人认为如来藏既然什么都没有，祂就是一无所有的那种空，是不存在的那种空。但是经中也讲真心含藏万法，能产生万法，祂是相空体有的心，因为这个心体是真实存在的，祂才能出生一切法，变现一切法。有些人认为真心不是真实有，祂只是一个名词概念罢了，因为这种错误知见，他们就认为开悟是见个一无所有，对于开悟之法，理路不淸，也不知悟个什么，这是普遍存在的现象。而真心的有，祂存在的方式，不是像我们五阴十八界世间法的存在方式，祂是无形无相的那种方式存在，对于这种存在方式众生没办法理解，就认为祂不存在，所以众生对如来藏的真实存在性的知见普遍不具足，因此也就没办法悟得如来藏。</p><p>有的人讲解空性，就说一切法都是因缘所生，包括如来藏，因缘所生的法无自性，所以都是空，连如来藏本体也是空，不知道如来藏不是因缘所生法，是无因无缘存在的法；众生也不知道万法都是因缘生，因是什么，缘是什么，都是如何生出来的，从哪里生出来的，对于这些实相内容大多数人都不了知。比如说我们的六识心，是如何生出来的，有些人就认为，根与尘一接触，自然就有六识出生，六识不是从哪里出生，没有出生识的体。那这个看法错误是极严重的，否定了万法的来源之处，不知道万法出生的根源是什么，也就不知道法界的真实相是什么。</p><p>佛在楞严经中已经破斥了一切法自然而生的自然论外道法，最后总结说都是如来藏性，由如来藏所生。六根与六尘接触，是如来藏在这当中产生了六识，六识是由如来藏所出生，是从如来藏当中而来。万物都有个出处，就是真心如来藏。一切法都围绕着真心如来藏而生、住、异、灭，离开真心如来藏什么法也不存在。外道对于空的諸多理论，都是偏颇错误的。由于知见不正，导致他们修行都不能成就，最后唐捐其功，不能解脱，不能悟道，多生多世枉费心力，还仍然沉轮于生死当中，所以正知见是修行的首要关键。</p><p>五、大乘的空和有</p><p>大乘经典中都说有个有的存在，这个有就是真如如来藏，是佛法修证的根，没有这个根，就没有一切法，万法由于这个有、这个根而存在，当然这个有是极其重要的，佛经万话不离其中，根本也离不开这个有，离开这个有来谈佛法，就是外道法。内道和外道的根本区别就是这个真如的有，外道不信有真如佛性，更不能证得这个有。外道有一无所有的断灭空，一法也没有的空。佛法不这样，佛法讲世间存在的一切法都依这个真如有而存在，没有祂就没有一切。</p><p>缘觉的十二因缘法也依于这个有而有，没有真如这个有，十二因缘法也不成立，离开真如之体而说一切法是有是空都是戏论。缘觉们修行因缘法，推生死的源头，推到真如如来藏，就推不过去了，齐识而还，不能过彼，就知道没有一个法能离开如来藏而能出生和存在，哪个法也不能越过如来藏，于是得出一个结论，识缘名色捐，名色缘识。</p><p>那就是说五阴身的生死是由如来藏而有，如来藏产生名色五阴，名色五阴缘于如来藏而有。身从无相中受生，就是从无相的如来藏中生，不是从一无所有中来，不是没有处所就能来，这当中就有生命的源头如来藏，抛开这个，别谈受生，不会有生命的出生。十二因缘法，无明缘行，意思是没有无明，就不会有身口意行，但是无论是无明还是身口意行，如果没有真如如来藏，也是不存在的，离开如来藏没有无明，也没有众生，更不会有众生的身口意行。</p><p>声闻的四圣谛法也依于真如这个有而存在，否则也是戏论。苦集灭道，依如来藏而有苦，依如来藏而召集苦，依如来藏而修道，依如来藏而灭苦。阿罗汉们能够证果，并且敢于灭掉自己，就是因为信受佛说有一个生死依，死后不是全部灭去，还有不灭的自己存在，涅槃以后不是断灭，这样才能证果，涅槃时才能灭自我。世尊在世时，如果有人说断灭法，说涅槃后一无所有，世尊就会叫来那个人，当面指责纠正他，让他信受身中有不灭的生死依如来藏。</p><p>现世的学佛人对于真如之理，多数没有明了，没有弄懂。没有明了时，对于真如的空与不空部分，总是含糊不清，对于空相和空性，也是含糊不清，这些理搞不清楚，不可能证得真如。没有证得的人，因为不知真如到底是什么，是怎样的无相，没办法弄懂这些理，就认为真如的无相就是无。</p><p>能够把真如之理讲清楚，讲深细一些，讲祂的不空部分，产生万法部分，储存种子部分，是大智慧的成就。如果把真如如来藏的存在说成是假有，就否定了真如的存在，就是断灭空论，假设的法不能有真实的功德和利用，而真如确实含藏无量之多的种子，具有无量之多的功德，因此才说祂真实不虚。了知真如如来藏的功德种子，就是道种智，开悟以后是逐渐地在了知如来藏中的种子功能，这样智慧才能逐渐增长，如来藏中的种子功能都了知了，就是佛所证得的一切种智。</p><p>真如如来藏所产生的一切法、一切相都是梦幻泡影，而真如不是梦幻泡影，是真实有，不知此理，永远不能证真如，不能悟道。真实有的法才能证得，探求祂才有意义，一无所有的法探求到最后也是空，就像芭蕉一样，剥它的皮，到最后一无所有，那就什么也得不到，也没有意义。而真如不是芭蕉，探求祂，会有无量的智慧生起，终究能成就佛道。否则一路空下去，就是外道的空，到头来一无所获，即使阿罗汉的那种离生正性的空，佛也不让八地之前的菩萨去实证，把一切法都灭掉，菩萨应该走自利利人的菩萨道，不能一味的追求空。菩萨们的修行都依于真如而修，证真如之后依止于真如，修证自己，最终成佛。总起来说，佛法世俗法都依真如而有，真如理甚深极甚深，难于了知。</p><p>六、性空与空性的区别</p><p>性空是指万法的属性及其本体性、自体性是空的，万法没有自己能够独立存在的体性，不能自我主宰，都是被如来藏所变生出来的，因此万法都不是真实的有，是虚妄性的。既然万法的体不是真实的有，那么其性质就是空。就像一个被幻化出的幻人，如果说它有真实的属于自己的本性，那是不可能的，它所有的行住坐卧、言谈语笑的功能作用都不是真实有，假人本身即是幻化出来的，何况其作用、体性、功能，更是幻化不实的。</p><p>万法也就如幻化的幻人一样，都是空。凡是被生出来的，被变出来的，都是不真实没有自体性的。比如说机器人是被制造出来的，是假人，但是机器人的活动也是幻化出来的，不是机器人本身所起的自主活动，是被操控出来的活动。所以万法之性是空的，名为性空。而如来藏的所有的功能体性都是真实存在的，不是虚妄假有的，万法才能由此而生。</p><p>缘起法就是各种缘所聚合起来的组合起来的现象，都没有自性，不是真实的法，因为这些现象本身不能决定自己的存在与否，如果不能自己决定自己的存在，不能主宰自己，那就是没有自性的。缘起法都是在讲虚妄法，没有谈到如来藏的真实性如如性，因此与大乘实相法有本质的区别。但是虚妄法也是依如来藏才有的，离开如来藏，就不会有任何一个虚妄法的产生和存在，因此缘起的法是性空的，没有自身的真实性。而如来藏之性却不空，如来藏有自己的真实性，有自己的有为性和无为性，不依赖他法和他缘能独立存在，叫作空性心。</p><p>七、真空绝相的意思是，真正的空性心如来藏，祂没有一切世间法相，无五阴、无十八界、无四圣谛、无十二因缘、无菩萨六度、无智也无得，凡是相，阿赖耶识都不具备，所以说祂是一个空相心体，是空性心。虽然祂空相绝相，但是心体却存在，不生不灭，既含藏万法种子，又能产生万法，所以祂有真实的功能作用，具有不空的一面。如果我们都能像观自在菩萨那样，行深般若波罗蜜多，进行深细思惟观行，就能证得真心如来藏。</p><p>证悟如来藏时也就证得了五蕴本来是空的、虚幻的、无我的、无常的、不真实的，都是如来藏所变现出来的，本质都是如来藏性。这样般若大智慧立时就显发出来，有了大智慧以后，慢慢就能出离生死苦海。而我们的真心如来藏，祂没有生死，也没有苦，不在苦厄中，五阴的我们依着真心如来藏就能慢慢度过生死苦厄。因为生死皆如空花，本不实有，菩萨们证知这一点以后，就不用再害怕生死了，就可以在生死当中来来回回度脱无量众生，出离苦海。</p><p>八、五蕴为什么皆空</p><p>观自在菩萨行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄，菩萨们在行甚深的般若波罗蜜多，证得了本心如来藏时，观行到五蕴是被如来藏幻化出来的，像木偶人一样的不真实，五蕴功能作用就像木偶人演戏一样的虚幻，表面的现象是有，但是没有实质，不真实，不自在，不能自主。五蕴不能说没有，也不能说不存在，但是这种存在是虚幻的，没有实质的，是不自在的，也没有自主性，因此是空的。</p><p>又比如低血压的人头晕时，眼冒金花，眼前都是花点，这些花点不能说没有，但是这种有是虚幻不实的，完全是一种幻相，你就不用对花点生起恐惧和厌恶，也不用起心把这些花点赶跑，五蕴就像这些花点一样的虚幻不实。这些道理要想真正的明白证得，就得行深般若波罗蜜多，进行深细的观行、思惟、参究，而后才能悟道。一切相虽然是有，有是假有，是虚幻，是幻化，不自在的，所以五蕴非我，是空的。而般若之体，不是幻化的，虽然祂无相，但确实是实相，是真实有的相。</p><p>般若智慧的观行，要在菩萨六度修到第六度的时候才能有观行智，有观行智时才能观行成功。证得了这个本来自在的心以后就会发现，这个心是无所得的心，对于世间一切法祂什么也不得，因为祂什么都有，都具足，丝毫不缺少什么。这个心，我们把祂叫作佛也行，叫作什么都行，不叫作什么也行，祂都无所谓。祂是一个无所谓的心，怎么都行，有什么没什么都行，怎么对待祂都行，认识不认识祂，祂都无所谓，因为祂自在。</p><p>观行的时候，一旦观行到如来藏在五蕴上的运作，就现前了知如来藏出生了五蕴，没有如来藏就没有五蕴，五蕴由如来藏而来，当下就能认可五蕴的虚妄，五蕴非我，五蕴无常，五蕴本来就是空的，从前不知道这个真理。我们的五蕴本来就是空的，只因无明，不知此理，通过深入观行甚深的般若波罗蜜，就证知了这个真理。当我们行深般若波罗蜜多证得真心如来藏时，就知道一切法都是如来藏所生，原材料都来自于如来藏，五蕴也是如来藏所生，苦厄也是如来藏所显现，一切法全体都是如来藏，没有真实的五蕴，没有真实的苦厄。如来藏没有一切苦，祂一出现苦厄全部消除，苦厄都是如来藏。所以观自在菩萨行深般若波罗密多时，照见五蕴皆空，才能够度一切苦厄。我们也要这样观行，打破五蕴的尘劳烦恼。</p><p>九、当体即空，体就是人事物理；即空，是指人事物理存在的每个当下，都是空的不真实的。我们所看到的好像是有，好像是现前存在着的，但都是一种假相，是空的，都是如来藏幻化出来的。因为不能识破这些假相。我们就只认自己所见到的外相为实，不能觉悟到这些现象背后的实质是什么，也不知道这些现象是如何出现的，因为什么而出现。就好像孩子们只认舞台上的木偶人，以及木偶人演出的戏剧，觉知不到木偶人演戏的虚幻性。</p><p>同理，世间的一切法，大大小小的现象，有形无形的事理，其背后都有一个在掌控着的主体心存在，只有这个心是真实的，其他一切都是祂所幻化的，所以世间一切现象就是空的，当体即空。世间一切法都包含在五阴十八界之中，五阴是如来藏所幻化的，六根是如来藏所幻化的，六尘是如来藏所幻化的，六识是如来藏所幻化的，世间没有一样不是如来藏所幻化的，没有一样是真实的，全部都是如来藏，人事物理当体就是空性心如来藏。证得这个境界时，那已经是地上菩萨的境界了，见一切法，都知道其实质是如来藏，都是如来藏在维持的，这时就真实的证得了三轮体空，无一法真实存在。</p><p>十、什么是三轮体空？三轮体空就是一切諸法当体即空的意思，其境界甚深又甚深。三轮，就是甲乙双方以及联系甲乙双方的事、理或者物。体空，就是甲乙双方以及中间的事、理、物三者之体都是空的，都是如来藏幻化出来的，没有真实之自体性。</p><p>比如布施这件事，布施者是空的，被布施者是空的，布施的财物也是空的。为什么都是空的呢？按照阿含经里佛所讲五阴无我之理来说，五阴的人我是空的、虚幻的，没有自性，按照金刚经里佛所说的无四相之理来说，我相、人相、众生相、寿者相，四相都无我，都是空的，这些相都是如来藏依缘所变现出来的，是生灭、变异、不实的；一切法也都是如来藏依缘变现出来的，是生灭、变异、不实的。</p><p>那么甲乙二者就是生灭变异的，是如来藏变现出来的产物，其性是空，幻化非真有；布施的财物，是如来藏依缘变现出来的，生灭、变异、不实，其性是空。如果刚刚有人布施我一千元钱，我随手把钱放进口袋里，然后就对布施的人说，你并没有布施我，我也没有收到你什么，我一元钱都没有见到，没有你布施这件事。那么布施的人会怎么样呢？他没有证得三轮体空的境界，内心里还在执相，没有空我，没有空人，没有空物，同时他的嗔心又比较重，心里一定很气愤。</p><p>可是证得三轮体空的菩萨，不见有五阴我，不见有对方的五阴，不见有中间的事和物，三者都空。此菩萨现见一切人、事、物、理，都是如来藏所现起的清净作用，一切的人事物理，全部是如来藏所幻化的，如阳炎、如梦、如影、如镜中像，能见的七识心，所见的人、事、物、理，全部是空性的如来藏性，没有能和所。</p><p>要想证得三轮体空的境界，就要修行菩萨的六度波罗蜜，然后通过参禅明心见性，依次证得如幻观、阳炎、如梦观，获得唯识种智时，就入初地至十地。这时菩萨内心不见有人、不见有法、不见有物、不见有事，只是随顺世俗而做名言分别。要想修到这种境界，就要努力断除我见，努力明心见性，修除财色名食睡五盖，现起初禅定，然后依次断除烦恼，就能不离定而观行一切法，不离定而证得一切法，大小乘理都要通达，就能入初地，证得三轮体空了。</p><p> 十一、空，大概有三种，一种是如来藏的空，这种空，没有形相，没有方圆和大小，但心体真实存在，体有只是相空，又称作空性心。这种存在方式，让一般人无法认知，祂不是三界有的那种存在方式，看不见、听不着、嗅不到、尝不了、触不着，就连思议也不及，极大多数人就认为如来藏只是一个名字，没有实体，不是真实的，所以也不是我。这种误会极其普遍，不可扭转，如果如来藏相空体也空，连个体也不存在，这就等于是顽空，与虚空是一样的。</p><p>如果没有如来藏心体，种子就不能安立，没有种子，就不能产生任何一法，无体就不能生法，不能生五阴，不能收存业种，也就不能实现因果律。如果无体能出生法，那么虚空也可以产生一切法，众生的业种也可以存在虚空里，让虚空实现业果，让虚空变现十方世界诸佛国土，可是很显然，虚空没有这个功能，况且虚空也是如来藏所出生，本身是不自在的。所以只要能生法，就有种子，只要有种子，就有存种子之体，如来藏之体真实不虚。</p><p>第二种空，是诸法相空，诸法都有相，相虽然有，各种现象表面是存在的，可是所有相都是幻化相，有是假有，幻化而有，从无而有，有已还灭，因缘所生，不实如芭蕉。</p><p>第三种空，就是一无所有的顽空，与有对立，是生灭法，不是真实法。虚空就是一无所有的顽空，它是比对于色法来说的，没有色的地方就是空。比如在一片土地上挖井，把土挖出去，没有土的地方就是空，这个空是一种假相，没有来处，也没有实体；如果把土填上，空就消失，消失了，也没有去处；又比如房间里有桌椅的地方就不空，搬走桌椅，就是空的。这种空满世间都是，没有边际，既然没有边际，那么在虚空中就可以随意建立諸佛国土，所有众生都成佛了，每尊佛都可以有自己的国土，不用担心没有地方建立国土。以上这三种空，众生福薄，善根不深厚时，很难分清和理解，再加上受各种邪见的误导，一旦形成邪见，很难扭转过来，修行也就很难走上正途。</p><p>十二、现在有不少人在谈空说有高谈阔论，明心开悟之后才能真正体会什么是空。在凡夫位对于一切境界都是揣摩和臆想，又因为见取见没有断，就执自己揣摩出来的知见为正确，他人的都不对，于是互相争来辩去。见取见严重的就障道，没办法断我见。</p><p>普通人所谈论的空，往往只是认为把自己的妄心空一空，在面对各种境界时要把心念掐断，有的还会靠打坐修定，求个心中无念想，以为就能空了。从来就不能体会到如来藏那种本来就有的空，别人再怎么讲如来藏的空，因为没有实际证得，还是无法理解。这种修空的方法，无论怎样修，也达不到空，就像有人成天高喊放下，修了一辈子，也没有放下什么，临终还是被业所牵，去了三恶道。修行的方法必须是按照佛所指引给我们的路线，必须按照四圣谛理四念处观，修到小乘的空，断我见，最后才能放得下，按照佛讲的大乘理，才能证得如来藏的本来就有的那个空。</p><p>这些现象只是众生修行过程当中的一个阶段，福德具足了，就会很快过去，大智慧是需要有大福德垫底的。福薄障重就没办法脱离各种错误的知见缠绕。过去有禅师要离世了，想选接班的弟子接续自己的法脉，出题考察弟子的智慧境界，弟子一说出自己的知见看法时，禅师就发话了：你福薄，接吾宗不起。意思是说，你的福薄，智慧不足，不能把我的禅宗法脉传播下去。这个福德不仅涉及到了世间法的福，更涉及到了出世间法的福，就是在戒定慧上所修的大福德。所以要想证得般若空性，必须要有福德，菩萨六度都要修好。</p><p>十三、世间一切法都与佛法有关，都是如来藏佛法生成的，是佛法的一部分。懂得了此理之后，再证得此理，就有大智慧的出生，所有一切法以后都能懂得，也能证得。</p><p>如来藏本体有什么相能被分割吗？祂无任何一种相，因此无法去分割祂一点点。我们心里应当渐渐适应如来藏的那种无相的存在方式，与如来藏相应，才能尽快证得祂，才能与佛法相应。既然一切法都与佛法有关，离开如来藏而谈任何一丝丝的现象能够单独存在，都统统是外道见，应该远离。</p><p>我们无始劫以来都是着相着得很习惯了，对于如来藏无相的相不容易体会，因而不容易证得。如来藏没有形质，因此就不能与我们的五阴和合与碰触，祂也不能有来来去去的现象，祂也不能具体在某处所，祂也没有时间相。我们不能用空间、时间、距离、来去等等这些世俗相来想象和套用祂，但有时为了描述如来藏在五蕴中所起的作用，不得不用来去等等词语，因为世俗语言确实无法描述清楚如来藏的体性和状态，借助于世俗语言有时就显得无奈。</p><p>如来藏与五阴七识、世间万法的关系是：既聚又不聚；既在一起，又不在一起；既不来某处，又不离某处；既不合，也不散。我们不能用物质色法的特性来想象思惟祂，也不能用七识妄心的体性来混淆祂。应该学会逐渐脱离我们久已熟悉的世俗法的观念来思惟祂，就能渐渐地与如来藏相应，也就容易找到祂而证得祂了。</p><p>十四、圆觉经中一切法皆为清净的真实义</p><p>佛在圆觉经中说，诸法皆为清净，为什么这样说？恶法，善法，地狱，天宫，世间一切法，都是清净的。为什么？谤佛毁法，也极为清净，谤僧毁塔寺，也极为清净；当然学佛修道，菩萨六度，就更为清净了。为什么？因为一切法皆为如来藏的妙用，当体皆空，即使不空，也是清净的。譬如人为设计程序的屠宰众生的机器，其行为无有染污，因为它无心无意造作杀业，也没有自主性，所以它并没有造作杀生业，其行为归属于程序设计，归属于设计者的旨意。证得一切法空的时候，地狱业也空，就不用下地狱了。</p><p>譬如幻师，幻作男女，这些男女，虽造诸善恶业，而无有业报。所有诸业皆为幻化故，没有实质；若有实质，皆是幻师所为。假如幻师变现出了两个人，其中一人杀了另一人，可是，无有杀者，也无有被杀者，其中杀业，也为幻化。幻化之主人，即是幻师，可是幻师不受报，实无有杀事，无有造业者，也无受报者，一切法皆为幻化，哪里有实？说有实者，迷惑颠倒。所以我们用不着在梦醒时观梦是梦，醒时也是梦，犹如梦中观梦，皆为是梦。观者也是梦，观，也是梦！一切法皆为梦。</p></div>"
},{
    "title": "第十一章　如来藏与见性",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章　如来藏与见性</strong></p><p>一、一般所说的见性，就是六祖说的见性，是见自性本心，不是眼见佛性的见性，眼见佛性是另一个层次的见性。而见就是看的功能作用，听的功能作用，嗅的功能作用，尝的功能作用，觉的功能作用，认知的功能作用。这些功能作用是生灭法，因为在很多情况下，就不能看、听、嗅、尝、觉知，这些功能作用就会消失，消失了以后，又会生起。生来灭去，灭去生来，根本把握不住，所以是虚妄的生灭法。</p><p>见性不是见得这个生灭变异法，而是在有这些功能作用的生灭法当中，有个一直都没有生灭过的本心自性，要去识得和证得，自心本性不管我们见与不见，祂都本然的那样存在着。见性者八个识共同起用，才有能见闻觉知，才能见性，之后对如来藏的功能作用，内心清楚了，能够分清真和妄，不再认假为真。见性人因为证得了自心如来，发现了自心如来，同时就懂得了自心是如何运作的，如何配合七个识心的，如何为我们生出六尘境界的，同时也知道五阴是祂所变现的，是一个虚假的壳子，不是真实的我，这样也同时断了我见，证初果。</p><p>二、关于如来藏当中的见大</p><p>在楞严经第三卷中，世尊说：见觉无知，因色空有。这句话说明，见大一生出来，就有觉性，这个觉性，没有知，不知六尘，但是能在六根上运作，这就是如来藏的见性，不是七识的见性，七识的见性一定是知六尘的。而且这个如来藏的见性，因为有明暗和虚空才能存在，离开明暗和虚空，见性就不能存在。那就说明这个见性、见觉是见大所形成的，不是像如来藏那样，没有条件就能自己单独存在的。</p><p>这个见性与如来藏非一非异，而且需要有明暗以及太虚空，才能有见性。但是见性却不是明暗和虚空，离开明暗和虚空，这个见性就不存在了，不管七识见明见暗，还是见虚空，这个见性都存在着，祂是从如来藏当中的见大种子生出来的。当明暗和虚空都消失的时候，见性也就不存在了。这种情况就是如来藏单独存在的时候，就是在无余涅槃境界当中，只有如来藏，七大种子都不现行。在涅槃境界里，没有明暗，没有虚空，因此也就没有见精见性。这说明见性是生灭的，是被如来藏用见大种子所生出来的，除了涅槃境界，其余时候，见性都一直存在，即使在中阴身里也是存在的。</p><p>而这个如来藏的见性，就是佛性。佛性不离如来藏而有，如来藏起用，就有佛性。佛性与如来藏非一非异。依如来藏而说，是不生不灭的，是本如来藏性。一切法都是如来藏性，都是如来藏用七大种子生出来的，除了如来藏本体不是生出来的，其余一切都是生出来的。所以见大，也是种子，有生成义，能生如来藏的见性，涅槃境界里，见大不起用，也没有虚空和明暗，佛性就不能显现出来。</p><p>三、如来藏性就是佛性，如来藏遍一切处，佛性就遍一切处。如来藏遍六根六尘六识，佛性也遍六根六尘六识，所以佛性能在六根上显现，在六尘上显现，在六识上显现。那么在眼根上、耳根上、鼻根上、舌根上、身根上、意根上就能有佛性的显现。我们可以通过眼根看见色尘上显现出来的佛性，通过耳根听见在声尘上显现出来的佛性，通过鼻根嗅到在香尘上显现出来的佛性，通过舌根尝到在味尘上显现出来的佛性，通过身根触到在触尘上显现出来的佛性，通过意根觉知到法尘上显现出来的佛性。</p><p>四、如来藏的见大能够见一切法，在一切法上都能显现出来，但是如来藏不能了别六尘境界具体内涵。如来藏的见大，形成了如来藏的见性，在一切法上都有如来藏的见性起用，这个见性就是佛性。没有如来藏的见，就不能有七识的见。因此如来藏能见一切法，无法而不见。</p><p>佛在临成道之前，在金刚喻定中，夜睹明星，见到自己的圆满佛性时，最后一丝微细无明全部断尽，大圆镜智现前，四智圆明，究竟成佛。见佛性有很多层次的见，智慧境界不同，所见佛性也有层次上的差别，只有佛才能圆满的见得自己以及众生的佛性。见性有十住位的见性，十行位的见性，十回向位的见性，十地的见性，等觉妙觉的见性，最后身妙觉菩萨见性以后，大圆镜智现前，才能到达佛地，圆满佛果。所以只有妙觉菩萨才能即身成佛，三藏十二部经中，佛根本没有讲过即身成佛的法，即身成佛之法与等觉菩萨以下的众生不相应。</p><p>五、佛性与如来藏的区别</p><p>佛性有两种，一种是指众生的成佛之性，一种是指如来藏能见一切法的见性。有些人总以为，只有在众生的心地清净时，佛性才能显现，而实际上不管众生的心地是多么的清静和污秽，佛性都要放光动地，照彻宇宙大千。地狱众生的心地污染极重，无明也相当深重，但是地狱众生的佛性也同样在刹那刹那显现着，丝毫没有被无明遮掩住，只是众生的七识愚痴，不能识得而已。</p><p>如来藏是成佛之体，众生成佛是因为有不生不灭的如来藏本心，有如来藏的心体，众生依之才能成佛，佛性仅仅是本体如来藏的功能之一，不代表本体。很多人都把佛性看成是如来藏本体，看成是明心时所证悟的如来藏的本体功能作用，其实不是，祂们是两种功能作用，二者运作的方式和作用都不同；但是两种功能作用紧密配合，才有三界世间的一切万法的出生。佛性的作用是佛性的作用，明心时所证的如来藏本体的功能作用，是如来藏本体的功能作用，二者不能混淆，否则就不能见佛性，不能过禅宗第二关。</p><p>众生的佛性，时时都在显现着，刹那刹那都在六根门头放射光芒，无一刹那不在起着妙用，只是众生不知不识，只知幻化的假相，不识佛性的妙用。又有很多人，分不清楚佛性和如来藏本体体性的区别，往往把二者混淆在一起。佛性和如来藏是两个概念，功能有所不同，如来藏的智慧德相是如来藏本体的功能作用，佛性是如来藏中见大种子所显现出来的作用，当然也是如来藏的功能作用之一。佛性依如来藏本体才能运作，如来藏依佛性的运作，才能出生一切法，二者互相依赖，才有三界世间一切法的出生和运行。</p><p>佛性显现运作时，如来藏才能和七识一起和合运作，变现一切法，产生一切法；因为有如来藏，才有如来藏之性，也就是佛性。如来藏和佛性是体与用的关系，如来藏还有诸多其它无量的功德作用，与佛性所起的作用也是不同的，但是两者又相辅相成，互相配合，产生万法。如果没有佛性，或者佛性不起作用了，如来藏就不能见得一切法，也就不能产生万法。比如在无余涅槃境界里，佛性就不运作了，没有佛性的运作，也就没有六根六尘六识，没有五蕴，只有如来藏单独存在，如来藏就不出生一切法了。</p><p>佛性是真实的，是如来藏本体的直接作用，时时刻刻在显现运作着。只要有佛性的作用，就有众生的五蕴，有六根六尘六识，佛性起用时，七识依之才能识得一切法，见得一切法。佛性就是如来藏的见性的作用，如来藏见一切法之后，才能出生和显现一切法，才能配合众生造作一切法；如果没有佛性的作用，如来藏就不能见得一切法，那么祂就不能造作了，众生的七识五蕴也就不能出生，所以佛性的作用非常大，如来藏也要同时依靠着佛性的运作才能有自己的运作。</p></div>"
},{
    "title": "第十二章　不二法门",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章　不二法门</strong></p><p>一、不二法门，是极深法，维摩诘经里都是在讲不二法门，修得别相智差别智后得智的大菩萨才能深知其义趣，刚开悟时还不能完全明了。如果没有悟得真心自性，只是理解，理解的东西就不可靠。对于佛法的理解，开悟以后还不能完全理解透彻，入初地通达佛法了，还是不能完全彻底证悟一切法。这就说明佛法有多么深奥广阔，不是浅慧就能够搞明白的。</p><p>众生从学佛修行到入初地，成佛之路才走完三分之一的路程。刚开悟时离初地还有三分之二的距离，智慧水平是初地菩萨的三分之一。那这个世间的学佛人，有多少是开悟的，在全球七十亿人口中，能挑出来多少，恐怕是太少了。在这极少数人中，修到初地果位，差别智后得智圆满具足的，能挑出几个？所以真理是掌握在少数人甚至极少数人的手中。那么如果地上的大菩萨来讲深奥的佛法，会有多少人能够明了和接受，恐怕是不多的。</p><p>真正的佛法也就是正法，其力量是很微弱的，其智慧境界是不与大多数人相应的。如果有地上的大菩萨来讲深奥的佛法，要受到围攻和打击，那就不奇怪了，因为智慧差别太大，初学佛之人是不会理解甚深法义的，甚至理解少分也做不到，而初学佛人又占极大多数，深法受到否定，也就难免了。</p><p>世尊在最初讲般若经时，考虑到众生接受不了深法，只讲一些粗浅的轮廓，不讲里面深细的内容。像心经金刚经都是讲个实相法的大概轮廓，具体比较细的内容还不能讲，因为众生的因缘还不够成熟，众生这时只是模模糊糊地知道一些内容，还能接受。如果世尊具体讲阿赖耶识是如何空，如何什么也没有，如何清净的，众生的智慧不具足，接受不了，就会退失信心，不信佛法了。</p><p>如果世尊在金刚经中细讲，凡所有相皆是虚妄，具体讲如何虚妄，众生智慧不足就接受不了。如果世尊细讲，一切有为法如梦幻泡影，一切法如何像梦、像幻化的一样，如何像泡影，众生智慧不够，就会满腹狐疑退去不学了。因为佛法越细致是越深奥，越不容易理解。所以刚开悟是悟得心的总相和大概内容，慢慢才会知道细相内容，具有差别智。</p><p>世尊在最后讲法时，众生的缘熟，智慧深了，信心也足够了，才讲后面的方广唯识经典，讲得很深细，当然普通凡夫还是很难懂的。更深细的佛法，世尊的报身佛在色界究竟天宫，教导初地到十地的大菩萨们来修学。而且还不是混合着讲，分别给不同层次的菩萨讲不同的法。世尊在世时讲般若经唯识经，就有很多众生当场退去不接受，不仅仅在讲法华经如此。无上法王讲法，众生都不能信受，可见众生的业障有多么地深重。</p><p>还有文殊菩萨讲法，几百个人当场退出，舍利弗就问文殊菩萨说：明知他们不能信受，为什么还要讲呢？文殊菩萨回答，虽然他们不信这个法，但也种了善根，存了种子。因为不信就是谤，他们谤法以后下地狱受苦时他们就想为什么受苦报，知道是不信佛法而谤法的结果，他们就想：大乘法这么有力量啊！不信就下地狱受报。于是内心就对大乘法生出了敬仰之情，然后就心生忏悔，忏悔以后就出地狱升天了，从天上下来后，来到人间，再接触大乘法，就会得道。</p><p>因此闻法的功德是不可思议的，种子的力量是不可思议的。所以听闻大乘法，虽然不懂，法种已经种到如来藏里了，将来这个种子就会开花结果，结个大菩提果，那真是太好了。众生闻熏佛法，都会作为种子存下来，种子越多越大，越早结果。所以应该多种种子，多种好种子和大种子，结的果就会越大越好。</p><p>二、不二法门，是指第八识如来藏法，一切法与如来藏都是不二。因为都是由如来藏所生所显，都是如来藏的一部分，归属于如来藏。就像海浪是大海的一部分，归属于大海，海浪不异于大海，与大海是不二的。一切法犹如海浪和泡沫，都归属于如来藏这个大海，都是依祂而生，依祂而灭，在祂那里生，在祂那里灭。十方诸佛国土、华藏世界、世界海，都在如来藏里建立和存在，无有一法能出于这个心体之外，这个心体才称之为一真法界。</p><p>维摩诘经里把不二法门讲得很透彻，各大菩萨都各自述说自己的不二法门，凡有言说、身口意行都是不二法门，最后维摩诘居士总说不二法门，精辟地阐述概括了不二法门。维摩诘居士的不二法门是什么呢？文殊菩萨问，维摩诘答，怎么答的呢？维摩默然无语。这一默然，把不二法门完完全全表露无余，于是文殊菩萨大加赞叹说：此乃真入不二法门。这个默然真好，把如来藏的身影全部显示出来了，但是一般人也真难意会。言说和身口意行能够显示如来藏心体，但毕竟不是如来藏本身，因为指头毕竟不是真月。</p><p>维摩这个默然是不是如来藏？是指头还是月亮？我不说，说出来的也不是真月。到底如何是好，怎样把如来藏请出来？不见有人有这个本事，无论我们怎样做，弄出来的都是祂的影子，真人不现形，真龙不出洞，肉眼是不能饱这个眼福了。任何人都只能把指头指一指，竖一竖，让人知道月亮在哪里，至于真月，他是拿不出来的。同理，任何人也只能表达描述一下如来藏，至于如来藏本体，他是绝不可能拿出来的。如来藏怎么拿呢？一个看不见、听不见、嗅不着、尝不到、触不着的，不是东西的东西，你要怎么办呢？还是修般若慧，用大智慧识得祂吧！</p><p>三、色空不二，也是不二法门，这里的空是指如来藏这种空性心，色是如来藏所生，与如来藏是不二的关系，但也不是一，二者是不一不异的关系。不异是说，色是如来藏所生所显，也是如来藏的一部分，是如来藏性；不一，二者不能互相代替，如来藏没有色的作用，色没有如来藏的作用。因为色是生灭虚幻无常的，而如来藏不生不灭，没有任何色相，常住不变，真实不虚，二者的体性截然不同。色灭而如来藏不灭，色生而如来藏不生，色永远不能代替如来藏，永远不能有如来藏的功能作用。</p><p>四、不二法门，一切色都是佛色，一切声都是佛声，一切香都是佛香，一切味都是佛味，一切触都是佛触，一切法都是佛法。这里所说的佛和佛法就是指如来藏、阿赖耶识、第八识、真如之法。所有一切法都是佛法，与真如如来藏不二，所以叫作一真法界，都是一个真实的法界——如来藏。没有一法能够出如来藏之外，包括华藏世界、世界海，都在一真法界里，一真法界即是如来藏真如心体。五阴与如来藏不二，由如来藏所生，是如来藏的一部分。</p><p>但五阴与如来藏也非一，二者不是混在一起不分的一体。如果是一体不分，那么拿刀把五阴色身一片一片地切开，就能找到如来藏，如果是一体不可分，五阴灭，如来藏也灭。现见不如是，所以五阴与如来藏还是分开的，各有各的体性，不是混合在一起，五阴是五阴，如来藏是如来藏，一个生灭，一个不生灭。但五阴与如来藏也不是完全的二个法，五阴依如来藏而生而有活动作用，是如来藏的一部分功能，如来藏依五阴而显现，二者又不能离开，就像十二因缘法中所谓的识缘名色，名色缘识，因此五阴与如来藏即是不二。</p><p>一切身口意行即是如来藏所行，十二处每一处，即是如来藏所现，十八界每一界即是如来藏所生。虽然一切法都是如来藏所生所显所变，但是与第八识还是不一不异的关系，互不相在的关系。阿含经中佛说，五阴非我，不异我，不相在。就是说五阴与如来藏不是一体，也不是二体，也不是互相混合在一起。既然不是一，各有各的用，假的灭了，真的就不灭。如果是一，一个灭，两个都灭。二者并不混合在一起，因为假的灭，真的就不灭，所以还是分真分假。</p><p>五、五阴是假，但也不能否定有其作用，假有假的作用。众生就是活在五阴的假相里，吃饭穿衣，行走坐卧，学佛修行，这些都是假相，没有这些假相，世界也不成立。哪个假相都不能去掉，否则就像阿罗汉一样取涅槃，灭掉五阴一切相，那样就不能成佛了。成佛以后，也是有假相，要用假相，佛用来度众生的方法、手段，身口意行都是生灭法，都是假相，因此假相的用处也很大。理虽如此，真正懂得，必是证悟以后，才知道为什么是这样。要证悟，就要把妄法和真法都弄清楚，证得妄法如何妄，真法如何真，才是知其然，也知其所以然的真正证悟者，知其所以然是非常重要的。</p><p>真是指不生不灭的真实心，妄是指生灭的妄心七识。不二的意思是说，妄心与真心是不二的，妄心是真心所出生，是真心的一部分。如果是两个妄法，不能是不二的，两个妄法就是二。而一真一妄，就是不二，比如说手来自于身体，手与身体就是不二的，不能说离开身体，会有手单独存在；比如金戒指是黄金所打造出来的，金戒指与黄金，就是不二的；比如泥人来自于泥，泥人与泥就是不二的；比如布娃娃来自于布，布娃娃与布就是不二的；比如机器人来自于铁，机器人与铁就是不二的。</p><p>比如雪人来自于白雪，雪人与白雪就是不二的；比如天上的猫狗是白云所变，猫狗与白云就是不二的；比如白面作成的馒头，馒头与白面就是不二的；比如塑料制成的塑料花，塑料花与塑料就是不二的；比如波浪和海水，波浪是海水所生，是海水的一部分，与海水就是不二的；金戒指完全可以当作黄金使用，与黄金就是不二的，谁能说金戒指不是黄金呢？维摩诘经专门讲不二法门，就是说一切法与如来藏真如，就是不二的。我们要多修福德，福德具足了，就会归到正途，直线前进，学佛修行就不会绕那么多的弯路了。</p><p>六、如何理解烦恼与生死</p><p>烦恼的虚幻性，是因为烦恼是由如来藏所显现和变现出来的，其本质就是如来藏性。生死的虚幻性，是因为生死是由如来藏所幻化和显现出来的，因此生死的本质就是如来藏性。涅槃是指如来藏的不生不灭、不来不去的性质，依如来藏而显现出来其性质，因此本质也是如来藏性，没有实质法。如果说涅槃心，就是指如来藏本体，那就是真实有；而涅槃就是如来藏的寂灭境界，是如来藏的无觉无知无受的寂静境界，没有喧闹的境界。</p><p>我们可以观行，如来藏就像是泥，一切法都是泥做成的，泥是真实有，而泥制品的实质就是泥。涅槃之体就是如来藏，如来藏真实有，不是强名为有。如果没有泥，就不会有泥人、泥娃娃、泥房子；没有金属，也就没有机器人；没有黄金，也就没有金器。有真实的法才能变现，没有真实的法，都是虚幻的假名，没有实体就没有办法变现。万法都是唯心造，这个心如果不是真实存在的，就不会变造一切法出来，没有根就不会有枝叶花朵，没有根就不会有芽和苗。泥人全部都是泥，但是泥人与泥各有不同的功能作用，金器虽然全部都是黄金，但是金器与黄金还是各有不同的利用，二者是不一不异的关系。</p><p>七、生死即涅槃，生死与涅槃不二。这与色不异空、空不异色的道理是一样的，与五蕴皆空的道理也是一样的。五蕴即生死，但是五蕴都是如来藏所生所变现，都是如来藏的功能作用，其实是没有真实的五蕴，全体都是如来藏。生死的生，是如来藏所生，因如来藏而有；死，依如来藏而有死，死的整个过程，都是如来藏的作用，没有生出五蕴身，也就没有死，所以生死就是如来藏性。而如来藏也叫作涅槃心，因此有人就说生死即涅槃。这个问题很难理解，需明心开悟以后，入初地前后，才能彻底明白。</p><p>悟分很多个层次，有禅宗一二三关的悟，还有唯识种智上的悟；而能悟到识心的运作上，悟到识种子上，所悟很深很究竟，非久修的大菩萨而不能也。所有的生和死的这些现象，都是如来藏所变现出来的幻相罢了，没有实质的生和死，本质都是如来藏。我们只见生死，不见如来藏，就被生死所迷惑了。</p><p>八、烦恼即菩提，烦恼整个生起的过程，都是如来藏的功用，烦恼是如来藏用种子形成的，烦恼全体也就是如来藏创造出来的，根据意根的烦恼心行而造就的，本质都是如来藏。就像用泥捏成一条毒蛇，毒蛇全部是泥的属性，二者不一不异。因此说烦恼的相貌都是如来藏，是如来藏的属性，是如来藏的性质。</p><p>九、相如的含义</p><p>相如的意思是说，这个相是真如变现的，有真如的一部分属性和体性，从相上就应该知道有真如，相是真如所幻化出来的，见相就应该见到真如。比如孩子是他母亲生的，见到孩子，就应该联想到他的母亲，孩子与母亲是不一不异的关系，相与真如也是不一不异的关系。不一，就是说一切法的相，不完全是真如，不异是说一切法相与真如有联系，有关联，是真如的一部分。</p><p>如果是一，法相灭了，真如也灭，真如能产生一切法相，那么法相也能代替真如产生一切法，现实却不是这样。法相如果与真如是异，那么法相就不是来自于真如，没有真如的执持，法相就灭，就不能存在。真如无形无相，一切法都是有相的，二者有不同之处，有很大区别，真如的体性，虚妄的法相代替不了。一切法相与真如都是不一不异的关系，一与异两方面都有，所以不能强调一个方面，忽视和否定另一个方面。一切法相与真如有一的方面，也有异的方面，既是一，也是异，应该合起来说，才是正确的。</p><p>十、妄心与真心是不一不异的关系，不是完全一的关系，二者不是一，却又有联系之处。有如头与身体、泥与泥人的关系、黄金与金银首饰的关系一样。真妄在理上是不异的关系，妄是由真变现出来的，理上是真，但是相上还是有妄，这个妄是不容忽视的，有其相应的作用。比如说七识是妄，是如来藏出生的，与如来藏不异，但也不是一；如果把七识当作如来藏，那么大家都不用参禅以求证得如来藏，直接把七个识当作如来藏就算证悟了。事实上，这是不对的。</p><p>因为如果眼识就是如来藏的话，证得眼识容易极了，证得眼识就等于证得如来藏，就明心开悟了；也不用学般若唯识经典，因为眼识就是如来藏，弄明白眼识就弄明白如来藏了，那么只要能听明白人类的语言，告诉大家五识在哪里，如何起作用，大家就都成为明心见性的菩萨，众生也就不用学佛了。并且如来藏本身是解脱的，如来藏与眼识是一，眼识就是如来藏，眼识、七识就都是解脱的，那根本就不用学佛修行。事实上，却不是这样，真实的关系是眼识等七识与如来藏是不一不异的关系，不是完全的一和等同。</p><p>如果如来藏与七识是一，那么众生在死亡时，在昏迷时，在睡着时，如来藏就能代替七识见闻觉知，代替七识有五阴活动；若如此，众生就大可以放心死去，放心昏迷去，放心睡觉，不用惦记着醒过来，不用想投胎，如来藏完全可以代替自己生存。无余涅槃里只有如来藏，如果如来藏与七识是一，那么无余涅槃里如来藏就能代替七识见闻觉知；如果无余涅槃里有见闻觉知，那么涅槃就不是寂静的了，这就违背了佛说的三法印涅槃寂静之理。</p><p>比如金盆与黄金不一不异，实质虽然都是黄金，但是相上和用上还是有区别。当需要盆子的时候，黄金使不上力，没有用，必须用金盆，这时黄金是代替不了金盆的。再比如用泥土做成陶瓷以后，陶瓷与泥土就是不一不异的关系，实质相同，相和作用不同。如果是一，再想做泥房子，陶瓷就使不上力，必须用泥土，二者不能互相代替。如果众生需要工艺品，必须买陶瓷，用陶瓷，不能买泥土，用泥土。可见，一切妄法与真法不是完全一的关系 而是不一不异的关系，既相同，又有不同，各有各的功能作用，不能互相代替。</p></div>"
},{
    "title": "第十三章　三能变识",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章　三能变识</strong></p><p>一、前七识是见分，是能见六尘的识心，是能见；相分是六尘，色声香味触法，是能见的相，也是所见。第七识是意根，是我执识，祂执著五阴为我或我所有的，执著十八界是我或我所有的，执著前六识的见分是我或我所有的，执著如来藏的作用是我或我所有的。祂见什么就执著什么，是普遍计着执著的识，简称遍计所执识。前六识是依他起性，依六根触六尘而起，依如来藏而生起，起了以后就要分别六尘。</p><p>意根就执著能够分别的六识心为我或我所有的功能，执著六尘为我或我所有的相。当意根不执著不在意时，虽然六根六尘相接触，也不产生识心，就没有识心去分别；或者识心分别非常轻微，只是知道就完了，不往下进行。这就是无心的境界，看像没看见一样，听像没听见一样，嗅像没嗅着一样，对六尘没什么感觉，比如食不知味时，心思不在所接触的事物上。</p><p>意根对六尘境界具体了别的智慧比较低劣，分别性弱，主要靠前六识去分别，然后把结果再报告给祂，祂根据六识分别的结果来采取对策和行动。祂要想做什么，要让前六识去做，自己什么也做不了，像个老总一样指挥，发布命令，前六识就得去执行。</p><p>而如来藏就像总裁，监视着前七识的一切心行和活动，七个识的种子都从祂那里出来，六尘的种子都从祂那里出来，一切的善恶业种都从祂那里出来。祂就像一个大仓库，存储着众生应该用的一切，也存储着众生成佛的种子，所以叫如来藏。这是个总名称，从凡夫到佛地都可以用，又根据众生修行的不同层次阶段，分别取不同的名称，但都是一个心体。</p><p>如来藏的性质是圆成实性，祂能够圆满成就一切法，身口意行的一切都靠祂来成就，五阴的一切活动靠祂来成就，一切的因缘果报靠祂成就，世界的安立靠祂成就。所谓的圆满，就是祂从来不违背因果，如实履行因果法则，不错乱成就一个法。</p><p>祂实现因果时，不受指挥和限制，自己也没有主张和意志，不作主宰，是完全随缘的心。众生没有成佛时的如来藏里都有无明，有染污，这个无明染污都是七个识的业种，如来藏本身没有无明和染污。七识无明灭尽，都转成智识了以后，如来藏就可以称作无垢识、大圆镜智、真如和白净识。</p><p>二、万法唯识，不仅指唯第八识如来藏，也包括前六识和第七识，这三种能变识，共同和合变现三界世间一切法。但是一切法的来源却是如来藏，只有如来藏含藏万法种子，以这些种子来产生万法，需要有第二能变识第七识的配合，也需要有第三能变识六识的配合，如来藏才能产生一切法。如果只有如来藏，前七识不参与，如来藏单独不能变造什么法，就像在无余涅槃境界里一样。</p><p>如果只有六七识，那就更不能造作什么法，因为没有如来藏，七识也就不能存在，更不能有什么利用。八个识在一起和合运作，才能成就一切法。如来藏与七个识的体性截然不同，祂们之间不能互相转变。七个识永远是生灭性的，如来藏永远不生灭，无论七个识是染是净，如来藏、真如、第八识、无垢识、大圆镜智永远是一个心体，本身并没有染污性。</p><p>三、唯识之理，以三能变识来体现。比如用意念给人治病，意念以意根的强力攀缘作用为主，不管对方距离有多远，只要有对方的影像，意念力都可以达到。因为意根和如来藏不受束缚，天南地北、其它星体都可到达，甚至地狱鬼道都可以接触到，没有阻碍。</p><p>意念时，意根缘于对方的影像以及病变部位，意识心就开始观想，观想病气排除，身体如何发生变化。定力越深，意识心越专注，意根只缘这一件事，不及其它。到一定时候，身体病变部位，就会发生变化，身体就恢复如初。胆结石可以立即消散，癌细胞慢慢消灭，疼痛感也就能消失。这当中如来藏随顺于意根，按照意根的意愿，根据意识心的观想，配合两个识改变病体，恢复原状。</p><p>意识观想到什么程度，如来藏就改变到什么程度。病变是四大元素不协调的缘故，身体出现异常，如来藏有四大种子，可以让病变部位的四大协调起来，或者改变四大比例，这样身体状态就正常了。三个能变识和合一起，改变身体状况。这需要意根强烈的意念力，意识心强烈的专注力，那么如来藏就可以改变一切。包括改变他人的心理认知和思想，让他人随顺自己的意志。这得需要较高的专注力，意根和意识都有相当好的心力，意识还要有较强的观行力。</p><p>四、八个兄弟一个胎，一个伶俐一个呆，五个门前做买卖，一个家中把帐开。</p><p>第一句话是说八个识和合在一起运作，组成了众生的五阴，众生就有了五阴身的运行。而八个识中，如来藏是呆，因为心经中说，如来藏无眼耳鼻舌身意，无色声香味触法，无眼识界、无耳识界、无鼻识界、无舌识界、无身识界、无意识界，因此如来藏不知道色声香味触法这些六尘境界，对于六尘境界祂傻傻的，不知好恶是非，不知冷暖香臭。</p><p>伶俐的是意根，祂什么法都能攀缘过去，没有一样不知道的，虽然只是知道个大概，不知细节。祂从无始劫以来一直存在，没有灭过，过去生的习性一直带着，过去生的所有事情都能攀缘，天上地下无不知，无不能到，祂能发动如来藏的执受作用，而无事不知。</p><p>意根是遍计所执性，没有一法不执著的，执六个识的功能为我，执如来藏的功能为我，执五阴为我，执十八界为我。意根的执著性灭尽了，就是没有执著的意根，没有无明的意根。就像我们如果断我见，成为四果人了，就没有对自我的执著了，但是五阴还在，只是内心不认五阴为真实的我了。执著性是无明，无明灭了，就是明，佛的意根彻底灭了无明。</p><p>在门前做买卖的是五识，通过眼耳鼻舌身这五根，不断摄取色声香味触这五尘，把五尘都收到家里来，收进来以后，意根执取，如来藏就收藏。算账的是意识，祂能够对一切事情进行计划、打算、分析、判断、推理、思惟，算计来算计去，权衡利弊，回顾过去又能展望未来，制订出很多目标和宏伟蓝图。</p><p>五、一切唯心造，意思是说一切法都是如来藏这个心产生出来的，包括众生的五阴十八界、宇宙器世间、十方诸佛国土。万法唯识，是说我们所接触到的一切六尘境界，都是八个识心和合运作而展现出来的，以意识、意根、如来藏三个识为主，为能变识，变现出了一切境界。身口意中的意，是意识心，祂不能产生万法，因为自身是生灭法，又没有种子，因此不能直接生成一切法，不是唯心的心。因缘法当中的因是第八识如来藏，缘是一切的业缘，因缘产生出来的一切法毕竟空，当中还有不空的，那就是如来藏。身口意行，以意根为主导，意根降伏了，意识心不现起，身口意行都灭。意根的无明灭，也就有能力灭身口意行。</p><p>六、唯识讲三能变识，能变万法的识心主要有三个：如来藏是第一能变识，含藏着万法的种子；意根是第二能变识，有意愿、有愿行，能作主宰，能驱使如来藏去变造万法；六识是第三能变识，分析、想象、研究、观想，能够摄取六尘。这些能变识是怎样和合变生万法的呢？比如用神通变现黄金、指石为金这件事，一个人能够拥有黄金，不管是自己享用，还是利乐他人，都必须要有足够的福德，就是说他已经修出了福德，种子已经存在如来藏中了，这是先决条件。</p><p>第二，如果把如来藏中的种子拿出来，变成现行，实现果报，必须因缘具足，就是种子已经成熟了，也有可能意根这时还攀缘这个福德，或者想用自己的福德利益他人。</p><p>第三，此人的心力要足够用，意识心和意根的功能要非常强，定在一处的定力心力非常强，专注力非常强，这样心就能转物了。意根想要得到什么，变什么物，改变什么物，意识心就得去观想什么物，想要变成什么样子的，意识心就根据意根的要求，开始思惟想象，如来藏就得输送相应的识种子，输送二个识心和前五识的种子，输送物质所需的四大种子。</p><p>具体改变石头为黄金时，我们不用先学炼金术，也不用知道金子的构造和组成成分。创造物质这些事，意根和意识心都没有办法办到，因为这两个识心里没有四大种子，就不能变造物质。变造物质是由如来藏来做的，因为祂有四大种子，能够组成物质，物质就是由四大种子形成的。意根和意识心所要作的，就是先修出来福德，把福德种子存在如来藏里，然后再修出定力，忆念专注。</p><p>具体把物体转化，是如来藏所作的事，祂要把原有物质的四大种子的比例结构变化一下，物质里面的空间大小要发生变化，也就是物质密度要发生改变，物质的分子结构要改变，原子、电子颗粒的结合状态需要改变，这些细微改变都是如来藏的事，因为如来藏会随时随地改变输出的四大种子的比例结构，也要加上一个空大的种子数量的改变，这些事，六七二识使不上力，五识更是使不上力。</p><p>如来藏最柔顺最听话，意根指哪祂就打哪，完全配合。但前提条件是，必须把所需的相应种子存到如来藏里，种子必须种到八识田地里，种子现行的缘还要具足，然后如来藏才能奉献果实。就像巧妇不为无米之炊，没有米就不能下锅做饭一样。如来藏也是，只要有福德的种子，因缘具足，祂就能变，就能创造，就能出生万物。没有福德，因缘不具足，祂是丝毫没有办法的。就像有人总是梦想升官发财，因为没有把福德种子存在如来藏里，那他怎么妄想也没有用，那就是做白日梦。</p><p>七、心如工画师，能画諸世间，五蕴悉从生，无法而不造。这是华严经中的觉林菩萨偈。意思是说众生的真心如来藏，就像一个工画师，能画五蕴世间，没有一法是祂不能造的，没有一法不是祂造的，五蕴就是祂造出来的，是祂画出来的。那么祂是怎样画五蕴的呢？</p><p>五蕴是从入胎开始，直到出生，再到死亡这段时间的色身和七识。在中阴身时，由于意根执著一定要有一个色身，就带着如来藏去投胎。两个识就住胎了，这样就成为了名色，色就是胚胎，名是第七识意根。</p><p>如来藏根据意根对于胚胎的攀缘，开始造胚胎，就像绘画师一样开始绘画了。因为如来藏有五遍行心所法，就是触、作意、受、想、思五个心所法，祂首先要触众生的业种，然后作意，把注意力引到业种上来，领受这是什么业种，是人的还是畜生的还是其他众生的，这是受；领受以后，就知道了是什么业种，这是想；最后是思，祂就把业种忆持在心，生起决定心，确定下来，开始输送种子变造。</p><p>然后又去触母体中的血液，作意，把心引到血液物质上来；再触血液，领受血液中的地大成分、水大成分、火大成分、风大成分；然后是想，了别知道了各种成分；思，就开始吸收四大营养元素，决定变造胚胎，并且把四大元素输送到胚胎中。对于造胚胎，如来藏也是用心所法，祂兼顾着业种、四大元素和胚胎三者，开始变造，五个心所法一直不断地在运行着。就是说祂很忙，但是又没有忙的心，祂运作有序，有条不紊，祂对于这些事都很内行，而且是祂主要的工作内容。</p><p>人的胚胎在如来藏的运作下，七天一变，其实是时刻都在变，七天是一个明显的改变阶段，每个七天，分别有不同的名字来命名这个胎儿。如来藏在造胚胎时，不断地了别业种，吸收母体中的四大物质，变头时，触胚胎，把注意力引到胚胎头部这儿来，领受胚胎，了别胚胎，思惟如何变造，决定变造，输送四大，开始变造。因为时刻在了别业种，祂就知道变什么样的头，人的头，是大还是小，还是形体残缺，畜生的头，哪种畜生，哪种形状。造四肢时也是，知道是什么样的四肢，有残疾无残疾。</p><p>开始造眼睛时，知道是什么样的眼睛，大小、形状、颜色、位置，有无残缺。造耳朵时，知道是什么样的耳朵，大小、形状、位置、颜色，如果有业障，应该得没有耳朵的果报，如来藏只造耳蜗，不造耳形，其它器官也是这样。而且每个器官的位置、大小、形状、颜色，有毛无毛，祂都知道，变造时，丝毫不违背业种。造人形还是畜生形，是男是女，祂都清楚。五根不具，残缺不全的业种，祂都清楚。如果母体营养不全，祂吸收的就不全，输送出来就不全，胎儿的色身就不圆满，这就是胎儿的业报。</p><p>如果胎儿受母体挤压，如来藏就不能正常变造，胎儿就是畸形，这也是胎儿的业报。胎儿四五个月时，如来藏知道胚胎可以用了，就出生意识心，胎儿就能了别母体中的生存环境，这时就有了胎动。随后其它几个识心也产生出来。这时就可以进行胎教了，胎儿有耳识和意识，就能够了别胎教的内容。人的胎和其他众生的胎什么时候成熟、出生，如来藏都知道，那时就会吹业风，胎儿就出生了。</p><p>出生以后，婴儿通过饮食，如来藏就吸收饮食中的四大元素，来变造婴儿的身体，还是根据婴儿的业种。婴儿一天天地长大，头发长，指甲生，肌肉、骨骼、内脏器官的完善，四肢的发达，这些都与如来藏吸收的饮食当中的营养有关，也和众生的业种有关，也和外界的生存环境有关。因为这一切都在变动不停，那么五蕴的色身也就在变化不停，每一个变化，都是如来藏来促成的。以上是如来藏在色身色蕴上的变造。</p><p>在识蕴上的变造，如来藏出生了六个识，依意根攀缘，六根触六尘，在内六入胜义根处，输送识种，产生六识。六识各自了别六尘境界，意根攀缘不断，如来藏输送识种就不断，六识的了别就不断，这是六个识的识蕴功能。受蕴，就是领受、领纳、感受，六根触六尘以后，六个识领受六尘，然后感受六尘。前五识的感受粗重、粗略，第六识的感受细微、深刻，尤其是情感、情绪上的感受。这些都是如来藏输送识种产生的功能作用。</p><p>想蕴，最初是了别、知道，然后是分析、思惟、判断、推理、计划、打算，以意识心为主，意识比较细致、深刻，前五识比较粗略，这些都是如来藏输送识种产生的功能作用。行蕴，就是行为造作、活动、变化，时间的迁流，地点的改变，包括身行，身体四肢的运动，五根的动，包括呼吸、血液流动、脉跳、消化排泄等等；口行，言语的行为造作；意行，识心的了别分析思惟判断推理等等的行为造作。这些都是如来藏输送七大种产生的功能作用。</p><p>八、问：六祖说不是风幡动，是心动，真的是心动导致风幡动的吗？</p><p>答：三界唯心，万法唯识，心外无法，离开本心，无有一法存在。柳树不能自己摇动，风不能自己吹，万物生长不是靠太阳，风幡动也是如此，风幡不能自己动。没有真心，就没有风幡以及风幡的动；没有意识心，也无人知风幡动。风幡动是众生的业力导致的，业力与意根相应，如来藏随顺意根的业力，风幡就动起来了，但是还得有六识的出生，才能知风幡动，没有六识，风幡无论怎样的动，也与自己无关。</p><p>自己心里的风幡动，是三个能变识共同和合变造出来的，即如来藏、第七识和六识共同和合所现起的一种影像。但是外界的风幡动，一个人的心是没有能力掌控的。风幡动，是意识心出生起分别以后才能了知的一种现象，不管意识本身分别与不分别，风幡就是要动的。</p><p>地球是动还是静止，也不管意识心分别与不分别，即使众生死了，地球照样还是转动着，不管众生分别不分别。因为动静相不是由意识心产生的，是由共业众生的如来藏共同和合产生出来的，意识分别也好，不分别也罢，宇宙器世间照样存在动静和明暗种种现象，不管众生是活着还是死亡，是昏迷还是睡着，只要意识心存在，就有这些现象出现。</p><p>九、若能转物即同如来，有两层意思。一方面意思是只有如来才能彻底转物而不被物转。因为如来修到佛地，断尽一切无明，所有功德圆满具足，能一念之间变现无量无边之多的五蕴色身，也能一念间变现无数三千大千世界，所有物质色法都随如来而转变。所以能究竟转物的人与佛齐，就是如来。</p><p>另一方面意思是只有如来藏才能转变物质色法，不被物质色法而转。因为如来藏是三能变识中最强大的一个，含藏一切物质色法的种子，能随意根之意输出四大种子，而变现转变一切物质色法，七识妄心没有种子，不能出生和转变物质色法，但能调动如来藏变现和转变物质色法。所以如来藏是一切物质色法的主人，一切物质色法归如来藏所有。</p><p>十、既然一切法都由如来藏所出生，为什么还说三能变识共同变现万法？世间一切万法虽然是由如来藏变现出来的，但是单独一个如来藏不根据外缘无法变生一切法，如来藏必须依赖相应的缘才能产生一切法，孤因不生法。</p><p>唯识讲三能变识，如来藏是第一能变识，意根是第二能变识，前六识是第三能变识。如来藏与第七识和合变生根身器界，再与六识和合，才能产生一切法。如果前六识不参与变现，很多法就不能现行出来。六识所有的运行活动都作为种子存入如来藏里，如来藏依据这些种子，才能产生万法，没有这些业种，如来藏也就不能生万法了。</p><p>就像四果罗汉，他们六识的身口意行已经清静了，不愿意多造作世间有为法，三界世间的种子就不再集聚了，意根也就不执三界世间法，那么他们临终就会入无余涅槃，然后只剩下如来藏，不产生任何法。因此三界世间法的出生，一定是三个能变识共同和合产生出来的，单独如来藏不生法，不变法。我们现在的六识如果都无为了，不愿意造作身口意行，也就不会产生种子，未来世就不再出生五阴，生死链条就断。三界世间法的出现，一定是八个识共同运作的结果。</p><p>十一、唯识里讲三个能变识，第一能变识是如来藏，祂具有不生不灭性，是出生众生五蕴、六根、六尘和六识，出生万法的直接根源。</p><p>第二能变识是意根，祂是时时处处做主宰的识心，身口意行的一切造作都由祂来决定，而祂总是依赖着如来藏而向外攀缘一切法，祂攀缘什么法，如来藏就随顺着变现什么法，所以意根也能间接的使得如来藏出生一切法。</p><p>第三能变识是六识，以意识为主，意识是最主要的分别识，多数时候与前五识一起分别，有时自己也单独分别，内心里知道了就是分别完成了，六识能配合意根和如来藏共同显现出六尘境界，六识也能影响意根的抉择，意根有时要依赖六识的了别，而攀缘六尘万法，然后作主决定造作身口意行，如来藏就要配合意根出生万法。因此如来藏、意根和六识三者和合运作，就能变生万法，这就是出生万法的三能变识。</p><p>十二、前六识如果想了别六尘，多数时候是受意根支配和指挥的，由于意根的攀缘作意，如来藏就要随顺着出生六识，出生六识以后，六识就想要了别六尘，于是就触六尘，触之后就起了别作用，业行就造作出来了。意根总是攀缘作意三界世间法，寻求三界世间法，但能不能攀缘和寻求得到，也在于业缘是否成熟，如来藏里是否有业种。如果有业种，而且业缘也成熟了，如来藏才能随顺配合着出生意根所作意的法；如果没有业种，或者业缘还不成熟，那么如来藏就配合不了，不能满足意根所愿，现起祂所攀缘的法。</p><p>如来藏只是按照因缘，按照业种，变现出万法，让六识来分别和取舍，但是如来藏要为六识输送识种子，六识才能现行出来起用。所有一切法都是如来藏随顺因缘和业种而变现出来的，意根的攀缘和作意在因缘条件允许的情况下，如来藏都会随顺，没有选择，没有条件，也不求回报。而意根的作意和攀缘，也在于六识的了别情况如何，有时意根也要根据六识的了别，来作取舍，作抉择，如来藏再依据意根的作意出生相应的法。</p><p>如来藏出生万法，不是七识控制的，而是如来藏本身的柔顺性、随顺性、不作主性决定的，这是如来藏的运行规律之一。证悟后可以通过各种方法观察如来藏的随顺性，看看祂是否很柔顺，是否完全配合；观察后发现果然是如此，不管你做什么，祂全部都是随顺配合，一点也不违拗七个识，当然有很多事情还是实现不了的，因缘不具足，如来藏也就没办法实现意根的愿望。所以有人说：如来藏是贴体的衣服，随身又适意。</p><p>十三、如来藏究竟是如何改变物质色法的四大结构，又依据什么来改变的呢？</p><p>如来藏改变四大元素的结构、比例成分，是依据众生的业种和业缘。因为如来藏要刹那刹那输出四大种子，祂要改变四大结构，只要每一刹那输出的四大种子的成分稍微有所不同，多少个刹那之后，物质就会发生变化，非常快，有的物质改变就要慢一些，这也决定于业种和业缘。</p><p>比如这一刹那输出的四大元素的比例为，地：水：火：风=40:30:20:10，那么下一个刹那就可以改变为：41:30:19:10，再下一个刹那可能就改变为：42:30:18:10，再下一个刹那，还会一点点的改变，四大种子的排序状态也要发生变化，那么到一定时候，物质就有明显的变化了。物质世界的成住坏空，就是这个原理，众生色身的变化也是这个原理。</p><p>而器世间里的一切物质色法，它们的改变就要慢一些，甚至要极慢，这一方面是因为器世间里的物质太庞大了，改变的不可能明显，众生觉察不出来；另一方面也涉及到了所有众生的业种，需要所有众生的如来藏共同密切配合，才能完成，所以宇宙器世间的改变要非常的缓慢。比如家里的桌椅板凳，书籍纸张，是在一点点地发生改变，就是如来藏的功能作用。我们的衣服，一天天地变旧，一天天地磨损，并不是衣服本身就能有这样的作用，都是如来藏依我们的业缘，把衣服变旧，最后毁坏，不存在了。没有如来藏心之外的物质作用，心外无法，就是这个道理。</p><p>一弹指间，有81000个刹那，这其中要有多少个种子生灭变异过去了，物质的最初变化，我们实在没法察觉，只有变化集聚到一定程度，我们才能了知到。所以三界世间里所有物质的生、住、异、灭，没有一样能离开如来藏，而能有其单独作用的，都是如来藏所为所执持，在其中所起的作用，所以三千大千世界也叫作一真法界。</p><p>十四、唯心所现，唯识所变，这里的心和识有什么异同？心指第八识如来藏，识指八个识。一切法产生的根本来源、直接来源是如来藏，叫作三界唯心。而我们所接触的一切法的现起，需要一定的助缘，如来藏才能出生万法，单独一个如来藏不能出生一切法。因此万法是如来藏第七识前六识三者和合变现出来的。第一能变识是如来藏，第二能变识是第七识，第三能变识是前六识，这叫作万法唯识。</p><p>十五、众生之间的互动关系是如何实现的</p><p>现在的互联网电脑能在自己的电脑上控制别人的电脑，通过在自己的电脑上操纵别人的电脑程序，帮助别人把电脑修好了，再者我们通过互联网可以在自己的电脑上访问别人的网站。通过观想治病的道理也如远程控制修理电脑一样，如来藏之间也是互遍互摄互知的，否则因果就无法实现，众生之间就不能互动了。比如一个人病了，有个修行人就在自己的住处通过观想这个人的病变部位恢复健康，然后这个人病就好了。</p><p>色身是各自的如来藏执持着的，但通过观想，他人能把他的色身改变了；改变色身的是自己的如来藏，不是别人的如来藏。但是自己的如来藏能与他人的如来藏互通，能受到他人如来藏的影响。如来藏可以随顺自己的意根，意根又能受到意识的思惟观想的影响；而如来藏之间互相又能沟通和影响，那么众生之间就能互相沟通、互相影响，就能互动，就像互联网电脑之间的关系一样。</p><p>因此，一个众生就能利益和损害另一个众生，改变另一个众生的色身。甲的一切事情，都是甲的如来藏作用的，但是乙影响了甲，甲的如来藏就受乙的影响了，实际上是如来藏之间的影响力。医生给病人治病，也是这个道理，心想事成，也是这个道理，成事坏事都靠如来藏，由三个能变识共同变现而成就。</p><p>十六、世出世间谁最忙碌</p><p>世出世间一切法都是如来藏所变现和执持的，一切法上都有如来藏的参与，如来藏遍一切法，遍一切蕴处界，遍一切时地，世出世间最忙碌的当然是如来藏。但祂从不觉得忙碌，因为祂无为性的、程序化的、法尔如是的运作方式，对一切法都是一种舍心，不觉苦也不觉乐，对一切法都没有感觉，没有觉受，完全无心，因此祂从来不觉劳累。</p><p>在世间法里，其次忙碌的是第七识，第七识依如来藏能缘如来藏变起的一切法，默容一切法，那么在一切法上都有第七识的运作。第七识虽然能对一切法起遍计所执性，普遍计度执著一切法，但是第七识也从来不觉忙碌和劳累，否则祂也就休息了。祂休息时，如来藏就无法运作，万法就休废，这种情况从来没有出现过。阿罗汉和辟支佛们的第七识除外，他们的第七识已经厌倦了三界世间法，不再顾恋和贪执世间法，因而就选择入灭，五阴消失，万法休废。所以第七识在睡着和死亡、昏迷、入定时，都在忙碌着，第七识和第六识比较，还是第七识最忙碌。</p><p>虽然第七识在世间法上很忙碌，从来不休息，但是如来藏忙碌的事情，有很多第七识参与不了。比如说，如来藏参与变现三界世间法，变现宇宙器世间，第七识只起个推动作用，具体如何输送四大种子，如何变现身根器界，第七识既不知也不懂，也不能参与变现；如来藏了别业种，输送业种，第七识也参与不了；如来藏输送七大种子，第七识既无觉知，也参与不了。所以如来藏是最最忙碌的，只是不累，没有感觉，也没付出什么代价，也不知道自己究竟作出了多少贡献。其实第七识也从来不知道忙碌，也不觉得疲累，否则祂就能少执著一些法，而选择休息灭去。但是第七识能知道六识的疲劳和身体的疲劳，把身体和六识当作自己，才决定让身体和六识休息。</p><p>再其次忙碌的是意识，但是第六识断灭的时候比较多，很多法的运行上都没有第六识。第六识只是在六尘中的法尘上运行，独头意识不仅独自忙碌法尘独影境，五俱意识还要与五识一起忙碌，还要负责给第七识传递情报，当助手和参谋。就像在部队里，参谋忙着搜集情报，分析军情和敌我态势，最后将所有搜集和分析的情报呈递给首长，由首长决定这个仗打不打，如何打。参谋相当于意识，意根相当于首长。当然，首长也在这过程中忙碌指挥，只是忙的形式不一样。具体收集情报的是五识，它们相当于勤务员勤务兵，负责站岗放哨，搞侦查，第六识负责分析和综合，给首长提供适当的建议。因为六识做的工作比较具体，因此能感觉苦乐和疲劳，需要不时的休息休息。但是如来藏永远也不休息，无论遇到什么情况，即使第七识选择放弃三界世间，如来藏也不随之而灭。</p><p>十七、现在佛教界内流行一种观点说，要活在当下，把握当下。可是我们真的能接触到当下吗？我们所见的色、听到的声音、嗅到的气味、尝到的味尘、觉到的触尘、了知的法尘，没有一个是当下的现量，都是已经过去了的影子。犹如看电视一样，我们看到的都是一格一格的胶片经过快速播放，所产生的一系列的动感的图片，这些图片是刹那生灭的，单个图片本身也是静止的，因为连续播放的太快，形成的图像好像是连续的，里面的人事物好像是连续地活动着，表面看来好像都是真实的，其实都是影子，而且是影子的影子。</p><p>我们六根所对，六识所见，都是过去了的影子，没有当下，更没有真实。虽然说五识分别的是现量境，但是五识所分别的绝非是真正的现量境，也是过去了的生灭了的影子，幻化的，既非真实，也非当下。五根接触到的也如是，绝非是真正的现量境，色声香味触五种信息达到五根，已经是生灭过无数次的四大微粒，根本不是微粒的原貌，不是最初发生和出现的色声香味触，这些微粒仍然不是最真实的。</p><p>比如声音从出发点，经过传播渠道的传播，能量逐步递减，传播到耳根时，其振幅和能量已经变弱了，期间经过的距离越远，到耳根时的能量越微弱，再经过耳神经的传导，到后脑胜义根处，四大微粒有可能又改变了，形成的声音就不是原本的声音，也不是声音的当下了，其它几根也如是。</p><p>因此我们所要把握的当下，都是过去时的当下，对于现在来说，都已经发生完了，而且正说个当下时，即已过去，每个当下，念念都不停留，像流水一样，一去不复返。我们在每个当下所做的事，只能影响到未来的走向，不能影响当下和过去。所谓的真实，所谓的当下，都是如来藏接触的，但是如来藏又不分别，不能描述出来，我们就不得而知了。既然如此，我们该如何正确对待当下的色声香味触法呢？那就不能再把这一切法当作真实了，也不要生起很强的执著性，当然能做到完全彻底不执著当然更好，那样心就解脱了。</p><p>十八、问：摄像机的摄像人是如来藏，五根是镜头，再变化成内六尘影子，内六尘是这样幻化出来的吧？</p><p>答：摄像的人，就是如来藏，六识是看像的人，只会看相片和影像，看什么和不看什么，受意根指挥。摄像头要对着什么景物拍摄，由意根说了算。如来藏通过五根或者六根把外六尘摄取过来，成了像以后，是六识来分别这些像，六识是看像的人。第七识是指挥看像的人，也是指挥摄像的人。第七识指到哪里，如来藏就得摄取哪里的六尘境界，六识就得分别哪里的六尘像。</p><p>摄像头要对着什么景物拍摄，有些时候，由意根说了算。意根选了景物以后，如来藏就会拍摄。如来藏要照出一些境界出来，有时意根也不能作主，如来藏把违缘和冤亲债主弄出来，这就不是意根的选择了，意根不会去让如来藏拍摄这个景物出来。然后第六识就会在景物上面添加一些自己的想法与概念，相当于后期制作，润色与磨皮。这个被后期处理的景物就作为种子收藏了。</p><p>所以说众生五阴活动的背后，是有主宰的。即使是机器人，也是人为地背后来操控，即使是电脑，也是人为在操作的，人为设计程序，然后通上电能，电能很重要，五根也得有电才能运行。只要能找到电能和开关，找到那个总闸和总阀门究竟在哪里，就证悟法界实相。阀门一打开，万法都会呈现出来。</p><p>十九、山河大地也是八个识一起和合运作而产生的，众生没有出生之前就有山河大地，那是共业众生的如来藏共同和合变现出来的，与六识没有关系，是如来藏依众生的共业共同变现出来的，依众生在三界中的业种化现出来的，也是意根的无明妄想促使如来藏幻化出来的。但是这些变现与六识也不是完全没关系，因为六识造作的善恶业行，存入种子，后世就有山河大地的依报出生。六识造作的善恶业大，山河大地出生之后也要发生相应的变化。</p><p>二十、唯识与唯心的区别</p><p>唯识就是唯三个能变识，是三个能变识所变现和显现。唯心就是唯如来藏真心，一切法都是如来藏真心所变造出生出来的。属于他人之识单独所变的法只有他人的色身五蕴，其余的法不是众生的识共同变现就是个人的识单独变现。而其他人单独变现的五蕴身心，我们接触到见到了，就是我们自己的识单独变现出来的法。唯识的识是指三个能变识，意思就是说凡是我们众生所能接触到的了别到的法，都是我们自己的三能变识单独变现出来的，无一例外。</p><p>对于六七识五识来说有外境，六识了知到的都是内镜。但是对于如来藏来说，哪个法能在如来藏之外呢？禅宗祖师经常说：心外无法，满目青山。意思是说，如来藏心外根本没有法，一切法比如青山之类的都是如来藏自心中物。</p></div>"
},{
    "title": "第十四章　如来藏与种子",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章　如来藏与种子</strong></p><p>一、什么是种子</p><p>种子，顾名思义，有种有子，即是能生义。譬如植物的种子，能生长植物，一切法的种子能出生一切法。种子包括七大种子和业力的种子，七大种子在业力种子成熟时，能生成众生的一切法，众生离开业力种子，七大种子就无用，如来藏在众生的业力种子成熟时，用七大种子造就众生的业果报。</p><p>二、七大种子是常住法，不生不灭，归属于如来藏，是如来藏本具的种子，如来藏就用这些种子产生一切法，七大种子归属于如来藏，本质就是如来藏。因为七大种子从来没有出生过，因此也不灭，没有任何法能够产生七大种子，只要有如来藏，就有七大种子的存在，即使在阿罗汉的无余涅槃里，七大种子也是存在如来藏里不灭。有七大种子作用之处，一定有如来藏；有如来藏之处，一定有七大种子的作用，所以七大种子四大种子都是不生不灭的。</p><p>三、如来藏里本来就含着七识的种子，这些种子输出去，了别六尘以后，再回来，把了别造作的内容一起带回来，如来藏就存档，同时就知道了七识都做了什么。如果七识造作了贪嗔痴业，回来的种子就是染污的，收存以后，再输出就是染污的种子，七识自然就带贪嗔痴性。如果七识造作的是清净的业，回来的种子就是清净的，再输出时，七识的心行就是清净的。这些种子是随我们的身口意行要不断的转换清净性和染污性，清净的多，染污的就少，染污的多，清净的就少，不可能是清净性和染污性同时增加和同时减少，二者总是一增一减的关系。</p><p>这样看来七识的种子数目是固定的，不会发生数量上的增减，否则众生善性也增加，恶性也增加；或者善业减少，恶业也减少，这是不可能的。</p><p>四、问：四大皆空与心经中的“色即是空”意思是否一样？七大地水火风空见识，是否生灭虚妄的？</p><p>答：心经中的色即是空，这个空是指空性心如来藏，世俗人讲的四大皆空，这个空是指不存在和空无、虚妄的意思。因为世间人不知道有个如来藏，也不知道如来藏又用四大种子产生和变现一切法。如果从小乘来看，四大组成的色身和器世间就是空的、虚妄的、不实在的，因此不是我，也不是我所拥有的。</p><p>如果从大乘角度来讲，四大都是如来藏里的本有种子，四大的功能就是如来藏的功能作用，所以说四大就是如来藏的一部分，与如来藏是不一不异的关系。那么四大组成的色就是如来藏的一部分，与如来藏是不一不异的关系。这样四大皆空就与心经中的色即是空，意思是一致的。</p><p>七大地水火风空见识，是如来藏里的本有种子，如来藏不生不灭，种子就是不生不灭的。即使在无余涅槃里，七大种子也是存在的，只是暂时不起作用，不再去出生万法了。再也没有生成七大种子的法了，因此七大种子也是不生不灭的。</p><p>七大所组成的众生，却是虚妄的、生灭的、变易的。五藴是由色蕴和受蕴、想蕴、行蕴和识蕴组合起来的，也是由色身和识心组合起来的。色身是地水火风空组合成的，四个藴是六识的功能作用，六识是识种子生成的。组合起来的就不是实有的，组合起来的任何事物都是后天生成的，因此必有散灭的时节，生成的当时就是虚妄的，何况散坏时。</p><p>五、种子以及数量的问题</p><p>种子就是功能、界限，是指如来藏里所具有的七大种子，能够生成众生的五蕴十八界，现起宇宙器世间。这些种子的功能差别界限全部了知，就具足了一切种智，成就圆满的佛果。所以种子的数量虽然是无量无边之多，也一定是不增不减的，数量是固定不变的，我们才能有全部了知的那一天，才有成佛的那一天。如果种子数量总是在增减变化，种子不是固定数量的无量，那么我们就永远不能把种子了知到尽头，那就不能成佛。如果种子一直在增加，我们就得一直要探究下去，不探究完，就有无明，就不能成佛。</p><p>如来藏不增不减的体性，其一是指如来藏本身的功能作用不增不减；其二是指整体如来藏的数量是不增不减的，一个如来藏对应一个众生，一个众生对应一个如来藏，所以佛说众生界不增不减。不会在法界当中增加或者减少一个众生的如来藏，即使阿罗汉入无余涅槃，如来藏也不灭，所以如来藏不会减少。如来藏更不会增加，因为如来藏是不生不灭的，没有出生祂的源头，祂先天就有，不是因缘所生法，不是后天能出生的；其三是指如来藏里含藏的七大种子不增不减，因此就能无碍地出生万法。</p><p>七大种子本身都是清净的，没有染污，而众生的业种有染污和清净两种，染污就是无明，清净就是明。明和无明两种属性能够转换，整体种子数量不增不减，种子是转换的，不是灭掉的。染污种子减少，一定增加了相应的清净种子。转烦恼为菩提，转识成智，就是这个意思，转字是关键。增长的那部分，就是减少的那部分，明增加多少，无明就减少多少。</p><p>比如认识了一个字，对于这个字的无明就减少了，同时对于这个字的明就增加。又比如不懂一个法，这是无明，懂了那个法，明就产生，无明就转换成明。对于世出世间的无明都没有了，就是全部的明，明了一切法，就圆满成佛。其后就再也没有需要探究需要去明得的法，再也没有需要转换的无明种子。从这些道理来看，种子的数量就是不增不减的。</p><p>六、地水火风四大种子是如来藏里本来具有的种子，如来藏遇缘把这些种子输送出来，就能组成众生的色身五根，也能组成众生所需要的色声香味触法，组成宇宙器世间，十方诸佛国土。那么众生的正报身和依报的生存空间环境就具足了，众生才能得以生存下来。</p><p>如来藏法尔如是地就有地水火风空见识这七大种子，如来藏输送识的种子出来，才能产生七个识，才有七个识的功能作用，那么众生的五阴就具足了，就有正常的五阴活动。四大对我们的色身是有很大作用的，能够维持我们色身生命活动的需要。如果四大比例失调，色身就会出现病苦，色身出现病苦，识心就会受到影响，心里就不安稳，就会出现苦受。我们的身心是互相依赖，互相影响的，调好身体，心得顺畅，调好心识，色身就健康长寿。</p><p>七、如来藏有地水火风四大种子，祂能够按照不同比例，分别输送四大种子，构成根身器界。地种子输出的多，所占比例大，物质就是坚硬性的；水的种子输出的多，所占的比例大，物质就是柔软的、湿性的；火的成分输送的多，物质就是有热量热度的；风的成分多，物质就是轻软的、流动性的。所以，如来藏造我们的骨骼指甲头发肌肉筋时，就把地的种子多输出一些，输出多少祂知道，我们不知道。</p><p>因为那时还没有一个所谓的我们存在，我们得靠祂来创造，那时还没有意识心被生出来，即使现在有意识，也仍然不知道此事，仍然是无知的。只有如来藏了别业种，祂才能知道这个事情。其它水火风种子输出多少，祂同样也知道，不用谁来教导和指挥，因为也没有个谁，都是祂了别业种，才知道了如何做这些事情。造我们的血液脑浆骨髓时，如来藏就把水的种子多输出一些，其它种子按不同比例输出，这些祂都知道。</p><p>什么时候造什么，祂知道；在哪个部位造什么，祂知道；造什么样子的，什么颜色的，人形的、畜生形的、非人形的，祂知道；什么时候产生识心，祂知道；什么时候胎儿圆满应该出生了，祂知道；出生以后，色身五阴的一切事，如何变化，祂都知道；怎么长大，长成什么样子的，祂都知道；什么时候该生什么病，祂知道；什么时候出现衰老相，祂知道，知道以后，就变衰老相；什么时候死亡，祂知道，于是就会变现出死亡前的征兆。</p><p>祂还知道什么时候离开色身，还知道生什么样的中阴身，还知道众生该投生到哪一道去，与什么样的父母有缘。我们不知道的事情，祂都知道；宇宙器世间如何创造，祂知道；山川河流、花草树木如何产生，祂知道；宇宙器世间什么时候毁坏，怎样毁坏，祂知道……没有一样祂不知道的。想想我们自己，究竟知道个什么，全是无明。这就是如来藏的智慧境界，祂不愚于一切法，觉知一切法，念一切法，变一切法，现一切法，祂的功能德用无量无边之多，直到成佛我们才能全部了知这些法。 </p><p>八、四大极微是否是常住法</p><p>常住法只有如来藏，物质的四大极微总是在生灭着，既然是生灭的，就不是常住不变的。组成四大极微的四大种子是属于如来藏里的本有种子，如果依附于如来藏也可以说是常住。但是四大种子在没有因缘的情况下是不能起用的，比如在无余涅槃境界，四大种子就闲置无用，不能生成任何一个法出来。如果说四大种子是生灭的，那么无余涅槃中的如来藏里四大种子就消失了，如果阿罗汉从涅槃境界里出来时，四大种子又能变出色身出来，四大种子是从哪里来的？如果说四大种子是常存在如来藏里的，那么四大种子就是不生灭的常住法。</p><p>如来藏是无形无相的，如来藏里的四大种子或者是七大种子也是无形无相的，这些种子是常存在如来藏里的，如果不是常存，如来藏拿什么法再生种子？如来藏可以拿四大七大种子出生一切法，如果没有这些种子，如来藏就没有办法出生任何法，根本没有什么法或者种子再出生这些种子了。</p><p>九、种子的定义</p><p>种子有出生、现行义，就比如是花草树木的种子，有这些种子，才能生根发芽，生长出花草树木。种子是形成一切万法的根，或者叫作因，或者叫作元素，分为本有种子和造业的种子。种子是无形无相的，无形无相的法才能存在无形无相的如来藏里，自体无相的如来藏不能存有形有相的法。如来藏遇缘依据业种，就能输出种子，以此出生万物万法、三界世间。</p><p>十、六界地水火风空识，是与如来藏同时存在，还是先有如来藏，后生出六界？</p><p>六大种子或者七大种子，是如来藏本具的种子，不是后天出生的，有如来藏就有七大种子，在因缘条件具足时，如来藏输出这些种子，就产生众生的五阴十八界世间。如来藏是无时无刻不存在的，众生的业种成熟时，祂先输出地水火风空五大种子，形成众生即将要来生存的宇宙器世间，生存环境造就好以后，再输出地水火风空大种子，造就众生的色身，然后再输出意识心的种子，产生众生的意识心，再输出五识的种子，产生前五识，这样众生的七识五阴就具足了，众生就能出胎，就能有五阴世间的生活。如来藏的这一切活动，意根都参与，也是如来藏随顺意根变造出来的。</p><p>十一、问：有人说地水火风空见识，只有地水火风四大是大种子，其它三个空见识，既不大，也不普遍，不是种子，是这样吗？</p><p>答：种子有出生义转变义，比如花种子能出生鲜花变成鲜花，树种子能生成大树变成大树，如来藏中的七大种子都能转变成某种法，继而能起某种功用，因此都是种子，都大，而且普遍存在。地水火风空，能和合出生宇宙器世间，遍于三界。有色之处就是地水火风四大种子形成的，而无色之处就是空大种子形成的。物质色法当中也有空大，否则物质就没有空隙、没有密度之说了，物质内部也就没有其它物质的流动和传输了。</p><p>没有物质之处即为虚空，虚空也是后天出生之法，有楞严经为证。楞严经原文：<strong>虚空生汝心内，如片云点泰清里</strong>。世尊在这里明确说明虚空也是从如来藏本心当中出生的，只是无色而已，与物质色法不同，是没有质碍的色法。弥勒菩萨也在瑜伽师地论第一卷中说，空和明暗色与眼根相对，是眼识所见，因此空属于色法的另一种。眼识望出去，就能看见物质的色彩和空间，因此空是由如来藏中的空大种子生成，空大种子不是一个无用的摆设丝毫不起作用，也不仅仅是一个无意义的名词。佛立一个空大，一定有其真实而实际的功能作用。佛说一个空大，就有空大的作用，空大若无作用，物质色法当中就没有空隙，物质也就没有密度和硬度之说，物质色法也就没有生成的处所，世界就不能安立了。</p><p>父子合集经中，世尊说过六界：地水火风空识界，在其它经典中，也说过六界。六大就是六界，界是种子的功能界限，空大就是种子，有其功能界限，与四大五大种子的功能作用不同，空大生出的虚空与物质有质碍的色法有所不同，也与识大种子生出的七识有所不同。可见空大确实有其自己单独的作用，否则十方世界就无法安立了。</p><p>同理，如来藏中的识大种子，也是种子，有生成义，识大种子输送出来，就形成五识、六识和七识，七个识才有其功用，才有其分别作用。七个识由识种子而来，就好比花从花种子而来，树从树种子而来一样。再说如来藏中的见大种子，也是种子，有生成义，见大种子输送出来，如来藏本体就有见性，能见一切法，因此如来藏就能运行一切法，出生一切法，圆成世间一切法。比如众生依眼识见色，然后才能做世间一切事务，如来藏也要依自己的见性而运行一切法，而见大种子输送出来，如来藏才能有见性。因此，如来藏中的七大种子，都有生成义，都是种子，都有其功用，种子不是无用的摆设和名言施设。</p><p>而七大种子普遍存在，遍周法界，有经文为证。</p><p>楞严经第三卷原文：<strong>若此虚空性圆周遍，本不动摇，当知现前地水火风，均名五大，性真圆融，皆如来藏本无生灭……如来藏中性觉真空，性空真觉，清静本然，周遍法界。</strong></p><p>世尊在这里已经明白开示，空是空大，而且是周遍法界的。虚空遍十方界，也是如来藏性，无生无灭，虚空包含在如来藏中，不出如来藏之外，它是如来藏当中的空大所生所显，虚空没有地水火风四大，不是四大生成，是空大所生成的。</p><p>楞严经第三卷原文：<strong>若见闻觉知，性圆周遍，本不动摇，当知无边不动虚空，并其动摇地水火风，均名六大，性真圆融，皆如来藏，本无生灭。……如来藏中性见觉明，觉精明见，清静本然，周遍法界，随众生心，应所知量。如一见根，见周法界，听嗅尝触，觉触觉知，妙德莹然，遍周法界，圆满十虚，宁有方所。</strong></p><p>世尊在这里也明白开示众生，见也是大种子，而且是周遍法界，圆满十虚，以此见大出生见根，依此见根，七识才能有见闻觉知性。</p><p>楞严经原文：<strong>若此识心本无所从，当知了别见闻觉知，圆满湛然，性非从所，兼彼虚空地水火风，均名七大，性真圆融，皆如来藏，本无生灭。……如来藏中性识明知，觉明真识，妙觉湛然，遍周法界，含吐十虚，宁有方所。</strong></p><p>这里世尊也非常明确地开示，识是大种子，能生成六识和七识，具有了知了别性，也是遍周法界，圆满十方。</p><p>总结：七大种子平行并列，共同生成众生的五阴十八界，宇宙器世间，遍周法界，圆满湛然，遍十方界，都是循业发现。</p><p>十二、每个物质色法，都是由四大种子组成。即使是土地，也是四大种子形成的，水也是四大种子形成，火也是四大种子形成，风也是四大种子形成。所以物质色法有多种作用，不仅仅有一种作用。水不仅仅有湿润性，有淹没性，还有力度，还有温度，还有动性；风，不仅仅有飘荡性，还有力度和温度，还有硬性，吹到身上会感觉疼痛；火，不仅仅有温度和燃烧性，还有力度，有飘动性，还有湿润性；地，不仅仅有坚硬性，还有湿润性和温度，也有动性。</p><p>十三、如来藏当中的空大</p><p>世尊在楞严经第三卷中开示我们：如来藏中，性觉真空，性空真觉，清静本然，周遍法界。意思是说，虚空性就是如来藏性，空大与如来藏不一不异，空大遍十方法界，空大能生成虚空。经中言：虚空生汝心内，如片云点泰清里。这里的心指如来藏心，虚空是在如来藏心里出生的，而且在如来藏里只占一点点的位置，就像云彩在虚空当中所占的比例一样。</p><p>众生生存的世界里，虚空从哪里来的？物质当中的空隙从哪里来的？居住环境的空间从哪里来的？细胞当中的空隙、身体当中的空隙都是从哪里来的？虚空和各种空间都有什么作用？这些空不管广狭，都是从无到有，都是生灭性的。既然是生灭性的，就有出生这些空的种子，空才能出生。万法都由如来藏出生，空也是万法之一，也是如来藏所生，而且如来藏只能用空大种子来出生虚空。</p><p>如来藏出生的空，有外界的虚空和空间，也有身体内的空隙和空间。因为外界有空间，才能容纳一切色法，物质才能运行，声音、气体和味尘才能传播，各种能量才能传递，众生才能在虚空当中生存。外界的虚空是所有众生的如来藏共同输出空大种子所形成的，是所有众生的如来藏所共同执持的。虚空起着绝对重要的作用，十方世界都在虚空当中建立和存在，星体在虚空当中运行，众生在虚空当中行走坐卧，进行各种生存活动，各种物体在虚空当中存在和运行。</p><p>各种物质当中也有空隙和空间，其空隙多少的不同，就造成物质不同的结构，密度就不同，物质的性质就不同。物质当中的空间也是由共业众生的所有如来藏共同形成和执持的。物质的密度就是物质当中的空的成分。空的比例成分不同，物质结构就不同，物质的物理属性就不同。如果物质的地水火风的成分是一样多的，空大的比例不同，物质的体积就不同，密度就不同。</p><p>又比如压缩饼干，有别于普通饼干，是因为普通饼干经过压缩，饼干里的空间减少，而且水分挤出去了，饼干里的地大成分所占的比例成分就多，饼干的密度就大，吃起来就容易饱，不容易饿。如果物质膨胀，空的成分增加，体积变大，密度就小，物质的性用就发生改变。所以空大在物质当中也起着非常重要的作用。</p><p>空间不一样，物质运动产生的能量就不一样。比如跳高和跳远，其中助跑的距离空间长短不同，过长或者过短，其弹跳力就小，空间距离合适，助跑的势力就大，能量就大，其弹跳力就大，就是能量大，跳的就远就高。又比如往墙壁上抛石头，与墙壁的距离空间不同，其石头落在墙壁的力度就不同，也就是势力和能量就不同，墙壁受损的程度就不同。所以空间、虚空是非常重要的法，生命体聚在一起生活，其空间小，活得就不自在，比如养鸡，活动空间太小，就会造成鸡生病，甚至死亡。</p><p>空，有众生的如来藏共同变造的虚空，也有众生个人的如来藏变造的空间和空隙、缝隙。身体当中的空间和空隙就是自己的如来藏单独用空大种子变造出来的，包括细胞当中的空。身体里各个组织结构当中都有空隙和空间，是众生个体的如来藏单独用空大种子生成的。因为身体当中有空间，饮食、气体和血液才能流动，众生才能呼吸，才能维持生命的存在。不仅内脏当中有空，骨鄂、肌肉、各种液体里都有空。身体当中最小的细胞组织里也有空间，细胞里的各种分子结构当中也有空隙。这样分子、离子等各种微粒才能运行，细胞才能进行新陈代谢，由于分子当中的空大成分不同，分子结构就不同，性质就不同，在身体当中所起的作用就不同。四大加上空大，组成了众生的三界世间，五大遍一切处存在。</p><p>虚空空间是色法之一，是眼识的现量分别境界，也是眼识和耳识出生的一个缘，它是生灭性的。虚空不像龟毛兔角一样是想象出来的子虚乌有的，子虚乌有的东西，眼识就不能见着，不能分别，那纯属是意识的非量境界。而虚空是色边色，眼识一见，马上就知道是空。因此虚空是有法，是后天生成，将来还会灭去。在无余涅槃境界里，没有任何一种空和空间，更没有虚空。因此虚空和空间是如来藏用空大种子生成的，空大种子就有生成义。</p><p>所以七大当中的空大是种子，能生成空间、空隙和虚空，众生才能在虚空当中生存，物质才能在虚空当中运行。五阴世间离不开虚空，离不开空大，空大就有生成义。空，就是如来藏。空大遍十方界，周遍法界，是如来藏性。楞严经言：空生大觉中，如海一沤发。空生，就是虚空生出来，是大觉心所生的，就像大海当中的泡沫产生了，最后也会灭去，生灭的就是虚妄的。所以如来藏出生虚空是有作用的，没有虚空也没有一切法的存在和运行，虚空的这种作用是虚妄的用，是生灭性的。在如来藏独存的境界里，即使连一点点的缝隙都不存在，何况虚空。所以空大，是种子，有生成义，能生成各种空，都是如来藏性。</p><p>十四、业种是否必须通过七大种子才能起现行</p><p>业种成熟时，如来藏了别了以后就输送出来，让业种现行，以实现众生的业果。如来藏是如何实现业果，以什么形式实现业果的？业果无非是身心世界的状态而已，改变业果就是改变众生的身心状态以及生存环境，如来藏是通过改变众生的身心世界来实现众生业种的。</p><p>那么身心是如何变现和改变的呢？如来藏输出六大种子地水火风空识，就能变现众生的身心世界，同时有如来藏的见大种子配合，共同形成众生的身心世界。如来藏改变身心世界也是通过输送七大种子，和改变四大种子的组合结构和形态，来实现身心世界的改变。众生色身的形成和改变是通过四大种子与空大种子的出生和改变来实现的，器世间生存环境的形成和改变是通过四大种子和空大种子的出生和改变来实现的。众生在三界中的一切法，都是如来藏输出七大种子形成的，所有的业果报也是由如来藏输出七大种子显现出来的。其中物质色法是由四大种子加空大种子共同合成的，心法是由识种子形成的，如来藏的见大种子形成如来藏的见性，来配合一切法的生成和改变。</p><p>离开七大种子，就没有物质色法，也没有心法，那就没有众生的色身，没有众生的识心，也没有众生的生存环境，世界上就会一无所有，也没有世界，那就谈不上众生造业和实现果报。因此说，不管众生什么样的业果，其实现就必须由七大种子配合业种，才能让业种现行，实现业果。</p><p>十五、问：当气候即将发生大的变化的时候，很多人在身体上就会有所反映。比如如果冷空气要来了，或要下大雨了，有的人在前一两天就会有偏头痛发作；有些有风湿病的人也会因天气变化，而有关节痛的发作。一是因为器世间大的变化，导致如来藏产生的身根四大不协调，其中也有各自业种所产生的果报。二是器世间发生重大变化前，已有一部分缘显出来了，意识不能了别，但意根了别了，意根执身，而使身体产生反应。是不是这样？</p><p>答：组成宇宙器世间的元素就是如来藏里的四大种子，组成物质色法的元素也是如来藏里的四大种子，与组成色身的四大元素是一样的，因此色身肉体本质上与外界的物质色法是没有区别的，与石头木头是没有区别的。唯一的区别在于色身肉体上有单独众生的如来藏的单独执持作用，有独自运转作用；而外界物质是由共业众生的所有如来藏共同执持，其作用就有别于色身上如来藏的作用。</p><p>由众生的如来藏单独变现和执持的色身色法，属于如来藏的亲所缘缘，多个如来藏共同执持的物质色法是所有如来藏的疏所缘缘，由于亲疏不同，其作用就不同，如来藏的运行方式就不同。</p><p>如来藏亲自独自所缘的色身，如来藏一是要根据众生业种不断变化四大种子以变化色身；二是要根据色身外的生存环境和各种缘，而不断的变化四大种子，以不断变化色身；三是要依据意根的心行，不断配合意根，而变化四大种子，以变化色身的状态，有五阴的功能作用。如来藏共同缘的疏所缘缘色法宇宙器世间，只是依据共业众生的业种和业缘，而不断的变化四大，以变化物质色法，没有五阴的功能作用。</p><p>当外界宇宙器世间发生变化，众生所依赖的生存环境发生变化，物质色法就发生变化。外界的物质色法能影响色身，也就能影响识心。物质色法是如何影响到识心的？外界色法是众生的外尘，如来藏通过身根摄取外界物质上的四大微粒，从而改变自己色身的四大微粒，色身就发生改变。比如天气变凉，火大发生变化，色身通过如来藏吸收外界的火大微粒，色身的火大也就改变了，身体就变凉。天上下雨时，水大发生变化，如来藏吸收水大微粒，色身里水大增加，湿气增加，就感觉潮湿，色身原来有的疾病就要发作，如风湿和关节炎之类。</p><p>如来藏摄取各种物质上的四大微粒，是如何摄取的？比如其他众生的色身，自己的如来藏并没有参与变现，祂要如何摄取不属于自己变现的四大微粒？如来藏摄取四大微粒，不是直接从物质里夺走四大微粒，如来藏没有这种主动性，而是物质色法要刹那刹那的释放四大微粒，同时又有新的四大种子在物质上形成四大微粒。因为物质是刹那刹那生灭变异的，物质上的四大微粒就要不断的释放出来，这样如来藏才能摄取得到其他众生色身上的四大微粒，摄取外界物质上的四大微粒，形成自己的内色尘和内法尘，同时也改变自己色身的四大结构。</p><p>因为一切物质色法都要刹那刹那释放四大微粒，从而能影响周围的环境，这就是所说的磁场引力的原理。每个众生色身都有生物电的释放，都有磁场，物质色法上能量的释放，也有磁场，因此物质不同，磁场就不同，物质之间有相吸性，也有相斥性，众生之间也就有相吸和相斥性。</p><p>十六、七识是否能出生其他的法</p><p>七识是由如来藏当中的识种子生成的，是被生之法，因此就没有自在性自主性，那就不能再去出生其他的法，因为本身没有能生他法的种子，也不能存种子的缘故。只有如来藏有种子，能用种子生成五阴十八界万法；五阴十八界万法不能再去生成其他法，因为是有生灭的缘故，不自在的缘故，不含藏种子的缘故。七识是如来藏出生六尘法的助缘，与如来藏和合为三能变识，从而能变造一切法。</p><p>十七、怎样能观清八识种子如瀑流，又怎样转八识为智慧</p><p>如来藏里的七大种子，刹那刹那生灭，形成了五阴十八界和宇宙器世间的刹那刹那生灭，这些种子从来就没有停息过的不断输出，五阴世间的生灭变异也从来没有停息过；如来藏里的业力种子，也时时地没有停息地涌动出来，使得众生不断的与业力相应，不断的受业力的牵引，不断的受业力的果报。要想转识成智，首先就要明心见性，心依止真如之性，慢慢就能转变，一是烦恼渐渐的灭尽，习气也都要消融殆尽断除，二是智慧就能不断的得以增长。</p><p>十八、四大种子，是如来藏里的本有种子，和合起来能生成各种物质色法，而四大微粒是四大种子和合成的最微小的粒子，因此粒子再聚集，形成更大的颗粒，不断的聚集，就能形成一种物质色法。这些微粒凝聚时，排布的状态不同，形成的物质色法就不同，这些微粒的排布方式极其多样，因此就形成了五彩缤纷的绚丽世界，各有其用，众生各有所需。实质都是在用如来藏，而众生却不知。</p><p>众生到这个世界之前，自己的如来藏与其他众生的如来藏一起输出四大种子，参与变现宇宙器世间的外相分，然后不断的执持着外相分。如果众生缘具足的五根接触到某种外相分时，如来藏就通过前五根摄取外相分的四大微粒，传导到后脑胜义根处，变现出内相分，胜义根与内相分相触，如来藏再变现出六识，根尘识三者再相触，六识就能了别内六尘。</p><p>为什么如来藏输出四大种子就会形成物质色法呢？四大离开识心的运作，不可能自动形成物质色法，都是如来藏利用四大种子来变造色法。一切法离开如来藏刹那间就会消失灭亡，无影无踪。四大种子输送出来，形成四大，然后如来藏共同用四大变造物质色法，再共同的维持物质色法，再共同的不断的改变物质色法。那么四大种子的排序，是由谁决定的？当然是由如来藏决定的。如来藏会主动决定种子的排序吗？不会，是由众生的业种决定的。</p><p>十九、物质是由什么构成的</p><p>物质色法都是由地水火风空大种子组成，其中水大种子所占的比例多，就形成流质的水。水由水分子聚合而成，水分子里有氢原子和氧原子，各个原子当中还有质子中子原子核等等更微小的颗粒物质，每个微小的颗粒都是由地水火风四大种子组成，加上空大种子，这样颗粒里有空隙，粒子才能沿着空间轨道运动。四大种子和空大种子排列组合不同，形成的颗粒就不同，运动的形态也不同。</p><p>水里有地大有坚硬性，所以水有阻碍性；水有温度，水的冷热性就是火大；水有流动性，就是风大作用；水里分子当中有空大，有空隙。如果把水加热，就改变了颗粒里四大种子和空大种子的排列顺序和运动形态，水的物理性能就发生改变，液态的水就变成气态的水。如果把水的温度降低到零度以下，水颗粒的排列顺序和运动的形态也要发生改变，其物理性能就转变，液态的水，就变成固态的冰。</p><p>四大种子之间不会互相转变，水大种子不管什么条件，永远是水大种子，不会变成地大种子或者是火大种子，也不会变成风大种子，或者是空大种子，只能是各种子混合在一起的排序发生改变，种子的结构发生改变，其物理性能就改变了。</p><p>如来藏里本有的七大种子，无论外界什么条件都不能改变，如来藏也不能改变种子的性质。水大不会变成地大，佛法当中没有这个道理，否则物质世间就要紊乱了，如来藏里的种子也会紊乱。如果水大能变成地大，那么如来藏里就没有水大，只有六大种子，少了一个种子，众生的色身就不能生成，物质色法也不能生成，世间就没有物质，也就没有世间了，这样的话，世界就都不会存在了，十方世界也不会存在了。</p><p>二十、我们看到的物质，实际上都是一堆堆的粒子，四大组成，并没有实质的物质固体形态。这些粒子不断的生灭变异转换，正是如来藏用输送和回收四大种子四大微粒的形式造成的现象，因此如来藏与外色法相应，一切四大微粒都是如来藏的，也谈不到如来藏触不触四大微粒和外六尘。如来藏把这些外六尘的微粒传导到任何地方，也属于祂的本分和本能。如果一个人有无量分身，自己的如来藏传导外六尘到无量个分身那里，也不奇怪。</p><p>如来藏用四大种子，以不同的数量和不同的排列组合形式，就能生成无量无边无际的物质色法，我们的意识不可想象。因为福德有限，智慧有限，德能有限，受无明烦恼的遮障，所知所解就有极大的限量。所以，我们必须去除无明烦恼以及习气，去除自己心地上的遮障，以扩大心量和眼界，增长智慧到极限，达到佛那种智慧境界。</p><p>二十一、问：众生如来藏里含有的七大种子是不是都是一样的？众生的识种子都是一样的吗？识种子包含哪些，是不是有很多分类？业种是由基础的七大种子组合而成的吧？</p><p>答：每个众生如来藏里的七大种子都是一样的，没有一点区别，识种子也是一样的，没有一点区别。差别的是业种不同，心所法不同，五阴以及识心表现不同。</p><p>识种子，分为眼识耳识鼻识舌识身识意识第七识的种子，分别形成七个识。业种是身口意行造作以后留下的，无形无相，记录五阴身口意造作的事实真相，心所法的造作，也都以业种的形式收存，不是由七大种子组合成的。</p><p>二十二、五蕴十八界的运作，都是如来藏所输送的七大种子的功能作用，七大种子在六根六尘上的运作，地水火风空在色身上的运作和识种子在识心上的运作，都体现在五蕴的运作上，识种子、四大种子、空大种子与见大种子一起运作，五蕴就生出来了。如来藏把种子输送出来，就形成了种子的功能作用，种子的功能作用也就是如来藏的功能作用，但与如来藏又有所不同，二者是不一不异的关系。如来藏本身所具有的种子幻化出一切法，种子和一切法都属于如来藏，如来藏能收能放，所以一切法都是如来藏的。</p><p>但如来藏没有七识的那些心行，完全是无我性的，不执著任何一个法，心地本自清净；意根却把如来藏幻化出来的所有一切法都执著为我、我所有的，执著六识的功能作用为我和我的，不知道都是如来藏所生，归如来藏所有。祂执著如来藏幻化出来的法，却不知道如来藏的存在和幻化作用，如来藏依着业种业缘出生五蕴十八界，没有一个法不是祂运作出来的，而意根以为都属于自己所有而生贪着，却因为其贪执性而被缠缚包裹在三界里，不得出离和解脱。被缠缚包裹的是意根，不是六识，因为是意根抓取万法不放。</p><p>二十三、一切人、事、物、理都是由如来藏依着各种的缘而出生的，没有缘就不出生万法，如来藏依着缘与业种，再依着意根思心所的抉择，来运作一切法，变现一切法。这一切法生住异灭之后，种子收回如来藏里再输送出去，又再出生生住异灭的万法。每个生住异灭的法，好比一个泡沫，出现了又灭了，五蕴就这样不断地生生灭灭不已。如来藏就像大海，把一滴滴水推送出去，形成一个个浪花，然后水滴再回到大海中，浪花就消失了。而意根因贪爱与无明，不断的去抓取那些浪花，无量劫都空无所得。</p><p>一个人是一个泡沫，一个事是一个泡沫，一个理是一个泡沫，宇宙山河大地整个历史都是一个泡沫，大泡沫小泡沫无数泡沫在大海上起起灭灭，没有一个是真实不虚的。只有大海不动，水滴还是原来的水滴，不增不减。境界风就好比业种、业缘和意根的思与攀缘，如来藏依着业缘而出生境界风，把种子不断地输出去又收回来，以因缘而输出，以因缘而收回，种子数量永远不变，还是那么多，如来藏本体与种子不生不灭，不增不减。一切事相都在生生灭灭中而如来藏不动，动的是如来藏所变现的幻化相，就像泡沫。意根抓着泡沫相而生起烦恼，到头来什么也抓不到，却造出无数的业种存进如来藏，而这业种也不是真实有的，先无后有最后还是无。众生就这样不断地在三界当中生死轮回，受种种的苦，而不知这些法的虚妄，执为实有，因此无法脱离苦海。</p><p>这些种种的人事物理、种种的想受、种种的识心，以及种种的行为造作，都像泡沫一样，是空的、无常的、幻化的、苦的，不是真实的，也不是我和我所有的。万法皆是如来藏所幻化，没有一个法可以离开如来藏而单独出生和存在，都不出如来藏之外。就如黄金打造的金饰品和狗屎盆，众生总取着这些幻化的相而产生苦乐，执著不已；可是这个黄金不管打造成什么样子的相，本质还是黄金。一切法的本质都是如来藏与七大种子，五蕴的本质也是七大种子与如来藏，色身的本质同样是五大种子和如来藏。</p><p>二十四、如来藏输出四大种子，生成某种物质色法，就像黄金打造成金盆，需要装东西时用金盆。需要金厨具时，金盆没有用，毁掉金盆，再次打造金厨具。</p><p>如来藏也如是，此种物质色法灭，四大种子流回如来藏中，当需要其他物质色法时，如来藏再次输出四大种子，生成其他物质色法。因此说一切法即如来藏，与如来藏不一不异，各有其用，各有其性，各有其相，各有其体。而一切法之性由如来藏决定，一切法之相由如来藏决定，一切法之体由如来藏而立，一切法之用，由如来藏赋予。因此一切法即如来藏，非一也非异。</p><p>如来藏不生不灭，七大种子不生不灭，一切法看似生灭，根本也是不生灭，灭了再生，灭又何妨生。只要有如来藏，有七大种子，一切法都不永灭，何妨断续存在。</p><p>对于金盆子，各人所见不同。有人见金性，需要金饰品就拿去打造金饰品，需要金砖，就拿去打造金砖。而极大多数人只见盆子相，用来盛水装食品，更有人只用来装赃物。五蕴身本是黄金屋，诸佛用来广利无量众生，而众生用来藏污纳垢，不起善用。</p><p>二十五、意根和六识的心行，以及各自、和合造作的身口意行，就是业，以业种子的形式存在如来藏里。业有善恶，业种就有清净和染污之别。造业时，是身体和识心合起来运作的，那就是七大种子的功能作用，所以造业也不离如来藏之力，八个识和合起来造业。明心证得如来藏以后，就明了恶业就是幻化不实的，那就没有根本性的业行了，果报就消失或者是轻微了，重罪轻报。</p><p>造业之后，识种子回到如来藏里，仍然是清净的，无染污的。可是业行却留下来，档案生成了，即使受报以后，业种消失，档案也不会消失。就像犯罪的人进监狱受报，受报之后从监狱出来，监狱里仍然有档案记录，供查阅和有关人员调查。</p><p>识种子形成的识心无论怎样造作，识种子永远是清净的，没有什么心行造作。而识心的造作，是心所法的造作，是心所法的出生、转换和改变。心所法不是识种子形成的，不是识种子的功能作用，所以识种子的清净性不发生改变。改变的永远是心所法，心所法的运作形成了业，形成了业种存入如来藏中。心所法改变，染污业消失，清净业现前，业种就汰换了。修行就是去除无明，无明去除，心所法就改变，心行就改变。</p><p>二十六、七大种子的数量是固定的不变异的，虽然数不过来。如来藏用这么多固定的种子，变生一切法，法灭时，种子全部回到如来藏中，再在其他法中出生，变生其他法。种子在法上是刹那生刹那灭回去的，一切法都是刹那生灭变异的，不是恒久不变的，所以是无常的。</p><p>二十七、七识的见分与见大的关系，见大与识大的关系</p><p>如来藏里有七大种子，地水火风空见识，如来藏用这其中的六大种子形成了众生的五阴十八界的功用。其中见大就是如来藏本身所具有的见性，不属于明和暗，不受明和暗的影响，其作用力是随缘则有。有缘现前的时候，就有如来藏的见性，无缘则隐，暂不起用，如无余涅槃，没有五阴十八界的缘时。</p><p>如来藏的识大直接就形成了七识心，这样七识心就有了别、分别性，就能有身口意行。七识心的了别、分别性就是七识的见分，与如来藏的见性不同。七识的见分有生灭，依如来藏的识大种子而有，是生灭幻化的，而如来藏的见性可以永远存在起用，除非在无余涅槃中，没有六根六尘的缘，如来藏的见性不现起，无有可见。</p><p>如来藏本身的识性也是不生灭的，与如来藏的见性是平行并列的关系，而出生的七识就有生灭，因为是被生出来的，那就能灭。</p><p>如来藏的七大种子本是如来藏性，本不生灭，七大种子就是如来藏。见大就是如来藏的见性。楞严经里说的见觉空顽，就是指佛性不觉六尘境界之觉性；而七识的见性不是空顽的，能够分别具体对象，是有因缘条件才能起用的。如来藏的见大不生不灭，即使在无余涅槃里，也是长存不灭的，七大种子在无余涅槃里都是长存不灭、不生不灭的。以上依据楞严经第三卷而说。</p><p>二十八、业种与七大种子的关系</p><p>业种与七大种子是否是独立的，首先来看业种是如何形成的。业种是七个识心在色身上造作的身口意行而形成的，其中造业的主人是意根，是意根指使、唆使、指挥六识利用色身造作了身口意的行为，这些行为就以种子的形式存在如来藏里，将来因缘成熟，种子生根发芽，现行出果报，实现因果律则。</p><p>七个识心是七大种子中的识种子形成，色身是七大种子中地水火风空五大种子形成，还有一个见大种子，是如来藏的功能作用，七大种子和合运作，造作了业行，形成了业种。那这整个过程，可以说都是如来藏的功能作用。</p><p>业种与七大种子的关系，非常紧密，没有七大种子就没有业种，但业种是独立于七大种子之外的，比如说地水火风空五大种子回到如来藏里的时候，不能带着业行而回去，五大种子也不造作业行和业种，见大种子回到如来藏里的时候也不带着业行和业种，七个识的识大种子是否带业种业行回到如来藏里呢？肯定也不带业种业行。识种子本身是清净的，不是善性的，不是恶性的，也不是不善不恶的，永远如此，因此就不带业行业种。业行有善、恶、不善不恶之别，这是识种子出生形成七个识以后，心所法伴随着运行，识心才有善恶无记三性，识种子本身没有这三性。当心所法运作出来以后，识心就有了善恶三性的业行，形成了业种，那么业种就不会跟随识种子到如来藏里，识种子仍然保持其原有的清净性，再输送出去时仍然是清净的识种子。</p><p>既然心所法伴随识心运行，才有善恶三业，心所法有善恶三性，识种子形成的识心没有善恶三性，那么业种就与心所法有关，心所法改变，业种就改变，心所法清净，业种就清净。所以七大种子与业种是两套机制，虽然有很大的关联，也不能混为一谈。</p><p>那么七大种子被如来藏输出来时是否带着业种的信息呢？不能带，因为种子是清净的，所有众生包括佛的七大种子都是平等一如的，没有差别。差别在于心所法，业种与心所法有关，识心的清净与否与心所法有关，修行的关键就是改变心所法，不是改变七大种子，也不是改变识种子，这些种子是改变不了的，只能改变心所法，继而业种改变，变得绝对的清净，才能是与如来藏一样清净的佛。</p><p>二十九、业种问题</p><p>业种不是四大种子组成，是一种信息，是无形的档案。业种有如电脑里的文档，没有形相，调出来就显现，不调出来就没有。而业种即使消失了，有神通的人也可以调出来，查阅那些信息。这些种子的问题都是非常深的法义，我们现在都是猜测和想象，无法现量观行，等入地以后有了唯识种子的智慧，才能逐渐相应，逐渐观察这些内容。</p><p>业有清净业和染污业之别。只有无余涅槃里的阿罗汉不造业，佛也造业，佛造的是清净业，不是无明业。无余涅槃里因为没有阿罗汉，所以不造业。只要没有意根，就不会造业了，意根是造业主。归根结底，一切业行，都是如来藏造的。</p><p>三十、业种和七大种子是否是各自独立的</p><p>业种与七大种子是否是独立的，首先来看业种是如何形成的。业种是七个识心在色身上造作的身口意行而形成的，其中造业的主人是意根，是意根指使、唆使、指挥六识利用色身造作了身口意的行为，这些行为就以种子的形式存在如来藏里，将来因缘成熟，种子生根发芽，就会现行出果报，实现因果律则。</p><p>七个识心是七大种子中的识种子形成的，色身是七大种子中地水火风空五大种子形成的，还有一个见大种子，是如来藏见万法的功能作用。七大种子和合运作，造作了业行，形成了业种，那这整个过程，可以说都是如来藏的功能作用。</p><p>业种与七大种子的关系非常紧密，没有七大种子就没有业种，但业种是独立于七大种子之外的，比如说地水火风空五大种子回到如来藏里的时候，不能带着业行而回去，五大种子也不造作业行和业种，见大种子回到如来藏里的时候也不带着业行和业种，七个识的识大种子是否带业种业行回到如来藏里呢？肯定也不带业种业行。因为佛在楞严经里说识种子本身是清净的，不是善性的不是恶性的，也不是不善不恶的，永远如此，因此识种子就不带业行和业种。但是识种子回到如来藏里的时候，其分别和了知的行为还是以种子的形式跟随到如来藏里，只不过不与识种子在一起。</p><p>业行有善、恶、不善不恶之别，这是识种子出生形成七个识以后，心所法伴随着运行，识心才有的善恶无记三性，识种子本身没有这三性。当心所法运作出来以后，识心就有了善恶三性的业行，形成了业种，那么业种就不会与识种子混在一起，识种子仍然保持其原有的清净属性，再输送出去时仍然是清净的识种子。只不过出来配合识种子的心所法分别有善恶无记三性，就显得识心有善恶三性了。</p><p>既然心所法伴随着识心的运行，才有善恶三业，心所法有善恶三性，而识种子形成的识心本身是没有善恶三性的，那么业种就与心所法有关，心所法改变，业种就改变，心所法清净，业种就清净。所以七大种子与业种是两套机制，虽然有很大的关联，也不能混为一谈。</p><p>那么七大种子被如来藏输出来时是否带着业种的信息呢？不能带，因为七大种子是清净的，与业种不混淆在一起，所有众生包括佛的七大种子都是平等一如的，没有差别。差别在于心所法，业种与心所法有关，识心的清净与否与心所法有关，修行的关键就是改变心所法，不是改变七大种子，也不是改变识种子，这些种子是改变不了的，只能改变心所法，继而业种改变，变得绝对的清净，才能是与如来藏一样清净的佛世尊。</p><p>三十一、如来藏里虽然含藏着万法的种子，但是种子遇缘，才能生起现行，缘没有出现的时候，种子就继续存在如来藏里，不能现行运作出来。万法都是因缘所生，根本因是如来藏，业因是前世造业的业种，缘是业种现行所要具备的条件，如果条件不具足，种子就不能生根发芽结果。虽然说一切法都唯心，但是万法也唯识。心指如来藏，识指三能变识，也就是八个识。佛说，有因有缘世间集，有因有缘世间灭，因缘具足，就能出生相应的法。</p><p>三十二、胎儿色身是否应该由如来藏直接输出四大种子出生？</p><p>如来藏依缘就是业缘，而变现五阴身或者是改变色身。如果仅仅依靠如来藏里面的四大种子，那就不需要父母缘，甚至什么缘也不需要。那么众生的五阴身就应该是完完全全一样的，所有世界和物质色法也是完完全全一样的，如来藏变现三界器世间和五阴身也不需要有意根和六识，那么变造出的世界就是清一色的，也就谈不到业力和众生的差别了，如来藏也就是作主识了，世界由如来藏作主生成，如来藏就有了我性，不是无我的了。事实上，世界造就好之后，如果要生成和改变五阴十八界，如来藏必须依赖一些业缘才能出生和改变五阴十八界，这些缘就包括外界的物质色法，众生的生存环境，以及父母缘等等。</p><p>三十三、循业发现是什么意思</p><p>楞严经中的循业发现，众生依循着自己的业力和业缘，才能接触到某部分法，没有业缘就接触不到。比如金矿，有些人去开采就能得到，有些人开采就得不到。比如水，有些人需要水却得不到而渴死，某些人接触的太多了而淹死。比如地狱，某些人能见得到能入地狱，某些人见不到，去不了地狱，天上境界也是这样，极乐世界也是这样。每个众生生活的环境，无不是循业发现，无业不出现。</p><p>三十四、七大种子是否是真实存在的</p><p>只有真实存在的理体才有生发义，才能出生其他法。如来藏是真实理体，能产生一切法，但是如来藏必须用七大种子来创造一切法。这样的话，七大种子必须是在如来藏里实有，真实存在，如来藏才能使用，才能构成一切法。如果没有实体，不真实存在，就无法再创造其他法了。虚拟的东西不能架构其他法，因为不存在，没有实体。因此说如来藏是实体，无形无相，七大种子也是实有之法，在如来藏里无形无相。</p><p>判断一个法是不是绝对真实，要看它是否恒时存在，是否不用出生，是否永远不变异。恒时包括无余涅槃时，如来藏和七大种子永远存在，即使在无余涅槃里，永远不用出生，没有出生如来藏和七大种子的法，相反一切法都是二者出生的。</p></div>"
},{
    "title": "第十五章　相关词语的解释",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章　相关词语的解释</strong></p><p>一、八个识就是眼识耳识鼻识舌识身识意识，第七识和如来藏，其中第七识就是意根，也叫作末那识。意根既属于根，也属于识，是个特殊的根。意根轻易不能灭掉，只有阿罗汉以上的圣人才有能力灭，但是大菩萨们都不愿意灭。</p><p>种智，是关于八个识的种子的智慧，开悟以后，修到初地菩萨的果位才有种智，能够观察八个识的体性，观察如来藏里所含藏的种子，这个种智修圆满了，八个识的体性全部证得，就叫作一切种智，也就是佛。初地以上的圣人只有道种智，其智慧还不圆满，圆满时就是一切种智。</p><p>菩萨的果位分五十二个，凡夫菩萨是十信位，从初住位开始修菩萨六度，修够了以后就明心。第一次明心，果位是第七住位，然后还要修到十住位，十行位，十回向位，有了一分道种智，就入初地，修完十地，就成为等觉妙觉。</p><p>涅槃的另一个说法，就是指如来藏，祂是涅槃心，不生不灭，寂静清凉，没有苦，没有喧闹。这个涅槃心，在五蕴不灭的时候，照样是存在的，菩萨就是在五蕴不灭的情况下，证得这个涅槃心如来藏，叫作明心开悟。</p><p>二、佛有三身：法身、报身、应化身。法身佛就是佛的真如心体，祂无形无相，无眼耳鼻舌身意，无五蕴十八界。既然法身没有五蕴身，那就不能说法。而报身佛和应化身佛有五蕴身，有十八界，就能够用心和口来说法。报身佛度法身大士，为地上菩萨讲道种智的修行内容，就是要修证如来藏所含藏的各种种子的功能。应身佛为了满足众生求法的愿望，应众生的根基现佛身度众生，宣说佛法。</p><p>化身佛分身无数到十方世界化度众生，演说佛法。但是报身佛和应化身佛是法身佛所变现的，离开法身佛，也没有报身佛和应化身佛。后两种佛说法时就离不开法身佛，每尊佛说法时，就有说法的佛和不说法的佛，说法的佛不能离开不说法的佛。所以释迦佛讲了四十九年法，而说我没有说过一个字。但如果说释迦佛没有讲法，也是不对。不了解三身佛的概念内涵，说佛有所说法是谤佛，说佛没有说法也是谤佛。</p><p>三、实相念佛是念法身佛，念自性清净心。实相的意思就是真实的不生灭的相，永远不变异的相是实相。世出世间不生灭的真实相只有一个，就是自性清净心，也叫作如来藏，其余一切都是虚相和假相。虽然自性清净心没有六根六尘六识的相，没有五蕴的相，但是祂有祂特有的法相，不属于三界世间的相，因此能够被我们的意识心所认知和了别，能够被意识心所证得。</p><p>那么实相念佛，就是念自性清净心，就是念第八识如来藏。如果没有证得如来藏，没有明心开悟，无论怎样念佛，都不是实相念佛。因为没有证得，没有找到如来藏，不知道祂是什么体性和状态，不认识祂，怎么能够真正地念祂呢？没有证得，没有开悟，都是念虚相念假相。</p><p>有人观想自己就是阿弥陀佛，达到念而无念，无念而念，进入空性的状态，这也不是实相念佛，这是意识心通过念佛达到的一种念佛定的状态，定境仍然是生灭法，不是实相，是幻化相，这种定相不久就会消失的，不能长久。这种念佛的空就是意识心暂时寂静的状态，不是真如的空性境界，不属于开悟，因此不是实相念佛。</p><p>四、什么是自心现量？佛说一切法皆是自心现量。自心，就是真实心，永不坏灭的心。现量，现实存在的事物，当前所能呈现出来的，不是虚构想象的，不是比较来的，比较来的叫作比量，想象出来的叫作非量。一切法都是因缘所生，所以是因缘法。因缘法中所有的现象都是自心上所显现出来的，也就是说一切法都是自心所现，自心所变，离心无一切法，离心也无因缘法。</p><p>因缘法既然是自心现量，自心所生，那就不是真实的法，被生出来的法，就能灭去，有生必有灭，无生就不灭。因缘所生法都是有生有灭之法，因缘具足则生，因缘散去则灭，因此就是虚妄法，不是实法。所以世尊才让我们离开对于这些因缘所生法的贪执，贪着这些假法，就是生死轮回，就是苦恼。真实的法，世尊从来没有让我们离开，因为根本离不开，但也不要去执祂，执什么都不对。自心本性从来都是无执的，什么也没有执著过，如果我们与自心如来藏相应，就无生死烦恼了。</p><p>五、八个识的三性：六识的依他起性，第七识的遍计执性，如来藏的圆成实性</p><p>前六识是如来藏依赖种种的缘而生成的，无缘不出生六识，缘分别有九缘八缘七缘等等不同，因此六识是依他起性，依如来藏和意根，依业种，依六尘，依六根等等条件而现起，因此六识是不自在的，是虚幻的，是空的，是无我的。</p><p>遍计执性是指意根第七识，祂普遍计度执取一切法，把一切法都当作我和我所有的，祂执取如来藏的见分为我的见，执取六识的见为我的见，把如来藏和六识的功德都据为己有，贪执不舍，生死就不了断。因此，改变意根的遍计所执性，才能最终得解脱，得自在。第七识只要一念无明不灭，自身就不灭，而一念无明从无始劫以前就存在着，因此第七识的存在没有开始，不是依他起性，而是遍计所执性，因为无明普遍的执著一切法。第七识意根本身的体性就有遍计执性，执人我，执法我，执万法，因此执性而不得解脱，不得涅槃，不得大自在。</p><p>圆成实性是指如来藏，祂能圆满成就世出世间一切法，一切法都由祂出生和成就，有祂就有一切法，无祂就无一切法。如来藏的圆成实性，能依业种业缘圆满的成就一切法，不管是善法还是恶法，因此说除了如来藏，其他法都是生灭法。</p><p>六、自性就是第八识、如来藏、真如，通过修行菩萨六度，圆满菩萨的条件以后，参禅就能找到自性如来藏，证悟明心，从而打破了无始无明，破尽无始无明就成佛。</p><p>无明包括三种：第一种是一念无明，就是四住地烦恼：见一处住地烦恼、欲界爱烦恼、色界爱烦恼、无色界爱烦恼。见一处住地烦恼是知见我见上的烦恼，不知五阴无我，不知五阴虚幻不实。欲界爱烦恼是指欲界里的贪嗔痴烦恼，色界爱烦恼是指色界里的贪嗔痴烦恼，无色界爱烦恼是指无色界里的贪嗔痴烦恼。断我见，成为初果时，就断了见一处住地烦恼，修到初禅以后，成为三四果罗汉，就能断除对欲界、色界、无色界的贪嗔痴烦恼，这样四住地烦恼断尽，就能出离三界。</p><p>第二种是无始无明。众生对大乘如来藏从来不知不证，不知道如来藏就是真实的自己，就是法界实相，一切法都是祂出生和显现出来的。菩萨明心证悟以后，就打破了无始无明。众生的一念无明也是没有开始的，也属于无始无明，所有的无明都是无始无明，都没有开始，都不是后天新生出来的，都是无始劫以前就存在着的，都是意根的无明，与意根相应。因为佛在楞严经中开示说，生命最初的时候只有如来藏和第七识意根，当意根起心向外有所祈求时，三界世间就出现，随后众生的五阴身出生在三界世间里。</p><p>第三种是尘沙无明。初地菩萨开始断除如尘沙一般多的微细无明，断尽就圆满佛道。在这当中，成佛路上所不懂的事理都要搞懂，都要证得，八个识的种子功能体性全部了知，没有一样不知不证的，这样三种无明断尽了，就成为一切种智，佛道修完了。</p><p>七、真谛与世俗谛</p><p>世俗，就是三界世间，就是五阴十八界和所有的宇宙器世间。世俗法就是五阴世间的生存法则，宇宙器世间的运行法则。一切言说、道理、知见、意见、纷争，全部都是围绕着五阴十八界这个世间而展开，如果没有五阴，一切的法则都不会出现，而五阴十八界三界世间，以及一切法则，全部都是生灭变化不停的。</p><p>谛就是真理，世俗谛就是有关五阴世间苦集灭道的真理，五阴世间苦空无常无我的真理，因为不管什么时代，什么历史背景，苦集灭道四圣谛永远不变，所以称为谛。</p><p>真谛，就是最真实之理，是第一义谛。胜义谛，是世出世间最殊胜的无有可比的真实之理。这是指实相心真如第八识如来藏，是实相心如来藏运行的真理和轨则。真谛和世俗谛往往是融合在一起，共同起用，二者融合在一起，才有五阴世间的一切法则和运行规律，才有三界世间的存在，才有世俗谛。</p><p>谛既然是真理，是一切法的真实之理，代表着大智慧，那么普通世间人的世俗言论，不可能是谛，不可能有真实性，往往都具足了邪见和愚痴，都不是谛，也不能叫作世俗谛。只有佛陀讲的四圣谛法是世俗谛，因为四圣谛是说五阴世间苦集灭道的真理，具有真实性，依之修行能得解脱，能出离生死轮回。一般世俗人所说的就不能是世俗谛了，如果说世间人所说的是世俗谛，那么世间人都是解脱的大圣人，也就不用佛陀辛苦来五浊恶世，宣说世俗谛真理了。</p><p>真谛既然是关于实相真如法的真理，那么众生无论怎样站在佛法的角度看问题，永远也不是真谛，仍然是个人觉知妄心的知见看法，往往是邪见和错误极多，即使没有邪见，全部是正理，也不是真谛如来藏。真谛是指真实的实相理体，是不生不灭、不垢不净、不增不减、不断不常的如来藏真如，任何言语言论知见观点都不代表真如本体，因此都不是真谛，仅仅是妄知妄觉罢了。</p><p>八、法分为有为法和无为法，缘生法和非缘生法。有为法是有行为造作的法，是后天所形成的法，包括五阴、十八界、三界宇宙器世间都是法。有为法即是缘生法，无为法是不造作法，是先天而有的法，本来而有的法，非因缘所生法。凡能被人所能认知的都是法，不管看得见看不见，存在就是法。</p><p>法有真法和妄法，生灭法和不生灭法，因缘所成的法和不是因缘所成的先天就有的法。一切法从各个角度，各个方面，都有区别。因缘所生法，相有性空，即是妄；非因缘法是本来就有的法，相无体有，即是真实的不坏灭法。凡是直接指向成佛之法，就是究竟法，而达到究竟法的方法就是方便法。</p><p>九、什么是无生法忍</p><p>无生法忍是菩萨明心见性以后修到初地菩萨时见道所出生的智慧。刚刚明心时证得无生忍，如来藏不生不灭没有出生，五蕴身心是如来藏幻化出来的，相上有生，实际是无生。</p><p>修到初地时获得无生法忍的智慧，忍可除了五蕴无生，如来藏无生，世间一切都无生。这个智慧非常广大，叫作唯识种智。世间所有法，所有相，都是如来藏出生的，没有自体性，相上有生，实质无生，都是如来藏性质，犹如金饰品都是黄金的性质。</p><p>十、无生法忍智慧境界</p><p>《大般若经》卷四四九云（大正7·264b）：<strong>‘如是不退转菩萨摩诃萨，以自相空，观一切法，已入菩萨正性离生，乃至不见少法可得。不可得故，无所造作。无所造作故，毕竟不生。毕竟不生故，名无生法忍。由得如是无生法忍故，名不退转菩萨摩诃萨。’</strong></p><p><strong>此谓菩萨观诸法空，入见道初地，始见一切法毕竟不生之理，名无生法忍。</strong></p><p>释：明心开悟以后不退转的菩萨，观察自己五蕴十八界的相貌都是空，从这个角度再扩展开来，观察其他一切法，也都是空的，都没有真实出生过，世间一个法都不可得，能这样观察的菩萨就真正的证得了一切法空，一切法无生，相当于四果阿罗汉的解脱境界。因为一切法都不可得，一切法也都无所造作；因为无所造作，一切法毕竟都不生，都没有出生。因为证得了一切法都毕竟不生，认可此理，就是无生法忍。证得这种无生法忍，就于无上菩提大道不再退转，永远行于菩萨道。</p><p>无生忍只知道五蕴人我空，无生法忍不仅证得了五蕴人我空，也证得了一切法都空，其范围相当广泛，程度相当的深邃。非地前菩萨和阿罗汉所能比。地后菩萨，因为有无生法忍的智慧，除了修行和弘法，不造作世间事，不为世间利益，不喜乐名闻利养，一心在于佛道。</p><p>十一、二十四个心不相应行法，是由心法、心所法和色法共同显现出来的非色非心法。比如时间，依太阳光、虚空、地面参照物这些色法，以及如来藏、意根、意识、眼识这些心法，再加上识心的作意触受想思等等心所法，三者共同显现出时间这种不以觉知心为转移的心不相应行法。其实质也是如来藏变现出来的，世间没有一法不是如来藏变现和显现出来的。</p><p>时间不是四大组成的实法，不是如来藏直接出生的，是如来藏出生物质色法以后显现出来的一种假相，不是外尘，如来藏无法缘于时间。只有把眼识意识生出来以后，才能依物质色法判断了别时间。没有眼识意识的时候，比如睡觉时，意根也能判断时间，也是依如来藏出生的物质色法来了别判断。所以没有单独的时间这个法，也不分外相分和内相分。</p><p>十二、怎样理解一合相？</p><p>一合相，可以从两方面来理解，一方面要从实相上来理解，另一方面要从虚相上来理解。实相也就是不生灭的第一义諦，也就是如来藏阿赖耶识。如来藏是不生灭的本体与生灭的七识业种和合起来的一个整体，因此就称为一合相，祂必须要存七识的生灭种子，才能依种子变现世间万法，否则祂就不用运行，处于寂灭无所作为状态，世间也就灭失，不存在了。</p><p>从另一个方面虚相上来说，合，就是和合，是四大组成的和合体，或者是七大组成的和合体，也是生灭与不生灭构成的和合体。众生的五阴十八界都是一个和合起来的虚相，世间万法都是和合起来的虚相。和合的，就不是本来而有的，就是因缘所生之法，是如来藏依各种缘所出生的假法。有生，必然有灭，生灭即是无常、空，变异即是无常、空，无常即是苦，苦即是非我。</p><p>十三、什么叫作无生忏</p><p>大乘无生忏，也是实相忏，就是当悟得诸法实相，获得无生忍时，知道一切法都不曾生，有也是幻有；那么所造作的恶业也是虚幻的，没有真实性，这样就灭了三恶道的重业，免去三恶道苦了。</p><p>昔有勇施菩萨犯重戒之后，就是这样灭罪的，他出家后不仅犯了邪淫戒，还犯了杀人戒，命终必下地狱受苦报。造作了恶业之后，他感到后果非常可怕，心生畏惧，就去见佛求灭罪。佛就为他用大乘法无生之理来分析造业的实质问题，问他在这一系列的行为当中，有没有造业的人，有没有造作的恶业，勇施菩萨听后当下思惟，一念回光，顿时悟道，懂得了万法无生，就成了大菩萨。三恶道的罪业就此消灭，未来永不下三恶道受此苦报，因为毕竟没有真实的其人其事，一切法都是幻相罢了。</p><p>但是人中的苦是免不了的，三恶道的大苦就变成人中的小苦，这就是悟无生忍的极大益处之一；最大的益处，就是以此为基点，未来毕竟要成就佛道。如果没有悟得如来藏这个无生法，没有明心，所作的忏悔就不是无生忏，只是相似的无生，不是真正的无生，大的恶业还是完全不能消除，未来还是要受一些大恶报。</p><p>十四、什么是正定</p><p>须菩提宴坐时，却被维摩诘居士呵责说：你这不是正定。小乘法中说，正定是八正道之一。但是这个正定是后天打坐修出来的定，是先无后有，有后还能消失的生灭性的定，因此不是真正意义上的、究竟的正定。</p><p>须菩提宴坐，就是八正道中的正定。宴，寂静无喧，无有念想，无觉无知，这是意识心入的定。意识心入的定，正是先无后有的生灭性的定，是如来藏旁出的定，因此不是真正的正定。</p><p>那么真正的正定是指什么呢？正，就是正位，正真，不生不灭，不用出生，不是偏出和旁出，无出无入，随顺一切，却无所住，只有如来藏有此定。因此真正的正定就是指如来藏的不动性，是六祖说的那枷常在定的首楞严大定。觉知心入的定都是旁定，有生有灭，有出有入，有所住，与如来藏的楞严大定正好相反。</p><p>我们初学佛修行做不到心无所住，开始都要有所住，心住一个境界，不散乱，以此方便入禅思，起观照，起智慧，起利用。所以这种定，严格来说，应该叫作方便定，以此方便定起般若智慧，才能证得真正的正定——首楞严大定。没有证得如来藏时，不可能证得如来藏的不出不入的楞严大定。意识心的定肯定是有出有入，有生有灭的，但是这种定能引发智慧，心专注思惟时，智慧才能现前，因为识不分流，就有势力，有力量清楚分别，了知真相，从而能观照般若，出生智慧。</p><p>十五、生灭灭已，寂灭为乐是什么含义</p><p>生灭灭已，意思是阿罗汉把所有的生灭法都灭掉了以后，只剩下如来藏，静静地单独存在着。寂灭为乐，在无余涅槃里，寂灭的涅槃心如来藏，没有喧闹，没有苦受，无为、无作、无愿、无求，清净为乐。阿罗汉入无余涅槃时把自身的一切生灭有为法全部灭掉，灭掉了生灭的五阴身和七个识，灭掉了属于自己那一部分的色声香味触法，生灭法都灭尽了，就入到无余涅槃里，叫作生灭灭已。</p><p>这样就没有阿罗汉的五阴身存在了，也就没有了苦受，剩下那个不能灭，也灭不了的如来藏，也没有苦受，处于寂灭乐中，但是也没有乐受，这叫作寂灭为乐。阿罗汉活着的时候是有余涅槃，还有五阴身存在，那就有少量的苦存在着，有苦可依，就不是纯乐，也不是寂灭乐。但是阿罗汉只是断了一念无明的烦恼现行，习气没有断；习气是大乘初地菩萨才开始一点点地断除的，断尽了，就是八地菩萨。</p><p>十六、大乘菩萨的现量智慧</p><p>现量这个概念，最究竟的解释，应该是有真实的智慧，能观察出事实真相，能看到表面现象背后的实质，不被虚妄的假相所迷惑，不用猜测和臆想，不用左思右想去比较就能知道事情的实质内涵。大乘菩萨的现量智慧难以思议，看到一个法的出现，就能观察到这个法是如何运作出来的，从里到外从大到小都是第八识用种子打造出来的，是第八识的功能作用，全体都是第八识。这个智慧才是真正的现量观行智慧，明心开悟的智慧都不属于完全的现量智慧。</p><p>十七、烦恼即菩提的正解</p><p>烦恼是贪嗔痴性的恶心所法，与七识心相应，是七识心染污的表现，七识心出现时，贪嗔痴心所法有时就要伴随着运行。而七识以及心所法的运行，正是如来藏输送识种子配合的结果，如果没有如来藏的配合显现，七识也不能现行出来。当众生现起贪嗔痴烦恼时，其中就有如来藏的和合运作。所以在这些贪嗔痴烦恼当中，就能证得如来藏的存在，从而明心见性。但是如果众生的贪嗔痴烦恼很重，心水浑浊，智慧就不能出现，不可能在这时候证得如来藏。既然如来藏能够配合七识现起贪嗔痴烦恼，那么这些烦恼也就是由如来藏所生，也就是说这些烦恼本身就是如来藏性。而我们通常所说的菩提心，就是指如来藏本体，因此说，烦恼即是菩提。</p><p>烦恼还有另一种说法，凡是众生心所不愿意做的，都是烦恼。比如说日常琐事，吃喝拉撒，收拾卫生，做各种工作事业，养家糊口等等，这些也都属于烦恼，是众生所不情愿作的。但是这些日常生活当中的琐碎事，人们之间的礼尚往来，都是七识心应对于这个世界而不得不做的事情。而七识心不能单独做这些事情，必须有如来藏的配合，真妄二者合和运作，才能现起这些法，完成这些琐碎事情。在做这些烦恼事情时，就有如来藏的存在，所以在这些烦恼事情上参禅，就能明心证得如来藏，那么这些烦恼也就是如来藏菩提心了。</p><p>过去的祖师们，在烧火煮饭、种地种菜、迎来送往这些日常琐事当中参禅，从而明心开悟。甚至有的禅师，用打骂、推拉、大喝的方式，让弟子明心证悟，因为这些烦恼当中，都有如来藏的显现，因此这些烦恼也都是菩提。五祖说：若见性，轮刀上阵也见，说的就是这个意思。</p><p>十八、法尔如是，是指如来藏本体的运行规则，意思是如来藏的运行没有什么道理可讲。如来藏的法尔如是，与诸佛降生人间弘法的法尔如是，不是一个意思，此法尔如是，非彼法尔如是。同样一个词语用在不同处，有不同的含义，看任何一篇文章，都应该如实理解真实的含义，所谓依义不依语是也。</p><p>诸佛成佛时，法尔如是的要降临人间弘法，通过八相成道，法尔如是的要安排自己的弘法团队，安排自己的弟子来到人间。这里的法尔如是的意思是，没有例外，都要这样做。诸佛世尊，法尔如是的要弘法利生，这里的法尔如是一定有世尊的思心所运行，世尊的七识心一定要考虑如何下生人间，如何弘法，如何利众。世尊的觉知心一定要思量考虑抉择，安排计划，并且要采取行动，付诸实施。</p><p>如来藏的法尔如是的意思是，祂的运行没有什么道理好讲，本来就是那样的，不是人为设计的规则和法则。如来藏本体没有心思，没有心计，不搞设计，不安排变现万法事宜，祂毫无道理的就是要那样按照既定的流程而运转一切法。</p><p>十九、什么是众生界</p><p>众生界，就是色蕴受蕴想蕴行蕴识蕴，六根六尘六识。这些法都是如来藏生成，种子来源于如来藏，所有材料都来自于如来藏，所以这一切法的本质就是如来藏，因此说众生界即法身，法身即众生界。众生界与法身如来藏的关系，就像馒头与面粉的关系一样，馒头由面粉做成，馒头全体都是面粉，馒头离开面粉不能单独存在，而面粉就能单独存在。面粉的价值就是能制成馒头，可是阿罗汉们只想让面粉毫无价值的存在，不想有馒头吃。众生界也就是佛界，离开众生界，法身的存在就没有什么意义了。</p><p><span>未完  接<strong>《细说如来藏 第二部》</strong></span><br/></p></div>"
}]