[
    {
        "title": "六道轮回",
        "key": "liudaolunhui",
        "describe": "六道轮回原为印度婆罗门教的世界观，后佛教引用，佛教把婆罗门教称为外道。所谓生死轮回是说“舍此蕴已复趣他蕴”。世间众生因造作善不善诸业而有业报，此业报有六个去处，被称为六道。六道是佛根据业报身所受福报大小划分的。分别为：天（化生）、人、畜生、阿修罗（魔）、饿鬼、地狱（化生）。",
        "pinyin": "ldlh"
    },
    {
        "title": "忏悔文",
        "key": "chanhuiwen",
        "describe": "【忏悔文】是指忏悔灭罪时所诵唱之文。有长短多种，其中，以华严经普贤行愿品卷四十中之（大一○·八四七上）：‘我昔所造诸恶业，皆由无始贪嗔痴，从身语意之所生，一切我今皆忏悔’一偈（称为略忏悔）最负盛名，为今一般佛教修行者所熟习。又八十八佛大忏悔文，亦为现今法会重要行法之一。",
        "pinyin": "chw"
    },
    {
        "title": "感恩",
        "key": "ganen",
        "describe": "感恩是对别人所给的帮助表示感激 ，是对他人帮助的回报。感恩是一种处世哲学，是生活中的大智慧。人生在世，不可能一帆风顺，种种失败、无奈都需要我们勇敢地面对、旷达地处理。感恩，使我们在失败时看到差距，在不幸时得到慰藉、获得温暖，激发我们挑战困难的勇气，进而获取前进的动力。",
        "pinyin": "ge"
    },
    {
        "title": "六字真言",
        "key": "liuzizhenyan",
        "describe": "六字大明咒见于《佛说大乘庄严宝王经》，又称六字大明陀罗尼、六字真言、嘛呢咒，中文拼音参考发音为：嗡（ong）嘛（ma）呢（ni）呗（bei）美（mei）吽（hong）。汉地、藏地、蒙古发音有微小的不同。六字大明咒是观世音菩萨心咒，源于梵文中，此咒含有诸佛无尽的加持与慈悲，是诸佛慈悲和智慧的音声显现。六字大明咒是“嗡啊吽”三",
        "pinyin": "lzzy"
    },
    {
        "title": "佛陀",
        "key": "fotuo",
        "describe": "佛陀本指释迦牟尼，后演为觉悟真理者之总称。为佛教用语。梵名Buddha ，巴利名同。又作浮头、没驮、步他、馞陀、复豆、浮屠、浮图。意为觉者、知者。佛陀本指释迦牟尼，后演为觉悟真理者之总称。华人民间也将佛称为佛祖。佛陀，佛教的创始人，俗姓乔达摩,名悉达多。佛陀简称为佛,意思是“觉悟的人”。因此，佛陀变为对悉达多的尊称。",
        "pinyin": "ft"
    },
    {
        "title": "弥勒",
        "key": "mile",
        "describe": "弥勒佛（即弥勒菩萨摩诃萨）（梵文Maitreya，巴利文Metteyya），意译为慈氏，音译为梅呾利耶，在大乘佛教经典中，常被称为阿逸多菩萨摩诃萨，是世尊释迦牟尼的继任者，未来将在娑婆世界降生修道，成为娑婆世界的下一尊佛，即贤劫千佛中第五尊佛，常被称为“当来下生弥勒尊佛”。被唯识学派奉为鼻祖，其庞大思想体系由无著菩萨、世亲菩萨阐释弘扬，深受中国大乘佛教大师支谦、道安和玄奘的推崇。 　　注：弥勒佛、布袋和尚（即大肚弥勒）、布袋罗汉并非同一人。",
        "pinyin": "ml"
    },
    {
        "title": "涅盘",
        "key": "niepan",
        "describe": "涅槃又译为般涅槃、波利昵缚男、泥洹、涅槃那，意译为圆寂、灭度、寂灭、无为、解脱、自在、安乐、不生不灭等。佛教教义认为涅槃是将世间所有一切法都灭尽而仅有一本住法圆满而寂静的状态，所以涅槃中永远没有生命中的种种烦恼、痛苦，从此不再受后有，也就是不再有下一世的六道轮回。",
        "pinyin": "np"
    },
    {
        "title": "财神",
        "key": "caishen",
        "describe": "在佛教中，都推崇财神护法是毗沙门天王，也就是四大天王中的北方毗沙门天的多闻天王。毗沙门为梵语，意为多闻，为福德双全。故佛教称毗沙门天王为财神。财神护法多闻天王，诸财神之首。统领夜叉部众,为天龙八部众之一。夜叉有三种，一地夜叉，二虚空夜叉，三天夜叉也。地夜叉以财施本任。",
        "pinyin": "cs"
    },
    {
        "title": "回向文",
        "key": "huixiangwen",
        "describe": "回向文又称回向偈，佛家于法会结束时齐声朗诵的一种偈文。即发誓愿共同皈依佛道。净土宗多以唐善导大师之《发愿皈三宝》偈“愿以此功德，平等施一切。同发菩提心，往生安乐国。”为回向文。其余诸宗，大同小异。回向即是“回己善根，有所趋向”，将所造善根力集中加于某目的，使之尽快得以实现。",
        "pinyin": "hxw"
    },
    {
        "title": "五蕴",
        "key": "wuyun",
        "describe": "五蕴分别是色蕴、受蕴、想蕴、行蕴、识蕴五种。在五蕴中，除了第一个色蕴是属物质性的事物现象之外，其余四蕴都属五蕴里的精神现象。五蕴理论。五蕴实际上是佛教关于人体和其身心现象都是由哪些要素构成的理论。五蕴的“蕴”是梵文的音译，意义是积聚或者和合。佛教认为世间一切事物都是由五蕴和合而成，一人的生命个体也是由五蕴和合而成的。",
        "pinyin": "wy"
    },
    {
        "title": "情爱",
        "key": "qingai",
        "describe": "人类寻求爱情，不单纯是为了性欲的满足，而是要建立一种特殊亲密、温馨的人际关系：这也正是人的爱情和动物的性冲动的本质区别。在动物界，只要是异性，原则上都能导致性关系，人类绝不是对任何人都可以产生爱情的。",
        "pinyin": "qa"
    },
    {
        "title": "修行",
        "key": "xiuxing",
        "describe": "修行是一个过程，意思是，通过修正言行意，符合特定风格的生活方式。以期达到一种理想的境界。修行，即一刻接一刻的觉察情感、思想、言语、行动、念头。有人说：真正的修行就是一个道理：断恶修善、成就太上圣道。其实修行不应该有什么善恶之分。",
        "pinyin": "xx"
    },
    {
        "title": "自在",
        "key": "zizai",
        "describe": "佛教中“自在”有两大类：1 菩萨所有的两种自在:观境自在、作用自在2 第八不动地以上菩萨所具有的四种自在: 无分别自在、刹土自在(亦作净土自在)、智自在(第九善慧地)、业自在(第十法云地)，另说戒自在、神通自在、智自在、慧自在。",
        "pinyin": "zz"
    },
    {
        "title": "三界",
        "key": "sanjie",
        "describe": "三界（梵语：trayo dhātava? ，巴利语：tisso dhātuyo）指众生所居之欲界、色界、无色界。此乃迷妄之有情，在生灭变化中流转，依其境界所三个层次；又称作三有生死，或单称三有。因三界迷苦如大海之无边际，故又称苦界、苦海。在佛教术语中指众生所居之欲界、色界、无色界或指断界、离界、灭界等三种无为解脱之道。在萨满教术语中则指宇宙上、中、下三界。",
        "pinyin": "sj"
    },
    {
        "title": "佛祖",
        "key": "fozu",
        "describe": "释迦牟尼（Sakyamuni）。佛教创始人。本名 ，意为“义成就者”（旧译“义成”），姓乔达摩。因父为，成道后被尊称为释迦牟尼，意为“释迦族的圣人”。其他称号有（觉者）、世尊、释尊等。",
        "pinyin": "fz"
    },
    {
        "title": "觉悟",
        "key": "juewu",
        "describe": "觉悟亦作“觉寤”，既觉醒之义。就是对事物及其产生和发展的规律的认识和理解程度，一个人觉悟的高低决定了其能动地参与自身及社会活动的方式和方法，从而最终决定其社会活动效率和成果。因此在一定程度上我们也可以说觉悟就是态度、就是世界观和方法论。另外觉悟也是佛教教义名词，梵文意译为“无上正真道”、“无上正等正觉”等。",
        "pinyin": "jw"
    },
    {
        "title": "娑婆世界",
        "key": "suoposhijie",
        "describe": "“娑婆”是梵语的音译，也译作“索诃”、“娑河”等，意为“堪忍”。根据佛教的说法，世人们所在的“大千世界”被称为“娑婆世界”，这个世界的教主即释迦牟尼佛。娑婆世界为释迦牟尼佛教化的的三千大世界。此界众生安于十恶，堪于忍受诸苦恼而不肯出离，为三恶五趣杂会之所。",
        "pinyin": "spsj"
    },
    {
        "title": "随缘",
        "key": "suiyuan",
        "describe": "随缘，宗教术语。缘，指身心对外界的感触。也指顺应机缘；顺其自然。随缘，用现在的话说，人遇到的，不管是逆境、顺境，都要安心接受；随后，逆境，则用正面的心态去面对，去发现问题、提出问题、解决问题，从而走出逆境；顺境，则用感恩的心态去享受、幸福。谓道佛应众生之缘而施教化。缘﹐指身心对外界的感触。",
        "pinyin": "sy"
    },
    {
        "title": "彼岸",
        "key": "bian",
        "describe": "彼岸，梵语为波罗， 华译为彼岸，此岸只生灭，彼岸指不生不灭指涅槃。佛家以有生有死的境界为“此岸”；超脱生死，即涅槃的境界为“彼岸”。《大智度论》十二：“以生死为此岸，涅槃为彼岸。”《无量寿经》卷上：“一切善本皆度彼岸，悉获诸佛无量功德，知慧圣明，不可思议。”",
        "pinyin": "ba"
    },
    {
        "title": "八识",
        "key": "bashi",
        "describe": "八识是佛家唯识宗创始人对人类心理活动抽象出来的一种理论上的认识。前五识眼、耳、鼻、舌、触就是指引起心理活动的感官，第六识就是在前五识的基础上产生的心理活动，故称之为意，第七识末那识，指的是由前六识与外在物质沟通所集聚的自我意识，第八识则是在前七识循环往复活动的基础上形成习气、习惯，这些习气习惯潜藏人心灵深处，不断地不觉察地影响人的生活与工作。",
        "pinyin": "bs"
    },
    {
        "title": "地狱",
        "key": "diyu",
        "describe": "地狱（巴利语niraya，或作naraka），据佛陀所说，地狱为六道之一，轮回者根据其业力而往生此道。但地狱不是永恒的，地狱中的有情（生命）虽受苦但亦有死亡的时候，到时会再根据其业决定下次往生的界别。佛教所说的地狱分为四大类：八寒地狱、八热地狱、近边地狱、孤独地狱。",
        "pinyin": "dy"
    },
    {
        "title": "咒语",
        "key": "zhouyu",
        "describe": "咒语在中国属于法术的一种，以某种特别的顺序或特殊音节念出，以促成某些的特殊效果的语句。语言禁忌发展到极点，达到灵物崇拜程度 ，就可能形成引 。咒是口头语言禁忌 ，平时禁止使用。咒语的文字表现形式是符箓。咒语并非迷信，是人类表达意念的一种语言，传承于我国几千年的道家文化，史上曾记载源于一种巫术行为，后佛教文化传入我国，梵文咒语被广泛应用于佛教领域。",
        "pinyin": "zy"
    },
    {
        "title": "姻缘",
        "key": "yinyuan",
        "describe": "旧时谓婚姻的缘分。 出处：《京本通俗小说·志诚张主管》：“开言成匹配，举口合姻缘。” 示例：《初刻拍案惊奇》卷五：“若不是姻缘，眼面前也强求不得的。”《老残游记》第二十回：“是前生注定事，莫错过姻缘。”柳青《创业史》第二部第三章：“我怕你把好姻缘耽搁了哩。”",
        "pinyin": "yy"
    },
    {
        "title": "欢喜",
        "key": "huanxi",
        "describe": "欢喜，梵语pramudita，巴利语 pamudita。音译波牟提陀。即接于顺情之境而感身心喜悦；亦特指众生听闻佛陀说法或诸佛名号，而心生欢悦，乃至信受奉行。中阿含卷六教化病经（大一·四六○中）：‘世尊为我说法，劝发渴仰，成就欢喜。’ 于修行之历程，有各种不同层次之欢喜。",
        "pinyin": "hx"
    },
    {
        "title": "比丘",
        "key": "biqiu",
        "describe": "比丘又作比呼，是梵语的音译，佛教指年满二十岁，受过具足戒的男性出家人，即和尚，为佛教出家“五众”之一。意译乞士（乞食）、董士、破烦恼（破恶）、除馑、净命。比丘需守二五六条戒律。然而和尚一词在佛教中实际不是每个受具足戒，乃至出家的人可以称呼的。相对应的女子称为比丘尼。沙弥是比丘的接班人，式叉摩娜（学法女） 是比丘尼的接班人。",
        "pinyin": "bq"
    },
    {
        "title": "人生八苦",
        "key": "renshengbaku",
        "describe": "人生八苦出自《涅槃经》。这八苦可以分为二类：第一类是生老病死，这是人生的自然过程之苦；第二类是忧悲恼、怨憎会、恩爱别离和所欲不得，这是主观愿望所不得满足之苦。最后归结为“五蕴盛”，“五蕴盛”指对人生的爱恋与追求，以此为苦，说明人的存在本身为苦。这样，苦就具备了普遍的性格，凡是有生命的个人，苦都是在所难免的。",
        "pinyin": "rsbk"
    },
    {
        "title": "殊胜",
        "key": "shusheng",
        "describe": "事之超绝而稀有者，称为殊胜。如吾人常赞叹极乐净土因缘殊胜，因阿弥陀佛发四十八大愿普度众生，凡有一念之善者皆可往生净土，莲花化生，实乃稀有之事。在日常生活中一般是(1) 、稍胜，略胜(2)、特别优美(3)、特别的胜境的意思。",
        "pinyin": "ss"
    },
    {
        "title": "虚空",
        "key": "xukong",
        "describe": "虚空在佛教中指一切万物本体不存在，但能感觉到。就像本来只是反色的蓝天，我们认为实有一样。因为任何物体都是由许多的微尘组成，就像原子，一直往下分……到极小微尘……再分就没了，虽然心里想可以无限分下去，但物质最终就不能再分了。也就是说极小微尘不存在，一个微尘不存在，由微尘组成的物质就不可能存在，但还会有作用。就用虚空比喻。",
        "pinyin": "xk"
    },
    {
        "title": "极乐世界",
        "key": "jileshijie",
        "describe": "极乐世界音译作苏诃缚帝、须摩提、须阿提。即指阿弥陀佛之净土。又称极乐净土、极乐国土、西方净土、西方、安养净土、安养世界、安乐国。自此世间向西而去，经过十万亿佛土之彼方即为极乐净土。关于该净土之情况，在阿弥陀经中有详细之解说，而阿弥陀佛今仍在彼处说法。",
        "pinyin": "jlsj"
    },
    {
        "title": "拜佛",
        "key": "baifo",
        "describe": "拜佛，是指到寺院对佛像虔诚的跪拜，拜佛通常有礼佛三拜的步骤，这也是表达对诸佛菩萨的礼敬、感恩，而从柔软、徐缓而安详的弯腰礼佛动作里，感受到礼佛者的安定与谦卑。",
        "pinyin": "bf"
    },
    {
        "title": "解脱",
        "key": "jietuo",
        "describe": "解脱梵语为(vimoksa)，小乘：要证得初、二、三、四果等果位，方称得上解脱，而以四果为小乘终极圆满之果地，必须断见思惑，出三界，得成阿罗汉果(梵语arhat)。大乘：要证成初地以上，乃至佛的果位，皆为解脱的境界，每一个阶位解脱的境界渐次入深，而以佛的果位是大乘佛法终极之位，必须勤修六度万行，以中道实相义而正行，破尘沙惑、破无明惑，因而证成佛道。",
        "pinyin": "jt"
    },
    {
        "title": "佛法",
        "key": "fofa",
        "describe": "佛法即佛所说之教法，包括各种教义及教义所表达之佛教真理。是让人们认识思想、摆脱思想束缚、进行自由创造的教学观照体系。佛所得之法，即缘起之道理及法界之真理等；又佛所知之法，即一切法；以及佛所具足之种种功德（十八不共法），均称佛法。",
        "pinyin": "ff"
    },
    {
        "title": "六道",
        "key": "liudao",
        "describe": "六道又作六趣。世间众生因造作善不善诸业而有业报受身，此业报受身有六个去处，被称为六道。六道是佛根据业报身所受福报大小划分的。分别为：天道、阿修罗道、人道、畜生道、饿鬼道、地狱道。六道的真实情形甚深不可言说，佛通过种种譬喻让大众对六道的各种”乐“、苦有一个直观感受 ，为如何能够离苦得乐指引方向。",
        "pinyin": "ld"
    },
    {
        "title": "沙门",
        "key": "shamen",
        "describe": "沙门又作娑门、桑门、丧门、沙门那，译曰息、息心、静志、净志、乏道、贫道等，新作室摩那拏、舍啰磨拏、室啰磨拏、沙迦懑囊，译曰功劳、勤息，劳劬修佛道之义也，又勤修息烦恼之义也。原不论外道佛徒，总为出家者之都名。意为勤息、息心、净志，是对非婆罗门教的宗教教派和思想流派的总称。沙门思潮兴起于列国时代，是与婆罗门教相对立的思想流派。",
        "pinyin": "sm"
    },
    {
        "title": "修道",
        "key": "xiudao",
        "describe": "修道，即非修道，只是假名为修道。因为不是我做主而修道，而是我无为而道自为之。任道自然运化于身中名为修道。修道是人在入定中见性直至打成一片的过程。《西方确指》觉明妙行菩萨曰：若未到铜墙铁壁，推不倒移不动处，犹未是打成一片。切莫见些影响，便即歇手。是为半途而废。必至弃其前功，毫无所益。",
        "pinyin": "xd"
    },
    {
        "title": "无我",
        "key": "wuwo",
        "describe": "“无我”梵语ana^tman 或 nir-a^tman，巴利语anattan。是佛发现五取蕴的共相之一，五蕴的共相是“无常、苦、无我”，又作非身、非我（凡夫认为心身中存在个“我”：把色、受、想、行、识是“我”，或者认为“我”在色、受、想、行、识中；而这种自我感觉，正是对身心错误认识）。",
        "pinyin": "ww"
    },
    {
        "title": "世间",
        "key": "shijian",
        "describe": "世间释义为人世间，世界上。世间一词也表达了人类居住的区域空间，也有时空的含义。《世间》包括：空间，时间，物质，能量，速度。“世间”只局限于人类居住的空间，与浩瀚的宇宙以及星系是没有关联的。佛经《百喻经·观作瓶喻》：“诸佛大龙出，雷音徧世间。”",
        "pinyin": "sj"
    },
    {
        "title": "比丘尼",
        "key": "biqiuni",
        "describe": "比丘尼，梵文 Bhikkhuni 又作苾雏尼、比呼尼、尼、除女、董女、沙门尼，俗称尼姑。满二十岁出家，受了具足戒的女子，称为比丘尼。中国第一个比丘尼是净检。在东晋升平元年（三五七年）受了具足戒，正式成了比丘尼。",
        "pinyin": "bqn"
    },
    {
        "title": "五戒",
        "key": "wujie",
        "describe": "“五戒”是中国大乘佛教中最根本的戒律，是一切佛教戒律的基础。所有在家的佛教徒都要受持五戒，所以五戒也被称为“在家戒” 　　五戒是五条戒律或行为准则。中国大乘佛教中的五戒是： 　　一不杀生，二不偷盗，三不邪淫，四不妄语，五不饮酒。 　　五戒，是佛门四众弟子的基本戒，不论出家在家皆须受持。",
        "pinyin": "wj"
    },
    {
        "title": "法相",
        "key": "faxiang",
        "describe": "“法相”是佛教术语，指诸法之相状，包含体相（本质）与义相（意义）二者。“法相”与“法身”的区别在于法相是一个包含外延与内涵的，是法的象；法身好比道的法则法身法相包含分身，分身也反包含之。",
        "pinyin": "fx"
    },
    {
        "title": "烧香",
        "key": "shaoxiang",
        "describe": "烧香，原指敬神礼佛的一种仪式。礼拜时把香点着插在香炉中，表示诚敬。有的时候，烧香是为了取其清雅而燃香，是一种中国类似插花的传统雅文化。现代社会中，烧香有时也比喻为求人办事儿请客送礼。上香以三支为宜。此表示戒、定、慧三无漏学；也表示供养佛、法、僧常住三宝。这是最圆满且文明的烧香供养。",
        "pinyin": "sx"
    },
    {
        "title": "德行",
        "key": "dexing",
        "describe": "德行在佛教中是指（一）指功德与行法。金刚针论（大三二·一七一中）：“是故戒行复修德业，名婆罗门；乃至首陀修于德行，成婆罗门。”（二）指具足功德之行法，即修三学、六度者。仁王经卷上（大八·八二五上）：“有十亿七贤居士德行具足。”",
        "pinyin": "dx"
    },
    {
        "title": "手淫",
        "key": "shouyin",
        "describe": "手淫虽然没有危害到别人，但是也是邪淫的一种。手淫是也是邪淫的一种，原因如下：　　亵渎神灵。举头三尺有神灵！学佛的人都知道，每个人身上都有护法神。一个人越正直、善良。龙天护法维护他的就越多。",
        "pinyin": "sy"
    },
    {
        "title": "净土",
        "key": "jingtu",
        "describe": "净土，诸佛佛国清净国土。一般专指阿弥陀佛国土。其国众生皆行十善，身口意三业清净，无有众苦，但受诸乐。故又称极乐国土。其他诸佛佛国也有净土，不过其土中菩萨最终都将生往极乐净土。如有饿鬼畜生人天四道众生得闻阿弥陀佛名号，心中无疑，并向往之愿生彼国，当修十善业以为根本，勤饮八功德水，命终即可脱离四道，于彼国七宝池莲花中分别化生。",
        "pinyin": "jt"
    },
    {
        "title": "生死",
        "key": "shengsi",
        "describe": "生死，广义解释生死，可分为分段生死、变易生死二种。在佛教中也有两种解释。一种是指有情的出生入死：梵语、巴利语皆作ja^ti-mara-na。即生、老、病、死四相中的最初与最后。还有一种是指生死轮回：梵语、巴利语皆作sam!sara，意译轮回、生死。相对于涅盘而言。即凡夫由于有漏或无漏的业因而生死相续，流转不止。",
        "pinyin": "ss"
    },
    {
        "title": "天人",
        "key": "tianren",
        "describe": "天人又称天众，音译为提婆，指住于欲界及色界诸天界之有情。因此也称作“人天”，因为人间与天界同属于善处，须无犯重罪戒者方能生于此间。持守五戒能于后世保有人身，不堕恶道之中；若再加行十善业者，死后将生欲界天，成为欲界天人。若再修禅定者，则可往生色界天，成为色界天人。",
        "pinyin": "tr"
    },
    {
        "title": "世尊",
        "key": "shizun",
        "describe": "“世尊”是对佛陀的尊称，佛的十号之一，一个三千大千世界便有一尊佛住世，佛是最尊贵的，所以用世尊来称呼佛，又含有自在、炽盛、端严、名称、尊贵、吉祥等六义，又称有德、有名声等，为世间最尊贵的人。阿弥陀佛和释迦牟尼佛都可称为“世尊”。我们在佛经上常见的“世尊”是指释迦牟尼佛。",
        "pinyin": "sz"
    },
    {
        "title": "梵音",
        "key": "fanyin",
        "describe": "梵音是指佛的声音，佛的声音有五种清净相，即正直、和雅、清彻、深满、周遍远闻，为佛三十二相之一。是梵语的发音名称，又作梵声。佛菩萨之音声，即佛报得清净微妙之音声，亦即具四辩八音之妙音。佛三十二相中即有梵音相。据大智度论卷四，佛之梵音如大梵天王所出之声，有五种清净之音：(一)甚深如雷。(二)清彻远播，闻而悦乐。(三)入心敬爱。(四)谛了易解。(五)听者无厌。",
        "pinyin": "fy"
    },
    {
        "title": "妄念",
        "key": "wangnian",
        "describe": "妄念，拼音：wàng niàn，指一切自己挥之不去的想法，但是又要必须依靠别人（物）才能完成（实现）的念头（想法）。1、指不切实际或不正当的念头。2、虚妄的意念，亦即凡夫贪恋六尘境界的心。人的“意识”是前五识的总管。如果说色识﹑声识﹑香识﹑味识﹑触识只是对色声香味触加以分别，那么“意识”就是对色声香味触的喜好加以判断和裁定。所以一切妄念产生于“意识”。因此说，人对物质享受的追求是贪欲之心，是妄念。",
        "pinyin": "wn"
    },
    {
        "title": "信仰",
        "key": "xinyang",
        "describe": "信仰指对某种主张、主义、宗教或对某人、某物的信奉和尊敬，并把它奉为自己的行为准则；信仰带有情感体验色彩，特别体现在宗教信仰上，极致甚至会丧失理智。",
        "pinyin": "xy"
    },
    {
        "title": "护法",
        "key": "hufa",
        "describe": "保护、维持正法的意思。传说佛陀派请四大声闻、十六阿罗汉等护持佛法。 　　又梵天、帝释天、四天王、十二神将、二十八部众等善神听闻佛陀说法后，皆誓愿护持佛法，此等诸神总称为护法神，或称护法善神。 　　此外，人世间的帝王及诸檀越，都是保护佛法的人，亦称之为护法。所以今日的佛教界，对于虔敬三宝，护持佛教的在家居士，都以护法称之。",
        "pinyin": "hf"
    },
    {
        "title": "闭关",
        "key": "biguan",
        "describe": "闭关，指闭塞关口，比喻不跟外界往来。佛教用语，指僧人独居一处，静修佛法，不与任何人交往，满一定期限才外出。语出《易·复》：“先王以至日闭关，商旅不行，后不省方。”",
        "pinyin": "bg"
    },
    {
        "title": "弟子",
        "key": "dizi",
        "describe": "弟之子在中古时期称为弟子，弟子在当时是常用的宗亲称谓词之一。到唐代以后开始广泛地称为侄。另外，弟子，也指侄女，即弟弟的女儿。在现代一般指徒弟，如你对某种技艺有兴趣，想要学习，那你就需要寻找明师，以弟子的身份拜师学艺。在佛教中一般是指信众。",
        "pinyin": "dz"
    },
    {
        "title": "戒定慧",
        "key": "jiedinghui",
        "describe": "戒定慧（佛教解释）戒定慧合称为三学，即三项训练。 佛陀教导我们需要培育的就是这三学：1 修戒——完善道德品行；2 修定——致力于内心平静；3 修慧——培育智慧。戒定慧三学是次第的关系，即循序渐进的关系。先要完善自己的品德；有了品德，就应尝试让自己的心平静；内心平静了，应进一步提升智慧。",
        "pinyin": "jdh"
    },
    {
        "title": "念佛",
        "key": "nianfo",
        "describe": "佛藏经念佛品云，佛告舍利弗。若有比丘教余比丘。汝当念佛念法念僧念戒念施念天。唯爱涅槃毕竟清净。如是教者名为邪教。谓是正教而是邪教。舍利弗。如是教者名为恶知识。是人名为诽谤于我助于外道。亦为他人说邪道法。舍利弗。如是恶人我乃不听受一饮水以自供养。舍利弗。是念佛法断语言道过出诸念。不可得念是名念佛。舍利弗。一切诸念皆寂灭相。随顺是法。此即名为修习念佛。不可以色念佛。何以故。念色取相贪味为识。无形无色无缘无性。是名念佛。是故当知。无有分别无取无舍。是真念佛。",
        "pinyin": "nf"
    },
    {
        "title": "说法",
        "key": "shuofa",
        "describe": "说法在佛教中即为讲授佛法、现身说法。南朝梁慧皎《高僧传·译经中·鸠摩罗什》中写道：“ 什 以说法之暇，乃寻访外道经书。”《西游记》第五八回：“都到七宝莲台之下，各听如来说法。”汤用彤 《汉魏两晋南北朝佛教史》第二分第十九章：“盖佛为提谓、波利 二人说法，全在劝善种福。” 中也提到“说法”。",
        "pinyin": "sf"
    },
    {
        "title": "一贯道",
        "key": "yiguandao",
        "describe": "一贯道起源于明清时期，属于五教合一的多神教，也是中华人民共和国成立前在全国范围内流传势力最大、活动最为猖獗、危害非常严重的反动会道门组织，1950年在中国大陆被铲除，其在台湾的分支到21世纪初已发展成一个宗教信仰组织。",
        "pinyin": "ygd"
    },
    {
        "title": "僧侣",
        "key": "senglv",
        "describe": "僧侣，指和尚，也借称古印度婆罗门教，中世纪天主教等的修道者。",
        "pinyin": "sl"
    },
    {
        "title": "禅定",
        "key": "chanding",
        "describe": "禅，为梵语dhya^na之音译；定，为梵语sama^dhi 之意译。禅与定皆为令心专注于某一对象，而达于不散乱之状态，或谓禅为dhya^na 之音译，定为其意译，梵汉并称作禅定。又色界之四禅与无色界之四定，合称四禅八定。法华经 提婆达多品与坐禅 同义。五家参详要路门附录（大八一·六一五上）：‘夫修禅定者，先须厚敷蒲团，结跏趺坐。’ 　　禅定是佛教译语中特别的译法，「禅」，这是印度梵语禅那的简称，其义为「定」、「思维修」、「功德丛林」等，故「禅定」是华、梵兼称，这是从其名称上来解说的。",
        "pinyin": "cd"
    },
    {
        "title": "宿命",
        "key": "suming",
        "describe": "宿命（佛教解释）　　宿命，指前世的命运。佛家认为今生的命运是由前世行为的善恶决定的。基本解释　　[predestinate] 指前世的命运。　　沙门问佛,以何因缘,得知宿命,会其至道?——《四十二章经》十三。引证解",
        "pinyin": "sm"
    },
    {
        "title": "圆满",
        "key": "yuanman",
        "describe": "圆满有周遍充足，无所缺减之意。若指十八圆满而言，称十八圆满，或十八具足；谓诸佛（报身佛）所受用之国土，具足十八种功德事，即：显色圆满、形色圆满、分量圆满、方所圆满、因圆满、果圆满、主圆满、辅翼圆满、眷属圆满、住持圆满、事业圆满、摄益圆满、无畏圆满、住处圆满、路圆满、乘圆满、门圆满、依持圆满等。",
        "pinyin": "ym"
    },
    {
        "title": "生活",
        "key": "shenghuo",
        "describe": "生活是指人类生存过程中的各项活动、所有的日常活动和经历的总和，范畴较广，一般指为幸福的意义而存在。生活实际上是对人生的一种诠释。广义上指人的各种活动，包括日常生活行动、学习、工作、休闲、社交、娱乐等职业生活，个人生活、家庭生活和社会生活以及玩味生活。为了更好的生活，我们每个人都必须付出努力。",
        "pinyin": "sh"
    },
    {
        "title": "相由心生",
        "key": "xiangyouxinsheng",
        "describe": "相由心生是指人的仪容外表总受心灵思想因素的影响。换言之，人的思想感情心灵情志必然表现在人的仪表上。也即一个人的精神世界虽是内在的，不可见的；但实际也给人外在的直观感受。比如一个小偷流氓，外表给人猥琐的感觉，是丑；一个内心善良帮人助人的人，外表给人阳光温暖的感觉，是美了。",
        "pinyin": "xyxs"
    },
    {
        "title": "婆罗门",
        "key": "poluomen",
        "describe": "印度社会洋溢着浓郁的宗教气氛，祭司被人们仰视如神，称为“婆罗门”。“婆罗门”源于“波拉乎曼”（即梵），原意是“祈祷”或“增大的东西”。祈祷的语言具有咒力，咒力增大可以使善人得福，恶人受罚，因此执行祈祷的祭官被称为“婆罗门”。婆罗门是祭司贵族。婆罗门阶级主要掌握神权，占卜祸福，垄断文化和报道农时季节，在社会中地位是最高的。",
        "pinyin": "plm"
    },
    {
        "title": "我执",
        "key": "wozhi",
        "describe": "我执，小乘佛法认为这是痛苦的根源，是轮回的原因。 　　“我见”是第六识所起的认知，而我执是第七识所起，所以“我见”不是“我执”。“我见”证得初果须陀洹后即可破除，而细微的“我执”则须成就佛果后才可彻底断除。我执可以说是无明的同义语，一般以内容分类，为人我执、法我执；以缘起分类，名分别我执、俱生我执。佛教中指对一切有形和无形事物的执着，指人类执着于自我的缺点。",
        "pinyin": "wz"
    },
    {
        "title": "色界",
        "key": "sejie",
        "describe": "佛教术语。天道的一部分。 　　佛根据世间人（病中佛）功德多寡和妄心善恶将世间人划分为六道。其中天道又划分为欲界天、色界天、无色界天。六道又可根据欲、色、无色划分为三界。",
        "pinyin": "sj"
    },
    {
        "title": "命运",
        "key": "mingyun",
        "describe": "命运，是指事物由定数与变数组合进行的一种模式，命与运是两个不同的概念。命为定数，指某个特定对象；运为变数，指时空转化。命与运组合在一起，即是某个特定对象于时空转化的过程。运气一到，命运也随之发生改变。",
        "pinyin": "my"
    },
    {
        "title": "痛苦",
        "key": "tongku",
        "describe": "痛苦是一种广泛的而复杂的人类感受，意指会让人经验性地感到不舒服、不快乐等负面情绪的任何事物，它通常与受伤，或会让你受到伤害的威胁连结在一起。指人心理感到难过或不愉快而表现出来的一种心理或使身体或精神感到非常难受的事。",
        "pinyin": "tk"
    },
    {
        "title": "十二因缘",
        "key": "shieryinyuan",
        "describe": "十二因缘也称十二缘起支是佛教重要基础理论之一，它是释迦牟尼佛即佛陀自修自证得到的真理，其指从“无明”到“老死”这一过程的十二个环节，因果相随，三世相续而无间断，使人流转于生死轮回大海，而不能得以出离，佛教将世间一世因果扩至三世因果即可解释关于社会中同类不相应现象，将一切串联其中以使人产生敬畏之心，达到超自然的，向往解脱生死心灵寄托。",
        "pinyin": "seyy"
    },
    {
        "title": "意识",
        "key": "yishi",
        "describe": "意识无形无色，是心非物，故意识心有时又称觉知心，主要功能是觉知，凡是对内、外尘境从开始的了知、了别及其后之分析、思维、计划、整理、记忆等等都叫意识，是意识心的功能，故意识涵盖甚广。意识的出现必须要有功能健全的眼、耳、鼻、舌、身等五根去接触相对应的色、声、香、味、触等五尘，以及意根接触法尘(五尘与法尘合称为六尘)。",
        "pinyin": "ys"
    },
    {
        "title": "三皈依",
        "key": "sanguiyi",
        "describe": "也做皈依三宝 一皈依佛。 二皈依法。 三皈依僧。",
        "pinyin": "sgy"
    },
    {
        "title": "妄想",
        "key": "wangxiang",
        "describe": "指以虚妄颠倒之心分别诸法之相状。亦即由于心之执着，而无法如实知见事物，遂产生谬误之分别。又称妄想分别。妄念里头最严重的就是我执。因为五蕴皆空、诸法无我。旧译《华严经》卷五〈如来光明觉品〉云（大正9·424c）︰‘一切诸世间，皆从妄想生；是诸妄想法，其性未曾有。’《观普贤菩萨行法经》云（大正9·393b）︰‘一切业障海，皆从妄想生，若欲忏悔者，端坐念实相。’",
        "pinyin": "wx"
    },
    {
        "title": "五欲",
        "key": "wuyu",
        "describe": "在佛学中指财、色、名、食、睡五种欲望。",
        "pinyin": "wy"
    },
    {
        "title": "神通",
        "key": "shentong",
        "describe": "神通是佛教术语，梵文的意译。神是指心念，通指通达。对于神通，有误解的人非常多。而佛弟子尤其是大乘佛弟子误解其义尤其障碍修习。因为佛讲法的大方便很多初学理解不了，往往从字面意思理解佛经。神通，即可令己心念如意而行，相互通达。若无神通，则无有方便。无有方便则不能摄受六道众生，令众欢喜修行正法。",
        "pinyin": "st"
    },
    {
        "title": "三昧",
        "key": "sanmei",
        "describe": "三昧（sānmèi） 一词，来源于梵语samadhi的音译，意思是止息杂念，使心神平静，是佛教的重要修行方法。借指事物的要领，真谛，教内外对此词皆有不同的论述和解释。 其有一般和特殊两层含义：它可以指通常的集中思虑的能力，或者指修习所得的，发展了的集中力。从而，它也就变成了可以使禅定者进入更高境界并完全改变生命状态的神秘力量。",
        "pinyin": "sm"
    },
    {
        "title": "经忏",
        "key": "jingchan",
        "describe": "(1) 指道教、佛教经文和忏悔文。元·杨暹《西游记》第四出：“七岁入寺读书，十五岁通经忏。” 清·李渔《奈何天·逃禅》：“替我把经忏、蒲团、木鱼、钟罄，都摆列起来，再把新制的衲衣、道冠，都取出来，待我更换过了，好虔诚礼佛。” 清·钱泳《履园丛话·杂记下·释道诗》：“自幼披剃，即读经忏，谁能以经史子集贯於胸中哉！” 　　(2) 指请道士或僧人念经拜忏、祈福超生的仪式。元·关汉卿《蝴蝶梦》第三折：“母亲，我有一本《孟子》，卖了替父亲做些经忏。”",
        "pinyin": "jc"
    },
    {
        "title": "善恶",
        "key": "shane",
        "describe": "善恶指善与恶。若再加上无记，则合称为“三性”。一般来讲，善指顺理，恶指违理。然于经论中有多种不同说法，依成唯识论卷五之意，能顺益此世、他世之有漏与无漏行法为善；反之，于此世、他世有违损之有漏行法为恶。其善恶之分际，在顺益与违损之差别。且善恶二者皆须贯串此世与他世，否则即为无记。",
        "pinyin": "se"
    },
    {
        "title": "健康",
        "key": "jiankang",
        "describe": "健康是指一个人在身体、精神和社会等方面都处于良好的状态。健康包括两个方面的内容：一是主要脏器无疾病，身体形态发育良好，体形均匀，人体各系统具有良好的生理功能，有较强的身体活动能力和劳动能力，这是对健康最基本的要求；二是对疾病的抵抗能力较强，能够适应环境变化，各种生理刺激以及致病因素对身体的作用。",
        "pinyin": "jk"
    },
    {
        "title": "正法",
        "key": "zhengfa",
        "describe": "正法是梵文Saddarma的意译。谓正确、真实的道理。指佛所说的教法而言。又称白法（s ukla-dharma）、净法或妙法。《杂阿含经》卷二四：“出兴于世，演说正法。” 唐 玄奘 《大唐西域记·窣禄勤那国》：“舍邪见，受正法，改过自新，愿奉教诲。” 鲁迅 《集外集·题记》：“尊者造论，虽以正法为心，譬故事于树叶，而言必及法，反多拘牵。”",
        "pinyin": "zf"
    },
    {
        "title": "三藏",
        "key": "sanzang",
        "describe": "三藏又作三法藏。藏，梵语pit!aka，意谓容器、谷仓、笼等。印度佛教圣典之三种分类为：经藏、律藏、论藏。人物是玄奘法师。佛教经典的总称。分经、律、论三部分。经，总说根本教义；律，记述戒规威仪；论，阐明经义。通晓三藏的僧人，称三藏法师，如唐玄奘称唐三藏。南朝·梁·沉约《内典序》：“义隐三藏之外，事非二乘所窥。”",
        "pinyin": "sz"
    },
    {
        "title": "大千世界",
        "key": "daqianshijie",
        "describe": "大千世界，佛教用语，世界的千倍叫小千世界，小千世界的千倍叫中千世界，中千世界的千倍叫大千世界。后指广大无边的人世。佛教说一日月照四天下，覆六欲天、初禅天，为一“小世界”；一千个小世界覆一二禅天，为一“小千世界”；一千个小千世界覆一三禅天，为一“中千世界”；一千个中千世界覆一四禅天，为一“大千世界”。",
        "pinyin": "dqsj"
    },
    {
        "title": "法眼",
        "key": "fayan",
        "describe": "法眼是五眼里面的一个仅次于佛眼的层次。在法眼层次的人们，同时具有天眼和慧眼的功能，不仅仅能够看见事实，也能看清其来龙去脉，同时本身的能量够大，还能够介入事物的根本结构里面，去造成事实的改变。",
        "pinyin": "fy"
    },
    {
        "title": "朝圣",
        "key": "chaosheng",
        "describe": "朝圣指教徒朝拜圣地的宗教活动。朝圣是一项具有重大的道德或灵性意义的旅程或探寻。通常，它是一个人前往自己信仰的圣地或其它重要地点的旅程。许多宗教认为特定地方有灵性重要性。常见的教徒归属的宗教有（排名不分先后）：佛教、天主教、伊斯兰教、基督教（新教）、犹太教等。（注：中国五大宗教中的基督教指的是新教，下文中的宗教圣地是三大教派共同的圣地，所以下文中基督教指的是基督宗教包括天主教、东正教、新教。）",
        "pinyin": "cs"
    },
    {
        "title": "加持",
        "key": "jiachi",
        "describe": "梵语adhis!t!ha^na，加附佛力于软弱之众生，而任持其众生也。又佛所加之三密力，于众生之三业任持也。又祈祷者，为加附佛力于信者，使信者受授其佛力，故祈祷直曰加持。演密钞一曰：‘地瑟娓曩此云加持，通三义也。或云忆念，唯意密故。’同二曰：‘言加持者，加谓加被，持谓任持。佛以上神力，加被任持现前大众，得见如是不思议庄严境界。’即身成佛义曰：‘加持者，表如来大悲与众生信心。佛日之影，现众生心水曰加，行者心水能感佛日曰持。’八十华严经六曰：‘佛所加持无有边。’",
        "pinyin": "jc"
    },
    {
        "title": "无畏",
        "key": "wuguo",
        "describe": "佛教语。指佛于大众中说法泰然无所畏之德。 　　《法苑珠林》卷八一：“我能飞行游虚空，已过汝界心无畏。”许地山《缀网劳蛛·命命鸟》：“愿勇猛无畏阿弥陀 ，俯听恳求接引我。”",
        "pinyin": "ww"
    },
    {
        "title": "杀生",
        "key": "shasheng",
        "describe": "杀生，指宰杀牲畜、家禽等生物。佛家指杀害一切生灵。语出《管子·海王》：“﹝ 桓公 曰：﹞‘吾欲籍於六畜。’ 管子对曰：‘此杀生也。’”",
        "pinyin": "ss"
    },
    {
        "title": "超度",
        "key": "chaodu",
        "describe": "超度，指凌驾、超越；佛教或道教指藉由诵经或作法事，帮助死者脱离三恶道的苦难。见元 关汉卿《鲁斋郎》第四折：“你做什么好事？超度谁？”",
        "pinyin": "cd"
    },
    {
        "title": "报应",
        "key": "baoying",
        "describe": "指有施必有报，有感必有应，故现在之所得，无论祸福，皆为报应。如行放生、布施、梵行等善业，即因种善因而招感善报；反之，行杀生、偷盗、邪淫等恶业，即因种恶因而招感恶报。",
        "pinyin": "by"
    },
    {
        "title": "苦海",
        "key": "kuhai",
        "describe": "苦海，一般比喻无穷的苦境。佛教用语，佛教指尘世间的烦恼和苦难。如：~无边，回头是岸！苦海的拼音：kǔhǎi。（1）道教佛教指尘世间的烦恼和苦难。南朝梁武帝 《净业赋》：“轮回火宅，沉溺苦海，长夜执固，终不能改。”",
        "pinyin": "kh"
    },
    {
        "title": "常住",
        "key": "changzhu",
        "describe": "常住是佛教教义名词。意谓恒常永住，不会变异毁灭。即，法无生灭变迁称作常住。《瑜伽师地论》卷六：“若一切时无变异相、若一切种无变异相、若自然无变异相、若自他无变异相，当知是常住相”。所以，一切“无变异”的现象，皆名“常住相”。",
        "pinyin": "cz"
    },
    {
        "title": "自性",
        "key": "zixing",
        "describe": "佛教语。指诸法各自具有的不变不灭之性。 　　自性即人们心中本来就有、本自具足的光明性智，是人的精神本体(法身)。佛教里的毗卢遮那佛就是法身佛，它所代表的就是自性中的光明智慧，所以又称为大日如来佛。我们每个人的心中都有一尊大日如来佛，都有光明的法身，有一个心中的太阳。",
        "pinyin": "zx"
    },
    {
        "title": "六波罗蜜",
        "key": "liuboluomi",
        "describe": "六波罗密华译六度，即檀那（布施）、尸罗（持戒）、羼提（忍辱）、毗离耶（精进）、禅那（禅定）、般若（智慧）。见六度。",
        "pinyin": "lblm"
    },
    {
        "title": "随喜",
        "key": "suixi",
        "describe": "随喜其实是一种赞同别人而不嫉妒别人的一种礼仪习惯，即当别人什么做得好的时候，你要赞扬他，从而向他学习，相互鼓励同时使自己也得到提高。随喜在佛教中是指见到他人行善而生欢喜之意、犹言因别人欣喜而欣喜、犹言赞助他人行善事，谓欢喜之意随瞻拜佛像而生。简而言之就是指见人做善事而乐意参加，泛指随着众人参加集体送礼等。旧指游览寺院；随人游玩等。",
        "pinyin": "sx"
    },
    {
        "title": "转生",
        "key": "zhuansheng",
        "describe": "转生就是万物死亡（意外死亡）后，先有灵魂再生另一个躯体再找个母体繁育后代，梦有些预示丈夫因、父母因、前世因，才会重新做人。做到不再有梦境。",
        "pinyin": "zs"
    },
    {
        "title": "法事",
        "key": "fashi",
        "describe": "法事又名“佛事”。佛教举行的诵经、供佛、施斋僧尼等仪式。法显《佛国记》：“道俗云集，烧香然灯，种种法事，昼夜不息。”巫师、术士作法，捉妖驱邪。《二十年目睹之怪现状》第三十一回：“待他作了法事，请了上界真神，把金银化成仙丹，用开水冲服，才能见效。",
        "pinyin": "fs"
    },
    {
        "title": "寿命",
        "key": "shouming",
        "describe": "所谓寿命，是指从出生经过发育、成长、成熟、老化以至死亡前机体生存的时间，通常以年龄作为衡量寿命长短的尺度。由于人与人之间的寿命有一定的差别，所以，在比较某个时期，某个地区或某个社会的人类寿命时，通常采用平均寿命。",
        "pinyin": "sm"
    },
    {
        "title": "生气",
        "key": "shengqi",
        "describe": "生气一是指活力，生命力，生机；二是指发怒，因不合心意而不愉快。生气在日常生活中是一种不健康的心理情绪。俗话说“气大伤身”，但很少有人能在怒气冲冲的时候做到心平气和。生气给身体带来的伤害可是全方位的。经常听人说“气饱了”，这是因为愤怒的情绪会使胃肠中的血流量减少，蠕动减慢，食欲变差，严重时会导致胃溃疡。",
        "pinyin": "sq"
    },
    {
        "title": "正见",
        "key": "zhengjian",
        "describe": "正见指正确的知见。即能解知世间出世间因果，如实审虑诸法性相之有漏无漏的智慧。相当于现证法性的般若。为八正道及十善之一，乃邪见的对称。宗萨蒋扬钦哲仁波切著有同名书作《正见》。",
        "pinyin": "zj"
    },
    {
        "title": "化身",
        "key": "huashen",
        "describe": "化身，在各宗教中，通常指神或精灵等超自然力量，通过某种方式，以人类或动物的形态，实体化出现在人类世界之中。在宗教文献中，神明由天堂来到人间，通常以化身方式出现，他的本体仍然在天堂或灵界，出现在人间的形象并非本体，而是本体的投射或变化。",
        "pinyin": "hs"
    },
    {
        "title": "礼拜",
        "key": "libai",
        "describe": "在汉传佛教礼节中有三种礼拜，即拜佛、拜经和拜舍利。对于此三种礼拜，不论是拜佛、拜经、拜舍利，都应怀有至诚之心，在礼拜终了之时，还要发愿，普度苦海众生，或发愿往生，或发愿无病，若不发愿则不能感应道交。这正印证了中国古言：人有善愿，天必从之。",
        "pinyin": "lb"
    },
    {
        "title": "佛光",
        "key": "foguang",
        "describe": "佛经中说，佛光是释迦牟尼眉宇间放射出来的光芒。佛光还指一种光的自然现象，当阳光照在云雾表面，经过衍射和漫反射作用形成佛光的自然奇观。阳光将人影投射到云彩上，云彩中细小冰晶与水滴形成独特的圆圈形彩虹。",
        "pinyin": "fg"
    },
    {
        "title": "受戒",
        "key": "shoujie",
        "describe": "佛教徒通过一定的宗教仪式接受戒律。",
        "pinyin": "sj"
    },
    {
        "title": "自觉",
        "key": "zijue",
        "describe": "自觉 为巴利语buddha的直译，意为是不通过老师指导而自己觉悟了一切诸法者，简称自觉者、佛陀。",
        "pinyin": "zj"
    },
    {
        "title": "教化",
        "key": "jiaohua",
        "describe": "敎化，通过上行而化成以下。 　　敎，上所施下所敩（效）也；化，敎行於上，化成於下也。 　　中国传统敎化，分文化和武化相融合。文化以虚，武化以实；虚由实生，实仗虚行。以文载道，以武入道；敎行於上，化成於下也。",
        "pinyin": "jh"
    },
    {
        "title": "夫妻",
        "key": "fuqi",
        "describe": "即人类只有如此才美好的人生形态，是指生理成熟的男人和女人以婚姻为纽带结为一体的各自以自己所能无条件帮助和成就对方需要的家庭主要角色关系，男人叫丈夫，女人叫妻子。夫妻一旦结为一体，就自然形成有次序的家庭角色关系。若非一方包容和隐忍，夫妻关系就名存实亡甚至解体。夫妻双方各自只有自觉分享自己所有、帮助和成就对方需要的义务，没有要求对方按照自己期望满足自己需要和做对方行为判官的权力。",
        "pinyin": "fq"
    },
    {
        "title": "闻思修",
        "key": "wensixiu",
        "describe": "修学佛法的三大次第。闻，谓听闻佛法，包括研读佛典、听讲经说法等，由此可知晓佛法，得“闻慧”。次则由闻而思，思，谓对所闻法思索理解，由此得“思慧”。次则依思慧而修行，由修行证得“修慧”，以修慧断尽烦恼，证得道果。由闻而思，由思而修，由修而证，乃修学通途。",
        "pinyin": "wsx"
    },
    {
        "title": "不二法门",
        "key": "buerfamen",
        "describe": "不二法门（bu er fa men)，佛家用语，指平等而无差异之至道，今用以称独一无二的门径、方法。法门：指修行入道的门径。原指不靠言语传授，只靠内心思考求得大彻大悟的修道门径。后指最好的或独一无二的方法。 　　语本《维摩诘经·入不二法门品》：“如我意者，於一切法无言无说，无示无识，离诸问答，是为入不二法门。” 唐裴漼《少林寺碑》：“ 空心 、 元粹 、 惠性 、 淹远 ，传不二法门，有甚深道业。”",
        "pinyin": "befm"
    },
    {
        "title": "疏文",
        "key": "shuwen",
        "describe": "从狭义来讲，疏文是各种法会、法事之上，凡人祈求于神仙的文函，是沟通仙凡之间的桥梁。 　　“疏文”一词，亦有称之为“文疏”、“表文”、“天地疏文”等。疏文可细分为“章表”、“祝文”、“祝章”、“哀章”、“表文”、“吊词”等等。正式的疏文格式，一般都是法师自用秘藏不传，祈望大家皆能借助各种专用疏文开运转运、祈福求财、请神送佛！",
        "pinyin": "sw"
    },
    {
        "title": "如法",
        "key": "rufa",
        "describe": "契合于法理的意思。指随顺佛所说的教法而不违背。",
        "pinyin": "rf"
    },
    {
        "title": "着相",
        "key": "zhuoxiang",
        "describe": "着相是一个佛教术语，意思是执着于外相、虚相或个体意识而偏离了本质。“相”指某一事物在我们脑中形成的认识，或称概念。它可分为有形的（可见的）和无形的（也就是意识）。",
        "pinyin": "zx"
    },
    {
        "title": "甘露",
        "key": "ganlu",
        "describe": "甜美的雨露，晓枝滴甘露，味落寒泉中。",
        "pinyin": "gl"
    },
    {
        "title": "白骨观",
        "key": "baiguguan",
        "describe": "白骨观是佛家修持法之一，为佛教五门禅法之一种，通常由不净观、白骨观、白骨生肌和白骨流光四步组成。主要的目的是息灭对色身的贪恋。",
        "pinyin": "bgg"
    },
    {
        "title": "四谛",
        "key": "sidi",
        "describe": "四谛，又作四圣谛。谛，意为真理或实在。四谛即苦谛、集谛、灭谛和道谛。「缘起」是宇宙人生一切万法生灭变异的定律，佛陀因证悟「缘起」而成佛，但因缘起深奥难解，为使尚未起信的众生免于畏怯，所以佛陀在初转法轮时，特以「四圣谛」来说明众生生死流转以及解脱之道的缘起道理，进而激发众生厌苦修道的决心。因此，「缘起」是佛陀自证成佛的「自受用」，「四圣谛」则是「他受用」之始。",
        "pinyin": "sd"
    },
    {
        "title": "无心",
        "key": "wuxin",
        "describe": "无心（佛教解释）　　(一)有多种含义：(一)指离妄念之真心。非谓无心识，而系远离凡圣、粗妙、善恶、美丑、大小等之分别情识，处于不执着、不滞碍之自由境界。宗镜录卷八十三（大四八·八七五下）：‘若不起",
        "pinyin": "wx"
    },
    {
        "title": "真言",
        "key": "zhenyan",
        "describe": "真言，梵语mantra。音译曼怛罗、曼荼罗。又作陀罗尼、咒、明、神咒、密言、密语、密号。即真实而无虚假之语言之意。或又指佛、菩萨、诸天等的本誓之德，或其别名；或即指含有深奥教法之秘密语句，而为凡夫二乘所不能知者。广义言之，不但以文字、言语表示之密咒者称为真言，乃至法身佛之说法，亦均为真言。",
        "pinyin": "zy"
    },
    {
        "title": "出家",
        "key": "chujia",
        "describe": "出家（佛教解释）　　出家，是指离开亲人、家庭、事业这样的世俗世界，到道观里做道士，或到寺院里做僧尼（也就是俗说的尼姑，和尚）。 一般出家后的人除了每天得吃斋念佛，同时要戒掉七情六欲（也就是不能娶妻",
        "pinyin": "cj"
    },
    {
        "title": "圆融",
        "key": "yuanrong",
        "describe": "圆融一词，最早为天台宗所常用，署名慧思大师所著的《大乘止观》中，论述“自性圆融”、“圆融无二”、“圆融无碍法界法门”。智者《观音玄义》、《法华玄义》等著述中，多次出现“法界圆融”、“三谛圆融”。圆融在华严宗哲学中更显重要，有“六相圆融”、“圆融行布”、“三种圆融”等说法。禅宗、真言、净土等诸宗著述中，也常见到圆融之说。",
        "pinyin": "yr"
    },
    {
        "title": "虚云",
        "key": "xuyun",
        "describe": "虚云禅师（1840--1959），籍湖南湘乡人，生于泉州，俗姓萧，名古岩，字德清，六十岁后改字幻游，号虚云，乃近代“一身而系五宗法脉”之禅宗大德。",
        "pinyin": "xy"
    },
    {
        "title": "孝心",
        "key": "xiaoxin",
        "describe": "孝心是对双亲长辈孝敬的心意，是中国孝道文化的核心，是祖先崇拜的文化内涵。古人云，百善孝为先。一个人如果连生养自己的父母都不孝敬，那么他的为人就可想而知了。",
        "pinyin": "xx"
    },
    {
        "title": "刹那",
        "key": "chana",
        "describe": "佛教经典《仁王经》中提到：“一弹指六十刹那，一刹那九百生灭”，算得事相的生成消灭率为每秒216,000次，或说每次生灭约4 6微秒；和目前科技所能达的飞秒时间尺度相比，或者和物理理论上真空涨落的时间尺度相比，也算是相当大的。一些佛教界人士认为《仁王经》的说法是释迦牟尼的“方便说”，不是“真实说”。",
        "pinyin": "cn"
    },
    {
        "title": "净土法门",
        "key": "jingtufamen",
        "describe": "净土法门，是指修持往生佛国净土的法门，具体实施起来就是每天念 “南无阿弥陀佛”，一向专念，乘佛愿力，往生极乐世界净土。",
        "pinyin": "jtfm"
    },
    {
        "title": "信心",
        "key": "xinxin",
        "describe": "信心是指相信自己的愿望或预料一定能够实现的心理。",
        "pinyin": "xx"
    },
    {
        "title": "佛性",
        "key": "foxing",
        "describe": "佛性，和法性、实相、如来藏等概念，义一而名异。《大乘玄论》卷三称：“经中有名佛性、法性、真如、实际等，并是佛性之异名。”《涅盘经》也说“佛性有种种名，于一佛性，亦名法性、涅盘，亦名般若、一乘，亦名首楞严三昧、师子吼三味”。",
        "pinyin": "fx"
    },
    {
        "title": "内观",
        "key": "neiguan",
        "describe": "内观（毗婆舍那，Vipassana）在印度巴利语中，意思是观察如其本然的实相。是印度最古老的禅修方法之一，在长久失传之后，两千五百多年前被释迦牟尼佛重新发现。",
        "pinyin": "ng"
    },
    {
        "title": "学佛",
        "key": "xuefo",
        "describe": "学佛，意为修习佛法。佛教以佛、法、僧三宝一体，为求证“人能究竟解脱诸苦、烦扰和生老病死轮回之法”。以出离心、断恶、行善、修福、修慧、自利利他、觉行合一、解脱、往生净土、慈悲普渡众生为一切众生学佛根本目标。学佛的主流为：僧人（比丘、沙门、和尚）、尼姑（比丘尼、沙门尼）在佛学院教导的内容，总称为出家众。",
        "pinyin": "xf"
    },
    {
        "title": "爱情",
        "key": "aiqing",
        "describe": "爱情分类，第一种分类，爱情情感，愿望，欲望等（形而下的，受主观改变的）。爱情伦理关系，爱情承诺关系（形而上的，产生于主观超越主观的）。 　　爱情伦理关系的理论奠基人是曹菁先生，爱情有时也指爱情伦理关系。 　　第二种分类，男女间的爱情（也包括同性）。以及其它如爱国，父爱，母爱等等。",
        "pinyin": "aq"
    },
    {
        "title": "真如",
        "key": "zhenru",
        "describe": "真如即非真如，假名真如，真如无我，无我一切皆真如。 　　真如者，非实非虚，非真非妄，非有非无，非是非非，非生非灭，非增非减，非垢非净，非大非小，非子非母，非方非圆，等等不可尽说。何以故？一切实虚，真妄，有无，是非，生灭，增减等等不可以尽说，只因有我，我心强名便有一切实虚，真妄，有无，是非，生灭，增减等等不可尽说， 无我时，实虚，真妄，有无，是非，生灭，增减等等不可尽说一切真如。",
        "pinyin": "zr"
    },
    {
        "title": "放生",
        "key": "fangsheng",
        "describe": "中国汉地的放生活动古已有之。狭义单指人命；广义则指一切人命与禽兽。《列子·说符篇》载：“正旦放生，示有恩也。”“客曰：‘民知君之欲放之，竞而捕之，死者众矣君如欲生之，不若禁民勿捕，捕而放之，恩过不相补矣。’简子曰：‘善！’”可见，早在春秋战国时代，中国汉地即有在特殊日子放生的说法，甚至已出现了专门捕鱼鸟以供放生的情况。但持续、广泛的放生习俗的形成，还是在佛教传入中国之后。",
        "pinyin": "fs"
    },
    {
        "title": "三观",
        "key": "sanguan",
        "describe": "三观是台宗之重要法门，为教理实践修行之骨架系对一切存在之三种观法，即空观、假观、中观称“空假中三观”依据“菩萨璎珞本业经”卷上，贤圣学观品“从假入空二谛观、从空入假平等观、中道第一义谛观”而立为旨趣。是真空绝相观，二是事理无碍观，三是周遍含融观。六相、十玄、三观的建立阐发了《华严经》的法界缘起、理事无碍、事事无碍、无尽圆融的教义六相、十玄是就所观的法界之境说的圆融三观是约能观之智说的。",
        "pinyin": "sg"
    },
    {
        "title": "大悲心",
        "key": "dabeixin",
        "describe": "大悲心就是菩提心，就是阿褥多罗三藐三菩提心、就是大慈大悲心、就是救苦救难普度众生心，就是佛心。 　　那么修行到啥样的程度才会有大悲心？才会是大悲心？修行到菩萨果位以上就有了大悲心，才是大悲心，修行到圆满佛的时候，就是圆满的大悲心，圆满的大慈大悲心。圆满佛就是自性光，就是圆满智慧，就是佛光，就是常寂光。",
        "pinyin": "dbx"
    },
    {
        "title": "朝拜",
        "key": "chaobai",
        "describe": "朝拜，是信徒与教徒们的一种虔诚的拜佛仪式。朝拜方式以三步一拜最为普遍，但亦不限于三步一拜。中国佛教徒喜欢朝山，朝拜四大菩萨，主要也是嚮往、学习悲智愿行的精神。信徒们遵循这样的程序：首先取立正姿势，口中念念有词，多为诵六字真言，读作“唵嘛呢叭咪吽”，是印度佛教密宗的“真宝石”（似汉地佛教徒常诵的“南无阿弥陀佛”，为难解的佛教术语），一边念六字真言，一边双手合十，高举过头，然后行一步",
        "pinyin": "cb"
    },
    {
        "title": "抑郁",
        "key": "yiyu",
        "describe": "抑郁症又称抑郁障碍，以显著而持久的心境低落为主要临床特征，是心境障碍的主要类型。临床可见心境低落与其处境不相称，情绪的消沉可以从闷闷不乐到悲痛欲绝，自卑抑郁，甚至悲观厌世，可有自杀企图或行为；甚至发生木僵；部分病例有明显的焦虑和运动性激越；严重者可出现幻觉、妄想等精神病性症状。每次发作持续至少2周以上、长者甚或数年，多数病例有反复发作的倾向，每次发作大多数可以缓解，部分可有残留症状或转为慢性。",
        "pinyin": "yy"
    },
    {
        "title": "算命",
        "key": "suanming",
        "describe": "算命，是推测人命运休咎之行为，属玄学范畴。研究算命的学术叫易学，也叫命理术数。其理论核心是阴阳五行、天干地支及八卦易经，理论系统较为复杂深奥。狭义的算命即是对人生辰八字（四柱八字）的预测，广义的算命则包含紫微斗数、面相手相、八卦六爻、奇门遁甲、六柱预测学等等。古代的占卜、青乌术、筮法，均属于算命。",
        "pinyin": "sm"
    },
    {
        "title": "饶益",
        "key": "raoyi",
        "describe": "饶益是指富裕，出处《史记·货殖列传》。 　　1、指富裕。2、指赢利。 3、使人受利。",
        "pinyin": "ry"
    },
    {
        "title": "色欲",
        "key": "seyu",
        "describe": "梵语ru^pa-ka^ma。为五欲之一。凡爱着于青黄长短等色境，惑动于男女间之色情，均称为色欲。摩诃止观卷四下（大四六·四三下）：‘如禅门中所说，色害尤深，令人狂醉，生死根本良由此也。’",
        "pinyin": "sy"
    },
    {
        "title": "行者",
        "key": "xingzhe",
        "describe": "按照字面意思，是指行走在路途上的所有人。但作为佛门用语，一指行脚乞食修苦行的头陀僧人，次指出家修行但未经过剃度的佛教徒，又指所有修行佛道的人。",
        "pinyin": "xz"
    },
    {
        "title": "禅坐",
        "key": "chanzuo",
        "describe": "『禅』是宇宙中一切万物的真理、生命和智慧。包括大自然界中所有的生物与非生物，以及宇宙万物，它们的生命变化、智慧、能力、生态…等等，统统都属于禅的范围；大如行星，小至细沙，当然也包括了人类。 　　比方说人与人之间有很多离不开的关系；人与天气、地理以及大自然界也是分不开的。因此『禅』的意义整体而言，使指整个宇宙万物是「一体」的。 　　广义的『禅』是宇宙「纯真」、「至善」、「完美」的境界，具足自在与圆满。在于人就是真、善、美的德行。佛教由『禅』而来，人可以因禅的力量而超越凡夫，进入圣境。",
        "pinyin": "cz"
    },
    {
        "title": "逆境",
        "key": "nijing",
        "describe": "逆境，不顺利的境遇 ，在生活中遇到的困难与挫折，指不危害生命的情况下付出大于原有预期。植物学术语中逆境 (environmental stress) 亦称为环境胁迫，对植物生存生长不利的各种环境因素的总称。根据不同的分类方法可分为生物逆境和理化逆境，或自然逆境和污染逆境等。",
        "pinyin": "nj"
    },
    {
        "title": "袈裟",
        "key": "jiasha",
        "describe": "梵语kas!a^ya，巴利语kasa^ya 或 kasa^va。意译作坏色、不正色、赤色、染色。指缠缚于僧众身上之法衣，以其色不正而称名。又作莲服、袈裟野、迦逻沙曳、迦沙、加沙。 又作袈裟野、迦罗沙曳、迦沙、加沙。意译为坏色、不正色、赤色、染色等。为佛教僧众所穿着的法衣，以其色不正，故有此名。",
        "pinyin": "js"
    },
    {
        "title": "开悟",
        "key": "kaiwu",
        "describe": "（术语）开智悟理也。法华经序品曰：‘照明佛法，开悟众生。’八十华严经四曰：‘开悟一切愚暗众生。’出曜经二曰：‘欲化彼人令得开悟。’付法藏传五曰：‘尔时马鸣，着白氎衣，入众伎中，自击钟鼓，调和琴瑟，音节哀雅，曲调成就，演宣诸法苦空无我。时此城中五百王子，同时开悟，厌恶五欲，出家为道。’",
        "pinyin": "kw"
    },
    {
        "title": "无缘",
        "key": "wuyuan",
        "describe": "无缘，指人与事物或人与人之间没有碰到一起的可能性，为迷信说法；无由。佛学指无遇佛、闻法之机缘、无对象之谓、无因论者主张人所为之一切皆无因、无缘；此属于邪见。",
        "pinyin": "wy"
    },
    {
        "title": "空性",
        "key": "kongxing",
        "describe": "闻思空性的意义---雪歌仁波切开示彼器随生诸功德，常能正受住净戒，勤行布施修悲心，并修安忍为度生，善根回向大菩提，复能恭敬诸菩萨。",
        "pinyin": "kx"
    },
    {
        "title": "静坐",
        "key": "jingzuo",
        "describe": "静坐可以澄清思虑，增进健康，是修养身心的一种重要方法。 我们生活在这个世界上，免不了有种种疾病，一切疾病又可分为身和心两方面，除身上所发生的疾病以外，凡一切贪欲、愤怒、忧怖、骄慢等等不正常的思想现象，都叫做心病。我们平时往往只注意身病，对于心病，一般都不予重视。",
        "pinyin": "jz"
    },
    {
        "title": "正念",
        "key": "zhengnian",
        "describe": "“正念的意思，就是觉照，同时它也意味着深入地观察。“Sati”(梵文：smrti)这个巴利语单词的意思是“止”和“保持对某个对象的觉照”。vipassana”(梵文：vipasyana)这个巴利语单词的意思是“为了观察某个对象而深入其中”。当我们完全地觉知并深入地观察某个对象的时候，能观和所观的界限就逐渐地消失了，能观和所观成为一体。这就是禅观的本质。只有当我们契入某个对象并与它成为一体的时候，我们才能真正地理解它。站在外面去观察某个对象是不够的。这就是为什么这部经提醒我们要即身观身、即受观受、即心观心和即法观法的原因。",
        "pinyin": "zn"
    },
    {
        "title": "虚妄",
        "key": "xuwang",
        "describe": "无实为虚，非真为妄。虚妄意即心执着于无实不真的东西。 　　圆觉经曰：“虚妄浮心多诸巧见，不能成就圆觉方便。”法华经譬喻品曰：“佛之所说，言不虚妄。”涅盘经三十八曰：“一切恶事，虚妄为本。”盖万法唯心造，心外无别体。然愚痴凡夫起妄心乱识，生种种分别，或执心外有实法，或执实我，此实我、实法之见，即为遍计所执，不契真性，故称虚妄分别。",
        "pinyin": "xw"
    },
    {
        "title": "沙弥",
        "key": "shami",
        "describe": "所谓沙弥，原语可能出自龟兹语的 samane 或 sammir，或于阗语的 ssamana。意译为求寂、息慈、勤策，即止恶行慈，觅求圆寂的意思。在佛教僧团中，指已受十戒，未受具足戒，年龄在七岁以上，未满二十岁时出家的男子。",
        "pinyin": "sm"
    },
    {
        "title": "六度",
        "key": "liudu",
        "describe": "赵朴初居士对“六度”的解释（选自佛教常识问答）： “度”梵语是“Pāramitā 波罗蜜多”，字义是“到彼岸”，即是从烦恼的此岸度到觉悟的彼岸。六度就是六个到彼岸的方法。自业他业，各领其受。魔障业障，二向缘由。随缘消业，莫造新秧。",
        "pinyin": "ld"
    },
    {
        "title": "化缘",
        "key": "huayuan",
        "describe": "化缘，佛教术语。佛教认为，能布施斋僧的人，即与佛门有缘，僧人以募化乞食广结善缘，故称化缘。还可以指为了佛事而进行的一切募化活动，不但指乞食。本义是佛、菩萨高僧等示现教化众生的因缘。所谓化缘，乃指化度的因缘。",
        "pinyin": "hy"
    },
    {
        "title": "浴佛",
        "key": "yufo",
        "describe": "“浴佛节”是佛教重要节日之一。浴佛节”又称“佛诞日”，根据习俗，这一天佛教寺院内都要举行“浴佛”活动，该活动的主旨是提醒人们时时要保有一颗清净心，观照自己的心是否清净。 　　浴佛的起源，是因悉达多太子在兰毗尼园无忧树下（亦称婆罗树或波罗叉树） 　　降生时，九龙（亦说二龙）吐水洗浴圣身的传说而来。在古代，它已成为佛教故事中一个重要的题材。印度鹿野苑和阿摩罗伐底近代出土的佛传雕刻，都有这种情景的构图。",
        "pinyin": "yf"
    },
    {
        "title": "家庭",
        "key": "jiating",
        "describe": "家庭是指婚姻关系、血缘关系或收养关系基础上产生的，亲属之间所构成的社会生活单位。家庭是幸福生活的一种存在。家庭有广义和狭义之分，狭义是指一夫一妻制构成的社会单元；广义的则泛指人类进化的不同阶段上的各种家庭利益集团即家族。从社会设置来说，家庭是最基本的社会设置之一，是人类最基本最重要的一种制度和群体形式。",
        "pinyin": "jt"
    },
    {
        "title": "罪恶",
        "key": "zuie",
        "describe": "1 指犯罪的行为。2 指坏事﹐错事。3 和好相对的事",
        "pinyin": "ze"
    },
    {
        "title": "唯心",
        "key": "weixin",
        "describe": "宇宙所有存在，皆由心所变现，心外无任何实法存在。亦即心为万有的本体，为唯一的真实。《华严一乘十玄门》载︰‘三界虚妄，唯一心作’，即是此义。因为有情生存于迷界（三界），皆是一心所变现，若谓心外有实在之物，乃纯属妄想所致，故言︰‘三界唯一心、心外无别法。’六十《华严经》卷十有偈曰：‘心如工画师，画种种五阴，一切世界中，无法而不造；如心佛亦尔，如佛众生然。心佛及众生，是三无差别。’此外，如‘一切从心转’、‘一切唯心造’、‘心造诸如来’等语，皆为佛典中常用来表示此一思想之典型用语。",
        "pinyin": "wx"
    },
    {
        "title": "畜生道",
        "key": "chushengdao",
        "describe": "佛教六道轮回中的一道畜生，新译作傍生，为傍行之生类之意。据新译《婆沙论》中说，诸有情因造作种种愚痴业，或因身语意各种恶行，堕于畜生道中。《业报差别经》中说，具造十业，得畜生报。一身行恶，二口行恶，三意行恶，四从贪而起诸恶，五从嗔起诸恶行，六从痴起诸恶行，七毁骂众生，八恼害众生，九施不净物，十行於邪淫。畜生道种类繁多，差别不等，《正法念处经》说有四十亿种，《楼炭经》说畜生道各各不同，大约有三类，一鱼，二鸟，三兽。此三类中各有无数种。",
        "pinyin": "csd"
    },
    {
        "title": "大乘",
        "key": "dacheng",
        "describe": "大：含有广大、崇高、无量之含义； 　　乘：运载、运乘之含义。 　　大乘佛教谓之诸大菩萨众将无量无边众生从生、老、病、死的苦难中度化到西方极乐世界，故名“大乘”。",
        "pinyin": "dc"
    },
    {
        "title": "准提",
        "key": "zhunti",
        "describe": "“准”为不空，绢索为“胝”，“准提”不空绢索菩萨也，或为多罗菩萨、金刚藏菩萨，是六道中救度天道及人道之观世音菩萨，是释迦如来之化身。准提法为密宗独部，且通五部之殊胜密法。每一灌顶修持准提法之人，必增二十一年之寿命，长短悉自知。",
        "pinyin": "zt"
    },
    {
        "title": "信愿行",
        "key": "xinyuanxing",
        "describe": "信，谓深信依佛言念佛求生西方必能遂愿，有信自（自心有佛性）、信他（信阿弥陀佛实有），信因信果等义。 　　愿，谓发愿命终往生净土，至彼国得不退转回入此界度化众生。 　　行，分正行与助行。正行指修念佛，助行指兼修礼诵供养、六度万行等。",
        "pinyin": "xyx"
    },
    {
        "title": "施食",
        "key": "shishi",
        "describe": "施食是布施饮食的意思。现在佛教中流行的施食，一般是指布施给饿鬼道众生。施食又叫蒙山施食，此外还有特殊的施食方法叫烟供、药供、火供、水供。 　　施食主要依据两本佛经，一本是《佛说施饿鬼甘露味大陀罗尼经》，一本是《佛说救拔焰口饿鬼陀罗尼经》。另外在盂兰盆节那一天进行放焰口放蒙山的仪式，其来源是《佛说盂兰盆经》。",
        "pinyin": "ss"
    },
    {
        "title": "福报",
        "key": "fubao",
        "describe": "福报，所谓“积善之家必有余庆，积恶之家必有余秧”；所谓“人为善，福虽未至祸已远离，人为恶，祸虽未至福已远离”说的就是这个道理。",
        "pinyin": "fb"
    },
    {
        "title": "现行",
        "key": "xianxing",
        "describe": "佛教大乘有宗指由“种子”所产生的一切现象，是“种子”潜伏状态的显现，故名。包括七转识(即眼识、耳识、鼻识、舌识、身识、意识、末那识)，及与七转识相应的心所有法（心理活动和精神现象），七转识所变之“相分”（认识对象）、“见分”（认识主体）、三性(善性、恶性、非善非恶性)、三界(欲界、色界、无色界)、九地(欲界为一“地”，色界、无色界各有四“地”)等。但“现行”又能反作用于“种子”，使“种子”持续和增长，宇宙即依“种子”与“现行”相互作用、互为因果而周流不息。",
        "pinyin": "xx"
    },
    {
        "title": "佛弟子",
        "key": "fodizi",
        "describe": "《佛说分别经》开示事佛的三种分别： 　　佛言。事佛有三辈。一辈者为魔弟子事佛。二辈为天人事佛。三辈为佛弟子事佛。",
        "pinyin": "fdz"
    },
    {
        "title": "四大皆空",
        "key": "sidajiekong",
        "describe": "佛教讲“四大皆空”，是沿用着印度固有的思想而再加以深刻化及佛教化，因为地、水、火、风的四大元素是宇宙物理的，比如山岳土地属于地大，海洋河川属于水大，阳光炎热属于火大，空间气流属于风大。",
        "pinyin": "sdjk"
    },
    {
        "title": "孝顺",
        "key": "xiaoshun",
        "describe": "孝顺原指爱敬天下之人﹑顺天下人之心的美好德行。后多指尽心奉养父母，顺从父母的意志。",
        "pinyin": "xs"
    },
    {
        "title": "六根",
        "key": "liugen",
        "describe": "指六种感觉器官，或认识能力。眼、耳、鼻、舌、身、意。眼是视根，耳是听根，鼻是嗅根，舌是味根，身是触根，意是念虑之根。",
        "pinyin": "lg"
    },
    {
        "title": "道果",
        "key": "daoguo",
        "describe": "道果，即佛道的正果。源于印度的佛教经典，《百喻经·宝箧镜喻》：禅定道品，无漏诸善，三乘道果，一切都失。《西游记》第一回：祖师喝令：赶出去。他本是个撒诈捣虚之徒，那里修甚么道果。道果也是对于苦心修道者的一种过程的肯定，所以是佛道中常常提起的词。",
        "pinyin": "dg"
    },
    {
        "title": "还俗",
        "key": "haisu",
        "describe": "还俗，佛教用语。原本是指僧尼因为破戒，依律被逐出僧团而返回俗家，恢复世俗人士的身份，故称还俗。若因个人诸多因素，自愿舍戒离开僧团而返回俗家，恢复世俗人士的身份，则称为归俗，也称反俗。但到了后来，还俗也包含有归俗的意思在内了，不一定是指负面的意思。另外还有一种情况是，因为历代的禁佛、废佛活动等政治因素，下令全国的僧尼还俗，例如三武灭佛。反之，也有因非自愿的情况下出家，直到获得准允后才得以还俗，例如后宫的嫔妃、随侍的奴婢，以及年幼的子女（送去佛寺当小沙弥）等。",
        "pinyin": "hs"
    },
    {
        "title": "感情",
        "key": "ganqing",
        "describe": "感情解释：①对外界刺激的比较强烈的心理反应、动作流露。②对人或事物关切、喜爱的心情。 　　感情，是人内心的各种的感觉、思想和行为的一种综合的心理和生理状态，是对外界刺激所产生的心理反应，以及附带的生理反应。如：喜、怒、哀、乐等，感情是个人的主观体验和感受，常跟心情、气质、性格和性情有关。",
        "pinyin": "gq"
    },
    {
        "title": "禅语",
        "key": "chanyu",
        "describe": "禅语主要指从佛门中传出的精华语句，话语平朴，含意深远，对人生思想等方面有着精神食粮的作用。由于禅语的文雅和隽永，常在文学艺术作品中得到应用。",
        "pinyin": "cy"
    },
    {
        "title": "摄心",
        "key": "shexin",
        "describe": "摄心：摄散乱之心于一也。遗教经曰：“常当摄心在心。” 　　摄心，亦即收摄自己的心念，不使它忘失或散乱，也就是把心从过去境及未来境中收回来，只缘现前境之后，进一步将现前境的范围缩小，对于现前环境里所发生的种种状况，虽然可能都看得到、听得到，但是不要被它们所影响而生起情绪反应。",
        "pinyin": "sx"
    },
    {
        "title": "中国佛教",
        "key": "zhongguofojiao",
        "describe": "公历纪元前后，印度佛教开始由印度传入中国，经长期传播发展，而形成具有中国民族特色的中国佛教。由于传入的时间、途径、地区和民族文化、社会历史背影的不同，中国佛教形成三大系，即汉地佛教（汉语系）、藏传佛教（藏语系）和云南地区[1] 上座部佛教（巴利语系）。",
        "pinyin": "zgfj"
    },
    {
        "title": "佛诞",
        "key": "fodan",
        "describe": "同义词 佛诞一般指浴佛节 　　浴佛节，又称佛诞日、佛诞节等，为每年的农历四月初八，是佛祖释迦牟尼诞辰。 　　史书记载释迦牟尼佛生于周昭王二十四年（西元前1027年），是迦毗罗卫国（今尼泊尔境内）王子。传说降生时一手指天、一手指地，大地为之震动，九龙吐水为之沐浴。现世界各国各民族的佛教徒常以浴佛等方式纪念佛祖诞辰。",
        "pinyin": "fd"
    },
    {
        "title": "无相",
        "key": "wuxiang",
        "describe": "“无相”，中国最早的道教理念，远比佛教的“无相”之说早两个多世纪。最早写作无象。指没有形迹;没有具体形象、概念， 原为道家形容道玄虚无形之语后亦泛指诸种义理的玄微难测或玄微难测的义理。语出《老子》: \"绳绳兮不可名复归于无物。是谓无状之状无象之象是谓忽恍。 \"",
        "pinyin": "wx"
    },
    {
        "title": "婚姻",
        "key": "hunyin",
        "describe": "婚姻是家庭和社会的总开关，是子女成长、成才的基石，婚姻会涉及到经济、人事等多种问题，婚后会涉及到计划生育、抚养子女成人的主体责任，好的婚姻需要精心设计，从实际出发，根据个人的身份做出调整，也要防止婚姻因为经济和机遇问题，丧失理智，退化自己的社会功能，导致子女遗传人格变质。",
        "pinyin": "hy"
    },
    {
        "title": "观想",
        "key": "guanxiang",
        "describe": "主要是佛家范围，观想略作想。集中心念观想某一对象，可以对治贪欲等妄念，或为进入正观而修的一种方便观。",
        "pinyin": "gx"
    },
    {
        "title": "觉性",
        "key": "juexing",
        "describe": "佛教语。谓能断离一切迷惘而开悟真理的本性。 　　离一切迷妄之觉悟自性也。圆觉经曰：“若诸菩萨，以圆觉慧。圆合一切，于诸性相。无离觉性，此菩萨者，名为圆修三种自性清净随顺。”【又】觉知之性。谓心识也。唯识论一曰：“非觉性故。”同述记一末曰：“觉者觉察，心心所总名。”",
        "pinyin": "jx"
    },
    {
        "title": "禅学",
        "key": "chanxue",
        "describe": "佛教的禅法理论，中国佛教的重要学说。禅，全称“禅那”，源于梵文，意译“静虑、“思维修”等，谓静中思虑，心绪专注一境，深入思虑佛教义理。“禅那”，也就是止观，“止”是心的安静，“观”是思虑某一事物。“禅”原是印度古代各种教派修行的普遍方法，而在佛教生活和佛教哲学中具有特殊重要的意义。禅是定的一种，而中国佛教往往把禅和定并称为“禅定”，含义比较广泛。",
        "pinyin": "cx"
    },
    {
        "title": "佛门",
        "key": "fomen",
        "describe": "依三论玄义，知菩萨之造论，即为开显诸佛之教门，此教门即法门之意。后代‘佛门’一语，主要为佛教对于儒、道二教之自称。",
        "pinyin": "fm"
    },
    {
        "title": "观心",
        "key": "guanxin",
        "describe": "观察心性。佛教以心为万法的主体，无一事在心外，故观心即能究明一切事（现象）理（本体）。 　　《十不二门指要钞》上：“盖一切教行，皆以观心为要。” 唐 施肩吾 《题景上人山门》诗：“水有青莲沙有金，老僧于此独观心。” 宋 苏辙 《诸子将筑室以画图相示》诗之三：“久尔观心终未悟，偶然见道了无疑。” 清 龚自珍 《重辑六妙门序》：“五曰还，此门还是裂小网，开佛知见曰裂大网，还者非他，《觉意三昧》之观，观心是也。”",
        "pinyin": "gx"
    },
    {
        "title": "法界",
        "key": "fajie",
        "describe": "佛教道教术语。法泛指宇宙万有一切事物，包括世出世间法，通常释为“轨持”，即一切不同的万事万物都能保持各自的特性，互不相紊，并按自身的轨则，能让人们理解是什么事物。界，含有种族、分齐的意思，即分门别类的不同事物各守其不同的界限。",
        "pinyin": "fj"
    },
    {
        "title": "仪轨",
        "key": "yigui",
        "describe": "仪轨：礼法规矩。《三国志·蜀志·诸葛亮传》：“ 诸葛亮 之治国也，抚百姓，示仪轨，约官职，示权制。” 南朝 宋刘义庆《世说新语·任诞》：“ 裴 曰：‘ 阮 方外之人，故不崇礼制；我辈俗中人，故以仪轨自居。’”《周书·周惠达传》：“ 惠达 与礼官损益旧章，至是仪轨稍备。”",
        "pinyin": "yg"
    },
    {
        "title": "僧伽",
        "key": "sengqie",
        "describe": "僧伽，自言何国人，因以何为姓。少年出家为僧之后誓志游方。唐龙朔二年，僧伽自玄奘法师西行求法出境之处别迭里山口入唐，始发凉州，经历洛阳，行抵江表，止嘉禾灵光寺，教化水乡泽国渔梁矰弋为生之民众2003年12月30日，经过考古人员初步考证，12月28日从江苏江阴青阳镇悟空村悟空寺华藏塔地宫出土的石函内银瓶确实瘗藏舍利，并且是唐代高僧泗洲大圣僧伽大师、也就是民间所说的“观音菩萨”化身的真身舍利，僧伽在佛教典籍中被视为“观音菩萨”的化身。唐朝时的观音像即以僧伽容貌为模本，所以多为男相，以后才演变为女相。",
        "pinyin": "sg"
    },
    {
        "title": "现量",
        "key": "xianliang",
        "describe": "现量，含义：现成，现在，显现真实。 　　指由感官和对象（所量）接触所产生的知识。关于现量，印度各哲学派别的说法很不相同。正理、胜论以及数论、弥曼差派将现量分为无分别的和有分别的两种。文法学派和耆那教不承认无分别现量，以为一切现量都是有分别的。佛教则认为具有概念思惟成分的有分别现量是似现量，只有不加入思惟活动、不能用语言表述出来的纯粹感觉，才是真现量。《因明入正理论》云（大正32 ·12b）︰‘此中现量，谓无分别。若有正智于色等义、离名、种等所有分别，现现别转，故名现量。’",
        "pinyin": "xl"
    },
    {
        "title": "杂修",
        "key": "zaxiu",
        "describe": "严格地说，中国人是杂修的佛教。例如：为了求现生的健康、长寿、消灾、免难而持诵《普门品》、《药师经》、《大悲咒》或念观音菩萨及药师佛圣号；若为求西方的未来利益，便诵《阿弥陀经》，并念阿弥陀佛圣号；若为消除病障、业障，则多半诵持观音灵感真言、白衣大士神咒或者礼拜《水忏》、《梁皇忏》等；如果为了超度先亡、亲友，则念《地藏经》、往生咒、放口、放蒙山等。类似的修行方式，既是显教，也混有密教的形式与意味；既是修西方净土，也修东方净土。同一个人在不同的时间，为了不同的目的，就可能用不同的法门。",
        "pinyin": "zx"
    },
    {
        "title": "梵行",
        "key": "fanxing",
        "describe": "梵行 (brahmacariya)：意为清净、尊贵、值得赞叹的行为；或如清净、尊贵的诸佛、独觉佛、出家圣弟子等清净者们的生活方式。",
        "pinyin": "fx"
    },
    {
        "title": "顶礼",
        "key": "dingli",
        "describe": "顶礼，指跪下，两手伏地，以头顶着所尊敬的人的脚，是佛教徒最高的敬礼。顶礼一次最基本的功德将获得自己身下所压面积直到金刚大地以上所有微尘数 量之转轮王位，然其功德之边尚不可尽。所以要真诚、清净、正确的礼佛。",
        "pinyin": "dl"
    },
    {
        "title": "精进",
        "key": "jingjin",
        "describe": "常见佛学中，意思为努力向善向上，放逸刚好与之相反，是以三善根及精进为体，有防恶修善的功能。对一切善法肯认真负责，精诚集中，故名不放逸。",
        "pinyin": "jj"
    },
    {
        "title": "戒邪淫",
        "key": "jiexieyin",
        "describe": "“邪淫”一般是指佛教上所禁止的性行为，现代汉语中引申为不良性行为。 　　三种定义：1、婚外恋、婚外情、婚外通奸可以被认为是邪淫。例如：除了夫妻之间的房事外，一切不受国家法律或社会道德所承认的男女关系，可以被称为邪淫。2 奸淫；下流的行为。3 中医指致病的因素。",
        "pinyin": "jxy"
    },
    {
        "title": "本尊",
        "key": "benzun",
        "describe": "1．自称。同义词 \"本座 \"。 　　神话传说中或者玄幻小说中，神通广大的人物称呼自己所用的称谓。 　　2．佛教用语 　　指的是 \"本质自我 \"。",
        "pinyin": "bz"
    },
    {
        "title": "礼佛",
        "key": "lifo",
        "describe": "礼佛，就是向佛礼拜，忏悔吾人所造之业，以为灭障消灾增加福慧的殊胜法门。它的方式很多，包括：雕刻佛像、供养塔寺和佛菩萨形像、赞叹诸佛像好庄严、歌颂佛德，或以各种乐器，演奏妙音、合掌、低头鞠躬，跪拜等。",
        "pinyin": "lf"
    },
    {
        "title": "诸佛",
        "key": "zhufo",
        "describe": "诸：是指所有一切。诸佛是指：十方尽虚空法界一切佛。",
        "pinyin": "zf"
    },
    {
        "title": "懈怠",
        "key": "xiedai",
        "describe": "释义：松懈懒散；怠慢不敬。 松散怠慢",
        "pinyin": "xd"
    },
    {
        "title": "流转",
        "key": "liuzhuan",
        "describe": "佛教语。指因果相续而生起的一切世界现象，包括众生生死在内。流，相续。转，生起。《瑜伽师地论》卷五二：“诸行因果相续不断性，是谓流转。”《百喻经·治鞭疮喻》：“未见不净，返为女色之所惑乱，流转生死，堕於地狱。” 吕澄 《中国佛学源流略讲》第四讲：“只能断绝生死，超出流转，‘神’（人我）才不受物累。”",
        "pinyin": "lz"
    },
    {
        "title": "四法",
        "key": "sifa",
        "describe": "【四法】 [出大乘本生心地观经] 经云。于法宝中有其四种。引导众生。出生死海。到于彼岸。三世诸佛依此修行。断一切障。得成菩提。一教法谓一切无漏善法。教化众生。能破无明烦恼业障也。(无漏者。不漏落生死也。)三理法谓一切教法所诠之义理也。三行法谓戒定慧等诸行之法也。四果法谓至果所证无为涅盘等法也。(梵语涅盘。华言灭度。)",
        "pinyin": "sf"
    },
    {
        "title": "恶报",
        "key": "ebao",
        "describe": "恶报原为佛教语，谓行恶事而自食恶果。后泛指坏的报应。",
        "pinyin": "eb"
    },
    {
        "title": "业力",
        "key": "yeli",
        "describe": "其作为直接推动生命延续的力量，业力在我们的生命历程中具有重要作用，甚至可配合缘起论与无始无明化世界。佛法所说的业力，根据行为属性，有善业、恶业之分；根据受报与否，有定业、不定业之分；根据受报范围，有共业、别业之分；根据受报差别，有引业、满业之分。其中，善业、恶业分别由不同行为构成，比较容易理解。 《正法念处经》卷七之偈曰：“非异人作恶，异人受苦报；自业自得果，众生皆如是。”",
        "pinyin": "yl"
    },
    {
        "title": "观念",
        "key": "guannian",
        "describe": "观念是人们对事情的主观与客观认识的系统化之集合体。人们会根据自身形成的观念进行各种活动。利用观念系统（观念体系）对事物进行决策，计划，实践，总结等活动，从而不断丰富生活和提高生产实践水平。观念具有主观性，实践性，历史性，发展性等特点。形成正确的观念和观念清晰（观念可视，能用文字清晰表达）有利于做正确的事情，提高生活水平和生产质量。观念与理念密切相关，观念是形式基，理念是基本。理念与观念关联。没有观念就没有理念发（产）生。",
        "pinyin": "gn"
    },
    {
        "title": "佛教",
        "key": "fojiao",
        "describe": "佛教距今已有两千五百多年，由古印度迦毗罗卫国（今尼泊尔境内）王子乔达摩·悉达多所创（参考佛诞）。佛教也是世界三大宗教之一。佛，意思是“觉者”。佛又称如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、世尊。佛教重视人类心灵和道德的进步和觉悟。佛教信徒修习佛教的目的即在于依照悉达多所悟到修行方法，发现生命和宇宙的真相，最终超越生死和苦、断尽一切烦恼，得到究竟解脱。 　　佛姓新称乔达摩（S Gautama， P Gotama），旧称瞿昙；因为他属于释迦（Sākya）族，人们又称他为释迦牟尼。",
        "pinyin": "fj"
    },
    {
        "title": "天竺",
        "key": "tianzhu",
        "describe": "天竺是古代中国以及其它东亚国家对当今印度和巴基斯坦等南亚国家的统称。在中国历史上，对印度的最早记载在《史记·大宛传》，当时称为身毒（印度河梵文Sindhu对音）。《汉书》记载：“从东南身毒国，可数千里，得蜀贾人市。”。 《后汉书·西域传》记载“天竺国一名身毒”。唐初统称为天竺。天竺历史上相继出现了四大帝国：孔雀帝国、笈多帝国、德里苏丹国和莫卧儿帝国。",
        "pinyin": "tz"
    },
    {
        "title": "出离心",
        "key": "chulixin",
        "describe": "出离心，佛教词汇，为解脱轮回苦，灭尽诸烦恼（再简单点就是：离苦得乐）之意，出离心基本上是希望从娑婆世界的苦海中解脱出来。娑婆世界被称为苦海是因为它有存有三界即欲界、色界、无色界的生命体，并且含有有情的生命和无情的器世间，从佛陀的谛观，三界的众生都感受到苦，所以在他开悟后第一次的转法轮时就讲述四圣谛法。",
        "pinyin": "clx"
    },
    {
        "title": "悲观",
        "key": "beiguan",
        "describe": "悲观（bēiguān），有佛教语五观之一、对世事所怀消极的看法的含义。今也指失望。 　　1、佛教语，五观之一。谓以慈悲之心观察众生，救人苦难。 　　《法华经·普门品》：“悲观及慈观，常愿常瞻仰。”注：“以大悲人观众生苦，拔其苦难，名曰悲观。” 　　2、消极失望。和“乐观”相对。",
        "pinyin": "bg"
    },
    {
        "title": "禅法",
        "key": "chanfa",
        "describe": "是指心智的培育和发展。作为一个朝向最究竟之解脱（涅盘）的宗教，佛教对于修习是非常重视的。修习的目的在于剔除种种扰乱心智的负面心理状态和恶劣品性，同时培育各种有助于心智成长的正面心理状态，最终达成如实地知见一切事物本性的最高智慧而证悟涅槃。",
        "pinyin": "cf"
    },
    {
        "title": "大慈大悲",
        "key": "dacidabei",
        "describe": "慈：用爱护心给予众生以安乐；悲：用怜悯心解除众生的痛苦；慈悲：佛教用语，救人苦难。形容人心肠慈善。“大慈大悲”这个成语出自《妙法莲花经·譬喻品》：“大慈大悲，常无懈倦，恒求善事，利益一切。”近义词有大发慈悲、悲天悯人、与人为善、宽大为怀等。",
        "pinyin": "dcdb"
    },
    {
        "title": "知足常乐",
        "key": "zhizuchangle",
        "describe": "知足常乐，谓自知满足则心常快乐。语本《老子》：“祸莫大於不知足，咎莫大於欲得，故知足之足常足矣。”况周颐《蕙风词话》卷二：“委心任运，不失其为我。知足常乐，不愿乎其外。”王西彦《古屋》第一部四：“一个快乐主义者首先得有知足的修养，就是古训所谓‘知足常乐’。”",
        "pinyin": "zzcl"
    },
    {
        "title": "八关斋戒",
        "key": "baguanzhaijie",
        "describe": "八关斋戒：伟大的佛陀为了在家弟子众修行制定的、暂时的出家修行人的戒律与斋法。因为在家修行的人，家庭的、社会的种种繁杂事务很繁忙，要想修行佛法，业障也很多。 　　伟大的佛陀慈悲怜悯在家弟子众让他们能够过的清净斋戒生活，又能够适应在家普通人生活的特点，所以特别制定了在家修行人的斋戒，就是“八关斋戒”。这个“八”字，是指的八条严格戒律。",
        "pinyin": "bgzj"
    },
    {
        "title": "习气",
        "key": "xiqi",
        "describe": "1、 佛教语。谓烦恼的残余成分。佛教认为一切烦恼皆分现行、种子、习气三者，既伏烦恼之现行，且断烦恼之种子，尚有烦恼之余气，现烦恼相，名为“习气”。 　　2、多指逐渐形成的不良习惯或作风。",
        "pinyin": "xq"
    },
    {
        "title": "绮语",
        "key": "qiyu",
        "describe": "佛家所说“十恶”中，属于“口业”的有四种，“绮语”即其中之一。“绮”字的本义是平纹起花的丝织品，引申为华美、艳丽。凡一切邪僻不正或涉及男女私情的话，都称为绮语。",
        "pinyin": "qy"
    },
    {
        "title": "随顺",
        "key": "suishun",
        "describe": "谓随从他人之意而不拂逆。法华经卷一序品有供养诸佛、随顺（梵a^nulomiki^ ）行大道、具六波罗密之说。同经卷四‘五百弟子受记品’亦说，世尊甚奇特，所为极希有，随顺（梵anuvartayante ）世间若干之种性，以方便知见而为说法，拔出众生处处之贪着。 　新华严经卷三十七中亦有菩萨如是观一切法之自性清净，随顺（梵anu=loma ）不违），得入第六现前地，得明利之随顺忍（梵anulomiki^ ks!a^n=tih! ），而未得无生法忍等之记载。 　随顺一语，在佛、众生、教法皆可用之。",
        "pinyin": "ss"
    },
    {
        "title": "宗教",
        "key": "zongjiao",
        "describe": "宗教是人类社会发展到一定历史阶段出现的一种文化现象，属于社会特殊意识形态。旧时由于人对自然的未知探索，以及表达人渴望不灭解脱的追求，进而相信现实世界之外存在着超自然的神秘力量或实体，使人对该一神秘产生敬畏及崇拜，从而引申出信仰认知及仪式活动体系，与民间神话一样，其也有自己的神话传说，彼此相互串联，其是一种心灵寄托。",
        "pinyin": "zj"
    },
    {
        "title": "净业",
        "key": "jingye",
        "describe": "又作清净业。即世福、戒福、行福之三种福业。 　　据《观无量寿经》载，此三福业为： 　　孝养父母，奉侍师长，慈心不杀，修十善业。 　　受持三归，具足众戒，不犯威仪。 　　发菩提心，深信因果，读诵大乘，劝进行者。 　　此三福为众生往生之正因，亦为菩萨之净佛国土之无漏修因，故称净业。",
        "pinyin": "jy"
    },
    {
        "title": "三世诸佛",
        "key": "sanshishusheng",
        "describe": "三世诸佛，即过去、现在、未来等三世的一切诸佛。又作一切诸佛、十方佛、三世佛。一般以燃灯佛代表过去诸佛，释迦牟尼佛代表现在诸佛，弥勒尊佛代表未来诸佛。",
        "pinyin": "sszf"
    },
    {
        "title": "真谛",
        "key": "zhendi",
        "describe": "二谛之一，三谛之一。指真实不妄之义理。如谓世间法为俗谛，出世间法为真谛。 　　原为佛教语。与俗谛合称为“二谛”。亦泛指最真实的意义或道理，真切的理论和精义，奥妙所在原为佛教语。与俗谛合称为“二谛”。亦泛指最真实的意义或道理，又称为“第一义谛”。",
        "pinyin": "zd"
    },
    {
        "title": "圣人",
        "key": "shengren",
        "describe": "在中国传统文化中，“圣人”指知行完备、至善之人，是有限世界中的无限存在。总的来说，“才德全尽谓之圣人”。这个词语最初出于对“至善”“至美”的人格追求，所以圣人的原意，是专门指向完美的。但后来的诸子百家，乃至古今各种宗教、学派，也都有自己认定的圣人，但道家的黄老列庄；儒家的尧舜孔孟；墨家的大禹等圣人是受到后世公认的。在先秦古代圣人一词非儒家专有。 　　所谓“圣人”，上左有“耳”以表闻道，通见天地之正理；上右有“口”表以宣教正化于众；下为“王”以为万众之所仰。",
        "pinyin": "sr"
    },
    {
        "title": "三根",
        "key": "sangen",
        "describe": "指众生的三种根性︰即上根、中根、下根三者，又称利根、中根、钝根。上根指根性优良，速发智解，堪忍难行，能忍妙果者；中根次于上根；下根为最劣者。",
        "pinyin": "sg"
    },
    {
        "title": "破戒",
        "key": "pojie",
        "describe": "破戒，指受戒僧道违反宗教戒律；泛指违反戒约。",
        "pinyin": "pj"
    },
    {
        "title": "佛经",
        "key": "fojing",
        "describe": "经是佛陀说过的话的汇编，经是佛教教义的基本依据；律是佛教组织为教徒或信众制定的纪律或行为规范；论是对经、律的解释或阐述。其传说部分也许是为了展现佛教的神奇之处；其哲学与修行部分是值得学习与深思的道理；其将一世因果扩至三世因果无论是否存在都可以合理解释一些科学中无法解释的现象，达到导人向善的作用。",
        "pinyin": "fj"
    },
    {
        "title": "坐禅",
        "key": "zuochan",
        "describe": "坐禅，意思是闭目端坐，凝志静修。用心看着头脑中纷飞的念头，念头会慢慢地静下来，静下来的头脑则会出现一片晴朗的天空（比喻）。就像摇动杯子里浑浊的水，不动杯子，杯子里的浑浊会沉淀到杯底，水则会清净无暇。坐禅的功用是能让坐禅的人，头脑清晰、思维有序、行动专一。 　　佛教讲因缘，即内因，外在条件，因此，要想坐禅有成就，对初学者，要有个好的因缘。最要紧的，一要发愿坚持修炼，二要持戒---最基本的“不邪淫”一定要遵守。同时戒除一切不良生活习惯。",
        "pinyin": "zc"
    },
    {
        "title": "风水",
        "key": "fengshui",
        "describe": "风水是汉民族历史悠久的一门玄术，也称青乌术、青囊术，较为学术性的说法叫做堪舆。风水是自然界的力量，是宇宙的大磁场能量。风就是元气和场能，水就是流动和变化。风水本为相地之术，即临场校察地理的方法，也叫地相、古称堪舆术，它是一种研究环境与宇宙规律的哲学，人既然是自然的一部分，自然也是人的一部分，达到“天人合一”的境界是再平常不过的了。相传风水的创始人是九天玄女，比较完善的风水学问起源于战国时代。",
        "pinyin": "fs"
    },
    {
        "title": "福田",
        "key": "futian",
        "describe": "福田，佛教用语，拼音为 fú tián，梵语为pun!ya-Ks!etra，巴利语为 pun~n~a-kkhetta。谓可生福德之田；凡敬侍佛、僧、父母、悲苦者，即可得福德、功德，犹如农人耕田，能有收获，故以田为喻，则佛、僧、父母、悲苦者，即称为福田。",
        "pinyin": "ft"
    },
    {
        "title": "大德",
        "key": "dade",
        "describe": "释义：对年长德高僧人或佛、菩萨的敬称 　　佛家对年长德高僧人或佛、菩萨的敬称。梵语为“婆檀陀”（bhadanta）。 　　梵文 bhadanta，敬称词。在印度，是对佛菩萨或高僧的敬称。于诸部律中，凡指比丘众，称“大德僧”。 在我国隋唐时代，凡从事译经事业者，特称大德。此外，统领僧尼的僧官，也称大德。近代以来，“大德”一词已广泛的被使用，凡是有德有行的人，不论出家、在家，都以“大德”尊称之；或是不限于具足德行与否，也称之为大德。因此“大德”一词成为佛教界一般性的礼称。",
        "pinyin": "dd"
    },
    {
        "title": "谦卑",
        "key": "qianbei",
        "describe": "谦卑，即“谦虚﹐不自高自大”之意。中国人有一股祖先传下来的骨子里的谦卑。学会谦卑，你会轻松，可以更好的经营自己的人生。",
        "pinyin": "qb"
    },
    {
        "title": "根器",
        "key": "genqi",
        "describe": "佛教教义名词，指先天具有接受佛教之可能性。“根”比喻先天的品行，“器” 比喻能接受佛教的容量。唐·李华 《润州鹤林寺故径山大师碑铭》：“群生根器，各各不同，唯最上乘，摄而归一。” 元 欧阳玄 《送振先宗丈归祖庭》诗：“矧今抡俊髦，往往论根器。”",
        "pinyin": "gq"
    },
    {
        "title": "过午不食",
        "key": "guowubushi",
        "describe": "过午不食，是佛陀为出家人制定的戒律。在律部中正确的说法叫“不非时食”。也就是说不能在规定许可以外的时间吃东西。这个时间就是在太阳到正中午后，一直到次日黎明，这段时间是不允许吃东西的。",
        "pinyin": "gwbs"
    },
    {
        "title": "心中心法",
        "key": "xinzhongxinfa",
        "describe": "心中心法，唐密、藏密红教、东密各有传承。心中心法在西藏和日本都是不轻传之密法，不经过一番艰苦的修习，不具备相当的密法基础，是很难得到的。在上个世纪二十年代重新崛起的无相密乘心中心法，既不是来自东密，也非来自藏密，而是我们汉地独有之传承，远在唐密中就有的。",
        "pinyin": "xzxf"
    },
    {
        "title": "三聚净戒",
        "key": "sanjujingjie",
        "describe": "三聚净戒是总括大乘菩萨一切戒律的三个分类，即摄律仪戒、摄善法戒、摄众生戒。三聚净戒这个名称最初见于陈、隋之际天台家等有关著述，但其内容早已见诸译籍。",
        "pinyin": "sjjj"
    },
    {
        "title": "口业",
        "key": "kouye",
        "describe": "即由口而说的一切善恶言语 　　“业”这个词在梵文中是karma，就是“行为”。按作用方式分身、口、意三种，按伦理性质则可分为善、恶与无记三种。人说话，不管说什么话，都可以说是在“造业”，只不过造的有善业、恶业与无记业（不善不恶业）三种。 　　恶业的一种，恶业还包括身业、意业。口业里有妄语、绮语、两舌、恶口。 　　妄语包括谎言、恶口（即骂人的话）、两舌（也是不实之言，即对人三面两刀，挑拨离间之类）、绮语（即淫秽的语言，或者其他无礼仪不正经的语言）。",
        "pinyin": "ky"
    },
    {
        "title": "接引",
        "key": "jieyin",
        "describe": "为佛用语，意为：引导，教导。又称摄引、接化。为引导摄受之意。谓诸佛菩萨引导摄受众生，或师家教导引接弟子。",
        "pinyin": "jy"
    },
    {
        "title": "五阴",
        "key": "wuyin",
        "describe": "五阴，一色阴（有形质碍之法名为色），二受阴（领纳所缘名为受) ，三想阴（能取所领之缘相名为想），四行阴（造作之心能趣于果名为行）， 五识阴（了别所缘之境名为识）。",
        "pinyin": "wy"
    },
    {
        "title": "清净",
        "key": "qingjing",
        "describe": "清净，道家哲学。是清洁纯净的意思。也可指人心境洁净，不受外扰。做到外在的清净不难，但要达到内心的清净就不易了。清净 \"最早出现在文子所著《道原》： \"真人体之以虚无平易，清净柔弱，纯粹素朴，不与物杂，至德天地之道，故谓之真人。 \"",
        "pinyin": "qj"
    },
    {
        "title": "凡夫",
        "key": "fanfu",
        "describe": "相对于“圣人”而言，“凡夫”既是：平凡的人。 　　眼睛耳朵等“五根”， 　　受到眼睛所见耳朵所闻等“五尘”蒙蔽 　　见不到生命真相， 　　即为“凡夫”。 　　须菩提，於意云何，汝等勿谓如来作是念，我当度众生。须菩提，莫作是念。何以故，实无有众生如来度者。若有众生如来度者，如来则有我人众生寿者。须菩提，如来说有我者，则非有我，而凡夫之人以为有我。须菩提，凡夫者，如来说即非凡夫，是名凡夫。",
        "pinyin": "ff"
    },
    {
        "title": "华藏",
        "key": "huazang",
        "describe": "华藏，“华”者，我国古称华夏，今称中华，传统文化是中华人民共和国的国粹，故取“华”字。“华”在古代又通“花”有“繁荣昌盛”之义，象征着传统文化旺盛的生命力，以及我们这个事业的美好前景。“藏”者，宝藏（zàng），书是宝藏，思想也是宝藏，传统文化的书籍和思想是一个巨大的宝藏。因此，“华藏”二字合起来的深义便是“传统文化是中华人民共和国的宝藏”。",
        "pinyin": "hc"
    },
    {
        "title": "信徒",
        "key": "xintu",
        "describe": "信徒，为信仰某一宗教的人的称呼。今也泛指信仰某一主义、学派、主张或某个人的人。 信徒有宗教上的，政治理论上的和对某种理念的。另有以此为名的电影、诗歌和歌曲等。",
        "pinyin": "xt"
    },
    {
        "title": "禁忌",
        "key": "jinji",
        "describe": "中国佛教的禁忌一方面来自于佛教本身的戒律仪规，另一方面也受到中国本土传统民间风俗的影响。皈依佛门的人，无论在家出家，为了发慈悲心，增长功德，都要持佛教的戒律。佛教最基本的戒律是“五戒十善”。五戒，就是杀生戒，偷盗戒，邪淫戒，妄语戒，饮酒戒。十善实际上是五戒的分化和细化，分为身、语、意三业的禁忌，其内容包括，身体行为的善（禁忌）：不杀生，不偷盗，不邪淫；语言方面的善（禁忌）：不妄语，不两舌，不恶口，不绮语；意识方面的善（禁忌）：不贪欲，不嗔恚，不邪见。",
        "pinyin": "jj"
    },
    {
        "title": "迷信",
        "key": "mixin",
        "describe": "迷信专指人对事物的一种痴迷信任状态、迷惘地相信；更指盲目的相信、不理解的相信”。迷信的本义是“相信了错误的东西”。 　　民间记载中，《记栗主杀贼事》（【清】潮声）：“迷信者云：‘命中犯披麻，杀人不用刀。’” 　　佛学中迷信一词在唐朝译经师翻译文献时首次使用。 　　迷信具体指人类对超自然力量的崇拜和信仰，是对客观世界的一种虚幻的歪曲的反应，是愚昧落后的表现。",
        "pinyin": "mx"
    },
    {
        "title": "谤法",
        "key": "bangfa",
        "describe": "【谤法】所谓谤法，诽谤正法（佛法）的意思。丁福保《佛学大辞典》：“【谤法】诽谤正法之略。” 所谓诽谤，是说人坏话，诋毁和破坏他人名誉的意思。其中，诽是背地议论，谤是公开指责。 　　谤法是我们知道的十分严重的过失，这个过失、错误对于我们的影响十分大。在《无量寿经》当中就特地指明往生的条件中是“唯除五逆,诽谤正法”的。就是诽谤正法不能往生。",
        "pinyin": "bf"
    },
    {
        "title": "十法界",
        "key": "shifajie",
        "describe": "是佛教术语，将佛和众生分为十大法界。十界分别是指：地狱法界、饿鬼法界、畜生法界、阿修罗法界、人法界、天法界、声闻法界、缘觉法界、菩萨法界和佛法界。前六项称为六凡，后四项称为四圣，合称为六凡四圣。",
        "pinyin": "sfj"
    },
    {
        "title": "十戒",
        "key": "shijie",
        "describe": "十戒是：不杀生、不偷盗、不邪淫、不妄语、不饮酒、不涂饰、不歌舞及旁听、不坐高广大床、不非时食、不蓄金银财宝。",
        "pinyin": "sj"
    },
    {
        "title": "见性",
        "key": "jianxing",
        "describe": "黄檗传心法要曰：“即心是佛，上至诸佛，下至蠢动含灵，皆有佛性，同一心体。所以达摩从西天来，唯传一法。直指一切众生本来是佛，不假修行。但如今识取自心，见自本性，更莫别求。”血脉论曰：“若欲见佛，须是见性，性即是佛。若不见性，念佛诵经，持斋持戒，亦无益处。",
        "pinyin": "jx"
    },
    {
        "title": "读经",
        "key": "dujing",
        "describe": "读经就二个字，一个是“读”，一个是“经”。字面上很容易搞清楚，但是在实践的过程中，这二个字常常被曲解，从而让读经教育存在许多的变数，令人无所适从。",
        "pinyin": "dj"
    },
    {
        "title": "丛林",
        "key": "conglin",
        "describe": "丛林，指树林；僧人聚居之处。因指寺院。语出汉 班固 《西都赋》：“松柏仆，丛林摧。”",
        "pinyin": "cl"
    },
    {
        "title": "宽心",
        "key": "kuanxin",
        "describe": "指放心；安心；解除心中的焦急愁闷。",
        "pinyin": "kx"
    },
    {
        "title": "福德",
        "key": "fude",
        "describe": "1、（术语）以名一切之善行。又以名善行所得之福利。无量寿经下曰：“福德自然。” 　　2、指修人天善行所感得的福分。福德与功德不同，外修事功的有漏善是“福德”，内证佛性无漏智才是“功德”。又，修道若著相而修，那是“福德”，若离一切相，修一切善，才是“功德”。 　　3、谓佛说经，为令众生修习布施、持戒、忍辱、精进、禅定、智慧等行，调伏诸根，无所放逸，则得天人果报，长乐无穷，是为福德。",
        "pinyin": "fd"
    },
    {
        "title": "供佛",
        "key": "gongfo",
        "describe": "供：供 gōng 准备着东西给需要的人应用：供给(jí)。供求。供应。供需。供销。提供。供不应求。 　　佛： 佛 fó 梵语“佛陀”，是对佛教创始人释迦牟尼的简称，亦是佛教徒对修行圆满的人的称呼：佛爷。",
        "pinyin": "gf"
    },
    {
        "title": "愿力",
        "key": "yuanli",
        "describe": "汉语词语。解释①佛教语。誓愿的力量。多指善愿功德之力。②泛指意愿之力。",
        "pinyin": "yl"
    },
    {
        "title": "戾气",
        "key": "liqi",
        "describe": "戾气：中医学中有戾气一说,是和正气相反,和邪气相对应的。除此，有些用法中可以理解为就是暴戾之气的意思。即一种残忍，凡事要做得狠，偏向走极端的一种心理或风气。 可以看做杀心重，或杀气的近义词，但更指向广泛一些，不一定是物质上的偏爱杀戮残害，比如动不动破口大骂，往死里骂，或对一些小的坏事偏向于非常严厉处罚。同时其指向对象也不一定是一些真正的罪行严重，心地非常黑暗的人。",
        "pinyin": "lq"
    },
    {
        "title": "随念",
        "key": "suinian",
        "describe": "佛随念的修习方法是随念佛、法、僧的功德。 　　戒随念的修习方法是具有正念地忆念自己清净无染的戒行。 　　舍（弃）随念是具有正念地忆念布施的功德。 　　天随念的修习方法是具有正念地如下忆念。 　　寂止随念是观察涅槃的素质。 　　死随念是观察自己肯定会死、死亡何时会来临无法肯定，以及当死亡来临时，人们必须舍弃一切。 　　身至念是观察自己身体的三十二不净的部份。 　　安般念是专注于呼吸时接触到鼻孔边缘或人中的入息与出息。 　　关于十随念，详见《清净道论》第七章及第八章。",
        "pinyin": "sn"
    },
    {
        "title": "十八界",
        "key": "shibajie",
        "describe": "梵文的意译。佛教以人的认识为中心，对世界一切现象所作的分类。或说，人的一身即具此十八界。包括能发生认识功能的六根（眼界、耳界、鼻界、舌界、身界、意界），作为认识对象的六境（色界、声界、香界、味界、触界、法界）和由此生起的六识（眼识界、耳识界、鼻识界、舌识界、身识界、意识界）。《俱舍论》卷一：“法种族义是‘界’义……如是一身或一相续有十八类诸法种族，名十八界。” 吕澄 《中国佛学源流略讲》第三讲：“《放光》译出后，‘事数’比较完备了，如用五蕴、十二处、十八界等来说明。”",
        "pinyin": "sbj"
    },
    {
        "title": "净业三福",
        "key": "jingyesanfu",
        "describe": "净业三福分别为：第一福、「孝养父母，奉事师长，慈心不杀，修十善业」。第二福、「受持三皈，具足众戒，不犯威仪」。 第三福、「发菩提心，深信因果，读诵大乘，劝进行者」。",
        "pinyin": "jysf"
    },
    {
        "title": "大菩提",
        "key": "daputi",
        "describe": "伟大的正觉。菩提即正觉的意思。声闻缘觉菩萨都有菩提但不大，唯有佛的智慧伟大而圆满，故名大菩提。 　　菩提是大彻大悟，明心见性，证得了最后的光明的自性，也就是达到了涅盘的程度。涅盘对凡夫来讲是人死了，实际上就是达到了无上菩提。 　　菩提，是以触证众生本具的真心为入门(开悟明心)，能如实现观这个“不生不灭”，“能生万法”的真心。悟后起修，逐渐能知此真心的种种微妙运作。因而一切行止皆能转依真心而不再“造业”，能修除无始劫以来含藏在真心中全部“业种”的污染性。如实实修直至成佛。",
        "pinyin": "dpt"
    },
    {
        "title": "附体",
        "key": "futi",
        "describe": "指一个人的身体，除了本有的灵魂以外，还被其它的灵魂体所占据、依附的意思。",
        "pinyin": "ft"
    },
    {
        "title": "修禅",
        "key": "xiuchan",
        "describe": "也称悟禅，是通过解放“自我”束缚获得世界真相的方法。",
        "pinyin": "xc"
    },
    {
        "title": "无念",
        "key": "wunian",
        "describe": "无念者， 无杂念也并非无一毫之念；无想者 ，不想过去现在未来之事也 ，并非一无所想，若一无所念一无所想 ，则心置於何处，故心专一则杂念自无 ，神摄一则妄想自除 。",
        "pinyin": "wn"
    },
    {
        "title": "妄心",
        "key": "wangxin",
        "describe": "妄心者，即我们凡夫“背觉合尘”，住著六尘（色、声、香、味、触、法）所生的心。也就是六根（眼、耳、鼻、舌、身、意）攀缘六尘（色、声、香、味、触、法）所生的“六识”（眼识、耳识、鼻识、舌识、身识、意识）。异名心。 　　我们凡夫动心起念总不离六尘，无时无刻不在六尘里滚来滚去，一念也离不开。而这六尘说起来，也不过是妄心所幻，并非实有。佛法上讲“心物不二”就是这个意思。所谓即心（思想）之处，物（六尘）在其中；反过来说，即物之处，心在其中，心即物，物即心，心外无物，物外无心。",
        "pinyin": "wx"
    },
    {
        "title": "保家仙",
        "key": "baojiaxian",
        "describe": "保家仙一般在东北供俸保家仙，通常写在纸上贴在墙上，或是用木板制作的胡黄常蟒仙的排位。",
        "pinyin": "bjx"
    },
    {
        "title": "祈愿",
        "key": "qiyuan",
        "describe": "祈愿，意指请求、祈祷、希望等。是寄托一种愿望，希望能梦想成真。多见于宗教中的行为。如南朝梁武帝《断酒肉文》：“若以不杀祈愿，辄得上教；若以杀生祈愿，辄不得教。”同时有同名歌曲祈愿。",
        "pinyin": "qy"
    },
    {
        "title": "三灾八难",
        "key": "sanzaibanan",
        "describe": "比喻小孩生来多病。也形容经常遭遇不幸。",
        "pinyin": "szbn"
    },
    {
        "title": "无为法",
        "key": "wuweifa",
        "describe": "佛教名词，梵文Asamskrta的意译，略称无为。与“有为法”相对。指不依因缘 和合而成的不生不灭、无来无去、非彼非此的绝对。原本是涅盘的异名。大乘佛教，尤其是中国佛教，以无为法为诸法之本体，与“法性”、“真如”等为同一含义。以 法相唯识宗为代表。",
        "pinyin": "wwf"
    },
    {
        "title": "觉行圆满",
        "key": "juexingyuanman",
        "describe": "佛、觉义，自觉、觉他、觉行圆满。‘自觉’属小乘，但求独善其身。‘觉他’是菩萨，有慈悲心，自动教化众生，为不请之友。 　　‘觉行圆满’是佛。‘圆满’非指度生人数，而是由心性上讲的。我们心性有三种烦恼，一为见思烦恼，自觉者见思烦恼断了。觉他者能兼断尘沙，自行化他。把见思尘沙无明断尽即圆满成佛。",
        "pinyin": "jxym"
    },
    {
        "title": "慈悲喜舍",
        "key": "cibeixishe",
        "describe": "慈悲喜舍，是《阿含经》到大乘诸经中反复倡导的精神。慈、悲、喜、舍的无限扩大、无限深化，称为大慈、大悲、大喜、大舍，名“四无量心”，或称“四梵住”（四种清净无染的心）。",
        "pinyin": "cbxs"
    },
    {
        "title": "佛龛",
        "key": "fokan",
        "describe": "拼音：fó kān。供奉佛像、神位等的小阁子，如佛龛、神龛等，一般为木制，中国古代的石窟雕刻一般是神龛式，小龛又称椟。龛原指掘凿岩崖为空，以安置佛像之所。据《观佛三昧海经》卷四记载，一一之须弥山有龛室无量，其中有无数化佛。《大毗婆沙论》卷一七七记载：底沙佛至山上，入吠琉璃龛，敷尼师檀，结跏趺坐，入火界定。现今各大佛教遗迹中，如印度之阿旃塔，爱罗拉，我国云冈、龙门等石窟，四壁皆穿凿众佛菩萨之龛室。后世转为以石或木，作成橱子形，并设门扉，供奉佛像，称为佛龛；此外，亦有奉置开山祖师像。",
        "pinyin": "fk"
    },
    {
        "title": "心识",
        "key": "xinshi",
        "describe": "心识，指心志；才智等。 见南朝·陈·徐陵 《为贞阳侯答王太尉书》：“孤虽庸薄不及通贤，犹曰生民宁无心识。” 　　心识，指心与识。心梵语是质多，集起为义，指阿赖耶识所含藏积集的善恶种子；识梵语是毗若南，主要的意义是了别为性，是指依意根生起的前六识，了别的作用。",
        "pinyin": "xs"
    },
    {
        "title": "法器",
        "key": "faqi",
        "describe": "法器又称为佛器、道器、佛具、法具或道具。就内义而言，凡是在宗教寺院内，用于祈请、修法、供养、法会等各类宗教事务的器具，或是宗教徒所携带的念珠，乃至锡杖等修行用的资具，都可称之为法器。就广义而言，凡是修行之人所用的器具或具有一些特殊功效的器具都可称为法器。",
        "pinyin": "fq"
    },
    {
        "title": "灵验",
        "key": "lingyan",
        "describe": "灵妙之效验实证也。大日经疏九曰：“此尊有灵验，故所作善事皆成。”孟兰盆经疏曰：“今受神方，兼睹灵验。”",
        "pinyin": "ly"
    },
    {
        "title": "法身",
        "key": "fashen",
        "describe": "梵语dharma-ka^ya，巴利语 dhamma-ka^ya。指佛所说之正法、佛所得之无漏法，及佛之自性真如如来藏。二身之一，三身之一。又作法佛、理佛、法身佛、自性身、法性身、如如佛、实佛、第一身。据大乘大义章卷上、佛地经论卷七等载，小乘诸部对佛所说之教法及其所诠之菩提分法、佛所得之无漏功德法等，皆称为法身。大乘则除此之外，别以佛之自性真如净法界，称为法身，谓法身即无漏无为、无生无灭。",
        "pinyin": "fs"
    },
    {
        "title": "摄受",
        "key": "sheshou",
        "describe": "佛教语。谓佛以慈悲心收取和护持众生。南朝 梁简文帝 《大爱敬寺刹下铭》：“应此一千，现兹权实，随方摄受，孰能弘济。” 唐 惠能 《坛经·顿渐品》：“汝可他日易形而来，吾当摄受。” 明叶宪祖《北邙说法》：“弟子们都拜从禅师，惟愿慈悲摄受。”",
        "pinyin": "ss"
    },
    {
        "title": "浮屠",
        "key": "futu",
        "describe": "浮屠，亦作浮图，休屠。按浮屠浮图，皆即佛陀之异译。佛教为佛所创。古人因称佛教徒为浮屠。佛教为浮屠道。后并称佛塔为浮屠。后人们认为佛陀二字太麻烦，于是简化成了一个字“佛”。",
        "pinyin": "ft"
    },
    {
        "title": "净土宗",
        "key": "jingtuzong",
        "describe": "净土宗（朝鲜语：& 51221;& 53664;& 51333; 净土宗；越南语：T& 7883;nh & 272;& 7897; Tông 浄土宗），汉传佛教十宗之一。根源于大乘佛教净土信仰，专修往生阿弥陀佛净土之法门而得名的一个宗派。中国净土宗祖庭是江西庐山东林寺和陕西西安香积寺。 　　众多佛经记载，佛在很多法会中均无问自说，宣讲了净土法门。在大藏经中，专谈净土以及带说净土的经论，有数百种之多。印度著名马鸣菩萨，龙树菩萨，天亲菩萨等均有净土论著，解释与弘扬净土法门。",
        "pinyin": "jtz"
    },
    {
        "title": "流通",
        "key": "liutong",
        "describe": "流通，特指商品、货币流转。",
        "pinyin": "lt"
    },
    {
        "title": "佛七",
        "key": "foqi",
        "describe": "设立道场以七天为一周期做佛事，若念阿弥陀佛，则称念佛七，若念观世音菩萨，则称观音七，若禅坐，则称禅七，此外还有楞严七、大悲七等等说法，可以统称佛七。",
        "pinyin": "fq"
    },
    {
        "title": "道德",
        "key": "daode",
        "describe": "一切宗教都是重视伦理道德的，佛教的处理人与人之间关系的伦理准则有三条： 　　一要平等慈悲； 　　二要去恶从善，所有坏的事情不论大小，都不能去做，所有善事都要去做； 　　三要自度度他，自己解脱，也要帮助别人解脱，自己提升也要帮助别人提升，对自己有利也要对别人有利。它的道德规范，也就是戒律非常多。",
        "pinyin": "dd"
    },
    {
        "title": "神识",
        "key": "shenshi",
        "describe": "神识指意识，概述神识小无内，所以佛说：“一杯水里有八千万众生。”神识大无外，所以佛说“大千世界”。神识是众生的心和识。普遍认为指八识（眼、耳、鼻、舌、身、意、末那、阿赖耶等识）。关于神识在佛教内部各派及学术界中亦存在多种解释及争论。另外《神识》也是一款集换式卡牌类型的桌面游戏，融合了时间、速度等机制而成为了一种新的玩法。是一款竞技性的游戏。由升温贸易发行。",
        "pinyin": "ss"
    },
    {
        "title": "见地",
        "key": "jiandi",
        "describe": "见地是指对事物深刻、全面的认识，高出人们一般的理解。它建立在丰富的经历和体会的基础上，并由简约的形式表达出来。见地在佛教中是三乘共十地的第四位，相当于声闻乘的预流果。",
        "pinyin": "jd"
    },
    {
        "title": "识心",
        "key": "shixin",
        "describe": "1 见识。 　　2 佛学术语， 对‘心所法’而言，指六识或八识之心王。楞严经卷一（大一九·一○七上）：‘一切世间十种异生，同将识心居在身内。’ 　　谓自识本心，自见本性。《宋书·少帝纪》：“德业冲粹，识心明允。”《坛经·惠能童子问答惠能作偈》：“不识本心，学法无益，识心见性，即悟大意。” 明 李贽 《答周西岩书》：“或有或无，自是识心分别，妄为有无，非汝佛有有有无也明矣。”",
        "pinyin": "sx"
    },
    {
        "title": "知见",
        "key": "zhijian",
        "describe": "1 见识;见解。 　　2 看见，知道。 　　3 佛教语。知为意识，见为眼识，意谓识别事理﹑判断疑难。",
        "pinyin": "zj"
    },
    {
        "title": "愚痴",
        "key": "yuchi",
        "describe": "愚痴（yú chī）：汉语词语，意思是愚昧痴呆。 1 愚昧痴呆。 汉 王充 《论衡·论死》：“五藏不伤则人智慧，五藏有病则人荒忽，荒忽则愚痴矣。”《百喻经·饮木筩水喻》：“有人见之言：汝大愚痴，无有智慧。” 元 无名氏 《举案齐眉》第三折：“你道他无聪明智慧，折莫他便鲁坌愚痴。” 老舍 《赶集·微神》：“愚痴给我些力量，我决定自己去见她。”",
        "pinyin": "yc"
    },
    {
        "title": "恶果",
        "key": "eguo",
        "describe": "佛教谓从恶事之因而生的苦果。",
        "pinyin": "eg"
    },
    {
        "title": "孝道",
        "key": "xiaodao",
        "describe": "中国最早的一部解释词义的著作《尔雅》下的定义是：“善事父母为孝”。汉代贾谊的《新书》界定为“子爱利亲谓之孝”。东汉许慎在《说文解字》的解释：“善事父母者，从老省、从子，子承老也”。许慎认为，“孝”字是由“老”字省去右下角的形体，和“子”字组合而成的一个会意字。从这里我们可以看出，“孝”的古文字形与“善事父母”之义是吻合的，因而孝就是子女对父母的一种善行和美德，是家庭中晚辈在处理与长辈的关系时应该具有的道德品质和必须遵守的行为规范。",
        "pinyin": "xd"
    },
    {
        "title": "佛咒",
        "key": "fozhou",
        "describe": "咒在汉文也叫祝，古代我们祖先有祝由科。 　　原始佛教，也就是释迦牟尼佛成佛初始是不做佛咒的，因为佛陀反对用神通来开释，后来婆罗门教自印度流行。吸引了许多本来要学佛的人。婆罗门教就主张用咒修行和行教义。佛陀为了方便传法，就把这个外道神通作为方便法来开释一部分缘分。 因此就在以后的佛法里经常出现佛用咒语转法轮的佛经。",
        "pinyin": "fz"
    },
    {
        "title": "天台",
        "key": "tiantai",
        "describe": "天台",
        "pinyin": "tt"
    },
    {
        "title": "参禅",
        "key": "canchan",
        "describe": "参禅是禅宗用以学人求证真心实相的一种行门。 参禅最要生死心切。和发长远心。若生死不切。则疑情不发。功夫做不上。若没有长远心。则一曝十寒。功夫不成片。只要有个长远切心。真疑便发。真疑发时。尘劳烦恼不息而自息。时节一到。自然水到渠成。 　　《红楼梦》中贾母训宝玉黛玉“不是冤家不聚头”，那回提到参禅。“好似参禅一般，都低头细嚼此话的滋味”。",
        "pinyin": "cc"
    },
    {
        "title": "佛欢喜日",
        "key": "fohuanxiri",
        "describe": "佛出世间以利生为本怀，凡有所作，皆想带给众生安乐，拔除众生痛苦，所以，若见众生，舍恶向善，转迷成悟，返妄归真，离苦得乐即畅佛出世本怀故佛欢喜。",
        "pinyin": "fhxr"
    },
    {
        "title": "持戒",
        "key": "chijie",
        "describe": "戒亦称为解脱，如好好持戒亦能解脱。入菩萨道，三无漏学为根本。学佛千万不要被虚妄的名闻利养迷著。佛法亦有法运，虽衰不会灭亡，因末法有一万年之法运，现在只过去了十分之一。修菩萨道一定要由三无漏学开始，持戒是手段，慧是目的，定是枢纽。",
        "pinyin": "cj"
    },
    {
        "title": "妄语",
        "key": "wangyu",
        "describe": "妄语，词语，读作”wàng yǔ“，意思是虚妄不实的话；说假话。出自《后汉书·王霸传》。",
        "pinyin": "wy"
    },
    {
        "title": "宽容",
        "key": "kuanrong",
        "describe": "宽容，即允许别人自由行动或判断；耐心而毫无偏见地容忍与自己的观点或公认的观点不一致的意见（不列颠百科全书）。宽大有气量，不计较或不追究。",
        "pinyin": "kr"
    },
    {
        "title": "正觉",
        "key": "zhengjue",
        "describe": "梵语samyak-sam!bodhi，巴利语samma^-sambodhi。意指真正之觉悟。又作正解、等觉、等正觉、正等正觉、正等觉、正尽觉。",
        "pinyin": "zj"
    },
    {
        "title": "道心",
        "key": "daoxin",
        "describe": "1 它指人天生的仁、义、礼、智、善之心，其与“人心”的对称，成正比，道心越胜，人心越善，道业越深；反之，亦然。 　　2 “道”代表世间法则。所谓“道心”就是追求世间法则至理之心。",
        "pinyin": "dx"
    },
    {
        "title": "讲座",
        "key": "jiangzuo",
        "describe": "讲座，是由教师不定期地向学生讲授与学科有关的科学趣闻或新的发展，以扩大他们知识的一种教学活动形式。 　　或：由主讲人向学员传授某方面的知识、技巧，或改善某种能力、心态的一种公开半公开的学习形式。",
        "pinyin": "jz"
    },
    {
        "title": "业果",
        "key": "yeguo",
        "describe": "佛教指恶业或善业所造成的苦乐果报。 南朝 梁 慧皎 《序》：“考业果之幽微，则循复三世；言至理之高妙，则贯绝百灵。”《旧唐书·王缙传》：“ 缙 弟兄奉佛，不茹荤血……每对扬启沃，必以业果为证。” 元 郑廷玉 《忍字记》第一折：“自从这个忍字在手内写，今日个业果眼前招。” 清 蒲松龄 《聊斋志异·公孙九娘》：“昔日罗裳化作尘，空将业果恨前身。”",
        "pinyin": "yg"
    },
    {
        "title": "无明",
        "key": "wuming",
        "describe": "五明梵语pan~ca vidya^-stha^na^ni，亦称“五明处”。“明”谓学问、学科，为五门学科，概括了当时所有的知识体系。此所谓五明为声明、因明、医方明、工巧明、内明。拿今天的话讲，学五明即是学科学技术。比如今天的建筑学即是工巧明之一。",
        "pinyin": "wm"
    },
    {
        "title": "学法",
        "key": "xuefa",
        "describe": "(1) 学习法律。《汉书·于定国传》：“ 定国 少学法于父，父死，后 定国 亦为狱吏。” 　　(2) 学校的法规。 宋 叶适 《学校》：“三代、 汉 儒，其言学法盛矣，皆人耳目之所熟知，不复论。”《续资治通鉴·宋理宗宝祐四年》：“学官申严祖宗学法，诸生或怙终不悛，自畔名教，必正宪典。仍令三学立石。”",
        "pinyin": "xf"
    },
    {
        "title": "无生法忍",
        "key": "wushengfaren",
        "describe": "《大般若经》卷四四九〈转不转品〉云（大正7·264b）：‘如是不退转菩萨摩诃萨，以自相空，观一切法，已入菩萨正性离生，乃至不见少法可得。不可得故，无所造作。无所造作故，毕竟不生。毕竟不生故，名无生法忍。由得如是无生法忍故，名不退转菩萨摩诃萨。’此谓菩萨观诸法空，入见道初地，始见一切法毕竟不生之理，名无生法忍。",
        "pinyin": "wsfr"
    },
    {
        "title": "自杀",
        "key": "zisha",
        "describe": "自杀是指个体在复杂心理活动作用下，蓄意或自愿采取各种手段结束自己生命的行为。自杀作为一种复杂的社会现象，学者们对其分类有不同的看法。",
        "pinyin": "zs"
    },
    {
        "title": "善心",
        "key": "shanxin",
        "describe": "善心（shàn xīn），形容好心；善良的心意。语出《荀子·乐论》：“使其曲直、繁省、廉肉、节奏，足以感动人之善心。”《生经》卷四：“其五百童，虽有善心，宿命福薄。”《云笈七签》卷九五：“大王及诸羣臣八千馀人，皆发善心。” 巴金 《灭亡》第二十章：“你的前途是很幸福的，你有青春，你有生命力，你有无限的善心。”",
        "pinyin": "sx"
    },
    {
        "title": "感化",
        "key": "ganhua",
        "describe": "对心灵施加影响，扫除迷惑，安抚创伤，引导内心的积极力量，塑造恰当的行为模式，维护尊严，让生命存在价值和意义。感：是接受外在的信息。化：是内在的转化。感与化互相作用，相互影响。",
        "pinyin": "gh"
    },
    {
        "title": "财富",
        "key": "caifu",
        "describe": "财富，指具有价值的东西就称之为财富，包括自然财富、物质财富、精神财富等。语出 《史记·太史公自序》：“布衣匹夫之人，不害於政，不妨百姓，取与以时而息财富。”",
        "pinyin": "cf"
    },
    {
        "title": "慈悲",
        "key": "cibei",
        "describe": "慈，梵语maitrya，maitri^，巴利语metti；悲，梵语karun!a，巴利语同。慈爱众生并给与快乐（与乐），称为慈；同感其苦，怜悯众生，并拔除其苦（拔苦），称为悲；二者合称为慈悲。佛陀之悲乃是以众生苦为己苦之同心同感状态，故称同体大悲。又其悲心广大无尽，故称无盖大悲（无有更广、更大、更上于此悲者）。",
        "pinyin": "cb"
    },
    {
        "title": "六和",
        "key": "liuhe",
        "describe": "佛教：谓身和(共住)﹑口和(无诤)﹑意和(同事)﹑戒和(同修)﹑见和(同解)﹑利和(同均)。 也是“六和敬”，即是佛陀摄众的方法之一。",
        "pinyin": "lh"
    },
    {
        "title": "所依",
        "key": "suoyi",
        "describe": "所依，指作为教义信条等存立之典据而被依用的经论。(一)谓为物之所依托者︰‘能依’之对称。佛教典籍中，使用‘所依’一词的情形，有下列数种︰(1)即一般所谓的所依经论。(2)在唯识学中，指诸八识心、心所生起时所依止、仗托者。(3)指梵行者应安住之所依。",
        "pinyin": "sy"
    },
    {
        "title": "定业",
        "key": "dingye",
        "describe": "多义词。指创定事业；也为古代名刀。梁·陶弘景《古今刀剑录》：“齐高帝肖道成，以建元二年造一刀，铭曰定业。”",
        "pinyin": "dy"
    },
    {
        "title": "六尘",
        "key": "liuchen",
        "describe": "《俱舍论》卷一记载，色境有二种：显色和形色。显色指显现的颜色，有青、黄、赤、白、云、烟、尘、雾、影、光、明、暗等十二种。形色指物体的形状，有长、短、方、圆、高、下、正、不正等八种。《瑜伽师地论》卷一，在显色、形色之外，增加表色，使得色尘的分类更加完备。即凡是行、住、坐、卧、取、舍、屈、伸等种种动作形态，明显的表现于外，可以令人看见的，称为表色。",
        "pinyin": "lc"
    },
    {
        "title": "具足",
        "key": "juzu",
        "describe": "在佛法当中，此名相，多用于形容诸佛的圆满无缺，在戒律中，具足则指，完善的戒律。",
        "pinyin": "jz"
    },
    {
        "title": "从容",
        "key": "congrong",
        "describe": "从容，指人处事不慌张，很镇定；舒缓悠闲的样子；充裕、不紧迫。见《庄子·秋水》：“儵鱼出游从容，是鱼之乐也。”",
        "pinyin": "cr"
    },
    {
        "title": "小乘",
        "key": "xiaocheng",
        "describe": "小乘佛教又称上座部佛教，上座部佛教主张恪守戒律，严守原始上座部佛教的戒律，注重上座部比丘众的自身的戒律修行。",
        "pinyin": "xc"
    },
    {
        "title": "机缘",
        "key": "jiyuan",
        "describe": "机缘是指众生信受佛法的根机和因缘。",
        "pinyin": "jy"
    },
    {
        "title": "念佛法门",
        "key": "nianfofamen",
        "describe": "念佛法门　　念佛法门，别无奇特，只深信力行为要耳。佛云：若人但念弥陀佛，是名无上深妙禅。天台云：四种三昧，同名念佛；念佛三昧，三昧中王。云栖云：一句阿弥陀佛，该罗八教，圆摄五宗。简介　　可惜今人，",
        "pinyin": "nffm"
    },
    {
        "title": "比丘戒",
        "key": "biqiujie",
        "describe": "比丘戒，梵语upasam!panna，或 upasam!pada^，巴利语同。音译邬波三钵那。意译近圆，有亲近涅盘之义。又作近圆戒、近具戒、大戒。略称具戒。指比丘、比丘尼所应受持之戒律； 　　因与沙弥、沙弥尼所受十戒相比，戒品具足，故称具足戒。依戒法规定，受持具足戒即正式取得比丘、比丘尼之资格。",
        "pinyin": "bqj"
    },
    {
        "title": "带业往生",
        "key": "daiyewangsheng",
        "describe": "谓命终之后，带着宿业，往生他道。业，即吾人之身、语、意等一切之身心活动，具有力量可影响未来。往生，即死此生彼之意。就广义可言，通指受生三界六道及诸佛净土，然主要指受生极乐。吾人漂流于六道轮回中，一生所造之善恶业为数甚多，有生天业、做人业，或堕三恶道业。然命终后仅能受一种果报；依佛法揭示，凡所作业都可能感果，但非一定感果，须视时节因缘而定。若一生中造三种业，却不能同时生三道；若生一道，其他二道之业即为其所带，然因缘条件不足，故无润生之可能。此种往生即称带业往生。",
        "pinyin": "dyws"
    },
    {
        "title": "三法印",
        "key": "sanfayin",
        "describe": "「三法印」：诸行无常、诸法无我、涅槃寂静。三法印是识别真佛法与假佛法的标准：一切法若与三法印相违的，即使是佛陀亲口所说，也是不了义；若与三法印相契合的，纵然不是佛陀亲口所说，也可视同佛说。因为三法印是「印」证佛法真伪的标准，如同世间的公文，凭借印监可以确认公文的真假，因此称为「三法印」。",
        "pinyin": "sfy"
    },
    {
        "title": "回头是岸",
        "key": "huitoushian",
        "describe": "回头是岸原是理学用语，指人只要回心转意，痛改前非，就能登上“岸”，就可改正错误。后比喻做坏事的人，只要决心悔改，就有出路。",
        "pinyin": "htsa"
    },
    {
        "title": "恭敬心",
        "key": "gongjingxin",
        "describe": "恭敬心是体悟心性和一切物性最纯净、最快速和最简单的方法。当我们在修行路上继续前进时，整个过程就表现出奇妙的互相依存性：从自己来说，我们不断尝试生起恭敬心，所生起的恭敬心本身会产生心性的灵光一现，而这些灵光一现又会加强和加深我们对上师的恭敬心。最后，恭敬心从智慧产生；恭敬心和心性的经验变得不可分离，彼此互相启发。",
        "pinyin": "gjx"
    },
    {
        "title": "佛子",
        "key": "fozi",
        "describe": "佛子，是阿罗汉（arhat）的通称。佛赞五百阿罗汉说︰‘汝等为子，从我口生，从法化生，得法余财。’印度的婆罗门（brahma^），自以为从梵天口生，从梵天化生，所以佛说︰阿罗汉们是从听闻佛口说法声（所以名为声闻）而生，从法──法性寂灭的证入而成的。佛子，表示了有佛那样的圣性，能继承如来觉世的大业，所以名为佛子，是至高无上的尊号。一般由朝廷加封。最尊者称“佛子”，次者尊“国师”，再次最为“法王”。",
        "pinyin": "fz"
    },
    {
        "title": "四念住",
        "key": "sinianzhu",
        "describe": "四念处只是一种本质—既是集中正念于自然现象。正念有所区别，只是因为正念所观察的所缘分别为四：既是身（kaya）、受（vedana）、心（citta）与法（dhamma）。后者即包括了这些要素，如：五盖、五蕴、六根、六尘（所产生的活动）、七觉支及四圣谛。",
        "pinyin": "snz"
    },
    {
        "title": "三业",
        "key": "sanye",
        "describe": "一、身业——身不履邪径，不染恶习，不任伤生，即不杀、不盗、不淫，则身业清静。 　　二、口业——口不妄言、绮语、两舌、恶口，则口业清静。 　　三、意业——不贪、不嗔、不痴，则意业清静。",
        "pinyin": "sy"
    },
    {
        "title": "治病",
        "key": "zhibing",
        "describe": "即具有医生资格或者医学方法对有病者进行治疗疾病的一种活动。包括治已病和治未病。采用各种医疗措施消除疾病，使病人恢复并保持心身健康。",
        "pinyin": "zb"
    },
    {
        "title": "饿鬼",
        "key": "egui",
        "describe": "饿鬼， 由于其前世所造下的一些罪责，因而沦落饿鬼道，由于其嘴巴太小而无法进食。可别以为他肚子太大的就误以为他吃得很饱，那是因为营养失调而造成其肚子膨胀，其实他们可是饿得不得了！饿鬼之中有许多不同的种类，如外障鬼、内障鬼、饮食障鬼等。",
        "pinyin": "eg"
    },
    {
        "title": "四弘誓愿",
        "key": "sihongshiyuan",
        "describe": "一切菩萨于因位时所应发起的四种誓愿。又称四弘誓、四弘愿行、四弘行愿、四弘愿。略称四弘，或称总愿。 　　（术语）梵语僧那，译曰誓愿。诸佛有总愿别愿，四弘誓愿为总愿，一切菩萨初发心时，必发此愿。以所愿广普故曰弘，自制其心故曰誓，志求满足故曰愿。缘四真谛而发此四愿也。",
        "pinyin": "shsy"
    },
    {
        "title": "地藏七",
        "key": "dizangqi",
        "describe": "地藏七属于佛教净土法门，以念佛为正行，以吃素、诵《地藏经》、忏悔、放生、行善为助行，通通都是为了积累善根福德因缘，通通是为了培植净业三福，最终念佛往生西方极乐世界。同时，依地藏菩萨本誓愿力，速满众生一切所求，能灭众生一切重罪，除诸障碍，现得安隐。",
        "pinyin": "dzq"
    },
    {
        "title": "发心",
        "key": "faxin",
        "describe": "发心，修行人忘失菩提心，轻则懈怠废弛，重则道心全退，大乘学人不能片刻离开菩提心。道者不可须臾离也，修道与求学一样，不进则退。佛说忘失菩提心而修诸善事，魔所摄持，故无菩提心而修善事即是魔。魔非青面獠牙、三头六臂之谓，凡是被烦恼障碍所摄即谓之魔。例如对于某人特别喜欢，勤加慈爱，但无菩提心，待来生可能同他变成眷属；如有菩提心，对于某人只有慈悲而无情爱，即不著相。菩提心如同一镜子，照得清清楚楚，俨然实现，但事后一点痕迹都没有，即修一切善，离一切相。如心中不清净，即是为自己找麻烦。",
        "pinyin": "fx"
    },
    {
        "title": "无分别智",
        "key": "wufenbiezhi",
        "describe": "无分别智：梵语 nir-vikalpa-jn~a^na。又作无分别心。指舍离主观、客观之相，而达平等之真实智慧。即菩萨于初地入见道时，缘一切法之真如，断离能取与所取之差别，境智冥合，平等而无分别之智。亦即远离名想概念等虚妄分别之世俗认识，唯对真如之认识能如实而无分别。此智属于出世间智与无漏智，为佛智之相应心品。",
        "pinyin": "wfbz"
    },
    {
        "title": "声闻",
        "key": "shengwen",
        "describe": "梵语s ra^vaka，巴利语sa^vaka。音译舍罗婆迦。又意译作弟子。为二乘之一，三乘之一。指听闻佛陀声教而证悟之出家弟子。",
        "pinyin": "sw"
    },
    {
        "title": "堕胎",
        "key": "duotai",
        "describe": "堕胎又称中断怀孕或人工流产，故意结束妊娠，取出胚胎或者导致胎儿死亡的行为。在中国，人们普遍不对堕胎做任何生命伦理方面的讨论，在一胎制的背景下很多人采取自愿堕胎，或被有关部门实行强制堕胎。而在许多国家（特别是西方国家）堕胎是备受争议的一种行为，主要为道德、宗教和女性身体权问题。",
        "pinyin": "dt"
    },
    {
        "title": "素食",
        "key": "sushi",
        "describe": "素食是一种不食肉、家禽、海鲜等动物产品的饮食方式，有时也戒食或不戒食奶制品和蜂蜜。一些严格素食者极端排斥动物产品，不使用那些来自于动物的产品，也不从事与杀生有关的职业。 　　现代社会中，素食者越来越多，素食人群也趋年轻化。素食主义不再是一种宗教和教条，素食者也没有道德优越感，选择素食只是选择了一种有益于自身健康、尊重其他生命、爱护环境、合乎自然规律的饮食习惯，素食已经逐渐成为符合时代潮流的生活方式。",
        "pinyin": "ss"
    },
    {
        "title": "无色界",
        "key": "wusejie",
        "describe": "无色界为三界之一，又称无色天。“色”是质碍的意思，无色就是没有质碍，即指超越了物质世界的束缚，所得到的自由状态。是通过修习厌离物质的四无色定，或称四空处定而获得的天界果报。无色界没有物质现象，只剩下受、想、行、识四种生命特性。",
        "pinyin": "wsj"
    },
    {
        "title": "观照",
        "key": "guanzhao",
        "describe": "即以智慧观事、理诸法，而照见明了之意。又‘观照般若’则指能观照事、理等诸法实相之理之智慧，为五种般若之一。肇论（大四五·二一三上）：‘观照般若，照事照理故。’",
        "pinyin": "gz"
    },
    {
        "title": "有漏皆苦",
        "key": "youloujieku",
        "describe": "漏”就是烦恼。 　　众生不明白一切法缘生缘灭、无常无我的道理，在无常的法上贪爱追求，在无我的法上执着为“我”，或为“我所有”，这叫“惑”。“惑”使人烦恼，所以又叫做烦恼。 　　烦恼的种类极多。贪（贪欲）、嗔（嗔恨）、痴（不知无常无我之理等第）是三毒，再加上慢（傲慢）、疑（犹疑）、恶见（不正确的见解如常见、断见等），组成六根本烦恼。由于烦恼造种种业。",
        "pinyin": "yljk"
    },
    {
        "title": "证果",
        "key": "zhengguo",
        "describe": "指证入果位。即以正智契合真理，进入佛、菩萨、声闻、缘觉等之果位。 　　如三乘人断惑证理，分别到达极果。又如大乘证得初地乃至等觉等菩萨之分果及佛之满果，小乘证得阿罗汉、阿那含等之四果，皆称为证果。 　大唐西域记卷七吠舍厘国条，有关于舍利子等证得阿罗汉果之记载。华严五教章卷三解释摄论（梁译摄大乘论释卷十七）‘由惑至惑尽，证佛一切智’之语，谓（大四五·四九三上）：‘惑尽者，是所知障尽，即由留烦恼障起胜行故，得至此位证佛果也。’此为有关菩萨之断惑证果。",
        "pinyin": "zg"
    },
    {
        "title": "四圣谛",
        "key": "sishengdi",
        "describe": "四谛是释迦牟尼体悟的苦、集、灭、道四条人生真理，四谛告诉人们人生的本质是苦，以及之所以苦的原因、消除苦的方法和达到涅槃的最终目的。",
        "pinyin": "ssd"
    },
    {
        "title": "无漏",
        "key": "wulou",
        "describe": "（术语）漏者烦恼之异名，漏泄之义，贪嗔等之烦恼，日夜由眼耳等六根门漏泄流注而不止，谓之漏。又漏为漏落之义，烦恼能令人漏落于三恶道谓之漏。因之谓有烦恼之法云有漏，离烦恼之法云无漏。俱舍论二十曰：‘诸境界中，流注相续，泄过不绝，故名为漏。’大乘义章五本曰：‘流注不绝，其犹疮漏，故名为漏。’法华文句一曰：‘毗昙云：漏落生死。’",
        "pinyin": "wl"
    },
    {
        "title": "放生仪轨",
        "key": "fangshengyigui",
        "describe": "放生仪轨是正信佛教徒为所救护物命获得究竟解脱，在物命耳边念诵的仪轨。在《金光明最胜王经》中，本师释迦牟尼佛的前世为所放生的鱼念诵宝髻佛名号，使鱼群寿尽离世后，立即转生为三十三天天子，而后逐渐皈依佛门，步入解脱大道。显密宗派有众多大德所作放生仪轨，多数可以直接依照法本念诵，不需传承。 　　如果时间紧急，则可大声念诵：嗡嘛呢叭美吽，啥！ 或：顶礼、供养、皈依如来、善逝、应供、正等觉宝髻佛！",
        "pinyin": "fsyg"
    },
    {
        "title": "果位",
        "key": "guowei",
        "describe": "佛教用语，在小乘佛教和大乘佛教中的内容有所差别，但有一点是相同的，都指的是修佛所达到的境界。",
        "pinyin": "gw"
    },
    {
        "title": "四禅八定",
        "key": "sichanbading",
        "describe": "四禅（梵catvāri -dhyānāni），又作四静虑、色界定。即色界天之四禅。色界天之四禅与无色界天之四无色定，合之而成八定，故知八定包含四禅。",
        "pinyin": "scbd"
    },
    {
        "title": "光音天",
        "key": "guangyintian",
        "describe": "佛教术语。色界天二十二层天第八层。参见色界详述。",
        "pinyin": "gyt"
    },
    {
        "title": "四众",
        "key": "sizhong",
        "describe": "四众，是佛教中名词。有不同的解释。《法华经》：比丘、比丘尼、优婆塞、优婆夷︰又称四部众、四部弟子。《法华文句》：发起众、当机众、影响众、结缘众。《异部宗轮论》：龙象众、边鄙众、多闻众、大德众。佛教徒四众：出家男女二众，在家男女二众。",
        "pinyin": "sz"
    },
    {
        "title": "五眼",
        "key": "wuyan",
        "describe": "五眼，是指从凡夫至佛位，对于事物现象终始本末的考察功能。有人称眼睛为「智慧之门」、「灵魂之窗」，眼睛能够明辨物象、增长知识。修行的层次越高，心眼作用的范围越广。",
        "pinyin": "wy"
    },
    {
        "title": "念珠",
        "key": "nianzhu",
        "describe": "念珠，又称念珠、数珠，主要是指一些宗教在祈祷、歌颂、念经、念咒或灵修时所用的物品，一般在各种传统宗教成员如道教、罗马天主教、东正教、英国国教、伊斯兰教、印度教、佛教、锡克教和巴哈伊教中使用。如道教的念珠，有81颗，代表太上老君八十一化，天主教的玫瑰念珠，有59颗，是用来念诵《圣母玫瑰经》，伊斯兰教的念珠，有33颗，转三圈正好是99,是用来念诵“安拉真主”的九十九个名字，佛教的念珠一般有108颗，代表除灭108种烦恼。随着宗教的不同和珠子数目的区别，赋予了念珠独特的含义。",
        "pinyin": "nz"
    },
    {
        "title": "赞叹",
        "key": "zantan",
        "describe": "梵语varn!a。赞扬歌叹之意。又作赞、叹。即以偈颂等赞扬歌叹佛菩萨之威德神力。据法华文句卷三下载，以言语表现赞叹者，称为寄言叹；无法以言语表现，而在心中加以赞叹者，称为绝言叹。世亲净土论中，赞叹门为五念门之一；善导之观经疏散善义亦谓赞叹供养为净土往生五正行之一。日本净土真宗主张，称念阿弥陀佛名号，得他力之信心者，方为真赞叹。",
        "pinyin": "zt"
    },
    {
        "title": "第六识",
        "key": "diliushi",
        "describe": "佛学术语， 第六意识也。 　　第六识又叫意识，在八个识当中，它的活动范围最宽，活动力量最强。它有时和前五识一起，对外在的境界起着种种分别；有时单独向内起着种种分别。由于从属于六识的“思心所”的发动身、语、意才构成种种活动。我们要纠正错误的思想和行为，也要依靠六识中的“慧心所”来修习禅观和智慧。因此，我们学佛的人有必要认识第六识知识的活动情况。",
        "pinyin": "dls"
    },
    {
        "title": "具足戒",
        "key": "juzujie",
        "describe": "佛教的具足戒是比丘、比丘尼受持的戒律，因为这些戒律与十戒相比，戒品具足，所以称具足戒。关于具足戒的条目，虽然各地都有不同，但大致内容是相同的。",
        "pinyin": "jzj"
    },
    {
        "title": "无量劫",
        "key": "wuliangjie",
        "describe": "《隋书·经籍志》：“一成一败，谓之一劫，自此天地已前，则有无量劫矣。” 宋 张商英《护法论》：“盖念一切众生无量劫来皆曾为己。”",
        "pinyin": "wlj"
    },
    {
        "title": "天台宗",
        "key": "tiantaizong",
        "describe": "中国佛教宗派之一。因创始人智顗常住浙江台州的天台山而得名。其教义主要依据《妙法莲华经》，故亦也称法华宗。",
        "pinyin": "ttz"
    },
    {
        "title": "万法",
        "key": "wanfa",
        "describe": "万法释义：佛教语。梵语dharma，意译“法”，指事物及其现象，也指理性、佛法等。",
        "pinyin": "wf"
    },
    {
        "title": "普佛",
        "key": "pufo",
        "describe": "普佛 就是打坐念经。所谓“普佛”，源于隋代信行禅师所创立的三阶教。",
        "pinyin": "pf"
    },
    {
        "title": "外道",
        "key": "waidao",
        "describe": "菩提道: 外道与附佛外道的区别: 佛教把佛陀所说的教法，符合因果实相正理的实证法道，佛弟子依之而修能成就无上正等正觉，故称为内道。因此之故，佛教也称为内教。意思是说，究竟的真理在我们的真心如来藏自性中，心外求法都是不究竟的。所以佛教把心外求法的种种宗教统称为外道。",
        "pinyin": "wd"
    },
    {
        "title": "三德",
        "key": "sande",
        "describe": "【三德】 出华严经疏 一恩德谓如来乘大愿力。救护众生。犹如赤子。是为恩德。二断德断德亦名解脱。谓如来断除一切烦恼惑业。净尽无余。是为断德。三智德智即智慧。谓如来以平等智慧。照了一切诸法。圆融无碍。是为智德。",
        "pinyin": "sd"
    },
    {
        "title": "盂兰盆",
        "key": "yulanpen",
        "describe": "“盂兰”是梵语，译作“倒悬”（人被倒挂），盆是指供品的盛器。佛法认为供此具可解救已逝去父母、亡亲的倒悬之苦。",
        "pinyin": "ylp"
    },
    {
        "title": "有漏",
        "key": "youlou",
        "describe": "有漏（佛教解释）　　梵语sa^srava。为‘无漏’之对称。漏，梵语a^srava，乃流失、漏泄之意；为烦恼之异名。基本信息　　《 佛学大词典 》-有漏　　(一)梵语sa^srava。为‘无漏’之对称。",
        "pinyin": "yl"
    },
    {
        "title": "正信",
        "key": "zhengxin",
        "describe": "正信，正直之信念。系相对于邪信而言，即指虔信佛说的正法之心，此信心不因遭逢诸异道而稍生疑念。",
        "pinyin": "zx"
    },
    {
        "title": "五盖",
        "key": "wugai",
        "describe": "五盖佛家用语，是指五种覆盖众生心识，使不能明了正道的烦恼。包括贪欲盖、嗔恚盖、惛沉睡眠盖、掉举恶作盖和疑盖。",
        "pinyin": "wg"
    },
    {
        "title": "无生",
        "key": "wusheng",
        "describe": "《大宝积经》卷八七：“无生者，非先有生，后说无生，本自不生，故名无生。",
        "pinyin": "ws"
    },
    {
        "title": "十善业道",
        "key": "shishanyedao",
        "describe": "十善业包括：一、不杀生，二、不偷盗，三、不邪淫，四、不恶口，五、不两舌，六、不妄语，七、不绮语，八、不贪，九、不嗔，十、不痴。或称十善业道。",
        "pinyin": "ssyd"
    },
    {
        "title": "供奉",
        "key": "gongfeng",
        "describe": "供奉，指祭祀神佛、祖先。泛指奉献。语出《汉书·王莽传中》：“秦为无道，厚赋税以自供奉，罢民力以极欲。”",
        "pinyin": "gf"
    },
    {
        "title": "学处",
        "key": "xuechu",
        "describe": "学处，汉语词汇，释义为修学之处、科目。 　　梵语s iks!a^pada，巴利语sikkha^pada。意谓所学之处。一般指戒律。即比丘、比丘尼学习戒律时，所遵循之戒条，如五戒、八戒、十戒等，称为学处。南传佛教称戒、定、慧三学为三学处。另据菩萨地持经卷一所载，菩萨有七学处，即：自利、利他、真实义、力、成熟众生、自熟佛法、无上菩提。此外，大日经卷六受方便学处品分显密而说所学之体，又译之为‘学句’。",
        "pinyin": "xc"
    },
    {
        "title": "菩萨道",
        "key": "pusadao",
        "describe": "菩萨道是大乘行者由发心修行到成佛中间的漫长路程，由于除自修自渡外，渡众生是重要的工作，要完成这种艰困的工作，就必须要有动机，它是渡生的动力，这就是慈悲心（在佛教中以大慈弥勒菩萨与大悲观世音菩萨为代表）；要有目标，就是宏伟的愿望（以大愿地藏菩萨为代表）；要有渡生的大智慧，好的工具与方法（以大智文殊菩萨为代表）；要有永恒不断的渡生行为（以大行普贤菩萨为代表）；最后要有大精进心去完成（以大势至菩萨为代表）。具有上面这五种条件，菩萨道才能顺利的走下去。",
        "pinyin": "psd"
    },
    {
        "title": "成道",
        "key": "chengdao",
        "describe": "达到真正的自知即成道。成道乃是意识的最高状态，造物界中所有灵魂的目标和终极命运。成道者持续不断地体验神的无限能力、知识和极乐。【苏非】法那-费拉；【吠檀多】涅未卡帕状态。【亦作】 成佛，大我觉悟，真理实现，我是神状态。",
        "pinyin": "cd"
    },
    {
        "title": "恶业",
        "key": "eye",
        "describe": "恶业：佛教术语。 　　业，梵文音译为“羯磨”，意译为造作。泛指众生一切有意识的行为活动。业有三种，即身业、口业、意业。恶业是身、口、意造下的罪恶行为。恶业有十种，不善则恶，是十善业的反面。即一杀生，二偷盗，三邪淫，四妄语，五两舌，六恶口，七绮语，八贪欲，九瞋恚，十邪见。",
        "pinyin": "ey"
    },
    {
        "title": "真身",
        "key": "zhenshen",
        "describe": "亦即诸佛之法身、报身之谓。大智度论卷三十（大二五·二七八上）：‘佛身有二种，一者真身，二者化身。众生见佛真身，无愿不满。佛真身者，遍于虚空，光明遍昭十方，说法音声亦遍十方无量恒河沙等世界，满中大众皆共听法，说法不息。一时之顷各随所闻而得解悟。",
        "pinyin": "zs"
    },
    {
        "title": "三恶道",
        "key": "sanedao",
        "describe": "【三恶道】 一切众生造作恶业而生其处。 　　一、地狱道，谓此处在地之下。铁围山间。有八寒八热等狱。八寒者。頞浮陀狱。泥赖浮陀狱。阿吒吒狱。阿波波狱。呕喉狱。郁波罗狱。波头摩狱。芬陀利狱也。八热者。想狱。黑绳狱。堆压狱。叫唤狱。大叫唤狱。烧炙狱。大烧炙狱。无间狱也。 　　二、饿鬼道，有三种。一谓罪业极重者。积劫不闻浆水之名。其次者。但伺求人间荡涤脓血粪秽。又其次者。时或一饱。即造作恶业众生。由悭贪故。 　　三、畜生道，谓披毛戴角。鳞甲羽毛。四足多足。有足无足。水陆空行等。由愚痴故。",
        "pinyin": "sed"
    },
    {
        "title": "顺境",
        "key": "shunjing",
        "describe": "顺境，即顺利的境遇。与‘逆境’相对。顺利的、有利于人的发展的境遇。",
        "pinyin": "sj"
    },
    {
        "title": "法门",
        "key": "famen",
        "describe": "法门，佛教用语，原指修行者入道的门径，今泛指修德、治学或作事的途径。古称南门为法门。另指《霹雳布袋戏》中有别于儒、道、释三教之外，以法理为本的教派，由法门教祖「殷末箫」一手创建，在武林中位居超然地位，受理武林大小派门委托审理各项案件纷争，赏善惩恶，执法。",
        "pinyin": "fm"
    },
    {
        "title": "悟道",
        "key": "wudao",
        "describe": "道，是宇宙的根本，生育万物，养育万物，运行万物，其大无外，其小无内，无所不包，无形无象，本无名字，人强名为道。老子中言：“道可道，非常道。名可名，非常名。”是说道可以说它是道，但所言的道就不是那个道了，名可以给它命个名，但所说的名就不是这个东西了。因为道本无名，人强名为道，无名之时，人们可以把它命名为色、空、有、无、魔、神、鬼、虫、家、男、黑等不可尽说，总之无所不可名，如人们一开始把它命名为魔，后人们就认为它是魔了，所以说，它不是道，只是强安一个假名叫作道。",
        "pinyin": "wd"
    },
    {
        "title": "传法",
        "key": "chuanfa",
        "describe": "传法，广义上指传授佛法，狭义上特指传承佛教宗派法脉，事实上也就是选择和确认有资格担任寺院住持（主持讲经说法和领导僧尼参禅悟道修行的僧侣）之僧侣的一个过程。 　　在佛教禅宗门派中，又称此为嗣法，即由上师将“佛祖源流”和“衣钵（袈裟和乞食器皿）”传递给接法人，作为选择和确认住持寺院法席继承人资格的凭证。 　　佛教禅宗从六祖惠能开始不再把传递“衣钵”作为传法的凭证，，而改以传递《法卷》作为选择和确认住持寺院法席继承人资格的凭证。",
        "pinyin": "cf"
    },
    {
        "title": "三身",
        "key": "sanshen",
        "describe": "三身，佛学术语，梵语 trikāyāh 的意译，又作三身佛、三佛身、三佛。身即聚集之义，聚集诸法而成身，故理法之聚集称为法身（梵dharmakāya ），智法之聚集称为报身（梵sambhogakāya ），功德法之聚集称为应身（梵nirmā?akāya ）。",
        "pinyin": "ss"
    },
    {
        "title": "安忍",
        "key": "anren",
        "describe": "意思是人生苦短，谬误偏多，邪说炽盛，圣教难闻。寂天菩萨所著的《入菩萨行安忍品》以其卓识远见，全面细致、鞭辟入里地阐述了七十二种引人发怒动嗔的情境、嗔恚的危害、安忍的福报和怎样调柔自心去戒嗔安忍。",
        "pinyin": "ar"
    },
    {
        "title": "高僧",
        "key": "gaoseng",
        "describe": "指德行崇高之僧伽，亦为对佛门比丘之尊称。虹化就是得道高僧在圆寂时出现的一种神秘现象。据说，修炼大圆满到很高境界的高僧在圆寂时，其肉身会化作一道彩虹而去，进入佛教所说的空行净土的无量宫中。在西藏历史上，大圆满虹化身成就的事例非常之多。",
        "pinyin": "gs"
    },
    {
        "title": "逆缘",
        "key": "niyuan",
        "describe": "佛学术语，为“顺缘”之对称，遇到恶事恶人为佛道之缘也，即比喻成功道路上的磨练，并非自身因果，乃为他业影响。盖对于佛果菩提则恶为逆缘，善为顺缘，对于生死苦果，则善为逆缘，恶为顺缘。总之违逆固体之果性者，皆逆缘也。 逆缘有很多种，可简化为根本的二类，一类起于器世间，另一类起于器世间内的有情。",
        "pinyin": "ny"
    },
    {
        "title": "大悲水",
        "key": "dabeishui",
        "describe": "大悲水的用途十分广泛，举凡举行一切佛教仪式，或有人生病，都可以用大悲水清洁坛场或用于饮用。而效果往往不可思议。印光大师在闭关中，也常常诵念大悲咒加持大米和净水，施舍给有病的人们，甚至患了绝症无法治愈的人们，其效果很是神奇。",
        "pinyin": "dbs"
    },
    {
        "title": "欲界",
        "key": "yujie",
        "describe": "佛教把世界分成欲界、色界、无色界，合称三界。 　　从六趣本身，又将天、人、阿修罗称为三善趣或三善道，将地狱、饿鬼、畜生称为三恶趣或三恶道。又有佛、菩萨来此度生及有修行成圣果者，又称凡圣同居地。人天合为十善趣。此立足于人，地狱在下，最底层是无间地狱；天在上，他化自在天位居最上。 欲界是没有摆脱世俗的七情六欲的众生所处境界。",
        "pinyin": "yj"
    },
    {
        "title": "无住",
        "key": "wuzhu",
        "describe": "佛教语。实相之异名。谓法无自性，无自性，故无所住着，随缘而起，故云无住。故无住者万有之本也。佛教称“无住”为万有之本。",
        "pinyin": "wz"
    },
    {
        "title": "缘觉",
        "key": "yuanjue",
        "describe": "梵语pratyeka-buddha，巴利语pacceka-buddha。音译钵剌医迦佛陀、毕勒支底迦佛、辟支迦佛、贝支迦佛、辟支佛。又作独觉、缘一觉、因缘觉。为二乘之一，三乘之一。指独自悟道之修行者。即于现在身中，不禀佛教，无师独悟，性乐寂静而不事说法教化之圣者。声闻与缘觉，称为二乘；若共菩萨，则为三乘。",
        "pinyin": "yj"
    },
    {
        "title": "佛堂",
        "key": "fotang",
        "describe": "字面意思有两个 一是佛所住的堂殿 一是指供奉佛像的堂殿﹑堂屋。",
        "pinyin": "ft"
    },
    {
        "title": "斋日",
        "key": "zhairi",
        "describe": "斋日：斋日也就是指斋月中某一天或祖师圣诞或有斋醮科仪等活动时，道教徒必须严格按照道教仪范所规定内容行事。斋日是一月之中应持斋戒的日子。这一几天必须严格遵守道教戒律，这样行法时才能有天神护佑，才会有效。",
        "pinyin": "zr"
    },
    {
        "title": "华严宗",
        "key": "huayanzong",
        "describe": "华严宗，为中国(大乘)佛教八大宗派之一，也是中国佛教十三宗之一。 　　华严宗，依《华严经》立名，故称华严宗。又称贤首宗、法界宗、圆明具德宗，发源地为陕西西安华严寺。该宗依《大方广佛华严经》立法界缘起、事事无碍的妙旨，以隋代杜顺和尚（公元五五七至六四〇年，即法顺）为初祖。 　　华严主要教理为法界缘起说。宇宙万法、有为无为、色心缘起时，互相依持，相即相入，圆融无碍，如因陀罗网，重重无尽；并用四法界、六相、十玄等法门，来阐明无尽缘起的意义。其理论有四法界、六相、十玄门等。",
        "pinyin": "hyz"
    },
    {
        "title": "空观",
        "key": "kongguan",
        "describe": "佛教语。对空谛的观想。以体认无相为宗。亦指天台宗所立一心三观(空观、假观、中观)之一。 南朝 宋 谢灵运 《石壁立招提精舍》诗：“禅室栖空观，讲宇析妙理。” 清 龚自珍 《己亥杂诗》之一：“空观假观第一观，佛言世谛不可乱。” 清 龚自珍 《正译第五》：“修三止者，是体真止依止。修三观者，是空观依止。”参见“ 空谛 ”。",
        "pinyin": "kg"
    },
    {
        "title": "心性",
        "key": "xinxing",
        "describe": "心性。谓性情；性格。中国古典哲学范畴，指“心”和“性”。 战国 时 孟子 有“尽心知性”之说。其后佛教各宗盛谈心性，禅宗认为心即是性，倡明心见性，顿悟成佛。 宋 儒亦喜谈心性，但各家解说亦不一。语出晋 葛洪 《抱朴子·交际》：“今先生所交必清澄其行业，所厚必沙汰其心性。” 宋 柳永 《红窗睡》词：“二年三岁同鸳寝，表温柔心性。”《黄檗山断际禅师传心法要》：“心性不异，即心即性。”",
        "pinyin": "xx"
    },
    {
        "title": "摩诃",
        "key": "mohe",
        "describe": "摩诃，佛学用语，是梵文音译词，也作”摩哈“，汉语口语读”马哈“，省略读法是”马”，其基本意思是“大”。据果德日珍逹俄活佛弟子法乐维分析，汉语的“马路”、“马勺”，包括“马大哈”的“马”都源于此，意思是“大”。 　　摩诃，这是梵文，汉语译为大智慧。因为汉字难尽其义，所以仍用原文，并且尊重这几个字，所以不译。",
        "pinyin": "mh"
    },
    {
        "title": "消灾",
        "key": "xiaozai",
        "describe": "消除灾祸。",
        "pinyin": "xz"
    },
    {
        "title": "福慧",
        "key": "fuhui",
        "describe": "基本解释：福德与智慧 　　隋炀帝 《遣使入天台山为智顗建功德愿文》：“设以辩才，千万亿偈，赞师福慧，终不能尽。” 唐 玄奘 《大唐西域记·窣禄勤那国》：“人性淳质，宗信外道，贵艺学，尚福慧。” 清 龚自珍 《瑶台第一层》词附《王孙传》：“君在家为佳子弟，出门为贵官，乃人世至矜贵人，亦何取以福慧之身忍而为此？” 周咏 《无题》诗：“满地干戈风雨恶，遥将福慧祝卿卿。”",
        "pinyin": "fh"
    },
    {
        "title": "贪欲",
        "key": "tanyu",
        "describe": "（1）无休止地求取(2）贪得无厌的欲望（3）过分的要求 　　佛教中言：贪嗔痴慢疑为五钝使，阻碍着人们的心灵变纯洁。 　　佛经里面阐述，贪欲是建立在眼、耳、鼻、舌、身、意上面的。我们是眼睛想看，耳朵想听，鼻子想闻，舌头想尝味道，身体想去接触，意识里念着许多东西引起的贪欲心，而引起无穷无尽的贪欲，这是贪欲的基本来源。 　　我们可以理解成，是为了身体的享受产生的不大正常的追求，应该要加以驾驭，否则虽然对人生是一种动力，更是一种伤害。",
        "pinyin": "ty"
    },
    {
        "title": "加行",
        "key": "jiaxing",
        "describe": "所谓的加行，就是用自利利他的心，勇猛地修行不退，称为加行。菩萨的加行以布施来说是菩萨应该观察：我要给予众生利益，现在有众生来求助于我，就要欢欢喜喜地布施给他；另一方面，布施可得大财福德，将来会有更多的大财宝、福德布施给众生，所以要努力布施；在另一方面是菩萨深知自己有悭贪的心，要用布施来对治他，故要努力布施，此就是布施的加行。",
        "pinyin": "jx"
    },
    {
        "title": "拜忏",
        "key": "baichan",
        "describe": "拜忏的意思就是忏悔，忏就是忏除我们过去所有的业障，悔就是悔改，未来更不再造诸多的业障。忏悔其实是我们至诚恳切地礼佛、念佛、称念佛的名号，由佛菩萨的慈悲摄受，发露自己过现的罪业，誓愿未来永不重做如此恶业，并在忏悔后复不再造。",
        "pinyin": "bc"
    },
    {
        "title": "相续心",
        "key": "xiangxuxin",
        "describe": "佛学术语，三心之一。谓忆念弥陀之信心念念相续，更无余念间杂而相续不断。",
        "pinyin": "xxx"
    },
    {
        "title": "修定",
        "key": "xiuding",
        "describe": "修定是三无漏学之一。 　　戒定慧合称为三无漏学，即三项训练。佛陀教导我们需要培育的就是这三学： 　　1 修戒——完善道德品行； 　　2 修定——致力于内心平静； 　　3 修慧——培育智慧。 　　戒定慧三学是次第的关系，即循序渐进的关系。先要完善自己的品德；有了品德，就应尝试让自己的心平静；内心平静了，应进一步提升智慧。",
        "pinyin": "xd"
    },
    {
        "title": "四念处",
        "key": "sinianchu",
        "describe": "四念处是指四个安顿心念的处所，又称为四念处观。为什么把它称为四念处观呢？因为它并不纯粹在于修定，而是以智慧用四种法观察四念处来破除四种颠倒，故称为四念处观。",
        "pinyin": "snc"
    },
    {
        "title": "实相",
        "key": "shixiang",
        "describe": "实相（佛教解释）　　实相为佛教专用术语。实者，非虚妄之义，相者无相也。是指称万有本体之语。曰法性，曰真如，曰实相，其体同一也。就其为万法体性之义言之，则为法性；就其体真实常住之义言之，则为真如；就",
        "pinyin": "sx"
    },
    {
        "title": "洒净",
        "key": "sajing",
        "describe": "据《 中华佛教百科全书 》 佛教仪式。即洒香水以净物之仪式。又作洒水。行此法时，须结印契，并持诵真言以加持香水，然后散洒该香水以净化道场或供具等物。如《有部毗奈耶破僧事》卷二记述劫比罗仙人为懿摩弥王四子洒水结界之事，云（大正24·104c）：“时彼仙人有神通力，随其所乐皆得成就。即持金瓶盛满中水，诣余好处洒水为界，告王子曰︰汝等可于此地安止。时诸王子奉仙人教已，即筑城壁止住其内。彼仙人洒水为界，因此立名为劫比罗城。”",
        "pinyin": "sj"
    },
    {
        "title": "止观",
        "key": "zhiguan",
        "describe": "止，巴利语samatha，音译作奢摩他；义为平静，乃是心处于专一、不动、无烦恼、安宁的状态，亦即禅定的修行法门。 　　观，巴利语vipassanà，音译作毗婆舍那；乃是直观觉照一切名色法（身心现象）的无常、苦、无我本质，亦即智慧的修行法门。",
        "pinyin": "zg"
    },
    {
        "title": "即身成佛",
        "key": "jishenchengfo",
        "describe": "即身成佛的简单解释，即是不须改变现在的肉体，能够成为正知正觉的佛。",
        "pinyin": "jscf"
    },
    {
        "title": "恶趣",
        "key": "equ",
        "describe": "梵语 durgati，巴利语 duggati。又作恶道。为「善趣」之对称。趣，为往到之义。即由恶业所感，而应趣往之处所。据俱舍论卷八载，五趣之体为无覆无记，又五趣摄於有情数；即谓由善恶业所招感之异熟无记之果体，名之为趣，故说一切有部主张「趣」不通於善、染及器世界。",
        "pinyin": "eq"
    },
    {
        "title": "果地",
        "key": "guodi",
        "describe": "所证之果的地位。三乘的果地各有不同，声闻乘就有四果的分别。 　　果地：依因位之修行而得某悟结果之位也。三乘各异果地，声闻乘之中，又有四果之别。楞严经四曰：“因地发心与果地觉，为同为异。”玄义六上曰：“果地圆极，非复因位。” 所证之果的地位。",
        "pinyin": "gd"
    },
    {
        "title": "初入佛门",
        "key": "churufomen",
        "describe": "初入佛门者，往往有一个错误的认识，以为能打坐、念佛、诵经、持咒的功课，每天坚持做，这样就是修行了。不知道这只是修行的助缘，真正的修行，是修正自己的身口意行为，特别是心理行为，把自己不善的习惯改过来，变得善良；把自己心胸狭獈的习惯改过来，变得心胸宽广，有容人之量；把自己自私贪小便宜的习惯改过来，变得大方，乐于助人；把自己易发脾气的一面改过来，变得内心柔软；把自己残忍杀生的习惯改过来，变得慈悯生命；把自己好色好淫的习惯改过来，变得正行无染；把自己好酒的习惯改过来，变得精神清明；",
        "pinyin": "crfm"
    },
    {
        "title": "牌位",
        "key": "paiwei",
        "describe": "牌位是指书写逝者姓名、称谓或书写神仙、佛道、祖师、帝王的名号、封号、庙号等内容，以供人们祭奠的木牌。 　　按照我国民间传统习俗，人逝世后其家人都要为其制作牌位，作为逝者灵魂离开肉体之后的安魂之所。牌位大小形制无定例，一般用木板制作，呈长方形，下设底座，便于立于桌安之上。牌位书写，古代一般多用老宋体（笔划竖粗横细）、自上而下竖写，现代则多采用正楷、隶书、魏碑、等字体，以示庄重、肃穆。古往今来，民间广泛使用牌位，用于祭奠已故亲人和神祇（指天地之神）、佛道、祖师等活动。",
        "pinyin": "pw"
    },
    {
        "title": "厌离",
        "key": "yanli",
        "describe": "佛教术语。俱舍论卷二十五、顺正理论卷七十二：即指有厌非离、有离非厌、有厌亦离、有非厌离等四句。盖所谓‘厌’，系指观苦、集之现象而厌斥之行相；所谓‘离’，系指既厌斥之，乃生起断惑离染之作用。厌与离各有广狭之不同，故成四句分别。",
        "pinyin": "yl"
    },
    {
        "title": "西方净土",
        "key": "xifangjingtu",
        "describe": "即指阿弥陀佛之净土。又称极乐净土、极乐国土、西方净土、西方、安养净土、安养世界、安乐国。自此世间向西而去，经过十万亿佛土之彼方即为极乐净土。关于该净土之情况，在阿弥陀经中有详细之解说，而阿弥陀佛今仍在彼处说法。据无量寿经等所载，往生于该佛土者身受诸种快乐，例如，身上有如佛之三十二相，且具五眼六神通，五官之对境非常微妙，心中舒畅清凉，在心中闻法，供养佛菩萨，即得开悟。然在该净土中，有所谓边地、疑城、胎宫等处，乃为怀疑阿弥陀佛之救度者之往生地。",
        "pinyin": "xfjt"
    },
    {
        "title": "忍辱",
        "key": "renru",
        "describe": "修忍辱时不要著忍辱的法相，以为我是能忍，以及有我所忍受的程度，有能有所即离不开四相。闻赞则喜，闻谤则怒，心中即起波浪，离四相谈何容易！应先渐修，后可顿超。修行一事没有天生的，纵有顿根的人，亦是过去世修来的。欲求大彻大悟，须以佛法慢慢熏习，每天需要念经，单单念而不解其义，收效甚微，对于经义要圆解、要深解，日常生活当中，遇到什么境界都能运用上去，举心动念均是修行，功夫用得上，日久必有成就。人我执不易断，凡事看淡一点，即算有进步，愈淡薄愈自在，即是渐渐的放下。四相空了，说一个忍辱也是多余的。",
        "pinyin": "rr"
    },
    {
        "title": "刹土",
        "key": "shatu",
        "describe": "佛教语。田土；国土。《救面然饿鬼陀罗尼神咒经》：“尊重赞叹一切如来，刹土三寳诸佛忆念。”按， 唐 玄应 《一切经音义》卷一：“刹，梵言差多罗，此译云土田。经中或言国，或云土者，同其义也。或作刹土者，存二音也。”",
        "pinyin": "st"
    },
    {
        "title": "三毒",
        "key": "sandu",
        "describe": "三毒指的是贪欲、憎恨、愚痴。愚痴是三毒中最根本的一个。人生之所以痛苦，就是因为有贪、嗔、痴三毒的存在，贪让人永不满足，嗔让人产生恶意，痴让人产生错误的认知，错误的认知又会导致贪欲、憎恨、愚痴。佛教中，通常用鸽子、蛇、猪代表贪欲、憎恨、愚痴三毒。",
        "pinyin": "sd"
    },
    {
        "title": "持斋",
        "key": "chizhai",
        "describe": "持斋（diet-keeping），指遵行戒律不茹荤食。佛教修行制度之一。语出《梁书·文学传下·刘杳》：“自居母忧，便长断腥羶，持斋蔬食。”",
        "pinyin": "cz"
    },
    {
        "title": "灵山",
        "key": "lingshan",
        "describe": "佛教中的灵山一词是出自佛经 一些大乘经典上有。",
        "pinyin": "ls"
    },
    {
        "title": "子女",
        "key": "zinv",
        "describe": "子女：指的是父母的儿子和女儿，还有别的说法是年轻的少男少女。",
        "pinyin": "zn"
    },
    {
        "title": "罪障",
        "key": "zuizhang",
        "describe": "佛教谓罪孽能障碍诸善，因称为“罪障”。《随求即得大自在陀罗尼神咒经》：“其此比丘承此呪力，罪障消除，即得生於三十三天。” 南朝 齐 萧子良 《净住子净行法门·戒法摄生》：“良以三涂苦报，罪障所缠，人天胜果，堪为道器。” 宋 陈善 《扪虱新话》卷二：“昔未闻道，罪障固多；今闻道矣，罪障灭乎？”",
        "pinyin": "zz"
    },
    {
        "title": "精舍",
        "key": "jingshe",
        "describe": "精舍，寺院别称之一，又作精庐。原指智德精练者的舍宅。佛陀时代称寺为精舍，如竹林精舍、祇园精舍。这些精舍大都建在城外幽静的林地，也称「兰若」，即寂静处；又称「伽蓝」，是僧众居住的园林。第一座精舍是竹林精舍。摩竭陀国的首都王舍城，以繁华富丽驰名全印，据说有三十二个大门和六十四个小门，规模宏大。当时佛陀还过著云水僧生活，随托钵所到之处，就在清静树林中禅坐。佛教的拥护者频婆娑罗王，了解众僧虽然过惯了云水生活，但也应该有个适合的住处，以利弘化事业的推展，因此便在王舍城北面郊外寻得一处竹林遍布的",
        "pinyin": "js"
    },
    {
        "title": "十地",
        "key": "shidi",
        "describe": "十地是大乘菩萨道的修行阶位，即指十种地位，十个菩萨行的重要阶位。又作十住。地，梵语 bhu^mi，乃住处、住持、生成之意。即住其位为家，并于其位持法、育法、生果之意。",
        "pinyin": "sd"
    },
    {
        "title": "空见",
        "key": "kongjian",
        "describe": "1．拨无因果的邪见。2．执著于空的见解。 　　指不承认三世因果之理，或执着于空法而全然否定诸法存在之妄见。",
        "pinyin": "kj"
    },
    {
        "title": "持咒",
        "key": "chizhou",
        "describe": "持，持是持而不散的意思。咒是一种陀罗尼，又叫总持，总一切法，持无量义，能令恶法不生，善法增长。以及使持者获得咒本身的一些功德。 　　持咒就是获得一种习惯，时刻的不忘失，功夫到了一定程度后嘴虽然不诵咒，但是会有一种咒的力量在身上保护，也是以心持咒 ，将念头集中在咒文上 ，咒文之所以繁琐， 最重要的一点就是容易摄心， 但若是有口无心 ，不论什么咒都起不到效果 ，初学者可以言持 ，功夫到后可以心持， 简单说就是念。",
        "pinyin": "cz"
    },
    {
        "title": "戒律",
        "key": "jielv",
        "describe": "梵语尸罗，S ila译曰戒，防非止恶之义。梵语优婆罗叉Upalaks!a，译曰律（净影），梵语毗尼Vinaya，译曰律（南山），法律之义。多指有条文规定的宗教徒必须遵守的生活准则。",
        "pinyin": "jl"
    },
    {
        "title": "禅说",
        "key": "chanshuo",
        "describe": "禅说，犹禅学。谓禅宗教理。禅宗的禅与六波罗蜜的禅是同一个事物，又是分别的两个事物；它与四禅八定的禅可说是同一个事物，又有所不同。禅宗有四句格言：“教外别传，不立文字，直指人心，见性成佛”。既然是“教外别传、不立文字”，那为什么还要讲呢？因为不借助语言文字，想进入禅就很困难，不得其门而入。",
        "pinyin": "cs"
    },
    {
        "title": "成佛",
        "key": "chengfo",
        "describe": "成佛是佛教语。谓永离生死烦恼，成就无上正等正觉。菩萨因位之行六度及十度万行究竟圆满而成办阿耨多罗三藐三菩提，谓之成“佛”。真言立三种之即身成佛，天台立四种之成佛，《占察经》说四满成佛。日本民间常以死者得到超度，谓之“成佛”。 　　成佛的方法很多，不同的佛教宗派有不同的成佛方法。当前，在国内佛教有三大宗派，实践三种成佛方法。",
        "pinyin": "cf"
    },
    {
        "title": "禅林",
        "key": "chanlin",
        "describe": "禅林，初指僧人的陵地，后借指寺院。一般常指佛家修行的寺院。",
        "pinyin": "cl"
    },
    {
        "title": "佛教徒",
        "key": "fojiaotu",
        "describe": "佛教徒是信仰佛法僧三宝的在家，出家四众的通称。包括在家（优婆塞，优婆夷）众，出家（比丘，比丘尼）众，合称四众弟子。（也有七众的说法，包括优婆塞，优婆夷，比丘、比丘尼、沙弥、沙弥尼、戒叉摩那尼）。",
        "pinyin": "fjt"
    },
    {
        "title": "依止",
        "key": "yizhi",
        "describe": "即依存而止住之意；或以某事物为所依而止住或执着。 　　又一般谓依赖于有力、有德者之处而不离，亦称为依止。法华经方便品（大九·八中）：‘若有若无等，依止此诸见。’大乘庄严经论卷四述求品，谓依止（梵a^s raya ）作意为十八种作意之一，同经卷八以依止（梵nis raya ）为八无上之一。",
        "pinyin": "yz"
    },
    {
        "title": "邪见",
        "key": "xiejian",
        "describe": "五见使中，拨无因果之见叫做邪见。2．凡是不合正法的外道之见都可叫做邪见。",
        "pinyin": "xj"
    },
    {
        "title": "善巧",
        "key": "shanqiao",
        "describe": "善巧，对自己、对教化众生是必要的。善巧智慧是什么？我们前面学过十波罗蜜，十波罗蜜是以般若波罗蜜为基础、为根本，后面四条就叫做善巧，总名为善巧。方便、愿、力、智，这前面学过，这些就是方便、愿、力、智，能帮助自己向上提升，能帮助众生，所以自行化他都不能离开善巧方便。",
        "pinyin": "sq"
    },
    {
        "title": "八正道",
        "key": "bazhengdao",
        "describe": "八正道，亦称八支正道、八支圣道或八圣道。意谓达到佛教最高理想境地（涅槃）的八种方法和途径：①正见。②正思维。③正语。④正业。⑤正命。⑥正方便。⑦正念。⑧正定。",
        "pinyin": "bzd"
    },
    {
        "title": "授记",
        "key": "shouji",
        "describe": "基本意义： 1、十二部经之一2、佛教语：佛对发心之众生授与当来必当作佛之记别也。 　　授记有二种授记、三周授记、四种授记、六种授记和八种授记。",
        "pinyin": "sj"
    },
    {
        "title": "般舟三昧",
        "key": "banzhousanmei",
        "describe": "般舟三昧，又称“十方现在佛悉在前立三昧”。般舟三昧是以一日一夜或更长时间经行不断，不坐不卧，不停念阿弥陀佛的修行法门。能快速破除睡盖。连续行走九十天能快速证得般舟三昧，十方诸佛皆在前立。",
        "pinyin": "bzsm"
    },
    {
        "title": "本性",
        "key": "benxing",
        "describe": "本性，即天性。固有的性质或个性。本性本是不分善恶的，遇善则善，遇恶则恶，善恶不可分割，相互制约；善则顺理，恶则违理，无记则可中和二者。孟子性善论是针对人性的优点而言的，遵循了宇宙本源之理；荀子性恶论是针对人性的缺点而言的，违背了宇宙本源之理。",
        "pinyin": "bx"
    },
    {
        "title": "中观",
        "key": "zhongguan",
        "describe": "中观，有多个方面的意思，有宗教学解释，社会学解释，也是经济学的分支即中观经济学。",
        "pinyin": "zg"
    },
    {
        "title": "修善",
        "key": "xiushan",
        "describe": "（术语）断恶行善也。又对于性善之称，本有之善曰性善，修成之善曰修善。修善即性善，实大乘之通谈也。见性恶条。",
        "pinyin": "xs"
    },
    {
        "title": "孝养",
        "key": "xiaoyang",
        "describe": "孝养的意思是竭尽孝忱奉养父母。详细解释：古文出处：《书·酒诰》：“肇牵车牛远服贾，用孝养厥父母。” 孔 传：“农功既毕，始牵车牛，载其所有，求易所无，远行贾卖，用其所得珍异孝养其父母。”《汉书·文帝纪》：“今岁首，不时使人存问长老，又无布帛酒肉之赐，将何以佐天下子孙孝养其亲？”",
        "pinyin": "xy"
    },
    {
        "title": "佛家",
        "key": "fojia",
        "describe": "1 诸佛之净土。《观无量寿经》：“当坐道场，生诸佛家。” 　　2 谓属于佛教者。如佛教的学术思想、佛教僧侣等。《朱子语类》卷七六：“佛家有函盖乾坤句，有随波逐流句，有截断众流句，圣人言语亦然。”《二刻拍案惊奇》卷一：“即是道家青牛骑出去，佛家白马驮将来，也只是靠这几个字，致得三教流传，同于三光。”",
        "pinyin": "fj"
    },
    {
        "title": "道场",
        "key": "daochang",
        "describe": "梵文Bodhimanda的意译，音译为菩提曼拏罗。如《大唐西域记》卷八称释迦牟尼成道之处为道场。后借指供佛祭祀或修行学道的处所。如中国佛教五大名山，分别为文殊菩萨、普贤菩萨、地藏菩萨、观音菩萨、弥勒菩萨的道场。也泛指佛教、道教中规模较大的诵经礼拜仪式。如水陆道场、慈悲道场、天师道场等。",
        "pinyin": "dc"
    },
    {
        "title": "修慧",
        "key": "xiuhui",
        "describe": "慧的意义，是能分别事理，了解事物的真相，断除自他心中疑惑，对人对事，皆能够正确理解，谓之慧。古人说：“能达有为之事相名智，能达无为之至理为慧，合言之名智慧。”大乘义章言：“慧心安法，名之为忍；于慧决断，说之为智。”又言：“据行方便，发达名慧；就实以论，真心体明，自性无暗，目之为慧。”可知智慧，实是人性的光明，可名之为觉性，亦即是人人本具的佛性。",
        "pinyin": "xh"
    },
    {
        "title": "三学",
        "key": "sanxue",
        "describe": "佛教教义。学佛者必须修持的三种基本学业，即戒、定、慧。亦称增上（卓越）戒学，指戒律。即防止行为、语言、思想三方面的过失。由于大小乘的不同，其戒律也有所不同。另外对出家的僧侣和在家的居士也有所区别。例如小乘有五戒、八戒、二百五十戒等；大乘有三聚净戒、十重四十八轻戒等。",
        "pinyin": "sx"
    },
    {
        "title": "上座部",
        "key": "shangzuobu",
        "describe": "上座部，又称上座部佛教，以八正道为根本，教法纯正。现存于东南亚的缅甸、泰国、斯里兰卡、柬埔寨、老挝、越南南部、中国云南边境等地区。二十世纪初开始进入西方社会，八十年代开始进入中文世界。在西双版纳、德宏、思茅、临沧等地，傣族、布朗族、德昂族几乎是全民信仰南传佛教，另有部份佤族也信仰南传佛教。",
        "pinyin": "szb"
    },
    {
        "title": "佛号",
        "key": "fohao",
        "describe": "佛号，读fó hào，（宗教界）佛教各诸佛及大菩萨的名号。 　　在寺庙里有的。",
        "pinyin": "fh"
    },
    {
        "title": "我相",
        "key": "woxiang",
        "describe": "佛教中，我相（梵a^tma-sam!jn~a^，藏bdag-tu hdu-s es）∶谓众生于五蕴法中，妄计有实我、我所。 　　凡是可以证“我”存在的任何境界，都是我相，比如痛苦或快乐，让自身意识到“我”的存在，如果没有“我”，就不会感受痛苦、快乐。其他如救济穷困、慈心不杀、发菩提心等都足以证明“我”的存在，甚至不生不灭境界、无上正等正觉都是“我”所要证取的。如果菩萨有妄心待降伏，有无量无边的众生待灭度，就是有我相。",
        "pinyin": "wx"
    },
    {
        "title": "佛果",
        "key": "foguo",
        "describe": "指成佛。又作佛位、佛果位、佛果菩提。佛为万行之所成，故称佛果，即能成之万行为因，而所成之万德为果。亦即从修行之因到达佛果之位，又指从声闻、菩萨之位至无上正等正觉之位。证得佛果之因，称为佛因，即指一切万行之善根、功德；又人名。（1063～1135）宋代僧。四川崇宁人，俗姓骆。参谒五祖山法演禅师而受其印证。宋徽宗敕赐“佛果禅师”之号。",
        "pinyin": "fg"
    },
    {
        "title": "行愿",
        "key": "xingyuan",
        "describe": "“行愿”二字来源于佛教文化中普贤菩萨的精神理念。“行”（act），是指实践的精神，“愿”（wish）是崇高而远大的理想。“",
        "pinyin": "xy"
    },
    {
        "title": "一乘",
        "key": "yicheng",
        "describe": "一乘，词语，意为：物之四数；表数量，用于马、车、轿子等；方六里为一乘之地；佛教语，谓引导教化一切众生成佛的唯一方法或途径。",
        "pinyin": "yc"
    },
    {
        "title": "事理",
        "key": "shili",
        "describe": "因缘生之有为法叫做事，不生不灭之无为法叫做理。2．世间森罗万象之相叫做事，真如的理体叫做理。 　　1、事物的道理。 　　2、事情，事项。 　　3、佛学常见词汇",
        "pinyin": "sl"
    },
    {
        "title": "法忍",
        "key": "faren",
        "describe": "佛教术语。法忍（安受苦忍）：菩萨在修道的过程中应忍受饥、渴、寒、热、天灾人祸、疾病等世间的一切苦法。忍者，忍耐、忍许之意。堪忍违逆之境而不起瞋心之谓；信难信之理而不惑为忍，即施於所观之法而忍许。",
        "pinyin": "fr"
    },
    {
        "title": "南传佛教",
        "key": "nanchuanfojiao",
        "describe": "南传佛教，又称上座部佛教。是指现在盛行于泰国、越南、老挝、柬埔寨、缅甸、斯里兰卡及我国云南省傣族地区等的佛教。它是原始佛教时期之后，部派佛教中的一个派系。南传，是从其源流及地理而说，因为这个派系是由印度南传到斯里兰卡而后发展起来的。这一系的佛学，近代发展比较快，世界上已有许多国家的佛学者用各种文字翻译和研究他们的典籍。",
        "pinyin": "ncfj"
    },
    {
        "title": "少欲知足",
        "key": "shaoyuzhizu",
        "describe": "佛经中所常期勉信众的生活态度。对于自己尚未得到之物不贪求，谓之少欲（alpeccha），对于已得之事法，即使少得亦觉满足谓知足（sam!tus!t!a）。",
        "pinyin": "syzz"
    },
    {
        "title": "放光",
        "key": "fangguang",
        "describe": "放光，是佛学术语。 　　佛用神通力来发放光明。大凡佛的种种放光，都对众生有利。 　　放光也有各处的不同，如足底放光，是利益地狱道的众生，膝盖放光，是利益畜生道的众生，小腹放光，是利益饿鬼道的众生，肚脐放光，是利益修罗道的众生，胸口放光，是利益人道的众生，肩上放光，是利益天道的众生，口里放光，是利益小乘的众生，眉间放光，是利益大乘的众生，肉髻放光，是利益上乘的根机，或是召集大菩萨，或是灌十方诸佛之顶。",
        "pinyin": "fg"
    },
    {
        "title": "罪业",
        "key": "zuiye",
        "describe": "教语。指身、口、意三业所造之罪；亦泛指应受恶报的罪孽。",
        "pinyin": "zy"
    },
    {
        "title": "感应道交",
        "key": "ganyingdaojiao",
        "describe": "感应道交：指众生之所感与佛之能应相交之意。佛陀与众生之关系如同母子之情，此既非众生之自力，亦非教化所致，乃由于机缘成熟，佛陀之力量自然能与之相应，亦即众生之「感」与佛陀之「应」互相交融。",
        "pinyin": "gydj"
    },
    {
        "title": "善业",
        "key": "shanye",
        "describe": "善业（善业）佛教把身﹑口﹑意三方面的活动称为 \"三业 \"这些 \"业 \"又分为善﹑不善﹑非善非不善三种能引起善恶等报应。善业指五戒十善等善事之作业。",
        "pinyin": "sy"
    },
    {
        "title": "三论宗",
        "key": "sanlunzong",
        "describe": "三论宗是中国隋唐时代佛教宗派，祖庭为西安草堂寺；南京栖霞寺。因据印度龙树 《中论》、《十二门论》和提婆 《百论》三部论典创宗而得名。又因其阐扬“一切皆空”、“诸法性空”而名空宗或法性宗。后秦鸠摩罗什传译《三论》，盛倡龙树、提婆之学，为创立三论宗奠定了理论基础。后来，南朝刘宋时僧朗将鸠摩罗什、僧肇的学说传入江南。僧朗弟子僧诠，僧诠门人法朗，数代相传，教义渐趋成熟。法朗门人吉藏集鸠摩罗什、僧肇、僧诠、法朗等人的三论学说的大成，创立三论宗。吉藏门下有慧远、硕法师等，硕门人有元康，继续弘扬“三论”。",
        "pinyin": "slz"
    },
    {
        "title": "恶念",
        "key": "enian",
        "describe": "恶念，汉语词语，邪恶的念头。《菩提心论》：“宿殃未殄，恶念旋起。” 清 梁章钜 《退庵随笔·躬行》：“才一善念动，则取白豆投其中，恶念动，则取黑豆投其中。” 鲁迅 《朝花夕拾·》：“当我失掉了所爱的，心中有着空虚时，我要充填以报仇的恶念！”",
        "pinyin": "en"
    },
    {
        "title": "佛土",
        "key": "fotu",
        "describe": "又作佛国、佛国土、佛界、佛刹。指佛所住之处，或佛教化之国土。即不仅指净土，甚且凡夫居住之现实世界（秽土），以其为佛教化之世界，亦称佛土。因此，自净土之意义言，弥勒菩萨之兜率天、观音菩萨之普陀洛伽山等，虽为净土，但均非佛土。",
        "pinyin": "ft"
    },
    {
        "title": "律宗",
        "key": "luzong",
        "describe": "律宗，中国佛教宗派之一，发源地是陕西西安净业寺。因着重研习及传持戒律而得名。实际创始人为唐代道宣。复因道宣住终南山，又有南山律宗或南山宗之称。 　　律宗的教理分成戒法、戒体、戒行、戒相四科，也称四分律宗。戒法是佛所判定的戒律；戒行是戒律的实践；戒相是戒的表现或规定，即五戒、十戒、二百五十戒等。该宗的主要学说是戒体论。戒体是受戒弟子从师受戒时所发生而领受在自心的法体。即由接受的作法在心理上构成一种防非止恶的功能。这是律宗教理的核心理论。",
        "pinyin": "lz"
    },
    {
        "title": "唯识",
        "key": "weishi",
        "describe": "梵语 （Vijñāptimātratāsiddhi）。音译毗若底摩坦喇多，梵语倒置，称为识唯，汉土译为唯识。 　　所谓唯识，即是简去心外诸法，择取识心。这是遮简迷情、外界有实我实法的存在，表显内界识心的真性法相。换句话说，唯识宗立论，以我人心识之外的万有现象，皆是由我人心识自体所变现而来，亦即是由第八阿赖耶识中的种子所变现生起，故除心识之外，万有现象皆非实在。因此说：‘唯识无境’；或自万有现象自识所变一面来说，称为‘唯识所变’。",
        "pinyin": "ws"
    },
    {
        "title": "心佛",
        "key": "xinfo",
        "describe": "1 依心成佛的意思。 　　2 是心是佛的意思。 　　3 心中所现之佛，叫做心佛。",
        "pinyin": "xf"
    },
    {
        "title": "礼忏",
        "key": "lichan",
        "describe": "礼拜与忏悔的略称，又作拜忏。即礼拜诸佛、菩萨，忏悔所造诸恶业。大抵藉由礼佛、诵读经文，以为忏悔之意。 　　礼拜与忏悔的略称。即礼拜诸佛、菩萨，忏悔所造诸恶业。大抵藉由礼佛、诵读经文，以为忏悔之意。",
        "pinyin": "lc"
    },
    {
        "title": "心地",
        "key": "xindi",
        "describe": "指人的存心、用心； 佛教语。指心，即思想、意念等； 心胸、气量。 总能够似宝玉这般人材心地？——《红楼梦》。",
        "pinyin": "xd"
    },
    {
        "title": "证得",
        "key": "zhengde",
        "describe": "梵语adhigama 或 abhisam!bodha，巴利语同。又作现证。为证悟体得之意。即由修道而证悟真理，并体达果位、智慧、解脱及功德等。瑜伽师地论卷六十四谓有四种证得：(一)诸有情业果证得，(二)声闻乘证得，(三)独觉乘证得，(四)大乘证得。其中，声闻乘证得又分为地证得、智证得、净证得、果证得、功德证得等五种；独觉乘证得分为先已得顺决择分‘善根证得、先已得证得证得、先未得证得证得三种；大乘证得则有发心证得、大悲证得、波罗蜜多证得、摄事证得、地证得、于五无量随至真如证得、不可思议威德信解证得、不共佛法证得等。",
        "pinyin": "zd"
    },
    {
        "title": "大觉",
        "key": "dajue",
        "describe": "(1) 大梦觉醒。 (2) 佛教语。谓正觉。《楞严经》卷六：“空生大觉中，如海一沤发。”《初刻拍案惊奇》卷二八：“但今生更復勤修精进，直当超脱玄门，上证大觉。” 清 黄景仁 《黄山寻益然和尚塔不得》诗：“大觉上上乘，立脚宜坚牢。” 　　(3) 指佛。",
        "pinyin": "dj"
    },
    {
        "title": "道衍",
        "key": "daoyan",
        "describe": "姚广孝（1335年－1418年），幼名天僖，法名道衍，字斯道，又字独闇，号独庵老人、逃虚子。长洲（今江苏苏州）人。明朝政治家、佛学家、靖难之役的主要策划者。",
        "pinyin": "dy"
    },
    {
        "title": "总持",
        "key": "zongchi",
        "describe": "在佛教中，“总持”为梵语陀罗Dh&amacronra&ndotblwi，译言总持。持善不失，持恶不使起之义，以念与定慧为体。菩萨所修之念定慧具此功德也。注维摩经一曰：‘肇曰：总持，谓持善不失，持恶不生。无所漏忌谓之持。’嘉祥法华疏二曰：‘问：以何为持体？答：智度论云：或说念，或说定，或说慧。今明一正观随义异名。’",
        "pinyin": "zc"
    },
    {
        "title": "恭敬",
        "key": "gongjing",
        "describe": "恭敬是现代词，是一个专有名词，指的是对尊长贵宾谦恭而有礼的。",
        "pinyin": "gj"
    },
    {
        "title": "无边",
        "key": "wubian",
        "describe": "无边是汉语词汇，解释为没有边际。",
        "pinyin": "wb"
    },
    {
        "title": "誓愿",
        "key": "shiyuan",
        "describe": "誓愿，指立誓时表示的心愿。见《警世通言·玉堂春落难逢夫》：“玉姐说：‘你指着圣贤爷说了誓愿。’”",
        "pinyin": "sy"
    },
    {
        "title": "佛力",
        "key": "foli",
        "describe": "佛之力用。佛具有二智，故亦称智力；以方便智能摄化众生，故亦称方便力；显示由佛果而起之力，故又称愿力。法华经方便品（大九·五下）：‘佛力无所畏，解脱诸三昧，及佛诸余法，无能测量者。’［大智度论卷二、十住毗婆沙论卷五易行品］ 　　佛教徒认为佛法有救济众生的功力，谓之佛力。 南朝 梁武帝 《以李胤之得牙像赦诏》：“宜承佛力，弘兹宽大。” 元 何中 《照武西塔上报恩寺》诗：“始知佛力宏，能使地灵现。” 明 李贽 《史纲评要·南宋纪·高宗》：“ 潜善 这等有福，佛力耶？”",
        "pinyin": "fl"
    },
    {
        "title": "攀缘",
        "key": "panyuan",
        "describe": "梵语 a^lambana。攀取缘虑之意。指心执着于某一对象之作用。众生之妄想缘取三界诸法，此乃一切烦恼之根源。盖凡夫之人，妄想微动即攀缘诸法；妄想既有所攀缘，则善恶已分；善恶既分，则憎爱并炽；由是，内烦众结，外生万疾；此皆攀缘作用所致者。",
        "pinyin": "py"
    },
    {
        "title": "五浊恶世",
        "key": "wuzhuoeshi",
        "describe": "五浊，劫浊、众生浊、命浊、烦恼浊、见浊。世界，心。五浊恶世即同时具五浊之心。 　　五浊可以统一归纳为法浊，或法不净。分言五浊，便于初学思维掌握。",
        "pinyin": "wzes"
    },
    {
        "title": "同性恋",
        "key": "tongxinglian",
        "describe": "同性恋有三个分别的意义：同性恋倾向、同性恋行为，同性恋权利运动（又称同志运动）。在人类以外的其他动物中，也普遍存在同性行为，但这与基于高级感情的人类同性恋爱不可同日而语。 　　性取向是只有本人自己，通过自己的直觉，感觉性吸引和感情欲望，才能做出判断的，而他人是无法判断的。一般说来，性取向与性行为是没有固定的对应关系的。",
        "pinyin": "txl"
    },
    {
        "title": "癌症",
        "key": "aizheng",
        "describe": "在医学上，癌是指起源于上皮组织的恶性肿瘤，是恶性肿瘤中最常见的一类。相对应的，起源于间叶组织的恶性肿瘤统称为肉瘤。有少数恶性肿瘤不按上述原则命名，如肾母细胞瘤、恶性畸胎瘤等。一般人们所说的“癌症”习惯上泛指所有恶性肿瘤。",
        "pinyin": "az"
    },
    {
        "title": "善神",
        "key": "shanshen",
        "describe": "明教源于波斯国，唐时传至中土。当时称为祆教。唐皇在各处敕建大云兴明寺，为明教的寺院。明教教义是行善去恶，众生平等，若有金银财物，须当救济贫众，不茹荤酒，崇拜明尊。明尊即是火神，也即是善神。",
        "pinyin": "ss"
    },
    {
        "title": "相违",
        "key": "xiangwei",
        "describe": "相违，是汉语词汇，解释为佛学术语。 　　1 互相避开，分离。《左传·成公十六年》：“有淖于前，乃皆左右相违于淖。”谢惠连《雪赋》：”怜枝叶之相违“ 　　2 彼此违背。 晋 陶潜 《归去来兮辞》：“世与我而相违，复驾言兮焉求？” 宋 苏轼 《戏题巫山县用杜子美韵》：“直知难共语，不是故相违。” 孙犁 《秀露集·耕堂读书记（二）》：“然泛览古人日记，实与此道相违。” 　　3 佛学术语， 因明用语。指两相对立而相互违反之意。如苦与乐、明与暗、冷与热、大与小等。",
        "pinyin": "xw"
    },
    {
        "title": "受持",
        "key": "shouchi",
        "describe": "佛教语。谓领受在心，持久不忘。《百喻经·妇诈称死喻》：“如彼外道，闻他邪説，心生惑著，谓为真实，永不可改，虽闻正教，不信受持。” 宋 朱弁 《曲洧旧闻》卷八：“吾尝梦梵僧告予曰：‘世且乱， 定光佛 再出世，子有难，能日诵千声，可以免矣。’吾是以受持。” 清 恽敬 《金刚经书后》二：“若復有人闻是经典，信心不逆，其福胜彼，何况受持诵读，为人解説。”",
        "pinyin": "sc"
    },
    {
        "title": "道业",
        "key": "daoye",
        "describe": "“道业”在佛教中一般就是指修行。修行是一种“行为”，行为（梵karma）即“业”；修行是在佛法方面的行为，故可称为“道业”。“修行”这个词本身也可对应梵文的阴性名词carya-（a-为a上横，长音）。",
        "pinyin": "dy"
    },
    {
        "title": "恶因",
        "key": "eyin",
        "describe": "丁福保《佛学大词典》：“【恶因】可招恶果之恶事种也。”可见。恶因就是恶的身口意行为。《璎珞本业经·下》：“是故善果从善因生，是故恶果从恶因生。”所以，一个人不管是否因为自己的无知，只要造下了罪业，就是恶因。如果不及时忏悔、纠正，那么这个罪业就会成熟，就会结出恶果，那时候悔之晚矣。",
        "pinyin": "ey"
    },
    {
        "title": "偷盗",
        "key": "toudao",
        "describe": "偷盗 在佛教的优婆塞戒中，曾经提到过。 它仅次于杀生。 认为，有两种果报，第一种是贫穷。第二种是虽有物质基础但不如意。",
        "pinyin": "td"
    },
    {
        "title": "禅观",
        "key": "changuan",
        "describe": "禅观的“禅”是指集中意识后获得的心性统一和安定。“观”是“观想”，指禅的境地里详细地思念、念想的对象。",
        "pinyin": "cg"
    },
    {
        "title": "胜义",
        "key": "shengyi",
        "describe": "胜义是指佛教语，指一切事物当体即空的第一义谛。出处唐 刘禹锡 《袁州萍乡县杨岐山故广禅师碑》。 佛教语。指一切事物当体即空的第一义谛。 唐 刘禹锡 《袁州萍乡县杨岐山故广禅师碑》：“如来说法，徧满大千。得胜义者，强名为禅。” 吕澄 《中国佛学源流略讲》第七讲：“犊子系就是主张有补特伽罗的，并且是胜义有而非假有。”",
        "pinyin": "sy"
    },
    {
        "title": "菩萨戒",
        "key": "pusajie",
        "describe": "大乘菩萨所受持之戒律。又作大乘戒、佛性戒、方等戒、千佛大戒。反之，小乘声闻所受持之戒律，称小乘声闻戒。菩萨戒之内容为三聚净戒，即摄律仪戒、摄善法戒、饶益有情戒等三项，亦即聚集了持律仪、修善法、度众生等三大门之一切佛法，作为禁戒以持守之。说菩萨戒之大乘典籍甚多，可综合为梵网与瑜伽二类律典。",
        "pinyin": "psj"
    },
    {
        "title": "讲经",
        "key": "jiangjing",
        "describe": "在佛教传统上，开大座讲经说法时，有一定的规矩。这种规矩有两种主流，一出自印度那兰陀佛教大学，另一乃印度超戒寺传统，这两种说论规矩都是正确的。超戒寺说法的规矩，是要在说正题前，先说明：第一、造论者之权威性；第二、所说教法本身之特点；第三、说法者与闻法者该依的规矩。前二者是为了令听众知道将说之法的来源清净（源于佛陀）、有传承（历代祖师）、有依据（经、律、论），而且令听众生出敬信心。",
        "pinyin": "jj"
    },
    {
        "title": "禅思",
        "key": "chansi",
        "describe": "有两种性质的禅思。一种是心智集中的开发（奢摩他或三摩地），亦即专精一心（心一境性）。借着经中所述的各种方法，引导上升至于最高的神秘境界，诸如：“无所有处”或“非想非非想处”。所有这些神秘的境界，根据佛陀所说，都是心造、心生、因缘所成。它们与实相、真理、涅盘无关。",
        "pinyin": "cs"
    },
    {
        "title": "中阴",
        "key": "zhongyin",
        "describe": "中阴：佛教说，人死后以至往生轮回某一道为止的一段时期，共有四十九天。此时期亡者的灵体叫做中阴（Antrabhara)。",
        "pinyin": "zy"
    },
    {
        "title": "退转",
        "key": "tuizhuan",
        "describe": "退转缘由：所有人轮回都会产生隔阴之迷，即使修行人也不例外，只是修行人会出现两种情况：“若愿力足够大，即使隔阴之迷使你记忆全无，你仍会愿意再次修行；若愿力不够大，你即会再次成为凡人”，二者若无人以不同形式点化唤醒且告知一切，修行人功果即将一切枉费了，由此可见，于世间修行太过于冒险，故阿弥陀佛修建极乐世界供修行人修行，凡死后可往生极乐世界者，即可证得四不退果位，从此将不再轮回，可一旦再次生迷，或入世完成任务则将会再次坠入轮回，后再由人点化唤醒且告知一切。",
        "pinyin": "tz"
    },
    {
        "title": "三乘",
        "key": "sancheng",
        "describe": "三乘：即‘声闻乘’、‘缘觉乘’、‘菩萨乘’ ，声闻乘又名小乘，缘觉乘又名中乘 、菩萨乘又名大乘。",
        "pinyin": "sc"
    },
    {
        "title": "善法",
        "key": "shanfa",
        "describe": "善法，多是佛学用语，通俗的讲就是修善果的方法。除此之外，还有好的方法、好的法令的意思。",
        "pinyin": "sf"
    },
    {
        "title": "病苦",
        "key": "bingku",
        "describe": "病苦（vya^dhi-d ）∶指由四大增损而引起的病患苦恼。北本《涅盘经》卷十二云∶‘病谓四大毒蛇互不调适。’盖病有身病及心病二种。身病是色阴之病，乃四大不调所致，有因水风热产生，也有因杂病或容病等产生。若地大不调，则举身沉重；若水大不调，则举身胖肿；若火大不调，则举身蒸热；若风大不调，则举身倔强。所谓容病，是指遭遇刀杖之难、为鬼魅所附等。心病是指恐怖、忧愁、愚痴等，一切心理上的苦恼。",
        "pinyin": "bk"
    },
    {
        "title": "命相",
        "key": "mingxiang",
        "describe": "命相:【拼音】mìng xiāng 【解释】命运与相貌。 1 命令三公。 2 指任命宰相。 3 命运与相貌。 4 指 \"八字 \"，命数。 5 相命，算命。 八字命理学由北宋徐子平先师创立，在其之前没有八字只有六字，宋代徐大升创立《渊海子平》是八字学宗祖之作，民国徐乐吾著有《子平真诠》《穷通宝鉴》《滴天髓补注》等经典。徐墨斋居士在此基础上由香港明星御用命理师智德师傅协助完成，创立《现代徐氏阴阳五行命相学》通俗易懂、简单实用、准确率高，是正统的八字命相法。",
        "pinyin": "mx"
    },
    {
        "title": "佛心",
        "key": "foxin",
        "describe": "佛：即觉悟之心。其义有三：（一）指如来充满慈爱（大慈悲）之心。观无量寿经（大一二·三四三下）：‘以观佛身故，亦见佛心。诸佛心者，大慈悲是；以无缘慈摄诸众生。’（二）指不执着于任何事、理之心。顿悟入道要门论（卍续一一○·四二二上）：‘不住一切处心者，即是佛心，亦名解脱心，亦名菩提心，亦名无生心。’（三）指人人心中本来具足之清净真如心。",
        "pinyin": "fx"
    },
    {
        "title": "清净心",
        "key": "qingjingxin",
        "describe": "什么是清净心？一心念佛，一心是清净心。什么叫一心，二六时中，一天到晚心里只有阿弥陀佛，忆佛念佛，心里真有阿弥陀佛，除阿弥陀佛之外，什么都没有。每个众生，蚊虫蚂蚁、妖魔鬼怪、花草树木，都是阿弥陀佛。其他佛都改名阿弥陀佛，一心称念，一向专念，心就觉悟了。",
        "pinyin": "qjx"
    },
    {
        "title": "开显",
        "key": "kaixian",
        "describe": "开：即开除执着，显：即显示真义。关于法华开显思想，在“大智度论”“法华经”等，印度论师述作中，未具明显诠述，我国早于东晋竺法旷大师即倡法华“会三归一”之旨，继之有罗什三藏、吉藏、僧肇、法云等大师续倡此义。智者大师基于上述诸师思想更倡“方便”即“真实”，而完成整然之法华开显思想体系。台宗主张佛陀讲“法华经”前所说之一切经，均非真实教法（未开显），至“法华经”时始显示真实教法。台宗针对“法华经”以教法与佛身，分立开权显实、开三显一、开迹显本、开近显远等而论述。",
        "pinyin": "kx"
    },
    {
        "title": "助念",
        "key": "zhunian",
        "describe": "助念，就是当病人，医药无效，寿命已尽，临命终时，助念者为其念佛，帮助临终者提起正念，助其安乐自在往生佛国。",
        "pinyin": "zn"
    },
    {
        "title": "持名念佛",
        "key": "chimingnianfo",
        "describe": "佛教净土宗四种念佛佛法之一，即持名念佛、观像念佛、观想念佛和实相念佛。持名念佛就是《佛说阿弥陀经》所说的“执持名号”，《佛说无量寿经》所说的“一向专念无量寿佛”。就是称念“南无阿弥陀佛”六字圣号，通过信愿称念阿弥陀佛得名号求生西方净土的方法。",
        "pinyin": "cmnf"
    },
    {
        "title": "诸恶",
        "key": "zhue",
        "describe": "1 各种恶行。《大智度论》卷十八：“诸恶莫作，诸善奉行，自浄其意，是诸佛教。” 清 刘廷玑 《在园杂志》卷二：“其中家常日用，应酬世务，奸诈贪狡，诸恶皆作，果报昭然。” 　　2 众恶人。 金 董解元 《西厢记诸宫调》卷三：“与君有旧，书至则必起雄师，立残诸恶。”",
        "pinyin": "ze"
    },
    {
        "title": "净观",
        "key": "jingguan",
        "describe": "净观：谓观佛相好，如十六观经所说故。 　　众生无始秽垢，遍一切法如油入面，似金在矿。修净业者当加种种观行，磨炼习气（真正宗通说通）成就白法，建立信心。",
        "pinyin": "jg"
    },
    {
        "title": "禅宗",
        "key": "chanzong",
        "describe": "禅宗又名佛心宗。教外别传。禅宗不是汉传佛教，又不离汉传佛教，是中国特色的本土佛教——汉族佛教（即禅宗）。",
        "pinyin": "cz"
    },
    {
        "title": "法性",
        "key": "faxing",
        "describe": "法性，和佛性、实相、如来藏等概念，义一而名异。《大乘玄论》卷三称：“经中有名佛性、法性、真如、实际等，并是佛性之异名。”《涅盘经》也说“佛性有种种名，于一佛性，亦名法性、涅盘，亦名般若、一乘，亦名首楞严三昧、师子吼三味”。 指诸法的真实体性；与‘真如法性’、‘真法性’等同义。《大般若经》卷三六○载，法性与法界、不虚妄性、平等性、实际等，皆为真如的异名。",
        "pinyin": "fx"
    },
    {
        "title": "礼赞",
        "key": "lizan",
        "describe": "对某事物或人物的赞美现代汉语中指赞赏，是比赞赏更书面一种的用法，带有一种敬重和钦佩的味道·一般做为名词。",
        "pinyin": "lz"
    },
    {
        "title": "四无量心",
        "key": "siwuliangxin",
        "describe": "四无量心，梵文 Caturapramā?ā?，佛教四种广大的利他心。即为令无量众生离苦得乐，而起的慈（Maitrī）、悲（Karu?ā）、喜（Muditā）、舍（Upek?ā）四种心，或入慈、悲、喜、舍四种禅观。又称四无量、四等心、四等、四梵住、四梵行、无量心解脱。",
        "pinyin": "swlx"
    },
    {
        "title": "迦叶",
        "key": "jiaye",
        "describe": "摩诃迦叶是佛陀十大弟子之一。 　　梵名Maha^ -ka^s yapa ，巴利名Maha^-kassapa 音译之略称。全名大迦叶、摩诃迦叶（‘叶’字音‘摄’）。又作迦叶波、迦摄波。意为饮光。付法藏第一祖。生于王舍城近郊之婆罗门家。于佛成道后第三年为佛弟子，八日后即证入阿罗汉境地，为佛陀弟子中最无执着之念者。人格清廉，深受佛陀信赖；于佛弟子中曾受佛陀分予半座。",
        "pinyin": "jy"
    },
    {
        "title": "中道",
        "key": "zhongdao",
        "describe": "中道（梵文：madhyamā-mārga，又作巴利文：majjhimā pa?ipadā、梵文：madhyamā-pratipad），佛教术语，为释迦牟尼的核心教义之一。它相对于二边，包括有无、苦乐、生灭等，释迦牟尼在说法时，主张应远离二边，至于中道。释迦牟尼在讲述中道时，通常都与缘起、十二缘起连结在一起，用来阐明无我、空的道理。 　　部派佛教时期，多只是援引《阿含经》中的内容，对中道思想并没有进一步发展。直到大乘佛教兴起，在般若系经典与中观派经典中，中道思想开始成为理论核心。如来藏学派中，以中道为如来藏的代称之一。",
        "pinyin": "zd"
    },
    {
        "title": "跪羊图",
        "key": "guiyangtu",
        "describe": "《跪羊图》是一首网络佛教歌曲，词曲作者是台湾音乐家李子恒。 　　歌曲教化世人知感恩行孝道。曲调清新，童音澄澈，女声清脆，加之男声和唱，令人内心宁静，同时又有至诚至真的感动缓缓流动。",
        "pinyin": "gyt"
    },
    {
        "title": "末法",
        "key": "mofa",
        "describe": "（术语）正像末三时之一。谓去佛世长远而教法转微未之时期也。法华嘉祥疏五曰：‘转复微末，谓末法时。’三时有四说。一说正法五百年，像法一千年，末法一万年，多取此说。见三时条。",
        "pinyin": "mf"
    },
    {
        "title": "戒体",
        "key": "jieti",
        "describe": "‘戒体’指经由作礼乞戒等仪式所引发的内心持戒功能。也就是指受戒后所产生的防非止恶的力量；它是佛教所谓的一种拘束内心且持续存在的神密效力。",
        "pinyin": "jt"
    },
    {
        "title": "佛顶骨",
        "key": "fodinggu",
        "describe": "佛顶骨（佛顶骨舍利）指的是释迦牟尼的头顶骨，全世界上仅存一块，是佛教界至高无上的圣物，为一块周长35厘米、直径10厘米、颜色黄白、有清晰发孔的完整头骨。 　　南京大报恩寺出土的阿育王塔中的佛顶骨舍利是世界现存唯一一枚佛祖真身顶骨舍利，供奉于南京牛首山的佛顶宫中。",
        "pinyin": "fdg"
    },
    {
        "title": "缘起",
        "key": "yuanqi",
        "describe": "缘起（梵语:pratītya-samutpāda；巴利语：paticca-samuppāda），重要佛教术语，一切有为法都是因各种因缘而成，此理即为缘起。任何事物都因为各种条件的相互依存而处在变化中，这是佛陀对世间现象的成住坏灭之原因、条件所证悟的法则。",
        "pinyin": "yq"
    },
    {
        "title": "念诵",
        "key": "niansong",
        "describe": "念诵，niàn sòng，原为佛教语，谓心念口诵佛名及经咒；谓因惦记而提及。",
        "pinyin": "ns"
    },
    {
        "title": "觉支",
        "key": "juezhi",
        "describe": "觉支：巴利语sambojjhaïga, 又作正觉支。正觉的因素或导向正觉的要素，称为正觉支。(tassa sambodhissa, tassà và sambodhiyà aïgan ti sambojjhaïgaü ) 　　有七种正觉支：念觉支、择法觉支、精进觉支、喜觉支、轻安觉支、定觉支和舍觉支。",
        "pinyin": "jz"
    },
    {
        "title": "熏习",
        "key": "xunxi",
        "describe": "熏陶染习。 南朝 陈 慧思 《大乘止观法门》卷二：“随对者，即喻浄心体具一切法性，故能受一切熏习，随其熏别，现报不同也。” 宋 叶适 《黄子耕墓志铭》：“﹝ 子耕 ﹞悍顽易节，嚚险改行，而郡称平治，自顷吏道熏习，所师用往往暴民之事也。” 清 赵翼 《静观》诗之十四：“惟人则不然，熏习有不定，或先贤后奸，或始邪终正。” 蔡元培 《文明之消化》：“如普通社会，为宗教臭味所熏习，迷信滋彰，至今为梗。”",
        "pinyin": "xx"
    },
    {
        "title": "我见",
        "key": "wojian",
        "describe": "又称“身见”。一切众生的肉体和精神，都是因缘所生法，本无我的实体存在，但吾人都在此非我法上，妄执为我，叫做我见。 　　“我见”是一种思想上的烦恼，是知见上的执着，即是我们在第六识认为五蕴假合的身心之中有--“我”、我的东西--我所。我们可通过明了“无我”的道理，破除“我见”，故“不正见”容易破除。“我见”是第六识所起的认知，而我执是第七识所起，所以“我见”不是“我执”。“我见”证得初果须陀洹后即可破除，而细微的“我执”则须成就佛果后才可彻底断除。",
        "pinyin": "wj"
    },
    {
        "title": "修习",
        "key": "xiuxi",
        "describe": "修习，有演习、修行、练习、修养等意思。有动词、名词两种词性，多动词词意。 　　演习;练习。 　　学习;研习。 　　修行。",
        "pinyin": "xx"
    },
    {
        "title": "二乘",
        "key": "ercheng",
        "describe": "【二乘】《佛学常见辞汇》：“【二乘】声闻乘和缘觉乘。凡属修四谛法门而悟道的人，总称为声闻乘；凡属修十二因缘而悟道的人，总称为缘觉乘。”",
        "pinyin": "ec"
    },
    {
        "title": "性空",
        "key": "xingkong",
        "describe": "（术语）十八空之一。见空条。 　　谓众缘合成的一切事物，其性本空，没有真实的自体可得。 　　佛教语。十八空之一。谓一切事物的现象，都是因缘和合而生的，暂生还灭，没有实在的自体，故称。《大智度论》卷三一：“性空者，诸法性常空，假业相续，故似若不空。譬如水性自冷，假火故热，止火停久，水则还冷。诸法性亦如是。” 唐 王维 《山中示弟等》诗：“缘合妄相有，性空无所亲。”",
        "pinyin": "xk"
    },
    {
        "title": "称名",
        "key": "chengming",
        "describe": "(1) 列举的物名。《易·系辞下》：“其称名也小，其取类也大。” 孔颖达 疏：“‘其称名也小’者，言《易》辞所称物名多细小，若见豕负涂噬腊肉之属，是其辞碎小也。” 南朝 梁 刘勰 《文心雕龙·比兴》：“观夫兴之托喻，婉而成章，称名也小，取类也大。”",
        "pinyin": "cm"
    },
    {
        "title": "五乘",
        "key": "wucheng",
        "describe": "指运载众生到善处的五种法门。‘乘’乃梵语ya^na之译，有道、船、车，或运载之义。此处喻诸佛教法犹如舟、车，可运载众生至所期之果地。又ya^na音译作‘衍’，故五乘又名五衍。",
        "pinyin": "wc"
    },
    {
        "title": "行善",
        "key": "xingshan",
        "describe": "行善以善行为本，以使得受助者真正受益为原则，在双方人格平等，不侵犯尊严的情况下实行。行善可以分为个人行善和组织行善，其中部分会带有商业色彩。",
        "pinyin": "xs"
    },
    {
        "title": "身心",
        "key": "shenxin",
        "describe": "身与心，为有情的正报，在五蕴之中，色蕴是身，受想行识四蕴是心。",
        "pinyin": "sx"
    },
    {
        "title": "佛道",
        "key": "fodao",
        "describe": "佛把不同的生命状态（八识的种性所决定），因相对的智慧、业力不同、感召的果报不同，对应的境界和状态等的不同，假名划分为六种形态以及对应的空间属性（数字只是表法）：即地狱道，饿鬼道，畜生道，人道，阿修罗道，天道。六道众生生存于欲，色，无色三界之中。善慧业大的众生自然福报大或升天，相反则堕落受苦。六道众生因尚未修证出彻底圆满的智慧和觉悟，无力挣脱业力或灭掉业因，只能身不由己地轮回受报。一句话，对于众生一直都只能处于一种轮回状态之中的客观现象，佛门就将它称之为六道轮回。",
        "pinyin": "fd"
    },
    {
        "title": "舍利子",
        "key": "shelizi",
        "describe": "舍利是梵语& 347;arīra的音译，是印度人死后身体的总称。在佛教中，僧人死后所遗留的头发、骨骼、骨灰等，均称为舍利；在火化后，所产生的结晶体，则称为舍利子或坚固子。 　　舍利的结晶体舍利子，其形成原因，目前在实验研究方面没有定论。依据佛典，舍利子是僧人生前因戒定慧的功德熏修而自然感得；大多推测则认为舍利子的形成与骨骼和其他物体共同火化所发生的化学反应有关；另有民间流传认为，人久离淫欲，精髓充满，就会有坚固的舍利子。",
        "pinyin": "slz"
    },
    {
        "title": "四果",
        "key": "siguo",
        "describe": "指南传佛教的四种果位，即须陀洹果、斯陀含果、阿那含果、阿罗汉果。",
        "pinyin": "sg"
    },
    {
        "title": "佛书",
        "key": "foshu",
        "describe": "佛书指与佛教有关之典籍。 又作佛典、内典、妙典。反之，佛教以外之典籍称外典、世典、外道书、外俗书。妙典系尊称，尤指一宗所依之经论。随着佛教史之展开与传播地域之扩展，佛书渐次扩大其内容。通常指所有有关佛陀教说之经论典籍，广义之佛书则包括经、律、论三藏及其注疏、各宗之典籍、史传类、大藏经目录、词汇、行事、寺志及地志等，乃至于依据佛教所写之故事、小说、戏曲、随笔、歌谣等之佛教文学。即以经、律、论三藏为主干之印度佛教圣典，及我国、日本所撰述而次第增广之一切经。",
        "pinyin": "fs"
    },
    {
        "title": "大乘论",
        "key": "dachenglun",
        "describe": "大乘佛学所属论书的总称。又称大乘阿毗昙、菩萨对法藏等。相对于小乘论而言。一般把阐发大乘佛教修习的六度和诸法性空等义理以及注解大乘经的著作，都称为大乘论。",
        "pinyin": "dcl"
    },
    {
        "title": "善根",
        "key": "shangen",
        "describe": "善根，《大品般若经》中说：又作善本、德本。即产生诸善法的根本。比丘知善、知善根，是谓成就见、得正见，于法得不坏净，入于正法中。无贪、无嗔、无痴三者为善根之体，合称为三善根。不善根则为贪、嗔、痴等，即称三不善根，或称三毒。又善法为得善果的根本，故亦可称为善根。",
        "pinyin": "sg"
    },
    {
        "title": "共业",
        "key": "gongye",
        "describe": "佛教又把业分为共业和不共业，共业之中又包含不同的个业。共业和不共业，主要是根据它的结果来说明的。由共同感受到的生活环境，如大家都生活同一地区，一样的天时，一样的空气污染，当刮台风时，大家都一样的遭殃，这即是共业。无论共业与不共业，若是人为所感，则包含两种冤者：一是误入牵连其中为冤者；二是非自身因果为冤者。若自然现象所感，则唯误入牵连其中为冤者。",
        "pinyin": "gy"
    },
    {
        "title": "佛身",
        "key": "foshen",
        "describe": "佛身，证得无上正觉之佛陀身体也。就中有法身化身等之别。总名为佛身。指佛的肉身。或指佛所具有的种种理想的德性，此时的佛身，即与宇宙真理的‘法’或‘法性’同义。在西元一世纪佛像出现之前，释尊的形像一直间接地只是以法轮、菩提树等为象征。其后，大乘经典中承认除释尊之外，还有其他诸佛。佛性、绝对性的法与现实众生的关系，也开始被探讨。这种关于佛身的研究，被称为佛身论，在佛教思想上有很深入的发展。",
        "pinyin": "fs"
    },
    {
        "title": "念佛禅",
        "key": "nianfochan",
        "describe": "念佛禅，即东山法门，它起源于道信，完成于弘忍。 　　念佛禅自四祖道信禅师开始弘扬至今已有一千三百多年了，传承于禅宗北渐一脉。 　　以神秀为代表的北宗禅学，忠实地继承了四祖道信和五祖弘忍的东山法门 。 　　当年弘忍禅师曾叹道：“东山之法， 尽在秀矣”！",
        "pinyin": "nfc"
    },
    {
        "title": "归敬三宝",
        "key": "guijingsanbao",
        "describe": "１、三宝(佛、法、僧)，是佛法的总纲。 　　２、归敬三宝，是进入佛门的初基。 　　３、三宝的功德，真是无量无边，不可思议，但如不能归向三宝，就不能得到，无缘受用。",
        "pinyin": "gjsb"
    },
    {
        "title": "台湾佛教",
        "key": "taiwanfojiao",
        "describe": "佛教在我国台湾省的信仰人口约548 6万人，占2300万人口的23 9%，不过，其信仰人数可能与道教、儒教或其他台湾民间信仰有重叠的情况。据美国国务院民主、人权和劳工事务局发布的资料显示，台湾有多达80%的人口信奉某种形式，掺杂有佛教信仰因素的传统台湾民间信仰或台湾宗教。因此就广义而言，在台湾，与道教混淆的佛教人口可说广达80%。",
        "pinyin": "twfj"
    },
    {
        "title": "戒杀",
        "key": "jiesha",
        "describe": "天地万物以供人食，如种种谷、种种果、种种蔬菜、种种水陆珍味。,而人又以智巧饼之、饵之、盐之、酢之、烹之、炮之，可谓千足万足，何苦复将同有血气、同有子母、同有知觉、觉痛觉痒、觉生觉死之物而杀食之，岂理也哉？寻常说：“只要心好，不在斋素。”嗟乎！戮其身而啖其肉，天下之言凶心、惨心、毒心、恶心，孰甚焉？“好心”当在何处？！予昔作《戒杀放生文》劝世，而颇有翻刻此文，不下一二十本。善哉斯世，何幸犹有如是仁人君子在也！",
        "pinyin": "js"
    },
    {
        "title": "佛事",
        "key": "foshi",
        "describe": "凡发扬佛德之事，称为佛事。又作立地。据维摩经卷下载，佛陀将一切事均视为佛事，以此表示佛之德性。于禅宗，用以指举扬佛法之行事，如开眼、安座（安置佛像于堂内）、拈香、上堂、入室、普说、垂示等，均为佛事。后世泛称于佛前举行之仪式为佛事，又称法事、法会，或指超度亡灵之诵经。",
        "pinyin": "fs"
    },
    {
        "title": "多佛",
        "key": "duofo",
        "describe": "佛教术语，大乘许于一时有多佛出世，且勿论。 　　小乘则于俱舍十二有二说：萨婆多师之义，无边之世界，唯一佛出世，无二佛于同时出世者。余师之义，则一三千大千世界，虽无二佛于同时出世，而其他三千大千世界，佛之出世，非无与之同时者；故无量之世界，同时有无量之佛出世。智度论九，同举此二义，以前义为不了义，后义为了义。",
        "pinyin": "df"
    },
    {
        "title": "根机",
        "key": "genji",
        "describe": "人之性譬诸木而曰根。根之发动处曰机。修行之兴废，教法之进止，一由此根机之如何？最胜王经七曰，‘随彼根机令习定。’寄归传二曰：，巧应根机，善诱人天。’",
        "pinyin": "gj"
    },
    {
        "title": "苦行",
        "key": "kuxing",
        "describe": "苦行（& 2340;& 2346;& 2360;& 2381;，Tapas）印度系列宗教包括印度教、耆那教的修行方式,故意用一般人难以忍受的种种痛苦来折磨自己。如：印度教中人们通过苦行获得神灵的祝福，或得到解脱。",
        "pinyin": "kx"
    },
    {
        "title": "出世间",
        "key": "chushijian",
        "describe": "出世间：巴利语lokuttara，为loka (世间) + uttara (超出)的组合词，即超出五蕴世间之义。在《无碍解道》中列举了出世间的一系列含义： 　　“出世间者，以何义为出世间？度脱世间为出世间；超越世间为出世间；超出世间为出世间；超脱世间为出世间；越度世间为出世间??越度、超越世间而住立为出世间。”(Ps 2 43) 　　出世间法共有九种，称为“九出世间法”(nava- lokuttaradhamma)：四种圣道、四种圣果和涅槃。",
        "pinyin": "csj"
    },
    {
        "title": "专修",
        "key": "zhuanxiu",
        "describe": "专修，读音zhuān xiū，汉语词语，指佛教语、专心修行",
        "pinyin": "zx"
    },
    {
        "title": "善知识",
        "key": "shanzhishi",
        "describe": "善知识，在佛教中的解释：梵语kalya^n!amitra，巴利语kalya^n!a-mitta。音译作迦罗蜜、迦里也曩蜜怛罗。其与恶知识相对，它指正直而有德行，能教导正道之好人，即为善缘，又作知识、善友、亲友、胜友、善亲友。据《大品般若经》卷二十七常啼品载，能说空、无相、无作、无生、无灭之法及一切种智，而使人欢喜信乐者，称为善知识。",
        "pinyin": "szs"
    },
    {
        "title": "解灾",
        "key": "jiezai",
        "describe": "解灾产生于上古时代。那时候，人们对病灾只有靠祭祀、巫术予以化解。中医的起源就是由巫医转化而来的。现代的解灾仍有它的科学性，它的实质就是用一种能量将互相战斗的五行合理疏导，使它们和解，化敌为友。",
        "pinyin": "jz"
    },
    {
        "title": "色身",
        "key": "seshen",
        "describe": "所谓色身：乃是佛教一种术语，在一般人叫做身体，它是揽父精母血及四大种的地水火风所构成。 　　具有鼻目嘴等五官及两手两脚之四肢，圆颅方顶，有形有质之一个人的躯壳，谓之色身。",
        "pinyin": "ss"
    },
    {
        "title": "俗谛",
        "key": "sudi",
        "describe": "佛教语。佛教依照事物的现象而阐发的浅明而易为世人所理解的道理。又称“世谛”、“世俗谛”，与“真諦”相对。 唐 李邕 《海州大云寺禅院碑》：“曾近俗諦，或乘法流。” 明 宋濂 《重塐释迦文佛卧像碑铭》：“本则真諦，迹则俗諦。真俗混融，皆不思议之事，乌可以异观哉？” 范文澜 《唐代佛教·佛教各宗派》：“所谓二谛，一是俗谛，二是真谛。”",
        "pinyin": "sd"
    },
    {
        "title": "业报",
        "key": "yebao",
        "describe": "来自：佛光大辞典：业与报并称。意为业之报应或业之果报。谓由身口意之善恶业因所必招感之苦乐果报。或指业因与果报。又作业果。",
        "pinyin": "yb"
    },
    {
        "title": "修证",
        "key": "xiuzheng",
        "describe": "佛教称修行证理为修证。证理，证悟真理。 宋 吴曾 《能改斋漫录·神仙鬼怪》：“此汝前身也，由汝误念，堕此。勉自修证，勿沦苦海。” 明 陈汝元 《金莲记·昼锦》：“九品青莲，修证何妨并蒂。”",
        "pinyin": "xz"
    },
    {
        "title": "诵咒",
        "key": "songzhou",
        "describe": "诵咒（诵咒）亦作“诵呪”。 1 念咒语。《关尹子·七釜》：“有诵咒者，有事神者。”《宋史·礼志五》：“人持柳枝沾水散洒，昼夜环绕，诵呪曰：‘蜥蜴蜥蜴，兴云吐雾，雨令滂沱，令汝归去！’雨足。”",
        "pinyin": "sz"
    },
    {
        "title": "破四相",
        "key": "posixiang",
        "describe": "佛教语。谓破除一切妄相而直显性体。破四相才能随缘现相，离相必须从大智慧上下手。世间人无论有多大的聪明才智，若有执著即是有漏的智慧，无我执还有法执；菩萨一念不生，即是无相。起一个念头即有一个相，一切境界现前不起念即是功夫。法界本来是没有相的。唯有破相，方能超脱凡人的境界。",
        "pinyin": "psx"
    },
    {
        "title": "佛塔",
        "key": "fota",
        "describe": "佛塔，亦称宝塔，原是印度梵文Stupa（窣堵波）的音译，还有称为浮屠，即来源“Buddastupa”，藏语称“藏文”（曲登），佛塔最早用来供奉和安置舍利、经卷和各种法物。许多佛塔会刻有建塔碑记﹑圣像﹑佛经等。 　　根据佛教文献记载，佛陀释迦牟尼涅槃后的舍利，被分成八万四千份，在世界各地建塔加以供奉。我国的上万座佛塔，是古代高层建筑的代表，其用料之精良、结构之巧妙、技艺之高超、类型之丰富，远远超出了历代文人墨客的笔端。",
        "pinyin": "ft"
    },
    {
        "title": "修心",
        "key": "xiuxin",
        "describe": "修养心性。 　　《庄子·田子方》：“夫子德配天地，而犹假至言以修心，古之君子，孰能脱焉？”《魏书·释老志》：“故其始修心，则依佛、法、僧。”　唐·崔涂 《入蜀赴举秋夜与先生话别》诗：“失计方期隐，修心未到僧。” 冰心 《寄小读者·通讯十一》：“我纵欲修心养性，哪得此半年空闲，幕天席地的日子？ ”",
        "pinyin": "xx"
    },
    {
        "title": "恶行",
        "key": "exing",
        "describe": "丑恶的行径。不善之行也。俱舍论十六曰：“一切不善身语意业，如次名身语意恶行。”十地论义记四本曰：“现习恶行，当受大苦。”",
        "pinyin": "ex"
    },
    {
        "title": "业处",
        "key": "yechu",
        "describe": "业处：巴利语kammaññhàna的直译，字义为“工作的处所”，即修行的法门，或修行时专注的对象。 　　有两大类业处： 　　1 止业处（samatha kammaññhàna）为培育定力的修行方法，属于增上心学。 　　2 观业处（vipassanà kammaññhàna），为培育智慧的修行方法，属于增上慧学。",
        "pinyin": "yc"
    },
    {
        "title": "辟支佛",
        "key": "bizhifo",
        "describe": "辟支佛，辟支迦佛陀（辟支迦佛陀的简称，又音译作钵罗翳迦佛陀，或简称辟支迦佛、辟支等。指过去生曾经种下因缘，进而出生在无佛之世，因性好寂静，或行头陀，无师友教导，而以智慧独自悟道，通说为观察十二因缘，进而得到证悟而解脱生死、证果之人。所以亦称为“独觉”（新译）或“缘觉”（旧译）。",
        "pinyin": "pzf"
    },
    {
        "title": "苦因",
        "key": "kuyin",
        "describe": "肉体或思想上持续痛苦或失望(如疾病或损失)的原因。",
        "pinyin": "ky"
    },
    {
        "title": "妙善",
        "key": "miaoshan",
        "describe": "三皇姑，原名妙善，春秋时期父城（今河南平顶山宝丰县父城）妙庄王与王后宝德之女，因有两个姐姐：妙音、妙缘，排行第三，故称“三皇姑”。妙善是中国历史上的第一孝女，用自己的手、眼为父亲医病，传说其圆寂后化身为千手千眼观世音。",
        "pinyin": "ms"
    },
    {
        "title": "法会",
        "key": "fahui",
        "describe": "佛教仪式之一。又作法事、佛事、斋会、法要。乃为讲说佛法及供佛施僧等所举行之集会。即聚集净食，庄严法物，供养诸佛菩萨，或设斋、施食、说法、赞叹佛德。印度古来即盛行此类集会，其种类名目甚多。",
        "pinyin": "fh"
    },
    {
        "title": "资粮",
        "key": "ziliang",
        "describe": "资粮，指战资、粮草。泛指钱粮。语出《左传·僖公四年》：“若出于 陈、郑之间，共其资粮屝履，其可也。”",
        "pinyin": "zl"
    },
    {
        "title": "清规",
        "key": "qinggui",
        "describe": "清规，谓供人遵循的规范；佛教或道教规定信徒应守的清规；今亦泛指一般的规章制度（多含贬义）。如：数不清的清规和戒律。",
        "pinyin": "qg"
    },
    {
        "title": "僧众",
        "key": "sengzhong",
        "describe": "众僧徒。《魏书·释老志》：“但天下初定，戎车屡动，庶事草创，未建图宇，招延僧众也。”《宋书·萧惠开传》：“寺众既立，自宜悉供僧众。”《水浒传》第六十回：“ 晁盖 下马，入到寺内，见没僧众。”《儒林外史》第四回：“就在 胡老爹 面前托僧官去约僧众，并备香蠋、纸马、写疏等事。”",
        "pinyin": "sz"
    },
    {
        "title": "名号",
        "key": "minghao",
        "describe": "佛教语。特指诸佛菩萨名，而以指南无阿弥陀佛为常。",
        "pinyin": "mh"
    },
    {
        "title": "作意",
        "key": "zuoyi",
        "describe": "集中注意，令心警觉。”我们平时学习理论，形成印象，在遇到事情的时候可以想起来理论说什么，进而知道应该怎么做，理论联系实践，修养就会很快提高上去。",
        "pinyin": "zy"
    },
    {
        "title": "原始佛教",
        "key": "yuanshifojiao",
        "describe": "原始佛教(Original Buddhism)。 　　释迦牟尼创教及其弟子相继传承时期的印度佛教，约为公元前6~前5世纪。佛陀的说教最初是口传的，为了便于记忆，采取偈颂的形式，后来编集为律经论三藏。原始佛教的基本教义是“四谛”、“八正道”和“十二因缘”，其核心内容是讲现实世界的苦难和解决苦难的方法。其次，又从缘起思想出发，提出了“诸行无常”、“诸法无我”和“涅槃寂静”的学说。后人把原始佛教的修持，概括为戒、定、慧三学、慈悲喜舍四无量心以及四念处、四正断、四神足、五根、五力、七觉支等三十七菩提分法。",
        "pinyin": "ysfj"
    },
    {
        "title": "二障",
        "key": "erzhang",
        "describe": "烦恼障与所知障。系瑜伽行派与法相宗对贪、嗔、痴等诸惑，就其能障碍成就佛果之作用所作之分类。 　　又作二碍。",
        "pinyin": "ez"
    },
    {
        "title": "色法",
        "key": "sefa",
        "describe": "佛教用语：指一切有形的物质。 　　普通所谓物质的物，依佛学是有“色法”的名词来代表它。色法、即是在佛典中最普通所知的“色不异空，空不异色，色即是空，空即是色”的色法。这色法、是佛学中许多法中的一种法，故知除色法外，尚有其他诸法；但今唯谈色法，其余诸法，姑置不论。把色法来比较观察，颇同于平常所谓物质的物，其意义、性质、范围皆相等。",
        "pinyin": "sf"
    },
    {
        "title": "无碍",
        "key": "wuai",
        "describe": "无碍，其一出自《法言·君子》，译为没有阻碍；没有妨碍。其二为佛教语，译为通达自在，没有障碍。",
        "pinyin": "wa"
    },
    {
        "title": "空有",
        "key": "kongyou",
        "describe": "空与有。一切法缘生无有实体，叫做空；虽然性空但有假相，叫做有。",
        "pinyin": "ky"
    },
    {
        "title": "禅堂",
        "key": "chantang",
        "describe": "禅堂，犹禅房。“坐禅堂”的略称，亦作“僧堂”，是众僧坐禅用的堂室，佛徒打坐习静之所。",
        "pinyin": "ct"
    },
    {
        "title": "数息观",
        "key": "shuxiguan",
        "describe": "数息观在印度话是安那般那，为佛陀所教导禅定修行法的门之一，由于此观法对治散和不净观（对治贪欲）一样很有力，所以被称为“二甘露门” 这两个甘露之门可以让我们获得禅定，同时，如法的思维可以获得无漏的智慧，所以称为甘露门。它也是我们汉传佛教修行人修定的基本法门。",
        "pinyin": "sxg"
    },
    {
        "title": "三障",
        "key": "sanzhang",
        "describe": "皮烦恼障即三界中思惑也。谓贪嗔痴等烦恼。对外六尘而起。如皮在身外。故名皮烦恼障。",
        "pinyin": "sz"
    },
    {
        "title": "律仪",
        "key": "luyi",
        "describe": "(1) 僧侣遵守的戒律和立身的仪则。《大乘义章》卷十：“言律仪者，制恶之法，说名为律。行依律戒，故号律仪。” 唐 玄奘 《大唐西域记·阿耆尼国》：“经教律仪，既遵 印度 ，诸习学者，即其文而翫之。戒行律仪，洁清勤励。” 章炳麟 《建立宗教论》：“故如 美洲 之摩门， 印度 之溼婆韦纽， 西藏 之莲华生教，专以不律仪为务者，无足论矣。” 　　(2) 法律的礼节。《镜花缘》第二二回：“如今腹中只剩几段‘大 唐 律仪注单’，还有许多买办账。你要考他律例算盘，倒是熟的。”",
        "pinyin": "ly"
    },
    {
        "title": "舍利",
        "key": "sheli",
        "describe": "舍利是梵语& 347;arīra的音译，是印度人死后身体的总称。在佛教中，僧人死后所遗留的头发、骨骼、骨灰等，均称为舍利；在火化后，所产生的结晶体，则称为舍利子或坚固子。",
        "pinyin": "sl"
    },
    {
        "title": "破四见",
        "key": "posijian",
        "describe": "四见有三种：单四见、复四见、具足四见。",
        "pinyin": "psj"
    },
    {
        "title": "散乱",
        "key": "sanluan",
        "describe": "心所名。指令心于所缘之境流荡不定的精神作用。为唯识百法之一、随烦恼之一，又称散动、心乱。《成唯识论》卷六云（大正31·34b）︰‘云何散乱？于诸所缘令心流荡为性，能障正定，恶慧所依为业。谓散乱者，发恶慧故。’",
        "pinyin": "sl"
    },
    {
        "title": "经藏",
        "key": "jingzang",
        "describe": "经藏，是梵文 Sūtrapitaka 的意译，Sūtra (?????) 旧译修多罗。Sūtrapitaka 音意合译为“素袒缆藏”，指释迦牟尼诸弟子所传述的释迦在世时的说教，以及其后佛教徒称为释迦牟尼言行的著作。Sūtra 又译作契经，上契诸佛之理，下契众生之机，谓之契；Sūtra 原义为綖（线），表示佛陀所说的法如同丝线，能贯穿一切义。贯穿诸法深义，摄持所化众生，谓之经。pitaka 藏，有蕴积、包含义，是指古时一种可盛放物品的箧（或篮），因为此 pitaka 含括一切所应知、应行、应证的法义，所以 Sūtrapitaka 意译经藏。",
        "pinyin": "jc"
    },
    {
        "title": "修法",
        "key": "xiufa",
        "describe": "依照法令(行事)。《商君书·定分》：“遇民不修法，则问法官，法官即以法之罪告之。”",
        "pinyin": "xf"
    },
    {
        "title": "菩萨行",
        "key": "pusaxing",
        "describe": "大乘佛法开头难，从初发心到初住难走，初住以上的境界，愈走愈容易；小乘则反是。以念佛法门而言，得到理一心不乱，可以到圆初住以上境界。平常把人我是非利害丢得干干净净，即能得一心；如仍然有人我是非，不但理一心得不到，事一心也得不到。",
        "pinyin": "psx"
    },
    {
        "title": "因明",
        "key": "yinming",
        "describe": "因明，梵文 Hetuvidyā 的意译，指古印度的逻辑学。它与声明（语言文字学）、工巧明（工艺历算学）、医方明（医学）、内明（各学派自己的学说，对佛教来说则指佛学）合称“五明”，为古印度的五门学科。因，指推理的根据、理由、原因。明，指显明、知识、学问。",
        "pinyin": "ym"
    },
    {
        "title": "恶道",
        "key": "edao",
        "describe": "1 不正之道。 汉 刘向 《说苑·君道》：“恶恶道不能甚，则其好善道亦不能甚。” 　　2 佛教语。指地狱、饿鬼、畜生三道。《坛经·行由品》：“依此偈修，免堕恶道。”",
        "pinyin": "ed"
    },
    {
        "title": "本愿",
        "key": "benyuan",
        "describe": "本愿就是本来的愿望，固有的心愿。《晋书·凉武昭王李玄盛传》：“吾自立身，不营世利……今日之举，非本愿也。”清李渔《怜香伴·神引》：“这也是妇人家本愿，俺们须索护祐他。”本愿还是佛教术语，指诸佛菩萨在修行时所立的誓愿。谓根本的誓愿。常见的有：释迦牟尼佛的五百大愿， 地藏菩萨的“地狱不空，誓不成佛” ，观音菩萨的十二大愿，阿弥陀佛的四十八愿。",
        "pinyin": "by"
    },
    {
        "title": "四德",
        "key": "side",
        "describe": "“四德”一词见于《周礼 天官 内宰》，内宰是教导后宫妇女的官职，负责逐级教导后宫妇女“阴礼”、“妇职，其中较高职位的“九嫔”“掌妇学之法，以教九御妇德妇言、妇容、妇功。”本来是宫廷妇女教育门类，后来与“三从”连称，成为对妇女道德、行为、能力和修养的标准即“三从四德”。",
        "pinyin": "sd"
    },
    {
        "title": "发愿",
        "key": "fayuan",
        "describe": "佛教语。谓普度众生的广大愿心。后亦泛指许下愿心。 　　发起誓愿之意。又作发大愿、发愿心、发志愿、发无上愿。总指发求佛果菩提之心（菩提心）；别指完成净土，以救济众生之心（即誓愿）。盖菩萨所发之愿，有总愿、别愿、净土成佛愿、秽土成佛愿等，种类甚多。于净土宗，誓愿往生净土者发遣自己修善，此发愿往生之心，称为回向发愿心。唐代善导于观经疏玄义分解释六字名号（南无阿弥陀佛），称南无有发愿回向之意。亲鸾谓此乃阿弥陀佛发救度众生之愿，而为众生得救之因；或解作遵行释迦、弥陀二尊之发遣招唤，而欲生于净土之心。",
        "pinyin": "fy"
    },
    {
        "title": "转依",
        "key": "zhuanyi",
        "describe": "转依，佛教专有名词，是印度大乘佛教瑜伽行派教义体系中的重要观念，意指断除烦恼障与所知障，以证得涅盘与菩提之果。亦即‘转识成智’。",
        "pinyin": "zy"
    },
    {
        "title": "释义",
        "key": "shiyi",
        "describe": "1:解释词语或文章的意义。 　　2：指佛教教义",
        "pinyin": "sy"
    },
    {
        "title": "离相",
        "key": "lixiang",
        "describe": "佛教语。谓离开色相。 　　佛教中讲到相比较多，如有“我相，人相，众生相，寿者相”；有“生相、住相、异相、灭相”。有“总相、别相、同相、异相、成相、坏相”等；有“有相、知相、识相、缘相、增上相、因相、果相等。佛教中相的梵语为laks!an!a，是指物质的形相或状态之意，相是对于物质的性质、本体来说的，即指诸法之形像状态。离相，就是离开色相，不要执着于表象。自我离相，就是把握住自己不被表象迷惑。",
        "pinyin": "lx"
    },
    {
        "title": "课诵",
        "key": "kesong",
        "describe": "课诵是佛教寺院定时念持经咒、礼拜三宝和梵呗歌赞等法事，因其冀获功德于念诵准则之中，所以也叫功课。",
        "pinyin": "ks"
    },
    {
        "title": "心髓",
        "key": "xinsui",
        "describe": "心的深处。 　　北齐 颜之推 《颜氏家训·文章》：“衔酷茹恨，彻於心髓！” 唐 张鷟 《游仙窟》：“ 十娘 引手向前……十箇指头，刺人心髓。” 明 李贽 《与焦弱侯书》：“僕以谓‘乐时方乐，忧时方忧’此八箇字，説透世人心髓矣。” 　　借指事物的核心。 　　吕志伊 《国会问题之真相》：“谓以国会为国家政治之中坚也，国家活动之心髓也。”",
        "pinyin": "xs"
    },
    {
        "title": "律藏",
        "key": "lvzang",
        "describe": "律藏，音译毗奈耶藏、毗尼藏，意译调伏藏，是佛陀为调伏弟子烦恼，对治生活恶习所制定的教团规则；也就是在修道生活中，佛陀针对弟子所犯的过失而定的规范，是随犯随制，属随缘制戒。律藏就是整理佛陀所制戒法的典籍，亦即“戒”由律藏所诠说，而律藏则为“戒”的根据典籍。",
        "pinyin": "lc"
    },
    {
        "title": "宗旨",
        "key": "zongzhi",
        "describe": "宗旨，指主要的思想或意图、主意。语出《北齐书·儒林传·孙灵晖》：“ 灵晖年七岁，便好学，日诵数千言，唯寻讨惠蔚手录章疏，不求师友。《三礼》及三《传》，皆通宗旨。”",
        "pinyin": "zz"
    },
    {
        "title": "对治",
        "key": "duizhi",
        "describe": "梵语pratipaks!a。原意为否定、遮遣。于佛教中，则指以道断除烦恼等。其中，‘道’为‘能对治’，‘烦恼’等为‘所对治’。据俱舍论卷二十一载，欲断除‘修所断’之烦恼，有四种对治之道，可顺次配于加行道、无间道、解脱道与胜进道等四道。梵语是印欧语系的印度语族的一种语言，是印欧语系最古老的语言之一。和拉丁语一样，梵语已经成为一种属于学术和宗教的专门用语。印度教经典《吠陀经》即用梵文写成。其语法和发音均被当作一种宗教仪轨而丝毫不差地保存下来。19世纪时梵语成为重构印欧诸语言的关键语种。它被认为是梵天的语言。",
        "pinyin": "dz"
    },
    {
        "title": "调伏",
        "key": "diaofu",
        "describe": "‘调’是调理的意思，调理身体健康，心态平和清净。‘伏’是降服的意思，降伏住自己的坏习气，日久功深，明了道理后加以修正。 　　佛教谓调和身口意三业，以制伏诸恶。《维摩经·香积佛品》：“以难化之人，心如猨猴，故以若干种法，制御其心，乃可调伏。”《旧唐书·蜀王愔传：“禽兽调伏，可以驯扰於人；铁石镌鍊，可为方圆之器。”",
        "pinyin": "df"
    },
    {
        "title": "法要",
        "key": "fayao",
        "describe": "（一）指教法中之要素。 　　（二）日本佛教用语︰与国人所谓的‘法会’同义。",
        "pinyin": "fy"
    },
    {
        "title": "论藏",
        "key": "lunzang",
        "describe": "【释义】：佛教三藏之一。指佛以自问答的方式论辨法相为经﹐佛弟子及诸菩萨又据此解释经义﹑论辨法相的有关著作。梵名阿毘达磨藏﹐义译为 \"论藏 \"。",
        "pinyin": "lc"
    },
    {
        "title": "声闻藏",
        "key": "shengwenzang",
        "describe": "二藏之一，三藏之一。指释尊为声闻所说之四谛、十二因缘等教说。为菩萨所说之六度等教法，则称菩萨藏。声闻藏一语系出自菩萨地持经卷十二。隋代慧远及唐代吉藏、善导等诸师，均将经典分类为二藏，并加以批判。于文殊支利普超三昧经卷中则举声闻、缘觉、菩萨三藏之说。若仅称声闻、菩萨二藏时，声闻藏中则已包含有缘觉藏。此二藏之分类，与所谓大小二乘、半满二教为同义。",
        "pinyin": "swc"
    }
]