[{
    "title": "佛说濡首菩萨无上清净分卫经 第234部",
    "author": "宋沙门翔 译",
    "html": "<div class=\"B1_text\"><p>佛说濡首菩萨无上清净分卫经 卷上</p><p>宋<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>翔公于南海郡译</p><p>一名决了诸法如幻化<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>经</p><p>闻如是。一时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。游舍卫祇树给孤独园。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>五百人俱。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。摩诃目揵连。摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。阿难揵等。率自耆年素行<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。皆弃瑕疵垢除清净。宿树众德所作已办。了厌身弊解识<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。睹彼五道受有苦器。漏[月*(止/(止*止))]诸患种种之秽。无乐<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>常欲舍离。见诸<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>缩心畏恶。断灭求空志毕泥洹。处往无还永彼静安。悉断<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>结网索尽。都无诸漏已离重担获四神足致六通行。能住身命存亡从志。度于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>坦然为乐</p><p>又与菩萨千人俱。悉尊菩萨摩诃萨。皆一生补处被大德铠显有佛称降现菩萨班宣道化布诸佛藏。神智异达已通圣慧。等住大乘志如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。以立广法过度无极具足普智明晓权要。总持所览统摄无限。积众辩才不可测量随俗顺导为大桥梁。无上<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>而无挂碍。散演深邃无极微妙。悉降魔怨都伏外道。独步十方周流往还。游于五道而无去来。如日月殿。若梦幻化影响野马。等无进止。感动一切济度生死。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>之化使永不断。道普兴显德皆具足</p><p>其诸菩萨。悉皆各有。名曰濡首童真菩萨。龙首菩萨。妙首菩萨。大首菩萨。普首菩萨。慧首菩萨。明首菩萨。甘首菩萨。英首菩萨。宝首菩萨。是等菩萨千人俱也</p><p>是时坐中英首菩萨。承佛神旨而从坐起。严齐法服肃恭已礼。偏袒其肩右膝着地。而跪白佛唯然世尊。濡首童真者。古今诸佛。无数如来及众仙圣有道<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。所共称赞。去来现在诸成大业菩萨之等。导进无由为一切师。了深睹远。道度渊懿明踰日月智过江海。达越虚空慧辩无极。德显无上四等普育。慈悲利安仁泰宽济。弘雅汪洋德无崖边。如无底泓憺怕旷定。如无像体。居于静寂。仪容无量。于十方土现佛广化。为诸菩萨所见戴奉。一切释梵及四天王。咸率礼敬委仰尊重。诸天龙神阿须伦众迦留罗辈。真陀罗摩睺勒等莫不供事。睹世帝王所共奉遵。圣相满具光好湛然。吾瞻濡首众德具备。诸善若。斯为难思议。愿常歌咏显赞无极咨嗟叹美流着十方于百千劫永无懈也。其时濡首谓英首曰云何族姓子。法身有烦乎。曰其法身无处无像。又法身者都无烦劳。曰云何英首。仁了法身乎。曰法身者岂有处所言声迹耶。又法身者无了不了。若响如影。宁所了乎。曰知法身如幻化影。无了不了亦无言说。而仁云何举声说耶曰向所言如。响之声。为诸文说着<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>耳。曰如仁言。则其法身为有内外有其彼此处于中间。为有数观。已在二数则有处所。又曰英首于法身者都无响应亦无影像。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>无意无念无识。无言无说无异无同。无二之趣亦无一归。于一无一亦无所处。是者英首。本无法身。微妙印说极世所归。无上无比道要之藏。于时佛叹濡首曰。善哉善哉。如濡首所言。乃应清净法身说也。时座中五百比丘五百<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。闻濡首所说。皆逮无所从生法乐忍又舍卫国清信士女二千人。本不<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>于大乘行。闻此要说。即自坚固于无上正真道意。万二千天子意亘踊跃。发菩萨心。各在虚空而歌濡首。积德过劫功成无量</p><p>是时濡首童真菩萨。以其平旦欲入城分卫。整圣无上清净道服。执御应器持法锡杖。粗顺如佛。机检典制度量俨然。庠行安步进止端严。回旋顾眄光色无量。诸根静寂常应道定。威仪述叙礼法肃齐。众德悉备靡不雅然。如猛师子。如大龙王。景福之祚[火*霍]出树园。威相无量德好卓异。晖颜炜晔光曜炳然。濡首童真方出只门。即自念言。今入舍卫必有十方诸土菩萨普来之众。应承圣旨所感动者。便当如佛寻以其像不移所住。己身一一毛孔之相。出化菩萨。其诸化者。睹于十方悉现其化。一一国土化所化者。各称言曰。濡首菩萨稽首世尊。恭问游居。佛祚康强景福无量乎。又诸如来所侍<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>悦目遑憙。各问其佛。斯从何方乃来现此诸土。世尊。各告侍曰。有土名忍。<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>能仁如来至真等正觉。彼有菩萨名曰濡首。道慧难测权辩无量。悉于诸国博现佛事。今于彼土。兴显大道。故身毛相而现其化。唱此感动。进诸疑惑。普土菩萨及诸<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。见所变化。各闻佛语。亿姟菩萨悉得无所从生法乐忍。万亿之众在生死流。闻濡首名又睹化应。皆发无上正真道意。十方菩萨莫不乐喜。愿见濡首。听禀清异上闻之说微妙法像。得睹其佛及彼菩萨。诸士寻随无数菩萨。各启世尊。欲之忍界睹能仁佛礼事<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。又见濡首观听变说。诸佛默然。即应受教。各承圣力。迁飞彼土忽升忍界。到濡首所。诸来菩萨咸怀敬仰。或持天华或擎明宝或执垂珠。或直叉手或作天乐。或列虚空散华末香吹噭鸣。珂或复歌颂濡首童真。道显普祐无上之德。或欲宾导侍卫濡首。肃恭而行瞻睹无厌</p><p>是时释梵及四镇王日月天子。诸龙鬼神各与所辅亦寻忽至。释与四王俱同有念。今濡首童真。与无数菩萨诸尊<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。当入舍卫显大感动。宜应尽化向舍卫城道。令其坦平而无高下。侠道两边列七宝树。一树之间有七玉女。各现半身而作倡伎。女容委靡姿媚面照华色目若明珠。端正妙异清声美辞。以歌濡首大吉祥福清纯。道品菩萨众德。步置熏炉烧天蜜香。处有杂华以为供养。登于尔时。道之左侧。舍毒螫虫蟒蝮虵蚖蜂蝎众类。应时咸然消缩毒气。吉兽瑞鸟进集嬉翔。彼时濡首。为无数百千菩萨众及诸天人。而所围卫。特独堂堂光色无量。譬日始出高山之岳。若月盛满在众星中。又若须弥异于众山。如猛师子出于深林。晖颜灼然遂而进焉。适侧城门寻足蹑阃。尽境震动。登尔之时莫不惊愕。所在伎器率自鼓鸣。咸曰此何吉祥大变瑞应之异。乃未曾有。将佛入城所感然乎。举国大小靡不惊喜。心豫忻忻肃恭无量或上楼阁或攀垣墙。或窥窻牖或出门户。竞有悦怿。向佛冀\" cf2=\"G05_p0353a23异\" sic=\"粪\"&gt;冀睹神异。时王波斯匿。与宫正后美妃婇女八千人俱。诸子群臣眷属万人围卫从行。各怀忻悦惶憙出迎。斯须之顷濡首忽至。为诸菩萨及尊众天而所卫从。大人相具众好普备。金颜圣容见皆喜悦莫不前礼。诸来之众中有散华或烧妙香或散衣宝。检心恭向瞻睹无量。于是濡首遂前入城。诸尊菩萨有势天神佥然恭肃。追随所旋观见神变。又欲禀受道诲故也</p><p>尔时于是龙首菩萨。见其濡首童真菩萨为无数众而所围绕堂堂祥仪并共入城。曰族姓子。为所之耶。濡首菩萨答龙首曰。吾适此城欲行分卫。多所愍念广其慧利。为拯世众一切天人度义故。现行分卫耳。普为诸众成大导故。龙首问曰。云何濡首。仁尊于今分卫想未断耶。曰族姓子。吾断矣。于有见分卫想行者。至于无见无断不断。斯谓菩萨清净分卫。所以者何。若此龙首。一切诸法无断不断。譬如虚空无断不断。以是言之为不可断。普悉是世尽魔梵界。一切众寂及诸梵志王与庶民。亦无能断也。何则龙首以其诸法若如虚空本无所有。无起无动无持无获。空本无获亦无所持亦不可得。以要言之。一切众类及世余法。外邪杂术悉无所有。无持无得亦无能获。诸法如此皆不可得亦不可持。以本空故故不可断。云何濡首。菩萨摩诃萨当与诸魔为敌耶。答曰龙首。法本无诤。不见菩萨当与诸魔而有战者。若其菩萨与魔为敌。起见法想而有所诤。是菩萨便为恐怯。何则然者。以彼菩萨自兴恐弱也。譬如龙首幻师现化而幻所化了无恐怯。如是龙首。此菩萨解本空法无著之行则无恐怖。若有菩萨有恐怖者。是菩萨便不为极世<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>也。是菩萨不了空法故。自起恐怯之心耳。于时龙首问濡首曰。菩萨为可得道乎。答曰菩萨可得道也龙首又问。云何濡首。其谁可得至于道耶。曰其无名无性亦无号字亦无处所。永无所为亦无得者。斯可至道。曰云何菩萨当得道乎。答曰龙首。若有菩萨欲得道者。当以无发心。亦无念道不想道场不念人界。心亦无处无念无得亦无识着以无见心。是行菩萨可得至道。曰仁以何心而发道意。答曰龙首。吾无数心亦无当发。又无甫发无发不发。又吾亦复不至道矣。不念道场不坐佛树。亦不得道不转法轮。亦不化过生死之类所以者何。若此龙首。以诸法无所有故。无动无摇无出无入亦无所持。以本空故。吾以斯法可得至道。曰濡首。是为正要无上无比之至说也。其诸于斯解如是法彼则长脱一切尘劳。其已脱于尘劳数者。乃至应永脱于魔波旬。曰非可脱于魔波旬也。何则然者。以其诸魔亦道之数。所以者何。魔及魔天皆悉本无。无取无得无想无念。以故言之魔亦道也。曰何谓为道。濡首答曰。道乎龙首。在乎一切一切亦道。道像虚空道体广荡。亘然恢廓普大含容。靡不周至亦无限碍。如是龙首。道至一切一切亦道斯谓无上真本无道也曰仁龙首。欲得道乎曰吾欲得不可获道。曰欲得道宁非戏行耶。所以者何。如龙首言。欲得不可获道。道何可得乎。若道可得道为有处。譬如有人兴念此言吾使幻化坐于道树然致正觉。如是言者岂非响声耶。其幻化人亦不可得。亦不与诸法有合有离。亦无所著。以本空故。若龙首。一切诸法如幻如化。而起有想念欲得道耶又如来说诸法本无无念无想无所著。其解是者斯乃得道。诸法无所入亦无能毁。法不与法有合有离。况法与法当有毁乎。法无附合亦不离散。所以者何。若此龙首。诸法无合以其本无都亦<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。又若虚空亦无所有。无像无念无动无摇亦无戏行。诸法本无寂寞如空。如幻如梦无喻无比。诸法若此都无等伦亦无像也。诸来之众听濡首所说微妙。踊跃欣喜各怀无倦。渴仰悚恭专心思受。说是如化深妙法时。八万菩萨逮得无退转。无量天人发无上意</p><p>是时龙首答濡首曰。善哉善哉。童真菩萨快说是像深邃妙法。为未曾有。如吾从仁逮闻此要。始今日明为已得道。曰族姓子。法无言说亦无见闻。吾不说深又无浅说。仁亦不得道无得不得。何则然者。如卿龙首。念欲得道为想戏行处乎。受者堕有望见。使其云有深浅法耳。吾无所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>无言说。亦无宣畅亦无所行。亦无能说诸法本者。又龙首。譬如有人而言曰吾为幻化广说识法。其化无识言当说识耶。彼则缘此起劳诤想。何则然者。以化无识不可为所说。如是龙首。诸法本无无所有亦无处所。是族姓子。当了如此解。谓具足法行者也</p><p>尔时于是妙心菩萨神彻视听。睹闻濡首在异别处讲上要菩萨之谈。忽到其所见大会场。憙而叹曰。善哉善哉。诸上正士大士之等普众会。此为何谈讲乎。濡首答曰族姓子于诸如来深要法中。获无正士大士之名。又菩萨者。不自名言我是菩萨正士大士。其有想着住戏行众自称菩萨。复言大士。又云吾为法之大讲。又复妙心。其响者宁有言声出不。响复有耳识所著不。于响法为有所<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>不乎。龙首答曰。都无也。如是龙首。诸法若响无名无像。其取著者则有戏行。缘戏行故便有流转。长不解诸法。如本无响也。则于生死而行诤想。已起诤行便堕躁动。已在躁动即无生死流于五道。便由不解其无故也。于是濡首谓龙首曰。又族姓子如世尊告。诸比丘曰。是比丘。汝等无著戏乐想行。为汝辈说寂寞之行。念释师子说法如是。专心一意听受随法。入要行忍当无所著。若此族姓子。其菩萨解顺是说晓本空净。于本寂寞明了如是。此乃长脱五道之趣。时龙首曰。谁于生死而有脱者。濡首答曰。族姓子。何谓如来所化生死为脱者乎。宁复有去来今耶。若是龙首。圣师十力。以此要言。化度生死。曰如世尊常所说教。诸法如化。又仁亦说诸法无所有。以是言之。一切众生为当皆成无上觉道耶。答曰龙首。若一切解如是者。此乃至道要行之言。故吾不说法。法无说念无受无持。无得无失无言无语。何则然者。以诸法为无所持。亦无所有无念无识。以无处所故。又若一切解诸法如幻如化无所有者。则众生类皆至觉道。譬如龙首幻师所化然幻者自了化之本末。为化化耳。于诸法亦无所化亦无住置。普悉是世天龙鬼神魔。及梵天沙门梵志。至于极世无能令幻者于其所化有坚固想。何则然者。以彼幻士自达。所化化本自耳。无幻无化都无所有。而幻者明知一切为化所惑。于无所有而起有想<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>想常无我想我著有想念求无想法。望念无色住无所有。由不解本不了无故。续流生死。若有明晓诸法本者。彼众一切则于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>即无还转而成正觉。所以者何。若此龙首。以彼众生皆在觉道法之数故。故诸一切于佛法而无挂碍。是故众生悉住佛法也。然众生等心亦不寤本空清法。无名无识亦无所住。无戏行无倚无著寂如虚空亦不巢窟无上寂定亦无所生又无身法。其有忍于深空法者。此则不离于佛法矣。所以者何。若此龙首。诸佛之法终不可以想行而至。其有想著有言有说有宣有广。殊不可以得佛道法也</p><p>于是龙首谓濡首曰。善哉善哉。仁乃快说无思议法。谁当信此一切众生不离佛法。濡首答曰。族姓子。其世尊子坚住信法。八等之地及须陀洹斯陀含阿那含阿罗汉辟支佛。菩萨阿惟越致无动转者。斯诸菩萨已住清净行空法者。是等当信耳。所以者何。此龙首。其诸菩萨行如是者。便自誓愿。必绍大业吾升趺定坐终不动转。至于得成无上平等觉必将来一切诸天龙鬼神极世之前。成其大导当师子吼。所以者何。若是龙首。菩萨了空无想行法。住如门阃。坚喻须弥无能动者。如是龙首其菩萨住空无想愿法。一切众生无能动者。又是菩萨处于佛树。乃至道场无能动摇。问曰濡首。何谓佛树道场之处。濡首答曰。何谓龙首如来化处化所依坐。何谓如来化之觉法及现神变化度说法。谁为如来。其谁化者。龙首答曰。吾尚不见如来之化及法身像处。何况所化复现威神。又所说法及所变化乎。一切如化本无亦化。其化亦化亦如化耳。濡首曰。善哉善哉。龙首菩萨。为吾发遣应慎之法。为如彼诸深妙无著法忍说者。是为无上无比之说也</p><p>彼时龙首谓濡首曰于斯妙像要法之说。亦无起行又无入忍者。所以者何若此濡首。以诸法本净。其相本空亦无处所。亦无巢窟无色无像。诸法悉等如虚空。若此濡首。其有法当起法忍者。则如来化亦逮法忍。影响梦幻野马泡沫芭蕉之属。亦悉当复成其法忍。所以者何。以其忍处悉空如空。都无起法忍之者。又忍者亦无其起。亦不已起又无当起亦无甫起。又其忍者。亦无是处亦非彼处亦无中处。此乃无上无比要忍。若此菩萨于是慧心不恐不怖亦<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>惧。是则菩萨摩诃萨。便应无上法忍之行。十方诸来神通菩萨其闻濡首所说深妙。咸悉踊跃皆逮此定</p><p>是时濡首谓龙首曰。云何族姓子。其菩萨者以无著行得入法忍乎。答曰濡首。若有菩萨想念所向则为着行。言吾解深。云我深忍明达晓了吾已至道。其语此言。皆亦着行。濡首又问。菩萨何行修应得道。答曰。于诸法都无所入。不念诸法了诸法无。其诸法者依着因缘。于本为空获无所有。是行菩萨便应道忍。设如此行为无所行。譬人寝寐于梦所行。龙首又曰。然其梦者。不行方隅亦无所行。亦无去来无住无坐。其寐寤已则达而信。所梦空身无持无舍都无执持。无像<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>亦无处所。亦无所有其若虚空。如是濡首。菩萨之行当无所著亦无所入。如空本无亦无戏行。此则极世无上福田。斯乃应受一切供养为无量导。是最福地。为应最上法忍之行。普来众会率怀喜敬。各所赍华宝以散濡首。瞻睹欣踊悦豫无量</p><p>于是龙首谓濡首曰。宜可俱进入城分卫。曰仁去矣。行分卫时无念。举足下足躇步无念。动摇亦当无处无住无游。无屈无申无心无念。无所发行行无所想。亦无城想游无路想。又无城郭县邑丘聚想。亦无里巷无家居想无门户念。无想男女无想幼弱。都无心想行当无念。所以者何。以其法行当如是故。亦无所著无色无像。无起无灭都无诸想。如此行者。乃应菩萨无上分卫。清净寂寞要道行也</p><p>尔时龙首菩萨摩诃萨忽然于处以如海定三昧正受。其定之德。譬如大海湛然无移憺怕清澄更无异味。其底深邃不可测度。琦珍英宝普无不有。而海汪洋包罗弘广。含受万物渊懿博泰。无边无崖大水澹满。诸德神龙而皆居之。众生巨体所依长育。若此龙首。其诸菩萨以如海定正受之处。所住要旨无能动摇者。如是龙首。其斯菩萨以法身海。含容一切道宝<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>三十七品。十方依之莫不长育。应无上微妙之法。为无动摇无言说要行。当知。是应如是者得无退转定行之地也</p><p>尔时于是。妙心菩萨欲动龙首大士所坐如海慧定正受之处。尽其神力永不能动。时此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。普悉六反乃大震动。而龙首身及所坐处都不动摇。何则然者。以其龙首住无动摇。住地处所。住无所有。住无想念。住无戏行。住无劳静。住无言辞。住无所住。斯谓道住。时龙首菩萨摩诃萨寻从定寤。敬向如来无所著平等正觉。雨拘文华趣散世尊而叹赞曰。自归于佛天中之天。乃使一切诸会菩萨十方来众诸大士等众尊大天及龙鬼神咸悉逮闻如是之法。无上要旨深妙慧说。为无倚着无巢窟说。为应本空寂寞故也。是时妙心谓龙首曰。仁为觉地六反震动乎。曰族姓子。其有动者当觉地动地。复为之上下四震。唯由其觉动不动故耳。又如十方诸佛世尊。普大菩萨不退转等极世都动。岂能动摇此上尊处。观诸声闻缘觉之众。彼虽离动。未晓本空在动之地。自谓无动了本无者。于此诸法永无动摇无念无著。如是妙心。其菩萨以空无想不愿之行清净法要逮无动摇。彼乃永静安无动摇。又曰龙首。可行分卫。答曰濡首。吾今已解无上最要分卫之慧。何则然者。缘其逮致如海大定正受之处。始乃自明。为以得无上平等正真觉道。以于生死兴显佛事。为转法轮以度众生。为济因缘离垢根本。唯然濡首。如吾遇仁。乃为逮值无上善友。遭蒙矜念心怀悦豫。成立大德喜自光慰。濡首。于吾为覆载首。大无量过度之首。无垢广普微妙吉首。亦应最上不可议首。愿布五体稽首恭礼无上仙圣<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>之首。濡首答曰。善哉善哉。如仁龙首。已为果达野马梦幻影响之行。无名无像无所有法。仁今乃应无上大道不可思议来法之祠。以得如海定正受行。共应如此。当知是辈在一生补处。斯者乃为菩萨辩慧。其致是像深妙定法如海定等则离诸想也。曰仁可行从分卫。龙首答曰思齐其德当与仁行。二圣龙游不亦宜乎。濡首曰。吾无所行亦无去来。又无进止亦无侣游。不住不坐亦复不行。行无所至来无所由。住无所处。坐无所据。行无所趣。譬若龙首。如来现化。宁有去来坐起行游卧寝寐寤不耶。曰化者都无去来坐寝之处矣。吾于诸法亦复如是。无住不住无起不起。亦无已起又无中起。亦无当起亦无甫起。龙首答曰。如仁所言。此为极世难信之说。谁当信仁此尽要慧耶。答曰龙首。仁者且听。岂为无目设举锭烛乎。夫然炬燎唯为明目耳。如此是像深妙之法。正为向达彻远菩萨摩诃萨乃能信受是道要耳。其了如此至要之慧。斯则晓解本无行者。此等菩萨为应清净无上久修梵行之徒。是曹正士深住于法。信法受法持法说法之辈也。为在鹿聚已转法轮。为应贤圣亦大导师。施惠明眼。为应无量雄猛之者。此则无上最妙法者。濡首童真发说是时。普大众中八万菩萨悉得无所从生法乐忍也</p><p>于是正士妙心菩萨居大众前广然踊跃。掬满手宝。以恭肃心向散世尊。又散濡首童真菩萨。散讫忻喜重叹咏曰。自归诸佛。为慧圣达擿雾寤寐。碎散痴本解众颠倒。释疑除网顺入道明。致无上觉者。自归于法。法之最法。法治多济疗捞雾龙。援雪生死[廿/好]莇众秽。荡除心垢通导迷惑。法为无上。修蒙永度。其诸菩萨久履梵行。无上清净仙圣明类。大神通等弘显德者。无上之徒。于此乃逮信向是像深妙法众。今普自归之。濡首答曰。若此妙心。其无脱者。斯当果致无上等觉。曰云何濡首。其谁无脱耶。曰其有执持。斯当求脱。如是妙心。法无执持亦无系着。又族姓子。法都无脱亦无执持。当谁有脱。无缚无脱。诸法无持无取无舍。譬如人语幻者言。善男子。为深入人解之脱之所可执持。幻答人曰。吾亦非男亦非凡人吾无所持。当何所脱。是者妙心。道无执脱当观其无无本空净矣</p><p>佛说濡首菩萨无上清净分卫经卷上</p><p>佛说濡首菩萨无上清净分卫经卷下</p><p>宋沙门翔公于南海郡译</p><p>时龙首菩萨谓濡首曰。去矣族姓子。东行分卫。答曰龙首。其幻化野马宁有东西南北方乎。曰吾于仁前尚不能言。况敢所说。何则然者。以其诸辩从尊所问。仁即应顺<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>发遣。一一解散而无挂碍。故吾无辞莫知所对。曰夫达者都无言取。况共乃复有所说乎。是者诸法之无由矣。曰何谓为诸法之无。答曰龙首。无所无者。斯诸法无是诸法要。以此之慧。乃能通彼众音声耳。无所宣布乃为要义。是岂非至要义说哉。曰此续在想行者也。曰何所行应离诸想。答曰龙首。菩萨不于色痛想行识界有想。又于法本亦无所行。其本无者亦无所行。以是之行得离诸想。说是深邃微妙法时。五千菩萨逮致此慧。二千天人发菩萨心</p><p>时龙首曰。吾将退矣。以童真非我侣故。濡首报曰。吾无去来亦非有侣亦无所俱。何则然者。以道无侣故。亦不想念与诸法侣。又亦不与欲行为侣。于本无法。亦不见而有其侣复与所俱。又本无者都不言有。吾我性有人<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>及身养育法。人物言说识觉所倚着。及其所作行趣之事。诸法之本本无如此。当与其谁而为侣俱耶。其有侣者是欲侣俱也。譬如龙首。有明达人而念言曰。如来所化幻士所化。如是此化等一无异化。而斯人化各各言曰。吾与汝侣汝与我俱。于仁龙首意云何。其此人化为有侣无。答濡首曰。化无侣也。所以者何。用化本无无所有无形像不可得故。曰如是龙首。于其生死都亦无侣亦无所俱。其有侣俱斯则有别。若起侣想是便与欲俱。明达菩萨当解侣想。何则然者。以其诸法如幻如化无侣不侣。欺哉诸法慌忽无信。若梦影响。所有如空。想识无安无处无持无意。无念无所有。已离诸念。于念无念应本无念。曰濡首。仁为曾与幻士化人。对共语言行来坐起。又共谈会有所思惟不。濡首答曰。不见也。龙首曰。幻士何像貌。曰其幻者似人像类。幻之化像亦复若此。合同像耳。所以者何。如其幻化亦不彼脱亦不此脱。幻化亦不与人而异。人亦不与幻化有异人便幻化。如幻化者以幻化法而问幻事。诸法亦尔。又问濡首。仁为自曾与幻化复共坐起有所言谈交游讲会相对住不。曰云何龙首。幻士及化与欲有异耶。至于吾我及人寿命养育之法有异乎。吾以此幻化之说。欲试问仁。知大士于斯有异辩才。当敷何法也。曰仁如所试。为欲试虚空之幻化法耳。仁便念幻化为有想也。幻者本无。无想无念亦无形像。亦无所有已离众念。濡首曰。若此龙首。法亦如幻幻化本空。其空无像亦不可见。曰濡首。诸法无像不可见乎。如仁所言。一切菩萨摩诃萨等当云何受其封拜得成无上正真道意。为谁知度受封拜者。濡首答曰。云何龙首。曾行山中为闻响声。于山中为有响声出不乎。其声为有所住处不。以何耳识闻其声耶。彼声为有所说不。宁有受持响声者耶。又复谁共谁闻响声者。龙首菩萨答曰。无也。濡首曰。如此若菩萨解诸法。若如响空者。则一切诸音声如响离彼众声。其诸菩萨以此封拜于无上正真之道。于斯亦无受封莂者。十方诸来大菩萨众咸闻濡首童真所说。莫不喜踊叹歌无量</p><p>尔时龙首谓濡首曰。宜时侣行入城分卫。念其日时得无过耶。答曰龙首。诸法无过亦不有时。其处于想行之者。彼则有时不时之想耳。明达菩萨于本了无解空法者。岂其有时不时言哉。凡诸余法有时不时。无时非时乃应无上如佛法律矣。其在算数计时节者斯则有过时之想。如诸世尊贤圣弟子。常自饱足以道智慧。慧无想识于想无想行无诸作。亦无想念无念不念。以此智慧而常饱足。世尊圣众都无食念。亦不复想有食之事。其如此食而为食者。是谓贤圣应无杂食。若永服食如此食者。是则长演甘露法食者。彼以此食用之为力。能住身命至于一劫复过一劫。所以者何。其如此者彼已觉了诸法之行故。都无想念解空清净。晓了如此。是不复有求食之识。如其凡夫未达者也。又诸如来无上正觉及普世贤圣之等。有大慈悲喜护之心。惠施仁爱愍念众生。使兴于世耳。唯欲济度五道勤苦故。现入郡国县邑聚落行受分卫。而彼众圣已离诸食不食于食。唯以慧解诸定正受为常充足。其于杂食而续食者。斯受流转便数生死。用是之故诸佛世尊。以于诸食而悉明了。都无复杂食之想。慷慨喟然安和住身。能如恒沙复过是数。从始发意。永常无复诸饥渴杂想念也。至在佛树明星出时。从始所可受食者。彼因此食。其于正士及大丈夫英雄龙猛。又至师子诸调儒夫及众华孚正士秀异种种莲华男子无上丈夫法御天人师。应所当得。应所明了。应所觉达。悉已了而具足。等于一像合会智慧。得成无上正真道意也。以是龙首。一切菩萨普诸如来及贤圣等。唯以此食升致无上正真觉道。便能住寿如恒沙劫。又能踰此复倍无数。而诸如来永无其劳。所以者何。以其应于无想食故。无念不念无合不合。亦不想合贤圣之行。恒便随顺出诸香气。自然清净无想无念无诸巢窟。亦无戏行本空自净。如是龙首。菩萨摩诃萨当作此食乃应法食。</p><p>龙首答曰。善哉善哉。濡首所说法之微妙。吾已饱足于是上食。但闻此法食之要说。便为已甚具足矣。况其长食无杂食者。岂当复食思欲食哉。云何龙首。虚空之体宁当有杂食之食。又言饱足乎。对曰濡首。空无所有也。又曰龙首。为能饱足幻士所化不。答曰不也。云何龙首。宁可以食饱足中现像耶。答曰不也。又曰龙首。夫大海者宁复饱足于众流乎。答曰不也。濡首复曰。如是龙首。诸法无厌若如虚空。而仁向言有饱想乎。诸法如空无想无愿。无起无行亦无所作无所造。永然无欲以定以脱。无色无像无坚无固。了如虚空都无所持。诸法如此。云何而起有饱想耶。龙首又曰。若是濡首。有此行者一切不复食于食乎。而仁说食本空耶。濡首曰。若此龙首。则一切众生而无食也。譬如龙首。世尊化作恒边沙人以食食诸化人。云何族姓子。彼诸化人以何为食。宁复有食者不乎。答曰。化者无想不识无所有亦复无食。何况言当有食者耶。若此龙首。一切诸法有见无见如幻化也。普诸众生而不解此。以其不解便即流转受生死矣。于<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>之亦无所有亦无所得亦无流转。解生死无如本无者。则一切无受亦无生死。不晓本空便有生死。其生死者亦无生死。于其生死亦无所受亦无所得。何生死法者乎。答曰濡首。斯言甚善。宜知其时可共行矣。还于祇树给孤独园。吾诸饥渴永为已断。答曰龙首。譬如幻士所可化人。而化人言吾饥渴。斯宁为饥野马法耶。如是龙首。一切若此。其诸法者皆如野马。解此乃解。而族姓子言。吾饥渴以为断乎。当食斯食。如诸法食不断无坏亦无饥渴。一切诸法本已饱足。以故彼诸凡夫下士不了其本。则作此言。吾饥我渴又言饱足。如诸贤圣解其法本。彼无饥渴亦无想足。解诸饥渴亦无生死。亦无戏行亦无想念。彼已无动亦无倚着。诸法已脱本无著故</p><p>龙首又曰。如仁濡首。诸所可说彼之要言。但说法界也。濡首复谓龙首曰。其法界者。亦无说不说。亦无言趣无屈无申。所以者何。如是龙首。法界无所有。言者无说亦不所说。亦无戏行无所著无合偶。彼无想念亦不有念。亦无所起亦无灭行。譬如龙首。虚空之界无想无念无起无灭。诸法亦尔同如虚空其本相空。本不可得亦不可知。其相如是亦不可得有能得其相。彼诸如来般泥洹者亦当可得。若此龙首。一切诸法都无处所。无色无像亦不可见。以是之故。恒边沙诸如来般泥洹者。其于法中亦复无般泥洹者。亦无地水火风界而般泥洹。亦无空界亦无识界。般泥洹者泥洹如是。于泥洹中亦无泥洹。若诸法有泥洹想者。则虚空界有泥洹想耶所以者何。以其诸法本定而空。诸法静寂。而复寂于此凡夫下士之类起有泥洹想念者。因便有吾。言我有受。有吾我受。有寿命受。有人物受。有想识共来。解真无法者。即起是想想念泥洹。以此故而不得脱。便生老病死。取要言之<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>至于大苦众患集会。为彼之故言有泥洹。为诸有二想。行者以其不解诸法本无。已不晓了不<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>故。与诸如来诸佛世尊。明解深入权行菩萨。宿树众善立不退转。积累<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>有大威神。为极唱导无上大师。与如是等菩萨摩诃萨行。而违反起有诤想。又与声闻缘觉之众。与其相违而起忿诤。与彼诤故当受大罪。以其诤故长流生死。当归不净极臭处矣。一切众圣永所不叹。诸上明达所可远离。譬如族姓子有城郭若复聚落。去其不远积众臭秽。于其彼处人众趣往昼夜不息。遂增污秽不净臭处不洁之物也。诸愚凡夫处于五道。起灭不竟众想无。断广其生死如彼增臭也。以其不明又不晓了。不解其元不达本无。雾笼茷盛痴冥积故。广受流转增长生死五道之趣。或生<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>或即饿鬼。复归畜生。或天或人。神变无常五道勤苦。灾患颠倒痛痒创楚。众恼之元诸苦所由。遂增臭秽流不净气。使彼明达贤圣之众乃以为灭所共贪疾。又诸慧士所可远离。用是杂垢长不<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。复使斯类是趣其生。是归有老生老苦。极忧恼万端。是致病死殃福追之。善则荣乐罪则祸随。以要言之患变猛集至其痛热众苦合会。而彼以故不脱生死。但由未了其本无故。长受生死如其增臭也。龙首复谓濡首曰。云何濡首。得了其本。曰以无心想以寂寞行。以起静定向入清净。其住是者则晓其本。曰云何濡首。何谓为幻之寂寞曰其解了如幻者。此则幻之寂寞清净也</p><p>尔时耆年须菩提至濡首所睹其大众。即而问曰。诸正士等普来会此。为何讲乎。答曰贤者。吾于诸言都无所说。又贤者。宁闻诸幻人有所说不。山中之响梦影野马。为有言谈耶。复闻有其说者不乎。又贤者。如来所化宁有耳声。其复有闻者不为有识。若受持语言名字句说者不。答曰不也。时须菩提。[火*霍]然于所坐慌惚之间。寂而灭定</p><p>时舍利弗诣濡首所。睹其普众大会之场。率多菩萨咸听濡首所讲之说。见须菩提在于彼坐寂而灭定。问濡首曰。此贤者为何志故居斯便灭定。曰舍利弗。是须菩提离灭定不与法而有其诤。如是贤者。此以无诤行。无住无著无巢无处。过诸窟法而三摩越。时须菩提作是灭定。从定寤起而向世尊。即偏袒右肩。叉手跪作是言。自归诸佛无上觉者。其有显演如是深邃微妙法像难见之文。不可议说。已断所著等离诸想。已得寂安。其不退转大士等及诸初发意菩萨。逮闻如此劝发之说。岂不快哉。濡首又谓须菩提曰。不于此法有说有劝有彼所向也。何则然者。以诸法无劝无说无谈无识。又此要义无言无语。无住无动无去无来。无坐无卧无倚无处亦无所有。所以者何。是诸法本空无所有。其本不可得故。曰何谓濡首其本行法。曰惟贤者。诸法无行是行之要。当作是行。晓行是行乃为至行也。若此可共都行求食。曰濡首。吾不复入于聚落分卫。所以者何。逮闻是要已离聚落。亦离城想亦离色想。以要言之。亦离声香味细滑法想。都离诸想而无想念。曰唯须菩提。如此离其想行者。所是云何而进止乎。云何濡首。何谓如来所化色痛想行识。以何识法。如来所现化。化以何想而有进止。有所瞻视复有屈申乎。曰善哉善哉。须菩提。如世尊所叹仁为最晓空闲行者</p><p>濡首又曰。唯须菩提。可共诣佛礼事供养。濡首重曰。唯贤者。吾以清净食而请于仁。时舍利弗谓濡首曰。于何所与吾等食。为当施设何等之食。曰唯贤者。其所食者亦不有食。亦不吞食。又所吞食。亦不色声亦不香味亦不细滑。其所食处不在欲界。又不<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>亦不无色。不处三界亦不离其中。是则诸佛世尊食处。时舍利弗谓濡首曰。善哉善哉。如仁所说吾已饱足。于时是无上食叹之名。况其已食如此食者。曰唯贤者。其食不以肉内外眼见。亦不天眼亦不慧眼处有所见。其食如此乃应等食也。尔时耆年须菩提及舍利弗并诸众生。闻是叹食之说。即于其处寂而灭定。时妙心谓濡首菩萨曰。当以何食食。须菩提舍利弗等。为以何食而三摩越。曰以无漏食。行无倚着食。行无众食。以此行而行。其作此食者。不复于三界食于食也</p><p>尔时贤者须菩提舍利弗。从灭定寤各行分卫。时须菩提。入大长者家分卫。其长者妇为优婆夷。见须菩提默然而住。即请贤者为何之乎。答曰姊。来求分卫。曰贤者。仁续分卫想。来止了耶。曰姊。吾从本际已了分卫想。曰须菩提。其本际宁有了未了。言从本际已了分卫想乎。曰姊。如本际空未际亦空悉如本空。优婆夷曰。若此贤者。已悉空者奚为复说了不了乎。仁便伸手当施卿分卫。须菩提即自伸手曰贤者。是为罗汉不了其本反取灭证者手非。须菩提曰姊。罗汉手无形不可见亦无屈伸。譬如幻士为幻化人作此言。何所是幻者手乎。复言可伸幻者手耶。曰姊。幻手为可见不。又可伸乎。答曰不也。须菩提曰。若此姊。世尊说一切诸法如幻本空。若是贤者。世尊说一切空。何为贤者续求食。时优婆夷未寻与须菩提分卫。重曰贤者。可前钵。适当前钵。钵忽然不现。时优婆夷。以手索钵钵而无处。手亦不近于须菩提。优婆夷曰。善哉善哉。此则无著清净之身。应佛所叹空闲行者。优婆夷适作是言。钵即自出。时须菩提便前授钵。优婆夷取钵盛满饭授须菩提。便谓之言。贤者。是为释迦文佛所称叹。处闲居第一者钵非。曰姊。如佛所说空闲行者非有钵矣。曰如贤者空闲行者非有钵耶。曰姊无也。曰又贤者。闲居尚无钵。岂当复有受食缘乎。曰贤者。已记闲居。亦当无罗汉取灭证耶。又贤者。食此饭已。当了知食者如幻所食如化。又如化人食于幻者。亦当如以野马饮于渴者。其食所食当了如此。明解是者乃应如来达三世本无分卫之行也。若贤者。其起施念。有想受者。便造有众分数也。已受数者则有二见。以有二见便与凡夫流转五道。生死同归也</p><p>时优婆夷复谓须菩提。又如贤者。诸佛要法不但受食。及与施者。当应了如幻如化为本无为无有至于生死与泥洹法。亦当晓了如梦幻化野马影响亦如本无。于诸法亦悉当尔。诸法清净都无所有。无施无受。无戒无犯。无忍无诤。无进无懈。无定无乱。无慧无愚。于一切法都无所有。是行乃应世尊如法受食。弟子行法其如此解分卫行者。则于三界无杂食之想。亦复不处泥洹之乐也。须菩提闻优婆夷所说。即惘漠不知所言。曰贤者。泥洹为寂耶。岂无言而不对乎。曰姊。斯何言乃如此。须菩提曰姊。了幻法耶。答曰贤者。吾了诸法悉如幻化。幻者及化亦皆本无无所有。时须菩提。便于所处忽而灭定。欲知优婆夷志求何乘。以为其证。勇辩乃尔敢师子吼。明解幻法所说自恣。而无挂碍。尽力观察处。优婆夷为阿那含。曰姊。已得阿那含乎。优婆夷曰。云何贤者。如来法本宁有阿那含行法乎。又贤者。法无形色。亦复无来想像之迹。无彼此识无中间行。亦无所想无取无证。亦无处所。乃为明了道之行耳。向贤者。云何处阿那含毕。乐罗汉证法乎。又贤者。法无去来。其有去来有所趣向。有所有趣有起有灭有念有想。皆堕凡夫流转未解数也。是时优婆夷忽于所处。于须菩提前化于高广大人交露之座。普现感动光明相像。显转无上阿惟越致法轮。令普舍卫境界之内及十方土。莫不闻见此之所兴感变也。尔时空中万二千天。闻彼所说悉逮一生补处。舍卫国内志菩萨行者二万八千人。承宿众德皆得不退转。十方之众诸来大士其闻是说。百亿菩萨本得无所从生法忍。复闻是上要说即皆逮一生补处。于是濡首龙首菩萨。并诸土普来之众。及舍利弗须菩提等。俱从舍卫国甫出城门。[火*霍]然轻举忽升虚空。濡首菩萨寻扬身光。威神炜炜照耀暐晔。明影玓瓅踰于日月。普蔽余光暠然晃昱乃彻窈冥。如金翅王飞而行焉。一切众生莫不见者。其所经由彼众天人。皆闻诸法如梦幻化野马影响泡沫芭蕉之。要言深邃像说。各怀<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>慈心相向。一切天人但闻梦幻声。而化幻法于见无见亦不可得。诸逮闻是像微妙说者。合百千众得不退转。时所经游于其中间。有长者子其名善意。宿立德本。亦闻濡首无上幻化之要说言。并复睹见神景变化。即发无上正真道意。寻自誓愿。吾于来世得为如来无上平等最正觉道。时所现感动亦当如是。濡首见彼族姓子有决得妙岐嶷之质。欲绍佛种乃发大志心在菩萨口咏誓愿声畅一切如师子吼。即请善意而告之曰。族姓子。汝解诸法如幻化者。必离劳乘声闻缘觉之地也。便当成致无上正真道意。又当晓了诸法梦幻之妙法说悉为无所有。时长者子跪而对曰。蒙解说诸法如幻如化。濡首重以诸法要言劝发长者子。长者子忻乐之心遂而踊跃。时彼大姓心巨旷解逮致法忍。八千天人发无上正真道意。时五千天子在于虚空。闻濡首劝进之说。[火*霍]然心解逮得无从生法乐之忍。咸悉肃然恭敬之至。已礼濡首忽升虚空各还本土。是时濡首龙首菩萨。舍利弗须菩提等。还于祇树给孤独园。俱诣世尊。稽首佛足却坐一面。龙首菩萨便从坐起。向佛叉手已濡首童真诸所讲谈法要之说。具启世尊。时佛赞曰。善哉善哉。濡首童真。善说诸法无上微妙。如梦如幻如化野马影响之声。则是诸慧深奥之至。是诸佛要。斯乃应如无形无像本无幻说。时佛顾告贤者阿难。受是濡首诸法要文。阿难敬前长跪白佛。唯然世尊。如教受之。当何名此经。云何奉持。时佛重复敷演濡首妙心菩萨等所说慧要。及舍卫国长者优婆夷。为须菩提所现感动。乃至转一生补处之轮。佛复告阿难。当受是上要之慧。又是贤者。此名濡首无上清净分卫经。亦名决了诸法如幻如化三昧。勤念受持。当广宣传普布演说。又是阿难。若善男子善女人等。闻斯要专心信向。是者阿难。则应面见诸佛世尊。又为濡首童真菩萨。必所感致无上正真之道。会成至佛。况其受持诵习讽读奉行应者。德极无上。是善男子善女人等。为逮诸佛之慧藏。为得诸佛最上要镇。又为诸佛之所拥护。普为十方诸现在佛所授封莂。诸佛为手授其决。当成无上正真道慧。佛说是已。濡首童真龙首妙心及诸菩萨。舍利弗须菩提等及众比丘。一切会者诸天龙神阿须伦人与非人。闻佛所说莫不欢喜。前为佛作礼而退</p><p>佛说濡首菩萨无上清净分卫经卷下</p></div>"
}]