[{
    "title": "实相般若波罗蜜经 第240部",
    "author": "菩提流志 译",
    "html": "<div class=\"B1_text\"><p>实相<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经</p><p>唐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>流志译</p><p>如是我闻。一时婆伽婆。以善成就一切如来金刚正智之所建立。种种殊特超于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>灌顶宝冠。摩诃瑜伽<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>无碍。获深妙智证平等法。所作功业皆已究竟。随<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心悉令满足。三世平等常无动坏。三业坚固犹如金刚普光明身。住欲界他化自在天王宫殿之中。其王宫殿种种严好。皆以大宝摩尼所成。缯盖幢幡众彩交映。珠璎宝铎风动成音。一切如来常所游践。咸共叹美吉祥第一。有菩萨摩诃萨八千万人。前后围绕<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>恭敬。佛为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>初中后善。其义深远其语巧妙。纯一无杂清净<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a></p><p>其名曰金刚手菩萨。观自在菩萨。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>藏菩萨。文殊师利菩萨。转法轮菩萨。降伏一切魔菩萨。如是等菩萨摩诃萨而为上首</p><p>尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在大众中。为诸菩萨说一切法<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净实相般若波罗蜜法门。所谓爱清净位是菩萨位。见清净位是菩萨位。深着清净位是菩萨位。悦乐清净位是菩萨位。藏清净位是菩萨位。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>清净位。是菩萨位。光明清净位是菩萨位。身清净位是菩萨位。语清净位是菩萨位。意清净位是菩萨位。色清净位是菩萨位。声清净位是菩萨位。香清净位是菩萨位。味清净位是菩萨位。触清净位是菩萨位。何以故一切法自性清净故。一切法自性清净。即般若波罗蜜清净</p><p>尔时世尊说此法门已。告金刚手菩萨言。金刚手。若有人得闻此一切法自性清净实相般若波罗蜜法门。一经于耳。是人所有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>法障。极重诸罪皆自消灭。乃至菩提不生恶道。若复有人能日日中。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵思惟修习。即于现身。得一切法平等性金刚<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。余十六生。当于一切法门。而得自在游戏快乐。乃至当获诸佛如来金刚之身。尔时如来即说咒曰</p><p>唅(长呼)</p><p>尔时世尊复以一切如来普光明相。为诸菩萨说一切诸佛寂静性成正觉实相般若波罗蜜法门。所谓金刚平等成正觉。大菩提坚固性如金刚故。义平等成正觉。大菩提一义性故。法平等成正觉。大菩提自性清净故。一切平等成正觉。大菩提离一切分别故。尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人。得闻此四种寂静性成正觉实相般若波罗蜜法门。受持读诵思惟修习。应知是人即得超于一切恶道。疾证阿耨多罗三藐三菩提。尔时如来复说咒曰</p><p>唵(长呼)</p><p>尔时世尊复以一切如来能调伏难调众生释迦牟尼相。为诸菩萨。说一切法平等实相般若波罗蜜法门。所谓贪无戏论性。嗔无戏论性。痴无戏论性。何以故一切法无戏论性故。一切法无戏论性。即般若波罗蜜无戏论性</p><p>尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人。得闻此一切法平等实相般若波罗蜜法门。受持读诵思惟修习。假令其人杀害三界一切众生。终不因斯堕于恶道。何以故已受调伏心<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>故。当知是人疾得阿耨多罗三藐三菩提。尔时如来复说咒曰</p><p>憾(长呼)</p><p>尔时世尊复以一切如来自性清净相。为诸菩萨。说一切法平等性观自在智印实相般若波罗蜜法门。所谓一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>贪性清净嗔性清净。一切世间贪性清净嗔性清净故。一切世间垢性清净罪性清净。一切世间垢性清净罪性清净故。一切世间法性清净众生性清净故。一切世间法性清净众生性清净故。一切世间智性清净。一切世间智性清净。即般若波罗蜜清净</p><p>尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人得闻此一切法平等观自在智印实相般若波罗蜜法门。受持读诵<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>修习。是人虽在五欲尘中。不为贪欲诸过所染。譬如莲华虽在淤泥非泥所著。乃至疾得阿耨多罗三藐三菩提。尔时如来复说咒曰</p><p>咭利(短呼)</p><p>尔时世尊复以一切如来为三界主相。为诸菩萨。说一切诸佛灌顶出现智藏实相般若波罗蜜法门。所谓灌顶施。令一切得三界王位故。财宝施。令一切得所愿满足故。净法施。令一切得诸法实性故。饮食施。令一切身心获安乐故。尔时如来复说咒曰</p><p>怛缆(长呼)</p><p>尔时世尊复以一切如来<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>智印秘藏相。为诸菩萨。说一切诸佛金刚智印甚深处实相般若波罗蜜法门。所谓一切诸佛所摄持金刚身印。得一切如来真实体性故。一切诸佛所摄持金刚语印。得一切法门自在故。一切诸佛所摄持金刚心印。得一切三昧具足故。一切诸佛所摄持金刚智印。得最上身语心如金刚故</p><p>尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人。得闻此一切诸佛金刚智印甚深处实相般若波罗蜜法门。受持读诵正念思惟。当知是人则得成就最上金刚印。于一切智及众事业。皆得圆满。身口意性犹如金刚。乃至当成阿耨多罗三藐三菩提。尔时如来复说咒曰</p><p>阿(短呼)</p><p>尔时世尊复以一切如来永离戏论相。为诸菩萨。说文字转轮品实相般若波罗蜜法门。所谓一切诸法空。无自性故。一切诸法<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。离众相故。一切诸法无愿。离诸愿故。一切诸法自性清净。般若波罗蜜清净故。尔时如来复说咒曰</p><p>阿(乌舸反短呼)</p><p>尔时世尊复以一切如来入广大转轮相。为诸菩萨。说入广大转轮实相般若波罗蜜法门。所谓入金刚平等性。得入一切如来转轮故。入义平等性。得入一切菩萨转轮故。入法平等性得入妙法转轮故。入一切平等。性得入一切转轮故。尔时如来复说咒曰</p><p>[口*蓝](长呼)</p><p>尔时世尊复以一切如来大善巧方便相。为诸菩萨。说最第一广供养诸佛实相般若波罗蜜法门。所谓发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。即为大善巧方便广供养一切诸佛。救护众生。即为大善巧方便广供养一切诸佛。住持<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。即为大善巧方便广供养一切诸佛。尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人。得闻此最第一广供养诸佛实相般若波罗蜜法门。若自书若教人书。若自受持若教人受持。若自读诵若教人读诵。若自思惟若教人思惟。若自供养若教人供养。随其所作。即为大善巧方便广供养一切诸佛。尔时如来复说咒曰</p><p>唵(长呼)</p><p>尔时世尊复以一切如来能调伏相。为诸菩萨。说能调能摄一切众生秘密智藏实相般若波罗蜜法门。所谓一切众生平等性。是嗔平等性。一切众生调伏性。是嗔调伏性。一切众生真法性。是嗔真法性。一切众生金刚性。是嗔金刚性。何以故一切众生调伏性。即是菩提故。尔时如来复说咒曰</p><p>荷(长呼)</p><p>尔时世尊复以一切如来住平等相。为诸菩萨。说一切法最胜平等性实相般若波罗蜜法门。所谓一切法平等性故。般若波罗蜜平等性。一切法第一义性故。般若波罗蜜第一义性。一切法法性故般若波罗蜜法性一切法业用性故。般若波罗蜜业用性。尔时如来复说咒曰</p><p>颉唎(长呼)</p><p>尔时世尊复以一切如来为众生依怙相。为诸菩萨。说一切众生依怙实相般若波罗蜜法门。所谓一切众生是如来藏。普贤菩萨体性遍故。一切众生是金刚藏。金刚藏水所灌洒故。一切众生是正法藏。是正言词所说性故。一切众生是妙业藏。善巧妙业所运为故。尔时如来复说咒曰</p><p>底唎(长呼)</p><p>尔时世尊复以一切如来无量无边际究竟尽相。为诸菩萨。说一切法无量无边际究竟尽平等实相般若波罗蜜法门。所谓般若波罗蜜无量故。一切诸佛亦无量。般若波罗蜜无边故。一切诸佛亦无边。般若波罗蜜一性故。一切诸法亦一性。般若波罗蜜究竟尽故。一切诸法亦究竟尽。尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人。得闻此无量无边际究竟尽实相般若波罗蜜法门。受持读诵正念思惟。此人所有一切障累。皆得消灭究竟无余。疾至菩提。获于如来金刚之身而得自在。尔时如来复说咒曰</p><p>骠(长呼)</p><p>尔时世尊。复以一切如来离戏论秘密法性普光明相。为诸菩萨。说大安乐金刚不空无碍决定入法性无初中后最第一实相般若波罗蜜法门。所谓诸菩萨能广大承事供养故。得最上大安乐。得最上大安乐故。得诸佛无上大菩提。得诸佛无上大菩提故。能降伏一切魔军。降伏一切魔军故。得于三界皆自在。于三界皆自在故。能遍<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>一切众生。悉与究竟最上安乐。何以故颂曰</p><p>有最胜智者常在<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>中</p><p>广度诸群生而不入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a></p><p>般若波罗蜜究竟方便智</p><p>能成清净业普净于诸有</p><p>又以于贪等调伏诸世间</p><p>乃至有顶天清净无违暴</p><p>在于生死世世法不能染</p><p>如莲华妙色尘垢所不污</p><p>大欲清净人大施安乐人</p><p>于三界自在作坚固利益</p><p>尔时世尊说此法门已。复告金刚手菩萨言。金刚手若有人得闻此大安乐金刚法性实相般若波罗蜜法门。于日日中每清旦时。若听闻若诵念相续不绝。当知是人所有罪障皆自消灭。心常调畅第一安乐。于现身中。即得成就金刚不空无碍决定入法。复当成就一切如来金刚秘密坚固之身。尔时如来复说咒曰</p><p>莎诃(长呼)</p><p>尔时世尊为诸菩萨。说如上诸法门已。复告金刚手菩萨言。金刚手我此经典难可得闻。若有得闻乃至极少至于一字。应知是人过去已曾供养诸佛。于诸佛所种诸善根。何况有人具足听闻读诵之者。当知是人决定。已曾供养恭敬尊重赞叹八十亿那由他恒河沙等诸佛。若是经典所在之处。此地则为有诸佛塔。若复有人爱重此经。常随守护不离身者。是人应受一切世间恭敬供养。是人当得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智通。能知过去<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>事。不为一切天魔波旬之所扰乱。四天大王及余诸天常随卫护。一切诸佛及诸菩萨恒共摄受。十方<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>随愿<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。金刚手我今略说实相般若波罗蜜法门<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>如是。若广说者穷劫不尽。佛说此经已。金刚手等诸菩萨。天龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等。一切众会皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>信受奉行</p><p>实相般若波罗蜜经</p></div>"
}]