[{
    "title": "胜天王般若波罗蜜经 第一卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第一卷</p><p>陈优禅尼国王子月婆首那译</p><p>通达品第一</p><p>如是我闻。一时婆伽婆。在王舍大城耆阇崛山。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众四万二千人俱。皆是阿罗汉。诸漏永尽所作已办。舍诸重担逮得己利。尽诸有结心善<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。善得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>犹如大龙。唯阿难在学地须陀洹果。其名曰净命阿若憍陈如。摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>憍梵波提薄拘罗离波多毕陵伽婆蹉大智<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗摩诃目干连须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>富楼那弥多罗尼子阿尼楼陀摩诃迦栴延优波离罗睺罗如是等四万二千人俱。菩萨摩诃萨七万二千人俱。悉已通达甚深法性。调顺易化善行平等。一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>真善知识。得无碍陀罗尼。能转不退法轮已。曾<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>无量诸佛。从他佛土为法来集一生补处。护持法藏不断<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>种法王真子。绍佛转法轮。通达如来甚深境界。虽现<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>世法不染。其名曰宝相菩萨宝掌菩萨宝印菩萨宝冠菩萨宝髻菩萨宝积菩萨宝海菩萨宝焰菩萨宝幢菩萨金刚藏菩萨金藏菩萨宝藏菩萨德藏菩萨净藏菩萨。如来藏菩萨智藏菩萨日藏菩萨定藏菩萨莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>菩萨解脱月菩萨普贤菩萨<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>观月菩萨普音菩萨普眼菩萨莲华眼菩萨。广眼菩萨普行菩萨普戒菩萨智意菩萨莲花意菩萨胜意菩萨上意菩萨金刚意菩萨师子游戏菩萨师子吼菩萨大音王菩萨妙音菩萨无染菩萨月光菩萨日光菩萨智光菩萨智德菩萨贤德菩萨华德菩萨文殊师利菩萨。十六贤士跋陀婆罗菩萨为上首。贤劫菩萨<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨为上首。四天王天四王为上首。三十三天帝释为上首。夜摩诸天须夜摩王为上首。兜率陀天[月*册]兜率陀王为上首。化乐天善化王为上首。他化自在天自在王为上首。诸梵天大梵王为上首。首陀婆娑天摩醯首罗为上首。复有诸阿修罗王。娑利阿修罗王罗睺阿修罗王。如是等无量百千诸大阿修罗王复有诸龙王。阿耨大池龙王摩那斯龙王娑伽罗龙王婆修吉龙王德叉迦龙王各将眷属无量百千耆阇崛山纵广四十由旬地。及<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>靡有间隙。天龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等。一心合掌恭敬如来。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>百千大众前后围绕。供养恭敬尊重赞叹。如来面门放大光明。遍照十方无量世界。还至佛所右绕三匝从面门入。东方去此过十恒河沙佛世界。有佛国土名曰<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>普光如来应供正遍知明行足善逝世间解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊。今现在世为诸菩萨摩诃萨说一乘<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。彼佛国土尚无声闻辟支佛名。况复修其法者。诸菩萨众皆不退转阿耨多罗三藐三菩提。其土众生不因饮食但资<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。日月星光皆悉不现。唯<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>明照曜其国。无诸山陵。地平如掌。有一菩萨名曰离障。与百千菩萨至其佛所。偏袒右肩右膝着地。合掌向佛头面作礼。而白佛言。世尊。以何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>有斯光明照此国土。时普光如来告离障菩萨摩诃萨言。善男子。西方去此过十恒河沙世界。有佛国土名曰娑婆。佛号释迦牟尼如来应供正遍知明行足善逝世间解无上士调御丈夫天人师佛世尊。今欲为诸菩萨说摩诃般若波罗蜜。以是因缘放此光明。时离障菩萨白彼佛言。我今欲往<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>礼敬供养释迦如来听受正法。彼佛告言。善。男子。今正是时。尔时离障菩萨蒙佛听许。即与无量菩萨眷属来娑婆世界。至耆阇崛山顶。<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足右绕三匝退坐一面。南方去此过十恒河沙世界。有佛国土名清净华。佛名日光十号具足。菩萨名日藏。西方去此过十恒河沙世界国名宝华。佛名<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>光明十号具足。菩萨名功德藏。北方去此过十恒河沙世界国名清净。佛号自在王。菩萨名广闻。东南方去此过十恒河沙世界国名火焰。佛号<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>王。菩萨名不退转。西南方去此过十恒河沙世界。国名功德清净。佛号智炬。菩萨名大慧。西北方去此过十恒河沙世界国名悦意。佛号妙音王。菩萨名功德聚。东北方去此过十恒河沙世界。国名慧庄严佛名智上。菩萨名常喜。上方去此过十恒河沙世界国名不动。佛号金刚相。菩萨名宝幢。下方去此过十恒河沙世界。国名月光明。佛号金刚宝庄严王。菩萨名宝信。皆亦如是。尔时众中有一天王名钵婆罗。即从座起偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。世尊。我今欲问。若蒙佛许乃敢陈疑。尔时佛告胜天王言。大王。如来应供正遍知随所疑问当为解说。尔时胜天王<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃得未曾有。即白佛言。世尊。云何菩萨摩诃萨修学一法通达一切法。佛告胜天王言。大王。善哉善哉。快问谛听谛听善思念之。如王所问当分别释。善哉世尊。唯然愿闻。佛告胜天王言。大王。菩萨摩诃萨修学一法通达一切法者。所谓般若波罗蜜。菩萨摩诃萨修学般若波罗蜜。则能通达檀那波罗蜜。尸罗波罗蜜。羼提波罗蜜。毗梨耶波罗蜜。禅那波罗蜜。般若波罗蜜。优波憍舍罗波罗蜜。尼坻波罗蜜。婆罗波罗蜜。阇那波罗蜜。大王。云何菩萨摩诃萨学般若波罗蜜行檀波罗蜜。菩萨摩诃萨以清净心无所希望。为他<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不求名利但令灭苦。不见我说不见听者。无二无别<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>离故。是名菩萨摩诃萨学般若波罗蜜行法檀波罗蜜。菩萨摩诃萨学般若波罗蜜行<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>檀波罗蜜。观诸众生犹如父母兄弟亲戚令一切众咸亲附我。何以故。无始世来<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>皆为亲戚。若有众生在怖畏难。菩萨摩诃萨尚以身命而救拔之。况应加恼。不见我施无畏。不见受者。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行资生檀波罗蜜。随诸众生资养之物种种<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>令受十善。不见我施善及他受施。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行不望报檀波罗蜜。凡行施时不望<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。菩萨法尔自应布施。不见我行不见施报。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行大悲檀波罗蜜。见诸众生贫穷老疾无救济者。起大悲心而发誓愿。我得阿耨多罗三藐三菩提。为诸众生作归依处。以少善根<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>菩提为众生故亦不分别。我能救济及受救者。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行恭敬檀波罗蜜。随他所须。菩萨摩诃萨身自取物。不令彼倦敬心授与。不见我能敬不见彼受敬。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行尊重檀波罗蜜。于诸众生悉起师僧及父母想。以尊重心合掌恭敬。若无财物惠以善言。不见我能尊重他可重者。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行供养檀波罗蜜。若见寺塔则应香华灯油扫洒供养。若见尊像毁坏正法缺损则应治葺。若见众僧四事供养。不见我能供养彼可供者。无二无别自性离故。菩萨摩诃萨学般若波罗蜜行无依止檀波罗蜜。不作是念。以此布施愿得生天或求天王。愿得生人若求人王。乃至阿耨多罗三藐三菩提。亦不希取无所得故。是名菩萨摩诃萨学般若波罗蜜通达檀那波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行尸罗波罗蜜。作是思惟。佛阿含教及毗尼中。说波罗提木叉。菩萨摩诃萨应学不见戒相。及我能持不着戒。不着见不着我。菩萨摩诃萨学般若波罗蜜。作是思惟。阿耨多罗三藐三菩提不止以持戒得。应当遍学<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>行。戒性清凉寂静不生。自性离故。菩萨摩诃萨学般若波罗蜜。作是思惟。云何持戒能断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。烦恼三种贪恚愚痴。又各三品谓上中下。须知对治。贪欲重者修不净观。具足观身三十六物。嗔恚多者修慈<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>。多愚痴者修因缘观。不见能观及所观法。无二无别自性离故。菩萨摩诃萨学般若波罗蜜。复作是念。云何菩萨摩诃萨离不正思惟。菩萨摩诃萨不生是心。我行寂静行离行空。诸余<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>在喧挠中不乐空行。见不二别知自性离即灭邪念。菩萨摩诃萨学般若波罗蜜。虽知诸法离而深畏罪业。如佛所说应持净戒。修习功德乃至般若波罗蜜。少不善法不与共居。世尊所说。譬如毒药多少皆害。菩萨摩诃萨学般若波罗蜜。常生怖畏信行相应。菩萨摩诃萨于空旷处独行无侣。或有沙门婆罗门等。赍持金银琉璃真珠玛瑙虎珀珊瑚车[(王*巨)/木]白玉。以寄菩萨。不起贪着无有取心。作是思惟。世尊所说宁自割身取肉而食。于他之财不与弗取。菩萨摩诃萨学般若波罗蜜持戒坚固。若魔及魔眷属以妙色形逼试菩萨。心不动摇作是思惟。世尊所说一切诸法如梦幻化。无二无别自性离故。菩萨摩诃萨学般若波罗蜜。虽勤持戒不求生人若作人王。不求生天若作天王。身离三失。无口四过。意免三愆。如此持戒不见我能持不见戒相。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达尸罗波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行羼提波罗蜜。菩萨摩诃萨于其内心常能生忍。忧悲苦恼皆悉不随。亦学外忍。若他打骂终不生嗔。亦学法忍。如世尊说甚深实性无人无法。不生寂静即是<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。闻如此说心不惊怖。作是思惟。不学是法云何能得阿耨多罗三藐三菩提。深观三毒如是贪嗔于何处起。何因缘生何因缘灭。作是观察不见有生及可生法。不见能灭及所灭法。如是忍心相续不断。于六时中无有间隙不择境界。父母国王我则须忍。余可以威即便加恶。菩萨行忍不为报恩。名利仁义惭耻怖畏。菩萨摩诃萨法应行忍。若人加害挝打骂辱心不倾动。菩萨摩诃萨若作国王王等。有贫贱人骂詈耻辱。不示威刑云我是王法应治剪。即作是念。我于往昔诸世尊前发大誓愿。一切众生我皆济拔。令得阿耨多罗三藐三菩提。今若起嗔则违本誓。譬如良医发如是誓。世间盲[目*壹]我悉治愈。若自失明岂疗他疾。如是菩萨为除众生无明黑闇。自起嗔恚安能救彼。不见我能忍不见可忍。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达羼提波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行毗梨耶波罗蜜。未灭令灭未度令度。未脱令脱未安令安未学令学。菩萨如是行<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>时。有诸恶魔为作留难。谓菩萨言。善男子。莫修此法。空受勤苦。何以故。我往昔时曾修此法。未灭令灭未度令度。未脱令脱未安令安未学令学。空受勤苦都无实利。我从昔来多见菩萨。修学此行并皆退转。汝可回心以取声闻辟支佛乘而自灭度。菩萨摩诃萨即便觉知告言。恶魔。汝复道去我心如金刚非汝能坏。汝若作障碍自得长夜苦魔即不现。若余菩萨修五波罗蜜。未得般若波罗蜜者。菩萨摩诃萨如是精进。设百千劫亦能超过。况复声闻辟支佛乘。菩萨摩诃萨行般若波罗蜜。成就<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>众恶悉离。虽行精进不疾不迟而发大愿。使我得身与世尊等。眉间白毫顶上肉髻。佛转法轮我亦如是。譬如真金众宝莹饰则为严净。菩萨精进亦复如是远离垢秽。所谓懒惰<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>疲极。不<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>知不正思惟。离此垢秽即获清净<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>功德而共庄严。身不疲劳心无厌怠。障道恶法一切不善皆悉灭除。其有助道向涅槃法悉令增长。少恶不起何况其多。假使十方恒沙世界满中大火如阿鼻狱。此世界外有一众生可度脱者。菩萨摩诃萨能从中过况多众生。可作是念。无上菩提不易可得。菩萨<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>如救头燃。百千万劫如此重担难可荷负。作是思惟。过现诸佛皆修此行。成阿耨多罗三藐三菩提。我亦如是正应修习。宁百千劫处<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中使众生度。终不弃舍速取涅槃。如是精进心不自高于他不下。不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达毗梨耶波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行禅波罗蜜深种善根。于大乘中世世生生多习妙行近善知识不生贫贱。常在婆罗门刹利大姓。正信三宝增长善法。因宿善根作如是念。众生长夜流转六道。苦轮不息皆由贪爱。菩萨摩诃萨起厌离心。知从虚妄分别而有。修多罗中方便种种说欲过患。如槊如[矛*重]如刀如蛇如泡。臭秽不净<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。云何智人贪着此法。即剃须发<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。未见令见未得令得未证令证。闻说<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>若世谛第一义谛。如实修行<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>观察。所谓<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>正分别正精进正语正业正命<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>正定。远离喧杂不求名闻。供养恭敬身心精进常无休息。思惟此心多行何境。若善若恶无记境界。若<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>境则勤精进增长善根。三十七品以治诸恶不善之法。恶不善者贪恚愚痴。贪欲三品谓上中下。其上品者若闻。欲名遍身战动。心踊欢悦不观欲过厌离不生。无惭无愧。何谓无惭。经游独行恒思欲境心心相续。唯见妙好不知过患。若其父母及余尊长呵彼所欲。于所尊前不觉起诤是名无惭。此人命终当生恶趣。中品欲者。若离境界不恒生心。下品欲者。但共言笑欲情即歇。嗔亦三品。上品嗔者愤恚若<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>惛目乱。或造五逆若谤正法。及大重罪五逆之恶。于百分中不及其一中品嗔者。以嗔恚故而造诸恶即生悔心。下品嗔者。心无嫌恨。但口呵毁随生悔过。痴亦如是。虽作是观。知一切法如幻梦响乾闼婆城。虚妄不实颠倒故见。灭外境界内心寂静。不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达禅波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行般若波罗蜜。正智观色受想行识。不见色生不见色集。不见色灭。受想行识亦复如是。何以故。自性皆空无有真实但虚名字。而行般若波罗蜜。化诸众生终不为说无业果报。一切诸法如梦如幻。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无人无众生无寿者无养育。而说有业果报。菩萨摩诃萨如是修行般若波罗蜜。恶魔不能得便。何以故。近善知识成助菩提离世间法。于诸如来甚深正法欢喜赞叹。若天若魔沙门婆罗门。除佛正智无及菩萨。不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达般若波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行优波憍舍罗波罗蜜。菩萨摩诃萨善巧回向阿耨多罗三藐三菩提。若见华果日夜六时供养诸佛及菩萨众。以此善根回向菩提华树果树亦复如是。若闻如来修多罗中说甚深义。信乐受持为众生说以此善根回向菩提。若见如来塔庙形像香华供养。令诸众生离<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>香获得如来清净戒香。扫洒涂地令诸众生威仪齐整华盖覆罩。令诸众生皆离恼热。入僧伽蓝愿诸众生。悉入涅槃。若出伽蓝愿诸众生出魔境界。开伽蓝门作如是愿。以出世智为诸众生启未开门。若见关闭。愿为众生关闭恶趣及以三有。坐时念言。愿诸众生坐菩提座。若右胁卧愿诸众生皆得涅槃。起时念言。愿诸众生起离诸惑。若洗脚足愿诸众生远离尘垢。礼佛旋塔愿诸众生成天人师。若有外道邪见难化。即自念言。我为彼师必不肯信。且作同学或为<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。虽处彼众戒行多闻胜诸外道。因尔降伏尊重为师言必信受。毁其邪法为说涅槃。令入正教精修梵行。禅定<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>得诸<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。见多欲者化为女人第一端正。令彼爱着倐忽之顷示现无常。色变膖胀烂坏臭处。使其增恶起厌离心。即复本形为菩萨像而为说法。令发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>成无上果。见大乘人离善知识。学二乘道不得其果唐失大乘。观彼根性即为说法入无上道。未发心者化令发心。已发心者教使坚固。见持戒人犯少轻罪。不解<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>懈退忧愁不复修道。即为说法对治忏除令道胜进。菩萨摩诃萨少欲知足唯求法利。为众生说供养。如来。成就<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>说法供养。是为檀波罗蜜行不违言。是尸波罗蜜若天若魔不能坏乱。是羼提波罗蜜心心相续不觉疲倦。是毗梨耶波罗蜜专心一念不缘异境。是禅波罗蜜说法供养不见我我所。是般若波罗蜜不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达方便波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行尼坻波罗蜜。菩萨发愿不为有乐出离<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>求二乘道。作大愿言。一切众生众生所摄皆入涅槃。然后我身乃成正觉。未发心者即令发心。已发心者令其修行。已修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>令得菩提。得菩提者请转法轮。乃至分身舍利起塔供养。复作愿言。若有世界诸佛成道悉无天魔。愿自智慧发无上心不由外缘。又愿我身常在世间。一切众生悉令成就。愿新发意诸菩萨等。若闻如来说甚深法心不惊怖。无边佛道。无边佛境。无边大悲。愿诸众生皆悉通达。又愿我身常生秽国不生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。何以故。譬如病人乃须医药无疾不须。不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达愿波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行婆罗波罗蜜。菩萨摩诃萨能伏天魔摧诸外道。具足功德智慧力故。一切佛法无不修行无不证见。以神通力用一毛发。能举阎浮提乃至四天下三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。乃至无量百千世界。能于空中取种种宝施诸众生。十方无量无边世界诸佛说法无不闻持。不见我能行及所行法。无二无别自性离故。是名菩萨摩诃萨学般若波罗蜜通达力波罗蜜。大王。菩萨摩诃萨学般若波罗蜜行阇那波罗蜜。菩萨摩诃萨观<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。生不见实生灭非实灭。作是思惟。此五阴空无我无人无众生无寿者无养育。凡夫众生虚妄着我。五阴非我阴中无我。我非五阴我中无阴。凡夫愚惑不如实知流转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>如旋火轮。一切诸法自性本空无生无灭。缘合谓生缘散为灭。自性非无是故不生。自性非有是故无灭。菩萨摩诃萨一切境界无有一法不通达者。修行如是智波罗蜜。二乘外道不能掩蔽。以智观察从初发心至入涅槃皆悉明了。能以一法知一切境。一切境界即是一法。何以故。如如一故。不见我能修及所修法。无二无别自性离故。是名菩萨摩诃萨行般若波罗蜜通达智波罗蜜</p><p>胜天王般若波罗蜜经显相品第二</p><p>尔时胜天王。即从座起偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。世尊。是般若波罗蜜甚深。何者是般若波罗蜜相。佛告胜天王言。如地水火风相。般若波罗蜜相亦复如是。世尊云何地相。佛言。普遍广大难可度量是为地相。般若波罗蜜相亦复如是。何以故。如如普遍广大难思量故。大王。一切药草皆依地生。一切善法皆依般若波罗蜜生。又如土地增之不喜减之不嗔。离我我所无二相故。般若波罗蜜亦复如是。赞叹不增毁皆不减。离我我所无二相故。世间行来举足下足悉依于地。若求善道趣向涅槃。应当依是般若波罗蜜。又如大地出种种宝。般若波罗蜜亦复如是。生出世间种种功德。又如大地虫蚁蚊虻种种诸苦不能倾动。般若波罗蜜亦复如是。离我我所不可倾动。又如大地若闻师子龙象之声终无惊怖。般若波罗蜜亦复如是。天魔外道不能恐惧。何以故。不见有人不见有法自性空故。又如水大从高赴下。一切善法皆向般若波罗蜜。又如水大能润草木得生华果。般若波罗蜜亦复如是。润诸三昧生助道法。成一切智树得佛法果利益众生。又如水大渍草木根。能使倾拔随流而去。般若波罗蜜亦复如是。一切诸见烦恼习气。根本悉灭永不复生。又如水大性本清净无垢不浊。般若波罗蜜亦复如是。体无烦恼故名清净。离诸惑故名为无垢。一相非异故名不浊。如人夏热遇水清凉。热恼众生闻般若波罗蜜亦即清凉。如人患渴得水乃止。求出世法得般若波罗蜜思愿亦止。又如水泉甚深难入。般若波罗蜜亦复如是。诸佛境界甚深难入。又如坑坎之处水悉平等。般若波罗蜜亦复如是。一切声闻辟支佛及诸凡夫皆悉平等。又如水能洗地悉得清净。菩萨摩诃萨通达般若波罗蜜。离诸烦恼即得清净。何以故。自性清净离诸惑故。又如火大能烧一切树木药草。不作是念我能烧物。般若波罗蜜亦复如是。能灭一切烦恼习气。亦不作念我能除灭。又譬如火悉能成熟一切诸物。般若波罗蜜亦能成就一切佛法。又譬如火悉能干竭一切湿物。般若波罗蜜亦复如是。竭诸漏流永不复起。假使火聚在雪山顶。若一由旬至十由旬皆悉能照。而无是念我能照远。般若波罗蜜亦复如是。皆悉能照声闻缘觉及以菩萨。亦不作念我能照彼。又如禽兽夜见火光恐怖远避。薄福凡夫及以二乘。若闻般若波罗蜜恐惧舍离。般若波罗蜜闻名尚难况复修学。如夜远行迷失道路。若见火光即生欢喜。知有聚落疾往投趣。至则安隐永无怖畏。生死旷野有福德人。若闻般若波罗蜜。生大欢喜归趣受持。永离烦恼心得安乐。如世间火贵贱共同。般若波罗蜜亦复如是凡圣等有。又如婆罗门刹利咸供养火。诸佛菩萨咸皆供养般若波罗蜜。又如小火能烧三千大千世界。般若波罗蜜亦复如是。若闻一句则能焚烧无量烦恼。大王。般若波罗蜜离垢无著寂静无边。无边智慧等达法性。犹如虚空性无所住。离相境界过诸觉观。心心数法无有分别。无生无灭自性离故。大王。菩萨摩诃萨行般若波罗蜜。世间希有利益众生。犹如日月一切受用。又譬如月能除热恼。般若波罗蜜亦复如是。能除一切烦恼热毒。又譬如月世间乐见。般若波罗蜜亦复如是。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之所乐见。又如初月日日增长。菩萨摩诃萨亲近般若波罗蜜。从初发心乃至菩提渐次增长。如黑分月日日渐尽。菩萨摩诃萨修行般若波罗蜜。烦恼结使次第灭尽。如世间月婆罗门刹利咸所赞叹。若善男子善女人亲近般若波罗蜜。一切世间天人阿修罗皆所赞叹。如月游行遍四天下。般若波罗蜜亦复如是。若色若心无处不遍。如世间月常自庄严。般若波罗蜜亦复如是性自庄严。何以故。不生不灭性本清净。遍一切法自性离故。如世间日破一切暗。而不作念我能破暗。般若波罗蜜亦复如是。能破无始一切烦恼。亦不作念我破烦恼。又譬如日开敷莲华。而不作念我开莲花。般若波罗蜜亦复如是。能开菩萨亦无是念。又譬如日遍照十方。不作是念我能遍照。般若波罗蜜亦复如是。能照无边而无照相。又如见东方赤则知日出不久。若闻般若波罗蜜。当知去佛不远。如阎浮提人若见日出生大欢喜。若世间中有般若波罗蜜名字。一切圣人皆大欢喜。又如日出月及星宿光悉不现。菩萨摩诃萨行般若波罗蜜。二乘外<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>亦不现。又如日出方见坑坎高下之处。菩萨摩诃萨行般若波罗蜜。世间乃知邪正之道。何以故。般若波罗蜜自相平等不生不灭性是离故。大王。菩萨摩诃萨行般若波罗蜜。多修空行无所住着修道离障。远恶知识亲近诸佛。心心相续<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>不断。通达平等随顺法界。神通游戏十方国土。于其本处都不动摇。见诸佛法犹如现前。虽处世间世法不染。犹如莲花生在淤泥菩萨摩诃萨虽处生死以般若波罗蜜方便力故而不染着。何以故。般若波罗蜜不生不灭自相平等。不见不着性是离故。又如莲华不停水滴。菩萨摩诃萨行般若波罗蜜。一不善法不得暂住。又如莲华所在悉香。菩萨摩诃萨行般若波罗蜜若在城邑聚落。人间天上悉具戒香。又如莲华体性清净。婆罗门刹利长者<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>之所爱重。菩萨摩诃萨行般若波罗蜜。天龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等菩萨诸佛咸所爱敬。又如莲华始欲敷启能悦众心。菩萨摩诃萨行般若波罗蜜。面门常笑曾无嚬蹙能悦众生。又如世人梦见莲花亦是吉相。一切人天乃至梦中。闻见菩萨行般若波罗蜜。亦是吉祥况当真见。又如莲华初始生时。若人非人之所爱护。菩萨摩诃萨始学般若波罗蜜。诸佛菩萨释梵诸天之所卫护。菩萨摩诃萨行般若波罗蜜。兴如是心如理通达诸波罗蜜。满足佛法<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生坐菩提树。成就阿耨多罗三藐三菩提转正法轮。世间沙门婆罗门。天魔释梵所不能转。化度十方无边世界一切众生。平等济拔于生死海。皆悉安置般若波罗蜜中。无归无依无救护者为作救护。欲见佛者即为示之作师子吼。神通游戏叹佛功德令众渴仰。其心清净而不转移。意无谄曲远离邪念。所谓不念声闻辟支佛法。尽诸垢秽无复烦恼。身无伪行离邪威仪。口无巧言如实而说。受恩常感轻恩重报。心不怀憾口恒软语。如是修习清净之心。不见能污不见可染。无二无别自性离故。大王。菩萨摩诃萨行般若波罗蜜。能信如来三种清净。作是思惟。修多罗说如来法身。寂静身。无等等身。无量身。不共身。金刚身。于此决定心无疑惑。是名能信如来身净。复次思惟。修多罗说如来口净如为凡夫受作佛记。亦为菩萨授记<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。信如是言不相违背。何以故。如来永离一切过失无诸垢秽。无有烦恼寂静清净。若天若魔沙门婆罗门若梵。能得如来口业失者无有是处。是名能信如来口净。复次修多罗说如来意净。诸佛世尊心所思事。若声闻辟支佛菩萨一切天人无能知者。何以故。如来之心甚深难入。非诸觉观离思量境。无有边量同虚空界。如是信知心不疑惑。是名能信如来意净。复次菩萨摩诃萨行般若波罗蜜。作是思惟。如佛所说菩萨摩诃萨为诸众生不怖不疲。荷负重担其心坚固曾无退转。次第修习诸波罗蜜。成就佛法无有障碍。无边无等不共之法。所言决定其性勇猛。成就如来广大之事。菩萨摩诃萨于是事中。不疑不惑深心信受。菩萨摩诃萨行般若波罗蜜作是思惟。菩萨摩诃萨行般若波罗蜜。坐道场时能得无碍清净天眼天耳他心智<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智漏尽智。于一念中通达三世平等智。如实观察一切世间。如是众生具身恶行口恶行意恶行。毁谤圣人邪见造邪业。身坏命终当堕恶道。如是众生具身善行口善行意善行。不谤圣人正见正业。身坏命终当生善道。如实观察众生界已作如是念。我昔发愿行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。自觉觉他此愿应满。菩萨摩诃萨行般若波罗蜜。于如是事不疑不惑如实信受。大王。菩萨成佛所名为觉处。自觉名正觉。成就众生名正遍觉。大王。如是菩萨摩诃萨行般若波罗蜜。信知如来出兴于世。大王。菩萨摩诃萨行般若波罗蜜。闻说一乘即便信受。何以故。诸佛所说真实不虚。种种余乘皆佛乘出。如阎浮提种种城邑聚落。别名并属此洲。如是诸乘种种名说皆属佛乘。复作是念。如来世尊善巧方便。种种说法皆实不虚。何以故。世尊说法随众根性。是故分别说有三乘其实一道。菩萨摩诃萨行般若波罗蜜复作是念。如来说法深远音声真实不虚。何以故。释梵天等以少功德。尚复能有深远音声。何况如来无量亿劫积习功德。菩萨摩诃萨行般若波罗蜜作如是念。如来说法不违众根。若上中下皆使成就。众生各谓独为我说。诸佛本来无说无示。菩萨摩诃萨于如此事不疑信解。大王。菩萨摩诃萨行般若波罗蜜。得心微细作是思惟。世间炽然大火之聚。所谓贪欲火。嗔恚烟。愚痴暗。云何当令一切众生皆得出离。若能通达诸法平等名为出离。如实知法犹如幻相。善观因缘而不分别。菩萨摩诃萨行般若波罗蜜作是思惟。诸法无本而有业报。诸佛菩萨凡所发言我知其意。既知意已即思量义。思量义已即见真实。见真实已济度众生。大王。菩萨摩诃萨行般若波罗蜜。善巧方便为众说法。所谓一切诸法皆悉无我。无众生。无养育。无人。无作者。无觉者。无生者。无见者。空无所有非自在性虚妄分别因和合生。大王。若说诸法皆悉无我乃至无见者。为称理说空无所有。乃至生缘亦复如是。大王。夫其说法随顺<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>是名称理。不违法相与法相应得入平等。显现义理名巧说法。大王。菩萨摩诃萨行般若波罗蜜得无碍辩才。所谓无著辩才。无尽辩才。相续辩才。不断辩才。不怯弱辩才。不惊怖辩才。不共辩才。天人所重辩才。无边辩才。菩萨摩诃萨行般若波罗蜜得清净辩才。所谓不嘶喝辩才。不迷乱辩才。不怖畏辩才。不高慢辩才。义具足辩才。味具足辩才。不拙涩辩才。应时节辩才。大王。菩萨摩诃萨行般若波罗蜜。离大众威德畏故不嘶喝。坚住不怯智故不迷乱。菩萨处众如师子王故无怖畏。离诸烦恼故不高慢。不说无义通达法相故义具足。善解书论文字世智故味具足。<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来习巧便语故不拙涩。如是说法随顺四时。春如春说秋冬亦尔。应前说者不中后说。应后说者不前中说。应中说者不前后说。善知时故。大王。菩萨摩诃萨行般若波罗蜜。所得辩才令众欢喜。所谓爱语面门常笑不曾嚬蹙。发辞有义。能称如实所说决定不欺侮人。种种乐说以柔软言令众欢喜。颜色宽和使他亲附。随义而说闻者悟解。称法相说为利益故。平等为说心无偏党。作决定说无虚妄言。种种乐说随众根性令得欢喜。大王。菩萨摩诃萨行般若波罗蜜成大威德。何以故。非器不闻故。尔时胜天王即白佛言。世尊。菩萨摩诃萨行般若波罗蜜其心平等。云何不为非器者说。佛告胜天王言。大王。般若波罗蜜性自平等。不见器不见非器。不见能说及以所说。众生虚妄见说不说。何以故。般若波罗蜜不生不灭<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>分别。犹如虚空一切遍满。众生亦尔不生不灭。声闻辟支佛菩萨及佛亦复如是。无名字法假立名字。云是众生云是般若。云有能说云有所说云有听者。第一义中同是一相。所谓无相。菩萨摩诃萨行是甚深般若波罗蜜。威德重故非器不闻。大王。般若波罗蜜不为非器众生说。不为外道说。不为不尊重者说。不为不正信者说。不为求法贸易者说。不为贪利养者说。不为嫉妒者说。不为盲聋痖者说。何以故。菩萨摩诃萨行般若波罗蜜时。心无悭吝不秘深法。非于众生无大慈悲不舍众生。众生宿世善根。得见如来及闻正法。诸佛如来本无说心为此为彼。但障重者虽复在近而不见闻。尔时胜天王白佛言。世尊。何等众生堪闻诸佛菩萨说法。佛告胜天王言。大王。具正信者诸佛菩萨即为说法。根性纯熟堪为<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。于过去佛曾种善根。心无谄曲威仪齐整。不求名利亲近善友。利根性人说文知义。为法精进不违佛旨。大王。诸佛菩萨为如是等众生说法大王。菩萨摩诃萨行般若波罗蜜。能作法师善巧说法。云何巧说说法。为利益佛法而说佛法竟不可见。虽说波罗蜜而波罗蜜竟不可得。虽说菩提而说菩提竟不可得。虽断烦恼而说烦恼竟不可得。虽为涅槃而说涅槃竟不可得。虽为须陀洹向须陀洹果乃至阿罗汉向阿罗汉果。而四果向竟不可得。虽为辟支<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。而辟支佛果竟不可得。断除我见而说我见竟不可得。说有业报而说业报竟不可得。何以故。名字所得非是实法。法非名字非言境界。法非可议非心所量。名字非法法非名字。但以世谛虚妄假名有说。无名字法说为名字。名字是空空无所有。无所有者非第一义。非第一义即是虚妄凡夫之法。大王。是名菩萨摩诃萨善巧说法。菩萨摩诃萨行般若波罗蜜。以方便力得无碍辩才。随众生根性说是甚深般若波罗蜜</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第二卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第二卷</p><p>陈优禅尼国王子月婆首那译</p><p>法界品第三</p><p>尔时胜天王即从座起。偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。云何菩萨摩诃萨学般若波罗蜜通达甚深法界。尔时佛赞胜天王言。善哉大王。谛听谛听。善思念之。胜天王白佛言。世尊。唯然愿闻。佛告胜天王言。大王。菩萨摩诃萨有般若故近善知识勤修<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。离诸障惑心得清净恭敬尊重。乐习空行远离诸见。修如实道能达法界。大王。菩萨摩诃萨有般若故近善知识。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>恭敬犹如佛想。以亲近故不得<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。灭一切恶诸不善法生长善根。既灭<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>远离障法。即得身口意业清净。由清净故即生敬重。以敬重心修习空行。修空行故远离诸见。离诸见故<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>正道。修正道故能见法界。胜天王白佛。世尊。何等为法界。佛告胜天王言。大王。即是如实。世尊。云何如实。大王。即不变异。世尊。云何不异。大王。所谓如如。世尊。云何如如。大王。此可智知非言能说。何以故。过诸文字离语境界口境界故。无诸戏论无此无彼。离相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>远离思量。过觉观境无想无相。过二境界过诸凡夫。离凡境界过诸魔事。能离障惑非识所知。住无处所寂静圣智。后无分别<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>境界。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>我所求不可得。无取无舍无染无秽清净离垢。最胜第一性常不变。若佛出世及不出世性相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。大王。是为法界。菩萨摩诃萨行般若波罗蜜。修此法界百种苦行。令诸<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>皆悉通达。大王。是名般若波罗蜜如如实际。无分别相不可思议界真空。一切智一切种智不二界。尔时胜天王白佛言。世尊。云何能证至此法界。佛告胜天王言。大王。以出世般若波罗蜜证后无分别智至。胜天王白佛言。世尊。证与至有何差别。佛告胜天王言。大王。以般若波罗蜜如实见名为证。以智通达名为至。胜天王白佛言。世尊。如佛所说<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>慧通达般若波罗蜜。非是出世后无分别智。佛告胜天王言。不尔大王。何以故。般若波罗蜜甚深微妙闻慧粗浅不能得见第一义故思不能量。出世法故修不能行。大王。般若波罗蜜如是甚深。凡夫二乘所不能见。何以故。譬如生盲不见众色。七日婴儿不见日轮。尚不能见况复修行。大王。譬如夏热有人西行在于旷野。复有一人从西往东。问前人言。我今热渴何处有水清凉树荫。彼人答言。善男子。从此东行则有二路。一左一右当从右路。有清泉水及树荫凉。大王。于意云何。虽闻此名思惟往趣。能除热渴得水味不。不也世尊。此人至彼入池洗浴饮水息树。方离热渴得知水味。佛言。如是如是。大王。不可以三慧通达真实般若波罗蜜。大王。所言旷野即是<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>人谓众生。热名烦恼渴是贪爱。东来人者即是菩萨。其右路者萨婆若道。菩萨摩诃萨行般若波罗蜜。善知生死及出世路。清冷水者所谓般若波罗蜜。树荫凉者即是大悲。菩萨摩诃萨行二法故。远离凡夫及二乘道。大王。如是甚深般若波罗蜜无形无相。种种巧说令诸众生得入其中。大王。菩萨摩诃萨行般若波罗蜜。如实知力空。<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>空。不共法空。戒聚空。定聚慧聚<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>聚解脱知见聚空。空空。第一义空。而空相不可得。不取空相不起<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>。不执空相不依止空。如是不取着故于空不堕。大王。菩萨摩诃萨行般若波罗蜜远离诸相。不见内外相。离戏论相。离分别相。离求觅相。离贪着相。离境界相。离攀缘相。离能知所知相。胜天王白佛言。世尊。菩萨摩诃萨般若波罗蜜如是观无相。诸佛世尊。复云何观。佛告胜天王言。大王。诸佛境界不可思议。何以故。离境界故。一切众生思量佛境。心则狂乱不知此彼。何以故。同<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>性不可思量求不可得离觉观境。菩萨摩诃萨行般若波罗蜜。尚不见有凡夫境界可得思量。况佛境界亦不依止一切诸愿。虽行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>不着施报持戒忍辱精进定慧亦复如是一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>乃至<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>亦不依着。何以故。离我我所无二无别<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>离故。说是般若波罗蜜法门时。三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>六种震动。须弥山王。目真邻陀山。铁围山。大铁围山。宝山。黑山。大黑山。皆悉震动。无量百千亿诸菩萨摩诃萨脱上分衣为佛敷座高如须弥。无量百千释梵护世诸天王等。合掌恭敬散诸妙华曼陀罗华摩诃曼陀罗华。曼殊沙华摩诃曼殊沙华。白莲华赤莲华。红莲华青莲华。耆阇崛山纵广四十由旬。积华遍满至于佛膝。无量天子作诸天乐不鼓自鸣。空中叹言。再睹佛兴世再见转法轮。善哉阎浮提一切众生。勤修功德多种善根。得闻如是甚深般若波罗蜜。况复来世有能信者。如是众生悉行诸佛如来境界。复有无量百千诸大龙王。即以神力普兴大云。降注香雨洒耆阇崛山及三千大千世界。诸听法者唯觉香润不见沾濡。无量龙女悉于佛前合掌赞叹。无量乾闼婆以妙音乐而<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛。其夜叉众散诸妙华。十方无量无边国土诸佛世尊。皆放眉间白毫。光明。照此<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>耆阇崛山。其三千大千世界幽暗之处。日月不照悉蒙光明。照世界已还至佛所。右绕三匝从佛顶入。无量百千<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>刹利<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>长者。以涂香末香幡华幢盖而供养佛。尔时众中七十二亿菩萨摩诃萨得无生法忍。无量百千万亿众生得远尘垢<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。无量百千万亿众生发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。尔时胜天王白佛言。世尊。般若波罗蜜离文字无语言。云何菩萨摩诃萨行般若波罗蜜为众生<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜。如是说法为修习<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>故。而说佛法毕竟不可得。为成熟诸波罗蜜。而波罗蜜毕竟不可得。为清净<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>而菩提毕竟不可得。为涅槃离欲灭而涅槃离欲灭毕竟不可得。为须陀洹斯陀含阿那含阿罗汉果。而须陀洹乃至阿罗汉毕竟不可得。为辟支佛而辟支佛毕竟不可得。为断除我取而我及取毕竟不可得。菩萨摩诃萨如是行甚深般若波罗蜜。心不分别一切诸相。我能分别及所分别悉不可得。随顺般若波罗蜜不违生死。虽在生死不逆般若波罗蜜随顺<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。胜天王白佛言。世尊菩萨摩诃萨云何随顺法相不违世谛。佛告胜天王言。大王。菩萨摩诃萨随顺甚深般若波罗蜜。不远离色受想行识。不远离欲界<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。不远离法。而不着般若波罗蜜。不远离道。何以故。具巧方便故。胜天王白佛言。世尊。何者是菩萨摩诃萨善巧方便。佛告胜天王言。大王。所谓无量菩萨摩诃萨具慈悲喜舍不舍众生常能利益。大王。菩萨摩诃萨行般若波罗蜜具无边慈。无分别慈。法慈。不息慈。不恼慈。利益慈。平等慈。遍益慈。出世慈。成就如是等大慈。世尊。云何大悲。佛言。大王。菩萨摩诃萨行般若波罗蜜。众生苦恼无归依处。即为济拔发菩提心勤求<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。既自得已为众生说其悭贪者教行布施。无戒<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>教令持戒。恶性之人教行忍辱。懒惰懈怠教令精进。散乱之人教行<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。愚痴之人教行般若。为度众生虽遭苦恼。终不舍离菩提之心。是名大悲。世尊。云何大喜。佛言。大王菩萨摩诃萨行般若波罗蜜作是思惟。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>炽然我已出离故生欢喜。久相系着生死之绳。我已割断故生欢喜。种种觉观及诸取相。于生死海我已得出故生欢喜。无始竖立我慢之幢。我今已摧故生欢喜。以金刚智坏烦恼山永不复立故生欢喜。我自安隐又令他安。愚痴黑暗贪爱系缚久寐<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。今始得觉故生欢喜。我今已离一切恶趣。又拔众生令出恶道。众生久于生死迷乱不知出道。我今济拔开示正路。悉令得至萨婆若城故生欢喜。是名大喜。大王。菩萨摩诃萨行般若波罗蜜。眼所见色不着不离而起舍心。耳声鼻香舌味身触意法亦尔。大王。菩萨摩诃萨行般若波罗蜜成就如是四无量心。尔时胜天王白佛言。世尊。云何菩萨摩诃萨行般若波罗蜜为度众生示现诸相。佛告胜天王言大王。般若波罗蜜相不可得。菩萨摩诃萨相亦不可得。但方便力<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。示现处胎乃至涅槃。何以故。诸天计常谓无堕落。菩萨摩诃萨行般若波罗蜜。以方便力破此执故示现处胎。因令彼天起<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>念。世间最胜最高无等不着五欲。欲不能污尚有堕落。况复余天。是故咸应勿复放逸。勤加精进一心<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。譬如见日尚有隐没。则知萤火不得久住。大王。复有放逸诸天贪着乐故不修正法。虽与菩萨同在天宫。不往<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>不咨受法。而作是意。今且游戏朋诣菩萨。各相谓言菩萨与我常共在此修行何晚。菩萨摩诃萨行般若波罗蜜。勤修精进如救头然。破彼放逸示现堕落。如是示现有二<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。一令诸天离放逸故。二令众生咸得见故。大王。世间复有下劣众生。不堪见佛成无上道及转法轮。菩萨摩诃萨为此众生。是故示现婴儿童子后宫游戏。菩萨若作余像说法。后宫女人则不信乐。是故示现婴儿童子。大王。有高<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>常能离俗。菩萨摩诃萨。为化彼故示现<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。大王。复有<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>作如是念。若以端坐受人天乐而得圣道。菩萨摩诃萨。为化此故示现苦行。亦为降伏诸外道故示现苦行。大王。复有天人长夜发愿。菩萨摩诃萨行诣道场。我等诸天常献供养。菩萨为化此众生故示诣道场。一切人众皆悉获得菩提因缘。大王。复有天人作如是念。恶魔外道障碍正法。愿得菩萨坐于道场。降伏恶魔及诸外道。正信之人悉令见法。菩萨摩诃萨既成道已。三千大千世界于虚空中。种种音声而赞叹曰。佛日出世萤火隐没。此等天人悉发是言。愿我来世皆得阿耨多罗三藐三菩提。如今菩萨摩诃萨。为是众生现坐道场。大王。又有天人作如是言。愿见大师成就一切智无师智自然智。不求出离根性纯熟是深<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。为是众生示现三转十二种法轮。大王。复有天人乐闻涅槃。菩萨为化彼众生故示现涅槃。大王。菩萨摩诃萨修行般若波罗蜜。能现如是种种之相。大王。菩萨摩诃萨行般若波罗蜜不生难处。何以故。无福德人不闻般若波罗蜜名字故。又复常离一切恶业。佛所说戒悉不毁犯心无嫉妒。已于过去无数佛所。多种善根具足功德。智慧方便成就大愿。心乐寂静勤行精进。大王。菩萨摩诃萨。无有恶业牵堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。性行十善故。菩萨摩诃萨。无有破戒牵堕畜生。性持戒故。菩萨摩诃萨。无有嫉妒不牵堕饿鬼。不生邪见家常值善知识。何以故。已于过去无数佛所深种善根。是故生处皆悉<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。菩萨受生诸根不缺<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>法器。何以故。于过去世供养诸佛听闻正法礼敬大众。是故根具相貌端圆成佛法器。大王。菩萨不生边地。钝根愚痴不知<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。语言义趣非佛法器。不识<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>婆罗门。何以故。菩萨受生必在中国。利根智慧言辞辩了。善知语义。是佛法器。善知沙门及婆罗门。何以故。菩萨摩诃萨。宿世智慧力故。大王。菩萨不生长寿天。不见诸佛不利众生故。菩萨所以生在欲界。示现出世利益众生。何以故。善方便故。大王。菩萨不生空世界中。此处无佛不闻正法不供养僧。何以故。菩萨生处必具<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>宿愿强故。菩萨若闻恶世界名即生厌离。修行寂静心不懈怠。以一切善灭诸恶法。大王。菩萨摩诃萨修行般若波罗蜜。以是因缘不生难处。大王。菩萨摩诃萨行般若波罗蜜乃至梦中尚不忘失菩提之心。况复觉时何以故。一切菩萨生于此心即是阿耨多罗三藐三菩提心。若无此心则无有佛。无佛无法无法无僧。由此心故得有三宝及以天人。菩萨摩诃萨常离谄曲质直柔和。其心清净不疑佛法。欲听受者不秘深义。离法嫉妒远三涂业。于初中后无有异相。行不违言护持大乘。见同学者则生恭敬。劝他修习赞叹大乘。于说法师常生佛想。近善知识远离恶友。大王。菩萨摩诃萨。修般若波罗蜜。如是成就菩提之心。因由此心得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智。何以故。已曾供养无量诸佛。护持正法修清净戒。远离恶<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>碍永无。心常欢喜心勤修学。心不散乱心智不失。何以故。大王。若菩萨摩诃萨。已曾供养无量诸佛则尊重正法。由重法故广为人说。为护正法不惜身命。身口意业三种清净。业清净已得离障碍。离障碍故心常欢喜。心欢喜故则勤精进。心性正直念智具足。由念智故知过去生。一十百千乃至无数。大王。菩萨摩诃萨行般若波罗蜜。如是了知过去生处既了宿命。近善知识由善知识。于诸佛所不失三事。谓见闻念常听正法。供养僧宝无空过时。诸佛菩萨所恒恭敬礼拜尊重。行住坐卧不离多闻。大王。持净戒者耳根常闻般若波罗蜜名字。恒勤修习助道之法。曾不远离三解脱门。修四无量。常闻萨婆若名。大王。菩萨摩诃萨行般若波罗蜜。以是因缘近善知识。大王。菩萨摩诃萨行般若波罗蜜。乃至梦中不近恶友。何况觉时。何以故。菩萨摩诃萨。不与破戒人共住。邪见人。无威仪人。邪命人无义语人。懒惰人。乐住生死人。背菩提人。乐俗务人。不与共住。大王。菩萨摩诃萨行如是法离恶知识。大王。菩萨摩诃萨行般若波罗蜜。能得如来清净之身。所谓平等身。清净身。无尽身。善修得身。法身。不可觉知身。不思议身。寂静身。虚空等身。智身。胜天王白佛言。世尊。菩萨摩诃萨在何位中。能得如来十种之身。佛告胜天王言。菩萨初地得平等身。何以故。离诸邪曲通达法性见平等故。于第二地得清净身。何以故。清净戒故。住第三地得无尽身。何以故。离嗔恚故。第四地中得善修身。何以故。常勤精进修佛法故。住第五地则得法身。何以故。见诸谛理故。住第六地得离觉观身。何以故。观因缘理非觉观所知故。住第七地得不思议身。何以故。具足方便故。于第八地得寂静身。何以故。离一切戏论无烦恼故。住第九地得等虚空身。何以故。身相不可量遍一切处故。住第十地则得智身。何以故成就一切种智故。胜天王白佛言。如来之身与菩萨身无差别乎。佛告胜天王言。身无差别但功德异。胜天王言。其义云何。大王。佛菩萨身无有差别。何以故。一切诸法同一性相。功德差别。世尊。云何功德而有差别。佛言大王。今当为王譬喻显了。譬如宝珠若有装饰或不装饰其珠何异。佛与菩萨功德有差法身无别。何以故。如来功德一切<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。尽于十方遍众生界。清净离垢障碍永无。菩萨之身功德未满有余障故。譬如初月十五日。月亏盈有异月性无差。此等诸身皆悉坚固。犹如金刚不可破坏。何以故。三毒不破世法不染。恶趣人间苦不能逼。悉已远离生老病死。能伏外道过魔境界。不向声闻辟支佛乘。以是因缘不可破坏。大王。菩萨摩诃萨行般若波罗蜜。善能将导一切世间天人阿修罗。譬如有人善为将导。若国王等长者居士意咸用之。菩萨亦尔。声闻缘觉菩萨诸佛。咸同用为将导。又如善将导者。世间国王婆罗门长者居士咸共尊重。菩萨亦尔。天龙夜叉有学无学之所供养。又如旷野险难怖畏行人疲倦。遇善将导能令安隐。菩萨亦尔。以方便力于彼生死烦恼贼难。将导众生安隐得出。又如贫人依富长者方出险难。梵志尼干及余外道。于生死中依行般若波罗蜜菩萨。尔乃出离又如大富长者无量赀财为一切人之所受用。行般若波罗蜜菩萨亦复如是。于生死中<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生之所受用。又如大富长者欲过险难必要多伴。饮食资粮皆悉具足尔乃得过。菩萨亦尔。欲出世间以功德智慧。摄一切众生度生死难至萨婆若。又如人远行多赍宝物。为得利故。菩萨亦尔。从生死海至萨婆若。广修功德智慧。为得一切智故。又如世人求财无厌。菩萨乐法亦无厌心。又如将导。四事胜他。所谓<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>最胜。位高语用。菩萨亦尔。富功德位最胜法<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>无异言。又如人善导至于大城。菩萨亦尔。善能将导至萨婆若城。大王。菩萨摩诃萨行般若波罗蜜。善知行路不可行路邪正安善。有水无水相貌曲直。出离之道皆悉通达。大王。菩萨摩诃萨知不倒路。凡所示道不违众根。为大乘人示无上道。不说声闻辟支佛路。为小乘人示声闻道不说大乘。辟支佛根示缘觉路。不说萨婆若道。为着我见说无我道。着法众生为说空道。着二边者为说中道。为散乱者说奢摩他毗婆舍那不说散乱。戏论众生示如如道不说言语。着生死者示涅槃道不说世间。为迷涂者而说正道。大王。是名菩萨知邪正路</p><p>胜天王般若波罗蜜经念处品第四</p><p>尔时胜天王。即从座起偏袒右肩右膝着地。合掌向佛头面作礼。而白佛言。世尊。菩萨摩诃萨行般若波罗蜜。能如是知路非路者心缘何住。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜心正不乱。何以故。善念身念受念心念法。菩萨摩诃萨。凡所游行城邑聚落闻利养名。如佛戒说烦恼系缚善自忆念。大王。云何菩萨摩诃萨行般若波罗蜜念身。与身相应恶不善法。以如实智悉远离之观身过失。始自足底乃至头顶。此身无我无常败坏。但以筋脉共相连持。腥臊臭秽色恶可恶所不喜见。如是观己身中贪欲悉不复生不起身我。以是因缘相应善法皆悉随顺。云何菩萨摩诃萨行般若波罗蜜念受。作是思惟。诸受皆苦。颠倒众生妄起乐相。凡夫愚痴以苦为乐。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>但说一切皆苦。勤修精进为断灭故。亦教余人修学此法。作是观已恒自念受。不随受行修行断受亦令他学。云何菩萨摩诃萨行般若波罗蜜念心。作是思惟。此心无常而谓常住。于苦谓乐。无我谓我不净谓净。数动不住速疾转易。结使根本诸恶趣门。烦恼因缘坏灭善道。是不可信贪嗔痴主。一切法中心为上首。若善知心悉解众法。种种世间皆由心造。心不自见。若善若恶悉由心起。心性回转如旋火轮。易转如马能烧如火暴起如水。作如是观于念不动。不随心行。令心随己。若能伏心则伏众法。云何菩萨摩诃萨行般若波罗蜜念法。恶不善法能如实知。所谓贪欲嗔恚愚痴及余烦恼而修对治。贪欲对治。嗔恚对治。愚痴对治如是知已。即回起念不行彼法亦令他离。云何菩萨摩诃萨行般若波罗蜜于境起念。若见色声香味触作是思惟。云何于彼不真实法而生贪爱。此乃凡夫愚痴所著即是不善。如世尊说爱即生着着即迷惑。迷故不知善法恶法。以是因缘生于恶趣。菩萨摩诃萨。自不漏失不着境界令他亦尔。大王。菩萨摩诃萨行般若波罗蜜阿兰若念。作是思惟。阿兰若者。是无诤人之所住处寂静住处。于此处中。天龙夜叉他心智人。悉能知我心心数法。不应于此起邪思惟。即得舍离于法正忆勤修行之。大王。菩萨摩诃萨行般若波罗蜜作是思惟。城邑聚落非出家人所可行处则不应往。所谓酤酒淫女。王城博弈歌舞之处悉远离之。大王。菩萨摩诃萨行般若波罗蜜。闻利养名起正忆念作是思惟。为生施福故受此财。不由贪爱受。不出内生长子息。不言我财。一切贫穷普皆周给。如是行者人所赞叹。终不计我及以我所。复作是念。人皆称我惠施名闻。世间无常须臾磨灭。云何智人无常无实不恒无主。随彼而行起我我所大王。菩萨摩诃萨行般若波罗蜜。于佛世尊所说念戒作是思惟。过去诸佛皆学此戒。成无上道得至涅槃。当来诸佛现在亦尔。如是知已精进勤修。大王。菩萨摩诃萨行般若波罗蜜。为化众生及以自身。少欲知足着粪扫衣。心常清洁信力坚固。宁失身命于戒不犯。心离高慢游行城邑不耻弊衣。远离懈怠常修精进。所作未办终不中息。于粪扫衣不见过患。朽故弊坏终无轻鄙但取其德。夫离欲者乃服此衣。如来所赞息悭贪着。亦不自赞我能服此。于他不服终无毁言。如此行人诸天礼敬。佛所赞叹菩萨护持。婆罗门刹利皆悉礼敬。大王。菩萨摩诃萨行般若波罗蜜。如是修清净行。尔时胜天王白佛言。世尊。高行菩萨能行般若波罗蜜。何用着粪扫衣。佛告胜天王言。诸大菩萨将护世人。何以故。世间众生乐见不同。大王。于意云何。菩萨高行何如世尊。胜天王言。百千万亿恒河沙分算数譬喻不及其一。何以故。如来世尊。是大法王一切种智。无有一法而不照了。大王。于意云何。诸佛如来于四天下。天龙夜叉人非人中示现苦行。及以赞叹头陀功德此何所为。王言世尊。为欲教化可度众生。及初发意诸菩萨等。未断烦恼为说对治。佛言。如是如是。大王。高行菩萨着粪扫衣亦复如是。是故菩萨摩诃萨行般若波罗蜜。多有方便利益众生。大王。菩萨摩诃萨行般若波罗蜜。示现世间但畜三衣。何以故。心知足故更不多求即是少欲。不求索故无所积聚。既不积聚则无丧失。无丧失故则不生苦。苦不生故即离诸恼。离诸恼故则无所著。无所著故是为漏尽。大王。菩萨摩诃萨行般若波罗蜜。利益众生故。入城邑聚落持钵乞食。何以故。菩萨摩诃萨大悲熏心。如实观察贫苦众生。令得富乐受彼供养。若入邑聚威仪齐整心正不乱。善摄诸根前视六尺。双犁轭地<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>乞食。次第而往不越贫家。以量受食终不长取。于所得中更开一分拟施供养。何以故。信施难销为生福故。大王。菩萨摩诃萨行般若波罗蜜。但一坐食而不移动。何以故。一坐道场魔来恼乱亦不移动。出世禅定般若阇那。空一切法如实圣道。实际如如一切种智。于此诸法悉不移动。何以故。萨婆若法是一坐得。是故行一坐食。大王。菩萨摩诃萨行般若波罗蜜。以方便力如是示现乞食。大王。菩萨摩诃萨行般若波罗蜜。学阿兰若行。所谓常修梵行。于诸根中不起过失。深乐多闻力堪修行离我怖畏。不计着身常行寂静。菩萨摩诃萨。正法中出家。持三轮净戒善知法相。如来所说为少壮老。三种人戒悉能了达。不随外缘自心思量。诃毁世法赞叹出世。调伏诸根不缘恶境。于阿兰若居无难处。聚落乞食不远不近。有清泉水盥洗便易林木华果。无恶禽兽岩穴寂静。空闲罕人而为居止。所曾闻法日夜三时勤加读诵。声不过高亦不太下。心不缘外一念诵持常在胸臆。若婆罗门刹利来至阿兰若处当唤令坐。彼或不肯殷勤加劝。观此众生随其根性即为说法。令得欢喜信受修行。如是具足善巧方便即离我心。以无我故于阿兰若不生怖畏。离怖畏故乐行寂静。菩萨摩诃萨。如是以方便力示阿兰若行。大王。菩萨摩诃萨行般若波罗蜜。善能观行作是思惟。世间之中一切饮食清净香洁。身火所触即成不净烂坏臭处。一切凡夫愚痴无智。爱着此身及以饮食。若依圣智如实观察。即生秽恶不可乐着。大王。菩萨摩诃萨行般若波罗蜜。作是思惟。多行嗔恚则起恶业。我今当离直心趣道。真实思惟非徒口说。大王。菩萨摩诃萨行般若波罗蜜作是思惟。若法有生即是因缘。法之因缘又从缘起。云何智人于此虚妄因缘生法而作罪失。菩萨身中有障善法即自断除。若不能断他障善法。心即生舍不起无明。云何名障善法。不恭敬佛法僧净戒不敬同学。老少幼小自高降彼。趣向五欲背舍涅槃。而起我见众生见命见人见。执空起断见执有起常见。远离贤圣亲近凡夫。舍持戒人依破禁者。亲附恶友远善知识。闻甚深法即生毁谤。威仪不整口无辩说。烦恼覆心具足谄曲。贪着利养生五种慢。一姓贵。二种族。三见胜。四国土。五徒众。见恶则助遇善而舍。赞叹女人童稚外道。不乐阿兰若行。不解节食不亲近师。虽复读诵不知时节。若见善法亦复不生少尊重心。见恶不怖如象无钩马无辔勒放逸不制。喜起嗔忿不生慈心。见苦不悲遇病不视于死不怖。在火聚中不求免出。应作不作不能量忖。难思而察非望而求。不出谓出非路谓路。未得谓得远大善法。毁呰大乘赞叹小道。毁大乘人赞彼小学。多乐斗乱恶口粗言。心无慈悲令他怖畏。出言粗鄙语无一实。乐着戏论而不舍离。大王。菩萨摩诃萨行般若波罗蜜。如是等事名障善法。大王。菩萨摩诃萨行般若波罗蜜。灭诸戏论修习空行。作是思惟。所观境界皆悉空无。能观之心亦复如是。无能所观二种之异。诸法一相所谓无相。如是思惟遣内外相。不见身不见心不见法。次第相续修奢摩他毗婆舍那。毗婆舍那如实见法。奢摩他者一心不乱。菩萨如是修观行已即得净戒。戒清净故行亦如是。是名菩萨摩诃萨行般若波罗蜜观行清净。大王。菩萨摩诃萨行般若波罗蜜。护持如来正法之藏听受正法。为守护故不为利养。为三宝种不断故不为恭敬。为拥护大乘行故不为名闻。为无归依众生令得济拔与安乐故。无慧眼者令得慧眼。修小乘人示声闻道。欲行大乘示现大道。如是听法为无上智。终不为得下劣之乘。大王。菩萨摩诃萨行般若波罗蜜善知毗尼。所谓毗尼及毗尼行。毗尼甚深毗尼微细。净与不净有失无失波罗提木叉。声闻毗尼菩萨毗尼。大王。菩萨摩诃萨行般若波罗蜜。如是等毗尼皆悉善知。大王。菩萨摩诃萨行般若波罗蜜。善知一切威仪戒行。善学声闻戒辟支佛戒<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>。既修戒行。若见威仪不称众者。即应远离非处不行。若有沙门戒行威仪则应亲近。若婆罗门异学余行劝修毗尼。如是戒行修之真实。心无巧伪嫉妒即灭。自行布施亦劝他行赞叹布施。见他布施心生<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。不作是念。唯当施我勿与他人。但应思惟。一切众生多有所乏饥寒困苦。愿其得财现世安乐。以闻法故后世安乐。我今应当精进修道。与诸众生同得出世。是名菩萨无嫉妒心。于诸众生皆得平等。若行布施普为众生。戒忍精进禅定般若。乃至一切种智。无二心修。何以故。所修之法与众生共念为境界令速成道。于生死火自既出离亦使他出。譬如长者而有六子。并皆幼稚爱念无偏。长者在外其宅火起。大王。于意云何。长者作念于此六子先后救不。不也世尊。何以故。其父于子心平等故。大王。菩萨摩诃萨行般若波罗蜜亦复如是。凡夫贪着处在六道。生死火宅不知出离。菩萨摩诃萨行般若波罗蜜。以平等心种种方便。诱化令出皆悉安置寂静界中。大王。菩萨摩诃萨行般若波罗蜜于法亦等。所谓以法供养如来。种种供具供养如来。如实修行供养如来。利益安乐一切众生。守护一切众生善法。随顺众生善能教化。行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>行不违言。心无疲倦求阿耨多罗三藐三菩提。若能如是乃得名为供养诸佛。不以资生而为供养。何以故。大王。法是<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。若供养法即供养佛。大王。诸佛世尊。皆从如实修行而来。悉为利益安乐众生。护其善法随顺众生。若不尔者违本誓愿。懈怠懒惰不能成就菩提之心。何以故。菩萨摩诃萨。阿耨多罗三藐三菩提与众生共。若无众生菩萨云何能得菩提。大王。菩萨摩诃萨行般若波罗蜜。以法供养如来名真供养如是供养拔除我慢。远离俗务剃落须发于其父母兄弟亲戚。不复相关犹如已死。形状衣服相貌异常。执持钵器游入城郭。至其亲里若旃陀罗家。下意乞食作是思念。我命属他由彼食活。以是因缘能除我慢。复作念言。我今应取师僧尊长。及同学意令彼欢喜。昔未闻法为得闻故。若见他人嗔恚斗诤。即应忍辱下意避之。大王。菩萨摩诃萨。如是行般若波罗蜜拔除我慢。大王。菩萨摩诃萨行般若波罗蜜生坚正信。何以故。多诸功德宿世所种。善根力强具足善因。正见成就不信外道。内心清净不依余师。心行调直远离谄曲。诸根聪利具足般若。离诸盖障其心清净。远恶知识亲近善友。寻求善言不生懈怠。所闻说法知佛功德。胜天王白佛言。世尊。唯愿大慈。哀愍为说如来功德大威神力。佛告胜天王言。大王。谛听谛听。善思念之。我当为王宣说如来神德少分。善哉世尊。唯然愿闻。佛言大王。如来具足无边大慈遍照众生。众生所摄乃至十方尽虚空界。亦皆遍照不可测量。如来大悲声闻缘觉菩萨所无。何以故。不共法故。十方世界无一众生大悲不照。复次如来说法无尽。普为十方一切众生。一劫百劫千劫若<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>。种种因缘说法无尽。若众生界种种言辞。一切句义咨问如来。一弹指顷一一众生。各为分别无能坏者。复次如来即是无碍禅定境界。假使一切世界众生。皆住十地入诸<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>百千亿劫。观如来定不能测量。复次如来身无边量。何以故。随所乐见能于一念示现种种如来。又有清净天眼。一切世界无量众生。一一众生一一世界。如是一切世界中事。如来悉见如观掌中阿摩勒果。诸天人眼所不能见。如来复有清净天耳。一切众生随其种类音声不同。如来悉闻解了其义。如来复有净他心智。一切世界有诸众生。作业思想若所得报。如来世尊行立坐卧。于一念顷皆悉了知。何以故。如来常定无散乱故。大王。诸佛如来无有失念。心不散乱根无异缘。何以故。离烦恼习最为清净寂静无垢。有烦恼者其心散乱则异攀缘。如来世尊无漏离垢。得一切法自在平等。常在三昧三摩跋提故。大王。如来以一威仪三昧游行乃至涅槃。无有天人能得知者。况复如来于无量劫修习无量无边万亿三昧。何以故。如来不可量不可思不可观故。尔时胜天王白佛言。世尊。我闻如来三阿僧祇劫修行成佛。云何而说无量劫修。佛言。不也大王。何以故。菩萨摩诃萨。修阿耨多罗三藐三菩提。无量功力之所能办。非尔许劫时始得入法平等理称为成佛。胜天王白佛言。世尊。善哉善哉。一切众生常行诸善远离障业。喜乐<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>修菩萨行。世尊。若有众生得闻如来大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力。心生欢喜信受赞叹。当知是人不久得成此神通器。况复有人<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵书写宣说。如是人等不可思量。佛言。如是大王。此等众生如来拥护已种善根。过去供养无数诸佛。乃能得闻如来世尊大神通力。是善男女心不疑惑。于七日中澡浴清净着新洁衣。香华供养一心正忆。尔时如来即为现身便得见佛。其供养具或有阙少但一心念。于命将尽见佛在前。胜天王白佛言。世尊。颇有众生闻说如来神通功德。不起<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>而谤毁不。佛言。有是众生。若闻如来神通法门。即起嗔毒不善之心。于说法师恶知识想。此人舍寿生泥梨中。若闻如来大神通力能生信受。于说法师善知识想。即得人天乃至成佛。尔时世尊。出广长舌相自覆面门。次至头顶次覆遍身次覆师子座。次覆菩萨众次覆声闻众。然后乃覆释梵护世一切大众还收舌相。告大众言。如来世尊有是舌相岂当<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。汝等大众皆应信受长夜安乐。说是法时众中八万四千菩萨得无生法忍。无量百千众生。得远尘离垢法眼净。无量无边众生。发阿耨多罗三藐三菩提心</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第三卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第三卷</p><p>陈优禅尼国王子月婆首那译</p><p>法性品第五</p><p>尔时胜天王。即从坐起偏袒右肩右膝着地。合掌向佛头面作礼。而白佛言。希有<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。如来应供正遍知。快说微妙大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力。诸佛如来因何得此。唯愿世尊分别解说。佛告胜天王言。大王。诸佛如来所行甚深不可思议。得果亦尔。胜天王白佛言。世尊。诸佛如来行何等法。名为甚深不可思议。佛告胜天王言。大王。诸佛如来法性<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>不可思议。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>及法利益<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>亦复如是。胜天王白佛言。世尊。云何法性不可思议。佛言大王。在诸众生阴界入中无始相续。所不能染法性体净。一切<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>不能缘起。诸余觉观不能分别。邪念思惟亦不能缘。法离邪念无明不起。是故不从十二缘生。名为<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。则非作法。无生无灭无边无尽自相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。大王。菩萨摩诃萨行般若波罗蜜。能知法性清净。如是无染无著远离垢秽。从诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>超得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。此性即是诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>本。功德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>因之而生。体性明净不可思量。大王。我今喻说汝善谛听。王言世尊。唯然愿闻。佛告胜天王言。譬如无价如意宝珠。装饰莹治皎洁可爱。体圆极净无有垢浊。堕在淤泥已经多时有人捡得取而守护不令堕落。法性亦尔。虽在烦恼不为所染后复显现。大王。诸佛如来悉知众生<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净。客尘烦恼之所覆蔽不入自性。是故菩萨摩诃萨行般若波罗蜜。应作是念。我当勇猛勤修<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。为诸众生说是甚深般若波罗蜜除其烦恼。一切众生皆有性净。是故于彼勿生下劣应当尊重。彼即我师<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>恭敬。菩萨摩诃萨。作如是心即生般若阇那大悲。大王。菩萨摩诃萨。如是行般若波罗蜜。能入阿鞞跋致地。大王。菩萨摩诃萨行般若波罗蜜复作是念。此诸烦恼无力无能。自体虚妄与净相违。何以故。背萨婆若故。清净法性为诸法本。自性无本虚妄烦恼皆从邪念颠倒而生。大王。譬如四大依<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>立空更无依。烦恼亦尔。依此法性法性无依。大王。菩萨摩诃萨行般若波罗蜜。如实观知不起违逆。以随顺故烦恼不生。大王。菩萨摩诃萨。观察烦恼不生染着。若自染着云何<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>令他出离。是故菩萨断灭着心。如实说教解众生缚。菩萨摩诃萨行般若波罗蜜复作是念。若<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>中有一烦恼。利益众生我则摄受。菩萨摩诃萨行般若波罗蜜复作是念。如昔诸佛行般若波罗蜜应如是行。何以故。诸佛如来昔在因地亦如是学。成<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>故以此二缘。是故菩萨种种方便知此法性。大王。如是法性无量无边。为诸烦恼之所隐覆。随生死流沉没<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>长夜轮转随众生故名众生性。菩萨摩诃萨行般若波罗蜜。起厌离心除五尘欲修无上道。是时此性名为出离。过一切苦故名寂静为究竟法。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之所乐求。一切种智常住微妙。因此法性能得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>受法王位。大王。菩萨摩诃萨行般若波罗蜜。初中上位观察法性。一切平等本来寂静悉无挂碍。犹如众色不能满空。菩萨摩诃萨行般若波罗蜜。如实而知诸佛所说一切众行如量<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。法性功德不可具说。无有二相过一异境。平等一相觉观不行。菩萨摩诃萨如是行般若波罗蜜。能除二相人相<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>一切凡夫为执所缚。不识不见不得法性。菩萨摩诃萨行般若波罗蜜。则能通达如此法性。若在众生无二无别。何以故。如如不异故。大王。菩萨摩诃萨行般若波罗蜜。依此法性修诸善根。来入三有利益众生。虽现<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>而非真实。何以故。菩萨摩诃萨行般若波罗蜜。如实见法性故。具足方便大悲愿力不舍众生。二乘凡夫无有如此大悲本愿。是故不见圆净法性。大王。菩萨摩诃萨行般若波罗蜜如是观法性一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>无能修者无所修法。无能<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>无所行法。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>无心法无业无<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>无苦无乐。如是观者名得平等。不异远离随顺广大。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>我所无高无下。真实无尽常住明净。何以故。一切圣法由此成就。因是性故显现圣人。大王。诸佛如来无边功德不共之法。从此性生由是性出。大王。一切圣人<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>品从此性生。诸佛菩萨般若波罗蜜从此性出。是性寂静过诸名相。性是真实则离颠倒。性不变异故称为如圣智境界名第一义。非有非无非常非断。非生死非<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>非染非净。离一离异无名无相。大王。菩萨摩诃萨行般若波罗蜜。复作是念。法性离相。一切法离相无二无别。何以故。一切法离相即法性离相。法性离相一切众生离相同法界离相。法界离相一切法离相。如是离相求不可得。法性如如众生如如同一无二。众生如如法性如如同一无二。法性如如一切法如如无二无别。一切法如如诸佛如如无二无别。法性如如过去未来现在如如不相违逆。过去如如未来如如亦不相违。过去未来现在如如即是阴界入如如。阴界入如如即是染净如如。染净如如即是生死涅槃如如。生死涅槃如如即是一切法如如。大王。所言如者名为不异。无变不生无诤真实。以无诤故说名如如。如实知见诸法不生。诸法虽生如如不动。如如虽生一切诸法如如不生。是名法身清净不变犹如虚空无等等。一切<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>无有一法所能及者。遍众生身无与似者。清净离垢本来不染。自性明净自性不生自性不起。在心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>非心意识性。即是空无相无愿。遍虚空界诸众生处。一切平等无边无量不异不别。非色不离色。非受想行识不离受想行识。非地大水火风大。不离地大水火风大。无生离生。虽逆生死不顺涅槃眼不能见耳不能闻。鼻不能嗅舌不能尝。身不能觉意不能知。不在心意识不离心意识。大王。是名法性。菩萨摩诃萨行般若波罗蜜。通达此法修行清净。三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>若阎浮提城邑聚落。菩萨悉能示现色身。所现身者。非色非相而现色相非六根境。而化众生常无休息。为说此身无常无我苦不净法。了知众生有寂静性。能为示现无量种身。善巧方便令彼受化知一切身。无有作者亦无受者犹如木石。而为众生说清净行。大王。菩萨摩诃萨如是行般若波罗蜜。通达法性即得自在。无有移动而起智业。游戏神通种种示现安住自在。而能示现种种威仪。自在能趣一切种智。皆悉通达一切诸法。大王。般若波罗蜜如是自在。是无尽相遍一切处。无色现色自在遍观诸众生心。见如实心性自在忆念。无边数劫相续不断。自在变化住解脱相。自在尽漏为众生故不证漏尽自在出世。是圣智境自在甚深。声闻缘觉所不能测。自在坚牢魔不能坏。能至道场成就佛法最为第一。自在随顺转大法轮。自在调化一切众生。自在受位得法自在。大王。菩萨摩诃萨行般若波罗蜜如实通达甚深法性得是自在。菩萨摩诃萨。修是自在即得诸禅解脱<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>三摩跋提。不系欲界色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。何以故。远离一切虚妄分别。烦恼系缚。颠倒执相。若其受生于生自在无有系缚。若欲现灭亦复自在。随其生处恒摄大乘成就佛法。而于十方推求佛法竟不可得。一切诸法同一佛法非常非断。何以故。推求此法不可得故。以如实理求不可得。是法不可说有说无说亦无名相。过此境界若离名相即是平等。若法平等即无执着。无可著者是法真实。若着真实即是虚妄。以不着故即非虚妄。无所滞着心即无碍。无碍即无障无障即无诤无诤即同虚空。是法不系欲界不系<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>不系无色界。若一切处无所系属。是法无色无相无形。若法无色无相无形。是法应如是知。随彼境界而离能知亦离所知。何以故是中无有少法可觉少法能觉。是名菩萨摩诃萨行般若波罗蜜通达平等。大王。菩萨摩诃萨行般若波罗蜜。观大慈大悲大喜大舍。不见我不见众生。不见命不见人。虽行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>而调伏心离戒相心而净持戒。以无尽心修行忍辱。离心精进。以寂静心修习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。心无所缘修行般若心念四处。以平等心修习正勤。离戏论心修诸神足。分别众生观察诸根。离愆失心修诸根力。以分别心观察觉分。无功用心修习正道。心无所著而有净信。自然智慧忆念诸法。平等智心修诸三昧。不分别心观般若波罗蜜。以止息心修奢摩他。无所见心修毗婆舍那。无所念心而修<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>。通达法界平等之心而修念法。无所住心而修念僧本心清净。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。不起分别法界之心摄一切法。如虚空心净佛国土。无所得心得无生法忍。无进退心得阿鞞跋致。远离相心不见有相。三界平等心<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>道场。心能觉知一切诸法。转于法轮不见听说示现涅槃而知生死本性平等。大王。菩萨摩诃萨行般若波罗蜜。如是观诸法不见能观不见所观。即时能得游戏自在。何以故。自心清净能见一切众生净故。大王。譬如虚空遍满一切。菩萨摩诃萨行般若波罗蜜心亦如是。说此法时。众中八万四千人天发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。三万二千菩萨得无生法忍。八万四千众生得远尘离垢<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。一万二千<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>皆得漏尽。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜。心得清净深大如海。功德智慧不可测量。菩萨摩诃萨能现出世。诸功德宝众生用之。乃至菩提无有尽竭。菩萨功德亦复不灭。犹如大海多出众宝。菩萨智慧甚深难入。声闻缘觉无能涉者。亦如大海小兽不入。菩萨智慧广大无边。何以故。无著无住无色无相。菩萨智慧从初至后次第转深。初菩提心后萨婆若菩萨法尔。不与烦恼及恶知识而共止住。世间智慧若入菩萨智慧之中一相一味。所谓无相萨婆若无分别味。菩萨摩诃萨观一切法。不见法增不见法减。何以故。通达平等深法性故。菩萨摩诃萨。大慈悲力不违本愿。一切圣人之所依处。为诸众生永劫说法无有穷尽。大王。菩萨摩诃萨行般若波罗蜜。通达如是甚深法性。大王。菩萨摩诃萨。善能通达世谛众法。虽说诸色而非实有。推求此色终不取着。受想行识亦复如是。虽说地大而非真实。推求地大终不取着。水火风空识亦复如是。虽说眼入而非真实。推求眼入终不取着。耳鼻舌身意亦复如是。虽复说我而非真实。推求觅我终不取着。众<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>养育人。作者寿者。知者见者。亦复如是。虽说世间而非真实。推求世间终不取着。虽说世法而非真实。推求世法终不取着。虽说佛法而非真实。推求佛法终不取着。虽说菩提而非真实。推求菩提终不取着。大王。凡有言说名为世谛此非真实。若无世谛第一义谛则不可说。菩萨摩诃萨行般若波罗蜜。通达世谛不违第一义谛。即通达之。知法无生无灭无坏无此无彼。悉离语言文字戏论。大王。第一义者离言寂静。圣智境界无变坏法。若佛出世若不出世性相常住。是名菩萨通达第一义谛。尔时胜天王白佛言。世尊。若一切诸法不生不灭自性空离。云何有佛出世及转法轮。云何菩萨于无生法而见有生。佛告胜天王言。大王。法不灭故不生。何以故。性不变异故。但以世谛<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>见有生灭。皆是虚妄非真实有。菩萨摩诃萨行般若波罗蜜。善巧方便见因缘法。即知世谛悉空无有不见坚实。似有如影。如炎响幻。不安摇动从因缘生。菩萨摩诃萨以般若波罗蜜。观诸法空乃至从因缘生。作是思惟。此等诸法今见有生有住有灭。何因缘生何因缘灭。即作是知。无明因缘故生诸行。依行生识。识生名色。名色生六入。六入生触。触生受故。凡夫起爱。渴爱生取。以因取故则相续有。由有故生。生则有老。老故有死忧悲苦恼。是故修行为断无明。无明若断余十一分则亦复灭。譬如人身若断命根余根靡用。大王。邪见外道为求解脱。但欲断死不知断生。若法不生则无有灭。譬如有人块掷师子。师子逐人而块自息。菩萨亦尔。但断其生而死自灭。犬唯逐块不知逐人块终不息。外道亦尔不知断生终不离死。大王。菩萨摩诃萨如是行般若波罗蜜。善知因缘诸法生灭。大王。菩萨摩诃萨行般若波罗蜜。知缘生法空无实有不起我慢。若生<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>刹利<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>长者之家。不起二慢尊贵豪富。若生贫贱自知宿业不甚清净得报下劣。心起厌离即求<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。作是思惟。如我此身杂业所得。更修净业令自清净使他亦尔。自既求度亦复度他。自求脱离亦解他缚。以是因缘即生精进不堕<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。障道恶法皆为断除。助道善法悉应增长勤修精进。作是思惟我负重担。应当自灭一切烦恼。度脱众生不得懈怠。菩萨摩诃萨行般若波罗蜜。亲近师僧多闻寡闻有知无知持戒<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。但生佛想恭敬同学思惟我今依师学习。修善未满悉令满足。烦恼未尽断之令尽。拥护善法舍离不善。一切种智怜愍世间。大悲<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>寂静<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师。是我大师善得吉利。一切天人皆事法王以为大师。菩萨摩诃萨行般若波罗蜜作是思惟。佛说净戒。设为身命亦不毁犯。如世尊说随顺<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>即<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛。若婆罗门刹利居士长者。种种饮食<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>施与。如法受用不令彼人空失果报。食者施者俱得利益。婆罗门刹利居士长者。以<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>名而召菩萨作福田想。菩萨应当如理如量修行<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。即令显现沙门功德福田功德。菩萨如是自行化他不曾休废。菩萨摩诃萨行般若波罗蜜。如是修行则能随顺一切世间。见嗔恚者生下劣心。见高慢人起无我想。见邪曲人起正直想。见<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>人起如实言。于恶口人常说爱语。见刚强者示现柔和。见惨毒人则行慈忍。见邪法人则生大慈。见苦众生则起大悲。见悭嫉人则行布施。大王。菩萨摩诃萨行般若波罗蜜。如是随顺世智生净佛国。何以故。持戒无缺离诸杂秽。修平等心。于众生所具大善根不著名利。清净之信无所望报。勤行精进不生懈怠。修诸禅定离散乱法。以微妙慧而习多闻。诸根不缺具足利智。常修大慈远离嗔恼。以是因缘生净佛国。尔时胜天王白佛言。世尊。如佛所说。修戒等法生佛国土。为修行一行亦生。佛告胜天王言。大王。若有菩萨摩诃萨于前所说种种法中。净修一行即修众法。如是一行得生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。何以故。一一行中具众行故。大王。菩萨摩诃萨行般若波罗蜜如是行生净土不为胎污。何以故。菩萨摩诃萨。造作佛像修葺伽蓝。如来塔前香泥涂地<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>供养。或以香汤浴洗佛像。于伽蓝内扫洒泥涂。菩萨摩诃萨。供养瞻省父母之身师僧同学及诸沙门。以平等心皆悉供养。回此善根为一切众生。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>阿耨多罗三藐三菩提令得清净。菩萨摩诃萨如是行般若波罗蜜即得离俗。何以故。心无取着不染朋党背诸境界。远离爱缘境界不染。世尊说戒如实修行。少欲知足随宜四事。趣足过时心常怖畏乐寂静离。大王。如是菩萨摩诃萨行般若波罗蜜。不着俗法即得净命。无伪威仪口意欺诈。于施主前终不诈伪现身威仪。安祥徐步视前六尺。若背檀越即便纵诞。于施主前不为利养下声细语软美之言顺彼意语。若背檀越则便自纵。见他行施口言不用心实欲须如是名为内心热恼。口现少欲心贪利养。大王。菩萨摩诃萨行般若波罗蜜。悉无此伪离求利相。若见檀越不得发言。三衣弊坏钵器阙无或须汤药。于施主前不得发言。某甲檀越施我此物。彼人谓我持戒多闻大悲心净。虽尔赞叹我无此德。唯当修行报施主恩。菩萨摩诃萨。不应如是自赞毁他。随顺白衣而求利养。若施余人勿生嗔恼。不作谄曲而以取财。不诈亲善害他取物。不为他人戏弄取财。檀越拟施或赞叹人。若说法者或拟大众。或复未拟或施未决。菩萨不得入中取分。若受施财不应执着。此是我有此是我物。即当回施沙门师僧父母。及余贫乏平等受用。若财物尽不以生忧。少日不得心无苦恼。大王。菩萨摩诃萨。受施回与二俱清净。行清净故心不疲劳。何以故。菩萨摩诃萨行般若波罗蜜。为利众生久处生死而不厌患。若有魔事众苦逼切心无退转。若人欲行二乘之道。即为说法不惮疲劳。菩萨自修助菩提法无有厌倦。大王。菩萨摩诃萨行般若波罗蜜。如是精进则能随顺佛正教行。何以故。菩萨摩诃萨行般若波罗蜜。离诸放逸心常谨慎。善摄自身不作诸恶不善之法。口意亦尔。菩萨摩诃萨行般若波罗蜜。虽处现在恒惧未来一切诸恶不善之法断之不生。言必附理常说法教。非法不言悉弃秽业。纯修净行不毁佛教。远离烦恼不净之法。是名拥护如来正教。一切诸恶不善之法悉断离之。大王。菩萨摩诃萨行般若波罗蜜。如是随顺佛清净教。视诸众生面门先笑曾无嚬蹙。所以然者。心离秽浊诸根清净不染离垢。心不嗔恚内无恨结。菩萨摩诃萨。如是行般若波罗蜜即得多闻。观察生死能如实知。欲火炽然嗔火焚烧。愚痴之火常所迷乱。亦如实知有为无常。一切行苦诸法无我。世间众生耽着戏论。一切法中唯有涅槃乃为寂静。若闻他说即思惟义。传以授人。发大慈悲起坚固意。若不闻法则无思修。是故闻慧犹如字本。一切智慧因之而生。既得多闻则护正法。大王。未来末世正法灭时。其有众生乐勤修行。不值法炬无人为说甚深之法。尔时菩萨。即为演畅甚深妙法。所谓般若波罗蜜。令诸众生得戒定慧。又赞之言。善男子。如是末世正法灭时。汝等能发菩萨之心。求阿耨多罗三藐三菩提利益众生。此般若波罗蜜。三世诸佛之所行者。汝若勤修。则去阿耨多罗三藐三菩提不远。何以故。般若波罗蜜不离菩提。譬如有人种谷已秀。当知收获必在不久。菩萨亦尔。求阿耨多罗三藐三菩提。得闻般若波罗蜜。当知决定去佛不远。大王。若善男子善女人。舍离般若波罗蜜。更依余法求阿耨多罗三藐三菩提无有是处。犹如王子舍其父王。更就余人求为太子决不可得。菩萨亦尔。求萨婆若必因般若波罗蜜得。譬如犊子若欲须乳必依其母。若就余牛则不可得。大王。菩萨摩诃萨。亲近般若波罗蜜。常为法王子相庄严身。以好为华严饰身相诸根不缺。如来行处常所游行。所行之道随佛如来所觉而觉。救护世间苦恼众生。善能通达佛所说教。常修梵行守护如来萨婆若城。大王。菩萨摩诃萨行般若波罗蜜。为法王子。释梵护世之所尊重。何以故。行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>阿鞞跋致。一切诸魔所不能动。安住佛法通达一切空平等理不信外缘。如是安住佛法智慧。不与声闻辟支佛共。超过世间住无生法忍。大王。菩萨摩诃萨行般若波罗蜜。能如实知一切众生心贪欲嗔痴上中下品。亦如实知<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>坚固心。如实知已。各各为说诸对治法。如是则能善化众生。菩萨摩诃萨行般若波罗蜜。若有众生应见<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>受化度者。菩萨摩诃萨即现佛身而为说法。应以菩萨身化度者现菩萨身。应以辟支佛身而受化者即现辟支佛身。应以声闻身受教化者。即现声闻身。应以帝释梵王婆罗门刹利长者居士身受教化者。皆为示现而度脱之。大王。菩萨摩诃萨如是行般若波罗蜜教化众生。菩萨摩诃萨行般若波罗蜜。心性慈和正直软善。无诸谄曲嫉妒垢秽心常清净。言语不粗远离恶口。多行忍辱亲狎众生。大王。菩萨摩诃萨如是行般若波罗蜜则在处安乐。所以然者。具足<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>及清净见。清净之行所行境界与心相应。若心相违恶不善法。如是境界及染秽处斯则不行。菩萨摩诃萨行般若波罗蜜。见同学人心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。若财若法与他共用。唯行一道。所谓佛道。唯佛为师不尊余人。大王。菩萨摩诃萨行般若波罗蜜如是在处安乐。具诸摄法而摄众生。以利益施安乐施无尽施摄取众生。利益语有义语如法语不异语摄取众生。以财利益平等。身利益平等。命利益平等。资具利益平等。摄取众生。大王。利益施者即是法施。安乐施者即资生施。无尽施者即示现道。利益语者令彼生善。有义语者令彼见理。如法语者随顺佛教。不异语者说如实法。财利益平等者。可食可啖可饮可嗽可舐及衣服等。身利益平等者。如以摄卫利益己身令他亦尔。命利益平等者。真珠琉璃珊瑚玛瑙多为外命。资具利益平等者。象马车乘一切净财。菩萨摩诃萨行般若波罗蜜。自行与他皆悉共同。大王。菩萨摩诃萨行般若波罗蜜。受生端正。常能修习寂静威仪。不伪威仪。清净威仪。人所乐见内外温善。观者无厌能悦人意。一切众生之所爱重。其有见者皆发善心。嗔恚者见心即得解。大王。菩萨摩诃萨行般若波罗蜜。如是端正则堪依止。守护众生令烦恼灭。能将众生出离生死无边旷野。能度众生世间险难。为无眷属而作亲友。为烦恼疾而作良医。无救护者为之救护。无归依者为作归依。无明众生为作法炬。菩萨摩诃萨行般若波罗蜜。为诸众生而作依止。治诸疾病如药树王。譬如善见大树。根茎枝叶华果色香味触。悉为众生疗治众病。大王。菩萨摩诃萨行般若波罗蜜亦复如是。从初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>为诸众生治种种疾诸烦恼病。菩萨摩诃萨功德智慧。有疾病者见闻皆差。菩萨摩诃萨行般若波罗蜜。常与功德相应。随力所堪供养<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。若有疾病即施汤药若见饥渴即施食饮。若见寒冻即施衣服。师僧和上尽心承奉。同学法人合掌恭敬。造立伽蓝布施田园。时时随有舍与众僧下使隶役如法料理。闻有名德沙门婆罗门<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>行者时时往诣。大王。菩萨摩诃萨行般若波罗蜜能生诸善。有巧方便教化众生。于此佛国身不移动。而游无量诸佛世界咨问正法。于此佛国身不移动。而游无量诸佛世界听受正法。于此佛土身不移动。示现无量诸佛国土供养如来。于此佛土身不移动。而游无量诸佛世界。成就无上菩提资粮。于此佛土身不移动而游无量诸佛世界。若有菩萨<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道者供养恭敬于此佛土身不移动。无量世界示现成道。于此佛土身不移动。无量佛国现转法轮。于此佛土身不动移。无量佛国示现涅槃于此佛土身不移动。无量佛国应得度者。为示<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>皆悉令见。亦无分别有所作意。尔时胜天王白佛言。世尊。云何菩萨摩诃萨。作种种化无分别心。佛告胜天王言。大王。譬如日月照四天下而无分别。我照天下为作光明。众生业报自感日月光照天下。菩萨摩诃萨行般若波罗蜜亦复如是。虽现化身而无分别。何以故。众生各有宿世善业。菩萨摩诃萨。昔从因地修行发愿为度众生。以此愿力随其所念。皆悉应现无分别心。大王。菩萨摩诃萨行般若波罗蜜。如是方便善巧教化。速向阿耨多罗三藐三菩提。何以故。菩萨摩诃萨。行檀具足持戒清净。无穿缺杂戒聚清净。过诸声闻辟支佛境。具足忍辱精进禅定般若方便愿力智。如来世尊不共功德。一切具足已过声闻辟支佛地。大王。菩萨初地乃至十地。行般若波罗蜜。修如是行得阿耨多罗三藐三菩提。说是法门时。众中二万天子得远尘离垢法眼净。三万菩萨摩诃萨得无生法忍。八万四千天人发阿耨多罗三藐三菩提心。无量百千亿乾闼婆紧那罗皆悉合掌。赞叹如来绕耆阇崛山。无量百千亿夜叉众。雨诸莲华绕耆阇崛山。十方无量恒河沙世界菩萨。来集赞叹如来世尊快说甚深般若波罗蜜为诸菩萨。世尊。因此般若波罗蜜。得有人天。须陀洹向须陀洹果。乃至阿罗汉向阿罗汉果。辟支佛道。菩萨十地。十波罗蜜。如来十力。四无所畏。十八不共法。一切种智。皆从般若波罗蜜中出。世尊。譬如世间一切众生悉依虚空而空无依。般若波罗蜜亦复如是。一切法本而自无依。愿令我等于未来世。为诸菩萨摩诃萨说般若波罗蜜如今佛说。又以种种香华散如来上。尔时耆阇崛山天神及余集者空中赞言。我等忆念过去之世。无量诸佛于此耆阇崛山中。说是般若波罗蜜法亦如今日。尔时胜天王白佛言。世尊。空中诸天云何得知。如来境界久远世。佛说是般若波罗蜜事。佛言。大王。此诸天等皆住不可思议解脱。是故能知过去远事。大王。我昔为菩萨时。亦经生彼天神之道。见无量佛成道说法乃至涅槃。我常赞叹合掌<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。何以故。彼天神道<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长故。尔时众中有一天子。名曰光德。即从坐起偏袒右肩右膝着地。合掌向佛头面作礼。白佛言。世尊。诸佛菩萨应游净土。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>是不清净。云何世尊出现此土。尔时佛告光德天子。诸佛如来所居之处无有秽土。于是世尊。即以神力现此三千大千世界。地平如掌琉璃所成。无诸山陵堆阜荆蕀。处处宝聚香华软草。流泉浴池八功德水。七宝阶砌树木华果。咸说菩萨不退法轮。无有凡夫。唯见十方诸大菩萨。不闻余音。唯闻般若波罗蜜声。处处莲华大如车轮青红赤白。一一华中。皆有菩萨结加趺坐。即见如来于大众中。为诸菩萨说甚深法。无量百千释梵护世。前后围绕。供养恭敬尊重赞叹。希有世尊。希有世尊。所说无虚真实不二。如世尊说诸佛住处实无秽土。众生薄福而见不净。世尊。若有善男子善女人。得闻般若波罗蜜名字甚为希有。况复书写<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵为他演说。佛言。若善男子善女人。无量百千劫。以无碍心施他财物。若复有人以净信心。书写此经传受与人。功德多彼。何以故。财施有竭。法施无尽。何以故。施财但能得世间果。若人若天昔已曾得。得已堕落今还复得。若以法施昔来未得。今始能得所谓涅槃。若三千大千世界一切众生。有人教化悉令安住十善道中。若善男子善女人。以净信心受持读诵般若波罗蜜为他人说。功德胜彼。何以故。一切善法皆从般若波罗蜜生故。若三千大千世界一切众生。有人教化。皆得须陀洹斯陀含阿那含阿罗汉果辟支佛道。若复有人信心受持读诵书写般若波罗蜜功德胜彼。何以故。声闻辟支佛法。皆从般若波罗蜜中生。一切菩萨摩诃萨法。皆从般若波罗蜜中生。因此般若波罗蜜故有佛出世。般若波罗蜜所在之处。当知即是菩提道场转法轮处。应念此处即我大师。如来应供正遍知处在此中。何以故。一切诸佛皆从般若波罗蜜生故。若人供养如来形像。不如供养般若波罗蜜。何以故。三世诸佛。皆因般若波罗蜜生故</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第四卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第四卷</p><p>陈优禅尼国王子月婆首那译</p><p>平等品第六</p><p>尔时胜天王。即从坐起偏袒右肩右膝着地。向佛合掌头面作礼而白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。如佛所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>性平等。何者是平等。等何法故名为平等。佛告胜天王言。大王。等观诸法不生不灭。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>寂静名为平等。一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>虚妄分别。不生不灭自性寂静名为平等。名相<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>不生不灭。自性寂静名为平等。灭诸颠倒不起攀缘名为平等。能缘心灭无明有爱即皆寂静。痴爱灭故不起我我所名为平等。我我所灭名色寂静名为平等。名色灭故边见不生名为平等。灭断常故身见寂静名为平等。大王。能取所取一切烦恼障善法者依身见生。菩萨摩诃萨能灭身见。一切诸使皆悉寂静作愿亦息。譬如大树拔除根株枝条枯死。如人无首命根即绝。一切烦恼亦复如是。若断身见余使自灭。大王。若人能观诸法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。则取可取皆悉寂静。胜天王白佛言。世尊。云何生我见障真实理。佛告胜天王言。大王。于<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>身妄执有我即生我见。真实之法自性平等。无能所执我见相违是故为障。大王。如是我见不在内不在外不在内外。若无所住名为寂静。即是平等。远离我见通达平等。名真实空观。空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无愿自性寂静。不生不灭不取不着。远离我见名为平等。大王。所言我者无来无去。无有真实虚妄分别。法从妄有亦是虚妄。菩萨摩诃萨行般若波罗蜜。观如是法远离虚妄。是故名为寂静平等。大王。能取可取则名为燃离名寂静。惑障为燃离为寂静。菩萨摩诃萨善巧方便行般若波罗蜜。能如实知诸烦恼灭。为增善法断除烦恼。不见可生不见可灭名为平等。修波罗蜜远离魔障。不见可修不见可离名为平等。菩萨常缘助<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>法。不起声闻辟支<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。于助菩提声闻缘觉不见异相名为平等。缘萨婆若心不休息常修空行。以大悲力不舍<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>名为平等。大王。菩萨摩诃萨具足方便行般若波罗蜜。即得心缘<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。心缘无相而修菩提。不见无相及菩提异名为平等。心缘无愿不舍<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。不见无愿及三界异名为平等。观身不净心住清净。观行<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>心住<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>而不厌离观众生苦住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>乐。观法无我于诸众生起大悲心。常为众生说不净药不见贪病。常说大慈不见嗔忿。常说<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>不见愚痴等集病者。说无常乐不见等病及无常异。如是菩萨摩诃萨。以方便力行般若波罗蜜。于一切法心缘自在。缘离欲法为化声闻。缘离嗔法化辟支佛。缘离痴法为化菩萨。缘一切色愿得佛色无所得故。心缘众声愿得如来微妙音声。心缘众香愿得如来清净戒香。心缘诸味愿得如来味中第一大丈夫相。心缘诸触愿得如来柔软手掌。心缘诸法愿得如来寂静之心。心缘<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>为得成就相好之身。心缘尸罗为得清净佛之国土。心缘忍辱愿得如来大<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>声净光明身。心缘<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>为度众生。心缘<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>为得成就诸大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。心缘般若为断一切诸见烦恼。心缘大慈平等无碍令诸众生皆得安乐。心缘大悲为护<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。心缘大喜为得说法悦乐众生。心缘大舍不见众生烦恼结使。大王。菩萨摩诃萨。以方便力行般若波罗蜜。不见二事名平等行。心缘四摄为<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。缘嫉妒过为舍资财。缘<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>失为住净戒。缘嗔恚失为得忍辱。缘懒惰失为成<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>。缘散乱失为得如来寂静禅定。缘粗智失为成如来无碍<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。心缘声闻及辟支佛为欲成就无上大乘。心缘恶趣为欲济拔一切众生。心缘诸天知一切法悉有败坏。缘诸众生知无坚实。心缘<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>为得成就禅定助道。心缘念法为得通达诸秘密藏。心缘念僧为得不退。心缘念舍为无爱着。心缘念戒为得净戒。心缘念天为<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道诸天赞叹。心缘自身为得<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。心缘自口为得佛口。心缘自意为得如来平等之心。心缘有为为成佛智。心缘无为为得寂静。大王。菩萨摩诃萨行般若波罗蜜无有一心一行空过不向萨婆若者。菩萨摩诃萨行般若波罗蜜。遍缘诸法而能不着。名忧波憍舍罗。观见诸法无不趣向菩提之者。大王。譬如三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>大地出生诸物人无不用。菩萨摩诃萨行般若波罗蜜。所缘境界无不利益趣向菩提。譬如众色无有不因四大成者。如是菩萨所缘境界。无有一法不向菩提。何以故。菩萨摩诃萨修习诸行。皆因外缘而得成立。如因悭嫉人成就菩萨檀波罗蜜。因不知恩人成就菩萨尸波罗蜜。如因恶性嗔恚众生成就菩萨忍波罗蜜。因懒惰者成就菩萨毗梨耶波罗蜜。因散乱人成就菩萨禅波罗蜜。因诸痴钝成就菩萨般若波罗蜜。若有众生损恼菩萨。菩萨因此不起嗔心。菩萨若见<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>善法向菩提者。生己身想犹我子心。菩萨摩诃萨。若人赞叹不生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>毁不嗔恚。见苦众生则起大悲。若见受乐则生大喜。若因难化佷戾众生。菩萨则发奢摩他心。因信<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。菩萨即得知恩智慧。若见众生外恶缘强善因弱者。菩萨则起拥护之心。菩萨若见因力强者。种种方便令其受教。菩萨若见智慧开悟解义众生。则为此人说甚深法。若有智人菩萨则为次第说法。著文字者。为说句义。若已先学奢摩他者。菩萨为说毗婆舍那。若有先学毗婆舍那。则应为彼说诸<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。若着持戒为说<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。持戒不着则不说之。若著闻者为说思修。着三昧者说入般若。乐阿兰若即应为说心远离法。若有乐闻佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>者为说圣智。为贪欲者说不净法。为嗔恚人说慈悲法。为愚痴者说缘生法。为等集者说种种法。或说不净。或说慈悲。或说因缘。调化众生为说净戒禅定智慧。应入佛乘而受化者。为次第说诸波罗蜜。应以抑挫而受化者。先折其辞然后说法。种种语言而受化者。即应为说因缘譬喻令其得解。应以深法而受化者。即应为说般若波罗蜜及方便力。无人无我无诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。着见众生为说空法。多觉观者为说无相。乐著有为则说无愿。着阴众生为说如幻。着界众生说无所有。着入众生为说如梦。着欲界者为说炽然。若着<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>为说行苦。着<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>说行无常。难化众生为赞圣种。易化众生说诸禅定及无量心。若闻生天而受化者则为说乐。因声闻法而受化者为说诸谛。辟支<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>而受化者为说因缘。以菩萨法而受化者。为说净心及大悲法。修行菩萨则应为说功德智慧。阿鞞跋致诸菩萨等。则应为说清净佛国。一生补处则应为说<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>道场。应以佛说而受化者。则为相续次第而说。大王。菩萨摩诃萨行清净般若波罗蜜。以方便力得诸自在。说法利益无有空过。说是菩萨自在法门时。众中三万<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。五千菩萨得无生法忍。尔时世尊欣然微笑。诸佛法尔。若微笑时。面门即放诸大光明。青黄赤白紫颇梨色。遍照无量无边世界。上至阿迦尼吒还归佛所。右绕三匝从佛顶入。尔时大智<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。即从坐起偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。世尊。诸佛如来无大因缘。则不现此希有瑞相。世尊今者放是光明。遍照十方无量世界。为何因缘。愿世尊说。尔时佛告舍利弗言。善男子。此胜天王。过去无量无边阿僧祇劫于诸佛所修行众波罗蜜。为诸菩萨护持如是般若波罗蜜。未来之世过无量百千阿僧祇劫。成就无上菩提资粮。然后得阿耨多罗三藐三菩提。<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>功德庄严如来应供正遍知明行足善逝<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解无上士调御丈夫天人师佛世尊。国名严净。劫名清净。其土丰饶人民安乐。纯菩萨众。彼国悉以七宝庄严。所谓金银琉璃颇梨马瑙车[(王*巨)/木]真珠。七宝间错以成其地。平坦如掌。香华软草而严饰之。无诸山陵堆阜荆棘。幡华幢盖种种庄严。城名难伏。七宝罗网弥覆其上。角悬金铃。日夜六时诸天空中自作天乐。散众天香及天妙华。其土人民受乐欢喜。胜他化天。人天往来不相隔碍。无三恶道。彼土众生唯求佛智无二乘名。其佛世尊为诸高行菩萨摩诃萨说清净法。无量无边菩萨眷属。无有破戒邪命着见盲瞎聋痖[病-丙+区]背裸形诸根缺者。皆悉具足二十八相庄严其身。佛寿八小劫。人天之众无中夭者。善男子。彼佛世尊。有如是等无量功德。若欲说法先放光明照曜国土。其诸菩萨遇斯光者。即知世尊将欲说法。我等今者宜应往听。尔时诸天为彼世尊。敷师子座高百由旬。种种严饰无量<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。世尊坐上为众说法。彼诸菩萨聪明利根。一闻悟解无我我所。饮食资粮应念即得。说是胜天王授记法门时。众中五万天人发阿耨多罗三藐三菩提心。皆愿未来生彼国土。尔时胜天王闻佛世尊为其授记。心大欢喜得未曾有。踊在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>高七多罗树。尔时三千大千世界六种震动。诸天伎乐不鼓自鸣。散众天华以供养佛及胜天王。时胜天王从空中下。头面<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>退坐一面</p><p>胜天王般若波罗蜜经现相品第七</p><p>尔时大智舍利弗白胜天王言菩萨摩诃萨行般若波罗蜜。通达法性即应坐道场转法轮。何因缘故先修苦行降伏恶魔。尔时胜天王答舍利弗言。善男子。菩萨摩诃萨行般若波罗蜜实无苦行。为伏外道故示现之。而彼天魔实不能坏。是欲界主故示降伏化诸众生。舍利弗。外道自谓苦行第一。是故菩萨示现苦行能超过彼。舍利弗。或有众生但见菩萨屈一膝立。或见菩萨举两手立。或见菩萨视日而立。或见菩萨五热炙身。或见菩萨倒身而立。或见菩萨卧棘刺床。或卧牛粪或坐方石。或复卧地或见卧板。或卧杵上或卧尘土。或着板衣或着莣衣。或着草衣或树皮衣。或复裸形或着茅衣。或面向日随日而转。或食稗子或见食麦。或食草根杂诸树叶。食果食华或食薯蓣。或见食芋或见食藕。或六日一食或见食豆。或食大豆或食炒谷。或见食麻或见食米。或见饮水而以度日。或见菩萨食一[泳-永+适]苏而以度日。或一[泳-永+适]蜜或一[泳-永+适]乳。或无所食或见眠熟。舍利弗。菩萨摩诃萨。示现如是种种苦行。六年之中一事不亏。菩萨实无如是苦行。众生见有。以诸众生应以苦行而得度脱。为是等故菩萨示之。有六十那由他人安住三乘。舍利弗。复有天人宿世善根深乐大乘。则见菩萨坐七宝台身心不动。面门喜笑入三昧定。如是六年方从定起。舍利弗。复有众生深乐大乘。欲听闻者则见菩萨端坐说法。舍利弗。此是菩萨摩诃萨。以方便力行般若波罗蜜。大悲化度一切众生。能降天魔伏诸外道。菩萨摩诃萨。既经六年从定而起。随顺世法诣尼连禅河。洗浴出已于河边立。有牧牛女构百乳牛。以饮一牛。构此牛乳。用以作糜奉献菩萨。复有六亿天龙夜叉乾闼婆。各持饮食而来奉献。作如是言。大士受我供养。正士受我供养。菩萨悉受。而彼牛女天龙夜叉各不相见。一一天等各见菩萨独受其食。舍利弗。是等众生因见受供而得悟道。是故菩萨为示现之。而此菩萨实不洗浴及受供养。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力示现行诣道场。时有地居天子名曰妙地。与诸天神扫此大地散众妙华。种种香水而用洒之。三千大千世界。须弥山下诸天之众四天王天雨诸天华。三十三天及夜摩天。空中赞叹作诸伎乐。兜率陀天珊兜率陀王。以七宝网弥覆世界。四角皆悬阎浮檀金铃。悉雨众宝供养菩萨。化乐诸天善化王。以阎浮檀金罗网弥覆世界。作诸伎乐雨种种华供养菩萨他化自在诸天子。与诸天龙夜叉乾闼婆阿修罗。伽楼罗紧那罗摩M罗伽人非人等。各各施设种种供养。自在天子与<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>主大梵天王。既见菩萨行诣道场。即告一切诸梵天言。善男子。汝等当知。如此菩萨摩诃萨。坚固大身而自庄严。不违本誓心无厌怠。一切菩萨行悉满足。通达教化无量众生。菩萨诸地皆得自在。于诸众生其心清净善知根性。通达如来甚深蜜藏过诸魔事。一切善根不随外缘。无量诸佛之所拥护。能为众生开<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>门。大将导师摧伏诸魔。大千世界独为勇猛。善施法药为大医王。解脱灌顶受法王位放智慧光。世间八法所不能染如大莲华。通达一切诸陀罗尼甚深如海。安住不动如须弥山。智慧清净无有垢秽。如摩尼珠于一切法而得自在清净梵行。善男子。菩萨摩诃萨修般若波罗蜜。以方便力行诣道场。欲降恶魔坐菩提树。为成就十力四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>十八不共法。转大法轮作师子吼。以法布施令诸众生皆悉饱满。为欲清净众生<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。无上正法降伏外道。欲示诸佛本愿成就。于一切法而得自在。善男子。汝等可往供养菩萨。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力示现行诣道场。足下即现千辐轮相。微妙光明。一切地狱畜生饿鬼遇斯光明。皆悉离苦而得安乐。及照龙宫时有加梨加龙王。遇此光明即告诸龙。此金色光来照龙宫。悉令汝等身心安乐。我于过去曾见此相有佛出兴。今此光明如昔不异。当知必有佛出世间。可辨种种<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>涂香末香。金银真珠车[(王*巨)/木]马瑙珊瑚白玉。旛华幢盖。作诸音乐往诣菩萨宫中。好物悉赍供养。时加梨加龙王与诸眷属。普兴大云降注香雨。往诣菩萨作诸伎乐施设供养。右绕菩萨而赞叹言。金色光明令人喜悦。决定最胜佛出无疑。种种杂宝庄严大地。凡是因地生诸草木悉变成宝。江河皆静无风浪声。推如此瑞佛出无疑。释梵日月光明不现。恶趣清净佛出无疑。譬如有人少失父母。年既长大忽然还得心甚欢喜。一切世间睹佛兴出亦复如是。我等已曾供养过去诸佛世尊。今值法王人中师子。则我受生为不空过。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力取草敷坐。于菩提树右绕七匝<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>端坐。下劣众生见如此相。舍利弗。复有高行诸大菩萨。见八万四千天子敷八万四千大师子座众宝合成。七宝罗网弥覆其上。四角金铃处处皆有。幡华幢盖缯彩罗列。尔时菩萨遍此八万四千座上一一皆坐。而诸天子自不相见。各谓菩萨独坐我座成阿耨多罗三藐三菩提。以是因缘心生欢喜得未曾有。皆证阿鞞跋致舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力即放眉间白毫相光明照诸魔宫。三千大千世界一切魔宫皆失光明。时诸魔等各作是念。以何因缘我等诸宫光明不现。讵非菩萨坐于道场证阿耨多罗三藐三菩提乎。即共观察。方见菩萨端坐道场菩提树下。时诸恶魔于自宫殿聚集魔军。无量千亿种种诸色。种种众形。种种相貌。种种头面。持种种仗。种种幢幡。种种音声。若有闻者耳鼻口中并皆流血。菩萨尔时以大悲力。令魔军众不得出声。舍利弗。是名菩萨摩诃萨行般若波罗蜜方便之力。舍利弗。菩萨行般若波罗蜜。以方便力。无量亿劫行布施持戒忍辱精进禅定智慧。慈悲喜舍。念处正勤。神足根力觉道。奢摩他毗婆舍那。三明解脱。身金色右臂。从顶自摩乃至遍身。作如是言。众生苦恼。我欲济拔而起大悲。尔时魔王及诸眷属。闻菩萨言即皆倒仆。菩萨摩诃萨。以大悲力令诸魔众闻空中声言。汝等可归依持戒力仙。能施无畏救护一切众生。魔及眷属闻此声已。犹伏在地作如是言。唯愿正士大士救济我命。舍利弗。尔时菩萨摩诃萨行般若波罗蜜。以方便力放大光明。其有遇者皆离怖畏。魔及眷属见是神力。恐怖欢喜二事交怀。舍利弗。菩萨摩诃萨行般若波罗蜜。或有众生见是降魔。亦复有人不见此事。或有众生但见菩萨敷草而坐。或见菩萨处大师子宝台而坐。或见菩萨在地而坐。或见空中自然而有师子之座菩萨安坐。或有众生见阿说他树为菩提树。或见波利质多罗树。或见众宝合成为菩提树。或有众生见菩提树高七多罗树。或有众生见菩提树高八万四千由旬。师子之座高四万二千由旬。或有众生遥见菩萨游戏空中。或见菩萨坐菩提树。舍利弗。菩萨摩诃萨行般若波罗蜜以方便力示现如是种种神变化度众生。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力现坐道场。十方恒河沙世界。无量无边菩萨摩诃萨。皆悉来集住虚空中。出是声言。安慰菩萨安乐欢喜。善哉速疾勇猛精进。大吉祥勿生怖惧。心如金刚游戏神通利益众生。一念之顷一切智现。舍利弗。菩萨摩诃萨坐道场时。魔来为乱亦不生嗔。一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>心与般若波罗蜜相应。所知见觉无不通达。舍利弗。时十方恒河沙世界诸佛如来。异口同声赞言。善哉大士。通达自然智。无碍智。平等智。无师智。大悲庄严。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力能作如是种种示现。或有众生。见此菩萨今始成道。或见菩萨久远成道。或见一世界四天王献钵。或见十方恒河沙世界四天王献钵。舍利弗。菩萨尔时度众生故即受众钵。重叠掌中合而为一。其诸天王各不相见。皆谓世尊独用我钵。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力示现此事。说是法门时。众中三万菩萨摩诃萨得无生法忍。三万六千菩萨皆不退转阿耨多罗三藐三菩提。八万人天得远尘离垢法眼净。无量无边众生发阿耨多罗三藐三菩提心。舍利弗。复有六万天子先来献供。过去愿力若菩萨成道。必愿先受我等供养。尔时菩萨摩诃萨以般若波罗蜜方便力故。示现欲转法轮。娑婆世界主尸弃梵王。与六十八万梵天。来世尊所头面作礼。右绕七匝而发是言。唯愿大悲。转无上法轮。唯愿大悲。转无上法轮。尔时即现大师子座高四万二千由旬。种种庄严坚固安隐。十方无量释提桓因。悉为如来敷师子座亦复如是。尔时菩萨以神通力一一诸天各见菩萨坐其座上而转法轮。菩萨摩诃萨既坐此座。十方无量无边世界。皆悉震动放大光明。即入无边境界三昧。十方恒河沙世界一切众生。三恶道苦即得安乐悉离三毒。各各相于犹如母子无复恶心。时此三千大千世界。靡有间隙如一毛孔。天龙夜叉乾闼婆阿修罗伽楼罗紧那罗摩睺罗伽人非人等。悉满其中。若有众生应以苦法而受化者闻佛说苦。应以无我空寂静离无常皆亦如是。应以如幻法而受化者闻说如幻。应以如梦水中月如影如响皆亦如是。应以空无相无愿而受化者。即闻佛说空无相无愿法。或闻如来说一切法从因缘生。或闻说诸阴。或闻说诸界。或闻说诸入。或闻说苦声。或闻说集声。或闻说道声。或闻说念处。或闻说正勤。或闻说神足。或闻说根。或闻说力。或闻说觉。或闻说道。或闻说奢摩他。或闻说毗婆舍那。或闻说辟支佛法。或闻说大乘法。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力示现种种转法轮。令无量众生随其根性欢喜利益。尔时舍利弗白胜天王言。菩萨摩诃萨行般若波罗蜜。以方便力。甚深境界难知难思量难入。尔时胜天王答舍利弗言。菩萨摩诃萨行般若波罗蜜功德胜事。我今所说百分不及一。百千万亿分乃至算数譬喻亦不及一。唯有如来乃能尽说。我今所说其少分者。皆承如来威神之力。何以故。诸佛境界一生补处菩萨摩诃萨尚不能尽。况余菩萨。舍利弗。诸佛境界寂静无说。后无分别智之所能了。舍利弗。菩萨摩诃萨。欲入诸佛境界。应学般若波罗蜜。首楞严三昧。如幻三昧。金刚喻三昧。金刚三昧。不动意三昧。遍通达三昧。不缘境界三昧。师子自在三昧。三昧王三昧。功德庄严三昧。寂静意三昧。超出三昧。无著三昧。意庄严王三昧。无等等三昧。等觉三昧。正觉三昧。悦意三昧。欢喜三昧。清净三昧。火焰三昧。光明三昧。难胜三昧。常现前三昧。不相近三昧。无生三昧。通达三昧。最胜三昧。过魔界三昧。一切智意三昧。幢相三昧。大悲三昧。欢喜三昧。爱念三昧。不见法三昧。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力。通达如是等无量无边百千亿恒河沙数诸三昧已乃能得入诸佛境界。其心安隐恐怖悉无。如师子王不畏禽狩何以故。菩萨摩诃萨。修如是等诸三昧已。有所经游悉无怖畏。不见其前有一怨敌。何以故。舍利弗。菩萨摩诃萨行般若波罗蜜。以方便力心无所缘亦无所住。譬如有<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>无色界。八万四千劫中唯是一识。无有住处亦无所缘。菩萨摩诃萨行般若波罗蜜亦复如是。心无住处亦无所缘。何以故。心不行无行处。心无想无想处。心不缘<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>处。心不着无著处。心不乱无乱处。心无高下心不随顺。又不违逆不喜不忧。无分别离分别。离奢摩他毗婆舍那心不随智。心不自住亦不住他。不依眼住不依耳鼻舌身意住。不依色住不依声香味触法住。心不在内亦不在外。心不缘法心不缘智。不住过去未来现在。舍利弗。菩萨摩诃萨行般若波罗蜜不取一法。于一切法知见无碍。心行净故见一切法。皆悉无垢不取见相。见不分别离诸戏论。舍利弗。菩萨摩诃萨般若波罗蜜。不与肉眼相应。不与天眼相应。慧眼法眼佛眼悉不相应。不与天耳相应。不与他心智相应。不与<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智相应。不与神通智相应。不与漏尽智相应。舍利弗。是般若波罗蜜不与一切法相应非不相应。菩萨摩诃萨行般若波罗蜜。以方便力。于一切法得平等智。能观一切众生心行。一切染净皆如实知于十力四无畏十八不共法佛一切智咸不失念。菩萨摩诃萨行般若波罗蜜。以无功用心通达一切法<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a><a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。常在寂静三昧之中。不舍三昧教化众生。施作佛事无有休息。于诸佛法得无碍智心无染着。舍利弗。譬如化佛更化作佛。彼所化者无心意识。无身身业无口口业无心心业。而能施作一切佛事利益众生。何以故。佛神力故。舍利弗。菩萨摩诃萨从般若波罗蜜所化亦复如是。无身身业无口口业无意意业。以无功用心常作佛事利益众生。何以故。菩萨摩诃萨行般若波罗蜜通达一切法。犹如幻相心无分别。而诸众生恒闻说法。舍利弗。菩萨摩诃萨如是智慧。不住有为不住无为。不住诸阴不住界入不住内外。不住善法及不善法。不住世间及出世间。不染不净。不住有漏不住无漏。不住过去未来现在。不住数缘灭不住非数缘灭。舍利弗。是菩萨摩诃萨。如是行般若波罗蜜心无所住。而能通达一切诸法。以无碍智无功用力为众生说。常在寂静而教化事无有休息。舍利弗。菩萨摩诃萨宿愿强故。无功用心为人说法。舍利弗。菩萨摩诃萨。以般若波罗蜜方便力故无诸怖畏。何以故。执金刚神常守护故。若行若立若坐若卧恒不远之。舍利弗。菩萨摩诃萨。闻说深般若波罗蜜。心不惊不怖不疑不悔。当知是人已得授记。何以故。信受般若波罗蜜。近佛境界故。以此一心则能通达一切佛法。达佛法故利益众生。不见众生与佛法异。何以故。理无二故</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第五卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第五卷</p><p>陈优禅尼国王子月婆首那译</p><p>无所得品第八</p><p>尔时众中有一菩萨摩诃萨。名须真胝。白胜天王言。如来为大王授记乎。胜天王答善思惟菩萨言。善男子。我授记如梦相。又问。大王。如此授记当得何法。答曰。善男子。佛授我记竟无所得。又问。无所得者为是何法。答曰。不得<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>寿者人养育阴界入悉无所得。若善不善。若染若净。若有漏若无漏若<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>若出世间。若有为若无为。若<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>若<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。悉无所得。又问。若无所得用受记为。答曰。善男子。无所得故则得受记。又问若如大王。所说义者则有二智一无所得。二得受记。答曰。若有二者则无授记。何以故。佛智无二诸佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。以不二智受菩萨记。又问。若智不二云何而有授记得记。答曰。得记授记其际不二。又问。不二际者。云何有记。答曰。通达不二际即是受记。又问。大王。住何际中而得授记。答曰。住我际得授记。住众生际<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>际人际得授记。又问。我际当于何求。答曰。当于如来<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>际求。又问。如来解脱际复于何求。答曰。当于无明有爱际求。又问。无明有爱当于何求。答曰。当于毕竟不生际求。又问。毕竟不生际当于何求。答曰。当于无知际求。又问。无知者为无所知。云何于此际求。答曰。若有所知求不可得。以无知故于此际求。又问。此际无言云何可求。答曰。以言语断是故可求。又问。云何言语断。答曰。诸法依义不依语。又问。云何依义。答曰。不见义相。又问。云何不见。答曰。不生分别义。是可依我为能依。无此二事故名通达。又问。若不见义此何所求。答曰。不见不取故名为求。又问。若法可求即是有求。答曰。不尔。夫求法者是无所求何以故。若是可求则为非法。又问。何者是法。答曰。法无文字亦离言语。又问。离文言中何者是法。答曰。文言性离心行处灭。是名为法。一切诸法皆不可说。其不可说亦不可说。善男子。若有所说即是虚妄。中无实法。又问。诸佛菩萨常有言说皆虚妄乎。答曰。诸佛菩萨从始至终不说一字。云何虚妄。又问。若有所说云何过咎。答曰。谓言语过。又问。言语何咎。答曰。谓思量过。又问。何法无咎。答曰。无说所说不见二相。是则无咎。又问。过何为本。答曰。能执为本。又问。执何为本。答曰着心为本。又问。着何为本。答曰。虚妄分别。又问。虚妄分别以何为本。答曰。攀缘为本。又问。何所攀缘。答曰。缘色声香味触法。又问。云何不缘。答曰。若离爱取则无所缘。以是义故如来常说诸法平等。说此法门时。众中五千<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>得远尘离垢<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。一万二千菩萨得无生法忍。无量无边众生发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。尔时胜天王即从座起。偏袒右肩右膝着地。合掌向佛头面作礼。而白佛言。世尊。善男子善女人。闻是般若波罗蜜。云何未发阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心者即能<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。皆悉成就得不退转。行常胜进而无堕落。佛告胜天王言。大王。谛听善思念之。当为王说。善男子善女人闻般若波罗蜜。行得胜进无有退堕。胜天王言善哉世尊。唯然愿闻。佛告胜天王言。大王。若善男子善女人。闻般若波罗蜜。以清净意发阿耨多罗三藐三菩提心。具足正信亲近贤圣乐闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。远离嫉妒无有悭吝。常修寂静好行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。心无隔碍恒离秽浊。正信业果心不疑惑知黑白报。设为身命不应作者终不为之。大王。善男子善女人。如是行般若波罗蜜。则远离<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>不与取邪淫<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>两舌恶口绮语贪嗔邪见。心常系念此十善法。大王。善男子善女人行般若波罗蜜。以方便力。若见<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。正行<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>戒品清洁。多闻解义常起<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。心性调伏寂静不散。口恒爱语远离诸恶不善之法。修习众善。不自矜高于他不下。不作恶口及无义语。不舍念处其心调直。能断有流善拔毒箭舍离重担。超出有难已度后有。大王。善男子善女人。行般若波罗蜜若见如是菩萨摩诃萨则应亲近依止。是人为善知识。菩萨摩诃萨。以方便力而为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。善男子。施得大富持戒生天听法大智。又复告言。此是布施此是施报。此是嫉妒是嫉妒报。此是忍辱是忍辱报。此是精进是精进报。此是<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>是禅定报。此是般若是般若报。此是愚痴是愚痴报。是身善业身善业报。是身恶业身恶业报。是口善业口善业报。是口恶业口恶业报。是意善业意善业报。是意恶业意恶业报。诸善男子善女人。此法应作此不应作。若如是修致长夜乐。不如是作得长夜苦。大王。善男子善女人。以方便力亲近善知识。得闻如是次第说法。菩萨摩诃萨。若知彼人是<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>者。则应为说甚深般若波罗蜜。所谓空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无愿无作。无生无灭。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无众生。无命无人。而说甚深<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>法。因此法彼法生。此法灭彼法灭。所谓无明缘行。行缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老死忧悲苦恼。无明灭则行灭。行灭则识灭。识灭则名色灭。名色灭则六入灭。六入灭则触灭。触灭则受灭。受灭则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老死忧悲苦恼灭。大王。菩萨摩诃萨行般若波罗蜜。以方便力作如是说。于真实中无有一法可生可灭。何以故。世间诸法皆因缘生。无我作者因缘和合。无一实法受生灭者。虚妄分别于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>中但有假名。随业<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>而受<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。若以般若波罗蜜。如实观察一切诸法。无生无灭无作受者。若法无作是亦无行。则于诸法心无所著。谓不着色受想行识。不着眼色识。不着意法识。大王。菩萨摩诃萨作如是说。一切诸法<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>空离不取不着。善男子善女人。因如是说则无退失。大王。菩萨摩诃萨行般若波罗蜜。乐见诸佛乐闻正法。不堕卑贱。在所生处不离见佛。听受正法<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>众僧。面见诸佛勇猛精进。志求正法不著有为。妻子仆隶生生所资。悉不贪着不染诸欲。常依正教忆念诸佛。离俗<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>如闻<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。转为他说心无求望。见听法众常生大慈。一切众生而起大悲。多闻广学不惜身命。少欲<a href=\"/remen/zhizuchangle.html\" class=\"keylink\" target=\"_blank\">知足常乐</a>远离。但采义理不滞言辞。说法修行不为自身。唯化众生得无上乐。所谓佛智。大王。菩萨摩诃萨行般若波罗蜜如是修行。远离放逸摄护诸根。若眼见色不着色相。如实观察此色过患。耳声鼻香舌味身触意法亦尔。若纵诸根名为放逸。若能摄护名不放逸。菩萨摩诃萨行般若波罗蜜。调伏自心将护他意名不放逸。远离贪欲心顺善法。觉观嗔痴不善根本。身恶口恶及以邪念。一切不善皆悉远离名不放逸。菩萨摩诃萨行般若波罗蜜。心常正念名不放逸。大王。菩萨摩诃萨行般若波罗蜜。一切诸法信为其首。正信之人不生恶趣。心不行恶<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>所赞。大王。菩萨摩诃萨行般若波罗蜜<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>修行。在在生处常得值佛。远离二乘安住正道得大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>成就大事如来正智。菩萨摩诃萨行般若波罗蜜。欲求安乐当勤随顺萨婆若路。大王。今此大众得闻深般若波罗蜜。已于过去无量百千万劫。供养诸佛修习善根。是故应当勤加精进勿令退失。大王。若天若人能制诸根不着五欲。远离世间常修出世。三业清净习助道法名不放逸。大王。菩萨摩诃萨行般若波罗蜜。正信具足心不放逸。勤修精进令得胜法名不放逸。大王。菩萨摩诃萨欲具正<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>不放逸。精进正念当学般若波罗蜜。因是念智。能速成就阿耨多罗三藐三菩提法。大王。菩萨摩诃萨行般若波罗蜜。具足正信心不放逸。勤修精进即得正念。用是念智知有知无。云何有无。若修正行得正解脱。是名为有。若修邪行得正解脱。是名为无。眼耳鼻舌身意。世谛为有真实中无。菩萨摩诃萨。勤修精进能得菩提。是名为有。懒惰菩萨得菩提者。是名为无。若说<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>皆从虚妄颠倒而生。是名为有。若谓世法不从因缘自然生者。是名为无。色是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦败坏法。是名为有。若言常乐。非败坏法。是名为无。受想行识亦复如是。无明缘行。是名为有。若离无明而行生者。是名为无。行缘识乃至生缘老死忧悲苦恼皆亦如是。施得大富。是名为有。施得贫穷。是名为无。清净持戒得生善道。是名为有。若生恶趣。是名为无。乃至般若波罗蜜能得成圣。是名为有。修行般若波罗蜜作凡夫者。是名为无。若修多闻能得大智。是名为有。得愚痴者。是名为无。若修正念能得出离。是名为有。不得为无。若行邪念不得出离。是名为有。得者为无。无我我所能得解脱。是名为有。有我我所而得解脱。是名为无。若言<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>遍一切处。是名为有。五阴中我。是名为无。如实修智能得解脱。是名为有。若着邪智而得解脱。是名为无。若离我见众生见寿者见人见能得空智。是名为有。着我众生寿者人见能得空智。是名为无。大王。菩萨摩诃萨行般若波罗蜜。如是知世有无能修平等。了知诸法因缘而生世谛故有不起常见。知因缘法本性自空不生断见。于诸<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>如实通达。大王。诸佛如来略为菩萨说是四法。世间沙门婆罗门及长寿天心皆着常。为破此执说行无常。有诸<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>多贪着乐。为破此计说一切苦。外道邪见着身中我。为破此执而说无我。又复为破增上慢人。是故而说涅槃寂静。说无常者令其志求究竟之法。为说苦者令离愿求。说无我者为显空门。说寂静者令达无相。大王。菩萨摩诃萨行般若波罗蜜如是修学。于诸善法终无退堕。速成阿耨多罗三藐三菩提。尔时胜天王白佛言。世尊。菩萨摩诃萨行般若波罗蜜。修何等行拥护正法。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜行不违言。敬重尊长随顺正法。心行调直诸根寂静。远离众恶不善之法修习善根名护正法。大王。菩萨摩诃萨行般若波罗蜜。修身业慈悲。口业慈悲。意业慈悲。不求名利持戒清白远离诸见。名护正法。大王。菩萨摩诃萨行般若波罗蜜。不随爱行。不随嗔行。不随痴行。不随畏行。名护正法。大王。菩萨摩诃萨行般若波罗蜜。修习惭愧。名护正法。大王。菩萨摩诃萨行般若波罗蜜。说法修行悉如所闻。名护正法。大王。三世诸佛为护正法。是故拥护天王人王令法久住。说是陀罗尼</p><p>多侄他阿吼罗(理我反下悉同)吼罗婆(蒲我反下悉同)底(都覆反下悉同)厚罗拏(弩假反下悉同)莎臼茶(杜假反)柘柘柘柘柘祢(宁履反下悉同)富拏簉多(睹舸反下悉同)叉多(不分句【三】)叉延多叉也莎摩(暮舸反下悉同)奢摩祢柯罗(不分句【宋】)瓯楼(不分句【宋】)瓯楼婆底杞(枯履反)罗婆底金(季侵反)阿毗(彭履反)奢底(分句【元】【明】)祢莎罗祢[禾*土]阇[禾*土][禾*土]摩底阿婆柂祢(分句【三】)婆柂跋多(不分句【宋】)跋多羺莎(分句【元】【明】)履裒多羺悉蜜履底(分句【元】【明】)提婆多(分句【元】【明】)羺悉蜜履底</p><p>若龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽。一切众生皆得安隐。大王。此大神咒。三世诸佛。为护正法。拥护天王人王。宜应诵持。怨贼恶难魔障正法皆悉消灭。诸佛如来为令正法久住世故。护天人王使其<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。说是般若波罗蜜神咒法门时。一切天宫大地诸山大海皆悉震动。众中八万众生发阿耨多罗三藐三菩提心。尔时胜天王。以七宝网弥覆佛上。而白佛言。世尊。菩萨摩诃萨行般若波罗蜜。修何等法于阿耨多罗三藐三菩提心不移动。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜。修无碍大慈无厌大悲成办大事。勤加精进学空<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>修平等智。以方便力则能通达清净大智。明了如实三世平等无有障碍。履三世佛所行之道。大王。菩萨摩诃萨行般若波罗蜜。修如是法于阿耨多罗三藐三菩提心不移动。胜天王白佛言。世尊。菩萨摩诃萨云何行般若波罗蜜。闻佛不思议事。不怖不畏不惊不悔。佛告胜天王言。大王。菩萨宜应具足般若具足阇那。近善知识乐闻深法。了知诸法皆悉如幻悟世非常。心不住着犹如虚空。知一切法生必有灭。大王。菩萨摩诃萨行般若波罗蜜。修如是法闻佛不思议事。不怖不畏不惊不悔。胜天王白佛言。世尊。云何菩萨摩诃萨行般若波罗蜜。于一切处而得自在。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜。修五<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。具足无碍诸解脱门。四禅四无量心方便。般若波罗蜜于一切处而得自在。胜天王白佛言。世尊。菩萨摩诃萨行般若波罗蜜得何等门。佛告胜天王言大王。菩萨摩诃萨行般若波罗蜜。得阇那门。能入众生诸根利钝。得般若门分别句义。得陀罗尼门总知一切语言音声。得无碍门说法不尽。大王。是名菩萨摩诃萨行般若波罗蜜得是诸门。胜天王白佛言。世尊。菩萨摩诃萨行般若波罗蜜得何等力。佛告胜天王言。大王。得寂静力。成就大悲故。得精进力。成就阿鞞跋致故。得多闻力。成就大智故。得信乐力。成就解脱故。得修行力。成就出离故。得忍辱力。爱护众生故。得菩提心力。断除我见故。得大悲力。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生故。得无生忍力。成就十力故。大王。菩萨摩诃萨行般若波罗蜜。成就如是等力。说是法门时。众中五百菩萨得无生法忍。八千天子得阿鞞跋致。一万二千天子得远尘离垢法眼净。四万人天发阿耨多罗三藐三菩提心</p><p>胜天王般若波罗蜜经证劝品第九</p><p>尔时佛告胜天王言。过去之世阿僧祇阿僧祇劫。不可数不可思量。此时有佛。名<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>宝王如来应供正遍知明行足善逝世间解无上士调御丈夫天人师佛世尊。国名宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。劫名善观。时世丰乐无诸疾恼。人天往来不相隔碍。地平如掌无有山陵堆阜荆蕀生诸细草柔软青绀如孔雀毛。长可四寸。下足则靡举步随升。种种名花。须摩那花薝卜伽花。及余软草皆悉周遍。不寒不热四时调和。纯青琉璃以成其地。世界众生心性柔和。善伏三毒不随之行。时功德宝王佛。有声闻众一万三千那由他人。菩萨摩诃萨众六十二亿人。时人寿命三十六亿那由他岁无复中夭。有一国土名无垢庄严。其城南北广一百二十八由旬。东西八十由旬。十千园苑以为严饰。十千小国周遍围绕。转轮圣王名曰治世。七宝具足王四天下。已曾供养无量诸佛深种善根。不退阿耨多罗三藐三菩提心。有四园苑。妙花庄严功德悦意。孔雀游戏四时适乐。城壁厚十六由旬。门堞楼观悉用七宝。有四大池皆广半由旬。七宝为岸阎浮檀金以成阶道底布金沙。池中之水具八功德生宝莲华。凫雁鹅鹤鸳鸯猩猩游戏其中。岸列诸树白檀赤檀尸梨沙等。上有鹦鹉<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。迦鸟翔集游戏。王之内宫七十千人相貌端正承事宝女。咸悉发心向阿耨多罗三藐三菩提。王有千子。大力勇健能摧怨敌。具二十八大丈夫相庄严其身。悉已发心向阿耨多罗三藐三菩提。尔时功德宝王如来。与无量天龙夜叉揵闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等。前后围绕入无垢庄严大城。治世圣王。即与七宝千子宫人奉迎世尊。施设种种微妙供养。尔时世尊及诸大众。受供养已还归本处。王与七宝千子内人。出城奉送亦即还宫。时治世王忽自叹曰。人身无常富贵如梦。诸根不缺正信甚难值佛闻法如优昙华。时彼千子知其父王恋仰世尊乐闻正法。即为营造牛头栴檀七宝庄严妙台。其香一两直阎浮提。此台东西广十由旬。南北十三由旬。四角大柱众宝庄严。一千宝轮。诸子将送奉献圣王。时王受已而赞叹曰。善哉诸子。我欲诣佛听受正法。尔时千子于此台中造师子座。安处圣王及诸宫人。其台四边悬缯幡盖。覆七宝网角垂金铃。种种诸华。薝卜伽华。须摩那华。优钵罗华。拘勿头华。分陀利华。迦摩罗华。而散台上。烧无价香。泥香涂之。末香以散。尔时千子共捧此台人各一轮。飞腾虚空犹如鹅王。往诣佛所安详不摇。至地徐下即到佛前。头<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>足。右绕世尊及诸大众。凡七匝已退立一面。尔时圣王及诸宫人。从宝台下。王脱宝冠各脱革屣。至世尊前顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足。右绕世尊及诸大众。凡七匝已退坐一面。尔时宝庄严王佛。即告之言。圣王。今来听正法乎。尔时治世圣王。即从座起齐整衣服头顶礼足而白佛言。世尊。所说正法何者是乎。尔时世尊赞治世王言。善哉善哉。能为利益无量天人作是深问。如来应供正遍知。当为大王分别解说。治世圣王即白佛言。世尊。唯然愿闻。尔时佛告治世圣王言。大王。菩萨摩诃萨行般若波罗蜜。通达一切法名为正法。所谓<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>四正勤四如意足。五根五力七觉分八圣道分。空无相无愿。通达平等名为正法。治世圣王白佛言。世尊。菩萨摩诃萨。云何行般若波罗蜜。于大乘中恒得胜进而不退堕。佛告治世圣王言。大王。菩萨摩诃萨行般若波罗蜜。因正信故而得胜进。何者正信。知一切法不生不灭自性寂静。常能亲近正行之人。不应作法终不造作。心离散乱听受正法。不见说者不见我听。勤修精进令得神通。身心轻举教化众生。不见我有神通能化众生受化。何以故。大王。菩萨摩诃萨行般若波罗蜜。不见我不见众生二处平等。则得胜进而不退堕。大王。菩萨摩诃萨行般若波罗蜜。摄护诸根不令取着。一切资生起无常想。知法寂静命如假借。大王。菩萨摩诃萨如是行般若波罗蜜。于大乘中心不放逸。大王。菩萨摩诃萨行般若波罗蜜。于其梦中尚不忘失菩提之心。教化众生令修佛道。一切善根<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>阿耨多罗三藐三菩提。见佛神力<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>赞叹。大王。菩萨摩诃萨。如是行般若波罗蜜。则能速成阿耨多罗三藐三菩提。是故大王。当勤精进莫生放逸。菩萨摩诃萨。欲求法者勿着五欲。大王。一切凡夫于欲无厌。得圣智者则能舍弃。人身无常寿命短促。是故大王。应离世间求出世道。大王。今者供养如来所得善根。应作如是四种回向。自在无尽。法无尽。智无尽。辩才无尽。此四回向与般若波罗蜜同皆悉无尽。大王。菩萨摩诃萨行般若波罗蜜。应净身口意戒。何以故。为<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>故。以方便力教化众生。以般若力降伏诸魔。愿力成就行不违言。尔时治世转轮圣王。闻佛所说甚深般若波罗蜜。心生欢喜得未曾有。即取宝冠自解璎珞供养如来。舍四天下皆以奉佛作如是愿。常修梵行学此甚深般若波罗蜜。以决定心趣向阿耨多罗三藐三菩提。王宫女人闻佛说法。皆生欢喜发菩提心。脱上分衣及宝缨络供养如来。治世圣王。即舍宝台以奉上佛而求出家。尔时功德庄严王佛。赞治世转轮圣王言。善哉善哉。大王。今日所行不违昔愿。大王。善修布施持戒忍辱精进禅定<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。过去诸佛已修此法得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。未来诸佛亦修此法当得成佛。尔时治世圣王白佛言。世尊。菩萨摩诃萨修行布施。为与般若波罗蜜异不。佛告治世圣王言。大王。夫布施者。若无般若波罗蜜。但名为檀非波罗蜜。以般若波罗蜜故。乃得名为檀波罗蜜。持戒忍辱精进禅定智慧亦复如是。何以故。般若波罗蜜性平等故。功德庄严故。佛说是法时。治世圣王得无生法忍。佛告胜天王言。菩萨摩诃萨行般若波罗蜜应如彼王。尔时治世转轮圣王即然灯佛是。其王千子贤劫千佛是。尔时胜天王白佛言。世尊。云何菩萨摩诃萨行般若波罗蜜。修学速成阿耨多罗三藐三菩提道。佛告胜天王言。大王。菩萨摩诃萨行般若波罗蜜修习大慈。于诸众生不起恼心。具足勤行诸波罗蜜。及以四摄四无量心助菩提法。修学神通了达优波憍舍罗。一切善法无不修满。如是<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>则能速成阿耨多罗三藐三菩提。大王。菩提道者。所谓信心。清净心。离谄曲心。行平等心。施<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>心。令诸众生咸悉亲附。勤行布施果报不尽。坚持净戒而无障碍。修行忍辱离诸嗔恼。勤加精进修行则易。以有禅定不起散乱。具足般若能善通达。有大悲故终无退转。有大喜故能悦彼心。修行大舍不起分别。无三毒故离诸棘刺。不着色声香味触故灭诸戏论。无烦恼故远离怨敌。舍二乘念其心广大。具一切智能出众宝。大王。菩萨摩诃萨行般若波罗蜜。如是学者速成阿耨多罗三藐三菩提。尔时胜天王白佛言。世尊。菩萨摩诃萨行般若波罗蜜。现何色貌教化众生。佛告胜天王言。菩萨摩诃萨行般若波罗蜜。示现色形无有定相。何以故。随诸众生心之所乐。即见菩萨色貌。如是或现金色。或现银色。或颇梨色或琉璃色。或马瑙色。或车[(王*巨)/木]色。或真珠色。青色黄色赤色白色。或日月色。火色。焰色。帝释色。梵王色。霜色。雌黄色。朱色。薝卜伽色。须摩那色。婆利师迦色。波头摩色。拘勿头色。分陀利色。功德天色。鹅色。孔雀色。珊瑚色。如意珠色。虚空色。天见是天人见是人。大王。十方恒河沙世界中。一切众生色形相貌。菩萨摩诃萨悉现如是。何以故。菩萨摩诃萨行般若波罗蜜。不舍一众生故遍能摄取。何以故。一切众生心各不同。是故菩萨种种示现。何以故。菩萨摩诃萨。过去世中有大愿力。随诸众生心所乐见而受化者。即为示现所欲见身。大王。如净明镜本无影像。随诸外色若好若丑。种种悉现。亦不分别我体明净能现众色。菩萨摩诃萨行般若波罗蜜亦复如是。无功用心随众生乐。种种示现悉令悦彼。而不分别我能现身。大王。菩萨摩诃萨行般若波罗蜜。于一座中随诸听众。或见菩萨说法。或见佛说法。或见辟支佛说法。或见声闻说法。或见帝释。或见梵王。或见摩醯首罗。或见围纽天。或见四天王。或见转轮圣王。或见沙门。或见婆罗门。或见刹利。或见毗舍首陀。或见<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>。或见长者。或见坐宝台中。或见坐莲华上。或见行在地上。或见飞腾虚空。或见说法。或入三昧。大王。菩萨摩诃萨行般若波罗蜜为度众生。无一形相及一威仪不示现者。大王。般若波罗蜜。无形无相。犹如虚空遍一切处。譬如虚空无诸戏论。般若波罗蜜亦复如是过诸语言。又如虚空世所受用。般若波罗蜜亦复如是。一切凡圣之所受用。又如虚空无有分别。般若波罗蜜亦复如是无分别心。譬如虚空容受众色。般若波罗蜜亦能容受一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。譬如虚空能现众色。般若波罗蜜亦复能现一切佛法。譬如空中一切草木众药华果依之增长。般若波罗蜜亦复如是。一切善根依之增长。譬如虚空非常无常非言语法。般若波罗蜜亦复如是。非常无常悉离言语。大王。世间沙门婆罗门。若释若梵。无能思量般若波罗蜜者。大王。般若波罗蜜无有一法可为譬喻。若善男子善女人。信受般若波罗蜜者。所获功德不可思量。若此功德有色形者空界不容。何以故。般若波罗蜜出生世间及出世间一切善法。若人若天若天人王。若须陀洹向须陀洹果。乃至阿罗汉向阿罗汉果。辟支佛道。菩萨十地。十波罗蜜。诸佛阿耨多罗三藐三菩提。一切种智。十力四无畏。十八不共法。皆从般若波罗蜜生。说是法门时。众中五万菩萨摩诃萨得不退转。一万五千天子得无生法忍。一万二千天人得远尘离垢得法眼净。恒河沙数众生发阿耨多罗三藐三菩提心。诸天空中作众伎乐不鼓自鸣。散众天华供养如来般若波罗蜜。天龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等。散种种华及诸宝物。供养世尊般若波罗蜜。异口同音一时赞曰。善哉善哉。世尊。快说般若波罗蜜</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第六卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第六卷</p><p>陈优禅尼国王子月婆首那译</p><p>述德品第十</p><p>尔时文殊师利菩萨摩诃萨。即从座起偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。菩萨摩诃萨。于几劫数行般若波罗蜜。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>几佛而能如是对扬如来。说甚深般若波罗蜜如胜天王。尔时佛告文殊师利菩萨摩诃萨。善男子。如此之事不可思量。若非无数百千亿劫修习众行种善根者。则不闻是般若波罗蜜名。善男子。十方恒河沙世界中。诸恒河沙数尚可知。是菩萨摩诃萨。几劫行般若波罗蜜。供养几佛数不可知。文殊师利。过去无量无边阿僧祇不可思议劫。尔时有佛。名曰多闻如来应供正遍知明行足善逝<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊。国名日光。劫名增上。时多闻佛。为诸菩萨摩诃萨说清净法门。诸善男子。勤修<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>莫顾身命。时彼会中有一菩萨摩诃萨。名曰进力。即从座起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。世尊。所说勤修精进莫顾身命如我解佛所说义者。菩萨摩诃萨。应当<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>尔乃速成阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。何以故。菩萨摩诃萨若勤精进。是则不能久住<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。菩萨摩诃萨行般若波罗蜜。断伏<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>久住生死。终无自度速证<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>不化<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。世尊。菩萨摩诃萨。处生死中用之为乐。不以涅槃而为乐也。何以故。世尊。菩萨摩诃萨。利众生事以之为乐。随彼所乐即用方便。说种种法令得安乐。若证漏尽不能利益一切众生。世尊。是故菩萨观察生死起大悲心。不舍众生成就本愿。世尊。菩萨摩诃萨。具方便力久住生死。得见无量无边诸佛。及闻无量无边<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>无量无边众生。是故菩萨摩诃萨。不厌生死不乐涅槃。世尊。菩萨摩诃萨若观生死而起惊怖则堕非道。不能利益一切众生。通达如来甚深境界。云何非道。所谓贪乐声闻辟支佛地。于诸众生无大悲心。何以故声闻辟支佛道。即非菩萨摩诃萨道。何以故。声闻缘觉怖畏生死求速出离。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a><a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>则不具足。以是义故。非<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。尔时多闻世尊赞进力菩萨摩诃萨言。善哉善哉。善男子。如汝所说。菩萨摩诃萨。应修自行勿习非道。进力菩萨白佛言。世尊。何者是菩萨摩诃萨自所行道。尔时多闻世尊告进力菩萨摩诃萨言。善男子。菩萨摩诃萨。成就一切功德智慧。以大悲力不舍众生。远离声闻辟支佛地。得无生智不舍三有。心无求望而增善根。方便<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>诸波罗蜜。以智慧力无分别心。生诸善根成就尽智。无量功德。无一法生方便现生。无一众生方便教化。知一切法皆<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>离。观诸佛国犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。而以方便严净佛土。知一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>身无像。方便示现相好<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。随诸众生心所须欲。即能应与。菩萨身心常寂静离。而为众生种种<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。亦以方便远离喧挠。修诸<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>知自性空。悉能通达甚深智慧。而以方便为他说法。不证声闻辟支<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。求佛<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>不舍菩萨一切道行。善男子。是名菩萨摩诃萨道。文殊师利。进力菩萨从多闻世尊。闻说菩萨所行境界得未曾有。即白佛言。希有世尊。如我解佛所说义者。菩萨摩诃萨具足方便。一切诸法无非其道。世尊。譬如虚空悉能容受一切众色。如是菩萨具足方便所行之道摄一切法。又如虚空树木药草果树香树因之增长。如是诸物不染虚空亦不能净。不能令嗔亦不令喜。如是菩萨摩诃萨。有方便般若波罗蜜。缘一切法皆悉是道。若凡夫法。若学人法。辟支佛法。若菩萨法。若如来法。何以故。菩萨摩诃萨悉通达故。又譬如火若遇树木竹草必无退还。是等草木皆利益火发其光明。诸法亦尔。悉是菩萨摩诃萨道。譬如金刚自体坚密。刀不能斫。火不能烧。水不能烂。毒不能害。菩萨摩诃萨方便智慧。声闻缘觉及诸外道。一切烦恼所不能坏。世尊。如清水珠若在浊水即为之清。菩萨摩诃萨。般若波罗蜜珠。能使一切众生烦恼悉得清净。世尊。譬如妙药珠宝毒不共居能消众毒。菩萨摩诃萨行般若波罗蜜方便。不与一切烦恼共俱悉能断灭。世尊。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。一切诸法皆是菩萨摩诃萨道。文殊师利。进力菩萨说是法门时。众中八千菩萨发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。二百菩萨得无生法忍。文殊师利。过去多闻佛所进力菩萨。今胜天王是。尔时文殊师利菩萨白佛言。世尊。云何菩萨摩诃萨行般若波罗蜜。得坚固力拥护正法。佛告文殊师利菩萨言。善男子。菩萨摩诃萨。宁弃身命不舍正法。于他卑恭不起憍慢。无势力人之所耻辱其心能忍。饥渴众生即便惠施最胜饮食。在厄难者施其<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。于诸疾病<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>疗治。贫穷众生令丰财宝。诸佛塔庙白灰泥涂。恶事则掩光扬善事。苦恼众生则施安乐。文殊师利。菩萨摩诃萨行般若波罗蜜。修如是行得坚固力拥护正法。文殊师利菩萨白佛言。世尊。菩萨摩诃萨行般若波罗蜜。云何能调伏心。佛告文殊师利菩萨言。菩萨摩诃萨行般若波罗蜜。不滥他事先思后行。心性调直离谄曲行。不自矜高意常柔软。文殊师利。菩萨摩诃萨。如是<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>能调伏心。文殊师利菩萨白佛言。世尊。菩萨摩诃萨行般若波罗蜜。修是等行当生何道。佛告文殊师利菩萨言。菩萨摩诃萨如是行般若波罗蜜者。或生天中。或生人中。若生天中则为帝释值佛出世。或大梵王娑婆国主值佛出世。若生人中作转轮圣王长者<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>值佛出世。文殊师利。菩萨摩诃萨。调伏心行得如是生。文殊师利菩萨白佛言。世尊。正信流出何法。佛告文殊师利菩萨。正信流出得善知识。世尊。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>流出何法。佛言。流出大富。世尊。多闻流出何法。佛言。流出般若波罗蜜。世尊。持戒流出何法。佛言。流出一切善道。世尊。忍辱流出何法。佛言。流出容受众生。世尊。精进流出何法。佛言。能成就一切佛法。世尊。思惟流出何法。佛言。流出寂静。世尊。般若流出何法。佛言。般若流出离一切烦恼。世尊。听法流出何法。佛言。流出远离疑网。世尊。如法问流出何法。佛言。出决定智。世尊。住寂静流出何法。佛言。流出禅定及诸<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。世尊。正修流出何法。佛言。流出厌离道。世尊。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>声流出何法。佛言。流出无所摄护。世尊。苦声流出何法。佛言。流出无生。世尊。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>声流出何法。佛言。流出灭我我所。世尊。空声流出何法。佛言。流出寂静。世尊。<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>流出何法。佛言。流出圣<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。世尊。圣心离流出何法。佛言。流出<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>神通。世尊。圣道流出何法。佛言。流出圣果。世尊。信乐流出何法。佛言。流出成就诸解脱。世尊。佛生流出何法。佛言。流出一切助菩提法。尔时胜天王白佛言。世尊。云何佛生。佛告胜天王言。如发菩提心。世尊。云何发菩提心。佛言。大王。如生大悲。世尊。云何生大悲。佛言。不舍一切众生。世尊。云何不舍一切众生。佛言。如不舍<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。世尊。谁不舍三宝。佛言。无烦恼者。尔时胜天王白佛言。希有世尊。希有修伽陀。诸佛世尊如是秘密甚深微妙。常说一切法空无生无灭寂静。不破所修<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a><a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>远离断常。世尊。于世界中颇有众生闻如是法。不起正信敬重之心生毁谤不。世尊。是等众生过去之世。因由善业得受人身。亲近恶知识故。不信如是甚深之法。则为孤负过去善业。诸佛世尊恩德深重。假使自割身肉出血供养如来。亦不能报以佛恩故。我等今日增长善根。得大法乐住大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。世尊。菩萨摩诃萨行般若波罗蜜。应知佛恩。近善知识。当<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>行令得佛果。说是法时。众中二万五千菩萨得无生法忍。四万五千人天发阿耨多罗三藐三菩提心。一万二千天子得远尘离垢<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净</p><p>现化品第十一</p><p>尔时善思惟菩萨摩诃萨白胜天王言。如来所造化佛更能化不。尔时胜天王答善思惟菩萨言。今对世尊以为明证。佛所化佛更能化作恒河沙数无量化佛种种色相。神通说法利益众生。善男子。诸佛宿世愿力清净故能如是。善思惟菩萨白胜天王言。大王。善说甚深之法。诸佛宿世愿力清净。唯愿大王。请佛神力。令此般若波罗蜜久住世间无有隐没。胜天王答善思惟菩萨言。善男子。般若波罗蜜一切诸佛之所护持。何以故。文字所说般若波罗蜜。如是文字不生不灭无有隐没。字所显义亦不生不尽无有隐没。善男子。诸佛如来甚深般若波罗蜜亦不隐没。何以故。法不生故。若法无生此则无灭。即是如来秘密之教。若佛出世若佛不出性相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。是名法界。亦曰如如。名不异际随顺因缘而不违逆。是为正法。其性常住无有隐没善思惟菩萨白胜天王言。大王。能护正法是何等人。胜天王答善思惟菩萨言。善男子。若不违逆一切法者。名护正法。何以故。无有诤论不违道理。名护正法。又问。云何不违道理。答曰。若顺文字不违道理无所诤论。名护正法。何以故。世间凡夫皆着诸见。顺道理者则常说空。是故世间而起诤论。如是凡夫爱重有法。顺道理者于此则轻。世间说有常乐我净。顺道理者说无常苦不净无我。是故世间而生诤论。善男子。一切凡夫顺世间流。顺道理者逆世间流。是故世间则生诤论。一切凡夫着阴界入。顺道理者说一切法悉无所著。是故世间而起诤论。善男子。随顺世者不行道理。顺道理者与世相违。善思惟菩萨白胜天王言。大王。今者取何等法。胜天王答善思惟菩萨言。我不取人不取法。又问。云何不取。答曰。我离众生离法离。是离悉不可得。过去未来现在离。离不可得。诸佛离诸佛不离。佛国土离国土不离。法离法不离。善男子。如是之行名顺道理无取不取。尔时善思惟菩萨赞胜天王言。善哉大士。善哉正士。能说如是甚深般若波罗蜜。无取无著无名无字。灭诸戏论。离能分别及所思惟。尔时众中有一天子。名曰贤德。即从坐起偏袒右肩右膝着地。合掌向佛头面作礼而白佛言。世尊。如胜天王所说无分别者为是何法。佛告贤德天子言。无分别法即是寂静。何以故。取可取无。离我我所。不起不息。是名无分别法。善男子。菩萨摩诃萨。如是观者能护正法。不见能护及以所护。说此法时。众中十千<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>心得解脱。一千天子得远尘离垢法眼净。尔时善思惟菩萨白胜天王言。何等辩才能如是说甚深之法。胜天王答善思惟菩萨言。善男子。一切烦恼习性无者。所得辩才能如是说。过言语道不可名宣第一义智。如是辩才能作此说。尔时善思惟菩萨问贤德天子言。善男子。云何无生法中以辩才说。尔时贤德天子答善思惟菩萨言。菩萨摩诃萨。不住无生无灭法中。则无辩才说甚深法。何以故。远离戏论不见所缘不见能缘。心无所住是故能说。不住人法不住此彼。唯住清净第一义谛。是故能说。尔时善思惟菩萨即白佛言。世尊。贤德天子甚为希有。乃能通达甚深之法辩才无尽。佛告善思惟菩萨言。善男子。此贤德天子。从妙喜世界不动佛所。而来至此<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>。听受甚深般若波罗蜜。佛复告善思惟菩萨言。贤德天子。已于过去无量百千亿劫。修习陀罗尼门。穷劫说法亦无终尽。善思惟菩萨白佛言。世尊。何等陀罗尼。佛言。善男子。名众法不入陀罗尼。善男子。此陀罗尼过诸文字。言不能入心不能量。内外众法皆不可得。善男子。无有少法能入此者。故名众法不入陀罗尼。何以故。此法平等无有高下亦无出入。无一文字从外来入。亦无一字从此法出。又无一字住此法中。亦无文字共相见者。亦不分别法与非法。是诸文字说亦不减不说无增。从本以来无起造者无坏灭者。善男子。如文字心亦如是。如心一切法亦如是。何以故。法离言语亦离思量。本无生灭故无出入。是名众法不入陀罗尼。若能通达此法门者辩才无尽。何以故。通达不断无尽法故。善男子。能入虚空者则能入此陀罗尼门。善男子。菩萨摩诃萨。能通达此陀罗尼门。心得清净身口亦尔。所行附理般若坚固。一切众魔无有能乱。一切外道不敢视瞻。一切烦恼莫之能坏。身力成就心离怯弱。所说无尽能宣甚深一切圣谛。智慧多闻犹如大海。安住三昧喻须弥山。处众无畏如师子王。世法不染犹彼莲华。利益众生譬之大地洗诸垢秽喻如大水。成熟世间以方大火。清凉平等能悦众心。类之如月。能破诸暗譬其以日。摧烦恼怨名为勇健。心性调伏犹如大龙。能震法雷大云为喻。普雨众法譬之大雨。为诸众生除烦恼病犹彼良医。以法治世譬如国王。能护众生及护正法等四天王。于人天中<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>最胜犹如帝释。心得自在譬大梵王自在王领娑婆世界。身得无碍如伽娄罗鸟。教示众生如世间父。能出法宝类毗<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>王能出众宝。功德智慧之所庄严。众生见者无不利益。诸佛世尊之所称赞。一切天众咸拥护之。善男子。菩萨摩诃萨。得是众法不入陀罗尼门。种种自在利益众生。方便说法而不穷尽。心无疲倦不求名利。法施平等无有嫉妒。持戒清净于身口意永无愆失。忍辱清净离诸嗔恼。精进清净所作办立。禅定清净善调伏心。般若清净悉无疑滞。具四无量犹如梵王。行诸三昧三摩跋提。世间最胜修无上道。具诸功德一切智慧受灌顶位。说是陀罗尼法门时。众中六万四千菩萨得不退转。三万菩萨得无生法忍。二万人天得远尘离垢法眼净。无量无边人天发阿耨多罗三藐三菩提心</p><p>胜天王般若波罗蜜经陀罗尼品第十二</p><p>尔时文殊师利菩萨摩诃萨。即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。希有世尊。如来所说。菩萨摩诃萨得是众法不入陀罗尼。所成功德无量无边。尔时佛告文殊师利菩萨言。善男子。如是功德。假使如来百千年说亦复不尽。尔时众中有一菩萨摩诃萨名寂静意。白文殊师利菩萨言。菩萨摩诃萨。得是陀罗尼。为佛世尊之所赞叹。如此之人善得大利。自行化彼皆悉不空。尔时文殊师利菩萨答寂静意菩萨摩诃萨言。善男子。第一义中无法可赞无色<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。无色相者有何可赞。无可赞故于何<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。寂静意菩萨白文殊师利菩萨言。如我闻佛修多罗中说。一切法无我我所。无能令喜无能令嗔。此法平等菩萨应学。譬如大地。住在水上。若凿井池即得用水。其不凿者无由致之。如是圣智境界遍一切法。若有勤修般若方便即便得之。其不修者云何能得。是故菩萨欲求菩提。不得懈怠勤修精进。如是之法则在现前。善男子。如生盲人不能见色。如是烦恼盲诸众生不能见法。如人有眼无外光明不能见色。行人如是。虽有智慧无善知识不能见法。如有天眼不假外明自能见色。菩萨摩诃萨入法流者自然胜进。如在胎者日日增长而不自见。菩萨摩诃萨勤行精进亦不自见众行增长。而能成就一切佛法。譬如雪山有药树王不枯不析。菩萨摩诃萨勤修精进。一切众行不退不失。譬如转轮圣王。出现于世则具七宝。菩萨摩诃萨发菩提心具七法宝。所谓布施持戒忍辱精进禅定智慧及方便力。又如转轮圣王游四天下。于诸众生其心平等。菩萨摩诃萨以四摄法利益众生亦复如是。又如转轮圣王所在之处则无诤讼。菩萨摩诃萨如实说法亦无诤论。譬如三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>初成。即有须弥山王及以大海。菩萨亦尔。若发阿耨多罗三藐三菩提心。即有般若及以大悲。譬如日出其高山者先照光明。菩萨摩诃萨得般若炬。高行菩萨善根熟者先照其光。譬如大地荷负一切。华果树木草药皆悉平等。菩萨摩诃萨得是陀罗尼门。于诸众生其心平等。尔时世尊赞寂静意菩萨摩诃萨言。善男子。如汝所说。善男子。菩萨摩诃萨得是陀罗尼门。凡有所说一文一字无非佛语。善男子。此所说法离色声香味触。何以故。非世法故。无尽无边能入一切身心轻利。假使百千佛前说者亦不怯弱。何以故。此菩萨摩诃萨。得佛住持力故心无所著。不着我。不着众生。不着法。即得清净法界。清净如来。清净实际。得法无尽。字无尽。说无尽。即生欢喜。得般若故。得阇那故。无疑网故。说是陀罗尼法门时。众中八千菩萨得此众法不入陀罗尼。一万二千菩萨得不退转。五千菩萨得无生法忍。一万六千天子得远尘离垢法眼净。无量无边众生发阿耨多罗三藐三菩提心。尔时世尊告寂静意菩萨言。此陀罗尼能伏众魔。破诸外道及憎嫉法人。灭烦恼火然般若灯。拥<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>师令至涅槃。调伏自心善化外众。美身威仪见者欢喜。为正行人平等说法。如实观察众生根性不前不后。说是法时。三千大千世界诸须弥山及以大海皆悉震动。诸天雨华。曼陀罗华。摩诃曼陀罗华。曼殊沙华。摩诃曼殊沙华。优钵罗华。拘物头华。分陀利华。迦摩罗华。诸天空中作众音乐不鼓自鸣。尔时世尊告寂静意菩萨言。善男子。过去之世无量无边不可数不可数劫。有佛出世名曰宝月如来应供正遍知明行足善逝世间解无上士调御丈夫天人师佛世尊。国名无毁。劫名欢喜。声闻<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>三十二亿。菩萨摩诃萨无复数量。是佛成道无有苦行及降天魔。时彼众中有一菩萨名宝功德。辩才巧妙种种说法。尔时大众请佛住世勿入涅槃。时宝功德菩萨告大众言。如来世尊无生无灭。何用劝请勿入涅槃。若虚空入涅槃如来乃入涅槃。若实际真如法界不思议界入涅槃。如来乃入涅槃。何以故。如来之法无成无坏无染无净。非世出世有为无为非断非常。假令一口而有十舌。是一一舌复生百舌。是一一舌复生千舌。亦不能说如来成坏。宝功德菩萨说此法时。八万六千菩萨得不退转。七千菩萨得无边功德陀罗尼。悦意陀罗尼。无碍陀罗尼。欢喜陀罗尼。大悲陀罗尼。月爱陀罗尼。月光陀罗尼。日爱陀罗尼。日光陀罗尼。须弥山陀罗尼。大海陀罗尼。德王陀罗尼。三万六千人天得远尘离垢法眼净。佛告寂静意菩萨言。尔时宝功德菩萨岂异人乎。即汝身是。以此因缘汝能说是陀罗尼门。尔时文殊师利菩萨而说偈言</p><p>总持如妙药能疗众惑病</p><p>犹彼天<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>得者永不死</p><p>尔时功德华王菩萨而说偈言</p><p>总持无文字文字显总持</p><p>般若大悲力离言文字说</p><p>尔时珊兜率陀天王即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。世尊。诸佛如来不可思议。诸佛说法亦不可思议。诸大菩萨所行所说亦不可思议。我等诸天宿世之中善根深厚。得值如来闻说是法。即以种种天诸宝华天华天香。散佛如来以为供养。尔时世尊告珊兜率陀天王言。大王。凡欲供养佛如来者当修三法。所谓发阿耨多罗三藐三菩提心。护持正法。如闻修行。大王。若有修行此三法者。是人名为供养如来。大王。假使如来<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>一劫住世。说此供养<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>不能穷尽。是故大王。若欲供养佛如来者。具此三法乃名供养。大王。若有护持如来一四句偈。是人则为拥护过去现在未来诸佛阿耨多罗三藐三菩提。何以故。诸佛如来皆从法生。法供养者名真供养。一切资财所不能及。法供养者诸供养中最为第一。尔时世尊告珊兜率陀天王言。我念过去无量无边阿僧祇阿僧祇劫数行菩萨道时闻虚空中诸天说偈</p><p>天人远离大宝藏王贼水火所去失</p><p>百千万劫法难闻得闻不持不施等</p><p>道心为本化众生如实修行心寂静</p><p>自利利他平等心如是修行供养佛</p><p>大王。我于往昔初闻此偈即为他说。有八千人发阿耨多罗三藐三菩提心。是故大王。以法供养最为第一。何以故。一切诸佛从法生故</p></div>"
},{
    "title": "胜天王般若波罗蜜经 第七卷",
    "author": "月婆首那 译",
    "html": "<div class=\"B1_text\"><p>胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经 第七卷</p><p>陈优禅尼国王子月婆首那译</p><p>劝诫品第十三</p><p>尔时文殊师利菩萨即从座起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。如来所说甚深般若波罗蜜。于未来世末代之中。颇有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>能信受不。若善男子善女人。闻是修多罗生信不谤。如此等人成何<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。佛告文殊师利菩萨言。未来末世有善男子善女人。无量佛所修持净戒<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>般若。是佛真子。能信此修多罗。所致功德不可称计。最善胜法从般若生。净心信受。我今为汝。略以譬说。文殊师利。阎浮提洲纵广七千由旬。北广南狭。其中人面亦似地形。洲内遍满须陀洹斯陀含阿那含阿罗汉辟支佛等。密如竹麻甘蔗荻林。中无少空及以间缺。若有善男子善女人。四事<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>毕<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>寿。或复七宝遍满此洲积至梵天。一一圣人各施尔许毕。是善男子善女人寿。日夜三十牟尤多相续不断。文殊师利。于意云何。此人以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>功德多不。文殊师利菩萨白佛言。甚多婆伽婆。甚多修伽陀。佛告文殊师利菩萨。若善男子善女人不谤此修多罗功德。胜彼百分不及一。千分百千万分不及一。乃至算数譬喻所不能及。文殊师利。瞿耶尼洲纵广八千由旬。形如半月人面亦尔。洲内遍满须陀洹斯陀含阿那含阿罗汉辟支佛。密如竹麻甘蔗荻林。中无少空及以间缺。若有善男子善女人。四事供养毕圣人寿。至<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>起塔。或复七宝遍满此洲积至梵天。一一圣人各施尔许毕。是善男子善女人寿。日夜三十牟尤多相续不断。文殊师利。于意云何。此人以是因缘得福多不。文殊师利菩萨白佛言。甚多婆伽婆。甚多修伽陀。佛告文殊师利菩萨。若善男子善女人。信此修多罗功德。胜彼百分不及一。千分百千万分不及一。乃至算数譬喻所不能及。文殊师利。弗于逮洲纵广九千由旬。形如满月人面亦尔。洲内遍满须陀洹斯陀含阿那含阿罗汉辟支佛。密如竹麻甘蔗荻林。中无少空及以间缺。若有善男子善女人。四事供养毕圣人寿。或复七宝遍满此洲积至梵天。一一圣人各施尔许毕。是善男子善女人寿。日夜三十牟尤多相续不断。文殊师利。于意云何。此人以是因缘得福多不。文殊师利菩萨白佛言。甚多婆伽婆。甚多修伽陀。文殊师利。郁单越洲辟方十千由旬。人面亦方。洲内遍满须陀洹斯陀含阿那含阿罗汉辟支佛。密如竹麻甘蔗荻林。中无少空及以间缺。若善男子善女人。四事供养毕圣人寿。或复七宝遍满此洲积至梵天。一一圣人各施尔许毕。是善男子善女人寿。日夜三十牟尤多相续不断。文殊师利。于意云何。此人以是因缘得福多不。文殊师利菩萨白佛言。甚多婆伽婆。甚多修伽陀。佛告文殊师利菩萨。若善男子善女人。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵此修多罗功德。胜彼百分不及一。千分百千万分不及一。乃至算数譬喻所不能及。文殊师利。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>悉为微尘。尔许圣人。若有善男子。善女人。四事供养毕圣人寿。尔许尘数三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>满中七宝积至阿迦尼吒天。一一圣人各施尔许毕。是善男子善女人寿。文殊师利。于意云何。功德多不。文殊师利菩萨白佛言。世尊。前之福德已不可思议。况此功德。佛告文殊师利菩萨。若善男子善女人。<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>此修多罗为他宣说。功德胜彼。百分不及一。千分百千万分不及一。乃至算数譬喻所不能及。文殊师利。如此功德。若不<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>者。尔许微尘数劫作他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天王。尔许劫数作化乐天王。尔许劫数作兜率陀天王。尔许数劫作夜摩天王尔许数劫作天帝释。况复转轮圣王。回向萨婆若故。能得成就般若波罗蜜阿耨多罗三藐三菩提。文殊师利。阎浮提中遍满须陀洹斯陀含阿那含阿罗汉辟支佛。密如竹麻甘蔗荻林。若有恶人。皆悉杀害尔许贤圣。文殊师利。于意云何。是人以此因缘得罪多不。文殊师利菩萨白佛言。世尊。杀一圣人尚于一劫堕阿鼻<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。何况尔许。其罪甚多不可称计。佛告文殊师利菩萨言。有人谤此修多罗者。其罪重彼百分不及一。千分百千万分不及其一。乃至算数譬喻亦不能及。文殊师利。瞿耶尼中遍满须陀洹斯陀含阿那含阿罗汉辟支佛。密如竹麻甘蔗荻林。若有恶人皆悉杀害。文殊师利。于意云何。此人以是因缘得罪多不。文殊师利菩萨白佛言。世尊。此罪不可闻不可闻。是人无有出阿鼻地狱期。佛告文殊师利菩萨言。有人不信此修多罗。其罪重彼百分不及一。千分百千万分不及一乃至算数譬喻所不能及。文殊师利。若四天下悉为微尘。尔许尘数诸佛如来。若有恶人皆悉杀害夺二种财。灭法财。破世财。文殊师利。于意云何。是人得罪多不。文殊师利菩萨白佛言。世尊。此罪不可闻不可计不可思量。佛告文殊师利菩萨。若复有人障碍此修多罗毁谤不信。其罪重彼百分不及一。千分百千万分不及一。乃至算数譬喻所不能及。假使三千大千世界一切众生。悉成阿耨多罗三藐三菩提已。如此恶人犹故不出阿鼻地狱。文殊师利。如是恶人。无一世界阿鼻地狱不经入者。况余地狱畜生饿鬼。何以故。毁坏三世诸佛母故。假使如前微尘数劫得离三涂。若生人中得阿萨阇病。又经尔许微尘数劫。得无舌报若无手报各经尔劫。文殊师利。我若住世一劫若减一劫。以佛神力说是恶人所得罪报不能究尽。文殊师利。若求现在未来世乐。勿得于此修多罗中。毁谤不信作大障碍</p><p>胜天王般若波罗蜜经二行品第十四</p><p>尔时佛告文殊师利菩萨言。菩萨摩诃萨行般若波罗蜜。宜应成就前后般若波罗蜜。何以故。菩萨摩诃萨有二种行。成就般若<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。文殊师利菩萨白佛言。世尊。云何菩萨摩诃萨教化众生。佛告文殊师利菩萨言。从初般若乃至后际。离功用心<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>无尽中不间隙。为脱三有恶趣之报。安诸众生令住善道得三圣果。文殊师利。是名菩萨摩诃萨行般若波罗蜜教化众生。文殊师利。菩萨摩诃萨行般若波罗蜜。成就无边无为。是名菩萨摩诃萨自行。何以故。成就一切德故。文殊师利菩萨白佛言。世尊。何等法与菩萨摩诃萨般若波罗蜜相应。佛告文殊师利菩萨言。一切种智。真实之法远离思量。微妙<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>道理甚深。不可得见难以通达。<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>寂静清凉遍满。无有分别无著无碍。随顺道理不可取执。大寂极静。一切法中最为无上无与等者。文殊师利。菩萨摩诃萨行般若波罗蜜。修此等法与萨婆若相应。文殊师利菩萨白佛言。世尊。菩萨摩诃萨于何境界行般若波罗蜜。佛告文殊师利菩萨言。菩萨摩诃萨行般若波罗蜜。甚深境界。广大境界。功德境界。文殊师利。甚深境界者。体是无为。不可相离不着二边。脱离诸障<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净。不可思量不可数知。不与声闻辟支佛共。文殊师利。广大境者。菩萨摩诃萨行般若波罗蜜。诸佛如来一切功德。般若波罗蜜摩诃迦楼那二法为体。离分别相无功用心利益众生。皆称彼意无时暂舍。文殊师利。菩萨摩诃萨行般若波罗蜜。与一切功德相应。三十二相八十种好。佛威神力悉能示现种种相貌。随诸众生根欲性行。或升兜率或从彼下。或现处胎。或现初生。或现童子。或园游戏。或现<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。或现苦行。或诣菩提树。或现<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。或现转法轮。或现涅槃。如是种种为诸众生。尽竭<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。文殊师利。是名菩萨摩诃萨行般若波罗蜜境界。文殊师利菩萨白佛言。希有世尊。如此甚深般若波罗蜜。诸佛境界不可思议。佛告文殊师利菩萨言。如是如是。如汝所说。般若波罗蜜是不共法不可思议。何以故。一切凡夫声闻缘觉。不能通达。非其境界故。除佛如来更无得者。何以故。如如之理义甚深故。自在不动无漏界摄。教化众生利益<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。是以名为诸佛境界。过诸语言第一义摄。无有觉观分别思量绝诸譬类。一切法中最为上品。不住生死不住涅槃。文殊师利。菩萨摩诃萨行般若波罗蜜。凡有五事不可思议。一者自性。二者方处。三者住。四者一异。五者利益。文殊师利。云何自性不可思议。色即是如求不可得。离色有如求不可得。受想行识亦复如是。地大即如求不可得。离地求如亦不可得。水火风大一切皆尔。眼入即如求不可得。离眼求如亦不可得。耳鼻舌身意一切皆尔。有法是如求不可得。无法是如亦不可得。若在欲界不可思议。若离欲界亦不可思议。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>一切皆尔。若在东方不可思议。若离东方不可思议。南西北方四维上下一切皆尔。安乐住不可思议。寂静住不可思议。有心住不可思议。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>住不可思议。三世如来同在一处。自性清净无漏法界。若一若异不可思议。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>神力同一法界。般若方便二相平等。能为众生无量利益。不可宣说过言语境。而能随顺众生根性。作种种说种种示现。三十二相八十种好。随众生意如是现之。文殊师利菩萨白佛言。世尊。何等名为三十二相八十种好。佛告文殊师利菩萨言。如来相好无穷无边说不可尽。随顺世法。是以略说三十二相八十种好。一足下平满。二行步平正三足下轮相悉具毂辋千辐<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。四手指纤长软直节骨不现。五身大方正。六手足指网缦合犹如鹅王。七手掌如红莲华。八踝骨不现。九[口*垔]尼鹿王膊。十身软直。十一阴马藏。十二身分满足如尼拘卢陀树。十三身毛右旋。十四一孔一毛皮肤细滑不受尘垢。十五身金色。十六圆光一丈。十七七处满。十八师子臆。十九两臂平正腋下满。二十两臂圆直如象王鼻。立垂过膝。二十一口四十齿齐密相连白如珂雪。二十二上下四牙状如初月。二十三师子额。二十四头团圆。二十五咽喉具足千脉。二十六胸骨如那罗延。二十七顶骨自然踊起。二十八舌相广长如莲华叶。二十九音声如梵王天鼓。三十眼目青色如优钵罗华。三十一眼睫绀焰犹如牛王。三十二眉间白毫。文殊师利。是名三十二相。菩萨摩诃萨行般若波罗蜜。悉能成就如是功德。文殊师利。云何名为八十种好。一无能见顶。二顶骨坚实。三额广平正。四眉高而长形如初月。绀琉璃色。五目广长。六鼻高圆直而孔不现。七耳厚广长埵轮成就八身坚实如那罗延。九身分不可坏。十身节坚密。十一合身回顾犹如象王。十二身有光明。十三身调直。十四常少不老。十五身恒润泽。十六身自将卫不待他人。十七身分满足。十<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>满足。十九容仪具足。二十威德远震。二十一一切向不背他。二十二住处安隐不危动。二十三面门如量不大不长。二十四面广而平。二十五面圆净如满月。二十六无顇容。二十七进止如象王。二十八容仪如师子王。二十九行步如鹅王。三十头如摩陀那果。三十一身色光悦。三十二足趺厚三十三爪如赤铜叶。三十四行时印文现地。三十五指文庄严。三十六指文明了不暗。三十七手文明直。三十八手文长。三十九手文不断。四十手足如意。四十一手足红白色如莲华。四十二孔门相具。四十三行步不减。四十四行步不过。四十五行步安平。四十六脐深厚状如盘蛇团圆右转。四十七毛色青红如孔雀项。四十八毛色润净。四十九身毛右靡。五十口出无上香身毛皆尔。五十一唇色赤润如频婆果。五十二唇润相称。五十三舌形薄。五十四一切乐观。五十五随众生意和悦与语。五十六于一切处无非善言。五十七若见人先与语。五十八音声不高不下随众生乐。五十九说法随众生语言。六十说法不着。六十一等观众生。六十二先观后作。六十三发一音答众声。六十四说法次第皆有因缘。六十五无有众生能见相尽。六十六观者无厌。六十七具足一切音声。六十八显现善色。六十九刚强之人见则调伏。恐怖者见即得安隐。七十音声明净。七十一身不倾动。七十二身分大。七十三身长。七十四身不染。七十五光遍身各一丈。七十六光照身而行。七十七身清净。七十八光色润泽犹如青珠。七十九手足满。八十手足德字</p><p>胜天王般若波罗蜜经赞叹品第十五</p><p>尔时文殊师利菩萨即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。世尊。如来功德希有无等不可思议。三世诸佛同一无别。若见如来或闻功德。此等众生亦不可思议。我等今日重见世尊转大法轮。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃得未曾有。尔时文殊师利菩萨。即升<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>高七多罗树。合掌赞曰</p><p>一切众生唯佛大尊尚无等者</p><p>况当有胜人法二空理无等等</p><p>唯佛如来等无等等<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>习气</p><p>永尽无余所知之法皆悉明了</p><p>若智若说无及佛者大千世界</p><p>唯佛独尊十力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>决定不虚</p><p>若释若梵所不能得世尊大恩</p><p>于诸众生此事难思无能及者</p><p>无量善巧种种方便以为众生</p><p>令得利益</p><p>尔时众中有一天子。名苏楼波。(陈言妙色)即从座起。偏袒右肩右膝着地。合掌向佛头面作礼。说偈赞云</p><p><a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>或说等佛者如是之言名口过</p><p>若说法王最极尊此非虚妄为实语</p><p>人天之俦正问难无有能折我大师</p><p>善逝降魔及外道将导世间至<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a></p><p>清净四辩无穷说<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>妙药施众生</p><p>遍观诸法智无碍一切念中不减失</p><p>大悲平等视众生清净之心世不染</p><p>善能了知根欲性随所乐闻而应说</p><p>烦恼差别非一种为示无量对治门</p><p>巧说因缘无如佛专以利益众生故</p><p>值佛闻法不得道是等众生度极难</p><p>如来大名应渴仰得见世尊无限益</p><p>佛智能令心清净既闻正教出生死</p><p>闻佛名号大吉祥忆念世尊恒喜乐</p><p><a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>诣佛生慧解如教勤修成种智</p><p>戒品清净故无垢禅定第一心澄明</p><p>智惠最胜故难动法海清净如甘露</p><p>一切众生喜放逸诸佛如来离世间</p><p>等慈众生如一子恩德深厚无能报</p><p>先说破诸结贼法久摧天魔幻化军</p><p>世尊已说三有过广示涅槃无量德</p><p>尔时众中有一天子。名苏那摩(陈言善名)即从座起。偏袒右肩右膝着地。合掌向佛头面作礼。说偈赞云</p><p>如来世尊行大悲设可度智与他者</p><p>尚令调达最前得况复其余众生类</p><p>我今不惬为空过修治正行报佛恩</p><p>有人已证无漏灭是于佛恩未为报</p><p>若能<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>佛正教乃得名为真<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a></p><p>佛久勤苦为众生无上大恩罕能报</p><p>大慈开显真实法令人修行兼化他</p><p>若佛如来不出世一切众生受大苦</p><p>无复善道唯恶趣但闻三涂苦恼声</p><p><a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>受苦无免脱烦恼系缚众生故</p><p>世尊能解他毒结翻为大悲之所萦</p><p>佛是世间大<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>依教正修离恶道</p><p>若违<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>不修行是人永无生善趣</p><p>有人于佛起恶心或复不乐闻深法</p><p>是等众生甚可悲决定永当处黑暗</p><p>如佛世尊自知智其等如来乃能了</p><p>佛智非我所量测头面敬礼十方尊</p><p>无畏智力不共法唯佛世尊独圆备</p><p>相好庄严微妙音观者无厌超众色</p><p>三种开敷不暂息清净佛华我今礼</p><p>唯佛善知无上道出离一切诸险难</p><p>佛为无上最第一头面敬礼两足尊</p><p>佛以功德<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>水洗诸垢秽悉无余</p><p>世尊本来内外净我今<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>真净身</p><p>尔时娑婆世界主大梵天即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼以偈赞云</p><p>功德智慧佛具足利益众生不暂休</p><p>常雨甘露令众饱我今顶礼能利他</p><p>世间最胜可敬者此人犹故恭敬佛</p><p>诸恶斯尽众善备我今顶礼无等尊</p><p>靡有一行不修学为欲救拔众生故</p><p>今度生死得安乐我今顶礼救世师</p><p>敬礼微妙金色身敬礼所说甘露法</p><p>敬礼清净无垢智敬礼一切功德林</p><p>尔时世尊告大梵天言。善哉善哉。如大梵天所赞。世尊。此事真实。何以故。诸佛如来于<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>。修习种种功德智慧。是故得果无不备足。何以故。具足檀波罗蜜。尸波罗蜜。羼提波罗蜜。毗梨耶波罗蜜。禅波罗蜜。般若波罗蜜。身清净。口清净。意清净。以是清净故能通达如如实际。诸佛世尊住此实际所言不虚。尔时大梵天即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言。唯愿世尊。以住持力令此般若波罗蜜久在世间。佛告大梵天言。十方三世诸佛住持力。咸皆拥护是般若波罗蜜。世间若天若魔<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。无有能坏作障碍者。何以故。我念过去世。有佛名宝月如来应供正遍知明行足善逝世间解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊。国名不毁劫名赞叹。是佛众中有二<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。而为法师善能说法。一名智盛。二名实与。是二比丘随佛转法轮。正经一劫。三千大千世界百亿诸魔。悉皆受化发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。尔时扇多意菩萨摩诃萨即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼而白佛言世尊。宝月如来为犹在世已入涅槃。佛告扇多意菩萨言。善男子。东方去此过十百千亿诸佛世界。有一世界名曰不毁。佛寿十千劫。彼佛国土说般若波罗蜜。无有天魔及诸外道能为障碍。皆悉发心向阿耨多罗三藐三菩提。智盛比丘即文殊师利菩萨是。实与比丘即胜天王是。此等二人善巧方便种种拥护。令般若波罗蜜久久住世。十方佛土说般若波罗蜜。此之二人即来听受。犹我今日放大光明。寻光来集</p><p>胜天王般若波罗蜜经付嘱品第十六</p><p>尔时世尊告阿难言。汝可受持此般若波罗蜜修多罗。尔时阿难即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼白佛言世尊。云何受持。佛告阿难言。受持此修多罗有十种法。何等为十。一者书写。二者供养。三者流传。四者谛听。五者自读。六者忆持。七者广说。八者口诵。九者思惟。十者修行。阿难。此十种法能受持此修多罗阿难譬如大地一切树林花药皆依而生。一切善法皆依般若波罗蜜生。阿难。譬如转轮圣王若在世间七宝常现。般若波罗蜜亦复如是。此修多罗若在世间。则<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>种常不断绝。尔时大众一时咸同观如来面。异口共音俱发声言。诸善男子。如来灭后谁能荷负。世尊。如是之大重担。无量无边阿僧祇劫。所可修习阿耨多罗三藐三菩提。尔时众中有一万二千菩萨摩诃萨。为护持法故。即从坐起偏袒右肩。右膝着地合掌向佛。头面作礼说偈赞云</p><p>我等舍身命不求未来报</p><p>护持甚深法世尊之所说</p><p>尔时众中五百天子贤王为上首。即从坐起。偏袒右肩右膝着地合掌向佛头面作礼。说偈赞云</p><p>为度诸众生成就大悲愿</p><p>护持甚深法世尊之所说</p><p>尔时释提桓因尸弃大梵毗沙门天王。即从坐起。偏袒右肩右膝着地。合掌向佛头面作礼。说偈赞云</p><p>般若微妙药能治一切病</p><p>我等顶戴持世尊之所说</p><p>尔时执金刚神即从坐起。偏袒右肩右膝着地。合掌向佛头面作礼。说偈赞云</p><p>法本无名字佛以名字说</p><p>世尊大悲教我等顶戴持</p><p>尔时世尊告尸弃梵天言。梵天。佛有三事最为无上。何等为三。一者能发阿耨多罗三藐三菩提心。二者护持正法。三者如闻修行。梵天。如此三法最为无上。若复有人能修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。此人名为供养如来。佛若在世一劫若减一劫。说彼功德不能究尽。梵天。若护持如来一四句偈。是人功德尚不可量况复般若波罗蜜三世佛母。何以故。梵天。诸佛如来皆从般若波罗蜜生。以法供养。即是供养诸佛如来。不以赀财而为供养。法供养者诸供养中最为第一。梵天。有人护持如来正法。当知此人二世安乐。是故梵天。应须护持甚深修多罗。梵天。梵天以拥<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>故。得见贤劫千佛悉为请主。梵天于此秽土护持正法须臾之间。胜在<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>过一劫若一劫。是故宜应勤加<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>拥护正法。尔时世尊复告释提桓因言。憍尸迦。所在之处有此般若波罗蜜修多罗。当知即是如来得菩提处。转法轮处。示涅槃处。何以故。憍尸迦。一切菩萨一切善法一切诸佛。皆从此修多罗生。憍尸迦。若有法师流通此修多罗处。此地即是如来所行。于彼法师当生善知<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>尊重之心。犹如<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。见是法师恭敬欢喜尊重赞叹。憍尸迦。若我住世一劫若减一劫。说是流通此修多罗法师功德不能究尽。憍尸迦。若此法师所行之处。善男子善女人。宜应刺血洒地令尘不起。如是供养未足为多。何以故。如来法轮难受持故。尔时释提桓因白佛言。世尊。未来世中说是修多罗处。我及眷属拥护彼地及说法者。若见彼有修多罗处。即生前四种处心。尔时世尊赞天帝释言。善哉善哉。憍尸迦。以此修多罗付嘱。憍尸迦。未来末世拥护流通。尔时释提桓因白佛言。世尊。我等诸天得生善道。皆悉由此修多罗故。求阿耨多罗三藐三菩提。亦复由此修多罗故。我当不顾身命拥护正法。佛言。憍尸迦。如闻修行。善哉善哉。佛说是修多罗已。胜天王及十方诸大菩萨众。一切声闻众。天龙夜叉乾闼婆阿修罗迦楼罗紧那罗摩睺罗伽人非人等。闻佛所说信受奉行</p><p>经序仁王般若经初众相谓曰大觉世尊前已为我二十九年说摩诃般若金刚般若天王问般若光赞般若则此经目题久传上国有梁太清二年六月于阗沙门求那跋陁(陈言德贤)赍一部梵文凡十六品始湏京师时中<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>优禅尼国王子月首那生知后朗世传释学无精义味兼善方言避难本邦登仕梁室被敕摠知外国使命忽见德贤有此经典敬恋宜怀如对真佛因从祈请毕命弘宣德贤嘉雅操灵心授与首那即又[石*(式-工+口)]敕求使顾表奉迎杂华经辞[门@报]甫尔便值侯量称丘寇乱顶戴逃亡未暇翻译民之所欲天必从焉属我大陈膺期[石*(式-工+口)]运重光累业再清四海车书混同华夷[车*(吴-大+月)]睦首那贫笈怀经自达而至江洲刺史仪同黄法[(〦/賏)*毛]驱传本洲锡圭分陜护持正法渴仰大乘以天嘉六年岁次乙酉七月辛已朔二十三日癸卯劝请首那于洲听事略开题序说无遮大会<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>云集五千余人匡山释僧果法师及远迩名德并学冠百家博通五部各有硕难纷纶靡不涣然水释到其月二十九日还兴业伽蓝揵捶既响僧徒咸萃首那躬执梵文译为陈语杨洲阿育王寺释智昕暂游鼓汇伏应至教听笔[跳-兆+(梳-木)]一言敢失再三修环撰为七卷讫其年九月十八日文句乃尽江洲僧正释慧恭法师戒香芬郁定水澄明揩则具瞻陈梁是寄别驾豫章万骃洲之股胡材之杞梓信慧并修文武兼用教委二人经始功德辄附卷余略述时事庶将来君子或精焉</p></div>"
}]