[{
    "title": "金刚能断般若波罗蜜经 第238部",
    "author": "三藏笈多 译",
    "html": "<div class=\"B1_text\"><p>金刚能断<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经</p><p>隋大业年中<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>笈多译</p><p>归命一切佛菩萨海等如是我闻。一时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。闻者游行胜林中无亲搏施与园中。大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众共半三十比丘百。尔时世尊前分时。上裙着已。器上给衣持。闻者大城搏为入。尔时世尊闻者大城。搏为行已。作已食作已后食。搏堕过器上给衣收摄。两足洗。坐具世尊施设如是座中。跏趺结直身。作现前念近住。尔时多比丘。若世尊彼诣到已。世尊两足<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>。世尊边三右绕作已。一边坐彼。复时命者善实。彼所如是众聚集会坐。尔时命者善实起坐。一肩上著作已。右膝轮地着已。若世尊彼合掌。向世尊边如是言。希有世尊。乃至所有如来应正遍知。菩萨摩诃萨顺摄。最胜顺摄。乃至所有如来应正遍知。菩萨摩诃萨付嘱。最胜付嘱。彼云何世尊菩萨乘发行住应。云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>应。云何心降伏应。如是语已。世尊命者善实边如是言。善善。善实如是如是。善实如是如是。顺摄如来菩萨摩诃萨。最胜顺摄。付嘱如来菩萨摩诃萨。最胜付嘱。彼善实听。善善意念作。说当如菩萨乘发行住应。如修行应。如心降伏应。如是世尊。命者善实。世尊边愿欲闻。世尊于此言。此善实。菩萨乘发行如是心发生。应。所有善实<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。众生摄。摄已卵生若胎生。若湿生若化生。若色若无色。若想若无想。若非想非无想。所有众生界施设已。彼我一切无受余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>界灭度应。如是无量虽众生灭度。无有一众生灭度有。彼何所因。若善实。菩萨摩诃萨。众生想转。不彼菩萨摩诃萨名说应。彼何所因不彼善实菩萨名说应。若众生想转。寿想若人想若转。虽然复次时善实。不菩萨摩诃萨事住施与应。无所住施与应。不色住施与应。不声香味触法中住施与应。如是此善实菩萨摩诃萨施与应。如不相想亦住。彼何所因。若善实。菩萨摩诃萨。不住施与彼所善实福聚不可量受取。彼何意念。善实。可前方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>量受取。善实言。不如此世尊。世尊言。如是右(南)后(西)高(北)下上方。顺不正方。普十方可虚空量受取。善实言。不如此世尊。世尊言。如是如是。善实。如是如是。若菩萨摩诃萨。不住施与。彼所善实福聚不可量受取。虽然复次时。善实。如是菩萨乘发行施与应。如不相想亦住。彼何意念。善实。相具足如来见应善实言。不世尊相具足如来见应。彼何所因若彼如来相具足说。彼如是非相具足。如是语已。世尊。命者善实边。如是言。所有善实相具足。所有妄。所有不相具足。所有不妄名。此相不相如来见应。如是语已。命者善实。世尊边如是言。虽然世尊。颇有众生。当有未来世。后时。后长时。后分五十。<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>破坏时中。转时中。若此中。如是色类经中说中。实想发生当有。世尊言。莫善实汝如是语。虽然世尊。颇有众生当有未来世。后时后长时。后分五十。正法破坏时中。转时中。若此中。如是色类经中说中。实想发生当有。虽然复次时。善实。当有未来世。菩萨摩诃萨。后分五十。正法破坏时中。转时中。戒究竟。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>究竟。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>究竟。不复次时彼善实菩萨摩诃萨一佛亲近<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>当有。不一佛种植善根。虽然复次时。善实。不一佛百千亲近供养。不一佛百千种植善根。彼菩萨摩诃萨当有。若此中。如是色类中。经句中说中。一心净信亦得当知。彼善实如来佛智见。彼善实如来佛眼。一切彼善实无量福聚。生当取当。彼何所因。不善实彼等菩萨摩诃萨我想转。不众生想。不寿想。不人想转。不亦彼等。善实。菩萨摩诃萨。法想转无法想转不。亦彼等想无想转不。彼何所因。若善实。彼等菩萨摩诃萨法想转。彼如是彼等我取有。众生取寿取人取有。若无法想转。彼如是彼等我取有。众生取。寿取。人取有。彼何所因。不复次时。善实。菩萨摩诃萨。法取应不非法取应。彼故此义意如来说筏喻法本。解法如是舍应。何况非法。复次世尊。命者善实边。如是言。彼何意念。善实。有如来应正遍知无上正遍知证觉。有复法如来说。善实言。如我世尊。世尊说义解。我无有一法若如来无上正遍知证觉。无有一法若如来说。彼何所因。若彼如来法说不可取。彼不可说。不彼法非不法。彼何因。<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>显明<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。世尊言。彼何意念。善实。若有善家子若善家女。若此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。七宝满作已。如来等应等正遍知。等施与。彼何意念。善实。虽然彼善家子。若善家女。若彼缘多福聚生。善实言。多世尊。多善逝。彼善家子。若善家女。若彼缘多福聚生。彼何所因。若彼世尊。福聚如来。说非聚。彼世尊如来说福聚。福聚者。世尊言。若复善实。善家子。若善家女。若此三千大千世界。七宝满作已。如来等应等正遍知等施与。若此法本。乃至四句等偈。受已为他等分别广说。此彼缘多过。福聚生无量不可数。彼何所因。此出善实如来应正遍知。无上正遍知。此生佛世尊。彼何所因。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。佛法者。善实非佛法。如是彼。彼故。说名佛法者。世尊言。彼何意念。善实。虽然流入如是念我流入果得到。善实言。不如此世尊。彼何所因。不彼世尊一人彼故。说名流入。不色入。不声不香不味不触不法入彼故。说名流入者。彼若世尊。流入如是念我流入果得到。彼如是彼所我取有。众生取。寿取。人取有。世尊言。彼何意念。善实虽然。一来如是念我一来果得到。善实言。不如此。世尊。彼何所因。不一来如是念我一来果得到。彼何所因。不彼有法若一来人彼。故说名一来者。世尊言。彼何意念。善实。虽然不来如是念我不来果得到。善实言。不如此世尊。彼何所因。不彼有法若不来入彼。故说名不来者。世尊言。彼何意念。善实。虽然应如是念我应得到。善实言。不如此世尊。彼何所因。不彼世尊有法若应名彼故说名应者。彼若世尊应如是念我应得到。如是彼所我取有。众生取。寿取。人取有。彼何所因。我此世尊如来应正遍知无诤行最胜说。我此世尊。应离欲。不我世尊如是念我此应者。若我世尊如是念。我应得到。不我如来记说无诤行最胜。善实。善家子无所行彼故。说名无诤行。无诤<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。世尊言。彼何意念。善实。有一法若如来灯作如来应正遍知受取。善实言。不如此世尊。无一法若如来灯作如来应正遍知受取。世尊言。若有善实菩萨摩诃萨。如是语。我国土<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>成就。我者彼不如语。彼何所因。国土庄严者善实不庄严。彼如来说彼故。说名国土庄严者彼故。此善实菩萨摩诃萨。如是不住心发生应。不色住心发生应。不声香味触法住心发生应。无所住心发生应。譬如善实。丈夫有此如是色我身有。譬如善高山王。彼何意念。善实。虽然彼大我身有。善实言。大世尊大善逝。彼我身有。彼何所因。我身我身者。世尊。不有彼。如来说彼。故说名我身者。不彼世尊有彼。故说名我身者。世尊言。彼何意念。善实。所有恒伽大河沙。彼所有。如是恒伽大河有。彼中若沙。虽然彼多沙有。善实言。彼如是所有世尊多。恒伽大河有。何况若彼中沙。世尊言。欲我汝善实知我汝所有彼中恒伽大河中沙有。彼所有世界有。如是妇女若丈夫。若七宝满作已。如来等应等正遍知。等施与。彼何意念。善实。虽然彼妇女若丈夫。若彼缘多福聚生。善实言。多世尊。多善逝。彼妇女若丈夫。若彼缘多福聚生无量不可数。世尊言。若复时。善实。善家子。若善家女。若彼所有世界七宝满作已。如来等应等正遍知。等施与。若此法本。乃至四句等偈。受已为他等分别广说。此如是彼缘多过。福聚生无量不可数。虽然复次时。善实。此中地分。此法本乃至四句等偈。为他等说。若分别。若广说。若彼地分支帝有<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗世何复言。善实。若此法本。持当读当诵当。他等及分别广说当。最胜彼希有具足当。有此中善实地分。教师游行别异尊重处。相似共梵行。如是语已。命者善实。世尊边如是言。何名此世尊法本云何及如此持我。如是语已。世尊。命者善实边如是言。智慧<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>到名。此善实法本如是此持。彼何所因。若如是善实。智慧彼岸到。如来说彼如是。非彼岸到。彼故说名智慧彼岸到者。彼何意念。善实。虽然有法若如来说。善实言。不如此世尊。不有世尊法若如来说。世尊言。所有善实。三千大千世界地尘有多有。善实言。多世尊。多善逝。彼地尘。彼何所因。若彼世尊。地尘如来说非尘。彼如来说彼故。说名地尘者。若彼世界。如来说非界。如来说彼故。说名世界者。世尊言。彼何意念。善实。三十二大丈夫相。如来应正遍知见应。善实言。不如此世尊。不三十二大丈夫相。如来应正遍知见应。彼何所因。所有世尊。三十二大丈夫相。如来说非相。所有如来说彼故。说名三十二大丈夫相者。世尊言。若复时。善实。妇女若丈夫。若日日恒伽河沙等我身舍。如是舍。恒伽河沙等劫。所有我身舍。若此法本。乃至四句等偈。受已为他等分别。此如是彼缘多过。福聚生无量不可数。尔时命者善实。法疾转力泪出。彼泪拭已。世尊边如是言。希有世尊。最胜希有善逝。所有此法本。如来说此我世尊智生。不我曾生来。如是色类法本闻。先最胜彼世尊希有。具足众生有当。若此经中说中实想发生当。彼何所因。若此世尊实想彼如是非想。彼故如来说。实想实想者。不我世尊希有。若我此法本说中。信我解我。若彼世尊。众生有当。未来世此法本。受当持当读当诵当。他等及分别广说当。彼最胜希有具足有当。虽然复次时。世尊。不彼等菩萨摩诃萨我想转当。不众生想。不寿想。不人想转当彼何所因。若彼世尊。我想彼如是非想。若及如是众生想。寿想。人想。彼如是非想。彼何所因。一切想远离。此佛世尊。如是语已。世尊。命者善实边如是言。如是如是善实。如是如是如言汝。最胜希有具足彼众生有当。若此经中说中不惊当。不怖当。不畏当。彼何所因。最胜彼岸到此善实如来说。若及善实如来最胜彼岸到说。彼无量亦佛世尊说彼。故说名最胜彼岸到者。虽然复次时。善实。若如来忍彼岸到。彼如是非彼岸到。彼何所因。此时我善实。恶王分别。分肉割断。不时我彼中时我想。若众生想。若寿想。若人想。若不我有想非想有。彼何所因。若我善实彼中时我想有。嗔恨想亦我彼中时有。众生想。寿想。人想有。嗔恨想亦我彼中时有。念知我善实。过去世五百生。若我忍语仙人有。彼中亦我不想有。不众生想。不寿想。不人想。不亦我有。想非想有。彼故。此善实。菩萨摩诃萨。一切想舍离。无上正遍知心发生应。不色住心发生应。不声香味触住心发生应。不法住非无法住心发生应。无所住心发生应。彼何所因。若无所住。彼如是住彼故。如是如来说不色住菩萨摩诃萨施与应。不声香味触法住施与应。虽然复次时。善实菩萨摩诃萨。如是舍施应。一切众生为故。彼何所因。若如是善实众生想。彼如是非想。若如是彼一切众生如来说。彼如是非众生。彼何所因。真语善实如来。实语如来。不异语如来。如语如来。非不如语如来。虽然复次时。善实。若如来法证觉说。若思惟。若不彼中实不妄。譬如善实丈夫。闇舍入不一亦见。如是。事堕菩萨见应。若事堕施与。譬如善实眼者。丈夫显明夜月出种种色见。如是菩萨摩诃萨见应。若事不堕施与。虽然复次时。善实。若善家子善家女。若此法本。受当持当读当诵当。为他等及分别广说当。知彼善实如来佛智见。彼善实如来佛眼。一切彼善实众生无量福聚生当取当。若复时。善实。妇女若丈夫。若前分时。恒伽河沙等我身舍。如是中分时。如是晚分时。恒伽河沙等我身舍。以此<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。劫俱致那由多百千我身舍。若此法本。闻已不谤。此如是彼缘多过。福聚生无量不可数。何复言。若写已。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵。为他等及分别广说。虽然复次时。善实。不可思。不可称。此法本彼不可思。如是<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>观察应。此善实。法本如来说。胜乘发行众生为故。最胜乘发行众生为故。若此法本。受当持当读当诵当。为他等及分别广说当。知彼善实如来佛智见。彼善实如来佛眼。一切彼善实众生无量福聚具足有当。不可思不可称。亦不可量福聚具足有当。一切彼善实众生我肩<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>持当有。彼何所因。不能善实此法本小信解者。众生闻。不我见者。不众生见者。不寿见者。不人见者。不菩萨誓。众生能闻受。若持若读若诵若无是处有。虽然复次时。善实。此中地分此经广说供养。彼地分有当。天人阿修罗世礼右绕作。及彼地分有当。支帝彼地分有当。若彼善实善家子若善家女。若此如是色类经。受当持当读当诵当。为他等及分别广说当。彼轻贱有当。极轻贱。彼何所因。所有彼众生前生不善业作已。恶趣转堕所有现。如是法中。轻贱尽当。佛菩提得当。彼何所因。念知我善实过去世不可数劫不可数过。灯作如来应正遍知。他他过四八十佛俱致那由多百千有。若我亲承供养。亲承供养已。不远离。若我善实彼佛世尊。亲承供养已。不远离。若后时。后长时。后分五百。正法破坏时中。转时中。此经。受当持当读当诵当。为他等及分别广说当。此复时。善实。福聚边。此前福聚。百上亦数不及。千上亦百千上。亦俱致百千上。亦俱致那由多百千上。亦僧企耶。亦迦罗。亦算。亦譬喻。亦忧波泥奢。亦乃至譬喻亦不及。若复善实。彼等善家子善家女。我福聚说。此所有彼善家子善家女。若彼中时中。福聚取当。猛众生顺到心乱到。虽然复次时。善实。不可思。不可称。法本如来说。彼不可思。如是果报观察应。尔时命者善实。世尊边如是言。云何世尊。菩萨乘发行住应。云何修行应。云何心降伏。世尊言。此善实。菩萨乘发行如是心发生应。一切众生<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>受余涅槃界灭度应。如是一切众生灭度。无有一众生灭度有。彼何所因。若善实。菩萨众生想转。彼不菩萨摩诃萨名说应。乃至人想转。不彼菩萨摩诃萨名说应。彼何所由。无有善实一法菩萨乘发行名。彼何意念。善实有一法若如来灯作如来应正遍知边无上正遍知证觉。如是语已。命者善实。世尊边如是言。无有彼世尊一法若如来灯作如来应正遍知边无上正遍知证觉。如是语已世尊。命者善实如是言。如是如是。善实。如是如是。无有彼一法若如来灯作如来应正遍知边无上正遍知证觉。若复善实。一法如来证觉有。不我灯作如来应正遍知记说有当。汝行者未来世。释迦牟尼名如来应正遍知者。是故。此善实。如来应正遍知。无有一法若无上正遍知证觉。彼故灯作如来应正遍知记说有当。汝行者。未来世。释迦牟尼名如来应正遍知。彼何所因。如来者善实真如故。此即是如来者。善实不生法故此即是世尊者。善实道断此即是如来者。善实毕竟不生故。此即是。彼何所因。如是彼实不生若最胜义。若有善实如是语。如来应正遍知无上正遍知证觉。彼不如语诽谤我。彼善实不实取。彼何所因。无有彼善实一法若如来应正遍知无上正遍知证觉。若善实。如来法证觉说。若不彼中实不妄。彼故如来说一切法佛法者。彼何所因。一切法。一切法者。善实。一切彼非法。如来说彼故。说名一切法者。譬如善实丈夫有具足身大身。命者善实言。若彼世尊。如来丈夫说具足身大身非身。彼世尊如来说彼故。说名足身大身者。世尊言。如是如是。善实。如是如是。若菩萨如是语有众生般涅槃灭度。我不彼菩萨名说应。彼何所因。有善实有一法若菩萨名。善实言。不如此世尊。世尊言。众生。众生者。善实非众生。彼如来说彼故。说名众生者。彼故如来说。无我一切法。无众生。无寿者。无长养者。无人一切法者。若善实。菩萨如是语。我佛土庄严成就。彼亦如是不名说应。彼何所因。国土庄严。国土庄严者。善实非庄严。彼如来说彼故。说名国土庄严者。若善实。菩萨摩诃萨。无我法。无我法者。信解彼如来应正遍知。菩萨摩诃萨名说。彼何意念。善实。有如来肉眼。善实言。如是如是世尊有如来肉眼。世尊言。彼何意念。善实。有如来天眼。善实言。如是如是世尊有如来天眼。世尊言。彼何意念。善实。有如来慧眼。善实言。如是如是世尊有如来慧眼。世尊言。彼何意念。善实。有如来<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。善实言。如是如是世尊有如来法眼。世尊言彼何意念。善实。有如来佛眼。善实言。如是如是世尊有如来佛眼。世尊言。善善善实。彼何意念。善实。所有恒伽大河沙。虽然彼沙彼如来说。善实言。如是如是世尊。如是如是善逝。说彼如来彼沙。世尊言。彼何意念。善实。所有恒伽大河沙。彼所有恒伽大河有。所有彼中沙彼所有。及世界有。多彼世界有。善实言。多世尊。多善逝。彼世界有。世尊言。所有。善实。彼中世界中众生。彼等我种种有心流注知。彼何所因。心流注。心流注者。善实。非流注。此如来说彼故说名心流注者。彼何所因。过去善实心不可得。未来心不可得。现在心不可得。彼何意念。善实。若有善家子若善家女。若三千大千世界七宝满作已施与。虽然彼善家子若善家女。若彼缘多福聚生。善实言。多世尊。多善逝。世尊言。如是如是。善实。如是如是多。彼善家子若善家女若彼缘多福聚生。无量不可数福聚。福聚者。善实。非聚。彼如来说彼故。说名福聚者。若复善实。福聚有。不如来说福聚。福聚者。彼何意念。善实色身成就。如来见应。善实言。不如此世尊。非色身成就如来见应。彼何所因色身成就。色身成就者。世尊非成就。此如来说彼故。说名色身成就者。世尊言。彼何意念。善实。相具足如来见应。善实言。不如此世尊。非相具足如来见应。彼何所因。此世尊。相具足。如来说非相具足。如来说彼故。说名相具足者。世尊言。彼何意念。善实。虽然如来如是念我法说。善实言。不如此世尊。不如来如是念我法说。世尊言。若我善实如是语如来法说。诽谤我。彼善实不实取。彼何所因。法<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>说者。善实。无有法若法说名可得。尔时命者善实。世尊边如是言。虽然世尊。当有未来。颇有众生。后时。后长时。后分五十。正法破坏时中转时中。若此。如是色类法说闻已信当有。世尊言。不彼善实众生非不众生。彼何所因。众生众生者。善实一切彼非众生。彼如来说彼故。说名众生者。彼何意念。善实虽然有法若如来无上正遍知证觉。命者善实言。无有彼世尊有法若如来无上正遍知。世尊言。如是如是。善实。如是如是。微小彼中法无有不可得彼。故说名无上正遍知者。虽然复次时。善实。平等正法。彼不中有不平等。彼故说名无上正遍知者。无我故。无寿故。无众生故。无人故。平等无上正遍知。一切善法证觉。善法善法者。善实非法。如是。彼如来说彼。故说名善法者。若复善实。所有三千大千世界。须弥山王彼所有聚七宝。普散如来应等正遍知施与。若此智慧彼岸到。乃至四句等偈受已。为他等分别。此善实。福聚彼前者福聚百上亦数不及。千上亦百千上。亦俱致百千上。亦俱致那由他百千上。亦僧企耶。亦迦罗。亦算。亦譬喻。亦忧波泥奢。亦乃至譬喻亦不及。彼何意念。善实。虽然如来如是念我众生度脱不。复彼善实。如是见应。彼何所因。有无。善实无有一众生若如来度脱。若复善实。有如是众生。有若彼如来度脱彼。如是如来。我取有。众生取。寿取。人取有。我取我取者。善实非取。此如来说彼小儿凡夫生取。小儿凡夫生小儿凡夫生者。善实非生。彼如来说彼。故说名小儿凡夫生者。彼何意念善实。相具足如来见应。善实言。不如此世尊。如我世尊说义解。我不相具足如来见应。世尊言。善善善实。如是如是善实。如如语汝。不相具足如来见应。彼何所因。彼复善实。相具足如来见应。有彼王转轮如来有彼。故不相具足如来见应。此相非相故。如来见应。尔时命者善实。世尊边如是言。如我世尊。世尊说义解。我不相具足如来见应。尔时世尊。彼时此伽陀说</p><p>若我色见若我声求邪<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>行</p><p>不我见彼人</p><p>法体佛见应法身彼如来</p><p>法体及不识彼不能知</p><p>彼何意念。善实。相具足如来无上正遍知证觉。不复彼。善实。如是见应。彼何所因。不善实相具足如来无上正遍知证觉。复时彼善实。有如是语。菩萨乘发行有。法破灭施设断。不复善实如是见应。彼何所因。不菩萨乘发行有法破灭施设不断。若复善实。善家子若善家女。若恒伽河沙等世界。七宝满作已施与。若菩萨摩诃萨无我无生中法中忍。得此如是。彼缘多过福聚生。不复善实菩萨福聚取应。命者善实言。不世尊菩萨福聚取应。世尊言取应。善实不取应彼故说名取应。虽然复次时。善实。若有如是语如来去若不去。若住若坐。若卧若<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>。不我善实说义解。彼何所因。如来者。善实。说名无所去。无所来。彼故说名如来应正遍知者。若复善实。善家子若善家女。若所有三千大千世界地尘。彼如是色类墨作已。乃至如是不可数。譬如最小聚。彼何意念。善实。虽然彼多最小聚有。善实言。如是如是世尊。多彼最小聚有。彼何所因。彼世尊聚有。不世尊说最小聚者。彼何所因。若彼世尊。最小聚说非聚。彼如来说彼。故说名最小聚者。若及如来说三千大千世界者非界。如来说彼故。说名三千大千世界者。彼何所因。彼世尊界有。彼如是搏取有。若如是如来搏取说非取。彼如来说彼故。说名搏取者。世尊言。搏取如是。善实。不世俗语不可说非法非非法。彼小儿凡夫生取。彼何所因。若此有善实如是说。我见如来说众生见。寿见。人见。如来说。虽然彼善实。正说语。善实言。不如此世尊不如此善逝。彼何所因。若彼世尊我见如来说非见。彼如来说彼故。说名我见者。世尊言。如是此善实。菩萨乘发行一切法。知应见应信解应。如信解如无法想亦住。彼何所因。法想法想者。善实非想。此如来说彼故。说名法想者。若复时善实。菩萨摩诃萨无量无数世界七宝满中作已。如来等应等正遍知等施与。若善家子若善家女。若如是智慧彼岸到。乃至四句等偈。受持分别。读诵为他等。及分别广说。此如是彼缘多过福聚生无量不可数。云何及广说。如不广说。彼故说名广说</p><p>星翳灯幻露泡梦电云见如是</p><p>此有为者</p><p>此语。世尊<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。上座善实。彼及比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。优婆塞优婆夷。彼天人阿修罗乾闼婆等。闻世尊说大欢喜</p><p>归命一切佛菩萨海等</p><p>金刚能断般若波罗蜜经</p></div>"
}]