[{
    "title": "金刚般若波罗蜜经 第237部",
    "author": "真谛 译",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a></p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>如是我闻。一时佛婆迦婆住舍卫国只陀树林给孤独园。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>于日前分。着衣持钵入舍卫大国而行乞食。于其国中次第行乞。还至本处饭食事讫。于中后时。收衣钵洗足已。如常敷座加趺安坐。端身而住。<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>现前。时诸比丘俱往佛所。至佛所已顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足。右绕三匝却坐一面</p><p>尔时净命须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。于大众中共坐聚集。时净命须菩提。即从座起偏袒右肩。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>佛足右膝着地。向佛合掌。而白佛言。希有世尊。如来应供正遍觉知。善护念诸菩萨摩诃萨。由无上利益故。善付嘱诸菩萨摩诃萨。由无上教故。世尊。若善男子善女人发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。行菩萨乘。云何应住。云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。云何发起菩萨心。净命须菩提作是问已。尔时世尊告须菩提。须菩提。善哉善哉。如是善男子。如来善护念诸菩萨摩诃萨。无上利益故。善付嘱诸菩萨摩诃萨。无上教故。须菩提。是故汝今一心谛听。恭敬善思念之。我今当为汝说。如菩萨发菩提心行菩萨乘。如是应住。如是修行。如是<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。须菩提言。唯然世尊</p><p>佛告须菩提。须菩提善男子善女人发菩提心行菩萨乘。应如是发心。所有一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>类摄。若卵生若胎生若湿生若化生。若有色若无色。若有想若无想。若非有想若非无想。乃至众生界及假名说。如是众生我皆安置于无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。如是涅槃无量众生已。无一众生被涅槃者。何以故。须菩提。若菩萨有众生想。即不应说名为菩萨。何以故。须菩提。一切菩萨<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>想众生想寿者想受者想</p><p>复次须菩提。菩萨不着己类而行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。不着所余行于布施。不着色声香味触法应行布施。须菩提。菩萨应如是行施不着相想。何以故。须菩提。若菩萨无执着心行于布施。是福德聚不可数量。须菩提。汝意云何。东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可数量不。须菩提言。不可世尊。佛言。如是须菩提。南西北方四维上下十方虚空可数量不。须菩提言。不可世尊。佛言。如是须菩提。若菩萨无执着心行于布施。是福德聚亦复如是不可数量。须菩提。汝意云何。可以身相胜德见如来不。不能世尊。何以故。如来所说身相胜德非相胜德。何以故。须菩提。凡所有相皆是虚妄无所有相。即是真实。由相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>应见如来。如是说已</p><p>净命须菩提白佛言。世尊。于今现时及未来世。颇有菩萨听闻正说如是等相此经章句。生实想不。佛告须菩提。莫作是说。于今现时及未来世。颇有菩萨听闻正说如是等相此经章句。生实想不。何以故。须菩提。于未来世实有众生。得闻此经能生实想。复次须菩提。于未来世后五百岁<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>灭时。有诸菩萨摩诃萨。持戒修福及有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。须菩提。是诸菩萨摩诃萨非事一佛。非于一佛种诸善根。已事无量百千诸佛。已于无量百千佛所而种善根。若有善男子善女人。听闻正说如是等相此经章句。乃至一念生实信者。须菩提。如来悉知是人悉见是人。须菩提。是善男子善女<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>长无量福德之聚。何以故。须菩提。是诸菩萨无复我想众生想寿者想受者想。是诸菩萨无法想非无法想。无想非无想。何以故。须菩提。是诸菩萨若有法想即是<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>及众生寿者受者执。须菩提是故菩萨不应取法。不应取非法。为如是义故。如来说若观行人解筏喻经。法尚应舍何况非法</p><p>复次佛告净命须菩提。须菩提。汝意云何。如来得阿耨多罗三藐三菩提耶。如来有所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>耶。须菩提言。如我解佛说义。无所有法如来所得。名阿耨多罗三藐三菩提。亦无有法如来所说。何以故。是法如来所说。不可取不可言。非法非非法。何以故。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>皆以无为真如所显现故。须菩提。汝意云何。以三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>遍满七宝。若人持用布施。是善男子善女人因此布施生福多不。须菩提言。甚多世尊。甚多修伽陀。是善男子善女人因此布施得福甚多。何以故。世尊。此福德聚即非福德聚。是故如来说福德聚。佛言。须菩提。若善男子善女人。以三千大千世界遍满七宝。持用布施。若复有人从此经中受四句偈。为他正说显示其义。此人以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。所生福德最多于彼无量无数。何以故。须菩提。如来无上菩提从此福成。诸佛世尊从此福生。何以故。须菩提。所言<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者即非佛法。是名佛法。须菩提。汝意云何。须陀洹能作是念。我得须陀洹果不。须菩提言。不能世尊。何以故。世尊。实无所有能至于流。故说须陀洹。乃至色声香味触法亦复如是。故名须陀洹。斯陀含名一往来。实无所有能至往来。是名斯陀含。阿那含名为不来。实无所有能至不来。是名阿那含。佛言。须菩提。汝意云何。阿罗汉能作是念。我得阿罗汉果不。须菩提言。不能世尊。何以故。实无所有名阿罗汉。世尊。若阿罗汉作是念。我得阿罗汉果。此念即是我执众生执寿者执受者执。世尊如来阿罗诃三藐三<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>。赞我住无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>人中最为第一。世尊。我今已得阿罗汉离三有欲。世尊。我亦不作是念。我是阿罗汉。世尊。我若有是念我已得阿罗汉果。如来则应不授我记。住无诤三昧人中须菩提善男子最为第一。实无所住住于无诤住于无诤</p><p>佛告须菩提。汝意云何。昔从然灯如来阿罗诃三藐三佛陀所。颇有一法如来所取不。须菩提言。不取世尊。实无有法昔从然灯如来阿罗诃三藐三佛陀所如来所取。佛告须菩提。若有菩萨作如是言。我当<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>清净佛土。而此菩萨说虚妄言。何以故。须菩提。庄严佛土者。如来说非庄严。是故庄严清净佛土。须菩提。是故菩萨应生如是无住着心。不住色声香味触法生心。应无所住而生其心。须菩提。譬如有人体相胜大如须弥山。须菩提。汝意云何。如是体相为胜大不。须菩提言。甚大世尊。何以故。如来说非有名为有身。此非是有故说有身</p><p>佛告须菩提。汝意云何。于恒伽所有诸沙。如其沙数所有恒伽。诸恒伽沙宁为多不。须菩提言。甚多世尊。但诸恒伽尚多无数。何况其沙。佛言。须菩提。我今觉汝我今示汝。诸恒伽中所有沙数尔许世界。若有善男子善女人。以七宝遍满持施如来应供正遍觉知。须菩提。汝意云何。此人以是因缘得福多不。须菩提言。甚多世尊。甚多修伽陀。有人以是因缘生福甚多。须菩提。若善男子善女人以七宝遍满尔所恒伽沙世界。持用布施。若善男子善女人从此经典乃至四句偈等。恭敬<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>为他正说。是人所生福德最胜于彼无量无数。复次须菩提。随所在处。若有人能从是经典乃至四句偈等。读诵讲说。当知此处于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>中即成支提。一切人天阿修罗等皆应恭敬。何况有人尽能受持读诵如此经典。当知是人则与无上希有之法而共相应。是土地处。大师在中。或随有一可尊重人。佛说是已。净命须菩提白佛言。世尊。如是经典名号云何。我等云何奉持。佛告须菩提。此经名<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。以是名字汝当奉持。何以故。须菩提。是般若波罗蜜如来说非般若波罗蜜。须菩提。汝意云何。颇有一法一佛说不。须菩提言。无有世尊。无有一法一如来说。佛告须菩提。三千大千世界所有微尘是为多不。须菩提言。此世界微尘甚多世尊。甚多修伽陀。何以故。世尊。此诸微尘如来说非微尘。故名微尘。此诸世界如来说非世界。故说世界。佛告须菩提。汝意云何。可以三十二大人相见如来不。须菩提言。不可世尊。何以故。此三十二大人相如来说非相。故说三十二大人相</p><p>佛告须菩提。若有善男子善女人。如诸恒河所有沙数。如是沙等身命舍以布施。若有善男子善女人。从此经典乃至四句偈等。恭敬受持为他正说。此人以是因缘生福多彼无量无数。尔时净命须菩提。由法利疾即便悲泣。收泪而言。希有世尊。希有修伽陀。如此经典如来所说。我从昔来至得圣慧。未曾闻说如是经典。何以故。世尊。说般若波罗蜜即非般若波罗蜜。故说般若波罗蜜。世尊当知。是人则与无上希有之法而共相应。闻说经时能生实想。世尊。是实想者实非有想。是故如来说名实想说名实想。世尊。此事于我非为希有。正说经时我生信解。世尊。于未来世若有众生。恭敬受持为他正说。当知是人则与无上希有之法而共相应。世尊。此人无复我想众生想寿者想受者想。何以故。我想众生想寿者想受者想。即是非想。何以故。诸佛世尊。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>诸想尽无余故。说是言已。佛告须菩提。如是须菩提。如是当知是人则与无上希有之法而共相应。是人闻说此经不惊不怖不畏。何以故。须菩提。此法如来所说是第一波罗蜜。此波罗蜜如来所说。无量诸佛亦如是说。是故说名第一波罗蜜</p><p>复次须菩提。如来忍辱波罗蜜即非波罗蜜。何以故。须菩提。昔时我为迦陵伽王。斩斫身体骨肉虽碎。我于尔时无有我想众生想寿者想受者想无想非无想。何以故。须菩提。我于尔时若有我想众生想寿者想受者想。是时则应生嗔恨想。须菩提。我忆过去五百生作大仙人名曰说忍。于尔所生中心无我想众生想寿者想受者想。是故须菩提。菩萨摩诃萨舍离一切想。于无上菩提应发起心。不应生住色心。不应生住声香味触心。不应生住法心。不应生住非法心。不应生有所住心。何以故。若心有住则为非住故。如来说菩萨无所住心应行布施。复次须菩提。菩萨应如是行施。为利益一切众生。此众生想即是非想。如是一切众生如来说即非众生。何以故。诸佛世尊远离一切想故。须菩提。如来说实说谛说如说非虚妄。复次须菩提。是法如来所觉。是法如来所说。是法非实非虚。须菩提。譬如有人在于盲暗。如是当知菩萨堕相行堕相施。须菩提。如人有目夜已晓昼日光照见种种色。如是当知菩萨不堕于相行无相施</p><p>复次须菩提。于未来世若有善男子善女人受持读诵修行。为他正说如是经典。如来悉知是人悉见是人。生长无量福德之聚</p><p>复次须菩提。若有善男子善女人。于日前分布施身命。如上所说诸河沙数。于日中分布施身命。于日后分布施身命。皆如上说诸河沙数。如是无量百千万亿劫以身命布施。若复有人闻此经典不起诽谤。以是因缘生福多彼无数无量。何况有人书写受持读诵教他修行为人广说</p><p>复次须菩提。如是经典不可思量无能与等。如来但为怜愍利益能行无上乘及行无等乘人说。若复有人于未来世受持读诵。教他修行正说是经。如来悉知是人悉见是人。与无数无量不可思议无等福聚而共相应。如是等人由我身分。则能荷负无上菩提。何以故。须菩提。如是经典若下愿乐人。及我见众生见寿者见受者见。如此等人能听能修读诵教他正说无有是处。复次须菩提。随所在处显说此经。一切世间<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗等。皆应<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>作礼右绕。当知此处于世间中即成支提。须菩提。若有善男子善女人。受持读诵教他修行。正说如是等经。此人现身受轻贱等过去世中所造恶业。应感生后恶道<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。以于现身受轻苦故。先世罪业及苦果报则为消灭。当得阿耨多罗三藐三菩提。须菩提。我忆往昔无数无量过于算数大劫过去然灯如来阿罗诃三藐三佛陀。后八万四千百千俱胝诸佛如来已<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>竟。我皆承事供养恭敬无空过者。若复有人于后末世五百岁时。受持读诵教他修行正说此经。须菩提。此人所生福德之聚。以我往昔承事供养诸佛如来所得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。比此功德百分不及一。千万亿分不及一。穷于算数不及其一。乃至威力品类相应。譬喻所不能及。须菩提。若善男子善女人于后末世。受持读诵如此等经。所得功德我若具说。若有善男子善女人。谛听忆持尔所福聚。或心迷乱及以颠狂。复次须菩提。如是经典不可思议。若人修行及得果报亦不可思议</p><p>尔时须菩提白佛言。世尊。善男子善女人发阿耨多罗三藐三菩提心。行菩萨乘。云何应住。云何修行。云何发起菩萨心。佛告须菩提。善男子善女人发阿耨多罗三藐三菩提心者。当生如是心。我应安置一切众生令入无余涅槃。如是般涅槃无量众生已。无一众生被涅槃者。何以故。须菩提。若菩萨有众生想。则不应说名为菩萨。何以故。须菩提。实无有法名为能行菩萨上乘</p><p>须菩提。汝意云何。于然灯佛所。颇有一法如来所得名阿耨多罗三藐三菩提不。须菩提言。不得世尊。于然灯佛所。无有一法如来所得名阿耨多罗三藐三菩提。佛言。如是须菩提。如是于然灯佛所。无有一法如来所得名阿耨多罗三藐三菩提。须菩提。于然灯佛所。若有一法如来所得名阿耨多罗三藐三菩提。然灯佛则不授我记。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。汝于来世当得作<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>释迦牟尼多陀阿伽度阿罗诃三藐三佛陀。须菩提。由实无有法如来所得名阿耨多罗三藐三菩提。是故然灯佛与我授记。作如是言。婆罗门。汝于来世当得作佛号释迦牟尼多陀阿伽度阿罗诃三藐三佛陀。何以故。须菩提。如来者真如别名。须菩提。若有人说如来得阿耨多罗三藐三菩提。是人不实语。何以故。须菩提。实无有法如来所得名阿耨多罗三藐三菩提。</p><p>须菩提。此法如来所得无实无虚。是故如来说一切法皆是佛法。须菩提。一切法者非一切法故。如来说名一切法。须菩提。譬如有人遍身大身。须菩提言。世尊。是如来所说遍身大身则为非身。是故说名遍身大身。佛言。如是须菩提。如是须菩提。若有菩萨说如是言。我当般涅槃一切众生则不应说名为菩萨。须菩提。汝意云何。颇有一法名菩萨不。须菩提言。无有世尊。佛言。须菩提。是故如来说一切法无我无众生无寿者无受者。须菩提。若有菩萨说如是言。我当庄严清净佛土。如此菩萨说虚妄言。何以故。须菩提。庄严佛土者如来说则非庄严。是故庄严清净佛土。须菩提。若菩萨信见诸法无我诸法无我。如来应供正遍觉说是名菩萨是名菩萨</p><p>须菩提。汝意云何。如来有肉眼不。须菩提言。如是世尊。如来有肉眼。佛言。须菩提。汝意云何。如来有天眼不。须菩提言。如是世尊。如来有天眼。佛言。须菩提。汝意云何。如来有慧眼不。须菩提言。如是世尊。如来有慧眼。佛言。须菩提。汝意云何。如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不。须菩提言。如是世尊。如来有法眼。佛言。须菩提。汝意云何。如来有佛眼不。须菩提言。如是世尊。如来有佛眼</p><p>须菩提。汝意云何。于恒伽江所有诸沙。如其沙数所有恒伽。如诸恒伽所有沙数世界。如是宁为多不。须菩提言。如是世尊。此等世界其数甚多。佛言。须菩提尔所世界中所有众生。我悉见知心相续住有种种类。何以故。须菩提。心相续住如来说非续住。故说续住。何以故。须菩提。过去心不可得未来心不可得现在心不可得。须菩提。汝意云何。若有人以满三千大千世界七宝。而用布施。是善男子善女人以是因缘得福多不。须菩提言。甚多世尊。甚多修伽陀。佛言。如是须菩提。如是彼善男子善女人以是因缘得福聚多。佛言。须菩提。若福德聚但名为聚。如来则不应说是福德聚是福德聚</p><p>须菩提。汝意云何。可以具足色身观如来不。须菩提言。不可世尊。不可以具足色身观于如来。何以故。此具足色身如来说非具足色身。是故如来说名具足色身。佛言。须菩提。汝意云何。可以具足诸相观如来不。须菩提言。不可世尊。不可以具足诸相观于如来。何以故。此具足相如来说非具足相。是故如来说具足相。佛言。须菩提。汝意云何。如来有如是意我今实说法耶。须菩提。若有人言如来实能说法。汝应当知。是人由非实有及以邪执。起诽谤我。何以故。须菩提。说法说法实无有法名为说法。尔时须菩提白佛言。世尊。颇有众生于未来世听闻正说如是等相此经章句。生实信不。佛告须菩提。彼非众生非非众生。何以故。须菩提。彼众生者如来说非众生非非众生故说众生</p><p>须菩提。汝意云何。颇有一法如来所得名阿耨多罗三藐三菩提不。须菩提言。不得世尊。无有一法如来所得名阿耨多罗三藐三菩提。佛言。如是须菩提。如是乃至无有如微尘法如来所舍如来所得。是故说名阿耨多罗三藐三菩提平等平等。复次须菩提。诸佛觉知无有差别。是故说名阿耨多罗三藐三菩提。复次须菩提。此法平等无有高下。是名阿耨多罗三藐三菩提。复次须菩提。由法无我无众生无寿者无受者等。此法平等故。名阿耨多罗三藐三菩提。复次须菩提。由实善法具足<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。得阿耨多罗三藐三菩提。须菩提。所言善法。善法者如来说非法故名善法。须菩提。三千大千世界所有诸须弥山王。如是等七宝聚满此世界。有人持用布施。若人从此般若波罗蜜经乃至四句偈等。受持读诵为他正说所得功德。以前功德比此功德。百分不及一。千万亿分不及一。穷于算数不及其一。乃至威力品类相应譬喻所不能及。须菩提。汝意云何。如来作是念。我度众生耶。须菩提。汝今不应作如是念。何以故。实无众生如来所度。须菩提。若有众生如来所度。即是我执众生执寿者执受者执。须菩提。此我等执如来说非执。婴儿凡夫众生之所执故。须菩提。婴儿凡夫众生者。如来说非众生故。说婴儿凡夫众生。须菩提汝意云何。可以具足相观如来不。须菩提言。如我解佛所说义。不以具足相应观如来佛言。如是须菩提。如是不以具足相应观如来。何以故。若以具足相观如来者。转轮圣王应是如来。是故不以具足相应观如来。是时世尊而说偈言</p><p>若以色见我以音声求我</p><p>是人行邪道不应得见我</p><p>由法应见佛调御法为身</p><p>此法非识境法如深难见</p><p>须菩提。汝意云何。如来可以具足相得阿耨多罗三藐三菩提不。须菩提。汝今不应作如是见。如来以具足相得阿耨多罗三藐三菩提。何以故。须菩提。如来不由具足相得阿耨多罗三藐三菩提。须菩提。若汝作是念。如来有是说行菩萨乘人有法可灭。须菩提。汝莫作此见。何以故。如来不说行菩萨乘人有法可灭及以永断。须菩提。若有善男子善女人。以满恒伽沙等世界七宝。持用布施。若有菩萨于一切法无我无生。得无生忍。以是因缘所得福德最多于彼。须菩提。行大乘人不应执取福德之聚。须菩提言。此福德聚可摄持不。佛言。须菩提。此福德聚可得摄持不可执取。是故说此福德之聚应可摄持</p><p>须菩提。若有人言如来行住坐卧。是人不解我所说义。何以故。须菩提。如来者无所行去亦无所从来。是故名如来应供正遍觉知。须菩提。若善男子善女人。以三千大千世界地大微尘。烧成灰末。合为墨丸。如微尘聚。须菩提。汝意云何。是邻虚聚宁为多不。须菩提言。彼邻虚聚。甚多世尊。何以故世尊。若邻虚聚是实有者。世尊则不应说名邻虚聚。何以故。世尊所说此邻虚聚。如来说非邻虚聚。是故说名为邻虚聚。如来所说三千大千世界则非世界。故说三千大千世界。何以故。世尊若执世界为实有者。是聚一执。此聚一执如来说非执故。说聚一执。佛世尊言须菩提。此聚一执但世言说。须菩提。是法非可言法。婴儿凡夫偏言所取</p><p>须菩提。若有人言如来说我见众生见寿者见受者见。须菩提。汝意云何。是人言说为正语不。须菩提言。不正世尊。不正修伽陀。何以故。如来所说我见众生见寿者见受者见即是非见。是故说我见众生见寿者见受者见。须菩提。若人行菩萨乘。如是应知应见应信一切诸法。如是应修。为令法想不得生起。何以故。须菩提。是法想法想者如来说即非想。故说法想。须菩提。若有菩萨摩诃萨。以满无数无量世界七宝。持用布施。若有善男子善女人。从此般若波罗蜜经乃至四句偈等。受持读诵教他修行为他广说。是善男子善女人。以是因缘所生福德最多于彼无量无数。云何显说此经。如无所显说故言显说</p><p>如如不动恒有正说应观有为法</p><p>如暗翳灯幻露泡梦电云</p><p>尔时世尊说是经已。大德须菩提心进<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。及诸比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>优婆塞优婆夷众。人天阿修罗等。一切世间踊跃欢喜。信受奉行</p><p>金刚般若波罗蜜经</p><p>西天竺优禅尼国三藏法师。号拘罗那他。此云真谛。梁武皇帝。远遣迎接。经游闽越。暂憩梁安。太守王方赊。乃勤心正法。性爱大乘。仍于建造伽蓝。请弘兹典。法师不乖本愿。受三请而默然。寻此旧经。甚有脱误。即于壬午年五月一日。重翻天竺定文。依婆薮论释。法师善解方言。无劳度语。瞩彼玄文。宣此奥说。对偕宗法师法虔等。并共笔受。至九月二十五日。文义都竟。经本一卷。文义十卷。法虔尔目。仍愿造一百部。<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>供养。并讲之十遍。普愿众生。因此正说。速至涅槃。常流应化</p></div>"
}]