[{
    "title": "七觉分略讲",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>七觉分略讲</strong></p><p><span>七觉分也叫作七觉支，具体分为：念觉支、择法觉支、精进觉支、喜觉支、轻安觉支、定觉支、舍觉支。</span><br/></p><p>第一，念觉支。修学了某种法，心心念念缘于这种法，而没有夹杂，这是念觉支的成就。</p><p>刚修学佛法时缘于某种法而修，缘着缘着心念一转就断了散掉了，心里不再念着，这种法即不现前，这时念觉支还未成就。比如修习净土念佛法门，一开始缘于佛号，缘着缘着就散掉了，心里没有了佛号，也没有了往生的念头，这时念觉支未成就。某种法修到一定程度，功夫绵密，念觉支生起来时，于法念念不忘，这时念觉支已修习成就。</p><p>比如修行四圣谛之理时，如果心心念念都是四圣谛理，心念都在观行和思考苦集灭道之理，念觉支就修成了。一开始心里不念不着四圣谛法，对四圣谛法没有思惟，没有观行，没有念想，后来心心念念缘于苦集灭道，那么遇缘对境就立即想起：这法是苦的，苦是如何出现的，是如何集结起来的，要如何修道如何灭掉苦，心念时刻不离于苦集灭道，这时四圣谛法的念觉支已成就。</p><p>念觉支是七觉支当中的第一个觉支，念觉支成就，是我们修学佛法的首要条件。如果不能念念于所修的正理，就不能于正理精进；不能于正理生起喜乐；不能生起轻安；于正理不能生起抉择和决定；心里不能舍除不如理作意和不如理之法，仍然着于世俗的贪嗔痴烦恼。</p><p>比如修菩萨六度，心心念念缘于菩萨六度的修行上，会时刻检查自己的内心，自己的布施福德积累得怎么样，自己的持戒情况怎么样，遇到犯戒时立刻想起：我应该严格持戒，不应该有所违犯。修禅定时心散乱，自己应该警觉到：我现在没有禅定，应该把心收摄回来。般若智慧不足，遇到佛经看不懂时，就应该知道自己的般若智慧还不足，应该努力弥补。某种法理还没有明白，又落到世俗境界相当中，自己应该知道：我般若慧修的程度还很差，应该再精进。如此这般，心处于念觉支状态，则住于菩萨六度。念觉支成就了，才能精进修学菩萨六度。当念觉支成就时，心念与法相应，时时刻刻念着法。心念与法不相应，念觉支则没有成就，只成就一半或者某一部分。念觉支成就以后，时时刻刻能念着佛法，主动观行佛法，最后才能证得佛法。</p><p>念觉支是修学佛法的初级阶段。念觉支成就以后，后面的择法觉支、精进觉支、喜觉支、倚觉支、定觉支、舍觉支才能成就。自己有没有念觉支，心里应该清楚。念觉支没有生起之前，要清楚知道没有生起，生起了以后，要清楚知道已经生起了。如果念觉支没有修足，应赶快加强修行。在修行中，我们应该时时刻刻检查自己的心念处于哪种状态，哪种程度。对自己要加以关注有所了解，才能够改善自己，完善自己，如果不了解自己，就不能对治自己，不能完善自己所修。</p><p>修行每种法都有念觉支，念觉支也有层次上的差别，比如修学唯识，念觉支没有成就是很正常的，因为这属于菩萨的道种智，我们智慧力不足，不可能成就念觉支。但是在我们目前应该修学的法上，念觉支应该要修学成就，比如说没有断我见的人，心里应该时时刻刻念着断我见的内容五蕴空无我，念念在观行五蕴的生灭无常，心念都与断我见之理相应，这时侯念觉支就生起来了，至于成就没成就，圆满没圆满，那还需要进一步来检查，直到念觉支成就和圆满。</p><p>在参禅阶段，要检查菩萨六度方面的念觉支是否成就，检查般若智慧修习程度如何，内心是否能缘于般若这一法，遇缘是否能联想到般若空性，是否能意识到都是第八识所现起来的法。或者在接触一切法时，都要寻觅第八识究竟在什么处所，时刻念着：我如何明心，如何证悟，如何参禅，如何修定，这就是我们目前修学应该具有的心念，并且应该让念觉支不断增进。如果我们的心念跑到世俗法上去了，说明我们心念还不够坚固，念觉支还没有成就，应该再强化自己的心念力。</p><p>择法觉支。要知道自己的内择法觉支是否生起来了，就要细心检查自己对于法的辨别力，经过一段时间的检查之后，确认自己有一定的辨别力，就知道自己的内择法觉支已经生起来了。对自己修行的状态、内容、程度，都要进行反观，那么修行就有步骤有层次有内容了。这些步骤心里清清楚楚，就会知道我们目前应该如何来修学，不会心乱如麻，茫无方向，见什么法学什么法，而是有次第有步骤地修学，按部就班地修行，这样就知道自己的内择法觉支已经修习成就了，</p><p>择法觉支，就是对目前应该修的法，具有一定的抉择之力，心里应该了解此法是正还是邪，是大还是小，在佛法当中属于什么层次。遇到与自己智慧层次相应的法，有正确的抉择力，能够做出正确的抉择，就说明择法觉支生起来，具有择法眼了。</p><p>有了择法觉支，不管遇到什么法，什么人讲法，都有一定的辨别力和抉择力。此师所讲的法，是大乘还是小乘，是正道还是邪道，是否符合佛意，他本身智慧层次到了哪里，能不能帮助自己和众生断我见，能不能引导自己和众生明心见性，应该有一定的择法眼来辨别和抉择。要不要修这种法，什么时侯修，自己心里都要有一个量度，才能做出正确的抉择。</p><p>对于很高深的法，暂时没有抉择力，是属于正常的。有些人对于稍微比自己层次高的一些法，也有一定的抉择力，但这个抉择力肯定不是很大，不是很充分，抉择的力量虽不够强大，有个粗略的辨别就可以了。</p><p>第三，精进觉支。如果没有择法觉支，还不具备择法眼，能不能精进呢？无法真正的精进。比如有两条道路，其中一条是正确的，另一条是不正确的，如果选错了，就是南辕北辙，那么精进的方向错了，是不是越精进离正道就越远？所以，在精进觉支生起来之前，应该要具备择法觉支。</p><p>选择了正确的修行之路、修行之法，或者选择了一位明师之后，才能够对某法精进地修行，或者跟着某师精进地修行，这是正精进。如果择法觉支没有完善，选择了一条不正确的佛法修行之路，越精进就越浪费精力，越耽误时间，这是邪精进，而正精进，精进一分就能获得一分的智慧成就。</p><p>精进包括很多方面，比如修行菩萨道，布施、持戒、忍辱、禅定，都要精进。任何一个法，只要能走向明心见性，都要精进地修行。这是精进觉支。内精进是意根的精进，这是真精进究竟的精进；外精进是意识的精进，还不是真正的精进，还需要继续熏习意根。</p><p>第四，喜觉支。精进一段时间之后的结果是什么？对于某种法修学方向正确了，生起一种喜乐之心，越学心里越高兴，越法喜充满，越学越有成就感，内心获得了一种轻微的解脱功德。所谓的喜乐，一个是内心喜悦，再一个是对于法的喜爱，这就是喜觉支。</p><p>如果修了很长时间，心里的喜觉支始终没有生起来，说明修学还不得力，或者是精进度还不够，或者是选择的法不对，或者是念觉支没成就。学法学对了，到一定时候一定有喜觉支生起，内心充满喜乐，因为身心已经获得利益，没有获得利益，不会生起喜乐心来。比如自己得到一件东西，觉得对自己挺有用，心里就会很高兴，如果觉得这件东西没有用或者用处不大，心里就不会高兴。</p><p>第五，倚觉支。内心生起喜悦以后，会出现什么现象？烦恼就会压伏下来，五盖减轻，然后内心生起轻安的觉受，这就是倚觉支。这个倚是倚靠安歇的意思，身心都安歇下来，代表内心轻安的意思。到这时越修心里越轻松越自在，越感觉解脱，身心越放松，能保持下去，说明倚觉支成就，保持不下去说明倚觉支退失。</p><p>倚觉支又叫轻安觉支。轻安指的是内心非常轻松安然自在，身体轻盈不沉重。身和心是互相依赖、互相依存的，身体出现变化，心就出现变化，心出现变化，身体就出现变化，身心相应。心里喜乐或者轻松自在，身体就轻盈飘然，身体如果轻盈飘然，心则是轻松愉悦。身体搞不好，心境也不会愉悦轻松自在。当禅定出现时，身体觉受很轻盈，心一定是非常快乐的；当学法学得非常快乐的时侯，身体一定是轻松安然的。</p><p>禅定指身体和心都得定，缺少一个都不叫禅定，离不开身体而定，也离不开心而定，二者相辅相承。禅定能让人获得一种轻安、轻盈、自在的感觉，所谓轻盈，指的是色身轻盈，不沉重，同时心也愉悦舒适，心量增大，轻安的觉受与上界相应，有脱离人间本地的趋势，这是定的征兆。很多人都没有修到这种状态，身体还是很沉重，内心也没有生起喜乐、轻松、自在和解脱的感觉，说明修行还不得力不如法。</p><p>当修到出现轻安的觉受时，行走坐卧的状态就不同以往了，心里的状态从面部表情和身体的姿态上就能看得出来。所以，一个人有没有道，修到什么程度，是不是明心了，明眼人一看就知道了。过去的禅师都有那慧眼，弟子参禅参到了某一天，满面春风的走过来，浑身透露出那股好像是得道的气势，师父一看，不用弟子说话就知道了。证道是有标志的，不是说，断我见证果和明心了，身口意还与从前完全相同，没有一丝差别，更不能比从前还差烦恼还重。刚明心见性，刚断我见时的身心状态，别人一看，就能看出来跟从前不一样。修到倚觉支的时候也是这样，身心都有变化。</p><p>第六，定觉支。倚觉支成就了以后，禅定就会出现了，所谓禅定，一是对法的决定，再一个是身心寂静，身体安然不乱动，心能专一深细思惟不散乱，处于不动的状态中。所谓定就是不散乱，能缘于法深入进去，不受外界干扰，心住于法上。这两种定都具足，才是完整的禅定。</p><p>修到未到地定具足时，心比较沉稳和集中，思惟法义时很快就能把心沉下来深入法义中，不会烦躁不安，不会浮在文字表面而深入不下去。到这种状态禅定就成就了，不管腿能不能盘，内心都与禅定相应，行住坐卧都能有定，这样就能深入到佛法当中。这就是定觉支。 </p><p>在倚觉分的时侯就有初步的定，前面的倚觉分没修出来，不可能出现后面的禅定。即使强行坐很长时间，因为没有倚觉分，得定也很困难，有了倚觉分，入定才容易，行走坐卧有禅定，身体状态就显示定已经出现了。</p><p>所以修出喜觉支和倚觉支之后，才能有定觉支，定是由喜和倚两个觉分所引发出来的，前面还有精进觉分、择法觉分，这些一连串的觉支引发后面各个觉支，一个比一个深入，没有前面的觉支就没有后面的觉支。如果说一个人证果了，这些现象都没有，那证的是什么果？如果说一个人明心了，这些身心上的相貌觉受状态都没有，那明的是什么心？所以证果与否明心与否瞒不了过来人，就看那身心状态，一眼就看得出来，即使他一句话不说，那个脸面脸色神情就把得法与否的心境显示了出来。是否有道，那一开口说话更能判断出来，瞒不过明眼人。</p><p>第七，舍觉支。禅定生起来之后，降伏了各种心念，心才能住于平等的舍境，不苦不乐，不喜不悲，平平淡淡，既不贪执也不嗔恚，内心清清静静。舍觉支的舍是舍去的意思，原来有什么东西需要舍去的？心里有喜有乐，有贪有嗔，有粗重的觉观思惟，有散乱有波动，都需要舍去，达到舍受。二禅以前还有觉观有念，心里还有喜乐受没有舍去，到了四禅，舍念清静，一个念头都没有，更是舍，叫作舍念清净。</p><p>心里有苦受和乐受，是散乱，心里念头不断，思想忆念不断，是散乱，当禅定生起时，苦受舍去了，乐受舍去了，粗重的觉观舍去了，散乱的思想舍去了，内心对过去的追亿舍去了，心念澄清了，心就清静下来了，这就是舍觉支。七觉分修到最后，把内心的一切繁乱和粗重都要舍除，舍觉支就成就。</p><p>在这样的状态下，所思惟观行的佛法才能入心，意识思惟才能深细，意根才能专心考量意识思惟的过程和结果，才能受熏，才能接受，才能产生智慧。内心不断受到搅扰，不能清静，就不能深入到佛法中去，就不能受熏，也就没有智慧的生起。舍觉支生起时，心里是平静的，就像没有波浪的湖水一样波澜不起，佛法才能渗透到内心里滋润心田，才能生长智慧苗。如果内心总是充满喜乐，定力不足，心思比较浮躁，观行不充分，佛法深入不到内心里，不能证果开智慧。</p><p>清净的心念应该是舍心，有些学佛人念佛境界比较好时，定中看见佛菩萨出现，心里非常欢喜，如果不能化解这种心境，总是喜欢着佛菩萨的相，心就不清净，容易入魔境。有些人在修行中心里总是生悲，为自己生悲，为众生生悲，感觉世界都是苦，苦得受不了，这是住于悲魔了，心念也不清净，修到最后悲和喜这两种心念全部舍除，住于一种平静平淡平稳平等的心态，才能深入到佛法当中。住于那种最正的心念状态中，才能够观行成就，从而能断我见明心证悟。</p><p>七觉支是一环扣一环的，没有前面的环节，就没有后面的环节，前面这些路都走过了，最后才能断我见证果，这是证果的前行条件。所以这些经历如果都没有，就不能断除我见，哪个觉支都没生起来，也不可能断除我见，从来没有精进过，从来没有生起过喜乐之心，身心从来没有轻安过，对法的认知还不够深，观行就不能成就，尤其是从来没有观行过，更不可能断除我见。只有三果四果人再来的，今世遇到佛法稍微加以思惟，听闻关键性的一句话，稍微加以思惟观行，就能证果，不用一个法一个法的反反复复思惟观行。头一次证果的人，必须要反反复复仔细深入观行，七觉支都要深入修习，并且都要修成就，才能断除我见。即使三果四果人再来，遇到佛法之后，也要快速的生起这些觉分，然后才能证果。</p><p>无始劫来第一次断我见的人，这些觉分生起来可能要非常非常的慢，持续时间非常的长，每一觉分要非常坚固非常稳定，才能进入下一阶段。前世已经证果的再来人就不用这样，七觉分的生起一个连着一个很快，像舍利佛和目犍连这些大阿罗汉都是一瞬间就完成了，禅定也瞬间生起，他们的观行一念间就成就，脑子里一闪念就完成了。因为他们前世都完全具足了七觉分，而我们今世是第一次起修，需要的时间就要长久一些。如果七觉分不成就，没有修出来，或者修出来后没有持续一段时间就消失了，那是不能断我见的，如果非要这样说就是妄语。一个证果的人其身心的外在表现，与之前相比肯定有变化，因为毕竟有了初步的解脱功德受用，身心一定会转变一些的。</p><p>佛说：或于内法观法而住，又于外法观法而住，又于内外法观法而住。观七觉支法时，分为观内七觉支法和外七觉支法，以及内外七觉支法同时观。内七觉支法就是内心深处比较隐秘的意根所修的七觉支，外七觉支就是意识所修的七觉支，然后对内外七觉支同时观行而住。然后又观这些法生起来，观到把心念住于法上，然后观行这些法灭去而住，同时又观这些法的生灭而住，到最后心里有一个念，全部是七觉支法的念。再把这些法的念舍掉，心住于一无所有的状态，住于空的状态，把心里的任何一种念都要空掉，心无所依，就这样住着，这也是舍觉支。每种观行后面都要舍除心中所念所想，住于舍念中，最后舍念也除，才为究竟。</p><p>如是，七觉支法就修完了，这叫观七觉支法而住。 </p><p>佛在这部经中把七觉支分为内七觉支与外七觉支，真正的内心深处生起七觉支指的是意根的七觉支分，而表面生起的七觉支分指的是意识层面的七觉支分。意识所生起的外七觉支实际还没有熏习到意根的内七觉支，但真正要生起七觉支最主要的还是意根的内七觉支。</p><p>念觉支分为意识的外念觉支与意根的内念觉支。意识生起了外念觉支，但是如果意根不愿意被意识所熏习，意根还是会向外四处攀缘散乱，不愿意缘意识所念。意根没有念觉知，不念意识所念着的法义，意识的念觉支就不起作用，就会散坏掉。因为没有熏习到意根，意根的内念觉支不成就，那么后续的其它觉知都不能出现，就不能证果断我见。当念觉支真正成就的时候，不仅有意识的外念觉支，还需要有意根的内念觉支成就，这两个都非常重要。意根的念觉支出现了，才能促使后边的觉支出现。</p><p>意根如果念念都不离所修的法，才能够每天持续的在法义上专注思惟，即便是吃饭睡觉都念着法，都不离思惟法义，这样的念觉支才是究竟的，因此内觉知支与外觉知缺一不可。又例如意根想要修四圣谛法，祂念念都缘于四圣谛法，想把四圣谛法弄清楚，意识心就要配合意根不管行住坐卧，念念都是四圣谛法义。因为意根的心念实在太坚固了，牵引着意识必须随顺意根，这个坚固的心念就是意根的内念觉支。</p><p>单单只是意识具有的念觉知，会因意根处处攀缘的缘故而断去，所以初步的成就落于意识上，意识的念觉知成功的熏习了意根，意根的内念觉知就能成就，所以真正的成就还是落于意根上。由上可知一切法都要熏习到意根才能成就，没有熏习到意根，都只是意识层面的修学，不能证得法义。</p><p>择法觉支分为意识的外择法觉支，与意根的内择法觉支。外择法觉支先出现和成就，才能熏习意根，内择法觉支才能出现和成就。意识的外择法觉支是间断性的，不起决定作用，真正选择所修学的法时还会犹豫不决。而意根的择法觉支成就时，能自动自觉的选择正确的佛法来修学，不会走岔路和偏路。</p><p>意根的择法觉支就是抉择性，是由意根的思心所作用的。意根的思心所非常伶俐和快速，比如当出现突发性的重大事故时，意识的思惟抉择还没有生起，这时候意根的抉择性直接起用，或闪躲或作其他行为来躲避危险，当一系列的行为完毕后意识才反应过来。如果这时是在叉路口抉择走哪条道路时，意识还未来得及考虑，意根就依照祂的思心所来抉择了。</p><p>又比如同一时间内发生了三四件必须要处理的紧急事情，意识凌乱如麻没有办法抉择时，就要靠意根的思心所来抉择采取行动。意识只能配合着意根来造作，意识没有办法考虑和抉择了。但意根的抉择性还是需要意识不断的熏习，在多数法上才能有正确的抉择性。所以意根具备择法觉支，我们才能够精进的学法，如果意根还没有具备择法觉支，只有意识具备择法觉支还是不行的。</p><p>精进觉支分为意识的外精进觉支，与意根的内精进觉支。在一切法的修学中，如果只有意识想精进修学，而内心深处的意根却不想精进，那就无法精进修习，这个法就修不成就。比如有些人虽然表面上看起来很用功修行，读了很多书，学了很多佛法，可是意根不感兴趣，也不深思，对所学法不知不解，那么意识的修习犹如走马观花蜻蜓点水一样，意根心猿意马，结果什么也没学明白。又比如学生在听老师上课，知道不认真听课考试就不及格，表面好像有在认真的听老师上课，内心却止不住的想东想西，看书时一目十行硬背也记不住，一节课下来问学生学了什么有什么心得，学生什么也答不出来。有些不爱学习的小学生就是这样，坐在课桌边好像很专心听课的样子，可是意根魂不守舍，思想不知道飞到哪里去了，老师的声音左耳朵进去，从右耳朵直接就出去，一点也没有留在意根里，那就白学了。</p><p>意识心表面的精进，没有深入到意根就是外精进、假精进。所以任何一个法都要意根内精进才能够成就，意识的外精进像浮萍一样飘浮不定。只要意根的内精进成就了，即使在参禅时意识与他人谈话喝茶，或做其他事，都不影响意根的内精进，意根自然心心念念于参禅不断。参禅时或者是思量时，意根可以与意识同步，也可与意识不同步，但是意根与意识同步一起参禅比意识和意根单独的参禅要更深入些。静坐参禅配合行走参禅，意根与意识同时专注于一个法上，那思惟的就更明了，这时候就全心全意了，意识不用分神于其他法尘，意根不用接收来自于意识更多的信息。在活动当中的意根和意识分神很多，不够专注时，思惟的比静中思惟浅一些。总之，意识与意根同步精进，才是真精进。</p><p>喜觉支分为意识的外喜觉支，与意根的内喜觉支。先由意识对法义生起喜乐心爱乐心，而后熏习到意根，使得意根对法义也生起喜乐心爱乐心。意识的喜觉支比较肤浅，转瞬即消失，不久远不牢固，并不会带动身心的变化。而意根生起的喜乐心，比较深沉和坚固，会让整个身心充满喜乐，这样才能有后面的倚觉支，身心都轻安。意识喜乐与意根喜乐有区别，意根喜乐时喜笑颜开，眼睛里和面部上的神情都表露出意根的喜乐，意识的喜乐有些敷衍和做作的意思，并不真诚。</p><p>倚觉支分为意识的外觉支，和意根的内觉支。意识降伏了粗重的烦恼和盖障，生起了轻安和清凉，进一步熏习意根，意根也降伏了粗重的烦恼和盖障，使得身心都轻安舒适起来，之后就要发起禅定了。</p><p>定觉支分为意识的外定觉支，与意根的内定觉支。意识生起禅定之后，牵引意根不得不定时，这样内外定觉支就生起来了。如果只有意识的定觉支，没有意根的定觉支，那么意识的定觉支不长久不坚固，必然要散灭掉。意根有定觉支时，心心念念在于定中，不散乱不昏沉，思惟细密，能够生起真实的智慧。定觉支有二，一是定于所修行的法上不动摇，二是发起禅定，深入定中，专精思惟，不离不弃。定觉支保持到比较坚固的时候，就能修出舍觉支。</p><p>舍觉支分为意识的外舍觉支，与意根的内舍觉支。当禅定生起之后，在定水的滋润下，意识和意根的心念逐渐清净澄清下来，杂念去除了，心中所留存的法的念也渐渐减轻，最后心中凡有念都要舍去，清清净净，了无挂碍。最初是意识舍去了心念和觉观，继而意根也舍去了心念和各种知见，不喜不厌，平和中庸。真正的舍念成就是由意根成就，意根想要无念就无念，意根执著时，其心念意识可能无法控制，而且还要配合着意根而产生念。意根把喜乐心、憎恨心等等一切的心行都舍了，才能深入正法，专心于参究。当意根舍念清静时，六识就波平浪静。</p><p>到最后意识和意根心心念念都是七觉支的法，再把心里的七觉支的法都排除掉，任何一法也不住，这样就舍念清净了。依这样的修行方法，心里一法也不住，意根像如来藏一样一法都不执着，空空如也，到最后就能究竟成佛。修行就是用以契出契的方法，好比手上有刺，用针挑除刺，刺挑除以后，针就没用了，把针再舍掉。用佛法剔除世俗法，用深法剔除浅法，用更上的法剔除深法，最后舍弃一切法，就成就了。</p><p>学佛修行就是用佛法来破众生的无明，用更深的法破更深的无明，无明都破除了，不用再修佛法，佛法只能用来度众生。意识的外舍觉支舍除心中的法，意根的内舍觉支也把心中的法舍掉后，心里空空的，这时候什么念都没有了，舍念清净，就入甚深三昧。定成就智慧就能成就，在定中观行就能证法，后续的修行要相续证得如幻观，阳炎观，如梦观，镜像观等等所有甚深三昧境界。</p></div>"
}]