[{
    "title": "第一章 四念处观行理论",
    "author": "生如法师",
    "date": "2022年01月11日",
    "html": "<div class=\"B1_text\"><p dir=\"ltr\"><strong>第一章  四念处观行理论</strong></p><p dir=\"ltr\"> 一、如何观行四念处</p><p dir=\"ltr\">观就是观察、观照、发现、发觉，事情是怎样的，就应该立刻知道是怎样的，不用意识去加工。也就是说发生了什么事就观察什么事，比如观呼吸，要尽量观察到有关呼吸的所有状况，其他的都不要管，不要去分析，不要去理解，不要去推理，不要去想象，不要去猜测，不要去整理，不要去归纳，不要去概括，不要让意识忙忙碌碌的，只静静的、安安心心的观察就好了，如实观察就行，不要多事。</p><p dir=\"ltr\">观察以后的事情，自然会有意根去面对，去考究，去思量，意识不能代替意根觉悟诸法，所以让意识保持清净，如实观察就好，大事由意根自己亲自拿主意，无明需要意根亲自去破除，真理需要意根亲自去发现。如果在观察呼吸时，呼吸的现象观察不到，说明禅定力不足，心还是很粗，需要加强觉照力，集中注意力，降伏散乱心，要一点点的深细观、全面观，按照四念处经原文去观，就会提高观察力。</p><p dir=\"ltr\">二、如何观呼吸（一）</p><p dir=\"ltr\">什么是观行？观行就是观察、省察、审议、思量，比如眼前有一朵花，观察花的整体形态、局部形态，观察花的姿态、品种、色彩、花瓣、韵味、新鲜与否等等，这就是观行。观行四念处也是如此观，四念处是观身不净、观受是苦、观心无常、观法无我，第一观是观身不净，先观呼吸，按照佛经里所讲的内容一步一步观行，就能观察到呼吸时色身的种种状况。</p><p dir=\"ltr\">比如观察正在吸气，吸气的时候气是从哪儿入进来的，观察一下就发现气是从鼻孔入进来的，中间经过了鼻腔，进入到肺里，再顺着任脉进入丹田里，这是气入的一个过程，观察这个吸气过程中色身上出现的种种现象以及觉受，吸气是长还是短，气息是冷还是热；然后观察呼气时色身的种种状况，要知道气是从哪里往外出去的，都经过了哪些地方，有什么感觉，出到哪里去了，气息是长还是短，是冷还是热。在整个呼吸过程中，观察呼吸是深还是浅，是顺畅还是不顺畅，气息到达哪里了，呼吸是长是短，这些现象都要知道，这个过程就叫作观行。</p><p dir=\"ltr\">在观行的过程中定力会增长，因为所有精力集中在呼吸上，没有杂念，容易得定，内心里有一个知，知所观法，知呼吸，对于所观的法都要有知，这样心不会散乱。在观行的过程中，由无明的知渐渐会过渡到有明的知，明知就是智慧，由于有定有清明的慧，观行到一定程度，因缘时节到了，就知道呼吸是无常生灭的法，是空的苦的法，是无我的法，智慧就生出来了，这样容易断我见，但知道不等于是证得。</p><p dir=\"ltr\">四念处经不仅是修定的经，也是修慧的经，四念处经是教导止观同时运行、定慧等持的经，定中带着一个知，知到一定程度，从无明的知过渡到了有明的知，知道你所观的一切法都是无常生灭变异空苦无我的，这样解脱慧就生出来了，心里有观也有知。由无明的不知到有明的知，都有一个过程，其中不需要太多的思惟分析，只要有一个明明了了的知，不是用很多的意识心，去思惟考量比较推理归纳总结概括，这些都不需要，只要保持一个现量的知，只要保持知，到一定程度智慧就会出现。思考问题：为什么保持一个现量的知，就能生出智慧，从而就能断我见证果？</p><p dir=\"ltr\">三、如何观呼吸（二）</p><p dir=\"ltr\">观呼吸时应该把所有的精力都放在呼吸上，不要管身体会怎么样，将来会不会出阳神等等。道家的阳神跟我们没什么关系，太多的东西不需要了解，我们了解气脉对色身的影响就可以了，知道这个理论就可以了，不要管阳神，我们不是修阳神，而是为了修心，是为了证果断我见，身体方面会出现的情况稍微了解一下就可以了，太深太多修身知识的跟我们修心没关系，不要把精力用在不必要的地方。</p><p dir=\"ltr\">我们修学四念处，现在以观呼吸为主。除了呼吸之外，其他的色身的方面尽量少关注，注意力只在呼吸上，观呼吸到一定程度，定力增强了，会发现色身的空、虚妄、无常以及无我等等客观之理，如果太多关注色身，就会把注意力分散了，影响观呼吸。</p><p dir=\"ltr\">观的时候尽量客观，冷静的去观，不要加入主观意识，这个色身的状态是什么，知道就好，不要加入过多的思想和引导等这些观念。初期你可以调息，过后就不要再调息了，要随息，这样你的心自然就会跳出五阴身之外，回头来观五阴身和呼吸，站在制高点上回头来观色身的状态。这样一方面容易入定，另一方面是容易生起智慧，会发现很多真相。原来不知道的真理，现在就知道了，慢慢就会觉得色身是那么的无常，那么的不真实，那么的虚幻，慢慢就会升起无我的智慧。</p><p dir=\"ltr\">四、如何调理身心快速进入观呼吸状态 （一）</p><p dir=\"ltr\">坐好后合掌三称南无本师释迦牟尼佛，念诵的时候要慢一些，同时观想佛光照耀自己的全身，念完之后心静下来接着调整呼吸，有些人坐下后心比较静，那么这时候就不用调呼吸，可以直接进入打坐禅定状态。</p><p dir=\"ltr\">如果一开始心比较散乱，观不了呼吸，需要先念佛或者念咒，念佛时也是用呼吸念佛的方法念佛，这样念佛其实也是调呼吸，慢慢的把气体通道给打通了，气息就能够下到丹田。气息一下到丹田，意念也会跟着到丹田，或者说意念到丹田，气息也随之到丹田，这时候丹田处会觉得发暖发热，妄念少就容易得定，当身体安静下来时，心也就安静下来了。</p><p dir=\"ltr\">需要注意念佛的时候速度要放缓，慢慢的念，越慢气息就调整的越好，心念也越集中不散乱，这样下一步观行才会有效果。当深呼吸念阿弥陀佛的时候，因为念的速度非常慢，精力非常集中，就能很快出现禅定，这时候就不容易有妄念，因为注意力全部集中在念佛号和听佛号上，这样就有助于减少妄念和止灭其他的妄念，只有佛号这个念，念到后面定禅定出现了就念不出声音了，这时候就身心静止了。静止时就把这个心念转移到观呼吸上来，继续观行自己的呼吸状态，这样的方法有助于观行。</p><p dir=\"ltr\">还有一个调理身心的方法就是做深呼吸，深呼吸的时间长短要根据个人身体的具体情况而定，如果身体状态比较好，一次两次呼吸，或者三五次深呼吸就可以得定，有些人可能要做十次。进入状态后就开始观呼吸，前面呼吸已经调好了，这时候气血运行正常，心念能够集中就开始入观。具体观行方法要依照佛经里讲的观行方法和次第，一点点来深入观行，譬如现观色身会毁坏不能长久，意识觉知心不是我，思量作主的意根不是我等等，这时候打坐就不至于昏沉了，因为有一个很深的所缘境，心能够专注思考，就不容易昏沉。</p><p dir=\"ltr\">五、如何调整身心快速进入观行状态（二）</p><p dir=\"ltr\">打坐观行时，为了能够尽快把心清静下来，就要先调好呼吸，让气血顺畅运行，身调好了心才能静下来，心念才能集中，这时候再观行头脑就会清晰明了。如果观行还是不能清晰明了，就要先念佛或者念咒来调整身心，念时语速一定要慢，慢慢的念，念的越慢，气息调整的越好，心念越集中不散乱。如果能够同时观想佛，观想佛光照耀着全身，就会获得加持力，心能很快静下来，就可以直接进入观行状态。所以静坐观行之前调心念调呼吸是很关键的一步。</p><p dir=\"ltr\">调整好身体，气血运行的好，心才能静下来，观行才会有效果。心静不下来的时候，可以做几次深呼吸来调整，也可以用呼吸念佛方法调整，用呼吸方法念佛其实也是调呼吸，慢慢的会把身体前边的任脉打通，让气息达到丹田，气入丹田心念就会集中了，其他妄念就会消失。意念到丹田里以后，呼吸自然就会顺畅，丹田就会发暖，全身舒适容易得定，身体安静下来，心也就安静下来了。</p><p dir=\"ltr\">调呼吸做深呼吸的次数和呼吸长短，要根据个人身体情况，身体素质好的妄念少的一次至五次深呼吸就可以了，最多做十次深呼吸就可以了，多了会累，效果反而不好。心静下来以后再观呼吸，观身不静，按照观行的次序一点点观。 如果前面的法没有观行纯熟，就不要观后面的法，前面的观行基础牢固了再观行后面的。</p><p dir=\"ltr\">用呼吸念佛方法调整身体的时候，要注意都是呼气的时候念佛，吸气时念不了，要用后膛音出声念，音流的震动能够把五脏六腑堵塞的地方震动开，气流能直下丹田，把前面任脉打通，身体就调好了。因为念佛的时候非常慢，不容易有妄念，又能调整呼吸，最容易得定，因为慢，注意力就会全部集中在念佛号和听佛号上，心容易沉静下来，有助于减少和止灭妄念。禅定出现时就念不出声音来了，这时就静止，心念清净就能清晰的观呼吸。</p><p dir=\"ltr\">这样调整好身心气血通了的时候，再打坐就不至于昏沉了，昏沉主要是气血不通导致的。再有一个很深的所缘境，心能够专注，就不容易昏沉。气血不通营养供应不上大脑的消耗，就容易昏沉，昏沉的原因，就是身体气血没有调好，调好了就不会出现昏沉现象，这样就进入正常的观行状态了。</p><p dir=\"ltr\">六、如何练习从静到动的观呼吸</p><p dir=\"ltr\">在打坐观行的功夫纯熟以后，要练习在日常活动的时候心能保持静止，并且还能继续观呼吸。打坐坐的很清净，观行很专注的时候，试着慢慢的下座在地面经行，走路散步或快或慢，观察这个时候自己的心念，是否还能缘于呼吸上，是否能不随周围的尘境转动心念。如果心念能不被转走，说明观呼吸的定力很好，然后就可以练习在任何时候任何场景都能专注的观呼吸。如果在活动中还能观呼吸，制心于呼吸处而不移转，说明这个定力非常好，比在打坐时的定力还要强，这样观呼吸的功夫就相当深了，行走坐卧的功夫能够连成一片。</p><p dir=\"ltr\">七、以静定为基础修动中定</p><p dir=\"ltr\">动静结合的定比单纯静中定更容易出生智慧，因为能促使智慧出生的缘多一些，在外境的缘上容易顿悟，况且大多数人为生活奔波，不能长期处于静坐中，修好活动当中的定就显得非常重要了。行住坐卧心都能处于定中，这样的定比较稳固，身口意行都能清净，受益比较多。在静坐观行功夫纯熟以后，要练习在身行活动中保持定力，观行更为专注。</p><p dir=\"ltr\">在静坐中观行很专注的时候，要试着慢慢的下坐，在地面上经行、走路、散步、或快或慢，这时候再反观自己的心念还能不能缘在呼吸上，不被周围的尘境所转。但如果没有静中定作为起修的基础，身口意活动中很难有禅定，如果在活动中心念也能不被尘境转走，说明定力增强了。活动当中的定力是非常重要的，起用的时候比较多，悟道的机会多。如果活动时心不散乱能保持观行的定力，说明观呼吸的功夫就相当成熟了，行走坐卧的功夫连成一片了。</p><p dir=\"ltr\">八、一念相续与一念不生两种止的区别</p><p dir=\"ltr\">止，就是停止、止息、止住的意思，也就是定、定住不动的意思。是谁止谁定？是身止身定，从而让六七识止和定，主要是让六七识止六七识定。身行止息下来的时候，身识和意识慢慢就会止息下来，但不是灭，因为这时候还有感知，只是感知的很轻微。六识不动了以后，第七识就没法再动了，因为六识不跟随第七识的攀缘，第七识没办法再继续缘法，也就不得不止下来了。但第七识因为其特殊的地位作用，祂必须缘法缘身，只是缘的法少，动得比较轻微而已。</p><p dir=\"ltr\">如果是意识缘于一念不动，心里还是有一念，这就属于定中观的范围了，如果意识有观，第七识意根必缘意识所观的法，时间长了意根也就观了，意根一旦专注的观，就走上正途了，早晚会见事实真相，这种状态叫作一念相续，就是观行的状态。</p><p dir=\"ltr\">而一念不生，是意识没有念，也没有观了，完全止息下来不动，但第七识意根不能完全止息不动，一定有念，就在于祂念什么和念的是否专一，如果能专一地念一个法，并且还有疑情，就是处于参究状态。这可以作为深层次的参禅方法，但是比较难修，一般人都把握不好，不如在意识有念的状态容易观行。但是越难修的方法，功夫越得力，越容易上道和证道，一旦证道，其智慧证量会很高。</p><p dir=\"ltr\">九、修四念处观呼吸是否会落到顽空里？</p><p dir=\"ltr\">四念处观行的结果是断我见，证得声闻解脱果，最后断除烦恼得解脱。每个人既然都有烦恼都有我见，就都是凡夫，那就需要断我见了，而断我见可以从四念处观的观呼吸开始。凡夫心中都是有我、有一切心、有一切烦恼的，所以才需要修行无我断烦恼。修行应该从基础一点点起修，从观呼吸开始起修，由浅入深，才能证得无我，才能心空烦恼尽。                            </p><p dir=\"ltr\">对于凡夫来说，不管什么样的空，只要能空一点点，就相当不错了，尽量去空吧，去舍吧，不怕顽空和断灭空，因为凡夫根本做不到顽空和断灭空，所以尽量空，越空越好。把从前的所有知解全部忘掉，把心掏空，变成婴儿，一点点的重新开始学起。从前学的知解都是葛藤，横空隔在心中，上不上下不下的，堵得难受，现在都空掉，让心里干干净净的，再重新填上清净法。从前所学消化不了的，有些会变成病，如果能空掉，病就好了，空不掉就继续病着，或者自己想办法下手治病，别人只能提供建议，治病的只能是自己。</p><p dir=\"ltr\">理论接触的越多，越难消化，都堵在心中，以至于药变成了病。如果消化吸收能力不好，就要把一些比较深的理论清理掉，多实练操作一些容易消化吸收的法义，消化不了的理论再好，也应该暂时放一边，从基础的法义开始起修，不要好高骛远。</p><p dir=\"ltr\">十、如何让妄念消失</p><p dir=\"ltr\">一切的念头、思想、观念，都来自于无明，而无明没有来处，没有去处，是虚幻之法。既然妄念、思想观念来自于没有出处的无明，那就不用当真，看破它看透它，不跟随妄想起落，如如不动，慢慢这些无明念头自己就消失了，心就清净安宁了，再来观所缘，朗然明了，无明转薄。人类的思想观念来来去去，想留也留不住，总是要变幻不停，固定不了，看破它，不理它，不随之动，心自清凉。</p><p dir=\"ltr\">观呼吸也是如此，客观的看着呼吸观察呼吸，不动情绪，不主动的加入观念，不与理论对号入座，只是愣愣呆呆的看着，站在局外观察着，会不会慢慢就能看破色身这点事？再慢慢看破五阴这点事？就是这点事，没大事，因为执，感觉事大而已。</p><p dir=\"ltr\">十一、观行的过程就是定慧齐修的过程</p><p dir=\"ltr\">什么是观？观就是对法的观察、伺察，然后作出一个正确的判断，得出一个如理的结论。这个完整的观行过程，要从意识开始起观，逐渐深入，心念专一，禅定出现，到此只是一个初步的观，还比较肤浅和粗糙。如果有结论出来，也只是意识的粗糙的结论，不够细致，内心还有疑没有解决，这是意根的疑，就是说这个结论意根还不明了不清晰不明白。</p><p dir=\"ltr\">再进一步观，心念越来越专一，禅定越来越深，意识所起的作用就越来越小，意根的思量作用越来越大，到最后意根智慧足以能作出判断的时候，就会得出一个如实如理的结论，这才是真正的断疑证法了，这是意识与意根配合共同观行的结果。</p><p dir=\"ltr\">观行四念处，首先修习观身不净，观身需要先从呼吸观起，具体如何观，佛经里都有讲，只要老老实实按照那个观行步骤一步一步扎扎实实地修行，就能如实观察到呼吸和身根的状况。比如现在正在吸气，知道吸气的时候气是从哪里入进来的，经过的路线，期间的感受，心里要清楚地知气体是通过鼻孔入进来的，然后经过鼻腔进入到肺里，再进入丹田里，吸气大概就是这样一个过程，心越静，细节越清楚，感觉越清晰。</p><p dir=\"ltr\">呼气的时候要观察气是从哪里出去的，从哪里运行到哪里了，气息是长是短，是冷是热，身体的觉受是什么，都要清楚的观察。心念清明的时候就会知道呼吸是深是浅，是长是短，气息运行到哪里了，哪个地方堵了不通，气息是如何呼出去的。这就是观，是以意识为主的初步阶段。</p><p dir=\"ltr\">在观的过程当中心念专一就有定，因为所有精力都集中在观呼吸上，不再去关注思虑其他的问题，心中没有杂念，心就定下来了。得定以后，也要保持一个观，内心保持对呼吸的知，对于目前所观的法，内心都要知。如果不能清楚的了知，就说明心散乱了，或者是昏沉了，知就代表了清明的智慧了知，有了这个知，慢慢就能生出色身无我的智慧。</p><p dir=\"ltr\">清晰了知呼吸的同时就有定，内心很清明就有慧，定慧等持，空的智慧就会逐渐生起。观到一定程度，就能认识到呼吸是生灭无常的，身体是生灭无常的，空的智慧就生出来了。这是意根的智慧，意识的智慧早就知道呼吸和身体是生灭无常的，在学法的时候就知道了，但那个知不起决定作用，观到最后意根的知才能起决定作用，是真智慧。只要内心保持着知，日久功深，生出了智慧，就能见到法的实相，这个知由无明的知，就变成了有明的知。</p><p dir=\"ltr\">十二、观身不净</p><p dir=\"ltr\">地球上所有的众生一辈子所产生出来的废物和废水，最后都到哪里去了？根据物质守恒定律或者是质量守恒定律，这些废物废水也有来处，是从哪里来的？如果后世再托生到地球上，所受用的一切物质都是从哪里来的？受用完成后就都变成废物废水垃圾了，这些垃圾又到哪里去了？</p><p dir=\"ltr\">有不少人都有洁癖，非常爱干净，可是平日里所饮用的水是从哪里来的？都是什么水？平日里所吃的食物是从哪里来的？都有什么成分？吃完剩下的厨余垃圾最后到哪里去了？每个国家都有污水处理厂，废物回收站，工厂处理过后的水和垃圾回收再利用，都干什么用了？比如说把一盆污水倒入地里，这些水是怎么从地里消失的？消失到哪里了？工业废水和生活污水只能被蒸发掉一部分，另一部分还留在地球上，被人类循环利用了，甚至喝到肚子里了。蒸发的那部分，下雨的时候，又回到地球上，就会再次被利用。总之，这些四大物质还是以各种形式被人类再次使用，进入色身当中。</p><p dir=\"ltr\">所以观身不净是很容易观察出来的，身内身外都不净，尽管不少人都有洁癖，可是没有一个人的身内外是干净的。众生都贪爱自身和其他类有情众生的色身，甚至还吃众生肉，真的没有什么道理，肉身太肮脏了。今世自己产生多少垃圾，后世如果再回到地球上就要再受用这些垃圾，甚至让子孙也一起受用。众生都热爱生命，很喜欢色身和六尘，可是这些都是非常污秽不可意的，有什么可贪爱的呢？或者是喜欢某种心，心也是染污的，充满了烦恼，有什么可执着的呢？</p><p dir=\"ltr\">十三、如何观行才能心空？</p><p dir=\"ltr\">观行四念处、观身念处、观呼吸，已经有一段时间了，自己对于自身中的呼吸现象有什么发现和体会？从局部的呼吸到全身的呼吸，从呼吸的细微处到整个过程的观察，都观察出什么了吗？是否非常明显的感知到了呼吸的生住异灭无常？对于整个身体状况，是否有生住异灭的感觉？对色身的认知是否觉得空一些了？</p><p dir=\"ltr\">要想有更真实的体会，在观察过程中，尽量不要带意识的思惟分析，要客观的感知，亲身体会，把学得的理论知识都忘掉，要纯粹的个人感知。观行时，要高着眼，整体把握，再把整体浓缩成一个点来观。不要与感受融合在一起，不要只注重受觉，要身心分离地感知，把心从身体里跳出来，从感受里跳出来，从呼吸里跳出来。把心与身能完全的分离开来才能发现客观真理和事实，俯视、俯瞰、鸟瞰，就像观看与自己无关的客体一样，这样就能客观的看待身体，看待呼吸，看待身体上出现的的一切现象，这样就能容易发现色身生住异灭的现象，心就容易空了。</p><p dir=\"ltr\">十四、如何培养修道的良好习惯</p><p dir=\"ltr\">花费一定的时间和精力，去培养一些修道的好习惯是非常值得的，就像为了批量生产，要花费时间精力和成本制造模具一样，这个时候是费心血和时间的，而一旦模具打造好了，以后再生产产品就节省极多的时间和成本，所谓事半功倍，至少是节省四倍到无数倍的时间和成本，这是非常值得的。在培养修道习惯的阶段是很辛苦的，成成败败，进进退退，不容易坚持下去，这时候就需要旁边有人督促，能结伴互相督促就好办一些。需要培养的好习惯都有哪些，这就要每个人根据自身情况而有意的加以选择，从而改变不合乎法理和修行的世俗习气，养成修道人的良好习惯。</p><p dir=\"ltr\">观呼吸是观行的最初入手处，是培养正确的觉观和正知正念比较好的一个方法，能培养出细致入微的觉察力和反观力，能有效的对治世俗不良习气。检查自己在日常生活中心念有什么变化，对待人事物理的态度是否有所转变，心念是否清净一些了，对色声香味触法的执取是否减轻了，遇到一些不如意的事情是否能随缘一些了，是否不太挑剔了，人际关系是否改善一些有亲和力了，心性是否善良一些了，心境是否平和一些了，动用不好心思的时候是否少一些了，人是否变得厚道一些了。</p><p dir=\"ltr\">如果检查之后发现自己确实有了上述种种改变，那就说明修行对路了，四念处观行是行之有效的。要不断从方方面面检查自己的心行，及时作以总结，知善知恶，保持和稳固良好的成果，改善不良习气，培养好的习惯，这样善根福德越积越厚，戒定慧越来越有所增进。</p><p dir=\"ltr\">十五、昏沉定与清明定的区别</p><p dir=\"ltr\">昏沉定是打坐时处于一种似睡非睡似醒非醒的状态，昏昏沉沉朦朦胧胧的，心不清明，没有所缘境，没有觉照力、觉观力、觉知力，好像一种休息养心状态，身体感觉比较舒服，但没有观行智慧。如果心中没有所缘境，就无念无想了，或者是昏沉了，没有思考力，也没有观行力。处于这种定中贪图觉受，禅定进步非常慢，心境可能好一些，但对于智慧的生起没有什么作用，不属于正定。昏沉定不是正定，没有足够的定力去生起观行智慧，也就没有智慧力，没有智慧力就不能破除心中的无明烦恼。</p><p dir=\"ltr\">而清明定是打坐时内心清醒清明，心有所缘境，对所缘境有觉照力、觉观力、觉察力，定慧等持，属于正定，可以有足够的定力，能对境界生起智慧观照，从而破除无明。清明定是正定，定中心有智慧的力量，能生出智慧火花，降伏烦恼，断除烦恼，冲破一念无明。</p><p dir=\"ltr\">在昏沉定中如果心能提起正念，就能转换成清明定，清明定如果时间长了，心如果疲乏了也会转换成昏沉定。要想保持心的清明，一是身体要调顺，气血通畅，精神饱满，心中能保持正念不失。身心相倚，身体气血运行得通畅，心就轻松愉悦，容易入定，而心力集中在丹田，丹田发暖，就会把气血发送到全身，气血通了，心就容易定住。</p><p dir=\"ltr\">思惟观行的时候进入昏沉定，观行就停顿了，如果按照四念处经修习，心中始终有一个所缘境，丢掉了再捡回来，昏沉了就能清醒，心中始终清明，禅定和智慧提升都很快。心有禅定时，观行法义是清晰明了的，没有禅定时就模模糊糊不甚明了。禅定能引生阿含解脱和般若唯识的观行智慧，就是这个原理，有的人歪曲说证果明心不需要禅定，即使是找东西时都需要禅定，没有定就想不起来东西放在哪里了，何况生死大事，怎么能用一颗乱糟糟的心去解决和处理？</p><p dir=\"ltr\">十六、什么叫作正念入息，正念出息，正念而住？</p><p dir=\"ltr\">对于目前所观修的法，能够专注、一心，没有杂念，就是正念。正念也就是当前应该保持的一个念，与当前所观境一致的念，也是现量的念。比如在观行入息的时候，全部注意力都在入息上，从开始气息从鼻孔入进来，到气息运行到丹田为止，整个过程都是专注一心一意的观，只是客观单纯的观，没有思惟分析推理想象等等意识的活动，只是单纯的知，其他的法都不在意，都不用心，也不观身体的觉受如何，心念不在觉受上，只在入息上。出息时也是这样，出入息时都是这样。修其它任何法都是这样，这才是正，才是正确如理的用功方法。专一其心，定慧等持，不偏不倚，才能入道。</p><p dir=\"ltr\">十七、正知而住的结果是什么？</p><p dir=\"ltr\">每天每时每刻都保持一个知，有定有慧，正知而住，这是四念处经里佛陀教导的观行方法。保持一个知，这是意识自证分，知所观法，不断的观察连续的知，就是把意识拘于所观察的一处，心不散乱，处于禅定状态。由于意识不散乱，定在一法上，意根牵引不动意识，就不得不也定于一法上，不能再散乱的去缘很多法，那么意根就会知意识所观察和所知的法，意根就会思量这个法，久而久之就能明了这个法的实质是什么，就会发现真相明了真理。这是由意识的知到意根的知的过程，也是证法的过程，意识的知是解，意根的知是证，所以证法一定是意根的证。</p><p dir=\"ltr\">意根知法和证法才有实质的作用力，比如说对于自己所犯的错误，意根不知道，只是意识知道，就会出现这样的情况：意识知错，就是屡犯不改，如果意根知错，就会痛改前非。再比如说在对待人时，也容易发现对人是真好还是假好，意识对人是假心假意，意根对人才是真心实意。</p><p dir=\"ltr\">如果我们真想改正自己的错误，降伏贪嗔痴烦恼，就要时时保持觉察，察省自己的身口意行，长期冷静客观的观察，站在局外观察，在高处俯视的观察，就会观察到自己的错误和贪嗔痴烦恼，就会觉得自己的心行非常不如法，就会知道不如法的结果很不好。当意根也觉察到自己的烦恼习气以后，就会思量，思量之后就会权衡，权衡之后就会知道利弊和因果，然后就会决定改掉贪嗔痴，不再如从前一般。</p><p dir=\"ltr\">如果不长期一贯的观察思惟，就不能把意根定在所观察的法上，意根还会到处攀缘散乱，不知法不证法，不知自己有烦恼，也不能降伏烦恼。这就是保持正知正念的结果，能够唤醒意根的觉悟，让意根证法。 </p><p dir=\"ltr\">有些人竟然不修定就天天喊着观，这样的观能观出什么？比如说一个人照看十个孩子，和专心照看一个孩子，其精细度，相差多少？一个人观察十个方向的敌人，和专心观察一个方向一个处所的敌人，其精细度相差多少？一个人同时考虑十个问题，和专心一意考虑一个问题，其精细度相差多少？如果没有禅定，意根处处攀缘于种种法，祂就没有心思去专一思考一个比较有价值的问题，对于这个有价值的问题就没有如理的观察和思量，就不能正确如理的加以认知，就不能合理如法的对待，就容易忽略一些问题，抉择上就会出错误，结果就会错误。所以心中常常保持一个知，慢慢就会生起智慧的认知，从而改变自己提升自己的智慧。</p><p dir=\"ltr\">十八、观行的过程和结果</p><p dir=\"ltr\">观行呼吸观到心静下来以后，就会发现呼吸系统就像一个自动化程序一样，与无情物差不多，好像身外之物一样，最后就会感知到身也如无情物一样非我非我有。这就是修道的进功，要的就是这个效果，以后还会有更多的新发现，由这种量变就会过渡到质变，质变的时候就会发现，五阴身都是虚假幻化的，无常无我的空的。慢慢心就会脱离肉身，脱离感觉，自身分为两部分，一个是被观的无情的色身组织系统，犹如呆板的机器一样；一个是能观的识心，动转的很慢，情绪情执越来越轻微，心境越来越稳定平静，受也越来越少，只有一个单纯的观和知，觉察力却越来越强大，心越来越细致入微，发现的真相越来越多。再以后就会发现能观所观越来越机械化，越来越空，越来越无我，无明越来越薄，最后才能破除无明，断除我见。</p><p dir=\"ltr\">十九、观行功夫与断烦恼的关系</p><p dir=\"ltr\">不管观行什么法，要想证得，就要把观行功夫连成一片。如何才能把功夫连成一片？就是要把打坐静止当中所修成的禅定功夫，延伸到身体活动当中，延伸到一天二六时中，心心念念不间断。留心观察自己在下座以后是否还能持续观行持续觉知，在行走坐卧中是否都能持续观行持续觉知，在即将睡着的时候能否还能持续观行持续觉知，乃至于睡着以后在梦中还能否持续观行和觉知，做一切事情的时候是否都能持续观行和觉知。如果观察到自己的观行功夫断断续续，心念经常不经意地流注到世俗法中，就要不断提醒自己把注意力转到观行上来，断了就要连接上，尽量让功夫连续起来。</p><p dir=\"ltr\">如果在行走坐卧中，全部心念都在自己的色身上观行，或者是大部分心念、主要心念都在自己的色身上观行，这样的定力就相当好了。如果能在一切时中，都能有觉知有正念，功夫就连成一片了，这样的定力就具足了未到地定，足够断我见了。当观行和觉知功夫连成一片的时候，心心念念都在自己的色身上，就不会再有心犯戒，不会再有心去造作恶业，这时候心就清净下来了，烦恼淡薄了，所以说禅定能有效的降伏烦恼和断除烦恼。</p><p dir=\"ltr\">在见道之前，必须具足未到地定，当具足未到地定的时候，欲界粗重的五品烦恼就断除了，这时候就可以成为初果向，离初果就不远了。如果未到地定还不具足，或者根本没有未到地定，那么就不要想断我见证初果。没有禅定能证果，那是戏论，不能成为现实的。</p><p dir=\"ltr\">二十、实修要随时检查成果</p><p dir=\"ltr\">观呼吸整个过程不能只在身体上用功，也要在心上多用功，毕竟修一切法都是为了修心。心是身体的主人，身体调理到一定程度，不影响心了，就要在心上用功，心调理好了，安静了，身体也会随之调顺。最后的功用都在心上，身体就不用再多加照管了。</p><p dir=\"ltr\">观呼吸是为了改变心念心行和心性的，下座以后在人事交往历缘对境中，检查自己在日常生活中的心行有什么变化，对待人事物理的态度是否有所转变，心念是否清净一些了，对色声香味触法的执取是否减轻了，是否随缘一些了，是否不太挑剔了，人际关系是否改善一些了，心性是否改善一些了，心境是否平和一些了，动用心思的人事是否少一些了，人是否变得厚道一些了，是否让别人感到亲和一些了。身心都是什么反应，什么心境，烦恼如何，心态有什么变化，这些都是观行之后的结果，最能说明问题。</p><p dir=\"ltr\">心量大没大，容人度增加没有，考虑问题长远宏观一些没有，对众生的怜悯度增加没有，责任感增强没有，大菩提心增加没有，道心坚固没有？心系佛教和众生没有？这些都是检查修行的内容，如果差得还很远，那就离见道还很远，需要再继续努力，精进用功用心。总之，要从方方面面检查自己的心行，及时作以总结，知善知恶，保持和稳固良好的成果，改善不良习气，这样善根福德越积越厚，戒定慧越来越有所增进。</p><p dir=\"ltr\">二十一、修行四念处的功德受用</p><p dir=\"ltr\">按照大念住经修行，定力不断增强，会感觉越修越受益，坚持在行住坐卧中观呼吸、观色身，心越来越静，越来越细致，到最后色身从头到脚、从里到外所有的变化现象都能观察到，心非常灵敏有智慧，这都是因为有禅定的缘故。如果不修禅定，心就很粗糙，色身内外什么状况也观察不到，发现不了，尤其是自己内心的贪嗔痴烦恼、种种无明，一是发现不了，二是降伏不住。所以必须要修禅定，修四念处，以增长观行智慧，降伏烦恼，不造或者少造恶业。</p><p dir=\"ltr\">在四念处的修行过程中，心越来越静了，静到一定程度，因缘时节具足，接触到一个法一个因缘，随即就能反观和参究，意根那种无语言文字和声音的思量性就起用了，于是立即获得灵感，有可能就证得了法。禅定修得好，心就非常伶俐，专注力强，能时刻缘在所观之法上，了知自己的身心内外，外面不管什么境界出现了，心里虽然很清楚，却能做到不理睬不动心，没有自我存在感，不把自己当回事，内心烦恼出现时心里也清楚了知，却能不随烦恼去造作业行，这就是禅定的功德，心清静，能降伏烦恼。</p><p dir=\"ltr\">烦恼轻微一些了，对世间的贪执就会减少减轻了，不愿意花费更多时间精力再去搞世俗事业，很多事情都觉得不重要了，一心向道，愿力就广大，修行也就走上了正轨，见道只是时间的问题了。</p><p dir=\"ltr\">二十二、修行四念处是从无明知到明知的过程</p><p dir=\"ltr\">这部四念处经不仅仅是修定的经，也是止观同时运行的经。止观的结果，有智慧的生发，这个慧就是断我见的智慧，法眼得清净、心得解脱的慧。所谓解脱的慧，就是通过观察，对所观察的法，如实正观到一定程度，就会由无明的知变成了有明的知，原来的知是对于法不明了的无明知，现在的知是明了法的真谛的明知，明了所观的这一切法、五阴身心都是生灭的、无常的、变异的、苦的、空的、无我的，这时候小乘的解脱智慧就生出来了，断除贪嗔烦恼之后就能心得解脱。</p><p dir=\"ltr\">所以观行四念处，心里时时刻刻要有一个正知，而且是在心止的时候的知，不是心散乱的知。这两个知是有区别的，心止的知，有意根的知，心散乱的时候是意识散乱的知。散乱的知都是无明知，心止的知，无明能逐渐减少，能从无明知逐渐转变成明知，能开智慧得解脱。</p><p dir=\"ltr\">心散乱时候的知，显现出的都是意识的功能作用，心止时候的知，不仅有意识清清楚楚的知，还有意根明明了了的知，有意根的深深思量作用，这样才能断我见，得法眼清净。这是佛教给我们的修行方法，不是用意识心思惟、分析、考量、比量、推理，这些方法通通都不用。所有的法都是现量存在的，本来就是如此的，只要保持了知，到一定时候，就能明了世间真谛。</p><p dir=\"ltr\">对所观法的无明知，是落到了现象界，认现象界为真为实，明知是知现象界的生灭和不真不实。中间的观行过程很重要，由无明到明的转折很重要。观察到现象界后面那个理，是明知，意根明知的时候，一定有定慧等持的三昧出现。这个过程可能要长一些，因为前世的基础弱一些，今世就多辛苦了。在观呼吸的修习过程中，要参考一下楞严经中周利槃陀迦的观呼吸方法，周利槃陀迦观呼吸没有离开过鼻端，非常专一，最后证得了四果，并且还修出了四禅定。</p><p dir=\"ltr\">二十三、有明的知和无明的知的区别</p><p dir=\"ltr\">无明就是内心的晦眛无知，不知道五受阴的苦空无常无我，不知道五阴世间的生灭变异，不知道诸法的本质相貌，不知道诸法都是如来藏所幻化出来的，不知道因缘果报之理，总之，无明就是不知不懂真实理法，执取一切妄法为我和我所。带着这些无明的知，就是无明颠倒的邪知。</p><p dir=\"ltr\">如果通过观行实证到了五受阴苦空无常无我，实证到了诸法的真实理，断除了无明，不再迷惑颠倒执取一切法，这样对五阴的知、对诸法的知，就是明的了，叫作明知。当然明也是有阶级差别的，是有层次和程度的，有最初的明和最后的明，明要渐次的明，越来越明，就会越来越有智慧，越来越解脱。</p><p dir=\"ltr\">明也分为意识的明，和意根的明，意识的明比较容易，把佛法理解通透了，意识就明了；但意根的明必须在实证之后才能出现，意根的明不是靠理解和简单思惟就能出现的，必须在禅定中不断的参究，不断的思量，才能顿悟，顿时而明。意识的明是渐明，渐修就会渐明，渐明是解的结果，不是真实智慧。</p><p dir=\"ltr\">意识对理的通透也是相当不容易的，所以意识证果同样很困难，不是像许多人认为的那样，思惟思惟，解一解，就意识证果了，那离意识证果还远着呢，离意根证果更加的遥远。证果哪有那么容易的？无明是那样的深重，遮障是那样的大，烦恼是那样的重，智慧是那样的浅薄，能当个好凡夫就不错了，如果不改变自己，消除一部分烦恼和无明，不脱胎换骨，就不要谈什么证果，离证果实在太遥远了。</p><p dir=\"ltr\">二十四、四念处的身受心法和五蕴之间的对应关系</p><p dir=\"ltr\">二者正是对应关系，四念处的身，就是五蕴中的色蕴，四念处的受就是五蕴的受蕴，四念处的心就是五蕴的识蕴、行蕴和想蕴，四念处的法就是五蕴十八界的修行之法三十七道品。所以观行四念处，五蕴就能得解脱。</p><p dir=\"ltr\">佛法都是相通的，殊途同归，都是一个道理，只是阐述的角度不同罢了。虽然阐述的角度不同，但是其结果却是相同的，那就是断我见得解脱。每个人修行时所选取的点位有差别，但结果没有差别。从任何一点而入，都能通向目的地，只要方法用对路，定能到达终极目标高山顶。站在高山顶上看山下四周，条条路途通山顶，不必围绕整座山走一圈，沿着一条路上到山顶，所有的路都一目了然。所以成道的人，能问什么答什么，哪条路上的众生，都能为其指引方向，大乘法、小乘法、世间法外道法、戒定慧，一切修法都可以引路。这时才是当之无愧的善知识，德才兼备。</p><p dir=\"ltr\">二十五、为什么观行能断我见？</p><p dir=\"ltr\">举例子来说观行这个问题，譬如小孩子都喜欢玩具，有的小孩子得到一件玩具之后，爱不释手，喜欢好几年也不厌倦，这样的智商就堪忧了。而有的小孩子对到手的玩具充满了好奇，拆了装，装了拆，最后明白了这个玩具不过如此，就不再感兴趣了，然后就换另外一种玩具，最后对其它所有玩具都是这个样子，拆拆分分，从里到外看个明白，看明白以后就不再好奇感兴趣了，随着年龄和见识的增长，最后对任何玩具都不再感兴趣了，这表明这个孩子心智已经成熟了。</p><p dir=\"ltr\">众生就如小孩子一样，也喜欢五阴这个名色玩具，多生多劫甚至无数个无量劫都爱不释手，贪爱不止，被五阴身束缚得死死的，不得自在，受尽了苦痛。如何解脱束缚呢？应该像心智成熟的孩子那样，把五阴世间拆分开破解开，看透五阴的实质，知道五阴其实是苦的、空的、无常无我的，其余就没什么了。如果众生有大乘的心智，看透了五阴实质就是空的如来藏，根本没有五阴这样的法，五阴是由如来藏所出生的因缘所生法，因缘灭五阴身就灭，不得自在，这个心智就是最成熟的了。</p><p dir=\"ltr\">因为大多数众生都执迷于五阴，沉浸在五阴当中不能自拔，就像执迷玩具的小孩子一样心智不成熟，不懂得如何拆分五阴，佛就设立一个方便方法，教导众生如理如实地观察，从四念处的呼吸开始起观，目的是先从呼吸入手，来合理地细致地拆分五阴，如理作意地去深入观行，实地现观，这是最简单有效的观行方法。</p><p dir=\"ltr\">有的人观呼吸，观来观去，五阴就被观破了一点，从这一点上就窥破了色阴，看明白了原来色阴是苦空无常无我的，除此什么也没有，于是就断了身见。有的人在断身见的同时，一使劲，连带着把其它四阴也一齐都拆分开了，看透了五阴全体都是苦空无我的，于是断我见，心智再好一些的，把五阴从里到外观个清清楚楚、透透彻彻，烦恼顿断，直接证四果阿罗汉。</p><p dir=\"ltr\">所以这个观行是非常好的拆分五阴得小乘解脱的方法，让众生这些孩子心智都能早些成熟，从而厌离五阴，解脱生死苦。关键是要会观，观的要如理如实，这也在于众生的心智和定力。众生定慧有差别，这是肯定的，不过不用急，只要长久观行，日久功深，早晚都会把五阴观透彻，不再被它所迷惑和缠缚，解脱是早晚的事。</p></div>"
},{
    "title": "第二章 观行日志",
    "author": "生如法师",
    "date": "2022年01月11日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  观行日志</strong></p><p>一、观行中的方便法</p><p>蓝天的观行日记：上坐做十次深呼吸，感觉气道长而通畅，丹田发热。之后默念心经，心经经文从开头默念到究竟涅槃，意念逐步集中在经文上，妄念减少，腹部呼吸加深，随后观呼吸，把意念由默念经文改为观呼吸，把所缘放在呼吸上。在吸气时知我在长吸气，在呼气时知我在长呼气，此时定力比以前强，已经能守住呼吸。随着呼吸，慢慢感觉两耳有些向外涨鼓，后来自然消失，呼吸变得自然轻松，而且变得悠长，腹部温暖柔软宽敞，心里安适，下坐后身心愉悦。</p><p>21年7月6日</p><p>评：观行佛法是在禅定稳定，观行定力具足的时候才能观，并不一定能一味的观。如果禅定还不稳定，就要先修身心，集聚定力。中间可以用种种适合自己目前状态的方法来操作，以稳定身心，增强定力。定力具足以后，再观行，就是正观，否则就是乱观，浪费时间，没有成效。</p><p>二、什么是实修实证？   </p><p>如本的观行日志：今天早晨上坐，调了会儿呼吸，感觉不是很通畅，不专注。然后缓慢地默念心经，就进入一种止观状态，心比较安定了。然后试着观出入息，腿麻胀时心里的浮躁感就要生起来了，或者杂念快要生出来了，于是就停止观出入息，又缓慢地默念心经，又进入一种止观状态，心比较安定。</p><p>下坐如厕时，感觉这个身体就是一个“流动”的东西，哪有一个不变的身体相呀。吃饭时，眼睛看着坐在对面的家人，感觉只是眼、耳、鼻、舌与五脏六腑组合在一具骨骼上的假人而已。可是她不知道自己是这样的假人。我无法告诉她自己这种感受，怕她不高兴。吃饭时，看着碗里的四大物质组成的米饭与蔬菜，感觉它们进入自己的身体后再成为身体一部分，物质的身体与物质的米饭没啥区别，都是四大物质而已，就像阳台上的花儿吸收了土壤与水就能长成各种植物一样。    </p><p>为什么却不认为花儿是我自己呢？却执取一个四大物质的色身为我呢？为什么每个人的身体又长的不一样？与我的心识有什么关系？想到这里就止住，不再往下思维，不想把以前的所学套进去分析思维，应该把这个问题交给意根去思量，不断的观察、寻伺、咀嚼才有“意～～思”，带着疑惑才有深入探求的欲望。</p><p>今天出门活动看到街上对面走来的人，感觉身形、动作、说话也是一具活动的假人，可是他们都不知道自己是一具假人。门口与认识的熟人打招呼，盯着对方的脑门，就想脑门下面是一具白骨、里面都装着一样的东西。感觉真没啥意思。看别人说话，感觉对方发出的语言声音只不过是气流与物质的嘴唇、舌头、喉咙、气管的一种气流碰撞，与人击鼓鸣钟没有太大区别。平时所说的或所争辩的对错、是非、美丑都没啥意思，不想说话，安住呼吸。</p><p>评：以上是四念处修行的一个过程，在这个过程中观行越来越深入，越来越广泛，逐渐扩展到生活中方方面面各个角落，从早到晚到睡眠，达到无间，其心与世俗相逐渐脱离，越来越空，逐渐的在换凡夫骨，脱凡夫胎壳，这样不断的用功下去，早晚有一天跳过龙门，鲤鱼变成龙。</p><p>当把观行扩展到日常起居方方面面，达到无间时，就是初步的三昧境界了，这个三昧里有禅定，也有智慧，只不过还不完善和究竟，完善和究竟的三昧就是悟道时的三昧，法眼净的三昧，断三缚结的三昧，不入三恶道的三昧。这样的观行仅仅是个过程，是身心蜕变的过程，在这个过程中，五根、无力、四正勤、四如意足、七觉分、八正道、四念处修行渐渐具足圆满，只有证道的条件具足时就会断我见，进入证道位得法眼净。</p><p>这才叫作实修，实际到生活中的每个角落方方面面，实际到内心的每个心念，每个行持，每个操守，实际到每个步骤，实际到佛陀所讲的所有修行过程和必要条件中，一丝不苟不急躁，实际到烦恼不起，心念止息。当然止息的是意识的心念，意根对法的思量从来不断，心心无间。所以最后见道一定是意根见道证道，证果之后其心念也是无间断的，其转变的心行心所法也是无间断的连贯的，五品粗重烦恼也是无间断的灭除了，不可能是一会儿是圣人一会儿是凡夫的来回转换，不用意识去牵制意根回到空无我的认知中。</p><p>而意识证果与此相反，意识清明时是个好人，境界一来时意根随烦恼现起染污意，六识不觉随起造作染污业，过后意识觉得不妥，又督导意根压制烦恼，但再压制烦恼已经起来了，过错已经犯了，恶业已经形成了，种子已经留下了，未来怎么办？动不动就有贪欲的念头出现，动不动就有嗔恨的念头出现，时不时就起个烦恼犯个戒，造个恶业，这是什么圣人？虽然过后又知错了，又纠正了，如此不断的循环往复，这是见的什么道，这么不保靠？这么累心？当意识感觉疲累的时候，就不会再没完没了的督导意根了，那时刹车就失灵了，那是什么后果？      </p><p>每个学佛修行人既然已经遇到了解脱之法，都应该老老实实踏踏实实脚踏实地的修行，不要有投机取巧的心理，欺骗自己再去欺骗他人，纸终究包不住火，纸房子终究抵不住风吹雨打，早晚要毁坏的，不如趁早找个永久的安乐止息处，这才是智者。</p><p>三、如何驾驭五蕴这辆车</p><p>如涛的观行日记：我在四念处训练的初始阶段，坐中妄念非常严重，导致观行吃力。目前此关口过去了，上坐无需费力去处理粗重妄念，即可安住于呼吸，甚至能入浅定，产生轻微的身心分离感。</p><p>但我发现自己意根和意识的定慧力还是相当的微薄。打个比方，就像到了春天，山间的河溪刚过枯水期，潺潺水流，不过只能浮起一个小的竹筏，但并不足以托载木舟，更不用说像大江大河那样，水深浪涌，能载得动巨舰大舟，远远没有那个力量。现在似乎更能体会到佛法中常提到的“亁慧”二字的含义，如我一般初学佛的凡夫，意识稍懂一些般若的道理，但定力尚十分浅薄时，所谓的“慧”，不过是浅层意识的情思意解而已，哪有丝毫的功德受用，就像师父说的，这样的所谓“悟”，只是误会的“误”。我应为曾经的自以为是、夸夸其谈做真诚的忏悔。</p><p>在目前的训练中，粗的妄念降伏了，只意味着意根牛不再像过去那么野了，脾性变得更温顺一些，不过祂还是很活泼好动。上坐时专心致志的观呼吸，就是用呼吸这根绳索把祂再栓牢点，让祂更少于攀援。</p><p>意根这头牛之所以好动，究其原因是因为无始劫以来的无明，把六尘境界都当真了，并当成自己的食物，吃得津津有味。所以意识牧童在有空时，就要不断的提示意根牛，六尘境界是假的，六根是幻化、六尘是幻化，根尘相触时，了别尘境的六识也只是一连串的识种子罢了。色法是空，心法也是空，意识所了别的山河大地、自我身心，不过是内六尘在大脑中的复杂电信号，重重的妄念，不过是意识自己玩出的虚妄独影法尘，无一法有真实可言……把这个讯息深深的埋藏与内心深处，让意根牛好好咀嚼反刍，期待祂终有一天也能豁然开朗！</p><p>评：一切粗重的妄念和细微的妄念，不过都是意根无始劫以来认境为真，不断坚执而形成的习气惯性势力，就像开得很猛的一辆车，不容易刹闸，意识驾驭非常吃力，况且很多人并不想驾驭，还一味的放纵，加大马力的行驶，后果是什么，大家应该能想到。如何驾驭这辆车，使之能慢慢减速，安全平稳的运行，是我们应该深思的一个重要课题。</p><p>正好现在有四念处的观行目标，能让意根把精力逐渐转移过来，逐渐安住于其中，车速慢慢减低，不再颠簸。把注意力从烦恼琐事中抽离出来，面对呼吸这一件事，心静了，烦恼沉淀了，表面的清水就会映照出五蕴的真容，就可能会发现，原来五蕴并不那么真实可靠，从前都是错认错执了。从此以后，无明烦恼就会逐渐从心中剥离出去，轻松安稳，减少和灭除了苦痛。</p><p>四念处就是佛陀开出的治疗身心疾病的良药处方，只要放心服下去，身病心病都会消除，获得智慧解脱。不要怀疑，佛陀是大医王，能解救众生于水火，跟随佛陀的指引，定能达到对岸的绿洲歇息安身。</p><p>意识在整个修习过程中，如向导一般指引意根方向，意根一旦明了方向，走上正途，就要靠自己的心力和智慧去面对一切境界，去思索，去探寻，去发现真相，扭转从前错误的认知，这样才能获得新生。意识这个副驾驶在旁边稍微看管扶助就行了，一切还要靠意根自己，五蕴之车毕竟由祂亲自来驾驶，意识代替不了其位。</p><p> 四、思想念头到底是个什么东西</p><p>如本的观行日志：这些日子上坐时，在调伏身心的过程中，用过观想念佛、黙诵心经、默念佛号、念楞严咒、观身体三十二物、观法尘的生灭变异等方法来使心念专注，不再浮躁不安。就像降伏一匹野马，需要用各种方法观察出它喜欢什么、想要什么、为什么喜欢，找出原因，然后把这个原因解决掉，才能没有这方面的欲望与想法。</p><p>个人感觉上坐后一法一法的观行身体的三十二物的变异生灭非常有效，只要开始作意：“发、毛、爪、齿、皮”的“发”…，心念就开始安静，三十二物大略观行一遍后，再反观这个能觉知、能观察、能分别的心是个什么样子、在哪里、所依所缘、作用范围、与心识的差别。</p><p>在观行的时候，只要保持一个疑念：“我是谁？”，然后在色身与心识中一法一法地反复体验、择别每一法的状态特性、作用范围、条件、区别等等，然后不知在什么时候忽然就与所学的法义相吻合了。就会明白所学知识的理解与观行体验后的感受是不一样的，虽然结论一样。</p><p>有时忽然妄念来时，不去压服它，我的办法是去观这些法尘浮现的原因，观法尘的本质、出处、所依所缘，后来发现我对它们都加上了一个标签：你我他，然后对它们衡量对错、是非、好坏，跟着就有了喜怒、躁动、郁闷不满、焦虑希求这些不能放舍的情绪出来，像灰尘一样把本来清净的心遮蔽着、压抑着、系缚着、捆绑着，真是作茧自缚。原来这些只不过是过去的记忆留下的法尘而已，它不是心、不离心而有，本没有自体性，是自己心田里的记忆名相而已。</p><p>解决了法尘，然后连带色尘、声尘、触尘这五尘的本质、出处、所依所缘都认识了。这才是妄念生起的原因。开始的时候要经常反复的对法尘去认识、择别，然后才能把心里的执取放舍，放舍后才会释然、收摄。压制的办法不能解决根本，就好像只知其然，而不知其所以然，妄念就不好降伏。</p><p>其次观行前必须闻思成熟，否则生不起来智慧，不知道怎么去观去择别，有止而没有观慧。比如每个医生都对身体的出生、变异、老死都有一定的现量观察，但身体是我的观念不变，没有智慧，也不知道去探求生命的本质。所以个人觉得观行前闻思成熟是基础。</p><p>然后再观色身与心识的互相影响，然后深信起心动念皆有果报，都是自做自受，内心就越来越安宁。最后再安住于鼻孔的呼吸上，有时呼吸微弱时只感觉整个色身都在呼吸，身内身外没有界限。当定力好时就感觉身心处于无我无主的状态下，逐渐不再有身体的概念，目前单盘基本上能坚持一小时不换腿，下坐后感觉精神充沛。不过当腿麻胀疼痛时心力就弱了，需换腿才能继续。</p><p>下坐后出去活动，练太极拳，感觉与打坐观行一样，很安静很缓慢很轻松的就进入观行状态，身心处在无我无主的状态下，呼吸均匀，没有谁在，只有胳膊只有腿缓慢的在空中移动，只有鸟鸣在空寂中起落，只有无形无相无处的心在觉知，没有谁在。在生活中，尽量把三十二物的色身心念提着，不去看色身的整体，这样观察色身的无常无主。目前还不能形成无间作意。21年6月2号   </p><p>评：一切的念头、思想、观念，都来自于无明，而无明没有出处，没有去处，是虚幻之法。既然妄念、思想观念来自于没有出处的无明，那就不用当真，看破它看透它，不跟随妄想起落，如如不动，慢慢这些无明念头自己就消失了，心就清净了安宁了，再来观所缘，朗然明了，无明转薄。人类的思想观念，来来去去，想留也留不住，总是要变幻不停的，固定不了的，看破它，不理它，不随之动，心自清凉。</p><p>五、性障轻微容易发起禅定</p><p>蓝天的观行日志：晚上上坐，做了十次深呼吸，之后观鼻息，慢慢进入腹呼吸。这段时间在腹式呼吸的初始阶段，吸气时腹部肌肉收缩程度不那么强烈了，而今天在呼气时腹部收缩得却很强烈，呼吸时丹田很热。始终观鼻息，没有把念头移到别处。</p><p>打坐半小时左右，感觉气机要向上发动，听了师父的教诲，顺其自然并没有阻止，感觉气机瞬间达到胸口处，没再往上来，整个胸口以下部位像过电一样，瞬间就消失了。继续观鼻息，此时还是腹式呼吸，又过了十来分钟，又一次气机往上涌，两耳同时翁鸣一下，整个头部及脸部毛孔站立，麻酥酥的，很快感觉消退，前后心及腹部出些微汗，深呼吸停止，看看表还有十多分钟，就主动深呼吸直到打坐结束。</p><p>上坐，做十次深呼吸，之后观鼻息，一会儿就进入腹式呼吸，今早丹田部也很热，尤其是吸气时，感觉气流就像一股热流一样由上腹进入丹田。有时吸一口气，能感觉大腿上面是凉凉的，好像凉气从大腿上进去一样。在打坐半小时左右，又感觉气机向上涌，这次比较迟缓，没那么强烈，涌到胸部和头部就不下去了，胸部气胀致使呼吸变短，头部也有些发胀但不是很明显，经历了十分钟，把念头放在丹田处，上述的不适才慢慢消除，呼吸变得通畅，双肩也沉下去，腹部柔软舒适。</p><p>评：心越空，气机发动的越快越长，入定越深。有性障遮障的，不容易发动气机，发起来也很快掉下去。将来生起初禅定也是有类似的气机发动，心越空性障越轻，气机发动的越快越深入，越能遍及全身，越能持续长久，禅定越深。所谓的性障，就是心有执念，执身执我，念着的法多，攀缘不断，世间法都执以为实，不肯放舍。</p><p>六、什么叫格物致知</p><p>八十二口的观行日志：我按师父说的方法修习静中定，从观呼吸开始，让心静下来后，放了个“色身非我”的念在心里看着，同时进入愣神离语言的状态，渐渐感觉身体好像在远离觉知心，有点安立不住。下座后感觉身体轻快安逸，犹如大梦初醒，不像以前感觉那么疲惫了，就是头部有些发紧发麻，而且一直持续了十多分钟。感谢师父教导，学佛就是要先下决心改变自己的意根习气，有了目标后，心里轻松了不少。</p><p>评：有一句话叫作格物致知，意思是说心只要与境界分离，不粘着境界，不着于境界，就不会受境界熏染和局限，就会跳出境界外回头客观的看待境界，就会得出客观的结论和看法。而心与境界贴合在一起的时候，往往被境界遮蔽了心智，只见境界相，不见真理和事实。</p><p>禅定中的观行就是要格物致知，把心从法上抽离开来，从而无语言文字的重新客观的审视法观察法，没有主观性，慢慢就会有不同于从前的客观发现，认识到了客观真理，从而能出生解脱境界的智慧。主观能动性是意识的，客观的感知审视是意根的。格物就是让意识不动，意根去亲自感知，这样才能有公正客观如理的发现，原来事情都不是那样的，原来都错了。</p><p>不修禅定和观行，永远不会格物致知，永远不会改变意根的我见我执，永远处于愚昧无知之中，解脱就没有出期。禅定和观行这个关口，再难也要过，并且一定要下决心突破，这样才对得起自己学佛一生和多生。要想实证和解脱，没有其他的路途，只此一条，绕不过去，早晚都得走，早走总比晚走好得多，少受很多苦。</p><p>七、禅定的功德</p><p>如曌的观行日志：今日左腿单盘半小时，右腿单盘半小时，上坐后先诵了一遍楞严咒。后凝心静气观呼吸，不久后全身持续发热，四肢和面部有汗液，口中不断有津液分泌出来，没感觉到丹田发热，但每一口气都吸的很深，小腹会自然鼓起，随着观察的深入似乎吸的更深。左腿单盘和右腿单盘身体的感觉和鼻孔的吸气量似乎是不同的，身体感受也不完全一样，个人目前左腿单盘心更容易定下来，观察时间更长。</p><p>生活中很呆滞很慢，大部分事都不入心，很多琐事都记不住。有时候该动脑的时候好像突然卡住了，不知道心里在想什么。跟人说话时能知道对方想表达和发泄什么，但说不出附和的话甚至不想开口。自他有苦受时会思维苦受的由来，想彻底的断集灭苦。</p><p>评：心念越集中，身体里的气越集中，能量越集中，就会导致气机发动，浑身发热。禅定非常深的人，身体对冷热不敏感，冬天不用穿很多，夏天穿多也不觉得热，冬夏一衲，不用总换衣服穿。禅定能消除一些浮躁气，不重要的事就不会用心了，更不会趋炎附势，最初语音和动作显得笨拙，行动力弱但观察力深透，心细敏感，看人看事会比从前精准仔细，不容易被骗，有点大智若愚，实则心不用在小事上，真智慧在慢慢提升。</p><p>八、观行只有坚持不懈才能水到渠成</p><p>蓝天的观行日记：晚上上坐，做了十分钟主动深呼吸，在结束深呼吸前慢慢有了气感，之后观鼻息吸，在第四次吸气时，感觉丹田气机发动，腹部肌肉开始出现不规则跳动，慢慢吸气和呼气，腹部肌肉跳动加大，在一次吸气后停顿，静止等候，腹部肌肉开始规则收缩，致使腹部继续扩展，同时带动胸胁部向外扩伸，气流持续从鼻腔吸入，直到腹部肌肉发胀为止，呼气时自然呼出。这样就进入了深呼吸，念头继续关注鼻根处呼吸。大概过了十分钟左右，在一次吸气结束前，下腹部肌肉开始收缩，感觉气流又往下冲，好像到达最底部。胸腹部好像一个气箱，气流进入又出来。这样一直持续到打坐结束。</p><p>在今天深呼吸过程中，腹部较比以前热得多，吸气的时候充满气体，呼气的时候感觉腹腔肌肉合在一起，腹部非常舒畅。期间很少有妄念，如果不是主动想些事情，不会有其他妄念在头脑中闪现。打坐结束后，继续坐在床上，慢慢呼吸着，这时群里有同修发起聊天，谈论一下打坐的感觉，说了一会就不能说了，因为说话的同时，由于惯性丹田还在强烈的呼气和吸气，致使说话不能接续，于是就休息了。</p><p>评：每天坚持观呼吸，禅定会越来越好，心越来越细致专注，观察的会越来越细致，而观察越细致心就越专注，禅定越好，这是良性循环。但是功夫作纯熟以后，观察的现象就没有什么新的变化，感觉修行好像没有什么进功，停滞不前了。这时候就会出现分化的现象，有的人就会觉得无聊没有意义，渐渐就会厌烦退堕的心理。其实只要坚持，功夫都在不断的提升，初期比较明显，后期只是不明显而已。就像在水浅之处，所作一切都会显露出来，等行至水深之处，所作一切就不明显了。</p><p>明了这个理，就要克服这种无聊的心理，不能半途而废，功夫越好越不明显，不要在意表面的停滞，这只是考验一个人耐心的时刻，只有有耐心并且坚毅不拔的人才能登上顶峰。</p><p>九、要想快速入定可以做前行引导</p><p>蓝天的观行日记：观呼吸第三十一天，上座之前，自己自我暗示：今天打坐过程不再思考、减少思考，也把一切与打坐无关的事情放下，心念只关注呼吸。上坐之后，采用主动腹部深呼吸。今天把意念加在下腹部，慢慢腹部有些发热，五分钟左右，慢慢有了些气感，深呼吸变得轻松，下腹部肌肉有跳动，感觉要发动气机，大概十分钟左右，停止腹部主动深呼吸。</p><p>随后开始观鼻息，今天没有像前几天那样转到自然呼吸，而是用意识慢慢引导腹式呼吸，很快经过几次呼吸，下腹部气机发动直接进入深度腹式呼吸，这时念头仅仅放在呼吸上，同时感知全身的觉受，尽量减少分析思维活动。由于念头集中，呼吸自然而深细，呼吸幅度也比主动深呼吸大，气流通过胸、上腹、中腹直达腹底，直到打坐结束。</p><p>观呼吸过程中意念集中，所缘清晰，呼吸均匀深细。在打坐中间段，突然感觉一下右胯部外侧，有非常明显的凉爽感觉；在打坐结束前，右耳持续有清凉感（右耳前段时间因上火发热发胀两个月）。</p><p>评：修定可以做加行，主动调整身心状态，引导到一个比较适合入定的状态，然后心就会沉静下来入定了。在主动引导中，心的作意集中于一件事情上，只对这件事情感兴趣，屏蔽了其他所缘，这本身就是智慧，也是定。在修定过程中，要充分发挥智慧，以慧引定，定慧结合，入定会非常快。有一部分人修定时强行定，不利用智慧，结果入定很困难。而有另一部分人，只用意识的慧分析思惟，却永远不入定中。这二者修习都偏颇，不走中道，无法出生三昧。</p><p>十、法义熏染意根时候的表现</p><p>蓝天的观行日志：昨晚打坐观呼吸，呼吸比较顺畅，胸腹温暖舒适，随着观呼吸的持续，感知呼吸热流不断地在身体延展，从腹部逐渐向背后延伸，最后热流涌入后脑部，呼吸越来越顺畅，气脉畅通，眼前清明，妄念很少，意念集中在全身的觉受上，于是准备观行法义，脑海里主动闪现“色无常，色无我”，这时突然全身肌肉绷紧，呼吸急剧加深，身体随肌肉收缩而出现扭动，这种状态大概持续两分钟作用，之后慢慢恢复平静。</p><p>此后继续观呼吸，感知全身觉受，经过刚才全身肌肉紧张收缩之后，全身经脉进一步打开，尤其是头部更加畅通，就这样观行了一段时间，头部清醒，眼前安宁，于是又主动在脑海中闪现“色无常，色无我”，这次全身还是有反应，但已经不是很强烈，慢慢在眼前思维色无我具体法义，思维过程中意念集中，无妄念，无任何烦躁情绪和无端打扰，安宁深沉，不久闹铃响了，下坐。今早上坐全程观呼吸，没有观行思维法义，全身气脉通畅，一直享受在全身愉悦过程中。</p><p>21年11月19日</p><p>评：当色无常这个念头出现的时候，浑身肌肉紧绷身体扭动，这是意根对色无常有了触动。以前无常法没有触动到意根的时候，就不会有这样的震动现象。好多意识所明了的法义，没有熏染到意根的时候，身心都不会有所触动，只有意根正视了法义的时候，才出现震动。继续观行参究以后，意根才能证得，三昧或者法眼净才会随之出现。震惊、惊讶、惊慌失措、慌乱无主等等这样深层次的心理活动，都是意根受到触动表现出来的。</p><p>观呼吸的时候，要一心一意的体会呼吸的无常，体会时不用思惟，只是客观的观察，不用特意引出色无常这个话头。观行四念处断我见，是自然而然的从呼吸这个切口体会到色无常身无常，再从受念处心念处和法念处，客观的体会出心无常法无常，从而断我见。功夫到了，自然观察自然体会，不是刻意闪现出与目前观行不同的法义问题。这是自然证果，是意根证果。</p><p>观行也叫作现量观察，目前有什么法就观察什么法，法是什么状态就如实的观这些状态。观呼吸，就如实的观呼吸，现量的观呼吸，呼吸的情景就那么呈现在目前，至于意根如何辨认，得出什么结论，那是意根的事，色无常身无常，就应该让意根自己得出这个结论，让祂自己确认，不用意识去提醒，意识只负责把现象如实呈现给意根就行了，其余的都是意根的事，不用替意根着急，不用替意根拿主意，谁的问题谁来解决，帮忙没有用。这样的结果就是现量实证，没有情思意解，没有推理推导和想象猜测。</p><p>十一、观行能出生觉照力反观力</p><p>如涛的观行日记：我上小学时，每次跑步之后左腰就会岔气，医生诊断为肠痉挛。后来打坐久了，发现是尾骶骨的一根经络扯着肠子，导致整个下盘都有不适感。今年年初，我参加了师父组织的辟谷，前后断食十天，这毛病好了不少。这段时间通过打坐，体内气脉不断运行、冲击和调整，酸胀疼痛的位置也反复变化，目前左侧腰胯部经络终于畅通了，任怎样晃海，怎样弯腰撅背，也不再拉扯疼痛了。</p><p>经常打坐能使身体能量充沛，并培养出觉照观察力，故上坐后很快就进入状态，粗妄念淡薄，心意柔软，感觉很轻盈。就像开电动车，充满电的开车状态和电不足时的开车状态，完全两回事，前者非常轻盈，后者非常无力，拖着走，能量不同的缘故，清净心是能量，觉照力也是能量。打坐修定慧，就仿佛是充电。</p><p>把意识心的“知”安置在内心最深处，用这个“知”持续的照着，内在的染污和浊重就会不断的被清理干净，这是我目前用功的方法。这个“知”也是用来摄住意根和意识攀援的，就像要抓住一只小动物，你不能随便抓它的某个部位，比如抓它的尾巴或肚子，那样不行，你抓不住它，反而会被它抓咬，你得抓住它得后脖颈，它才会服服帖帖，一动不动。这个慑服妄念的手法，可能每个人都不一样，都要靠自己去摸索，找到最适合自己的办法。</p><p>评：禅定能把心从外境界拉回来，不再关注外界，心收敛回来，从而能专注的感知自己内心，这样才能反观反省自心，发现自心的烦恼和习气，检查出自心的种种不足和缺漏，自觉和不自觉的就会改掉这些缺点，弥补不足，变得谦虚谨慎，提升了品德修养。有些人专门拿灯向外照别人，不知道向内照自己，照自己是修自己，增福德，照别人是人我是非烦恼，消福德，灯下最黑，那就是你的心。</p><p>禅定好了，精力充沛，身心轻安了，心就会柔软下来，心量就会打开，包容别人和境界，不再与人为敌为仇，和乐相处，情商提高了，人际关系也变好了。时刻带着一个知，专注力提高，心越来越细致，越来越静，思惟越来越深，智慧越来越增长，烦恼自然越来越沉淀，以至于逐渐消除，业障也会逐渐的消除，修行障缘就减少了。这是脱胎换骨的过程，是全面修正自己的过程，没有这个过程，就不可能从凡夫过度到初果向以及初果人，不要想凭空成圣。</p><p>十二、观行犹如拴马桩是为栓意根马</p><p>蓝天的观行日志：上坐，采用主动腹部深度呼吸，吸气时到达最大，稍作停留，之后再呼气到最大，之后再稍作停留。深呼吸大概半小时后，能感觉有明显的气感，之后慢慢转为自然腹式呼吸。</p><p>按四念处经的经文，在呼吸中不再思维其他的事情，始终保持对呼吸的知，这时才发现自己的念头会时不时的冒出来，有时想控制不让念头出来的确很难，念头的主要内容是近期或者是最近几天经常接触的人的面容，跟他接触越多，他的面容出来就越强烈，现在知道为什么古人修行时都要避开人多的地方，这也可能就是所谓的意根的攀缘性和习惯性，临近打坐结束前大脑才慢慢感觉有些清明。今天打坐感觉一般，心不太静，打坐中莫名其妙的闪现经常接触的人的头像，自然腹部呼吸不太深长。</p><p>评：这里充分体现出意根的遍计所执性，体现出意根的攀缘性，对于曾经接触的境界的执著，不管有意义还是无意义的，都加以关注和执著，不肯歇心。要想降伏这匹野马，就要给他拴在呼吸的柱子上，一开始祂会乱蹦乱跳，时间长了，就会习惯了，安静下来，开始关注研究柱子以及柱子周围的景物，这就好办了，这叫作上道。</p><p>十三、坚持不懈观行功夫才能不断提升</p><p>如本的观行日志：这两天打坐每次先双盘25分钟，然后身体开始发热，再换单盘。现在右腿比以前软了。感觉双盘时的心力比单盘效果好一些。目前还是以修止为主，上坐后心能够沉下来，认识到“磨刀不误砍柴工”的重要性，不希求什么感受与结果了，也就不急躁了。能踏下心来从脚下做起，从呼吸开始。</p><p>上坐时还是先调呼吸，先深吸气至腹部，再缓缓吐出，多调几分钟，边调边放松。然后缓慢一个字一个字默念心经，达到止观状态了，再稍微观一会儿呼吸。当感觉枯燥了，心里就有点散动的欲望，然后反观这个心只是一种觉知的功能而已，这个“我”没有所依之处，内外不可得，恍然如梦，根本没有谁存在，然后就在这种状态下没有什么欲求了，心就止下来不动了，也没有了观的欲望。45分钟后腿开始麻胀疼痛时，坚持对治忍耐一会儿觉受，一小时就下坐，不想继续做下去了。</p><p>评：在观行中色身状态和心理状态起起伏伏是正常的，贵在坚持，到最后就平稳没有起伏了。那时观行就会牢固了，对于所观的呼吸，就会有清晰的认识和观感，以及对于观呼吸所引起的其他身体现象，也会有一个清醒的认识，不再入境。能跳出境外，心物分离，俯视色身，才能有一个如理的认识，看清色身的事实真相，逐渐感知到色身的生灭变异的空性。这种感知不是意识强行植入的，不是意识引导的，是意根客观的清醒的感知，不参杂情绪的，理智的认知。</p><p>只有理智的认知才能持久起用，才能改变身心，改变对五蕴的心态，才能客观的看待和处理五蕴的问题。这样持续的用功，断我见都是有可能的。这样慢慢修持下去，就知道意识在其中起什么作用，意根在其中起什么作用。对于意识证果的错误非理性观点，就会觉得有多幼稚可笑。有些人看到佛经里记载比丘听法几分钟就证果的现象，以为自己不用修行三十七道品不用修定也能很快证果，这是多么无知可笑的想法。</p><p>那些听佛说法几分钟就证果的人，前世今世都做了很多修行功夫，三十七道品具足，善根福德具足，得法因缘具足，佛力加持作用大，不是不劳而获的捡便宜证果，都付出了相当大的代价。我们现在精进的修习四念处观，就是在修习三十七道品，戒定慧三者齐修，努力培养善根福德，不走捷径，稳步前进，把基础打牢，种种因缘条件具足了，就能断我见了。</p><p>十四、外道的修身法也可以借鉴来修身</p><p>改的观呼吸体验：整座状态比昨晚要清明许多。自然呼吸，左鼻孔进出气，吸入深沉长一些，呼出清缓稍短一些，呼出后停留时间长。左鼻孔通喉咙处发干，吸入时发声大，呼出时发声小。试着观想右侧降火左侧升水，当观想时，呼吸就变的很轻微，没有上述现象。把注意力调整到呼吸上时，又恢复了上述呼吸状态。打坐观行尽量不要在累时困时进行，否则容易混沌，不清明。昨晚下坐后躺下时却自然的清晰的观起呼吸来。  </p><p>评：这里用了道家太极八卦图的修法，因为学佛人的身体与外道的身体结构相同，没有差别，所以调理身体时可以借鉴外道的方法，毕竟他们经验丰富，只要对自己修行有用的，拿来用就好，抓到耗子才是好猫。外道们都修禅定，禅定毕竟对修身和修心修智慧有用，我们就要修定，不用刻意表现自己与外道不同，好像殊胜于外道似的，如果禅定不如外道，烦恼就会比外道还重，这样会让人耻笑的。</p><p>十七、如何转妄念为智慧</p><p>悟实的观行日志：这几天打坐，我特意观察了一下那些妄念是怎么出现的。意识心没有去想，但妄念它也冒出来，是意识心去了别的，这就是意根在攀缘了。如果意根不攀缘就不会出现妄念，特别是平时比较注重的事情、感兴趣的事情，晚上打坐的时候，它就更容易冒出来。所以说白天能否保持心清静是很重要的，心清静，妄念就不容易出现。因此，白天对事的时候，要做到对事不入心，过而不留，这样的话心就比较容易清静了，就不会有那么多的妄念出现。</p><p>当然，因为对事、境特意去压制不入心，这是没多少效果的，降伏烦恼不能单独靠压制。要善于转念，遇事就思惟：凡是有相皆是虚妄，万法苦、空、无常、无我，色身不净等，意识心多往这方面去思惟思惟，思惟清楚了，烦恼就消散了，也才能做到人事物不那么入心，减轻甚至消除意根对事、境的惦记。</p><p>评：妄念来源于意根的攀缘和执念，意根对五阴世间的执取性非常顽固执拗，对于六尘境界的执取也非常的顽固，几乎是一刻也不停息，即使在睡着以后也是这样，以至于心不得清静，智慧不得出生，烦恼不能断除。要降伏意根这种攀缘性非常困难，只能转换意根的攀缘对象，转换注意力，让祂去缘一个更有意义的法，把祂定住在一个法上，之后祂的心思才能单纯一些。这是以楔出楔之法，最后再把楔拔除，心就会空下来了。念佛念咒念经都是以楔出楔之法，数息观、白骨观、四念处观等等观行都是以楔出楔之法。只要意根能专注了，专门思量一个法，智慧就能出生。</p><p>当你妄念丛生的时候，不要着急除灭它，要看着它，观察它，寻找它的来源处，就会发现妄念来无所来，去无所去，没有根，犹如浮萍，所以根本不用对治它，给它一个新的所缘，给祂一个新的重要的任务，让祂忙于一件事，心就会清净下来，智慧就能出现了。原来意根没有智慧，就是因为祂太攀缘了，所缘的法太多，不能专注的思量，就看不明白什么事理，当然就不会有智慧了。所以要想获得智慧，就要修定，把意根定下来，只面对一个问题一个法，问题就能解决了，生死大事也能解决。</p><p>十八、正确的观行功夫应该这样做</p><p>如涛的观行日记：目前入浅定较快，坐中提起一个“知”，随着呼吸，在内心照着、照着……不多久，啪嗒一下，心就仿佛入流了，瞬间清净，脑子也清净亮堂了。无需刻意去对付妄念。色身、觉受、妄念，皆为生灭幻化，空的，并非系缚，照着就好了，不用去对治，它自己就空了。</p><p>就像心经说的：“观自在菩萨,行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。舍利子,色不异空,空不异色,色即是空,空即是色，受想行识,亦复如是。”过去光知道背，不知道用，现在训练时，用起来，似乎找到点感觉了。五蕴不是障碍，不用去对付，只要记着它是生灭幻化的就行了，只管照着它，任它去，照久了，五蕴自己就会空，色身和妄念是会自动空的，这是我目前所能知。</p><p>盘腿打坐只是个形式，我也试过坐在椅子上，躺在床上，提起一个“知”，内心照着，这么走起，也能入比较浅的定。打坐时，双盘、单盘、散盘，也都可以，关键是用心的方法，方法对头，就可以契入。</p><p>评：心不静时，内心所缘有很多，而我们是有目标的，观行呼吸就是最主要的目标，也可以说是唯一的任务，抓主要事抓大事，才能保质保量的完成任务。不能去追逐呼吸之外的思想念头，那些都不重要，念头来来去去，终不停留，留也留不住，不分神的干正事就好。 心只缘呼吸，就像灯光只照在呼吸上，周围一切的身念杂念就不在心中，消失了，空了。而在呼吸上，会发现以前所发现不了的现象，也就是真相事实，至于是什么真相事实，各人在做功夫当中自己体会，每个人发现的可能不太一样，但最终结果却是殊途同归，那就是证得五蕴空和无我。</p><p>观行时不在具体身姿，行走坐卧都要观行，动静结合，相得益彰。但盘腿有盘腿的好处，就是能促使气血更畅通，色身更调和，心更静，念更集中。之后在配合身体行走活动，气血运行得到充分的调理，周遍运行，对身体更有益处，心会更清净。</p><p>十九、如何观行才能得到理想的效果</p><p>如本的观行日志：这两天打坐观鼻孔处呼吸，一直以修止与练腿为主。没有任何境界，右腿比以前软一些了，每坐双盘半个小时左右再单盘，或者单盘50分钟再换另一条腿，不是特别痛了，一小时的时间也不觉得很长了。下坐后，白天出门活动，时时让自己保持一种局外人的作意，去看看这个身体究竟是怎么活动的，用没有语言、思维、推理的那种心，去看、去听、去知自己与别人或张嘴说话或咀嚼吃饭、或露齿微笑、或眼睛转动、或举手抬腿从旁边走过。</p><p>一定不要在心里说这是意根的功能、这是意识的功能、这是耳识的功能、这是身识的功能等等去分析，要去以局外人的心态：不帮助参与、不帮助分析，这样才能有那种抽离身外的心眼生起来，从旁看着身心的变动过程，这里面意识动的是很微细的，只有去体验才明白。有时也会在某个时候回首反观一下这个能了别的心是个什么样子的，身心究竟是如何相应运转起来的？只把这个疑念提着，一定不要去思维推理，而且感觉思维推理一加上去，就没有了体验参究下去的欲望与力量。</p><p>越来越感觉自己的定力还很欠缺，有时候与人讲话多了就容易失去觉照的力量，习气不容易控制，经常得需要回到呼吸上安住。越来越感到修定的重要，感觉到体验与知识的差别。</p><p>     评论：观行时尽量保持单纯的知，不要刻意加入主观意识的思惟分析，不要有意识的主观思想，不要有什么观念带入，把心静下来，放下心，一切事都有意根默默的关注和管理，要相信主人。有些时候知识多也是个负担，能阻碍意根自己的思量观察，没办法看清真相和事实，也没法实证。社会各类成功人士，不见得是知识多的人，而是有深细思惟，有独道见解的人，都是意根有智慧的人，实际操作比较多的人，不是凭脑子空想，凭嘴巴空谈的人，空谈往往误国。</p><p>二十、有次第观行才有可能实证</p><p>耀灵的观行日志：昨天观六尘境界虚妄不实，心里不承认境界是实有的，尘境本虚，境不自名，于是心能够逐渐不黏在六尘境界里。观自己“起心攀缘分别六尘境界”这一行为是无常的，是不自在的，是消耗身心的，是苦的。为什么自己非得关注六尘境界呢？继续回光返照观行，心不攀缘分别尘境，也不起妄想思维。</p><p>再观诸法无我、万法唯识，这里感觉就是金刚经那句实无有法，一切法皆是佛法。就好比一切现象都是自己的影子，那我为何要去关注自己的影子呢？于是完全不起心忆念诸法，心安住在自在自明的状态里。若心里不起感，现象也不会应。</p><p>境界变得明朗，一会儿后感觉自己进入无边无际的虚空，找不到身体边际，找不到空间感，这时守住“诸法无我”的慧观，不去攀缘境界，心里虽惊恐但能坚持。这种境界十几分钟才退去，每次观行至此就会出现这种境界，不过有时候状态退步，隔数月才能观行到此。这时对“言语道断、心行路绝”有一丝体会，这时呼吸也若有若无了，只有丹田有轻微呼吸，身体气脉也在很快起变化，精神恢复很快。</p><p>评：这个观行看着挺精进，好像也有一些禅定效果，但是这些观行实际上是杂乱无章没有次第的，把所学的理论都拿出来观行了一遍，说是观行，实际上是熏习，都落在意识的思惟分析里，得出的结论是意识的结论，也都是所学的理论，没有中间证明过程，没有实际证据，所以仅仅是理论罢了。有太多人都是这样观行的，然后又都认为自己证得了，自己确认了。</p><p>实际上这里的理论，能观行成功一个，证得一个都需要一个无量劫的时间，因为那是属于地上菩萨的唯识种智范畴，凡夫能观行成就直接成为地上菩萨吗？显然不能。比如观想诸法无我，这是地上菩萨的观行境界，万法唯识也是唯识种智范畴，一切法都是佛法同样也是唯识种智范畴，一切现象都是自己的影子，暂且就说这个自己是指如来藏吧，证得这个境界也就初地满心位了。再比如观行六尘境界的虚妄，并没有什么证据证明境界是虚妄的，就让意识强行的不承认境界真实，就代表六尘确实是虚妄了，这不是观行，而是复述佛经。这样的话就算意识也没有证得和确认六尘的虚妄，何况意根证得，更是显得很遥远。</p><p>很多人都是理论学多了，什么都知道，可是什么都没有消化吸收，堵在心中，上不上下不下的，不知道这些理论所对应的智慧层次，不知道如何一步步的由浅入深的去实际证得，不知道修学和观行的次第。没有慢心的还好，一旦此人有慢心，就会认为自己证了这个，又证了那个，别人的话就听不进去了。即使没有慢心，不认为自己证了，这样杂乱无序的观行，于实际修证并没有多少益处。虽然暂时有了一些禅定，但是禅定不稳定，随时会退，即使禅定不退，死后也必退，不能实证断我见，死亡之时所有的禅定和观行又有多大益处？</p><p>现在学佛的人包括讲法的人，因为没有实证，不知道所学理论的深浅层次，只看哪个理论知识高大上就学哪个和讲哪个，好像学哪个讲哪个，就能证得哪个似的，非常忙乱，没有次第和章法。如果想要熏习佛法，对唯识感兴趣，熏习唯识是没有问题的，但是要观行实证唯识，那要在断我见证得三果以后，并且明心过禅宗三关以后，在此之前，实证唯识理论那是一点办法都没有，绝对不可能的。</p><p>修学次第就是观行五蕴无我断我见，然后是参禅明心，再之后发起后得智和初禅，成为三果人，有能力过牢关，如幻观、阳炎观和如梦观次第成就，之后才是唯识种智内容，如一真法界、万法唯识、诸法无我、镜像观、真如三昧等等。 如果前边基础的法没有证得，后边的法无论怎样观行都没有实际效果，不会证得的，只能叫作熏习而已。</p><p>不是像有的人所讲的那样，刚开悟就能观察到第八识是如何出生根身器界的，刚开悟就能观察出一切法都是第八识的种子功能作用，这是根本不可能的事。即使是真开悟，真证得了第八识，累死也观察不到这些内容，即使到初地二地三地菩萨境界，也观察不了第八识是如何出生根身器界宇宙器世间的，也观察不了一切法如何是第八识的种子功能作用。因为这都是道种智的范畴，刚开悟不可能有道种智，这样说就证明此人根本没有真开悟，不知道刚开悟的人究竟能观察出什么。</p><p>无论谁此生真想修行成就，不再流转三恶道，就要发大心大愿，踏踏实实的从最基础的佛法起修，不要好高骛远，眼高手低，试图建造什么空中楼阁。首先要把地基打好，一步一步走，不要跳跃，更不要试着飞行，练出脚劲练出腿功，此生真真实实能断我见就很好了，免除三恶道的苦，就很庆幸了。在此基础上再参禅，能真正明心，已经相当不错了，功德极大，其余的暂时都不用考虑，因为离自己还很远，考虑也没有用。</p><p>二十一、观行的目标和结果是现象界的空 </p><p>蓝天的观行日志：今早上打坐观呼吸，吸气从鼻端入气开始，顺着气流所到之处：鼻腔、咽喉、气管、胸腔，往下经过上腹、中腹，最后到丹田，呼气时从丹田开始，气流经过上述通道排出。能感觉气流流经每一个呼吸部位，吸气时能感知气流头部所到部位的状况，呼气时能觉察气流尾部从丹田处向上收缩至胸口，气流进出经过处，有麻酥酥的感觉。</p><p>今早打坐的意念比较集中，没有出现头胀、气冲等现象，头脑清明，呼吸均匀轻松，没有前段时间那样的阻力。进入观呼吸没有多长时间，胸骨部位就像开了一样，有些暖很舒适，接着两肩也是这样，骨头像开了一样非常舒适，这就可能是所谓的轻安吧，腹部温暖，不似以前那样热。随着观呼吸的持续，呼吸的深度加大，吸气时气流可以腹底，呼吸时也能觉知脚踝处有气流出入。不知不觉中，打坐结束的时间到了，现在感觉打坐时间有些短。9月16日</p><p>评：以上观行到的都是现象，主要是你在这些现象上发现了什么真理？对这些现象有什么感触？比如说小孩子玩玩具，玩着玩着就会觉得厌了没意思了。为什么觉得没意思了？比如说长期的重复做一件事，做着做着就会觉得没意思了，为什么会觉得没意思了？比如说天天吃饭，吃着吃着应该觉得吃饭没意思了，只是不得不吃。当然绝大多数人不会有这样的想法。比如说人这一生，生老病死，爱恨情仇，五欲不断，有的人活着活着，就会觉得人生不过如此，突然就觉得没意思了。当然绝大多数人不会有这样的想法。</p><p>这些还不是究竟的，再往里探究，会有新的发现，发现了所缘的法是空的，才出生了智慧。觉知了法的生灭，才是智慧，觉知了法的空，是真正的智慧。没智慧的人，即使受一辈子的挫折，也不会觉得人生空虚。有智慧的人，即使一辈子顺利，也不会觉得人生有意义。长久的观察，就会体悟到现象的生灭，体悟到现象的空。空了一个现象，就会空了与此相关的其他现象，进而五蕴皆空。</p><p>二十二、观行越不过七觉支三十七道品</p><p>如涛的观行日记：腿部的气脉是越来越通畅，盘坐很轻松了，上坐时几乎不需要怎么努力，稍微调息，就能进入空灵柔软的状态，然后就把五阴无我的念头，悬在内心去参究，下坐后，两腿发乐，非常舒服。早晨一醒来，连带整个身体都很喜乐，腰部、手脚、心口、喉咙，能量很充沛，整个身体的细胞都是乐的，气血太充足有发胀的感觉。能量太充足感觉是一种负担，这时我通常就起床，到处走走，把聚集的能量消散消散，头脑也感觉非常轻快和清晰，好像有股清气在往头顶冲。</p><p>我会继续保持少吃的状态，从今天起到假期结束，不吃米面之类的食物，把肠道再清空一些。我感觉打坐之所以有阻碍，主要是五阴遮障，也就是身心两方面原因，首先身体气脉不够通畅，能量无法有效积蓄和提升；还有就是心不够清净，思虑繁乱，没法专一思维法义，功夫就进展就慢。所以我要从身心两方面去除遮障，只要真用功，一定会有效果，就怕平常被事务卷进去，浑浑不觉，修行就上不去了。所以意识的警惕性很重要，在意根还没受熏成功前，意识要多提醒和督促意根，把精力放在正道上，绝不能到处放羊。</p><p>把身体弄得清静些，让头脑思虑澄清些，相对来说都不算太难，但断我见确实很难，因为意根实在太顽固了，从平常的梦境中就可以观察到，梦中有时还会有各种自我维护的心态和情绪升起，白天时可以自欺欺人，内心好像特别清静，但晚上做梦时，发现意根的斤斤计较并未停止，所以功夫还停留在浅表层面，得继续深入，路还很长。2021-10-04</p><p>评：这是修到了喜觉支阶段。七觉支助道品：念觉支、择法觉支、精进觉支、喜觉支、猗觉支、定觉支、舍觉支。七觉支一环套一环，没有前边觉支就没有后边的觉支。在喜觉支出现的时候是心喜身乐，后边还有轻安觉知、定觉支，最后是舍觉支。</p><p>如果是处于身乐的最初阶段，就保持下去，不要急于消散，让功夫自己转折推进，不要有太多人为的干预，自然而然最好。只是不要执著和在意这些觉受，以至于阻碍功夫的进步就好，轻安觉支和定觉支还没有生起的时候，觉受是空不掉舍不掉的。这时候还是应该保持自然状态，随顺身体的乐触和觉受，否则后边的觉支也不会出现了。年轻的时候，身体条件好，修道非常快，年龄越大，修道越困难，所以修道要越早越好。</p><p>另外，在禅定中观行五阴无我，心中悬挂的法义，内容不要太多 太复杂，尽量比较简单和单一， 一点一点的深入，贪多嚼不烂消化不了。观行无我，把五阴的所有组成部分拆分开，从一个方面下手观行，心中悬挂一个比较具体的法义，这样观行就不会太困难。一开始不要在心里悬挂五阴无我这样大的念头，因为这时候无论是意识，还是意根能力还是有限的，啃不动这样的庞然大物，待能力提高了，宏观的观行能力增强了，再总体或者是整体观行五阴十八界的无我性，这样才能吃得消。</p><p>请问意识证果的那些人，你们有没有经历过这样的觉受，有没有这样的体验？估计你们在梦里都没有梦见过，更不可能有亲身体验了，七觉支的第一个觉支恐怕都没有发起过，定觉支舍觉支更没有见过影子，跳脱了七觉支就果了，甚至跳脱了八正道就果了，甚至跳脱了三十七道品就果了，没有实修的影子，哪能断三縛结，哪能有实证呢？不断三缚结如何能明心开悟呢？各个团体各个人都给在家贴上实修实证的标签，跳过三十七道品的修行，怎么能有实修？只要名誉，不管后果，这就是目前学佛人的心态。 </p><p>二十三、四正勤是实修的一个硬指标</p><p>八十二口的观行日记：平时感觉心里空空落落的，没根，没味道，向内关注的多，对外关注的少。现在对众生的感觉不如以前多了，平时说话少了，虽然还是喜欢学习法义，但对法义辩证没有太多兴趣了，跟别人讨论问题，说到一半就不想说了。以前工作生活遇到烦恼会失眠，现在该吃就吃，该睡就睡，说忘就忘，有时入定会想起来干扰一下，然后又忘了。意根一动，能感到开始造作了。意根动最明显的就是贪嗔起来了，要仔细观察，作任何事，意根都会先动。</p><p>评：当禅定生起来以后，观行也跟上了，内心就会发生改变，有禅定和没有禅定的区别很大，有禅定以后，对外的攀缘就少了，对小事的关注也少了，对很多事情就不感兴趣了，烦恼减轻执念少，智慧就会逐渐生起来了。禅定的益处说之不尽，如果不修禅定，那就不是在修行，学佛就是戏论，无法实证。有禅定才能观行，观行也才能细致到位，才能抓大事放小事，舍弃诸多不必要的事情，人也会变得随缘和善巧，固执性减弱，嗔念变轻，贪心减弱。</p><p>有禅定和修观行以后，能够向内心处反观，心里的烦恼就能及时发现，能随时得到调伏，恶不善念就会越来越少，善念和舍念越来越多，四正勤就修出来了，未生善已生，已生善增长，未生恶不生，已生恶灭除。如果有些人烦恼还很重，心念善少恶多，四正勤就没有修好，心性没有改变，断我见证果就没有希望。</p><p>所以说证初果是要断除粗重烦恼的，心性已经是圣贤人的心性。如果有人说自己断我见了，或者说自己开悟了，可是他的烦恼看起来还是很重，心性没有根本的改变，贪嗔嫉妒，四处争斗，身口意都不清净，这样的人就是自以为的证果和开悟，如来藏是不承认的。任何人如果对戒律和禅定没有修持，没有如理观行，七觉分和八正道四正勤等等都没有修持，都不可能有大小乘的任何见道，所以四正勤三十七道品就是实修的硬指标。</p><p>二十六、如何反观自心贪习</p><p>白雪香的观行体验：心有定的时候就能发现，我现在有烦恼，这是习气种子现前了。破这种习气我有个体验，例如看到一件玩物手串之类，心里忽然生起喜爱，继而生出占有欲，然后就拿起来摩挲。这时觉知到，这是贪欲。</p><p>然后继续分析，手串就是一段木头，无非弄个机器或者手工打磨，之后刷上一些油漆而已，别无他趣。再观行相类似的东西，比如项链、手镯、挂件之类的物品也是如此，这样尽量细致地观行，以后这个贪手链之类的种子，就被破坏掉，不会再出生了。这样心越来越清净，不会反复发生，不必因为习气现前总去斗争，使得烦恼反而加重。戒很重要，能使心静下来，更细致，心水澄清，思路清晰明了。</p><p>评：这样的观行是很好，但是比这更好的观行是什么？是观心，是心趣境，对物生起了贪欲和占有欲。为什么要喜欢手串等物品？不是手串有什么吸引力，吸引了自己，喜欢物品，好像是外物有什么过失似的，其实外物就是外物，四大物质而已，没有过失，它吸引不了你。而你为什么被吸引了？说到底还是自心迷寐颠倒。如何是颠倒的？如何才能不颠倒？喜欢外物，是因为认为外物能为我所用，能装饰自己美化自己，还是因为有个我才去喜欢，物品能满足自己的贪心，从中能获得一种觉受和满足感，注重觉受，就有贪欲。</p><p>很多时候，人都是追求一种觉受，只管感觉舒服就行了，不管这种觉受有没有必要，有没有过失，有没有障碍，值不值得，这些都不管，这就是迷惑颠倒。活在世间里，内心充满了无明，盲目的活着，习惯于什么就做什么，跟着感觉走，没有反观力，也不会反抗习惯，随波逐流。观行自己的种种感觉，都有什么实际意义，这个观行比较究竟。观来观去，你就会发现，所有的觉受都没有实际意义，放下觉受天地宽，贪欲没有了，内心才能舒适自在和解脱。</p><p>二十七、什么是现量实证</p><p>蓝天的观行日记：今早上坐观呼吸，呼吸几次，呼吸顺畅，胸腹温暖舒适，气脉运行清晰，能感知气流运行到两脚脚心处，会阴穴打开。腰部有热流流入。随着呼吸的深入，呼吸压力增大，下巴处微微有些发麻，但明显比前段时间减轻，右胸、右肋部有明显发胀堵塞感，向上辐射到腋下，再向上延伸至右肩胛，通过喉管右侧与右侧下唇相连，隐约还通向右耳根，每次呼吸都能感到这条线路上各各点相互牵引，左侧腋下微微有些发胀，没有其他的状况，随着呼吸观行，右侧以腋下为中心的这条线路由发胀拥塞慢慢变得舒适、热络，并向后侧延伸至后肩。</p><p>对全身的觉受观行了一段时间后，就把念头集中鼻子上，观行鼻子部位的出入息。认真听气流通过鼻腔时发出的摩擦声，仔细感受气流流过鼻腔及咽喉时的觉受，慢慢感知到脑部随出入息时发生的变化：脑内有种不断疏通的舒适轻松感，两肩及腋下也有凉丝丝的清凉感，除了鼻部有气流外，脖子的前后左右都能感知有气流围绕，胸腔渐渐打开，能感知皮肤参与呼吸的面积扩大，身体发热增加，全身舒适感增强，右耳有要与鼻子和脑相通的前奏，但到打坐结束时也没有彻底通。</p><p>在前几天的打坐中，下巴、下唇和舌头麻胀得很厉害，喉部发紧，于是在打坐的后期，经常思考法义，这样能加强定力，能快速越过上述出现拥塞状况。思考的法义还是“身无常，色无我”，后来就把“无我”作为主要思考的内容，大致思考之后，就把大脑放空，发现这时定力明显增强，体现在呼吸加深、堵塞的地方慢慢化开、身体舒适感增加。</p><p>几天前有一次打坐后期，思考法义，后来再观呼吸时，已感觉不到身体，仅仅感觉一束束气流交织在一起，吸气时一大股气流融入其中，呼气时一股气流离开而去。现在微微能感觉到意根现量观察的味道。</p><p>评：心再细一些，就会感觉到色身就是一张幻网，由气流编织而成，再以后感觉气流也不真实，色身更是虚幻的了。我这样说的时候，你们那边想一想，就会觉得好像是这么回事，确实是这么回事，但不管你们怎样觉得是这么回事，再怎样确认，都不是真实的感知和现量的感知，都不是实证。如何是现量感知和实证呢？</p><p>现量实证，就像蓝天这样的现前观察，我的色身现在确实是这样的，我的感知现在就是这样的，这些法目前正在运行着，能如实的观察到，这才是现量观察现量实证。除此都不是现量实证，可以叫作依理想象，是比量和非量。</p><p>所以有些人说我能随文入观，一边听法一边观行，我就是实证了。但是如果这些法目前还没有发生在你的身上和心里，你不能现前如实观察到，那就不是随文入观，那是依理想象，是比量和非量，还没有现量，正在发生的事情你观察到了，才是现量观察现量实证。</p><p>好多没有禅定，也不会观行的人，听听法，思惟思惟，就觉得这些法讲得对，确实是如此，很确认，我现量观行了，我断我见了。但这仅仅是推测推导，不是现量观察，还不能断我见，离断我见的距离不知道有多远，也许这辈子还不能断我见，也许几百年几万年甚至几劫也不能断我见。关于什么才是现量观察和实证，大家都应该仔细地加以辨别，不可盲目自信，以至于导致大妄语，这样就非常不好了。</p><p>二十八、六根互通互用的基础</p><p>蓝天的观行日记：今早上坐观呼吸，气道通畅，胸、腹、肩、背温暖舒适，经过几次呼吸，热流涌入脑部，今天脑部、面部等没有明显的堵塞现象，呼吸压力不大，意念感知全身气脉变化和觉受，后来把注意力集中在眼前。</p><p>偶尔思考一下法义，突然想起师父前天开示说：要专心感知呼吸，不要意识的推理和引导，现量观察呼吸的运行及生灭。于是就在眼前专心观察呼吸，没经多长时间，在一个吸气过程中，突然“吧嗒”一声，感觉右眼睛和右耳根相通了，紧接着又与脑相通了，感觉右脑部位有些空明。继续观呼吸一段时间，左眼和左耳也相通了，整个脑部变得空明，眼前变得清澈，耳朵对外面的声音敏锐性降低，能明显感到专注力进一步提升，由于所有的注意力都在头部，没有感受身体其他部位的受觉。头部在后续的呼吸中有些变化，但不太好描述，就这样一直持续到打坐结束。11月21日</p><p>评：在打坐过程中，感觉眼根与耳根和大脑都相通了，这是禅定使得四大发生了变化，变得微细了，胜义根中各根就通融了一些，将来禅定再深时，五根都通了以后，功能作用就会可以互相代替，尤其是意根可以代替五根一部分或者全部的功能，六根互通，六尘可以由一根了别，眼根不仅可以见色，还可以有耳根的闻声功能、有鼻根的嗅香功能、有舌根的尝味功能以及有身根的觉触功能，同理其它几根也是如此，这样六根的神通妙用就现起来了。</p><p>众生原本都可以有神通妙用，因为心有阻碍，五阴身就分成了六根，各根各管一部分功能，其功能作用就受到了阻碍，用起来就不那么妙了。要想还本复原，就要把心量打开，各根的功能打通，妙用就会出现了。</p><p>感觉大脑通透了，是心清静以后，心念集中，气脉从前边任脉运行到后边的督脉，到达督脉末端大脑部位出现的反应。气脉在后脑胜义根部位，到达头顶，再向下到达整个面部，在印堂穴任脉与督脉接壤之处，一个小周天快运行完了。因为注意力集中，定力增强，心念的意念作用也强，身体会随着意念有所改变，这是三能变识的功能作用，意根的能变作用明显，略显主动性的能变作用。如果意根的意念作用非常大，就会想什么变什么，希望什么来什么，心中所想都能如愿实现。到一定时候，指石为金都有可能，变化一定的境界也有可能。</p><p>二十九、什么是舍受</p><p>白雪香的观行感悟：舍，舍去了，不要了，或者说没了。受，受想行识的受，受觉，情绪化的一种觉受。舍受，感情比较迟钝，或者说没有情绪。举个例子，对于食物，没有这个“好”吃，那个“不好”吃。大部分情况只有个能吃或者不能吃。</p><p>再例如，于父母兄弟亲情分离或者团聚，内心没有变化。不会有高兴激动或者失落之类的情绪。再例如，于人情世故冷暖，骂我不会生气，或者假生气，或者生一下气。别人夸我，并不会有沾沾自喜之类的情绪。对别人的责骂或者误会，也不是不屑，也不是容忍，也不是无动于衷。就如一刀砍空气中，或者一拳打海绵上，任别人如何总是没什么！</p><p>舍受的内涵是无我，我在舍，我在受。没有我自然就无所谓舍无所谓受了。因为舍受的主体消失了。</p><p>评：修行就是要这样的修，不是整天理论一套套的，实际上心行却与理论截然相反。修到无心的时候，就不用谈戒不戒的了，戒是多余的。无心的时候，德行最高，无所求的时候，德行最高。德行高了，才能成为圣贤人，没有品行低的圣贤人。</p></div>"
},{
    "title": "第三章 白骨观的观行体验",
    "author": "生如法师",
    "date": "2022年01月11日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  白骨观的观行体验 </strong></p><p>一、三昧是意根的现量境界（一）</p><p>如峰的白骨观日志：我在打坐的后半段，眼前清清楚楚看见血管里的血液在流动，不想看也在脑子里出现。在下坐闭眼搓掌时，眼前出现了红色的一团，里面类似橘子瓣，果肉还在蠕动。接着我继续搓掌，红色的一团开始发白发亮，里面出现了立体图像，是放大后的汗毛孔还有毛发、皮屑、红色的包和发炎的汗毛孔，看得我特别不舒服。下坐搓掌能出图像，这个是怎么回事？        </p><p>评：这个观行日志里所描述的现象属于定中独影境，是定境法尘。定境法尘是独头意识现量了别的，不是比量，也不是非量了别。刚开始入定打坐观行的时候，是独头意识非量的想象白骨观，天长日久熏染了意根，由意根现量呈现出白骨观境界。</p><p>意根现量呈现的境界就是三昧境界，三昧里包括禅定和智慧，是定慧等持的境界。这个观行的结果里一定有智慧生起，没有智慧的不是最后结果，而是中间过程。定中独影镜是意根所现量呈现出来的，独头意识再现量了别白骨现象，意根受熏以后就会现量呈现出祂所认知的境界，意根认知什么境界，如来藏就现出什么境界，独头意识就了别什么境界，这就是三昧境界。</p><p>三昧境界里定非常强，慧也非常强，定容易懂是专注的意思，慧是什么？这里的慧就是认可了五阴身肉体就是一堆白骨，意根认可以后白骨观就修成就了，或者是中间过程成就了。修到最后阶段还会把白骨化为微尘，最后微尘也消失，这都是意根所现量证得的境界。</p><p>下座以后还有没有这样的定境法尘？如果心不散乱就仍然处于定中，处于三昧状态，行走坐卧都会呈现出白骨。前五识了别不了，五俱意识也不能了别，只能由独头意识了别，因为三昧境界都是独影境，是个人单独修出来的，属于个人所有，没有公共的外法尘和外五尘，所以他人不能见。</p><p>所有的三昧，不管是定境的三昧，还是定和智慧等持的三昧境界都由意根发起，如果意根没有被熏染成功，就没有智慧的生起，三昧境界不能出现。包括念佛三昧这个定境，由意识来念佛，把意根熏熟了以后，意根就会自动自觉的念佛，意识不念而意根念。在定境里意识如果感觉很累就不想念佛了，但意根已经习惯于念佛，就自己继续念佛，无语言和音声的念，这是独影境，只有独头意识才能听到。意根不管意识想不想念佛，自己就要念佛，意识即使想控制也控制不了，这个时候就属于念佛三昧境界。</p><p>处于念佛三昧境界中的时候，行走坐卧无论做什么，都好像有念佛声音出现在耳边，其实是出现在心里不是耳边，也没有声音，只是个意念而已。念佛声音不是意识念的，意识不想念还必须听念佛声，这个念佛声是如何现起来的？是意根念佛，如来藏随之现起了念佛的声音，不由意识控制。意根没有语言文字，独头意识却能够了别出念佛声，不想听也要听，还得一直听下去。</p><p>断我见证果的时候就是一种得法眼净的三昧境界，里面有未到地定和苦空无常无我的无生智慧。这个智慧是谁现起来的？是意根现起来的，意识平时观行熏染意根，意根思量四圣谛理，最后证得了五蕴苦空无常无我，法眼净的三昧境界就出现了。在禅定当中意根思量出一个如理的结果，智慧就生出来了。这个三昧是由意根现起来的，独头意识现量了别，所以任何一种实证法都是意根和意识的现量证，意根和现量相应，没有比量和非量，只有意根主动现起来的法才是现量和三昧。</p><p>在意根断我见证果以后处于三昧境界，就会出现觉明的现象，没有三昧就没有觉明现象。觉明现象是意根触证从前未知境界，心里兴奋惊喜引发出来的，意识发不起来。觉明现起的时候是处在禅定三昧状态的时候，没有禅定就没有觉明。在三昧中烦恼非常轻微，可以说不现起，全部降伏下来，身心轻安，觉受非常，睡眠减少。禅定当中气血通畅，精满神也满，欲望降伏，睡眠非常轻，可以说没有睡眠盖，每天有三四个小时的睡眠就足够了，这是意根所现起的三昧境界。</p><p>明心也是如此，意根证得本心以后，也处于三昧状态当中，行走坐卧都在定中，生起了般若智慧，烦恼非常轻微，也有觉明现前，身心非常轻安、舒适、自在，睡眠也非常少，神满不思睡，心境愉悦，处在这个状态当中，都属于三昧境界。</p><p>还有一种真如三昧，证得的时候也是如此。其实真如三昧属于无生法忍的智慧境界，也就是道种智、唯识种智，不是刚开悟的人所能证得的，入地的时候才能证得。什么叫真如三昧？证得一切法的真如性和唯识性，就是真如三昧。</p><p>在一切法上见得自己本心的运转，就知道一切法都是真如的性质，一切法都是真如，这个时候就入到初地了，分证法无我，分证无生法忍，分证一真法界，分证大乘的解脱，也叫分证即佛，这个时候才有真如三昧。在初地之前，不能证得一切法的真如性，没有唯识种智不能见到一切法上的真如，真如三昧的智慧是相当深细的，在这之前，只能有无生忍的般若智，没有唯识智，无生忍的智慧相比真如三昧的智慧浅很多。</p><p>思考问题：我们平时根本无法见到的现象，在打坐的时候为什么见到了？是哪个识见到的？见到的是什么境界？不打坐的时候是否还会见到？</p><p>二、三昧是意根的现量境界（二）</p><p>白雪雪的白骨观行日志：早晨闭目打坐，感觉右脚脚踝骨有点痒，忽然看到（闭目看到的）脚踝骨痒的地方愦烂了，观想用手指一划，浑身上下的肉都掉了，就剩骨头架子，但是上边挂着黑红的血丝肉丝，不是白骨观最后出现的那样雪白的骨头。</p><p>我觉得这仅仅是白骨观的中间过程，先掉皮后掉肉，还剩是筋和骨头，是有次第出现的，你不能一下子从什么也没有一下观照出白骨来，功夫是一步一步递进的，这是中间层次，以后还有更进一步的境界出现，然后才能现出白骨，那时候白骨观就成就了，也就证果了。</p><p>评：在最初观行的时候，独头意识可以用非量的方式一点点契入，或者使用非量的方法来求证，眼识和意识见不到白骨，是独头意识想象身体白骨的样子，这是非量，以此非量来熏意根，虽然比较困难，但因为最终结果是事实，意根早晚会见到事实，当被熏成功的时候意根就认为身体是白骨，白骨境界就会现量的呈现出来了，这是意根现量观到的。</p><p>在观行五蕴的时候，其中也有由独头意识的非量过渡到意根现量证得的境界，比如观行过去生的色身和未来世的色身都属于意识非量想象的，但是最后意根被熏成就了，见证到了过去和未来的五蕴都是空的，认可了五蕴无我，就证果了。</p><p>为什么意根现起的都是现量境界？因为意根所有的认知，由如来藏呈现，如来藏所呈现的法不管是什么，意根都亲缘，是什么意根就知什么认什么，所以意根了别的就是现量境界，没有比量和非量，这时候独头意识也是现量的认知。在意识观行的时候，可能没有现量，可能有比量有非量，但是意根被熏了之后，一定是现量境界的认知。</p><p> 从现起的白骨观境界来观察，从三昧境界来观察，就应该知道是谁先证法，肯定是意根先证法，独头意识后现量了别。意根是瞬间的顿悟，顿悟以后智慧升起，和以前的智慧认知完全不同，这个时候就有可能一拍大腿说：原来是这样。一拍大腿或者拍脑门，就表示震惊，知道了从前所不知道的事理，颠覆了从前的认知，这叫顿悟，是突然间明白的。</p><p>一切法的证得都会出现三昧境界，顿悟的时候就是三昧境界现前了，不是顿悟而是渐渐明白的，是意识通过思惟一点点明白的，但也不会明白究竟，法里的奥秘还是不甚了了。而意根证的时候，一翻两瞪眼，是就是，不是就不是，很实在，没有虚假。</p><p>白骨观的三昧境界以及所有的三昧境界，五识无论如何努力也见不到，五俱意识也见不到，独头意识才能见到，现量了别的一定是现量境界。白骨，五识见不到，五俱意识也见不到，独头意识与意根有现量智慧的时候才能见到。六识见不到白骨的时候，白骨观就是非量的观行，是想象白骨，等到白骨真的现前的时候，独头意识和意根共同现量了别，说明所有的证都是现量境界。如果是比量和非量臆想出来的境界，就没有证，也没有三昧境界。证果和明心，证得一切法都是这个原理，实证和推理思惟的关系，我们应该很清楚了，后续如何用功都应该很明了了。</p><p>三、定果色是意根的现量实证境界</p><p>白雪香的白骨观观行日志：早晨闭目打坐，感觉右脚脚踝骨有点痒，忽然看到（闭目看到的）脚踝骨痒的地方愦烂了，观想用手指一划，浑身上下的肉都掉了，就剩骨头架子，但是上边挂着黑红的血丝肉丝，不是白骨观最后出现的那样雪白的骨头。</p><p>我觉得这仅仅是白骨观的中间过程，先掉皮后掉肉，还剩是筋和骨头，是有次第出现的，你不能一下子从什么也没有一下观照出白骨来，功夫是一步一步递进的，这是中间层次，以后还有更进一步的境界出现，然后才能现出白骨，那时候白骨观就成就了，也就证果了。</p><p>评：以上白骨观的境界，都是定中所呈现出来的境界，叫作定果色，由于禅定所引生出来的境界，都是现量境界，是实证境界，没有一丝意识的想象思惟作用，都是意根的现量观行境界。意根有什么思想观念，认可什么法，就呈现什么境界，做不得假，作主识就是这样威武有势力。在定中，脚踝骨的肉烂了，掉下来了，骨头挂着血丝和肉丝，这样的现象是不由自主出现的，是意根的现量认知境界，是靠意识想象不出来的。</p><p>如果白骨观靠意识的思惟臆测，无论意识觉得身体应该是什么样，但身体就是不听话，永远不会变成什么样，因为意识无势力，不作主。定果色由意根而起，永远不由意识而起，但是意识在白骨观的前期，起着引导意根进入观行境界的作用，对意根有引导熏染的作用，因此意识也是功不可没。</p><p>以上的观行确实是观行的一个过程，白骨观还没有完成，骨头还不够干净，色彩还不够白净，说明观行者还有一些业障没有消除，心还不够纯净，禅定力还不够强，还有待进一步更深入的观行，以完成白骨观，断除我见，得法眼净。</p><p>四、问：白骨观真正进入定境，白骨现前时是否还有呼吸？末学尝试白骨观很久，始终在意识里妄想，不能发起意根境界的骨相现前，是熏习不够的原因吗？  </p><p>答：如果能够断除呼吸，没有呼吸这个身行了，一定是在四禅以上的定境中，四禅以下都有呼吸现象，不包括四禅。修习白骨观的过程一般都是在初禅以下的禅定中，包括初禅，当然都有呼吸，及至证得白骨观，白骨观现前了，也是初禅以下的三昧境界，当然也是有呼吸的。处于四禅以下的禅定中都有呼吸，二禅以上就没有觉也没有观了，白骨观不会现前的，所以白骨观三昧出现的时候一定还有呼吸。</p><p>白骨观整个观行过程，就是用独头意识来开始观，并且不断的熏习意根，让意根也有观，当意根观成功的时候，定果色出现，白骨观三昧就会现前了，这时就实证白骨观，得法眼净。意根被熏到什么程度，就会有什么程度的白骨观境界，没被熏成就，就没有白骨观三昧境界出现。</p><p> 五、可以用观无量寿经里的日观方法来修习白骨观吗？</p><p>观无量寿经里的日观和白骨观的修习方法是一样的，难度也差不多，不是太难，所有观想取证的方法都差不多。日观后边的地观和水观比较难，日观不算太难，但是观想也很不容易，也得一年两年，有不少人观两年了，没听说谁观成就，现在可能都放弃半途而废了。</p><p>真修行不是那么容易的，证得任何一种三昧都不容易，如果放弃修行在生死中流转更是困苦得很，相对比较来说修行比不修行更容易一些，更快乐一些。修行是否容易还在于当人，都是事在人为的，容易半途而废的人意志力不够坚强，修行上从没有什么体验，感觉前路茫茫，往往是在世间法里也是不够坚强，轻易就半途而废的人在佛法的修证上也是如此。</p><p>白骨观需要观个几年，快的两三年可以观成，这要看根器，娑婆世界根器比较不错的太少太少了。还有观像念佛法门的观，用功方法都差不多，方法虽然差不多，结果都有三昧出现，但因为所观对象不同，所证就不同，观行五阴空的证小乘果，观行大乘般若唯识的就证大乘果。大乘观行起点很高，需要有小乘的观行基础。日观观成了跟证果明心暂时没多大关系，但是禅定力却非常好，以此禅定力观行其他法成就就会很快。</p><p>观无量寿经十六观到第七观的时候才能明心，前几观都不能明心，但第三观的三昧境界出现就能保证命终往生极乐世界。白骨观成就能够断我见，证得初果到四果，观像念佛观成了不仅是简单的明心，有可能到达初地了，这就要根据每个人智慧证量和禅定证量，各方面条件综合起来才能判断，观行的入手方法都是没有多大出入的。</p><p>六、修行白骨观的过程</p><p>问：最近这几天我在想象比对全身骨骼形象和观看全身骨骼照片，脑海中出现的对身体各处骨骼的形象，就好像家里的各种物品一样的清晰，身体在动的时候脑海里的全身骨骼形象也跟着一起动，心里感觉很定，头脑散乱也轻了许多，我这样观行是否正确？</p><p>答：这是白骨观的最初准备工作，都由意识来完成，意识要收集资料，整理、归纳和分析资料，再推导和想象白骨的形象，但无论意识如何推导和想象，三昧都不会出现，因为这些做法都不是现量的，心里不管如何确认白骨就是这样的，也不会有现量的三昧境界出现。就像意识无论怎样想象观无量寿经里的十六观，都不会出现十六观的任何一观的现量三昧境界，就连最简单的日落观三昧都不会出现，因为意根没有观成熟，或者意根还没有起观。  </p><p>意识所作的这些收集资料的工作相当于小秘书的工作一样，把这些资料完整细致的整理好以后要上交给意根领导，然后就没有太多事情可做了，只等领导下一步的指令。意根看完这些资料以后，觉得这些资料很重要，就会放下手头其他的工作，专门研究这份资料，精力集中专注思考资料，心中渐渐就明了了资料的具体内容，就会发现事实，智慧才会生出来，三昧才会出现。</p><p>上述意识初步所做的工作基本是正确的，在比对和观看骨骼结构图和想象骨骼的时候，就是在给意根传递信息，熏染意根，把意根的注意力转移到骨骼的观想上来。现在来看有点初步的效果，但还需要进一步加强意识的观想，需要再熏意根，让意根的攀缘越来越少，注意力越来越集中，定力越来越强。当意识的观想很清晰，定力也很强的时候，意识就不用太用力观想了，更不要再做思惟分析整理归纳这样简单初级的事情，没有必要了，保持在身念住上不动就行，让意根去专注的思量。功夫需要一点点积累，慢慢就会水到渠成的出现三昧境界了。</p><p>那些把意识最初级的推理、整理、归纳、分析等等的作用，当作是终极的证果方法，简直太浅薄了，意识的这些作用离断我见证果的差距也太大了。所有在意识上用功的方法，都是过去被所有有现量实证的禅宗祖师所大力呵责的情思意解，有智慧的人都不以此为究竟。意识的思惟方法如果盛行起来，无论大乘还是小乘，必然都会走入歧途，佛教的修证必灭，没有修证，只剩下一些知见，慢慢知见也会不具足，佛教就毁灭了。</p><p>如今人没有福德和智慧，把祖师们扔进垃圾堆里的东西又翻出来，当作宝贝一样的推崇，但推崇意识证果就是毁灭佛法的行为，推行意识证果的人应当及时忏悔和改正，不应再继续步入邪路歧途，不然后果难以想象。大丈夫自能顶天立地，错了就要及时改正，不要虚名，果与不果的不由任何人说了算，都由如来藏说了算。符合证果事实的，如来藏自然会呈现与圣人相应的果报，谁否定也没有用。同理，如果不符合证果事实的，如来藏只会呈现没有证果的凡夫果报，无论如何也不会呈现证果圣人的果报，谁给印证果位也没有用，还有大妄语的不可爱果报，最终得不偿失，智者善思。</p><p>七、为什么修白骨观能够断我见证得初果至四果？</p><p>     凡夫众生无始劫以来因为愚痴无明，没有禅定和智慧，对五阴以及一切法的观察和认知只能粗略的停留在表面现象上，不能有实质和究竟意义上观察，所以一直把色身当作实有之法，也把识心的作用当作实有之法，不知其苦空无常无我，这是对五阴的错误认知。通过修习白骨观，定力越来越深，其观察力度就越来越强，越来越细微，能清晰的观察出色身的生灭变异，身空的真相就会浮出水面，整个色身的肉体就呈现出白骨的模样，最后白骨也会成空，这就断除身见和我见了。</p><p>整个观行过程就处于三昧状态中，色身骨肉的骨相和空相是自然而然出现的现量境界，不是意识凭空想象推理出来的非量境界。一切三昧都是由意根发起的，都是意根的现量智慧认知境界，都丝毫没有意识的比量和非量成分，意识在三昧中只能是被动的知，随意根而动而知，在三昧之前意识可以有主动的思惟观察作用，把意根引导上路以后，禅定就会越来越深入，最初的定境三昧就出现了，意识的作用力就越来越小，意根的观察思量作用就越来越大，当意根如实见法以后，智慧呈现出来，真正的定慧等持三昧就现前，这时就证果了。</p><p>没有禅定，意根就不能达到专注的面对色身和五阴，不能如实的思量和见法，不知色身五阴的真实相貌，智慧就不能出现。白骨观能生出禅定，由禅定引出智慧，最后就断我见证果了。最初看似不可能的白骨最后呈现在心中，这是定果色，见到定果色的白骨就知色身非我，定慧等持的三昧出现，法眼净证果了。</p><p>八、相续不断的观行是意根的功夫</p><p>白雪香的白骨观观行日志：刚开始学四念处观身不净的法义时，我就买了法医解剖视频，还有些西藏天葬的图片来作参照。在夜里安静的观看这些视频或图片的时候，意根能随着意识的眼见，生起肉体不是我的念头。当时本意是修观身不净，后来常常思维得出的结论是肉身非我、不是我、幻我、假我，是提线木偶。每次睡觉时思维身体不是我，醒来时思维肉身不是我。</p><p>就这样过了将近两年，一日午睡醒来（还没睁开眼睛），突然看到脚底的肉像沙子一样流开去，一直到膝盖这里的肉都流走了，我以为是做梦，就睁开眼，发觉自己是醒着的没有做梦，于是就再闭上眼，这时又看到身体的肉继续像沙子一样的流淌，直到看到剩下了整个头骨，但是骨头是黑的，不是白的。我分析了一下，看到黑色的骨头，大概是情关没过的原因（父母孩子亲人之类），于是我就在情关这个地方多思维破惑（最近有些弄明白了）。前段时间就是和大家共修四念住，单盘打坐，刚上座不久，看到腿骨这里的肉就裂开了。然后就看到浑身肉都一点点掉落了，有鲜红的丝丝缕缕的筋还挂着，没有落尽。</p><p>评：白雪香的观行功夫做到了连续不断，只有法义落在意根那里，功夫才能连续不断，白天能观行，晚上能观行，睡前能观行醒后能观行，睡着时也能观行，不管有梦没梦都能观行。没梦时意根单独观行，有梦时意根督促意识思惟观行，意识的功夫是断断续续的，不能连续不断。因为意根的观行功夫连续不断，时间长了对色身的认知就改变了，一旦改变，觉悟到了色身肉体非我，肉就会从骨头上掉落下来，骨肉分离。这是初步的三昧境界，离最终断我见的三昧境界还有一段距离，只要再圆满一些见道的因缘条件，见道就会很快了。</p><p>这是白骨观的观行实例，给大家做个修行样板，激励每个观行的人，只要努力精进不断观行下去，功夫就会不断增进，定会断我见，佛不我欺。就看个人的方方面面因缘条件了，主要还在于发心和福德，发大菩提心，有出离苦的心，勤修福德和戒定慧，观行功夫就会蒸蒸日上，最终就有成果出现。</p><p>九、灭苦的方法</p><p>问：这个白骨观、不净观的三十六物，如果在自己身上观，观到哪儿，哪儿就会放松。我感觉观到哪里，心对哪里的执取就会减淡，所以就会放松。是这样吧？</p><p>答：对，身体的紧绷状态，就是因为心里有执产生的，执取什么部位，什么部位就会绷紧僵硬，所以身体状态也是情绪导致的。去除情绪，心态放松，身体就放松了。观身体里三十六种不净物的时候，以客观的心态来观，观的时候就像观的不是自己身体，而是身体之外的物件一样，不执取身体，心空一些的时候身体就柔软了，心里越空身体越柔软。另外，禅定出现时，身体也会变得柔软。</p><p>修白骨观不净观能灭苦，如果观自己身上的三十六物，观到哪里，哪里就会放松。因为对于所观之物，执着减淡，心不执，就会放松。所以身体的问题终究还是心的问题，把心处理好了，心空了，很多问题就解决了。学佛人如果对日常生活随缘不刻意追求，不挑剔，不执取，日子过得就会很轻松自在，怎么样都行，无所谓，万事随缘了，一心在道，还有什么苦受可说？为什么得道的人无论生活怎么样，心都无苦？就是因为知五蕴世间为空，不执取，随缘用，有就用，无也无所谓。                                         </p><p>身心所感觉到的苦受，都是因为意根的执取而产生的，如果不执，就没有苦受。心里的结缚，也都是因为执取所产生的，结缚就是绳索，有结缚就滞碍不通。没有执取的时候，心境空旷通达，上天入地，随我意愿。当感觉到苦受的时候，就要想一想，自己曾经和现在都执取了什么，才出现这样的苦受？一切苦都有因，找出因，解决问题的根本因，才有办法灭掉苦果。</p><p>十、戒定慧齐修的实例</p><p>耀灵的止观日志：前两天放假外出活动，走亲戚，每天都尽量提起白骨观，观想一幅白骨的影像挂在心里，待人接物时都是心态淡淡的，符合礼仪就行了，少言寡语，少动情绪，减少很多烦恼，过后也不挂念。白天不染太多烦恼，晚上打坐一闭眼，发现自己的心并没有太乱，身心并没有绷得很紧，于是观呼吸和念佛都容易进入状态。若白天心里起太多执念，就像水凝成了冰，晚上打坐要把冰化成水，又要废很多功夫。</p><p>“观身不净”为因，“无我相、无人相、无众生相”不就是果吗？《金刚经》这里不就是讲“观身不净”吗？既然无人我相，那么贪嗔痴就没有根本，对谁起贪嗔痴慢呢？心就容易保持平淡安定。《楞伽经》里说这种不净观、白骨观是“愚夫所行禅”，我不就是愚夫吗，应该多提起这种正念。</p><p>评：这种修行是把戒定慧完美的融合在一起了，效果非常好，定慧都很明显。戒的表现就是心不起念，不起烦恼，待人接物合于礼仪，心态淡泊平和。定的表现就是心态淡，心不乱，观呼吸和念佛能很快进入状态。慧的表现一是能很快进入观行状态，二是能用金刚经和楞伽经中的理来对照熏习，降伏自己，能很快提升禅定功夫。做到以慧引定，以定生慧，定慧圆融。这样的修行就进入正轨了，戒定慧再进一步增强以后，断我见就有了眉目。</p><p>有很多人修行不能持戒，对境心数起，心所起的烦恼，有好多都不是别人加之于身的，而是自己无端起烦恼，在空的境界上见法实有，而生起执念，人我是非不断，却不自觉知，甚至别人提醒他，不但不服气，还生嫌恶，有怨言，这离修行还差很远，我性太重。这样不持戒的结果，就是禅定无论怎样都修不好，导致在世俗法和佛法中都没有智慧，所以烦恼是智慧的天敌。</p><p>十一、为什么观想时，亲眼所见比凭空想象更容易观想出来？</p><p>亲眼所见的，有五识和五俱意识的现量见，也有意根的现量见，由于意识见过，能促使意识容易回忆得出来。不是亲眼所见的，意识和意根都没有经历过，没有现量认知，全凭意识的非量想象，意根也使不上力，所以观想比较困难。从前修习白骨观的人，由于没有实体白骨可参考，全靠定力观想，如今有很多白骨模型可以现前观察，作为参考，只要想办法买来模型，天天细致观察，做到日思夜想，深入观行，修白骨观现前观行就容易一些了。</p></div>"
},{
    "title": "第四章 观行中的问题",
    "author": "生如法师",
    "date": "2022年01月11日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  观行中的问题</strong></p><p>一、如何消除修行中出现的业障</p><p>每个人的业障都有很多，修到一定时候，业障就会出来挡路，这是精进修行阶段所渐渐显现出来的遮障。障缘出现的时候，修行必然困难，就会出现懈怠的现象。修行的过程就是进进退退的，有时候精进有时候懈怠，业障出现以后，就会出现烦躁的情绪，这时候不能专心，精进不了了，就会懈怠下来，这时候就需要消业了。</p><p>如何消业呢？一是要在佛前忏悔无始劫以来的罪业，按照早晚课本上的忏悔文忏悔就可以了，今世的罪业在佛前发露出来，发誓永不再造，业种就能消除一部分，修行的遮障就少了；二是读诵地藏经回向无始劫以来的冤亲债主和家亲眷属；三是加大力度的念诵楞严咒来消除业障，坚固道心，加速修行。</p><p>咒的作用是很大的，光靠自己的力量想修行有成就很难，必须依靠诸佛菩萨和护法神的力量加持，来给我们遮挡一部分业障，不被干扰，排除一些业障后，才能一直精进下去，最后才能有所成就。所以在见道之前，念诵楞严咒一定不要间断，给自己规定一定的数量，天天坚持，咒力的加持力很大，习惯了以后就会有意想不到的的效果，自己在不知不觉当中就改变了。</p><p>二、如何对治打坐观行中的无聊感觉     </p><p>如果坐中观行觉得无聊没有意义，就是意根的习气现前了，意根贪着世间法，喜欢活泼泼的五蕴活动，喜欢世间法，喜欢热闹，喜欢有所得，不喜欢寂静无为，不喜欢被束缚。这时候就要重新思考观行四念处的益处，思考修行的目的，看看四念处经结尾处所讲的修行的殊胜成果，就会消除一些消极情绪。意根的习气难降伏，要像对待孩子一样的对待祂，恩威并用。平时要多思惟世间的无常苦，要忏悔无始劫以来的业障和烦恼，要发大心长远心出离心，依靠愿力的牵引，不断增进道业。</p><p>观呼吸的益处是什么？在世间法上的利益是能增进身体健康，能使心地清净，能使寿命延长，能使身心舒适自在，心情愉悦和快乐，能使心意柔软，降伏烦恼，提高修养品德，也能提高思惟力，心思细密，增长智慧。人的生命只在呼吸间，有呼有吸才有生命，无呼无吸，生命戛然而止。呼吸代表生命，观行呼吸就能观行到每个生命有多么的脆弱，多么的不可靠，多么的无常，多么的苦，依靠呼吸而存在的五阴能是我吗？这样在定中起观，观来观去，我见就轻微了，我执就减弱了，烦恼就降低了，就有可能断我见，分证解脱果。</p><p>三、如何处理观行时意识的觉受</p><p>观行四念处最初以观呼吸为主，其他的暂时先不用管，不要分散注意力，精力只集中在呼吸上。如果身体出现了疼痛和麻痒等等觉受，也不要在意，要始终缘于呼吸上，不跑离主题。如果实在忍不住疼痛等等觉受，影响观行，就要调理一下身体，让身体舒服一些，再继续集中精力观行四念处。如果身体出现轻安舒适愉悦、身体高大和空无等等觉受，也不要理睬和贪着，继续把心念缘于呼吸上，观行呼吸，其他的都不要理睬。</p><p>只有一心观下去，越来越专注，越来越清明，知的越来越深透，意根才会越来越明了，最后才能真实的感知到呼吸和色身的生住异灭，才能感知到身空我空，这才是智慧的知，这样知了以后，身心俱变，不再是从前的无明愚痴人。</p><p>四、如何面对修行中遇到的痛苦</p><p>当感觉痛苦时，要仔细观察痛苦的本质属性，观察时间长了，也就没有痛苦了。生命里出现的每件事，我们都觉得很特别，等到把这些事情观察久了，就会觉得也没什么，什么事都不算事。观察五阴十八界也是这样，观察久了，就知道五阴十八界没有什么，都是空的无我的，怎么追求都是一场空，欢喜也是空，痛苦也是空，不如随它去，不执不取，于是断我见，减轻我执烦恼，不再痛苦。</p><p>五、为什么打坐后在生活中变得呆滞和缓慢  </p><p>禅定一方面能使心识活动缓慢，消除一些浮躁气，不重要的事就不会用心了，更不会趋炎附势，禅定另一方面能使心识集中，思惟深细，反应也灵敏。最初语言和动作显得笨拙，行动力弱，但观察力深透，心细敏捷，看人看事会比从前精准细致，大事不容易被骗，有点大智若愚，实则心不用在世俗法上，般若智慧在慢慢提升。</p><p>六、打坐时为什么感觉头疼欲裂</p><p>这是气脉运行到头部，头部气血有些堵塞，冲不开头部出现的反应。可以稍微深呼吸，同时心里默默念佛，观想金色佛光照耀着头部，排除病障气，让气血运行通畅，这个头部进入了金黄色的佛光，黑灰色的业障气都消散了，然后仔细感觉头脑的清凉。头部清凉以后，再深呼吸几次，安定了以后，先在定中，非常稳定了再观呼吸。</p><p>七、打坐时口中干燥怎么办</p><p>口中没有津液，上焦和下焦不通，水火不相济，可以按照太极八卦图观想，火从前胸右侧降至丹田，水从丹田左侧上升至前胸以及喉咙处，来回循环，水火就会相济了，口中津液就会多起来，然后吞咽下去，滋润身体肺腑。观想很有用，定力越好观想效果越好，观想几乎能解决一切问题，就在于会不会善巧地、如理作意地观想，和禅定力如何，也在于福德和德行如何。</p><p>八、观行中怎样对治散乱</p><p>如果心还没有止息下来，定力不足，观就没有多少效果，这时候应当少观法或者不观法，如果观的法多了，心更容易散乱，致使禅定止步不前。观行止观要掌握好分寸，随着定力的增强，观行才能越来越深入，观的内容才可以越来越多。如果发现心散乱了，就应当减少所缘境，专注一个内容，或者只修止，不要观。如果心不散乱，越来越集中，就可以更深入的观行，越来越细致的观行。凝住一个点不动，直到定力非常深，以此经验，再增加一个点，逐步增加和扩大所缘境。这样定慧是齐等深入增长的。</p><p>九、打坐中为什么会出现气机发动的现象</p><p>打坐中所缘的法少，心容易空，禅定生起的快，而活动中所缘的法多，禅定不容易生起和保持，气机也不容易发动起来。只有打坐中禅定非常牢固了，气机发动持久了，在活动当中由于惯性作用，禅定才会出现，气机也可能出现。打坐中禅定不牢固，活动中就不容易出现禅定，更不容易有气机发动的现象，身体气脉非常不容易打通，心也不容易空。</p><p>心越空对身体越没有障碍，气机越容易发动，而且发动的越快越长，入定越深。有性障遮障的人，不容易发动气机，发起来也会很快掉下去。将来生起初禅定也是有类似的气机发动现象，心越空性障越轻，气机发动的越快越深入，越能遍及全身，越能持续长久，禅定越深入持久。所谓的性障，就是心有贪嗔痴烦恼和执念，执身执我，心里念着的法多，攀缘不断，世间法都执以为实，不肯放舍。</p><p>十、打坐自然呼吸时谁在控制身体</p><p>自然呼吸时没有意根主导，更没有意识主导，不自然的呼吸是意识和意根控制的，自主呼吸是意识控制引领的。身体本身的生命活动，有很多法都是如来藏一手操作，有时候意根会去控制，有时候意识会去控制，当然意识控制其实是影响了意根，让意根去控制的。自然的运作，我们感觉不到的，就不一定有意根参与。</p><p>十一、修行要注意养成好的习惯</p><p>在固定的时间和处所打坐，时间长就养成了习惯，有了习惯，就不怕周围环境嘈杂干扰，打坐时心都能放空，能制心一处的观行思惟。习惯是意根的惯性，意根比较执著，经常做的事情，就不用思惟的按照惯例去做了。习惯有不好的一面，也有好的一面，要好好利用习惯修习佛法，养成好的修行习惯，则事半功倍。</p><p>花一定的时间精力，去培养一些修行的好习惯是非常值得的，就像为了批量生产，要花费时间精力成本制造一些模具，这个时候是费心血和时间的，而一旦模具打造好了，以后再生产产品就节省极多的时间和成本，所谓事半功倍，至少是节省四倍到无数倍时间和成本，这是非常值得的。在培养修行习惯的阶段，是很辛苦的，成成败败，进进退退，不容易坚持下去，这时候就需要旁边有人督促和监督，能结伴互相督促就好办一些。需要培养修行的好习惯都有哪些呢？</p><p>十二、呼吸比较浅妄念较多怎么办</p><p>如果呼吸不调和，妄念多，就做深呼吸，把气息尽量引到丹田处，气息长了，身体就调理好了，妄念就减少。在做深呼吸的时候，气要徐徐吸足，肚子渐渐鼓起来，气吸满要停顿一会，然后再往外呼，呼净了之后，肚子是瘪的，再停顿一会，之后再呼出去，这样一呼一吸之间就会把气息拉长了。这样主动引导呼吸，做几次就行了，以后就能够正常自然的呼吸。</p><p>深呼吸时气息会通过各个脏器，排除淤堵，顺便打通任脉，这样即使不再深呼吸，气息也会渐渐变长，到达丹田处，妄念随之减少，深呼吸方法对治妄念比较有效。</p><p>也可以用深呼吸念佛方法调和气息，对治烦恼和妄念。在深呼吸的时候念佛，气吸满停顿一会以后，在呼气的时候用鼻音或者后堂音，慢慢的念阿弥两个字，音流震动越大越好，这样会把五脏六腑打开，再次吸气呼气的时候，呼气时念陀佛两个字，这样念几次就把呼吸调好了。心念专注在呼吸和念佛上，定力就能够逐渐增加了，这个方法每次打坐开始的时候都可以用。当空气比较清新时，可以做一做深呼吸，丹田气就能发起，气息长，身体健康，妄念少，腹式呼吸自然成就。</p></div>"
},{
    "title": "第五章 观行问答",
    "author": "生如法师",
    "date": "2022年01月11日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  观行问答</strong></p><p>一、问：身体脉轮图是否存在？<br/></p><p>答：身体是有脉轮的，脉轮是身体各经络汇聚的主要之处，气脉通过这些脉轮的感受我都体验过，气脉最初经过身体任何一个部位，都有相应的反应，身体越不好，堵塞越严重，经过脉轮之处感应越强烈，那些堵塞的地方越难越过去，流传的脉轮图算是正确的。</p><p>我们修行别管哪个宗派，也不用管是不是外道法，如果对我们有用，不必排斥，他宗他派并非一无所是，取长补短还是有不少好处的。我们的身体和外道的身体构造是一样的，那么在修身阶段，出现的现象是差不多的，即使你不是主动想修身，而是修心，但是打坐修行就涉及到了身体的问题，这是躲不过去的，那么对修身有用的方法就应该了解一些，以便心中有数，懂得如何应对。</p><p>由于我们的身体和外道的身体和任何一个宗派人的身体都是一样，结构一样，脉轮一样，气脉运行的方式、通道都是一样，那就不要排斥外道法，了解一下就知道自己现在的色身是什么状况，遇到问题就不至于惊讶和手足无措了。外道以修身为主，我们以修心为主。我们修心就离不开修身，我们了解那些身体气脉的知识和对治方法，以解决好自身问题。其他的都不必在意。</p><p>二、问：之前是主动呼吸，昨天开始自然呼吸，呼吸却变短了，这是为什么？</p><p>答：呼吸变长变短都不用管，只要心专注于呼吸了，禅定和观行都会相续增长，如果气脉通了，呼吸自然会深细绵长。只要有禅定一切都好办，身体情况都能改变。观呼吸是一心观行呼吸的状况，别的都不要去考虑，不要去想别的事情，弄明白自己呼吸状况就好了。经文里有观行步骤，第一步没有做好，就不要做第二步，不要往下进行。一个时间段只观行一种法，不能多，多了就会心乱，定力到一定程度的时候，再逐渐增加观行的内容，就不至于心乱了。观行时，除了观呼吸，其他的对法的理解和感想什么的都没有用，心里不用想太多，以免干扰观呼吸。</p><p>三、问：这段时间开始在平时的生活中，也能专注于呼吸了，有时走在路上，一边走一边专注于呼吸，内心开始无来由的生起喜悦之情。我在三年前也有过这种感受，当时打完坐后，感觉每个细胞都是愉悦的，别人怎么骂我都是可以接受的，但只持续了一个多月，后来就再也没有这种感觉了，直到最近，这种感觉又出现了。为什么会有喜悦的现象？</p><p>答：禅定的功德之一，就是能使心生喜悦，内心愉悦。心念专一，能够改变四大，身体健康轻盈轻安舒适，所以心就受影响，生起喜悦，精神愉快，没有烦恼。心喜是三十七道品之一的喜觉支，在喜觉支之后会生起猗觉支，身心轻安，在猗觉支之后会生起定觉支，身体轻安之后，禅定觉知就会出现了，定觉支之后会出现舍觉支。喜觉支能降伏烦恼，减轻烦恼。</p><p>人在高兴快乐的时候，对人就和善不嗔恼了，宽容大度了，性情改变了。心喜才能善，是福报生出的善。所以三十七道品的大小乘修行的必经之路，不修三十七道品，心地就不能改变，烦恼不能断除，就不能证果和明心，为什么说心专注以后感觉全身每个细胞都是喜悦的？因为四大的改变，是从细胞最基本的粒子先改变，细胞的四大改变了，心就会感觉舒服愉悦喜悦。</p><p>四、问：最近两次坐禅观空，身体的压迫感非常强烈，无法动弹，几乎失去控制。而且今天的气阻在双臂，现在两个前臂酸麻不止，跟干了重活一样。是否需要调整？</p><p>答：胳膊酸麻肿胀，是有堵塞的地方，气血不容易通过去。不打坐的时候，气运行的不好，不会感觉什么，气足了以后，遇到堵塞之处，就会有反应，病障就出现了，打通以后，病障就会消失。身体有压迫感，不能动，说明气足，气越足越容易打通身体和双臂，能坚持则坚持，估计很快就能把胳膊脉络打通了。知道打坐当中身体出现的任何现象都是气脉问题，气血运行问题，身体再有任何现象都不用忧虑，慢慢调理，都会好的，不要太在意这些事了。</p><p>五、问：打坐时如果气机持续发动，一直在头部不过去会怎样？</p><p>答：气脉一直在头部，那是发起的气足有力量，同时头部有阻碍，气机还不能过去，如果没有阻碍气脉畅通，就没有气机之说了。这时候能坚持则坚持，坚持不住的时候就观想气从头顶百会穴出去，或者下座拍打头部让气散开。但散开以后还会冲击头部，彻底打通才能解决问题。头部不完全打通，气机也会过去或者消散，然后会循环到前边任脉，从任脉再到督脉，再到头顶。直到进入中脉，从头顶出去，全身气脉就彻底打通，身体就再也没有障碍了，从此以后禅定的修行就会畅通无阻。</p><p>头部气脉能打通，气血循环的好，思惟会非常清晰，精力充沛，能开智慧，能打通一部分也是相当好的。气脉打通，心清净，身体就会出香气，非常香，心情很愉快，快乐无忧。这些都是生灭法，不用执著，现在禅定已经生起来了，能够观行就行了，不要太在意气脉的事情，随它去。</p><p>六、问：我平时打坐就是心缘一个点上，再增加一个所缘点，是心同时缘在两个点上吗？</p><p>答：增加所缘点的意思是说，在一开始定力不够强的时候，只观察鼻孔气息流动现象就可以了，待定力增强了以后，再随着气的运行，一直观下去，观察气入气管、胸腔和丹田等等部位的情况。如果定力增强了，可以把这个观行的通道拉长一点，注意力随气息走。如果定力再增强，你就随顺着气的运行而观察，同时身体各部位情况都要观察和了知，气息散开的时候也是这样观行。这是渐进式的观行，视定力强弱而定。如果定力不足，就只观鼻腔内的气息就可以了，应该随着自己定力的强弱来加减观行所缘的对象。</p><p>七、问：昨晚单盘打坐，持诵心经后心静下来，开始观呼吸，慢慢进入似睡非睡状态。大约30分钟后身体感到舒适，轻飘飘的，慢慢开始身体振动而且越来越大……我控制不住了自己了，没有呼吸了，身体在摇晃，眼睛挣不开，心跳声加快要咽气了……心里知道但控制不住自己了……很恐惧，感觉自己要死了，说不出喊不出动不了，好不容易摔倒下来，过了很久才恢复平静。这是怎么回事？</p><p> 答：最初修定的时候，心静以后，气脉运行的好，有可能会有气机发动的现象，这是打通全身脉络的好现象，能很好的调理身体。如果身体条件很不好，就不要一下子入定，要慢慢来，一点点的调理身体，免得很突然适应不了。</p><p>开始入定出定会不由自主，身体都被气机控制着，不太听自己调动，时间长了就会缓和许多，由自己控制说了算了。当身体气机发动的时候，只管放心，什么也不用管，心越空越好，越没事，只管放空自己，舍得空，敢于空，空了就没事了。</p><p>八、问：在打坐中出现的各种境况，比如看到佛像等等，应如何对待？</p><p>答：一切境界都是虚妄的，在打坐中不管出现什么现象，都不要理会，来者不迎，去者不送，见到佛像既不要欢喜也不要害怕，见到有人来杀你也不用理会，无佛无魔，都是幻像而已，只观呼吸就行了。如果着境，把境界当真，就容易出偏，甚至入魔境，不好处理。</p><p>九、问：我随着呼吸出入，意识在呼吸上，怎么才能观行头部呢？</p><p>答：观呼吸时，观的对象始终是呼吸，没必要观头部。所缘点要专一持久，定慧才能同时相续生起，否则就会散乱，不生起观慧，与不观无别。观行就是观察事实，有什么就观察什么，如实知什么，没有的不用想象，要尊重事实，在现量的法上才能生起现量智慧，想象出来的都不是，观行先锻炼注意力集中而已，并不难。</p><p>十、问：我现在双盘一个半小时到两个小时，采用腹式呼吸，自然呼吸不用意念引导，气息微弱容易昏沉，很难止息入定。弟子在观呼吸时，吸气尽量慢长，可否憋气尽可能长，后再呼出？用腹式呼吸或者胸腔呼吸是否都可以？</p><p>答：两种呼吸方法都可以用，最初修习的时候，如果修习的方法对身体有好处，就容易入定。但是如果修习时间长了，想要入定并且起观行的时候，刻意憋气，就不会有深禅定了，也无法观行思惟。只有练习非常熟练了以后，不用再憋气了，才能观行。</p><p>十一、问：今天大概坐到四十分钟左右的时候，从腿部到腰部的位置一阵一阵的出现震动颤抖的状况，一直维持到下坐的时候，震动的过程中有一点舒服的感觉，以前从没出现过这种情况，这是怎么回事？</p><p>答：这是由于心安静下来以后，身体里的气脉运行顺利了，气机发动起来的现象。气机最初往往都是从丹田处发起，于丹田向全身运行，运行的速度和路径因人而异，因时而异，因身体状况而异。欲界定和色界初禅定的引发，都离不开身体气机的发动，就是说禅定离不开色身的运转活动，只有色身没有障碍了，才能发起欲界定和色界定。</p><p>将来色界的初禅定发起来的时候，同样也是身体里的气脉运运而动，那股力量不是人为的意念发起的，是身心静到一定程度时自然生起来的，只有性障烦恼和念头生起来的时候，障碍就出现了，身体里的气机才会退下去，初禅就随之消失了。因此初禅定不能离开盘腿打坐，大多数都是在打坐的时候发起的，活动中禅定持续的时间短，而且不容易保持。</p><p>既然修定离不开身，那就离不开盘腿打坐。盘腿打坐是修定的基础，后续的深定更离不开盘腿打坐，因为盘腿能让气血集中和顺利运行，身心都安稳，得定就快而稳固，再以坐中的禅定为基础，在色身的活动中才能生起禅定和保持禅定。如果不盘腿打坐，单单靠活动中修定，一是禅定不容易生起，二是生起以后不容易保持，三是不会有深禅定，四是观行不容易。</p><p>有人说修道不在腿，此言差矣，如果腿降伏不了，身就降伏不了，身降伏不了，心不可能真正而长久的安静下来，禅定就不容易出现，也不能保持长久，也不能深入。历代祖师和禅定学人的修行都证明了这点，诸佛菩萨和阿罗汉辟支佛们的修行过程都证明了这点。</p><p>十二、问：气血虚的人打坐会使气血更虚，还是会变好？</p><p>答：打坐本身有调理气血，改善身体素质的作用，如果身体里有病，打坐会使气脉有规律的运行，气血活络，身体里疾病就会从身体表面往外排，看着好像是病更严重了，实则是里面的病排到外面来了，病的症状就比较明显。打坐时间长了，身体所有疾病都会好转，身体素质得到提高。</p><p>十三、问：站在路边等人时，用心专注一念，若合掌时，10到15分钟后会感觉身空，呼吸微细绵长，心安逸；若垂手站立时，会感觉身体被某种力量夹住动弹不得，尤其是双臂被定住，渐渐无法感知。若有活动以后，则心就会失念，提念之后头部会有刺痛感。这种不稳定的状态是不是有什么问题？是因为打坐禅定的功夫不够，身体出现了状况？</p><p>答：这是初步的比较好的禅定状态，刚开始修出禅定时，身体在禅定中不容易自在活动，感觉很僵硬，不能动转，如果强行动转，不是心理难受，就是身体某部分难受。多次修习禅定以后，就会适应禅定，身体就能自在多了，想活动就能活动，不受束缚。要想身心都能自在的出入禅定，需要不断的修习禅定，熟练就好了。静止的禅定容易修也容易保持住，动态的禅定不容易修，有也不容易保持，只有静止的禅定深了以后，才能保持一些动态的禅定。</p><p>十四、问：提念观行的时候，心里始终有所缘，只缘在呼吸上，可是气的流动是中断的，况且气流动的路线也不明显，且速度很快，也看不清楚气流的形象，一刹那就过去了，这应该如何处理？</p><p>答：心念缘于呼吸，开始的时候会出现不自觉的屏息现象，屏息的时候就感觉气息不流动中断了似的。当禅定还不足的时候，心还是有点粗糙，观察不了更多更细腻的法和现象，气运行到哪里就不知道了，也容易失念，跟不上气流运行的速度。这时候就需要继续加深禅定和观行力，不要着急，不能急于求成，有急迫的心就会心乱，会阻碍禅定的生起，禅定的功夫需要慢慢具足和增长，量变才能质变，禅定到一定程度心就会细致一些，观察的法也会深细了。</p><p>十五、问：打坐的时候脑神经好像被弹了一下有震感，是怎么回事？</p><p>答：这是气脉运行到大脑这里，在通脑部的气血，那地方有淤堵，气通过的时候就会有震动的感觉，气运行的越强感觉越明显，疏通的效果越好。身体其它部位也是这样，感觉越明显，堵塞的越严重，气脉运行的越强劲有力。</p><p>十六、问：房间里的灰尘很多，平时看不到，等到阳光照射到房间里，才能看到灰尘。打坐也一样，平时意识不到自己妄念多，打坐心静下来的时候才意识到了，就像照进房间的的一缕阳光。为什么打坐的时候能观察到自己的妄念多？</p><p>答：每个人平时的妄念都很多，大大小小细细碎碎的数不清，来了去去了来，停不住，因为心念不集中，或者心不够清净，就观察不到这些念头的生生灭灭。心念清净，有定力，念头集中的时候，就会发觉到自己心里的念头很多，就像阳光照进了房间一样，心静发光有智慧，能照见妄念和烦恼。所以禅定是个好东西，能集中精力，能让我们有反观力，能让心细致，从而发现平时发现不了的问题，发现问题就会有解决问题的办法，从而有了智慧。</p><p>每个人平时烦恼也非常多，因为习以为常了就感觉不到烦恼，等空闲下来，有精力反反复复观察自己，才发现自己内心都是烦恼。知道自己有烦恼就好办了，早晚有一天会生起惭愧心，心力足的时候就能降伏这些烦恼了。不知自己的烦恼，不代表自己没有烦恼，而是因为自己心还是非常散乱，无心安静下来去反观自心，内心还没有觉悟的时候，也不愿意发现和承认自己有烦恼。</p><p>十七、问：打坐后为什么会感觉身体像是掉了几斤肉一样轻？</p><p>答：这是身体里气脉运行的通畅，致使身体里的四大元素改变了，气是往上飘的，气足时促使身体上升，就会感觉身体很轻，不沉重了，走起路来轻飘飘，走路轻快无声，显得意气风发，精神抖擞，自然就有了威仪。另外气血畅通了，就会把身体里多余的废物和水份排出体外，致使身体瘦下来，变得轻松舒适。</p><p>十八、问：感觉身体特别懒，不想活动怎么办？</p><p>答：身体懒不愿意活动，是因为身体里有寒湿气压着，身体四大种子构成的微粒中水大多火大少，身体就会有沉重感，无力活动，早晨醒了起不来，想办法排除寒湿气就好了。另外气血不通，身体会感觉沉重，所以就懒，不愿意活动。多打坐疏通气血，排除寒湿气就好了。</p><p>十九、问：最近腿抽筋了，打坐时会不会引起脚踝关节炎呢？</p><p>答：打坐不是生病的原因，而是寻找隐藏病症的方法，身体某些部位本来就有病，只是还没有显发出来，打坐中气脉运行到有病症部位被阻碍过不去了，隐藏的疾病就显发出来了。关节炎和腿抽筋都是打坐中出现的暂时现象，气脉通过以后，腿脚等等有病的地方就能痊愈了。但如果病症比较严重，就要用药治疗，以期早日攻克疾病，不要强忍。</p><p>二十、问：之前按照师父教的深呼吸方法，用腹式深呼吸时，先吸气满后再憋气，然后呼气，停顿一会后再如此反复练习，以上是主动呼吸。昨天主动呼吸了一会后，开始观察呼吸自然出入鼻腔，感觉呼吸越来越轻缓细微，不再深长，这样正确吗？</p><p>答：最初观呼吸时，如果呼吸比较短有障碍，就要运用主动深呼吸方法调呼吸，待把呼吸调匀以后，心念清净，身心轻安了，再进行自然呼吸。这样就能进入正常观呼吸模式，色身没有障碍。自然呼吸时心很静了，就感觉呼吸轻微，好像没有呼吸了似的。呼吸不那么深和长，是因为功夫还不到，身心还不够清静，功夫纯熟就好了。</p><p>二十一、问：今天下午上座，气机很快发动起来，感觉身体轻漂漂，仿佛与虚空融合，无内无外，身体、眼睛、胸部等地方好像都会呼吸，是敞开式的呼吸，人在空中漂浮。心里一个念头我就回了老家，有一个力量在推着我，我向后飞退，心里起个念头感觉自己就死了。但我也不管他，死了不管他（心里是想交给第七识处理），后来不后退了，见月光明亮，普照大地，还是不管他，最后下座，身体始终是飘飘然。</p><p>答：身体的这些感觉状态都是禅定的境界，心静以后，身体的四大自然会发生变化，身体就会感觉轻安，好像是在空中飘浮一样，色身变化又促使心起变化。心在境界里转，那是一种定境，是心空以后才出现的状况，不理它就对了。入定境的时间不要太长，以定中观行为主，以观行为主线。</p><p>二十二、问：我观行观到身体大部分感觉不存在了，呼吸也很微弱，再继续观行，身体和呼吸都感觉不到，进入一片漆黑中，这时候该怎么继续观行？</p><p>答：你这是入到定境里了，意识变得微弱，不能观呼吸了。如果还想继续观行，就要把心从定境里拉出来，拉回到呼吸上来，心还是要缘着呼吸，观察呼吸的状况，不管呼吸有多弱，都要坚持观下去，由观粗的呼吸到观胎息，不要入到定境里去，定慧等持才能断我见证果，偏定只对修身有益，但不是学佛修行的目标。   </p><p> 二十三、问：观呼吸时意识一边观一边监测其他妄念，这样修对吗？</p><p>答：这是意识追逐念头被念所转了，念本虚妄，留也留不住，监督妄念是在作无用功，没有必要去理会妄念，随它自生自灭，把心用在刀刃上，做有用功。如果意识不去监测其他的妄念，只专注于呼吸上，试一试是否禅定进步更快？</p><p>二十四、问：昨日观呼吸，呼气的时候感觉气息很长，好像到了海底轮那个地方了，这正常吗？</p><p>答：这是正常现象，是气息经过丹田到达海底轮了，气脉运行得比较好，说明心是清静的，身体没有阻碍。气息会在全身各处散发出去，也会从全身各处渗透进来，身体表面的毛细孔都能进出气息。不仅是气息，身体里的物质，和周围环境中的物质，四大都是互相交流，互相影响，互相熏染的，这就是所说的磁场，是双向的磁场。所以每个人要对周围环境负责任，要散发正向的能量，正能量。同时也要避开负面能量和不好的磁场，才能正气满满。</p><p>二十五、问：打坐中肚子里有气胀感，还排不出来也化不了，怎么办？</p><p>答：打坐能调理身体，身体里的垃圾废物毒物会通过废气的方式排出去，如果感觉要排气而排不出来，那是因为身体里还有堵塞之处，可能有些湿气阻塞，吃些热量大的饮食或喝热水姜水，把身体加热驱寒，废气胀气就能排出去了。</p><p>二十六、问：打坐时只是观察呼吸，尽量不参与去引导呼吸，突然有一丝丝发现，这个呼吸系统跟自动化机械一样，稍微感觉到像块死肉 ，这是什么现象？</p><p>答：这就是修道的进功，是修道的初步效果，定中观行要的就是这个效果，以后还会有更多的新发现，由这种量变累积到一定程度就会到达质变，质变就是生起智慧的观照，会逐渐发现五阴身都是像自动化机械一样虚假幻化，不由自主，都是无常无我的，最后就能断我见了。所以观行只是单纯的观，现量的观，不要加进去意识的主张和想法，慢慢就会发现无始劫以来所没有发现的事实和真理。发现真理，只需要你留心观察，只需要专注于所观的法上，日久功深，就会水到渠成，法里所含藏的事实就显露出来了。</p><p>二十七、问：观呼吸的后半段时间觉得脊椎被拉得紧紧的，有时百会穴有气流感，这是怎么回事？</p><p>答：这是由于心静下来以后，对气息的运行没有阻碍了，气息运行顺畅了，气脉从丹田到尾闾穴，又从尾闾穴上冲到后背的督脉运行，把后背拉直了，甚至气脉会上冲到头部，冲击百会穴，最后从百会穴出到体外。这说明身体的任脉和督脉是通顺的，身体比较健康，心也能静下来 ，禅定比较好，这样有利于四念处观行。</p><p>二十八、问：缘于呼吸，保持离言状态；或者去观想气息入到鼻、五脏六腹、丹田等处，两种观行方法各自有什么利弊？</p><p>答：第一种符合四念处修行的规则，容易生起禅定。第二种方法心念动得比较多，容易心乱，初学定浅慧力弱者使不上力，观想就会不得力，心容易散动，不容易增长禅定。定深观慧强者越修定越深慧越强。第二种佛法虽然能引导气运行，但如果引导不好身体容易出问题，最安全的方法是随顺气息自然运行，不用管气运行得，有经验者可以为之。观行开始入手时尽量不要用意识引导气息，只做观察就行了，观察呼吸的运行和变化过程，整个过程观察的越细微越好，容易生出禅定和智慧。</p><p>二十九、为什么禅定中的观行能出生智慧得解脱？</p><p>问：观如何能生慧？比如观呼吸，初期只能观呼吸的动态行迹，只能增强其观注力，也产生不了智慧，只有极度深入禅定粗状呼吸停止后，才证得呼吸是无常法，可谁都知道人的呼吸是终将要停止的，是无常法。又比如白骨观，我们不用坐禅去观，可谁都明白人总有一天，人的尸骨将化为尘埃，归於虚空。我不明白的是这谁都明白的道理为何要去观呢？又从中得到什么智慧呢？  </p><p>答：意识什么都明白，这些明白又有什么用？意识明白不应该有贪嗔痴烦恼，造作烦恼业行会有恶报，可是意识这样的明了又有什么用？意识也明白怎么才能成佛，这样的明白又有什么用？每个人所有意识的明白，最终解决了什么问题？都知道众生死了生生了死，色身抓不住不可靠，可还不是照样贪执色身不放吗？ 所以说意识的种种明白都是假明白真糊涂，丝毫解决不了任何实质性的问题。</p><p>如果是能为身口意行作主的意根不明白，意根如何能不作主造作无贪嗔痴烦恼的清净业行？如何能作主选择正确如理的方向和目标修学佛法？意根不明白呼吸等五阴活动是生灭无常的，如何能证得五阴无我？意根不证得五阴无我，如何能作主造作无我的清净业行？没有清净业行如何能成佛？意识虽然明白人最终都是一具白骨，可意根不明白，祂就要执身，以身为我，让生死流转不停。</p><p>因此说不精勤的修习禅定，不精勤的观察呼吸，不精勤的修习白骨观，纵使意识再明白，也终究不能无我，不能作主得解脱。所有禅定的修习和观行功夫，都是在熏染意根，促使意根明白。意根一旦明白，就出现三昧的智慧境界，有此种智慧，才会心解脱，智慧解脱，智慧成佛。意根不明白就没有三昧智慧境界，那就不能得解脱。如果不想修定，不想精勤的观行，只满足于意识的知解，这与生死业障凡夫无异，业种不改变，命终仍然要随业种在生死轮回中受苦报，兑现因果法则。</p><p>三十、问：打坐坐到大约四十分钟时，两眼流泪，一直流到嘴边，以前一只眼流泪，这怎么办？</p><p>答：眼睛与肝息息相关，眼睛流泪一是排肝病的现象，二是气脉通过后脑胜义根，把眼部的疾病排出来了，如果有眼屎，就是有肝火排出来了。可根据具体情况再加以对治，也可以不管，加强静坐，让气脉自然运行，排除一切病障。</p><p>三十一、问：坐中骨头关节链接处有冰融化的感觉，或是感觉融化后的冰水从一处慢慢流淌，说不清是清凉感还是什么，到是挺舒服的。这是什么情况呢？</p><p>答：这是气血通过关节处调理身体的自然反应，原来关节处或者有寒湿瘀堵，或者有废物堵塞，气血运行到那里，会带走一些寒湿气和废物，关节处就得到了疏通，所以感觉能舒服一些，同时还混杂了病气带来的不舒服。你这身体比较健康，病障不严重，严重的就会感觉疼痛，甚至不能盘腿了。</p><p>三十二、问：我在观呼吸过程中，整个色身感觉很粗壮，呼吸的状况却观不到了，但佛像会跳出来，能念佛号，这几天观呼吸已经出现两次此状况，下坐后感觉人很轻松，但却比以前很更怕冷了。这是怎么回事？</p><p>答：感觉身体粗壮高大，这是进入到欲界禅定中了，有欲界禅定就会出现欲界天人身，天人身就是高大粗壮轻灵舒适飘飘然的。进入定境中，会有境界像出现，比如有佛像出现，心清净感应到了佛。进入定境以后，由于关注了定里出现的境界，就观不到呼吸了。一切境界皆虚妄，不可贪执，否则就容易走偏，被境界所牵引，不知归路，即使是佛出现在定中，同样也是虚幻的，不能执著。     </p><p>古代文喜禅师做饭时见饭锅上方有文殊菩萨现身，拿着饭铲子就挥舞过去，想要撵走文殊菩萨，文殊菩萨就说：修行了三大阿僧祇劫，却被老僧嫌，这是称赞文喜禅师心空不着相。但是心不空没有悟道的人，千万不要这样做，心不空就有佛菩萨相，如果对佛菩萨不敬就有罪过。悟道的人心中无相，所撵的就是假相，没有不敬之过。</p><p>人在禅定中，意根不执身，浑身通畅，毛孔微开，冷空气就会进入身体当中，感觉冷。怕冷是因为禅定中气血通了，把毛孔冲开了，与虚空中的空气接触更密切了，就会感觉到寒冷。这时候要多穿点衣服，打坐时把腰腿都要盖好。气脉彻底通了，就不怕冷了。   </p><p>三十三、问：为什么我一静下来就感觉呼吸变短、变慢了？刚开始心不静的时候，呼吸感觉还比较长。静下来以后，让身体自己呼吸，观气息到不了丹田，可是如果控制呼吸，故意吸气比较长，又静不下来了。</p><p>答：心静下来时，就专注在呼吸上了，这时候可能有点不自主的控制了呼吸，或者比较在意呼吸，就感觉呼吸变短了变慢了，自在入定以后心静了，气息才会变长。自然呼吸气息短时，说明身体气脉运行还不通顺，打坐修定功夫不足，需要再加强打坐修定。</p><p>当没有定力或者定力很弱时，控制呼吸的时候，心念就有可能变得散乱，心不能静了。控制的呼吸，不是自然的呼吸，不是正常的呼吸状态，不控制的才是正常的呼吸状态。但是为了调整身体，让气脉顺畅运行，可以自主的比较专注的进行深呼吸训练，让气息打通五脏六腑，顺便也能加深禅定。</p><p>三十四、问：打坐观行时，气流经过鼻腔咽喉交界处就有摩擦声，随后嗓子就发炎，一直都不好怎么办？</p><p>答：那地方堵塞气血不通，就有炎症出现。用深呼吸念佛的方法调治，能打通鼻腔和咽喉的通道，也可以拍打和刮痧咽喉处。有时候意念过于集中，就会有火集聚此处不散，导致上火发炎，可换个地方观行，或者稍微来回流动着观行，不要特别集中用力。</p><p>三十五、问：弟子最近上座，都是很快就进入了状态，身体仿佛与虚空完全融为一体。我特意去感受一下，身体背部、肩、头等部位似乎感觉不到，腿、下丹田部位，特地去感受，若有若无。我体悟观呯吸，呼吸也是透明的，与虚空合。这样体悟对吗？</p><p>答：你这是禅定比较好的状态，进入了欲界定，色身有如欲界天人的色身。气息运行得好，身体素质也比较好，浑身通透，就没有了身体的粗重感觉。定中感觉不到身体就对了，身体本来就是空的，身体物质粗重时才有身体的感觉，越粗重感觉越明显，身体色法越细微，越没有感觉，这说明色法就是心的障碍，所以禅定中不用理会色身，也无需过分劳神觉受，或者分神在禅定中出现的身心感受感觉，回光反照，专注观行就好。呼吸不管与虚空合不合，都不是观行的方向和目标，观呼吸最后的结果是证得色身无我和五蕴无我，是断我见。</p><p>三十六、问：我现在腿关过不了，每次单盘到50分钟1个小时左右，就感觉精神进入到状态了，这时腿的踝关节、膝关节、胯关节都疼的受不了，坚持不了多久，只好放开，观行就受影响，有没有什么办法把这一关过去？</p><p>答：这是由于你身体的气在你的后臀部三角区，也就是八髎穴那里有堵住了，在胯骨附近都有淤堵，气血过不去。一般来说是寒湿气和废物堵塞，可以试着采取以下对治的方法：</p><p>1，晃海，双盘的时候做一做晃海动作，先正向晃，再反向晃，顺时针反向和逆时针反向都要做，一压一松，就能打开气血通道，排除淤堵。2，用针灸针淤堵的穴位，把堵塞的地方打通，再加上晃海，站桩这些方法配合。相对来说针灸是比较快的。3，按摩。在后腰部三角区和八髎穴那里，用艾精油药膏反复按摩。</p><p>4，在双腿膝盖后的委中穴部位，用一个不太硬的小棍点柔按摩，促进气血循环畅通。腰腿、胯骨这些地方都有淤堵，都要按摩，也可以用空拳敲腿，大腿内外侧的胆经肝经两条经络都要敲打按摩，气血就容易过去了。</p><p>5，适当艾灸关键穴位，驱散寒湿气，经络就会通畅了。</p><p>6，还有一个方法就是辟谷，让身体自行调节，寒湿淤堵都会消除，腰腿都会变得柔软，盘腿就不费劲了。建议过一段时间，温度不太热的时候，可以再次辟谷，调理身体，一年辟谷两三次，身体就会调养的非常好了。</p><p>三十七、问：打坐后能让生命更灿烂吗？</p><p>答：如果有一个让生命更灿烂的思想，这不就是很重的我见吗？有我的思想不就是生死苦吗？把五阴生命当作我，欣乐五阴身，爱着五阴身，想要延续五阴身，生起执取心，就不能断集和灭苦，生死苦恼会更重，与修行背道而驰。苦集灭道四圣谛应该好好学，先从观苦开始学，只有知苦了，才能发起修道心，才能入道。其实观呼吸上路以后，就能得出五阴炽盛之苦的结论了，有所造作都是苦。凡夫每个心念几乎都包含一个我，体现出一个我，不知道有我即苦。</p><p>三十八、问：观呼吸时是哪个识心在操纵呼吸？有几个识心在观呼吸？为什么观呼吸时，身体会发热出汗？发热出汗是哪个识心在控制？</p><p>答：自主呼吸中有意识和意根同时调控呼吸，一般情况下意识都不用调控呼吸。在四禅定中没有了呼吸现象，这说明因为禅定甚深，意根不再调控呼吸，呼吸就停止了，如果呼吸不涉及意根的话，那么呼吸状态应该永远都是一个样，不会发生变化。</p><p>观呼吸时是意识在观，有身识的觉知，所以就有五俱意识的觉知。如果精力集中，意根随同意识同时观，精力不集中时，意根只轻微的缘着，因为不专注，也不会有什么感觉和想法。观呼吸时意念随呼吸到丹田，丹田就会发暖，热量散发，也许会自动出汗。能把气运行到丹田这里，并且能有出汗现象，就说明是意根的念已经到达丹田这里了，气才随之到达丹田，意识单独是没有这个力量的。这些法是如来藏随缘变现的，因缘所生，不一定有哪个识在控制，如果有控制的心，心念将会分散，禅定就会变浅了。</p><p>有些法非常深奥难于观察，对我们目前修行阶段也没有什么用处，就不必非要去探求，集中精力做好当下有能力做的事，双鸟在林不如一鸟在手，能断我见才是真本事。</p><p> 三十九、问：修行精进以后，内心出现反转的现象是怎么回事？</p><p>答：当修行非常精进以后，业障就会现前，心都在修行上，而不是在世俗法上，与自己从前的习气背道而驰，意根受到很大的压制，跟不上修行的进度，感觉心里难受，不想修行，就会出现反转的现象，这是意根要反抗了，祂不想太精进，不想与从前的习惯差别太大，太违背自己的意愿。意识压制不住意根，所以行为上就会出现懈怠懒散的现象，或者心烦意燥。出现这种情况时，要留意观察自己的心理，查找背后真正的原因，对症下药，可以在心里再讲讲道理，思惟世间苦和修行的重要性；或者暂时先随顺意根，放松放松，不要把神经绷得太紧。</p><p>修行就像弹琴一样，琴弦不能总是绷紧，太紧了会断，身心跟不上修行的进度，就要稍微放松一下。与其让琴弦崩断了，好长时间恢复不过来，还不如暂时放松一些，弹琴要松紧适度，琴音才美妙。佛在经里讲过这个问题，所以我们要随时掌握自己的身心状况，看看自己能不能承受，承受不住的时候就缓一缓，精进是好现象，但是要掌握一个度。</p><p>四十、问：近几天打坐后期，大椎和脖颈发胀、僵硬，需不需要用小锤敲敲？</p><p>答：可以用软棒敲一敲，也可以用手按摩拍打穴位，包括后脑勺和头顶那里都要疏通一下，经络通道疏通了，脖子就不会发胀和僵硬了。后脖颈是一个重要部位，连接着身体和大脑，是大脑气血供应的唯一通道，那里打通了，头脑才能正常运行。头部和百会穴都可以用手拍打，空心拳也可以，用软棒、硅胶拍板拍打也可以，这样气血活络，养分充足，头脑清新，思惟敏捷。</p></div>"
}]