[{
    "title": "前言",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>前 　言</strong></p><p>《四念处经》，这部经也叫作《大念住经》。这部经的内容是修习四念处：观身不净，观受是苦，观心无常，观法无我。修习成就之后，证得三果或者四果，得解脱得清净涅槃，因此修学四念处法，目的应该是证果，降伏烦恼，得解脱。在修习过程中，只要心心念念都住在观行四念处上，日久功深必能断身见断我见，必能证得解脱果，从而断除三缚结以及所有烦恼结缚，把捆绑我们在生死恶道中的结缚解开，未来永远不去三恶道受苦，也不受六道轮回苦。如果不做这样的观行，很难断我见，三缚结也很难断除，生死结缚不能解开，苦海不能出。</p><p>三缚结分别是：我见，戒禁取见、疑见。什么是我和我见？所谓的我，就是五阴十八界生灭无常的我；色阴、受阴、想阴、行阴、识阴及六根、六尘、六识这个假我，把这个当作我，就是我见。我见当中有个身见，就是把色身当作我的知见。我见身见都要断，才能断除邪见出离生死。以我见为主，处处执着我，结果是什么呢？结果就会为了这个生灭无常的假我而造作无量无边的业行。造作了业行以后就被业行拘束在六道中受苦。我见就是一个结，因为这个结把我们捆绑在六道，捆绑在三恶道，不能出离生死大苦。</p><p>戒禁取见是什么呢？就是为了得到解脱而制定了一种或多种戒律来遵守，但是这些戒律制定得不如理也不如法，不能够让依此修行者得到解脱。如果执取这些不如法的戒认为是如法如理，能得解脱，从而去遵守执行，这种知见看法就叫作戒禁取见。戒禁取见一般是指外道施设的戒，其戒法只是在色身身行上颠三倒四，不能获得正知见，不能有解脱的智慧，不能降伏自心烦恼，守着那样的戒法不能得解脱出离生死轮回，执取那些戒法就是一个结缚，更把自己绑缚在六道轮回里，不能脱离。什么是不如理不如法的戒呢？凡是制定的戒不是用来修心改变心行的，只是在身体外相上做文章的就是不如理的戒禁取戒；凡是与佛所制定的戒不一致，内涵与目标都不相一致的，达不到解脱目的的，就是不如理不如法的戒禁取戒。执取这些不如理不如法的戒，就叫戒禁取见。</p><p>比如有些外道说，你看那些鱼在水里游得多么自由自在，假如我们能像鱼一样的自在解脱，该怎么办呢？我们也应该成天泡在水里，将来就能像鱼一样得到自在解脱。这样施设的戒法如理如法吗？断我见是这样断的吗？当然不是！还有一些外道说，看看那些牛羊有多么的清净，牠们只吃草，不吃别的食物才这样的清净，那我们也应该只吃草，那样就能得到清净，得到解脱了。这样真的就能得到清净、得到解脱吗？当然不能，断我见跟吃不吃草一点关系都没有，解脱在于自心，在于如何用心，在于智慧，并不在于单纯的饮食一方面。</p><p>还有一些外道说，我们要想得解脱，就要把无量劫来造作的所有的恶业全部消灭了，才能得解脱。那些业怎么消灭呢？他们就用很多无意义的苦行来折磨自己，或者一天只吃一麻一麦，或者只吃土，或者很久不吃，忍饥挨饿，或者卧在灰土上，或者夏天让火烫，冬天用冰冻。总之，就是用种种方法来折磨自己，认为这样就能把自己无量劫来的罪业都消灭掉，从而就能得解脱了。这样来折磨自己，能消灭所有的罪业吗？当然不能，试想我们无量劫以来造作过多少的罪业，无量劫以来所造的罪业没法数清楚，光是地狱的罪业就有无量无边之多，何况其它的。这么折磨自己就能消掉所有的罪业吗？是消不了的！</p><p>无量劫以来造下的罪业要怎样做才能消除，从而使我们免除三恶道的苦呢？只有断我见，断三缚结，断除心里的一切无明。如果错误知见能颠倒过来，心里没有一个我，认可五阴我是虚妄的，那么我所造的罪业也是虚妄不真实的，这样就免去了三恶道的罪业。要想断我见、断三缚结，就要观行五阴十八界的虚妄性，证得五阴为假我空幻，不是真实的，这样才能断我见。外道的那些所谓的戒行，根本消不了所有的罪业，所以那些不如理的知见叫作戒禁取见。</p><p>第三个结缚就是疑结，疑见的结缚。什么是疑见？内心有不能抉了的法存在，不能确定五阴到底是不是真实的，是不是生灭无常的，到底是不是能够依赖的不灭的我，是不是能到未来世去。对此疑惑不清，就会犹豫不决，不能抉择，那样还会对五阴有所依赖，有所信任，依五阴而造作的三恶道业就不能消除，就会随业而流转于三恶道。这个疑见就是烦恼结缚，如果不断除，必有烦恼惑业苦不灭。</p><p>如何断疑见烦恼呢？有人说我一想五阴确实是没有我的，心里就不再疑惑了，就确认了五阴无我，断了疑结。那么意识稍微思惟思惟五阴苦空无常无我，能不能断除内心深处的疑惑？恐怕不行。无始劫以来，由于意根自体所具有的深重无明，再加之无始劫以来环境的熏染，心里更是无明深重，意识简单粗浅的思惟，改变抵抗不了意根的无明，短时期对法义的理解熏染不了意根，意根不能证得五阴无我，不能断我见。有一些人很自信，说自己确实认可五阴无我断我见了，可是这个确信确认是盲目的，智慧不足不能如实了知自己的心，临终时事实摆在面前，只有随业漂流，丝毫做不了主。</p><p>怎样才能断除疑结呢？必须修定，在禅定中细心观行思惟，或者按照佛讲的四念处的观行方法，真真实实的用功，不能投机取巧，踏踏实实修行八正道七觉分，发起禅定和空三昧。</p><p>佛在世时的大根器众生、极大根器的众生可以在听闻五阴无我之理的当下，不用反反复复的思惟观行，就证得四果阿罗汉，袈裟着身，须发自落，神通现前。比如大迦叶、舍利弗、须菩提等等，那是因为他们前世证得四果到现在已经无量劫了，甚至是三个无量劫，其身份可能是佛再来者，生来就有禅定，就有宿命通，生来就是阿罗汉，他们当然可以示现听闻一句话马上证果。因为意根在无量劫以前就证果了，意根一直没有断灭过，一直都知道五阴无我，不用意识再费力的熏意根教导意根，他们今世的五阴虽然是新的，意识虽然是新的，遇到佛法稍微一思惟，就证果了，这样证果才非常快。</p><p>如果意识有宿命通，意识也同样生来就知道五阴无我，不用再断我见证果了。但为了度众生，影响众生，可以示现证果，今世的意识听闻一句佛法，不用思惟，就能证得五阴无我。而意根一直是知道的，凡是前世证过果的人，今世证果都很快，不用意识再去熏染意根，教导意根。前世证果的次数越多，今世证果越快，因为意根没有无明不障道了。意根被熏染被扭转过的人，非常伶俐，只要意识能理解就可以了。如果前世证得了初果，今世再证得初果就容易，但证得二果就不容易了，因为意根只相应到初果那样的观行智慧。</p><p>前世证得二果的人，今世再证得二果就比较容易，但证得三果就不容易了，因为意根与三果还不相应，必须再熏染教导三果的内容，意识与意根才能证得三果。前世证得三果的人，今世再证得三果比较容易，但是证得四果就不容易了，因为意根不与四果的境界相应，必须再熏染教导四果的内容，意识与意根才能证得四果。这就是再来人证果和明心比别人快速的原因。</p><p>以上已解释三缚结，接下来开始讲解《大念住经》的经文。</p></div>"
},{
    "title": "第一章　总说",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  总说</strong></p><p>原文∶<strong>如是我闻。一时世尊住拘楼国。名剑磨瑟昙之拘楼人市镇。于其处。世尊告诸比丘曰。诸比丘。彼等比丘应诺世尊。世尊。世尊如是曰。诸比丘。为众生之清净。为度忧悲。为灭苦恼。为得真理。为证涅槃。唯一趣向道。即四念处。</strong></p><p>释：如是我闻，在某个时间，世尊住在拘楼国的拘楼人市镇里，在市镇里讲法时对诸比丘们说：诸比丘。比丘们就回答说：世尊。世尊就说：诸比丘们，众生要想心得清净，要想度越忧悲苦恼，要想得到真实的四圣谛理，要想证得涅槃，只有一个趣向道，只有一个修道的方法，就是修习四念处。</p><p>如是我闻。这是佛涅槃以后，阿难在大众面前，复述出佛当时是如何讲述这部经的。一时，就不说具体是什么时候了，因为这个时间没法定，印度是那个时间，我们中国是这个时间，天上又是另一个时间，各层天的时间也不一样，所以佛经上就干脆不说具体时间。因为世尊讲法是为三界世间人天大众而讲，不是为某个地区众生而讲法，度众范围相当广泛，所以就不说具体时间。世尊坐好了以后，就开始呼唤比丘们，目的是引起比丘注意力集中听法，比丘们回复世尊以后，心就沉静下来了，专心听世尊讲法，然后就开始讲法了。</p><p>我们修四念处观，就能得到上述的利益，心得清净而度无量的忧悲苦恼，得真理，得涅槃，这个修道的结果对于小乘人来说，就是最大的利益。</p><p>什么叫心得清净？清净就是没有贪嗔痴烦恼以及烦恼习气，没有执著，没有无明，没有染污。众生的心往往是不清净的，有极多烦恼和无明，都有些什么烦恼呢？有贪爱，贪各种人、事、物、理，贪财色名食睡，见什么就贪什么，什么都想要归我所有，属于我的越多越好；有嗔恚，遇到境界动不动就动气、发火、恼怒、嫉妒、仇恨；还有愚痴，真正的道理什么也不懂，一事也不知，内心里都是无明，连自己是愚痴的也不知道，非常愚痴的不知道自己是愚痴的，别人是说他愚痴，他也不会承认。</p><p>其实我们每个众生都有愚痴性，都有不懂之理。什么是愚痴？任何一件事情只要有不懂之处就是愚痴无明，比如不懂什么是五阴，不懂我们五阴身是四大组成的假合体，不懂五阴我是虚妄无常幻化的，不懂如何出离生死苦，不懂什么是苦，苦是如何出现的，不懂如何得解脱，不懂为什么有六道轮回苦，不懂如何出离六道，不懂什么是佛，如何成佛。那我们懂什么？懂得如何执取抓取世间万法，造作贪嗔痴业，最后被世间万法束缚在业障深坑中，不得自在。</p><p>我们现在心里既有忧悲又有苦恼，苦恼非常多而微细，要想度过这些忧悲苦恼，就要趣道修道。度，就是越过去，消灭掉，把这些忧悲苦恼都要度化消灭了，心才能得清凉。为了得到一种真理，就要趣道、修道。什么是真理呢？真正的真理就是真实的道理，符合佛陀所说的解脱之理，是三界世间的真相，是颠覆不灭的事实。</p><p>小乘法中的真理就是苦集灭道四圣谛理。苦，是一种真理，我们在世间里的五阴都是苦的，这就是真理，是真实存在的道理。苦集，是真理，这些苦是我们生生世世无量劫以来，造作的恶业所积集感召出来的，贪嗔痴烦恼所积集出来的，所以我们才感得到这些苦的果报，这个也是真理。</p><p>还有什么真理？苦灭是真理。虽然我们有这么多的苦，但是通过修行是能够灭去的，苦不是永远存在不灭的，是能够消亡的，这也是真理。再有什么真理呢？苦灭要修的道，八正道是真理。把这些苦灭除的方法是什么呢？通过修八正道，把苦灭掉，八正道的修道方法也是真理。我们只要按照八正道去修行，就可以灭除无量的忧悲苦恼。总之，苦、集、灭、道四圣谛，就是众生所要修行的真理。</p><p>证得到这个真理有什么好处？第一，不会下三恶道受苦；第二，可以去除贪爱，得解脱。解脱以后，就没有忧悲苦恼，三苦八苦无量苦，都会灭除，得到寂灭乐，清凉乐。</p><p>什么叫涅槃？涅槃也叫清凉，也叫不生不灭，也叫不来不去。我们现在的五阴假我有生有灭，有来有去。生灭现象从大的范围来看，无量劫五阴身的生来死去，或者是一生一世的生来灭去，从出生到死亡，都是有生有灭的法。从细微的现象来说，五阴是刹那刹那生灭的，色身和心念都在非常迅速的生灭着，变化不停，五阴就是这样的生灭来去；而涅槃境界当中没有生灭去来的现象，是不生不灭的清净境界。通过修道，证得涅槃，就能证得不生不灭的寂灭乐，有个不生不灭的本心，就能证得种种涅槃，就能得清凉，得寂止。</p><p>涅槃可分为大乘涅槃和小乘涅槃，小乘涅槃是三果阿那含和四果罗汉证的，叫作有余涅槃和无余涅槃。大乘菩萨证得的涅槃，除了小乘的这两种涅槃，最主要是证得本来自性清净涅槃，就是永远长存不灭的第八识如来藏，那叫真我、真心，还有佛地所证得的无住处涅槃，本心在常寂光土，心是寂灭的，而现报身、应身和无量无数的化身来广度无量众生，佛却一处也不住，也不住涅槃境界，心虽寂灭清净，却能化现无量的色身广度众生，利乐有情。</p><p>阿罗汉所证得的有余涅槃与无余涅槃，是通过修习四念处，观行四念处而证得的。什么是有余涅槃？就是还有余下的一点点苦要忍受，心里虽然灭掉了贪爱，对三界世间不起念想，可是还有色身存在，在世间生活就要感召各种微苦。不过罗汉们的苦比我们的苦要少很多，因为心里没有欲求，没有希求，就不会有很多苦和很大的苦痛了。</p><p>苦的来源就是贪爱，众生什么都贪，贪时苦，贪后苦，贪着与贪不着都苦，拥有的再失去，心里更觉得苦。但是三果和四果圣者已经灭掉贪爱，对于财色名食睡已经不贪执，那种贪爱苦已经没有，但还有一些余报余苦未了。比如过去印度很热，有四十度的高温，太阳直接照在身上，他也会感觉很热，这个就是苦。夏天的蚊虫叮咬，他身上感觉又痒又疼，这个也是苦。还有因为业障，身体会生病，也是苦，但是这些都是小苦，他已经没有生死的大苦恼，没有贪求苦，没有求不得苦，没有五阴炽盛苦，这些苦恼都没有了。</p><p>什么是无余涅槃？四果阿罗汉对三界的贪爱已经断尽，如果是智慧解脱的阿罗汉，命终时会灭掉自己的五阴十八界。如果有四禅八定，就是俱解脱阿罗汉，他能随时随处灭掉自己五阴，把色身灭掉，受想行识的几个识心也都灭掉，五阴灭掉、十八界灭掉以后，只剩下第八识真心不灭，那就一点儿苦也没有了。因为没有色身，没有心，就不会再有什么苦，没有五阴存在就感召不到苦。这样阿罗汉入了无余涅槃以后，就得到了寂灭乐，但是也没有真正的乐，因为没有人来享受乐，这就是小乘证得的无余涅槃。</p><p>修四念处，就能得到上述的种种利益，心得清净，度无量的忧悲苦恼，得真理，得涅槃，这个对小乘来说是最大的利益。</p><p>原文：<strong>如何为四念处。诸比丘。比丘于此。于身观身而住。精勤正知正念。舍离世间之欲贪苦恼。</strong></p><p>释：佛说：如何是四念处呢？诸比丘，比丘对于四念处，首先要观行色身，心住在观行色身上，精勤一心，具足正知正念，舍离世间的欲贪和苦恼。</p><p>第一念住是身念住，于身观身而住。首先来观察我们的身体，心念全部都要住在自己的身体上，这个时候心里就不要再考虑其他的事情，不要再打其他的妄想了，所有注意力都集中一起来观察色身。观身而住之后，能观察出一个结果，就是能了知色身是不净的，知道色身是无常的。最后得出一个结论，这个身体就是假的空的苦的，不是我，也不是我所有的，这样就断身见。</p><p>精勤一心，就是不要懈怠，不要只观一会就懒散，让心念跑掉了。总是要精勤的来观色身，除了睡着时不能观，其余时间一天到晚都应该在观身，这样就能灭苦。现在讲的是大概轮廓，还没有讲到具体的观行方法。什么是正知正念？如果观身的时候，念头散失，不知道自己的身体状况了，这时就不叫正知正念。所有的心念都应该集中在色身上，或者是色身目前正在做的事情上，这就叫正知正念。不要同时做两样事情，在观身的时候又想起了其他的事情，心念分散了，那就不叫正知正念。</p><p>这样修就能舍离世间之欲贪、苦恼，因为心心念念都在色身上，不回想过去，也不希望未来，就没有那么多烦恼，只注意眼前所做的事情，不容易生起烦恼。内心不会因为想起了昨天的事或者前天的事，而生起苦、乐、忧、喜各种烦恼，当生起那些苦乐等等的感受时，心就不净开始生烦恼了，如果要考虑思虑明天的事，后天的事，计划打算都出来了，心念就不净了，杂念非常多心就喧闹了。如果只注意眼前的色身，和色身正在做的事情上，没有其他的杂念，心中就没有欲贪，也没有苦恼。这是第一观：观身而住。</p><p>原文：<strong>于受观受而住。精勤正知正念。舍离世间之欲贪苦恼。</strong></p><p>释：第二观是对自己内心的感受，要时时观察。观察我们身体上的各种感受和心里的各种觉受，所有的心念都要住在观察觉受上面，所有的心念都集中在觉受上。觉受会在什么时候出现呢？在眼看色的时候会产生感受，在耳听声的时候会产生感受，在待人接物、行住坐卧的时候都有感受生起，也就是说在六根触六尘的时候会产生出各种感受，任何一件事情的出现，只要六尘境界现前，内心都有感受，身体也有感受，我们就要不断的观察这些感受。</p><p>观察受的结果，当智慧生起来的时候就会知道，这些受都是苦受。于是我们就不会再贪著受，就会生起一种出离心、修道心，最后就能通过修道灭掉这些感受，不执著这些感受。通过观行观察思惟，知道这些感受也是无我性的，是苦的，苦的就不是我，因为我是真实的，是不苦的，是清净自在的。</p><p>于受观受而住精勤一心，要非常的精进，连续不断的观察各种感受，没有生起世间的欲贪，没有生起其他的苦恼，没有生起其他的想法和念头，没有杂念，就是精勤。精勤还有另外的说法，叫作四正勤，四正勤就是：未生善使令生起，已生善使令增长；未生恶令其不生，已生恶令其灭去。在四正勤精进的修行中，以期能够断恶修善。善法也可以指专一其心的正念，恶可以指杂乱的攀缘心，努力断恶修善，就是精进。</p><p>精勤修行以后，就有了正知正念，心心念念都在感受上，都在观察感受上，这个叫正知正念。如果不知道色身的感受，就不是正知正念，因为心念转到其他事情上去不专注了，那就不是正知。我们目前做的只有这一件事，观察色身的感受，集中精力念力把这一件事做好，最后就能修成功，这叫正知正念。有正知正念以后，就能够舍离世间的欲贪与苦恼，知道受是苦的，受不是我，不是我所，就能断我见，断我见之后就会慢慢灭掉贪爱，不会再贪著感受了，就灭了欲贪苦恼，这个时候禅定也能生起来了。</p><p>这种观行方法是从证初果之前的凡夫开始，一直观行到什么时候呢？可以一直观行到证得四果阿罗汉，观行之后能够证得初果、二果、三果、四果的果位。最后所有的欲贪都能断尽，三界的烦恼全部断尽，就能舍离世间的欲贪和苦恼。这是第二观：观受而住。</p><p>原文：<strong>于心观心而住。精勤正知正念。舍离世间之欲贪苦恼。</strong></p><p>释：于心观心而住，心有几个，观哪个心呢？心可以分为真心和妄心。真心有一个，叫作第八识如来藏。妄心有七个：眼识心，耳识心，鼻识心，舌识心，身识心，意识心，还第七识意根，意根是处处时时作主宰的我，七个妄心和一个真心加起来总共是八个。我们观心要观前七识，或者观前六识，因为第八识我们没有证得、没有找到，那就观不到，小乘也不需要观行真心第八识。第七识意根也很难证知，很难观行到，所以只能观行前六识里面，我们以观第六识意识心为主。</p><p>于心观心而住，如何观心呢？要观心的无常性。什么是无常？心的生灭变异性不定性，就是无常。观行六识每天都要出生又灭去，这是无常的，最无常的表现是六识心刹那刹那的生灭，心念的不断变换。从六识总体的无常性来看，心念总是在变化不停，现在此刻是这样一种想法，一会儿就变了，换成了另一种想法，这颗心别人抓不住，自己也抓不住。心总是在变，心念在变，思想在变，所有的计划打算全部都在变，说出的诺言很难实现，所以这个心就是无常性的，不可靠的，自己靠自己都靠不住，其他人来依靠还能靠得住吗？靠不住，这个心就是这么的不可靠。</p><p>于心观心也要精勤不懈怠，不要有杂念，要正知正念。所有的心念都在观心上，现在目前只了知自己的心念，其它杂事不想不攀缘，这叫正知正念。正知正念以后，能够舍离世间之欲贪、苦恼，就是断掉对世间的贪爱了，贪爱断掉以后，所有的苦恼都能灭尽。这是第三观：观心而住。</p><p>原文：<strong>于法观法而住。精勤正知正念。舍离世间之欲贪苦恼。</strong></p><p>释：于法观法而住，观行的法都包括什么？五阴的法、六尘的法、六根的法、六识的法、十二处的法、十八界的法，都是五阴辗转和合生起来的一切法，包括行住坐卧、语默言笑等种种的法。具体要观行五受阴、四圣谛、七觉分、八正道，十二处和十八界。观行这些更要精进一心的观察，正知正念，舍离世间之欲贪和苦恼。观法而住的结果是什么？结果就是要证得在一切法当中没有一个我，也没有我所。这是小乘的法无我，也是小乘的人无我，五阴十八界所辗转生起的一切法都不是我，最后就能证得三四果，断尽对三界的贪爱，就能灭掉所有的忧悲苦恼。心得清凉，心得解脱，就能出离三界了。接下来世尊具体地教导如何修行四念处的观行。</p></div>"
},{
    "title": "第二章　观身念住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　观身念住</strong></p><p>四念住当中第一个是观身念住，叫作观身不净。第二个是观受念住，观六识心的各种感受。观的结果是，六识心的感受都是苦的，不仅是生灭无常的，也都是苦的。第三个是观心念住，观我们六识心念的无常性。最后是观法念住，观一切法的无我性。这四念处观都观行成就，就能断我见。四念住的身念住，于身观身而住，总共是十个部分。</p><p>第一部分观身念住，我们修完了以后，就能断身见。断身见以后，再也不会认色身为我，为我所有的，就是初果向，离初果就很接近了。以后再把几个识心的我见也断掉，认可识心也不是我，不是我所有，五受阴都不是我，就能完全断我见。我见一断，三缚结随即都断，从此以后三恶道业消灭，未来世永远不下堕三恶道，人天七返，就能得解脱。如果断我见以后，再精进修行，就可以修到二果斯陀含，人天一返，就可以得解脱。</p><p>再精进修行，证得初禅定，断尽贪欲和嗔恚两个结缚，就可以证得三果阿那含，天上一回修行就得解脱，不用再回人间修行了。如果再接续精进修行，断深细的我慢，和色界、无色界的贪爱，修到四果罗汉，就能得解脱，入无余涅槃。但是我们要想成佛，就不能入无余涅槃，也可以选择不去天道，因为在天界要享用很多的福德，福德消耗的太多，道业就很难进步。我们可以选择回到人中修行，或者到其他的佛国土去修行，这样就会快速提高修证的菩萨果位，快速成佛。</p><p>这里涉及到了《观无量寿经》中讲的往生品位问题，也涉及到在哪个世界修行，成就比较快速的问题。等我们明心以后，证果以后，可以做一个有利于自己道业快速进步的选择，考虑自己如何修行成佛最快速，是在娑婆世界修行最快，还是在其他佛国土修行最快速。证果和明心以后，就有能力随愿往生，可以到极乐世界，可以到弥勒内院，也可以升天，也可以再回人间，其选择性就非常大了。在此之前，我们只能随着业力流转，被业力所牵引，自己丝毫不能作主。</p><p>佛经上说，明心见性以后，我们命终在中阴身的时候，十方世界诸佛国土，可以随愿往生。意思是说，因为有明心的功德和证量，在中阴身里，如果想往生到哪个佛国土，心中起个念想，那个佛国土的佛世尊就会来迎接，于是我们就会坐着金刚台的莲花往生去了，莲花都不必合上，色身不必包裹在莲花里。如果我们不明心，就没有这个优越条件，只能随业力流转在六道里。至于是流转六道当中的哪一道，那就看我们过去世造业的种子和我们今世的业行，以及内心的贪嗔痴烦恼的程度。</p><p>众生因为三缚结没有断，就保证不了不下三恶道，极大多数的人还是去了三恶道。其中百分之八九十的人，去了鬼道，为什么去了鬼道呢？因为众生都有贪心和吝啬心，与鬼道相应，就要去鬼道受苦报。贪心就得饿鬼报，贪心很重得的果报就是非常的贫穷下贱，而鬼道众生是既贫穷又下贱，穷得一无所有，越贪越没有福。贪是往里入，福德流失，贪一元钱，福报就减少一百倍、一千倍甚至是无量倍，布施是向外出，福德就增加，舍出去的钱，回来的福报是一百倍、一千倍或者是无量倍，要看布施的对象是谁。这叫舍得舍得，只有舍才能得，不舍就不得。所以我们只要有贪，就要消福，无福就与恶道众生相应，就要到恶道受苦受罪。</p><p>观身念住第一部分，世尊给我们讲了四念住的概念和内涵。第二部分就开始教导我们观行，从哪里入手开始观行呢？从出息、入息开始观行。无论出息还是入息，内心里都要清楚，心不散乱。长入息也知道，长出息也知道，心不散乱，也不昏沉。入息时全身状况，心里要清楚知道，出息时全身状况，心里也要清楚了知。然后在入息的时候，身行全部止息下来，全部都寂静下来时，自己心里要清楚了知。再然后出息的时候，自己的身行也全部寂静下来，止息下来时，心里也要清楚了知，不散乱，不昏沉。</p><p>这个定一般人可能要修很长时间才能修成，有的人利根，几天就修成。有的人需要一个月、两个月，甚至更长时间才能把自己的定力修到这个程度。需要半年到一年的时间才能修成的人，平时他的心念太散乱了，没法觉知全身，清楚觉知一样事情都很困难了，他的定力实在是很差，心念没法集中统一。所以每个人学佛修行的快慢进程，都是因人而异的。有的人几个小时就能修成，心念很快就能静止下来，全身的状况从里到外，他都能清楚了知，内身外身的状况他都清楚。而多数人就需要很长时间的不断训练才行。</p><p>观身念住的第二部分，是在行走坐卧当中，观自身的身行状态，这就是动禅，是在训练动中定力。动中定力如果修好了，随时随地心是寂静的，随时随地心念是清明的，心里只有一个知在。这个知就是一念的清明了知，心念不浑浊，不杂乱。心里这个知很重要，将来参禅时，就可以把这个知换成所参的话头，把话头变成一个念头。如果把身念住的观行修行成功了，做到心里时时有个知，没有语言，没有文字，用这个知正好参禅。参我们的真实心第八识，话头“拖死尸的是谁？”，把这句话做为一个念头，作为一个知，牢牢地悬在心里，悬在脑海里。</p><p>这样悬来悬去，定力就会增强，以后再接着参究，要非常细的参究，而不是内心里有个声音，有语言在念。没有定时心里才要念叨，有定时心里就不用念，不用出现声音和语言形象，就是一个知深藏在心。以后，这个知，这个念头，会变成疑情，会成为疑团。那个疑情在内心里深深的悬着，悬到一定时候，就会把这个疑情打破，那时就能找到自己的第八识，从而明心了。所以这个修定方法，不仅仅是通于小乘法的修行，也通大乘方法的修行。真正的佛法是大小乘都会相通，法法相通。我们只要能修出一种禅定，以此禅定，就可以进入到另一种禅定，开启另一种智慧。</p><p>禅定包括欲界定、色界定、无色界定，欲界定有欲界定的特征，色界定有色界定的状态，无色界定有无色界定的相貌。我们只要用某一种方法修出定力，心念就能够随时随地清静下来，以此定力再参禅，大小乘理都会贯通。所以修大乘法不用排斥小乘的修行方法，大小乘会贯通起来的。身念处观这个法修到最后，把心念止息下来时，再把心念中的所谓的我排空掉，否定掉，这些都不是我，没有一个我，不要再认色身为我，内心没有身体的观念，心不住一物。但是还能了知一切，还有一个知的心念存在，与参禅当中的那个心念是一样的。</p><p>将来参禅时把这个知的心念，换成一个话头，或者换成禅宗的一个公案，或者佛法当中最要紧的一句话来参，就能参通，就能明了其中的内涵。定是相通的，定里就含藏着慧。那个慧就是内心清明的心念，对于一切法，心里非常的清明，非常的清净不糊涂，清清明明的了知，就是观慧。观慧具足了就能够入道，就能够证道。这就是在行住坐卧当中的动禅，行走坐卧当中清明了知，知内身外身的一切状态，一切法相。然后内心里有身的观念现前，再把这个观念排除、空掉，知道这个身不是我。</p><p>不要心心念念有个身的观念，也不要有其他物的观念。行走坐卧内身、外身的状况，什么法生起来，什么法灭去，心里都要清楚。修到这种程度的定也不太容易，我们要有耐心，逐渐地修习和训练。这个方法修成了，任何其它一种定，都能容易修成，只要掌握了修定的根本方法，用其它修定方法，都能修成，而且会修得非常快。</p><p>第四个观身念住的方法是，无论我们行往归来，无论我们做什么事情，每天早晨出去了，晚上又回来，一天所经过的路线，所做过的事情，都是要由正知而做，心不散乱也不糊涂昏沉，内心一直是清清明明的了知所做的所有事情。无论观前还是顾后，一切的身语意行的造作，全部是正知而做，就是上厕所也是正知而做。内心清清明明有个了知，有个知性，修到最后就有个没有语言文字的知，这就是未到地定了。这个定比较深一些，那个知更清明一些，达到没有语言文字的知的那个状态，就可以参禅、参话头了。</p><p>第五个方面修观身念住的方法，就是观我们色身的不净。观到最后问自己：这么不净的色身是我吗？观行成功时，就会确认不是真实的自己。这个色身从头到脚，从里到外，发毛、爪齿、皮肉、筋骨，什么固体、什么液体，都非常的肮脏、不净。这些东西和合而成的色身，是我吗？最后会确定不是我，清楚了知色身是生灭无常的，而真实的我是常住的、不变易的、清净的。</p><p>我不是肮脏的，我不是组合而成的，不是后天形成的，更不是生灭的，这些都不是我。观来观去内心里就有个身的观念去除了，色身为我的观念就被自己否定，断了身见。内心无色身我以后，也不要再有其他物，一空俱空。外物财色名食睡也都不是我的，也不会认这些东西为我所有，这样就断身我见、我所见。</p></div>"
},{
    "title": "第二章 （一）观呼吸",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>一、观呼吸</strong></p><p>原文：<strong>然。诸比丘。比丘如何于身观身而住耶。诸比丘。于此。比丘往森林往树下。往空闲处而结跏趺坐。身正直。思念现前。</strong></p><p>释：世尊说：好，诸比丘，既然修行四念处观能够灭除苦恼忧愁，得到清凉，那么比丘要如何于身观身而住呢？佛说：诸比丘们，修行四念处观，首先你们要选择森林、树下这些无人打扰之处，在空闲处而结跏趺坐，身体要端正笔直，不要弯曲，然后就开始思惟。</p><p>世尊开始具体讲观身而住的方法：怎么样观身，心念怎么样住在色身上来观行。过去世尊讲法的时候，很多弟子来听法，法会结束以后，弟子们都各自找一个安静地方来静坐思惟观行。印度的天气很热，比丘可以随便找一个地方，或者到森林里在一棵树下，或者到坟地里，或者到一个石洞里，只要是没有人打扰的地方就可以，把薄薄的座垫铺在地上，然后盘腿坐好，端身正坐。一个人一个地方，他们没有两个人或三个人在一起共修的，因为每个人都是单独思惟，不用磋商研究，就避免了互相干扰。他们这种修行方式，是既修禅定，又修智慧。观行本身就是慧行，深深地思惟，其中就有禅定，这就是定慧同修。</p><p>为什么要跏趺坐呢？结跏趺坐就是盘腿，腿一盘好，身体就容易静下来，身体里的气脉就开始运行，色身比较舒服。这样心念也就能沉静下来，心思不杂乱，盘腿的好处就是这样。身体如果端正了，气血运行就畅通，心不杂乱。如果身体弯弯曲曲，松松懈懈，内脏器官不正，气血不畅通，心念就杂乱，心念懈怠，人也容易昏沉，身体正直，心念马上就集中，端身正意就是这个道理。</p><p>思念什么呢？就是思念世尊所讲的法。每次世尊讲完法，弟子们都是各找一个地方来思惟消化世尊所讲的法。像我们如果是听完法回去以后，可能再也不回忆，再也不回想，听过就算完事，即使回想一下，也不去认真仔细修习，就不能从所闻佛法当中得到真实利益。</p><p>听完法应该要趁热打铁，回去就回忆思惟，一个义理一个义理来思惟，一个一个去验证。这个法义思惟通了，再思惟下一个，验证一下世尊所讲是不是如实，过去的比丘们都是这样修行的。在思惟的同时还有禅定，在禅定中思惟叫作禅观，小乘的禅修就是这个意思。这个不是大乘法的参禅，不是寻觅第八识的那个参禅法，是小乘的禅修方法，但是用功方法和心念都差不多，都是有定有慧，在定中观行成就世尊所讲的佛法义理。</p><p>原文：<strong>彼正念而入息，正念而出息。</strong></p><p>释：什么是正念呢？就是心无杂念，心念集中在眼前所观行的法理上，不想其他的杂事，就是正念。观身而住要先从观呼吸开始，观察自己的呼吸，注意自己的呼吸。比如我们现在正在吸气，空气从鼻孔入进去，到达气管，然后顺着气管一点点的运行下去，然后到达五脏六腑。这口气所经过的路线，到了哪个位置，应该都能感觉出来。最后呼吸到达腹部丹田，都应该知道，不知道就不是正念，念头掉散了。为什么会不知道自己的呼吸了？因为心里打妄想了，在想其他的事情，心散乱注意力不集中就不知道了。所以我们要一直观察呼吸，把心念全都系在这件事情上，就没有妄想，修定就来得快，身体的改变也来得快，思惟也很灵敏。这样的思惟观行以后，就能断我见，断身见。</p><p>首先先正念观察自己的呼吸，入息的情况全部知道，入息以后，再正念而出息。观察自己在往外呼气，从丹田的这个位置，气息一直往上运行，经过的路线都应该知道，然后气息从口里轻轻的吐出去。整个过程要清楚知道，心念都没有跑掉，没有散乱，没有昏沉。如果昏沉迷糊了，这个呼吸状况就感觉不到。</p><p>原文：<strong>或长入息。而知我在长入息。又长出息者。知我在长出息。</strong></p><p>释：正念而入息，正念而出息，训练好以后就进入下一步。心静下来以后，入息就会变得长。为什么会变长？因为心静了以后，呼吸的通道就都打开了，中间没有阻塞的地方，气息就会一直下到丹田，于是入息的时间就长，身体也就变得健康，因为这中间气脉的运行，会把身体里的病气排出去。如果身体不健康，呼吸到胸口就过不去了，随即就呼出去，只到了半路，到达不了丹田，有的比较严重的到喉咙口就呼出去，这种人身体相当虚弱。</p><p>长入息时，正知正念，知道自己现在的入息非常长，非常缓慢，吸一口气有可能半分钟，有可能达到一分钟。如果定力逐渐加深，到了四禅定的时候，连呼吸都停止没有了，说明禅定是非常好的。定力越好，呼吸就越慢，越轻柔，越和缓；如果定力不好，呼吸的声音就粗重，别人都能听得见。能听到喘气的声音，说明身体的通道有堵塞，身体是不健康的。</p><p>长入息都知道以后，长出息时也知道，知道自己呼气的时间很长，非常缓慢，非常轻微。这样修行是一步一步深入的，先做好第一步，然后再做下一步。前面的基础打好打牢固了，下一步就能顺利，那么禅定就能修好了。这样来训练自己的心念，训练自己的定力和慧力。</p><p>原文：<strong>又短入息时。知我在短入息。又短出息者。知我在短出息。</strong></p><p>释：长出息和长入息自己都知道了，有时候呼吸因为各种原因变得比较短，也要知道，自己现在的入息比较短，很短的时间就吸满，吸气运行不下去了，自己也应该感知到。呼气的时间也很短，一下子就呼出去了，自己也知道，这也是因为身体各方面的原因所致。就这样训练自己的心念达到专一，定在眼前所作的呼吸上，这个就叫作定，心止于一处。</p><p>短入息和短出息自己都知道，训练到这一步，再往下修习。每个人训练的时间长短都不一样，要看各人的身体素质和心理素质，每个人的基础都不一样，心念力不一样，身体的健康状况不一样，修习的时间长短就不一样。有的人修半个小时，有人要修几天，有人可能要修半个月，有人可能一个月才能达到心念静下来，才能让心念都集中在呼吸上，这个时间的长短都不一定。如果这个基础没打牢固，就不要往下进行，只要有一步没做好，后面的练习就会混乱，不能再修下去了。当呼吸长短都知道了以后，再往下进行。</p><p>原文：<strong>修习我觉知全身而入息。修习我觉知全身而出息。</strong></p><p>释：修习达到心念力增强了以后，观行的范围要逐渐扩大，由觉知身体的某一处，最后扩展到全身。入息的时候，不仅要觉知到气息经过的通道，还要觉知到全身的状况，整个身体的情况，全部都要知道。就是说，现在从鼻孔开始入息，身体各处都是什么状况，气息到了身体的哪个部位，自己都要了知，掌握清楚，心不糊涂。了知自己胃肠的状况如何，心脏的状况如何，腹部的状况如何，头部的状况如何，腰腿的状况如何，手脚的状况如何，全身的状况自己都要知道。</p><p>觉知全身的情况，是一点点修成的，因为全身的情况比较复杂，需要有一定的定力和相应的慧力、心力才能做到。前面的基础打好了，后面复杂的就都能够观行到。观行到这一步，说明定力已经非常好了。定力好，能知道的事情就多了，不是只知一个呼吸状况，可以一边了知呼吸状况，同时知道全身的状况。哪个地方舒畅了，哪个地方堵塞了，哪个地方饱满了，哪个地方空虚了，哪个地方疼痛了，自己都知道。由于心念不集中，气不归元，身体出现摇晃现象，心里要了知。心念静下来，气脉通顺，身体安和了，自己要了知，最后身体出现的各种状态都要知道，因为心力够用了。这个方法就是觉知全身而入息，定慧都得到增强了。</p><p>在往外呼气的时候，自己整个的身体状况都要知道，都要清楚。这个时候就是心没有散乱，也没有昏沉，正知正念，如果不知道不清楚，心念就散掉了。腿的疼痛和舒适状况自己知道，发麻的状况也知道，气血通过去，还是没有通过去也要知道。手的状况也知道，肩膀的状况也要知道，头的状况也要知道，面部的状况也要知道，五脏六腑的状况也要知道，腰和背的状况也都要知道。这时注意力要完全集中，心念力要缘于整个身体，内心才能对身体各部位的情况都了知，智慧力就增广了，定力和慧力就会都同时得到增进。这就是觉知全身而出息的修习方法。</p><p>原文：<strong>修习我止身行而入息。修习我止身行而出息。</strong></p><p>释：止，是停止的意思。什么是身行？身行就是身体的一切动转、摇动、晃动现象，就是不安静的行为造作。身体内部细微的运行是不能止息的，除非生命结束。在静坐观行呼吸时，开始身体有动转现象，没有得到静止。因为心没有寂止下来，气脉不通，气血运行不畅而出现头的摇晃，身体的摇动，身体姿势的改变，眼睛的眨动等等。修行一段时间，心逐渐寂静，气脉就运行顺畅，气血也畅通了，就会感觉身体很舒适、安和，心境平静。这样身行就会渐渐地止息下来，头不动，身体不摇晃，腰不弯，整个身体就静了下来。</p><p>这些情况，内心里都要了知，都要清楚，定慧齐行，定慧相资相助。这样对于修定修慧就有了体验，知道原来身体摇晃是因为气血不通，心不静的缘故。现在气脉运行很顺畅，身体不摇晃，全部静止下来，周身感觉都是顺畅的，内心也是怡悦的。在入息的同时，要知道身体各部位的状况，身体全部寂止下来以后，腿不动了，身体也不摇晃，两个手不摆动，神经也不跳动，眼睛也不动，头也不动，身行全都寂止了。这些情况，在入息的同时，都要了知，内心始终有个知，这就是慧，而且需要慧力相当强。这样我们的定慧逐渐就能得到增进和圆满，这是我们修定修慧的很好方法。</p><p>在呼出这口气的时候，要知道自己的整个身体状况，知道自己身体的动转都停止了下来。眼睛不动，头不动，身体不摇晃，腿也不动，腰也不扭动，甚至肠胃都没有很大的蠕动和声响，呼吸也不粗重了，身体表面的明显的活动都没有了。修行心静下来以后，气脉就会渐渐畅通，运行得比较轻微，因为身体里没有阻碍了，业障病气也排除了一些，身体感觉就舒适，也不想动了，好像有一种力量在包裹着身体，执持着身体，身体自然就不动了。这步修行就是止身行而出息。</p><p>观呼吸的修行方法：第一步，观自己的呼吸，入息出息都知道；第二步，出入息的长短都知道；第三步，出入息的时候，全身的状况都知道；第四步，出入息的时候，身行都寂静下来，自己都知道。达到这一步需要修行多长时间，可就不一定了，有的人一天半天就行，有的人需要一个月，有的人需要半年，有的人需要更长的时间，心越散乱，越昏沉，需要的时间越长。所以杂念非常多，身体素质又不太好，就会比别人修得缓慢一些，如果本来就是心比较静的人，那半天就可以达到。</p><p>每个人的修行基础、身体素质与心理素质都不一样，修行的进程就不同，世界观的不同，出离心的不同，修行的时间和结果就会千差万别。这个修行方法中最重要的关键点就是：内心里始终有个“知”，这非常重要，这个”知”，就是不离定而有的慧，将来修学大乘法参禅的时候，就可以把这个“知”，换成一个话头，可以直接参禅，就能明心。</p><p>原文：<strong>诸比丘。恰如熟练之辘驴匠或辘驴之弟子。或长转（辘驴）者。知我在长转。或短者。知我在短转。</strong></p><p>释：过去古代没有自来水，吃水要从地上打的非常深的水井里打出来，水井上有个摇绳的装置。绳子的一端挂上水桶，然后把绳子摇下去，从井里舀水上来，这个摇绳的装置就叫作辘驴。负责舀水的这个人，叫作辘驴匠，他在舀水时如果心静的话，就会清楚知道，他放了很长的绳子到井底，因为井水很深。</p><p>如果井水比较浅，离地面比较近，他放下去的绳子就短，这个他也清楚的知道，所摇的绳子的长短他都知道。我们修定观呼吸的时候也应该像辘驴匠一样，目前正在做什么心里都要知道，出入息的情况都知道，息的长短都知道，全身的状况都知道，身行止息下来都要知道，跟那个辘驴匠舀水时的专心一意是一样的。这是佛用来比喻观身行的方法。</p><p>原文：<strong>诸比丘。比丘如是在长入息者。知我在长入息。或长出息者。知我在长出息。短入息者。知我在短入息。短出息者。知我在短出息。</strong></p><p>释：这个修习方法就是呼吸比较长时，知道自己在长入息，在吸这口气的时候，很慢很慢，很细很细，时间很长，能达到十秒钟到半分钟或者一分钟，整个过程自己都清楚了知。这个吸气的时间长度，通过修习训练是能达到的，最后还能够停止呼吸，那就是四禅境界。然后在长出息时知道自己在长长的呼气，在呼出这口气的时候非常慢非常缓，有功底的人，他在呼吸时别人根本听不见呼吸声。没有功底的人，呼吸声音就很大，喘气很粗重，说明他没有禅定基础，心不静，色身上也有些障碍。入息短的时候应该很清楚的知道自己在短入息，出息短的时候，自己也清楚地知道在短出息。</p><p>原文：<strong>修习我觉知全身而入息。修习我觉知全身而出息。修习我止身行而入息。修习我止身行而出息。</strong></p><p>释：修习觉知全身而入息，在吸气的时候全身的运行状况自己都要知道，从头到脚，从里到外，自己全部都知道。定力强的时候，心缘广大而且深细，了知的范围就广大，了知的事理就深细。如果吸气时，不能觉知全身，说明自己定力还是不足，慧力也不够，致使心念不专一，心力不强，心缘不够广大。这里的专一与广大好像是矛盾的，其实并不矛盾，这时是把全身作为所缘的一个对象，当然需要的定力和慧力都要强，否则就不能做到这点。这是在一点点逐渐地增强定慧，使得心力强大，了别性强。</p><p>再修习觉知全身而出息，在呼出这口气的时候，对于全身的情况，心心念念也都要知道。从头到脚，从里到外，色身的所有状况自己都要知道，都要清楚。如果不清楚，说明自己的忆念还是不够集中，心力不强，定慧还没有训练好。如果在呼吸时，全身的状况都能清楚了，这个功夫不掉散，比较牢固了，就可以接着修习。</p><p>再往下修习止身行而入息，在吸气的时候，能清楚地知道，自己身体静下来了，从头到脚，从里到外，身体全部都寂静下来了，身体不摇晃了，眼睛不眨动了，头也不动了，胳膊和腿也不动了，呼吸也微细下来，气脉也动的微细，这些情况心里都要清楚了知。这是通过做功夫，念力集中，心不散乱，身行逐渐地微细下来，粗的妄动就消失了。细微的身行还是存在的，因为生命体活动必须有这些细微的身行，如果没有就入四禅了，否则就是死人。功夫牢固以后，继续用功。</p><p>再接着修习止身行而出息，呼气的时候，全身几乎都静止下来的状况，自己都要清楚了知，心不糊涂。如果不能了知，或者了知的不全面，说明定慧不够，心念还是有点散乱，不是昏沉就是在打妄想，定慧都不足。到这一步都修行好了，功夫牢固以后，再往下修习，否则就不要往下修习，直到这个步骤都修习圆满成功为止。</p><p>原文：<strong>如是。或于内身观身而住。又于外身观身而住。或于内外身观身而住。</strong></p><p>释：观行到以上这个阶段，按照以上的方法再接着观行内身。内身是指什么呢？有人说是身体内部，是与身体表面相对的。其实整个色身都属于内身，与周围的生活环境相对，与外界宇宙器世间相对。内身是指整个的色身，包括身体表面的皮肤，到身体里的肌肉、骨骼、五脏六腑、血液、骨髓、脑浆内脏等等。从头到脚，从里到外，都是属于内身。</p><p>而外身，就是在色身外边的一切六尘境界，包括外界的色声香味触，不属于身体之内。身有一个定义，称之为十八界，十八界都属于我们自己的五阴身。十八界包括什么？眼根、耳根、鼻根、舌根、身根、意根这个六根，前五根我们都能找得到，意根是心法；十八界还包括六尘，分别是色尘、声尘、香尘、味尘、触尘、法尘；还有六识，分别是眼识、耳识、鼻识、舌识、身识、意识。</p><p>什么是色尘呢？自己的身体是色尘，属于内身。身体之外，眼睛能看到的也都是色尘，由地水火风这四大组成的，属于外身。色尘包括我们眼前的身边的所有物质，一直到整个房间，房间之外的街道，街道之外整个城市，城市之外的整个省，省外的整个国家，国家之外整个地球，乃至地球之外的整个宇宙。一个三千大千世界是银河系，无数个三千大千世界，或者十方诸佛的国土，都属于色尘，也就是外色尘，也称为外身。虽然极大多数的色尘我们现在还看不见，接触不到，也仍然属于十八界当中的法，都属于色尘，与我们眼根相对应。这些都是属于外身，因此我们的外身是非常广阔的。</p><p>什么是声尘呢？我们身体内部有很多声音，比如肠胃的响动腹鸣，身体里气体运动、消化的声音；还有从身体里发出的声音，比如打嗝的声音、喘息的声音、耳鸣的声音、打喷嚏的声音、说话的声音等等，这些属于内身。身体外部也有各种声音，身体与各种物质碰撞、接触、摩擦的声音；其他众生发出的声音，有各种物体发出的声音，比如钟表；空气流动的声音，房间外的声音，大街上的声音，整个城市的声音，整个虚空中的声音，整个宇宙器世间发出的声音等等。这些都是声尘，而且是外声尘，不在身体内，属于外身。内外声尘都是属于我们十八界之内的，可见我们的外身是非常的广阔，虽然极大多数的声音我们暂时还听不到。</p><p>还有香尘，我们自己身体散发出来的各种气味是内香尘，属于内身。周围环境里的气味是外香尘，包括其他众生散发出来的气味，房间里的气味，房间外的气味，山河大地的气味，整个宇宙虚空的气味，都属于外香尘，也属于我们十八界之内，属于我们自己的外身。</p><p>味尘有内外味尘，口腔里没有食物时，舌根感觉到的味道，胃里散发出来的味尘，是内味尘，属于内身。有食物时，感觉到的食物的酸甜苦辣咸淡等等味道，是外味尘，与舌根相对，属于十八界之内的法，属于外身。</p><p>触尘，包括内触尘和外触尘。内触尘，是在我们身体之内的触，如：饥渴、冷热、温饱、疲乏、舒适、安逸等等，属于内身。外触尘是外界物质与色身的接触所产生出来的触尘，比如在忉利天顶上的太阳照到身上，对身体的触；在须弥山的半山腰，四天王天那里的月亮照射到身上，对身体的触；从虚空中来的冷热空气的对身体的触；各种物质对于身体的接触和撞击，有轻柔的触比如微风和服装的触，猛烈的触比如石头和重物，这些都是外触尘，属于外身。所以我们外触尘的范围也是非常的广大，但是我们现在大部分人的心念，还观行不到这么广阔的范围。</p><p>法尘，包括五尘上所显现出来的法处所摄色，以及意识心所处的独头境界，散乱心所了知的法尘，定境中的法尘，梦中的法尘。所谓的外身就是内六尘，因为我们根本见不到外六尘，接触不到外六尘，只能接触观察到第八识依外六尘所变现出来的内六尘，因此就把内六尘方便说为色身之外的外身。</p><p>十八界还有六识：眼识，耳识，鼻识，舌识，身识，意识。十八界组成了这个假我五阴，我们观五阴身的时候，要先观内身，再观外身，然后内身和外身再同时观，这个时候定力就非常好了。如果定力不好，只观行一样都不容易，因为散乱心不能同时观察到那么多的对相，不能观察全身从里到外，从头到脚，也不能观察到身外的一切法。修到这个程度，所具备的定慧是相当好的，都可以作为种子存到第八识中，来世就能得到受用。比如天生就能眼观六路耳听八方，天生就能一心多用，精力都相当的充沛，智慧相当的广大，不同凡响。</p><p>观行的时候，先从内身观起，身体内的色声香味触法都要观行到，全面而细致。功夫牢固，再观外身，观外面的色声香味触法，全面而细致。这步的功夫牢固了，然后再同时观内身和外身，里外一起观，全面而细致，所有的一切法都要观察到，尽量一念之间都要了知到。做到这点，定慧是极好的，心已经达到很微细了，甚至别人的心念都能感知到，可以具备未卜先知的能力。</p><p>我们的心掉散惯了，不是散乱就是昏沉回忆追悔。昏沉是脑子里昏昏沉沉的什么概念都没有，迷迷糊糊的不清楚，也叫愚痴，要不就是心里散乱，处处攀缘，杂七杂八的事情都在心里打转，不是回忆过去，就是思虑将来，从来不会安住在现前。当我们修定非常好的时候，心念集中，就可以同时观行我们身体内身、外身的各种状况，然后内外身同时都能观照到，都能清清楚楚的观察出来。观到这一步，整个我的概念就在心里形成，关于我的观念就很坚固。身体状况都清楚了，内心里就会有个我、有个身的观念。</p><p>原文：<strong>或于身观生法而住。又于身观灭法而住。又于身观生灭法而住。</strong></p><p>释：对于我们的身体，要观察生法，心里了知生法。生法就是原来没有，现在出现了，叫作生法。我们静坐到一定时间，身体会生起各种现象和觉受，包括轻安的觉受和疼痛的觉受，气脉运行起来以后，身体或者感觉轻飘飘的很舒服，或者腿开始发麻疼痛，或者手开始发麻发胀，或者内脏器官出现堵塞感觉疼痛或者畅通，或者出现腹鸣，或者身体变高变大，各种各样的状况都会出现，每个人出现的状况都会有所不同。在观行当中，这些状况内心里面都要清楚了知，知道身体新生出来的觉受是什么，现象是什么，又有什么变化，都要清明了知，不糊涂，这就是于身观生法而住。</p><p>再下一步，修习于身观灭法而住。灭法就是原来有的现象现在没有了消失了，比如气脉运行以后，粗重的呼吸没有了，呼吸变得细微；气脉原来鼓鼓的，动得很厉害，现在也舒缓下来，静静地运行；原来气脉通过时，有堵塞的地方感觉疼痛，现在气脉通过去，就不疼痛了；原来身体沉重，现在变得轻飘飘的；或者刚才身体轻飘飘的，现在突然变得沉重了。这些都是灭法，原来存在的现象现在消失了，这些都要清楚的了知。如果没有定力，或者定力不足，心里就不可能了知这些现象，也不能觉知到各种感受。</p><p>很多人没有定力，心思就粗燥，每天对自己身体状况都不清楚，连最粗重的喘息都感觉不到。平时心识繁乱，打妄想很严重的时候，根本就不知道自己在打妄想，不能反观到自心。不知道自己在打妄想的时候，正是妄想最多最乱的时候，心太粗糙了，根本没有反观的能力。如果心稍微静下来，就能反观自己，知道自己在打妄想，也能了解自己的心思，是善是不善，就会呵责自己。之前心粗、散乱、昏沉，就不知道自己在打妄想。现在心细致了，有定力了，就能发现很多原来不知道的事情，会越来越了解自己了。</p><p>之后，修习于身观生灭法而住。身体当中什么法出生，同时什么法灭去，一切的生生灭灭现象，内心里都要清楚了知，也就是身体当中的各种生灭变化的现象都要清楚了知，这样定慧就能同时得到了增进。身体当中的生灭现象都能了知到，心里的我的观念就形成了。</p><p>原文：<strong>尚又对于智识所成及忆念所成。皆会有身之思念现前。彼当无所依而住。且亦不执着世间之任何物而住。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：这样都观行完之后，自己的头脑、思想观念里，就会全都是自己的身体，全部心思都是自己的身体，心里都在念着自己的身体，没有停歇。色身的观念牢牢地占据了整个心思，下一步就要用智慧观照，把这个有关色身的观念灭除，内心达到清静无为，心无所住。</p><p>内心不要再依着自己的色身而住，心里不要再有身体的观念，把这个观念要泯灭掉，空掉对色身的感受和认知，空去色身我的观念，然后就能断身我见。或者能入到定中，欲界定或者色界定就会生起来了。只要心里还有个身体的念想，那就不能入到深定中。且亦不执着世间之任何物而住，不仅是不要有身体的观念，其他的观念也都不要有。世间里一切事物的观念思想，都要排除，都不要有，内心里要空，再空，连空也空，一法都不要有，空空净净，洒洒落落。到这一步，就是另外一种田园风光，离断我见就不远了，甚至就能直接断我见了。</p><p>这个方法虽然是小乘的修法，跟大乘的参禅并不一样，但这也是大乘参禅的基础。我们平时散乱惯了，要达到这种境界很不容易，一旦达到了，生生世世就会受益，所以应该好好修习。同样的修法，男众的散乱心相对比较少，心里惦念的事情就少，修定就相对容易和快速。女众的心里散乱得就严重，攀缘惦记的事情比较多，要做到这些就要相对困难一点。应该用智慧思惟，提起正念，认识到心里所惦念的事情，都是无意义的，内心做到放开，就能摆掉一些事情的缠绕，修定就能快速一些，智慧心也就容易生起。</p></div>"
},{
    "title": "第二章 （二）观色身的行住坐卧",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>二、观色身的行住坐卧</strong></p><p>原文：<strong>复次。诸比丘。比丘于行者。知我在行。又于住者。知我在住。于坐者。知我在坐。于卧者。知我在卧。又此身置于如何之状态。亦如其状态而知之。</strong></p><p>释：观呼吸的修习，功夫达到纯熟，心念已经能时刻集中，不再散乱昏沉以后，就开始修习训练动中的定慧。这个难度会增大一些，观行时需要更强的定和慧，需要心念的观照力更强，照顾的更全面。</p><p>在行走运动中观行，心里时刻要知我在行走运动。行是动转，不寂止，是指身体的走动、运转、活动的意思，是指身体没有静止的状态。自己的身体无论是在走路，还是在作其他的事情，心念都要反观到，都要觉知到，不要给自己留下心念散乱攀缘的空间。比如从家里走到外面，从一个房间走到另一个房间，或者走到大街上，走在上班的路上，或者在做一些工作和杂事，或者与人谈话，这些活动自己心里都要清楚的知道：我在行，我目前正在做什么。这样心念就被拴在目前所作的事情上，心念专一，心就会定下来了，了别的智慧就得到增进，看问题就清楚，思惟就细密。</p><p>身体活动当中的定慧修习训练好了以后，就往下修习身体止住时的定慧，又于住者，知我在住。住就是停留、停止的意思，身体在站立着，倚靠着没有动，处于静止状态。这个时候心里也都要知道，心不能散乱打妄想，把心念都要拴在当前自己的色身上，不缘于他物、他事。身体在不做事情的时候，心念也要专一，不给自己乱想的机会。</p><p>在坐着的时候要知我在坐，自己在盘腿静坐，在散乱坐着，心里也要知道，心念只缘色身当下的状态，不妄想其它。身体在躺着的时候也要知道我在躺着，自己在躺卧着，右胁卧，或者是左胁卧，以及其它姿势的卧，心里都要清楚了知。这些状态心里都要清楚知道，如果不知道就说明心里在昏沉，或者是心念不专，在打妄想。心思散乱的人总是一问三不知，昏昏沉沉的人，你要问他什么事，也是一问三不知，无定就无慧的缘故。</p><p>此身置于如何之状态，亦如其状态而知之。不管身体处于什么状态，行走坐卧也好，语笑动默也好，疼痛疲乏、舒适轻安也好，心里都要知道。内心要非常的清明，既不散乱也不昏沉，明明了了。对于身体的任何状态都清楚，比如身体是晃动的，还是静止的，腿是动来动去的，还是盘着的，腰是弯的，还是挺直的，这些状态都要知道。</p><p>原文：<strong>如是。或于内身。观身而住。于外身。观身而住。又于内外身。观身而住。</strong></p><p>释：做到以上这些以后，就要观内身，整个色身的状况，自己都清楚，全部心念也要住在这上面。内身从五脏六腑、肌肉、骨骼到外表的皮肤、五官，从头到脚心里都要知道。然后又于外身观身而住，外身就是指色声香味触法，比如眼见的色尘、耳听到的声音、周围出现的气味、口腔里的味尘、身上的触尘、心里的法尘等等，这些法内心都要知道。又于内外身观身而住，内身和外身的状况，心里同时都要知道。如果没有定力，慧力就不足，只能知道其中一样两样事情，其它就不清楚了。</p><p>当训练到这个内身、外身都能清楚了知的程度时，一心就可以多用。比如说正在做一件事情，同时可以眼观六路耳听八方，都能做的很好，定力相当好，精力相当旺盛。如果没有定力，就连一件事情都可能做不好。我们如果能修好禅定，生生世世都会受益。比如说一个人非常聪明，很会察言观色，很多事情一看就知道，别人的心理状况他能掌握，这就是有定力的表现。他在做一件事，其他的事情也能同时照顾到，四通八达，精力十足。</p><p>如果有人兴趣广泛，有可能是精力旺盛，也有可能是心思散乱。要看他做事的结果，如果同时几件事情都做好了，说明他有定力，慧力也很强。举个例子来说，上学的时候，有些学生上课听老师讲课，同时还偷偷看课外书，旁边同学的小动作也知道，教室外面的情况也清楚，老师提问还能回答，每样事情都能做得很好，效率又很高。他用了不到一半的精力就能把学习搞好，这说明这个学生有定力又有慧力。</p><p>有些学生竖起耳朵听老师讲课，好像注意力很集中的样子，却不知道老师在讲什么，也不能理解老师所讲的内容。他是一边听课，心里还装着其他的事情，自己还不一定知道，这样他听课就有很多的障碍，昏沉和散乱都有。作业做几个小时，完成的也不好，他也没干别的什么事，这就说明这个学生既没有定力，也没有慧力。</p><p>有人就会说，这孩子天生学习就不好。其实就是前世没有训练过定力和慧力，加上对所学内容不感兴趣，今世业种现前，学习就是这个样子。如果一个人定力不好，精力不集中，慧力不好，就处理不好事情，所以有定才能有慧。如果一个人现在心里非常散乱，正在生气，或者正在着急，这个时候，考虑问题就不容易考虑清楚明白。如果精力非常集中，事情就很容易思考明白，很快就知道该做如何处理，慧力就显现出来。</p><p>原文：<strong>或于身观生法而住。于身观灭法而住。又于身观生灭法而住。</strong></p><p>释：于身观生法而住，在我们行住坐卧当中，当身体出现新的状况，或者身体感觉轻安，或者身体感觉疲乏，或者内脏器官发生变化，或者皮肤发生了变化，凡是原来没有的，现在出现了，自己都要知道。于身观灭法而住，原来身体上的现象，现在消失没有了，都要观察到。比如身体上某部分有痛觉，或者有病患不适，现在消失了，自己都要知道。又于身观生灭法而住，身体上什么现象生起了，什么现象灭掉了，都要观察到，心里同时都要了知清楚，这个心思就很细密。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有身之思念现前。彼当无所依而住。且亦不执着世间任何物而住。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：这样修行观察以后，自己现在的意识中全都是这个身体，都是这个我，心心念念都是个我，那么关于色身的观念就牢固形成了。最后还要把这个心念泯灭、消除掉，内心要空静下来，把身体从心念当中排除出去，空却自我，这样就会入到深定中，心不着我。</p><p>现在即认可色身是空的，色身不是我，但心里也不执着世间的任何物，就这样内心空空地安住着，心要无所依而住，任何相都不要着。把身体观念排出去以后，心里也不要着任何其他的事物。假如这个时候心里是贪恋着金银珠宝，那就没修好，心中还有物，不空净。修习到后来，心里都要空掉一切法，色身不是我，世间任何物也都不是我，不是我所有的，一切法全部都要淡化、空掉。这样入定就深了，执着贪欲都会减少，或者消失，内心既不贪着色身，也不贪着任何物。</p><p>以上就是于身观身而住，我们心里不再认可这个身体，不要认为身体就是我，因为身体有各种生灭变化，它不是我。我们一旦有了身体不是我的这个观念，就容易忘身。忘身就能得定，断身见，还能断我见，我们要这样去用功。如果内心有很多妄想，这个道理就思惟不透彻、不清楚。所以我们想要有智慧，一定是定在前，修好禅定，有定就能引生智慧出现。</p><p>原文：<strong>复次。诸比丘。比丘不论行往归来。亦由于正智而作。彼观前顾后。亦由于正智而作。彼于屈于伸。亦由正智而作。</strong></p><p>释：世尊告戒诸比丘：你们不论行往他方，还是从外归来，内心都要有正智正念，知自己目前在做什么，心不散乱和失念，不昏沉不掉举，由于正智而作。你们无论是看向前方还是瞻视后方，心里都要清清楚楚的知道自己在做什么，既不昏沉，也不散乱，也要具足正智正念，由于正智而作。你们无论是弯腰还是伸直身体，不管身体是什么姿态，心里都要清明了知，清清楚楚知道自己在做什么，不昏沉不掉举，具足正智正念，一切都是由于正智而作。</p><p>无论一天当中做些什么事，都要有正知正念，心不昏沉，也不散乱，清明了知目前所作的一切事情，有定有慧。比如我们出去办事，办完又回来，整个这个过程也是由于正智而作，内心清清楚楚，既不散乱，也不昏沉，做什么事情都一清二楚，心念清明，了了灵知。看眼前或者看身体后面，不管看什么，前顾后看，左右瞻视，心念都要清楚明白。</p><p>原文：<strong>彼于着僧伽梨（袈裟）衣钵。亦由于正智而作。彼于食饮咀嚼尝味。亦由于正智而作。彼于大小便。亦由于正智而作。彼于行住坐卧醒语默。亦由于正智而作。</strong></p><p>释：佛说，比丘们，你们穿上袈裟，手托着钵，也要正心正意，清楚的了知自己在托钵乞食，心不散乱掉举，这些事都是由正智正念而作。出家人出去托钵乞食时，要穿上三衣，拿着钵出去乞食。比丘的穿衣拿钵，也要由正智而作，不是稀里糊涂，昏昏沉沉的，而是有定有慧，内心清明，正知正念而作。那么我们出门办事，与人打交道，也要正知正念，清清楚楚地做好每件事情，心不糊涂。</p><p>托钵乞食回来以后，在吃饭、喝水、咀嚼、尝味等等日常琐事当中也都要正知正念，清清明明地来完成，心不掉举。就连如厕大小便时也要正智正念，了知自己目前所作，心不散乱。比丘们在走路、站立、坐着、躺着、醒来、说话、沉默的时候，都要清楚知道自己在做什么，目前的状态是什么，正智正念，不散乱不昏沉。</p><p>那就是说，除了睡着以后心里不能了知了，其余的时候全部都要正知正念、清清明明、了了灵知。如果内心不是清明了知的，原因有两个：一个是昏沉，一个是散乱。定力提高，心念就会集中到眼前所做的事，周围的事情都会知道。整个色身的状况，乃至外身的状况，周围一切情况，都能清清楚楚，明明了了。</p><p>要做到心不乱想是很不容易的，如果修习训练得好，定力就会相当好，慧力也就相当好，看书和思惟法义的时候，很容易就能思惟通达。否则读佛经就很难读懂，一边读一边打妄想，读多少遍也不能明白其中真正内涵。或者跟别人交流时，意念不集中，心思散乱，人家表达的意思听不明白，自己的观点也阐述不明白。如果内心静到一定程度，别人一个表情或一个动作，自己就会知道对方的目的，想要干什么，甚至对方自己都不知道，你就先知道了。</p><p>世尊在这段经文中是在教我们动中定、动中禅，这也是大乘参禅的基础。我们如果有这个基础，再把这个知身各种状况的知，换成一个话头就可以参禅。像参话头、参公案，参到后来只剩下一个话头的内涵，整个话头浓缩成一个点、一个知，用心念带着，深深地悬在心里，细细地参究，就能明心见性。所以这个方法虽然是小乘修法，但也通大乘的参禅，大小乘的修法到最后也都是相通的，任何禅定也是相通的，并不是对立和矛盾。</p><p>原文：<strong>如是。或于内身观身而住。于外身观身而住。又于内外身观身而住。</strong></p><p>释：这个地方的修习方法与上边讲的观呼吸的方法是一样的，都是让我们在行住坐卧当中，观照色身，身体的各种状况都要知道，自己的外身，六尘的境界也要知道。这个定力要求更高，观照力也更强，将来就能有眼观六路耳听八方的定慧。如果定慧不足，只顾着观身体，那边来了车也不知道，出现了其它情况也不知道，说明慧力还是不够广大。定力如果足够好，在观自身的同时，那边来了车就知道，就能躲避开，四面八方的人事物都知道，就能同时处理很多的事情。定力如果不好，只做一件事，都可能做不好。</p><p>原文：<strong>或于身观生法而住。或于身观灭法而住。又于身观生灭法而住。尚又智识所成。及忆念所成。皆会有身之思念现前。彼当无所依而住。且不执着世间任何物而住。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：这个修习方法都如上文，在行住坐卧中，身体当中生起了新的现象，要了知，身体当中某种现象消失了，也要了知，身体当中同时生起和灭去的现象都要了知，一法也不糊涂，不含糊就能清清明明，明明了了。</p><p>身体当中的各种生灭法观行完了以后，心念里就会都是这个色身我，思想里都是这个身体。最后要把这个身体是我的观念泯灭，思想中不要再有我这个身体。心念要空，内心既不依赖色身而安住，也不依赖任何法而安住，空空净净，无一法在心。这样就能空却这个身我，不认这个身体为我，就会入到一种空定中，在定中已经没有身的观念，就能断除身我见。这就是于身观身而住的修持方法，应该仔细修行。</p></div>"
},{
    "title": "第二章 （三）观色身不净",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>三、观色身不净</strong></p><p>原文：<strong>复次诸比丘。比丘于皮覆包。充满种种不净物之此身。观察此身上至头发。下至蹠底。知于此身有发髦爪齿。皮肉筋骨。髓肾脏心脏。肝脏肋膜。脾脏肺肠肠间膜。胃排泄物胆汁。痰脓血汗。脂肪泪淋巴液。唾液粘液。关节液尿。</strong>　</p><p>释：这段经文是修行观身不净法的关键，世尊讲的比较细致，我们就能随文入观，观行得细致一些。佛说我们的身体是由皮肤包裹着，皮肤里充满了种种的不净物。观察这个身体，从头发一直下到脚板底骨，知道有头发、汗毛、眉毛、手、脚、牙齿、皮肤、肉、筋、骨头、骨髓、肾脏、心脏、肝脏、肋膜、脾脏、肺、肠、肠间膜、胃、排泄物、胆汁、痰、脓、血、汗、脂肪、眼泪、淋巴液、唾液、粘液、关节液、尿液等等。</p><p>这些物件，除了头发，都是表皮包裹着的，表皮好像很干净，所包裹之物却是非常的肮脏不净，都是各种的腥味儿、臭味儿，血气粘液充满，模糊一片。单独拿出来，或者把皮拨开，任何人都会嫌弃生厌。这些不净物就组成了我们的色身，这么肮脏的色身，众生却贪执不舍，实在是愚痴。</p><p>原文：<strong>诸比丘。犹如两口之袋。填进种种谷物。即稻粳绿豆。豆颗胡麻糙米。其眼者开解之。得观察。此是稻。此是粳。此是绿豆。此是豆颗。此是胡麻。此是糙米。</strong></p><p>释：诸比丘，里面在装满了上述这些物件的色身，犹如开着两个口的袋子，好多好多的谷物都装在这个袋子里，当我们把袋子打开一看，一样一样的数出来，这个是水稻，这个是粳米，这个是绿豆，这个是豆颗，这个是胡麻，这个是糙米，用眼睛一看就知道了都有什么豆子。同样的道理，当我们把身体打开，皮剥开，就知道了身体里都有些什么，一样一样都可以数出来，观察出来。</p><p>我们这个色身就像一个袋子，把两个口扎上，里面装进了种种物，脑顶是个封口，脚底是个封口，外面是皮，里面就是各种物件。皮肤剥开以后，里面是血肉、各种液体、内脏、骨髓等等这些东西，观身不净就可以从皮肤表面开始观。如果拿显微镜来观察我们的皮肤，会发现皮肤表面全都是细菌。眼睛里有细菌，眼泪里有细菌，鼻涕、唾液，皮肤的各个表面全都是细菌。每个部位的细菌，形状大小、数量都不一样。</p><p>有一种禅观就是专门观察身上这些细菌虫子而断身见我见的，这些细菌有三头六臂的，有五颜六色的，有张牙舞爪的，非常的狰狞可怕。它们互相厮杀，厮杀完了，数量种类就不平衡，我们就会生病，皮肤病或者胃肠病等等，都是因为细菌的数量、种类不平衡导致的。如果我们感觉饿了，也是细菌在闹着要吃，如果我们有欲念生起来，也是由于这些细菌搅扰的结果。我们吃进胃里的饮食，全靠细菌来分解消化。食物下到胃里，细菌把食物弄碎了，成了泥状，身体才能吸收一部分，进入血液里。我们得依靠着这些细菌，细菌也得依靠我们生存。说明众生就是依靠细菌而活命，细菌依靠众生的色身而活命。</p><p>这些都是佛说的，佛眼比显微镜还要微细无量倍，所以能看到这些细菌。空气中也有细菌，任何地方都有细菌，这些细菌将来也能成佛，它们也是众生，有意识心有意根也有如来藏。假如生病时吃药，这个药一开始吃时管用，能够治病，吃的时间长了就不管用了，病不能治好。为什么这样呢？因为吃药是让细菌吃的，这些细菌吃了以后，就知道这个药不好，以后就不吃了，我们吃同样的药就没有作用了，可见细菌也有识心分别。</p><p>我们观察皮肤表面是非常的肮脏，再往里仔细观察，血液里、肌肉里、筋、骨头、骨髓里都是细菌，各种粘液里也有细菌，身体里面也是非常的肮脏，这样如实细致的来观察色身，慢慢就不会再贪恋身体了。假如看到了一个美女，我们从她的皮肤开始观照，皮肤表面的那些细菌，观照完了把皮剥开，观照里面那些不净的状况，从里到外散发出来的所有味道，都是很腥臭，令人恶心的，没有一处是干净的。后面还会讲到，一个美女死了以后，几天身体就会膨胀、淤青，颜色变了，形状变了，然后流脓，再以后自己想象吧。</p><p>所以我们贪著的色身，其实是非常肮脏不净的。比如我们吃的饮食，是从土里生长出来的，土里是什么都有，洗得再干净也是肮脏的。我们吃的东西，咀嚼几口再吐出来，看看是什么状态，或者咽到胃里的食物，呕吐出来，看看是什么状态，闻闻是什么味道。所以古来大德说，我们的身体就是移动厕所，是粪袋子，也叫臭皮囊。细想起来，这个身体本身，或者吃的饮食，都没有什么好贪爱的。</p><p>原文：<strong>诸比丘。比丘如是于皮覆包。充满种种不净物之此身。观察上至头发下至蹠底。知于此身。有发髦爪齿。皮肉筋骨髓。肾脏心脏肝脏。肋膜脾脏。肺肠肠间膜。胃排泄物胆汁。痰脓血汗。脂肪泪淋巴液。唾液粘液。关节液尿。</strong></p><p>释：这段经文教我们继续观察色身的不净，从头顶一直观察到脚底。这个身体有头发和身毛，头发和毛干净吗？都有细菌和污垢，是不干净的。有爪，过去把手叫作爪，手指甲是不干净的，整个手也不干净，哪怕用肥皂搓洗，还有细菌洗不掉的。接下来观察牙齿，观察皮肤，观察肉，观察肉里的筋，观察骨头，观察骨髓，再观察内脏，肾脏、心脏、肝脏等等，没有哪个地方没有细菌，都是不干净的。身体表面哪怕抹上香水，也是不干净，有臭味的，更不用说把皮肤剥开，散发出来的那种血腥气味和臭味。</p><p>如果真正知道身体是如此的污秽肮脏，就不会再去喜欢贪爱这个身体了。身体就像是一个绣花枕头，外表看起来好像还像点样子，里面装的却都是肮脏的东西。有肾脏、心脏、肝脏、肋膜、脾脏、肺、肠、肠间膜、胃、排泄物、胆汁、痰、脓、血、汗、脂肪、眼泪、淋巴液、唾腋、粘液、关节液、尿液，没有一样是干净的。我们观察来观察去，就会对自己的色身生起厌离心，就会觉得这个身体没有什么意思，就不会太在意色身，不会再贪恋色身了。</p><p>原文：<strong>如是。或于内身观身而住。于外身观身而住。又于内外身观身而住。或于身观生法而住。于身观灭法而住。又于身观生灭法而住。尚又智识所成及忆念所成。皆会有身之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：像以上所介绍的色身内之物，我们就要细致地来观察，先观色身上的生法，色身在逐渐地长什么东西，比如说指甲生头发长，皮肤长出的脓包，内脏器官里的囊肿和结石等等各种疾病的生成。然后再观察色身上的灭法，什么东西从身体当中消失了，比如说内脏器官的移除摘除，各种疾病的消失、灭去等等。然后再同时观察色身的生法和灭法。</p><p>这些都观行完成以后，内心里都是色身这个我。智识就是意识心有智慧，不糊涂不愚痴，就叫作智识，如果观完了，什么都不知道，稀里糊涂的就不叫智识，那叫愚痴。忆念就是回忆、回想，心中有念头、有觉观。观行完成以后，内心里都是色身我，整个思想里全都是身体我。彼当无所依而住，意思是说，最后我们的思想念头就不要住在这个色身上，心中要排空这个色身我的观念，把身体我的观念清除掉，空掉这个色身。这个色身是如此肮脏不净，是苦的，是无常变异的，因此不是我。所以要亡身，才能进入一种空定当中，就能断身我见。</p><p>且不执着世间任何物，除了身体不再执著以外，其他的任何事物，内心也不要住着、想着，不要贪着，不要执著，全部都空却，这些都不是真实的。如果连身体都不是我，身外之物就更加不是我。我们现在还不能认可这个观念，要等到真正观行完成，智慧具足时，其他的见道条件也都具足时，心念就能转变过来，就能真正的断身见、断我见，三缚结也断，再也不会堕入三恶道。</p><p>要认可这个理是很难的，现在只是意识心知道，比较肤浅，意根还没有认可，还没达到那种觉悟的程度。一旦达到了，意根认可，身心状态就会全部改变，心念就会转变过来，颠倒过来。意识心肤浅的知，没有太大的力度，如果意根不认可，一旦做起事情来，意根仍然会按照自己从前的认知和理念作决定，就把这个观念忘了，不会按照意识的肤浅认识来作抉择。因为平时做事不是意识心作决定，是深层次的意根作决定。</p><p>比如说答应布施给别人一百元钱，这种想法不是从心底往外发出来的，虽然口头答应了，只是意识心觉得我应该给别人一百元钱，意根不是非常情愿，不懂得给人一百元钱有什么好处，拿钱的时候心里就会有贪吝。所以，我们学习佛法，要经常的作思惟分析，越深细越好，用意识心来劝导意根，多熏习意根，意根明理了，慢慢就会认可意识的所有思想观念，就会听从意识的想法、看法，二者步调一致。</p><p>观身不净这个法，要常常深细全面的思惟，不要认为说我知道了，那很简单，就是那样的，于是就不屑于思惟。因为不思惟，意根就不懂，意根所了知的六尘法都是来自于六识的信息，意识如果不分析，意根就得不到相应的信息，也就不了解真实的道理，那就只有按照自己的习气来作决定。我们懂得是谁作主这个道理，意识就要常常思惟正确的佛法，以此来熏染意根，意根明理了就能改变自己。</p><p>以上讲的所有内容就是于身观身而住，四念处观的观身不净就讲完了。观身从观呼吸开始，出息入息都要知道，长呼吸短呼吸都要知道。呼吸时身体的状况要清楚，长呼吸时全身的状况都要清楚，身体当中生起来的法要知道，灭去的法也要知道，一切生灭的法都要知道，身内的法，身外的法都要知道，色身如何的不净也要观行到。当观行完成，心中色身的观念牢固时，就空掉色身，去掉身体为我、为真实的观念，心念要空，不仅要空掉色身，也要空掉一切法，任何法都不要执著，这样就能断得身见和我见了。</p></div>"
},{
    "title": "第二章 （四）观地水火风",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>四、观地水火风</strong></p><p>原文：<strong>复次诸比丘。比丘从界（要素）。如存在。如志向。而观察此身。即知此身中。有地界水界火界风界。</strong></p><p>释：佛说诸比丘们，我们要从以下方面来观察这个色身，从组成色身的元素上来观察色身；从色身存在的现实情况来观察色身；从色身的趣向、最后的结局归宿上来观察色身。界也叫要素，就是四大元素的功能界限、功能差别，比如地水火风四大种子，就是四个要素，就是四种界限，这些要素的功能差别不同，界限不同，属性不同，性质不同。</p><p>地界的性质是坚硬性，水界的性质是湿润性，火界是暖性，风界是飘动性。这四个要素，属性截然不同，之间是有界限区分的。四大元素，是组成色身的基本元素，从这里开始着眼观察色身，就能了解色身的组成结构，就会明白色身是虚幻的，是苦的，是无常的。</p><p>存在，就是我们生命体当前存在的状态，现前能观察到的部分，地水火风组成了身体的从上到下、从里到外的各个部分，包括固态和液态的所有物质。现前观察了以后，就知道我们色身当中的所有物质，从头到脚，从外到里，都是由地界、水界、火界、风界四大元素组成。色身无论皮肤以及内脏器官，无论坚硬的骨鄂还是各种流动的液体，都是由这四大种子和合而组成的。地界是坚硬性的，如果我们身体中没有坚硬性的地大，那我们就不能站立了。既不能站立，也不能行走坐卧，就像一滩泥一样，因为身体得不到支撑的缘故。</p><p>身体中有水界，水界就是湿润性，没有湿润性身体干巴的就像木乃伊，也就不能保持生命的存在了。身体里有火界，火界就是暖度温度，只要是众生活着，身体就有暖度，从身体五脏六腑到皮肤到表面都有暖度，从头到脚都有温度。风界具有飘动性、流动性。如果我们身体里没有风，就不能呼吸，血液也不能循环，饮食也不能消化了，身体的各种运转活动就是靠风力的作用。四大不是独立起用，而是共同的组成了身体的各个部分，组成了身体的肌肉、骨骼、内脏器官，只是各个部分所需的四大比例不一样。</p><p>身体当中每一部分物质，都有四大元素组成，四大和合在一起形成的比例成分不同，组成的物质属性就不同。如果地性多，物质的属性就与地的坚硬性接近。骨骼是最坚硬的，那是地大的成分多一些，物质就显出坚硬性了。但是骨骼里也有水大的成分，骨骼里如果没有水的成分，骨骼就是干燥的，没有润滑性，就会容易折断。骨骼不仅有水的成分，而且还有火大的成分，所以骨骼是温热的，活着的时候骨骼是有温度的，骨骼里也有风，血液骨髓会在里流动。</p><p>组成物质色法的还有空界，在这里没有说，佛经里往往是用四大来代表地水火风空五大，而不特意提个空大，除非强调空大作用的时候，才讲空大。因为有空大的参与，其比例成分的多少，组成的物质密度和结构也就不同，物质的坚硬性也就不同。空大成分多，当然地大成分就相应的少了，物质就稀松，反之，物质密度大就坚硬。骨骼里也有空隙，如果骨头里没有空隙，血液就不能通过骨骼，风也就不能通过骨骼，有些人也就不能得风湿病。</p><p>人老时骨质疏松，骨头就变得易脆，就是因为地大和水大的营养物质变少，钙质缺少了，而空大的成分增多一些。补钙以后，如来藏就吸收钙质的养分，然后变现骨骼，骨头的密度就会增大，不易折了，说明骨骼里还是有空界，地水火风空五大具足。肌肉里有地大、水大、火大、风大四大元素，其中地大占的比例成分还是多些，相对骨骼里的地大成分来说是稍微少一些。还有筋，筋也是地大成分占的多一些。再往里是内脏器官，内脏里也有地大和水大，有火大，也有风大和空大。</p><p>再有就是血液、骨髓、脑浆、汗液、尿液等等这些液体部分，其中水界的成分占的多，地界成分占的比例就少。液态水里有杂质，那其中不仅有水大，也含有地大。水有流动性，就有风大。水有一定的温度，就有火大，火大越少，水越凉，到最后就完全结成冰。结冰以后，火大、风大的成分越来越少，变得微乎其微。物质都是由地水火风四大种子按照不同的比例、不同的成分组合到一起形成的，所以物质叫作色法，色法就是由地水火风四大种子组成的。</p><p>四大种子存在如来藏里，如来藏随着外界的各种因缘，不断地把四大种子输送出来，就会不断地形成和改变着各种物质的组成成分，于是我们的色身就随时随地发生变化。色身随时随地的改变，就说明了如来藏在随时随地为色身输送四大种子，每一时刻输送的四大比例成分会有差异，四大会有变化，那么我们的身体就会发生变化。</p><p>我们的身体刹那刹那地都要发生变化，因为如来藏要刹那刹那输出四大种子，前一刹那和后一刹那输出的四大元素有差异，身体就会一点点地出现变异。所以身体每天都在发生变化，刚才还好好的，一会某个部位就疼痛起来，或者出现一个特殊的状况。这就是四大不调和了，如来藏改变了四大元素的结构，色身就出现了违和。</p><p>有时出现违和的色身还会好转，色身越来越强健，这是如来藏又把四大元素作了调整。所以我们的色身状态不是一成不变的，而是刹那刹那在变化着。我们吃进去的饮食不同，业缘不同，如来藏摄取的养分不同，细胞新陈代谢就不同，身体就会不断发生变化。从出生，到长大成人，再一点点衰老，最后就散坏死亡了。</p><p>色身刹那刹那变化，如来藏刹那刹那输送种子来维护色身，障缘出现时，身体就要生病。如来藏摄取和输送的四大元素出现差异，四大就会违和，身体就异常，出现病状。色身是依各种缘而出现和变化的，如吃的饮食不同，外界的触尘不同，心境的不同，禅定的不同，业缘的不同，身体就会发生不同的变化。这些都是由于四大元素的变化，造成了色身发生改变。从这些方面来观察，就知道了我们的色身里有地界，有水界，有火界，有风界。</p><p>原文：<strong>诸比丘。犹如熟练之屠牛者。或屠牛者弟子之杀牛。于四衢道。片片分解已犹如坐。</strong></p><p>释：世尊说个比喻，来教导我们如何观察色身的组合性，色身的虚妄无常性。我们把色身分解成四大元素，从中分出地界、水界、火界、风界。这样的分解，就像一个杀牛的人，或者杀牛人的弟子，他们杀牛时的时候，为了方便出卖，就在四面八方的街道上杀牛。把牛杀死以后，再把牛的身体一片一片的都切割开了，然后就当场叫卖。杀牛人可能要先割断牛的咽喉，再刺牛的心脏，把牛杀死以后再解剖。皮剥下来，肉剔下来，内脏拿出来，各种内脏都分开，血液也先都放出来，只剩下骨头，片片分解了以后，就在街道各处叫卖。</p><p>原文：<strong>诸比丘。如是比丘。从界如存在。如志向。而观察此身。知此身有地界水界火界风界。</strong></p><p>释：我们观察自己的色身时，也要像杀牛人那样，把我们身体分解开来观察，不仅分解成一片一片的，最后还分解成地水火风四大要界。观察自己的身体从头到脚，身体里各个组织结构都分解开，最后再分成地大、水大、风大、火大，分解成地水火风四大种子，回归到色身出生之前的原始状态。从内脏器官，到骨骼、肌肉、皮肤，我们一样一样来观察，都是由地水火风四大要界组成的，抽掉一界，那个身体就散坏了。</p><p>身体当中缺少地界不行，缺少水界不行，缺少火界不行，缺少风界不行，风大出现异常，呼吸就有障碍，就会得风病，或者是哮喘、风湿之类的；有关水大的病有囊肿、风湿病、皮肤病等等，水大不调有很多疾病；火大不调，身体就会出现发冷发热的现象，发烧、体寒，这都是火大不调的症状；地大不调，身体就会出现这疼痛、那疼痛，身体无力疲乏，骨质疏松，弯腰驼背，出现骨折等等。这些疾病都是地水火风不调和引起的，四大比例成分发生改变，我们的色身就发生变化。</p><p>观察我们的内脏器官，一个一个地分解，分解成固态的和液态的两部分来观察，再分解成最小的细胞来观察，最后，再把细胞分解成地水火风四大元素。最后就知道了，身体每一部分都由四大元素组成。那么由这些元素组成的色身，是不是真实法呢？各种元素组成的物质色法是不是真实法呢？</p><p>我们可以观察面前的桌椅，桌椅是由木头、钉子、铁器组合而成的，如果木头板片掉了，或者毁坏了，钉子散落了，桌子椅子还存在吗？剩下的散落物，是不是桌椅呢？这个桌椅是不是表面存在的一个假象呢？实质是不是组合成的虚像，是空的呢？我们的色身也如此，由地水火风四大合而成，四大一分解，还有色身吗？当然就没有了。所以色身是表面看起来存在的一种幻像，并不真实，没有实质，色身就不是真实不变的我。</p><p>命终的时候，地水火风四大一分解，分解了以后，色身就散坏了，这个色身就变成了尸体。临命终地水火风分解的时候，身体觉受是非常的痛苦。 佛说众生命终四大分解，就如活着的乌龟活活地剥皮一样痛苦，活活的把乌龟的甲壳剥开，那是非常痛苦的。我们如果不做纯善业，死的时候，地水火风四大一分解，也是非常痛苦的。</p><p>色身分解以后，地水火风四大元素哪里去了呢？又回到如来藏里了。因为四大是从如来藏里出来的，种子还会回到如来藏里，回去以后那些种子还会再输送出来，再变出下一世的色身。如来藏里的四大种子虽然是无量数之多，但是数量也是固定的，不是无穷尽地增多和产生出来。这些数量极多的种子，会同时输送出来，形成色身，形成六尘，形成宇宙器世间。这些种子从哪里来还会回到哪里去，刹那输出来，再刹那回到如来藏里。种子不会无缘无故就消失没有了，也不会无缘无故就新生种子，本有种子不生故。</p><p>众生四大分解以后，就死亡了，如来藏会随意根的贪执，再生出一个中阴身。中阴身是非常非常微细的物质，由四大极微组成，有漂动性。因为中阴身不是太实质的物质，所以就没有遮障，具有小五通，身体可以灵活地四处飘动，不受区域的限制。所以地水火风四大分解时，色身就散坏，那个身体就成为尸体，慢慢就会消失不见了。</p><p>我们看看这个组合起来的、有生有灭的色身，是不是真实的我呢？真实我的概念是什么？真实的我是不变化的，不是无常的，不是变来变去的，不是有生有灭的，不是组合成的，不是苦的。所以这个四大组成的我不是真实的，我们就不要再把这个组合成的色身当做我，那就是地水火风四大种子组成的一个假壳子而已，是一种假相，假相蒙骗了我们的识心，让识心觉得它是我，是真实的，有真实的作用，其实都不是。观察色身的无常性、生灭性、不净性、组合性就知道它是空的、幻化的、暂时而有的。这样慢慢观察以后，就能断身见，把色身不是我的观念牢牢的置在意识心里，再让意根接受这个观点，就能断身见。</p><p>原文：<strong>佛说如是。或于内身观身而住。于外身观身而住。</strong></p><p>释：内身，严格来说就是我们整个色身，属于内身，外身也是我们五阴十八界当中的法。十八界有六根、六尘、六识，六尘包括色尘、声尘、香尘、味尘、触尘、法尘。色尘与我们眼睛所对，包括山河大地、房屋树木、宇宙星空、十方诸佛国土，都属于色尘。那些色尘都属于我们色身的外界，属于外色尘。还有声尘，属于我们十八界当中的一种法，是组成众生的一部分，是色身的外界，叫作外身。声尘也是由地水火风四大种子组成的，我们眼睛所见的色尘是由地水火风四大种子组成的。</p><p>如来藏输出的四大种子比例成分不同，生出的色尘就不一样，其性质就有差别。同样是土地，含藏的地水火风四大种子成分不同，土地的属性就不一样，其功能作用就不一样，土地和土地之间也有区别，里面空大的成分不一样，土地的密度也就不一样，空大的成分越多，土地越松软。反之，土地就越坚硬，越坚硬，就说明里面空间越少越密实，越紧密越坚硬。所以地水火风空五大种子搭配的比例不一样，它所形成的物质属性就不一样，性用不一样。</p><p>金刚是一种宝，也是由地水火风四大种子组成。同样是四大构成，为什么叫它金刚，不叫作石头呢？因为其内里的四大组成成分与石头不同，空大的成分相当少，密度极大，所以是极其坚硬的。坚硬的东西空隙就少，密度都大，柔软的东西，空隙都大，所以由五大种子组成了各种各样的物质。</p><p>细心观察我们的内身身体，从皮肤到肌肉、到筋、到骨骼，到骨髓、内脏、血液，所有的固体、液体物质都要观察。观察的最后结论是，都由地水火风四大元素和合而成，都是虚假的甲壳，生生灭灭，并不真实。于外身观身而住。观察我们色身外的色尘，其实也是内色尘，外色尘根本观察不到。观察眼睛所对的色尘，就会知道外色尘就是如此了。这些色尘也全部是由地水火风四大种子组合而成，那么这些色尘就是虚妄的。而色尘的种子都来源于如来藏，那我们看见色的时候，就应该想到如来藏。所以一切法都是如来藏，看一切法都是如来藏。</p><p>我们听的声音也是一种物质声波，由地水火风四大种子组成。声音这种物质色法，与色尘还有区别。声音具有传导性，要通过一定的媒介才能传导到一定的区域，其传导能量会递减，最后会消失。所以声音能够穿透物质，穿过墙壁，不受阻碍，但还是会消耗能量的。声波在空气当中传导流动，最后就传到耳根里，首先会震动耳鼓，所以声音出现时，我们首先是感到耳根的震动，后来才知道是什么声音，传过来的方向、粗细、种类、性质等等情况。而色尘会受物质的阻碍，即使是一张薄薄的纸张，也能阻挡住色尘的透过，使色尘不与眼根相对，何况是厚厚的墙壁。</p><p>还有香尘，香尘就是各种各样的气味，不管是香的还是臭的，任何一种气味都属于物质。这些物质也是由地水火风四大种子构成，只要是四大和合起来的就是生灭的、变异的、无常败坏的，就是一种幻化出来的假相。因缘散去时，气味也就消失了，地水火风分解了，香尘也就消失不见了，所以香尘也是虚妄的。</p><p>再观察我们吃的饮食当中的酸甜苦辣的味道，这些味尘也是物质的，由地水火风四大种子所组成。也是生灭、变化的，有合就有散，食物进入口腔，舌根品尝，最后四大分解，因缘散去，这个味尘也就消失了。在口腔里通过咀嚼，食物的味道会有变异，吞咽到胃里，它的味道就全部改变了。我们吃的再香美的饮食，到了胃里是什么滋味，什么状态，能不能想的出来，如果能呕吐出来时，就知道了。</p><p>到了胃里，那些细菌把这些食物分解、消化，胃酸分解了那些食物以后，那味道是非常难闻的，就不是刚吃到口腔那一刹那的香味了，早就大变样了。地水火风分解了以后，物质属性就发生了变化。这些味尘也是生灭无常的，因缘聚合的，它也是一个虚妄法，不是真实的法。所以我们吃饭的时候就不要挑饮食，不要贪着饮食，所有的饮食都是一种虚幻的假相，不是真实有的，味尘也属于我们的外身。</p><p>还有触尘，阳光照下来的光线，空中的风吹到身上，都属于触尘。我们身体和心里都有感受，在身上的感受就属于触尘。比如我们身体里的饮食发生变化，我们感觉饱，感觉饿，或者感觉渴，还有其他的感觉的对象，都属于触尘。身体轻安的状态、沉重的状态、疲乏的状态、舒适的状态都属于触尘。这些触尘也是由地水火风四大种子所组成的，组合成的东西就是虚妄的，因缘聚合的就是假的。我们就不能贪着这些触尘，不能让色身贪着享受，因为本来都是虚妄的，享受也是虚妄、幻化、变异、无常，而且还损耗自己的福德。</p><p>如果我们一享受，如来藏银行里的存款就消费掉了，从前辛辛苦苦修出来的福报就消耗减少了。如果福报不足，那么道业就很难有进步。至于说，现在有福可享受，那是因为我们从前修过福，做过布施，但是每个人的福德毕竟是有限量的，享受一点，少一点，都用在日常享受上，剩余的福德就不够使道业增进了。从前布施，修过的福，都存在如来藏里，享受时，就从如来藏银行里往外提取。越享受，银行存款越少，如果有福不享，福德存款一直存着，还会有高额利息，利滚利，福德就会越来越多。</p><p>如果都享受尽了，都提出来了，银行里就没有存款，也就没有利息了。福报如果不足，学佛就会处处是障缘，处处不通顺，想断我见做不到，想明心做不到，即使是想压服一下烦恼都做不到，想修禅定修不成，想持戒没有福也持不圆满。我们一切世间和出世间法的修行，顺利不顺利，成功不成功，全在于自己的福德。所以我们尽量节约福报，多为自身的道业着想，为未来世的修行着想，也要少享福。</p><p>有福不享，或者少享受，积攒下来的，还仍然会存在自己的如来藏银行里，这个如来藏银行一个是永远不倒闭，再一个是别人抢不走。世间银行劫匪能夺走，或者骗子能把钱骗走，这个如来藏银行任何人拿祂都没办法，他找不到这个银行，即使找到，也撬不动。所以还没有享的福就存在如来藏里，永远属于自己，只要如来藏银行里有存款，自己就是一个有福人，做一切事情都会顺利，用在修行上，道业进步就会很快。</p><p>还有一个就是法尘，法尘就是在五尘上同时能显现出来的法处所摄的色，也是色法，法尘与意根相对，也是由微细的地水火风四大种子组成的。法处所摄色，也是一种色，与前五尘有区别，是依内五尘而现起出生的，比五尘更微细，内五尘比法尘相粗一些，但比外五尘要微细。以上所说就是六尘，六尘是十八界的六尘界，十八界全体就组成了众生的假体，所谓的众生，五阴十八界合在一起就叫作众生。</p><p>原文：<strong>又于内外身。观身而住。或于身观生法而住。于身观灭法而住。又于身观生灭法而住。尚又智识所成及忆念所成，皆会有身之思念现前。彼当无所依而住，且不执着世间任何物。诸比丘，比丘如是，于身观身而住。</strong></p><p>释：当定力非常好的时候，可以观察内身，同时也观察外身，内外身要同时观察。如果定力不足，观察一样都观察不清楚，观察一会儿心就散乱了。定力具足时，能观察很多事物，思惟很多道理，也观察的清楚，思惟的清楚。内心清明又不散乱，也不昏沉，那就叫定。所以当我们内心比较清明时，用这种清明的心境，思惟佛法，就能开智慧。一切事就会看得明白，想得明白，计划的明白、观察的明白、做的明白，那就叫智慧。</p><p>观身时，观察我们色身上什么东西生起来了，如果地性东西多了，息肉疙瘩就会长出来，有可能会有囊肿生出来。原来身体没有的，现在出现了，叫作生法，比如肿瘤生出来，就多了个物件。再观察什么法灭去了，灭，就是原来有的法，现在没有了，比如各种病症消失了，身体缺少了一部分东西，或者身体瘦下来，地水火风四大改变了。然后再同时观察我们内身的改变，我们身体的改变，什么东西生起来了，原来没有现在出现了，再观察什么东西灭去了，原来有现在没有了。这样观察来观察去，就知道我们的身体是一直在生灭变化着，生灭变化的就不是真实的，不是固定永恒不变的，那就不是我。</p><p>应该有这个观念：我，是真实的、是不变化的，是不变异的；我，是不苦的；我，不是无常的；我，是常住的、永远不变化的；我，是真实的，不是组合的；我，不是因缘所生的法。这些观念应该树立起来，牢固地置于内心当中。再观察，一切法都是生灭变化、因缘所生的，就知道一切法肯定都不是真实的。这些理论教给大家，只是作一个指导，至于自己能认识到什么程度，那是自己的事，是个人领悟的问题，个人观行智慧的问题。一切理论，全靠自己体证和认知，常常观察体悟，就能确实认识到一切法的本质。</p><p>生灭变异的，不是真实法，也不是真实的我，这个观念一旦形成，再来观察一切事物，观察这些事物是不是生灭的，是不是无常的，是不是因缘组合起来的。如果仔细观察，就会知道一切法确实都是生灭的、无我的，都不是我。不是我，也就不是我所拥有的，非我、非我所，那就断了身见，也许会断我见。色身不是我，十八界也不是我。最后再观行四受阴，色受阴不是我，观察受受阴，想受阴，行受阴，识受阴都不是我，整个的我见就断了，三缚结随后就断，成为初果人。</p><p>于身又观生灭法而住，色身上有什么法出生，同时又有什么法灭去了，同时生同时灭的这个色身，都能观察出来。只有定力较强，心力够用时，才能观察出来。都观察清楚了以后，因为一直在观身的缘故，现在的心念里都是色身。再把心念里的色身排除，心里不要有色身的念头。认可色身不是我，就不要心心念念再有这个身体了。心念里无身，就会断身见，同时内心里也不要留存其它物、其它法。心念无身又无物，就有个清清明明的知。</p><p>这个知是什么？是意识心的知。有这个意识心的知，定比较深，那这个时候可以修到未到地定，还可以修到初禅定。有这个定力时，再把这个知换成话头，就能够参禅了。所以大小乘的某些修行方法是相通的，不是象一道沟地隔开不能跨越。等大乘的法通了，用大乘的方法，再来观察小乘法，就更清楚小乘法了。大乘法不懂，小乘法也不可能完完全全彻底的明了，总有不通之处。</p><p>初地、二地的大乘菩萨，要比四果阿罗汉更懂小乘法，四地以上的菩萨，回头再观察十二因缘、四圣谛理要比阿罗汉辟支佛更通达无数倍。二者观察的角度不一样，深度也不一样，大乘菩萨们，观察的更细致、更入微，智慧更深。所以大乘菩萨的智慧远远要高于小乘阿罗汉的智慧。菩萨观察法的角度、层次都比罗汉们要高要深。观行完成以后，当心念里都是色身我时，就把色身观念灭除，色身非我就能认可了，心心念念就没有色身我，只有个知。再用这个知去参禅，就能明心证悟。</p></div>"
},{
    "title": "第二章 （五）观死尸",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>五、观死尸</strong></p><p>原文：<strong>复次诸比丘，比丘恰如得观遗果于冢间之死尸。死后经一日二日乃至三日。膨胀成为青黑腐烂。彼注视此身。知此身不脱如是法(性质)。而成为如是者。</strong></p><p>释：佛说，诸比丘们，你们现在应该观察自己就像被扔到坟墓间的死尸一样，那些死尸是第一日第二日到第三日，身体就会膨胀变得青黑和腐烂了，那么注视观察自己的色身，要知道自己的色身早晚也会像这样，膨胀、青黑、腐烂，成为了这样的死尸。</p><p>下一步要观尸体，众生死时，地水火风四大分解，就成为死人。人死以后，印度那时把尸体裹着一层布，就扔到坟墓间，过去印度有尸弃林，一般人死了都扔到那个树林里，裹上一层裹尸布，有的人很穷就把裹尸体的布拿回家自己用，然后把尸体扔在树林里就不管了，任尸体腐烂，和野兽鸟类啃食。过去死人火化处理或埋入坟墓的很少。印度天热，扔到树林里经一日、二日、三日，经过一天时间尸体就会膨胀，膨胀以后身体皮肤就呈青色、黑色，因为膨胀以后就开始腐烂了。</p><p>为什么会膨胀呢？因为身体里有水分，天热水停滞不流动，就会产生细菌，细菌产生出来就像发酵一样，身体就会膨胀。我们发面做食品靠什么，也是靠细菌。细菌一产生出来，和好的面就出现泡泡，膨胀起来了。活着的时候身体里的血液、各种液体都是流动的，流动的东西不容易产生其他不必要的细菌，不流动就容易产生细菌，户枢不蠹，流水不腐，就是这个道理。比如说一条流动的河，就不容易产生细菌，没有腐烂的味道，如果水不流动，几天就发臭了，菌类产生出来就会如此，尸体膨胀腐烂就是这个道理。</p><p>有人说看某某多有修行，死后他的身体很久都不膨胀，不腐烂，修成了肉身不坏。其实肉身不坏只有六祖是真正的肉身不坏，六祖的禅定很高，临终前，身内的三昧真火早已把身体里的细菌度走了，细菌不能在他的身体里存活，因此六祖走了以后，身体里就没有细菌，身体就不会腐烂。其他人的肉身不坏都是一种假相，完全可以作假，活着时，根本就没有甚深的禅定功夫，死时就靠作假。</p><p>任何人只要死前几天，断水断饮食，身体里没有水分，死后他的身体就发干，不容易生细菌，身体就不腐烂，也可以不变色。或者人死后，有人给尸体进行干燥脱水处理，这样尸体也不会腐烂。但是经常打坐的人，有禅定证量的人，他有三昧真火，这个三昧真火能把身体里的水分烧干，或者细菌不让它繁殖出来，那些细菌都烧没有了，死了之后就是肉身不坏。肉不坏，骨头不坏，身体不倒塌，就是这个道理。</p><p>什么叫有道、有修行呢？证果和明心有功德，第一能自身受益，第二能利益他人，这才叫作道。其他的世俗有为法，都不叫作道，不叫作有修行。虽说有人能肉身不坏，但是既没明心，又没证果，三缚结没有断除，他未来仍然免不了要下三恶道。所以有很多人崇拜肉身不坏，这个肉身菩萨，那个肉身菩萨，那只是崇拜肉身假壳子而已。至于他有没有智慧，有什么样的智慧境界，大多数人判断不出来。即使修出了禅定，有三昧真火，能够使肉身不坏，此人也不一定明心见性，不一定是真正意义上的菩萨。</p><p>有些人故意在尸体上做手脚，死后可以用各种灰，把身体的水吸干，吸干以后才可以肉身不坏，就是为了让大家崇拜他。如果没有明心开悟，这个身体保持一百年，一万年也不算什么，明心开悟了叫真实义的菩萨，和这个身体如何没有关系。所以任何人修出禅定了，也可以做到肉身不坏，我们不要看世间任何一种假相就去崇拜，不要去着相，要看实质内涵，要看一个人的智慧境界。一个人整天打坐也是一种表面现象，死后肉身不坏也是一种表面现象，这些现象不过是五阴世俗世间的各种生灭的假相罢了，虚幻而不真实，不可久住。看人要看他的智慧，你不了解他的智慧，仅从表相来判断这个人是不是大德，是不是有道，那叫着相，着相即是颠倒，所以肉身不坏不少人都可以做到，那不叫道。</p><p>人死后一天、两天、三天都会发酵膨胀，到一定程度就会腐烂，细菌从里到外把这个尸体就分解啃噬了。于身观身而住时，就要注视这个尸体，内心里想象这样一个身体。我们几乎都看过死人，可以想象出来，夏天气温非常热，人死了停尸三天，临死之前进了饮食，第二天这个尸体马上就膨胀起来，所以夏天不能停尸时间长了，一天两天三天，最后成为青黑色腐烂了。</p><p>观身注视此身以后，那我们内心里就会有个观念形成了，那就是：我的色身将来也会像这样一样，别人的色身死了，扔掉、腐烂了，我的色身也不能逃出这个命运，最终都是这个结局，也不能脱离这个法，和这个尸体一样都会膨胀腐烂，我也会成为一个尸体，被人扔在树林里，或坟墓里或者火化。观察自己的身体将来也会这样，那我们还认不认这个色身是我呢？如果身体是我，身体毁坏了，我又哪里去了？我到底消失没消失？如果消失了，还有没有未来世？这一世的我，又是怎么出现的呢？</p><p>如果我也随着身体消失了，那我怎么还有下一世呢？我们无量劫来有多少个身体，都是这样膨胀了、青黑了、腐烂了、消失了。我们就要想，这个身体不是我，也不是我所拥有的，不要再去执着这个身体，为这个身体付出很高的代价，很宝爱他，穿最高档的衣服，吃很美味的饮食，住最高档的庭房，为他付出高额的代价，其结果是什么呢？他照样会把我们给抛弃了，成为坟墓里的一个尸体，膨胀腐烂消失没有了，那么我们就不要再贪着这个色身。</p><p>原文：<strong>佛说。如是。或于内身观身而住。于外身观身而住。又于内外身观身而住。或于身观生法而住。于身观灭法而住。又于身观生灭法而住。</strong></p><p>释：当修观身念住法时，我们观完内身以后，再接续观外身。外身就是十八界当中的色声香味触法，观所见的一切色，都和我们的身体一样会散坏的，会消失，会灭去的，都是生灭变化无常的，都是念念迁流变化，根本保留不住，不能长久存在，所以外身也不是我，也不是真实的，也不是恒常不变的，全部是生灭的，因此也不要贪着外界。内身外界都不是我，都不要贪着，这样就能断身见，降伏贪爱，禅定就能生起来了。</p><p>再同时观内外身，当我们禅定深一些的时候，精力就会充沛，内心非常清明，一切法都能同时观察出来。同时观察内身和外身，在观察色身的同时观察眼见的色，耳听的声，鼻嗅的香，舌尝的味，身觉的触，心思的法，念念生灭变异，无常、虚妄，这一切都不是我，也不是我所有的，所以定深时，智慧也就深广了。然后又于身，观生法而住，于身观灭法而住。观察在我们的色身上，什么法生起来了，原来没有的现在出现了，原来有的法，现在消失了。</p><p>从色尘上来观察，从声音上来观察，从气味上来观察，从味尘上来观察，从触尘上来观察，从法尘上来观察，观察各种各样的生法，各种各样的灭法。我们内脏器官的生和灭，皮肤、骨骼、肌肉的生和灭，从头到脚的生法和灭法，都要观察出来，这要定力非常强，智慧非常清明，这一切法都是生灭、变异、无常的，都非我非我所，都不真实。那就不要再去贪着任何一个法，这样就能断身见、断我见。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有身之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：整个内身外身都观察完以后，意识心当中，就会都是有关色身的观念，思想里都是色身。什么叫智识呢？明理叫智，能了知真实的法相，叫作智，不愚痴不糊涂，叫作智，不散乱不昏沉的清明了知，叫作智。识指识心，以意识心为主。这里的智识，就是指意识心有了定力，能清明了知一切法，不愚痴不糊涂，不散乱不昏沉。意识心中有智慧生起来了，能够观察和认知到一切法，这是定的结果。然后内心当中就会有一个我，有这个色身。</p><p>忆念就是观察了内外身之后，心心念念都有这个身，身体的观念、形象在心念当中形成了。形成了以后，再把这个忆念排除掉，把身我的观念去掉、空掉。彼当无所依而住，且不执着世间任何物而住。内心里一法也不依赖，一法也不住着，既不依内身，也不依外身，而且也不执著世间任何物，内心里空荡荡，无所依，叫作一法不住，一法不执。修到此，已非常人，已经去身见，去身执的圣贤。</p><p>佛说，你们出家比丘应该这样来观身，心不住法而住。所有修行人都应该如此，不仅是出家僧要如此修行，不依色身而住，不依外身而住，不要有色身的观念，也不执著世间任何物而住。如果再执著其他的物也不可以，执著财色名食睡，执著金银珠宝，执著名声、权势、地位，执著这些也不应该，这样执著就不能解脱生死轮回。把这些物也都要泯灭、空掉，就会住在甚深禅定当中。心念空掉了以后，内心总是有个知，有个清清明明的知存在，以后就能用那个知参禅了。把前面的色身以及一切物都泯灭了，全排除、全空掉了，再参禅就很容易，很快速了。</p><p>所以修到最后都是无所依而住。先在心念当中有个身，再把身空掉，无所依而住。把身空掉，再把世间任何其他物全部空掉，心心念念都是一个空，从里到外都没有一个我，就会断我见，断身见去贪执。都没有我了，这时候有定有慧，就打开了小乘智慧，这样才叫于身观身而住。</p><p>这些观行的内容一步一步深入，一步步接近于空无。断身见，断我见，一步步来观行，定越深，智慧就会越来越深，心念就会越来越空，从里到外，从上到下，没有一个我，心就空下来了。如果心中再有一个物，这个物也是非法，心中有物就不如法，再泯灭掉一切物的观念。任何心念当中有一个东西出现，你就说这是假的、空的，不是我，它就消失了，我们就能断我见证果了。</p><p>原文：<strong>复次诸比丘。比丘恰如得观遗弃于冢间之死尸。被鸟所啄。或鹰所啄。或鹫所啄。或犬所食。或豹所食。乃至各种生类之所食。彼注视此身。知此身不脱如是法。而成为如是者。</strong></p><p>释：刚才是观行把尸体扔到坟墓间，尸体只是青淤膨胀、腐烂了，现在开始观行尸体被鸟所啄食了，食肉大鸟非常饥饿时，就在树林里盘旋，寻找可食之物。发现尸体，就会钳食尸体上的血肉。这具尸体或者被老鹰所叨啄，或者是被鹫所叨啄。这些大鸟都是吃肉的，专门在尸弃林里等着吃死尸。</p><p>这具尸体或者被野狗吞食，或者被虎豹豺狼所啃食，尸体乃至于被各类野生畜类之所食。还有什么吃死尸的众生呢？蚂蚁也都来吃，甚至能啃骨头，各种畜生都来吃肉，坟地里的野鬼也吃死尸，他们吃只是食香气，嗅气味，实体的肉，他们吃不了，嗅得死尸上的肉味，就算吃饱了，畜生类是吃具体的肉。这个尸体就这样被这些畜生们分食完了，分食到最后，剩下最坚硬的骨头啃不动，就扔下不顾了。</p><p>我们观察死后的色身可以想象，想象内心当中有个尸体，被各种畜生所分食，分食时，我们在注视着此身。这当然是我们想象的，意识心中的想象，意识心注视着这样的情景，这时候就没有前五识了，只是个独头意识。意识注视此身时，就知道此身不脱如是法，别人的身体结局是这样，我自己的身体将来的结局也会是这样，死后也会被扔到尸弃林里，被野兽吞食掉，都是这样一个结果。只要有身体就是这个命运，现在虽然条件好了，尸体可以火化，其结果也是尸体化为灰烬。</p><p>那我们是否还认为这个身体是我呢?如果是我，我哪里去了？为什么消失不见了呢？能消失灭亡的是我吗？当然不是，也就是个假壳子罢了，能被我所用一段时间罢了，不必要去执著它，就像对待一件衣服一样，不能穿就扔掉。无始劫以来多少个所谓的我，就这样被吞食了，身体是真正的我吗？肯定不是，身体没有了，真我不灭，不灭就会还有下一世。所以能灭的东西肯定不是我，要有一个坚定的信念，我是不灭的，灭的都不是我。有人就会认为这个不灭的真我，好像是灵魂意识，但意识也要灭，不是真我，真我就是既不生也不灭的第八识心体。</p><p>观察这个色身时，发现它是生灭的，生灭的就不是我，无常的也不是我，苦的也不是我，染污的也不是我。我是清净的，我是不苦的，我是乐的，我是寂灭的，我是常住不变的。而身体刹那刹那的变化，我们的心识也刹那刹那都在变化，变化无常的不是我。这个观念要牢固形成了，断身见、断我见会非常快。观念和理念别人不能硬塞给自己，他人不能代替自己认可，不能改变自己的心识认知。只有自己如理思惟，才能改变自己的认知，改变观念。至于自己能不能改变观念，是你自己智慧的问题，也有福德方面的问题，和定力的问题。</p><p>所以世尊把法留给我们，教给我们，我们怎么去认知，那是我们自己的事，佛就没办法了，再怎么加持也没办法真正地改变自己的心，最多能让我们的意识心清楚的了解和认识到，无法让我们的意根了解、接受和认可，所以就要靠我们自己一步一步去修行，一步一步来改变我们意根的思想观念。深细思惟以后，意根认可了，思想观念就改变，意根一改变，心行就一点点的改变。心行改变了以后，我们就从凡夫修到贤圣，再从圣贤到佛，一切都会圆满了，所以修行到最后，意识心彻底改变，意根彻底改变，我们就是一尊大好的佛。</p><p>原文：<strong>佛说。如是。或于内身观身而住。于外身观身而住。又于内外身观身而住。或于身观生法而住。于身观灭法而住。又于身观生灭法而住。</strong></p><p>释：我们这样来观察尸体，观察到尸体都被分食净尽了，这就是在观内身，通过观察内身就知道了，这内身会分化、分解、变异，会消失，那就不是真实的。然后再于外身，观身而住，观察我们的十八界，知道一样一样都会散坏，一样一样的都会灭去，一样一样的都会消失。那么就想一想，内身和外身是不是我和我所呢？这些既不是我，也不是我所有的，都是生灭变化的、肮脏不净的、苦的、空的，所以都不是我。然后又于内身和外身，同时观身而住，定力好时，内身和外身同时都能观察出来，结果就知道了五阴十八界法，都是苦、空、无常、不净，都不是我。</p><p>观察色身当中新生起了哪一种色法，什么东西增加了，从无到有，要观察出来。观察出来以后就知道了，只要有生，就会有灭，生灭即无常，就是不真实法，那就不是我。再观察色身上原来有什么，现在没有了，消失了，变化了，改变了。这一切都要观察出来，观察出来以后，就知道色身是生灭变化的，是无常的；无常的，就是空的，空的就不是真实的，就是幻化的，就不是我。再同时观察色身生起了什么法，灭去了什么法，生法与灭法要同时观察，这样定慧均好。</p><p>当定力足够时，精力充沛，心就会比较清明，有智慧，就能同时观察出很多的法；如果定力浅，精力不够用，智慧力也不够，很多法就无力观察出来，即使观察一样、两样事情，也不容易清楚观察出来；如果定足够用，智慧力也强，四面八方的事情，色声香味触法，内身外身的情况，同时都能观察到，都观察出来以后，就知道什么法出生了，什么法灭去了，内心全部都了知。内心里这一个知，能够清清明明的了知一切，定慧等持。如果不切实修持，定也不具足，慧也不具足，观察一个法都不清明，观察不明白，思惟一会儿心就乱了，思虑一会儿就心烦了，那样不会有个明了的结果。因为定不具足，慧就不具足。</p><p>定慧具足的前提是要具足福德，福报不足，定力就修持不出来。修定的时间、环境等等条件不容易具足，每当修定时，就会有干扰的事情出现。修慧时，也是这样，这边刚要思惟观察一个法义，那边一件事就出现了，需要去处理，思惟就被打断了，等处理完，再回来接着观察，又一件事来干扰。福报不足，就不可能有充分的时间精力来专心致志地修行。如果不用心修福，就会总有世间法的事情来阻碍修行，使得道业没法进步。出现这种状况，就要赶紧去布施修福，福报够了，往这一坐，无论是修定，还是修慧，就没有人和事来打扰了，就会有充分的闲余时间和条件来修行，可以看书看很长时间，没有打扰的，很多事情就不用你去分心劳神。</p><p>福报不够时，修行这个阻拦你，那个阻拦你，家庭的遮障，工作的遮障，人事来往的遮障。还有的人经济来源匮乏，日用不济，于是就要花费很多时间来挣钱养家糊口，那就没有时间修行了，这都是福德不足所致。福德不够一定要多修福，用各种各样的办法，把自己的福德尽快聚集起来。多作布施，布施出去一物，回来至少是一千倍，还得看布施的对象是谁，如果对方有修行，那就不止是一千倍，一万倍，十万倍，百万倍了，即使是布施给一个外道修得初禅定的人，得福那都是百万倍的回报，都记载在自己的如来藏当中。所以修行人要尽量往外布施，尽量不要往里入，不要把其他人的财物进到自己的账上，那样绝对不合适。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有身之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：这样观察以后，清明的心当中，心心念念都有个身，心念里全部是关于色身的思想和观念，要把这个身的观念排除出去，把那个青淤腐烂的身体排除、空掉，也要把被野兽分食的色身情况排除、空掉，不再认那个色身为我，让思想清净，内心空净，心无所依而住。如果内心还在执着世间其他任何物，也要把那个物给空掉，不管是钱财、房屋、土地、权势、名利、地位，心念当中全部都要舍弃、空掉，让内心空空如也，什么都没有，一无所依而住，这样心空净了，小乘的果位也就得到了。</p><p>这个时候内心当中还清明的有个知，虽然有知，也没有物。这个知，将来就可以换个话头来参禅，参：拖死尸的是谁？我们身体和死尸一样，并不真实，既然不真实，为什么还能活蹦乱跳呢？为什么还能做一切事业呢？当我们把定修好了，我见再断了，疑情就很容易出现了。如果断了我见，而且断的非常彻底，内心一物也不认时，就会怀疑了：为什么身体还有五阴的功能作用？这样疑情就出来了。</p><p>疑情出不来，一个是定力不够，另一个是有我见阻碍。定不够知见也不容易具足，我见就不容易断，或者断不彻底。心中没有空却一切物，把五阴当中的某些法还当做真实的，那疑情就不会出现。所以疑情没出现，就说明定和慧不够，还需要接着往下修，疑情一出来，就会住在疑情里，时节因缘一具足，就把疑情打破，知道了原来是这么回事。所以大小乘理，小乘就是基础，基础打好了，下一步修行就会非常快。这样观身，就会断了身见，内心空空如也，没有一个我，没有我身，都是空的，幻化的。</p><p>原文：<strong>复次诸比丘。比丘恰如得观遗弃冢间之死尸。由于具有血肉而筋连结于骸骨。乃至无肉之附着血而筋连结骸骨。乃至无血肉。唯筋连结骸骨。乃至关节解散。手骨于此处。足骨于彼处。踝骨于此处。腿骨于彼处。盘骨于此处。背骨于彼处。头盖骨在彼处。骸骨散在四五八面。彼注视此身。知此身不脱如是法。而成为如此者。</strong></p><p>释：这段经文还是观死尸，色身活着的时候是虚妄，死了成为尸体更虚妄，更是空的，更不是我了。刚才上段是观尸体被野兽都吞食了，吞食了以后还剩下一些骨头，剩下的骨头上还有血和肉，有筋连着骨头。再往下观，骨头上的肉也没有了，还有点血，有筋连接着骨头。再往下观，血也没有了，被野兽舔舐了，啃的就剩下最硬的骨头，只有筋骨相连。</p><p>乃至到最后，连接处都没有了，关节没有了，骨头已经被啃得非常破碎了。最后骨头就分散成手骨，还有脚骨，踝骨、腿骨、背骨、头盖骨等等，非常零散。看着这些骨头四面八方地散落着，这个活生生的血肉相连的大活人，到最后就变成了东一块碎骨头，西一块碎骨头，都散落在四面八方，凑不起来了。观察到此，就知道了，任何一个身体，都不能逃脱这个命运，都会成为破破碎碎的碎骨头。那么这个身体哪里去了？是真实的吗？是我吗？原来那个完整的身体也不是我，剩下碎骨头的这个也不是我，都是因缘聚合起来的，四大组成的，是一个假壳子，一个幻化物。</p><p>佛说，我们在一小劫之内的色身，都散坏以后剩下的骨头，这些骨头足足能堆积成一个须弥山。须弥山处在四大海里，一直伸展到虚空当中，须弥山在四大海水里埋藏一半，伸出在虚空当中是一半。须弥山是三角形的形状，越往上越狭窄，伸出四大海上面一半。我们地球在四大海的上面，须弥山的脚下，是须弥山南面的一个小球体，在四大海水面上的须弥山，其半山腰是四天王天，须弥山的东、南、西、北四面，是四天王所住之处，叫四天王天，月亮在那里悬浮着。须弥山的山尖上，是忉利天天主释提桓因所住的忉利天，也叫三十三天，太阳在那里悬浮着。</p><p>一个人一小劫里所有色身的骨头，就堆成了须弥山那么高，那一小劫中我们的色身简直是太多了，生命的次数和生命体也太多了，根本数不清楚。这些所有的色身都是我吗？都不是我，都是如来藏所幻化出的一个假壳子。每生每世，如来藏都把地水火风四大种子输送出来，形成了一个又一个的色身，色身散坏了以后，就剩下了骨头，到最后连骨头也没有了。我们能找到往前很多世的骨头吗？根本找不到了。</p><p>如果色身是我，到哪里去找那些我呢？到虚空找我吗？肯定找不到。再说我有那么多个吗？真实的我只有一个，而且是常不变异的，能变化的无常的就不是我，这个观念我们心里应该非常非常的牢固了。那么我们就不要再执着一生一世的色身，不要再把色身当作我，为它吃好的，穿好的，住好的，用好的。吃喝玩乐一生一世都为了这个臭皮囊，为了这个假壳子，那就太不值得了，到最后它还无情无义的把我们抛弃了，是我们抛弃它，还是它抛弃我们呢？我们想抛弃它吗？根本不想抛弃，意根没有修好去贪执时，是这样的执著色身，抓都抓不过来，不可能主动放弃色身。</p><p>所以那个生灭的东西，我们为它付出一切代价，把所有的福报都用在让它享乐上，那是非常不值得的，不要为了无常变异的色身，去付出高额的代价，要尽量多修福，多积福，少用福，少享福，福报积累够了，我们就成佛，佛是福慧两足尊，福报不具足就不能成佛。所以这个福德是非常重要的，如果自己福德没有了，即使别人送给自己多少的财物，也享受不到。即使能享受到，那也是从自己的如来藏银行里，把福报提现出来的，那样银行里的存款就减少了，钱财虽然是从别人的银行账号里提出，可福德却是从自己的如来藏银行里消耗了。我们每一口饮食，每一次消费享受，都是从自己的如来藏银行提现出来的，多吃一口，就少一口的福报，从银行里提出一点，存款数额就减少一点，存款没有了，只有饮饥挨饿、受苦的份儿。</p><p>原文：<strong>佛说。如是。或于内身观身而住。于外身观身而住。又于内外身观身而住。或于身观生法而住。于身观灭法而住。又于身观生灭法而住。</strong></p><p>释：上面那段是观内身，观行尸体都变成了骨头，骨头上一开始还有血肉，后来既没有肉也没有血了，最后筋也没了，骨头散坏成东一块，西一块，零零碎碎，最后都消失了，哪里还有一个我呢？观完内身，再观我们的外身，外界，十八界当中的六尘。六根六尘六识，全都是生灭、散坏，苦、空、无常的；无常、空的结果就是无我。色身从无到有，长到一百多斤，最后肉没有了，血没有了，内脏没有了，就剩几块碎骨头，最后骨头也没有了。</p><p>色身是不是空的呢？是我吗？这个假壳子是不是苦的？是不是肮脏不净的？可以得出一个结论：色身不是我。观内身之后再观外身，整个十八界我们都要观行到，然后内心坚定地认知到：十八界都是苦空无常无我的，全部都不是我，从里到外，从上到下，全都不是我。于是内心的色身观念就会舍弃，心中空空如也，一物也没有。内身外身没有一样是我和我所有的，这样断我见就彻底了。定慧都很好的人，我见一断，不久就能证得二果，或者当时就是二果。</p><p>成为二果以后，初禅定发起来就很快，初禅定发起来以后，就会断贪爱，再把嗔恚心断掉，就成为三果。能修到三果就相当不错了，有三果的证量，再加上明心见性，就会过禅宗的牢关，之后就有能力和资格进入初地，成为初地菩萨，就是进了如来家，成为如来的真佛子，如来的亲儿子。在此之前都不是，因为没有通达大小乘佛法，也没有降伏（断除）烦恼，就不能入如来家。</p><p>于内外身，同时观身而住，定力慧力都够好时，同时观内外身而住。观内外身时，或于身观生法而住，于身观灭法而住，又于身观生灭法而住。色身上新生出来的法，和同时灭去的法，都要观行出来，心里清明，定慧相资。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有身之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：观行完内外身之后，生法和灭法也观行完成了，识心的心心念念当中都有个身体的存在，忆念当中也都是这个身体。然后再把这个身体的念想空掉，心念不依身而住，且也不执着世间任何物而住，心中一法也不住。没有身，没有世间任何一个物，任何一个物全部是空的，全不是真实的。身体不是真实的，外边的一切物也都不是真实的，一直到整个虚空，外面的整个人事物理，我们所生活着的一切环境和资具，全都不是真实的，全都不是我所拥有的，全部都是虚幻的。</p><p>这样内心就空的非常的净尽了，全空掉了以后再参禅。既然全不是我，全都是空的，为什么这个五阴还在活动着呢？疑情就会出来了。空得越彻底，疑情越浓，破疑时的智慧越深利。</p><p>按照这种方法观身，一个层次一个层次的，就这样来观行色身。</p><p>原文：<strong>复次。诸比丘。比丘恰如得观遗弃冢间之死尸。初如螺色之白骨。乃至经过一年。骸骨堆高。乃至骸骨粉碎败坏。彼注视此身。知此身不脱如是法。而成为如此者。诸比丘。比丘如是。于身观身而住。</strong></p><p>释：佛说，诸比丘，再观察这个被抛弃到尸弃林或坟墓当中的死尸，那具尸体最初就像是海螺的颜色一样的白骨，骸骨经过了一年发生变化，堆集起一堆很高的白骨，到最后骨头粉碎败坏，消失了。一个完好的身体，变成了一具尸体，最后连一块骨头都没有了，什么都找不到了，这就是无常和空幻。那我们找前世的骨头，再前世的骨头，一劫以前的骨头也找不到，都没有了，连一点骨灰也找不到，色身就这样无影无踪了。诸比丘，你们注视观察这个色身，就会知道自己的色身也脱离不了这样的命运，最终必然会成为这个结果，诸比丘，这就是于身观身而住。</p><p>过去有修行人怜悯众生，死后不把身体火化，而是让人把尸体直接放在坟地里，让畜生食用，畜生食用了以后只剩下一堆骨头，他临终又嘱咐人把骨头收集起来磨成粉，再喂那些像蚂蚁类的更小的动物，或者撒到海里直接喂鱼。这个修行人如此无我，如此怜悯众生，死后也仍然要利益众生，可见是一个不执著色身之人。</p><p>这样尸体到最后什么都没有了，即使骨灰存在，也都会散去，找不到了。到最后地球毁灭了，骨灰和骨头都在哪里呢？如果说骨头在地球上存着，只是找不到了。那地球消失了，骨头在哪里呢？地球成住坏空一个周期是一大劫，即使骨头能存在一大劫，如果说骨头都存在虚空里，那什么叫虚空呢？虚空哪里有那么多骨头呢？即使虚空能存骨头，那大雨一下来，就会把骨头冲没了，宇宙当中风灾一来，整个宇宙天宫都摧毁了，那些小骨头和骨灰又算得了什么呢？更是无影无踪了。</p><p>所以到最后我们的色身，是一物也留不住。原来色身是由地水火风四大组成，现在地水火风分散，都回到如来藏里了。如来藏收回了以后，再变下一世又一世的色身，把地水火风再输出来，又形成了另一个色身，再把地水火风收回去，回到如来藏里。这样看来，我们真是一无所有，一无所是，那我们就不要再执着色身，也不要执着世间任何一个物。有人说我抓着金银珠宝，那个比较坚固，比身体坚固多了。可是没有了色身，金银珠宝又有什么用呢？金银珠宝是比较坚固点，但是它们又能存多久？一劫两劫三劫，能存一大劫吗？地球散坏了，金银珠宝在哪里？金刚是最坚硬的东西，金刚又在哪里？三千大千世界都毁灭了，你的金银珠宝和金刚又在哪里？能找到吗？都消失没有了。</p><p>地水火风四大组合成的，最后又会回到如来藏里。金刚也没有了，连宇宙各层天的天宫都没有了，我们还执着个什么，一切都消失散坏了，都是虚妄的。你执着什么，抓取个什么呢？就是让你抓着了，你又能抓多长时间，其实抓着的时候就是一种苦。所以应该把我们的心，修得空空净净的，空空如也，一天到晚，就像行走在虚空当中一样，也没有一个我在行走，那个心是非常清净自在舒适的。我们证得果位以后成为贤圣人，生生世世修行，同时利乐他人，自利利人，最后成为圆满究竟的佛。我们应该这样修行，才能圆满无上菩提路。</p></div>"
},{
    "title": "第三章　受念处观",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　受念处观</strong></p><p>大念住经受念处的受都包括什么？包括六识心的感受和色身上的感受，就是身心上的感受。六识的感受是什么？是眼根上眼识的感受，耳根上耳识的感受，鼻根上鼻识的感受，舌根上舌识的感受，身根上身识的感受，还有一个就是意识心的受，意识心的受叫作心的感受，纯是心的感受。五识的感受，虽然是在五根上产生的受觉，其实也是心里的感受，五根本身没有受，是识心有受。意识心的受，大多数时候，也离不开五根，多数时候是与五识共同产生的受。心上有感受，身体上有感受，都是识心的受觉，心里的感受叫内受，心对外边色声香味触的受叫外受。</p><p>原文：<strong>然。诸比丘。如何比丘于受观受而住耶?。诸比丘。比丘若在感乐受。知我在感乐受。在感苦受者。知我在感苦受。在感不苦不乐受者。知我在感不苦不乐受。</strong></p><p>释：那么，诸比丘，比丘如何观行自己的感受，而把心住在感受上呢？诸比丘，如果比丘在感受乐受，心里要知我在感乐受；如果心里在感受苦受的时候，心里要知，我在感受苦受；如果心里在感受不苦不乐受者，要知我在感不苦不乐受。</p><p>这节世尊要教导比丘观行受念处，修行受念处观，时时刻刻都要观察自己内心里的各种感受，所有的心念都在注意感受，集中在感受上，以觉知和观行自己的感受。受分为：苦受、乐受、忧受、喜受、舍受五种；或者大体分三种：舒服愉快的感受是乐受，不愉快痛苦的感受是苦受，既不好也不坏的感受，不苦不乐的受是舍受。</p><p>修行受念处观，要如何观受呢？应该是身心上的所有感受，心里都要清楚的了知，就是说自己的心理状态和身体状态，自己都应该知道，不知道就属于无记。无记时，就不能观行了，这时可能心里在打妄想，或者是在昏沉中，那就不知道自己内心的感受，没法观行，所以修行四念处观时，心里总是要有一个知，才好观行，才能出生智慧。</p><p>苦受、乐受和不苦不乐受这三种感受，自己都应该清楚感知到。如果知道自己在感受乐，那你的心念就在自己的乐受上没有散乱，没有打妄想，也没有昏沉。在感苦受的时候，你也知道自己在感苦受，知道自己现在心里痛苦、不高兴、不愉快、很烦闷，这些感受心里都要知道，清清楚楚，不迷乱，这就是定，也有慧。</p><p>自己在感不苦不乐的受，心里也要知道，不苦不乐的受不容易知道，不容易发觉，因为没有特殊的受觉，关注的程度比较轻微，不容易引起自己的注意。目前的身心状态如果不是很好，也不是很坏，如果不反观，心不细致，就不容易觉察到，往往会遗忘，不觉知。不苦不乐时，往往不会回光返照自己，就好像把色身忘了一样，而在攀缘外身的外界，把眼前事情忘了。这时应该收回心念，把注意力集中在自己的身心感受上，来观行受觉。</p><p>应该训练自己心里时时刻刻都要有个知，意念要集中，精力要集中，心不散乱也不昏沉，心里保持这个知。有这个知的人是什么状态？人很聪明，很灵敏，也细致，观察力强，如果不知，就是不聪明或者是糊涂、散乱。但是修到无心境界的人，不在此例，他们对一切事情都是无所谓，不在意了，也没有多少感受，他们修行已得初步成就，其心不在世俗法上。</p><p>佛训练我们内心随时要有定，也就是要我们开启智慧。时时刻刻能够观察自己，有了定和慧，我们就会观察别人，会观察一切环境，都会观察了，就有智慧处理了。自己现在色身处于什么状况，别人的状况是什么，都不知道，就不能很好地处理了。要想把事情处理好，精力意念都应该集中在这个事情上，把事情看明白看清楚，在这当中就有定和慧，定和慧是同时一体的。没有定，就没有慧，无此就无彼。</p><p>什么是不苦不乐的受，我们应该知道，比如自己现在坐在这里，暂时忘记了身体，不知道有身体的存在，这时候就是一种不苦不乐的受。如果身体很舒适，就会知道，能感知到，而且会贪着；如果身体很难受，也知道，之后就会想办法消除或者躲避。不苦不乐受就不是如此了，一个人到面前来，跟自己没什么关系，看到就像没看到一样，心里没有什么感受，既不喜欢也不厌恶他，是一种无所谓的状态，这就是不苦不乐的受；一件事情发生了，一个东西处在面前，自己对这些没有感觉，都是不苦不乐的受，既不喜欢也不讨厌，不作任何的想法，都属于不苦不乐的受。</p><p>原文：<strong>若在感肉体之乐受者。知我在感肉体之乐受。</strong></p><p>释：佛说，我们在感肉体的乐受时，心里要知道，要清楚。这个乐受分为心里的乐受和肉体上的乐受。肉体的乐受是什么情况呢？比如打坐气脉通过身体的时候，身体就有乐受，身体感觉很舒服，气脉在身体里面运行没有阻塞比较畅通，色身就会很舒服，如果气沉下去到丹田了，整个身体感觉都特别好。尤其是有初禅定的时候，身体飘飘欲仙，轻安柔软，轻灵自在，如在云雾当中，心喜身乐，人间的语言没法准确形容和表达。</p><p>身体上的感受是谁感受的呢？还是身识本身的感受，肉体并没有感受，是肉体上身识的感受，就是纯身体的感受，其实也是伴随着意识心的感受，否则身体就不会有感受了。又比如自己突然被打了一下，就会觉得疼痛，这个疼痛的反应是谁的反应？是身识的反应，疼痛之后，心里感觉难受了，可能还会起嗔恨，这个苦受是谁的感受？是意识心的感受，以意识的受为主。这种受的当下有两种：一种是身体上的，一种是意识心上的，二者是混在一起的。心如果能细致一些，就能把二者分开。</p><p>或者身上划了个口子，感觉很疼痛，这种疼痛的本身有身识的受，疼的时候你心里感觉很苦，很不舒畅，那就是意识心的受。要完全把二者受分开必须有定，心细致了才行。肉体上有乐受的时候，自己就应该知道在感肉体之乐，肉体和精神之乐，都有意识心的觉受。一般人不懂这些名词概念，就分肉体和精神，其实肉体上的受也是识心，精神上的受以意识心为主，都是识心的受，它们之间有区别，也有联系。</p><p>原文：<strong>又在感精神之乐受者，知我在感精神之乐受。</strong></p><p>释：精神的乐受，是纯粹意识心的受，我们在感精神之乐受时，心里一定要知，没有知，不是散乱就是昏沉，那就无法观行了。精神之乐受，多不多呢？很多，我们喜欢的事情有很多，不管喜欢什么，都是乐受，都是精神的感受。贪着东西的时候，都有心里的乐受，因此都是精神上的感受。不贪就不会有乐受，就会觉得一般般，不太在意。如果心里不乐不喜欢的话，也不会去贪得。我们每喜欢一样的人事物，肯定都有乐受，才去喜欢，才去贪着，不喜欢就不会去贪。</p><p>在感精神方面乐受的时候，对待人、对待事、对待某个物心里都有乐受，在精神方面的乐受主要是喜欢、高兴、贪爱、快乐，只要心里喜欢一样，就是贪，有贪爱尤其是贪欲界里的法，那就不能出离欲界，贪三界的法，就不能出离三界。只要有贪，心执著了心喜乐了就会被喜贪执著捆住被束缚，不得解脱，喜欢一样东西就被这样东西所抓住了，心不得解脱。如果心心念念都是这个东西，被束缚得就很牢固，心不能空净，那就是轮回，就是生死。感肉体的乐受时，内心应该知；感精神的乐受，心里也要知，这样就不愚于目前身心当中的任何一个法，说明内心里有定也有慧。</p><p>原文：<strong>或在感肉体之苦受者。知我在感肉体之苦受。</strong></p><p>释：在感肉体之苦受时，心里也要知，只有知了，才能仔细地观行，从而知道这些感受都是生灭无常的，虚妄非我。肉体方面的苦受多不多呢？肯定也很多。现在冷天到外面，风吹到身上是不好受的，这就是肉体上的苦受。这种觉得外边很冷的感受，以肉体和精神的哪个受为主呢？这时是以身体的觉受为主，同时有精神上的轻微觉受。</p><p>如果是太冷了，肉体的苦受很严重，那么精神上的苦受就会增加了；身体的感受实在太苦了，心里就会非常烦恼，那时候精神上的苦受就突出出来了。什么时候以什么感受为主，是不一定的，二者不是完全的平等地呈现出来，如果是有修行人，意志坚强的，有所追求的人，就不太会在意肉体的苦受，他的精神就不会感受苦，这是因人而异的，看人的承受力如何了。</p><p>身体的苦受时间长了，会转换成精神的苦受。比如说有病了，刚开始扎针心不觉得苦，如果每天都扎针，心里就会觉得烦了，尤其是病情不见有好转，心里就有负担了，精神的苦受就多了。所以感受有时候侧重于身体的方面，有时又侧重于心理方面，也就是精神方面、意识心方面。突然被打一下，虽然身上会很疼，但是有些人心里是不反感的，那时心里就没有苦受；但是总被打，内心就受不了了，那时身苦，心也苦，心苦就比较明显了。所以身心的感受会发生变化，侧重面会转移。</p><p>自己在感肉体的苦受时，心里要知，在感精神的苦受，心里也要知。每天到外面风吹日晒，干着繁重的体力劳动，肉体上会有苦受，回家后身体哪里都疼，都不舒服；或者有风湿时，身体感觉非常的沉重，这些都是身体上的苦受，苦受多了，心里就很烦躁，心里的苦受就强烈了，越来越多了。当身苦心也苦的时候，那是最苦的。有些人干活很累很累，累是不是苦呢？但是他心里高兴。别人打你，你也许很高兴，所以色身之苦，与精神之苦，两个未必就同时出现。</p><p>原文：<strong>又在感精神之苦受者。知我在感精神之苦受。</strong></p><p>释：感精神之苦受，就是在承受心里的苦，主要是意识的苦受，心里也要知。如果心不细致，精神心灵的苦受也不容易观察到，不容易感知。其实我们精神方面的苦受也很多，越是敏感，越能感知到种种的不如意、不如愿、不可心、忧愁、烦恼、苦痛、忍耐和煎熬。如果心里愚痴麻木或者粗枝大叶，有些轻微的烦恼就感觉不到了。修行人达到无心的状态除外，他们是什么也不在意的。</p><p>有些畜生很苦，可是牠们不知道苦，没有觉悟，为什么不知道苦呢？就是因为愚痴。我们做人是很苦的，可是为什么有很多人活一辈子苦一辈子却不知道苦呢？也是因为愚痴。因为众生愚痴，佛就要来人间教导众生，告诉众生五阴是苦，十八界是苦，三界都是苦，让众生觉悟到苦，然后发起出离心，精进修学佛法。如果众生不愚痴，就用不着佛来教导我们，佛就不用给我们讲苦集灭道四圣谛法，因为我们愚痴不懂此理，不懂苦谛，佛才来教化我们。</p><p>现在修四念处，就是让我们不愚痴，时时刻刻在感受在觉知，心里总有个知，总有个觉照，以后就会知道这个受是苦的。知道苦了以后，就会想办法把苦消灭掉，消灭苦只有来修学佛法，修行四谛理，才能灭苦。灭苦的方法，通过学四圣谛，我们就会知道了，是要灭心，心灭了，苦就灭了，就得解脱。灭什么心呢？灭贪爱心。这也喜欢，那也喜欢，什么都喜欢，喜欢来喜欢去，贪心不断，自己就被束缚在欲界，不得解脱。其实贪也贪不到什么，反而因贪造作了生死业行，那么苦受苦报就都贪来了。</p><p>贪的结果是什么？结果都是苦受，如果不贪，心就没有所求，没有贪求，就没有热恼，心里是轻松自在，没有系缚。我们再不造作生死业行，不被六尘境界所束缚，心就能解脱出来了，不会被系缚在三恶道，也不会被束缚在三界，在六道轮回里出不去。我们之所以不自在，就是因为内心里有贪嗔痴烦恼，执取一切法，造作一切生死业行，那就要受生死果报，那么苦受就来了，所以我们一切的苦报就是贪爱为根本。</p><p>知道有受皆苦的道理以后明理了，就不再贪爱，不贪爱以后，苦受就少，越喜欢越贪爱，心里越不清净，越有挂碍，一切事情越不如意，心就越苦。我们在感精神的苦受时，心里要知道，每种苦受都要知道，心里总是带着知，智慧就能生起来。我们对一切法的感受都是苦的，即使乐的时候，也是苦。懂得这个苦谛，就有智慧，以后再也不追求感受，慢慢的就会离开贪爱。</p><p>原文：<strong>或在感肉体之不苦不乐受者。知我在感肉体之不苦不乐受。</strong></p><p>释：第三种受就是不苦不乐受，身体现在的状况是不苦不乐，心里也要知道，现在的身体既不是太轻松，也不是太沉重太烦重，也不太累不太苦，比较适中，中和到很平稳的时候，几乎就感觉不到色身的存在，这就叫忘身。忘身就是偶尔不知道身体的存在，身体的感受是既不苦也不乐，舍受的时候，往往就感觉不到色身的存在。</p><p>有时心里在考虑另外一个重要的问题，不注意身体，这时身体就是不苦不乐的受。这种情况是不多的。如果禅定功夫比较好的，身体的乐受会比较多。如果禅定功夫不好的时候，平时身体的苦受是比较多的，不苦不乐受有时也会出现。睡着无梦的时候，感觉不到身体，因为没有六识。有梦的时候，有时还会感受到身体的疲乏或者累。</p><p>原文：<strong>又在感精神之不苦不乐受者。知我在感精神之不苦不乐受。</strong></p><p>释：身体上不苦不乐的感受时时刻刻都要知，精神上、心理上、意识心上不苦不乐的受，也要时刻知。心理上不苦不乐的受多吗？不多。说明了什么呢？不苦不乐的受是比较平和平稳的，有苦有乐的感受，心不清净，肯定是喧闹的。说明我们的心理很少有太平、平静的时候，心理上精神上不是苦就是乐，总是在喧闹着。我们玩乐的时候，好像感觉挺快乐，快乐的时候，心就不清净，曲欢人散的时候，那种落寞的感受，就是苦。乐的当时也是苦，心里不希望这个感受消失，不希望快乐过去，就想一直抓住它，那时候心是苦的。想要抓取人、事、物、理，这种抓取的心是不是很苦？凡是有所求，都是苦。</p><p>每个乐受当中是不是都含摄着苦呢？我们可以找找哪种乐受当中没有苦。苦有苦苦、行苦和坏苦三种，坏苦，是这件事情虽然让人产生了乐受，但是不能久长，这件事情终究会消失不见，当感觉乐受的同时，心里会担心失去，这就是乐受当中的苦受；当事情终于过去了，心里会产生失落感，这也是苦受。在享乐时，乐受会迁流变化，内心不希望这个乐受结束，于是心里就是苦的。而且乐受时间长了，就自然的不觉得是乐了，心里习惯下来，也就没有乐受了。</p><p>当我们升官发财的时候，亲人聚会的时候，这里都有苦受。当内心非常喜乐的时候，心就不是平静的，本身就是一种喧闹不寂静，所以乐受本身就是苦。亲人聚一起，心里是高兴，但是高兴的当中也有苦恼，一方面担心亲人会散去，一方面还要为聚会做好多准备，要做很多事情，很麻烦。聚在一起的时候，各种各样的事都需要去处理，也许还有很多的矛盾，这是不是苦受？都是苦受。过年过节做点美食，吃的很高兴，可是还要做各种准备工作，之后还要收拾，也都是苦。其实没有一种乐当中没有苦，太乐了就怕这种乐消失，而且要为这种乐付出代价，所以在这个世间里没有纯乐；行苦，经历每个人事物理时都有行苦，都有生住异灭，最后都会消失灭亡，不能长存，这就是行苦；老病死本身就是苦，是不可乐事，所以叫作苦苦。</p><p>最后是佛告诉我们一个真理：所有的受都是苦受。如果受里有乐，佛就不会让我们观受是苦，并且告诉我们不要追求感受，如果受都是乐，我们就不愿意去断除感受，还会去贪求感受。因为有受皆苦，乐受也是苦，苦本身也是苦，不苦不乐中还是有苦，所以一切受都是苦。</p><p>如果刚从天上下来，来到人中，人中再乐的事，自己能感到是乐的吗？当然不能，人间天上反差太大，心里就会生出严重的失落感，别人沉浸在各种乐受中，自己就会感觉非常的苦恼，非常郁闷。因为我们在天上住过，知道天上是什么样的境界，多么地殊胜和美妙，再看人间，那就没法对比了，这两个落差简直太大了，心里能感到高兴吗？一个天女在天上是什么生活境界，到这边嫁给一个种地的农民，她会是什么感受？</p><p>一个人如果是接触过美好的事物，再接触丑陋下贱的，心里肯定会接受不了。那我们如果是从人间突然到了天上呢？由低到高的飞升，那是真快乐。所以一切的乐受，都是有相对差别的，越愚痴越容易满足，越能感觉到乐，越见过世面的人越不容易知足，越不会感受到乐。因为他经历的事物多，眼界开阔，见多识广，他就有识别好坏的智慧，不会轻易就满足，不会轻易感到快乐。</p><p>佛要我们对不苦不乐的受也要知，身体在感受不苦不乐的受，心里要清楚。比如打坐时，刚才身体一直很沉重，现在气脉通一些了，身体就稍微舒服点，感受就从苦受一点点转到不苦不乐的受，最后身体有一种乐受出来，这其中就有一种不苦不乐的受，心细一些，应该感知到。有时候我们集中精力想一些事情的时候就把身体忘了，身体本来是苦受的，这时忘了，那就不是苦受，而是不苦不乐的受了，否则就会继续感知苦受或者是乐受。</p><p>在精神上心里上的不苦不乐受也要知，如果心里麻木就感觉不到，明明这个事情是令人很难受和痛苦的，可是愚痴人就不知道痛苦，内心麻木。修行好的人，无心的人，心里也是麻木，对于逆境和苦境，就没有苦受，对于顺境，也没有乐受，并不觉得怎么样，总是与不苦不乐受相应。定和慧是连在一起的，越有智慧，越能观察到一切受都是苦，就不会再贪着受。如果能再修出一些智慧，就能在一切苦受上，感到不苦不乐受。</p><p>所以众生的感受各个不同，这要看各人的素质和智慧程度、觉悟程度、学法的程度、聪明程度、伶俐的程度。为什么一个人一个感受呢？因为心里认知不同，智慧境界不同，同样一件事发生了，有人是这样的感受，有人却是那样的感受。比如在一个村落里，有一棵上千年的大树，非常高大，一百个人来观看这棵大树，就会有一百个观念和看法，树是一样的，人心不同，感受就不同，知见看法就不同。每个人心有差别，那么每样事物在心里所呈现的状态就不一样，然后认知就不一样；认知不一样，感受就不一样；感受不一样，身口意行就不一样；身口意不一样，造作的业行果报就不一样。感知领会一件事，圣人感知，凡夫也感知，可是认知和感受都不一样，心不同智慧境界不同所致。</p><p>佛教导我们修定修慧的方法，我们懂得各个法的概念和内涵，在作观行时，注意力都在观自己的感受上，一点杂思乱想都没有，定马上就出现了。有定时，再作观行，观行得就会越来越深细，所以是定慧同时存在，定慧等持的。</p><p>有定就有慧，没有获得禅定，观行就很困难，观慧不足，观行也很困难。如果真正想观行好，在无人打扰的时候，观行一小时两小时，注意力都在观行的内容上，就会把自己忘了，心里都是观行的法，那时身体状态，心理状态都是非常轻松愉悦的。色身的气脉打通了，身体轻松，心理感受也舒服，外面的境界再来了也是无所谓的，这就是定慧。所以修道就是好，如果不修道，心理烦乱的很。</p><p>不管哪种方法只要掌握了，道理通了，修行就不那么困难了，难易在人，当对观行的方法不熟悉时，就会觉得没有入手处，万事在开始这个阶段有些困难。熟悉了以后，就能够理解其中观行内容，然后自己下决心，找一个适当的时间和方法，努力观行，就可以入道。修行是逐渐由陌生转到熟悉，熟悉了以后，行住坐卧都可以观行，随时随地的进行观察、观行，智慧和禅定都会同时增长，身体的觉受也就好了，这就是修行。</p><p>原文：<strong>如是。或于内受观受而住。于外受观受而住。又于内外受观受而住。</strong></p><p>释：这里就涉及到内受和外受。受也分内受和外受，现在正感受身体很疼痛，这是内受；心里想起某件事情感到高兴或者是不高兴，这是内受；内心感觉苦闷、忧愁、烦恼，这是内受，围绕着自己整个内身、色身、内心的感受，叫作内受。</p><p>什么叫外受呢？就是对于外身的感受，外身就是外界的色声香味触法。比如眼睛突然看见外边过来的事物，这个时候心上对色尘生起的感受，就是外受；外面一个石头砸到身上，这个时候生起的感受，就是外受，这是心和外界色声香味触接触的时候，所产生的感受，就属于外受。耳朵突然听到外面刺耳的声音，耳识和身识出现的感受，就是外受，耳识觉得非常的刺激，有苦受，就想躲避开，不想听，心里的感受就觉得苦恼不高兴，就属于外受。</p><p>内受，一个是对于自身身体上的感受，再一个是心里回忆思念时产生的感受，生起的酸甜苦辣的滋味，不接触外法所生起的受觉。其实哪里有外呢？都是内，假名为外。一接触外界，心里所产生的感受就可以假名为外受。香味来了，心里非常喜欢嗅，生起喜欢了，这就属于外受；臭味来了就觉得厌恶，马上把鼻子堵上，那也是一种感受，是对外界事物的反应，都可以叫作外受。</p><p>对色身内的、思想内的感受叫内受，其实这里没有严格的区分界限，这一切都是我们五阴十八界内的，我们接触的都是自己的内相分，严格来说都属于内，方便说为外，对外界六尘的感受假说为外。小乘分个内外，大乘法就不讲内外，小乘声闻人不知道都是如来藏出生的一切法，佛就不能那么讲，于是就给分出个内外界和内外受，其实都是我们自己五阴十八界之内的法，也都是六识心的心内法。</p><p>佛要我们于内身观内受，于外身观外受。外界的色声香味触法来了，就有外触和外受。外界的触是什么？太阳光一照，风一吹，按照我们的概念来说这些法是不是属于外界？我们就会出现身体和心里的感受，这些是不是外受？其实没有外边的境界，都是心内的境界，因此都是内受。我们现在打坐时，身体感觉很舒服，这是内受；气脉通到肠胃了，感到那里挺舒服，这也是内受；喜欢打坐不愿意下座，这是内心对禅定的感受，感觉很愉悦，这都是内受。</p><p>然后又于内外受观受而住，现在修行到心量比较大，定力增强了，就能同时了知内受和外受。比如知道现在身体非常调和舒适，又能感受到外面阳光的照射，使得身体暖融融的，这两种感受心里同时都知道，这时定力更高一些了，慧力也更强一些了。知道的事情越多越清楚，慧力越强，定力肯定是越高的。定慧具足时，一切的感受，内心都清楚知道，太阳光照射在身上时身体的觉受心里知道，身体内的感受也知道，对香味的觉受也知道，听到声音的感受也知道，一切的受心里都知道，定力非常强时，这一切法才能都知道。</p><p>慧强的时候，一切法分别的都很清楚。什么叫智慧呢？知，就是智慧，不知，就没有智慧，一考问，就不知道了，那就没有智慧。没有一样不知的，就是智慧，尤其是正确的知，不是错误的知，就是大智慧。没有智慧的时候，什么事情也不知，一问三不知，日常生活的小事情，一问也三不知，我们就不能说他聪明有智慧，根本就没有一点慧力，此人既看不明白自己，看不明白其他的人、事、物，不会作观察。所以观行时，总保持着一个知，就是定慧双修，那我们就会证得一切法。</p><p>原文：<strong>或于受观生法而住。于受观灭法而住。又于受观生灭法而住。</strong></p><p>释：什么法叫生法，什么法叫灭法，什么法生了，什么法灭了，我们心里知道吗？哪种感受生起来了，为什么要生起来，感受上有什么变化，心里都应该知道。现在心里正是不苦不乐受，突然出来一种感受，从无到有，就是新生起来的一种感受，其实感受生起来，就是转化了，由原来的不苦不乐受，转为苦受或者是乐受，或者转为另一种苦受，这种受生起来，那种受就没有了。</p><p>现在很苦的时候，突然得到一百万，内心就不痛苦了，转变为快乐；苦受消失，乐受出生，受觉就转化了。这个转化有时是完全转化，有时是不完全转化，如果苦受是五分，转化为乐受一分，这个苦受就剩四分；转化乐受两分，苦受就剩三分；完全乐的时候，就没有苦了。其实完全是乐受的时候，还是有苦，只不过苦受很深细，不容易观察罢了。</p><p>这种受生起来了，那种受灭下去了，心里都应该知道，这种知中就有定有慧。没有定，心散乱就不能知道哪个法生起来了，哪个法灭下去了。在色身上，内受外受，也同时都知道，这时的定慧是非常强的。也许能做到眼观六路、耳听八方。定慧强的人，在做一件事的同时，就能把其它事情都了知到，分析清楚，并且能安排好。这方面、那方面的事情，同时都能想到考虑到，这说明人的精力非常充沛，做的事情非常多，效率也非常高，这样佛法的修行，在世间法上，就得到了应用，得到了受益。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有受之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于受观受而住。</strong></p><p>释：当我们在观行受念处的时候，心都会住在受上，观行到最后就是这样，心心念念都是在体会受觉，那就住在受上了。这种感受的心念就是六识心，识心体会各种感受，观行各种感受的虚妄无常性，具有了一定的智慧，有智慧的识心，就叫智识。如果不知感受，也不知感受虚妄的时候也有识，但不是智识。我们观行成功，心心念念当中的各种受，自己心里都知道，这种识是有智慧的，就是智识。</p><p>智识当中全部是受觉，最后要把这种受觉也抛掉，观受也是无常，不要住在感受上，所有的受也都要空掉，受觉也是空的、假的、苦的、非我的，内心深处认识到这点，那就能断我见，心中不要再贪着受，不要执着感受，要灭掉受。灭掉受是什么思想境界呢？就像阿罗汉们一样，不认取感受为真实，不执取各种感受，不去追求各种感受，就不会再贪爱了。灭除内心的感受，也是灭生死轮回的一个环节，十二因缘里就有一个受的生死链条，修行因缘法也要把受空掉。</p><p>受念处观观行到最后，应当舍弃内心里的所有受，然后心无所依，无所依而住，心里不依任何法，任何事物也都不要去依赖，因为都是虚妄，什么也靠不住，有所依赖的心，也是生死，不脱轮回。舍弃一切受之后，内心空空荡荡的，不着一法，认可五蕴全部都是虚妄的，就能断我见。不仅受觉心里不依着，世间里任何法任何物，也不要依着，也不执着，心念就空了，到这时候就是声闻三果四果的境界了，这就是一个观受的全部过程。</p><p>佛讲这些观行很快就讲完了，但是弟子们受教修行成就时，所用时间就不等了，有修几年的，有修几个月的，有修几天的，有修几小时的，就把这些内容修完了，证个小乘声闻果位，四念处观就观修完成了。无论是大乘人还是小乘人，一个人一个根基，根基不同，修道的速度就不同。修行也看各人的福报，没有福报就没有整块时间来连续不断地观行，有福报的人就能抽出时间来连续观修，他就能很快修成。修行和福报也有一定的关系，和我们的定力也有关系，和慧力更有关系。</p><p>有的人本来心就清净，心里从来不乱想，坐下来观行，一修就成功。有的人心里的攀缘太重了，心念就不能有效的收拢，怎么修都是妄想一堆，那修行就很困难。智慧不够好的人，修观怎么用功也观行不出来，一些名词概念都弄不清楚，观行就更困难了。众生的根基千差万别，修行快慢因人而异，看看每个人所具备的修行条件具足多少，条件越不具足的修行越慢，条件越具足的修行越快。有些人总是说自己没时间修行，又忙又累，原因是什么呢？就是福报不具足。</p><p>为什么福报不具足呢？前世或者是贪，或者是吝啬不肯布施，或者是烦恼性障重，福德聚集不起来，消耗福报的地方非常多，烦恼现前，发作起来，肯定是有损福德的。每个人都要检查自己的心行，检查自己的六度条件，让自己福德赶快具足，多寻找自己的原因，找自己不足，然后想办法弥补不足，就得要改变自己了。一味地强调外界的原因，就是不找自己的原因，于事无济，于修行不利，应该认识到这些原因是如何造成的。</p><p>为什么如此？其实还都是自己的原因，谁让自己这么忙，这么样为生活奔波，那些天人怎么不奔波于生活呢？那些菩萨怎么会在十方诸佛国土不考虑生活问题呢呢？其他人为什么有闲暇时间修行呢？找到原因了，想办法弥补，不能再像从前那样，那就要多修福，多修慧，减少贪嗔痴，减少各种烦恼的习气，让自己少流失福德，多集聚福德，福多了，修行就快了。</p></div>"
},{
    "title": "第四章　观心念住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　观心念住</strong></p><p>接着讲第三观观心而住，四念住就是观身不净、观受是苦、观心无常、观法无我。观心这一小段内容不长，但是其义却很深广。</p><p>原文：<strong>然。诸比丘。比丘如何于心观心耶。于此。诸比丘。比丘心贪者。知心贪。</strong></p><p>释：佛为了让诸比丘都警觉下文所说的内容，就加强了语气说：然。这样比丘们就警觉起来，精力集中专注听佛往下讲。佛说：比丘如何于心观心耶？如何看着自己的心来观察自己的心念？观心就是观心的思想行为、烦恼习气，观心上的念头念起念落。诸比丘，此观心的方法就是自己心贪的时候，要知道自己心贪了。</p><p>观心先开始观心的贪相，心起贪，就要知道心贪了。凡夫的心念一般是什么？无非就是内心里的那些烦恼心所，贪、嗔、痴、慢、疑、恶见，还有一些善恶是非观念，以及心量的大小广狭，首先都通过心念的形式流露出来。自己的心念是解脱的还是有贪嗔痴烦恼系缚的，要观察一切时处的心念就能知道了。把这个心行心念观察出来以后，自己慢慢就能够对治了，也许你会找到一些方法来对治，也许你不用刻意对治就能降伏，这就是观心的作用。</p><p>这里有两个重点，一个是心贪，再一个就是知。这个知很重要，知、了知代表着觉悟，知为什么这么重要，因为无量无边的众生就是因为不知自心、不觉悟自心，而流落于六道生死轮回，流落于生死苦海当中，不得解脱。不知是无明，知是觉悟。觉悟的是什么人？觉悟之人就是圣贤人，不觉悟的人是生死业障凡夫。第一个，当我们心起贪的时候，自己一定要能够回光返照自己，照见自己的心念和心行，觉照到自己的心正处于贪的状态之中。</p><p>什么叫作贪？贪就是喜乐于境界，黏着于境界，执着于境界，抓取于境界。对境界取相，然后再分别、执取、执着，这就是贪的行相。贪所取的范围是什么？观察一下我们都贪些什么？首先是贪色，对色生贪心，这个色的范围很广，眼所见的一切法都叫作色，包括人和物种种境界，当色尘各种境界出现时，眼根看见之后，心里就起贪着、贪爱、喜乐、喜爱，着境、执取、抓取，各种心念就出来了。</p><p>众生无量劫一直都处于这些心念之中，从来没有觉悟过，不知道这种种的心念属于贪念，是生死轮回的因，因这些贪念而无量劫堕于三恶道中。在六道轮回里为此受苦无量而不自觉知，就是因为把握不了自己的心念，以至于让不如理的心念一直泛滥下去，流转到无量劫，一直到现在。现在遇到了佛法，一定要用佛法觉悟自心，对自己的心要觉知、觉照，对照佛法反观检查，然后把握自己的心念，改变心念。去除不善的心念，断除贪染心念。这样才能够心得解脱，脱离六道轮回。</p><p>其次是对于声起贪，各种各样的声尘与耳根相对，耳根听到了声音，对于可意声就生起喜乐之心，听到不合心意之声，就生起厌恶之心，因此贪厌之心不断的追逐着境界，黏着于境界、执着于境界，心就被声尘所束缚住了，不能脱离声尘，当然就不能脱离六道轮回。这就是无量劫生死轮回的因。</p><p>因为心里认为声音是真实有的，才对声音起着喜贪心、厌恶心。听到赞扬自己的声音，心里就高兴，高兴是什么心？是取着境界的心，贪着境界的心，贪着声音的心。耳根听声音所起的贪念是造业的因，是生死轮回的因，喜欢被人夸奖被人追捧，喜欢名声名气，喜欢被人恭敬，这都属于贪心。因此贪心不能脱离境界，被境界黏住粘住。本来是我们想去抓取境界，执取境界，最后结果却被境界所捆住、束缚住、拴住了，这样我们就不能脱离境界，不能脱离三界生死轮回。</p><p>那么在见色听声的时候，我们一定要回光返照自己的心念是什么，处于一种什么状态，贪的时候一定要知道心在贪，要知道心在执取、抓取境界，心在喜乐于境界，着于境界，就应该知道这种心是不应该有的，应该断除，应该离去，这时就开始觉悟了。因此觉悟以后就能有机会有力量断除贪爱；断除贪爱后，心就能够得到解脱，证得慧解脱，当智慧也得解脱，不被贪爱所遮障时，才能够出离三界六道轮回。</p><p>贪的另一个对相是香尘，鼻根与香尘相对，不管是香味还是臭味，或者其它任何一种味道，凡是与鼻根相对的都是香尘。鼻嗅香时，观察心是一种什么状态，心念如何，是否是贪染的。我们凡夫一般都喜欢香的，觉得嗅到香味心很舒服很愉悦，如果臭味出现了，就会心生厌恶，躲避厌离。不管是喜欢香尘还是躲避香尘，都属于执取香尘，在相上有了一种分别，有执取属于贪厌心。这个心念就是生死轮回的因，因为取了境界、执着了境界，认为这个境界是真实的，没有把心空掉，就被这个境界所黏缚住、抓住了，到临终的时候，因为心没有脱离这种境界，就被这种境界锁在三界六道生死轮回当中，所以贪取香尘是生死的因。执取香尘，不得甚深的禅定，因为定里心是空的，心有物不空，就没有禅定，不能解脱。</p><p>味尘也是心贪的对相，舌尝味的时候，遇美食美味则心生贪，对于不可意的味尘生厌离，有贪有厌的心，被味尘黏缚住了，心无法脱离味尘境，被境界所系缚不得解脱。当味尘出现的时候，执取味尘相，生贪生厌，心就不得自在，不得解脱。抓取美食的时候，就被美食所抓住了，美食在三界里，属于三界世间法，尤其是属于欲界的法，心就不能脱离欲界。</p><p>贪味尘香尘这两尘，不能有初禅定，不能脱离欲界到色界，初禅定不能成就，心就被锁在欲界里，别说三界，欲界都出不去。由于贪人间的味尘，欲界定都没有，欲界天都去不了，贪人间的法，不会有天上的禅定，贪欲界的东西，包括贪欲界天的境界，色界的禅定就不能有，色界天就去不了。</p><p>属于欲界的法，贪它就不能出欲界，属于色界的法，贪它就不能出色界，属于无色界的法，贪它就不能出无色界，因为心与境界捆在一起不可分，脱离境界才能得解脱。心不得脱离境界，不得解脱于境界，欲界都解脱不了，别再说色界和无色界。所以平时贪饮食贪味尘，或者贪色贪声贪香贪味都不能得到解脱。</p><p>再说贪的另一个对相触尘，先说从外界来的，比如说衣服和色身皮肤的触，接触的触，还有光的触，各种境界对色身的触，这都属于触尘（男女欲贪更不用说了）。色身身根身识着了触的境界，喜欢触尘或者厌恶触尘，这都属于贪的一部分。喜欢喜乐都属于着境界相，当我们黏着了境界、执取了境界、分别了境界，就被这些触尘的境界所黏住、束缚住，这样的心不能脱离于触尘，和触尘在一起，就不得解脱于三界境界，欲界也不能解脱出去。</p><p>抓取境界的结果就是和境界在一起，境界在哪里？境界就在三界里、在生死轮回里，境界不出三界，心和五阴身就不能出三界，而境界永远属于三界的法，不能出三界。当我们贪欲界的境界时，就永远出不了欲界，有人愿意和境界锁在一起，永远捆在一起吗？当然谁也不愿意。可是当境界来了，心就执取了境界，肯定就被束缚住了。境界来了先有个相，相上又安了一个名，安了一个名就分别了，分别以后就执着抓取，这样心就被境界困住不得解脱，不能和境界分离，就不能出三界，就不能在境界上得解脱。这就是不自在的生死因。</p><p>心最后贪着的一个六尘境界相就是法尘，法就是五法境界上显现的细微法相，一切境界都是法，我们把一切境界都取一个相、安一个名，生起分别，就有了各种心行，贪嗔痴慢善恶心行都有，被六尘境界束缚住不得解脱。生死链条和境界拴在一起，境界不出三界，我们就不出三界。境界不出欲界，我们就不出欲界，我们想升天享乐，想有初禅、二禅、三禅、四禅的定，想到色界天就不可能了。</p><p>欲界人间境界我们抓取不断，欲界天界的境界，我们就接触不到。越抓取下层的境界，上层的境界就越接触不到、享受不到，离我们越远；越执着三界的法，我们离佛的境界越遥远。要想达到最高层次的境界，就要舍弃低层次境界。因为心是有限量的，不可能什么都抓取得到，执取欲界的法，就没有色界的法，执取色界的法，就没有无色界的法。</p><p>那我们应该要什么法？努力争取最上层次的法，那就把下面层次的法，一层一层的全部舍弃，不执取、不抓取、不黏着、不贪爱，也不厌恶。对这些境界心不着，心不着叫无所谓，因为所有境界都是空的幻化的，不应该生起分别心，不生起分别心就是不着境界，把境界当作幻化的、空的、不实在的，这样的心就是解脱的、自在的，然后生死由我们自己来把握，不被境界所扭转。</p><p>无明要有一颗觉照的心，先觉照自己，在境界上生起了贪念的时候，一定要觉悟。修行就要先觉照自己，不要去觉照别人，或者你觉照了别人，发现了别人心贪的时候，也要回光返照自己，我有没有同样的心念，发现自己有同样的心念怎么办？就要知道这个心念是不好的，是有生死过患的，知道了以后，这个问题慢慢就能处理好。先有个知，这是最初步的最重要的，知了以后下一步怎么办？如果贪念很严重，可以想一些办法来对治，不严重的心里知道就好办，贪念慢慢就会减轻了。对治的办法也许要悄悄的实行，心行的变化，意识最初未必能观察得出来。就像有一个窃贼，要来家里偷东西，第一步，知道他是一个贼就好办了，知道以后我们可以坐在家里看住他，这个贼知道被人发现，不好意思再偷东西，就退回去了，我们从此不再被洗劫不被盗，从而保障了自己的生命财产安全。</p><p>原文：<strong>又心离贪者。知心离贪。</strong></p><p>释：当修行一段时间，面对境界心不贪的时候，也要有一个觉知觉照的心，心里知道自己现在处于不贪着境界的状态，色尘出现在面前无所谓不在意，不喜不厌。声音出现在面前无所谓，不喜不厌。如果听到辱骂的声音心里很生气，这是着了境界、取了境界，把境界当作真实，被境界束缚了，其实声音这个境界不管是赞扬还是辱骂，境界本身都是空的、幻化的、不真实的、生灭的、无常的。从大乘法角度来讲，都是如来藏变现出来的各种假象，因此不要对这些声尘生起贪心、喜乐心、厌恶心，尽量把境界看空，做到这点是相当不容易的。</p><p>即使不能看空境界，境界仍然是幻化的空的，心不着境界时，境界就不能拴住心，当心着境界时，其实境界还是不能拴住心，束缚不了我们，是心自附境界而已。心于境界不着时，就是自由的、自在的、解脱的，生命就有价值有意义有乐趣了。心离贪时，内心要知，表示自己有反观力，有觉照力觉察力，有禅定有智慧，</p><p>原文：<strong>又心嗔者知心嗔。又心离嗔者。知心离嗔。</strong></p><p>释：佛说：当心里有嗔的时候，应当知道心嗔了。什么叫作嗔？俗语说不高兴、生气叫作嗔，心里生起一种不愉快的感觉感受，生起一种厌心叫作嗔，于境界不喜叫作嗔。对六尘境界不喜之后心起波澜，心中不平，生起怨恨、恼怒、愤怒之后，再生起违害心，都叫作嗔。嗔的对象还是色声香味触法、人事物理，其中色也包括我相人相众生相。严重的嗔叫作暴怒，暴怒之后就要采取行动了，嗔心生起来首先是伤自己，其次伤他人。嗔念生起，以及想报复的时候，心就被境界黏缚住，不得解脱不得自在，到临终的时候，就被境界和业缘拘锁在六道里，尤其是三恶道里。</p><p>境界都是在三界当中，欲界里的境界最多，最有吸引力，众生最不容易解脱于欲界。造了嗔业，业种存下来，就要在欲界里受报，在三恶道里受报，这是业系众生的原理。所以当我们对境界起嗔心的时候，一定要生起觉照心，修行首先要有个知，知自心之后，下一步才好采取一些方便的方法措施，让心离嗔，这就是修行。如果第一步不能觉知到嗔，也不会赶走嗔心，降伏不了嗔心，就会随嗔心而流转，业行就会造作出来。</p><p>当面对令人气恼的境界而心里不生嗔，也不想报复人时，心已经离嗔了。离嗔有时指断除嗔心，有时不一定是断除嗔心，嗔心也许还眠藏着没有起现行。心不起嗔念也许是压伏着嗔念，不是断除。压伏、降伏和断除三者有层次上的差别，压伏降伏嗔是初果二果之前的人，三果以后才能断嗔。三果之前是离嗔，离有很多的含义，也许三果里也包括离，因为心里没有嗔的现行烦恼就是离。</p><p>心现前没有起嗔心，可以叫作离嗔，但不一定就是断嗔。如果嗔心永远不现行，就是断嗔。一定有初禅定才能够断嗔，初禅定之前是降伏、压伏，离不一定是断。弄清楚这些概念和内涵就知道自己现在修行层次在哪一个阶段。</p><p>原文：<strong>又心痴者。知心痴。</strong></p><p>释：佛说，如果心愚痴者，要知道自己此时心里是愚痴的。痴的含义最不容易定义和弄清楚，更不容易检查出来，因为愚痴，所以才不容易发现自己的愚痴。贪嗔痴三个烦恼，贪欲最容易断除，嗔在其次，愚痴是最难发现和断除的，一念无明属于愚痴，对三界贪爱也属于愚痴，乃至于嗔恚也属于愚痴，先不说其它更细微的愚痴，都必须是从三果人开始断起，四果才能断尽，而真正要断尽所有的愚痴无明，要到佛地才能断尽。愚痴也叫作无明，无论三界世俗法还是佛法，凡是心里所不懂、不知道、不明白、不会的都叫作痴，都属于无明。有无明就没有明，明就是明了，无明就是心里没有光亮是黑暗的。</p><p>成佛路上需要破除的无明，无数台电脑也数不清，就像空中的灰尘，就像海边上的沙尘一样的多，根本无法数得清，既然如此，谁还能起慢心说自己很有智慧？即使现在修出那么一点点境界根本不算什么，站在一定的高度和广度观察，我们只是空中的一粒灰尘而已，只是大海边的一粒沙子而已。再从十方世界的角度观察，我们更算不了什么，十方世界诸佛和诸大菩萨有无量无边之多，其智慧极其深细和广大，我们与之相比犹如滴水与大海，所以根本没有资格生起慢心，有慢心就是愚痴，就要想办法对治降伏和舍离。</p><p>愚痴的范围很广很微细，几乎涵盖到方方面面各个领域。对于五阴世间的认知，对于见闻觉知性的认知，对于三千大千世界的认知，都是无明。对于四圣谛理愚痴，对于解脱生死愚痴不懂，不知不证，对于法界实相愚痴不懂，对于诸法无我愚痴不懂，对于成佛之理愚痴无知。于是把接触的一切法都当作我和我的，认为都是真实的，无量劫造作了无量的愚痴业。痴的范围最广最细，断除最难，生起任何一种烦恼和习气都是因为愚痴，包括喜心和乐心，全部是因为愚痴无明。如果小乘解脱六道生死轮回的愚痴无明断尽了，就是四果俱解脱和慧解脱的阿罗汉，大乘成佛的愚痴无明断尽了就是佛。菩萨还有无量无边之多的愚痴无明，尤其是成佛路上的法更多更细腻，这些法都不知就是愚痴。</p><p>愚痴无明的种类，有一念无明，无始无明，尘沙无明，细分种类就更多了。世俗人对于世俗法的愚痴无明就有极多，如果世俗法都通达了就是佛，只要不是佛，世俗法就不能全通，只有佛才能通达所有的世俗法。众生在世俗轮回了无量劫，世俗法还是不懂做不好，做人也做不好。</p><p>如果严格定义无明，框定无明的内涵和范畴，只要有心有所求，就说明把境界当真实，把一切法当真实了，那就是无明。这些无明需要极长时间一点一点的破除，一天二六时中包括睡觉，都要生起觉照，境界出现时，要生起觉照的心，明白这是空的幻化的无常的，是如来藏假借各种因缘变现出来的。一切境界不管好坏，都是幻化的，不是真实的，心不着，心不乐，空空的，不起心念，无明就破了。没有境界就没有心，没有心发现不了自己的无明。那怎么去给它剪断？就要在境界当中剪断，尤其是在逆境当中剪断。因为逆境当中生起那个心念更多。没有逆境，你这个烦恼不现起，那么菩萨的烦恼习气也不现起，不再现起时就深深埋藏着，你拿这个剪刀来就剪不掉，因为你这把剪刀没有用。</p><p>这个剪刀是什么？是智慧和禅定。境界来了，我们起了心念，一反照，拿起智慧的剪刀来剪断，这个烦恼断除了。如果不能剪断，是因为这个烦恼不现前，它就是被压伏着，石头压草，早晚有一天还是会出现，那时草有可能疯狂生长起来。所以娑婆世界是非常好的世界，境界多，断除烦恼的机会多，好修行。其它佛国土都是顺境，烦恼不容易现前，你的智慧剪刀也用不上。智慧剪刀用得越多，剪断的烦恼习气越多，成就越快。</p><p>那么我们修行的目标是什么？就是要快点成佛，快点减除无明烦恼，尽快历缘对境，所有的冤家都可以齐上阵，一起来都没关系，起了心念就掐断，起了心念就剪除，这样所有的烦恼都会一点点破除，无明很快就能断尽，成佛就非常快。到其它的佛国土就没有这些境界，成佛很慢，可能很多劫很多劫都还在原地踏步。因为无明不现前，就不好修行，那些其它佛国土的菩萨，围在佛身边快乐优哉，还有神通，可是智慧的境界上不来，好多好多劫都还是这个果位，修行不容易上去。</p><p>所以我们要到类似于娑婆世界，烦恼深重的地方去修行，接触的境界多，逆缘多，烦恼现起的机会多，觉照的机会就多，智慧剪刀用的机会也越多，那么你掐断无明的机会就多，断除的无明就多，这个才叫作真实修行。如果面对的全都是顺境，你说你修行好，好在哪里呢？逆境里修行才是最快的，但是逆境修行也容易沉沦。什么样的人容易在逆境修行中沉沦？没有觉照力的人才容易沉沦。有觉照力的人越是在逆境，修行越快，一个一个荆棘全部砍掉，勇住直前面对逆境逆缘，当这些逆境逆缘没有了以后，自己的心全部对治完了，就再也没有什么逆缘了，佛是没有逆缘的，全部是示现给众生看的。</p><p>原文：<strong>又心离痴者。知心离痴。</strong></p><p>释：通过不断的在某一法上努力修行，才能对某一法离痴，但还不能对所有的法都离愚痴，只有佛对所有的法都离痴断痴了，众生的离痴是指某一方面的，对某种境界是离痴了，原来对某种事理愚痴不懂，不会、不解、不明白，现在懂了，对那个法是离愚痴了。就像小乘四谛法，原来一点也不懂，也不会修行，现在会了、懂了、会修行了，而且证到了，就是离痴，或者叫断痴。但是其它方面还有不懂的，无明非常多，尽管证了小乘的一二三四果，或者大乘的菩萨果，但在世间法上的这个痴还是有，更别说出世间法了。因为那个痴范围太广了，我们仅仅是断了某一方面的痴。原来特别严重的愚痴，现在检查时发现没有了，这叫离痴，暂时这个痴念与无明没有了。</p><p>离痴也包括压伏和断两个层次，什么叫压伏和断？比如说在五盖法上，首先降伏压伏五盖烦恼，就会出现初禅定，之后才能一点点的断除五盖烦恼，这是次第。比如说证果这个问题，证果有解悟和证悟，证悟叫断痴，解悟叫离痴；大乘明心见性也是这样，证悟叫断痴，解悟叫离痴。断了无始无明以后其它方面不懂的法还很多，都还没有离，也没断。就算是什么大菩萨，对于世间法不懂不会的也有很多，还有愚痴，佛法不会的更多，其实世间法不会的也非常多，跟佛法一样的多。</p><p>只有等到把佛法全部证到了，世间法的愚痴也都消尽了。只有佛到世间来，一切世间法全都懂全都会，菩萨都不行，比如有些人证到几地菩萨，来搞一个世间法，有的也搞不好。即使有神通，有些事情也没办法。总有他不懂的，对于医学、饮食、医药、生理、心理等方面，也不是全通，众生的心理也不是完全掌握，完全掌握众生心理的人是佛，菩萨只能掌握一部份，但是有的菩萨一部份也掌握不了，这都属于愚痴。</p><p>只有掌握众生的心，才能够引导众生，对治众生的烦恼，领向解脱之路，菩萨做不到这一点，就没有能力完全了解众生的心念，他带领的众生也就没有智慧，这都属于愚痴，别说菩萨出世间法做不好，世间也也照样做不好，有很多菩萨让他当领导，可能会领导不好一个团体，搞科学研究可能搞不好，其它领域同样也是这样，这都属于世间法的愚痴无明，这世间法的智慧和佛法的智慧是连在一起的，佛法智慧证量越高，世间法的愚痴越少，通达的越多。愚痴范围太广了，根本讲不完，这是贪嗔痴三个方面。</p><p>原文：<strong>又心集中者。知心集中。</strong></p><p>释：现在讲心的集中问题，在修学四念处之前，心是散乱的，东方的事情心着境粘着，西方的事情心也着境粘着，南方、北方、上方、下方、过去、未来，心全部都着境缚着。这时候的心是分散的，分散也叫散乱，众生都是这样，意根的攀缘非常广，这个境界来了心就贴过去了，那个境界来了心也贴过去了，心象八爪鱼似的，其实比八爪鱼分散得还厉害，这叫散乱。现在修定观行心不散乱了，能渐渐的集中到一点上，集中在一个法上，有可能集中在三个法上，有可能集中在两个法上，集中不一定说是集中在一个法上，两个三个也叫集中，原来你分散到十个八个，现在你集中到两个三个，也叫集中。</p><p>定力非常好的时候，同时分别三四个境界，照样心念也是集中清净的，定力也相当好，智慧也很高，这不能一概而论，要分人来看。有的人集中到一个法上，心的分别力都不够，智慧都不够好，一个时间里做一件事都做不好，定力和智慧好的人，一时间能做五个事情都能做得很好，甚至有做六样事情的，都能做得很好，那个叫眼观六路，耳听八方，全部能够了知到，全部能够分别清楚，全部能够安排好，这个是定和慧都很高强的人，生生世世修定修慧的人才能做到。如果不是那样，你让他集中到一点，他也能集中，集中以后要把这件事处理好，他就做不到，这是因为智慧不够，虽然心集中了，但是智慧不够。</p><p>某一件事情出现了，心与之相对时能够集中了，稍微有些禅定不分散了，这个时候心里要作反观要知，有一个知的心，就是一个觉悟的心，觉悟的心就是说明你的心没有散开，心念都能抓得住，这是叫初步的修行。</p><p>原文：<strong>又心散乱者。知心散乱。</strong></p><p>释：一天二六时中，对应着境界，心是处于散乱还是集中，都要有一个觉照的心，都要知。知是意识心的回光反照，意识心的反观力。意识有反观力的时候，一个是有禅定，一个是有智慧，愚痴的人意识心没有反照力，自己做了什么都不知道。自己的心理处于哪种状态不知道，意识心的证自证分不现起。证自证分强的人，是慧力高的人，这个慧力不止包括佛法的慧力，也包括世间法的慧力，世间的聪明人自己干了什么，自己都知道。知道以后他会思惟自己做得对还是不对，错的他能够及时纠正，对的他能够发扬保持，这是世间的聪明人。</p><p>佛法上有智慧的人，更应该有反照力，自己现在起的任何一种心念，都能够反观得到，都能抓得住，能够采取一种正确有效的方法把事情做得圆满，人事物理都能处理得很圆融。而没智慧的人意识的证自证分往往不现起，自己处于愚痴时心里不知道，还以为自己很聪明很高明。心散乱和心集中，都要知道，佛告诉我们应该有这种觉照力，觉照一切时中心里起的念头，是有贪嗔痴的还是没有贪嗔痴的，是有定力还是没有定力的，心是广大的还是狭小的，是上还是下，全部要知道。</p><p>原文：<strong>又心广大者。知心广大。</strong></p><p>释：什么叫心广大？广是指范围，就是无量无边的法，大一般指程度，也有范围的意思。我们的心应该缘于无量无边的法，不应该执着于眼前的小的境界。最广的心能缘于十方世界，能缘于十方诸佛的境界，不缘于眼前凡夫的那个小境界。</p><p>心里考虑的问题应该是如何成佛，如何行菩萨道，如何得大解脱，考虑未来世的果报，生生世世的果报，在其它佛国土的果报、道业、菩萨的阶次，考虑将来要生生世世带领广大众生一起走向成佛解脱之道，考虑度化摄受的众生越来越多，心应该缘这些法，这是广是大，不是只考虑眼前的利益得失。考虑未来世菩萨地地增上的境界，将来在其它佛国土要做一个法主，或者化现无数佛国土做佛度人，考虑这样的事情，心才是广大的。</p><p>心不广大，是指只考虑眼前凡夫这些小事，眼前的利益，金钱上的利益，眷属上的利益，名声上的利益，财色名食睡上的利益，这个心就狭小了。现在的心是广大的还是狭小的，遇到境界有什么样的心念，心量如何，心里都要了知清楚，了知了就知道自己的心太狭小了，只顾着眼前自己这么一点小利益，其它方面都考虑不到，考虑不到未来世的果报。</p><p>心广大以后，才能慢慢的降伏内心，或者说有意的、有措施的降伏内心，或者是无意的、无措施的降伏内心。无意的无措施的降伏就是说第七识意根在背后所做的工作，这一切是意识所不了知的，第七识意根自己在背后默默的思量着，思量通了，衪就能改变了。有措施、有意的就是让意识心采取一定的对治方法，首先要先有一个知，然后才有下一步的运作，心的运作就是指反观、觉照、采取措施、思惟、生起禅定和智慧来解决问题，这都是六七识后续的工作。</p><p>表面上能看到的工作都是意识做的，是意识在想办法解决问题，思惟如何对治。意识心思考的问题传递给意根就不管了，意根就在背后思量，表面看好象是心里不再理这件事，实际上意根在背后不为人知的运作着，衪把这件事的前后利弊清楚以后就会作出抉择，这时候办法就出来了，六识必须照做无误。当意根思量明白，心就改变了，境界再来的时候，就没有烦恼了。</p><p>不贪不烦恼是谁的决定？是意根决定的。为什么决定？因为意根想明白了，衪在背后一只在努力工作着。表面看意识只是知道自己心贪了，然后好象什么也没有做，其实意根一直在背后思量抉择，我们并不知道。总结起来说，遇到境界时心是广大的还是狭小的，内心都要清清楚楚明明白白，下一步就好办了。</p><p>原文：<strong>又心有上者。知心有上。</strong></p><p>释：观察自己的心处于什么阶段、阶位，是什么心量，烦恼如何，定力慧力如何，发心是广大的还是很狭小的？回头来观察自己的心，观察在修行佛法上心的状态，是最大的还是不够大，是最高的还是不够高。比如有人发心：我要为某某众生服务，这个发心是不是有上的？是很低的，所以它还有上，还能更高，还有比它高的，叫心有上。有人发心：我只要了生脱死；有人发心：我只要断个我见，不去三恶道就行了。这个发心是不是有上的？还有上，它不是高的。</p><p>最高的发心是什么？佛的发心是最高的，成就阿耨多罗三藐三菩提。有人的目标是：我只要修人天善法，命终能升天享乐就行了。这就是小心了，心还是有上；还有发心：我只要明心见性就可以了，成为十地菩萨就可以了。这个发心还是有上。直至八地菩萨以上，直至成佛的发心。佛的发心是什么？广度无量无边之多的众生，都得究竟的大解脱，这个发心是无上的。成了佛，佛叫无上正等正觉。佛的心都是无上的心。</p><p>那么凡夫众生的心呢？全部是有上的，即使他发心广大，他有时侯的心还不是广大，都是有上的，有时侯那个心念就不正了，或者心念就小了，心念就为了自己为了个人，或者为了一个小团体，或者为了稍微大一点的团体。这个心都不广大，都有上。观察自己的发心，是有上还是无上？</p><p>时时刻刻有个知，这个知就是警觉心，警觉自己的心。反观自己的心现在处于生命状态，这是意识的证自证分，自己观察自己的心，叫证自证分。其实这里面还有一个心也要发，真正的发心还是要意根同时也发心。那么观心，有也不肯意识观察意根的心，但是非常不容易观察得清楚，毕竟意根很隐秘，观心也就不完全是意识的证自证分，还有意识的自证分。自证分是证明它所发现的事实。发现的事实有意根的心，那叫证得意根是什么样的心，证得意根是贪心是嗔心还是愚痴的心，发现了这叫自证分。如果发现意识自己的心，这叫反观自己，反观自心，这个叫证自证分。所以证自证分一定是证明自己的。</p><p>那第八识的证自证分，一定是第八识发现、证得自己所见的法。意根的证自证分，是意根发现了、证明了自己所见的法。前五识也是，眼识的证自证分是眼识能够证明自己所看到的东西，前五识的证自证分是能够证明自己所见的一切法，也叫反观。识心再观到别的识就不叫反观了，就像这个人观察别人，不叫反观。发现自己叫反观，发现别人叫观。</p><p>有些人修行不修自己，专门修别人，经常观别人，不会回头反观自我。修行首先是反观自我，等有能力自我反观了，再照别人观别人，观到别人的时侯，再回光返照自己，对照检查，从别人身上来发现自己的不足，是警觉心觉悟的心。所以这个知，没有智慧的人，没有禅定的人，绝对没有一个知，他每天心都是散乱的，散乱的心到处攀缘，从来不回观，不把心回到自己身上来，回到自己心念上来，这就没有觉悟了。</p><p>随缘攀缘，是散乱心，对自心就不会有一个知。不知自心就不能修道，不能觉悟，不能改变自心。所以真正修行，心里时时刻刻要带着一个知，有自知之明，然后还有知人之明。菩萨不但要自知，还要知人，处于修行自我阶段的，首先要自知，有能力了再知人；知人以后改变别人，带领别人，这是大乘菩萨的心。</p><p>原文：<strong>又心无上者。知心无上。</strong></p><p>释：佛要我们观心，观心的无上，这个心无上是指什么？是跟自己从前相比较，从前的心都没有现在的心更高上。凡夫的心无上的时侯，就是发心非常广大的时侯，发心广大的时侯行为未必就广大，但是心已经很大了，也不是时时刻刻都是很大的。观心时自己心发生什么改变了，改变到什么程度，自己时时刻刻要了知，有一个回光返照的能力，这是有觉悟性。</p><p>观察自己的心是法喜充满还是心量很广很大，通过修学佛法，现在发了大心了，心非常精进，发愿一定要精进修行早日成就，广利无量无边之多的众生，这就发了成佛的广大心了，这个时侯的心叫无上心，但是凡夫不可能总保持住这个无上。那就要检查自己的心念，时时刻刻能够回光返照，发现心无上时要保持，发现心有上的时侯，赶快提升自己，觉悟自己，敦促自己发大心，发无上心。</p><p>原文：<strong>又心有定者。知心有定。</strong></p><p>释：心定和心的集中有点相似，都代表定在一处，集中在一处，但它们还有一些区别。所谓集中，是心从到处攀缘散乱，渐渐地归拢到一起；心定就不仅仅是集中了，还有一个深度，心扎进去不动，定在一起，定在一处。心在两处是不是定？有的人注意力非常强，精力非常旺盛，定在三处专注力相当强，哪一处都能照顾好，大智慧大禅定的人才能如此。</p><p>没有智慧、没有禅定的人，心定在一处都做不到，做一件事都做不圆满，大智慧的人，指挥千军万马，照样镇定自若、游刃有余。心定在两处三处是不是定？有的人定在四处，照样是定，看他心念的力量如何，在每处精力是不是很旺盛，是否都能照应得过来，是否了别得很清楚，思惟力很敏捷。什么叫定？专注一个叫定，专注两个都要定。这个人能力强，能同时把十个人都看住，一个人能力不强，看一个人都看不住。什么叫定？解决问题的能力精力，这个叫定。心很散的人心力弱，这时只能训练让心集中，无法定下来，只有定力相当好的人，才能训练把心定在几处而不散乱。</p><p>佛在这里为什么提了两个现象：一个是心的集中，一个是心的定，二者有什么区别？集中，没有深度，没有力量，它只是不散乱了；定，有一定的深度，未必集中在一处。能力高的人可以统领一个军队，当军长、当司令，能力低的人，只能当一个班长，这叫心的差别，能力的差别。</p><p>定还有一个概念，广义来说就是决定心，心对某种法，生起了一种决定性，加以认可肯定。比如修学佛法，修到十信位的时候，对佛法生起了决定心，决定要做菩萨自利利他，这就是决定心；之后对菩萨六度生起了决定心，发愿一定要修学菩萨六度，一定要明心见性，这也叫决定心；或者再生起一种决定心，要观行五蕴十八界无我断我见，这也是决定心。决定心有两种：一个是意识心的决定，一个是意根的决定。最初起决定的是意识，最终起决定的是意根，然后就能实施了。意识意识决定了以后，报告给意根审批，意根也决定了，意识的决定才有用，最后还是由意根决定。</p><p>任何一个法的决定，实施的时候多数是由意根决定的，意根决定之后六识才能采取行动。六识的决定不能落实到行动上，因为六识不是五阴身的主人，做不了主，身口意行不自在。身口意行由意根发动，意根就是领导，意识就是一个参谋，领导对于参谋的意见，可以采纳可以不采纳，采纳了就好像是意识做主似的，实际上还是由意根做主。无论是在佛法上，还是在世俗法上，如果意根作主决定了，所有的精力、注意力全部都转过来，六识就要专心地实现决定。结果和过程不仅体现了六识的智慧，也含有意根的智慧，如来藏存入智慧的种子。</p><p>定，六七识都可以有，定的实质还是意根的定，由意根的定决定了六识的定，意根无定，六识就没有定。六七识都可以发心，一个是表层，一个是深层，最终以意根的发心为根本为最后的抉择，意根发心才有行动力。心广大和狭小，也分为意识和意根的广大和狭小。</p><p>原文：<strong>又心解脱者。知心解脱。</strong></p><p>释：观心的时候，当自己从某个法上解脱的时候，应该知道自己心解脱于某个法了。什么叫解脱？被一根绳锁拧个结牢牢的束缚住、捆住，不得自在不得自由，就是不解脱的，反之，打开绳结，自由自在不受束缚，就解脱了。绳索的结喻为心结，为什么有心结？心被系住在某个法上，不能离开脱离，就是结缚，也叫系缚。把心从这种法上移开脱离开，不再惦记惦念，结就打开了，叫作解脱。众生的心结极多，接触一个法就黏在一个法上，就被一个法束缚住了，心里就多一个结，众生着境非常习惯了，无法对境界无心，即使被束缚得很痛苦，也不知道觉悟，不知道想办法解脱出来。</p><p>心结无量无边之多，有大有小，把心从法上转移，脱离开，就解脱。众生的心都在哪个法上系著结缚？在色受想行识五阴上、在六根和六尘十二处上、在六根六尘六识十八界上、在我上、在人上、在众生上、在寿命上、在三界世间一切法上都有结缚。凡夫一个结都没打开，心是不解脱的，见色被色缚，心于色不解脱；闻声被声缚，心于声不解脱；嗅香被香缚，心于香不解脱；尝味被味缚，心于味不解脱；觉触被触缚，心于触不解脱；知法被法缚，心于法不解脱。</p><p>那么解脱是什么境界呢？见色时不著色，不动心念，既不贪也不厌，既不苦也不乐，这是心解脱的相貌。色来和走，无忧无喜，了无挂碍，心是解脱的。声、香、味、触、法来和去，无忧无喜，了无挂碍，心是解脱的；人、事、物、理来来去去，无忧无喜，了无挂碍，心是解脱的。我们尝过解脱的滋味吗？在总体上来说，都没有尝过解脱的滋味，个别法有时心里想明白了才能解脱一下。比如说从前非常执著一件事情，可是通过思惟分析，觉得这件事执著没有用，于是对这件事情就放开不执著了，这叫对于某件事情心解脱了。有时候可能对吃穿住用稍微看开一下，心就解脱一点。</p><p>再比如对于受阴的功能作用不执著了，享受也好，不享受也好，感觉舒服也好不舒服也好，都无所谓，既不喜欢也不厌弃，不被受觉所系缚了，不执著受，在受阴上就解脱了。最难解脱的是识阴，执著意根知性，一定要了知什么法心里才觉得有趣味，不无聊，不知道就很难受。通过修行对识阴的作用减少了执著，有些人事物理不再想方设法的去打听和了知，不知心里也不觉得无聊，也无所谓，心就有一些解脱了。如果在见色闻声上心不著了，既不欢喜也不生厌，来了去了，都无所谓，心就解脱了；通过观行五蕴十八界，对五蕴十八界心不著了，不欣喜不贪著，心就解脱了，这是暂时的生死解脱，不究竟的解脱。最高的解脱、究竟的解脱就是佛地的解脱，具体如何解脱我们无法得知。</p><p>原文：<strong>又心未解脱者。知心未解脱。</strong></p><p>释：在观心当中，如果发现自己对于某个法，心还是很粘着，不解脱，自己就要清清楚楚的了知。这就需要时时回光返照自己：遇见某件事情，反观自己的心是什么状态，是不是在这件事上很贪执摆不开，心里很纠结，又烦恼又苦恼，或者又心喜又快乐，如果是这样，说明心被这件事所系缚住了，不是解脱的，心里要知。</p><p>比如别人欠我多少钱，我时时刻刻念着这件事情，那我的心就是被这件事情所系缚住了，是不解脱的，与某人结了怨结，时时刻刻就念着，说明心被这件事情给系缚住了，就是不解脱的。不得解脱的心就是苦恼不自在，欢乐也是烦恼不自在的，特别快乐更是烦恼，心里平平静静地不起波浪，那是解脱的自在的，心里是最舒服的。苦受本身是苦，乐受是坏苦。不苦不乐受是行苦，有受皆苦，不著一切法就是解脱。</p><p>观心时，遇见任何事随时随地观察自己的心，检查自己的心对于这些法，是不是解脱的，心里要时刻了知。如果生起了非常强烈的嗔恼和强烈的喜爱，就严重地被束缚住了。只要有心念，就是束缚，只要有心就被束缚住了，就是不解脱的。修行的目标就是为了让心得解脱，而且要得最最究竟的解脱，佛地的大解脱，那就要一切法都不著。</p><p>真正的解脱一个是断人我执，对于五蕴十八界不执不著，得解脱，是三四果人；另一个是断除法我执对于一切法不执不著，得解脱，是初地二地三地四地……十地等觉菩萨；把法执断尽，一切法都不执著，就是佛了，对于一切法，全部是解脱自在的，只有佛一人。菩萨在一切法上，有一部分是解脱的，有一部分是不解脱的，心越执著，越固执，越不解脱。凡夫众生都是对五阴十八界对三界世俗法有执著，有些法还执著不了，那个烦恼还不现前，因此不能断法执，法执一定是地上菩萨开始断的。</p><p>以上讲了观心的内容，观自己的心是否有贪嗔痴烦恼，平时对某些人、事、物、理一切法，是贪念还是离贪的念，是贪还是不贪，是嗔还是不嗔，是痴还是不痴，是心念集中还是散乱的，心行是广大的还是狭小的，发的心是有上还是无上的，心是有定的还是无定的，是解脱的还是不解脱的，这些内容就是观心的范围。</p><p>每天能如实观察到自己的心念，心就很细致，禅定就会增强。只要能观察出来心里状态就好办，等于认识了贼看住了贼一样，先认识贼，再看住贼，最后贼没法造作，自己就跑了，贼跑了以后不被偷盗，家财就保住了。每天要这样观心，心里总要有一个知，这个知就是觉悟的心。有多少人是觉悟的？没有多少人，很多人都是随着六尘境界转，来了甲随甲跑走，来了乙随乙去，来了丙随丙跑，东西南北四维上下，哪有缘就到哪，众生的心就是这样的散乱、攀缘、不解脱，被一切境界所执著系缚着。修行就是先认识心，再看着心，最后知道好与不好，心慢慢就转变了，把万法看空看透了，就得解脱了。</p><p>原文：<strong>如是。或于内心观心而住。又于外心观心而住。</strong></p><p>释：佛说，比丘就是要这样于内心观心而住，又于外心观心而住。心为什么还分内外？楞严经上佛说这个七识心，不在色身的内，也不在色身的外，也不在色身的中间，但佛讲观心的时侯，为什么说有个内心，有个外心呢？心念在色身之内方便称为内心；心向外攀缘六尘境界的时侯好象是出去了，其实没出去，这只是方便说法，好象是攀缘外界了，称为外心，外心是六识的向外攀缘性。</p><p>观心的时候，如果发现心在回忆回想，这是独头意识在运作，然后心再往内收摄，回头去观这个心是处于什么心理状态，是有贪嗔痴还是无贪嗔痴的，是解脱还是不解脱的。再观心对六尘境界的时侯，是有贪嗔痴还是无贪嗔痴的，是有定还是无定的，是解脱还是不解脱的，是有上还是无上的。</p><p>观出来自己的心理状态，就知道自己的心是否清净了，知道自己的心念是善还是不善的，思想是对还是不对，就知道该如何处理了。那要如何处理呢？意根知道意识观察的情况，就会在后面思量了，何去何从在于意根，意识可以起一定的思惟作用，剩下的都是意根的事。意根思量之后采取抉择，抉择的结果是什么？就会一点点变好，一点点改正从前的贪嗔痴烦恼，意根改变的前提是意识要善思惟，知道什么是正确，什么是不正确，把思惟的过程和结果传给意根，意根思量后就知道了，以后就会正确的抉择和决定，这样意根就降伏和改变了。</p><p>意识和意根两个心工作时有分工，各有有侧重，和合运作，完成五阴身的身口意行。修行首先是意识要有正念正见，意识要明理，意识要有智慧；再其次意根依着意识，起自己的思量才能生起智慧，才能明理，生起抉择、决定心，就改变自心了，心是这样改变的。无论是改变自己，改变环境，改变一切法，都是这样改变的，由意根来作主抉择，如来藏随顺着就改变了。</p><p>只要意根思量清楚有了抉择心就好办，只要意根比较坚定有力量就好办，我非要这样做，如来藏没办法，就让你这么做。真正有力量的当然是如来藏了，无所不能，不惧怕千难万险，什么也阻挡不了如来藏实施意根的决定。当然后边还需要有因缘、业种这些条件，业种有前世业种，有现存的业种，现存的业种如果要起作用，种子的力量要相当相当地大，业种才能马上成熟现行出来，意根想做的事，就能做成。如果意根没有力量，存的业种就微乎其微没有力量，因缘不容易成熟。意根越有力量，存的种子就饱满，很快就成熟，很快就能实现果报。</p><p>如果想要意根有力量，还需要有智慧，有智慧就需要禅定，智慧越大，越存好业种善业种，修行一辈子就成，做一件事很快就成就。心有力量，定就要强，慧也要强，决定性就非常强，意志坚定。决定性不强的，业种不成熟，比如说念佛时，心里就是要一心往生极乐世界，非常坚定，极乐世界那边莲花就变造出来了，极乐世界景象现前。如何现前的？意根非常想念极乐世界，如来藏就把极乐世界展现出来了；意根不想，就不现前。</p><p>修行首先意识做前行引导，而且是正确的引导，开辟一个正确的道路，意根才能在后面随行，如来藏随着意根出生一切法，就能成就一切法。如果意识领错路了，意根也跟着走错路，如来藏不辨东西南北，随着意根出生染污法，结果觉受生死轮回苦。三能变识，意识起这种作用，意根起那种作用，第八识起另一种作用，各有各的作用。成佛之路如何走，如何成佛，心里应该明了了。意识广博多闻，选择正确道路，引导意根，意根一决定，就走上光明大道，心就改变，修行成就了。</p><p>世俗法的成就也是这样成就的，意识领路，意根随后，如来藏是后备军，粮草给你提供足，要什么给什么，最后就成就了。比如说要建房子，意根六识在上面建房子，如来藏在背后提供材料，八个识配合，房子就造好了。如来藏配合意根的前提条件是，六七识首先要配合，六识做引导，意根思量过后决定说：我如何建房子，建什么样式的，如来藏就随顺着一起建造出来了。三能变识，缺少一个都不行，谁最重要呢？都挺重要，当然越往后的越重要。</p><p>六七识在前面开好路，做决定了，后边如来藏不给原材料，不给种子，六七识也没办法。原材料从哪里来？还是六七识共同存下来的，如来藏不会无中生有，你没有存种子，就拿不出种子来，原材料就供应不出来。六七识先存资粮，五识也参与，资粮存好以后，想做事的时候，因缘具足如来藏再拿出来。所以我们发大心大愿想成就什么法，就要先存种子，否则什么法都不能成就。如果不修福就想成佛，那是没有办法的，如来藏无法凭空产生种子，巧妇难为无米之炊。所以一切法造作，还是自己造作的。种子放在如来藏库房里，不能放在其他生灭的不可靠之处，用的时侯才能随时随地取出来，取不出来，妄想也没有用。修行还是六七识自己修，六七识修完，六七识改变了，万法就改变，满六七识的愿，这就是修行过程。</p><p>原文：<strong>或于内心观心而住。又于外心观心而住。又于内外心观心而住。</strong></p><p>释：观心时要观行向内缘色身的内心，观行缘于过去未来的内心，观行思惟推理判断研究反思的内心，心住在观内心上，又要观缘六尘境界的外心，心住在观外心上，再然后同时观内外心，心住在观内外心上。观行时内外心的状态都要观行到，自己心里正在动念的不接触外边六尘境界的心，是贪还是嗔还是愚痴，都要观察清楚，这个心是有上的还是无上的，是解脱的还是不解脱的，都要观察出来。做到这一点是不容易的，自知之明不容易有，所以观自己心是不容易的。</p><p>每个人内心的结缚那么多，不会观自己的心，就不能发现问题，不能改变心。没发现自己心所处于什么状态，是善是恶都不知道，那要如何改变呢？观心时，首先意识先观，知道好坏，了解自己处于什么状态，然后意根随之就能知道好坏，以后就能变好了。</p><p>原文：<strong>或于心观生法而住。或于心观灭法而住。又于心观生灭法而住。</strong></p><p>释：观心时，要观察心上的生法，心住在观察生法上；或者观察心上的灭法，然后心住在观察心的灭法上；最后再同时观察心的生法和灭法，心住在观察生灭法上。</p><p>什么叫生法？我现在思考一个问题，突然有一个念头出现，想考虑什么问题，考虑问题这个法就生起来了。新出生的法如刚起一个心念，或者眼睛刚见色，心就生出来运作了，这叫生法；心里出现一个向善的心行，或者有一个贪念出来了，这叫生法；心里现在嗔心生起来了，这叫生法；现在心有定了，心定的法出现了；现在对某件事、人、物想开了，解脱的法出现了，这叫生法。原来没有，现在出现了，就是生法。</p><p>灭法就是已有的法消失不见了，比如从前的贪念现在没有了，就是灭法；从前心散乱，现在心定了，散乱心灭了，即使灭法；刚才还生气，现在不生气了，嗔心灭了，就是灭法。观察自己心念的生、住、异、灭，心的状态全部能掌握到，了解自己之后，证得自己是什么心行，禅定、智慧、戒律戒定慧具足时证得无我，心念就能转变，大智慧就能生起来了，慢慢就降伏和断除贪嗔痴烦恼了，这是自然的降伏下来的。比如一个猴子，你看住它，慢慢它觉得不自在，就不乱动不乱跑不乱跳了，只要认识它、看住它就行了。就像一个窃贼，先识得他的面目，认识他，看住他，他就动不了手脚了，被人看住了就不好意思偷东西了。自己的心就像小偷一样，认识他，看住他，后续的工作就好办了。</p><p>心里这个法生，那个法灭，同时都要观察到，这时定也增强了，慧也增强了。一开始观生，后来观灭，再后来生灭同时都观。一开始观内心，后来观外心，后来内外心同时都能观。定慧增强了，才能做得到。同时都能观，这是心住一个法还是住两个法？三四个法都住了时也是定。</p><p>所以定的概念是什么？不仅是指专注一境或者把心灭掉叫定，只要有能力把所有法弄清楚，就有定，当然也有慧；如果没有定慧，观一个法也不是在定中观，这一个法就不能解决，慧就不能出生。生法、灭法、生住异灭这么多的法全部观察到了，这个定力相当好，定浅就做不到。在这其中也有智慧出现，把所有的法都解决了。能看住一切法的出生和灭去，定慧具足，这其中有没有戒？没有那些不如法的心行，就是戒，戒定慧具足。只要每天都能观察自己，戒定慧具足，就能成就初果到四果，就怕不觉悟，心随境界散去而不觉知。这样观行了以后，最后结果是什么？心心念念有一个观心的心。</p><p>原文：<strong>尚又智识所成。及忆念所成。皆会有心之思念现前。彼当无所依而住。且不执著世间任何物而住。诸比丘。比丘如是于心观心而住。</strong></p><p>释：由于一直专注的观察自心，禅定和智慧都提升，这时心心念念都是自心，这是智慧观行的结果，忆念的结果。心里经常思念着自心，观察着自心，思考分析着自心，调伏着自心，但是心里有这些念，心也不清净，不能得解脱，不能解脱于心念，应当灭去心念，看空心念，心里不再有任何法，也不依着任何法而住。并且也不执著世间任何物而住，心里空空荡荡，清清净净。佛说，诸比丘，比丘如是于心观心而住。</p><p>什么叫智识所成？观察自心的那个心，经过不断的观行，智慧逐渐提升，一是不随境界流转，二是自心的心念观察得清清楚楚，三是自心有所降伏。没有智慧，心随境界流转而不觉知，有智慧才能觉知，这叫智识，一直观察心念的心叫智识。什么叫忆念？观心之后，心里一直回想思惟自心的状态，就是忆念，观心的整个过程，在心里回旋着反复着，知道自心所处的状态，是心念所成就的，这也叫忆念。观心最后的结果，心里总有个我，总是在忆念回想观察自己的心是贪嗔痴还是无贪嗔痴的，总是在思惟自己心所处的状态，一直思念着自心，定慧都具足。</p><p>当观行形成了牢固的心念以后，就住在观心上了，心有所住就是系缚，最后把这个心念也放空，无所住，心才能得解脱。把所观的心也抛开，无所住，心就空了。观心之后，心心念念都是心，内心时时刻刻思念着自心，最后把思念的念也要空掉，心无所住，不住在思念上，心就空了。能观的心，被观的心，都是无常的空的幻化的，无所执著的，能观所观全部泯灭，心就空了寂静下来了，能观所观都是无常的，都不是我。这个所观就不是六尘境界了，而是心，能观是六识观，所观的六识和七识全部是空的，都要无所住不执著。</p><p>四念住修完就断了我见，把心空了就会断我见了，并且能证得三四果，了知能观所观的心都不是真实的，是生灭异住的，都是生灭变化、起灭无常的，都不是我。空掉以后，心无所依。如果有个所依，就把它当真实了，不能断我见。无所依而住以后，且不执著世间任何物，也不依着心，也不依着物，心里放空空的，把物也放空，世间任何一个物，心里都不著，就证空果。只要内心里有法存在，就给它空掉，不认它为真实，就断我见，断我执。</p><p>从大乘法的角度来说，如果把一切法都空掉以后，就剩下一个如来藏不空，还存在着，这是证得大乘法如来藏的境界。就像楞严经里讲的耳根圆通：能观所观都空掉，把空也空掉，所有一切的空都空掉，耳根圆通修到最后，就剩一个如来藏。圆觉经也是这样说，只要心里有个心念都应该空掉，有个空的心念也要空，能空所空全部空掉，除了如来藏，什么都不存在，然后也不执着如来藏，修学就到家，无量千万亿的化身就出来了，修到最后就是甚深的禅定和智慧的三昧境界。</p><p>修行就是要这样一路空下去，把凡是有生灭变化的法都空掉，然后不管认为什么法是空的，再把这个认为的知见也要空掉，把法空了，再把这个空也要空掉，凡是心中有物全部空掉，把心也空掉，心中的物也要空掉，能空所空全部空掉，就剩一个实在是空不了的如来藏，就究竟到家，这就不是一般的明心见性，是究竟到家的明心见性，观音菩萨所修的耳根圆通章就是这样。四念处修到最后，也是空掉五蕴十八界，但是不一定能证得如来藏的不空。</p></div>"
},{
    "title": "第五章　观法而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　观法而住</strong></p><p>这一章总共讲了五种法的观行，都是有关小乘见道方面所应该修行的内容，如果要深入修行，离见道就会越来越近。执著开始修行时，首先就要想办法修除盖障，遮障去除了，道业没有阻碍了，修行才能顺利。观行五盖，去除遮障以后，世尊再教观行五取蕴，之后是观行十二处、十八界，在观行五蕴十八界的同时要了解七觉分，修证过程中一定会发起七觉分，才是如理如法的修行，观行七觉分之后，就要正修行，修行苦集灭道四圣谛法，对此四圣谛法都要一一起心思惟观行，最后才能证道。所以这些法都很重要，都能趣向于涅槃。</p></div>"
},{
    "title": "第五章（一）观五盖法而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>一、观五盖法而住</strong></p><p>原文：<strong>然。诸比丘。比丘如何于法观法而住耶。于此。诸比丘。比丘于法即五盖。观法而住。又诸比丘。比丘如何于法即五盖观法而住耶。</strong></p><p>释：好，诸比丘们，比丘如何观行法心住于法呢？是这样，诸比丘们，比丘要对五盖法观行而心住于观行五盖法上。那么，诸比丘们，比丘如何才能对五盖法观行而心住于观行五盖上呢？</p><p>原文：<strong>于此。诸比丘。比丘或于内贪欲存在者。知我于内贪欲存在。于内贪欲不存在者。知我于内贪欲不存在。彼知未生之贪欲生起。知已生之贪欲灭尽。又知已灭尽之贪欲。于未来不再生起。</strong></p><p>释：应该这样观行，诸比丘，比丘如果自己内心里有贪欲现象存在，应当知道自己内心有贪欲；如果自己内心没有贪欲的现象存在，也要知道自己内心没有贪欲；如果自己内心还没有出现的贪欲现在生起来了，心里要知道；如果自己原来生起的贪欲现在灭尽了，心里要知道；如果自己灭尽了的贪欲，未来不会再生起了，自己也要知道。</p><p>这些贪欲都是自己比较根深蒂固的，无始劫以来由于环境的熏染一直在不断增长着的，如果没有觉悟的人，不容易发现这些现象都属于贪欲，都是不如法的，是生死业障的根苗。要观行自己的贪欲，首先要识得贪欲的相貌，知道什么是贪欲；其次要有禅定，有一定的反观力，内心里总是有警觉心，能够观察自己的起心动念。贪欲都有什么相貌呢？比如说心里喜欢、贪爱、贪恋、有欲望、有追求、有向往、想要得到、念念不忘、紧抓不放等等。</p><p>贪欲的对相就是三界里的世俗法，最主要就是欲界里的法，如财产、男女、家庭、名誉、地位、权势，眼所见的一切色，耳所听的一切声，鼻所嗅的一切香，舌所尝的一切味，身所觉的一切触。观行时心要细，在一切所缘境界当中，检查自己的心念，不管是什么心念都要如实知，这是最重要的，有可能知了也不愿意改或者是不能改，但也要知，只要知了早晚都会生起惭愧心而逐渐减少贪欲。</p><p>对于贪欲灭尽这个现象，要如实观察和了知，根本贪欲灭尽是在断我见生起初禅定以后，在这之前，都是某些小方面的贪欲灭尽，如吸烟喝酒赌博喜欢吃喝穿戴等等细节。最根本的贪欲是男女欲，这个最不容易断除灭尽，必须是在断我见之后的初禅定里，才能断尽，那时候面对男女之时，不管如何接触也不会起贪欲心。</p><p>原文：<strong>或于内嗔恚存在者。知我于内嗔恚存在。于内嗔恚不存在者。知我于内嗔恚不存在。知未生之嗔恚生起。又知已生之嗔恚灭尽。又知已灭尽之嗔恚。于未来不再生起。</strong></p><p>释：比丘在观行内心的嗔恚盖障时，如果自己内心里有嗔恚心行，就要如实的了知到内心有嗔恚；如果在面对人事时内心里没有嗔恚，就要如实了知到自己内心没有嗔恚；如果在面对人事时，本来没有嗔恚现在嗔恚在内心里逐渐生起来了，这也要如实了知；如果在面对人事时原来容易出现的嗔恚现在灭尽不起了，自己也要如实的了知到；如果原来的嗔恚心灭尽之后，未来再也不会生起来了，自己也要如实的了知到。</p><p>顺境生贪爱，逆境生嗔恚，在违逆己心的情况下容易生起嗔恚心。要想降伏和断除嗔恚烦恼，就要在逆缘的情况下多观察自己，多思惟境界的虚妄不实性，多呵责己心，嗔恚烦恼就会逐渐的降伏下来，最后灭去。但是最根本的嗔恚心行，必须在断我见的初禅定里才能断尽，是在断除贪欲之后。嗔恚比贪欲要难断，因为世人都不愿意违逆自己，把自己看得很重要。</p><p>原文：<strong>或于内睡眠(愚钝)存在。知我于内睡眠存在。或于内睡眠不存在。知我于内睡眠不存在。而知未生之睡眠生起。又知已生之睡眠灭尽。又知已灭尽之睡眠。于未来不再生起。 </strong></p><p>释：比丘在观行睡眠盖时，如果自己有睡眠盖障，内心里愚钝，就要如实观察了知到自己睡眠厚重内心愚钝；如果自己没有睡眠盖障，内心不愚钝，也要如实观察了知到自己睡眠不厚重，内心不愚钝；如果原来没有厚重的睡眠，现在睡眠变得厚重了，心里一定要了知到；如果自己原来睡眠盖重，现在睡眠盖灭尽了，心里也要了知到；如果自己已经灭尽的睡眠盖，未来不会再出现了，心里也要了知到。</p><p>睡眠盖障几乎所有人都有，正常人六至八个小时的睡眠，其实就是一种遮障，在这期间心里是愚钝暗钝，没有智慧的光明。如果缩短睡眠时间，愚钝暗钝时间减少，内心清明，智慧光明就会延长，道业就会不断的增进。通过不断的精进修行，内心越来越清明，睡眠就会越来越少了。了解自己的睡眠情况，就能了解自己的身心状态，就能掌握和安排自己的修行。</p><p>原文：<strong>或于内悼悔存在。知于我内悼悔存在。或于内悼悔不存在。知于我内悼悔不存在。而知未生之悼悔生起。又知已生之悼悔灭尽。又知已灭尽之悼悔。于未来不再生起。</strong></p><p>释：比丘观行掉悔盖的时候，如果内心里有掉悔要如实观察如实知；如果内心里没有掉悔盖障，也要如实观察到如实知；如果原来没有掉悔现在却出现了掉悔，心里要如实观察如实知；当出现的掉悔盖障灭尽的时候，心里要如实观察如实知；如果已经灭尽的掉悔，未来不会再生起了，心里也要如实观察到如实知。</p><p>掉，就是掉举散乱，心不寂静不清净；悔，心里不断的追悔追忆从前已经发生过的事情，这样内心是不清净的。所以掉悔盖障碍禅定的生起，阻碍智慧的开发，必须消除掉悔盖，才能加深禅定。</p><p>原文：<strong>或于内疑惑存在者。知于我内疑惑存在。于内疑惑不存在者。知于我内疑惑不存在。而知未生之疑惑生起。知已生之疑惑灭尽。又知已灭尽之疑惑。于未来不再生起。</strong></p><p>释：比丘观行疑惑盖障时，如果内心有疑惑存在时，要如实观察如实知自己有疑惑；如果内心里没有疑惑时，也要如实观察到如实知；如果原来没有疑惑而现在却出生了，要如实观察到如实知；如果心里的疑惑消除了，也要如实观察到如实知；如果已经灭尽的疑惑，在未来不会再出现了，心里也要如实观察到如实知。</p><p>疑惑包括大疑惑和小疑惑，包括暂时的疑惑和永久的疑惑。通过佛法的修学，能不断的解决一个个小疑惑和暂时的疑惑，最后智慧增长到一定时候，就能解决大疑惑和永久疑惑。</p><p>原文：<strong>如是。或于内法观法而住。又于外法观法而住。又于内外法。观法而住。或于法观生法而住。又于法观灭法而住。又于法观生灭法而住。尚又智识所成及忆念所成。皆会有法之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是于五盖法观法而住。</strong></p><p>释：观行就是要像这样，或者观察内五盖法，心住在观察内五盖法上；或者是观察外五盖法，心住在观察外五盖法上；或者同时观察内外五盖法，心同时住在内外五盖法上。或者在五盖法，观察五盖法的出生而住心；或者观察五盖法的灭尽而住心；或者在五盖法上，同时观察出生和灭尽的现象而住心。这样不断的观行，禅定和智慧越来越增进，心里就形成了一种念想，不断的有关于五盖的心念出现，心里不断的忆想五盖的事情，就有五盖法的思念现前。这时候你们心里应当不依着任何法而住，空去五盖法，不住于任何法上，并且也不执著任何物而住。诸比丘，比丘应该这样于五盖法观法而住。</p></div>"
},{
    "title": "第五章（二）观五取蕴法而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p>二、观五取蕴法而住</p><p>原文：<strong>复次。诸比丘。比丘即于五取蕴法观法而住。然。诸比丘。比丘如何即于五取蕴法观法而住耶。于此。诸比丘。比丘知如是色。如是色之生起。如是色之灭尽。如是受。如是受之生起。如是受之灭尽。如是想。如是想之生起。如是想之灭尽。如是行。如是行之生起。如是行之灭尽。如是识。如是识之生起。如是识之灭尽。</strong></p><p>释：再次，诸比丘，比丘应该对于五取蕴法观行，心住在观行五取蕴上。可是，诸比丘，比丘如何对于五取蕴法观法而住呢？是这样，诸比丘，比丘要知道什么是色蕴，色蕴是如何生起的，又是如何灭尽的；要知道什么是受蕴，受蕴是如何出生的，又是如何灭尽的；要知道什么是想蕴，想蕴是如何出生的，又是如何灭尽的；要知道什么是行蕴，行蕴是如何出生的，又是如何灭尽的；要知道什么是识蕴，识蕴是如何出生的，又是如何灭尽的。</p><p>这是要观察五蕴的生灭变异无常性，心里时时刻刻要了知色蕴的状态，生灭变化的情况；了知任何时候内心的感受，以及这些感受的生灭变异无常性；了知任何时候的想蕴，以及想蕴的生灭变异无常性；了知任何时候的行蕴，以及行蕴的生灭变异无常性；了知任何时候的识蕴，以及识蕴的生灭变异无常性。</p><p>原文：<strong>如是。或于内法观法而住。又于外法观法而住。又于内外法观法而住。或于法观生法而住。又于法观灭法而住。或于法观生灭法而住。尚又智识所成及忆念所成。皆会有法之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是即于五取蕴法观法而住。</strong></p><p>释：就像这样，或者是于内五取蕴法观法而住；或者是于外五取蕴法观法而住；或者是于内外五取蕴法观法而住。或者于五取蕴法观新出生的法而住，或者是于五取蕴法观灭法而住；或者是于五取蕴法同时观生灭现象而住。</p><p>这样经过连续不断的观察，识心就具足了智慧，就会不断的思想五取蕴法，由于经常观行五取蕴法，心里就会经常忆念五取蕴法，心里就会形成连续不断的五取蕴的心念。这时候应该灭去空掉这些心念，不应该依五取蕴而住，因为五取蕴是生灭法，不可依止。心中灭去五取蕴法以后，也不要执著世间任何物，不依任何物而住，因为一切物都是无常生灭的，是不可靠的。诸比丘，比丘就是应该这样于五取蕴法观法而住。</p></div>"
},{
    "title": "第五章（三）观六内外法处而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>三、观六内外法处而住</strong></p><p>原文：<strong>复次。诸比丘。比丘即于六内外处法。观法而住。然。诸比丘。比丘如何于六内外处法观法而住耶。于此。诸比丘。比丘知眼知色。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。又知已灭尽之结。于未来不再生起。</strong></p><p>释：再次，诸比丘，比丘应该观察六内法和六外法，心要住在观六内法和六外法上。可是，诸比丘，比丘如何对六内法和六外法观法而住呢？是这样，诸比丘，比丘应该了知眼根，了知色尘，了知缘于眼根和色尘就会产生生死结缚。然后要了知心里没有出现的结缚现在生起来了，并且还要了知已经生起的结缚现在灭尽了，还要了知已经灭尽的结缚在未来不会再出生了。</p><p>六内法是指六个内根，在胜义根内的五根以及意根，意根既属于外根，也属于内根；六外法是指六个内尘，在六根外落到胜义根内的色声香味触法，六根与六尘相接触，如果意根了别想要有身口意行，如来藏就会出生六识，六识的心行首先要出来，六识如果对六尘有贪爱和厌恶的心行，就是生死结缚。</p><p>结缚总共有九个：爱结、恚结、慢结、无明结、见结、取结、疑结、妒结、悭结。所有的烦恼结缚都是在根尘相触处发生的，如果意根不决定了别六尘，六识就不会生出来，这些烦恼结也就不会产生了；即使六识了别六尘之后，把了别的情况传递给意根，如果意根没有烦恼，也就不会促使六识生起烦恼；如果六识没有烦恼，就会熏染调控意根，也能不生起烦恼，这样就没有生死结缚了。所以观行时，多在六根触六尘时观行，心住在六内法和六外法处，就能如实了知自己的心行，就能降伏和断除自己的烦恼结缚。这就是修行。</p><p>观行眼根和色尘这对法时，定慧增长，心越来越清净，原来所有的结缚慢慢就淡化和消失了，后来又消失得比较彻底，以至于未来不会再出现了，这就是通过观行断除了烦恼结缚，心得自在了。这些情况心里都要了知到，心里清清楚楚。比如原来喜欢游山玩水，通过观行，心里对游山玩水不再感兴趣了，心已经厌倦，不想再玩了，并且能保证以后再也不会对游山玩水感兴趣了。</p><p>原文：<strong>又知耳知声。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。又知已灭尽之结。于未来不再生起。乃至知鼻知香。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。又知已灭尽之结。于未来不再生起。乃至知舌知味。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。又知已灭尽之结。于未来不再生起。</strong></p><p>释：还应该了知耳根，了知声尘，了知缘于耳根和声尘就会出生生死结缚。然后还要了知到心里没有出生的结缚现在生起来了，了知到已经生起的结缚现在灭尽了，并且还要了知到已经灭尽的结缚，在未来不会再生起了。</p><p>接着要继续了知鼻根，了知香尘，了知缘于鼻根和香尘而生起了生死结缚。又要了知原来没有生起的结缚，现在生起来了，又要了知已经生起的结缚现在灭尽了，还要了知已经灭尽的结缚，在未来不会再生起了。乃至于还要了知舌根，了知味尘，了知缘于舌根和味尘而生起了生死结缚。继而还要了知没有出生的结缚现在生起来了，已经生起的结缚现在灭尽了，再了知已经灭尽的结缚，在未来不会再生起了。</p><p>如何观行心里生起结缚了？比如当耳根与音乐相接触时，原来心里没有贪爱，可是听着听着就逐渐喜欢了，贪爱结缚就出生了。之后由于某种原因，就不再喜欢这种音乐了，对这种音乐的贪爱结就灭尽了，并且知道以后再听见这种音乐就不会再喜欢了。遇见任何色声香味触法的境界，要学会观察自己的内心结缚是什么，只要知道这是生死结缚，是不如法的就好，把这种想法知见传递给意根，慢慢熏染意根，意根就会在意识不知不觉中思量，一旦知道贪爱等等结缚确实不好，就会压伏自己的烦恼，定力增强时，就能灭尽烦恼结缚。</p><p>原文：<strong>乃至知身知触。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。又知已灭尽之结。于未来不再生起。乃至知意知法。知缘其二者生结。而知未生之结生起。又知已生之结灭尽。知已灭尽之结。于未来不再生起。</strong></p><p>释：乃至于再了知身根，了知触尘，了知缘于身根和触尘所生起来的生死结缚。了知原来没有生起的结缚现在生起来了，了知已经生起的结缚现在灭尽了，了知已经灭尽的结缚，在未来不会再生起了。乃至于在意根与法尘接触时，了知意根，了知法尘，了知缘于意根和法尘而生起了生死结缚。了知原来没有生起的结缚现在生起来了，了知已经生起的结缚现在灭尽了，了知已经灭尽的结缚，未来不会再出生了。</p><p>原文：<strong>如是。或于内法观法而住。于外法观法而住。于内外法观法而住。或于法。观生法而住。或于法观灭法而住。或于法观生灭法而住。尚又智识所成。及忆念所成。皆会有法之思念现前。彼当无所依而住。且不执着世间任何物。比丘如是。于法观法而住。</strong></p><p>释：就是要这样观行，对于内法六根要观法而住，或者对于外法六尘要观法而住；或者同时观察内外法六根和六尘，心住于观法上；或者对于这些法，要观察出生情况，再观察灭去的情况，或者同时观察出生和灭去的情况。</p><p>观行完内外法之后，生法和灭法也观行完成了，识心的心心念念当中都有个法的存在，忆念当中也都是这些法。然后再把这些内外法的念想空掉，心念不依法而住，且也不执着世间任何物而住，心中一法也不住。既不住内法，也不住外法，因为知道了内外法都是生灭无常变异的，不可依止，心中空却所有法，不依任何法而住。并且也不执著世间任何一物而住，这样内心就空的非常的净尽了。比丘就应该这样于法观法而住。</p></div>"
},{
    "title": "第五章 （四）观七觉分而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p>  <strong>四、观七觉分而住</strong></p><p>（一）七觉分简略介绍</p><p>七觉分也叫作七觉支，具体分为：念觉支、择法觉支、精进觉支、喜觉支、轻安觉支、定觉支、舍觉支。</p><p>第一，念觉支。修学了某种法，心心念念缘于这种法，而没有夹杂，这是念觉支的成就。</p><p>刚修学佛法时缘于某种法而修，缘着缘着心念一转就断了散掉了，心里不再念着，这种法即不现前，这时念觉支还未成就。比如修习净土念佛法门，一开始缘于佛号，缘着缘着就散掉了，心里没有了佛号，也没有了往生的念头，这时念觉支未成就。某种法修到一定程度，功夫绵密，念觉支生起来时，于法念念不忘，这时念觉支已修习成就。</p><p>比如修行四圣谛之理时，如果心心念念都是四圣谛理，心念都在观行和思考苦集灭道之理，念觉支就修成了。一开始心里不念不着四圣谛法，对四圣谛法没有思惟，没有观行，没有念想，后来心心念念缘于苦集灭道，那么遇缘对境就立即想起：这法是苦的，苦是如何出现的，是如何集结起来的，要如何修道如何灭掉苦，心念时刻不离于苦集灭道，这时四圣谛法的念觉支已成就。</p><p>念觉支是七觉支当中的第一个觉支，念觉支成就，是我们修学佛法的首要条件。如果不能念念于所修的正理，就不能于正理精进；不能于正理生起喜乐；不能生起轻安；于正理不能生起抉择和决定；心里不能舍除不如理作意和不如理之法，仍然着于世俗的贪嗔痴烦恼。</p><p>比如修菩萨六度，心心念念缘于菩萨六度的修行上，会时刻检查自己的内心，自己的布施福德积累得怎么样，自己的持戒情况怎么样，遇到犯戒时立刻想起：我应该严格持戒，不应该有所违犯。修禅定时心散乱，自己应该警觉到：我现在没有禅定，应该把心收摄回来。般若智慧不足，遇到佛经看不懂时，就应该知道自己的般若智慧还不足，应该努力弥补。某种法理还没有明白，又落到世俗境界相当中，自己应该知道：我般若慧修的程度还很差，应该再精进。如此这般，心处于念觉支状态，则住于菩萨六度。念觉支成就了，才能精进修学菩萨六度。当念觉支成就时，心念与法相应，时时刻刻念着法。心念与法不相应，念觉支则没有成就，只成就一半或者某一部分。念觉支成就以后，时时刻刻能念着佛法，主动观行思惟佛法，最后才能证得佛法。</p><p>念觉支是修学佛法的初级阶段。念觉支成就以后，后面的择法觉支、精进觉支、喜觉支、倚觉支、定觉支、舍觉支才能成就。自己有没有念觉支，心里应该清楚。念觉支没有生起之前，要清楚知道没有生起，生起了以后，要清楚知道已经生起了。如果念觉支没有修足，应赶快加强修行。在修行中，我们应该时时刻刻检查自己的心念处于哪种状态，哪种程度。对自己要加以关注有所了解，才能够改善自己，完善自己，如果不了解自己，就不能对治自己，不能完善自己所修。</p><p>修行每种法都有念觉支，念觉支也有层次上的差别，比如修学唯识，念觉支没有成就是很正常的，因为这属于菩萨的道种智，智慧力不足的时候，不可能成就念觉支。但是在我们目前应该修学的法上，念觉支应该要修学成就，比如说没有断我见的人，心里应该时时刻刻念着断我见的内容五蕴空无我，念念在观行五蕴的生灭无常，心念都与断我见之理相应，这时侯念觉支就生起来了，至于成就没成就，圆满没圆满，那还需要进一步来检查，直到念觉支成就和圆满为止。</p><p>在参禅阶段，要检查菩萨六度方面的念觉支是否成就，检查般若智慧修习程度如何，内心是否能缘于般若这一法，遇缘是否能联想到般若空性，是否能意识到都是第八识所现起来的法。或者在接触一切法时，都要寻觅第八识究竟在什么处所，时刻念着：我如何明心，如何证悟，如何参禅，如何修定，这就是自己目前修学应该具有的心念，并且应该让念觉支不断增进。如果心念跑到世俗法上去了，说明心念还不够坚固，念觉支还没有成就，应该再强化自己的心念力。</p><p>第二，择法觉支。要知道自己的内择法觉支是否生起来了，就要细心检查自己对于法的辨别力，经过一段时间的检查之后，确认自己有一定的辨别力，就知道自己的内择法觉支已经生起来了。对自己修行的状态、内容、程度，都要进行反观，那么修行就有步骤有层次有内容了。这些步骤心里清清楚楚，就会知道自己目前应该如何来修学，不会心乱如麻，茫无方向，见什么法学什么法，而是有次第有步骤地修学，按部就班地修行，这样就知道自己的内择法觉支已经修习成就了，</p><p>择法觉支，就是对目前应该修的法，具有一定的抉择之力，心里应该了解此法是正还是邪，是大还是小，在佛法当中属于什么层次。遇到与自己智慧层次相应的法，有正确的抉择力，能够做出正确的抉择，就说明择法觉支生起来，具有择法眼了。</p><p>有了择法觉支，不管遇到什么法，什么人讲法，都有一定的辨别力和抉择力。此师所讲的法，是大乘还是小乘，是正道还是邪道，是否符合佛意，他本身智慧层次到了哪里，能不能帮助自己和众生断我见，能不能引导自己和众生明心见性，应该有一定的择法眼来辨别和抉择。要不要修这种法，什么时侯修，自己心里都要有一个量度，才能做出正确的抉择。</p><p>对于很高深的法，暂时没有抉择力，是属于正常的。有些人对于稍微比自己层次高的一些法，也有一定的抉择力，但这个抉择力肯定不是很大，不是很充分，抉择的力量虽不够强大，有个粗略的辨别就可以了。</p><p>第三，精进觉支。如果没有择法觉支，还不具备择法眼，能不能精进呢？无法真正的精进。比如有两条道路，其中一条是正确的，另一条是不正确的，如果选错了，就是南辕北辙，那么精进的方向错了，是不是越精进离正道就越远？所以，在精进觉支生起来之前，应该要具备择法觉支。</p><p>选择了正确的修行之路、修行之法，或者选择了一位明师之后，才能够对某法精进地修行，或者跟着某师精进地修行，这是正精进。如果择法觉支没有完善，选择了一条不正确的佛法修行之路，越精进就越浪费精力，越耽误时间，这是邪精进，而正精进，精进一分就能获得一分的智慧成就。</p><p>精进包括很多方面，比如修行菩萨道，布施、持戒、忍辱、禅定，都要精进。任何一个法，只要能走向明心见性，都要精进地修行。这是精进觉支。内精进是意根的精进，这是真精进究竟的精进；外精进是意识的精进，还不是真正的精进，还需要继续熏习意根。只有意根精进了，才能心心念念都是法，朝斯暮斯的勤奋修行。</p><p>第四，喜觉支。精进一段时间之后的结果是什么？对于某种法修学方向正确把捉了，生起一种喜乐之心，越学心里越高兴越法喜充满，越学越有成就感，内心获得了一种轻微的解脱功德。所谓的喜乐，一个是内心喜悦，再一个是对于法的喜爱，这就是喜觉支。</p><p>如果修了很长时间，心里的喜觉支始终没有生起来，说明修学还不得力，或者是精进度还不够，或者是选择的法不对，或者是念觉支没成就。学法学对了，到一定时候一定有喜觉支生起，内心充满喜乐，因为身心已经获得利益，没有获得利益，不会生起喜乐心来。比如自己得到一件东西，觉得对自己挺有用，心里就会很高兴，如果觉得这件东西没有用或者用处不大，心里就不会高兴。</p><p>第五，倚觉支。内心生起喜悦以后，会出现什么现象？烦恼就会压伏下来，五盖减轻，然后内心生起轻安的觉受，这就是倚觉支。这个倚是倚靠安歇的意思，身心都安歇下来，代表内心轻安的意思。到这时越修心里越轻松越自在，越感觉解脱，身心越放松，能保持下去，说明倚觉支成就，保持不下去说明倚觉支退失。</p><p>倚觉支又叫轻安觉支。轻安指的是内心非常轻松安然自在，身体轻盈不沉重。身和心是互相依赖、互相依存的，身体出现变化，心就出现变化，心出现变化，身体就出现变化，身心相应。心里喜乐或者轻松自在，身体就轻盈飘然，身体如果轻盈飘然，心则是轻松愉悦。身体搞不好，心境也不会愉悦轻松自在。当禅定出现时，身体觉受很轻盈，心一定是非常快乐的；当学法学得非常快乐的时侯，身体一定是轻松安然的。</p><p>禅定指身体和心都得定，缺少一个都不叫禅定，离不开身体而定，也离不开心而定，二者相辅相承。禅定能让人获得一种轻安、轻盈、自在的感觉，所谓轻盈，指的是色身轻盈，不沉重，同时心也愉悦舒适，心量增大，轻安的觉受与上界相应，有脱离人间本地的趋势，这是定的征兆。很多人都没有修到这种状态，身体还是很沉重，内心也没有生起喜乐、轻松、自在和解脱的感觉，说明修行还不得力不如法。</p><p>当修到出现轻安的觉受时，行走坐卧的状态就不同以往了，心里的状态从面部表情和身体的姿态上就能看得出来。所以，一个人有没有道，修到什么程度，是不是明心了，明眼人一看就知道了。过去的禅师都有那慧眼，弟子参禅参到了某一天，满面春风的走过来，浑身透露出那股好像是得道的气势，师父一看，不用弟子说话就知道了。证道是有标志的，不是说，断我见证果和明心了，身口意还与从前完全相同，没有一丝差别，更不能比从前还差烦恼还重。刚明心见性，刚断我见时的身心状态，别人一看，就能看出来跟从前不一样。修到倚觉支的时候也是这样，身心都有变化。</p><p>第六，定觉支。倚觉支成就了以后，禅定就会出现了，所谓禅定，一是对法的决定，再一个是身心寂静，身体安然不乱动，心能专一深细思惟不散乱，处于不动的状态中。所谓定就是不散乱，能缘于法深入进去，不受外界干扰，心住于法上。这两种定都具足，才是完整的禅定。</p><p>修到未到地定具足时，心比较沉稳和集中，思惟法义时很快就能把心沉下来深入法义中，不会烦躁不安，不会浮在文字表面而深入不下去。到这种状态禅定就成就了，不管腿能不能盘，内心都与禅定相应，行住坐卧都能有定，这样就能深入到佛法当中。这就是定觉支。 </p><p>在倚觉分的时侯就有初步的定，前面的倚觉分没修出来，不可能出现后面的禅定。即使强行坐很长时间，因为没有倚觉分，得定也很困难，有了倚觉分，入定才容易，行走坐卧有禅定，身体状态就显示定已经出现了。</p><p>所以修出喜觉支和倚觉支之后，才能有定觉支，定是由喜和倚两个觉分所引发出来的，前面还有精进觉分、择法觉分，这些一连串的觉支引发后面各个觉支，一个比一个深入，没有前面的觉支就没有后面的觉支。如果说一个人证果了，这些现象都没有，那证的是什么果？如果说一个人明心了，这些身心上的相貌觉受状态都没有，那明的是什么心？所以证果与否明心与否瞒不了过来人，就看那身心状态，一眼就看得出来，即使他一句话不说，那个脸面脸色神情就把得法与否的心境显示了出来。是否有道，那一开口说话更能判断出来，瞒不过明眼人。</p><p>第七，舍觉支。禅定生起来之后，降伏了各种心念，心才能住于平等的舍境，不苦不乐，不喜不悲，平平淡淡，既不贪执也不嗔恚，内心清清净净。舍觉支的舍是舍去的意思，原来有什么东西需要舍去的？心里有喜有乐，有贪有嗔，有粗重的觉观思惟，有散乱有波动，都需要舍去，达到舍受。二禅以前还有觉观有念，心里还有喜乐受没有舍去，到了四禅，舍念清净，一个念头都没有，更是舍，叫作舍念清净。</p><p>心里有苦受和乐受，是散乱，心里念头不断，思想忆念不断，是散乱，当禅定生起时，苦受舍去了，乐受舍去了，粗重的觉观舍去了，散乱的思想舍去了，内心对过去的追亿舍去了，心念澄清了，心就清净下来了，这就是舍觉支。七觉分修到最后，把内心的一切繁乱和粗重都要舍除，舍觉支就成就。</p><p>在这样的状态下，所思惟观行的佛法才能入心，意识思惟才能深细，意根才能专心考量意识思惟的过程和结果，才能受熏，才能接受，才能产生智慧。内心不断受到搅扰，不能清净，就不能深入到佛法中去，就不能受熏，也就没有智慧的生起。舍觉支生起时，心里是平静的，就像没有波浪的湖水一样波澜不起，佛法才能渗透到内心里滋润心田，才能生长智慧苗。如果内心总是充满喜乐，定力不足，心思比较浮躁，观行不充分，佛法深入不到内心里，不能证果开智慧。</p><p>清净的心念应该是舍心，有些学佛人念佛境界比较好时，定中看见佛菩萨出现，心里非常欢喜，如果不能化解这种心境，总是喜欢着佛菩萨的相，心就不清净，容易入魔境。有些人在修行中心里总是生悲，为自己生悲，为众生生悲，感觉世界都是苦，苦得受不了，这是住于悲魔了，心念也不清净，修到最后悲和喜这两种心念全部舍除，住于一种平静平淡平稳平等的心态，才能深入到佛法当中。住于那种最正的心念状态中，才能够观行成就，从而能断我见明心证悟。</p><p>七觉支是一环扣一环的，没有前面的环节，就没有后面的环节，前面这些路都走过了，最后才能断我见证果，这是证果的前行条件。所以这些经历如果都没有，就不能断除我见，哪个觉支都没生起来，也不可能断除我见，从来没有精进过，从来没有生起过喜乐之心，身心从来没有轻安过，对法的认知还不够深，观行就不能成就，尤其是从来没有观行过，更不可能断除我见。只有三果四果人再来的，今世遇到佛法稍微加以思惟，听闻关键性的一句话，稍微加以思惟观行，就能证果，不用一个法一个法的反反复复思惟观行。头一次证果的人，必须要反反复复仔细深入观行，七觉支都要深入修习，并且都要修成就，才能断除我见。即使三果四果人再来，遇到佛法之后，也要快速的生起这些觉分，然后才能证果。</p><p>无始劫来第一次断我见的人，这些觉分生起来可能要非常非常的慢，持续时间非常的长，每一觉分要非常坚固非常稳定，才能进入下一阶段。前世已经证果的再来人就不用这样，七觉分的生起一个连着一个很快，像舍利佛和目犍连这些大阿罗汉都是一瞬间就完成了，禅定也瞬间生起，他们的观行一念间就成就，脑子里一闪念就完成了。因为他们前世都完全具足了七觉分，而我们今世是第一次起修，需要的时间就要长久一些。如果七觉分不成就，没有修出来，或者修出来后没有持续一段时间就消失了，那是不能断我见的，如果非要这样说就是妄语。一个证果的人其身心的外在表现，与之前相比肯定有变化，因为毕竟有了初步的解脱功德受用，身心一定会转变一些的。</p><p>（二）七觉支具体观行</p><p>原文：<strong>复次。诸比丘。比丘即于七觉法。观法而住。然。诸比丘。比丘如何即于七觉法。观法而住耶。于此。诸比丘。比丘或于内念觉支存在者。知于我内念觉支存在。或于内念觉支不存在者。知于我内念觉支不存在。而知未生之念觉支生起。又知已生之念觉支修习成就。</strong></p><p>释：再次，诸比丘，比丘要于七觉分法观法而住。可是，诸比丘，比丘如何于七觉分法观法而住呢？是这样，诸比丘，比丘如果心里修出了念觉支，要如实知自己有内念觉支；如果心里没有修出内念觉支，也要如实知自己没有内念觉支；如果从前没有修出内念觉支，可是现在却出现了内念觉支，心里也要如实知；如果内念觉支逐渐修习圆满，心里也要如实知。</p><p>原文：<strong>或于内择法觉支存在者。知内择法觉支存在。乃至内择法觉支存在修习成就。或于内精进觉支存在者。知内精进觉支存在。乃至内精进觉支存在修习成就。或于内喜觉支存在者。知内喜觉支存在。乃至内喜觉支存在修习成就。</strong></p><p>释：比丘如果心里修出了择法觉支，要如实知自己有内择法觉支；如果心里没有修出内择法觉支，也要如实知自己没有内择法觉支；如果从前没有修出内择法觉支，可是现在却出现了内择法觉支，心里也要如实知；如果内择法觉支逐渐修习圆满，心里也要如实知。</p><p>比丘如果心里修出了精进觉支，要如实知自己有内精进觉支；如果心里没有修出内精进觉支，也要如实知自己没有内精进觉支；如果从前没有修出内精进觉支，可是现在却出现了内精进觉支，心里也要如实知；如果内精进觉支逐渐修习圆满，心里也要如实知。</p><p>比丘如果心里修出了喜觉支，要如实知自己有内喜觉支；如果心里没有修出内喜觉支，也要如实知自己没有内喜觉支；如果从前没有修出内喜觉支，可是现在却出现了内喜觉支，心里也要如实知；如果内喜觉支逐渐修习圆满，心里也要如实知。</p><p>原文：<strong>或于内息(轻安)觉支存在者。知内息(轻安)觉支存在。乃至内息(轻安)觉支存在修习成就。或于内定觉支存在者。知内定觉支存在。乃至内定觉支存在修习成就。或于内舍觉支存在者。知于内舍觉支存在。或于内舍觉支不存在者。知于我内舍觉支不存在。而知未生之舍觉支生起。又知已生之舍觉支修习成就。</strong></p><p>释：比丘如果修出了内轻安觉支，要如实知自己有内轻安觉支；如果心里没有修出内轻安觉支，也要如实知自己没有内轻安觉支；如果从前没有修出内轻安觉支，可是现在却出现了内轻安觉支，心里也要如实知；如果内轻安觉支逐渐修习圆满，心里也要如实知。</p><p>比丘如果修出了内定觉支，要如实知自己有内定觉支；如果没有修出内定觉支，也要如实知自己没有内定觉支；如果从前没有修出内定觉支，可是现在却出现了内定觉支，心里也要如实知；如果内定觉支逐渐修习圆满，心里也要如实知。</p><p>比丘如果修出了内舍觉支，要如实知自己有内舍觉支；如果没有修出内舍觉支，也要如实知自己没有内舍觉支；如果从前没有修出内舍觉支，可是现在却出现了内舍觉支，心里也要如实知；如果内舍觉支逐渐修习圆满，心里也要如实知。</p><p>原文：<strong>如是。或于内法观法而住。又于外法观法而住。又于内外法观法而住。或于法观生法而住。又于法观灭法而住。又于法观生灭法而住。尚又智识所成。及忆念所成。皆会有法之思念现前。彼当无所依而。且不执着世间任何物。诸比丘。比丘如是。即于七觉支法。观法而住。</strong></p><p>释：就像这样观行，或于内法观法而住，又于外法观法而住，又于内外法观法而住。观七觉支法时，分为观内七觉支法和外七觉支法，以及内外七觉支法同时观。内七觉支法就是内心深处比较隐秘的意根所修的七觉支，外七觉支就是意识所修的七觉支，然后对内外七觉支同时观行而住。然后又观这些法生起来，观到把心念住于法上，然后观行这些法灭去而住，同时又观这些法的生灭而住，到最后心里有一个念，全部是七觉支法的念。再把这些法的念舍掉，心住于一无所有的状态，住于空的状态，把心里的任何一种念都要空掉，心无所依，就这样住着，这也是舍觉支。每种观行后面都要舍除心中所念所想，住于舍念中，最后舍念也除，才为究竟。</p><p>如是，七觉支法就修完了，这叫观七觉支法而住。      </p><p>（三）如何是内外七觉支</p><p>佛在这部经中把七觉支分为内七觉支与外七觉支，真正的内心深处生起七觉支指的是意根具有的七觉支分，而表面生起的七觉支分指的是意识层面的七觉支分。意识所生起的外七觉支实际还没有熏习到意根的内七觉支，但真正要生起七觉支最主要的还是意根的内七觉支。</p><p>念觉支分为意识的外念觉支与意根的内念觉支。意识生起了外念觉支，但是如果意根不愿意被意识所熏习，意根还是会向外四处攀缘散乱，不愿意缘意识所念。意根没有念觉知，不念意识所念着的法义，意识的念觉支就不起作用，就会散坏掉。因为没有熏习到意根，意根的内念觉支不成就，那么后续的其它觉知都不能出现，就不能证果断我见。当念觉支真正成就的时候，不仅有意识的外念觉支，还要有意根的内念觉支成就，这两个都非常重要。意根的念觉支出现了，才能促使后边的觉支出现。</p><p>意根如果念念都不离所修的法，才能够每天持续的在法义上专注思惟，即便是吃饭睡觉都念着法，都不离思惟法义，这样的念觉支才是究竟的，因此内觉知支与外觉知缺一不可。又例如意根想要修四圣谛法，祂念念都会缘于四圣谛法，想把四圣谛法弄清楚，意识心就要配合意根不管行住坐卧，念念都是四圣谛法义。因为意根的心念实在太坚固了，牵引着意识必须随顺意根，这个坚固的心念就是意根的内念觉支。</p><p>单单只是意识具有的念觉知，会因意根处处攀缘的缘故而断去，所以初步的成就落于意识上，意识的念觉知成功的熏习了意根，意根的内念觉知就能成就，真正的成就还是落于意根上。由上可知一切法都要熏习到意根才能成就，没有熏习到意根，都只是意识层面的修学，不能证得法义。</p><p>择法觉支分为意识的外择法觉支，与意根的内择法觉支。外择法觉支先出现和成就，才能熏习意根，内择法觉支才能出现和成就。意识的外择法觉支是间断性的，不起决定作用，真正选择所修学的法时还会犹豫不决。而意根的择法觉支成就时，能自动自觉的选择正确的佛法来修学，不会走岔路和偏路。</p><p>意根的择法觉支就是抉择性，是由意根的思心所作用的。意根的思心所非常伶俐和快速，比如当出现突发性的重大事故时，意识的思惟抉择还没有生起，这时候意根的抉择性直接起用，或闪躲或作其他行为来躲避危险，当一系列的行为完毕后意识才反应过来。如果这时是在叉路口抉择走哪条道路时，意识还未来得及考虑，意根就依照祂的思心所来抉择了。</p><p>又比如同一时间内发生了三四件必须要处理的紧急事情，意识凌乱如麻没有办法抉择时，就要靠意根的思心所来抉择采取行动。意识只能配合着意根来造作，没有办法考虑什么和抉择什么了。但意根的抉择性还是需要意识不断的熏习，在多数法上才能有正确的抉择性。所以意根具备择法觉支，我们才能够精进的学法，如果意根还没有具备择法觉支，只有意识具备择法觉支还是不行的。</p><p>精进觉支分为意识的外精进觉支，与意根的内精进觉支。在一切法的修学中，如果只有意识想精进修学，而内心深处的意根却不想精进，那就无法精进修习，这个法就修不成就。比如有些人虽然表面上看起来很用功修行，读了很多书，学了很多佛法，可是意根不感兴趣，也不深思，对所学法不知不解，那么意识的修习犹如走马观花蜻蜓点水一样，意根心猿意马，结果什么也没学明白。又比如学生在听老师上课，知道不认真听课考试就不及格，表面好像有在认真的听老师上课，内心却止不住的想东想西，看书时一目十行硬背也记不住，一节课下来问学生学了什么有什么心得，学生什么也答不出来。有些不爱学习的小学生就是这样，坐在课桌边好像很专心听课的样子，可是意根魂不守舍，思想不知道飞到哪里去了，老师的声音左耳朵进去，从右耳朵直接就出去，一点也没有留在意根里，那就白学了。</p><p>意识心表面的精进，没有深入到意根就是外精进、假精进。所以任何一个法都要意根内精进才能够成就，意识的外精进像浮萍一样飘浮不定。只要意根的内精进成就了，即使在参禅时意识与他人谈话喝茶，或做其他事，都不影响意根的内精进，意根自然心心念念于参禅不断。参禅时或者是思量时，意根可以与意识同步，也可与意识不同步，但是意根与意识同步一起参禅比意识和意根单独的参禅要更深入些。静坐参禅配合行走参禅，意根与意识同时专注于一个法上，那思惟的就更明了，这时候就全心全意了，意识不用分神于其他法尘，意根不用接收来自于意识更多的信息。在活动当中的意根和意识分神很多，不够专注时，思惟的比静中思惟浅一些。总之，意识与意根同步精进，才是真精进。</p><p>喜觉支分为意识的外喜觉支，与意根的内喜觉支。先由意识对法义生起喜乐心爱乐心，而后熏习到意根，使得意根对法义也生起喜乐心爱乐心。意识的喜觉支比较肤浅，转瞬即消失，不久远不牢固，并不会带动身心的变化。而意根生起的喜乐心，比较深沉和坚固，会让整个身心充满喜乐，这样才能有后面的倚觉支，身心都轻安。意识喜乐与意根喜乐有区别，意根喜乐时喜笑颜开，眼睛里和面部上的神情都表露出意根的喜乐，意识的喜乐有些敷衍和做作的意思，并不真诚。</p><p>倚觉支分为意识的外觉支，和意根的内觉支。意识降伏了粗重的烦恼和盖障，生起了轻安和清凉，进一步熏习意根，意根也降伏了粗重的烦恼和盖障，使得身心都轻安舒适起来，之后就要发起禅定了。</p><p>定觉支分为意识的外定觉支，与意根的内定觉支。意识生起禅定之后，牵引意根不得不定时，这样内外定觉支就生起来了。如果只有意识的定觉支，没有意根的定觉支，那么意识的定觉支不长久不坚固，必然要散灭掉。意根有定觉支时，心心念念在于定中，不散乱不昏沉，思惟细密，能够生起真实的智慧。定觉支有二，一是定于所修行的法上不动摇，二是发起禅定，深入定中，专精思惟，不离不弃。定觉支保持到比较坚固的时候，就能修出舍觉支。</p><p>舍觉支分为意识的外舍觉支，与意根的内舍觉支。当禅定生起之后，在定水的滋润下，意识和意根的心念逐渐清净澄清下来，杂念去除了，心中所留存的法的念也渐渐减轻，最后心中凡有念都要舍去，清清净净，了无挂碍。最初是意识舍去了心念和觉观，继而意根也舍去了心念和各种知见，不喜不厌，平和中庸。真正的舍念成就是由意根成就，意根想要无念就无念，意根执著时，其心念意识可能无法控制，而且还要配合着意根而产生念。意根把喜乐心、憎恨心等等一切的心行都舍了，才能深入正法，专心于参究。当意根舍念清净时，六识就波平浪静。</p><p>到最后意识和意根心心念念都是七觉支的法，再把心里的七觉支的法都排除掉，任何一法也不住，这样就舍念清净了。依这样的修行方法，心里一法也不住，意根像如来藏一样一法都不执着，空空如也，到最后就能究竟成佛。修行就是用以契出契的方法，好比手上有刺，用针挑除刺，刺挑除以后，针就没用了，把针再舍掉。用佛法剔除世俗法，用深法剔除浅法，用更上的法剔除深法，最后舍弃一切法，就成就了。</p><p>学佛修行就是用佛法来破众生的无明，用更深的法破更深的无明，无明都破除了，不用再修佛法，佛法只能用来度众生。意识的外舍觉支舍除心中的法，意根的内舍觉支也把心中的法舍掉后，心里空空的，这时候什么念都没有了，舍念清净，就入甚深三昧。定成就智慧就能成就，在定中观行就能证法，后续的修行要相续证得如幻观，阳炎观，如梦观，镜像观等等所有甚深三昧境界。</p></div>"
},{
    "title": "第五章 （五）观四圣谛法而住",
    "author": "生如法师",
    "date": "2021年11月16日",
    "html": "<div class=\"B1_text\"><p><strong>五、观四圣谛法而住</strong></p><p>（一）观苦谛而住</p><p>原文：<strong>复次。诸比丘。比丘即于四圣谛法。观法而住。然。诸比丘。比丘如何即于四圣谛法观法而住耶。于此。诸比丘。比丘如实知此是苦。如实知此是苦之集。如实知此是苦之灭。如实知此是到苦灭之道。然。诸比丘。苦谛者何耶。生是苦。老是苦，病是苦。死是。忧悲苦恼闷是苦。求不得是苦。约略言之。五取蕴是苦。</strong></p><p>释：再次，诸比丘，比丘应该于四圣谛法观行而住。那么，诸比丘，比丘如何于四圣谛法观行而住呢？是这样，诸比丘，比丘应该如实了知什么是苦，如实了知什么是苦的集，如实了知什么是苦的灭，如实了知什么是灭苦应该修的道。</p><p>那么，诸比丘，苦的真实理是什么呢？出生是苦，老是苦，病是苦，死是苦，忧悲恼闷都是苦，有求不得也是苦，总体来说，五取蕴都是苦。</p><p>原文：<strong>复。诸比丘。生者何耶。于到处之生类中。有诸众生之生出产。入胎转生。诸蕴之显现。内外诸处之摄受。诸比丘。此名为生。复次。诸比丘。老者何耶。于到处之生类中。有诸众生之年老老耄。齿落头发白。皱纹皮肤。寿命短缩。诸根熟衰。诸比丘。此名为老。</strong></p><p>释：再次，诸比丘，什么是生？在所有处的生灵之类中，有很多众生出生、出胎、入胎、再次出生以及色蕴受蕴想蕴行蕴识蕴的显现，有内六处和外六处的摄受，就是生。再次，诸比丘，什么是老？在所有处的生灵之类中，有很多众生的年岁大了、衰老了、牙齿脱落了、头发花白了、皮肤出现皱纹了、寿命越来越短了、眼耳鼻舌身成熟衰落了，诸比丘，这就是老。　</p><p>原文：<strong>复次。诸比丘。死者何耶。于到处之生类中。有诸众生之消失散灭。破坏灭亡。消灭死殁。命终诸蕴之破坏。死尸之放弃。诸比丘。此名为死。复次。诸比丘。忧者何耶。诸比丘。有俱若干不幸。被若干苦法所恼。忧愁感内忧内怆。诸比丘。此名为忧。复次。诸比丘。悲者何耶。诸比丘。有俱若干不幸。被若干苦法所恼。叹悲叹息悲哀悲叹悲痛。诸比丘。此名为悲。</strong></p><p>释：再次，诸比丘，什么是死呢？在所有处的生灵之类中，有很多众生消失、散灭、破坏、灭亡、消灭、寿命终了、死灭了，以及五蕴被毁破、死尸被抛弃了，这就是死亡。再次，诸比丘，什么是忧呢？诸比丘，三界有法聚集之处有若干程度的不幸，被若干苦法所恼、有忧愁感，内心感到愁忧凄怆，这就是忧。再次，诸比丘，什么是悲呢？诸比丘，遇到了若干种不幸之事，被一些痛苦所逼恼，心里生起了悲叹、叹息、悲哀、悲叹、悲痛，这就是悲。</p><p>原文：<strong>复次。诸比丘。苦者何耶。诸比丘。关于身之苦痛。身之不快。由身触所生之苦痛及不快之感受。诸比丘。此名为苦。复次。诸比丘。恼者何耶。诸比丘。关于心之苦痛。于心不快。由意触所生之苦痛及不快之感受。诸比丘。此名为恼。复。诸比丘。闷者何耶。诸比丘。有俱若干不幸。被苦法所恼。失望沮丧气馁愁闷。诸比丘。此名为闷。</strong></p><p>释：再次，诸比丘，什么是苦呢？诸比丘，苦是有关身体上的苦痛，身体上的不快乐，由于身体上的触所产生的苦痛以及不快乐的感受，这就是苦。再次，诸比丘，什么是恼呢？恼是有关心里的苦痛，心上的不愉快，由意识触法尘所产生的苦痛以及不愉快的感受，这就是恼。再次，诸比丘，什么是闷呢？诸比丘，遭遇到了若干种不幸，心被这些痛苦的事情所逼恼，感到失望、沮丧、气馁、愁闷，诸比丘，这就是闷。</p><p>原文：<strong>然。诸比丘。求不得苦者何耶。诸比丘。于生法之众生。生如是欲求。我等实非于生法之下。我等不愿意生来。然。不得此欲求。此为求不得苦。诸比丘。于老法之众生。生如是欲求。我等实非于老法之下。我等不愿意老来。然。不得此欲求。此为求不得苦。</strong></p><p><strong>乃至。诸比丘。于病法之众生。生如是欲求。我等实非于病法之下。我等不愿意病来。然。不得此欲求。此为求不得苦。乃至诸比丘。于死法之众生。生如是欲求。我等实非于死法之下。我等不愿意死来。然。不得此欲求。此为求不得苦。乃至。诸比丘。于忧悲苦恼闷法之众生。生如是之欲求。我等实非于忧悲恼闷法之下。我等不愿意忧悲苦恼闷法之来。然。不得此欲求。此为求不得苦。</strong></p><p>释：那么，诸比丘，什么是求不得苦呢？诸比丘，对于有生命的众生，心里可能要有这样的欲求：我们确实不愿意处于生命之中，不愿意再活着，也不愿意再被出生。然而，却不能满足他们这样的欲求，这就是求不得苦。诸比丘，对于有衰老现象的众生，心里可能要有这样的欲求：我们确实不愿意处于衰老之中，不愿意再衰老。然而，却不能满足他们这样的欲求，这就是求不得苦。</p><p>诸比丘，对于有病苦的众生，心里可能要有这样的欲求：我们确实不愿意处于病苦之中，不愿意再有病。然而，却不能满足他们这样的欲求，这就是求不得苦。诸比丘，对于有死亡现象的众生，心里可能要有这样的欲求：我们确实不愿意处于死亡之中，不愿意死亡。然而，却不能满足他们这样的欲求，这就是求不得苦。</p><p>诸比丘，乃至于对于有忧悲苦恼闷法的众生，心里可能要有这样的欲求：我们确实不愿意处于忧悲苦恼闷之中，不愿意再有忧悲苦恼闷。然而，却不能满足他们这样的欲求，这就是求不得苦。</p><p>原文：<strong>然。诸比丘。约略而言。五取蕴之苦者何耶。如次之色取蕴。受取蕴。想取蕴。行取蕴。识取蕴。诸比丘。约略而言。此等名为五取蕴之苦。诸比丘。此亦名为苦圣谛。</strong></p><p>释：总而言之，诸比丘，简略来说，什么是五取蕴的苦呢？众生顺次执取色蕴，执取受蕴，执取想蕴，执取行蕴，执取识蕴，简略来说，有执就是苦，有取就是苦，执不得，取不得，更是苦，这就是五取蕴的苦。诸比丘，这也叫作苦圣谛。</p><p>（二）观苦集谛而住</p><p>原文：<strong>然。诸比丘。苦集圣谛者何耶。此爱能引导再生。有俱喜贪。到处为追求满足。即欲爱有爱无有爱。复次。诸比丘。彼爱于何处生起。于何处止住耶。凡于世间有可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：诸比丘，苦集圣谛是什么意思呢？现世的所有贪爱都能引发再次的出生，再次出生时无论接触什么都伴随着喜乐贪爱，贪爱欲界的法，贪爱色界的法，贪爱无色界的法，所追求的一切都是为了满足自己的贪爱心理。今世的烦恼能集成业种，引发后世的苦果，这就是苦集的真理。</p><p>再次，诸比丘，内心贪爱是在何处生起来的，又是住在何处、止于何处呢？凡是在世间有爱乐欣喜的事物存在，这种爱乐欣喜心就在执行事物处出生，在此处住着，在此处停止下来。喜乐于什么法，心就止住在什么法上，心就被什么法而束缚，不得解脱。</p><p>原文：<strong>何者于世间为可爱可喜耶。眼于世间为可爱可喜也。此爱即于此处生起。于此处止住。耳于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至鼻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至舌于世间为可爱可喜也。此爱即于此处生起。于此处止住。身于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至意于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：什么是世间里所可爱的可喜乐的法？眼根在世间里是可爱可喜乐的法，贪爱就在眼根处生起，在眼根处止住；耳根在世间里是可爱可喜乐的法，贪爱就在耳根处生起，在耳根处止住；鼻根在世间里是可爱可喜乐的法，贪爱就在鼻根处生起，在鼻根处止住；舌根在世间里是可爱可喜乐的法，贪爱就在舌根处生起，在舌根处止住；身根在世间里是可爱可喜乐的法，贪爱就在身根处生起，在身根处止住；乃至于意根在世间里是可爱可喜乐的法，贪爱就在意根处生起，在意根处止住。</p><p>这是在说六根，众生喜爱六根，因为六根能接触六尘，能为自己所用。因此心就住在六根上，不断的使用六根。</p><p>原文：<strong>色于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至味于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法于世间为可爱可喜也。此爱即于此处生起。于此处止住。</strong></p><p>释：色尘在世间里是可爱可喜乐的法，贪爱就在色尘处生起，在色尘处止住；声尘在世间里是可爱可喜乐的法，贪爱就在声尘处生起，在声尘处止住；香尘在世间里是可爱可喜乐的法，贪爱就在香尘处生起，在香尘处止住；味尘在世间里是可爱可喜乐的法，贪爱就在味尘处生起，在味尘处止住；触尘在世间里是可爱可喜乐的法，贪爱就在触尘处生起，在触尘处止住；法尘在世间里是可爱可喜乐的法，贪爱就在法尘处生起，在法尘处止住。</p><p>这是在说六尘，因为六尘能为众生所用，所有众生都贪爱六尘。</p><p>原文：<strong>眼识于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至耳识于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至鼻识于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至舌识于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至身识于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至意识于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：眼识在世间里是可爱可喜乐的法，贪爱就在眼识处生起，在眼识处止住；乃至耳识在世间里是可爱可喜乐的法，贪爱就在耳识处生起，在耳识处止住；乃至鼻识在世间里是可爱可喜乐的法，贪爱就在鼻识处生起，在鼻识处止住；乃至舌识在世间里是可爱可喜乐的法，贪爱就在舌识处生起，在舌识处止住；乃至身识在世间里是可爱可喜乐的法，贪爱就在身识处生起，在身识处止住；乃至于意识在世间里是可爱可喜乐的法，贪爱就在意识处生起，在意识处止住。</p><p>这是在说六识，因为六识能识别六尘，取着六尘，使用六尘，享受六尘，所以众生就喜爱六识。</p><p>原文：<strong>眼触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至耳触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至鼻触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至舌触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至身触于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至意触于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：眼触在世间里是可爱可喜乐的法，贪爱就在眼触处生起，在眼触处止住；乃至耳触在世间里是可爱可喜乐的法，贪爱就在耳触处生起，在耳触处止住；乃至鼻触在世间里是可爱可喜乐的法，贪爱就在鼻触处生起，在鼻触处止住；乃至舌触在世间里是可爱可喜乐的法，贪爱就在舌触处生起，在舌触处止住；乃至身触在世间里是可爱可喜乐的法，贪爱就在身触处生起，在身触处止住；乃至意触在世间里是可爱可喜乐的法，贪爱就在意触处生起，在意触处止住。</p><p>这是说十二处，六根触六尘，之就出生六识，就能享受六尘境界，因此众生都贪爱六触处。</p><p>原文：<strong>眼触所生之受于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至耳触所生之受于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至鼻触所生之受于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至舌触所生之受于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至身触所生之受于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至意触所生之受于世间为可爱可喜者。此爱即于此处生起。于此处止住。 </strong></p><p>释：眼触之后所生的受蕴在世间里是可爱可喜乐的，贪爱就在眼触所生的受蕴处生起，在眼触所生的受蕴处止住；乃至耳触之后所生的受蕴在世间里是可爱可喜乐的，贪爱就在耳触所生的受蕴处生起，在耳触所生的受蕴处止住；乃至鼻触所生的受蕴在世间里是可爱可喜乐的，贪爱就在鼻触所生的受蕴处生起，在鼻触所生的受蕴处止住；乃至舌触所生的受蕴在世间里是可爱可喜乐的，贪爱就在舌触所生的受蕴处生起，在舌触所生的受蕴处止住；乃至身触所生的受蕴在世间里是可爱可喜乐的，贪爱就在身触所生的受蕴处生起，在身触所生的受蕴处止住；乃至意触所生的受蕴在世间里是可爱可喜乐的，贪爱就在意触所生的受蕴处生起，在意触所生的受蕴处止住。</p><p>这是说六识的受，六根触六尘之后，就有六识的感受出生，众生都是非常贪爱受觉受蕴，心都住于受蕴上，为了受蕴，不惜造作恶业。</p><p>原文：<strong>色想于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声想于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香想于世间为可爱可喜也。此爱即于此处生起。于此处止住。味想于世间乃至为可爱可喜也。此爱即于此处生起。于此处止住。触想于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法想于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：色想在世间里是可爱可喜乐的，贪爱就在色想处生起，在色想处止住；乃至声想在世间里是可爱可喜乐的，贪爱就在声法处生起，在声想处止住；乃至香想在世间里是可爱可喜乐的，贪爱就在香想处生起，在香想处止住；乃至味想在世间里是可爱可喜乐的，贪爱就在味想处生起，在味想处止住；乃至触想在世间里是可爱可喜乐的，贪爱就在触想处生起，在触想处止住；乃至法想在世间里是可爱可喜乐的，贪爱就在法想处生起，在法想处止住。</p><p>六根触六尘受蕴出生以后想蕴出生，六识就会执取六尘境界，众生也都贪爱自己的想蕴。</p><p>原文：<strong>色思于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声思于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香思于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至味思于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至触思于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法思于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：色思在世间里是可爱可喜乐的，贪爱就在色思处生起，在色思处止住；乃至声思在世间里是可爱可喜乐的，贪爱就在声思处生起，在声思处止住；乃至香思在世间里是可爱可喜乐的，贪爱就在香思处生起，在香思处止住；乃至味思在世间里是可爱可喜乐的，贪爱就在味思处生起，在味思处止住；乃至触思在世间里是可爱可喜乐的，贪爱就在触思处生起，在触思处止住；乃至法思在世间里是可爱可喜乐的，贪爱就在法思处生起，在法思处止住。</p><p>六根触六尘，执取六尘以后，行蕴出生，六识就要造作身口意行了，众生都喜欢行蕴，喜欢不断的造作身口意行。</p><p>原文：<strong>色爱于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声爱于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香爱于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至味爱于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至触爱于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法爱于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：色爱在世间里是可爱可喜乐的，贪爱就在色爱处生起，在色爱处止住； 乃至声爱在世间里是可爱可喜乐的，贪爱就在声爱处生起，在声爱处止住；乃至香爱在世间里是可爱可喜乐的，贪爱就在香爱处生起，在香爱处止住；乃至味爱在世间里是可爱可喜乐的，贪爱就在味爱处生起，在味爱处止住；乃至触爱在世间里是可爱可喜乐的，贪爱就在触爱处生起，在触爱处止住；乃至法爱在世间里是可爱可喜乐的，贪爱就在法爱处生起，在法爱处止住。</p><p>贪爱六尘境界的心行，也是众生喜爱宝爱的，不愿意舍弃的，因此众生也都喜乐于贪爱。</p><p>原文：<strong>色寻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声寻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香寻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至味寻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至触寻于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法寻于世间为可爱可喜者。此爱即于此处生起。于此处止住。</strong></p><p>释：追寻色在世间里是可爱可喜乐的，贪爱就在追寻色处生起，在追寻色处止住；乃至追寻声在世间里是可爱可喜乐的，贪爱就在追寻声处生起，在追寻声处止住；乃至追寻香在世间里是可爱可喜乐的，贪爱就在追寻香处生起，在追寻香处止住；乃至追寻味在世间里是可爱可喜乐的，贪爱就在追寻味处生起，在追寻味处止住；追寻触在世间里是可爱可喜乐的，贪爱就在追寻触处生起，在追寻触处止住；追寻法在世间里是可爱可喜乐的，贪爱就在追寻法处生起，在追寻法处止住。</p><p>由于众生喜爱色声香味触法境界，为了满足自己的贪爱心理，就会不断的追求六尘寻觅六尘境界，不愿意放弃和舍弃自己的追寻心，所以众生生生世世都在不断的追求和寻觅着六尘境界。</p><p>原文：<strong>色伺于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至声伺于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至香伺于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至味伺于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至触伺于世间为可爱可喜也。此爱即于此处生起。于此处止住。乃至法伺于世间为可爱可喜者。此爱即于此处生起。于此处止住。诸比丘。此名为苦集圣谛。</strong></p><p>释：等待色的出现在世间里是可爱可喜乐的，贪爱就在等待色处生起，在等待色处止住；等待声的出现在世间里是可爱可喜乐的，贪爱就在等待声处生起，在等待声处止住；等待香的出现在世间里是可爱可喜乐的，贪爱就在等待香处生起，在等待香处止住；等待味的出现在世间里是可爱可喜乐的，贪爱就在等待味处生起，在等待味处止住；等待触的出现在世间里是可爱可喜乐的，贪爱就在等待触处生起，在等待触处止住；等待法的出现在世间里是可爱可喜乐的，贪爱就在等待法处生起，在等待法处止住。</p><p>众生对六尘境界的贪爱和追求，一开始是比较粗的寻觅行为，寻觅到一定时候，觉得快得到了，就开始有等待，细心的等待六尘境界的出现。众生由于这些贪爱的行为，就集起了生死业种，后世就会出生生死苦报。</p><p>（三）观苦灭谛而住</p><p>原文：<strong>复次。诸比丘。苦灭圣谛者何耶。对彼爱之无余离欲。灭尽。舍离。弃舍。解脱。无染是。复次。诸比丘。彼爱于何处舍。于何处止灭耶。于世间有可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：再次，诸比丘，什么是苦灭圣谛？对于上述那些法的贪爱已经完完全全离开了，灭尽了、舍离了、弃舍了，对于从前的贪爱现在已经完全解脱出来了，心已经完全无染了。这是四果阿罗汉烦恼灭尽的境界，有能力摆脱生死苦，可以不再受生。再次，诸比丘，这些爱集在什么处能舍离贪爱的苦果，在什么处才能止息这些贪爱呢？在世间里有可爱乐可喜欢之处，贪爱就在此处舍弃，在此处止灭，以后就不再有贪爱和喜乐。</p><p>原文：<strong>何者于世间为可爱可喜耶。眼于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。耳于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至鼻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至舌于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至身于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至意于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：在世间里什么法是可贪爱可喜乐的？眼根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至耳根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至鼻根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至舌根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至身根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至意根在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>色于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至为可爱可喜者。此爱即于此处舍弃。于此处止灭。香于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：色法在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至声法在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至香法在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生； 乃至味法在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至触法在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至法尘在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>眼识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至耳识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至鼻识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至舌识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至身识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至意识于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：眼识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至耳识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至鼻识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至舌识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至身识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至意识在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>眼触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至耳触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至鼻触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至舌触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至身触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至意触于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：眼触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至耳触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至鼻触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至舌触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至身触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至意触在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>眼触所生之受于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至耳触所生之受于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至鼻触所生之受于世间为可爱可喜者。此爱即于此处舍。于此处止灭。乃至舌触所生之受于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至身触所生之受于世间为可爱可喜。此爱即于此处舍弃。于此处止灭。乃至意触所生之受于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：眼触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至耳触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至鼻触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至舌触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至身触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至意触所生的受蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>色想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至香想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至触想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法想于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：色触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；声触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；香触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至味触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对触触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至法触所生的想蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>色思于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声思于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至香思于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味思于世间为可爱可喜者此爱即于此处舍弃。于此处止灭。乃至触思于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法思于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：色触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至声触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至香触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至味触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至触触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至法触之后所出生的行蕴在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>六根对于六尘的触，之后就会产生识蕴受蕴想蕴行蕴，这是往往也会对五蕴和四蕴产生贪爱心理，那么灭除贪爱，也要灭除六根触六尘时在色声香味触法上的受想行识的贪爱。如贪爱在色尘上产生的受蕴想蕴和行蕴，在修行之后要断尽，才能得解脱，在声尘香尘味尘触尘和法尘上的受想行蕴的贪爱，也要断尽，才能得解脱。</p><p>原文：<strong>色爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至香爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至触爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法爱于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：对色的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对声的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对香的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对味的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对触的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对法的爱在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>色寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至香寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至触寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法寻于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。</strong></p><p>释：对色的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对声的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对香的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对味的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对触的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对法的追寻在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。</p><p>原文：<strong>色伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至声伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至香伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至味伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至触伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。乃至法伺于世间为可爱可喜者。此爱即于此处舍弃。于此处止灭。诸比丘。此名为苦灭圣谛。</strong></p><p>释：对色的等待在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对声的等待在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对香的等待在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对味的等待在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生；乃至对法的等待在世间里是可贪爱可喜乐的，贪爱就在此处舍弃，在此处止灭，不再出生。诸比丘，这就是苦灭圣谛。</p><p>（四）观苦灭道谛而住</p><p>原文：<strong>复次。诸比丘。苦灭道圣谛者何耶。八支圣道。即正见。正思。正语。正业。正命。正精进。正念。正定也。</strong></p><p><strong>然。诸比丘。正见者何耶。诸比丘。如实知苦。知苦之集。知苦之灭。知至苦灭之道。诸比丘。此名为正见。复次。诸比丘。正思者何耶。无欲之思。无恚之思。无害之思。诸比丘。此名为正思。复次。诸比丘。正语者何耶。远离两舌远离恶口。远离妄语。远离绮语。诸比丘。此等名为正语。复次。诸比丘。正业者何耶。远离杀生。远离不与取。远离邪淫。诸比丘。此等名为正业。</strong></p><p>释：复次，诸比丘，什么是苦灭道谛呢？八正道是能灭苦的修行方法。八正道就是正见、正思、正语、正命、正精进、正念、正定。</p><p>那么，诸比丘，什么是正见？如实了知什么是苦，如实了知什么是苦的集，如实了知什么是苦灭，如实了知什么是苦灭修道的方法，就是正见。复次，诸比丘，什么是正思呢？没有任何欲望的思维，没有任何嗔恚的思维，没有任何恼害的思维，就是正思维。复次，诸比丘，什么是正语呢？远离两舌，远离恶口，远离妄语，远离绮语，就是正语。复次，诸比丘，什么是正业呢？远离杀生，远离不与取，远离邪淫，就是正业。</p><p>原文：<strong>复次。诸比丘。正命者何耶。诸比丘。于此。圣弟子舍邪命。依正命而营活命。诸比丘。此等名为正命。复次。诸比丘。精进者何耶。诸比丘。于此。比丘起坚决心卖力精进。心勤注意。令不生未生之恶不善法。起坚决心卖力精进。心勤注意。远离已生之恶不善法。起坚决心卖力精进。心勤注意。令生未生之善法。起坚决心卖力精勤。心勤注意。令住已生之善法。令不惑乱。使之增长充满。修习成就。诸比丘此等名为正精进。</strong></p><p>释：复次，诸比丘，什么是正命呢？诸比丘，在世间里维持生活，圣弟子能舍弃不如法的谋取生存资粮的手段，而依于如法的合理的谋生手段来活命，这就是正命。复次，诸比丘，什么是正精进呢？在修道过程中，能够生起勇猛心，非常卖力的精进的让还没有生起来的恶法不再生起；勇猛精进卖力的专一其心，心心念念都要远离已经生起的恶法不善法；并且生起勇猛的精进心，专注一心让还没有生起的善法生起来；勇猛精进的，专心一意的住在已经生起来的善法上，让善法不被惑乱，逐渐增长，圆满成就，诸比丘，这就是正精进。　　　</p><p>原文：<strong>复。诸比丘。正念者何耶。诸比丘。于此。比丘于身观身而住。精勤正智正念而舍离世间之欲恼。于受观受而住。精勤正智正念而舍离世间之欲恼。乃至于心观心而住。精勤正智正念而舍离世间之欲恼。乃至于法观法而住。精勤正智正念而舍离世间之欲恼。诸比丘。此等名为正念。</strong></p><p>释：复次，诸比丘，什么是正念呢？诸比丘，比丘修习正念，要修于身观身而住，精进勤勉，正智正念，舍离世间的欲望和恼害；比丘修习正念于受观受而住，精进勤勉，正智正念，舍离世间的欲望和恼害；比丘修习正念于心观心而住，精进勤勉，正智正念，舍离世间的贪欲和恼害；比丘修习正念于法观法而住，精进勤勉，正智正念，舍离世间的贪欲和恼害，诸比丘，这就是正念。</p><p>原文：<strong>复次。诸比丘。正定者何耶。诸比丘。于此。比丘去欲。离不善法。有寻有伺。由离生喜乐。达初禅而住灭寻伺。内心安静。心成专一。无寻无伺。由定生喜乐。达第二禅而住。更舍离喜而住。正念正智。以身感受乐。唯诸圣者说。舍此而正念乐住。达第三禅而住。其次舍乐离苦。以前所感受之喜忧皆灭故。而不苦不乐。成为舍念清净。达第四禅而住。诸比丘。此名为正定。诸比丘。此等名为苦灭道圣谛。</strong></p><p>释：复次诸比丘。。什么是正定呢？比丘修习正定，去除贪欲，远离不善法，内心里既有寻觅也有等待的心理状态，由于离去欲界而生出喜心和乐心；把寻觅等待的心理状态灭去，内心安静恬淡，专一其心，既没有寻觅的心，也没有等待的心，由这种禅定而生出喜心和乐心，到达第二禅而住；然后再舍离喜心而住，心里正智正念，在身体上就会感受到乐触，就如诸圣贤们说的：舍去欢喜心，正念住于乐受上，达到第三禅而住；再其次，把乐受舍去，也离开苦受，从前心里所感受到的喜乐忧愁都灭掉，只有不苦不乐，修成为舍去念想的清净心，就达到四禅了。诸比丘，这就是正定。初禅之前的定，都不是正定。</p><p>原文：<strong>如是。于内法观法而住。于外法观法而住。又于内外。观法而住。或于法。观生法而住。于法观灭法而住；又于法观生灭法而住。尚又智识所成及忆念所成。皆会有法之思念现前。彼当无所依而住。且不执着世间任何物。诸比丘。比丘如是。于四圣谛观法而住。</strong></p><p>释：佛说：就像这样，或于四圣谛的内法观法而住，又于四圣谛的外法观法而住，又于四圣谛的内外法观法而住。然后又观这些法生起来，观到把心念住于观法生上，然后观行这些法灭去，心住于观灭法上，同时又观这些法的生灭而住，到最后心里有一个念，全部是四圣谛法的念。再把这些法的念舍掉，心住于一无所有的状态，住于空的状态，把心里的任何一种念都要空掉，心无所依，就这样住着，这也是舍觉支。每种观行后面都要舍除心中所念所想，住于舍念中，最后舍念也除，才为究竟。</p><p>原文：<strong>诸比丘。实不管任何人。七年间如是修此四念处者。得二果中之一果。即于现法得究竟智。或有余者。期待不还来。诸比丘。当建立七年间之念。诸比丘。不管任何人。于六年间……乃至……五年间……乃至……四年间……乃至……三年间……乃至……二年间……乃至……一年间。如果修此四念处者。得二果中之一果。即于现法得究竟智。或有余者。期待不还来。诸比丘。当建立一年间之念。</strong></p><p>释：诸比丘，确实是不管是什么人，用七年时间，像这样修习四念处，就会得到两个果中的一个果，在现前存在的法中，在现世就会证得解脱的究竟智慧，能趣向无余涅槃；或者证得有余涅槃，希望不再来人间，也就是三四果中必证得一个果。诸比丘，应当花费七年的时间修成四念处观，七年中心心念念都是四念处观，必成就三四果中之一果。</p><p>诸比丘，确实是不管什么人，分别用六年的时间，或者用五年的时间，或者用四年的时间，或者用三年的时间，或者用二年的时间，或者用一年的时间，像这样修习四念处，就会得到两个果中的一个果，就是在现前存在的法中，现前就会证得解脱的究竟智慧，能趣向无余涅槃；或者证得有余涅槃，希望不再来人间，也就是三四果中必证得一个果。诸比丘，应当花费六年、五年、四年、三年、二年、一年的时间修成四念处观，心心念念都是四念处观，必成就三四果之一果。诸比丘，应当在一年中修习成念念都是四念处观。</p><p>原文：<strong>任何人七个月间如是修此四念处者。得二果中之一果。即于现法得究竟智。或有余者。期待不还来。诸比丘。当建立七个月间之念。实不管任何人。于六个月……乃至……五个月……乃至……四个月……乃至……三个月……乃至……二个月……乃至……一个月……乃至……半个月。如是修此四念处者。得二果中之一果。即于现法得究竟智。或有余者。期待不还来。诸比丘。当建立半月间之念。</strong></p><p>释：确实是不管任何人用七个月时间，如此精进的修习四念处观，必得二果中的一果，一个是无余涅槃，一个是有余涅槃。诸比丘，应当花费七个月的时间，修习四念处，心心念念都是四念处，就会证得涅槃解脱。实际上不管任何人，在六个月当中，在五个月当中，在四个月当中，在三个月当中，在二个月当中，在一个月当中，在半个月当中，如此精进的修习四念处，必得二果中的一果，即于现前证得无余涅槃或者是有余涅槃。诸比丘，应当花费半个月的时间，修习四念处，心心念念都是四念处观。</p><p>原文：<strong>诸比丘。实不管任何。于七日间如是修此四念处者。得二果中之一果。即于现法得究竟智。或有余者。期待不还来。如叙述诸比丘。此为众生之清净。为度忧。为灭苦恼。为得真理。为证涅槃。唯一趣向道。即四念处。为此而说此经。</strong></p><p><strong>世尊如是说已。彼随喜之诸比丘。欢喜世尊之所说。</strong></p><p>释：诸比丘，确实是不管任何人，在七日之中，如此精进的修习四念处观，必得二果中的一果，就是在现前存在的法中，证得究竟的涅槃解脱智慧；或者是证得有余涅槃，希望不再来此人间受苦。诸比丘，这种四念处观的修习方法，特意为众生获得清净而说，为了度脱众生的忧悲苦恼，为了灭除众生的生死苦恼，为了众生证得真理，为了众生得到涅槃之乐，而说此经。只有四念处观才能使得众生趣向这些乐处，因此而说四念处经。</p><p>世尊讲完这部经之后，所有随喜赞叹此经的诸比丘，都很欢喜世尊所说。</p></div>"
}]