[{
    "title": "杂阿含经第一卷 一",
    "author": "生如法师",
    "date": "2019年07月14日",
    "html": "<div class=\"B1_text\"><p><strong>杂阿含经第一卷 一</strong></p><p>世尊告诉诸比丘：你们应当观行色阴的无常，能够如实观察色阴的无常者，就是在作正确的观行。如果能够正确地观行色阴的无常，就会对色阴生起厌离心，对色阴生起厌离心的话，就会断除对色阴的喜爱贪恋；对色阴的喜爱贪恋断尽的人，就是心得解脱的人。</p><p>如此再来观行受阴、想阴、行阴、识阴的无常，能够如实观行受想行识四阴的无常者，就是在作正确的观行。作正确观行的人，就会对受想行识四阴生起厌离心；生起厌离心者，对受想行识四阴的喜爱贪恋就能断尽；对受想行识四阴喜爱贪恋断尽的人，就是心得解脱的人。</p><p>如是，比丘，心得解脱的人，如果想自己来作证明得解脱、能够入无余涅槃，就能够自己作证明，可以不用他人来证明。他就会证明说：我无量劫的生死轮回到这一生，就已经了尽，不会再有生死了。我的清净梵行已经建立起来了，心得清净，不再有欲想了。这一生我所作的了脱生死的事业已经作完了。我自己能够知道，不再受未来世的欲界有身、色界有身、无色界有身，不会在三界当中再次出生了，命终就会入无余涅槃。</p><p>世尊又告诉诸比丘：你们应当观行五阴的苦、空、非我性，如是观行者，就是正确的观行。能够进行正确观行的人，就会对五阴生起厌离心；对五阴生起厌离心者，就会断除对五阴的喜爱贪恋；对五阴的喜爱贪恋断尽的人，我说就是心得解脱的人。心得解脱的人，如果想自己证明自己得解脱，他就能证明自己。他就证明说：我生已尽，梵行已立，所作已办，自知不受有。这时诸比丘们闻佛所说，都非常欢喜，信受奉行！</p></div>"
},{
    "title": "杂阿含经第一卷 三",
    "author": "生如法师",
    "date": "2019年07月14日",
    "html": "<div class=\"B1_text\"><p><strong>杂阿含经第一卷 三</strong></p><p>世尊告诉诸比丘：内心对于色阴不了知、不明理、不断贪欲、不离贪欲，仍然贪爱着自己的色阴，就不能断除生老病死忧悲苦恼。对于受阴、想阴、行阴、识阴，不了知、不明理、不断贪欲、不离开贪欲，内心仍然贪爱着自己的受阴想阴行阴和识阴，就不能断除生老病死忧悲苦恼。</p><p>诸比丘，对于色阴如果能够了知、能够明了、能够断除贪欲、能够离开贪欲，那么就有能力断除生老病死忧悲苦恼。对于受想行识四阴，如果能够了知、明了、能够断除贪欲，离开贪欲，那么就有能力断尽生老病死忧悲苦恼，得以解脱。</p><p>修解脱道，首先要明了五阴的概念和内涵，其次要随时随处观察五阴的无常、虚妄、生灭、变化、空幻、无我。只有这样，才能逐渐减少对五阴的贪爱，也才能断我见，进而发起初禅，断除对五阴的贪欲，最后才能断尽所有的贪爱，断尽一切烦恼。如果不明了五阴，不观察五阴，贪心不减，更不会灭尽，就不能超越生死轮回苦。 破除无明，就是明，有明就能解脱，无明就是生死，无明断尽出离三界生死苦。</p></div>"
},{
    "title": "杂阿含经第一卷 五",
    "author": "生如法师",
    "date": "2019年07月14日",
    "html": "<div class=\"B1_text\"><p><strong>杂阿含经第一卷 五</strong></p><p>世尊告诉诸比丘：贪爱色阴的人，就等于贪爱喜乐苦一样；喜乐于苦的人，就不能解脱于苦，就不能断掉无明，也不能离开贪欲。贪爱受阴、想阴、行阴、识阴的人，就是贪爱苦的人。贪爱喜乐于苦的人，对于苦就不能得解脱，不能断掉无明，不能离开贪欲。为什么贪爱喜乐于色阴受阴想阴行阴识阴的人就是喜乐于苦呢？因为贪爱喜乐是一种染污心，不清净。 贪爱喜乐五阴，就被五阴束缚住，心就被粘住，不得解脱。</p><p>众生意根有我爱烦恼，执著于自己五阴，不愿意灭掉五阴，命终就会有中阴身，在中阴身里，因为意根执著自我，想有未来世的色身，就会去投胎，于是下一世的五阴就产生了。有五阴就有苦受，生老病死无量的忧悲苦恼就不断出现。所以贪爱喜乐于五阴，就是喜乐于苦。世尊又告诉诸比丘：对于色阴不贪爱喜乐的人，就等于不喜乐苦受；不喜乐苦受的人，对于苦受就能得解脱。</p><p>如是，对于受阴想阴行阴识阴不贪爱喜乐的人，就是不喜乐于苦受；不喜乐苦受的人，就能解脱于苦受。世尊告诉诸比丘：对于色阴不知道，不明了，就不能离开贪欲，不离开贪欲，心就不能得解脱。贪心不断掉，不解脱的话，就不能断掉苦受，不能解脱苦受；如是，对于受阴想阴行阴识阴不知道，不明了，就不能离开贪欲，不离开贪欲，心就不能得解脱，心不得解脱，就不能断苦。</p><p>世尊告诉诸比丘：对于色阴如果能够了知，能够明了，就能离开贪欲，如果能够离开贪欲，就能心得解脱，心得解脱的人，就能断苦。如是对于受阴想阴行阴识阴，如果能够了知，能够明了，就能离开贪欲，如果能够离开贪欲，心就能够得解脱，心得解脱的人，就能灭苦。</p></div>"
},{
    "title": "杂阿含经第一卷 七",
    "author": "生如法师",
    "date": "2019年07月14日",
    "html": "<div class=\"B1_text\"><p><strong>杂阿含经第一卷 七</strong></p><p>世尊告诉諸比丘：如果一个人对于色阴是贪爱喜欢的话，就等于是喜欢苦；贪爱喜欢苦的人，对于苦就是不解脱的。因为喜欢贪爱色阴，身见就不断，就会被色阴所系缚，内心就会去执取贪取色阴。贪执不断的话，意根对色阴的执著就不断，命终时，意根因为执著，总想有色阴的存在，于是就会有中阴身产生出来。</p><p>而中阴身是七天一灭亡，最多有七个中阴身，意根知道中阴身不保靠，就会急急忙忙地去投胎，以保有未来世的色阴存在。投胎以后就有了下一世的色阴出生，于是就有了生老病死的无量忧悲苦恼，纯大苦聚就产生了。那么众生就要受这些无量的忧悲苦恼，不能解脱于生死苦，受苦就不断。所以世尊说，贪爱色阴就是贪爱苦。</p><p>世尊曾经带领弟子们到一海边，看见沙滩上躺着一具女尸，这具女尸已经胖肿膨胀了，脸上爬着一只小虫子。世尊告诉弟子说：这个女人生前长相非常美丽，她自己非常喜欢自己的相貌，每天都照镜子观看自己的脸，命终时因为对自己贪爱不舍，就托生为一只虫子在脸上爬来爬去，继续贪爱她的脸。这个故事告诉我们，喜欢什么，就被什么所系缚住，不能脱离，不能解脱。必有未来世的生老病死出生，不能离开忧悲苦恼，不得解脱生死苦。世尊让我们断贪爱，就是让我们断苦，心得解脱，出离生死轮回。</p><p>世尊告诉諸比丘，如是对于受阴、想阴、行阴、识阴贪爱喜欢的话，就是在贪爱喜欢苦；喜欢苦的人，对于苦就是不得解脱的，受苦就不断。因为贪爱受阴、想阴、行阴、识阴，就会被这四阴所系缚、所粘住，内心就会执取这四阴，执取不断，未来世的有就不断。命终时因为意根的执著，就会出生中阴身，然后又去投胎，就会有下一世的受想行识四阴的出生，那么生老病死无量的忧悲苦恼就产生出来了，众生就会受苦不断，不得解脱生死轮回苦。</p><p>世尊又告诉諸比丘，如果对于色阴不再贪爱喜欢了，就不会被色阴所系缚，内心就不再执取色阴，就不会再有中阴身的出现，或者意根会在中阴身灭掉自己，不会再去投胎，这样未来世是色阴就不会出生了，生老病死无量忧悲苦恼也就灭了，心得解脱，也解脱于生死轮回苦了。</p><p>世尊又告诉諸比丘，如果对于受想行识四阴不再贪爱喜欢了，就不会被这四阴所系缚所粘住，内心就不会再执取四阴，就不会再有中阴身的出现，或者意根会在中阴身灭掉，不会去投胎。这样未来世的四阴就不会出生了，生老病死无量忧悲苦恼也就灭掉了，心得解脱，也解脱于生死轮回苦了。</p></div>"
}]