[{
    "title": "第一章 五蕴中的我是指什么",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  五蕴中的我是指什么</strong></p><p>一、断我见要断哪个我的见？</p><p>断我见是断哪个我的知见，只有弄清楚这个问题，才能断我见。如果连要断哪个我的知见都不知道，那就不能断我见了，目标不明确，当然就达不成目标了。有我见的当然是五蕴了，是五蕴中的七个识心，主要是指六七识。六七识把什么法当作我，就要让六七识否定什么法，不认什么法为我，或者说确认什么法不是我，这样才是断我见了，总之，是断除六七识的我见。</p><p>有一些人糊涂地认为是断除第八识的我见，可事实上第八识没有我见，祂不把任何一个法当作第八识自己，也不把第八识本身当作是自己，所以第八识没有我见。即使第八识有我见，要如何断除第八识的我见呢？这根本无从下手，六七识无法与第八识沟通和交流，如何能让第八识断我见呢？所以断我见的我的主体是五蕴中的六七识，那就想办法让六七识断我见，才能解脱五蕴中六七识的生死。还有些人认为色蕴也有我见，也应该断除色蕴的我见，可是色蕴是色法，色法不是识心，没有思想观念，没有我的观念，如何让色蕴断我见呢？是六七识认为色蕴是我，所以要让六七识断除色蕴为我的我见。</p><p>二、五蕴无我是无什么？                         </p><p>我是主宰义、自主义、恒常不变义、真实义，五蕴却没有这样的特征和性质，所以五蕴不是我，五蕴不能把控，没有主宰，不能自主，不是恒常不变的，不是真实的。五蕴是破坏义，是毁损义，是坏灭义，是空义。通过观行，证得这些理，就证得了五蕴无我非我。                         </p><p>这里没有第八识如来藏什么事，声闻人知道有个第八识不生不灭，是五蕴的所依就完全可以断我见。那些外道们遇到佛陀，听佛陀讲法几分钟就证得四果大阿罗汉，根本来不及了解第八识，不知第八识是何义，更来不及观行五蕴与第八识的关系，他们不可能思惟观行出五蕴无第八识，五蕴非第八识，得不出这样的结论，但他们确实证阿罗汉果了，也在佛前先于佛而涅槃了。                          </p><p>佛在四念处经里教导弟子观行证果，整部经从始至终都没有提到过五蕴的所依是第八识，弟子在整个观行过程中，一点也没涉及到第八识，没有观行过第八识，没有把五蕴与第八识联系起来观行，最后很多弟子都证得五蕴苦空无常无我，获得初果到四果的法眼净。所以得出无我的结论，其中根本没有五蕴无第八识的意思，五蕴无我不是无第八识，而是无主体无主宰无恒常。</p><p>三、五蕴无我的我是指什么？                     </p><p>五蕴是我，五蕴非我，这个我是指什么？凡夫认为五蕴是我，圣贤认为五蕴非我。这个我到底是指什么？                          </p><p>有人说这个我是指第八识如来藏，这个说法对不对呢？如果对，那么凡夫因为有我，认为五蕴是第八识如来藏。凡夫有这样的认知，有这样的思想观念吗？肯定没有，如果有这样的思想观念，个个也都不是凡夫了，而直接越过三贤位，成为圣位的地上菩萨。因为只有地上菩萨才有能力观察到五蕴十八界方方面面全部都是如来藏性，实质都是如来藏，证得了一分或者是多分一真法界性，如果能证得法界全体都是一真法界，那就是佛了。                          </p><p>所以说凡夫是不可能有五蕴就是第八识如来藏这样的智慧认知的，事实上凡夫众生都没有这样的思想观念和认知，即使是学佛的凡夫众生，大多数也不知道有第八识如来藏，知道的也有很多不承认第八识如来藏的真实性不虚妄性，当然更没有证得，就不会把五蕴当作第八识如来藏。尤其是三恶道众生，更无法把五蕴与第八识联系起来，但三恶道众生都有我见，都把自己的五阴身当作我和我所有的去维护。尤其是畜生，愚痴至极，头脑里什么概念都没有，就知道五阴身是我，也没有我的概念，但不妨碍畜生们对自我的维护，因为意根就是没有语言文字和思惟的知道五阴身这个我，别的一无所知。</p><p>这样的话，凡夫众生根本也没有必要通过学习四圣谛法，观行五蕴，去否定五蕴就是第八识如来藏这个绝对真理，而得出一个错误的结论说五蕴非第八识如来藏。这个结论直接否定了地上菩萨的唯识甚深大智慧，与唯识正理相违背，也与华严经所说的一真法界正理相违背。所以证果得出五蕴非第八识如来藏这样的结论，就是没有证果，也没有做过如实的观行，没有真实的修行过程，有如实修行过程的人，根本得不出这样的结论。这是断我见观行的一条邪路，得不到断我见的正果，不能得法眼净，也不能得解脱。                          </p><p>证果以后的人，认为五蕴是苦的，是空的，是无常的，不是恒常不变的，不是真实的，不是自主的，不是有主宰的。于是渐渐放弃这样的五蕴，渐渐不执这样的五蕴，烦恼渐渐就消失了灭了，于是就解脱了。真断我见之后，这些陈述都没有什么意义了，自己的亲身感受是最真实可靠可信赖的，没有言语，心里就知道是怎么回事。</p><p>四、五蕴是我五蕴无我的我指的是什么</p><p>断我见的观行非常重要，把认五蕴为我的我搞清楚极其重要，如果连五蕴中有我见的我都搞不清楚，如何能断我见呢？有我见者是意识和意根，第八识绝对没有我见，那么断我见就是要断除意识和意根的我见，让意识意根确认五蕴不是我也不是我所，不是我的我当然也是指意识意根了，不是指第八识。</p><p>五蕴和六七识的我具有毁坏性坏败性，是生灭变异的，因此五蕴和六七识不是我，是无我的；第八识不是毁坏的，不是坏败的，是常住不灭的，方便说为我，但没有我性，没有七识那种作主的我性，因此第八识也是无我的。那么观行五蕴无我，就是要观行五蕴和六七识的毁坏性、坏败性、生灭变异性，确认之后就断除了六七识把五蕴当作我的我见和我所见。如果把无我的我当作第八识，那就是偷换概念，结果无法断我见。</p><p>意根无始劫以来一直把五蕴当作真实的我，而加以执著，意识受意根熏染，也同样把五蕴当作真实的我和我所。为什么这个我指意识意根，不是指第八识呢？因为无始劫以来，众生不知道有第八识这个理体，不可能把五蕴当作第八识来对待，心里没有五蕴就是第八识这样的我见，所以断我见就不是观行五蕴不是第八识。如果众生能把五蕴当作第八识，就会空了五蕴，不会执著五蕴，就没有我见和我执，也就没有六道轮回了，这是诸佛菩萨所乐见的。</p><p>如果是这样，诸佛也不必到娑婆世界传法度迷津了。因此观行五蕴无我的结果，不是证得五蕴不是第八识，六七识不是第八识，而是证得五蕴全体都是败坏的，都是生灭变异的，没有一个所谓的叫作我的东西存在，这样就不会再去执著五蕴，我执慢慢就融化了。</p><p>五、人无我的真实义</p><p>人无我是小乘圣贤人和大乘圣贤人的见地，他们在不同程度、不同角度上证得了五阴非我，完全证得五阴无我的是四果阿罗汉和辟支佛，以及八地以上的大菩萨。与人无我相对的是人有我，认为五阴身这个人有我性，是我是我所有，这是凡夫众生的不正知见，这样的邪见能感召六道生死轮回苦。</p><p>如果众生把五阴身当作五阴身，认为五阴身是实有的，是我和我所有的，就是无明的生死邪见；如果众生不把五阴身当作五阴身，而当作是第八识出生的，是第八识的功能作用，本质就是第八识，那么这个众生就破除了五阴是我的我见，证得了五阴非我，五阴没有真实的属性，都是第八识的属性，这是大乘菩萨的见地，这样六道轮回生死业就会逐渐了毕，能解脱出三界轮回，但菩萨们都不会出三界。</p><p>断了我见的菩萨是证得了人无我，不把人当作人，不把色阴当作色阴，不把受阴当作受阴，不把想阴当作想阴，不把行阴当作行阴，不把六根当作六根，不把六尘当作六尘，不把六识当作六识，而是全部都当作是第八识的属性，当作第八识的功能作用。五阴十八界恰恰就是第八识，那么五阴非我就不是指五阴非第八识。</p><p>所以人无我的真实义，不是指人非是第八识，而是人没有人的属性，人不是人这个我，人的属性不成立，人的功能性不真实，人的功能性是无常的生灭的变异的，也是第八识赋予的。这样断我见以后，不再认五阴身是我有我，不再认为五阴身属于我所有，心里就没有所谓的我了。众生都是因为认五阴为我才有我执，才有生死轮回苦；如果众生都认五阴是第八识，就会证得无我，心里不再有我了。心里没有我以后，慢慢对我的执著就会减轻，以至于最后断尽我执，没有执就没有生死，就会脱离轮回苦。</p><p>六、五蕴非第八识不是小乘观行的结论</p><p>既然众生无始劫以来并不知道有个不生不灭的第八识常住五蕴身中，众生就没有五蕴就是第八识的我见，观行五蕴断我见时，就不用把五蕴与第八识对比，说五蕴是无常的，而第八识是常住的，五蕴是生灭的，而第八识是不生灭的，因此就推论说五蕴非第八识，因此推论就断除了五蕴是第八识我的我见。这样的对比和推论根本没有必要，如果没有前提，就没有后边的结论。</p><p>即使有前提，众生都把五蕴当作第八识，这也不是我见，恰恰是没有我见的，是无我的认知。在大乘参禅破参证得第八识的时候，参禅的菩萨就知道了五蕴是第八识所生，是第八识的一部分，恰恰就是第八识。而菩萨在入初地以后，逐渐观察出一切法都是真如第八识，那么五蕴更是第八识，全体即真如第八识，是一真法界中的法。如果众生无始劫以来有个我见，把五蕴当作第八识我，那么众生无始劫以来一直是地上菩萨，具有唯识种智，不可能有六道生死轮回。</p><p>况且，佛在讲阿含经的时候，首先告诉弟子，五蕴身中有常住法，不生不灭，是众生五蕴所依。弟子们在听佛如此说以后，就信受佛所说，知道有常住的第八识不灭，而五蕴是生灭无常的，五蕴根本不是常住的第八识，所以才需要修定观行思惟五蕴的无常苦空无我，确认五蕴是可毁坏的，六七识是可毁坏的，没有一个我和我所。所以观行断我见的结论不是五蕴非第八识我，而是五蕴是无常的坏败的苦的，不是我也不是我所。</p><p>七、五阴为何无我和我所</p><p>因为五阴十八界是生生灭灭的，是幻化的假相，自身没有主宰性，所以不是我。比如说一堆木头、泥土、水按照一个法则混合在一起，形成了房屋，这个房屋是生灭幻化的假相，没有自主性，说散坏就散坏，不能当作能自主的实有之法，而去执取为房屋。</p><p>同理，五阴这个所谓的我，也是用七大种子和合起来组成的，也是生生灭灭不实的法，没有自主性，没有自我主宰性，不能当作我，也不能当作我所。所以五阴不是我和我所，没有我和我所，没有必要去贪执，去执取，不要把用各种零件组装起来的法当作可以依赖依靠的我。那么不依赖依靠和合组成的法之后，会怎么样？不再执取五阴十八界，这样还有什么？如果心中有这个想法，想着还有什么，我见就没有断尽，还有执取，还有所求，那就还有生死，还有苦。</p><p>如果断我见之中的我弄不明白，就无法真正断我见。如果得出一个五阴非第八识，不是第八识，也不异第八识，这样的结论出来，那就没有断我见，也没有对五阴十八界进行如实如理的观行，心中还有五阴十八界这样的我存在，没有废除五阴十八界我，只是意识认为五阴十八界不是第八识而已。空，这个含义相当重要，观行到最后，就知道五阴十八界是空的。什么是空？追根究底空的就是无我的，如果有不空就有我了，谁能把空的法当作我？除非没有观行到五阴空的人。</p><p>八、把身体当作我的我是指谁</p><p>身不是我，也不是我所，我寄居在这个身体里，一旦身体消失了，就不得不再去寻找另外的身体寄居。这里的我是指谁？谁把身体当作我和我所，这个我就指谁。首先如来藏肯定不会把身体当作我和我所，祂不想利用身体做什么和不做什么，在世间法的运行上是无心的，所以这个我就不是指如来藏。</p><p>无始劫以来把身体当作我的是第七识意根，无始劫一直不断地执取身体为我的是第七识意根，所以这个我最主要的就是指七识。五蕴中五识心思非常粗，几乎没有我的观念和见解，意识有我的思想观念，但是投胎时寻找身体寄居，意识却使不上力，意识寄居在身体上又不是连续不断的，对身体又不能作主，不能负主要责任，所以这个我主要是指意根。有所住持有所利用，是意根最关注和执著的事情，投胎受生拥有色身是意根最在意和执著的事情，五蕴的功能作用是意根最想把捉的，所以意根的我见根深蒂固，最执拗。一旦意根认为色身五蕴不是我和我所了，对色身五蕴的执拗就会逐渐断尽，逐渐解脱五蕴世间的一切苦受。</p><p>因为汉语的词汇不够丰富，佛法和世俗的用词无法分开，很多法义无法准确的表达出来，导致误解很多。比如真这个词，世俗法和佛法都用一个，世俗法的真是什么意思，佛法里的真是什么意思，一般人根本无法区分，往往就会混淆不清，尤其是学过大乘如来藏法的人，只要提到真，就以为是如来藏这种真心和真实性。世俗法里人们之间也有真心这个词汇，也用真实这个词汇，但与如来藏都扯不上关系。比如甲问乙，你是不是真心想这么做？你是不是真心愿意？你的真实想法是什么？这件事真实吗？这个东西是真的吗？每一句话都与如来藏扯不上关系。可是学如来藏法这部分人，却把什么都安在如来藏头上，如来藏又没有头，怎么能安得上？</p><p>世俗法里有个我，佛法里也有个我，两个我的含义差别极大，可是学完如来藏就懵了，分不清是哪个我了，只要遇见我字就认为指如来藏，难道断我见就是断如来藏见？五蕴是我，难道是说五蕴是如来藏？五蕴非我就一定是说五蕴非如来藏？</p><p>九、断我见的观行内容与结果</p><p>断我见的这个我，是指意根的俱生我见和意识的分别我见，不是断除如来藏的我见。如来藏没有我见，不用断除。只要让意识意根观行五蕴十八界这部分法是苦空无常的，才能让意根和意识确认五蕴十八界不是我和我所，而不是让如来藏确认五蕴十八界不是我和我所。无我不是否认如来藏我的存在，而是否认五蕴十八界的真实存在。</p><p>正因为五蕴十八界在世俗界不是真实存在的不变的法，所以就让意识意根确认五蕴十八界是无我的，不要再认五蕴十八界是我和我所了。观行结果不是让意识意根确认如来藏无我或者是有个如来藏我，也不是让如来藏确认自己是无我的。在观行之前可以承认有个如来藏我的存在，但是观行的结果就不要落在如来藏上了，因为是观行五蕴十八界，不是观行如来藏，观行内容不能错乱，否则结果就错乱了，导致不能如实的断我见。</p><p>十、色受想行识的真实相是什么？</p><p>色受想行识的真实相是无常的、变易的、不安稳的、空的、苦的，非我，不异我，不相在。既然是无我的，怎么能说我是殊胜的，我是低劣的，我不差于他人？不是我、没有我的两个法多个法，空的两个法多个法，苦的两个法多个法，不真实的两个法多个法，如何能够比较呢？如何说哪个高哪个低？或者是平等的？空的法不实在的法，如何拿来比较？如何比较兔子的角长与短？如何比较乌龟的毛漂亮与不漂亮？如何说我比你强，你比我弱？如何说我与你一样健康富有？世人无明颠倒，早已经习惯成自然了，不知道所说毫无实义，都是笑谈。包括语言和声音，都是虚无缥缈的。</p><p>两个人对骂，实质上骂到谁了吗?骂到色阴上了，还是骂到受阴上了，还是骂到想阴上了，还是骂到行阴上了，还是骂到识阴上了？骂人的声音，落到了哪里去了？被骂者感觉不舒服，是什么感觉不舒服？哪个法感觉不舒服？什么叫作不舒服？有舒服和不舒服这样的法存在吗？骂人的人感觉舒服解气，是什么感觉解气？有解气这样的法吗？</p><p>在甚深的禅定中思惟观行这些法，到一定时候，内心就会把这些法空去，身心就会脱落。这也是一种感觉，也是不真实的，但是却是解脱的。如果没有禅定，即使理解了这些法，不管写出多少本书，仍然都是空谈，没有实质益处。</p><p>十一、五蕴虚妄的含义</p><p>什么是虚妄？虚妄就是假的不真实的意思，也是空的意思，没有其事其理的意思。比如说大家都传说某某当上了国王，可是实际上并没有其事，某某并没有当上国王，这是一个虚假的传说，某某当上国王这个事情是虚假的，是虚妄的，是空的，是不真实的。众生知道了这不是一个真实的事情之后，也就不再传说，不拿其当回事了，心里释然了，心就空了。                         </p><p>同理，众生无始劫以来都把五蕴当作真实的实有的，当作我，当作我所有的，通过观行最后确认五蕴不是真实的，是虚妄的，是空的，是无我的，也不是我所有的，于是就不把五蕴当作是自己，心空了，释然了，解脱了，渐渐放下了，不执著了，不再为了五蕴这个假我空我而造作业行，苦就消失了。</p><p>但是假我虚妄的我，在世俗相上是存在的，只是没有其实，本质上是空的，证得法眼净的人今后还要用这个虚妄的五蕴来修行和生活，内心的思想观念却变了，导致烦恼轻微甚至断尽，六道轮回的业种消除了，有能力出离生死苦，这就是小乘定慧等持三昧的功德。</p><p>十二、我性的相貌</p><p>世界上哪个地区的众生我见最重，我执最强？强调自我的众生我见最重我执最大。佛法起源于印度，后传入中国震旦，西天印度佛法遂逐渐衰落，中国震旦佛法却越来越兴盛。达摩祖师在西天观看震旦有大乘气象，于是冒生命之危从西天印度飞身来到中国，传法度迷情，大乘佛法得以广传，大乘人才汩汩而出。遂有禅宗六祖出世，加之西天祖师二十八祖住世，大乘佛法稳如泰山。</p><p>佛法为什么不传入西方等国家，而偏偏要传入中国震旦？源于国家地区的文化底蕴、人文素养之不同，中国有儒家道家等等文化底蕴，中庸之道，显人性之根本，具人性才能有菩萨性和佛性，人性不具，菩萨性更不具。从目前全球肺炎疫情来看，这么严重的传染疾病，那些国家地区的民众还要自由，还要人权，只要自己畅快，完全不顾他人生命安危，这就是自私的我见我执。那些人所要的自由，代表着什么？他们所主张的人权代表着什么？完全是我，是我见，是我执。</p><p>即使那样所谓的自由，不损害他人的利益，那种自由也完全代表我性，强调的是我。所谓的人权，也都是要彰显自我的权利，凸显自我，都是我性。要独立，有自主，要平等，要自由，要权利，要地位，这些要求都起源于一个根深蒂固的我，强调自我存在感，追求释放自我，不要压抑那个我。这样深重的我性，不会感招到大乘佛法，众生得度的因缘不成熟。</p><p>同理，单个一个个体，如果我性很强，贪嗔嫉妒，自我主张很强烈，得度因缘也不成熟。即使遇到佛法，此生此世也不会断除我见，得到度脱。学佛之人时刻保持警觉之心，常常关注自己的心行心性，发现自我意识冒头，就要用佛法理论思惟开导自己，疏导自己，不要让自我泛滥，最后成灾不可收拾。要细细的了解我性的表现形式，我性的样貌，我性的特点，我性容易出现的环境，然后适时抓住那个我，观照它，理顺它，说服它，教育它，劝导它，降伏它，直至最后断除它，那么你就是个顶天立地的好汉，居于世间之顶，人中之雄。这样岂不快哉！</p><p>十三、能发现自我才能断我见</p><p>要想断我见，首先要知道所谓的我都是指什么，与自身所有的功能属性对号入座，能找出每一种身心活动中显示出来的我是哪个，每一次每个当下身心活动中显示出来的我是哪个，每一法当中的身心活动显示出来的我是哪个。能够找出这么多的我，已经非常不容易了，其智慧和观察力相当了不得，时时处处能把贼人抓住，预示着自己以后再也不会被偷了，再也不会丢失家宝了，真是可喜可贺，不管贼人是否受到了惩罚，能抓住就算成功一半或者是一大半。</p><p>十四、为什么排除异己是凡人的凡夫性特征？</p><p>有排除异己行为的人，即是烦恼具足的凡夫人。因为这样的人心里有我，有他，有四相，有事理，心一点不空，全部是我性，这样人不好修行。再采取点不合理的手段，或者是不择手段，总想把他人踩在脚底下，那这个人烦恼结重，不是一般的凡夫，无法断我见证果。</p><p>排除异己属于身口意行为，是不当的身口意行，断我见之人不会再这样做了，因为初步无我了，心与无我相应，不再造作粗重的恶业行了。所以判断一个人是否证果，是否有道，还是要从七识的身口意行上来判断，越具体越好，除此没有其它判断的准则。不能从第八识的心行上来判断七识的果证和修为，也不能只从口说上来判断，行为最能体现一个人的证量和修养，口上造假最容易，用虚言假言掩人耳目的事情数不尽。虽然有时身行上也能造假，但是太有限，无法坚持下去。</p><p>凡夫性还表现在欲望上，有的人学佛，越学欲望越大，想要尽快证果明心，用什么手段都行，要什么果都行，假果也无所谓，只要有证果明心的名声就行。取得名声以后，直接成为人上人，一切利益都会得到，欲望大得很。什么渠道得果都无所谓，想尽办法得果，这是很奇怪的一个想法。有这个想法正是最强大最坚固的一个我，怎么还能有希望断我见证果？把佛法当成获取世俗名利的工具，利欲熏心，被利所蒙蔽，难以走出黑暗和轮回。总之，众生的凡夫性说之不尽，令人扼腕叹息，这样的不觉悟，轮回也在情理之中，可怜之人必有可恨之处。</p><p>十五、如何判断一个人是否有我无我？</p><p>判断一个人有我还是无我，不能简单的根据他与人说话的语言中是否带我字来判断，因为佛与人说话和讲法中也用我这个字，我字绕不过去，否则没有表达思想的主体，就没办法把自己的思想观念表达清楚。佛说话也说我如何如何，可是佛心无我，有些人说话虽然不带我字，可是话里行间都是我，我味很重。要观察分析他的文字语言里，那个我字是客观的名词概念，还是含有很实在真实的我，因为心里有我，以至于有所执和念，极其护佑，或者充满骄傲自豪自卑等等主观情感。</p><p>依义不依语，品味每个人语言真实的含义，真实的指向，才能判断出来这个人心中有没有我，我味的轻和重。判断一个人是否断我见，不要从他语言叙述的表面意思来判断，他指给你的东西未必真实，要仔细辨别话音、语味，看他所做，与说是否一致，还是牵强。这可以伪装，但伪装长久不了，总有露馅的时候。</p><p>十六、我见我执的种种表现</p><p>如果一个人一心要做自己，一定要与众不同，特立独行，不听一切人事摆布和安排，不愿意顺从任何人事，那么这个人是断我见无我的人，还是我执特别重的人？心中有我的人，就会着重于自我的感受感觉，在意于自己的特权和属性，在意于自己的独特性，而不愿意把自己融合于大众之中，不愿意隐藏和消灭自我，心中坚固执我，不肯舍弃。不愿意随顺任何人的要求，不愿意被管理被安排，不服从领导，又不能自律的人，就是我见非常重的人，即使能自律，也是我见重的人。</p><p>我执断尽的大阿罗汉大目键连，在证果以后，内心完全没有自我的存在感，完全随顺于众生心，众生希望他怎样他就怎样，不希望他怎样就不怎样，哪管众生都是蛮横无理的要求，他也是没有任何怨言的服从，从不违逆。断我见之后就是无我之人，内心里没有自我，也没有人、众生和寿者相。而一心想要做自己的人，是不是与此背道而驰呢？绝对是背道而驰的，没有我，还做什么我？这是在增加我见和我执，因此我见我执生死流转无尽，任性之人必吃苦。</p><p>一个非常强调自我存在感的人，不愿意服从众生任何一点意愿的人，是个强烈的自我主义者。一个从来都不服软，不让步的人，我性非常强；一个看一切都不如自己，并且对人言辞犀利的人，都是执我非常严重的人，我执重的人很难断我见。如果一个人总是我对你错，是非分明，不懂得让步和随顺，表现不厚道不宽宏，就是我见我执非常严重的人，没有菩萨那种随顺众生的心性。</p><p>如果一个人活着只在意自己的感受，注重自己的感受，追求内心舒服，狂放不羁，不管周围人事如何，不管世界如何，不受任何约束，这个人就是我见我执非常重的人，而且是极重极重之人，这世想断我见是非常困难的。</p><p>每个人都要常常回头反观自己，内心总要自省自察。要做到自省自察，就要多关注自己的内心世界。每一个心念，都要反观和检查，发现与道不相应的心念，赶快扭转和熄灭，不能任其泛滥，这就是修行。真正的菩萨，既不随俗，也不违俗。这中间的分寸如何拿捏，就看菩萨的修为和智慧善巧了。一般的菩萨都没有如此善巧方便的处世智慧，处世就有一些障碍。</p><p>十七、我见断尽的境界</p><p>如果把如来藏当作真实的我，我见就没有断尽，这仍然是一种我见。因为法界当中根本没有七识的我，既然没有我，怎么能有如来藏是真我呢？没有根本的七识自体性，也就没有任何我性。如果确立了一个知见：如来藏是真我，同时就确立了一个七识我，有个七识我，才会把如来藏当作真实的我，没有七识就不会把任何法当作我。因此只要见法就是妄见，没有妄见时，必成佛。修到禅宗第三关的时候，如果心里还执个如来藏我，就不能过禅宗第三关，不能证得有余涅槃，不能脱离生死。</p><p>观世音菩萨的耳根圆通法门，修到最后，能舍的全部都舍了，能空的全部都空了，连个舍也舍了，连空也空了。能舍所舍，能空所空，以及空空，全部空掉，再也没有可空的了，只剩下孤零零的如来藏，舍不掉，不可舍，空不掉，不可空，也没有去舍的人，没有去空祂的人了，那么就到家了，成就三十二应身，名为大慈大悲观世音菩萨。</p><p>十八、执著果位和证果也是我见的表现</p><p>现在看外面开悟证果的人成百上千的，圣人都快把街道挤满了，可那么多圣人在心性烦恼方面，悟后和悟之前根本没有什么差别，什么思想境界、三昧境界也没有，身口意上一如既往，甚至比从前还要染污，慢心比从前还要重，怎么能证明那些人是不是真正的证果和明心呢？根本证明不了，三十七道品都没有修，戒定慧完全不具足，好多人仅仅处于一种意识的理解层次，是对知识层面的领悟和掌握，更多的甚至连理论知识都不具备不完善，连意识境界都相应不了达不到，更不要说意根了。</p><p>所以现在市面上大妄语的简直太多太多了，为什么要大妄语呢？我见重、执我为是的人才会大妄语；我见轻微的人，会非常谨慎、非常小心、非常实事求是的，会到处求证，自己的修行状态到底是不是证，他不会盲目地抬高自己，说我如何如何。我见重的人如果认为自己证果了，你告诉他那不是证果，他马上就会急眼。为什么会急眼呢？因为他非常执着证果这件事，非常执着我是圣人这件事，非常执着自己与众不同，非常执著果位和身份，对于自己的果位身份非常在意。</p><p>这种执着就代表他心中还有那个我，和从前一样，或者比从前还重。如果你告诉他说，意识证果不是真证果，情思意解和推理猜测都不算证果，必须意根证果，他为了维护自己的果位和名誉，就会种种反对、驳斥和攻击，完全不思考不反思，完全不顾事实，更不会反省。因为他心中有一个我，那个证果的我，不一般的我，与众不同的我，高高在上的我，把这样的我当作实有的，就会特别维护，也把果当作自己实有的，特别维护，这说明这个人我见全部存在着，根本没有证果。真正断了我见，智慧逐渐增长以后，就有能力判断出各种心行的人心里有没有我，是不是一个断了我见的人，有什么程度的我见，是不是很严重。</p><p>十九、什么是能所双亡？</p><p>能所双亡，能是指七识心，所是指七识心认知的法，亡是灭的意思。七识心不再把七识当作真实的有主宰性的我，也不把七识认知的法当作七识所拥有的，认可能所的虚妄不实性，就是能所双亡。</p><p>证得心空，不是身体空了和六尘境界没有了，而是正确的认知了身体是空的，五蕴是空的，六尘境界是空的，心的观念改变了，不再认为五蕴色身是真实的我，有我性。身体空了没有了是禅定境界，六尘境界没有了是禅定境界，禅定境界是生灭变异的，禅定消失以后，身体和境界还会出现的。</p></div>"
},{
    "title": "第二章 如何实证无我",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  如何实证无我</strong></p><p>一、什么叫作亲证实证？</p><p>圆觉经原文：善男子。云何我相。谓诸众生心所证者。善男子。譬如有人。百骸调适。忽忘我身。四肢弦缓。摄养乖方。微加针艾。则知有我。是故证取。方现我体。</p><p>释：佛说：善男子，什么是我相？我相就是一切众生心所证验到的。善男子。譬如有人全身上下都很调和舒适，忽然就忘记了有我身体的存在了，四肢都很放松，身心寂静极寂静，不知道身体所处的方位。这时候轻轻地用针扎一下身体，心里就知道有我了，因此就证取到了我，我的观念就生出来了。</p><p>这是亡身的境界，以及亡身之后对我的证知，证知身体的同时，也就证知了我，身体是我，觉知是我，五蕴是我，证验有我之后，我见就出现了。这里涉及到身体气脉的事了，说明气脉与心空与断我见之间是有一定联系的，气脉通达之后，身体就没有明显的觉知了，这时候才能心空，从而亡身。亡身之后，再有觉知，就会现前实实在在地证验了身体、觉知和我的存在。</p><p>众生心所证验的我相是什么样的？心所体悟到的，亲身体验到的，亲身感觉到的，现前观察到的、现量感知到的身体、觉知和五蕴。因为觉得能真实地体验和感知，所以就确信不疑这个身体就是我，能觉知的就是我，有能有所，于是我相就出现了。</p><p>佛举个例子说明众生心中的我相是什么。当有人全身上下、里里外外全部都非常舒适、极其舒适的时候，身体气脉都通畅地运行，一丝阻碍也没有，这时候就不再感知到身体，就忘记有身体这回事了，也就是说能觉与所觉都不存在了。这时候四肢非常的放松，没有加一点意念，没有特意收紧和活动，心就不再注意四肢，忘记了有四肢这回事，也不知道自己现在所处的境地，不知道自己现在的状况，不知道处于哪个方位，不知道自己是躺着还是坐着，也不知道自己的四肢和躯干是什么姿势和姿态。这叫作亡身忘身。亡身和忘身，当然是心中没有所觉的身，也没有能觉身的觉，能所俱空。</p><p>在心里忘记有色身我的时候，也没有明显的觉知的时候，有人稍微地、轻轻地用针扎一下他的身体，这个人马上就有感知了，就知道有我了，色蕴和受蕴的我相就出来了。这个方便说为实证有我的我相，实证有我。实证无我也是同样要这样亲身经历，亲自证知，不是用思惟的方式知道的，不是用推理、猜测、分析、想象等等意识功能作用解出来的，就如真实感知到有身体是一样的，应该有实际地真实地现量地证得无我。什么叫作实证，大家现在是不是应该很清楚了？按照这个标准来衡量，这个世界有几人能实证无我？好好体会一下自己心中是怎样实证有我的，然后以此方式再来实证无我，二者原理是一样的，没有区别。</p><p>二、什么叫作脑补？</p><p>由丰富的想象力想象出来的，不是靠实践得出的结论都叫作脑补。脑补实质是误会一场，并无其事。就如不少人的证果和开悟，都是脑补出来，不是修出来的，是想象力丰富的结果。</p><p>哪天把意识打个半瘫痪的时候，修行才上道，也才能有点眉目。聪明的意识恰恰是障道的因缘，人不那么聪明的时候，道才容易出现。修道是傻子干的事情，聪明人不修道，而是想道，想出来的道就是梦幻泡影，什么用也没有。想道容易，修道难，所以大多数人走捷径，都用想的方法，不用修的方法。</p><p>三、解门与行门的区别</p><p>解，顾名思义就是理解，是从理上入手，加以思惟消化，包括想象、推理、整理、归纳、臆测等等，也可以说是实证前的准备工作，如果准备工作作过了头，影响和阻碍观行功夫的深入，就很难实证亲证。总而言之，解门是从理入门，是对理的消化和消融，这是学佛修行最容易最省力的下手方法，初学者都停留在这个阶段而过不去。</p><p>行，顾名思义是行动，是在对理的理解掌握之后，想要实证所采取的行动，比如修定、观行、参究、寻伺等等。行门涉及到具体的行动，只有行动才能达成目标，而解还没有付诸实践，没有行动力，达不成目标。实施步骤包括持戒、修定、断恶修善、降伏烦恼、忏悔业障、去除遮障，然后在定中参禅、参究、体悟、观行等等多种实践方法，这是实证亲证佛法所必须经过的一个实践过程，所谓实践出真知就是这个道理，没有这个过程，就出不来真知，即使知道什么也不是真知。</p><p>很多人对解与行不甚了了，区分不清，往往把解门当成是究竟的行门，和最终的入道处，自塞悟门，很是可惜。解比如想象，行比如观，观和想象区别很大，想象是完全无中生有地添加出境界，相当于世俗说的脑补，并没有境界自动现前，更不会出现三昧境界，即使想象脑补得完全准确无误，也不等于观到了；而观是功夫到了的时候，境界自然现前，自动自觉地呈现，然后如实地见到了境界，境界是怎样就见到怎样，没有多添加什么内容，而且连带着会出现三昧境界。</p><p>未悟言悟的，基本上都是以下这种情况，把想象出来的法当作是观到的实证的法，误会很严重。现量观察和想象的区别，大概百分之百的人不能分清楚，所以，几乎是所有自认为悟他认为悟的，差不多百分之百是想象的成分多，并不是现量观察到的，因为观行功夫严重不足。我之所以没有说所有的悟百分之百是假悟，是因为说话要留有余地，也是口下留情，不想伤人，更不想得罪人，导致得人人生恨。</p><p>实证和亲证之后，才能解行相应，自己所解的得到了证实，自己所证的与所解相附，证实之后疑情断，结缚断，粗烦恼断，身口意行与理相应相附，事理初步圆融，不相背离，所说在理，所做合理，心口一同，身心一致，不存在说与做矛盾，身口意行与理背道而驰的现象，解行不相应时才如此，那就说明没有实证。</p><p>四、我见变薄才能断除</p><p>每个众生的我见我执的轻重差别是很大的，当然是我见我执轻微的人容易断我见，我见我执重的通过修行，转变轻微以后，才有希望断我见。就像坚冰要想一下子融化成水，必须坚冰越来越薄，越来越不坚固，最后才能瞬间融化。学佛修行实际上是先把我见我执转淡，业障逐渐减少，遮障越来越轻，这就是修行的功德。以此为基础，后世才可以很快速的断我见。</p><p>修行是个渐进的过程，不可能一下子到达目标，只要不断的进步就可喜可贺了。基础薄弱的人，可以把目标定得低点，要符合自己的实际情况，这样修行就有奔头了，不必都把目标定为明心见性，达不到就心情沮丧泄气，不想修行了。意根的我见坚冰要逐渐的淡和薄，这中间就是修行。</p><p>五、观行和想象有什么区别？</p><p>甲：观行是真实的在看，在观，六根集中在一件事上都在参与，意根如果不走神是可以全程参与，观行所得是意根认可的。想象是五根不参与，只有意识自己凭空想出来，意根无法参与，也不会认可。</p><p>乙：观行的对象是基于客观存在的事物进行的。想像属于主观臆想。</p><p>丙：观行是以意根为主的心理活动，观行过程中，意识进行必要的引导，让意根对所缘对象做现量如实的观察。而想象是以意识心为主的心理活动，主要是意识对独影法尘的非量了别，不容易对意根产生实质性影响。</p><p>丁：想象是独头意识运作，意根也参与的，意根默容一切法，所以也是了别了的。想象属于独影境，是非现量的了别。观行则是意识与意根所缘的都是性境，属带质境，属现量了别，易熏梁意根，让意根证法。观行是让意识和意根都作现量了别。持续的现量了别（其间也有其它根参与）就需要定力，意根定了，然后才能实证。</p><p>戊：首先观行时一定要具备一定的定力，没有定力支撑的观行就会落入想象当中；其次由于观行是在有定力的情况下进行的，意根必定所缘其他法很少，能集中精力在意识引导的法尘上，也就是对所观的法尘感兴趣，而想象过程意根也参与，但意根不会全身心参与，它会缘其他的法；第三观行是由意识引导，逐渐变为意根主导、了别所关注的尘境，所对的法都是现量境界，而意识的想象是非量的了别，只有现量境界才更符合客观实际，才能让意根确信。总之只有意根真正关注和参与，才能发挥意根巨大的潜力，才能彻底改变知见，做出正确的选择。</p><p>想象容易还是观行容易？哪个更轻松？</p><p>甲：想象容易得多，妄想不请自来。</p><p>乙：是知不少人自欺欺人，没有禅定也说自己能观行能证果，把想象当作观行却不自知。明白修行原理，就知道极大多数时间都是靠自力修行，没必要整天流连于种种理论书海中，以汲取他人的见解或者是见地，数他人宝，自己毕竟不得半钱分。</p><p>六、未满足三十七道品的条件不能证果明心</p><p>前世从来没有断过我见的人，或者是断我见次数不多的人，初次断我见证初果非常不容易，断我见的必要条件三十七道品不容易修。现在每天都在修定的人都知道，禅定不容易修，如理观行更不容易，能有观行成果，法眼净证得空三昧，就更更不容易了。而前世断过我见的人，今世就属于特殊身份的人，而娑婆世界并没有几个这样特殊身份的人，可以说凤毛麟角。</p><p>有些人总觉得自己很特殊，学个三五年就开悟了，但是不断我见不能开悟，开悟比断我见更是难上难。所以不要动不动就认为自己开悟了明心了，已经是什么什么菩萨了，对外宣传自己开悟果报很不好。现在是个特殊时期，有一些特殊现象出现，却给地藏王菩萨带来很大麻烦，这代人命终以后，地藏王菩萨就会忙起来了。当菩萨太不容易了，地狱不空，誓不成佛，明明具足了佛的功德福德，却不取佛位，菩萨就是这样的心空无我。</p><p>为了不给地藏王菩萨添麻烦，现在都应该听从本师释迦佛的教导，按照佛所讲的修行次第和标准来修行，严格检查自己的三十七道品达到何等程度，如果其中有任何一条未满足，就不要觉得自己证果了明心了等等。最基本的三十七道品未修满足，就不会脱胎换骨，跳不了龙门，成不了圣。</p><p>七、如何判断是否断我见</p><p>如果小乘三十七道品没有满足就不能断我见，禅定不足，无法现前观行，只能推理想象；喜觉分、猗觉分、定觉分、舍觉分不具足，或者根本没有出现，离断我见还很远；如果四正勤断恶修善还没有修，恶还继续善还没有生起，烦恼没有减轻，心没有改变，就不能断我见；如果八正道还没有完全具足，身口意行还有不正之处，也无法断我见，如果还贪恋世间法，出离心不强，同样无法断我见；如果心中还有我相，时时处处以我为主为中心，还有人相、众生相、寿者相，四相宛然，那就没有断我见。</p><p>在修三十七道品的过程中，随着身心不断的改变，种种吉祥梦境，都在昭示烦恼在逐渐的脱落，业障逐渐的消除，心逐渐的清净，身逐渐的无障碍，禅定逐渐的加深，世俗法逐渐的远离。断我见时，法眼清净，见五蕴都空无我，有定慧等持的三昧境界出现，身心皆清净处于三昧之中，身心觉受非常。如今众生的根基都比较浅薄，这样的三昧非常不容易证得，戒定慧也不容易修满足，所以断我见非常困难。目前来看，很多自认为断我见明心的人，都没有这些现象出现，那就不是实证了。</p><p>断我见和明心的时候，已经脱胎换骨，鲤鱼跳龙门了，如果粗重烦恼没有消除，心不清净，骨头就还是原来那个，胎就不会改变。如果降低种种见道的条件，三十七道品菩萨六度都不具足不圆满，那就是爬着过龙门的，本质还是鲤鱼，没有变成龙。在证果和明心这个佛法修证最关键之处，如果很随意，不严谨，在临终的时候种种恶相就会现前，恶道就不可避免了，死后发现自己处于阴森恐怖之处，就悔之晚矣了。</p><p>八、不能断我见之因</p><p>修行是先把色身五蕴的功能作用否定了破除了，之后才有可能证得五蕴背后的真人。色身是怎样的不实无主性呢？色身是由四大组成，受四大控制和摆布，你想摆布四大，还真不容易，需要大费一番周折，还不一定能摆布得了。比如夏天天热得通体汗流，有的人还会出湿疹子，这是火大水大地大不调，然后开空调透透风，身体却会着凉不舒服，这是风大不调，四大不调的色身真恼人。只要有色身，四大永远都要摆布你，佛陀说四大如四毒蛇，很难侍候，稍一不注意，毒蛇就要侵害你。这样的色身丝毫没有自主性，能是真人吗？能是我吗？</p><p>生生世世不灭的那个我，应该是自由自在，有自主性的，应该是百毒不侵的，应该是能主宰一切而不被一切所主宰的，谁有智者认这样的色身为我为我所？趁早在自己的心里灭除去，否定它，然后去找新主人来皈依。这样明显明确的理，自己内心还无法确认，那就说明修行还有所欠缺。究竟欠缺什么呢？福德、智慧、禅定、戒律等等，能完善的尽快一一去完善，不要再懒惰一再拖延了。</p><p>当色身非我五蕴无我之理已经很明确的时候，自己本应该勇敢的承担下来，无始劫以来的对于自我的观念，应该更新改换，旧去新来，焕然一新。可是这个我的观念就好像卡死了，说什么也动不了，再前进一小步都很困难。这就是障，犹如一座山横档在面前，越不过去。要推倒这座山需要自力和他力众力和合。自力包括戒力、定力、慧力、福德力、善业力；他力，一个是佛菩萨护法神的加持力，一个是同参道友的推动力，一个是其他善缘之力。以自力为主，他力为辅，只有自力具足，他力才能有所能为。</p><p>比如一个人推车行在上坡路，突遇前方一块大石挡在车前，自己无力前行越过大石，无论如何用劲，就是推不动车。这时候就需要众力和合了，自力在于自己的体能、毅力、巧力、决策力等等；他力就是，由于自己从前所结的善缘，种下的善业，正好遇见有人路过，此人与你有缘，愿意来帮助你一起推车，如果两个人推不动，正好又遇见另一个人路过，那个人也愿意伸手相助，和三人之力就顺利越过了大石，继续前行。</p><p>如果往昔你没有结善缘帮助过他人，没有种下福德和善业种子，那么在你遇到阻力的时候，就会孤立无援，没有什么外力他力来帮助你。也许你都不会遇到有人路过你身边，没有人知道你遇到了困难。即使有人路过，由于无缘无福，也没有人愿意出手相救。</p><p>学佛路上修福结善缘是非常重要的，因为成佛之道需要极多的助道者，单独一人之力不能为之，孤立无援怎么能渡过三大阿僧祇劫的修行时劫？为人举手之劳都不肯，福德不集，善缘不结，种子不种，凭一己之力，遇到任何阻碍都无法越过，徒感叹和伤悲。自己不助人，如何有天助？</p><p>十、有所得之心能得解脱果吗？</p><p>总有人对我说：师父，我想证果，我想明心见性，我想达到七住位，我该怎么修？这样说话的人，只对果感兴趣，不对过程感兴趣，只想有知见，不想改变自己脱胎换骨，内心其实是重于果，不重于修证和解脱的，这样的话，任何外力都不能有益于他。世间有利益之处，众人趋之若鹜，佛教里有利益之处，众人同样趋之若鹜。</p><p>为什么众生会投奔利益之处？有我，有我所，有法，有执取，因此就会有所求。以有我之心，有所求之心，求取佛法上的利益，有利益可得吗？无我无所求才有果，有我有所求何来的果？认为有果可得，看到了佛法当中果的利益，于是就直奔利益之处，准备夺取。这样的话，能得到什么果证吗？为什么如今漫天飞舞着众多假果？以有所得之心夺得了假果，如何能不堕入三恶道？心中的果不空，利益不空，名利不空，能断我见吗？不断我见，能得果吗？</p><p>无我无人无众生无寿者，才能断我见证果，以有所得之心得假果之人，增益我见我执，我相人相众生相寿者相更重，与道相违，背道而驰。道是解脱，背道是生死。世俗界是一个名利场，在某些人眼里，佛教界同样是名利场，有名利可得，追逐佛教里的名利，更趣向于生死。</p><p>十一、三昧是修法成就的标志</p><p>问：修日观是不是要修到一天24小时影像都不消失，才能次第往后修呢？</p><p>答：观无量寿经十六观中的每一观，在出现相应的三昧以后，观行才算完成，之后才可以进行下一步的观行。第一观日观要修出三昧，落日三昧，心中的落日相能连续不断地现前不灭，身心都处于禅定状态中，没有烦恼和杂思，除了睡觉都在定中，这样日观三昧就修完了，可以转入第二观。修任何一种法，证任何一种道，包括禅定和智慧，如果没有三昧出现，都不算修成功，不算证法证道。出现三昧前后的时间里，睡眠也不沉重，没有杂梦和乱梦，内心也有一定程度的清明，睡眠少而轻，不昏沉。轻度睡眠时心里应该有影像，深度睡眠时没有了。</p><p>日观在所有的观行里属于最简单最容易的观行，可是不少人修了三年多仍然没有什么消息，三昧影子也见不到，可见修行不是那么简单的事，尤其是断我见和明心见性这样的大智慧成就，更不是很容易的事。观无量寿经的十六观，修到第三观成就，才能保证命终往生极乐世界，修到第七观才能明心开悟。三年当中没有人把第一观修成，第三观和第七观要修到何年何月才能成就？修行不是那么容易的事，除非前世就修习过，并且是成就者，今世才稍微容易一些。</p><p>十一、为什么断我见需要相对应的禅定？</p><p>断我见是戒定慧相结合的产物，也是断烦恼之后的产物，而慧又离不开禅定。断我见之后才能得解脱，解脱就是解脱于烦恼的缠缚，而断烦恼不仅是智慧的成就，更是禅定的结果，没有禅定不能断烦恼，就不能断我见。</p><p>初果二果需要有未到地定，如果没有未到地定，也无法成为初果向。初果断除见道所断的烦恼，是欲界中最粗重的下品烦恼，需要在未到地定中断除。二果需要断除修道所断的烦恼，是欲界中的中品和上品烦恼，更需要在未到地定中断除。初果和二果人命终以后，只能生在欲界天，不能生到色界天和无色界天，因为没有色界初禅定的缘故。</p><p>二果需要在初果的基础之上继续观行四圣谛理，现观是离不开未到地定的，否则就无法现观，只能靠意识的思惟分析，不能有现量观察智，无法证得三果，也无法获得初禅定。三果要断除欲界一切烦恼，也要断除色界至少一品烦恼，成为心解脱的圣人，所以最基本的要有色界的初禅定。三果人命终会生到色界的五不还天，或者在中阴身里再断尽一切烦恼，证得四果，入无余涅槃，如果三果人没有色界定，如何能生到五不还天，如何断尽烦恼？</p><p>禅定如果不具足，就不能断除相对应的烦恼，没有色界定，欲界和色界的烦恼惑就无法断除，如果没有未到地定，欲界的烦恼就不能断除，四圣谛理就不是解脱道之所依。说不断烦恼也能证菩提的那些人，就是因为没有禅定，内心的烦恼无法降伏，意识的解胜，好像很聪明，但没有实证的智慧，不能摆脱烦恼缠缚，就离不开六道轮回。学佛不修禅定，全靠臆想，那就都是戏论。</p><p>十二、在禅定中观行，得到的结果一定是现量实证吗？</p><p>定中观行观出了结果，这个结果，一可能是意识单独观行出来的，二可能是意识与意根共同观行出来的，那么意识单独观行出来的，不能起决定作用，只有意根也观行出来了，才能起决定作用，才有定慧等持的三昧出现，才是真正的智慧。</p><p>为什么同样在定中观行，会出现两个结果呢？这是因为定有浅深差别，所摄受的识心的观行智慧就不同。定有浅深差别，比如有初禅定和具足的未到地定，还有不具足的断断续续的未到地定，还有更粗浅的定，定的时间长短不一，这样观行智慧就存在很大差别。定浅的，未到地定还不具足的，意识的功能作用占绝大部分，推理分析的作用比较大，意根的思量作用很小，得出的结论就不是现量。即使有未到地定，但每次定的时间比较短，观行始终处于粗浅阶段，深入不下去，则不能有深细的观行智慧，所得结果牵强附会，没有现量。</p><p>禅定是如此重要，有的人就一心修定，什么也不管，既不断恶修善，也不想办法修除性障烦恼，也不积极积累福德，由于无福加性障重，修了十几年二十年，禅定仍然修不出来。相反性障烦恼轻微的人，积极护持三宝，积累见道功德的人，一修禅定，就能得心应手，几个月时间身体调理得就很顺利，定力增强很快，比其他人二三十年修的还快。可见修行在修心，不在坐的时间长短，如果不修心，烦恼重还率性而为，业障不减反增，禅定怎么能修持出来呢？</p><p>十三、什么是见地？</p><p>见地的地，是指修证的层次，所处的身份地位。瑜伽师地论中弥勒菩萨将地分为十七地，从凡夫地到佛地。每一地身份都不同，地位都有所上升，以福德、智慧和禅定的不同来划分。其中欲界有九地，是按照福德来划分的，色界无色界是按照禅定来划分的，其中也有智慧的辅助。凡夫、阿罗汉、辟支佛、菩萨和佛地，是按照证量来划分的，证量里包括了福德、禅定和智慧。</p><p>那么见地这个词语就不能用在凡夫身上，因为知见得到了实证，见解得到了证实，证得了无生忍和无生法忍，就有了一定的解脱智慧，身份就上升到了圣贤的地位层次，从前的知见见解就变成了见地。</p><p>知见、想法、观点没有得到证实的，只能叫作知见、知解、个人的想法。要想证实自己的观点见解正确，就要修习戒定慧，定中参究，亲自证得，亲自见得，而不是远远地思惟琢磨、主观臆断。主观臆断的不能断疑，亲自见得的证实的才能断疑，断疑之后才能生起解脱智慧，身心世界才能发生根本性地转变，从此思想层次身份地位都上升了。</p></div>"
},{
    "title": "第三章 如何具体观行五蕴",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  如何具体观行五蕴</strong></p><p>一、观行五蕴以观行识心为主</p><p>观行五蕴十八界空无我，不仅要观行五根以及五根对应的五尘，还要观行六识和意根，包括六七识对应的法尘。其实对于五尘，意根也对应，如果五尘出现，意根不感兴趣，就不会出生五识去了别五尘，六识就不知道有五尘境和法尘境。六识的出生都由意根作主，出生六识的目的就是了别和处理五尘和法尘，所以意根不仅对应法尘，也对应五尘。在没有六识的情况下，或者六识无力了别的情况下，都是意根自己单独观照和攀缘这些法，比如身根的情况，意根时时处处都随着如来藏之后了知着，身体的所有情况，有时让意识五识知道，有时就不让六识知道，即使让意识知道，意识也是莫名其妙。</p><p>观行五蕴主要还是以观行识心无我为主，五蕴的主体是识心，最容易错认为我，而把五根和六尘错认为我所，我所的无我性比较容易认清，而识心的我最难看清。识心也是法的一种，也是在如来藏里生生灭灭，而且是刹那生灭，这些法从真谛的角度来看是没有生灭，都是如来藏性，但从世俗法的角度来看，除了如来藏，一切法都是生灭的，现象不断变幻，有无互相对立。变化的不仅是识心的刹那生灭，识种子输出灭回，念念起伏不定，还有尘境也是在刹那变化着，四大种子输出灭回，色法生灭变异。</p><p>在禅定比较深的时候，五蕴十八界的法，就会在心中逐渐的独立出来，互相粘连的不那么紧密了，独立起来容易各个击破，粘连在一起，比较复杂，显得更真实，难以看清虚妄无我性。在禅定的状态下，识心活动比较慢而微细，对法的执着性轻微，遮障就小，事物的本来面目就容易被识心看清。所以禅定的好处极多，能澄清事实真相，识心了别性和认知性比较客观公正，容易开智慧。学佛人如果不修禅定太可惜了，信佛语，戒定慧具足，才是好佛子。</p><p>二、如何深入观行无我</p><p>观行五蕴的时候，如果有很深的禅定，思惟就会很深细，能往法义里一直深入进去，从而能一层层的解开法义之谜。观行思惟时，要慢慢地、细细地、深深地，与自己的身口意当下进行对照，在尽量大的范围内探究和观行，从而识得五蕴不是我。要探究色蕴为什么不是我，受想行识蕴为什么不是我，思考时要多问一个为什么，要把这个为什么的疑问解决，要深细地思惟。如果只是形式上的理解和明白，没有真正落实到内心，那所有的理论知识都是空洞的，解决不了根本问题和实际问题。</p><p>如何观行思惟呢？比如说观行色身非我，非我是一个结论，但却是佛陀的结论，不是我们的结论，因此这个结论跟我们没有关系，观行之后，我们自己确确实实也得出了这个结论，这个结论才是我们自己的，是自己的智慧结晶，才有解脱的功德受用。佛陀的结论只是一个引子，起个借鉴作用，用以开发自己的智慧。我们可以顺着这个结论，逆向观行思惟：为什么色身非我呢？因为色身是空的；为什么色身是空的呢？因为色身是苦的；为什么色身是苦的呢？这是我们最初观行的入手处，需要我们慢慢地思惟和寻找种种依据。最后得出结论，色身确实不是我，这就断身见断我见了。</p><p>每个人观行之后，获得的智慧、证得的果位是不一定相同的，因为因缘不同，观行有差别，断除身见的程度是不同的，要看证到什么程度，修到什么程度。即便是证初果，也分不同层次，身心受用和转变的程度也不尽相同。例如孩子都上一年级，在一个班里学习的水平也不一样，证果相当于毕业，所以毕业时每个人的水平也不一样，还有早毕业、晚毕业的。每个行者参究的法的范围、角度和深度都不同，思惟力不同，证法的智慧就有差别；智慧不同，烦恼的消除和行为改变的程度就不同。思惟得越深细，定力就越好，定力越好，思惟的就越深细，那么证得的程度就越深，越究竟，心行改变的就越彻底。</p><p>三、观色身非我的下手处</p><p>众生普遍都以色身为我为我所，也把外界生存环境据为我所有。如果要思惟观行色身非我非我所，首先要思惟观行生存环境六尘境界非我非我所，然后在此基础上观行色身非我就比较容易了。</p><p>为什么这样说呢？因为外界六尘与色身一样，都是由如来藏中的地水火风空五大种子组成的，性质相同，而且外界六尘离自心比色身稍微远一些，执著思惟轻一些，容易入手。佛说过外界六尘是我们的外身，也叫作我们的外界，色身是内界内身，内外是相辅相成相通的。确认六尘非我非我所相对比较容易，色身与六尘同理，这样就会把自心与色身拉开了距离，稍微能分割开，再观行确认色身非我非我所就容易多了。</p><p>在世俗界研究色身的科学叫作医学，中医里也讲色身的结构构造与山河大地相似相同类同，治疗身体的时候，不要把色身看得很神秘很特殊，就把它当作山河大地来治理，就像治理生存环境一样。中医这个看法非常科学，接近于佛法，给我们很大启发，观行就找到了一个切入点，上手就快一些了。</p><p>世俗法里讲：流水不腐户枢不蠹。色身也是这样，身体堵塞就会有臭气，就会腐烂出现肿瘤和癌细胞。器世间四大不调，江河决堤、地震海啸、火灾风灾泛滥，沧海变桑田，桑田变沧海。色身也如此，四大不调，气虚血虚、风寒、上火、泄泻、肿瘤癌症等等就会出现。楞严经中诸位圣人，也是从观行外界地水火风，再反观到自身的地水火风，而证得了种种三昧，得以成就。所以从观行六尘境界入手，是观行色身的一个捷径。</p><p>四、看破色身得解脱</p><p>观察人体解剖图，就知道人体的动作是肌肉伸缩形成的，是机械化的，不是真有个我在动作。人体就是意根所用的工具，是高精密机械化全自动的，不是真实的，实际上都是如来藏编排的。看这个神经元系统，无非是一团正负极电线，一堆乱麻绳子而已，从中牵扯出想蕴和受蕴，弄出行蕴和识蕴，像这样能拆分组合的肉体究竟是什么？是我吗？能把它当作我吗？其实它什么也不是，根本不是我，也不是我所有的，也就用个几十年上百年而已，不行再换一个好的。我们应该看破它，去掉心中的累赘，轻松自在解脱，无烦无恼。</p><p>这个色身用一用就行了，没必要去执著它，全体色身，包括六识的功能作用，全部是有固定程序的，如来藏设计编排，为意根所用。如果有人打你一巴掌，给你一拳，就算了吧，不要计较，打不着你，打的也不是你。如果有人对你无理取闹，也算了吧，侵犯不了你，伤害的也不是你。世间让它爱怎样就怎样，好坏都无所谓，没有真实的，较真干什么？你跟我结怨，我跟他结仇，你痛恨我，我讨厌他，烦恼得毫无道理，没有意义。从微生物之间的争夺，到国与国之间的战争，世界大战，斗得不可开交，简直是毫无道理，也斗不倒谁，打不垮谁，生了灭，灭了生，没有生也没有死，纵使世界消失几百万年，只是消失了一大堆乱麻绳子而已。</p><p>释迦佛的亲眷被琉璃王杀死几百个，阿难失心痛哭，可是佛陀与往常一样心平如水，不恼不恨。为什么佛陀如此看得开呢？所有一切没有真人真事，幻化的空的，所以佛陀解脱，阿难不解脱就苦恼不已。</p><p>五、如何观察我见的落处</p><p>寻找自己的我见落处，可以从自己的贪求上来观察，需求过多即为贪，不合理的需求即为贪，不应求而求，即为贪。为什么有这么多的求呢？因为心中有我，见色身为我，见受阴为我，见想阴为我，见行阴为我，于是为了五阴而去贪求。若心中无我，就会少欲知足，适可而止，不会过多的寻觅和求取，更不会用不如法的手段用不合理的方式，甚至用损人的方式去求取自身的利益。</p><p>心中无我的人，不会花费心思去求取，更不会不择手段的求取，而是随缘而活。无我的人做事都会站在他人的立场来处理问题，考虑他人的利益，照顾他人的感受。但是这种照顾不一定是顺从他人的无理需求，而是为他人长远和究竟的利益为出发点，其用心和行为不一定会得到他人的理解和认同。</p><p>心中有我的人，我见重的人，我执也必然重，为人处事都是从自心为出发点，以自我为重，以自己观念看法为准，不征求他人的意见和看法，不考虑他人的感受，往往是按照自己的习气做完再说，先斩后奏，不管是否侵犯了他人的利益。如果他人不顺从自己，就会气急败坏，采取报复手段，以夺回自我利益，平心中的怨气，不计后果。这样的话，在与自他争斗过程中，自己每胜利一次，无我修证的路上就会倒退一步，往生死苦的坑里就进了一步，今世后世的苦难就会加重一些。</p><p>善于观察，在修行当中是很重要的一个环节，善观察就会权衡出一切事情当中真正的利弊得失，长远利益永远重要于现前的利益，长期效应远远大于短期效应。我见重的人目光短浅，往往只看到眼前一点点，被眼前的极小利益蒙蔽了双眼，这就是所谓的业障。什么叫作业障？往世的无明业因，增加了自己的我见我执，障碍了智慧的生发，看不清事情的真相，不知道何为自己的真实利益，把无益之事当作极大的利益去求取，结果背道而驰，得不偿失。</p><p>众生都觉得无明这一用语比较含蓄，愚痴这用语比较粗俗，其实两个词语都是一个含义，佛陀就是用愚痴这个词语来表述众生的心性，这已经很含蓄了。佛陀有时候也会对弟子们吼一句：咄！痴人！其实不管用什么语言，都不能把众生的痴和蠢表达尽致，说什么都不解劲，说什么众生都无动于衷，只好无语。即使用须弥山当撬棍，都撬不动众生心中的痴、愚、钝。</p><p>六、如何才能尘消</p><p>证得尘的生灭变异性、不实在性、虚假性、空性，之后心对尘就空了、净了，见解改变了，知见改变了，具足了正见，心中无尘，见尘而非尘，获得尘三昧，处于尘三昧中。但尘不消不灭，假相还在，只是对它的一切认知改变了，不迷惑了，不颠倒了，不执取了。</p><p>尘是心了别的相，包括色相和心相，以及非色非心相。心是根，法是尘，两种犹如镜上痕。由于没有禅定，学法时理是理，事是事，永远是两码事，一遇事，理就跑到后脑勺去了，就被事卡住了。这样学法，学到什么时候才能解脱？</p><p>七、如何尽快断除我见</p><p>能不能断我见证初果乃至于四果，在于这个人身见我见是轻微的还是严重的。身见轻微的人，很少在意和顾及色身如何，不太花费心思特意照顾色身，对色身的安危不太挂心，少有恐惧感。这样的人由于不太执著色身和五蕴，容易断我见证果。由于不太在意色身五蕴，心里挂碍少，容易有禅定，观行五蕴能一直深入下去，观行得力，断我见就容易一些。</p><p>过去修行人善根福德深厚，在物质生活不发达的世间里生存，不被物欲所控制，欲望较少，不贪图享受和娱乐，也不无故的消耗自己的福报，所以能一心在道业上不断进步。如今的人就不一样了，太贪图享受和舒适的生活，心被各种欲望遮障着，业障不但消除不了，甚至还会增加，道业就很难有什么进步。</p><p>过去的阿罗汉能够行头陀行，因为没有身见我见，又断除了我执，内心里没有对我的安危与否的恐惧，不在意色身所周遭的环境，只想灭除各种心行，以取证无余涅槃。现代人则非常在意色身，各种营养保养养生，由于业障的关系，也没见有多少人把色身保养得有多好，又增加了身见，所以修行上很难有什么突破。对色身无微不至的照顾，到最后看来却是得不偿失的，得小失大，不知何轻何重，都是因为现代生活环境的影响，加之善根福德不足，才会盲目随意的消耗自己的福德。</p><p>所以要想尽快的断除我见我执，就不要总是在意自己的色身五蕴，不要太照顾自己，尽量看淡自己及生活环境，把心用在道业上。同时再注意不要无故的去随意消耗自己的福德，福德对于修道非常重要，即使有诸大菩萨的福德，也不要轻易消耗掉，把福德点滴积累起来，才能终至成就佛的福德。</p><p>八、实判断自己是否属于断我见的状态</p><p>问：次第观察五阴无常、苦、非我，于受想行识不复起我见、我所见，之后还可以怎样增上吗？后续的方向是什么？还是说保持这种不造作寂静的状态一段时间之后，自动就能够自证生已尽、所作已作、不受后有？因为在实践过程中，只要出定后很短的时间内(一两个小时)， 猴子心就又会回来，又会想要抓取造作。这样循环往复，我觉得可能是某个地方，没有完全与佛陀的教法衔接上。</p><p>答：自作证我生已尽，所作已作，不受后有，这是四果大阿罗汉的境界，我们就不要想了，先把初果稳稳当当真真正正的拿到手以后，再说后边的。初果对于前世没有断过我见的人来说，已经是非常困难的了。</p><p>在观察五受阴苦空无常无我的时候，要正确判断是否真正的认为五受阴确实是苦空无常无我了，这个非常重要，是非常关键之处。不可自己认为无我就是无我了。观行思惟的时候，心好像很清净，出定不观行的时候，心里还是有我的，心又不清净了，这说明没有真正断我见，不是真无我了。那就再接着观行，继续做功夫。</p><p>九、反观自心</p><p>听到有人赞美、夸耀自己，心里就感觉高兴舒服，这是什么心？听到有人责备讽刺就嗔恨，这是什么心？看到与己无关的人事物并不在意，这是什么心？看到与自己密切相关的人事物就特别关注，这是什么心？这些心是怎么生起来的，又是怎样变化的？又是如何灭去的？这时候的心，是五阴当中的哪个阴引起？这个五阴是你吗？每个人是否都执著这个心，执著这个受觉？</p><p>十、苦集的方便断与究竟断</p><p>四圣谛修行次序是，知苦、断集、慕灭、修道；或者是知苦、慕灭、修道、断集。断集，分为方便断集和根本断集。方便断，就是没有禅定没有证果时，意识降伏压伏自己不造恶业、少造恶业；根本断集是究竟断，烦恼断除以后，意根不再有造作恶业的想法和动力，不用意识的降伏和压伏，自动自觉的就不造恶业了。这样旧的恶业种子就消除了，新的恶业种子不积集，后世就没有苦了。</p><p>苦是如何来的？在生命最初期，没有五蕴世间，也没有苦。意根因为无明向外攀缘，想要知，于是如来藏出生世界，继而出生五蕴身。五蕴生活在世间，由于意根的无明，就会造作一些不如理的恶业，于是业种积集起来，就有后世的苦报。学佛修行以后，不断的思考苦谛，明了苦的来源是前世集的恶业，于是就会想办法断苦，开始修道不再积集恶业行，证得无我以后，断除无明烦恼，才逐渐灭了苦。</p><p>十一、观行功夫不足观念就无法改变</p><p>问：在观行意识非我的时候，我怎么也找不到证据。您说意识在了别一个法尘之后消失，然后再在另一个法尘上运行。但是我感觉这个能“知”的意识心还是我啊，虽然是不停的在改变，但是这个“知”的性质没有变，我比较困扰。</p><p>答：你这是还没有如实观察，观行功夫欠缺，以至于认识不足，观念不能改变。四圣谛中的苦谛：苦、空、无常、无我，注意佛讲苦谛的次序，无常、空、苦、无我，这是一环扣一环次第相连的。观行的时候，需要按照次第观行，完完全全全观行出第一个的时候，应该引出或者是得出第二个结论，观行出第二个的时候，要引出第三个结论，观行出第三个的时候，应该得出第四个结论。如果不是这样，就出现了障碍和阻力，是什么障碍呢？是无始劫以来固有的思想观念障碍了自己，使得自己无法扭转从前的观念，不能形成新的观念和认知。比如说，无常的法就是空的不可得的抓不住的，你只知道无常，却不能进入空的思想里，那就停止不前往下观不下去了。</p><p>如果能完完全全观行空这个阶段，却不能形成空的就是苦的思想观念，就出现阻碍了，观行停滞不前，无法往下进行。如果观行到五阴都是苦的，却不能得出结论苦的根本不是我，最后一个瓶颈就出现了。怎样才能突破这个瓶颈呢？或者怎样才能突破各个瓶颈，改变从前固有的错误的思想观念呢？需要我们深思再深思。其中持戒、禅定、如理思惟以及福德、愿力是很重要的，应该注重这些方面的修持。</p><p>十二、断我见不是变化色身</p><p>断我见是观行五蕴的不真实性、空性、无我性，不是要把身体变成什么样子，也不是让身体变成残缺不全，然后才能确认色身无我。改变身体是依靠禅定的力量，不用断我见，只修禅定就能改变色身了。那些身体瘫痪残疾的人，不是照样我见深重吗？如果能把色身通过观行，变成黄金，也许我见更重。关键是在思想认识上，现量认知色身是假的空的不真实的，改变思想，不用改变身体。不要观成残废人，万一定力增强了，身体真出毛病了，不就坏了吗？观身体是组合起来的就行了。</p><p>十三、断我见的最关键之处在于改变观念</p><p>断我见首先需要改变旧的思想观念，建立新的思想观念，有新的认知体系，对于无常的现象要有清晰的认知，充分而清醒的认识到五阴世间的无常，生灭变异，从而把生灭变异的法确立为空和无我。但确立这样的思想观念是非常困难的，现象容易观察，观念不容易改变，树立正确如理的观念比观行世间法的无常还要难很多倍，无常其实是容易观察到的，就是由于习惯于有，很难确认为空，知道空了也无法确认为无我，就是因为旧有的我的观念不容易突破。</p><p>这就需要有意的训练观念的改变，如何训练呢？比如拿一个玩具汽车，拆了装，装了拆，然后观察在这其中有真实的玩具汽车吗？一堆铁片子组装出来的东西是玩具汽车吗？有玩具汽车这个东西吗？玩具汽车是因缘所生法，不能自主，生住异灭，生灭变异，本身是空的，没有我的性质。还可以把朔胶洋娃娃拆拆装装，观察形成洋娃娃的因缘性，洋娃娃本身的生灭变异无常性和空性。反反复复的试验和观察，从而逐渐打破有的观念，树立空的观念，形成新的观念认知，这样才好断我见。</p><p>十四、如何观气息断身见</p><p>问：修定时总因气动而无法入深定，是否可以从气上观行，以求突破断身见？                                </p><p>答：既然不能入深定，那么观行就不会深入和连续，无论观行什么法都是如此。但是如果观行能做到一心和连续不断，那么禅定就会逐渐深入，定和慧、止与观互相之间有连带的关系，能够互相促进。观气就是观气息，气息也和呼吸有关，那就属于四念处的观行范畴了，从五蕴当中任一法入手观行，都可以断身见，关键是要有未到地定。</p><p>身体里的种种气是物质色法，如果观行出气的生住异灭，苦空无常无我，也只能断除色蕴的我见，识心的我见还不能断除。但能把身体中的气观行清楚，也是相当好的，以点带面就能把全身的色法观行清楚，知其来龙去脉，证其生灭变异无常，只断除色身我见也是相当不错的，烦恼减轻以后，再观行识心的苦集灭道，就能容易一些了。</p><p>如何观行气从而断除身见呢？俗话说一口气上不来，就气绝身亡，阴阳两隔，气对色身就是这样的重要。气在身体里能够输送身体需要的氧气，带动血液的流动，气血合起来就是色身存活所需要的养料，没有了气血的滋润，色身必灭亡。气是四大种子构成的色法，以风大为主，所以气具有流动性和飘动性，能遍及全身而行，一旦被堵在某处不运行，某处即出现病障。气既然是四大组成的色法，就是生灭变异的无常法，观行气的无常性、变异性、空性，即知是苦性，苦性即非我也非我所。气即非我，由气所支撑的色身同样如此，生灭变异无常，苦空无我。从气这个角度观行，也可以断身见。</p><p>十五、空能被看住吗？</p><p>问：打坐的时候空掉自己，一心看住“空”可不可以？</p><p>答：想空掉自己，首先要知道什么是自己，能空的心是自己，所空的法是自己，自己空掉了，就没有能空的心以及所空的法，这样的话，既然已经空掉了自己，那还怎么看住空啊？还需要看空吗？有看住空的看，本身就不空，有能看和所看，能所俱在，就不空了。你所看的那个空，也是有，这是头上安头。</p><p>在打坐中空掉了自己，如果起念想保持下去这种状态，那就不空了。住于空境，或者空心静坐，都是纯粹的禅定，不能出生无我的智慧，必须在定中起观，才能出生观慧。这在六祖坛经里六祖已经批驳得很清楚了，读书的时候感觉很清楚，一到实用的时候就糊涂了。在定中没有观照法义，没有观行，没有疑情，就不能出生智慧。比如念佛定，定得再好再深，里面没有疑情，没有观行，没有参究，怎么能出生智慧断我见或者明心呢？        </p><p>什么是观行？比如世俗法方面，有些人和事经历多了，慢慢就会看透了，以后就不在乎了。观行也是这样，看多了，就会看透了。看透了是什么意思？人接触时间长了，就会看明白这个人，就会有所取舍，进而决定是否继续交往，观察自己也是一样的，五蕴身心时时观行，时间长了，就会看透了五蕴，道理是一样的。智慧好一点的，可能会早一些看透，智慧非常差的就得后世看透。但这个基础必须打下来，功夫必须要做。</p><p>十六、心空无为有为不空</p><p>学佛修行人在人群和独处中，应该减弱自己的存在感，不要太在意自己，不要太把自己当回事，不要争强好胜，不要事事都要第一。自己不是真实存在的，对方不是真实存在的，群体不是真实存在的，没有第一第二，没有最好最差，都是一个虚拟的名相。如果一个人心里总想着我要战胜所有人，我一定要比所有人都好都强大，总想要出人头地、出风头，希望所有目光都注视自己，这样的想法，我性非常重，与无为不相应，与圣人的心不相应，很难断我见成为圣贤人。</p><p>圣人心空无为，没有这样的心性。越要突出自己，心性越在人后，圣人都与此相反，没有自我存在感，做有为事心却无为。只有一心为大众的人，才能有资格成为圣人。</p><p>十七、虚相假相都有虚假之用</p><p>真空，就是指如来藏，真实而性空，祂心体里一法也无却又能变现一切法。妙有，就是五阴十八界法的相虽然是有，可实质是无，都是如来藏变现出来的虚妄法。虚妄法虽然虚妄，也不能说都不存在，因为众生分秒刹那都在用，用五阴吃饭穿衣走路，用五阴生活，众生活在虚妄的十八界里，见的是假色，听的是假声，嗅的是假香，尝的是假味，觉的是假触，识的是假法。见听嗅尝触识，都是五阴的作用，所以不能否定五阴表面的存在现象。</p><p>五阴虽然不是真实的存在，但还有虚妄的存在这种方式。明明众生每天都在用五阴，却还说五阴不存在。心里真能认可五阴确实是虚妄的时候，那就是断我见了，愿众生都如此。如果否定五阴的虚相也不存在，也不能断我见，因为不能观行五阴十八界，就不能看清五阴十八界的虚妄不实性，也就不能断除我见，所有的无明烦恼都不能消除。</p><p>十八、一切法皆为假名</p><p>譬如国家，单个一个人，不称为国；既然单个人不是国，多人也不是国，那么十亿人也不是国。国何在？假名也！是故一切法皆为假名，无有其实，真如除外。同理，一个头不称其为人，一个胳膊不称其为人，一条腿不称其为人，组合起来，也不称其为人。何为人也？无人！是为假名，无有其实！一切法皆为假名，无有其实，真如除外。</p><p>何为某某其人？无某某其人，头目脑髓都不是某某其人，胳臂腿脚也不是某某其人，思想觉知观念受觉，也不是某某其人。和合起来，更不是某某其人，但不离此法而见某某其人。若有人骂某某其人者，能否骂到某某其人？不能！若有人打某某其人者，能否打到某某其人？也不能！某某其人空，打骂皆为空！无有其人其事。</p><p>十九、五阴为什么是假相？</p><p>问：为什么说尊贵的五阴和卑微的五阴都是假相？又为什么心经里说诸法都是空相不生不灭？</p><p>答：譬如说小孩用积木堆积房屋如何又拆掉，之后再重新堆积再拆除，反反复复不断的堆积和拆除，房屋从无到有，又从有到无，生了灭灭了生，因此说房屋是虚幻的，是假相，是空相。而积木却总存在着，不会毁坏，只要积木存在，孩子又不厌腻的堆积，房屋就会不断的出现和存在，因此说房屋就是总存在着的空相，不生不灭。</p><p>同理，五阴是用七大种子构成的，因缘具足的时候七大种子就把五阴搭建出来了，因缘散去的时候，五阴就散去，又回到原始的七大种子状态，因缘再具足的时候，七大种子再次搭建出五阴，这样五阴随着因缘业力不断的产生和灭去，不管七大种子依有福的业种和因缘建造出的尊贵五阴，还是依无福的业种和因缘建造出的卑微五阴，都是假相和幻化相，都是空相。</p><p>五阴灭去，还剩下七大种子，然后这七大种子在因缘又具足的时候再次组建五阴，反反复复的不断出生五阴，这样依靠着七大种子五阴就能永远的出生，永远的存在下去不断绝。那么从这个角度和意义上来说，空相的五阴也就是不生不灭的了，众生就会永远的流转下去。有七大种子有业种有因缘，能奈五阴何？</p><p>二十、如何正确认识识阴（一）</p><p>《持世经》原文：<strong>佛告持世，何谓菩萨摩诃萨正观察选择识阴。菩萨摩诃萨观非阴是识阴。颠倒阴是识阴。虚妄阴是识阴。何以故。持世。是识阴从颠倒起。虚妄缘所系。从先业有。现在缘所系。属众因缘。虚妄无所有。</strong></p><p>释：佛告诉持世菩萨说：什么叫作菩萨摩诃萨正确的观察和认识识阴？菩萨摩诃萨观察并没有什么阴叫作识阴者，识阴无所有。颠倒阴是识阴，虚妄阴是识阴。为什么这样说？持世，因为识阴是由于颠倒心而出生的，识阴是由虚妄的业缘所系缚的，识阴是由过去世的业而生出来的，是由现在的业缘所系属的。既然识阴是由于众多的因缘和合才出生的，识阴就是虚妄无所有的，是空的。</p><p>证得识阴粗相的虚妄，是无生忍，证得极细相的虚妄，是无生法忍。本来无法，在无法当中，由因缘力强行建立起识阴，识阴就是虚妄虚幻无所有的。容忍这个理存在，就是无生忍或无生法忍。</p><p>原文：<strong>忆想分别起。从识而生。有所识故。名之为识。从忆想分别觉观生。假借而有。有所识故。数名为识。以识诸物故。以起心业故。以思惟故。众缘生相故。起种种思惟故。数名识阴。从有所识。有识像出。示心业故。摄思惟故。数名识阴。</strong></p><p>释：识阴是由于意根的忆想分别而生起的，是从阿赖耶识中而生起的，因为识阴有识别的功能，所以叫作识阴。因为识阴是由意根的忆想分别的觉观出生的，是假借众多因缘而有的，又有识别的功能作用，就堕于五阴数中，名为识阴。因为识阴能识别诸法的缘故，能生起心的业行的缘故，因为识阴能起思惟的缘故，有众多因缘和合相的缘故，能起种种思惟的缘故，就堕入五阴数中，名为识阴。</p><p>原文：<strong>或名为心。或名为意。或名为识。皆是意业分别故。识阴所摄。识相识行识性示故。数名识阴。如是非阴是识阴，不生不起不作，但以颠倒相应缘。虚妄识故，数名识阴。</strong></p><p>释：识阴或者名为心，或者名为意，或者名为识，都是属于意业分别，属于识阴所摄受的，有识的相貌、识的运行和识的性质显示出来，堕入五阴数中，名为识阴。像这样的本没有阴入的阴名为识阴，识阴其实本没有出生，本没有起用，本没有什么功能作用，但却因为颠倒的相应的业缘，虚妄的识别诸法，就堕入五阴数中，名为识阴。</p><p>原文：<strong>何以故。是识阴从众因缘生。无自性。次第相续生。念念生灭。是识缘不生阴相。何以故。是识阴生相不可得。决定相亦不可得。生相不可得故。决定相不可得故。根本无所有故。自相无故。牢坚不可得故。</strong></p><p>释：为什么这样说？因为识阴是从众多因缘和合中出生的，因此并没有识阴本身的自体性。识阴是有次第地相续地出生的，念念都是生灭的。这样的识的缘不会出生阴入的相貌，为什么呢？因为识阴出生的相貌是不可得的，识阴没有出生，也就没有出生的相貌，识阴的决定有相也是不可得的。识阴的出生相不可得，决定有的相不可得，识阴从根本上来说是无所有的，识阴的自体相也是无所有的，识阴的牢固相也是无所有的。</p><p>二十一、如何正确认识识阴（二）</p><p>《持世经》原文：<strong>智者正观察选择通达。非阴是识阴。凡夫于非识阴生识阴相，以觉观分别忆想。颠倒相应。虚妄所缚。强名为识阴。贪着是识阴。依止所识。依止识种种示思惟故。生起识阴。是人种种分别。贪着内识。贪着外识。贪着内外识。贪着远识。贪着近识。以识相故。分别起识阴。</strong></p><p>释：有智慧的人应当正确的观察、抉择和通达，所谓的识阴本来没有阴入自体的性和相，没有识阴而假名为识阴，而凡夫却对本不是识阴的法生出识阴的相貌，用自己的觉观、忆想和分别，与颠倒心相应，被虚妄相所束缚着，强名为识阴。凡夫贪着虚妄相为识阴，依止于虚妄的识别性，依止于识阴，种种示现识阴的思惟功能性，生起识阴相。</p><p>凡夫人种种分别，贪着能识别身内尘的内识，贪着于能识别身外尘的外识，贪着于内外识，贪着于过去未来遥远的识，贪着于现在眼前的近识。因为虚妄地了别识心的相貌，了别虚妄的识心相貌，就把这些虚妄的相貌执为识阴。</p><p>原文：<strong>是人以忆想分别。若心若意若识。假借强名是心是意是识。如是知种种心相生。是凡夫贪着识阴。为识阴所缚。心意识合故。起种种识阴。分别虚妄事故。以一相故。以决定相故。能得是心是意是识。能得分别爱着。</strong></p><p>释：凡夫人凭借忆想分别，说这是心这是意这是识，假借识心的相貌，强名为心为意为识，这样分别以后，心中就生起了识心的种种相貌。凡夫人因为贪着识阴，就被识阴所束缚，心、意和识和合起来，才显现出识阴，于是心中就生起了识阴的相貌。因为识阴能虚妄地分别种种事相的缘故，因为虚妄地见到识阴和合相的缘故，因为心中决定识阴有相貌的缘故，凡夫人就执为是心是意是识，并且加以分别和贪着。</p><p>原文：<strong>是人依止识阴。深贪识故。亦得过去识阴。贪着念有。亦得未来识阴。贪着念有。亦得现在识阴。贪着念有。诸凡夫于见闻觉知法中。计得识阴。贪着念有。是人贪着见闻觉知法。为识阴所缚。贵其所知。以心意识合系故。驰走往来。所谓从此世至彼世。从彼世至此世。皆识阴所缚故。不能如实知识阴。</strong></p><p>释：凡夫人依止于识阴，因为深深地贪着于识阴的缘故，也执于过去的识阴，因为贪着识阴，执识阴确实有，于是就执未来的识阴，因为贪着识阴认为识阴确实存在，也执着于现在的识阴。</p><p>因为贪着识阴认为识阴是实有法，诸凡夫人在一切见闻觉知的法中，计着执为是识阴的功能作用。因为贪着计着识阴为有，凡夫人就贪着于见闻觉知之法，被识阴所束缚，宝爱珍贵着能知能觉之法。因为心、意、识三者和合起来共同系缚其心的缘故，凡夫人就在六道里不断地生死轮回，生来死去，死去生来，从此世到后世，从前世到此世，都是因为被识阴所系缚的缘故，不能如实了知识阴、看破识阴。</p><p>二十二、如何正确认识识阴（三）</p><p>《持世经》原文：<strong>识阴虚妄不实。颠倒相应。因见闻觉知法起。此中无有实识者。若不能如是实观。或起善识。或起不善识。或起善不善识。是人常随识行。不知识所生处。不知识如实相。</strong></p><p>释：识阴是虚妄的，不是实有之法，是妄见之法，与无中见有的颠倒心相应，因于能见能闻能觉能知的法而生起，在所谓的见闻觉知当中，并没有实在的识心来见闻觉知。如果不能像这样的如实观察识阴，就会生起造作善法的识阴，或者是造作不善法的识阴，或者是造作善法和不善法的识阴。这样的人心常常随着识阴而流转，不知道识阴所出生的处所，不知道识阴的真实相貌。</p><p>原文：<strong>持世。菩萨摩诃萨于此中。如是正观。知识阴从虚妄识起。所谓见闻觉知法中众因缘生。无法生法想故。贪着识阴。是诸菩萨如实观时。知识阴虚妄不实。从本已来常不生相。知非阴是识阴。想阴是识阴。幻阴是识阴。</strong></p><p>释：持世，菩萨摩诃萨在见闻觉知中，能如实地正观识阴，了知识阴是从虚妄的识当中生起的，也就是在见闻觉知的法中，由于众多因缘生起了识阴，在本没有法中生起了法的念想，于是就贪着识阴。诸大菩萨这样的如实观察的时候，就知道识阴虚妄不实，是从本以来从来没有出生过的。也知道没有识阴本体相貌的就是所谓的识阴，知道有心念思想流转的想阴也是识阴，种种虚幻的阴入法就是所谓的识阴。</p><p>原文：<strong>譬如幻所化人识。不在内亦不在外。亦不在中间。识性亦如是。如幻性虚妄缘生。从忆想分别起。无有实事。如机关木人。识亦如是。从颠倒起。虚妄因缘和合故有。如是观时。知识皆无常苦。不净无我。知识相如幻。观识性如幻。</strong></p><p>释：譬如幻化不实的人的识心，不在内，不在外，也不在内外的中间，识心的性质也是这样，是幻化性的，由虚妄的缘法所出生的，是从忆想分别而生起的，没有实在的分别性，犹如设置了机关的木头人。识阴也是这样，从颠倒的心行中而生起，虚妄的因缘和合起来才有的识阴的作用。像这样正确的观察识阴的时候，就会知道识阴都是无常的苦的不净的无我的，知道识阴的相貌是虚幻的，观察识阴的性质也是虚幻不实的。</p></div>"
},{
    "title": "第四章 大小乘的区别",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  大小乘的区别</strong></p><p>一、云何认识空？</p><p>在佛法修学过程中，通过长期广泛的观察，对人事物理认知的智慧提升了以后，思想观念就会改变，观念改变了态度就改变，态度改变了行为就改变，行为改变了业就改变，业改变了果报就改变，果报改变就解脱。有智慧能充分有效的认识到万法的空和虚幻，不再执著执取万法，世间空了寂静了，心安然了，就解脱了。认识到空的时候，就会觉得世间一切都没有什么，世俗法得过且过，世俗里有利益与否都不重要，重要的是心空了，身口意改变了，不再造作贪嗔痴烦恼业，果报善了。如果还认识不到空，心里就有我，有我就有烦恼和烦恼业。      </p><p>空，分三个方面来逐渐深入的认识，最深的是从如来藏这个角度来认识，但不证得如来藏是无法认识到空的，比较深一点的是从十二因缘和四圣谛角度来认识，最浅的认识是从世间法的角度来认识空，这是经验和聪明智慧的累积，是世间智者的智慧，当然是很不究竟的，但也好过无智执有之人。最彻底最究竟的认识，是从如来藏里七大种子的功能作用角度来认识一切法，这样就能空到绝境，连空也空，空空也空，绝一切心和境，一切法和境都多余。到这种时候，已经没什么好说的了，说出来的都不是，没有意会更没有言传。</p><p>二、大小乘所证得的空的差别</p><p>小乘证得的五阴空与大乘证得的五阴空有本质的区别，正因为有区别，所以大小乘人的心量不同、愿力不同、道行不同，小乘人解脱以后要入无余涅槃，而大乘人解脱以后却永远不入无余涅槃。小乘人证得的五阴空，是在外表现象上证得的，是观察五阴现象的生住异灭证得的空，这种空不究竟，还不到底，还有偏颇，所以智慧浅，行愿也浅。大乘人证得的五阴空，是从五阴的本质上证得的，见到了五阴的本质是如来藏所出生，所以就不再在意五阴，也不会想办法去灭去五阴，所以行愿就大。</p><p>比如一部分人看见一个人生了之后又死了，就会知道人是无常的能灭的，把握不住的，因此是空的。而另一部分人不仅如此，还看见了这个人其实是魔幻师变幻出来的，生死由魔幻师掌握，即使死了，魔幻师还可以再变幻出来，生死都是假相。这部分人就对这个幻化人没有执取了，但也不会刻意回避和弃舍。</p><p>其实小乘人所认为的空，是与有相对立的空，这还是另一种的有。正因为小乘人的空停留在表面现象上，不是实质性的空，所以他们都想办法灭除不用，想办法躲避，害怕五阴世间，这就是另一种有。真正空了，还躲避什么？害怕什么？也就不会去想办法灭除了。比如天女散花，小乘人害怕花着身，就躲避花，抖落掉身上的花，认为花着身不如法。而大乘人不理这些花，浑身是花也无所谓，所以花反倒不着身了。</p><p>大乘菩萨为什么是如此心态？因为菩萨知道花是幻化的假相，不会有什么实质的作用，色身也是如此，幻化身与幻化花，何障碍之有，有何不如法的？这些法都需要自己实证之后去体会，没有实证，虽然很理解了，但是还不能到位，心行上还不能空。小乘人认为确实有个空，大乘人认为连空也空，空空也空，空尽了，才是到家了。</p><p>三、大小乘空的区别</p><p>万法皆空的空有两方面含义，一方面是从小乘法的角度讲的五蕴世间皆空的含义，层次比较浅，范围比较窄，不包括一切法；另一方面是从大乘法角度讲的五蕴世间皆空，和一切法空的含义，层次也越来越深，是根本上的空，实质上的空，究竟意义上的空，以至于最后达到完全彻底的空，范围则包括了一切法，没有一丝遗漏。小乘法讲五蕴世间的苦、空、无常、无我，这个空是指生灭变异无常的法，只要有生就会变异甚至灭去，不能常住不能久长，有生有灭的法，是无我性的法，这是小乘的空。</p><p>大乘法的空是证得如来藏以后，现量观察五蕴世间和一切法都是如来藏所变现出来的，所以都是空的，这些法也是生灭变异不真实的。很显然，大乘的空更根本更究竟更透彻，把空的理讲明了。从地上菩萨唯识种智来讲，眼前所见的物都是心所变现的，被变生的法就是幻化的不真实的。就像魔术师凭空变一束鲜花，这束鲜花虽然在现象上是存在的，但实质是空的、不存在的，存在是一种假相。大乘法阐述世间一切法的空、假、中，而小乘的空比较浅，没有假，也没有中，只是观察世间法无常变异不住，没有被幻化的那种假，没有抓住法的实质，观察智慧比较浅。</p><p>无论是大乘还是小乘的修行，都是破除七识五阴的无明，让七识五阴具有空的智慧。如果熏习了很多法，理论很丰富，能写出诸多辩论论文，可是心却不空，把所学理论都当作实有的法，这是学知识，而不是修行，与修行背道而驰。</p><p>尤其是学大乘法，如果沉迷于深奥有趣的理论当中，不断吸取知识，孜孜以求的探索和研究，整理和归纳，条分缕析，把如来藏幻化的一切法当作有法来执取，执有而不空，这都不是修行。修行是依据理论证空而破除无明，改变心行和心性，心性只有心空了才能改变，心性改变，心行才能随之改变，果报才能由恶报变为善报。每个学人都要牢记学佛的宗旨是要达到心空，心空及第归，修行不是搞学问，不是累积知识、研究理论，所以不能执理废事，要理事统一，理事圆融无碍。</p><p>四、大小乘证道的区别</p><p>断我见是观行五蕴无我之理，不涉及第八识，证得第八识需要修学大乘般若，在意识具有相当的般若正知见以后，就要在禅定参禅，参究第八识，才能大乘证道。大小乘的用功方法和内容不同，大小乘在证道以后心空的层次和内涵也不同，小乘断我见是证得五蕴空无我，是单独一个无的那种空；而大乘证道以后的空，包括了小乘的那种无的空，也包括证得了第八识本身所具有的独特空性，知道第八识本身如何是空的，也能观察出祂所出生的五蕴身是如何空的。所以大乘的空比小乘的空更究竟一些，更接近真理，更能体现出法界真相。证道时二者的智慧相差很大。</p><p>五、大小乘的空不是一个境界</p><p>声闻缘觉的空，与空如来藏的空是两个境界，差别极大，不可混为一谈。如来藏三种空，无论哪一种，都必须证得如来藏才能现量观行，与小乘的空截然不同。证得如来藏以后的心空，与没有证得如来藏之前的空，不能混为一谈，性质不同，心境不同。菩提本无树，是小乘空，这时还没有证得如来藏，与空如来藏不挂靠，后边闻金刚经说五个何期自性，这时候才证得如来藏。</p><p>六、色无常苦空非我中空的含义</p><p>每个法上都有不同层次的含义，智慧不同的人当然就会有不同层次的理解。小乘人理解为散坏破灭的空，大乘人除此再加上如来藏的空性，地上菩萨以及佛陀看色就是四大种子的运作，更是空无。色法本身就是空相，这个深刻的道理地前菩萨绝对不可能观察出来，不可能真正理解其实际内涵，诸佛观察色直达底源。新悟菩萨只能把色理解成空性第八识所生，观察力微弱，理解成分多。</p><p>但是无常苦空非我，主要指小乘的散灭毁坏之法。由前面的色无常，证知色是苦的，再证知色是散坏不久住的，最后就会证知色不是我们无始劫以来所认为的不散灭的代表着自我的主体。</p><p>七、大小乘修行地图</p><p>修行的真正入手处，小乘的四念处经就是实修的入手处，坐禅三昧经也是。大乘的父子合集经，就是世尊让他父亲观行诸法如梦，里面只讲理论，因为是度初级学人的入门方法，只是相似的理解如梦，并不能证得。</p><p>至于说大小乘的修行地图，当然是先观行断我见证果以后，再参禅，参禅的方法，断我见的方法，修定的方法都讲过了。没有断我见，参禅就不会有结果；参禅不成就，如幻观就不要想了，禅宗第三关和阳炎关、如梦观都不要想了，以后地上菩萨所修的法，更不用想了。可以找资料熏习，但无论怎么修都是熏习，绝对不能实证。修行的次第和路数很清晰，修定学理论，然后观行断我见，证果以后参禅明心。这些达不到，谈什么都没有用。不是大根基、特大根基的人，无法跳跃修行。佛菩萨和阿罗汉再来的人可以，其余人跳也跳不过去。</p><p>初地以上的菩萨，能够完全通达小乘佛法，大乘只通达一部分，佛全部通达。没有实证，只是理解，理解的永远不能叫作通达。因为没有实证，一个法都不能通，达不到任何智慧境界。至于说转依，没有实证，也转依不了。实证了第八识以后，才能逐渐转依，转依成功一部分，心地改变了，转识成智了，那已经是初地以上菩萨了。普通人谈不到转依，心地里都是贪嗔痴，最初的我见都没有断，带着个高大的我，遮障那么严重，能转依个什么呢？</p><p>禅定没有，念佛都不能定，念咒也不能定，观呼吸观不下去，基本的禅定都修不出来，如何有能力观行五蕴无我，如何能够断我见？如何能够参禅明心？不明心，谈其它的简直太遥远了。</p></div>"
},{
    "title": "第五章 阿罗汉与解脱",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  阿罗汉与解脱</strong> </p><p>一、何谓解脱？<br/></p><p>解脱就是离却一切贪嗔痴烦恼；解脱就是对色声香味触法心无挂碍，也无系缚，既不贪也不嗔，既不喜也不忧；解脱就是对一切人事物理无所挂碍，也无所系缚，既不贪也不嗔，既不喜也不忧，有什么没什么都一样；解脱就是对吃穿住用行随缘应对无所求，没有贪得之心；解脱就是在世间里生存，善知止足得过且过，没有非分之想；解脱就是不追忆过去不幻想未来，也不住当下，念念不停留；解脱就是对一切人事物理心不着，明了其苦空无常无我，明了其来龙去脉，明了其幻化不可得；解脱就是对一切法心空，自在无碍。</p><p>二、解脱和自在</p><p>修习一切法的目的，是为了识破一切法的空性、假性以及中道性，从而让自心获得智慧，对于一切境界心空无碍，得到功德受用，从而解脱于世间烦恼。</p><p>有人会问：解脱干什么用？解脱没有什么用，什么也不用不贪执了，就是解脱，解脱就是脱离束缚而自在。解脱无苦，就像离笼之鸟儿，自在翱翔；就像脱离陷阱的猛虎，山上山下随意游荡；就像脱离缰绳的野马，广阔天地任意驰骋。又有人会问：自在有什么用？自在也没有什么用，不用什么都行就是自在。自在只是一种没有我的束缚的感觉，甚至连感觉也没有，有感觉也不自在。所以没有用最好，要用干什么？用有什么用？有用都是累赘和束缚，都是苦。</p><p>要想解脱无我，应该天天问自己：我吃饭干什么用？然后回答：吃饭是为了色身存在；再问：色身存在有什么用？回答：色身存在是为了活着；再问：活着是干什么用？……刨根问底，打破砂锅问到底，绝不轻易放过自己。之后，就是智者见智仁者见仁，各诉己见，境界纷然而彰，思想跃然纸上，差殊自然而显。反观，反思，就会逐渐进入修道中。天天这样问自己，终有一天会觉悟，不再贪着，也不再执着，舒畅自在解脱，无烦无恼，最后自己就会超然物外，超脱洒脱了。</p><p>三、解脱的人是什么心态？</p><p>解脱是断除了烦恼，心空无我，对五蕴十八界不执不取，不取着色蕴，不取着受蕴，不取着想蕴，不取着行蕴，不取着识蕴，不取着色，不取着声，不取着香，不取着味，不取着触，不取着法，不取着财色名食睡，不取着名闻利养，不贪世间法，随缘应物，没有功利心，没有计较心，不求回报，不为权势和名声。既不趋炎附势，也不自高自大；既不争奇斗艳、强取豪夺，也不喜展露自我；既不尔虞我诈，也不工于心计，一切法无所用心，世间法拘碍不了他。因为五蕴世间毕竟空，无所系缚，无所挂碍，取与不取都了不可得，枷锁不着心，自在无碍。</p><p>四、为什么四果阿罗汉相当于八地菩萨的解脱证量？</p><p>小乘四果阿罗汉可以入无余涅槃，大乘从初地菩萨开始是断除烦恼的三果圣人，虽然地上菩萨可以入解脱正位，取证四果，但是如果取证命终就要入无余涅槃，佛不许菩萨取证四果，入解脱正位，直至七地满心，取证四果，入八地菩萨位。八地以上菩萨不会再入无余涅槃了。所以从解脱的证量来看，四果与八地菩萨的解脱证量相等。初地满心也不可以取证四果，否则犯佛戒，被佛呵责，佛也会护持菩萨不取证四果果位。</p><p>五、阿罗汉辟支佛的修行是舍五蕴取涅槃</p><p>阿罗汉四圣谛的修行以及辟支佛的十二因缘的修行，是减法和舍法，五蕴世间逐渐地舍弃。因为他们心中有法有物有五蕴，才在修行上不断地减少，包括心行业不断地减，舍弃贪欲和一切烦恼，最后取涅槃。阿罗汉们认为确实有三界，确实有五阴身，确实有苦受，确实有因果，所以才下决心舍弃这一切，出离三界。取舍之心，成巧伪，所以也不是最上最真实的修行方法，虽然这是每个修行人必经之路。</p><p>但是修行是分层次和阶段的，先要弃恶取善，心善以后，既不取恶也不取善，不取不舍，心住中道。菩萨了知一切法都是如来藏幻化的，心中无物，也就没有什么可舍的了，对一切法不取不舍，不贪不厌，坦然面对，从容度众，所以绝对不想离开三界去取涅槃。</p><p>六、阿罗汉入无余涅槃是灰身泯智不是万念俱灰</p><p>阿罗汉入无余涅槃以后，他的三界世间法就消失不见了，准确地说，在三界世间里没有阿罗汉这个人了。三界世间，包括欲界色界无色界，这叫作器世间，包含极多的色法。如果阿罗汉入无余涅槃了，不仅七识所对应的带质境、性境和独影境等色法不出生了，他的第八识所对应的本质境色法也不出生了，没有本质境，就没有带质境独影境和性境。这些境界是三界业种所呈现出来的依报世间法，正报是五蕴身。</p><p>万念俱灰的是凡夫世俗人，圣人无心无念无愿无希冀，因而谈不到灰和俱灰，阿罗汉不可能像世俗人那样万念俱灰。万念俱灰的意思是心中有很多希望和意愿都无法实现，所以才大失所望，变成在世间里什么想法念头也没有了，但是意根还是有很多想法和愿望没有灭，只是实现不了。而阿罗汉是灰身泯智，原文对五蕴世间不寄予任何愿望，因而不需要五蕴身和解脱智慧了，身心皆舍弃。佛用灰身泯智这个词来形容阿罗汉的愚，灰身是把现在的色身五蕴以及未来世无量劫的五蕴色身都灭了，不要了，泯智是泯灭了三界解脱的智慧，意思是阿罗汉身心都不要了，名为解脱，名为寂静。</p><p>其实真正的解脱是什么呢？是面对一切境界时，如无境界一般，无欲无求，视而不见，听而不闻，无所用心，不主动不回避，不被熏染，不去沾染，极其自在。佛陀就是如此自在解脱，不妨有五蕴身解脱色，不妨有转识成智的七识心，身智俱在，互相伴随不分离，什么天魔外道也无可奈何。这就是佛陀的无住处涅槃境界，什么法也不住，如无垢识一样无为，如真如一般无为，但不妨碍有为，如大圆镜智一般有为而无为，有为无为浑然一体，打成一片，不相脱离。这个境界无与伦比，因此众生的境界与佛陀的境界无法相比。</p><p>七、阿罗汉的第八识心体中有什么业种？</p><p>阿罗汉在有余涅槃里，随缘度日，不执取五蕴世间一切法，心空无我，三界世间法的业种渐渐消失了。因为没有三界世间业种了，后世也不会有三界世间，更不会有五蕴身在三界世间出生。阿罗汉的第八识里如果还有三界业种，种子必须会现行出来，以酬偿业行，这样就没有无余涅槃境界了。</p><p>但是阿罗汉入无余涅槃以后，早晚还会出现在三界世间里，因为阿罗汉在涅槃之前都听闻了大乘法，种下了大乘法的种子，种子成熟以后，第八识就会输出意根的识种子，出生意根，进入中阴身，再次投胎，修学大乘。业种与意根相应，意根与业种相应，意根如果不执取三界世间，就不能留存世俗业种，有执取就会继续造作善恶业，业种留下，后世就会随业种继续投胎轮回。意根不执取，六识不造业，就没有业种，不用受业报。</p><p>八、什么是入流？</p><p>入流是入到解脱的圣道流，解脱首先需要把生死束缚的我见邪见断除，从此以后就不是具有三縛结的凡夫了，在入流的过程中不可缺少禅定，要具有欲界的未到地定以上的禅定，才能断我见入圣道流。只有禅定或者是初禅定，没有断除我见三縛结，就不能入圣道流，否则具有四禅八定的外道也都入圣道流了。那岂不是修外道的四禅八定也能解脱了？已经断了三縛结就会入到圣道流，不是入之后才有能力断。</p><p>九、佛陀涅槃就是灭掉一切法吗？</p><p>佛陀涅槃与阿罗汉涅槃有本质的区别，佛陀涅槃以后，还要变幻现出无数五蕴身用以在十方世界度化众生，所以佛说五蕴身叫作解脱色。佛在一个世界里度化众生的缘暂时了了，把色身灭掉，方便叫作涅槃，比如释迦牟尼佛在娑婆世界涅槃，色身暂时离开灭掉，可是释迦佛仍然是娑婆世界的法主教主和导师，娑婆世界众生仍然属于释迦佛所教化的弟子，同时释迦佛化现无量无边五蕴身，在十方世界教化十方众生。阿罗汉涅槃以后，就不会再有色身五蕴了，所以阿罗汉涅槃以后没有解脱色，他们的涅槃不是究竟自在的，解脱不彻底。</p><p>佛有五蕴，却是解脱的，解脱色能被众生肉眼所见，不被世间任何法系缚。众生虽然也有五蕴，却被世间法系缚着，所以不得解脱。心解脱，色身就解脱，五蕴都解脱。所以解脱不是非要灭掉色身五蕴，而是要灭去不如理如法的心念和知见，心念转为如理如实的知见见地，就解脱了。</p><p>十、处世之道</p><p>每个人的眼睛都是这样的，就是白色的兵乓球上镶嵌个猫眼，一个机械化装置而已，不要当真。如果有人对你含情脉脉，那就是兵乓球出水了，从猫眼里流出来的，没关系，不能形成大河淹死你，也不会倾丘倒岳冲走你，不用理；如果有人给你送秋波，那就是兵乓球放光了，从猫眼里投射出来的，也不用理，大自然之光比这温暖；如果有人对你怒目而视，这就是兵乓球发火了，从猫眼里冒出来的，不用怕，烧不着你，也不会成为燎原烈火，不理自然就会熄灭的。</p><p>爱我恨我，无关我事，我自悠然自在。看淡一切，心静如水，我不着相，天下无事，天地自宽。若到连天地也看不见时，真的就解脱了，多好！</p><p>十一、断除了俱生我执的阿罗汉永远不会是在家人</p><p>问：有一种观点认为，断了俱生我执就心无挂碍了，不再对自己及亲人的生死有畏怖，不再对自已财产的损失有畏饰。这当然获得了大解脱，但这种情况对一个并不打算出家的在家居士合适吗？真修到这境界，似乎很多工作没法干了吧？</p><p>答：首先来说，如果断尽了俱生我执的人在小乘是四果大阿罗汉，在大乘是八地菩萨。而在家人是不可能修到四果大阿罗汉的，在家人最高只能修到三果，修到三果是非常不容易的，三果人在世俗里几乎对世间法都不感兴趣，一定会想办法出家的，而且出家的机缘非常多，对家更是不感兴趣，也忍受不了了，如果不出家多数人都是随缘度日，但还是有一部分执著没有断除，对于居家生活和工作也是随缘的，执著性不大。</p><p>而大乘的四果阿罗汉处于八地菩萨果位，他们一般是不会到娑婆世界来的，即使来此世界，他们也不会过居家的那种世俗生活，比如养家糊口去工作，这是根本不可能的事，他们的福德无比广大，怎么能有做世俗工作来度日这么低俗事呢？度众生事业都是随缘，没有一丝执著，为什么还要屈尊于工作和养家？其实在娑婆世界找个初地菩萨和三果人都非常难得了，地上菩萨一般都不会居家，都会出家度众，除非菩萨太多，用不着都出家做众生的表率。</p></div>"
},{
    "title": "第六章 俱舍论第二十三卷（四加行）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  俱舍论第二十三卷（四加行）</strong></p><p>本卷讲述瑜伽行者在修习声闻四念住的过程中，所出生的四种善根：暖法善根、顶法善根、忍法善根和世第一法善根，这四善根也是声闻见道之前的四加行位。在作以如此四加行之后，就会获得法眼净，证得初果乃至四果。如果不修四念住，修习其它四圣谛法如白骨观等等，也都会出生此四善根，处四加行位，最后才能见道证果。   </p><p>在四种善根中，得暖法善根者，虽然还能退转，断掉善根，或者能造无间地狱业，以至于死入恶道，但在六道轮回中不至于流转很久就能达到涅槃。得顶法善根者，虽然也有退转，但善根不失，毕竟不断，还会增加善根。得忍法善根者，善根有增无退，命终不再住在异生位，不再造无间地狱业，不堕入恶道中，不会有卵生和湿生，也不会出生在无想天和北俱芦洲以及大梵天处，不会生为黄门和阴阳人，也不会第八次出生在三界中，见道所断惑终究不会再出现。得世第一法善根者，虽然暂时还住在异生位，但却能趣入正性离生，必得见道离开生死苦。</p><p><strong>第一节  暖善根和顶善根</strong>　</p><p>原文：<strong>颂曰。彼居法念住。总观四所缘。修非常及苦空。非我行相。论曰。彼观行者。居缘总杂。法念住中。总观所缘。身等四境。修四行相。所谓非常。苦空非我。修此观已。生何善根。</strong></p><p>释：有颂曰：正处于修习四念住中法念住的行者，应该从总体上来观行身受心法四个所缘境，来观行身受心法的苦空无常无我的行相。有论说：观行四念住的行者，所触对的缘有总有杂，在观行法念住时，要从总体上来观行所缘的身受心法四个所缘境界，修习苦谛的四种行相：苦空无常无我。这样修习了法念住的观行之后，能生出什么善根呢？</p><p>这里的意思是说，在修习法念住阶段，从总体上观行身受心法所缘境，就会生出四善根，名为四加行，在见道之前才开始修四加行，在修习法念住之前四善根还不能出现，因为机缘还不到，善根不成熟的缘故。</p><p>原文：<strong>颂曰：从此生暖法。具观四圣谛。修十六行相。次生顶亦然。如是二善根。皆初法后四。次忍唯法念。下中品同顶。上唯观欲苦。一行一刹那。世第一亦然。皆慧五除得。</strong></p><p>释：有偈颂说：修习四念住的苦空无常无我之后，会生出暖法，有暖法善根能具足观行四圣谛，修习十六种行相：苦谛四行相、集谛四行相、灭谛四行相、道谛四行相。继续修习法念住之后也是这样再生出顶法，也具足观行四圣谛，修习十六种行相。暖法和顶法两个善根，都是最初修习法念住，从总体上观行身、受、心、法四个所缘境，后又修习四圣谛修习出来的。</p><p>再之后的忍法善根，只修习法念住就能生出来。忍法的下品和中品善根与顶法善根观行的所缘是一样的，忍法的上品善根，只观行欲界的苦，五行阴中的每一行每一刹那都要观行其苦谛。世间第一法这个善根也是这样，都是只修习法念住的时候出生的，下品和中品观行的所缘与顶法也是一样的，上品只观欲界苦。四种善根都是以慧为体，是智慧的体性，除了第五种得法得道者的善根。</p><p>十六种行相就是修习四圣谛之后出现的行相，其中苦圣谛要观察四念住的苦、空、无常、无我性，具这四种行相；集圣谛要观察集谛的因、集、起、缘四行相；灭圣谛要观察灭谛的灭、静、妙、离四行相；道圣谛要观察道谛的道、如、行、出四行相。暖法和顶法善根的修习中，都要修十六种行相，其中的观行智慧是逐渐深细的，禅定也是逐渐深入的，定慧的层次是逐渐深入的，直到修到第四善根世间第一法圆满以后，定慧具足，才能见道。</p><p>原文：<strong>论曰。修习总缘共相法念住。渐次成熟。乃至上上品。从此念住后。有顺决择分。初善根生。名为暖法。此法如暖。立暖法名。是能烧惑薪。圣道火前相。如火前相故。名为暖。</strong></p><p>释：有论说：总缘一切众生的共相修习法念住，其智慧能够渐次地成熟，直至达到上上品。修习完法念住之后，就会生出顺决择分，顺从于四圣谛理，有最初的善根出生，这种善根叫作暖法。这种智慧如温暖相，心被四圣谛所熏，趣向于四圣谛，所以取名为暖法。暖法譬如能够烧坏烦恼惑的薪材，是圣道火出现之前的相貌，就像火燃烧之前的状态一样，叫作暖。</p><p>把见道比喻为火相现前，材薪燃烧义，在火出现之前，最初要发生温度的变化，温度升高，暖度出现，这时候相当于暖法善根。随着温度不断地升高，热量达到一定程度，材薪燃烧，火就出现了。这中间次第经过顶法善根、忍法善根和世间第一法善根，之后就能见道了。暖法的出现，说明行者通过修习四念住和四圣谛，心已经发生了变化，能够随顺于四圣谛理生起了顺决择分，不再抗拒和违背四圣谛理，也相当于初步接受了四圣谛理，并且受熏了。</p><p>原文：<strong>此暖善根分位长故。能具观察四圣谛境。及能具修十六行相。观苦圣谛。修四行相。一非常二苦。三空四非我。观集圣谛。修四行相。一因二集。三生四缘。观灭圣谛。修四行相。一灭二静。三妙四离。观道圣谛。修四行相。一道二如。三行四出。此相差别。如后当辩。</strong></p><p>释：这个暖法善根所经历的修习阶段比较长的缘故，就是所处的分位长的缘故，在暖法善根现前阶段，能具足观察四圣谛的全部真实境界，以及能够具足修行十六行相。意思就是说，只观察了苦谛，还不能出现暖法善根，只观察了苦谛和集谛也是不能出现暖善根，再观察灭谛还是不能出现暖法善根，只有把四圣谛全部作以观察之后，才能出现暖法善根。</p><p>观察五蕴的苦圣谛，修行四种行相：无常、苦、空、无我；观察五蕴的集圣谛，修行四种行相：苦集起的因、苦是如何招集起来的、苦集是如何出生的、苦是以什么为缘而出生的；观察灭圣谛，修行四种行相：苦是如何息灭的、苦灭了以后是寂静的、寂静是最微妙的境界、寂静以后就离苦；观察道圣谛，修行四种行相：观察灭苦所修的道、所修之道契合真实之理、身口意行契合四圣谛理趣向涅槃、出离三界永远得解脱。这里所涉及到的所有修习内容都有差别，这些差别相以后再辩论。</p><p>原文：<strong>此暖善根。下中上品。渐次增长。至成满时。有善根生。名为顶法。此转胜故。更立异名。动善根中。此法最胜。如人顶故。名为顶法。或由此是。进退两际。如山顶故。说名为顶。此亦如暖。具观四谛。及能具修。十六行相。</strong></p><p>释：当这种暖法善根由下品至中品，再由中品至上品，渐渐增长到圆满的时候，就有另外的善根生发出来，叫作顶法善根。当顶法善根越来越殊胜的时候，就更换成别的名字。在这不断增长的善根中，顶法是最超胜的，就像人的头顶一样，就取名为顶法。取名为顶法，也是因为顶法处于进退两者之间，前是进，后是退，顶法犹如山顶，所以就名为顶法。在顶法善根阶段也如暖法一样，能具足观察四圣谛，以及能具足修行十六行相。</p><p>原文：<strong>如是暖顶二种善根。初安足时。唯法念住。以何义故。名初安足。谓随何善根。以十六行相。最初游践四圣谛迹。后增进时。具四念住。诸先所得。后不现前。于彼不生钦重心故。</strong></p><p>释：这样的暖法和顶法两个善根，在最初出生的时候，只有在修习法念住的时候才会出现。因为什么缘故说是初安足呢？这意思是说伴随着什么样的善根，以十六种行相最开始进入四圣谛的观行。在暖、顶法善根增进之后，就具足了四念住的修习。在这之前所修得的法，以后就不再现前了，因为对于先前修的那些法，心里不会生起特别看重的心思，因为那些法都比较粗浅，已经越过去不用修了。</p><p><strong>第二节  忍善根和世第一善根</strong><br/></p><p>原文：<strong>此顶善根。下中上品。渐次增长。至成满时。有善根生。名为忍法。于四谛理。能忍可中。此最胜故。又此位忍。无退堕故。名为忍法。此忍善根。安足增进。皆法念住。与前有别。然此忍法。有下中上。下中二品。与顶法同。谓具观察。四圣谛境。及能具修。十六行相。</strong></p><p>释：当顶法善根由下品至中品，再由中品至上品，渐渐增长到成熟圆满时，就会有其它善根生出来，名为忍法。对于苦集灭道四圣谛理能忍可的善根中，此忍法是最胜的缘故，所以就叫作忍法。又因为此忍位不再退堕回去的缘故，名为忍法。在四圣谛理的修习过程中，能容忍、安忍、忍可、认可四圣谛理的，属忍法善根最胜品，在此忍位，心对四圣谛理没有退堕，所以名为忍法。</p><p>此忍法善根最初出生和逐渐增进，都是在修法念住的时候出现的，修前边三个念住，还不能出生忍法善根，忍法善根不是杂修出来的，这就与前边的暖和顶善根有所区别了。此忍法善根也分为下中上三品，下、中二品与顶法相同，都具足观察四圣谛理，以及能具足修习十六行相。</p><p>由上文可知，忍法善根不会退回去不认四圣谛理，暖法和顶法善根有可能会退回去，就是说已经出生的顺决择分可能会失去，内心里不再有顺决择分，不再随顺四圣谛理，不接受苦集灭道之理。智慧有所退堕，其中原因有很多，任何因缘都可能致使智慧退堕，业障大的也有可能不再信佛学佛。但等业障关过去以后，也许还会重新燃起学佛修行的勇气和信心，也有可能再次修出暖法和顶法善根，但修到忍法善根的时候是不会退回去了。</p><p>因为四种善根都属于修慧，是修行所获得的智慧，所以闻慧和思慧是能够退堕的，是不坚固的，修慧的前部分也是能够退堕的，是不坚固的。到修慧的后期，智慧才坚固，不会退堕了，那么一旦见道实证以后，就更不会退堕了。见道以后，禅定有可能会退，但见道的智慧永远不退，果位就不会退。修到三果的时候，初禅定也许会退，不能永远保持下去，但是三果的解脱智慧和功德永远不会退，果位就不退。在见道之前，禅定也许不退，但智慧有可能退，只要智慧退，善根就退了，不管禅定如何。</p><p>原文：<strong>上品有异。唯观欲苦。与世第一。相邻接故。由此义准。暖等善根。皆能具缘三界苦等。义已成立。无简别故。谓瑜伽师于色无色。对治道等。一一圣谛。行相所缘。渐减渐略。乃至但有二念作意。思惟欲界苦圣谛境。齐此以前。名中忍位。从此位无间。起胜善根。一行一刹那。名上品忍。此善根起。不相续故。上品忍无间。生世第一法。</strong></p><p>释：忍法善根的上品与顶法有差别，上品只观察欲界的苦，与世间第一法紧紧相邻，由这个义理就能确定，在出现暖顶忍等善根时，都能具足缘三界的苦等四圣谛，这个义理在心中已经建立起来，就不用再加以拣别了。于是瑜伽行者对于色界和无色界修道的四圣谛对治方法，每个圣谛的行相所缘就逐渐地减少和简略，乃至于最后只有两个念的作意，来思惟欲界的苦圣谛境界。</p><p>在这以前名为中忍位，从中忍位开始无间断地生起更殊胜的善根，每一行每一刹那都称作上品忍。在忍法最初生起的时候，善根是不相续的，修到上品忍时，善根就无间断了，这时候就出生了世间第一法。</p><p>原文：<strong>如上品忍。缘欲苦谛。修一行相。唯一刹那。此有漏故。名为世间。是最胜故。名为第一。此有漏法。世间中胜。是故名为。世第一法。有士用力。离同类因。引圣道生。故名最胜。</strong></p><p>释：世第一法和上品忍一样，都缘于欲界的苦圣谛，修完十六种行相中的每一个行相，只要一刹那的时间就完成了，但因为这个善根是有漏的，所以就名为世间，因为是在世间中最殊胜的，就名为第一。这个有漏法是世间中最殊胜的，因此就说为是世间第一法。此世第一法有大的利用，是离开凡夫同类的因，能引生圣道，所以名为最胜。</p><p>世第一法虽然还是属于世间里的法，但却是世间法里最殊胜的，再以后就是出世间法的证圣预流果了，出世间就是走向解脱，渐离三界，渐趣涅槃。所以四加行是见道前的冲刺阶段，也是准备阶段。</p><p>原文：<strong>如是暖等。四种善根。念住性故。皆慧为体。若并助伴。皆五蕴性。然除彼得。勿诸圣者。暖等善根。重现前故。此中暖法。初安足时。缘三谛法。念住现在。修未来四。随一行相。修未来四。缘灭谛法。念住现在。修未来一。随一行相现在。修未来四。</strong></p><p>释：如是暖顶忍世间第一四种善根，因为都有念住的缘故，因此都以智慧为体，具有智慧性。四善根如果和助伴合一起，都属于五蕴性，是识蕴所具有的善根和智慧。但除去得法得道者，其余还不属于诸圣贤者，因为暖等四善根又重新现前，处于加行位的缘故，四善根之后的见道者才属于圣者。其中的暖法最初出现的时候，是缘着苦集灭三圣谛法，念住在现在的身受心法，修未来世的身受心法，随着四圣谛每一谛中的每一个行相，修未来世的身受心法；又缘着灭谛一法，念住在现在的身受心法，修未来世的法念住，随着四圣谛中任何一个现在的行相，修未来世的身受心法。</p><p>原文：<strong>由此种性。先未曾得。要同分者。方能修故。后增进时缘三谛。随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法。念住现在。修未来四。随一行相现在。修未来十六。由此种性。先已曾得。不同分者。亦能修故。</strong></p><p>释：因为此声闻种姓的人，先前并没有得过暖法，要具有同样善根者才能修习暖法。在后时善根增进时缘于苦集灭三谛，随着现前的一念住，修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。缘于灭谛法，在现前念住修习未来的四念住，随着灭谛的每一行相，修习未来的十六行相。由于此种姓先前已经得到暖法的缘故，处于不同分位的人，也能修习。</p><p>原文：<strong>顶初安足。缘四谛法。念住现在。修未来四。随一行相现在。修未来十六。后增进时。缘三谛。随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法。念住现在。修未来四。随一行相现在。修未来十六。</strong></p><p>释：顶法善根刚刚生起的时候，是缘于四圣谛法，念住现前的法修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。在后来增进时，缘于苦集灭三谛法，随着现前的一念住，修习未来的四念住，随着现前的每一行相，修习未来的十六行相。缘于灭谛，在现前的念住中，修习未来的四念住，随着灭谛现前的每一行相，修习未来的十六行相。</p><p>原文：<strong>忍初安足。及后增进。缘四谛法。念住现在。修未来四。随一行相现在。修未来十六。然于增进。略所缘时。随略彼所缘。不修彼行相。世第一法。缘欲苦谛法。念住现在。修未来四。随一行相现在。修未来四。无异分故。似见道故。</strong></p><p>释：忍法最初生起的时候，以及后来增进的时候，缘于四圣谛法，在现前的念住中，修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。但是忍法增进以后，略过一些所缘法的时候，随着所略过的所缘法，就不再修此法的行相。世第一法缘于欲界的苦圣谛，在现前的念住中，修习未来的四念住，随着苦谛现前的每一行相，修习未来的四行相。因为再也没有其它分位的缘故，在此位就与见道位比较相似，但毕竟还不是见道。</p><p>原文：<strong>论曰。此暖顶忍。世第一法。四殊胜善根。名顺决择分。依何义建立顺决择分名。决谓决断。择谓简择。决断简择，谓诸圣道。以诸圣道。能断疑故。及能分别。四谛相故。分谓分段。此言意显。所顺唯是见道一分。决择之分。故得决择分名。此四为缘。引决择分。顺益彼故。得顺彼名故。此名为顺决择分。如是四种。皆修所成。非闻思所成。唯等引地故。</strong></p><p>释：有论说：此暖顶忍世第一法四种殊胜善根，名为顺决择分。这是依何义理建立的顺决择分名字？决就是决断的意思；择是拣择分别的意思。决断拣择诸圣道法，因为诸圣道能断除疑惘，以及能分别四圣谛的相貌的缘故。分是分段的意思，言语已经显示出了意趣。所顺的只是见道的一分，抉择之分位，所以立为抉择分名字。</p><p>以暖顶忍世第一法四善根为缘，引发抉择分，顺从增益圣道的缘故，就得了顺从抉择分之名，所以才叫作顺决择分。如是四种善根都是修所成慧，不是闻所成慧和思所成慧，唯独是等引地所摄。</p></div>"
},{
    "title": "第七章 俱舍论第二十三卷（证果所应断除的烦恼）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  俱舍论第二十三卷（证果所应断除的烦恼） </strong></p><p><strong><span>第一节  初果所应断除的烦恼</span></strong></p><p>一、原文：<strong>由于修惑具断有殊。立为三向。谓彼二圣。若于先时。未以世道。断修断惑。名为具缚。</strong></p><p>释：修行解脱道的人，由于在修行过程中所应该断除的烦恼惑差别很大，就把断除烦恼惑业的人立名为三个果向，分别是初果向、二果向和三果四果向。顿根的信行人和利根的法行人两种修圣道的人，如果在先前没有在世间道善法中，断除修道所断的烦恼惑，这个人就是具足一切烦恼的凡夫。</p><p>这个意思是说修道是从凡夫开始修行的，凡夫也要断除相应的烦恼惑，每个凡夫众生都要经过种种修道过程，最初肯定是修世间法，在世间法断恶修善，修行的内容四正勤，四正勤没有修足，就不能断除烦恼惑，那就是具足烦恼结缚的凡夫。凡夫在见道前主要以修三十七道品为主，三十七道品包括七觉分和八正道，七觉分中有定觉分，定觉分具足了，就会降伏和断除欲界中下品烦恼。</p><p>八正道中也有正定，正定具足以后，也会降伏和断除欲界中的下品烦恼。三十七道品具足修，戒定慧就会圆满，见道的条件才能具足，遇到因缘才能得法眼净，证得初果。如果不具足这些修道的条件，因缘也不会具足，那就不可能见道。很多人越过这个修行阶段而说见道证初果，那就是误会的见道，大妄语而已。</p><p>俱舍论原文：<strong>或先已断。欲界一品。乃至五品。至此位中名初果向。趣初果故。言初果者。谓预流果。此于一切沙门果中。必初得故。</strong></p><p>释：修解脱道的人，有的人是先前已经断除了欲界第一品至第五品烦恼惑，这时候就可以说这个人就是初果向，因为能趣向于初果的缘故，就叫作初果向，不久就会证得初果法眼净。初果也叫作预流果，在一切出家沙门果中一定是最先证得的果位。</p><p>初果向断除了欲界五品烦恼惑，然后才能证得初果。意思是说在凡夫位的初果向就要断除欲界五品烦恼惑。凡夫凭什么能断除五品烦恼惑呢？如上边所说，凡夫在修道过程中，要修三十七道品，要断恶修善，修善就能断恶，断恶就是断除欲界五品烦恼，如果只修善没有欲界未到地定，或者欲界未到地定不具足，也不能断除五品惑，就不能成为初果向人。修行未到地定就是七觉分中的定觉分，就是八正道中的正定，如果欲界的未到地定不足，正定就不具足，八正道的修道就不具足，没有正道可说。</p><p>所以有些人所说的初果二果见道不必有禅定，不必有未到地定，甚至说不用修定就能证果，这个言论严重的违背了七觉分和八正道之理，违背了证果之真实理，更违背了世尊和弥勒菩萨诸佛菩萨的教导，所说的证果无有其事，无有其实，这是轻视佛法的修证。也证明其没有经过三十七道品的实际修行阶段，对于修行比较盲目，臆测的成分比较多。末法时期好多的善知识，确实是只善于知识的收集和散播，不懂得修证之理。</p><p>二、初果所断除的粗重烦恼是指什么？</p><p>每一种法，都有粗相和细相之分，粗相是比较明显显著的，一下子就能看得见，感觉得到的，细相是在粗相之后显现，不容易辨别，需要仔细细心才能看得见，感觉得出来。世出世间法都是分为粗略的部分和细微的部分，乃至于识心也分为粗和细。</p><p>烦恼既然是法，而且是心法，也分为粗和细部分，粗烦恼是指粗重的烦恼，是指烦恼中比较明显的部分，容易觉察的内容，重是严重的意思，明显的粗略的烦恼一定是比较严重的烦恼，或者是很重的烦恼，大家都能看得出来，感觉得到的部分，是不应该存在，不被世间人接受和允许的部分，是应该最先断除的烦恼。既然世间人都接受不了的粗重烦恼，在修行界里，尤其是在圣贤法界里，就更不允许存在和现行出来。</p><p>贪嗔痴慢疑恶见，这六个根本烦恼，每个烦恼都分为粗和细两大部分，其中细烦恼还可以再细分。粗细都是相对而说，去掉最粗部分，细的那部分也分为粗细，乃至于不断地细分下去，到最后再也分不了的烦恼，是最细极细的烦恼，这部分烦恼凡夫根本无法发现和分辨，乃至于几地菩萨恐怕也发现分辨不了，那是八地以上菩萨才能断除的。比较细一些的烦恼，凡夫因为智慧不足，自己也没有断除，也发现不了，分辨不出来，即使是初证果明心的人，也分辨不出来，经验智慧不足故。</p><p>所有的烦恼粗略的可分为上中下三品，每一品还可以再分为上中下三品。上品烦恼比较明显，比较显著，比较严重，是最应该先断除的，是最不应该存在的，名为粗重烦恼。这是在四圣谛修习过程中，在初果向阶段就应该断除的，只有粗重的上品烦恼断除了，才能有机缘成为初果预流果，否则连初果向都不能证得，何况初果至四果。</p><p>比如贪烦恼，可以分为粗细九品，如果再细分还可以再分，最粗部分的贪，非常严重，或者是比较严重，一般人都看得出来，感觉得到，容忍不了，这就不应该存在了，如果还存在，那就是烦恼重的凡夫。比如对于钱财方面的大贪，对于男女欲和感情方面的大贪，对于色身的大贪，对于名闻利养的大贪等等，方方面面说不尽。其它烦恼也是这样，严重而明显的部分都属于粗重烦恼，都必须在初果或者是初果向之时断除。</p><p>如果一个人说自己证果了，明心见性了，可是他的烦恼还很重，还很明显，很容易被人发现，让人接受不了，我们就可以判断这个人是大妄语了。尽管这个人理论一大套一大套的，讲起法来口若悬河，口吐莲花，但根据他的身口意行表现出来的烦恼，就可以断定，他就是凡夫，不用管他的口才和理论水平，理论知识并不代表实际证量。</p><p>如果一个人说我证得了什么什么果位，然后说给别人听，如果别人存疑，他就非常烦恼，起嗔心，恼怒别人，谩骂报复别人，与人结恶，那就可以断定这个人并没有证得什么什么，因为他的烦恼太粗重了，甚至都超过普通的凡夫。那些依仗自己所学的法，而鄙视众人，诋毁和打击众人，恃强凌弱的人，基本上可以断定，都是有粗重烦恼的凡夫。</p><p>三、问：须陀洹果断除了五蕴身为我、为我所的知见，是否是断除意根为我的知见？</p><p>答：初果断除我见，是意根和意识都断的，二者都认可了五蕴苦空无常无我。但是初果断我见并不彻底，二果断我见更深入一些，所以才达到淡薄贪嗔痴烦恼，三果断我见更深入一些，所以才能断除贪嗔痴烦恼，到四果时才把我见彻底断除，我慢我执才能断尽，世间法一丝毫都不沾染，有能力取无余涅槃。也就是说，在把所有一切烦恼都断尽时，才会证得四果阿罗汉，而四果阿罗汉是无学位，不用再修什么法了，不用再断什么烦恼了。</p><p>初果虽然还有贪嗔痴，不是薄贪嗔痴，但是初果的断我见功德能使得贪嗔痴烦恼得到有效的降伏，不像凡夫一样贪嗔痴明显和容易现行。初果在修道过程中，把三十七道品都修完了，八正道具足，说明心地是正直良善的，走在修行的正道上；四正勤修完了，说明初果人烦恼恶习得到降伏，不轻易出现了，善法已经建立起来了，并且具足初果人的善，以断恶修善的功德，具足了初果人的解脱功德受用，不像有些没有实际证果的人说初果人与凡夫具有同样的贪嗔痴烦恼，这是严重诽谤初果人的言行，实际根本不是这么回事。                       </p><p>如果谁遇到了与凡夫贪嗔痴烦恼一样重的初果人，就可以断定这个人是假初果人，是冒充初果的凡夫人。如今世间骗术盛行，佛教里骗术也很多，个别人是有意，大多数人是无意，只不过是我心重，太抬举自己了，眼睛不向内看自己，不会检查和反观自己，好出人头地，好与人争高低，结果反倒害了自己。命终以后因为大妄语自动投到地狱中。                        </p><p>为什么大妄语业罪这样严重？楞严经里佛说的，譬如穷人妄称帝王，被王抓捕，斩首示众，九族诛灭。在佛教里凡夫冒充圣人，比世间法里冒充帝王罪业还大，圣人远远优胜于帝王，冒充圣人扰乱佛教，混淆视听，让众生分不清圣凡，佛教修证次序就乱了。冒充圣人是波罗夷罪，断头罪，死后就要入地狱中受罚赎罪。</p><p>四、初果所断的见惑</p><p>禅定从未到地定开始都能对治烦恼，能降伏烦恼，只有降伏了烦恼，去除或者减轻了遮障，才能证得初果。初果人虽然只有见地，只断了见所断的烦恼，但是断除烦恼和三缚结，一定需要有未到地定。虽然未到地定需要修定才能发起，但是见所断烦恼也经过了四加行的修行，以及三十七道品的修行，所以才能在见道时断除一部分欲界烦恼。初果在见道时虽然断了见惑，但还有思惑烦恼没有断，所以还需要继续修道，才能断尽烦恼。思惑烦恼是在见道以后通过进一步的修道才能渐次断除，也属于二果和三果四果人的见地，见地越透彻，越到位，我和我所断除的程度越深，心越空，烦恼越轻微。</p><p>初果的见惑虽然是初次见道时所断，但是初次见道，也是渐次修道的结果，不修就不能断除见惑。修道的内容就是三十七道品和四加行，三十七道品其中之一就是禅定，不修三十七道品或者三十七道品修不满足，就不能见道，更不能断见惑。所以未到地定就是初果人见道所应具足的必要条件。</p><p>在初果见道之前，必须把从前的贪嗔痴烦恼降伏到一定程度，断除粗重部分，使得贪嗔痴烦恼不至于遮障行者见道。在三十七道品的修行过程中，把极重的贪嗔痴烦恼逐渐降伏下来，烦恼逐渐微薄，心逐渐柔软，智慧逐渐明朗，所有的遮障犹如密布的乌云渐渐稀薄，智慧的阳光才能透过云彩显现出来，于是就见道了。在见道之前的烦恼淡薄微薄，只是与从前严重的烦恼相对而言，不是二果时贪嗔痴淡薄的那种程度，二者是有差别的，都是从相对性的角度来说的，词汇虽然相同，内涵绝对不同，所以二者不能混淆不分。</p><p>四圣谛：苦圣谛、苦集圣谛、苦灭圣谛、苦灭道圣谛。其中苦灭道圣谛就是修道的真理，所依据的理论。这个理论的修学，从初果之前就开始了，一直到证得四果阿罗汉。所以修道并不是见道以后才开始的，是在接触四圣谛的时候就开始修道了，在最初修行四念处观的时候就开始修道了，不修如何见道呢？三十七道品中的四正勤：一、已生恶法令断；二、未生恶法令不生；三、未生善法令生；四、已生善法令增长。这些修善灭恶的修道内容正是对治众生烦恼的，对治之后降伏了烦恼，使之轻微，才能见道。</p><p><strong><span>第二节  修道所断的三界八十一品思惑</span></strong><br/></p><p>原文：<strong>地地失德九。下中上各三。论曰。失谓过失。即所治障。德谓功德。即能治道。如先已辩。欲修断惑九品差别。如是上地。乃至有顶。例亦应尔。如所断障一一地中各有九品。诸能治道。无间解脱九品亦然。</strong></p><p>释：三界中每一地的过失和功德总共有九种，九种当中又各分为下中上三种，粗略分为二十七种，每一种又各自分为下中上三种，故众生所有思惑烦恼就细分为八十一种。</p><p>失就是过失，众生的过失就是贪嗔痴烦恼，是修道所对治的烦恼障碍。德就是功德，是能对治烦恼思惑的修道所获得的功德。如果想要修行断除烦恼惑的九品差别，就要修道，修道就要修定，无定不能断惑。从欲界到三界顶的非想非非想天，每地都有九品烦恼过失需要断除，那么能对治各品烦恼过失的修道也就分为九品，三界一切地的九品思惑断尽，就获得了无间断的解脱。</p><p>所谓无间断的解脱，就是身心在每一刹那都是解脱的，在每个法上都是解脱的，无论任何时候都是解脱的，这种解脱就不是意识单独所能获得的，而是最终由意根获得的，意根解脱一切解脱，意根不解脱，一切都不解脱。意根如果解脱，修道就要深深修到意根，修到意根这种深度，一定要修定，没有定就到达不了意根这里，意根就不能获得智慧，没有智慧就不能解脱。所以解脱就是定慧等持，不是意识的乾慧所能办得到的。</p><p>三界总共分为九地：欲界、色界初禅天、二禅天、三禅天、四禅天、无色界空无边处天、识无边处天、无所有处天、非想非非想天。每一地都有相对应的禅定境界，每一种禅定都能对治相应的烦恼思惑，这就是修道的功德。而思惑就是过失，其过失由禅定加以对治，禅定出现修行的功德就会出现，以其禅定功德对治烦恼思惑，其后就会以此功德证果，当然其中会有由禅定引生出的解脱的智慧证量，合起来才能解脱。</p><p>九地就有相应的九品思惑，欲界的贪嗔痴粗略分为下、中、上三品，每一品又分为下中上三品，共为九品：下下1、下中2、下上3；中下4、中中5、中上6；上下7、上中8、上上9。这九种思惑要在欲界定中和初禅定中了断，没有禅定一品都不能了断，就不能得初果向，更不能得初果。越过禅定的修行，就不叫作修行了，无论学多少理论知识，断不了思惑就抵挡不了生死苦，必随业生死漂流。从这里看出，修定的功德是极大的，是不能越过去的，畏难避重就轻是解决不了问题的。而修定就离不开戒律的严持，不守戒不持戒，禅定修不出来，就不是修道，就不会有功德，烦恼过失就不会减轻减少，命终就会随着烦恼惑业三恶道流转。</p><p>初禅天贪嗔痴思惑分为下、中、上三品，每一品又分为下中上三品，共九品：下下1、下中2、下上3；中下4、中中5、中上6；上下7、上中8、上上9。同理，二禅天贪嗔痴思惑分为：下下1、下中2、下上3；中下4、中中5、中上6；上下7、上中8、上上9。三禅天、四禅天、空无边处天、识无边处、无所有处天、非想非非想天都有相应的九品思惑，合起来就是八十一种思惑烦恼。</p><p>原文：<strong>应知此中下下品道势力。能断上上品障。如是乃至上上品道势力。能断下下品障。上上品等诸能治德。初未有故。此德有时。上上品等失已无故。如浣衣位粗垢先除。于后后时渐除细垢。又如粗闇。小明能灭。要以大明方灭细闇。</strong></p><p>释：修道人应该了解，下下品道的势力，能断除上上品的烦恼障，上上品道的势力也能断除下下品烦恼障。上上品能对治的德，刚开始修道的时候，还没有出现，一旦出现了，上上品的过失就没有了，上上品的思惑已经断了。比如说洗涤衣物的时候，应该是比较粗的污垢先除去，之后才能渐渐除去细腻的污垢。又比如说，粗重的黑暗，小小的光明就能灭除，深细的黑暗必须要用大的光明才能灭除，细暗灭除，才是通亮没有黑暗的。</p><p>原文：<strong>失德相对理亦应然。白法力强。黑法力劣故。刹那顷劣道现行。无始时来展转增益上品诸惑。能令顿断。如经久时所集众病。服少良药能令顿愈。又如长时所集大闇。一刹那顷小灯能灭。</strong></p><p>释：过失和功德相对应的理也是这样，由于善法力强恶法力劣的缘故，在一刹那的时间里，最低浅的道就现前了，众生无始劫以来所不断增益的上品贪嗔痴烦恼惑，顿时就能断除掉。就像历经很久所集起的疾病，服用少量的药就能令病顿时痊愈。又像长时间所集聚起的大闇，一刹那的时间用小灯就能灭除了。</p><p>能对治烦恼过失的道，就是德，也就是修道所发起的功德。修道的功德包括戒定慧，三者缺一不可。戒也可以与定一样分为下中上品，乃至于慧也可以分为下中上品。因为持戒，心得到有效的约束，就不散乱，这样配合修定的功夫，禅定就会出现，由于有禅定，所接触的四圣谛理以及大乘之理，就会入心并且融通，智慧就出现了。戒律越严守持得越好，禅定就越深，禅定越深，法义就越入心，义理就越融通，烦恼就越轻，德就越大。所以说持戒是德，禅定是德，智慧是德，德不仅是功德的德，也是福德的德，以此德后世得以托生善道。德也是根器，是载道之根本器具，有德就有道，有道就解脱。</p><p>道和德合一起，就是道德，德高望重，道德高尚之人，其名望自然重，不用特意宣传，其德自然感召，譬如花香，自然引蝶。有道和德之人，下品之人所不能动，动之即受损，因果不许，德也不许，大动大损，小动小损，现世花报，后世果报，避之不得，道德巍巍故。譬如国王位尊权重，辱之或入牢或斩首，甚至株连九族，势力盛故。</p><p><strong>第三节  二果所应断的烦恼</strong></p><p>原文：<strong>若先已断。欲界六品。或七八品。至此位中名第二果向。趣第二果故。第二果者。谓一来果。遍得果中。此第二故。</strong></p><p>释：如果先前已经断除了欲界六品的思惑，或者是七八品思惑，修到这个位中就是二果向，能趣向于二果。第二果就是一来果，人间天上各一次往来，便无余涅槃。在一切所应得的果位中，一来果排在第二位次，所以叫作二果。</p><p>欲界的六七八三品思惑，比前五品思惑深细一些，难断一些，一旦修断，断德就会高一些，果位当然就高于五品断德的初果向和初果。欲界的九品烦恼思惑，都是与欲界里的法有关，是对于欲界的色声香味触法的贪嗔痴烦恼，对于欲界的饮食、衣具、生活资具的贪嗔痴烦恼，对于男女欲的贪嗔痴烦恼。第一品的下下品烦恼惑，是最粗重的，最浑浊的，最低劣的，过失最重的，最不应该具有的，最应该去除的。二品次之，三品更次之，直至五品，修断以后，就是初果向，介于凡夫与初果之间，属于凡夫所摄，不免三恶道流转，但是去三恶道的几率减少极多，到达初果位之后才能完全灭除三恶道流转之苦。</p><p>若想断除欲界五品烦恼惑，就要持戒修定，欲界定生起，就会降伏和断除五品思惑烦恼。断除此烦恼惑，继续持戒修定，生起观行智慧，证得五阴苦空无常无我，三昧出现，得法眼净，得初果。其中禅定是关键，如果没有欲界的未到地定，一切烦恼惑不得降伏和断除，初果向也不会获得。</p><p>未到地定为什么能断除五品思惑呢？因为定是定心的，先定身，只有身定了，心才能随后定，心定了，心就伏住了，少趣向于色声香味触法，烦恼自然就断。二果向和二果所断的烦恼惑，比初果向和初果所断的烦恼惑要细微一些、深一些，但仍然是属于欲界的烦恼惑，还差一品就把欲界的烦恼惑断尽无余，有欲界的未到地定就能断除，色界定和无色界定就更能轻松断除了。</p><p>有人说证果和明心不必有禅定，不用断烦恼，而且还说初果的烦恼也与凡夫完全相同。这些言论正显示出此人没有真正经历过修道阶段，自己的心肯定与凡夫的烦恼相应了，那所谓的证明和明心就相当令人怀疑了。没有禅定的人，自然是不知道禅定的功德受用，自然是不会断除任何烦恼的，其烦恼当然是与凡夫相同没有区别了。可实际上却不是这样，禅定有断德，有福德有功德，是修道最重要的关键环节和助力器，没有禅定这个关键环节，断我见的智慧就不会生起，意识的理解不起决定作用，意根的智慧才是决定性的，决定着无明烦恼的存在与否，决定着后世的趣向，决定着解脱与否。</p><p>证初果相当于脱胎换骨，意根就是主心骨，什么骨头就是什么胎，意根无明烦恼不断，骨头不变就不能脱凡夫胎，中阴身里入什么胎就由意根的骨来决定。为什么禅定能让意根脱胎换骨？因为禅定降伏了六识，六识动得少而慢，意根对六识的支配调控自然就会减少，攀缘心就减弱，其心就能多住在法义上，吸收消化法义的能力增强，对法义的考量就会专注一些，就会逐渐融通法义，智慧生起，烦恼断除，得部分解脱或者是全部解脱。如果没有禅定，六识对六尘的攀缘不断，意根对六识的指挥就不断，就不能住在法义上，智慧就不能生起，烦恼不断，解脱无望。<span> </span></p><p><strong>第四节  三果所应断的烦恼惑</strong></p><p>原文：<strong>若先已离欲界九品。或先已断初定一品。乃至具离无所有处。至此位中。名第三果向。趣第三果故。第三果者。谓不还果。数准前释。</strong></p><p>释：如果在先前的修道中就已经离开了欲界的九品烦恼惑，或者是先前已经断除了色界初禅天的一品烦恼惑，乃至于全部都离开了无色界的无所有处天的烦恼惑，修到这个位中，就是三果向，能趣向三果。第三果是不还果，不会再来人间修道和取灭度，直接在五不还天取无余涅槃。</p><p>三果的解脱智慧有许多差别，以后会说到。现在说的重点是，三果向已经离开了欲界的所有烦恼惑，甚至色界初禅的第一品烦恼惑也断了，就成为三果向。离开欲界所有的烦恼惑，只依靠欲界的未到地定根本不行，还必须要有色界的初禅定，最高要有无色界的无所有处定，才能断除欲界的所有思惑。</p><p>为什么断除了欲界思惑只是三果向，而不是三果呢？因为烦恼是要先断，没有遮障了之后，才能继续观察五蕴，生起更深的见道智慧，而三果见道，才能证得三果。二果也是这样，二果向在未到地定中断除八品思惑，消除了烦恼遮障，才能更进一步的观察五蕴，生起二果的见道智慧，证得二果。初果也是这样，在凡夫位的未到地定中，断除五品思惑，消除粗劣的烦恼遮障以后，观行五蕴的苦空无常无我，获得最初断我见的智慧，证得初果。</p><p>按照这个见道标准来衡量，娑婆世界究竟有几个真正小乘见道的？如果小乘没有真正见道，五蕴不死，何来更高一些的大乘见道？原来满大街都是假见道、虚见道，所有自封和他封的果都是什么果？想想后世的果报，就会一身又一身的冷汗。为什么还有那么多人不知道害怕？愚和痴而已，见棺材竟然不知道落泪，躺在棺材里的时候，也流不出泪了，只好在三恶道里流血。</p><p>原文：<strong>次依修道。道类智时。建立众圣有差别者。颂曰。至第十六心。随三向住果名信解。见至亦由钝利别。论曰。即前随信随法行者。至第十六道类智心名为住果。不复名向。随前三向今住三果。谓前预流向今住预流果。前一来向今住一来果。前不还向今住不还果。阿罗汉果必无初得。见道无容断修惑故。</strong></p><p>释：三果向之后，再次依着修道出生道类智的时候，就出现了众多圣人的差别。修到第十六心的时候，随同三果向的断德住在三果位中，名为随信行的信解人。随法行的见至人也由于根的利钝而有差别。前边所说的随信行和随法行的人，修到第十六道出生类智的时候，名为三果的住果，舍去向果，不叫作向了。随着前边的初果向、二果向和三果向，现在住在三果中，前边是不还果向，现在是不还果。而证得阿罗汉果，却没有向，没有最初的中间果，直接证阿罗汉果，因为只要阿罗汉见道，就没有什么可修可断的了，前边三果都已经修完了，才能证得阿罗汉四果，成为无学。前三果都是有学有修有断，第四果无学无修无断。<span>                         </span></p><p><strong>第五节 四果之前所应断除的烦恼 </strong></p><p>一、阿罗汉分为慧解脱和俱解脱两种。慧解脱的阿罗汉禅定只有初禅，以解脱智慧为主，俱解脱的阿罗汉要四禅八定或者是加一个灭尽定。阿罗汉要断尽一切烦恼现行，没有初禅以上的禅定，不可能把贪嗔我慢等烦恼都断尽。证据到瑜伽师地论里有，或者阿毗达摩俱舍论里也有。</p><p>不管是什么烦恼，即使是最粗浅的烦恼，也需要有禅定才能断除，没有禅定就不能断除和降伏任何一点烦恼。而断除欲界最粗重的五品烦恼，才能成为初果向，近于初果，这都需要禅定，禅定越深，断除的烦恼越多。没有色界禅定，欲界的贪欲烦恼不可能断尽，嗔恚烦恼也不可能断尽，那就不能证得三果阿那含和四果阿罗汉。所以在佛法的修证中，禅定是非常重要和不可或缺的，没有禅定，就谈不到实修，更谈不到实证，修学佛法就是儿戏。所以有人说不用修定就能证果，没有禅定那就证明这个人具足一切烦恼，不可能断我见证果，是具缚凡夫一个。                          </p><p>根据烦恼断除的程度，就能判断所证的果位，证果与断除烦恼紧密相关，与禅定紧密相关。烦恼就是无明，断除无明才能得智慧，得解脱，有烦恼就没有智慧，没有禅定就有烦恼没有智慧。佛法是一环套一环融会贯通的，如果各个环节都脱节连接不上，此法是此法，彼法是彼法，不能有机的融合在一起，说明佛法没有通，关卡没有越过，没有实证。</p><p>二、我慢为什么是障道的因缘？</p><p>道即是无我，我慢即是有我，我与无我相背，障碍无我之道，我越重，越障碍无我之道以及无我的观行。以有我之心观行无我，观来观去，最终还是我，不能证得道。瑜伽师地论里列举的我慢，都是以我字开头，说明有我必有我慢，我慢是我的表现，所以一切烦恼都因我而有，我就是罪根，是罪魁祸首。如果有人说：我证果了，我比你们强，我最厉害等等，这样的态度一出现，就知道这个人我重，没有断我见，所以我慢很重的人，不可能断我见。修道就是不断断除烦恼的过程，烦恼越轻，我见越薄，离道越近，三向四果是依据断除烦恼的程度而定。</p><p>三、俱生我见和我慢的区别                                </p><p>有的人弄不懂我慢与俱生我见的区别，就把我慢当作俱生我见，说四果才断俱生我见，这个误会非常大，导致无法真正断我见。俱生我见是意根的我见，是两种我见之一，在初果时就要断除，如果不断就不是初果人，不是断我见之人。我慢是意根最深重的烦恼，属于意根的俱生我执，不属于俱生我见，俱生我执在临证四果前才能断，所以四果阿罗汉才没有我慢的现行烦恼。</p><p>我慢和俱生我执是依我见而有的，我见断除以后，我慢和俱生我执才能渐次微薄，最后断尽，我见断尽时我慢就没有了，所以俱生我见和我慢二者不能相提并论，概念不能混淆。</p><p>下意识当中就有个我，不用思索，不用分析和比对，这就是我慢，是意根的认知，就像是骨髓里的东西一样，意根的我慢不容易发觉，更不容易拔出来，包括卑劣慢、高慢、过慢。心里只要有个我，肯定就有我慢，人人都知有个我，或者自傲，或者自卑，都是基于我见而有的，非常难断，根深蒂固。比如说婴儿看见别人想抱的时候，不高兴时就扭头不理，这就是与生俱来的我慢，伴随意根而有，不用意识比较就有，不管有没有意识，意根都有与生俱来的我见和我慢。好表现、喜欢突出自己的那些人我慢都重，指出错处就不高兴的都属于我慢，总认为自己挺不错的都是我慢，喜欢与他人比较的都是我慢的表现，凡是有自我认知的都是我慢。</p><p>意根的俱生我见是根深蒂固的一种我见，认为五蕴就是我，这种心理不易觉察，很隐蔽，所以很多人无法降伏和断除俱生我见，就说只断意识的分别我见就是断我见证初果了，但是如果意根的俱生我见不断的话，意识的分别我见即使真断除了，依着意根还会不断的生起我见，而且会随时随地的生起我见，而不自觉知，非常麻烦。</p><p>因为俱生我见不是意识的我见，所以就不是一种感觉，感觉比较肤浅，是意识的觉，是意识的分别我见，通过分别才有，不分别时就没有，比意根的我见容易发现，也容易降伏，但降伏以后还会出现，断不尽，因为意识的俱有依意根不断我见，随意根而转的意识怎么能真断我见呢？这就免不了我见随时随地出现，也就不得不经常压制，很多时候根本压制不了，那命终的时候当然是随着意根的俱生我见和烦恼继续流转生死苦海，不免三恶道了。</p><p>断了三缚结的初果人有我慢，包括贪嗔痴已经弱化了的二果，仍然有我慢的烦恼心所存在，到三果才降伏了我慢，或者断除一少部分，还不能断尽，断尽就成为四果。意根的俱生我执比俱生我见更难断，从次第上讲，先断俱生我见和分别我见证初果；然后再进一步深化观行两种我见，弱化贪嗔痴证二果；再进一步深化观行两种我见，修出初禅定，断除烦恼证三果。意根的俱生我见彻底断尽，俱生我执也就彻底断尽，我慢消失没有了，就证得四果罗汉。</p><p>四、破无明断烦恼才是正修行</p><p>十二因缘中无明、行、识和名色前四支，表明名色的出生即是生死轮回苦的延续，而生死轮转之苦完全是因为无明，无明为愚痴，愚痴就会有愚痴的业行，促使六识不断造作贪嗔痴烦恼的身口意行，存下恶业种子，从此生死苦相续不断。因此修行就要破除无明烦恼，无明破除了就会获得智慧。</p><p>无明与智慧是对立的关系，如称两头低昂等时，所以有智慧的时候就不会有烦恼，不会造作烦恼恶业，有烦恼的时候就显示出心中有无明，任何一个烦恼的造作都是因为有无明而没有智慧，有智慧就不会造作任何烦恼业。一旦有人造作了烦恼业，有不如法的身口意行，就说明此人无明未破，智慧未生起，生死苦不能了断。</p><p>学佛成就的标志就是破无明，断烦恼，增智慧，不在于学了多少理论知识，学理论知识最终是为了破除无明，断除烦恼，离开这个宗旨，学法就无任何意义。要想了生死苦就要断恶修善，行善向善道得解脱，行恶去恶道受生死苦。如果无明不破，烦恼不断，学再多佛法知识，也无济于解脱生死苦，所以掌握众多理论知识不是修行的方向，破无明断烦恼增智慧才是正道。</p></div>"
},{
    "title": "第八章 俱舍论疏第二十三卷（闻思修证四慧）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  俱舍论疏第二十三卷（闻思修证四慧）</strong> </p><p>闻所得慧和思所得慧，是在四加行——暖顶忍世第一法四种善根之前出生的智慧，这两种智慧不够坚固，遇逆缘则会退失。修到思所成慧后边的修所成慧的时候，观行智慧才不会退失。四种善根中忍善根出现的时候，善根才不退，观行智慧也不退。在四加行修完之后，才会出现证慧，证得四圣谛所出生的智慧，也叫作现量智、法智、类智等等。 </p><p><strong>第一节  闻慧</strong></p><p>原文：<strong>杂缘法念住总有四种。二三四五蕴为境别故。唯总缘五名此所修。彼居此中修四行相。总观一切身受心法。所谓非常苦空非我。然于修习此念住时。有余善根能为方便。彼应次第修令现前。谓彼已熟修。杂缘法念住。</strong></p><p>释：在修习四念住中的法念住时，还要间杂观修身念住、受念住和心念住，不仅要缘法念住，还要间杂着缘其余三念住。因为修习法念住所对应的受想行识蕴四种境界各个不同，所以要总缘色受想行识五蕴来观修法念住。行者心缘法念住中要修习苦谛的四种行相：苦、空、无常、无我，从总体上观行身、受、心、法的苦空无常无我性。而在修习法念住时，还有其他善根如暖、顶、忍、世第一法，能方便验证所修结果，行者应该次第修习，使令四种善根一一现前。当这四种善根现前的时候，就说明行者已经很熟练地修习了杂缘法念住。</p><p>原文：<strong>将欲修习。此念住时。先应总缘。修无我行。次观生灭。次观缘起。以观行者。先观诸行。从因生灭。便于因果。相属观门。易趣入故。或有欲令。先观缘起。此后引起。缘三义观。此观无间。修七处善。</strong></p><p>释：行者在即将要修习此法念住时，首先应该从总体上缘于五蕴观行无我的行相，再次第观察五蕴的生灭，这是观行五蕴的无常行相，再次观行五蕴的缘起，这是观行五蕴空的行相。因为观行者是先观行身受心法诸行，是随顺于因缘而有生灭的，这样就方便从因果的相属角度来观行无我无常，容易趣入四圣谛理。有的人是想要先观察五蕴的缘起，后续再引发缘于蕴处界三法义的观行。这种观行方法就是无间断地修习七处善根，即于色受想行识五蕴分别观察其苦、集、灭、道、味、患和出离。</p><p>原文：<strong>于七处善。得善巧故。能于先来。诸所见境。立因果谛。次第观察。如是熟修。智及定已。便能安立。顺现观谛。谓欲上界。苦等各别。于如是八。随次第观。修未曾修。十六行相。彼由闻慧。于八谛中。初起如斯。十六行观。如隔薄绢。睹见众色。齐此名为。闻慧圆满。</strong></p><p>释：由于在修七处善时修得了善巧的缘故，就能于先前所观行的所有境界，建立因果谛理，即明了五蕴的苦集灭道，次第观察五蕴的七善处。像这样熟练地修习观行智慧和禅定以后，就能出生顺于四圣谛的现观谛智。顺现观谛就是随顺于欲界和色界、无色界各自的苦谛、集谛、灭谛、道谛等的智慧，虽然这时候还没有现量观行智慧，但是却能生起暖法善根，不违背四圣谛理。</p><p>这样对于四念住和四圣谛八种义理，随其次第观行，修习从前所没有修出来的十六种行相。行者由于闻法所获得的智慧，在这八种谛理的观行中，最初生起了这样的十六种行相的观行。这时候的智慧犹如隔着一层薄薄的布绢来观看一切色相，到此闻慧就修圆满了。</p><p>闻慧修圆满的时候，观四念住和五蕴，就像隔着一层薄绢见色，虽能见色的轮廓犹不清晰，朦朦胧胧，在闻慧出现之前，见一切法就更加朦胧不明了，无明很重。修到闻慧时，无明变薄一些了，修到思慧和修慧时，无明变得更薄了，及至证慧出现了，无明断除一部分，三缚结断除。</p><p>对照以上论文中所描述的闻慧特征和修行过程，检查自己的闻慧修到了什么程度，是否修习圆满了。即使已经修习圆满了，这才仅仅处于闻慧阶段，离证慧还有很远的距离。如果修了若干年，连闻慧都没有修圆满，应该检查自己差在哪里，如何弥补差距，应该采取哪些措施，快马加鞭，精进修道。<span> </span></p><p><strong>第二节  思慧</strong></p><p>原文：<strong>思所成慧。准此应说。次于生死。深生厌患。欣乐涅槃。寂静功德。此后多引。厌观现前。方便勤修。渐增渐胜。引起如是。能顺决择。思所成摄。最胜善根。即所修总缘。共相法念住。</strong></p><p>释：思所成慧依照闻所成慧的准则也应该说一说，在闻所成慧圆满之后，就会对于生死轮回深生厌患，厌倦世俗，欣乐于涅槃的寂静功德。在此之后就会更多地引生出厌离世间的观行，现观世间之可厌，这样对于修道和观行就会更加地精进，观行越来越深入，智慧越来越殊胜。乃至于引发出了能随顺于五蕴苦空无常无我谛理的顺抉择分，由思所成慧所摄属的最胜善根就出现了，这就是所修的从五蕴总体上缘着四圣谛共相的法念住。</p><p>共相是指一切众生的五蕴都是同样的苦空无常无我，所有众生的五蕴都具有这样的共同属性，与此相对的是别相，是单体众生五蕴的苦空无常无我属性。法念住要从别相和共相两个角度来次第观察，才能修行圆满。</p><p>这里描述出了思所成慧所具有的相貌和特征，最主要的就是有对五蕴世间的厌患心，厌倦于三界世间，向往于清净的涅槃功德，内心顺从于五蕴的苦空无常无我性，不违逆四圣谛理，对四念住有如理如实的抉择，发起顺决择分。顺就是顺从、不背离四圣谛的意思，如果内心抗拒无我无常苦空之理，那就没有顺决择分，闻慧也不圆满具足。</p><p>如果学人还没有出现对五蕴世间的厌离心，还是对世间抱有欲求和希冀，赞叹世间法，贪着于三界世间法，不肯舍离，执着于世间眷属，情执深重，那就没有思所成慧，没有随顺于四圣谛理。这样的话修所成慧就更不具足了，离证道就太远了。通过观察众多所谓证果明心之人的言行，发现极少有人厌患世间，极大多数都是对世间充满了贪欲和希冀，所以这些所谓的果，都与真果相差太大了，联想其后世果报，就令人唏嘘不已。</p><p>有些人就会说，我们修学大乘法想成佛道的人，就是要保有五蕴，在五蕴世间里修行，自利利他，不应该厌离五蕴世间，如果厌离世间就是非菩萨种姓。此言差矣，菩萨应与声闻缘觉一样对世间生厌，只不过虽厌而不离，绝对不与凡夫一样喜乐于世间，贪着于世间，明知世间是幻化的，菩萨的智慧怎么能对幻化的世间抱有什么希冀和欲望呢？有欲有贪有喜乐，就说明其智慧有亏有差池，不明空幻之理。菩萨知世间空幻，其心寡淡，无欲无求，但为道业和众生，随其愿力，不得不行走于世间。而凡夫心却不是不得不，而是欣乐于世间，味着于世间，不忍舍离。所以无论是小乘学人还是大乘学人，只要修出思所成慧，必然会对世间生厌离欲，菩萨不离欲就是非真菩萨。</p><p>在闻所成慧和思所成慧中都有禅定，只是禅定的深浅不同而已，如果连基本的粗浅的禅定也没有，闻所成慧就不可能圆满具足，更别说思所成慧和修所成慧了。每一种智慧，都与禅定不相分离，无定心乱，心神不集中，则闻思不具足，定浅慧浅，定深慧深。在之后的修所成慧的集聚过程中，禅定一定要具足未到地定才能参证成就，从而见道。未到地定不具足的时候，可以有闻慧和思慧，也可以有修慧，但是修慧却不能圆满，也就不能见道。</p><p>原文：<strong>准上论文。即是三义七处等后。起总相念住。入暖法也。三义观者。即蕴处界。三科义也。七处善者。如实知色苦。色集。色灭趣。色灭行。色味。色患。及色出离。如实知受想行识七亦尔。如实知色。是四智知。谓法类智。世智苦智。</strong></p><p>释：对照上述论文中所说，应该知道，在观察蕴处界三科义以及七处善之后，就会生起缘于五蕴总相的法念住，入到暖法善根中。三义观就是对蕴处界三法的观察；七处善就是如实知色蕴的苦、色蕴的集、色蕴的灭道、色蕴灭所修的道、色蕴的味、色蕴的过患，以及色蕴的可出离性；并且如实知受蕴这七处善、想蕴这七处善、行蕴这七处善和识蕴这七处善，也都是与色蕴七处善同理。并且如实知色蕴，会生出四种智：法智、类智、世俗智和苦智。</p><p>解脱的人具十种智：法智、类智、世俗智、他心智、苦智、集智、灭智、道智、尽智和无生智。由于如实观察了五蕴中各蕴的七处善，就会以智慧如实知色蕴，知色蕴的智慧有四种，就是法智、类智、世智和苦智。法智是对一切法从总体上，以智慧观知其无我无常苦空；类智是对总体法中的相同类法的智慧观知；世智是对世俗界中法的智慧应对，随着世俗众生的根基利钝随宜度化；苦智是对五蕴世间的如实观察，以智慧知世间一切法皆为苦，不可取。<span> </span></p><p><strong>第三节  修所成慧的四加行四善根</strong></p><p>一、四念处的观行，和四圣谛有没有关系？在四念住的观行过程，每个念住都要观行四圣谛理，这样合起来就观察了十六个行相，十六行相具足观行，就会获得四种智慧境界，就是四种善根。这四种善根就是暖、顶、忍、世第一，也叫作四加行。这是见道之前必须要经历的阶段，四加行四善根属于修所成慧，在这之前属于闻慧和思慧，比较浅，未熏到意根，而熏到意根，意根有所触动有所改变，随顺于苦空无常无我，发起顺抉择分，就有了修所成慧。有了修所成慧，圆满具足时才会见道。所以四加行非常重要，大家应该都了解，我会慢慢讲一些这方面的法。</p><p>还需要给大家完善的理论是三十七道品，稍微讲细一点，让每个人知道自己是否在修三十七道品，以及修到了什么程度。最后再讲一讲，在见道之前的修道过程中，应该需要在禅定中断除哪些比较粗重的欲界粗烦恼，细烦恼是在见道以后才能断除的，见道之前断不了，色界烦恼就更不能断除了。这样小乘的法，基本上就差不多够用了，无需再多讲了。</p><p>修道，其实是百分之九十的时间，都是个人在用功，很少的时间用来闻法，吸取理论知见，用以指导修行，不至于走偏路岔路。当理论知见吸收的差不多够用了，完全是个人专心一意用功，再多用时间学理论，那就耽误事了。所以我以后也不想讲太多的法，免得耽误大家的实修。如果以后发现还有理论上的不足，我再慢慢补充一下，具体的还以实修为主，理论够用就行，贪多也起不了多大作用，还浪费时间。</p><p>在四加行的修行阶段，因为有效的熏到了意根，所以身心都会发生改变，心比从前清净了，烦恼变得轻了，身口意行转变清净一些了。只有这样，才能逐渐与见道后的圣贤人的心行品质相应，然后才能见道。所以不是说自己身心改变了，烦恼轻了，就是见道了证果了，还差得远。那些总是怀疑自己在大乘法悟了悟了的人，如果这些法都没有修，没有修具足圆满，那么以后就断了这个疑吧，不用怀疑，自己没有悟，解悟也不是。有些人悟后和悟前身心世界变化不大，或者根本没有任何改变，只是知见多了一些，有一些人知见都不足，这样的人三十七道品都没有修，四加行都没修到，只是处于闻思阶段，那这样的误会简直是太大了。为什么会有这样的误会？</p><p>二、知道1+1=2，在闻思修证四种慧中属于什么慧？</p><p>闻思修证四种慧都知道1+1=2，但是知与知的差别太大了，一岁孩子就可以知道,1+1=2，甚至狗调教好了也能知道1+1=2，大学教授也知道1+1=2，数学家也知道1+1=2，这中间差别究竟有多大？1+1=2属于哥德巴赫猜想中的难题，中国数学家只有陈景润和华罗庚曾经着手去论证和证明，但华罗庚及其他数学家也没有论证出来，没有给与有效证明，陈景润不知道是否完全证明了。有能力证明1+1=2的人亿中无一，能够着手证明的亿中不超过一，能够思索1+1=2的人不足千分之一万分之一，而能够知1+1=2的人无数。</p><p>所以我们所有人都知道1+1=2，这个知的水分究竟有多大？同理，很多学佛人学了四圣谛理和如来藏之法，学了几年时间，或者只学了二三年，甚至只学了两三个月，就说自己证了悟了，这里的水分当然也就相当的大了，大多数人都没有走到修这个层次，没有因缘来如实、踏实的修行，所有见道的因缘都不满足，谈何修慧和证慧？有个思慧就相当不错了。也所以说，学佛修行这条路不是那么容易走的，不要过分的高估自己，低估佛法，否则旧业未消，又添新业，后世如何能解脱？</p><p>幼儿园里的孩子和小学生以及中学生们，要想实证1+1=2，要如何努力？如何完善证明1+1=2的因缘条件？亿分之一十亿百亿分之一的实证比率，你们觉得这些孩子们将来实证的可能性有多大？需要如何努力？除非是数学天才，否则几乎没有可能性。对于1+1=2的证明，最重要的是中间的逻辑演算步骤，结果已经给出来了，中间证明过程没有，需要补全，在论证过程中，要忘记结果，把结果当作未知。论证过程中的辛苦，了解一下陈景润就知道了，代价很大。</p><p>在佛教中修习接触了四圣谛和般若唯识的佛子也有一些，但在所有学佛人中的比例还是很少很少，这些人中对于大小乘法有不同程度的知和解，四种慧中多数都属于闻慧，少数属于思慧，极少数能有修慧，但是达到证慧这种程度的人可能寥寥无几，亿分之一有可能。那么已经知了四圣谛理和如来藏般若空理还没有实证的学佛人，应该如何去实证和亲证？或者是已经理解了佛法、解悟了佛法的学佛人，应该如何再去亲证实证？需要完善什么因缘条件，做何努力才能真正实证？</p><p>而对于理解了佛法、解悟了佛法的这部分人，要想实证佛法，需要把自己所解的所悟的全部都忘掉，把结果当作是未知，不要带入参究的过程中。这需要有修慧，实修三十七道品，戒定慧，菩萨六度，完善见道的种种条件，在甚深的禅定中如理参究。所以解悟佛法的人，需要忘记所解，放下从前所学的知解，抛弃名利心、争胜心、虚荣心，舍得从头开始，一步一个脚印，踏踏实实，不急不躁，这样才有实证的可能，中间要付出很大的代价，很辛苦，一分汗水一分收获，无论付出多大代价都是值得的。</p></div>"
},{
    "title": "第九章 瑜伽师地论第二十九卷（四正勤）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  瑜伽师地论第二十九卷（四正勤） </strong></p><p>原文：<strong>如是于四念住。串习行故。已能除遣。粗粗颠倒。已能了达。善不善法。从此无间。于诸未生。恶不善法。为不生故。于诸已生。恶不善法。为令断故。于其未生。一切善法。为令生故。于其已生。一切善法。为欲令住。令不忘失。广说如前。乃至摄心持心。</strong></p><p>释：由于熏习观行了四念住的缘故，就消除了心中最粗浅的颠倒。从前以身为我计净贪着，现在知身不净无我；从前以苦为乐，贪享觉受，现在知受皆苦；从前认为心是相续是常，现在知心无常；从前计五蕴世间法为我，现在知无我。把颠倒知见搬正回来，心不再颠倒。</p><p>修习四念住之后，就能了达什么是善法，什么是不善法，从此无间断地进入四正勤的修习中。能令那些还没有生起的恶的不善法不再生起；能令那些已经生起的恶的不善法断除掉；对于还没有生起的善法能令其出生；对于那些已经生起的善法保持下去，令其永远不忘失掉。展开来说就像前边所说的那样。在四正勤的修习过程中，能够摄持住心、保持住心。</p><p>原文：<strong>云何名为。恶不善法。谓欲缠染污。身语意业。是身语意。恶行所摄。及能起彼。所有烦恼。若未和合。未现在前。说名未生。若已和合。已现在前。说名已生。</strong></p><p>释：什么叫作恶的不善法？恶不善法是由贪欲所缠缚的身业、口业和意业，摄属于身恶行、语恶行和意恶行，以及能生起五阴七识所有的烦恼。如果身口意恶不善业还没有造作出来，恶不善行还没有出现，就是还未生起的恶不善行；如果身口意恶不善业已经和合生起了，恶不善行已经出现了，就叫作恶不善行已生。</p><p>和合是指烦恼与缘合，烦恼遇缘恶不善业行出现，烦恼不遇缘，烦恼只是眠藏着，恶不善业行不出现。恶业和不善业二者稍微有区别，在烦恼轻重程度上有差别，恶行显示烦恼比较重比较粗，不善行显示烦恼轻一些，介于恶和善之间。不善行包含的范围广，恶行是不容易让人忍受的行为。恶这种烦恼比较粗重，表现的比较明显，是不应该出现的，所以才是让人让己不好容忍。不善的烦恼稍微轻一些，每个人经常出现，人们对此有一定的容忍度。</p><p>众生恶不善法多善法少，所以都觉得不善属于正常现象。而众生却不知，大家都认为的一切正常现象，都是不正常的，都不应该出现。人们拿不善当作正常现象，说明众生都有不善法，心地都不清净。越能容忍恶不善法，人心的善法越少。众生的容忍与诸佛菩萨的容忍截然不同，诸佛菩萨的容忍是智慧和慈悲的体现，众生的容忍很多时候是烦恼的体现。很多人身口意行不善的时候，你给指出来，都会不高兴，心无惭愧，说明他对自己的恶不善行为很能容忍，这就离修行还有一段距离。</p><p>原文：<strong>云何名为一切善法。谓若彼对治。若盖对治。若结对治。未生已生。应知如前。恶不善法。若时未生。恶不善法。先未和合。为令不生。发起希愿。我当令彼。一切一切。皆不复生。是名于诸未生恶不善法。为不生故生欲。</strong></p><p>释：什么叫作一切善法？善法是对恶法的对治，与恶法相反，是降伏恶法的法，名为善法。比如对于烦恼盖障的对治，对于烦恼结缚的对治，对治之后生起了善法，恶法就灭，就像太阳生起驱逐了黑暗，黑暗就消失一样。如果恶法消失，就不再用善法对治了，心清净以后，就是不善不恶的，作善也是有为法，也是生死业，心清净就无业，得大寂静，得大涅槃。</p><p>用善法对治恶法，就是四正勤的修习，未生恶使其不生，已生恶使其断灭。当恶不善法生起的因缘条件还没有具足时，为了使恶不善法不生，心中就会发起希求和愿望，希望恶不善法不要再生起来。比如发愿以后再也不要嫉妒了，再也不要偷盗了，再也不要妄语了，再也不杀生了，再也不陷害人了等等。这就叫作对于还没有出生的恶不善法，为了使其不生，而发起了希冀和欲望。</p><p>原文：<strong>若时已生。恶不善法。先已和合。为令断故。发起希愿。我当于彼。一切一切。皆不忍受。断灭除遣。是名于诸已生。恶不善法。为令断故生欲。</strong></p><p>释：如果这时候生起恶不善法的因缘和合起来了，已经生起了恶不善法，为了使恶不善法断灭而发起了希求和愿望，希望自己再也不要容忍一切恶不善法了，下决心要断灭和遣除一切恶不善法，使心变善。这就叫作对于已生的恶不善法，为了使其断灭而生起了希冀和欲望。</p><p>以上所发的愿都是善愿，只有觉悟的人才能如此发愿，觉悟自心有恶和烦恼，知恶不善法的恶果恶报，对于解脱有障碍，并且也分得清楚什么是善，什么是恶和不善，如果分不清楚，就不能觉悟自心，即使有愿，也不能如愿和满愿。这些愿，是在修行过程中自动自觉发起来的，是修行如法有成效的体现，是精进的结果。精进是心精进，不是只在身口等表面做文章，身口如车，心如驾车人，如果想要车走得快和稳，方向正确，当然是要督促和鞭策驾车人了。初学佛的人大多在身口上精进用功，如拜佛念佛，还不会在心上用功，老修行人就知道观察自心，监管自心，对治自心，使心断恶增善。</p><p>原文：<strong>又彼一切。恶不善法。或缘过去事生。或缘未来事生。或缘现在事生。如是彼法。或缘不现见境。或缘现见境。若缘过去未来事境。是名缘不现见境。若缘现在事境。是名缘现见境。</strong></p><p>释：所有一切恶不善法，或者是缘于过去的事情出生，或者是缘于未来的事情出生，或者是缘于现在的事情出生。所以恶不善法或者是缘非现前所见的境界，或者是缘现前所见的境界。如果是缘过去和未来的境界，叫作缘非现前所见的境界，如果是缘当前出现的境界，叫作缘现前所见的境界。</p><p>原文：<strong>当知此中。于缘不现见境。恶不善法。其未生者。欲令不生。其已生者。欲令永断。自策自励。是名策励。于缘现见境。恶不善法。其未生者。欲令不生。其已生者。欲令永断。勇猛正勤。是名发勤精进。所以者何。要当坚固。自策自励。勇猛正勤。方能令彼。或不复生。或永断灭。</strong></p><p>释：而对于缘非现前所见境界，如果恶不善法还没有生起来的时候，就一定要让恶不善法不出生，如果恶不善法已经出生的时候，就一定要使得恶不善法永远断灭，以此自己鞭策自己，自己鼓励自己，这就叫作策励。对于缘现前所见的境界，如果恶不善法还没有出生的时候，一定要令其不生，如果恶不善法已经出生的时候，就一定要令其永远断灭，这样勇猛精进地修行，就叫作奋发、勤奋精进。为什么要这样精进呢？这是因为，只有心坚固地自策自励，勇猛精进，才能使得恶不善法或者不再出生，或者永远断灭不现。</p><p>原文：<strong>又于下品中品诸缠。其未生者。欲令不生。其已生者。欲令永断。故自策励。于上品缠。其未生者。欲令不生。其已生者。欲令永断。发勤精进。又若行于过去境界。如是行时。不令烦恼缘彼生起。设复失念。暂时生起。而不忍受。速能断灭。除遣变吐。如缘过去。若行未来。当知亦尔。如是未生恶不善法。能令不生。生已能断。是名策励。</strong></p><p>释：对于下品和中品所有烦恼缠缚，如果还没有出生的，一定要令其不生，对于已经生出来的，一定要令其永远断灭，所以自己策励自己。对于上品烦恼缠缚，如果还没有出生的，就一定要令其不生，已经出生的，就一定要永远灭除，因而勤奋精进。</p><p>如果心缘过去境界，当正缘想过去境界时，不要让烦恼因为过去的境界而生起，假使心中失去了正念，没有觉察到烦恼出现了，一旦发现了烦恼生起，也不再容忍烦恼继续，能快速地灭除掉，除遣和剔除烦恼。如果心缘未来境界，也要像缘过去境界一样对待。像这样还没有生起的恶不善法，能令其不生，已经生起的能令速断，就叫作策励。</p><p>原文：<strong>若行现在所缘境界。如是行时。不令烦恼缘彼生起。设复失念。暂时生起。而不忍受。速能断灭。除遣变吐。如是未生。恶不善法。令其不生。已经生起，生已能断。是名发勤精进。</strong></p><p>释：如果心缘现在现前所见的境界，在现前境界中运行时，不让烦恼缘于现在境界而生起。假如一不小心，丢失了正念，烦恼暂时生起，一旦发现，就不容忍其继续，迅速地断灭，除遣剔除其烦恼。像这样还没有生起的恶不善法，能令其不生，已经生起的恶不善法，生起之后即令其烦恼断灭，就叫作勤奋精进。</p><p>能如以上勇猛精进地修行四正勤，自策自励，烦恼不久就会除遣，烦恼除遣之后心清净才能见道，获得智慧解脱。如果对于烦恼缠缚还不能觉悟其害，任由烦恼泛滥，轮回苦恼之灾就不除，无由见道证圣。由此可知，不断烦恼证菩提，无有其事。</p><p>原文：<strong>又或有恶不善法。唯由分别力生。非境界力。或有恶不善法。由分别力生。亦境界力。唯由分别力生。非境界力者。谓于住时。思惟过去未来境界。而生于彼。由思惟力生。亦境界力者。谓于行时。缘现在境界。而生于彼。当于尔时。决定亦有。非理分别。当知此中。恶不善法。唯由分别力生。非境界力者。彼若未生。能令不生。生已能断。是名策励。若由分别力生。亦境界力者。彼若未生。能令不生。生已能断。是名发勤精进。</strong></p><p>释：有的恶不善法，只由分别力出生，不由境界力出生。分别力就是意识的分别性，也是随顺意根习气的结果，不受现前六尘境界的熏染，境界无力推动恶不善法已经出生，因为意根固有的习气力量大。有的恶不善法不仅是由意识的分别力产生出来的，也是由六尘境界熏染的力量产生出来的。</p><p>只由分别力产生，不由境界熏染产生的恶不善法，是指住于现前法中，而思惟过去和未来境界，于是恶不善法就出生了。这样的恶不善法，主要是意根的烦恼习气产生出来的。不仅是由分别力产生，也由境界熏染产生的恶不善法，是指在身口意运行时，缘现在境界而产生了恶不善法。身口意运行时不仅有六识的分别力，也受现前境界熏染。因为这时候，不仅境界起推动作用，决定也有非如理分别。这是意根烦恼习气，和现前境界熏染共同产生的恶不善法。</p><p>由此可知，恶不善法只由分别力产生，不受境界力熏染的，如果还没有出生，能令其不生，出生以后能令其断灭。这叫作策励。如果是由分别力出生，同时也由境界熏染力产生出来的恶不善法，这些法如果还没有出生时，能令其不生，即使出生以后，也能断除，这叫作发勤精进。</p><p>原文：<strong>于其未生。一切善法。为令生故生欲者。谓于未得。未现在前。所有善法。为欲令得。令现在前。发心希愿。发起猛利。求获得欲。求现前欲。而现在前。是名于其未生一切善法。为令生故生欲。</strong></p><p>释：对于还没有出生的一切善法，为了令其出生的缘故而生起希冀和愿望，意思是说对于还没有得到、还没有出现的所有善法，为了能够得到，令其现在面前，发心希望得到，并且发起猛力的愿望，期求获得善法的欲望，期求善法现在前的欲望，最终令善法出现在面前，这叫作于未出生的一切善法，为了令其出生的缘故而生起了欲望。</p><p>原文：<strong>于其已生。一切善法。为欲令住。令不忘失。令修圆满生欲者。谓已获得。已现在前。所有善法。是名已生善法。于此善法。已得不失。已得不退。依是说言。为欲令住。于此善法。明了现前。无闇钝性。依是说言。令不忘失。于此善法。已得现前。数数修习。成满究竟。依是说言。令修圆满。于此善法。发心希愿。发起猛利求。坚住欲求。不忘欲求。修满欲而现在前。是名于其已生一切善法。为欲令住。令不忘失。令修圆满生欲。</strong></p><p>释：对于已经出生的善法，为了令善法坚住，为了不忘失善法，为了令其善法得到圆满，而生起希冀和愿望。已经获得的所有善法，已经在现前出现的所有善法，叫作已生善法。对于已经得到的善法不再失去，也不再退去，这叫作希冀善法常住。对于已有善法心中明了自持，清清楚楚，没有暗钝性，这叫作令其善法不忘失。对于已经获得的善法，不断地修习，令善法圆满究竟无间，这叫作令修圆满。</p><p>对于善法发起希冀心，发起猛力的求取心，发愿获得和持有，并且想要坚固地住在善法中而不退失不忘却，希望把善法修习圆满，这些欲望和心愿，就叫作于其已生一切善法生起欲望，为了想要令其住着永存，为了不忘失善法，为了把善法修习圆满，而生起的欲望。</p><p>原文：<strong>策励者。为于已得。令现前故。发勤精进者。为于未得。令其得故。又策励者。于已生善。为欲令住。令不忘故。发勤精进者。令修满故。又于下品中品善法。未生令生。生已令住。令不忘失。是名策励。于上品善法。未生令生。生已乃至。令修圆满。是名发勤精进。</strong></p><p>释：所谓的策励，是为了对于已经获得的善法，令其现前，在身口意行中显现出来，所以才要勇猛地鞭策激励自己。所谓的发勤精进，是为了对还没有获得的善法，令其尽快得到，所以才勤勉精进。策励也指对于已经生起的善法，为了令其坚住持久，令其不被忘却。发勤精进又指对于已经生起的善法，令其尽快修习圆满，所以才生发出勤奋精进心。</p><p>另外，对于下品和中品善法，还没有出生的，要令其出生，已经出生的，要令其坚住，不再忘却，这叫作策励。对于上品善法，还没有出生的，要令其出生，已经出生的，令其坚住，并且令其修习圆满，这叫作发勤精进。</p><p>原文：<strong>言策心者。谓若心于修奢摩他一境性中。正勤方便。于诸未生。恶不善法。为令不生。广说乃至。于其已生。一切善法。为欲令住。令不忘失。令修圆满。由是因缘。其心于内。极略下劣。或恐下劣。观见是已。尔时随取一种。净妙举相。殷勤策励。庆悦其心。是名策心。云何持心。谓修举时。其心掉动。或恐掉动。观见是已。尔时还复于内。略摄其心。修奢摩他。是名持心。</strong></p><p>释：所说的策心，是说如果心在修习止的时候，在专住于一个境界的奢靡他中，正当精勤地以方便力，对于还没有出生的恶不善法，为了令其不出生，对于已经出生的恶不善法，令其灭除，广泛地说，乃至于对于已经出生的一切善法，为了令其坚住，不令忘失，令其修习圆满。由于这个修止的因缘，当发现自己内心极其昏昧，或者害怕昏昧，这时候就要随机选择一种清净胜妙的殊胜之相，来激发鼓励自己，让心欢喜心向往之，这叫作策励其心。什么叫作持心？在修习举相时，当发现自心掉动不停，或者害怕掉动时，在心里悄悄地收摄自心，让心止下来，这叫作持心。</p><p>这里说的策心，是指在修定的时候，发现心里昏沉不清明，就要修观以对治，让心提起，集中在所观之法上，这样心就不昏沉掉举了。所观之法有很多，可选一种与自己目前所修习的法相同或者相似的内容，把注意力集中在此法上，所观之法越清晰明确，越胜妙越殊胜，就越能感兴趣，吸引自己的注意力，精力就会旺盛，驱走昏沉暗钝。在修观的时候，如果发现自己的心注意力不够集中，心散乱了，就要停止修观，让心止于一境中不动，等心静下来以后，再继续修观。</p><p>在修习定慧止观的时候，不是一味地修定和止，也不是一味地修慧和观，要根据自心的情况来抉择。修行要定慧等持，止观双运，如果发现定多心沉没就要提起正念，多修观，如果发现自心不能专一深入，就要多修止，要保证止中有观，观在定中，二者缺一，不得善果。</p><p>原文：<strong>如是四种。亦名正胜。谓于黑品诸法。其未生者。为令不生。其已生者。为令断灭。生欲策励。发勤精进。策心持心。是二正胜。于白品诸法。其未生者。为欲令生。如前黑品广说。应知是二正胜。</strong></p><p>释：以上四种修习方法，也叫作四正胜。对于黑品烦恼之法，如果还没有出生的，为了令其不生，对于已经出生的，为了令其断灭，而生起欲望和策励，发起勤勉精进心，策励其心、加持其心，这是二种正胜。对于白品诸善法，还没有出生的，为了令其出生故，其已经出生的，为了令其坚住圆满故，生起愿望和策励，发心精进修行，策励其心、坚持其心，这也是二种正胜。</p><p>勤是勤勉精进的意思，胜是心胜，也是精进的意思，正是指方向和方法正确无误，在正确的方向上努力精进，是正精进，是不断地趣向目标；反之，在不正确的方向上努力精进，就是邪精进，越精进离目标越远。不少人学佛修行就是邪精进，不明修行目标，也不明修行原理，只一味地用功，勇猛是勇猛，智慧太欠缺了。</p><p>原文：<strong>如是四种。亦名正断。一名律仪断。谓于已生。恶不善法。为令断故。生欲策励。乃至广说。二名断断。谓于未生。恶不善法。为不生故。生欲策励。乃至广说。由于已生。恶不善事。应修律仪。令其断灭。不应忍受。由是因缘。名律仪断。于其未生。恶不善事。为欲令彼。不现行断。为欲令彼。不现前断。为断故断。故名断断。</strong></p><p>释：如是四种正胜，也叫作四正断。其一是身口意造作的律仪断，是对于已经生起的恶不善法，为了令其断故，生起欲望和策励。其二是断断，是对于还没有生起的恶不善法，为了令其不生故，而生起欲望和策励。由于已经生起的恶不善法，应该修习身口意律仪，令其恶不善法断除，不应该忍受这些恶不善法，任其出生和增长，这叫作律仪断。对于还没有生起的恶不善法，为了令其不再现行出来而断，为了令其不再现前而断，为了断除恶不善法而断，叫作断断。</p><p>原文：<strong>三名修断。谓于未生一切善法。为令生故。广说乃至。策心持心。由于善法。数修数习。先所未得。能令现前。能有所断。故名修断。四名防护断。谓于已生。一切善法。为欲令住。广说乃至。策心持心。由于已得。已现在前。诸善法中。远离放逸。修不放逸。能令善法。住不忘失。修习圆满。防护已生。所有善法。能有所断故。名防护断。</strong></p><p>释：其三是修断，是对于还没有出生的善法，为了令其出生故，而策励其心，加持其心。由于善法多次反复地修习，先前所没有获得的善法，现在能令其现前出现，能让恶不善法有所断除，叫作修断。其四是防护断，是对于已经出生的一切善法，为了令其坚住，而不断地策励其心，加持其心。由于在已经获得、已经现前出现的所有善法中，其心能够远离放逸，修习不放逸行，能令善法坚住而不忘失，善法修习圆满了，防护就生起来了。所有的善法，对于恶不善法能有所断除的缘故，名为防护断（恶不善法）。</p><p>防护是防护恶不善法的出现，心中有善法，恶不善法才能断除不出现，由于善恶不能同时出现，所以善法起着防护的作用。善法坚固以后，就不会造作恶不善业了，这是长时间修习善法的结果。四正勤是属于最初修习的助道之法，是见道的必要条件，所以见道的人是要断除相应的粗重的烦恼的，心中善法应该是坚固的，恶不善法是不会轻易现前的。</p><p>如果修完四正勤，在命终之前还没有见道，因为心改变的缘故，后世所受的恶报也会很轻微，但不保证善法不会退去，恶不善法不会重新出现。因为业缘的缘故，难免会被恶的环境熏染，又因为有善法的基础，再遇善缘，善法还是会容易生起，修习善法是很快的。见道以后，善法才能保持住，并且会不断地坚固和增长，不断地圆满。</p><p>原文：<strong>如是广辨。四正断已。复云何知。此中略义。谓为显示。于黑白品。舍取事中。增上意乐圆满。及加行圆满。是故宣说。四种正断。当知此中。由生欲故。增上意乐圆满。由自策励。发勤精进。策心持心故。加行圆满。</strong></p><p>释：如是广泛地论辩四正断以后，如何才能知道四正断的大略要义？四正断的大略要义，是显示在黑白善恶诸品的取舍过程中，其增上意乐圆满了，去恶增善的加行也圆满了，因此就应该说四正断。你们应当知道，在四正断的修习过程中，由于心里已经生起了想要断恶增善的欲望的缘故，增上意乐就圆满了，由于自心能够策励自己，进而生发勤勉精进心，不断地策励其心，加持自心，因此加行就圆满了。</p><p>在达到四正断之前，对四正勤的修习，还没有生起很强的欲望，所以增上意乐还不圆满，四种正断就不出现，对自身的策励激励还不够强，鞭策和驱策其心的力度还不够大，所以四种正断就不会出现。直到意乐和策励都圆满具足了，四正断才出现，这时候四正勤就修完了。</p><p>原文：<strong>修瑜伽师。唯有尔所。正应作事。谓为断灭。所应断事。及为获得。所应得事。先当生起。希愿乐欲。为断诸缠。复应时时。正勤修习。止举舍相。为断诸缠。及随眠故。更应修集。对治善法。为现如是。一切所作。说四正胜。及四正断。是名略义。</strong></p><p>释：修行瑜伽的行者，只有这些法才是他所应该修的，为了断灭那些所应该断除的事，以及要获得所应该获得的事，首先应当生起希冀、意愿和乐欲。为了断除诸烦恼缠缚，还应该时时正精勤地修习止相（禅定）、举相（激励自心）和舍相（舍弃恶不善法）。为了断除诸烦恼缠缚以及随眠的缘故，更应该修集用来对治恶的善法。为了显现出这些所有所应该作的事，才宣说四正胜以及四正断，这些内容就叫作四正断的大略之义。</p><p>以上四正勤这些法，有一些人不愿意修习，轻贱这些法，认为这些法很基础，是小乘法，没有必要花时间去修，所有精力都用来熏习大乘法就好了。但是四正勤不修，心不转善，德不具足，德不相配，就证不得大乘法，所有的熏习最终也只是理论而已，理论在一定的因缘条件下是可以忘却丢失的，即使不忘却，理论终究是一个理论，没有多少实用价值，命终却因恶不善法而堕落，徒有理论不能救命。</p></div>"
},{
    "title": "第十章 瑜伽师地论第三十四卷（四谛相）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  瑜伽师地论第三十四卷（四谛相）</strong></p><p><strong>第一节  如何明了苦谛相</strong><br/></p><p>原文：<strong>若乐往趣。出世间道。应当依止。四圣谛境。渐次生起。七种作意。所谓最初。了相作意。最后加行。究竟果作意。乃至证得。阿罗汉果。修瑜伽师。于四圣谛。略摽广辩。增上教法。听闻受持。或于作意。已善修习。或得根本。静虑无色。</strong></p><p>释：如果修行人乐于趣向出世间道，应当依止四圣谛境界，渐次生起七种作意，这七种作意分别是最初的了相作意，后边的胜解作意、远离作意、摄乐作意、观察作意、加行究竟作意，以及最后的加行究竟果作意，直至证得阿罗汉果。修习瑜伽的行者于四圣谛理，大略涉猎，广泛地辩证增上教法，听闻受持，他们或者对于如理作意已经善于修习，或者证得了根本静虑四禅八定，甚至达到无色界定。</p><p>这段文大略地显示了从凡夫到四果阿罗汉的修学内容和次第或者是过程，众生要想解脱世间苦，证得涅槃乐，就要修学四圣谛。在修行四圣谛的过程中，要生起七种作意，所谓的作意，是指注意、关注和用心，心所趣向，也是指观行、观察，作意不同，趣向不同，果就不同，最后生起加行究竟果作意，才获得了究竟果，证得阿罗汉果，得解脱，出世间。</p><p>原文：<strong>由四种行。了苦谛相。谓无常行。苦行空行。无我行。由四种行。了集谛相。谓因行集行。起行缘行。由四种行。了灭谛相。谓灭行静行。妙行离行。由四种行。了道谛相。谓道行如行。行行出行。如是名为。了相作意。</strong></p><p>释：修习四圣谛，从四种行上明了苦谛相：无常行、苦行、空行和无我行；从四种行上明了集谛相：因行、集行、起行和缘行；从四种行上明了灭谛相：灭行、静行、妙行和离行；从四种行上明了道谛相：道行、如行、行行和出行。这些法合起来就名为了相作意。</p><p>这段介绍四圣谛大略的修行内容，每一谛的修学都包括四种行，合起来就是十六行，叫作四谛十六行。</p><p>原文：<strong>由十种行观察苦谛。能随悟入苦谛四行。何等为十。一变异行。二灭坏行。三别离行。四法性行。五合会行。六结缚行。七不可爱行。八不安隐行。九无所得行。十不自在行。如是十行依证成道理。能正观察。</strong></p><p>释：从十种行上来观察苦谛，能随顺悟入苦谛四行。是哪十种行？一是变异行，二是灭坏行、三是别离行、四是法性行、五是合会行、六是结缚行、七是不可爱行、八是不安稳行、九是无所得行、十是不自在行。这样的十种行依靠证成道理能够正确地观察到。</p><p>这段介绍十种行，以十种行来观察苦谛，才能悟入苦谛的四行，最后才能由四行证得苦谛。</p><p>原文：<strong>此中且依。至教量理。如世尊说。诸行无常。又此诸行。略有二种。一有情世间。二器世间。世尊依彼有情世间。说如是言。苾刍当知。我以过人。清净天眼。观诸有情。死时生时。广说乃至。身坏已后。。当生善趣。天世界中。由此法门。显示世尊。以净天眼。现见一切有情世间。是无常性。</strong></p><p>释：观察苦谛要依世尊所讲的至教量之理，比如世尊所说的诸行无常之理。诸行无常即是苦，观行诸行无常即是观行苦谛和苦集谛。佛说诸行无常的行大略有两种：一种是有情世间，二种是器（无情）世间。佛说：我以超过人类的清净天眼。观诸有情死时生时。广说乃至身坏已后。当生善趣天世界中。此法门显示世尊以净天眼现见一切有情世间是无常性。</p><p>从这段开始，世尊具体开示诸行无常。行，是指有生住异灭的法，凡是能生住异灭的都是行，一切行名为诸行，诸行都是无常的，因为有生住异灭的现象。这些现象世尊以清净的天眼悉皆得见。佛无论见任何法，世间和出世间一切法全部是现见，没有非现见的比度思量和非量臆想，智慧究竟圆满之故。众生见法则分为现量、比量和非量三种，佛完全是现量，众生则不如此。器世间的无常可以参看长阿含经中的起世因缘经所讲述的器世间的生住异灭。</p><p>原文：<strong>又世尊言。苾刍当知。此器世间。长时安住。过是已后。渐次乃至。七日轮现。如七日经广说。乃至所有大地。诸山大海。及苏迷卢大宝山王。乃至梵世诸器世界。皆被焚烧。灾火灭后。灰烬不现。乃至余影。亦不可得。由此法门。世尊显示。诸器世间。是无常性。如是且依。至教量理。修观行者。净信增上。作意力故。于一切行。无常之性。获得决定。得决定已。即由如是。净信增上。作意力故。数数寻思观察。一切现见不背。不由他缘。</strong></p><p>释：世尊在起世因缘经中说：比丘们，你们应当知道，娑婆世界这个器世间现在还能长时间安稳地住着，过了这段时间以后，渐渐地就会出现两个太阳、三个太阳，乃至于最后会出现七个太阳，如七日经中所说的那样，这时候器世间里所有的大地、诸山和大海，以及欲界天上的须弥山，乃至于色界所有的器世间全部都被烧毁。火灾过去之后灰尘也消失不见了，甚至连任何影像都找不到了。</p><p>世尊讲的这些事情正显示出一切器世间的无常性。听闻世尊开示，依止世尊所说的至教量理，修习观行者对于诸行无常的净信得到增上，作意于诸行无常的能力增强，于是就对一切行无常之性获得决定。心得决定以后，再由此种净信增上作意力，不断地寻思和观察诸行无常性，就现见一切行的无常性，与至教量理不相违背，这样的现见不是由于其他的因缘提示出来的，而是因为如实观察，自心现见。</p><p>观察诸行无常，需要依靠净信力，相信世尊所言诸行无常，心清净不作他想。由于净信，才能作意观察寻伺诸行无常性，如果不净信，不相信诸行无常，就不会作意观察。观察是自心现见，如果不是现见，就不叫作现前观察了。自心现见也叫作现量观察、现量所证，现是现前存在、真实存在的意思，不是思惟想象脑补出来的。修行者通过熏习世尊的诸行无常至教量理，在禅定中观察诸行的无常性，缘熟时就会现见诸行确实无常，进而实证苦谛。因为现见诸行是苦，于是不愿再受苦，灭苦之愿望就生出来了。</p><p>原文：<strong>无常之性。云何数数。寻思观察。谓先安立。内外二事。言内事者。谓六处等。言外事者。有十六种。一者地事。谓城邑聚落。舍市廛等。二者园事。谓药草丛林等。三者山事。谓种种山。安布差别。四者水事。谓江河陂湖。众流池沼。五者作业事。六者库藏事。七者食事。八者饮事。九者乘事。十者衣事。十一者庄严具事。十二者舞歌乐事。十三者香鬘涂饰事。十四者资生具事。十五者诸光明事。十六者男女承奉事。如是名为十六种事。</strong></p><p>释：诸行无常之性，如何不断地寻思观察？先安立五阴身内外二事，内事即眼耳鼻舌身意六处等。外事是吃穿住用行等十六种：第一种是地事，包括城邑、部落、舍宅、交易场所等等；第二种是园事，包括种植药、花草树木之处；第三种是山事，包括高山、丘陵等等大小不同的山；第四种是水事，包括江河、大海、湖泊、池塘等等有水聚集之处；第五种是作业事；第六种是库藏事；第七种是饮食之事；第八种是饮水之事；第九种是车乘之事；第十种是穿衣之事；第十一种是庄严具事；第十二种是歌舞音乐之事；第十三种是香花涂鬘装饰之事；第十五种是光明照耀之事；第十六种是男女承奉事。</p><p>这些事都是世俗界的无常之事，这些法之所以是无常的，是因为都是有为造作出来的生住异灭的法，生之后念念不停留，不断地变异，直至毁灭。众生从小到大一直都在做这些无常事，却不觉得无常，修习了至教量理之后，意识很容易理解这些事的无常性，可是意根愚钝不容易接受，所以才需要修习戒定慧，在禅定中观行，最后证得无常性。证得就是现见，现见是现前观察到了法的无常性，不是凭意识思惟和理解的，无常性清晰地呈现出来，不得不信服，立即接受了就是证得，并且出现三昧，内心处于对法无常的感知当中而不动摇。</p><p>原文：<strong>安立如是。内外事已。复于彼事。现见增上。作意力故。以变异行。寻思观察。无常之性。此中内事。有十五种。所作变异。及有八种。变异因缘。云何内事。有十五种。所作变异。一分位所作变异。二显色所作变异。三形色所作变异。四兴衰所作变异。五支节具不具。所作变异。六劬劳所作变异。七他所损害。所作变异。八寒热所作变异。九威仪所作变异。十触对所作变异。十一杂染所作变异。</strong></p><p>释：安立了这些内外事之后，又为了能够现见这些事，加强了见法的作意力，从诸法变异这个角度来寻思、观察内外事的无常性，其中内事有十五种变异，有八种变异的因缘。内事都有哪十五种变异？一种是色身处于不同时期的分位变异；二种是在显色上出现的变异，如肤色的黑白赤黄等；三种是在形色上出现的变异，如高矮胖瘦等等；四种是在色身的兴衰上出现的变异，如有力气和无力气等等；五种是在身根肢节上出现的变异，如断胳膊断腿等残缺；</p><p>六种是在劳作上出现的变异，如劳累和不劳累等等；七种是在被人所损害上出现的变异，如被人欺凌、诬陷、诽谤、损害名声等等；八种是在冷热上出现的变异，如发烧、畏寒等等；九种是在威仪进止上出现的变异，如色身懒散、弯腰驼背、行动不便等等；十种是在接触的对象上出现的变异，如接触的人事物的变动和改变；十一种是在有杂染心所作的事情上出现的变异，如善恶业的转变；十二种是在身体疾病上出现的变异，原来健康，现在出现病苦等等；十三种是在死亡上出现的变异，生命终了了；十四种是死后身体出现了青淤肿胀的变异；十五种是死后出现尸体消失不见，骨灰也无影无踪的变异。</p><p>原文：<strong>云何八种。变异因缘。一积时贮畜。二他所损害。三受用亏损。四时节变异。五火所焚烧。六水所漂烂。七风所鼓燥。八异缘会遇。</strong></p><p><strong>积时贮畜者。谓有色诸法。虽于好处。安置守护。而经久时。自然败坏。其色衰损。变异可得。他所损害者。谓种种色法。若为于他。种种捶打。种种损害。即便种种。形色变异。受用亏损者。谓各别属主。种种色物。受者受用。增上力故。损减变异。</strong></p><p>释：什么是八种变异因缘？一种是积时贮畜；二种是他所损害；三种是受用亏损；四种是时节变异；五种是火所焚烧；六种是水所漂烂；七种是风所鼓燥；八种是异缘会遇。</p><p>积时贮畜的意思是，对于有色相的诸法，虽然能放置在妥当之处保存着，但是经过长久之时，还是会自然败坏，其色相会出现衰损变异的现象。他所损害的意思是，种种色法或者是被他人用种种的方式捶打，用种种的方式损害，于是便有种种产生变异的形色。受用亏损的意思是，各个不同的属于使用者的种种有色物质，由于受用者不断地使用，而出现磨损变异的现象。</p><p>原文：<strong>时节变异者。谓秋冬时。丛林药草。华叶果等。萎黄零落。于春夏时。枝叶华果。青翠繁茂。火所焚烧者。谓大火纵逸。焚烧村邑。国城王都。悉为灰烬。水所漂烂者。谓大水洪漫。漂荡村邑。国城王都。悉皆沦没。风所鼓燥者。谓大风飘扇。湿衣湿地。稼穑丛林。干韅革日枯槁。</strong></p><p>释：时节变异的意思是，在秋冬时节，丛林里、药草、花、叶和果实等等都萎黄零落了，在春夏之时，丛林、药草、枝叶、花果又开始生长出来，青翠繁茂。火所焚烧的意思是，大火燃烧起来，焚烧了村庄和聚落，国城和王宫都被烧成了灰烬。水所漂烂的意思是，大水漫布，淹没了村庄和聚落，国城和王宫都被洪水淹没了。风所鼓燥的意思是，大风刮起的时候，潮湿的衣服和土地、庄稼和丛林，都被吹干燥了，越来越枯槁。</p><p>原文：<strong>异缘会遇者。谓缘乐受触。受乐受时。遇苦受触。缘苦受触。受苦受时遇乐受触。缘不苦不乐受触。受不苦不乐受时。遇乐受触。或苦受触。又有贪者会遇瞋。缘贪缠止息。发起瞋缠。如是有瞋痴者。会遇异分。烦恼生缘。当知亦尔。如是眼识。正现在前。会遇声香味触境等。是名八种。变异因缘。一切有色。及无色法。所有变异。皆由如是。八种因缘。除此更无。若过若增。</strong></p><p>释：异缘会遇的意思是，缘于乐受的触对，应该受乐受的时候，却遇到了苦受的触；缘于苦受的触，应该受到苦受的时候，却遇到了乐受的触；缘于不苦不乐受的触，应该受到不苦不乐受时，却遇到了乐受的触或者是苦受的触。另外还有，贪心的人却遇到了嗔的缘，这边止息了贪的烦恼缠缚，那边嗔的烦恼缠缚却生起来了，如是有嗔和痴的人，会遇到非嗔非痴的烦恼出生的缘，也是这样。同样地，当眼识正现前的时候，就会遇到声香味触的境界缘，这就是八种变异因缘。一切有色的法和无色的法的所有变异，都是由这八种因缘造成的，除此之外再也没有其他什么因缘了。</p><p>这里的异，是改变的意思，所遇的缘改变了，因改变，果也就改变了。因缘变异大体分为这八种，细分可能会很多。因为缘会改变，所以是无常，因为果会改变，所以也是无常，由因缘变异能完全充分地显示无常。</p><p>原文：<strong>云何寻思。内事分位所作。变坏无常之性。谓由观见。或自或他。从少年位。乃至老位。诸行相续。前后差别。互不相似。见是事已。便作是念。如是诸行。其性无常。何以故。此内分位。前后变异。现可得故。</strong></p><p>释：如何观察色身分位出现的变坏无常之性？从观察自己或者是他人从少年位开始到年老位这段时间里，诸行相续变异，前后的差别现象，没有相似之处。观察到这些现象以后，心里应该有这样的观念：这些诸行其性真是无常的。为什么会得出这个结论？因为在色身上的内分位中，从小到老，前后的变化和差异，确实是现前可以观察到的。</p><p>原文：<strong>云何寻思。内事显色所作。变异无常之性。谓由观见。或自或他。先有妙色。肌肤鲜泽。后见恶色。肌肤枯槁。复于后时。还见妙色。肌肤鲜泽。见是事已。便作是念。如是诸行。其性无常。何以故。此内显色。前后变异。现可得故。</strong></p><p>释：如何观察内身事眼识所见的显色上，所出现的变异无常之性？观察自己和他人原先有美妙的肤色，肌肤鲜嫩润泽，后来却发现肤色变坏了，枯槁了，不再鲜嫩润泽了，过了一段时间又看见色泽美妙肌肤润泽了。观察到这些现象以后，心里便想，像这样的诸行，其性确实是无常的。为什么这样说呢？因为这些身内的显色前后不同，变异无常，现前就可以观察得到。</p><p>原文：<strong>云何寻思。内事形色。所作变异。无常之性。谓如说显色。如是形色。由肥瘦故。应知亦尔。云何寻思。内事兴衰。所作变异。无常之性。谓由观见。或自或他。先时眷属财位。或见悉皆兴盛。后见一切。皆悉衰损。复于后时。还见兴盛。见是事已。便作是念。如是诸行。其性无常。何以故。兴衰变异。现可得故。</strong></p><p>释：如何观察内身事在形色上出现的变异无常之性？就像所观察到的显色那样，形色在胖瘦方面也是同样的道理。如何观察内身事在兴衰上出现的变异无常之性？观察自己和他人从前的眷属和财产、地位，有时看见都是兴盛的，后来却都衰损了，再以后又看见兴盛了。观察到这些现象以后，心里就有这样的感想：像这样的诸行，其性确实是无常的。为什么呢？因为家财眷属的兴衰变异，现前可以观察得到。</p><p>原文：<strong>云何寻思。内事支节。所作变异。无常之性。谓由观见。或自或他。先时支节。无有缺减。后时观见。支节缺减。或王所作。或贼所作。或人所作。或非人作。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事在肢节上所出现的变异无常之性？看见自己或者是他人的肢节，先前时并没有缺减，后来就看见肢节有缺减了，这个事情或者是国王惩罚造成的，或者是贼寇抢劫时造成的，或者是他人造成的，或者是非人造成的，观察到这些现象以后，心里就有这样的观念出现：如是诸行，其性确实是无常的。</p><p>原文：<strong>云何寻思。内事劬劳。所作变异。无常之性。谓由观见。或自或他。身疲劳性。身疲极性。或驰走所作。或跳踊所作。或趒踯所作。或骗骑所作。或作种种。迅疾身业。复于余时。见彼远离。疲劳疲极。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事身体劳累，所出现的变异无常之性？观察自己或者是他人身体的疲劳性，身体的极度疲乏性，或者是由于快速地行走所造成的，或者是由于跳跃所造成的，或者是反复蹬跳所造成的，或者是骑马所造成的，或者是作种种快速的身行所造成的，然后又在后来这种极度的疲劳没有了、消失了。观察到这些现象时，心里就有这样的观念：如是诸行，其性真是无常。</p><p>原文：<strong>云何寻思。内事他所损害。所作变异。无常之性。谓由观见。或自或他。他所损害。其身变异。或由刀杖鞭革。皮绳矛槊等坏。或由种种。蚊虻蛇蝎。诸恶毒触。之所损害。复于余时。见不变异。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事被人所损害，身体出现的变异无常之性？由于观察到了自己或者是他人，被人所损害，身体发生了变异，或者是由于刀杖鞭打、结实的绳子和长矛、箭等所毁坏，或者是由于种种蚊虻、蛇蝎等等的恶毒所毒害，可是后来又看见身体好了，没有了变异现象。观察到这些现象之后，心里便有这样的观念：如是诸行真是无常。</p><p>原文：<strong>云何寻思。内事寒热。所作变异。无常之性。谓由观见。或自或他。于正寒时。身不舒泰。踡局战栗。寒冻缠逼。希遇温阳。于正热时。身体舒泰。奋身干语。霡霂流汗。热渴缠逼。希遇清凉。复至寒时。还见如前。所说相状。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事由于寒热，所出现的变异无常之性？由于观察到了自己或者是他人，在特别寒冷的时候，身体很不舒服，蜷曲着身体浑身战栗，寒冷逼身，希望得到温暖的阳光。或者观察到在特别炎热时，身体都舒展开，全身燥热，口干舌燥。满身流汗如下雨一样，又热又渴，希望能遇到清凉。过后到寒冷时节，又看到前边所说的现象和状态。观察到这些现象，心里便有这样的观念：如是诸行，其性真是无常。</p><p>原文：<strong>云何寻思。内事威仪。所作变异。无常之性。谓由观见。或自或他。行住坐卧。随一威仪。或时为损。或时为益。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事在四威仪上，所出现的变异无常之性？由于观察到自己或者他人在行住坐卧时，随着一个威仪，有时候减损，有时候增益，观察到这些现象以后，心里就出现这样的观念：如是诸行，其性真是无常的。</p><p>原文：<strong>云何寻思。内事触对。所作变异。无常之性。谓由触对。顺乐受触。领乐触缘。所生乐时。自能了别。乐受分位。如能了别。乐受分位。如是了别。苦受分位。不苦不乐受分位。应知亦尔。彼由了别。如是诸受。前后变异。是新新性。非故故性。或增或减。暂时而有。率尔现前。寻即变坏。知是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事在触对的时候，所出现的变异无常的之性？由于触到了顺心的乐受触，领受由乐触的缘所出生的乐受时，自然地就能了别到乐受的分位。就像能了别乐受分位一样，了别苦受分位也是这样，了别不苦不乐受的分位同样是这样。由于了别了这三种受的前后变异，受不断地更新变化，不是如最初那样的一成不变，三种受有时增加有时减少，各种受只是暂时而有，突然现前，不久就变灭了。观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事杂染。所作变异。无常之性。谓能了知。先所生起。或有贪心。或离贪心。或有瞋心。或离瞋心。或有痴心。或离痴心。又能了知。随一一种。诸随烦恼。所染污心。又能了知。随一一种。诸随烦恼。不染污心。又能了知。彼心相续。由诸烦恼。及随烦恼。于前后位。趣入变坏。不变坏性。见是事已。便作是念。如是诸行。其性无常。何以故。心由杂染。所作变异。现可得故。</strong></p><p>释：如何观察内身事由于杂染，所造成的变异无常之性？能了知先前所生起的杂染心，或者是有贪心，或者是离贪心；或者是有嗔心，或者是离嗔心；或者是有痴心，或者是离痴心。又能了知随着每一种随烦恼所生出的染污心，也能了知随每一种随烦恼所生出的不染污心。又能了知杂染心相续地，由诸烦恼及随烦恼，前后顺次进入变坏和不变坏之性。观察到这些现象以后，心里就出生这样的念想：如是诸行，其性真是无常。为什么呢？心由于杂染所生出的变异，现前可以观察得到。</p><p>原文：<strong>云何观察。内事疾病。所作变异。无常之性。谓由观见。或自或他。先无疾病。安乐强盛。后时观见。或自或他。遭重病苦。触对猛利。身诸苦受。如前广说。复于余时。还见无病。安乐强盛。见是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事由于疾病所出现的变异无常之性？由于观察到自己或者是他人先前并无疾病，身心安乐强健，后来又看见自己或者是他人遭受了严重的病苦，病的很厉害，感受非常痛苦，再过后却观察到自己或者是他人又没病了，身心安乐强健。观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事终殁。所作变异。无常之性。谓由观见。今时存活。安住支持。复于余时。观见死没。唯有尸骸。空无心识。见是事已。便作是念。如是诸行。其性无常。云何观察。内事青瘀等。所作变异。无常之性。谓由观见。死已尸骸。或于一时。至青瘀位。或于一时。至脓烂位。如是乃至。骨锁之位。见是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事在死亡上，所出现的变异无常之性？观察到他人当时还存活着，安稳住世，又在后来发现他死亡了，只剩下了尸体，却没有了心识。观察到这个现象以后，心里便有这样的念想：如是诸行，其性真是无常。如何观察内身事在尸体青淤等等位，所出现的变异无常之性？观察已经死去的尸体，在一时间出现青淤肿胀的现象，一时间尸体出现脓肿溃烂的现象，最后只剩下了一堆骨头。观察到这些现象以后，心里就生起这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事一切。不现尽灭。所作变坏。无常之性。谓由观见。彼于余时。此骨锁位。亦复不现。皆悉败坏。离散磨灭。遍一切种。眼不复见。见是事已。便作是念。如是诸行。其性无常。何以故。如是色相。数数改转。前后变异。现可得故。</strong></p><p>释：如何观察内身事一切法都不出现，全部都灭尽了，所显现出来的变坏无常之性？观察身体在后时剩下的一堆骨头也都没有了，全部都败坏了，消散了，磨灭了，每一种色物，眼睛都看不见了。观察到这些现象以后，心里便有这样的念想：如是诸行，其性真是无常。为什么这样说呢？死后尸体的色相不断地发生转换，前后变异的现象都可以现前观察得到。</p><p>原文：<strong>如是且由。现见增上。作意力故。十五种行观。察内事。种种变异。无常之性。观察是已。复更观察。十六外事。种种变异。无常之性。云何观察。地事变异。无常之性。谓由观见。此地方所。先未造立道场。天寺宅舍。市廛城墙等事。后见新造。善作善饰。复于余时。见彼朽故圮坼。零落颓毁穿缺。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。何以故。如是色相。前后转变。现可得故。</strong></p><p>释：如是，由现量所见的增上作意力，观察了十五种内事的种种变异无常之性，之后再接续观察十六种外事的种种变异无常之性。如何观察地事的变异无常之性？观察此地所处之方所，先前并未建造道场、寺庙、舍宅、市场、城墙等等，后来在此地新建了这些建筑物，又在后来，看见这些建筑物破旧拆毁了，或者零落衰败坍塌了，或者被火烧毁了，或者被水冲倒了。观察到这些事情以后，心里便有这样的念想：如是诸行，其性真是无常。为什么这样说呢？因为其色相的前后转变，现前是可以观察得到的。</p><p>原文：<strong>云何观察。园事变异。无常之性。谓先观见。诸园苑中。药草丛林。华果枝叶。悉皆茂盛。青翠丹晖。甚可爱乐。复于后时。见彼枯槁。无诸华果。柯叶零落。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察园林变异无常之性？先前看见所有园林中药草、丛林、花果枝叶，全都是茂盛的，红花绿叶很是可爱，又在后来之时，却看见这些植物都枯槁了，再也没有花果了，叶子都零落下来，或者被火焚烧了，或者被水冲倒了。观察到这些现象以后，心里便想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。山事变异。无常之性。谓于一时。观见其山。丛林蓊郁。耸石巉岩。复于一时。见彼丛林。巉岩耸石。雕残颓毁。高下参差。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察山川山脉变异无常之性？在某一时间里看见山脉林木茂盛，山岩林立高耸入云，又在后一时间看见那个丛林林立的山岩凋零残毁，颓然欲倒，参差不齐，或者是被火焚烧，或者是被水冲倒，观察到这些事以后，心里便想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。水事变异。无常之性。谓先一时。见诸河渎。池泉井等。涛波涌溢。醴水盈满。后于一时。见彼一切。枯涸干竭。见是事已。便作是念。如是诸行。其性无常。余如前说。云何观察。业事变异。无常之性。谓先一时。见彼种种。殉利牧农。工巧正论。行船等业。皆悉兴盛。复于一时。见彼事业。皆悉衰损。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察河水等等变异无常之性？先前某一时间看见诸河流、泉池、井等水流波涛汹涌，甘美的水盈满其中，在后来某一时间里，却见一切河流泉池全都枯竭干尽了。观察到这些现象以后心里便想：如是诸行，其性真是无常。如何观察所作业用的变异无常之性？在先前某一时间看见用来谋取世俗之利的农牧业、建筑科学各种技术以及世间里正当的演说辩论，还有船舶运输之业，都很兴盛，又在后来的某一时间，看见这些事业全部都衰落了，观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。库藏变异。无常之性。谓由观见。种种库藏。一时盈满。一时灭尽。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。饮食变异。无常之性。谓由观见。种种饮食。一时未办。一时已办。一时入口。牙齿咀嚼。和杂涎唾。细细吞咽。一时入腹。渐渐消化。一时变为。屎尿流出。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察库藏变异无常之性？观察到种种库藏此时盈满，又在彼时消失灭尽，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。如何观察饮食变异无常之性？观察到种种饮食，此一时还没有做好，彼一时就做好了，此一时入口咀嚼，和着唾液慢慢地吞咽，彼一时饮食入腹消化了，然后就变为屎尿排泄出去，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。乘事变异。无常之性。谓于一时。见种种乘。新妙庄严。甚可爱乐。复于一时。见彼朽故。离诸严饰。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。衣事变异。无常之性。谓由观见。种种衣服。一时新成。一时故坏。一时鲜洁。一时垢腻。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察车乘之事变异无常之性？在某一时间看见种种车乘还很新、很美妙庄严，令人爱乐，又在另一时间看见这些车乘腐朽衰败了，不美妙也不庄严了。观察到这些现象，便有这样的念想：如是诸行，其性真是无常。如何观察衣服之事变异无常之性？看见种种衣服，此时是新制成的，彼时变旧了、毁坏了，此时新鲜干净，彼时就充满污垢。观察到这些现象，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。严具变异。无常之性。谓由观见。诸庄严具。一时未成。一时已成。一时坚固。一时破坏。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。舞歌乐事。所有变异。无常之性。谓由观见。舞歌伎乐。现在种种。音曲差别。异起异谢。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察庄严之具变异无常之性？看见种种庄严之具，此时还没有制成，彼时就完工了，此时坚固，彼时就散坏了。观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。如何观察歌舞伎乐之事变异无常之性？观察正在演奏的歌舞伎乐，有种种的音声和曲调差别，此时起彼时灭，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。香鬘涂饰。所有变异。无常之性。谓先观见。种种香鬘。鲜荣芬馥。后时见彼。萎悴臭烂。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。资具变异。无常之性。谓观见彼。未造已造。成满破坏。前后变异。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察香鬘涂饰所有变异无常之性？现前看见种种香鬘，荣华艳丽，香气四溢，后来又见香鬘萎黄，碎烂臭秽，看见这些现象，便有这样的念想：如是诸行，其性真是无常。如何观察资生之具变异无常之性？观察资生之具先前还未造就出来，后来打造出来了，用过之后又被破坏掉了，前后不断地变异，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。光明变异。无常之性。谓由观见。种种明闇。生灭变异。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。男女承奉。所有变异。无常之性。谓观见彼。或衰或盛。不久坚住。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察光明变异无常之性？看见了种种明暗相的生灭变异，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。如何观察男女互相恩爱的变异无常之性？观察到男女恩爱由盛到衰，由衰到盛，不能长久，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>如是一切。外事诸行。前之六种。是所摄受事。后之十种。是身资具事。以要言之。当知其性。皆是无常。何以故。形相转变。现可得故。由如是等。如前所说。</strong></p><p>释：如是这一切的外事诸行，前边六种是五阴身所摄受的事，后边十种是身体所需要的资具之事。总而言之，这些法其性都是无常的。为什么这样说呢？因为这些法的形和相的转变，是现前可以观察得到的，如前边具体所说的那样。</p><p>原文：<strong>诸变异行。现见增上。作意力故。于内外事。如其所应。以变异行。观察一切。是无常性。由是因缘。于诸变异。无常之性。现见不背。不由他缘。非他所引。随念观察。审谛决定。即由如是。所说因缘。说名现见。增上作意。即由如是。现见增上。作意力故。观察变异。无常性已。彼诸色行。虽复现有。刹那生灭。灭坏无常。而微细故。非现所得。</strong></p><p>释：由于有能够现前观察这些不断变异诸行的增上作意力的缘故，观察内事和外事就与变异无常之性相应，从诸行变异的角度来观察一切法都是无常的。由于这个因缘，对于诸行的变异无常之性，能够现前观察，不违背其变异无常性。现见的意思是现量所见，内外事一切法与无常性不相违背，一切法的变异不由他缘所起，不是外在因缘所引起的。</p><p>对于内外一切法无常性的观察和确认，能够随着自己的增上作意力来仔细审查，最后心得决定，由于有这样的因缘，就说现前观察是现见增上作意。也就是说由于有这样的现见增上作意力的缘故，观察诸行变异无常之性以后，那些色行虽然还在，但是却知道都是刹那生灭，灭坏无常的法。因为这些法非常微细的缘故，不是现前所观察得到的。</p><p>原文：<strong>故依现见。增上作意。应正比度。云何比度。谓彼诸行。要有刹那。生灭灭坏。方可得有。前后变异。非如是住。得有变异。是故诸行。必定应有。刹那生灭。彼彼众缘。和合有故。如是如是。诸行得生。生已不待。灭坏因缘。自然灭坏。如是所有。变异因缘。能令诸行。转变生起。</strong></p><p>释：所以依着现见增上作意，应该正确地比度，而知色行的刹那生灭变异。如何比度呢？应该这样认知：诸行一定要有刹那的生灭，色行灭坏了，才能观察得到前后的变异，不是一直那样住着保持不变才能知道变异，因此说诸行一定应该有刹那的生灭。因为是众多的因缘和合才能出现的缘故，所以这些诸行才能出生，出生以后不用等诸行灭坏，其和合的因缘灭了，诸行自然就灭坏了。因此说所有的令诸行变异的因缘，能令诸行发生转变。</p><p>比度也就是比量，依现量见的正比度才能有真实的结果，即比度的依据是现量见，是事实，比度的结果才有可能是事实，否则就是不正比度，比度的结果就不真实，不可信赖。</p><p>色行是色法色蕴的运行，色行虽然是现前、现量可见，但是色法的刹那刹那生灭变异，由于禅定力和慧力不足，却不能现前而见，需要依现前如实所见的色行进行正比度。色法不断地生灭灭坏，色法才能存在和显现才有色行，前后变异才能有色行。如果色法不变异，就没有行，则法不存在。所以色行的刹那生灭变异，需要在现量见色的基础上正比度，才能证知正知。</p><p>原文：<strong>此是变异。生起因缘。非是诸行。灭坏因缘。所以者何。由彼诸行。与世现见。灭坏因缘。俱灭坏已。后不相似。生起可得。非彼一切。全不生起。或有诸行。既灭坏已。一切生起。全不可得。如煎水等。最后一切。皆悉消尽。灾火焚烧。器世间已。都无灰烬。乃至余影。亦不可得。彼亦因缘。后后展转。渐减尽故。最后一切。都无所有。不由其火。作如是事。是故变异。由前所说。八种因缘。令变生起。自然灭坏。</strong></p><p>释：这是诸行变异的现象生起的因缘，不是诸行灭坏的因缘。为什么这样说呢？这从诸行与世间可以现见的灭坏因缘都灭坏以后，再也不会有相似法生起这个现象上看得出来，但不是所有的法都不生起。有的诸行灭坏以后，一切法就都不会生起了，比如烧水，越烧越少，直至最后所有的水都消失不见了。</p><p>再比如三灾中的火灾，把器世间都焚烧了以后，连灰烬都不存在了，甚至连影子也看不见了。这也是由于因缘不断变异，使得诸行渐渐减少，直至都灭尽了，最后一切法都不存在了。器世间都灭尽，不是由于火灾的缘故而灭尽的。因此说诸行变异是由于前边说的八种因缘，使得变异现象生起，诸行自然灭坏。</p><p>诸行生起的因缘是法的变异，不是法的灭坏，灭坏以后就没有法，没有诸行了。诸行灭坏也代表无常和苦。</p><p>原文：<strong>如是比度。作意力故。由灭坏行。于彼诸行。刹那生灭。灭坏无常。而得决定。于如是事。得决定已。复于他世。非所现见。诸行生起。应正比度。云何比度。谓诸有情。现有种种。差别可得。或好形色。或恶形色。或上族姓。或下族姓。或富族姓。或贫族姓。或大宗叶。或小宗叶。或长寿命。或短寿命。言或威肃。或不威肃。或性利根。或性钝根。如是一切。有情差别。定由作业。有其差别。方可成立。非无作业。如是有情。色类差别。定由先世。善不善业。造作增长。种种品类。</strong></p><p>释：由于有这样的比度作意力的缘故，从诸灭坏行上，观察诸行刹那生灭，灭坏无常，而得出结论：诸行变异无常。对这些事作出决定以后，又对于前世和后世的诸行不能现见诸行的生起，所以应该正比度。如何比度呢？诸有情现前有种种差别是可以观察得到的，或者有好的相貌，或者有恶的相貌；有的是高贵的家族种姓，有的是低贱的家族种姓；有的是来自于大家族，有的是来自于小家族；有的长寿，有的短寿；有的说话威严冷肃，有的说话不威严冷肃；有的根性比较利，有的根性比较钝。</p><p>如是一切有情差别，一定是由其所作的业行有差别才可以成立，不是没有所作业行。如是有情的色相种类差别，一定是由先世所造作的善业和不善业的缘故，增长互相之间的种种品类差别。</p><p>正比度是根据已心得决定的现见，进行对比思量，如果不是根据现见，其所比对思量为不正比度，不正比度非智慧所摄，正比度获智慧。</p><p>原文：<strong>由彼因缘。于今自体。差别生起。不应自在。变化为因。何以故。若说自在。变化为因。能生诸行。此所生行。为唯用彼。自在为缘。为待余缘。如是自在。方能变化。若唯用彼。自在为缘。是则诸行。与彼自在。俱应本有。何须更生。</strong></p><p>释：由于种种因缘，如今种种诸行的自体差别显现出来了，诸行自体差别的出现，其原因不应该是在于自在变化。为什么这样说？因为如果说自在变化是出生诸行的因，以此因所生的诸行，是只以自体的自在为缘，还是还需要其他的缘，这样的自在才能发生变化？如果是只以自体的自在为缘，那么诸行和其自在都应该是本来而有，既然是本来而有，还需要再出生吗？</p><p>原文：<strong>若言先有。自在体性。然后行生。是则诸行。不唯自在。为缘生起。若言自在。随其所欲。功用祈愿。方能造化。是故亦用。欲为因缘。非唯自在。若尔此欲。为有因耶。为无因耶。若言有因。即用自在。以为因者。此则同前。所说过失。不应道理。若言此欲。更有余因。是则如欲。功用祈愿。离自在外。余法为因。如是亦应。一切诸行。皆用余法。以为其因。何须妄计。无用自在。</strong></p><p>释：如果说原来就有自在体性，然后诸行得生，那么这样的诸行，不是只有以自在为缘生起的。如果说自在能随其所欲，其功能作用需要通过乞求和发愿才能造化诸行，那么诸行也是以欲为因缘出生的，不是只有自在为缘。如果是这样的话，这个欲是有因还是无因出现起用的？如果说是有因，是以自在为因的，这就有与从前所说的有同样的过失，这个理说不通。如果说这个欲的出现还有别的因，那就像欲的功用一样，是通过祈愿而实现的，离开自在还有别的法作为生起的因。如果是这样的话，一切诸行都是以其他的法作为生起的因，如何还会虚妄地计着自在是因？</p><p>原文：<strong>由如是等。比度增上。作意力故。于有他世。诸行生起。获得决定。如是略由。三种增上。作意力故。寻思观察。内外诸行。是无常性。谓净信增上。作意力故。现见增上。作意力故。比度增上。作意力故。于前所举。能随顺修。无常五行。已辩变异。灭坏二行。</strong></p><p>释：由以上这些比度增上作意力的缘故，对于有前世和后世诸行的生起这件事，就会生起决定心和确定心。大略地由三种增上作意力，能寻思观察出内外诸行是无常性的，三种增上作意力分别是：净信增上作意力、现见增上作意力和比度增上作意力。对于前边所列举出的内外诸行，能够随顺修习五种无常行。以上就对变异和灭坏两种行辨别完毕。</p><p>当需要观行前世和后世的五蕴无常的时候，需要以现世对五蕴如实现量观行的基础上，正比度观行前世和后世的五蕴，以获得证知，所比度的二法应该是同类，非同类法则不能比度。以对当前的五蕴如实现量观行的基础上，可以正比度观行已经过去的五蕴，以及以后将会出现的五蕴，这样可以获得证知，对诸行无常能够心得决定，得以确认。</p><p>原文：<strong>云何复由。别离行故。观无常性。谓依内外。二种别离。应知诸行。是无常性。依内别离。无常性者。谓如有一。先为他主。非奴非使。能自受用。能驱役他。作诸事业。彼于后时。退失主性。非奴使性。转得他奴。及所使性。于主性等。名为别离。无常之性。</strong></p><p>释：如何又由别离行来观察无常性？依着内外二种别离，应该知道诸行是无常性的。依着内别离无常性的意思是说，如果有一个人先前是别人的主人，他自己不是别人的奴隶和走使，自己能完全作主，也能驱使别人作诸事业。这个人后来不再当主人了，退失了主人之性，和非奴隶走使之性，转而变为别人的奴隶和走使之性，那么这个人对于主人之性等等，名为别离无常之性。</p><p>原文：<strong>依外别离。无常性者。谓现前有。资生财宝。先未变异。未为别离。无常灭坏。后时为王。盗贼非爱。及共财等。之所劫夺。或由恶作。加行失坏。或方便求。而不能得。如是等类。应知是名。由别离行。知无常性。</strong></p><p>释：依着外别离无常性的意思是说，现前有可以资生的财宝，先前并没有发生变异，财宝还没有别离，没有无常变坏，后来就被国王没收了，被盗贼盗走了，被不是亲爱的人所劫夺了，成为别人的共同财产而流失了，或者是由于强力蛮力而弄坏了，或者是再想方便地求取而不能得到了。从这些现象上就应该知道，这叫作由别离行知无常性。</p><p>原文：<strong>云何复由。法性行故。观无常性。谓即所有。变异无常。灭坏无常。别离无常。于现在世。犹未合会。于未来世。当有法性。如实通达。如是诸行。于未来世。当有法性。如是等类。名为通达。法性无常。</strong></p><p><strong>云何复由。合会行故。观无常性。谓即如是。变异无常。灭坏无常。别离无常。于现在世。合会现前。如实通达。如是诸行。于现在世。现前合会。如是等类。名为通达。合会无常。彼于如是。内外诸行。五无常性。由五种行。如其所应。作意修习。多修习故。获得决定。</strong></p><p>释：如何再由法性之行来观察无常性？对于所有变异无常、灭坏无常、别离无常在现在世还没有合会，在未来世应当出现的法性，能够如实通达。这些诸行，在未来世应当出现的法性，像这些等类，就名为通达法性无常。</p><p>如何再由和会行来观察无常性？如是变异无常、灭坏无常、别离无常，在现在世和会现前如实通达。如是诸行在现在世现前和会，像这样等类，名为通达和会无常。对于如是内外诸行的五种无常性，由五种行，如其所应该作的那样作意修习。由于多多修习的缘故，于无常性心就获得决定。</p><p>原文：<strong>如是由证成道理。及修增上故。于无常行。得决定已。从此无间。趣入苦行。作是思惟。如是诸行。皆是无常。是无常故。决定应是。有生法性。如是诸行。既是生法。即有生苦。既有生苦。当知亦有。老病死苦。怨憎会苦。爱别离苦。求不得苦。如是且由。不可爱行。趣入苦行。如是复于。有漏有取。能顺乐受。一切蕴中。由结缚行。趣入苦行。</strong></p><p>释：如是由实证之理，以及修行增上的缘故，心中对于无常性已经心得决定，从此以后就会无间断地趣入苦行的修行过程中。在修习苦行时，这样思惟：这些诸行都是无常，因为是无常的缘故，决定应该是有出生的法性，这些诸行既然是生法，就有生苦，既然有生苦，当知也有老病死苦、怨憎会苦、爱别离苦、求不得苦。这样暂且由不可爱行，进入到苦行的修习阶段，再在有漏的有所取着的，能够随顺乐受的一切蕴中，由观察结缚行，进入苦行的修习阶段。</p><p>通过观行证得诸行无常以后，心就会无间断地思惟三苦、八苦，趣入苦行。无间断地趣入苦行，就是意根与意识同时对于无常法心得决定，确认诸行无常，再共同证得诸行是苦。</p><p>原文：<strong>所以者何。以于爱等结处。生爱等结。于贪等缚处。生贪等缚。便能招集。生老病死。愁悲忧苦。一切扰恼。纯大苦蕴。如是复于。有漏有取。顺非苦乐。一切蕴中。由不安隐行。趣入苦行。所以者何。有漏有取。顺非苦乐。一切诸蕴。粗重俱行。苦乐种子。之所随逐。苦苦坏苦。不解脱故。一切皆是。无常灭法。</strong></p><p>释：为什么这样说？因为在爱等结缚处生出爱等结缚，在贪等结缚处生出贪等结缚，就会招集生老病死忧悲愁苦，一切忧恼纯大苦就聚集起来了。如是再在有漏的，有所取着的，随顺非苦非乐受的一切蕴中，由不安稳行，进入苦行的修习中。为什么这样说？因为有漏有取的，随顺非苦非乐受的一切诸蕴，与粗重烦恼共同运行，是苦乐种子所随逐之处，因为苦苦和坏苦是不解脱的缘故，一切法都是无常的生灭法。</p><p>原文：<strong>如是行者。于能随顺。乐受诸行。及乐受中。由结缚行。趣入坏苦。于能随顺。苦受诸行。及苦受中。由不可爱行。趣入苦苦。于能随顺。不苦不乐受诸行。及不苦不乐受中。由不安隐行。趣入行苦。如是由结缚行。不可爱行。不安隐行。增上力故。于三受中。作如是说。诸所有受。皆悉是苦。如是名为。由无常行。作意为先。趣入苦行。</strong></p><p>释：如是瑜伽行者，在能随顺乐受的诸行，及乐受中，由观察结缚行，进入观察坏苦行；在能随顺苦受诸行，以及苦受中，由观察不可爱行，进入观察苦苦行；在能随顺不苦不乐受诸行，以及不苦不乐受中，由观察不安稳行，进入观察行苦。如是由观察结缚行、不可爱行、不安稳行增上作意力的缘故，在三种受中得出这样的结论：诸所有受悉皆是苦。这叫作由无常行开始作意，是为了先进入苦行的观察中。</p><p>原文：<strong>复作是念。我于今者。唯有诸根。唯有境界。唯有从彼。所生诸受。唯有其心。唯有假名。我我所法。唯有其见。唯有假立。此中可得。除此更无。若过若增。如是唯有。诸蕴可得。于诸蕴中。无有常恒。坚住主宰。或说为我。或说有情。或复于此。说为生者。老者病者。及以死者。或复说彼。能造诸业。能受种种。果及异熟。由是诸行。皆悉是空。无有我故。如是名为。由无所得行。趣入空行。</strong></p><p>释：瑜伽行者又有这样的念想：我现在只有诸根，只有境界，只有从根境相触中所出生的诸受，只有能感受的心，只有假名的我和我所有的法，只有知见，只有假立之法可得，除此再也没有超过于此的更多的法了。同样地，我只有诸蕴可得，在诸蕴中没有常恒、坚住的主宰，或者说我是我，或者说为是有情，或者再把这些法说为是生者、老者、病者以及死者，或者说诸蕴能造诸业，能受种种果以及异熟生。由此道理显示出，诸行皆悉是空，其中没有我。如是名为，由无所得行趣入空行。</p><p>原文：<strong>复作是念。所有诸行。与其自相。及无常相。苦相相应。彼亦一切。从缘生故。不得自在。不自在故。皆非是我。如是名为。由不自在行。入无我行。如是行者。以其十行。摄于四行。复以四行。了苦谛相。谓无常行。五行所摄。一变异行。二灭坏行。三别离行。四法性行。五合会行。苦行三行所摄。一结缚行。二不可爱行。三不安隐行。空行一行所摄。谓无所得行。无我行一行所摄。谓不自在行。彼由十行。悟入四行。</strong></p><p>释：行者又有这样的念想：所有诸行与其自体相，以及无常相、苦相相应，诸行也都是从缘而生，所以不得自在，不自在的缘故都不是我，如是名为由不自在行进入无我行。如是行者以其十种行，摄受四种行，又以四种行明了苦谛相：无常行由五种行所摄：一是变异行，二是灭坏行，三是别离行，四是法性行，五是和会行。苦行是由三种行所摄：一是结缚行，二是不可爱行，三是不安稳行。空行是由一种行所摄受，就是无所得行。无我行是由一种行所摄受，就是不自在行。行者们由这十种行悟入四种行。 </p><p><strong>第二节  如何明了集、灭、道谛相</strong></p><p>修习四圣谛十六行，能明了四圣谛相。由无常、苦、空、无我四种行明了苦谛相；由因、集、起、缘四种行明了集谛相；由灭、静、妙、离四种行明了灭谛相；由道、如、行、出四种行明了道谛相。其中由十种行观察苦谛，悟入苦谛四种行已经讲过了，下面讲如何修习集谛四种行明了集谛相。</p><p>原文：<strong>复由四行。于苦谛相。正觉了已。次复观察。如是苦谛。何因何集。何起何缘。由断彼故。苦亦随断。如是即以。集谛四行。了集谛相。谓了知爱。能引苦故。说名为因。既引苦已。复能招集。令其生故。说名为集。既生苦已。令彼起故。说名为起。复于当来。诸苦种子。能摄受故。次第招引。诸苦集故。说名为缘。</strong></p><p>释：由苦空无常无我四种行，对于苦谛相如实无缪地觉悟以后，再次观察这些苦谛出现的因是什么，苦是如何集聚起来的，苦是如何生起的，苦是依什么缘出现的。只有断除这因、集、起、缘四种行，苦就会随之断除。因此就要观察集谛四种行来断除集谛相。了知爱能引生苦，就说爱是苦因。把苦引出来以后，又能招集起来，令苦出生，就说为苦集。苦生出来以后，令苦受现起，说名为起。又能摄受未来世的诸苦种子，次第招引诸苦集，就说名为缘。</p><p>原文：<strong>复有差别。谓了知爱。是取因故。复能招集。即以其取。为因有故。复能生起。有为上首。当来生故。又能引发。以生为缘。老病死等。诸苦法故。随其所应。当知说名。因集起缘。</strong></p><p>释：四种行之间又有差别，次第不同，了知爱是取的因，爱又能继续招集，取又成为后世有的因，从而能生起后世的有，以有为缘后世五阴出生，又能引发以生为缘的老病死等等诸大苦聚。根据四种行的次第，就分别说为：因、集、起、缘。</p><p>集谛的因是爱，因为有爱，就会产生取，不管取得还是没有取得，都有苦相，后世的有产生出来以后，生相出现，苦相就出现了。只有断除了苦的根源贪爱，才能断除苦。爱的因是受，受的因是触，可以有触和受，但在触和受的时候，没有贪爱，无心于所触所受，就不会有后世的苦出现，集谛就灭。既然现在的爱是引发苦的因，爱的集起能令苦出生，爱集就是苦集。苦生以后，苦受现起，这叫作苦起。由于爱能摄受未来的苦种子，爱所招集的都是苦种子，能生未来的苦，爱、取、有、生、老次第招引诸苦的集起，所以爱是苦的缘。</p><p>集谛属于十二因缘中的一个环节，解脱之道，声闻法与缘觉法互相含摄，都有共通之处，没有独立的缘觉法，也没有独立的声闻法，只不过二种法涉及到的层次深浅有差别而已，而解脱无别。</p><p>原文：<strong>复有差别。谓正了知。烦恼随眠。附属所依。爱随眠等。是当来世。后有生因。又正了知。彼所生缠。随其所应。是集起缘。谓后有爱。能招引故。即是其集。此后有爱。复能发起。喜贪俱行爱。此喜贪俱行爱。复与多种。彼彼喜爱为缘。如是依止。爱随眠等。及三种缠。能生后有。及能发起。诸爱差别。是故说名。因集起缘。如是行者。由四种行。了集谛相。</strong></p><p>释：四种行还有差别，正确如实了知烦恼随眠是附属于爱随眠的，依止于爱随眠才有烦恼随眠，没有爱就没有烦恼，爱也是烦恼的因，断爱即断烦恼，而爱随眠是未来世三有出生之因；正确了知爱随眠所生出的烦恼缠缚，与其一一相应的是集、起和缘三行，烦恼缠缚能集起苦种子，能让苦现行出来，是产生苦受的缘。</p><p>因为烦恼随眠能招引后有之爱的缘故，所以烦恼随眠能集聚后有之爱，又能发起与喜和贪共同运行的爱，此喜贪俱行爱又能成为种种喜爱的缘。像这样依止爱随眠等等，以及三种缠缚，能出生后世的有，以及能发起种种爱的差别相，因此就说为因、集、起、缘四种行。因为有爱随眠，就会有烦恼缠缚，喜缠缚和贪缠缚，有这三种缠缚，后世的有肯定会出生，有出生，苦就会出生，这样行者就由四种行明了了集谛相。</p><p>原文：<strong>于集谛相。正觉了已。复正觉了。如是集谛。无余息灭。故名为灭。一切苦谛。无余寂静。故名为静。即此灭静。是第一故。是最胜故。是无上故。说名为妙。是常住故。永出离故。说名为离。如是行者。由四种行。了灭谛相。</strong></p><p>释：对于集谛相正确如实明了觉悟以后，还要再正确如实觉悟灭谛四种行。当集谛完全灭尽息灭时，就名为灭，集谛不再集起了，苦就灭。一切苦谛灭了再也没有余苦了，这时就寂静了，没有五蕴造作也没有五蕴受苦了，名为静。这样苦谛息灭寂静了，在世间是第一的，是最胜的，是无上的，就说为妙。苦谛息灭以后无余苦，苦不会再生出来了，这样的状态是永远存在的，永远出离了苦，就说为离。这样瑜伽行者就由灭、静、妙、离四种行明了了灭谛相。</p><p>由灭、静、妙、离四种行明了灭谛相。苦灭是因为集灭了，不再集起苦行，五蕴身的身口意行都是苦行，尤其是恶和不善的身口意行，心不攀缘五蕴世间法，就不再集苦，就得寂静了。心得寂静以后，就自在解脱了，这在世间里就是奇妙美妙的，因为世间里普遍都是攀缘和苦，不寂静不自在不解脱，所以生命不妙。解脱自在的生命在世间里是第一殊胜最殊胜的，所以美妙。灭了苦解脱以后，不会再有苦受了，解脱是永远解脱，不会再退回无明烦恼境界中，永远离苦，所以叫作离。这样灭谛相就由灭、静、妙、离四种行，很清晰地显示出来了。</p><p>原文：<strong>于灭谛相，正觉了已。复正觉了，真对治道。于所知境。能通寻求义故。能实寻求义故。由于四门，随转义故。一向能趣。涅槃义故。所以说名。道如行出。如是行者。由四种行。了道谛相。如是名为。于四圣谛。自内现观。了相作意。</strong></p><p>释：行者对于灭谛相如实正确觉悟以后，最后还要如实正确地觉悟真正地为对治苦所修的道，才能灭苦得解脱。对于所知境，能够普遍地寻求其真实义，能够如实寻求其真实义故，名为如。在修道过程中，其身口意诸行能够随顺于四圣谛理，不断转变清净，名为行。修道之后，心行渐寂渐灭，趣向涅槃，出离生死，名为出。这样瑜伽行者就由道、如、行、出四种行，明了了道谛相。这才叫作于四圣谛从内心里现观的了相作意。</p><p>真对治道是指什么？道是指方式、方法、路径，对治是指对治心中贪嗔痴无明烦恼，无明是不知苦，不知苦集，因此就要对治此不知，变成知，若无无明则不需对治。为了灭苦、断集而修的道，名为道，灭苦的过程就是修道，修戒定慧、三十七道品，思惟观行四圣谛。这是道行。</p><p>如行，是令心与苦空无常无我的真理、法理相应，对于所知境四圣谛法，能通达地深深地思惟其真实理，能如实地思惟观行其法理，了达所知境的内涵正理，从而证得四圣谛真理。行行，在如行断无明的基础上，心行转变，其所有心行随顺于所认知的真理，不与苦空无常无我真实理相违背。出行，通过修道，断除烦恼，身口意行清净，不再攀缘五蕴世间，寂静无为，身心解脱，趣向于涅槃，与涅槃相应，出离三界，解脱生死轮回苦。</p><p>由道、如、行、出四种行明了道谛。由以上四种行可知，在修道的过程中，戒定慧增长，对五蕴世间的认知契合真实理，无明转薄，烦恼转轻，心行不与圣道相违，身心世界逐渐转变，清净到一定程度，与道相应，与圣贤相应，就证得圣道。非是在证果之后才开始慢慢转变身心，若不转变身心到与圣贤相应，就不能成为圣贤。就如学生考试，若不合格，就不能入学，其理相同。 </p><p><strong>第三节  法智、类智和现观智</strong></p><p>原文：<strong>彼既如是。于其自内。现见诸蕴。依诸谛理。无倒寻思。正观察已。复于所余。不同分界。不现见蕴。比度观察。谓彼所有。有为有漏。遍一切处。遍一切种。于一切时。皆有如是法。皆堕如是理。皆有如是性。彼所有灭。皆永寂静。常住安乐。彼所有道。皆能永断。究竟出离。</strong></p><p>释：瑜伽行者既然能像这样对于自己的内身现前观见五蕴，依据四圣谛理没有颠倒地寻思，正确地观察以后，再对于其他不同的分界不能现前观察的五蕴，进行比度观察。五蕴中所有的有为法有漏法，遍一切处遍一切种子，在一切时都与现前所观察到的法一样，都摄属于四圣谛理之中，都是苦空无常无我的性质。这些法都是生灭的，灭掉之后都是永远寂静的，寂静以后都是永远常住的、安乐的，世间所有的道都能永远断灭，究竟出离世间苦。</p><p>原文：<strong>当知此中。若于现见。诸蕴谛智。若于所余。不同分界。不现见境。比度谛智。即是能生。法智类智。种子依处。</strong></p><p>释：在这些法的观察当中，如果对于现前存在的五蕴能够如实观察，现量见证四圣谛真实理，就会出生法智，是法智种子的所依之处。如果在除了现前所存在的法之外的所余的不是现前所存在的五蕴法，进行比度观察出生了见证智慧，就是类智，是类智种子的所依处。</p><p>这里讲了证法的两种方式，一是对当前存在的五蕴的如实观察，二是对非当前存在的五蕴的比度观察，两种观察都能获得谛智。非当前存在的五蕴是指什么呢？这是指当下此刻之前和之后的五蕴，如果今天的五蕴是现前的，那么昨天以前的五蕴和明天以后的五蕴就是非当下的五蕴，与当下的五蕴有个分界，时间点不同，但五蕴的性质和特征是相同的，是同类，有共同性，有可比性。</p><p>如果今年的五蕴是当下的五蕴，去年以前的五蕴和明年以后的五蕴就是非当下的五蕴；如果今世的五蕴是现前的五蕴，前世和后世的五蕴就是非现前可见的五蕴。以此类推，三大阿僧祇劫的五蕴都与当前的五蕴有相同的属性，或者说从无始劫以前直至无始劫以后的五蕴都有共同的属性和性质、特征，都是同类，都有可比性。</p><p>正比度能出生法智和类智，在对现前存在的五蕴正确如实观察的基础上，再比度观察非现前存在的其余五蕴，就能出生法智和类智，获得见道的无生智。分界是指过去和未来不同时期的法与当下的法的界限和分割。法与法有了界限，观察法的方式就不同，获得智慧的种类也不同。能现见的法是现量观察，不能现见的法就比度观察，观察正确如实了，就会获得谛智和无生忍。</p><p>原文：<strong>又即如是。了相作意。当知犹为。闻思间杂。若观行者。于诸谛中。如是数数。正观察故。由十六行。于四圣谛。证成道理。已得决定。复于诸谛。尽所有性。如所有性。超过闻思。间杂作意。一向发起。修行胜解。此则名为。胜解作意。如是作意。唯缘谛境。一向在定。于此修习多修习故。于苦集二谛境中。得无边际智。</strong></p><p>释：以上讲的这些了相作意，仍然属于间杂的闻思智慧，如果观行者在四圣谛中，像这样不断地正观察，就会由十六行对于四圣谛的证成道理，已经心得决定。又对于四圣谛的尽所有性和如所有性，超过了间杂的闻思作意，一直在发起修行胜解，名为胜解作意。这样的作意，只缘真实境界，一直在定中，对于胜解作意修习并且勤于修习的缘故，在苦谛和集谛两种境界中，就获得无边际智。</p><p>在对四圣谛心得决定之前的了相作意，参杂着闻思，并不纯是正观察，也不是无间断地观察。如果能够无间断地正观察，才能对四圣谛心得决定。心得决定之后，才能胜解，胜解之后才能证。四圣谛的尽所有性，是指四圣谛所覆盖的范围，如所有性是指符合四圣谛理的所有性。如果观察是无间断地正观察，就能超过间杂的闻思阶段，这时候能发起对四圣谛的胜解，叫作胜解作意。如果能一直保持禅定，禅定不失，心只缘四圣谛，没有他缘，这样的作意观察就能获得无边际智。</p><p>原文：<strong>由此智故。了知无常。发起无常无边际胜解。如是了知苦等。发起苦无边际胜解。空无我无边际胜解。恶行无边际胜解。往恶趣无边际胜解。兴衰无边际胜解。及老病死愁悲忧苦。一切扰恼无边际胜解。</strong></p><p>释：由于有无边际智的缘故，了知诸行无常，发起对于无常法的无边际胜解。像这样了知了苦空无常无我等等，就发起了苦无边际胜解、空和无我无边际胜解、恶行无边际胜解、往恶趣无边际胜解、兴衰无边际胜解、以及老病死忧悲苦恼一切忧恼无边际胜解。</p><p>原文：<strong>此中无边际者。谓生死流转。如是诸法。无边无际。乃至生死。流转不绝。常有如是。所说诸法。唯有生死。无余息灭。此可息灭。更无有余。息灭方便。即于如是。诸有诸趣。死生法中。以无愿行。无所依行。深厌逆行。发起胜解。精勤修习。胜解作意。</strong></p><p>释：无边际的意思是，生死流转这样的诸法无边无际，以至于生死流转不断绝。以上所说的诸法虽然是常有的，但是只有生死是可以息灭，再也没有遗余的。这个可以息灭之法，再也没有其余的息灭方便法。在如是这些三有六道的生死法中，以无愿行、无所依行、深深地厌逆行，发起胜解，精勤地修习胜解作意。</p><p>原文：<strong>复于如是。诸有诸生。增上意乐。深心厌怖。及于涅槃。随起一行。深心愿乐。彼于长夜。其心爱乐。世间色声香味触等。为诸色声香味触等。滋长积集。由是因缘。虽于涅槃。。深心愿乐。而复于彼。不能趣入。不能证净。不能安住。不能胜解。其心退转。于寂静界。未能深心。生希仰故。有疑虑故。其心数数。厌离惊怖。虽于一切。苦集二谛。数数深心。厌离惊怖。及于涅槃。数数发起。深心愿乐。然犹未能。深心趣入。</strong></p><p>释：又对于以上所说的这些诸有诸生死法的增上意乐，从内心深处生厌和怖畏，对于涅槃所生起的任意一种行，都从内心深处有乐愿。行者曾于生死长夜中，内心爱乐世间里的色声香味触等法，为了这些色声香味触等法滋长和积集苦谛。</p><p>由于这个因缘，虽然现在能深心愿乐涅槃，而不能趣入涅槃，不能证得清净法眼，不能安住四圣谛中，也不能胜解四圣谛。其心就从寂静界中退转了，因为没有能够从深心里生出对涅槃的希冀和景仰的缘故，因为心中有疑虑的缘故，就会一次次地厌离和恐怖生死。这样的人虽然在一切的苦谛和集谛的修习中，多次地深心厌离和惊怖生死，对于涅槃多次地发起深心的愿乐，然而还是不能深心地趣入涅槃。</p><p>原文：<strong>何以故。以彼犹有。能障现观。粗品我慢。随入作意。间无间转。作是思惟。我于生死。曾久流转。我于生死。当复流转。我于涅槃。当能趣入。我为涅槃。修诸善法。我能观苦。真实是苦。我能观集。真实是集。我能观灭。真实是灭。我能观道。真实是道。我能观空。真实是空。我观无愿。真是无愿。我观无相。。真是无相。如是诸法。是我所有。</strong></p><p>释：为什么深心厌怖生死愿乐涅槃，却不能趣入涅槃，甚至都不能胜解和安住涅槃之法？因为行者还有能障碍现量观行的粗的我慢，随着观行的深入生起有间断或者是无间断的作意，心中这样思惟：我曾经长久地流转于生死之中；我在生死中还要继续流转；我将来会趣入涅槃；我为了涅槃修习诸善法；我能观察苦谛真实是苦的；我能观察集谛真实是集起的；我能观察灭谛真实会灭；我能观察道谛真实是道；我能观察空真实是空；我能观察无愿真是无愿，我观察无相真是无相；如是诸法是我所具有的。</p><p>原文：<strong>由是因缘。虽于涅槃。深心愿乐。然心于彼。不能趣入。彼既了知。如是我慢。。是障碍已。便能速疾。以慧通达。弃舍任运。随转作意。制伏一切。外所知境。趣入作意。随作意行。专精无间。观察圣谛。随所生起。心谢灭时。无间生心。作意观察。方便流注。无有间断。彼既如是。以心缘心。专精无替。便能令彼。随入作意。障碍现观。粗品我慢。无容得生。</strong></p><p>释：由于行者心中有这些观念，虽然他对于涅槃能深心爱乐，但是心却不能趣入涅槃，因为粗重的我慢有遮障作用。行者了知以上这些我慢是趣入涅槃的障碍以后，就能迅速地以智慧通达，从而去除我慢遮障，便舍弃了从前的任心随意出生的我慢，随后运转作意，制伏住了心所触的一切外境，转入观行作意，随作意而转，一心精勤无间断地观察四圣谛。随着所生起的我慢心的灭去，心生起在无间断地作意观察上，心识无间断地流注在观察四圣谛中。行者如是以智慧心缘于无间作意，专心精进旁无他顾，浸染于四圣谛作意中，这样障碍现量观行的粗重我慢就没有机会生出来了。</p><p>原文：<strong>如是勤修。瑜伽行者。观心相续。展转别异。新新而生。或增或减。暂时而有。率尔现前。前后变易。是无常性。观心相续。入取蕴摄。是为苦性。观心相续。离第二法。是为空性。观心相续。从众缘生。不得自在。是无我性。如是名为。悟入苦谛。</strong></p><p>释：像这样精勤地修习瑜伽的行者，观察自心相续不断地流转变异，心里新出生一种法，下一秒又新出生另一种法，不断地改变，其心意有时增加有时减少，都是暂时而有，刹那现前，过后就变，这样前后变易的心是无常性的。再观自心相续不断，有所取着，是被取蕴所摄受着，这是苦性的。再观自心相续不断，心却不属于任何一种法，因为其心是空的，是为空性。再观察自心相续不断，是从众多因缘和合而生，不得自在，因此是无我性。这样就叫作悟入苦谛，无常、苦、空、无我，名为苦谛。</p><p>原文：<strong>次复观察。此心相续。以爱为因。以爱为集。以爱为起。以爱为缘。如是名为。悟入集谛。次复观察。此心相续。所有择灭。是永灭性。是永静性。是永妙性。是永离性。如是名为。悟入灭谛。次复观察。此心相续。究竟对治。趣灭之道。是真道性。是真如性。是真行性。是真出性。如是名为。悟入道谛。</strong></p><p>释：再次观察此心相续不断，是以爱为因，以爱为集，以爱为起，以爱为缘，观察到这个理就名为悟入集谛。再次观察此心相续不断，所有拣择出的生灭法都是具有永远灭尽性，永远寂静性，永远微妙性，永远离性，如是名为悟入灭谛。再次观察此心相续不断，能够彻底地对治一切烦恼。趣向寂灭之道是真的道性，是真的如性，是真的行性，是真的出离性，如是名为悟入道谛。</p><p>原文：<strong>如是先来。未善观察。今善作意。方便观察。以微妙慧。于四圣谛。能正悟入。即于此慧。亲近修习。多修习故。能缘所缘。平等平等。正智得生。由此生故。能断障碍。爱乐涅槃。所有粗品。现行我慢。</strong></p><p>释：从前还没有好好地观察四圣谛，现在就要善于作意作以方便观察，以微妙的智慧，于四圣谛理能正确如实地悟入。由于能够亲近和修习，多多地修习此种微妙的观察智慧的缘故，能缘智和所缘的法平等平等，正智才得以出生。由于出生了正智，就断除了障碍爱乐涅槃的所有的粗重的现行我慢。</p><p>原文：<strong>又于涅槃。深心愿乐。速能趣入。心无退转。离诸怖畏。摄受增上。意乐适悦。如是行者。于诸圣谛。下忍所摄。能缘所缘平等。平等智生。是名为暖。中忍所摄。能缘所缘平等。平等智生。是名为顶。上忍所摄。能缘所缘平等。平等智生。名谛顺忍。</strong></p><p>释：又对于涅槃深心爱乐，能迅速地趣入，心不退转，离开一切怖畏，内心生起增上意乐，舒适愉悦。这样修行的行者在四圣谛的修习过程中，属于下忍位所摄。能缘的心和所缘的法平等，平等智出生了，名为暖位，属于中忍位所摄。能缘的心和所缘的法平等，平等智出生，名为顶，属于上忍所摄。能缘的心和所缘的法平等，平等智出生，名为谛顺忍。</p><p>这里把对涅槃的安忍分为上中下三品，下品忍处于四加行中的暖位，中品忍处于四加行中的顶位，上忍也叫作谛顺忍，处于四加行中的忍位。处于暖位的行者，心就能趣向于涅槃，对于涅槃法的修习心无退转了，因为对涅槃法生起了增上意乐，离开了怖畏，有了功德受用，那么在后边的一切修习过程中都不会退转了，乃至于断我见得初果之后，更不会退转于涅槃之道。在四加行位的功德受用，与初果的功德受用差别很大，初果与二果，乃至于二果与三果四果的功德受用，差别都很大，所以不要误会功德受用，不要把四加行的功德受用，误会为是初果二果的功德受用，从而出现未证言证的大妄语。</p><p>原文：<strong>彼既如是。断能障碍。粗品我慢。及于涅槃。摄受增上。意乐适悦。便能舍离。后后观心。所有加行。住无加行。无分别心。彼于尔时。其心似灭。而非实灭。似无所缘。而非无缘。又于尔时。其心寂静。虽似远离。而非远离。又于尔时，非美睡眠。之所覆盖。唯有分明。无高无下。奢摩他行。</strong></p><p>释：行者修习至此，能断除障碍观行的粗重我慢，对于涅槃更进一步产生出增上意乐和愉悦快乐，这样就能舍离后续观心的所有加行，住在没有加行的无分别心中。这时候，行者的心好像是灭了而其实还没有灭，好像是没有什么攀缘了而并非没有攀缘。行者又在某时其心寂静，虽然好像是远离了六尘境界而实未曾远离。行者在这时候心还有睡眠盖障，睡眠还没有不为轻而香美无梦，只有非常分明的没有高下的奢摩他行。</p><p>修习瑜伽的行者，在断除了障碍现观的粗重我慢，对涅槃生起增上意乐之后，不用再努力地作加行功夫了，这时候感觉心好像没有分别了，好像是灭了，其实还没有灭，心里好像什么也不想了，其实是有想，感觉心里好像远离了尘境，其实还没有远离，并且这时候睡眠盖障并没有消除，睡眠还很沉重，未得清明，只有分明的无相心，不取法之高下，住于禅定中，不观四念处四圣谛。</p><p>原文：<strong>复有一类。闇昧愚痴。于美睡眠。之所覆盖。其心似灭。非实灭中。起增上慢。谓为现观。此不如是。既得如是。趣现观心。不久当入。正性离生。即于如是。寂静心位。最后一念。无分别心。从此无间。于前所观。诸圣谛理。起内作意。此即名为。世第一法。从此已后。出世心生。非世间心。此是世间。诸行最后。界畔边际。是故名为。世第一法。</strong></p><p>释：又有一类人昏昧愚痴，被香美的睡眠所覆盖，其心好像是灭了，其实并不是真灭了，于是就生起了增上慢，认为这就是现量观察，实则不是。此人既然已经获得了这样的趣向现量观察的心，不久以后就应当能入到正性离生中。在这样其心似灭非灭的寂静心位中，有最后一念无分别心，再以后就会无间断地对于前边所观的四圣谛理，生起内在作意，这叫作世第一法。从此以后出世间的心就生起来了，再也没有世间心了，这是世间诸行中最后的界限边际，因此名为世第一法。</p><p>这一段文很重要，讲述的是证道之前的最后阶段的心理状态，以及证道之前的最后修习方法，也揭示了世第一法与证道之间的差别相。在证道之前，处于四加行位的最后一位世第一法位，在此位中，睡眠盖障变得轻微了，以至于睡眠很轻微，也很清明，处于半睡半醒之间，睡眠中心很清明，不昏昧，身体很舒适，因此对于修道遮障很小。心好像是灭了，没有分别了，但还是有分别性，并没有灭，只是了别轻微，似有似无。于是愚痴蒙昧的人就生起了增上慢，觉得自己是无心了，有了现观了，实际不是。</p><p>但是却离现观不远了，如果继续精进，不久就会证入离开生死的正位，也就是在这样的寂静心位中，还有最后一念无分别心，以此一念无分别心，从此以后就会无间断地对从前所观行的四圣谛理，生起内在的作意，这就名为世间第一法。从此以后，就生起了出世间的心，世间心就断了灭了，这是世间里诸行最后的与出世间的界限和边畔，以此叫作世间第一。</p><p>原文：<strong>从此无间。于前所观。诸圣谛理。起内作意。作意无间。随前次第。所观诸谛。若是现见。若非现见。诸圣谛中。如其次第。有无分别。决定智现见智生。由此生故。三界所系。见道所断。附属所依。诸烦恼品。一切粗重。皆悉永断。</strong></p><p>释：从此无间断地对于从前所观行的四圣谛理，生起内在作意，作意不间断，随同从前次第所观行的四圣谛，或者是现量所见，或者是非现量所见的四圣谛中，随同其次第，是有是无加以分别之后，决定智和现见智就出生了。决定智和现见智出生之后，三界所系缚的，见道所断除的，附属于心所依止的，所有的烦恼品类中一切粗重部分，全部都永远断除了。</p><p>这段讲见道部分了，四加行之后，再无间断地作意观察，就会有智慧出生，作出决定，确认四圣谛苦集灭道之理，同时现量见法智出生，就断我见证初果了。见道证初果的同时，一切粗重的烦恼就全部都永远断除，不再生起了。所以如果有人粗重烦恼还存在着，烦恼看似还比较重，那就说明还没有见道证初果，由此可见，一个人的身口意行的表现足以说明他是否见道。外表看身口意行比较清净的，不一定是见道了，但见道的人身口意行一定是清净的，没有粗重烦恼的。</p><p>原文：<strong>此永断故。若先已离。欲界贪者。彼于今时。既入如是。谛现观已。得不还果。彼与前说。离欲者相。当知无异。然于此中。少有差别。谓当受化生。即于彼处。当般涅槃。不复还来。生此世间。若先倍离。欲界贪者。彼于今时。既入如是。谛现观已。得一来果。若先未离。欲界贪者。彼于今时。既入如是。谛现观已。粗重永息。得预流果。</strong></p><p>释：由于粗重烦恼永远断除的缘故，如果先前已经离开了欲界贪爱的人，在如今之时，既然已经悟入了如是四圣谛现量观行以后，就获得了三果不还果。此人与前边所说的离欲者的相貌，应该知道是没有差异的。但是二者之间还是稍微有一些差别，那就是后世要在五不还天受化生的三果人，就在即将受生处直接入涅槃，不再来此世间受生了。</p><p>如果是先前接近于离开欲界贪爱的人，已经断除部分欲界贪爱的人，在这时候，既然已经获得了如是四圣谛现量观行以后，就获得二果一来果。如果先前还没有离开欲界贪爱的人，在如今之时，既然已经获得四圣谛现量观行以后，粗重的烦恼就永远息灭了，获得初果。</p><p>根据以上弥勒菩萨的讲述，证得初果虽然还没有离欲界贪，但是粗重的烦恼是要永远断除息灭的，细微的烦恼仍然存在，待以后的修行再逐渐断除息灭，直至四果断尽一切现行烦恼。虽然初果到四果都能够对四圣谛进行现量观行，但因其在福德、烦恼、禅定和观行智慧等方面有差别，获得的智慧就有差别，果位就有差别。</p><p>三果人断除了欲界贪爱烦恼，有能力在受生处或者是在中阴身直接取得无余涅槃，那就是断除烦恼的心解脱圣者。初果和二果还有不同的欲界贪，心不解脱欲界，所以就不是心解脱的圣者，而是属于贤人。</p><p>原文：<strong>由能知智。与所知境。和合无乖。现前观察。故名现观。如刹帝利与刹帝利。和合无乖。现前观察。名为现观。婆罗门等。当知亦尔。此亦成就。众多相状。谓证如是。谛现观故。获得四智。谓于一切若行。若住诸作意中。善推求故。得唯法智。得非断智。得非常智。得缘生行。如幻事智。</strong></p><p>释：由能知真谛法的智慧，与所知的四圣谛理和合一起，二者没有乖离，这样的现前观察，就叫作现观。比如刹帝利与刹帝利和合无乖，不相违逆，这样来现前观察，就是现观，现前观察婆罗门也是这样。现观也能成就众多种相状，证得如是谛现观就会获得四智，对于一切苦行，如果住于所有作意当中善于推求观行，就会获得唯法智、非断智、非常智、缘生行如幻事智。</p><p>能知智，是指能见法知法证法的六七识，具有如实的观察智慧，所知境是指六七识所观察的理法，比如四圣谛理和般若之法等等，智与境和合一起，没有违逆，这样的现前观察叫作现观。如果观察不到真实的理法，或者是所观察的不善真实理法，那么智和境不相匹配，就不是现前观察，不叫作现观。</p><p>和合无乖，不相违逆，主要在于六七识的智慧境界，或者是智慧层次，智慧足够正确观察和认知于法，就与理法不相乖离，并且是现前观察，不是揣摩和推理想象分析的，现前存在的法，事实是什么就是什么，现量观察现量认知，这叫作现观。现观的时候，就证得了法，获得了法智和类智。不是现观的，就没有法智和类智，没有果证。</p><p>如何区分对于法是现前观察还是非现前观察呢？比如说观察苦谛，感觉五蕴是苦，现前观察到了五蕴是苦以后，内心对苦的认知很深刻，时时处处心心念念都会感知到五蕴的苦，并且心心念念想要逃脱苦灭掉苦，这种心态形成了无间作意，不间断。无间作意，就是意根生起来的作意，是意根感知到了苦，不仅仅停留在意识表面，这是现前观察的结果。</p><p>非现前观察的苦，并没有形成无间作意，断断续续，时有时无，时常忘记了苦，还是追求乐，出离心不强，觉悟性不高，行动力更差。当乐境现前的时候，就会迷失了自己，深陷乐境中不知苦了，对将来的希冀还是很大，妄想能得到乐保持乐。这样一边觉得苦，一边追求乐，心与行为相违背的状态，就是非现前观察苦。非现观的人由于辨别的智慧力不足，往往会误会自己这种情况是现量观察，是实证了法，其实与实证还有相当长的距离。</p><p>非现前观察的人普遍特征是，烦恼不除，无明不断，言行不一，表里不一，说一套做一套，指东向西，口里说着空，行为上处处着于有，没有一处是空；口里说无我，时时处处都是我，想掩饰都掩饰不住。因为没有实证，不知道实证之后的身心境界，也不知道自己所思所为都与实证境界相反，所以根本掩盖不了自己的凡夫特征。</p><p>原文：<strong>若行境界。由失念故。虽起猛利。诸烦恼缠。暂作意时。速疾除遣。又能毕竟。不堕恶趣。终不故思。违越所学。乃至傍生。亦不害命。终不退转。弃舍所学。不复能造。五无间业。定知苦乐。非自所作。非他所作。非自他作。非自非他。无因而生。</strong></p><p>释：有现观四智的行者，在证初果之前，如果身处境界之中，由于暂时失念的缘故，虽然生起了猛烈的诸烦恼缠缚，只要暂时作意就能迅速地除遣缠缚，并且还能毕竟不堕入恶道，永远不会故意思考与所修学相违背的法，乃至于连畜生的性命也不违害，永远不会退转和弃舍所修学的法，不再能造作五无间恶业，确定知道苦乐不是苦乐自性所作，不是大自在天等所作，不是苦乐自性和大自在天等共同所作，也不是苦乐自性作不是大自在天等作的无因而生。</p><p>这是行者处于四加行的世第一法阶段的功德受用，在证得初果之前，就有能力迅速除遣猛力的诸烦恼缠缚，就能不堕恶道，于四圣谛解脱道不退转，不弃舍。可见见道前的四加行其功德也是很大的，见道后的功德受用就更大了，解脱智慧确实是很殊胜的。</p><p>原文：<strong>终不求请。外道为师。亦不于彼。起福田想。于他沙门。婆罗门等。终不观瞻。口及颜面。唯自见法得法。知法得法。证法源底。越度疑惑。不由他缘。于大师教。非他所引。于诸法中。得无所畏。终不妄计。世瑞吉祥。以为清净。终不更受。第八有生。具足成就。四种证净。如是行者。乃至世第一法已前。名胜解作意。</strong></p><p>释：终究不会皈依外道为师，也不对外道生起福田之想，对于其他的沙门和婆罗门等等，永远不会仰望他们的颜面，看他们的脸色，看重他们所说，从他们的口里得法，只有自己独自见法得法。独自见法得法，证得法的底源（根本），解除所有的疑惑，并不是由于外在的因缘所为。能够证法底源，是由于世尊善知识教导的缘故，不是从世尊之外的他处所引过来的。行者在诸法中无所畏惧，终究不会虚妄地计着世间的种种瑞象和吉祥是清净的，永远不会再有第八次受生于三界世间，具足成就四种所证的清净智。如是行者，在修到世第一法以前，都名为胜解作意。</p><p>行者在获得四智现观之后，修习四加行，在第四加行的世第一法之前的观行都叫作胜解作意。意思是没有现量实证之前的思考参究，都应该叫作对法的胜解和领悟，只有胜解之后，才能现量观察得到，名为实证。实证是在初果位以上，胜解则在初果向或者是四加行的世第一法位中，四加行之后才能实证见道。所以要如实地观察自己的智慧，是现量观察智，还是胜解，还是臆测推理分析等等，了解了自己的智慧层次，才好规划下一步的修行。</p><p>具有现观四智的行者，从来不从他处得法和知法，不以他人所说为究竟皈依处，都是依靠自己现量观察去实证，见法得法之事只有靠自力参究观行，别人帮不上忙，别人指引的指教的，代替不了自己的现量观行。疑惑需要自己通过观行解决，别人说的不能解除自己内心的疑惑，因为不是亲自所见所证。有些人想方设法地套取修行成果，佛法是谁修谁得，套取来的，不能变成自己的，也不能获得见道智慧。现在有瑜伽师地论作指引，法理越来越明，对于证果明心之事，谁不服也没办法，要不然就去找弥勒菩萨说道说道。</p><p>原文：<strong>于诸圣谛。现观已后。乃至永断。见道所断。一切烦恼。名远离作意。复从此后。为欲进断。修所断惑。如所得道。更数修习。永断欲界。上品中品。诸烦恼已。得一来果。如预流果。所有诸相。今于此中。当知亦尔。然少差别。</strong></p><p>释：对四圣谛现观以后，直至永远断除见道所断的一切烦恼，名为远离作意，这是初果境界，断除欲界下品烦恼。又从此以后，为了要进一步断除修道所应该断除的烦恼惑，在所证得的初果断我见的基础上，更加努力地精勤修习，永远断除欲界上品和中品烦恼以后，就证得二果一来果。就像证得初果所具有的功德一样，二果人具有的功德也是如此，但其中还是有一些差别。</p><p>原文：<strong>谓若行境界。于能随顺。上品猛利。烦恼缠处。由失念故。暂起微劣。诸烦恼缠。寻能作意。速疾除遣。唯一度来。生此世间。便能究竟。作苦边际。得不还果。及不还相。如前已说。</strong></p><p>释：二果人在面对境界时，在能随顺欲界上品很猛烈的烦恼缠缚之处，由于失念的缘故，在刚一生起轻微劣弱的诸烦恼缠缚时，马上就能作意，迅速地除遣烦恼缠缚。之后再来此世间投生，只能来一次，就能到达究竟的苦的边际了，证得三果不还果，以及具有不还欲界的功德相，前边已经说过了。</p><p>初果见道所断的烦恼是欲界的下品烦恼，是欲界众生的烦恼中最粗重的部分，是人类和三恶道众生所具有的烦恼，天界众生没有粗重烦恼，有中品和上品烦恼，人类也有中品和上品烦恼。如果不喜和不随顺欲界众生的烦恼，就能断除欲界的中品和上品烦恼，证得二果。断除欲界上中下三品烦恼，能远离欲界贪，出生初禅定，证得三果。</p><p>所以初果是证道，二果和三果开始修道，修道所断的烦恼比初果要微细难断，一旦断除，智慧就会增进。初果至三果修道就是要断除烦恼，以禅定和烦恼的程度，来划定果位和智慧层次，所以修习理论的最终和根本目的是断除烦恼，身口意行清净，若不为此，只看重理论，就不叫作修道了。 </p><p><strong>第四节  修道之功德</strong></p><p>原文：<strong>当知此中。由观察作意。于一切修道。数数观察。已断未断。如所得道。而正修习。又于此中。云何名修自性。云何名修业。云何名修。品类差别。谓由定地作意。于世出世。善有为法。修习增长。无间所作。殷重所作。令心相续。会彼体性。如是名为。修之自性。</strong></p><p>释：在修道的过程中，由于有观察作意，在一切修道过程中，多次反复地，观察自己已经断除的烦恼和没有断除的烦恼，按照所应该修的道，正确如理地修习。在修习四圣谛过程中，什么叫作修自性？什么叫作修业？什么叫作修品类差别？在禅定里作意修习，对世出世间善的有为法，不断地修习，精进地修习，无间断地行善，精勤地修善，让心相续不断地住于善法中，心与善的体性相合，这就叫作修之自性。</p><p>原文：<strong>当知修业。略有八种。一有一类法。由修故得。二有一类法。由修故习。三有一类法。由修故净。四有一类法。由修故遣。五有一类法。由修故知。六有一类法。由修故断。七有一类法。由修故证。八有一类法。由修故远。</strong></p><p>释：而修业大略有八种：一，有一类法是由于修才会得到的；二，有一类法是由于修才能现前出现的；三，有一类法是由于修才清净的；四，有一类法是由于修才能遣除的；五，有一类法是由于修才能证知的；六，有一类法是由于修才能断除的；七，有一类法是由于修才能证得的；八，有一类法是由于修才能远离的。</p><p>原文：<strong>若先未得。殊胜善法。修习令得。名修故得。若先已得。令转现前。名修故习。若先已得。未令现前。但由修习。彼种类法。当令现前。令转清净。鲜白生起。名修故净。若有失念。染法现行。修善法力。令不忍受。断除变吐。名修故遣。</strong></p><p>释：如果先前没有得到殊胜的善法，通过修习得到了，名为由修故得。如果先前已经得到了善法，通过修习，令善法现前出现，名为由修故习。如果先前已经得到善法，而没有让善法现前出现，但由于修习那个种类的善法，令其现前，令其更加清净，鲜明白净地出现，名为由修故净。如果由于失念，染污法生起了，因为修善法的力，心不能忍受染污之法，就把染污法断除吐出，这名为由修故遣。</p><p>原文：<strong>若未生起。所应断法。修善法力。了知如病。深心厌坏。了知如痈如箭。障碍无常苦空。及以无我。深心厌坏。名修故知。如是知已。数修习故。无间道生。断诸烦恼。名修故断。烦恼断已。证得解脱。名修故证。如如进趣。上地善法。如是如是。令其下地已断。诸法转成远分。乃至究竟。名修故远。当知是名。八种修业。</strong></p><p>释：如果还没有生起所应该断除的法，由修习善法的力量，了知所应该断除的法如病一样，深心厌恶，了知所应该断除的法如痈疽一样，如毒箭一样，障碍无常、苦、空和无我的智慧，于是深心生厌，这名为由修故知。如是了知所应该断除的法体性以后，由于多次反复修习的缘故，就出生了不间断的道，断除了诸烦恼，这名为由修故断。断除烦恼以后，证得解脱，名为由修故证。像这样不断地趣向上地善法，像这样令下地烦恼断除，诸下地法变得离自己更远，乃至于究竟远离，名为由修故远。以上就是八种修业。</p><p>原文：<strong>应知此修。品类差别有十一种。一奢摩他修。二毗钵舍那修。三世间道修。四出世道修。五下品道修。六中品道修。七上品道修。八加行道修。九无间道修。十解脱道修。十一胜进道修。</strong></p><p>释：行者应该知道这种修习的品类和差别，有十一种：一，止和禅定的修法；二，观和智慧的修法；三，世间道的修习；四，出世间道的修习；五，下品道的修习；六，中品道的修习；七，上品道的修习；八，四加行道的修习；九，无间道的修习；十，解脱道的修习；十一，胜进道的修习。</p><p>原文：<strong>奢摩他修者。谓九种行。令心安住。如前已说。毗钵舍那修。亦如前说。世间道修者。谓于诸下地。见粗相故。于诸上地。见静相故。乃至能趣。无所有处。一切离欲。出世道修者。谓正思惟。苦真是苦。集真是集。灭真是灭。道真是道。由正见等。无漏圣道。乃至能趣。非想非非想处。一切离欲。</strong></p><p>释：止的修习，是用九种方法令心安住，就像前边说的那样。毗鉢舍那的修习也像前边说的那样。世间道修的意思是，在诸下地（欲界）见到粗相，在诸上地（色界和无色界）见静相，乃至于能趣向无所有处，在一切地都能离欲不着欲，在世间无碍。出世间道修的意思是，能正思惟苦谛真是苦，集谛真是集，灭谛真是灭，道谛真有道。由于有正见等无漏的圣贤之道，乃至能趣向非想非非想处，在一切地都能离欲不着欲，出世间道无碍。</p><p>原文：<strong>下品道修者。谓由此故。能断最粗。上品烦恼。中品道修者。谓由此故。能断所有。中品烦恼。上品道修者。谓由此故。能断所有。最后所断。下品烦恼。</strong></p><p>释：下品道修的意思是，由此种修的缘故，能断除最粗重的上品烦恼。中品道修的意思是，由于此种修的缘故，能断除所有的中品烦恼。上品道修的意思是，由于此种修的缘故，能断除所有最后所应该断除的下品烦恼。</p><p>原文：<strong>加行道修者。谓由此故。为断烦恼。发起加行。无间道修者。谓由此故。正断烦恼。解脱道修者。谓由此故。或断无间。证得解脱。胜进道修者。谓由此故。从是已后。修胜善法。乃至未起。余地烦恼。能治加行。或复未起。趣究竟位。当知是名。十一种修。品类差别。</strong></p><p>释：加行道修的意思是，由于此种修的缘故，为了断除烦恼发起了加行。无间道修的意思是，由于此种修的缘故，真正地断除了烦恼，而且是永远地断除了烦恼，叫作无间道。解脱道修的意思是，由于此种修的缘故，能够无间地断除烦恼，证得解脱。胜进道修的意思是，由于此种修的缘故，从此以后要修行更胜的善法，乃至于其余诸地的烦恼也不生起，能对治和加行之法，或许也不生起，能趣向究竟的四正性离生之位，再也不出生在三界世间。这就是十一种修的品类差别。</p><p>原文：<strong>如是于修。勤修习者。于时时间。应正观察。所有烦恼。已断未断。于时时间。于可厌法。深心厌离。于时时间。于可欣法。深心欣慕。如是名为。摄乐作意。彼即于此。摄乐作意。亲近修习。多修习故。有能无余永断。修道所断烦恼。最后学位。喻如金刚。三摩地生。由此生故。便能永断。修道所断。一切烦恼。</strong></p><p>释：像这样对于修，能够精勤的修习者，在一切时间里应该正确地观察，所有的烦恼是已经断除了，还是没有断除；在一切时间里对可厌恶的法，能深心厌离；在一切时间里对可欢喜之法深心欣喜和仰慕，如是名为摄乐作意。行者对于这个摄乐作意亲近修习，多修习的缘故，能够全部永远断除修道所断的烦恼，最后学位就出生了，此位被比喻为金刚三摩地。由于最后学位出生的缘故，就能永远断除修道所断的一切烦恼。</p><p>这个最后学位是三果之位，初果二果三果是有学位，在三果有学位断尽一切烦恼，证得四果无学位，从此无法可修，无烦恼可断，名为无学。</p><p>原文：<strong>问。何因缘故。此三摩地。名金刚喻。答。譬如金刚。望余一切。末尼真珠。琉璃螺贝璧玉。珊瑚等诸珍宝。最为坚固。能穿能坏。所余宝物。非余宝物。所能穿坏。如是此三摩地。于诸有学。三摩地中。最上最胜。最为坚固。能坏一切。所有烦恼。非上烦恼。所能蔽伏。是故此三摩地。名金刚喻。</strong></p><p>释：问：是什么原因此三摩地用金刚喻名？答：譬如金刚，与一切摩尼、珍珠、琉璃、螺贝、壁玉、珊瑚等等珠宝相比，是最坚固的，能穿坏其它一切宝物，却不能被其它宝物穿坏。这样的三摩地，在所有有学的三摩地中是最上最殊胜最坚固的，能破坏掉一切烦恼，不是上烦恼所能遮蔽和降伏的，因此这个三摩地就用金刚来喻名。</p><p>初果到三果都是有学位，因为还有烦恼漏没有断除，还有可修之法，因其烦恼未断尽，或者未断烦恼，还有所修学，以便断尽烦恼。烦恼断尽是四果阿罗汉，因为再也没有漏没有烦恼可断了，没有法可修了，再也不需要修学解脱道的谛理了，已经达到最后清净了，已经解脱于三界世间诸有了，所以称为无学，而三果之前却非如此。三果所证得的三摩地比初果二果都殊胜，是最坚固的，名为金刚三摩地。 </p><p><strong>第五节  阿罗汉的功德</strong></p><p>原文：<strong>从此金刚喻三摩地。无间永害。一切烦恼品。粗重种子。其心于彼。究竟解脱。证得毕竟。种姓清净。于诸烦恼。究竟尽中。发起尽智。由因尽故。当来苦果。毕竟不生。即于此中。起无生智。彼于尔时。成阿罗汉。诸漏已尽。所作已办。无复所作。证得自义。尽诸有结。已正奉行。如来圣教。心善解脱。</strong></p><p>释：从这个金刚三摩地以后，就会无间断地永远断除了一切烦恼品类的粗重种子，其心于诸烦恼究竟解脱，证得毕竟种姓清净。在一切烦恼究竟断尽的同时，发起了世间尽智，由烦恼因断尽的缘故，后世的苦果毕竟不再生起。在断尽烦恼的同时，生起了五蕴世间的无生智。这时候三果人就成为了四果阿罗汉，诸漏已尽，所作已作，无复后有，三界结尽，已经完好地奉行了如来圣教，心善解脱了。</p><p>四果阿罗汉有无间尽智和无生智，无间尽智是指能够无间断地断尽世间一切烦恼，灭尽三界世间一切苦，知道如何出离三界世间得解脱，这样的智慧名为无间尽智。无生智是指证得五蕴世间苦空无常无我，了知五蕴世间是虚妄的，因此也是无生的，不真实的，这样的智慧名为无生智。</p><p>原文：<strong>已具成就。十无学法。谓无学正见正思惟。乃至无学。正解脱正智。于诸住中。及作意中。能随己心。自在而转。随所乐住。或圣或天。或梵住中。即能安住。随乐思惟。所有正法。能引世间。或出世间。诸善义利。即能思惟。</strong></p><p>释：已经具足成就了十种无学法：对于正见、正思惟、正语、正业、正念、正定、正命、正精进无学，乃至于对正解脱、正智都无学，这十种法都已具足，不用再修学了。在一切所住之中以及作意中，都能够随着自己的心，自在地运转，随着自己所乐于住着之处，或者是圣住，或者是天住，或者是清净住中，立即就能安住下来。随着自己乐于思惟的所有正法，都能引出世间或者出世间的诸善法的义利，而能立即思惟。</p><p>原文：<strong>言圣住者。谓空住无愿住。无相住。灭尽定住。言天住者。谓诸静虑。诸无色住。言梵住者。谓慈住悲住喜住舍住。又于尔时。至极究竟。毕竟无垢。毕竟证得。梵行边际。离诸关键。已出深坑。已度深堑。已能摧伏。彼伊师迦。是为真圣。摧灭高幢。已断五支。成就六支。</strong></p><p>释：所说的圣住，是指空住、无愿住、无相住、灭尽定住。所说的天住，是指种种禅定境界，所有的无色界住。所说的梵住，是指慈住、悲住、喜住、舍住。又在断尽一切烦恼时，达到了究竟，再无污垢，毕竟证得清净梵行的边际，离开一切要害，已经跳出深坑，已经越过深堑，已经能够催伏我慢高山，是真正的圣人，催灭了高慢幢，已经断除了贪、嗔、痴、慢、疑五支烦恼漏，成就了戒、定、慧、解脱、解脱知见等六支功德。</p><p>原文：<strong>一向守护。四所依止。最极远离。独一谛实。弃舍希求。无浊思惟。身行猗息。心善解脱。慧善解脱。独一无侣。正行已立。名已亲近。无上丈夫。具足成就。六恒住法。谓眼见色已。无喜无忧。安住上舍。正念正知。如是耳闻声已。鼻嗅香已。舌尝味已。身觉触已。意了法已。无喜无忧。安住上舍。正念正知。</strong></p><p>释：一向守护佛法僧戒四个所依止处，远离一切世间法，解脱无碍，心中独有一个真理，对五蕴世间无所希求，思惟清净，没有染污，行来去止自在轻安，无有系挂，心善解脱，智慧善解脱，在世间心不与一法为伴侣，不系属于任何一法，不具任何一法的特性。正行已经建立起来了，叫作已经亲近了无上丈夫佛世尊，具足成就六个恒常住法，就是眼见色以后，无喜无忧，安住上舍，正念正知。耳闻声、鼻嗅香、舌尝味、身觉触、意了法以后，都同样是无喜无忧，安住上舍，正念正知。</p><p>原文：<strong>彼于尔时。领受贪欲。无余永尽。领受瞋恚。无余永尽。领受愚痴。无余永尽。彼贪瞋痴。皆永尽故。不造诸恶。习近诸善。其心犹如。虚空净水。如妙香檀。普为一切。天帝天王。恭敬供养。住有余依。般涅槃界。度生死海。已到彼岸。亦名任持。最后有身。</strong></p><p>释：阿罗汉在这时候，领受六尘境界时出现的贪欲，永远断尽无余了，领受六尘境界时出现的嗔恚，永远断尽无余了；领受六尘境界时出现的愚痴，永远断尽无余了。因为贪嗔痴都永远断尽的缘故，不再造作诸恶业，修习诸善法，其心犹如虚空和清净的水一样，也如奇妙的栴檀香，普遍为天帝、天王们恭敬供养。住在有余依涅槃界，渡越了生死海，已经到达了彼岸，这也名为住持最后有身。</p><p>原文：<strong>先业烦恼。所引诸蕴。自然灭故。余取无故。不相续故。于无余依。般涅槃界。而般涅槃。此中都无。般涅槃者。如于生死。无流转者。唯有众苦永灭。寂静清凉灭没。唯有此处。最为寂静。所谓弃舍。一切所依。爱尽离欲。永灭涅槃。</strong></p><p>释：由于从前的烦恼业，所引出的五蕴自然灭去的缘故，对三界世间就再没有取着了，后世的生命再也不会相续了。在无余依般涅槃界而得到涅槃，却都没有般涅槃者，同样的在生死中也无有流转者了。只有众苦永远灭尽，寂静清凉，灭没一切法，只有此涅槃处是最寂静的，弃舍了一切所依止的，贪爱永尽离一切欲，永远灭尽五蕴，入无余涅槃。</p><p>原文：<strong>当知此中。有如是相。阿罗汉苾刍。诸漏永尽。不能习近。五种处所。一者不能故思。杀害诸众生命。二者不能。不与而取。三者不能。行非梵行。习淫欲法。四者不能知而妄语。五者不能贮畜受用。诸欲资具。如是不能。妄计苦乐。自作他作。自他俱作。非自他作。无因而生。又亦不能。怖畏一切。不应记事。又亦不能。于云雷电。霹雳灾雹。及见种种。怖畏事已。深生惊怖。</strong></p><p>释：你们应当知道，取得阿罗汉果就会有这样的相貌，阿罗汉比丘诸烦恼漏永远灭尽，不再造作如下五种事：一者，不能故意想要杀害众生的性命；二者，不能不经过对方允许而自行拿取对方之物；三者，不能造作不清净的淫欲行；四者，不能明知而妄语；五者，不能储藏和受用所有用来满足资生需求的资具。阿罗汉也不能虚妄地计着，苦乐是苦乐自性所作，或是大自在天所作，或是苦乐自性和大自在天共同所作，或是非苦乐自性也非大自在天作的无因而生，而且也不能对乌云、雷电、霹雳、冰雹，以及种种的恐怖事，而深生惊恐怖畏。</p><p>原文：<strong>当知此中。金刚喻定。所摄作意。名加行究竟作意。最上阿罗汉果。所摄作意。名加行究竟果作意。由如是等。多种作意。依出世道。证得究竟。如是一切。名声闻地。此是一切。正等觉者所说。一切声闻。相应教法根本。犹如一切。名句文身。是所制造。文章咒术。异论根本。</strong></p><p>释：应当知道在修道中，金刚喻定所摄受的作意，名为加行究竟作意，最上阿罗汉果所摄受的作意，名为加行究竟果作意。由这样的多种作意，依出世间道才能证得究竟，如是一切种种名为声闻地。此是一切正等觉者诸佛所说，一切与声闻相应的根本教法，犹如一切名身、句身和文身，是制造文章、咒术和异论的根本。</p></div>"
},{
    "title": "第十一章 瑜伽师地论第五十五卷（三种现观）",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  瑜伽师地论第五十五卷（三种现观）<span> </span></strong></p><p>原文：<strong>复次。此三种杂染。谓烦恼杂染。业杂染。生杂染。为欲断故。修六种现观。应知何等为六。谓思现观。信现观。戒现观。现观智谛现观。现观边智谛现观。究竟现观。</strong></p><p>释：复次，有烦恼杂染、业杂染和生杂染，为了要断除这三种杂染的缘故，就要修行六种现量观行。这六种现量观行分别都是指什么？是指思的现量观行、信的现量观行、戒的现量观行、现观智谛的现量观行、现观边智谛的现量观行和究竟的现量观行。</p><p>烦恼杂染是贪嗔痴的心行，由于有贪嗔痴烦恼杂染，就会造作出贪嗔痴烦恼杂染业行，有了贪嗔痴烦恼杂染业行，就会导致后世有杂染的生身。要想断除这些杂染法，就要修习六种现量观行。下面分别介绍这几种现观。</p><p>思现观就是对于四圣谛理有如实、审慎和决定的思，能决定明了和证悟诸法苦空无常无我之理，外道不能影响其决定思，对于四圣谛理不复退转。思现观成就，就有正行，心地清净，心生欢喜，断诸疑惑，永住善道，不趣恶道。这就是意识和意根的思，单独意识的思做不到改变心行，断除疑惑，心地清净，恶道永绝。当然思现观也包括对大乘法的思，既然叫作现观，就会符合实际，符合真理，就有实证的智慧在其中。</p><p>信现观是指对于三宝有决定的信和清净的信，没有犹疑和三心二意，当然就不会再造诽谤业。决定信就代表智慧，有智慧才有现观，否则就不能现观，只能妄分别。有信现观的人，就不再造作诽谤佛、法、僧三宝的业行，诽谤佛包括说佛只是阿罗汉。辟支佛的果位，只有四圣谛和十二因缘的证量，再没有其他证量了；诽谤佛没有大神通和无量神通，诽谤佛与世间人差不多，也很平凡；诽谤佛是在家人，也行在家人事，诽谤佛的肉暨是世间人的头发等等，不一而足，这些言论都不是清净信和决定信，因此命终都会趣向三恶道受报。有信现观的人，对三世诸佛都能如实了知其无量的功德、福德和智慧神通，不生误解，对三宝有胜解，不迷信，有正行，有善业。</p><p>诽谤法在末法时期是普遍的现象，见多就不奇怪了，最严重的就是大乘非佛说，这些人丝毫看不懂大乘法义是否正真，是否如理，是否殊胜，以严重的愚痴心盲目无根据的断定为非佛说；还有把法说为非法，非法说为法，种种颠倒，都是很严重的谤法行为，命终必感召地狱果报。</p><p>谤僧的现象也很普遍，僧说为非僧，非僧说为是僧，就是谤僧；指责和宣传出家人的种种身口意行过失，不管有其事还是无其事都属于谤僧，破坏僧人在众生心中的形象，造成不良影响，导致众生对僧宝失去信心，不再信受三宝，摧毁众生的信根，这些罪业都是极大的，多数是地狱罪，报在地狱。</p><p>戒现观，就是对于佛所制定的种种戒律已经能够坚守不犯，不再能造作三恶道的业行。成就戒现观的人，绝对不会再故意杀生、不与取、邪淫、妄语、饮酒，身口意业清净无漏，已经解脱了三恶道的苦，远离了十不善业道，生身已为预流果直至阿罗汉果，以及辟支佛果、菩萨果和佛果，就是说只有圣果成就的人才能有戒现观。</p><p>以上瑜伽师地论第五十五卷中所说，具足戒现观的初果以上的圣贤人不会再违犯五戒以及种种所受持的戒律，心不与三恶道相应，就不会造作趣向三恶道的十不善道业，不会违犯五戒、比丘戒、比丘尼戒和菩萨戒。如果连五戒都不能守持的人，就可以依据瑜伽师地论和显扬圣教论断定为此人没有初果以上的证量，所说的证果是误判，是假证，不可信。</p><p>断我见证得初果以后的人，不会再下三恶道，为什么如此？因为其心改变了，心与三恶道业不相应，不会再造三恶道业行，也就不会再下三恶道受苦。心证得无我，就空了，心空的人不可能再造三恶道的业行。什么是三恶道的业行？就是违犯五戒的业行，违犯十善业的业行。受持五戒才能得人身，不得三恶道众生身，受持十善才能得人和天人身，不得三恶道众生身。断我见证果的人心行一定与五戒十善相应，才能免除三恶道业和身。</p><p>那么这个断我见的心，与五戒十善相应的心，不与三恶道业相应的心，是哪个心呢？意识当然是这样的心，最主要的意根绝对应该是这样的心，而且意根是无间断的心，断我见之后，意根才会无间断的有毗钵舍那和奢摩他的双运道功德，不管是睡觉、昏迷、死亡和中阴身的任何时候，都有断我见的功德在身，就会以此功德受生、投胎和入胎，那么意根是什么心行，有什么业，就会有相应的胎身。想要不入三恶道，就需要意根断我见，具诸功德，只有意识的闻法智慧、推理智慧、臆测智慧和情思意解的智慧，绝对保证不了断除粗重的烦恼现行，保证不了不造作三恶道的业行，保证不了不违犯五戒十善，也就保证不了命终不入三恶道。</p><p>现观智谛现观，根据瑜伽师地论第五十五卷中说，在加行修道过程中，首先要把见道的福德资粮积累得极其圆满以后，心又得到有效的调伏和调柔了，依从随顺于世间抉择分的边际，生起无间断的善根，意思是说通过修行加行道，意根已经充分的得到了善法的熏染，心地柔软和调伏，善根显发出来了。在佛法修道中的无间一般都是指意根，意识是间断的，不断灭去的，是不可靠的，只有修到意根，善法才算修到一个阶段，才有质的飞跃，道业才能上一层楼。</p><p>意根生发出善根以后，心就会初步的遣除有情众生的假法，意思是说初步证道，证得五蕴是空是假是虚妄的了，这时候就能除去初次见道所断除的粗重烦恼。这个意思已经说的很明白了，初果见道是会断除粗重烦恼现行的，能除去一些粗重的烦恼。只有意根也见道之后，才能断除粗重烦恼，意识是没办法断除烦恼的。</p><p>证得初果以后，就会无间断的显现和延续初果的见道智慧证量，然后第二次生起见道的功德智慧，心中进一步遣除五蕴众生的种种假法，我见再进一步深入地断除，证得二果，能除去中品见道所断的粗重烦恼。这个意思就是说，初果见道不究竟，我见只是初分软品断，还有二次的中品断和三品的究竟断，粗重烦恼也断的不究竟，二果见道、三四果见道还要继续断除粗重烦恼。二果当然也是意根证得的，才能达到无间断的智慧生起，进一步的断除粗重烦恼。</p><p>证得二果以后，就会无间断的显现和延续二果的见道智慧证量，然后第三次生起见道的功德智慧，更深入的生起普遍遣除一切有情众生的五蕴假法，我见进一步更深入究竟的断除了，以此功德就断除了一切见道所断的粗重烦恼现行。瑜伽师地论第五十五卷中说，这种见道是初禅定和观行智慧的双运道，不仅有甚深的断我见的观行智慧，还要有初禅禅定，才能断除一切粗重烦恼，这就是三果和四果圣人的断我见，名为三果四果见道。</p><p>之前的初果和二果，不必有初禅禅定，但一定要有未到地定，而且未到地定要具足，否则不会有断我见的观行智慧生起，不能断我见证得初果和二果。在证得三果的时候，具足了三次断我见的三品毘鉢舍那观行智慧，同时也具足了禅定奢摩他的三品见道禅定心，再加上禅定与智慧的双运，合起来立为三心，这样就会在一刹那中三果四果的止观全部具足。</p><p>所有修学四圣谛的仁者，一定要依法不依人，都应该依从瑜伽师地论中弥勒菩萨所讲的断我见见道标准，来衡量自他是否为真正定慧等持的见道，还是自我标榜的假见道，厘清见道标准，就不会混淆视听，犯大妄语罪业，破坏佛教的教法。</p><p>现观智谛现观，具有现观智谛现观的人，能获得一切出家果位，能引发一切清净功德，能引生出其余的现观智慧，能在善道中帮助感召清净果和业。如果成就了现观智谛现观的有学无学者，永远不再依着虚妄的我见而有所造作，所作都是无我的，对于自己所证得的法永远不会有疑惑，永远不会在有杂染染污的处所出生，在所出生之处也不会再有贪染了。在现世生活和修行中，所有的世间事相都清净了，没有染污不净，不会再诽谤声闻、独觉和大乘法，不再造作恶业，更不能造五逆罪和七逆罪，再也不会第八次在三界中出生了，这是初果极尽七有的意思。</p><p>现观边智谛现观，这种智慧在见道以后才能获得，在哪种见道才能获得？是在第三品见道，在初禅定和智慧双运的三果和四果见道以后获得的现观智，是缘于先前的世间智慧，观察下地（欲界）和上地（色界初禅天）以及欲界和色界初禅天的两种安立的真实理所获得的境界，属于法智和类智的世俗智慧所摄，通于世间智慧和出世间智慧。在四圣谛的每一谛的观行中，都会出现忍可欲乐智和现观决定智。这样依靠前一个谛的现观，就会在上一个谛和下一个谛的观行中，生起两个两种现观智，这就是现观边智谛现观。成就了现观边智谛现观的三四果人，永远不会害怕他人的诘难发问，因为现观智深利，通达解脱道的法义，没有人能够难倒于他，所有难问都能善巧解答。</p><p>究竟现观，这是四果阿罗汉所证得的现量观行智慧，由于四果阿罗汉以及断尽了修道所断的一切烦恼现行，就获得了灭尽三界有的智慧，获得后世可以永不再出生的智慧，或者是因为其怜悯众生发起救度众生之心，后世仍然会出生于世，但无一切烦恼现行，也仍然依其世间永灭的智慧而立世，这就是究竟现观。证得世间永灭的智慧最究竟，证得世间究竟是空的智慧最究竟，就是究竟现观，以前的现观还有漏没有尽，所以还不是究竟现观。   </p><p>成就究竟现观的大阿罗汉，永远不会再犯五戒，不再故意杀生、不与取、淫欲、妄语和积蓄财宝而受用。这里的淫欲是指任何一种的淫欲，不管轻重，不管世俗法是否允许，不管道德和不道德，因为只要证得阿罗汉果，必都是出家僧，没有一个是在家人，不会有任何家属，所以也不会有正淫之说。这里的妄语是指任何一种妄语，包括在世俗法中故意错说的世间妄语。阿罗汉永远不会害怕以后会发生的不可知之事，也不会把世间所有的苦乐虚妄的计为是自作、他作、自他作，也不会妄记为非自非他的无因生。成就了究竟现观的大阿罗汉解脱了世间一切生死大苦，此身是最后身，不再受后有，留形住世者除外。</p></div>"
},{
    "title": "第十二章 杂谈",
    "author": "生如法师",
    "date": "2022年10月12日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  杂谈<span> </span></strong></p><p>一、爱随眠是什么意思</p><p>爱随眠烦恼随眠，随眠文字上含义是，伴随着睡眠，是隐藏的意思，在背后运行的意思，陪伴的意思。在五蕴的活动中，时时处处有爱和烦恼陪伴着，一到关键时刻，爱和烦恼就跳出来现行，染污业就出现了，染污种子积存下来，未来的苦集起来了。</p><p>有爱随眠烦恼随眠，心就被蒙蔽，看不见真实理，由于愚痴就遮障了智慧光明。所以有一丝烦恼就是无明，心不清明，黑暗，智慧光明不显现。断爱就是断苦，爱重苦重生娑婆，爱轻苦轻生天界，无爱当下是极乐。</p><p>二、修行得力后的现象</p><p>正精进修行之后，修行方向正确，就会有所受益，欲望轻，执着和烦恼少，身心会有一定的转变。知世间的无常空无我，物欲减淡，对于物质色法的执着会减轻，贪心会减少。只要物欲少了，不贪求享受，在这个世间生活基本上用不了多少钱财和物质。习惯于依赖世间物质的人，贪欲肯定炽盛，金钱和物质需求的就会很多，拼命地赚钱还是觉得不够。够与不够，在于心，不在于物质金钱的多少，只有善知止足才会心安快乐。</p><p>正精进修行得力以后，会遇到逆缘，这对消除业障遮障有很大的助益。金刚经云：以世人轻贱故，是人先世罪业则得消灭。修行上道以后，会感召到一些逆缘，这些逆缘也是修行的增上缘。逆缘能为修行人消除罪业，以极小的被人轻贱的代价，就能灭除重大罪业，因此应当欢喜接受逆缘。有些时候，明明你什么都没做，就是有人栽赃诬陷你，如果能默默忍受，逆缘就会过去了，业障消除了，如果不能忍受，加以回击，不但会造新业，旧业也不消。所以佛说忍辱是德，有功，增福增慧。善待其境，则能助道。</p><p>三、舍觉支与行捨的区别</p><p>舍觉支是七觉支当中最后一个觉支，七觉支是念觉支、择法觉支、精进觉支、喜觉支、猗觉支、定觉支、舍觉支。舍是舍弃了一切身心负担和累赘，不管是善的还是恶的，苦的和乐的，任何觉受都舍去，内心清净无为。</p><p>行捨，也叫作不害，是舍去恶不善的行为造作。比如原来想报复某人，现在不想报复了，舍去了报复的行为；原来嫉妒于人，想加害于人，现在不嫉妒了，也不想加害人了，舍弃恶行，内心清净，或者住于善中。但其觉受不一定能舍去，心里可能有喜乐，有轻安，或者有其它觉受，与舍觉支有所不同。</p><p>四、无常法与常法同样都是苦法</p><p>一切法是无常的，情绪也是无常的，都有生住异灭的发展阶段，不管好坏都不能持久不变，不能永存。如果贪嗔痴烦恼引生的喜怒哀乐情绪能永存不变，想想众生结果会怎么样？结果就是精神崩溃，最后死亡。即使没有烦恼性的喜乐着心永久不变，这个人也不会有甚深禅定。</p><p>世间无常的法则，是适合众生生存的，那种法变为常，众生都忍受不了，虽然无常法让众生痛苦，常法也同样令人痛苦，所以世间就是苦的。</p><p>五、行阴的含义</p><p>凡是变动迁流不静止的法都属于行阴，或者是行蕴。包括身心两方面，但是身动实际上也是识心动，识心不动，身就不能动。相分的传导也是动，就是尘境生住异灭的变动，是由识动引起的。识心的念念不停止的思想念头以及种种心理活动都属于识阴。如果这些变动的法能遮障自己如理如法的认知，去辨识真性，而只认动相的行，那么这些变动就是行阴，如果是单纯的强调法的运转性活动性，就叫作行蕴。</p><p>六、什么时候才能断情执？</p><p>先弄明白身见，并断除身见，然后破我执，之后才能断情执。情执是在我执之后一点点断除的，非常不容易。先有贪欲，后有情执，贪欲三果断尽，可情执要在第一到第二个无量劫之间才能断尽。因为贪比较粗糙，容易断，情很细腻，特别难断。</p><p>七、这个虚拟的世界存在有什么意义？</p><p>这个虚拟世界的存在，不是受人为操纵的，是众生业缘的必然结果，所以谈不到有意义还是无意义。因为众生有三界的业种，业种不消除，虚拟的世界就会不断出现，让众生实现业种，受业之报，学佛人可以利用这个虚拟世界来修行。</p><p>众生明明面对的都是电信号，什么都没有，却解读出了色彩斑斓、绚烂多姿的六尘世界。那些电信号也不是实有的，是看不见摸不着的种子幻化出来的，其实世间里什么都没有，也没有世间，众生有翳病，硬是能分别出世间和世间里的一切法。世间及世间里的一切法，你认为有意义就有意义，你认为无意义就无意义。法无心，物无心，场景无心，世界无心，是众生有心，赋予场景什么意义，场景就有什么意义，赋予世界什么意义，世界就是什么意义。你若无心，就无世界，有心就有一切法。</p><p>八、放下执念就是放下自我</p><p>佛法当中讲一种禁取戒，就是外道设立的不如理不能解脱的戒，佛弟子却不允许去执取和守护。所以在佛法修证上要想断我见，必须破除外道的禁取戒，不能尊守那个戒条，才能正确如法的持佛戒，才能断我见。所以我们也没有必要一直执取从前那些没有意义的誓言和邪愿，白白耗费精力和心力。有执就有生死，就不解脱。当菩萨要有大智慧，菩萨的大智慧远远大于世间种种精英，对众生没有利益的事，菩萨都不会浪费时间精力去做，只做有利益的事，或者是有大利益的事，做最重要的事。</p><p>放下人前不必要的脸面问题，也就是放下了一种我，无所谓别人对自己无意义的评价和看法，因为本没有我，还在乎那些不合理的评价干什么？只要做正确的事，只要做利益人的事，只要没有消耗时光，只要对得起佛菩萨和众生，怎么都行。坚持一种不合理的执念，不能圆融，就是愚痴。只要有执念，波旬就会利用这个心理，让你做愚痴事。而无心就不会被人利用，没人能钻你空子，也就没有恶果。佛陀总是教导菩萨，不要在意虚假的名誉名声，是毁是赞，心都不要动摇，只坚持真理。</p><p>调整好自己的修行目标，直接奔着目标而去，不要在意不必要的事，得不偿失。要用智慧，而不是意气，不怕成为别人眼中的失败者，世俗法中成与败都是幻化的虚假相，在世俗中败，却容易在佛法中成。不要考虑自己在别人心中不必要的形象，那就是个我，灭除各种我，才是真正断我见者。</p><p>九、过去现在因果经第三卷</p><p>原文：<strong>尔时太子。即便问曰。我今已知汝之所说。生死根本。复何方便。而能断之。仙人答言。若欲断此生死本者。先当出家修持戒行。谦卑忍辱。住空闲处。修习禅定。离欲恶不善法。有觉有观。得初禅。除觉观。定生入喜心。得第二禅。舍喜心。得正念。具乐根。得第三禅。除苦乐。得净念。入舍根。得第四禅。获无想报。别有一师。说如此处。名为解脱。从定觉已。然后方知非解脱处。离色想。入空处。灭有对想。入识处。灭无量识想。唯观一识。入无所有处。离于种种想。入非想非非想处。斯处名为究竟解脱。是诸学者之彼岸也。太子若欲断于生老病死患者。应当修学如此之行。</strong></p><p>释：悉达多太子问用什么方便方法才能断除生死根本，仙人回答说，先要出家持戒，修忍辱行，住在空闲之处修习禅定。入初禅是离开欲界恶的不善法，有觉有观；入二禅是无觉无观，定生喜乐；入三禅是舍去喜心，得正念，具足乐根；入四禅，灭除苦乐受，得净念，入舍根，获得无想报。另外那个仙人师说修到无想处获得解脱了。其实不是，从无想处定中出定以后，就知道这不是解脱处。</p><p>仙人继续说，离开对色界的念想，入到无色界的空无边处定；灭除有对想，入到识无边处定；灭除无量识想，只观一识，入到无所有处定；离开种种想，入到非想非非想处定中，这是究竟解脱之处，是所有行者所要到达的解脱彼岸，太子您如果想要断除生老病死的过患，应当像这样修学。</p><p>原文：<strong>尔时太子。闻仙人言。心不喜乐。即自思惟。其所知见。非究竟处。非是永断诸结烦恼。即便语言。我今于汝所说法中。有所未解。今欲相问。仙人答言。敬从来意。即问之曰。非想非非想处。为有我耶。为无我耶。若言无我。不应言非想非非想。若言有我。我为有知。我为无知。我若无知。则同木石。我若有知。则有攀缘。既有攀缘。则有染着。以染着故。则非解脱。汝以尽于粗结。而不自知细结犹存。以是之故。谓为究竟。细结滋长。复受下生。以此故知非度彼岸。若能除我及以我想。一切尽舍是则名为真解脱也。仙人默然。心自思惟。太子所说。甚为微妙。</strong></p><p>释：太子听到仙人所说，心不喜乐，心里想，仙人所讲的不善究竟解脱处，不是永远断除烦恼结缚的方法。于是就说：我对于你所说的有不理解之处，现在想问，非想非非想处是有我还是无我的？如果是无我，就不应该说是非想非非想处；如果是是有我的，我是有知觉的还是无知觉的？我如果是无知觉的，就与木石一样了；我如果是有知觉的，就有攀缘，既然有攀缘，就有染着，有染着就不解脱。</p><p>能虽然能断尽粗重的结缚，却不知道细的结缚还存在着，所以才认为非想非非想处是究竟的。可是细的结缚滋长了，就会再次得受下劣生处，所以这不能渡越生死彼岸。如果能断除我以及我的念想，一切法都舍弃，则名为真解脱。仙人不说话了，心里想，太子说的太微妙了。</p><p>仙人指涅槃路，此路却不是涅槃路，因为路途中只有戒定，而没有解脱慧。有定无慧为外道，不得解脱。解脱为无我的心解脱，心有无我的智慧才能得解脱。解脱是诸结烦恼永断无余，非为只有解脱理论知见而烦恼犹在，就称为解脱了。所以在修行当中，如果自己烦恼如前无异，却以自己理论知见为傲，藐视他人，实则是烦恼具足的凡夫。也所以说修行的最初和最终，都是要破除无明的我相，断除烦恼，不是只获得理论知见就能称之为学佛了。有智慧，就无无明，无烦恼，有烦恼就有无明，有无明就无智慧，无智慧则处生死不解脱，所以检验自己的修行成果在于无明烦恼的淡薄与否，以及淡薄到什么程度。</p></div>"
}]