[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong> 简 介</strong></p><p><span>世间众生由于贪执五蕴而有生生世世的忧悲苦恼，为解决此生死苦患，佛陀出世为众生讲解四圣谛，引导众生断除五蕴之贪执，解除生死之苦患。本书正是基于佛陀所述四部阿含经的宗旨，详细而具体引导大众观行五蕴的生灭变异无常苦性，从而证得五蕴的无我性，破除无明，获得解脱的功能受用；逐渐消除贪嗔痴烦恼，减少对五蕴世间的贪爱执著，身心逐渐解脱，有能力解决自己的生死苦患，断尽一念无明，出离生死苦，趣向涅槃。</span></p><p>本书介绍了观行的实证方法，具体而详细，对于现代学佛大众可谓是一个比较详细的修学指导工具，学人只要按照这些方法修炼，发起出离心，加强禅定，就会摸到断我见的门路，早晚都会证果。本书也指明了断我见的标准，以让学人检查修学的结果是解还是证，以免误会，不仅耽误道业，也造下大妄语的罪业，后果可畏。最后祝广大修行者早日证果，获得身心解脱！</p></div>"
},{
    "title": "前言 对真正想如理实修者的告诫",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>前    言</strong></p><p><strong>对真正想如理实修者的告诫</strong></p><p>学佛修行，断除我见，破除我执，斯为第一。一切烦恼因我而来，一切罪恶因我而生，一切生死因我而有，六道轮回因我而现。我是生死的根源，我是苦恼的祸首，我是三恶道的渊源，我是障碍解脱的枷锁。有我即有苦恼，有我即有生死，有我即有罪恶，有我即不得解脱。既然如此，断除我见即能割断三恶道的枷锁，断除我见即能断除生死见惑，断尽我见即能断除罪恶，断尽我见即能出离生死轮回，断尽我见即能得解脱。</p><p>有我即是生死，无我即是佛。学佛修行由我逐渐达到无我，彻底无我即究竟成佛。因此学佛修行，首先就要拔出我这个祸根，不再招惹生死。断除我见，拔除针刺；破尽我执，再断法执；无我利他，圆满佛道。学佛修行，每日都要反观自我，降伏自我，我贪、我嗔、我痴、我慢、我爱、我见，无量烦恼，誓愿断除。每日三醒自我心，利刀斩断烦恼贼；心火断除得清凉，归家稳坐太平城。</p><p>佛法是成佛之法，成，意味着成就。学佛要想成就，必须要下功夫实修实证。实就是实际、切实、真正，修就是要下手做功夫，采取切实可行的方法手段，证就是证得，通过一定方式、方法、手段来体验和验证佛法，得出一个如实如理的结论。这个结论的得出，就代表了修行者智慧的成就，从此佛法属于自己所修得，非是学语之流。有志者，必要走此一途径，才能有所成就，从而真正改变自己，解脱自在。</p><p>而修证佛法的方法手段，是在广学多闻的基础上，深入禅定，如理思惟，如理观行。如果没有相应的禅定，对于所学，就不能如理思惟观行，也就不能实证佛法。那么所学的一切佛法，仅仅是佛学知识的累积和堆砌，数他人宝而已，与己无半钱分。</p><p>现见众多学佛人当中，其精进者日夜埋首于各种书籍和网络之中，广学多闻，孜孜以求，可是求得之结果，只是大量的佛学知识堆积胸中，虽能侃侃而谈，全是他人剩语，拾人牙慧，无半点实证体验，徒增慢心。其中不乏有能著书立说之人，其中内容多是各种名相的堆积，佛学知识的转载，没有实证体验。</p><p>说食虽不饱，食已不消，也成病患。所以奉劝勤学者，深入禅定，发起禅观，定中如理思惟观修，对所学法，加以验证。若定中如理深思之后，能知法之所以然者，方是实证之者，而非数他宝者，此人即为众中龙象，他日必能率众远行，共成佛道。</p></div>"
},{
    "title": "第一章　基础概念介绍",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  基础概念介绍</strong></p><p><strong>第一节  五蕴十八界的概念</strong></p><p>一、众生所谓的我，就是指五蕴和十八界全体，实际上是意根把五蕴十八界当作我和我所，我还是指意根，所以意根有我心我性我见我执。</p><p>五蕴就是：色蕴、受蕴、想蕴、行蕴、识蕴；十八界就是六根、六尘和六识；六根：眼根、耳根、鼻根、舌根、身根和意根。前五根是由四大所组成的有色根，肉眼能够看见，在身体的表面，叫作浮尘根；意根不是有色根，是无形的无色根，既是根，也是识心，肉眼不能见；六尘：色尘、声尘、香尘、味尘、触尘、法尘，分别与眼根、耳根、鼻根、舌根、身根、意根对应；六识：眼识、耳识、鼻识、舌识、身识和意识。</p><p>二、眼根与色尘相触，第八识产生眼识，眼识再与色尘相触，就能分别色尘，众生就看见了色；耳根与声尘相触，第八识产生耳识，耳识再与声尘相触，就能分别声音，众生就能听见声音；鼻根与香尘相触，第八识产生鼻识，鼻识再与香尘相触，就能分别香尘，众生就嗅到了香；舌根与味尘相触，第八识产生舌识，舌识再与味尘相触，就能分别味尘，众生就尝到了味；身根与触尘相触，第八识产生身识，身识再与触尘相触，就能分别触尘，众生就了别了触尘，有了各种触觉；意根与法尘相触，第八识产生意识，意识再与法尘相触，就能了别法尘，众生就有觉受。</p><p>三、五根、前五根分为外根和内根，外根就是浮尘根，在身体表面；内根叫作胜义根，在后脑勺部位，外根通过传导神经与内根相连接，肉眼看不见内根，因为有头皮包裹着，第八识在这里产生六个识。</p><p>六尘分为外六尘和内六尘。外六尘我们接触不到，是第八识与外五尘接触，通过五根的传导神经，把五尘上的四大微粒传导到后脑胜义根的部位，变为内尘；内根与内尘接触，第八识就产生六识来了别内六尘。内六尘是如影现像一般变现出来的，不是相对真实的外六尘，但与外六尘差不多一模一样，所以众生就以为自己非常真实，其实不是，都是幻化的。正如世尊所说的：凡所有相皆是虚妄。</p><p>四、五蕴：色身再加上识心就组成了五蕴，色法与心法和合组成了五蕴，五蕴就是识心在色身上的活动，没有识心，五蕴就是一具死尸。五蕴是和合体，和合起来的就不是真实的，有生灭变化的就不是真实的。</p><p>欲界众生在每个活动的当下都有五蕴参加，走路、吃饭、工作，各种活动都是五蕴的活动，佛说这是五受阴。识蕴是指六个识心的识别了别作用，眼识负责见色，耳识负责听声，鼻识负责嗅香，舌识负责尝味，身识负责觉触，意识负责分别法尘，识蕴的活动就是一系列的五蕴活动。色蕴的一切活动都由识心支配，所以五蕴是身心互相配合运转的。识蕴受意根指使，意根是总指挥，祂抉择要做什么，六个识就要随顺执行，身口意行就会随意根动转起来。</p><p>当六根与六尘相接触之时，六识就被生出来，六识接触六根六尘以后，就有分别性，分别六尘时出现的喜怒哀乐的觉受，就是受蕴。想蕴是六识心上的取相，对六尘的执取性，了知了别六尘境界，进而一系列的妄想、思惟等等心理活动就出现了。行蕴是运动、动转、流转、变化、变动的意思，是六识不断的存在和动转的功能作用，但其中也有意根和第八识的功能，是八个识和合运作的结果。</p><p>五、在色蕴上有识蕴，在受蕴上有识蕴，在想蕴上有识蕴，在行蕴上有识蕴。识蕴是六个识的作用，也称作识受阴。识蕴的这些功能作用是有边际有限量的，各有各的作用，互不相代。比如眼识，分别色尘的粗相，分别显色，不能代替意识分别形色，不能分别表色，不能分别无表色等等法尘；眼识不能听声，不能嗅香，不能超越见色的界限。</p><p>六、六受身：眼触生受、耳触生受、鼻触生受、舌触生受身，身触生受、意触生受，触的对象是六尘境界；六想身：眼触生想、耳触生想、鼻触生想、舌触生想、身触生想、意触生想。想是了知，是了别，心上取相为想；六思身：眼触生思、耳触生思、鼻触生思、舌触生思、身触生思。思，是指行蕴，是动转，是决定心，是六个识的造作，六个识的抉择和动转；六识身：眼触生识、耳触生识、鼻触生识、舌触生识、身触生识、意触生识。</p><p>以上是五蕴十八界的基本概念及内涵，懂得这些名相之后就要实证五蕴十八界的无我性。要想实证，必须要作观行，观行就是在定中深细思惟五蕴无我之理。</p><p><strong>第二节  三十七道品</strong></p><p>小乘断我见的观行，是思惟五蕴的无常性、苦性、空性和无我性，思惟一切法的生住异灭性，思惟色身的无常性以及各种觉受的无常性、思想观念的无常性、身口意行为造作的无常性、所有心识活动的无常性。思惟宇宙器世间的无常性，生活环境的无常性，与我们周遭的一切人事物理的无常性。观察出这一切法的无常性之后，再思惟这些法的空性、苦性和变异性，无常、苦、空、变异的法就是非我无我的。</p><p>观行成就的前提条件是：心性应该有所降伏，凡夫的心性应该减少减淡，多多少少与贤圣人的心性有所相应，应修的福德也具足了，持戒也满足了，忍辱与精进度也够了；智慧方面，五蕴十八界之理都能理解明了。这些基础条件都具备了，就与贤人接近，因缘到了就能成为断我见的初果人。</p><p>观行五蕴十八界的虚妄无我性并不很难，难在我们的三十七个助道品没有修出来，证道的基础没有打好，所有的观行就显得很吃力。如果三十七道品的基础打好了，稍加观行，就能确认五蕴的虚妄、不实、无我性。现在的学佛人比较浮躁，大多只在听闻佛法这个关节上用功，其它的基础佛法修行都不重视，所以很难实证佛法，修行的时间就要拉长，道业增进很缓慢。</p><p>一、三十七道品的内容是：四念处，四正勤，四如意足，五根，五力，七觉支，八正道。</p><p>四念处观：观身不净，观受是苦，观心无常，观法无我。</p><p>四正勤：一心精进修行四念处，就能断诸懈怠，使得已生恶得以断除，未生恶能不生；已生善得以生长，未生善能令其生，积极地断恶修善。</p><p>五根：根是能生长之义，有信根、精进根、念根、定根、慧根，这五根能生长出五种力量，才能破除无明黑暗。</p><p>五力：一、信力破迷信；二、精进力破懈怠；三、念力破邪恶；四、定力破散乱；五、慧力破无明。因五根的增长，就能获得力量，心不为愤怒所坏所执持，能治五种障碍。</p><p>七觉支是：择法觉支，精进觉支，喜觉支，轻安觉支，念觉支，定觉支，舍觉支。</p><p>八正道：正信，正语，正业，正命，正精进，正思惟，正定，正念。</p><p>四如意足：欲如意足（神足），精进如意足（勤神足），定如意足（心神足）及慧如意足（观神足）。因为修行的定力不足，不能使心如意遂愿，就需要修习禅定，以达到摄心的目的，使定慧等持，精力充沛，所愿皆得满足。足是依靠之意，如意指凡事随心所欲。从这里来看，学佛修行不修定力，心就不能得自在，智慧不能生起，在佛法修证上的愿望就不能得到满足，没有定，佛法就不能成就。</p><p>四神足，是四种能够满足自心愿望的神通妙用。足是依赖依止依靠的意思，如意是满愿的意思。欲如意足，欲是希求或想要的意思，由于心对佛法修行有希求愿望的缘故，对于法生起决定心，引发定力，定慧增长，起神通妙用；勤如意足，勤是精进努力的意思，由于对佛法精进努力修行，对于法生起决定心，定慧增长，引发神通妙用；念如意足，心心念念都在所修的法上，就有了心念力，由于心念力的缘故，对于法生起决定心，定慧增长，引发神通妙用；观如意足，观是观行思惟的意思；由于思惟的缘故，生起对于法的决定心，定慧增长，引发神通妙用。众生由于这四种修行用功方法而生起定力，使得所愿皆能满足，称心如意。</p><p>三十七道品修完以后，观行思惟五蕴之法就能断我见，观行断了我见以后就是小乘的初果，同时三缚结也随即断除，这样三恶道的生死结缚解开，三恶道的业消灭，未来永不下三恶道。</p><p>二、如何断我见呢？世尊在《杂阿含经》中让我们观察五藴的虚妄性、无常性、变异性、苦性、空性、无我性，五蕴中一个蕴一个蕴的观察思惟，这就叫作观行。观行需要有相当的定力，三十七道品修完时，观行才能得力有成效。十八界也要一界一界的观行其虚妄、生灭、无常、变异性，最后确认五蕴十八界都不是真实的我，也不属于我所拥有，内心真的确认了这一点，就能断我见。</p><p>从此以后，内心深处不再认五蕴为真实的自己，这样就把将自己捆绑在生死流转中的三缚结我见、戒禁取见、疑见也断了，未来不再下三恶道。要做到这点，就需要把世尊在《阿含经》中讲的四圣谛理学通，定力具足时再去一一观行，这是断我见的大致用功方向。三十七道品一定要修好，八正道也必须修好，所有的身口意行为都要符合八正道，观行才能成就，从而成为初果人。</p><p><strong>第三节  四圣谛和四相</strong></p><p>一、四圣谛内容是：苦谛，苦集谛，苦灭谛，苦灭道谛。</p><p>苦谛，就是苦的道理和真理。众生有三苦、八苦及无量苦，生生世世在六道中生死轮回，不断受生老病死无量忧悲苦恼的煎熬。苦谛是只有佛的圣弟子才能明了和认知的真理，所以叫作苦圣谛，知道有苦圣谛才能修道，从而断苦集而灭苦。</p><p>集谛，也叫作苦集谛。苦集谛是说明众生无量劫造作染污业，积集生死业种，后世就要感召苦受业报的真理。苦是如何集起来的，如何感召来的呢？因为众生有贪爱，不断贪爱心，因此贪爱就要不断现行愚痴的烦恼业，造作的贪爱业行作为种子收集起来，将来业种缘熟时就出现苦的业报。所以佛陀说：贪爱集就是苦集。只有通过修行灭掉贪爱，才能灭掉无量的苦。</p><p>灭谛，就是灭苦的方法和真理。就是说苦是可以通过一定的方法灭掉，不是永远存在不灭的。通过修道断了我见，继而又证得初禅定，就能断了欲界的贪爱，又断掉色界和无色界的贪爱，才有能力出离三界，灭掉三界里一切的苦受。</p><p>道谛，道就是八正道：正语、正业、正命、正见、正念、正精进、正定、正方便。众生通过修行八正道，圆成小乘的菩提资粮，观行五阴就能断除我见，断除我执，从而灭尽五阴，出离三界，入无余涅槃。</p><p>四果罗汉还没有入无余涅槃前，处于有余涅槃中，有余是指还有少苦可受的意思，因有五阴色身的存在，就有一些不可避免的苦受。比如忍受天气炎热的苦受，蚊虫叮咬的苦受，病的苦受，身体不适的苦受，他人轻视的苦受等等，这些都是轻微的苦受，不影响他们解脱生死轮回苦。只要有五阴就有苦受，不回心大乘的阿罗汉明白这点，不愿意再忍受任何微苦，也害怕出生以后再迷惑，所以才坚决要灭掉五阴，入无余涅槃，入涅槃以后就灭掉一切的苦受了。</p><p>二、四相：我相，人相，众生相，寿者相。</p><p>我相，即是五阴相：色阴、受阴、想阴、行阴、识阴；和十八界相：六根、六尘、六识。 色阴从无到有，生灭、变化、转易，易就是变来变去，无常、苦、空，所以不是我；受阴生灭变化无常，因缘所生，无常、不久住、苦、空，所以不是我；想阴生灭、变异、无常、苦、空，所以不是我；行阴生灭、变化、无常、苦、空，所以不是我；识阴生灭、变异、无常、因缘生、苦、空，所以不是我。</p><p>六根：眼耳鼻舌身意六根，前五根有生有灭、变异、无常、因缘生、苦、空，所以不是我；意根无生有灭，刹那生灭、变异、无常、苦、空，所以不是我；六尘：色声香味触法，六尘生灭、变异、无常、因缘生、苦、空，所以不是我；六识：眼耳鼻舌身意识，六识生灭、变异、无常、因缘生、苦、空，所以不是我。</p><p>人相：人类众生的五阴相、十八界相，同样都是虚妄、生灭、变异、无常、苦、空、因缘生，所以不是我、非我、不异我、不相在。五阴不是我（生灭的意根），也不是我之外的我所，我不在我所里，我所不在我里，我与我所不互相混合存在。从大乘法的角度来说，五阴与真实的第八识不一不异，既不互相混合，又有极其密切的联系。</p><p>众生相：十方世界所有众生无论圣凡，无论哪一道的众生，其五阴十八界都是生灭、无常、变异、因缘生、苦、空，都不是我，也不是我所，我与我所不互相混合存在。但从大乘法的角度来说，五阴与第八识不一不异，与第八识也不混合在一起，二者也有着极其密切的关系。 </p><p>寿者相：在众生身上体现出寿命的长短，生命的年轮，从细菌的几个小时的寿命到长寿天的八万大劫，以及了分段生死的八地以上菩萨们的寿命，都是虚妄，不真实，无常，空，都不是我，也不是我所拥有的。</p><p>三、无四相，就是无我、无人、无众生、无寿者。五阴十八界这个假我，是第八识依各种缘变生的，是虚妄、变异、无常、空、苦性的，因而是无我的。这需要作深刻细致的观行才能得出这样的结论，内心才能确认五阴真正不是我。既然我是虚妄的，同理可证，他人也是虚妄的，所有的众生都是虚妄非我的；那么依赖众生五阴而有的寿者相，当然就是不真实的，也是虚妄的。修出定力，好好观行这些理，是很重要的。这其中要修很多法，八正道以及三十七道品都要修好，才能证得这些法都是空，口说空没有用，仅仅是口头禅而已。</p><p>四、凡所有相皆是虚妄，都是第八识所幻化出来的，一切相都没有自己存在的真实体性，包括我相、人相、众生相和寿者相。想得解脱，就要离开虚妄的四相，不执取四相。离四相是拨离、不认取的意思，内心不认四相为真实有，知四相为幻化不实，有是假合。</p><p>离四相不是灭掉四相，灭掉四相以后众生就消失了，只剩下如来藏，没有了众生，从此再也无所作为。离四相和断我见的道理是一样的，断我见不是把五阴身这个假我灭掉，而是不再认可五阴为我，把知见颠倒过来。佛教中所说的断，是指改变知见，改变识心的认知，纠正颠倒见，从而具足正知见。我们学佛不能灭掉五阴七识假我，况且没有修到四果罗汉的果位，谁也灭不掉假我和四相。</p><p>众生心中都有四相，或者认色身是我，或者认能感受的心是我，或者认能思惟的心是我，或者认能行住坐卧、能言语说笑的是我，或者认能分别六尘的是我。既认这些法为我，即是认和我一样的人为人，即是认和我人一样的人为众生，即是认我人众生身上的一期寿命为寿者相，这样四相就具足了。</p><p>五、阿罗汉和菩萨们通过修行破除了四相，心中无四相，内心中不再认四相为真，为实有。如果五阴七识不修行不观法，不证得无我，就做不到无四相。而真如不用修行，祂本来没有四相，没有五蕴相，没有十八界相，也不认为自己是真实我，也不作主宰，没有自我心行，也不取我相。如此，祂也不取人相和众生相，更不取寿者相，祂也没有寿命，因为祂从来都是不生灭的。</p><p>《金刚经》中说：若心取相即着四相，若取法相即着四相，若取非法相即着四相。真如一相也不取，祂没有取的心行，连自己也不取。相反，妄心七个识总是在取，时刻在取四相和六尘相，取一切相，因此才生死不断，苦恼祸患无穷。总之能取的心就是妄，真如不取，也无四相。</p><p><strong>第四节  小乘无我的含义</strong></p><p>一、所谓无我，含义有二，一是无常非恒一；二是不能作主，不能自在。第一个意思好理解，就是所谓的我生灭变化不停，不能永远保持恒一不变。第二个意思费解一些，五阴不能自己作主，不能决定自己的出生、生长和灭亡，生不能作主，死也不能作主，而要由自己的业力作主，由阿赖耶识决定，因此五阴是不自在的，是被业力和阿赖耶识所掌控的。</p><p>至于说有些小事情，还是由自己的意根作主，比如在吃饭时可以选择吃或者不吃，在现有的条件下，选择吃些什么。但是从背后的因果来看，这也是由自己的福德所决定的，如果福德非常薄，吃与不吃，吃些什么，就不由自己说了算。每个时期都有饿死的人，都有吃了上顿就没有下顿的人，业力现前时真的没有自己选择的余地。表面能作主的事，都有背后的因果和业力在支撑和作用着。在福报不足时，想要作主脱离生死，还做不到，还要受业种业缘的束缚，而受生死苦报。这时候，意根就不能作主了。</p><p>二、不能作主的我，是指生死不能自在的五阴，五阴不能自主存在，必须依赖阿赖耶识才能存在；五阴也不能自主灭，必须依赖阿赖耶识和业缘才能灭，有生有灭，就是不自主、不自在的。而阿赖耶识却永远是自主和自在的，因为祂不生不灭，不由他法所决定。</p><p>另一方面，五阴身也有一定的作主性，并不是完全随生死业缘流转，否则我们学佛也就没有用，没有必要了。五阴中的第七识就是八个识当中的作主识，刹那刹那都对五阴的身口意行作主，决定身口意行的造作。如果意根不作主了，五阴也就没有身口意行，阿赖耶识也就休息。</p><p>而业行方面，意识意根可以共同努力改变生死业，努力修行去除无明烦恼，改变生死业报。这都是有主动性，能够作主说了算的，其最终结果就能断除一切无明。意识通过修行佛法，常常熏染意根，让意根一点点的脱离业力的束缚，去除无明和烦恼的羁绊，而选择造作善业和清净业，未来的果报就能越来越殊胜，直至成佛作祖。</p><p><strong>第五节  我执法执概念</strong></p><p>我执，是对五阴的执著，执著为我为我所，断了我执就是四果阿罗汉，那时意根再也不贪执三界世间法，寿尽就有能力灭掉自己，入无余涅槃得解脱。法执，也叫作法我执，意根执著蕴处界和合在一起而衍生的一切法或者某些法，为我为我所，这种法我执只有修到初步转识成智的地上菩萨才能开始一点点断除。</p><p><strong>第六节  观行之意涵</strong></p><p>观，谓观察、思惟、思量、想、推理、推想，也可以说念，有念的成分，分为现量、比量和非量的观。非量的假设、假想都可以使用，其结果如果是现量，就是正观。还有邪观，俗语叫作瞎想、胡思乱想、臆测，这些都属于没有根据没有道理的思惟活动。</p><p>行，谓运动、行为、变化、迁流、流转，凡是动的，非静止的，都是行的范畴，也可以说是事物发展的过程，没有结束，还在变化进行的，都属于行。</p><p>思心所的思，也有行的内涵，不仅有抉择、决定、造作的意思，主要还有思量性，计较性，俗语叫作琢磨，量度、比量、权衡。意识思惟以后，意根暂且不决定，不表态。祂在干什么？祂在权衡利弊得失，因为意根总是要保护自我利益，一定要不断的权衡利弊，计较得失，什么对自己有利，什么对自己无利有害，意根要思量，要动心思，然后再作出决定，让身口意造作出来。有一种叫作下意识（思）的知，就是意根的思量了别的结果。下意识的感觉，说不清楚的，都属于意根，能说清楚的，是意识的觉知。</p><p>想心所的想，也是动转，也是行的范围，不属于静止状态。想，有了别、分别、取相、执取的功能作用。取了相以后，思心所起用，思量所执取的法相，权衡利弊、轻重和缓急，然后抉择。思量暂时没有结果时，就叫作拿不定主意，意根暂时没有主张，没有决定。思量较之想，其区别在于深度不同，想，是对相的稍微浅层次的了别，紧紧围绕着相分，不离相分左右，取了相分以后，就会生起感受。之后，还要思量，最后的思量也是围绕着相分，考虑如何处理对待，权衡利弊，然后决定造作。</p></div>"
},{
    "title": "第二章　两种我见",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  两种我见   </strong></p><p><strong>第一节  瑜伽师地论中定义的我见</strong><br/></p><p>《瑜伽师地论》原文：<strong>萨迦耶见者。于五取蕴。心执增益。见我我所。名萨迦耶见。此复二种。一者俱生。二者分别起。</strong></p><p>释：瑜伽师地论里定义我见为：对于五取蕴心生执著，增加对自我执取，把五取蕴当作我和我所。</p><p>我见包括两种，一种是与生俱来的我见，伴随着生命的整个过程，在生命最开始就有了我见，不用外界环境的熏染，也不用意识的邪教导，这是指意根的我见。意根无量劫伴随着生命体，我见深重，极其难断，执我我所，难于舍弃。</p><p>第二种我见是由分别六尘境界而生起的，这是指意识的我见，把五取蕴当作我和我所。这种我见容易断除，只要听人宣说苦集灭道四圣谛理，思惟过后，明了其意，分别我见就断。</p><p>但是由于意识对于五蕴身不能作主，要服从作主识意根的调控，意根如果要执取五蕴，造作业行，意识不得不随从执取。意识强大时可以压一压意根的我，不让其泛滥；意识微弱时，意根不能得到来自意识的信息和管控，我性就会泛滥起来，没有阻挡的造作恶业，随恶业漂流那就难免了。所以意根不断我见，学佛终究不成就，仍然会执取五蕴为我和我所。</p><p> <strong>第二节  大乘广百论释论中所说的我见</strong></p><p>《大乘广百论释论》卷二原文：<strong>又诸我见略有二种。一者俱生。二者分别。俱生我见。由无始来。内因力故恒与身俱。不待邪教及邪分别。任运而起。故名俱生。此复二种。一常相续。在第七识缘第八识。起自心相。即执为我。名为我见。</strong></p><p>释：我见大略有两种，一种是俱生我见，另一种是分别我见。俱生我见，是由于无始劫以来，意根自身无明力的缘故，生生世世随逐着五蕴身不相舍离，不用意识的邪教导，也不用受意识邪分别的熏染，意根自己随缘就能生起我见，认取五蕴身为我和我所，所以叫作俱生我见，是五蕴身生来意根就有的我见，甚至在母胎里也有我见，把胚胎当作我和我所。</p><p>释论里说，俱生我见又可以分为两种，一种是生生世世相续下去，没有间断过，未来也不会断，除非真正断我见以后不再有俱生我见了。这种我见是因为什么而有的呢？因为意根无始劫以来的无明，把第八识所出生和执持的一切法，都当作是我和我所有的，从而生起对一切法的执著，叫作遍计所执识，从来不知道法界实相，不知道一切法都来自于第八识，是第八识所有的，所以这叫作颠倒见，叫作错执。</p><p>意根的我见总体来说都叫作法我见，把一切法都据为己有，其中意根把第八识所出生和执持的五蕴也当作我和我所有的，这就是颠倒的邪见和错见了，叫作五蕴我见，因有我见，才有我执。这种我见只有通过修学苦集灭道四圣谛才能断除，断除之后，意根对五蕴身的执著才能慢慢减轻和消除，我执断尽就会出三界得解脱。</p><p>原文：<strong>二有间断。在第六识缘五取蕴。或总或别起自心相。即执为我。名为我见。如是二种俱生我见。微细难断。数数修习胜无我观。方能除灭。</strong></p><p>释：释论里说，俱生我见的第二种是指有间断的意识的我见，意识在缘五取蕴时，或者是把五取蕴的总体相当作我和我所，或者是把五取蕴的个别相当作我和我所，于是执取五取蕴为我和我所，这就是意识的我见。但是意识我见的出生，必须有个前提，那就是意识要了解五蕴的相貌，能够识别出五蕴的相貌，懂得五蕴的功能和内涵，才能生起我见，否则就没有我见。</p><p>比如意识把眼识见色的功能当作我和我所，首先意识要知道此时是见色，此时是我见色，心中要有我的概念，如果还没有熏习出我的概念，就没有我见。比如婴儿刚出生时，对自己的父母没有分别力，不认识父母，所以谁抱他都行，长大一点认识父母了，就知道这是我的父母，于是就会贪执父母，不喜欢他人抱持和看管。</p><p>婴儿刚出生时，对食品没有分别力，对自我的认识也不清，就不会把食品当作我和我的而去贪执不舍，父母把食品拿给其他孩子都可以，婴儿没有意见，不会哭闹和生气；再长大一点时，对我和其他人就有了认识，对吃穿玩具等等有了认识，就会有我见和我所见，从而贪执自己所有物，不允许别人碰触。所以意识的我见不是与生俱来的，是通过后天的学习认知才生起来的，也依靠着意根的熏染，才有了我见和我所见。</p><p>释论里说，意根和意识的这两种俱生我见，行相很微细，所以难断。只有常常不断的修习殊胜的无我观行，长期熏习才能灭除。所以断除意根的俱生我见是不容易的，俱生我见不断，意根的俱生我执就不能断除，因为我执依我见而有，有我见才有我执。而意识是没有俱生我见的，只有分别我见。</p><p>原文：<strong>分别我见。由现在世外缘力故。非与身俱。要待邪教及邪分别。然后方起。故名分别。此亦二种。一缘邪教所说蕴相。起自心相。分别为我。名为我见。二缘邪教所说我相。起自心相。分别为我。名为我见。如是二种分别我见。</strong></p><p>释：我见的第二种是分别我见，也是意识的我见。这种我见是由于后天生活环境的熏染而出生的，不是与五蕴身一起出生的，不伴随着五蕴身而有，需要随着他人错误的教导才能有，并且生起错误的分别，才能有意识的我见。然后意识的我见再去熏染意根，就会增加意根的我见和我执。</p><p>分别我见也分为两种，一种是缘于他人对五蕴不正确的教导，说这就是色蕴，这就是受蕴、想蕴、行蕴和识蕴，这就是我的色身相，这是我的受觉相，这是我的认知相，这是我的思想观念，这是我的决定，这是我做的，于是就认为这些功能作用都是我的色受想行识蕴，叫作分别我见。</p><p>第二种分别我见，是缘于他人对于我相的错误教导，说这就是我，我就是这样的，于是把这一切相都当作是我，心中生起了我相，就有了我见。这就是所说的两种分别我见的内涵。</p><p> <strong>第三节  意识心的我见和意根的我见</strong></p><p>一、意识与意根这两个识很难分清楚，意根的我见非常广泛而深细，带有很重的执著性，一切时中恒执一切法都为我、为我所有。意根把眼识见色的功能执为我所有，认为我看见了色，我能见色；把耳识听声的功能执为我所有，认为我听见了声音，我能听见声音；把鼻识嗅香的功能执为我所有，认为我嗅到了香，我能嗅香；把舌识尝味的功能执为我所有，认为我尝到了味，我能尝味。</p><p>把身识觉触的功能执为我所有，认为我感到了舒适和痛触，我能感到舒适和痛触；把意识觉知的功能执为我所有，认为我知道了很多事情，我能思考，能感知很多事情；把第八识见大的功能执为我，认为我了知了一切法，一切法都是我的，我能了别一切法。比如我有神通，我能分身，我能创造一切等等这些极多的我，都是意根的我见，祂普遍计度执著一切法为我为我所有。</p><p>能自我感觉的心是意识心，意识心有见分和自证分，能证知一切法；意识心也有证自证分，能证知和反观自己，所以意识才有自我感觉，也包括感觉五阴和七识的心行。意识心认为能感觉到一切法的就是自己，一切法都是自己所拥有的，自己是恒常不断灭的，意识也把五受阴和十八界当作自己，这就是意识心的我见。不管是意识的我见还是意根的我见，没有证果时，所有的知见都是错误的，五阴世间法，包括色身以及色身的觉受，识心以及识心的觉受，这些法都是因缘所生，因此是虚妄法。顺着这些因缘进行推理，一个方向能得到一切法空无、非我的结论，一个方向能得到一切法都是如来藏出生的结论。二者都是断我见，后者也是大乘的明心。</p><p>二、意根执自己时时处处作主性抉择性为我，不知这也是生灭幻化不实的。意识是否执意根的时时处处作主性抉择性和恒审思量性为我为真实？究竟是谁人的意识能这样执著意根的功能作用？如果意识不知道这些功能作用都是意根的，而当作是意识自己的功能作用，这是错执，意识也无智。</p><p>意识认为自己能够了别六尘、分别六尘的功能作用为真实的为我的，这是意识的证自证分。这是错认，这种错认导致意根也随之错认。为了纠正意根这种错认，先让意识反思意识的功能作用不是真实的，不是我，以熏意根，一旦意根被熏，不再认意识的功能作用为真实为我的，就断我见了。</p><p>这些假我，主要都是意根认为的，意根认为色身是我意根的，六识的功能作用是我意根的，六尘是我意根的，五根是我意根的，意根的功能作用是我意根的。只有意根最有资格说一切法都是我的，因为一切法确实都是为意根服务的，包括意识包括五识，也包括如来藏。所以意根这个我是这样的自信，是这样的执拗，是这样的固执，是这样的傲娇，是这样的盲目，是这样的不可逆转，所以初次断我见才如此困难，学佛以后还要在生死海头出头没那么久，最后从从海中出头，站立起来，走向岸边，到达岸上，享受自在，解脱忧凄苦恼。</p><p> <strong>第四节  分别我见和俱生我见的差别相 </strong></p><p>一、俱生我见是指第七识的我见，第七识本身有分别性，祂的见也是分别见。俱生的意思是说第七识无始劫以来一直存在不灭，那么第七识的我见分别见，就是与生俱来的，先天性的见，因此叫作俱生我见。第七识意根属于六根之一，十八界之一，断我见时，既然把五蕴十八界的我都断除，当然就要把意根第七识的我见也断除，证得第七识意根也不是我，这才是真正的完整的断除了我见，否则就没有完全断除，是部分断我见，那就不是初果人。而第七识意根的我执，对五蕴十八界的执著要在四果时才能断除断尽，也就是说意根断除对五蕴十八界我的执著，就是四果阿罗汉，就是慧解脱的阿罗汉，就有能力出三界，解脱生死束缚。</p><p>二、分别我见也叫作断续我见，这是意识心的我见，是后天出生的，也受先天意根的影响。俱生我见，是意根的我见，因为意根无始劫以来一直存在，从来没有灭过，无始劫以来都是认五阴为自己，所以祂比较顽固，知见很难断除。意识心的我见，是意识认为五阴十八界就是我，就是真实的，认为意识自己就是真实的，永远不灭，能去到未来世，持这种观点，就是意识心的我见。这得需要观行五阴十八界的虚妄，尤其是观行意识心的虚妄，才能断除意识心的我见。</p><p>意根的我见，是意根从无始劫以来一直认为五阴十八界是我，是真实的，也认为意识是我，永远不灭，能去到未来世，也把能作主宰的意根自己当作真实，当作我而生起执著。意根的我见比较难断，需要意识反反复复观行五阴十八界的虚妄，观行意识意根的虚妄，直到有一天意根认可了，内心深处真的知道这个道理了，意根就不再认为五阴十八界是真实的是我。但是意根对自我的执著性还存在着，证得三果以后才能慢慢断除。</p><p> <strong>第五节  我见中一定有我执</strong></p><p>所有的我见当中都有我执，凡是内心纠结摆不开的，割舍不下的，看不透的，都是我执。我见，是我认为有个我能见色闻声嗅香尝味，或者是认为见色闻声嗅香尝味的功能作用是我所有的；有个我能思惟分析判断，有个我能感受，有个我能行走坐卧，或者是认为这些功能作用都是我所有的；同时也把色身当作我，或者是把色身的功能作用当作我所有的。这些都是生死的根，都应该断除。其中我认为的我，是第七识意根，能见色闻声嗅香尝味、思惟分析判断的我是六识，意根把六识的功能作用当作我和我所，这个我见要断除。</p></div>"
},{
    "title": "第三章　五蕴观行的第一部分（1）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　五蕴观行的第一部分</strong></p><p>观行五蕴十八界的虚妄，在观行之前，要把五蕴十八界的概念和内涵都要搞清楚，修出定力，然后再把五蕴中的每个蕴逐个思惟其无常性、生灭性、变易性、空性、苦性；五蕴的范围都要找全，尽量全部都观行到。在身口意行造作的当下，把五蕴的各个功能作用都分开，再观察其虚妄性、无常性、苦性、空性、无我性。十八界也是这样，每个界都要分清其内涵，逐个观行思惟其无常性、生灭性、变易性、空性、苦性、无我性。最后得出一个结论：五蕴十八界非我，不异我，不相在，这样就能断我见了。如果定力不够好，慧力不够强，可以按照佛教导的四念处观的观行方法修行，定慧都能同时增加，成效显著。</p><p>五蕴就是色受想行识，分成色身和识心两部分。色身的功能就是色蕴，识心的功能就是受想行识四蕴，断我见就包括断色身的我见和断识心的我见这两部分。</p><p> <strong>第一节  观行色身断除身见</strong></p><p>一、断色身我见，就要观行色身从出生一直到现在的生灭变化，从而确认色身是生灭变异的、无常的、苦的、空的；心中要确立一个观念，苦的不是我，我是不苦的，这是个真理。心中确立好这个观念，就可以观行色身的无常苦，就能断身见。色身是因缘所生，有因有缘色身生，有因有缘色身灭，生灭变异无常苦，即非是我。从色身的虚妄开始观行，细致思惟观察色身是如何出生的，如何变化的，如何灭去的。观察色蕴是如何的不自在，观察其生住异灭整个过程，思惟色蕴是如何的念念生灭变化。</p><p>观察色身的组织结构，了知色身是一个由地水火风四大构成的组合体，是由肌肉、骨胳、内脏、血液等等组合而成的，组合的就是不真实的。观察现在的色身与一年前的色身，与昨天的色身，与过去某一时段的色身都有什么差别；观察色身如何的不清净，有哪些苦；树立正确的观念——苦的就不是我，不净的就不是我，变化的就不是我，从色身上找不出真实永远不变的我性。真实的我是不会生灭变化，是永远常恒存在的，是不苦的。</p><p>思惟观行需要一定的定力配合，布施、持戒、忍辱、精进、禅定这五度条件要足够，然后才能建立一种正确的认知。当有了这样正确的知见，认为身体是不真实的时候，就是四加行当中的暖相现前。  暖相是证果前的四加行之一，是指意识和意根的智慧境界，是智慧性的认知。通过意识的思惟观行，意根初步接受了五阴十八界无我的观点，只是还没有确定，因而内心有了暖流，不再抗拒五阴无我之理。暖相暖流不是物质色法，是一种比喻，代表心的境界和感受。暖，火即将燃烧之前的状态，先出现暖相，接着火就会着起来。借喻意根的智慧境界，对佛法有了一定的认知，初步接受了五阴无我之理，之后才能生起确切的信和证。</p><p>通过闻思，认为正确可行，按照所闻的正确法义思惟，实际观行，最后才能证。观行这些法，得出和理论同样的结论，内心深处认为确实是这样，意根认可色身确实是不真实的不是我，也认可过去的色身不是我，未来的色身也都不是我，这样才真正断了色身的我见。</p><p>二、众生由于不懂色身运行的内在机制和秘密，认为身体的运转活动是连续的，真实的，可依赖的；其实是刹那刹那生灭，由无数个刹那生灭的假相连接起来的。就像是无数张相片极快速地播放出来以后，所形成的连续动转的图像，像播放的动画片一样，也像快速转动火把形成的火圈一样，其实并没有火圈，仅仅是眼识的错觉而已。</p><p>为了把色身活动的真相搞清楚，必须要修禅定，这种禅定叫作动禅，把色身的运动尽量放慢，再到极慢，最后几乎不动地慢慢地动转，比如慢慢地经行散步和绕佛，慢慢地拜佛，慢慢地经行运转身体。当某一时间因缘具足，智慧生起，就能觉知到：这个色身的活动犹如机器人的运转一样，并不真实。这样就能断身我见，从此不再认色身为我，进而再断识心我见，这样整个我见断尽，有一种小乘的声闻禅就是如此修的。</p><p>三、观行五阴的虚妄，先从观行色身的虚妄开始。思惟色身如何生、如何灭、如何不自在，思惟色身生住异灭的过程，思惟色身的念念无常变化。观察色身的组成与结构，确认它是一个复合体，复合所成的就不是真实的。观察现在的我与一年前的我的差别，与昨天的我的差别，与从前的我的差别，观察色身如何是无常的，有哪些苦，如何是不清净的。</p><p>最后得出一个结论：这样无常生灭变异的我，根本不是真实的我；如果是真实的我，就不会发生变化，真实的我是常而不变异的，是不苦的；苦的就不是我，不净的就不是我，变化的就不是我；从色身上找不出真实不变的永恒我。</p><p>根据自身具体情况观察色身的改变，和十岁之前的色身对照，和二十岁之前的色身对照，和三十岁之前的色身对照，和一年前的色身对照，和昨天的色身对照，就能观察出身体每时每刻都在新陈代谢，从皮肤到内脏都在更新，骨髓脑浆都在更新变化，整个身体与以前都不相同，只要是变化的就不是真实的，不是我。这些思惟也需要一定的定力配合，需要修行布施持戒忍辱精进禅定等菩萨行，菩萨最起码的基本条件都具足了，当内心有了这样的认知，认为身体不太真实的时候，内心的暖相现前以后，不久就会出现火花，出现光明智慧。心中要确立一个观念，只要是变化无常的，只要是苦的不净的，就不是真实的，不是我。</p><p>观行思惟自己从前有多少个身体，一劫之内的，一大劫之内的，无始劫的，那些身体都不是我。因为都已经灭去，连粉尘也没有留下；而所谓的我现在还存在着，与从前大不相同。观行未来的色身，还没有出现的色身更不是我，即使已经出现的色身也是念念生灭变化不停，因此都不是我。每一世的色身只是我的一件衣服，衣装在不断的变换更新着，衣装不是我；色身是我暂住的一座房子，仅仅暂时住一段时间而已，不能永远拥有，色身房子不是我。这些观行，理论是粗糙的，只是一个轮廓上的指导，具体的细节还需要自己仔细周全的思考，细相需要自己一点一点的整理出来，都要观行完全透彻。</p><p>观行身中四大及能量的互相转变，刹那刹那不停，没有定相可得，过去之身非是现在之身，现在之身非是将来之身，而现在当下之身又无当下可得，地水火风刹那生灭不住。而心脏持续不断的跳动，血液不断的更新流动，五脏六腑及眼耳鼻舌各自的功能作用无有一时休息停止，这些都是无常变异的，非是真实的我。</p><p>只有在正确的闻思修之后才能观行证得，要按照所闻的法去正确思惟，认为正确可行，然后再照此修行；观行思惟这些理，最后就能得出和理论相同的结论。意识应该了知到确实是那样，意根也认可就是那样：所谓的我确实是不真实的，不是真正的我。</p><p>这当中修行的过程可能需要很长的时间，也许只要很短的时间，完全看各人的善根福德因缘。需要修好菩萨六度，如果这些条件不具足，观行不容易成就，不能断色身的我见。修行关键是要发大心发大愿，心心念念为了解脱，为了佛教，为了众生，自然就有佛力加持，这样修行就像顺水推舟一样轻松。把这个自我抛出去，才能达到无我；舍了自己，抛了假我，才能证得真我。不断地舍弃世俗的欲望和邪见，培养出一定程度的出离心和大愿心，修行就能快速进步，从而达到自己所设定的目标。</p><p>四、观身无常无我，就是要观色身五根的无常，观察眼根的生灭、变异、无常。眼根能生病苦，眼根是能毁坏的，眼根是能产生变化的；眼根是从无到有，是后天出生的，也会灭去的，因此眼根是不自在的，能变异的，是无常的；无常即是苦，苦的就不是我，所以眼根不是我。</p><p>观察眼根的无常非我性。眼根不是常恒不变的，不是自在的，是能被外力所改变的，那就不是真实的我，也没有我性。我们不想让眼睛近视，如果业障不重，是可以做到的；不想让眼睛变得老花眼，某种程度上也可以做到；不想让眼睛有各种病症，也可以做到，这就是我们不想让眼根怎样，眼根就不怎样，我们既能保护眼睛，也能改变眼根，比如做各种手术，眼根就能发生变化。我们不想让眼睛是单眼皮，就可以变成双眼皮，这是可以做到的。所以只要能够改变，能够发生变化的，就不是我，也不是我所拥有的。</p><p>观察耳根的生灭、变异、无常，耳根是后天出生的，因缘散去也会灭掉，耳根是能生病的，是会变化的，因此耳根是不自在的，是生灭的，是无常的；无常的就是苦的，苦的就不是我，所以耳根不是我。观察鼻根的生灭、变异、无常，鼻根能出生也能灭掉，鼻根能产生变化，鼻根能生病，我们想让鼻根怎样就能怎样，不想让鼻根怎样就不怎样。所以鼻根是不自在的，是生灭的，是变异的，是无常的，无常就是苦的，苦就不是我，所以鼻根不是我。</p><p>观察舌根的生灭、变异、无常，舌根是后天出生的，也能灭掉的，舌根是能生病的，能产生变化的，因此舌根是不自在的，是生灭的、变异的、无常的；无常的就是苦的，苦的就不是我，所以舌根不是我。观察身根的生灭、变异、无常，身根是后天出生的，也是能灭掉的；身根是能生病的，也能产生变化的，因此身根是不自在的，是生灭变异的，是无常的；无常的就是苦的，苦的就不是我，所以身根不是我。</p><p>我们的色身五根是色法，是生灭变易的，而心法七识也是生灭变化的，有生灭变化现象的就不是我，也不是我所。五阴都是无常、生灭、变易的，都是苦的，因此五阴非我。我们的第八识，任我们作多大的努力都不能改变祂一点点，都不能碰触到祂一点点，祂才是一个金刚不坏体。第八识为什么不能碰触不能改变呢？因为祂无形无相，不生不灭，又本自具足一切法，不差分毫，因此碰不到祂，也无法改变祂。</p><p>五、断色身我见的一个不被众人所知的观行方法是：观行四大种子组成的色身，其生灭变异无常性。入手处是需要了解色身的组织结构，色身最基本的组织成分以及组成色身的最微小颗粒，然后要知道最微小的颗粒又是由什么生成的。这样一层层的观行，就能找到生命最初来源所在，就能断身见。用这种方法来明心证悟也可以，但需要有极好的根器，否则就不容易证得。</p><p>色身物质的最小微粒是夸克，由最小的微粒逐渐的扩大，形成了质子、中子、原子核、电子、原子，最后形成了分子，各种不同的分子结构组成了细胞。推究最小微粒的形成，是由四大种子所组成。由于四大种子在不断地变换改变着，最小的微粒就会不断地生灭变异，导致各种物质微粒也不断地生灭变化，细胞也就刹那刹那的生灭变异，我们的色身就刹那刹那的生灭变化，这就是无常。无常就是苦，苦就是非我的。</p><p>色身从胚胎开始到出生，然后逐渐长大，再逐渐的衰老，最后死亡，都是由于细胞刹那刹那生灭变化的缘故。细胞刹那生灭的根源是四大种子的不断变换，四大种子的变换还有其背后的秘密，这里暂时不说。色身当中的细胞如此刹那生灭变异才导致了色身的肌肉、骨骼、内脏、血液、皮肤等等色身的各个组织成分的刹那生灭变异，我们的色身就是在刹那的生灭中变化着。</p><p>如此刹那的生灭变化，我们的觉知心根本发现不了，最多只能发现几个月当中色身的变化。色身每天都在发生改变，已经很少有人能够感知到，何况是刹那刹那地改变着，更不容易感知到了。常作此类观行，日久功深，自然就能断身我见，同时也能观察世间的各种物质的生灭变异无常性，就能断除我所执，以后不再贪执一切色法。至于还能够明心证悟，那就另当别论了。</p><p>六、云何观行色身的虚妄断除身我见？《瑜伽师地论》卷一中，弥勒菩萨讲述了吾人色身的表色内涵，正确的理解其内涵并且进行深细地观行，就能断除色身我见。</p><p>原文如下：“<strong>表色者，谓取舍屈伸，行住坐卧，如是等色。谓即此积聚色，生灭相续。由变异因，于先生处不复重生，转于异处；或无间或有间；或近或远，差别生；或即于此处变异生，是名表色。”</strong></p><p>释义如下：众生的行住坐卧，行来去止，迎来送往以及身体的屈伸俯仰就是表色，是能够在外表色身上显现出来，能够被他人识别的色相。这些色相是由前后刹那生灭的所有色相所积聚起来的，前一色相生了，灭去；后一色相生了，灭去；无数色相刹那生了又灭去；连续起来，就构成了众生身体的每个动作。这些色相刹那刹那生灭相续的极其快速，才形成了众生表面看似真实的不生灭的行为造作。</p><p>众生由于业力和种种因缘变异，前一个色相在一处生了灭去，不在原处再出生。然后下一个色相就相续的在另一处出生又灭去，再下一个色相又相续的在又一处出生灭去。这样辗转相续，由生灭变异的所有色相构成了好像不生灭的行为造作，其实是生灭的时间长一些罢了。这些色相或是没有间断的连续生灭的相续运行，或者有间断的断续的运行，这样不同的色相之间或近或远的差别产生，就形成了肢体的运转。比如手臂从此处移动到彼处，是可近可远的变化；以及身体、头部、腿脚从此处到彼处不同距离的运转与变动；或者在同一处所同一位置产生变化，比如坐着躺着身体不动，腿脚也不动，但还是有色相的前后生灭相续变化。色相的前一刹那生了灭去，后一刹那又生了灭去，形成了色身四肢的坐相与卧相，都是生灭变化的假相。</p><p>众生不懂得色身运行的内在机制和秘密，就认为身体的运转活动是连续的真实的，是可依赖的；其实都是刹那刹那生灭的，而且是由无数个刹那生灭的假相所连接起来的。就像是无数张像片极快速的播放出来，形成了连续动转的图像，或者是河流，或者是人畜，就像动画片一样。也像非常快的转动火把所形成的火圈一样，其实并没有火圈，而是眼识的错觉。</p><p>为什么色身有各种的色相生灭变异的现象呢？这就是秘密，色身的色相当然是四大种子所生成，而四大种子是如来藏中本有的种子，不生不灭，与如来藏不一也不异；种子生成的各个色相与如来藏也是不一不异的，色相形成的色身行为造作与如来藏也不一不异，这样色蕴与如来藏就是不一不异的，同理五蕴与如来藏也是不一不异的。敬请诸位精进于禅定的修习，然后定中深细地观行，自然就能照见色蕴即空，进而照见五蕴皆空，就能断身见和我见，也可以明心证悟。就看各人的因缘如何，福德定慧等等菩提资粮的修行程度如何了。</p><p>七、如何观行断身见</p><p>为了断身见，每天晚上可以做如下观行，想办法进入定中，然后自己给自己催眠：想象自己现在眼睛散灭了，鼻子散灭了，耳朵散灭了，舌头散灭了。然后四肢散灭了，头颅散灭了，最后只剩下一个身段儿，再最后这个身段儿也消失了。</p><p>色身都没有了之后，就要思惟观行，这个色身、这个身体是不是自己，是不是我，是否是真实的？真实的东西，真实的自己，是否能被割掉，是否能被摘除，是否能够远离，是否能够消失，是否能够毁灭？然后问自己：这样一个生灭变异的，无常的物质色法是我吗？是不变异的吗？我是这样一个不坚牢的物质吗？我是这样一个不能做主的物质吗？我是这样不实在的吗？当内心真正认为这个物质色法肯定不是我，这样就能断身见了。</p><p>接着再往下观想，在自己仅剩下的一个身段儿上，四肢不知从什么处所，又回到自己身上了，头又回到自己身上了，眼睛回到自己身上了，鼻子回到自己身上了，耳朵回到自己身上了，嘴牙齿舌头都回到自己身上了，这样又组合成为一个完好的色身了。那么这个组合成的色身，由眼耳鼻舌身、由四肢、由头组合的和合起来的色身，是我吗？是真实不坏的吗？是由自己做主宰的吗？是不变异的我吗？</p><p>观想一个色身是由几个众生的色身和合起来的，头是一个众生的，脖子是一个众生的，两个手臂是一个众生的，两条腿是一个众生的，然后眼耳鼻舌分别是其他众生的。很多众生身体的某一部分，合起来组成一个众生的色身，这样就组合成了自己的色身。然后再进入一种冥想状态，进入一种意境，观想这个色身是我吗？这个色身真实吗？这个色身是由我做主宰的吗？这个色身是常在的吗？这个色身是不变异的吗？这样无常的法是我吗？真实吗？通过以上不断的观行冥想，因缘具足，就能断身见了。</p><p>八、如何究竟的观空色身</p><p>最究竟的观行，就是从大乘法的角度来观察色身的不实性。把身体观行到最细小的细胞组成，细胞里有各种粒子，粒子是四大微粒构成，四大微粒是如来藏里四大种子组成，四大种子无形无相，从如来藏里来。如来藏输出四大种子，形成微粒，微粒再聚合成最微小的物质，再聚合成比较大一些的物质，肉眼就可见了，然后再逐渐聚合成最初的色身，最后色身完整，就出母胎。</p><p>由此可知，色身就是空的、生灭的、无我的，是如来藏出生的，是如来藏执持的，全部是如来藏性，这个身体也不过是如来藏的种子功能作用转化成的，是如来藏的一部分功能，是如来藏的属性，没有色身自己的属性和自性。这些观行说容易也容易，但是缺少相应的定力，意根不能着力，不能亲自参与深细的观行和思量，就无法证得此理，没有定力意根不能认可和认证，就不能断除身见和我见，也无法证得如来藏。</p><p>九、大乘的观行方法，可以观想五阴身是四大种子的组合体，有无数的四大种子，包括无数的地大种子，无数的水大种子，无数的火大种子，无数的风大种子，这些种子合起来，形成了色身。再观行，从如来藏里出生了无数又无数的识种子，形成了眼识，耳识，鼻识，舌识，身识，意识，再加上意根，这样五阴身具足了。这样组成的五阴身就是虚妄非我的，从而断身见，断我见。</p><p>十、一切的物质色法，都是由四大微粒组成的。以众生坚固的妄想心来看，所有物质色法都有质碍，互相不能融通和超越。实际上根本不是这样，这是一种错觉，从无量劫以前一直错觉到现在，不知还要错觉到什么时候为止。物质色法实际上是什么状态呢？就像用亿万倍显微镜照射所显现出来的那样，全部是一种看起来是无序动转状态的生灭变异的粒子，比原子核还要小无数倍的量子状态，根本没有一丝阻碍作用，不是毫无缝隙的墙壁和铁板似的东西。</p><p>既然物质都是粒子状态，那么粒子和粒子之间就没有阻碍性，可以互相穿透渗入，就像没有对方一样。不仅人体外表的皮肤是呈一种粒子状态，皮肤里边的骨骼、肌肉、内脏、筋、指甲、头发、血液，每个细胞全部都是粒子状态，肉眼根本见不到，只有天眼才能见得到。最微小的粒子连科学家的那个亿万倍显微镜也看不到，那是最小的由四大种子最初形成的微粒。</p><p>其实色法的究竟状态就是那些肉眼看不见的粒子，身体呈现的是粒子状态，山河大地墙壁宇宙器界都呈现的是粒子状态，那身体就可以穿过山河大地墙壁宇宙器界，没有妨碍没有障碍。人有神通的时候就是这样，人的色身和墙壁都是粒子组成，人就可以穿越墙壁，就像没有墙壁一样，越过海水，就像没有海一样，穿越高山须弥山，就像没有须弥山一样。</p><p>所以我们真正修行，修到很深的禅定时，意根不把身体当作真实存在有物质阻碍作用的东西，或者是忘记了身体，那么神足通就出现了。而我们现在，意根把这一切法用坚固的妄想形成了，这一切法意根坚固的妄想认为都是真实存在的，是非常坚固的密不透风的，那么这个色身就有阻碍了，墙壁有阻碍了，宇宙、星空都有阻碍了。一旦把这个思想观念打开，一切色法就没有阻碍作用。修行就是为了在禅定中把意根的认知习惯改变，把意根的智慧提升，把思想观念打开，众生就能得到解脱，色身也就是解脱的了。</p><p>十一、物质的生灭变化因为太快了，快极了，超出了识心了知范围，识心才观察不到，于是就认为物质变化很慢，一切都来得及。众生无明重，自己观察不到的，就认为不存在，总是相信自己的观察，而无法相信事实。</p><p>这样极其快速生灭变化的东西，有什么真实性，有什么阻碍性，而我们就坚执色身，认为物质色身真实、坚硬，不可改变，不能自由穿过。因为意根的坚执，本来容通万物的身体，却被万物阻碍了，一点自由也没有。实际上就是自心阻碍自心，只有把心融化，一切滞碍才能打通。</p><p>所以千万不要认为断我见是容易的，垂手可得，读两部书就断我见了，听几个小时的课就断我见了，意识揣摩揣摩就断我见了，从此以后就与三恶道绝缘了。没有这样简单的事，没有这样容易的事，满天下都是初果断我见的人，这是天方夜谭，在梦境中也不会出现。修行就是要老老实实用功熏修，没有捷径可走，不能投机取巧。</p><p>十二、每日可以以色身为观察对相，观行色身成为一堆粒子，认可其虚妄幻化不实。行走坐卧都这样观行，断身见估计很快。结果：一、色身无碍，身体健康，了知其虚幻不实性，断除身见；二、禅定成就；三、观想能力提升，可成就各种三昧。</p><p>按照次序观行，先观行皮肤，再观行里面其它部分，一点点扩大，到整个身体全部呈现波动的粒子状态，确认其生灭无常非我。科学证明，我们肉眼所见的一切色法都不是真实的境界相，被无知所蒙蔽的认知能力是很低劣的，所以我们修行必须去除无明愚痴，才能不被自己蒙骗，才能认识真相，返本还原。</p><p>这十三图我们看过，意识心就算了解明白了，但是意根也了解了吗？非也！即使意识给意根重复一万遍这个理，意根也不会了解，不会认知到这个理。那要怎么办？要在定中实际观行，让意根自己一点点认识，一点点了解，祂要知道为什么，要的是证据，是证明过程，而不是要一个结论，有了正确的证明过程，意根自然就会得出一个正确的结论，那就是证得了。</p><p>比如说一切法无我这句话，意识在心里每天时时刻刻都这样念，念二十年，意根是否能真正明白为什么一切法无我吗？五阴世间整个三界世间万法就是一真法界，全体即真如。意识天天这样告诉意根，二十年之后意根能真正明白这个理吗？如果把五阴虚妄这句话，意识念十万遍，意根是否就能认识到五阴虚妄？绝对不能，理同上述。</p><p>每个众生的意根，经历了无量劫又无量劫的生生死死，苦苦难难，可是到如今，意根认识到生死的可怕了吗？意根认识到生命的苦了吗？意根认识到五阴无常了吗？意根有想解脱的想法吗？都没有，并且还要依靠佛陀的教导，熏习四圣谛法，不知道什么时候意根才能认识到苦，才想脱离。可见，意根不管经历什么，也不会自动明理，必须经过深思，寻找证据，不断反反复复的证明，直到证据确凿，意根才肯认此理。</p><p>每日这样观行，那么物质色法刹那刹那都在更新变异，我们就能够理解了；物质色法不是自然而然出生、变化和灭去的，也就能理解了；衣服不是自然而然变旧的，人也不是自然而然衰老的，房子也不是自然而然坏掉的，也都能理解了。一切法并不是如来藏出生以后，就不用管了，所有的物质都是如来藏管理维护的，四大微粒就是如来藏赋予给物质的，四大微粒的不断生灭变异，就是如来藏的作用的结果。一真法界，就是这个意思。</p><p>科学家给出的十五张图，就是证据，但是需要定中再仔细观行，自己思量认可。他人的结论不是自己的结论，意识的结论不是意根的结论，各自思惟各自得出各自的结论，互相代替不了。</p><p>十五张图如下：在显微镜下把人的手上一点放大1-1016(次方)倍</p><p>1图1米</p><p> <img src=\"/filepool/content/image/201910/151571102721711399.png\" title=\"151571102721711399.png\" _src=\"/filepool/content/image/201910/151571102721711399.png\" alt=\"&#x56FE;&#x7247;1.png\"/></p><p> 2图0.1米   </p><p> <img src=\"/filepool/content/image/201910/151571102733187769.png\" title=\"151571102733187769.png\" _src=\"/filepool/content/image/201910/151571102733187769.png\" alt=\"&#x56FE;&#x7247;2.png\"/></p><p>3图 1厘米，这是他手上的皱纹细部。我们即将进入微观世界。</p><p><img src=\"/filepool/content/image/201910/151571102745181179.png\" title=\"151571102745181179.png\" _src=\"/filepool/content/image/201910/151571102745181179.png\" alt=\"&#x56FE;&#x7247;3.png\" width=\"294\" height=\"212\"/></p><p>4图 1毫米，手上的毛孔。</p><p> <img src=\"/filepool/content/image/201910/151571102754285125.png\" title=\"151571102754285125.png\" _src=\"/filepool/content/image/201910/151571102754285125.png\" alt=\"&#x56FE;&#x7247;4.png\" width=\"291\" height=\"229\"/></p><p>5图 100微米，再放大十倍，依稀可见皮肤的组织结构。</p><p><img src=\"/filepool/content/image/201910/151571102773878786.png\" title=\"151571102773878786.png\" _src=\"/filepool/content/image/201910/151571102773878786.png\" alt=\"&#x56FE;&#x7247;5.png\" width=\"291\" height=\"209\"/></p><p>6图 10微米，一个细胞的数量级就是10微米，当然这只是一般来说。  </p><p> <img src=\"/filepool/content/image/201910/151571102784237119.png\" title=\"151571102784237119.png\" _src=\"/filepool/content/image/201910/151571102784237119.png\" alt=\"&#x56FE;&#x7247;6.png\" width=\"287\" height=\"367\"/></p><p>7图 1微米，疑似生物课上学过的细胞核膜。</p><p> <img src=\"/filepool/content/image/201910/151571102796336476.png\" title=\"151571102796336476.png\" _src=\"/filepool/content/image/201910/151571102796336476.png\" alt=\"&#x56FE;&#x7247;7.png\"/></p><p>8图 0.1微米，一看这么高度螺旋的结构就知道是染色体了。底下的洋文说:但凡人类的细胞，里面都会有23对染色体(46条)。</p><p> <img src=\"/filepool/content/image/201910/151571102896664688.png\" title=\"151571102896664688.png\" _src=\"/filepool/content/image/201910/151571102896664688.png\" alt=\"&#x56FE;&#x7247;8.png\"/></p><p>9图 100埃，埃是一种长度单位，指10的-10次方米。用字母“A”顶上加个小圆圈来表示。100埃的数量级就能度量某些有机大分子的物质了。这种物质就叫做脱氧核糖核酸，也就是常说的DNA。分子结构清晰可见。</p><p> <img src=\"/filepool/content/image/201910/151571102904276680.png\" title=\"151571102904276680.png\" _src=\"/filepool/content/image/201910/151571102904276680.png\" alt=\"&#x56FE;&#x7247;9.png\"/></p><p>10图 1纳米，10的-9次方米叫一纳米。很多物质精细到纳米级后将表现出很多在常规数量级上所表现不出的性质来。在纳米这样的数量级下，我们连原子都可以数清了。因此，纳米级又叫原子级。组成DNA分子的原子们，它们以共价键和氢键彼此结合成庞大的有机分子。生命就在这种复杂的结合中得以体现。</p><p> <img src=\"/filepool/content/image/201910/151571102914235432.png\" title=\"151571102914235432.png\" _src=\"/filepool/content/image/201910/151571102914235432.png\" alt=\"&#x56FE;&#x7247;10.png\"/></p><p>11图 1埃，原子是由原子核和电子组成的。图中所表示的是密布的电子云，我们能看到原子核外围的电子云比较浓。所谓电子云，其实并不是说一个原子拥有无数个电子，象云雾般的弥漫四围。每个原子拥有的电子数都是固定的，有数的，具体依元素种类而定。这些电子行踪飘忽不定，在原子核外部乱窜。一个电子，无数法身。就把这些电子“团团转”的特点用电子云来形容了。离核近的地方出现的几率大些，云就密;离核远的地方出现的几率小些，云就稀。</p><p> <img src=\"/filepool/content/image/201910/151571102923698837.png\" title=\"151571102923698837.png\" _src=\"/filepool/content/image/201910/151571102923698837.png\" alt=\"&#x56FE;&#x7247;11.png\"/></p><p>12图 1皮米，穿过最浓的电子云，发现更近核的地方反倒清净。原来离得远了要吸引，离得近了也会排斥呢，保持一个最佳的距离才好。下图的斑点就是原子核。</p><p> <img src=\"/filepool/content/image/201910/151571102931311080.png\" title=\"151571102931311080.png\" _src=\"/filepool/content/image/201910/151571102931311080.png\" alt=\"&#x56FE;&#x7247;12.png\"/></p><p>13 图 0.1皮米，这就是传说中的原子核了。10的-12次方米叫做一皮米。在0.1皮米的数量级下看原子核就可以看出很多个球球来，它们是带正电的质子和不带电的中子。</p><p> <img src=\"/filepool/content/image/201910/151571102939506513.png\" title=\"151571102939506513.png\" _src=\"/filepool/content/image/201910/151571102939506513.png\" alt=\"&#x56FE;&#x7247;13.png\"/></p><p>14图 10飞米，原子核的特写。</p><p> <img src=\"/filepool/content/image/201910/151571102947276538.png\" title=\"151571102947276538.png\" _src=\"/filepool/content/image/201910/151571102947276538.png\" alt=\"&#x56FE;&#x7247;14.png\"/></p><p>15图 1飞米(10的-15次方米)，质子(也可能是中子)的细部。</p><p> <img src=\"/filepool/content/image/201910/151571102954813663.png\" title=\"151571102954813663.png\" _src=\"/filepool/content/image/201910/151571102954813663.png\" alt=\"&#x56FE;&#x7247;15.png\"/></p><p>要找到组成物质的最细结构，就是发现物质色法的临虚尘，接近于虚空的微粒，只能是徒费心机。因物质只是一种幻相，它没有常而有质碍的最细尘粒，若在虚幻的现象界中寻找，将会离真相越来越远，永远也不可能穷尽其微。只有转而参究出幻化出生命的那个心，宇宙物质之谜才能解开，如来藏的四大种子，无形无相，输送出来成为了临虚尘的微粒，这实在是不可思议，真的有临虚尘和物质色法吗？真的有色身吗？</p><p>十三、所有人修行，都离不开降伏身见这个关口，无论大乘小乘，还是外道。身见，就是把色身当作真实的，当作是我的，身体能为我所用，我借助于身体能识别一切法，能受想思，因此就会贪执于色身。</p><p>身见的外在表现就是，为了色身而吃穿住用行，贪吃贪喝贪睡，让身体享受好的饮食衣服卧具等等，每天为了色身花费极多的时间精力和财物，并且极其讲卫生，每天都要换洗衣服，每天都一两遍澡，每天都悉心照顾，各种保养，不惜代价。</p><p>洁癖就属于身见，为什么非常爱干净，一会儿一洗，一会儿一擦，那么讲卫生，就是因为非常维护色身我，把色身当作很真实的我。为什么那么讲究饮食？色香味俱全，还要营养，吃剩下的饭菜，不管有多少，全部倒掉，不吃剩东西，就是认为色身为我，是真实，不能让它受到一点点委屈，不能有一点点不净。</p><p>身见的另一个表现就是贪欲，这是最严重的身见我见，虽然断除贪欲在初禅定之后的三果阶段，但是只要精进修行，贪欲心行就会逐渐减轻，逐渐淡薄，即使在没有降伏身见和我见，没有断除身见和我见的时候也是如此。</p><p>平时心里都是色身我，占据了很多心思和时间，佛法就不容易入心。心里都是世俗法，佛法就装不进去了，必须把世俗法搬运出来，佛法才能搬运进去。第一因为心的容量有限，装了一大堆垃圾，宝藏如何放得进去？第二因为佛法与世俗法不相容，有此就不能有彼，有贪就不能无贪，有清净就没有染污，无我就不能有我，精进就不懈怠。</p><p>我们在修道的过程中，首先要检查自己的身见是否很重，宝爱色身的现象是否很严重，如果能检查出来，就要想办法克服和对治，因为这是修道的最严重障碍。在思惟佛法过程中，会逐渐发现，这个色身是不太真实的，把握不住。在修道心发起来的时候，已经顾不得花时间保养色身了，这样身见习气就会一点点降伏，观行到最后，才认可了色身确实生灭无常，不真实，才断除了身见。</p><p>断除身见以后，对色身的贪爱现象就减轻很多了，能把心思用在道业上。在修行三十七道品的过程中，身见是逐渐淡薄的，执身的行为也减少了，能把多一些的精力用在道业上。没有经过三十七道品修行的人，这些现象就不会改变。身见属于最粗重的烦恼，如果不降伏不断除，其它的修证都谈不到。第一关过不去，后面一切关口都不能过，那就不要谈明心开悟之事。</p><p>有多少人，这点基础都没有修到，却都认为自己开悟了。都应该好好检查自己的心行，为什么那么在意自己的果位，而不在意解脱？这个在意的心，就是严重的我，这个心也要断除，才能断我见。没有一个真正断我见的人，每天心里都有一个证果的我，圣人的我，我见就无法断除，真断我见以后还有这样一个我是不可能的。<span> </span></p></div>"
},{
    "title": "第三章　五蕴观行的第一部分（2）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　五蕴观行的第一部分（2）</strong></p><p><strong>第二节  观行识心断除识心我见     </strong></p><p>五阴就是色阴、受阴、想阴、行阴、识阴。色阴就是色身的功能作用，受想行识四阴就是六识的功能作用，合起来就是五阴，而色阴也离不开六识的作用。</p><p>一、受阴就是六识的感受，包括苦受、乐受和不苦不乐三种感受</p><p>眼识有受，耳识有受，鼻识有受，舌识有受，身识有受，意识有受，六识都有受。比如说眼睛看一个色相，看佛像也好，看鲜花也好，不管看什么色相，眼识都有受，光线是否暗淡和刺眼，色尘看着舒服舒服等等，意识心也有受，喜欢和不喜欢，或者是舍受。眼睛看见太阳光时，眼识就有感受，感受到太刺眼了，就要躲避，或者感受到比较温和舒适，就喜欢和贪爱，这就是眼识的苦受、乐受和不苦不乐的舍受。看佛像时，眼识喜欢看佛像的色彩光泽，欢喜看，意识心就生起崇敬喜悦的感受。</p><p>苦受就是不喜欢的受，内心感到苦恼的受；乐受就是喜欢的感受；不苦不乐受就是谈不上喜欢也谈不上不喜欢的受，是无所谓的一种心境，一种状态，是一种舍受，这就是眼看色时的受。受阴以意识心的感受为主，因为意识心了别的内容比较宽广、细腻、深邃，内涵比较丰富，所以意识心的受容易观察出来。眼见色时的感受是因缘所生法，是生灭变异无常的，因此就是虚妄的、不真实的、幻化的，而生灭变异无常的就是苦的，苦的就不是我，因此这个受阴不是我。</p><p>耳听声音的时候有受，耳识心或者觉得特别刺耳，感到苦受，之后就想躲避；或者觉得特别柔和，就生起喜乐贪爱，这是乐受。在听声音的时候意识心也有受，觉得声音吵闹时就生起苦受，或者觉得柔和就生起乐受，或者觉得声音没有什么特殊意义，就生起不苦不乐受。意识心如果觉得声音内涵不雅或者带有攻击性，就生起苦受，不喜欢听；如果是赞美的语言，感兴趣的内容，柔和的音乐，就生起乐受，喜欢聆听。意识心也分为苦受、乐受、不苦不乐受；耳识心也分为苦受、乐受、不苦不乐受，对于喜欢的就生起乐受，对于不喜欢的就生起苦受，或者是离于苦乐两边的舍受。有些时候听声音觉得无所谓，不觉得喜欢或不喜欢，听也行不听也行，怎么都可以，听和不听一样，这就是不苦不乐的舍受，这是耳听声音时的感受。</p><p>观行受阴虚妄时，就要分析这个感受是什么因缘聚合而来的，因缘聚合而出现的就是虚幻的。有了声音，有了耳根，有了耳识，有第八识，有意根，有种子，这些因缘聚合时才能听到声音，才能生起感受。因此识心对于声音的任何感受都是虚幻的，所有的感受都是生灭变异无常的，因缘所生的法就是空的，所以受阴不是我。这些感受，观到最后都是苦受，苦的就不是我，因此受阴非我。</p><p>鼻嗅香的时候鼻识心和意识心都有感受，感受苦，感受乐，感受不苦不乐。比如闻到香气的时候，觉得比较好闻，心里就生起喜心，这里有意识心的乐受，也有鼻识心的乐受。如果觉得气味难闻，就生出厌恶的苦受，这里有意识心的苦受也有鼻识心的苦受。如果气味是中性的，既不香也不臭，心里谈不上喜欢，也谈不上不喜欢，感觉无所谓，这就是不苦不乐的舍受。</p><p>这是鼻嗅香时的感受，有苦乐忧喜舍五种受，或者说是三种受（苦受，乐受，不苦不乐受）。观察鼻嗅香时受阴的虚妄，就要观察这个受阴是如何产生的，产生的前提条件和因缘都是什么。既然鼻嗅香时的感受是在各种因缘条件下产生出来的，受阴就不是本来而有的，是生灭变异无常的，是虚妄的也就是苦的，因此受阴不是我。</p><p>舌尝味时有受，能产生苦、乐、不苦不乐三种感受。口腔里有食物和没有食物时都有受，没有食物时口腔里的味道通常是淡的，我们已经比较习惯了，不觉得怎样，谈不到喜欢和不喜欢，这是不苦不乐的舍受。当我们上火时，感觉口腔里有种苦味，这个苦味舌识心不喜欢，意识心也不喜欢，这就是苦受；打坐时舌识喜欢口中的甜味，这是乐受。</p><p>在品尝某种饮食的时候，舌识与意识对于喜欢的饮食就生起乐受，对不喜欢的饮食就生起苦受，对于饮食谈不上喜欢与不喜欢，这是舍受。修行人不贪味尘，对于饮食常常生起的是一种舍受，不在意味尘的好坏，能吃饱就行，这是修行人的一种心态。不管味道如何，什么都无所谓，不挑剔，不挑拣，既不喜欢也不厌恶，这是修行人的舍受。这些感受是因缘所生法，都是生灭变异无常虚幻的，都是苦的，苦的非我，因此受阴非我。</p><p>身觉触时有三种受，身识与意识都有感受。比如走路，感觉累和疲乏，身体中的各种感受是舒适还是不舒适，是温暖还是不温暖，是热还是冷，是渴还是饿，身识和意识都能了知，因此就生起苦受、乐受和不苦不乐的舍受。修行人对一切感受都不太在意，这个身体怎么样都可以，累了也可以，冷了也可以，热了也可以，饿了也可以，渴了也可以，各种状况都可以忍受，觉得无所谓，这就是修行人的舍受心境。这些感受都是因缘所生法，都是生灭变异无常的，都是虚幻的，都是苦的，苦的就不是我，因此受阴非我。</p><p>再有就是独头意识的受，在散位独头意识里，意识在思虑回忆时，就能生起苦受、乐受和舍受。在梦中作各种梦，也能生起各种苦受、乐受和不苦不乐的觉受。在定中，有些定境现前时意识心觉察到了，就生起觉受，但这个觉受多数是愉悦的舒适的轻安的乐受；四禅以上是舍受，欲界定当中也有一些苦受。这些感受都是因缘所生法，都是生灭幻化不实的，是无常的、空的。虽然有乐受，但乐受过去就觉得苦，所以一切受都是苦受，因此受蕴非我。</p><p>二、受阴，当你触六尘境界，对境界有了了知性，知道是甜的，知道是痛的，知道是景色，知道是气味，知道是声音，之后就会有苦受、乐受和不苦不乐的感受，这时受阴才出现。六识对六尘作意，之后触，之后领受领纳，之后想、了别、知，之后感受受阴，之后思，抉择决定，行阴造作。</p><p>在日常生活中，仔细检查自己的各种觉受，检查自己在贪爱着什么，对什么事情在意，对什么事情花费心思和精力。检查出来以后，就要分析这是什么心理，有什么意义，结果是什么。然后想办法对治自己的贪爱和觉受，修行就会扫除遮障，道业进步就快了。</p><p>三、想阴，想是心上取相，心上生起相，执取这个相，了知这个相，进而生起名言觉观。比如看着眼前的墙壁，就知道这是墙壁，眼识和意识执取了墙壁这个相，生起了有关墙壁的语言文字和想法看法，这个就叫作想；了知、觉观等等的心理活动和功能作用，就叫作想阴。</p><p>想在什么时候出现呢？想阴是六想身，在六根触六尘的时候都有想阴的现起。眼看色的时候有想，比如眼睛看到佛像就了知是佛像，取着为佛像，又生起有关佛像的语言文字。这种了知，有眼识的了知，有意识心的了知。眼见色时的想阴和了知性，是依赖各种因缘所出生的，缺少一个缘就不能出生，灭了一个缘，了知性也就灭去。因此，想阴是生灭变异无常的，是虚幻的，是苦的，因此想阴非我。</p><p>听声音的时候有想，心里了知声音，执取声音的相，生起有关声音的名言，想阴就出现了。这是什么声音，这个声音是什么意思，什么内涵，是好是坏，知道声音对自己对周围有什么利害关联，这些都是想，都属于想阴的范畴。观察想阴的出生过程，就知道听声音时的想阴也是因缘所生法，是依靠某些因缘才能生起的，因缘不具足，想阴不会出现，因缘灭去，想阴也随之而灭。因此想阴是生灭变异无常的，也是虚妄的、苦的，想阴就是非我的。</p><p>鼻嗅香时有想，鼻识和意识同时了知香尘，又取了香尘的名言概念，对香尘有了觉观思惟。鼻识直接感知香臭味是否刺鼻，意识了别了香尘的内涵，知道是哪种物体散发出来的，对我们有什么影响。这个知就是执取，执取了香尘的相，执取了香味的名相。继而又有后续的觉观和思惟，生出各种想法看法和知见，这就是鼻嗅香时的想阴。这个想阴要依赖各种缘，由如来藏所出生，是因缘所生法，是不实在法，生灭变异的无常法就是空，就是苦，因此想阴非我。</p><p>再有就是舌尝味时的想阴，舌尝味时舌识意识知道是酸味还是甜味，是苦味还是辣味。知道以后，执取这种味尘的名相，继而有名言分别，觉观思惟，各种心行就出现了，这些都属于想。此即因缘所生法，因缘所生法即是空，因而想阴非我。再一个身觉触的时候有想，对身体的各种觉受的了知，就是想。比如知道现在是饿的状态还是饱的状态，知道现在是疲乏的状态还是舒服的状态，知道了脚底走路与地接触时脚的感觉等等的想，继而名言觉观思惟，一连串的思想活动都现起。这些思想活动都是因缘所生，因而是生灭变异无常的，是虚幻的，是空的，也是苦的，因此想阴不是我。</p><p>还有就是意识心自己单独的想，比如回忆、计划、打算、妄想、思考问题、观察事理等等，这都属于意识心的想，进而生起名言觉观，安立名相。这个独头意识的想是依第八识、意根、法尘等各种因缘而生起，因此是虚妄无常变异法，是苦的、空的、无我的。</p><p>四、如何观行想蕴不真实</p><p>想本身是生灭无常的，让你一直想下去，根本做不到，让想的内容不转换，一直想一件事，也做不到。意识无论怎样想，这件事意根一旦觉得不重要，还有更重要的事情要做，意识就要做别的事情，就没有心思再想了。晚上想得睡不着觉，那都是意根放不下事情，促使意识思来想去，意根一旦心空放开事情，意识马上灭去，睡着了。</p><p>生灭变异的想，来无所来，去无所去，来时无踪，去时无影。哪里见想是我？当思绪万千的时候，追踪思想念头，始终找不到踪迹，正当思想时，念头也空。何为念头？何为思想？念的人事在哪里？想的事理在何方？思的识心是什么？抓不住，了无所得，空空如也。生灭无常法，没办法说得清，执着又执着不了，回头再找，毫无踪迹。</p><p>昨夜枯枝风雨袭，今朝雾露斜阳照；前世念念故人情，今生相忘成陌路。有何可想?</p><p>五、行阴，行是指六识身口意的种种运转施为活动，六识造作的各种功能作用。其实也包括第七识的运行活动，因为第七识本身的运行活动也能遮蔽自心，阴盖第八识的功能作用。行就是在运行、运转、运动，凡是动的，在造作中的，在起各种作用的，在变化的，都属于行阴所摄。</p><p>身行指身体内外的一系列活动，身体外表的活动他人能发现，内在的活动他人不容易发现。外表的活动包括行住坐卧、迎来送往、屈伸俯仰等等肢体的运转施为活动；内在的活动包括呼吸，血液循环，心脏脉搏的跳动，细胞的新陈代谢等等。口行包括语言、声音、文字的表达，内心的各种觉观等等，包括有意义的和无意义的语言音声，有贪嗔痴性和无贪嗔痴性的语言音声。意行就是意识内心的各种思想活动，包括有意义的思考活动和无意义的杂思乱想等，包括有贪嗔痴性和无贪嗔痴性的心理活动和心所法。</p><p>行阴具体表现为六识的思心所的运行，生起的思量和抉择活动。六识所有心所法的运行都属于行阴，眼见色的时候，眼识种子一个一个输送出来以后，眼识的心所法就开始运行。一个心所法一个心所法轮流运行，眼识就有了别分别活动，这属于眼识的行。</p><p>耳识的行，听声音时，耳识种子一个一个的生出来，心所法不断地运行，作意以后，又触，又受，又想，又思，生起各种思量和抉择，耳识就能不断地进行了别分别的活动。鼻嗅香时，鼻识也有行阴，鼻识一个识种一个识种输送出来，鼻识一直在进行了别活动，心所法不断的运行。舌识的行阴，品尝味道的时候，舌识一个识种子一个识种子的生出来，舌识的心所法一直在不断运行，生起思量和抉择，不断进行了别味尘的活动。身识的行阴包括识种子的输出，心所法的运行，身识一直在了别各种触尘，生起思量和抉择。意识心的行阴，包括识种子的输出，心所法的运行，意识本身不断进行的了别识别活动。构成这些活动的是识种子的运行，因此不管是什么样的活动，都是生灭虚妄的，都非我。</p><p>六、识阴就是六个识的识别性、了别性，比如眼识见色的功能，就是眼识对色尘的分别了别作用，就是眼识的识阴。六识对六尘万法的分别功能作用，了知六尘的功能作用，叫作识阴，分别六尘的整个过程就是识阴的运行过程。</p><p>产生六识分别的前提条件是：第一，必须有六根的存在，而且六根要正常，没有损伤和异常；第二，必须有内六尘的存在；第三，意根必须作意于六尘，想了知六尘。这时六根与六尘相触，第八识就出生六识，六识出生的同时，五遍行心所法就在这六尘上开始运行。</p><p>实际上，六识在刚要出生之时的种子位，就已经作意于六尘境界了，然后六识才生出来触六尘，最后思心所就能确定六尘境界，生起决定心。当生起最后的决定之后，六识对这个六尘境界的了别就结束，注意力就转移到其它六尘境界上，继续进行分别了别活动。如果六识同时了别多个目标，注意力分散，六识不能专注，定力就不会出现。这样六识的了别慧不足，了别性弱，了知的不清楚，容易出错；除非是定力强，训练有素的人可以一心多用，一心多能，因此训练六识的专注就能产生智慧。明心见性的前提就是要有六识的定，六识的专注力要强，才有意识心般若智慧的出现，从而明心见性。</p><p>六识及第七识，都是第八识输送的识种子所生出来的。这些识种子一个一个输送出来，就形成六七识心，六七识心形成的同时就开始运作。运作就起了别分别的作用，能了知一切境界。这个识心，也是识种子刹那刹那生灭所生出的识，就像水流，一滴水一滴水形成了水流。水流比如是识流六七识，一滴水一滴水比如是识种子，也可以把识种子比喻成电子，电子无形无相，我们看不见，但电闸一打开，电子就一个一个输送出来，前后排序出来，就形成了电流。电流一通过灯泡，灯就发亮，电子的功能作用就显现出来。</p><p>这些识种子由第八识一个一个输送出来，输送出来以后就形成了识流，六识出现，分别六尘的功能作用就出现了。识种子一个生了灭去，回到第八识中，下一个又生了灭去又回到第八识中，连续不断的生灭形成了六识，心所法配合就有了了别性。六识的了别实质是断续的了别，只因流转的太快，我们发现不了其中的断灭现象。就像电子，一个电子生了灭去，又一个电子生了灭去，这样连续不断就形成了电流。电流表面看起来好像是连续的，实际上是断续的，只是生灭的太快，我们发现不了其中的断灭现象。但是电流变弱的现象还是能发现的，当电子的输出有点缓慢时，电子的数量就减少了一些，电流就发生了变化。</p><p>水流也如是，水滴输出来的数量少了或是水流分流，或输送的速度变慢，水流就减弱，流速就减慢。同理，如果六识对不同的六尘境界都要作意都要触，识的分别性就减弱，就像水被分流，水流的势力就减弱一样。识种子分流以后，识别的势力就减弱，了别性就弱，智慧就劣。我们修行禅定，就是要让六识专注于一个境界，作意于一处，只触一处，这样识不分流，势力就强大，分别性就强，智慧就高。</p><p>我们要观行六识的虚妄，继而断除识心的我见，就要思惟识心的虚妄性、无常性和识种的刹那生灭性。要观行识心的虚妄无常，就要观眼识心的无常，耳识心的无常，鼻识心的无常，舌识心的无常，身识心的无常，意识心的无常。识种子形成的识，就像是水滴形成的水流。水滴快速地不断流出，循环流注，形成了连续不断的水流，如果认为有真实的水流存在，就是一种错觉，我们就被水流的假相给蒙骗了。识种子一个一个快速地流注出来形成了识，认为有连续不断的识心分别，实际上也是一种错觉，深思此理，就能断除识心为我的邪见。</p><p>观行识心的刹那刹那生灭性，形成了我们好像连续不断的分别了别的作用。我们现在的这个识心，其分别了别的作用是不是虚妄的，是不是假的呢？当然都是幻化不实的，没有真实的分别性。识心以及识心的分别功能作用，说断灭就断灭，是生灭变异无常的，是虚妄的，是有因缘的。有因有缘，识就出生；因缘灭去，识种就不再出生，识就消失，因此六识不是真实的我。</p><p>第八识如果不流注识种子，六识就没有了别作用，就会出现有眼不见色，有耳不听声的现象，一切法都不能了别了。我们平时可以在六根触六尘处，在六识了别六尘处作观行，观行这个能了知一切法的识心的虚妄性、生灭性、无常性、无我性。这样就把识心是我、是真实、是永恒存在的邪知见断除了，这样就断了识心的我见。从而就知道识心非我，识心的功能作用也非我，都不是真实的，都是虚妄的。我们能感受一切事物的心，了别一切事物的识心，包括这个识心所造的身口意行都是虚妄的，无常的，空的，都是无我的。</p><p>七、识心为什么无常</p><p>第一，识心是念念迁流不住，刹那刹那生灭的，由识的种子形成。比如电流是由一个电子一个电子相续不断的生灭流转，形成了一种流动性，这种流动性就是电流，有产生光和发光的功能作用。识心也是如此，一个种子一个种子流出来，就形成了识心流，第一个种子流出来灭掉，第二个种子在同一个位置流出来又灭掉，第三个种子流出来再灭掉，这样形成了识流，就有识的分别性。第一个识种子出来，触六尘，不能分别清楚；第二个识种子出来接着分别，还不能分别清楚，第三个种子出来，稍微能分别清楚，种子流出来越多，就分别的越清楚。</p><p>这些种子存在第八识中，由第八识输送出来。我们眼看色时，刚开始看不太清楚，看一会才能看明白，六识的分别都是如此。佛说一弹指顷有八万一千个生灭种子流注出来，一个生了灭去，又一个接着生了灭去，这样连续不断就形成一种种子流，识心才能分别一切法。所以说识心是刹那生灭的，是无常的，无常的就不是我。</p><p>第二，识心在五种情况下能够灭掉：睡着无梦时，昏迷时，死亡时，入无想定时，入灭尽定时，在这五种情况下没有见闻觉知性，没有识心的分别。既然识心是能灭的，就是无常的、变异的，是苦的，因此不是我。</p><p>第三，识心是从无到有，不是本来就存在的。当六根触六尘时，是第八识产生了六识然后分别六尘。既然识心是被出生的，不是本来而有的，那就是虚妄的、无常的、苦的、变易的、不是我，没有我性。</p><p>第四，众生的识心总是变化不定，刚才还是很喜欢的东西，一会就厌恶了；刚才还认为很得意的想法，一会就改变了；刚才订好的计划，一会就取消了。心念总是变化不停，思想总是变来变去。一个妄想生了又灭，后念否定前念，说出去的诺言很难实现，喜怒哀乐无常，计划打算常变。自己都抓不住自己的心，也不知道自己到底要做什么，究竟要怎样，何况是他人，那就更摸不清他的心思了。这个心越观察越觉得无常不可靠，因此识心不真实，不是真实可靠、可依赖的我。这样识心虚妄的观行就完成了，意根认可这个理，就算断了识心为我的邪见。</p><p>八、识阴的观行</p><p>观行五阴受想识中的识阴，要观行识种子生成七个识的功能作用，以六个识的功能作用为主。受想行识的识种子输出来以后形成了六识，然后才有六个识的种种功能作用。六识生出来以后，就有了受觉，然后有识觉的分别作用，又有行觉，有受阴、想阴、行阴、识阴的所有功能作用，具体都有哪些功能作用自己要一一仔细的观察清楚，不要错过一个。要知道识种子生出来以后，识心就有这些作用，这个很重要，观察清楚，大小乘都能证悟。</p><p>识阴当中主要观察受的虚妄性，我们的五阴还是以受阴为主，众生都把自己的觉受当成真实，以觉受为中心而展开五阴身口意活动。观察这个受觉如何是不真实的、生灭的、空的、苦的、不是我的；然后再往下观察想阴、行阴，想阴就是执取、取相，心上取相，了别分别，或者是种种的思想思惟。</p><p>行阴，有识就有行，因为识必然要运行，识运行了以后才有受、想，才有分别的功能作用，把识种子形成识这个内容观察清楚了，大小乘法都在这上证，将来证悟的智慧会非常深，开悟一下子就悟到唯识上了，这个悟就比禅宗的悟要深透得多，悟到识上了，智慧就非常深，将来就能很快具备唯识种智。</p><p>九、识种子生出来，才有五阴的功能作用，没有生出来就没有五阴的功能作用，那么这个五阴的一切功能作用，是真实的吗？是我吗？我是这样被限定死了，被主宰的吗？我是生生灭灭不定的吗？这样不可把捉的五阴功能作用，能是真实的我吗？</p><p>吃饭才能活着，不吃饭就会饿死的五阴，能是我吗？有空气才能维持生命活动，没有空气，生命就会停止活动的五阴，是我吗？补充气血就能行走坐卧，没有气血就不能僵硬如柴的五阴，被各种因缘条件限定得死死的五阴，能是我吗？这样不自在不自主的五阴身，有何可贪爱宝爱的呢？</p><p>色身里四大种子刹那刹那都在生灭变异，身体里的细胞刹那都在更新代谢，在短时间内细胞组织就更新完毕，身体里的血液就会全部更新换代，不再是先前的血液了。内脏器官在一段时间内也会全部更新，乃至于全身的组织器官以及肌肉筋腱组织等等也要全部更新变异，最后身体里的骨骼也要全部更新，整个身体从里到外从上到下，全部改变，不再是从前的身体。</p><p>所以我们的相貌总是在改变，到一定年龄阶段，其外貌与年轻时大相径庭，甚至看不出有相同之处。所有人都与孩童时完全不同，其中经过大的病患的人，其外貌与健康都可能要完全不同，看不出是同一个人。这样的身体，怎么能是自己，怎么能是他人？</p><p>那么仔细思维观行时，有智慧之人，不会认这样的身体为真实为自己，不会固执的认为这就是我，而执著不已贪爱不已。很多人明明都知道，这样的身体根本把捉不定，根本控制不了，那为什么不把注意力和精力转移到我们能稍微把捉得了，能存入种子后世仍然能得到受用的精神领域，尽量提高自己的般若智慧呢？</p><p>十、佛在《杂阿含经》中说，五阴十八界叫作众生，这个众生是生灭苦空无常的，不是真实的我。五阴就称为众生，众生就是苦空无常无我的，证得苦空无常无我就叫断我见，叫证果，得一分解脱的功德受用。要证得无我，只有把这五阴的功德作用否定了，不把这个五阴作用当成真实的，不当作是我和我的，就能证果，证果以后，三恶道业就消灭了。</p><p>阿含经里所说的识阴，就是六个识的功能作用，是生灭变异的，不是指阿赖耶识。识阴的阴即是指遮障作用，遮障七识心，只认六识的功德而不知都是阿赖耶识的功德作用。而阿赖耶识不遮障自心，所以不归于识阴。因外道们都不知道自己有一个不生不灭的自性清净心，而把识阴当作真实的我，不承认有真实的法身佛如来藏阿赖耶识，所以就不能免除生死轮回苦。</p><p>识阴本身有识别的功能，识阴的受想行识功能也叫四阴，四阴加上色阴叫五阴。色阴，即是色身从母胎一直到老死这个阶段的身体；受阴，能够感受六尘境界苦乐忧喜舍的受，遮障着七识；想阴，就是了别、取相、执取，在心上取相作了别，例如名字、概念等分别，然后心生取着，这就是想阴，遮障着七识心；行阴，行就是动的意思，不断的生灭变异流转造作就是动，就是行，也遮障着七识。　　</p><p>总而言之，识阴是六识的功能作用，六识是生灭的，识阴一定是生灭的。阿赖耶识是不生不灭的，祂不属于识阴，虽然祂也叫识，但祂的识别性和六识的识别性是完全不同的，二者不能混淆。</p><p>十一、在各种我见当中，以受阴为我的人是最多的，注重受阴的人非常多，为了觉受而造业的人是最多的。为了面子活受罪，就是为了识心的觉受而让色身受苦，不少人都是这样。历史上为了留名而死的，大有人在，叫作名垂千古。为了义气而死，为了面子而死，为了虚荣而死，为了名誉而死，为了……而死，有太多太多的人。这些人都以识心为我，执著识心比执著色身还要严重。我执断尽的时候，对识心觉受的执著性才能断尽，但是习气时而还要现起。</p><p>    因为众生以受阴为我，执著受阴，为了内心的感受，生起贪爱和嗔恚，而造下无量无边的罪业。如果不以受阴为我，不执著受阴，不贪着适意的感受，不厌违逆的感受，就不会生起贪爱和嗔恚，也就不会造下恶业，而不自知。</p><p>娑婆世界众生最显著的特点，就是贪欲嗔恚愚痴，欲界人间最普遍的烦恼就是贪欲。尽管修学了佛法，懂得一些因果，知道贪欲是沉沦生死的祸根，可是因为业障深重，还是无法降伏贪欲，不管在家还是出家，一切烦恼的降伏，都是太难太难。因为在无量劫的生死熏染中，习气根深蒂固，很难撼动一丝豪。</p><p>十二、定中的意识心也是生灭法</p><p>佛法中最基础的小乘佛法，是苦集灭道四圣谛之理，观察五阴之苦患，明五阴苦之集谛，知五阴苦之灭谛，修灭五阴苦之道谛。然后一一观行五阴的苦空无常无我性，内心深处真认可了，才能断我见证初果，三恶道的业从此消灭。依照佛的教理用智慧作观行，其中也不离戒律的修行，不离禅定的修行以及福德因缘。</p><p>观行时主要是识阴的虚妄不容易观行，尤其是意识心太深细，也很广泛，若能把意识心的功能作用找全，然后一一都否定掉，认可这些识心作用的虚妄也是很不容易的。如果能对六识心的体性作深细的了知，然后把识心的所有作用处都找出来，再观行其生灭虚妄性，就能有把握把我见断彻底。意识心的境界很广泛，一般修行人容易知道散乱和起烦恼的意识是生灭虚妄的，往往不知道意识入定后变得深细和清净，不起妄想，没有念头时，仍然是生灭虚妄的意识，不是真实的我。此是意识定境，非是不变的真心境界。既然是境界，境界就是法尘境，法尘境是意识心所分别的对象，知道自己入定进入定境了，这个知定境的是意识心，是生灭法，不是我，不是真实的。因为出定以后就没有定境，念头又产生出来，这样有变化有生灭的法，就是虚妄法，不是真实的不变异法。</p><p>六祖说：那伽常在定，无有不定时。真心永远在定中，没有出定也没有入定，没有增减变化。佛在《楞严经》中也说过：内守悠闲，犹是法尘分别影事。佛说的就是这种入定的情况，祂老人家早已料到后世众生难以识别真假，尤其是末法时期，众生福薄，邪见炽盛，不能认清和辨别真伪，世尊特在楞严经中专门提示，以警示后人。只有认清定中的意识境界也是虚妄，我见才能断尽。如果认为定中的意识为不生不灭真心，大小乘的果位都不能证得，仍然是执生灭的识心为我的凡夫。</p><p>十三、 问：意识了别法尘后会灭去？白天法尘不断变化，起起灭灭，意识没有睡眠的情况下，是否只是五俱意识和独头意识依法尘不断转换，只有睡眠无梦时才灭去?</p><p>答：意识了别一个法尘，运行完这个内容，就会在这个法尘上消失，随着意根的指挥，会在另一个二个法尘上出生了别运行，然后再灭去，在另外之处再生起。意识就是这样随着意根的攀缘，不断的生生灭灭，没有一丝自主性。所以意识太虚妄不实了，根本不是我和我所，不要再认这样的意识为我了。</p><p><strong>第三节  五蕴的综合观行方法</strong><br/></p><p>一、断我见，包括断色身我见和断识心的我见。断色身我见，就要观行色身从小到大的生灭变化，从而确认色身是生灭变异的、无常的、苦的、空的，心中要确立一个观念：苦的不是我，我是不苦的。这是永恒的真理，心中确立好这个观念，就可以观行色身的无常苦。色身是因缘所生，有因有缘色身生，有因有缘色身灭，生灭变异无常苦，即非是我，这样就能断除色身的我见。</p><p>断识心我见，要思惟识心的虚妄无常性，识种刹那生灭而形成了识，就像水滴形成的水流，水滴循环流注，形成了连续不断的水流，如果心里认为有真实的水流存在，实际上是一种错觉，是被水流的假相所蒙骗了。识种子一个一个快速地流注出来，形成了识，实际上认为有连续不断的识心分别也是一种错觉，深思此理，就能断识心为我的邪见。识种的流出是有因缘的，因缘和合，识就出生；因缘散灭，识种不再出生，识心就灭，深深的认可此理，就能断除识心为我的邪见。</p><p>如果能把小乘的四阿含学好，先断我见之后再明心，我见就容易彻底断除，烦恼性障能很快降伏。如果直接参禅而明心，在定力不足的情况下，解悟的成分多，我见不易断彻底，也许根本不能断我见，那么这个所谓的我总要出来兴风作浪，造作恶行，阻碍自己的道业。我性重的人到处惹是生非，搅得天下不太平，因此降伏我，对于修行，对自他利益都是极重要的，一旦降伏了自我，生生世世都受益无尽，心不生苦恼。</p><p>二、观行五蕴的虚妄，可以把五蕴分成两部分来观行：一部分是色身，一部分是识心，识心加之于色身形成了五蕴。把身心静下来以后，静静地思惟和感知，领受色身的无常生灭性，要思惟色身的生、色身的住、色身的异、色身的灭；确实了知色身的无常和空幻，再来感受色身的苦，就能证得色身的无我性。再思惟前世的色身，后世的色身，无论是哪个种类的色身都是生灭、变异、苦、空、无常、无我的。然后再来思惟识心的生灭变异性，不管是哪个识，凡是能觉知一切法的功能作用的识心，都是生灭的、空的、虚幻的、不真实的。</p><p>还可以把自我五蕴分成能所两个部分来观行，这样稍微简单一些，能就是六识的能见性，所就是六识所见的六尘。在眼见色的时候，分离出一个能见色的眼识和一个所见的色尘，要深细思惟二者的生灭变异性。在耳听声时也分成两部分，一个是所听到的声音，一个是能听的耳识，这样来分别观察二者的生灭变异性；在鼻嗅香时，分别观察思惟，所嗅的香尘和能嗅香尘的识心，这二者的生灭变异无常性。在舌尝味时，身觉触时，意识思法时，都分成能所两部分来观察思惟。</p><p>思惟观行之后，如果内心深处真的通透了，内心应该有个震动，对自我的知见看法就有个颠覆；能感觉到自己在一切时中，无论六根触什么，六识分别什么，整个的五蕴从心到色身都象个空壳子似的，能真切感受到自己是多么的虚妄，多么的无常，多么的不实在。观行成功时，内心的觉受应该有翻天覆地的变化，内心里有空空的觉受，行住坐卧一切时中都能深切感知到自我身心的虚幻不实。</p><p>这样的断我见，就是真真正正的断我见，彻彻底底的断我见，不是口头上的断我见，也不是仅仅在理论上的断我见。后续的修行，无论是大小乘，都能稳步快速地进步，烦恼就能如日消雪，身心轻安，今生后世就能大受其益。所以奉劝大家，此法无论如何难行也必须要行，定要断除我之生死见。</p><p>三、五阴十八界我是由七个识与色身和合形成的，由五受阴组合而成，由六根六尘六识组合起来，和合起来的就是一种虚妄的假法，不是真实的。单有一个受阴不是我，和合起来的更不是我；单有一个界不是我，和合起来的更不是我。真实的我不是和合而来的，祂是本来就存在，有独立自主性，不由外缘所决定。</p><p>现见众生五阴不能独立存在，是由各种因缘聚合而形成，五个受阴是组合起来的，十八个界是组合起来的，都没有独立自主性，没有实在性，即非有我性，即是空，即是一个假名词。等到因缘灭时，组合在一起的各个部分就会散去，假体就消失。就像一个群体由很多人组成，单独一人不名群体，组合起来的也不是真实群体，它没有自主性。因缘消失时，一群人各奔东西，群体就不存在，即使存在也是一个假名词，因此群体非群体。</p><p>就像一个家庭，由父母儿女组成，单独一个人不是家庭，组合起来也不是真实家庭，在现象上虽然好像是有，实质上却是无，实质的东西是真实永远不变易的，不由外缘所决定的。家庭这个假相是由很多因缘因素形成，当这个因缘消失，因素消亡，家庭这个假相也就灭去，因此家庭非家庭。就像一个房屋，由砖瓦木材水泥和合而成，抽去一种材料，房屋即倒塌，房屋这个假相就不存在了，因此房屋非房屋。就像桌椅板凳，由木材和钉子等材料和合组成，抽去一种材料，桌椅板凳的相就不具足或者散坏掉，应叫作木头和钉子，桌椅板凳的假相即消失，因此桌椅板凳非桌椅板凳。五阴我非我，意根我非我，意识我非我。</p><p>世间一切相都是诸多元素和合而有，而各个元素都没有自性，和合起来的更没有自性，因缘散去，一切皆灭，因此世间非世间。因缘所形成的法就是不久住法，不永存法，因此我们不应贪执不舍，贪也没用，执也没用，任人如何不舍，最终仍然离去散去。不如不执，早舍贪心，断舍烦恼，解脱系缚，回归本性，自由自在。</p><p>四、法，包括了色法和心法，五蕴都是法，六根、六尘、六识都是法。观法无我，就是观五蕴十二处十八界和合在一起所生成的一切法当中都没有我，都不是我。六个识每天都在刹那生灭，都是虚妄的、变易的、无常的、苦的、空的，也都是第八识所出生的。七个识刹那刹那生灭变化不停，一弹指顷就有八万一千个种子生了灭，灭了又生，极其快速，我们感觉不到识种子生灭的现象，只感觉识心好像是连续不断的，识心的分别一直是在进行的，其实识心不是连续的，而是断续的，只是极其快速罢了。</p><p>因为太快速了，我们的觉知心无法分辨出刹那的断续现象，因此就有一种错觉，觉得自己的心是连续不断在运行着。就像一根火把，当我们非常快速地转动它的时候，好像看见了一个火圈，感觉火圈还很真实，其实并没有火圈，火圈非火圈，只是一根火把而已。我们的眼识无始劫以来一直在被假相所蒙蔽着，看不清真实的现象，就会出现幻觉，把假相当作真实相。就像电影电视里的人物活动一样，里面的一切动景都是一个格一个格的胶片连起来的，播放速度太快了，就觉得是连续的，因为感觉是连续性的，就以为是真实的。如果把所有的所谓连续性的事物都分割成一点一点，我们就不再以为这些事物是真实的，内心就会感觉虚幻了。修定就是起这样的作用，能把心稳定下来，澄清下来，慢慢就能认识真理，看清一切法的真相。</p><p>众生的六识都有错觉，不知道六识所能分别的一切法都是断断续续的，并不是连续不断的。因为六识有觉知暂留的作用，刚刚消失的现象，识心还以为在原处没有动，其实已经没有了，不见了。比如眼识见色，看见色尘时，色尘马上就过去了，但因视觉有暂停作用，还觉得一直在见色，而且见的还是刚才那个色相，其实刚才的那个色相已经灭去，你不能再看见刚才的色相，一个色相一个色相都刹那过去了，都是互不连接的，而意识却认为刚才的色相一直在动，一直存在着，这就是幻觉和错觉。眼识的错觉作用使我们觉得看见的是完整连续的色相；其实都是一个点一个点连接起来的，前后并不是完全的一个，色相是断续变化的，不是同一个色相。</p><p>眼识刹那生灭，意识刹那生灭，色尘刹那生灭，法尘刹那生灭，没有一个法是能够延续到下一个刹那，众生偏偏认为一切法都是连续而真实的，都是原来的那个法。哪里有原来的法，都是变异了的法。世尊在《金刚经》中说过三心不可得，过去的六识心灭了，不可得；现在的六识心在刹那生灭，同样不可得；未来的六识心还没有出生，也是了不可得。而六尘境界也是过去现在未来三际都不可得。我们无量劫以来都被自己的识心蒙骗了，以为看见的都是真实的，不知道都是非常的虚幻不实。所以，一切法都是生灭变异的，都不是真实的我，色法和心法都是无常的法，都是被第八识刹那出生的空幻的法，都是如来藏性。</p><p>五、如何观行和证明五蕴十八界的虚妄</p><p>观行色蕴、受蕴、想蕴、行蕴、识蕴虚妄和空的时候，应该如是观行：色受想行识不是本来而有的法，不是先天而存在的法，因此五蕴不是真正的我，不是原本的我。我们的见闻、思量、识别、有所得心、希求心、反观的心以及能证知这些法的心，都不是本来而有，不是自然而有，不是本来的我，不是真正的我。这些法都是生灭无常的法，不是永久不变异的法，因此都不是我。</p><p>观行五蕴的生灭无常变异性、非我性之后，还要观行意识心的各种境界都是生灭、无常、虚幻，非我，也非我所有。我们当下的所有一切的自我存在感，就是五蕴的假我识蕴，是生灭的、无常的、苦的、空的。世尊在《阿含经》中已经讲得很清楚，我们凡夫所能感知到的一切都是虚妄的，没有真实的。真实的如来藏我们现在还感知不到，如果能感知到的时候，就是证得如来藏的时候，那时候禅宗的公案就能看懂一部分，大乘经典就能看懂一部分，别人说法的对错也能辨别得出来，智慧就会逐渐增长。</p><p>五蕴就如眼冒金星时的金星一样，观行一下金星是有是无，是空还是不空，还是二者兼具。观行五蕴，一个是观行现象，另一个是观行实质，突破这两点，弄清楚现象与实质的关系，把现象与实质融合起来观行，就容易断我见，证初果，也容易明心证悟。空与有二者需要反反复复的观行，弄清楚二者的关系，这不是简单容易的事。所以众多学佛人中，证初果的极少又极少，甚至没有。</p><p>每个人要颠覆自己无始劫以来的错误知见，非常的不容易，需要反复熏习，反复观行思惟，不断与自己习惯性的认知较劲，才可能有一些悟入。通过不断的观行思惟，到最后才能真真正正的认可佛所说的每个真理。五蕴皆空，是佛给我们的最后结论，中间的推理过程和找证据证明，要由每个学佛人自己去完成，别人不能代替。不要说五蕴的虚妄无我，即使是眼冒金星的金星是有还是无，也得自己仔细思惟才能得出一个正确的结论。虽然表面看似简单，但要得出正确的结论，就不是一个简单的事情了。</p><p>对结论仅仅理解了还不行，必须要实际作观行，所有的证据都找出来，证据确凿才行。修行就像证明一道几何题一样，几何题是结论，中间的推理由自己来完成。佛法也是如此，佛给出一个结论，叫作真理，我们修行人必须自己想办法去证明这个结论，认可真理，想办法寻找各种数据和资料来证明这个结论，这样就叫作亲自证得佛法。</p><p>六、如何更有效的观行五蕴十八界的虚妄</p><p>要观行五蕴十八界的虚妄，我们最好把五蕴的每个蕴都要分开来观察，在五蕴当下活动的时候找出哪个是色蕴，哪个是受蕴，哪个是想蕴，哪个是行蕴，哪个是识蕴，五蕴都要一一分开。分开以后，才能非常容易识别出每个蕴的虚妄性，就能知道每个蕴是如何的虚妄了。十八界也是这样，我们在做身口意一切行为造作的当下，把十八界都分开来观察，一界一界的分开，分开以后再观行，这样就容易看清楚每个界的虚妄性。</p><p>众生无始劫以来，之所以把自己生活的世间当作是真实的，一个是因为众生无始劫以来都是在无明当中熏染着，无明太厚重，以至于认假为真，不明世间真实的相貌。另一个是因为世间太立体化，太丰富多彩，因此才感觉世间非常的真实可依赖。立体化的意思就是说眼见色，耳听声，鼻嗅香，整个的五蕴都和合在一起，十八界的功能作用也全部和合在一起，程序既复杂又有系统性，显示出来的一切法是那样的逼真而现实，没有很深的善根和福德，就没有能力反观和认清五蕴的实质到底是什么。</p><p>五蕴活动虽然错综复杂，但却非常有条理有规律，于是众生就觉得五蕴非常的真实，认为五蕴活动的存在都是理所当然的，天然存在，从来都不考虑其当然不当然，有理无理的问题，顺其自然的就接受了这一切，而顺其自然就是无始劫以来的无明。五蕴的活动当中，真法和妄法和合在一起，彼此不分，众生才觉得五蕴是那么的真实，当他认为五蕴真实的时候，就掩盖了背后真实的如来藏。</p><p>我们可以把这个和合在一起的立体化的五蕴世间给它分开，分开以后慢慢扯成平面，拆成零件。就比如把一部汽车或者一座房屋都给它拆开，拆成零件；都拆零碎以后，我们一看就知道：哦！原来是这么虚妄，并不真实嘛！如果这些零件组合到一起，成为一个整体的时候，我们往往就自然而然把五蕴当作是真实的，把五蕴拆开以后，就容易观行其虚妄性。比如一部汽车都给拆成一个一个的零件，就可能认为，并没有什么真实的汽车，一般人都不把这些零件当成汽车。</p><p>我们的五蕴十八界，也把它分开，全部都分开，七个识八个识全都分开。分开以后就能观察到，每一蕴是多么的虚妄，每一界是多么的虚妄，六根触六尘是多么的虚妄，七个识的功能作用是多么的虚妄。把五蕴的整体都拆成一个一个的单独零件，越零碎越好，到最后非常零碎的时候，你就知道：原来五蕴是这么的虚妄，是这样的不实在，这就断我见了，慢慢就能得解脱。知道这些法都虚妄以后，还剩下一个法，我们就会起疑：既然都是虚妄的，怎么还有这些五蕴的功能作用呢？心里就出现了很大的疑情，这样再来证得如来藏，就很容易了。</p><p>七、永嘉禅师的奢摩他颂，是讲如何正确的修行禅定，获得智慧解脱。其中在定中观想时，历历分明，是识阴；领纳在心，是受阴；心缘此理，是想阴；行用此理，是行阴；埋藏真性，是色阴。</p><p>观想思维时，明明了了的状态，就是识阴境界；领纳所观想的内容以及觉受，就是受阴境界；缘于所观想的内容，就是想阴境界；心念念念流动，就是行阴境界。这四阴，不断的生，不断的流转，不断的变异，不断的流逝，无常，空幻不实，其变异不停就有苦受，不希望变异，尤其是不希望快速的转变和流逝，就是苦受。苦受不是我，空的不是我，无常的不是我，变异的不是我。为什么不是我？只可意会不可言传，自己定中体悟，思想不能代替。</p><p>无常生灭变异，比较容易观察体会，认知这样的法不是我，就困难了。因为这涉及到观念的问题，只能自己扭转观念。别人只能把饭做出来，端过来，甚至可以喂到口里，咀嚼吞咽消化是自己的事，实在代替不了。</p><p>八、观行五阴虚妄要把五阴十八界逐个观行看空，先把五阴看空，最后通过定中观行，论据充分，真正确认五阴十八界就是空的，不仅仅是看空而已，必须要证知五阴十八界确实是空的。如何观行出五阴十八界是空的？把五阴的概念及内涵范围功能作用要观行清楚，然后才能知道是如何的虚妄，如何非我。第六识的所有的体性也是空的无我的，离念灵知心、各种禅定当中的意识心、有受的意识、有想能了知的意识心、有行相的意识心、分别了别思惟推理的意识心等等，都要思惟全面，确认其虚妄性。</p><p>原来总觉得意识心是我，思惟观行以后，结果却发现意识心根本不是我，只是个工具而已。我们只要心中有个知，这个知就是意识心。接着再思惟意识心的生灭性、无常性、变易性、不可把捉性、空幻性，这个意识心的知是我的工具，并不是真的我，但可以被我所用。先否定了意识，再观行生灭无常性，最后确认意识的虚妄性。</p><p>五阴在多数情况下是可以同时出现的，其中色阴肯定参与，识阴肯定参与，有识就有行，就有想，就有受；没有六识，就没有行，没有想，没有受。那么在一法的运行中有可能五阴都有，比如眼见色，身根参与，眼根参与，眼识参与，意识参与，意根参与，这里就有色阴、识阴、受阴、想阴、行阴。</p><p>受阴和想阴、行阴活动的前提是六识在运行中，睡眠时受阴和想阴就灭去了，但是一部分行阴还存在着，睡着无梦时，因为第七识意根还存在，调控身根，就有身行，有呼吸、血液循环、胃肠的蠕动、翻身、新陈代谢等等身体的活动，只要有动转，就有行阴。作梦时意识心在梦里活动，那就还有受想行识四阴的存在。</p><p>眼耳鼻舌身意六识都有受、想、行，如眼识的受、想、行，耳识的受、想、行等等都要一一观行其虚妄性，还有六识的了别性也要观行其虚妄性、生灭性、变异性、无自主性、不自在性、空性，最后才能证得五阴色受想行识非我，但是又不异我。受分为领受和感受，感受又有三种：苦受乐受不苦不乐受；想，是执取、取相和了知；行，是运动、运转、运行、运作，不寂止的意思，了别是分别。这些地方，都要一一观行其生灭变异无常性。</p><p>   九、经常思惟色受想行识的功能作用，来无所来，去无所去，幻化不定（其实都是从如来藏当中而来，都是如来藏出生和赋予的）。慢慢就能深刻的认识到，不能自我操控的法，就是不自在的，不可能有真实性；既然没有真实性，那也没有实质的所谓的我性，不自在的法不可能有我性，不可能是我。</p><p>这些观念要慢慢形成，到一定程度就能断我见，并且也能快速的断除我执烦恼，从而身心都能得自在。我们之所以难于断除我见，就是因为过去无量劫以来的不如理的观念深深的置于心中，不能轻易转变过来。观念不转变，我见就不能断除。转变观念，是我们修行的最重要内容，旧的思想观念一旦转变，就能容易颠覆从前的邪见妄想，从而树立正确的知见，获得大智慧，五阴身心就能得到解脱。</p><p>十、断我见证小乘初果时，同时断三缚结，三恶道业消灭，未来永不下三恶道，这是断我见最初所得的自身利益。如何断我见呢？世尊在《杂阿含经》中已经为众生宣说得很清楚，让我们观察五阴的虚妄性、无常性、空性、变易性、苦性、无我性，五阴一个一个的观察思惟其体性，这就叫作观行。观行需要有相当好的定力，要修好三十七道品，观行才能有所成就，十八界也要一一界观行其虚妄性、生灭、无常、变异性，最后确认五阴十八界都不是真实的我，也不属于我所拥有的，内心真的确认这一点，就断了我见。</p><p>从此以后，内心深处不再认五阴为真实的自己，这样就把捆绑自己生死流转的三缚结我见、戒禁取见、疑见也断了，从此不再下三恶道。要修到这个目标，需要把世尊在阿含经中讲的四圣谛法义修学通透，定力好了再一一观行，这是断我见的大概路子。其中八正道必须要做到，所有的身口意行为都要符合八正道，才能修行成就，成为一个众生瞩目的贤人。</p><p>十一、有识心，就有五阴的受想行识，观行五阴虚妄非我性，把色身的虚妄性和识心的虚妄性都观行出来，非常肯定认可了，就能断我见证果。福德等因缘具足，在任何一个法上都可以观行思惟，可以断除我见，也可以观行证得第八识，就看福德、定力、智慧和因缘时节了。断我见证果分不同的层次，明心开悟也分很多层次，有住位的悟，有回向位的悟，有初地菩萨的悟，有几地菩萨的悟，有佛地的悟。每个人悟的层次和深度都不一样，其所得智慧差别就会很大。</p></div>"
},{
    "title": "第四章　五蕴观行的第二部分",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　五蕴观行的第二部分</strong></p><p> <strong>第一节  五阴非我之理</strong></p><p>一、成唯识论述记中讲的五阴非我之理</p><p>［原文］论：<strong>内识所变至实我法性。述曰：此显依他我法名假，先显其体实非我法，内识所变似我似法，虽体依他缘起是有，而非是彼妄情所执实我法性。此缘起法，无主宰故，无作用故。</strong></p><p>释：内识，是了别内六尘的七识，内六尘由七识参与变现，三个能变识（第八识、第七识和前六识）共同变现了内六尘和五阴。六识和五阴是依他起性，依种种缘而由第八识所生。变似假我五阴六识，变似宇宙器世间，其实这些法都不是真实有，不是真实存在的我。五阴非我非实，六识非我非实，六尘非我非实，一切法都非我非实，由内识所显现出来的假我假法，现象上好像是有，实质却是无，幻化的即为空。</p><p>五阴六尘六识只是一个假名词，是依各种缘而生成的。缘起法表相上看是有，其实只是众生的情识虚妄的计度为我为实，好像有个我，有种种法；实际是没有，幻化非真，犹如梦中物。这些缘起法是因缘所生，并没有自主性，没有主宰性，也没有真实的作用。</p><p>我，是主宰义，既然五阴没有自主性，没有主宰性，五阴就不是我，只是一个名词概念，假有非真。五阴没有真实的作用，表面的功能作用没有主宰性，都不是五阴所为，其背后另有一主宰者是真正的主人，是真正的我。那个我才有真正的作用，有真实的作用，有自主性，能主宰一切法的生住异灭。</p><p>没有真正的五阴，没有真正的五阴作用，也没有五阴的真正作用。众生觉得五阴有作用是妄知妄觉，心错乱的缘故，心迷惑的缘故。其实也没有迷惑颠倒的心，都如空中花，梦中境。入地以后，不再感觉五阴有真实作用，不再认为一切法都有真实的作用，全部都是假相，没有真实作用，只有第八识有真实的作用。就像一个木偶人并没有真实的作用，认为木偶人有真实作用的，都是被假相所迷惑的颠倒众生，不识真假，错认主人公。</p><p>二、所谓五阴者，即非五阴，是名五阴。这是公式，可以套用，比如：所谓某某，即非某某，是名某某。某某这个名字只是一个代号，并不是本人。但这个名字可以引出本人，名字也不离本人。没有本人，就没有名字，但是本人可以没有名字。本人依名字显现，呼唤某某这个名字，本人就出来。</p><p>同理，所谓的万法，即非万法，是名万法。万法比如是某某这个名字，名字背后有人，万法背后是如来藏。依人有名字，依如来藏有万法。人可以没有名字，如来藏也可以没有万法。一切法都是个名字，相是有，只是没有实质，如来藏没有相却是实有，祂有实体，有真实的功能作用。</p><p>三、怎样理解六根是虚妄无我的</p><p>六根都是生灭性的，其中五根是第八识依业种和父母缘以及意根的执取而产生出来的，缘散即灭去，不是自在的，没有自主性。意根是第八识输送识种子所生，也是刹那生灭连续起来形成的识的假相，入无余涅槃时，也能灭掉，因此也是虚妄不自在的，幻化而非我。观行时，要慢慢地思惟，非常深细地思惟，内心里才能有所触动，才能真正地认可六根以及五阴不是真实的，不是真正的我。要修出禅定，在定力的配合下思惟观行，一个法思惟完成之后再思惟另一个法。把所思惟的内容深深地悬在脑海里，要深，要慢，要细，心思不要浮躁，深悬着所思惟的法，内心几乎是不动的，其实是动得很慢很深细。这样的观行，才是正确的观行方法。<span> </span></p><p><strong>第二节  四念处观</strong></p><p>一、四念处观即是四念住：观身不净，观受是苦，观心无常，观法无我。众生颠倒，以身为净，无量劫来贪求自身，贪求他身，不知色身，污秽不净，血腥充满，细菌泛滥，大小便利盈满其中，九孔常流，污物不净，实为一个活动厕所。观此身相，实为不净，以此对治，净颠倒想。与此相对，法身清净，无身无相，无念无为，无有造作，纯一清白，梵行清净。</p><p>众生颠倒，以受为乐，无量劫来贪求于受，反造苦因，果皆是苦。小有暂乐以为究竟，追求无厌。不知乐时就是苦受，乐本是苦，乐后更苦。苦分苦苦、行苦坏苦。众生受苦时本身就是苦苦，内心感受，念念迁流，变化不止，即为行苦；乐受之后乐即灭失，不能久长，即为坏苦。一切感受，无论是苦乐不苦不乐受，有受皆苦。与此相对，法身无受，不受一切，没有苦受，没有乐受，没有不苦不乐受，究竟无苦，即为纯乐，至乐大乐。心不贪求一切境界，苦受即除，舍受自在。</p><p>众生颠倒，以心为常，认取灵知为究竟我，执取不舍。不知此心念念生灭，刹那不住，无常变异，究竟无我。与此相对，法身是常，永不坏灭，不生不住，不异不灭，本为诸佛常住之体。</p><p>众生颠倒，认法为我，不知此法因缘而生，因缘散去，法即坏灭，坏灭之法如何是我。无明之心，执法为我，缺少一缘，法在哪里。无有父母，五阴何来，身口意行，造就五阴，若无真如，何有诸行，缘生缘灭，即非是我。与此相对，法身为我，种子究竟，清净无为，再不变异，二十一个心所有法，真如所具，有此心法即为是我。众生无我，佛即有我，真常不变，非我而谁。以此观慧，无明尽除，断苦离染，究竟涅槃，常作此观，早日成佛。</p><p>二、四念处观的具体观行方法是，观心无常，要观眼识心的无常、耳识心的无常、鼻识心的无常、舌识心的无常、身识心的无常、意识心的无常。观法无我，观五阴之法无我，观十八界之法无我，观蕴处界所产生的一切法当中都没有一个我，没有一个恒常不变的我存在。</p><p>首先观色阴，色阴有生有灭，从无到有，从有到无。楞严经中波斯匿王说，观自己的色身三十年一变，十年一变，一年一变，日日变，念念变。众生每时每刻细胞都在新陈代谢，头发生，指甲长，皮肤、肌肉、内脏血液等都在发生变化，今天的身体与昨天的身体不一样，与十年前的身体更不一样，与儿时的身体相比很难找到相同之处。色阴这样无常生灭变化，从里到外都是肮脏污秽的，这样生灭不净的色身怎么能是我？怎么能有我性？我是不生灭不变化，恒常如一的，没有苦性的，是真实的，我是清净的；色阴与此相反，因此色阴不是我。</p><p>其次，观察受阴。受是识心的感受觉知，以意识心为主，这个心是无常生灭变化的，是苦的，非我的。不管是乐受、苦受和不苦不乐受，都是苦的、无常的，与我性相反，因此受阴不是我。第三，观察想阴，想阴是识心的了别性、执取性，语言妄想的思惟分别性，以意识心为主，是生灭无常变易的，是苦的，与我性相反，也非我。</p><p>第四，观察行阴。行是造作、运转、迁流变化。六识的分别活动属于行阴，色身的造作是行阴，语言的造作是行阴，妄想分别是行阴，细胞新陈代谢是行阴，血液流动是行阴，呼吸心跳胃肠蠕动是行阴，这些都是生灭变化无常的，是苦性的，与我性相反，因此不是我。</p><p>第五，观察识阴。识阴是六个识心，是生灭无常的，是苦的，是变异的，没有我性，不是我。观察十八界的六根六尘六识，都是无常生灭变异的，是苦的，没有我性，也不是我。这样五蕴、十二处、十八界运作所产生的一切法，都没有一个真实永恒不变的我性，全部是虚妄无常生灭变易的，是不可久住之法，都不是我。</p><p>三、佛在大念住经里，讲观受是苦的时候，讲到内受和外受两种受。外受是指容易观察出来的意识心的受，特别是在六尘境界上的意识的受；内受是指隐藏比较深的不容易观察到的意根的受。虽然极大多数人分不清意识和意根，但是内心深处的思想活动还是能够感知观察到的，只要心很细致。</p><p>佛讲观心的时候，观察心要观察内心和外心的贪嗔痴烦恼，观察内心和外心的集中散乱、广大狭小、有上和无上、有定和无定、解脱和不解脱，这说明内心意根有贪嗔痴烦恼，有定和不定，有解脱和不解脱。这是从小乘经典上证明了意根有这些心所法，虽然世尊没有明说。因为意根的法，大乘弟子都无法理解和证得，何况小乘弟子能深入正确理解意根的法，所以世尊不得不隐秘讲意根的心所法。</p><p>疑惑烦恼，有内疑惑和外疑惑，断疑就要究竟断，一定是断意根的疑惑。所以三缚结完全是指意根的结，断除意根的疑惑才是断三缚结。断贪欲，断意根的贪欲，心才能与色界天人相应，才能生到色界天。断嗔恚，一定是断除意根的嗔恚，才是三果人。断愚痴，一定是断意根的愚痴无明，才能出离三界。</p><p>小乘法是最容易理解的，可是又有什么人能真正看懂小乘法佛经，更何况大乘经典，又有什么人能真正完全看得懂？证阿罗汉果，也不能完全信汝意，智慧不足，意不究竟，完全信之就容易出差错。</p><p>佛法不是支离破碎的，一定是前前后后连贯连续的，都能互相佐助和说明。</p><p>四、佛在大念住经里讲五盖的时候，说有内贪欲和外贪欲，内嗔恚和外嗔恚，内睡眠和外睡眠，内掉悔和外掉悔，内疑惑和外疑惑。内和外都分别指什么？</p><p>心如果分内外，外心就是指众生普遍能够发现和观察出来的心意识，内心是指众生不容易发现和观察出来的心意根。两个识心一显一隐，一明一暗，一深一浅，一容易改变，一坚固难改。修行就是先落实到浅层次的意识，再落实到深层次的意根，先初步转变意识，最后究竟转变意根。所以所有的烦恼无明，最初和明显的是意识层面的，最后和隐秘深邃的是意根层面的。</p><p>从这部经当中，我们可以看出，佛在讲小乘法时，虽然没有明说意根的法，但还是隐藏着讲到了意根，隐藏着而说一切烦恼和无明都是意根的，断烦恼是断意根的烦恼，解脱是意根的解脱，一切法都落实到意根上，解决意根问题，就能解决一切问题，最终究竟达到涅槃和解脱 。</p><p>五、在大念住经中，世尊讲五取蕴时，也讲到色受想行识的内法和外法。内色是色身，外色是六尘，内受想行识是意根，外受想行识是意识。</p><p>世尊讲七觉分时，也把七觉分分为内七觉分和外七觉分。择法觉分、精进觉分、喜觉分、倚（轻安）觉分、定觉分、舍觉分，都分为意识的外觉分和意根的内觉分。没有修成内七觉分的时候，不可能证得小乘果，不可能断我见，更不要说明心见性了。三十七道品不修成就，大小乘果一个也不要谈，身心轻安不成就，定不成就，内心舍受不存在，无法断除我见，无法明心见性。这是佛法修证的硬指标，无论谁都越不过去。如果硬要说某某证果和明心了，那都是朔料果，欣赏欣赏就可以了，没有什么实有价值。</p><p>从世尊对七觉分的描述来看，意根有择法觉分，有精进觉分（真精进），有喜觉分（意根不仅仅是舍受），有轻安觉分，有定觉分（与定相应），有舍觉分。之后心行符合八正道，才能具足小乘证果的条件，才能断我见，证初果，否则都是假果朔料果。条件不具足，因缘不具足，强行引导时，只能得个假果，天天看，却没有实用价值。<span> </span></p><p><strong>第三节  怎样才能真正断我见</strong></p><p>一、小乘断我见需要修行四圣谛法</p><p>四圣谛就是苦、集、灭、道。了知世间一切法都是苦，才能生起出离心，有出离心是修行的前提和基础，没有出离心，修行就会懈怠不能精进，断贪爱就更困难，道业很难增进。时常反观自己，是否识苦知苦，是否有出离心，这条没有做到，后面的修行就精进不起来。</p><p>如果要断我见，证得人无我，我们就要知道：什么是人，人的概念是什么？什么是我，我的概念是什么？无我，又是指什么？什么是空，空的概念是什么，空都有多少种类？什么是无常，什么是生灭，无常为什么不是真实的？对这些法，我们心中要有明确的认识。常常思惟这些法，心中要牢牢地树立起一个认知：无常法是不断生灭和变化的，是不能把握的，都是空的，都是不真实的，不是应该依靠的我。</p><p>我们不能再把这些法当作真实的，当作是我，当作是我所拥有的，不要再去抓取和执取，执取这些法就会永远沦落生死。把这些观念牢牢树立起来，颠倒自己从前错误的认知，慢慢就能断除我见，断除三缚结，从而获得解脱和自在。做到这些很不容易，有时虽然表面或口中都承认五阴是空幻，但是内心深处的意根并不承认，要想让意根承认和认可，就需要常常思惟这些道理，不要以为自己已经知道就不屑深细思考，那样意根的知见不容易颠倒过来，修行就不能有进展，这很关键。</p><p>苦的就不是真实的，苦的就不是我，这个观念要树立起来；无常的空的，就不是真实的，不是我，这个观念也要树立起来。树立起这样的思想观念是很不容易的，一旦树立起来，以后修任何法都很容易，知见很快就能修正过来，无论断我见或明心以及今后的任何观行，都能不太困难了。阻碍我们修行的就是烦恼、烦恼习性和错误的不正确的观念和理念；观念修正过来，烦恼也就容易降伏，智慧就容易生起来。修正知见最关键，知见正确，就能断了我见，断了邪见，以后的修行，一道道的关口都能突破下来。</p><p>二、只有深细思惟观行才能真正的断除我见</p><p>观行五蕴虚妄时，意识一般情况下都能粗略认为五蕴是假的，不是我，但是没有经过深细的思惟观行，不能究竟彻底了知其中缘由，也没有找出有说服力的证据，证明五蕴确实是虚妄无我的。因此第七识没办法理解其中的真实义，当然不能认可五蕴非我之理，因此内心仍然一如既往，不能有所触动，心行也没有改变，所以不是真正断我见。应该继续更深细的观行和思惟，把其中的道理都要思惟清楚，无我的证据要充分，这样才能颠覆意根原来的知见，内心深处才能深深肯定五蕴无我，才能断除我见。如果意识不经过深细思惟观行，或者观行不深入细致，证据就不足，就不能让意根真正明理，身心就不能受到触动，心行也就不能颠覆过来，意根仍然习惯性的认五蕴色身为我。</p><p>观行当中，意识如果感觉到身体就是自己所利用的工具，不是真正的我，下一步就要再反观，意识心本身也是意根所用的工具，而意根就在时时执著自己的工具五阴身；再观行七识心也是个工具，都不是真正的自己，不再把意识或者七识心当作自己，这样色身与识心是我的知见就可以破除，意根深深肯定这点，知见就彻底颠倒过来，我见就断尽了。</p><p>五蕴当中意识为我的知见很难断除，认为意识的各种作用是真实的知见根深蒂固，是最难断的。应该深入观行，细心思惟意识的各种功能、作用和体性等等都不是自己；观行各种觉知性都是虚妄法，不是我；所有的感受、思想念头、所有的行相、所有的分别了知作用都要观行出虚妄、无常、生灭、变异性，都不是我，仔细深细的观行，就有能力断我见。</p><p>三、无我、无人、无众生、无寿者。五阴十八界这个假我，是第八识依各种缘变生的，是虚妄、变异、无常、空、苦性的，因而是无我的。这需要做深刻细致的观行才能得出这样的结论，内心才能确认五阴真的不是我。既然我是虚妄的，同理可证，他人也是虚妄的，所有的众生都是虚妄非我的；那么依赖众生五阴而有的寿者相，当然就是不真实的，也是虚妄的。修出定力，好好观行这些理，是很重要的。这其中要修很多法，八正道以及三十七道品都要修好，才能证得这些法都是空的，口说空没有用，那仅仅是口头禅而已。</p><p>四、观行断我见，有时候，对有的人来说，没有必要非要面面俱到所有方面都要观行到，只要突破一个点，打开一个闸门，就能把五阴十八界全部通透，就证得无我了。突破一点，就能带动其余。这一点，是哪一点，这要因人而异，每个人的薄弱环节不同，侧重面就不同，突破口也不同，要看自己的因缘如何而定。</p><p>五、众生要想解脱，必须按照佛理修证，断我见，证五蕴十八界空，无人我无四相。进而舍离五盖，发起初禅，断烦恼去我执，命终才能出三界，得解脱。不知什么是我，我是什么，死执七识和五蕴，空喊破执和放下，只是徒劳而已。</p><p>小乘的解脱和放下，必须观行五蕴十八界的虚妄，一个藴一个藴去观，一个界一个界去观，证罗汉初果，断三缚结，渐证四果得以出离，别无他途。外道不知此理，积年修行，修得最高禅定，生到最高层天，死执定中境界为涅槃，不知定境乃法尘。有知即是想，即是我，仍在五蕴中，不出生死。何时解脱，遥遥无期。<span> </span></p><p><strong>第四节  五阴的集、味、患、离、灭</strong></p><p>一、色是由地水火风四大种子形成的有相物质，摄持在众生的十八界当中，属世间法，包括众生色身和宇宙器世间。这些色都是生灭的、变化的、无常的、虚妄的、空的、不久住的，这是世间生住异灭的运行规律，本身并没有好恶和过患。如果我们执取这些色为我或者为我所有，认为色是有滋味的，长久不变的，于是对色生起了执著和贪爱，这样一切过患就出现了。因为贪爱色，执取色，心就被锁在三界中，不出生死轮回，未来永远苦恼不断。</p><p>五阴都有集、味、患、离、灭。色阴的集，就是出生色阴的业缘及造业种子的累积。色阴的出生是有缘有因的，什么缘因能产生色阴呢？贪爱集就是色集，因为有贪爱的行为造作，就有未来世的色阴出生。色灭，众生通过修行是可以灭掉对色的贪爱，灭掉贪爱以后就没有生死过患了。</p><p>二、色味，我们认为色阴是有滋味，有乐趣，是非常可爱的，于是就贪着色阴，有贪爱就有未来世的出生，那么生死烦恼就不能断除。色患，色阴是有过患的，因为色阴是无常的，是苦的，是空的，是变易的，因此就有无穷的生死过患，有色阴就会生出苦恼。色离，众生通过修行可以离开对色的贪爱，离开贪爱就能解脱生死，得大自在。如果能离开贪爱，现起初禅定，就能断除烦恼，心得解脱。</p><p>三、受阴的集，触集就是受集，六根总要触六尘，触之后就要出生六识，就有六识的受阴，有受阴就会不断地产生苦受、乐受以及不苦不乐的受，因此生死苦受不断，苦恼不断。受味，产生觉受以后，众生就认为觉受很有滋味，心生喜乐，就生起贪爱心，爱乐于受，喜乐于受，这样就被束缚，不免有未来世五阴的出生。受患，六识这些觉受都是有过患的，都是无常的、生灭的，都是苦的、变易、不可久住的烦恼法，因此需要全部断除。</p><p>四、受离，众生通过修行可以离开对觉受的贪爱，不再认为受是有滋味，是可爱乐的。</p><p>五、受灭，修行八正道以后，就真正地灭掉了对受的贪爱和喜乐心，心得寂止和清凉，得到解脱的真实受用。触离受就离，触灭受就灭，六根尽量少触六尘，受就减少了，如果没有受就没有受的过患。</p><p>触集就是想集，触灭想就灭，六根触六尘生想，六根不触六尘，想就不出生；触集就是行集，触灭，行就灭，六根触六尘，就有身口意行，六根不触六尘，身口意行就灭。名色集就是识集，名色灭，识就灭，名色五阴出生，六识就出生，名色五阴灭，六识就灭。<span> </span></p><p><strong>第五节  小乘的修行次第和过程</strong></p><p>一、证果的前提条件</p><p>圣弟子要如实观察五阴，观察五阴的无常性、苦性、变易性、非我性，就能证得五阴无我、不是我、不异我、不相在的真理。证得五阴的空性，证得初果的前提条件，必须修完三十七个助道之法，只有圆满修道的条件，观行才能成功。那些助道的法没有修或者没有修完，是不能观行出五阴的无我，也就不能证果。所以要先修四念处、四正勤、四如意足、五根、五力、七觉分、八正道等三十七道品。</p><p>三十七道品的修行次第大略如下：由最初的五根信根开始起修，五根增长具足五力，之后进入八正道中，发起思惟修，修习七觉支，在念觉支中修习四念处观，得善法味，起四正勤，最后结果经过勤苦修习得四神足之果乐，心得自在解脱。</p><p>三十七道品中每一品，不仅意识要修习和获得，同时也熏习意根，意根也要修习三十七道品，并且要完满具足，获得每一道品，成就四神足。</p><p>意识的念力熏修意根，使得意根念力具足，信成就。每一法最初由意识熏修引导，由意根具足，就是实证，修行则成就。</p><p>证得身心不是实有的时候，才能得解脱，认为身心不是实有，不能得解脱。认为与证得之间距离，可远可近，完全在当人的修持程度。没有修持，其差距可能要很多劫。</p><p>二、四圣谛、四正勤、四神足、五根、五力、七觉分、八正道这些内容，都是见道前后的修行过程，大小乘大同小异，修行过程相似相像。如果没有这些过程的熏习，而突然出现一个果，成为圣人，这个果极其不可靠，果和结论都可以抄袭，所有的知见都可以背诵，只要多读几本书就可以背诵出来，也可以想象出来。</p><p>而这些过程任何人抄袭不了，每个见道证果的人必须要经历的过程，每个人的过程因其前世根基不同，可能有一些差别。前世已经证果的人，今世这些过程也许很快就走过经历过了，其他人则不行，都要一一实践实证，各个关口都要通过去。大乘果位也如此。这些过程都经历了，其身心才能转变，证果时就有极大的解脱功德受用。</p><p>没有经历这些过程的人，其所得果，犹如空中花，只可欣赏，没有实用价值，没有解脱功德受用，朔料果就是如此，只能摆着观赏，不能饱腹。</p><p>三、所谓的实修，就是大小乘的三十七道品的修行内容，离开这些具体又具体的修行内容，就不是实修，只有结论没有过程的修行都不是实修，只学理论也不是实修。理论可以学到几地菩萨的理论，即使明白那些理，与实际证得还差一个无量劫两个无量劫的时间，一二个无量劫以后的理论现在就学习，还以为自己掌握了，就断定自己是圣人了。前边的路都不需要走，实际的修行过程都不需要经历和实践，那这样的修行就是梦幻泡影，只得空花，结个空果。</p><p>四、四圣谛法，苦集灭道也分为内法和外法，修道谛中的八正道，也分为内法和外法。八正道修完，小乘三十七道品修完，断我见的条件才能满足，之后才能证果。如果心行不符合八正道，那么心行就不足以为圣贤，不能证果。八正道中有正定，分为意识的外定法和意根的内定法。所以意根一定与定相应，定完意根，才能有正智慧生起，才能断我见，证初果。否则全部是假果朔料果，只能看，不能用。</p><p>五、有非常实际的修行方法才是实修</p><p>佛讲法，既有理论部分，更有实修部分，肯定会让弟子修学有个入手处。因为佛陀自己就是过来人，站在最高峰，完全有能力接引山脚下四面八方的众生慢慢攀上山腰和山顶。 修习佛所讲的法，总比崇拜只有华丽高端的理论而没有切实可行的入手方法要好很多很多。凡是不能提供切实可行方法的人，说明自己都没有修习成功过，自己都没有走通那条路，随学的人怎么能够走得通？  </p><p>没有实际修行的人讲法，往往是指引众生摘天上的星星，却没办法给众生架个云梯，后边的众生只好可怜巴巴的翘脚仰望星空，即使再努力，离星星的距离仍然是原来那么远，没办法够得着。有的人竟然以为自己摘到星星了，其实那只是水里的影子而已，并没有得到真实的果子。如果有人只讲理论，没有下手方法，应该警惕了，不要白白的空耗自己的宝贵时间。</p><p>真真实实的下手修行，只要从一个法门证得三昧，其它任何一种三昧都能很容易切入。因为三昧是相通的，方法是相通的，用一个方法入进去，其它方法也就掌握了。怕只怕大家不能下决心找到一个方法实际去用功，不肯吃苦，不肯花费精力。如果各个方法都去试，却如蜻蜓点水，浅尝即止，那就没有办法修成任何一个法门。</p><p>六、小乘证果的关键是七觉分的修持，七觉分已经大略讲过了，具体修行还要依靠个人努力，尽量完善各种因缘条件，证果才能有一定的把握。修行的过程也是四加行的过程，暖、顶、忍、世第一法四个过程，是在文字理论的基础上，内心的加工过程。在加工过程中，内心一定会逐渐生起相应的变化，这是观行法义逐渐与内心意根相应，意根逐渐领纳领受的过程，当然首先是意识先领纳领受，生起胜解，然后传递给意根，让意根领纳领受。意根领纳领受之后，身心就会逐渐转变，七觉分逐个出现，定觉分出现之后，才有大智慧舍去五阴身心法相，进而证法，成为世间第一初果人。身心没有变化，没有转变，七觉分没有成就，不可能断我见，不可能证果。</p><p>暖相，透过文字理论，自己亲自思惟观行，内心里出现暖相，就好像擦出火花一样，心里有些认同了正确的理论，有了初步的认知，有了兴趣，还想深入探讨其中的内涵。</p><p>顶，对于理论的认知达到一定的程度，有一定的高度，了解和理解了五阴身心的空，达到对五阴认知的顶点。这时完全是意识的认知和胜解，还没有达到意根，因此内心还有躁动，还不能安住在五阴空的认知上，处于可进可退阶段。</p><p>在这个阶段，有的人内心就会有激烈的反抗，思想躁动不安，情绪有起落变化。有的人要苦恼万分，也许会莫名其妙的烦躁和情绪低落。过了这个阶段，情绪就会恢复正常，进入下一个阶段，不但意识安忍于空，意根也安忍下来。就会继续深究探讨，究竟为什么五阴是空的，不实的。</p><p>第三个阶段是忍。忍，也就是安住，安住在空义上，忍可五阴的无常性，但还不是真正的证得。因为证据还不充分，内心的考量还不足，无法真正确认其理，只是内心不躁动，比较安分了。也在努力寻找证据，努力现量观察五阴身心的实质。这时身心的觉受越来越轻安，越来越欢喜，禅定越来越好，智慧越来越深细，越来越灵敏，空的念头越来越坚固，但还不能住于舍，内心里没有舍觉分。</p><p>等到舍觉分成就时，舍去了内心当中的我的思想观念，内心空空，五阴空无常的观念已经牢固确立，证据已经充分，内心完全认同确认五阴空无我，第四个阶段世第一法成就，断除了我见，证得初果。</p><p>在观行过程中，身心要不断的起变化，为什么要起变化呢？因为透过意识的胜解，意根逐步有了一定的了知，与从前的观念相左，逐渐颠覆从前的认知，意根发现了新大陆，就会促使身心出现相应的变化和反应。所以断我见，证得五阴无我，一定是意根证得的。</p><p>七、众生因为有我见才有我执，因为心中有我才会执我，因此学佛修行的首要，就是先断我见，后断我执；我见不断，不可能断除我执，这是修行次第，不能颠倒。众生因为错认五阴为真实的自己或属于自己所有，所以才对五阴假我执著不舍。如果知道五阴确实非我，才能慢慢断掉我执；意根我执一断，就有能力灭掉五阴，不再想继续保有五阴，不想在三界世间受苦不断，于是命终时就能灭掉五阴，入无余涅槃，从此解脱生死轮回之苦。</p><p>世尊在《阿含经》中教导众生，五阴十八界和三界世间万法都是虚妄的，众生证得此理以后就不再被五阴和各种境界束缚，修定时禅定很快就能出现，而且不容易着魔出偏差。世尊在大乘经典中又讲过万法唯心造，心外无法，众生明得此理以后再修定，就不再执著各种境界为真，修定时更不会走入魔道。</p><p>外道的修行，因为不懂境界的虚妄，执著攀缘境界，追求各种有为法，喜欢各种觉受，贪求境界，心就被拘禁在境界中，不得解脱，不能出离生死轮回。心外求法就是外道，外道永远不能出离生死轮回。佛法当中说，心外无物，境界虚妄，学佛人修行就要修心，不求物，也不求五阴长生不老这样的虚妄法，不贪求三界世间的各种有为法，这样才能成就无上菩提。 </p><p>八、修行断我见，证到初禅定以后，先断贪欲，后断嗔恚。嗔恚心比较难于断除，断完贪欲心以后，需要多长时间来断嗔恚，这是因人而异的，要看当人的嗔恚心是否很坚固。有的人贪欲心比较淡泊而嗔恚心却很重，心里总有人事的纠结不断，这样断嗔心就难。嗔心不断尽，就不能证得声闻三果。嗔心重的人得初禅也很难，因为内心的纠结，就障碍了禅定的生起，想在一生当中证得声闻三果，入初地，那个希望是很渺茫的。</p><p>但是还没有断我见的人，即使有了初禅以上的禅定，因为还没有断我见，仍然是凡夫一个。色界天人都没有欲界的贪欲现行，但是内心里还有嗔和愚痴的现行。欲界主要是贪欲，以贪欲为主；色界降伏了贪欲，但是还有嗔和愚痴，无色界以愚痴为主。无色界天人认为依靠禅定就能够得到解脱，自己所住的定境就是涅槃境界，他们不具备解脱的知见，因此所修得的定就是邪定。不与智慧相应的定，不能得解脱的定就是邪定，所以无色界天人不断愚痴，不能出离三界的生死轮回，不得解脱。<span> </span></p><p><strong>第六节  断我见就是知见和观念的转变</strong></p><p>观行五蕴无我的时候，证得色身空无我，是心上的知见和观念改变了，不再认为色身是我和我所。但是觉受仍然存在，只有在甚深禅定中灭去识心，才能灭除觉受，没有禅定的支撑，觉受仍然存在。但是心越空，觉受越轻，心越不在意，越不执著。</p><p>断除我见和明心见性，只是把原来的知见扭转了，能扭转知见是一件很了不得的事情，由此知见的扭转，后续的无明和烦恼都会陆陆续续的断除，生死问题就能解决，就能得到小解脱和大解脱。</p><p>但是五蕴的一切活动还要有，仍然要存在，只是不执著，觉受轻微，并且能正确把握和认识觉受，不会轻易为了觉受而造恶业。</p><p>所谓的轮回，主要指心沉浸于生死轮回之中而受苦，心不解脱，就是轮回。心解脱，虽然在六道里与众生混在一起，并没有众生那些生死苦受，不受六道轮回的苦报，因此菩萨有能力出离三界而不出，在六道里度脱众生，不属于六道生死轮回。<span> </span></p><p><strong>第七节  无我的觉受</strong></p><p>一、只要静心思惟，就能看淡色身，与色身疏远，进而不认色身为我，内心就能发生改变。那时就想：何苦呢，整日为身体而忙，究竟图个什么？在世间争来争去，究竟能得到什么？成天我我我的，究竟为了什么？什么是我？生生世世为了色身，而色身就像是一块木头，一具臭皮囊；为了觉知心，而觉知心却是那样的幻化不实。</p><p>修行真得要静下心来反观思惟，回光返照自己，反反复复问自己：一辈子究竟要的是什么，想要得到什么，又能得到什么，活到到最后不过就是个空和空，除了空，还有什么？如果不静心思惟，心行就不能改变，照样说是说，做是做，心行不变，自己丝毫不得利益，仅仅是在别人面前弄弄嘴皮子而已。成天我慢不断，我比谁都好，比谁都能，谁也不如我，除了我就没谁了，这就是生死轮回的根源。</p><p>当真正感知到没有自己时，心里有一种空落感。以前所依赖依靠的东西如今突然没有了，再也不是自己所能依赖的，这时候可能一下子还适应不了，过一阵习惯了就好。心里没有了我，你会觉得很轻松，心里能得到休歇，担子放下了，如释重负，以后禅定就能慢慢增强。</p><p>有我的时候，心里是多么的沉重，为这个我奔波、造业，无休无止，不知道什么时候能结束。有我时，对什么都在意，争名夺利，卖弄自己，希望所有人都关注自己，希望所有人都看重自己，希望所有人都羡慕自己，希望所有人崇拜自己，希望所有人都把自己当作神来看待，那个心里该有多么沉重啊！</p><p>二、观行和证得觉受无我是非常重要的</p><p>众生都把觉受当作真实的，当作我，当作我所有的，然后追求觉受，满足和顺从觉受，为了自己的觉受不惜造作各种业行，尤其是造作恶业行。</p><p>我们要解除生死苦，就要观行觉受的虚幻性、不实性、幻化性、空性、非我性，这样就能证得觉受确实是空幻的、不真实的，就不会再注重觉受，也不追求觉受了，一来断除了我见，二来心能逐渐清净，贪嗔痴烦恼逐渐淡化；不追求觉受，就不会造作贪嗔痴烦恼这些无明恶业了。</p><p>觉受如何是空的、幻化的？觉受从哪里来的？觉受主要是六识的觉受。其实后面意根的觉受也是非常重要的，意根如果没有觉受，就不会促使六识去造作贪染业，也不可能要求得解脱，精进修学佛法。六识的觉受一方面来自意根，受意根的影响和指挥；另一方面，六识自身在了别六尘境界时，受境界的影响，对境界起贪厌，受心所法出现时，就产生苦乐受。</p><p>六识的觉受是如何出现的？如来藏把识种子输出来，形成了六个识，六个识生成以后就开始运行，五遍行心所法以及五别境心所法就出现，于是就分别六尘、执取六尘，对境界产生了觉受。之后认此觉受为真实、为我，顺己者贪，逆己者嗔，就要造作贪嗔痴这些无明业，之后生死轮回果报不断。那么我们把觉受观空，贪嗔心就能降伏，这件事是非常重要的，证得五阴无我、觉受也非我，这是最重要的。<span> </span></p><p><strong>第八节  如何修諸根</strong></p><p>一、《杂阿含经》卷十一：有个外道弟子郁多罗来见世尊说，我师波罗奢那说修诸根，眼不见色，耳不听声，是名修根。世尊言：若如此，盲者是修根不？阿难问郁多罗：聋者是修根不？于是世尊以此为缘，为弟子讲述了异于外道的无上修根方法。</p><p>世尊说：缘眼色生眼识，见可意色，修厌离，不可意色，修不厌离；可意不可意，可不可意，修厌不厌俱离舍心，住正念正智。心善调伏，善关闭，善守护，善摄持，善修习，是则于眼色无上修根，耳鼻舌身意诸根也如是修习。</p><p>这段是世尊教导弟子修心去除烦恼的方法。首先当我们看见喜欢的色相时，心里不要生起喜乐心而是要生厌离；见不喜欢的色时，心里不要生厌恶，这是初步的调心。进一步调心，是当我们看见一切色相，不管喜欢还是不喜欢，心里应该既不喜乐也不厌恶，住于放舍的心境状态，内心不要理会这些色相，这是比较恰当的心态，有智慧的作法。</p><p>对色相要善于调伏心、守护心、把持心、关闭心，不要让心向外攀缘流溢。耳听声时，鼻嗅香时，舌尝味时，身觉触时，意根触法尘时，都要善于调伏心、守护心、把持心、关闭心，不要让心向外攀缘流溢。这样长久下去，心就能得寂静，定力渐渐深入，参究思惟佛法就深入细致，很快就能证得道果。</p><p>修行不是眼不见色，耳不听声，鼻不嗅香，六根不触六尘，而是在六根触六尘之时调伏我们的心，在触缘遇境时善于摄持我们的心。没有境缘时就没法调伏心，就像一匹野马必须在荒郊野外驾驭牠、训练牠，才能制服牠。修行人不能躲开境界来修行，一定要在境界中练心修心，接受境界的考验，将来遇见任何境界时才能过关，心得寂止，不着境界。</p><p>二、众生对六尘的贪求是如何生起来的呢？世尊在《杂阿含经》中说：缘眼界生眼触，缘眼触生眼想，缘眼想生眼欲，缘眼欲生眼觉，缘眼觉生眼热，缘眼热生眼求。意思是说，众生依眼根触色尘就出生眼识，眼识出生以后就能了别色尘，了别以后还想再了别，因喜欢和贪爱就生起了贪心，于是心热燥动，就想拥有和抓取色尘，贪欲完完全全表现出来了。没有修行的人，让自己的心念、贪欲一直发展下去，绝不加以制止和呵责自己的心，直到最后造作了业行为止。</p><p>有修行的人，到了中间某个链条上警觉自己，卡止住，不再往下进行。阿罗汉因为断了对三界的贪爱，心不再散乱和攀缘，眼根触色尘以后，不想再往下进行分别和感受，把眼光移开，不再接触，这样就保持了自己内心的清净；内心不再产生燥热和热恼，更不会产生贪求的心念，后世相续的生死种子就能断除，不再有生死轮回。众生正相反，总是顺着自己的心念贪求不止，从来不知呵责自己，因此业行不断，生死无期，苦恼不断。众生在其它几根都是这样随顺自己的贪心，因此就随顺于生死轮回，不能出离苦海。<span> </span></p><p><strong>第九节  世间一切法了不可得</strong></p><p>一、当我们断除我见时，就会认为五阴并不是我，既然连我都没有，也不可能有我所拥有的；表面看六尘境界好像是我所拥有的，但是那些法生灭变异，没有自主性，没有自在性，都是幻化的，因此都不能被拥有。</p><p>拥有和使用，只是一种虚幻的假相，没有实质。拥有，是七个识心的占有，但是识心无形无相，要如何占有？比如说衣服，七个识要如何拥有衣服？金钱，七个识要如何拥有金钱？拥有一个人，七个识要如何拥有一个人？自己的五阴身都无法拥有，何况去拥有他人的五阴身，拥有名闻利养，七个识要如何拥有名闻利养？根本不可能。所以佛才说，一切法都是虚妄的了不可得，一切法都是不可得的。幻化的东西，如何得？我们掐指算算，无始劫以来究竟得到了什么？就说刚刚，我们究竟得到了什么？仅仅是自心虚幻的觉受而已，哪有实法？每个人无始劫以来就是在不断的执著自己虚幻的觉受，追求和满足于虚幻的觉受罢了，哪里有得到和失去过什么。</p><p>二、现在听到天上打雷的声音，和耳旁蚊子叫声，这是同时听到的。可是雷声已经过去了多长时间，经过了多远的距离才被听到的？听到的时候，雷声早就消失了，天上已经不打雷了。既然雷声与蚊子叫声一起被听到了，声音在耳根里就不分先后。一个声音经过几秒钟到耳根里，或者经过几分钟传达到耳根里，那个声音的本质境还存在吗？早就不存在了，听到声音时，外界真实的声音就消失不见了。那么别人骂我的声音被我听到了，那个骂声还存在不？也不存在了，听到的本质境声音的幻化相，犹如山谷里的回音。那么听到的骂我的声音有多虚妄？非常虚伪不真实，六识所接触到的法都是这样。</p></div>"
},{
    "title": "第五章　在日常生活中观行",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  在日常生活中观行</strong></p><p><strong>第一节  由微粒组成的色身是虚妄的</strong></p><p>众生色身细胞当中也能产生生物电能，生理学叫作生物电。生物电不断的释放能量，以维持色身所需。细胞当中有四大组成的各种颗粒，核子、中子、质子、原子、电子、离子等等，这些颗粒的生灭代谢，能形成一种色身所需的能量，包括热能、动能、电能等。能量释放出去，就消耗了身体当中的四大物质成分，就需要不断的补充四大物质成分，因此就需要饮食。要想少消耗饮食，就要少有识心活动，入深禅定，内心宁静，识心少于活动，能量消耗的就少。</p><p>而色界、无色界天人，是以禅悦为食，不需要饮食，不需要物质色法。如果欲界众生，饮食不断，贪着饮食和滋味，就没有色界禅定，不能发起色界禅定。讲究饮食的人，食欲没有降伏，不可能有初禅定的现起。</p><p>生物，就是生命体，生命体就是五阴身，五阴身是由四大种子和识种子构成，识种子作用于四大色身，就有五阴的活动。其中四大种子刹那生灭变异，色身空幻不实；识种子刹那生灭变异，空幻不实，皆是如来藏性。五阴身就刹那生灭变异，不实如空花，如此观行并不难断我见。</p><p><strong>第二节  在穿衣吃饭时观行苦空无常无我</strong></p><p>每天都要观行吃饭这一法是如何生灭变异无常的，如何是苦的，如何是空的，如何是无我性无主宰性的；每天都要观行穿衣这一法是如何生灭变异无常的，如何是空的，如何是苦的，如何是无我性的、无主宰性的。</p><p>观行在穿衣吃饭当中的受觉如何是生灭变异无常的，如何是空的，如何是苦的，如何是无我、无主宰性的；观行在穿衣吃饭当中的想蕴了知性如何是生灭变异无常的，如何是空的苦的，如何是无我、无主宰性的；观行在穿衣吃饭当中的身体和心识的行为造作如何是生灭变异无常的，如何是空的苦的，如何是无我无主宰性的；观行在穿衣吃饭当中的识性如何是生灭变异无常的，如何是空的、苦的，如何是无我、无主宰性的。</p><p><strong>第三节  在被欺辱中观行无我</strong><br/></p><p>问：比如有人打我(色身)，有人骂我，于是我很生气。我这样思惟：他打的只是色身，不是我，疼痛只是觉受，不是我，真的我是第八识。生气的只是意根，他骂的也只是意根，不是我。这样观行可以吗？     </p><p>答：应该要这么想：色身被打，色身是什么？色身是四大组合成的一个肉体，肉体是由细胞累积形成的肌肉、骨骼、血液等等组合到一起形成的一个象木头一样的身体，这个身体是生灭变异的，是被组合变造起来的，是无常、空的，它不是我；如果这个身体是我，那么这身体灭了，我是否灭？实际上我不灭，我还有下一世，还有无量世。所以这个身体不是我。观行色身不是我，要有很深的禅定，观行这个色身象机器化一样，象机器人一样，这个色身生住异灭不由我控制，因此它不是我。这是一个总原则，细节要自己一一观行，各种认知要自己去证实确认。</p><p>再观想受蕴，别人打我骂我，我生气了，生气是我的感受，这个感受是不是真实的？这个感受怎么来的？感受是意识心的受，觉得疼是身识的受，所有的受反正都是六识的受，六识的受是不是我？是不是真实的？这个受是识种子生出来产生的，刹那刹那生灭变异的，受也是虚妄的、空的、幻化的，一会儿就消失了，因此受不是我。现在被打被骂觉得感受不好，一会儿如果你发财中奖了，感受就变好了，快乐了，那么这个生灭变异总在转化的，不能固定的，不能永远常存的这个东西，根本就不是真实的，不是我，那我还要执著它干什么呢？</p><p>再有你的想，你了知了那个人在骂你的是什么话，知道他的语言是什么意思，这都是意识的了知性，是想蕴。这个想蕴是怎么来的？是识种子生出来，形成了识阴，识阴一运作，就有了知性了。这个了知性是生灭变异的，是不常存的、是幻化的、是空的，所以想阴这个东西也不是我。只要不是永恒常存的，不是本来就存在的，后天生起来的东西，都不是我。这个想蕴，睡着了什么也不知道了，别人怎么骂也不知道，所以是生灭虚妄的，不是常存的，不是固定不变的，因此不是我。</p><p>再说行蕴，是六识的行为造作，包括身行、口行、意行。心里所有的念头思想、了别性、感受性，念念生灭变异的都属于行蕴，行蕴这个识心的运转，也是生灭变异的，不是固定不变永远长存的，所以也不是我。</p><p>六个识的识蕴，识本身的运作，包括心所法，都是生灭变异的，所以本身五阴总结起来说，没有一个法是固定不变的，都是生灭变异，变来变去的，一会儿有一会儿无，一会儿这样一会儿那样，都不是固定的，都是被出生的法，都不是真实的。</p><p>那么生气，生气是一种觉受，生气这个法是真实的吗？不是真实的！一会儿就不生气了，它总在变化的，所以所有的心识的作用全部是虚幻的，没有真实的法！如果死了以后，色身上没有识心的运行了，别人打你色身，你还觉得疼吗？不觉得！你还生气吗？根本不生气了嘛。所以识心离开了色身，色身跟木头一样，根本就不是我。即使色身上的识心，也不是我，何况色身，更不是我了。既然没有我，谁气谁不气？</p><p><strong>第四节  身见的表现</strong><br/></p><p>把色身当作我的我见，都有哪些表现？现实生活中哪些方面的熏染能增加身见？身见难断的原因是什么？为什么前世断过身见的人，今世再遇佛法很快就能断身见？把这些现象都找出来，然后一点点的降伏对色身的宝爱，断身见就会快一些了。对于色身一切方面的护持，都是因为身见的原因。对色身都有哪些方面的护持和宝爱？</p><p>如果我们了解一下出家人的戒律，就知道佛陀为什么会制定那么多那么详细的戒律，那都是为了降伏身见和我见而设的，出家人不懂，嫌戒律太约束自己了。如果守好佛陀制定的戒律就能得解脱，小乘的戒律也叫作别解脱戒，能守住一条，就能得一条的解脱。所以只要出家修行，将来肯定能证得四果阿罗汉，总有得解脱的一天，出家的好处有很多，最根本的就是清净自在，能得解脱。</p><p>现代人的生活方式，很难让人断身见，都太讲究生活质量了，太享受了，只管舒服享受就行了，其他一切都不管不顾。观察自己的身见，从日常的吃穿住用行各方面各角度观察，从财色名食睡各方面观察，从见色、闻声、觉触、嗅香、尝味几方面入手观察，发现自己特别看重这些方面，特别在意色身，特别关心照顾色身，特别讲究色身的受用，那就是身见比较重，应该想办法调伏。</p><p><strong>第五节  五阴的功能作用</strong><br/></p><p>一、打字时，手眼是色阴，看屏幕了别自体和屏幕是识阴，思惟构思是识阴，接纳屏幕状况是受阴，生起觉受是受阴，了别屏幕状况和字体大小是想阴，了别心里念头是想阴，手指头打字是行阴，不断构思是行阴，呼吸等等身根运动是行阴。所有五阴作用都是识阴和行阴。</p><p>找说话时、吃饭时、走路时、观想时的五阴作用，在六根触六尘时，找出色受想行识的功能作用。之后再观行思惟，各个功能作用是如何生起的，如何运行的，如何变化的，最后又如何灭去，如何转移的。</p><p>再思惟如何是无常的，如何是空的，如何是苦的，再思惟这样的功能作用，就是我吗？我就是这样生灭不已的吗？就是这样不断变异不停的吗？智者绝不会认这样的作用为我。</p><p>二、在房间里一边踱步一边思考问题，把这时候的五阴活动找出来，观察清楚。色阴在干什么，受阴在哪里，是什么状态？想阴是哪个，在想些什么？行阴如何运作的，在哪里有行阴？识阴六识各自了别的相分境界是什么？然后在禅定中慢慢的深深的观察思考其生灭变异无常性，了知其苦性，确认其无我性。</p><p><strong>第六节  简单的生活养心</strong><br/></p><p>现代人感觉比较枯燥乏味的生活都比较养心，容易断身见我见。因为那样的生活，不容易让人贪着，心比较单纯和清净，对色身不太注重和在意，容易断身见，我性也轻微，容易断我见。再有就是那样的生活不浪费福报，有福德支撑着，道业就进步很快。一个真正菩萨，应该很珍惜自己的福德，不会轻易去消耗掉，因此都不讲究享受。菩萨在这个世间出生时，就不选择富贵人家，免得小时候福德被父母作主而白白的消耗掉。现在的人都不懂不在意这些福德的事，不知不觉很随便的就通过享受消耗了，太可惜了。自己却不知道，还以享受荣华富贵为荣。父母一定要对孩子负责人，不能随便替孩子作主消耗他的福报。那些福报小时候就给消耗掉了，长大福报少了，就有受苦的，学佛时用在道业上的福德不足，道业就会难以成就。</p><p>过去的年代里，没有各种色身上的装饰品，没有家居装饰品，没有各种五花八门的衣服和饮食，那时候人们都不往身上涂抹什么东西，室内也不用喷什么东西，也不用过多的装饰，简简单单的，就不容易着色声香味触，也很少保养色身，思想单纯，身见易断。富贵修道难，贪习太重，贫穷布施难，薄福。所以修道是从一点一滴做起的，积小成大，积少成多，养成一个良好的修行习惯，不愁不了道。</p></div>"
},{
    "title": "第六章　观行杂谈",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第六章 观行杂谈</strong></p><p><strong>第一节  渐修才能提升心性品德</strong><br/></p><p>一、瑜伽师地论是讲从凡夫地到四种圣人地的渐修过程。其中最初的声闻地讲得很详细，其瑜伽师修证过程不是快速而是渐进的，这样才能逐渐获得禅定，降伏和改变贪嗔痴各种烦恼心行，然后才能断我见，证得无我，具备圣贤人的品格，做圣贤人的事业。非是证得初果还是贪嗔痴极重，无恶不作的恶人。</p><p>渐修才能渐降伏烦恼，提升心性品德，逐渐具足人格和菩萨格。 而快速的解悟，快速的得知最后答案，没有一点此种功德，来不及降伏烦恼，无法提升心性和品格，其结果只得个名声，却没有其实，那是得不偿失的。就如煮饭和熬药一样，快熟与慢火熬熟，其味道与营养价值完全不同。求快，是严重的功利心，是有所求心有所得心，是世俗心生死心。不能出生无我的心、无为的心、解脱的心、无求的清净心，往往是背道而驰，事得其反。</p><p>降伏烦恼，提升心性，培养圣贤人的品格，要从四念处观做起，从各种止观中做起。止观之路是漫长的，不是快速的，全方位全角度的去观行，去修止，去降伏自心，整个人才能逐渐蜕变，脱离凡胎而具圣骨，从里到外全部改换更新，才能成为真正的圣贤人，成为众生的导首。当自己从泥泞中拔出腿脚以后，才能带领和拉拔有缘众生走出泥潭，如果自己都无力从泥潭中拔出腿脚，那要如何去拉拔他人出泥潭呢？</p><p>二、佛说整个佛法就是一佛乘法，无二也无三。声闻地的修证是一乘法的其中一部分，是最基础部分，也是非常重要的部分。在这当中的修行，是降伏和断除烦恼，逐渐与圣性佛性相应的过程，不可或缺。这个地基不打好，却一心要去建造高楼大厦，即使能建成也是空中楼阁，早晚必毁灭。所以一切菩萨的修行，必须踏踏实实，巩固地基，重视修行戒定慧，勤于熄灭贪嗔痴，不可一味的高喊口号，而无实质的修行内容，还说自己是正修和实修。</p><p>烦恼性障既障禅定，也障智慧，遮蔽智慧光明的生起，就像一堵墙遮蔽光明一样。烦恼去除了，遮障没有了，六七识才能转识成智，其智慧才能广大无碍。烦恼习气很重，心量狭小的人，就观察不到深细的佛法，都在佛法的表面上打转，深入不下去。七识受烦恼和习气的约束很大，围绕着一个我，突破不出去，所见一切就带着我性，智慧狭隘，可见无我的智慧确实广大。所以我们应该经常观察自己的心是否有我性，是否具有不公平性，发现了我性、自私性就要想办法尽量调伏，因为这与佛心不一致，必然障道。我性与道相比，犹如牛毛与牛的关系，必须除去，才能得到牛而不是牛毛。</p><p><strong>第二节  诸行无常四句偈的含义</strong></p><p>诸行无常，是生灭法。世间存在和运行的一切法，都是无常的。为什么无常呢？因为这些行法，都是依如来藏而存在的，是如来藏依各种业缘变现出来的，是因缘所生的，缘尽，即灭去，因此是生灭的，生灭的就是无常的。</p><p>生灭灭已，寂灭为乐。当修行到断除我执，断除对三界世间法的所有贪爱时，也就是证得四果罗汉时，就有能力灭尽所有这些世间的行法。当四果罗汉灭尽所有这些运行的法时，也就灭尽了阿罗汉的五阴十八界，但是有一个是不灭的，也永远灭不了的，那就是阿罗汉的第八识如来藏。这样灭尽了五阴十八界，没有了阿罗汉这个人，没有了六根六尘和六识，没有境界，也没有识心，也就没有了苦受，也没有了乐受。而如来藏也没有苦乐受，处于不见六尘，不见一切法的寂灭境界中，一法也不现起，静悄悄，空荡荡，无有一丝苦受，方便说为寂灭乐，实际上也没有乐。</p><p><strong>第三节  断我见是观行五蕴败毁法</strong></p><p>一、小乘断我见，是证知五蕴十八界的无常、空、苦、无我性，我等于无常，等于空，等于苦，是需要破除的，因此是能毁灭的。能毁灭的，就不是真相，不是真实的。</p><p>真实真相，有两种含义，一种是指世俗界的真理、事实，另外一种是指大乘法中永远不生灭的第八识。而小乘断我见的修行，知道有个第八识不灭，与五蕴十八界有区别，是五蕴十八界的所依，这样就足够了。观行思惟的重心在认识五蕴十八界在世俗界的真理是可毁灭败毁的法，没有真实性的，其真相就是不久长的相和苦相、空相、破毁相。</p><p>不少人的头脑和思惟总是陷入一个误区里出不来，是什么原因呢？一个是受到了某种误导而先入为主，一个是逻辑思惟力不足。思惟力不足，与定力不足有关，与前世的善根福德有关，这需要自己一点点的累积定慧和善根福德。前世不具备一定的修学根基，今世修行不能有多快。如果强求自己非常快的悟，在各种因缘条件还不成熟的情况下，在自己心性等等还没有转变成与菩萨相似的情况下，着急参究第八识，连五蕴无我都不去破除，对自己的道业有害无益，往往适得其反。</p><p>二、学佛修行离不开六根，离不开六尘，更离不开六识，而恰恰是需要在五蕴六根六尘六识上修行，离开十八界没法修行。修行是要用六识的身口意来修，不能灭除六识而不用。只有悟后修四禅八定时才可以暂时灭除六识而深入禪定，以发起无量神通，修出慈悲喜舍四无量心；其余时候都要用意识心思惟佛法、参禅、观行断我见，熏习意根，断除意根的执著和染污。</p><p>既然要用六识，就要有六根，没有六根不能生起六识，而且意根只有断我执的大阿罗汉才能灭掉，普通人是灭不了的。如果还没有断我见的人，无论如何也不能断我执，只有我见破除，对自我的执著才能一点一点断除，这是修行次第，是不能跳跃的。如果没有断我见的人说要断执的话，那只是口头说说而已，根本做不到。</p><p><strong>第四节  佛所悟的法不是缘起性空</strong><br/></p><p>世尊在阿含经中讲的十二因缘法，是声闻缘觉所修的解脱之法，不涉及大乘如来藏法，也不是直接成佛之法，因此十二因缘法不是究竟成佛之法；究竟的佛法不是讲虚妄法的一切法空，而是讲不生灭不空的如来藏的所有功德体性。声闻缘觉修完十二因缘法，只能证得缘起性空，知道五阴世间一切法都是因缘所生，依赖如来藏这个因以及无明业种就有一切法的生起，而大乘的如来藏实相心还没有能力证得，因此还不具备大乘实相智慧。</p><p>既然十二因缘所依赖的各种缘都是从如来藏中出生的，那么这些缘都是生灭的，不是真实的，是幻化的空相，声闻缘觉证得此理就能得解脱，出离生死轮回苦。但是他们还没有修证大乘法，不懂如来藏的成佛之法，三乘佛法只修证了二乘，最上乘法还不懂也没有修证，就这样出离了三界，还有无始无明和尘沙无明没有破也没有断，无明习气及烦恼随眠都没有断除，因此声闻缘觉的修证境界与佛相去还甚遥远。</p><p>因此说来，佛陀成道时所悟的不可能是缘起性空的二乘法，一定是最上乘如来藏法。佛陀夜睹明星时眼见佛性，就是见得最真实的佛性，这是佛地的见性。佛的大圆镜智现前，四智圆明，就成就佛道，非是世人所错会的缘起性空这样浅显的二乘法，二者本质相去甚远。如果佛陀只悟个缘起性空二乘法，佛陀就不能教导众生大乘的真实如来藏成佛之法，那么佛法就是不完善的，有极大的缺憾，众生就不能得到真正的最大的究竟的利益。可是佛陀在转法轮的后期，一直在教导众生大乘成佛之法，可见佛陀成道时所悟根本不是缘起性空。现在众生误会佛法太严重，知见很浅薄，都是把缘起性空当作佛法的中心和重点，不能与万法的根源相联系，不知万法的来源，不知世界的本源，这正是佛法的流弊。</p><p><strong>第五节  回小乘向大乘的阿罗汉</strong><br/></p><p>小是指心量小，很少顾及他人，为他人的利益着想；乘是装载工具、运输工具、车乘的意思，小乘是指其法浅而不究竟的意思，度的人根基和数量有限。大乘是心量广大，修行不完全为个人，也为广大众生的利益着想，法大法深，度人无限量而又究竟的意思。</p><p>声闻缘觉的心态，就是想要自己离苦得解脱，其他的都不管，他们不考虑众生的苦，不考虑佛教的发展，不考虑报佛的恩德，一心只奔向无余涅槃，希望自己不再出现在三界里受身心之苦，他们这个心量是很狭小的，所以名为小乘人。而大乘菩萨们心量广大，不仅要自利求取无上的大涅槃，而且还要带领所有的众生一起出离生死的大火坑，趣向无上的佛道，证得究竟的涅槃。要想成就佛道，究竟得解脱，小乘人就需要回小乘心向大乘心，改走大乘的菩提大道，不走小乘的羊肠小道。</p><p>声闻缘觉之类的修行人分为两种：一种是能回心大乘的不定性声闻缘觉，一种是不回心大乘的定性声闻缘觉。回心大乘的声闻缘觉人在修到一定阶段，自己的心得到安稳以后，看到众生苦恼不断，就发心为了众生而不入无余涅槃。或者听到佛开示大乘法义，因欣乐于大乘就要追求无上菩提，追求明心见性，修学如来藏法，不再选择入无余涅槃，而是要留世继续修行，自利利他。</p><p>二乘人回心于大乘，在不同的修行阶段都有可能，有在证果之前，也有在证得果位之后，这要看各自因缘的影响力如何。如果一个人的心不在小乘上，即使是修行小乘的四圣谛法，证得罗汉果，只要不是只想个人得解脱，不想入无余涅槃去躲苦，也不是小乘人，那就谈不到回小向大的问题。只有声闻人的自私心态才需要回小心向大心，成为大心的广利无量众生的大乘菩萨。</p><p>现世末法，凡夫众生我见深重，我执更重，如果不修小乘四圣谛法，先求断除我见，大乘法也不易修好。不修小乘法断我见，直接修大乘法，先参禅，即使参出了密意，悟得如来藏，我见还是死不透，断不彻底。因为这个我见不死透，我心私心慢心还是要不断地作祟，贪嗔痴烦恼还是很重，自己在大乘的道业上就不能有多大的进步，往往是原地踏步者多。</p><p> 大小乘的果位不是截然分开，而是紧密相连的。小乘的果位不能上进，大乘的果位就停滞不前，这样一生所修下来，能实际受用还是不多，纵使讲起道理来口若悬河，天花乱坠，但与实际修证的差距仍然非常大，并不是表面所显露出来的那样有修行。我们现在的末世众生业障深重，我见、见取见极重，必须要把小乘的基础打牢固了，让那个五阴死得透，永断无余，贪嗔痴烦恼的降伏和断尽就能很快，这样的话，自己生生世世得到很大的利益，作菩萨也能轻松和愉快，也不再造作很多恶业恶行来遮障自己的道业，不再让自己受到很重很大的苦报。我们要有智慧，仔细思考其中的道理，作出最有利于自己的抉择，不要轻视小乘法的修行，不要好高骛远，踏踏实实地稳步向前迈进，这样才最有利于自己的道业增进。</p><p><strong>第六节  菩萨与阿罗汉修行的不同目标</strong><br/></p><p>世尊在《阿含经中》讲，贪爱集就是苦集，贪爱灭苦就灭，苦灭就得解脱。灭贪爱的前提条件是修习四圣谛理，了知苦谛，断除集谛，修八正道谛就能灭苦，从而证得苦灭谛。证得苦灭谛就是智慧解脱者，解脱是由断我见而来，我见断了以后，我执才能断尽，断我执以后心就得解脱。从此以后不再执取五阴世间妄法，成为一个自由人。</p><p>阿罗汉得解脱后心得自由了，命终却把自己的五阴全部灭掉，意根也灭掉，未来在三界世间不会再出现五阴身受苦，阿罗汉这个众生就从此消失于三界中。他们不能再继续修学佛法，获得大乘甚深般若智慧，也不能以自己所修来利乐众生，也不能成就佛道，只获得了暂时而不究竟的解脱。这是因为他们缺少智慧，慈悲心薄，私心较重，不悲悯众生苦，因此佛说他们是小乘人，是焦芽败种。</p><p>菩萨们证得第八识明心，同时也断了我见，知道第八识为真，五阴为妄，不再认五阴为我，以后修行所要走的路就是大小乘同时起修，在小乘解脱道上也要灭贪爱得解脱，但菩萨们不是永远灭去五阴身而不用，而是善用五阴身修学佛法，同时也利乐有情，从此虽然生活在三界世间，但心却自由解脱。菩萨们走大乘修行之路，慈悲心重，发愿自利和利他，虽能心得解脱，永不灭度，不像阿罗汉那样害怕生死苦，灭掉自己，未来不再出生在三界世间里，既不能自利也不能利人。菩萨如果取灭度就违背了菩萨戒，违背菩萨的慈悲心，违背诸佛的教导。所以得解脱的菩萨，命终还要保有一点思惑烦恼不断，才能继续在三界出生，这叫作留惑润生。</p><p><strong>第七节  大小乘两种解脱</strong><br/></p><p>解脱有两种，一种是二乘无学圣人阿罗汉和辟支佛的解脱，一种是大乘菩萨的解脱。小乘的解脱，就是对三界世间法再也没有贪爱，贪嗔痴的无明烦恼全部断尽，不再被三界生死所系缚，有能力灭掉自己的五阴十八界，入无余涅槃。修学四阿含经当中的苦集灭道四圣谛理，证得五阴无我，断除我见和三缚结，然后证得初禅，再断贪爱，断我执，就能得解脱，出离三界的生死轮回。</p><p>中乘辟支佛们修行十二因缘法，断尽无明，就能出离三界生死轮回，灭尽自己以后不在三界中出生，这样就能得解脱。以上两种解脱，都是五阴通过修行才能得到的解脱，不是本来就存在的解脱，是不究竟不彻底的解脱。这种解脱没有解脱色，最终要灭掉色身；这种解脱也没有断尽所有的无明，无始无明仍然没有破除，还有变易生死没有解决，还没有真正解决生死大事，因此不是究竟的解脱。</p><p>大乘的解脱，是菩萨通过修行菩萨六度，参禅证得本来就解脱的如来藏心，明心见性以后，依止于自由自在的如来藏，五阴也就能断尽贪嗔痴无明烦恼，断除对三界世间的贪爱，最重要的是还要断除法执，渐渐就能得究竟解脱，而生生世世保有解脱的五蕴身，利益无量众生。菩萨们不仅要断尽烦恼，还能断尽烦恼习气，无始无明和尘沙惑也要全部断尽，分段生死和变易生死也要全部断尽，这样证得佛地的无住处涅槃，得究竟解脱。这是真正的也是最终的究竟解脱，这种解脱有解脱色，佛陀用此解脱色分身无数广度有缘。而证得如来藏明心见性时，就知道如来藏不生不灭，不在三界中，不被三界生死所系缚，本来就解脱，五阴依止于如来藏，也是本来就解脱的。</p><p><strong>第八节  小乘断的是什么疑</strong><br/></p><p>小乘的断疑，是断掉对佛所教导的四圣谛法能否得解脱的疑，断掉对自我是否断了我见的疑，断掉对他人是否断我见的疑。断疑以后，就能正确判断某人所说佛法能否让众生断我见得解脱，能够正确判断自己及他人是否断我见，对法对己对他人不再生疑。但是他们因为没有证得大乘法，还有极多的所知障，所以还有对大乘法不确定的疑。</p><p><strong>第九节  四念处观的殊胜果德</strong><br/></p><p>佛说从七年到七天等不同时间，精进修行四念处观都可证果，这是指那些善根深厚、烦恼轻微、遮障少、前世学佛时劫久的人，他们如果能像佛陀要求的那样去精进修行，几天至几年就能证果。而无始劫以来学佛时间短、烦恼深重、遮障重的人，就需要七年以上的精进修行才能证果。也许多数人一百年也不能证果，有的人甚至连观呼吸都观不好，心里无论如何也静不下来，更不要谈证果了。</p><p>但是也像佛说的那样，不管什么人，只要精进修行四念处观，能做到心心念念都是四念处，心心念念都能观行，改变无始劫以来对五阴世间的攀缘习气，降伏了烦恼和业障，证果还是不难的。难就难在业障关过不去，自己不肯下决心用功办道，散乱习气不能降伏下来。真能做到勇猛精进，做到如佛经中所说的那些修行，肯定就能证果了。</p><p>这个四念处观的修行方法非常殊胜，大家不要嫌弃小乘的修行，其实这是修行的捷径。佛说的捷径才真是修行的捷径，戒定慧具足，实修实证，不是嘴皮子功夫，不是情思意解，不是想一想琢磨琢磨就证果的那种。</p><p>从佛教导给我们的修行方法中，去体会什么才是真正的实修和实证，需要付出什么样的代价，不是像一些人想象的那样意识心理解理解，什么代价也不用付出，什么戒也不用守，什么定也不用修，意识理解的乾慧就算证果了。我们要深信佛陀的智慧，听从佛陀的教导，对自身的修行才有真正益处。</p></div>"
},{
    "title": "第七章　断我见与意根的关系（1）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第七章 断我见与意根的关系</strong></p><p><strong>第一节  意根的我见</strong><br/></p><p>意根因有我见，致使五阴众生无始劫以来一直认贼作父，妄受生死流转苦。认贼作父，是意根认，哪个是贼呢？六识的功能作用是贼，哪个是父呢？我和我所是父。六识的生灭无常变异性，意根没有搞明白，就把六识的功能当作是自己的功能作用，从而执著不舍，贪执不已。怎么办呢？首先承认身中有个不生不灭的真心，然后观察六识五蕴的苦空无常无我性，生灭变异性，不可得性，再观察六根六尘的生灭无常无我性，才能灭除贼人，心中无贼了，再断除对贼人的执著贪爱，就得解脱了。</p><p> <strong>第二节  阿含经中所说的我见</strong></p><p>把六识的功能作用当作是我自己的功能作用，就是我见。执六识的见为我自己的见，就是我见。把六识在六个窗口获得的信息当作是我了别出来的，就是我见。把六识在六入处的受，当作是我自己的受，就是我见。把六识对六尘的思想观念当作是我自己的，就是我见。把六识的身口意行造作当作是我自己造作的，就是我见。这个我是谁？只有意根。</p><p>佛在阿含经里讲的我见，就是意根的见，断我见就是让意根断我见。那么佛在阿含经里说没说意根呢？当然处处都指意根。</p><p>意根的我见实质就是法我见，把一切法都当作是我和我所，不知道都是第八识的。其中有意根的五蕴我见，就是把五蕴当作我和我所。</p><p>意根有我执和法我执，对应的就有我见和法我见。实际上法我见包括了五蕴我见，意根只有法我见，把一切法都当作是我和我所。那么意根法我执就包括了我执，意根只有法我执，执著一切法都是我和我所，法我见法我执断尽，无明就断尽，就成佛。修行无非是这点事，却折腾了三大阿僧祇劫，如果能下狠心，该断除的一个不留，该斩断的一个不留，那就不需要三大阿僧祇劫了，苦受就少很多很多了。</p><p>意根有我见，是因为自心的无明，学佛修行就是要破除意根的这些无明，让祂知道一切法都不是我的，都是第八识的，包括五蕴十八界，这样意根就会慢慢断除人我执和法我执，无明断尽，成就佛道。</p><p>众生的无明，全部是意根的无明，六识的无明由意根的无明而起，受意根的无明所熏染出来的。意根没有无明了，就没有我见和我执，也没有法我见和法我执了。整个一个小我妄我，是意根，对应着一个大我真我第八识，二者和合起来，变现出世间一切法，一个是任性的有我性的，一个是随顺无我性的。修行就是修意根，无余可修，一切法都是为祂服务的。</p><p>明白此理，就会明白世间一切法的来龙去脉，明白修行佛道为何而修，如何而修。心里就会清亮亮的，无遮障。</p><p>如果谁有勇猛心，可以组成敢死队，互相监督合作，把一切我死去。要我何用？生死的根，有我就不能得大自在，不能得大解脱。佛法整个修证过程也就是看破放下的过程，看破就已经非常不容易了，放下更难更难了，全部放下，就成佛。</p><p> <strong>第三节  我与我所都属于我见</strong></p><p>我见难断，因为根深蒂固，我所见也非常难断，因为根深蒂固。意根把五蕴一部分功能作用当作我，就把另一部分功能作用当作我所，根深蒂固的执为我和我所有的，习惯性的认知很难转变。要想断除意根这种不如理的知见，需要长期性的观行，不断反观自己对五蕴的各种观点看法，定中如理思惟。</p><p>我与我所是非一的，不同的有别的就是异。比如说认为受蕴是我，那么色蕴就是我的我所有的，我与我所就是异，好像断了色蕴是我的我见，但是把色蕴当作我所的知见也是邪见，根深蒂固，我与我所见同样是我见，都很难断，都要断除。断我见之后，知见扭正，就会认为我与我所不异，受蕴不是我，色蕴也不是我所，二者都不是我。</p><p>断我见之前，把受蕴当作我，把色蕴当作我所，认为受蕴在色蕴中，色蕴在受蕴中，二者互相存在，周遍其体。断我见之后，知见扭正，认为受蕴非我，色蕴非我所，受蕴不在色蕴中，色蕴也不在受蕴中，二者不互相存在其中，色受想行识五蕴非我故。</p><p>这个问题难思议，需要在禅定中，把问题悬在脑海中，悬在意根中，有一天就会开窍，通达其义。这个结解开，断我见的障碍就会排除，观行阻力就小了。</p><p> <strong>第四节  我见和我所见都要断除</strong></p><p>观行断我见，既不把色受想行识五蕴当作我，也不能当作我所，不能说色蕴不是我，却是我所能拥有和使用的，不能说受想行识蕴不是我，却是我所能拥有和使用的。色受想行识就是我，这是错误的看法和知见，我能拥有色受想行识也同样是错误的看法和知见，这些知见都要灭除，从心里挖掘出去。</p><p>有个我所，就有我，就是没有断除我见。是谁把色受想行识的功用当作我所有的呢？当然是意根，是意根无始劫以来一直在使用利用这些功用，认为自己有这些功用，因为有这些功用，就生起我慢和我执，生死烦恼不断绝。</p><p>当意根想要有这些功用时，第八识就会毫不吝啬的为意根出生色身和六识，现起这些功用，意根就把这些功用当作是我是我所，不知道都是第八识的，于是生死流转不休。要想摆脱生死流转的苦恼，一定要让意根断除这些想法和知见，不再让意根认为这些功用都是我和我的，这样意根就无我了，渐渐的不再想利用这些功用造作烦恼业，渐渐的就会减轻对这些功用的执著和贪着，生死业就消除了。</p><p>无始劫以来意根一直执着五蕴十八界，为什么执著？因为意根认为这些法就是我，就是我所有的，因此才有执著。如果意根不认为这些法是我和我所有的，就不会再执著了，因为知道执著没有用，贪着没有用，是空的苦的幻化不实的，抓不住，证得这个理，就会逐渐放松执著，就会越来越自在和解脱了。初果证得五蕴无我，就得法眼净，心眼就开始清净了，见清净，行就清净，烦恼断尽时，行是最清净的。</p><p><strong>第五节  观行一定要深入到意根</strong><span> ﻿﻿﻿﻿</span></p><p>一、修行一定要深入到意根</p><p>学佛修行，意根还没有受熏时，身心世界就不会转变，也就没有得到佛法的真实受用。因为身心世界是由意根作主，由意根调控，意根证得无我，就会放松对身心的控制，身心就转变，轻松无碍了。这是学佛修行的一个大秘密，大家多体会。学佛一定不要停留于口头禅，一定要深入到意根的内心世界，要真真正正的改变自己，从根挖出贪嗔痴烦恼，自己才能彻底转变，从而快速成就。</p><p>很多人学的法可能很多，学佛时间也很长，但是是否得到真实受用了？内心世界是不是有所转变，对于自我的觉受和执著是不是有所松动了？自己常常要回光返照，才能不断的进步。如果自己没有能力回光返照，就要找个人监督，时不时的敲打一下自己，让自己觉悟，这样修行也能快一些。</p><p>很多人从来不检查自己的内心，更不希望别人来敲打自己，这是因为意根太执著自我，太护着自我，我执根深蒂固，学佛就不得力。修行就是要不断的与自己较劲，才能改变自己，道业才能不断的增进，如果向外与别人较劲就大错特错了。</p><p>二、观行五蕴虚妄断我见，只在意识心上认为五蕴非我还不行，还需要意根认可才行。要想让意根认可，必须拿出充分的理由和证据来说服祂，不是说意识认为无我，就是已经无我了，意根还不清楚，还认为是我，这是生死轮回的根源，必须断除这个根源，才是真正的断我见。</p><p>而意识在接触佛法之后，知道了无我之理，意根还不能很快就随着也认为无我，因为意根不仅智慧比较弱，没有比量和非量的了别，只能承认现实和事实，也比较固执己见，固有的习气很重，知见不容易扭转，所以意识必须找出充分的证据来说服引导意根。意根的攀缘范围非常广泛，根本没有定力，因此慧力劣弱，理解和认识问题的能力非常差，意识必须要把各种道理都分析思惟透彻了，道理明明白白的摆在那里，意根才能容易理解。意识要把祂当作是一个幼稚而顽固的孩子，要耐心细致对祂讲事实摆道理，摆出各种证据，千方百计说服祂，祂才能被说服，从而明了真理，改变自己的知见，那就真正彻底的断除我见了。</p><p>要如何说服意根呢？这就要求意识非常细心的思惟：五蕴究竟是如何虚妄的，究竟是如何生灭的，究竟是如何无常的，究竟是如何变异的。究竟两个字里面就包涵了摆事实讲道理，要拿事实说话，意根只承认事实。要想拿出事实，意识必须深入细致的思惟，一个道理一个道理分析得清楚又明白，意根就懂得这个道理。意识在思惟分析的整个过程，就是在说服意根的过程。因为意识思惟的整个过程的细节全都传递给了意根，祂都要了解，意识的每个思绪，思惟的任何一个法义，所有的心念都能熏染意根，因此思惟的内容意根都能了知到，所以意识思惟的过程就是说服意根的过程，也是熏习意根的过程。</p><p>意识要如何具体思惟呢？先思惟色身五根，眼根耳根鼻根舌根身根，这五根为什么是无常的、虚妄的、空的、苦的、不是我，五根是如何出生的，又是如何灭的，如何变异的，意识都得要仔细思惟。思惟的过程和细节意根全部都了知，祂了知以后就能慢慢认可：确实是这样，是这个道理。</p><p>如果意识不仔细思惟，意识心认为五根就是生灭虚妄的，不用再多想了，就是这个理，可是这样太粗略的说是没有用的，意根不懂这个道理，就不能从意根内心深处来否定五阴，意根是不认可无我的。要想说服意根，扭转意根的邪见，意识就得要拿出有说服力的依据来说话，那么就要细细地观行思惟，深深地观行思惟，把所有理论依据拿给祂。意识必须思惟色身如何不是我，五根如何不是我，其中的道理是什么，要思惟清楚透彻，最后才能说服意根，祂才认为确实是如此，祂才按了确认键，这事就算定局了。</p><p>五根观行完了之后，接着观行意根本身的生灭虚妄，无常非我性。观行当中要思惟，意根究竟为什么不是我，其中的道理是什么，要思惟清楚透彻明白，让意根明白：原来我也不是真实的，然后按个确认键结束。</p><p>下一步再观行六尘的无我性，思惟色尘、声尘、香尘、味尘、触尘、法尘这六尘究竟为什么是生灭的、无常的、变异的、苦的、空的；六尘是如何出生的，又是如何灭去的，究竟为什么不是我，越深入越细致越好。最后要让意根认可，确实如此，六尘并非是我，也不是我所有的，意根从此对六尘不再看重，不再当作真实法。</p><p>再接着观行六识。要观行思惟六识出生的处所和根源，思惟六识都是什么时候生又是什么时候灭，如何是无常的，如何是变异的，如何是苦的，如何是空的，如何是无我的。最后，意根不得不承认，六识如此的快速生灭变化，确实把捉不定，根本不可能是我，于是不再把六识当作是我，也不再当作是我所有的。</p><p>接下来要观行五蕴的无我性。五蕴比较复杂一些，各个功能体性心里都要清楚，都要作深入细致的了别。五蕴的概念弄清楚之后，就要对每个蕴一一观行思惟。色蕴就是身根五根，以上已经思惟过了，这里要增加一些内容，要思惟身根五根的功能作用是如何生灭无常变异，如何是苦的空的，如何是无我的。</p><p>三、世尊在《杂阿含经》中教导弟子们，观行色蕴非我时，也要观行过去的色蕴非我，不异我，不相在；现在的色蕴非我，不异我，不相在；未来的色蕴也是非我，不异我，不相在；乃至于好的色蕴、坏的色蕴、粗的色蕴、细的色蕴以及内色、外色都不是我，不异我，不相在。这样才能把色蕴全面观行得仔细，才能彻底断除色蕴为我的邪见。</p><p>不异我的意思是：从大乘法上来说，色蕴不异于第八识真实的我，色蕴由第八识所出生，完全来自于第八识，与第八识是非一非异的关系。不是离开第八识而单独有个色蕴，不是离开第八识而单独有色蕴的功能作用，因此色蕴不异我。从小乘法上来说，色蕴虽然不是我，但也不是异于我的我所，不归意根所拥有。</p><p>不相在的意思是：从小乘法上来说，色蕴的我与受想行识蕴的我所，不互相存在，色蕴不在受想行识蕴里，受想行识蕴也不在色蕴里。</p><p>从大乘法上来说，色蕴不在第八识里，第八识也不在色蕴里。因为第八识无形无相，是空的，也没有个里外之说，第八识是无色法的空性心体，因此祂不能装载色蕴。而第八识也不在色蕴里，第一是因为第八识无形无相，不可能在色蕴的里外和中间，第二是因为色藴和第八识不是同类的法。也就是说二者不能互相包含在一起，不能重叠在一起，不能碰触在一起，但是二者又是紧密相连的。如果第八识是在色蕴里，割开色蕴应该能找到第八识，应该能看到第八识从色蕴里出来，可是却找不到，也看不到第八识出来。因此色蕴与第八识不是互相存在的，但却又紧密相连，不可分割。同理可证，五蕴十八界都是与第八识不异而不相在。</p><p>观行完色蕴之后，要观行受蕴究竟是如何生灭无常变异的，究竟如何是苦和空的，为什么不是我，究竟如何是虚妄的、假的、空的；受蕴是如何生灭变异的，为什么生灭变异的就是苦的，为什么苦的就不是我。意识要有这样一系列的思惟过程才能说服意根，熏染意根，才能扭转意根根深蒂固的我见。</p><p>意识如果没有思惟过程，根本就说服不了意根，意根既无知又固执，必须摆事实讲道理，把所有的现量拿给祂，祂才肯承认事实。因为祂自己不能作深细的分析归纳和整理，必须依靠意识提供证据。如果没有道理给祂，硬要祂承认某个理，从而改变祂自己，那是行不通的，所以必须对祂摆事实讲道理才行。</p><p>受蕴观行完了，再来观行想蕴。思惟什么叫想蕴，在哪些方面体现出其功能作用，想蕴的行相是什么，特征是什么。明了之后，再深细思惟想蕴是如何生灭变异的，究竟如何是无常的，如何是空的，如何是苦的，苦空无常的想蕴究竟为什么不是我。这样一系列的深入思惟整理，不仅意识心自己明了，亲自证得想蕴非我不异我，也让意根现前思量抉择到：想蕴，真的就是生灭变异无常无我的。这样的抉择就非常有力度，内心深处就能认同此理，对想蕴的执取心就放松了。</p><p>接下来再观行最后一个行蕴。静下心来，排除杂念，思惟什么是行蕴，行蕴包含哪些内容，其行相特征是什么？明了之后就要深细思惟：行蕴是如何出生，如何集起，如何灭去，如何生灭变异，如何不自在的；行蕴如何是空的，如何是苦的，为什么不是我，也不是我所有的。</p><p>反反复复观察，多方求证，推导出一系列的事实，让这些道理成为一种非常明确的事实，意识自己不得不承认，行蕴确实是无常无我，这是口服；再者，意根也不得不认可行蕴苦空无常非我，这是心服。口服心服以后，七识的心行才能发生根本转变，从此就能天下太平。</p><p>五蕴要这样一蕴一蕴的观行思惟，十八界也要这样，一个界又一个界都思惟观行透彻。要想思惟透彻，就要有一定的定力，缺少定力就做不到。在定中思惟又深又细，慢慢地，细细地，就能深入到意根，越深越细越慢，意根就越容易理解，而且祂也参与深细的思量才能有所触动，有真切的认知才能改变自己的知见，心行上就有个较大的转变。</p><p>意根有比较微弱的了别慧，意识思惟得深细了，祂就能依之真正明了五蕴是无我的，从而知道了无我的真实义。意根原来就不这样认为，因为祂不知道这些道理，这就需要意识心多为祂进行深入细致的分析。</p><p>比如教育孩子时，如果不给孩子讲道理，只管强迫和动粗，他表面上虽然不得不服从，但内心深处不懂，祂就不能从内心深处认可，从而改正其行为，下次还要犯错。因此说服教育讲道理是必须要做的，理讲的越透彻明白，他越能接受和顺从，对待意根也是如此。 </p><p>四、观行五蕴的虚妄无我性，要把五蕴尽量都分开来一一观行，把十八界也尽量分开来一一观行。在我们一切活动的当下，不是只有一个蕴在起用，不是只有一个界在起用；也不是某个蕴跳转式的从一蕴转到另一蕴上起用，不是某一界转移到另一个界轮流起用，多数情况下是五蕴都同时现起，同时起用，十八界也是同时现起，同时起用。</p><p>比如我们坐在这里聊天，眼睛可以看见窗外的景色，可以看见前方墙壁，耳朵可以同时听见声音，鼻子可以嗅到花香，六根同时起用，六识同时分别，六尘同时出现，十八界都同时起用。而五蕴呢，色蕴上的身体在造作，受蕴上的六识在不断地感受，想蕴上的六识在不断执取和了知，行蕴上的六识身口意行在不断现起。</p><p>这样就可以观行到每一根每一尘每一识都是如何现起的，依着什么缘而现起，现起之后做了什么，十八界是如何配合统一起来的，最后又如何散去；然后再观行下一法又是如何生起，如何灭去。之后再观行每一蕴都是如何现起，依什么缘而出生，又是如何产生变化，又是如何慢慢消失；然后把注意力转移到下一法中，再观察每一蕴是如何出生和灭去的。</p><p>一定要慢慢深细的思惟观行，观行一段时间以后，心念就变得深细，杂念极少，意念就集中，呼吸深沉，心跳就减缓下来，气血畅通，身心安详，周围一切的杂乱就感知不到了。只有深思的法在内心里久久盘旋着，思惟动得很慢很深很细，这时才能够深入到意根，意根就跟着深细思量。即使短时间内意根没有通透，然而祂已经有了抉择心，想把意识思惟的内容弄清楚，祂对其它无关的世俗法不再攀缘或少于攀缘，就开始惦念着要完成观行内容。这样意识的定慧就增强，观行就能一点点深入下去，有朝一日，意识和意根就能完全理解和认可。</p><p>五、在五蕴活动的当下，尽量把各蕴功能体性都分开观察，才容易分析观察透彻。比如我们现在坐在这里聊天的时候，有色蕴在活动在运行；有受蕴也在运行，在六根上的感受可能都有；还有想蕴也在运行，六识在六尘上的执取和了知性可能都存在着；六根六识的造作可能都存在着，身体当中的行和心识的行也一直都存在着，五蕴都在活动运转，六识的识蕴也在不断的起分别作用。这样把各个蕴分开后，就要具体观行各个蕴是如何生起、变化和灭去的，细心体会其生灭变异性。</p><p>又比如当我们闭上眼睛回想一件事的时候，要观行一下，这时都有哪个蕴在参与，哪个界在参与，要分清楚。每个界都是什么，是如何显现的，每个蕴都在如何运行的。在回忆的时候，观察色身的运行，观察意识心的运行，除了眼识，其他的识心可能都在感知着，这些都要观察。在回忆的时候有色蕴等五蕴存在，身识和意识都有觉知和感受，你都要观行思惟清楚。</p><p>所有的觉受都以意识心为主，观行意识的生起与灭去，观行受蕴想蕴行蕴的变异，思惟其无常性、空性、苦性。在每个活动的当下，都要细心把五蕴分开观行，十八界也要分开观行；然后再综合起来，观行身心内外的生灭无常性。甚至还要观行前世、后世，上半生、后半生，以及具有善恶美丑性的所有的五蕴十八界的生灭无常性。</p><p>欲界众生都是五蕴同时存在运行的，除非入到深定中，灭掉六识，可以灭掉受蕴、想蕴和识蕴。无色界众生没有色身就没有色蕴，但有受想行识四蕴。欲界众生一般都是五蕴同时现起，六个识也同时出现，同时运作起用，不是从一个识的起用转移到另一个识的起用，不是跳来跳去的；而是六识同时存在，同时运作，各有各的识种子在流注，各有各的出生之处，不互相转移也不互相障碍。</p><p>比如眼睛看色时，眼识在分别色尘，同时耳识也听见了声音。这时意识心在干什么？意识心和眼识、耳识、鼻识、身识都在一起，共同分别色声香味触法。说话的时候，舌识能感知口腔里的味道，鼻识可以闻到周围的气味，六识都在运行，七、八识也在运行，八个识各作各的事业，互相配合而不会互相扰乱。</p><p> <strong>第六节  如何让意根了知无常</strong></p><p>一、我们身边每天都有无常的事情发生，尤其是现代信息如此发达，无常的信息更是不可胜数，可是为什么很多人都对这些无常信息，没有感慨，没有深思，几乎很平淡的就翻过去了？尤其是涉及到自身的无常，为什么也能看得惯，都能麻木而适应？如果一个人很容易适应无常，从来不深思，从来不反思，从来不受触动，那怎么能在无常中证得五阴无常非我呢？</p><p>辟支佛看见树叶掉落，就知道世间无常不可乐，立即出家到山中思惟无常法、因缘法，不再贪恋世俗。过去的外道也知道世间无常，而出家到山中修道，只是外道修行所依据的理论不正确，可是那个善根也不浅了。能舍世俗，在我们现代社会能有多少人？对无常法内心麻木、不敏锐的原因是什么？有没有贪恋世俗的原因，以至于认为无论发生什么，世间都是可爱可依恋的？有这个心，不容易看破无常，不容易断我见证果。</p><p>自己不能证果，要多找找自身原因，多观察一下，自己心里的思想观念，思惟习惯，到底存在什么问题。断我见证果，与自己内心深处的观念关系很大。明明是无常的，观察一下，认可五阴不是永恒的，不是我就完了嘛。多数人遇到无常，即使很痛苦，也能轻易的放过去，不深思，不反思，思想观念也不正确，定力也不足，导致一辈子在无常中无聊中度过，也能完全适应，丝毫不引起内心的触动，平平淡淡，稀里糊涂，这样怎么能生起智慧？</p><p>其实，我们是真的观察不出无常、不知道无常吗？意识很容易了知无常，也容易了知苦，了知空也不难，意识心也常常说无我。那为什么还不能断我见证果呢？很多认为一切法无常无我的人，即使别人承认他断我见证果了，他自己内心都不敢承认，为什么不敢承认？还是因为心虚，心里感觉自己的观点看法不踏实，没有实证，内心深处没有认可此理，他们自己也知道这点，所以不敢肯定自己，平时只是说说玩而已。</p><p>根本没有多少人意识心认为自己的五阴是恒常不变的，那为什么还不能断我见？因为无常的想法和看法，还没有深入到意根，意根并不知道五阴无常、一切法都无常，那就不能断我见，即使别人说他断我见，他自己也心虚不敢承认，没有证据，没有理由之故。</p><p>二、有空闲时，看看窗外的大树，或者自己画一个大树图，常常思惟树根以上五蕴七识的来龙去脉，各部分的相互关系，常作此观行，断我见和明心，就不是很难的。只要自己本身的因缘条件具足，任何一个法，都能促成自己证果和明心，法法都通向无我和无生，绝没有偏途。</p><p>小乘观行，心中要有这样一个概念和思想：生灭变化的不是我，不能常存的不是我，各种因缘聚合起来的不是我，被出生的不是我。这些观念牢牢树立起来以后，通过观行认清这些理，才能证果断我见。而这个观念、概念、思想的树立，任何人都帮不上忙，这是每个人自己心里的认知，其他人实在没办法。</p><p>就像老师教育学生说：这是黄色，具有如此如此的特征。至于学生心里是否能认这个黄色，是否准确把握了黄色的概念内涵，别人就没办法了。这需要自己亲自的思惟认知，自己消化这个概念含义，然后才能承认和记下这个黄色，然后就证得黄色了。观行五阴虚妄也是此理，必须自己想办法承认这个结论，如何承认？找证据，勤奋努力思惟观行，需要具足的条件都要达成，工具要完善，心力要足够，然后要有善思和巧慧，就能观行成就了。再比如说，老师教一个“大”字，把读音和含义、字形都教给学生了，学生是否能承担下来，是否能理解，那就是自己的事情了，别人没办法。</p><p>断我见，树立起一种正确的思想观念很重要，内心有一种牢固的观念，当遇见一个与观念不一致的事理出现，内心马上就能否决掉，不认它。那么生灭无常就非我的观念一旦树立起来，观察一切法，观察出生灭变化无常了以后，就能否认它的真实性，容易认可无我。改变思想观念是最难的，一旦改变，后续的成果不可思议。</p><p>三、每天晚上有时间时，观察电视荧屏上的人物和景色，观行各种人物五阴的活动是如何出现的，是不是各种因缘聚合而生成的，如何是生灭虚妄不实在的，如何是没有自性的，如何是没有我性的。不断的反复的深细的思考：屏幕上人物景色是如何出现的？</p><p>当把各种因缘都找出来以后，定心思惟，这些人物景色，缺少一个缘，就不能出现，不能有五阴活动。五阴是依赖各种缘才能存在，一个缘灭去，五阴就灭去，那么五阴是多么的不真实不可靠。思惟时要深细，要少于分析，要深入，多体会，各种因缘数据找齐，再交给意根去认定和审核，剩下的工作几乎都是意根的，由意根来作。只要静静的、深深的悬挂着这些内容，有朝一日，就会豁然开朗，同时就能认定自己和他人的五阴活动，都是同样的虚妄不实，没有自主性，不是真我。</p><p>有一些人差只差在意根认定上，法义已经了然于意识心中，这不太难，难在意根认定上。由于缺少禅定，意根没有深思，所有的思想观念都浮于意识表面，没有深入意根，意根无法认定，心中对无我之义没底。这是断我见的瓶颈，应该想办法突破。</p><p>定力不足的原因，一是没时间修定，二是福德不足，三是戒律不完备，还有一些其他小原因，自己找出来，一一都克服，则断我见就会大功告成，还有更大的功德需要去完成。</p><p> <strong>第七节  意根也要与意识同时断我见</strong></p><p>一、断我见是断知见上的烦恼惑，也就是见惑。见惑是见道时所断的知见上的烦恼，也就是断除不正确的知见，主要包括六七识的错误知见和观点；思惑是修道时所断的思想观念上的烦恼，也就是贪嗔痴慢等等烦恼惑。</p><p>见惑在证初果时断，思惑是在三果和四果时断，也就是说在证得初禅以后才能开始断。断除贪爱和嗔恚是三果人，断除一念无明愚痴我执是四果人。那么意根的我见，也是见惑，属于知见上的烦恼惑，应该在初次见道时断；意根的思惑烦恼应该在二果时降伏，在三果时开始断除，断尽是四果人，相当于八地菩萨。</p><p>初果断我见，一定包括意根的我见，如果不包括意根的我见，证初果是非常容易的事。而事实并不容易，很多人学一辈子阿含经，也不能证得初果；其实很多人的意识也都明白一切法都是虚妄的，如梦幻泡影，可就是不能断我见，不能成为初果人。</p><p>意识心的我见容易断除，因为慧强，闻法即能思惟观行，容易破除我见和无明；意根就比较困难，因为意根的我见和无明根深蒂固，意根的智慧又弱，不能很快理解所接触的法义，必须依靠意识的思惟力，需要意识提供一些资料和数据，供祂参考，意根才能思量确认无我之理，从而断除我见。</p><p>二、断我见，同时断三缚结：我见、戒禁取见、疑见。断除三缚结，就保证未来世永远不下三恶道。如果只是意识断我见就行了，那么意识能否把三缚结断除？三缚结是绑缚意识还是绑缚意根的，还是都绑缚？断除生死结缚是由意识决定的吗？意识对生死大事能作主吗？无始劫以来的结缚，是意根的还是意识的，意识能给斩断吗？意识能作主断除三缚结吗？</p><p>无始劫以来的生死结缚主要是指意根的结，三缚结主要是绑缚意根的。因为意根生生世世不灭，与业力相应，随着业力流转于六道。意识只能存在一世，并不能作主出生下一世的五阴身。意识让五阴身改变一点点都不可能，在六尘上也作不得一点的主，让脚抬一抬都做不到，告诉自己玻璃栈道是安全的，往前走吧，腿就是抬不起来，那意识怎么能够作主断除无始劫以来的生死结缚呢？</p><p>意根在任何一个法上都要作主，不可能在断我见这样无始劫以来的重大问题上就不作主了；如果意根不作主的，就是假断我见，不是真断我见。凡是只有意识的表面主张，意根不主张而勉强随顺的，都是假，犹如演戏；只有深层次的意根主张的，发自内心的主张，才是真。</p><p>所以世人的言行就分为真假两种，哭就有真哭和假哭的区别，笑就有真笑和假笑的区别，害怕就要真害怕和假害怕的区别，关心人就有真关心和假关心的区别，生气就有真生气和假生气的区别，仇恨就有真恨和假恨的区别等等。因为世人的言行有真有假，所以互相交往都互相猜疑和提防，需要摸清对方的真实想法和用心，不敢轻易相信对方，也因此故，世人都觉与人打交道很累心，稍微不小心，就被人欺骗和算计了，世人的尔虞我诈就是如此。</p><p>三、在佛法的修证上，同样分为真有修证和假有修证之分，断我见就分为真断我见和假断我见的区别，明心就分为真明心和假明心的区别。真真假假充满了世俗生活和佛教的修行中，让人不容易辨别。凡是假的，都是意识表面的，也可以说是装的，是做作的。凡是真的，都是与意根深层次相应的，是意根认可的，是从内心深处流露出来的，是发自肺腑的，是不做作的，是让人信任的，是诚实无欺的。</p><p>如果断我见仅仅是意识断我见，意根不断我见，那么意根就没有断除三缚结，那就不能保证不入三恶道。因为是否入三恶道由业种和业力决定的，意根与业种和业力相应，意根没有断除三缚结，业种就没有改变，命终由于业力牵引就要入三恶道，这是没有办法的，意识心一点办法也没有，因为不能作主，又是断灭的，断除以后的事情更是不能作主。所以只修意识根本没有用处，只有意识断我见，不能解决生死问题和不下三恶道的问题。</p><p>退一步来说，意识能决定不下三恶道，那么临终时，意识先灭了，只有意根和如来藏，没有意识存在了，可是还有意根和业力，意识不能与业种业力相应，去三恶道与不去三恶道，意识就完全决定不了了，就连意识自己的存在与否也决定不了，如何能决定不去三恶道。观察意根在中阴身里的表现就知道了，意根在中阴身里是完全与自己的烦恼习气相应的，都要随着自己的烦恼习气的现行，而去投胎。</p><p>如果意根没有断我见，意识灭后，意根与业种相应，与业力相应，就会被业力驱使入到三恶道中。如果这时意根没有断我见，没有断除三缚结，意根的心行还与三恶道相应，没有解除绳索，一定要被牵引下三恶道。如果下地狱，不经过中阴身，意根和如来藏直接进入地狱身。</p><p>四、生死轮回和三恶道的轮回，是因为意根的无明造成的。意根的无明没有破除，就有十二因缘的生死链条，众生就被意根的无明捆绑在六道里，不能出离，被捆绑在三恶道里，也不能出离。无始劫以前，意根因为无明，不知本我和真我，不知法界实相，不知守本真心，起心向外贪求，遂有五阴身虚受生死轮回苦；意根因为无明，内心妄动，于是如来藏随顺意根，就出生了宇宙器世间，出生了众生的五阴身，三界世间法就出现了。众生在三界里生死轮回了无量劫，至今没有结束，就是因为意根的无明，因为意根的结缚。修行就是要断除意根的种种结缚、种种无明，才能不被无明所绑缚，脱离种种生死的系缚，获得解脱。</p><p>那么断我见一定要断除意根的我见，之后才能淡薄自己的贪嗔痴烦恼，再之后，才能断除贪嗔痴烦恼，最后才能断除意根的我执。如果初果没有断除意根的我见，就没有二果的薄贪嗔痴，没有三果的贪欲和嗔恚的断除，更没有四果的贪嗔痴慢烦恼断尽，没有我执断尽之说。由此看来，意根的我见是在初果时就断除了，四果时才能断除我执，这个修行思路我们都应该明确下来。</p><p>五、意根如果没有断我执，就不能消失灭亡。指挥身体活动的是意根的功能，意识如果想指挥身体，需要意根同意，再由意根下命令，六识才能动，六识一动，身体才能动。六识不出生，不活动，身体就不能动。</p><p>意根由于把身体当作自己，无始劫来就一直抓取不放，如果身体不由自己来控制和掌握，意根就觉得失去了自我，因此感到莫名的恐惧。所以断我见，一定要意根来断我见，意根断我见才是真正的断我见，当然彻底究竟断我见的人是佛世尊，四果俱解脱的大阿罗汉也没有彻底究竟断我见。</p><p> <strong>第八节  不能断我见的原因</strong></p><p>不能断我见的原因，其中一个是因为前期的意识，没有把五蕴虚妄的内涵思惟透彻，交给意根的资料不全，意根对此内容模糊不清，无法参究，意识可能也不知道资料不全，不会思惟和收集证据，意根巧妇就难为无米之炊。再加上意根的攀缘心没有降伏，禅定力不足，因此就没有参究成就。很多人也没有开始参究，因为前期的意识没有把工作做好，意根无法接续工作。</p><p>意根是裁判者，是检验者，是把关者，意识所有思惟分析的数据，都要经由意根的检验，即使分析得再细致入微，再精确精准，意根也得把关检查才能放行认可。比如下属的工作人员，做好了一项工作，交给领导审批，领导不能不看一遍、检查一遍、审核一遍，就定为合格发薪水，最少要过目一遍，严格的话，要审核一段时间，作以调查，确信无误了，才能盖章。意识与意根的关系就是如此。</p></div>"
},{
    "title": "第七章　断我见与意根的关系（2）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　断我见与意根的关系（1）</strong></p><p><strong>第九节  意识如何紧密配合意根断我见</strong><br/></p><p>一、在断我见时，意识首先要给足意根所有的证据和数据，然后意识少于思惟，少于功用，配合意根的心理活动需要，放手让意根自己思量和考量，让祂自己印证一些事实。如果意根觉得事实还不充分，证据还不足，数据还不够，那么意识再思惟观行，再收集数据交给意根，意根再深深的思量和考量，这样意识在旁边不断的补充一些数据资料，意根就能不断的加工，不断的完善思惟，最后得出一个扎扎实实的、证据确凿的结论出来，就证果了。</p><p>如果需要处理的事情比较多，意识必须出定了别六尘，那么意根也可以暗暗的用功，行住坐卧不离参究，乃至于晚上有梦无梦时都可以用功。意根实在感觉事情重大时，可以决定废寝忘食，不眠不食，因为意根要精进了，这些饮食活动影响意根的专心思虑，祂会分神于日常琐碎，就会决定减少五阴其他活动，以保证自己不分神。睡觉时没有意识的从旁佐助，意根就没有充分的数据和材料，无法下手参究，于是意根就决定不睡觉，不让意识灭去。</p><p>二、在一切法的参究上，一开始是意根配合意识的思惟分析，配合意识搜集各种数据和资料；等到意识把资料搜集的比较充分，足够意根利用的时候，意识就要配合意根的深思熟虑，配合意根的加工和整合工作，配合意根的审察过滤工作，让意根多费心思，意识少活跃，参究工作就能很快完成。</p><p>要想让意识少于活跃的思惟，意根多思量，就要修定，在定中才能保证意根的专心参究，虽然祂不能完全定于一处，能定于极少数法上就可以了，除了需要专心参究的法义，其他的只是稍稍了别一下就可以，不影响自己参究。那么观行就是要在定中，意识不能情思意解，多动用意根的思量性，充分有效的发挥意根的思量，亲自证得五蕴无我，这就是观行和参禅的奥秘。所以意根不证法，不可能明心证悟，同样也不可能断我见。在定中参禅观行，动用意识思惟要少，动用意根的思量性要多，这是参禅观行的奥秘。</p><p>没有意识的配合和协助，意根也能参究和思量法义，只是需要的时间要长一些，说不定是什么时候了。有事例为证。比如晚上思考一个问题，没有解决就睡着了。睡了一夜觉以后，第二天眼睛刚刚睁开，灵感就现前，突然明白了没有解决的这个问题。说明这一夜，意根都在工作着思量着。晚上睡前留了个疑问给意根，早上一醒来就得到答案了，有不少人有此类似的经验。</p><p>再比如有时候思惟过的问题，当时可能没得到答案，于是就去忙其他的事情，表面上好像把这件事忘了，意识不再考虑了，然后指不定在什么时候，脑子里突然有了答案，这是意根一直在背后默默的思量，最后思量出了结果。修行就是要多用意根，意根的修行才是真修行，才能证得一切法，获得一切智慧。</p><p>意识在观行五蕴时，观行的信息同时就传递到意根那里，意根一次不懂，二次不懂，时间长了，就能理解和受熏，同意意识观行的结果，这是意根启动自己特有的思量判断性的结果。如果有禅定时，意根也能根据意识观行思惟的思路，自己作以思量，或者与意识一起，或者单独思量，意识熏染得越深刻，意根越能单独进行思量，从而与意识一起共同断除我见，共同证果。</p><p>三、在观行陷于沉思的时候，里面就有意根的深思行为；来回踱步思考时，有意识的思惟，更有意根的思虑考量。其中如果意识的力量大，意根的力量就小；如果意识少用心思，意根的力量就大，解决问题也有力度。</p><p>意识与意根的交流方式一般是用自问自答的方式。不管是谁问谁答，最后都是意根认可赞同，意根作最后的定夺和抉择，问题才算解决。</p><p>观行五蕴、参话头和参禅、参究，都与自问自答是一个原理，都是两个识之间密切配合的关系。意识存在时，两个识刹那都没有分离过，意识所思所想都受意根指挥，从来没有脱离过意根的操控和配合，从来没有出现过意识单独思惟，意根不参与的情况，如果意根不参与，意识就灭去不存在，意识不能脱离意根单独运行；而在没有意识存在和思惟的时候，意根仍然可以单独工作，从来没有休息过，遍计所执，时时思量处处作主，即使在睡着和昏迷以及死亡前后，意根也没有清闲过。所以两个识如果没有密切配合关系，不可能破参开悟，不能断我见；如果没有意识的参与，就没有数据资料，不知道详细情节，证据就不足；如果意根不参与思量，其结果就是有问无答，那就没有答案，没有结果，就作为一个不解的问题存留在意根心中，以待意根慢慢解决，这就说不定是什么时候了。</p><p>四、用自我暗示法观行佛法时，意识常常要暗示意根，五蕴虚妄，一切法虚妄，都是如来藏的功能作用，到一定时候，意根就会认可，就能断我见，从而发挥自己的潜能，改变自己。这种暗示，类似于自我催眠，把自己调整到比较安静和沉静的状态，能听到内心声音的状态，这时就可以自我暗示了。</p><p>把以上断我见的内容，慢慢的抑扬顿挫的陈述出来，引导意根接受，并且给意根一定的缓冲时间，让意根接受信息，整理思路，思惟信息里的法义。这需要一定的时间，和特定的环境场景，就是让意根不关注其他问题，只注重被引导的内容，内心要沉静和安稳、祥和，能够充分的接受意识的引导。如果意识能引导到哪里，意根就能思惟到哪里，这时意根是比较听话的，已经初步被熏染了，只是没有最后成功。关键在于意识是否会观察意根的反应，是否有引导的经验，是否真懂无我之理了。这样的引导催眠可以在合适的时间场景中反复多次进行，只要意识理论娴熟，会观察意根，会引导意根，能保持沉稳和沉静状态，到一定时日，必能断我见。</p><p>五、西方心理学家说过，让潜意识记住东西的最佳途径，就是进入一种昏睡的朦胧状态，或者一个类似睡眠的状态。在这种状态下，所有意识层面的努力都减少到最低限度。然后，所有想法都能够通过映像，以一种安静的、被动的、易于接受的方式传送到潜意识中。</p><p>这是熏染意根催眠意根的好方法，断我见，降伏烦恼，可以用自我催眠这个方法，可能也是最快速而有效的方法。自我催眠，能直接让意根了别和接受五阴无我性。</p><p>放松，安静，昏昏欲睡，刚刚醒过来，这些时候都有定，心不散乱；同时还有意识，意识思惟力比较微弱，有了别作用，作用力小，能观察意根，能向意根传递信息；而且意根的作用比平时突出，比平时大。那么这时影响说服熏染意根，改变意根，是最佳的时机。断我见的观行，在这种状态下，也是最好的，有定，有意识，意根作用力大，受影响的力也大，那就能把五阴非我的思想观念，传递灌输给意根，让意根认可接受。</p><p>六、怎样观行能取所取空断我见</p><p>能取的是五阴七识，所取的是六尘万法，观察能所空要在定力比较好的情况下才能观行思惟。前提条件是，第一，禅定要具足，第二，五阴虚妄的道理要粗略的了解，再按照所了解的内容，次第观行思惟，把能取的七识心的虚妄观行出来，要观察清楚透彻。内心要认可六识的虚妄非我性，把所取的六尘万法观察清楚透彻，包括五阴世间法，都要观行出其虚妄、生灭、变异、不实性。六尘的虚妄容易观行，杂阿含经里，世尊教导过如何观行六尘的虚妄，边阅读边思惟六尘是如何的虚妄，一条条逐个思惟观行。随文而观，随文而思惟，思惟通透了，就能认可那些道理。不思惟不观行，意识只粗浅的知道那些道理并没有用。观行出来时，内心就会说：哦，原来如此！这是意根认可了。</p><p>观行总有个过程，到最后内心会说：原来是这样啊！这时是真知道了，这是意根的认可，否则就是意识心的肤浅的知，意识的知往往没有多大用处。道理很多人都会说，实际上自己的内心并不认可，因为这些道理意根不懂不明白。意根要明白要懂，意识心就得思惟观行这些理论的内容，观行的过程就是在潜移默化的影响意根，告诉意根：是这么回事。意识分析的每个内容都传递给了意根，意根就能了知这些内容，就能明理；意识不观行不思惟，意根不知道，就不能断我见。</p><p><strong>第十节  意根现量证的表现</strong><br/></p><p>一、一切法的证得，应该都是现观的结果，而不是想象和分析得出的结论。什么叫作现观？现观就是现量观行、现前观行，六根对六尘的当下，现前观察体验各种法的出生、运行和生灭变化。意识是否是现量观察，思考得出的结论是否是事实，意根要不断的作出判断，但有时判断正确，有时判断错误，因为意根也有自己的习气，再加上智慧不足，就容易判断错误。意根往往是承认意识的现量观察和充分的思考分析，有理有据时，才能启发意根的智慧，意根才能确认其思惟观行的结果；而不承认意识的非量想象和推论；意识的现量观察就是证据，当证据确凿时，意根才拍板加以赞同。</p><p>意根的现量证，往往是要促使身心发生轻重不同程度的变化，因为意根与身心不相分离，紧密联系在一起。为什么意根与身心联系非常紧密呢？因为第八识能变现一切法，也能见一切法，而意根依第八识的见分，也能随着见一切法，并且把这些法当作真实，当作是我见，不断的攀缘，执著不已；同时意根就能在一切法上起作用，而能协调和控制身心世界，通过身心来宣泄自己的种种情绪，让身心世界发生各种变化。这就是意根的遍计所执性和时时处处作主性的表现，也是我执和法执的表现。</p><p>意根如果能现量的知道了某种道理，认可了某种道理，就是我们常说的从心里往外的承认，就能让身心发生各种程度的变化，这是因为身口意行是由意根控制和决定造作的，由意根说了算。即使在没有证果，与证果相距很远的情况下，意根一旦接触到某个事理，认可并深肯此理，内心就受触动，于是身心就发生变化。比如心情舒畅、身心轻安、热泪盈眶、浑身战栗、汗毛直竖、情绪激动、头皮发麻、面红耳赤、眼神呆滞、头中嗡嗡作响、热血沸腾、心惊胆战、呼吸急促、青筋暴跳、气急败坏等等诸多情况，这是触动到意根，意根现量知，而后促使身根发生了或大或小的变化。每个人都有此经验，自己回想一下，就知道是否是这么回事。</p><p>这些情况的出现，并不说明意根降伏了烦恼或者是断除烦恼了，更多时候还恰恰说明了意根的烦恼性很重，我执情执很重，才会出现这些身心的巨大反应。真正现量证得无我时也是如此，身心出现很大变化，由于意根从前不知此理，意识无论怎样念叨无我，意根也不知不认可无我，内心无动于衷，做起事情来仍然我我我，这显然是没有断我见之人的表现，意根一旦知道了确实无我，受到了触动，那么祂对身心的执著就放松，身心就出现变化，轻安而愉悦。</p><p>意根也受意识的不正思惟影响和熏染，作出错误的抉择。无始劫以来意识一直在有意无意的欺骗意根，告诉意根五阴就是我，一切法都是我的，五阴世间美好快乐，都应该追求不舍，意识充当着邪师的角色，于是意根贪染于世俗五欲，执著五阴自己。断我见前后，意识就开始充当意根的良师益友，自己改邪归正以后，再帮助意根改邪归正，共同降伏烦恼、断除无明，共同转识成智，携手并进。</p><p>二、意根现量证得，身心受到的震动很大，会出现很多异常现象，禅定加深、睡眠改变、身体轻安、病痛消退、精神愉悦等等，越是现量，变化越大，越是解悟，越是没有变化。过去善根深厚，有深禅定的人，现量证得佛法，就会身体涌上虚空，神通现前，这是属于色身上的巨大变化。看看佛经里记载的那些圣贤人悟道，不管是大乘，还是小乘，都有神异现象发生，为什么如此？因为有禅定，是现量证，身心改变都极大。</p><p>三、有些人看到某种法义，内心受到了很大震动，色身出现了一些不同寻常的现象，这是震动到了意根，才有这些感触。即使是在世俗法里的实证，也一定有或大或小的身心感触和变动，不是平平淡淡的划过去就算了。已经有不少人在遇见某种法义时，在修证的过程中，都有身心的大小程度不同的变化，真认得某种理时，就是这样。</p><p>平平淡淡的不与意根相应，只是意识心的理解，那不算数。学法时，像读课文一样滑过去，就认为自己理解了，知道了，证得了，于是就放过自己，这是对自己的高度不负责任。如果这样容易，三藏十二部看几遍，理解一部分，就说是证得了一部分，那简直就相当了不得了，八地以上菩萨也许能这样。把佛经拿过来，博士生博士后，也觉得能懂文字，如果懂就能证得，那佛法就太容易了，根本不用修三个无量劫。</p><p>定力不足，看文章就像走马观花一样；定力足时，心里那个认知度就非同小可了，足以震动心脏，震动五脏六腑，感觉非常不寻常。有些人走马观花看一遍文章，不能细致思惟，就贸然否定，结果最后还是自己错了。错在哪里？没有定力，不能思惟观行，心思太浮浅，即使引导，也仍然不能观行，智慧不可能逐渐提升，不能日日增进。前世善根不足的人，看什么法也不会受惊吓，平平淡淡的就过去了，好像真懂了一样。</p><p>有定力时，思惟细致，才能受触动，这叫作深有感触。看看我们古老的华夏文化内涵多么丰富，用词多么准确，把身心状态都能描述得清清楚楚、透透彻彻。都有一定的科学依据，有生理学依据。佛法并不孤立，就看大众是否有智慧如实认知。深有感触的深，就是深入到意根深处了，不是浮浅的表面的意识思惟，才有感触。一般性的思惟，没有感触，不会有感慨，更不会感慨万千。</p><p><strong>第十一节  理解和证得之间的距离</strong><br/></p><p>一、看恐怖片时，意识明知是假的，可还是要害怕；走玻璃栈道时，意识明知是安全的，但内心还是害怕得不得了，有的人甚至就是不敢抬腿走。意识就是说服不了自已不害怕，为什么？是因为意识分别和思惟得出的结论，得不到意根的认可。意识劝自已不要害怕，说这一切都是假的，可还是血压升高、心跳加快、身上出汗，这说明身体都是由意根来控制的。</p><p>尤其是看球幕电影时，意识知道一切影像都在屏幕上，根本出不来，影像不是现实的，可心里感觉影像还是那样的逼真，害怕里面的车开到自己身上，害怕里面的飞刀砍到自己，子弹打到自己身上，于是身体就不自觉的尽量躲避。身体和心理的行为，都是由意根指挥造作的结果，是意根按照自己的惯性认知来指挥识心作出相应的反应。所以不把意根熏成功，就不能解决实际问题。</p><p>知道栈道是安全的，是不是自己的现量认知？这种知道有什么用处？意识明明知道前边的人已经悠闲的走过去了，有了现成的例子，自己为什么还不敢站起来走过去？意识明明知道玻璃的厚度和承载力都很牢靠，自己为什么就不能站起来，身体笔直的走过去？因为意识分析思惟的理，意根还没有接受，内心对于玻璃栈道还有恐惧心理，因此就让身体表现为战战兢兢、脚底酸涩、腿肚子发抖、哆哆嗦嗦，以至于蜷缩在通道上，不能挪动一步。</p><p>有的人站在玻璃桥外时，种种言论，大谈特谈，走上玻璃轨道，试试如何？身根是不是受意根控制指挥的，这里就能看得一清二楚。意识不能指挥身体，不管意识如何认为安全也没有用，意根不知道，那就照样惊恐万状，惶恐不安，都是因为意根严重执身而造成的。</p><p>由此看来，意识知道六尘是自己的内相分，有没有用？不用功观行，五阴虚妄就不能真正证得。知道和理解是很容易的，证得就很困难了。小乘四个果位的证得，都涉及到了身心觉受，大乘各个果位的证得，也都涉及到了身心的觉受，包括梦境的证明和提示。尤其是各种禅定的出现，更是涉及到了身心的觉受，禅定越深，觉受越强烈。二禅以上则无觉，五识消失。但是色身也要发生很大变化，出定后还是有身心的觉受。为什么有这些觉受的出现呢？是因为意根现量证得了佛法，知道了事实真相，身心就出现变化，是意根执持和调控的结果。</p><p>意根相信现量境，需要自己亲自证知，他人的证明没有用，必须自己能现量证得，真真切切的知道。佛法的证得也是如此，否则说食不饱，自欺欺人。很多人都知道五阴虚妄，可内心深处的意根还是认为五阴真实，对于意识的分析思惟结果不能赞同和执行，仍然要牢牢的执我不放。因此就需要意识必须认真思索，细致观行再观行，直到把意根说通，才是现量境现前，否则仅仅是个推理罢了。</p><p>如何让自己不胆战心惊的走过玻璃栈道？应该这样做，在走上栈道之前，意识就要想方设法、非常全面的分析思惟栈道的安全性，尽量思惟透彻，比量现量非量都思惟清楚了，有理有据的证明玻璃栈道确实是安全的，没有一丝危险，这样意根就能确认栈道是安全的，心里就能有底气，于是就能鼓足勇气走过栈道。意识分析透彻，看破境界，让意根放心，心理才能得安稳。内心感觉很安全，底气足了，思想准备都做好了，感觉再也不害怕了，这就把意根说服了，然后再抬腿上路。怎么样才能做到内心里底气足足的？靠意识思惟分析透彻，看准了，看稳了，十拿九稳了，再行动。意识思惟分析透彻了，意根才能确认，才能表现为镇静，踏实，才能大胆的走过去。</p><p>这个问题与观行断我见的道理是一样的，断我见也是如此，意识必须思惟分析透彻，一个漏洞都不要有，让意根完完全全认可，没有疑惑，才能断我见。观行断我见，意识要想方设法思惟、观行五蕴十八界的虚妄不真实性，把意根熏染成功，让意根从内心里确认五蕴确实不是我。这时意根的底气才足，任何人说五蕴是真实的，意根都不随着那样想，不加以认同。要做到这点，需要意识自己首先要明理，要思惟清楚，还要给意根一段适应和确认的时间，让意根适应五蕴确实不是我，不是真实的。</p><p>在刚刚接触这个理论，刚刚开始思惟时，有的人心里确实感到害怕，感到六神无主，感觉没有了依靠，感到内心空虚和恐惧，这是因为意根无始劫以来一直牢牢的认为五蕴就是我，就是真实的，现在意识告诉祂不是这样，意根无论如何也难承受，所以心里会害怕和难受。只有通过意识的不断熏染，时间长了，意根接受了以后，这种感受就慢慢消失了。想要意根心理准备充足，就需要意识反反复复不断的熏染，不断的强化无我的思想观念，终有一天，就能真正而彻底的断我见。</p><p>如果只是意识知道五阴身及一切法是虚妄的，可意根还不知道，不认可，那就没有什么用处，只是一种浮浅的理解，不是真正的断我见。初果至四果之间，意根要不断的认可五蕴生灭无常虚妄无我，完全认可时，意根就断尽对五蕴世间的执著性，就有能力出离生死轮回。</p><p>意根完全断尽执著，证得四果时，就像看球幕电影时一样，无论球幕上发生什么事情，出现什么境界，内心都若无其事，不躲不迎。意根不再指挥身体躲避什么，内心知道境界都是不真实的，都在屏幕上，不是现实的，也就不再害怕了。从这里可以看出，众生的心理，有表面浮浅的作用，也有暗藏隐藏的作用；而起决定作用的，还是那股隐藏着的力量，那是根深蒂固、难于转化、难以说服的，那就是意根的惯性力量。改变这股惯性力量，就显得极其重要，就能解决无量劫来的生死大问题，包括分段生死和变易生死，那也就能断除无始劫以来的无明惑业苦，登上涅槃的彼岸。</p><p>意根断尽对五蕴的执著，在小乘是四果罗汉，在大乘是七地满心，进入八地时。八地菩萨的解脱证量相当于四果俱解脱的大阿罗汉，初地满心相当于慧解脱的阿罗汉，但是初地菩萨不取慧解脱阿罗汉的果位，思惑烦恼不可以全部断尽。意根断尽人我执的境界，我们可以比量和想象推理知道一些，虽然没有证得。那么意根断尽法我执，我们可以比量非量的思惟一下，也能知道个大概，虽然更不能证得。这个知道和证得，可能就要相差接近两个无量劫和三个无量数劫。知道和证得之间的距离，简直不可想象。</p><p>有的人总是以知道一些事情，就自傲自满，其实那都没什么，即使真正证得了很高深的佛法，也不值得自傲自满。放眼十方世界和过去未来现在三世来看，即使我们修到了八地菩萨的境界，仍然不算什么，智慧短浅见识少的人，才容易生起自傲自满心，慢心才深重。有头脑有智慧，见多识广的人，不容易生起慢心，因为见过或者知道有无数人比自己优异无数倍，眼界是非常开阔的。</p><p>二、解悟与证悟的区别</p><p>真正的断我见，不仅是意识明了无我之理，意根也同时证得无我，认可无我之理，意根能亲自证明无我，就不太执取自我，那么身心内外就全部放松下来，顿时得到了解脱的功德受用。如果仅仅是理论上的断我见，只是意识理解的，证据不充分，没有说服力，一点解脱的功德受用也没有，身心世界不会转变，因为意根没有亲自证得，没有亲证，就不是现量境界。</p><p>明心证得如来藏，也是意根的现量境界，意根亲自证得后知道五蕴十八界不是我，就能把自我放松，身心世界就会大转变，得到了解脱的功德受用，无比自在。否则意识的理解，就是理论，最多是一个解悟，也许根本谈不到什么解悟，与生死了不相干，不得解脱的功德受用。因为意根没有现量观察到，没有亲自证得，心里不认可，身心就不会转变。身心世界是由意根统治和执取的，由意根说了算。</p><p>在断我见和明心的时候，如果身心世界当时及以后，没有什么变化，那就是理论上的断我见和明心，意根不认可。明心一方面是意识心的觉悟，这个觉悟不是理解的，而是有理有据，证据确凿，这就是现量境界，这样意根也同时证。意根认同现量境，祂同时证得时，就知道五蕴本来是如来藏的，不是自己的，于是就把五蕴放松，不控制身体了，顿时身体就轻安舒适，心里非常清明，当时身心就发生变化，与从前不同了，定力越好，变化越大，烦恼越轻微，觉受越好，语言无法完全描述出来。</p><p>如果是单纯的意识心理解，证据不充分，猜测的成分多，想象的成分多，不是现量境，就说服不了意根，祂不知道五蕴是如来藏的，不知道五蕴不是自己的，那就还会把五蕴当作自己的而执著和控制，身体就没有什么转变，心里也没有什么转变，不会出现心灵的震动，与从前没有什么差别，这就是解悟的状态。</p><p>解悟时意根还会把持着身体和觉知心，身体就不会发生变化，觉知心也不会发生变化，还会与从前一样，烦恼照样烦恼。五蕴的变化由意根控制和决定，真正的断我见和明心时，意根明理，不再控制身体，知道身体不是自己的，身体就有解脱的反应，意根也不再控制觉知心，知道不是自己的，觉知心就如释重负，出现各种殊胜境界。睡眠是由意根控制的，以后睡眠也改变了，烦恼由意根发起的，这时烦恼也轻微了，还有很多奇妙的境界，只是不能一一透露。</p><p>现量观察远远比理论更有说服力，能现量观察的人，既有禅定又有智慧，而理论未必正确，即使正确也与自己无关。现量观察，意根能证得，意根肯定，就能改变身心世界，才能得到身心解脱的功德受用。意根一旦肯定，就不需要那些无用的理论了。我们学法不仅仅要学理论，还要实际观察，现量观察，亲自证得理论的正确性，那么理论就会成为我们自己的现量境界，内心时刻与理论相应，理事无碍，以后就会事事无碍，就是大解脱。只有理论知识，不能让我们解脱，请诸位记住这一点。</p><p>三、问：断我见是意识反复深入如理作意的观行，由意识为意根举证五阴如何的虚妄，最后由意根首肯。这是一个举证、说服、再举证、再说服的循环过程。意识将观行的证据都逐渐的呈送给意根，最后由意根首肯认可。这个认可也是相应吗？断我见也是一种与意根相应否？ 首肯的含义和相应有什么区别？</p><p>答：通过意识的反复深细的思惟观行，把所有的证据依据全部而逐渐的呈现给意根，证据确凿时，意根就能确认和认可。这个认可就表示意根醒悟了，与五阴无我之理相应了，证据越充分，呈现的现量境越多，意根越认可和相应，因为意根承认现量境，与非量的想象不相应，意根只要证据。当意根与无我之理相应时，就会认为：哦！原来如此。因为意根不知道自己五阴的一切法都是虚幻的，现在证据都摆在面前，不得不承认此理。从前都是意识或多或少的知道一些无我之理，可是意根不知道，因为慧浅，了别境界能力不足，不能深细思惟。</p><p>意识的分析思惟理解的内容属于解悟，这是因为定力不太好，没有深入到意根，意根不明理；如果定力好，意识的思惟就能深入，少于表面肤浅的理解，意识动得慢，就能调动意根的力量，让意根的思量性起用；那么意根自己明白了，意识肯定就明白了。定浅意识分析成分多时，意识虽然容易明白，但是呈现给意根的证据不足，意根自己的思量性也不足，意根就不明理。</p><p>意识少于分析用心，交给意根多用心，多思量，就能证悟五阴无我。意根确认的这个力量是非常大的，能改变自心，改变身口意行，改变业行，改变业种。这样修行是走大捷径。想要意根多用心，现量证得，就要深入禅定，意识少动，这就是参究的原理。古来禅师都是这样教导学人离心意识参禅，不要分析，不要情思意解，可是其中深深的道理他们不一定懂，不知道这是意根的功用，与意根相应，因为意根的运作属于唯识种智的范围，很多禅师并没有生起唯识种智。</p><p>所以断我见的原理也与参禅的原理是一样的，也利用意根，让意根暗自用功思量五阴无我性，意识在定中思惟深细，动得慢和深，这样就能深入意根，然后才能与无我性相应。把意根的所有功能体性作用都挖掘出来，修行就是大捷径，而且是最大的捷径，我们就能跳跃性修行，成佛就非常快速了。</p><p>四、问：断我见是意根对五蕴虚妄认可的结果；开悟明心，是意根对自己虚妄认可的结果，对否？</p><p>答：断我见证果是意根对五蕴十八界非我的认可，里面包括意根自身，证得意根自己也是生灭非我的。开悟明心时，意根不仅认可五蕴虚妄非我，不是真实的，同时也证得了如来藏，知道如来藏是真实的自己，意根自己不是真实的。意根这时是找到了真正的主人，不再认自己为主人，自己能稍微退一退，但是烦恼习气可能都还在，只是比之前轻微一些。意根知道了如来藏是真正的我，五阴身都是如来藏现起的，都是如来藏的功能作用以后，慢慢不再把如来藏的功能作用据为己有了，渐渐对自我的执著就轻微了，以后不仅能断我执，也能断法执，二执断尽，圆满成佛。</p><p>五、问：证果和明心时的相应，到底是个物理结果，还是化学结果？断我见，是意根对五蕴虚妄的认可，这个认可如何量度？开悟明心也与意根相关，意根一面实证自己不是真实的；另一面实证了如来藏是真实的。五蕴虚妄与意根虚妄，是个递进，一个否定，进而否定又被否定，那个真我任谁都无法否定。这样思考路线对吗？断我见，有身心的相应变化，这个身心的变化就是断我见‘相应’的量度？    </p><p>答：相应，主要是心的相应，那到底是物理还是化学结果？因为这时是相应到了识心，识心的认知改变，认为五蕴非我，如来藏真实；心又与身相通，二者紧密相连，也就间接的相应到了身；相应到了身，就有物理和化学结果。因为是意根认可五蕴非我之理，意根又能控制身心，身心转变，就涉及到了物理化学成分的转变。色身就出现轻安、舒适、睡眠少、内心喜悦、一心、无烦恼、无杂念、觉明现起、禅定增长等等一系列身心改变状态，持续时间比较长一些，几个月、半年、一年，定力好的要超过一年。</p><p>如果不是意根证得无我，意根不相应，只是意识肤浅的知道一些无我之理，不深透，那就没有这些身心上的反应，没有身心的变化，或者只有一点点的些微变化，很快就消失不见了，定力很难生起。这是因为意根不相应无我之理，内心没有震动，不能让身心发生变化，不能改变身心，与从前差不多状态。很多人说自己断我见了，可是身心没有什么觉受，没有变化，禅定没有现起，觉明没有，只是一些理论。可是这些理论在哪里都能找得到，这就很奇怪了。以前我一直苦于无法检验他人是否断我见，后来观行到了意根的运作，又结合自己当时的身心觉受和状态，就逐渐总结出了真正断我见的状态，应该如何检验。</p><p>对于开悟明心，也应该有个量度，不能简单的说智慧增长就可以了，肯定应该也有身心的变化，还有如何增长，增长到什么程度的问题。明心见性比较容易检验，因为有个如来藏在哪里，在何处运行，如何运行的标的。但是每个人检验的尺度也不同，在于检验者的证量如何，本身的态度是否严谨，要求标准是否严格。如果弄不好，就把解悟当作证悟。如果检验者是解悟，那就糟糕极了，这个被检验者就太不幸了，他的智慧今后很难再增长。如果在一个有证量的要求人严格的检验者手里，这个被检验者，就能大幅度的提高智慧，提高证量，后续的修行相当快速；因为能现量观察如来藏的简单而大概的运作，这个智慧是了不得的，接近于别相智了。</p><p>如果没有断我见，而直接明心见性，里面也包含了断我见的智慧证量，也得有相当程度的觉明，否则也是解悟，不是证悟。因为没有身心觉受，意根就没有认可，身心都没有改变。如果已经断了我见，再明心，可能就没有太强烈的觉明和身心觉受了，因为几乎也经历了那个阶段，否定了五阴自己。如今接近于解悟的人可不少，禅定不足，观行不够，只能理解，也有一些智慧，可是无法现量观察如来藏的简单运行。</p><p>从越来越多的法义的观察思惟整理中，寻找到了意根更多的运行秘密，意根的运行与禅定关系很大，定越好，意根的作用越突出，越有实证，意识少于浮浅的思惟分析，证量就高。在浮躁的现世社会，主张并强调修定，是一剂修行证果的正途良方，能扭转大众修行的浮躁，更利于实证，减少口头禅的泛滥，否则佛教就要渐渐趋于灭亡，没有实质的修证了。</p><p>六、断我见证果与眼见为实耳听为虚的道理是一样的</p><p>佛处处都在开示给我们一个真理：一切诸法皆悉空寂。意思是说一切法都是空的、寂静的，为什么如此说？因为一切法都是各种因缘聚合而有，本没有自体性，并非是真实存在的法，因此说是空寂的。从另一方面说，所有一切法都是如来藏幻化出来的，由如来藏主导，是如来藏的影子，实质是如来藏，没有一切法，因此说一切法皆悉空寂。小乘的空，大乘的空性，都在指示这个真理真相。</p><p>诸根如幻，境界如梦，观行这些法，要有较深的禅定，在各种境界中，在六根对六尘中，体会根与尘的虚幻性、不实性、不作主性、没有自体性，定慧要相结合，完全融合在一起。仔细观行，眼见色中，眼根如何的不自在，色尘如何的虚幻，如何像影子一样；耳听声时，声音这个境界，如何像梦一样，耳根怎么像幻化的一样，如何生又是如何灭的，如何起听觉作用的，观行好了，就能证得五阴空幻，寂静不生。</p><p>对于这些法的观行，初步的理解，不等于是证得。理解比较容易一些，意识心思惟一段时间就觉得理解了，但这不是证得，证得要有禅定，要有甚深思惟，要证据确凿，要深入到内心深处的意根，意根认可才叫证果。意识理解的都属于知识，没有证据或者证据不足，那都不是证，必须经过深细的观行，意根在内心深处真正认可那个理，才算证果。</p><p>那时候由于是真正证得认可五阴无我，六根虚幻，心行就改变，对万事万物的看法就转变。真认为自己是虚妄的时候，心里肯定要发生变化，不可能与从前一样，还是老样子。而意识理解的，没有证得，内心不知道五阴确实是无我，对自我的认知不改变，对五阴的看法只是停留在理论上，心行还是一如既往，烦恼还是原来那样重，不能断除三缚结，三恶道不能免。</p><p>这与世俗法所说的眼见为实耳听为虚的道理是一样的，听别人所说相当于意识的理解，并没有证实，自己心里还是很虚，不敢较真。之后，眼见了，自己才真正的知道了，就会说：啊！原来如此！这时对人对事，就知道该怎样处理了。眼见相当于意根的证得，耳听相当于意识的理解，这是两种截然不同的层次。意识的理解是从他人那里听来的，意根的证得是亲眼所见，是现量知，是真实看见。理解的相当于道听途说，和实际的亲眼所见，差别很大。比如听说某个人如何如何，心里生起一种看法，有了某种印象，可是等见面一观察，原来是这样，与心里的印象不完全一致，见面时的感觉和印象更真实可信，然后自己才能对此人采取如理的态度。如实了解和观察以后，自己的观点、意见、想法、行为造作和听的时候就不一样了。</p><p>所以我们要用心熏习，熏习到内心深处，真真正正的去观行諸根如幻，五阴无我。观行的时候就是第六识的思惟分析，分析以后交给意根，意根去认可这个理的属实性，就证果。意根如果不认可意识思惟观行的理，那就没有用。要想尽快的让意根证得，就要证据确凿，尽量能达到现量观察的程度。观行的中间还有很多的程序，有很多的路要走，有很多的法要去修，要不断的修集各种资粮和道粮，需要不断的修集福德资粮，还有戒律、忍辱、禅定、智慧，不断的圆满这些六度的条件。</p><p><strong>第十二节  把心结打开才能得解脱</strong><br/></p><p>想得解脱，就要断除我见，断除意根对五蕴和三界世间的攀缘，意根如果彻底不攀缘，那必须断我执，对五蕴和三界法都不执著，四果人才能做得到。在无想定里，没有意识，可是外道却执著色身，所以色身不会灭，因为执身，把身体当作我，他就不能出离三界，因为没有断我见的缘故。意根只要对三界世间所有法一点也没有兴趣，断尽了贪爱，对五蕴十八界一点也不执取了，才能断尽我执，命终意根自己主动灭了，就入无余涅槃，解脱出离三界了。</p><p>真解脱，是心解脱，意识和意根不再执著五蕴自己，不贪财色名食睡，不贪色声香味触，这样意根就把绳索从五蕴上解开，身心束缚就没有了，生死结就打开，生死之法再也束缚不了自心，心就是解脱的。五分解脱里，最后一个是解脱知见，知见解脱了，没有邪见的束缚，正知见建立起来，邪见就消失，是智慧境界。依此知见，就能出离生死苦海，而正知见最不容易建立，因为邪染太深了。学佛修行就是不断的打开心结的过程，心结打开，才能得解脱。</p><p> <strong>第十三节  断我见的正义</strong></p><p>我，指意根第七识，是意根把五阴当中的色阴当作我，把受阴当作我，把想阴当作我，把行阴当作，把六识的识阴当作我，也把自己当作我，因此才有我见。六识是依他起性，辗转而生，是被意根第七识所利用的一个工具。就像整个五阴与色身当中的头和四肢的关系一样，意根无始劫以来一直把五阴当中的每个部分都当作我，当然也把第八识的功能作用当作我。</p><p>意识的我性微弱，远远不如意根的我性强大，比较容易断除。一般来说，意识通过熏习一下五阴无我之理，稍微作以思惟，就能明理；而意根的思惟观察力弱，再加上无始劫以来的深厚无明，严重遮障其智慧，不容易明理，意根的我见就非常难断。从古至今，真正断我见者少之又少，如凤毛麟角，即使是佛陀在世时，其证果人数的比例也不是很大的。因此说我见主要指意根的我见，断我见一定要意根亲自与意识一起参究无我之理，能现量观察到五阴确实是无我的，意根确认，这才是真正断了我见。</p><p>如果仅仅是依靠意识像复读机一样，以读诵背诵文章的形式读诵文字，不在定中深细思维观行，意根永远不能受熏不能明理，这仅仅是意识在文字的表面上肤浅的作为，最多能解悟五阴无我，很难实证。</p><p>断我见是意根的亲自证得，那么明心证悟是否也是意根亲自证得真心第八识？答案是也如此。因为意根无始劫以来一直把五阴六识的功能作用当作我，也把第八识的功能作用当作我，不知道祂自己什么也不是，一头依赖第八识，一头依赖五阴六识，才能成就祂所谓的的虚妄的我的功能作用，有祂自己的功能作用，才能在三界里生存。</p><p>那么要让意根断除无明，成就佛道，一方面要砍倒五阴大树，让祂没有依赖，不再认五阴为我；另一方面要树立第八识，让祂证得真实的第八识，知道一切法都是第八识所为，不是自己的功能作用。这样意根就认清了法界实相，无明一点点的破除掉，我执和法执渐渐断尽，最后彻底无我时就成为了佛世尊。</p></div>"
},{
    "title": "第八章　五蕴与第八识的关系（1）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　五蕴与第八识的关系</strong></p><p><strong>第一节  两种无我法的内涵</strong><br/></p><p>无我，两个字，有两个以上的不同含义，在不同之处，代表着不同的含义，把这些含义弄清楚，才能清楚无我到底指什么，才能知道如何下手修行。七识的无我，一个是指无不生灭性，无永恒性，无真正主宰性；一个是指无第八识那种空性。第八识的无我，一个是指无七识那种自我性自私性，一个是指无七识那种主宰性、作主性。</p><p>搞清楚这些概念，才能理解我与无我的真实义，才能指导自己的修行。能从这些概念里绕出来，也是不容易的。一个名词概念有多种含义，如果不把含义弄清楚，糊里糊涂的，就无法下手修行。比如真实这个词语，在不同处代表不同含义，一个含义是指不生不灭的真实相第八识，本来而有；一个是指世俗法里符合事实的相，这是生灭法，不是本来法。</p><p> <strong>第二节  分清两种无我性</strong></p><p>观行苦空无常无我法，最后实证世俗界的五蕴十八界都是生灭的无我法，只有实证出五蕴确实是生灭性的，才会知道是无我的，才会逐渐去灭除五蕴的活动，最开始是减少五蕴的活动，对五蕴活动不感兴趣了，因为知道五蕴是无我的，是生灭的、变异的、空的、无意义的。</p><p>观行第八识参究第八识，其观行目的旨在实证五蕴中的第八识，观察出五蕴与第八识的关系，最终实证一妄一真，实证如何妄，如何真。证得第八识的真实永恒存在性，观察第八识在五蕴身中的清净性，就会证得第八识的无我性。同时观察出第八识是如何具体出生五蕴的，就证得五蕴确实是虚妄不实无我的。</p><p>两种无我性，指向不同，苦空无常无我性，是与生灭无常对应的不存在的无，这个不存在的我，就是七识的我，是假我，要灭除的我。第八识的我，与不生不灭对应，与真实性对应，与清净对应。第八识的无我性代表着第八识心中，不认知自己，没有私心，没有我心。这两种无我千万不能混淆不分，否则无法正确修行。无我的妄心必然要灭，无我的第八识永远不灭。</p><p>两种无我两种意思，七识的无我，没有真实性，有毁坏性。第八识的无我是无私心、我性、作主性、执著性。七识依第八识修到无我时，也有类似于第八识的无我无私不执著。我性轻微的人，敢于否定自己，知非即改，转得快。我性重的人，不肯重新如理思惟，理清思路，不愿意否定自己一点点，这样的人不容易检讨出自己的非，认死理，不肯改正自己，修行非常困难。</p><p>没有禅定，思惟粗燥，没有逻辑思惟，根本不能捋清这些法义的是非淆讹处，头脑是混乱的。如果遇到特别复杂的法义，就会觉得没有头绪，无从下手，所以说禅定是非常重要的。</p><p> <strong>第三节  妄我与真我不能对等</strong></p><p>我不学佛，我不修行，我不持戒，我不修定，我不开智慧，我不求解脱，我潇洒自在，任运自然。这个我，是指什么？是指第八识。这里的主体我换成七识是否可以？七识五蕴能不能也像第八识这样，不学佛、不修行、不持戒、不修定、不开智慧、不求解脱、任运自然？不能。两个我，能不能互相对换？也不能。</p><p>有的人说既然要学习第八识，依止第八识，转依第八识，就应该像第八识一样。这句话对吗？说不对也不对，说对也不对。要有严密的逻辑思惟，哪些方面应该向第八识学习，哪些方面不应该向第八识学习。什么时候向第八识学习，什么时候不学习第八识。成佛以后的七识就与第八识一样，不学佛不持戒不修定不开智慧不解脱不成佛；成佛之前，在众生阶段就要学佛持戒修定开智慧求解脱求成佛。成佛之前要学习第八识在五阴身运作中的清净性，无贪嗔痴性；成佛以后七识与第八识一样清净，就不用再学习第八识的清净性了，因为佛是无学者。</p><p>七识和第八识两个我，有的时候可以互相对换，有的时候不能互相对换。把两个我弄清楚，才好修行，如果混为一谈，那就无法修行，也不能成就了。</p><p> <strong>第四节  小乘观行应该得出什么结论</strong></p><p>如果观行五蕴虚妄无我之后，得出一个五蕴不是第八识的结论，说明了什么？说明了所有的凡夫众生无始劫以来，一直把五蕴当作第八识，然后遇见佛法，想要得解脱，经过观行思惟，纠正了从前的错误认知，把邪见改为正见说：五蕴不是第八识，五蕴非第八识，非非第八识。是这样吗？非非第八识这句话，是否包括了五蕴也是第八识的含义？</p><p>如果是这样，那么凡夫众生无始劫以来一直认为五蕴就是第八识，这有什么错，是邪见吗？没有错啊！如果凡夫众生无始劫以来真的一直把五蕴当作第八识，那就没有我见和我执了，没有无明和烦恼了，佛也就没有必要辛苦来娑婆八千次解救众生了，众生认第八识我就不会认五蕴我，也就不会造作恶业了。最最关键之处在于：凡夫众生无始劫以来是否把五蕴当作了第八识？</p><p>如果凡夫众生无始劫以来一直把五蕴当作第八识，如果真的是这样，所有的凡夫众生就是地上菩萨，具有唯识种智。因为只有地上菩萨以唯识种智的现量观行，能观察出五蕴全体都是第八识，布娃娃全体都是布，泥人全体都是泥，金饰品全体都是金子。那么一切众生无始劫以来都是地上菩萨，再那么还用得着断我见，断第八识我见，断我的第八识见吗？</p><p>如果凡夫众生无始劫以来，并不知道有第八识真我，并不认为五蕴就是第八识，那么凡夫众生遇见解脱法，观行四圣谛苦集灭道，观行苦空无常无我时，最后能得出五蕴非第八识我、非我第八识这样的结论吗？这是否是偷换概念？如果是偷换概念，就没有人能够真断我见，所有小乘行者都不能得法眼净，都不能得解脱。</p><p>真正如实修行三十七道品，如实做观行的人，在断我见证果时，根本得不出五蕴非第八识这样的结论。给出这样的结论，是对于实际修行的情思意解，纯属是研究出来的理论，没有经过如实思惟观行过程。在断我见以后再从大乘法观行的角度，才能得出五蕴非第八识的结论。</p><p>佛在为弟子们讲四圣谛时，首先都告诉弟子：五蕴中有真我第八识不生不灭，即使灭尽五蕴十八界，第八识也不灭。这样弟子们都信受佛语，知有不灭，无余涅槃以后不是断灭空无，那个真我有用。众弟子听佛语当时就知道五蕴十八界能灭，第八识不灭，就知道五蕴不是第八识。但是这种知道，是意识的知，意根并没有实证，实证就是大乘菩萨了。他们也不至于去寻找第八识，只是观行五蕴的苦空无常无我性，不会说经过一番辛苦观行，才去得出结论：五蕴非第八识。如果是这样，那他就没有认真仔细观行。这个结论在佛讲有真我时，心里就应该知道了。</p><p>阿含经中佛讲四念处经，观身不净，观受是苦，观心无常，观法无我。如果这个人真真正正的做观行了，经过了几年时间，断我见时，能不能得出一个结论：身不是第八识，受不是第八识，心不是第八识，法不是第八识？如果得出这样的结论，请问：这个人是如何观行的？如实按照世尊讲的内容观行了吗？</p><p>这个人是凭想象在做结论，没有真正去如理观行。如果小乘修行人确实证得了五蕴不异于第八识如来藏，那么他们也就不会害怕苦，而急着灭去五蕴入无余涅槃了。因为他们证得了五蕴都是第八识显示出的幻化相，没有实事，没有真正的苦，就不会去避苦躲苦了。</p><p><strong>第五节  苦是非我的含义</strong><br/></p><p>观行五蕴无我以后，如果得出一个结论：色受想行识是苦的，苦的不是第八识非第八识，这能说得通吗？</p><p>证得色受想行识是苦的非第八识，能逐渐厌离色受想行识，不喜欢色受想行识吗？如果能，那么就会转而贪爱第八识，喜乐于第八识。小乘圣弟子能喜乐于第八识，贪爱第八识吗？有这种现象吗？如果有，阿罗汉由于喜乐第八识，就会继续修学菩萨道，自利利他，不能入无余涅槃而从三界世间里消失了。</p><p>理论上可以知道五蕴非第八识，任何人在听闻佛介绍第八识的时候当下都能知道。有很多人一想也知道色蕴生灭去来不止，当然不是真实的我，也不是真实的第八识。没有必要千辛万苦去思惟观行五蕴不是第八识，跑题跑得太严重。</p><p>五蕴是苦的，不是第八识和第八识所有的，能说得通吗？意根当然认为五蕴是我（自己）的，不是第八识的，才去执著五蕴为我，才有无量生死苦。如果凡夫的意根认为五蕴是第八识和第八识所有的，那么凡夫的意根还有我见和我执吗？还有遍计所执性吗？什么都不是自己的，意根还有什么可执著的？</p><p>五蕴本质上就是第八识，形成五蕴的六大种子全部来自于第八识，是第八识投资生出来的五蕴，五蕴当然就是第八识的了。如何观行之后反倒认为五蕴非第八识，是不是很奇怪？理论总有穷尽的时候，总有走不通的那一天，无法自圆其说。而实证者，横说竖说都有理，都说得通，谁也辩驳不了。</p><p><strong>第六节  五蕴非我的我是哪个</strong><br/></p><p>原来六七识把五蕴当作我，观行断我见之后，就不再把五蕴当作我了。意根原来把色蕴当作我时，就会把受蕴当作我所，认为色蕴在受蕴中，或者受蕴在色蕴中。我们观察一下，色蕴里有受蕴吗？受蕴里有色蕴吗？都没有，二者不互相混合。同理，意根把受蕴当作我，把色蕴想蕴行蕴识蕴当作我所有的，认为受蕴中有色蕴想蕴行蕴和识蕴，色蕴想蕴行蕴和识蕴里有受蕴。实际上几个蕴既不互相分离，也不互相混合存在，具体观察五蕴的时候，能证得这个理。</p><p>如果说在身体里能找到受，在受里能找到色，那么死人也有受，木头也有受；如果受里有色，那么受就是色，受就有色；受如果有色，就不是识心的无色功能作用了，其它几个蕴也要这样观察。</p><p>把大乘的理与小乘的理同时观行，在观行小乘无我理的时候，就无法观行了。大小乘理同时思惟观行，有点混乱，对于修小乘断我见有点不利。明了大乘理之后，专门观行小乘的时候，不要加入大乘，否则无从下手。</p><p>如果要观行五蕴非第八识，不异于第八识，与第八识不相在，各位努力试一试，能不能观行出来，有什么思路吗？除非参禅证得第八识以后，般若智慧很深的时候，才有可能，智慧浅都做不到。心经中说行深般若波罗蜜多时，才能照见五蕴皆空，行浅般若波罗蜜多时，还不能照见，何况还没有行般若波罗蜜多的时候。按照佛在阿含经里讲的方法去观行，思路很畅通，不要自创方法。</p><p><strong>第七节  断我见断谁的我见</strong><br/></p><p>认为识蕴六识为我的我，是真我第八识，还是妄我意根？断我见是让意根断除识蕴为我的我见，还是让第八识断除识蕴为我的我见？观行到最后是意根认为识蕴无我，还是第八识认为识蕴无我？断我见的结果，就是让意根认为识蕴五蕴不是我，不是我所有的。而不是让第八识认为识蕴五蕴无我无我所，我见我所见与第八识无关。</p><p>观行识蕴苦空无常无我，应该是观行识蕴的生灭变异无常性，以及识蕴的无我性不真实性，不是假我，不为假我所有，实际上也没有假我妄我，都是空的。不是去观行识蕴五蕴不是第八识。</p><p>这个观行是谁观的？不是第八识观的，而是意根在意识观的基础上亲自去观的，最后意根就懂得了识蕴非我不异我，我与识蕴不互相存在和包含。异，就是别、另外的意思，识蕴不是别于我，不是我之外的我所。不异，就是不别，不是另外的，识蕴既不是我，也不是我所，我与我所都是我，都要断除。</p><p>是谁实证识蕴无我非我？是谁实证色蕴无我？是谁实证受蕴无我？是谁实证想蕴无我？是谁实证行蕴无我？是谁断除这些蕴为我的我见？我见是谁的见？我见的“我”是指哪个？认为五蕴是我的知见是邪见，认为五蕴非我不是我的知见是正见，是谁有邪见，是谁有了正见？是断了哪个我的邪见？让哪个我有了正见？是谁认为五蕴非我？是谁认为五蕴是我？</p><p>五蕴是我这个我是指哪个我？这个知见是正见还是邪见？不管是正见还是邪见，第八识都没有，第八识本身不起知见，祂不学佛不修行，没有见惑烦恼惑，也就不用断除见惑和烦恼惑。所以观行的最初是六七识观行，观行到最后是六七识不认五蕴为我了，也知道没有所谓的我，五蕴十八界是无我的。</p><p>如果说观行最后得出结论说五蕴非第八识，那么在证果之前，他就会认为五蕴就是第八识，然而众生无始劫以来根本没有这样的觉悟，不知道有真我第八识，都是认为五蕴就是妄我，为我所有和所用。谁有我见，就让谁断我见。意识意根有我见，故断我见，就要断意识意根的我见。断我见，是去假；明心，是认真。意根和意识把假的否认了，然后才能去认那个真的。</p><p><strong>第八节  色身是否非第八识</strong><br/></p><p>从世俗法表面现象来看，色身是色法，当然不是无色的第八识，但从圣义谛来看，从唯识上来看，色身的实质就是第八识。第八识把众生的色身生出来以后，现在的色身是如何存在的？是否还是第八识出生的，第八识是否还在连续不断的出生着色身？这个问题如果回答不出来，如何知道色身非第八识，不异第八识，与第八识不相在？</p><p>第八识最初生色身的时候，是输送四大种子，同时输送意根的识种子，然后再输送意识的识种子，同时不断的输送四大种子。色身出生以后，第八识仍然不断的输送四大种子，相当于第八识仍然在不断的出生色身，一旦第八识不输送四大种子，色身就不再出生，色身就灭去不存在了。</p><p>第八识出生一切法，只要有法存在，第八识就在不断的出生着法。法出现以后，后续的生叫作执持和维护，实际上还是生，没有断。四大种子生出来就灭，再生出来再灭，这样不断的生灭循环往复，色身就会继续存在，并且不断的改变。第八识在色身上的作用就是不断的输送和收回四大种子和识种子。第八识在一切法上的作用就是输送种子，继续不断的出生法，也就是维持法的存在和变异，让法生住异灭。</p><p>整个一个色身，全部是第八识单独输出七大种子组成的，那么色身就是第八识单独投资的一个控股有限公司，也可以叫作独资企业。只是没有收成，没有利润，也没有损耗，兴衰成败第八识无所谓，因为第八识不把色身当作我和我所。</p><p>从第八识全部投资控制色身这个角度来说，色身非第八识吗？非也！色身不异于第八识（不是第八识所有的）吗？非也！色身与第八识不相在吗？非也！</p><p>色身种子全部来自于第八识，第八识里的一部分种子构成了色身，色身就是第八识，属于第八识所有。色身全体皆是真如，所谓一真法界是也！世间一切有为法，哪个不是第八识？全体即真如，一真法界！</p><p>既然色身全体都是第八识的种子构成的，色身由第八识来调控和控制，那么色身与第八识非相在，也非不相在！老板哪能离开自己的公司？但是色身真的是第八识独资的，没有合伙控股的吗？没有二老板、三老板吗？非也！还有假老板表面上管理控制着，祂以为色身就是我就是我所，由我说了算。</p><p>第八识根据什么输出七大种子投资控股呢？当然根据业种了。业种哪里来的？意根主导六识造作业行得来的。意根主导六识造作善业，就有好的色身，有创利润的优秀公司；意根主导六识造作恶业，就有恶道色身、多灾多难的色身，有赔本的衰败公司。色身公司的兴衰成败，由意根承担风险，担当责任，利润归意根，亏损也归意根。</p><p>第八识是甩手掌柜，投资之后，其余不管。公司需要钱还会再投资管理，只要库存里有。话又说回来，第八识投资的资金全部从库存账目里出，库存的资金从哪里来的，是七识创造的收入。那么色身公司盈利存入库房不？存入库房，公司运营失利，债务由意根负责，从库房里存款抵债。库房亏空，色身流浪乞讨过活，二老板意根三老板六识沦为奴隶，大老板无所谓，没有任何损失。</p><p> <strong>第九节  小乘正观五蕴十八界非我</strong></p><p>观察五蕴非我时，先观察色蕴不是我，如果把这个我换成第八识，那么就是观行色蕴非第八识。请问：观察这个干什么用？如何观察？用得着观察吗？是正观吗？</p><p>观察受蕴非我时，却来观察受蕴不是第八识，观察这个干什么用？如何观察？用得着观察吗？是正观吗？</p><p>观察想蕴非我时，却观察想蕴非第八识，这样观察有什么用？如何观察？用得着观察吗？是正观吗？观察行蕴非我时，却观察行蕴非第八识，观察这个干什么用？用得着观察吗？如何观察？是正观吗？观察识蕴非我时，却观察行蕴非第八识，观察这个干什么用？是正观吗？用得着观察吗？如何观察？</p><p>再接着观察六根非我，却观察眼根耳根舌根鼻根身根意根非第八识，这用得着观察吗？谁不知道眼耳鼻舌身意根本不是第八识？却通过辛苦修定去观行，得出一个六根非第八识的结论。谁不知道眼根耳根鼻根舌根身根不是第八识？谁不知道意根不是第八识？观察六尘也是这样，非要观察六尘非第八识干什么用？谁不知道色声香味触法不是第八识？用得着观察吗？大家都知道，这不是画蛇添足，多此一举吗？与五蕴无常苦空无我有关系吗？</p><p>小乘观行五蕴，就是要观行五蕴十八界的无常性、变异性、空性、苦性，所以确定不是我们无始劫以来所执著的那个我，根本没有一个什么我可执著的，这样就断我见了。这样观行才是正观，若他观者，即为邪观。<span> </span></p><p><strong>第十节  五阴是第八识出生变幻出来的</strong></p><p>一、色阴是五阴之一，是生灭虚妄的、变异的、无常的、苦的，是空的，不真实的，是第八识所幻化出来的。第八识依据众生的业种业缘，变现出众生的色身，才有色阴的存在。色阴不是因某种缘自己就能出生的，也不是由父母一手操办所生的，父母只是色阴出生的一个助缘。是第八识籍父母缘入住到受精卵中，根据众生的业种，藉母血变造胚胎才成为了色阴。色阴不是自然而有，不是无缘无故就有，而是第八识依缘变现出来的，是第八识所具有的属性之一。</p><p>色既然是第八识变幻出来的，就是第八识的一部分，与第八识是不一不异的关系。因此色即是空，是空性心第八识的性质。这里的空是指空性心第八识，色是色阴，色阴就是第八识，全体都是第八识的功能作用而显现出来的。这里的空不是虚空，虚空是一个假名词，没有物质的地方，就假称为虚空，放上物质就没有虚空，因此虚空没有来处也没有去处，没有实体性，它不是真实存在的法。</p><p>二、五阴的一切活动都是七个识心与第八识共同和合运作出来的，七个识心加之于色身上就有五阴的活动，如果色身上没有七识心的运行，色身就是死尸。识心在色身上，色身就是色阴，色身内五根触内五尘，意根同时触五尘上的内法尘，六识心就出现，六识再与六根六尘相触，识心就能感受，受阴就产生。受阴以意识心的感受为主，前五识的感受为辅，没有识心就没有受阴。六识了别六尘，执取六尘的相就是想；接下来的思惟、细的分别、判断、打算等等都是想，想阴以意识心为主，五识也有了别取相的想阴活动。</p><p>行阴，识心的运行，念念迁流变化，身口意的一切活动，都是行阴。包括时间的流逝，地点方位的变化，色身上的心跳、呼吸、脉搏、血液流动，只要是运行着变化着的，不是静止的就是行阴。</p><p>识阴，就是识心的分别功能体性。如果七识心不加在色身上，就没有五阴的活动，色身就不是众生，杀之就不属于杀生，明了七识心体性非常的重要。但是，如果第八识不输送七识心的种子，就没有七识心的产生，更谈不到五阴的活动；第八识如果不配合七个识心，就没有五阴的活动，色身就是死尸，就是木头。由此看来，五阴的活动是在第七识的操控下，由第八识出生的。</p><p>三、五阴苦、空、无常、无我，五阴的空不是指没有五阴，或者五阴消失，连现象也没有，而是说五阴在现象上是存在的，但没有自体性，就像魔幻师幻化出来的城郭一样，没有实质，没有自在性，其本质是如来藏性。五阴的所有一切现象全部都是如来藏所显现出来的，所以五阴是空的。五阴的空，也不是把五阴分成很微细很微细的各个部分，最后就变成没有，变成空无，不是这个道理，五阴不能分析成微尘，因为五阴由色法和心法组成，心法不能分成微尘后再变成空无，其实色法也不能分成极微细的微尘微粒，即使色身能分成极微细的微尘也不能由微尘变成空无，微尘与虚空不能互相转换，因为种子不同故。</p><p>五阴的空，是指没有实质，是虚幻的意思，也是归属于如来藏空性的意思。同理，色阴的空，不是指没有色而是说色阴没有本体的实质，是如来藏所生，是如来藏的空性，色阴没有色法的自体性，是个虚幻法，有生灭之法，所以是空。空的定义：一是不实性，没有自体性，是虚幻法；二是虚空，一无所有之义；三是如来藏的空性义。</p><p>色阴是如来藏所出生的，不能自在，不能自主，自己不能决定自己的存在，要由业种和如来藏决定其生住异灭。色阴被如来藏幻化所生，本质都是如来藏性，没有真实的色阴之性。就像泥人都是泥性，本质都是泥，本没有人，也就没有泥人自己之性，所以说色阴没有自体性，都是如来藏性，全体都是如来藏。同理，三界世间一切法都是如来藏性，都是如来藏造就而成，本质都是如来藏，同泥人一般无二。</p><p>四、略说活人与死人的区别</p><p>人活着的时候，必须有五蕴的活动。色蕴上：呼吸心跳脉搏，血液流动，大小便利，温度软度，眼泪鼻涕汗液，胃肠的蠕动和色身的运转施为等等。受蕴上：苦乐忧喜舍的感受，一会快乐，一会苦恼，一会又不苦不乐，心境感受总是在变化不停。想蕴上：能够分别花草树木、人畜、金银珠宝、人的修养气质、学识风度、四面八方的音响、香气臭气、酸甜苦辣咸、冷热触痛、饥渴温饱、软硬厚薄、沉重轻安、思惟、推理、判断、回忆、打算等等，并且时时执取一切相。行蕴上：能够奔跑行走，行住坐卧，举手投足，嬉笑怒骂，吃饭穿衣，生产事业。识蕴上：眼能看，耳能听，鼻能嗅，舌能尝，身能觉触，意能思法。</p><p>活着的人有十八界的活动，眼根、耳根、鼻根、舌根、身根、意根都有相应的运转。接触色声香味触法时，有眼识分别色，耳识分别声，鼻识分别香，舌识分别味，身识觉触，意识思法。这些有为法的造作，都是由阿赖耶识第八识在执持着维系着。第八识有持身的功能，打从受精卵开始，祂就执持着，精子和卵子本是单细胞，不是生命体，各自只能存活七天左右，相遇到一起后，第七识带着第八识入住进去，受精卵才是一个生命体，才有生命的活动。第八识里的地水火风四大种子与母体中营养相应，第八识就能吸收母体中的营养而变生受精卵，七天一变；若第八识离开，受精卵就立即死亡。出胎后，第八识再吸收乳液饭食中的地水火风四大元素变生身体，婴儿就渐渐长大，又渐渐衰老直至死亡，这些现象都是第八识执持和变造的结果，是第八识出生的。</p><p>《成唯识论》中说过：（阿赖耶识）能潜转身中作事业故。意思是祂能配合前七识运作，产生五阴身的一切活动。死亡时第八识离开不再执持色身，大小便就会流出，身体就会僵硬冰冷，没有了呼吸脉搏心跳，血液流动也停止，胃肠蠕动也停止，身体的各项活动都停止。</p><p>六根不再触六尘，内六尘就不能出现，六识也就不再出生，七识就离开了。于是身体就成为了尸体，尸体有眼不能看，有耳不能听，有鼻不能嗅，有舌不能尝，有身不觉触，变成了一块木头，一个僵尸，任谁打骂哭喊也无动于衷。由此可见，死人与活人的区别就在于有没有第八识，众生由第八识所造之理就可窥之一斑，由此我们就应该知道参禅的入手处了。</p><p>五、问：色身是否在第八识中，和一切物质在色法上没有区别，都是刹那变化的？有区别的是色身上有受想行识，物质色法没有。如果第八识譬喻成大海，身体和一切物质色法就是海上的浪花。观行声音时，内心的觉受从第八识中出生，又从第八识中灭去，是否是这样？</p><p>答：色身不在第八识里，这是世尊在阿含经中明确指出的，因为一个是色法，一个是心法，心法无形无相，与色法不能互相包容包含混合。色身与物质色法都是由四大种子生成的，差别在于色身上有八个识，因此有五阴的活动，而物质色法没有识心，没有五阴的活动。所有的觉受是识心的功能作用，来无所来，去无所去，而识心是从第八识中出生，觉受灭时，也没有去处，识种子就灭回到第八识中。观行时的关键是内心的觉受，这些语言是从内心真实的感触当中说出来的，不是学别人的知见。自己真正思惟出来的想法观点，内心应该有所感触。而学别人的语言，只是意识浮层表面的理解，不会有真正的感触。只有自己真正用功观行出来的现量境，意根才能认可，才能真正断我见，才能有感触。</p><p>六、当我们仰看天上白云时，就发现白云能不断变换出各种各样的图案，有时白云变幻出花朵的形状，有时能变幻出猫狗等等形状，这样变幻出来的花朵和猫狗有自体性和真实性吗？那些美丽的图案是花朵猫狗还是白云呢？我们把这些天上飘动的东西当作什么才符合事实呢？花朵猫狗的真实相是什么呢？我们只要思惟比对一下，就不难了知，那些东西实质都是白云，并没有花朵和猫狗，所有的材料都是白云，因此猫狗就是白云的性质。</p><p>同理可证，众生五阴身都是如来藏性，所有的材料都来源于如来藏，全体即真如，就是一真法界。猫狗比喻五阴身，白云好比如来藏。类比一下，仔细思惟，就能清楚了知此理。好多人只认猫狗和花朵，不认白云；更多的人只认五阴身，不认如来藏；如果认个如来藏，既能明心又能断我见，一举两得。佛法现现成成，简简单单，明明白白，其实就是一层窗户纸。只要手指头点对地方，那么一戳，就万事大吉了。福德不足的人，该点的地方不点，不该点的地方却使劲点。到最后，没有退路了，就点了最后那个点。终究是没有人不能成佛的，只是早成晚成的事，有人愿意早，有人无所谓。</p><p>七、问：见分见什么？见本身是一种用，关键在所见是什么，不管是性境、带質境还是独影境，所见都是相分。相分又都是第八识所变，无一实有。所以应该把相分作为断我见的着力点吧？</p><p>答：能见，是七识，是见分，是第八识出生的，因此能见是生灭虚妄的；所见，是一切法，是相分，包括七识自己和第八识，除了第八识，其余一切相分都是第八识出生的，都是生灭虚妄的。因此，不管是能见和所见，都应该证得其虚妄无我性，都应该断除，而不执著。</p><p>断我见，应该在自己的五蕴十八界上着力，在五蕴的各个功能作用上下手，在十八界的功能作用上下手。观行色蕴的虚妄，如何生灭的，观行受蕴、想蕴、行蕴、识蕴的生灭、虚妄、变异性。观行六根的生灭变异不实性，然后六尘六识都要观行其生灭变异不实性。</p><p>断我见在相分上用功，这个相分，是包括第八识现起的所有的相分，也包括七识心，如果是这样，那么除了第八识，都是虚幻的，没有我，没有五蕴和七识。七识这个见分是最重要的，一定要把七识无我性思惟深透。七识也是第八识变现出来的相分，然后作为见分，去分别第八识现起的其它相分，见分相分二者都是虚妄不实的。</p><p>八、定力不足，福德不足，断我见和明心都很困难，见佛性，更是难上难。断我见的观行，首先要观行自己色身的虚妄，观行色身的生灭变化，然后再观行识心的生灭变化。识心所起的作用是受、想、行和识别，这些作用都要观行到，观行这些作用的生灭、无常、苦、空、无我，观行的范围尽量要全面。</p><p>十八界的范围要全部找到，一一细心观察其生灭无常性，观行根尘相触处，观行通透了，将来就能证悟。这个地方观行不通透，最多是解悟，悟不到点子上，悟不到根本上。六识也有触，六识触的是六尘，这些法都观行到了，断我见就能彻底，明心也很快。</p><p>在世间里，其实都是如来藏自己在玩转一切，根是祂，尘是祂，识也是祂。除此，什么也没有，一切法都是祂自己。入地以后就会发现：一切境界都是祂，一切的色法和心法都是祂，除了祂，就没有别的什么东西了。</p><p>九、如何了解五根的体性</p><p>五根就是指眼根、耳根、鼻根、舌根、身根，五根分为外五根和内五根，外五根就是浮尘根，内五根就是胜义根，各有各的组织结构，各有各的功能作用，但都是如来藏所生成和执持的。这五根的性质都是本如来藏性，都是从如来藏中所出生变化出来的，因此就是生灭变异的、无常的、空的、苦的，就是无我的。我们观察这五根的出生，从无到有，有已还灭，观察五根的构成，再观察五根的变化，最后再观察五根的灭失，就能知道五根是生灭变异无常的。</p><p>这是悟前从小乘的角度来观察，悟后还要从大乘的角度来观察五根，观察如来藏刹那刹那输出四大种子组合成了五根，五根刹那刹那的变异性，是如来藏依据各种缘在维持和变化着五根，缘变五根则变。五根的功能作用就是能够摄取外界的五尘，五根就像一个摄像机，是一个负责接收和传送的工具。具体如何接收和传送，如何工作，需要靠识心来掌控，识心就像操作摄像机的人，没有人，摄像机就是一堆材料，没有一点用处；五根如果没有如来藏和意根，就是一堆死肉，没有丝毫价值。</p><p>十、欲界众生以段食来养育自己，饮食要咀嚼成一段一段的，然后吞咽下去消化吸收，色身才能维持生命活动，因此色身就是虚妄的。欲界众生需要六根触六尘，色身才能得到滋养增胜，否则就不能存活，因此五阴是虚妄的。欲界众生七识需要不断地思量运作，众生才能存活，因此五阴是虚妄的。</p><p>欲界众生七识需要不断地了别六尘，才能存活，因此五阴是虚妄的。从段食的获得一直到滋养色身，都是如来藏的功德，是如来藏在滋养维护着色身。触食、思食和识食，都是如来藏的功德。总之，众生就是依赖如来藏而生存的，离开如来藏一刹那都不能存在。</p><p>色界初禅天众生没有段食，有触食，需要触尘才能生存，否则就要灭亡。眼根、耳根、身根、意根四根需要触四尘，眼识、耳识，身识和意识也要触四尘，这就是触食；有思食，没有鼻识和舌识，眼识、耳识、身识、意识、意根五识需要思量法，才能在初禅天生存，否则就不能生存；有识食，五识要分别了别天界里的四尘。</p><p>有这三种食，初禅天众生才能存活，才能维持色身的存在，因此初禅天众生的五阴是虚妄的。而这三种食都是如来藏的功能作用，归根结底，所有众生都是依赖如来藏而存活，六根六尘六识都是如来藏变现的，四食也是如来藏变现的，众生所需要的一切都是如来藏变现出来的。因此众生就是虚妄的、不实的、空幻的、非我的。深细思惟四食住，也能断我见，得解脱。</p><p>十一、把身体观行到最细小的细胞组成，细胞里有各种粒子，粒子是四大微粒构成，四大微粒是如来藏里四大种子组成，四大种子无形无相，从如来藏里来。如来藏输出四大种子，形成微粒，微粒再聚合成最微小的物质，再聚合成比较大一些的物质，肉眼就可见了，然后再逐渐聚合成最初的色身，最后色身完整，就出母胎。</p><p>由此可知，色身就是空的、生灭的、无我的，是如来藏出生的，是如来藏执持的，全部是如来藏性，这个身体也不过是如来藏的种子功能作用转化成的，是如来藏的一部分功能，是如来藏的属性，没有色身自己的属性和自性。这些观行说容易也容易，但是缺少相应的定力，意根不能着力，不能亲自参与深细的观行和思量，就无法证得此理，没有定力意根不能认可和认证，就不能断除身见和我见，也无法证得如来藏。</p><p>十二、外色是众多如来藏共同变现的，色身以及内色是自己如来藏单独变现的，眼根是如来藏出生的，眼识是如来藏出生的，眼识见色作用是如来藏第七识第六识眼识共同作用，把内色显现在眼识意识里。其中四个识各有其作用，也有和合的作用。根尘识三者都是如来藏变现、执持、督导的，离此三者，无众生无五蕴，那么五蕴众生是什么？哪里有我哪里有五蕴？哪个是我？见色、闻声、嗅香、尝味、觉触、思法，一切的见闻觉知，所有的觉受功能，所有的思想情怀，都是什么？</p><p>把五蕴所依赖的法都找出来，观行这些法都是什么，这些法又依赖着什么？有依赖性，就是非真实的、不自在的、不自主的、苦、空、无常的、生灭的、幻化的、虚妄的、无我的。顺着这样的思惟，入定观行，捋清思路，让意根去感知，去觉悟，去触证，最后内心里就会有一个声音：这一切法真的没有真实性，都是一场闹剧，哪里有我，哪个是我，都不是。然后大哭一场，身心脱落，了无挂碍。</p><p>这其中有一个过程，当意根渐渐要认清这个事实时，心理会非常的痛苦和难过，执著了那么久远的我，眼看着就要没有了，心理当然是空落落的、恐惧的，就像站在悬崖边上，非常担心掉落下去，犹豫、担心、害怕，知道什么都没有，又担心什么都抓不到了，那个心境烦躁得很，搅闹得很。过一段时间，就能接受下来，太平下来，恢复正常。这是今世第一次即将要断我见的人所要经历的过程，前世已经多生多世断我见的人，则会很轻松，快乐而心喜。</p><p>每个人所能接触到的都是个人私有的，私有代表着第二次幻化，虚幻又虚幻。无论外部公有还是内部私有，都是幻化虚妄，没有真实性，都是镜子所成像。当然真正证得镜像观，要在初地满心，那时初地所修的法都已经修完了。</p></div>"
},{
    "title": "第八章　五蕴与第八识的关系（2）",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　五蕴与第八识的关系（2）</strong></p><p><strong>第十一节  五阴与第八识不一不异的关系</strong><br/></p><p>一、从大乘角度来说，五阴与第八识是有不一不异的关系。色阴受阴想阴行阴识阴生灭变异都不是真正的我，不是真我第八识，但是五阴由第八识出生，也不异于第八识，离开五阴也找不到第八识，第八识与五阴不互相混合，第八识不在五阴中，五阴也不在第八识中。</p><p>为什么五阴不异于我？世尊说个比喻，比如花的香味与花的关系，花香是依赖花而有的，离开花没有花香，有花香一定有花，但是花可以没有花香，离开花香，花也可以存在；要想找到花，只要循着花香去找，肯定能够找到，闻到花香就能找到花。</p><p>花就比如是第八识，花香就比如是五阴。离开第八识就没有五阴，离开五阴就找不到第八识。从世俗法的角度看，色阴不是第八识，离开色阴也找不到第八识；受阴不是第八识，离开受阴也找不到第八识；想阴不是第八识，离开想阴也找不到第八识；行阴不是第八识，离开行阴也找不到第八识；识阴不是第八识，离开识阴也找不到第八识。五阴不异于第八识，是第八识的一部分，第八识能在五阴上显现出来，离开五阴就显现不出第八识。第八识与五阴性质不同，不能相互混合，就像色和声不能混合在一起一样。但从唯识种智上来看，五阴的实质就是第八识，五阴全体即真如。</p><p>二、世尊在最初讲小乘法时，就已经点明了众生五阴当中有不生不灭的第八识，小乘人信佛语故，知道有这个心的存在，因而就能断我见，不认五阴假我，知五阴的灭不是断灭，还有个不灭的第八识在。五阴与第八识不一不异，也不相在。为什么不相在？第八识无形无相故。如果第八识在色身里，把身体切割开就可以找到第八识，这是不可能的。古代国王就拿死刑犯人做试验，把犯人的身体一片片切割，切割完毕了也没有找到第八识。第八识无形无相，不是与身体能合在一起，也不是用肉眼就能发现，必须用菩萨的智慧眼来识得或明了这个没有相的第八识心。</p><p>三、问：“非我，不异我，不相在”的不相在是什么意思呢？是不是身体里外都有第八识的存在？</p><p>答：不相在有两个意思，从小乘方面来看，五阴的我与我所不互相混合，如把色蕴当作我，就会把受想行识蕴当作我所，而色蕴与受想行识蕴就是不互相存在的；从大乘方面来看，第八识真心与五阴不混合在一起，不参杂在一起，不贴在一起，不碰触在一起，不参合在一起。因为体性不同，第八识无形无相，没有体积和形相，不能与色身混杂，就像虚空不与身体相混合一样， 虚空也不与任何物质互相混合混杂在一起。</p><p>第八识无形无相，不能具体在哪一个地方，也不能在身体的里或者外，但是里外祂都可以到，可以同时应付色身四面八方的事情，同时到四面八方都没有阻碍。如果第八识是有形相的就有阻碍了，祂能到一处，就不能同时到另外一处，这就是祂遍一切法的道理。比如你在娑婆世界，祂跟着你在娑婆世界，同时祂也在执持你前世其它世界的尸体或者坟墓，或者祂到极乐世界七宝池中出生你往生时需要的莲花座，或者到别人的梦中，或者回到前世，去往后世。第八识还可以随意根作其它的事情，比如去报复某人，加持某人，利乐某人，教化某人，毒害某人等等。祂既在六根上，也在六尘上，也在六识上，无一法没有祂的存在。</p><p>四、五阴生住异灭，念念迁流变化，无常而又变异，因此是苦的，无常变异就是苦。我们把握不了五阴，主宰不了五阴，当它慢慢衰老时，出现疾病时，我们是无奈的，也不能让它随我们的心意而改变。这就是我们对于五阴的无奈，也说明五阴的不自在性，不能作主性，所以五阴不是我，也不是我所拥有的，不是真实的。从另一方面来说，五阴是能被我们以及外力所改变的，比如截去四肢，损坏身体，做各种美容术，各种手术，让身体可以增加一些器官和物质，也可以减少一些器官和物质。这样的五阴是变幻不定的，不是固定不变的，因此不是真实的，不是永远如一的，不是我。</p><p>真实的我是永远常恒不变异的，是无苦而有自在性，能独立自主的。我是永远不变的，任何外力也改变不了，是恒久一如，没有苦受也不生灭的。生灭变化的假我与真实的我是不一不异的关系，假我不能离开真我而存在，真我需要在假我上面显现出来，虽然祂不依赖假我而有。二者如果是一，假我灭则真我就跟着灭；如果是二，没有真我照样也有假我，假我能单独存在，而事实上不是这样。所以，二者之间既有区别又有联系，是不一不异的关系。</p><p>五、苦的为什么不是我</p><p>真实的我是永恒的，永恒的就是清净自在的，清净自在的就是寂灭乐。而苦是生灭变异的，不是永远长存的，永远长存的一定是清净的乐，真实的乐，寂静的乐。生生世世不断灭的法一定是清净的乐法，断灭的法一定是苦的，不断灭，不变异，永恒存在的才是乐，才是我；断灭变异的就是苦，因此苦的就不是我；我是不苦的，我是永恒的，永远没有忧患，因此我没有苦。</p><p>五阴身中有第八识不断灭，不变异，没有苦受，五阴有苦，因此五阴非我，但是五阴也不异我。异，就是二法，就是有差别没有关联之法，而五阴是第八识所生，是第八识的一部分种子功能作用，与第八识不是完全的二体，与第八识是不二法。</p><p>五阴与第八识不相在，就是说二者不能互相混合在一起不分彼此，体性不同不能混合，而且第八识无形无相，不能与任何事理相混合。第八识不在五阴里，因此把五阴身片片割开也找不到第八识，五阴灭，第八识不灭。五阴也不在第八识里，因为第八识无形无相，无内无外，五阴就不能在第八识里，但是五阴也不出第八识之外。</p><p><strong>第十二节  行蕴与八识的关系</strong><br/></p><p>五蕴当中的行蕴包括了身行、口行和意行。身行当中有时有六识的存在，有时没有六识的存在，某部分的身行有六识在运行并且受六识的支持，某部分的身行没有六识在运行，不需要六识的作用。没有六识活动的身行，包括睡着无梦时、昏迷时、无想定时、灭尽定时，在这四种情况下色身的运行，六识已经灭去不存在，但是身体还在，身体各种功能还在运行，不是死亡状态。</p><p>这时身体的各种运行都有意根和第八识在维系，就是说身行有时能够离开六识而运行。即使六识存在的时候，某部分的身行也与六识无关，直接由意根和第八识来维系和作用。比如呼吸、血液流动、心脏脉搏的跳动、细胞新陈代谢、饮食的吸收消化排泄、神经传导等等很多功能作用。</p><p>因为身根是由第八识所了别和执持的，意根能够缘于第八识的见分而作间接的了别，因此意根可以直接作用于身根，作主宰，使身体有各种自然的反应。比如睡着时眼皮跳动，各种神经活动，流鼻涕、内脏器官的活动，小孩的尿床等等。</p><p>还有意根直接作决定，六识不自觉的参与身根的活动。如：开车时遇到紧急情况突然躲避，意识来不及分析和判断，只是及时的了别，把了别的信息即时传递给了意根，意根就知道危险，根据自我保护的惯性，决定避开。手突然被烫而马上甩开，不用意识思惟分析判断，只把了别的情况快速传给意根；虫子掉到身上，马上就抖落掉，不用意识分析，意根就了知到，然后习惯性采取自我保护措施；蚊子刚刚咬到自己，马上就去拍打，不用意识的考虑抉择；口中吃到异物，马上就吐出，不用思惟；脚踩到异物，马上就抬起，不用意识判断分析等等，有很多情况六识的作用都是不太明显。</p><p>小乘的蕴仅仅指六识，而大乘的蕴就很宽广，有时把第七识也包括进去，因为第七识也是识，有识的功能作用。第七识也在运行，因此第七识就有行蕴，第七识也有受想心所，就有受蕴和想蕴，在色蕴中也有第七识的作用，否则就没有色蕴的存在，第七识在五蕴上能起相应的作用，所以五蕴也可以包括第七识意根。</p><p>大乘的蕴，也可以把第八识包括在蕴中，能藴集五阴七识的业行，未来生成五阴的果报。因为第八识也是识，有识的功能作用，只是第八识的蕴不是生灭性的，不是苦的，不同于前七识，与前七识有很大的差别而已。在五蕴上都有第八识的运行，而且五蕴不能离开第八识，否则五蕴就不存在了。第八识本身有五遍行心所法，所以第八识也有受想行，当然第八识的受想行是不能灭掉的，永远伴随着第八识的运行，不同于前七识的蕴的功能作用，与前七识的差别极大。</p><p>悟前的凡夫众生和地前的菩萨不能观行到这些法，在粗浅的经论中都不讲这些甚深的法义，否则众生承担不了。所以我们说大乘法的内涵非常宽广，才叫作大；包涵的范围非常广阔，才叫作大；直通到佛地的一切法，才叫作大；能达到究竟圆满，才叫作大；包涵十方世界，才叫作大；最后归结到一真法界，才叫作大；再没有能超出一真法界的了。</p><p><strong>第十三节  五蕴皆空都是如来藏性</strong><br/></p><p>一、为什么说有大智慧能打破五蕴的尘劳烦恼</p><p>当我们证得般若真如本来而有的大智慧时，我们的识心就同时生起了般若智慧，明了真心本不生灭，真心本具万法，真心能出生一切法，真心能生起五蕴身，真心能现起身口意的一切行，有真心就有一切法的存在。同时就知道，我们的五蕴是真心所生，是能生灭的法，五蕴的功能作用都是真心籍缘所生，非真实有，是生生灭灭的虚妄法。</p><p>这样就知道了五蕴非我之理，也就断除了我见，打破了五蕴是我的这种见惑烦恼，从此知见上的迷惑颠倒想就没有了，生生世世在三界五欲六尘中的烦恼惑业就能慢慢消失。也就是通过后续的修行再断思惑烦恼，思惑就是思想上或心理上的烦恼，贪嗔痴慢这些五蕴烦恼。以后所有的尘劳烦恼都消失灭尽，这些尘劳烦恼的打破灭尽，就是由于证得般若的大智慧而得来的，所以只有具足大智慧才能打破五蕴的尘劳烦恼，得以解脱生死。</p><p>二、如何能照见五蕴皆空</p><p>我们能观行能知道五蕴皆空的心是妄心七转识，七转识有贪嗔痴烦恼，有无明。意识通过观行思惟五蕴无我性，就能证得五蕴皆空，从而打破了无明，断了我见。如果再修出禅定，有初禅定的定水滋润就能断除贪爱和嗔恚；贪爱嗔恚断除，心得解脱，不再被贪爱所系缚，不被五欲六尘所系缚。如果修到四果，对三界世间的贪爱和执著都断尽，就能解脱于三界世间的生老病死系缚而出离三界。断除烦恼，心得解脱以后，身口意行就清净，不再造作贪嗔痴染污业行，心就得自在了。</p><p>有无明就有贪染，身口意行就不清净，造作业行后，业缘成熟就要受到业报，那时就会苦恼不堪，生死无尽。学习阿含经，观行断除我见，知道五蕴是虚妄的生灭的无我的，就不再成天围绕着五阴假我而造作恶业，知道三界世间都是虚妄的，就不再贪染世俗法，不再被世俗法所系缚，心就能得解脱。如果再修大乘法，明心见性，找到如来藏真我，知道有个永远不坏灭的真实我存在，然后向祂学习，效仿祂，将来就能心无挂碍，没有了颠倒梦想，无有恐怖，心得解脱。</p><p>三、观自在菩萨行深般若波罗密多时，照见五蕴皆空，度一切苦厄。为什么五蕴是空的？拿木偶人演木偶戏来作比喻，木偶人四肢和头都被拴着线绳，后面有人牵线，这个木偶才能演戏。木偶人演戏时，不能说这件事没有或者是不存在，但是它演戏这件事没有实质，不真实，不自在，不能自主，是空幻的。相是有，却没有自己的实质，所以相是不真实的。</p><p>我们的五蕴也如是，不能说五蕴没有，不能说五蕴不存在，但是这种存在是虚幻的，没有实质性的五蕴，不自在，也没有自主性，因此是不实的。又比如低血压的人头晕时，眼冒金花，眼前都是黑点，这些黑点对他来说不能说没有，但是这种有是虚幻不实的，完全是一种幻相，别人看不见。我们不必对黑点生起恐惧和厌恶，也不用起心把这些黑点赶跑，只要治好头晕病，黑点就会消失。同理，只要治疗好我们的无明病，虚幻的假相，就在心里消失，看一切法都是实相。</p><p>我们的五蕴就像这些黑点一样虚幻不实，就像那个木偶人演戏一样的虚妄。这些道理要想真正的明白，就得要行深般若波罗蜜多进行深细的观行、思惟和参究，才能悟道。一切相是有，但有是假有，是虚幻，是幻化，是不自在的，那么五蕴就非我。而有个我不是幻化的，虽然祂无相，但确实是实相，是真实存在的相。</p><p>般若智慧的观行，要在菩萨六度修到第六度的时候才有悟前的观行智，有观行智时才能观行成就般若智慧。观行成就时，证得了本来就自在的心以后就能发现，这个心是无所得的心，对于世间一切法祂什么也不得，因为祂什么都不需要，什么都具足，丝毫不欠少什么。这个心，我们把祂叫作佛也行，叫众生也行，叫作什么都行，不叫作什么也行，祂都无所谓。祂是一个无所谓的心，怎么都行，有什么没什么都行；怎么对待祂都行，认识不认识祂，祂都无所谓，因为祂自在嘛！我们就不自在了，非得要这样不可，不这样就不行，真是太不自在了。</p><p>当深入观行，因缘成熟的时候就能证得五蕴虚妄，明了五蕴非我，五蕴无常，五蕴是空的。五蕴本来就是空的，只因为无明才不知此理，通过观行就能证知此理。当我们行深般若波罗蜜多证得真心如来藏时，就知道一切法都是如来藏的起用，五蕴也是如来藏的起用，苦厄也是如来藏的起用，全体都是如来藏的妙用；本没有五蕴，没有苦厄，这些假相都是如来藏所现起的，犹如幻化出来的一样。那么五蕴就是空的，苦厄就是空，一切法都是假相，都是如来藏的显现。有如来藏的化现，其他一切法都是泡影，如来藏没有一切苦，祂一出现，所有的苦厄都是如来藏，苦厄就全部消除。所以观自在菩萨行深般若波罗密多时能够照见五蕴皆空，能够度一切苦厄。我们也可以这样作观行，照见五蕴都是空的，都是如来藏，从此以后就能打破五蕴的尘劳烦恼。<span> </span></p><p><strong>第十四节  一切法全部是虚妄不实的</strong></p><p>一、一切法生，是从如来藏中生，那么一切法灭，是灭向哪里？物质色法生时，是四大种子形成；灭时，四大种子散去，生时从如来藏来，灭时回到如来藏中。所以我们看见一切物质色法消失，最后是无影无踪，没有灭的处所。</p><p>后脑胜义根里的六尘色法，也复如是，生时四大种子形成，从如来藏来；灭时，四大种子回到如来藏中，消失得无影无踪。我们不会看到和感觉到，后脑胜义根里的六尘物质色法究竟是如何出生的，如何灭去的，但这些东西确实来无踪去无影，其实都在如来藏里生生灭灭。生生灭灭的也都是影像，刹那刹那代谢，抓不住，摸不着，感觉却那么真实，实在是幻觉，自欺欺人而已。</p><p>即使我们每天看到满房间的东西，显得很拥挤，整个房间和东西，也都是影像，并不是真实的，包括拥挤的感觉，也是虚幻出来的，非常不实在。看冰箱时，冰箱的影像摄入胜义根里，刹那生灭，然后消失。看电视机时，电视机的影像在胜义根里生成，然后灭去。又换成沙发和桌椅等等，一个个影像出生，然后一个个影像灭去，来无踪去无影，刹那生灭变异，非常虚妄不实。</p><p>听声音时，所有声音的影像，或者同时在胜义根里形成，或者顺次在胜义根里生成；灭时，或者同时灭去，或者顺次灭去，来无踪去无影。其实都从如来藏里来，又回到如来藏里去。来和去，都不是实质的色法从如来藏里来，又回到如来藏里去，而是四大种子，从如来藏里来，又回到如来藏里去，无形无相。色身的出生和灭去，也是如此，虚妄、虚幻、不实、刹那生、刹那灭，来无踪去无影，哪有什么实质的色法，诳人耳目而已。</p><p>五识心，识种子从如来藏中生出来，于是好像有了见听嗅尝触，其实虚幻不实；灭时，识种子回到如来藏中，五识消失，无影无踪，来无踪去无影，幻化诳人而已。第六识、第七识，识种子从如来藏中出生，形成了好像连续不断的了知性分别性，刹那生，刹那灭；生没有来处，灭，没有去处，无形无相，来无踪去无影。犹如海市蜃楼般虚幻，诳人心识而已，没有实事，没有实法，都是如来藏的把戏。</p><p>一只猴子对着湖泊里的月亮，种种情思臆想，妄图捞取。一只痴狗，对着镜子里的图像，张牙舞爪，妄图驱走。每个众生的生生世世，用个比较恰当的词语概括一下，就是徒劳无益，成了佛，也是梦中事。当众生是噩梦一场，成了佛，美梦一个。</p><p>二、如来藏不与各种境界在一起，因为境界是物质色法，如来藏是心法，二者不能互相混淆在一起，如来藏不可能在景物的后面，不可能与景物在一起，虽然物质色法都不能离开如来藏而存在。证得如来藏不是在物质色法背后证得的，是在五阴活动当中证得的。当我们观行五阴十八界的虚妄有明显效果的时候，心里应该有所触动，意根应该觉得：哦！原来如此！原来外面的境界都是所有共业众生的如来藏所执持的，并不真实。能观行到这个程度，断我所见就快了，心里不再把自己所拥有的物质色法当作真实，多半能看空自己所拥有的物质色法，内心的感受空一些的时候，定力能迅速提升。五阴和万物有明显区别，万物没有识心，没有灵性，没有受想行识，只是四大组成，但是都有如来藏的执持作用；在五阴上面则有八个识的活动，所以一切万物万法背后都有如来藏在维持着变现着，因此说一切法都是生灭虚幻的，都是如来藏的功德作用。</p><p>    三、在五阴的一切虚妄法上都有真心和妄心的共同运行，两种心都是无形无相的，皆不在内外和中间，但是两种心的体性却截然不同。妄心有生灭，有动转，有分别，有染污，有习气，而真心如来藏没有。我们接触世间一切现象时，都要仔细分析思惟这些现象的不实性、虚幻性、不自主性、变异性，慢慢地心里就能不攀缘，不贪恋，烦恼轻微，观行断我见就很快。</p><p>如果再观察这一切现象的背后，还有什么在维持着现象界的存在和运行，为什么一切现象是这样的虚妄，却还能出生和存在，这样生起疑情之后，慢慢地就能找到万物主，找到生起万法的如来藏了。经常观察一切法的无我无人性，一切法的空性，不仅能证果，还能明心证悟，之后能相续获得如幻观，阳焰观，如梦观等等各种观行。</p><p> <strong>第十五节  大小乘不能混淆观行</strong></p><p>放下自我，达到无我。两个我都指什么？都是指妄我。妄我和真我的逻辑关系搞不通，大小乘修行都困难。观行小乘，却没有得出小乘无我的结论，这是如何观行的？观行大乘，却只得出小乘结论，因为根器还不够好。一般来说，还没有明心的人，离明心还有段距离的人，建议要专心在小乘方面的观行，不能与大乘法的参禅混在一起，因为根器不够，智慧有限，不大可能得出一个正确的观行结果，无法真正断我见。</p><p>无我不是都指大乘法的第八识，转依于第八识才能无我，不是这样。比如世俗界不懂佛法的人，他们如何达到无我？如雷锋等等英雄人物在世俗事业上做到的所谓无我，他们都转依第八识了吗？都没有。小乘初果至四果，都转依第八识了吗？都没有。所以对于无我法，都生搬硬套到第八识这里是不行的，还要实际去观行体会。小乘只要真正证果了，必定会得出一个合理如实的结论，不会去跑到大乘法上来，得出一个大乘结论。</p><p>很多人的言论一出来，就能看出他是否经过实际修证了，语言能显示出一个人是真修实证过来的结论，还是情思意解鹦鹉学舌拼凑的理论。一个凡夫一讲法就讲初地八地菩萨的修行，说明这个人根本不懂实际修行，不知道如何着手修行，所以才领着他人东拐西拐，没有清晰的路线图，自己没有走过的路，不可能有清晰的路线图。大家还是下功夫修定，没有禅定思惟没有逻辑性，就不清晰不透彻。</p><p> <strong>第十六节  声闻人不能实证真我第八识</strong></p><p>信不等于证，信佛语不等于证佛语。信五蕴无我并不等于证得五蕴无我，信第八识是真我，并不等于证得第八识是真我。当然信还有一个层次的问题，浅层次是意识的信，深层次是意根的信。意根即使信了，也不等于证，信与证之间的差距也许很大，也许很小，要看是什么人信。</p><p>声闻人因为信佛语，知道有个真我不灭的第八识，但因为心量问题不能实证，一旦实证就是大乘见道的菩萨。声闻人不等于菩萨，如果声闻人发心不入无余涅槃，可以是通教的菩萨，不是别教菩萨，证得第八识以后，才是别教的菩萨。</p><p>声闻人在听佛语时，当时就知道了有个第八识是真我，但再详细一点的内容就不知道了。对于第八识没有实际观行，不知道五蕴与第八识之间的真实关系如何，不知道第八识如何出生和维持五蕴的存在和运作。</p><p>声闻人信佛语以后，在禅定中具体细微的观行五蕴十八界的无常苦空无我性，最后得出一个结论五蕴十八界确实是苦空无常无我的，这样就断除了认五蕴为我的我见，得法眼净，有初步的解脱功德受用。</p><p>因为声闻人没有实际观行过第八识，也没有能力观行，所以无法确切得出结论，证得五蕴就是第八识还是非第八识。只有大乘菩萨证得第八识以后，才能如实观行五蕴十八界这个我是生灭的假我，确实不是第八识。在此之前都是信佛语，相信佛陀所说如实。</p><p>菩萨证得无生法忍，具有道种智的时候，能够逐渐如实观察出五蕴十八界实际上也是第八识，是第八识的一部分功用，能现前观察到第八识如何具体的流注识种子和四大种子，如何流注出业种子，形成了连续不断的五蕴十八界的功用，这才逐渐证得了一切法都是第八识，众生就处在一真法界里，一切法都是第八识真如。在此之前，都是相似的理解推论猜测想象和信佛语，谈不到实证。</p><p>因为声闻没有实际观行第八识，没有实证第八识，就不可能得出结论说：五蕴与第八识是不一不异的。这是实证的大乘菩萨才能得出的确切结论，声闻人能确切得出这个结论，马上就成为大乘实义菩萨，成为别教菩萨。</p><p>声闻人通过观行参究证得五蕴十八界是空的，这个空不是指第八识的空性体性，声闻人没有这个智慧，只能证得毁坏败坏的那种空，是不究竟的那种空。大乘菩萨才能证得五蕴是第八识的空性，把五蕴全体都能观照成第八识的空性，那也就入地有唯识种智了，观行智慧很深很深，禅定也很深很深。</p><p>没有实际证得第八识的时候，无法现前观察到五蕴到底是不是第八识，观察不到第八识在五蕴身中的运作，就观察不出五蕴与第八识异不异的关系。想象出来的不等于实证，推理出来的不等于实证，信佛语复述佛语不等于实证。</p><p>如果把逻辑推理推论等等当作实证，在命终的时候，麻烦非常大，那时就会发现：一切都不是自己平时想象认为的那样。那时候再怎么手忙脚乱，也无济于事了。最可怕的是，因为不再信自己从前所学所认之理，就会生出诽谤佛法之心，然后去向恶道。</p><p>即使是大乘菩萨，以修学大乘为主，但是没有证得大乘法，也不能如实观察到五蕴究竟与第八识是何关系，五蕴究竟是如何与第八识异不异的关系。推理代替不了实证，否则稍微有些小聪明的世间人都能证得第八识，都能成为大乘菩萨了，不用皈依三宝，不用修行戒定慧了，佛的那些前行法就都没有用了。</p><p><strong>第十七节  傅大士对声闻初果和真妄心的描述</strong><br/></p><p>一、傅大士偈曰：舍凡初入圣，烦恼渐轻微；断除人我执，创始证无为。缘尘及身见，今者乃知非；七反人天后，趣寂不知归。</p><p>释：众生修苦集灭道四圣谛证得人我空以后，从而舍去凡夫的身份，入了初果圣道流。以此为基础，进一步修行，贪嗔痴烦恼渐渐转淡转薄，证得二果。再修得初禅定，断贪欲心，再断嗔恚心，证得三果，心得解脱。又再继续进修，对自我的执著渐渐轻微以至于完全断除，断除深细的我慢，灭了对欲界、色界、无色界的所有法的贪爱，证得四果罗汉，从此无心于三界，只是随缘度化众生。寿命终了灰身灭智，灭掉五阴，灭掉十八界的假我，只剩一个不生不灭阿赖耶识心体，处于寂静无为的状态。</p><p>众生断除我见证得初果时，回想自己生生世世攀缘六尘境界，迷执其中，把色身当作自己，把色身上所具有的见闻觉知性当作自己，为了这个幻化空身，造作种种业行，不断地流转六道，现在终于知道自身的虚妄，身口意行的虚妄，万法的虚妄了。但他不再精进修行，满足于现状，寿命终了，生到欲界天上，又回到人间，来回七次，就证得四果罗汉，命终取得无余涅槃。入了无余涅槃之后，只剩下阿赖耶识，一无所有，一无所为，空空的境界，无境界的境界。也没有一个所谓的阿罗汉存在，也不知道再回到人间修学大乘法，争取早日成佛，就这样走了真是可惜！</p><p>二、傅大士偈曰：菩提离言说，从来无得人；须依二空理，当证法王身。有心俱是妄，无执乃名真；若悟非非法，逍遥出六尘。</p><p>释：这里的菩提和非非法，均指真如本性，真如本性没有言说，但言说时不能没有祂。不管悟与不悟真心本性，都没有得菩提之人，因为菩提本来具足，不从外得，即使悟了，也是自家珍宝的发现而已。要证得佛地的法王身，就要依人我空和法我空之理来修证，最终才能成就佛地的法身无垢识。在一切世间法中，如果有心的分别性，有心的贪执性，肯定都是妄心，不要错认这样的妄心为真实不坏灭的法，为不生灭的自我。对三界世间法无心也无执又不分别的心，才是不生灭的真心。悟得没有三界世间法相貌的心，迥异于七识的心，才能出六尘，了得生死。</p></div>"
},{
    "title": "第九章　断我见的功德受用",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第九章　断我见的功德受用</strong></p><p><strong>第一节  断我见以后有初步的解脱智慧</strong><br/></p><p>断了我见后，色身的觉受还是存在，只是内心没有颠倒见，智慧生起来了，将来就有能力得解脱。真正断我见以后，对于自我的贪爱就会减轻，不再贪爱我所拥有的色声香味触法，遇到磨难时也能看得开，不再像从前那么痛苦。断我见不认五阴为我以后，色身怎么样都觉得无所谓，这就是初步解脱的觉受。更进一步的解脱受用，比如阿罗汉没有乞到饮食时，就以牛粪充饥，他们觉得也无所谓，即使睡在墓地上，也觉得无所谓；穿的衣服，是从尸弃林里尸体上捡回来的，补了又补，自己觉得也无所谓，这就是心得解脱，不着色声香味触法的解脱功德受用。</p><p>有所谓，内心就有系缚，就不解脱，无所谓才是真解脱，身心处于什么环境条件都行，那就是解脱，就是自在；相反，怎么样也不行，无论如何也不知足，那就是生死系缚，就是不解脱，不自在。对于自我越执著越在意，就越不容易成就，贪爱自我的人，系缚自己就很严重。过去修行人，独自在深山里，吃的很艰苦，住的很艰苦，用的很艰苦，可是他们都无所谓。因为他们为了修道，为了成就道业，不是为了色身的享受，所以对于色身五阴就不执著。</p><p>现在的人为什么修行这样的缓慢，没有成就，就是因为生活太舒适，不容易生起出离心，道心不强，贪着心重，禅定就不容易生起，观行就不成就，内心的思想观念就扭转不过来。我们要想解决生死大事，就要深细思惟四圣谛理，首先对于苦圣谛要有深切的认知，知苦才能断集，慕灭才能修道，最后才能心得解脱，心得自在。</p><p> <strong>第二节  证初果的功德受用</strong></p><p>大小乘的见道位，也就是初果，好比遇见了一个人，知道了这个人，还不是很了解这个人，认识不深，但毕竟是见了面，有了初步的认识，与不见面时的了解和认知截然不同。在以后与这个人交往的过程中，逐渐对这个人有了一定的认识，于是加深了印象，对其言谈举止有了一定的了解，时间长了，了解多了，也就认识深透了，信任度就会不断的增强。</p><p>证初果刚刚明心时也是如此，是一个道理。初果的见道虽然没有断除烦恼，但毕竟是初步证得了无我，对自他五阴十八界有了一定的认知，与没有证初果之前是截然不同的，因此身心应该有所转变，与凡夫有本质的区别，虽然没有断烦恼，但是烦恼一定是得到一定程度的降伏了，这是见道证得无我的功德受用。如果说初果由于没有断除烦恼，不是三果人，就认为烦恼应该与凡夫一样，那就误会大了，足以误导很多人，致使很多没有证果的人也认为自己证果了，认为烦恼很重那是正常的。实际上这是不正常的，如果烦恼没有改变和有效降伏，说明他并没有见道，没有实际证得五蕴无我，还没有真正认识无我之理。有很多持有这种观点的人，并不遮掩自己的烦恼性，还理所当然的认为自己证果了，断我见了，丝毫不怀疑自己所谓的果是真果还是假果，不知道冒充圣贤人这个因果的可畏。</p><p>初果见道以后，在以后的历缘对境中逐渐加深对五阴十八界的了解和认知，无我性增强，烦恼再次降伏和减轻，就会成为二果人；再加深对五阴无我的认知，修除五盖，渐次发起初禅定，贪欲烦恼就会灭除，接下来嗔恚也会灭除，经历多长时间不一定，就会成为断除贪欲嗔恚烦恼的三果人；再精进修持，更加深了对五阴无我的认知，见地根深蒂固，所有烦恼全部脱落，我执断尽，就成为四果阿罗汉。</p><p>从凡夫到四果的修道过程，与听说一个人到见到这个人，再到完全熟悉了解这个人，其过程是类似的，不可能刚一见面，就非常熟悉这个人了。证初果也是这样，刚刚见道，不可能对无我了解认知得很深透，继而断除烦恼，但是一定是与断我见证得无我之前有所差别，有所不同了，身心世界一定有变化，一定有初步的解脱功德受用。如果没有初步的解脱功德，就没有真正断我见，没有真正见道证得无我，因为知道无我了，有我的烦恼就会降伏下来。</p><p><strong>第三节  知见扭正内心就有触动</strong><br/></p><p>大小乘混合观察时，六根六尘六识的观察要透彻，六识是第八识当下变现的，刹那刹那的生，刹那刹那的灭。六根是第八识变现出来的，意根也是刹那刹那生灭，五根也是第八识输送四大种子生出来的，刹那刹那的生灭。六尘是第八识输送四大种子生成的，也是刹那刹那的生灭。十八界因为变化太快速，以至于显得太真实，我们就以为这些都是连续不断的，六识心被蒙蔽了，因而产生了这种错觉，其实没有一样不是刹那生灭的。</p><p>现在的我已经不是刚才的我，身体细胞在生灭变化，食物在身体里进进出出，色身也在刹那改变。如果能观察出一段时间内的生灭变化，就能大体知道色身的生灭无常了。色身跟十年前比就感到非常明显的不同，身体的一切都大变样，心里的想法和认知都改变，整个人都换了，把心都融入观行当中，就能证得整个假我五阴虚妄、无常、生灭、空、幻化、非我。</p><p>如果能把小乘四阿含学好，先断我见，再明心，我见就容易断彻底，烦恼性障的降伏就很快。如果直接参禅而明心，再加定力不足，解悟的成分多，我见就不能断彻底，这个假我总要出来兴风作浪，造作烦恼业行，阻碍自己的道业。我性重的人，到处惹是生非，搅得团体和周围人不太平。降伏我，对于修行和自他利益，是极重要的，一旦降伏了，自己生生世世都受益无尽，心不生苦恼。</p><p>断色身我见和识心我见已经很多世的人，绝对不会在意自己的色身，不会很照顾自己的色身，不会为了色身去付出很多的代价。也不会遇事都要先考虑自己的利益得失，为他人为团体做事，绝对不会考虑回报，不会算计来算计去。不会为了个人的利益而去与他人发生冲突，多数都是谦让而无我性的，尤其是最小的个人利益更不会去计较和争执，心态大度，他人就很愿意与之相处。</p><p>通过以上观行，一旦证得五阴无我，最低程度是初果人；烦恼轻微的，直接就获得二果。如果已经修得初禅定，就能逐渐断除贪爱和嗔心，获得三果。各人福德因缘不同，修行时劫不同，获得的果位就不同。利根者，闻法略微思惟就能证果，不必经过长久反复观行，也不必面面俱到的都观行完全和彻底，只从一个方面一个点思惟突破，整个五阴就冰消瓦解，全部攻破。从此就坐在五阴的化城里，大做梦中之事。即使根性不是很利，日久功深也能证得初果，断得三缚结，从此永绝三恶道，也是大幸之事。为此花费多少心血和代价都是非常值得的。</p><p><strong>第四节  证果以后的果报</strong><br/></p><p>证得五阴无我的时候，断除了三缚结，三恶道业就不能系缚自己，重罪轻报，将来不会因为过去生造作的三恶道业行而去三恶道受苦报，那些三恶道业的果报只是在人中现行出来，在人中受苦。如果极个别人因为烦恼极重，又造作新的三恶道业，那就不免再去三恶道受果报，所证得的果位也会失去，包括大乘果位。</p><p>断除烦恼以后，成为三果接近四果的地上菩萨，因为其大小乘的智慧证量，证得的空法比初果人和贤位菩萨更深更细更广，心更空净，三恶道业消除的更多，更不用去三恶道受报，在人中受的苦也更少。又因为断除了烦恼，只有佛法上的贪爱，不会再因为烦恼而造作三恶道业，因此就不再下地狱了。</p><p>但是也会有个别的特例，因为法贪，因为法执，因为愚痴，也会造作大恶业，致使菩萨的果位全部消失，人中受极大恶报。如果佛法中违逆世尊的教导，造作亏损如来亏损佛教的恶业，其三贤十地的菩萨果位也要全部失去。</p><p> <strong>第五节  断我见以后身心都会转变</strong></p><p>真正断我见之后，人虽然还是原来的人，可是心已经不是原来的心；断除我见之后，心行一定发生转变，这才是断我见的功德受用。真正的断我见，整个人都会发生改变，不再像从前那样该怎样烦恼还是怎样烦恼，该怎样贪还是怎样贪，该怎样慢还是怎样慢，该如何嗔还是如何嗔，绝对不可能是原来的心态。如果心行还与从前一模一样没有改变，那仅是理论上的断我见，不是真正的断我见。</p><p>真正证得了无我，身心世界一定发生改变，不是只在理论上知道无我，内心也应该颠倒过来；理论上的知见没有多大用处，解决不了实际的生死问题。理论上觉得断我见，可是实际并没有断我见的人，应该再深修定继续观行，一定要保证真真切切地断除我见，让身心世界有所转变，这样才有真实的功德受用，内心有解脱的影子。</p><p> <strong>第六节  断我见时的觉明现象</strong></p><p>断我见以后出现的觉明现象，身心出现的各种轻安喜悦的现象，是意根促成的，是意根在身心上的反应。意识无法使身心有反应，无法让身心出现轻安和喜悦的觉受，所以断我见一定是意根断除了我见，意识的我见当然也同时断除了。</p><p>如果没有轻安喜悦觉明现象的出现，也认为五阴无我，这是意识断我见，还没有深入到意根的内心深处。意根最初认知到这个理时，会出现反抗烦躁的现象，有轻重的不同表现。前世根基比较好的人，观行过五阴的人，就不会有这些烦躁的情绪，不会反抗，直接就有喜悦的心境出现。</p><p>什么叫作实修？这就是实修，没有这些阶段和过程，不能说明真正断我见了。真正断我见之后，身心一定转变，心行一定改变，圣性一定出现，内心一定是空的。怎么能还有那么严重的烦恼，怎么还会有那么多乱相出现呢？不可能的。内心空了，多余的事情就不想造作了，与无为有初步的相应了，哪里会有那么多的乱事发生，况且还能出现那么多的恶行，根本不可能出现。</p><p>如果禅定不足，观行真的很吃力，对法义的吸收和理解就不到位。有些深法和甚深法，那就更不能理解和信受了。不能理解和信受时，就会生疑，疑见不断，内心就不安稳。</p><p><strong>第七节  证果后是否还有恐惧心理</strong><br/></p><p>断我见以后是有一定的解脱功德受用，这种解脱的功德受用随着每个人的证量不同而有一定的差别。所谓的解脱功德就是对于色身、五蕴的心理感受和想法执著性减轻、减淡了，对于不少事情能看得开，不太计较了，尤其是在有禅定的情况下执著更轻、更淡。这也要看断我见的智慧和禅定的程度而定，每个人都不一样。</p><p>但是遇到重大的事情还是感到害怕，过后想一想不那么害怕了，三四果人很轻。但是一点不害怕是不可能的，就像四果阿罗汉跟在佛陀身边，大象被灌醉了冲过来，他们害怕也要跑开，都四果断了我执的人也怕醉象，为什么呢？因为他们没有证得如来藏，还是认为五蕴身是实有的，苦是实有的，只不过这些都是生生灭灭不断变异的把握不了而已，对于五蕴虚幻是如来藏幻化的理没有证得，因此他们还是有恐惧心理。如果是俱解脱的阿罗汉，有甚深的禅定支撑，就没有恐惧心理，比较安然自在一些。</p><p>如果是八地菩萨那根本就不会有一丝毫的恐惧心理，四地菩萨可能就不会有恐惧心理了。四地以上菩萨不仅断我执，也断了一部分法执，不仅证得了甚深如来藏，又有四禅八定，证得一切法的都是幻化相，不是实有的，五蕴身都是空幻的，全部都是如来藏。因为小乘的阿罗汉没有证得如来藏，他认为五蕴在世间还是实有的，所以才入涅槃躲避苦。小乘证果和大乘证果是在层次上有很大的差别，小乘证得的法不究竟，大乘法才能彻本心源，是究竟的法。所以说断我见的初果人对某些比较大的事情还是有害怕的，因为对色身还是有执，不能断的太彻底，还有法执的问题。</p><p><strong>第八节  二三四果的解脱功德受用</strong><br/></p><p>观行五阴的无常性、苦性、空性、无我性，从凡夫阶段开始，一直观行到证得阿罗汉果，把三界的贪爱断尽以后，观行就结束，这时已经达到无学，对于断烦恼，出离生死方面的修行，再也没有什么可学可证的了。三果以前还有可学可证的小乘法，还没有达到出离三界得解脱的程度，还需要继续修学观行；修到四果时才是小乘的无学，对于解脱法没有什么可学的，已经全部通达，有能力解脱生死轮回苦，入无余涅槃。</p><p>观行五阴非我而证得初果以后，再继续深入观行，贪嗔痴烦恼就能减轻，变得非常轻微，这样就是二果人；再继续观行，五盖降伏以后，初禅定现前，就能先断欲界的贪爱，继而嗔恚也断尽，就成为三果人，心解脱于欲界。我慢断尽，我执断尽，三界贪爱断尽，就成为四果无学。从此小乘的修行就此结束，当与三界的缘尽，命终时入无余涅槃，从此解脱三界生死苦，不再来三界受生。</p><p>心得解脱的人，能不被世间的五欲六尘所束缚，在五欲六尘当中是自在的，没有贪爱和憎厌，没有喜乐和苦恼，心不沾染尘劳烦恼，也不执著自我五阴。修到这种程度最少是三果的境界，如果再断尽意根对自我的执著性，就是四果罗汉。三果人由于有初禅定，贪欲心断尽，对五阴的贪爱断了，但是对色界和无色界法的贪还没有断尽，意根的执著性还在，所以还不能身作证，说自己已经完全得解脱，能够完全出离三界。四果罗汉因为断尽我执，就能证明自己已得解脱，世间任何一法也不能束缚自己，心不着一切法，因此就有能力灭掉自己的五阴，出离三界，不受后有。</p><p><strong>第九节  实证要有充分必要的证据</strong><br/></p><p>打盹时听到巨响，突然明白了听声音时耳识先了别意识后了别。这是不是属于实证，要看具体情况。实证要有充分必要有说服力的证据，能把意根完完全全说服，不再有怀疑。每个人智慧不同，需要的实证的条件就不同，有的人一个证据一个事例就足够了，有的人全部证据给他，见证了多少个实例，都无法确定，不能实证。</p></div>"
},{
    "title": "第十章　断我见的检验标准和特征",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第十章　断我见的检验标准和特征</strong></p><p><strong>第一节  未到地定具足才能证初果</strong><br/></p><p>《瑜伽师地论》卷53 <strong>原文：若依未至定证得初果，尔时一切能往恶趣恶戒种子皆悉永害，此即名为圣所爱戒。 </strong></p><p>这里明确说明，证得初果时一定有未到地定，证果之后三恶道的业种才能断除，不再出生。去往三恶道的业不再造作了，就叫作圣人们所喜乐的戒行。</p><p>如果未到地定不具足，或者没有未到地定，无法实际观行五蕴，不能真正否决五蕴我，五蕴我的知见不能被断除，就不能证果。意识心的那种认为五蕴无我，认为归认为不属于证，属于知解，证得才算证得，确信无疑才能断除知见结缚。禅定和意根紧紧相连，有禅定，意根就能不被烦恼妄想所遮障，不被六识的不断了别所干扰，精进用功，从而证果，明了真理。</p><p><strong>第二节  证果后五阴的观念就转变了</strong><br/></p><p>在观行五蕴虚妄非我当中，很多人有时候仅心里略微认为五蕴十八界是虚妄的，就认为自己断我见证初果了。其实不是，也许离真正的断我见还有很大一段距离，那些知见只是第六识很肤浅的认知，意识并没有深切认可五蕴虚妄之理，不知道如何的虚妄，意根更没有认可，就这样轻易的认为自己断我见了，那就是一场误会，不是真的断我见。</p><p>意根还没有认同五蕴虚妄时，就不是真正证得五蕴非我，没有断除我见，三缚结也没有断除，三恶道的业也没有消除。这种观行只是停留在口头上，不够深细，也不够具体，内心深处没有五蕴非我的观念，心行也不能改变，如果只是意识粗浅的了解一些理论，思惟不够系统，不够深细，就不能得到真实的受用。</p><p>很多人的修行都停留在第六识上，口中喊空，行却在有中，这样的学佛修行还不能改变自己，没有得到任何受用。其原因是，第七识并不认同第六识粗浅的理论分析，多数的情况是第六识还没有进行过系统的思考观行，而第七识就需要意识不断进行深细的思惟观行，才能明理，才能认可五蕴非我之理。因为第七识攀缘的范围太广，了别的智慧就不足，需要第六识作帮手，反复不断地进行深细的思惟观行，越细致越好，第七识依第六识的思惟了别，就能间接了别到真实的道理，才能生起智慧性的认知，就能明理证法。</p><p>口头讲修行，内心一点也做不到的人很多，都是因为意根没有明理，没有得到降伏。比如学佛人认为布施积累福德很快，遇到布施的机会就答应要布施一定的钱财修福，等到真正布施时，心里就犹豫不决，有的人干脆找个借口不布施。为什么会这样？因为意识想布施是表面现象，祂还不清楚布施到底有多大的益处，意根更不知道，而意根对于钱财的执著性仍然很坚固，那就不肯放舍钱财了。</p><p>我们做一切事情都由意根作主宰，观行五蕴的虚妄，也要由意根认可才行，这需要我们长期熏修意根，让祂明理，祂的执著性才能松动和减轻，才能按照第六识的选择去作决定，那时修行就能得力。意根是我执识，祂带着无始劫以来的烦恼和习气，很难改变，四果阿罗汉才能断除祂的执著性，命终才愿意舍弃自己的五蕴，入无余涅槃。断除意根我执的前提条件是首先要断我见，认可自己一切都是虚妄的，明此理以后才能渐渐断执。<span> </span></p><p><strong>第三节  从三十七道品修行上检查是否断我见</strong></p><p>世俗界里没有接触到佛法的人，有些人也认为身体是生灭的无常的，不是真实的，是被自己所用的假壳子而已。这些人都断身见了吗？他们有的人也不在意吃什么穿什么住什么用什么，身体有病也不在意，他们是断身见了吗？都不是，他们不在意身体，是因为有某些因缘条件限制，比如贫穷、吝啬等等，比如有其它方面的追求，暂时顾不得色身。一旦条件具足，他们还是要非常宝爱色身，贪爱色身，讲究色身的享受。</p><p>断身见需要全面考察，从戒定慧上考察，从三十七道品方面来考察，从心念上来考察，从心行上来考察，不能以偏概全。有的人虽然不在意身体上的一些事，那可能是因为生活条件不具足，或者是内心愚痴，或者是把注意力转移到与身体有关的其它方面的事情，有其它方面的追求，有特殊的目的性，为了身体也会造作三恶道业，自己拥有的物质生活不肯放弃，所以不是断身见。</p><p> 一切身口意行，都会形成种子，就像档案一样，有神通的人都可以随时查阅，这个档案永不消失，业种是可以消失的。执着有执着的业种，不执着有不执着的业种，如来藏的记录不一样，果报就不一样。也就是说做一件事，心行不同，如来藏记录不同，业种不同，业报就不同。<span> </span></p><p><strong>第四节  实际修行比想象要困难得多</strong></p><p>很多人学两年佛法，认为五阴不是我，就说自己已经断我见证初果了。这种认为太肤浅了，不解决任何问题。一定要深细周全的观行，一点点改变内心里的认知，这才能触动意根，从而意识意根两个识都能扭转从前错误的认知，对五阴自身有新的认识，认识到相当的程度，才能断我见。断我见不是那么容易的，无始劫以来邪见太深了，不是一朝一夕几朝几夕，说一说想一想就能清除掉的，长劫都把五阴当作我，根深蒂固，不是短期内就能扭正那些不正知见的。佛法不是那么容易修证的，走过来的人都知道，只有没有什么修持的人，才自以为是的想当然的说证果和成佛相当容易，没有经历过都是想象，想象的东西当然都是容易的，下手实行的时候才会觉得难。</p><p>总想别出心裁，急功近利，好大喜功，总希望自己特殊不一般，这些都是我，这个我很难除，真正清除掉那个我其实很难很难。有一些人就是不愿意听这样的话，可再不愿意听，这都是事实。忠言逆耳，良药苦口，对自身都有益处无害处。</p><p>从前世很久劫就开始修行的人，每一劫每一生一世，都熏陶了无量的佛法，积累相当的经验，看透了很多事理，亲身感受很多，善根福德智慧深厚，才能深切的知道，佛法的修证不是那么简单和容易的。只有那些没有什么经历的人，才把修行看作非常容易，读点法华经或者是什么经的，就成佛了，意识稍微知道点什么东西，其实也不明就里，就认为自己有大成就了。其实这些观点，都是我慢，是大我慢，我见根深蒂固，这样的人断我见更困难，我性更严重。</p><p>我性重的人，有很多种表现，会想尽办法通过各种渠道，把他那个我卖弄出去，让所有人都认识他了解他，都恭维他崇拜他，这样他才能觉得舒服，这种舒服的感觉就是自大。自我高高大大，我见更重，断除更困难。<span> </span></p><p><strong>第五节  什么人才可以自我印证</strong></p><p>学佛修行人都应该踏踏实实一步一个脚印的修行，稳扎稳打，要真正的断我见和明心，不要理解和解悟。这就需要禅定的基本功，我反反复复要求禅定，这是身心转变得解脱的根本所在，没有禅定，结果是解，一定不是证。我把证果和明心的标准提出来，都按照这个标准来检验自己，看看是否是真正断我见，还是仅仅是理上的认知。学佛人如果不狂躁和浮躁，一定都能得到最大的利益，佛教也肯定能稳步发展。</p><p>但是我还是不希望大家自己印证自己，因为你们没有经验，不知道里面玄讹之处，容易姑息自己，包容自己，则成为解悟者，不能实际观行，夹生饭吃完，消化不良，道业再难有所长进。给大家当面印证之时，能在很大程度上提高观行智慧，之后遇见任何法，都能观行，智慧和道业将突飞猛进，节省大量的修行时间。</p><p>解悟的人也能懂一些公案，也能讲解简单的公案，其中的细节就不知道了，只知其然，不知其所以然，因为没有观行智慧。初果二果的，我不希望大家自己印证，那里的尺度很难把握。有些人觉得自己的贪嗔痴烦恼很淡了，就认定自己是二果。可是贪嗔痴淡的标准和概念并不知道，往往要弄错。对于嗔心的淡薄，容易把握，可是对于贪的淡薄，就不容易把握了，贪心很细密，自己不容易认清楚，比如情执也是贪，情执重就是贪心重，因为习气深，自己不知道自己情执重，往往就认为自己贪心淡薄，这就误会了。</p><p>还有痴心，更难把握和判定，自己愚痴时，判断不了自己的愚痴程度，只有过来人才能看清楚每个人的愚痴程度。还有慢心，因为每个人都有慢心，四果才能彻底拔出慢心的根苗，只是每个人慢的程度不同。如果慢心的习气重，自己已经习惯和适应了，那就很难检查出自己的慢心是否淡薄了。慢心太重，也不可能证二果。这些方面众生自己都很难把握，因此不能由自己给自己定果位，错了后果严重。久在粪坑不知臭，因为习以为常，适应了。自己往往不知道自己的烦恼习气，因为早已经适应了烦恼习气，不容易反观到。<span> </span></p><p><strong>第六节  断我见的特征</strong></p><p>真正断我见的人，应该在意根确认无我之后，发起更深的禅定，觉明现前，精神愉悦，思惟细密，观法深细。每天睡眠只有三五个小时就够了，身心也不觉得疲劳，反而精力充沛，精神状态非常好。</p><p>这是意根亲证无我之后，认识了真理，对于身心的一种调控。睡眠由意根调控，精神状态由意根调控。意根改变旧有的不正确认知，身心状态一定改变。</p><p>如果只有意识认为无我，意根没有这样的认知，就不会引发身心的一系列反应，不会改变身心状态，那就会一如既往，没有变化，解悟无我，就是如此。</p><p>所以如果有人认为自己断我见，证初果了，那就要检查一下，到底是意识断我见，还是意根也同时断我见了。只有意根断我见，才能断除三缚结，三缚结主要是绑缚意根的。</p><p>现在有不少人开始陆陆续续地观行五蕴十八界的法，希望能断我见，解决生死流转问题，可是观行到一定程度，觉得自己已经断了我见，但又不敢确定；也有的人不懂观行，没有禅定，看了一些书，理解了一些无我的法义，也觉得自己断了我见，也不敢确定。为了解决大家的心疑，特简单的归纳几条特征，供大家参考。刚断了我见的人有几个特征，可以说明他的我见确实断了。</p><p>第一个特征：刚证得无我断了我见的人，内心是喜悦和轻安的，因为初次获得了五阴无生的智慧，证得了四圣谛真理，内心有喜悦和轻安的现象出现。其喜悦和轻安的程度因修行的定力深浅而有所不同，也因观行的智慧深浅而有所不同。</p><p>第二个特征：因为断我见之后有一些功德受用，内心喜悦和轻安，就有觉明现象的出现，在一段时间内睡眠很少，而精神状态却很好，精力旺盛。这一段时间的长短，这是因人而异的，要看每个人的定力有如何，定力越好，他的精神状态就越好，虽然没有多少睡眠，精力却很充沛。</p><p>第三个特征：定力逐渐增强，因为断我见的观行是在一定的禅定中来思考，定中思惟五阴究竟如何不是我，思惟色身从里到外，从小到大，今世前世后世的色身如何的非我，不异我；思惟各种觉知的心究竟如何都不是我，不异我。这些思考的过程，就是意识和意根认知的过程，最后意根认可确实是这样，祂的内心就要发生变化，心心念念知道五阴不是真实的我，对五阴身攀缘的就少，定力就增加。</p><p>第四个特征：烦恼轻微。因为刚刚认可五阴虚妄不是我，这时对自我的感觉就不那么强烈，一时还不会为了自我而生烦恼；再加上觉明的出现，内心的喜悦与轻安，定力的增加，有定水滋润，烦恼就减轻了。但这时的烦恼轻微与二果的烦恼轻微有所不同，刚证初果时的烦恼轻微是不稳定的，以后要发生变化，随着觉明和禅悦的消失，定力的减退，原来隐藏的烦恼这时就会显现出来了。</p><p>二果的烦恼轻微是稳定的，这时的烦恼轻微可能比二果稍重一些，也许跟二果差不多。刚证果断我见的时候，烦恼一定是轻微的，为什么呢？因为这时候身体的感受与心的感受都是愉悦、轻安和喜悦的，与平时内心的觉受不一样，因喜悦而不责人，心怀大度，大心大量，因此烦恼就轻微。</p><p>第五个特征：内心越来越空，对世俗越来越淡薄，感受越来越轻微。刚断我见的人应该觉得，自己的五阴十八界原来是虚假的，是空的，并不真实，实际上并没有真实我的五阴十八界，整个一个我从里到外是这样的不真实，简直就是一个空壳子；既然我是这样的不真实，那么外界对于我的一切的看法、评价，对于我一切的待遇也都是不真实的，外界也不能真正的接触到我，一切境遇也不能真正的加之于我。于是就可能不太在意自己的色身，不太在意外界对自己的看法，对于色身也就渐渐的看淡，对于自己觉知心的感受也渐渐的看淡，感受就少了。</p><p>同时内心有一种空空的感觉，不再牢牢抓住自己的自我以及各种感受，就能把自己空却了一些，对外界一切人事物的反应就淡薄了，不会抓着某一种觉知心的觉受，认为是真实的而产生强烈的执著。虽然他也在觉知，也有感受，有时还有一些苦乐忧喜舍的感受，但是绝不会认为这是真实的，而觉得这些都是空的。对于色身方面，虽然身体有时也感受疼痛不舒服，但是知道这种感受是一种虚妄相，身体本身也是空幻的，就不会太在意自己的色身，不在意各种感受，也少于感受。定力越好，内心空的感受应该是越来越强烈。</p><p>以上大略说了刚断我见的人几种特征，不太全面和细致，因为这些特征也是因人而异，每个人的禅定和智慧都不同，表现特征就不一样。没有禅定只解悟无我的人，心里只有一些理论知见，往往没有以上这些特征，或者这些特征转瞬即逝，维持不了几天。禅定非常好，观行智慧也非常好的人，其觉明时间和无烦恼时间可能非常长，也许达到一年或者是一年以上不等，初禅定就有可能出现，断烦恼的机会就出现了。</p><p>前世已经修过多劫，已经断我见不止一次的老修行人，可以依此检查判断自己是否断了我见，然后安排自己后续的修行。前世学佛时间比较短，修行的路不太熟悉，没有断过我见，善根不是特别深厚的人，建议不要自我印证断了我见，以免错会而犯大妄语业，大妄语业的果报很严重的。千万不要轻易判定自己断我见了或者判定自己开悟明心，这些话千万不要轻易对外说。</p><p>还有在禅定方面，尤其是初禅以上的禅定，自己千万不要轻易判定认可：我已经证得初禅定二禅定四禅定，我这个禅定状态就是初禅定二禅定。请千万不要这样说，因为自己对于禅定的内涵还不真正的明了，没有很确定的了解，不能作正确无误的判断。前世没有证过，今世又没有经验，内心的贪欲也不容易降伏，不太可能修出甚深的禅定。从经教上，从理论上，从实证上，自己还不能够确定自己就证得了某种禅定，所以一定不要轻易说自己证得了深禅定，说错了就是大妄语，后果仍然是很严重的。</p><p>尤其明心见性这件事更不要轻易下结论对外说，最好在心里也不要轻易就认可自己明心见性，一定要找有经验的过来人给自己印证一下，印证以后确定了确实是明心见性了，再把佛经拿来一一对照，检查自己是否能看懂佛经中隐藏所讲如来藏体性的那部分法义，有些经文能够印证是否明心开悟。明心见性以后，很多经典就能看懂一部分。</p><p>比如《楞伽经》中有关键性的一句话：<strong>“如机关木人，机发像起。”</strong>这句话明心以后就应该懂得是什么意思。还有《维摩诘经》中说：”菩萨举足下足，当知皆从道场来。”明心了，就要懂得这句话是什么意思，在讲什么。有些经文某一句关键的语句，应该懂得是什么意思，懂得了才能证明自己已经明心证悟了第八识。</p><p>有很多佛经，只有在证得第八识以后，才能把佛经中关键的语句段落，隐藏的第八识真如体性看得明白，看得懂；没明心之前绝对看不懂，但是明心以后也不是把所有的经论都能看懂，关键的地方，粗浅的地方，应该能看懂，尤其是第八识总体的体性。</p><p>如果自己不是一个久修的大菩萨，不是再来的菩萨，经典又看不懂，有时自己认为是看懂，实际还不是真正的懂，最好不要自己认可自己明心开悟了，找个过来人给自己印证才稳妥；再从经书上来给自己印证，多方面求证，最后才能确认，否则这个妄语业是很重的。</p><p>再有，如果是明心了，那些浅显的公案经过短暂时间的揣摩思惟，应该能够看懂一小部分。再以后，更深一些的公案，涉及到差别智慧的一些公案，慢慢应该能够看得懂。如果说自己明心开悟，这些公案一个都弄不明白，每一个公案都是稀里糊涂，似懂非懂的，那就不是明心。</p><p>真正的明心和断我见要有一定的禅定伴随，没有未到地定，思惟不能透彻，一是断我见只断一部分，没有断彻底，如果没有断彻底，将来这个我总要出来，总有一个我在跟随着你，那只能是一个初果向，不是初果人，不是真正证初果。没有禅定，不容易把五阴十八界思惟透彻，不能从里到外观行到整个人都是空空的，如果真正证得自己整个人都是空的，一天到晚的内心觉受一定跟以前大不相同。这个觉受是必须要有的，是观行到位的表征；没有这个表征，说明你的观行还欠火候。</p><p>断我见以后的这段时间跟从前比较，心行方面绝对是一个大转变，绝对是不一样的。所有的心行和表现，内心的思惟、观点、知见都与从前不同，内心的感受是空空如也，根本没有一个我，不太在乎自己的色身和自己的觉知心如何，不太关注自己。因为自己是空的，空的感触很深，行为表现一定发生变化，不会很在意。如果禅定不具足，未到地定、心一境性的定力不具足，有可能只断一部分我见，整个我见不容易断彻底，因为思惟不透彻，或者是解析的成分多，理论的成分多，实际观行出来的很少。</p><p>所有佛法的亲证全部要靠禅定来获得，没有禅定就不能实际证得，只能是相似的理解，心里不是很踏实。禅定是获得实证智慧的纽带和桥梁，缺少禅定而分析和理解佛法，最多得个相似的理解，大智慧绝对生不起来，心行不一定真能改变，内心还有某部分的我相存在。戒定慧三无漏学，缺少了禅定，思惟肯定是不细腻不透彻。这样，自己所认为的断我见就不能断得彻底，断的不彻底只能是初果向，不是初果人，虽然只差一个字，二者的差别还是很大的。</p><p>禅定是证得菩提的一个条件，也是菩萨六度行的一个条件，若缺少禅定，烦恼也不容易降伏，心性也不容易转变，所以定是非常重要的。我们降伏烦恼，完全依靠禅定，尤其是初禅定生起来以后，就能断除欲界贪爱和嗔恚，没有初禅定，贪爱就断不了。没有初禅定，也绝对断不了嗔恚心，遇到机缘嗔恚依然现前现行。所谓烦恼的现行，就是贪嗔痴性在身口意方面完全表现出来，让他人能感知到。没有禅定，根本降伏不了烦恼；未到地定不具足，烦恼也压伏不下来。</p><p>之所以要归纳出这几条，一是因为有一些人迫切的想了解，二是怕有些人大妄语，自己轻易就认可自己以后证得什么果位了。这是不得已而做的，也有可能会出现一些弊病，让极少数我心重的人了解这些特征，故意对外大妄语，宣称自己也如是；如果不归纳出来，也有人有意无意地误认自己已断我见，这也是大妄语。权衡利弊得失的结果，不得不归纳出这几条特征发表出来，供真心修行之人参考，希望能利多弊少。</p></div>"
},{
    "title": "结语",
    "author": "生如法师",
    "date": "2022年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>结   语</strong></p><p><strong>彻底无我的境界</strong></p><p><span>如果能静下心来检查自己内心当中的那个所谓的我，就会发现，无论怎样觉得自己有修行，心中还是处处有个我，做每件事还是习惯性的首先考虑自己的利益得失，从自己的私人利益出发，其次才能考虑到他人的利益；把一切法都当作实有，所以才与一切法较劲。真正的做到无我是很难的，无始劫以来的惯性习气，自己能检查出来都不容易，何况还能压伏和断除。</span></p><p>无量劫学佛修行究竟是为了什么？就是为了能达到彻底的无我，只要能不把任何一个法当作我，当作实有，不与任何一个法较劲，那么我们就不用再学佛，不用再修行，大小乘都已经无学了。</p><p>要如何对治心中的各种我呢？首先就要知道所谓的我都是指那些，范围有多广，先断除最狭隘的我的知见，再降伏我性，断除我执。然后还有广泛的我见，把三界世间一切法都当作我，当作真实，这个是要在以后的修行路上慢慢降伏和断除，都断尽了，从此天下真正的太平，再也没有事了，究竟常乐我净，这样岂不快哉！</p><p>只要把一个法当作实有，去与其较劲，那就是我性。真正不较劲时，内心里是相当的平和，相当的柔软，相当的驯服，相当的慈爱，相当的光明，内心通明，豁达大度，光明无比，什么时候能完全做到这样呢？无一法可当情，说时容易，做起来太难，就是习气太深厚了，难以除尽。</p><p>不与一人作对，不与一事较劲，不与一法为仇，心中坦坦荡荡，平平和和，磊磊落落，光光明明，亮亮堂堂，寂寂静静，空空落落，融融洽洽，这可能就是彻底无我的心境了，这样的生命才有真正的价值，才有真正的意义，才值得保重。但也没有保重的心念了，内心不重一法，也不轻一法，几乎与如来藏的境界相等了。</p></div>"
}]