[{
    "title": "第一章 杂阿含经第十二卷—第一节 十二因缘产生之因",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  杂阿含经第十二卷</strong></p><p><strong>第一节  十二因缘产生之因 </strong></p><p>（二八三）结所系法产生的十二因缘</p><p>原文：<strong>如是我闻。一时。佛住舍卫国。祇树给孤独园。尔时世尊。告诸比丘。若于结所系法。随生味着。顾念心缚。则爱生。爱缘取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：世尊在舍卫国祇树给孤独园的一个法会上讲因缘法时，告诉诸比丘们说：如果你们对于自己心里的烦恼结缚所系着的法（如六尘境界财色名食睡），随着所系缚的法而生起喜爱心贪着心，心里总是不断念着想着那些烦恼系缚的法，沉浸于六尘境界，心就被境界法牢牢的绑缚住了，不得脱离。</p><p>对于烦恼结缚所系着的法心生味着沉湎，不断地念想，贪爱就产生了；由于对烦恼结缚所系着的法有贪爱，就会心生取着，从而执取不舍；由于执取不肯舍离，致使心必然不离此法，后世的业种就存下来了，这样必有后世五阴世间；后世业种成熟，五阴身就会再次出生，与此法不相乖离；由于有生，就会有老病死忧悲苦恼伴随着五阴身，这样无量生死大苦就再次聚集起来了。</p><p>结，是结缚、烦恼、系缚、禁闭于心的枷锁。结有九种：爱结、嗔结、痴结、嫉结、我见结、取结、疑结、吝结、慢结。这些结能把自己系缚在什么地方呢？系缚在三界六道轮回里。什么是结所系法？就是六尘境界人事物理，三界世间法。随生味着是什么意思？就是认为凡间的世俗法有滋味有趣味，能满足自己的贪心等等烦恼，于是心向往之，然后就生出顾念。顾念是什么意思呢？心里一直在想念着、惦念着、盼望着，想得到占有，于是就会一直的抓取。</p><p>什么是心缚呢？心被这些法所缠缚住、系缚住了，系缚住以后，就生起贪爱等等烦恼。贪爱产生出来以后会有什么表现呢？就会执取、抓取，保爱，贪执不舍。是谁抓取谁、系缚谁呢？明着是自己的心去执取抓取六尘法，实际上是心被六尘法所抓取系缚住了。所以心缚最严重的后果就是执取，然后存下业种，生出后世的三界有法。</p><p>如果比丘或者是任何一个修行人，对于能系缚自己心的生死结缚，随其结缚而生起贪爱，认为这些结所系缚的法很有滋味，很是享受，很是舒服，并且心里总是想念着这些法，心就会被这些结缚所系缚住，这样的话，贪爱就生起来了。贪爱生起来以后，内心就会生起取着的心，然后去执取这些结缚；众生心里只要有所取着，后世出生的条件，或者说因缘，或者是种子就形成了；后世出生的种子形成以后，在因缘成熟时或者是种子成熟时，生命体就会出生；生命体出生以后，老病死忧悲苦恼就会伴随着生命体出现了。后世生命体出生的因缘条件是什么呢？是三界器世间有：欲界、色界、无色界，以及欲界资生之具。</p><p>贪爱产生出来以后就有执取占有的身口意行，业种留在阿赖耶识里，后世就会产生三界的有法，后世五阴身的生存条件具备了，三界法就会产生，生命就会在三界法中产生出来，生命出生以后，就会有老病死忧悲苦恼相伴随，纯大苦聚就产生出来了。如果灭除了贪爱等等烦恼，心结就解开了，没有系缚，就不再被三界五欲六尘所束缚，这样心就解脱了。</p><p>原文：<strong>如人种树。初小软弱。爱护令安。壅以粪土。随时溉灌。冷暖调适。以是因缘。然后彼树。得增长大。如是比丘。结所系法。味着将养。则生恩爱。爱缘取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：就像人们种树一样，小树种上以后还很软弱，稍不注意就会死掉，需要人为不断的爱护和保护，给它培土、浇水、施肥，随时调节温度，令其健康生长，正常生长的因缘都具足了，小树才能渐渐的长大。比丘们，与小树生长的道理一样，烦恼结缚所系着的法，如果最初出现的时候你们去贪着、爱护、保护和将养，心中就会生起恩爱贪爱，有贪爱就会产生取着心，执取不断就会产生三界世间，三界的缘具足，五阴身就会出生，出生五阴身以后，老病死忧悲苦恼等等纯大苦就会聚集起来。</p><p>佛用小树比喻众生的烦恼结缚，烦恼结缚刚刚生出来的时候，众生不但不把它降伏和灭掉，还去培植它，让烦恼越来越坚固，生死轮回就会越陷越深。修行应该是时刻反观自心，发现自己有烦恼，就要降伏和灭掉，不要去将养和培植爱护它。没有觉悟的人，觉察力不足的人，已经习惯于烦恼的人，不容易发现自己的烦恼结缚，往往就会顺着自己的烦恼而行事。如果总是顺着自己的烦恼，烦恼就会越来越重，在生死中沉沦也会越陷越深。当烦恼最初生起来的时候，既不觉悟也不遏制，致使烦恼越来越重，一旦养成了根深蒂固的烦恼习气以后，最后就很难断除了。</p><p>原文：<strong>若于结所系法。随顺无常观。住生灭观。无欲观。灭观舍观。不生顾念。心不缚着。则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老病死忧悲恼苦灭。如是如是。纯大苦聚灭。</strong></p><p>释：如果对于自己的烦恼结缚所系着的法（六尘境界），观察这些法的生灭无常性，心随顺于法的无常性和生灭性，对法就会无欲无求，知道法是可灭可舍的，对于法就不会再有顾念之心，就会想灭掉法，舍弃法。这样心就不被法所系缚，于是贪爱灭了；贪爱灭了以后，执取的心就没有了，随之而灭；执取心灭了，三界的有就不会再出生，有就灭了；三界有灭了，生命就不会再出生，生就灭了；生灭了，老病死忧悲苦恼就不会出现，老病死就灭了，这样六道生死纯大苦的聚集就灭了。</p><p>原文：<strong>犹如种树。初小软弱。不爱护。不令安隐。不壅粪土。不随时溉灌。冷暖不适。不得增长。若复断根截枝。段段斩截。分分解析。风飘日炙。以火焚烧。烧以成粪。或扬以疾风。或投之流水。比丘。于意云何。非为彼树断截其根。乃至焚烧。令其磨灭。于未来世成不生法耶。答言。如是世尊。</strong></p><p>释：（断除烦恼结缚）犹如种树一样，最初小树很小很软弱的时候，不爱护它，不将养它，不给它安稳生长的环境，也不给它培植粪土，也不随时灌溉它，冷热不宜，小树就无法生长，慢慢就枯萎死掉了。如果再把这个小树的根断掉，树枝截断，一点一点地把小树拆分开，然后风吹日晒，最后再用火烧掉，烧成粉灰以后，或者顺风扬弃，或者倒入流水中飘走。比丘们，你们怎么认为呢？这样的话是不是把这颗小树从根上给它断掉了？再把它焚烧，把小树磨灭得没有了踪迹，在未来世再也生不出来了？比丘们回答：是的，世尊。</p><p>对于烦恼结缚也要这样，当我们发现自己的烦恼显现出来的时候，一定不要随顺将养，要想办法除灭烦恼，不让烦恼继续滋长蔓延，慢慢烦恼就枯萎没灭了。贪爱一灭烦恼就没有了，未来生老病死的苦恼就不会出现了。</p><p>原文：<strong>如是比丘。于结所系法。随顺无常观。住生灭观。无欲观。灭观舍观。不生顾念。心不缚着。则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老病死忧悲恼苦灭。如是如是。纯大苦聚灭。佛说此经已。诸比丘闻佛所说。欢喜奉行。</strong></p><p>释：是这样，比丘们，对于烦恼结缚所系着的法，如色声香味触法等六尘境界，观察这些法的无常生灭性，确认这些法的无常性，心要随顺于无常生灭性，生起这些法都是生灭的思想观念，内心就会无欲无求，并且想要灭掉和舍弃这些无常法，不再去顾恋、想念、惦念、执取、抓取这些法。这样心就不会被束缚了，贪爱就断除了；贪爱灭了以后，执取的心就灭了；执取心灭了，三界的有就灭了；三界有灭了，生就灭了；生灭了，老病死忧悲苦恼就灭了，这样六道生死当中的纯大苦的聚集就灭了。</p><p>一切法都在不断的生住异灭着，都是无常的，那么我们对一切法都应该随缘放舍，放舍了以后就没有苦恼了，你越抓取就越苦恼。放舍三界有为法，随缘的过活，心就不被系缚，就自在解脱了。喜欢贪爱一个法就被这个法所牵制和系缚，贪爱灭了，不想抓取了，不再执著于一切法，未来的三界有和生都不会出现了，生老病死苦也就都消失了。</p><p>（二八四）于所取法产生的十二因缘</p><p>原文：<strong>尔时。世尊告诸比丘。若于所取法。随生味着。顾念缚心。其心驱驰。追逐名色。名色缘六入处。六入处缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：世尊告诉比丘们说：如果你们对于所执取的法心生贪爱，认为那些法很好，沉浸于其中不能自拔，不断的忆想、顾盼、期望，从而把心束缚住了，于是投奔过去，追逐着名色五阴；名色出生以后就会产生六入（六根）处；有六入就会产生触（六根与六尘的触），六根触六尘就会产生觉受；有觉受就会产生贪爱；有贪爱就会产生执取；执取之后就会产生后世的三界有；有三界法就会产生五阴身；五阴身出生以后就会老病死忧悲苦恼，这样三界生死的一切苦恼就聚集起来了。</p><p>什么叫所取法？眼取色，耳取声，鼻取香，舌取味，身取触尘、意根取法尘。六根取六尘，对于这些所取法，觉得很有滋味很有韵味，贪爱就产生出来了，于是就沉浸其中不能自拔。对于自己所执取的法，贪爱而不能自拔，就会心向往之，念念都是所贪爱的法，心被系缚得死死的，不得解脱和自在，就难免身陷生死之中而苦恼万分。</p><p>而解脱自在的心，不攀缘不执取，心中无事，无所记挂和惦念，眼见色不取色相，耳听声不取声相，鼻嗅香不取香相，舌尝味不取味相，身觉触不取触相，意思法不取法相，一切法用过即舍，不在心里顾念纠缠。驱驰也叫作取、执取，心心念念都惦念着，想要得到，贪爱为缘产生了取，有取就是生死业，未来世的生就免不了，大苦就聚集起来了。苦业都是自己所造，由自己来受，如果不想受苦果，就不要造作苦业，不聚集苦，也就没有苦果。</p><p>众生生生世世盲目地追逐着五阴名色，盲目地追逐着世间尘境，从来不知停下来深深地反思所求究竟有何益处，有何实法，有何趣向，能导致什么结果；也不知思考五阴生死的由来，一次次地生来死去究竟有什么意义，如何避免五阴生死苦，以及五阴世间之外还有什么更值得探索的。</p><p>当众生追逐到名色的时候，在名色上就会有六入出生，外六入就是即将要进入内六根的六尘，内六入就是大脑胜义根中的六根，外六入与六根触，就有六识出生来了别六尘，六识知六尘为何物之后，就会产生感受，感受到六尘境界以后就会生起贪爱烦恼，贪心生起之后一定会执取不已，想要一直据为己有；执取了之后，就与六尘不相分离，生生世世都会在一起，那么未来世的生命就不可避免地不断出现在三界当中，老病死忧悲苦恼随之出现，大苦就聚集起来了。如此轮回不断，真是苦不堪言。这个生死链条叫作十二因缘法。</p><p>原文：<strong>譬如大树。根干枝条。柯叶华果。下根深固。壅以粪土。溉灌以水。彼树坚固。永世不朽。如是比丘。于所取法。随生味着。顾念心缚。其心驱驰。追逐名色。名色缘六入处。六入处缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：譬如一颗大树，有树根、树干、有枝条、有树叶、还有花，把树根深深地植入地里，掩埋固定好，培上粪土，用水浇灌。这棵树就会坚固的成长起来，永远不会腐朽毁坏。比丘们，与植树的道理一样，你们对于所执取的法如五阴六根六尘六识，随着法的出现而沉湎于其中，心心念念不忘，系缚于心。心被法所驱使着，追逐五阴名色。名色为缘产生六入；六入为缘产生触；触为缘产生受；受为缘产生爱；爱为缘产生取；取为缘产生有；有为缘产生后世的生命；生命为缘产生老病死忧悲苦恼，这样的话纯粹的大苦恼就聚集起来了。</p><p>原文：<strong>若于所取法。随顺无常观。住生灭观。无欲观。灭观厌观。心不顾念。无所缚着。识则不驱驰。追逐名色。则名色灭。名色灭则六入处灭。六入处灭则触灭。触灭则受灭。受灭则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老病死。忧悲恼苦灭。如是如是。则纯大苦聚灭。</strong></p><p>释：如是比丘，如果对于自己所执取的法，常常观察它的无常性，能够证明并且随顺于法的无常性，心就会住于一切法都是生灭的思想观念里，对原来所执取的法，再也无欲无求了，心中就会想灭去这些法，厌离这些法，再也不会心心念念眷顾这些法，心不被这些法所系缚。</p><p>七识心不被法所系缚，就不再去追逐名色五阴十八界法，未来世的名色就会灭去不现起了；名色灭了以后六入处就会灭了；六入灭了以后，触就会灭去；触灭去以后，受就会灭；受灭去以后，贪爱就会灭去；贪爱灭去以后，取就灭；取灭了以后，三界世间有就会灭；有灭了生命就会灭；生命体不再出生以后，老病死忧悲苦恼就会灭去，这样众生最大最根本的苦难就不会再聚集了，生死苦就消失不见了。</p><p>原文：<strong>犹如种树。不随时爱护令其安隐。不壅粪土。不随时溉灌。冷暖不适。不得增长。若复断根．截枝。段段斩截。分分解析。风飘日炙。以火焚烧。烧以成粪。或扬以疾风。或投之流水。比丘。于意云何。非为彼树断截其根。乃至焚烧。令其磨灭。于未来世成不生法耶。答言。如是。世尊。</strong></p><p>释：（灭除贪爱等等烦恼）犹如种树一样，树刚种好，不要总是爱护它让它安稳的生长，不要给它培植粪土，不要随时浇灌它，要让它冷暖不合时宜，这样的话小树就不能长大了。如果再把小树的根砍断，把树枝截断，把整棵树一段一段的都截断，一点一点的都割截零碎，风吹日晒以后，再用火烧掉，烧成灰烬以后，或者顺风扬散，或者投入河水中。比丘们，你们怎么想？如果不是割断小树的树根，最后再焚烧掉，让小树全部都磨灭了，那小树怎么能在未来世不再出生呢？比丘们说：是的，世尊。</p><p>对于烦恼，对于心所系缚的法，也要像对待小树一样，不给它生长的合宜条件和环境，并且用善巧方便从根本上破坏掉烦恼结缚，最后断掉所有的结缚，使其无踪无影。</p><p>原文：<strong>如是。比丘。于所取法。随顺无常观。住生灭观。无欲观。灭观舍观。不生顾念。心不缚着。识不驱驰．追逐名色。则名色灭。名色灭则六入处灭。六入处灭则触灭。触灭则受灭。受灭则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老病死。忧悲恼苦灭。如是纯大苦聚灭。</strong></p><p>释：佛说：如是比丘，如果对于自己所执取的法，观察它的无常性，证明并且随顺于这种无常性，心就会住于一切法都是生灭的思想观念里，对原来所执取的法，再也无欲无求了，心中就会有想灭去这些法和厌离这些法的想法，再也不会心心念念眷顾着这些法，心就不被这些法所系缚了。</p><p>如果七识心不再去追逐名色五阴十八界法，名色就会灭去不现起了。名色灭了以后六入触处就会灭了；六入灭了以后，触就会灭去；触灭去以后，受就会灭，受灭去以后，贪爱就会灭去；贪爱灭去以后，取就灭；取灭了以后，三界世间有就会灭；有灭生命就会灭；生命体不再出生以后，老病死忧悲苦恼就会灭去，这样众生最大最根本的苦难就不会再聚集了，生死苦就消失不见了。</p></div>"
},{
    "title": "第二节 世尊顺逆参究十二因缘",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  世尊顺逆参究十二因缘</strong></p><p>（二八五）世尊顺逆参究十二因缘</p><p>原文：<strong>如是我闻。一时。佛住舍卫国祇树给孤独园。尔时。世尊告诸比丘。我忆宿命未成正觉时。独一静处。专精禅思。生如是念。世间难入。所谓若生若老。若病若死。若迁若受生。然诸众生。于生老死上及所依不如实知。</strong></p><p>释：世尊在舍卫国祇树给孤独园的时候，告诉诸比丘们说：我用宿命通回忆过去生还没有成佛成正等觉的时候，单独一个人在一个寂静无人打扰之处，一心一意精进地进行禅修观行思惟，心里就生出了这样的观念：这个世间充满苦难，这些苦难或者是生所带来的，或者是老所带来的，或者是病所带来的，或者是死亡所带来的；或者是生命迁谢所带来的；或者是投生所带来的。可是众生们却不如实了知生老病死的过患，也不如实知生老病死所依托的法。</p><p>原文：<strong>我作是念。何法有故生有。何法缘故生有。即正思惟。起无间等知。有有故生有。有缘故生有。复思惟。何法有故有有。何法缘故有有。即正思惟。起如实无间等知。取有故有有。取缘故有有。</strong></p><p>释：我在禅思当中生出这样的疑念，到底是什么法存在了才有生命体的出现？借着什么法的缘生命体就出生了？随即就在禅思当中起正思惟，正思惟之后就生起了没有间断和疑惑的智慧认知，证得了如下之理：因为有三界器世间的缘故，生命体就出生了；三界器世间生命体生存条件具足的缘故，生命体就出现了。</p><p>在此基础之上，我又往下进行思惟，到底是什么法具足了才会有三界器世间生存条件的具足？是什么法的缘故才产生了三界器世间有？于是就进入正思惟，正思惟之后就生起了如实的无有间断的正等智慧认知：由于对五阴世间法的执取，所以就会有三界器世间有的产生；心执取五阴世间法的缘故，三界器世间的有才会出现。</p><p>在这段里，佛陀都是在讲如理实修的经过，讲真参实证的过程。先对所参究的法起疑，当疑情深深生起的时候，简单的意识思惟根本解决不了这个疑情，因为是意根起疑了，这个疑必须由自己亲自去解决，意识代替不了意根。于是佛陀就在定中起正思惟，即深细的意根的参究，参究的结果是生起了无间断的正等正知。无间断的知，正是意根的知，意识的知经常间断，尤其是命终以后。因为是意根亲自参究的，最后肯定是意根自己无间断地证知了真理，证知了法的真实性。</p><p>如果佛陀没有禅定，一是意根不能起疑，只是意识肤浅的疑；二是意根无法亲自深细的参究，最后结果就不能生起无间等知，只能由意识推理分析理解判断，不能实证法的真实性。所以独觉佛辟支佛在深山中独自修行，禅定都很深很深，思惟力都非常深细，超过于其他人，而且是正思惟，外道们虽然禅定也很深，但是却没有正思惟，因为有邪见，所以思惟就不正。有深禅定，意念集中，思惟力强大，就能开启大智慧如实智。</p><p>佛陀那时候还是独觉佛，世间没有佛出世，没有法出世，没有传法之僧，一个人独自出家在山林里，禅定和智慧都很深细，独自思惟五阴世间生老病死的苦法缘由，然后又思惟世间如此之苦，众生为什么不自觉不觉悟？佛陀就为了解脱众生的苦，在禅定中探求生命是如何出现的。</p><p>原文：<strong>又作是念。取复何缘。何法有故取有。何法缘故取有。即正思惟。如实无间等起知。取法味着。顾念心缚。爱欲增长。彼爱有故取有。爱故缘取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：我又生出一个疑念，对五阴身的执取又是因为什么才有的呢？因为什么法的有才有了执取？以什么法为缘才产生了执取？生出这样的念头之后，随即进入正思惟当中，然后就生起了如实的无间断的智慧，证得了之所以有取着心，是因为对五阴世间法有贪恋和粘腻，心里不断的顾念着法，心就被法所束缚住了，对五阴世间法的贪爱和欲望就会不断增长。因为有贪爱所以就有取着心，因为贪爱的缘故就会产生执取。因为执取就会产生三界世间的有，因为有三界世间，就会有生命体出生于其中。生命体出生以后，就有老病死忧悲苦恼，无量的大苦就聚集起来了。</p><p>这段文字表明的意思是，贪爱欲望是生老病死苦的直接根源，所以贪爱就是苦，而不是乐，是苦因而不是乐因。众生颠倒，不知此理，处处贪爱，恋念不舍，从来没有深入定中仔细的思考，世间有什么可贪恋贪爱的，这样贪爱的结果是什么，有乐可得吗？贪爱的实质是什么？究竟有什么可值得贪爱不舍、执取不断的呢？</p><p>如果因缘条件具足，独一静处，对一切法，一切心行，仔仔细细静静的观行，就会如实了知一切法其实没有什么可值得贪爱的，一切欲望都是不实的，也都是苦恼，世间根本没有什么，也没有什么世间。这样心就空了，心空了，苦就消灭了，就会得乐了，解脱了。关键是要勇于追根溯源，一个环节一个环节的去追究，去深究心和法都是个什么，都有什么，最后就会发现心和法什么都不是，什么都没有，那么世间事就会了脱，众生就自在解脱了。</p><p>原文：<strong>诸比丘。于意云何。譬如缘膏油及炷。灯明得烧。数增油炷。彼灯明得久住不。答言如是。世尊。如是诸比丘。于色取味着。顾念爱缚。增长爱缘故取。取缘有。有缘生。生缘老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：诸比丘，你们怎么认为呢？譬如借助于膏油和炷的缘，灯才能燃烧发出光明。如果多次的增添膏油和炷，那盏灯亮得时间是否很长久？比丘们回答说：是的，世尊。比丘们，与这个道理一样，如果你们对于色有所取着，沉湎于其中不能自拔，总是回顾念着想着色，就会被贪爱所系缚住了。由于对色不断的增长贪爱，所以就会产生执取；由于执取于色，就存下了后世的业种，未来三界世间的有就会不断出现；由于有三界世间的有，众生的生命就会出生，有生命就有老病死忧悲苦恼，这样的话世间最大的苦就聚集起来了。</p><p>原文：<strong>我时复作是念。何法无故。无此老病死。何法灭故。老病死灭。即正思惟。起如实无间等知。无生则无老病死。生灭故。则老病死灭。复作是念。何法无故无生。何法灭故生灭。即正思惟。起如实无间等知。有无故生无。有灭故生灭。</strong></p><p>释：我这时又生出这样的疑念，什么法没有了就没有老病死了？什么法灭了老病死就灭了？这样的疑念生起来之后，我随即进入正思惟中，正思惟之后就生起了如实的无间断的智慧，知道没有生就没有老病死，生灭了老病死就灭了。我又生出这样的疑念，什么法没有了就没有了生？什么法灭了生就会灭了？随即进入正思惟中，正思惟之后就生起了如实的无间断的智慧，知道三界世间的有没有了，生就没有了，世间有灭了生就灭了。</p><p>这是十二因缘的逆推，也叫作逆流，逆生死流，前面是顺推十二因缘，也叫作顺流，随顺于生死的流转。虽然表面看是推，实则是深深的思量，不是肤浅的推理作用，有甚深禅定的修行人，疑念又很深的人，不可能用意识肤浅的推理，都是意根在禅定中的深思和参究。顺推能推到生老病死的流转，逆推就能知道如何灭去生老病死，并且得解脱。找到生老病死的根源，从根源上截断，生老病死就断。　　</p><p>原文：<strong>又复思惟。何法无故有无。何法灭故有灭。即正思惟。生如实无间等观。取无故有无。取灭故有灭。又作是念。何法无故取无。何法灭故取灭。即正思惟。生如实无间等观。所取法无常生灭。离欲灭尽舍离。心不顾念。心不缚着。爱则灭。彼爱灭故取灭。取灭故有灭。有灭故生灭。生灭故老病死。忧悲恼苦灭。如是如是。纯大苦聚灭。</strong></p><p>释：我又再次思惟，什么法没有了三界有就会没有了呢？什么法灭了所以三界有就会灭了呢？生起这样的疑念之后，我随即进入正思惟中，正思惟之后，生起如实的无间断的观行智慧，证得了执取没有了三界有就没有了，执取灭了以后三界有就会灭了。</p><p>我又生出这样的疑念，什么法没有了执取就没有了？什么法灭了执取就会灭了？随即进入正思惟中，正思惟之后，生起如实的无间断的观行智慧，证得了一切所取着的法都是无常生灭的，对于无常生灭的法没有了欲望，灭尽了欲望，舍离了法贪和法爱，心不再顾念这五阴世间法，心不再被五阴世间法所绑缚着，贪爱就会灭了；贪爱灭了以后，对世间法的执取就会灭去；执取灭去以后，三界有就会灭去；三界有灭去以后，生就会灭去；生灭去以后，老病死忧悲苦恼就会灭去，这样的话，世间最大的生死苦恼的大火聚就会灭去，从此以后就再也没有任何苦受了。</p><p>为什么不再执取五阴世间了，三界世间的有就会消失了呢？因为执取性就是意根的无明，就是意根的遍计所执性，三界世间就是因为意根的无明执著建立起来的，意根断尽执著，不再执取五阴世间，则心空清净，不再造作三界业行，或者少造作，三界的业种就会逐渐消失。在生命的存续期，处于有余涅槃中，命终时意根对一切法都不取不执，则如来藏无法再出生任何法，也无法出生意根的识种子，则意根灭去，五阴身消失，从此不再出生五阴身，自身所属的三界世间有也随之灭去，不再出生。因为没有了三界世间的有，后世的生命就无以寄托，再加以没有了三界的业种，则生命出生的条件和因缘就不具足，也就不再有生命体出现了。</p><p>为什么贪爱灭了，执取性就灭了呢？因为贪爱会让心深陷五阴世间之中不能自拔，与五阴不能分离，必然会执取世间法。如果不贪爱了，对于法可有可无，随缘自在，也就没有执取的动力了。所以生死轮回是由贪爱引生出来的，舍去贪爱，不爱恋三界，则必然涅槃，不再生死不已。</p><p>原文：<strong>诸比丘。于意云何。譬如油炷然灯。若不增油治炷。非彼灯明未来不生。尽磨灭耶。比丘白佛。如是世尊。如是诸比丘。于所取法。观察无常生灭。离欲灭尽舍离。心不顾念。心不缚着。爱则灭。爱灭则取灭。乃至纯大苦聚灭。</strong></p><p>释：诸比丘，你们怎么认为呢？譬如油灯如果不给它增加灯油，也不给它增加油柱了，那盏灯的灯光以后就不会再继续燃烧，全部都会磨灭掉了？比丘们对佛说，是的，世尊。诸比丘们，是这样，如果你们对于自己所执取的法，观察法的无常和生灭性，心就会离开贪欲、灭尽贪欲、舍离贪欲，不再顾念五阴世间法，不被这些法所系缚住，那么贪爱就灭了；贪爱灭了，心的执取性就灭；执取灭了，三界有就灭；三界有灭，未来世的生就灭；生灭则老病死忧悲苦恼就灭，乃至于巨大的纯苦的聚集就会灭了。</p><p>世尊在这里把灯光比喻为生老病死纯大苦聚，灯油比作贪爱烦恼，我们不给灯炷加油，这样油灯烧不了多长时间就会灭去了。同理对于生死大苦，我们不再往里增加贪爱烦恼，贪爱慢慢就会淡薄消失了，然后苦就灭了。如果贪爱不断地增加，生死大苦就会越聚越多，何时才能灭苦呢？觉悟的人在生死轮回苦中，不应该再增加烦恼了，应该增加智慧，以智慧之火照破贪爱烦恼，直至断尽贪爱，得解脱。</p><p>世尊教导众生灭苦的方法是，对于自心所取着的法要经常观察其无常性和生灭性，当证得自己所执取的五阴世间确实是生灭无常的，那时候就会不断舍离对五阴世间的贪爱，不再惦念和挂碍，最后彻底灭去贪爱，则不再被系缚了，就解脱于世间生死苦。修行当中要善于转念、转弯、转心思、转烦恼，就会生起智慧，智慧的大火一烧起来，烦恼就被消灭了；没有智慧，烦恼就会不断生长。有智慧就有一切，没有智慧，就有烦恼苦。</p><p>（二八七）世尊顺逆参究十二因缘</p><p>原文：<strong>尔时。世尊告诸比丘。我忆宿命未成正觉时。独一静处。专精禅思。作是念。何法有故老死有。何法缘故老死有。即正思惟。生如实无间等。生有故老死有。生缘故老死有。如是有取。爱受触。六入处名色。</strong></p><p>释：世尊告诉诸比丘，我回忆往世还没有修成正等正觉的时候，一个人独自在一个寂静之处，一心一意的专注思惟。内心生起了这样的念头：什么法出生的缘故，老死就随之出生了？是什么法为缘故老死就出生了？随即进入正思惟中，正思惟之后，就生出了如实无间断的智慧，知是生命体出生了，老死就随之出现了，是生命体出生的缘故老死就出现了。</p><p>像这样一一的往前类推，就证得了生命体的产生是因为三界器世间出现的缘故，生命体就随之出现了，以三界有为缘生命体就出生了；三界器世间有的出现是因为众生执取五阴世间法的缘故，有就随之出现了，以众生的执取为缘，有就出生了。</p><p>众生对五阴世间有贪爱，就会出现执取，因为贪爱的缘故执取现象就出现了；众生因为对五阴世间有受，所以就有贪爱，由于受的原因贪爱就出生了；众生因为有六根对六尘的触，所以就会产生受，由于触的原因，受就出生了；众生因为有外六入和内六入，就会有触，由于有内外六入的原因，触就产生了；众生因为有名色的原因，六入就会随之出生，以名色为缘就会产生六入。</p><p>原文：<strong>何法有故名色有。何法缘故名色有。即正思惟。如实无间等生。识有故名色有。识缘故有名色有。我作是思惟时。齐识而还。不能过彼。</strong></p><p>释：我又生出这样的念头：什么法出现的缘故名色就出生了？以什么法为缘才出生了名色？随即进入正思惟，之后就生起了如实无间断的智慧，知道因为有阿赖耶识所以才有名色的产生，以阿赖耶识为缘故才有名色的产生。我在作这样的思惟时，思惟到阿赖耶识这里，再往前就思惟不过去了，因为前边没有什么法了，那就是说没有什么法能出生阿赖耶识，或者是没有任何法能促使阿赖耶识出生，往前没有法能超过阿赖耶识的。这是逆生死的流来追根溯源，生死的源头在阿赖耶识这里，从阿赖耶识里流转出生死。</p><p>原文：<strong>谓缘识名色。缘名色六入处。缘六入处触。缘触受。缘受爱。缘爱取。缘取有。缘有生。缘生老病死。忧悲恼苦。如是如是。纯大苦聚集。</strong></p><p>释：缘于阿赖耶识有名色，缘于名色有六入处的产生，缘于六入处有触的产生，缘于触有受的产生，缘于受有爱的产生，缘于爱有执取，缘于执取有三界有，缘于有才有生，缘于生有老病死忧悲苦恼，这样三界生死的大苦就聚集起来了。</p><p>为什么从阿赖耶识里流转出生死呢？因为意根有无明，想要拥有五阴世间法，阿赖耶识顺从意根的无明和业种，出生三界世间和五阴身，生死于中宛然。十二因缘是顺无明有生死流转生苦，十因缘是逆生死流转灭无明从而灭苦。之所以有十二因缘的生死流转，就是因为众生的意根有无明，无明为缘，阿赖耶识就借助于无明出生了一连串的生死链条，把众生推向苦海之中。而十因缘的逆生死流转，从生老病死的现象一直寻根溯源到阿赖耶识这里，如果能证得阿赖耶识，知道阿赖耶识是如何出生五阴名色的，就成为菩萨，转入大乘修行当中。</p><p>如果实证了十二因缘与十因缘的每一个分支，就成为中乘圣人的辟支佛独觉佛。辟支佛们虽然实证了十因缘的每个分支，但是在阿赖耶识这里，只是推算为实有，并没有证得阿赖耶识，没有找到阿赖耶识在何处起何作用，因此不属于实证阿赖耶识，这点与大乘菩萨的实证是有本质上的差别的。</p><p>原文：<strong>我时作是念。何法无故则老死无。何法灭故老死灭。即正思惟。生如实无间等。生无故老死无。生灭故老死灭。如是生有。取爱受触。六入处名色。识行广说。</strong></p><p>释：我这时又有了这样的疑念，什么法没有了老死就没有了？什么法灭了老死就灭了？随即进入正思惟，之后生起如实无间断的智慧，知道生没有了老死就没有了，生的现象灭了老死就灭了。像这样思惟下去，就会证得三界有消失了生就不会出现了，三界有灭了，生就灭了；取没有了三界有就没有了，取灭了三界有就灭了。</p><p>贪爱没有了取就没有了，贪爱灭了取就灭了；受没有了贪爱就没有了，受灭了爱就灭了；触消失了受就消失了，触灭了受就灭了；六入处没有了触就没有了，六入处灭了触就灭了；名色没有了六入处就没有了，名色灭了六入处就灭了；六识的业种没有了名色就灭，六识的业种灭了名色就灭了；身口意业行没有了六识的业种就没有了，身口意业行灭了老死就灭了。</p><p>原文：<strong>我复作是思惟。何法无故行无。何法灭故行灭。即正思惟。生如实无间等。无明无故行无。无明灭故行灭。行灭故识灭。识灭故名色灭。名色灭故六入处灭。六入处灭故触灭。触灭故受灭。受灭故爱灭。爱灭故取灭。取灭故有灭。有灭故生灭。生灭故老病死。忧悲恼苦灭。如是如是。纯大苦聚灭。</strong></p><p>释：我又作这样的思惟，什么法没有了业行就没有了？什么法灭了业行就灭了？随即进入正思惟，之后生出如实无间断的智慧，证得意根的无明没有了业行就没有了，意根的无明灭了业行就灭了；业行灭了六识的业种就灭了；六识的业种灭了未来世的名色就灭了；名色灭了六入处就灭了；六入处灭了触就灭了；触灭了受就灭了；受灭了爱就灭了；爱灭了取就灭了；取灭了有就灭了；有灭了生就灭了；生灭了老病死忧悲苦恼就灭了，然后像这样的大苦的聚集就灭了。</p><p>十二因缘的生死循环归根结底都是因为意根的无明，意根是始作俑者，所以要想离开生死轮回，要想解脱，必须要破除和断尽意根的无明，使得意根再也不妄想行于三界世间，身口意业行就灭了。因为意根证得了一切法都是空和无我的，那就再也没有什么理由、没有什么动力去执取任何一个法了，只要没有取着就是无苦的，就是解脱和自在的。</p><p>意根对于五阴世间没有了心行，没有了意愿，没有了攀缘，没有了执取，就不会再指使六识去造作更多身口意业行，七识心就都清净了，无为了，寂静了，三界的业就了了，业种没有了，未来世就不会再有五阴世间，也就没有名色了，这样就暂时寂灭了。未来无量劫以后大乘法缘熟，再从寂灭涅槃中出生，践行菩萨道，自度度他，完成佛道，进入真正的寂灭之处——无住处涅槃，不用再灰身泯智。</p><p>意根的无明破除从断我见证须陀洹果开始，再到证得辟支佛果，三界的生死无明种子断尽，还有无始无明和尘沙无明在未来成佛之道的修证上一点点的破除，直至都断尽，就成为大觉世尊了。仅仅断尽三界无明只觉悟了一小部分，还不是大觉，不是究竟觉。在学佛路上发心很重要，发心越大，觉悟就越大越彻底，成佛就越快。</p><p>原文：<strong>我时作是念。我得古仙人道。古仙人迳。古仙人道迹。古仙人从此迹去。我今随去。譬如有人。游于旷野。披荒觅路。忽遇故道。古人行处。彼则随行。渐渐前进。见故城邑。古王宫殿。园观浴池。林木清净。</strong></p><p>释：我把十二因缘前前后后都思惟通达了以后，心中就有了这样的念想：我现在是走在古代圣人所走的道路上，走在古先圣人所走的径路上，古先圣人们从这条路走过去了，我现在正跟随着走去。譬如有人在深山旷野中游历，劈开荒草寻觅道路，忽然间找到了一条旧路，是古人走过之处，于是这个人就随着古人走过之处随行，一步一步地往前走，就看见了一座古老的城市里古代国王的宫殿，有大观园和浴池，山林灌木都很清净。</p><p>原文：<strong>彼作是念。我今当往白王令知。即往白王。大王当知。我游旷野。披荒求路。忽见故道。古人行处。我即随行。我随行已。见故城邑。故王宫殿。园观浴池。林流清净。大王可往。居止其中。王即往彼。止住其中。丰乐安隐。人民炽盛。</strong></p><p>释：这个人就想：我现在应当到宫殿里禀报大王一声，让大王知道。于是这个人就拜见大王，告诉大王说：大王您应当知道我游历在旷野中，劈开荒草寻求通路，忽然见到一条古老的旧路，是古人所走过的路径，我就随着这条路往前走。走着走着就看见一座古老的城市，有一座古老的王宫，里面有大观园和泉流浴池，林木清净，大王您可到那里去，居住其中。于是大王就到王宫中住下了，并且治理国家，从此以后国家富饶，人民富足安稳快乐。</p><p>佛说这段话是譬喻自己探究十二因缘这个过程，与过去古时圣人所用的方式是相同的，所走的都是同样的道路，探究出的结果是相同的，得出的结论是一致的。古圣先贤们证得了真理，佛陀如今也同样证得了真理，都得到了解脱，出离生死大患，到达安稳涅槃城，享受安稳快乐。古仙人道是指八正道，故城邑古王宫殿代表涅槃境界。我随着古仙人的道路，走到无明的尽头，灭了无明，就灭了生老病死忧悲苦恼了。游于旷野披荒觅路，代表修行十二因缘这条路非常艰苦不易，需要坚韧不拔的毅力，不断地摸索和探索，才能探究出生死的来源和奥秘，从而截断生死的源头，达到涅槃解脱了。</p><p>原文：<strong>今我如是。得古仙人道。古仙人迳。古仙人迹。古仙人去处。我得随去。谓八圣道。正见正志。正语正业。正命正方便。正念正定。我从彼道。见老病死。老病死集。老病死灭。老病死灭道迹。见生有取。爱受触。六入处名色。识行。行集行灭。行灭道迹。</strong></p><p>释：佛说：我现在也像这样找到了古仙人修行的道路，古仙人修行的踪迹，古仙人的所归处。这条道就是八正道：正语、正见、正念、正定、正思惟、正业、正命、正精进。我随着这个八正道，见到了老病死的苦，断了老病死苦的集起，证得了老病死苦的灭，修了老病死苦灭的道；我见到了生的苦，断了生苦的集起，证得了生苦的灭，修了灭生苦的道；我见到了有的苦，断了有苦的集起，证了有苦的灭，修了有苦灭的道。</p><p>我见到了取的苦，断了取苦的集起，证了取苦的灭，修了取苦灭的道；我见到了爱的苦，断了爱苦的集起，证了爱苦的灭，修了爱苦灭的道；我见到了受的苦，断了受苦的集起，证了受苦的灭，修了受苦灭的道；我见到了触的苦，断了触苦的集起，证了触苦的灭，修了触苦灭的道；我见到了六入处的苦，断了六入处苦的集起，证了六入处苦的灭，修了六入处苦灭的道；我见到了名色的苦，断了名色苦的集起，证了名色苦的灭，修了名色苦灭的道；我见到了六识业种的苦，断了六识业种苦的集起，证了六识业种苦的灭，修了灭六识业种苦的道；我见到了身口意业行的苦，断了身口意业行苦的集起，证了身口意业行苦的灭，修了身口意业行苦灭的道。</p><p>原文：<strong>我于此法。自知自觉。成等正觉。为比丘比丘尼。优婆塞优婆夷。及余外道沙门婆罗门。在家出家。彼诸四众。闻法正向信乐。知法善。梵行增广。多所饶益。开示显发。佛说此经已。诸比丘闻佛所说。欢喜奉行。</strong></p><p>释：我对于十二因缘这个法门，能够独自证知，独自觉悟，不由于他，最后修成了无上正等正觉。我成佛以后，为比丘比丘尼、优婆塞优婆夷，及其他外道沙门婆罗门、在家出家四众弟子，让他们能够闻于此法，信乐于解脱法门，走向灭除无明之正道，能够证知此法门之善果，增长梵行，对所有四众弟子能有更多的利益，故我在此开示这个古仙人修证之道。佛说完这部经以后，诸比丘们闻佛所说，都非常欢喜，信受奉行。</p></div>"
},{
    "title": "第三节 十二因缘为谁作",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  十二因缘为谁作</strong></p><p>（二八八）舍利弗与摩诃拘絺罗十二因缘对话</p><p>原文：<strong>尔时。尊者舍利弗。尊者摩诃拘絺罗。在耆阇崛山。尔时尊者舍利弗。晡时从禅觉。诣尊者摩诃拘絺罗。共相问讯庆慰已。于一面坐。语尊者摩诃拘絺罗。欲有所问。宁有闲暇见答与不。尊者摩诃拘絺罗语尊者舍利弗言。仁者且问。知者当答。尊者舍利弗问尊者摩诃拘絺罗。云何尊者摩诃拘絺罗。有老不。答言有。</strong></p><p>释：尊者舍利弗有一天下午从禅定中起身，到尊者摩诃拘絺罗住处，互相寒暄问询以后坐在一侧，对摩诃拘絺罗说：我有个问题想问您，不知道您是否有空闲能够回答我。摩诃拘絺罗说：尊者请问吧，我知道的就会回答您。舍利弗就问拘絺罗说：尊者您怎么认为，世间有老这个现象吗？拘絺罗回答说有。</p><p>原文：<strong>尊者舍利弗复问。有死不。答言有。复问云何。老死自作耶。为他作耶。为自他作耶。为非自非他。无因作耶。答言尊者舍利弗。老死非自作。非他作。非自他作。亦非非自他作。无因作。然彼生缘故有老死。</strong></p><p>释：舍利弗又问：世间有死这个现象吗？拘絺罗回答说：有。舍利弗又问：您怎么认为呢，老死这个现象是自然而有的，还是凭借他缘他因造作出来的？还是自然和他缘共同造作出来的？还是既不是自然而有也不是他缘造作，是没有什么缘因就能出现的？拘絺罗回答说：老死不是自然而有的现象，不是凭借他缘造作出来的，不是自然和他缘和合造作出来的，但也并非不是自然和他缘和合造作出来的，不是没有任何缘由的造作出来的。然而却由于有生的缘故，就有老死相随而生了。</p><p>原文：<strong>如是生有。取爱受触。六入处名色。为自作。为他作。为自他作。为非自他无因作。答言。尊者舍利弗。名色非自作。非他作。非自他作。非非自他作无因作。然彼名色缘识生。</strong></p><p>释：舍利弗又问：同样的，生、有、取、爱、受、触、六入处、名色，这些现象是自然而有的，还是凭借他缘他因造作出来的？还是自然和他缘和合造作出来的？还是既不是自然和他缘和合造作出来的，也不是无因无缘而出现的？拘絺罗回答舍利弗说：生这个现象不是自然而有的，不是依赖他缘造作出来的，也不是自然和他缘和合造作出来的，也并不是非自然和他缘和合而有，非无因无缘而有，然而却由于三界有的缘故，生这个现象就出现了。</p><p>三界有不是自然而有的，也不是依赖他缘而有的，也不是自然和他缘和合而有的，也并非不是自然和他缘和合而有，不是无因无缘而有的，然而却往由于有执取的缘故，三界有就出现了。执取这个现象不是自然而有的，不是凭借他缘造作出来的，也不是自然和他缘和合而有的，也并非不是自然和他缘和合而有，不是无因无缘而有的，然而却由于贪爱的缘故，执取现象就产生了。贪爱不是自然而有的，也不是依赖他缘而产生的，也不是自然和他缘和合产生出来的，也并非不是自然和他缘和合产生出来的，不是无因无缘而出现的，然而却由于受的缘故，贪爱就产生了。</p><p>受不是自然而有的，也不是靠着他缘而出生的，也不是自然和他缘和合出现的，也并非不是自然和他缘和合产生出来的，不是无因无缘而出现的，然而却由于触的缘故，受就产生了。触不是自然而有的，不是依赖他缘出现的，也不是自然和他缘和合而产生出来的，也并非不是自然和他缘和合而有，不是无因无缘而出现的，然而却由于六入处的缘故，触就产生出来了。</p><p>六入处不是自然而有的，不是依靠他缘而出生的，也不是自然和他缘和合而造作出来的，也并非不是自然和他缘和合产生出来的，不是无因无缘而出现的，然而却由于名色的缘故，六入处就出现了。名色不是自然而有的，不是凭借他缘而产生出来的，也不是自然和他缘和合而出生的，也并非不是自然和他缘和合而产生出来的，不是无因无缘而出生的，然而却是由于六识业种的缘故，名色就产生出来了。</p><p>原文：<strong>复问。彼识为自作。为他作。为自他作。为非自非他无因作。答言尊者舍利弗。彼识非自作。非他作。非自他作。非非自他作无因作。然彼识缘名色生。</strong></p><p>释：舍利弗又问：那个六识的业种是自然而有的，还是依赖他缘产生出来的？还是自然和他缘和合而造作出来的？还是既不是自然也不是他缘，是无因无缘产生出来的？拘絺罗回答舍利弗说：六识的业种不是自然而有的，不是单纯依赖他缘而有的，也不是自然和他缘和合而出生的，也并非不是自然和他缘和合出生的，不是无因无缘而产生出来的，然而六识因为有名色的缘故就产生出来了。</p><p>原文：<strong>尊者舍利弗。复问尊者摩诃拘絺罗。先言名色非自作。非他作。非自他作。非非自他作无因作。然彼名色缘识生。而今复言识缘名色。此义云何。尊者摩诃拘絺罗答言。今当说譬。如智者因譬得解。譬如三芦立于空地。展转相依。而得竖立。若去其一。二亦不立。若去其二。一亦不立。展转相依。而得竖立。识缘名色亦复如是。展转相依。而得生长。</strong></p><p>释：舍利弗又问拘絺罗说：您刚才说名色不是自然而有的，不是凭借他缘而产生的，不是自然和他缘和合出生的，也并非不随自然和他缘和合而出生的，不是无因无缘出生的，然而名色因为有六识业种的缘故就出生了。您现在又说六识因为有名色的缘故就出生了，这是什么道理呢？</p><p>拘絺罗回答说：我现在说个譬喻吧，如果是有智慧的人，就会因于譬喻而领悟其中的道理。譬如三根芦苇要立在空地上，必须是三者能够互相依靠，才能立得起来。如果拿掉一根芦苇，其余两根也就立不起来了；如果拿掉两根芦苇，剩下的一根也立不起来了，三者互相依靠在一起，才能立得起来。识与名色互相缘互相依赖也是这样，只有互相依赖才能得以生长。</p><p>名色五阴缘于六识的业种才能出生，这个道理是这样的，由于六识不断造作身口意行，业种存下来，五阴世间就不能灭去，后世还会在三界里继续出生五阴身。由于还有后世的业种，就会有中阴身，有后世的名色。意根在中阴身里随着业种而流转于六道轮回中，就会与阿赖耶识一起投胎，就有了后世最初的名色，名是意根第七识，色是受精卵。六识缘于名色而生，这个道理是这样，当众生的胎儿期的名色继续成长以后，六入处成熟，六根触六尘，就会有六识在名色五阴身中出生。这样名色就与六识是互相依赖的关系，彼此都能出生和运行下去，这样生死就不断了。</p><p>十因缘中还有识缘名色、名色缘识的说法，这里的识就不是六识的识了，而是阿赖耶识的识，是第八识的识。意思是阿赖耶识依于名色五阴的缘才能在五阴世间里有自己的运行和造作，而名色也需要缘于阿赖耶识才能出生、发展和不断的运行，没有阿赖耶识可依，就没有名色的产生，而没有名色阿赖耶识就处于无余涅槃状态。</p><p>原文：<strong>尊者舍利弗言。善哉善哉。尊者摩诃拘絺罗。世尊声闻中。智慧明达。善调无畏。见甘露法。以甘露法具足身作证者。谓尊者摩诃拘絺罗。乃有如是甚深义辩。种种难问。皆悉能答。如无价宝珠。世所顶戴。我今顶戴尊者摩诃拘絺罗。亦复如是。我今于汝所。快得善利。诸余梵行。数诣其所。亦得善利。以彼尊者善说法故。我今以此尊者摩诃拘絺罗。所说法故。当以三十种赞叹。称扬随喜。</strong></p><p>释：舍利弗赞叹说：太好了，摩诃拘絺罗，您是世尊的声闻弟子中智慧明达者，善于调伏自心，无所畏惧，证见佛法的甘露，因为完全证得了解脱的甘露法，能以身作证：我身已尽，梵行已立，所作已作，自知不受后有。您具有如此的甚深法义无碍的辩才，他人种种的问难，都能解答应辩，您就像无价宝珠一样为世人所顶戴。我现在顶戴尊者摩诃拘絺罗也是这样，我现在在您这里得到了善法的利益，以及其他的梵行也在与您多次的请教交流中得到了善利。因为尊者您善于说法的缘故，我现在对于拘絺罗尊者所说的法教，应当给与三十种赞叹，称扬功德并且随喜功德。</p><p>（二八九）如何于五蕴生厌得解脱</p><p>原文：<strong>尔时。世尊告诸比丘。愚痴无闻凡夫。于四大身厌患。离欲背舍。而非识。所以者何。见四大身。有增有减。有取有舍。而于心意识。愚痴无闻凡夫。不能生厌。离欲解脱。所以者何。彼长夜于此。保惜系我。若得若取。言是我我所相在。是故愚痴无闻凡夫。不能于彼生厌。离欲背舍。</strong></p><p>释：佛告诉诸比丘们说：心性愚痴对于解脱法没有什么见闻的凡夫，对自己的四大组成的色身能够生起厌离心，离开对色身的种种欲望，能够背弃色身，不顾念色身。但是他们对于识心可不是这样，对于识心不能够离欲、背弃、舍离。为什么会这样呢？因为凡夫们能看得到四大组成的色身是有增减变化的，是无常的，不是固定不变的，因此于色身可以取着也可以舍弃。</p><p>而对于自己的意识心和意根，愚痴没有见闻的凡夫却不能生起厌离心，不能离欲和解脱。为什么如此呢？因为他们在漫长的生死长夜中，对于自己的心识特别爱惜，把识心当作是我而生系缚，有所得有所取，说这就是我，是我所有，我在识里，识在我里，我与识互相存在。因此说愚痴没有见闻的凡夫才无法于识心生厌离欲，不能背舍识心。</p><p>佛陀用到了愚痴无闻凡夫这些词语，虽然有些人不太喜欢听，但是佛并不是骂辱人，佛是在陈述事实，凡夫就是愚痴没有什么见闻的。没有听过正法，无明深重就是愚痴无闻，如果有见闻就会破除愚痴，变得有智慧了。</p><p>色身比较容易被众生看破，因为生灭变异比较明显。色身由地、水、火、风四大种子和合而生，地大有坚硬的性质，如肌肉、骨骼、筋、头发、指甲、牙齿、皮肤等这些物质都有坚硬性，就含有地大种子；如果没有坚硬性，就不能行住坐卧。水大有湿润的性质，身体表面皮肤和内脏器官、血液、汗液、尿液等等都有湿性，都含有水大种子。火大有温暖性，身体内外都有温度，这就是火性，含有火大种子。人死以后没有火大了，尸体就是冰凉的。风大有流动性，呼吸和血液的流动、气脉的运行都是风性的作用，含有风大种子，如果没有风性血液就不能流动，饮食也不能流动消化吸收和排泄。</p><p> 所有色法都是地、水、火、风按照一定的比例和合而成的，哪种成份居多，物质就以哪个性质为主，和合的比例不一样，形成的物质就不一样，身体各部位器官也就不一样。不止是我们的色身，宇宙世界的所有物质都由四大组成，四大和合的比例不同，所形成的物质就不同。色声香味触法六尘都是由四大组成，都属于色法，只不过是表现的形式不一样，识别色法的识心就不同。四大种子存在如来藏里，如来藏输送四大种子形成色身，所以色身是由如来藏所出生的。</p><p>身体的增减变化，如胖瘦，身体器官的安置和摘除，有这些增减变化，说明这个身体就是一个假的不实的。看破色身的生灭变异性，就能够生起厌离心，也能够离欲和背舍，不想随顺，不再想保惜爱护，觉得身体无所谓，就是一个假皮囊，不是真实的我。</p><p>但是愚痴没有什么见闻的凡夫众生对于识心却不能生起厌离，不能离欲，也不能背舍。根源在哪里呢？因为众生都喜欢贪执识的作用，识的作用比较逼真和吸引人，所以就不断抓取，据为己有。色身的一切功能作用都是因为有识才会产生，比如行走坐卧，没有身识就不能进行，行走坐卧是身识所起的作用，生命活动离不开行住坐卧这些事业，所以众生贪恋。有身识能动，有眼识能看，有耳识能听，有鼻识能闻香，有意识心能思考分别、分析判断、推理、打妄想，各个识配合产生种种作用，意识心和前五识一起在分别，一起作用。这些功能作用感觉是真真切切，活灵活现的，这就是我和我所有的，因此贪恋不舍。</p><p>识心非我不容易证，明明感觉有一个我能了知一切法，很真实，我确实是坐在这听法，我眼能见色，确实能看见所接触的一切物质色法；我确实能够听到声音，不认为眼耳鼻舌身的见闻觉知作用是虚妄的，于是就抓着不放。对于意识的种种作用更不能认可是虚妄的，觉得意识确实能思考、能打妄想、能推理，能计划，所以众生不能把识心看成是虚妄的，但这一关如果不过去，大小果都不能得证。</p><p>所以佛说：愚痴无闻的凡夫对于四大色身能够生起厌离，能够离欲，也能够背舍，但是对自己的识心却不能够离欲，不能够生厌，不能够背舍，喜欢自己的心，事事都要顺着自己的心去做，对自己的心不能够离欲，因为感觉这个识心确实有这些功能作用。</p><p>众生生生世世在生死长夜里保惜系我，总是顺己之意，爱护着自己，保惜着自己的识心。我要得到什么，我要拥有什么，我要占有什么，都是这个识心的意愿，于是就把这个识心的功能作用当作我，当作真实存在的、永恒不灭的自己。其实识心在几种情况下是灭的，比如说在听法时，听着听着就睡着了，后面讲什么也不知道了，这时候识心是灭的不存在的。当睡着了也没有梦，这个时候六识心也是灭的不存在的。当你睡醒了以后，这几个识心又现起来了，有灭有生，能生能灭，识心总是在生灭的过程中变化着。</p><p> 而阿赖耶识的功能作用，总是那样存在着，没有变化，不需要依靠外缘，功能作用都没有变化。阿赖耶识总能产生一切法，变现一切法，谁也阻碍不了祂，那个才是真实的，不管是入定了还是睡着了，不管什么情况，祂总是存在着，总有祂的功能体性作用，前六识就不行，总是生灭变化的。</p><p>原文：<strong>愚痴无闻凡夫宁于四大身。系我我所。不可于识。系我我所。所以者何。四大色身。或见十年住。二十三十。乃至百年。若善消息。或复小过。</strong></p><p>释：佛说：愚痴无闻的凡夫宁可把四大组成的色身当作我和我所，也不能把识心当作我和我所。为什么这样说呢？因为四大组成的色身，只能住世十年、二十年、三十年乃至于一百年就灭去了，如果能够好好的照顾色身，或许住世还能超过一百年。</p><p>原文：<strong>彼心意识。日夜时克。须臾转变。异生异灭。犹如猕猴。游林树间。须臾处处。攀捉枝条。放一取一。彼心意识。亦复如是。异生异灭。</strong></p><p>释：可是心意识不分日夜时刻，须臾都在流转着，刹那刹那都在发生着变化，此时生彼时灭，此处生彼处灭。犹如猿猴在树林间游荡一样，只一会儿的功夫就游历了很多地方，爬到树上抓取着枝条，松开这个树枝就抓取另一个树枝，总不清闲。人们所说的心意识也是这样，异生异灭，此时生彼时灭，此处生彼处灭，在此法生在彼法上灭，在彼法上生在此法上灭，在此身上消失，在彼身上又生，日夜时刻，种种转变，从来没有停止过，异时而生，异地而生，异类而生。</p><p>凡夫的我见最严重的就是认为识心的功能作用是我，是我所有的，这个我见最难断除。色身我见断除稍微容易一些，因为色身的生灭变异的现象容易观察到，与识心能够分开。识心的生灭变异现象不容易观察和了解，因为五阴身的一切功能作用都是识心的，太绵密和连续了，所以就感觉真实，觉得是自己在作用，是自己的作用，很难把识心的受想行识的作用与自己分开和看破。</p><p>如果把识心当作我和我所，到临命终时，就想牢牢地抓住识心，一心想要见闻觉知，恐惧见闻觉知慢慢消失，明明感知到识心的功能作用越来越微弱，身体越来越不管用，但就是不想灭掉识心，感觉非常痛苦，接受不了死亡这个现象。即使是这样，凡夫也不认为自己的识心是无常生灭变异的，仍然希望这些作用再继续起用。</p><p>原文：<strong>多闻圣弟子于诸缘起。善思惟观察。所谓乐触缘生乐受。乐受觉时。如实知乐受觉。彼乐触灭。乐触因缘生受。亦灭止。清凉息没。如乐受。苦触喜触。忧触舍触因缘。生舍受。舍受觉时。如实知舍受觉。彼舍触灭。彼舍触因缘生舍受。亦灭止。清凉息没。</strong></p><p>释：多闻圣弟子对于一切的缘起法要善于思惟和观察，观察到如果有乐触的因缘聚合起来的时候，就生起了乐受；当感觉到乐受的时候，要如实的了知乐的受觉；当乐触灭了时，乐触因缘出生的受觉也灭了，心得清凉息止灭没。就像乐受一样，当苦触生起的时候，要如实的了知苦的觉受，乃至于当喜触、忧触、舍触因缘生起喜的觉受、忧的觉受和舍的觉受时，要如实的了知喜受、忧受和舍受。当喜触、忧触和舍触的因缘灭了时，喜触忧触和舍触也灭了，心得清凉寂止。</p><p>原文：<strong>彼如是思惟。此受触生。触乐触缚。彼彼触乐故。彼彼受乐。彼彼触乐灭。彼彼受乐亦灭止。清凉息没。</strong></p><p>释：多闻圣弟子应该如是思惟，由于这些受触能引生触的乐受和触的束缚，当一个个触的乐受生起来的时候，一个个的乐受就生起来了；当一个个的乐触都灭了以后，一个个的受乐也就灭掉了，心得清凉寂止。</p><p>多闻圣弟子能够于诸缘起善思惟观察，世间的一切法都是因缘所生，没有一法不是因缘所生的，有因有缘世间法就集起来了，无因无缘，法不现起。缘不同，出生的法就不同，众生的色身就不同，生存环境也不同。缘是哪里来的？身口意业形成的种子。多闻圣弟子能够于诸缘起善思惟观察，而凡夫就不善于思惟观察，他们认为五阴上的一切法出现都是正常的，理所当然的。圣弟子观察缘起时，深究生老病死的来源和因缘，一直探究到最初的那个缘起。</p><p>用乐受来举例因缘生法，苦触、喜触、忧触、舍触都是因为缘生而产生的感受，苦乐忧喜舍，这些受的产生都是因为有触的缘故，有苦的触、乐的触、喜的触、忧的触、舍的触才有种种感受，如果没有这些触的缘，就不会产生这些心的感受。所以苦乐忧喜舍的触都是虚妄的，感受也是虚妄的、生灭变化无常的。所有缘生起的背后都是有原因、有奥秘的。 </p><p>什么叫舍受？不感觉苦也不感觉乐，不感觉舒服也不感觉痛苦，觉得好象把自己淡忘了，没有其它更多的感受，这叫舍受。什么时候会产生舍受？打坐中出现的舍受比较多。偶尔之间好象把自己忘了，周围的一切都忘了，不产生乐的受，不产生苦的受。那时候就是舍受。心有定的时候就能清晰感觉到，我现在正在苦受，我现在正有乐受，我现在正有喜受，我现在正有忧愁的感受，我现在确实知道这些感受，我如实觉知。如果那些苦乐忧喜舍的触灭了，苦乐忧喜舍的受也会消失灭去。灭了以后就寂静下来，止息下来，心就清凉了，寂静了。</p><p>原文：<strong>如是。多闻圣弟子于色生厌。于受想行识生厌。厌故不乐。不乐故解脱。解脱知见。我生已尽。梵行已立。所作已作。自知不受后有。</strong></p><p>释：如是，多闻圣弟子对于色阴生起厌离心，对于受阴、想阴、行阴、识阴生起厌离心，生厌的缘故就不乐于色受想行识，不喜欢色受想行识，心就解脱，这样就具足了解脱的知见，于是就说：我的生命就要结束了，清净的梵行已经建立起来了，我这一生所作的事都已经做完了，我自己知道我死后不会再有未来世的三界世间，不会有未来世的三界法。</p></div>"
},{
    "title": "第四节 灭苦解脱之道",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第四节  灭苦解脱之道</strong></p><p>（二九〇）观行触缘受得解脱</p><p>原文：<strong>譬如两木相磨。和合生火。若两木离散。火亦随灭。如是诸受缘触集。触生触集。若彼彼触集故。彼彼受亦集。彼彼触集灭故。彼彼受集亦灭止。清凉息没。多闻圣弟子如是观者。于色解脱。于受想行识解脱。于生老病死忧悲恼苦解脱。我说彼于苦得解脱。佛说此经已。诸比丘闻佛所说。欢喜奉行。</strong></p><p>释：佛说：譬如有两根木头互相接触磨擦，一会火就生起来了，如果两根木头分开了，火就随着灭了。像这样，所有的受都是缘着触而集起来的，都是由于触生起来的，都是由于触集起来的。如果一个一个的触集起来的时候，一个一个的受也就集起来了。一个一个触集灭了以后，一个一个的受集也就灭了，心就清凉止息寂静了。多闻圣弟子像这样观行，就会对于色蕴得解脱了，对于受想行识蕴得解脱了，对于生老病死忧悲苦恼得解脱了。这样的话，我就说他们对于苦得解脱了。</p><p>佛用两根木头互相摩擦生火来比喻触集受就集的缘生之理，两根木头摩擦就会生火，如果两根木头不接触，触的因缘没有了，火就没有了。众生的苦恼因缘是由触而产生，如果触这个因缘没有了，不再触了，也就没有受了，触的因缘没有了，就没有受的感觉了。</p><p>不管哪一种受，触缘如果是积集起来了，就有受集产生，缘不断集就不断，有集就有触，有触就有受。触产生了，触集起来了，就会有受集，受的产生条件就是先接触，接触是缘的作用，没有缘是无法接触的。万事万物都依靠缘才能产生和存在，而缘是由前世的业缘产生的。触灭了受就灭，受集灭了以后就心得灭止、清凉、息没。</p><p>佛让众生认识到触集就是受集，有触就有受，触是虚妄的，受也是虚妄的。受是以意识心为主产生的受，触是由六根和六尘相触产生，这其中需要有缘才能相触，所以一切事物产生都是要有缘起，没有缘就没有起，有缘就生起。缘起的法也是虚妄的，是依靠众缘和合产生的，也就是不真实的。只有第八识如来藏不依靠条件而有，不是集起的因缘法。</p><p>（二九一）观察内触法得解脱</p><p>原文：<strong>尔时。世尊告诸比丘。我说内触法。汝等为取不。时有异比丘从座起。整衣服。稽首礼足。合掌白佛言。世尊所说内触法。我已取也。时彼比丘于佛前。如是如是。自记说。如是如是。世尊不悦。尔时尊者阿难。在佛后执扇扇佛。佛告阿难。如圣法律内触法。异于此比丘所说。阿难白佛。今正是时。惟愿世尊。为诸比丘。说贤圣法律内触法。诸比丘闻已。当受奉行。</strong></p><p> 释：世尊告诉诸比丘们说，我所讲的内触法，你们能观察得到吗？ 这时候有一个从外边新来的比丘从座上站起来，整理衣服礼佛足，合掌对佛说：世尊所说的内触法，我已经观察到了。这时这个比丘就在佛前种种说法印证自己，但他的哪种说法世尊听着都不高兴。这时候尊者阿难在佛身后手拿扇子为佛扇扇子，佛告诉阿难说：如贤圣法和律则所说的那个内触法，跟这个比丘所说的内触法是不一样的。阿难对佛说，现在正好可以讲一讲，惟愿您世尊为比丘们说如贤圣法和律则那样的内触法，比丘们听闻后应当信受奉行。</p><p>什么叫内触法？就是胜义根之内的触，眼触色、耳触声、鼻触香、舌触味、身触触尘，意触法，触以后产生识，识再触尘，</p><p>原文：<strong>佛告阿难。善哉。谛听。当为汝说。此诸比丘取内触法。应如是思惟。若众生所有种种众苦生。此苦何因何集。何生何触。作如是取时。当知此苦亿波提因。亿波提集。亿波提生。亿波提转。</strong></p><p>释：佛告诉阿难说：好啊，你们仔细听着，我现在就为你们说了。你们这些比丘如果要观察内触法，应当这样思惟：如果众生所有的种种苦恼生起来时，这些苦恼的因是什么？苦恼是由于什么法集起来的？是什么法生起了才有这些苦恼？是什么触生起了才有这些苦恼？当这样观察内触法时，就应当知道这些苦恼是由于取的因而出现的；是取集起来了苦恼就集起来了；是取出生了苦恼就出生了；是取流转出来了苦恼就流转出来了。</p><p>原文：<strong>复次比丘。取内触法。又亿波提。何因何集。何生何触。彼取时当复知。亿波提爱因爱集。爱生爱触。复次比丘。取内触法。当复知爱何因何集。何生何触。如是取时。当知世间所念。谛正之色。于彼爱生而生。系而系。住而住。</strong></p><p>释：复次，比丘，你们观察内触法时，应当观察什么法又是取出生的因？什么法集起来了取就集起来了？什么法出生了取就出生了？什么法触了取就触了？你们观察时应当知道，是因为贪爱的原因取出生了，是因为贪爱集起来； 取就集起来了，贪爱产生了取就出生了，贪爱触了取就触了。</p><p>诸比丘们，观察内触法时，还应当观察，贪爱的产生是由于什么原因？是什么法集了贪爱就集了？是什么法出生了贪爱就出生了？是什么法触了贪爱就触了？像这样观察时，应当知道世间人心里所念着的精细纯正之色阴时，贪爱就生起来了，色阴生起来了；心念被贪爱所系缚的时候色阴就被系缚了；心念被贪爱所捆住的时候色阴就被捆住了。</p><p>这是世尊讲的十二因缘法中的一部分，前面讲的是触集是受集的因，现在讲的是爱集是取集的因，有了爱就有了取，有了取就有生老病死、忧悲苦恼的苦。因为贪爱的原因，就取着六尘，取了之后就有了有，有了有就有生，生了以后苦就出来了。</p><p>原文：<strong>若诸沙门婆罗门。于世间所念。谛正之色。作常想恒想。安稳想。无病想。我想我所想而见。则于此色爱增长。爱憎长已。亿波提增长。亿波提增长已。苦增长。苦增长已。则不解脱生老病死。忧悲恼苦。我说彼不解脱苦。</strong></p><p>释：如果沙门婆罗门对世间人所忆念的精细纯正之色声香味触法，作常想、恒想、安稳想、无病想、我想、我所想，生起这些知见以后，对色受想行识的贪爱就会增长；贪爱增长以后，取就增长；取增长以后，苦就增长了；苦增长以后，对于生老病死忧悲恼苦就不能解脱，我说他们对于苦是不解脱的。</p><p>恒是永远不变不灭的，安稳就是固定永远不变的，永远是我的，无病是没有过患的意思。众生不把这六根六尘六识当作有过患的，当成是我，当成是我所有的，就会去追求、贪爱、抓取，这样生死轮转就不断。如果知道这些法都是有过患的，能生起生老病死忧悲苦恼，就不会再去追求这些法了。</p><p>有这些念想，色爱就会增长，就会越来越贪，贪爱越增长，生死越无法了断，苦恼越多。这种贪爱增长起来后，执取就会增长，三界的有肯定也会随着要增长的，三界的有增长起来后，生命就不断，苦就不断增长。贪爱越重苦越多越增长，就越不能解脱生老病死忧悲苦恼。众生都追求乐，结果都受苦，因为众生一直都在造作苦因，有贪爱就有苦。阿罗汉没有贪爱，也不执取，当然就不再有生老病死苦了。</p><p>原文：<strong>譬如路侧。清凉池水。香味具足。有人以毒著中。阳春之月。诸行路者。风热渴逼。竞来欲饮。有人语言。士夫。此是清凉池。色香味具足。然中有毒。汝等勿饮。若当饮者。或令汝死。或近死苦。</strong></p><p>释：佛比喻说：譬如路边有一个清凉池，池水香味具足，有人把毒放在池水中，那么当春天来临，天气转暖的时候，那些路过的人因为炎热而感觉非常口渴，就想喝这池井里的水。当他正想喝水的时候，旁边有人告诉他：这个清凉池水，虽然色香味俱足，但是水里边有毒，你们不要喝了，如果喝了就会死，不死也会得一场大病。</p><p>原文：<strong>而彼渴者。不信而饮。虽得美味。须臾或死。或近死苦。如是沙门婆罗门。见世间可念。端正之色。作常见恒见。安稳见。无病见。我我所见。乃至不得解脱。生老病死。忧悲恼苦。</strong></p><p>释：但是想喝水的人，因为口太渴而不相信旁边人的告诫，于是就喝了，虽然喝水时感觉清凉美味，但是喝完以后毒发作了，那些人或者马上就死了，或者难受的快要死了。与清凉池的譬喻一样，沙门婆罗门看见世间可爱端正之色，当作是恒常不灭的，当作是安稳不变的，当作是没有任何过患的，当作是我和我所有的，因为有这些知见就不能解脱生老病死忧悲苦恼。</p><p>原文：<strong>若诸沙门婆罗门。于世间可念端正之色。观察如病如痈。如刺如杀。无常苦空非我。彼爱则离。爱离故亿波提离。亿波提离故则苦离。苦离故则生老病死忧悲恼苦离。</strong></p><p>释：如果沙门、婆罗门看见世间可念端正之色，观察这些色相就像有病患的一样，就像痈疮一样，就像芒刺一样，就像杀戮一样，都是无常苦空无我的，贪爱就离开了；贪爱离开了，取就离开了；取离开了，苦就离开了；苦离开了，生老病死忧悲苦恼就离开了。</p><p>原文：<strong>譬如路侧清凉池水。香味具足。有人以毒著中。阳春之月。诸行路者风热渴逼。竞来欲饮。有人语言此水有毒。汝等勿饮。若当饮者。或令汝死。或近死苦。彼则念言。此水有毒。若当饮者。或令我死。或近死苦。我且忍渴。食干麨饭。不取水饮。</strong></p><p>释：譬如路边的清凉池水，香味具足。有人把毒放入水中，行路的人口渴想喝水时，别人告诉他们这水有毒，你们不要喝，如果喝了，就会或者马上死亡，或者痛苦得就像要死了一样。喝水的人一想，这里的水有毒，有毒的水是不能喝的，喝了就会死，那就暂且忍受一下干渴，只吃干炒饭，不喝水。于是这些路人就离开了，不喝毒水，因此就不会中毒而死。</p><p>那我们以后就要在心中警记着：别再喝毒水。一念贪爱生起就对自己说：我不能再贪爱了，我不能再喝毒水了；一喜欢什么法就对自己说：我不能再喜欢了，一喜欢就如在喝毒水；一舍不得时就对自己说：我不能再舍不得了，一舍不得就是在喝毒水。慢慢这个贪爱就淡了，随后就会灭了，最后苦就没有了，这样一点一点地警醒自己，最终就能走上解脱之路。</p><p>原文：<strong>如是沙门婆罗门。于世间可念之色。观察如病如痈。如刺如杀。无常苦空非我。乃至解脱。生老病死。忧悲恼苦。是故阿难。于此法如是见。如是闻。如是觉。如是知。于过去未来亦如此道。如是观察。是故阿难。于此法如是见。如是闻。如是觉。如是知。于过去未来。亦如此道。如是观察。</strong></p><p>释：如是，沙门、婆罗门对于世间可念可爱之色，观察其如病一样，如痈疮一样，如刺一样，观察其无常、苦、空、非我性，这样就会远离贪爱了，就能解脱生老病死忧悲恼苦。阿难，因此说对于此内触法应该如是见、如是闻、如是觉、如是知，对于过去、未来的内触也要如是对待，如是观察。观察来观察去，最后就证得了一切法都是无常的、苦的、空的、无我的，那么就不再贪爱和执取，生老病死忧悲恼苦就灭去，心得解脱、清凉、寂静。</p><p>（二九二）苦灭之道</p><p>原文：<strong>尔时。世尊告诸比丘。云何思量观察正尽苦。究竟苦边时。思量众生所有众苦。种种差别。此诸苦何因何集。何生何触。思量取因取集。取生取触。若彼取灭无余。众苦则灭。彼所乘苦灭道迹。如实知。修行彼向次法。是名比丘向正尽苦。究竟苦边。所谓取灭。</strong></p><p>释：世尊告诉诸比丘说：思量和观察如何才能完全彻底的灭尽苦，到达究竟苦的边缘时，应该思量众生的所有苦，以及这些苦的种种差别相，思量这些苦是由于什么因缘出现的，是什么法的集起所感召出来的，是什么原因生出来的，是什么法的触所产生出来的。</p><p>最后思量出是取的原因使得苦出现的，是取的集起导致苦出现的，是取的出生导致苦出生了，是取的触产生了苦。如果那些取都灭尽了再也没有剩余，一切苦就会都灭了。比丘们应该对修习灭苦的修道方法如实的了知，并且要修行趣向于正尽苦的助道法和次要法，这样比丘们就能趣向于正尽苦，能究竟到达苦的边缘，这就是把取灭掉的方法。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边。时思量彼取何因何集。何生何触。思量彼取爱因爱集。爱生爱触。彼爱永灭无余。取亦随灭。彼所乘取灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓爱灭。</strong></p><p>释：复次，比丘想要思量和观察如何才能正尽苦，到达究竟苦的边缘时，就应该要思量取是什么因缘出现的，是什么法集起了而出现的取，是什么法产生导致取的产生，是什么法触了导致取的产生，最后就会思量出取的出现是因为贪爱的原因，是贪爱集起的因缘产生的，贪爱出生了取就出生了，贪爱触了取就出生了，贪爱灭了取就随之灭了。比丘们对所修的灭除取着的道迹和路径要如实的了知，并且要修行趣向灭苦的法和帮助灭苦的次要法。这就是比丘渐渐趣向于正尽苦的方法，能究竟到达苦的边缘，就是贪爱灭尽。</p><p>众生如果把取灭了，不再取着诸法，众苦就会灭了。究竟如何灭苦，中间要修的道是什么，我们应该要如实的了知，如实了知灭苦的修行方法，就是修习趣向正尽苦的向法和次法，就是三十七道品包括四正勤、四如意足、五根、五力、七觉支、八正道。向就是朝向趣向灭苦的方向，次就是次要的有帮助的法，主要的法就是观察五蕴断我见，修习向次法的目的是为断我见做准备，满足见道的前提条件，才能如理观察和观行，最后才能断我见。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边。则思量彼爱何因何集。何生何触。知彼爱受因受集。受生受触。彼受永灭无余。则爱灭。彼所乘爱灭道迹如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓受灭。</strong></p><p>释：复次，比丘要思量和观察如何达到正尽苦，达到究竟的苦的边缘，就要思量贪爱是由于什么因缘生出来的，是什么法集起所产生出来的，是什么法出生而产生的，是什么法触了而产生的。思量观察之后，就知道了贪爱是因为受的因缘而产生出来的，是受集起了而产生出来的，是受出生了导致了贪爱的出生，是受触了导致贪爱出生了。如果受永远灭尽了，贪爱就会灭尽了。比丘们对所修的爱灭修道的轨迹要如实了知，并且要修习向法和助道法，这样比丘们就能趣向正尽苦，到达究竟的苦的边缘，就是所说的灭除受觉。</p><p>受之前是触，不触就不能产生受，没有受就不能有贪爱，没有贪爱就不能取。众生每天都触不断，六根不触六尘就感觉受不了。为什么感觉受不了？因为无明，触的根源就是无明。只有真正的修行人意根得到了降伏，停止了攀缘，证得了空，才能不愿意再触了，才能受得了寂静。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边时。思量彼触何因何集。何生何触。当知彼触六入处因。六入处集。六入处生。六入处触。彼六入处灭无余。则触灭。彼所乘六入处灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。</strong></p><p>释：复次，比丘要思量和观察如何才能正尽苦，到达究竟的苦的边缘，还要接着思量观察触是依据什么因缘法出现的，是什么法集起产生的，是什么法出生之后引发出来的，是什么法触了之后出生的。观察之后应当知道，触是由于六入处的因缘出现的，是由于六入处的集起而出现的，是六入处的产生导致了触的出现，是六入处触了致使触就产生了。只有六入处灭尽无余了，触就灭。比丘们对自己所修习的六入处灭尽的轨迹应该如实了知，修习趣向正尽苦的向道法和次要法，这就是比丘向于正尽苦，能到达究竟的苦的边缘。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边时。思量彼六入处。何因何集。何生何触。知彼六入处。名色因。名色集。名色生。名色触。名色永灭无余。则六入处灭。</strong></p><p>释：复次，比丘思量观察正尽苦，想要到达究竟的苦的边缘时，就要思量六入处是由于什么因缘法生起来的，是由于什么法的集起而出生的，是由于什么法的出生而随之出生的，是由于什么法触了就随之出生了。观察之后就应当知道六入处是名色因缘所产生的，是名色的集起所产生的，是名色的产生导致了六入处随之出生了，是名色触了就引生了六入处的出生。当名色都灭尽没有剩余的时候，六入处就随之灭尽了。</p><p>原文：<strong>彼所乘名色灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓名色灭。</strong></p><p>释：比丘们对于自己所修习的名色灭尽的道迹，应该如实的了知，并且要修习向道之法和次要助道之法，这就是比丘向于正尽苦，到达究竟的苦的边缘，就是所说的灭尽名色。</p><p>有名色五阴就有六入，有众生就有六入，除非是六根不全，六入处出现的因缘就是因为有名色。名色是从什么时候开始出现的？是从受精卵开始出现的，一直到出母胎以后长成肉身，直至死亡这个阶段，就是一期名色。五阴就是色受想行识，色就是身体，名就是七个识和七个识的功能作用。五阴组成了众生，众生就叫作名色，名色也叫作五阴。有名色有受精卵，就会长出眼耳鼻舌身五根，长出五根然后就触，触了就有受，受了就有爱，爱后就有取，取了就有有，有了就生，生之后就有老病死忧悲苦恼，这是一个生死因缘链。</p><p>比丘再思量观察如何灭苦到达究竟苦边时，应该思量六入的因都是因为名色，名色集了六入集，名色生了六入生，名色触六入就触，把名色永灭无余了，六入就灭了。如何灭名色呢？这就要修习向法、次法、助道之法，修习了以后再逐一观行，就能灭名色、灭五阴。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边时。思量名色。何因何集。何生何触。知彼名色。识因识集。识生识触。彼识欲灭无余。则名色灭。彼所乘识灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓识灭。</strong></p><p>释：复次，比丘思量和观察正尽苦，想要到达究竟的苦的边际，就要思量名色是由于什么因缘而出生的，是由于什么法集起了而出生的，是什么法出生了名色才出生的，是什么法触了名色出生了。</p><p>观察思量后就知道了名色的出生是由于六识业种的因缘而出生的，是由于六识业种集起了而出生的，是由于六识业种出现了就引生了后世名色的出生，是由于六识业种触了导致后世名色的出生。六识的业种如果灭尽无余了，名色就会随之而灭尽。比丘们对于修习灭尽六识业种的道迹应该要如实的了知，应该要修习向道之法和次要的助道之法，这就名为比丘趣向于正尽苦，到达究竟苦的边际，就是所说的灭尽六识的业种。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边时。思量彼识。何因何集。何生何触。知彼识行因行集。行生行触。作诸福行。善识生。作诸不福不善行。不善识生。作无所有行。无所有识生。是为彼识行因行集。行生行触。彼行欲灭无余。则识灭。彼所乘行灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓行灭。</strong></p><p>释：复次，比丘如果要思量观察正尽苦，到达究竟的苦边，应该思量六识的业种是因于什么因缘产生出来的，是什么法集起了六识的业种就出现了，是什么法生了六识的业种就生了，是什么法触了六识的业种就出生了。经过观察思量以后就知道了，六识的业种是由于身口意行的因缘产生的，是身口意行集起了六识的业种出生了，是身口意业行生起了六识就出生了，是身口意业行触了六识的业种就出生了。</p><p>如果造作福行善行，善的六识业种就出生了；如果造作非福行不善行，不善的六识业种就出生了；如果造作不善不恶行，不善不恶的六识业种就出生了。这叫作身口意行的因缘、身口意行的集决定了六识业种的出生，身口意的行生、行触就导致六识业种出生了。如果身口意行灭尽再也没有一丝业行了，那么六识的业种就会随之而灭尽。比丘们应该对所修行的行灭的修道之路，要如实的了知，应该要修习向道之法和助道之法。所以如果行灭了比丘就会趣向正尽苦，到达究竟苦边。</p><p>因为在六根上的身口意业行不断，六识的业种就会不断地产生，业种留下以后就有未来世的名色。如果没有了任何身口意业行，六识的业种就不会出生，没有业种留存，就没有未来世的名色。名色出生以后就会有六入，有六入就会有触，有触就会有受，有受就会有贪爱，有贪爱就会有执取，然后三界的有就会出现，五阴身就会出生，从此生命不断，生老病死忧悲苦恼又循环往复起来了。这都是因为身口意业行不断导致的结果。</p><p>原文：<strong>复次。比丘思量观察正尽苦。究竟苦边时。思量彼行何因何集。何生何触。知彼行无明因。无明集。无明生。无明触。彼福行无明缘。非福行亦无明缘。非福不福行亦无明缘。</strong></p><p>释：复次，比丘如果要思量观察正尽苦，到达究竟苦边，就要思量观察身口意业行是什么原因产生出来的，什么法集起了身口意业行就出现了，什么法生了身口意业行就生了，什么法触了身口意业行就出生了。思量后知道了身口意业行是由于无明的缘故才出现的，是无明集起了身口意业行就出生了，无明生了身口意业行就生了，无明触了身口意业行就出现了。造作福业的身口意业行是由于无明的缘故产生的，造作非福不善的身口意行是由于无明的缘故产生的，乃至于造作不是福的心行也非不是福的身口意业行是由于无明的缘故产生的。</p><p>原文：<strong>是故当知。彼行无明因。无明集。无明生。无明触。彼无明永灭无余。则行灭。彼所乘无明灭道迹。如实知。修习彼向次法。是名比丘向正尽苦。究竟苦边。所谓无明灭。</strong></p><p>释：因此比丘们应当知道，身口意业行是以无明为因缘而出生的，是因为无明的集起而出生的，是因为无明的出生而出生的，是因为无明触了而出生的。如果意根的无明永远灭尽无余，身口意业行就会随之灭尽了。比丘们对所修习的灭尽无明的道迹应该如实了知，应该修习向道之法和助道之法，这样才叫作比丘趣向于正尽苦，到达究竟的苦边，就是所说的灭尽无明。</p><p>原文：<strong>佛告比丘。于意云何。若不乐无明而生明。复缘彼无明。作福行非福行。无所有行不。</strong></p><p>释：佛对比丘们说：你们怎么认为这件事，如果你们不喜乐无明，而心中生起了明，那么你们以后还会由于意根的无明去造作福行和非福行，或者造作非福行非非福行的舍行吗？</p><p>明和无明是两个对立的面，如果有无明就没有明，如果有明就没有无明，无明少一些，剩下的就是明，如果都是明，那无明就没有了。就如天平的两头，无明要高了，明就低了，有无明就没有明，有明就没有无明。无明如果没有了，六识就不会去造作身口意行了，也就不会留下业种了，不会再去投胎，也就不会再有名色，没有名色就没有六入；没有六入就不触，没有触就不受；没有受就不去贪爱，不去贪爱就不想抓取；不想去抓取占有，就没有生存的条件，也就没有了三界的有；没有了有，名色就不会出生，那么老病死忧悲苦恼就都灭了，不会再出现，生死苦的问题就解决了。</p><p>这样比丘们就会出离三界，得到解脱，不过这种解脱还不是究竟的解脱，只是灭了一念无明暂时解脱而已，还有极多的微细无明没有灭除，因此还有微细的生死苦没有灭，解脱就不究竟，佛的解脱才是究竟的解脱。怎样才能如佛一样究竟解脱呢？那就不要出三界，发大誓愿，继续修习大乘，保留五蕴身，自度度他，上求下化，圆满一切法，才能究竟的解脱。</p><p>原文：<strong>比丘白佛。不也世尊。所以者何。多闻圣弟子。不乐无明而生明。无明灭则行灭。行灭则识灭。如是乃至。生老病死。忧悲恼苦灭。如是如是。纯大苦聚灭。</strong></p><p>释：比丘回答世尊说：没有无明就不会再造作任何行了，世尊，因为多闻圣弟子如果不喜乐于无明，无明灭了就生起了明，那么无明灭了身口意业行就灭了，身口意业行灭了六识的业种就灭了，六识业种灭了后，生老病死忧悲恼苦，如是乃至于纯大苦聚就都灭了。</p><p>原文：<strong>佛言。善哉善哉。比丘。我亦如是说。汝亦知此。于彼彼法起彼彼法。生彼彼法。灭彼彼法。灭止清凉息没。若多闻圣弟子无明离欲而生明。身分齐受所觉。身分齐受所觉时如实知。若寿分齐受所觉。寿分齐受所觉时如实知。身坏时寿命欲尽。于此诸受一切所觉。灭尽无余。</strong></p><p> 释：佛说：太好了，比丘们，我也是这样说的，你们也知道是如此。因为某某法而集起另外的某某法，生出另外的某某法，灭除另外的某某法，最后心就寂灭无为了，心就清凉、息止了。如果多闻圣弟子灭了无明，心得离欲而生起了明，在色身上就会出现解脱的受和觉，如果在色身上出现了解脱的受和觉，就应该要如实地了知；如果在寿命上出现了解脱的受和觉，这时候就要如实地了知。在身坏命终寿命要终了时，在身心上的一切受和一切觉就会灭尽无余了。</p><p>原文：<strong>譬如力士取新熟瓦器。乘热置地。须臾散坏。热势悉灭。如是比丘。无明离欲而生明。身分齐受所觉如实知。寿分齐受所觉如实知。身坏命终。一切受所觉悉灭无余。</strong></p><p>释：譬如一个大力士取一个新烧熟的瓦器，趁着瓦器还热的时候摔在地上，瓦器立时就摔碎了，瓦器的热度也都消失了。身分的受觉和寿命上的受觉也是这样，立时就消失了。如是比丘，无明灭尽离欲的阿罗汉心生起了明，色身上的所有受觉如实的了知，寿命上的受觉如实的了知，在身坏命终时，这一切的受觉全部消灭无余。</p></div>"
},{
    "title": "第五节 世间的集与灭",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第五节  世间的集与灭</strong></p><p>（二九三）佛为异比丘说缘起法</p><p>原文：<strong>尔时世尊告异比丘。我已度疑。离于犹豫。拔邪见刺。不复退转。心无所著故。何处有我。为彼比丘说法。为彼比丘。说贤圣出世。空相应缘起随顺法。所谓有是事故是事有。是事有故是事起。</strong></p><p>释：世尊告诉一个从他处来的比丘说：我已经灭尽所有疑惘了，离开了对解脱法的犹豫不决，已经拔掉了邪见的毒刺，于无上菩提道已经不再退转了。因为心无所住著的缘故，不见何处有我为那些比丘们说法，为那些比丘们说与贤圣们所证得的出世间的空相应的缘起随顺之法。缘起随顺之法就是所说的由于有此事的缘故，彼事就出现了，由于此事的存在而导致彼事产生出来了。</p><p>原文：<strong>所谓缘无明行。缘行识。缘识名色。缘名色六入处。缘六入处触。缘触受。缘受爱。缘爱取。缘取有。缘有生。缘生老死忧悲恼苦，如是如是。纯大苦聚集。乃至如是。纯大苦聚灭。</strong></p><p>释：这就是所说的十二因缘法，由于有无明就产生了身口意行，由于有身口意行就产生了六识的业种，由于有六识的业种就产生了后世的名色，由于有名色就产生了六入，由于有六入就产生了触，由于有触就产生了受，由于有受就产生了爱，由于有爱就产生了取，由于有取就产生了有，由于有了有就有了生，有生就有老病死忧悲苦恼，之后生死大苦就聚集起来了，乃至于通过修行，生死大苦聚消灭了。</p><p>度疑的意思就是说佛已经断尽无明，一切疑惑都没有了，心里非常肯定了知一切法，知道世出世间的一切法都是什么道理，这些法的实相是什么。而众生都还没有度疑，疑惑都太多，不懂的法太多，因而在事相上都很迷惑和执拗，这一切都源于无明。无明的范围很广，众生的无明疑惑简直数不尽数，如果要按数量来计算的话，众生的无明有十方世界的灰尘那么多。</p><p> 无明有三种：一念无明、无始无明、尘沙无明，就算开悟以后，还有很多成佛路上不懂的法，犹如灰尘和沙子一样多。等觉菩萨都还有一品无明没有破，破尽了才能成佛。长处无明，就是长处黑暗。最根本的邪见就是我见，因为有一个我，所有的烦恼都出现了，一切的邪见都因为我而来，我见一断，其它的邪见就会一个一个随着都断了。世尊拔掉了邪见刺，一切不正确的见解全部断尽，无明都断尽。有无明就有邪见，开悟了以后也还是有邪见，只有成佛才会没有邪见。</p><p>原文：<strong>如是说法。而彼比丘犹有疑惑犹豫。先不得得想。不获获想。不证证想。今闻法已。心生忧苦悔恨。蒙没障碍。所以者何。此甚深处。所谓缘起。倍复甚深难见。所谓一切取离。爱尽无欲。寂灭涅槃。</strong></p><p> 释：世尊如此说法，而那个比丘还是有些疑惑和犹豫，不能抉择了，他先前有一种想法，认为自己得法眼净了，获得解脱了，证果了，实际上他并没有得法，没有证果，没有得解脱。现在听到世尊讲十二因缘法，心里就生出了忧苦、悔恨，心里迷惑不解，有心障碍。为什么如此呢？因为十二因缘法比他从前修学的四圣谛理更加甚深难证。难证之处在于，十二因缘法修到最后要离开一切三界法的取着，对三界的贪爱灭尽，断尽了贪欲，获得了寂静涅槃。</p><p>原文：<strong>如此二法。谓有为无为。有为者若生若住。若异若灭。无为者不生不住。不异不灭。是名比丘诸行苦。寂灭涅槃。因集故苦集。因灭故苦灭。断诸径路。灭于相续。相续灭灭。是名苦边。比丘。彼何所灭。谓有余苦。彼若灭止。清凉息没。所谓一切取灭。爱尽无欲。寂灭涅槃。</strong></p><p>释：有为和无为这两种法，显示出比丘所处的一切行苦和寂灭涅槃两种状态。有为法是有生住异灭现象存在的，无为法没有生住异灭的现象存在。比丘未涅槃前是有为，所有的五蕴的行苦灭了以后，就涅槃无为了。诸行苦的因集起时苦就集起了，行苦的因灭了苦就灭了，这样就把通往生死的路径截断了，把生死相续截断了，生死相续灭了就到达苦的边际了。</p><p>比丘，阿罗汉辟支佛们把什么法灭掉了？把断除无明烦恼以后余下的苦灭除了。有余苦如果灭除和止息了，就止灭了一切行，心得到清凉、息止、灭没了。这就是所说的把一切取的心行都灭除了，贪爱永尽，再也没有贪欲了，就会得到寂灭涅槃之乐。佛说完这部经以后，比丘们闻佛所说，欢喜奉行。</p><p>阿罗汉辟支佛们修行到最后，一切取离、爱尽、无欲、寂灭、涅槃，心不取着一切法，不执着一切法，不希望拥有更多的法，就是取灭。取灭了以后就没有贪爱，贪爱也尽就无欲了，对这三界世间再也没有什么想法和追求，如果还有想法和意愿，意根的执就不断，就会还有下一世，爱不尽，欲不离，就不能寂灭涅槃。所以无欲以后就是寂灭，寂灭就涅槃，这样五阴都灭尽了，就剩下一个无生住异灭的涅槃心第八识，就是涅槃境界。</p><p>四圣谛法和十二因缘法是小乘有为法，小乘有为法离不开无为法阿赖耶识。佛讲一切法的出生是有为，住也是有为，变异是有为，灭失也是有为。宇宙大千世界都有生、住、异、灭，都是有为法。无为就是不生也不住，不异也不灭。什么法是这样？只有第八识才会这样，所以阿罗汉和辟支佛入无余涅槃以后就无为了，因为没有有为的七识心和行了。身口意行这些有为法里就含着无为法，否则有为法也现不起来，有为、无为两个同时运行，有为灭了，剩下一个无为，就是寂灭涅槃。</p><p>有为就有苦，一切的苦都是结果，有果就有因，身口意行就是因，因造作出来了，果有可能在未来世出现，有可能是现在就会出现，只要缘具足，果就出现，如果缘不具足，就作为因、作为种子存着，将来结果。修行就是在种因，果什么时候出现？缘什么时候具足，就什么时候得果。开悟的缘是什么？就是菩萨六度，把菩萨六度圆满了，明心的果就会出现。要想快速得果，就快速具足菩萨六度这个缘，如果不重视菩萨六度的修行，明心的缘就不具足，哪生哪世何时明心就不一定了。</p><p>有些人把修行的果安排到命终之时得，求命终能往生西方极乐世界，但是命终时往生极乐世界的缘不一定能具足，谁也不能保证命终时往生的缘一定能具足，佛如果没有给予保证，谁保证都没有用。除非能保证在现世活着的时候能够具足往生的缘，在活着时极乐世界就能出现在自己的三昧中，或者是阿弥陀佛出现在自己的三昧中，由于这种三昧力和佛的加持力，命终才能保证往生。</p><p>（二九四）在六触入处解脱与系缚的差别</p><p>原文：<strong>尔时。世尊告诸比丘。愚痴无闻凡夫。无明覆。爱缘系。得此识身。内有此识身。外有名色。此二因缘生触。此六触入所触。愚痴无闻凡夫。苦乐受觉。因起种种。云何为六。眼触入处。耳鼻舌身。意触入处。</strong></p><p>释：世尊告诉诸比丘们说：愚痴无闻的凡夫因为有无明的覆障，有所贪爱的障缘把自己的六识身系缚住了。在内有六识身，在外有名色五阴，内外六入二者和合生触，在六个触入处生触之后，愚痴无闻的凡夫就生起了种种的苦受和乐受的觉受。什么是六触入处？眼触入处、耳触入处、鼻触入处、舌触入处、身触入处、意触入处，名为六触入处。</p><p>众生心都被无明遮障着，如果把无明去除，心地透出光明来，一切事理就会都明了了。佛的心没有覆盖，心放光明照天照地，十方法界都通亮。每个凡夫心里都有爱的因缘系缚，于是就有眼识身、耳识身、鼻识身、舌识身、意识身，这个六识身就叫识身，没有爱就没有这些识身。有了六识身就会触十一种色法以及心法，就会生出苦乐舍受。</p><p>众生由于无始劫来的贪爱，而有这个六识身，六识为什么是身之内的识？因为在胜义根之内产生的识。名色为什么属于外身？因为名色是外入，在胜义根之外入到胜义根，与六识相触，就有了受觉，之后身口意行不断，六识不断。如果六根不触六尘时，六识就灭，六识灭了就没有种种受觉了，什么也没有了。讲到这里，我们对十二因缘的这个链条就清楚了，五阴身的一切活动就清楚了，意根的无明如果不灭，身口意行总是要现起来的，这样业种就不断地累积，未来世的名色就会不断地生起，这就是来世名色出生的因。</p><p>原文：<strong>若黠慧者无明覆。爱缘系得此识身。如是内有识身。外有名色。此二缘生六触入处。六触所触故。智者生苦乐受觉。因起种种。何等为六。眼触入处。耳鼻舌身意触入处。</strong></p><p><strong>愚夫黠慧彼于我所。修诸梵行者。有何差别。比丘白佛言。世尊是法根。法眼法依。善哉。世尊。惟愿演说。诸比丘闻已，当受奉行。</strong></p><p>释：如果聪明有智慧之人被无明覆障，由于贪爱的因缘系缚了这个六识身，这样的话，内有六识身，外有五阴名色，二者和合触之后，就有了六入触处，因为在此六处有触，聪明智慧的人就生起了种种苦乐受。什么是六触入处？就是眼触入处、耳触入处、鼻触入处、舌触入处、身触入处、意触入处。</p><p>愚痴的凡夫和聪明智慧的人在六入触处都有苦乐等种种受，如果他们都在我法中修诸梵行，他们之间有什么差别？比丘们对佛说：世尊您是法的根源，是法的眼目，是法的所依，希望世尊您来开演此意，比丘们听闻之后，应当信受奉行。</p><p>原文：<strong>尔时。世尊告诸比丘。谛听善思。当为汝说。诸比丘。彼愚痴无闻凡夫。无明所覆。爱缘所系。得此识身。彼无明不断。爱缘不尽。身坏命终。还复受身。还受身故。不得解脱生老病死。忧悲恼苦。所以者何。此愚痴凡夫。本不修梵行。向正尽苦。究竟苦边故。是故身坏命终。还复受身。还受身故。不得解脱生老病死。忧悲恼苦。</strong></p><p>释：这时世尊告诉诸比丘们说：你们仔细地听，细心地思惟，我现在就为你们解说。诸比丘，那些愚痴无闻的凡夫因为被无明所遮障覆盖的缘故，被贪爱的因缘所系缚，生出这个六识身。他们由于不断无明烦恼，贪爱的因缘就不能断尽，身坏命终的时候，还会再继续投生受用六识身，既然愚痴无闻的凡夫还会受六识身，就不能解脱生老病死忧悲苦恼。为什么这样呢？因为那些愚痴无闻的凡夫，本来就不修行清净的梵行，不愿意趣向于正尽苦，到达究竟的苦恼的边缘，因此身坏命终还会再次受身，由于还会再受身的缘故，身坏命终就不能解脱生老病死忧悲苦恼。</p><p>原文：<strong> 若黠慧者。无明所覆。爱缘所系。得此识身。彼无明断。爱缘尽。无明断爱缘尽故。身坏命终。更不复受。不更受故。得解脱生老病死。忧悲恼苦。</strong></p><p> 释：如果是聪明有智慧的人被无明所遮障覆盖着，因为被爱缘所系缚的缘故，也出生了六识身。但是这个有智慧的人能够通过修行梵行断除了无明，爱缘随之断尽，再也不贪爱了。因为断除无明爱缘断尽的缘故，有智慧的人身坏命终以后，再也不受六识身，不会再去入胎了。因为不再受生的缘故，就解脱了生老病死忧悲恼苦。</p><p>原文：<strong>所以者何。彼先修梵行。正向尽苦。究竟苦边故。是故彼身坏命终。更不复受。更不受故。得解脱生老病死。忧悲恼苦。是名凡夫及黠慧者。彼于我所。修诸梵行。种种差别。</strong></p><p>释：为什么能这样呢？因为有智慧的人精进修行梵行，就趣向于正尽苦，到达究竟苦的边缘，所以在身坏命终的时候就不会再继续受生了。因为不再受生了，就解脱了生老病死忧悲苦恼。这就是愚痴无闻的凡夫与有智慧的人在我法中修行梵行，而有的种种差别。</p><p>凡是有智慧的人都不是无缘无故有智慧的，他有前世的基础，曾经修过清净梵行，所以今世能够正向尽苦，走到灭苦的边缘，最后能达到究竟的苦边，得解脱。而前世没有修过梵行今世才闻法的，不精进修行，不可能断除无明，就还会有下一世。众生学佛修行有快有慢，这都与前世的根基有一定关系。同样修学佛法，有些人接受很快，有些人就很慢，差别在于前世的根基不同，但最后都会得大解脱。即使是三恶道的众生闻到了佛法，虽然不解，但是也种了种子，再转到人身时，他就比其他人根利。</p><p>（二九五）世间集灭的因缘</p><p>原文：<strong>尔时。世尊告诸比丘。此身非汝所有。亦非余人所有。谓六触入处。本修行愿。受得此身。云何为六。眼触入处。耳鼻舌身。意触入处。</strong></p><p>释：世尊告诉诸比丘们说：你们现在的色身不属于你们所有，也不属于其他人所有。因为有六触入处不断的运行不灭，以满足自身种种的愿行，才得以受生，有了此色身。什么是六触入处呢？就是眼触入处、耳触入处、鼻触入处、舌触入处、身触入处、意触入处。</p><p>原文：<strong>彼多闻圣弟子于诸缘起。善正思惟观察。有此六识身。六触身六受身。六想身六思身。所谓此有故。有当来生老病死。忧悲恼苦。如是如是。纯大苦聚集。是名有因有缘世间集。</strong></p><p>释：那些多闻的圣弟子对于一切缘起法，都能够善于正确如理的思惟观察，因为有了六识身的缘故，就有了六触身、六受身、六想身、六思身。所谓的此有故彼有，意思就是说因为有六识身的缘故就有未来世的生老病死忧悲苦恼，就像这样的纯大苦就聚集起来了，这叫作有因有缘世间就集聚起来了。</p><p>佛说众生有六识身、六触身、六受身、六想身、六思身，六识身就是眼识、耳识、鼻识、身识、意识；六受身就是眼触生受、耳触生受、鼻触生受、舌触生受、身触生受、意触生受；六触身就是眼触、耳触、鼻触、舌触、身触、意触；六想身就是眼触生想、耳触生想、鼻触生想、舌触生想、身触生想、意触生想；六思身就是眼触生思、耳触生思、鼻触生思、舌触生思、身触生思、意触生思。思就是抉择决定和行为造作，比如说眼根触色尘生思，眼识生起了抉择，并且有所行为造作，再继续运行，这个属于行阴。</p><p>眼见色的时候，眼识就有思和行，有抉择和行为造作；耳听声的时候耳识就有抉择和行为造作，有分别就是行为造作，叫六思身，也叫六行，也叫行阴。所以思包括行，思和想不同，想是了别执取的行为，或者是六七识的妄想、分别、打算等等思想活动。这个思主要是在抉择和抉择之后的行为造作上，六个识的行为造作就是身口意行，但抉择之后，也许是静止寂灭，没有身口意行的造作。</p><p>此有故彼有，就是在说十二因缘，前一个链条是因，后一个链条是果，从第二个链条开始，每个链条既是前一个链条的果也是下一个链条的因，最后一个大苦聚只是果，不是因，第一个无明只是因，不是果，没有前面的因，就是无始就有的。十二因缘就是缘起法，世间一切法都是缘起法，如果无因无缘，一切法都不会出现，这就叫作有因有缘世间集，世间是因缘集起来的。有因有缘世间灭，灭也是有因有缘的，不是无缘无故就灭的。</p><p>但是有一法就不在因缘里，不是因缘所生，祂是万法的因，万法因为有祂才出现，祂就是阿赖耶识第八识。祂不因为任何一个缘就存在着，没有法能生祂，祂就是法尔如是的存在。只有这个法的存在没有为什么，没有原因，其余的一切法存在都有个为什么，都有因缘。因为有第八识，世间的一切假相都建立起来了，宇宙、虚空、大千世界、众生的五阴身，祂是万法的因，也是万法的根、万法的缘，祂自己没有根也没有缘。</p><p>原文：<strong>谓此无故。六识身无。六触身。六受身。六想身。六思身无。谓此无故。无有当来。生老病死。忧悲恼苦。如是如是。纯大苦聚灭。</strong></p><p>释：有因有缘世间集的意思是说，因为此因缘无故，六识身就没有了，接着六触身、六受身、六想身、六思身也就随之消失了。因为此因缘消失的缘故，就没有了未来的生老病死忧悲苦恼，像这样，纯大苦聚也就灭了。</p><p>原文：<strong>若多闻圣弟子。于世间集世间灭。如实正知。善见善觉善入。是名圣弟子招此善。得此善法。知此善法。入此善法。觉知觉见世间生灭。成就贤圣出离。实寂正尽苦。究竟苦边。所以者何。谓多闻圣弟子世间集灭如实知。善见善觉善入故。</strong></p><p>释：如果多闻圣弟子对于世间的集和世间的灭能够如实正确的认知，善于观察，善于觉悟，善于入此法中，那么圣弟子就招集了这个善法，得到了此善法，知了此善法，入到了此善法中，能够觉悟到、证见到世间的生和灭，成就了贤圣的出离果，真实证得了寂灭的正尽苦，到达究竟的苦边。为什么这样说呢？因为多闻圣弟子对于世间的集、世间的灭已经如实了知了，能够善察、善觉悟、善入此法的缘故。</p><p>此无故彼无的道理，比如说无明没有了，身口意行就没有了；行没有了，六识的业种就没有了；六识业种没有了，名色就没有了；名色没有了，六入就没有了；六入没有了，触就没有了；触没有了，受就没有了；受没有了，贪爱就没有了；贪爱没有了，取就没有了；取没有了，有就没有了；有没有了，生就没有了；生没有了，老病死忧悲苦恼就没有了。无明没有了，生老病死就没有了，中间无论哪一个链条断了，整个十二因缘的生死循环就都断了。</p><p>生死苦乐的关键在于是否执取，当你执取不断时，苦恼就不断了，因为无论你抓取什么都在抓苦，无论你抓取什么都在抓刺，抓取什么都在抓毒药，执取贪爱就是在抓苦，贪爱就是苦，贪爱集就是苦集，取集就是苦集。我们千万要记住，只要取了，就在取着苦，取着毒药，最终害的是自己。</p><p>知世间苦集、苦灭的道理，成就了贤圣的出离果，这个知仅仅是意识理论上的知还不行，主要还得意根知，因为意根是作主作决断的识，只有意根知了，才能抉择不造苦业，才能灭苦断苦集，才能解脱生死。意识知苦，意根不知，就会照样作主造作苦因，因为是意根决定一切身口意行，意识不起决定性作用，知苦也没办法。所以学法要修意根，学到意根心里去，意识心虽然也很关键，但是意根更关键。</p></div>"
},{
    "title": "第六节 因缘法和缘生法",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第六节  因缘法和缘生法</strong></p><p>（二九六）因缘法和缘生法</p><p>原文：<strong>尔时。世尊告诸比丘。我今当说因缘法。及缘生法。云何为因缘法。谓此有故彼有。谓缘无明行。缘行识。乃至如是如是。纯大苦聚集。</strong></p><p>释：世尊告诉诸比丘说：我现在应当说因缘法和缘生法。什么是因缘法？那就是此有故彼有，也就是缘于无明而有身口意行，缘于身口意行而有六识的业种，缘于六识的业种而有名色，缘于名色而有六入，缘于六入而有触，缘于触而有受，缘于受而有爱，缘于爱而有取，缘于取而有有，缘于有而有生，缘于生而有老病死忧悲苦恼，乃至于有如是的纯大苦聚集。</p><p>原文：<strong>云何缘生法。谓无明行。若佛出世。若未出世。此法常住。法住法界。彼如来自所觉知。成等正觉。为人演说。开示显发。谓缘无明有行。乃至缘生有老死。若佛出世。若未出世。此法常住。法住法界。</strong></p><p>释：什么是缘生法？缘生法就是所说的以无明为缘而有身口意行，以身口意行为缘而有六识的业种，以六识业种为缘而有名色，以名色为缘而有六入，以六入为缘而有触，以触为缘而有受，以受为缘而有爱，以爱为缘而有取，以取为缘而有有，以有为缘而有生，以生为缘而有老病死忧悲苦恼。不管佛出世还是不出世，这些理法常住于世间，此法住于本来的法界当中。</p><p>那些依此法而修行成就的如来，都是自己觉悟、自己作证成为等正觉，之后处处为人演说，开示和显发缘生法，就是所说的缘于无明而有行，缘于行而有六识业种，乃至缘于生而有老病死忧悲苦恼，以及像这样的纯大苦聚。无论佛出世或者是不出世，这个理法常存世间，缘生法常住法界。</p><p>因缘法不是实相法，是生灭的假法，由阿赖耶识而来，没有阿赖耶识就没有因缘法，也不会有生死，没有纯大苦聚。十二因缘法所揭示的真理只是世间的真理，不是出世间究竟的真理。这种真理是一种假象，只有阿赖耶识这个理是最真实存在的，一切法都依阿赖耶识而有，而有世俗相的法都是假法。佛说四圣谛也是真理，这种真理是一种表相的真理，究竟的真理是阿赖耶识如来藏。没有阿赖耶识就没有四圣谛，也没有十二因缘，虽然这二者也叫作真理，但只是世俗法上的真理，还不究竟。</p><p>原文：<strong>彼如来自觉知。成等正觉。为人演说。开示显发。谓缘生故。有老病死忧悲恼苦。此等诸法。法住法空。法如法尔。法不离如。法不异如。审谛真实。不颠倒。如是随顺缘起。是名缘生法。</strong></p><p>释：那些依此法而修行成就的如来，都是自己觉悟、自己作证成为等正觉，之后处处为人演说，开示和显发缘生法，就是缘于生这种现象而有老病死忧悲苦恼。这些缘生法，常住在世，虽然如此，这些法也都是空的，本来就是如此，理既如是。这些法也都不离真如而有，也不异于真如，仔细审查都是真实之理，不是颠倒的。如是像这样随顺着缘而生起的法，就是缘生法。</p><p>原文：<strong>谓无明行识。名色六入处。触受爱取有。生老病死忧悲恼苦。是名缘生法。</strong></p><p>释：具体来说就是无明为缘，身口意行生；身口意行为缘六识业种生；六识业种为缘名色生；名色为缘六入生；六入为缘，触生；触为缘受生；受为缘爱生；爱为缘取生；取为缘，有生；有为缘，生生；生为缘，老病死忧悲苦恼生，这就是缘生法。</p><p>四圣谛、十二因缘、无明、生老病死这些世间的缘生法都在世间里常住着，但是这些法都是相上有，实质上是没有的，是空的。都是第八识变现的，也都是第八识，这是法如的意思。与第八识也不异，从第八识而来，带着第八识的属性，叫作不异如，这些理本来就是这样，叫作法尔。所有的五阴法、六根法、六尘法、六识法、四圣谛法、十二因缘法，都不离真如，只有真如是真实的，其他法都是随同于真如而出生的，因此是假的生灭无常的，在这里佛都明说了，缘生法不离真如，不离第八识。</p><p>原文：<strong>多闻圣弟子于此因缘法。缘生法。正知善见。不求前际。言我过去世。若有若无。我过去世何等类。我过去世何如。不求后际。我于当来世。为有为无。云何类何如。内不犹豫。此是何等。云何有此为前。谁终当云何之。此众生从何来。于此没当何之。</strong></p><p>释：多闻圣弟子于此因缘法、缘生法具有正知正见，不贪恋前世，说我过去世好像是有，好像是没有，我过去世是什么类众生，我过去世是做什么的，什么身份；也不贪求后世，说我的未来世是有，是没有，是什么类众生，生活得如何如何。多闻圣弟子内心里也不怀此类疑问，说这是何等众生，为什么先前有这样的身份，最终会成为什么样的众生，这个众生从什么处所来，在此世间死了以后会到哪里去。</p><p>一个求寂静解脱的修行者，不考虑前世是什么身份，也不求后世如何，对于前世的想法全部都没有了，对于未来世的妄想也都没有了，只求现在这一生能灭苦得解脱。如果他还想着未来世要如何如何，就不是求解脱的人。但是行菩萨道的行者，要考虑未来世要如何修行，如何救脱众生，如何成就佛道。所以求解脱的阿罗汉，他的解脱里没有五蕴色，而大乘菩萨的心解脱里一定要有五蕴色。</p><p>原文：<strong>若沙门婆罗门。起凡俗见所系。谓说我见所系。说众生见所系。说寿命见所系。忌讳吉庆见所系。尔时悉断悉知。断其根本。如截多罗树头。于未来世。成不生法。是名多闻圣弟子。于因缘法缘生法。如实正知。善见善觉。善修善入。</strong></p><p>释：如果沙门婆罗门从前被自己所起的世间凡夫俗人的知见所系缚，也就是被我见所系缚，被众生见所系缚，被寿者见所系缚，被世间种种不如理的忌讳和吉庆的知见所系缚，证得因缘法的时候这些知见就全部断除了。断除了我见我所见的根本，就像截断了多罗树的树头一样，让这些不如理的知见在未来世再也不能生起了。这样多闻圣弟子对于因缘法和缘生法就如实地正确地了知了，并且能够善于见其真实理，善于觉悟真实理，善于修道，善于入道。</p><p>（二九七）大空法经</p><p>原文：<strong>尔时。世尊告诸比丘。我当为汝等说法。初中后善。善义善味。纯一清净。梵行清白。所谓大空法经。谛听。善思。当为汝说。云何为大空法经。所谓此有故彼有。此起故彼起。谓缘无明行。缘行识。乃至纯大苦聚集。</strong></p><p>释：世尊告诉诸比丘们说：我应当为你们说法，我说的法最初时善，中间也善，最后也善，不但其义善，法味也善，纯正清净，具梵行清白无染，这个法叫作大空法经。你们仔细听好好思惟，我现在就要为你们说了。</p><p>什么是大空法经？大空法经就是讲，由于此法有的缘故就导致彼法有，此法生起的缘故就导致彼法也随之生起。这就是所说的缘于无明而有行，缘于行而有六识业种，缘于六识业种就有名色，缘于名色就有六入，缘于六入就有触，缘于触就有受，缘于受就有爱，缘于爱就有取，缘于取就有有，缘于有就有生，缘于生就有老病死忧悲苦恼，直至纯大苦聚集。</p><p>原文：<strong>缘生老死者。若有问言。彼谁老死。老死属谁。彼则答言。我即老死。今老死属我。老死是我。所言命即是身。或言命异身异。此则一义。而说有种种。若见言命即是身。彼梵行者所无有。若复见言。命异身异。梵行者所无有。</strong></p><p>释：缘于生而有老死这个问题，如果有人问是谁有老死，老死属于谁所有，你们就回答说：我就是老死，现在老死属于我所有，老死就是我。有人说生命就是色身，或者说生命变异没有了色身就变异没有了，这些说法都是一个意思，却出现好多种说法。如果有人说生命就是色身，可是那些修梵行者到最后却没有生老病死没有色身了，如果有人说生命变异了色身就变异了，可是那些修梵行者最后就没有生老病死，没有生命和色身变异了。</p><p>原文：<strong>于此二边。心所不随。正向中道。贤圣出世。如实不颠倒正见。谓缘生老死。如是生有取爱。受触六入处。名色识行。缘无明故有行。</strong></p><p>释：离开对于生命和色身有与没有的两边说法，心不随之动转，才能一心正向中道涅槃。贤圣出世以后，对于这些现象有如实正见，不颠倒说十二因缘，所谓缘于生才有老死，缘于有才有生，缘于取才有有，缘于爱才有取，缘于受才有爱，缘于触才有受，缘于六入才有触，由于名色才有六入，缘于六识才有名色，缘于行才有六识业种，缘于无明才有行。</p><p>原文：<strong>若复问言。谁是行。行属谁。彼则答言。行则是我。行是我所。彼如是言命即是身。或言命异身异。彼见命即是身者。梵行者无有。或言命异身异者。梵行者亦无有。离此二边。正向中道。贤圣出世。如实不颠倒。正见所知。所谓缘无明行。</strong></p><p>释：如果有人再问说：谁是行？行属于谁？你们应该回答说：行就是我，行是我所有的。如果有人这样说生命就是色身，或者说生命变异色身就变异了，你们见到的生命就是色身，可是修梵行者却没有生命和色身了，没有生老病死了；或有人说生命变异色身就变异了，可是修梵行者却没有生命和色身的变异现象，没有生老病死了。</p><p>离开生命和色身的有无变异的知见，不着于任何一边，才能正向中道涅槃。贤圣出世以后，有如实不颠倒的见地，能够具足正知正见，知道缘于无明才有行，缘于行才有六识业种，直至缘于生才有老病死忧悲苦恼，纯大苦聚。</p><p>原文：<strong>诸比丘。若无明离欲而生明。彼谁老死。老死属谁者。老死则断。则知断其根本。如截多罗树头。于未来世成不生法。若比丘无明离欲而生明。彼谁生。生属谁。乃至谁是行。行属谁者。行则断。则知断其根本。如截多罗树头。于未来世成不生法。</strong></p><p>释：诸比丘们，如果离开贪欲灭尽了无明，而生起了明，对于谁还有老死，老死属于谁这个问题，就知道如果老死断尽了，没有老死，老死不属于谁了，这样生死就从根本上断尽了，就如截断多罗树的树头一样，在未来世再也不会出生了。如果比丘离开贪欲灭尽无明而生起明了，对于谁还有生，生属于谁，乃至于谁还有行，行属于谁这些问题，就知道生乃至于行都断尽了，生死就从根本上断尽了，就如截断多罗树的树头一样，未来世再也不会出生了。</p><p>原文：<strong>若比丘无明离欲而生明。彼无明灭则行灭。乃至纯大苦聚灭。是名大空法经。</strong></p><p>释：如果比丘们离欲断尽无明而生起了明，无明灭了行就灭，行灭六识种子就灭，六识种子灭名色就灭，名色灭六入就灭，六入灭触就灭，触灭受就灭，受灭爱就灭，爱灭去就灭，取灭有就灭，有灭生就灭，生灭老病死忧悲苦恼就灭，乃至于纯大苦聚就灭了。这就叫作大空法经。</p><p>（二九八）缘起法</p><p>原文：<strong>尔时。世尊告诸比丘。我今当说缘起法。法说义说。谛听。善思。当为汝说。云何缘起法法说。谓此有故彼有。此起故彼起。谓缘无明行。乃至纯大苦聚集。是名缘起法法说。</strong></p><p>释：世尊告诉诸比丘们说：我现在要说缘起法，有法说和义说两种，你们仔细听好好地思惟。现在我要为你们说什么是缘起法的法说，缘起法的法说就是所谓的此有故彼有，此起故彼起，就是缘于无明产生行，缘于行产生六识种子，直至缘于生有老病死忧悲苦恼纯大苦聚，这就是缘起法法说。</p><p>原文：<strong>云何义说。谓缘无明行者。彼云何无明。若不知前际。不知后际。不知前后际。不知于内。不知于外。不知内外。不知业。不知报。不知业报。不知佛。不知法。不知僧。</strong></p><p>释：什么是缘起法义说？就是缘于无明而产生了行，什么是无明？如果众生不知道有前世，不知道有后世，不知道前世和后世；不知道有内法，不知道有外法，不知道有内外法；不知道业行，不知道果报，不知道业果报；不知道佛，不知道法，不知道僧；</p><p>原文：<strong>不知苦。不知集。不知灭。不知道。不知因。不知因所起法。不知善不善。有罪无罪。习不习。若劣若胜。染污清净。分别缘起。皆悉不知。于六触入处。不如实觉知。于彼彼不知不见。无无间等。痴闇无明大冥。是名无明。</strong></p><p>释：不知道五阴苦，不知道五阴苦的集起，不知道如何灭除五阴苦，不知道修行灭苦之道；不知道法生起的因，不知道由因所生起之法；不知道善法和不善法，不知道有罪和无罪，不知道习气和非习气；不知道是劣是胜，不知道是染污还是清净，不知道是分别还是缘起，这些法都不知道。对于六触入处也不能如实觉知，对于这些法都不知不见。内心里无间断的愚痴黑暗和无明大幽暗，叫作无明。</p><p>原文：<strong>缘无明行者。云何为行。行有三种。身行口行意行。缘行识者。云何为识。谓六识身。眼识身耳识身。鼻识身舌识身。身识身意识身。缘识名色者。云何名。谓四无色阴。受阴想阴。行阴识阴。云何色。谓四大。四大所造色。是名为色。此色及前所说名。是为名色。</strong></p><p>释：缘于无明有行，什么是行？行有三种：身行、口行和意行；缘于行有识的业种。什么是识？就是六识身：眼识身、耳识身、鼻识身、舌识身、身识身、意识身。缘于识种子有名色，什么是名？名就是四个无色阴：受阴想阴行阴识阴；什么是色？就是四大和四大所造的色，叫作色，与前边所说的名合起来叫作名色。</p><p>身行口行意行者三种行都是由意根的心行所掌控，意根因为无明想要造作身口意行，六识才会出生，六识出生之后才有实际的身行口行和意行，才会留下业种。如果没有六识，就没有身口意行，就没有业种。比如睡着了没有六识，就没有身口意行，昏迷时六识消失了就没有身口意行，如无想定和灭尽定，没有六识了就没有身口意行。所以先有意根的心行，才有六识和六识的身口意行，才有业种，后世的名色才会出生。</p><p>原文：<strong>缘名色六入处者。云何为六入处。谓六内入处。眼入处。耳入处。鼻入处。舌入处。身入处。意入处。缘六入处触者。云何为触。谓六触身。眼触身。耳触身。鼻触身。舌触身。身触身。意触身。</strong></p><p><strong>缘触受者。云何为受。谓三受。苦受乐受。不苦不乐受。缘受爱者。彼云何为爱。谓三爱。欲爱色爱。无色爱。缘爱取者。云何为取。四取。欲取见取。戒取我取。缘取有者。云何为有。三有。欲有色有。无色有。</strong></p><p>释：缘于名色而有六入处，什么是六入处？就是六个内入处：眼入处、耳入处、鼻入处、舌入处、身入处、意入处；缘于六入处有触，什么是触？就是六触身：眼触身、耳触身、鼻触身、舌触身、身触身、意触身；缘于触有受，什么是受？就是三种受：苦受、乐受和不苦不乐受；缘于受有爱，什么是爱？就是三种爱：欲界爱、色界爱、无色界爱；缘于爱有取，什么是取？就是四种取：贪欲取、我见取、禁戒取、我语取；缘于取有有，什么是有？就是三有：欲界有、色界有、无色界有。</p><p>原文：<strong>缘有生者。云何为生。若彼彼众生。彼彼身种类一生。超越和合出生。得阴得界。得入处得命根。是名为生。</strong></p><p>缘生老死者。云何为老。若发白露顶。皮缓根熟。支弱背偻。垂头呻吟。短气前输。柱杖而行。身体黧黑。四体班驳。闇钝垂熟。造行艰难羸劣。是名为老。云何为死。彼彼众生。彼彼种类没。迁移身坏。寿尽火离。命灭舍阴时到。是名为死。此死及前说老。是名老死。是名缘起义说。</p><p>释：<strong>缘于有有生，什么是生？生就是一个一个的众生，有种种色身种类的一生生命，出生以后有五阴有十八界，有六入处，有命根，这就叫作生。</strong></p><p>缘于生有老死，什么是老？如果头发白了，头顶光秃了，皮肤代谢缓慢出皱纹了，五根已经熟透不再更新了，四肢力弱，弯腰驼背了，低头呻吟不止，呼吸时气短入气就出气，走路要住拐杖，身体越来越黑，色杂不纯净，阴暗迟钝，动作艰难无力，有这些现象就是老。什么是死？一个个的众生，一个个种类消失不见了，身坏命终迁移到其他种类众生中，寿命尽了，生命之火熄灭了，生命灭了，该到舍离五阴的时候了，就是死。死与前边所说的老和合一起叫作老死。这些内容就是缘起法的义说。</p></div>"
},{
    "title": "第七节 缘起法是法界常住法",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第七节  缘起法是法界常住法 </strong></p><p>（二九九）缘起法是法界常住法</p><p>原文：<strong>时有异比丘来诣佛所。稽首礼足。退坐一面。白佛言。世尊。谓缘起法。为世尊作。为余人作耶。</strong></p><p><strong>佛告比丘。缘起法者。非我所作。亦非余人作。然彼如来。出世及未出世。法界常住。彼如来自觉此法。成等正觉。为诸众生分别演说。开发显示。所谓此有故彼有。此起故彼起。谓缘无明行。乃至纯大苦聚集。无明灭故行灭。乃至纯大苦聚灭。</strong></p><p>释：这时一个从其他部落过来的比丘见到世尊，低头合掌礼佛，然后退回去坐在世尊的侧面，对世尊说：世尊，缘起法是世尊您发明出来的，还是其他人造作出来的？</p><p>佛告诉这个比丘说：缘起法不是我作的，也不是其他人作的。然而如来出世和不出世，法界都常住着，所有如来都是自己觉悟了缘起法，成就了等正觉，为所有众生分别演说，开发显示出缘起法的真实义，就是所谓的此有故彼有，此起故彼起，也就是无明缘行，直至最后的生缘老死，纯大苦聚集。以及无明灭故行就灭，行灭故六识就灭，六识灭故名色就灭，名色灭故六入就灭，六入灭故触就灭，触灭故受就灭，受灭故爱就灭，爱灭故取就灭，取灭故有就灭，有灭故生就灭，生灭故老病死忧悲苦恼纯大苦聚就灭。</p><p>（三0一）不取有和无名为正见</p><p>原文：<strong>尔时。尊者[跳-兆+散]陀迦旃延诣佛所。稽首佛足。退住一面。白佛言。世尊。如世尊说正见。云何正见。云何世尊施设正见。佛告[跳-兆+散]陀迦旃延。世间有二种依。若有若无。为取所触。取所触故。或依有。或依无。</strong></p><p>释：[跳-兆+散]陀迦旃延尊者对佛说：世尊，如世尊您所说的正见，什么是正见？世尊您如何施设正见？佛告诉[跳-兆+散]陀迦旃延说：世间有两种所依，一个是有，一个是无，被取所触，可以取着，因为被取着所触后，世间人的知见或者是依着有，认为世间是有，或者是依着无，认为世间是无。认为世间是有是无都不是正见，凡有所取都错，都不是中道。</p><p>原文：<strong>若无此取者。心境系着使不取。不住不计我。苦生而生。苦灭而灭。于彼不疑不惑。不由于他而自知。是名正见。是名如来所施设正见。</strong></p><p>释：如果不取着有和无两种，心住中道，对境时既不取着有也不取着无，就不会住在我上，也不会计着有我随苦生而生，随苦灭而灭。对于此中道之理没有疑惑，不是由于他人的教导启发而知，完全是自知的，就叫作正见，这也是如来所施设的正见。</p><p>佛说，所谓的正见，是不由于他而自知，这句话非常重要。自知是自证的意思，不是由于别人的启发而知，不是由于听闻而知，而是通过自己的用功参究，最后实证而知。通过别人外缘而知的，是意识的知，不是自知，也不是正见，只有真实参究的意根的证，才是自知。所以耳入之法，终究不是自己的，是不可靠、靠不住之法。这句话非常重要。</p><p>原文：<strong>所以者何。世间集如实正知见。若世间无者不有。世间灭如实正知见。若世间有者无有。是名离于二边说于中道。所谓此有故彼有。此起故彼起。谓缘无明行。乃至纯大苦聚集。</strong></p><p>释：为什么这样说呢？对于世间的集能如实而正确的知见，如果世间确实是本来无者，就不把世间当作有；对于世间灭能如实而正确的知见，如果世间在现象上是有者，也不把世间当作有，这就是离于有无两边而说的中道。这也就是所说是此有故彼有，此起故彼起。因为有无明才有行，因为有行才有六识业种，因为有六识业种才有后世的名色，因为有名色才有六入，因为有六入才有触，因为有触才有受，因为有受才有爱，因为有爱才有取，因为有取才有有，因为有有才有生，因为有生才有老病死忧悲苦恼，纯大苦聚集。</p><p>原文：<strong>无明灭故行灭。乃至纯大苦聚灭。佛说此经已。尊者[跳-兆+散]陀迦旃延闻佛所说。不起诸漏。心得解脱。成阿罗汉。</strong></p><p>释：无明灭的缘故行就灭，行灭的缘故六识业种就灭，六识业种灭的缘故名色就灭，名色灭的缘故六入就灭，六入灭的缘故触就灭，触灭的缘故受就灭，受灭的缘故爱就灭，爱灭的缘故取就灭，取灭的缘故有就灭，有灭的缘故生就灭，生灭的缘故老病死忧悲苦恼就灭，乃至于纯大苦聚灭。佛说完这部经以后，尊者[跳-兆+散]陀迦旃延闻佛所说，不再起一切诸漏，心得解脱，成为阿罗汉了。</p><p>（三0二）苦的根源</p><p>原文：<strong>阿支罗迦叶白佛言。云何瞿昙。苦自作耶。佛告迦叶。苦自作者。此是无记。迦叶复问。云何瞿昙。苦他作耶。佛告迦叶。苦他作者。此亦无记。迦叶复问。苦自他作耶。佛告迦叶。苦自他作。此亦无记。迦叶复问。云何瞿昙。苦非自非他。无因作耶。佛告迦叶。苦非自非他。此亦无记。</strong></p><p>释：阿支罗迦叶对佛说：瞿昙，您怎么说，苦是自己生出来的吗？佛告诉迦叶说：苦是自己生出来的，这个是无记，不予回答。迦叶又问：那么苦是他缘生出来的吗？佛回答说：苦是他缘生出来的，这个也是无记。迦叶又问：苦是自己和他缘生出来的吗？佛回答说：苦是自己和他缘生出来的，这个还是无记。迦叶又问：苦不是自己生出来的，不是他缘生出来的，是无因生出来的的吗？佛告诉迦叶说：苦不是自己生出来的，也不是他缘生出来的，这个仍然是无记。</p><p>原文：<strong>迦叶复问。云何无因作者。瞿昙。所问苦自作耶。答言无记。他作耶。自他作耶。非自非他无因作耶。答言无记。今无此苦耶。佛告迦叶。非无此苦。然有此苦。迦叶白佛言。善哉。瞿昙。说有此苦。为我说法。令我知苦见苦。</strong></p><p>释：迦叶又问：什么叫作无因而生呢？瞿昙，我先前问苦是自己生出来的吗，您回答说是无记，我问是他缘生出来的，是自己和他缘和合生出来的，是非自己非他缘的无因生出来的吗，您都回答说是无记。那么现在来看是没有苦吗？佛告诉迦叶说：不是没有苦，而是有苦。迦叶对佛说：太好了，瞿昙，您说有苦，为我说法，让我知苦见苦谛。</p><p>原文：<strong>佛告迦叶。若受即自受者。我应说苦自作。若他受他即受者。是则他作。若受自受他受。复与苦者。如是者自他作。我亦不说。若不因自他。无因而生苦者。我亦不说。离此诸边。说其中道。如来说法。此有故彼有。此起故彼起。谓缘无明行。乃至纯大苦聚集。无明灭则行灭。乃至纯大苦聚灭。</strong></p><p>释：佛告诉迦叶说：如果受就是自己有受的话，我应该说苦是自己生出来；如果他受中他就是受者的话，那么苦就是他缘生出来的；如果受、自受和他受，再加上苦的话，这样苦受是自作他作，我却不这样说，苦受是非自己非他缘生出来的；如果不是因于自己和他缘，无因就能生出苦，我却不这样说，苦是有因缘生出来的。</p><p>如来说法都是离开两边，说中道法，中道法就是此有故彼有，此起故彼起，也就是缘于无明有行，缘于行有识，乃至于缘于生有老病死忧悲苦恼，纯大苦的聚集。以及无明灭了行就灭，行灭六识就灭，乃至于生灭了，老病死忧悲苦恼纯大苦聚就灭了。</p><p>原文：<strong>佛说此经已。阿支罗迦叶远尘离垢。得法眼净。时阿支罗迦叶见法得法。知法入法。度诸狐疑。不由他知。不因他度。于正法律。心得无畏。合掌白佛言。世尊。我今已度。我从今日。归依佛。归依法。归依僧。尽寿作优婆塞。证知我。</strong></p><p>释：佛说完这部经，阿支罗迦叶心就远离了五阴尘世间的烦恼污垢，证得了法眼净。这时候阿支罗迦叶见十二因缘法证得了因缘法，证知了十二因缘法入到了十二因缘法，灭尽对十二因缘法的一切疑惑。不是因为别的因缘而知法，不是由于别的因缘而得到了度化，对于正法和律仪，心已经无所畏惧了。于是迦叶合掌对佛说：世尊，我现在已经得度了，我从现在起，皈依佛，皈依法，皈依僧，尽我一生的寿命作一名优婆塞，请您为我作证。</p></div>"
},{
    "title": "第二章 杂阿含经第十三卷—第一节 先知法住后知涅槃",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  杂阿含经第十三卷</strong></p><p><strong>第一节  先知法住后知涅槃</strong></p><p>（三四七）先知法住后知涅槃的含义</p><p>原文：<strong>时彼须深默然受请。诣王舍城迦兰陀竹园。时众多比丘。出房舍外。露地经行。尔时须深。诣众多比丘。而作是言。诸尊。我今可得。于正法中。出家受具足。修梵行不。</strong></p><p><strong>时众多比丘。将彼须深。诣世尊所。稽首礼足。退住一面。白佛言。世尊。今此外道须深。欲求于正法中。出家受具足。修梵行。尔时。世尊知外道须深。心之所念。告诸比丘。汝等当度。彼外道须深。令得出家。时诸比丘愿度须深。</strong></p><p>释：外道须深默默地接受外道们的请求，到王舍城迦兰陀园想要出家，这时候有众多比丘到房舍外面空地上经行，须深走到比丘们身边说：诸位尊者，我现在可以在正法中出家受具足戒，修行梵行吗？于是众多比丘带领须深到世尊的住处，稽首礼足，退回来站在侧面，对佛说：世尊，现在有个外道叫须深，想要在我们正法中出家受具足戒，修行梵行。这时候世尊就知道外道须深心里所想，告诉诸比丘们说：你们应当度这外道须深，让他出家。于是诸比丘答应愿意度须深出家修道。</p><p>原文：<strong>出家已经半月。有一比丘语须深言。须深当知。我等生死已尽。梵行已立。所作已作。自知不受后有。时彼须深语比丘言。尊者。云何学离欲。恶不善法。有觉有观。离生喜乐。具足初禅。不起诸漏。心善解脱耶。比丘答言。不也须深。</strong></p><p>释：须深出家半个月以后，有一个比丘对须深说：须深你应当知道，我们这些比丘生死都已经了尽了，清净的梵行都建立起来了，所要做的事情都已经做完了，我们都知道不会再有后世的出生了。须深对诸比丘们说：尊者，如何修学离开贪欲恶不善法，达到有觉有观，离开欲界，心生喜乐，具足初禅定，然后不生起一切烦恼漏，心善能得解脱呢？比丘们回答说：解脱不是这样修的，须深。</p><p>外道们错误地认为，具足四禅八定才能得解脱，而佛法却不是这样，佛法上的解脱是定慧具足的解脱，不仅要有初禅以上的禅定，还要有解脱的智慧，证得无我的解脱之理，四圣谛见地通达才能解脱。如果没有断我见的智慧，即使具足四禅八定，仍然是不解脱生死的凡夫。外道们不懂此理，所以须深就以为离开贪欲的恶不善法，只要修出初禅定就可以了，所以比丘们就否定了须深所问的初禅定。</p><p>原文：<strong>复问。云何离有觉有观。内净一心。无觉无观。定生喜乐。具足第二禅。不起诸漏。心善解脱耶。比丘答言。不也须深。复问。云何尊者离喜舍心。住正念正智。身心受乐。圣说及舍。具足第三禅。不起诸漏。心善解脱耶。答言。不也须深。　</strong></p><p>释：须深又问：如何离开有觉有观的境界，内心纯净，住于一心，达到无觉无观，由于禅定而生起喜和乐，具足色界第二禅，然后不生起一切烦恼漏，心善能得解脱呢？比丘回答说：解脱不是这样修的，须深。须深又问：尊者，如何离开喜悦的心，舍去心上的喜悦，住在正念正智上，身心受乐，舍喜得乐，具足第三禅，不生起一切烦恼漏，心善能得解脱呢？比丘回答说：解脱不是这样修的。</p><p>须深听到比丘们说修初禅还不能解脱，就认为还需要修第二、第三禅，就问比丘们如何修出第二、第三禅，结果比丘们又否定了，说修出第二、第三禅也不能得解脱。</p><p>原文：<strong>复问。云何尊者。离苦息乐。忧喜先断。不苦不乐舍。净念一心。具足第四禅。不起诸漏。心善解脱耶。答言。不也须深。复问。若复寂静。解脱色无色。身作证具足住。不起诸漏。心善解脱耶。答言。不也须深。</strong></p><p>释：须深又问：尊者，如何离开苦受，灭去乐受，忧喜心都断除，住于不苦不乐的舍心，心念清净，专一其心，具足第四禅，不生起一切烦恼漏，心善能得解脱呢？比丘回答说：得解脱不是这样修的。须深又问：如何让心寂静，解脱色界和无色界系缚，以身作证，完全住在解脱中，不起一切烦恼漏，心善能得解脱呢？比丘回答说：得解脱不是这样修的。</p><p>原文：<strong>须深复问。云何尊者。所说不同。前后相违。云何不得禅定。而复记说。比丘答言。我是慧解脱也。作是说已。众多比丘。各从座起而去。</strong></p><p>释：须深又问：为什么尊者所说与解脱实证不同，前后相矛盾？为什么不证得四禅八定就自证说不受后有？比丘回答说：我是以智慧得解脱的。说完之后，众多比丘都起座离开了。</p><p>须深以为证果得解脱是通过修四禅八定才能做得到，不知道还需要有解脱的智慧见地，用智慧知解脱法、证解脱法，所以才生出了误会，认为那些阿罗汉所说的自证境界与解脱的境界不一致。阿罗汉有慧解脱的，也有定解脱的，也有俱解脱的。</p><p>慧解脱只要具有初禅定就可以了，解脱智慧必须要具足，在寿命终了时才能依靠解脱智慧入无余涅槃；而定解脱的阿罗汉，必须有四禅八定，同时有解脱的智慧，主要依靠禅定得解脱，入无余涅槃，寿命由自己掌握，可长可短；而俱解脱的阿罗汉，不仅要有四禅八定，还要有灭尽定，解脱的智慧也要具足，才能在灭尽定中随时随地入无余涅槃，不必等寿命终了。</p><p>原文：<strong>尔时。须深知众多比丘去已。作是思惟。此诸尊者。所说不同。前后相违。言不得正受。而复记说。自知作证。作是思惟已。往诣佛所。稽首礼足。退住一面。白佛言。世尊。彼众多比丘。于我面前记说。我生已尽。梵行已立。所作已作。自知不受后有。</strong></p><p>释：这时须深见比丘们离去了，就这样思惟，这些尊者们，所说的与解脱不同，前后不一致，说自己没有得到禅定正受，就记别说自己已经能够证明自己得解脱没有后世了。须深这样想了以后就到佛所住之处，低头顶礼佛足，退到旁边一侧，对佛说：世尊，刚才有众多比丘在我面前说，我生已尽，梵行已立，所作已作，自知不受后有。</p><p>原文：<strong>我即问彼尊者。得离欲恶不善法。乃至身作证。不起诸漏。心善解脱耶。彼答我言。不也须深。我即问言。所说不同。前后相违。言不入正受。而复记说。自知作证。彼答我言。得慧解脱。作此说已。各从座起而去。我今问世尊。云何彼所说不同。前后相违。不得正受。而复说言。自知作证。</strong></p><p>释：我就问那些尊者们，是否已经离开贪欲恶的不善法，乃至能以身作证，不生起诸烦恼漏，心善得解脱了？他们回答我说不是这样的。我问他们说，你们所说的与解脱的情况不同，前后不一致，说不用有四禅八定的正受，就记别说自己能够自作证，不受后有了。他们回答我说得慧解脱的阿罗汉不用有四禅八定，说完以后就走了。我现在请问您世尊，为什么他们所说的与实际解脱的情况不同，前后不一致，却又说能自作证呢？</p><p>原文：<strong>佛告须深。彼先知法住。后知涅槃。彼诸善男子。独一静处。专精思惟。不放逸住。离于我见。不起诸漏。心善解脱。须深白佛。我今不知。先知法住。后知涅槃。彼诸善男子。独一静处。专精思惟。不放逸住。离于我见。不起诸漏。心善解脱。</strong></p><p>释：佛告诉须深说：他们是先知道法住，然后才证知了涅槃。诸善男子们都是独自在一个寂静之处，专门精进的思惟，住于不放逸的修行中，离开了我见，所以才不起一切烦恼漏，心善得解脱了。须深对佛说，我至今还不知道先知法住，后知涅槃，那些善男子们独自在一个寂静之处，专门精进思惟，住于不放逸的修行中，离于我见，从而不起诸漏，心善解脱。</p><p>原文：<strong>佛告须深。不问汝知不知。且自先知法住。后知涅槃。彼诸善男子独一静处。专精思惟。不放逸住。离于我见。心善解脱。须深白佛。唯愿世尊为我说法。令我得知法住智。得见法住智。</strong></p><p>释：佛告诉须深，我不问你现在知不知道先知法住后知涅槃，你自己且先知法住，然后知涅槃。那些善男子们都是独一静处，专精思惟解脱法，心不放逸地修行，离于我见，心善能得解脱。须深对佛说：惟愿世尊为我说法，让我了知法住智，见到法住智。</p><p>先知法住，是知什么法住于什么法呢？是知十二因缘法，并且能住于十二因缘法中，心不他想。有的人说，先知法住，是先知第八识如来藏，这个说法是不对的，这里的法是指十二因缘法，不是第八识如来藏，只有先了解十二因缘，在定中思惟十二因缘法，然后才能证得涅槃，得解脱。法住智是证得十二因缘的智慧，不是证得第八识的智慧。如果这个法理不了解清楚，就无法实证十二因缘法得解脱。</p><p>后知涅槃，是指知如何得解脱，并且能证得涅槃。心善解脱的人，必须有初禅定，断我见证得初果之后，在此定中才能以此禅定断除贪嗔痴烦恼结缚，成为三果人和四果阿罗汉，从而心得解脱，证有余涅槃和无余涅槃。</p><p>原文：<strong>佛告须深。我今问汝。随意答我。须深。于意云何。有生故有老死。不离生有老死耶。须深答曰。如是。世尊。有生故有老死。不离生有老死。</strong></p><p>释：佛告诉须深说：我现在问你，你随意回答我，须深，你怎么认为，有生才有老死，不离生而有老死？须深回答说：是的，世尊，因为有生的缘故才有老死，不离生而有老死。</p><p>原文：<strong>佛又问。如是生有。取爱受触。六入处名色。识行无明。有无明故有行。不离无明。而有行耶。须深白佛。如是。世尊。有无明故有行。不离无明而有行。</strong></p><p>释：佛又问：就像这样，因为有有才有生，不离有而有生；因为有取才有有，不离取而有有；因为有爱才有取，不离爱而有取；因为有受才有爱，不离受而有爱；因为有触才有六入，不离触而有六入；因为有名色才有六入，不离六入而有触；因为有识才有名色，不离识而有名色；因为有行才有识，不离行而有识；因为有无明才有行，不离无明而有行，是这样吗？须深对佛说：是这样，世尊，有无明才有行，不离无明而有行。</p><p>原文：<strong>佛告须深。无生故无老死。不离生灭而老死灭耶。须深白佛言。如是。世尊。无生故无老死。不离生灭而老死灭。佛告须深。如是。乃至无无明故无行。不离无明灭而行灭耶。须深白佛。如是。世尊。无无明故无行。不离无明灭而行灭。</strong></p><p>释：佛告诉须深：无生所以才无老死，不离生的灭而有老死的灭。须深对佛说：是的，世尊，无生就无老死，不离无生而有老死的灭。佛对须深说：就像这样，乃至于无无明所以才无行，不离无明的灭才有行的灭，是不是？须深对佛说：是的，世尊，无无明所以才无行，不离无明的灭而有行的灭。</p><p>原文：<strong>佛告须深。作如是知。如是见者。为有离欲。恶不善法。乃至身作证。具足住不。须深白佛。不也。世尊。佛告须深。是名先知法住。后知涅槃。彼诸善男子独一静处。专精思惟。不放逸住。离于我见。不起诸漏。心善解脱。佛说此经已。尊者须深。远尘离垢。得法眼净。</strong></p><p>释：佛告诉须深：能作这样的知，这样的见的人，是否已经离开了贪欲、恶的不善法，乃至能够以身作证，完全安稳地住于法中了？须深回答说：不是的，世尊。佛告诉须深：我讲的这些理如果能够证得，就是先知法住，后知涅槃，那些善男子们能够独自在一静处专精思惟，住于不放逸中，离开了我见，不起诸漏，心善解脱了。佛说完这部经以后，须深就远尘离垢了，得到了清净的法眼。</p><p>在这一段落里，佛为须深讲了十二因缘法之理，仅仅有这些知见就能以身作证得解脱了吗？显然不是，这些理解了这些知见仅仅是解，后边还要在寂静处禅定中观行思惟，才能有具足住，身心完全住于十二因缘法中，最后才能断尽我见，具足初禅定，断尽烦恼漏，心得解脱，智慧得解脱。须深听完佛讲十二因缘法，心也离开了五蕴世间尘境，离开了烦恼污垢，见法的心眼清净了，不再见五蕴世间，而是见缘起法，住于缘起法中。</p><p>有人一看须深听完法就证果了，就会认为证果很简单，不用有禅定，听法之时思惟一下，明白了就是证果了。其实不是这样简单，要有前提条件，就是这个人必须有禅定，证法的因缘具足了，在当时佛力的加持下，能够满足证法所需的因缘条件，在听法的同时，未到地定具足，能够一心一意听法和观行，没有丝毫的杂念，非常专一，法义能深入到意根当中，完全超越了情思意解，甚至速度快得没有意识情思意解的机会。这是因为平时有禅定的训练，意根习惯于专心思量，性障烦恼轻微，遇法就会思量，没有遮障，所以证果就快速。</p><p>如果不是在佛身边，有佛的磁场和加持力，就不可能快速证果，不可能快速完善证果的因缘，任何善知识都远远没有佛的摄受力大，也没有佛那样强大的磁场和加持力。一个人如果修行非常好，磁场的影响力是非常大的，心清净的人有强大的熏染力和感染力，能够影响到周围的人心都清净，从而能生起禅定，专一其心，处于禅定之中，继而生出智慧，提升智慧。所以在佛身边听法的人，只要具有了一定的得法因缘，佛陀的威德力就会加持他具足得法的因缘条件，证法就显得很容易了。</p><p>（三五二）如实知因缘法才能证道</p><p>原文：<strong>尔时。世尊告诸比丘。若诸沙门婆罗门。于法不如实知。法集法灭。法灭道迹不如实知。彼非沙门沙门数。非婆罗门婆罗门数。彼亦非沙门义。婆罗门义。见法自知作证。我生已尽。梵行已立。所作已作。自知不受后有。</strong></p><p>释：世尊告诉诸比丘：如果沙门婆罗门对于法不如实的了知，对于法的集起和灭去不如实了知，对于法灭去应该修的道不如实了知，他们就不是沙门，不在沙门数中，不是婆罗门不在婆罗门数中；他们也不是真正的沙门，不是真正的婆罗门，没有见法，不能自知以身作证：我生已尽，梵行已立，所作已作。自知不受后有。</p><p>原文：<strong>云何法不如实知。云何法集不如实知。云何法灭不如实知。云何法灭道迹。不如实知。谓于老死法。不如实知。老死集老死灭。老死灭道迹。不如实知。如是生有。取爱受触。六入处不如实知。六入处集。六入处灭。六入处灭道迹。不如实知。如是诸法。不如实知。法集法灭。法灭道迹。不如实知。</strong></p><p>释：什么是法不如实知，什么是法的集起不如实知，什么是法的灭不如实知，什么是法灭的修道轨迹不如实知。对于老死法不如实知，对于老死法的集起和灭去不如实知，对于老死法灭去修道的轨迹不如实知。</p><p>与此相同，对于生、有、取、爱、受、触、六入处法不如实知，对于生、有、取、爱、受、触、六入处法的集起不如实知，对于生、有、取、爱、受、触、六入处法的灭不如实知，对于生、有、取、爱、受、触、六入处法灭的道迹不如实知。也同样的对于诸法不如实知，对于诸法的集起不如实知，对于诸法的灭不如实知，对于诸法灭的道迹不如实知。</p><p>原文：<strong>若诸沙门婆罗门。于法如实知。法集法灭。法灭道迹。如实知。当知是沙门婆罗门。沙门之沙门数。婆罗门之婆罗门数。彼以沙门义。婆罗门义。见法自知作证。我生已尽。梵行已立。所作已作。自知不受后有。</strong></p><p>释：如果诸沙门婆罗门对于诸法如实知，对于诸法的集起和灭去，以及灭的道迹如实知，那么这些沙门婆罗门才属于真正的沙门和婆罗门，在沙门和婆罗门数中。这些沙门婆罗门以沙门和婆罗门的名义见到了缘起法，并且能够自知自作证：我生已尽，梵行已立，所作已作，自知不受后有。</p><p>原文：<strong>何等法如实知。何等法集法灭。法灭道迹如实知。谓老死法如实知。老死集老死灭。老死灭道迹如实知。如是生有。取爱受触。六入处如实知。六入处集。六入处灭。六入处灭道迹如实知。如是诸法如实知。法集法灭。法灭道迹如实知。</strong></p><p>释：是什么法如实知？是什么法的集、什么法的灭、什么法灭的道迹如实知?就是老死法如实知，老死法的集如实知老死法的灭如实知，老死法灭的道迹如实知。同样的对于生有取爱受触六入处法如实知，对于生有取爱受触六入处法的集起如实知，对于生有取爱受触六入处法的灭如实知，对于生有取爱受触六入处法灭的道迹如实知。也同样的对于诸法如实知，对于诸法的集起如实知，对于诸法的灭如实知，对于诸法灭的道迹如实知。</p><p>（三五四）如实知六入处才能如实知后支分</p><p>原文：<strong>尔时。世尊告诸比丘。若诸沙门婆罗门。于六入处。不如实知。而欲超度触者。无有是处。触集触灭。触灭道迹超度者。无有是处。如是超度受爱取有。生老死者。无有是处。超度老死集老死灭。老死灭道迹者。无有是处。</strong></p><p>释：世尊告诉诸比丘，如果沙门婆罗门对于六入处不如实知，想要超越触是不可能的，超越触的集起和触的灭，超越触灭的道迹是不可能的。同样的，如果沙门婆罗门对于触不如实知，对于触的集起和灭以及灭的道迹不如实知，想要超越受、爱、取、有、生、老死是不可能的，超越受、爱、取、有、生、老死的集起和灭，以及灭的道迹，是不可能的。</p><p>原文：<strong>若沙门婆罗门。于六入处如实知。六入处集。六入处灭。六入处灭道迹如实知。而超度触者。斯有是处。如是超度。受爱取有。生老死者。斯有是处。乃至超度老死灭道迹者。斯有是处。</strong></p><p>释：如果沙门婆罗门对于六入处如实知，对于六入处的集起和灭，以及灭的道迹如实知，想要超越触才有可能，超越触的集起和灭，以及触灭的道迹，才有可能。同样的，如实知触、触集、触灭、触灭道迹以后，想要超越受、爱、取、有、生、老死，才有可能，乃至于超越受、爱、取、有、生、老死的集起和灭，以及灭的道迹才有可能。</p><p>在修习十二因缘法中，如果前一个因缘不能如实知如实证，后一个因缘以及后边所有的因缘就不能超越过去，不能如实知如实证，因为前一个因缘是后一个因缘的因和缘，前边的不通，自然就不能通后一个，以及后边所有的因缘。所以修行要按照次第一个法一个法的观行，要有耐心，不能有急迫之心而躐等，否则哪个法也不能证得，不能如实知。　</p><p>（三五五）如何觉知缘起法各支</p><p>原文：<strong>尔时。世尊告诸比丘。当觉知老死。觉知老死集老死灭。老死灭道迹。如是。乃至当觉知行。行集行灭。行灭道迹。</strong></p><p>释：世尊告诉诸比丘，你们应该觉知老死，觉知老死集和老死灭，以及老死灭的道迹，就像这样，也要觉知生、生的集起、生的灭和生灭的道迹；觉知有、有的集起、有的灭和有灭的道迹；觉知取、取的集起、取的灭和取灭的道迹；觉知爱、爱的集起、爱灭和爱灭的道迹；觉知受、受的集起、受的灭和受灭的道迹；</p><p>觉知触、触集、触灭和触灭的道迹；觉知六入处、六入处的集起、六入处的灭和六入处灭的道迹；觉知名色、名色的集起、名色的灭和名色灭的道迹；觉知六识、六识的集起、六识的灭和六识灭的道迹；觉知行、行的集起、行的灭和行灭的道迹。</p><p>原文：<strong>云何当觉知老死。觉知缘生。故有老死。如是老死觉知。云何老死集。生集是老死集。如是老死集觉知。云何老死灭觉知。谓生灭是老死灭。如是老死灭觉知。云何老死灭道迹觉知。谓八圣道是老死灭道迹。如是老死灭道迹觉知。</strong></p><p>释：应该如何觉知老死呢？应该觉知缘于生才有老死，像觉知老死一样，觉知老死是如何集起来的，就知道生集起了，老死就集起了；像觉知老死集一样，觉知老死是如何灭的，就知道生灭了，老死就灭了；像觉知老死灭一样，觉知什么是老死灭的道迹，就知道八正道就是老死灭的道迹；</p><p>原文：<strong>乃至云何行觉知。谓三行。身行口行意行。如是行觉知。云何行集觉知。谓无明集是行集。如是行集觉知。云何行灭觉知。无明灭是行灭。如是行灭觉知。云何行灭道迹觉知。谓八圣道是行灭道迹。如是行灭道迹觉知。</strong></p><p>释：像觉知老死灭的道迹一样，乃至于最后觉知什么是行，知道是身口意行（实际是意根的行，因为身口意行不能在六识之后，应该在六识之前出现。）就像觉知行一样，觉知行是如何集起的，就知道无明集起了行就集起了；就像觉知行集一样，觉知什么是行灭，就知道了无明灭了，行就灭了；就像觉知行灭一样，觉知什么是行灭的道迹，就知道八圣道就是行灭的道迹，这样就觉知了行灭的道迹。</p><p>八正道在断我见，得法眼净之前是必修的内容，无论是修四圣谛法还是修十二因缘法，都必须修八正道，具足八正道，才能具足见道的因缘，才能小乘中乘见道。修八正道对于修心，只有心正了，才能入道，成为圣贤人。</p></div>"
},{
    "title": "第二节 四十四种智和七十七种智",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  四十四种智和七十七种智</strong></p><p>（三五六）四十四种智</p><p>原文：<strong>尔时。世尊告诸比丘。有四十四种智。谛听善思。当为汝说。何等为四十四种智。谓老死智。老死集智。老死灭智。老死灭道迹智。</strong></p><p>释：世尊告诉诸比丘：有四十四种智慧，你们要仔细地听并且好好思惟，我现在就要给你们讲。什么是四十四种智慧呢？就是能够如实了知（实证）老死的智慧，如实了知老死集的智慧，如实了知老死灭的智慧，如实了知老死灭道迹的智慧；如实了知生的智慧，如实了知生集的智慧，如实了知生灭的智慧，如实了知生灭道迹的智慧；</p><p>原文：<strong>如是生有。取爱受触。六入处名色识行智。行集智行灭智。行灭道迹智。是名四十四种智。</strong></p><p>释：如实了知有的智慧，如实了知有的集的智慧，如实了知有灭的智慧，如实了知有灭道迹的智慧；如实了知取的智慧，如实了知取集的智慧，如实了知取灭的智慧，如实了知取灭道迹的智慧；如实了知贪爱的智慧，如实了知贪爱集的智慧，如实了知贪爱灭的智慧，如实了知贪爱灭道迹的智慧。</p><p>如实了知受的智慧，如实了知受集的智慧，如实了知受灭的智慧，如实了知受灭道迹的智慧；如实了知触的智慧，如实了知触集的智慧，如实了知触灭的智慧，如实了知触灭道迹的智慧；如实了知六入处的智慧，如实了知六入处集的智慧，如实了知六入处灭的智慧，如实了知六入处灭道迹的智慧；</p><p>如实了知名色的智慧，如实了知名色集的智慧，如实了知名色灭的智慧，如实了知名色灭道迹的智慧；如实了知六识的智慧，如实了知六识集的智慧，如实了知六识灭的智慧，如实了知六识灭道迹的智慧；如实了知行的智慧，如实了知行集的智慧，如实了知行灭的智慧，如实了知行灭道迹的智慧。以上就是四十四种需要了知的智慧。</p><p>这些智慧都是指实证十二因缘中十一支缘起的智慧，要想实证，就要在甚深禅定中如实如理的去观行和观照，不要情思意解，解的理没有实际作用，不能降伏其烦恼心，更不能断除其烦恼心，无明俱在，生死轮回就不能止。对于因缘法的理解并不难，难的是在定中观行，定中参究，把每一个支分的来龙去脉都参究清楚，真正认识清楚每一支分都是生死结缚，都是苦的和空的，都不是我，因此就能断开生死链条，把结缚打开、断除、毁灭，自心得到解脱和自由。</p><p>（三五七）七十七种智</p><p>原文：<strong>尔时。世尊告诸比丘。有七十七种智。谛听善思。当为汝说。云何七十七种智。生缘老死智。非余生缘老死智。过去生缘老死智。非余过去生缘老死智。未来生缘老死智。非余未来生缘老死智。及法住智。无常有为。心所缘生。尽法。变易法。离欲法。灭法。断知智。</strong></p><p>释：世尊告诉诸比丘：有七十七种智，你们要仔细地听好好思惟。什么是七十七种智？第一种智是知，世间有生的因缘存在，必有老死的智慧；第二种智是知生灭了，老死必灭的智慧；第三种智是知过去世由于有生的缘故，必有老死的智慧；第四种智是知过去世的生灭了，过去世的老死必灭的智慧；</p><p>第五种智是知未来世由于有生的缘故，必有未来世老死的智慧；第六种智是知未来世的生灭了，未来世的老死必灭的智慧；第七种智慧是知生缘老死的法住智，知生是无常的有为法，是七识心所缘出生的法，是能断尽的法，是不断变易的法，是可以离开的贪欲法，是能够灭尽的法，法住智也是知如何断除生的智慧。</p><p>原文：<strong>如是生。有取爱受。触六入处。名色识行。无明缘行智。非余无明缘行智。过去无明缘行智。非余过去无明缘行智。未来无明缘行智。非余未来无明缘行智。及法住智。无常有为。心所缘生。尽法。变易法。无欲法。灭法。断知智。是名七十七种智。佛说此经已。诸比丘闻佛所说。欢喜奉行。</strong></p><p>释：对生有着七种智，对十二因缘法中的有、取、爱、受、触、六入、名色、六识、意根的行和无明，都有同样的七种智慧，合起来就是七十七种智。比如无明缘行，第一种智是知由于无明的缘故，必有行的智慧；第二种智是知无明灭了，行必灭的智慧；第三种智是知由于过去世有无明存在的缘故，必有行的智慧；</p><p>第四种智是知过去世的无明灭了，行必灭的智慧；第五种智是知未来世由于有无明的缘故，必有行的智慧；第六种智是知未来世的无明灭了，未来世的行必灭的智慧；第七种智是法住智，知无明是无常的有为法，是七识心所缘出生的法，是能断尽的法，是不断变易的法，是可以没有欲望的法，是能够灭尽的法，无明法住智也是知如何灭尽无明的智慧。</p><p>（三五八）顺因缘增苦逆因缘减苦</p><p>原文：<strong>尔时。世尊告诸比丘。有增法减法。谛听。善思。当为汝说。云何增法。所谓此有故彼有。此起故彼起。谓缘无明行。缘行识。乃至纯大苦聚集。是名增法。</strong></p><p>释：世尊告诉诸比丘们说：有一种增法和一种减法，我要跟你们说，你们仔细地听，好好地思惟，我就要为你们说。什么是增法呢？增法就是指此有故彼有，此起故彼起。由于有此法的存在，就会引生彼法出现，就增加了彼法，也就是缘于无明而有行，缘于行而有识，乃至于缘于生而有老死忧悲苦恼纯大苦聚，这是十二因缘顺生死流转的缘起法，叫作增法，是增加生死苦的法。</p><p>原文：<strong>云何减法。谓此无故彼无。此灭故彼灭。所谓无明灭则行灭。乃至纯大苦聚灭。是名减法。</strong></p><p>释：什么是减法呢？减法就是指此无故彼无，此灭故必灭。由于此法消失没有了，彼法就随着一起消失没有了，此法灭了彼法就随之也灭去了。也就是无明灭了所以行也随之灭了，行灭了六识也随着一起灭了，乃至于生灭了老死忧悲苦恼纯大苦聚也随之灭尽无余，这是十二因缘逆生死流的缘灭法，叫作减法，是减去生死苦的法。　</p><p>（三五九）攀缘识住有未来苦聚</p><p>原文：<strong>尔时。世尊告诸比丘。若思量。若妄想生。彼使攀缘识住。有攀缘识住故。有未来世生老病死忧悲恼苦。如是纯大苦聚集。若不思量。不妄想。无使攀缘识住。无攀缘识住故。于未来世生老病死忧悲恼苦灭。如是纯大苦聚灭。</strong></p><p>释：世尊告诉诸比丘们说：一个人如果心起思量和妄想，就会使得攀缘六尘境界的六识出生，住在六尘境界上，因为有六识住在六尘境界上，就会有未来世的生老病死忧悲苦恼，纯大苦的聚集。如果一个人不再思量和妄想，就没有攀缘六尘境界的六识出生，住在六尘境界上，因为没有攀缘六尘的六识住着，未来世的生老病死忧悲苦恼纯大苦聚，就会灭去不出现。</p><p>这里说的思量妄想都是指意根的思量和妄想性，意根思量诸法、妄想诸法的时候，就会有六识出生造作身口意行去满足意根的妄想，实现意根的妄想，于是六识就会住在妄想境界上，身口意行现行，业种留存，就会有后世的名色来承受生老病死忧悲苦恼。如果意根不再思量诸法，也没有了什么妄想，六识就不会出生，身口意行也不会出现，没有业种留存，就没有后世的生老病死忧悲苦恼。</p></div>"
},{
    "title": "第三节 如何实证四十四种智",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  如何实证四十四种智</strong></p><p>（三六七）如何实证四十四种智</p><p>原文：<strong>尔时。世尊告诸比丘。当勤方便修习禅思。内寂其心。所以者何。比丘禅思。内寂其心。精勤方便者。如是如实显现。</strong></p><p>释：世尊告诉诸比丘们：你们应当精勤的寻找适当的方法，来修习在禅定中清净地思惟，让内心寂静。为什么要这样做呢？因为比丘精勤方便的修习，在禅定中思惟，心清净寂静了以后，心中就能像这样的如实显现其法。</p><p>原文：<strong>云何如实显现。老死如实显现。老死集。老死灭。老死灭道迹如实显现。生有取爱。受触六入处。名色识行。如实显现。行集行灭。行灭道迹。如实显现。此诸法无常。有为有漏。如实显现。</strong></p><p>释：什么法能在心中如实显现出来呢？老死这个法能如实显现出来，证得何为老死以及老死的缘；心中能如实显现老死是如何集起的，证得老死的集是由生集起出现的；心中能如实显现出老死的灭没，证得生的灭没就会使得老死灭没；心中还能如实显现老死灭的修道的用功方法，知道需要修习八正道，才能灭除老死之法。</p><p>精勤修习禅定和思惟观行，生这个法就能在心中如实地显现出来，证得生的缘，知道生的现象；生的集起能如实的在心中显现出来，生的灭去之理能在心中如实的显现出来，把灭生的修道方法能在心中显现出来。同样其它的法，比如有、取、爱、受、触、六入处、名色、六识、行都能在心中显现出来，乃至于这些支分的集、灭道迹都能在心中显现出来。证得这些所有支分都是生灭无常的，都是有为法，也都是有漏有烦恼之法，因此都要断除灭尽，最后才能解脱生死系缚。</p><p>佛所教导的修道方法是：修习禅思，内寂其心，这是禅定和观行智慧双修的方法，二者缺一不可。在内寂其心的时候，禅定非常深，心无杂念，这时候才能起用意根的思，才能证法，诸法才能如实地显现出来。如果没有方便禅思，内心不寂静，就无法深入地思和观行，就不能实证。如实显现代表着现量智慧境界，代表着意根的实证，非量和比量都不是如实显现。</p><p>十二因缘法在心中如实显现是非常不容易的，用意识去解，当然不是太困难的，理解相对来说是容易，但是要如实的实证，把十二因缘的实质和来龙去脉弄得一清二楚，是非常困难的，困难在禅定的修习上和观行智慧的不足。没有禅定就没有观行智慧，不懂得如何下手实际观行，禅定浅，观行智慧不足，观行也不会上路。没有禅定和禅定不足，都无法真正的思量法的深义，只能浮在表面，搞一下情思意解，智慧浅薄，不深透，抵不住生死业障。因此修习任何一种法，都需要甚深的禅定，和熟练的观行智慧，知道如何起观起思量，定慧等持的三昧容易出生。</p><p>（三六八）如何实证四十四种智</p><p>原文：<strong>尔时。世尊告诸比丘。当修无量三摩提。专精系念。修无量三摩提。专精系念已。如是如实显现。云何如实显现。谓老死如实显现。乃至行如实显现。此诸法无常。有为有漏。如是如实显现。</strong></p><p> 释：世尊告诉诸比丘们：你们应当修习无量的禅定，在定中一心一意精勤地系念十二因缘法，在无量的禅定中精勤的系念十二因缘法之后，法义才能在心中如实的显现出来。什么法如实显现？老死这一法在心中如实显现，老死的现象，老死的因，老死的缘，老死是如何集起的，老死是如何灭去的，灭去老死所修的八正道，都如实地显现出来，心中非常明了。</p><p>乃至于生、有、取、爱、受、触、六入处、名色、六识、行这些法都分别的在心中显现出来，这些法的现象，产生这些法的因和缘，这些法是如何集起的，如何灭去的，灭去这些法所修的八正道，都在心中如实的显现出来。这些法都是无常的，都是有为的有漏法，这个理如果能在心中这样如实地显现出来，就会获得解脱的大智慧。</p><p>如实就是法的本然状态，真实的不为人知的状态，不是众所周知的表面现象，而是生灭、变异、无常、苦、空、无我的。心中能够这样显现出法了，智慧刹那就生起来了，心就住于解脱之境了。</p><p>（三六九）逆顺观察十二因缘</p><p>原文：<strong>尔时。世尊告诸比丘。昔者毗婆尸佛未成正觉时。住菩提所。不久成佛。诣菩提树下。敷草为座。结跏趺坐。端坐正念。一坐七日。于十二缘起逆顺观察。所谓此有故彼有。此起故彼起。缘无明行。乃至缘生有老死。及纯大苦聚集。纯大苦聚灭。彼毗婆尸佛正坐七日已。从三昧觉。说此偈言。</strong></p><p>释：世尊告诉诸比丘说：往昔之时，毗婆尸佛还没有成佛的时候，住在菩提道场中，不久就成佛了。毗婆尸佛到菩提树下，铺草作为禅座，盘着双腿静坐，端身正念，连续坐了七天，对于十二因缘法先是顺向观察，后又逆向观察。观察此有故彼有，此起故彼起之十二因缘。缘于无明而有行，乃至缘于生而有老病死忧悲苦恼纯大苦聚集，纯大苦聚灭。毗婆尸佛端身正坐七天以后，就从三昧当中起座，说如下的偈子。</p><p>无论是十方诸佛，还是十方大菩萨，以及辟支佛缘觉佛，在观察十二因缘法时，都是在甚深禅定中起观，定慧等持，都有三昧定境，才能观行成就，从而实证，获得解脱的三昧境界，实证任何一个法门都是在甚深禅定中观修，不离戒定而证三昧慧。如果没有禅定，无法真实观行，就无法实证。所以不要误会说诸佛菩萨和辟支佛、阿罗汉都是通过推理的方式证得十二因缘，或者是四圣谛，或者是明心见性的。圣贤们证得佛法，无一不是在甚深禅定中，无一不具足禅定，没有一个人是依靠推理和情思意解，而意解佛法的。　　</p><p>原文：<strong>如此诸法生　梵志勤思禅　永离诸疑惑　知因缘生法</strong></p><p><strong>若知因生苦　知诸受灭尽　知因缘法尽　则知有漏尽</strong></p><p><strong>如此诸法生　梵志勤思禅   永离诸疑惑　知有因生苦</strong></p><p><strong>如此诸法生　梵志勤思禅　永离诸疑惑　知诸受灭尽</strong></p><p><strong>如此诸法生　梵志勤思禅   永离诸疑惑　知因缘法尽</strong></p><p><strong>如此诸法生　梵志勤思禅   永离诸疑惑　知尽诸有漏</strong></p><p><strong>如此诸法生　梵志勤思禅   普照诸世间　如日住虚空</strong></p><p><strong>破坏诸魔军　觉诸结解脱。</strong></p><p>释：这些法都是如何出生的，梵志在禅定中精勤思量，最后思量通达，永远地离开了所有的疑惑，心开意解，实证一切法都是因缘所生。如果能证得由于种种的因缘导致了生老病死忧悲苦恼的产生，证知了所有的受都灭尽了，也证知了因缘所生法都灭尽了，这时候就证得了漏尽通，所有的烦恼漏都断除了。这些因缘生法，梵志精勤的在禅定中思量，以其智慧普照一切世间，如太阳般住于虚空中，摧毁了一切的魔军，觉悟诸法，断除烦恼结，永得解脱。</p><p><br/></p></div>"
},{
    "title": "第四节 四食与十二因缘的关系",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第四节  四食与十二因缘的关系</strong></p><p>（三七一）四种食集</p><p>原文：<strong>尔时。世尊告诸比丘。有四食资益众生。令得住世。摄受长养。何等为四。谓一粗抟食。二细触食。三意思食。四识食。</strong></p><p>释：世尊告诉诸比丘：有四种食能够滋养和助益众生的生命体，使得众生得以资助和增益，得以住于世间，得到摄受和滋养。是哪四种食呢？第一种粗抟食是比较粗糙的四大组成的饮食，滋养色身，维持生命；第二种细触食是比较微细的触食，以六根对六尘的触以及六根六识与六尘三者和合的触为食，滋养五受阴，维持生命；第三种意思食是以意识意根的思量为食，滋养五蕴身，维持生命；第四种识食是以识心的持身为食，维持五蕴身的运行，维持生命。</p><p>第一种粗抟食是欲界人间众生和畜生所食用的食物，通过咀嚼进入肠胃被身体吸收，以滋养色身，维持生命住世。因为人类和畜生的色身，是由四大组成的粗重的色身，需要粗糙的饮食来维系，微细的色身需要微细的饮食来维系，或者是用禅定来维系。如果无四大色身就不需要四大组成的饮食，仅仅以禅定来维系生命就可以了。欲界天人虽然也是食用四大组成的饮食，但是饮食是非常微细的，不用咀嚼，用鼻嗅闻就饱。</p><p>第二种细触食，是以根尘相触为食，有四大色身的众生需要触食，无四大色身的众生也需要触食，因为无色界众生虽然无四大色身，却有意根，意根与法尘相触，才能维系无色界众生的生命。众生为什么需要触食呢？因为众生有色蕴、受蕴、想蕴、行蕴和识蕴，有六根、六尘和六识，只有根尘相触生起六识，五蕴才能运行，才能了别六尘境界，拥有六尘境界，这是生命所必需。如果没有触食了，众生必入涅槃，生命消失。</p><p>第三种意思食，主要以意根对法的思量食为主，意根恒审思量，片刻不停息，意识断续思量食为辅，只有思量才能让五蕴运行下去，吸纳尘境，这是三界无明众生所必需，如果没有思食，众生必入涅槃，生命消失。</p><p>第四种识食，是以八个识为食，维持生命的运行。八个识都有持身的作用，第八识是绝对的持身识，是第一持身识，七识是相对的持身识，第七识是第二持身识，意识是第三持身识，五识是第四持身识。只要有第八识和第七识二识共同持身，五蕴生命体即可住世，但五蕴的功能作用不全，极大多数众生必不能离开意识的持身作用，以及五识的持身作用，五蕴功能才能圆满的运行，生命才能相续和集起，能诸根互用的八地以上菩萨除外。虽然第八识有绝对的持身作用，是一切食的根源和基础，是根本食，但这里的识食还是以六七识的食为主。</p><p>众生所需的四种食，都离不开识食，以识食为根本食摄受五蕴身，以此为基础才会需要触食和思食。如果没有甚深的禅定，就必须有地水火风四大种子组成的抟食作为色身的营养元素，如果禅定比较深，就可以断除抟食，以识食和思食为主滋养色身，可以有轻微的触食，也可以断除一部分的触食。众生越依赖这四种食，生死越流转，苦受越多。禅定越深，对这四种食的依赖越少，生命越自在，但是对第八识的依赖是永远断除不了的，只要不执第八识就好。</p><p>原文：<strong>此四食何因何集。何生何触。谓此诸食。爱因爱集。爱生爱触。此爱何因何集。何生何触。谓爱受因受集。受生受触。此受何因何集。何生何触。谓受触因触集。触生触触。</strong></p><p>释：这四种食是以什么法为因出现的？是因为什么法集起的？是什么法出生引起的？是什么法触引生的？这四种食是以爱为因出现的，是爱的集引起的，是爱出生所引起的，是爱触了引生出来的。那么这个爱是以什么法为因而出现的？因为什么法集起而引生的？因为什么法生出来而引发的？是什么法触了以后而产生出来的？</p><p>这个爱是以受为因而出现的，是因为受集而引生的，是因为受出生了而引发出来的，是因为受触了以后产生出来的。这个受是以什么法为因而出现的？是因为什么法集起而引生出来的？是因为什么法出生了引发的？是什么法触了以后产生出来的？这个受是以六根对六尘的触为因出现的，是触集起了引生的，是触生出来导致的，是六根对六尘的触触了引生出来的。</p><p>如果没有爱，爱灭尽了，识食不生，就没有触食，没有触食就思食和抟食，四种食就会灭尽不生。所以贪爱就是苦，贪爱是生死流转的苦因。</p><p>原文：<strong>此触何因何集。何生何触。谓触六入处因。六入处集。六入处生。六入处触。六入处集是触集。触集是受集。受集是爱集。爱集是食集。食集故未来世生老病死。忧悲恼苦集。如是纯大苦聚集。</strong></p><p><strong>如是六入处灭则触灭。触灭则受灭。受灭则爱灭。爱灭则食灭。食灭故。于未来世生老病死。忧悲恼苦灭。如是纯大苦聚灭。</strong></p><p>释：这个触是以什么法为因出现的？是什么法集起了而出现的？是什么法生了引发出来的？是什么法触了引起的？触是以六入处为因而出现的，是六入处集起了而引生的，是六入处生出来所引起的，是六入处触了导致的结果。六入处集就是触的集，触集就是受的集，受集就是爱的集，爱集就是四种食的集。因为食集的缘故未来世的生老病死忧悲苦恼就会集起来了，纯大苦聚就集起来了。</p><p>依这些法的相关关系来说，如果六入处灭了触就灭了，触灭了受就灭了，受灭了爱就灭了，爱灭了四种食就灭了，四种食灭了，未来世的生老病死忧悲苦恼纯大苦聚就灭了。</p><p>（三七二）四食与十二因缘的关系</p><p>原文：<strong>尔时。世尊告诸比丘。有四食资益众生。令得住世摄受长养。何等为四。一粗抟食。二细触食。三意思食。四识食。</strong></p><p>释：世尊告诉诸比丘：有四种食能够滋养和助益众生，使得众生得以摄受，长久住世。是哪四种食呢？第一种是粗糙的饮食；第二种是微细的触食；第三种是意识和意根的思食；第四种是识心的了别食。</p><p>原文：<strong>时有比丘名曰颇求那。住佛后扇佛。白佛言。世尊。谁食此识。佛告颇求那。我不言有食识者。我若言有食识者。汝应作是问。我说识是食。汝应问言。何因缘故有识食。我则答言。能招未来有。令相续生。</strong></p><p>释：这时候一个比丘名叫颇求那站在佛的身后为佛扇扇子，对佛说：世尊，是谁把识心当作食？佛告诉颇求那：我没有说有个以识为食的人，我如果说有个以识为食的人，你这样才可以问。而我说的是识心也是一种资益众生的食，你应该这样问：因为什么缘故有识心这种食？我就回答说：识食能招致未来世的有，能让三界的有相续不断的产生。</p><p>佛为什么说没有食七识八识者？佛为什么说没有以七识八识为食者？因为需要识食者是五蕴众生，而五蕴众生是和合体，没有主宰，识是没有主宰的和合体中的最主要元素，识不自食，无主宰者则无食者。为什么会有识食？佛说因为有识食才能感召未来世的三界有。从这句话中，我们能体会到小乘和中乘的识食是指六识的食，有六识的食就会有后世的名色。而大乘的识食包括七八二识，以七八二识为主，六识为辅。</p><p>原文：<strong>有有故有六入处。六入处缘触。颇求那复问。为谁触。佛告颇求那。我不言有触者。我若言有触者。汝应作是问为谁触。汝应如是问。何因缘故生触。我应如是答。六入处缘触。</strong></p><p>释：由于有三界有的缘故有六入处，以六入处为缘能产生触。颇求那又问佛：是谁触？佛告诉颇求那：我没有说有能触的人，我如果说有能触者，你才应该这样问是谁触。你应该像这样问：因为什么缘故而产生了触？我就应该回答说：因为有六入处触的缘故才产生了触。</p><p>为什么佛说没有触者？为什么没有受者、没有爱者、没有取者、没有有者、没有生者、没有老死者？因为触是根尘相触，是内六入与外六入的触，根尘、内外六入无自性，无主宰，无主人，因此没有能触和所触，没有触者。同理，也没有受者，没有爱者，没有取者，没有有者，没有生者，没有老死者。</p><p>原文：<strong>触缘受。复问。为谁受。佛告颇求那。我不说有受者。我若言有受者。汝应问为谁受。汝应问言。何因缘故有受。我应如是答。触缘故有受。</strong></p><p><strong>受缘爱。复问。世尊。为谁爱。佛告颇求那。我不说有爱者。我若说言有爱者。汝应作是问为谁爱。汝应问言。何缘故有爱。我应如是答。缘受故有爱。</strong></p><p>释：由于触的缘故就产生了受。颇求那又问：是谁受？佛告诉颇求那说：我没有说有能受的人，我如果说有能受者，你才应该问是谁受。你应该像这样问：因为什么缘故才有了受？我就回答说：由于有触的缘故才产生了受。</p><p>由于受的缘故才产生了爱。颇求那又问：世尊，是谁有贪爱？佛告诉颇求那：我没有说有贪爱的人，我如果说有贪爱者，你应该问是谁贪爱。你应该这样问，因为什么缘故产生了贪爱，我应该这样回答：因为有受的缘故所以才有贪爱。</p><p>原文：<strong>爱缘取。复问。世尊为谁取。佛告颇求那。我不说言有取者。我若说言有取者。汝应问言为谁取。汝应问言。何缘故有取。我应答言。爱缘故有取。</strong></p><p>释：缘于贪爱就会产生取的行为。颇求那又问：世尊，是谁取？佛告诉颇求那：我没有说有个取者，我如果说有个取者，你应该问是谁取。你应该这样问：是什么因缘导致取的产生？我应该这样回答：是贪爱的缘故导致了取的产生。</p><p>原文：<strong>取缘有。复问。世尊为谁有。佛告颇求那。我不说有有者。我若说有有者。汝应问言为谁有。汝今应问。何缘故有有。我应答言。缘取故有有。能招当来有。触生是名有。</strong></p><p>释：缘于取就会产生三界的有。颇求那又问：世尊，是谁有？佛告诉颇求那：我没有说有个有者，我如果说有个有者，你应该问是谁有。你现在应该这样问：是什么因缘导致三界有的出现？我应该这样回答：有取的心行，所以才会有三界的有，取能招来未来世的有。触生出来了，就叫作有。</p><p>原文：<strong>有六入处。六入处缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老病死忧悲恼苦。如是纯大苦聚集。谓六入处灭则触灭。触灭则受灭。受灭则爱灭。爱灭则取灭。取灭则有灭。有灭则生灭。生灭则老病死忧悲恼苦灭。如是纯大苦聚集灭。</strong></p><p>释：因为有六入处才有触，六入处的因缘导致触的产生，触的因缘产生受，缘于受有爱，缘于爱有取，缘于取产生有，缘于有就有生命出生，有生命就有老病死忧悲苦恼，这样纯大苦就聚集起来了。如果六入处灭了，触就灭，触灭了受就灭，受灭了爱就灭，爱灭了取就灭，取灭了有就灭，有灭了生就灭，生灭了老病死忧悲苦恼灭，纯大苦聚就灭。</p><p>在十二因缘法中，没有食识者，没有触者，没有受者，没有爱者，没有取者，没有有者，没有生者，没有老病死者，因为这一切法都是因缘所生，因缘所生法都是没有主宰的，都不是主。那还有谁把识当作食？还有谁能触、受、爱、取、有、生、老病死？没有能者，这一切只不过是如浮云一般的假象罢了，过而不留，不断迁徙演变，生灭变异，不可得。当时过境迁时，就不再触了，即使有触，也没有当时的那种受了，更没有爱了，也不会有取着了。但还是不免有后世的有，因为还会有别样的触，别样的受、爱、取，这就是变异。</p><p>如果有主，这些法就不会变异了，恒一触，恒一受，恒一爱，恒一取，恒一有，没有生老病死。无主必生灭变异无常，不恒定，必没有识食者，没有触者、受者、爱者、取者、有者，生者、老病死者。</p></div>"
},{
    "title": "第三章 长阿含经中的十二因缘法—第一节 长阿含大缘方便经第九",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  长阿含经中的十二因缘法</strong></p><p><strong>第一节  长阿含大缘方便经第九</strong></p><p>原文：<strong> 尔时。佛告阿难。缘生有老死。此为何义。若使一切众生。无有生者。宁有老死不。阿难答曰。无也。是故阿难。以此缘。知老死由生。缘生有老死。我所说者。义在于此。</strong></p><p>释：佛告诉阿难，缘于生而有老死，这是什么意思？如果能使一切众生没有了生，还能有老死吗？阿难回答说：没有生就没有老死。佛说：因此说，阿难，因为这个缘故，就知道老死是由于生而有，缘于生才有老死，我说的意思就是这样。</p><p>原文：<strong>又告阿难。缘有有生。此为何义。若使一切众生。无有欲有。色无色有者。宁有生不。答曰。无也。 阿难。我以此缘。知生由有。缘有有生。我所说者。义在于此。</strong></p><p>释：佛又告诉阿难说：缘于三界世间有而有生，这是什么意思？如果能使一切众生没有欲界的有、色界的有和无色界的有，还能有生吗？阿难回答说：没有三界的有就没有生。佛说：阿难，我因为这个缘故，知道生是因为三界世间有而有的，缘于三界世间的有才有生，我说的就是这个意思。</p><p>原文：<strong>又告阿难。缘取有有。此为何义。若使一切众生。无有欲取。见取戒取。我取者。宁有有不。答曰。无也。阿难。我以此缘。知有由取。缘取有有。我所说者。义在于此。</strong></p><p>释：佛又告诉阿难说：缘于取着才有三界世间的有，这是什么意思？如果要使一切众生没有了贪欲取，没有了以我见为首的种种邪见的取着，没有了把不能解脱的非戒当作能解脱戒的戒取，没有了对自我五阴的我取，还能有三界世间的有吗？阿难回答说：没有这些取着就没有三界世间的有。佛说：阿难，我因为这个缘故，知道三界世间的有是由于种种取着才有的，正因为有对三界世间法的求取，才有了三界世间的有，我说的就是这个意思。</p><p>原文：<strong>又告阿难。缘爱有取。此为何义。若使一切众生。无有欲爱。有爱无有爱者。宁有取不。答曰。无有。阿难。我以此缘。知取由爱。缘爱有取。我所说者。义在于此。</strong></p><p>释：佛又告诉阿难说：由于对三界世间法有贪爱才有对三界的执取，这是什么意思？如果要使一切众生没有了对欲界的贪爱，没有了对色界的贪爱，没有了对无色界的贪爱，还能有对三界的执取吗？阿难回答说：不能有执取了。佛说：阿难，我因为这个缘故，知道对三界世间的执取是由于对三界的贪爱才有的，正因为有对三界世间法的贪爱才有了对三界世间法的执取，我说的就是这个意思。</p><p>原文：<strong>又告阿难。缘受有爱。此为何义。若使一切众生。无有乐受苦受。不苦不乐受者。宁有爱不。答曰。无也。阿难。我以此缘。知爱由受。缘受有爱。我所说者。义在于此。</strong></p><p>释：佛又告诉阿难说：缘于受觉才有贪爱，这是什么意思？如果要使一切众生没有了乐受、苦受和不苦不乐受，还能有贪爱吗？阿难回答说：没有受就不能有贪爱了。佛说：阿难，我因为这个缘故，知道贪爱的产生是由于有受的缘故，正因为有种种受觉才有了贪爱，我说的就是这个意思。</p><p>原文：<strong>阿难。当知因爱有求。因求有利。因利有用。因用有欲。因欲有著。因著有嫉。因嫉有守。因守有护。阿难。由有护故。有刀杖诤讼。作无数恶。我所说者。义在于此。</strong></p><p>释：阿难，你应当知道因于贪爱才有了求取，因为求取才会有利益，因为有利益才会去用，因为用了才有了贪欲，因为贪欲才生起了执著，因为执著才生起了嫉妒，因为嫉妒才会去守护，因为有守的心才会有护。阿难，由于想要护着的缘故，就有刀杖和诤讼是非，于是就会造作无数的恶业，我所说的就是这个意思。</p><p>原文：<strong>阿难。此为何义。若使一切众生。无有护者。当有刀杖诤讼。起无数恶不。答曰。无也。是故。阿难。以此因缘。知刀杖诤讼。由护而起。缘护有刀杖诤讼。阿难。我所说者。义在于此。</strong></p><p>释：阿难，这是什么意思？假如要使一切众生不再有守护财色名食睡等利益的心，还会有刀杖斗争和诤讼纠纷，乃至于造作出无数的恶业吗？阿难回答说：没有守护利益的心就没有斗争纠纷和恶业了。佛说：因此说，阿难，因为这个原故，我知道刀杖斗争和诤讼纠纷，是缘于有保护利益的心而引起的，缘于袒护才有刀杖和诤讼。阿难，我所说的就是这个意思。</p><p>原文：<strong>又告阿难。因守有护。此为何义。若使一切众生无有守者。宁有护不。答曰。无也。阿难。我以此缘。知护由守。因守有护。我所说者。义在于此。</strong></p><p>释：佛又告诉阿难说：因为有守着财色名食睡等等自身利益的心，所以才有了袒护的行为，这是什么意思？假如要使众生没有了守的心，还能有袒护的行为吗？阿难回答说：没有守的心就不会有袒护了。佛说：阿难，我因为这个缘故，知道了袒护的行为是由于守的心而有，因于守才有了袒护，我所说的就是这个意思。</p><p>原文：<strong>阿难。因嫉有守。此为何义。若使一切众生无有嫉者。宁有守不。答曰。无也。阿难。我以此缘。知守由嫉。因嫉有守。我所说者。义在于此。</strong></p><p>释：阿难，因为嫉妒所以才有守住自己利益的心，这是什么意思？假如要使一切众生没有了嫉妒心，还能有守护的心行吗？阿难回答说：没有嫉妒就不会去守护了。佛说：阿难，我因为这个缘故，知道守的心缘于嫉妒而有，因于嫉妒而有守护，我所说的就是这个意思。</p><p>原文：<strong>阿难。因著有嫉。此为何义。若使一切众生无有著者。宁有嫉不。答曰。无也。阿难。我以此缘。知嫉由著。因著有嫉。我所说者。义在于此。</strong></p><p>释：阿难，因于执著才会有嫉妒，这是什么意思？假如要使一切众生都没有了执著，还能有嫉妒吗？阿难回答说：没有了执著就不会有嫉妒。佛说：阿难，我因为这个缘故，知道嫉妒是缘于执著，因于执著才有了嫉妒，我所说的就是这个意思。</p><p>原文：<strong>阿难。因欲有著。此为何义。若使一切众生无有欲者。宁有著不。答曰。无也。阿难。我以此缘。知着由欲。因欲有着。我所说者。义在于此。</strong></p><p>释：阿难，因为有贪欲才会有执著，这是什么意思？假如要使一切众生没有贪欲了，还能有执著吗？阿难回答说：没有贪欲就没有执著了。佛说：阿难，我因为这个缘故，知道执著是由于贪欲才有的，缘于贪欲才会有执著，我所说的就是这个意思。</p><p>原文：<strong>阿难。因用有欲。此为何义。若使一切众生无有用者。宁有欲不。答曰。无也。阿难。我以此义。知欲由用。因用有欲。我所说者。义在于此。</strong></p><p>释：阿难，因为有利可用才有贪欲，这是什么意思？假如要使一切众生不再去用了，还能有贪欲吗？阿难回答说：没有了用的心就没有贪欲了。佛说：我因为这个缘故，知道贪欲是由于想用的缘故才出现的，因为想要用才有了贪欲，我有所说的就是这个意思。</p><p>原文：<strong>阿难。因利有用。此为何义。若使一切众生无有利者。宁有用不。答曰。无也。阿难。我以此义。知用由利。因利有用。我所说者。义在于此。</strong></p><p><strong>阿难。因求有利。此为何义。若使一切众生无有求者。宁有利不。 答曰。无也。阿难。我以此缘。知利由求。因求有利。我所说者。义在于此。</strong></p><p>释：阿难，因为有利益所以才有了用，这是什么意思？假如要使一切众生没有了利益，还能有想要用的心吗？阿难回答说：没有利就没有用了。佛说：阿难，我因为这个道理，知道用是由于有利益的缘故才出现的，由于有利益而想要用，我所说的就是这个意思。</p><p>阿难，因为有所求取才会有利益之说，这是什么意思？假如要使一切众生没有了贪求，还能有什么利益吗？阿难回答说：没有所求就没有利益之说了。佛说：阿难，我因为这个缘故，知道利益缘于求取才会有，因为有求取才有了利益，我所说的就是这个意思。</p><p>原文：<strong>阿难。因爱有求。此为何义。若使一切众生无有爱者。宁有求不。 答曰。无也。阿难。我以此缘。知求由爱。因爱有求。我所说者。义在于此。又告阿难。因爱有求。至于守护。受亦如是。因受有求。至于守护。</strong></p><p>释：阿难，因为有贪爱才会有求取，这是什么意思？如果要使一切众生没有了贪爱，还能有求取心吗？阿难回答说：没有了贪爱就不会有所求了。佛说：阿难，我因为这个缘故，知道求取是由于贪爱的缘故，缘于贪爱才有了求取，我所说的就是这个意思。佛又告诉阿难说：因于贪爱才有所求取，乃至于有守护；受也是这样，因于受而有所求取，乃至于有守护。</p><p>原文：<strong>佛告阿难。缘触有受。此为何义。阿难。若使无眼无色。无眼识者。宁有触不。 答曰。无也。若无耳声耳识。鼻香鼻识。舌味舌识。身触身识。意法意识者。宁有触不。答曰。无也。</strong></p><p><strong>阿难。若使一切众生无有触者。宁有受不。答曰。无也。阿难。我以是义。知受由触。缘触有受。我所说者。义在于此。</strong></p><p>释：佛告诉阿难说：因为有触才有受，这是什么意思？阿难，如果要使一切众生没有眼根和色尘，也没有眼识的话，还能有触吗？阿难回答说：没有根尘识就没有触了。佛说：如果要使一切众生没有耳根、声尘和耳识，没有鼻根、香尘和鼻识，没有舌根、味尘和舌识，没有身根、触尘和身识，没有意根、法尘和意识，还能有触吗？阿难回答说：没有根尘识就没有触了。</p><p>佛说：阿难，如果要使一切众生没有了触，还能有受吗？阿难回答说：没有触就没有受了。佛说：阿难，我因为这个道理，知道受是由于触而有的，缘于触才有受，我所说的就是这个意思。</p><p>原文：<strong>阿难。缘名色有触。此为何义。若使一切众生无有名色者。宁有心触不。 答曰。无也。 若使一切众生无形色相貌者。宁有身触不。答曰。无也。阿难。若无名色。宁有触不。答曰。无也。阿难。我以是缘。知触由名色。缘名色有触。我所说者。义在于此。 </strong></p><p>释：阿难，缘于名色才会有触，这是什么意思？假如要使一切众生没有名色了，还能有心去触吗？阿难回答说：没有名色就没有触了。佛说：假如要使一切众生没有了有形的色体和相貌，还能有身触吗？阿难回答说：没有形色就没有身触了。佛说：阿难，如果没有了名色，还能有触吗？阿难回答说：没有名色就没有触了。佛说：阿难，我因为这个缘故，知道触是由于名色而有的，缘于名色才有触，我所说的就是这个意思。</p><p>原文：<strong>阿难。缘识有名色。此为何义。若识不入母胎者。有名色不。答曰。无也。若识入胎不出者。有名色不。答曰。无也。若识出胎。婴孩坏败。名色得增长不。答曰。无也。阿难。若无识者。有名色不。答曰。无也。阿难。我以是缘。知名色由识。缘识有名色。我所说者。义在于此。</strong></p><p>释：阿难，缘于识（阿赖耶识）才有名色，这是什么意思？假如阿赖耶识不入母胎，能有名色不？阿难回答说：识不入胎不能有名色。佛说：如果阿赖耶识入胎而不出母胎的话，还能有名色吗？阿难说：不出胎就没有名色。佛说：如果阿赖耶识出母胎了，婴儿色身却坏死了，名色能得到增长不？阿难说：名色不能增长了。佛说：阿难，如果没有阿赖耶识，能有名色不？阿难说：没有阿赖耶识就没有名色。阿难，我因为这个缘故，知道名色是由阿赖耶识出生的，缘于阿赖耶识才有名色，我所说的就是这个意思。</p><p>这是十因缘法义，阐明名色出生的最直接因缘是阿赖耶识，六识只是出生名色的助缘，六识清净了，不再造作业行，阿赖耶识就无法出生名色，生死就了结了。阿赖耶识从入胎到出胎，在生命的每个阶段都伴随着名色，使得名色不断的增长和变异，一旦名色的缘没有了，阿赖耶识就无法再增长名色和伴随名色。</p><p>有人误认为十因缘的识是指六识，但是入胎的时候六识就消失了，六识不能入胎跟到后世去，入胎之后的很长一段时间六识都不能出生，甚至眼识只在出胎后才能出生，所以入胎住胎的不是六识，而是阿赖耶识。佛在十因缘里直接指出了名色出生的根本因就是阿赖耶识，阿赖耶识是名色的所依和源头。　 </p><p>原文：<strong>阿难。缘名色有识。此为何义。若识不住名色。则识无住处。若无住处。宁有生老病死。忧悲苦恼不。答曰。无也。阿难。若无名色。宁有识不。答曰。无也。 阿难。我以此缘。知识由名色。缘名色有识。我所说者。义在于此。</strong></p><p>释：阿难，缘于名色才有阿赖耶识，也就是阿赖耶识才能显现出来，才能见到阿赖耶识，这是什么意思？如果阿赖耶识不住在名色上，那么阿赖耶识就没有住处了。如果阿赖耶识没有住处，能有众生的生老病死忧悲苦恼吗？阿难说：阿赖耶识若无住处，就没有生老病死了。佛说：阿难，如果没有名色，能见到阿赖耶识，有阿赖耶识的显现吗？阿难说：没有名色，阿赖耶识就显现不了。佛说：阿难，我因为这个缘故，知道阿赖耶识缘于名色而有住处，缘于名色而有阿赖耶识的显现，我所说的就是这个意思。</p><p>缘名色有识的有字，不代表是出生的意思，而是显现和见到的意思，因为阿赖耶识不生不灭，不由名色所生，名色也生不了什么法，更生不了阿赖耶识。如果没有名色，阿赖耶识就无所依倚，阿赖耶识只有依靠着名色住在名色上，才能有所运作，其作用才能显现出来。佛在后边也解释说，如果阿赖耶识不住在名色上，就没有什么住处了，没有住处就没有名色，没有名色就没有生老病死了。十因缘法义甚深，不容易理解，但也应该正解。</p><p>原文：<strong>阿难。是故名色缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老死忧苦悲恼。大苦阴集。阿难。齐是为语。齐是为应。齐是为限。齐此为演说。齐是为智观。齐是为众生。阿难。诸比丘于此法中。如实正观。无漏心解脱。阿难。此比丘当名为慧解脱。</strong></p><p>释：阿难，因此说名色缘于阿赖耶识而有，阿赖耶识缘于名色才能有住处和功用。有名色就能产生六入，有六入就能产生触，有触就能产生受，有受就能产生爱，有爱就能产生取，有取就能产生三界有，有有就能有生，有生就能有老病死忧悲苦恼，纯大苦阴的聚集。阿难，这才是正语和论义，这才是最应该修习的法义，这才是最究竟的法门，这才是真正的宣演佛法，这才是有智慧的观察，这才是度众生的法宝。阿难，诸比丘在这个法中，能够如实而正确的观察，断尽烦恼漏心得解脱。阿难，这样正观的比丘名为慧解脱的阿罗汉。</p><p>慧解脱的阿罗汉其解脱的智慧胜于禅定的修行，其禅定只到于初禅，不具二禅或者四禅以上的甚深禅定，到命终时主要依靠着解脱智慧舍离三界入涅槃。解脱智慧是完全彻底证得五蕴苦空无常无我，断尽我执等一切贪嗔痴烦恼，一念无明灭尽，五蕴即灭。慧解脱不是说只有智慧而无禅定，而是说禅定不是太深，解脱不是以禅定为主，依靠禅定得解脱，而是依靠解脱的智慧而灭尽三界法。慧解脱的阿罗汉最基本要有初禅定，如果没有初禅定，就不可能断尽烦恼，心得无漏，烦恼不能断尽就不能解脱。</p><p>原文：<strong>如是解脱比丘。如来终亦知。如来不终亦知。如来终不终亦知。如来非终非不终亦知。何以故。阿难。齐是为语。齐是为应。齐是为限。齐是为演说。齐是为智观。齐是为众生。如是尽知已。无漏。心解脱。比丘不知不见。如是知见。</strong></p><p>释：像这样解脱的比丘，如来涅槃也知，如来不涅槃也知，如来涅槃不涅槃也知，如来非涅槃非不涅槃也知。为什么这样说？阿难，因为这样说才是正语，这样说才是最适宜，这样说才是最究竟，这样说才是演说法，这样说才是智慧的观察，这样说才是度众生。心解脱比丘如是尽知如来涅槃不涅槃以后，烦恼漏尽，心得解脱，其余比丘却不知不见这样的知见。</p><p>原文：<strong>阿难。夫计我者。齐几名我见。名色与受。俱计以为我。有人言受非我。我是受。或有言受非我。我非受。受法是我。或有言受非我。我非受。受法非我。但爱是我。</strong></p><p>释：阿难，计着有我的人，都有哪些叫作我见？把名色五阴和受觉全部都当作我，这就是我见；有人说受觉不是我，而我却是受；还有人说受觉不是我，我也不是受，但是能受这个法却是我；还有人说受觉不是我，我也不是受，能受所受这个法也不是我，但是爱却是我。</p><p>原文：<strong>阿难。彼见我者。言受是我。当语彼言。如来说三受。乐受苦受。不苦不乐受。当有乐受时。无有苦受。不苦不乐受。有苦受时。无有乐受。不苦不乐受。有不苦不乐受时。无有苦受乐受。</strong></p><p>释：阿难，哪些见法中有我，说受觉是我的人，应当告诉他们说：如来说受有三种，乐受、苦受和不苦不乐受，当有乐受的时候，就没有苦受和不苦不乐受，当有苦受时就没有乐受和不苦不乐受，当有不苦不乐受时就没有乐受和苦受。</p><p>计着有我的意思是说，凡夫心里总是把五蕴十八界误计为恒常、有主宰的法，这个法是指世俗法的我，不是指非世俗的第八识如来藏。因为众生无始劫以来从来都不知道有第八识，甚至都不知道有七识，也不知真假识，所以把文中的我说为是第八识，都是错误的说法，违背事理和事实。凡夫从来没有把名色五阴当作第八识，也没有把受当作第八识，不管五阴和受是不是第八识都是这样。再者说第八识没有名色，也没有受，凭何说受是第八识、受不是第八识？是与不是都违背正理。</p><p>原文：<strong>所以然者。阿难。乐触缘生乐受。若乐触灭受亦灭。阿难。苦触缘生苦受。若苦触灭受亦灭。不苦不乐触缘。生不苦不乐受。若不苦不乐触灭受亦灭。</strong></p><p>释：之所以这样说的原因是，阿难，由于乐触的缘故出生了乐受，如果乐触灭了乐受就会灭了；阿难，由于苦触的缘故产生了苦受，如果苦触灭了苦受也就随之灭了；由于不苦不乐触的缘故产生了不苦不乐受，如果不苦不乐触的缘灭了不苦不乐受也就随之灭了。</p><p>原文：<strong>阿难。如两木相攒。则有火生。各置异处。则无有火。此亦如是。因乐触缘。故生乐受。若乐触灭。受亦俱灭。因苦触缘。故生苦受。若苦触灭。受亦俱灭。因不苦不乐触缘。生不苦不乐受。若不苦不乐触灭。受亦俱灭。阿难。此三受有为无常。从因缘生。尽法灭法。为朽坏法。彼非我有。我非彼有。当以正智如实观之。</strong></p><p>释：阿难，譬如两根木头相互磨触，就会有火从中生出来，如果把两根木头分开，就不会产生火了。受也是如此，因为乐触的缘故产生了乐受，如果乐触灭了，乐受也会随之而灭了；由于苦触的缘故产生了苦受，如果苦触灭了，苦受也会随之而灭了；由于不苦不乐触的缘故产生不苦不乐受，如果不苦不乐触灭了，不苦不乐受也会随之而灭。阿难，这三种受是有为的无常法，是从因缘当中生出来的，是能灭尽的法，是能腐败、衰坏的法，因此这些法都不是我，我也不是这些法，你们应当以这样正确如实的智慧来观察。</p><p>原文：<strong>阿难。彼见我者。以受为我。彼则为非。阿难。彼见我者。言受非我。我是受者。当语彼言。如来说三受。苦受乐受。不苦不乐受。若乐受是我者。乐受灭时。则有二我。此则为过。若苦受是我者。苦受灭时。则有二我。此则为过。若不苦不乐受是我者。不苦不乐受灭时。则有二我。此则为过。</strong></p><p>释：阿难，那些认为有我的人，把受当作我，他们的见解是不对的。阿难，那些认为有我的人，说受不是我，但认为我就是受，为了救度这些人，就应当对他们说：如来说有三种受，苦受、乐受和不苦不乐受，如果乐受是我的话，当乐受灭了的时候，就会有两种我，苦受我和不苦不乐受我，当然这就不对了；如果苦受是我的话，当苦受灭了的时候，就会有两种我，乐受我和不苦不乐受我，这就不对了；如果不苦不乐受是我的话，当不苦不乐受灭了的时候，就会有两种我，苦受我和乐受我，这是错误的。</p><p>原文：<strong>阿难。彼见我者。言受非我。我是受。彼则为非。阿难。彼计我者。作此说。受非我。我非受。受法是我。当语彼言。一切无受。汝云何言有受法。汝是受法耶。对曰非是。是故阿难。彼计我者。言受非我。我非受。受法是我。彼则为非。</strong></p><p>释：阿难，那些认为有我的人，说受不是我，但我就是受，这种知见是错误的。阿难，那些计着有我的人这样说：受不是我，我也不是受，但是有受的法却是我。对于这样的人，应当对他说：一切法无受，你为什么说有受法呢？你是受法吗？那个人就会回答说：我不是受法。因此阿难，那些计着有我的人，说受不是我，我也不是受，但受法是我，他的观点是错的。</p><p>原文：<strong>阿难。彼计我者。作是言。受非我。我非受。受法非我。但爱是我者。当语彼言。一切无受。云何有爱。汝是爱耶。对曰非也。是故阿难。彼计我者。言受非我。我非受。受法非我。爱是我者。彼则为非。阿难。齐是为语。齐是为应。齐是为限。齐是为演说。齐是为智观。齐是为众生。</strong></p><p>释：阿难，那些计着有我的人这样说：受不是我，我也不是受，受法也不是我，但是爱是我。对于这样的人，应该对他们说：一切法无受，怎么能说有爱呢？你是爱吗？对方就会回答说：我不是爱。因此说，阿难，那些计着有我，说受不是我，我也不是受，受法也不是我，但爱却是我的人，他们的观点是错的。阿难，这样说才是正语，这样说才与法相对应，这样说才是最究竟，这样说才是演说正法，这样说才是智慧性的观察，这样说才是度众生。</p><p>原文：<strong>阿难。诸比丘于此法中如实正观。于无漏心解脱。阿难。此比丘当名为慧解脱。如是解脱心比丘。有我亦知。无我亦知。有我无我亦知。非有我非无我亦知。何以故。阿难。齐是为语。齐是为应。齐是为限。齐是为演说。齐是为智观。齐是为众生。如是尽知已。无漏。心解脱。比丘不知不见如是知见。</strong></p><p>释：阿难，诸比丘在这些法中能够如实的正观，就会达到无漏，心得解脱了。阿难，心无漏比丘应当叫作慧解脱阿罗汉。像这样心解脱无漏的比丘，有我法也知，无我法也知，有我无我法都知，非有我非无我法也知。为什么这样说呢？阿难，因为只有这样说才是正语，这样说才与法相应，这样说才最究竟，这样说才是演说正法，这样说才是智慧性的观察，这样说才能度众生。如是心解脱比丘对于非我法全部证知以后，烦恼漏尽，心得解脱。其余的比丘对于非我的知见却是不知不见。</p><p>原文：<strong>佛语阿难。彼计我者。齐已为定。彼计我者。或言少色是我。或言多色是我。或言少无色是我。或言多无色是我。阿难。彼言少色是我者。定少色是我。我所见是。余者为非。</strong></p><p>释：佛对阿难说：那些计度有我的人，对于我的界限早已经划定好了。那些计度有我的人，或者说少部分色是我，或者说多部分色是我，或者说少部分无色是我，或者说多部分无色是我。阿难，那些说少部分色是我的人，坚定固执的认为少部分色是我，我所见到的就是对的，其余我没见到的就是不对的。</p><p>原文：<strong>多色是我者。定多色是我。我所见是。余者为非。少无色是我者。定言少无色是我。我所见是。余者为非。多无色是我者。定多无色是我。我所见是。余者为非。</strong></p><p>释：那些说多部分色是我的人，坚定而固执的认为多部分色就是我，我所见到的就是对的，其余我没有见到的就是不对的；那些说少部分无色是我的人，坚定而固执的认为少部分无色是我才是对的，其余我没见到的就是不对的；那些说多部分无色就是我的人，坚定而固执的认为多部分无色是我是对的，其余我没见到的就是不对的。</p><p>原文：<strong>佛告阿难。七识住。二入处。诸有沙门婆罗门言。此处安隐。为救为护。为舍为灯。为明为归。为不虚妄。为不烦恼。</strong></p><p>释：佛告诉阿难说：有七种识住处和二入处，你们应当了知。诸沙门婆罗门说这七种识住处和二入处是安稳之处，是有救护之处，是房舍和明灯，是光明和归依之处，是真实不虚妄之处，是没有烦恼之处。</p><p>原文：<strong>云何为七。或有众生。若干种身。若干种想。天及人。此是初识住处。诸沙门婆罗门言。此处安隐。为救为护。为舍为灯。为明为归。为不虚妄。为不烦恼。</strong></p><p><strong>阿难。若比丘知初识住。知集知灭。知味知过。知出要。如实知者。阿难。彼比丘言。彼非我。我非彼。如实知见。</strong></p><p>释：如何是七种识住处？第一识住处是欲界人和天人中，有欲界人和天人色身的众生，身的种类不同，心想不同，诸沙门和婆罗门说人和天人住处是安稳的，是能被救护的，是可住止的房舍，是能照明的明灯，是光明，是依止处，是不虚妄真实存在之处，是没有烦恼之处。</p><p>阿难，如果比丘们知道第一识住处，了知识住处的集起和灭去，了知识住处的贪味、粘腻，了知识住处的过患，了知如何出离识住处，对于这个识住处都如实了知，比丘们就会说，识住处不是我，我不是识住处，我能如实知见此理。</p><p>原文：<strong>或有众生。若干种身而一想。梵光音天是。或有众生。一身若干种想。光音天是。或有众生一身一想。遍净天是。或有众生。住空处。或有众生。住识处。或有众生。住不用处。是为七识住处。</strong></p><p>释：第二识住处是色界初禅天的梵光音天天人中，天人的色身有若干种，却只有一种想；第三识住处是二禅天的光音天天人，天人的色身只有一种，却有好几种想；第四识住处是三禅天的遍净天天人中，天人的色身只有一种，想也只有一种；第五识住处是无色界天的空无边处天的天人中，他们没有色身，只有非常微细的想；第六识住处是识无边处天的天人中，他们同样没有色身，只有更微细的想；第七识住处是无所有处天的天人中，他们没有色身，其想就更微细难知了。这就是七种识住处。</p><p>原文：<strong>或有沙门婆罗门言。此处安隐。为救为护。为舍为灯。为明为归。为不虚妄。为不烦恼。阿难。若比丘知七识住。知集知灭。知味知过。知出要。如实知见。彼比丘言。彼非我。我非彼。如实知见。是为七识住。</strong></p><p>释：有一些沙门婆罗门说这些住处是安稳的，是有救护的，是房舍，是明灯，是光明，是可依止、可归依处，是不虚妄处，是无烦恼处。阿难，如果比丘们能了知七种识住处，了知七种识住处的集起、灭尽，了知七种识住处的贪味和过患，了知七种识住处出离的要道，对这些住处都能如实的知见，比丘们就会说，七种识住处不是我，我不是七种识住处，对这七种识住处能如实知见，就是七种识住。</p><p>七种识住处，分别为欲界人和天人，以及色界和无色界，这是指三善道众生住处，非三恶道众生住处，三善道是众生安稳之处，三恶道是众生不安稳受苦之处。七种识住处都是安稳之处，这个识是指什么识呢？如果是指阿赖耶识，是肯定没有错的，但是二乘不主要讲阿赖耶识，而主要讲六识，第七识讲的非常少。所以七种识住处主要是指六识的住处，也有第七识的住处，因为在无想天住处中没有六识，只有七八二识。</p><p>原文：<strong>云何二入处。无想入。非想非无想入是为。阿难。此二入处。或有沙门婆罗门言。此处安隐。为救为护。为舍为灯。为明为归。为不虚妄。为不烦恼。阿难。若比丘知二入处。知集知灭。知味知过。知出要。如实知见。彼比丘言。彼非我。我非彼。如实知见。是为二入。</strong></p><p>释：如何是二种入处？无想天入处和非想非非想天入处就是二种入处。阿难，这二种入处，有一些沙门婆罗门说是安稳处，是有救护处，是房舍，是明灯处，是光明处，是归依处，是不虚妄处，是无烦恼处。阿难，如果比丘们了知这二入处，了知二入处的集起和灭尽，了知二入处的贪味和过患，了知出离二入处的要道，并且如实知见二入处，比丘们就会说：二入处不是我，我不是二入处，如实知见此理，就是二入。</p><p>无想是指无想定或者是无想天处，在此定中，无意识，无意识的想，因此称为无想定。虽然在此定中无意识，却有意根，意根仍然执色蕴为我，仍然有束缚，没有断我见。只有认识到了无想定中的色身和意根非我，就叫作无想入处，超越了无想定和无想天。同理，非想非非想入处也是此理，非想非非想定和非想非非想天也不究竟，没有认识到意识的少部分功用和意根的功用非我，就不能解脱。</p><p>原文：<strong>阿难。复有八解脱。云何八。色观色。初解脱。内无色想。观外色。二解脱。净解脱。三解脱。度色想。灭有对想。不念杂想。住空处。四解脱。度空处。住识处。五解脱。度识处。住不用处。六解脱。度不用处。住有想无想处。七解脱。灭尽定。八解脱。阿难。诸比丘于此八解脱。逆顺游行。入出自在。如是比丘得俱解脱。</strong></p><p>释：阿难，又有八种解脱，如何是八种解脱？第一种解脱是，心有色想，有色贪，而观色不净，证得色不净时，心得解脱；第二种解脱是，心无有色想，观外色不净，证得色不净时，心得解脱；第三种解脱是，身心皆清净得解脱；第四种解脱是，超越色想，灭除与色相对的想，既不想色也没有其他杂想，住在空无边处定中，心得解脱；第五种解脱是，越过空无边处，住在识无边处定中，心得解脱；第六种解脱是，越过识无边处，住在无所有处定中，心得解脱；第七种解脱是超越无所有处，住在非想非非想定中，心得解脱；第八种解脱是，住在灭尽定中，心得解脱。</p><p>阿难，诸比丘对于这八种解脱，无论是按照次第顺次进入，还是逆着次第进入，入定和出定都很自在，这样的比丘八种解脱就全部证得了，名为俱解脱的阿罗汉，解脱智慧和四禅八定全部具足。</p></div>"
},{
    "title": "第二节 长阿含经卷一（十二因缘 ）",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  长阿含经卷一（十二因缘 ）</strong></p><p>原文：<strong>佛告比丘。太子见老病人。知世苦恼。又见死人。恋世情灭。及见沙门。廓然大悟。下宝车时。步步中间。转远缚着。是真出家。是真远离。</strong></p><p>释：佛告诉诸比丘们说：毗婆尸佛做太子时，出宫廷四个大门时，看见老人和病人就知道世间是苦恼的，再看见死人时贪恋世间之情就灭了，后来见到出家的沙门就廓然大悟了，及至走下宝车的时候，每走一步路，内心都在远离世间烦恼结缚。那时太子就真正的出家了，真正的远离了世间烦恼。</p><p>这就叫作善根，是无量亿劫修持的结果，这才是佛陀再来，一接触世间，就知世间苦，并且迅速远离烦恼结缚，彻悟世间真谛，心出家，随后身也出家。而善根浅的凡夫众生，无论遇到世间任何事，心都麻木不觉悟，不知世间苦空无常无我，随顺世间贪嗔痴烦恼，造作烦恼业，逐生死流。</p><p>原文：<strong>时彼国人。闻太子剃除须发。法服持钵。出家修道。咸相谓言。此道必真。乃令太子。舍国荣位。捐弃所重。于时国中。八万四千人。往就太子。求为弟子。出家修道。佛时颂曰。撰择深妙法。彼闻随出家。离于恩爱狱。无有众结缚。</strong></p><p>释：这时候国内的人民听到太子剃除须发，穿上了出家服，手持钵盂，出家修道，都互相告慰说：修道这件事一定是非常真实的，才让太子舍弃国王的荣华富贵，捐弃所负的重担。于是国中八万四千人赶往太子身边，请求作弟子出家修道。佛就说了一个颂：毗婆尸太子遇到那个甚深微妙的解脱法，听闻之后马上就出家修道，离开世间恩爱的地狱，再也没有众多的生死结缚了。</p><p>原文：<strong>于时太子。即便纳受。与之游行。在在教化。从村至村。从国至国。所至之处。无不恭敬。四事供养。菩萨念言。吾与大众。游行诸国。人间愦闹。此非我宜。何时当得。离此群众。闲静之处。以求道真。</strong></p><p>释：于是太子当时就接受了这些弟子，和他们一起游行于各处教化众生，从一个村落到一个村落，从一个国家到一个国家，所到之处，民众没有不恭敬的，都用饮食医药等四事供养。太子菩萨心念说：我与大众游行各个国家，人间如此愦闹，这不是我应该所处之地，我什么时候才能离开这些人众，到一个悠闲之处修行，以获得真正的道果。</p><p>原文：<strong>寻获志愿。于闲静处。专精修道。复作是念。众生可愍。常处闇冥。受身危脆。有生有老。有病有死。众苦所集。死此生彼。从彼生此。缘此苦阴。流转无穷。我当何时。晓了苦阴。灭生老死。</strong></p><p>释：不久之后就满了心愿，找到了一个空闲寂静之处，专门精进修道。太子菩萨心里又作这样的念想：众生可怜悯，常常处于黑暗的幽冥之处，感得的色身脆弱又危险，有生老病死众多苦恼聚集，在此处死到彼处生，又从彼处死到此处生，他们抓取着这样的苦受阴，在生死中流转无穷。我应当在什么时候才能明了苦阴，灭除生老病死。</p><p>从世尊这段叙述中可以看出，诸佛菩萨在历劫修道过程中，最先都是在无人僻静之处一个人精进专修，远离人群中的愦闹，在修出成就之后才在人群中教化，度脱众生。因为道在寂静中得，寂静能生慧，寂静能得三昧。所以凡是修行有所成就的人都是经过独自静修阶段，远离世俗的贪嗔痴和愦闹，远离名闻利养，心得清净以后才能入道。</p><p>原文：<strong>复作是念。生死何从。何缘而有。即以智慧。观察所由。从生有老死。生是老死缘。生从有起。有是生缘。有从取起。取是有缘。取从爱起。爱是取缘。爱从受起。受是爱缘。</strong></p><p>释：太子修道时心中又出现这样的念想：生死是从哪里来的？是因为什么因缘而有的？为了破除这个疑惑，就用智慧观察生死的来由，最后证得：老死是从生而来，生是老死出生的因缘；而生是从三界有而来，有是生这种现象出生的因缘；有是从执取而生起来的，执取是有出生的因缘；取是从爱而来，爱是取出生的因缘；爱从受而来，受是爱出生的因缘。</p><p>原文：<strong>受从触起。触是受缘。触从六入起。六入是触缘。六入从名色起。名色是六入缘。名色从识起。识是名色缘。识从行起。行是识缘。行从痴起。痴是行缘。</strong></p><p>释：受从触而来，触是受出生的因缘；触从六入而来，六入是触出生的因缘；六入是从名色上生起来的，名色是六入出生的因缘；名色从六识而来，六识是名色出生的因缘。六识从意根的行而来，行是六识出生的因缘；行从意根的无明而来，无明是行出生的因缘。</p><p>原文：<strong>是为缘痴有行。缘行有识。缘识有名色。缘名色有六入。缘六入有触。缘触有受。缘受有爱。缘爱有取。缘取有有。缘有有生。缘生有老病死、忧悲苦恼。此苦盛阴。缘生而有。是为苦集。菩萨思惟。苦集阴时。生智生眼。生觉生明。生通生慧生证。</strong></p><p>释：这就是所说的因为愚痴才有行，因为有行才有六识业种，因为有六识业种才有后世的名色，因为有名色才有六入，因为有六入才有触，因为有触才有受，因为有受才有爱，因为有爱才有取，因为有取才有有，因为有有才有生，因为有生才有老病死忧悲苦恼。这个苦盛阴是因为有生的缘故才会出现的，这就是苦集。太子菩萨思惟苦阴的集时，出生了缘生智，出生了清净法眼，出生了觉悟，出生了明达，出生了通明，出生了智慧，出生了明证。</p><p>原文：<strong>于时菩萨。复自思惟。何等无故老死无。何等灭故老死灭。即以智慧。观察所由。生无故老死无。生灭故老死灭。有无故生无。有灭故生灭。取无故有无。取灭故有灭。爱无故取无。爱灭故取灭。受无故爱无。受灭故爱灭。触无故受无。触灭故受灭。六入无故触无。六入灭故触灭。</strong></p><p>释：这时菩萨又独自思惟，是什么法没有了老死就消失了，是什么法灭了老死就灭了，为了弄清这个问题，太子菩萨就以智慧来观察老死灭的缘由，最后证得：是生没有了老死就没有了，是生灭了老死就灭了；三界的有没有了老死就没有了，有灭了老死就灭了；取没有了有就没有了，取灭了老死就灭了；爱没有了取就没有了，爱灭了取就灭了；受没有了爱就没有了，受灭了爱就灭了；触没有了受就没有了，触灭了受就灭了；六入没有了触就没有了，六入灭了触就灭了；</p><p>原文：<strong>名色无故六入无。名色灭故六入灭。识无故名色无。识灭故名色灭。行无故识无。行灭故识灭。痴无故行无。痴灭故行灭。是为痴灭故行灭。行灭故识灭。识灭故名色灭。名色灭故六入灭。六入灭故触灭。触灭故受灭。受灭故爱灭。爱灭故取灭。取灭故有灭。有灭故生灭。生灭故老死。忧悲苦恼灭。菩萨思惟。苦阴灭时。生智生眼。生觉生明。生通生慧生证。</strong></p><p>释：名色没有了六入就没有了，名色灭了六入就灭了；六识业种没有了名色就没有了，六识业种灭了名色就灭了。身口意行没有了，六识业种就没有了，身口意行灭了，六识业种就灭了；无明没有了身口意行就没有了，无明灭了，身口意行就灭了。因此就说：无明灭故行灭，行灭故六识灭，六识灭故名色灭，名色灭故六入灭，六入灭故触灭，触灭故受灭，受灭故爱灭，爱灭故取灭，取灭故有灭，有灭故生灭，生灭故老死忧悲苦恼灭。太子菩萨思惟苦阴灭的时候，就生起了因缘智，生起了法眼，生起了觉悟，生起了明达，生起了通明，生起了智慧，生起了明证。</p><p>原文：<strong>尔时菩萨。逆顺观十二因缘。如实知。如实见已。即于座上。成阿耨多罗三藐三菩提。佛时颂曰。此言众中说。汝等当善听。</strong></p><p>释：这时太子菩萨分别顺着十二因缘观行，和逆着十二因缘观行以后，如实证知了十二因缘法，就生起了如实正见正智，如实见证十二因缘法以后，就在法座上成就了阿耨多罗三藐三菩提。佛这时候就说了一个偈颂：我在大众中讲的这些法，你们应当善于听闻。</p><p>原文：<strong>过去菩萨观。本所未闻法。老死从何缘。因何等而有。如是正观已。知其本由生。生本由何缘。因何事而有。如是思惟已。知生从有起。取彼取彼已。展转更增有。是故如来说。取是有因缘。</strong></p><p>释：过去的时候，菩萨观行从来没有听过的十二因缘法，老死是由于什么因缘生起的，是因为什么因缘而有的？像这样正观以后，知道老死本来是由于生而现起的；生原本是由于什么因缘而现起的，是因为什么缘故而有的？像这样思惟以后，就证得生是从三界有而生起的。取着诸法以后，辗转更坚固了有，因此如来说取是三界有的因缘。</p><p>原文：<strong>如众秽恶聚。风吹恶流演。如是取相因。因爱而广普。爱由于受生。起苦罗网本。以染着因缘。苦乐共相应。受本由何缘。因何而有受。以是思惟已。知受由触生。触本由何缘。因何而有触。如是思惟已。触由六入生。</strong></p><p>释：如众多污秽肮脏物聚在一起，风吹起来恶秽物就流散开来，取着诸法相的因缘也是这样，由于贪爱而广泛的流布开；贪爱是由于受的因缘而出生，受是生起苦恼罗网的根本；因为贪染诸法的因缘，生起苦乐受与染污相应，受原本是由于什么因缘生起来的，是什么因缘而有的受？菩萨就思惟这个因缘，然后就证知了受是由于触的因缘生起来的；触原本是由于什么因缘生出来的，是什么因缘而有的触？这样思惟以后，就证知了触是由于六入的因缘生出来的。</p><p>原文：<strong>六入本何缘。因何有六入。如是思惟已。六入名色生。名色本何缘。因何有名色。如是思惟已。名色从识生。识本由何缘。因何而有识。如是思惟已。知识从行生。行本由何缘。因何而有行。如是思惟已。知行从痴生。</strong></p><p>释：六入原本是由于什么因缘生起来的，是因为什么因缘而有的六入？这样思惟以后，证知了六入是由于名色的因缘生起来的；名色原本是由于什么因缘而生起来的，是因为什么缘故而有的名色？这样思惟以后，就证得了名色是因为六识业种的因缘而出生的；六识业种原本是由于什么因缘而生起来的，是因为什么而有的六识业种？这样思惟以后，就证知了六识业种是从身口意行的因缘而生起来的；身口意行原本是由于什么因缘而生起来的，是因为什么因缘才有了行？这样思惟以后，就证知行是从愚痴的因缘而出生的。</p><p>原文：<strong>如是因缘者。名为实义因。智慧方便观。能见因缘根。苦非贤圣造。亦非无缘有。是故变易苦。智者所断除。若无明灭尽。是时则无行。若无有行者。则亦无有识。若识永灭者。亦无有名色。名色既已灭。即无有诸入。若诸入永灭。则亦无有触。若触永灭者。则亦无有受。</strong></p><p>释：像以上这些因缘法，叫作真实义理的因缘法。如果用智慧方便去观察，就能见到因缘法的根本，就是无明愚痴。生老病死苦不是圣贤人造作出来的，也不是无缘无故而有的，因此智者才会断除生灭变异的生老病死苦。如果无明灭尽以后，行就没有了；如果没有了行，也就没有了六识业种；如果六识业种永远灭尽了，也就不会再有名色了；既然名色灭尽了，就不会再有六入了；如果六入永远灭尽了，也就不会再有触了；如果触永远灭尽了，也就不会再有受了。</p><p>原文：<strong>若受永灭者。则亦无有爱。若爱永灭者。则亦无有取。若取永灭者。则亦无有有。若有永灭者。则亦无有生。若生永灭者。无老病苦阴。一切都永尽。智者之所说。十二缘甚深。难见难识知。唯佛能善觉。因是有是无。</strong></p><p>释：如果受永远灭尽了，也就不会再有爱了；如果爱因缘灭尽了，也就不会再有取了；如果取永远灭尽了，就不会再有三界有了；如果有永远灭尽了，就不会再有生了；如果生永远灭尽了，就不会再有老和病的苦阴了。一切世间法都会从此永远灭尽，这是智者所说的。十二因缘法甚深，难于遇见，也难于认识和证知，只有佛才能善于觉悟一切法生起的因是有还是没有。</p><p>原文：<strong>若能自观察。则无有诸入。深见因缘者。更不外求师。能于阴界入。离欲无染者。堪受一切施。净报施者恩。若得四辩才。获得决定证。能解众结缚。断除无放逸。色受想行识。犹如朽故车。能谛观此法。则成等正觉。如鸟游虚空。东西随风游。菩萨断众结。如风靡轻衣。</strong></p><p>释：如果能亲自现前观察十二因缘法，就知道根本就没有六入这些法，能深入的谛察因缘法的人，再也不会向外寻觅师父，法就是师父，依法修行就能得解脱。能在五阴十八界六入之上离开贪欲无有染污的人，才能有资格接受一切布施，清净的回报布施者的恩德。如果能获得四种无碍的辩才，就能对因缘法有最终决定的证明，也能解开一切烦恼结缚，断除一切烦恼，精进修行再也不会放逸了。色受想行识五阴犹如腐朽坏败的旧车，能够谛观到此法的人，就能成就等正觉，然后就会犹如自由的鸟儿一样遨游于虚空，或东或西随风而游。菩萨断除一切结缚，如风吹轻薄的衣摆。</p><p>原文：<strong>毗婆尸闲静。观察于诸法。老死何缘有。从何而得灭。彼作是观已。生清净智慧。知老死由生。生灭老死灭。</strong></p><p>释：毗婆尸佛在闲静处对十二因缘法仔细观察，思惟老死因为什么缘故而有，因为什么缘故而得灭除，作了这样的观行以后，就生出了清净的智慧，知道老死是由于生才有的，生灭了老死就灭了。</p></div>"
},{
    "title": "第四章 阿含口解十二因缘经",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  阿含口解十二因缘经</strong></p><p>原文：<strong>欲断生死趣。度世道者。当念却十二因缘。何等为十二。一者本为痴。二者从痴为所作行。三者从作行为所识。四者从所识为名色。五者从名色为六衰。六者从六衰为所更。七者从所更为痛。八者从痛为爱。九者从爱为求。十者从求为得。十一者从得为生。十二者从生为老病死。是为十二因缘事。</strong></p><p>释：如果想要断除生死道，超越世间六道轮回，应当念着十二因缘。什么是十二因缘？一者，生死轮回的根本是愚痴无明；二者从意根的愚痴无明引生出造作的行；三者从身口意行引生出六识业种；四者从六识业种引生出名色；五者从名色引生出六入；六者从六入引生出触；七者从触引生出受；八者从受引生出爱；九者从爱引生出求取；九者从求取引生出有；十者从有引生出生；十一者从生引生出老病死，以上说的就是十二因缘法。</p><p>原文：<strong>此十二事欲起。当用四非常灭之。何等为四非常。一为识苦。二为舍习。三为知尽。四为行道。更说念生念老念病念死。念是四事。便却是十二因缘道成。念是四事道人。欲得度世。当断十二因缘事。是为断生死根。</strong></p><p>释：这十二因缘如果要生起来时，应当用四个非常法灭除它。什么是四个非常法？一是要知苦认识苦；二是要断集，舍去习气；三是要慕灭，了知灭尽苦之道法；四是要修行八正道。另外再经常念着生老病死之四事，十二因缘就能修成就了。念着生老病死的修道人，想要超越世间，应当断除十二因缘的生死事业，这样就会断尽生死之根。</p><p>原文：<strong>十二因缘有内外。一者内为痴。外为地。二者内为行。外为水。三者内为识。外为火。四者内为名色。外为风。五者内为六入。外为空。六者内为灾。外为种。七者内为痛。外为根。八者内为爱。外为茎。九者内为受。外为叶。十者内为有。外为节。十一者内为生。外为华。十二者内为老死。外为实。人生死从内十二因缘。万物生死从外十二因缘。</strong></p><p>释：十二因缘分为内法和外法，一者内法是愚痴无明，外法是地大；二者内法是行，外法就是水大；三者内法是六识，外法是火大；四者内法是名色，外法是风大；五者内法是六入，外法是空；六者内法是灾难，外法是业种；七者内法是受，外法是根；八者内法是爱，外法是植物的茎；九者内法是取，外法是枝叶；十者内法是有，外法是结节；十一者内法是生，外法是花；十二者内法是老死，外法是果实。人的生死是从内十二因缘而来，万物的生灭是从外十二因缘而来。</p><p>内十二因缘是心法，外十二因缘是色法。内法是指与识心联系非常紧密的，是识心直接具有的十二因缘法。外法是地、水、火、风、空、种子、根、茎、叶、节、花、果实，分别与十二因缘内法相对应，与识心的关系比较疏远，不是识心本具的法，主要由阿赖耶识来执持的法。</p><p>原文：<strong>何等为痴。谓不礼父母。不分别白黑。从是因缘得痛。不欲弃。不信今世亦后世。已作是事。便随行不作。是亦不得。是以有痴便为行。已有行便为识。已有识便为名色。已有名色便为六入。已有六入便为栽。已有栽便为痛。已有痛便为爱。已有爱便为受。已有受便为有。已有有便为生。已有生便为老死。</strong></p><p>释：什么叫作愚痴？愚痴就是不礼敬父母，分不清黑白是非，从愚痴因缘生起执取，又不能弃舍所执的法。不信今世因有后世果，已经开始作的善事，因为愚痴就不想作了，所以就不得善果。因此说有愚痴就有心行，有心行就会出生六识，有六识便会有未来的名色，有名色就会有六入，有六入就会有触，有触就会有受，有受就会有爱，有爱就会有执取，有执取就会有后世的有，有有就会有生，有生就会有老死。</p><p>原文：<strong>故人生取十二因缘。得十二因缘生。无因缘亦不生。万物亦尔。不断十二因缘。不脱生死。行三十七品经。为从是得道。十二因缘有五事。一者痴。二者生死精行。是前世因缘。三者识。从识受身生。四者名色。色身复成五阴。是今世因缘。五者六衰。复作生死精行种栽。是后世因缘。前后三世转相因缘故。为有五事。</strong></p><p>释：所以人出生以后就取着十二因缘，有十二因缘法人才能出生，如果没有因缘不仅人不出生，万物也不出生。如果不断除十二因缘就不能脱离生死轮回，修行三十七道品就是为了证得道果，脱离生死。十二因缘分成五个种类，一种是愚痴，二种是行于生死的心行，这二者是前世的因缘，能让后世不断出生，故有今世的五阴生死；三种是六识，从六识的业行种子中就会有色身出生；四种是名色，让色身扩展出五阴的功能作用，这是今世五阴身存在的因缘。五种是六入，能精勤造作业行的种子，是后世色身出生的因缘。十二因缘是前后三世流转的生死因缘，粗略概括为这五个种类。</p><p>原文：<strong>十二因缘本从身十事。出身十事。七事从一。三事从四。七事从一者。杀盗淫。两舌恶口。妄言绮语。共从色为一。三事从四者。嫉嗔恚痴。从痛痒思想生死识。是十事合为五阴。便为十二因缘。地名痴。行为盛阴。便作生死行。自种栽名为行。已有行便有识。受身生死。有识便有名色。</strong></p><p>释：十二因缘本来是五阴身上表现出来的十种现象，这十种现象中，有七种现象是从色身色法上表现出来的，有三种现象是从受想行识四种心法上表现出来的，名色构成五阴，名色上的十种现象构成五阴。七种现象是杀、盗、淫、两舌、恶口、绮语，这七种事都是从色身上表现出来的；三种现象是嫉妒、嗔恚、愚痴，是从受想行识四法上表现出来的，十种现象合为五阴，就是十二因缘。愚痴比喻为地为根本，意根的行就产生五盛阴，五盛阴在愚痴中行，五盛阴的业种在无明愚痴地中现行出来，意行就出现了；意行产生之后就有六识承受五阴身的生死，有六识就有名色的出生。</p><p>原文：<strong>身复作十事。成已五阴。已有名色便有六入。复作盛阴。行种栽后当复受转相。因缘生死故名为因缘。身十事为十二因缘者。嫉为痴。嗔恚为生死。精疑为识。杀为名色。盗为六衰。淫为更。两舌为痛。妄言为爱。恶口为成。绮语为愿。生有无故。为有十二因缘。</strong></p><p>释：色身再作十种事，有以上十种现象，成为五阴身，名色出现之后就有六入。色身再运行五阴的身口意活动，种下种子后又有后世五阴身的运转不断，由此成为生死的因缘，所以叫作因缘法。色身所作的十种事业也就是十二因缘，其中嫉妒就是愚痴，嗔恚就是生死，心疑就是六识，杀的业行就是名色，盗的业行就是六入，淫欲的业行就是触，两舌的业行就是受，妄语的业行就是爱，恶口的业行就成就了五盛阴，绮语的业行就是愿行，这样就能有未来世的有，生命的有无就代表着十二因缘。</p><p>原文：<strong>何以故。淫为痴。嗔恚为生死。精疑为识。内三事为本。已有三事。便有七事。成五盛阴。嫉为五阴本故为疑。五阴行可意善。不可意嗔。便作生死精十事。外从身内意故。疑谓不分别白黑。不识生死故为识。道人欲断十二因缘。当先断身十事。便为痴。从痴五阴灭。</strong></p><p>释：为什么这样说呢？淫欲是为愚痴，嗔恚是为生死，心疑是为六识，这内在的三种事是五阴的根本，有了根本，就会有七种事，杀盗淫妄两舌绮语恶口，成就了五盛阴业行。嫉妒是五阴行的根本，所以属于心疑范畴，如果是满意的五阴身行就善，不满意的心就起嗔，这样就造作了生死的十种业行。外法从色身上显现出来，体现的是内心的心意，心疑就表示内心分别不出黑白是非，不能识别生死的就是六识心。修道的人如果想要断除十二因缘，应当要先断除五阴身上的十种事业，这样就断除了愚痴，愚痴无明一断，五阴身就会灭尽了。</p><p>原文：<strong>十二因缘亦灭断。身十事者。外从身内从意故。言身意持。谓不杀。亦谓外从口。内从嫉断者。谓万物一切意不起。便嗔恚止。嗔恚止便杀止。杀止便贪欲止。贪欲止便泣止。外口者谓声。止声者。两舌恶口妄言绮语亦止，无有疑便入道。是为还五阴断十二因缘本。</strong></p><p>释：修行十二因缘法作十种事业，也能把五阴身灭尽断除。因为外法色声香味触法是依从于色身显现出来的，内法随从于心意而有，所以说色身是由心意而保持摄持的。比如说不杀业，也可以说是在外从口而显，在内从意断除嫉妒而生，在万事万物上，只要意不生起，嗔恚就灭止了；嗔恚灭了，杀业就灭而不生了；杀业灭止了，贪欲就会灭止；贪欲灭止了，痛苦涕泣就止住了。外法从口造作出来的就是声音，把声音止住了，两舌恶口妄语绮语也就灭止了，内心无有疑惑就入道了。这就是十种事业归于五阴，从而断除十二因缘的根本。</p><p>原文：<strong>人受身有三别。第一。五阴盛阴。第二。十八种。第三。十二因缘行。是三事得身三别。第一五阴盛阴者。五阴从身十事出。从眼为色阴。从耳为痛痒阴。从鼻为思想阴。从口为生死阴。从意为识阴。心主念对是六事为根本。是为五阴地。</strong></p><p><strong>释：人受生得人身有三种差别，第一种是五</strong>阴盛阴上的差别，第二种是十八界上的差别，第三种是十二因缘行上的差别，这三种差别事就导致了所得色身有三种差别。第一种五阴盛阴者，是指五阴身从色身上能造作十种事业，在眼根上造作的是色阴，在耳根上造作的是受阴，在鼻根上造作的是想阴，在口上造作的是生死行阴，在意根上造作的是识阴。识心主导着念想，对应色声香味触法六种事业，这是一切法的根本，以上为五阴地。</p><p>原文：<strong>第二。十八入十九根。十八种者。五阴行为盛阴。有对有入为十二入本。六情为十八间。有识故为十九根。言十八种者。识不生故。为十八种。是说盛阴行。生十八种十九根。</strong></p><p>释：第二种，十八类法归入十九根中，十八种法是五阴身的运行，也叫作盛阴，六根对六尘是十二入的根本，加六识心总共是十八界，加上意根，所以又叫作十九根。所说的十八种法，不包括第七识是十八种，五盛阴运行过程中，就有十八种法，和意根第十九个法共同参与合作。</p><p>原文：<strong>第三。十二因缘者。谓五阴五盛阴行。求十二因缘便有身。是同身十事。俱分别之耳。从色得身。从四阴得名字。从名色得爱受。从受行痴。行痴便成十二因缘。道当为断。</strong></p><p>释：第三种，十二因缘法是指五阴炽盛的运行，追求着十二因缘，于是便有了五阴身。五阴身身上有十种造作事，具体分类来说，从色阴上得色身，从受想行识四阴上得名字。在名色上能体现出爱和受，从受上能体现出意行的愚痴，意行的愚痴就成就了十二因缘法，通过修道才能断除十二因缘法。</p><p>原文：<strong>色不为身。但名字为身。虽有眼耳鼻舌身意。亦复非身。何以故。设耳是人。当能听一切。从形得名字。譬金字。譬如以金作物。因从是得字。</strong></p><p>释：色身不是众生身，受想行识四阴名字才是众生身，色身上虽然有眼耳鼻舌身，也不是身。为什么这么说？假如说耳根是人身的话，应当能听见一切法，可实际上耳根只能听声音一个法，其他法就不能听不能了别了。一切法从形相上取得名字，譬如金字，譬如用黄金打造金物，是因为从金的形相上取得名字，金戒指金手镯等等。</p><p>色身如果有七个识，才能有功能作用，有功能作用并且是完整的功能作用才是五阴身，如果没有七个识，犹如土木无情物。</p><p>原文：<strong>地水火风空。是五事作身。亦复非身。何以故。身知细滑故。人已死地不知细滑故。知地水火风空非身。身亦空意亦空。俱空无所有。亦无痛痒。何以故。人已死亦不复觉痛痒。如是为空。意已离身。亦无痛痒。但因缘共合故。还归无有。</strong></p><p>释：地水火风空五大种子构成了色身，但这也不是身，为什么这样说呢？因为身能了别细滑触，人死以后仍然有地水火风空，但却不知细滑触了，所以就应该知道地水火风空构成的色身不是身。其实身是空的，意根也是空的，五阴全部是空的，空得一无所有，也没有受觉。为什么这么说呢？因为人死以后也不再有受觉了，所以才说一切都是空的，意根离开身体以后，也没有受觉了。五阴身只是因缘和合而有罢了，因缘离散，最后还是归于无有，成为空无。</p><p>原文：<strong>身中有十二风。上气风下气风。眼风耳风鼻风。背风胁风脐风。臂风足风。曲风刀风。刀风至病人。杀生刀风。刀风断截人命。生老病死。生者谓初堕母腹中时为生。已生便老。止者谓意中止。用止故败气息出入。见了身本。</strong></p><p>释：众生身中有十二种风，有上行气的风和下行气的风，眼根有风、耳根有风、鼻根有风、后背有风、肋胁有风、肚脐有风、手臂有风、脚有风、隐蔽处有风，加之刀风。刀风能伤人让人生病，刀风杀生，能截断人的性命。人有生老病死，生就是刚从母腹中堕落的时候叫作生，生了以后就会渐渐老去，生命的终止就是死，终止时是意根在色身上的终止，因为意根在色身上的作用终止的缘故，败坏的气息就出现了，这时就知道了身的本来。</p><p>原文：<strong>合十事为败。身中五事。一者地。二者水。三者火。四者风。五者空。坚者为地。软者为水。热者为火。气者为风。饭食得出入为空。亦余因缘合为人。自计是我身。若欲万物当挍计有身。亦有五因缘共合。一者色。二者痛痒。三者思想。四者生死。五者识。是十事共合。便见生死。</strong></p><p>释：十种事合起来就能败坏色身，色身中的五事：一是地，二是水，三是火，四是风，五是空。坚硬者为地，柔软者为水，热者为火，气息为风，饮食能出入处为空。也有其他因缘和合成为人，自己计着五和合为我之身。如果想要把万物都囊括为身，再把另外五个因缘法和合在一起：一是色阴，二是受阴，三是想阴，四是行阴，五是识阴。这十个因缘和合在一起，生死法就显现出来了。</p></div>"
},{
    "title": "第五章 阴持入经上卷",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  阴持入经上卷</strong></p><p>原文：<strong>何等为十二种。从求如求等生。从痴因缘令有行。从行令有识。从识令有名字。从名字令有六入。从六入令有致。从致令有痛痒。从痛痒令有爱。从爱令有受。从受令后有。从有令有生。从生令有老死忧悲苦。不可心致恼。如是具足苦种。为致习。</strong></p><p>释：什么是十二种因缘法？十二因缘法是从对世间法的一系列求取中产生出来的。从意根的愚痴因缘出生身口意行，从身口意行因缘出生六识业种，从六识业种的因缘出生名色，从名色因缘出生六入，从六入因缘出生触，从触因缘出生受，从受因缘出生爱，从爱因缘出生取，从取因缘出生有，从有因缘出生生，从生因缘出生老病死忧悲苦恼，一切不可心之事导致内心苦恼不断。这样就具足了生死苦的业种，都是触的习气所造成的。</p><p>原文：<strong>痴已尽便行尽。已行尽便识尽。已识尽便名字尽。已名字尽便六入尽。已六入尽便致尽。已致尽便痛痒尽。已痛痒尽便爱尽。已爱尽便受尽。已受尽便有尽。已有尽便生尽。已生尽便老死尽。已老死尽。忧悲苦不可心恼便尽。如是具足苦种便得尽。</strong></p><p>释：如果意根的愚痴断尽以后，行就会断尽；行断尽以后六识业种就会断尽；六识业种断尽以后，名色就会灭尽；名色灭尽以后，六入就会灭尽；六入灭尽以后触就会灭尽；触灭尽以后受就会灭尽；受灭尽以后爱就会灭尽；爱灭尽以后取就会灭尽；取灭尽以后有就会灭尽；有灭尽以后生就会灭尽，生灭尽以后老病死忧悲苦恼就会灭尽，这样众生所具足的生死苦种子就灭尽了。</p><p>原文：<strong>彼痴名为不知四谛如有。不解不见。不相应不受。不解不解根。是名为痴。彼痴因缘行为何等。为六望受。何等为六。色声香味触法。是为身六望受。是名为行。</strong></p><p>释：那个愚痴是什么意思？愚痴就是不知道世间有四圣谛理存在，不能如实的解四圣谛教理，也不见世间的四圣谛理，与出世间解脱道不相应，也不能接受四圣谛真实的教理，不懂得出离，不懂得自他根基利钝，所以叫作愚痴。</p><p>由于愚痴的因缘产生的行是指什么？是对于六尘的六种受纳。六是指什么？是指色声香味触法六尘，这叫作色身六个向往的受，就是所说的意根的行，换句话说，就是意根向往着对色声香味触法的领纳和领受，叫作色身六个希望和趣向，也叫作身口意行。</p><p>原文：<strong>彼行因缘识为六身识。眼耳鼻舌身心。是名为六身识。彼识因缘名字。字为色。名为四不色阴。痛想行识是为名。色为四大本。谓地水火风是。上为名。是四为色。是二相连共为名字。</strong></p><p>释：由于身口意行的因缘产生了六识种子，有眼识耳识鼻识舌识身识意识，叫作六识身。如果没有身口意行，就不会留下六识的业种。六识业种的因缘产生了后世的名字，字就是色阴，名就是受想行识四个非色阴，受想行识叫作名。色身以地水火风四大种子为根本。上边四阴是名，四大是色，名和色二者连起来就是名色五阴。</p><p>原文：<strong>彼名字因缘。身六入受。眼耳鼻舌身心。是名身六入受。彼六入因缘。身六思望。眼耳鼻舌身心。是名为身六思望。彼思望因缘身六痛。眼耳鼻舌身心。是名为身六痛。彼痛因缘六身爱。色爱声爱香爱。味爱触爱法爱。是名为六身爱。彼爱因缘受为四受。一欲受。二见结受。三戒愿受。四身结行受。是名为四受。</strong></p><p>释：由于名色因缘，产生了色身上的六入，眼入耳入鼻入舌入身入意入，叫作身六入受；由于六入因缘产生的触，眼触耳触鼻触舌触身触意触，叫作色身上的六个思念向往；由于六触因缘产生的六受，眼识受耳识受鼻识受舌识受身识受意识受，叫作身六受；由于受因缘产生的六爱，色爱声爱香爱味爱触爱法爱，叫作六身爱；由于爱的因缘产生的取有四种：欲取、见取、禁戒取、我语取，名为四取。</p><p>为什么五阴身上有六入受呢？因为色身上有六入，是为触尘而用，触尘之后必然有受，所以有六入就会有受，叫作六入受。</p><p>为什么六根触六尘的触叫作六思望呢？因为这个触是由意根抉择的，意根有此抉择是有想法、有希望、有欲望、有向往的，否则就不会抉择触六尘，没有触也就没有后续的受想行了。触是很关键的一步，触的目的就是要了别辨别，就是要有所造作，就是要有所知。这说明意根是不寂静的，是有攀缘的，是想让法相续进行下去的。意根有这些思想活动所以才决定触，于是六根就触了六尘，这正是意根作主识的体现。</p><p>根尘相触生识，六识出生之后就会对六尘有所了别和辨别，之后就知了六尘的细微法。六识知了六尘，意根就随之知了六尘的细微处，目的就会逐渐实现。从触这个环节上，就可以看得出来一个人是否有修行，是否心静，是内敛还是外缘的，是有所求还是无所求的，是否是寂止有禅定的。触之后会生出很多是非，不触就无是非，心就寂静，对于六尘境就是解脱的，反之就有束缚。</p><p>原文：<strong>彼受因缘有。为三有。一欲界二色界。三无色界。是名为三有。彼有因缘生。为上五阴。六持六入。己有如有生。聚已住堕致分别根。已入得有。是名为生死。为何等名。为人人所在。在所住已。住坏已过。死时是命六根已闭塞是为死。上本为老。后要为死。是故名为老死。</strong></p><p>释：由于取的因缘产生的有，是三界的有：欲界有、色界有和无色界有，这叫作三有。由于有的因缘产生的生命体，就是上边所说的五阴六根六尘六识。有了三界的有，又有了生命体，生命体集起之后六根具足，就堕入了三有中，这叫作生死。为什么叫作生死？生死是人人都有的，五阴身生灭变异的过程就叫作生死，出生以后生命存留之际叫作住，住后毁坏叫作老，生命已经谢灭，六根闭塞不能起用了叫作死，先有老，后有死，叫作老死。</p><p>原文：<strong>痴相为何等。为冥中见冥。如有不解。令从是致堕行相处。行相为何等。为令后复有。是为行相。上从是发起。令从是致堕识处。识相为何等。为识物识事是为识相。令从是致堕名字处。</strong></p><p>释：愚痴是什么相貌？是由于内心顽冥，所见都是黑暗不明，如果对于法有不如实解，就会堕落到法的行相当中；行是什么相貌？为了能引发后续的遵从就是行的相貌，那么行就好像是一个命令和指令，是主宰主导抉择义。前有指令从行处发起，后为遵从指令从行处落到六识之处，使得六识生起以遵从行的指令。</p><p>六识是什么相貌？六识是为了识别物、识别事理，这就是六识的相貌，从六识身口意行，会堕落到后世的名色之处。是谁堕落到后世的名色之处？是意根和阿赖耶识，然后就出生了名色五阴身。</p><p>原文：<strong>名字相为何等。为俱猗。是为名字相。令从是致堕六入处。六入相为何等。为分别根是为六入相。令从是致堕思望处。思望相为何等。为相会更生。是为思望相。令从是致堕痛处。痛相为何等。为更觉是为痛相。令从是致堕爱处。爱相为何等。为发生是为爱相。令从是致堕受处。</strong></p><p>释：名色是什么相貌？名色是一切法的所依，没有名色，一切法就都没有了。有了名色，就会导致六入处的产生；六入是什么相貌？为了分别六尘而存在的根，就是六入的相貌，从六入处能堕入到触中；触是什么相貌？为了与尘接触而出生的法就是触，从触能堕入到受觉之中；受是什么相貌？为了引起觉是受的相貌，从受能堕入到爱处；爱是什么相貌？为了引发利养供奉是爱的相貌，从爱堕入取处。</p><p>原文：<strong>受相为何等。为受持是为受相。令从是致堕有处。有相为何等。令堕若干处。是为有相。令从是致堕生处。生相为何等。为已有五阴是为生相。令从是致堕老处。老相为何等。为转熟是为老相。令从是致堕死处。死相为何等。为命根尽。是为死相。令从是致堕苦处。</strong></p><p>释：取是什么相貌？为了占有持有保有，是取的相貌，从取能堕入三界有中；有是什么相貌？能令五阴堕入三界中任意一处，是有的相貌，从有能堕入生处；生是什么相貌？已经有了五阴身就是生的相貌。从生能堕入老处；老是什么相貌？色身成熟是老的相貌，从老能堕入死处；死是什么相貌？生命终了，诸根无用是死的相貌，从死能堕入苦恼之处。</p><p>原文：<strong>苦相为何等。为身急是为苦相。令从是致堕不可处。不可相为何等。为心意急。是为不可相。令干从是致堕悒悒忧。悒悒相为何等。为忧五阴。令从是致堕愁恼处。悲愁相为何等。口出声言。令致悲恼懑。懑为恼。恼亦为懑。</strong></p><p>释：苦是什么相貌？身体急迫是苦的相貌，能让五阴堕入不可意处；不可意是什么相貌?心意急促是不可意的相貌，能让五阴堕入忧戚之处；忧戚是什么相貌？忧愁五阴是忧戚相貌，能让五阴堕入愁恼处；愁恼是什么相貌？口里发出怨艾、叹息、愤懑的声音，能堕入悲愤、恼怒、愤懑，懑是恼怒，恼怒也是懑。由死所引生的一系列苦衰相，心境低落，情绪苦闷愁苦，情绪越来越低劣衰坏。</p></div>"
},{
    "title": "第六章 中阿含大缘经（节选）",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  中阿含大缘经（节选）</strong></p><p>原文：<strong>阿难。要如何观察我耶。阿难。对于受。或以受是我之我。或以受实非我之我。不得感受者。即是我之我。阿难。如是观察我。或以受实非我之我。又不得感受者。亦非我之我。我应依我之领纳。即受之法。始是我之我。阿难。如是观察我。</strong></p><p>释：佛说：阿难，应该如何观察我呢？阿难，对于受的观察分为三种，一种是，有的人认为受是五阴我当中的我；另一种是，有的人却认为受确实不是五阴我当中的我，那个没有任何感受的，才是所说的五阴我当中的我，阿难，有些人就是像这样来观察我的；第三种是，有的人认为受确实不是五阴我当中的我，并且没有任何感受的那个，也不是五阴我当中的我，我应该依靠着我的领纳功能作用，也就是说受法才是所说的五阴我当中的我。阿难，有些人是这样来观察我的。</p><p>这段节选内容是从受是我或非我的角度来讲十二因缘法，佛一开始就讲了三种人的三种观察法，和得出的三种结论，结果都是不对的。下边佛就会辩证如何是不对的，佛举出的论据充分，无可辩驳。</p><p>原文：<strong>阿难。此中对于言受是我之我者。不得不如是言。友。此受有三。是乐受苦受。不苦不乐受。此等三受之中。汝见何为我耶。阿难。若于某时。领纳乐受。其同时不领纳苦受。又不领纳不苦不乐受。其时应唯领纳乐受。</strong></p><p>释：阿难，对于那些说受是五阴我当中的我的第一种人，不得不这样说：善友，这个受有乐受、苦受和不苦不乐受三种，在这三种受中，你把哪种受当作我呢？阿难，如果在某个时候领纳着乐受，就不会同时领纳苦受，也不会同时领纳不苦不乐受，在这个时候只能领纳乐受。</p><p>原文：<strong>阿难。若又于某时。领纳苦受。其同时不领纳乐受。又不领纳不苦不乐受。其时应唯领纳苦受。阿难。若又于某时。领纳不苦不乐受。其同时不领纳乐受。又不领苦受。其时应唯领纳不苦不乐受。</strong></p><p>释：阿难，如果又在另一个时间里领纳着苦受，那么这时候就不能同时领纳乐受，也不能同时领纳不苦不乐受，这时候只能领纳苦受。阿难，如果又在某一个时间里领纳着不苦不乐受，那么这时候就不能同时领纳乐受，也不能同时领纳苦受，只能领纳不苦不乐受。</p><p>佛陀这段的阐述，对于我就容易观察了，如果把受当作我，受有三种，我就有三种。可是在同一时间里，只能有一种受，那么只有这种受才是我，另外两种受就不是我。这就出现了矛盾，很显然把受当作我是不对的，这就说明了受不是我，如果受是我，三种受应该同时都是我，可是三种受又不能同时存在，受是互相对立，说明把受当作我是错误的。</p><p>有人就会说受当然不是第八识这个我了，可是这些文字和观察的内容，能与第八识扯在一起吗？显然不能，因为声闻人全部都不能现前观察第八识，你就无法证明受是不是第八识，即使能证明受不是第八识，也还是没有证得受非我，因为这个我不是指第八识，而是指能作主宰的五阴我。尤其是还没有断我见的凡夫声闻人，无法开悟实证第八识，那就不可能得出受非第八识这样的结论。如果观行次第是颠倒的，就不可能有实证，因为谁也不可能去想象出一个第八识来现前观察，想象出来的叫作猜测臆想，没有任何作用。</p><p>原文：<strong>阿难。乐受实是无常有为。缘起之法。灭尽之法。败坏之法。离欲之法。灭法也。阿难。苦受亦实是无常有为。缘起之法。灭尽之法。败坏之法。离欲之法。灭法也。阿难。不苦不乐受。亦实是无常有为。缘起之法。灭尽之法。败坏之法。离欲之法。灭法也。</strong></p><p>释：阿难，乐受确实是无常的有为法，是由于种种因缘而生起的法，是能灭尽的法，是败坏的法，是能离开对这种受的贪欲的法，是会灭去的法。阿难，苦受也确实是无常的有为法，是由于种种因缘而生起的法，是能灭尽的法，是败坏的法，是能离欲的法，是会灭去的法。阿难，不苦不乐受也确实是无常有为的法，是由于种种因缘而生起的法，是能灭尽的法，是败坏的法，是能离开对这种受贪欲的法，是能灭去的法。</p><p>原文：<strong>若领纳乐受。还是思惟。此是我之我者。彼又依于乐受之灭。实应不得思惟。我之我灭。若领纳苦受。还是思惟。此是我之我者。彼又依于苦受之灭。实应不得思惟。我之我灭。若领纳不苦不乐受。还是思惟。此是我之我者，彼又依于不苦不乐受之灭。实应不得思惟。我之我灭。</strong></p><p>释：如果在领纳乐受的时候，还是认为这个能领纳乐受的就是我，然而看到乐受灭了的时候，确实就不应该再认为能领纳乐受的我灭了；如果在领纳苦受的时候，还是认为能领纳苦受的就是我，那么看到苦受灭了的时候，确实不应该再认为能领纳苦受的我灭了；如果在领纳不苦不乐受的时候，还是认为能领纳不苦不乐受的就是我的话，当见到不苦不乐受灭了的时候，确实就不应该认为能领纳不苦不乐受的我灭了。</p><p>原文：<strong>对如是言。受是我之我者。要于现见之法。观察我是无常。乐苦皆归于消灭之生灭法。阿难。是故依此。不可能观察。受是我之我。</strong></p><p>释：对于第一种人，认为受是五阴我中的我这样的说法，应该在现前所能接触的法中，观察这个我是无常的，乐受、苦受都归于能够消灭的生灭法。阿难，因此依据受是无常生灭的现象，不可能观察出受是五阴我中的我。</p><p>原文：<strong>阿难。此中又言。受实非我之我。不得感受者。即是我之我。对彼应如是言。友。无一切所受之处。于其处。还得思惟有我耶。世尊。实不然。阿难。是故依此。不可能观察。受实非我之我。不得感受者，即是我之我。</strong></p><p>释：阿难，第二种人又说：受确实不是五阴我当中的我，而受之外的没有感受的想行识才是五阴我当中的我。对于有这样不正观点的人，应该这样问：善友，在没有苦乐受和不苦不乐受之处，就是色、想、行、识处，你还是认为色想行识有我吗？阿难回答说：实在是不应该认为色想行识是我。佛说：阿难，因此根据这样的说法，不可能观察出：受确实不是五阴我之我，而受之外的色想行识才是我。</p><p>原文：<strong>阿难。此中又言。受实非我之我。我之我亦非不得感受者。我应依我之领纳。即我之我是受法。对彼应如是言。友。一切感受完全消灭时。即无一切受。由此受之灭。还得有思惟。于此有我之我耶。世尊。实不然。是故阿难。依此不可能观察。受实非我之我。不得感受者。亦非我之我。我应我之领纳。即我是受法。</strong></p><p>释：阿难，第三种人又说：受确实不是五阴我之我，我也不是非受的色想行识，我应该依止于我的领纳性，也就是说五阴我中的我就是受法。对于有这样观念的人，应该这样对他说：善友，当一切感受都消灭以后，就没有一切受了，因为受灭了，你还认为能领纳的受法就是五阴我中的我吗？阿难回答说：受确实不是我。佛说：阿难，因此说依止于能领纳的受，不可能观察出：受确实不是我，离于受的色想行识也不是我，我接受我的领纳性，即领纳就是我，我就是能领纳的受法。</p><p>众生所认为的我有五种，第一种是色我，把色阴当作我，认为我就是色阴，色阴就是我；第二种是受我，把受当作我，认为我就是受，受就是我；第三种是想我，把想当作我，认为我就是想，想就是我；第四种是行我，把行当作我，认为我就是行，行就是我；第五种是识我，把识当作我，认为我就是识，识就是我。当众生把受当作我，心中就会有受我这种我的思想观念。众生没有断我见的时候，或者把五种我的任一种当作我，而把其余的当作是我所，或者把五受阴都当作我，这就是我见的范畴。</p><p>原文：<strong>阿难。是故比丘。不观察受是我。亦不观察。不得感受者是我。又不观察。我应依我之领纳。即我之我是受法。不观如是之我者。彼于世间之任何者。皆不执着。不执着故。无有恐怖。无有恐怖故。唯独般涅槃。自知生已尽。梵行已立。所作已作。更无后有。</strong></p><p>释：阿难，因此说比丘们不应该把受当作我，也不应该把色想行识当作我，又不应该依止于我的领纳性，不应该有我是受法的观念。不把这些法当作我的人，就会在面对任何法的时候，都不生起执著，内心没有恐怖。因为没有恐怖的缘故，只有取证涅槃，自己能够证知生死已经到了尽头，清净的梵行已经建立起来了，这一生所要修的解脱已经修完了，再也不受后世的有法了。</p><p>原文：<strong>阿难。如是。心解脱之比丘。不问如来。死后有耶。若彼执着是言者。彼则非正。不问如来。死后无耶。若彼执着是言者。彼则非正。</strong></p><p>释：阿难，就像这样，心解脱的比丘不会去问如来，我死后是否还有后世的有？如果比丘执著地认为死后还有三界的有，那么他还没有具足正知见，没有入到阿罗汉正位，不是心解脱的阿罗汉；心解脱的比丘也不会去问如来，我死后是否一切法都不存在了？如果比丘执著地认为自己死后一切法都灭了，他就还没有具足正知见，没有入阿罗汉正位，不是心解脱的阿罗汉。</p><p>原文：<strong>不问如来。死后亦有亦无耶。若彼执着是言者。彼则非正。不问如来。死后亦非有。亦非无耶。若彼执着是言者。彼则非正。</strong></p><p>释：心解脱的比丘也不会去问如来，我死后是否是也有后世的有，也无后世的有？如果他执著地认为自己死后也有也无，他就没有正知见，没有入到阿罗汉正位，不是心解脱的阿罗汉；心解脱的比丘不会去问如来，我死后是否是也非有后世的有，也非没有后世的有？如果他执著地认为自己死后是非有后世的有也非无后世的有，他就还没有具足正知见，没有入到阿罗汉正位，不是心得解脱的阿罗汉。</p><p>已经入到正位的四果阿罗汉，心解脱，一切都解脱，知见也解脱，不会认为死后有死后无，也有也无，非有非无，心中泯绝一切不正知见，不再执著死后是有是无，不管执著自己死后是有还是无，还是非有非无，一切念想执著灭尽才能得解脱，命终入无余涅槃。</p></div>"
},{
    "title": "第七章 佛说老母经",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  佛说老母经</strong></p><p>原文：<strong>闻如是。一时佛在维耶罗国。所止处名曰乐音。时与八百比丘僧。菩萨万人俱。</strong></p><p>释：阿难说：我亲自听闻佛陀讲的这部经。佛曾经在维耶罗国乐音这个地方的时候，佛有一次与八百比丘僧，菩萨万人在一起，为这些比丘僧众和菩萨众讲法。</p><p>比丘僧一般是指跟随佛陀修学小乘苦集灭道四圣谛的常随众，修学四圣谛法能断除我见，证得人无我，得解脱三界生死轮回苦，证得五阴十八界苦、空、无常、无我。既然五阴十八界是苦的，苦的就不是我，是空的，空的就不是我，是无常的，无常的就不是我。我是不苦的，我是不空的，我是常在的，而五阴十八界却没有真实的、常在的、不苦的我性，那么五阴十八界就不是我。</p><p>由于认可了这个理，就把原来认为五阴是我的错误知见消除了，这样就断了五阴是我的我见邪见，从前捆绑自己流转生死的三缚结就断掉了，证得了初果须陀洹。继而贪嗔痴烦恼变得淡薄，证得二果斯陀含；修出初禅定以后，断除了欲界的贪欲心，又断除了嗔恚心，证得三果阿那含；继而再修行，我慢断尽，意根对自我的执著灭尽，一念无明四住地烦恼断尽，证得四果大罗汉。舍寿时到，阿罗汉的意根不再作主生出六识触六尘，意根也没有了任何心行，这样六根六尘六识灭尽，色受想行识五阴功能灭尽，就入无余涅槃，不再来三界了，这就了生脱死，出离三界得解脱了。</p><p>菩萨有出家和在家两种，菩萨主要修布施、持戒、忍辱、精进、禅定、般若智慧这六度波罗蜜，以及所有自利利人的菩萨行，历经十信位、十住位、十行位、十回向位、十地位、等觉、妙觉五十二个阶位，以三大阿僧祗劫的修行，最后圆满成就佛道。</p><p>六度行的修行中，布施包括财布施、法布施、无畏布施；持戒包括持小乘五戒和大乘菩萨戒；忍辱主要是要调柔自己的心性，对于一切人事物理要修忍，随顺于空，忍于五蕴世间诸法空、无我，坚持精进地修行，不畏难；精进，对布施要精进，广集无量的福德，对于持戒要精进修行，对忍辱要精进修行，对于禅定要精进修行，对于修般若智慧也要精进修行；第五度是禅定，要具足未到地定或者是初禅定的定力，以此定力来思惟参究佛法，观行大小乘的空理，证得空果；最后就是般若智慧度，就是要熏习般若之理，如来藏之理，为明心见性打基础。这些修行就是修行菩萨六度，菩萨六度修满足了，机缘到来，就会证得无生忍和无生法忍。</p><p>无生忍的意思是忍于五阴十八界没有真实的出生，都是如来藏所生的不实之法，因此都是空幻的、虚假的，忍可一切法无生、无行、无实、无所有，五阴世间法都没有真实的出生，都是空相假相，没有真实的我性。小乘证得初果至四果，证得人无我，也是一种无生忍。菩萨的无生忍，是明心见性证得如来藏，了知如来藏的实相法，不生不灭，真实不虚，同时了知万法都由如来藏所生所变，都是虚妄的、生灭的、不真实的，无我的，这样的忍称为无生忍。</p><p>无生法忍的智慧远远大于无生忍的智慧，这是初地一直到妙觉菩萨所修证的智慧，地上菩萨证得如来藏出生的三界世间一切法都是如来藏所生，都是一真法界中法，都是真如性，因此心智寂灭，堪受不退，名为无生法忍。菩萨们无生法忍的智慧一地比一地增进，直到佛地才能圆满具足。悟前要修六度，开悟以后还要内门修菩萨六度，满足条件以后就可以入到初地。初地菩萨在六度基础上，又增加了菩萨的四度：方便波罗蜜、愿波罗密、力波罗蜜、智波罗蜜。修行完十度波罗蜜，证得十地菩萨果位。这就是菩萨们所修的菩萨道。</p><p>原文：<strong>时有贫穷老母。来到佛所。以头面着地。为佛作礼。白佛言。愿欲有所问。佛言。善哉善哉当问。老母言。人生老病死。从何所来去至何所。色痛痒思想行识。从何所来。去至何所。眼耳鼻舌身心。从何所来。去至何所。地水火风空。从何所来。去至何所。</strong></p><p>释：在这个大法会当中，有个很贫穷的老母来到世尊的面前，以头面着地，为世尊作礼，然后对世尊说：我有个问题，可以请问您吗？佛言：善哉善哉，可以问。老母就问：人的生老病死是从什么地方来的，又到什么地方去了？色受想行识是从什么地方来的，又到什么地方去了？眼耳鼻舌身心是从什么地方来的，又到什么地方去了？地水火风空从什么地方来，又到什么地方去了？</p><p>老母一连问了这几个问题，一个是生老病死的问题，一个是五阴的问题，一个是六根的问题，最后是地水火风空五大种子的问题。这些问题都很深奥，是佛法修行上的根本问题，是六道轮回的生死大问题。从老母问的这些问题上可以看得出来，这个老母不是一般人，她前世修行的善根是很深厚的，如果善根不深厚，她就会问一些世俗利益方面的问题，如财色名食睡方面的问题。</p><p>老母是要对生死大问题寻根溯源，而要寻找生命的根源，就涉及到佛法修行的一个重要的法门，中乘辟支佛修学的十二因缘法。十二因缘法揭示了众生的五蕴世间一切法出现和灭去的因缘，众生的生老病死现象出现和灭去的因缘，三界六道众生的生死轮回的因缘。老母问的这些问题，实际上都属于因缘法的问题。</p><p>阿罗汉和辟支佛修行四圣谛和十二因缘法，到最后把一念无明灭掉，我执断尽，就可以入无余涅槃。色身五阴灭尽，生老病死忧悲苦恼也就没有了，就会离苦得乐，出离三界生死轮回。但是阿罗汉和辟支佛也没有得到真正的乐，只是离苦，没有色身五阴来受苦，离开三界，了三界生，脱三界死，得三界解脱了。为什么没有得乐呢？因为没有阿罗汉们的五阴身来受乐，没有受苦的身心，当然就没有受乐的身心，苦乐都是由生灭的身心来受。</p><p>简单解释一下老母所问问题中的有关概念。五阴是指从受精卵开始直至死亡时，这一期的色身叫色阴；受阴是苦、乐、不苦不乐的感受，也叫六受身，在六根触六尘时有受；想阴是六根触六尘时心上取六尘相，了知六尘相，就是六识对六尘的了别，也叫六想身；行阴是指六识的身口意行，包括身体的行为造作、言语觉观的行为造作、思想观念的行为造作，行就是行为、运作、迁流、变化，时间的变化、地点方位的迁移，身口意行刹那刹那的变化就是行阴，六识在分别六尘的时候都有行阴。识阴是六个识对六尘的了别作用。</p><p>形成色身的地、水、火、风、空五大种子都是阿赖耶识中的大种子，地性是坚硬性，有支撑执持的作用，比如外界的土地、山川、树木、金属、矿藏，这些都是坚硬性的，以地大为主，色身里也有地性，比如骨骼、肌肉、筋、脉等等，以地大为主。水性就是湿润性，比如河流、大海、种种液体等等，在身体里的尿液、汗液、唾液、血液、眼泪、鼻涕等等都属于湿润的水性。火性就是热量、温度、能量，在外界和身体內界都有火性，比如外界的阳光、燃烧的火、体内的温度等等。</p><p>风性就是飘动、流动的属性，分为外风和身体里的内风，外风如宇宙虚空当中出现的大风、台风、暴风，微风，就是外界的风，身体內界的风就是呼吸和在身体内运行的各种气息，因为身体里有风的流动性，所以吃的饮食才能在肠胃里一点点地消化、吸收、排泄，血液才能流动，心脏、脉搏才能跳动，这些都有风性的作用。如果没有风，物质就不能流动，身体就不能运转，风就代表流动性，是一种动能。众生语言的产生也离不开风性的作用，内心里有了想法和觉观，风就产生出来了，风触脐，再触心脏，依次触气管、舌根，口腔，声音就发出来，语言就产生出来，这也是风性的作用。</p><p>空大就是虚空性，分为外界的虚空和空间和身体内的空隙和空间。因为外界有空间，才能容纳一切色法，物质才能运行，声音、气体和味尘才能传播，各种能量才能传递，众生才能在虚空当中生存。外界的虚空是所有众生的阿赖耶识，共同输出空大种子所形成的，是所有众生的阿赖耶识所共同执持的，各种物质当中也有空隙和空间，其空隙多少的不同，就造成物质的结构不同，密度就不同，物质的物理性质就不同，物质当中的空间也是由共业众生的所有阿赖耶识共同形成和执持的。</p><p>身体里各个组织结构当中都有空隙和空间，因为有空间，饮食、气体和血液才能流动。身体当中最小的细胞组织里也有空间，细胞里的各种分子结构当中也有空隙，这样分子、离子等各种微粒才能运行，细胞才能进行新陈代谢。所以四大加上空大，组成了众生的三界世间，五大种子遍一切处存在。</p><p>阿赖耶识输出五大种子，五大种子和合起来，就形成各种物质，包括外面的山川、大地、树木、河流、星体，都是五大种子和合起来的，只是各自的比例不同，所形成的物质就不同。地水火风空和合起来也造就了众生的色身，就像骨骼里面不仅有地性，还有火性、风性、水性，但色身上的五大种子是这个众生的阿赖耶识独自输出来的，色身是由别业众生的个体阿赖耶识独自出生和执持的。</p><p>外界的花草树木也都是由地水火风空五大种子组成的，比如树木一挤压就出水，说明里面含藏水大，点燃就能燃烧，说明里面含藏火性；树木是坚硬的，就说明里面含藏地大；树木能够生长，说明里面含藏着风性，树木里面也有空大，有空隙，风才能在里面流通，水才能在里面滋润。石头里不仅有地大、水大、火大和空大，石头一挤压就出水，敲击就冒火星，里面也有空隙，分子中间有空隙，因为有空隙，分子才能运动，风才能在里面流动。里面空大的比例不同，石头的性质种类就不同，所以一切物质都是由地水火风空组成的。</p><p>原文：<strong>佛言。人生老病死。无所从来去亦无所至。色痛想行识。无所从来去亦无所至。眼耳鼻舌身心。无所从来去亦无所至。地水火风空。无所从来去亦无所至。</strong></p><p>释：佛说：人的生老病死没有来处也没有去处，色受想行识没有来处也没有去处，眼耳鼻舌身意没有来处也没有去处，地水火风空没有来处也没有去处。</p><p>世尊是从小乘中乘的空相上来讲，没有从大乘的真实义理上讲，因为当机者是二乘根基，世尊就依从众生的根基，从因缘法的空相上来讲，不讲大乘真实义。佛说人的生老病死没有来处，也没有去处，人的色身如果有来处，那么我们就推究寻找这个来处，结果无论如何也找不到来处。如果说人身是从父母来，从母胎里来，从受精卵里来，我们观察考证，发现父母和受精卵都没有来处，所以人身就没有来处；如果说人身是从虚空中来，可是虚空也没有来处，所以人身就没有来处。</p><p>众生死亡色身灭去了以后，人身也没有一个去处，如果有去处，人生生世世有无量无边的色身，一小劫里的每一个色身堆积起来都要比须弥山还要高大，那么所有众生的色身堆积起来就能堆满虚空，那就没有虚空了，因此说人身来无所来，灭了也没有去处。又比如说生病，病从哪里来？哪里存着这些病症到身体里来了？疾病没有来处。把病治好以后病又到哪里去了？如果说病到虚空里去了，如果虚空里存着无数的疾病，众生就会都生活在一片病气当中，那就无有不病时了。因此病不到虚空里去，也不到其它处所，没有来处也没有去处，这说明万法都是空的。</p><p>色阴没有来处和去处，受阴也如此，比如听音乐时感觉很快乐，这个快乐的感受从哪里来？快乐的感受消失了到哪里去了？没有来处和去处。想阴也没有来处和去处，眼见色有知性，这个知是从哪里来的？当睡着了，外面的色就不知道了，这个知性又到哪里去了？没有一个去处。行阴也同样是没有来处和去处，比如钉桌子这个行为从哪里来？钉桌子这个行为消失了，又到哪里去了？没有来处和去处。识阴六识对于六尘的了别性知觉性，也同样是没有来处没有去处。</p><p>万法都没有来处也没有去处，比如树林里的树木，树木是从哪里来的？如果说是从树种子里来的，种子很小，并没有大树的相，而且树种子也没有来处，大树就更没有来处了，虚空里也没有大树的相，树毁灭了以后又到哪里去了？没有去处。虚空中出现台风的时候，台风从哪里来？来之前藏在了哪里？台风止息下来以后，又到哪里去了？没有来处也没有去处，本是虚幻。</p><p>天上乌云密布下雨时，雨点是从哪里来的？如果说是从云朵里来，天空总有云，为什么不常常下雨？如果说雨点藏在虚空当中，虚空常在，应该常常下雨，雨停了雨点也没有去处，不能躲到云朵和虚空里。地球毁灭的时候，天上落下的雨点就像大象那么大，以至于形成了水灾，一直淹到初禅天，那么多的雨水就更没有隐藏之处了，等水灾消退了，大水又去了哪里？没有去处。诸法都是来无所来，去无所去。</p><p>外面着火烧了荒草，那火没着之前在哪里？不在点火人的手里和虚空里，火没有来处，灭了也没有去处，如果虚空里有火，一切物都会被烧毁，什么都不存在了，火如果是从太阳来，也会一切时烧着一切物，所到之处都是灰烬。又比如人头晕目眩，感觉眼冒金花，那些金花从哪里来？如果从虚空来，别人却看不见，也不头晕目眩，如果说是从眼睛里来，应该常常眼冒金花才是。当头不晕的时候，那些金花又到哪里去了？来无所来，去无所去。这样观察就知道了诸法全都是空，没有一样是真实的，空来空去，就像魔幻师变幻的一样，找不到来处和去处，都是幻化的假相。</p><p>原文：<strong>佛言。诸法亦如是。譬如两木相钻出火。火还烧木，木尽火便灭。佛问老母言。是火本从何所来。灭去至何所。老母报佛言。因缘合会便得火。因缘离散火即灭。</strong></p><p>释：佛说：诸法也如此，来无所来去无所去。譬如两木互相磨擦出火，火却烧燃了木头，木头烧尽了，火也就灭了。佛问老母说：这个火原本从哪里来？灭了又到哪里去？老母回答佛说：因缘和合在一起便生出了火，因缘灭了火就灭了。</p><p>火产生的因缘是什么？两块木头，人工放在一起摩擦，摩擦到一定程度，暖相出现，木头发热，火就生出来了。两块木头、人和人工，这些缘聚合起来，再加一个产生火的因，阿赖耶识当中的火大种子，这样因缘聚合，火就产生了。就像两只手，一摩擦就产生了热量，热量出现的因缘是因为两个手合在一起，用力摩擦而出现的，而两个手之间互相摩擦就产生不了火，因为这个缘不是产生火的缘。</p><p>比如众生生到这个世间是有因有缘的，因缘聚合才能生到这个世间，生到这世间的因缘是什么？首先要有造业的三界业种，还要有父母缘，有贪欲心，这些缘再加上出生的因阿赖耶识，众生才能入胎和出生。众生在这个世间的缘散了，寿命就终了。所以万法都是因缘所生，因缘所生的法都是空的，依因依缘所生的法就是不自在的、幻化的、虚妄的。</p><p>原文：<strong>佛言。诸法亦如是。因缘合会乃成。因缘离散即灭。诸法亦无所从来。去亦无所至。眼见好色即是意。意即是色。是二者俱空。无所有成。灭亦如是。</strong></p><p>释：佛说：诸法也是如此，因缘和合在一起就出生了，因缘离散就灭去了，诸法都是无所从来也无所去。眼见好色是心意，心意即是色，心与色二者都是空的，生无来处，灭无去处。</p><p>诸法包括色法和心法，任何一种法都是因缘和合才形成的，缘不具足，什么法也不会产生出来。各种法的产生都有其相应的因缘，一个缘散去了，法就灭失，所以离开任何一个因缘，法就不能出生。比如我在这讲法需要一个处所，需要有一台电脑，需要有听众，还需要我身体健康，还需要有光明等等这些外缘，缺一个缘，讲法的事就不成就。那么讲法这事就是因缘所生法，就是空幻的，因缘离散就消失。比如一家人，因缘聚合就生活到一起，缘灭一家人就散，所以对亲人也不要执着、贪恋，都是空幻的，没有永远不散的宴席，没有永远不退去的舞台，都会因缘聚合，聚散无常。</p><p>众生心里总是想见到好色，而所见到的色就是心想所生，能见色的心与所见的色都是空，色法和心法都是空，生时没有所藏的处所，灭也没有灭的去处。外界一切的色法，依各种缘而出生，虽然出生，也没有来处，因缘散，色即消失，消失了也没有去处，来无所来，去无所去。而能见色的心，也是因缘聚散，来无所来，去无所去，全部虚妄。</p><p>原文：<strong>诸法譬如鼓。不用一事成。有人持桴捶鼓。鼓便有声。是鼓声亦空。当来声亦空。过去声亦空。是声亦不从木革桴人手出。合会诸物。乃成鼓声。声从空尽空。诸所有万物一切亦如是。我人寿命亦如是。本际皆净无所有。从无所有因作法。法亦无所有。</strong></p><p>释：诸法好比鼓，鼓中空空，一物也没有，如果有人用木槌敲鼓，鼓就会发出声音。现在听到的鼓声是空的，以后出现的的鼓声也是空的，灭去的鼓声也是空的。这些鼓声不从木槌中来，不从人手中出，不从鼓的革皮中出，而是鼓、木槌和人手和合起来形成的鼓声。鼓声从空到空，所有一切万物也是这样，我、人、寿命也是这样，本体都是空净一无所有，以无所有为因生成的法，法也无所有。</p><p>佛又举敲鼓这件事说，一切法不从虚空来，不从一切物来，不无因来，虚空无物，不会变出任何物质色法。拿一个鼓槌敲鼓，鼓是皮革做成的，鼓槌一敲，咚咚咚的声音就出来了，那个声音是从哪里来？如果是从手里来，手里也没有声音，如果是从鼓锤里来，鼓锤里没有声音，鼓里也没有声音，虚空里也没有声音，如果有声音就不叫作虚空了。不敲鼓时，那咚咚咚的声音到哪里去了？是到手里去了，到小锤里去了，到虚空里去了，还是到鼓里去了？鼓声哪里也不到，鼓声是虚妄的，来无所来，去无所去。</p><p>诸法好比鼓声一样虚妄，有人拿着鼓锤再敲击，鼓才能发出声音，那么咚咚咚的鼓声就是因缘所生法，因缘所生的法，本身就是空的。鼓本身就是因缘所生，敲鼓这件事更是因缘所生，鼓产生出来的声音也是因缘所生，诸法都是空无自性的。现在的鼓声是空的，将来的鼓声是空的，从前敲鼓所产生出来的声音也是空的，所有这些声音都是空的。声音不从鼓中产生，也不从人的手中产生，也不从虚空中产生，是这些因缘和合到一起了，才产生这些鼓声。这个鼓声来也没有一个来处，去也没有一个去处，从空到空，空来空去。诸法也如是，所有的万物也如是，空来空去，没有来处没有去处。</p><p>又比如地球的生住异灭，地球慢慢形成时，地球是从哪里来？地球毁灭了，地球这么大的一个星体，又到哪里去了？须弥山比地球大无数倍，毁灭的时候，整个须弥山都没有了，一点碎末都不见了，须弥山又到哪里去？以后慢慢又形成了一个须弥山，这个须弥山又从哪里来？整个宇宙器世间从哪里来?又到哪里去？没有来处也没有去处。</p><p>人的寿命也如是，众生往往认为，五阴是我人，是我相人相众生相，在这个我人之中有一个我人的寿命，这是寿者相，属于四相：我相、人相、众生相、寿者相之一。我相就是我的五阴十八界相，人相就是人的五阴十八界相，众生相就是所有众生的五阴十八界相。四相全部都是虚妄的，来无所来，去无所去。这些法相的本际是空净无所有的，本际是本体本来的意思，诸法本来是空无所有的，没有来处，以无所有的法形成新的法，新法也是空的无所有的。</p><p>原文：<strong>譬如云起。阴冥便雨。雨亦不从龙身出。亦不从龙心出。皆龙因缘所作。乃致是雨。诸法无所从来。去亦无所至。</strong></p><p>释：譬如虚空中的云聚集到一起，非常阴暗低沉，于是就下雨了。雨水不是从龙身中出来的，也不是从龙的心中生出来的，都是由于龙的关系，因缘聚合，才把雨生出来了。诸法无所从来，去也无所去。</p><p>当云朵中含有大量的雨水，就会阴沉沉的，非常黑暗，云层托不住雨水了，就会下雨。雨水是从哪里来的？不从龙的身上出来。下雨之事虽然是龙所管辖的，但是龙身上没有雨，龙身不管有多大也藏不了这些雨。雨水也不是从龙心产生出来的，龙心里也不装着这些雨水，而是因为众生善恶业因缘聚合，就产生了雨。</p><p>是什么因缘呢？众生善缘成熟时，该有雨水来滋润土地和饮用，龙就会降雨，雨就产生出来了。众生的恶业因缘成熟时，龙就会降下过多的雨水，众生就会受到水灾，或者是连年不下雨，众生就会受旱灾。因此因缘聚会而出现的法就是空的，无所有的。一切法就像雨水一样无所从来，灭也没有一个灭的处所。</p><p>原文：<strong>譬如画师。先治板素。却后调和众彩。便在所作。是画亦不从板素彩出。随其意。所为悉成。生死亦如是。各各异类。地狱禽兽。饿鬼天上。世间亦尔。有解是慧者不着。着便有。</strong></p><p>释：就像一个画师想要画画，需要先把画板准备好，然后再把需要的颜料调和好，还要有画笔，画师手拿画笔，沾取调好的色彩，便在画板上画画了。画师画出来的无论是山水画也好，人物画也好，什么画也好，彩画是从哪里来的？彩画不是从画师手里出来的，也不是从颜料中出来的，也不是从画板上出来的。但是彩画却随着画师的心意描绘而出。生死也是这样，四生二十五有各类众生和世间也是这样。能明了这个真理的人是有智慧的，不会着于世间一切法，如果执着世间一切法，就有生死苦。</p><p>众生的生死也如彩画一样，来没有一个来处，去也没有一个去处，地狱，畜生、恶鬼、天人、人类都是这样，生也没有一个来处，消失了也没有一个去处，一切法都是这样的虚妄，这样的空幻，这样的无常，而无常就是苦。能真正懂得这些道理的有智慧的人，不再执着这些因缘所生的虚妄法，如果还有执着贪求的心，世间万法就会产生，三界的有就会产生，生死就不能了脱。</p><p>原文：<strong>老母闻佛言大欢喜。即自说言。蒙天中天恩得法眼。虽身老羸。今得安隐。</strong></p><p>释：老母听佛讲了这些因缘法理以后非常欢喜，对佛说：蒙天中天您的恩德，我得了法眼净，虽然我这个身体又老又弱，但是我现在心得安稳了。</p><p>天中天就是指世尊，天人中的天人，比天人更尊贵，三界众生当中天人最尊贵，在天人中最尊贵的就是世尊，佛是三界至尊。证得法眼净，就是小乘的断我见，成为初果至四果人。老母听完世尊所讲的因缘法，证得了五阴空无我，就得了法眼净，观察法的眼是清净的，有智慧的，成了贤圣之人，消除三恶道的业，心得安稳。心得解脱，断了贪爱，这是三果和四果人的境界，有能力入涅槃，可以出离三界的生死，未来世不会再有苦受了，所以心才能安稳。</p><p>原文：<strong>阿难正衣服。长跪白佛言。是老母闻佛言即解。何因缘智慧乃尔。佛言。大德巍巍。以是故而即解。是老母者。是我前世发菩萨意时母。阿难白佛言。佛前世时母。何因困苦贫穷如是。</strong></p><p>释：这时阿难整理好衣服，长跪在佛前，然后问佛：这个老母听闻佛讲法就能得法眼净，是什么原因有如此的智慧？佛说：这个老母是一个非常有德行有修行的人，因为她生生世世修道，善根很深厚，有大威德，因此闻佛说法就能证解。这个老母是我过去世刚发菩萨道心时的母亲。阿难对佛说：既然是世尊您过去世的母亲，是什么因缘导致她为如此的贫穷困苦呢？</p><p>原文：<strong>佛言。乃昔拘楼秦佛时。我为菩萨道。意欲作沙门。母以恩爱故。不听我作沙门。我忧愁不食一日。以是故。前后来生世间。五百世遭厄如是。</strong></p><p>释：佛说：往昔拘留佛在世时，我为了修行菩萨道，想出家作沙门修道，我母亲因为对我太恩爱的缘故，不允许我出家作沙门，我就忧愁苦恼地整整一天没有吃饭。因为这个缘故，我母亲到这个世间里出生，前前后后总共有五百世都遭受如是贫穷苦厄。</p><p>以上是世尊讲的老母贫穷的因果故事，老母使得发菩萨道心的儿子心里难过，整整一天没有吃饭，也没有实现出家的愿望，就感得五百世得贫穷困苦的果报。因果是这样的不可思议，因小果大，众生因为无明往往都觉得因小，无所谓，实际上事情的起因很大，后果相当严重而不自知。所以修行人一定要善护身口意三业，知因达果，不造不善业，莫以善小而不为，勿以恶小而为之，蚁穴能决堤，尤其是涉及到三宝和生死的大事，一言一行更要小心谨慎。</p><p>还有一个因果故事是有关佛的儿子罗睺罗的，罗睺罗前世修道时因为嫌老鼠吵闹，影响修定，就把老鼠洞堵了六天，活活把老鼠闷死了，其果报就是被困在母胎里整整六年，这六年该有多少苦受。人类在母胎里住几个月就受不了，八九个月就要出来，罗睺罗却住了六年，五蕴身早都已经成熟了，那感觉比住监狱难受多了，就在母体里面受着挤压，身体却不能活动。</p><p>老母经历的五百世是指做人时的五百世，这其中还有不做人的时候，加一起，其时劫非常久远。做人的时候就像在大海里冒出了头的时候，人没做好又掉进海里，下三恶道了，老母前后五百世来到人间，都是像这样贫穷困苦。一点点的业行，所感得的果报却是极大的，还有人因一句话就下了无间地狱，因果就是这样的可畏，所以身口意一定要清净，尽量不犯丝毫过错。</p><p>原文：<strong>佛语阿难。是老母寿终。当生阿弥陀佛国中。供养诸佛。却后六十八亿劫。当得作佛。字扶波健。其国名化作。所有被服饮食。如忉利天上。其国中人民皆寿一劫。</strong></p><p>释：佛对阿难说：这个老母寿终以后，就会往生到极乐世界阿弥陀佛国土中，在那里供养十方诸佛。在这之后的六十八亿劫的时候，就要成佛了，佛的名字叫作扶波健，其佛国土名字叫作化作。化作国中人民的所有衣被饮食，都如忉利天一样，国中人民寿命为一劫。</p><p>因为老母已经证果了，最低是中品上生往生到极乐世界，或者是上品上生，不用住在莲花宫殿里，而是如天人一般在极乐世界随意游行，随意往来其他佛国土，供养十方世界诸佛。供养包括身口意行、饮食卧具的供养，以及在佛身边随佛修学的法供养。老母将来佛国土中的人民，所有的饮食生活资具都像忉利天一样，都是变化而有，只要心起饮食念，百味饮食悉皆现前，然后一嗅闻就吃完了。国土中人民的寿命都是一劫，一劫是大劫还是小劫，没有具体说明，小劫是一千六百八十万年，大劫就再乘以八十。国中人民的寿命就这样长，那么扶波健这尊佛的寿命至少也是这么长，可能比这还要长。</p><p>世尊给老母授记成佛时劫是六十八亿劫以后，时间虽然很久远，但还是有数量的。成佛需要三个无量数劫，修到八地菩萨要经过两个无量数劫，还有一个无量数劫就能成佛。六十八亿劫是在最后一个无量数劫里，那就是八地以上的菩萨了，说明老母所证得的果位是四果大阿罗汉或者是辟支佛。佛为菩萨授记一般是在菩萨修到八地菩萨的时候，这个老母此时已经得解脱了，就应该是四果罗汉，往生到极乐世界的时候回心大乘，闻佛说法，就会证得八地菩萨的果位，离成佛最多还有一个无量数劫，这是老母修行所感得的非常殊胜的果报。</p><p>原文：<strong>佛说此经已。老母及阿难等。菩萨比丘僧。诸天龙鬼神阿须伦皆大欢喜。前以头面着地。为佛作礼而去。</strong></p><p>释：佛说了这个经以后，老母以及阿难、菩萨们、比丘僧们，还有天人、鬼神、阿修罗都非常的欢喜。都头面着地，对世尊作礼才离开，表示信受奉行，于是这个法会就结束了。</p></div>"
},{
    "title": "第八章 了断十二因缘的关键环节—第一节 十二因缘生死链及顺逆生死门",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第八章 了断十二因缘的关键环节</strong></p><p><strong>第一节  十二因缘生死链及顺逆生死门</strong></p><p>一、十二因缘生死链</p><p>无明（意根的无明）——行（身口意行）——识（六识以及业种）——名色（后世的五蕴）——六入（六根）——触（六根触六尘）——受（六识的受，引起意根的受）——爱（六识的爱，主要是意根的贪爱）——取（六识的取，主要是意根的取）——有（三界五蕴世间法）——生（五蕴身在三界世间出生）——老病死苦（五蕴身灭）。</p><p>生死缘于无明而有，是意根的无明导致无量生死现行，意根由于无明，起心动念，有所抉择，想要造作业行，于是六识出生满足意根的意愿造作身口意业行，于是三界世间业种留下了。有了三界业种，必有后世于三界中流转。在死后中阴阶段意根随业入胎，有了最初的名色，随后六入渐渐具足，触就出现，随触之后，识的受觉就出现了，有了受就贪爱不止，于是执取受和尘境，业种存下，后世的有必须继续出生和存在，后世的生就会出现，老病死必然出现。</p><p>名色，最初是意根和受精卵，最后是五阴身。入胎时是意根和阿赖耶识入胎，与受精卵和合成为名色，完整的名色就是六识、六根加六尘，共十八界。那么名色缘于什么识才能出生？借助于哪个识才能出生？需要借助于前世的六识，因为六识的造作能够留下未来世五阴身的业种，有种子才能有五阴身。名色具足时，才能有内外六入的触，之后就会出生今世的六识。六入具足，才能有六识，六入具足时五阴身具足，六识就可以造作身口意行了。有业行就有种子，有种子就有果，业行之后留下业种，以资润未来世的五阴身，众生就是这样生生不息。</p><p>要想解脱生死轮回苦，就必须要打开十二个生死链条，最关键的问题就是种子，六识只要不再造作业行，就不留业种了；六识不造作业行完全决定于意根的思心所，只有意根的思心所不抉择造作业行了，六识就不造作身口意的业行，就不留下种子；要想意根的思心所不造业，就要破除意根的无明。要想破除意根的无明，就要修习四圣谛法，修习十二因缘，定中深细观行，证得五阴世间空无我之后，慢慢就会把生死链条解开了，就得解脱了。</p><p>二、了断十二因缘的关键环节</p><p>十二因缘通三世，无明、行和识是前世的支分，名色、六入、触、受、爱和取是今世的支分，有、生和老死是后世的支分。思惟此理时分为顺和逆两种方法，顺着十二因缘思惟，能了解意根由于无明起行所产生的六识身口意行，会导致后世五阴的生老病死苦。逆着十二因缘思惟，有两个分支，一个分支是由名色追溯到前世六识造作业行留下的业种，然后再追溯到意根的无明；另一个分支是由名色追溯到生死的源头阿赖耶识。</p><p>其中逆因缘的第一分支，由老死开始往前追溯，依次追溯到生、有、取、爱、受、触、六入、名色、六识、行和无明，今世了断生死的重点在哪里？在取、爱、受和触着四个环节。因为名色和六入必须要用，现在不能灭除，如果要灭除就得自杀死，即使自杀死亡也免不了后世的生老病死，而六识的业种是前世造作身口意行落下的，即使忏悔，也不能灭除名色五阴了，那么要想后世解脱生死，就要着重在触、受、爱和取四个环节上修行，而后三个环节是由触流转出来的，都是直接或者间接以触为缘而生，所以触是很关键的一环。</p><p>触是六根对六尘的触，也就是内六入对外六入的触，之后六识出生加以了别，再生受，于是贪嗔就出现了，对六尘境界的执取也会随之出现，这些业行就会导致今世和后世的生老病死苦。如何能避免对六尘的触呢？那就要减少和灭除意根的攀缘性，意根不攀缘六尘，就不愿意再触六尘，如果不触六尘后边就没什么事了，心就清净了，所以关键还是在意根这里。</p><p>如何能让意根不再攀缘六尘？一是修定，二是明理，在定中观行六尘境界的无常和生灭性，明理就能断除无明，没有无明意根就不再攀缘六尘境界，对六尘境界不再感兴趣，就会自动减少攀缘，就会减少触的次数和时间，慢慢心就清净了。心清净了就无受，无受就无爱，无爱就不取。</p><p>众生的无始劫以来六根习惯于触六尘，很难都降伏和去除，有时也是生存需要不得不触，或者是被动的触，一旦触了之后，就要减少受，或者不受。做到触时无心，就无受，无受就不爱，不爱就不取。要做到少受或无受，就要有禅定，也要有观行智慧，心才能空，才能离相，才能不受境界，心清净，也就不会取着境界了。</p><p>如果不受境界比较困难，不能完全做得到，那么在对境界感受的时候，尽量不要生起贪嗔，要思索受的无常和虚妄，思索境界的生灭和无常，心就能降伏下来，贪嗔就能减少了。爱和受连接比较紧密，在受的时候不生起贪爱很难，这时候必须要有禅定，定力一定要强，才能降伏爱，甚至断除爱。而断除爱必须有初禅以上的禅定才行。在一切法的修行过程中，不能离开禅定，禅定浅一点，烦恼就不能降伏，更不能断除，解脱就无望。</p><p>在降伏爱这个环节的时候如果失败了，那么取着所爱就几乎是不可避免了，要想不取太难了，取灭了，要在三果修圆满的时候，四果就不再取着了，一瞬间的取有可能避免不了，但是瞬间之后就会以智慧断除。如果总有这样的现象发生，就是解脱不太坚固的阿罗汉了，在临终无余涅槃之前要不断的作加行，才能在瞬间灭度和涅槃。</p><p>总结起来说，触受爱取四个环节都很关键，只有降伏和断除了前一个环节，后一个环节才有可能不出生，所以解脱最关键的还是触这个环节。一切法的修行，环境是很重要的一个因素，诸佛菩萨修行的时候，都是在寂静和僻静之处，无人无事打扰，就没有那么多的触，功夫进展就很快，成道就很快。所以我们的修行在不得不随缘的情况下，还要多创造一些静修的因缘条件，尽量减少触的因缘，才好修行，热闹之处是无法成就道业的。</p><p>无明这个支分通三世，前世是因为无明，才有后边十一个支分，今世还是因为无明，触受爱取不断，后世也会因为无明，继续运作这些程序，三世生死不断绝。无明是在哪个环节断除的？其实在佛世的时候，修行十二因缘的人，大多数都是修行过四圣谛，甚至都是证果的人，在断除我见的基础上再来修行十二因缘，无明已经断除了，只是不够究竟和彻底。所以修行十二因缘证得缘觉辟支佛的果位要高于阿罗汉的果位，无明断除的更多，禅定和智慧更深于阿罗汉。无明是分很多层次的，辟支佛也不是究竟断无明，只有诸佛才究竟了断了无明和生死。</p><p>三、灭苦的关键环节 </p><p>如果要灭除生老病死忧悲苦恼，十二因缘法里，哪个环节最关键？或者说十二因缘法里哪个环节最能直接导致生老病死忧悲苦恼？有人说是取，有人说是贪爱，有人说是受，有人说是触，有人说是六入，有人说是有名色，有人说是六识，有人说是行，有人说是无明。</p><p>首先来看只要灭掉取，不再取着了，后世的有就不会出现了，生死从此也就消失了。所以取还是比较关键的，没有取，就没有后世出生的因缘条件，如果想灭取，要如何做呢？如果一个人很贪爱，是否能灭掉取？根本不能，所以灭除贪爱也很关键。贪爱的灭除必须在断我见之后修出初禅定了，才能有能力灭除，灭除贪爱就是三果四果人了。</p><p>可是如果一个人不断的受，贪爱能否灭除不生了？根本不能，所以灭掉受也很关键。如何灭掉受呢？受是因为触境界而产生出来的，只有减少触、灭掉触，才能减少受、灭掉受，所以灭掉触也很关键。如何灭掉触呢？有内六入，就要不断的触，不触就很难受，不触不行，所以灭掉内六入就很关键。</p><p>如何灭掉内六入呢？内六入是由名色而来，有名色就有内六入，所以灭掉名色就很关键了。如何灭掉名色呢？名色由前世的业种而来，业种是六识造作身口意行留下的，如果六识不造作身口意行，就不会有三界的种子，也就不会有后世的名色五阴出生，生死就了了。所以灭除六识及六识的身口意行就很关键。如何灭掉六识呢？六识的出生是由意根决定的，意根想要造作身口意行，六识必然会出生并且顺从意根的心行而造作，意根有心于三界世间法，行于三界世间，是由于意根的无明所致，意根只要有无明，必然有心行，必然想要造作业行。</p><p>所以灭除意根的无明很关键，无明一灭，三界五阴世间必然会灭尽，连灰尘都不会出现。如何灭尽无明呢？修行是先要降伏意根的心行，降伏六识的身口意行，降伏六入的触，降伏受觉，降伏贪欲，降伏取着心，之后才能断除，直至灭尽。降伏的过程，就是修行三十七道品修行八正道的过程，就是修行戒定慧的过程。降伏之后，戒律严明了，禅定提升了，智慧增进了，身心轻安了，不久就会第一次脱胎换骨了，然后法眼净，证初果，进入三昧之中。第二次脱胎换骨在修出初禅定之后，烦恼次第脱落断除，我执断尽时，解脱三界世间苦。</p><p>降伏一个环节，其它环节次第都会得到降伏，断除一个环节，其它环节次第都会断除，其中无明断除最为根本，无明不断，其它所有环节都不能断尽，还会生根发芽。当有禅定时，触就会减少，受也会减少，爱也会减少，取也会减少，这些环节就得到降伏了，但是不断无明，这些环节还会增盛。出离心没有生起来，是因为没有认识到苦，认识不到苦，是因为有无明，无明比较重。</p><p>这些生死烦恼、生死无明的关键，都在意根这里，降伏意根，断除意根的无明，最为关键。意根有无明，就会攀缘，之后就会抉择，之后六识就出生，之后身口意行造作，之后业种存下来，之后再投胎名色出生，新一轮生死又出现了。就这样循环往复，无有止期。断我见证初果，是首次断除意根的无明，只断意根一部分无明，再继续修行，再断除一部分，智慧三昧增进，证二果，证三果，三界无明烦恼断尽，证四果。所以初果必断意根的我见，只是断得少，只断一部分，比较粗重的部分。</p><p>四、十二因缘顺生死门</p><p>十二因缘的第一支是无明，众生都有无明，无明是生死的根源，是造就生死的因。什么叫无明？无明是心中黑暗，不懂不明白。对什么不懂？对生老病死不懂，对于五阴十八界不懂，对于四圣谛和十二因缘法不懂，对法界实相不懂，对了生脱死究竟成佛之理不懂，这一切不懂就是无明。</p><p>有无明就有无明的业行，十二因缘的第二支就是行，无明缘行。因为意根有无明，为攀缘万法，进而产生了种种身口意行，这样必然会留存业种，于是十二因缘的第三支行缘识，六识的业种就出现了，有业种必然要产生后世的名色。身行是指五阴身的种种造作，生产、经商、事业、政治、维持色身的存在等等的行为；口行是语言觉观、思惟、言行造作等等的行为；意行是指妄想、计划、心里的盘算、思量、回忆、推理、判断、想象等等的心理活动。</p><p>众生的一切行为都离不开身、口、意这三行的造作，因为有无明，身口意行就和贪嗔痴烦恼相应，所造作出来的就是染污的业行，染污的业种就会被阿赖耶识收存，将来业种成熟就会出生未来世的果报身，于是生死苦恼不断。因为有六识造作的业种，就会有后世的果报，于是十二因缘的第四支识缘名色就产生了。什么叫名色？名就是说只有名字之法，但无形色，刚入胎时指的是第七识，六根圆满时指的是七个识妄心，也就是受想行识四阴。色就是受精卵，代表身体，名色代表身心五阴，色身与识心合起来叫作名色。</p><p>十二因缘第五支是名色缘六入，六入就是六尘从之入进来的六根。名色增长就会生出五根，与本来就有的意根，合起来就是六入。因为有了名色，就产生了六入。第六支是六入缘触，根的存在就是为了触六尘的，所以有六入必然有触。眼根触色尘，耳根触声尘，鼻根触香尘，舌根触味尘，身根触触尘，意根触法尘，六入与六尘相触后，产生六识，就会有受，有觉观和了别。</p><p>触之后生受，所以十二因缘第七支是触缘受。这个受首先是接受、领纳、感受，之后有苦乐受和不苦不乐受。如耳根触声尘，耳识和意识就出生并了别，就会有苦、乐和不苦不乐的感受，听到音乐就有乐受，听到争吵声就有苦受。触缘受，是六根触六尘的结果。受之后就会生出贪爱，所以十二因缘第八支是受缘爱，受产生出来以后，进一步就会有喜厌的思想情绪，希望有进一步的见闻觉知。</p><p>贪爱产生出来以后，就会执取尘境，对尘境有取舍心行，所以十二因缘第九支是爱缘取，希望自己喜欢的尘境永远存在不失，不喜欢的境界马上消失不现。因为有占有和执取的心行，阿赖耶识顺从于意根的执取，三界的器世间和后世的五蕴身就产生了，所以十二因缘第十支就是取缘有。三界有欲界、色界、无色界的五蕴十八界，欲界有男女，有男女欲，有生存资具，财、色、名、食、睡；色界有不分性别的天人的五蕴十八界，有色界天宫殿；无色界有六七八三个识和法尘，没有色身和五尘境，所以叫无色界。因为意根对三界法的执取，就感召出了三界法，三界的生死苦就出现了。</p><p>十二因缘的第十一支是有缘生，因为三界有的因缘具足了，生命就会在三界里出生。生存条件具足，生命才会出生，不具足就不能出生，比如说湿生的众生，一定是在潮湿的环境里才能生存，生命体才能出生，如果某个地方很干燥，没有水分，湿生的众生就不能出生。潮湿的环境才能有蚊虫，所以四生九有众生只有在因缘条件具足的时候才能出生。意根越执取，因缘具足的越快，生命出生的越快。</p><p>有生必有死，根本没有不老不死的，所以生命出生以后，就会渐渐的成长和老死，生老病死苦就出现了，所有的忧悲苦恼，纯大苦聚就出现了，所以十二因缘最后一支是生缘老死。外道修仙道，想要永远不死，实际上众生不管活多久，最终必将死亡，生老病死是一个生命循环周期。万物有生住异灭，人有生老病死，宇宙器世间都有成住坏空的循环周期，每一个众生只要生出来了，就会有死亡，这是免不了的。以上是顺十二因缘，是顺生死门。</p><p>五、十二因缘逆生死门</p><p>十二因缘倒逆过来，逆过来即是逆生死了生死，解脱生死苦。逆十二因缘第一支是老死支，为什么会出现老死现象？是因为有生，生则必老必死。逆因缘第二支是生支，为什么有生，生命为什么能出现在世间里？因为意根执取三界法，三界器世间就会出现，五蕴身随之就出现。第三支是有支，第四支是取支，众生为什么要执取三界世俗法？是因为内心里有贪爱。第五支是爱支，为什么有贪爱？因为对三界当中的六尘境界有觉受、有感受，有感受就会产生贪爱。第六支是受，为什么会出现受？因为有触，六根总是要触六尘，七识对所触之境就有觉受。</p><p>第七支是触支，为什么有触？因为有六入，就会与六尘相触。第八支是六入支，为什么会有六入？因为有名色，名色增长就会有六入。第九支是名色支，为什么会有名色？因为有六识不断地造作身口意行，存有业种，必然要出生与业种相应的名色。第十支是识支，为什么会出现六识的业种？因为意根的心行不断，促使六识不断造作身口意行，就存下了六识的业种。第十一支是行支，为什么身口意业行不断？因为意根有无明，对世间攀缘不断，导致十二因缘循环往复，最后一支是无明，这是十二因缘的逆推。</p><p>十二因缘逆推还有另外一个十因缘法，是逆推是推到名色这里，寻本溯源，会有一个根本性的思惟，思惟名色的真正来源是什么，生命的源头在哪里，名色是如何出生的？名色到底是从哪里来？辟支佛们逆推到这里，就知道名色的本源是阿赖耶识，名色是阿赖耶识出生的，再从阿赖耶识往前推就没有法了，阿赖耶识是生死的源头，行缘识支和无明缘行支只不过是名色出生的助缘。在中阴身里，意根带着阿赖耶识去投胎，没有阿赖耶识，意根也不存在，也不能投胎了。那么名色的来源，就是阿赖耶识，叫作名色缘识。</p><p>众生虽然有无明，但如果只有无明没有阿赖耶识，名色还是不能出生，甚至连无明也没有，所以众生出生的直接根源就是阿赖耶识，没有阿赖耶识，既没有无明，也没有生老病死，没有三界世间。因为是阿赖耶识产生了受精卵，那么受精卵这个名色，依靠着阿赖耶识才能生长和变异，所以名色直接来源于阿赖耶识，阿赖耶识也借助着名色才能显现出来。</p><p>离开名色，阿赖耶识就不能显现和起作用了，这就叫识缘名色，名色缘识，识和名色互相依赖。既然有阿赖耶识的存在，所以修行把十二因缘中的无明灭了，入涅槃以后，并不是成了一无所有的断灭空，还有涅槃本际阿赖耶识存在。十二因缘的每一支都以阿赖耶识为根本依，否则就成了无因而唯缘的谬论。如此四果阿罗汉和缘觉佛才敢入无余涅槃，因为涅槃不是断灭空。</p><p>六、意根在十二因缘中的决定性作用</p><p>众生有生老病死纯大苦聚，全部是因为有无明，而这个无明就是意根的无明，意根有无明才有思心所，之后才出现了六识的身口意行，有了身口意行，就会有业种的出现。十二因缘第二第三支分都是由于意根才出现的，六识的身口意行是随顺意根而有的，落谢下来的种子也是因为意根的心行而有，所以后世的名色就是因为意根的无明攀缘而有。所以意根对于生死有绝对的主导作用，对于其他法都有推动作用。意根染污六识就染污，种子就染污，名色苦受就多，尤其是三恶道的苦。</p><p>名色增长以后，出生六入，六入与六尘的触，由意根作主，意根攀缘多触就多，生死业就多，攀缘少触就少，生死业就少。触之后的受、爱、取，虽然有六识的受爱取，实际上起决定作用的，能引出下一支出生的是意根的受爱取，意根没有受爱取，就没有下一个支分出现。最后三支的有、生和老死，完全是因为意根的取出现的。所以生死轮回的出现，意根起着决定性的作用。</p><p>十二因缘阐明了意根是生死的根，解脱和沉沦都在于意根，要想了脱生死，就要解决意根的问题，破除意根的无明。意根也是四圣谛苦集灭道的根，苦是由意根无明心行促使六识造业而来的，集是意根促使六识造业落下的种子而来的，灭是灭除意根的无明心行，道是意根证法而得来的。</p><p>既然意根在生死轮回之中，具有如此巨大的决定性作用，那么意根就具足了一切心所法，具足了所有善心所法和烦恼心所法，以及不善不恶心所法，意根的心所法决定了五识的心所法，决定了意识的心所法。意根心所法改变，六识的心所法就改变，一切法都随之改变。如果不改变意根的心所法，六识的心所法即使改变了，也会再变回去。意根烦恼不断，意识即使断了烦恼，也会重新生出烦恼，意根没有禅定，六识即使有禅定，也持续不了多久，必然会再次散乱。所以意根在十二因缘中起着决定性的作用，修行意根就极其重要。</p></div>"
},{
    "title": "第二节 名词概念解释",
    "author": "生如法师",
    "date": "2022年03月20日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  名词概念解释</strong></p><p>一、名色的含义</p><p>色是指地水火风四大组成的色法，肉眼可见，如色阴。名是名字之法，肉眼不可见，但有作用，能作用于色身上，与色身组合成色阴，能被觉知和观察到，如：受阴、想阴、行阴和识阴。名色构成众生的五阴身，是众生生生世世的不实之我。这个我不坚固，能毁坏能灭亡，是生住异灭之法，因此不是我，假名为我。名当中包括意根及其作用，包括六识及其作用。</p><p>二、缘觉佛和独觉佛</p><p>辟支佛分为两种，一种是缘觉佛，另一种是独觉佛。缘觉佛是出生在有佛住世的时代，佛讲十二因缘法时，缘觉佛随佛修行十二因缘法，在甚深禅定中深细思惟参究因缘法，最后证得辟支佛果。实证五蕴世间都是因缘所生，缺少一个缘法则不生，既然是因缘所生成的法，就是空的，没有自性的，是无常的，证得了这个理就是缘觉佛。</p><p>独觉佛是在无佛无三宝住世的时候，自己独自思考世间的无常现象，慢慢摸索到十二因缘法，实证了十二因缘中的每个支分。独觉佛生生世世随佛修行，善根非常深厚，他此世来到人世间虽然没有遇到佛住世弘法，也没有佛法住世，但是因为前世所修的善根福德，看到世间的某一个现象，心中起疑，引起了深深地思考。比如秋风刮起来的时候，树叶从树上掉下来了，独觉佛看到以后心中生起疑问，为了弄清楚这个现象，就一个人到深山老林里独自修行，不断深入地思考参究这些生灭的现象。</p><p>独觉佛思考：人生下来还会死，树到秋天树叶落光了，到春天又长出来了，这是怎么回事？为什么万事万物都有生有灭呢？于是就一边修定一边不断地探索其中的因缘。每天静坐思惟，寻找万事万物产生的根源，这也叫禅修、思惟修。经过多年的辛苦修行，终于悟得十二因缘法，证得人无我，知道世间万事万物万法都是因缘所生，因缘所生的法就是空的假的无常的，从而证得了辟支佛果。</p><p>因为独觉佛有四禅八定，在证得辟支佛果的时候，由于三昧力，神通现前，以后他就用神通来度众生。如果他去乞食，众生布施给他饮食，他为了报答众生，就会示现神通，在空中行住坐卧，身上出水，身下出火，身上出火，身下出水，钻山入地，众生见了非常羡慕，于是就对佛法生起信乐，也就随其修行了。如果辟支佛在世间的缘尽了，就会入无余涅槃，离开这个世间，不再来三界了。</p><p>阿罗汉和辟支佛在证得涅槃以后，都会离开三界世间，佛法在世间也就不能继续传播下去了，那些受苦的众生就不能得度，所以佛说二乘人的慈悲心薄，他们只想自己灭苦，不考虑帮助众生也离苦。而菩萨们的慈悲心大，所有利乐众生的事业都不放弃，修行慈悲喜舍四无量心，发十无尽愿，生生世世广利众生，无有穷尽，直至成佛，永不入无余涅槃。成佛以后，再变化出无量无数的五蕴身来利乐无边的众生。</p><p>三、十二因缘和十因缘中的识各指什么</p><p>十二因缘，无明缘行，行缘识，识缘名色，这里的识是指六识，因为六识造作的身口意行，存下后世的业种，就会入胎才有后世的名色。而十因缘中的识缘名色，名色缘识，这里的识就不是指六识了。因为名色缘识的意思是，因为名色依赖这个识才能有生住异灭的现象，是先有这个识，后才有名色，才有六识。名色里已经包括六识了，所以六识是随着名色而有的，是生住异灭的，也是依赖这个识才能有生住异灭。那么名色缘识的识与六识就不是等同的关系，是生与被生的关系。这个识是先天地之先的根本识，是不生不灭能出生万法的阿赖耶识。</p><p>四、缘起性空的内涵</p><p>缘起性空是从小乘法空的角度，来观察如来藏所出生的一切法全部是世俗法，不是从大乘如来藏的角度来观察的。世俗里一切法都是由于因缘而起，形质都是空的、生灭的、败坏的、不久长的、不可得的、抓不住的。这就是从小乘法的角度来看世俗法的性质，而其因是发起一切法的源起源头，也可以说是从前造业的业种，包括善恶无记三种业。缘是促成和助发业种现行为果报的人事物环境，因缘具足，业果就实现了。凡是因缘所生法，当因缘变时，法也变。所以世间一切学问和治生产业，也会随之世间不断变化的缘而变化，不是固定不变的。</p><p>而出世间真理不是因缘所生法，也就不会改变，如果能改变，就不能称之为真理和圣谛了。只有第七识是无因无缘就存在着的，其实第七识的存在也有因，就是第七识的一念无明，如果这一念无明灭掉，第七识就会灭去不存在了。第七识的存在没有缘，无始劫以前就存在着，找不到生起的助缘，所以第七识没有开始，因为无明没有开始，就叫作无始无明。</p><p>既然一切法都是缘起性空的，因也是性空的生灭的，缘也是性空的生灭的，那么因缘灭去的时候，一切法也就灭了。这里并不涉及到大乘如来藏法，没有涉及到如来藏出生了这一切法，所以叫作小乘的空法。如果不涉及到如来藏，一切法空就没有落到根本点上，好像一切法是有，所以才缘起性空。其实一切法从大乘如来藏的角度来看，都是如来藏，并没有实质的一切法，一切法不生，所以也不灭，因为是如来藏的变相，那有什么生的、有什么可灭的？都不出如来藏之外。</p><p>小乘的空是败毁的空，大乘如来藏的空性，是不生不灭的空性心，二者本质不同，不可混为一谈。缘起性空是小乘法的那种空无，还没有涉及到大乘如来藏法的修行内涵，所以说缘起性空是不究竟的，还需要悟一切世间法的究竟义是什么，以及本质是什么。</p><p>证得阿罗汉果和辟支佛果以后，再转入大乘法中来修习如来藏法，证悟如来藏以后，再逐步观行五蕴世间法，就会知道五蕴与如来藏的关系，五蕴出生和灭亡的真相，彻底悟明如来藏的体性，五蕴世间的实质，无明灭尽，才能成佛。只悟得五蕴世间缘起性空，只是证得小乘方面的空，还不能成佛。</p><p>五、如何正确理解行缘识、识缘名色</p><p>首先是在佛经翻译上有可能存在误解，由于译经人的修证水平参差不齐，各种证量不同，还有的译经人根本没有证量，导致翻译的佛经在法义上有出入，一个人翻译是一个水准，多人翻译有多个水准。过去小乘行人都不懂意根，在翻译经典时遇到意根这部分法义，理解上就有偏差，有的根本理解不了。如果这个人禅定非常好，在修证上就能弥补这个不足，但在讲解和翻译经典上就没办法弥补这部分的不足了，导致后世没有禅定这部分人种种误解，无法实证，不得已就运用推理、分析和臆想。</p><p>如果学佛人在法义上还没有贯通，无法理解和实证意根，对于经典的认知就会出现误解和不通。比如十二因缘无明缘行行缘识这里，怎么想也想不明白这个行和识都指什么，二者之间的关系捋不清楚，运行的前后次序会搞颠倒。如果把行缘识的识理解为第七识或者是第八识，那法义就错得离谱了，什么行能产生第七识？只有第八识的行才能产生第七识，但是第八识又没有无明，无明缘行这里就解释不通了。什么行能产生第八识，世出世间任何行都不能产生第八识，那么行缘识、识缘名色的识就不是第七识和第八识，只能是六识。</p><p>那么什么行能产生六识？这里的六识实际上是指六识的业种，由身口意行才能产生六识的业种。身口意行与六识是平行并列的关系，所以六识不是身口意行产生的，六识的业种才是身口意行产生出来的。六识只能被第八识出生，第七识的无明是助缘，第八识随顺第七识的无明出生六识造作身口意行，存下六识的业种，作为后世出生五阴名色的因。这样一环套一环的运行下去，才有完整的十二因缘生死轮回苦。</p><p>六、诸法因缘生我说即为空</p><p>因，是一切法出生的内在动力，也可以说是业种，也可以说是过去世造作的业行。缘，是一切法出生所需要的外缘外力。业种的因，加上外在的缘，诸法才能出生。但是其中还有一个因由，那就是是谁通过因缘把诸法生出来的？这个因由无他，唯阿赖耶识尔。</p><p>譬如说小麦的出生，因是小麦种子，缘是气候土壤等等，因缘具足，小麦芽出生。但是小麦芽不能自己主动出生，还需要人为的把种子种到土壤里，施肥灌溉洒水透风，如果没有人工，即使有小麦种子，有地水火风，二者不能和合，小麦芽就不能出生。</p><p>同理，如果只有业种和外在的缘，没有阿赖耶识把二者统合起来，诸法就不会出生。因为诸法是用七大种子组合起来的，阿赖耶识里有这七大种子，也含藏业种，外缘外力也是诸法中的法，同样是七大种子组合，是阿赖耶识出生的，所以诸法不管是什么法，都是阿赖耶识出生的，也就是因缘所生。</p><p>既然诸法是因缘所生，那就是本来没有后天出生的，有生就会有灭，因缘灭的时候，诸法就会灭，所以诸法是空，因缘所生法是空，了不可得。</p></div>"
}]