[{
    "title": "大唐贞元续开元释教录 第2156部",
    "author": "圆照法师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>大唐贞元续开元释教录 卷上</p><p>甲戌岁西明寺翻经临坛<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>圆照集上</p><p>四朝应制。所翻经论。及念诵法。并修疏记碑表录集等。总三百四十三卷。并目录三百四十五卷。一百九十三卷经论及念诵法。六十四卷经论疏义。八十六卷贞元新集古今制令碑表记(并目八十九卷)</p><p>一百六十二卷经论及念诵法</p><p>玄宗朝金刚智<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。赠开府仪同三司。谥大弘教三藏和上。所翻译经已入目者总一部四卷所谓金刚顶瑜伽中略出念诵法四卷(亦云经) 八十一纸</p><p>右已编入开元释教录。不入今计中。玄宗朝所翻经遗漏未入古今录者。总五部六卷 大威力乌枢瑟摩明王经三卷 三十五纸 秽迹金刚说<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>大满陀罗尼法术灵要门一卷 五纸 秽迹金刚法禁百变法一卷 三纸</p><p>右件三部共五卷。并北<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国三藏沙门阿质达霰唐言无能胜将译 普遍智藏<a href=\"/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">般若波罗蜜多心经</a>一卷 二纸</p><p>右开元二十六年。东天竺国三藏沙门法月译。沙门利言译梵语笔受。今见在光宅寺。翰林待诏。其经本或有寄入<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经部龙字号帙中 金刚顶经瑜伽修习毗卢遮那三摩地法一卷 一十五纸 <a href=\"https://www.guang5.com/fxrm/fxcs/341370.html\" class=\"keylink\" target=\"_blank\">千手千眼</a><a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>大身咒本一卷 二纸 千手千眼观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨广大<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无碍大悲心陀罗尼咒本一卷 三纸 不动使者陀罗尼秘密法一卷 一十一纸</p><p>右四部共四卷。南天竺国三藏沙门跋日啰<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>(唐言金刚智)译。沙门智藏笔受。智藏后从号改名阿目佉跋折罗(唐言不空金刚)或单名不空。其有智藏笔受者。并编入大历目中。金刚智三藏开元二十九年八月十五日。卒于东都广福寺。广如行记及塔铭中明矣</p><p>右已上八部共同为一帙十卷</p><p>代宗朝大历中特进试鸿胪卿大广智不空三藏奏。玄宗肃宗今上以来三朝所翻经。总七十七部。共一百一卷。并都目一卷 金刚顶瑜伽真实大教王经三卷 四十三纸 金刚顶瑜伽般若理趣经一卷 八纸 观自在菩萨授记经一卷 十三纸 瑜伽<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>经一卷 二纸 奇特佛顶经三卷 六十八纸 观自在菩萨最胜明王<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>一卷 二十二纸</p><p>右六部共十一卷。同第一帙 金刚顶瑜伽文殊师利菩萨经一卷 二纸 阿唎多罗阿鲁力经一卷 二十一纸 普贤<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>赞一卷 五纸 地藏菩萨问法身赞一卷 五纸 出生无边门一卷 十纸 大吉祥天女经一卷 七纸 底哩<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>耶经一卷 十四纸 十一面观自在菩萨经三卷 二十四纸</p><p>右八部共十卷同第二帙 吉祥天女十二名号经一卷 二纸 金刚顶瑜伽十八会指归一卷 九纸 金刚顶瑜伽三十七尊分别圣位法门一卷(并序) 十三纸 菩提场所说一字顶轮王经五卷 七十八纸 宝箧经一卷 六纸 金刚<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>陀罗尼经一卷 二纸</p><p>右六部共十卷同第三帙 大孔雀明王经三卷 五十纸 大云请雨经二卷 十四纸 雨宝陀罗尼经一卷 五纸 蘘麌利童女经一卷 四纸 稻[卄/干]喻经一卷 八纸 大宝广博楼阁经三卷 四十五纸</p><p>右六部共十一卷同第四帙 菩提场<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>经一卷 二十二纸 除一切疾病陀罗尼经一卷 一纸 能净一切眼陀罗尼经一卷 二纸 施焰口饿鬼陀罗尼经一卷 四纸 三十五佛名经一卷 二纸 八大菩萨曼茶罗经一卷 三纸 叶衣观自在菩萨陀罗尼经一卷 八纸 诃利帝母经一卷 三纸 毗沙门天王经一卷 四纸 观自在菩萨说普贤陀罗尼经一卷 七纸</p><p>右十部共十卷同第五帙 文殊问字母品经一卷(题云文殊问字母品第十四) 三纸 金刚顶莲花部心念诵法一卷 三十三纸 金刚顶瑜伽千手千眼观自在念诵法一卷 二十八纸 无量寿如来念诵<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>一卷 十二纸 阿閦如来念诵法一卷 十纸 佛顶尊胜念诵法一卷 八纸 金刚顶胜初瑜伽普贤菩萨念诵法一卷 十三纸 金刚王菩萨念诵法一卷 十二纸 普贤金刚萨埵念诵法一卷 十二纸 金刚顶瑜伽五秘密<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>仪轨一卷 十二纸</p><p>右十部共十卷同第六帙 金刚寿命念诵法一卷 三纸 一字顶轮王瑜伽经一卷 六纸 一字佛顶轮王念诵仪轨一卷 十二纸 仁王般若念诵法一卷 十五纸 如意轮念诵法一卷 八纸 大<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>藏菩萨念诵法一卷 五纸 瑜伽莲花部念诵法一卷 七纸 圣观自在菩萨心<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>观行仪轨一卷 六纸 观自在多罗瑜伽念诵法一卷 十三纸 <a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>军咤利瑜伽念诵法一卷 十八纸</p><p>右十部共十卷同第七帙 花严入法界品四十二字观门一卷 六纸 文殊赞法身礼一卷 三纸 受<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>戒仪一卷 三纸 金刚顶瑜伽三十七尊礼一卷 四纸 般若理趣经释二卷 三十二纸 大曼茶罗十七尊释一卷 三纸 金刚顶瑜伽护摩仪一卷 八纸 都部陀罗尼目一卷 四纸 大乘缘生论一卷 十纸 七俱胝佛母陀罗尼经一卷 十九纸</p><p>右十部共十一卷同第八帙 大虚空藏菩萨所问经八卷 一百七纸</p><p>右一部共八卷同第九帙 仁王经二卷(并序)御制 三十五纸 密严经三卷(并序)御制 五十一纸 仁王念诵仪轨一卷 十九纸 仁王经疏三卷(此疏回入在下疏记帙中计)</p><p>右特进试鸿胪卿三藏沙门大广智不空奏。爰自幼年承事先师大弘教三藏和上。二十有四载。禀受瑜伽法门。后游五天。寻求所未受者并诸经论。更重学习。凡得梵本瑜伽真言经论五百余部奉为国家。详译圣言。广崇福佑。天宝五载却至上都奉玄宗皇帝。恩命于内建立灌顶道场。所赍梵经尽许翻译。及肃宗皇帝配天继圣。特奉纶旨。于内道场建立护摩及灌顶法。又为国译经助宣皇化。累奉二圣恩敕。先代三藏所有梵文并使搜访。其中有[绝-巴+日]索脱落。便令修补。其有未经翻者。续译奏闻。伏惟陛下。缵承皇运。大庇含灵。广辟<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。重明日月。恩波远被。法雨分流。四海宅心。万方兴载。是知佛之付嘱。允在圣君。不空叨承渥泽。荣幸实深。切自思之知何报国。先奉先皇圣制命阐微言。又承陛下恩命。恭遵遗旨。再遣翻译。利济群生。虽复四时精恳。未酬万一。是以区区于日夕。详译真言及大乘经典。冀效涓微。上资皇道。其所译金刚顶瑜伽法门。是<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>速疾之路。其修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。必能顿超凡境达于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。余部真言诸佛方便。其徒不一。所译诸大乘经典。皆是上资邦国。息灭灾危。星辰不愆。风雨顺叙。仰恃<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>辅成国家。纂集前后所翻译讫者。自开元至今大历六年。凡一百一卷。七十七部。并目一卷及题。笔受僧俗名字。缮写已讫。谨因降诞之辰。谨具进奉。庶得真言福佑长护圣躬。大乘威力永康国界。未翻梵本经中。但有护持于国福润生灵者。续译奏闻。不胜虔诚之至。敕旨依奏。仍宣付中外。并编入一切经目录。大历七年正月十六日。司徒兼中书令臣子仪宣。中书侍郎平章事臣元载奉。中书舍人奉敕旨。如右牒到奉行。大历七年正月十日</p><p>侍中门下侍部平章事王缙。给事中祠部牒大广智不空三藏牒奉敕如右牒至准敕故牒。大历七年二月九日。今史皇甫全牒。主事刘意。判官员外郎王遂</p><p>昔去大历六年十月十二日。特进试鸿胪卿三藏沙门大广智不空上表。至其月二十二日。中使李宪诚奉宣敕旨。赐不空三藏锦彩绢等共八百匹。同翻经十大德。各赐彩三十匹。时大德明日谢闻。沙门潜真等。言伏奉今月二十二日中使李宪诚至奉宣圣旨。翻经十大德。各赐彩三十匹者。潜真闻。垂教者法王。王<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>而示迹。行教者人主。主四海而流传。非法王无以开四句之文。非人主无以阐一乘之理。伏惟</p><p>宝应元圣文武皇帝陛下。道合天地。恩加草木。转轮驭极。灌顶称尊。运慈悲方便之门。当付嘱弘宣之位。然所译仁王虚空藏密严等八十部经者。并圆音至教。宝界真诠。无去无来。即身为<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>之身。不灭不生。诸佛是自心之佛。指虚空为库藏。现色相而庄严。演瑜伽之无穷。知真言而不竭。自非才行兼美定慧俱融。安能发扬幽微。弘宣秘奥。大广智不空三藏和上。言善两方。行通三密。得净满如来加持之力。奉宝应明主弘护之缘。由是理义昭彰。文句炳焕。潜真等<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>细尘。祇树小叶。识知荒鄙。学艺庸浅。幸蒙天睠。滥在翻经。承圣力而俯被。得赞润而修毕。虽曰愚瞽。犹知庆慰。况上契天慈。许宣中外。仍锡缣彩。以光愚拙。凡在法门不胜庆幸。无任戴荷。殊常之至。谨附中使李宪诚。奉表陈谢以闻。谨言</p><p>大历六年十月二十三日。翻译经大德大兴善寺上座沙门潜真等上表</p><p>宝应元圣文武皇帝批曰</p><p>师等。道行精深。智识弘远。三乘奥旨。千叶遗编。翻译流行。利济家国。薄申锡命。烦至谢恩。时大历六年十月十二日。上表陈请入目。时宝应元圣文武皇帝。省表具悉。宣付如前。为重师资而答表曰。和尚。夙事先朝。弘阐妙教。演兹贝叶。广示迷津。朕嗣缵丕图。恭承睿旨。和尚再加详译。今卷轴续毕。永济生灵。深可喜叹。其所译经。宜宣付中外入一切经目录。时大广智不空三藏。既荷墨制又宣付流行。踊跃屏营陈表奉谢。文曰。沙门不空言。中使李宪诚。奉宣圣旨。送新翻经目录。敕一道。答进经表敕一道。特令中外施行。仍入一切经目录。捧戴忻跃。喜荷无任。诚惧诚悚再叹再愧。伏惟。陛下承法王之付嘱。满人心之志愿。持普贤之密印。行天子之正教。浃辰之际。朗慧日于八方。在于顷刻。注洪泽于万物。斯乃普天幸甚。而况在不空者焉。然不空所翻圣典。四十余年。三朝已来赞修<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>志在宣传。上资王室。下润生灵。岂意夙心一朝愿满。圣恩广大。累劫难酬。况更特许翻译所是未翻梵本。倍增悲喜。敢罄竭心力。承奉圣旨。续译进奉。不胜欢悚怀恩之至。谨因中使李宪诚。奉表以闻。沙门不空诚喜诚愧谨言</p><p>大历七年正月二十七日特进试鸿胪卿三藏沙门大广智不空。上表</p><p>宝应元圣文武皇帝批曰</p><p>和尚久证菩提。入佛知见。所翻经论皆洞精微。爰命施行。式传慧照。颁示寰宇。广济含灵。未光慈航烦至陈谢也。既表谢讫。又奉纶言。翻译大圣文殊佛剎。精勤不息。卷轴又成。陈表进上 大圣文殊师利菩萨佛剎功德庄严经一部三卷 五十一纸</p><p>右不空先奉纶旨。令译此经</p><p>天恩曲临。并已成办。参挍唐梵。详定言音。年月处所。笔受证义。僧俗之名</p><p>咸题卷中。文殊事迹。缘起根由。始于<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。至成正觉。庄严<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。此经具载。诸佛理体。菩萨行门。法界有情。无生实相。分明表示。功德广大。余经罕俦。愿此胜因。上资圣祚。伏乞宣示寰宇以福生灵。特望天恩所是新置文殊院。大寺七僧小寺三僧。于文殊院中长时为国讲宣诵习。有阙续填。是使法灯继明不绝。灵神庶类孰不欢心。幸因轮王降诞之辰。<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>喜贺同欢之日。冀兹景福上益寿山。愿以法流添于圣。海谨随状陈进以闻。如天恩允许。请降墨敕。依大历八年十月十三日特进试鸿胪卿三藏沙门大广智不空上表。其月日也。三藏和尚在内道场。敕赐三藏和尚锦彩绢等共七百匹。同翻译经大德潜真等十人。各赐锦彩三十匹充嚫。成就妙法莲花经王 瑜伽观智仪轨一卷(二十五纸)</p><p>右通前仁王密严等经。总五部共十卷。同第十帙</p><p>新翻译仁王护国经者。昔永泰元年状请也。仁王经望依梵夹再译旧文。右兴善寺三藏沙门不空奏。伏以。如来妙旨慧洽生灵。仁王宝经义崇护国。前代所译理未融通。润色微言事归明圣。伏惟。宝应元圣文武皇帝陛下。睿文启运。浚哲乘时。弘阐真言宣扬像教。皇风远振。佛日再明。每为黎元俾开讲诵。其仁王经望依梵夹。再译旧文。贝叶之言永无漏略。金口所说更益详明。仍请僧怀感飞锡子邻建宗归性义崇道液良贲潜真应真慧灵法崇超悟慧静圆寂道休等。于内道场共翻译。福资圣代泽及含灵。寇盗永清。寰区允穆。传之旷劫。救护实深</p><p>中书门下牒祠部牒奉敕宜依牒至准敕故牒永泰元年四月二日牒。中书侍郎同平章事杜鸿渐。中书侍郎同平章事元载。黄门侍郎同平章事王缙。检校侍中李使。检校右仆射平章事使检挍左仆射平章事使。中书令郭子仪使。<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>祠部。仁王经望依梵夹再译旧文。兴善寺沙门不空</p><p>牒奉中书门下敕牒如右牒至准敕故牒。永泰元年四月四日令史张济牒。主事杨献郎中崔漪恩旨颁下。爰命京城义学大德良贲等。翰林学士常衮等。于大明宫南桃园详译仁王。并校定密严等经。至四月十五日译毕进上</p><p>圣慈制序题在经初。披阅内宫未宣中外。时京城大德翘想甘露。如渴思浆。录表上陈。乃为词曰</p><p>沙门乘如等言。乘如闻。日月行于六合。求照者昆虫。雨露垂于九霄。希润者草木。所谓覆载不间亭育无私。则蚊蚋可逸于长风。蛙蝇可游于沧海者也。伏惟</p><p>宝应元圣文武皇帝陛下。庆承尘劫。信植河沙。威摄魔界。声流佛剎。以宝位之重。崇宝偈之微。以金轮之尊。腾金口之教。百王千帝曷可同年而语哉。乘如等幸逢昌运。叨寓玄门。常思讽诵以答皇泽。伏承。顷有恩旨请不空三藏及义学沙门等。再译仁王般若波罗蜜多经。教理兼着性相周圆。缄在龙宫未颁鹿苑。僧等昧死敢以请闻。伏愿。天慈示之法宝。兼欲依经请百法师置百高座。同宣句味共殄妭氛。愚诚则然。裁惟圣旨。无任慊款翘渴之至。谨诣右银台门。奉表陈请以闻。轻冒天威。伏深战越。谨言</p><p>永泰元年八月八日大安国寺上座临坛大德沙门乘如等上表</p><p>宝应元圣文武皇帝批答曰</p><p>仁王真经理端义邃。化流贤劫福利苍生。师等咸愿敷陈助宁国土。所请开讲者。依时有恩旨。取二十三日。于资圣西明两寺。共置百座。请百法师讲仁王经。及百大德转密严等。香花饮食鼓乐弦歌。并出有司。不得阙乏</p><p>时属秋雨霖霪不休。所司奏闻请更延日。奉进止两寺百座。先令二十三日迎经。为霖雨宜改至二十六日迎经开讲。其诸司供料着人计会。准改日造。永泰元年八月二十二日。左监门卫将军知省事刘清潭宣改期甫至天雨未晴。恩旨又延九月一日。是日也两街大德。严洁幡花幢盖宝车。太常音乐梨园仗内及两教坊。诣银台门百戏系奏。时观军容使兼处置神策军兵马事开府仪同三司兼左监门卫大将军知内侍省事内飞龙厩弓箭等使上柱国凭翊郡开国公鱼朝恩与六军使陈。天龙众八部鬼神。护送新经出于大内。其经适出。彩云浮空郁郁纷纷昭彰异瑞。洎乎己午。两寺开经万姓欢心。祥云方隐。缁素瞻仰。获庆非常。三藏不空上表谢曰。沙门不空言。不空道乏前修学亏曩哲。猥承纶诏翻译真经。若履春冰。犹临泉谷。伏惟。陛下拨开慧日布荫慈云。睿思风飞龙章玉润。躬为序述昭焕大千。流法雨于九天。树胜幢于百座。威仪容止。宛释迦之下鹫峰。士庶骈阗。犹波斯之诣王舍。庆云呈瑞喜气浮空。足表大阶之平。自协无疆之佑。不胜戴荷之至。谨奉表陈贺以闻。沙门不空诚欢诚喜谨言</p><p>永泰元年九月二日大兴善寺三藏沙门不空上表</p><p>宝应元圣文武皇帝答曰</p><p>和尚远自莲宫亲缄贝叶。敷演玄教利济苍生。翻译既成天人合会。朗三秋之霁景。开五色之祥云。阐扬真乘符契妙理。顷因指喻早结师资。睹此感通弥深顶敬</p><p>时左右六军使。睹此庆云。亦陈表奉贺。词曰。臣仙智等言。昨日迎新译仁王护国般若波罗蜜多经。伏有庆云应现。瑞呈五色彩散一天。抱慧日而逾鲜。顺祥风而表圣。伏惟。陛下。以大道赖物。以至德临邦。精诚感神灵应斯降。臣等职忝侍卫。久沐淳风。亲睹祯祥无任庆幸。谨诣右银台门。奉表陈贺以闻。臣仙智等诚惶诚恐顿首顿首谨言</p><p>永泰元年九月二日特进右龙武军大将军知军事上柱国徐国公臣刘仙智等上表</p><p>宝应元圣文武皇帝答曰</p><p>不二之门早传秘藏。重宣其义。庶广其言。将敷贝弃之文。用启莲宫之会。天浮瑞色。日丽庆云。现以神通。彰其瑞应和平之兆。庆慰同怀。所贺知尔从是初日至白月终。两上讲经二时行道。饮食茶药并出有司。六律五声昼夜不绝。至十六日西明散斋。鼓乐弦歌百戏弥日。西明讲终。陈表奉贺。词曰。西明寺上座沙门怀感等言。特奉恩命。令开百座讲仁王护国般若经。以今日经周设斋庆毕。凡是生灵不胜捲尽7?┍菹隆T僭焯斓亍C髌肴赵隆4挂轮?尽V匾胝婢?Jバ姆鹦耐?橐焕怼L蒲澡笥锊桓羰夥健9峄ㄖ?时肝拧4?浦??啥谩=鹕??缑掷障律?S窬┲?新滞醭鱿帧G锾炖鼍啊&lt;陴=?伞2试聘】铡5n气必尽。吾君至圣。佛力至慈。法润恒沙。天下幸甚。怀感等忝栖祇树。喜跃无涯。稽首焚香何阶上答。其功德数别状封进。谨奉表陈谢以闻。诚欢诚喜谨言</p><p>永泰元年九月十五日西明寺上座沙门怀感等表进</p><p>宝应元圣文武皇帝答曰</p><p>师等演畅真经弘宣妙旨。用滋仁寿拯护生灵。<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>既终当同庆也</p><p>时仆固怀恩。背逆天恩。远自灵武合聚蕃丑。凭凌泾阳。西明百座大德法师。同赴资圣。奉敕。应先西明寺百座法师大德。并赴资圣寺佛殿。为国传经行道。其资圣寺百座法师良贲等五十座。依前讲说仁王般若护国密严等经。普及苍生。其京城诸寺观僧道等。并二时于当处转经行道。仍令三纲差了事僧专知检校。务在精修。不在疏怠。李元琮贾明观等专知句当。永泰元年九月十七日。高品李希逸宣。尔时两街大德百座法师。准敕咸皆萃资圣寺。二时讲唱两上转经行道。午时及与日暮。供设音乐无易于初。夜后悉集大讲堂内。举众齐声称念摩诃般若波罗蜜多。为国为家。愿无忧惧。京城寺观转念亦然。时制使关内河中副元帅司徒兼中书令上柱国汾阳郡王郭子仪杖节出师。亲总戎律发于帝里。洎彼泾阳。凭恃天威。赖兹经力。两军交对列阵相望。钲鼓发声剑戟如雪。时汾阳王单骑直出。挺立军前感激一言。怀恩屏退。西戎北狄各自相攻。浃旬之间王国大定。是知仁王护国般若真经。圣心<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>子育万姓。其义一也。然后收军整律振旅还京。亲对天颜特蒙赐赉。敕资圣寺百座道场。取闰十月二十二日。设无遮斋以成庆散。是日也寺南门外陈布道场。尽正一坊东西街内。弈幕云布幡花丽天。尊容焕然光照人里。饭僧既毕。六乐争陈。百戏充盈。歌吹尽日。京城大德各嚫三十。不空三藏赐九百匹绢帛锦彩。以充数焉。侍者小僧各五十匹。又特降恩旨。赐资圣讲堂名。为永泰善法之堂。此即万古千秋法门故事也。自蕃戎入境。夜集僧徒。共念摩诃般若波罗蜜多于此堂内。未盈累月果得清平。此乃圣力经威感斯福应。翻经百座赐赉珍财。自<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>东流。莫上于兹日也。至十一月一日。恩旨荐臻。敕不空三藏和上。故金刚三藏。天资秀异气禀冲和。识洞四生心依<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。爰自西域杖锡东来。以梵行周身。慈心济物。觉花外照。智炬内明。汲引群迷。证通圆寂。密传法印。示隐<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>。衣钵空存。音徽长往。教能垂后。礼有饰终。宜旌美名。俾协荣赠。可赠开府仪同三司。仍赐号大弘教三藏。同日又降鸿恩再及敕不空三藏莲宫释种香界导师。性表真如。学精秘藏。承绀园之妙旨。开示四依。译金口之微言。津梁六趣。身持梵夹远涉流沙。传灯益明。甘露溥润。散慈云于火宅。扬慧日于幽涂。顷者躬问胜因弘旨方便。永决疑网。滋予智芽。虽出尘之心齐谢于名位。而褒崇之典。式旌于贤哲。俾应嘉命用协朝章。可特进试鸿胪卿。仍赐号大广智不空三藏。伏以。母以子贵。俗礼恒规。师因第荣。释门罕有。恭受荣命。喜惧感怀。捧戴屏营。陈表谢曰。三藏沙门不空言。奉今月一日制锡。故大和上金刚三藏。可赐开府仪同三司。仍赠号大弘教三藏。不空特进试鸿胪卿。仍赠号大广智不空三藏。一雨自天润流根叶。圆毫发艳照及幽明。捧戴傍偟悲喜交集。不空诚欢诚喜以凄以惧。不空闻。十号者表德之殊称。九卿者象河之重位。故大和上道洽传灯。诚以彰其遗烈。不空门惭绍构。虚并荷于鸿私。犹燕石之混光。同齐竿之滥吹。荣兼存殁。宠及师资。祇奉兢惊瞻言腼恧。况<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>落彩本忘荣辱。洁诚报国僧者通规。陛下。广运金轮。曲收瓦砾。引安禅于中禁。旌褎崇之殊礼。虽负山无力。而践迹近宾。亏高谢之法流。点少欲之清躅。是以面奏三让言烦九重。冀殷鉴于恳诚。岂礭然之不拔。羊车稚子。惭广智而茫然。鹿苑卑材。愧鸿胪而甚矣。无任感戴之至。谨奉表陈谢以闻。沙门不空诚欢诚恐谨言</p><p>永泰元年十一月五日特进试鸿胪卿大广智不空三藏大兴善寺沙门不空表进</p><p>宝应元圣文武皇帝答曰</p><p>和上道秘双林。功超正觉。远从天竺来布真言。顷得归依亲承付嘱。褎崇之典礼秩攸先。俾增印绶之荣。式重师资之敬。兼申宠赠庶表追荣也</p><p>自译仁王真经。洎请编入目录。爰进文殊佛剎功德庄严经。逮于薨年。翻经如后 金刚顶胜初瑜伽经中略出大乐金刚萨埵念诵仪轨一卷 十一纸 大乐金刚萨埵修行成就仪轨一卷 十五纸 大药叉女<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>母并爱子成就法一卷 十二纸 普遍光明大随求陀罗尼经二卷 三十二纸 金刚顶超胜三界经说文殊五字真言胜相一卷 三纸 五字陀罗尼颂一卷 八纸 圣阎曼德迦威怒王立成大神验念诵法一卷 八纸 文殊师利菩萨根本大教王金翅鸟王品一卷 一纸 不空罥索毗卢遮那佛大灌顶光真言一卷 二纸</p><p>右九部共十卷经法同第十一帙 圣迦抳忿怒金刚童子菩萨成就仪轨经三卷 四十八纸 大威怒乌刍涩摩成就仪轨一卷 十纸 佛说摩利支天经一卷 四纸 金刚顶经一字顶轮王成佛仪轨一卷 八纸 佛为优填王说王法政论经一卷 九纸 大方广如来藏经一卷 十八纸 佛说一髻尊陀罗尼经一卷 十四纸 速疾立验摩醯首罗天说迦娄罗阿尾奢法一卷 六纸</p><p>右八部经法共十卷同第十二帙 大日经略摄念诵随行法一卷(亦名五支略念诵要行法) 二纸 大毗卢遮那成佛神变加持经略示七支念诵随行法一卷 三纸 木患经一卷 一纸 文殊五字念诵法一卷(题云金刚顶经瑜伽文殊师利菩萨仪轨<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>法一品) 七纸 并有梵字 十四纸 曼殊室利童子菩萨五字瑜伽法一卷并梵字 二纸 金刚顶降三世大仪轨一卷(亦名观自在心真言一切如来莲花大曼茶罗品) 四纸 文殊师利菩萨及诸仙所说吉凶时日<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>宿曜经二卷(上卷前译下卷后译有序共四十纸) 金刚顶经观自在王如来修行法一卷 六纸 金刚顶瑜伽中发阿耨多罗三藐三菩提心论一卷 亦名瑜伽总持教门说菩提心观行修持义 七纸</p><p>右九部经论法共十卷同第十三帙 瑜伽金刚顶经释字母品一卷 二纸 修习般若波罗蜜菩萨观行念诵仪一卷 七纸 仁王般若陀罗尼释一卷 七纸 成就大<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>自在莲花部瑜伽念诵法门一卷亦名观自在大悲成就瑜伽 十二纸 大孔雀明王画像坛场仪轨一卷 四纸余 金刚手光明灌顶经最胜立印圣无动尊大威怒王念诵仪轨法品一卷 十一纸 末利支提婆花鬘经一卷 十一纸 大圣天欢喜双身毗那夜迦法一卷 三纸 观自在菩萨如意轮瑜伽一卷 九纸 金轮王佛顶略念诵法一卷 三纸 金刚顶瑜伽降三世成就极深密门一卷 三纸</p><p>右十一部经法共十一卷同第十四帙</p><p>大广智不空三藏和上。本讳智藏。号不空金刚。梵云阿目佉跋折罗。本西域人也。昔事大弘教金刚智三藏和上。禀受真言。二十四年枢衣请益。大师殁后还诣五天。梵本瑜伽备皆披阅。周游遍览旋赴帝京。或化河西。或居岭表。或居关内。或处王宫。翻译真经不遑寝食。属天宝末载胡马入关。至德二年克复京洛。和上亲承圣旨为灌顶师。妃主降阶。六宫罗拜。三朝宠遇。恒建道场。详考幽微。卷不释手。内宫译者随竟上闻。或已宣行。或留中禁其已得者具录如前。其未获者一心求访耳。和上精勤不怠多历岁时。洎大历九年。示有微疾。制使劳问。天降名医。针药相仍。晓夕继至。疾将未损。震极不安。天慈曲临锡以官封。敕大道之行。同合于异相。王者至理。总归于<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。方化城之齐致。何儒释之殊途。故前代帝王罔不崇奉。法教弘阐与时偕行。特进试鸿胪卿大兴善寺三藏沙门大广智不空。我之宗师。人之舟楫。超悟三学。坐离于见取修持万行。常示于化灭。执律舍缚。护戒为仪。继明善教之志。来受人王之请。朕往在先朝。早闻道要。及当付嘱常所归依。每执经内殿开法前席。凭几同胶序之礼。顺风比崆峒之问。而妙音圆演密行内持。待扣如说自涯皆晤。涤除昏妄。调伏魔冤。天人洗心于度门。龙鬼受职于神印。固以气消灾厉。福致吉祥。实惟弘我之多。宁止利吾之美。尝有命秩用申优礼。而得师为盛。味道滋深。思复强名。载明前志。夫妙界有庄严之土。内品有果地之殊。本乎尚德。敬顺时典。可开府仪同三司。仍封肃国公。食邑三千户。余如故。大历九年六月十一日</p><p>三藏和上再蒙恩宠官封增新。然气力转微无由谒见。至十五日修表上辞。其文曰。沙门不空言。不空幼事先师已过二纪。早承天泽三十余年。演瑜伽之法门。奉累圣之恩眄。自从陛下临御殊私转深。赐黄合以宴居。降紫微而问道。积恩重叠日月相继。虽复精恳岂酬万一。而露电难驻。蒲柳易衰。一从伏枕自春徂夏。陛下深眷存问再三。中使名医相望道路。但以膏肓之病。虽针药而难生。生灭之资宁恋惜而能固。忽从昨夜已来顿觉气力弥惙。身非己有。瞬息奄奄心神浸微。违谢圣朝不任恋慕。不空今者。年过中寿未为夭逝。但以往时越度南海周游五天。寻其未闻。习其未解。所得金刚顶瑜伽十万颂。诸部真言及经论等。五十余万颂。冀总翻译少答国恩。何夙愿之未终。忽生涯之已尽。此不空所以为恨也。伏惟。陛下。降诸佛之慈慧。下从人之所愿。不空先进大圣文殊佛剎经。圣情寻许颁示中外。伏愿哀愍念<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>之言冀福皇家滋吉祥之万劫。实为僧<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>死荣幸。五钴金刚铃杵。先师所传。并银盘子菩提子水精念珠并合子。并谨随表进奉。临纸涕泣悲泪交流永辞圣代。不胜恋慕之至。谨附监使李宪诚奉表陈辞以闻。沙门不空诚悲诚恋谨言</p><p>大历九年六月十五日开府仪同三司肃国公三藏沙门大广智不空上表</p><p>宝应元圣文武皇帝答曰</p><p>和上行登十地来自五天。敷演瑜伽宣流梵夹。周游万里践历三朝。光译圣言。亲承师受。当下武之兴运。继前薪之火传。而弘菩萨心为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>病。弥留有问。震悼增深。宜依所请也</p><p>尔时开府仪同三司试鸿胪卿肃国公大广智不空三藏和上表陈情 圣恩垂涕。墨制旋降所请皆依和上情礼获申。一心观行。右胁累足怗然。而薨。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>号踊。中使奏闻。圣上震悼殊深。辍朝三日。爰降中使诣于僧蓝。宣慰众徒乃锡赙赠。绢三百匹布三百端。白米粳米各五车。白面亦尔。柴十车油七石炭三车。并如京宣索如无准无奏来当别支送。至其月二十八日。敕内侍韦守宗。送绢七百五十二匹。充先师造灵塔直。洎十月五日。追赠司空。圣眷殊深。又锡谥号敕寂灭为乐。所以归于真。付嘱有缘。所以尊其称。循其故事其或强名。故开府仪同三司试鸿胪卿肃国公大兴善寺三藏大广智不空。德盛道高。朕所师仰。心密法印。行<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>门。精微有说。广大<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。一雨之润。溥洽于群生。百灯所传。遍明于正觉。傍达义趣。博通儒玄。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之情合若符契朕顺风前席积有岁年。慈航不留梁木其坏。徽音永隔震悼殊深。论道之官追严师礼。仍加谥号用副名实。可赠司空。仍谥大辩正广智不空三藏和上。洎六日癸卯陈设葬仪。迁神城南茶毗供养。皇帝遣内给事刘仙鹤。以香茶之奠。敬祭故大辩正广智三藏和上之灵。惟灵智识明晤天资聪达。夙殖梵行生知胜因。挺秀五天周游万里。心蕴海藏音通华戎。贝叶传经。瑜伽演教。弘利兆庶。出入三朝。道在不言。理均无迹。涅盘常寂至圣同归。焚香澡身与化而尽。朕顷承了义礼具师资。永诀之辰攸深震恸。香茶之奠。有灵照之。是日也宰臣中贵神策六军御史大夫京兆大尹尚书仆射侍郎列卿诸卫将军。各申奠祭。其余缁素不可具陈。七日平晨又陈表谢。草土沙门惠朗等言。昨六日先师茶毗之夕。圣慈哀悼追赠司空。仍谥号大辩正广智不空三藏和上。照宣国礼宠光神道。三公之赠有越旧章。和上之称先经未载。是知高天之泽。浸江海而无涯。幽途之灵。蒙日月而下照。凡日弟子数千众人。悲感圣恩无任戴荷。谨附中使李宪诚。奉表陈谢以闻。沙门慧朗等诚惶诚愧谨言</p><p>大历九年七月七日大兴善寺草土沙门慧朗等表上</p><p>宝应元圣文武皇帝批曰</p><p>和上发迹五天周游万里。宣演正法拯悟生灵。涅盘归常。考行崇谥礼经斯在。烦以谢恩。同日又奉敕语僧慧朗等。专知检校院事。兼及教授后学。一尊一契有次第者闻奏。其日又奉敕语僧慧胜。和上在日阿师子偏得意旨。今闻于塔所焚香火守护。先于和上边受得普贤念诵法。与朕同尊。努力进修三年满后即来对朕与商量本尊法。所请任依。是时也火灭已后收得遗身。髅顶等中皆有<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。光明莹净皎若琉璃。具以上闻。圣情哀悼。内宫稽首置在道场。至十五日。又敕句当京城诸寺观修功德。使开府仪同三司右龙武军大将军知军事上柱国凉国公李元琮。故大辩正广智不空三藏和上。塔所修造宜令且停。别择好地起修。洎八月二十八日。又敕语元琮。故大辩正三藏。茶毘得舍利。令于当寺院造<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>三。造塔毕建立丰碑。银青光禄大夫御史大夫上柱国冯翊县开国公严郢撰文。银青光禄大夫彭王传上柱国会稽郡开国公徐浩书字。论曰。自古高僧硕德宠遇殊恩。生时则荣。殁则已矣。今大辩正三藏和上。则不如是。生承恩渥历事三朝。授以列卿品加特进。及卧疾也劳问相仍。中使名医晨夕相继。特加开府封肃国公。洎乎薨焉。上弥震悼辍朝三日。赐赠增优。授以司空。谥大辩正。仍号和上。先古未闻。城外茶毘寺中起塔。不日不月悉成就焉。兼树丰碑纪其<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。冠绝今古首出僧伦。亚相作文。王傅书字。斯乃万代不朽也。此之所述略举大纲。若欲具知。备如赠司空大辩正广智三藏表制集中广说</p><p>今上圣神文武皇帝朝所翻经 大乘理趣<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>多经十卷 一百六十纸 大花严长者问佛那罗延力经一卷 二纸 般若波罗蜜多心经一卷 二纸</p><p>右三部经共十二卷同一帙</p><p>般若三藏续翻。译经图纪曰。昔秦主姚氏有连理树生于庙庭。龟兹罗什践西凉而入贡。今我皇睿哲。合蔓苽生于御苑。罽宾龙象泛南海以来朝。手持梵经六波罗蜜。大臣闻奏。帝俞其言。制委有司精选硕德。就西明寺译讫奏闻者。即般若三藏法师其人矣。法师梵名般剌若(唐言智能)。北天竺境迦毕试国人也(言罽宾者讹略)姓乔答摩氏(言瞿昙者讹略不正)。颖悟天假。七岁发心。违侍二亲归依<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。时依大德名调伏军。诵四阿含满十万颂。阿毗达摩二万颂。余又乃随师诣迦湿蜜。至年二十具足<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>诵。萨婆多近四万颂。及<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>诵二万八千。并大婆沙兼受其义七年。此国学习小乘。至二十三诣中天竺那烂陀寺。受学大乘。<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>瑜伽中边等论。及声明论与<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>因明医明工律论等并。依智护进友智友三大论师时乃。游从双林八塔往来。瞻礼一十八年时闻南天尚持明藏。遂便往诣谘禀未闻。有灌顶师厥名法称授瑜伽教入曼茶罗三密护身五部契印。如是承奉住经一年。诵满三千五百余颂。尝闻支那大国文殊在中。东赴大唐誓传<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。泛海东迈驾险乘航。垂至广州风飘却至执师子国之东隅。又集资粮坚修航舶备历南海。路次国中二十二年。垂至广府。风吹舶破平没数船。始从五更洎平日出。或漂或溺。赖遇顺风。所持资财梵夹经论。遭此厄难不知所之。及至海壖已在岸上。于白沙内大竹筒中。宛若有神。叹未曾有。是知大乘理趣六波罗蜜经。与大唐国中根缘熟矣。东行半月方达广州。洎建中三年届于上国矣。至贞元二祀访见乡亲。袖策十将罗好心即般若三藏舅氏之子也。悲喜相慰将至家中。用展亲亲。遂留供养。既信重三宝。请译<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。乃与大秦寺波斯僧景净。依胡本六波罗蜜译成七卷。时为般若不闲胡语。复未解唐言。景净不识梵文。复未明释教。虽称传译未获半珠。图窃虚名匪为福利录表闻奏。意望流行。圣上睿哲文明允恭释典。察其所译理昧词疏。且夫释氏伽蓝大秦僧寺居止既别。行法全乖。景净应传弥尸诃教。沙门释子弘阐佛经。欲使教法区分人无滥涉。正邪异类。泾渭殊流。若网在纲有条不紊。天人攸仰<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>知归。分命有司乃下制曰。中书门下牒王希迁牒奉敕。释教深微道俗虔敬。皆因梵本法被中华。宜令王希迁与所司精选有诸行僧。就西明寺重更翻译讫闻奏。牒至准敕故牒。贞元四年四月十九日牒。次牒祠部准敕亦然。转牒京诚诸寺大德。罽宾三藏沙门般若。宣译梵本。翰林待诏光宅寺沙门利言译梵语。西明寺沙门圆照笔受。资圣寺沙门道液。西明寺沙门良秀。庄严寺沙门圆照。并润文。慈恩寺沙门应真醴泉寺沙门超悟。光宅寺沙门道岸。西明寺沙门辩空并同证义。自六月八日欲刱经题。敕街西功德使兼句当右神策军使营幕使元从兴元元从镇军大将军行右监门卫将军知内侍省事上柱国大原县开国伯王希迁。亲奉纶旨。与奉天定难功臣骠骑大将军行右神策军大将军知军事检校工部尚书兼御史大夫上柱国武都郡王孟涉。宝应功臣元从骠骑大将军行右神策军大将军知军事兼御史中丞上柱国静戎郡王食实封五十户马有麟等。送梵本经。六律五声八音合韵。四部云集歌呗交喧。箫韶沸天鼓钟震地。发彼禁闼出芳林门。车骑满于天衢。士女溢于闾里。入西明寺翻译真经。同日恩赐钱一百千文。[木*茶]三十钏。香一大合。以充译经院供养。开题名曰大乘理趣六波罗蜜多经也。自后日来月往两上翻经。十月中旬译文周毕。至十一月十五日缮写复终。二十八日大设威仪彩车音乐。入于光范甫光顺门。修表上闻奏进新经入其文十卷品十亦然。敕旨再三往来劳问。仍于禁以设斋餐。赐般若法师绢一百匹一副冬衣。余之十人各五十匹衣一副。检校二人各三十匹衣一副。以充嚫焉。三藏法师般若捧戴惭惶。乃于此时陈表谢曰</p><p>沙门般若言。伏以生自罽宾。十四离乡南游天竺。闻所未悟二十余年。巡礼圣踪双林八塔。大小乘学誓报四恩。远慕支那聿来瞻礼。自持梵夹经典中国未传。每思上达无由进献。昨因表兄右神策十将新平郡王罗好心身参戎卫。遂与奏闻。得彻圣听。实为多幸。陛下崇教信受大乘。命以缁徒许令翻译。微僧至愿斯以为。终誓奉精修上资皇祚。谨诣光顺门。奉表陈谢以闻。沙门僧般若诚惶诚恐谨言</p><p>贞元四年十一月二十八日罽宾国沙门般若上表</p><p>圣神文武皇帝批曰</p><p>师夙诣证源早观秘藏。周游西土历访大乘。得心地之溃言。是如来之妙行。期于宣布以广玄门。远负真文来传中夏。经途万里克达京师。载扬罗什之风。重继摩腾之迹。眷言精悫朕甚嘉焉。爰命道流俾加翻译。庶兹上法永以流行。省视表章烦有陈谢。同日请译经施主三藏表兄。右神策马军十将奉天定难功臣开府仪同三司检校太子詹事上柱国新平郡王臣罗好心上。表谢曰臣。好心言表。弟罽宾国沙门僧般若先。进大乘理趣梵夹六波罗蜜经伏奉今年四月十九日敕。宜令王希迁精选有道行僧。于西明寺翻译今经。帙已终者。臣好心诚欢诚喜。顿首顿首臣闻周星隐曜。汉梦驰光。始知灵瑞感人。必委明王而导化。是以再敷龙树重阐真宗。伏惟。皇帝陛下。泽覃中外恩被生灵。声教远通无为而理。微臣表弟十四离乡。志慕缁流迹现<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>。昨所进经本。稽梵夹大乘理趣曰六波罗。陛下信崇特令翻译。功勤靡辍今帙告终。特赐幡花又令重进。微僧为幸惊宠伏深。臣家西蕃得居中国。名参戎禁荣及私门。父子相欢实惭天地。僧人何德更蒙委曲。洪私愿奉修持福资皇祚。臣之多幸誓死答恩。载喜载欢。无任捲局?痢=饕韫馑趁拧7畋沓滦灰晕拧3己眯某匣坛峡侄偈锥偈捉餮</p></div>"
}]