[{
    "title": "大宋僧史略 第2126部",
    "author": "赞宁大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>大宋僧史略 卷上</p><p>大宋僧史略 (并序)</p><p>僧史略序</p><p>赞宁姓高氏。其先渤海人。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>杭之祥符。习南山律。著述毗尼。时谓律虎。赐号明义宗文。太平兴国三年。太宗闻其名。召对滋福殿。延问弥日。更赐通慧。敕住右街天寿寺。命修僧史。又诏修大宋高传三十卷。及三教圣贤事迹一百卷。又着内典集一百五十卷。外学集四十九卷。内翰王禹儞作文集序极其赞美。至道中示寂。崇宁四年。加谥圆明。如僧传排韵第二十四引释闻正统第三<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>通载第十八稽古略第三。惟夫作者以博达之资列事物兴废者凡五十九条。以示诸新学。可谓千载赵璧矣。从事佛乘者。谁得不仰余光乎。然而本书但有庆长旧板一本而已。流行亦甚寡矣。颁典教社诸士窃慨叹之。将改刻弘于世。嘱予以校订。予也拙陋岂能得尽之乎哉。苟有不可者则待后鉴。适为寒乡乏书者。揭作者略传。并为此之序 时治治十六年四月佛生日<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>行诫识于三缘山山房</p><p>重开僧史略序</p><p><a href=\"/remen/foshu.html\" class=\"keylink\" target=\"_blank\">佛书</a>所载。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>鬼畜.北俱卢州.长寿天.佛前佛后生.便盲.聋.喑.哑.世智辩聪.不信毁谤<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧者。名八难处。又曰八无暇。盖生其处者。障难深重无暇修心。不知<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。长劫驱驱<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>不息故也。是知世聪俗慧不达佛书。则理昧正真事同盲聩。矜伐炫耀自为已能。沮善诋僧佛所不救。生遭贬谪死入阿鼻。违逆皇天招延世乱。皆此辈也。致乱皆因蠹善。具载佛书 本朝王内翰(禹儞)。生平著述排诋释氏。虽唐韩退之吾宋欧永叔佛书所谓天魔波旬阐提外道。无以加也。间遇英杰之僧。亦心重之。余尝读王公(偊儞)文集。有赠僧录通慧学公诗曰。诏修僧史浙江滨。万卷书中老一身。赴阙尚骑支遁马。援毫应待仲尼麟。溟蒙雪彩松窗晓。狼籍苔花竹院春。还许幽斋暂相访。便令陶令满衣尘。其意窃比陶彭泽谒远法师故事。而自高之也。欧阳文忠公亦录王内翰宁僧录元夜观灯嘲谑之言。有秦郑不爱未坑之语。王又述宁之墓志。则有心慕诚服之意。叙宁有文集一百七十卷。见行于世。王之毁僧破佛。蜂虿枭獍吠尧弹凤。天下皆知矣。独于通慧友爱相师。赋诗述铭以褒美之何也。盖通慧学行才识兼类。相求自相友爱耳。且世谛文章未知其高下。其于<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>明心博通大教。王必不及也。且夫释氏横阔胜大之言。包罗法界洞彻邻虚。断惑出缠冥真会圣。永抛轮转长挹爱河。出万劫之迷津。脱四魔之见网。历劫灾而不坏。与<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>而并存。与夫世文寔霄壤矣。佛之利见也。应大机则重重<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>刹刹分形。接小凡则丈六<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>三千界主。所以宣尼推为至圣。老氏尊之竺干吾师号佛觉一切民也。溥天慈父覆育群伦。超出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>之大<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>也。孔老二圣岂妄推之。盖见善不及守雌保弱。不敢为天下先之志也。本朝驸马都尉李度题寺咏佛诗曰。仲尼推至圣。老氏称古皇。天上及天下。应更无比量。勒碑于相国寺之东庑别院。盖佛者流光于混元之前。列影向太虚之始。慈云法雨润泽群生。千圣乐推万灵欣奉。宜乎宣尼伯阳闻风而悦。慕德而归命焉。唐李商隐赞曰。吾儒之师曰鲁仲尼。仲尼师聃龙。吾不知聃师竺干。善入无为。稽首正觉吾师师师懿哉儒言知佛者也。经不云乎。除摩利支山。不产栴檀木。好语皆生佛法中。佛未出时。世谛幻法皆无名字。佛之设教。统应群机。撮要而言。不出乎真俗二谛。其真也。诠妙理之格言。究死生之出要。其济俗也。奖善罚恶。罪<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>应。至于治世之书。亦诸佛之遗化也。故经曰。一切世间安民济物。皆是诸佛。法灭尽后。有<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。采什佛书。安置己典。传于后世。大千国土各有典彝。在<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>则四韦陀。此土则五经三史之书也。故曰。一切法者皆是佛法。岂徒言哉。如今黄冠剽窃<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。撰成己教。外道经书半偷佛法。识者尽知矣。唯宁师内外博通真俗双究。观师所集。物类相感。志至于微术小伎。亦尽取之。盖欲学佛遍知一切法也。崇宁四年。敕加命号。曰东京左街僧录史馆编修圆明通慧大师。以旌其学行。师之所著。唯大宋高僧传三十卷与僧史略三卷。奉敕入藏颁行。外余多湮没。兵火之中得斯藏本。佛<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>理来历纪纲。舍此书而弗知也。苟斯文之坠地。顾大法之将沈。由是敢率同袍。兴心内护。爰有两街僧录鉴义临安府前后政僧官禅讲。同出长财。命工镂板。附藏<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。因写王诗欧公之录。以示方来。使知世智辩聪之流有时而信焉。三教之贤圣。理归一揆。则八无暇之沉沦尚可救也。故为序之绍兴十四年甲子四月己巳。如来诞圣日。传西天<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法特赐宝觉圆通法济大师法道 序</p><p>右街僧录通慧大师赞宁奉 敕撰</p><p>夫僧本无史。觉乎弘明二集。可非记言耶。高名僧传。可非记事耶。言事既全。俱为载笔。原彼东汉。至于我朝。仅一千年。教法污隆。缁徒出没。富哉事迹。繁矣言诠。蕴结藏中。从何攸济(赞宁)以太平兴国初。叠奉诏旨。高僧传外别修僧史。及进育王塔。乘驲到阙。敕居东寺。披览多暇。遂树立门题。搜求事类。始乎佛生教法流衍。至于<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>住持诸务事始。一皆隐括。约成三卷。号僧史略焉。盖取裴子野宋略为目。所恨删采不周。表明多昧。不可鸿硕寓目。预惧缺然者尔</p><p>(咸平二年重更修洛) 一佛降生年代 二僧入震旦 三经像东传 四创造伽蓝(浴佛行像附) 五译经 六译律 七译论 八东夏出家 九服章法式 十立坛得戒 十一尼得戒由 十二受斋忏法 十三礼仪沿革 十四注经 十五僧讲 十六尼讲 十七造疏科经 十八解律 十九解论 二十都讲 二十一传禅观法(别立禅居附) 二十二此土僧游西域 二十三传密藏(外学附)</p><p>所立仅六十门。止删取集传。并录所闻。以明佛法东传以来百事之始也</p><p>佛降生年代</p><p>按佛生日。多说不同。一则应现非常。遇缘即化。故有见闻不同也。一则西域来僧。生处有都城村落。传事有部类宗计。故各说不同也。一则西域朴略。罕能纪录庶事。宽慢不尚繁细。故流传不同也。今且据东土传记及经律所明。而有多说</p><p>案上统传汉法本内传。合阿含经中。皆曰周昭王二十三年七月十五日。现白象瑞。降摩耶夫人胎。明年四月八日。于岚毗园波罗下。右胁而诞也</p><p><a href=\"/ctwh/shi/24s/zhoushu.html\" class=\"keylink\" target=\"_blank\">周书</a>异记曰。昭王二十四年甲寅岁四月八日。江河泉池忽然泛溢。井皆腾涌。宫殿震动。其夜五色光气贯于太微。遍于西方。作青虹色。时王问太史苏由。由对曰。有大圣出于西方。故现此瑞。王曰。于国无损乎。对曰。一千年后。声教当被于此</p><p>又案五运图云。东周平王四十八年戊午岁佛生。此说则无凭也。又依道安罗什纪及石柱铭云。周十八主桓王五年乙丑岁佛生。此亦非也</p><p>又费长房开皇三宝录中。定佛是周庄王他十年甲午四月八日生。以常星不见为征也。又法显曾游西域云。佛是商王代中生。显因见师子国三月出佛齿。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>王前。宣曰。佛灭已一千四百九十七载也。显以晋义凞中逆推。知佛是商时生矣。又庐山度律师众圣点记云。周贞定王二年甲戌佛生。法宝大师全不取此 又感通传中。是夏桀之时见佛垂迹也</p><p>次上诸说帝代不同。一夏末。二商末。三周昭王时。四平王时。五桓王时。六庄王时。七贞定王时。皆据此方传记所说。若案经律者。浴佛经云。一切佛皆四月八日生也。瑞应经亦云四月八日生。而萨婆多论中即云二月八日生。是则内教二说不同也。今谓佛若是夏时生。即今建巳四月八日也。若商时生。即今建辰月八日也。若周时生。即今建卯月八日也。又据南山宜律师问<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>曰。此土传佛生时。或云商代。或周昭王。鲁庄公世。如何指的。答曰。皆有所以。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>是夏桀时生。天具见佛之垂化。然佛有三身。法报二身非人天所见。唯化身佛普被三千故。有百亿释迦。随机所感。前后不定。不足疑也</p><p>今东京以腊月八日浴佛言佛生日者。案祇洹图经。寺中有坡黎师子。形如拳许大。口出妙音。菩萨闻之。皆超地位。每至腊月八日。舍卫城中士女竞持香花。来听法音。详彼。不言佛生日。疑天竺以腊八为节日耳。又疑是用多论二月八日。腊月乃周之二月也。东西辽夐故。多差异焉</p><p>又江表以今四月八日为佛生日者。依瑞应经也。如用周正。则合是今二月八日。今用建巳月。乃周之六月也。详此。滥用建巳月者。有二意焉。一闻声便用不摭实求时。一翻经者多用夏正。故斯谬耳。若如南山云。并<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>见闻不同。故时节不等。不宜确执。然则两方相接。三藏所传。以周昭时生。理为长也</p><p>重之曰。前言月八日者。为东夏耶。为西域耶。若寻条见本。从水求源。则事无不周。理有攸贯。且天竺岁首诸说不同。高僧传中。慧严与何承天争中边言。西域以建辰为岁首。传又云。十二月三十日号大神变月。即此土正月十五日。此指夏正也。而用十六日生魄。为月初一日焉。今未详。建辰月为取今三月月生日为岁首。为是月半分之准。西土无正二三月名。但取星直月。为月名耳。如毗舍佉月迦提月是也</p><p>又葱岭北诸国。或以建未月为正首。或春际为夏安居。是知随方宗计各别。况佛在西域说经。罗汉居竺乾造论。必不指东震之月。所言四月八日者。西域四月八日也。以事符合周书异记昭王四月八日祥瑞。疑翻译时随声笔受。妄认夏正也。唯为有七月十五日。腊法经是用此方为文。令人惑之。故两存也</p><p>僧入震旦</p><p>五运图云。周世圣教灵迹。及阿育王造塔置于此土。合有传记。良以秦始皇焚书。此亦随爇。故今无处追寻。案始皇时。有沙门释利房等十八贤者。赍经来化。始皇弗信。遂禁锢之。夜有神人。破狱出之。又汉成帝时。刘向挍书于天禄阁。往往见有佛经。及着列仙传。得一百三十六人。七十四人已见佛经。以此详究。知周秦之代已有<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>沙门。止未大兴耳。至后汉第二主明帝永平七年。因梦金人。乃令秦景蔡愔王遵往天竺迎佛教。于月氏遇<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>摩腾竺法兰二沙门。入东夏。今以为始也。于时佛法虽到中原。未流江表。信受未广。传行未周。洎孙氏鼎分封疆阻隔。有康僧会者。本康居国人。赤鸟年中始化于南土也</p><p>经像东传</p><p>原其佛道难思。神踪本异。不可以常情测。不可以众例求。唯如东汉僧来刘向已逢于梵筴。育王塔现秦朝。早有于灵仪。案释老志曰。释氏之学闻于前汉。武帝元狩年中。霍去病获昆耶王金人。帝以为大神。列于甘泉宫。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a><a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。此佛法流传之始也。及开西域。遣张骞使大夏。还云。身毒有浮图之教。哀帝元寿年中。景宪往月支。口授得浮图经。然时未敦信。道未通行。犹大江之初潦。若巨木之毫末耳。今以汉明帝世。二沙门赍<a href=\"/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>。及白[疊*毛]画像。为其始焉。又如感通传中。周穆王造灵安寺。永州石花捧育王塔等。岂非东汉前耶。斯乃思虑不遑。语议弗及者。可置度外。今且据事迹可思可议故。以永平为始也</p><p>创造伽蓝</p><p>经像来思僧徒戾止。次原爰处必宅净方。是以法轮转须依地也。故立寺宇焉。腾兰二人角力既胜。明帝忻悦。初于鸿胪寺延礼之。鸿胪寺者。本礼四夷远国之邸舍也。寻令别择洛阳西雍门外盖一精舍。以白马驮经夹故。用白马为题也。寺者释名曰寺嗣也。治事者相嗣续于其内也。本是司名。西僧乍来。权止公司。移入别居。不忘其本。还标寺号。僧寺之名始于此也。僧伽蓝者。译为众园。谓众人所居。在乎园圃。生殖之所。<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>则生殖道芽圣果也。故经中有迦兰陀竹园。祇树给孤独园。皆是西域之寺舍也。若其不思议之迹。即周穆王造显济寺。此难凭准。命曰难思之事也。后魏太武帝始光元年。创立伽蓝。为招提之号。隋炀帝大业中。改天下寺为道场。至唐复为寺也</p><p>案灵裕法师寺诰。凡有十名寺。一曰寺(义准释名)。二曰净住(秽浊不可同居)。三曰法同舍(法食二同界也)。四曰出世舍(修出离世俗之所也)。五曰精舍(非粗暴者所居)。六曰清净园(三业无染处也)。七曰金刚刹(刹土坚固道人所居)。八曰寂灭道场(祇园有莲华藏世界。以七宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。谓之寂灭道场。卢舍那佛说华严于此)。九曰远离处(入其中者。去烦惑远。与寂灭乐近故)十曰亲近处(如行安乐行。以此中近法故也)。此土十名依祇洹图经。释相各有意致。如彼寺诰也。今义如六种。一名窟。如后魏凿山为窟。安置圣像及僧居。是也(今洛阳龙门天竺寺有石窟。有如那罗延金刚佛窟等。是)。二名院(今<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>住持多用此名也)。三名林(律曰。住一林。经中有逝多林也)。四曰庙(如善见论中瞿昙庙)五兰若(无院相者)。六普通(今五台山有多所也)。又案汉明帝崩。起祇洹於陵上。自此百姓坟冢或作浮图者焉(出杨炫之伽蓝记中)。洛阳自汉永平至晋永嘉。止有四十二寺。及后魏都洛。盛信佛教。崇构相继。臣下豪民竞置寺宇。凡一千余所。后赵都邺。造寺八百余区。今遗址或存焉</p><p>浴佛者。唐义净三藏躬游西域见印度。每日禺中维那鸣钟。寺庭取铜石等像。于盘内作音乐。磨香或泥灌水。以[疊*毛]揩之。举两指沥水于自顶上。谓之吉祥之水。冀求胜利焉。问。浴佛表何。通曰。像佛生时龙喷香雨浴<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>也。然彼日日灌洗。则非生日之意。疑五竺多热。僧既频浴。佛亦勤灌耳。东夏尚腊八。或二月四月八日。乃是为佛生日也</p><p>行像者。自佛泥洹。王臣多恨不亲睹佛。由是立佛降生相。或作太子巡城像。晋法显到巴连弗城。见彼用建卯月八日行像。以车结缚五层。高二丈许。状如塔。彩画诸天形。众宝作龛。佛坐菩萨立侍。可二十车。车各样严饰。婆罗门子请佛。次第入城内宿。通夜供养。国国皆然。王及长者立福德医药舍。凡贫病者诣其中。医师瞻候病差方去。又岭北龟兹东荒城寺。每秋分后。十日间。一国僧徒皆赴五年大会(西域谓之般遮于瑟)国王庶民皆捐俗务。受经听法。庄严佛像。戴以车辇。谓之行像。于阗则以四月一日行像。至十四日讫。王及夫人始还宫耳。今夏台灵武每年二月八日。僧戴夹苎佛像。侍从围绕。幡盖歌乐引导。谓之巡城。以城市行市为限。百姓赖其消灾也。又此土夏安居毕。僧众持花执扇。吹贝鸣铙引而双行。谓之出队迦提也(取迦提月名也)释老志曰。魏世祖于四月八日。舆诸寺像行于广衢。帝御门楼临观。散花致礼焉。又景兴尼寺金像出时。诏羽林一百人。举辇伎乐。皆由内给。又安居毕。明日总集。旋绕村城。礼诸制底。棚车兴像。幡花蔽日。名曰三摩近离(此曰和集)斯乃神州行城法也</p><p>译经</p><p>昔刘向校书天禄。见有佛经。知于时未事翻传。必存梵夹。若然刘向安识梵字。而云列仙有七十余人已见佛经。又以文殊菩萨亦号列仙耶。盖刘向博识全才。象胥之学自能之矣。览其梵夹。回作华言。寻认七十许人见佛经也。若论翻译。则摩腾初出四十二章经。及法兰同译十地佛本生法海藏佛本行等经。为其始也。次则安清支谶支谦等相继翻述。汉末魏初。传译渐盛。或翻佛为众祐。或翻辟支为古佛。支谶出首<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>云。佛在王舍城灵鹫顶山中。存没不同。用舍各异。斯乃译经之推轮者焉</p><p>译律</p><p>佛制毗尼。紏绳内众。如国刑法。画一成规。未知谁将毗尼翻为律号。案汉灵帝建宁三年庚戌岁。安世高首出义决律一卷。次有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>诸禁律一卷。至曹魏世。天竺三藏昙摩迦罗(此曰法时)到许洛。慨魏境僧无律范。遂于嘉平年中。与昙谛译四分羯磨及僧祇戒心图记云。此方<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>之始也</p><p>译论</p><p>晋孝武之世。有罽宾国沙门僧伽跋澄。译杂毗昙婆沙十四卷。次则姚秦罗什译大智度成实。此为译论之始。道安录及僧祐出三藏记同斯楷述也。又单名鞞婆沙。是者迦旃延子撮其要义引经训释。为毗昙四十四品。斯亦论也</p><p>东夏出家</p><p>夫狂蒙寄于伽蓝顿生善念。孟轲邻其学校寻染儒风。佛法既行。民人皆化。于时岂无抽簪解佩脱履投形者乎。乃汉明帝听阳城候刘峻等出家。僧之始也。洛阳妇女阿潘等出家。此尼之始也</p><p>服章法式</p><p>案汉魏之世。出家者多着赤布僧伽梨。盖以西土无丝织物。又尚木兰色并乾陀色故。服布而染赤然也。则西方服色亦随部类不同。萨婆多部皂色衣也。昙无德部绛色衣也。弥沙塞部青色衣也。着赤布者乃昙无德僧。先到汉土耳后梁有慧朗法师。常服青纳。志公预记云。兴皇寺当有青衣开士广行大乘。至朗果符其言矣。广明服色。如五部威仪所服经中。今江表多服黑色赤色衣。时有青黄间色。号为黄褐。石莲褐也。东京关辅尚褐色衣。并部幽州则尚黑色。若服黑色。最为非法也。何耶。黑是上染大色五方正色也。问缁衣者色何状貌。答紫而浅黑非正色也。考工记中。三入为[糸*黑]。五入为緅。七入为缁。以再染黑为緅。緅是雀头色。又再染乃成缁矣。知缁本出绛。雀头紫赤色也。故净秀尼见圣众衣色。如桑熟椹。乃浅赤深黑也。今秣陵比丘衣色仿西竺缁衣也。又后周忌闻黑衣之谶。悉屏黑色。着黄色衣。起于周也。又三衣之外。有曳纳播者。形如覆肩衣。出寄归传。讲员自许即曳之。若讲通一本则曳一支。讲二三本又随讲数曳之。如纳播是也。又后魏宫人见僧自恣。偏袒右肩乃一施肩衣。号曰偏衫。全其两扇衿袖。失只支之体。自魏始也。复次脚曳[革*索][革*睪]。或革屣[奄-大+與]遮短[革*雍]靴等。寄归传云。西域有持竹盖或持伞者。梁高僧慧韶遇有请。则自携杖笠也。今僧盛戴竹笠。禅师则葼笠。及持澡罐漉囊锡杖戒刀斧子针筒。此皆为道具也。近有衣白色者。失之大甚。佛记<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>变白不受染色。此得非是乎。或有识<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>众主夺之而坏其色。真为<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>有力之胜士也。昔唐末豫章有观音禅师。见南方禅客多搭白纳。常以瓿器盛染色。劝令染之。今天下皆谓黄纳为观音纳也。此师早曾听学护法为情。于今称之</p><p>立坛得戒</p><p>原其汉魏之僧也。虽剃染成形。而戒法未备。于时二众唯受三归。后汉永平至魏黄初以来。大僧<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>曾无区别。有昙摩迦罗三藏及竺律炎维只难等。皆传律义。迦罗以嘉平正元中。与昙帝于洛阳出僧祇戒心。立大僧羯磨法。东土立坛。此其始也。详其曼荼罗大只施设不同。或巨摩规地。或以木构层。筑泥分级。俱名坛也。除土扫地。则名墠也。墠场坛不同。皆是西域曼荼罗也。若据<a href=\"/remen/lvzong.html\" class=\"keylink\" target=\"_blank\">律宗</a>。则须结仄隅。分限从其自然。生于作法。缅想魏朝。固应漠落矣。若此方<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。则朱士行为其首也。南朝永明中。三吴初造戒坛。此又吴中之始也。唐初灵感寺南山宣律师。按法立坛。感长眉僧(即宾头卢身也)<a href=\"/remen/suixizantan.html\" class=\"keylink\" target=\"_blank\">随喜赞叹</a>。立坛应法勿过此焉。宣撰戒坛经一卷。今行于世。余尝慨南山不明坛第四层覆釜形仪制。故着覆釜形仪。乐者寻之。以辅博知也。今右街副僧录广化大师真绍先募邑社。于东京大平兴国寺。造石戒坛。一遵南山戒坛经。宏壮严丽。冠绝于天下也</p><p>尼得戒由</p><p>爱道初缘岂为容易。阿潘出俗又实希奇。始徒受于三归。且未全于二众。按五运图云。自汉永平丁卯。洎宋元嘉甲戌中间。相去三百六十七年。尼方具戒。又萨婆多师资传云。宋元嘉十一年春。师子国尼铁索罗等十人。于建康南林寺坛上。为景福寺尼慧果净音等二众中受戒法事。十二日度三百余人。此方尼于二众受戒。慧果为始也。知阿潘等但受三归。又晋咸康中。尼净捡于一众边得戒。此亦未全也。及建武中。江北诸尼乃往僧寺受戒。累朝不辍。近以太祖敕。不许尼往僧中受戒。自是尼还于一众得本法。而已戒品终不圆也。今圣英达明断。护法之士宜奏乞仍旧行之免法灭之遄速焉</p><p>受斋忏法</p><p>自佛法东传。事多草昧。故高僧传曰。设复斋忏同于祠祀。魏晋之世。僧皆布草而食起坐威仪唱导开化略无规矩。至东晋有伪秦国道安法师。慧解生知。始寻究经律。作赴请僧跋赞礼<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>等仪式。凡有三例。一曰行香定座是也。宣律师赴请设则篇大明軏则。圆顶之徒苟不披览破谷之诮。而乃自贻吁哉。近闻有西江商客。赛愿营斋。先示文疏。数僧无能读者。被商客驱之。一何可笑。后生闻此。当寅夜攻学。一则不虚受施。一则覆庇群僧。一则扬名于四方也</p><p>礼仪沿革</p><p>西域之法礼有多种。如传所明。礼拜者屈己也。旋绕者恋慕也。偏袒者亦肉袒也。脱革屣者不敢安也。和南者先意问讯也。避路者尚齿也。诸例常闻不烦多述。若尼礼于僧。自传八法。比丘奉上接足至三莫不尽恭。如事令长也。近以开坐具。便为礼者。得以论之。昔梵僧到此。皆展舒尼师坛。就上作礼。后世避烦。尊者方见开尼师坛。即止之。便通叙暄凉。又展犹再拜也。尊者还止之。由此只将展尼师坛拟礼。为礼之数。所谓蓌拜也。如此设恭无乃大简乎。然随方为清净者。不得不行也。又如比丘相见。曲躬合掌口云不审者何。此三业归仰也(曲躬合掌身也。发言不审口也。心若不生崇重。岂能动身口乎)谓之问讯。其或卑问尊。则不审少病少恼。起居轻利不。上慰不。则不审无病恼。乞食易得。住处无恶伴。水陆无细虫不。后人省其辞。止云不审也。大如歇后语乎。又临去辞云珍重者何。此则相见既毕。情意已通。嘱云珍重。犹言善加保重。请加自爱。好将息宜保惜同也。若西域相见则合掌云和南。或云盘茶味。久不见乃设礼。若尊严师匠。则一见一礼。今出家者以华情学梵事耳。所谓半华半梵。亦是亦非。寻其所起。皆道安之遗法是。则住既与俗不同。律行条然自别也。或云。僧上表疏。宜去顿首。以其涉祝宗之九拜者。余观庐山远公太山朗公答王臣之作。皆名下称顿首。远公讲礼。讲贤釆义。岂滥用哉。且顿首者。头委顿而拜也。今文云顿首。而身不躬折。何为拜乎。又道流相见。交手叩头而云稽首亦同也。然秉笔者避之为敏矣</p><p>注经</p><p>乍翻法语未贯凡情。既重译而乃通。更究文而畅理故笺法作焉。沉隐之义指掌可知矣。五运图云。康僧会吴赤鸟年中。注法镜经。此注经之始也。又道安重注了本<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>经云。魏初有河南支恭明。为作注解。若然者。南注则康僧会居初。北注则支恭明为先矣</p><p>僧讲</p><p>朱士行颖川人也。志业方正。少怀远悟。脱落尘俗。出家之后。专务经典。常讲道行<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。每叹译理未尽。乃于魏<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>五年。发迹长安。度流沙至于阗。得梵书正本九十章。彼国多小乘学者。谮于王曰。汉地沙门欲以婆罗门书惑乱正法。何不禁之。聋盲汉地。王之咎也。王乃不听赍经东去。士行因请烧之为验。于时积薪殿前。誓毕而焚。其经无损。王始归信。士行寄经还国。竺叔兰无罗叉译为放光般若。睿法师云。士行于洛中讲小品。往往不通。远出流沙求大品。归出为晋音是也。士行曹魏时。讲道行经。即僧讲之始也</p><p>尼讲</p><p>东晋废帝大和三年戊辰岁。洛阳东寺尼道馨俗姓羊。为沙弥时。诵通法华维摩二部。受大戒后。研穷理味。一方道学所共师宗。尼之讲说道馨为始也</p><p>造疏科经</p><p>经教东流始则朱士行讲说未形于文字。分科注解其道安法师欤。安师注经。常恐不合佛意。俄梦道人曰。合理即宾头卢也。或曰。注经与造疏全别。何推安公为首耶。答注是解经。与别行疏义殊号而同实。矧分其科节不长途散释。自安之意乎。次则僧睿造维摩疏。直生着维摩法华泥洹小品疏。世皆宝之</p><p>解律</p><p>元魏世。法聪律师者原是昙无德羯磨得戒而常习僧祇。一日自悟乃叹曰。体既四分而受。何得异部明随。于是罢讲只律。手披目阅敷扬四分。有门人道覆。旋抄渐成义疏。覆公即解四分之始也。至宋元嘉中。慧询善僧祇十诵。更制条章。即解二律之始也。今五台山北寺相传。有聪师讲律之遗迹焉</p><p>解论</p><p>毗昙慧学对法命家。虽晚见于翻传。而敏成于智母。畴初稽考越措<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>。唯成实一宗最多<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。北则罗什删略付授嵩法师。故后魏主大和十年。幸徐州白塔寺。诏曰。此寺近有名僧嵩法师。受成实论于什公。后授渊法师。又授登纪二法师。朕每览成实云。道登尝传论于禁中。此北朝之始也。又僧道禅经律论一皆精博。姚兴同辇还宫。着成实三论义疏。此又在先矣。南则僧柔讲宣。故出三藏记曰。齐永明七年十月。文宣王招集京师硕学名僧五百人。请定林寺僧柔讲寺。慧欣于普弘寺讲。此南朝之始也。又肇睿诸师讲中百十二门等论。疏义迭生相继无尽也</p><p>都讲</p><p>敷宣之士击发之由。非旁人而启端。难在座而孤起。故梁武讲经。以枳园寺法彪为都讲。彪公先一问。梁祖方鼓舌端。载索载征随问随答。此都讲之大体也。又支遁至会稽。王内史请讲维摩。许询为都讲。许发一问。众谓支无以答。支答一义。众谓询无以难如是问答连环不尽。是知都讲实难其人。又僧伽跋陀罗就讲。弟子法勇传译僧念为都讲。又僧导者京兆人也。为沙弥时。僧睿见而异之曰。君于佛法且欲何为。曰愿为法师作都讲。睿曰。君当为万人法主。岂对扬小师乎。此则姚秦之世已有都讲也。今之都讲不闻击问。举唱经文。盖似像古之都讲耳</p><p>传禅观法</p><p>禅法滥觞自此秦世僧睿法师序关中出禅经。其文则明心达理之趣也。然譬若始有其方。未能修合。弗闻疗疾。徒曰医书。矧以大教既敷群英分讲。注之者矜其词义。科之者逞其区分。执尘摇指。但尚其乘机应变解纷挫锐。唯观其智刃辞锋。都忘所诠。不求出离。江表远公慨禅法未敷。于是苦求而得也。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>达磨祖师观此土之根缘。对一期之繁紊。而宣言曰。不立文字遣其执文滞逐也(笺曰。不遵王化。名曰叛臣。不继父踪。呼为逆子。敢有不循佛说。是谓魔外之徒。所以三世诸佛法无异说。十方众圣授学同文。夫释迦之经本也。达磨之言末也。背本逐末。良可悲哉。愚素习象胥。力根贝叶。遍问西来三藏。仍阅古今求法记文。天竺<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>并禀教乘。所以入正位者继踵。五天盖依法务实而行。佛言圣法不误后学也。敢咨同志。学佛修禅。庶几毕离苦津。高登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。无以利口欺人自瞒于灵府也。经曰。若欲得道。当依佛语。违而得者。无有是处。可诬也哉)</p><p>别立禅居</p><p>达磨之道既行。机锋相遘者唱和。然其所化之众唯随寺别院而居且无异制。道信禅师住东林寺。能禅师住广果寺。谈禅师住白马寺。皆一例<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。唯参学者或行杜多。粪扫五纳衣为异耳。后有百丈山禅师怀海。创意经纶别立通堂。布长连床。励其<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>。坐歇则带刀。斜卧高木。为椸架。凡百道具悉悬其上。所谓龙牙杙上也。有朝参暮请之礼。随石磬木鱼为节度。可宗者谓之长老。随从者谓之侍者。主事者谓之寮司。共作者谓之普请。或有过者。主事示以柱杖。焚其衣钵。谓之诫罚。凡诸新例厥号<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。与律不同。自百丈之始也(笺曰。礼乐花伐自天子出。则王道兴。为佛寺僧规。禀如来制。则正法住矣)</p><p>此土僧游西域</p><p>嗟乎骞宪虽征。只为开荒而奉命。腾兰既至。未闻克志以求经。亦犹决一堤塘。内水既出。外水亦入。一出一入。然后知平矣。魏洛阳朱士行誓往西天。寻求般若。僧祐以为东僧西往之始焉。然只在葱岭之北于填而止。晋法显募同志数十人。游于印度。登灵鹫山。此乃到中天之始也。厥后交肩接迹。至有汉寺别居东夏之僧。决堤之喻居可验矣。若论传译之人。则多善一方。罕闻通解。唯奘三藏究两土之音训。瞻诸学之川源。如从佛闻。曲尽意。次则义净躬游彼刹。妙达毗尼。改律范之妄迷。注密言之引合。遂得<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>有验流布无疑矣。原其后汉以来。译者相续。洎唐元和年中。翻本生心地观经。之后百六十载寂尔无闻。宋太祖尝遣百余僧。往西方求法。太宋太平兴国七年。有诏立译经院于东京太平兴国寺之西偏。聚三藏天息灾等梵僧数员。及选两街明义学僧。同译新经。译经之务大宋中兴也</p><p>传密藏</p><p>密藏者陀罗尼法也。是法秘密非二乘境界。诸佛菩萨所能游履也。旧译云持。新译云性。本其原则微妙法性也。形其言则陀罗尼母也。究其音则声明也。穷其文则字界缘也。出三藏记云。神咒者总持微密持也。高僧传中。帛尸梨密多罗本西域人。东晋之初至于建业。王导周伯仁庾亮皆钦重之。善持咒术。所向多验。时江东未有咒法。密出孔雀王咒。咒法之始也。北魏则嵩山菩提流支咒井树等。颇有灵效。唐朝则智通法师甚精禁咒焉。次有不空三藏。于京大兴善寺。广译总持教。多设曼荼罗。神术莫可知也。灌顶坛法始于不空。代宗永泰年中。敕灌顶道场处。选二七人。为国长诵佛顶咒。及免差科地税云。梁末后唐世。道贤阇梨者。一夕梦游五天竺。见佛指示此某国聚落。洎旦顿解五印言音。毫厘不爽。今传粉坛法。并宗此师。凤翔阿阇梨是也。后唐清泰帝尤旌其道。后随驾入洛而卒。今塔在龙门。近东京南。日本大师常为王公大人演密藏。至今弟子繁衍。传其业者号曰三藏。或兼讲经律论者。则称传显密藏也</p><p>外学</p><p>夫学不厌博。有所不知。盖阙如也。吾宗致远。以三乘法而运载焉。然或魔障相陵。必须御侮。御侮之术。莫若知彼敌情。敌情者。西竺则韦陀。东夏则经籍矣。故祇洹寺中有四韦陀院。外道以为宗极。又有书院。大千界内所有不同文书并集其中。佛俱许读之。为伏外道。而不许依其见也。此土古德高僧能摄伏异宗者。率由博学之故。譬如夷狄之人。言语不通。饮食不同。孰能达其志通其欲。其或微解胡语。立便驯知矣。是以习凿齿道安以诙谐而伏之。宗雷之辈慧远以诗礼而诱之。权无二复礼以辨惑而柔之。陆鸿渐皎然以诗式而友之。此皆不施他术。唯通外学耳。况乎儒道二教义理玄邈。释子既精本业。何好钻极以广见闻。勿滞于一方也</p><p>大宋僧史略卷上</p><p>大宋僧史略 卷中 (咸平二年重更修理)</p><p>右街僧录通慧大师赞宁奉 敕撰</p><p>二十四道俗立制 二十五行香唱导 二十六赞呗之由 二十七僧寺纲紏 二十八立僧正(立尼正附) 二十九僧统 三十沙门都统 三十一左右街僧录 三十二僧主副员 三十三讲经论首座 三十四国师 三十五杂任职员 三十六僧主秩俸(尼附) 三十七管属僧尼(祠部牒附) 三十八僧道班立 三十九内道场(生日道场附) 四十僧籍弛张</p><p>道俗立制</p><p>佛法流行。随时制断合毗尼之绳紏。则案毗尼。堪别法之处量须循别法。故佛诃比丘云。巧避我制造种种过故。许同时立方毗尼。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后立未来教。以为律范所不围。篇科所不载。则比附而求之也。以是篇聚之外别有僧制焉。今时比丘或住一林居一院。皆和众立条。约束行止。俾不罹于愆失也。晋道安法师伤戒律之未全。痛威仪之多缺。故弥缝其阙。埭堰其流。立三例以命章。使一时而生信。一行香定座上讲。二六时礼忏。三布萨等法。过踰此法者。则别立遮防。安弟子法遇讲化于荆州。时有学徒饮酒。遇罚而不遣。安在襄阳闻之。封小棰以寄遇。遇详师意。集众谕之。令直日打遇二十扑。封棰却还。故习凿齿与谢安书云。安能肃众。上之三例天下翕然奉行也。又支遁立众僧集仪度。慧远立法社节度。至于宣律师。立鸣钟轨度。分五众物仪。章服仪归敬仪。此并附时傍教相次而出。凿空开荒。则道安为僧制之始也。后魏世宗宣武帝即位下诏曰。缁素既分。法律亦异。道教彰于互显。禁劝各有所宜。其僧犯杀人。以上罪依俗格断。余犯悉付昭玄。以内律僧制判之(景明年中帝新撰之)时魏与梁通和。要贵多遣人。随使交易。唯崔暹(字季伦)寄求佛经。梁祖缮写并幡花赞呗送至馆。暹尝命沙门明藏着佛论而已署名。其好佛法为若此也。先是僧尼猥滥暹奏设科条篇沙门法上为昭玄都。以捡约之。又南齐文宣王着僧制一卷。又梁祖造光宅寺。诏法云为寺主。创立僧制用为后范。观其北魏南朝。俗施僧制。而皆婉约且不淫伤。由轻法之网罗。有恶人之穿穴。脱漏而堕。不至诛刑之上。其可得乎。为僧者苟未<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。但能避刑宪。亦逍遥之上士也</p><p>行香唱导</p><p>香也者解秽流芬。令人乐闻也。原其周人尚臭。冥合西域重香。佛出姬朝。远同符契矣。经中长者请佛。宿夜登楼。手秉香罏。以达<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。明日食时。佛即来至。故知香为信心之使也。大遗教经曰。比丘欲食。先烧香呗赞之。又经中。蛇呼比丘自说宿缘。令为<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。并将仙提来取我行香。此方教法既行。经律散漫故。安法师三例中。第一是行香定座上讲。斯乃中夏行香之始也。后魏及江表皆重散香且无沿革。至唐高宗朝。薛元起李义府奉敕为太子斋行香。因礼奘三藏。又中宗设无遮斋。诏五品以上行香。或用然香薰手。或将香粖遍行。谓之行香。后不空三藏奏为高祖太宗七圣忌辰设斋行香。敕旨宜依。寻因多故不斋但行香而已。文宗朝中书崔蠡上疏云。国忌设斋。百官行香。事无经据。伏请停废。敕曰。崔蠡所奏遂遣讨寻本末。礼文令式曾不该明。其两京天下州府国忌于寺观行香。今后并宜停罢尝试论之。崔蠡言无经据者。蛇之行香岂无经也。安公引教设仪。岂无据也。敕云讨寻本末礼文令式曾不该明者。三代之礼何尝言饭释子而行香耶。且令式唯是历代沿革之法律。如代宗后之条格。岂标在隋末唐初之令式乎。矧以礼出儒家。讵可将释书为据。事因释氏。无宜用儒典为凭。就体证之。方云合理。儒流不许。还引儒书。何异狱讼之人召亲党而作证。若欲除废。其无辞乎。夫孝子事祖考。唯善是从徇葬不益于生生。固宜寝也。行香是荐于冥漠。知无不为观。文宗薄于祖宗。宜其寄坐矣。或曰何必行香为通。曰如周之尚臭燔柴血膋芗萧。言天歆其臭也。天岂食血膋芗萧之气邪。由人尚其臭故。以臭而事天也。若然者。佛教重香。宁可夺乎。况百官行香代君也。百官事祖宗。亦臣子也。苟欲废之。如忠孝何。宣宗即位再兴斯道。大中五年。敕京城及外州府。国忌行香并须清洁。不得携酒肉入寺烹炮。既失严恪之心。颇乖追荐之道云。自此至于哀帝。行香如旧。朱梁废唐。七庙方止。开平三年。大明节百官入寺。行香祝寿。后还荐祖宗。行香于今不绝。晋天福五年。窦贞固奏国忌宰臣跪炉百官列座。今欲宰臣跪炉百官立班。行香后饭僧百人。永为常式。宋大宗淳化三年。虞部员外郎李宗讷奏国忌行香请宰臣已下行香。后禁酒食表其精洁</p><p>敕下御史台依行</p><p>唱导者始则西域上座凡赴请。咒愿曰。二足常安。四足亦安。一切时中皆吉祥等。以悦可檀越之心也。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗多辩才。曾作上座。赞导颇佳。白衣大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。此为表白之椎轮也。梁高僧传论云。夫唱导所贵。其事四焉。一声也。二辩也。三才也。四博也。非声则无以警众。非辩则无以适时。非才则言无可采。非博则语无依据。此其大体也。据寄归传中云。焚香胡跪。叹佛相好。合是导师胡跪尔。或直声告或诘曲声也。又西域凡觐国王。必有赞德之仪。法流东夏。其任尤重。如见大官谒王者。须一明练者通暄凉序情意赞风化。此亦唱导之事也。齐竟陵王有导文。梁僧祐着齐主赞叹缘记及诸色咒愿文。陈隋世高僧真观深善斯道。有道文集焉。从唐至今。此法盛行于代也</p><p>赞呗之由</p><p>赞呗原始。案十诵律中。俱胝耳(即亿耳也)作三契声以赞佛。其人善呗易了解。阿含中。善和罗作善讽诵。令影胜大王象马不行。此土则康僧会传泥洹赞呗。支谦制连句梵呗。又开士法胜善阿毗昙心。别撰二百五偈以为要解。号曰心。其颂声也撰象天乐。若灵籥自发仪刑群品。触物有寄。一吟一咏状鸟步兽行也。一弄一引类乎物情也。情与类迁。则声随九变而成歌。气与数合。则五音协律而俱作。附之金石。则百兽率舞。奏之管弦。则人神同感。斯乃穷音声之妙会也。魏子建尝游鱼山而感音。翻其曲折同合沙门之呗[口*匿]焉。南齐竟陵王子良将经中偈契消息。调音曲尽其妙。着赞梵呗偈文一卷。又帛法桥者尤善梵呗。高僧传中其人颇多。此不具录。后赵石勒建平年中。有神降于安邑厅事。讽咏经音。七日方绝。僧有摹写为梵呗焉。或曰。梵呗之声此何益也。通曰。一者佛道法乐也。此音韵虽哀不伤。虽乐不淫。折中中和故为法乐也。二者诸天鬼神闻皆欢喜故。三者诸佛常法。十方刹土何莫由斯乐也</p><p>僧寺纲紏</p><p>夫言寺者嗣也。治事者相嗣续于其内也。既用官司之名。无亏佛事之业。故子续其父。资踰于师。此相嗣而接踪。当克勤而成事也。案西域知事僧总曰羯磨陀那。译为知事。亦曰悦众。谓知其事悦其众也。稽其佛世。饮光统众于灵鹫。身子莅事于竹林。及沓婆摩罗年甫十六已证应真。其后念身不牢固。请为僧知事。指夜出光分僧卧具。故佛赞言。我弟子为僧知房舍差。次请食沓婆摩罗子为第一。如其赴请群集。谁合受第一水果饮食等。佛言。以其年腊最高者为之。谓之上座。及佛教东渐。汉魏之间。如网未设其纲。如舟未下其磸。殆姚秦之世。出家者十室而半。罗什入关。赢粮裹足。而至者三千。秦主敕选道[(丰*力)/石]法师为僧正。慧远为悦众。法钦慧斌掌僧录。给车舆吏力。僧正秩同侍中。余则差降。此土立僧官。秦[(丰*力)/石]为始也</p><p>立僧正</p><p>僧曹创立净众曰。齐所树官方终循佛教。所言僧正者何。正政也。自正正人。克敷政令故云也。盖以比丘无法。如马无辔勒。牛无贯绳。渐染俗风。将乖雅则。故设有德望者。以法而绳之。令归于正。故曰僧正也。此伪秦僧[(丰*力)/石]为始也(或曰道[契-大+石])东晋迁都。蔑闻此职。至宋世乃立沙门都。又以尼宝贤为僧正。文帝孝武皆崇重之。次有号法主者。如释道猷。生公之弟子也。文帝问慧观曰。顿悟义谁习之。答曰。道猷。遂召入。至孝武即位。敕住新安寺。为镇寺法主。又敕法瑗。为湘宫寺法主。详其各寺同名。疑非统正之任。又升明中。以法持为僧正。大明中。以道温为都邑僧正。永明中。敕长干寺玄畅同法献为僧主。分任南北两岸。畅后被敕往三吴。使紏绳二众。齐末以法悦为僧主。住正觉寺。梁祖归心佛教深入玄枢。慎选德人。以充僧首。则法超为都邑僧正。普通六年。敕法云为大僧正。吏力备足。又慧令亦充此职焉(大字异耳)所云僧主者。犹僧官也。盖偏地小正小统之名也。如阇那崛多。此言志德。北印度人周朝谯王宇文俭镇蜀。请以同行。至彼任益州僧主。住龙渊寺焉。南朝慧基姓偶钱塘人。依求那三藏于蔡州受戒。后化行越土。寻敕为僧主。掌任十城。东土僧主之始也(东土即吴会之间也)历观诸朝。多是诸侯立僧正也。梁虽大国。亦用此名。但加大字以别之。今天下每州置一员。择<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>才能者充之。不然则阙矣</p><p>尼正附</p><p>北朝立制多是附僧。南土新规别行尼正。宋太始二年。敕尼宝贤为尼僧正。又以法净为京邑尼都维那。此则承乏之渐。梁陈隋唐少闻其事。偏霸之国往往闻有尼统尼正之名焉</p><p>僧统</p><p>帝王奄宅寰区。必革人视听。或更其礼乐。或变以官司。互纳言作<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>。以太蔚代司马。何常之有。以此为初。秦制关中。立僧正为宗首。魏尊北土。改僧统领缁徒。虽发新题。亦提旧职后魏皇始中。赵郡沙门法果戒行精至。开演法籍。太祖征为沙门统。言多允惬供施甚厚。太宗崇信弥加于前。永兴中。前后授辅国宜城子忠信侯又安城公。皆固让之。俗官加僧。初闻于此。帝幸其居。嫌其门狭不容舆辇。更广大之。年八十余卒。帝三临其丧。追赠老寿将军赵郡胡灵公(今赠老寿将军。皆出此时之敕。知前辅国必是将军。胡灵二字谥也)初法果年十四始出家。有子曰猛。诏令袭果所加爵。沙门统之官自法果始也。复有罽宾沙门师贤。本是王种。东游凉土。又来京下。值罢佛法。权假医术。而守道不改。于重兴日即为沙门。同辈五人。魏帝亲为下发。诏贤为僧统。僧统之官自师贤始也。隋兴佛道。变革周风。召僧猛住大兴善寺。为隋国大统。猛姓叚泾阳人也。讲般若十地等(隋以大字为珠异也)又号圣沙弥者。初在洛任国僧都(都即沙门都也)。后召入邺。绥缉有功。转为国统(一国之僧统也)宋沿唐制。废统立录(惟宫人出家敕补尼录尼统。有至十字师名。比两国邑号者甚众)</p><p>沙门都统</p><p>魏主移都。仍从元姓虏家所服悉变华章。又于竺梵之门多事改迁之作。孝文帝一日下诏曰。门下近得录公等表。知早定沙门都统。比考德选贤。寤寐勤心。继佛之任。莫知谁寄。或有道高年尊。理无萦纡。或有器识冲邈高揖尘务。今以思远寺主法师僧显。可敕为沙门都统。详究魏文帝敕昙曜为沙门都统。乃自曜公始也。曜即帝礼为师。号昭玄沙门都统。欣佛法重兴。雕石造像。译<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>经并付法藏传等。是此师也。齐则以法上为昭玄统。法顺为沙门都。然都者虽总辖之名(九官曹多以都字为其总摄也)而降统一等也。又乌苌国僧那提黎耶舍隋言尊称。先于齐国亦为昭玄统也。高齐之世何统与都多耶。答曰。时置十员。一统一都为正为副故多也。大隋受命亦用统名。始以昙延为沙门大昭玄统(别加大字)次则灵藏法师为大兴善寺主。寻署昭玄都。唐穆宗元和元年闰正月。以龙兴寺僧惟英充翰林待诏兼两街僧统。英通结中外。假卜筮惑人故有是命。寻以非宜罢之。自尔朱梁后唐晋汉周洎今大宋。皆用录而无统矣。偏霸诸道或有私署。如吴越以令因为僧统。后则继有避僭差也。寻降称僧正。其僭伪诸国皆自号僧录焉</p><p>左右街僧录(左右街自起置<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>使所属。及置僧录。还用左右街也僧置录以录之。功德又各辖焉)</p><p>自唐有天下。初则佛法萎迟。盖李教勃兴。物无两大故也。传奕上疏条释氏之愆。神尧不无其惑。次巡幸东洛。太宗诏令僧尼班于道后。高宗御极议欲令拜君亲。则天归心释门。还令僧班道上。中睿之世微更发挥。玄宗之朝一往崇道。僧寺止立三纲而已。昭玄统正革而不沿。僧务官方沈而弗举。道宣律师被敕为西明寺上座。即其例也。至文宗开成中。始立左右街僧录。寻其人即端甫法师也。俗姓赵。德宗召入禁中。与儒道论议。赐紫方袍。令侍太子于东朝。顺宗重之。若兄弟相与卧起。恩礼特深。宪宗数辛其院。待之若宾友。掌内殿法仪。录左街僧事。标表净众一十年。即元和中也。由此观之。僧录之起自端甫也。甫公文宗开成中卒。开成后则云端为僧录也。端公奉敕旨。欲芟夷释氏。先下诏曰。有佛教来。自古迄今。兴废有何征。应仰两街僧录与诸三学僧。录其事目进上成推法宝大师玄畅。序述编次。畅遂撰三宝五运图。明佛法传行年代。若费长房开皇三宝录同也。次则宣宗朝。灵晏辩章为僧录。同奏请千钵大教王经入藏(章晏二公受僧录见五运图)大中八年。诏修废总持寺。敕三教首座辩章。专勾当修寺。护军中尉骠骑王元宥。宣章公由首座充左街僧录。次净光大师僧彻充右街僧录。懿宗咸通十二年十一月十四日。延庆节两街僧道赴麟德殿讲论。右街僧录彦楚赐明彻大师。左街僧录清兰赐慧照大师。僖宗朝则有觉晖为僧录焉。中和巢寇犯阙时。僧录云皓与道门威仪杜光庭执香罏案等。随驾苍黄穿袜行。至武功脚皆创疼。及收复京师。随回方署录职。莫知于时。僧道引驾仪式持香案何耶。所言录者。有晋宋录。录其经法傍教传翻译人物等事。故魏诏曰。近得录公等表。录公乃是僧曹总录。犹言录事也。伪秦始立僧正。则以法钦慧斌二人掌僧录也。有唐变态正乃错诸录则用矣。盖礼乐自天子出也。时既所高物<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>竞。任使魏统如草。秦正若林。皆归唐录区宇中矣。譬若尚贤尚齿。属尚贤之代。齿何用乎。尚白尚青。当尚白之君。青勿先也</p><p>僧主副员</p><p>姚秦立正也。虽无副正之名。而有贰车之意。故用慧远为悦众。钦斌二公掌录。斯乃阶级分曹同成僧务。而不显言副正二字。及魏世更名僧统。以为正员。署沙门都。以分副翼。则都维那是也。故孝文帝诏云。副仪贰事缁素攸同。顷因曜统独济。遂废斯任(知昙曜前曾立副职)今欲毗德赞善。固须其人。皇舅寺法师僧义。行恭神畅。温聪谨正。业懋道优。用膺副翼。可充都维那以光贤徒。乃知魏以悦众为副。例知姚秦世慧远为副也。若尔者。后魏亦用秦制。而僧传不指。盖不明练辞义耳。又于时各寺别立三官。寺之都维那莫有相滥乎。答此有二不滥。一敕署令于昭玄僧统不为副。二自带昭玄下都维那。岂同寺之悦众耶。南朝宋孝武帝重慧璩。璩曾对帝唱导于斋会中嚫璩一万敕为京邑都维那。此以京邑二字简异也。江左立正。而有立副者。有不立者。及隋一统。还准北朝用统为正。以都为副。至唐元和长庆间。始立僧录。录左右街僧。亦无贰职。次有三教首座。昭宗乾宁中。改首座为副僧录。得觉晖焉。副录自晖公始也。朱梁后唐晋汉周或置或省。出没不定。今大宋太平兴国六年。敕立右街副僧录。知右街教门事焉</p><p>讲经论首座</p><p>首座之名即上座也。居席之端。处僧之上。故曰也。寻唐世敕辩章检校修寺。宣宗赏其功署三教首座。元和中端甫止称三教谈论。盖以帝王诞节。偶属征呼。登内殿而赞扬。对异宗而商搉。故标三教之字。未必该通六籍博综二篇。通本教之诸科。控群贤而杰出而脱。或遍善他宗。原精我教对王臣而<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。挫执滞而有功。膺于此名则无愧色矣。次后经论之学或置首座。三教首座则辩章为始也。朱梁洎周。或除或立。悉谓随时。今大宋有讲经讲论首座。乃僧录之外别立耳</p><p>国师</p><p>西域之法推重其人。内外攸同。正邪俱有。昔尼犍子信婆罗门法。国王封为国师。内则学通三藏。兼达五明。举国归依。乃彰斯号。声教东渐。唯北齐有高僧法常。初演毗尼。有声邺下。后讲涅槃。并受禅数。齐王崇为国师。国师之号自常公始也。殆陈隋之代。有天台知顗禅师。为陈宣隋炀<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>师。故时号国师(即无封署)至则天朝。神秀领徒荆州。召入京师。中睿玄四朝皆号为国师。后有禅门慧忠。肃代之时。入宫禁中。说禅观法。亦号国师。元和中。敕署知玄。曰悟达国师。若偏霸之国。则蜀后主赐右街僧录光业。为祐圣国师。吴越称德韶为国师。江南唐国署文遂为国大导师也(导师之名而含二义。若<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>中。商人白导师。言此即引路指述也。若唱导之师。此即表白也。故宋衡阳王镇江陵。因斋会无有导师。请昙光为导。及明帝设会。见光唱导称善。敕赐三衣瓶钵焉)</p><p>杂任职员</p><p>寺之设也三纲立焉。若网罟之巨纲提之则正。故云也。梵语摩摩帝悉替那羯磨那陀。华言言寺主上座悦众也。详其寺主起乎东汉白马也。寺既爰处人必主之。于时虽无寺主之名。而有知事之者。至东晋以来。此职方盛。故侯景言。以萧衍老翁作太平寺主也。后周则有陟岵寺主。自敕封署。隋有大兴善寺主。唐太平公主奏胡僧慧范为圣善寺主。仍加三品封公爵。则天以薛怀义为白马寺主。尽由敕补。自余诸道三年一代耳。夫上座者有三种焉。集异足毗昙云。一生年为耆年。二世俗财名与贵族(如节度使刘[糸*兌]。出家物赐夏腊)三先受戒及先<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>(此名最胜)古今立此位。皆取其年德。干局者充之。高僧传多云。被敕为某寺上座是也。道宣敕为西明寺上座。列寺主维那之上。五运图中敕补者继有之。都维那者。寄归传云。华梵兼举也。维是纲。维华言也。那是略梵语。删去羯磨陀三字也。魏孝文以皇舅寺僧义法师为京邑都维那。则敕补也。是乃昭玄都维那耳。今寺中立者。如玄畅敕为总持寺维那是地。次典座者。谓典主床座。凡事举座。一色以摄之。乃通典杂事也。或立直岁则直一年。或直月直半月。直日皆悦众也。随方立之。都谓之三纲。杂任其僧纲也。唐初数叶不立僧主。各寺设此三官而已。至元和长庆间。立左右街僧录。总录僧尼。或有事则先白录司。后报官方也。朱梁后唐晋汉周今大宋皆循曩制矣。又宋齐之世曾立法主一员。故道猷敕为新安寺镇寺法主。法瑗为湘宫寺法主。至唐末多立。受依止阇梨一员。亦称法主。今朝秉律员。位最高者号宗主亦同也。依止阇梨或当敕补者。盖道俗之间。有争不分曲直。告其剖断令人息争。故号之也。周隋之际。有法导专精律范。北齐主既敬法门。五众斯盛。有犯律者。令遵理之。敕为断事沙门。时有青齐僧讼。敕令断之。繁争自弭。至隋诏住大兴善寺。断事之名遵统为始(后升为统)隋日严寺释彦琮着僧官论。必广明僧职。求本未获耳</p><p>僧主秩俸</p><p>僧之少欲本合辞荣。佛之轨仪止令分卫。其如若无尊大御下诚难。或契宿因冥招檀信。此又别时之意也。故那烂陀寺有学通诸部者。出入象乘斋食官供。此方道宠日受黄金等。自姚秦命僧[(丰*力)/石]为僧正。秩同侍中。此则公给食俸之始也。洎魏孝文下。岁施道人应统帛。诏云。应统仰绍前哲。继轨道门。征伫玄范。冲猷是托。今既让俗名。理宜别供。可取八解之义。岁施帛八百匹。准四辈之贶。随四时而给。又修善之本实依力命。施食之因内典所美。可依朝官上秩当月而施。至于身后犹斋僧。资荐僧官得时。在孝文之世也。唐代宗令度支具廪给内道场僧。又唐祠部格道士通二篇。给田三十亩。僧通经业。准上给田也</p><p>论曰。西域饮光粪衣紏众。北齐上统布服临官。或尚道情则凡愚者不畏。或多豪富则忌克者所谋。吏力岂得不无俸财。可宜多畜。盗憎民恶。负乘怀璧。立加害己。又损法门。子曰。与其奢也宁俭。宜以<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>悦服于人可矣</p><p>尼附</p><p>东晋何充始舍宅为寺。安尼其间。不无神异义解道明之者雄飞杰出矣。宋宝贤为京邑尼僧正。文帝四事供养。孝武月给钱一万。尼正之俸宝贤始也</p><p>管属僧尼</p><p>教传东汉时。历魏朝信向未臻。伽蓝全少。僧既有数。事亦无多。乃反前言。则须关白。关白何所还。在鸿胪寺焉。故知沙门始隶鸿胪也。西晋无说。后魏有云。初立监福曹以统摄僧伍。寻更为昭玄寺也。故隋百官志曰。昭玄寺掌佛教。署大统一人统一人都维那三人。置功曹主簿员。以管诸州郡县沙门矣。后复改崇玄署焉。梁僧祐云。如今同文寺也。因疑齐梁之世曾立同文寺以主僧务。未见其文。于时带司呼官故曰昭玄大统。至唐初窈无此谓。僧尼皆隶司宾。案会要云。则天延载元年五月十五日。敕天下僧尼隶祠部。不须属司宾。知天后前系司宾也。此乃隶祠部之始也。义取其善攘恶福<a href=\"/remen/jiezai.html\" class=\"keylink\" target=\"_blank\">解灾</a>之谓也。玄宗开元十四年。中书门下奏僧尼。割属鸿胪寺。从之一十五年正月。敕僧尼令祠部捡挍。道士女冠隶宗正寺。盖以李宗入皇籍也。宪宗元和二年二月。诏僧尼道士。全隶左右街功德使。自是司封祠部不复关奏。会要曰。大历十四年。敕内外功德使。并宜停罢。若然者。代宗朝早置功德使。但内外与左右街异耳。元和中并司封祠部。而置左右街功德使。由吐突承璀累立军功故有此授。僧道属焉。宝历中。护军中尉刘规亦充此使。至会昌五年。废寺像。敕僧尼不宜隶祠部。于时中书门下奏云。奉宣僧尼不隶祠部。合属主客为仗。令鸿胪寺收管。宜分折奏来者。天下僧尼国朝以来并隶鸿胪寺。至天宝二年。隶祠部(与延载时不同)臣等据大唐六典。祠部掌天地宗庙大祀。与僧事殊不相当。又可务根本。合归尚书省。隶鸿胪寺。未为允当。又六典主客掌朝贡之国七十余蕃。五天笠国并在数内。释氏出自天笠。今陛下以其非中国之数。已有厘革僧尼名籍。便令系主客不隶祠部及鸿胪寺。从之六年五月。制僧尼依前令两街功德使收管。不要系主客。其所度僧仍令祠部给牒。宣宗重阐佛宗。所度僧尼还属左右街功德使。故杨钦义充左街功德使。宣使之捕道士赵归真。昭宗朝宰臣崔某奏诛宦官。内诸司使一切停罢皆归省寺。功德使宰执带之。梁革唐命。道士不入宗正。僧尼还系祠部。梁末帝龙德元年。禁天下私度僧尼。有愿出家。勒入京比试后祠部上请焉。后唐无闻。晋以扬光远为天下功德使。自维青不轨之后。不置此使矣。至今大宋。僧道并隶功德使。出家乞度。策试经业。则功德使关祠部出牒。系于二曹矣</p><p>论曰。鸿胪寺之任礼四夷远人也。教法初来。须就斯寺。虽兴白马。终隶此司。古云僧尼系鸿胪寺者是也。及乎尝蒟酱以言美。服皮靴而稍佳。则曰四海一家。王者无外。故后魏置监福曹焉昭玄寺焉崇玄署焉。设官布局以摄僧尼。蒟酱而以生我土。皮靴而认作华装。故唐朝勒归祠部。既而因事厘革逐朝废兴故。立功德使以总之。中宗时以沙门廓清为修功德使。官至殿中监。土突军容军功莫赏。朝廷议以功德使荣之。非谓专其僧道也。于时尚书省司封先属其中。由是不出中官。洎唐末行袁绍之诛。职归宰执。皇朝盛重此职。亦僧道之幸事也</p><p>祠部牒附</p><p>尝闻僧视其官则五品。然未见令式史传明载。且信相传(又曾见僧五品非官品也)据其诵经合格。就试得通。此僧选也。剃发被袈裟。此释褐也。敕授形俱无作戒法。此官位也。讲三藏教。充如来使也。化导内外众。使背恶向善。理民也。为国行道。保民无灾。为之课最也。苟弗比其阶品视其职官。其可得乎将来法门君子对[改-己+易]。帝王请降明敕。许比某官某品。像末之时为美事之端。自我之力不其善乎。若夫稽其乡贯。则南朝有之(见高僧传)唯为搜扬便生名籍。系之限局。必有凭由。凭由之来即祠部牒也。案续会要。天宝六年五月。制僧尼。依前两街功德使收管。不要更隶主客。其所度僧尼仍令祠部给牒(唐祠部牒皆绫素锦素钿轴盖纶诰也。非官何谓)给牒自玄宗朝始也。及德宗建中中。敕天下僧尼。身死<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>者。当日仰三纲。于本县陈牒。每月申州附朝。集使申省。并符诰同送者。注毁其京城即于祠部陈牒纳告(告身即戒牒也)</p><p>僧道班位</p><p>佛法通行。朝代更历。未全鼎成。则置而勿论。及动时君。则入宫见妒。加以僧乘时而炫曜。法因事而仳离。乃与玄门抗衡角力。因有诤故遂结朋党。由朋党故遂生爱憎焉。经中不许亲近国王大臣王子等。又云。我法付嘱王臣者何。若以倚傍力轮。苟不亲近。而可得乎。若以招致殃咎。苟欲荣身。其可免乎。观其末代。垢重情移。奉身而已。罕闻为教而观近国王大臣也。脱或唯居兰若。不履朝门。谁强召呼。谁分着定。则何班位之有。然以但思独善。专事杜多。则王侯何以委知。大力曷能扶翼。故须分其表位厕其班行。去取二情各有意致。昔者教之东演也。汉魏之世或曰渺茫。晋宋以来颇闻烜赫。若其玄玄之道老氏之风。于汉魏时。存亡而已。何其知邪。如马迁作史。将老子与韩非共传。可非汉代未崇重之乎。夫立传同科。权其趣类相齐。则史官列而偶出也。是知伯阳之道前汉未光。东汉桓帝方遣中官。醮祀祈福。魏黄初三年。下敕曰。告豫州刺史。老聃贤人未宜先孔子。不知鲁郡为孔子立庙成未。汉桓帝不师圣法。正以嬖臣而事老子。欲以求福。良足笑也。此祠之兴由桓帝也。武皇帝以老子贤人不毁其道。朕亦以此亭当路。往来者辄往瞻视。而楼屋倾顿傥能压人。故令修整。昨过视之。殊整顿矣。恐小人谓此为神。妄往祷祀犯乎常禁。宜宣告吏民咸使闻知。由是观之。汉魏之间。未露锋颖至唐有羊角之现。厥道攸兴。认作祖宗。册为帝号。此君谓为雄。谁敢不雄。若史迁在唐作传。必改为帝纪也。以仲尼同传犹谓鸿毛不敌钧石也。岂得韩非妄参厕邪。汉魏之人览马史者。岂惊骇乎。惊骇不伦者。近世之情也。然则物随党别。事逐时移。预三恪者。不免旧讹。有万邦者。岂无新意。朱梁革命。敕改毫州太清宫。为老子庙。盖由帝代无定爱憎不同。释氏虽西来客教。自晋宋齐梁陈后魏北齐后周大隋。僧班皆在黄冠之上。梁武舍道不齿玄门。黄冠之徒固难争长。唐贞观十一年。驾幸洛阳。道士先有与僧论者。闻之于太宗。乃下诏曰。今鼎祚克昌。既凭上德之庆。天下大定。亦赖无为之功。宜有解张阐兹玄化。自今以后斋供行立。至于称谓。道士女冠可在僧尼之上。庶敦反本之俗。畅于九有。贻诸万叶。时京邑智宝上表陈谏不听。自此僧班在下矣。至十五年。帝幸弘福寺。赐大德五人座曰。朕宗李在先。大德大应恨恨。以宗先故。朕见修功德。不曾别造道观。皆崇寺宇也。如此宣慰。诸僧心皆喜跃。及高宗朝。有直东台舍人凭神德上表。请仍旧僧尼在道士前。并依前不拜父母。辞繁不录。则天天授二年四月。诏令释教在道门之上。僧尼处道士女冠之前。睿宗景云元年二月。诏以释典玄宗理均迹异。拯人救俗。教别功齐。自今每缘法事集会。僧尼道士女冠宜行并集(此不分前后齐行东西也)</p><p>论曰。周武轻弃我教。若锱铢尔。尝御正殿。量述三教。以儒居先。佛教居后。道教最上。由出于无名之前也。近见沈公着聱书云。唯闻二教。不闻释氏。此皆侮圣人一言为阿鼻之种也。故拓跋虎入冥。具见周武受对。并寄言隋天子。为我拔苦。文帝乃募天下出钱。营福以救荐之。且如佛无我。所遭伤毁而无报复。盖以将欲残害于彼。必先烧热于心。心为苦因。身婴恶报。自作自受。可不畏乎。昔坑孝绪着七录中。以佛教为外篇。一戒律。二禅定。三<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。四疑似。五论记。因目佛理为方外之篇。号方外教。自孝绪始也。所言方外者。同庄老也。域中之教拘絷所不及也。请以智眼照其浅深。则内外上下自区别矣。如无智眼。以玉石俱焚。薰莸共器。知复奈何。缅思后周摧灭遇隋复兴。方谓炽然。寻又微矣。唐宗老氏。释教逶迟。或抑拜君亲。或分班上下。良以有为之法何免四相迁移。譬如火焉。火中寒暑乃退。兴久必替。替极还兴。兴替相寻。未始有极。景云中。令僧班在西。道班在东。齐行并进。朱梁之世。又移厥位。今大宋每当朝集。僧先道后。并立殿廷。僧东道西。间杂副职。若遇郊天。则道左僧右。未知始起也</p><p>内道场</p><p>内道场起于后魏。而得名在乎隋朝何邪。炀帝以我为古。变革事多。改僧寺为道场。改道观为方坛。若内中僧事。则谓之内道场也。今朝兹福等殿安佛像<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>。立刹声钟。呼为内寺是也。魏大武皇帝始光二年。立至神道场。神麚四年。敕州镇悉立道场。盖帝王生此日也(寻文。是生日权建<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>耳)后天元大成元年春正月。诏曰。隆建玄风。三宝尊重。宜修阐法化。广理可归崇。其旧沙门中德行清高者七人。在政武殿西。安置行道。此内道场之始也。南朝或以尼在内中持课。又寿光殿中群僧法集。或充学士。或号讲员。或注解经文。或敷扬禅要。凡存禁中并内道场也。唐则天令大德僧法处一慧俨行感宣政等在内道场念诵。以薜怀义参杂其间。则天又于洛京大内置内道场。中宗睿宗此制无改。代宗初喜祠祀。未重释氏。而宰臣元载杜鸿渐王缙皆归向佛僧(王缙造宝应寺)代宗尝问福业<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>事。元载因而启奏。由是信之过甚。常令僧百余人于宫中陈佛像经教念诵。谓之内道场。供养甚贵。出入乘厩马。度支具廪给。每西蕃入寇。必令群僧讲诵仁王经。以攘寇虏。幸其退则加其锡赉。不空三藏官至卿监封国公。通籍禁中。又诏天下官吏。不得棰拽僧尼。又七月望日。于内道场造于兰盆。饰以金翠。设高祖七庙神座。各书神号识之迎。出内陈于寺观。引道繁盛。岁以为常。至建中中。德宗敕广德永泰以来。聚僧于禁中。严设道场。并令彻去。遣出僧众云。顺宗朝以端甫掌内殿法仪。亦是此任。宪宗穆宗文宗并端甫掌内殿法事也。文宗大和九年四月二十六日。敕停内长生殿道场。武宗初年。以生日德阳节。却置内长生殿道场。及设内斋。僧道献寿。后与道士赵归真惑乱。切齿求僧之过。至会昌四年。诏停内斋及内道场。恶意萌于此矣</p><p>生日道场附</p><p>生日为节名。自唐玄宗始也。魏太武帝始光二年立道场。至神麚四年。敕州镇悉立道场。庆帝生日。始光中是帝自崇福之始也。神麚中是臣下奉祝帝寿之始也。自尔以来。臣下吉祝必营斋转经。谓之生辰节道场。于今盛行焉</p><p>僧籍弛张</p><p>夫得果之人且无限剂。出家之士岂有司存。既来文物之朝。须设紏绳之任。其有见优闲而竞入惧徭役以奔来。辄尔冒名实非高士。僧之内律岂能御其风牛佚马邪。故设僧局以绾之。立名籍以纪之。周隋之世。无得而知。唐来主张方闻附丽。文宗大和四年正月。祠部请天下僧尼冒名非正度者。具名申省。各给省牒。以凭入籍时入申名者。计七十万。造帐入籍。自大和五年始也。若然者。前岂无籍帐邪。监福曹昭玄寺崇玄署。将何统断僧务乎。对曰。勘造僧帐。体度不同。或逐寺总知。或随州别录。或单名转数。或纳牒改添。故不同也。然则出时君之好恶。乃入籍之解张。今大宋用周显德条贯。三年一造。着于律令也</p><p>大宋僧史略卷中</p><p>大宋僧史略 卷下 (咸平二年重更修理)</p><p>右街僧录通慧大师赞宁奉 敕撰</p><p>四十一诞辰谈论(内斋附) 四十二赐僧紫衣 四十三赐师号(德号附) 四十四内供奉并引驾 四十五封授官秩 四十六方等戒坛 四十七结社法集 四十八赐夏腊 四十九对王者称谓 五十临坛法位 五十一度僧规利 五十二赐谥号 五十三菩萨僧 五十四得道证果(尼附) 五十五大秦末尼 五十六驾头床子 五十七城阇天王 五十八上元放灯 五十九总论</p><p>诞辰谈论</p><p>昔汉祖与卢绾同日生。有奉酒馔相遗。此为庆生之权舆也。后则束帛壶酒。孩儿服玩。以加祝贺。大则玉帛长生久视之意。属干物品。以为庆生之丰礼也。及闻佛法中有弭灾延命之说。则以佛事为庆也。元魏后周隋世。多召名行广学僧。与儒道对论。悦视王道。亦庆生之美事矣。唐高宗召贾公彦于御前。与道士沙门讲说经义。德宗诞日御麟德殿。命许孟容等。登座与释老之徒讲论。贞元十二年四月诞日。御麟德殿。诏给事中徐岱兵部郎中赵需及许孟容韦渠牟。与道士葛参成沙门谈筵等二十人。讲论三教。渠牟最辩给。文宗九月诞日。召白居易。与僧惟澄道士赵常盈。于麟德殿谈论。居易论难锋起。辞辩泉注。上疑宿构。深嗟揖之。庄宗代有僧录慧江。与道门程紫霄谈论。互相切磋谑浪嘲戏。以悦帝焉。庄宗自好吟唱。虽行营军中。亦携法师谈赞。或时嘲挫。每诞辰饭僧。则内殿论义明宗。石晋之时。僧录云辩多于诞日谈赞。皇帝亲坐累对论议。至大宋太祖朝。天下务繁。乃罢斯务。止重僧讲。三学为上。此无乃太厚重而贞实乎</p><p>内斋附</p><p>皇帝诞日。诏选高德僧。入内殿赐食加厚嚫。寻文起于后魏之间。多延上达。用徼福寿。唐自代宗。置内道场。每年降圣节召名僧。入饭嚫。谓之内斋。及文宗大和七年十月。改庆成节。敕停僧道内斋。至武宗初年。重置内道场。并设内斋。僧道献寿。会昌四年六月。停内斋及内长生道场。宣宗即位元年六月二十二日。敕复置内斋。许僧道献寿。梁祖开平三年大明节日。帝御文明殿。设僧斋。宰臣翰林学士预之。我大宋皇帝诞节。两街僧录道录首座并公荐两街分僧赐紫衣师号。了便同赐斋。又闻晋汉周帝生日。设百僧后量灭令数人而已</p><p>赐僧紫衣</p><p page margintb15></p></div>"
}]