[{
    "title": "印广门清法师开示《如来十号》",
    "author": null,
    "date": null,
    "html": "<div class=\"B1_text\"><div align=\"center\"><p>如  来  十  号</p></div><p><div align=\"center\">（修订版2015）</div></p><p><div align=\"center\">印广门清法师开示</div></p><p>佛：就是如来十号——如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛世尊。这十种佛号高度概括十法界上至诸佛菩萨，下至天人鬼畜，旁及山河大地、树木华（同「花」）草、风云雨雾、香甜苦辣、是非长短，我们耳闻目睹身受乃至不闻不受、感觉不到、意识不到的那些无形无相的一切万法，其本来面目都在这十种佛号内。</p><p>先看「如来」。曾经有些同修问：「师父，是如来佛大？还是阿弥陀佛大」？那么，「如来」是一切诸佛的通号，「阿弥陀」是别号。阿弥陀佛也叫阿弥陀如来，释迦牟尼佛叫释迦牟尼如来，这是方便说。究竟说，没有哪一法不是「如来」——天如来、人如来、狗如来、猫如来、泥巴如来、风如来、雨如来。万法无非从「如」而「来」。注意！这就是讲石破天惊的大法！能够受持《妙法莲华经》者，是阿惟越致菩萨，是如来使，是大菩萨从佛土再来。那为什么都是从如而来？我们没有必要讲狗是怎么个如来，猫是怎么个如来，香蕉苹果怎么个如来，那是分别法的无量法门，圆顿大法不是这样。无量的次第，无量的等级，无量的万法，我们可以成就于一生，成就于一时，成就于一念，就看你的悟性高低。</p><p>我们首先采取打官腔，讲口头禅的方式来讲述「如来」二字。「如来」就是最高度概括、体现圆顿大法「一心三藏」的功德智慧。所谓「一心」就是我们的一个念，这一个念当下就是十法界万法。所谓「一念」就是「不二法门」。怎么「不二法门」？拳头跟手掌当下是不是一个本体？你说它是一，它有两个相，拳头相和手相；你说它两个东西，是不是一个本体？说不二法门，是对二说不二，这就是一念。大家片面地来体会下一念。在没有开口，没有睁眼，没有动脑筋的时候，有没有一个东西——它通过嘴巴能讲话，通过眼睛能看，通过耳朵能听，那么它有没有形相？没有。一旦有了形相，它就变成脑子在思维，眼睛在看。每个人是不是都有这一个念啊？既然这一个念没有任何形相，也没有任何味道，什么也没有；那能不能分你的念、我的念、他的念？不能分。既然不能分，是不是整个尽虚空遍法界就是这一个念呐？那当我这一个念变出了眼睛能看，变出了耳朵能听，现出了人相、鬼相、牛相、马相的时候，这一切的相当下有没有离开这个念？是不是当下还是这个念呐？比如说拳头是一个念，变成了这是什么(打手势)？这是锤子，锤子当下是不是拳头啊？当下是不是这个念啊？那反过来讲，我的拳头没有变现锤子的时候，拳头当下是不是锤子啊？打官腔来讲：一念就是三藏，三藏就是一念；一念就是无量法，无量法当下就是一念。拳头变成锤子、剪子、扫把、木排、兔子的耳朵，五个指头代表无量的指头，这无量的万法当下是不是一个拳头啊？是不是一个念啊？既然都是一个念，锤子也是你，剪子也是你，扫把也是你，那锤子当下是不是剪子啊？剪子是不是扫把呀？人是不是鬼？鬼是不是苹果？苹果是不是茶杯？茶杯是不是释迦牟尼？释迦牟尼是不是猪八戒？诸佛出世就是要讲这个法。</p><p>这是总体上讲一念，那么我们再分开来讲三个如来藏。一切有形有相的万法——诸佛菩萨、天人鬼畜、泥巴瓦块、风云雨雾、香甜苦辣、是非好坏长短、能看到、听到、想到、能分别出来的一切东西，都叫有，都叫相，这叫「不空如来藏」。</p><p>那么，在无始之初——无始是真实说，之初是方便说。当这个十法界没有一尊佛，没有一个人，没有一个动物，没有一个植物，没有一块泥巴，没有一片风，没有一滴雨的时候，连这个虚空都没有，那个无始之初就是一个灵体，就是一个人，就是一个念存在。你不要问这个灵体什么时候来的，从哪里来的，这叫「法尔如是」！它本来就是这个样子，不是后来才有这个样子。无始无终，连现在都没有，它就是这个灵体；什么形、什么相都没有，可是它是真实存在；虽然什么形什么相也没有，它清清楚楚，明明白白，它就是十法界万法。打一个不确切的比方：我们在这里，知道自己有多少家当，是不是？沙发、席梦思、电脑、电视、小轿车，还有家里的七大姑、八大姨，一想是不是都有？但你现在能不能拿出来给我看一看？虽然拿不出来，是不是在你心里？这是没有办法的办法打这个比喻。我们当初这个念就是真实存在，什么都没有，它就什么都有，这叫「真空」，而不是虚空，也不是断灭空——断灭空连虚空都没有。注意，这是打官腔、讲口头禅。这个无形无相真实存在的东西，我们把他方便说为「0」，方便说为「原始佛」，方便说为「空如来藏」。</p><p>第三个如来藏至关重要。前两个如来藏，在藏教、通教、别教都分别从各自不同的境界能够有所觉察。这第三个如来藏是圆顿大法最高境界，叫「空不空如来藏」。它究竟了义，即空即有，非空非有。非空是对空说非空，非有是对有说非有。实际上讲「空不空如来藏」，它已经把「一心三藏」次第圆融在一起。看上去是讲三个如来藏，其实它就是一。所以圆顿大法讲，非一非三，即一即三。我下面还要打比方。为什么许多人对「如来藏」大法听不懂，认为是在听天书啊？关键在于讲法的人流于讲口头禅。</p><p>现在我们把三个如来藏与佛法中所涉及到的一些名相概念来对应。不要忽略打官腔、讲口头禅的作——它可以帮助我们提起正念，提起观照；以此为前提，再结合日常生活来打比喻。</p><p>与「性」和「相」对照：不空如来藏是「相」，空如来藏是「性」，空不空如来藏就是「性相一如，性相不二，即性即相，即相即性」；</p><p>与「理」和「事」来对照：不空如来藏是「事」，空如来藏是「理」，空不空如来藏就是「理事圆融，理事不二，理事一如，即理即事，即事即理，有其理必有其事，有其事必有其理」；</p><p>与「空」和「有」来对照：不空如来藏是「有」，空如来藏是「空」，空不空如来藏即是「有空不二，即空即有，即有即空」；</p><p>与因缘法来对照：不空如来藏是「随缘」，空如来藏是「不变」，空不空如来藏就是「不变随缘，随缘不变」；</p><p>与「阿弥陀佛」来对应，不空如来藏是「弥陀」，空如来藏是「阿」，空不空如来藏就是「阿弥陀」，「即阿即弥陀，即弥陀即阿」。</p><p>用拿手好戏来对照：不空如来藏就是手掌，就是锤子、剪子、扫把、木排、兔子的耳朵……可以这样变，可以那样变，空如来藏就是一个拳头；以做梦来对照，不空如来藏就是梦境，空如来藏就是梦人，空不空如来藏就是梦中佛事，梦境即是梦人，梦人即是梦境。</p><p>第三个角度，用智慧来思维观照「一心三藏」。当十法界万法由我们无形无相的那个灵体变现而有以后，万法当下有没有离开那个一念？没有。既然没有，在一切的万法没有现前的时候，那个无形无相的一念，有没有离开有形有相的万法？不仅没有，而且当下即是。打个比方：我现在讲「一二三」，耳朵能听到声音，眼睛能看到字形字相，头脑能想到字义，那声音、字形、字义，就是不空如来藏，这就是有。那么，我在动脑、开口之前，「一二三」在不在我心里？在心里。虽然在，它有没有任何形相？绝对没有。只要有一点点点点，就已经变成了不空如来藏。虽然没有任何的形相，它是真实存在。没有它，你想不起来，讲不出来，这就是空如来藏。同理，当我讲出了有形有相的「一二三」，当下是不是那个无形无相的真心？当下是不是不空空？不空空是不是就是空不空？再想，在我动脑想、动嘴讲之前，那个无形无相的真心是不是我后来讲的有形有相的「一二三」？空后面就是不空，是不是空不空？这是不是三个如来藏？</p><p>再打一个比方：舒拳（无形无相的空如来藏）为掌（有形有相的不空如来藏），掌未生而拳未灭，眼见掌而心见拳，则为见性，即在相见性；收掌为拳，掌未灭而拳亦未生，眼见拳而心见掌，则为明心，即在性见相；此即「明心见性」，即「无生法忍」。</p><p>再用一只气球手套（医用橡胶手套，吹起至满）开示：尽虚空遍法界，过去现在未来，一切的万法就是这一只手套，这就是「一心三藏」。里面的空表真空，它无形无相，注意，如果是木头手套、铁手套、铜手套，不足以说明这个问题，因为气球手套里面有一个空性。从理论上来讲，气球手套是不是可以现出无量的手指头（此段看视频容易理解）？太阳、月亮、星星、树木华草，是不是在这里（手套空性）啊？是非长短、香甜苦辣是不是在这里（手套空性）？都在。昨天、今天、明天是不是在这里（手套空性）？1+1=2，3+3=6，考了100分在这里（手套空性），是不是？1+1=9，3+3=8，错了，考了0蛋，是不是也在这里（手套空性）？既然都在这里（手套空性），那么任何一法，无名指是释迦牟尼，他是不是一个法人代表？食指是一个猪八戒，他是不是法人代表？1+1=2，考了100分，它是不是法人代表？3+3=8错误的，搞了个0蛋，它是不是也是法人代表？有没有哪一个不是哪一个？因为万法都是这一个念变现出来的。你如果讲3+3=8错了，这不是我，那把这里（手套空性）一破，那其它的还能不能存在？万法都是一个念之所变现。</p><p>05年我到山西阳曲县传法，一位69岁的老居士向我请法。他说：「师父，有一件事我到现在都想不明白。有一天晚上我按照墓林僧划道道，念阿弥陀佛念到9点多，清楚明白。老婆回来叫了一声，黑咕隆咚的你在干什么？然后我两个眼睛什么也看不到了，而在此之前清楚明白。」所以，白天黑夜都是假的。翻译《妙法莲华经》的鸠摩罗什大师，七岁随母到寺庙拜佛，自己把一个千斤宝鼎一只手拿着玩。其他人看了惊叹不已：「这个千斤宝鼎我们十个人都抱不起来。这个小孩力气这么大呀！」他头脑里有了重量的概念以后，那个宝鼎唰地一下落地，两手再怎么样推，纹丝不动。七岁的鸠摩罗什当下开悟。连白天黑夜、轻重多少，都是我们在打妄想。我们自以为这是一个肉团，要吃好玩好……可是《楞严经》里讲的菩萨在禅定中，火头金刚修火观，在定中这是一团火；月光童子修水观，在定中变成一滩水；琉璃光法王子修风观，在定中变成一股风；虚空藏菩萨修空观，在定中肉团身就是一个虚空，什么也看不到。五百个阿罗汉跟他对话：「虚空藏菩萨，我们听得到你的声音，看不到你的人。为了表示你的存在，我们每人供养你一件衣服，请你收下。」虚空藏菩萨说好吧，当下五百件衣服不见了。还有些歪门邪道修牛观、马观、孔雀观，最后就变成牛神马神，是不是？心法不可思议。学佛，就是要否定错误的知见。在明心见性之前，我们不可以相信自己。这就是为什么把阿罗汉、辟支佛那个天眼、那个慧眼说成是肉眼，而大乘菩萨肉眼当下即是佛眼。阿罗汉、辟支佛都不知道自己这个肉团是怎么回事，他可以证到人我空，而不知道一切万法的来龙去脉。</p><p>围绕这个手套，我们继续说明。一切的诸佛菩萨、天人鬼畜、泥巴瓦块，按照圆顿大法讲，一粒微尘、一根草芥、一根草丝、一片草叶，尽足为一真法界。这个法不得了，石破天惊啊。一粒微尘，一棵草，它当下都是无量佛，无量菩萨。这（食指空性）就是一根草，释迦牟尼佛在这里（中指空性），释迦牟尼佛是不是它呀？阿弥陀佛是不是它？它具足一切。那妖魔鬼怪是不是也是它？那么我们现在就要解决一个问题，既然没有哪一个不是哪一个，为什么释迦牟尼佛在这里（中指空性），他得到了大自在、大解脱？为什么猪八戒在这里（小拇指空性），它却不自在？为什么泥巴瓦块在这里（大拇指空性）？是释迦牟尼佛出于贡高我慢——只允许我成佛，你们这些东西只能做凡夫，是不是？是不是牛魔王（无名指空性）出于嫉妒——我牛魔王还没有成佛，你那个猪八戒算什么东西？凭什么成佛？是不是啊？都不是。成佛成菩萨，上天堂下地狱，命自我立！释迦牟尼佛为什么得到自在解脱？他是回光返照往内看，一看气球手套里面通的，所有的法都是我啊！就这一点，他心里明亮了。那么猪八戒是往外看，是不是？这是牛魔王，那是白骨精；这是释迦牟尼，那是沙僧、孙悟空；这是我老猪……他不承认整个的这些东西是他，只认为这个东西（小拇指）是他。所以他把万法与自己障碍起来，叫做「自私其小」——自己主观武断私自地认为自己小。其实它小不小？一点也不小。那为什么我们不能解脱？我们只执着于名闻利养、豪车别墅、金钱美女，父母儿女是我的，这个肉团是我的——总是在形相上执着。明明这一切的万法都是自己，他当成别人，在《楞严经》讲，这叫「认己为物」；可是他又把这个物（色身）当成自己，这叫「认物为己」。做圣做凡，一念迷悟。如果我们现在已经从理论上明白了并且深信不疑「一切的万法都是由一念变现出来的」这个道理，也就如印光大师所讲「法华奥典，妙冠群经，闻即往生，位齐等觉」，我们在最后来点明为什么祖师大德这么讲；《法华经》讲，受持一句《法华经》，生一念欢喜心，蒙佛授记；《楞严经》讲，「知妄即真，当业轮转」。「当业轮转」就是讲当人业轮转为人，当鬼业轮转为鬼，当佛业轮转为佛，轮转为菩萨。什么是根本业？意业。言为心声，行为心使，身为心役。所以在法华会，在楞严会，在莲池会，菩萨听闻佛法，不用离开讲经堂，不用离开板凳，当下成就。</p><p>我们再用莲华法来开示「如来」。莲华在华开的同时莲子现前，叫「华开莲现」。并不是说我们往生的时候，阿弥陀佛派莲华来接我们，一到极乐世界华一开，阿弥陀佛就跟我们握手……不是那回事，它是表圆顿大法的修行次第。如来如来，即如即来。《法华》《楞严》的精髓就是讲一个「如来」，就是讲「如是我闻」。所以佛在灭度之际对弟子们交代，所有经典第一句话用「如是我闻」，就是表明——明白了「如是我闻」，万法都是《妙法莲华经》，都能成就；如果不明白「如是我闻」，万法都不能成就。所以这个「如来」，是整个尽虚空遍法界一切万法的总纲领，万法无非一个「如来」。</p><p>第二种佛号，叫「应供」。常见的解法说为，佛是十法界一切众生之父，理所当然应该得到十法界众生的供养。这种解法如果用来让众生与佛法结缘，培养众生对佛的恭敬心，有它的功德。讲到究竟义，「应供」就是讲因果报应。众生应自己的身口意三业，而受其报应。就这么简单！万有引力是不是讲一切的万法相互之间都有吸引力？这个法妙啊！这个法我们把它契透精神，你要修什么？你时时事事处处都在道中。</p><p>我们先从有情的角度来分析这个「应供」。现代心理学懂得，人与人之间存在心电感应，那佛菩萨之间不言而喻。你说我们怎么想，佛菩萨知道不知道？可是佛菩萨怎么想，我们知道不知道？我们是知而不知。你是装糊涂而已啊！到底是谁在感应，要明白，就是我们的第七识。如果说同修、亲朋好友相互之间有些隔阂，有些误解，你有时候浑身是嘴都讲不清，越讲还越糊涂，越讲误解越大；这时不妨换一个方式——你只管心里暗暗地对他生欢喜心，天天为他祈祷，乃至把他的照片高置于净处，或者立上吉祥牌位，在家里礼拜他，要真心诚意的。一年半载以后，你莫名其妙地真欢喜他，他也真欢喜你！我刚剃度的时候，几个师兄弟说：「印广师啊，你咋不去亲近亲近师父啊！」因为我从小喜欢关起来门来读书。我说：「我亲近师父干什么？认真修行，就是对师父最好的亲近。」然后我跟他们开玩笑：「你们觉着师父最喜欢谁？」他们不作声，我知道他们不会讲师父最喜欢他们，也不会讲师父最喜欢我，我说师父最喜欢我。他们哈哈大笑。意思是你这个佛呆子，师父还喜欢你？我们都不喜欢你这个东西。有一次也活该他们现报，这是讲笑话啦！一个师兄对师父说：「印广师住的那个楼上还有五六个房间空在那里啊！给我一个房间吧！」师父想都没有想，说：「不行！他是一个真修行。你们不要去干扰他！」他们一下心里凉了半截——我们天天陪着师父，倒变成一个假修行。我原来供养了两部经典在办公桌上，一部《法华经》，一部《楞严经》。《法华经》是大厚本，《楞严经》是小本。我这么想了一下：这一高一矮太不相配了，如果两部经典一样大就好了。好，大概半个月以后——我从来没有提过——师父从新加坡给我带了一部《楞严经》，跟《法华经》一样大小。这是不是心电感应啊！为什么我跟我师父之间能够心电感应？因为我从剃度开始，就是带着感恩之心，感恩师父给予弟子法身慧命。当时我并不了解师父，如果师父有道行，我种他的福田，是不是？如果师父没有道行，我发愿度化师父。每天在临睡之前，我到现在都是这样，一定要称颂十方诸佛名号，最后加一句「南无剃度恩师上界下让大和尚」！这是弟子对师父应有的恭敬心。</p><p>人与人之间能够这样，那人与畜生之间呢？南昌起义失败以后，刘伯承带着两个警卫员逃跑到深山老林里，看到一只老虎，刘伯承讲：「没有关系，我们只要镇定自若呆在这里，老虎不会伤害我们。」果然，老虎看看他们就走了。如果心生恐惧，产生敌对心理，老虎非要来拼命。一定要知道，我们这个心一动，就有一种信息，有一种光波向外发射，所以叫命自我立。我曾经在一家地区肉联厂当厂长，有一次到副厂长家里，我把房子后门打开了，在院子里洗手，那么高的大狼狗欢喜地过来，我还摸摸它的头，他夫妻两个吓一跳。他们说：「它没咬你啊？这个狗可厉害了！人在外面走路，听到脚步声它就要叫，怎么没有咬你啊？」为什么没有咬我，知道吗？我那时已经是吃斋念佛了，与世无争，这个骗不了天地鬼神。如皋市朱局长家里养了一条哈巴狗，他儿子回来狗都盯着咬，叫唤不息。我第一次到他家里去，它跑到我身上来还跟我亲嘴，抱住了我。后来我带了几个弟子到他家去过，都是来跟他们亲热，舔手舔脚，转来转去的……这是不是心电感应呐！应供应供，这个法很妙啊！</p><p>人与动物、有情是这样，那与植物呢？也是一样啊！国外心理学家做过一个实验，取两棵树：对一棵树天天拳打脚踢，用恶语攻击、诽谤；对另外一棵树用善语加持，给它浇水。再通过仪器测量，发现每次走到吉祥加持的树那里，它的信息非常温和；走到受到伤害的树旁边，信息非常糟糕，那棵树直抖。我以前在无锡工商联与一些企业家交流，提了这个法。我提议从华（同「花」）市去请一棵文竹，每天跟它沟通：「文竹，我们交个好朋友怎么样？我最喜欢你啊！我的心肝宝贝啊！白马王子啊！」嘴巴讲也行，心里欢喜也行，一个礼拜以后你会发现，文竹一见到你就会点头微笑。有一个朱总回去就跟他的儿子说好，善语善念加持，结果每一朵华都跟他们点头，他惊奇不已。</p><p>总而言之，包括无情，没有哪一法不是应供。感兴趣的，自己回去做一个实验：在一个透明的玻璃杯里，用线悬一个铜板，办法是一样的，一个礼拜以后，那个铜板一看到你就会摇头晃脑；或者用两组馒头，用分别心对待它，一个礼拜以后，这一堆馒头仍然很亮很香，另一堆馒头已经发霉发臭。我们想象一下，同样的两间房子一起建成，如果一间房子里有人常住，一间房子空着，哪个容易坏啊？一定是没有人住的房子破旧得快。那个送往生的时候，刚开始尸体僵硬，面孔恐怖；经过大众连续念佛以后，亡者身体变柔软，面带微笑，那它是不是无情的泥巴瓦块？它为什么能笑？你就是把他烧成了灰它都会笑。仅仅是因为我们烦恼习气比较重，心比较粗，还没有细到那种程度，所以你看不到他在笑还是在哭。那么同样的那个死人，没有人去念佛开示，它显得很恐怖，是不是也是有情？无非是生烦恼：「我太可怜了！我太痛苦了！你们谁也不理我……」当我们对外界发出慈悲、光明、平等之心的时候，首先得到利益的是谁？是自己。近水楼台先得月，向阳华草易为春。这个心首先通过自己的五脏六腑、皮肉筋骨，而向外发射信息，然后外面的环境相应回报于我们。你是不是得到双重利益啊？所以我们要善用其心。举头三尺就有神明，何止是举头三尺？泥巴瓦块都是神明。即使瓜皮果壳都不能随便一扔，要以恭敬心放到垃圾筐里。今天吃了这个苹果，我修行的功德就跟你结缘，将来我们生生世世都是师生关系、同修关系——严格地来讲，吃大米、蔬菜、水果都是杀生；但是我们不吃，就没有办法成就道行。那么这种杀生相对而言，水果蔬菜这类众生对自己的性命不是很执着，它的意识心意识层次比较轻，所以这个债是不是好还一些？而且我们发心与它结缘，将来成就它；动物相对而言，我执比较重，债难还。</p><p>第三种佛号叫「正遍知」：分说为「正知」与「遍知」。正知，觉悟我们的心能够变现出万法，也叫「总相智」「一切智」，也叫「根本智」。在心就能悟相，叫在性见相，也叫明心；「遍知」叫「道种智」，知道一切的万法当下即是我们一念之性，这叫在相见性，指万法的来龙去脉，也叫「差别智」。这个「正知-总相智-一切智」，一般地是从总体上、从根本上来对世间万法观照、认知。「差别智-道种智」带有方法论，从具体、个别上来观照一切万法的来龙去脉以及相互之间的关系。所以「正知-总相智-一切智」，与世界观相对照；「遍知-差别智-道种智」与方法论相对照。这两种智慧圆融圆满，叫「一切种智」，就进入「一心三藏」的修行次第，由分真即佛直至成圆满之佛。这是圆顿大法的智慧，是如来果地的智慧。</p><p>比如：在拳头的时候，我们就知道拳头就是手掌，就是锤子，就是剪子、就是什么什么，这叫「在性见相——正知」；当变现出手掌、锤子、扫把等等，你知道这一切都是拳头，这叫「在相见性—遍知」；每一个法的来龙去脉你都知道，乃至由此推论，锤子就是剪子，剪子就是扫把，扫把就是木排，没有哪一法不是哪一法，这个时候就叫「一切种智——正遍知」。那到了「正遍知」，一般地是圆顿大教明心见性的境界，最起码在别教要初地位的菩萨才能见到这个法。</p><p>第四种佛号叫「明行足」：前面「正遍知」，是就见道位、菩提果、智德而言，成就了菩提智；「明行足」是就证道位、涅槃果、断德而言。明无量法门叫「明足」；成就如来果位，叫「行足」。在有的经典也叫「两足尊」，智慧也足了，福报也足了，菩提果成就了，涅槃果也成就了，叫「明行足」。明行足，一般是说为究竟如来果位的功德。</p><p>第五种佛号叫「善逝」：用俗语来解释，善逝就是死得好。你对世间人讲死得好，他还生烦恼。你这不是骂我？咒我早死啊！却不知道歪打正着。世人之死皆有种种痛苦，那不能叫好；有些修炼的人坐在那里往生，站在那里往生，也不叫好。修外道讲究色身调理，他能走得很自在，但是到底在哪一道，没有把握，即使在二十八层天都是外道凡夫；或者一些有福报的鬼王、城隍老爷、土地老，也统统不能说善逝；阿罗汉、辟支佛证得人我空，解脱六道轮回，但是他不敢从空出有，示现六道凡夫众生相，也不叫善逝；菩萨愿身再来，带着隔阴之谜，借父母这个缘现肉团相，也不叫善逝。唯有究竟极果如来，非生、非灭、非中流，当下就是生，当下就是灭，有生有灭的无情万法，有生住异灭的泥巴瓦块，无形无相的真空、那个四空天凡夫，乃至没有哪一佛，没有哪一法，不当下就是我；一切的虚空世界、山河大地，大至佛刹，小至微尘，无非诸佛法身真常。在生非生，在灭非灭，这叫「善逝」。这就是修行人的终极目标——得到这种最自在圆满大解脱，这叫「善逝」。明白了这个道理，叫「善生」行不行啊？叫善什么什么都行。这种「善」，是至善、圆满之善。</p><p>第六种佛号叫「世间解」。相对于以上讲的「如来、应供、正遍知、明行足、善逝」而言，他知道了这一切万法，证到了这一切万法，还要能够善于变成语言，来开示演讲这些万法。以上都是讲自利，到了这里的「世间解」就是讲利他。这里的「世间」，包括凡夫世间和出世间一切万法；佛无所不知，无所不晓，无所不解。《金刚经》怎么讲？所有众生，若干种心，如来悉知。包括无想众生，无想众生是方便说，恒顺众生而言。一切众生心里怎么想，佛都知道。为什么？因为所有的人都是一尊佛，都是一个念，佛已经突破了这种障碍。天鹅羽毛为什么白？乌鸦头毛为什么黑？松树为什么笔直笔直？荆棘树为什么弯弯曲曲还带刺？乃至天上有几片风？有几滴雨？每一滴雨又有多少个小毛毛头？如来全部知道。那我们知道不知道？统统是现成的，仅仅是我们现在不愿意知道。我们现在只想知道名闻利养、金钱财宝、皮肉筋骨、父母儿女而已，所以我们的心已经被调虎离山——离开了涅槃山来到了威虎山，然后看看哪里有好吃好喝的，想办法来干，是不是？只看我们往哪个方面去用心。</p><p>第七种佛号叫「无上士」：这个「士」在古汉语也好，现代的语言风格也好，都是对有学问、有地位、有身份、有权威、有贡献、有作为的这一些出类拔萃的人的一种尊称。比如战士、勇士、烈士、大士、开士，大士和开士是佛法里对明心见性的修行人而言。按照「法华三昧」的解释，心外无法，法外无心，叫「无上士」。无上无下，无内无外，无前后左右，无空无有，无分别无不分别，那就变成即空即有，即前即后，即上即下，即内即外，这就是不二法门。「一即一切，一切即一」，叫「无上士」。</p><p>第八种佛号叫「调御丈夫」：佛法不离世间法，同样以正反两种思维方式，两种手法来待人接物。所谓「调」，就是诸佛菩萨以一种和平、柔顺的方式来教育、引导、帮助那些相对正直、善良的修行人；「御」是指以一种强硬、打击的方式来管教那些比较刚强蛮横、愚痴颠倒的众生。诸佛菩萨教化众生，既可以示现善相，也可以示现种种恶相；我们不可以用牛羊眼、下劣心来妄加评测老师。你看一般的大寺庙，一进门口，首先看到的是谁？弥勒菩萨。这就是调的象征，咧着大嘴巴，挺着大肚皮——大家好，统统进来。再往后面一转，弥勒菩萨背后是谁呀？韦驮菩萨！韦驮菩萨可不是跟你嬉皮笑脸，宝杵攥在手里——你老实点，不老实揍你。还有四大天王在旁边看住你，韦驮菩萨来不及收拾你，你也别想逃出这个大门。这个涉及到我们对道场管理制度的问题，二者不可偏废。一般道场建立之初，根据末法时代众生脸皮很薄、心很脆弱、浮躁的特点，以宽松为宜。有些人脸皮很薄，你给他个脸色，有一句不中听的话，他可能永远不到这个寺庙来。如果不能容纳人，你这个道场是失败的！你是白建了！我们是按照本师释迦牟尼佛当年的政策，来者不拒——不管是老弱病残、强盗土匪、卖淫嫖娼，你只要来，统统接纳，谁是谁啊？谁是好人？谁是坏人？都是我。你只要来，你只要接受了「如来藏」大法，不管你好人坏人，早晚上床，一起天亮，统统成就！好人坏人是谁啊？从第二义谛来讲，都是我们过去世的父母儿女、至亲骨肉；从第一义谛来讲，都是我们一个人，没有第二个人。这个法妙啊！这就是道场成立之初要「调」，就跟弥勒菩萨一样。那么当人多了以后，如果我们不加以一定的管理，也会把这个道场葬送！管理制度要跟上去，但是仍然要注意分寸和火候。下面跟上来就一个「丈」。「丈」就是分析、权衡、比较。在唐朝时，官方规定，寺是教育场所。国家宗教局前局长叶小文同志向全国发出号召，讲经说法是出家人的天职。后面的「夫」呢，这是语气助词，你真是一个调御丈啊！</p><p>第九种佛号叫「天人师」：顾名思义，佛是天道和人道的老师。可是这么一想，不对啊！佛为十法界之父，怎么好好就变成对天人情有独钟？所以这个问题我们要具体分析。打一个比方，譬如父母有十个儿女，或者三个儿女、八个儿女，其中一部分儿女相对而言比较健康长寿富贵；另一部分儿女比较贫穷下贱，体弱多病。如果父母有一定的经济能力，他是帮助那些比较富贵健康的儿女？还是帮助那些贫贱穷困、体弱多病的儿女啊？肯定是对后者提供帮助。佛把法界分为十个层次，对于佛、菩萨、阿罗汉、辟支佛这四圣法界的众生，已经解脱了六道轮回之苦。所以对于这些众生的帮助，属于锦上添华。按照轻重缓急的原则，是不是这些人应该放到轻和缓的地位？理所当然应该对六道众生帮助。三界火宅包括天堂。所以教化这一部分众生是雪中送炭，应该放在重和急这个地位。</p><p>那么再就六道来看，是不是应该向三恶道众生倾斜啊？可是三恶道里，由于物质文明和精神文明实在糟糕，佛想帮助，心有余，力也有余，但是三恶道的众生没有办法来接受佛的帮助。地狱道的众生一天一夜万死万生，枪打、刀砍、锤子锤。你说：「现在，如是我闻，一时佛在哪里……」，他能听得进吗？简直是痴人说梦话！鬼道众生一年到头饿得惶惶不可终日，好不容易盼到一粒米，盼到一口浆，送到嘴边成了一团火，你说他能听佛来传法？那么畜生道的众生不要谈，它愚痴。你对畜生说法无非是对牛弹琴。你一种直观的慈悲心它能感受到，但是真正讲文字义理，它没有办法消化。</p><p>三下五除二，剩了人道和天道，天道包括阿修罗。三善道的物质文明、精神文明相对而言，基础良好，生存空间比较大。来个打破沙锅问到底，在天道和人道又是哪一道为主？告诉大家，是人道。人为万法之灵。天人的生活只有光明，没有黑暗，只有快乐，没有痛苦；而人道统统具足，有利于开智慧，有利于奋发图强。读过〈观世音菩萨普门品〉和《楞严经·卷六》的同修就会知道，在这两品经里讲到，有一种天人情愿舍去天堂的福报，求观世音菩萨加持到人间来修行。佛在《大方广佛华严经》讲：成佛、成菩萨、成辟支佛、成阿罗汉、乃至升天都是在人道成就，下地狱、做鬼、做畜生也是在人道成就。因为人道有善和恶这两方面因缘，由此作为中间道往上升、往下落，所以人法就跟国家宪法一样，是基本法。到天上做人、做天、做神、做鬼，是不是人相啊？都是人相。成佛成菩萨，也是示现标准的人相；那些有福报的鬼王、畜生王，基本都是人相；那个摩睺罗伽大蟒蛇，他就是人身蛇头；在地狱的众生也是现的人相，由人道到地狱里受罪。因为人是万法之灵，你不好好修行，造业就要受报；畜生道的众生造业，仍然在畜生道受报；地狱里受报是最苦啊！到了鬼道的众生，他造业一般在鬼道里受报，然后往畜生道升，到了畜生道再往人道升，他不会往地狱里面去。人可以下地狱，天人可以下地狱，你有这个条件却不好好行善断恶，所以必须到地狱里受最痛苦的惩罚。祖师大德讲，「人身难得今已得」，我们现在是不是都得了？不需要向观世音菩萨送礼。我要到人道里来，现成的。「正法难逢今已逢」，我们遇到正法，就在这里！所以祖师大德敲着板桌吼啊！「你还不快走啊！人身一失，万劫难复！」并不是说我这个人身失去了，再做七十年的猪，然后又投人身——不可能的事情。要懂得珍惜人身，抓住当下！人命在呼吸之间。你错过了这一次成就的机会，我不能肯定你还有第二次机会。虽然我想长期住世弘法，虽然我想将来在这里讲《法华经》《楞严经》，我都不能肯定我还有明天、明年、下个月。学佛一定要懂得抓住当下，正法就是难遇。要想听闻《法华经》，无量国土无量众生无量劫都难。机不可失啊！这是真的。那么这个「天人师」是讲释迦牟尼佛？是讲药师如来？还是讲大势至菩萨？还是讲《法华经》《楞严经》呐？又要搞明白，依谁为师？是依法为师，依法不依人！《法华经》《楞严经》住世，就是如来全身。怎么叫「全身」？既是佛的肉身、化身、应身；又是佛的法身、真身；又是佛的报身、智慧身。依人不依法，这是学人的悲哀。这种迷惑颠倒，从现在开始，要画一个句号。诸佛如来都是从法化生，用「一心三藏」把我们的迷惑颠倒化掉，而成为智慧报身。</p><p>第十种佛号叫「佛世尊」。一般的解释：佛是世间出世间一切人都应该尊敬的。那么，这里的「尊」不是动词，是一个量词。尽虚空遍法界十方三世，一切万法都是一个「尊」，都是一个人。这是没有数量的数量，也就是说，这叫「不二法门」。这是我们从如来十号观照本来面目。</p><p>下面，从汉字的结构来深入探讨。众所周知，中国的语言文化博大精深，汉字以象形字为主，往往一个字由几个部分组成，这在世界各国的文字文化上面来讲，是独一无二的；而汉字的结构往往能体现出宇宙人生的真理。你看，「教、老、道、德、天、仁」，等字，都非常有意思，都体现出中华民族的文化传统，是受诸佛如来的特别加持，一点点都不要怀疑，其它任何国家的文化没有办法相比。明白这个道理对于我们中华民族的众生承担如来家业，具有重要的指导意义。要知道，诸佛出世之前必须在第四层天，也就是兜率陀天弥勒内宫，观察四千年。第四层天1天等于人间400年，4000乘以400还要乘以365，大概要几亿年，干什么？是要周密部署安排他在哪一片国土降生；再选择他投生的父母；安排他住世80年讲经说法的次第；要成就哪些弟子；要哪些弟子来护法；并进一步地安排他灭度以后正法一千年、像法一千年、末法一万年，乃至在弥勒下世前56亿7千万年的十方法界怎样来弘扬佛法，这是佛的总体计划。当年如来灭度之后，大概是八九百年的光景，印度国内发生政局动乱；所以佛的弟子们逃亡到中国的西藏，再由西藏进一步把佛法传到内地。而中国象形文字的发明创造有五六千年的历史。佛在兜率陀天的时候，凭其智慧，能不能提前知道这个状况呐？能！几百万亿亿年前后的事他都知道！诸佛考虑到将来的正法一定要传到中国，因为中国人口多啊!想一想中国文字是谁创造的。如果不把这个前提讲清楚，你们会认为我在这里故弄玄虚，在借题发挥。</p><p>先来分析这个「佛」字。左右结构，左边是一个单人，右边是一个弗。从弗字来讲，是不是否定的意思啊？修行就在于否定小我而进入菩萨道、佛道，否定我们的身口意三业；否定我们无始劫以来的迷惑颠倒、妄想、贪嗔痴慢疑种种习气；否定我们对这个肉团身的执着；否定我们对父母儿女这些家庭眷属的情执；否定我们对种种名闻利养的贪求。当否定到一丝不挂的时候，你成佛了！只要还有一个念为自己，就是一种情执，你不能成为究竟圆满之佛。往往有许多大贵大富之人在走投无路的时候，进入佛门；也有些遇到绝症大病之人后进入佛门。他们一旦沦落街头的时候，无非是两种结果：一种是自取灭亡，自绝于人生；一种是成为大开悟之人，「啊！我现在终于解脱了！从重重的名闻利养中解脱了！」世间有一句俗话：无官一身轻，无钱一身轻。不成佛也成仙，他感到解脱了。往往就是这样，这是帮助我们来体会自我否定这种心态，加深理解「佛」字的含义。我这一生受父亲影响很深。他在解放前是一个名乡长，五八年那个时候搞浮夸风。我们江北历来就是只种旱粮不种水粮，那个麦子长得有膝盖高，政府下命令砍掉，要学江南人种水稻。我父亲态度坚决：「要砍麦子，你先把我脑袋砍掉，然后再来种水稻。」这在那个时候就是大逆不道，当然政府没有砍他的脑袋，给他罢官。但我父亲这个人始终是乐天派。那时候他的一个老战友家里被盗了，我父亲哈哈大笑：「谁也偷不到我的东西！我所有的财产都在身上！走到哪里带到哪里，睡觉也在我身上。」什么意思呢？穷人穷得自在。还有一句话让我记忆深刻。父亲曾讲：「我如果打人家三拳，我三天晚上都睡不着觉，人家打我三拳，我都能呼呼大睡。」讲了以后也是哈哈大笑，这些事情我都记得清清楚楚的。人就要学会自我否定，不要把自己看得太重，容易得道。</p></div>"
}]