[
  {
    "title": "目录",
    "html": "<div class=\"B1_text\"><h2><strong>目录</strong></h2><div><div class=\"text-center\">般若心经讲记·第五次修订版</div><div class=\"text-center\">印广法师主讲</div><div class=\"text-center\">佛历二五五四年·慈航净苑</div><div class=\"text-center\">▌经文....................................2</div><div class=\"text-center\">▌开堂白..................................3</div><div class=\"text-center\">▌总释经题................................9</div><div class=\"text-center\">▌如是我闻...............................29</div><div class=\"text-center\">▌正解经文...............................39</div><div class=\"text-center\">▌附记..................................143</div><h2 class=\"text-indent\">▌经文</h2><div class=\"text-center\">摩诃般若波罗蜜多心经</div><div class=\"text-center\">大唐三藏法师玄奘译</div><div class=\"text-indent\">观自在菩萨。行深般若波罗蜜多时。照见五蕴皆空。度一切苦厄。舍利子。色不异空。空不异色。色即是空。空即是色。受想行识。亦复如是。舍利子。是诸法空相。不生不灭。不垢不净。不增不减。是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。以无所得故。菩提萨埵。依般若波罗蜜多故。心无挂碍。无挂碍故。无有恐怖。远离颠倒梦想。究竟涅槃。三世诸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。故知般若波罗蜜多。是大神咒。是大明咒。是无上咒。是无等等咒。能除一切苦。真实不虚。故说般若波罗蜜多咒。即说咒曰。揭谛揭谛。波罗揭谛。波罗僧揭谛，菩提萨婆诃。</div></div></div>"
  },
  {
    "title": "开堂白",
    "html": "<div class=\"B1_text\"><h2>▌<strong>开堂白</strong></h2><div><div class=\"text-indent\">《摩诃般若波罗蜜多心经》，这个版本是由唐朝三藏法师玄奘大师所译。这在三藏十二部经中，既可以称为一部大经，也可以说是一部小经。所谓大经，是讲它的包容量，《心经》为一切万法所依之本；所谓小经呢，它的篇幅最小，260个字。那用《心经》来概述我们的真心本来面目再合适不过，这就是小大不二。</div><div class=\"text-indent\">我原计划是准备利用这个夏天，给各位讲解一部《妙法莲华经》，那么中途怎么改变这个计划呢？这有两个缘起：</div><div class=\"text-indent\">一个缘起，是江苏一些弟子呼声很高，要求我尽快出版所有的讲记。想来想去呢，得先小后大、先短后长，所以先把《心经讲记》和《佛说阿弥陀经讲记》予以流通。末法时代众生心地脆弱，急功近利，恨不得几句话就开智慧。根据这个特点，我决定把这部经重讲一遍，把它作为一个标准本来流通。</div><div class=\"text-indent\">第二个缘起，这几年越发感觉到，古今中外许多的《心经》注解和讲义等并不圆满——在关键的字眼上，什么「诸法空相」啊，「以无所得故」啊，仅仅讲成禅宗见空性的境界，这属于错会如来义。那么，把这样一部经讲清楚，对于道场的修学次第具有非常重要的意义；对佛法今后的发展也有非常重要的意义。</div><div class=\"text-indent\">我这次在文峰寺用45天的时间讲了一部《法华经》，佛在《法华经》中五次提出「如来灭后，后五百岁……」广流通于南阎浮提；再回顾到佛在《楞严经》反反复复讲，末法时代如何如何……我这次特别感慨：佛不讲一、二，也不讲三、四，唯独咬住第五个五百年，是什么道理？佛把如来灭后佛法发展的三个时期分为：正法一千年，像法一千年，末法一万年。佛不提正法，不提像法，就是咬住末法时代，是何道理？</div><div class=\"text-indent\">我猛然想起，现在正是处于如来灭后第五个五百年——今年是佛历二五五四年，减去佛的世寿八十年，是不是后五百岁中的第474年呐？好好想这个道理，佛为什么时时抓住这个时空点？那么我们在这个时空点弘扬这部经，佛在两千五百年之前知道不知道啊？对他而言，不过是当下一念的事情。谁把这个道理搞明白，谁得大受用。同时，现在进入信息社会，对于佛法的传播非常有利。那么，在这样一个关头，讲清佛法的真谛，使佛法深入人心，这是我们的当务之急。</div><div class=\"text-indent\">我这是第二次下扬州，大概有五六个居士拭目以待，而且讲了：「师父啊，你这次来，不瞒你说，我们是眼睛瞪得大大的，耳朵拉得长长的，看你与《法华经》上讲得是不是一致。」因为我第一次去讲了《佛说阿弥陀经》和《过五关度六将证菩提》以后，引起很大质疑，认为我是讲邪法。听经闻法当下能成佛？从来没有听说过！当他们读完《法华经》，最后感慨万分说：「师父啊，经过我们的印证，您把《法华经》原汁原味地开示明白了。」特别是《法华经》涉及到当下成佛（分真即佛），少说几十处。</div><div class=\"text-indent\">《楞严经》讲到：摩登伽女听佛几句话当下证三果罗汉（她之前连罗汉是什么都不懂）；再听文殊菩萨几句偈颂，当下证四果罗汉，这还是小乘果位1。憍陈如比丘听佛传了「苦集灭道四圣谛」之后，当下证四果罗汉2。舍利弗听马胜比丘四句偈颂：「诸法因缘生，诸法因缘灭。吾师大沙门，常作如是说」，实际上凭借前两句偈颂，当下证初果罗汉；然后皈依佛陀，再听一遍四圣谛，当下证四果罗汉3。在《楞严经》倒数第二段讲，一个马上就要下无间地狱的十恶不赦的大坏人只剩一口气了，听了「如来藏」的道理，当下罪障消除，变地狱为佛土4。</div><div class=\"text-indent\">而在《法华经》，这方面讲得太多太多5。《法华经?分别功德品第十七》讲：听闻一篇《如来寿量品》，无量众生证罗汉、辟支佛、菩萨、乃至等觉菩萨，特别是讲「尔时」6；最后还讲，对《法华经》一念信解，功德有多大呀？比你修布施、持戒、忍辱、精进、禅定这五度法门（实际包含了无量法门）——八十万亿恒河沙劫的功德还要大无量倍7。就是一念信解而已啊！好好看佛的金口玉言。</div><div class=\"text-indent\">成佛就是一念的事。《楞严经》怎么讲的？「决定成佛，譬如以尘扬于顺风，有何艰险8」；「何籍劬劳，肯綮修证9。」佛就是这么讲的，无修无证，哪里要你修？哪里要你证啊？祖师大德也是这么讲啊10：圆顿大法不历修证，一步登天。你本来就是佛，只看你悟不悟。但是无修无证，不妨修不妨证——我们讲无修无证，是指证到分真即佛，也就是明心见性的菩萨。要证圆满之佛，还要修，还要证；同时，为了教化众生，我们还要示现有形有相的修证，自他两利。</div><div class=\"text-indent\">下面，介绍《心经》在整个宇宙万法中的重要地位。首先要知道，法华道场以《大乘妙法莲华经》《大佛顶首楞严经》《心经》和《佛说阿弥陀经》这四部经作为指导经典。</div><div class=\"text-indent\">自古以来，「成佛的法华，开悟的楞严」，就是因为这两部经说尽了宇宙人生的真理。《法华经》跟《楞严经》是一部经，《楞严经》的另一个经题就叫《大方广妙莲华王》11。《楞严经》从正面与反面采取有破有立的这种次第，由浅入深地解释宇宙人生的真相；而《法华经》呢，以正面肯定的方式高度概括《楞严经》所阐述的真理，并且反复强调「花开莲现，即因即果」12。</div><div class=\"text-indent\">《心经》是从理论上，从性上，高度概括《法华经》《楞严经》；《阿弥陀经》是从相上来高度概括《法华经》《楞严经》。但是在解释《心经》和《阿弥陀经》的时候，都必须从性相不二这两方面展开。有些法师把《心经》仅仅解释成禅宗的见空性，把它判为初住位的菩萨；或者高一点的层次呢，判为初地位——这是不对的，《心经》是圆满如来果位的境界。也有些法师把《阿弥陀经》讲成了藏教菩萨的着相修行。这是对两部经典的曲解啊！</div><div class=\"text-indent\">自古以来把《阿弥陀经》说为「法华秘髓」13。你如果把它讲成藏教菩萨的境界，能叫秘髓吗？只能叫皮毛，是变成《法华经》的皮毛。为什么这几千年以来，「求道者多如牛毛，得道者凤毛麟角」啊？这可是定论呐。直到现在《法华经》传开以来，这个问题已经画上句号。</div><div class=\"text-indent\">通过这部《心经》，我会把各大宗派一些主要法师的论点提出来研究；但要注意一个倾向——某位法师讲的这个法不究竟，并不意味着他不是菩萨。因为我们没有对他所有的著作进行全面的研究，也没有必要去研究，我们只讲这个法对不对就行，涉及不到人我是非。这是从究竟了义之处来看《心经》所起的作用，它和其他三部经是一脉相承的。</div><div class=\"text-indent\">其次，再从三藏十二部经来看，《心经》是恒沙经典的心经。注意，如果是把它解释为禅宗的《心经》，那藏教以谁为心经呐？圆顿大法以谁为心经呐？是不是？它是整个一代佛法的《心经》。</div><div class=\"text-indent\">再者，《心经》是十法界一切万法之心经。不管佛法、外道法、邪法、伊斯兰教、天主教、儒教、道教，乃至泥巴教、树木花草教、牛教、马教、狗教……没有哪一法不是《心经》。「心外无法，法外无心」。随拈一物，这个茶杯是不是《心经》呢？任何一个人，任何一头牛，任何一个泥巴瓦块，当体即是一真法界；它不失一丝一毫，不多一分一厘，这叫《心经》。</div><div class=\"text-indent\">我们耳闻、目睹、身受山河大地、日月星辰、风云雨雾、黄金、人民币、牛屎、狗粪、臭虫，更不用说天人鬼畜，都是一个心，都是一个念，都是佛14。你明白了，这叫见佛，这叫明心见性。外道把开天眼、开天耳叫作明心见性，就是向往那个天堂的庄严，鄙弃那个臭垃圾堆，这是走火入魔。垃圾堆是谁啊？尽虚空遍法界就是当人当下一个念！而圆顿大教的明心见性，就在当人当下这一念！你是不是明白这一切万法都是一念变现的？有道无道，自己知道。你刻骨铭心，深信不疑，这叫见佛，这叫见性。《法华经》讲得很清楚啊！佛跟舍利弗讲：「能够听你讲《法华经》，能够受持《法华经》的人，则为见我，则为见你，则为见诸佛菩萨。15」佛并没有讲，能看到我这个肉身的人叫见佛或者见性！而且，成佛在当下，也就是《妙法莲华经》的「一念信解，蒙佛授记16」。</div><div class=\"text-indent\">?<strong>注</strong>：</div><div class=\"text-indent\">1.《楞严经·卷七》：且汝宿世，与摩登伽，历劫因缘，恩爱习气，非是一生，及与一劫，我一宣扬，爱心永脱，成阿罗汉；（注：爱心永脱，是听佛讲了四圣谛时当下证三果，成阿罗汉是听文殊菩萨偈颂当下证四果。具体参照《楞严经讲义·圆瑛大师·著》）。又，《楞严经·卷六》：普会大众，天龙八部，有学二乘，及诸一切新发心菩萨，其数凡有十恒河沙，皆得本心，远尘离垢，获法眼净。性比丘尼闻说偈已，成阿罗汉。</div><div class=\"text-indent\">2.《过去现在因果经·卷三》：当佛三转四谛十二行法轮时，阿若憍陈如于诸法中，远尘离垢，得法眼净。时虚空中，八万那由他诸天亦离尘垢，得法眼净。</div><div class=\"text-indent\">3.《过去现在因果经·卷四》：时舍利弗,闻阿舍婆耆说此偈已，即于诸法，远尘离垢，得法眼净。见道迹已，心大踊跃，身诸情根，皆悉悦预......</div><div class=\"text-indent\">尔时，世尊为舍利弗及目揵罗夜那，广说四谛。二人即得阿罗汉果。又复为彼二百弟子，广说四谛。即于诸法，远尘离垢，得法眼净，乃至亦成阿罗汉果。尔时世尊，即与一千二百五十比丘，皆大阿罗汉。</div><div class=\"text-indent\">4.《楞严经·卷十》：若复有人身具四重十波罗夷，瞬息即经此方他方阿鼻地狱，乃至穷尽十方无间，靡不经历。能以一念，将此法门，于末劫中开示未学，是人罪障应念销灭，变其所受地狱苦因，成安乐国。</div><div class=\"text-indent\">5.《法华经·药王菩萨本事品第二十三》说是药王菩萨本事品时，八万四千菩萨，得解一切众生语言陀罗尼；说是妙音菩萨品时，与妙音菩萨俱来者八万四千人皆得现一切色身三昧。此娑婆世界无量菩萨，亦得是三昧及陀罗尼；说是妙音菩萨来往品时，四万二千天子得无生法忍，华德菩萨得法华三昧；佛说是普门品时，众中八万四千众生，皆发无等等阿耨多罗三藐三菩提心；说是陀罗尼品时，六万八千人得无生法忍；佛说是妙庄严王本事品时，八万四千人远尘离垢，于诸法中，得法眼净。</div><div class=\"text-indent\">6.《法华经·分别功德品第十七》：于时，世尊告弥勒菩萨摩诃萨：阿逸多，我说是如来寿命长远时，六百八十万亿那由他恒河沙众生，得无生法忍；复有千倍菩萨摩诃萨，得闻持陀罗尼门；复有一世界微尘数菩萨摩诃萨，得乐说无碍辩才；复有一世界微尘数菩萨摩诃萨，得百千万亿无量旋陀罗尼；复有三千大千世界微尘数菩萨摩诃萨，能转不退法轮；复有二千中国土微尘数菩萨摩诃萨，能转清净法轮；复有小千国土微尘数菩萨摩诃萨，八生当得阿耨多罗三藐三菩提；复有四四天下微尘数菩萨摩诃萨，四生当得阿耨多罗三藐三菩提；复有三四天下微尘数菩萨摩诃萨，三生当得阿耨多罗三藐三菩提；复有二四天下微尘数菩萨摩诃萨，二生当得阿耨多罗三藐三菩提；复有一四天下微尘数菩萨摩诃萨，一生当得阿耨多罗三藐三菩提；复有八世界微尘数众生，皆发阿耨多罗三藐三菩提心。</div><div class=\"text-indent\">7.《法华经·分别功德品第十七》：尔时，佛告弥勒菩萨摩诃萨：阿逸多，其有众生，闻佛寿命长远如是，乃至能生一念信解，所得功德，无有限量。若有善男子善女人，为阿耨多罗三藐三菩提故，于八十万亿那由他劫，行五波罗蜜：檀波罗蜜、尸罗波罗蜜、羼提波罗蜜、毗棃耶波罗蜜、禅波罗蜜，除般若波罗蜜，以是功德比前功德，百分、千分、百千万亿分不及其一，乃至筭数譬喻所不能知。</div><div class=\"text-indent\">8.《楞严经·卷七》：云何汝等在会声闻，求最上乘，决定成佛，譬如以尘扬于顺风，有何艰险？</div><div class=\"text-indent\">9.《楞严经·卷四》：胜净明心，本周法界，不从人得，何藉劬劳，肯綮修证？譬如有人于自衣中，系如意珠不自觉知，穷露他方，乞食驰走，虽实贫穷，珠不曾失；忽有智者指示其珠，所愿从心，致大饶富，方悟神珠非从外得。</div><div class=\"text-indent\">10.《楞严经讲义·卷十》（圆瑛大师·著）：肯綮修证，即劳筋苦骨，勤勇修行之义。佛意但能达妄本空，妄空真显，何必求索妄因，劬劳修断，而冀证入耶？此段文乃是顿教法门，直指向上一著，无修无证，需善体会，不可错解。</div><div class=\"text-indent\">11.《楞严经·卷八》：佛告文殊师利：是经名《大佛顶悉怛多般怛啰无上宝印十方如来清净海眼》，亦名《救护亲因度脱阿难及此会中性比丘尼得菩提心入遍知海》，亦名《如来密因修证了义》，亦名《大方广妙莲华王十方佛母陀罗尼咒》，亦名《灌顶章句诸菩萨万行首楞严》，汝当奉持。</div><div class=\"text-indent\">12.《楞严经讲义·卷十九》：此第四题（亦名大方广，妙莲华王。十方佛母，陀罗尼咒），要妙为名。上七字为最妙，属显题。大方广，以次为体、相、用三大之义。大者、直目性体，横竖无际故；方者，具足德相，恒沙称性故；广者，称体妙用，出生无尽故。《华严》具此三大，斯经亦具，益见与《华严》同旨矣！妙，名不可思议，莲华，喻如来藏心，因果交彻，染净一如，略取方华即果，处常、净二义。王者，自在之意，亦见斯经与《法华》同条共贯矣！</div><div class=\"text-indent\">13.《佛说阿弥陀经要解》（藕益大师·著）：当来经法灭尽，特留此经住世百年，广度含识。阿伽陀药，万病总持，绝待圆融，不可思议。华严奥藏，法华秘髓，一切诸佛之心要，菩萨万行之司南，皆不出于此矣。欲广叹述，穷劫莫尽，智者自当知之。</div><div class=\"text-indent\">14.《楞严经·卷九》：佛告阿难，及诸大众：汝等当知，有漏世界，十二类生，本觉妙明，觉圆心体，与十方佛，无二无别。</div><div class=\"text-indent\">15.《法华经·譬喻品第三》：若有闻者，随喜顶受，当知是人，阿惟越致。若有信受，此经法者，是人已曾，见过去佛，恭敬供养，亦闻是法。若人有能，信汝所说，则为见我，亦见于汝，及比丘僧，并诸菩萨。</div><div class=\"text-indent\">16.《法华经·法师品第十》：佛告药王：又如来灭度之后，若有人闻妙法华经，乃至一偈一句一念随喜者，我亦与授阿耨多罗三藐三菩提记。</div></div></div>"
  },
  {
    "title": "总释经题",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>总释经题</strong></h2><div><div class=\"text-indent\">下面，开始讲经题。它有多种说法：一种直接说为《心经》；一种说为《般若波罗蜜多心经》；还有说为《摩诃般若波罗蜜多心经》。一般地，我们按照第三个经题来解释，更能完整、准确表达佛法真义。</div><div class=\"text-indent\"><strong>摩诃：</strong>这是一个印度的梵语，可解释为「大」。其实它根本不是「大」，但是在汉语里找不到更好的解释，勉强用「大」。大乘，实际上叫「摩诃乘」。那么一讲到「大」字呢，我们很容易按照汉语的习惯联想到——比如西瓜比葡萄大，地球比月亮大。你这样解释是诽谤佛法。真正讲「大」字，它不是大小的大，大小的大是对待之法，这里的大是绝待之法，它在讲真心本来面目。</div><div class=\"text-indent\">我们先从字形结构来看：一字加一个人字，一人之相，在茫茫宇宙中是不是微不足道啊？可是字义却是大，相小义大，大到什么程度啊？十法界没有一法不包罗其中，这本身是不是讲小大不二啊？讲到这汉字的结构啊，我们感慨万分！这是诸佛对中华民族的情有独钟！在全世界没有哪一个国家的文字能够与中国的汉字相比。许多汉字就是在揭示宇宙人生本来面目，这里呢，我们回顾一下它的缘起。</div><div class=\"text-indent\">大家知道，诸佛出世先在第四层天兜率天内宫观察四千年。兜率天一天等于人间四百年，那么四千年就将近是人间的六千亿年。观察什么17？比如佛当年住世八十年，道场设在哪里；有哪些过去世已经成就的弟子来护法；有哪些还未成就的弟子，这时来成就他们；再看佛灭度一千年的正法期间，法运如何；像法一千年期间，法运如何；末法一万年，法运如何？佛不光是观察，还通过他的神通法力、道力来定计划，来调理，明白吗？哪一朝、哪一代、哪一些人集中在一起，在哪里的道场，我们经历了才知道，而佛早就事先安排。</div><div class=\"text-indent\">既然如此，佛在娑婆世界第八千次示现成佛、示现灭度后18，佛法传到中国，那中国古汉字的创造，是不是有备而来啊？是不是都在佛六千亿年的计划和掌握之中呐？那么我们今天按照汉字的字架结构来分析佛法，应该相信吧？这不是一个字两个字啊！一定要明白，我们现在所处的这个时空点，举足轻重！法华道场的佛子，任重道远！</div><div class=\"text-indent\">下面呢，从时间、空间、万法、万相这四种不同的角度来观照这个「摩诃」，观照这个「大」。</div><div class=\"text-indent\">从时间上来讲，世人看来，是不是时间越长就越大，时间越短就越小呢？那在佛法里，无量百千万亿年，与当下这一秒有没有区别？都是当下一念而已啊。那么，这里有没有哪一位不是唐朝人啊？有没有哪一个不是秦朝人啊？有没有哪一个不是大通智胜佛时代的人啊？有没有哪一个不是威音王佛时代的人啊？我告诉你们，在这里的统统都是出土文物，老古董，我们都是无量寿。从无始劫以来，我们谁死过没有啊？古与今，时间的长与短，是不是就一个念啊？这叫大呀！好好把这个道理想明白，你会热血沸腾，感慨不已。十世古今当下一念19，那未来的无量百千万亿劫的一个人是不是我啊？时间只是人类的一种错觉。宇宙飞船进入太空以后，时间差就明显产生了。但现代科学只知其然，不知其所以然，它目前没有办法突破时间的束缚；而我们呢，通过禅定功夫可以突破。这样从时间上来观照大。至于时间是怎么产生的，空间是怎么产生的，我们留到下一步来深入开示，以及第一块泥巴怎样产生的，第一片风、第一滴雨是怎么产生的，都要弄明白。诸佛出世就是讲这个法，天地万法来龙去脉怎么回事。</div><div class=\"text-indent\">讲这样的法要有勇气，其实只有胆小鬼才敢讲，为什么？有一位比丘尼说：「哦，那个印广法师啊，我知道，那个人胆大包天呢，什么都敢讲啊！」其实我最胆小，为什么？因为我讲的法，都是佛在《法华经》《楞严经》里讲的法，我不敢不讲。《法华经》讲了，诸佛出世唯以一大事因缘，就是为了讲这个法。可是古今中外有几个人敢相信啊？所以佛讲众生是可怜悯者啊20！自古以来「成佛的法华，开悟的楞严」，你都不敢认可，还学什么佛啊？学什么法呀？还以为自己懂得什么，其实什么都不懂21。你懂得越多，离开真实智慧越远。</div><div class=\"text-indent\">第二个呢，从空间来分析「大」。在世间法里：中国到美国几万里，地球到月亮多少里，现在还有什么太空、外太空……是不是认为空间很大啊？我们在一片国土，在一个小家庭中，认为这个空间很小，错了。讲到第一义谛，一粒微尘、一草、一丝，尽足为一真法界，一粒微尘都是无量的法界；极乐世界、娑婆世界就是这一粒微尘，更何况一个人啊！究竟成佛以后，我们就能刻骨铭心地印证到无量的太虚空和无量的万法都是自己当人当下一念。整个宇宙空间之大，是其大无外，其小无内，怎么无内呀？这支铅笔，每次把它分为二分之一，你能不能分完呐？不能。整个的虚空之大之小，都是一念变现而已。从空间上来讲啊，叫做小大不二。</div><div class=\"text-indent\">以气球手套为喻（医用橡胶手套吹起至满；此段内容看视频比较容易理解）：手套的掌心空性为大虚空，大拇指为小虚空，这个小虚空跟大虚空能不能分开啊？可众生非要妄想分别啊！我这个小家庭仍然是小虚空，外面是大虚空，这个小虚空跟外面的大虚空是一还是二啊？是一，对不对？我从墙壁上凿一尺洞，就有一尺虚空出来，是不是？那在我凿墙之前，这个空在不在？如果不在的话，能不能出现？这个空与大虚空能不能分开？所以这个虚空有没有大小之别啊？跟时间一样，有没有长短之别？你这一生一百岁的寿命很短，这一百岁是不是无量寿啊？你死过没有啊？能不能分开啊？要突破我们的惯性思维。</div><div class=\"text-indent\">第三，再从数量的多少而言。按照世间法，东西越多是不是体积越大？越少是不是越小？那么想一想：我们做梦，梦到了山河大地、日月星辰，梦到了许多许多许多的人；那这个时候你的体重有没有增加了一百万亿吨？醒来以后，你有没有减少一百万亿吨呢？那无量的人、无量的山河大地，是不是你做梦的那一个小脑袋在变现啊？多与少是不是都是你？有没有哪一样不是你啊？梦中的高山是不是你自己？梦中的大海是不是你？那既然都是你，那高山是不是就是大海？那你梦中的爸爸是不是就是梦中的姥爷？是不是你梦中的小外孙女啊？有没有哪一样不是哪一样啊？佛法教育的目的就是要我们从梦中醒来。现在之所以不能感受到一切万法都是我，是我们自己的问题；因为你执着这个肉身是你，你心执着在这里，没有办法与整个山河大地感应道交。</div><div class=\"text-indent\">再看「手套大法」。大拇指是高山，食指是大海，中指是释迦牟尼，小拇指是白骨精……这里的东西是不是一个东西？有没有哪一样不是哪一样？所以阿弥陀佛往内观（看手套空性），他知道一切万法都是他，连牛屎狗粪都是他，山河大地也是他，所以有没有谁障碍他啊？他这个心量打开了，与万法融为一体。他需要变现一个肉身来教化众生，他可以随时千变万化，因为他证得了自在啊。比如变现一个丈六金身或者千丈卢舍那身，但都是用来教化众生而变现的。那猪八戒在指头往外看，他不承认这些东西（所有的指头和空性）是他，因为他只执着这个小拇指是自己，是不是？所以他自私其小，自己障碍自己。就像你非要执着这个肉团就是自己，真的是吗？</div><div class=\"text-indent\">再看气球手套。大拇指是八万，食指是零点二，食指的零点二是不是大拇指的八万呐？这个多少有没有区别？因为它是一个气球啊。你梦到八万头牛，九千只羊，一个苹果，那八万头牛九千只羊是不是就一个苹果啊？这个多少有没有区别啊？轻与重，也是没有区别啊！用世间法来讲，越重是不是越大啊？越轻是不是越小啊？连轻与重都是我们的妄想分别。</div><div class=\"text-indent\">鸠摩罗什法师还是七岁小孩的时候，就把千斤宝鼎拿到手里玩，其他人惊叹万分：「哎呀，这个千斤宝鼎我们十个人都抬不起来。」当他听到这句话，头脑里有了重量的概念以后，宝鼎「唰」地一下掉下来了，再怎么推，纹丝不动。一刹那间，天地之别。所以重量的概念是不是我们的妄想心呢？所以「如来藏」中没有哪几个法不是哪几个法，这叫「大」。千万不能理解为世间法的那种对待之大。</div><div class=\"text-indent\">第四，涉及到万相来讲「大」：万相就是生、住、异、灭。那灭了，都没有了，不要说大，连小都谈不上，是不是？看我这个拳头，拳头变现了手掌，拳头灭了没有啊？（没有）。如果拳头灭了，手掌还有没有了？那手掌生了没有啊？这生灭之法都是虚妄。那白天黑夜是不是妄想啊？</div><div class=\"text-indent\">那么还涉及到无形无相，按照世间法来讲，有形有相讲大讲小说得过去，无形无相连小都说不上，孙悟空摇身一变，成为一个茶杯，你还能不能看到孙悟空？但茶杯是不是孙悟空啊？虽然无形无相，那他是不是真正的孙悟空啊？所以在佛法里把无形无相方便说为自性。注意啊，你懂得了方便说为自性以后，有形有相是不是自性啊？都是，这才圆融。我们是证「一心三藏」，在《楞严经》叫「真真如性」——我们不是证真性；也不是证如性；也不是证真如性；也不是证空性，我们是证真真如性。</div><div class=\"text-indent\">以上就是从时间、空间、万法、万相四个角度来理解这个「大」。由此看来，这个「大」字是不是包罗万象啊？这就是「心外无法，法外无心」。所以这个「大」当下就是「阿弥陀佛」，当下是不是「如是我闻」呐？假传万卷书，真传一句话。把「摩诃」解释为「大」字，你这么听了，心大了没有啊？这叫自性流露；而不是背诵名相概念、打官腔，念讲稿。</div><div class=\"text-indent\">有人认为我很有智慧，你错了。我出家之前，家里的师兄（爱人）经常讲：「哼，你这个人啊，只有七岁儿童的智力。」我女儿更厉害：「七岁？我看只有三岁。」我就是这么个愚痴的人，不知道上当多少次，哪个讲话我都相信，从小就是这样。在佛法里讲，聪明反被聪明误，愚蠢人得大利益。这我能做到，你们能不能做到啊？能不能？（能）。即使没有文化，一字不识的老爹爹、老太太，照样能够像我一样讲经。只要明心见性了，怎么样讲都行，拖泥带水、结结巴巴都没有关系，「依义不依语」。我曾经讲过，只有把「如来藏」的道理搞明白，你才可以参考祖师大德的注解，借用他们的语言来圆满自己；否则你有可能被转了境界。</div><div class=\"text-indent\">这是对你们的慈悲和关心。你学得太杂，就会产生障碍，继而怀疑师父说法。你如果只是瞪着眼睛，拉长耳朵，盯住师父不放，看他讲的法与《法华经》《楞严经》《心经》有没有违背的地方，按照这个次第来，你得大成就。你讲到哪里通到哪里，连泥巴瓦块都可以讲出「如来藏」。特别是已经登台讲经说法的法师，你要参考其它资料，必须经过我的同意。这是血的经验教训，有些讲经法师已经被转了境界。</div><div class=\"text-indent\">我讲经不是对祖师大德的注解按部就班，什么五重玄义、十门开启；还有什么四悉檀、七种共解……我不是不懂，而是需要按照现在的时代风格，单刀直入，立竿见影。这个问题很尖锐，因为我要重点培养一些讲经的人才；要想成就你们的话，用不着这么啰嗦，这可是真的；到将来人均寿命十岁的时候，可能十分钟就能讲完一部《法华经》，那时候人命短暂啊！</div><div class=\"text-indent\">下面，继续讲经题。</div><div class=\"text-indent\"><strong>般若：</strong>由梵语音译而来，可勉强解释为「智慧」，因为没有比智慧更好的名相来代替。在佛法里，世间的智慧掌握得越多，离开真实智慧越远。因为迷失了真性，他只知道在外尘境界中执着、分别、妄想，这种智慧不过是世智辩聪。所谓世智辩聪：我会带兵打仗、我会安邦立国、我会写诗、我会作词、我会绘画，等等那些所谓的名人，这都是世智辩聪，在三途八难里排为第七难。所以越是在世间法里显得高贵显赫，我执越重，很难悟道。那为什么用智慧来解释「般若」呢？它有那么一点味道而已。解释「般若」，往往从三种角度来分析：</div><div class=\"text-indent\">一者，实相般若。按照分别法而言，把它说为无形无相、本来存在的真实智慧。这种智慧无形无相，但是一切有形有相的智慧都从它起用。比如，我通过语言文字来讲经，是不是智慧啊？这叫「权智」，是方便智慧。那么在没有讲「一心三藏」道理的时候，这个智慧在不在呀？在，你们能不能看到啊？我能不能看到？我也看不到，是不是？虽然看不到，它在不在啊？一定在。它不在的话，我想不出来，这叫「实相般若」，它是本来存在的；再比如，我们能够走路、吃饭、穿衣，这是不是一种智慧？都叫「权智」。那么在吃饭之前，走路之前，能吃能动的这种智慧在不在啊？在。如果不在的话你没有办法用起来，贵在体会。那种无形无相而真实存在的东西是我们的根本智慧，这叫「实相般若」。</div><div class=\"text-indent\">二者，文字般若。我把这个「如来藏」的道理，是不是通过语言文字表达出来了？如果没有语言文字的话，怎么开示呀？这叫「文字般若」。想一想，「文字般若」当下是不是「实相般若」？孙悟空变成了茶杯，茶杯当下是不是孙悟空？</div><div class=\"text-indent\">那我们通过「文字般若」再回光返照到「实相般若」，这叫「观照般若」，也就是第三种般若。有了「观照般若」，你的许多烦恼轻松化解。「哎呀，原来所有的人都是我啊！」你会不会再去害他呀？你会不会再去跟他斤斤计较啊？</div><div class=\"text-indent\">注意，这三种般若，当下是不是一个般若？是不是每一种般若同时就是三种般若？「实相般若」，它离开语言文字相，离开意识、思维相，如如不动，法尔如是。虽然如如不动，那个「观照般若」、「文字般若」，它当下具足不具足？所以「实相般若」当下就是「文字般若」，就是「观照般若」。那么在显现为「文字般若」以后，「文字般若」当下是不是「实相般若」？是不是「观照般若」啊？那么我们在进行观照的时候，能不能抛开「实相般若」？能不能抛开「文字般若」啊？不能。</div><div class=\"text-indent\">所以这三种般若当下次第圆融。再以茶杯为例，比如这是孙悟空，为「实相般若」。孙悟空摇身一变为茶杯，茶杯是不是「文字般若」？那么这个茶杯「文字般若」当下是不是孙悟空？那么孙悟空在没有变现茶杯的时候，当下是不是茶杯？那么能变来变去的那个变，是不是「观照般若」？孙悟空当下有没有变的能力啊？这个茶杯当下是不是就有变的能力？</div><div class=\"text-indent\">注意听啊，这三种般若是不是讲「阿弥陀佛」？是不是讲「如是我闻」啊？记好，「百界千如」，没有哪一法不是「如是」。《法华经》讲了「十如是」——如是相、如是性、如是体、如是力、如是作、如是因、如是缘、如是果、如是报、如是本末究竟。你把这个问题通达了，宇宙万法都能通达。</div><div class=\"text-indent\">讲「般若」，与其它名相概念对照，「实相般若」是不是「如、空」？「文字般若」和「观照般若」是不是「是、不空」？那么「观照般若」和「文字般若」当下是不是「实相般若」啊？是不是「不空空」？「不空空」是不是「空不空」？所以，没有哪一法不是「一心三藏」。</div><div class=\"text-indent\">那一个人当下是不是具足三种般若？你会吃饭、穿衣、讲话，这是你的「文字般若」和「观照般若」，是不是有形有相啊？那么在没有吃饭、穿衣、讲话之前，你这个东西存在不存在啊？那是不是「实相般若」？</div><div class=\"text-indent\">越是真理越简单，千经万论就是在讲一个「阿弥陀佛」，讲一个「如是我闻」，讲一个「般若」，讲一个「大」——简单到就是一句话，就是一个字，就是一个点。你明白了一点，所有的东西都明白；简单到你解脱以后，抓住当下这一念，随心所欲，千变万化。</div><div class=\"text-indent\">《法华经》《楞严经》就是来给我们解放思想，破除迷信。当年讲的三藏十二部经，是佛恒顺众生而已22。那破除了这个迷信以后，迷信当下就是真理啊！当下就是「如来藏」啊！你能不能把它扔到心外去啊？从「如来藏」而言，连垃圾、臭狗屎都是释迦牟尼23，都是「般若」，何况三藏十二部经啊？</div><div class=\"text-indent\">对于明心见性之人，哪里存在谤佛、谤法的问题啊？你把佛说成是天仙，说成是泥巴瓦块，都行，泥巴瓦块是不是我啊？没有什么赞叹、诽谤之说，这是证到无分别法。但是，如果你不明所以，信口开河，焚经毁像，必下无间地狱。同样一句话，同样一件事，在不同的时间、不同的空间，对于不同根机的人而言，所起的果报天地之别。开大智慧的人处处自在，嬉笑怒骂皆是行菩萨道。</div><div class=\"text-indent\">形成鲜明对比的是，修小法很苦很累呀！他提心吊胆，走路都生怕踩死一只蚂蚁；眼睛不敢往两面瞟，超过前面第四步，你就是破戒；男众跟女众讲到第五句话，就是破戒；男女相隔一百步才可以对话——看上去修得很认真，越修情执越重，不能成就。在《楞严经》讲，叫「想升情坠」。思想负担太重，必然往下坠，你说冤枉不冤枉啊？小乘法有其名而无其实，是佛的方便引导之法，可以作为悟后进修、增上品位的法门。</div><div class=\"text-indent\">明白「如来藏心地法门」就知道：一切法都是我一个念变现；纵讲第二义，也是我过去世的父母儿女。对这个法刻骨铭心、深信不疑的人，你叫他去破戒，他愿意不愿意啊？不愿意！而且不需要你教！这个「心戒」叫「一戒一切戒」。现在有些人懂得了一点三皈五戒、什么菩萨戒、比丘戒，就牛皮吹到天上去了；他自以为会持戒，诽谤大乘正法道场。在《楞严经》里，佛让文殊菩萨选一个最适合娑婆世界众生修行的法门，文殊菩萨最后只选了观音菩萨耳根圆通法门，是不是把包括优婆离的持戒法门在内的二十四个法门统统否定啊24？</div><div class=\"text-indent\">但是也要防止有人利用大乘心戒：既然持小乘戒不能成就，那我就不持小乘戒。这是断章取义，不可以这样逻辑推理！对初机修行人而言，不求开悟，仅仅持小乘戒为正修，不能成就的。持小乘戒，不能成佛，不能成就；如果不持小乘戒，你连人身都得不到，连畜生身都得不到。</div><div class=\"text-indent\">「如来藏心地法门」叫「慧共戒」，也叫「道共戒」。开了智慧，见道了，一切的大戒、小戒能够圆融、圆满、圆通。不开智慧，你怎么样修都不能成就25，所以这个般若智慧不可思议啊！在《法华经·分别功德品第十七》佛怎么讲？一念信解〈如来寿量品〉——也就是开了一念的智慧，明白天地万法唯一人一念之所变现——你比受持三皈五戒、布施、持戒、忍辱、精进、禅定等修无量法门无量劫的功德大无量倍。《法华经》为「诸经之王」，佛为诸法之王，法王在经王里讲的话怎么敢轻慢，怀疑？你有一点点疑惑，都要遭受果报——这是佛在《法华经?譬喻品第三》所讲，你对受持《法华经》的人皱一皱眉头，乃至敢怀疑《法华经》，敢轻慢受持《法华经》的人，你都要下无间地狱26；地狱出来以后，做人、做鬼、做畜生，浑身流脓流血、瞎眼、耳朵聋、歪鼻子、歪嘴巴。</div><div class=\"text-indent\">我们现在处于佛灭度之后的第五个五百年，是「斗诤坚固时代」。这期间就是靠斗诤，斗，则生存；不斗，正法就要灭亡。《法华经》和《楞严经》就是在斗诤中产生——不仅斗歪门邪道，还要斗佛门内部的偏见邪气，还要斗佛自己讲的三藏十二部经，一斗到底，这个问题非常严峻啊！</div><div class=\"text-indent\">诸佛出世，就是为了讲一部《法华经》，为了讲「阿弥陀佛」，就是讲一个「如是我闻」，讲一个「大」，讲一个「摩诃」，讲一个「般若」，就是为了讲一句「五蕴皆空」，讲一个「诸法空相」，看你懂不懂。</div><div class=\"text-indent\">我们继续讲经题。</div><div class=\"text-indent\"><strong>波罗蜜：</strong>可译作到「彼岸」。到哪个「彼岸」呢？极乐世界，叫「彼岸」；回归大光明藏，叫「彼岸」；成佛了生死，叫「彼岸」。所以这个「波罗蜜」呢，也可解释为运载工具。这就是「阿弥陀佛」，就是「如来藏」，就是大乘佛法，以此作为「波罗蜜」，作为工具。</div><div class=\"text-indent\">那么有些经典呢，叫「波罗蜜多」。这里有两种说法：一种认为这两个名相都是一样的——比如讲太原、太原市；也有一种认为「波罗蜜」是到彼岸，「波罗蜜多」是到彼岸之上——到彼岸呢，就是指阿罗汉、辟支佛、菩萨到了彼岸，他已经不受六道轮回之苦；到彼岸之上呢，是成究竟圆满之佛。这两种解释可以圆融，都很好。</div><div class=\"text-indent\"><strong>摩诃般若波罗蜜多心经：</strong>该讲「心」字了。</div><div class=\"text-indent\"><strong>心：</strong>有多种。有佛心、菩萨心、天心、人心、牛心、马心、狗心等无量心；还有泥巴心，瓦块心、树木华草心，没有哪一样没有心。这才是彻法源底。</div><div class=\"text-indent\">我们会种种的思维、观照、分别、执着，这都是无量的心在起作用。那么这无量的心，在我们思维的当下，是不是都有形有相啊？注意，这些通通归于「不空如来藏」，归于「弥陀」。在没有思维，没有动脑之前，我们那个能够思维、能够分别的东西在不在啊？虽然在，它有没有任何形相？这就是说，无量众生的无量心意识，都是一个心，是不是？这就是弥勒菩萨在《楞严经》讲啊：从识性流出无量如来。那个识性，识讲到性，就是我们共同的一个心、共同的一个念；流出的无量如来，包括我们的种种意识心、妄想心；包括天、人、鬼、畜、树木花草，依报、正报通通包含在内。对这个「心」呢，这是从无分别到分别，先从总体上把握一下。经题最后一个字：</div><div class=\"text-indent\"><strong>经</strong>：这个「经」字是一切经典的通题，梵语叫「修多罗」。印度有一种贝多罗树，树叶很大很结实，不容易毁坏。最初的梵文版佛经就是刻在树叶上。据说当年一部《法华经》用树叶串起来有八里路长！我们要感慨前辈菩萨的劳动成果，那么多经典变成树叶整理起来，保存几百年再翻译过来，谈何容易啊！那么这个「经」字当初翻译为「契经」，后来为了图省事只用一个单字叫「经」，但是解释的时候仍然要按「契经」来解释。所谓「契」就是上契诸佛智慧，下契众生根机。通过这个「契」，通过这个「经」，把佛法僧、万法万相连持为一个本体，即佛、即法、即僧、即经、即万法。所以「经」就好像一座桥梁，好像一根纽带，把万法连持为一个本体。</div><div class=\"text-indent\">那么历来经家往往从「贯、摄、常、法」这四个不同的角度来解释「经」字。注意，从每一个角度理解，我们都能开大智慧。</div><div class=\"text-indent\">「贯」：方便法来解，如果一个人讲话语无伦次的话，是不是闹笑话呀？本来该说：「啊，我口渴了，我要喝水。」你不能讲：「啊，我口水了，我要喝渴啊！」这个讲不通。写文章也是一样，必须要连贯，表达一个完整的意思。比如写一篇歌颂祖国的散文——啊！祖国啊，你多美啊！啊！大地啊，你多美啊！你等一等，我来买块面包吃一吃啊！——行不行啊？你这篇文章肯定被老师判为不及格。不要看着是讲笑话，从方便法来理解究竟法才能加深你的体会。所以树叶上写的字，能不能搞颠倒啊？那么作为佛经来讲，可以说三藏十二部经都是在讲行善积德，就跟我们讲话写文章一样，中间一点点不含糊的，那也叫贯；如果三藏十二部经讲我们行善能够得福报，作恶要得罪报；一会又讲了我们行善能得恶报，行恶能够成佛，这是不是颠倒了？三藏十二部经不能颠倒的，这叫「贯」。</div><div class=\"text-indent\">可是到了《法华经》《楞严经》一反常态。佛法不是善，不是恶，就是讲一个「真」。《楞严经》把「十方如来恒沙妙理」判为「戏论法」27；《法华经》把其它三藏十二部经判为「诸法戏论之粪」28，是不是不贯呐？而正法只讲真实。是非好坏善恶、佛菩萨、魔鬼妖怪、牛鬼蛇神、泥巴瓦块统统都是我，统统是一尊佛，统统是一个念。很奇妙的是，通过不贯而独尊于《法华经》《楞严经》，等我们真正明白「三藏一心」以后，反而统统贯起来了。原来判为牛屎狗粪的那些三藏十二部经是不是统统都是《妙法莲华经》呐29？妖魔鬼怪、泥巴瓦块是不是统统都是《妙法莲华经》？三藏十二部经由贯到不贯，再由不贯到一贯一切贯。所以当初讲的贯是不是方便说？再后来讲不贯，在讲不贯的同时把一切的是非好坏是不是已经统统贯起来了？有没有心外之法呀？这就是圆顿大法「全性起修，一修一切修，一证一切证」30。</div><div class=\"text-indent\">这个「贯」是不是「契」啊？注意，佛法不坏世间法。你不要说儿子没有考上大学，就跑去问老师说——印广法师讲的，错的也是对的，你怎么不让我儿子上大学？</div><div class=\"text-indent\">我们的智慧无所不含，它既能高贵也能愚痴。如果只能高贵，只能聪明，不能愚痴，它妙不妙？不妙。它可以各种各样地变现，既可以像孙悟空一样，几根毫毛一变，变来无量的孙悟空金箍棒；也可以一念变现出无量的诸佛菩萨天人鬼畜。</div><div class=\"text-indent\">以气球手套来打比喻：这就是一部「手套经」啊！佛在这里（掌心空性），天在大拇指，人在食指，喜马拉雅山在中指，黄河在无名指，泥巴在小拇指，那个猪八戒在手掌心，有没有哪一个不是哪一个啊？这叫「贯」，这叫「通」。那么明白了这个道理以后，我刚才讲的「我口水了，我要喝渴啊」，对不对啊？（对。）虽然相上是错误的，那性上是不是对的，是不是我啊？这叫「性相一如」。出世间法在某种意义上是强词夺理。真正明白了「啊，我肚子水了，我要喝渴啊」，你一通百通。1+1=8，3-3=9万，懂得这是对的，你开智慧了，但不是打口头禅。因为这个错误的东西也是我的心变现出来的，是不是？没有哪一法不是哪一法。</div><div class=\"text-indent\">明得此理，我们不在于断烦恼，而在于自在把握：要菩提我就现菩提，要烦恼我就现烦恼。如果一个人只能现智慧，不能现烦恼，他那个智慧是真的还是假的？假的。一个人又能现智慧又能现烦恼，那个烦恼就是智慧，是不是？他是示现烦恼，是表演而已。烦恼你能断吗？烦恼一断，你彻底完蛋，我们大家都跟着完蛋。是不是？这就是智慧，这就是烦恼；你把手掌断了，拳头还有没有了？它当下就是一体，这是了义大法。为什么佛把其他三藏十二部经判为戏论法？因为它不究竟。</div><div class=\"text-indent\">《楞严经》讲「一真一切真」31。你如果讲释迦牟尼是真的，那猪八戒、白骨精还有烦恼，是不是真的？都是真的。就是一个东西。这叫一贯一切贯。就跟「如来藏心戒」一样，一戒一切戒；就跟「如来藏心地法门」一样，一修一切修。只要你悟了，再怎么样修，都是全性起修；你吃一口饭都成佛。你吃饭的时候，知道饭就是我，我就是饭，这就是修心，也是修行32。我们发心长久住世，来弘扬佛法，成就一切众生——有此愿力，做什么事都是功德无量，这就是「常精进」——时时、事事、处处，念念在道。你不要在这里听了「如来藏」，然后回到家里，看那个小宝贝：「哎呀，我的心肝宝贝啊……」；你应该想：「嗯，这就是佛，这就是我！」要念念在道：吃饭、穿衣、走路，这个路就是我。真心本来面目不可思议，就是变现你我他，在玩游戏33。要懂得观照啊！这就是「观照般若」，这就是修「楞严大定」。</div><div class=\"text-indent\">「摄」：我讲话的形相、内容通过摄像机都可以保存，再向外传播。凡是佛所讲之经，一定能为众生之所摄受；凡是众生，皆能为佛所讲之法摄受。为什么？佛就是法，法就是我。过去有人说《楞严经》是天书，凡人是不可能懂的，而根据我们这几年讲《楞严经》的经验证明：它不是天书，每个人都能懂，只要你用心听。因为《楞严经》就是我，我就是《楞严经》。怎么可以不懂？当然讲天书也可以——它是天，我也是天。天人读天书，有什么不懂啊？</div><div class=\"text-indent\">不管你前世怎样，只要今生能进道场，定下心来，你就能听懂；并不是像有些人讲的，只有六祖慧能和释迦牟尼才能当下成就。按照这种说法，佛法只有死路一条，一代不如一代，这不符合历史发展的规律。佛法也是与时并进，向前发展。越往后我们的智慧越成熟，不要被某些人的鼎鼎大名所吓倒。依法不依人，这是佛的教诲。从这几年传法的经验来看，每到一处，都是百分之九十五以上，乃至百分之百当下成就。因为我们都是从大光明藏中而来，我们本来就是那个东西，法尔如是！就是一层窗户纸，把它捅破了，当下成佛。那我们明白，万法都是一个心所变现而已，所以人与人、人与物、物与物相互之间都有吸引力。这也是补充说明佛法的摄受之义。</div><div class=\"text-indent\">「常」：是时时事事处处，念念在道，依佛教诲，须臾不可以舍离。我们不忍心浪费宝贵的时间精力，不可以庸庸碌碌、无所作为，不可以三心二意。为了教化众生，你东奔西走，南征北战，功德无量；为了成就自己，你东奔西走、南征北战，越走越糊涂，你到时候哭都哭不出眼泪来。要明白，没有明心见性，不可以乱跑，这是祖师大德的教诲，包括去拜佛、看师父都不允许。在祖师大德的教法里，你去看他，「你来干什么？」弟子满面春光：「哎呀，我想师父，我来看师父嘛！」祖师眼睛一瞪：「给我滚！回去用功！」你去教化众生可以，但是必须明心见性，你在哪里都不会被境界所转。</div><div class=\"text-indent\">那么对于佛经而言，这个「常」还有特别的含义——凡是诸佛如来金口玉言，由后来的菩萨们所整理的经典，任何人不得以任何理由作任何的改变。不可以加一个字，不可以减一个字，不可以改变一个字，更不用说一段话，否则佛法经典就失去它的信用。佛经里的任何一个字都是无价之宝，无价之宝就是无价之宝。什么都不足以喻其之贵。谁胆敢改变一个字，大逆不道！即使错的，有问题的，也只有保持原貌。那么，有些经文里确实一些章句、一些段落、一些名相概念用现代的语言风格、语言规则没有办法理解，怎么办呢？佛法里有通融，讲师可以酌情作些变通解释；但原经本再刻印时，必须仍旧保持原样，叫作「存疑」。这里有两种可能性：一种是由于后人在传承的过程中，在无意中造成了些漏字、错字、改字的现象；第二种情况属于古今语言风格之差异，彼国与此国民族传统的文化之差异，造成了一些别扭。</div><div class=\"text-indent\">佛的法语，是永恒之理，即使那些无量的小法。你修小法，就只能证小果，都是永恒的。那么要解决一个当下成就、当下大成就的问题，就选择一个对应的大法。这也是「常」。包括万法的生住异灭，把它判为是无常；那当我们明白「如来藏」道理以后，无常也是「常」。比如说死是无常，也是永恒，皆是我们的心变现出来的。一切万法都是永恒，都是靠我们自在变现。之前把它说为虚妄的，是无常的，是为了逼着我们回光返照；再照到外面来，那些东西是不是还是我啊？</div><div class=\"text-indent\">在这里涉及到一个外道谤法的问题。现在都还有人讲，佛经不是佛自己的手笔啊，是后来人整理的，怎么可以相信呢？而这样的人往往最后都是耍无赖。大乘法在我们这个国土可以说从儒家开始，从汉唐以来已经形成了一种气氛。儒家的「忠君爱国、孝父孝母，善待一切人，老吾老以及人之老，幼吾幼以及之人幼」的思想，是不是大乘佛法的影子？乃至孙中山「天下为公」，更不用说毛主席「为人民服务」，都是大乘佛法的气氛。过去一些革命先烈如果不是菩萨再来，那他是谁啊？</div><div class=\"text-indent\">所以在大陆弘扬大乘法也是佛力加持，我们不能把本土的珍宝丢掉，反而去捡人家的垃圾。要当心，不要被境界所转呐！不要迷惑颠倒啊！而且我们还要向全世界把这个大法传播出去，这就要靠大家的共同努力。将来不是我们到台湾，不是我们到美国、到印度去请法，而是台湾、美国、印度都要到我们这里来求法，否则我们对不起如来家业。这个局面我相信很快就会形成，很快！这十来年以这样的速度发展，古今中外之所罕见。</div><div class=\"text-indent\">那么对于外道的这种怀疑、误解乃至诽谤，我们有必要澄清两个重要的事实。佛在世时确确实实没有留下一个字，为什么不留啊？我是最近才悟到这个道理，提出来与大家共同讨论。我大概在零七年讲《心经》，开始印光盘，有位菩萨说：「你讲的《心经》太妙了！我看了以后，五六个晚上没有睡着觉！」讲老实话，我并没有认为我讲的经怎么好，在她的提醒之下，我就来看光盘，看了以后我感慨万分！我当时就悟到，如果像别人一样打成草稿来讲经，我绝对讲不出那种境界。从登台讲经第一天开始，我从来没有打过一次草稿，我就是这么讲，这是什么道理？这样讲课的时候，我是不是往里面想？逼着我们的心回光返照往这里（气球手套的空心）看，往这里看就好了。释迦牟尼、阿弥陀佛的东西是不是全部在这里啊？叫自性流露。如果念讲稿往外看，你就被文字所执着，这是老佛爷的智慧。</div><div class=\"text-indent\">为什么有些人写的注解文字非常非常优美，朗朗上口？他是把心用在作文章，搞花架子，法讲的并没有错，你不容易领会……不可以着文字相，我想佛就是示现这个法。以佛的智慧和神通，他不需要动笔，一个念这些经卷就可以飞出来，乃至500年之前，2500年之前就可以把秦朝用布写、汉朝用纸写……把这些经本全部现出来；乃至我们现在的经书他都可以提前放在这里。既然他能现却不现，是不是懒惰呢？是不是佛吝法，怕便宜了后人呢？统统不是，这就是表法。</div><div class=\"text-indent\">像这样的讲法，每一个人都能讲。你不要以为我这个人很有智慧，其实我是最傻的。我原来还没有出家的时候，我那个师兄（爱人）经常指着我的鼻子骂：「你这个东西呀，七岁儿童的智力都没有啊！」我女儿变本加厉：「嗯？七岁？我看爸爸三岁小孩子的智力都没有！」这是真的！讲经说法与文化高低，与怎么怎么聪明没有绝对的关系。把这个道理搞明白了，变成你自己的语言，叫「依义不依语」。你把意思讲明就行了，不一定语言要多么华丽优美。弘扬大法，每一个人都能够如数家珍呐！因为我们自己就是这本经。《法华经》《楞严经》讲什么？讲人怎么来的，鬼怎么来的，泥巴瓦块怎么来的……你一听还不就懂？而不是去写诗歌、搞创作。</div><div class=\"text-indent\">把这个道理讲明白，你的功德有多大，知道吗？说了你可不要害怕！这是佛讲的——你能讲一句《法华经》，胜过太虚空级的大法师——可不是世界级，不是地球级，而是太虚空级的大法师——站在最高的一层天，对普天下无量的众生讲无量的经典，而且把这些人都成就了阿罗汉、辟支佛，他的功德没有你讲一句《法华经》的功德大！你读《法华经·见宝塔品第十一》的偈颂就知道34。有没有哪一个人不能讲一句经啊？如果有的话你现在留下来，我把你教会了再回去，就这么简单。讲一句《法华经》都这么大的功德，先把这份功德捞到手再说。每一个人都能做到，这是不是很滑稽啊？在佛法里讲啊，聪明反被聪明误，老实人得大利益。聪明人能讲三藏十二部经，但他不明白「如来藏」的道理，祖师大德讲，那无非外魔邪说35！许多人明白以后，倒吸一口凉气啊！一把鼻涕一把眼泪跪在那里哭，「过去修了几年几十年我都白修了，修了无量劫都是白修了」！这叫石破天惊。</div><div class=\"text-indent\">那么，这两个重要的事实必须要讲清楚。虽然讲经要空口白牙，自性流露，可是佛走了以后，谁能生生世世代佛传法？这是没有办法的办法，所以才把佛所讲的经典用文字记录下来，是不是？但是非常慎重，由摩诃迦叶主持，五百大阿罗汉参与，阿难尊者登台，一字一句把佛在49年所讲之法说出来，经五百人举手表决，百分之百举手方为通过。只要有一个人对一句话一个字提出不同意见，就必须修改。古今中外，有哪一个国家、哪一个经典、哪一部文献像我们佛法这样慎重其事啊？那么佛法传到中国来怎么样呢？同样如此。佛法的传承跟其它宗教不一样，它是由汉朝皇帝礼请而来。后来结集翻译经典，也是仿照当年释迦牟尼佛灭度以后印度菩萨整理经典那种方式，皇帝任命当朝宰相或者新科状元组织全国有进士学位以上的人才，包括高僧大德，组成一个几百人的译经道场，一主二副，由梵文译成汉文，三个人通过，提交大会通过，然后由皇帝批准，进入藏经阁。我们现在看到有乾隆版的大藏经，那就是乾隆皇帝亲自过问的。</div><div class=\"text-indent\">这里要点明：在乾隆皇帝之前，国家对出家人规定很严格，首先必须有进士以上的学位你才能出家（进士学位在封建社会是最高的学位，当了进士就有官做，起码是七品县官），而且不光是文采要好，品德也要好。要经过左邻右舍街坊来评议，你这个人品好不好，再经过官府审批，报到皇帝那里，皇帝再发出牒度，方可出家。所以乾隆皇帝做了一件好事，也做了一件坏事——有文化没有文化，只要谁愿意都可以出家。好处呢，使许多正直善良之人能够进入出家队伍；坏处呢，也使一些下九流混入僧团。</div><div class=\"text-indent\">凭良心讲，社会上那些人呐，他哪看得起出家人！家里好不容易有一个儿女要出家或者怎么样，他会闹死闹活。有些人跟老婆离了婚，竟然还不允许她出家。为什么？丢他的门风。有些人宁愿让儿子去当强盗土匪，也不愿他出家。这个在很大程度上是由于出家人内部确实有那么一些人莫名其妙的，他不是真修行。那作为在家人，要调整一种心态，你不要管他是真出家还是假出家，你都把他当成菩萨。他即使假出家，以此因缘，他能生生世世出家，比在家人成就快，他造业他受报。</div><div class=\"text-indent\">从这两个缘起，我们应该坚信：佛经一定是诸佛金口玉言，不要有任何怀疑，这叫「常」。至于讲经说法要离开经本自性流露，我们也不要执着。一开始学习登台讲经，你必须要备课，这要有一个过程。《过五关度六将证菩提》那个光盘，现在好多人都能讲，脱口而出，不用讲稿。你把《过五关度六将证菩提》这个光盘两个小时给人家讲完，你等于讲了一部《法华经》，等于讲了一部《楞严经》，那就是精华。你讲一句《法华经》都不得了，何况你能系统地把「如来藏」的道理讲出来！你功德无量啊！佛在《法华经》讲，你为一个人讲一句都有那么大的功德，何况你为几个人讲许多句？更何况听你讲经说法面对的还有天人鬼神大众36？</div><div class=\"text-indent\">第四个字叫「法」，带有规范之义。凡是佛讲的经论和戒律，我们都必须依教奉行，不可以违犯。没有规矩不成方圆，成佛由法化生。那么在有些小的规范处，在佛法里允许通融。比如，佛在世时规定出家人只准穿三衣，你有第四件衣服，就必须在十五天之内供养给别人，否则就是破戒；这是为了破除出家众的贪心。像这个规范，在大陆就不好施行。你现在穿了三件衣服，都冻成冰棍一样了，谁还修行啊！作为大乘菩萨修行法，不同于小乘，论心不论事，因地制宜。</div><div class=\"text-indent\">但是有两种倾向要防止：一种是用小乘心态来看待大乘修行。因为大乘人修行不像小乘人那样规规矩矩、战战兢兢，走路都不敢东张西望，不敢看到前面第四步，走路都怕把蚂蚁踩死了。这是一种情执，他不能往生极乐世界，就是《楞严经》讲的「想升情坠」。另外一种倾向呢，防止大乘人自以为明心见性，错用了心。既然我们是论心不论事，吃肉喝酒怎么样长怎么样短他无所谓。恶心持法，罪加一等！连小乘的戒律都不知道遵守，你还叫明心见性吗？「一戒一切戒」，是把这种戒律与我们的智慧圆融一起，在佛法里叫「道共戒」「慧共戒」。戒在定中，戒在慧中。那么，受持小乘法不能成佛，不能往生；如果小乘法都不能受持，连做人都没有你的份；乃至做鬼做畜生都没有你的份，你下地狱。对于佛法绝不可以断章取义。</div><div class=\"text-indent\">这里涉及到一个很敏感的关于假密宗修行人吃肉的问题。这个问题如果不讲清楚，可能会使不少同修误入歧途，乃至谤法谤僧。现在有许多人很潇洒，特别是一些所谓修密宗的人——我们照样吃肉，照样吃鱼，照样过夫妻生活，照样成佛……真可怕呀！而密宗吃肉确有其事。那是在一千多年以前，释迦牟尼佛的弟子们由于国内政局的动乱，逃亡到西藏。</div><div class=\"text-indent\">当初佛弟子与西藏各宗各派进行沟通，有一个教派基本上能够接受正法，但是吃肉不能改，所以当时佛弟子考虑到以下几个方面的因素：第一，西藏属于高寒地带，没有足够的动物脂肪，不足以抵抗寒冷；第二，西藏只长草不长五谷杂粮，长了草喂动物，人只有依靠肉食为生，在当时的西藏想到内地搞粮食谈何容易？除了少数王宫贵族，要平民百姓吃到五谷杂粮，那比登天还难；第三，西藏人死了以后用特殊的葬礼，讲了以后叫你毛骨悚然，他们实行天葬——死了以后，把人剁剁砍砍，砍碎了以后拿到荒郊野外让秃鹫或者其它鸟类、兽类吞食，也就是说，当生债当生了；第四，佛弟子考虑到佛法在印度已经遭到灭顶之灾，如果在西藏再不能传承下去，佛法不就断种了？所以为了把佛法弘扬下去，这个命还要保住。由于这四个方面原因，谈判达成共识——行，同意吃肉。但是规定到内地不可以吃肉。</div><div class=\"text-indent\">可现在内地呢，不仅发现一些所谓的密宗和尚吃肉，乃至所谓修密宗的居士们也在吃肉，还大言不惭37！这个问题要引起我们重视，这可不得了啊！这会伤害你生生世世38。今年五月份我有幸会见了龙称法王，龙称法王在没有见面之前就已经把《过五关度六将证菩提》等一些光盘研究过了。我在扬州讲《法华经》时问他：「龙称法王，我向你请法，密宗讲法王、活佛，是怎么回事啊？」龙称法王讲：「我们藏族人讲法王、活佛，就是你们汉人讲的住持方丈。第五尊法王还没有出世，是弥勒菩萨呀！我这个法王是继承我舅舅的，他原来是方丈。」</div><div class=\"text-indent\">其实，哪一个宗派团体都有出类拔萃的先进模范、正人君子，也不可避免有些落脚货、败类。真正的密宗，是最上乘的修行法门。明心见性以后，还要是八地以上的菩萨你才有资格进修，七地菩萨都只能做旁听生。对于修密宗的人，我们从来不赞叹他，也不敢诽谤他，我们不知道他是什么根机。你自己去考察你是不是这个根机。有一位密宗上师就讲我前世是修密宗的，我说我知道不是这个根机，我没有办法修，你不要恭维我。</div><div class=\"text-indent\">这是从「贯、摄、常、法」这四个字来观照这个「经」，也有的把「经」说为「门」：不读经的人是门外汉，不读懂仍然是门外汉。也有解释为「径」：是成佛之路。也有说为「涌泉」：涌泉就是泉水洞。只有把经读懂，我们才能彻法源底，开智慧。也有把经说为「华蔓、华丛」：这是表想成圆满之佛要修无量法门。我们平时讲的「当下成就」是指成分真即佛；要成圆满之佛，无量法门都要修，即使魔讲的经典我们都要修。你以此方便教化无量众生，像观世音菩萨一样现天相、人相、鬼相、畜生相、泥巴相、瓦块相，三十二应身遍入一切国土。也有把经说为「绳墨」：过去有一种墨盒，那个小木盒里面有黑绳，木匠锯木之前，先用墨盒里的黑线在切割处打一个黑色线条状印迹，然后沿着印迹的地方锯开——也就是把经典作为一种规矩，没有规矩不成方圆。要想成佛，必须以经为师，来规范身、口、意这三业。</div><div class=\"text-indent\">好，对于「摩诃般若波罗蜜多心经」这个经题呢，我们先解释到这里。</div><div class=\"text-indent\"><strong>?注</strong><strong>：</strong></div><div class=\"text-indent\">17.《过去现在因果经·卷一》：尔时善慧菩萨，功行满足，位登十地，在一生补处，近一切种智，生兜率天，名圣善白。为诸天主，说于一生补处之行，亦于十方国土，现种种身。为诸众生，随应说法。期运将至，当下作佛。即观五事：一者，观诸众生熟与未熟。二者，观时至与未至。三者，观诸国土何国处中。四者，观诸种族何族贵盛。五者，观过去因缘谁最真正应为父母。观五事已。即自思惟。今诸众生。皆是我初发心以来所成熟者，堪能受于清净妙法。</div><div class=\"text-indent\">18.《梵网经·卢舍那佛说菩萨心地戒品·第十卷·下》：吾今来此世界八千返。</div><div class=\"text-indent\">19.《法华经·化城喻品第七》：诸比丘，是人所经国土，若点不点，尽抹为尘，一尘一劫，彼佛灭度已来，复过是数无量无边百千万亿阿僧祇劫，我以如来知见力故，观彼久远，犹若今日。</div><div class=\"text-indent\">20.《法华经·安乐行品第十四》：后末世时，持此经者，于家出家，及非菩萨，应生慈悲。斯等不闻，不信是经，则为大失。</div><div class=\"text-indent\">21.《楞严经·卷四》：阿难，若于因地，以生灭心为本修因，而求佛乘不生不灭，无有是处。</div><div class=\"text-indent\">22.《法华经·方便品第二》：舍利弗，我今亦复如是，知诸众生有种种欲，深心所著，随其本性，以种种因缘、譬喻言辞、方便力，而为说法。舍利弗，如此皆为得一佛乘、一切种智故。</div><div class=\"text-indent\">23.《丁福保佛学大辞典》【云门屎橛】：僧问云门：如何是佛？门云：干屎橛。干屎橛者，拭人粪之橛之干者。取至污秽之意。见会元十五、无门关二十一则。</div><div class=\"text-indent\">24.《楞严经·卷六》：持犯但束身，非身无所束，元非遍一切，云何获圆通？</div><div class=\"text-indent\">25.《达摩大师血脉论》：问曰：若不见性，念佛、诵经、布施、持戒、精进，广兴福利，得成佛否？答曰：不得。又问：因何不得？答曰：有少法可得，是有为法，是因果，是受报，是轮回法，不免生死，何时得成佛道？成佛须是见性，若不见性，因果等语，是外道法。若是佛，不习外道法。</div><div class=\"text-indent\">26.《法华经·譬喻品第三》：若人不信，毁谤此经，则断一切，世间佛种。或复颦蹙，而怀疑惑，汝当听说，此人罪报。若佛在世，若灭度后，其有诽谤，如斯经典，见有读诵，书持经者，轻贱憎嫉，而怀结恨。此人罪报，汝今复听。其人命终，入阿鼻狱，具足一劫，劫尽更生，如是展转，至无数劫。</div><div class=\"text-indent\">27.《楞严经·卷四》：菩提涅槃，尚在遥远，非汝历劫辛勤修证，虽复忆持十方如来十二部经清净妙理如恒河沙，只益戏论。</div><div class=\"text-indent\">28.《法华经·信解品第四》》今日，世尊令我等思惟，蠲除诸法戏论之粪，我等于中，勤加精进，得至涅槃一日之价。</div><div class=\"text-indent\">29.《法华经·法师功德品第十九》：复次，常精进，若善男子善女人，如来灭后，受持是经，若读、若诵、若解说、若书写，得千二百意功德。以是清净意根，乃至闻一偈一句，通达无量无边之义。解是义已，能演说一句一偈，至于一月、四月乃至一岁，诸所说法，随其义趣，皆与实相不相违背。若说俗间经书、治世语言、资生业等，皆顺正法。</div><div class=\"text-indent\">30.《楞严经讲义·卷一》：圆人所修，一证一切证，一位即摄一切位，初心、究竟，二不别故。</div><div class=\"text-indent\">31.《楞严经讲义·卷十三》：妄净真纯，惟一绝待真心，到此则彻法底源，一真一切真，无妄可对；不真即是妄，故曰不真何待？</div><div class=\"text-indent\">32.《楞严经讲义·卷一》：既经如来开示，而众生自当依教观心，依理起行，但肯回光返照，照顾二六时中，见色、闻声，乃至知法，毕竟是谁？照到日久月深，自有豁然贯通，悟明本来是佛时节，方信圣凡不二，生佛平等。</div><div class=\"text-indent\">33.《楞严经讲义·卷十九》：古德有云：修习空华万行，宴坐水月道场，降伏镜里魔军，大作梦中佛事者此也。</div><div class=\"text-indent\">34.《法华经·见宝塔品第十一》：若立有顶，为众演说，无量余经，亦未为难。若佛灭后，于恶世中，能说此经，是则为难......</div><div class=\"text-indent\">若持八万，四千法藏，十二部经，为人演说，令诸听者，得六神通。虽能如是，亦未为难。于我灭后，听受此经。问其义趣，是则为难。</div><div class=\"text-indent\">35.《达摩大师血脉论》：若不见性，说得十二部经教，尽是魔说。魔家眷属，不是佛家弟子，既不辨皂白，凭何免生死？</div><div class=\"text-indent\">36.《法华经·法师品第十》：若是善男子善女人，我灭度后，能窃为一人说法华经，乃至一句。当知是人则如来使，如来所遣，行如来事，何况于大众中，广为人说？</div><div class=\"text-indent\">37.《楞严经·卷六》：奈何如来灭度之后，食众生肉，名为释子。汝等当知，是食肉人纵得心开似三摩地，皆大罗刹，报终必沉生死苦海，非佛弟子。如是之人相杀、相吞、相食未已，云何是人得出三界？</div><div class=\"text-indent\">38.《楞严经·卷六》：阿难，又诸世界六道众生其心不杀，则不随其生死相续。汝修三昧，本出尘劳，杀心不除，尘不可出。纵有多智，禅定现前，如不断杀，必落神道，上品之人为大力鬼，中品则为飞行夜叉、诸鬼帅等，下品当为地行罗刹。彼诸鬼神亦有徒众，各各自谓成无上道。我灭度后末法之中，多此鬼神炽盛世间，自言食肉得菩提路。</div></div></div>"
  },
  {
    "title": "如是我闻",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>如是我闻</strong></h2><div><div class=\"text-indent\">下面解释正文。</div><div class=\"text-indent\">在此之前呢，大家可能要提出一个问题：所有的经典前面第一句话都有「如是我闻」，《心经》怎么没有呢？」告诉大家，《心经》也有。《心经》的翻译有多种版本，在《薄伽梵母智慧到彼岸心经》里，就有：<strong>如是我闻，一时，薄伽梵在王舍城灵鹫山，与大比丘众及大菩萨众俱。尔时，薄伽梵入深明法门三昧……</strong>而流通最为广泛的是玄奘大师的译本。玄奘大师良苦用心，把《心经》缩减到最短篇幅，连「如是我闻」都省略，因为这篇《心经》就是在讲「如是我闻」。虽然做了省略，鉴于「如是我闻」不可思议的重要性，我在这里仍然要对「如是我闻」作一个开示。</div><div class=\"text-indent\">首先打官腔；其次对号入座，把它与以往所讲的各种名相概念来对照；再次，打比喻，当场进行心理实验；最后，直述「如是我闻」的妙用。</div><div class=\"text-indent\">怎么打官腔呢？「如是」二字，就是讲宇宙人生本来面目，就是讲「一心三藏」。那么按照「无分别不妨分别」这个原则，按照藏教、通教的次第，一般地把这个「如」说成是我们的真心本性，法尔如是。这个「如」，没有过去、现在、未来，没有东南西北上下十方；但它又是无穷无尽、无边无际，其大无外，其小无内，它没有任何的一形一相，可是它就是灵明不昧，就是真实存在。在山河大地、日月星辰、诸佛菩萨、天人鬼畜等一切的万法出现之前，它就是真实存在、无形无相；在显现出山河大地、日月星辰、诸佛菩萨、天人鬼畜以后，它仍然是个无形无相的真实存在，灵明不昧。它不现一相，不现一法，但是万法万相皆依它而有。好好观照，这个法很难讲。它不现一相，但万法是不是都它现的？这叫什么？现而不现，不现而现。过去、现在、未来，它始终保持这种如如不动之心。</div><div class=\"text-indent\">「是」：表十法界一切的万法——从日月星辰、山河大地、树木花草、风云雨雾，到诸佛菩萨、天人鬼畜，一切的有情，种种的妄想、分别、执着、造作，一切的生、住、异、灭，万法、万相，都叫「是」。那么这十法界万法怎么来的呢？就是由这个「如」变现而有。在《楞严经》讲，我们的真心本来面目「离一切相」，这就叫「如」；「即一切法」，这就是「是」。「如是如是」，这就是我们的真心本来面目。那么「如」怎么样变现出「是」来？它既可以巨变、突变，又可以渐变、缓变。这个「如」，可以一念之间现出十法界万法，也可以慢慢地现。好像二十年前就有了克隆羊、克隆猴，是不是？这是电视上公布的。所以使得一些政府首脑、一些大的科学家对我们佛法已经另眼相待，克隆就是心能变现万法的道理。</div><div class=\"text-indent\">《楞严经》呢，在第四卷168个字（有《一六八字讲记》）大概地勾画出这个「如」怎样渐变出「是」，变现出十法界。「如」在没有变现出「是」之前，那个「是」在不在啊？那个「如」当下是不是「是」啊？如果它不是「是」的话，它变不出来。那变现出「是」以后，这个「是」当下是不是「如」啊？</div><div class=\"text-indent\">比如：孙悟空变现为茶杯以后，茶杯当下是不是孙悟空啊？那茶杯再变现为孙悟空，孙悟空当下是不是茶杯？要明白，一切的万法都是一个「如」变现出来的。孙悟空既然能变茶杯，那能不能变话筒啊？能不能变这个灯？那变无量的东西，是不是还是一个孙悟空啊？是不是都是一个「如」变出来的？好，明白「如是」这两个字的同修叫「如是我闻」，还有迷惑的暂时叫「如是我不闻」。</div><div class=\"text-indent\">「如是」，是不是一个「我」啊？「我」就是「如是」；「如是我」就是「阿弥陀佛」；「佛」既是「阿」，又是「弥陀」。「弥陀」是无量的，「阿」是「一」；「是」是无量的，「如」是「一」。无量的「弥陀」是一个「阿」，无量的「是」就是一个「如」。「弥陀、阿、如是」就是一个「我」。把这个道理搞明白了，叫「如是我闻」。「如是我闻，万法皆成」，你悟后进修怎么修都成，包括不修，不修也是一种法；「如是我不闻，万法皆不成」，不开悟，你怎么修都不成。</div><div class=\"text-indent\">下面把「如是我闻」与一些名相概念来对应观照。</div><div class=\"text-indent\">首先与「阿弥陀佛」来对应：「如」就是「阿」；「是」就是「弥陀」；「我」就是「佛」；「如是我」就是「阿弥陀佛」。</div><div class=\"text-indent\">与理事相对应：「如」就是「理」；「是」就是「事」；「我」就是「不二」，理事不二。</div><div class=\"text-indent\">与性相来对应：「如」就是「性」；「是」就是「相」；「如是我」，就是「性相一如，性相不二」。</div><div class=\"text-indent\">还有三个如来藏：「如」就是「空如来藏」；「是」就是「不空如来藏」；「我」就是「空不空如来藏」。「空不空如来藏」本身就是「一心三藏」。</div><div class=\"text-indent\">再与权实来对照：「如」就是「实」；「是」就是「权」；「如是我」，「权实不二」。</div><div class=\"text-indent\">再与「本迹」来对照：「如」就是「本」，「是」就是「迹」，本迹不二。</div><div class=\"text-indent\">再与三个实相来对照：「如」就是「无相之实相」，「是」就是「无不相之实相」，「如是」呢，就是「无相无不相之实相」。</div><div class=\"text-indent\">再来打比方。无量法界都是一个「如是」。无量万法都是一个「如是」。比如，一个人能跳两米高，那个弹跳力，是不是「如是」啊？他在跳之前，那个力在不在？那就是「如」，跳了那么高就是「是」。那么跳到两米高的「是」，当下是不是「如」？他在跳之前，能跳两米高的那个东西在不在啊？是不是「如是」？</div><div class=\"text-indent\">再比如：猪会啃苹果，啃的力量在猪开口之前在不在啊？所啃的苹果出现之前，它在不在我们心里？一定在。一切有形有相的万法就是四大假合，地水火风是不是我们心里变出来的？或者，苹果是不是由树上长出来的？树是不是由泥巴里长出来的？泥巴是不是由我们心变出来的？它是不是「如」变出来的？要会观照啊！没有哪一法不是「如是」，没有哪一法不是我，把这个道理搞明白了，你叫「闻」，一闻就是「如来」。</div><div class=\"text-indent\">我往往用一只手套来说明此理（吹满气的医用橡胶手套）。注意，打比方是佛法教人最有利的方便之法。《法华经》讲啊，有智慧者要善于通过打比方来开启众生智慧。你看《法华经》里打了多少比喻啊39？</div><div class=\"text-indent\">这只气球大手套就是我们的本来面目，它就是一真法界，它就是阿弥陀佛，它就是观世音、地藏王，它就是天、人、鬼、畜，有相、无相，包含无遗。这就是圆顿大法，这是无分别法呀；但是仅仅这样讲法，很多众生听不明白。按照分别法讲呀：「如」就是「空如来藏」，就是阿弥陀佛的「阿」，就是理事不二的「理」，就是性相一如的「性」。讲到性，讲到理，讲到如，讲到阿，它这里面没有任何形相，就是一个空。</div><div class=\"text-indent\">注意啊，这是个气球手套；如果是木头手套、铜手套、铁手套，不足以打这个比喻，非气球手套而不可。再看这五个指头，是表无量的指头。比如说，天、人、鬼、畜、释迦牟尼、观世音、地藏王、猪八戒、牛魔王、白骨精，还有牛啊、马呀、猪呀、羊呀、苍蝇、蚊子、小老鼠，是不是这些都有啊（在各个指头的位置）？每一个法尽足为一个本体。再看无情物，山河大地、日月星辰、刮风、下雨、起大雾、泥巴、瓦块、香甜苦辣，以及我们能够分别的长短、多少、是非好坏，是不是都在这里（各个指头的位置）体现出来啊？这就是「是」，这就是如来的「来」，这就是阿弥陀的「弥陀」，这就是理事不二的「事」，就是性相一如的「相」，也就是「不空如来藏」。</div><div class=\"text-indent\">再看第三个如来藏——「空不空如来藏」。在这里（大拇指）的释迦牟尼是不是「不空如来藏」啊？那用智慧来往里观照，虽然这是释迦牟尼，但手套中心的虚空是不是他啊？那这个不空当下是不是空啊？是不是叫不空空？不空空是不是空不空？好，这就是第三个如来藏。那么气球手套中心是真空（用虚空比喻真空），那往外看，这个释迦牟尼佛当下是不是真空显现呐？这个真空当下就是不空，是不是空不空啊？三个如来藏明白了吗？</div><div class=\"text-indent\">那么这三个如来藏当下是不是一个东西？当下是不是一个念呐？有没有哪一法不是一个法呐？所以无量的万法就是一个念，无量的万法是不是无量的半个万法？这里（大拇指）的释迦牟尼是不是这里（食指）的白骨精和猪八戒？这里（中指）的地藏王是不是这里（无名指）的乌龟、王八、苍蝇、蚊子、小老鼠啊？这里（大拇指）的二是不是这里（食指）的九万八千啊？这里（中指）的八千是不是这里（无名指）的八十万亿恒河沙呀？有没有哪一个不是哪一个啊？所以这个手套大法啊，要好好观照，你就开智慧了。</div><div class=\"text-indent\">还可以从三身功德的角度来观照这个「如是我闻」：「如」就是「法身功德」，「是」就是「报身功德」，「我」就是「化身功德」，「闻」了就是佛。佛具三德。</div><div class=\"text-indent\">对照「阿弥陀佛」：「如」就是「阿」，「是」就是「弥」，「我」就是「陀」，「闻」就是智慧，就是「佛」。「如是我闻」就是「阿弥陀佛」。</div><div class=\"text-indent\">「如」者「阿」者，法身功德，真心义。</div><div class=\"text-indent\">「是」者「弥」者，报身功德，识心义。</div><div class=\"text-indent\">「我」者「陀」者，化身功德，色相义。</div><div class=\"text-indent\">「如是我」「阿弥陀」，三身功德，真真如义。亦名如来全身。</div><div class=\"text-indent\">「闻」者「佛」者，觉悟义、解脱义。觉「如是我」真实，成「阿弥陀」解脱。</div><div class=\"text-indent\">越是真理越简单！你把「阿弥陀」「如来藏」「如是我闻」搞明白了，就通晓了一切万法的来龙去脉，叫「踏破铁鞋无觅处，得来全不费功夫」。令你一念成佛，这就是「如来藏」心地法门。佛在《法华经》《楞严经》里苦口婆心就是讲这个法。佛恨不得拽着我们：「你好好给我往里面看，好好给我听！」是不是？</div><div class=\"text-indent\">务必要珍惜这个大法呀！有些人过去还讲这个「手套大法」，到现在却被境界转过去了。这说明他没有真正见道。有些人甚至还带着一帮人在讽刺、挖苦我们这个道场：「师父又在讲，听经闻法当下成佛了吧？嘿嘿嘿嘿嘿……」，笑得很带劲，是不是啊？</div><div class=\"text-indent\">什么叫「明心见性」呐？有些人讲看到虚空爆炸叫明心见性，有些人讲看到天上的佛飘来飘去叫明心见性。我告诉你，你那是见鬼。除非见到一草一木皆为一真法界，你是圆教的明心见性。当然你真能见到禅宗的那种虚空爆炸，也不简单，你也是明心见性的大菩萨；但是你只见到一分法身，还差四十一分不能圆满。《心经》讲：<strong>色不异空，空不异色</strong>。任何一法，一堆牛屎、一堆狗粪、一根草叶、一粒微尘都是一真法界40，都是释迦牟尼、阿弥陀、我们这个大本体，好好悟这个道理。</div><div class=\"text-indent\">那什么叫走火入魔啊？那些修外道的只知道看殊胜的境界，红红绿绿、花花世界、飘飘荡荡：「啊！我明心见性了」；看到那个狗屎、垃圾堆就捂鼻子，这就叫走火入魔。这是一杯水吗？人喝是甘露；鬼看到是火；天人看是石头。这都是分别心，全是我们的同分妄见。这个法石破天惊。佛在《妙法莲华经·分别功德品第十七》讲：你对「如来藏」一念信解，胜过你修八十万亿劫的无量法门的功德的无量倍。</div><div class=\"text-indent\">再以做梦为例。你在梦中会梦到夫妻儿女、亲朋好友，也梦到一些冤亲债主，牛鬼蛇神；还梦到桌椅板凳、山河大地、刮风下雨、香蕉苹果……是不是应有尽有啊？那么，梦境与别人有没有关系啊？没有。是不是做梦的那个人一个念变现出来的？有些人讲：「怎么没有关系啊？我没有老爸的话，怎么梦到老爸啊？」那我问，你有没有梦到过从来没有见到的人？从来没有见到的事啊？就有啊。那些东西是不是你变现出来的？</div><div class=\"text-indent\">要注意，梦中的情况比较复杂：有些属于日有所思，夜有所梦；有一些梦呢，是在天道、鬼道与他有善缘的众生进入梦境跟他攀缘求道等；也有一些呢，是他的冤亲债主进入他的梦境或求解脱，或报仇、报怨等；也有些呢，是属于佛菩萨在梦境中点化他；也有些呢，是属于在未来几天、几个月、几年或者未来世可能要发生的事，因为他自己的功德在梦中提醒他。</div><div class=\"text-indent\">梦的情况很复杂，虽然是这样，但那种种梦境是不是由自己的一念变出来的？那梦中一切的境界是不是「不空如来藏」，是不是「如是」的「是」？（是的）。正在梦中，你能不能看到、听到、想到、知道那个人在做梦啊？不知道，如果知道的话，你已经醒了，那就不叫梦了，是不是？虽然不知道，它在不在啊？那就是「如」，你在梦中能不能看到那个「如」啊？那虽然你不知道，你在梦中的时候，当下是不是做梦的那个人呐？那叫「不空空」。那正在做梦的人当下是不是梦中那么多的境界啊？那就是「空不空」，就是「如是」。佛法教育的目的就是要我们赶快从梦中醒来。醒来以后，你就是「如是我闻」。</div><div class=\"text-indent\">可是在梦中，比如说你被狗咬了一口，那个脚后跟痛不痛啊？肯定是痛。在梦中也痛，醒来以后还感觉到痛。那其实梦中狗咬了你没有啊？没有。平时你的手被针刺一下，哎呦一声，是皮肉痛还是心里痛啊？我们都被自己糊弄了。其实你放下我执，放下烦恼习气，证到这种境界的时候，把皮肉割下来，你一点都不痛，他马上就会长出来。</div><div class=\"text-indent\">曾有外国人做心理实验：两个罪犯张三、李四对面坐，当着李四的面，捡这么大一块火炭往张三手上一放，张三哇地一下子手被烫烂了，出了一个大血泡；然后把李四的眼睛蒙起来，搞了这么大的一个冰块往李四手上一放，李四哇地一下手上也烫了个大血泡。我问大家：如果李四睁着眼睛，放一冰块在他手上，会不会烫一个大血泡啊？不会的。所以皮肤上的大血泡是被烫出来的，还是心里变出一个大血泡啊？都是心变出来的，明白吗？</div><div class=\"text-indent\">还有一个心理实验：有两个死囚，当着李四的面把张三的动脉割开，好，半个小时以后张三死了；现在轮到李四了，把李四的眼睛蒙起来，然后用保险刀的刀背轻轻割一下子，没有割破；再用三十六度的热水啊，顺着他的手腕滴答滴答往下流，半个小时以后，李四也死了。李四是身死的还是自心死的？是心死的。这就是心法。</div><div class=\"text-indent\">再听一则著名的佛法公案：当年印度的佛陀耶舍尊者到中国来弘法，就是传「如是我闻」，谁也不认可；唯有净土宗的初祖慧远大师接待他。佛陀耶舍的汉语不是很流利，就一边讲汉语一边打手势：这（握拳）是佛，注意啊！众生（舒掌），佛（握拳），众生（舒掌）。所以我把这个比喻叫「拿手好戏」。慧远大师慧眼识真人，当下供养他：「哎呀，这个法太妙了！」</div><div class=\"text-indent\">怎么妙啊？拳头是不是表「如」啊？手掌是不是表「是」啊？这个「是」，这五个手指是表无量手指、无量万法。当拳头没有变手掌的时候，我们眼见拳，心见手掌。所以，「如」当下就是「是」，「空」当下就是「不空」，「阿」当下就是「弥陀」。那在变现为手掌的时候就是「弥陀」，这是不是无量万法啊？这无量万法，我们眼见掌，心见拳，那么这个掌当下是不是拳啊？「弥陀」当下就是「阿」。</div><div class=\"text-indent\">那手掌也可以变锤子，变剪子，也可以变扫把和木排，变六、九、八，可以无量，是不是？有没有哪一样不是拳头啊？锤子是不是拳头？剪子是不是拳头？扫把是不是拳头？木排是不是拳头？六是不是拳头？八是不是拳头？有没有哪一个「弥陀」不是「阿」？那么这里的锤子是不是剪子啊？剪子是不是扫把？有没有哪一个弥陀不是哪一个弥陀？这个拿手好戏当下是不是「一心三藏」啊？所以当年庐山结庐，123位菩萨就是在佛陀耶舍菩萨的「一心三藏」指导之下念佛，百分之百往生。现在庐山还有佛陀耶舍的碑铭啊。</div><div class=\"text-indent\">慧远大师是真正的净土宗祖师，修学的是真正的净土法门，当然可以念佛百分之百走，千修千人成，万修万人去。离开「一心三藏」的道理，你怎么能去？正法现在被偷梁换柱，好不容易有人拨乱反正，某些人却反目相待。《佛藏经》讲，魔王带着他的魔子魔孙嚎啕大哭，向佛发恶誓：我要叫我的徒子徒孙在末法时代，穿着出家人的外衣，来混入你的正法道场，要叫末法时代的人，只知道读，只知道诵，而不懂41……</div><div class=\"text-indent\">在跟你们吵嘴了，是吧？因为我要稳定大家，必须跟你们讲真理。不了解的人，吓也要吓个半死。我的样子也很凶，跟阿修罗差不了多少。但是你不狂呼乱叫，不能拨乱反正。但你们以后传法没有必要像我一样狂呼乱叫了，到时我们力量已经大了，心平气和足以形成气氛。现在我是没有办法，佛当年也是这样啊。你看看《法华经?譬喻品第三》怎么讲的？听了真叫人伤心啊！听了叫你毛骨悚然，毛骨悚然呐！这是真的，佛就是这么讲的。何况现在处于后五百岁，是佛讲的斗诤坚固时代，明白吗？一团和气不能开智慧；讲法讲得听众无动于衷没有用。这第三个角度是通过几个比喻来讲「如是我闻」的法理法义。</div><div class=\"text-indent\">第四个角度就是讲它的妙用。一句「如是我闻」把一切的万法贯通为一体，摄受为一个本体，时时、事事、处处都离不开「如是我闻」。这几句话是不是把「经」的「贯摄常法」概括起来了？妙不妙啊？也把万法贯通为一个念，这是妙用之一。</div><div class=\"text-indent\">首先，「如是我闻」的最初出现，起到了四个作用：</div><div class=\"text-indent\">第一，断除众疑。阿难尊者无量劫以来为佛侍者，法相庄严，心地慈悲善良。佛有三十二大人相，而阿难就有三十大人相。所以当结集经典时，阿难当众复述佛陀四十九年所讲之法，大家会以为，佛不是灭度了吗？怎么又出世了？或者认为现在阿难成佛了吗？是不是又有他方佛到我们这里来示现？所以阿难把「如是我闻」一讲出来，大家都知道，这是佛的「临终遗嘱」。</div><div class=\"text-indent\">第二，秉佛遗嘱。当年佛在世讲经49年，任何一场法会，任何一部经典，从未提到「如是我闻」，包括《法华经》《楞严经》。在佛即将入灭之前，阿难还有情执，悲痛欲绝。由阿那律陀尊者（佛的堂弟，四王八子之一）提醒，阿难最后向佛请法：一、佛在世我等依佛而住，佛灭后我等依谁而住？二、佛在世我等依佛为师，佛灭后我等依谁为师？三、佛灭后结集经时一切经首，当安何语？四、恶性比丘，佛灭后如何处之？佛答：一、依四念处住。二、以戒为师。三、当来结集经时，一切经首当安如是我闻，一时，佛在某处，与某某大众俱。四、恶性比丘，默而摈之。</div><div class=\"text-indent\">第三，息除诤论。参加收集整理经典的都是证四果的大阿罗汉，乃至很多法身大士。若论资排辈，有很多人的道业都远在阿难之上。因为阿难是过目不忘，入耳成诵，同时阿难身为佛的侍者、佛的法藏，依佛的教诲讲「如是我闻」，然后再把佛在各个时空点所讲之法复述出来，这是理所当然。</div><div class=\"text-indent\">第四，区别外道。有些人读经时，他首先要看这是哪一派的经典。所以这个「如是我闻」让大家一目了然，知道这是佛法经典。那些自然外道，以「有」为宗的，每一部经开头必然用「忧」；以「空」为宗的，它一定是用「阿」。而佛法是诠释宇宙人生的真理，当然不可以混同于外道。所以佛恒顺世间法，用「如是我闻」作为佛经的开头语。</div><div class=\"text-indent\">注意，当每一部经之前加了「如是我闻」，这部经就是《法华经》《楞严经》，都能成就。可是你如果曲解：如是我闻，这是我亲耳听佛所讲——那这个「如是我闻」就是聋子的耳朵——摆设。如果这样讲，万法都不能成就，他跟不讲「如是我闻」没有区别。只要明白了「如是我闻」，包括一切佛经，包括天文地理、语文数学、泥巴瓦块，统统都是《法华经》。</div><div class=\"text-indent\">比如：「如是我闻。一时，印广和尚在杨家堡慈航净苑讲经堂，与四众弟子聚。尔时印广和尚拿起一只茶杯，汝等当知，此茶杯者，即是阿弥陀佛也。法会圆满，各位吉祥如意自在！」这是不是《妙法莲华经》啊？就这么简单！你明白了「如是我闻」，开口讲话、抬腿走路都是《妙法莲华经》。你闻了，讲什么法都是《法华经》；如果不闻，即使讲《法华经》《楞严经》，你都是讲邪法——不在于表面文章，而在于你有没有讲出境界。</div><div class=\"text-indent\">不要以为我在这里讲得杀气腾腾的，其实，我这么大年纪了回到家乡去，看到左邻右舍的老人，我还脸红。人家讲：「你怎么现在还是个大姑娘啊！」我从小就很腼腆，不敢讲话，就是现在有人来访，茶杯一放，我都不知道该讲什么话。真是这样的，这里不少同修就能感受出来。这就是讲我们的思想要单纯，要清净，才能入道。</div><div class=\"text-indent\">这也就是佛讲的，越是真理越简单；是那些聪明人把最简单的道理讲得很复杂。为什么？他可以卖钱呐。我越讲得玄乎，你们越不懂，越证明我高明，证明越有智慧。是不是这样的情况？把唐诗宋词和祖师大德们那些闪闪发光的语言「哇哇哇哇哇……」，哎呀，这个人博学多才。依文解字，三世诸佛大叫冤枉。所以我们现在是替三世诸佛来申冤，明白吗？不把那个冤申清楚，这些佛法等于是废话。我从到慈航净苑的第一天，我就宣布：我讲错了法，谁能给我指正，我给他顶礼，还有红包供养。在这里大概包了两次。</div><div class=\"text-indent\">刚才讲了「如是我闻」的妙用，是把一切万法贯通为一体；但它最大的妙用就是你明白了「如是我闻」，当下明心见性成佛道。在《法华经》讲，「一念信解，蒙佛授记」。当然这是分真即佛，可是有几个人敢相信呐？甚至以自己的下劣心来看待别人。《法华经》《楞严经》《佛说阿弥陀经》都在强调「如是我闻，当下成佛」。《楞严经》倒数第二段你看：一个十恶不赦之人，剩了一口气就要下无间地狱了，一念明白「如来藏」道理，所有的罪过一风吹平，当下变地狱为佛土；还有那个下九流摩登伽女，听佛讲了几句话就证果，而她之前连什么叫罗汉都不懂，她证三果罗汉了；再听文殊菩萨讲几句偈颂，证四果罗汉。</div><div class=\"text-indent\">小乘法尚且如此，何况大乘法。在法华会上，无量百千万亿各类众生听佛讲了一段经，当下证到罗汉、辟支佛、十地菩萨、等觉菩萨。「尔时尔时」，当下成就啊，并没有讲这些人听佛讲了这个经以后，回去念佛八年、拜忏三年，又是怎么怎么几年，证到什么什么果位。《楞严经》是讲「修心」，明白道理，单刀直入，开门见山。</div><div class=\"text-indent\">注意，《阿弥陀经》也是一样：「即以食时，还到本国」<strong>。</strong>佛以吃饭打比喻：你这个嘴巴吃了巧克力就是甜嘴巴；吃了辣椒就是辣嘴巴；吃了那咸菜豆就是咸嘴巴；吃了那个臭豆腐，是什么嘴巴啊？是臭嘴巴。以此来比喻我们这个心，你明白了天你就是天；明白了人你就是人；明白了阿弥陀，你就是阿弥陀，所以叫「还到本国」，「本国」就是你的真心本来面目，就是极乐世界。你明白了极乐世界，你就已经回到了极乐世界；你明白了猪马牛羊的世界，你就回到猪马牛羊的世界。</div><div class=\"text-indent\">《阿弥陀经》还讲「发愿往生」——已发愿已往生，今发愿今往生，当发愿当往生42。但是现在有人解成：已发愿者，经过十年念佛，二十年拜佛，三十年拜忏，今往生；今发愿者，经过三年念佛、三年拜忏、四十年行善积德，当往生；当发愿者，经过三年诵经、四年持咒，五年去放生，当当当当往生……这样修法能得人天福报，作为来世成就之因，但很难今生解脱。</div><div class=\"text-indent\">还有人咬着「临命终时」，解释为佛讲临死的时候才能往生。到底佛有没有在哪一部经讲人死了才能成佛？「临命终」：临是道交感应；「终」，表圆满。妄心见到真心，生死假命与涅槃慧命圆融为一体，叫「临命终」。《法华经》《楞严经》都是讲活生生地当下成就，没有说死了以后成佛。所以《法华经》《楞严经》《阿弥陀经》，都在讲「如是我闻，当下成就」，一脉相承；可不是印广法师借题发挥啊。因为《心经》本身就是讲「如是我闻」，在这次的讲解中，你可以体会出「如是我闻」的法味浓浓。</div><div class=\"text-indent\">?<strong>注</strong>：</div><div class=\"text-indent\">39.比较著名的有“法华七喻”。即：1.火宅喻：出自譬喻品。2.穷子喻：出自信解品。3.药草喻：出自药草喻品。4.化城喻：出自化城喻品。5.衣珠喻：又云系珠喻。出自五百弟子受记品。6.髻珠喻：又云顶珠喻。出自安乐行品。7.医子喻：又云医师喻。出自如来寿量品。</div><div class=\"text-indent\">40.《楞严经讲义·卷十》：十法界不出一真法界，十界诸法，惟依藏心之体为体。离此心，而无片事可得，是谓尘尘混入，法法圆通，一真不动，应用无限。</div><div class=\"text-indent\">41.《佛藏经·卷四·嘱累品第十》：恶魔及诸眷属皆大忧恼，如堕十六种大坑，大啼哭言：瞿昙沙门知我觉我，我常长夜。愿佛灭后，破持戒者，助破戒者，欲令诸恶比丘不知佛法，但知读诵。我欲于佛法中破安隐心，语言此非佛法，无有义趣。</div><div class=\"text-indent\">42.《佛说阿弥陀经》：舍利弗，若有人已发愿、今发愿、当发愿，欲生阿弥陀佛国者，是诸人等，皆得不退转于阿耨多罗三藐三菩提。于彼国土，若已生，若今生，若当生。是故舍利弗，诸善男子，善女人，若有信者，应当发愿，生彼国土。</div></div></div>"
  },
  {
    "title": "正解经文",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>正解经文</strong></h2><div><div class=\"text-indent\"><strong>观自在菩萨。行深般若波罗蜜多时。照见五蕴皆空。度一切苦厄。</strong></div><div class=\"text-indent\">「观自在」是谁啊43？就是观世音。那「世音」应该用耳朵听嘛，怎么叫「观」呢？妙就妙在这个「观」。如果我不讲「观世音」，叫「观世色」，行不行？我叫「观世香、观世味、观世触」，行不行？或叫「耳闻色」，「耳闻香」，行不行？这个法可妙了！所以，这个「观」是用智慧观，用心观，不是用肉眼观。这个心不是意识心，而是我们看不到的那个心，就是「如是我闻」的「如」，用「如」来观。看拿手好戏，眼见掌，心观拳。因为我们就是那个东西。这叫「观」。</div><div class=\"text-indent\">繁体字的「观」是「觀」，左边一个雚，右边一个见。我们眼睛能不能看到罐子里啊？心能不能看到？罐子里肯定是空的，是不是？启发我们要「在相见性」，叫「观」；而不是像藏教菩萨，只见罐，不见里面的空；也不是像禅宗和别教的菩萨一样，非要把罐子啪地一下打碎，才见空；那我们不需要把罐子打破了，就知道里边是空。这就是圆顿大法的「在相见性」，而不是禅宗的「破相见性」，也不是藏教的「执相昧性」。六道凡夫之所以是六道凡夫，他只见雚（罐），不知道里面是空。他只知道香啊、味啊、触啊、法啊，他不见里面的真实本性。他在六尘、六根这种色相里在妄想、分别执著，这是凡夫的悲剧。他没有见到里面那个空性、那个真心。这是以罐子里面的虚空比喻真空。你可不要把虚空就当成真空，比喻就是比喻。</div><div class=\"text-indent\">所以这个「观」是「从有见空，从事见理，在弥陀见阿」。圆顿大法，一句话，一个字，一个法，都足以叫我们开智慧。时时事事处处，无非道场，无非一真法界，就圆到这种程度。前面讲到，汉字文化是诸佛菩萨的特殊加持。它的字架结构，就是在表这个大法。</div><div class=\"text-indent\">那再看现代汉字改革，这个「观」字，变繁为简，左边一个又，右边一个见。「又见」为「观」。凡夫之见，是一见而已，他只是眼睛见到了就自以为我看到真了，就开始执着了；可圣人之见，见不见之见——我见到这只茶杯，叫「见」；然后你用智慧来观照：哦，这个茶杯是四大和合而成，四大由心显现。一念坚固妄想而有色法；那个水呢，是我们心中一念润性；火呢，是一念热性；风呢，是一念动相。茶杯当下是我的心——这叫「观」。这一个字足以叫我们开智慧啊！</div><div class=\"text-indent\">观世音的「世」有两种写法，你怎么样写，它都是三个「十」连在一起（古体字：卋）。三个「十」，每一个「十」都是一横一竖，一竖代表过去现在未来、前世今世来世、去年今年明年、昨天今天明天、早晨现在下午、刚才现在等一会。我们是不是一直在过去、现在、未来中生活？有没有哪一个能够离开过去现在未来？一横表东南西北、东南、西南、东北、西北、上下十方，我们当下是不是都在十方生活？概说是十方，其实是无量方，当下就是中心，没有哪一个不是中心，因为世界是无量无边的。那么有了时间、有了空间，是不是就有无量的众生？有时间必有空间，有时间空间必有万法。那么为什么有三个「十」呢？这是从过去现在未来三世来研究。我们今世有没有过去现在未来？前世有没有过去现在未来？来世有没有过去现在未来？我们当下有没有过去现在未来？每一世都有过去现在未来。每一世有没有东南西北上下十方？都有。那每一个方向有没有过去现在未来？都有。这个「三」，表圆融圆满圆通之义，实际上这个「三」是不是表无量啊？无量的时间、无量的空间用三个十表示起来，下面是「一」。那个「世界」的「世」是不是一个本体啊？</div><div class=\"text-indent\">今天我们坐在这里，中华民国的人来了没有啊？清朝人来了没有？哪一个不是清朝人啊？唐朝的人来了没有？（来了）。都是些老古董啊！那秦朝人来了没有啊？（来了）。这么多出土文物啊？无始以来哪个人死过的举手看看。告诉你们，没有开始，没有结束，过去现在未来都是我们。那一百万亿年以后的未来人，现在在不在？在的人举手。你们都是外星人啊？诸佛之所以是诸佛，诸佛活在当下一念。这个法妙啊！妙不可言啊！那么我再问一问，这里美国朋友来了没有？（来了）。日本菩萨来了没有？（来了）。太阳上的菩萨来了没有啊？（来了）。地藏王在不在？（在）。释迦牟尼佛在不在？（在）。那个王八蛋在不在？（在）。白骨精来了没有？（来了）。无量劫以来啊，美国人、日本人、乌龟王八、观世音、牛屎狗粪、树木花草，我们谁不是啊？谁都是啊！天地万法都是一个人一个念变现。</div><div class=\"text-indent\">简体字的「世」无非两横，是表修行的次第。你理解了小横，证到阿罗汉，大横是证到大乘菩萨。天地万法都是「我」，小横表破除了人我执，大横表既破人我执，又破法我执。真正明白，心量是不是扩大了？你会不会再为个人名闻利养去生烦恼发脾气啊？这就是掉在火中不能烧。你会不会再去贪心？好，你掉在水中淹不死。真正懂得了观世音菩萨，我们在今后的待人接物，还需要求观世音菩萨吗？你没有求的时候就已经解决了。</div><div class=\"text-indent\">这个「世」包括世间和出世间。这个「音」包括世出世间一切的万法——笼统地讲，即五蕴、六入、十二处、十八界、地水火风空见识。在《楞严经》归纳为四科七大，无非「如来藏妙真如性」。这就是「观世音」。既然四科七大皆归「如来藏妙真如性」，既然都是「妙真如性」，有没有哪一法不是哪一法啊？所以世间出世间之音是不是一切法呀？统统包含在内。这就是圆顿大法，全性起修，一修一切修。</div><div class=\"text-indent\">先来看观音怎么「观」。外道观音法门呢，比如意念放在眉心，听海潮音或者观光，他一入定以后确确实实就能听到海潮音，能看到光，他不知道这才进入观世音法门第一关。破了「动关」，再到「静关」，「动静二相，了然不生」。他通过保持心态平衡，当五欲六尘静下来之时，他与阴界的一些众生、环境就接触了。我们平时是以阳性功能与这个三维世界在接触——眼睛能看、耳朵能听，这叫阳性功能。那么静下来以后呢，以阴性功能为主。这个时候包括二十八层天、鬼道、魔道、地狱道，等等等等无量法界都可能出现。对于没有修行经验的人呢，少见多怪，他以为就成就了。这在《楞严经》里观世音菩萨介绍他修行法门的属于第一关，叫「动关」、动相。</div><div class=\"text-indent\">你要先突破动关，这个时候脑袋一片空白，什么也没有了。你又不要当真了：哎呀！这下就好了，这下见空性了。那不是空性。如果把握不好你就变成了「无想定」，但是福报也很大，到四禅天享受几万万亿亿年的寿命。这个仍然不是真的，那叫「静关」，因为你感到了那种空白，你感觉到了。打个比方：我现在讲话有声音，你们是不是听到了？那我不讲话没有声音，你们能不能听到啊？能。能听到没有声音的声音，这就是在开智慧。</div><div class=\"text-indent\">回到第二关，「静关」。动关里出现的天啊、人啊、鬼啊，到了静关，什么也没有了，那是不是相啊？（是）。因为你看到了。连看到的这个空相你都要把它破掉，而且后面还有四关要过。有些人看到有什么境界，就自以为是了，这很可怜呐！你还在鬼神道里打转。在佛法里叫「计取见」，非果谓果，未证谓证。但是对于开悟之人，有这个境界不害怕。他可以度化那些众生，那不叫走火入魔，而叫走火入佛。所以明心见性太重要了，在第一关里你就可以大作佛事！你「一证一切证」，你怎么修都行；可是你不明心见性，这六关一定要突破。那可不容易啊！无量百千万亿年，可难成就了！你明心见性了，这六关修也好，不修也好，修其中任何一关都可以，就这么妙。</div><div class=\"text-indent\">观世音菩萨修禅宗法门，他是在「闻思修」，在明心见性的前提之下来修44，所以他势如破竹。如果丢开闻思修来修六关，那有无量种阴魔境界等着去冲锋陷阵，你一关一关地冲吧。一直修到最后破除了行阴证到了阿罗汉，他还会走火入魔，虽不落三恶道，但是他不成增进，没有办法往上修。同样修这六关的人没有破除身见，即使跟阿罗汉一样都破除了行阴，功夫都是一样的，他到最后还要下无间地狱，苦不苦啊45？</div><div class=\"text-indent\">如果在闻思修见道的前提之下修六关，你一起步就是个明心见性的菩萨，再破除种种的无明微细烦恼，不断提升品位。有些人可滑稽了，说：禅宗是观世音菩萨的法门，文殊菩萨评为第一；可是他把「闻思修」丢掉了，那跟其他菩萨修的禅宗是不是一样啊？一样的要被否定掉。唯有观世音菩萨的禅宗，是悟后进修。二十五个菩萨中好几个都是修禅宗的，月光童子修水观是不是禅宗呐？火头金刚修火观是不是禅宗？都是在修禅宗啊，一一被文殊菩萨否定了46。</div><div class=\"text-indent\">无论是阿罗汉还是凡夫，修禅宗都很危险。从「闻思修入」就不存在这个问题，最多慢一点而已。怎么个闻法？「闻思修」就是观世音，看你怎么观照法。比如我现在讲「一二三四五」，这是不是音？你听了这个声音，感觉我嗓子有点沙哑，这个声音不大悦耳——这都是第六种意识心在「观」。从「闻思修」的角度来「观」就不是这样观法——我这个音从哪里来的？嘴巴怎么能讲出来的？是头脑里想出来的；那我头脑想之前，这个音在不在？虽然在，它有没有形相？这叫明心见性。</div><div class=\"text-indent\">由观声音再观颜色，比如看光。这个亮从哪里来的？是不是从太阳里来的？顺藤摸瓜啊！那么太阳从哪里来的？是不是我们心变出来的？总是追根寻源。所以太阳出现之前，在哪里啊？是不是在我们心里？太阳在我们心里，原来有没有什么形相啊？那声音有没有什么形相？都没有。那么太阳光跟这声音是不是一个东西啊？以此类推，耳闻目睹身受的一切，分析到最后，原来这一切的万法「本如来藏妙真如性」。</div><div class=\"text-indent\">再观个人也是这样。人从哪里来的？妈妈肚子里来的；妈妈肚子从哪儿来的？这样观观观……第一个人从哪里来的？一定要找到山穷水尽，就是这么观法。这种观照叫「闻」，「闻」了以后进入「思」和「修」。「思」和「修」就是观世音菩萨在《楞严经》讲的那六关。每一关怎么思，怎么修，都离不开闻。这就叫「一杆子到底」，全性起修。</div><div class=\"text-indent\">「观世音」，观到最后，这个「音」就是「不空如来藏」，就是万法。「观」是见不见之见，是「空如来藏」。「空如来藏」当下就是「不空如来藏」，就是有形有相的声音。第二见是真空不空。一切形形色色的万法，是不是「妙有不有」？也就是「空不空」。这就是「法华三昧」。这就是「开权显实」——开音、色、香、味、触、法之「权」，显我们那个本来面目之「实」。</div><div class=\"text-indent\">好，现在如果把「观世音」变通下，叫他「观世味」，行不行？「观世色」，行不行啊？「观世臭」，行不行？「观世大」，行不行啊？他这个「观」，无所不观，一观一切观。明白了「一心三藏」的道理，你讲的每句话都是「如来藏」，都是《法华经》，都是《楞严经》。</div><div class=\"text-indent\">在八十、九十年代，气功大师像雨后春笋，怎么回事啊？有一位大师讲老实话，气功的基本原理就四个字，叫升、降、开、合，你把这四个字把握住了，每个人都是气功大师，你随便胡编乱造一个功，这是野马分鬃，那是白鹤亮翅，都可以。他是一语道破天机。每个人都是佛，明白这个道理，你讲的一切话都是经典。明白了「如来藏」的道理，每个人都当大法师。大到什么程度啊？佛在《法华经?见宝塔品第十一》讲啊：你能讲一句《法华经》，问一句《法华经》，你比那个能够讲三藏十二部经的人，能够站在最高的天上对无量众生讲经的人，能够把无量的众生都培养成阿罗汉的人，你的功德比他还要大。所以无论在家出家，你能讲一句《法华经》都是大法师。</div><div class=\"text-indent\">要把自己的劲鼓起来，我们就是佛啊！要明确肩上的担子，你是为了教化众生，连我们的生命都可以供养众生。你有这样的心态，佛讲，「我独无所畏」，你不用害怕。佛在《楞严经》讲：凡夫不可以自称是什么菩萨，是什么罗汉47，那是为了破我执；佛在《法华经》讲：我们就是大佛，就是菩萨48，这也是为了破我执，大家明白吗？破这个我执要把大心发起来，要教化众生。所以我提出：佛慢不可无，我慢不可有——就是把二者圆融起来。</div><div class=\"text-indent\">我们从「观世音」这个名字，就可以把它千变万化，是不是？叫观世风、观世雨，行不行啊？一法就是无量法，一观一切观。如果有人用禅宗请法的方式，问：「师父啊，请你给我印证一下我证果了没有？」我说：「你证什么果啊？」「我发觉观世音就是观世风。」好，我告诉你，「你解脱了」，是不是啊？但你必须是自性流露，你不能依样画葫芦——他叫观世风，你也来找师父：「师父啊，我叫观世雨。」你给我靠边站。同样一个人回话，师父给他印证不一样，你必须是自性流露，你不能跟着人家后面依样画葫芦。大家明白了吗？有道无道，自己知道。当然有那些不懂大法的还要挖苦讽刺——你们「观世风」来了没有啊？我们不要害怕，明白吗？</div><div class=\"text-indent\">现在回到这个「观自在」。明白了「观」，明白了「观世音」，你当下得自在，「自在」是谁啊？是你自己！没有哪一法不是你，你自在不自在啊？没有生也没有死，我们可以随缘示现生和死。「自在」既是我们的本体，又是我们的妙用，做牛做马是不是自在啊？他造牛业就做牛，造马业就做马，圆顿大法看来，没有一法不自在。如果他造了牛业却要去做鸡，自在不自在啊？那就不自在了。他一定顺着自己的习气来。如果造牛业的人不能做牛，造马业的人不能做马，那你修佛能不能成佛啊？也不能那！这就是妙法。所以圆顿大法之妙啊，与分别法之妙天地之别，但是通过分别法这个妙啊，可以把我们引导到圆顿大法之妙，是不是？我们可以自在地把握自己。如果成佛了以后还不能现牛相、马相，你自在不自在啊？你凭什么去教化众生啊？自在示现牛马猪羊之相，造业受牛马猪羊之报，都叫「自在」，我们懂得这个道理，就可以任意选择。</div><div class=\"text-indent\">「菩萨」二字，讲全了叫「菩提萨埵」，音译而来。菩提译为觉悟；萨埵译为有情。所以「菩提萨埵」，意译为「觉有情」。含有二义：</div><div class=\"text-indent\">一种是从名字义观照，是觉悟的有情、觉悟的众生，这是菩萨的自利功德。愿身菩萨有二：一是过去世中已经成就了菩萨果位，今生乘愿再来，借凡夫相教化众生。二是今生以凡夫身听经闻法，明白「如来藏」道理，当下转凡夫业报身为菩萨愿身，这叫「愿身现来」的菩萨（不叫再来），当下兑现。这叫觉悟的有情。第二种含义呢，是把「觉」作为动词理解，「觉有情」就是教育众生，度化有情。这是菩萨的利他功德。</div><div class=\"text-indent\">那么到了佛呢，自觉觉他，觉行圆满。菩萨是「分真即佛」。我们平常所讲听经闻法当下成佛，是指成「分真即佛」。注意，这个分真即佛不是天台宗的分真即佛，不要混为一谈——我们将圆满佛比喻为100分，分真即佛比喻为60分，70分，其实就是明心见性的菩萨。他最低保障线是不落三恶道，或者不落六道轮回。其实按照佛来定位，凡是真正明白「如来藏」道理的人，都是七住位，乃至七地位以上的菩萨，这不用怀疑49。</div><div class=\"text-indent\"><strong>行深般若波罗蜜多时：</strong>这个「行」呢，有些人老在问，到底是念xíng还是念hèng啊？我告诉你们，念xíng也好，念hèng也好，你念什么都好。这就是心法。讲经说法，「依义不依语」。这个「行」呢，就是观世音菩萨在见道以后，修行心地法门，是说行持功夫50。「深」：是他行持功夫的境界。这个「深」，解释为究竟圆满。因为观世音菩萨是古佛再来（正法明如来）。这个「深」，一定是究竟圆满；不能解释为是什么初住位、初地位，那不足以说明这个问题。他是圆满如来果位，叫「行深」，彻法源底之深。</div><div class=\"text-indent\"><strong>照见五蕴皆空：</strong>「照见」，是说明「行深般若波罗蜜」，这是什么境界呢？「照见」是一见一切见，见道位、修道位、证道位圆满一体。没有讲看见，没有讲听见，是「照见」。「照」字，上面是「昭」，下面四点水，是表心。「照」是一心昭彰，也就是说破了整个宇宙人生的秘密51。这里要澄清有些法师对这部《心经》的判位，把它判为什么初地位、初住位是没有道理的，观世音菩萨从闻思修入，从明心见性开始进修般若法门；在闻的当下即已是七地以上的菩萨。怎么说是什么初住位的菩萨？菩提还退转吗？</div><div class=\"text-indent\">「五蕴」是指「色、受、想、行、识」这五蕴，也叫「五阴」。「蕴」字的结构，上面草字头，下面是个绞丝，都是些纠缠人的东西；中间是个日，表智慧；下面是个皿字，表工具。重重复复，把智慧包在中间，所以「蕴」呢，带有阴暗之义，非智慧而不可见。</div><div class=\"text-indent\">所表之义为：任何一法都包容无量法。注意，这个茶杯是一块铁，它里面有金银铜铁钙镁铝锌，地水火风和合而成，它少不少一法啊？一法就是无量法，所以带有「蕴」之义，是不是？也就是受想行识每一蕴，是不是都包含无量法啊？所以「蕴」还带有集合之义。本是无量的法，凡夫只执着于一时、一处、一世、一法，所以叫「蕴」。那么，十法界有无量蕴；无量就是无量。可是无量的蕴，无量的法怎么讲啊？万佛出世也讲不清啊；即使你能讲得清，我们这些人有没有福报去听啊？所以佛把无量法无量蕴，归纳为「五蕴」。</div><div class=\"text-indent\">「色蕴」，是表无情法，后面的「受、想、行、识」这四蕴是表「心蕴」，其实就是一个念。佛为了面对客观，启发众生，硬是把一个念、把无量的法分为色、心这两法、这两蕴，所以「五蕴皆空」也叫作「二蕴皆空」，对不对？那么在色蕴里，又包含地水火风这四蕴。如果我不叫「五蕴皆空」，我叫「八蕴皆空」，对不对？能认识这一点，这五蕴皆空已经明白了一半。</div><div class=\"text-indent\">「受蕴」，是六根对外界的第一念感受。比如说，看到灯光，眼睛是不是就有感觉啊？第一念叫「受」。当你开始思维：「啊，灯光怎么是白的？电灯泡不是圆的呀？」当有了二念、三念、四念这种分别的时候，这个时候就已经变成「想蕴」，这是按照身心对外界感受的次第而言。那当眼睛离开了灯光，不看也不想的时候，这个灯很亮，这个意识心还在不在了？不在了。比如，现在听到声音了，声音来了，是不是就把这个光忘记了？虽然忘记了，「这个灯很亮」，这个念在不在啊？一定在，就是在第八识。其实，时过境迁，离尘无体，这是方便法。如果离尘无体的话，那你在这儿听我讲经就白听了，反正你出了讲经堂就没有了。如果离尘无体的话，我们修行干什么？行善或者作恶，都不受报应。</div><div class=\"text-indent\">那么讲到究竟法，我们的意识心时过境迁，看起来好像没有了，其实还在，在第八识里，就是我们的种子仓库，叫做「识蕴」。我们无量劫以来动的一切念，讲的一切话，做的一切事，一样不少，都在阿赖耶识这个仓库里。如果这些东西有形有相，尽虚空遍法界不能容纳；幸亏它无形无相。那么什么是「行蕴」呢？就是第七识，通过它的搬运功德，把我们的受想这六种意识心，而储存到第八识。</div><div class=\"text-indent\">现在采取对治法，既要通过眼耳来听经闻法，又要通过第七识搬运到第八识仓库里去。当我们在中阴身期间，肉团身无明壳销毁，眼耳鼻舌身意这六种妄识心随之灭尽，在我们阿赖耶识里的此刻听经的这个金刚种子，现量功德现前，当下成就。</div><div class=\"text-indent\">那么「五蕴皆空」，佛曾经将虚空比喻为真空，但虚空是不是真空啊？不是。虚空也是由真心所变现出来的有形有相之色法。它有什么相啊？很空旷通达，是不是啊？真空连空相都没有。虽然虚空也是色法，可是与其它色法相比较，虚空比喻为真空最合适不过了。</div><div class=\"text-indent\">在这里，「五蕴皆空」的「空」，应该解释为真空；也就是《楞严经》所讲：「性色真空，性空真色」。「五蕴皆空」是不是讲「性色真空」啊？性受真空、性想真空、性水真空、性Ｘ真空；Ｘ是表无量法呀。真空，当下就是一个真空，就是一个真性。「五蕴皆空」当下就是「阿弥陀佛」；真空就是「阿」，「五蕴」就是「弥陀」。「五蕴皆空」当下就是「如是我闻」；「空」就是「如」，「五蕴」就是「是」，「五蕴皆空」当下就是「如来」；「五蕴」就是「来」，「空」就是「如」。照见五蕴皆空，你就是「如来」；你不懂得五蕴皆空，你是什么啊？你是「如来藏cáng」。</div><div class=\"text-indent\">真正读懂《法华经》《楞严经》，你会感到一切经典都是无聊，连《法华经》《楞严经》都是无聊。讲来讲去就这一句话，这是真的。没有明白这个道理，你读十部经、一百部经就感到趾高气扬——我读了三藏十二部经——有这种念头的人都是些佛呆子，一句经都不懂52。你把「经」读懂了以后，什么经都不想读。换句话来讲，你讲的一切话、做的一切事都是「经」。泥巴经、瓦块经、风经、雨经、大米经、白面经、戒指经、耳环经，哪一本经不是《心经》？不是「如来藏」啊？！万法皆是平等。随便拿出个泥巴块来：「哎呀，这个茶杯、这个如来藏真好啊」，你这叫把经读懂了。诸佛出世就是来解放思想，破除迷信。越是真理越简单。</div><div class=\"text-indent\">真理就是我们的生活，就是告诉我们所面对的一切环境的来龙去脉。你开悟了，时时事事处处得大自在。走在路上，睡在床上，坐在酒吧里，你知道一切都是一个念所变现。这就叫「照见五蕴皆空」。时时、事事、处处都是「五蕴皆空」。这个时间是不是空的？这可不是虚空啊，有些人把这个空说成：「哎呀，都是空的，都是假的，你要看破放下」，这是断灭空。你放下干什么？你要度他才对。看破放下的同时就要把它提起来，这个时候提起叫放下，放下就叫提起，否则你提起是执着，你的放下是搞断灭空。</div><div class=\"text-indent\">不把「如来藏」道理搞明白，你很容易含糊啊！甚至还自以为自己会修行；自以为勇猛精进；「你看我做了多少多少事情……」自以为有什么道行，没有！有些人扬言：「你看，我什么都不管，我什么都放下，你看什么事也没有」，这都是些断灭空。大乘菩萨道不是这样，看破放下的同时大做佛事，行善断恶，引导一切众生共修无上大法。这个法很妙啊！《心经》呢，也不妨是按照分别法来讲，所以仍然把一个念分别为「五蕴」和「真空」。</div><div class=\"text-indent\">下面的一句话，<strong>度一切苦厄：</strong>「照见五蕴皆空」怎么样呢？「度一切苦厄」，这就是果报。「度」，就是解脱，解脱了一切的苦和一切的烦恼习气；「苦」有「身苦」和「心苦」：我们平时讲这个尘劳之苦啊，尘是表「身苦」，六道轮回肉团身要受痛苦；劳是表「心苦」，是烦恼习气；「身苦」呢，也可以说为这个肉团身的分段生死之苦；「心苦」，是表变易生死。所以分段生死、变易生死通通解脱，叫「度一切苦厄」。</div><div class=\"text-indent\">那「苦」是无量呐！可是无量苦，要叫无量佛来讲无量劫也讲不完呐！佛为教化众生，把无量苦概括为「三苦」和「八苦」。</div><div class=\"text-indent\">所谓「三苦」呢，就是「苦苦、坏苦、行苦」。</div><div class=\"text-indent\">苦苦：三恶道的众生是苦上加苦无量苦。人道的众生，贫穷就是一种苦，那贫穷了再生病，生了病还没有钱看，是不是苦上加苦啊？</div><div class=\"text-indent\">坏苦：你快乐的当下就是苦。养心之道，切忌大喜大悲。大悲固然是苦，大喜也是苦。四个退休老人打麻将，一个赢了大钱，哈哈大笑，其他三个输了一大把，重新洗牌啊，洗好了一看，桌子上怎么成了三个人了？那个人笑得在桌子下面已经没气了。这是不是坏苦啊？当下受报。过去有人把这种说成是福报啊，一笑而亡啊。往往这个病根，在快乐的过程中就已经酿成，明白吗？你以为病是突然发生的，其实不是。它也有量变与质变的过程。往往在升官啊、发财啊、男婚女嫁啊，这个过程中就已经埋下病根。吃香的、喝辣的，正在快快乐乐品尝各种佳肴美味的时候，你这个病已经生成，定时炸弹早已埋下。更不用说抽烟、吸毒。自古健康长寿的秘诀，重在清心寡欲。越是简单的生活，越是健康的生活。</div><div class=\"text-indent\">同时呢，听经闻法生欢喜心，叫法喜食，心里是不是有一种力量和光明呐？又是调整皮肉筋骨、五脏六腑，乃至一切的细胞。心里清净，可减少能量消耗。我们也可以通过气功来调理自己的身体。全身放松，哪里不通就在哪里用功，他很快就会松开。</div><div class=\"text-indent\">要明白，有一个好的身体，是为了成就道行，帮助众生。要不然我们才不愿意在这个世界上呢，我在出家前六年就求往生。如果感到自己在这个世界上并不能帮助更多的人，你有病了，那老老实实地求往生，早一点换个身子来，有什么了不起啊。当感到自己在这个世界上还能教化众生的时候，不要说我不怕死，还要不怕生，是不是？就是苦一点我也要多活一天，多讲一句法，多教化一个人。对菩萨而言，生死唯以如来家业为重，唯以教化众生作为衡量的标准。</div><div class=\"text-indent\">行苦：「行」带有变化之义。八十老翁过大寿，高朋满座，热热闹闹，大摆筵席，开心的合不拢嘴；到下午五点钟，大家各自散去，老翁喝茶这才感到快乐，这是一种心态，他知道半天的快乐当下就是苦；还有一种人不是的，人走茶凉，他现在感到太寂寞了，这就叫「行苦」。快乐过去了马上就是冷清的痛苦。宴席上，亲朋好友推杯换盏，但天下没有不散的筵席。不可能哪个人总是在高度的兴奋快乐之中，如果那样的话，你支撑不了几天。本来那个高度兴奋过去以后，来个清净，这也是好事啊，但是他却把它当成一种苦。这是小「行苦」。</div><div class=\"text-indent\">那更大的「行苦」在于来世的果报。特别是凡夫，在世的快乐是大多建立在别人的痛苦之上。你升了官——挤掉了其他几个候选人——现在别人是不是都怨恨呐？这是不是酝酿了来世的果报啊？你发了财，你凭什么发财啊？天下总共一万块钱，你得了九千，那其他人就得不到了。你钱多了，别人是不是钱就少了？一家饱暖千家怨。同时你得这种钱财未必都是光明正大，你总是挖空心思怎么样算计，巧取豪夺，乃至伤天害理。有这种快乐，你来世必得果报。这个世界上没有人吃亏，也没有人沾光，吃亏和沾光是表面现象，大家轮流来。这一世你沾光他吃亏，下一世你吃亏他沾光，谁都跑不掉。</div><div class=\"text-indent\">再来说「八苦」。所谓「八苦」，即「生、老、病、死、怨憎会、爱别离、求不得、五阴炽盛」等这八种苦。生老病死，老与病这两种苦不需要讲，我们都知道。</div><div class=\"text-indent\">生苦：就是「胎狱」。十月怀胎啊，等于坐监狱。妈妈生你当然很痛苦，是不是？可是那种苦比不上你在娘胎里苦的万分之一：母亲喝一口热，胎儿感受如同在烈火地狱；母亲喝一口凉，胎儿的感觉就是寒冰地狱；母亲弯弯腰，翻翻身，胎儿感受如同泰山压顶，气都喘不过来啊。可是出了娘胎以后，因为隔阴之迷就把痛苦忘记了，所以你看小孩子一落地，是不是哇地大哭一声啊？这有两种含义：</div><div class=\"text-indent\">一是说我终于离开了这个活地狱啊。二呢，我离了虎口又入狼群呐。为什么？他到这个世界上也不适应呐，风一吹如刀割。这叫「生苦」。为什么要有这个苦啊？这是警告你：因为人身很难得，你可不要忘本，做人可不容易啊！有这么好的机会，你还不赶快了生脱死！</div><div class=\"text-indent\">死苦：估计我们这一世谁都没有死过第一次，虽然过去死过无量次，都忘记了，这个死可是真苦啊！四大分离，苦不堪言！如同生龟脱壳，活牛剥皮。生龟脱壳不是自己脱啊，是人用刀劈它的壳；活牛剥皮你试试看，不要说剥皮，用针刺一下，都痛起来了，是不是？</div><div class=\"text-indent\">你如果修持有功，心量宽宏，又能进行一定的色身调整，就能很自在地往生，这一点很重要。我们经常讲行善积德不能成佛，绝对不是讲不要去行善积德；否则你人都不能成，你连鬼、畜生都不能成，明白吗？我是强调听经闻法的重要性。修行首先要明理，首先要解决超越六道轮回的问题；其次再去解决一个能够自在往生的问题，在往生前少受折磨。</div><div class=\"text-indent\">你看玄奘大师，天王禅师，哪一个不是大菩萨再来啊！可是他们圆寂的时候很痛苦，他们的苦是替众生受苦，为什么？他为了教化众生，而没有时间调理色身。作为一个得道的圣人，五十多岁就走了，未免太可惜。如果他们能多住世二三十年，佛门不会是今天这样的局面。那些祖师大德不注重色身调理，但是这个肉团身也遵守因缘和合的规律啊。你过分透支，它会早早地报废。这两千年以来，许多得道圣贤英年早逝，没有来得及把正法弘扬光大。这点我们后人不必效仿。希望大家起码，要求不高，活个一百五六十岁，差不多吧？我还在争取看能不能搞个一百多岁啊，哈哈……大家共同努力！但我们长久住世是为了弘扬大法，广度众生。如果为自己，现在走我都嫌迟了。我们不需要像那些人什么「预知时至」，什么「坐着往生」，不需要；我们就是痛得嗷嗷乱叫，耍无赖，都能成佛。我这个痛，那个不痛，明白吧？能否往生不在于预知时至，凡夫也能预知时至。往往修外道的死得很自在，他坐在那里走，笑眯眯地走，还有种种瑞相；但往生之瑞相不是往生佛土的标准。</div><div class=\"text-indent\">我的曾祖父就是预知时至，他根本没有念佛。一大早他跟祖父讲啊：「儿子，我今天要剃头……」讲了一大套。祖父就开玩笑说：「您哪就要走了？」「是的，下午来接我。」就这么简单，下午就走了。这是我母亲讲给我听的，母亲还专门买了四个饼子给曾祖父吃了。</div><div class=\"text-indent\">哪有什么预知时至的往生？到底能不能往生，都不一定。谁给你送这个信儿？你知道他是谁呀？哪个给你送信，你问他一下，你把「如来藏」的道理讲给我听一听。包括往生的时候示现种种的瑞相，都不能证明你往生，或者是不往生。天上的人、鬼呀、魔呀，他都可以示现瑞相来搅惑人心。现在这个送往生的活动啊，在有些地方非常执著——以为送往生能出现瑞相就能成就，从而来拒绝修行正法。但是我们对送往生的工作也要认真做，它毕竟是一个非常重要的环节。在生者去世四十九天之内，劝导他求生极乐世界，可能性、把握性都很大，就是已经明心见性的人在临终前，我们都要送往生，可以提升品位。但是不能把唯一的希望押在这一张牌上，大家明白吗？</div><div class=\"text-indent\">第五种苦，叫「爱别离苦」。亲人之间、朋友之间恨不得都同生同死，可是哪有这样的事情，是不是？爷爷、孙子、姥爷、外甥、爸爸、妈妈，一起生一起死，那还生儿育女干什么，是不是？那不是一下绝后了？这就是一种情执。当明白了万法都是一个念，没有生死的时候，你这个痛苦是不是解除了？</div><div class=\"text-indent\">第六种苦叫「怨憎会苦」。谁都不愿意跟自己有误解、脾气不相投、有仇有怨的人在一起。离得越远越好，惹不起躲得起。可是往往冤家路窄，低头不见抬头见，谁都不可避免，这是我们生生世世的情缘。凡夫呢，就是活在这些莫名其妙的妄想当中。你以「如来藏」道理观照，一切人都是我；讲第二义谛，也是过去世的父母儿女，有什么好怨？有什么好恨？</div><div class=\"text-indent\">我们这个道场跟其它道场不一样。佛氏门中，不舍一人。只有把「如来藏」道理彻底搞明白，我们才能对一切的众生生起欢喜心、恭敬心、慈悲心，明白吗？修行人唯以慈悲度众。但是要用智慧，防止有些人搅乱我们的阵脚。任何一项再好的政策都有它的弊端，这个世界上就没有十全十美的东西，道场能走到今天，已经很感恩诸佛菩萨慈悲了！师父对张三可以拍拍打打，对李四可以拳打脚踢，都是对的，明白吗？该哄的哄，该罚的罚，你只管自己的事，没有什么平等不平等。这是解释这个怨憎会苦，你不要有怨恨心，只管修自己的清净心。</div><div class=\"text-indent\">第七种苦叫「求不得苦」。小孩子一出娘胎是不是就大哭一声啊，干什么？在求啊。你这个时候搞个铃铛摇一摇，嗳，他眼睛瞪得大大的，不哭了，求到了。你放个奶嘴把他嘴巴堵住，又不哭了。众生一直到死都在求，有人求个好死：哎呀，太苦了，早点死吧；有的人相反：不行，再苦，好死不如赖活着，多活一天就是两个半天！可是不管是谁，都不能圆满地求得，就是将军、元帅、国王、总统，他能不能全部求到啊？唯有圣人，人到无求品自高。他没有求了，快乐了。到了圣人的境界，即使坐在监狱里，他求不求啊？求什么？他不求哪个去帮他说话，他很自在，为什么？监狱也是他，监狱也是佛，是不是？大不了求生极乐世界，乘愿再来，他没有怨恨心。</div><div class=\"text-indent\">真正明白「一心三藏」，你没有任何理由在任何时间、任何空间、任何事情、任何人面前生任何烦恼。他唯一的烦恼就是恨众生，恨铁不成钢，这是佛菩萨的烦恼。佛菩萨的烦恼最大，谁也比不上。但那种烦恼是智慧，叫「尔焰」。焰是表智慧，表力量。他没有烦恼就不能方便教化众生。凡夫的那种求，都是情执，都是烦恼——检点自己，你现在还求不求了？父母生病了，「啊！让我父母赶快恢复健康」，那你怎么不去求人家的父母健康？看到狗啊、猫啊，让它们都有饭吃，对不对？成天就是东家长西家短，你怎么成就？</div><div class=\"text-indent\">另外，《法华经·安乐行品第十四》讲的，无量国土之无量众生经过无量劫，想听到《法华经》的名都不可得53！是不是求不得《法华经》之苦啊？你现在求到了，不仅闻其名，而且还有人给你讲解，你怎么忍心不抓住当下啊？这是解决我们生生世世的问题啊！有些人种种借口，什么什么事……等无常大鬼来的时候，他不敢吭声了，绝对不敢讲：「哎呀，我什么事还没有做，我不能去。」无常大鬼一个耳巴子：「滚。」「是是是。」</div><div class=\"text-indent\">第八个苦呢，叫「五阴炽盛苦」。就是《心经》讲的「五蕴皆空」啊，五蕴不空的话是不是就是炽盛苦啊？他看不到空就炽盛嘛。四大假合的这个肉团身，如何腰酸背痛，头疼脑热，手麻脚肿，就是炽盛苦啊。这是讲色蕴炽盛。</div><div class=\"text-indent\">「受想行识」也在炽盛，炽盛炽盛，就是动荡不安。这个皮肉筋骨，总是这样那样不舒服，「受想行识」这种心态呢，总是在不停地打妄想。所谓「受」，这个皮肉筋骨不舒服了，他是不是有了受了？那这个「想」，他在不停地打妄想，一会儿这样一会儿那样，至于那个「行」和「识」，我们在带着这个肉团身的时候感觉不到，可是你感觉不到它，它感觉得到你啊。它在那里也是在不停地打妄想啊！所以这五蕴炽盛之苦啊，既是今生苦果，又是来世六道轮回遭受苦报的根源。炽盛，就是在不断地造业啊。</div><div class=\"text-indent\">那么「度一切苦」，前面讲的三苦、八苦是泛泛而言，讲到根本，还有「五浊恶世之苦厄」，它更为深透。「五浊」，按照《楞严经》来分析它的含义，是彻法源底的，从根本上开智慧。</div><div class=\"text-indent\">五浊，是指「劫浊、见浊、烦恼浊、众生浊、命浊」。把「五浊」解释清楚，可以帮助理解「无明不觉有三细，境界为缘长六粗」。</div><div class=\"text-indent\">劫浊：常见的解释说，「劫浊」是时间的污染。这种解释不能说错，可是谁都听不懂啊！时间受污染了，年月日哪里受到污染了？也有的讲「劫浊」没有真实义，下面的四浊成就了，就是「劫浊」。这样讲也没有错，没有哪一法不是哪一法，可是这样解释等于没有解释。他却不知道这个「劫浊」就是整个五浊的基础，整个五浊的根本。这个「劫浊」就是十方法界的缘起，形成之因。「劫浊」从全方位展开说明「一心三藏」的基本法义。我们按照佛在《楞严经》的开示来展开观照。</div><div class=\"text-indent\">劫：在佛法里经常以劫来计算时间，少则几十亿年，多则百亿、千亿、万亿年。它是一个不定的概念。而且在佛法里讲到时间就必然有空间，时间和空间是不能分开的，就像一个物体，有了长度就必然有宽度和厚度。有了点就有线、面、体，一样的道理。那么有了时间和空间，就必然会产生万法，森罗万象，千变万化。</div><div class=\"text-indent\">注意，世出世间对时间的概念理解有区别。在佛法里是讲次第圆融，不是讲世间法。为什么许多人讲经说法对佛法造成偏解？他是按照世间的心态来解佛法，讲的那个「劫」就是只讲时间。那么，这就变成不了义法，你还听不出来。因为你在世间法里已经养成了根深蒂固的习惯。所以这个「劫浊」呢，就是表时时事事处处，都已经迷惑颠倒了我们本来的心——就是《地藏经》所讲，开口就是错的，动念就是错的，我们却还自以为是真的，这是众生的悲剧54。</div><div class=\"text-indent\">那具体解释「劫浊」，不妨按照分别法，先从时间的污染来说起。在这个过程中呢，它自然而然就展开空间和万法，所以下手之处是从时间说起。现代科学已经能够意识到时间是人类的一种错觉，它是虚妄的，是不真实的。可是讲时间是假的，谁相信啊？</div><div class=\"text-indent\">从日常生活中来看，许多同修感觉听师父讲几个小时的课不知不觉就过去了。那么这几个小时如果是在车站、码头等客人，在公交车站旁边等公交车，可要了你的命了；哎呀，我的妈呀，怎么这么长时间？同样几个小时，你感觉不一样。生活很自在，身体很健康，热热闹闹，不知不觉——啊，怎么天黑啦？啊，怎么又过八月十五啦？啊，又过年啦！生活穷困潦倒，多病多难，你是不是感到度日如年呐？长夜难熬啊！时间是不是一种虚妄啊？</div><div class=\"text-indent\">第二：往往在梦中梦到过去的事情，不足为奇，梦到未来的事情一开始没有把它当回事，怎么会梦到这个事情？过了几天、几个月、几年以后，竟然成真，猛然想起这个事几天、几个月、几年前就已经梦到了哇！至于有宿命通的人，他知道过去、现在、未来很多事，就很有体会。</div><div class=\"text-indent\">第三：修禅功的人，不管是气功也好，或者禅宗也好，他有同样的感觉。每天能够坚持打坐两个小时习惯了以后，那两个小时是不是感到十来分钟而已啊？就是这个道理。所以时间是一种错觉。佛在《楞严经》讲摩诃迦叶感觉几千年、几亿年、无量劫就是一念55。</div><div class=\"text-indent\">玄奘大师去西天取经，从雪山堆中发现一个坐禅人，玄奘大师三弹指，他一出定就问：「释迦牟尼佛出世了没有啊？」玄奘大师告诉他：「释迦牟尼佛已经灭度一千多年了。」说明他是在释迦牟尼佛出世之前就入定了，然后又要入定：「好，等弥勒佛来的时候再说。」可见，他还准备坐五十多亿年。他就是窥基大师的前生。那在禅定中，他有没有时间的感受啊？无量百千万亿年当下一念。</div><div class=\"text-indent\">第四：人间这一天，鬼道感觉是一个月；畜生道感觉是七年；地狱道的众生二千七百年；越往下的、越苦的地狱，它的感觉时间越长。往上就反过来了，怎么反呢？第一层天的一天，是人间五十年；第二层天一天是人间的一百年；越往上成双倍的，二百、四百、八百、一千六、三千二、六千四……到二十八层天的时候，人间过了几亿年，他们的感觉就是一天。</div><div class=\"text-indent\">第五，几天几夜、几分几秒、几万亿亿亿年，在佛就是当下一念。要感觉，一念能知道无量百千万亿年的时间；要不感觉，一念都没有，他没有时间的感觉。诸佛之所以是诸佛，诸佛活在当下一念，定在当下无念。要讲活的话，活在当下一念；要讲定的话，没有念，没有时间。凡夫之所以是凡夫，凡夫活在过去、现在、未来；佛活在无生无死、不生不灭这种境界中，你看似他在生灭，他都在定中。这是每一个人的本来面目。修行的目的就是回到本来面目去，讲回是方便说，丢下迷惑颠倒，破除习气，当下就是。</div><div class=\"text-indent\">第六，我们再来看时间这个怪物怎样产生？注意，讲产生都是方便说，讲怪物也是方便说。长长短短都是我们在做自己的游戏而已。成佛以后游戏神通，再也不会受到束缚。游戏就是游戏啊！按照佛在《楞严经》的说法，叫作「真如不守自性，一念不觉而有无明」。这个一念无明就是时间的老祖宗，在唯识叫「业相」。「业」带有动作、制造、造作之义；如果没有动作，没有造作，你什么也干不成。所以这个「业相」就带有动相，我们心动了；这个心一动，就将我们无形无相如如不动的真心本来面目——也叫真空——把真空浑浊为晦昧之空，可以说为虚空。怎么说为虚空？我们从此有了空的感觉，虚空是不是通达啊？当我们处于真心本来面目的时候，你在空不知空，感觉不到空，你没有空的概念。</div><div class=\"text-indent\">打个比方：你有时愣头愣脑地在那里，自己也不知道在干什么。有个朋友或者同事叫一声，「你在那里想什么」？嗳，你回过神来了。想什么？刚才什么也没有想啊！打比喻，发愣的状态就是真空。如果你永远保持那种状态，我告诉你，你永远都是那个样子，一百万岁、一亿岁都是那个样子，也不会老，也不会小。可惜呢，好景不长啊！是不是？当出定以后，是不是开始打妄想了？</div><div class=\"text-indent\">比如说：第一个妄想，要烧饭了。这已经进入了根本无明之初，「要烧饭」已经是三个念。当你一出定就感觉到的时候，那是第一个「业相」，要烧饭就变成第二个相，叫「转相」；要烧饭的时候脑子里是不是出现了饭的这个文字现相？是不是出现了大米白面这个现相？这在三细里叫「现相」，这叫胜义之法，叫「胜义尘」。这种胜义尘，天眼能看到。开天眼的人连你做梦想什么他都知道。那么在这个时候有了要烧饭加前面的业相四个念，是不是形成了过去、现在、未来啊？是不是形成了一条线呐？这就是时间开始产生。</div><div class=\"text-indent\">那么时间产生了，在胜义法里，这个时候虚空是不是形成啦？这还是胜义法，还没到浮尘法的虚空。比如说，我闭上眼睛，头脑里有没有虚空啊？这个虚空跟眼睛看到的虚空一样不一样？前者是胜义虚空，眼睛看到的是浮尘虚空。注意，这是从根本上开智慧。所以在根本无明之初，在某种意义上就已经出现了十法界，那叫胜义世界。你自己知道了，但还拿不出来给别人看。开天眼的人能看到你的内心世界。产生了要烧饭的概念，你是不是就要走路，就要淘米洗菜？这叫「境界为缘长六粗」，而且在烧饭之前你会进一步勾画出需要水啊、油盐柴米啊，一系列的事情……</div><div class=\"text-indent\">所以这个六粗的「智相」啊、「相续相」啊、「执取相」啊……这个时候通通都已经产生，它随着一系列的思维活动而产生。到了具体淘米烧饭的时候，这个时候叫「起业相」。「名字相、起业相、业系苦相」就变成粗糙的浮尘的十法界万法，这就形成了「世界相续、众生相续、业果相续」。</div><div class=\"text-indent\">以淘米烧饭为例，可以意识到，整个人世间生生世世种种的造作，比如打工呐、挣钱呐等等一切包含在内。佛是过来人，佛把这个道理讲出以后，我们再回过头来观照。在我们这一切的种种思维、种种造作没有出现之前，在脑袋没有想之前，它在不在心里啊？那在我们心里是不是就是我自己？就这个道理，这叫「劫浊」。</div><div class=\"text-indent\">我们由「劫浊」再引出这个空间之浊，什么空间之浊呢？这个泥巴瓦块、山河大地、树木花草，在《楞严经》讲啊，都是我们一念坚固妄想而变现出来的56。谁有胆结石、肝结石或者肾结石，也是由自己那种黑暗的心、痛苦的心、阴暗的心变现出来的，所以讲心结啊！心能结成泥巴瓦块，心能结成水火地风……那当我们心里变现出泥巴瓦块的时候，这个泥巴瓦块会不会始终就是一团大啊？不一定，东一块西一块、上一块下一块，是不是就形成了一个空间呐？那么想一想，这个泥巴瓦块和空间没有变化的时候是不是在我心里啊？在我心里，是不是就是我啊？可是它变出了泥巴瓦块，我们把它当成了泥巴瓦块；变成了空间，我们把它当成空间，这是不是「劫浊」啊？也叫空间浊，也叫万法浊，什么东西都浊了。</div><div class=\"text-indent\">由此观照一切的万法都是当下一个念变现的。一切的万法在我们心里的时候有没有形相啊？它都是由无形无相变现而有，那既然你的心无形无相，他的心有没有形相啊？猫心、狗心有没有形相啊？泥巴心、瓦块心有没有形相啊？是不是所有的心都是一个心呐！再一次观照做梦，梦中的一切境界是不是就是做梦的一个人变现出来的？诸佛出世就是讲这个真理。</div><div class=\"text-indent\">但是我们现在分张三、李四、王五啊，他是国王、将军、元帅，我是修板车的；泥巴瓦块是无情，人是高级动物，狗猫鸡鸭是低级动物，是不是都在分别了？这都叫「劫浊」。生是不是我？死是不是我？没有生没有死之前是不是都在我们心里？所以我要生啊，我可不能死啊，这是不是劫浊？要讲命的话我们没有命，没有命叫什么命呢？叫法身慧命。命也是我，死也是我，是不是很好玩呐？在这个过程中先要破一部分东西，才能见一部分真；当你见了一部分真的时候，那么被破的那一部分假统统都是真——这才叫真，都是我们一个念自性变现呐！这个法妙啊！你真的悟透了，大解脱。</div><div class=\"text-indent\">补充一下：刚才打比喻（发愣）讲的这种状态，也就是在无始之前，在这个山河大地、日月星辰、诸佛菩萨、天人鬼畜没有一法显现的时候，我们就是这个状态。好好观照，能想明白吗？所以这个时间的长短是不是也在我们的心里啊？既然在心里，无非是早晚的问题，它总会有抛头露面之日。人家叫他那一下，他是不是马上感觉到时间的长短呐？这还是因缘所生法，你是受到外界环境的刺激而产生了时间的概念，这种不能说为时间的起源，因为你在受到外界刺激的时候，那个外界已经产生了时间，不能找到时间出生的根源。</div><div class=\"text-indent\">这个根源一定是在万法没有显现之前，它突然出现那一念之时。这个法我们下面仍然通过比喻来说明。比如没有人来找你的时候，也没有东西惊动你的时候，你是不是有时自动地一下：「哎，我刚才在想什么？」有没有这种情况？这种比喻就相似于时间的起源，什么原因也没有它就出来了，为什么出来了？这是它的本能，这叫「生相无明」。我们本来就具足这种出定、入定的功能。</div><div class=\"text-indent\">也就是说在无始之初，山河大地、日月星辰、诸佛菩萨、天人鬼畜没有一法显现的时候，我们就是一个灵体，相似于发呆什么都不想的状态。那么既然一切的万法、万相法尔具足在我们这种空性本性当中，它就随时可以显现。这个时候它突然显现出一个念来，感觉自己的存在——我是个灵体啊，是不是有一个念了？当这个念一出现，这个时候的真空已经形成了虚空。那当一个念出来以后，它愁不愁有第二念、第三念、第四念呐？这个二念、三念、四念就跟踪追击，就打妄想，这个时候由绝待的「一」而似乎形成了对待的「二」，就像我们对着镜子一样，镜子里的人跟这个是不是一个人啊？它把镜子里的人对立了，就是当初的无始无明。有了二念、三念，是不是形成了过去、现在、未来啊？时间是不是产生了？那在同时是不是就形成了空间？能不能分开啊？形成了空间以后，我们继续对着空间打妄想，在《楞严经》讲，「一念坚固妄想而有色法」，先有胜义的地水火风四大——胜义四大肉眼不能看到，天眼、法眼能看到，当今的一些高精密电子仪器也能看到。所以有时间，有了虚空，那么有了万法、万相，从此叫「劫浊」。我们的心被时间污染，被空间污染，被万法污染，被万相污染，把这些东西当成了真实，而忘记了这些东西都是我的一念变现，并且是当下一念。</div><div class=\"text-indent\">这是讲「劫浊」。我是根据佛的金口玉言来借题发挥，大家一定要十分珍惜啊！不仅要珍惜，你还要讲给别人听。讲一个「劫浊」，你足以成就人，功德无量。由于「劫浊」，就形成了下面的「见浊、烦恼浊、众生浊、命浊」，没有哪一浊不是哪一浊。「劫浊」实际上是下面四浊的基础。</div><div class=\"text-indent\">见浊：可以与世间法所讲的世界观相对应，实际上「劫浊」是最根本的世界观。「见浊」，就是以「身见、边见、见取见、戒禁取见、邪见」这五见为体。</div><div class=\"text-indent\">「身见」：众生执着这个肉身就是我，一切的烦恼习气由此产生，这是我执。可是，这个肉身不是我啊！它是「我所」，是我所拥有的一个工具。这个肉团身生生世世生住异灭，可是它的主人是我们的灵体。世间有句骂人的话叫行尸走肉，在佛法里来讲叫歪打正着，给他讲对了，就是个行尸走肉。行尸走肉是不是无情物啊？是不是泥巴瓦块啊？可是为什么它活蹦乱跳，我们还把它当真呢？讲笑话，坐在这里的，从讲经的印广师到听经的各位菩萨都是什么东西啊？</div><div class=\"text-indent\">我告诉你们，都是一堆烂泥巴。一堆烂泥巴在这里，讲的讲，听的听，还搞得跟真的一样。为什么这一堆烂泥巴会变成些活生生的东西？我们先来打个比方，过去放电影把那个胶带往机架上一装，一通电以后，那个电影里男女老少说说笑笑，蹦蹦跳跳，是不是全部出来了？当下变活了。虽然变活了，它本来面目就是一张胶卷。在物理上，这叫视觉暂留，暂留什么？下面还要解释。</div><div class=\"text-indent\">再打一个比方，现在也还有一些灯泡属于拉线开关，是不是？喜欢搞恶作剧的人把拉线开关一圈一圈一圈……圈了十来个圈，然后往下猛一拉，嗒嗒嗒嗒嗒嗒……一那么嗒嗒嗒嗒嗒的时候，那个灯就一直是亮的。其实响十次的话，这个灯一定是亮十次，暗十次。为什么我们见不到暗？这叫视觉暂留，我们先这样解释，明白这个道理就好。</div><div class=\"text-indent\">我们的色身就是地水火风四大组成，它是无情物。虽然是无情物，它跟有情没有绝对的界限，也是由我们的心所变现57。然后由我们这一念妄想啊，来把地水火风这四大搅和在一起，叫「想相为身」，叫「色心连持为一体」。后面讲「命浊」还涉及到这个问题。因为这个心的能动作用呢，对无情的地水火风感应道交，作用与反作用，然后使这个无情的地水火风或者意识感觉很低等的心提升，他有了疼痛的知觉，从此，我们就感觉有了生命。我们的主人不是这个肉团，也不是能看、能听、能想、能吃饭的这六种意识心，都不是。它是使眼耳鼻舌身意这六根能看、能听、能想的那个老板，由它控制这六根，这叫第七识。</div><div class=\"text-indent\">修是修心呐！所以我在讲《过五关度六将证菩提》的时候，首先帮助大家扫除佛盲，破除身见。有些人即使相信有来世，但不懂得为什么有来世，这还是迷信。怎样才是正信呢？当时举了三个例子，证明身心有相对独立性，心不受时间、空间的束缚，而且身老心不老。</div><div class=\"text-indent\">同时，这个色身就是「联合国」啊。在《楞严经》第九卷讲到：到一定的时候，你身上无量的众生开大会，眼睛、耳朵、鼻子各是一个独立体58：「啊，现在由鼻子菩萨主持法会。」还有嘴巴菩萨、耳朵菩萨、眉毛菩萨、指甲菩萨、肝菩萨、肾菩萨、胃菩萨、肠菩萨、里面还有小便菩萨，许多螨虫病菌菩萨，是不是？还有无量的细胞，特别是每一个癌细胞，都是一个冤亲债主。无量众生共聚这个肉团，你说它是你吗？</div><div class=\"text-indent\">为什么自杀的人要下无间地狱？因为他不仅仅是自杀，还在他杀。你没有权利糟蹋这个生命。为什么在《法华经?见宝塔品第十一》里出现了释迦牟尼佛的那么多分身佛啊？为什么现在实验室里从一滴血液能克隆动物啊？因为无量的命跟你息息相关，你一个人成佛是不是无量的众生都跟你成佛啊？他都是分身佛啊！</div><div class=\"text-indent\">我们的灵体，也就是第七识，每秒生灭1280万亿亿次。由于我们活着的时候，当身体的五脏六腑各方面还功能健全，我们执着生，不愿意死，所以我们就在自己的这种顽固的妄想心中生活；当「我」这个机器快要崩溃的时候，也就是死亡来临时，肉团身死了没有啊？它根本没有生死，但是我们又执着了死，所以它就不动了。生死把握在我们自己的心中。</div><div class=\"text-indent\">在小乘法，你能把这个身见看破，可以不历修证，当下证初果罗汉。舍利弗仅仅是听马胜讲了两句偈——「诸法因缘生，诸法因缘灭」，他就证罗汉果。所以说破除「身见」，明白了色身是假，那作为开智慧的人，是不是更加应该保护色身呀？以此更好地成就道行，弘法利生。</div><div class=\"text-indent\">所谓「边见」，又分为两种：一者，「断见」，二者「常见」。「断见」：认为人死如灯灭，来世谁见过啊？「常见」：认为人死以后来世还是人，牛马猪羊死了以后，来世还是牛马猪羊。那么这两种邪知见实际上都是取消修行，既然是这样，我们还修什么啊？修来修去，人还是人嘛！这两种知见很普遍。</div><div class=\"text-indent\">所谓「见取见」，是「非果计果，未证谓证」。他没有证到这种果位反而自以为证到了。最常见的是有些人修禅宗、修气功，开了天眼，开了天耳，与一些鬼神仙众能够沟通，就自以为是明心见性的菩萨。</div><div class=\"text-indent\">有人讲：「我师父是明心见性的人啊。」我说：「怎么个明心见性呢？」他说：「我师父还会给人家开药方看病。」会看病的人多了，那都是明心见性了？！还有些讲啊：「我师父有什么什么神通，能看到什么什么什么。」我问：「如果你师父与老子和吕洞宾比怎么样啊？他会不会腾云驾雾啊？」他说不会。我说：「与那个哪吒、杨三郎比怎么样啊？能不能排山倒海啊？」他说不会。「就算他能排山倒海，腾云驾雾，也不过是凡夫，怎么就变成是明心见性呢？」嗳，他不作声了。</div><div class=\"text-indent\">佛在《法华经·见宝塔品第十一》的偈颂里列举了九大难事做比较，以体现受持《法华经》之难。请看经文：</div><div class=\"text-center\"><strong>诸善男子，各谛思惟，此为难事，宜发大愿。</strong></div><div class=\"text-center\"><strong>诸余经典，数如恒沙，虽说此等，未足为难。</strong></div><div class=\"text-center\"><strong>若接须弥，掷置他方，无数佛土，亦未为难。</strong></div><div class=\"text-center\"><strong>若以足指，动大千界，远掷他国，亦未为难。</strong></div><div class=\"text-center\"><strong>若立有顶，为众演说，无量余经，亦未为难。</strong></div><div class=\"text-center\"><strong>若佛灭后，于恶世中，能说此经，是则为难。</strong></div><div class=\"text-center\"><strong>假使有人，手把虚空，而以游行，亦未为难。</strong></div><div class=\"text-center\"><strong>于我灭后，若自书持，若使人书，是则为难。</strong></div><div class=\"text-center\"><strong>若以大地，置足甲上，升于梵天，亦未为难。</strong></div><div class=\"text-center\"><strong>佛灭度后，于恶世中，暂读此经，是则为难。</strong></div><div class=\"text-center\"><strong>假使劫烧，担负干草，入中不烧，亦未为难。</strong></div><div class=\"text-center\"><strong>我灭度后，若持此经，为一人说，是则为难。</strong></div><div class=\"text-center\"><strong>若持八万，四千法藏，十二部经，为人演说。</strong></div><div class=\"text-center\"><strong>令诸听者，得六神通，虽能如是，亦未为难。</strong></div><div class=\"text-center\"><strong>于我灭后，听受此经，问其义趣，是则为难。</strong></div><div class=\"text-center\"><strong>若人说法，令千万亿，无量无数，恒沙众生，</strong></div><div class=\"text-center\"><strong>得阿罗汉，具六神通。虽有是益，亦未为难。</strong></div><div class=\"text-center\"><strong>于我灭后，若能奉持，如斯经典，是则为难。</strong></div><div class=\"text-center\"><strong>我为佛道，于无量土，从始至今，广说诸经。</strong></div><div class=\"text-center\"><strong>而于其中，此经第一，若有能持，则持佛身。</strong></div><div class=\"text-center\"><strong></strong></div><div class=\"text-indent\">明心见性，要弘扬《法华经》，这是难事。为什么？因为它太简单了！你说这个冤枉不冤枉呐？最简单的事情变成了最难，这是我们众生的执著。当你读懂了《法华经》，读懂了《楞严经》的时候，你知道《法华经》《楞严经》最简单！你过去认为的我吃饭，你都错了，你都不懂什么叫饭。那个饭是饭吗？那个衣服是衣服吗？你一切的知见全部都颠倒了。许多人讲《阿弥陀经》最好懂啊！一读就懂。但是，你读懂了《法华经》《楞严经》才明白，这《阿弥陀经》你一句都不懂，一个字都不懂。连谁是你的老爸老妈你都不懂。他是你的老爸老妈吗？他一百年前是你的姥姥，一万年前是你家里养的一条狗，一亿年前是杀你的那个强盗，二亿年前是你的小外孙。你说你认识谁呀？我再告诉你，在三万亿年前他就是白骨精，你相信不相信？四亿年前他就是一堆臭狗屎，五亿年前是一个乌龟，你说他到底是谁呀？你不懂《法华经》《楞严经》，你谁都不认识谁！好好想想这个道理。</div><div class=\"text-indent\">那么懂了以后呢：姥姥姥爷也好，释迦牟尼、阿弥陀佛也好，泥巴瓦块也好，都是你呀！都是一个念在变现啊！你这个时候要自己打自己嘴巴：这么笨！这么简单的事情我却把它看得那么那么难。佛在《楞严经》又讲：<strong>决定成佛，譬如以尘扬于顺风，有何艰险？何藉劬劳，肯綮修证？</strong>成佛易如反掌，哪里劳你苦修？没有那回事。这里又讲多难多难。所以佛说难说易，全在审时度势。</div><div class=\"text-indent\">有些人认为把佛说成牛屎狗粪，他浑身汗毛直竖。这就是我们无量劫以来的执著，以这种心态，你将来很容易走火入魔。歪魔邪道魔鬼就是利用你这种分别心，他示现庄严相来戏弄你。你看看《楞严经》最后两卷讲的五十种阴魔境界。那些魔鬼都是示现毗卢遮那佛59，没有哪一个示现青面獠牙的魔鬼来做你的师父。魔只会示现庄严相，他不会示现恶相来引诱你。我们往往在定中看到那些庄严相，欢喜心；看到恶鬼相他知道来找我：师父啊！我看到什么什么了，你救救我啊！如果看到什么庄严相的话来讲啊，他还来教化我：师父啊！我证果了！就是这个样子。我把他批评一顿呢，他生烦恼了，好像师父是嫉妒心，还发信息来：你知道吗？我已是证果圣人。</div><div class=\"text-indent\">诸余经典——从这下面来讲，大家瞪大眼睛看啊！</div><div class=\"text-indent\"><strong>诸余经典，数如恒沙：</strong>除了《法华经》之外的一切的经典。但是说明，《楞严经》也是《法华经》。一切经典，包括《大方广佛华严经》，包括《金刚经》《六百部般若》，统统包含在内。虽说此等，未足为难：《法华经》《楞严经》之外的一切经典你全部能讲也不足为奇。这是第一个不足为奇。</div><div class=\"text-indent\"><strong>若接须弥，掷置他方，无数佛土，亦未为难：</strong>用手把须弥山提在这里—随便扔，扔到他方「无数佛土」，不是扔一个佛土，也没有什么了不起。你说这个人神通大不大呀？都是在调我们的心呐！你要知道受持《法华经》的人是多么地不可思议呀！</div><div class=\"text-indent\"><strong>若以足指，动大千界，远掷他国，亦未为难：</strong>用那个脚趾头把一个银河系垫在脚底下一踢：走！踢到其它的什么银河系里去了，也不足为奇。</div><div class=\"text-indent\"><strong>若立有顶，为众演说，无量余经，亦未为难：</strong>「有顶」就是第二十四层天，是色界天的天顶往上面。从二十五层往上是虚空天，有色界天有顶。一个人站在有顶——这是以上临下，来对无量的人讲无量的经，讲无量的经「亦未为难」。佛在这里是不是说，讲经不在于多，而在于真，要讲了义法。亦未为难，是说不足为奇。这是讲的四个「亦未为难」。</div><div class=\"text-indent\"><strong>若佛灭后，于恶世中，能说此经，是则为难：</strong>前面四个「不足为难」就是为了衬托这一个：能够讲《法华经》这是难得。在下面这段偈颂呢，佛专门赞叹受持《法华经》的人。在后面《药王菩萨本事品》是把受持《法华经》的菩萨说为「菩萨中的菩萨」。</div><div class=\"text-indent\"><strong>假使有人，手把虚空，而以游行，亦未为难。于我灭后，若自书持，若使人书，是则为难：</strong>虚空有没有边啊？有没有坏呐？虽然无边无坏，这个人却能够用手抓住虚空，还到空外之空去旅游——别说没有这样的人，就是有这样的人，佛说不为稀奇。那么在佛灭度以后有人能够「书写受持」，注意啊！「若自书持」：持是表明白了《法华经》的真义；而且他也可以教人书，这样的人难得。那也真是把受持《法华经》的人赞叹得无以复加呀！不要说看到有人把住虚空，如果我们看到一个人把前面的这条运河扛在肩膀上，你们可能大叫：哎哟！佛来了！可能谁也不听印广师讲经了，是不是啊？或者有人把这个宝塔用手顶起来了，跑到扬州街上去看：走！去看那个人把文峰宝塔用一个指头顶起来，快去啊！</div><div class=\"text-indent\">佛在所有的经典上，打了这么多比喻，集中体现出他的智慧，集中体现出他的良苦用心：他不惜一切代价，就是来讲《法华经》的殊胜。</div><div class=\"text-indent\"><strong>若以大地，置足甲上，升于梵天，亦未为难。佛灭度后，于恶世中，暂读此经，是则为难：</strong>脚用来走路的，你却一边顶着地球，一边还走到梵天上去，是不是很困难呐？佛认为这样也不足为奇呀！能够在佛灭度以后的「恶世中」——我们现在就是「五浊恶世」——暂读此经，都了不起。何况我们天天读啊？何况我们还来听啊？何况我们还读懂啊？</div><div class=\"text-indent\"><strong>假使劫烧，担负干草，入中不烧，亦未为难；我灭度后，若持此经，为一人说，是则为难：</strong>这个「劫烧」可以理解为整个虚空世界无处不烧。一个人担着干草——不是湿草，就是湿草也要把它烧掉，何况是干草——能够在大火之中草叶都不坏，没有什么了不起。在佛灭度以后能够为一个人说《法华经》，「是则为难」，都了不起。</div><div class=\"text-indent\"><strong>若持八万四千法藏，十二部经，为人演说，令诸听者，得六神通，虽能如是，亦未为难。于我灭后，听受此经，问其义趣，是则为难：</strong>这里「八万四千法藏」是表无量的经典，「十二部经」也是表无量的经典，「十二部经」就是「八万四千法藏」，「八万四千法藏」就是「十二部经」。「十二部经」是用十二种体裁来讲经，就像我们写文章，有散文、小说、诗歌、词曲、小品、相声……十二种体裁：长行、偈颂、譬喻、本事、本生、授记、论议，等等。也就是说，一个人能讲无量经典无量法门，这是第一；第二呢，你还能令听到的人得六神通——五神通不足为奇，天人鬼畜都有，六神通其中有一个漏尽通，已证阿罗汉果位——也就是把这些人都培养成为超越三世六道轮回的圣人，他自己起码也是阿罗汉，你即使能够做到这样，不足为奇。</div><div class=\"text-indent\">而佛灭度以后能够「听受」《法华经》，「受」就是见道，不见道你不能认可，不认可你不能接受，这个「受」是「正受」。现在许多人都是迷信的「受」，他受持一部经根本都不懂。所以这里「问其义趣」，「问」已经进入学问。他明白这个道理以后进一步深研，养悟，提升道行。能问的人他已经进入境界。</div><div class=\"text-indent\">从这里开始，这是读无量经，另外前面的「若立有顶，为众演说」，站在二十四层天上「为众演说」是不是无量人啊？那么站在有顶天上是不是虚空级的大法师啊？他不是我们这个地球级呀！也不是国家级，也不是省级啊！是虚空级的，面对无量大众，宣讲无量经典，把无量人培养成为阿罗汉这样的法师，都不如受持《法华经》的菩萨，这个道理我有没有讲错呀？好好对照。所以我们就要明白我们能够信解受持《法华经》的人是谁。有道无道自己知道。</div><div class=\"text-indent\"><strong>若人说法，令千万亿，无量无数，恒沙众生，得阿罗汉，具六神通，虽有是益，亦未为难。于我灭后，若能奉持，如斯经典，是则为难：</strong>前面已经有了「无量无边」，佛在这里感到讲得还不过瘾，讲得不明显。本来前面「若立有顶为众演说」是不是就无量了？这里又讲：「令千万亿无量无数恒沙众生得阿罗汉」，都不如能够信解受持《法华经》的菩萨。这两句话是为了讲一个事情。若能奉持《法华经》，这是很难得。</div><div class=\"text-indent\"><strong>我为佛道，于无量土，从始至今，广说诸经，而于其中，此经第一：</strong>佛进一步来强调。「我为佛道，于无量土」这是讲空间；「从始至今」这是讲时间；「广说诸经」这是讲无量万法；「而于其中，此经第一」，无分别不妨分别，这是提纲挈领。<strong>若有能持，则持佛身：</strong>读懂了《法华经》「一心三藏」，当下妄心往生到真心、当下凡夫的业报身即是菩萨愿身。这是「则持佛身」。</div><div class=\"text-indent\">这是佛惟恐一些人利用所谓的神通小术、旁门左道来诋毁正法，举了这么多例子。我们不能迷惑颠倒啊！如果现在有一个人在外边腾云驾雾，我估计起码要走三分之二的人，「赶快去拜佛啊」，又一把鼻涕一把泪呀，「佛啊，你来给我们摩摩顶吧，我们不再听印广师在那里胡说八道啦」，是不是啊？有些人对神通可感兴趣了！佛在《楞严经》中所讲的五十种阴魔境界里解释得更详细。在七菩提分中讲，把境界都要舍掉；好的境界不去攀缘，恶的境界不要恐惧，都是我。各种境界出现，你都可以给他传「如来藏」心法——佛来佛度，魔来魔度，任何天魔外道都不能奈你如何。</div><div class=\"text-indent\">这是佛在《法华经》所讲：我独无所畏——一个人独闯十法界无所畏惧，问题是你有没有明白「如来藏」的道理。因为受持《法华经》得诸佛护法，你心里是亮的；如果不是真心受持《法华经》，又当别论。有人念阿弥陀佛，说：「阿弥陀佛啊，你让我那个媳妇早点死吧，把她的寿命给我吧！」你这也叫念佛？是不是？发心一定要真实，这样你已经把自己保护起来了。你不要老想人我是非，想些阴暗的事情，否则你必然走火入魔，那魔鬼都处在黑暗中；心一定要亮堂，周边的环境再好再坏，我们也要把它看得很好很亮堂，只有自己救自己。那些把别人看得很阴暗的人，自己脸上鬼气都很重，阴气缭绕，这些人都不会长久的；你把别人想象的很坏，别人不会因为你想象坏他就坏，你自己倒是真变坏了，就是在《楞严经》讲的六交报。我们的心就是一面镜子，人来现人，鬼来现鬼，花来现花，癞蛤蟆来现癞蛤蟆，你的心里想什么东西他就现什么东西，就在你心里种下种子。</div><div class=\"text-indent\">所谓「戒禁取见」，这是对正知正见的一种偏见和执着。不是成佛之法，他认为是成佛之法；不是成佛的经典，他认为是成佛的经典；不是善知识，他认为是善知识。先说佛门内部的执着。</div><div class=\"text-indent\">讲经说法41年后，佛在临终前告诫修行人：只有《法华经》才是真净大法，《法华经》是「一切诸经之王」，唯有《法华经》讲的是了义之教。当然《法华经》包括《楞严经》，包括《阿弥陀经》。《阿弥陀经》专门讲「妙莲华」。《法华经》是概括说、肯定说；《楞严经》是分别说，肯定与否定共说；《阿弥陀经》是秘密说。可是修行人却把那些方便说当真，叫「戒禁取见」。</div><div class=\"text-indent\">修净土法门的同修，请着重把文殊菩萨对大势至菩萨的批判看明白60。文殊菩萨讲大势至菩萨念佛法门是以生灭心求不生不灭即生即灭之果，没有这个道理61。大势至菩萨通过念佛成就是由于他的特殊历史因缘，才能够成就。我们讲一个带有普遍性的成功的法门是对初上路的众生，刚修行的人必须用《法华经》《楞严经》之法才能成就。这是佛法的特别慈悲。修禅宗的法门在《楞严经》里讲的更多，什么琉璃光、虚空藏啊、月光童子啊、火头金刚啊，都是修禅宗的那种观照，统统被文殊菩萨一刀砍去。那些人修行成功也是有各种各样的特殊情况62。</div><div class=\"text-indent\">那优波离尊者讲自己如何持戒，文殊菩萨怎么样判定的？说这个法门对于初机众生来讲，不能现获圆通63。我能受五戒，我能受菩萨戒，我能受比丘尼戒，我能受比丘戒——越是感到自己能受戒的人情执越重，你不能成就的。这是我讲的还是文殊菩萨讲的？但是不能受小戒的人，你连人身都得不到；明白了大乘戒的人，会不会去破小乘戒呀？不会。</div><div class=\"text-indent\">当然，文殊菩萨对二十四圣圆通法门的评判，是对初机修行人而言。你认为自己是大根机的，这二十四圣法门随你去修。而且，这二十四位菩萨修行的法门全部是得到在世佛的亲自指点和加持。释迦牟尼已经灭度两千多年，当来下生弥勒佛还有五十六亿七千万年。这些菩萨大都是修了无量劫。我们有没有福报来生还能得人身，还能修行，各位掂量自己的根机和福报。用智慧来选择最佳的成就法门。《法华经》也讲，受持《法华经》即为见佛；《法华经》就是佛的全身舍利；《法华经》住世，就是正法住世。</div><div class=\"text-indent\">再来说外道的执着，典型的就是无益苦行。他认为捡垃圾，吃烂菜叶，啃烂泥巴，吃青草就能成佛；一丝不挂在山洞里修行，身上的毛长得这么长。当年米勒日巴尊者在山洞里修苦行，他妹妹送了一大堆衣服，等出关时衣服都烂掉了，身上的毛长出很长来，猎人把他抓起来打算宰了吃。尊者开口讲话，猎人才知道原委。</div><div class=\"text-indent\">有的外道修行，睡在烂石堆里，睡在玻璃碎片上，折磨自己；有的不穿衣服，把身体用灰呀、泥巴呀全部抹起来，把脸也抹起来，为什么啊？不露人相，露人相的话难为情呢！这叫涂灰外道；还有些呢，把两条腿吊起来，头朝下脚朝上，受这种苦行；还有些跪在那里，「你把我的头砍掉吧，求你把它砍掉」——这种外道知道这个肉团身不是自己，在这一点有智慧；可是这种修行的法门不能成就，而且是一种情执。这是「戒禁取见」。</div><div class=\"text-indent\">所谓「邪见」：前面四种是大类概括而言，那么剩下的一切统统包含在「邪见」当中。最典型的就是世间的俗话说。俗话说往往成为世人的一句口头禅，认为几千年以来大家都是这么认为的就都是对的；认为现在周边公认的就都是对的，在佛法里叫「同分妄见」。哪一位自告奋勇，举出一个俗话说？为什么讲这个俗话说就是邪知见？比如，「知人知面不知心」。用佛法来讲，知人知面你就知心，相由心生。「俗话说，人为财死，鸟为食亡」。这就是邪知见，人是为财死的吗？那你不为财会不会死啊？也会死。鸟为食亡，鸟不为食会不会亡啊？也会亡，是不是？那么人能为财死，能不能为佛死啊？所以死本身就没有死，是不是？这个法就解释到这里。</div><div class=\"text-indent\">这是讲到「见浊」，也叫「五利使」。「利」即快利之义，「使」即驱役之义，由于五见之妄惑，使得我们在六道里轮回。为什么讲「利」呢？因为这个世界观带有根本性的问题。它一旦转变就彻底转变，没有什么拖泥带水的，一变就变，也很利索。你站在这里就成佛。</div><div class=\"text-indent\">烦恼浊：在世间法里对应为「方法论」，它是「见思烦恼」的问题。它以五钝惑「贪、嗔、痴、慢、疑」为体。烦恼是无量啊，佛为方便教化，有说为一百零八种烦恼，有说为五结，有说为贪嗔痴三毒。实际上，根本烦恼就是一个「贪」字。你看这个贪字，上面一个今，下面一个贝，贝是不是金钱物质啊？时时盯着金钱物质利养为「贪」。</div><div class=\"text-indent\">就人道众生而言，可以说从离开娘胎出世第一天就开始贪。小孩儿落地哇地一声就哭，哭什么？就跟你要，就跟你讨，你把奶嘴往他嘴里一放，好了，嘴巴堵住了。你搞个什么铃铛摇一摇，耳朵听到好听了，开心了，欣赏了，是不是贪？一直到临死都在贪。贪什么啊？好死不如赖活着，活一天就是两个半天，是不是？不活白不活。有的人还贪死，死得快，为什么？哎呀，活得太烦恼了，太痛苦了，都是贪。那中间更不用讲，每天都在贪，今天贪明天，明天贪后天，要贪儿孙满堂，要贪钱财……</div><div class=\"text-indent\">就是由于这个贪呢，而生出无量烦恼习气。在六度波罗蜜中，第一就是「布施」，对治贪心。这个贪呢，是与鬼道的气氛相应。所以我们骂人：「你这个贪心鬼呀」，是不是？贪心包括名、闻、利、养各种享受。修行人到一定境界，物质财富可以放下；名，未必能放下。有些人不修还好，修行反倒修出名来了，修出贡高我慢来了，修出自以为是来了，修出嫉妒心来。有些人如果听了师父在赞叹哪一位讲经法师讲得好，他的心里像猫抓一样，你要明白呀！师父表扬哪一个，批评哪一个，都是逗机观教。「普贤十大愿王」有随喜功德啊。当表扬别人的时候，是不是使你的境界提升了？是不是给你增加了光明啊？当批评别人的时候，你是不是「有则改之，无则加勉」啊？要会用心啊！</div><div class=\"text-indent\">「嗔」是嗔恨心。常有一些人因为微不足道的小事耿耿于怀！对于修行人，天大的事情说过就过去了，是不是？即使大家见道了，仍然有烦恼习气会不知不觉地伤害一些人；而且未必就是他伤害，难道你不认为这是佛菩萨借他的嘴巴在成就你？为什么不能做这样观照？即使是他有意伤害你，他是谁？你是谁呀？</div><div class=\"text-indent\">所以我在处理这些问题的时候，从来不管谁是谁非。没有是、没有非，我只看你能不能把握住当下。当你来告诉我是非的时候，你就是是非人，你有什么道理呢？你一开口就是错的。张三、李四到我这里来，我都是左右开弓。张三呢，认为我就是偏袒李四；李四呢，认为我就是偏袒张三。这更是错上加错！有些人的心就是这么黑暗！就是这么阴暗！好好想一想，特别是出家众，要修自己的清净心啊！</div><div class=\"text-indent\">常不轻菩萨（比丘）是不是连比丘尼、优婆塞、优婆夷都礼拜呀64？把他（她）们都当成师父一样啊。有些人振振有词——你讲都是一个人，都是一个念，他讲无分别不妨分别。可会平班对口了，这也叫学大法？无分别不妨分别，别人都是妖魔鬼怪，都要一棍子打死，就你是个大菩萨？学大法不可以错用心态，无分别不妨分别是叫你要发慈悲心帮助他，不是叫你利用师父来惩罚他。</div><div class=\"text-indent\">分别法来讲，嗔心是大敌，专门破坏你的定力，往往修行几年、十几年乃至几十年的道行、功德，会因为你一念嗔恨心前功尽弃，叫做火烧功德林。修行人要培养温顺、冷静、沉着的心态，看你有没有定力。否则「一念嗔心起，百万障门开啊」！一念嗔恨心，你即已方寸大乱；不及时调整心态，你不知道要造多少业。世间法还有一说：一个人在五分钟之内不能使自己镇静下来，这个人一事无成。要好好作如是的观照。一个人的修行境界，周边环境、天龙八部、四众弟子有目共睹。你的功行怎么样？你的心态怎么样？从你的举止言谈、吃饭穿衣、走路处处都能表现出来，依报随着正报转。装模作样是徒劳的，这完全是一种自性流露。有些人明明知道自己没什么道行，也还是去装模作样。真可悲！这是个老老实实的学问，必须要把自己的心调整到非常柔软、平等的状态，来不得半点虚假。</div><div class=\"text-indent\">「痴」：即迷惑颠倒，不明事理，愚昧无知。它不仅包括那些低能儿、文盲、植物人，还包括那些所谓的聪明绝顶之人。因为他自以为是啊——我从小读书天分第一；我当官、经商足智多谋，我才华横溢……别人去念佛学佛他感到好笑，没有本事跑到这求泥巴，有什么用啊？在佛法里叫作「世智辩聪」，三途八难里属于第七难，这种人来世必下三恶道。因为他是一种情执啊，自以为是，把自己看得很重，是不是？重的东西是往下落还是往上飞？往下落，是不是？这叫「想升情坠」，在《楞严经》讲的，既有科学性又有哲理性。在佛法里讲，老实人得大利益，聪明人反被聪明误。佛法是平等的。这个世界上没有一个人能沾光，没有一个人会吃亏。当你沾沾自喜就是你吃亏的时候，你沾不了光的；当你吃亏而心安理得，生欢喜心，你是吃苦了苦。是非好坏全在于心态的调整。</div><div class=\"text-indent\">「慢」，就是贡高我慢，具体说来有七种：「慢、过慢、慢过慢、我慢、增上慢、卑劣慢、邪慢」。</div><div class=\"text-indent\">第一种叫「慢」：我们做一切的善事在某种究竟意义上讲，都是成就自己。所以天大的功德都不值得慢，你有什么好执着的？</div><div class=\"text-indent\">第二种叫「过慢」：张三也是十分功德，李四也是十分功德，张三非要在李四头上做人，非要占上风，叫过慢。</div><div class=\"text-indent\">第三种叫「慢过慢」：比如张三是十分功德，李四是十五分，张三还要在十五分头上做人，自己不如人家还要打肿脸充胖子，叫慢过慢，不服强者。</div><div class=\"text-indent\">第四种叫「我慢」：就是我执，执著一个我，这个我是本分的我，认为了不起，以自己为中心，就是我执。</div><div class=\"text-indent\">第五种叫「增上慢」：自己是十分功德非要看成是十五分功德、二十分功德，言过其实。</div><div class=\"text-indent\">第六种慢叫「卑劣慢」：前面四种慢多少都有点功德，他不过是过高地估计了自己，过低地估计了别人而已。这个卑劣慢呢，自己啥功德也没有，这是第一；自己也明明知道自己没有功德，这是第二；自己通过努力本来也可以成就一些功德，但是就是不愿意，这是第三。即使是这样，还要打肿脸充胖子自吹自擂，就不知道人间还有羞耻二字，这叫「卑劣慢」。这种人叫无聊，撒谎吹牛脸都不会发红的。他上午撒一个谎，下午你就可以检查他，他都不会心虚。</div><div class=\"text-indent\">第七种慢叫「邪慢」：这种人惹不起他你赶快躲，他根本不知道有是非好歹之事。有一个居士跟我讲，说：「师父啊，我那个弟弟啊，虐待辱骂亲生母亲的话我都不忍心提出来，我感到耻辱有这么个弟弟。」有些人连畜生都不如，不要说对外人，对自己的父母儿女都是以那种下劣的心、蛮横的行为、非常恶毒的语言对待，叫「邪慢」。</div><div class=\"text-indent\">「疑」：狐疑不信。有些人总是以自己的下劣心牛羊眼去妄加分别一切的好人好事。你做得再好，他认为你是装模做样，甚至是别有用心。你这种心很糟糕啊！《楞严经》讲，你眼睛看到别人做坏事你还要受报应，耳朵听到别人说坏话你要受报应，脑子里想到别人在做什么坏事，你都要受报应。我们这个心就是一面镜子。一朵花在镜子里显出来就是一朵花，一堆牛屎在镜子里显出来就是一堆牛屎。要用好这个心。只要有造作，无论是身口意业还是其他，不管是谁，善恶的种子已与阿赖耶识发生沟通，这个业种即已形成，在未来的时空点，只要机缘成熟，这个结果马上就变现出来。</div><div class=\"text-indent\">历史上有一个著名的公案。苏东坡是个口头禅，苏小妹则是个真正的明心见性之人，佛印禅师是愿身再来的菩萨。苏东坡当官以后，皇帝有赏赐与他，他洋洋得意，去见佛印禅师！佛印禅师说：「你这么庄严，真像一尊佛啊！」其实佛印禅师想考考苏东坡什么境界，因为佛印禅师长得黑不溜秋的，他前世可能只修了智慧，没有修人天福报，说：「你看我像什么啊？」苏东坡说：「哎呀，我不敢讲。」佛印禅师说：「没有关系的，像什么就说什么。」苏东坡说：「那就恕我直言了，我看你像一堆牛屎。」苏东坡也感到这句话不太好，回去跟苏小妹讲了。妹妹讲了：「对嘛，佛印禅师嘴巴里出来一尊佛，哥哥你嘴巴里出来一堆牛屎！」这是不是明心见性呐？你讲人家是牛屎，你心里就是牛屎。</div><div class=\"text-indent\">这个法妙啊！修行人把别人看得慈悲善良，别人不会因为你把他看好就变好，而你已经变好了。你把他人看得怎么坏，想得怎么坏，说得怎么坏，别人不会因为你说坏他就坏了，而你自己的心确确实实已经变坏了，而且必受果报。佛在《无量寿经》怎么讲啊？要善护意业，善护口业，善护身业，要护好我们的三业。你把一切的人事法只管往好处想，在普贤十大愿王叫什么啊？随喜功德。你可不要去随喜人家过错。随喜人家过错是用别人的错误来惩罚自己，你这有智慧吗？何况人家不一定就是错。你怎么知道人家心里怎么想啊？不要自作聪明。</div><div class=\"text-indent\">春秋战国时期的哲学家庄子，有一次和朋友在桥上看水里的鱼，庄子讲这个鱼真快乐，那个人就问庄子：「你不是鱼，你怎么知道鱼快乐啊？」庄子反过来问：「你不是我，你怎么知道我就不知道鱼快乐？」凡夫的习气总是好自作聪明，自以为是，即使你证到二十八层天的智慧，即使你证到阿罗汉辟支佛的智慧，你都不能观照猜测菩萨的智慧。天人都有五种神通，阿罗汉、辟支佛有六种神通啊，他们的天眼其实是「肉眼」65，因为阿罗汉、辟支佛连自己的四肢头目是什么东西都不知道。可是大乘菩萨知道，所以大乘人肉眼当下即是佛眼。它不是讲「天眼」，也不是讲「法眼」，也不是讲「慧眼」，当下即是「佛眼」。</div><div class=\"text-indent\">只要明白「如来藏」，你当下就是「佛眼」。你知道这个四肢耳目是什么东西，知道泥巴瓦块是什么东西。阿罗汉认为泥巴瓦块就是泥巴瓦块，可是你知道泥巴瓦块就是我，就是佛。这可不是口头禅，你必须刻骨铭心地明白为什么泥巴瓦块就是我。你对一个修行人讲：「你真庄严啊！你真像佛啊！」「啊，谢谢谢谢……」；你要讲「你怎么像一个乌龟王八蛋呐？」他要跟你拼命，「你才是乌龟王八蛋呢！」，是不是？乌龟王八蛋是不是我们呐？当然佛法不坏世间法，你可不要看到些同修或者看到些朋友：「哎呀，你真是一堆牛屎啊！」这样人家要生烦恼。</div><div class=\"text-indent\">这是「烦恼浊」的五个内容，也叫「五结」，也叫「五钝使」。「烦恼浊」障碍我们涅槃，「见浊」是障碍我们证菩提，功用不一样。怎么讲是「钝使」呢？我们认识烦恼很容易，一听就明白，有的人不听就已经明白了一半，跟转变世界观不一样。对烦恼的知见一听就明白，但是改正很难，叫「钝使」。因为他这个习气太重啊！即使坏人做坏事的时候，他知道自己做坏事啊，所以就偷偷摸摸地做。所以烦恼好懂，难改。破了「见浊」以后，当下就是明心见性的大菩萨，你了生脱死，永远不在三恶道轮回，但习气很难改。想成究竟圆满之佛，我们还要认真对待。</div><div class=\"text-indent\">众生浊：五蕴见慢为其体，秽名恶称是其相。在《心经》讲到「色受想行识」这「五蕴」。我们这个身体的四大就是「色蕴」。</div><div class=\"text-indent\">「见」是「横计主宰」，为「见我」。所谓「横计主宰」，我们在今生今世这个时空点，由于社会环境、人事环境、自然环境而形成的具有种种的特征的众生的形相，或者形成的种种的众生习气，这个特征主要是世界观、人生观的问题。</div><div class=\"text-indent\">「慢」是「俱生主宰」，为「慢我」。所谓「俱生主宰」，当下这个我从无始以来无量的种种习气特征走到现在这个我。佛讲，众生所造之业如果有形有相，那尽虚空遍法界不能容纳。我们还以为自己是现代人，有没有哪一个不是古人啊？从唐朝到现在，从秦朝到现在，从盘古开天辟地到现在，这里有没有少哪一位啊？有没有哪一个离开了这漫长的历史啊？这无尽的历史我们谁都没有缺席啊！谁都没有缺课啊！唐朝的时候我是张三，清朝的时候是李四，三皇五帝的时候是天上的杨三郎，这个过去是不是也叫「俱生主宰」呀？那么我们再想一想，唐朝的泥巴瓦块、唐朝的李白、杜甫、李世民是不是我啊？所以把这个俱生主宰又扩大它的层次来观照。要明白啊，一切的万法都共同一个阿赖耶识，这个阿赖耶识里有无量的业识种子，无量的第七识见分，每一个第七识见分都可以从中汲取各种各样的气氛来成就自己一生一世的业报。</div><div class=\"text-indent\">大家看这个气球手套。阿弥陀佛、观世音菩萨、释迦牟尼佛都在这里（手套的空心），牛魔王、白骨精、孙悟空也在这里，泥巴瓦块、树木花草这些东西还在这里。所以作为一个明心见性之人，根据自己的心量大小，都是从这里来吸取功德。如果全部吸取了，你就是极果如来。虽然我们现在没有成佛，但是这些东西是不是我啊？所以，过去现在未来，十方法界一切万法都是一个我，叫「俱生主宰」。不管你在佛、在天、在人、在鬼、在畜、还是在泥巴瓦块，你都是一个「俱生主宰」，没有哪一法不是你。</div><div class=\"text-indent\">那「五蕴见慢是其体」，是「实体法」。「秽名恶称是其相」，是「假名法」。众生众生，上至诸佛菩萨，下至天人鬼畜，旁及一切的无情万法，都叫「秽名恶称」，这就是破相。一切的名相都是假立。天啊、人啊、鬼啊、畜生啊，假立了以后，我们却当真。假设我们一开始把人叫成猪，把猪叫成人，我怕现在我讲你是个人，你就生烦恼了，是不是啊？一切的名相不要当真，都是说说而已，都是一个人一个念变化而已，没有什么真实可言，它是符号而已。</div><div class=\"text-indent\">那么怎么样又叫「秽名恶称是其相」呢？没有哪一法是清净单纯的。一尊佛现相也好，一尊菩萨现相也好，天人鬼畜现相也好，泥巴瓦块现相也好，风云雨雾现相也好，它都是由无量无量的元素大杂烩而成。想想看，如果我们无量劫以来的大小便以及人死以后的尸体都聚集在这里的话，我怕这里都没有空间了，人都在这个牛屎里滚，在人尸体里面爬。是不是啊？那现在那些屎啊、尿啊、白骨到哪里去啦？是不是阿弥陀佛派飞船火箭来装走啦？装到极乐世界去卖钱去啦？那到哪里去啦？我告诉你们，你们可不要恶心。这都在我们的身体上，都在我们的肚子里，都在空间万法里里外外。哪有一个干净的？你穿西装革履，昂首挺胸，所以看不起那些拉板车的，拖大粪的，你何苦来哉啊？所有的人、所有的菩萨都是一个东西，都是一样的，叫「秽名恶称是其相」。</div><div class=\"text-indent\">当你知道秽名恶称垃圾堆又成了宝了，是我们成佛的法器，它就是如意宝珠。讲秽名恶称也好，讲庄严殊胜也好，都是我们的「同分妄见」。没有善恶之别，没有好坏之分，一切的一切都是我们的如意宝珠，都是宝啊！我们看到是牛屎狗粪，鬼道的众生看着是美味佳肴；我们看到是烂泥巴地，极乐世界的菩萨看着是黄金。心态调整得好，你当下就在极乐世界，充满着快乐、光明；心态不好的人念念都是地狱，都是痛苦。</div><div class=\"text-indent\">祖师大德是怎么破我执呀？临济祖师用嘴巴到垃圾堆里去咬烂菜叶，人家讲：「哎呀，你看那个和尚就像一匹马呀！」他怎么样呢？「咴……」他学马叫。你要讲他像牛呢，他就「哞……」可是有些人你要说他是马：「我是马，你是什么东西啊？」这就是「众生浊」啊，你被名相迷惑了。世间的一句骂人话：「你这个杂种」，这都是「秽名恶称」，都是假的；万法就是一个念，名相都是恒顺世间法造出来的。</div><div class=\"text-indent\">需要强调的一点是，「众生浊」包含十法界无量的众生。无量的众生都是由「五蕴见慢」这七个内容组成。其实详细说来是有无量的万法组成，一切的众生相互之间都是次第圆融。所谓次第圆融，天、人、鬼、畜、树、木、花、草等无量的假名千差万别，这叫「次第」；所谓「圆融」，无量的万法，每一个法都具足其它一切万法共同之本性——一尊佛、一尊菩萨、一片天、一个人、一头牛、一条狗、一只蚂蚁、一个太阳、一个月亮、一个地球、一滴水、一片风，这无量的万法没有哪一法缺少哪一法，这叫「圆融」。都有共同的本性，而且都有受想行识这种见闻觉知的灵知性和这种般若，一粒微尘、一根草树，法尔如是。尽足为一真法界。</div><div class=\"text-indent\">命浊：古德说为，「色心连持是其体，催年减寿是其相」。所谓「色心连持」就是讲「五蕴」。「色」就是地水火风四大，这是无情物。皮肉筋骨是地大；血液、口水、汗水、眼泪就是水大；体温就是火大；呼吸、动作、爪生发长就是风大。「心」就是受、想、行、识。本来十法界万法只是一个心，只是一个念，佛为了恒顺众生的习气，硬是把一个心说成两个法——「心」和「色」，乃至把心又说为无量的心，把色又说为无量法，这都是方便说。</div><div class=\"text-indent\">那开示这个「命浊」呢，我们从「心」和「色」这两个法展开来讲：也就是说我们的这个命怎么样形成？它是从何而来？这就需要破除我们的种种邪知邪见。可以说对于百分之九十九的人，回答很简单：「命怎么来的？父母给的呗！」。那你再问他：「那你父母的命从哪儿来的？」「是父母的父母的父母给的呗！」。是他给的吗？那父母没有给之前，你在不在呀？</div><div class=\"text-indent\">我上次看了一个资料，说哪个国家的科学家已经证实是「先有鸡，后有蛋」；但在我们看来，先有鸡，后有蛋，对不对呀？先有蛋，后有鸡，对不对呀？那么鸡和蛋同时有，对不对呀？都对。明白了「如来藏」的道理，怎么讲怎么对，怎么想怎么圆。那到底生命当初从何而有？《楞严经》讲了，法尔如是。在我们的真心本来面目无形无相的「空如来藏」之中本来就存在这一切，它既可以突变、巨变，也可以渐变、小变，只要我们愿意。一念可以爆发出十法界无量诸佛、无量菩萨、无量天人鬼畜、山河大地，也可以一个念依次变现为一个单细胞、多细胞、小动物、中等动物、大动物，最后再变人；也可以一年变，也可以一万年变，也可以一百万亿亿年变。等你将来成为圆满佛，这种功能自然恢复，不需要创造发明，我们本来就有。在这里我先讲这个巨变、突变。</div><div class=\"text-indent\">想一想啊：你在做梦的时候，正好要方便了，当下就会出现厕所，或者看见一个马桶。我们在梦中想到什么它就显现什么，是不是？梦中你想到老爸老妈，他们是不是就现出来了？不要真认为是梦啊——一真一切真，梦中的变化是不是真的？都是真的啊。那你在梦中能够千变万化，在醒来的时候却不能，为什么？因为我们在清醒的状态下眼睛要往外看，耳朵要往外听，他要想种种的人我是非，是不是烦恼习气很重？而做梦时六根停止攀缘，就剩下一个梦中独头意识，这时心比较清净；所以你能千变万化，自在无碍。</div><div class=\"text-indent\">我们的心不可思议啊！你能静下心来打三分钟的妄想，手指长出这么多；如果打三年的妄想，打一百年的妄想，你可能手从这里伸到北京火车站买火车票都没关系，是不是？这是真的。天人可以一念就直冲云霄，也可以一念又小得跟小老鼠一样。</div><div class=\"text-indent\">佛讲这个命怎么来的呢？叫作「色杂妄想，想相为身」，「色杂妄想」是不是「色心连持为体」呀？同时更加具体地描述这地水火风四大是无情物，并且又把它说为「浮尘」，在「浮尘」之前还有「胜义尘」，就是殊胜意义上的尘法，是色声香味这四种——微妙的胜义尘肉眼看不到，天眼能看到，现在高级的电子仪器也能看到，但是它仍然是无情。这个无情是恒顺世间人的习气说的，其实它就是我们的心。我们真心中有无量的妄想，这个妄想我们把它说为第七识，叫「末那识」。注意：一滴水、一粒微尘，只要有形有相的东西都属于无情的色尘；那么这个末那识与这无情的色尘搅合在一起，这个时候就形成「命」。</div><div class=\"text-indent\">本来第七识上天入地无所障碍，是不是？你看那个好好的一个苹果、一粒黄豆、一粒蚕豆里面，往往看到小虫子；这些虫子是由它的灵体进到豆子里面的时候而形成肉体，它有没有障碍呀？要不要给它开门哪？不要。那就是生命体啊。就利用苹果里的那么点汁水，是不是四大呀？谷子里的那么点东西是不是四大呀？叫「揽尘为体」。苹果、谷子的四大是无情啊，那么有情的这个念进去以后就会跟它发生作用，怎么发生作用呢？就跟人睡觉一样，催他醒啊，醒啊，就跟他发生作用，反反复复，使这个无情的色法产生了知觉。你真用针戳一下他，他「哦」痛起来了。</div><div class=\"text-indent\">由于这个念对无情的色法反复地作用，使他形成了那种生命的假相；同时呢，这个无情的色尘对我们这个心发生的反作用，又障碍了心的那种自在无碍。怎么障碍呢？本来这一念心上天入地，无所障碍；看也好，听也好，吃也好，这一念统统地具足这种功德；但是由于无情的皮肉筋骨这种障碍以后，使我们的这个心分化了。在《楞严经》叫作「一精之明化为六和合」，一个念变成六种用——眼睛能看不能听；耳朵能听不能吃饭；嘴巴能讲话不能走路……这叫「六尘壅塞」。「壅」，就跟泥巴一样把它堵塞起来了，使这个一精之明在用中不能相互取代，但是可以相互配合。所以这个「色心连持为体」，是无情的物质忽然得到了升华，无知变为有知，使我们这个有情的真心等级降低，是不是有升有降啊？</div><div class=\"text-indent\">修行的目的就是使我们的这个心从色尘障碍中解脱出来，从妄想分别中解脱出来；在解脱的同时，又能与整个的有情无情一切万法融为一个本体。怎么个「命浊」啊？我的真命是无量寿，自在无碍，由于妄想心把心和色分别执着为有情和无情，把这一念与无量的念分别执着为你、我、他，从此自私其小，自己障碍自己。《楞严经》把众生一切的行为说为「自心取自心」。你吃饭喝水，饭和水是什么东西啊？就是你自己，就是你的心。你就是去供养父母也好，你去诈骗他人也好，那他人、父母是不是你自己呀？你去打工挣钱，打的那个工，挣的那个钱是不是还是你自己呀？有什么好执着呀？诸佛当下证得万法皆是一个自己。我们现在过得是不是很艰苦啊？由小到大多灾、多难、多病，到最后老态龙钟；若在畜生道里，那苦不堪言，更不用说鬼道、地狱道——都是自己捉弄自己。这就是「命浊」。</div><div class=\"text-indent\">从根本上来讲，同是我们一个真心、一个真念，在众生位迷惑颠倒的时候，就被「眼耳鼻舌身意」这六根，被「色声香味触法」这六尘所束缚；被我们的眼识、耳识、鼻识……这六种意识心所纠缠——身苦心劳，而不能出离。因此佛在《楞严经》讲这个「五浊」，是从根本上来开示宇宙人生本来面目。</div><div class=\"text-indent\">再来看「催年减寿是其相」。我经常讲，从古至今的秦朝人、汉朝人、唐朝人、宋朝人……我们有没有哪一个不是啊？大通智胜佛时代的人，威音王佛时代的人，我们这儿有没有啊？统统都是。每一个人都是无量寿，从无始到现在，现在再到未来，仍然都是无始。可是我们现在执着这一期虚妄的生命，被这个妄念所烦恼，叫「摧年减寿」。讲这个法首先涉及到三世因果报应：我们今生今世应该得到的寿命是前世修来，不是靠你今生今世怎么样会吃，怎么样会喝，怎么样会保养，不是的。会吃、会喝、会保养可以使你生活得自在一点，健康一点，倒是真的，但是增加不了你的寿命。那什么叫「催年减寿」呢？比如说你修得这一世的寿命是一百岁，你进入娘胎起第一天，你就是一百岁减一天，出娘胎的时候你就成了九十九岁零两个月，到八十岁的时候你就剩了二十年，是不是？一直在倒计时。</div><div class=\"text-indent\">世间人是迷惑颠倒啊！他不知道一步一步走向死亡，不知道抓紧这有限的时间来用功了生死，死到临头了还在造业——修行人尤其要对这个问题进行认真地观照。前不久一位叫马伟的小男孩，二十一岁，到河南郑州旅游，中午睡了个觉，人就没有了。医生说是突发性心脏病，他的父母都讲小孩子从来没有病。人命无常啊！现在都搞反了：什么七十大寿、八十大寿，一过大寿全家在一起，亲朋好友在一起吃喝玩乐，大量地杀生，是不是？而且搞得欢天喜地——你怎么欢喜得起来呀？那位马季跟唐杰忠说相声，讲人命无常讲得很滑稽的：一个讲我是一年不如一年啊；一个讲我是半年不如半年啊；一个讲我是一个月不如一个月啊；一个讲我是半个月不如半个月啊；一个讲一天不如一天；一个讲我半天不如半天……「我是一时不如一时！」，「我是一分不如一分啊！」，「我是一秒不如一秒啊！」。突然有一个不吭声了，「你怎么不吭声了？」「我死了。」</div><div class=\"text-indent\">真正有智慧的人，要懂得抓住当下。中国有句古话：朝闻道，夕死可矣。你早上明白了宇宙人生的真理，到下午死，值得！其实我们应该说为：即闻道，即死可矣，是不是？你现在得道，现在死都值得！死是假的，我就瞪着眼睛看这一口气断了以后下一口气是怎么回事，就跟小孩盼着过年一样，是不是？没有死啊！你是从一个世界走向另一个世界。许多人不来听经闻法呀，他事情多得很，讲起理由来，头头是道，条条在理；等无常到来的时候无条件服从，到那个时候老老实实的，一点都不敢调皮捣蛋。</div><div class=\"text-indent\">要醒悟啊！这个世界上了生脱死最重要。有些人一离开道场就退转，很危险。我经常讲：你只要来了，就会当下感觉到过去的一切重重顾虑都是多余的，都不重要，没有什么了不起，天塌下来都没有什么了不起，是不是啊？了生脱死最重要，你要抓住当下。你不能在这里听经感慨万分，一离开道场，那名闻利养、贪嗔痴慢，统统都来了，马上就一反常态，这叫没有智慧。明白这个道理要时时、事事、处处，念念在道，历事炼心。不能自己对不起自己呀！</div><div class=\"text-indent\">这个「五浊」就是讲万法的来龙去脉，「五浊」的根本在于「劫浊」。懂得了「五浊」，你开大智慧。</div><div class=\"text-indent\"><strong>舍利子。色不异空。空不异色。色即是空。空即是色。受想行识。亦复如是。</strong></div><div class=\"text-indent\"><strong></strong></div><div class=\"text-indent\"><strong>舍利子</strong>：是对舍利弗的尊称。舍利是印度的一种鸟，在中国也有，叫秋鹭鸟，它们的两只眼睛特别明亮，像秋天的露水一样。舍利弗的母亲长得很庄严，两只眼睛很亮，非常有智慧，所以取名叫舍利；生下舍利弗，跟她一样聪明，也就是叫舍利子。</div><div class=\"text-indent\"><strong>色不异空，空不异色。色即是空，空即是色：</strong>这四句话非同小可！几乎所有的修行人都会背诵《心经》，其中，这四句是个口头禅。这四句话就是讲「如是我闻」；就是讲「阿弥陀佛」；就是讲「性相一如、理事不二」；就是讲三个「如来藏」。那么就这四句话，我们对照到通常讲的藏、通、别、圆这四教门来作一个比较。</div><div class=\"text-indent\">藏教菩萨从有门而入，执事昧理，执相昧性——他只见色，不见空。这个「色」，注意，概述为一切的万法，包括后面的受想行识——受想行识是不是有动相啊？有分别相、思维相都可以概括。这里的「空」，是指「空如来藏」，是阿弥陀佛的「阿」，是我们的真心本性——不可以把它说为虚空，虚空是色法。藏教菩萨执着念佛、拜佛、行善、断恶，在有形有相的万法上执着。修得好能得人天福报，修得非常非常非常非常非常好，他也能超越六道轮回，但是不能明心见性66。</div><div class=\"text-indent\">通教菩萨是离色见空性，他是执性昧相，执理昧事。他只是执着一个「阿」，他要破「弥陀」，连藏教菩萨修的三十二相、八十种随形好等一切的善法他都要统统破除，他是灭相见性。但是通教比藏教有进步，藏教菩萨连空都不懂，压根没有空的概念。</div><div class=\"text-indent\">那么到了别教呢，他虽然也承认空，也承认色，他是从「亦空亦有」二门而入，有次第性：在空才能见到空，在色才能体会到色。弥勒菩萨在《楞严经》讲：「识性流出无量如来」。他强调另外有个识性造就出无量的佛来，但是没有讲：无量的佛就是一尊佛，无量的佛没有哪一尊佛不是哪一尊佛。他没有讲识性即是无量佛，所以带有次第性。</div><div class=\"text-indent\">那么按照圆教来讲，是从「非空非有」这二门而入。他是对空说非空，对有说非有；换一种说法：「色即是空，空即是色，即空即色」。而且当下一就是无量，无量就是一，一就是二，二就是八，八就是九。这才是真正的「色不异空，空不异色。色即是空，空即是色」。</div><div class=\"text-indent\">下面通过打比方来说明这四句话，还是拿手好戏。比如说：手掌的五个指头表无量万法，这无量万法的佛、菩萨、天人鬼畜、牛马猪羊、风云雨雾都在，无量的行持、说法、善呀、美呀、真呀，都包括在内。</div><div class=\"text-indent\">那么藏教菩萨在这有形有相的万法里执着，他行善断恶，也叫佛，但他不知道手掌当下就是拳头。</div><div class=\"text-indent\">那么通教菩萨他眼见手掌，心里呢，似乎悟到那个拳头，但悟的不真实，他知道一切的万法都是一个真心变现出来的，但怎么样变他不懂。通教认为：掌不是拳，拳不是掌，色不是空，空不是色。他灭相见空性，认为这是大解脱。</div><div class=\"text-indent\">那么别教呢，掌是我，拳也是我；色是我，空也是我。同时他最大的问题，就是认为每一个人都能成为一尊佛。</div><div class=\"text-indent\">那就这个拳头大法而言，圆教则是看手掌当下就是拳头——即掌即拳，即色即空。看这里一个指头，当下是不是拳头啊？看三个指头，当下是不是拳头啊？那么这里的一当下是不是这里的三呐？都是一个本体。所以圆教呢，是在相即是见性，在一相即是无量相，在二相即是八相，在九相即是一万相，没有哪一相不是哪一相。</div><div class=\"text-indent\">通教要破除一切的相——这一切的相本来就是我，它给漏掉了67，他能成佛吗？所以他修得非常非常好，非常非常认真，只能破除一分灭相无明见空性；别教要经三大阿僧祇劫，再经过无量劫才能成就，就是因为他有个我执——我要成佛——虽然成佛以后要度化一切众生，但他认为每一个人都成一尊佛，这就对自己造成巨大的障碍。所以他超不出十二分法性身！而且修得很苦。</div><div class=\"text-indent\">圆教非常妙，听经闻法就明白一切的万法都是我；他不需要灭相见性，他在相就见性，无相也是我，有相也是我。只要把这个我执破除掉，刻骨铭心深信不疑，他就是一步登天。在《楞严经》讲啊：「决定成佛，譬如以尘扬于顺风，有何艰险？」「何藉劬劳，肯綮修证？」越是真理越简单，越是成佛越容易，只问你信不信。圆顿大法只愁悟不愁证68，诸佛菩萨祖师大德都是这样教化。所以「色不异空，空不异色。色即是空，空即是色」，是告诉我们：你还修吗？一念信解，蒙佛授记，你当下就是佛啊！你当下就承认呐！你即是佛，佛即是你呀，只要你相信！那么有些同修讲：「我就是相信啊，那我为什么现在不能千变万化呀？我现在还有烦恼习气呀。」这是我们普遍存在的疑惑，是不是？</div><div class=\"text-indent\">我们现在难就难在还有这个肉团身无明壳，在佛法里叫定业。即使你没有明白，你也成佛了，为什么？你里面还有一个心，知道吗？它已经明白了。在《法华经·弘传序》讲「俱崇密化之迹」，为什么？你里面那第七识心已经瞒天过海，瞒着你眼、耳、鼻、舌、身、意这六种意识心之天，而过生死之海。这是佛在《地藏经》讲——「闻在本识」。本识本识，就是我们第七识、第八识，它是一个识。</div><div class=\"text-indent\">我们现在为什么得不到妙用呢？就是因为肉团身这个无明壳束缚我们，眼耳鼻舌身意这六种妄想心在障碍我们，在调虎离山；可是我们里面那个真心，它能不能调动啊？调动不了。只要我们明白这个道理以后，一旦中阴现前，肉团身这个无明壳解体，眼耳鼻舌这六种妄想心销亡，唯一的第七识当下做主；他这个时候呢，会把我们在有生之年听闻「如来藏」道理时所证得的一切功德现量现前，是走这个过程。佛为什么给法华会上的菩萨授记呀？因为他是过来人，他知道你在肉团身的时候即已当下成佛。</div><div class=\"text-indent\">比如说一个很坏很坏的坏人，他对电路非常精通，跑到配电房去操作，他会不会触电啊？不会。因为他明心见性了。虽然他很坏，他能带业往生，是不是这个道理呀？一个人即使是劳动模范、三八红旗手、学雷锋标兵，但是他对电路不通，你叫他到配电房，是不是送死啊？圆顿大法还有一条，你在见道位见到的真如本性与在证道位证到的真如本性无二无别。</div><div class=\"text-indent\">再比如：你在黑夜里前方一百步的地方看见一盏灯，你会不会又屁股转过来往黑暗的地方跑啊？不会。所以见道就等于晚上见到灯，见到了灯你是不是进入了亮光了？进入亮光就是进入佛土，你永远不落六道轮回；那你继续往前走，走了一百步的时候拿到灯了，成佛了，拿到的灯是不是就是见到的灯啊？有没有区别啊？</div><div class=\"text-indent\">这个藏教、通教、别教，他讲解行并重，因为他见到的这个解跟我们这个解不一样，怎么不一样呢？我们是面对灯见到灯光，既见灯，也见光；通教菩萨是背对灯见到灯光，所以他那里仍然是摸索，不知道摸索了多少个无量劫，也许能够明心见性。那么别教菩萨比通教菩萨又好一些，他可能不是背对着灯，他可能是这样（耳朵对着灯），这他也看不到灯，是不是？解行并重是前七种方便，圆顿大法不存在解行并重，而是见道成佛（当然这是指分真即佛。成圆满极果如来还要修证）！</div><div class=\"text-indent\">圆顿大法就是圆顿大法，不是说说而已，它是真实。所以我重点从「为什么见道当下成佛」来解答这个问题，要我们心里刻骨铭心，深信不疑。要好好观照啊！听经要好好认真，但是有些人听经太认真了也不好，他心绷得太紧了，是不是啊？有些人甚至懈怠开小差；有的带逆反心理，这个不一样。我经常劝导听经太认真的同修，心要放开，听经的时候你不要记录，要根据各人不同的情况。这是我们在讲到这个「色不异空、空不异色……」这四句话，仁者见仁，智者见智，大者见大，小者见小啊！所以这个色空，空是不是「如」啊？色是不是「是」啊？所以，「是即是如，如即是是；是不异如，如不异是。阿即是弥陀，弥陀即是阿；阿不异弥陀，弥陀不异阿」。</div><div class=\"text-indent\"><strong>受想行识，亦复如是：</strong>「受想行识」其实统统可以归纳为「色法」，佛为了能更好地开启众生的智慧，仍然把「受想行识」进行特别地分说。道理也是一样，因为我们前面在讲「如是我闻」的时候，涉及的是不是就是「色不异空，空不异色」啊？那「受想行识，亦复如是」，如果打官腔的话：「受不异空，空不异受；受即是空，空即是受」，是不是？「想不异空，空不异想……识即是空，空即是识」，这个很简单。</div><div class=\"text-indent\">比如说我抱的这个茶杯有温暖的感觉，这是不是「受」啊？那温暖的这个感觉在没有受的时候在不在？在。有没有形相啊？没有。是不是空啊？那是不是「受不异空，空不异受」啊？他虽然没有受的感觉，这个受在不在啊？所以「受即是空，空即是受」，大家明白吗？是不是很简单呐？</div><div class=\"text-indent\">再讲「想」，想就是分别，你看了这个灯光：「咦，这个灯光怎么这么亮啊」？这是不是「想」啊？那你没有想这个灯光怎么这么亮的时候，这个「想」在不在啊？一定在。遇到这个境界的时候——这个灯怎么这么亮？一想马上就现前了，是不是？是不是「空不异想，想不异空」啊？</div><div class=\"text-indent\">再讲「行」，行是搬运功夫，把前面想的东西储存到后面的阿赖耶识里去。当我们眼见灯光，想到「灯光怎么这么亮」的时候，然后耳朵听到声音了，又想「声音怎么这么响」的时候，「灯光怎么这么亮」的这个意识心是不是就没有了？没有了，到哪里去了？到阿赖耶识里去了，怎么去的？是不是「受想行识」的「行」把它搬进去的？这是不是搬运工啊？那当它没有搬运的时候，这种搬运工在不在啊？不在的话，它怎么也运不进去，是不是「行不异空，空不异行」啊？</div><div class=\"text-indent\">那再看，到了我们阿赖耶识里——阿赖耶识是我们的种子仓库——当「这个灯怎么这么亮」这个意识心储存到阿赖耶识仓库之前，这个阿赖耶识，这个种子仓库，在不在啊？也在我们心里。是不是「识不异空，空不异识」啊？</div><div class=\"text-indent\">作如此的观照，是不是感觉到心量扩大了？佛讲一切法都是在给我们调心，调到最佳质量，最佳数量，是不是？这是不是灌顶？你可不要找那些歪门邪道用手摸来摸去地「灌顶」，还给钱呢！现在五花八门歪门邪道很多啊！</div><div class=\"text-indent\"><strong>舍利子。是诸法空相。不生不灭。不垢不净。不增不减。</strong></div><div class=\"text-indent\"><strong>是诸法空相：</strong>解释为「是诸法阿弥陀，是诸法如是，是诸法理事」，行不行啊？同样这句话，禅宗讲——一切法都是空的啊！除了真心之外其它都是假的啊！所以许多人执空不归呀！执空不返呐！修得好也就是恒河沙数的人可能有一个人经过无量劫的修行，他能破除一分灭相无明；修得不好，百分之九十九点九九九九的人都是些虚空神，虚空神也就是四空天，福报很大；修得不好就落三恶道里。</div><div class=\"text-indent\">按照圆顿大法来解释这个「是诸法空相」：「空」就是「心」，「相」就是「色」；「空相」就是「空不异相，相不异空」，这个「相」包括「色受想行识」。「空」就是「阿」，「相」就是「弥陀」；「空」就是「理」，「相」就是「事」；「空」就是「性」，「相」就是「相」。这么一讲，是不是就觉得这个《心经》太简单了？佛法本来就简单啊！是我们的迷惑颠倒把它搞得很复杂呀！越是真理越简单，简单得就是一句话，就是一个字，就是一个点、一片风、一滴雨。你把这支笔搞明白是什么东西，把这个茶杯盖搞明白是什么东西，你成就了。</div><div class=\"text-indent\">还要明白，今天传的这个法，不是我自创的，这都是诸佛金口玉言——但我的功德，是在「为什么」上用功夫。《心经》《楞严经》有几个人能讲清楚啊？佛法也是与时并进，后人一定会超过我们。佛法只能一代更比一代强，佛才高兴！你非要讲后人一定不如前人，那佛法只有走向灭亡。你意识到此，就要敢于承担。我们就是比前人强，就是比前人会讲经，就是比前人会修行。其实啊，真正来讲，我们就是现在成佛，佛都嫌晚了，我们哪能跟老古佛比？话说过去还得说回来，目的就是让我们对于现在的老师、现在的讲法生起信心。可不能错用了心啊。</div><div class=\"text-indent\"><strong>不生不灭，不垢不净，不增不减：</strong>其实呢，无量万法是不是一个念呢？一个念它生了没有啊？它还是一个念在原地踏步，注意啊！看这个拳头，拳头变成锤子，再变成剪子，再变成扫把，锤子生了没有？拳头灭了没有啊？锤子当下就是拳头。那锤子再变成剪子，剪子生了没有？锤子灭了没有？变来变去都是一个东西。生和灭都是我们自在变现。梦中梦到一大堆人啊、事啊，梦醒了以后，梦中那些人死了没有啊？正做梦时候的那些人生了没有啊？是不是都是你自己啊？所以佛法教育的目的是要我们赶快从梦中醒来。我们无始以来的生生世世，一会做人，一会做天，一会做牛做马，一会做乌龟王八，一会做泥巴瓦块，一会是风，一会是雨；看起来生了那么多次，死了那么多次，实际上我们生了没有，死了没有啊？是不是还是一个东西在这里啊？我们再到未来还会千变万化。</div><div class=\"text-indent\">「不垢不净」，这里更有意思！这个水，人喝是甘露，天人看是一块石头；鬼呢，看到一团火；还有的鬼看到是脓血大便。那么这杯水到底是什么东西呀？它什么也不是，什么也是。就看你心怎么执着。</div><div class=\"text-indent\">2005年我到阳曲县传法，有位老居士跟我说：「师父啊，有一天晚上我划道道念阿弥陀佛，划到九点多，老婆回来说：「黑咕隆咚你在干什么啊？」把我吓了一跳，当下我什么也看不到了，在这之前看得很清楚啊。69」所以讲「不垢不净」是不是讲不白不黑呀？有没有白天和黑夜呀？没有啊！都是我们的同分妄见。</div><div class=\"text-indent\">鸠摩罗什大师七岁的时候，随母亲到庙里拜佛，他把千斤宝鼎举在手里，其他人吓了一跳：「哎呀！这个小孩力气怎么这么大呀？千斤宝鼎我们十个人都举不起来呀！」他听到重量的概念以后，宝鼎落地，再推，纹丝不动。一念前后判若天地，是不是叫不轻不重啊？所以全在我们用心。</div><div class=\"text-indent\">那么月光童子修水观，这肉团身是不是一团水呀？琉璃光法王子修风观，这个肉团身是不是一股风啊？所以我们这个人是不是不肉不皮不骨啊？哪有什么东西啊？你执着它是什么，它就是什么。当我们明白这个道理，放下我执，放下一切烦恼习气，你就证得诸佛如来无量色身三昧。无量色身三昧，你可以现空现有，现大现小，现多现少，随心所欲。</div><div class=\"text-indent\">不可思议呀！诸佛出世就是为了讲「如来藏」心地法门，其它三藏十二部经都是戏论法。这是佛在《法华经》《楞严经》金口玉言。但是当你明白了「如来藏」道理，戏论之粪是不是「如来藏」啊？明心见性之后，你修什么法门都行——念佛、拜佛、打坐、吃饭、穿衣，都可以70。这个法是不是很公道啊？！</div><div class=\"text-indent\">所以「不垢不净」是不是不坏不好啊？没有什么正确，没有什么错误，都是一个人一个念在变现。所以要破除我们的嗔恨心，破除轻慢心。可是事到临头，有些人道理就来了——无分别不妨分别。那时候他来劲了，只有他一个人是佛是菩萨，别人都是妖魔鬼怪。那妖魔鬼怪是不是你呀？所以我们不可以对大坏人、大恶人有一点的嗔恨心，但是应该有慈悲心，要帮他，你不可以小看他。大光明藏中谁不是谁啊？往往那些大坏人可能成佛比我们还快，为什么啊？烦恼就是菩提，他烦恼到了一定的时候，产生恐惧心，他心力很大，一念就成就。</div><div class=\"text-indent\">这个「不垢不净」呢，涉及的范围比较广：不垢不净、不红不白、不是不非、不大不小、不多不少、不高不低。任何一样东西都是我们心里的一种执着、妄想和分别；但是当我们证到大菩萨现量果位的时候，所有的这种分别都会变成智慧德能，变成无量色身三昧来示现教化众生。</div><div class=\"text-indent\">「不增不减」：梦中梦到山河大地，你体内有没有增加一百万斤呢？醒过来以后有没有减少一百万斤呐？拳头变出了五个手指，它增了没有啊？五个手指变成了一个拳头，它减了没有啊？所以「如来藏」中，如来藏为总，万法为别，互为总别，互别为别，没有哪一法不是哪一法，叫「不增不减」。印广法师从慈航净苑来到这个讲经堂，慈航净苑有没有少个印广法师啊？这里有没有增加一个印广法师啊？一切的万法千变万化，都是不动而至。所以这个不增不减呢，叫「心外无法，法外无心」，没有哪一法在我们心外。现的这个人相，在没有现之前在不在啊？那既然在，现了以后有没有增加呀？没有啊。因为你当下还是那个东西。那当我们从色相回归自性的时候，那个色相灭了没有？它当下还是那个自性。「不增不减」，增和减是我们的一种性具功德，是自性变现而已——变来变去还是一个东西。</div><div class=\"text-indent\">比如，孙悟空摇身一变，变成一个茶杯，孙悟空在不在呀？他增了没有？他减了没有？都没有。那孙悟空还可以变成无量的茶杯、无量的电灯啊。无量的茶杯、电灯是不是一个孙悟空？有没有哪一个不是孙悟空呀？那么无量的孙悟空、无量的茶杯、无量的灯是不是一个茶杯呀？万法都是我们的心随意变现的，不能被表相所迷惑。</div><div class=\"text-indent\">佛在《楞严经》讲：我们的真心本来面目「离一切相，即一切法」。怎么「离一切相」啊？在梦中境界的时候，你能不能看到做梦的那个人呢？看不到。你怎么也看不到，怎么也找不到，叫「离一切相」；在你梦中的一切境界是不是做梦的那个人在变现呐？这叫「即一切法」。诸佛出世就是为了讲这个道理，把万法归于一个念，把一念而遍圆于一切的万法。我们的心非常玄妙，非常不可思议，非常殊胜！可惜我们却不知道，佛出世来传这个法我们还不敢相信，不愿相信。所以说众生最大的罪过，就是不知道自己就是佛，不相信自己是佛，不知道自己这个心不可思议的自在和它的伟大妙用，却执着于一点点小得可怜的人天福报，不肯放下。</div><div class=\"text-indent\">尽虚空遍法界，过去、现在、未来，就是一个人，就是一个念。这是佛法的命脉，这是佛法的根本。而唯识认为，每一个人将来都是一尊佛。究竟来讲，这属于菩提邪；而且持这种观点的人非常顽固，很难改变。因为这种观点致使我们凡夫的习气污染甚重。我们现在总认为，你、我、他、猫、狗、牛、马等每一个众生，将来都要成为一尊佛。错误啊！但是并没有大错，因为一多无碍，不二法门啊！它本来就是个无量，所以错只错了一半。</div><div class=\"text-indent\">讲到底，每个众生将来都要成佛。你在众生位成就了这个圆满佛的时候，你当下即已归入大光明藏。那大光明藏中已经成就的那些古佛，这个时候通通都是一尊佛。当我们究竟成佛的时候，你当下即是证道位的阿弥陀佛、证道位的释迦牟尼佛、证道位的威音王佛。你这个时候再出世，叫你一声威音王佛也是对的；叫你一声释迦牟尼佛也是对的；叫你一声阿弥陀佛还是对的。</div><div class=\"text-indent\">这是用分别法来讲啊，是在证道位。如果在见道位，在我们现在的本体，我们当下是不是释迦牟尼呀？（是），但你不是证道位的释迦牟尼，因为妙用还没有现前。但不管你承认不承认，你现在都是释迦牟尼，都是阿弥陀佛。我们见道的当下就知道，我们现在就是唐朝人，我们现在就是秦朝人，就是三皇五帝时代的人，就是大通智胜佛、日月灯明佛、威音王佛，哪一个时代不是我？！从无始一直到现在就是一个我。这是打比喻。</div><div class=\"text-indent\">十方三世就是一个真人、一个念而已，就是这一个念千变万化。所以无量劫以来，什么东西我们没有变现过啊？可是我们的念从来没有生，从来没有灭；而且张三的那个念，李四的那个念，王五的那个念就是一个念。一个念显现出无量的念，显现出无量的相。我们这个心呢，其大无外，其小无内；非空非有，即空即有。一粒微尘把它化成万分之一，万万分之一，万万万分之一，你能不能把它化尽呐？不能。</div><div class=\"text-indent\">想想我们现在可怜呐！这样一尊伟大的佛，伟大的心，我们却把它执著在这么一副皮肉上，放不下，由此而失去了无比的智慧与神通法力。修行非常容易啊，当下放下当下得，放下多少得多少，你只要按照这个方向往前走。那个电影上是怎么唱的？「往前走，莫回头。」你不回头，越来越自在。好好把这个道理观照，观照到你心潮澎湃，热血沸腾，你会高呼万岁：「我解脱了，我成就啦！」不需要求神拜佛，不需要包红包走后门，自己求自己即可。</div><div class=\"text-indent\">此即「不增不减」。每当作如是观照，我们就要想一想：我平时最讨厌最轻慢的那些人，他是谁？你马上就会生起慈悲心，生起平等心，生起柔软之心；但是对坏人、对恶人生慈悲心，你不可以去与他同流合污——而老师和同修之间对那些恶人坏人采取极大地忍耐来包容，来给出路，你不可以把这视为同流合污。</div><div class=\"text-indent\">传统的佛法要像佛当年一样，对一切人来者不拒。佛陀收留了一些强盗土匪，好多次差一点把命都送在他们手里，甚至有些外道邪门多次诽谤自己的声誉。以佛的智慧他完全知道这些歪门邪道到底是来干什么，他就是来算计僧团，算计佛，佛都没有拒绝；现在我们也一样，他就是来破坏道场，我们也让他来，等他破坏了以后再说，是不是啊？他即使来破坏道场，他也成就了。「如来藏」的种子一旦入心，就得菩提不退。他破坏道场，因此要下无间地狱，早出地狱早解脱，与佛法结恶缘也能得度。</div><div class=\"text-indent\">《法华经·常不轻菩萨品第二十》讲到一位跋陀婆罗菩萨，还有尼思佛等五百比丘、比丘尼等等等等——就是因为诽谤正法而下地狱，他们因为与佛法结了恶缘，但也因此种下菩提种子，在一定的时空点呢，他们仍然能够入正法成就。将来弥勒菩萨龙华三会第三会——前两会暂且不谈——第三会就是在释迦牟尼佛法中，凡是有过一念善根者，皆能得度。所以我们会接纳那些歪门邪道，强盗土匪；他再怎么样，到这里来总要种下一念善根，再迟也不会超过五十六亿七千万年，他就能得度。</div><div class=\"text-indent\"><strong>是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。</strong></div><div class=\"text-indent\">前面讲「色即是空，空即是色」，后面讲「空中无色」，也就是说，某种意义上是不是讲「空不是色」？这就带有无分别不妨分别。</div><div class=\"text-indent\"><strong>空中无色：</strong>那么空中有没有那个色性呀？就是说空中无色，没有色相，色相是以无形无相真实存在的那种性具功德而存在于真空，这都是方便说。什么叫存在于真空？它就是真空啊！这里没有更好的语言来表达，是用分别法来帮助我们观照三个如来藏。</div><div class=\"text-indent\">「空中无色」也可解释为「离一切相」，你想把真心的这个相找出来，你是徒劳。如果讲我们的真心是一个人相，那其它鬼相、牛相、马相是不是我？所以你不能讲真心就是人相，但是你还不能讲他不是一个人相，否则我是一个什么东西呀？我们常把真心本来面目空如来藏说为无形无相啊，不生不灭啊，如如不动等等。那么在《楞严经》归结为，色也好，相也好，都是真真如性。这个真真如性，包括原来那个「真如」是真，有形有相的万法也是真。通教、别教叫「真」，叫「真如」；圆教叫「真真如」。有人讲真佛无相，有人讲真佛就是「白毫宛转五须弥」，这是从两种不同的角度来错解佛法。佛当初讲这些法是作为一个桥梁来引导、过渡，最后归结到真真如性；而后人呢，执著这个桥梁就是佛土，误解佛的良苦用心。我们不能把局部的真理当成全面的真理，否则就变成了邪法。只要不懂《法华经》《楞严经》，就不得究竟，你怎么样讲，怎么样想，怎么样修，都不能成就。</div><div class=\"text-indent\">「空中无色」：这里的「空」是「真空」，不是虚空；因为虚空讲到底是「色」。那么这在前七方便里，通教和别教强调：非要破相归空，他的「空中无色」包括佛的三十二相，八十种随形好，统统判为无明相。那么见到真空之性的人，在禅宗说为「虚空爆炸」——因为在见真空之性之前，虚空是最后的一道屏障。虚空爆炸就破除了一分灭相无明。对于圆顿大法，如果要证到明心见性，不需要虚空爆炸，乃至不需要破任何色相。我们从任何一个色相都可以当下明心见性。圆顿大法只愁悟，不愁证71。</div><div class=\"text-indent\">那「是故空中无色」是总讲，后面的「无受想行识……无无明，亦无无明尽」是别讲，是不是？先把总讲明白了，由此奠定我们的信心。「是故空中无色」，实际上包含下面的什么「无明、无明尽、苦集灭道」，是不是统统都是色法啊？广义的色法，从虚空世界、山河大地到受想行识，都是色法，是不是呀？狭义的色法呢，一般是表无情。</div><div class=\"text-indent\">下面我们再从狭义的方面来具体理解。</div><div class=\"text-indent\"><strong>无受想行识：</strong>「受想行识」在前面讲「五蕴」的时候，已经作了解释。真心之中没有一个念，没有一个念就没有受，没有受你能不能想起来呀？不能想起来，那第七识有没有作用啊？它传什么？它运什么？它搬什么？没有第七识在搬运，有没有第八识啊？都没有。一破一切破。</div><div class=\"text-indent\"><strong>无眼耳鼻舌身意，无色声香味触法，无眼界，乃至无意识界：</strong>这里是讲：无眼识界，无耳识界，无鼻识界，无舌识界，无身识界，无意识界。为了简明扼要，提炼为「无眼界，乃至无意识界」。这是讲十八界，详细说来，佛在《楞严经》讲了五蕴、六入、十二处、十八界这四科。「五蕴」就是色受想行识；「六入」就是眼耳鼻舌身意；「十二处」就是眼耳鼻舌身意这六根，色声香味触法这六尘，合称为十二处；「十八界」就是六根、六尘V六识这十八个内容；又讲了地、水、火、风、空、见、识这七大。</div><div class=\"text-indent\">在《楞严经》里，佛从四科、七大来一步一步帮助我们会相归性，归入「如来藏妙真如性」。它那个归性当下就是性色真空，性空真色，性火真空，性空真火，性x真空，性空真X。X表无量。《楞严经》上讲性啊、真啊，就是《心经》上讲的「色不异空，空不异色，色即是空，空即是色」的「空」。所以《楞严经》更加着重权实并重，开权显实，由浅入深，一步一步帮助众生开智慧；《心经》呢，它是对《法华经》《楞严经》等三藏十二部经高度地概括——所以它开头炮就是圆顿大法，然后给大家一点一点地回味。</div><div class=\"text-indent\">那么大根机之人，在前面几句话即已成就，为什么？明白了经题的每一个字你都能成就。一点泥巴瓦块，都能叫你当下成就；风云雨雾，树木花草，万法无非广长舌，只看你懂不懂。现代人心地很浮躁，急功近利，他就是要你三言两语，把宇宙人生的本来面目讲清楚。现在是竞争的社会呀，佛法是不是也在竞争啊？要抢时间，要争速度。传大法就是当下成就，这叫「花开莲现」。</div><div class=\"text-indent\">讲六根，那我们怎么长出了眼睛？长出了耳朵？首先明白眼睛这个肉团是不是坚固的色法呀？在《楞严经》讲：一念坚固妄想而有色法，这叫「浮尘根」；那么眼睛能看，这就涉及到眼的「胜义根」，它也是尘法。但是这个「胜义根」呢，一般开天眼才能看到。</div><div class=\"text-indent\">而「胜义根」又是怎么形成的？就是由我们的第七识心与这个外尘作用与反作用，怎么作用与反作用呢？外边的光是不是也是由我们的心变现出来的？心里变现出来的光使得我们的第七识一会儿明，一会儿暗，是不是作用与反作用？然后明暗二尘粘湛发妄而有我们眼睛的这个「胜义根」，进而就有「浮尘根」这个肉团眼球，明暗二尘是指光，湛是指第七识湛然之体。这个「浮尘根」眼球像葡萄一样，里面的「胜义根」，它有感受和辨别的能力。</div><div class=\"text-indent\">那么眼根的来龙去脉我们大概知道了，耳根是不是也好理解呀？「浮尘根」里面还有「胜义根」。没有「胜义根」就没有「浮尘根」；「浮尘根」是在「胜义根」的基础上发展和壮大。那么有了这种「胜义根」，注意，我们的心一动是不是就有风啊？有风是不是就有声音啊？这个声音有动有静，反复地作用与反作用，就形成了耳根「胜义根」的这种反射能力，所以耳朵的「胜义根」和「浮尘根」，是不是都产生了呀？</div><div class=\"text-indent\">由此类推，鼻根、舌根、身根、意根是一样的道理。要详细明白这个道理，需要进一步深入《楞严经》。真正来讲，我们生生世世，有时是个人肉团，有时是牛肉团，有时候是狗肉团，是不是？是不是都是由这六根这么产生的？</div><div class=\"text-indent\">那么「眼、耳、鼻、舌、身、意」这六根呢，在《楞严经》不叫六根，叫「六入」。怎么叫「六入」呢？它有双重性，既可以进入「色、声、香、味、触、法」这外尘境界攀缘，也可以回光返照进入第七识、第八识，修清净心；破除见思烦恼、尘沙烦恼以及无明微细烦恼。它可以向外出，也可以向内入，六根即「六入」，都是归结到第七识，第七识在《楞严经》三细里叫「转相」。它既能转凡为圣，又能转圣为凡；既能转识成智，又能转智成识。圣与凡是一念迷悟；悟了当下即是佛，迷了当下即是凡夫。关键在于这六根，你要把持好，看你往哪个方向转。</div><div class=\"text-indent\">「色」：《楞严经》里的解释非常详细，但讲起来要一个礼拜；我在讲《过五关度六将证菩提》的时候，从地水火风四个不同的角度作了解释，而且只用十几分钟把它的来龙去脉讲个明白——所以我们要非常非常珍惜老师的劳动成果。《过五关度六将证菩提》中讲这个地、水、火、风它的来龙去脉，是在第四关，叫「心现识变」。你把它看明白，对于《心经》这一段的「五阴、六入、十二处、十八界」，都能明了。</div><div class=\"text-indent\">十法界无量万法，归纳起来这个外尘之法，不出色、声、香、味、触、法这「六尘」。如果广义而言，色声香味触法都是一个色法；什么眼识界，耳识界等，六种意识界无非是一个色法；眼、耳、鼻、舌、身、意这六根无非是一个色法。佛为了教化众生，广义讲完，还要讲狭义；那狭义来讲呢，这个色法一般地是指固体物。</div><div class=\"text-indent\">「声」：比如声尘有种振动，这个振动之相眼睛看不到，但耳朵能听到，是不是？色法呢，眼睛能看到，它局限于明和暗；这个声法呢，局限于动与静。注意，我现在敲桌子，大家能不能听到声音呢？那么我现在不敲，你们能不能听到声音啊？你们讲「能与不能」，正好就讲对了。讲不能，你不能听到动音；讲能呢，他能听到静音。静音也是一种声音。我们往往认为，有振动就有声音，没有振动就没有声音。其实啊，大音希声，真正的大音你反而听不到。好好往这方面悟啊！</div><div class=\"text-indent\">如果讲第一义谛法，声音就是我们的自性随缘显现。简单说，一切的十法界万法皆唯心所现，唯识所变。那这个茶杯在不在动啊？它一定在动。比如说在一百年以后，这个茶杯要烂成一堆铁粉，那它是一百年以后突然一下就烂了？还是每年、每月、每天、每分、每秒、每十分之一秒、每万分之一秒都在烂啊？它每万万分之一秒都在风化，那么一烂是不是在动啊？动有没有声音啊？一定有声音。那为什么我们听不到啊？因为我们烦恼习气重，心不专一，大家明白吗？当我们心很清净的时候，连茶杯波动的声音你都听到。</div><div class=\"text-indent\">在现量境界，我们可以跟一切的万法进行语言沟通。《阿弥陀经》讲了诸佛广长舌，这就是妙音说法。每一法都与佛一样具足无量的智慧德能，只是由于相互之间这种我执和烦恼习气的束缚，不能现前而已。那么当佛菩萨在现量境界，他能听得懂万法之语言，这是众生法妙，这是心法之妙。</div><div class=\"text-indent\">「香」：是对鼻根而言，指气味。那香臭是不是都是香味啊？（是）。那在没有任何味道刺激的时候，有没有香啊？也有香，知道吗？那是无香之香，这也要用智慧来观照。</div><div class=\"text-indent\">「味」：是舌头尝东西得到的感觉。酸甜苦辣都是味。那么没有酸甜苦辣的时候有没有味呀？也有味。那个味叫什么味呀？叫恬淡之味。</div><div class=\"text-indent\">「触」：比如说身体碰到这个玻璃台板，感到这个台板光滑的、凉凉的，合在一起是不是触啊？那么离开玻璃台板的时候，有没有触啊？有，也有触；那叫离触。如果感觉不到的话，你怎么知道它是离了？也是触啊。佛法一点一滴都在帮我们开智慧。</div><div class=\"text-indent\">「法」：这里特指「法尘」。这是指因时过境迁而留在我们头脑中的印象和记忆。比如眼睛看到的感觉，耳朵听到的感觉，留在我们心中的记忆，在佛法里叫「法尘影事」。举个例子，我吃了一个苹果，心里是不是有苹果很甜的这个味道啊？这叫味尘。当吃完以后，你在记忆里还有没有苹果这个样子？有，有没有苹果很甜这种感觉？有，这叫「法尘」。</div><div class=\"text-indent\">那么我们再看，在六根、六尘没有出现之前，在我们的心中有没有任何的痕迹啊？没有。所以叫「空中无色，无色声香味触法」，乃至无六种意识心。虽然没有这种形相，这万法之本性在不在啊？既然是在，它没有任何形相跟有形相有没有区别啊？所以又回到《心经》的开头「色不异空」，虽然「空中无色」，但是「空即是色」，明白这个道理吗？</div><div class=\"text-indent\">比如说孙悟空摇身一变，变成了茶杯，虽然茶杯里没有孙悟空这个相，但茶杯就是孙悟空。那孙悟空为什么要变成一个猴相啊？他变成这个茶杯相，行不行？都行的，这是心的本能。要注意，在讲小法的时候不失时机回到大法来。那么至于后面的六种意识心。眼对光产生眼识界；鼻对香产生鼻识界；意对法产生意识界……这是不是六种意识心呐？是不是十八界啊？六种意识心关键在于这个意识界；前面的五种俱生意识也叫意识，它是由根对尘而产生。那么由根对尘要注意，在没有根没有尘的时候，你能不能显现出有形有相的这个意识心呐？不能。虽然不能显现出意识心，在没有根没有尘的时候，这六种意识心在不在我们心里？一定是存在。不管你有没有眼根，有没有色尘，它都存在。它是借助于六根对六尘这种因缘而显现出这种意识心。</div><div class=\"text-indent\">比如说我们看到灯光：「哎呀，这个灯光真亮啊」，哎-呀-这-个-灯-光-真-亮-啊，九个字，是不是？那在没有眼根和灯的时候，这九个字在不在啊？（在）。你可不能以为是六根对六尘产生了这六种意识心，这就是小乘因缘法。按照小乘因缘法修行，我们可以证阿罗汉果位，可以超六道轮回，但是你不能明心见性。所以到了大乘法：「哎呀，这个灯光真亮啊！」我跟你们讲，它不是眼根对灯光产生的，明白吗？它在心里本来就有。真实讲来，它是随缘而显现。这叫不叫破因缘法啊？不叫。它不是由眼根对灯光产生，亦非不由眼根对灯光产生，这就圆满了。这叫「非因缘非不因缘」。</div><div class=\"text-indent\">《楞严经》这个法讲得很正确，但是讲得太高度概括，我们不容易理解。它是讲非因缘非不因缘，破因缘之相，不破因缘之性，不舍因缘之用。一般的人认为非因缘就是破了因缘法，错了——你破除了因缘法等于是断灭空。我们真心本来面目一定要随因缘而显现。你们要把握我的一个口头禅，我问「是不是」，你讲「是不是」就对；你讲「是」也是错的，你讲「不是」也是错，你应该「是不是」，这就是破因缘法，也是也不是。这就是口头禅，这就是真理。</div><div class=\"text-indent\">好，把这个六根、六尘明白了以后，我们对后面的六界就懂了。</div><div class=\"text-indent\">「眼识界」：眼根对色尘，产生了感受，这叫眼识界；那么当感觉了以后，进一步地判别——哦，这尊佛像是金色，这是释迦牟尼佛像，这个时候进行了第二念分别，就已经由意根产生了分别，就产生了眼意识界。即使时间过去、环境改变，他头脑里是不是有了这个佛像的概念啊？这叫意识心，叫「意识界」。以此类推，眼界，眼识界，眼意识界……嘴里吃了一块糖果，当下有了感觉，还没有什么甜苦之分，当感觉到——哦，这是甜味，不是辣味——这就已经变成了意识界。仅仅感觉到有东西了叫「舌识界」；然后呢，「耳识界」，「鼻识界」，能不能以此类推呀？就是这个道理。所以你能够做到在修行的过程中，没有了五蕴，没有了在六根、六尘、六识这种种的分别，你证到通教菩萨禅宗境界，叫破有归空，见到了空性。这个时候叫「虚空爆炸」——什么东西都没有了，但是你知道自己在修行，这个念提起。如果不知道自己在修行的话，叫无想定。这里很关键，很难把持。</div><div class=\"text-indent\">现在有一位同修在修什么禅宗，证到自己体温可以提高到41度，这个时候来讲，仍然在观世音菩萨那个破六关的第一关里，在动相里执着，修这种法很危险。体温到41度，是不是还有受啊？那你空了没有啊？你修那些东西干什么呀？你不知道要修几百千万亿年才能证到一分空性。而我们听经闻法，是一下见到空性与不空性——在圆顿大法见道位的功夫，可以视同证道位的功夫。为什么？圆顿大法在见道位见到的真如本性与在证道位证到的真如本性无二无别。</div><div class=\"text-indent\">我前面还讲了：你现在明白了万法都是一念变现的，等到了中阴身期间肉团身这个无明壳解体，眼耳鼻舌身意这六个妄识销毁，你到时候当家做主的是第七识，所有功德当下现前，你会——啊呀，师父当时讲的万法唯心所变，果真就是啊！当下是不是就证道啊？那到底是在中阴身证道了，还是在明白的当下就证道了？</div><div class=\"text-indent\">其实我们当下往生极乐世界，是没有中阴身的。你是成佛以后到极乐世界去，而不是到极乐世界去成佛，明白吗？不成佛，你不能过去。这是《大方广佛华严经》规定的：成佛、成菩萨、成阿罗汉，都是在人道修成了以后再到佛土——而不是到佛土了以后才成佛。成佛以后叫「有余依涅槃」，还余了这个肉团身在这里。</div><div class=\"text-indent\">我们不是常讲六种震动吗？那么还有个三返震动，六种震动就是讲我们听经闻法中，眼耳鼻舌身意这六根发生震动；你可不要理解为天摇地动。地，就是表我们的无明心地，这个地是动的。什么叫三返震动呢？六根第一次动叫「动」，六根动了以后你对六尘的看法是不是改变了？这就叫什么动啊？这是第二次动，叫「遍动」。你反反复复地动啊，遍动啊，你这个六种意识心即已转识成智，这是第三动，叫「等遍动」。</div><div class=\"text-indent\">「无眼界，乃至无意识界」：这里呢，我们不妨把它看为是对中下等根机的人说法——佛讲任何法都是观机逗教。圆顿大法非空非有，对空说非空，对有说非有。你稍微用智慧来想一想，既然空中无色，那么现在讲空中无色的人是什么东西啊？他不就是色吗？叫对色说非色。</div><div class=\"text-indent\">这个「色」当下就是「空」，是不是又回到《心经》那个「色不异空，空不异色，色即是空，空即是色」啊？有没有矛盾啊？没有的。这才是圆融、圆通、圆满，不懂「一心三藏」的人，讲不出这种境界。就知道：「啊，真佛无相」——无相？那你是什么东西？那同样的，「无眼界、无意识界」是不是当下就是眼界啊？当下就是意识界啊？如来藏中谁不是谁啊？眼界是不是耳界？耳界是不是鼻界啊？没有哪一界不是哪一界啊！</div><div class=\"text-indent\"><strong>无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。</strong></div><div class=\"text-indent\"><strong>无无明</strong>：这句话也真是给玄奘大师想绝了！他讲这三个字，叫我就要费老半天给你们解释。这句话讲全了：无无明，无行，无识，无名色，无六入，无触，无受……实际就讲十二因缘，是不是？然后还有讲无什么什么，无老死尽……也就是讲，我们真心中啊，本来就没有十二因缘这个东西，十二因缘都是妄想打出来的。我们仍然先用小法作一个说明。首先理解这十二因缘是怎么回事。</div><div class=\"text-indent\">所谓「十二因缘法」，也就是把三世因果报应分为十二个方面、三个阶段来说明众生六道轮回的来龙去脉，也是对「苦、集、灭、道」的细说、深说。</div><div class=\"text-indent\">无明缘行：这里是讲小乘法，不能按照《楞严经》深说「三细无明」，「生相无明」。在这里的「无明」已经进入枝末无明，也就是「发业无明」，或「造业无明」。在造业之前就存在于我们心中的那些很粗糙的「无明妄想」，由它作为这「十二因缘」的灵魂，它始终起指导支配作用。它是「等流果、异熟果」。怎么个「等流果、异熟果」呢？在过去世中造的业等量流传到今生今世来受报。有些人他不理解：我一生从未作恶，怎么受恶报呢？这是「隔世而报」，都是你自己造的因，自作自受。这个相当于「集谛」，是受苦之因。「缘行」：因为无明而形成了我们的造业。也可以解释为「行缘于无明」，「行」就是我们所做种种善恶无计。「无计」，有些业非善非恶，属于中性。比如走路，也是一种业，也要受报。我们生生世世也都有「善恶无计之业」。这个「行」属于「集谛」，是来世受身之因。</div><div class=\"text-indent\">行缘识：「识」就是第八识「阿赖耶识」，就是我们生生世世轮回受生的种子仓库。也就是说我们造的业，全部保存在阿赖耶识里。造业包括身、口、意三业，这三业由眼耳鼻舌身意这六根对色声香味触法这六尘打妄想，打妄想就造意业，开口讲话造口业，动手动脚行持造身业。所以这个行啊，这个业啊，就包含了六根、六尘、六识等十八界，不出这十八界。造十八界之业，保存到阿赖耶识里，怎么样保存过去的？就是通过我们的第七识。第七识是六根之总根，它把这个业输送到阿赖耶识里去。</div><div class=\"text-indent\">为什么会有六道轮回？从第二义谛最直观、最当下的着眼点，我们来观照。许多众生听佛讲一遍十二因缘法，听佛讲一遍苦、集、灭、道，站在那里无修无证，他也能证四果罗汉，也能证辟支佛果位72。无论大乘法、小乘法，只看你会不会用心。这个法是不是讲得很朴实啊？就是讲我们生活中的法——你脑袋怎么样想问题，你眼睛怎么样看东西，耳朵怎么样听，嘴巴怎么样讲，身体怎么样行，一点一滴，善善恶恶，真真假假，全部都给你保存在阿赖耶识中，就跟这个光碟一样，是不是啊？你怎么样讲，怎么样做，这个光碟给你刻录下来了。所以我们要好自为之啊！</div><div class=\"text-indent\">人从一出生开始，就有两位护法神时刻监督：一个叫同生，一个叫同死。你一切的言行举止、思想念头，都给记录在案。在冥冥之中，我们受诸佛菩萨、诸天护法神明的监督。</div><div class=\"text-indent\">所有的万法都共一个「阿赖耶识」，共一个种子仓库。不管来世做什么，都离不开「阿赖耶识」这个仓库。决定你来生来世怎样受报的，是在你这个时空点活动力最强、对你影响最深、你最执著的那个东西。那个东西呢，就是根据你各个方面种种的习气汇合起来的情况——你是贪、嗔、痴、慢、疑，还是慈悲、忍辱、行善、积德，正反各方面的这些最现行、执着最深的善恶和无计，来给你算总账。来世不管是在天、在人、在鬼、在畜，它总同时有善报和恶报。</div><div class=\"text-indent\">识缘名色：「名色」就是受报的种子，就是阿赖耶识里影响力最大的一个末那识。这个时候已经成为我们第七识，投胎。最初它仅仅是像牛奶那样的一滴液体。所谓「名色」，名义上是一个色法，它还没有「皮肉筋骨」，但是它已经有了殊胜意义上的「皮肉筋骨」——也就是「四种极微：色香味触」，是「胜义四大」。也可以解释为，「名」是「受想行识」这四种意识心，属于「心法」；「色」是「地、水、火、风」四大，属于「色法」，心色连持为一体，叫「名色」。</div><div class=\"text-indent\">从「阿赖耶识」到成就为「名色」，这个之间有「中阴身」，非常重要。一般人死之后，往生佛土的人没有「中阴身」，下地狱的人也没有「中阴身」。中阴身期间对于人道的、鬼道的、畜生道的众生有实际意义。「中阴身」一般是四十九天，但是也有例外。有些第一个七天、第二个七天，逢「七」就走，这是带有计划性；也有的不逢「七」就走；还有的中阴身可以延续几年，乃至几千年、几万年。这个取决于各人的执著心。</div><div class=\"text-indent\">首先讲那些不正常的投胎。比如通过助念往生的，他不用逢「七」，可以说走就走；也有的把天堂误以为是极乐世界；也有的把魔道来的误以为是接引——因为妖魔鬼怪、冤亲债主也能变现阿弥陀佛的殊胜之相；也有的在中阴身期间，由于冤亲债主太多，到处被追杀，这个时候他就狂奔，钻到草堆里，好了，变成一条虫子；也有的在中阴身期间，由于生前贪吃，闻到一股香味，一念心就是一只小爬虫，叫「湿生」。</div><div class=\"text-indent\">明心见性之人呢，他反而感到很好玩，专门来考察考察：小爬虫怎么来的？地狱道怎么回事？他来看一看，然后到极乐世界报个到，再来娑婆度众生。是不是很自在？即使阿弥陀佛来了，你还考察一下真假：若是真的，讲讲「如来藏」的道理，看看对不对。若是假的，你一提「如来藏」，他马上就没有影儿了。其实你并不需要谁接，你一念想极乐世界就走了。</div><div class=\"text-indent\">在实际的「中阴身」投胎之前那一刹那——一秒都不用——整个尽虚空遍法界漆黑一团，这个时候呢，在按照计划中，你要投胎的未来的父母之处自然露出一团亮光。在中阴身期间，没有速度、距离可言。即使太阳系、银河系之外的无量恒河沙数银河系之外的一团光，一念就到。这个心一起步就是超光速。那么什么时候去呢？就是在未来父母过夫妻生活的时候。已破除男女之欲之人，他不会受这种干扰。他一看就是：哎呀！到欲界投胎。他眼睛一闭，「阿弥陀佛」一声就走了。</div><div class=\"text-indent\">那么淫心未除之人，他就凑热闹去了——作为第三者进去了。一念妄想融入父精母血之中。所以胎生的众生要具备父缘、母缘和己缘这三种因素，再加上你的妄想。你没有这个妄想，当下就解脱。为什么佛规定：你真想了生死吗？不可以有男女生活。在家修行也可以，男女生活要断除。这当然是对修小乘法的人而言。修大乘之人，可以带业往生，但是也要节制。你果真在梦中、定中都能清清楚楚、明明白白，你就能带业往生。否则也难免欲界之苦。当然了，在佛座下做龙天护法，都有可能。</div><div class=\"text-indent\">名色产生以后，在第二个七天有了黄豆大，然后在第四个七天小老鼠大，然后慢慢地，每隔七天一个变化，在《佛说入胎经》或《修行道地经》讲得很清楚，与现代医学通过超声仪器对十月怀胎进行检查的结果无二无别。想一想，几千年前连电都没有，哪有仪器啊？佛是什么人呐？如果是男胎，他肚脐眼一定跟母亲的肚脐眼保持相反的方向；如果是女胎，则是保持同一方向。儿女到底是什么啊？祖师大德讲，人如果有慧眼，有天眼，要丑得无地自容。话说回来，别说我们，诸佛菩萨谁不是从这条道来的？</div><div class=\"text-indent\">名色缘六入：「六入」就是指眼耳鼻舌身意这「六根」。为什么不叫「根」而叫「入」？它既能进入尘世间去造业，又可以从尘世间进入心里世界，它有双重性。到了「六入」啊，起初阶段可说为神经细胞、神经纤维；再发展呢，为「浮尘六入」——有了皮肉筋骨。</div><div class=\"text-indent\">六入缘触：「六入」一旦形成，就会与外界产生接触。有些法师解释为在子宫这个阶段，有的解释为在出世以后几个月。在娘胎里也能触啊。母亲吃一口凉，胎儿感觉冰寒地狱一样；母亲吃一口热，他的感受如同烈火地狱；母亲弯弯腰、翻翻身，胎儿感受如同泰山压顶，喘不过气来。我们知道在娘胎内与出胎后都涉及到「入、触、受」这种情况就行了。</div><div class=\"text-indent\">触缘受：接触以后就会有感受。此时产生五种俱生意识。那么「受」了以后呢？</div><div class=\"text-indent\">受缘爱：有爱必有恨，这就进入了「想阴」阶段，他就可以打妄想了。讲到这里，再把前面的十个因缘作大概分类。</div><div class=\"text-indent\">在十二因缘中，把前面的「无明」与「行」划分为「能引」。「引」什么？能引未来的生死。把「识、名色、六入、触、受、」这五项划分为「所引子」。怎么「所引子」呢？是由「无明」和「行」造业以后所引起来的这种果报。下面：</div><div class=\"text-indent\">爱缘取，取缘有，有缘生，生缘老死忧悲苦恼：「爱、取、有」这三个可划分为「能生子」。第二世的「爱、取、有」即已孕育了第三世的果报，叫「能生子」。有了爱憎之心，就必有取舍之心，叫「爱缘取」，取与舍都是我们的分别心。到了取呢，一般已经都在娘胎之外了，在内他没有办法取。到了取就开始造身业，那么这个受缘爱，这是开始造意业；所以到了取呢，身业、口业都已经包含——在爱的阶段也有可能造口业，他不能取，他可以开口讲话要啊，是不是？这样分析。</div><div class=\"text-indent\">取缘有：造了恶因的当下就已经孕育了来世的果报，这叫「有」。这种果报就已经保存在我们种子仓库里——「发业无明」随时可以爆发，只要机缘成熟。所以这个「爱、取、有」是属于来世的，属于「集谛」。前面的「名色、六入、触、受」属于「苦谛」。</div><div class=\"text-indent\">有缘生，生缘老死忧悲苦恼：「老死忧悲苦恼」可以概说为「死」。这里就涉及到「生、死」这两个缘。这两个缘就是第三世的「所生子」，属于「苦谛」。</div><div class=\"text-indent\">这十二因缘概括了三世因果轮回，可以把它说为「生相」，也可叫作「生门」。对于小乘人来讲，明白十二因缘就知道了过来的道路，但也没有涉及到明心见性，是佛作为方便说，依此修行可以出分段生死。</div><div class=\"text-indent\">好，我们现在回到大乘因缘法。「无无明」。</div><div class=\"text-indent\">从刚才讲的这个十二因缘——无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死——看上去我们是通过自己造业，通过父母生育，而形成三世果报；那想一想，在没有造业、在我们没有父母之缘而生之前，这个十二因缘在不在啊？在，就在我们的心中！都是我们自己的一个念变现，父母也是一念变现，造的一切业也是一念变现，我们自己受的果报都是一念变现。真心中本来就具备这种性具功德，它随十二因缘而显现为三世因果报应。</div><div class=\"text-indent\"><strong>亦无无明尽，乃至无老死，亦无老死尽：</strong>这就是修行十二因缘法的次第。这十二个因缘从任何一个环节下手都能成就。比如取缘有，我们从「取」讲：</div><div class=\"text-indent\">取就是造业嘛，那好了，要注意，十二因缘是闭关修行。我不取了，我什么都不做，饭都不吃，水都不喝，不是不取了吗？我断绝一切的因缘。比如钻到山洞里，然后用石头把洞口堵起来。「老子这次进来，不成功便成仁。饿死就成饿死鬼，成佛就成辟支佛」，是不是缘取了？他用「不取」来对付取，他就是保持这种清净心。在修禅宗的境界里那算第一道关，现在这样的人太多了。无明无明，无明风动，风动还不就是打妄想？那从无明就开始了，我不打妄想不就无明尽了？但要提起一个正念。</div><div class=\"text-indent\">我问大家：在我们真心本来面目里，有没有这种有形有相的修证啊？没有。但是这种修证，它的性具功德在不在啊？（在）。这就是真空妙有。我们是对有说无。我在这里其实把小法大法已圆融起来了，是不是？我们是对有说空，在说这个空的当下就是有啊；如果没有的话，他能不能想起来修这种法门啊？（不能）。在我们心中都是本来存在。讲空讲有都是方便法，我们的真心非空非有，它可以现空现有。那空如来藏是不是无为法呀？用方便法讲是无为法，究竟法讲，它是不是无为法啊？它也是有为法啊，是我们一念心现出来的。我们的真心非有为非无为，它可以现有为现无为，无为就是有为，有为就是无为。</div><div class=\"text-indent\">而「一心三藏」与「次第三藏」也是天地之别啊！也包括《大方广佛华严经》，许多人把它说为圆顿大法，这是误会；它是别教一乘，而非圆教一乘。那个法怎么修啊！《大方广佛华严经》是讲无量法门，而且它讲「一切唯心造」；而《法华经》《楞严经》是讲「一切唯心现」。「造」则有能所次第，「现」则为当下即是；「造」则有二，「现」则即一即二73。所以圆顿大法只有《法华经》《楞严经》。</div><div class=\"text-indent\">「亦无老死尽」，这个道理是不是刚才都解释了？我们真空中哪有什么老啊，死啊这些东西？没有啊！可是用究竟法来讲，你如果没有的话，怎么能显现出老不老和死不死啊？没有大米，没有白面，能不能做出糕点来啊？巧妇难为无米之炊。所以我们心中本来就存在这种东西，虽然无形无相，但它是真实存在。亦无老死尽，但可以现老死，现老死尽，老死是轮回，老死尽是得道证果。</div><div class=\"text-indent\"><strong>无苦集灭道，无智亦无得：</strong>「苦集灭道」就是四圣谛，是小乘佛法的基本教义，依此修行可以证阿罗汉果。小乘人根机浅，所以要从具体的苦相着眼；那么修十二因缘的中乘人呢，根器较利，他不需要从苦相着手，而从苦因，从因上解决问题。</div><div class=\"text-indent\">苦谛：「苦相」可分为三苦以及八苦；「苦果」可分为有情世间以及器世间两种果报。</div><div class=\"text-indent\">集谛：汇聚、集合之义。集就是苦因。前面五浊已经讲到了，那五浊就是苦之因。这里省略。</div><div class=\"text-indent\">灭谛：其实应该是苦集道灭。我们反过来讲，好不好？先讲道，修道以后才能证灭嘛。知道了苦，知道了苦因，我们就可以从道上下手，来获得涅槃。</div><div class=\"text-indent\">道谛：是指修小乘法常说的「三十七道品」。「道品」，为梵语之意译，又作菩提分、觉支，即为追求智慧，进入涅槃境界之三十七种修行方法。又称三十七觉支、三十七菩提分、三十七助道法、三十七品道法，为四圣谛中道谛的仔细开展，是小乘佛教修行的基本内容，有四念处、四正勤、四如意足、五根、五力、七菩提分、八正道分。</div><div class=\"text-indent\">四念处：即「身念处、受念处、心念处、法念处」。它是指四个安顿心念的处所，又称为「四念处观」。为什么把它称为「四念处观」呢？因为它并不纯粹在于修定，而是以智慧用四种法观察四念处来破除四种颠倒，故称为「四念处观」。</div><div class=\"text-indent\">身念处：观身不净。这是臭皮囊，里面装的是乱七八糟，皮肉筋骨等等，都是浮尘。因为这个肉团身的拖累，使得我们生生世世轮回受苦报，要把它看破放下。</div><div class=\"text-indent\">受念处：观受是苦。前面在讲三苦的时候是不是解释到了——苦也是苦，乐还是苦，有受皆苦。所以吃得好啊，往往得富贵病，包括穿好玩好……有时这种好当下就是一种苦，更何况这乐过去以后，相继而来就是苦，为什么？本来这个心是清净心，清净心有了快乐的污染，是不是要把它消除掉啊？不管是自觉也好，不自觉也好，我们生生世世都在调理。为什么要下地狱啊？因为清净心被习气污染太重，太重了就形成像那个柴草一样的。烦恼之薪太多了，没有办法处理了，所以通过一种极端暴力的手段把它烧掉。生生世世都在提醒我们向清净心靠拢，所以饿鬼、地狱无非解脱之道。有智慧的人觉得那种地狱解脱的办法太痛苦了，是不是？所以选择听经闻法开大智慧，来解脱。</div><div class=\"text-indent\">心念处：观心无常。我们这个心一天到晚浮躁不安，这是我们的尘劳之苦啊！</div><div class=\"text-indent\">法念处：观法无我。观这个身不是我。前面在讲五浊破身见的时候，已经作了解释。这个肉身都不是我，何况观一切法，它哪是我？这是小乘人破我执。懂得了一切都不是我的时候，你才懂得什么是我。回光返照，从我们的心性上来开智慧。</div><div class=\"text-indent\">再说「四正勤」。</div><div class=\"text-indent\">一者，已生善令长。我们已经具备的优良品质要发扬光大。对修行人来讲，你千万不能，「哎呀，就我一个人做好事，算了，别人都懒，我怎么就懒不起？」这个心就用错了，要珍惜自己的美德。点点滴滴都是成就自己的功德和福报。不要认为你是给别人干的，这不是搞世间法。在某种意义上讲，别人不做你做了，这种光让你沾来了，你还要感恩人家。</div><div class=\"text-indent\">二者，未生善令生。这叫见贤思齐。有些人不是的，他对别人的长处甚至带有妒忌心、诽谤心，把人家往坏处想——哼，想出风头呗。看到人家拿多少钱财来供养，本来你生个随喜的心你就一样得到功德，他偏偏——哼，我要是有钱，我比他还会供养啊——或者见到师父表扬某某人，心里应该生欢喜心；可是他不是的——师父又偏心了——是这样的心态。不管世出世间，一个圆满自己的重要秘诀，就是要学会取人之长，补己之短。</div><div class=\"text-indent\">三者，已生恶令断。知道自己的习气就要改，不要等。师父有时候安慰大家，我们改变习气要有个过程，是防止你们自卑自贱。你可不要反用了心——既然是这样，就由它去——许多人并不是不能改掉自己的习气，只在于他愿不愿意改。</div><div class=\"text-indent\">四者，未生恶令不生。你不能不学人家长处，还反而去学人家短处，那你就退转了。你这个罪过很大呀，明明知道人家是恶，是短处，你还要去学——哼，他能干我怎么就不能干？</div><div class=\"text-indent\">四如意足：即「欲如意足、念如意足、心如意足、行如意足」。前四念处中修实智慧，四正勤中修正精进，精进智慧增多，定力小弱，今得四种之定以摄心，则定慧均等，所愿皆得，故名「如意足」，又名「神足」。</div><div class=\"text-indent\">欲如意足：不是指欲望，是指我们的愿心。你有这个愿心，想解脱自己，想成就自己。有此前提，你不需要吩咐，就知道自己应该怎样做。「如意」是表自在呀，是表自性流露。</div><div class=\"text-indent\">念如意足：是表念念在道。在没有起心观照之前，你这个念法尔如是。比如说，人家偷了我五百块钱，偷也好，不偷也好，你不会跟人家计较，你这个念早就已存在。</div><div class=\"text-indent\">心如意足：那么事情发生了以后，在正念的指导之下，怎么样思维用心。</div><div class=\"text-indent\">行如意足：念在思维之前，然后通过心的思维，通过自己的行为举止来落实。</div><div class=\"text-indent\">对这个「四如意足」呢，我看到过几种不同的解释；把它圆融为「欲、念、心、行」，贯穿在我们整个的行为举止当中。在小乘法里真正明理见道之人，也叫真修行，不需要问老师。</div><div class=\"text-indent\">这「五根五力」，我在这里不细讲了，因为这些法经常讲。「五根」：指信根、进根、念根、定根、慧根。「五力」：指信力、进力、念力、定力、慧力。生根以后再往上发展，这叫力，以根为基，以力为长。</div><div class=\"text-indent\">信根：这是入门的第一关。人无信不立，佛法里亦复如是。信是基础，你对佛法没有信心，会一事无成；所以「信为道源功德母」。佛法大海，唯信能入。这种信分两种：一种是迷信，一种是正信。无论是迷信和正信都有过去世中的功德福报。迷信呢，是把佛法当成一种宗教信仰、伦理道德。也说为加法修行。修无量法门，修的越多越好，越杂越好——又会念佛，又会修禅，又会修密、持咒、拜佛、拜忏、放生、火供、施食，等等等等。这种迷信也很殊胜，你能迷信你就有救，就与佛能结下法缘，你能得到人天福报，但不能了生死。恰恰相反，如果执着了人天福报，他障碍了生死！修人天福报叫「三世冤」。今生今世修，来生来世有，第三世就要往下落。为什么？在第二世享福的时候他自以为是，看到那些念佛人、拜佛人就轻慢，他这一念心就必下无间地狱。</div><div class=\"text-indent\">所谓正信，就是明白宇宙人生的真理。你现在对于「万法唯一人一念之所变现」这一句话，刻骨铭心，深信不疑，则为正信，是为信解之相。佛在《法华经?分别功德品第十七》讲得很清楚，你这一念信解，能证到从罗汉位乃至到地上菩萨，到等觉菩萨都说不准。只看你信得深浅而已，但是最低保障不落三恶道。同时还讲，一念信解〈如来寿量品〉（佛讲这一品仅仅是半小时而已），你的功德比修持戒、布施、忍辱、精进、禅定——以这五度法门包含无量法门——修八十万亿那由他劫（八十万亿那由他劫就可以看成无量劫），简而言之，比你修无量法门无量劫的功德还大无量倍。仅仅是一念正信呐！佛讲不是大千倍、万倍、万万倍、亿亿倍，而是大无量倍，不可思议啊74！</div><div class=\"text-indent\">正信佛法就是减法修行，越是真理越简单，「假传万卷书，真传一句话」。就是一朵「妙莲华」，就是一句「如是我闻」，就是一句「阿弥陀佛」，就是一句「如是等」。大根机之人听几句话便成就了。我在这十多年传法中遇到这么两三个人，两三个人而已。他听了十来句话，不到十分钟，明心见性了。哎呀，那个磕头如捣蒜一样，讲话都发抖，那不是装出来的，他几十年都在追求宇宙人生的道理。师父几句话就给他点破了，当下明白。</div><div class=\"text-indent\">诸佛出世是教我们做一个真人，了生脱死，生生世世大福报。只有做到了真人，他才能圆融、圆满、圆通，从根本上行一切善，断一切恶。做真人不是做善人，却是做更圆满的大善人、真善人。《华严经》讲啊：<strong>忘失菩提心，修诸善法，是名魔业</strong>。一个没有明白道理的人，佛讲，十方三世的好事给你做绝了，都是「魔业」，仍然六道轮回。</div><div class=\"text-indent\">为什么我特别强调正信「如来藏」太重要！太重要！太重要！而我的个别弟子，仍然对这个大法持有怀疑，强调什么真修实证，都不知道修心明理才是真修实证；而且这些人往往是对自己要求比较严格、比较圆满的人，所以回大向小。往往一些人优点具足，但是呢，优点本身就成为自己最大的障碍；往往有些人缺点很多，但往往却成为他解脱成就的最大动力，你说好玩不好玩？任何人都不可以执着，你看那些优点非常圆满的人却不能成就，是不是很可惜啊？</div><div class=\"text-indent\">进根：对于「人、天、声、缘、藏、通、别」这七种方便人而言，他信了以后，要进门来要修行，光信、光解不能成就；因为他那种信、那种解，有些完全是迷信，有些是半迷信——他必须通过真修实证才能证明，不证不行75。对于圆顿大法，对于圆教人修行而言：信当下就是进，当下就是念、定、慧，他不立次第。这个不一样。那么对于方便法而言，你信了这个东西，你不进来，用世间法叫口头革命派，是不是啊？嘴巴说说而已——自己只说不行，这个叫人看不起的。</div><div class=\"text-indent\">那在我们道场，曾经提出四种精进。</div><div class=\"text-indent\">一者，择法精进。佛在《楞严经》讲，一个殊胜法门与一个劣等法门的功德比例是「日劫之倍」，修一天正法胜过你修劣等法无量劫。《法华经》讲，一念信解如来藏，胜过修布施、持戒、忍辱、精进、禅定这五度功德。也就是说，一念信解如来藏，胜过修无量法门。你想真精进吗？赶快读《法华经》《楞严经》。《法华经》即使一句不懂，读了以后也能到天堂去，享人天福报都不得了啊！你能一念信解《法华经》，当下蒙佛授记76。</div><div class=\"text-indent\">那么不明白「如来藏」道理的人，他一天到晚自以为精进。可是，一旦明白「如来藏」的道理，你这一天、一时，你这一个念，等于修了无量劫了！这是谁讲的？佛讲的！你说这个便宜是不是给我们沾光了？选择大法，一念等于你修行无量劫。</div><div class=\"text-indent\">二者，择土精进。佛在《无量寿经》讲，在娑婆世界修行1天胜过在西方极乐世界修行100年。而极乐世界一天等于娑婆世界一个大劫，这个帐你算算。往生极乐世界以后，是赖在那里享清福，就等着成佛？还是回到娑婆世界来，采取积极的态度，争取早日成佛？有人感到奇怪：「啊，极乐世界还不如娑婆世界啊？」这要看你从哪个角度来讲。你愿意享清福，永远不落六道轮回，那就在极乐世界；你想赶快成佛，那就到娑婆世界——因为极乐世界太快乐，没有苦乐、明暗种种对比；没有对比就不容易开智慧，就不容易奋发图强。希望受持《法华经》《楞严经》的同修，往生到极乐世界以后，跟阿弥陀佛打一个招呼，再见，速回本土教化众生，我们要下这个海。</div><div class=\"text-indent\">要想在我这里剃度出家的弟子，我首先约法二章：</div><div class=\"text-indent\">第一，你要准备吃苦。没有好吃好喝，也没有好住，没有很多钱。出家人眼里有了钱，就是自取灭亡。你必须想到自己所有的钱只能供养三宝，供养众生；除了必需的生活费，多下来的统统给三宝，自己把握自己。</div><div class=\"text-indent\">第二，你要准备受气。心里千万不要有想法，认为谁欺负我，谁怎么长谁怎么短——你那是无聊。当我的出家弟子，没有什么道理好讲，我这个人从来不讲理。没有哪个好，没有哪个坏。我只看你能不能抓住当下，能不能忍得过这一时。有什么道理好讲啊？所有的人都是自己一个人，讲什么理啊？跟谁讲啊？是非好坏长短都是一个人、一个念，你跟谁讲理？谁是谁？谁又不是谁啊？你不是无聊啊！我到慈航净苑的第一天就是这么讲的，走到哪里我都是这么讲。你只要来法华道场听经，你就成就了；要么当下成就，要么明天成就，要么明年成就，要么来世成就——最迟最迟不超过五十六亿七千万年，在弥勒第三会，是不是？</div><div class=\"text-indent\">三者，劝持精进。劝一个人修行要胜过你自己精进，也就是说，最起码你劝一个人来修行，就等于你这个人双倍的功德——你即使二十四小时不吃不喝，在那里「阿弥陀佛！阿弥陀佛……」，或者打禅坐，或者是做一切善事，你一天只有二十四小时，是不是？你劝一个人精进，就是多少啊？就是四十八个小时，所以胜过你精进——你劝了这一个人，跟着后面就有十、百、千、万，跟滚雪球一样！</div><div class=\"text-indent\">《法华经》讲得很清楚。一个人听了《法华经》出来以后，他告诉张三，张三又告诉李四，李四又告诉王五，王五又告诉赵八，到第50个人，第50个人他只是听到而已，还没有对别人传法——这一个人的功德不可思议啊——胜过七宝满虚空供养大千世界无量的众生，无量的众生供养到80岁以后，再令他们证阿罗汉77。为什么？你1传了10，那10个人修行的功德都是你的，10个人再传100，100个人修行的功德还是你的。</div><div class=\"text-indent\">四者，发心精进。《大方广佛华严经》有讲，在〈发心功德品〉说，在无量法门无量功德中，发心功德最大78，乃至占百分之七十八十，乃至占百分之九十九点九九九，乃至像龙女那样百分之百。什么也不要，心一发了事，当然在于你发心的大小。发心分两种：一是「方便菩提心」，二是「真实菩提心」。「方便菩提心」是善心，就像阿难那样。阿难之所以无量劫以来不落三恶道，就在于方便菩提心很圆满，他总是想着别人。无论是善是恶，你的一念心生，这个信息遍布虚空世界。因为我们的心没有时间，没有空间，没有国界。「真实菩提心」就是明心见性。明白「如来藏」道理，你这个菩提心一发不可收拾。「发」即是成就、爆发，你想退没有退路，你都没有办法不成佛。一念明白十方法界万法都是你，就是供养了一切佛，你就是一切佛。</div><div class=\"text-indent\">你知道一切的万法都是当人当下一念变现，这是「性定」，「自性本定」。这是真正的「如来大定」，不可思议的「如来大定」，而不是「境定」79。你动也是定，定也是定，除了定你还是定；并不是通教禅宗修的那种虚空爆炸——什么也不看，在这里脑袋一片空白，但正念不忘。这种定不是如来大定。「如来大定」即空即有，即定即不定。定也好，不定也好，知道都是我，好好想想这个定厉害不厉害？</div><div class=\"text-indent\">明白道理就是吃了秤砣铁了心。现在很多人眼中所谓的禅定，认为就是两条腿一盘什么也不想，那是修「境定」；然后脑子出现一片空白，然后怎么样怎么样；或者看到天上的人在跳舞，在唱歌；或者去跟鬼神沟通。可是也有很多因此而走火入魔的。有些人看到天上飞的一个东西下来是个佛，一下他全部精神崩溃了：「哎呀，我看到佛了，看到观音菩萨了」，一把鼻涕一把泪地在那哭啊：「老佛爷，你救我啊！」在佛法里叫悲魔入心，明白吗？这一点很重要啊！</div><div class=\"text-indent\">那么成就了这种「如来大定」，你在定中也好，在梦中也好，就在清净中也好——天上飞下来一尊佛，地下冒出来一个鬼，你怕不怕呀？「过来过来，听我讲经说法」，是不是啊？始终是居高临下，管你是佛还是魔，我也没有必要去评价你——佛也是我，魔也是我。即使是原子弹爆炸，整个虚空世界全部毁灭，他还在那里如如不动，明白吗？这个肉团身我不要了，我们的那个灵体就是在原子弹爆炸中，它有没有什么影响啊？什么影响也没有。到时候我们可以现无量的色身三昧来救度众生，更不要说什么死亡不死亡，哪有什么死亡啊？真正「死」了的人，他没有死的概念。</div><div class=\"text-indent\">念根：小乘法也讲究精进呐，念念在道啊！就不能有一个妄想，什么叫打妄想啊？你念阿弥陀佛求生极乐，如果念个观世音……你都是打妄想，你都不能往生，你不能成就80。即使不打妄想你都不能成就，因为你不明白什么是阿弥陀佛，是不是啊？何况你不是这样，是不是更不能成就啊？有些人还自以为能修会修，能修什么啊？一边念阿弥陀佛，一边：「啊，我们到哪里去参加开光，到哪里去参加放生，到哪里去参加拜忏……」，这是杂修！你不是净土，还自己认命为净土。一句阿弥陀佛就是坐在这个念佛堂，你不要动，最多看看《无量寿经》光盘；但是我们修大乘佛法，时时、事事、处处皆是道场，是不是？你怎么样想都行，你只要明白了什么是佛，你怎么样修都行，多自在啊！</div><div class=\"text-indent\">有些人说，「我们就是一句佛号」，他是一句佛号吗？一会儿是一句佛号，一会是一句地藏菩萨号，一会儿又是观世音菩萨号，一会儿是开光，一会儿放生，一会儿又去抱小孙子，是不是？这是一句佛号吗？你真正是一句佛号，也还可以讲，是不是？应该一天到晚就是一句佛号，连吃饭都是送过来吃，一边吃着饭，一边「阿弥陀佛」；可你并不是这样，还以此来抗拒大法。所以要好好想想这种糟糕的局面呐！</div><div class=\"text-indent\">定根：摄心不散，一心寂定。不管大法小法，你果真能做到，总有瓜熟蒂落，水到渠成之日。你是修净土的，就定在一句佛号之中；你是修禅宗的，就定在这个如如不动、灵明不昧的境界中；你如果修外道火观，你就定在火中，吃在火里，睡在火里，把一团火丢到肚子里，它也不会把你的心肝五脏烫烂的，你自己已经是火；修水观，你定在一滩水中，把你扔到水里去，过个十年八年捞出来，你还是活的，因为你就是水了，这叫「定」。那修「如来大定」呢，我们知道，耳闻目睹一切万法都是我一心之所变现；然后烦恼习气现前的时候呢，「哎呀，谁是谁啊，谁不是谁啊」——他心里始终保持清净平等，在生时、病时、死时，它都是这一念，灵明不昧，多自在！这叫「定」，叫「性定」，叫「自性本定」。</div><div class=\"text-indent\">慧根：他在定中，清净心现前，这个时候他在某些局部方面知道了这部法的来龙去脉：禅宗见到那种空性；净土宗感受到相似佛那种自在的法味。那么这个「慧」还表现在自己在对周边环境的心态的调整。</div><div class=\"text-indent\">「五力」，就是「信进念定慧」五种力，前面的「五根」是打基础，在此基础之上加功用行，增长法力道力。大乘法很简单，即信、即进、即念、即定、即慧；他不历修证，一步登天，次第圆融。你不能讲它没有次第，或者有次第；但是他次第圆融于当下这一念。当下就是「信、进、念、定、慧」，你刻骨铭心知道万法都是我，这本身是不是定？是不是慧啊？</div><div class=\"text-indent\">七菩提分，又叫七觉分或者七觉支。所谓「七菩提分」，是以七种法能助菩提智慧增长：</div><div class=\"text-indent\">一者，择法觉支（支就是分），也叫「择法眼」，没有智慧你不会选择。我们不是要证菩提果吗？第一就要会选择。许多人不会选择，先入为主，这是没有智慧的。修行就是一个不断选择、不断否定、不断提升的过程。佛打了一个比方，两个人出门取宝，碰到一堆麻，每人挑了一担；再往前走碰到一堆绳，张三放下麻挑起绳走，李四嫌麻烦，我就是这个麻好；又往前走，碰到一堆布，张三又放下一担绳，挑起一捆布，李四还是一捆麻；再往前走碰到一堆金子，张三放下担上的布，挑走一担金，李四呢，到家还是一捆麻。现在有些人，「不行，我就是一句佛号」！你一句佛号怎么样啊？你真见性了，再去修也不迟嘛！自古以来成佛的法华，开悟的楞严，有什么理由可以拒绝？多少人念佛念到临死的时候还不知道怎么个长短。</div><div class=\"text-indent\">这第一菩提分就是要我们破除先入为主。什么叫先入为主啊？用自己知道的一点点可怜巴巴的东西把自己束缚起来，不肯越雷池半步，固步自封，画地为牢。上古时候没有监狱，谁犯了罪，周围画一个圈子，站在这里服刑，动就砍你的脑袋。我们是自己在画地为牢，让自己坐监狱。</div><div class=\"text-indent\">诸位，《阿弥陀经》从头到尾哪一句话讲唸佛就能够往生，你找出来，再不服气你把《无量寿经》拿出来。因为涉及到择，不得不讲这个法啊！之前有无量的法门，到了《妙法莲华经》，佛讲「唯此一事实，余二则非真」，只有《法华经》是真理，其它都是不究竟不了义的。《法华经》是王，《楞严经》是王，要懂得选择。不要先入为主，自以为是。不把《法华经》《楞严经》读懂，你所有的经都不懂，你不知道它在讲什么。所以「七菩提分」，第一法便是教你选择。</div><div class=\"text-indent\">太原有一对老夫妻在家里看了十几年光盘，自以为都懂了。一个偶然的机会，老太太到慈航净苑去听法，一个礼拜以后回去跟老汉讲：「老伴儿啊，我们过去都白学了，是自以为懂，我现在听了一个礼拜都懂了，你赶快去听师父讲经」。老汉听了几个星期，怎么样都听不懂，但是他有智慧，为什么别人听得懂？中间好几次都要打退堂鼓要走，想想不忍心走，万一这是真理，我岂不是白白地错过了？横下一条心看个水落石出，对也好错也好，要明白。两个月满了以后，一下子明白了，高兴得不得了。</div><div class=\"text-indent\">我经常跟一些修行人讲：你认可这个法也好，不认可也好，这都不重要，关键你要把它看懂，对在哪里，错在哪里。你不看懂，你讲是对，你讲认可，这是迷信，没有用；你没有看懂，你不认可，讲不对，这还是妄语。老佛爷临终之前教诲得清楚明白，就是没有人听！不惜千里迢迢，买飞机票，花时间到处去跑，而不肯把心定下来学习《楞严经》81。</div><div class=\"text-indent\">二者，进觉支。以勇猛之心离邪行，行真法。佛历来鞭策懈怠，懈怠的人不能成就。在此呢，也可以与前面讲的四大精进联系起来观照，选择最好的法门来进，并且不要懈怠。</div><div class=\"text-indent\">三者，喜觉支。它不是情执，是一种法喜，也可以说是一种「解脱知见」。我曾经遇到过先后有两三位菩萨跟我讲：「师父啊，过去我乐于助人，勇猛精进，就是有一条过不了关：对恩将仇报的人，我忍不过这股气；而现在这个关突破了——人家明明背后讲我的坏话，造谣毁谤，我发觉我怎么就恨不起来了？」大家明白吗？这个人已经成佛，是「分真即佛」。这就叫一修一切修，他这一关突破便关关突破，很简单。他清醒的时候是这样，梦中是这样，病中是这样，定中是这样，中阴身期间还是这样，这种习气伴随他生生世世。什么叫「证道」？这就叫「证道」。自己得到了这种感受，叫「解脱知见」。他清清楚楚明明白白，「我已经解脱」，根本不用怀疑，这就叫法喜，是不是？这种法喜是不可以用凡夫的心态来衡量。</div><div class=\"text-indent\">我们要开智慧啊！当我们想到要竭尽全力来建设正法道场，大力流通讲经光盘、圆教讲记，乃至连生命都可以毫不犹豫地供养众生的时候，你是真正解脱了。如果今天在火车站有一笔生意，只要去露个面，你就可以拿到一百万美元；但是今天师父在这儿讲经，有个人告诉你了，哎呀，你高兴得不得了，「我差点到火车站去了，还是到师父这里听经要紧。」这就是法喜。你明白自己已经解脱，已经开智慧。没有师父在这里讲经，你不妨去把一百万美元拿过来，行善积德哪里不能用啊？但是要权衡利弊。你能因此听一句大法，生一念欢喜心，佛在《法华经》讲——这比金银七宝满虚空供养无量佛的功德福报大无量倍，明白吗？我们要学会比较，学会印证自己，检点自己。听到有人侮辱我、诽谤我，却能如如不动，反而对此人生起怜悯心，你解脱了。</div><div class=\"text-indent\">四者，除觉支。这个好解释，除去我们的烦恼习气，除去我们错误的思想、错误的言论、错误的行为。这种烦恼习气在佛法里叫「思惑」。凭心而论，即使是不懂得佛法的人，他都知道好歹；可是要改变自己的烦恼习气，要有智慧，要有定力，要发大愿。绝大多数人不存在能不能改的问题，只存在愿不愿改。我经常劝导修行人，你可发愿半天、一天、乃至三天，这期间内，我就是一心想到怎样让别人快乐，怎样让周围的环境安定——没有一个念为自己。然后你再总结，哪种生活好？你一定讲是无我更自在，是不是啊？可是我们由于无量劫以来的烦恼习气，境界现前的时候，我们往往不是心能转境，而是心被境转。这就是一种懈怠。</div><div class=\"text-indent\">讲到现在，我不知道有没有哪一位菩萨按照这种开示，去体验半天或者三天无我的生活；如果有的话，请举手。你们感觉怎么样？是不是很自在啊？这一天有没有烦恼啊？你如果能把这个半天变成一个月，乃至变成一年，我告诉你啊，你的精神状态会大大改观。我希望更多的同修加入进来，进行这项自我实践。大多数人都是知道自己这个习气不好，又想改；但是呢，他讲改不掉。改不掉是假的，不愿改是真的。没有改不掉的东西，脑袋都可以给人家，这个烦恼习气你就扔不掉？所以叫作「除」。</div><div class=\"text-indent\">五者，舍觉支。舍跟除相似，但是意义各有所重。这个舍是舍去我们修行中的境界，不要执着，防止走火入魔82。不管是禅宗还是净土，修到一定时候会出现异常现象：闻到一股异香；看到各种各样的彩色光环；或者在梦中、定中或者大白天，看到地下冒出一尊佛；天花板掉下来一尊菩萨；墙壁里挤出一名仙人；或者看到经书每一个字都在闪闪发光；或者头脑里看不到人却听见有声音在跟自己对话等等这种种的境界。我们既不要去追求和攀缘，也不要恐惧，你只要任其自然，无动于衷。你要用心也可以，劝境界中的人听我讲经说法，跟我一起读诵，把他当成一个正常人一样问他，这都叫「舍」。往往出现这些境界，有些人忘乎所以，要么认为自己已经成佛、成圣、成仙，要么惶惶不可终日，认为遇到恶魔、恶鬼、恶神。</div><div class=\"text-indent\">那么这些现象是怎么出现的呢？《楞严经》讲得比较详细，不能一概而论。有些可能是佛菩萨来加持你；有些可能是过去世中的亲朋好友来鼓励你；有些也可能是冤亲债主变化成佛圣仙人的形象来戏弄你；有些呢，是自己的幻想成真，你脑子里对那些殊胜庄严的境界想得太多了，想象成真；有些呢，是自己过去世中的情况在这个时空点来重新出现；有些是你未来世中，未来几天、几个月、几年可能要发生的事情，提前让你知道。这些情况很复杂，不可一概而论。你如果再执着，必走火入魔。今天看到经书每个字闪闪发光，大喜过望，这下「成佛」了；第二天再读经的时候怎么还没有现光呢？嗳，一动念，马上又现光了，从此你一发不可收拾，各种各样的境界来戏弄你。你看到的都是花花世界，最后你神魂颠倒，这就是冤家债主捉弄你。这样的事情可多了！</div><div class=\"text-indent\">对这种情况「佛来佛斩，魔来魔斩」，那是禅宗的办法，对境界一概不理；圆顿大教则不是。对于一个明心见性的菩萨，是「佛来佛度，魔来魔度」，来了统统跟在老师后面好好修行，是不是？他带你到哪里，你只管去，不要怕，到哪里「如来藏」传达到哪里。真理是不可战胜的，在十法界战无不胜。你要我的命，给你；这条命一丢，马上又一个更殊胜的命过来，这叫「舍」。</div><div class=\"text-indent\">现在有些人修的什么什么宗，开了一个天眼，开了一个天耳，有了一个他心通，知道你前世，就尾巴翘到天上去了——讲你是走火入魔都还是抬举你，你还够不上走火入魔的资格，你是个小魔小鬼而已。鬼都有五种神通，你算老几啊？你就是能飞到天上去腾云驾雾都是外道！二十八层天的天人谁不会腾云驾雾、排山倒海啊！鬼都能拳打须弥山，打得粉碎。而智慧功德在于我们心性的提高，这就是妙法。</div><div class=\"text-indent\">所以「舍」是不是前面的「择」啊？用智慧来选择。观世音菩萨修耳根圆通法门的第一关就是「舍」，把所有的动相舍掉，然后进入静相。静相里什么也没有，胆小的人吓得要自杀。许多人在动相里就在执着，才到了第一关就不想走了，何况要过六关呐！</div><div class=\"text-indent\">六者，定觉支。跟五根五力的定区别在于：前者是讲质量，讲定力，讲道行，这里的「定」是作为一种心态的调节，可以用静止来解释，静下来什么也不想，保持一种心态。六个菩提分的前三与后三各有相似之处，前面的择也好，进也好，喜也好，它都带有动、观之义；后三个菩提分呢，除也好，舍也好，定也好，都带有静、止、不动之义。因为前三与后三有这么两个特点，所以出现了第七个菩提分，叫作「念觉支」。</div><div class=\"text-indent\">七者，念觉支。这里的「念」跟五根五力的念不一样，前者是表行持，修行不能只讲不干，只悟不行。这里的「念」是作为一种开关调节，特别是修禅定的同修，要好好把持。当妄念乱动的时候，选择「除、舍、定」中的一法，或者二法并用，或者三法俱用，把心静止下来，趋向于动静平衡；当我们比较懈怠、困倦、昏沉的时候，在「择、进、喜」三分里选择一分，或者二分并用，或者三分俱用，把昏沉的心提一提，趋向于动静平衡。这是修禅宗静功那种特有的心态用功，保持一种平衡，否则容易走火入魔。动得太多容易着喜魔、狂魔、快乐魔，心态太沉容易产生悲魔、死魔、病魔。</div><div class=\"text-indent\">佛在《楞严经》讲了修行中五十种阴魔境界，而古今中外能够把《楞严经》读懂听懂的人没有几个。那么从现在起，各位自己酝酿酝酿，你有没有愿望想把这部经读懂，这将解决你生生世世以来的大成就。无量百千万亿生生世世的大福报由今生把定。在《法华经》叫「以道受乐」，你生生世世都是大富大贵大智之人。</div><div class=\"text-indent\">八圣道分：指「正见、正思维、正言、正业、正命、正进、正念、正定」，也叫「八正道分」。这是证得小乘涅槃的八种方法和途径，是四圣谛中道谛的最重要修行方法。我们讲解「八圣道分」，是把大乘和小乘圆融起来理解。各位宜加用心，不可偏执。</div><div class=\"text-indent\">第一个圣道叫「正见」。「正见」就是佛知佛见（小乘法指四圣谛法，大乘法指一乘实相），与世间法相对照，属于世界观问题。所谓世界观，就是我们怎样从全局上、根本上、战略上来把握对世间万事万法的认知。世界观的改变是一个根本的改变，也就是讲心法啊！言为心声，行为心使，身为心役，一切都是受世界观的支配，叫「正见」，由正见才演绎出以下的七种正道。</div><div class=\"text-indent\">第二个圣道叫「正思维」。世界观是一种根本的知见，在其指导之下，我们对于自身以及对于周边的社会环境、人事环境、自然环境，怎样去看，怎样去思考，怎样用心来分析，叫「正思维」。</div><div class=\"text-indent\">第三个圣道是「正语」。不妄语，不两舌，不恶口，不绮语。一个人只要开口讲话，就是在做宣传，不是对这个世界的吉祥加持，就是对这个世界的污染。病从口入，祸从口出，往往造口业所受到的报应非常重。因为你污染了世界，污染了别人，要好好地把住口业这个关。起心动念必然有果报，讲出口来，果报要翻倍了。如果是正知正见讲出口来，就功德无量。佛法是平等法，就看怎样善用其心。</div><div class=\"text-indent\">修行人「相见无杂言，互勉念佛声」。在一起只谈修行，与修行无关之事不提，就念佛；只要是修行都叫念佛，把心放在道上，放在法上。当然也可以把它简化为就念阿弥陀佛，但这是皮毛而已；但讲阿弥陀佛总比讲无聊的话好一些。「你吃饭了没有啊？这几天打牌了没有啊？手气怎么样啊？」是不是啊？你这是在误导众生，误人子弟。不要讲人我是非，当然我们有备而去，有意度化一些人，你不妨用一些世间俗话跟他套近乎，这另当别论，那叫智慧。</div><div class=\"text-indent\">第四个圣道叫「正业」，这不是指正当的职业，而是正当的行为。即戒杀、戒淫、戒盗等行为善良、不侵害一切众生，就是「正业」。行住坐卧之中，以正念而住。</div><div class=\"text-indent\">第五个圣道是「正命」。特指修行人所从事的职业。在佛法里分两种业：一种叫「白业」，一种叫「黑业」。所谓「白业」，就是五金啊、蔬菜啊、织布啊，等等有益于社会、有益于众生身心健康的职业；那么如果是杀猪宰羊、贩卖肉鱼、开歌厅舞厅、开赌馆、涉及到杀生、伤风败俗的职业，统统叫「黑业」，必受恶报。</div><div class=\"text-indent\">职业，俗说为活命的手段，在佛法里有几种饭不能吃，叫作「四邪命」。</div><div class=\"text-indent\">一者，方口食。指修行人专门拉拢信徒，交际应酬，攀缘官府，攀缘大户人家，为什么？一开口，他供养的多。你找平民百姓，给你一块两块，他心里还沉甸甸的；你找大富豪，他十块钱拿不出手，一给就是一百，是不是？他能忖度众生的这种心理。禁方口食，这就破除修行人的贪心，当然，为了建设道场，教化众生，又当别论，看你的用心。</div><div class=\"text-indent\">二者，下口食。出家人自己种地、种菜，这是佛陀当年不允许的。出家人要托钵乞食，所谓「日中一食，树下一宿」。以令身心安稳，智慧增长。当然在佛陀的时代，社会环境许可，能做得到。现在的社会环境不可同日而语，已经发生了翻天覆地的变化。在大陆，甚至很多地方都看不起出家人，哪里能靠托钵乞食呢？没有这个条件了。在今天的泰国、锡兰等南传佛教国家和地区等还能维持这种修行方式，其它地方已经行不通了。佛法不是死板的，为了保持生命力，要做到因地制宜，因时制宜。</div><div class=\"text-indent\">三者，仰口食。在中国历朝历代都有一些人专门观测天象，在王宫中专门负责这一类的记录，这些都有历史记载。那么也防止一些修行人以这种习气来作为谋生的手段。比如说，占卜星宿、星相，为人说祸福吉凶，以此受人恭敬、供养。</div><div class=\"text-indent\">四者，维口食。通常指算命、卜卦、看风水、咒术这些事情，但这些学问凭心而论，它并不是假的，也是一种启蒙佛法。它能正确地分析一定时空点内的一些天人鬼畜、六道众生之间的恩恩怨怨。有些人出于正直，他以此帮助你排忧解难，劝你念佛学佛；有一些人以此故弄玄虚，诈骗钱财，叫「维口食」。这是讲「正命」。</div><div class=\"text-indent\">第六个圣道叫「正勤」或者「正精进」。「五根五力」的「进」是作为一种心态，「七菩提分」的「进」是作为一种力量。这里的「正精进」是表质量，不讲究质量，你越精进越糟糕，背离真心本来面目越远。</div><div class=\"text-indent\">第七个圣道叫「正念」。「五根五力」的念是表数量，表行，「七菩提分」的「念」是表一种开关调节，这里的「念」是表质量，这里对我们提出更高的要求。在小乘法中，以四圣谛、八正道、四念处等种种修行方法为「正念」，并能够保持它。如果你念佛时想吃东西或者想救人，再比如念佛时想到观音菩萨，这都是失去正念。因为你不知不觉心被境转。所以正念偏重于定学。</div><div class=\"text-indent\">在圆顿法中，只要明白「如来藏」的道理，你心开意解，头头是道。头头是道即是要求我们念念在道，境界当前，一念之观，想都不要想，自性就流露出分别智慧。富楼那尊者为什么说法第一啊？他就是正念，以音声轮教人，讲经说法想都不用想，出口成章，是表这个法。这是一种功夫，就靠我们时常提起观照。</div><div class=\"text-indent\">怎么「正念」呢？别人骗你五百万，你的烦恼心都生不起来，这叫「正念」。如果开始起了烦恼，然后想想，骗子是谁啊？我是谁啊？五百万又是谁啊？这就叫「正思维」。落入正思维已经比正念低了一个等级，这是我们成就的功夫。讲经说法也是的，往往我们讲了一个妙法的时候，不需要思维的，信口开河，讲了以后才知道自己讲的什么，这就是「正念」，叫自性流露。你如果照着稿子来念的话，不叫正念，最多叫正思维，不容易开智慧，也不容易叫别人开智慧。凡是自性流露的东西，特别容易与众生道交感应，这就是一种气氛，能够让听闻佛法的众生随文入观。所以佛的教体是演讲，对不对？不光是讲，还带有表演，这个表演就是自性流露，就是「正念」。</div><div class=\"text-indent\">第八个圣道叫「正定」。在「五根五力」的定相对而言也是表质量，但是那个质量比较小，是表事定。在「七菩提分」的「定」，它是表示一种心态相对的不动、静止。小乘法的正定从初禅到灭尽定都有，都是摄心一处，保持寂静，不向外驰散。这里的「正定」不一样，「法华三昧、楞严大定」是「一切禅定之王」，是「性定」，「自性本定」。唯有「法华大定、楞严大定」称为「正定」。所以各种各样的智慧最后要万法归宗，归「第一义谛之定」83。</div><div class=\"text-indent\">再讲「四圣谛」。道谛是专门对治集谛。集谛是造成苦报之因。所谓「灭谛」，这个灭也是通大小乘，小乘人灭分段生死——六道凡夫既有「分断生死」，又有「变易生死」，这两种虚妄之命——小乘人通过三十七道品那种修行，超越六道轮回，解脱肉团身这种分段生死。</div><div class=\"text-indent\">肉团身这种分段生死，可以从两种角度来观照：一种呢，从现量、现相来看，具足六根。包括那些畜生道在内，一段一段的生命，有形有相；第二种呢，从过去、现在、未来这种六道轮回来看，这段是人，下一段是鬼，下一段是畜生，下下段是天，怎么样怎么样……包括生生世世，它是不是一样的肉团呐？不一定。</div><div class=\"text-indent\">那么超越了这种分段生死的阿罗汉，他就是保持一个灵体；像四空天的天人一样，再也没有肉团身拖累——后者是在一定时间内解脱了分段生死，但是由于他的根本的那个三界六道中的粗重见思烦恼没有破除，所以时机到了以后，仍然不免堕落到肉团身这种分段生死。那么对于菩萨大士来讲，不仅破除了分段生死，而且破除了一分或者几分、十几分、几十分变易生死。这个「变易生死」佛把它分为四十二分。这是菩萨在修证过程中要逐步解决的问题。那么到了究竟如来果位，他破除了分段生死，而且破除了四十二分变易生死，那是真正的圆寂，那才叫真正的灭度。那么当证到佛果，注意，灭当下即是生。生灭的灭不是寂灭的灭；寂灭是没有生，没有灭，还没有中流。</div><div class=\"text-indent\">那么《心经》里讲的「无苦集灭道」，是指在空性如来藏中，没有苦集灭道这四个法——这是按照禅宗的修法——破除一切相，见真空之性。那么讲到究竟义，这苦集灭道不能说无，也不能说有，而是由我们的真心本性随缘现有现无。在苦集灭道这四圣法没有出世之前，它在不在我们心里啊？在。那么在显现为苦集灭道之后，四圣谛当下是不是我们原来那个无形无相的心啊？所以这个妙有，当下就是无形无相的真空。</div><div class=\"text-indent\">还是那个比喻：孙悟空摇身一变为茶杯，茶杯当下是不是孙悟空啊？在没有变茶杯之前，那个孙悟空当下是不是茶杯啊？作如是的观照。明白了「如来藏」的道理，你讲空，讲有，讲在，讲不在，统统正确，是不是？都是我们一个念。</div><div class=\"text-indent\">「无智亦无得」：这是讲菩萨法，开始涉及到智慧。严格地来讲，小乘法不能叫智慧，它属于世间善法。在佛法里呢，把修行的次第大体上划分为「人、天、声、缘、藏、通、别、圆」八个次第。</div><div class=\"text-indent\">人和天是凡夫法，修五戒得人身，五戒十善加四禅八定，可以得到天人果报；修四圣谛，证阿罗汉；修十二因缘，证辟支佛。声闻法和缘觉法既可以都说为小乘，也可以把缘觉法说为中乘。二者属于小乘圣人。藏、通、别、圆，这是大乘法；也有的把藏教也说为是小乘法——藏教菩萨发的方便菩提心很大，他要成佛，要出世度众生；但是他修持的方法跟小乘人几乎一样——修六度万行，行善断恶，在这个方面执着——但是他能发方便菩提心，这也涉及到智慧，但他不能明心见性。</div><div class=\"text-indent\">通教，是从空门而入，破一切相而归于真空之性。修得好他能证一分空智，但是只能证一分。那么别教呢，他证空智以后要从空出有，大做佛事，进一步破除无明微细烦恼。但是呢，他带有明显的次第性：从空出有，从有归空。他认为一个空如来藏可以成就无量的佛，以为用我们自性能够成佛，老子能够生出儿子来。他不懂得老子就是儿子，不懂得即相即性。所以他不能究竟成佛，只能成就十二分法身智慧。</div><div class=\"text-indent\">只有到了圆教才能究竟圆满，成就无量之智慧与德能。</div><div class=\"text-indent\">「无智亦无得」，在这里是表最圆融、最圆满、最究竟的智慧。怎么「无智」啊？连圆教见到的这个「一心三藏」的智慧，都要空掉。为什么？哪是你见到的？等你见到了就有了二，明白吗？你见也有，不见也有；不从见得，不从修得——所以说佛成佛以后，他还要破除中道之义：不住有，不住空，连中也不住。我们懂得了智慧，就是懂得了功德，以此智慧规范身、口、意三业，而成就我们的涅槃之德。那么成就了涅槃之德，有没有啊84？也没有！你成就也好，不成就也好，它本来就是。所以这个「无智亦无得」，解释为成佛、证涅槃、证菩提，不从修得。</div><div class=\"text-indent\"><strong>以无所得故。菩提萨埵。依般若波罗蜜多故。心无挂碍。无挂碍故。无有恐怖。远离颠倒梦想。究竟涅槃。三世诸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。</strong></div><div class=\"text-indent\"><strong>以无所得故：</strong>这是讲在我们因地修行时，证到的这种智慧、菩提境界。下面就说明我们的断德、涅槃德这种果位。</div><div class=\"text-indent\">这是从凡夫的五蕴、六入、十八界到二乘的四圣谛、十二因缘，再到菩萨的六度万行，继而破相归性，最后由「次第三藏」到「一心三藏」——在《心经》里把它说了个底朝天。用分别法和无分别法来次第圆融，这叫开权显实，权实并重，是不是呀？所以下面呢，这个《心经》就显得更加奇妙，我们一起来看。</div><div class=\"text-indent\"><strong>依般若波罗蜜多故：</strong>其实就是「以无所得故」，起强调作用。它都是讲因，以此菩提之因，证涅槃之果。</div><div class=\"text-indent\"><strong>心无挂碍：</strong>这个涅槃之果呢，也是一步一步往后引导。成就了菩提之果，明白了万法即是一念，他还需要再瞻前顾后吗？「碍」是从横向上来看，我们周边环境、人事环境、社会环境、自然环境，没有哪一样不是我——没有必要再在这里打妄想，搞分别执着；没有当下、当前这种障碍。这个「挂」呢，是从纵向上来看，想想过去，再想想未来。往事或喜或悲，在心里都是一种障碍；来日或喜或悲，往往牵挂在心里。所以无非是从三世十方、时间和空间，来看我们的心态清净不清净。</div><div class=\"text-indent\">世间法尚讲，人到无求品自高。不管凡夫还是圣人，你有求，就必有烦恼。那个求的心，当下就是一种烦恼。当明白不生不灭之法，我们对生老病死的恐惧就能放下；除非你是为了教化众生，你有必要长久住世，否则生命可以置之度外。跟大家讲，十几年之前我就求往生，但是现在，我还求多住世。求往生也好，求多住世也好，关键在于破除我执，你得自在。</div><div class=\"text-indent\"><strong>无挂碍故，无有恐怖：</strong>注意，「以无所得故」是表因，后面讲「心无挂碍」是表果。虽然是讲果，注意啊，前前为因，后后为果，果也有次第性，是不是？无分别不妨分别，因为心里没有挂碍了，所以也没有恐怖。最大的恐怖是不是对生死的畏惧啊？第二就是害怕一些坏人、妖魔鬼怪。那妖魔鬼怪变成谁了？它就是我们自己，你以为它在干什么？梦中也好，定中也好，最最清醒的时候也好，你看见佛从天而降，可不要去顶礼：「哎呀，我的妈呀，老佛爷呀，你终于来了！」而看到那个呲牙咧嘴、青面獠牙的妖魔鬼怪，你也不要害怕，都是你自己。吓唬你，你只要不理踩它，什么事也没有，你还可以居高临下度化他：「你不要作鬼啊，知道吗？你就是我，我就是你啊，好好听我讲经。」是不是？就怕你自己把自己吓死了。魔都是由心而起，你如果自己不清净，你甚至会把佛菩萨都当成魔。</div><div class=\"text-indent\">在《楞严经》「六交报」讲得很清楚啊，你想什么你就是什么；你把别人、别事想成什么，你就是什么，一定要明白。这个「无有恐怖」还包括没有攀缘；你一攀缘就会有恐怖。你对佛菩萨那种庄严相有非常强烈的攀缘感，你必然对鬼魔就有恐怖感。走火入魔者，就是因为这个原因。一般走火入魔的人很难自拔——他不认为自己是走火入魔，只以为是明心见性了，证果了。你去度他，他还认为你是嫉妒他，你是误解他。</div><div class=\"text-indent\">讲到真实法啊，所谓黄金白银、臭狗屎都是假的，明白吗？白天黑夜都是假的。轻与重、白与黑、光明与黑暗、香与臭，都是假的！都是我们的一种情执。你讲臭大便那么糟糕，对于狗来说却是美味佳肴；我们喝的这个水，鬼看到是火，天人看到是石头；我们看到的泥巴、水泥、混凝土，那鬼神看到是虚空；我们看到的虚空，天人看到的也是坚固的国土啊！</div><div class=\"text-indent\">这个法，注意啊，已经讲过多少次了，我都有点讲得不好意思了，可是这些法要反复讲啊！你每听一次，感受就不一样，你把《法华经》《楞严经》读懂了以后，你才觉得；「哎呀，原来佛比我师父还啰嗦啊，翻来覆去讲一个法。」明白吗？越是真理越简单啊！就是一句「如是我闻」，就是一句「阿弥陀佛」，万法都是由我心变出来的。你打一万个比方、一亿个比方，还是这个东西。本来就没有什么东西，是我们的妄想心变化出许多东西；可是许多变化出的东西用真理来讲，一句话就讲明了，你再讲来讲去，仍然是陈词滥调，问题是我们不懂啊！好好想这个道理，怎么叫「无有恐怖」？你有攀缘就有恐怖。这一切东西都是一个人、一个念。妖魔鬼怪呲牙咧嘴，他无非是要一条命；那就给你，然后我再换个好的肉团，我这个心它能吃得掉吗？相反，你生一念欢喜心，生一念感恩心，你这个生命层次又是更加殊胜。</div><div class=\"text-indent\">如皋引善寺常弘法师的妈妈，至今健在。当时大病送到医院里去，输水都输不进了，人家准备收尸啊，现在她很硬朗。因为她放下了生死，所以呢，生死就放下了她，是不是呀？她活过来了。世间法就是这样：胆大赢胆小，胆小赢不到。为什么？什么东西我都不在乎了。人到这个境界，他有什么恐惧呀？他得大自在。</div><div class=\"text-indent\">所以「心无挂碍」，你不要仅仅是理解为烦恼，连菩提都没有了，明白吗？菩提、烦恼是不是一个东西啊？你可不要说：「哎呀，我证到了菩提我怎么样。」你这就是一种执著；「我明白了一心三藏，我怎么样怎么样……」，你这是一种执著。但是「执著」与「解脱知见」要分开。「解脱知见」——我明明知道我解脱了，但是我不执著这种解脱，这有什么奇怪的？所以「无有恐怖」，是没有恐怖，也没有欢喜，这种欢喜是凡夫的情执。</div><div class=\"text-indent\"><strong>远离颠倒梦想：</strong>颠倒梦想就是烦恼习气，他有没有讲断除颠倒梦想啊？你能断除得了吗？断除了颠倒梦想，就断除了菩提涅槃。颠倒梦想当下即是菩提涅槃，都是我们自己。所以成佛成菩萨不在于你断除不断除，只在于你是否懂得烦恼习气，能否自在把握、转换烦恼习气。</div><div class=\"text-indent\">心外无法，法外无心。我看到有一个人解《心经》，讲得可好玩了——「远离颠倒梦想是指菩萨，但是佛呢，叫断除颠倒妄想。」这是曲解如来义。所以这个「远离」，是不是我们相隔一百里、一千公里叫远离呀？不是。你明白了它是颠倒妄想你就是远离，近在咫尺也是远在天边；反之，远在天边也是近在咫尺，关键是明心见性，当下得解脱知见。</div><div class=\"text-indent\"><strong>究竟涅槃：</strong>这个「究竟涅槃」呢，各个教门有各自不同的标准和解释：我们就不讲二十八层天的天人了，那都是凡夫外道啊；小乘人认为证得一个人我空，再也不在六道轮回，再也不现肉团身这种分段生死，证得那个自在的第七识，他认为就是究竟涅槃；那么通教乃至别教认为破相归性，破除了一切所有之相，证入那个空如来藏，认为就是究竟涅槃。</div><div class=\"text-indent\">那么圆顿大法，对「涅槃」的含义是从四种角度来分别解释：</div><div class=\"text-indent\">一者，自性清净涅槃，简单说为「性净涅槃」。十法界森罗万象、千变万化，没有哪一法不是涅槃，包括诸佛菩萨、天人鬼畜、牛马猪羊，乃至泥巴瓦块、风云雨雾。就拿当下这一个人来说，我们经常讲，宋朝人、唐朝人、秦朝人是不是都是我们啊？三皇五帝时代是不是也都是我们啊？大通智胜佛时代、威音王佛时代是不是还是我们啊？从无始以来，我们有没有哪一个死过一次啊？没有啊！比如这个茶杯盖，它从无始以来有没有死过啊？有没有生过啊？（没有）。在没有现相之前，它是不是一个念呐？我们一个念顽固地打妄想而有了地大，是不是？我们耳闻、目睹、身受，没有哪一法当下不是大涅槃，不管它承认不承认。</div><div class=\"text-indent\">不管是狗、猫、鸡、鸭，从究竟意义来讲，都是法尔如是，都是大涅槃；且这个大涅槃，万法都是一个念，万法都没有生灭，要这样来理解。过去、现在、未来，都是我们一个念，当下是一个念，过去是一个念，未来还是一个念。在没有现相的时候是一个念，在现了相以后当下仍然是一个念。</div><div class=\"text-indent\">再比如说，我们执著这个手掌的时候，是不是就忘记了两条腿啊？那么忘记了两条腿，两条腿当下是不是还是你呀？所以要破我们的分别心，回到无分别心。当你说：「哦，我不能老想手掌是我，那手掌、皮肤、后背都是我」，当下这一念是不是全身观照了？当下是不是回到本来面目上呀？这个比喻很容易搞明白啊。</div><div class=\"text-indent\">我们的妄想心，打个比喻来讲，叫调虎离山，离开了什么山啊？涅槃山。所以佛开示宇宙人生的真理，再让我们回到涅槃山。我们既然能够出来，是不是就能够回去呀？有来路必有去路。这是讲第一种涅槃，叫「性净涅槃」。不管你承认不承认，你都是大涅槃，明白这个道理，功德不可思议呀！你当下解除对于死亡的恐惧感。</div><div class=\"text-indent\">二者，有余依涅槃。余了什么？余了这个肉团，依了什么？还是这个肉团，干什么？来度众生，但他已经证到涅槃了。佛当年三十一岁证果，讲经四十九年。佛这四十九年的住世，就叫「有余依涅槃」；在三十一岁他已经成为圆满之佛，但是肉团身还在示现。那么依样画葫芦，我们现在是不是叫「有余依分真即佛」呀？我们明白这个道理，即已证到分真即佛，但仍然要依靠肉团身来弘法利生，或者进一步成就自己。</div><div class=\"text-indent\">「分真即佛」，简说四十二分，细说六十个圣位。再细细细细说，每一个位都有无量的等级。在《楞严经》里提到的波斯匿王，他是四地菩萨到婆娑世界来，已经是一万次；这一万次都是四地菩萨——也就是说四地菩萨最起码可以分一万个等级，乃至一百万、一万万、一亿亿万个等级，明白这个道理，对我们勇猛精进，至关重要！你多听一堂课，可能就会增加一百个等级；你多念一句佛号，可能就会增加一个等级，大家明白吗？不能懈怠，连走路都要念佛、观照。</div><div class=\"text-indent\">不要以凡夫的心认为：《心经》我听了好几遍了，不用再听了。不管是谁，他每讲一次课，境界相应都会提升一次85；即使他每次讲的都一样，听课的人未必就是一样，看光盘看比不看好，一般而言，你看十次光盘，都比不上亲自到现场来听一课。大家在一起，这个磁场的力量不一样。</div><div class=\"text-indent\">三者，无余依涅槃。佛当年八十岁的时候，在菩提树下以三昧真火焚化自己，从此这个肉团身在世界上消失，叫作「无余依」；而此时的涅槃，叫「无余依涅槃」。这种涅槃呢，归于空性大光明藏，而离开了妙有大光明藏。注意啊，这都是分别说，他离开了没有啊？（没有）。现在一般人理解的涅槃，都是指无余依；他不懂得「性净涅槃」，不懂得「有余依涅槃」，更不懂得后面还有第四个涅槃。</div><div class=\"text-indent\">四者，无住涅槃。怎么无住呢？既不住涅槃，也不住生死，还不住中流；中流既不是生死，也不是涅槃。那么有人讲，既然无住，到哪去了？注意啊，这个无住是对世间的分别法而言：世间的分别法执此非彼——有了生死，他认为就不存在涅槃；有了涅槃，好像就不存在生死；有了中流就没有生死或者涅槃。所以是针对世间那个分别法说无住，无住就是……这个话可难讲了啊！无住就是破除了一切分别，这是不是证到无分别呀？所以这个无住当下是不是就是无所不住啊？你不要以为归到大光明藏的那个是佛、现肉团身的那个是佛，或者也不现肉团身、也不现这个大光明藏的那个时候中间那个东西是佛——你这样认为，都是在打分别妄想。</div><div class=\"text-indent\">所以到了「无住涅槃」，就是无所住而无所不住啊！生啊，死啊，涅槃啊，风云雨雾啊，黑白长短啊，有相无相啊，没有哪一法不是诸佛如来法身真常。好好想，你现在当下是不是释迦牟尼啊？是不是阿弥陀啊？这个茶杯，这个茶杯盖，这个话筒，这个风啊、云啊、雨啊、雾呀，当下是不是释迦牟尼呀？当下是不是你自己啊？都是啊。就是因为我们自己的我执和妄想分别心自我隔离，自我束缚，而不得解脱。</div><div class=\"text-indent\">当年有一位年轻人跪在那里向佛求法，说：「佛啊，您帮我解脱吧。」佛摸摸他的头说：「是谁束缚你了？」好，他就是听了这句话开悟了，说：「佛啊，我解脱了。」有根机的人就这么简单，谁束缚你了？是你自己把自己束缚起来了。</div><div class=\"text-indent\">佛不度人，唯人自度。佛只是把这个道理告诉众生，要度是你自己度自己。他只是作为一个过来人，把过来的路告诉你，就是这么回事，信不信由你。所以我们明白了「无住涅槃」，你想一想，世界万法哪一法不是我们真心本来面目啊？只要你自己放下我执，放下烦恼习气，调整自己的心态，当下回归大光明藏。</div><div class=\"text-indent\">我们有时候对于一些烦心事，是不是越想越烦恼啊？一旦看破放下，你当下是不是感到自在了？就看你怎样想，你要会用心。其实烦恼本来不是烦恼，你把它当成烦恼，叫庸人自扰，世间有句俗语——君子坦荡荡，小人长戚戚。</div><div class=\"text-indent\">西方心理学家曾对养老院的两个老人做了观察。一个人呢，不管到哪里，那都是走得非常神气，西装直挺，皮鞋锃亮，走起来「通通通」，像演员出场一样；要坐的话呢，掏出一块雪白的手绢把那个擦一擦，看有没有灰尘，这个人大概活了五十二岁。另外那个人呢，可能成年累月都不洗澡，身上臭气轰天，衣服是破破烂烂的；累了，随便往泥巴地上就坐下来，然后就吹牛：「老子天不怕地不怕，那个张局长被我揍过三次」——就吹牛，是不是？他胸无城府，知道吧？所以这个人写报告的时候，已经活了八十三岁。</div><div class=\"text-indent\">大家悟到了吗？越是自命不凡，认为自己怎么庄严的人，命短，为什么？他活得太累，处处都要显示一种不平凡的气氛，有那个必要吗？这都是装出来的。当然后面那个人我们也不可取。这种人跟无赖一样，但无赖往往也能得到长寿，是不是？我们要把这两种处世之道圆融起来。心里坦荡自在，不要刻意地装模作样。一个人果真心地很柔软、很平和，他走到哪里都是佛光普照，为什么？你自然而然流露出那种不凡的气质。</div><div class=\"text-indent\">成就我们自己的心不是靠装模作样，你必须有自知之明。不是靠争强好胜，把自己的道树起来，不是的。道，就是你一种自然的品质，你自己知道，别人也知道；你一定要相信，你的心跟别人的心是一样的。你知道你有道，别人也知道你有道，明白吗？否则你打肿脸充胖子，到最后只会徒增烦恼。直心是道场。不管是谁，装模做样都装不起来，因为所有的人都是一个心。当我们明白了这四种涅槃的时候，是不是学会了怎样用心呢？万法无非是一个念，这是真正的涅槃。</div><div class=\"text-indent\"><strong>三世诸佛，依般若波罗蜜多故，得阿耨多罗三藐三菩提：</strong>这句话跟前面的「菩提萨埵」，含义完全一样，换一种口味而已。「三世诸佛」是不是「菩提萨埵」啊？过去佛、现在佛是已经成佛的菩提萨埵，未来佛是尚未成佛的菩提萨埵，是不是？都是「菩提萨埵」，都是「一个念」。所以「三世诸佛，依般若波罗蜜多故，得阿耨多罗三藐三菩提」，这句话是重复提醒，加重语气，以显示出这句话特别重要。前后经文反反复复讲这个法，我们要高度重视啊！</div><div class=\"text-indent\">曾经有一位居士请法，说：「师父呀，我们在拜佛的时候，那些狗啊，猫啊，在拜垫前窜来窜去，如法不如法呀？」我说：「这个最如法，比什么都如法。」这位菩萨讲：「我们还拜猫和狗啊？」我说：「你们拜什么佛啊？是不是拜三世诸佛呀？」他说：「对呀。」我说：「那三世诸佛的过去佛、现在佛、未来佛，未来佛是谁呀？」他明白了：「猫狗都是未来佛呀。」「那你拜它们如法吗？」「嗯，如法。」不仅猫、狗，连毒蛇猛兽、乌龟王八蛋、臭狗屎，我们都要拜。</div><div class=\"text-indent\">同样是拜佛，各自心态却不同。有的是以烦恼心来拜佛，「赶快拜佛，马上要上班」；有些只把释迦牟尼佛当成佛，把阿弥陀佛当成佛，把自己当成凡夫——这种拜佛有福报，没有功德；还有一种拜佛是拜虚空法性佛，你功德无量——一切万法都是佛，你拜，不知不觉扩大了心量；还有拜冤亲债主佛，把自己最恨的人、最讨厌的人写牌位供在那里，天天拜，强迫自己对他生欢喜心，那个你最恨的人是谁呀？他就是你，你是恨自己。我们不能讲那口头禅时，讲得呱呱叫，遇到具体事情就习气丛生，不由自主；恨不得咬牙切齿，你还修什么行呀？三世诸佛啊，是指一切有情无情众生。没有哪一法、没有哪一人，不是依《心经》「如来藏心地法门」来成就自己。</div><div class=\"text-indent\">正如文殊菩萨在《楞严经》所讲：<strong>十方薄伽梵，一路涅槃门</strong>——没有第二个门，没有第二条路，这就是般若智慧。有些人特别是对「无情也能成佛」这一点很难理解，那无情本身是不是佛啊？它是不是我们的本性啊？但用分别法来讲，依报随着正报转。一般而言，无情要转为有情以后才能成佛。讲转为有情也是方便说，它本来就是有情，也就是说它的智慧等级要一步一步地提升。那这个茶杯有没有见闻知觉啊？有啊！</div><div class=\"text-indent\">佛在《楞严经》讲那个枭鸟，就像猫头鹰之类的这种鸟啊，还有镜兽鸟啊，它搞一个泥巴团，搞一个水果放在怀里入定，然后就发心：这个泥巴块做我的儿子，这个水果做我的儿子，你知道我讨不起老婆啊，你给我做儿子。然后呢，这一念心感应，这个泥巴块、这个水果就变成有情，变成跟它一样的鸟86。</div><div class=\"text-indent\">日食、月食的时候，你看不到光亮，那光有没有啊？有啊。这也是天象变异呀。那么这个时候，一些泥巴瓦块、树木花草在这些日月之精华从上到下经过的时空点啊，当下摇身一变为天仙鬼怪。佛为了恒顺众生的习气，硬是把我们的一个心、一个情，分成无情和有情，这是方便法；要不然一开始讲都是有情的话，许多人不会认可这个法。</div><div class=\"text-indent\">那泥巴瓦块、树木花草，变成有情以后，要不要愁它成不了佛啊？它已经转为有情身。注意，有情也能转为无情，那就可悲了，那连畜生都不如啊，连地狱的众生都不如啊！</div><div class=\"text-indent\">过去所谓「望夫石」，不是神话传说啊！这是真实记载：一位妇女，站在海边等待自己出海打渔的丈夫归来，一批一批人家回来了，始终见不到自己丈夫人影，所以精神崩溃到了极点，当下成为一块石头；而且那个心呢，始终执著那块石头就是她。类似这种情况是极少极少极少，但不是没有。有情化无情，无情化有情，因为都是我们一念心呐。</div><div class=\"text-indent\">「得阿耨多罗三藐三菩提」，这也是最常见的一个名相概念。如果简单地把它用汉语来对照解释，那么：「阿」就是「无」，「耨多罗」就是「上」。这个「三藐三菩提」是按照梵文音译过来的，「三」就是「正」，「藐」是「等」，「菩提」是「觉」。所以「阿耨多罗三藐三菩提」这句话翻译成汉语，叫「无上正等正觉」。一切万法依照心地法门，皆能成就无上菩提之果。在这里是讲菩提之果，前面是究竟涅槃，互为说明。</div><div class=\"text-indent\">在佛法里，有时候菩提和涅槃同时出现，我们分别说为「智慧果」和「涅槃果」，「智慧果」叫「智德」，「涅槃果」叫「断德」；有时各自单独出现，我们也要分别解释为两种功德——就跟解释「心」和「性」一样：「心」和「性」同时出现，可以把「心」解释为「体」，把「性」解释为「用」；如果单独以心，或者单独以性出现呢？我们都要解释为体和用，这个要注意一下。</div><div class=\"text-indent\">下面，对这个「般若智慧」，我们从它的本体、力用、范畴，这几个角度来展开观照。</div><div class=\"text-indent\">首先呢，它的本体就是「阿耨多罗三藐三菩提」，一般解释为「无上正等正觉」。这里呢，它包含三个层次：第一个层次，就是「正觉」。正觉呢，它首先从了生脱死的小乘圣人谈起；有了正觉，我们就可以破除三界六道中那种粗重的见思烦恼（佛法里称之为粗惑，也就是贪、嗔、痴、慢、疑），而证得阿罗汉、辟支佛以上的果位，永远不落六道轮回——这是「正觉」，与「三菩提」相对应。</div><div class=\"text-indent\">三藐三菩提，就是「正等正觉」。这种菩提属于大乘智慧，已经明心见性。它不仅破除了粗惑，而且破除了小乘果位上那种细烦恼，也称为「尘沙烦恼」。</div><div class=\"text-indent\">到了「无上正等正觉」，是表究竟如来果位的菩提。「无上」，它没有上下、内外、左右、前后，没有空，没有有，无住无不住。从这个角度来讲啊，还必须对我们当下、周边所能耳闻、目睹、身受的一切的万法，包容起来观照。</div><div class=\"text-indent\">那么，「三菩提」是「正觉」，正觉往前是「正等正觉」「无上正等正觉」，那么「正觉」往后，还有外道的「邪觉」、凡夫的「不觉」以及无情的「无觉」。那些东西是谁呀？他们当下是不是「无上正等正觉」啊？通通都是。只是一层迷悟而已。</div><div class=\"text-indent\">「邪觉」呢，包括二十八层天，包括歪门邪道；这里是指有情有义的那种修行人，他想修行，摆脱现状，而且这些人都深信因果，深信三世六道轮回，他仅仅是认识不正确而已——这种人叫「邪觉」。他能修行，而且修苦行，乃至他修行的那种精进力度啊，比修正法之人要大得多，乃至大无量倍；但是如果方向不正，你越勇猛精进，反而遭受果报越重。你说这个问题伤心不伤心？冤枉不冤枉？有些人自以为是修行，其实是在修邪行。</div><div class=\"text-indent\">「我执」就是一种「情」，在《楞严经》叫作「想升情坠」，由不得你的。你自己就知道自己的心情沉重不沉重，为什么沉重？无非是情执。自己、父母、儿女、好朋友，这是亲情、恩情；我看不惯一切的东西，这是怨情。你带着这种情执会越修越糟糕，越修情执越重，你总是「我要怎么样，我要怎么样」。还有一些自以为会修行的人，乃至连父母儿女都能放下，他念佛特别精进，持戒特别认真，他念念想的是「我要成佛，我不能犯戒」。这样修，越修我执越重。</div><div class=\"text-indent\">你能够在这里听经闻法，一般来讲，与你今生今世没有关系的。这是你前世修得的福报，由护法神在暗中帮你调理一下你们家庭成员之间的关系，他们或者支持你们，或者不是过分地反对你们。你如果没有前世修来的福报，没有宿世善根，你连这个道场的门一步都进不了；可是你今生今世的所想所为决定你来世的报应。许多人修行多年，对这些问题竟然一无所知。</div><div class=\"text-indent\">修行人要把握当下呀！你带着我执，带着烦恼习气，你就是读《法华经》《楞严经》，自以为是读懂了，其实还不懂。只要你把持一下自己的心态就知道：你怎么样看待别人，看待周边环境？名、闻、利、养、贪、嗔、痴、慢、疑，我们自己一检点就有啊！修行人最大的毛病：一种人容易自以为是；一种人容易自以为非。这是两种心态。</div><div class=\"text-indent\">自以为非的人，一般地属于那种比较精进、比较正直的人。他总是感到自己不足；他都不敢相信自己能成佛，甚至还来诽谤正法。我就有这样一个弟子，他既会讲经说法，而且非常严于律己；所以造成了逆反的心态，他看不起别人，乃至不相信「见道当下成佛」这个法。这就很可悲，所以他传法不能成就人，而且造成了恶劣的影响，这种人很可怜。自以为非反过来是不是也是自以为是啊？他总感到自己不足、不足、不足，总感到自己没有成就、没有成就、没有成就。他所认为的正法是那种方便法——解行并重。自以为是啊！可是圆顿大法，就是不历修证，一步登天。这是诸佛金口玉言，是祖师大德金口玉言。</div><div class=\"text-indent\">另外一种就属于自以为是的人，属于典型的下劣心。他总认为自己是对的，用牛羊眼来看待一切的人、事、法。他不知不觉地把自己的心就污染成乌黑的，很可怜啊。非但没有自知之明，他还好为人师。</div><div class=\"text-indent\">那么要解决这个邪觉啊，最根本的根本就是必须把「一心三藏」这个道理契透，你懂了没有？信了没有？连泥巴瓦块、臭狗屎，我们都要有恭敬心、平等心、尊重心，更不要说牛、马、猪、羊、小老鼠这些畜生，我们更应该有慈悲心。何况人与人之间，更何况同修与同修之间，更何况老师与学生之间？没有什么好讨价还价的，你必须搞清楚；要么你就甘心情愿受果报去。</div><div class=\"text-indent\">「地狱门前僧众多」，这个僧众不仅仅是指出家人，也包括修行人团体组织；有出家和在家四人以上就可以叫「僧」——过去有人光讲「地狱门前僧众多」是指出家人，这是片面的。地狱门前往往修行人还多，你说冤枉不冤枉？可是你不修行也不能解脱啊，修偏了就变成邪门外道。因为你的心很执着啊，有些人不修还好，越修反而越坏。他那执着心、贡高我慢心、仇恨心还越修越深，不修行反倒不会这样呢。修行人修出嗔恨心来，你下无间地狱。谁也没有叫他下，鬼也没有叫他下，佛也没有叫他下，是他自己的这个心自然地道交感应。</div><div class=\"text-indent\">佛在因地当年为了护生而没有听他妈妈的话去出海打渔，他妈妈拽住他不放，他就踢了妈妈一脚，因此而下无间地狱。可是到了地狱里以后，他看到小鬼抽筋剥皮时，慈悲心油然而生，正准备开口讲话，想自己来代人受过，还没有开口就飞到天上去了。因为一念慈悲心生起的时候，与地狱的气氛又不相适应。</div><div class=\"text-indent\">命自我立啊！全靠自己把握。你还需要佛给授记吗？如果你对一切众生充满了慈悲心、平等心，我跟你讲啊，你回家睡觉去，你不要听我啰里啰嗦的，你一定是在极乐世界。有道无道，自己知道。而且刻骨铭心知道一切万法唯我心所现。你到了这种心态还不成佛，那我去做鬼！如果你确定自己还达不到这种心态，你不要等，没有什么好等的。叫你来修行是修自己啊，不是叫你去修别人啊（修别人也可以，你应该是去帮助别人）！好好反省自己，要吓出一身冷汗来，你或许还有救。要不然将来啊，本来路是平的，你可能把路走得竖起来了，你四处碰壁。</div><div class=\"text-indent\">邪觉邪觉啊，有人是百分之百的邪，有人是百分之九十，有的是百分之三十，多多少少有些邪。有朝一日，比如说我由于各种各样的原因，甚至被关在监牢里了，你们对这个法还信不信？自己要问自己，这就把话讲到底了：依法不依人。佛在《地藏十轮经》讲：我叫你亲近的那种破戒比丘，他戒坏见不坏87。你认为他坏，他未必就是坏；他戒坏见不坏，仍然是人天师表。佛在《法华经》讲，你讲受持《法华经》的人的过错，无论讲得对错，你都受恶报。《法华经?普贤菩萨劝发品第二十八》是不是有这一段呐？<strong>若复见受持是经者，出其过恶，若实，若不实，此人现世得白癞病。</strong>他就是真有过失，你都不能讲。佛是把话讲到底了。</div><div class=\"text-indent\">许多人还想跟师父来个平班对口，还要个你是我非。我告诉你，师父对也是对，不对也是对，没有你讲的道理，明白吗？要不然你就不要来当我的弟子，不要来当我的学生。师父做好做坏，你只能往好处想；你不是那个境界，你没有那个资格和权力在那胡思乱想，胡说八道，乃至诽谤师父，诽谤道场。我今天在这里讲就已经给你消除了一半的业障，你还应该感恩，是不是啊？你不要说：「你怎么老是对着我啊？」我这是不是对着哪一个啊？有不少人都有这种习气，可是往往他们就是认为讲他一个人，你真是叫师父有口难辩呐！</div><div class=\"text-indent\">张三李四闹矛盾找到我这里，张三来五十大板，李四来五十大板。张三认为我偏袒李四，李四又认为我偏袒张三。你们将来做师父，你们就知道很难；都是以下劣心来看待师父。从来没有哪个告状的人，我会对他讲：「哦，你最好，那个人坏透了，我们一起来惩办他。」我有没有这样跟任何人讲过啊？当你到我面前，我如果讲：「哦，你最好，你完全没有错，完全是他错了。」我告诉你，就意味着你不可救药，师父对你已经无可奈何，所以把你打发走就算了。我可是把心交给你们，明白吗？我敢打你，骂你，讲你坏处的时候，说明你还有救。我如果讲：「哦，你没有错，都是他错了」，那就是我把你看透了，佛都度不了你，你给我滚远一点！要知道好歹啊！你有一点点善根，都应该感慨万分。</div><div class=\"text-indent\">为人弟子就是弟子，将来我师父来，你们好好向我的师父了解了解你们的师父——我当时是怎样当弟子的。我不管师父在会上讲什么事情，凡是讲的歪风邪气，与我有边的，我马上就跪下来向师父忏悔，师父哈哈大笑：「与你一点点关系都没有。」我说：「不，师父。我有这个毛病，谢谢您的指教，我忏悔。」我们现在有些人也是在琢磨师父，一讲：「嗯，可能又是我，又有谁在告黑状了？」马上就来质问师父：「你讲的是不是我啊？」就有这样的弟子，还不是一个两个啊，成何体统？！如果你知道讲的是你，你应该忏悔！如果不是你的话，你应该引以为戒，应该感恩！</div><div class=\"text-indent\">经典上反复讲：弟子顶礼佛陀以后「退坐一面」；你就老老实实只有听的份，没有开口的份，明白吗？而不是咄咄逼人。有这样习气的人啊，你要赶快忏悔改正。</div><div class=\"text-indent\">一个真正对学生、对弟子负责的老师，他不光是进行理论的教育，他还要观察道场，观察弟子的心态，要不失时机地、有针对性地来进行教育，否则就是隔山放炮。我在这儿讲经，不是叫你们用这个劳动模范、优秀党员、优秀公务员……我不是要你赞扬我怎么怎么好、怎么慈悲、怎么正直。我只是要求你们用正法来衡量我，能不能经得起《法华经》《楞严经》检验？能不能帮助你开智慧？</div><div class=\"text-indent\">我在这里少说也遇到十几次大的风波；我都是如如不动，谁也没有把我怎么样，我单枪匹马闯山西，遇到多少地痞流氓，你们怎么知道啊？这些都是对我要下手，乃至绑票、威胁之类——喂，拿十万块钱送到五一广场来……像这样的情况多得很呐！我默默地用智慧来跟他们周旋，用尽了种种的手段，来对付这一切的邪恶势力；这还不能讲，讲出来又是一种人我是非。你们看看师父那里，一天到晚门庭若市，谁能知道师父的心里有多大的压力！多大的负担！一个个还不知好歹，为了你们一点点鸡毛蒜皮的事情纠缠不清。有些人甚至电话接迟了一点，有时候来不及接，他还有意见。你们就这样来理解师父啊？有时候要三个手机一起接通。有些人可狂妄呢！这个师父可难当呐！一人难称百人心！</div><div class=\"text-indent\">法华道场现在少说也有上万同修，你是真心修行的，应该帮助减轻师父的烦恼，不要再火上浇油。师父不是哪一个人的师父，不是哪一个家庭的师父，不能用世间的观点来看待师父。我这个眼睛就是春节那一个月，发信息把眼睛搞坏了。有些人发过信息来，我没有回信息。有些并不重要了，或者有些是无聊了，他竟发信息责问：「你为什么不回信息？」到底我是师父，还是你是师父？把自己当成了法官，师父就变成犯人了，天理何在啊？！好好检点一下我们自己。我再问你：我这样做，是为你好还是为我好啊？真要知道好歹呀！你们根本无法理解师父承受的压力。这是讲这个「邪觉」。</div><div class=\"text-indent\">再往后是凡夫的「不觉」。这个不觉就是不懂得修行的人，连鬼啊，神啊，来世啊，压根都不相信的人，这叫「不觉」。虽然是不觉，他叫不叫觉啊？他为名闻利养而奋斗，也叫觉呀！</div><div class=\"text-indent\">在某种意义上，我们度那些不觉的人，要比度邪觉的人容易得多。前者呢，是一张白纸，只问他来不来，来就能成就。三天之前，我发信息给一个叫朱文娟的居士，她现在培训佛学启蒙课，我说：「我感谢你。」因为她曾经告诉我：「师父啊，即使不信佛法的人，听了这个法也能当下信佛，当下成就。」我说：「由于你提醒了我，你这个建议现在已经大成就，印证了你不可思议的智慧。」确实感恩她，不是她的话我还不敢这样讲。</div><div class=\"text-indent\">你们看我后来几场讲《过五关度六将证菩提》之前，特别强调：把那些从来不信佛法的人，到最后圆满的时候请来，叫他当下成佛，自己印证自己成佛。在江阴，平时听课大概二百人，到最后增到五百多人；在扬州平时听经是一百五左右，到最后一天增到四百五十人；是平时的三倍以上。两个小时课下来，四五百人除了几个没把握，到最后全部认为自己就成就了。为什么？真理不可战胜。</div><div class=\"text-indent\">所以我这次讲《过五关度六将证菩提》，应该感恩这些佛菩萨，是他们逼着我走投无路，我本来一部《佛说阿弥陀经》也要讲一个礼拜，《心经》也要讲一个礼拜，结果逼着我用两个小时的时间概括《法华经》《楞严经》的精华。如果从成就人的角度来讲，这两个多小时的《过五关度六将证菩提》，已经足矣。这次在扬州我又讲了一遍《如是我闻真实义》，也是两个多小时，一百九十四个人好像最后只有七八个人还没有明白，其他人当下成就。这是非常适合于末法时代众生的教学次第。</div><div class=\"text-indent\">希望各位把这个《过五关度六将证菩提》《如是我闻真实义》，看得滚瓜烂熟，然后发心讲给别人听；但是讲的时候不需要咬文嚼字，要变成自性流露，用你自己的语言讲出来就行。每个人都能讲啊！可以变成家喻户晓，变成家庭教育的第一经典。随便拿出一个茶杯盖，拿出一个苹果：「知道吗？这是什么东西？这就是阿弥陀佛啊！」你就能叫人当下开智慧。</div><div class=\"text-indent\">这个《过五关度六将证菩提》看一百遍、一千遍、一万遍都值得，都不冤枉，直到你刻骨铭心，深信不疑；一关一关地变成你自己的语言讲出来。你生生世世的果报不可思议！在讲的过程中你当下把这个心调整得非常慈悲，非常平等，非常柔顺，非常光明；而且你变也变，不变也变，你没有办法不变，不是我劝你变，是你潜移默化地变。真理就是这个东西，不需要别人去婆婆妈妈怎么劝，怎么劝；只要搞明白了，他自己就会行动起来。你如果带着轻慢心，带着逆反心理的话，我劝你不要看，否则会增加你的罪过。当然我这也是激将法呀，明白吗？即使增加了罪过，你也能因此而解脱，与正法结恶缘也得解脱，但受苦是免不了的。</div><div class=\"text-indent\">这是讲「不觉」，当然不觉也是一种邪觉。讲不觉，是用分别法说，这种人对修正法、修邪法的人统统不认，他在搞名闻利养，是不是也是一种修行啊？这种叫修恶行，修轮回行。</div><div class=\"text-indent\">那不觉之外也涉及到「无觉」，无觉就是我们讲的无情众生，方便说为无觉，那它到底有没有觉啊？有觉。这个世界上没有一样东西是死东西，都有灵知性，仅仅他这种觉悟的层次、这种思维的能力比有情相对而言要弱，弱得多。有情无情、有觉无觉都是我们当人当下一个念而已。</div><div class=\"text-indent\">无觉要了生脱死，他首先要转变为有情。大家可以把《过五关度六将证菩提》第六关「无情亦情」，多看几遍。要懂得我们面对的山河大地、树木花草、乃至臭狗屎、臭垃圾，这些东西是什么东西。要调整这个心态可不容易啊！而且我们所认为的垃圾，对天人鬼畜它是垃圾吗？对于那些垃圾堆的小爬虫而言，这就是它的极乐世界。是非好坏、美丑、酸甜苦辣都是我们的妄想心在执着，包括我们喝的这个水都是假的——我们喝的水，在天人看是块石头，鬼看到是火啊；连白天黑夜都是假的，都是我们的妄想所造成；包括我们这个肉团，真是这回事吗？用不同的心，可以使它当下成为一滩水，或者是一团火，或者是一股风，或者是一片虚空，或者变成一棵树，或者变成一只鸟。只问你会不会用心。明白这个心法很重要啊！</div><div class=\"text-indent\">今天早上还有一位菩萨发信息给我说，因为女儿住院，没能更好地救护她，落下心病，问我怎么办。这个法用《心经》很好解释啊！生死是假的，哪有什么女儿，哪有什么你啊？三岁的小孩子死了，八岁的小孩子死了，未必就是一件坏事，他与你只有三年、八年的缘分，她因此也可能升天作佛菩萨，也可能下三恶道。你不了解这个情况，为什么一定要去伤心啊？一切都是无常，你把握住当下即是。你如果仍然活在这种情执里，你自己要受报应，谁也救不了你的命。真正明白了一切万法都是我一个念所变现的，有什么好执着啊？这里哪一个不是你的女儿啊？哪一个泥巴瓦块不是你的女儿啊？女儿就是一股风，就是一滩水，就是个虚空，她无处不在。你真正疼你的女儿，就好好修行，把功德回向给她。是不是很简单啊？</div><div class=\"text-indent\">有些人总是在想自己的家里长短，要把这些人度出来。这未必不是好心，可是你总是这样执着，到猴年马月，万一他们度不出来，你耽误了他们，也耽误了你自己的道行；你到时候眼泪都哭不出来，要适可而止啊。佛当年并没有讲非要把他的六亲眷属全部度出来再出家，再来成佛，而且毅然放下。一家人当中有一个人首先冲出六道轮回这个包围圈，他就有可能回过头来照顾这一世的亲人，乃至生生世世的亲人的生生世世。要作这样的观照啊！不能陷在世间的情执里，你有父母儿女，别人就没有父母儿女呀？你顾得了今世，他来世怎么办？更何况你还有生生世世的父母儿女的生生世世，把这个心量打开，你就已经解脱了一半。</div><div class=\"text-indent\">心量扩大就是一种力量，就是一种光明；包括这些无情的泥巴瓦块，哪个没有做过我们的父母儿女啊？都做过啊。从无始以来，我们有无量的生生世世。无量就是无量，你不要打什么妄想。你就是把这个数字写得天那么大，写得尽虚空遍法界，只要你一停止，它马上就是小小数字。你一停止它就是有量，因为我们的生命就是无量，有无量的生命就有无量的父母儿女、至亲骨肉。在这一点上，我们要生惭愧心啊！而且为此生烦恼，还要搞出病来，你是没有智慧，不会权衡利弊，修行人不就是要开智慧吗？</div><div class=\"text-indent\">无觉无觉，有没有哪个无觉不是我自己？有没有哪一个无觉没有做过我们的父母儿女？面对尽虚空遍法界这一大堆的父母儿女，你却执着微尘大的父母儿女，你说你有没有智慧？而且你越执着他，你还越对不起他；你现在把他放下，自己成就了，你还对得起他。说句不好听的话，即使他在无间地狱里，得道之人到地狱里给他传一下法，他也许一念心明白了还可能解脱；即使不能解脱，你跟那些小鬼拍拍肩：「哦，这个人出来，让他坐坐办公室」，是不是？我们一定要懂得怎样帮助今生今世的亲人，不要在那里浪费时间。佛给我们做出了榜样。有智慧的人，度化家人并不难。这就看你有多大的发心，看你日常生活中怎样表法。</div><div class=\"text-indent\">好，这个「阿耨多罗三藐三菩提」，作如是的解释，它不同于古往今来的说法，区别在于除了正常意义，后面加了邪觉、不觉和无觉这三类，因而再圆满为一个心。</div><div class=\"text-indent\"><strong>故知般若波罗蜜多是大神咒。是大明咒。是无上咒。是无等等咒。能除一切苦。真实不虚。</strong></div><div class=\"text-indent\">这是对以上心地法门的总结，解释为：我们应该明白呀，这个如来藏心地法门，这个「般若波罗蜜多」啊，<strong>是大神咒：</strong>是摩诃神咒，是摩诃明咒。这里的「大」字，由摩诃翻译而来。前面从时间、空间、万法、万相这四种不同的角度来解释这个大。简而言之，这个「大」就是我们的本来面目，这就是宇宙人生的真理，这就是「一心三藏」。大神咒的「神」，就是表我们的智慧妙用、「报身功德」，「大」就是我们的「法身」、本来面目；「大」和「神」变现为咒，「咒」有音声震动、有文字语言，这就叫「化身功德」。</div><div class=\"text-indent\">那么，这个经明明不是咒啊，为什么把它说为咒呢？因为咒是无量义，是秘密义，是尊重义。也就是说明白了《心经》的法理法义，你就把握了一切的万法。明白了「一心三藏」，明白了万法皆由一念之所变现，就等同于你把握了宇宙人生的全体。对这个「咒」啊，应作如是的观照。因此呢，以「咒」的无量义来比喻我们真心本来面目的神通法力不可思议。</div><div class=\"text-indent\">那么我们讲诸佛菩萨那个神通法力是我们的本来面目，那外道鬼神那种神通法力是不是我们的真心本来面目啊？是不是我们的智慧妙用啊？都是啊。问题是你在明心见性之前，执著于那一点点鬼神道的妙用，你不能解脱。在这个意义上，我们呵斥你这是外道，你不能成就，害了自己。</div><div class=\"text-indent\"><strong>是大明咒：</strong>前面的「大」，仍然是指我们的真心本体；后面的「咒」，仍然是指我们的化身功德；这个「明」，仍然是指我们的报身智慧妙用。但是这个「明」，跟「神」又有区别。「神」为因，「明」为果；「神」为能，「明」为所。比如我刚才喝水在没有发生之前，我能喝水的这个能在不在呀？虽然在，它有没有现出相来呀？（没有），这叫「神」。当喝过以后，我们清清楚楚明明白白看到我们的能现出来了，是不是呀？这就叫「明」，这个「明」当下是不是那个「神」啊？这叫智慧妙用。</div><div class=\"text-indent\"><strong>是无上咒：</strong>无上二字是表述前面大神、大明它的特征。怎么「无上」呢？心外无法，法外无心。没有上，没有下，没有前后、左右、中间、内外；也没有黑、白、空、有；没有一切的分别；没有一法不是我，是包罗万象。所以这个「无上」呢，你不能把它解释为是世界冠军、是第一、它最高。有人讲连等觉菩萨都是「有上」，只有佛才能讲无上——这是百分之百的依文解字。世间人常常批评小孩子没上没下的，小孩子没上没下叫天真，这叫歪打正着。我们就是没上没下，没我没你没他，都是一个念。「无上」二字就是「阿弥陀佛」，就是「如是我闻」——「无」就是「阿」；「上」，就是「弥陀」。是阿弥陀咒。「无」就是「如」，「上」就是「是」。是如是咒，是如来咒，行不行啊？我们要懂得把相关的概念都融会贯通，举一反三。</div><div class=\"text-indent\"><strong>是无等等咒：</strong>有些解释说：这个咒啊，不要说比它高的，跟它平等的都没有啊，仍然把它说成世界第一——那么圆顿大法来讲，是进一步重复不二法门。如果有一个等，是不是就是二呀？那么对「有等等」说「无等等」，明白吗？是对有说非有；对空说非空。注意，本来就没有两个东西等在这里，你说无等等，是不是说胡话呀？本来是一个东西，你怎么讲「无等等」呀？一定是有两个东西现前，他讲「无等等」，明白吗？所以对「有等等」说「无等等」，这叫不二法门，当下即是一，当下即是二。当下是一，当下即是无量，无量即是一，一即是无量。</div><div class=\"text-indent\">这里连用四个咒加强说明，我们一念具足无量智慧德能。同时要体会出咒是密，经是显，显密是不是一呀？那咒跟经是不是「一」呀？你明白了经文的法理法义，就是懂得了咒。你有没有必要去对咒再进行其它的解释呀？对大悲咒、楞严咒进行翻译，还把它解释——诸佛菩萨从来没有这个规矩。没有翻译咒文，更不要说解释咒文。咒是无量义，你怎么解释得清楚啊？咒是秘密义。你就是懂得了，你都没有权力来公开；而且咒文并不是梵文，它是一种特殊的文体。</div><div class=\"text-indent\"><strong>能除一切苦，真实不虚：</strong>仍然是在重复《心经》开头的「照见五蕴皆空，度一切苦厄」。这里是「得阿耨多罗三藐三菩提」，开了智慧了；然后「能除一切苦，真实不虚」。是不是相对应啊？「得阿耨多罗三藐三菩提」，这是当下一念的问题，你明白了就得了，这就是「花开」；「能除一切苦，真实不虚」，这就是「莲现」——跟前面的「照见五蕴皆空」就是「花开」，「度一切苦厄」就是「莲现」，如出一辙啊。用《阿弥陀经》来讲，「照见五蕴皆空」就是「即已食时」，「度一切苦厄」就是「还到本国」。用《楞严经》怎么讲的？「照见五蕴皆空」就是「随众生心」，「度一切苦厄」就是「应所知量」；就是因果不二的问题。</div><div class=\"text-indent\">《心经》既然是《法华经》《楞严经》之总纲，一定要体现出「花开莲现、即因即果、见道成佛、不历修证」的道理。《楞严经》就是专门讲「一心三藏」，当然也不妨讲了见性成佛；而《法华经》这个法华三昧的核心就是讲「见道成佛」，就是讲「花开莲现」。不把这个法讲出来，《法华经》你是白讲了。佛反反复复讲《法华经》怎么好怎么好怎么好，无非是讲它一步登天、不历修证、当下成就。那其它，它好在哪里啊？有什么好啊？如果讲「一心三藏」的道理，那《楞严经》已经解释了。所以《楞严经》是讲体，《法华经》是讲用，叫「体用不二」。《心经》呢，无非讲什么是「心」；明白了这个心有什么用，怎么用。如果不达这个目的，这个《心经》与我有什么关系啊？我学它干什么？你明白了《心经》，你就是《心经》。</div><div class=\"text-indent\">当懂得了一切万法都是我们一个念变现，你面对一个冤亲债主过去恨他，你这个苦现在解除了没有？当下解除啊！否则的话，说明你对这个道理还不透彻乃至还不懂，这要靠自己的智慧来悟。即使讲第二义谛，他们也是我们生生世世的父母儿女，你不吃肉不喝酒，后悔不后悔啊？（不后悔）。你吃粗茶淡饭快乐不快乐啊？（快乐）。当你知道一切的环境没有好坏的时候，你住房条件简陋一点，你自在不自在啊？（自在）。</div><div class=\"text-indent\">我在出家之前就修苦行，你们可以到如皋去调查呀——吃的是豆腐渣、麦麸、人家喂猪的那个芋头、烂菜叶；我如果出门，家里的厨房门、大门、还有卧室门，从来不关，也没有上锁，这是公开的——人啊、鬼啊、狗啊、猫啊、小老鼠啊，自由出入，但我从来感到很快乐；众生不听话，这就是我最不快乐的时候，除此之外我没有不快乐的时候——但是因为众生这个固执、调皮而感到不快乐的时候呢，那也是一种快乐；如果我不感到不快乐的话，说明我这个人已经麻木不仁了。</div><div class=\"text-indent\">就问你懂得这个心没有。懂得你这个心，你没有任何理由在任何时间、任何空间、对任何人任何事情讲不快乐，这是真的，是不是能除一切苦啊？明白了什么是「心」，什么是「如来藏」的道理，需要不需要再经过三年念佛，五年拜佛？然后，「哦，我快乐了」，有没有这个道理啊？没有啊。你当下快乐，而且永远快乐。一直到死，一直到来世。即使临死的时候，四大分离感到很痛苦，但你心里知道，黑暗即将过去，光明就在前面，这个时候你快乐不快乐啊？这叫苦中作乐。好好体会这个法味，你的苦除了没有？</div><div class=\"text-indent\">你以为升大官、发大财就快乐啊？那种人比我们不知道要苦多少倍，一天到晚心是沉甸甸的，为什么？他有百万的财产，这个情执重不重啊？始终压得他喘不过气来。这些人一旦一夜之间全部破产，沦落街头，这个时候起码一半人：「啊，我快乐了，这下终于解脱了！」他知道无官一身轻，无财一身轻。当然也有那一半的人更加心事沉重，怨天尤人，「我竟到了这种地步？」快乐不快乐在于我们的心。</div><div class=\"text-indent\">顺治皇帝把江山美人丢掉他才感到很快乐，叫「百年三万六千日，不及僧家半日闲」88。这半天的清闲比当一百年皇帝都要快乐。说真的，你们在这里谁都没有我快乐，这是真快乐啊！不一定非要出家才快乐；你会用心，在哪里都快乐，升官了也快乐，发财了也快乐。升官了：「嗯，正好可以借用手中的权力好好来度一些人」；发财了，就会想到：「哎呀，弘扬正法要建道场，要印经书。」</div><div class=\"text-indent\">也就是说：明白了「如来藏」道理，你在顺境、逆境，在富贵、贫贱之位都是快乐，没有不快乐。你能发一个心，你都能得到快乐。你能看到别人积德行善，能随喜都是一种快乐。这就是能除一切苦。关键在于能不能把持好这个心。</div><div class=\"text-indent\"><strong>故说般若波罗蜜多咒。即说咒曰。揭谛揭谛。波罗揭谛。波罗僧揭谛。菩提萨婆诃。</strong></div><div class=\"text-indent\"><strong>故说咒曰：</strong>也就是说明白了《心经》的法义，所以现在来说这个「咒」，「咒」就是表达经文的含义。「经以显为用」，就是经文是以开显直说来起妙用；「咒以密为用」，「咒」是以秘密含藏之义为用。</div><div class=\"text-indent\"><strong>揭谛揭谛。波罗揭谛。波罗僧揭谛。菩提萨婆诃：</strong>咒文这四句话，共计十八个字。也就是说这十八个字就包含了《心经》不可思议的妙用。那么，持咒到底有没有作用？能不能成就？告诉大家，持咒有不可思议的妙用，但是要达到三密相应89。</div><div class=\"text-indent\">一者，口密。口密呢，发音要准确，不准确不能成就。这个世界上的语言、音量大小、比如a、o、ai、ei……对世界的加持力都不一样。</div><div class=\"text-indent\">有一个公案必须否定：有一个老和尚晚上在山下看到山顶的小屋里跟白天一样闪亮闪亮的，那过去又没有电呐，小茅屋怎么那么亮呢？走过去，一听，是一个老太太在念六字大明咒，「嗡嘛呢呗咪牛」，所以他讲，老人家可不能这样念，应该念「嗡嘛呢呗咪吽」，是吧？念hong。老太太很听话，好，念「嗡嘛呢呗咪吽」，一吽，吽得家里吽黑了，哎，不亮了。所以老和尚又回过头来讲，老人家，还是念「嗡嘛呢呗咪牛」。有人以此来否定念咒音要准，说念错照样成就。这是什么成就啊？这个不能开智慧。你别说念「嗡嘛呢呗咪牛」，你一天到晚「南无12345，南无54321」，你照样能把家里念亮起来，信不信？这是一种色身调理就能发光，发出来的光与开智慧没有关系，但是足以证明一种语言一种音声就有一种效果。所以千万不能说，你不管什么只管念就行，这是不可以的！</div><div class=\"text-indent\">我上次患肩周炎，有一个大师叫我念几个数字，大概是念「二百六十八」，我当时根本都不相信，念二百六十八也能治病？我后来在江苏碰到一位老中医，他也提出这个法。大千世界，无奇不有啊！念数字也能治病，他连举三例，什么什么病念什么数字，有很多成功的案例，我相信了——因为一切的语言、音声都有加持力，所以修持咒的法门来成佛是不是有特定的秘诀啊？注意，一定不能念错。这是不是科学啊？</div><div class=\"text-indent\">二者，身密，要打手印。任何一个人行住坐卧的姿势和威仪都会对自己的身心产生直接影响。为什么要竖天线啊？它不同的形状和结构可以接受到宇宙间不同的信息。</div><div class=\"text-indent\">在中国历史记载，有一种步子叫「禹步」。大禹祖宗三代治水，祖父一辈和父亲一辈都没有成就，在大禹这一辈成就了。怎么能成就的？完全是个意外。大禹治水兢兢业业，三过家门而不入啊！古代洪水泛滥很麻烦，他累了跑不动了，躺在山上休息一会儿，但一想到这个工程很艰巨，皱着眉头硬撑着站起来，那走路是不是摇摇晃晃、跌跌撞撞？可以想象的。他突然发现许许多多的石头跟着自己过来了。这下来劲了，雄赳赳气昂昂。可是雄纠纠气昂昂，石头停下来不动了。他就纳闷儿了，一想，我刚才走路跌跌撞撞像个醉汉一样，是不是这种模样把它们感召过来的？他马上再恢复到刚才跌跌撞撞那个脚步。嗳，石头统统都跟着他来了。其实他把握了这种诀窍，你说省多少工夫啊？于是就解决了这个问题。因为那种走法时，他什么也不想，昏昏沉沉的，里面的第七识高度集中，然后通过这种姿势发出的信息能起到妙用。</div><div class=\"text-indent\">你们看电视上那些大侠打醉拳舞醉剑，这种功夫就是由禹步而来。你别看他走得跌跌撞撞，到那个时候他没有任何执着，可以达到炉火纯青的功夫。这是讲身密。念咒要打手印，任何一个姿势都有不同的信息。</div><div class=\"text-indent\">之前在西方国家有一个报导很有趣。老师在讲课，突然桌椅板凳跳起舞来了，所以把学生统统都吓跑了，老师也没有办法了，停课。之后把黑板擦干净，结果桌椅板凳全部鸦雀无声。老师很有智慧，什么原因呢？再看看黑板上还没有擦干净的痕迹，描起来以后桌椅板凳又跳起来了。</div><div class=\"text-indent\">为什么那些练气功、打太极拳的花样很多啊？他通过各种各样的动作从宇宙吸收不同的能量来调理身体。为什么学生要做广播体操啊？一个道理。</div><div class=\"text-indent\">三者，意密。意密是需要观照啊！念一句咒的时候，这个咒是什么形相？是一个圆圈还是圆球？是一条直线？还是一条曲线？还是椭圆形？是红光还是黑光？还是白光？你要会观照。比如说「吽」，你可不能随便讲「吽」，你一声「吽」，无量的鬼神大众马上就合掌「到」。这个意密不用解释大家都明白。我们心里经常想愉快的东西，是不是容易身体健康？一天到晚愁眉苦脸，容易得病。人死以后笑起来了，烧出了舍利子，是不是他心里高兴才能烧出红红绿绿啊？如果心里很痛苦，烧出来的只有黑灰。</div><div class=\"text-indent\">果然能做到三密相应，持咒就得大受用。可是我们现在一密都做不到。光口密你都密不了，同样一句咒文有几种读音：「南无阿弥多婆耶」，那江苏人是「难无阿弥多婆呀」；你念「阿弥陀佛」，他念「哦弥陀佛」；还有的是念「阿昧陀佛」，可多呢！各有各的依据，你说谁对谁不对？现在我们要想念咒指望成就，这是不可能的。第二密、第三密更不用讲，根本就没有人传授；就算有人传授，是真是假你知道啊？我在这告诫各位，千万不要耽误自己的大好时光，这是一个问题。</div><div class=\"text-indent\">第二个问题：祖师大德都是强调，凡是佛所讲之咒不可以翻译，不可以解释，鉴于多种原因：第一，咒是秘密语，不可以公开。第二个，你没有办法解释，它不是梵语。如皋人讲一句土语，「你在做什滴搞子」？你如果按汉语来翻译的话，「你在做稿子」，准备作报告啊？实际上这句话是讲你在干啥呢，是不是？你不能当成梵语来翻译。有些人节外生枝，把什么大悲咒、楞严咒先翻译，还解释，还画图形。这是误导众生。</div><div class=\"text-indent\">比如太原人讲「搓泥条」，就是你这个身体脏了，要赶快洗澡，是不是啊？你如果认为「搓泥条」是泥巴，那搓泥条是干什么啊？来烧那个陶器、瓷器，是不是啊？你这个解释是不是七国里岔到八国里去了，你能不能按照这个来解释啊？咒文是一种特种的语言。但是念咒有何利益呢？可以增加我们的定力，用万念集中到一个念；而且念咒呢，不管你音念得准不准，还能帮助你治病，你减少烦恼了，是不是？帮助你身体健康，在梦中、定中，还可以帮助你抵挡鬼神侵害，这个作用是有的，不要否认。</div><div class=\"text-indent\">为什么有？其实你念「一二三四五」，也能帮你治病，也能抵挡鬼神。人三分怕鬼，鬼七分怕人。你念「一二三四五」，心定了以后，身上马上就有光出来，明白吗？「一二三四五，一二三四五，一二三四五……」万念当做一念，而且你没有恐惧心。那么阴界众生，他眼睛都睁不开。如果我们身体健康的时候，他根本都不敢动你；而我们在心里阴暗的时候，身体健康状况很糟糕的时候，阴盛阳衰，通过这种气氛，他就会来靠近你。所以人快死的时候，往往能看到鬼。</div><div class=\"text-indent\">要放下一切幻想，必须把《法华经》《楞严经》学明白。这是文殊菩萨讲的，「<strong>十方薄伽梵，一路涅槃门</strong>」。一定要珍惜。《法华经》也讲了，「<strong>唯此一事实，余二则非真</strong>」。《法华经》是明讲、总讲、肯定讲；《楞严经》是明讲、细讲、正讲、反讲；《阿弥陀经》就是暗讲，把《法华经》《楞严经》的精华秘密地含藏在经文之中，就是「唯此一事实」；《心经》则是画龙点睛，提纲挈领，令人一目了然。</div><div class=\"text-indent\">好，《心经》讲解到此圆满。</div><div class=\"text-indent\">回向：愿以此功德，普及于一切。我等与众生，皆共成佛道。</div><div class=\"text-indent\"><strong>?注：</strong></div><div class=\"text-indent\">43.《般若心经讲义》（圆瑛大师·著）：“观”字，非眼观之观，乃心观之观。即是以自心本具般若妙智，观照身心世界之境，破除我法二执。“自在”者，即智照无碍。观有不著有，观空不著空；心能转物，不随物转；空有无碍，得大自在。一切众生，不能起智观察，但用眼观。所以被境所迷，为物所转，心有挂碍，不得自在。</div><div class=\"text-indent\">44.《楞严经·卷六》：世尊，忆念我昔无数恒河沙劫，于时有佛出现于世，名观世音，我于彼佛发菩提心。彼佛教我，从闻、思、修入三摩地。</div><div class=\"text-indent\">45.《楞严经·卷十》：阿难，如是十种禅那，中途成狂，因依迷惑，于未足中生满足证，皆是识阴用心交互，故生斯位。众生顽迷，不自忖量，逢此现前，各以所爱先习迷心而自休息，将为毕竟所归宁地，自言满足无上菩提，大妄语成外道邪魔，所感业终堕无间狱。声闻、缘觉不成增进。</div><div class=\"text-indent\">46.《楞严经·卷六》：</div><div class=\"text-indent\">若以水性观，想念非真实，如如非觉观，云何获圆通？</div><div class=\"text-indent\">若以火性观，厌有非真离，非初心方便，云何获圆通？</div><div class=\"text-indent\">若以风性观，动寂非无对，对非无上觉，云何获圆通？</div><div class=\"text-indent\">若以空性观，昏钝先非觉，无觉异菩提，云何获圆通？</div><div class=\"text-indent\">47.《楞严经·卷六》：阿难，如是世界六道众生，虽则身心无杀、盗、淫，三行已圆，若大妄语，即三摩提不得清净，成爱见魔，失如来种。所谓未得谓得；未证言证；或求世间尊胜第一，谓前人言‘我今已得须陀洹果、斯陀含果、阿那含果、阿罗汉道、辟支佛乘、十地地前诸位菩萨’，求彼礼忏，贪其供养，是一颠迦，销灭佛种。如人以刀断多罗木，佛记是人，永殒善根，无复知见，沉三苦海，不成三昧。</div><div class=\"text-indent\">48.《法华经·法师品第十》：若是善男子善女人，我灭度后，能窃为一人说法华经，乃至一句。当知是人则如来使，如来所遣，行如来事，何况于大众中，广为人说？</div><div class=\"text-indent\">《法华经·药王菩萨本事品第二十三》：又如一切凡夫人中，须陀洹、斯陀含、阿那含、阿罗汉、辟支佛为第一，此经亦复如是，一切如来所说，若菩萨所说，若声闻所说，诸经法中，最为第一。有能受持是经典者，亦复如是，于一切众生中，亦为第一。</div><div class=\"text-indent\">49.《法华经·譬喻品第三》：若有闻者，随喜顶受，当知是人，阿惟越致。</div><div class=\"text-indent\">50.《般若心经讲义》（圆瑛大师著）：“行”即菩萨因地所修清净法行，用耳根工夫，反闻闻自性。</div><div class=\"text-indent\">51.《楞严经讲义·卷十六》：照字是起智观照，做入流照性，背尘合觉之工夫，即修证了义。缘心自在，随缘普应，或冥应，或显应；心得自在，任运利生，即诸菩萨万行。得三摩地，即得首楞严大定。</div><div class=\"text-indent\">52.《达摩大师血脉论》：若不见性，说得十二部经教，尽是魔说。魔家眷属，不是佛家弟子，既不辨皂白，凭何免生死？</div><div class=\"text-indent\">53.《法华经·安乐行品第十四》：文殊师利，是法华经于无量国中，乃至名字不可得闻，何况得见受持读诵？</div><div class=\"text-indent\">54.《地藏经·如来赞叹品第六》：南阎浮提众生，举止动念，无不是业，无不是罪。何况恣情杀害、窃盗、邪淫、妄语、百千罪状。</div><div class=\"text-indent\">55.《楞严经·卷五》：我观世间六尘变坏，唯以空寂修于灭尽，身心乃能度百千劫，犹如弹指。</div><div class=\"text-indent\">56.《楞严经讲义·卷九》：世间地大，不出妄心，坚执所感，可见地大之种，乃是无明妄心，一念之坚相耳！</div><div class=\"text-indent\">57.《楞严经·卷二》：色心诸缘及心所使诸所缘法，唯心所现。汝身汝心，皆是妙明真精妙心中所现物。</div><div class=\"text-indent\">58.《楞严经·卷九》：又以此心内外精研，其时魂魄意志精神，除执受身，余皆涉入，互为宾主，忽于空中闻说法声，或闻十方同敷密义，此名精魄递相离合。成就善种，暂得如是，非为圣证。不作圣心，名善境界；若作圣解，即受群邪。</div><div class=\"text-indent\">59.《楞严经·卷九》：又以此心澄露皎彻，内光发明，十方遍作阎浮檀色，一切种类化为如来，于时忽见毗卢遮那踞天光台，千佛围绕，百亿国土及与莲华俱时出现，此名心魂灵悟所染。心光研明，照诸世界，暂得如是，非为圣证。不作圣心，名善境界；若作圣解，即受群邪。</div><div class=\"text-indent\">60.《楞严经·卷六》：诸行是无常，念性元生灭，因果今殊感，云何获圆通？</div><div class=\"text-indent\">61.《楞严经讲义·卷十六》：若以此生灭之因，而求现证，不生灭之圆通，则因果相背，感应咸殊，故曰因果今殊感。云何初心依此生灭之心，而速获圆通者哉？</div><div class=\"text-indent\">62.《楞严经·卷六》：自余诸方便，皆是佛威神，即事舍尘劳，非是长修学，浅深同说法。</div><div class=\"text-indent\">63.《楞严经·卷六》：持犯但束身，非身无所束，元非遍一切，云何获圆通？</div><div class=\"text-indent\">64.《法华经·常不轻菩萨品第二十》：尔时，有一菩萨比丘名常不轻。得大势，以何因缘，名常不轻？是比丘凡有所见，若比丘、比丘尼、优婆塞、优婆夷，皆悉礼拜赞叹，而作是言：我深敬汝等，不敢轻慢。所以者何？汝等皆行菩萨道，当得作佛。</div><div class=\"text-indent\">65.《大般涅槃经·卷第六·如来性品第四之三》：声闻之人虽有天眼故名肉眼。学大乘者虽有肉眼乃名佛眼。</div><div class=\"text-indent\">66.《楞严经讲义·卷一》：著相之修，为事相之染修，著相之证，为新成之实证，未悟圆理，均非了义。</div><div class=\"text-indent\">67.《楞严经讲义·卷十三》：言有为是妄，以显无为是真，分明对妄立真，真外有妄可对，真固非真，故曰合妄与真，同为二妄矣！《中论》云：“若法因待成，是法还成待。”足证此义。</div><div class=\"text-indent\">68.《楞严经讲义·卷十六》：此阿难一类之机，所知障轻；故能顿悟；而烦恼障重，故未能顿证。且圆顿教旨，惟重彻悟，不愁不证。</div><div class=\"text-indent\">69.德林老和尚：我们近代有位圆瑛法师，宁波天童寺的。天童寺也有禅堂。有一天他在禅堂里坐香，坐香止静后，那个禅堂的门是关着的。圆瑛法师在静中忽然想起一件事情，很急，他就从座位上下来，出了禅堂。出了禅堂后，他忽然想起来，这禅堂的止静门是关着的，我是怎么出来的？再想回去，回不去了，门是关着的嘛！这是怎么回事呢？空和色也就在这一念之间，当他出去的时候完全忘掉了这个禅堂，忘掉了这个门，也忘掉了自己的这个身体，忘得干干净净，于是他就出去了，没有一点障碍。等他心里一起念，这个念头一起，想这个禅堂的门是关着的，我怎么出来了？那就回不去了。为什么呢？他这个心里有了一个禅堂，有了一个门，还有了一个我，于是便有了障碍，这就叫做一切唯心造。那个门是色，色其实也是空。我们人有分别意识，在意识中这个墙壁是不能通的，这个门是不能通的。你认为不能通，他就不能通啊。在这一点上，我们就不如鬼神，鬼神他就能通过。</div><div class=\"text-indent\">70.《楞严经讲义·卷九》：圆顿悟后之修，念念是佛，虽进断通惑，亦与权渐修者，日劫相倍。</div><div class=\"text-indent\">71.《楞严经讲义·卷九》：权教多重事相，必假修成，实教则重性具，贵在了悟。未悟之先，法身本自现成，圆觉经云：一切众生，本成佛道，倘能一念回光，便同本得，但离妄缘，即如如佛。岂同权渐之教，必历僧祗，方获法身耶？</div><div class=\"text-indent\">72.《法华经·化城喻品第七》：尔时，大通智胜如来，受十方诸梵天王及十六王子请，即时三转十二行法轮……佛于天人大众之中说是法时，六百万亿那由他人，以不受一切法故，而于诸漏，心得解脱，皆得深妙禅定、三明、六通，具八解脱，第二、第三、第四说法时，千万亿恒河沙那由他等众生，亦以不受一切法故，而于诸漏，心得解脱。从是已后，诸声闻众无量无边，不可称数。</div><div class=\"text-indent\">73.《楞严经讲义·卷三》：如一切唯心造，凡小解为业造，权教解为识造，圆顿之机，直了真心所现，真所谓“佛以一音演说法，众生随类各得解”。</div><div class=\"text-indent\">74.《楞严经·卷四》：若能于此悟圆通根，逆彼无始织妄业流，得循圆通与不圆根，日劫相倍。</div><div class=\"text-indent\">75.《楞严经讲义·卷十》：涅槃，即佛所证不生灭之果，实教菩萨，得以分证，若权教菩萨，所修诸行，但称六度，不称六波罗密，以所修不能离相，未得三轮体空，不到涅槃彼岸。此六波罗密，以般若为先导，必由般若，方能离相，方到彼岸也。</div><div class=\"text-indent\">76.《法华经·普贤菩萨劝发品第二十八》：若但书写，是人命终当生忉利天上，是时八万四千天女，作众伎乐而来迎之，其人即着七宝冠于采女中，娱乐快乐，何况受持读诵，正忆念，解其义趣，如说修行。</div><div class=\"text-indent\">77.《法华经·随喜功德品第十八》：我今分明语汝，是人以一切乐具，施于四百万亿阿僧祇世界六趣众生，又令得阿罗汉果，所得功德，不如是第五十人闻法华经一偈随喜功德，百分、千分、百千万亿分不及其一，乃至筭数譬喻所不能知。阿逸多，如是第五十人展转闻法华经随喜功德，尚无量无边阿僧祇，何况最初于会中闻而随喜者，其福复胜无量无边阿僧祇，不可得比。</div><div class=\"text-indent\">78.《华严经·卷十七·初发心功德品第十七》：欲知一切诸佛法，宜应速发菩提心。此心功德中最胜，必得如来无碍智。</div><div class=\"text-indent\">79.《楞严经讲义·卷一》：始教权乘，全取第六识，作我、法二空观，其所修之定，有入定、住定、出定，亦非究竟坚固之性定。</div><div class=\"text-indent\">80.《楞严经·卷一》：阿难，一者，无始生死根本，则汝今者与诸众生，用攀缘心为自性者。二者，无始菩提涅槃元清净体，则汝今者识精元明能生诸缘，缘所遗者。由诸众生遗此本明，虽终日行，而不自觉，枉入诸趣。</div><div class=\"text-indent\">81.虚云大师：现在是末法时代，你到哪里访善知识呢？不如熟读一部《楞严经》，修行就有把握，就能保绥哀救，消息邪缘，令其身心入佛知见，从此成就，不遭歧路！</div><div class=\"text-indent\">82.《楞严经讲义·卷十五》：余二十一岁，由闽航海来苏，参常州天宁开和尚学习禅功，参“如何是我本来面目”一句话头，放下一切思想，提起一段疑情，连参三年，誓见自己本来面目，了明生死大事。至二十四岁冬，在禅七之中，专切参究，乃至饮食不知其味，一切时处，心光皆照一句话头，至第十日下午，二板香止静后，参究得力，身心忽空，内外虚融，定境法乐，非言语所能形容，一动喜心，定境即失。后于别枝香，欲求定境再现，皆不可得。禅七考功时，将是事陈白冶公和尚。则曰：“汝自后有求定境复现否？”答曰：“有”。乃警之曰：“切不可求，若求则魔得其便，汝将为魔眷矣！”复问：“如是境界好否？”公曰：“不作圣证之心，名善境界，若作圣解，即受群邪，此不过用心得力，暂得轻安，从此进修，不著不求，悟证有望。”后阅本经，五十种阴魔所述，知善知识，不可不亲近也。</div><div class=\"text-indent\">83.《楞严经讲义·卷九》：佛证此究竟坚固之定，前说四科七大，一切事相之法，一一会归如来藏性，本不动摇，本不生灭，自性天然妙定，即首楞严定也。此定为定中之王，能统百千三昧。</div><div class=\"text-indent\">84.《楞严经·卷十》：圆满菩提，归无所得。</div><div class=\"text-indent\">85.《楞严经讲义·卷一自序》：以楞严妙义，丰富深藏，每讲一次，则有一次发明，多究一番，自有一番进步。</div><div class=\"text-indent\">86.《楞严经·卷七》：如土枭等附块为儿，及破镜鸟以毒树果抱为其子，子成父母皆遭其食，其类充塞。</div><div class=\"text-indent\">87.《大乘大集地藏十轮经·卷第六·有依行品第四之二》：是故欲得上妙生天涅槃乐者。皆应亲近承事供养胜道沙门咨禀听闻三乘要法或求示道命道沙门。若无如是三道沙门。当于污道沙门中求。虽复戒坏而有正见具足意乐及加行者。应往亲近承事供养咨禀听闻三乘要法。</div><div class=\"text-indent\">88.《顺治皇帝出家偈》：</div><div class=\"text-indent\">天下丛林饭似山，钵盂到处任君餐。黄金白玉非为贵，唯有袈裟披最难。</div><div class=\"text-indent\">朕为大地山河主，忧国忧民事转烦。百年三万六千日，不及僧家半日闲。</div><div class=\"text-indent\">来时糊涂去时迷，空在人间走一回。未曾生我谁是我？生我之时我是谁？</div><div class=\"text-indent\">长大成人方是我，合眼朦胧又是谁？不如不来亦不去，也无欢喜也无悲。</div><div class=\"text-indent\">悲欢离合多劳意，何日清闲谁得知。世间难比出家人，无牵无挂得安闲。</div><div class=\"text-indent\">口中吃得清和味，身上常披百衲衣。五湖四海为上客，逍遥佛殿任君嘻。</div><div class=\"text-indent\">莫道僧家容易做，皆因累世种菩提。虽然不是真罗汉，也搭如来三顶衣。</div><div class=\"text-indent\">兔走鸟飞东复西，为人切莫用心机。百年世事三更梦，万里江山一局棋。</div><div class=\"text-indent\">禹尊九州汤伐夏，秦吞六国汉登基，古来多少英雄汉，南北山头卧土泥。</div><div class=\"text-indent\">黄袍换却紫袈裟，只为当初一念差。我本西方一衲子，缘何落在帝皇家。</div><div class=\"text-indent\">十八年来不自由，南征北战几时休？朕今撒手归西去，管你万代与千秋。</div><div class=\"text-indent\">89.《楞严经讲义·卷十八》：《正脉》云：大端圣贤宏化，例有显密二教，如医疗病，率有二途：一者授方，则显说病源、药性，及炮治之法，如佛显教。二者授药，则都不显说，但惟与药，令服愈病而已，不必求知何药何治，如佛密教。故今授药，不必求解，若解生则咒丧矣。持咒之法，但当深信不疑，一味持之，身、口、意三密相应，不要起心求解，如参话头相似，只许参，不许解，一念不生，自能得益。</div></div></div>"
  },
  {
    "title": "附记",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>附记</strong></h2><div><div class=\"text-indent\"><strong>是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。</strong></div><div class=\"text-indent\">这段经文比较费解。如果断章取义来讲，就会偏解为通教禅宗的破相见性。他可以振振有词：《心经》讲得很清楚哇，真佛无相呐，真法不可说呐，言语道断呐，心行处灭呀！</div><div class=\"text-indent\">可是这样一来，这部《心经》岂不前言不搭后语，牛头不对马嘴？上文明明「<strong>色不异空，空不异色；色即是空，空即是色</strong>」，怎么下文又说「空中无色」，岂非「空不是色」？这里就需要以圆顿之义来贯通，来圆融、圆满、圆通。</div><div class=\"text-indent\">我们已知色空四句乃佛法之命体命脉，是从根本上、全局上、战略上来阐述宇宙万法的本体，相当于世间法里所谓的世界观问题；而空中无色这十二句，乃佛法之行理、行义，是从具体上、局部上、战术上来展开修证的次第，相当于世间法里所谓的方法论问题。故以「是故」二字来圆通上下文义。</div><div class=\"text-indent\">是什么故啊？是「<strong>色不异空，空不异色；色即是空，空即是色</strong>」之故，在圆悟一心三藏的前提之下，悟后进修。可解释为观世音菩萨回顾因地修持耳根法门时，从闻思修入三摩地的修行次第。闻到了什么？闻到了「<strong>色不异空，空不异色，色即是空，空即是色。受想行识，亦复如是</strong>」。这是圆顿大教见道位的功德，圆教行人在见道位所见到的真如本性与在证道位所证到的真如本性无二无别。</div><div class=\"text-indent\">思什么？思文殊菩萨在楞严法会代佛开示「<strong>十方薄伽梵，一路涅槃门</strong>」的金口裁定90。自古以来「成佛的法华，开悟的楞严」，没有他说；而《法华经》《楞严经》本为一体。</div><div class=\"text-indent\">《楞严经》是对《法华经》的展开，从一点、一撇、一捺、一划、一字、一句、一段、一品，环环相扣，步步深入，解说宇宙万法之本源及其生住异灭之规律；《法华经》呢，是对《楞严经》的高度概括，充分肯定，反复赞叹；而《心经》则是从哲理上对《法华经》《楞严经》高度浓缩，极显绝唱！</div><div class=\"text-indent\">明什么心？明「<strong>空即是色</strong>」！见什么性？见「<strong>色即是空</strong>」。明心见性就是「照见五蕴皆空，诸法阿弥陀，诸法如是，诸法如来，诸法性相，诸法理事，诸法五蕴皆空，诸法不二」。此不二法门既是万法之本体，又为修证达道之总纲。</div><div class=\"text-indent\">圆人明心见性虽说当下成佛，那是指分真即佛，下位不落六道轮回，上位可至十地等觉。如龙女那样，一闻《法华经》而直至妙觉圆满。毕竟是万万人中难有其一。绝大多数人尚须于分真后继续进修，而成究竟圆满即佛。</div><div class=\"text-indent\">修什么？圆人明心见性以后，进修任何法门都能从分真到究竟，这就是方便有多门。而观音菩萨选择了耳根法门，这是圆顿法门，以此闻思修，直达涅槃彼岸。</div><div class=\"text-indent\">怎样修？禅宗的传统修法是破相见性，要以不可思议的智慧和毅力，苦修无量劫，经历五十种阴魔境界（其实是无量种），也才能破除一分灭相无明，证一分法身，入初住菩萨位，还有四十一分法身无法证入；而圆教行人在见道位就已超越初住位乃至十地等觉。</div><div class=\"text-indent\">观音菩萨是在圆人闻思修的次第中，行持耳根圆通之法。在这种前提之下，将「五蕴、六入、十二处、十八界、十二因缘、四圣谛、菩萨心智」一切法统统回光返照，也就是入流照性——能观者毕竟谁是谁？所观者毕竟是谁？一直观到尘亡根尽识泯，分破「动、静、根、觉、空、灭」六关，进至「十方圆明」，超越世间和出世间——「上合十方诸佛，本妙觉心，与佛如来，同一慈力；下合十方一切，六道众生，与诸众生，同一悲仰。」成就究竟圆满妙觉如来果位的修证，即「<strong>照见五蕴皆空，度一切苦厄</strong>」（参照《楞严经·第六卷》观音说法）。这是一种解法。</div><div class=\"text-indent\">这段经文呢，还可以作另外一种解法。梵语本《心经》是在释佛灭度后由其弟子们凭记忆结集整理；再加之当时梵文由树叶刻写连接；又梵文本传到中国几经周转，两国语言差异——这中间盘根错节，种种原因都有可能造成经文的漏错、变异或译误。何以见得？《心经》译本有多种都不尽一致。</div><div class=\"text-indent\">其中《薄伽梵母智慧到彼岸心经》文本中就有「如是我闻，一时……」长长一大段，为玄奘本所缺。特别在「<strong>是故空中无色</strong>」这一大段中，有「<strong>无智无得，亦无不得</strong>」这两句话。据此，我们可以大胆推定，《心经》译文与原本梵文是有差异的。那么，我们就可以顺理成章地依上文之义而变通一番下文：</div><div class=\"text-indent\">「是故空中无色非无色，色即是空，空即是色；无受想行识非无受想行识，受想行识即是空，空即是受想行识；无眼耳鼻舌身意非无眼耳鼻舌身意，眼耳鼻舌身意即是空，空即是眼耳鼻舌身意；无色声香味触法非无色声香味触法，色声香味触法即是空，空即是色声香味触法；无眼界乃至无意识界非无眼界亦非无意识界，眼界乃至意识界即是空，空即是眼界乃至意识界；无无明亦无无明尽非无无明亦非无无明尽，无明及无明尽即是空，空即是无明及无明尽。乃至无老死亦无老死尽非无老死亦非无老死尽，老死及老死尽即是空，空即是老死及老死尽；无苦集灭道非无苦集灭道，苦集灭道即是空，空即是苦集灭道。无智亦无得非无智亦非无得，智及得即是空，空即是智及得。以无所得，非无所得故。」</div><div class=\"text-indent\">这在佛法中叫「存疑」。佛法经文乃佛金口宣说，任何人在任何时间任何空间不可以任何理由擅自变动一段一句一字，否则大逆不道。但是经文在刻抄、流通、翻译的过程中，由于无意的疏忽，往往造成文不及义，或者由于古今时代的变迁，彼此地域差异，也会造成费解。在这种情况下，当事人有权对原文作变通解释，以利理通文义。</div><div class=\"text-indent\">若是这样变通，解释起来则更显顺畅，更显圆顿大法不立阶梯、无修无证、一步登天之气势。文殊有言「<strong>初心入三昧，迟速不同伦</strong>」——虽然二十五菩萨各自证得圆通，然而这些法门对于初机众生以及阿难来讲，迟速之别，快慢之分，非可等同91。何如圆顿本修，全性起用。妄本真，何须破？真即妄，何待求？既然色即是空，何须破色归空？既然空即是色，何劳出空显色？五蕴、六尘、十二处、十八界、大中小三乘佛法，亦复如是。</div><div class=\"text-indent\">换个说法，十方三世，上至诸佛菩萨，下至天人鬼畜，旁及山河大地、日月星辰、树木花草、泥巴瓦块、风云雨雾、乃及红黄黑白、是非长短、香甜苦辣酸臭，这天地万法无非诸佛法身真常，无非一人一念变现而已92。真心本性非空非有，非生非灭，非不生非不灭，非一非多，非真非妄，非佛非众；而是随缘现空现有，现生现灭，现不生现不灭，现一现多，现真现妄，现佛现众。如人在梦，梦境万千，仔细想来，此梦中人事岂是他人，何关别事，实乃梦中之人一念变现而已。</div><div class=\"text-indent\">诸佛如来出世本怀，良苦用心，无非劝导一切众生赶快赶快梦中醒来。果然明白此理，深信不疑，当下成佛了脱生死。正如经文「<strong>照见五蕴皆空，度一切苦厄</strong>」，亦如《法华经》所谓「一念信解，蒙佛授记」；《楞严经》说为「发明便解脱」。这中间有何修何证？</div><div class=\"text-indent\">可古今中外几千年，当今世界全地球，行人百千万万亿，有几个人信《法华经》93？有几个人修《楞严经》？又有几个人懂《心经》？一生成就，一时成就，一念成就，当下成就，百分之百成就的一心三藏大法，很多人却不敢相信，实乃佛法之悲哀！佛门之悲哀！行人之悲哀！</div><div class=\"text-indent\">想当年，我佛世尊于楞严法会，苦口婆心，义正辞严，将自己金口宣说以及十方如来恒沙妙法通通判为戏论；并将经题说为「大方广妙莲华王」。在法华会上，佛更是近乎拍桌子打板凳，一口咬定《法华经》是唯一究竟了义之法，是第一方便之法，以十喻将《法华经》说为「诸经之王」94。《楞严经》之所以说为「经王」，就是因为它讲清了真理，让人当下了生死。</div><div class=\"text-indent\">今人有说《无量寿经》是经王，不知有何根据？是何理由？当然了，若真读懂《心经》，一切经、一切法、一切人事万物，皆是王，这又当别论。</div><div class=\"text-indent\"><strong>?注：</strong></div><div class=\"text-indent\">90.十方薄伽梵，即十方诸佛。薄伽梵，是佛之别称，具足六义：自在、炽盛、端严、名称、吉祥、尊贵。一路涅槃门，三世诸佛皆由楞严大定而成就，没有第二条路。</div><div class=\"text-indent\">91.《楞严经讲义·卷十六》：初发心人，欲入三昧，指楞严大定，得循圆根，与不圆根，日劫相倍。以不得圆根，则艰难而迟，虽修数劫，不及一日，以得圆根则容易而速，但修一日，可当数劫。因此迟速难易，自不同伦，又不可以不选也。</div><div class=\"text-indent\">92.《楞严经·卷九》：汝等当知有漏世界十二类生，本觉妙明，觉圆心体，与十方佛无二无别。</div><div class=\"text-indent\">93.《法华经·法师品第十》：如来现在，犹多怨嫉，况灭度后！</div><div class=\"text-indent\">94.《法华经·药王菩萨本事品第二十三》：宿王华，譬如一切川流江河诸水之中，海为第一，此法华经亦复如是，于诸如来所说经中，最为深大。又如土山、黑山、小铁围山、大铁围山，及十宝山，众山之中，须弥山为第一，此法华经亦复如是，于诸经中最为其上。又如众星之中，月天子最为第一，此法华经亦复如是，于千万亿种诸经法中，最为照明。又如日天子，能除诸闇，此经亦复如是，能破一切不善之闇。又如诸小王中，转轮圣王最为第一，此经亦复如是，于众经中，最为其尊。</div><div class=\"text-indent\">又如帝释，于三十三天中王，此经亦复如是，诸经中王。又如大梵天王，一切众生之父，此经亦复如是，一切贤圣学无学，及发菩萨心者之父。又如一切凡夫人中，须陀洹、斯陀含、阿那含、阿罗汉、辟支佛为第一，此经亦复如是，一切如来所说，若菩萨所说，若声闻所说，诸经法中，最为第一。有能受持是经典者，亦复如是，于一切众生中，亦为第一。一切声闻、辟支佛中，菩萨为第一，此经亦复如是，于一切诸经法中，最为第一。如佛为诸法王，此经亦复如是，诸经中王。</div></div></div>"
  },
  {
    "title": "笔记",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">无量百千万亿年当下一念</h2><div class=\"text-indent\">比如说鼓掌，动作响声情绪，没有想没有动没有出现的时候在不在？在，如果不在的话你想不起来，虽然在他有没有任何痕迹形象？没有，虽然在没有任何痕迹，没有大小是非好坏善恶高兴痛苦等等等等，虽然没有痕迹他就是在，既然没有痕迹在哪里呀？哪里也不在哪里也在就是这么妙，没有想没有出现它就是在，这就叫阿弥陀佛的“阿”，通过脑袋思维了要鼓掌叫“弥”，掌鼓起来了有响声有动作有情绪就是“陀”.阿弥万法都是阿弥陀佛。所以天地万法没有哪一法不是阿弥什么什么...。天地万法就是一个念一个心变现出来的，(这里的心不是意识心)然后由识分别变化出万法。森罗万象，所有变化的万法(五蕴，十八界，身口意，五毒，五欲等等...)当下都是一个心一个念，这个一不是相对一不能分你的我的心。泥巴瓦块树木花草风云雨雾还是贪嗔痴高兴焦虑苦恼等都是一个真人一个念变现出来的</div><div class=\"text-indent\">由此观照一切的万法都是当下一个念变现的。一切的万法在我们心里的时候有没有形相啊？它都是由无形无相变现而有，那既然你的心无形无相，他的心有没有形相啊？猫心、狗心有没有形相啊？泥巴心、瓦块心有没有形相啊？是不是所有的心都是一个心呐！再一次观照做梦，梦中的一切境界是不是就是做梦的一个人变现出来的？诸佛出世就是讲这个真理。</div><div class=\"text-indent\">在《楞严经》讲的，既有科学性又有哲理性。在佛法里讲，老实人得大利益，聪明人反被聪明误。佛法是平等的。这个世界上没有一个人能沾光，没有一个人会吃亏。当你沾沾自喜就是你吃亏的时候，你沾不了光的；当你吃亏而心安理得，生欢喜心，你是吃苦了苦。是非好坏全在于心态的调整。</div><div class=\"text-indent\">我们这个心就是一面镜子。一朵花在镜子里显出来就是一朵花，一堆牛屎在镜子里显出来就是一堆牛屎。要用好这个心。只要有造作，无论是身口意业还是其他，不管是谁，善恶的种子已与阿赖耶识发生沟通，这个业种即已形成，在未来的时空点，只要机缘成熟，这个结果马上就变现出来。</div><div class=\"text-indent\">这个法妙啊！修行人把别人看得慈悲善良，别人不会因为你把他看好就变好，而你已经变好了。你把他人看得怎么坏，想得怎么坏，说得怎么坏，别人不会因为你说坏他就坏了，而你自己的心确确实实已经变坏了，而且必受果报。佛在《无量寿经》怎么讲啊？要善护意业，善护口业，善护身业，要护好我们的三业。你把一切的人事法只管往好处想，在普贤十大愿王叫什么啊？随喜功德。你可不要去随喜人家过错。随喜人家过错是用别人的错误来惩罚自己，你这有智慧吗？何况人家不一定就是错。你怎么知道人家心里怎么想啊？不要自作聪明。</div><div class=\"text-indent\">要明白啊，一切的万法都共同一个阿赖耶识，这个阿赖耶识里有无量的业识种子，无量的第七识见分，每一个第七识见分都可以从中汲取各种各样的气氛来成就自己一生一世的业报</div><div class=\"text-indent\">那么怎么样又叫「秽名恶称是其相」呢？没有哪一法是清净单纯的。一尊佛现相也好，一尊菩萨现相也好，天人鬼畜现相也好，泥巴瓦块现相也好，风云雨雾现相也好，它都是由无量无量的元素大杂烩而成。想想看，如果我们无量劫以来的大小便以及人死以后的尸体都聚集在这里的话，我怕这里都没有空间了，人都在这个牛屎里滚，在人尸体里面爬。是不是啊？那现在那些屎啊、尿啊、白骨到哪里去啦？是不是阿弥陀佛派飞船火箭来装走啦？装到极乐世界去卖钱去啦？那到哪里去啦？我告诉你们，你们可不要恶心。这都在我们的身体上，都在我们的肚子里，都在空间万法里里外外。哪有一个干净的？你穿西装革履，昂首挺胸，所以看不起那些拉板车的，拖大粪的，你何苦来哉啊？所有的人、所有的菩萨都是一个东西，都是一样的，叫「秽名恶称是其相」。</div><div class=\"text-indent\">当你知道秽名恶称垃圾堆又成了宝了，是我们成佛的法器，它就是如意宝珠。讲秽名恶称也好，讲庄严殊胜也好，都是我们的「同分妄见」。没有善恶之别，没有好坏之分，一切的一切都是我们的如意宝珠，都是宝啊！我们看到是牛屎狗粪，鬼道的众生看着是美味佳肴；我们看到是烂泥巴地，极乐世界的菩萨看着是黄金。心态调整得好，你当下就在极乐世界，充满着快乐、光明；心态不好的人念念都是地狱，都是痛苦。</div><div class=\"text-indent\">修行的目的就是使我们的这个心从色尘障碍中解脱出来，从妄想分别中解脱出来；在解脱的同时，又能与整个的有情无情一切万法融为一个本体。怎么个「命浊」啊？我的真命是无量寿，自在无碍，由于妄想心把心和色分别执着为有情和无情，把这一念与无量的念分别执着为你、我、他，从此自私其小，自己障碍自己。《楞严经》把众生一切的行为说为「自心取自心」。你吃饭喝水，饭和水是什么东西啊？就是你自己，就是你的心。你就是去供养父母也好，你去诈骗他人也好，那他人、父母是不是你自己呀？你去打工挣钱，打的那个工，挣的那个钱是不是还是你自己呀？有什么好执着呀？诸佛当下证得万法皆是一个自己。我们现在过得是不是很艰苦啊？由小到大多灾、多难、多病，到最后老态龙钟；若在畜生道里，那苦不堪言，更不用说鬼道、地狱道——都是自己捉弄自己。这就是「命浊」。</div><div class=\"text-indent\">从根本上来讲，同是我们一个真心、一个真念，在众生位迷惑颠倒的时候，就被「眼耳鼻舌身意」这六根，被「色声香味触法」这六尘所束缚；被我们的眼识、耳识、鼻识……这六种意识心所纠缠——身苦心劳，而不能出离。因此佛在《楞严经》讲这个「五浊」，是从根本上来开示宇宙人生本来面目。</div><div class=\"text-indent\">那么按照圆教来讲，是从「非空非有」这二门而入。他是对空说非空，对有说非有；换一种说法：「色即是空，空即是色，即空即色」。而且当下一就是无量，无量就是一，一就是二，二就是八，八就是九。这才是真正的「色不异空，空不异色。色即是空，空即是色」。</div><div class=\"text-indent\">下面通过打比方来说明这四句话，还是拿手好戏。比如说：手掌的五个指头表无量万法，这无量万法的佛、菩萨、天人鬼畜、牛马猪羊、风云雨雾都在，无量的行持、说法、善呀、美呀、真呀，都包括在内。</div><div class=\"text-indent\">那么藏教菩萨在这有形有相的万法里执着，他行善断恶，也叫佛，但他不知道手掌当下就是拳头。</div><div class=\"text-indent\">那么通教菩萨他眼见手掌，心里呢，似乎悟到那个拳头，但悟的不真实，他知道一切的万法都是一个真心变现出来的，但怎么样变他不懂。通教认为：掌不是拳，拳不是掌，色不是空，空不是色。他灭相见空性，认为这是大解脱。</div><div class=\"text-indent\">那么别教呢，掌是我，拳也是我；色是我，空也是我。同时他最大的问题，就是认为每一个人都能成为一尊佛。</div><div class=\"text-indent\">那就这个拳头大法而言，圆教则是看手掌当下就是拳头——即掌即拳，即色即空。看这里一个指头，当下是不是拳头啊？看三个指头，当下是不是拳头啊？那么这里的一当下是不是这里的三呐？都是一个本体。所以圆教呢，是在相即是见性，在一相即是无量相，在二相即是八相，在九相即是一万相，没有哪一相不是哪一相。</div><div class=\"text-indent\">通教要破除一切的相——这一切的相本来就是我，它给漏掉了67，他能成佛吗？所以他修得非常非常好，非常非常认真，只能破除一分灭相无明见空性；别教要经三大阿僧祇劫，再经过无量劫才能成就，就是因为他有个我执——我要成佛——虽然成佛以后要度化一切众生，但他认为每一个人都成一尊佛，这就对自己造成巨大的障碍。所以他超不出十二分法性身！而且修得很苦。</div><div class=\"text-indent\">圆教非常妙，听经闻法就明白一切的万法都是我；他不需要灭相见性，他在相就见性，无相也是我，有相也是我。只要把这个我执破除掉，刻骨铭心深信不疑，他就是一步登天。在《楞严经》讲啊：「决定成佛，譬如以尘扬于顺风，有何艰险？」「何藉劬劳，肯綮修证？」越是真理越简单，越是成佛越容易，只问你信不信。圆顿大法只愁悟不愁证68，诸佛菩萨祖师大德都是这样教化。所以「色不异空，空不异色。色即是空，空即是色」，是告诉我们：你还修吗？一念信解，蒙佛授记，你当下就是佛啊！你当下就承认呐！你即是佛，佛即是你呀，只要你相信！那么有些同修讲：「我就是相信啊，那我为什么现在不能千变万化呀？我现在还有烦恼习气呀。」这是我们普遍存在的疑惑，是不是？</div><div class=\"text-indent\">我们现在为什么得不到妙用呢？就是因为肉团身这个无明壳束缚我们，眼耳鼻舌身意这六种妄想心在障碍我们，在调虎离山；可是我们里面那个真心，它能不能调动啊？调动不了。只要我们明白这个道理以后，一旦中阴现前，肉团身这个无明壳解体，眼耳鼻舌这六种妄想心销亡，唯一的第七识当下做主；他这个时候呢，会把我们在有生之年听闻「如来藏」道理时所证得的一切功德现量现前，是走这个过程。佛为什么给法华会上的菩萨授记呀？因为他是过来人，他知道你在肉团身的时候即已当下成佛。</div><div class=\"text-indent\">它不是眼根对灯光产生的，明白吗？它在心里本来就有。真实讲来，它是随缘而显现。这叫不叫破因缘法啊？不叫。它不是由眼根对灯光产生，亦非不由眼根对灯光产生，这就圆满了。这叫「非因缘非不因缘」。《楞严经》这个法讲得很正确，但是讲得太高度概括，我们不容易理解。它是讲非因缘非不因缘，破因缘之相，不破因缘之性，不舍因缘之用。一般的人认为非因缘就是破了因缘法，错了——你破除了因缘法等于是断灭空。我们真心本来面目一定要随因缘而显现。</div><div class=\"text-indent\">那想一想，在没有造业、在我们没有父母之缘而生之前，这个十二因缘在不在啊？在，就在我们的心中！都是我们自己的一个念变现，父母也是一念变现，造的一切业也是一念变现，我们自己受的果报都是一念变现。真心中本来就具备这种性具功德，它随十二因缘而显现为三世因果报应。</div><div class=\"text-indent\">我问大家：在我们真心本来面目里，有没有这种有形有相的修证啊？没有。但是这种修证，它的性具功德在不在啊？（在）。这就是真空妙有。我们是对有说无。我在这里其实把小法大法已圆融起来了，是不是？我们是对有说空，在说这个空的当下就是有啊；如果没有的话，他能不能想起来修这种法门啊？（不能）。在我们心中都是本来存在。讲空讲有都是方便法，我们的真心非空非有，它可以现空现有。那空如来藏是不是无为法呀？用方便法讲是无为法，究竟法讲，它是不是无为法啊？它也是有为法啊，是我们一念心现出来的。我们的真心非有为非无为，它可以现有为现无为，无为就是有为，有为就是无为。</div><div class=\"text-indent\">「亦无老死尽」，这个道理是不是刚才都解释了？我们真空中哪有什么老啊，死啊这些东西？没有啊！可是用究竟法来讲，你如果没有的话，怎么能显现出老不老和死不死啊？没有大米，没有白面，能不能做出糕点来啊？巧妇难为无米之炊。所以我们心中本来就存在这种东西，虽然无形无相，但它是真实存在。亦无老死尽，但可以现老死，现老死尽，老死是轮回，老死尽是得道证果。</div><div class=\"text-indent\">所谓正信，就是明白宇宙人生的真理。你现在对于「万法唯一人一念之所变现」这一句话，刻骨铭心，深信不疑，则为正信，是为信解之相。佛在《法华经?分别功德品第十七》讲得很清楚，你这一念信解，能证到从罗汉位乃至到地上菩萨，到等觉菩萨都说不准。只看你信得深浅而已，但是最低保障不落三恶道。同时还讲，一念信解〈如来寿量品〉（佛讲这一品仅仅是半小时而已），你的功德比修持戒、布施、忍辱、精进、禅定——以这五度法门包含无量法门——修八十万亿那由他劫（八十万亿那由他劫就可以看成无量劫），简而言之，比你修无量法门无量劫的功德还大无量倍。仅仅是一念正信呐！佛讲不是大千倍、万倍、万万倍、亿亿倍，而是大无量倍，不可思议啊74！</div><div class=\"text-indent\">正信佛法就是减法修行，越是真理越简单，「假传万卷书，真传一句话」。就是一朵「妙莲华」，就是一句「如是我闻」，就是一句「阿弥陀佛」，就是一句「如是等」。大根机之人听几句话便成就了。我在这十多年传法中遇到这么两三个人，两三个人而已。他听了十来句话，不到十分钟，明心见性了。哎呀，那个磕头如捣蒜一样，讲话都发抖，那不是装出来的，他几十年都在追求宇宙人生的道理。师父几句话就给他点破了，当下明白。</div><div class=\"text-indent\">诸佛出世是教我们做一个真人，了生脱死，生生世世大福报。只有做到了真人，他才能圆融、圆满、圆通，从根本上行一切善，断一切恶。做真人不是做善人，却是做更圆满的大善人、真善人。《华严经》讲啊：忘失菩提心，修诸善法，是名魔业。一个没有明白道理的人，佛讲，十方三世的好事给你做绝了，都是「魔业」，仍然六道轮回。</div><div class=\"text-indent\">为什么我特别强调正信「如来藏」太重要！太重要！太重要！而我的个别弟子，仍然对这个大法持有怀疑，强调什么真修实证，都不知道修心明理才是真修实证；而且这些人往往是对自己要求比较严格、比较圆满的人，所以回大向小。往往一些人优点具足，但是呢，优点本身就成为自己最大的障碍；往往有些人缺点很多，但往往却成为他解脱成就的最大动力，你说好玩不好玩？任何人都不可以执着，你看那些优点非常圆满的人却不能成就，是不是很可惜啊？</div><div class=\"text-indent\">二者，择土精进。佛在《无量寿经》讲，在娑婆世界修行1天胜过在西方极乐世界修行100年。而极乐世界一天等于娑婆世界一个大劫，这个帐你算算。往生极乐世界以后，是赖在那里享清福，就等着成佛？还是回到娑婆世界来，采取积极的态度，争取早日成佛？有人感到奇怪：「啊，极乐世界还不如娑婆世界啊？」这要看你从哪个角度来讲。你愿意享清福，永远不落六道轮回，那就在极乐世界；你想赶快成佛，那就到娑婆世界——因为极乐世界太快乐，没有苦乐、明暗种种对比；没有对比就不容易开智慧，就不容易奋发图强。希望受持《法华经》《楞严经》的同修，往生到极乐世界以后，跟阿弥陀佛打一个招呼，再见，速回本土教化众生，我们要下这个海。</div><div class=\"text-indent\">你要准备受气。心里千万不要有想法，认为谁欺负我，谁怎么长谁怎么短——你那是无聊。当我的出家弟子，没有什么道理好讲，我这个人从来不讲理。没有哪个好，没有哪个坏。我只看你能不能抓住当下，能不能忍得过这一时。有什么道理好讲啊？所有的人都是自己一个人，讲什么理啊？跟谁讲啊？是非好坏长短都是一个人、一个念，你跟谁讲理？谁是谁？谁又不是谁啊？你不是无聊啊！我到慈航净苑的第一天就是这么讲的，走到哪里我都是这么讲。你只要来法华道场听经，你就成就了；要么当下成就，要么明天成就，要么明年成就，要么来世成就——最迟最迟不超过五十六亿七千万年，在弥勒第三会，是不是？</div><div class=\"text-indent\">「真实菩提心」就是明心见性。明白「如来藏」道理，你这个菩提心一发不可收拾。「发」即是成就、爆发，你想退没有退路，你都没有办法不成佛。一念明白十方法界万法都是你，就是供养了一切佛，你就是一切佛。</div><div class=\"text-indent\">你知道一切的万法都是当人当下一念变现，这是「性定」，「自性本定」。这是真正的「如来大定」，不可思议的「如来大定」，而不是「境定」79。你动也是定，定也是定，除了定你还是定；并不是通教禅宗修的那种虚空爆炸——什么也不看，在这里脑袋一片空白，但正念不忘。这种定不是如来大定。「如来大定」即空即有，即定即不定。定也好，不定也好，知道都是我，好好想想这个定厉害不厉害？</div><div class=\"text-indent\">那么成就了这种「如来大定」，你在定中也好，在梦中也好，就在清净中也好——天上飞下来一尊佛，地下冒出来一个鬼，你怕不怕呀？「过来过来，听我讲经说法」，是不是啊？始终是居高临下，管你是佛还是魔，我也没有必要去评价你——佛也是我，魔也是我。即使是原子弹爆炸，整个虚空世界全部毁灭，他还在那里如如不动，明白吗？这个肉团身我不要了，我们的那个灵体就是在原子弹爆炸中，它有没有什么影响啊？什么影响也没有。到时候我们可以现无量的色身三昧来救度众生，更不要说什么死亡不死亡，哪有什么死亡啊？真正「死」了的人，他没有死的概念。</div><div class=\"text-indent\">那修「如来大定」呢，我们知道，耳闻目睹一切万法都是我一心之所变现；然后烦恼习气现前的时候呢，「哎呀，谁是谁啊，谁不是谁啊」——他心里始终保持清净平等，在生时、病时、死时，它都是这一念，灵明不昧，多自在！这叫「定」，叫「性定」，叫「自性本定」。</div><div class=\"text-indent\">可是要改变自己的烦恼习气，要有智慧，要有定力，要发大愿。绝大多数人不存在能不能改的问题，只存在愿不愿改。我经常劝导修行人，你可发愿半天、一天、乃至三天，这期间内，我就是一心想到怎样让别人快乐，怎样让周围的环境安定——没有一个念为自己。然后你再总结，哪种生活好？你一定讲是无我更自在，是不是啊？可是我们由于无量劫以来的烦恼习气，境界现前的时候，我们往往不是心能转境，而是心被境转。这就是一种懈怠。大多数人都是知道自己这个习气不好，又想改；但是呢，他讲改不掉。改不掉是假的，不愿改是真的。没有改不掉的东西，脑袋都可以给人家，这个烦恼习气你就扔不掉？所以叫作「除」。</div><div class=\"text-indent\">我们有时候对于一些烦心事，是不是越想越烦恼啊？一旦看破放下，你当下是不是感到自在了？就看你怎样想，你要会用心。其实烦恼本来不是烦恼，你把它当成烦恼，叫庸人自扰，世间有句俗语——君子坦荡荡，小人长戚戚。</div><div class=\"text-indent\">换个说法，十方三世，上至诸佛菩萨，下至天人鬼畜，旁及山河大地、日月星辰、树木花草、泥巴瓦块、风云雨雾、乃及红黄黑白、是非长短、香甜苦辣酸臭，这天地万法无非诸佛法身真常，无非一人一念变现而已92。真心本性非空非有，非生非灭，非不生非不灭，非一非多，非真非妄，非佛非众；而是随缘现空现有，现生现灭，现不生现不灭，现一现多，现真现妄，现佛现众。如人在梦，梦境万千，仔细想来，此梦中人事岂是他人，何关别事，实乃梦中之人一念变现而已。</div></div>"
  }
]