[
  {
    "title": "普门品讲记",
    "html": "<div class=\"B1_text\"><h2 class=\"text-indent\">▌<strong>观世音菩萨普门品</strong></h2><div><div class=\"text-indent\">首先从『观音』二字来着眼。对于那些问难佛法的人来讲，还『观音』，音是眼睛能观的吗？『音』应该用什么东西来『观』呐？用耳朵啊！耳朵听音嘛，眼观色相，耳闻声嘛！他就不懂得佛法的妙用，更不懂得观世音菩萨法门的六根通用。如果我不讲『观世音』，叫「观世色」，行不行？我叫「观世香、观世味、观世触」，行不行？或叫「耳闻色、耳闻香、耳尝味」，行不行？这么一讲，那些外道更加暴跳如雷了：讲的这是人话吗？回答：我讲的是佛话。</div><div class=\"text-indent\">这就是〈观世音菩萨普门品〉。先来解释『觀』字。这个繁体字，前面是「雚」，后面是「见」，「雚见」。比如说这个罐子（不透明的空瓶子），你眼睛能不能看到里面什么东西啊？不能。心能不能看到？我们知道罐子里面肯定是空的。可是眼睛能不能看到里面的空啊？不能。这就叫见性。</div><div class=\"text-indent\">觀，我们对耳闻目睹身受的东西是不是都在『觀』呐？我听到一种牛叫的声音，耳朵听到声音，那我们心里能不能知道这是牛？牛它是不是『阿弥陀佛』啊？没有一法不可以作如是的观照。鼻子闻香，舌头尝味，（觀）这个味道它的真实性，是不是是味非味啊？味是谁啊？它怎么来的？是不是都是我们的心变出来的？所以这个『觀』就是在相要见性。听到一个声音，它是不是一个『觀』字？尝到一个味道，它是不是『觀』字？都是『觀』字。六道凡夫他之所以是六道凡夫，他只见雚（罐），他不知道里面是空。他只知道香啊、味啊、触啊、法啊，他不见里面的真实本性。他在六尘、六根这种色相里在妄想、分别执著，这就是凡夫的悲剧。他没有见到里面那个空性、那个真心。这是以罐子里面的虚空比喻真空。你可不要把虚空就当成真空，比喻就是比喻。</div><div class=\"text-indent\">那么现代汉语文字改革，把这『觀』字简化为「又」和「见」。「又见」就更好解释，凡夫的眼睛只能是一见，看到什么就当成什么。就比如还以看罐子来讲。这是罐子，再看一眼，还是罐子嘛，有什么话讲啊？那么我们又见的时候——还是打比方，心里能不能见到里面空啊？又见的话这个瓶子就是释迦牟尼、就是阿弥陀、就是我、就是如来，能不能见到这个问题？「又见」，见不见之见。那个「又见」，那第二「见」就是转我们的邪知邪见为佛知佛见；那个「又见」就叫修证、修行、修心。而且这个「又」还可以解释为反反复复观照，来提升我们的境界，积累我们的道行。</div><div class=\"text-indent\">你把这个道理明白了，念『南无观世音菩萨』跟『南无阿弥陀佛』有没有区别？你念「南无茶杯」、「南无大西瓜」、「南无大黑桃」跟『南无阿弥陀佛』有没有区别啊？都没有啊！『法华三昧』就妙在这里，一念明白，当下成就三昧。这个三昧是无上三昧啊！比修精进、忍辱、禅定、布施那些三昧功德大无量倍。请看〈随喜功德品〉是不是这样讲啊？</div><div class=\"text-indent\">继续讲『观世音』。这个『世』包括世间出世间。这个『音』包括世间出世间一切的万法——眼耳鼻舌身意六根对色声香味触法六尘产生的六种意识，三六一十八界。笼统地讲为，五蕴、六入、十二处、十八界、地水火风空见识，在《楞严经》归纳为四科七大，无非『如来藏妙真如性』。这就是『观世音』。既然四科七大皆归『如来藏妙真如性』，既然都是妙真如性，有没有哪一法不是哪一法啊？所以世间出世间之音是不是一切法呀？统统包含在内。这就是圆顿大法，全性起修，一修一切修。</div><div class=\"text-indent\">那么在《法华经》里为什么叫『观世音』，而不叫观世光、观世味？虽然我们刚才讲了观世音、观世光、观世色都是对的，那叫分别不妨无分别；但是根据娑婆世界这个时间、空间众生根机的特点，在六根之中相对而言耳根特别灵啊，所以以音声作为此方的教体，故名观世音。</div><div class=\"text-indent\">有些人反对净土念佛法门，说文殊菩萨讲了，观世音菩萨就是修禅宗啊！最适合于娑婆世界。这是对观世音菩萨法门的误解。文殊菩萨选观世音菩萨这个法门就是因为他从闻思修、『闻』字上作文章。『闻』什么？必须通过闻大法开智慧。其实讲念佛法门，你真正把阿弥陀佛道理搞明白了，不也是『闻』？不也是〈观世音菩萨普门品〉？他就不懂得这样来圆融。</div><div class=\"text-indent\">大家不要争这个宗、那个宗，都不重要，把『如来藏』这个宗搞明白最重要，其它就是万法平等！文殊菩萨讲『归元性无二』，就是『如是我闻』，然后你修什么法门都是一样的。什么都是第一，但是必须要先见道，先明白『如是我闻』。如果讲第一的话，是『如是我闻』第一。为什么？每一部经前面第一句话就是『如是我闻』，你懂不懂？你把『如是我闻』搞明白了，你一天到晚「南无泥巴瓦块」、「南无泥巴瓦块」都成就。泥巴瓦块是不是阿弥陀佛？都是啊！这真是千古奇冤呐！佛在《法华经》、《楞严经》讲得很清楚，我们就是在瞎子摸大象！</div><div class=\"text-indent\">下面来看正文。</div><div class=\"text-indent\"><strong>【尔时，无尽意菩萨即从座起，偏袒右肩，合掌向佛，而作是言：世尊，观世音菩萨以何因缘，名观世音？】</strong></div><div class=\"text-indent\">无尽意菩萨是〈观世音菩萨普门品〉的一个当机。为什么由无尽意菩萨来作为当机？这有缘起。佛及菩萨的圣号，都是从他所有功德而安立的。无尽意菩萨之所以得名无尽意，是依他的什么功德而安立的？无尽意菩萨不忍见无穷尽的众生长期受诸苦恼，就从内心深处发起无尽悲愿，愿度无尽世界中的无尽众生，令无尽众生成佛，而后自己方成佛，所以称为「无尽意」。</div><div class=\"text-indent\">即从座起：『座』在佛法里是见性、见理、见空之智慧。也就是『如是我闻』的『如』，『阿弥陀佛』的『阿』。你不见『如』，不见『阿』，不见这个本性，你是门外汉。『起』呢，表诸佛菩萨从空出有，大做佛事，自利利他。也就是『如是我闻』的『是』，『阿弥陀佛』的『弥陀』，『如来』的『来』，也就是讲「不空如来藏」，也就是讲「不变随缘」。如果不从座起的话那就是阿罗汉，自了汉而已。到了禅宗的见空性，已经不同于阿罗汉的见空性，禅宗的见空性已经知道万法都是自己一念，他在这种空性中就能加持世界，加持众生。禅宗灭一分灭相无明，证一分法身，即可成为摩诃萨，他已经能够大大地利益众生。那么『即从座起』，最低标准是别教位的菩萨。</div><div class=\"text-indent\">偏袒右肩：这也是体现出『法华三昧』开权显实。『右肩』表方便智慧、方便菩提。左肩表真实智慧，有它才能起平衡作用。没有左肩在这里，你右肩再有本事显示不了。右肩怎么『偏袒』呢？一般南传佛教地区，外面披一个搭衣，里面不可以穿衣服的，右肩膀露在外面。那么眼睛看到了右肩，左肩虽然遮在这里，心里能不能看到啊？能够看到，一定也是肉的，肯定不是铁的、铜的，也不是钢筋混凝土，这叫开权显实，这叫『法华三昧』。所以前面的观世音那个『观』是不是偏袒右肩，是不是开权显实？都是这个道理。要会观照。</div><div class=\"text-indent\">合掌向佛：一者，表恭敬心；二者，表权实不二、福慧不二。一般左手表实，右手表权，权实不二；左手表智慧，右手表福报，表福慧双修；或者左手表『如』，右手表『是』，这叫『如是我闻』；左手表『阿』，右手叫『弥陀』，『阿弥陀佛』。我们是一合掌，『阿弥陀佛』。所以我们要把学过的种种的名相概念、法理法义，融汇贯通。而『合掌向佛』，『合掌』就是『佛』，你知道什么是『佛』了。</div><div class=\"text-indent\">而作是言：『而作』是表智慧，表报身佛；『是言』是表真理，表真实语；『是』就是真，而作真言。所以这里的『是』，不能用世间法来讲——这个是，那个不是。在佛法里，是与不是都是『是』，都是我们一个念变出来的。『是』就是当下这一念，当下这一处。是与不是都是我。</div><div class=\"text-indent\">世尊，观世音菩萨，以何因缘名观世音：无尽意向佛请法。这就是菩萨在彻法源底，打破沙锅问到底。他明明知道是观世音之名，还要了解观世音之实。这是不是在求权实不二啊？是不是知道了『弥陀』，我也要知道到底怎么是『阿』呀？</div><div class=\"text-indent\"><strong>【佛告无尽意菩萨：善男子，若有无量百千万亿众生，受诸苦恼，闻是观世音菩萨，一心称名，观世音菩萨即时观其音声，皆得解脱。】</strong></div><div class=\"text-indent\">这里往下是从十四种无畏的角度来开示观世音菩萨的名号。这已经不是打官腔。前面方便品里已经打过了，诸佛出世就是『开示悟入』佛之知见，就是『唯以一大事因缘』。这一段是对下等根机众生说法。所以从这十四个无畏来开示体悟『如来藏』真实义。</div><div class=\"text-indent\">第一个无畏，叫「苦恼难无畏」——众生受诸苦恼，只要明白观世音名号，即可解除。这一切的苦恼从哪里来的？是不是心里变现出来的？那一切的自在是不是也是心里变现出来的？放下是不是很简单呢？所以这叫『一心称名』。</div><div class=\"text-indent\">就跟天平一样，一边是观世音名号，一边是我的妄想心。你这个妄想心真正把『观世音菩萨』名号的法理法义明白了，天平是不是就平了？一平了，那这边是『观世音』，你这边是不是也就是『观世音』呐？那『观世音』自在，是不是你也就自在了？</div><div class=\"text-indent\">六道轮回是不是也叫『一心称名』啊？凡夫一心称的这个『名』是名闻利养。因缘果报，丝毫不爽，如同天平，叫『一心称名』。你怎么样称，你就得什么解脱。『观世音』，从音声而到观色，到香触法，一切都看空、都见性，一切都是我的这一个念。如此的心量，他自然得大自在，这叫『一心称名』。整个修行过程，看你这个心跟谁在称，跟谁在平衡。跟阿弥陀佛、观世音称，就跟阿弥陀佛、观世音平衡。</div><div class=\"text-indent\">即时观其音声：是『应供』。上街给人家偷了五百块钱，你观照一下：那个偷钱的人是谁啊？是不是你自己啊？人民币是不是你自己啊？有什么好执著的？金山银山你能带走一分？我这一生能够不饿死、不冻死，能明白『如来藏』的道理，你比当天王元帅都自在。人到无求品自高啊！唐朝的庞居士把万贯家财扔掉了，为何来哉啊！顺治皇帝江山美人、金银财宝都不要，剃头。所为何来啊？阿弥陀佛、释迦牟尼，放着转轮圣王不当，当和尚。为何啊？一想就明白了，追求真理得大解脱，这才是我们的最究竟最高尚的志向。这是不是叫『观世音』？是不是『即时观其音声』？是不是当下就得到『应供』？我们对一切的万法怎么观，一切的万法它就怎么样来供养你。</div><div class=\"text-indent\">皆得解脱：这是真的。我经常劝导弟子和信众们：你们不妨试行两天三天，哪怕是半天，当半天如来，行不行？这半天脑袋绷得紧紧的，以佛的心态来看待一切的万法。看到老爸老妈的时候想到他就是我、我就他，都是一念变出来的，生死都是假的。我如果对他过分的情执，只会障碍他，所以心里马上就放下。看到姥姥、姥爷、小孙子都是一样的观照，看到牛马猪羊都是一样的观照，都是我们一个念变出来的。始终保持这种心态很重要啊！</div><div class=\"text-indent\">《楞严经》讲：心能转境，即同如来。你当下就是『如来』，就看你观照不观照，看你是不是『一心称名』。明白道理以后，就是遇到强盗土匪你还不至于惊慌；就是遇到山崩海啸你也不害怕，马上换一个身来，平平静静。如果说地震了，赶快求往生。你还「观世音菩萨救命啊！」有没有必要？没有必要，什么也都想得开。但是，大难当前，求观世音菩萨仍然奏效，我们要坚信不疑。为什么能求到？因为这时他放下了一切妄念，达到了「金刚三昧」，你所有的念都没有了，就是观世音，力量不可思议。就跟一个人后面强盗在追，跑到前面一条大河，他只想到怎样逃命——那个张老汉还欠我三万块钱，什么时候给我啊？他会不会打这个妄想啊？不会啊！每一个人都有体会啊！</div><div class=\"text-indent\">比如在梦中，在定中，一些人来干扰你，显得很难过，你这个时候「阿弥陀佛、阿弥陀佛……」，你一边念阿弥陀佛一边在打妄想的时候，你这个东西不能解除，他越难受越难受就逼着你没有妄想了。嗳！魔境就解除了。记好，都是我们自己救自己。这也叫事三昧。你明白『如来藏』以后，不会遇到这些事。那些邪鬼邪神眼睛都睁不开，更无法靠近你。这种情况叫「理三昧」；「理三昧」成就之后你通行无阻。「理三昧」没有成就，你遇到急难险阻能达到「事三昧」也能救自己。「事三昧」难以成就，而且只能解决人天福报，逢凶化吉可以，但它不能叫你开智慧。而「理三昧」呢，福慧具足，你当下已经成佛。你凭这种定力能够把自己保护起来。</div><div class=\"text-indent\">这里是笼统地解释一下后面有什么「贼」啊、「火」啊什么东西，这叫理事圆融。有些人掉到水里持观世音菩萨名，遇到火烧持观世音菩萨名，他就能得到感应。这个可不是迷信呢！这是真的。还有些人过去世中已经成就了这种功德，自己遇到水难、火难之时，他不知道持观世音不持观世音，他都能得到佛菩萨的护持，我们这里邝老妈就是这样的人。这位菩萨一字不识，从来没有进过哪个画家学院，你看画的那八十八佛栩栩如生，而且她在好几次劫难中死里逃生。</div><div class=\"text-indent\">所以，「理三昧」和「事三昧」的功德一样不一样啊？不一样。往往看到有人讲〈观世音菩萨普门品〉仅仅从事相上来解释，很不圆满，而且叫人不容易相信。而懂得佛法的人是不会怀疑的。对于绝大多数人来讲，他不「耳闻目睹」是不会相信的。</div><div class=\"text-indent\">如果按照「事三昧」来解经文也能讲得通。你在非常烦恼的时候，念观世音菩萨名号，即使没有达到三昧，也能减轻一点苦恼。如果念出三昧，是不是苦恼就解除了？你就尝到了这种念佛三昧的功德。这就是念佛，持观世音菩萨名号就是念佛三昧。</div><div class=\"text-indent\">修行人一定要学会调整我们的心态，扭转境界，这个世界上的事情都不重要，做生意亏本了，家庭破裂了，夫妻离异了，父母不慈悲，儿女不孝顺，朋友不讲信用，遭到别人的陷害等等等等，都不重要；重要的是我们要明白所发生的这些事情是怎么回事，与我生生世世解脱相比，它属于什么样的位置？我们要得到的是自在安乐解脱。佛不度人，唯人自度。</div><div class=\"text-indent\">过去真正的「结夏安居」干什么？大家互相求对方来批评。现在修行人带有普遍性，很难破除我执，他总有一个「我」，神圣不可侵犯。这指我们自性烦恼。你如果换一种心态：一切伤害我的人都是成就我，打我骂我我都要感恩——你当下得大自在。看看一切的苦恼难，都是我们自己的事情，与别人没有关系。人家都是我的老师，都是我的恩人，他都是来帮助我的。其实道理简单得不能再简单。</div><div class=\"text-indent\">持观世音菩萨名号，就是回光返照。事相上念观世音菩萨名，念阿弥陀佛名，是间接地提醒我们；而明白『观世音菩萨、阿弥陀佛』这个法理，是直接地打开我们的心理障碍。所以第一个「苦恼难无畏」带有总纲性。下面的那些苦恼再具体分别说明。</div><div class=\"text-indent\"><strong>【若有持是观世音菩萨名者，设入大火，火不能烧，由是菩萨威神力故。若为大水所漂，称其名号，即得浅处。若有百千万亿众生，为求金、银、琉璃、砗磲、玛瑙、珊瑚、琥珀、真珠等宝，入于大海，假使黑风吹其船舫，飘堕罗刹鬼国，其中若有乃至一人，称观世音菩萨名者，是诸人等，皆得解脱罗刹之难。以是因缘，名观世音。】</strong></div><div class=\"text-indent\">第二个无畏叫「火难无畏」。在过去佛法里有公案。上海吴淞有一位居士修观世音菩萨法门，仇家趁着大风月黑，连续给他放火三次都烧不着。后来这个冤家醒悟了，跪下来向他忏悔。这里一定有奥妙，请你饶恕我的罪过，请你把这个道理告诉我。所以他讲了：我没有其它呀！就是天天在念观世音菩萨的名号。</div><div class=\"text-indent\">持名号者，也能得到观世音菩萨护法神明的加持，不一定观世音菩萨亲自来。这个火呢，如果用第一义观照，是指烦恼之火。烦恼就是热恼。明白了『观世音菩萨』名号，烦恼之火当下息除。无明火已熄灭了，那身外的火能不能伤害我们呐？《楞严经》里讲到，迦叶波三个兄弟修火观，他们在火里吃饭，在火里睡觉，都没有关系。在电视里也看到过，一大群少数民族的人脚在火里踩，而不受其害。因为通过禅定的观照，他这个心与火已经融为一体。我们的心想什么，你就是什么。心里想佛，想『如来藏』，你是不是就是佛，就是『如来藏』啊？</div><div class=\"text-indent\">而各种苦难，层次不一。在欲界，火能杀人，水能杀人，为什么？因为你执著，你没有解开火与你的关系，就要受苦报、恶报。那么这个恶业之难、果报之难就是我们种种的名闻利养、贪嗔痴习气而造成。恶业之难，遍于三界。怎么遍于三界呢？比如说，我们虽然口不犯、身不犯，但你意念里仍然有火，仍然有贪心，在整个三界乃至天堂你都要受报应。但那种报应不是太苦，它叫你不能明心见性。甚至在天堂福报满了以后，还要从总体上往下落，但是与在六道轮回里这种频繁的恶报不一样，那也叫恶业之难。那么烦恼之难呢，通于九界乃至菩萨界。比如说贪心这个无明火，不从根本上消除的话，在等觉菩萨位都还有生相无明。</div><div class=\"text-indent\">同样这个难呢，通大通小，通凡通圣。一般的解释在欲界范围之内比较多。这也是从总体上概述一下。难的大小与我们心态的清净度成反比，心越清净你遭难越小，或者遇到这些难后，你解除的越彻底。修行人要勇猛精进，多作观照，不断提升品位，成就我们证道位的功德。我记得少说也有两三个同修跟我提起这个问题，说他现在想恨一个人都恨不起来了。这种人是不是解除了火难了？他不会下地狱了，也不会再在六道里轮回。</div><div class=\"text-indent\">由是菩萨威神力故：这个『威神力』就是明心见性的法力道力。那如果再涉及到欲界里这种苦恼难，善人能得到护法神灵保佑。我们理事都要圆融。</div><div class=\"text-indent\">若为大水所漂，称其名号，即得浅处：佛法公案里也有。有位居士落入水里，他自己没有念，却听到耳边讲：这个人是念观世音菩萨的。随后，护法神就把他救出来，落得浅处。我们真正受持三皈五戒，每一种戒都有二十五位菩萨来护持你。耶输陀罗跳火海，一朵金莲华把她托起来。从第一义来讲，水是表贪心，小孩子看到好吃的东西，口水就流出来了。一个人马上就要发一笔大财的时候，红光满面，神采飞扬。他就有一种润湿、亮光。</div><div class=\"text-indent\">明白了『如来藏』真实义，贪心不起，是不是很清净呐？你就解除了水难。贪心是一种情执，必往下沉。当然也有些人修水观三昧，在定中他是一滩水。还有人修四禅八定，入定以后与万法融为一体。虚云老和尚当年掉到水里，给渔夫捞起来了，他都不知道自己什么时候落到水里去了。捞出来时，他还在定中。有这种功夫的人他也淹不死。</div><div class=\"text-indent\">所以落入水难，这里的情况很复杂，不能一概而论。解释这个〈普门品〉，基本上从理和事这两种角度来观照，理和事都是指功夫。另外再从持戒，能够得到护法神灵护持，这个角度来观照。多方面，不要局限于一处。</div><div class=\"text-indent\">若有百千万亿众生，为求金银、琉璃、车磲、玛瑙、珊瑚、琥珀、真珠等宝，入于大海，假使黑风吹其船舫，飘堕罗剎鬼国，其中若有乃至一人称观世音菩萨名者，是诸人等，皆得解脱：</div><div class=\"text-indent\">好像是在唐朝时，有个波斯国，有一大批商人乘船飘到海岛去了。这个海岛就出来一大群美女欢迎他们。这些商人一想：哎呀！这么荒无人烟的孤岛怎么可能有这么多美女在这里啊？一想不对头，肯定是鬼。所以其中有一个人念观世音菩萨，这些美女就消失了。注意，你不懂如来藏，念阿弥陀佛，念观世音菩萨，不能往生，不能成佛；但是对于解除鬼难魔难很重要，人天福报还是有。</div><div class=\"text-indent\">用第一义谛来观照，为求金银、琉璃、车磲、玛瑙，是表修行无量法门。由于我们不明白『如来藏』，很可能遭受种种的魔境——附体上身呐，或者遭到自己心魔呐，或者遇到一些鬼魔虽然不附你的体，通过其他身来诱导你啊，或者给你传一些邪法啊。在《楞严经》五十种阴魔境界讲得比较多，就出现这种情况，就叫作『入于大海』，『大海』也是佛法大海啊！</div><div class=\"text-indent\">黑风吹其船舫：道场干扰我们的清净心。黑风，表我执，我们的邪知邪见就是心魔；船舫，比喻心地道场。船舫，两只船连在一起叫『船舫』。飘堕罗剎鬼国，指外魔干扰或者附体、或者面对面来误导我们。那么在这个时候呢，『其中若有乃至一人』乃至一念，你一念能明白『如来藏』的道理，叫『悟则无咎』，你当下就能离开一切的鬼境，离开一切的烦恼。这就是智慧的功德，一悟一切悟。所以这个『乃至一人』可以表一念，你一念能救自己，能救许许多多的人。</div><div class=\"text-indent\">黑风就是无明风动，包括对我们在修行中出现的殊胜境界，你如果执著的话都有可能走火入魔。但是明白『如来藏』道理的人，不管在什么境界都没有关系，到什么境界你都去教化众生。因为走火入魔，是你给他牵着鼻子走。我们走火入佛呢？我牵着鬼魔的鼻子走。他就是佛来，你也度他，不要在我面前装腔作势——「佛来佛斩、魔来魔斩」，这是禅宗的境界；用『圆顿大法』的境界：「佛来度佛、魔来度魔」。这个法很妙啊！你不怕走火入魔，来得越多越好，铺天盖地来都行，听我作报告，你这个气派多大呀？你始终是居高临下——我就是佛，我就是菩萨，因为真理在我手里，我有尚方宝剑，你不要跟我来这一套。</div><div class=\"text-indent\">皆得解脱，罗剎之难，以是因缘，名观世音：这里讲罗刹难，后面还有风难，这两个难的解释基本上一样。罗刹难就是鬼难，鬼难就是由于妄想多造成的迷惑颠倒。</div><div class=\"text-indent\"><strong>【若复有人，临当被害，称观世音菩萨名者，彼所执刀杖，寻段段坏，而得解脱。若三千大千国土，满中夜叉罗刹，欲来恼人，闻其称观世音菩萨名者，是诸恶鬼尚不能以恶眼视之，况复加害。设复有人，若有罪，若无罪，杻械枷锁检系其身，称观世音菩萨名者，皆悉断坏，即得解脱。】</strong></div><div class=\"text-indent\">这是第五种，叫作「刀兵难无畏」。要给人家杀头了，称念观世音菩萨名号，头没有断，刀就断了。『称』是特指「事一心三昧」完全成就的人，他有两种情况：这个刀要么就从他头上撇过去，刀也不坏，脑袋也不掉；要么就是刀砍下来，脑袋不掉，刀断了。这是一种在证道位的「事一心三昧」。</div><div class=\"text-indent\">据说当年是济公活佛在灵隐寺遇到强盗，强盗要杀人抢劫。济公和尚说没有关系，你从我先杀起，你能把我杀掉的话，这里和尚都给你杀；如果杀不掉呢，你一个都不能杀。那个强盗感到好玩，济公脑袋一伸，他杀来杀去，刀过去了，头掉不下来。还有当年六祖慧能，冤亲债主去杀他，杀他就跟杀空气一样，感到莫名其妙的。六祖慧能讲：我只欠你金，不欠你的命，你杀我的命干什么？强盗最后跪下来拜他为师。</div><div class=\"text-indent\">所以观世音菩萨修这个圆通法门，在《楞严经》叫『旋妄归真』。他把外面的「色声香味触法」这六尘，通过观照全部变成自己的自性，跟自己是一个心，没有分别。人总观照自己是虚空的话，你能穿墙越壁，毫发无伤。但是外道的这种功夫经不起金器啊、刀啊，因为外道还有我执。修阿罗汉道、修菩萨道的人破除了我执，你刀也砍不过去，也杀不掉，因为他没有「我」了。</div><div class=\"text-indent\">你不要怕鬼魔，因为他有我执在，斗不过你。只要你心里不怕他，还可以把他降伏。那为什么讲三恶道？三恶道就是比人道的道行低。不要被他的那五种神通吓坏了。人身难得，可惜不知道珍惜。在妖魔鬼怪面前，人都是自己把自己吓死。身上有附体的人呐，你跟他和解，来教化他，会变敌为友，会变成你的护法，这是真的。有些人被附体了，自己疼得惶惶不可终日，神魂颠倒，就是因为他没有处理好人与鬼神之间的关系。</div><div class=\"text-indent\">在佛法里讲「魔来魔斩、佛来佛斩」，你只管斩，是魔，他经不起你的考验；是佛呢，还赞叹你。刚才讲你的念变成风、变成光，如果你把这个念变成刀，那么我这个法性的刀比你烦恼中的刀更厉害，硬碰硬，你断我不断。这并不是神话传说，我们的心就是不可思议的。但是没有破除我执的人，你这是走火入魔，到最后会变成狂魔。</div><div class=\"text-indent\">那么作为第一义谛观照，万法都是「我」，心里的烦恼也好，外来的烦恼也好，我只要自己如如不动，外来的烦恼不攻自破，内来的烦恼也自行化解。『刀』是指我执，「放下屠刀，立地成佛」，就是叫我们放下我执。已经修行的人仍然在我执里遭难。还有明明知道是我执，他还放不下，这就很麻烦。</div><div class=\"text-indent\">若三千大千国土，满中夜叉罗剎欲来恼人，闻其称观世音菩萨名者，是诸恶鬼，尚不能以恶眼视之，况复加害：</div><div class=\"text-indent\">第六个难叫「罗刹难无畏」，这里的「罗刹难」跟前面的「罗刹难」有两种说法。前者是我们在修行的过程中遇到的那种修行上的障碍；这里属于在外部环境上，外部的鬼魔想来伤害我们。这是分别说法。也有的把这两种都作为修行中的或者是心魔，或者是外来的魔，也可以是冤亲债主。两种说法我们都可以圆融。</div><div class=\"text-indent\">称诵观世音菩萨名号，能够达到事相上的一心三昧，你这个时候叫『称』，所现的就是观世音菩萨的那种形相、那种威力。由于你心力很强，光速度很快；这种震动使罗刹等不堪忍受，好像看到你都要犯心脏病。第二呢，你这种心力光波比他的光波强，所以他眼睛都睁不开。我记得看了一个观世音传奇，那个坏人想害龙女，结果龙女眼睛给他一睁，他就头晕目眩站不住。这就是在于各人的心力和心的速度。</div><div class=\"text-indent\">讲来讲去，一个是「事三昧」，一个是「理三昧」。「事三昧」除了是争取实证求得，在某种特定的环境之下也能成就，他什么都忘记了。有一个人从来没有修三昧，什么也没有练，他在一大堆火里，大概跑了有半个多小时。他什么功夫也没有，后来一点点事都没有。为什么呢？他说自己就什么也没有想到，就想到里面有钱。他想不到任何的疼痛。</div><div class=\"text-indent\">如果「理三昧」成就的人呢，一般就没有这个危险状况的发生。那么「事三昧」的出现呢？在危急的情况之下每一个人都可以出现这种「事三昧」。可能不少人已经出现了，不过大部分都是在梦中出现的。梦中遇到这些鬼魔来恼乱我们的时候，只要你赶快念「阿弥陀佛阿弥陀佛……」。一开始不走，越不走你念得越急，反正你只管念，反正这条命给他拼了，到最后他自然走了。他念到最后自然而念，什么也不顾了，就变成一句「阿弥陀佛」。</div><div class=\"text-indent\">设复有人，若有罪、若无罪，杻械枷锁检系其身，称观世音菩萨名者，皆悉断坏，即得解脱：</div><div class=\"text-indent\">这第七个难是「枷难无畏」。『若有罪、若无罪』，这里一般的『若有罪』是属于今生世中的造业。『若无罪』是属于前世造业，流转到今世来受报，或者是有罪被官府抓捕，或者是无罪被人陷害抓捕，带枷呀、带手铐、带镣啊。『杻械』是脚镣手铐；『枷锁』是两种刑具。『检』呢，重罪犯关在笼子里头。对武艺高强的人用铁笼子锁起来。『系』是用绳子捆。所以在这种情况之下，如果能够称念观世音名号，什么都不顾了，就成为一种事相上的这个三昧。他也能够把这些刑具破除掉。这是一种三昧的力量，都是真实的。</div><div class=\"text-indent\">有形有相的修证包括种种的神通都属于第二义谛，如果讲第一义谛呢，我们观照到一切的万法统统会归自性。眼耳鼻舌身意这六根、色声香味触法这六尘，统统都是我们一个念变出来的，统统会归『如来藏妙真如性』，刻骨铭心地深信不疑万法都是我们一个人一个念而已，于此看破放下，能够破除一切的烦恼。首先破除儿女情长这种情执。</div><div class=\"text-indent\">修行的过程中，最大的枷锁脚链来自于我们的家庭。『杻械』在手，比喻夫妻情分把你手都捆住了；『枷』在颈脖是比喻父母，凡夫的那种孝顺、孝心像泰山一样把你压住了。封建社会的伦理道德啊，叫「父母在，不远游」。『锁』是儿女。这是我们对家庭要尽的三种责任。『检』就等于是一个家庭，就跟牢笼一样把你困在里头。『系』就是方方面面对你的牵制。所以对家庭尽责任呢，这在我们人伦道德里是一种美德、社会美德——这个人真好！对父母孝顺，对儿女慈悲，夫妻恩爱。这是人伦美德。可佛法里来讲，就变成了一种束缚，变成了一种情执，而障碍自己的道行。你叫他来好好听经闻法，讲这样的经百千万劫难遭遇啊！难遭遇啊！可是他有种种理由，这些理由来讲都是通情达理的——老爸老妈在家里没有人照顾，小外甥没有人照顾，或是夫妻之间分不开或者怎么样。你要叫他说专门一起来共修，放下一切——不行，要等父母告终以后，要等儿女成家以后，还要怎么怎么样。这样的人很多。这些心情用世间法来讲完全可以理解啊！可是我们面对来世的无量的百千万劫怎么办？此身不向今生度，更向何生度此身？没有两全其美啊！只有权衡利弊。</div><div class=\"text-indent\">真能放下这三把枷锁，你能成就道行，这才叫大慈大悲、大孝大顺、大心。这是真正的慈悲孝顺！有些人暂时放下了父母儿女，但是你将来会生生世世关照他们，而且关照你生生世世的父母儿女的生生世世。要把这个帐算明白啊！人命在呼吸之间啊！就是『杻械枷锁』害得我们生生世世这种情执；连畜生都知道执著——你看这个猫啊、狗啊，看看自己生下的那个小狗，那舌头不停地舔它们，这都是情执。欲界众生最大的问题就是情执。到了第七层天以上的人，慢慢地才比较淡化，所以他的生命相对而言比欲界众生更为殊胜，通彻、光亮、透明。欲界的人有几个不是面黄肌瘦啊？还以为我们有多潇洒、多美啊？照照镜子你就知道。就是因为我们的情执太重、妄想太多。</div><div class=\"text-indent\">明白了『观世音』，明白了『如来藏』，明白了『阿弥陀』，一切的『检系枷锁』都能粉碎，都不能障碍我们。一个人铁了心以后是不是什么都不在乎啊？最能感慨的就是那些腰缠百万亿的大富翁，这些人一旦搞得倾家荡产、流浪街头的时候，要么就是跳楼自杀，要么就是哈哈大笑：我解脱了！我终于醒悟了！我过去腰缠万贯却活得那么累，我现在终于自在了！地位、财产、名誉、家庭像山一样压在我们头上。顺治皇帝的体会最明白：「百年三万六千日，不如僧家半日闲」。我终于解脱了。你说当皇帝多累啊！</div><div class=\"text-indent\">有智慧的人扔掉的不要的东西，没有智慧的人去抢、去夺。这是真正的『杻械枷锁检系其身』。在太原慈航净苑经常有些人说：哎呀！我家里什么什么事情走不开。我说你可不要以为在这儿听经的都是没事干的人啊！有的人家里不知道比你多多少事情，你去问问看。你越是放不下，我跟你讲，你事情就越多，什么事情都往你头上来。人就是这个样子的。你再想一想，我死了以后他们还不过啊？有没有哪一个家庭把爹娘都死了以后家人都不过了？在某种意义上过得还不差。龟有龟路、蛇有蛇路、鳖有鳖路，它到时候自然就来。今生的福报早有天定，不会影响的。</div><div class=\"text-indent\">当你真正迈开了这一步再回头看一看，你就会发现过去种种的担心都是多余的，你会叹一口气：哎呀！怎么不早走这一步啊？你后悔自己走迟了。也就是说你要放心。因为你认真地学佛，你的家庭会过得更好，他能得佛力加持；同时每个人都有自在的应变能力。因为你放不下他们反而害了他们，他过分地依赖你。就跟现在人类过分地依赖医学一样，使我们本来可以健身治病的种种的功能部分地乃至全部地失去。根据科学家的研究，人的生命活一百八十岁左右属于正常死亡，现在都活不到，八九十岁就以为是长寿的。其实统统都是短命鬼。这可是真的，因为我们失去了应变能力。</div><div class=\"text-indent\"><strong>【若三千大千国土，满中冤贼，有一商主，将诸商人，赍持重宝，经过险路，其中一人作是唱言：诸善男子，勿得恐怖！汝等应当一心称观世音菩萨名号，是菩萨能以无畏施于众生；汝等若称名者，于此冤贼当得解脱。众商人闻，俱发声言：南无观世音菩萨！称其名故即得解脱。无尽意，观世音菩萨摩诃萨威神之力，巍巍如是。】</strong></div><div class=\"text-indent\">公案里记载，有一个比丘尼看到一队强盗来了，自己蹲到树边就是念观世音菩萨名号，结果那一伙强人看都没有看她就走了。还有一位商人带了一车货，前面有土匪拦路抢劫，要想车子掉头也来不及了。这时车上有一个人说：来，我帮你赶车。后来过了那个地方以后，问他你是什么人啊？他说叫阿逝孕，猛然想起大悲咒上是不是有阿逝孕啊？所以受持观世音菩萨名号，能得到护法神明的感应帮助。那在这个时候，能给对方造成一种心电干扰，怨贼当时生不起恶念来。</div><div class=\"text-indent\">这是讲这个恶报之难，通于欲界，这些具体的外来的贼难、鬼难这是恶报。那么这恶怨之难呢？遍于三界。恶怨就是比喻我们种种的心魔烦恼，在《楞严经》把六根说为「内贼」，六尘说为「外贼」，六种意识心说为什么贼啊？「贼媒」。这三种贼一直在伤害我们的法身慧命，我们却不自知，迷于其中，这是最可怕的。明火执仗的强贼我们能感应到，那么烦恼贼呢？一直通到等觉菩萨、九法界。等觉菩萨都还有生相无明没有破，这也是烦恼贼。</div><div class=\"text-indent\">这段经文这第八个难呢，叫作「贼难无畏」。</div><div class=\"text-indent\">三千大千国土，比喻我们的第八识「阿赖耶识」。满中怨贼呢，就是第八识里储存了我们无始劫以来所造的种种业种子。商主，是比喻第六识。第六识能动性很大，它能攀缘过去、现在、未来，我们造业也是以这个意识心为主，成佛回光返照也要靠它。诸商人，为五种意识心，观照为眼耳鼻舌身这五根。我们的意识心可以指导这五根造业，指导五根修行。修行可看成在经商一样，进行一种产业，我们就能得到成就，这种成就是求解脱。重宝，为大小中三乘佛法无量法宝。明心见性以后，无量法门皆可成就。即使没有见道，我们修无量法门，总能得到多少不等的收获或成果。包括外道也能得到人天福报。经过险路，这是我们以佛知佛见来调整邪知邪见——修行人这种修证的过程。是不是跟走路一样啊？</div><div class=\"text-indent\">其中一人作是唱言，这是表佛知佛见，是究竟了义真胜义法。『其中一人』解释为一念。《法华经》讲，『一念欢喜，蒙佛授记』。一念授记，我们彻底解脱。这里『诸善男子，勿得恐怖！汝等应当一心称观世音菩萨名号』，『一心』就是表我们的真心本来面目。称观世音菩萨的名号，就是我们前面对『观世音菩萨』的解释。</div><div class=\"text-indent\">是菩萨能以无畏施于众生：这个『菩萨』就是我们自己，就是『一心三藏』，就是「我独无所畏」。一个明心见性的人，他知道时时、事事、处处都是自己，根本就没有别人，这是不是最大的『无畏』啊？没有生死啊！你要命，给你，我马上换一个更殊胜的命。「民不畏死，奈何以死畏之」？为什么不怕？这是假的，这个东西不是「我」，尽虚空遍法界都是「我」。把这个我执放下，把我过去种种烦恼习气我不要了，我就得到了全体。我们可怜就可怜在执著于这个肉团身是我，执著这个家庭是我，这个父母儿女是我的。你不知道一切的万法如梦幻泡影，都是我们在梦中一个念变化而已！</div><div class=\"text-indent\">所以『汝等若称名者』，『称名』从第一义解，就是道交感应。你明白了『观世音』，你就是观世音，其它的种种的烦恼习气没有了。如果按照事相上的那种念佛三昧，你到了那种情况之下只管念观世音菩萨名号，这个心电感应能够改变你的处境，包括那些怨贼、虎狼等等。</div><div class=\"text-indent\">众商人闻，俱发声言：这个『众商人』，前面讲是五根五识，这个『众商人』包括全身的皮肉筋骨细胞，统统集中一个念。一个肉团身上有无量的神识、无量的生命——眼耳鼻舌、心肝脾胃、皮肉筋骨、头发指甲里面的无量的细胞，等等等等。每一个癌细胞就是一个冤亲债主，就是一个众生。为什么一个人自杀要下无间地狱啊？一个人自杀等于无量的他杀。为什么最后成佛的时候有无量的分身佛啊？他跟你都是一个本体。我们随便打一个妄想都是一个众生，不是好就是坏。所以要把这个心控制好。在《楞严经》第九卷就要传到这个法。</div><div class=\"text-indent\">人为万物之灵啊！因为你一个人的解脱，你这个肉体无量的众生都解脱。这个法很重要啊！要好好想一想。这一个身就是一个佛土。那么将来在你成就的那片佛土上就产生了无量的分身佛，就是你这个肉团身；那么还有无量的菩萨大众跟在你后面修行，就是你生生世世来的恩恩怨怨的、一切的外部众生，你带着他们来成就。那么，我们今天在释迦牟尼佛法中修行，因为释迦牟尼佛在过去世中跟我们有种种的缘分，他来帮助我们。</div><div class=\"text-indent\">那我们成佛了以后，我们是不是也有生生世世的这些缘分？比如在这里；我与张居士也有缘分，与李和尚也有缘分，那如果张居士先成佛的话，那肯定是张居士来帮助我。可见，大家在一起共修是不是更好啊？互相成就。自己去闭关是一种方便法，也是把自己孤立起来了，得不到道场这种集体的加持。</div><div class=\"text-indent\">无尽意，观世音菩萨摩诃萨，威神之力，巍巍如是：这个『观世音菩萨』是谁啊？就是阿弥陀，就是『如来藏』。一念明白『如来藏』，这个『威力』就是『巍巍如是』，整个尽虚空遍法界统统在我们控制之中。明白了这个道理，鬼来鬼度，魔来魔度，始终居高临下。我就是教主，老实听我给你传法，不要在我面前耍什么花招！那些鬼啊、魔啊、阿修罗啊都会跪下来拜你，恭维你。</div><div class=\"text-indent\"><strong>【若有众生多于淫欲，常念恭敬观世音菩萨，便得离欲；若多嗔恚，常念恭敬观世音菩萨，便得离嗔；若多愚痴，常念恭敬观世音菩萨，便得离痴。无尽意，观世音菩萨有如是等大威神力，多所饶益，是故众生常应心念。】</strong></div><div class=\"text-indent\">第九种无畏，叫「贪毒无畏」。男女这种欲望也属于一种贪心，是一种欲火。明白了万法都是我，心地得清凉，欲望产生不了。为什么大乘佛法强调入世修行？小乘法修行采取掩耳盗铃，走路都不敢看，那种戒本身就在刺激自己的心，他是种逆反心理，反而解决不了这个问题，变成了一种情执，心事沉甸甸的，不能开智慧。在法华会、楞严会上，是不是男女四众弟子都在啊？这是老佛爷传的法。可是有些道场不能理解，反而诽谤。其实他诽谤的同时，自己就是一种男女欲望，因为他心往那里想。</div><div class=\"text-indent\">两个和尚走路，遇上大水，其中一个和尚把一个妇女就背在肩膀上过河了，过河就放下了。走了十几里路，另外一个和尚还在讲：我想不通你为什么要把女人背在肩膀上过河？所以这个和尚说：啊！我早就放下了，你还没有放下啊？就这个道理。</div><div class=\"text-indent\">常念观世音菩萨名号，常作『一心三藏』的观照，我们这个心情平静自在，就能破除种种的贪心欲望。大乘菩萨论心不论事；但是防止有些人以这种借口来破戒犯戒，这又当别论。对于种种的戒律戒规，凡是一个团体不可以没有，防止各种各样的人来找借口破戒、犯戒，毁坏道场。佛法是圆融的，它不是执著于哪一面。对于这种情况，除了用『一心三藏』来观照，平时有种种欲望的念头的时候，还可以持诵一段时间的观世音菩萨名号，也能把心平静下来。</div><div class=\"text-indent\">若多瞋恚，常念恭敬观世音菩萨，便得离瞋：</div><div class=\"text-indent\">这第十个叫「瞋毒无畏」。『瞋』就是嗔恨心。有些人好嫉怀于人，对于冤亲债主总是放不下。嗔恨心是一大忌讳，你多少年的功德会因为一念嗔恨心前功尽弃。在某种程度上，它比那个贪毒还厉害，它叫你前功尽弃！那么按照『如来藏』的观照，按照观世音菩萨的那种过六关，按照在《楞严经》讲的『旋妄归真』，归到一个自性，得到平等心、清净心。一切的烦恼自然而然化为乌有，就是一种调整心态。</div><div class=\"text-indent\">若多愚痴，常念恭敬观世音菩萨，便得离痴：</div><div class=\"text-indent\">这是第十一种，叫「痴毒无畏」。这里的『愚痴』是针对佛门内部的所知障而言，不是指世间法里的那种愚痴。世间法里的那种愚痴已经成了障碍，他根本没有办法来念观世音，是属于三途八难那一类的。所知障也叫「智障」，自以为知道的很多。</div><div class=\"text-indent\">无尽意，观世音菩萨有如是等大威神力，多所饶益，是故众生常应心念：再三强调『如来藏』这个法门，『观世音、阿弥陀佛、如是我闻』这个法门。明白了这个道理，这种『威神之力』不可思议。『是故众生常应心念』，这是佛换一个角度，对于下等根机的众生做劝导。『常』是时时事事处处；『应』就是使我们这个生灭心与十法界一切的万法，通过『一心三藏』来道交感应。怎么样道交感应呢？每一个念都是『一心三藏』。十法界任何一法，法法皆是『一心三藏』。我们这一个心上念念都是十法界，这叫『常应心念』。注意这四个字，至关重要，也就相当于《阿弥陀经》的『发愿往生』，也就相当于《阿弥陀经》的『临命终时』。『临命终时』，我们这个现出来的有形有相的这种肉团生命、虚妄的生命，就与我们的法身慧命，终于圆满为一体。那在这里就『常应心念』，时时事事处处我们这个肉团身这个妄命、与我们的法身慧命都是道交感应、念念在道，是从另外一个角度来讲这个法。</div><div class=\"text-indent\">越读是不是越觉得〈普门品〉就是《阿弥陀经》？它从另外一种不同的角度开示。就跟师父一会儿讲「国富民强」，一会儿讲『如是我闻』，一会儿讲《过五关度六将证菩提》。听来听去，都是讲『如来藏』，就是讲那个东西。三藏十二部经都是在讲这个东西。《法华经》从头到尾都在讲这个东西，没有其它的法，就是在讲『一心三藏』，在讲『阿弥陀佛』。</div><div class=\"text-indent\"><strong>【若有女人，设欲求男，礼拜供养观世音菩萨，便生福德智慧之男；设欲求女，便生端正有相之女，宿植德本，众人爱敬。无尽意，观世音菩萨有如是力。若有众生，恭敬礼拜观世音菩萨，福不唐捐。是故众生，皆应受持观世音菩萨名号。】</strong></div><div class=\"text-indent\">这里是十二「求男无畏」，十三「求女无畏」。这两个一起解释。在慈航净苑到现在大概有五六个人，经过师父安排，求观世音菩萨都求到。第一个求来的是江西人，生了个男孩儿，后拿一万块钱来给寺院还愿。其中曾文芳老师她那个小妹夫原来还不信佛法，后来烧了这么粗的香还拜，并拿了三千块钱来给我，他说许了愿。我说你怎么也信佛了？因为生了个儿子，她说还有的人家一求就怀孕了。这可是真的。这属于特殊情况，与护法神灵道交感应，要给人家一个机会就此能正信佛法。佛法也好玩呢，它既通方便，也通第一义。</div><div class=\"text-indent\">所以这两种功德分别为男女之义。我们一念不动而观照到全体都是「我」，这是不是带有顶天立地这种男子汉的味道啊？我们转识成智，包容万法、圆通万法，是不是带有女众的治家这种味道？而且带有帮助别人之义，帮助别人是不是带有生养生育之义？带有照顾之义、带有慈母的这种气氛，这叫女义。</div><div class=\"text-indent\">所以我们在观照『如来藏』修转六根六尘、旋妄归真的这个过程中，成就了我们承担如来家业、顶天立地的大男子汉气派，也成就了我们包容、慈悲、关怀一切万法的慈母气氛。这是男女之义。</div><div class=\"text-indent\">观世音菩萨有如是力，若有众生恭敬礼拜观世音菩萨，福不唐捐：跟前面一样的口吻，翻来覆去强调观世音菩萨有如是力，是不是反复强调《法华经》不可思议啊？再换一个口吻，让下等根机的众生容易接受。『如是力』是不是讲『如是我闻』？是不是讲『阿弥陀』？处处指归啊！现在明白了『观世音』这个法理，你就是『观世音』！『若有众生恭敬礼拜观世音菩萨』，『恭敬礼拜』就是时时观照『观世音』的本来面目。『福不唐捐』，指对如来、诸菩萨的善念信力不会是白白无意义的，都会得到福果相应。</div><div class=\"text-indent\">是故众生，皆应受持观世音菩萨名号：所以每一部经前面第一句话，就是「观世音我闻」，是不是啊？『如是我闻』是不是「观世音我闻」呐？『如是我闻』就是讲『众生皆应受持观世音菩萨名号』。</div><div class=\"text-indent\"><strong>【无尽意，若有人受持六十二亿恒河沙菩萨名字，复尽形供养饮食、衣服、卧具、医药，于汝意云何？是善男子善女人功德多不？无尽意言：甚多！世尊。</strong></div><div class=\"text-indent\"><strong>佛言：若复有人，受持观世音菩萨名号，乃至一时礼拜供养，是二人福，正等无异，于百千万亿劫不可穷尽。无尽意，受持观世音菩萨名号，得如是无量无边福德之利。】</strong></div><div class=\"text-indent\">六十二亿恒河沙：『六十二』包括我们全部的智慧德能，它包括无量。前面是不是有六十二种邪见啊？有六十二种邪见，对应六十二种佛知佛见啊。『六十二』后面加一个『亿恒河沙』。『恒河沙』是无量数、不可思议数，也就是说你受持『六十二亿恒河沙数』的菩萨，受持无量的尽虚空遍法界所有的佛菩萨的名字；而且『尽形供养』，生生世世尽你的寿命在供养——你的寿命是无量，你所供养的是无量，这个功德是不是大呀？那么这个功德与你受持观世音菩萨的名号，一个人对无量，一时一事也是对无量，这个功德正等无异；与前面的『一念信解』功德，比那个修持布施、持戒、忍辱、精进、禅定，修八十万亿那由他劫的功德大无量无量倍，这是不是一脉相承啊？因为『八十万亿那由他劫』是有量的，而修五种功德也是有量的，所以『一念信解』功德是它的无量倍。那么在这里，『六十二亿』这个无量的功德，『尽形寿』是无量的时间，两个无量对无量。</div><div class=\"text-indent\">那么反过来讲，受持六十二亿恒河沙中任何一个菩萨的名号，也等于受持六十二亿恒河沙数的观世音菩萨名号的功德，对不对啊？这就真正懂得了，这叫「持名无畏」，没有哪一个不是哪一个。「一即无量，无量即一」。不管受持哪一个都是受持无量。</div><div class=\"text-indent\">无尽意，受持观世音菩萨名号，得如是无量无边福德之利：这里跟称赞『阿弥陀佛』万德洪名有没有任何区别啊？没有。所以称『阿弥陀佛』也好，称『观世音』也好，先明白『如是我闻』，就明白了名号的功德。然后一句佛号就能成就，对不对？完全对。不是你一天到晚稀里糊涂就是念一句佛号，这两种情况不一样。师父讲过，「唸佛不能往生、不能成佛；念佛一定往生、念佛一定成佛；念佛当下往生、念佛当下成佛」。现在所谓的一句佛号，你光唸有什么用？你把它搞懂了，你念也成佛，不念也成佛，这里是不是你念一时等于念无量的佛啊？什么叫念佛？这叫念佛，这样的念佛当下成就。一句就是无量句，一时就是无量劫。</div><div class=\"text-indent\">藕益大师对『得如是无量无边福德之力』这段经文的解释非常妙，他讲了，这就是『阿弥陀佛』万德洪名。一名一字，法尔具足三千性相、十法界万法。当知『观世音』即『阿弥陀』，〈普门品〉即《阿弥陀经》。</div><div class=\"text-indent\"><strong>【无尽意菩萨白佛言：世尊，观世音菩萨，云何游此娑婆世界？云何而为众生说法？方便之力，其事云何？】</strong></div><div class=\"text-indent\">前面无尽意向佛请法：观世音菩萨与娑婆世界众生结的这个缘是怎么回事？这里进一步请法，观世音菩萨怎样以他的神通道力、法力来帮助教化众生。在前面的十四无畏与其讲利他，还不如讲自利，是观世音菩萨通过观照，修『如来藏』之法成就自己。这里是讲观世音菩萨行利他功德。相对而言，利他功德是不是还是自利啊？那么前面的自利是不是还是利他？自他不二，他是不妨分别，我们总要分别，有个侧重而已。</div><div class=\"text-indent\"><strong>【佛告无尽意菩萨：善男子，若有国土众生应以佛身得度者，观世音菩萨即现佛身而为说法；应以辟支佛身得度者，即现辟支佛身而为说法；应以声闻身得度者，即现声闻身而为说法；应以梵王身得度者，即现梵王身而为说法；应以帝释身得度者，即现帝释身而为说法；应以自在天身得度者，即现自在天身而为说法；应以大自在天身得度者，即现大自在天身而为说法；应以天大将军身得度者，即现天大将军身而为说法；应以毗沙门身得度者，即现毗沙门身而为说法。】</strong></div><div class=\"text-indent\">第一个问题，观世音菩萨怎么能示现佛身呢？这是不是打妄语啊？不是。观世音菩萨本身就是古佛再来；即使初住位的菩萨都能现佛相，现无量的色身三昧；而且，心正，即行邪法也是正法。佛身有多种，藏教菩萨的佛身、通教佛身、别教的佛身、圆教的佛身。《金刚经》的佛相当于圆顿住位菩萨，别教《大方广佛华严经》那种佛相当于圆教二行位的菩萨；那么《法华经》圆顿的佛位，从初住位到妙觉位有四十二个等级，这四十二个等级明心见性的菩萨都叫『诸佛』，叫「分真即佛」。听经闻法当下成佛，是指「分真即佛」，是明心见性的菩萨。即现佛身说法，对藏教就说藏教，对通教说通教，对别教说别教，对圆教说圆教，根据对方的根机和等级。</div><div class=\"text-indent\">应以辟支佛身得度者，即现辟支佛身而为说法：辟支佛，是指缘觉修行人通过十二因缘而证果。</div><div class=\"text-indent\">应以声闻身得度者，即现声闻身而为说法：声闻身，是修证阿罗汉果位，修苦集灭道四圣谛。</div><div class=\"text-indent\">应以梵王身得度者，即现梵王身而为说法：『梵王』是指有色界天，修四禅八定的功夫。在印度教里，把梵王作为佛祖，作为印度人的上帝，然后修一种梵行，叫「离欲行」。离欲行就是不过男女生活。他们认为不过男女生活就能成佛，据说从五六岁的小孩子就要受戒，不准乱搞男女关系。大概十来岁就出家修行，不管是男女。腰上围一个薄薄的铁片，将薄铁片做成围裙，然后往那里一罩。这是受国家法律保护的，这个铁片一围就是不允许动我，否则会有国家制裁；然后三十岁到四十岁之间，出于人伦道德，回去生儿育女，后再出家。所以他这个心是清净的，叫「离欲行」。那么这种法最多能升天，不能成佛，这也是外道法。修大乘法对男女生活也特别强调，淫心不除，尘不可出。</div><div class=\"text-indent\">应以帝释身得度者，即现帝释身而为说法：帝释，是玉皇大帝，第二层天的天主。通过修行「十善」，就是《十善业道经》讲的身不犯杀盗淫，口不犯绮言、妄语、恶口、两舌，意不犯贪嗔痴。想当天王呢，要修上品。</div><div class=\"text-indent\">应以自在天身得度者，即现自在天身而为说法：自在天身，指第六层波旬魔王的天界。虽然是魔，他们前世也是行善断恶，拼命修人天福报，加上品十善和禅定功夫。这种禅定功夫叫「未到地定」，他没有达到初禅天的功夫；若达到了，他又进入第七天往上初禅、二禅、三禅、四禅。</div><div class=\"text-indent\">应以大自在天身得度者，即现大自在天身而为说法：大自在天，是有色界最高天，属于四禅天的境界。这个『大自在天』叫作「摩醯首罗天」，三头六臂，手里拿着一个白拂，骑着大白牛，悠悠哉哉。他可以在十方世界自在地参学、游玩。所以对于这一类的众生，观世音菩萨要给他们讲四禅八定啊，四无量心啊，更加拓宽他们的心量。</div><div class=\"text-indent\">应以天大将军身得度者，即现天大将军身而为说法：天大将军，一般说为第二层天的一些军事领导人，专门统领鬼神大众，他们的责任主要是保护国土，韦驮菩萨就是天大将军之一，护持佛法。其他一些大将军是保卫国土安全等等，直接受玉皇大帝的领导，防止阿修罗、妖魔鬼怪等破坏国土。对于这样的修行人，除了讲五戒十善，还要告诉他们一些秘密神咒，也通过神咒可以召唤鬼神之类。</div><div class=\"text-indent\">应以毗沙门身得度者，即现毗沙门身而为说法：毗沙门，在四大天王里是北方天王。</div><div class=\"text-indent\"><strong>【应以小王身得度者，即现小王身而为说法；应以长者身得度者，即现长者身而为说法；应以居士身得度者，即现居士身而为说法；应以宰官身得度者，即现宰官身而为说法；应以婆罗门身得度者，即现婆罗门身而为说法；应以比丘、比丘尼、优婆塞、优婆夷身得度者，即现比丘、比丘尼、优婆塞、优婆夷身而为说法；应以长者、居士、宰官、婆罗门妇女身得度者，即现妇女身而为说法；应以童男童女身得度者，即现童男童女身而为说法；应以天、龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽、人、非人等身得度者，即皆现之而为说法；应以执金刚神得度者，即现执金刚神而为说法。】</strong></div><div class=\"text-indent\">应以小王身得度者，即现小王身而为说法：这个『小王』包括须弥山山脚四大部洲，从金轮王、银轮王、铜轮王到铁轮王，以及各个国家的皇帝、国王、总统，都叫小王。这些王呢，相当于人王之类。对这些人说法，无非也是些安邦定国、施行仁政。为什么？因为有的国王还不信佛呢。不信佛那就给你讲怎样爱护民众，要公正廉明。</div><div class=\"text-indent\">应以长者身得度者，即现长者身而为说法：这个『长者』一般地是在一个地区或者一个家族、一个村这一片范围之内，那些德高望重、有一定地位权威、有一定学问、比较正直公平、能得到大家共同信赖的人，称为长者。出现家庭矛盾、社会矛盾，不需要通过官府，长者几句话就摆平。对于这些人，一般讲讲怎样地好善乐施啊、爱护文明啊、仁慈公平呐，传这些法。</div><div class=\"text-indent\">大家注意，往往今生今世的长者过去生生世世都是做长者。在中阴身期间，你检查一下你自己，你生生世世做的行业都是差不多的，都是习气而来。懂得这个道理是不是很重要啊？我们要学会当老师，特别是当这个菩萨的老师，我们生生世世就是菩萨的老师。</div><div class=\"text-indent\">这样的例子太多太多了。我上次讲的太原那个杨秉书记，他岳父四岁就给人家当裁缝师傅，他自己大剪刀拿不动，还可以指挥人家裁衣服。讲这个法你们明白吗？你今生今世发愿讲经说法，把经听懂了，今世今生开始登台，意味着你生生世世都是弘扬佛法。我们要发这个大心啊！现在大家开始准备啊！凡是准备登台的人提前告诉我，我都安排，给大家一个平台来亮亮相。</div><div class=\"text-indent\">应以居士身得度者，即现居士身而为说法：这里的『居士』不是在家佛弟子；是指那些在社会上有一定地位、财产、学识，但是他不愿意经商也不愿意做官，只愿意清闲的人，修身养性啊！茶杯一捧，谈古论今。对那些人（名闻利养心很重）传一些清心寡欲、洁身自好之法。这些人很好面子，以自己与世无争来自我标榜。现在也有这样的人，把这个名利看得很淡，他只要求得心理的平衡、清净自在。</div><div class=\"text-indent\">应以宰官身得度者，即现宰官身而为说法：『宰官』泛指官吏。就是对想当官的人，就现官身为他说法——仁政爱民啊、做事公道啊……等等。</div><div class=\"text-indent\">应以婆罗门身得度者，即现婆罗门身而为说法：『婆罗门』是古印度最胜种姓。他们垄断了古印度一切知识，包括医学啊、种种宗教方面的、传统文化方面的学问。婆罗门由于职责和地位的特殊可享有许多特权。比如不得被处以死刑，占有大量地产等等。除了祭司外，他们也担任宫廷文士、科学家(星象家，数学家)，教师和公务员。印度宗教上的权力完全掌握在此一阶层之中。印度以婆罗门阶级最具势力，故该国又有婆罗门国之别称。其民众所奉之宗教，称之为婆罗门教。</div><div class=\"text-indent\">应以比丘、比丘尼，优婆塞、优婆夷身得度者，即现比丘、比丘尼、优婆塞、优婆夷身而为说法：『优婆塞、优婆夷』就是男居士、女居士，是修行人。那么对于这些人主要讲的三皈五戒、三学——三学就是戒定慧三学，比丘戒、比丘尼戒、菩萨戒等等。</div><div class=\"text-indent\">应以长者、居士、宰官、婆罗门妇女身得度者，即现妇女身而为说法：这种『妇女』就是特定于长者的夫人、居士的夫人、当官的夫人、婆罗门的夫人。过去女人的天职就是「相夫教子」。丈夫在外面要成就事业，他也离不开妻子的帮助。但「相夫」，你不能去束缚他，你只能成就他；「教子」，特别是母亲，是孩子的第一任老师。为什么现在小孩子们很难教啊？一方面父母搞名闻利养，斗争很厉害，直接污染了孩子；同时，父母对教育孩子缺乏耐心，把他推给学校的老师。这在全世界是个普遍性的问题。</div><div class=\"text-indent\">应以童男童女身得度者，即现童男童女身而为说法：『童男童女』是没有受过男女生活染污之人。这种人容易成就，他妄想少。那么对于这一类人说法，一般地就是讲怎样洁身自好，保养自己的真气元气，保护自己的清净心。</div><div class=\"text-indent\">应以天龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽、人非人等身得度者，即皆现之而为说法：这是天龙八部，主要是给他们讲四禅八定、修上品十善。</div><div class=\"text-indent\">应以执金刚神得度者，即现执金刚神而为说法：『金刚神』都是护法神，这一类神是以恶相示现。凡是对那些刚强的众生，金刚神可以通过恶法来惩罚——恶相惩罚就是可以打、可以杀。在后面〈陀罗尼品第二十六〉就涉及到这方面的内容。</div><div class=\"text-indent\"><strong>【无尽意，是观世音菩萨成就如是功德，以种种形，游诸国土，度脱众生。是故汝等应当一心供养观世音菩萨，是观世音菩萨摩诃萨，于怖畏急难之中，能施无畏，是故此娑婆世界皆号之为施无畏者。】</strong></div><div class=\"text-indent\">『如是功德』就是『方便』，『方』就是『如』，『便』就是『是』。菩萨教化众生，无分别不妨分别。对个别的劣性众生讲大法，他接受不了，就通过世间善法慢慢引导。而妙音菩萨不管在什么时候对什么人，都是讲《妙法莲华经》。游诸国土：不光是娑婆世界，十方佛土都有观世音菩萨和妙音菩萨教化众生。</div><div class=\"text-indent\">是故汝等，应当一心供养观世音菩萨：想一想，观世音菩萨需要不需要我们供养啊？不需要。「应当」，『应』是道交感应，『当』是正当名分。明白了什么是『观世音』，你就是『应当供养观世音菩萨』，就是供养十方三世一切万法。再观照前面的观世音菩萨『成就如是功德』，我们明白了『观世音菩萨』，明白了『如来藏』道理，明白了『阿弥陀佛』，是不是就成就了『如是功德』？『如』也是你，『是』也是你，一切万法都是你。你以此心观照世界，即是以此心加持世界，即是以此心成就自己，这就是『应当供养』。</div><div class=\"text-indent\">是观世音菩萨摩诃萨，于怖畏急难之中能施无畏，是故此娑婆世界，皆号之为施无畏者：明白了『阿弥陀佛』，我们就是『阿弥陀佛』；明白了『观世音』，我们就是『观世音』；明白了十方三世一切万法皆是「我」，那就是我；明白了是我，就是我。这就是《法华经》讲『我独无所畏』。凡是明白了一心三藏道理的人，都是『施无畏』。明白了万法都是你，你就是布施了一切万法；明白这个道理，你没有任何的恐惧心。</div><div class=\"text-indent\"><strong>【无尽意菩萨白佛言：世尊，我今当供养观世音菩萨。即解颈众宝珠璎珞，价直百千两金而以与之，作是言：仁者，受此法施珍宝璎珞。时观世音菩萨不肯受之。无尽意复白观世音菩萨言：仁者，愍我等故，受此璎珞。】</strong></div><div class=\"text-indent\">无尽意菩萨节外生枝，来供养观世音。要知道佛菩萨的良苦用心，你看怎么样供养。『即解』就是前面讲的「应当供养」，『解』就是心开意解。明白了观世音菩萨的法理，他当下即是观世音菩萨，叫『即解』；心开意解的人左右逢源，头头是道。『解』什么？颈在这里，这是不是咽喉之地啊？这个地方卡住了，我们就完蛋了。所以这里是表中道了义。如果没有中道，我们对一切的问题的看法都是邪知邪见。所以『颈』至关紧要。不解决这个问题，一切修行都不能成就。明白了『一心三藏』的道理，无量的万法是不是都是一个念呐？都是无上之宝。众宝珠璎珞，是比喻我们的无量的智慧德能。价值百千两金，『百千』是表无量。</div><div class=\"text-indent\">所以这段表法，无尽意菩萨明白了『观世音』名号真实义，当下知道自己就是观世音，当下知道自己就是无量的珍宝，无量的万法都是自己。</div><div class=\"text-indent\">而以与之：『与之』这是请观世音菩萨印证。用我这个心来供养你，看我们这个心是不是一样的？『作是言：仁者，受此法施珍宝璎珞』。财产供养叫「财施」，他故意讲这个『法施』，话中有话。在佛法里有「三轮体空」的布施。三轮体空，张三供养李四，张三的心没有认为「我是张三，我是能供养者；你是李四，你是受供养者；我供养你一个西瓜，这是西瓜」，张三没有这三个念，他是一种自性的流露，就是通过这种布施供养来成就我们这种清净心。</div><div class=\"text-indent\">珍宝璎珞，是表这种法的殊胜，这是三轮体空的布施。仁者的「仁」，前面解释了，单人旁加一个「二」字，「二人」。他讲这个『仁者』也是求观世音菩萨印证，把你一个人看成这种仁，在前面是弥勒菩萨称文殊菩萨也是称『仁者』，『仁』表明心见性。两个人是不是一个真人一个假人呐？真人就是『如』，假人就是『是』。这就是『如是我闻』，你『闻』了没有。</div><div class=\"text-indent\">时，观世音菩萨不肯受之：虽然无尽意菩萨讲的是法施，是三轮体空的布施；那么观世音菩萨不肯受，又在表法，这叫不受三昧，一切不受。为什么不受啊？菩萨是受而不受，不受而受。怎么「受而不受」呢？他受过来也是为别人受，他不受也是受，别人受了是不是他自己受啊？自他不二，都是在表法。</div><div class=\"text-indent\">无尽意复白观世音菩萨言：仁者，愍我等故，受此璎珞：无尽意菩萨求观音菩萨哀悯他，为什么？我是代表一切的众生来供养你，得到圣者的加持。所以我们在救灾、在供养三宝、在放生的时候，不能有贡高我慢心。能够给我们提供一个布施供养的机会，我们应该感恩，你是在种福田。</div><div class=\"text-indent\"><strong>【尔时，佛告观世音菩萨：当愍此无尽意菩萨，及四众、天龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽、人非人等故，受是璎珞。即时观世音菩萨愍诸四众，及于天龙人非人等，受其璎珞，分作二分，一分奉释迦牟尼佛，一分奉多宝佛塔。无尽意，观世音菩萨，有如是自在神力，游于娑婆世界。】</strong></div><div class=\"text-indent\">佛在这里劝观世音菩萨：你怎么可以不受啊？所以出家人没有权利拒绝众生的供养；但是不可以找种种的借口去化缘，乃至诈骗众生的钱财。</div><div class=\"text-indent\">即时，观世音菩萨愍诸四众，及于天龙人非人等，受其璎珞，分作二分，一分奉释迦牟尼佛，一分奉多宝佛塔：观世音菩萨「借花献佛」。佛菩萨已经破除了我执，受与不受并没有什么区别。受在这里也是为了给大家用，不受放在他那里，他也还是我。</div><div class=\"text-indent\">我出家以后上的当可多了。几百、几千、几万都给人家骗，但是我从来不后悔，谁都骗不了三宝的钱。这个世界上没有一个人沾光，没有一个人吃亏，何况三宝还吃得了亏？该我的谁都拿不走，不是我的我也搞不到。福报是自己修来的。你如果被人家骗了，是因为你前世骗了人家的，还债了。你前世没有骗人家，他今生骗你的，来世还是你的。所以我们大可不必为这些事情去生烦恼。</div><div class=\"text-indent\">无尽意，观世音菩萨，有如是自在神力游于娑婆世界：『如是自在神力』，注意啊。在见道位、证道位都明白了『如来藏』，你即有如是自在神力。在见道位的人仍然受六根之束缚，不能发挥。</div><div class=\"text-indent\">【<strong>尔时，无尽意菩萨以偈问曰：</strong></div><div class=\"text-indent\"><strong>世尊妙相具，我今重问彼。佛子何因缘，名为观世音。</strong></div><div class=\"text-indent\"><strong>具足妙相尊，偈答无尽意：</strong></div><div class=\"text-indent\"><strong>汝听观音行，善应诸方所。弘誓深如海，历劫不思议，侍多千亿佛，发大清净愿。我为汝略说，闻名及见身，心念不空过，能灭诸有苦。】</strong></div><div class=\"text-indent\">世尊妙相具，这是对佛的赞叹。佛啊！你具足了三十二相、八十种随形好，具足了无量的智慧德相。『重问』，由于前面长行无尽意已向佛请法，这里以偈颂的方式再问一下。『彼』呢，还是涉及到观世音。</div><div class=\"text-indent\">具足妙相尊，偈答无尽意：所以佛也以偈颂的形式来回答无尽意菩萨的请法。</div><div class=\"text-indent\">汝听观音行：你应该明白观音菩萨的行持法门。善应诸方所：以观世音菩萨三十二应身遍入十方国土来比喻我们的真心本来面目不动道场遍十方界，三十二应是表无量的色身三昧。『诸方所』是十方世界，这就是这个普门神力。弘誓深如海：『弘』是大、广之义，这是从横向空间上来看；『深』是从纵向，从时间上来看，也就是弘誓深誓像大海。观世音之『弘誓』是遍十方三世一切万法。这是表我们真心本来面目。明白了真心本来面目这个本体，弘誓大愿发也发，不发也发。有道无道，自己知道。如果你还没有发起这个心来，你就检点一下自己明白了没有？历劫不思议：观世音菩萨发了大愿以后生生世世无量劫去践行。侍多千亿佛，发大清净愿：无分别不妨有分别，观世音菩萨在因地修行，在千万亿佛法中成就自己，成就了『大清净愿』。这个『清净愿』无非是视十方三世一切万法皆是「我」。怎样才能在十方三世一切万法中成就自己？以成就别人来作为成就自己，自他不二。</div><div class=\"text-indent\">我为汝略说，闻名及见身，心念不空过，能灭诸有苦：这四句偈是总讲。总讲必然要略讲啊。『闻名』是表见道，你懂不懂『观世音』？『见身』是表证道，在历事练心的过程中体会到法味，你就见到了身，尝到了法味。心念不空过：见道，证道，得到了智慧利用。时时事事处处都会用心观照，身口意三业随智慧行，这是『不空过』。能灭诸有苦：『诸有苦』通小通大——下至三界六道二十五有，上至等觉菩萨生相无明，都要通过见闻修证『一心三藏』来解决这些问题。</div><div class=\"text-indent\">【<strong>假使兴害意，推落大火坑，念彼观音力，火坑变成池。或漂流巨海，龙鱼诸鬼难，念彼观音力，波浪不能没。</strong></div><div class=\"text-indent\"><strong>或在须弥峯，为人所推堕，念彼观音力，如日虚空住。或被恶人逐，堕落金刚山，念彼观音力，不能损一毛。或值怨贼绕，各执刀加害，念彼观音力，咸即起慈心。或遭王难苦，临刑欲寿终，念彼观音力，刀寻段段坏。或囚禁枷锁，手足被杻械，念彼观音力，释然得解脱。</strong></div><div class=\"text-indent\"><strong>咒诅诸毒药，所欲害身者，念彼观音力，还着于本人。或遇恶罗刹，毒龙诸鬼等，念彼观音力，时悉不敢害。若恶兽围绕，利牙爪可怖，念彼观音力，疾走无边方。蚖蛇及蝮蝎，气毒烟火然，念彼观音力，寻声自回去。云雷鼓掣电，降雹澍大雨，念彼观音力，应时得消散。</strong></div><div class=\"text-indent\"><strong>众生被困厄，无量苦逼身，观音妙智力，能救世间苦。】</strong></div><div class=\"text-indent\">假使兴害意：『兴害意』既是自己的心魔，六根、六种意识起烦恼心，也是外尘色声香味触法、外面的鬼魔、冤亲债主伤害我们的法身慧命。推落大火坑：我们的法身慧命葬送在烦恼习气之中叫坠大火坑。观照『如来藏』，观照观世音菩萨，当下清凉自在。</div><div class=\"text-indent\">设想一下，如果我们为了某一桩事正在发雷霆之怒的时候，正在心慌意乱的时候，你想一想，谁是谁啊？当下清凉自在。就怕你想不起来，就怕你不愿意想。你只要一想：哎呀！有什么好烦恼？这个肉团都是假的，有什么好烦恼的？所以对世间人，老劝人你想开一点哦、想开一点哦！你越劝他还越想不开，唯有这个『如来藏』的道理，你自己去想吧。他自然而然就能想得开。真理是不可战胜的。火坑变成的这个池是指清凉池，使我们这个热恼的心变得清凉自在。</div><div class=\"text-indent\">或漂流巨海，龙鱼诸鬼难，念彼观音力，波浪不能没：这是指我们的人很贪心，贪心很大很乱，像大海那样，总是不能饱满。『龙鱼诸鬼难』，『诸』是表由我们贪心所遭受的种种烦恼，特别是为名闻利养所纠缠，就跟那个恶龙、恶鱼、恶鬼一样缠住了我们。这个时候想一想我们的真心本来面目。『波浪不能没』，这个贪心之水就不会伤害我们的法身慧命，要从第一义谛上来观照。</div><div class=\"text-indent\">或在须弥峰，为人所推堕。念彼观音力，如日虚空住：『须弥峰』是表贡高我慢心，总是好占上风。所以人家必然想办法来排斥你，叫『为人所推堕』。那你明白了『如来藏』，那个推堕你的人是谁啊？心里自然平衡。『如日虚空住』，『虚空住』就是前面讲的『如来座』，太阳是不是智慧啊？是不是住在虚空啊？所以你把这一点看破放下了，有了智慧是不是太阳啊？放下是不是空了？像太阳住在虚空，住而不住。这个心不可思议啊！</div><div class=\"text-indent\">或被恶人逐，堕落金刚山。念彼观音力，不能损一毛：这个『恶人』是指我们的无明风动、妄想分别。听说这几天太原刮大风，有些人在楼房上给吹下来了，还有的广告牌吹得把人砸死了；而我们自己的无明痴风比那些狂风还要厉害，不知不觉地把我们的法身慧命吹得无量劫在六道里轮回。堕落金刚山：『落』到高处去了。说明我们的无明妄想啊，总是飞扬浮躁，没有哪个无明妄想非要往低处走，都是往高处走。你盲目地自高自大。所以这句话如果世间的语文老师来改的话，他肯定判成病句，只能堕落大海中，哪还『堕落金刚山』？这就是妙法。念彼观音力，不能损一毛：明白了『如来藏』，我们的无明妄想转为智慧，我们见到的一切万法都是「我」，没有一法不是「我」，叫『不能损一毛』，这是表心外无法，法外无心，一根毫毛都不能损。大光明藏中不漏一人，不舍一法——这里可以再加一句：「不损一毛」。</div><div class=\"text-indent\">或值怨贼绕，各执刀加害。念彼观音力，咸即起慈心：怨贼，这都是我执。六根、六识是内贼；六尘是外贼，内贼外贼是不是都是自己啊？都是自己的烦恼。这个『刀』就是我执之刀。念彼观音力，咸即起慈心：放下屠刀，立地成佛。</div><div class=\"text-indent\">或遭王难苦，临刑欲寿终。念彼观音力，刀寻段段坏：这个『王难』这是指我们所造的种种的罪业，是我们种种的业障。临刑欲寿终，观照为「临命终时」。念彼观音力，刀寻段段坏：当一切的业障向我们袭来的时候，以『如来藏』而观照，这一个个的业障自行地土崩瓦解，转烦恼为菩提，转苦为乐。即使你在监狱中，在街头流浪，你仍然得自在。这个『临刑欲寿终』，按照分别法说为我们临死的时候，这个『刀寻段段坏』也可以观照为变三途恶道为佛土。</div><div class=\"text-indent\">或囚禁枷锁，手足被杻械，念彼观音力，释然得解脱：囚禁，这里是比喻家庭；枷锁，是表父母；杻，是表夫妻；械，是表儿女。夫妻、父母、儿女可以讲为三把枷锁。合起来呢，家庭就是个牢笼，牢笼加三把枷锁。你听得害怕不害怕？我们现在家庭里有个小别墅、有个小轿车，丈夫有个七品芝麻官、手里有个百二八十万，这些人可能想不到修行。这样的家庭很痛苦啊！因为你这个人天福报享完转眼你就往下掉啊！『念彼观音力，释然得解脱』。就再也不会被这种情执所束缚。心里清净了，他就想办法来改造家庭。</div><div class=\"text-indent\">咒诅诸毒药，所欲害身者。念彼观音力，还著于本人：这段经文主要是指外魔、冤亲债主、想伤害受持《法华经》的人。那么『念彼观音力』，见道之人，一定是得到天龙八部的护持，千真万确。邪鬼邪神就是背后念咒都不能伤害你。他想害你眼睛都睁不开；同时只要你认真持戒，鬼神都会护持你。这个『还著于本人』是不是也叫『应供』？他想伤害别人，最后必然伤害他自己。比如说我一念善心，首先得到供养的是不是自己啊？近水楼台先得月。其次人家得到心电感应以后，仍然会反馈给我，这是双重功德。那如果我一念恶心，首先伤害的还是我，只要起心动念，你就是应供。当你起了恶念，人家感到不舒服，那个不舒服的念是不是马上反馈给你？他没有办法不『还著于本人』。这叫平等法，好念、坏念都是『还著于本人』。</div><div class=\"text-indent\">或遇恶罗剎，毒龙诸鬼等，念彼观音力，时悉不敢害：这也是一些外魔。恶人看到正气凛然的人，他要想下手，心里都吓得直抖。如果你是个坏人，他要害你的话，不管三七二十一，他把自己当成个英雄。因为心与心之间有一种力量的抗衡，每个人都还有自己的护法。</div><div class=\"text-indent\">若恶兽围遶，利牙爪可怖，念彼观音力，疾走无边方：这个『恶兽』也是些外魔或者险恶的环境。南昌起义以后，刘伯承带着两个警卫员逃难到山里，来了一只大老虎，刘伯承讲：没有关系，我们就坐在这里，老虎不会伤害我们。果然，老虎就是不理他们。你如果很紧张，老虎一定向你扑过来。为什么过去出家人在山里能够降龙伏虎啊？大蟒蛇可以在你茅草棚旁边陪你睡觉，它不惹你的。老虎还给你让道。因为你已经把一切生死都看破放下了，没有任何紧张的气氛，所以老虎对你感到信赖。人是万物之灵，豺狼虎豹都知道恭敬，它要咬你是因为你这种惧怕的心造成一种气氛。它是为了保命来才跟你拼命的。特别是修行人与世无争、吃斋，他发出的气氛非常和平。这个『疾走无边方』呢，就赶快逃跑了，逃得无影无踪。</div><div class=\"text-indent\">蚖蛇及蝮蝎，气毒烟火燃。念彼观音力，寻声自回去：『蚖蛇蝮蝎』是四种毒虫、蛇虫之类。它们嗔恨心很强，『气毒烟火燃』是形容他们的气氛。『念彼观音力，寻声自回去』，对明白『如来藏』道理的人啊，他的心力很大，速度极快，所以在各种不同境界中的众生能够感受到这种力量。</div><div class=\"text-indent\">云雷鼓掣电，降雹澍大雨。念彼观音力，应时得消散：风云雨雾都有灵知性，都有见闻觉知，更何况修行人还有诸天神明在护持。出家人穿着僧服，是人天师表，如果不检点自己，现世报就很重，更别说来世的果报。</div><div class=\"text-indent\">众生被困厄，无量苦逼身。观音妙智力，能救世间苦：『困厄』是无量苦——从欲界苦、有色界苦、无色界苦乃至到菩萨界分段生死之苦、变易生死之苦，那无量的苦简直没有办法想象，但好在我们有解决无量苦的一个总法门，就是以「一心三智」这个「能观之智」来观照到「一心三谛」我们的本来面目。把这个法明白了，一救一切救，真正能救我们一切苦的只有自己，自己就是观世音。</div><div class=\"text-indent\">就是观世音菩萨来救苦，他救了谁的一切苦了？我保证你升官发财、无病无恼，有没有这样一个人呐？没有。观世音菩萨也不会这样无聊，他来给你当保姆啊？古今中外没有这样一个人，更不用说救世间一切苦。谁救谁啊？只有调整了我们的心态，我们自己救了我们生生世世的一切苦，否则你解这个〈观世音菩萨普门品〉就是歪魔邪说，你造谣惑众。古今中外这是明摆的事实，谁能救一切人、谁又能救这个人的一切的苦？没有这回事。就是那些祖师大德——莲池大师这一生中就大病三次，连释迦牟尼佛出世都还头疼脑热、被提婆达多砸破了脚趾头。这是讲到位了，否则你这就变成迷信——我念一下观世音菩萨就什么事情都没有啊！世界大战也没有了，洪水也没有了，地震也没有了——有没有用啊？不要去打妄想。是表我们自己明心见性、调整心态，我们自己这个肉身就是国土，是通过我们的心来对这个世界加持，加持多少就算多少，因为佛不度无缘之人呐！所以『念彼观音力』，『彼』是谁？都是自己。</div><div class=\"text-indent\"><strong>【具足神通力，广修智方便，十方诸国土，无刹不现身。种种诸恶趣，地狱鬼畜生，生老病死苦，以渐悉令灭。真观清净观，广大智慧观，悲观及慈观，常愿常瞻仰。无垢清净光，慧日破诸暗，能伏灾风火，普明照世间。悲体戒雷震，慈意妙大云，澍甘露法雨，灭除烦恼焰。诤讼经官处，怖畏军阵中，念彼观音力，众怨悉退散。】</strong></div><div class=\"text-indent\">广修智方便：无非是「一心三智」——空智、有智、中智。</div><div class=\"text-indent\">十方诸国土，无剎不现身：你想到哪里，是不是就在哪里现身？那就是你的真身啊！你现在想到扬州火车站，你就在扬州火车站现身了，这个身没去，那个身去了没有啊？那是你的真身。我们不是讲无量寿吗？从纵向上来看，过去、现在、未来都是「我」；从横向上来看，东南西北、上下十方无处不是「我」。你一念十法界，十法界都在现身。那么作为观世音也好，阿弥陀也好，你念他现身，你不念，他现身了没有啊？哪里不是他现的身？明白这个道理，就是你在现身。</div><div class=\"text-indent\">无刹不现身：所以你念也好，不念也好，他都现在这里，你自己是不是观世音现在这里？你明白了你现在就是观世音，在这里现身；你如果执著名闻利养，那你就是牛魔王在这现身。心里想什么，你就是什么。</div><div class=\"text-indent\">种种诸恶趣，地狱鬼畜生，生老病死苦，以渐悉令灭：对照我们的观照的功夫，明白了万法都是「我」，你这个心就是佛土的气氛。虽然是佛土的气氛，对于还没有圆满成佛的人，是不是还有种种的习气？所以需要加功用行。生老病死、地狱鬼畜生，种种的业报慢慢消除，尘沙烦恼、无明微细烦恼渐渐地消除。『地狱鬼畜生』并不一定就是指那个色身形相，是指那种心。见道以后还要认真破我执，转烦恼为菩提。</div><div class=\"text-indent\">真观清净观，广大智慧观，悲观及慈观，常愿常瞻仰：这是我们自己的观照。</div><div class=\"text-indent\">真观，是观空、看破。净观，是观假、要放下。广大智慧观，是圆中，是圆满的中道，不是别教的但中。圆教的圆中，一切当下就是一，一当下就是一切，当下就是过去、现在、未来、东南西北、上下十方，你当下就是十法界万法，这是「圆中」。悲观，是同体大悲。这是前面的「三观」，是造成的利用，这个利用就是用悲心度众生利他。慈观，是无缘之慈，『悲观』和『慈观』就是大慈大悲。菩萨利他。常愿常瞻仰：愿，是原来的心；常，是时时事事处处念念在道，叫『常愿』。常瞻仰，是要利他。对别人恭敬了，这是从根本上用心来帮助人。</div><div class=\"text-indent\">无垢清净光，慧日破诸暗，能伏灾风火，普明照世间：</div><div class=\"text-indent\">无垢清净光，是对上面几种观的总结。能做到这几种观，你清净了，没有污染了。心净光通达，你看一切的万法转识成智，心态彻底调整。慧日破诸暗：像太阳一样不为黑暗所迷惑。过去看它是个茶杯，现在看这个茶杯是阿弥陀佛；过去看他是个冤亲债主，现在看他是个老佛爷，他就是「我」，叫『慧日破诸暗』。能伏灾风火：『灾风火』是指我们受到种种外在的苦报，六道轮回啊、头疼脑热啊。普明照世间：内无惑、外无障，身心轻安光明。照世间，首先从你这个肉身世间『照』起，然后涉及到整个尽虚空遍法界。这个『世间』是世间出世间。一个明心见性的人知道万法都是「我」，这就是『普明照世间』。</div><div class=\"text-indent\">悲体戒雷震，慈意妙大云，澍甘露法雨，灭除烦恼焰：</div><div class=\"text-indent\">你成就了大悲心，明白了一切万法都是「我」，就成就了「同体大悲」。『戒』带有保持覆护之义。那种保护的力量像『雷震』一样，力大无穷。所以成就了大悲心之人，他护持众生之力量像雷霆那样不可抗拒。慈意妙大云：给众生以快乐。前面的『戒』是保护众生，不受痛苦，免苦予乐。『妙大云』，奇妙得像大云一样，能够普覆一切。这是「无缘大慈」。澍甘露法雨：天上下雨有没有分别心啊？这是表以平等心待人接物。灭除烦恼焰：这个『烦恼焰』灭也灭，不灭也灭，他没有办法生烦恼。</div><div class=\"text-indent\">诤讼经官处，怖畏军阵中，念彼观音力，众怨悉退散：这里是指好打官司、好斗诤的人，只要明白了『如来藏』的道理：算了，官司不打了；算了，仗也不打喽，罢战。这是比喻没有争夺名利之心。修行人就是与世无争，你争什么？你今生今世受委屈、受冤枉，是因为你前世冤枉人家受委屈；你今生今世受到人家伤害，是因为你前世伤害了人家。</div><div class=\"text-indent\"><strong>【妙音观世音，梵音海潮音，胜彼世间音，是故须常念。念念勿生疑，观世音净圣，于苦恼死厄，能为作依怙。具一切功德，慈眼视众生，福聚海无量，是故应顶礼。】</strong></div><div class=\"text-indent\">这个『妙音观世音』就回到观世音修行的法门，他通过音声而旋妄归真，那么在《楞严经》讲的，叫「一解六解」。打个比方来讲，我们在这儿什么也不想的时候，眼睛能不能看到啊？到了高度静止的时候，耳朵能不能听到？舌头能不能尝到味道？所以这个妙音就是一转六转，妙在这里。通过闻在声音上来修证，同时得到色香味触法，统统转过来，叫『妙音观世音』。『梵音海潮音』，『梵音』是表清净，『海潮音』是表讲信用。『胜彼世间音』，『世间音』是种种的分别执著，那个『妙音』是由分别而进入无分别。</div><div class=\"text-indent\">念念勿生疑，观世音净圣，于苦恼死厄，能为作依怙：念念观照『如来藏』，念念观照『阿弥陀』，这是救命的法宝。『依怙』就跟小儿离不开父母一样。</div><div class=\"text-indent\">具一切功德，慈眼视众生，福聚海无量，是故应顶礼：仍然是讲『一心三藏、一心三智』。明白了万法皆是一念，是一切功德，我们以慈眼、法眼、慧眼看待一切的万法。『福聚』，聚在你这一念，一念包罗万相。『海无量』，一即是无量，无量即是一。是故应顶礼：应该受持《法华经》，受持《普门品》，受持『阿弥陀』。</div><div class=\"text-indent\"><strong>【尔时，持地菩萨即从座起，前白佛言：世尊，若有众生，闻是观世音菩萨品自在之业、普门示现神通力者，当知是人功德不少。】</strong></div><div class=\"text-indent\">持地菩萨请法，为什么在这里半路杀出个程咬金来印证啊？这是印证《观世音菩萨普门品》，印证『如来藏』。这个法不可思议啊！持地菩萨在《楞严经》讲：凡是有人讲《法华经》，我第一个来证明《法华经》不可思议。持地菩萨为什么要证明呐？他过去著相，修了无量劫修桥补路，直到毗舍浮佛出世——「哎呀！你怎么这么笨呐？心平世界就平了嘛！」他当下开智慧。一语点破梦中人。</div><div class=\"text-indent\"><strong>【佛说是普门品时，众中八万四千众生，皆发无等等阿耨多罗三藐三菩提心。】</strong></div><div class=\"text-indent\">这里有没有讲佛说《普门品》以后，法会大众们又出去兜了三个月，参学了八年，然后证到了什么什么……有没有啊？当下、当时就证果，反反复复讲这个法。为什么几千年以来很少有人成就啊？就是自以为是，抱残守缺，固执己见，不敢信大法。众中八万四千：这个『众』不一定是八万四千，也可能九千九万九亿，也可能是一个人。这『八万四千众生』是指我们身上无量的烦恼习气而转变成菩提。</div></div></div>"
  }
]