[
    {
        "title": "楞严经第四卷168字",
        "author": null,
        "date": null,
        "html": "<div class=\"B1_text\"><div class=\"text-indent\"><strong>楞严经·168字</strong></div><div class=\"text-indent\">尔时，世尊告富楼那，及诸会中漏尽无学、诸阿罗汉：如来今日，普为此会，宣胜义中真胜义性，令汝会中定性声闻，及诸一切未得二空，回向上乘阿罗汉等，皆获一乘寂灭场地、真阿练若，正修行处。汝今谛听，当为汝说。富楼那等，钦佛法音，默然承听。</div><div class=\"text-indent\">佛言：富楼那，如汝所言，清净本然，云何忽生山河大地？汝常不闻，如来宣说性觉妙明，本觉明妙。</div><div class=\"text-indent\">富楼那言：唯然，世尊，我常闻佛，宣说斯义。</div><div class=\"text-indent\">佛言：汝称觉明，为复性明，称名为觉？为觉不明，称为明觉？</div><div class=\"text-indent\">富楼那言：若此不明名为觉者，则无所明。</div><div class=\"text-indent\">佛言：若无所明，则无明觉。有所非觉，无所非明。无明又非觉湛明性，性觉必明，妄为明觉。<u>觉非所明，因明立所，所既妄立，生汝妄能：无同异中，炽然成异，异彼所异，因异立同，同异发明，因此复立无同无异。</u></div><div class=\"text-indent\"><u>如是扰乱，相待生劳，劳久发尘，自相浑浊，由是引起尘劳烦恼：起为世界，静成虚空。虚空为同，世界为异。彼无同异，真有为法。觉明空昧，相待成摇，故有风轮执持世界。因空生摇，坚明立碍，彼金宝者，明觉立坚，故有金轮保持国土。坚觉宝成，摇明风出，风金相摩，故有火光为变化性。宝明生润，火光上蒸，故有水轮含十方界。</u>火腾水降，交发立坚，湿为巨海，干为洲潬。以是义故，彼大海中火光常起，彼洲潬中江河常注。水势劣火，结为高山，是故山石击则成焰，融则成水。土势劣水，抽为草木，是故林薮遇烧成土，因绞成水。交妄发生，递相为种，以是因缘，世界相续。</div><div align=\"right\">——节选自《楞严经·卷第四》</div><div class=\"text-indent\"><strong>一六八</strong><strong>字</strong><strong>讲记</strong></div><div class=\"text-indent\"><strong>尔时，世尊告富楼那</strong><strong>，</strong><strong>及诸会中漏尽无学、诸阿罗汉：如来今日</strong><strong>，</strong><strong>普为此会，宣胜义中真胜义性，令汝会中定性声闻，及诸一切未得二空，回向上乘阿罗汉等，皆获一乘寂灭场地、真阿练若</strong><strong>，</strong><strong>正修行处。汝今谛听，当为汝说。富楼那等</strong><strong>，</strong><strong>钦佛法音，默然承听。</strong></div><div class=\"text-indent\">正修行处：三藏十二部经几乎都是讲世间善法，叫我们修行，这是方便引导而已；唯有到了《法华经》《楞严经》，佛才讲到究竟。在《楞严经》第一卷，佛已经讲的很清楚。如果不明心见性，「虽终日行，枉入诸趣」。也就是说：你不把《法华经》《楞严经》读懂，不明白「心」和「佛」是怎么回事，即使一天到晚修行，你都逃离不了六道轮回。何况这个世界上有没有一个人一天到晚在修行啊？正修行处，就是讲修心。</div><div class=\"text-indent\">至于佛是谁，心是谁；你是谁，他是谁；老天爷是谁，刮风下雨又是谁，就是叫我们明心见性，明白宇宙人生真理。《法华经》《楞严经》就是提醒我们：修行人要「悟后进修」！没有明心见性，你不要去修，否则你是盲修瞎练。可是这几千年以来修行人犯了一个天大的错误，他不是悟后进修，而是通过修来开悟。要明白，只有读《法华经》《楞严经》才能开悟！自古以来众口一词，「成佛的法华，开悟的楞严」。所以从我们这一代起，要把这个错误纠正过来！可是积重难返。</div><div class=\"text-indent\">「如来藏心地法门」叫全性起修，全性就是明心见性。把这一切万法的来龙去脉搞明白，然后你再去修。佛在《华严经》也讲：「忘失菩提心，修诸善法，是名魔业」。有些人讲，我会行善，我会积德……你能把所有的善全部行完吗？谁也不能，佛都不能！即使你能行完一切善，也是魔业！但魔业也能得到人天福报，魔王还可以升到第六层天。其实包括二十八层天，那福报都是魔业。可是他福报完了以后，还要往下落。唯有明心见性才能获得生生世世大福报，一劳永逸！</div><div class=\"text-indent\">这168个字，就是佛在给我们介绍「正修行处」。在前面的一至三卷，佛帮助修行人从万法之相作开示，引导到万法万相没有出现之前的我们那个无形无相真实存在的心，是帮助我们「见性」，叫会相归性。从这里往后反过来，佛从无形无相的这个心开始说起，研究它是怎么样变现为山河大地、日月星辰、风云雨雾、树木华草；又怎样变现为佛菩萨、天人鬼畜、牛马猪羊等一切的有情众生。也就是反过来讲，心不变随缘为万法，这叫「明心」。这是用次第圆融的办法帮助我们开智慧。</div><div class=\"text-indent\">这段经文是整部《楞严经》的精华。听的时候，不要太紧张，跟听故事一样，你容易听得懂；注意力要集中，不要打妄想，更不要带有逆反心理，这一点很重要。</div><div class=\"text-indent\">汝今谛听：「谛听」是要认真听。第一，用世间法来讲，叫专心听；第二，用真实义来讲，你要听着师父的话随文入观。只能跟佛的话保持一致的思路，用智慧来听。当为汝说：一个「当」字，体现佛语真实，三世如来，语无虚妄。佛所讲的话都是正当名分，名副其实，都是讲的宇宙人生的真相。</div><div class=\"text-indent\">富楼那等，钦佛法音，默然承听：富楼那等，是富楼那与整个的法会大众；「钦佛法音」的一个「钦」字，是表把佛的教诲视为至尊、至贵、至圣。默然承听，是去掉一切妄想，听着佛的开示随文入观。</div><div class=\"text-indent\"><strong>佛言：富楼那，如汝所言，清净本然</strong><strong>，</strong><strong>云何忽生山河大地？汝常不闻</strong><strong>，</strong><strong>如来宣说性觉妙明，本觉明妙。</strong></div><div class=\"text-indent\"><strong>富楼那言：唯然，世尊，我常闻佛</strong><strong>，</strong><strong>宣说斯义。</strong></div><div class=\"text-indent\">富楼那在前面发问：佛啊！你讲地水火风空见识、五蕴、六入、十二处、十八界，都是清净本然，周遍法界。既然是清净本然，那山河大地怎么来的？在富楼那看来，这个心是无形无相、如如不动、不生不灭的。有形有相和无形无相在世间法里是相互对立的，好似水火不容。用世间人来讲，既然这个房子里充满了火，你怎么还讲这个房子里又充满了水啊？怎么水和火在这里都是清净本然呐？再比如，既然这个虚空里都是虚空，你怎么讲泥巴瓦块也是在这里清净本然呢？按照世间法提出这些疑问，是不是很正常啊？</div><div class=\"text-indent\">汝常不闻，如来宣说，性觉妙明，本觉明妙：</div><div class=\"text-indent\">汝常不闻，这是古汉语的一种语言风格，意思就是你不是常常听到我讲吗。注意啊，佛在讲《法华经》《楞严经》之前，常常不失时机地把这些了义的口头禅提出来，我们要体会佛的良苦用心。「汝常不闻」，这就说明，佛之前在各个不同的时期先是不时地旁敲侧击地开示「法华真义」；到最后呢，是绝待地、全面地、专注地来讲《法华经》。特别是这部《楞严经》，根据我们对其前后内容的观照，它是佛在多时多处所讲，然后由弟子们收集整理。</div><div class=\"text-indent\">「性觉妙明」与「本觉明妙」，「性觉」就是「本觉」，「本觉」就是「性觉」。「性觉」怎么「妙明」呢？用别教来讲，这个「性觉」是我们的真心本来面目，从性上来讲，它无形无相。虽然是无形无相的真如本性，它也包含了十法界无量的万法，（注意啊，讲包含都是方便说，又没有办法用更好的语言来表达），但它仅仅是没有现相。</div><div class=\"text-indent\">举例来讲：这个拳头算是我们的「性觉」，比喻无形无相的真心本来面目。这(举拳示之)是锤子相。拳头本来有没有这个锤子相啊？（没有）。但是有没有锤子性啊？（有）。我们眼睛看到拳头，心能不能看到这个锤子啊？（能）。所以「性是一，相是无量」。这个拳头，它可以现成锤子相，可以现成剪子相，现成扫把相，现成木排相、布相、兔子的耳朵相……这五个指头是表无量的指头。那天相、人相、鬼相、风相、云相、雨相……是不是都在这个手指上？那么这一切的相没有现之前是不是拳头？拳头这个时候叫「性觉妙明」，怎么个「妙」啊？它无形无相的当下就是有形有相，我们心能不能看到啊？明白这个道理叫「明心」，叫「寂而常照」。「寂」就是默默无闻；什么相也没有，但是它「常照」。怎么「常照」呢？一切有形有相的万法都在心里，这叫「性觉妙明」。这个「觉」就是我们的本体；「性」是按照通教、别教方便说为的我们的真心本来面目。</div><div class=\"text-indent\">本觉明妙：本，打一个比方：现在坐这里，你能不能把家里沙发、电脑、小轿车、床铺、被子以及七大姑、八大姨想起来？能，那你现在能不能拿出来给我们看？（不能）。虽然看不到，在不在你心里？在，这就叫「性觉妙明」，是不是？我心里就是有，可是拿不出来给人家看啊！好好与我们的真心本来面目相对照。</div><div class=\"text-indent\">本觉，用别教方便说，世间人执着有形有相，要有根、要有本，是不是啊？也就是我们的「假人」，佛法里叫「俗谛」，也叫「第二义谛」；那个「性觉」叫「第一义谛」。「本觉」就是我们的真心本来面目以假面具显现为十法界万法。我们仍然用「拿手好戏」来说明这个道理。现在以手掌五指表万法，这（大拇指）是太阳、这（食指）是月亮、这（中指）是高山、这（无名指）是大海、这（大拇指）是释迦牟尼、这（中指）是阿弥陀、这是观世音、这是风、这是雨、这是白骨精、这是猪八戒、这是张居士、这是李和尚、这是香的、这是臭的、这是对的一百分、这是错的三十分……是不是全部在这里（手掌）啊？我们面对十法界，要看十法界万法都从哪里来的。通过手掌来打比喻就能明白：我们眼见手掌，手掌是表万法，心是不是看到拳头？眼睛能不能看到拳头？（不能）。手掌表的万法，是不是当下就是拳头？这就叫「见性」，在相见性，以「明」显出「妙」，这在佛法里叫「照而常寂」。本觉明妙，明明白白十法界就是由我们心变出来的。</div><div class=\"text-indent\">大根机之人，把这八个字听懂了，当下成就。圆顿大法心地法门叫「全性起修、一步登天、不立阶梯、无修无证」，耳朵带来就行。成佛就这么快。但是你们也不要说，那既然已经成佛，好了，屁股一拍就走，不要这样。你多听一分钟，就多一个品位。明心见性的菩萨有四十二个等级，往生极乐世界有九个品位，每一个品位、每一个等级都有无量的小等级、小小等级、小小小等级……后面的168个字就特别细致地解释了这八个字，集中体现出我们的性与相是怎么样转变的。这是我们作为一个人最要解决的根本问题，因为我们就是有来世，有无量的六道轮回，相比之下，今生今世天大的事情都不重要。</div><div class=\"text-indent\">你把《楞严经》听懂，生生世世高枕无忧。佛讲了三藏十二部经，最后又把它们否定，说那是「戏论法」，是「诸法戏论之粪」！可是这几千年以来，当今世界成百千万亿的修行人，有几个人在读《楞严经》，读《法华经》？这是佛法的悲哀！自古以来，「求道者多如牛毛，得道者凤毛麟角」，千万人难有一个人得道。可是讲这样的经典，我们在全国少说有几十个道场，有时只开示两个小时，成批人百分之九十、九十五乃至百分之百当下成就，真正显示出真理不可战胜！而且都是自己印证自己。</div><div class=\"text-indent\">自古以来，有些人把明心见性看得非常玄、非常奥妙，比登天还难。告诉大家：越是真理越简单！假传万卷书，真传一句话！只看有没有人给你点破！</div><div class=\"text-indent\">富楼那言：唯然，世尊，我常闻佛宣说斯义：</div><div class=\"text-indent\">斯义，就是这个道理，不错，听过。不仅是听过，而且是常听，常听却不懂。这又是修行人的一大劣根。他只是把它当成文章，当成口头禅，而不是用心来观照。我碰到过这样的修行人，包括一些讲经法师，多得很呐！他们都会讲万法平等，那我拿出个茶杯给他看，我说：「这个法跟你是什么关系啊？」他讲它是茶杯，那我讲：「它有什么用啊？」他讲它能喝水。我问他：「你刚才不是讲万法平等吗？」他讲：「哦，跟它不能平等。」他那个万法平等理解为，佛讲的修行法平等。其实，无量法门也是不平等的。</div><div class=\"text-indent\">要讲平等，正法、邪法、大法、小法统统平等，这是在明心见性的前提之下你才可以发言。要讲不平等，这个世界上没有两样东西可以平等，连佛讲的三藏十二部经都不平等。如果平等的话，佛要把《法华经》说为「经王」，把《楞严经》说为「经王」，说为「首楞严」干什么？不明心见性，你讲平等也好，讲不平等也好，都是无稽之谈！你根本都不懂！口头禅不能开智慧，也不能让别人开智慧，你自己都不懂啊！</div><div class=\"text-indent\">也有人讲：大家都是佛。我拿着茶杯说：「这是什么？」他说：「这是佛。」那我问他：「为什么讲它是佛啊？」他说不知道啊。那师父在讲《过五关度六将证菩提》的时候，就是解决这个问题。一切的万法都是由我们一念心变现而已，有情无情都是一个念变出来的。有些人听几句话，他就成就了！人与人的根机不一样，别人感觉他不可思议：你怎么听几句话就成就了？他觉得别人也不可思议：这句话这么简单，你们怎么就听不懂啊？所以佛良苦用心，面对上中下三等根机，来反复开示「如来藏心地法门」。上等根机人听了对中下等根机的开示，也不会白听，能不断地提升自己的品位，明白吗？斯义斯义，我们要把口头禅升华为自性流露。</div><div class=\"text-indent\"><strong>佛言：汝称觉明，为复性明，称名为觉？为觉不明，称为明觉？</strong></div><div class=\"text-indent\"><strong>富楼那言：若此不明名为觉者，则无所明。</strong></div><div class=\"text-indent\">汝称觉明：你富楼那心中所认为的那个「觉明」；为复性明：是因为你知道你的真心本性本来就是明的——所以「称名为觉」：如果这样称名为觉，这是觉，这是正觉，这是本觉。</div><div class=\"text-indent\">为觉不明，称为明觉：还是觉得我的这个心不明，而要加上眼睛能见（世人认为心能知，眼能看）？把这两者合在一起才叫明，「称为明觉」？这里呢，由于《楞严经》的翻译有它的不尽人意之处：精通佛法的般剌密谛大师是印度人，他不懂汉语；而房融宰相特别考究在语言精练上下功夫，加上唐朝那种语言风格，所以造成我们今天对《楞严经》有些经文不大容易理解。「为觉不明，称为明觉」，实际上这里讲啊，你觉得心里是不是只能知，而眼睛才能看，加起来才叫明？</div><div class=\"text-indent\">佛在前面在七处破妄、在十番显见里就涉及到这段经文。阿难认为心只能知、眼睛能见，所以在这里提出来讲，就把文字做了省略。我们只有瞻前顾后，才能把这段文字圆满。注意，特别是初学经典的同修，会有一些障碍，这两句话听懂了吗？就是讲：你富楼那认为的那个「明」，是不是心里本来就明？如果心里本来就明的话，佛讲「称名为觉」那就是对的；还是认为心里只能知，心里不明？非要加上所明、眼睛能见以及外面的亮光的话才叫「明」，那就变成「无明」，不是心里本来就明。</div><div class=\"text-indent\">富楼那言：若此不明，名为觉者，则无所明：</div><div class=\"text-indent\">这露馅了。富楼那认为心不能看到。如果把这个心说为觉的话，那「则无所明」，就是他不能看到东西。他跟阿难当初的心态是一样的。他认为眼睛能看，心能知道。其实眼睛能看，耳朵能听，鼻子能嗅，是不是心在起作用？我们这个心既能看、也能闻、也能嗅，它仅仅是以眼睛为工具，以耳朵为工具，随缘显现而已，六种觉知性皆因于心。那我们这个心要看东西，到底需要不需要通过眼睛？需要不需要通过亮光？为了解释下面这段经文，我在这里把以前经常讲的几个公案，再来重复一下。大家注意，可不要认为已经听过了就不稀罕。把这段公案听懂了，下面的经文你一目了然。</div><div class=\"text-indent\">在2005年，我到山西太原阳曲县传法，一位69岁的老居士向我请法，说：「师父，有件事情到现在我都想不明白。一天晚上我按照墓林僧划道道念阿弥陀佛，一念念到九点多。我老婆从门外进来，说黑咕隆咚的你在干啥呀？」他当下什么也看不到了，可是在此之前看的清清楚楚呀！九点的时候并没有灯光，但是他的心能看到啊！是不是？注意这个灯光，也是我们的心变出来的，所有的东西都是我们的心变出来的，变出来以后形成一种习气，相互依赖，而我们这个心本来就是亮的。由于有了依赖，就把我们的大光明就变成无明，那无明当下是不是就是大光明啊？仅仅是我们的一种依赖心造成的，同样，没有耳朵心能不能听啊？在《楞严经》的后面就涉及到这些内容。科学家讲，人类的潜能开发了不到百分之零点四，也就是说不到千分之四，其他的到哪里去了？许多功能丢了，为什么？因为我们不懂得用心，而这个心的力量无穷无尽。</div><div class=\"text-indent\">再一个，鸠摩罗什大师七岁的时候，随母去寺庙念佛，中途他在外面将千斤宝鼎一只手举起来，其他人吓坏了。「这个千斤重的大宝鼎，我们十个人也抱不起啊」！他头脑里有了重量的概念以后，宝鼎「唰」地一下落地，他再用两个手怎么推也纹丝不动。七岁的鸠摩罗什当下开智慧：轻和重都是我们的妄想，叫「同分妄见」。</div><div class=\"text-indent\">所以二两跟一百万吨有没有区别？没有。所谓的区别是因为我们的同分妄见，白天黑夜都是假的，轻重多少都是假的。当然，明白了是假的当下，是不是也是真的？都是心的性具功德，而且这个性具功德体现就是一个念。这么一个念随缘千变万化，这是讲我们的本明。</div><div class=\"text-indent\"><strong>佛言：若无所明，则无明觉。有所非觉，无所非明。无明又非觉湛明性，性觉必明</strong><strong>，</strong><strong>妄为明觉</strong><strong>。</strong><strong>觉非所明，因明立所，所既妄立，生汝妄能：无同异中，炽然成异，异彼所异，因异立同，同异发明，因此复立无同无异。</strong></div><div class=\"text-indent\">这段经文非常拗口，师父采取瞻前顾后的办法，把它进行了调理。「则无明觉」，这里应该打一个问号。佛自问：啊？「若无所明，则无明觉」？如果没有外部的环境，没有眼睛能看，就没有心里的明？没有光明的感觉？</div><div class=\"text-indent\">有所非觉，无所非明：前面二句佛是自问，这后面三句佛是自答。如果按照你这种说法，「有所」，也就是说，心里的这个知要加上眼睛才能看外界，是这个「所明」你才能明的话，那不是觉，那不是我们的本来面目。我们的真心本来面目无能无所，它是一个念。《楞严经》在后面讲，「知见立知，是无明本」。知见，我们的心本来就是知见。就跟那个老居士看到晚上九点钟，本来就是明啊，当后来老婆一叫，再加上灯一亮，他马上又依赖眼睛，依赖外明，是不是啊？那就变成无明了。那个时候我们能看到灯光很亮的时候，就是无明。无明不仅指黑暗，连光明都是无明。</div><div class=\"text-indent\">要好好观照我们的自性本心。只要我们有了对待，就陷入无明，明白了吗？然后，我们即使在无明之中，也已经明，明白吗？(明白)。那我们明心见性了，没有灯光你能不能看书啊？(不能)。这叫「戒坏见不坏」，因为我们无量劫以来形成的习气不能一下改掉，佛也不转定业。当本期生命结束之时，我们现在证得的比量功德当下现量现前。</div><div class=\"text-indent\">无所非明，「无所」才是真正的大光明。为了便于理解，可将「无所」二字理解为「无所之明」，即「离开六识的那个本明」；非明，不是你富楼那讲的那种明，你讲的那种明叫「无明」、「妄明」！这两句话在解释上的跳跃性很大。不这样跳跃，不这样变动，你没有办法理解！这段经文有重要的几句我感到很别扭的，讲老实话，我起码参阅了五六种版本，但我告诉你们，谁都没有讲清楚，不信你们去找找看。一定要非常珍惜师父的劳动成果！因为大部分都在猜谜藏，这段经文太难解了。如果不把前后贯通，你根本没有办法解释。</div><div class=\"text-indent\">「非觉」跟「非明」，如果按照字面来讲，「非觉」跟「非明」是一个意思。你怎么上面讲「有所非觉」，下面又「无所非觉」？是不是应该语法一样的？可是语义上不好解释，怎么「有所非觉」，「无所」也是「非觉」？不好解释。那明白了「如来藏」道理，在遇到诸如此类的经文的时候，你可不要死在经文上，你要用智慧来融会贯通。</div><div class=\"text-indent\">无明又非觉湛明性：这里是强调解释「有所非觉，无所非明」这两句话。「无明」就是指富楼那讲的「心有知，眼睛有见，外界有明，那才叫明」，即富楼那所认为的那个「觉明」，佛讲这是「无明」，这是「妄明」。又非觉湛明性：它不是我们的本觉、本明；「湛」是明明白白、灵灵不昧之义。只是你把它忘记了，你不理睬它了，但它并没离开你，这都是方便说。虽然我们本觉、本明变现了无明，当我们明白无明不是本明的时候，无明当下是不是明啊？（是）。这是佛没有办法的办法来引导，如果不这样讲的话，就跟哑巴看到贼一样，他心里知道，嘴巴讲不出来。</div><div class=\"text-indent\">性觉必明，妄为明觉：</div><div class=\"text-indent\">「性觉」本来就是明；「必明」，你一定要加上一个「明」，而我们的心本来就是明的。如果你非要讲眼睛看才能明，外面有亮才能明，那么你这个「性觉」来讲，「妄为明觉」，这里「明觉」就是无明；「妄为」：这个无明当下是不是就是我们的真心呐？但真心这个时候已经带妄，叫「带妄显真」。始终要明白，真明、无明都是一个念。乃至有形有相的万法都是我们一个念，它是随缘而变现出来，不存在谁生谁，就是一个东西。谁生谁啊？老子生儿子还是儿子生老子啊？非老子生儿子，非儿子生老子，非老子不生儿子，非儿子不生老子，是这个道理。你不能讲谁生谁，你也不能讲谁也不生谁。老子、儿子、爷爷、姥爷、牛马猪羊都是一个东西！就跟这个拳头一样，变化出无量的手指、无量的万法，是不是都是个拳头啊？既然都是个拳头，那无量的万法，有没有哪一个不是哪一个啊？（没有）。这里的「明觉」可说为我们的生相无明。</div><div class=\"text-indent\">觉非所明，注意，从这里开始，到「故有水轮，含十方界」，这里有168个字，这是师父根据自己的观照，把它说为《楞严经》的基础、精华。在前面从「汝称觉明，为复性明」，这叫开堂白，从后面「故有水轮，含十方界」往后还有一大段，叫后续，也很重要。把头、把尾、把中间连贯起来好好地观照，我们因此而大开智慧。</div><div class=\"text-indent\">觉非所明：「觉」就是真心本觉，就是我们的大光明，它无形无相、如如不动、不生不灭，本来具足一切的万法。一切的万法包括动相、静相、有相。注意，在这里是按照通教、别教的说法把这个「觉」说为空如来藏、真空，因为这是方便引导。「非所明」，所明就是前面讲的「明觉」，就是讲的「生相无明」，要把它分开。</div><div class=\"text-indent\">因明立所：这个「明」就是「生相无明」。要明白，生相无明也好，后来的什么枝末无明也好，都是心的性具功德，怎么「因明立所」呢？既然我们有了生相无明，生相无明已有一种能动的能，既然有了，它稍微不慎，是不是就要崭露头角啊？我们可以想象，生相无明变现之前就是真空，寂然、如如不动；只要有它，是不是时时可能要惹祸啊？就是因为这个生相无明，它动一下念，比如我这个真心本来面目到底怎么回事啊，怎么在这按兵不动啊？是不是这个意思？就是「因明立所」。立的这个「所」就是在三细无明里面的第一个无明，叫「业相无明」。所以这个「业相无明」跟「生相无明」很难区别开来，我们一般把生相无明说为因，把业相无明说为果；把生相无明说为能，把业相无明说为所。在某种意义上，这个生相无明也就是业相无明，但作为一个次第，我们心细一点就能分别清楚。那这个「生相无明」或「现相无明」就是第一个念。</div><div class=\"text-indent\">所既妄立，生汝妄能：「所既妄立」就是讲业相无明，既然已经妄现，注意啊，这个「妄立」和「生」都不可以解释为「生」，都是解释为「现」，这是翻译《楞严经》用字方面的错误，前面已经解释了。这个「生」和「立」，祖师大德解释的时候，都是讲「带出」或「现出」。怎么带出和现出呢？「生相无明」也好，「业相无明」也好，「转相无明」也好，是不是都是我们的真心本来面目啊？它有没有谁生谁啊？没有啊。它随缘自己在变现，这就是好玩，这一点非常非常重要。那有了第一念以后，愁不愁有第二念、第三念啊？所以会造成什么情况呢？原来无形无相的真空从此出现了有形有相的虚空，有了一个业相无明。这个业相无明，就自己站到自己的对立面。</div><div class=\"text-indent\">打个比方。有时候一个人在傻呆呆地不知道想什么，旁边走来一个人，问「你在干什么」。他吓了一跳，是不是？他想：「我在干什么？我刚才什么也没有想」。那刚才发呆的时候就是真空，就是真心本来面目。当你从这个状态出来的时候，第一念想到：不好！快十点了，要回去烧饭！「不好」两个字已经变成两个念了。这时头脑里就已经有了虚空的感觉，有了空间万法的感觉。这个比喻容易理解。「所既妄立」，是头脑里有东西了，带出了东西，那就是「业相无明」。</div><div class=\"text-indent\">生汝妄能：「妄能」在三细无明里叫「转相无明」，也叫「见分」，也叫「第七识」。怎么「妄能」呢？想到要烧饭了，你这个时候是不是围绕这做事了？不光是知道，而且做了。所以这个「妄能」啊，就有了第二念。这个第二念代表无量念，就对着这个虚空。因为业相无明出现以后，真空变成虚空，他眼前有了东西了，是不是？在打妄想，这个虚空到底怎么回事啊？这么一打妄想来讲，后面东西又跟上来了。</div><div class=\"text-indent\">无同异中，炽然成异：</div><div class=\"text-indent\">先解释第二个「异」。这个「异」就有境界，就有现相，就有东西出来了，这个东西也不能讲它是虚空产生的，明白吗？虚空若能产生东西，它还叫虚空吗？由于对着虚空打妄想的这个因缘，使我们心里本来存在的这种现相，风云雨雾、泥巴瓦块、天人鬼畜这些都是我们的相分，就带出来了，叫应运而生，随缘显现。但是在这里佛为了逐步开示我们，这个「异」是作为殊胜意义上的那种有形有相的东西，叫胜义色法。肉眼看不到，用现代高倍电子镜可以看到，层次比较高的天眼能够看到，叫「胜义色法」。这个「异」叫「现相无明」。我们刚才讲的第一念是业相，第二念是转相，第三念是现相，这是「无明不觉有三细」，「无明」就是那个「生相无明」。它无意之中把这三细全部带出来，叫「三细无明」。</div><div class=\"text-indent\">那么「无同异中，炽然成异」，对照一下：「无同异」就是讲第一念——业相无明产生以后，我们无形无相、真实存在、却不能感受到的真空，随着这一念业相无明而浑浊为晦昧虚空。晦昧虚空仅仅就是一个虚空。虚空如果说没有山河大地来对比显示，你能不能叫它同？能不能叫它异啊？如果没有这些对比就产生不出「同」或者「异」的这种概念，所以当初这个「无同异」叫虚空。虚空之中，「炽然成异」，「炽然」，这里带有感慨万分的意思：啊呀，这个虚空中就这么「明目张胆」地现出境界相来了，这怎么回事啊？佛在前面已经解释了，空中华，是不是？它不是空中产生的，也不是眼睛产生的，它是我们心中本有的那种性具功德随缘显现，佛在后面方便说为「一念坚固妄想而有色法」，就「炽然成异」了。也就是说有形有相的色法是随着我们坚固的妄想而随缘显现。</div><div class=\"text-indent\">所谓「坚固」是讲这个色法有形体而言，叫「坚固」，并不是指我们打妄想时间的长短，越长越坚固。不论你心力大小，都是坚固妄想。地球人心力比较低，我们得反复反复想，坚固的妄想也能生出色法来。这个「炽然成异」就包含地、水、火、风、金、银、铜、铁等无量的万法，但在这个时候叫「胜义色法」。在三细无明里，胜义色法，打个比方，就像种子的胚胎一样。</div><div class=\"text-indent\">异彼所异，因异立同：这是解释，怎么叫个「无同异」？如果没有「异」的话，有没有虚空的感觉啊？（没有）。</div><div class=\"text-indent\">这句连续三个「异」。第一个「异」解释为「不同于」；「彼」，那个；「所异」，出现的境界相。「异彼所异」就是「虚空不同于那个出现的境界相」。这第二个「异」，是实词，是表实法，是指「现相」这个境界相。因为有了境界相出现，所以虚空这个无形无相为了区别于那个境界相，「因异立同」，这里的「异」还是实词，就是因为有了有形有相的境界相，所以把虚空叫作「同」，把境界相叫作「异」。不这样讲的话，佛没有办法开口讲话。所以立了个「同」，立了个「异」，下面就好做文章。本来虚空就是虚空，它不存在「同」或者「异」。因为有了境界相，就把它们方便对显为「同」和「异」。</div><div class=\"text-indent\">同异发明，因此复立，无同无异：</div><div class=\"text-indent\">同异发明：「同」是指虚空；「异」是指「现相」，即各种各样的有形有相的境界相；发明」就是相互成就，相互作用与反作用。「发」就是成就，是动词；「明」是指种种的实法。「同异发明」就是成就了种种的实法。因此复立：「因此」就是进一步成立；「复」就是重复、反复。这里的「无同无异」是指形貌各异的有情无情万法。所以这里的「无同无异」，不是「根本无明」，是已经成就了「枝末无明」。怎么叫「无同无异」呢？你如果讲「同」的话，天人鬼畜、泥巴瓦块、牛马猪羊……同不同啊？不同啊！你如果讲「异」的话，天人鬼畜、泥巴瓦块、有情无情……是不是都有地、水、火、风、空、见、识，这七大啊？这叫「无同无异」。想一想，师父讲的《过五关度六将证菩提》有没有离开《楞严经》啊？（没有）。这就是「境界为缘长六粗」，这个时候来讲，十法界万法已经成就。</div><div class=\"text-indent\"><strong>如是扰乱，相待生劳，劳久发尘，自相浑浊，由是引起尘劳烦恼：起为世界，静成虚空。虚空为同，世界为异。彼无同异，真有为法。觉明空昧，相待成摇，故有风轮执持世界。因空生摇，坚明立碍，彼金宝者，明觉立坚，故有金轮保持国土。坚觉宝成，摇明风出，风金相摩，故有火光为变化性。宝明生润，火光上蒸，故有水轮含十方界。</strong></div><div class=\"text-indent\">如是扰乱，相待生劳：这个虚空世界万法已经形成了前面的五种意识、前面的第六种意识心，更不用说后面第七识、第八识。这个「如是」呢，作双重观照：就是这个样子啊，如我以上所说的，在「同异发明，因此复立」啊！这样方便讲，是不是在讲「一心三藏」呢？当然究竟说还是讲「如是我闻」，「如」就是我们的心，「是」就是我们的身，尽虚空遍法界没有哪一法不是我的心，没有哪一法不是我的身。</div><div class=\"text-indent\">如是扰乱，是讲我们的真心本来面目在扰乱。这个「扰乱」就是讲我们的报身功德、智慧妙用，是借用世间法来形容这个特征，帮助在迷惑颠倒中的众生来破除妄想。你如果讲，「我们的真心本来面目在相互玩游戏啊」，那就不会使迷惑颠倒中的众生生起了生脱死的愿望。加一个「扰乱」，让大家生起出离心。那「扰乱」是不是菩提啊？就是的，就看它怎么样变化。也就是在这里开始讲「缘起性空」。「如」就是「性空」，「是」就是「缘起」。「扰乱」是不是「缘起」啊？你怎么样扰乱都是一个念，怎么样扰乱都是个心，怎么样扰乱都是个佛。只是在扰乱的过程中，对众生而言，它得不到自在妙用而已；虽然得不到自在妙用，但是自在妙用在不在？在。他懂得了他就用；不懂得，那自在妙用睡大觉，他还受苦报。</div><div class=\"text-indent\">相待生劳，就是我们的心法和色法相待生劳，作用与反作用。这里的「劳」，我们在前面讲无明不觉有三细的时候，已经涉及到转相。转相一般说为第七识，也叫七转识。它会转啊，怎么转啊？往前面攀缘，直接作用在第八识，尽虚空遍法界所有的人、所有的佛、所有的众生都共一个第八识；往后面攀缘，它通过六种意识心攀缘色、声、香、味、触、法等这十法界一切的万法，就跟挑扁担一样。这个时候已经是真妄和合之心，一头对着外面的境界、色法，把第八识这个仓库里面的业识种子拿出来，通过眼耳鼻舌身意这六根，对外面的色、声、香、味、触、法这一切的凡尘来打妄想、搞分别、造身口意三业；又反过来把眼耳鼻舌身意六根所造之业，再把它保存到阿赖耶识仓库里，是不是两种作用啊？所以叫转相。转相能够把前转到后，把后转到前，而且我们在六道轮回中是不是靠这个第七识做主啊？成佛、成菩萨、了生脱死，是不是也靠它做主啊？就这么好玩。</div><div class=\"text-indent\">所以对于生死的问题，你抓住了第七识，就已经解脱了一半。这个第七识，大家想不想现在跟它见见面啊？我们平时眼睛能看、耳朵能听、鼻子能嗅、舌头能尝、身体能接触、脑袋能想的这六识我们都知道；但六识后面还有第七识，我们天天受它的左右和摆布，却不知道它是谁。佛法把前面的这六种心叫作假心、假人、假意，都是假的。我们都上当受骗了，然后造业，到最后受报。而第七识，它并没有逍遥法外，是我们把它忘记了。你把它忘记，好，你受苦去。现在帮助大家，找找我们的第七识在哪里。</div><div class=\"text-indent\">打个比方，第二天要到南京去，提前把闹钟调到五点半，或者跟家人打个招呼，明天早上五点半叫我一下，为什么？我喜欢睡懒觉。可是往往到了第二天早上，闹铃还没有响，家人还没有叫，到了五点二十八自己醒过来了。有过这样情况的人，把手举给我看一看，有没有？（多数举手）大部分都有啊！那是不是你的第七识告诉你的？为什么我们平时这个第七识不告诉我们啊？并不是它不告诉你，是你不理睬它，明白吗？你只顾得眼睛看、耳朵听，把它丢到脑后去了，乐得它休息。</div><div class=\"text-indent\">再打一个比方，我们有时候想都没有想就信口开河，一讲出就后悔了，还挺难为情，把自己最不愿意告诉别人的事情是不是讲出来了？恨不得打嘴巴、挖牙齿、咬舌头。这时你开始后悔烦恼的心就是第六种意识心——假人、假心。信口开河讲出来的那个东西是谁讲的？就是第七识。现在大家看到自己的真人了吗？所以今天在这里听经的人同时是双重身份。</div><div class=\"text-indent\">禅宗有个话头，叫「二人同饮一杯水」。那我们一听就知道，这一杯水能不能让两个人同时饮啊？不能。「二人」就是讲我们里面还有个真人。所以我鼓励大家来听课，即使你今天在这好像感觉什么也听不懂，那是假的，其实你里面的真人已经听懂了。真人的智慧是假人的九倍。</div><div class=\"text-indent\">为什么佛在诸多法会上讲了一段经以后，当场给众生授记？不管你懂不懂，他都宣布你成佛了，就那么果断。是不是？即使你听不懂，你里面的真人已经听懂了。我们断气以后，前面的六种心、假人已经不复存在，当家做主的就是真人。这是「一步登天」的大法呀！佛讲你成佛了，是不是打诳语啊？不会的。成佛最简单！可是有几个人相信？这就是石破天惊的妙法！为什么不敢相信？因为它太简单了！因为它成佛太快了！你说冤枉不冤枉？</div><div class=\"text-indent\">所以「相待生劳」，这就在第七识来做文章。但这里「劳」已经叫「后七转识」，怎么样分前和后？前七转识它仅仅是对着虚空打妄想、在看，无意中就使我们真心本来面目现出有形有相的风云雨雾、泥巴瓦块……所以这个时候七转识感到好玩了，啊？虚空里怎么出现了这些东西啊？注意：它一定是认为虚空里出现的，明白吗？它如果知道是真心变现出来的话，我们就不会受苦了。它这个时候执着了：我能见，我有本事，乃至以为是自己生出来的，是不是？由种种妄想而陷入无明。它如果知道就是真心变现出来的话，它始终是明心见性的大菩萨来表演而已，而不会堕落为六道众生。</div><div class=\"text-indent\">生劳，也就是这个劳相，在「无明不觉有三细，境界为缘长六粗」的六粗之相里，属于第一个相，叫「智」。当「智」有了相，是不是开始执着了？我有本事，所以把它作为「后七转识」起智分别。佛在十番显见的时候把这个第七识说为「不动」，说为「真实」。当我们由前面的六种意识心已经观照到第七种心的时候，佛当下又把它说为「妄见」。之所以称为「妄见」，它能「起智分别」。「有动」就是「妄」，注意这个「妄」不同于世间法讲的「妄」。世间法讲妄——这个茶杯是金中金，钻石中的钻石，价值一百亿美元——叫假话。佛法里的妄是另外一种真实，它随缘显现出来。为什么讲它妄呢？这种「妄」没有来龙去脉。虽然找不到，却明明现前，怎么现出来的？是由我们无形无相的心变现出来的。我们的真心本来面目既不是真空，也不是妙有；既不是真，也不是假。它随缘显现为真，显现为假，显现为真空，显现为妙用，显现为虚空，显现为山河大地，要明白这个道理。它在这个程度上叫「妄」。懂得了妄，妄当下即是真，千万不能用世间法的虚和妄，来理解佛法里的虚和妄。</div><div class=\"text-indent\">「虚、妄、真、实、常、有、空……」等等这些佛法的名相概念被世间法滥用以后，已经失去了原汁原味。现在大部分人按照世间法的语言风格，按照世间的逻辑推理，按照凡夫的心态来妄解佛法里的一些专用名相概念，就造成了「邪师说法，如恒河沙」！而且能为大部分人所认可，这是佛法的悲哀！</div><div class=\"text-indent\">为什么几千年以来，求道者多如牛毛，得道者凤毛麟角？就是因为我们错解如来义，不懂装懂，而且百分之百以为就是对的。为什么佛在当年出世说法，一场法会几乎都是百分之百的人当下成佛？你可不要以为那是佛在世才能当下成就啊！错了。佛讲「依法不依人」，不管谁，只要把《法华经》《楞严经》讲对了，听的人同样都能成就，要不然佛就不可以灭度。如果只有肉身佛在世才能成就人，老佛爷就不可以走，是不是？所以佛把《法华经》《楞严经》讲完了以后，完成任务了，屁股一拍就走了！为什么？你们只要按照《法华经》《楞严经》来修，百分之百能成佛。</div><div class=\"text-indent\">这是讲的智相，就是我们的第七识，这个第七识就是我执。那么阿罗汉就是破除了肉团身、破除了六种意识心后，而执着于无形无相的这个第七识就是他。他那种人我空实际上是有漏人我空，他还有我执。真正的人我空，必须是明心见性的菩萨，证到了一分法我空的时候，他证到了真正的人我空；那么法我空呢，一切人、一切法都是一个人、一个念，他破除了阿罗汉那种个体本位的我，而证得一分大我。但是我们讲这个明心见性的菩萨证得了人我空、法我空，没有了我，那他为什么还现相，现这个肉身来啊？没有我，不妨假现这个我，不妨利用这个我来教化众生、来提升品位，明白吗？</div><div class=\"text-indent\">另外，我们讲证到了第七识，前面的六种意识心灭了没有啊？没有。第七识当下是不是就是前面的六种意识心？是的。可要明白呀！一二三四五识、六识、七识、八识、九识、十识，是不是就是一个识啊？是。其实啊，要真正来讲这个法啊，一句话：所有的东西都是一个念变出来的！可是人家不懂啊！明明只有一个念，怎么变出五识、六识、七识、八识？这就是佛的良苦用心！如果不开这个方便门，就是刚才讲的——哑巴看到贼，知道，却讲不出来。所以我们即破即立。怎么「即破即立」？破了前面的六种意识心，当下又把它立起来，当下就是七识、就是八识，当下这个意识分别心已经转识成智。</div><div class=\"text-indent\">为什么特别强调这个法呢？我就曾经遇到一位法师，说发动大家找真心在哪里……真心在哪里啊？当下是不是就是真心呐！比如说孙悟空变成茶杯，你还找孙悟空。茶杯是不是就是孙悟空？他非要把孙悟空找出来。手掌在这里，他非要找拳头，拳头在哪里？手掌当下是不是就是拳头啊？圆顿大法，唯智乃知。</div><div class=\"text-indent\">劳久发尘：这个「劳」，前面解释为是后七转识。在众生位，把它说为我们的真心本来面目。其实，讲大乘因缘法，它仍然是无明妄想，是根本无明；而前面的眼耳鼻舌身意这六种意识心，我们把它说为枝末无明。六道众生悲剧即在于，在枝末无明中执着、妄想、分别，所以佛通过七处破妄识、十番显见，把众生以方便法从前面的六种意识心——这种枝末无明引导到第七识这个根本无明；接着又通过两种妄想心——所谓「别业妄见」和「同分妄见」，来逐步地破妄；那么再进一步地通过讲五蕴、六入、十二处、十八界、「地、水、火、风、空、见、识」这四科七大，二十五个法，分别会相归性，归入到「如来藏妙真如性」。这四科七大、二十五有，实际上就是从枝末无明到根本无明，来把它回归真心本来面目，在佛法里把它说为次第空如来藏。有慧根的人从次第空如来藏即已能悟到次第三个如来藏，乃至悟到「一心三藏」。</div><div class=\"text-indent\">那么，从前面第一卷到第三卷，如果会用心的话，你可以达到八地以上的境界；不会用心，你也能超越六道轮回，看各人悟解深浅。诸佛出世，就是为了讲这一部《法华经》或者《楞严经》。那为什么《楞严经》把三藏十二部经统统判为戏论法？在《法华经》，佛把诸经说为「诸法戏论之粪」？如果不读《法华经》，不读《楞严经》，每个人都会怀疑师父是在谤佛谤法！为什么古今中外没有几个人敢讲《法华经》《楞严经》？甚至怀疑《法华经》《楞严经》是不是佛讲的。不客气地讲，一个法不能因为它是佛讲的，就以此说它是真理或者不是真理。如果《楞严经》是魔讲的，你们认可不认可？（几乎百分之百都表决认可），这就是破除迷信！《法华经》《楞严经》是真理，绝不因为它是佛所讲，而是因为佛讲到我们心里去了。任何人在真理面前必须低头。</div><div class=\"text-indent\">所以这一段经文，从会相归性，再反过来讲这个性是怎么样变现出相来的。我们会打妄想的这个第七识，「劳久发尘」，还是它老人家在「劳」，变现出凡夫也是它在「劳」，从凡夫回到佛菩萨的大光明藏，是不是还是它在劳啊？成圣成凡就是一个念在变来变去的，所以这个念叫「转相」，转来转去的，把我们由佛转成凡夫，由凡夫再转成佛，就是它一个人在转。</div><div class=\"text-indent\">所以真正的佛法是讲什么？它没有教我们去念佛、念咒，没有教我们去拜佛、拜忏；没有教我们去什么建大殿、建道场；没有教我们去行万善、破万恶……它仅仅是告诉我们善和恶、万法万相是怎么样变出来的；这一切的佛、这一切的菩萨、一切的众生是怎么样个来龙去脉；天上天下无量的万法互相之间是一个什么关系，讲得何等的深刻！而讲的方法从日常的衣食住行、耳闻目睹身受这些最贴切的方面开始讲，是不是显得非常朴素、非常真实？因为听这样的大法，你可以在一生中、乃至在一年中、乃至在一天中、乃至在一个小时中、乃至在一句话、一念中当下成就！</div><div class=\"text-indent\">真正明白这个道理呀，你不知道该作何感慨！许多人明心见性以后没有其它事情做，就是左右开弓、打自己嘴巴，认为自己太愚痴了！太无聊了！太傻了！太笨了！无量劫以来吃尽千辛万苦想要达到的东西，一念就可以成就！这既是事实，也是佛的金口玉言！佛在《楞严经》第四卷讲：「决定成佛，譬如以尘扬于顺风，有何艰险」？也就是说成佛最简单，像大风吹微尘一样！紧接着又讲：「何籍劬劳，肯綮修证」？哪里靠你去刻苦地修？哪里靠你去认真地修？你那是「无聊」！你那是自讨苦吃！佛讲得多辛辣、多干脆、多利索！所以我们要生惭愧心，要生恐惧心，要生恭敬心！我们该怎样感恩老佛爷啊！</div><div class=\"text-indent\">这个「劳久发尘」，要看它怎么劳法。佛在前面十番显见、七处破妄的时候，讲它不动，是不是？显见不动啊！那是不是方便哄我们呀？在我们执着在前面六种意识心的时候，它把这个第七识方便说为为不动。其实来讲，它动得最厉害，是前面六种意识心速度的无量百千万亿倍。它怎么劳？怎么动？它一秒钟有1280万亿亿次生灭，劳得这么快！劳得这么凶！为什么我们看不到啊？就是因为它太快了！一个癞蛤蟆在外面「嘣嘣嘣」地跳，你能看得到；一个火箭嗖地一下从你面前经过，你能不能看到火箭飞啊？不能。这叫流疾不见。所以我们现在多可怜啊！我们的心速现在跟癞蛤蟆的速度一样。佛法教育的目的就是把本有的智慧德能挖掘出来。祖师大德讲，如果你不把《法华经》《楞严经》读懂，三藏十二部经可以一笔勾销。</div><div class=\"text-indent\">你如果说：我会读《地藏经》，我会讲《金刚经》，我就是一部《无量寿经》是经王……告诉大家，《无量寿经》是经王，佛没有这样讲，祖师大德也没有这样讲，这个法没有任何根据。佛明明讲《楞严经》是「妙法莲华王」，明明讲《法华经》是「诸经之王」，此外没有讲第三部经是王！祖师大德讲：你真正把《法华经》《楞严经》读懂了，三藏十二部经都是废纸！诸佛金口玉言都是废话！就看你懂不懂。如果没有读懂的话，你都是半瓶子晃荡。你把《法华经》《楞严经》读懂了，好了，三藏十二部经统统是《妙法莲华经》！耶稣教、天主教、天文、地理、数学、语文统统是《妙法莲华经》；乃至吃饭、穿衣、刮风下雨、泥巴瓦块、牛屎狗粪统统都是《妙法莲华经》。为什么？《法华经》《楞严经》就是告诉我们：一切的万法统统是一个人一个念之所变现。妙就妙在这里，「先破后立，即破即立」，并不是破了以后就完了。如果只破不立，那你把《法华经》《楞严经》也讲成了邪法。</div><div class=\"text-indent\">久，在六粗第二相，叫「相续相」。当我们前七转识转化为后七转识，在快速地分别妄想、恒审思量时，是不是一个念接着一个念啊？分别的念相续不断，佛在前面怎么讲的？像暴流一样，是不是？前不落后，后不越前。众生在动荡之中却不知道动荡的当下就是我们的真心本来面目！我们只要停止妄想，当下就是如如佛。为什么？一杯浑浊的水天天在这动啊、晃啊，它能不能沉淀呐？（不能）。你放在这里静止，它能不能沉淀啊？（能）。如果里面再加一点明矾，沉淀得更快，是不是？读《法华经》《楞严经》就是加明矾，很快地沉淀；不加明矾，即使我们坐在这里不动，是不是也是一种动啊？那种坐空定，猴年马月都不一定能成就。</div><div class=\"text-indent\">圆顿大法是修「动中定」。那么一盆浑水，一盆清水，在浑水里你能不能照清自己的脸啊？不能。在清水里你能不能照到啊？能。好，在清水能照到就是表明心见性，通过《法华经》《楞严经》而开悟，明心见性就是分真即佛。他已经不落六道轮回。但是定下来的泥巴是不是要清除掉？否则就不能成圆满佛。在这个时候，我们用各种方便法门，念佛、拜佛、修禅定、念咒，包括吃饭、走路、穿衣，统统都能用得上，就是把那些泥巴逐步地清除掉。这个比喻能听得懂吗？</div><div class=\"text-indent\">我们几千年以来就是犯了这个比天还大的错误，妄想通过方便法门来明心见性，他不知道佛的教诲是通过明心见性以后再修方便法门圆满成就。都搞颠倒了！师父这些话经得起《楞严经》印证！所以从我们这一代起，修行人要百分之百地成佛，而且要当下成佛！不可以拖到第二世去，要恢复当年佛陀在世时那种教育的气氛！文殊菩萨在后面第六卷斩钉截铁地讲：〖归元性无二〗。「归元」就是成佛，「性」就是「明心见性」，除了先明心见性，没有第二条路，我们不要有任何指望。</div><div class=\"text-indent\">发，即成就；尘，在六粗相里，可以与第三相对应，叫「执取相」，「执取相」对应于我们的「第六意识」。怎么执取相呢？同样一个事情，同样一个过程，它反反复复地出现，是不是我们形成了固定的认识了？比如说每天太阳都是从东方升起、从西方落下，是不是？就是在执取，「哦，太阳每天一定是从东方升起，从西方落下」；而不是从南方升起，北方落下，是不是？这叫「执取相」。</div><div class=\"text-indent\">自相浑浊：怎么「自相浑浊」呢？有许多相同的境界，相同的名号；还有许多不同的名号；相同的名号之间也还有种种的区别。要想使十法界有条不紊，自然产生了「名字相」。这个「名字相」属于六粗的第四种境界，有了名字相以后，对于世间法这个精神文明也好，物质文明也好，都有巨大的促进。有了名字了，我们可以闭门造车，不一定要身体力行到某一个特定的时间空间，他坐在家里就可以打妄想；但是对于修行人，相反的，也造成了巨大的障碍。这样就使得我们的妄想分别更多、更快，就离开我们的真实智慧越远，造成了十法界森罗万相，千变万化。</div><div class=\"text-indent\">由是引起尘劳烦恼：这个「尘劳烦恼」，在六粗相里就是「起业相」，起业就是造业，身口意三业，同时在造。言为心声，行为心使，身为心役，三业中的根本就是意业，意业就是我们的心。这个「尘劳烦恼」，「尘」为身烦恼，「劳」为心烦恼。六道众生因为有肉团身这种生命体，有妄想心这种烦恼习气，使得一天到晚，生生世世在烦恼中度日，在烦恼中轮回。</div><div class=\"text-indent\">那么在这前面是说明了三细六粗，是这种根本无明和枝末无明在交错进行时现出了虚空相，现出了地水火风这个器世界，现出了这个有情众生种种的烦恼、造业之相，这就是个基本的概括。下面来讲，佛又从另外一个角度，对于这种变化进一步进行解释。</div><div class=\"text-indent\">起为世界，静成虚空：这就是六粗相中的「业系苦相」，就是种种的轮回受报之相。「起」作为动相来解释。十法界生住异灭、森罗万相，归结起来就是「生住异灭」这四相无明；再把它归纳起来，无非是「生灭」这两种无明。做人、做天、做鬼、做佛、做菩萨，这是不是十法界花花世界的总的面貌？与之相对的就是虚空之相，虚空包容一切的万法。所以这个业系苦相，也是对三细六粗最后来一个总概括，如此形成了我们这个花花世界。</div><div class=\"text-indent\">虚空为同，世界为异，彼无同异，真有为法：</div><div class=\"text-indent\">这是进一步地提升，把这一切的万法概括为「不空如来藏」，概括为有为法。「虚空为同，世界为异」，这是佛想把我们的心从有为和无为这两个方面来讲，让我们来作一个判别，使我们的心更加细腻。「彼无同异」，就是前面讲的「无同无异」。大家看，从日月星辰、山河大地、树木华（华同花）草，再到佛菩萨、天人鬼畜，你说它相同的话，它森罗万相、千差万别，所以你不能讲它同。不能把它讲「同」，是不是就是「无同」？你讲它「异」的话，是不是都是地水火风四大组成啊？所以你不能讲它异，不能异是不是就是无异啊？</div><div class=\"text-indent\">再拿在座的听经的同修来讲，你讲他是同嘛，男女老少、红黄黑白、高矮胖瘦，你不能讲是同啊；讲是异的话，是不是都是一个皮肉筋骨啊？你讲他同的话，各人的个性脾气一样不一样啊？不一样的，你不能讲是同。你讲是异的话，大家耳朵都能听，眼睛都能看，嘴巴都能吃饭，是不是啊？所以这本身是不是一种有为法呀？如果不是有为法，它能不能形成千差万别？更何况每时每刻各人都在动、各人都在想，都在变化，有情在逐步地走向成长，再走向衰老，然后灭亡；灭亡以后投胎，再出来……树木华草，一岁一枯荣；风，前面刮走了风，后面又来了，是不是一直在生住异灭啊？（是）。所以「彼无同异，真有为法」呀！那么相对而言，那个「虚空为同」是不是无为法呀？虚空有没有要怎么样，不怎么样啊？有没有讲「啊，这一大群鲜华好，我就喜欢鲜华」？它有没有讲「啊，这是一堆牛屎狗粪」，就皱眉头：「怎么跑到我虚空里来啊」？世间法都有一条，叫什么？虚怀若谷啊！虚空就是表我们的心量，表包容的心。</div><div class=\"text-indent\">那么无为法和有为法，方便介绍一下。在佛门内部来讲，藏教菩萨是修有为法，要念佛、拜佛、拜忏、行善积德、供佛、供舍利、供什么什么……有为法是生灭法，它不能了生脱死。文殊菩萨在第六卷那段偈颂里，把大势至菩萨念佛法门判为不能成就；把优波离讲的持戒法门判为不能成就。特别是刚学佛的人不能成就，为什么？有为法能够使我们得到一定的人天福报；要明心见性，根本不可能，必须搞明白。《金刚经》就把有为法判为邪法，讲得很清楚，「若人以色见我，以音声求我，是人行邪道，不能见如来」。</div><div class=\"text-indent\">无为法，就是修禅宗，他破一切相归性，见虚空之性，连佛的三十二相都判为无明相，这叫无为法，就是看好自己的心。可是这个法用圆顿大法来讲，以有为之心行无为之法，仍然是有为法。所以文殊菩萨把月光童子、虚空藏菩萨修的禅宗法门判为不能成就，修这些法门的百千万亿人中有那么一两个，由于一种特种的机缘，给他们瞎猫碰到死老鼠，也能成就，但不是普遍修行的法门，要明白。</div><div class=\"text-indent\">所以讲有为法、无为法都不能成就。我们的真心本来面目是什么？非有为，非无为；它可以现有为、现无为。你明白了这个道理，你当下即是非有为、非无为；即有为、即无为，以此心修行，决定成佛！你懂得了这个心，你就已经成佛一大半。《楞严经》讲，果地觉与因地心必须一致，才能成就。因为我们的果地觉就是「非无为，非有为」这么个果，所以我们因地发心修行，你必须要先懂得「非有为，非无为」这个本来面目。这个法太妙、太简单、太现实！有些人不懂、不信，就是因为它太简单！因为我们总是用凡夫的心把事情看得很复杂，自作多情，还自以为很怎么样。</div><div class=\"text-indent\">我们要非常珍惜这个法呀！自从师父讲了这个法以后，十来年来，全国每一个地方，少说几十处，你们可以去调查，都是萍水相逢，当下成就！要好好珍惜呀！不要把眼光盯着外国，不要把眼光盯着台湾，我们要「依法不依人」！要依人的话，我没有名气，没有地位，我什么也不是，而且出家时间很短，到现在才十来年。</div><div class=\"text-indent\">所以这里「彼无同异，真有为法」，也就涉及到我们佛门内部的一种修行次第，这也是带有笼统地承上启下来解释这个世界众生的成因。下面再进一步地解释无为法跟有为法怎么样交互作用来形成十法界万法。</div><div class=\"text-indent\">觉明空昧，相待成摇：</div><div class=\"text-indent\">觉明，就是我们的妄明，就是我们的无明妄想。用方便语来讲，一切的有为法因它而有，从根本无明到枝末无明，它都在动心、打妄想，所以把它说为是有为法。「空昧」，这里就是指虚空。怎么「空昧」呀？「昧」就是我们的无明妄想，使我们眼前执着于境界，而忘记了我们的本来面目，叫「昧」。「昧」的这个「空」，就是表真心本来面目，表真空。当我们心里有了一个念以后，就有了虚空的感受，这个时候就叫「空昧」。「空昧」，即晦昧之虚空。</div><div class=\"text-indent\">相待成摇：「相待」即互相对待，「成摇」即打妄想而形成摇动。怎么「相待成摇」呢？我们这个第七识对着晦昧虚空（即「空昧」）打妄想，有了对待。第七识对着虚空打妄想，一打妄想是不是心就在动啊？我们有时急得满头大汗、脸烧得通红，心是不是在动？我们为什么急啊？是不是对着某件事情在打妄想啊？（是）。我们单个的这个第七识力量大，还是无量的第七识力量大？我们所对的单个的境界大，还是整个虚空的境界大？以此深究，在无明之初的那个第七识跟我们现在的第七识，谁的力量大？（无明之初的第七识力量大）。而且它是面对整个虚空「相待成摇」，那个摇动的力量是不是很大呀？所以「故有风轮」，我们心一动就有风。</div><div class=\"text-indent\">在电视里看到过气功师隔墙推牛这个节目或者知道这个事的人，把手举给我看一看。他为什么手能把墙外的牛推倒啊？是不是心在用力？大家明白吗？这就是「觉明空昧，相待成摇，故有风轮」。像这种风轮，那是微不足道。我们想象是在无明之初，我们靠真心很近的那个见分、见精，力量是不是很大呀？在这里我们已经明白这个道理了，当有了一念业相无明的时候，就已经形成了虚空。在此之前，真空无形无相。</div><div class=\"text-indent\">有了虚空，那当我们第二念根本无明——叫「转相」、「见分」、「第七识」，我们在前面是不是跟自己的第七识见面了？在此之前，这个第七识天天跟我们在一起，我们还不知道它在哪里，它无始以来有没有离开过我们半步啊？（众答没有）。有没有离开我们一分一秒啊？（众答没有）。可是我们却不认识它，你说这个事情是不是很糟糕、很悲哀啊？一旦明白这个道理，你就已经了生脱死了！继续研究，第七识对着虚空打妄想，是不是就有了风？</div><div class=\"text-indent\">公案记载，两个小和尚看到红旗在飘动，一个讲是红旗在动，一个讲是风在动。六祖怎么讲的？仁者心动。</div><div class=\"text-indent\">再讲这个茶杯是不是风，要细细观照。这个茶杯每分每秒都在不断地风化、锈蚀，放上二十年茶杯表面就会全部锈光，这就是「风动」。这个茶杯一百年以后可能锈成一堆粉了。它是一百年以后突然锈成粉了？还是每时每分每秒都在锈？那是不是就在动啊？是不是就是「风」啊？我们有时候跑到那个钢材仓库里，远远几十米、几百米就闻到那个铁腥味。是不是？</div><div class=\"text-indent\">这些坚固的物体，随着我们的妄想而显现出来。可不是由你心生出来的，明白吗？它当下就是我们的心啊。如果它是我生出来的话，它是我的儿子，明白吗？是我变出来的，它就是我，我就是它。只是因为我们地球人心力比较微弱，它要通过岩石炼成铁，铁水炼成铁皮，铁皮再打成茶杯。中间还要盖工厂，还要搞设计……麻烦。而天人心里一想就有啊，因为他心力比我们强。更不用说诸佛菩萨了，要风得风，要雨得雨。</div><div class=\"text-indent\">修行的目的就是要得到这种自在的解脱，整个尽虚空遍法界都是我们一个念之所变现。我们现在执着有一个家庭，有一个太太老公，有一个争气的儿子媳妇，有个几百万几千万……尽虚空遍法界都是我们呐！都是我们一个念！你怎么心量这么小啊？更何况你今生执着了，来世就没有了！</div><div class=\"text-indent\">执持世界：这个「世界」，实际上是无量的世界、无量的国土，无量的世界、无量的国土下面就是个大风轮。那落实到每一个小世界，比如说一个太阳系，比如说我们地球，下面又有大风轮、中风轮、小风轮、小小风轮、小小小风轮……还有个总风轮。太阳系以须弥山为中心，周边四大部洲这个小世界，作为一个本体来讲，下面这个风轮有多大呢？有十六亿由旬厚，一个由旬少说四十里，多说一百二十里，说法不一，我们一般把它说为一百里，好计算呐。也就是这个风轮1600亿里厚，它的直径是无限的。风轮有多坚固呢？用最大最大的金刚轮，你打到风轮去，当下砸得粉碎。要知道，世界的基础就是风，没有风的话，飞机能不能在天上飞？（不能）。轮船能不能在水上行啊？（不能）。都是靠风力托住了。</div><div class=\"text-indent\">我们只要想一想，当下是不是心量打开了？1600亿里厚的风轮无边无际，一念观照有多大功德，你知道吗？听经容易听懂，烦恼的事情容易放下，为什么？你心量扩大了。你可不要简单地认为：啊？1600亿里？不止吧？可能2000亿里吧？那些都不重要，明白吗？真正的意义并不在于多大，而在于叫我们随文入观，拓宽心量。今后凡是读到《法华经》《楞严经》，佛讲一个大、一个长，往往讲的无量百千万亿恒河沙国土化微尘，每一个微尘都代表无量百千万亿那由他数，然后那个大数还是这个数的无量百千万亿那由他倍，佛在《法华经》讲这个法特别多，你可要当心！到底是不是那回事，并不重要。谁去调查核实，反正又不卖钱，是不是啊？关键在于拓宽我们的心量，要知道佛的良苦用心。</div><div class=\"text-indent\">更微妙的是，释迦牟尼、文殊菩萨和燃灯古佛这三者的关系。佛有时候讲燃灯佛给他授记，是他的师父；可是，燃灯佛又是文殊菩萨的弟子，文殊菩萨还是释迦牟尼佛的弟子。那燃灯佛到底是他师父，还是他徒孙啊？你认为这是不是佛粗心大意啊？他是有备而来，看你有没有智慧，大光明中谁是谁？谁又不是谁？全在随机说法。那我讲我是释迦牟尼佛，你们信不信？那我讲我还是白骨精，你信不信？宋朝的岳飞是我，秦桧也是我，信不信啊？你真正的信，你真正的是「如是我闻」，这个法妙啊！妙极了！</div><div class=\"text-indent\">再提醒各位：我们睡梦中梦到一切的境界是不是千差万别呀？千差万别的境界是谁啊？是不是你一个人变出来的？你只要一打呼噜，你比孙悟空的神通还要大。你当下就能翻跟头，千变万化。师父讲的这个法是给你们开玩笑还是当真的？梦是不是真的？佛法里没有假的。为什么梦里能千变万化啊？就是因为我们做梦时眼睛也不看，耳朵也不听，鼻子也不闻，心专一了，明白吗？梦中想解小手就来了个马桶。多自在啊！你现在不行呐，你要方便你到厕所里去，你要人民币要去打工去。你梦中想要钱，钱就来。《楞严经》讲「一真一切真」，要信这个法——一切的东西都是一个念变出来的。</div><div class=\"text-indent\">所以诸佛着急啊！就是因为这个法太简单了，人家不相信。佛没有办法，拖拖拉拉讲了三藏十二部经。除了《法华经》《楞严经》，其他都是方便法、戏论法！在几千年之前的古希腊哲学就涉及到地、水、火、风四大而成就万法……佛是利用善法来引导到正法。佛再三讲：我就是讲了一个法，就是「如来藏」，其它法是佛没有办法的办法才讲的。你一开始讲「如来藏」，说这个茶杯也是我，牛屎狗粪就是我，谁相信啊？可佛讲的是真理啊！</div><div class=\"text-indent\">因空生摇，坚明立碍：</div><div class=\"text-indent\">实际上就是前面讲，「无同异中，炽然成异」。因为我们能见的这个见分、我们这个七转识面对着虚空打妄想，使得真心本来面目中本具的各种境界，包括坚固的物体、流动的液体、流动的气体乃至一切的我们所能耳闻目睹身受的万法，应运而现。不能讲应运而生，没有谁生谁；也不能讲由虚空生出来，虚空能生出东西来，它还叫虚空吗？都是本有的，无形无相，一下子粉墨登场，出台亮相。</div><div class=\"text-indent\">因空生摇，仍然回到前面的「觉明空昧，相待成摇」，在现出风轮的同时，而「坚明立碍」。「坚明立碍」，「坚」，即是我们心中的一念坚固之相；「明」，即我们心中的一念明亮之相；「坚明」就是坚固的无明妄想；「立」，即显现出；「碍」，即坚固的色法。一切的万法，都是我们的性具本具功德。讲到性具功德，它一定是无形无相，但是真实存在。</div><div class=\"text-indent\">比如说这个蜡烛在点亮之前，那个光亮之性在不在里面啊？你眼睛能不能看？（众答不能）。心能不能看到？（众答能）。如果没有光亮之性的话，它怎么样点都不会亮，这叫「性具功德」。那么性具功德它是随缘而显现。比如我们用一根火柴把蜡烛点亮了，那里面的亮光是哪里来的？它是不是本来就有，随着火柴点燃而显现出来的？（众答是）。它并不是因为你点了以后把它生出来的。它现成地就在。世间人认为就是点亮了火以后，这个蜡烛生起了火。但是来讲，在佛法里头变现的火，没有点亮之前火亮就在；那么火点亮了以后，蜡烛点完了以后，那个火灭了没有啊？（众答没有）。没有灭，那火跑到哪里去了？是不是跑到空气里去了？空气温度是不是增加了？所以讲到「性」，它不仅是无形无相，还是不生不灭，它永远不会消灭。尽虚空遍法界就是我们一个念，无量的天人鬼畜、山河大地，它生了没有？（众答没有）。它死的时候死了没有？（没有）。从来没有生没有死，它就随着万缘来变现。</div><div class=\"text-indent\">修行人要生惭愧心啊！外道都在探求宇宙人生真理，探求人到底从哪里来的，探求第一个人从哪来的；可是百分之九十九的修行人只知道念佛、拜佛……念了有什么用？要开智慧。《楞严经》之外的诸经是佛借助于因缘戏论法，借助自然戏论法，那些相对而言比较带有一点点智慧型的东西来引导我们而已。修行人不能把自己降低到外道的身份，乃至连外道都不如！外道中也不乏有佼佼者。古希腊哲学研究了地水火风变化万物，他若再向前迈进一步研究地水火风从哪里来的，是不是就变成佛法了？</div><div class=\"text-indent\">你现在让修行人去研究地水火风变现出万法，他都不会理睬的，连外道都不如！还在自以为是！这就是一种悲哀！乃至现在不少的人，反而回大向小，去学《弟子规》去了。国家政府号召大家来学《弟子规》功德无量，明白吗？学佛人去搞《弟子规》是不是回大向小啊？讲「人成即佛成」，是吗？人成，持五戒即可。佛讲了持五戒能成佛吗？那这个法邪在哪里？第一，人成了，佛并没有成，这个不用讲；第二个，要成佛不一定要先成人。阿弥陀佛怎么讲的？六道众生是不是都接啊？是不是天人鬼畜都能成佛啊？（众答是）。</div><div class=\"text-indent\">我讲这个法是邪法与太虚大师没有关系，因为太虚大师一生并不是就讲了这一句话，或者这句话是对个别人而言。我讲这个法是邪法，并不意味着太虚大师就是邪人！佛把自己的三藏十二部经判为邪法，佛有没有讲他就是邪人啊？（没有）。现在这些人也未必太天真了吧？可是现在有些人可敏感了，你讲了什么事情马上就给你扣帽子：你诽谤祖师大德……真是莫名其妙！而有些人还一听就相信：对啊，这是某某祖师大德讲的……许多人闷在心里不敢开口，我讲了这个话以后，他们讲：「哎呀，师父你真胆大！我老早就放在心里，可我不敢讲呐！都给你讲出来了」！</div><div class=\"text-indent\">所以这个「坚明立碍」，我们种种错误的心态是不是「碍」啊？都是「碍」啊！障碍自己啊！我们每动一个念，就是一个众生。泥巴瓦块不是众生啊！千万不要轻易打妄想，凡是那些黑暗的妄想都是我们的障道因缘。</div><div class=\"text-indent\">彼金宝者，明觉立坚，故有金轮，保持国土：</div><div class=\"text-indent\">这里继续说明以上的「因空生摇，坚明立碍」。「坚明立碍」这个「碍」就是「金宝」，这个「金宝」就叫「金轮」，也叫「地轮」。那么从第二层天往下，以须弥山为中心，其周围有四个大洲，地球就在南瞻部洲。玉皇大帝的天就在须弥山顶。须弥山，长336万里，宽336万里，高1008万里；围绕山脚第一重香水海，第一重香水海外面是第一层金山；第一层金山外面是第二重香水海、第二重金山，一共是七重香水海、七重金山；七重金山外是第八重海，叫咸水海；咸水海之外是叫铁围山，所以我们这个国土叫九山八海。地球在南瞻部洲，是咸水海里的一个岛屿。</div><div class=\"text-indent\">这个「金宝」有范畴，也有厚度。当然，绝对不是指地球。它是个本土，直径十二亿三千四百五十由旬，相当于一千二百亿里。这片国土就是由我们的第七识跟虚空在摇，我们心在看虚空，这个心就在摇，就在动，大家明白吗？不是用什么东西摇，如果这样摇的话速度太慢了。</div><div class=\"text-indent\">举个例子来讲，如果这里没有障碍的话，在眼前二百米的这个虚空，能不能看到啊？能。那我看这个柱子到这里大概是八米，我看八米的这个柱子时间比如说是一秒钟的话，那我看二百米前的柱子，是不是也是一秒钟啊？也就是距离不一样，但是我起心动念的时间是一样，是不是越远这个心力越大啊？</div><div class=\"text-indent\">当我们心在无明之初，心力很强的时候，我们心里是不是很宽广啊？看那个虚空是不是无量无边的？一起念就超过太阳光速无量倍，由于这么样一个原因，祖师大德讲，叫「带出了境界之相」，怎么带出了啊？说明1200亿里直径的这么个大实体是不是本来就有啊？它是随着我们这个因空生摇的因缘，而当下显现出有形有相；而且还要懂得，这个第七识在第八识里是无量，无量的第七识是不是也是本来就有啊？无量的第七识共同地对着虚空打妄想的时候，这叫「同分妄见」，由于同分妄见，现出了山河大地。</div><div class=\"text-indent\">明觉立坚：明觉，就是无明妄想；立坚，不可以解释为「立」，应解释为「带出坚固物体」或「显现出坚固物体」。解释为「立」就已经降低到《大方广佛华严经》那个别教的境界。《大方广佛华严经》讲，「一切唯心造」；弥勒菩萨的《唯识》讲，从识性流出无量如来，它都有「能」与「所」。到了《法华经》《楞严经》，叫「一切唯心现」。现和变都是一个人自己表演；到了「造」就是一个人生出了另外一个人。</div><div class=\"text-indent\">保持国土：这就是我们这一片国土。谁是老总啊？玉皇大帝。第二层天跟地球是同一片本土，第二层天和第一层天叫地居天，共一个太阳，共一个月亮，就在太阳系里转，属于一个世界；从第三层天往上叫虚空天，第三层天往上没有太阳，没有月亮，天人自己就是光。所以这个坚固国土的成就，在《楞严经》把它说为「一念坚固妄想」。我们进行了一次实验，两个手合在一起，比较一下然后再分开，打三分钟的妄想，叫左手比右手长长长，三分钟以后一合，果然就长出了几公分。那是不是叫作「因空生摇，坚明立碍」啊？那通过小小的实验来观照这段经文，容易理解。</div><div class=\"text-indent\">坚觉宝成，摇明风出，风金相摩，故有火光，为变化性：</div><div class=\"text-indent\">这段经文就是解释「火」是怎么样来的。「坚觉宝成」，这里仍然是讲上面的地轮，金轮。「坚觉」就是坚固的妄想、坚固的无明，坚固的那种明觉；「宝成」，就是成就了金轮之宝。「摇明风出」，「摇明」就是我们的无明妄想对着外面的境界打妄想，是不是「摇」？心一动就是风，即「摇明风出」。「风金相摩」，风一出来，看到前面的什么汽车、拖拉机、人，是不是就产生摩擦？那个飞轮一转碰到铁，是不是火星直冒啊？是不是火光就出来了？但是你可不要以为那是摩出来的火光，而是随着「摩」这种因缘和合而显现出火星。</div><div class=\"text-indent\">为什么讲《楞严经》是真理？并不是因为它是佛讲的，因为它讲出了我们的心，因为我们本来就是这个东西。所以师父讲：即使它是魔王说的，我都拜他为师！这也是佛教导我们：依法为师！甚至有些人为了诽谤《楞严经》，讲《楞严经》是后人伪造的。管它谁造出来的，我们就是认定它是真理，是不是？就这一点狠。许多祖师大德也是这样讲，管它是谁写的，它是真理。何况所有的经典都是后人编出来的。我们在前面讲经典的来源的时候作了解释，是佛五百弟子经过最严密的程序而成就的，要深信不疑！你讲《楞严经》是编出来的，那所有的经典都是编出来的。</div><div class=\"text-indent\">所以「故有火光」，这是不是也符合我们心法呀？「为变化性」，怎么叫「为变化性」？「火」没有实体，它是寄物而成。这里当下就是「火」，它有温度。有人讲，冰是零下三度，是不是「火」啊？只要有温度，它就是「火」，零下三万度都是「火」。我们有冷暖的感受，热是「火」，冷也是「火」，是不是？这个世界上无非是地水火风四大假合。「地」有了，「火」有了，「风」有了，还有「水」，是不是？</div><div class=\"text-indent\">宝明生润，火光上蒸，故有水轮，含十方界：</div><div class=\"text-indent\">水是不是现出来了？怎么现的呢？「宝明生润」，「宝」是指固体物。有没有哪个固体物里没有水啊？（众答没有）。到了梅雨季节，家里的那个刀啊、家具啊、地板啊……是不是要转潮啊？它是不是本能的就有水啊？人体这个宝它有没有水啊？（众答有）。没有哪一个物体没有水。早晨起来的时候，那个窗户上是不是水蒸气啊？是不是你这个宝明在生润啊？</div><div class=\"text-indent\">火光上蒸，这里理解为，随着我们的温度热量往外蒸。如果讲「火光外蒸」就好了，正因为讲这个「上蒸」造成了两个祖师（圆瑛大师和智定大师）打官司——也就是讲，地轮、水轮、火轮、风轮次序排列，到底谁先谁后？下面有两个公案，我们来看，可有意思了。</div><div class=\"text-indent\">故有水轮：我们这个「火光外蒸」，不要以为我们急得满头大汗的时候它才外蒸呐，我们时时都在外蒸，要明白。我们有没有哪一时哪一刻离开水啊？（众答没有）。空气里面有没有水呀？（众答有）。我们是不是时时都在大海里啊？（是）。我们有没有谁离开火啊？（众答没有）。我们是不是时时都在大火里啊？（众答是）。而且水和火就是一个东西。</div><div class=\"text-indent\">天人看这里，当下就是虚空。到了晚上五点钟以后，大街上天人鬼畜到处乱跑，有没有哪个跟鬼或者跟天撞得鼻青脸肿啊？（众答没有）。他就跟你对面跑过去，你过去，他过去，很好玩是不是？你还以为我们就是个肉团啊？我们在一定因缘的时候也能显现出虚空，明白吗？这个世界上你不要把哪一样东西就当真，一切都是假的。但是奇怪的是，你知道一切都是假的，当下就是真的，妙不妙啊？（众答妙！）</div><div class=\"text-indent\">真心本来面目非真非假，它现真现假；非空非有，它现空现有；非水非火非地非风，它现地水火风；而且在现空的当下就是有，现火的当下就是水，你说这个妙不妙？诸佛出世就是为了告诉我们这个天机。所以在灭法时代，《楞严经》首当其冲，遭灭顶之灾，因为它说破了天机，我们却不懂得珍惜这样的大法，你说天理何在啊？！</div><div class=\"text-indent\">那么多人，我们想把他们度进佛门里来。他们用小人之心、门户之见，带着种种的怀疑之心，就好像我们是去算计他们一样，你说可怜不可怜呐？乃至佛门内部一些信众都还在怀疑，包括我的一些弟子。你要是给他们讲得严厉一点，他还不知道用什么样的心态来看待你。好好想一想，因为这个法太重要了！百千万劫都难遭遇！百千万劫，你能听到《法华经》的名，都不容易啊！师父既然来到这个世界上，逮到一个是一个，明白吗？（众答明白）。到时候就不明白喽！越是坏人你越要来听，这是真的！你一念明白「如来藏」道理，天大的罪过给你一笔勾销！如果不勾销的话，你统统交给我。《楞严经》倒数第二页是不是这么讲的？！</div><div class=\"text-indent\">关于这个地轮、水轮、火轮、风轮先后产生的次序，历来有两种说法，互不相让。一种说法呢，以圆瑛大师为首，基本上按照《楞严经》的次第来讲：先有我们的真心本来面目；真心本来面目中本来就有虚空世界、山河大地，本来就有三细根本无明、六粗枝末无明，本来就有，他这是一一地按次序来出场，不存在谁生谁。就跟演戏一样，是不是演员要一个一个挨着登台啊？一个一个登台的演员，你能不能讲第二个登台是第一个演员肚子里生出来的？能不能这样讲？这都是本来存在的一本戏。大家注意，这是解决我们生生世世的迷惑颠倒，今天在这里画一个句号，从根本上开悟！这是按照别教的分别法，把我们的真心本来面目方便说为如如不动的真空，一定要注意！这是方便说，不是真实说！</div><div class=\"text-indent\">真实说那就是，我们的真心非真空、非妙有；它现真空、现妙有，讲来讲去不就是「真空妙有」这两回事嘛！我们刚才讲的虚空、金轮、水轮……是不是都是妙有啊？这个「本觉」就是别教讲的「真心本来面目」，是真空，什么也没有是指「相什么也没有」；「什么都有」就是后来出现的虚空世界、山河大地，都由性具功德所显现。法尔如是，本来存在着。</div><div class=\"text-indent\">既然有这么多性具功德，它在一个不确定的时空点，是不是随时可以跑出来啊？（众答是）。所以先跑出来一个业相无明，这个时候就形成了一个虚空，由绝待之真空变成相对之对待的虚空。我们把它说为是「空轮」，十法界首先是不是要有虚空啊？叫「空轮」。在空轮与真觉之间，就是一念业相无明，有了空轮以后，因为有了业相无明了，有了第一念，何愁没有二念、三念、无量念啊？所以二念、三念、无量念就对着第一念，对着虚空打妄想，就生出了风轮。到这里两派的说法是一样的，没有区别。先有「本觉」，再有虚空——空轮，再有风轮。那么随着有了风轮的同时，那个本来就存在的坚固妄想，这个时候登台亮相为金轮，就是刚才讲的我们的地轮。</div><div class=\"text-indent\">那么在这个问题上来讲就不同了，智定大师认为不是地轮，是水轮，为什么？他的理论就是说，完全有可能是水轮出现，水是不是也是境界之相啊？（众答是）。而且讲为什么形成金轮呢？就跟煮牛奶的时候一样，牛奶上面是不是有一层油啊？烧稀饭，稀饭上面是不是有一层油啊？是这样的物体而和合为金轮。他的理论根据在于，因为看到这个地球是水中的岛屿，我们不是讲「三山六水一分地」吗？地和山是不是金轮啊？它只占比例四成，水占六成，所以我们在太虚空看这个地球的时候，是不是水上的海岛啊？讲这个法的人一般地是开了天眼的，想重新来对《楞严经》进行解释。</div><div class=\"text-indent\">那么按照《楞严经》来讲，把金轮排在先，把水轮排在后。金轮是不是有润相啊？刚才讲了，我们脸上是不是会流汗呐？往往这些金属到了梅雨季节，外面有一层水气，就这个道理。所以在这两派，到底谁正确谁不正确啊？我们今天来给他结案。</div><div class=\"text-indent\">到底是先有金轮？还是先有水轮啊？作为圆教来讲，我们可以讲都是对的。比如：到底是先有鸡还是先有蛋？我们讲：也可以先有蛋后有鸡；也可以先有鸡后有蛋；也可以同时有蛋有鸡。</div><div class=\"text-indent\">这里体现出佛的良苦用心啊！我们这个一念既可以突变、剧变，也可以慢慢地渐变，全靠我们自在把握。佛为了教化众生，恒顺众生的一种习气：先上幼儿园，再上小学、初中、高中、大学，生怕把我们吓跑了，抱着石头过河——走一步看一步，大家明白吗？而成佛以后，我们当下可以普现无量色身三昧。</div><div class=\"text-indent\"><strong>火腾水降，交发立坚，湿为巨海，干为洲潬。以是义故，彼大海中火光常起，彼洲潬中江河常注。水势劣火，结为高山，是故山石击则成焰，融则成水。土势劣水，抽为草木，是故林薮遇烧成土，因绞成水。交妄发生，递相为种，以是因缘，世界相续。</strong></div><div class=\"text-indent\">火腾水降，交发立坚，湿为巨海，干为洲潬：</div><div class=\"text-indent\">这里进一步帮助我们分析液体的海和固体的陆地是怎么形成的。从究竟义讲，我们知道，都是心的性具功德随缘显现。佛为了开导众生，从另外一个角度说明，是火与水这二性的交互作用。以上不是讲了嘛？我们心里的性具功德既可以突变大海高山，也可以渐变，用相互之间的和合、分离的那种因缘、相互之间的作用影响来显现。所以「火腾水降」，火性跟水性都是我们的性具功德。</div><div class=\"text-indent\">一定要注意——这是佛恒顺众生的心态。因为火往上升，水往下降。那比如中国人站在北半球，看到火往上升，水往下降；巴西人站在南半球，他看到的是不是应该与中国人相反的？所以在这里来讲，火和水，火是热性，水是凉性，实际上就是一种交互作用，对待之性，明白吗？</div><div class=\"text-indent\">你如果要刻意说这是上下的话又错了，这是佛没有办法的办法，恒顺世间人而讲「火往上升，水往下降」，是不是啊？这是我们自性中的本来功德，佛不这样讲就没有办法开口，大家明白吗？因为出世间的法没有办法用世间的语言来表达，这都是强词夺理。学经不能依文解字，要用智慧来观照，也可以把这个讲成「水火共生」之义。</div><div class=\"text-indent\">交发立坚：交发，究竟法理解为这两种因缘对待的时候，而引发出器世间的这种物质。坚，这是指海水和陆地，包含固体，也包含液体；立，这里解释为「成就」，也可以解释为「显现出」。你不能理解成因缘和合而产生，那是讲小乘法，好像把面粉和米粉和起来制成了饼干，不是这样理解。这个「交发立坚」，如果打官腔的话，就是水火相济、因缘和合，而成为器世间。</div><div class=\"text-indent\">湿为巨海，干为洲潬：这两者因缘和合，如果相互都是半斤对八两，它们和合不能形成大海或者高山，那你还是火性，我还是水性。那么它在对待的过程中，有时候是火性胜于水性；有时候是水性胜于火性；有时候是两者平衡，没有一定。如果这个火性胜于水性，那就是「干」。</div><div class=\"text-indent\">干为洲潬，「洲」是大块的国土，我们这里是五大洲中的亚洲；「潬」呢，就是海中间的一块陆地，比如台湾岛啊、海南岛啊，叫「潬」。这「干」是火性胜于水性；水性胜于火性叫「湿」，湿为大海——巨海、长江、小河，是不是也等于是「湿」啊？「湿」遍于天下。那么水火交互，在大地上是这样，在太虚空那就是星星月亮。这是讲我们看到的虚空万相的来历。</div><div class=\"text-indent\">以是义故，彼大海中火光常起，彼洲潬中，江河常注：以什么义故呢？就是水性和火性，是「性」它的交互作用，从这个角度来理解，即「以是义故」。</div><div class=\"text-indent\">彼大海中火光常起：讲到这个现相，有一则公案要提出来。佛在世的时候琉璃大王诛戮释氏家族，到最后还要去杀佛，但是被佛的庄严相所震撼，不敢动手，跪下来了。佛讲：「你七天之内，必为烈火烧死，下无间地狱」！他害怕了，就开了许多战船到海上，为什么？他认为水可以灭火啊！果然七日之内，大海内升起熊熊大火，葬身烈火地狱！他能逃得了？海中是不是起火啊？这是第一个。</div><div class=\"text-indent\">第二个，据历史记载，在江西九江的鄱阳湖上，有好几次大火熊熊而起。九江人应该都知道吧？都认为那是龙王在下面示现神通，这是个传说。</div><div class=\"text-indent\">第三个，比如在日常生活中，干柴干煤加一点水，火力强还是弱了？（强了）。那是不是水里就有火性啊？（是）。所以「大海火起」，因为它是水火交互而成，它仅仅是这个时候火性占上风，它火性（干性）有没有消失啊？没有啊！在特定的情况之下，水中起火，实际上是什么道理啊？这是我们的真心本来面目随缘显现，帮助我们开智慧！</div><div class=\"text-indent\">彼大海中，火光常起：有的人听了就不相信，怎么水里还会起火呢？因为水里起火百年不遇。有些人几十年的生命，他哪能遇得到？所以别人说了他不相信。这些人很古怪，凡是自己没有看到的，他一概都不相信。</div><div class=\"text-indent\">彼洲潬中，江河常注：这个我们都知道——文峰寺前面的大运河是不是「江河常注」啊？再往东去一百公里是不是长江啊？长江入口是不是就是大海呀？就在这里的地面往下挖，是不是就有水啊？人身看上去是固体，可百分之七十都是水分。这是不是也是「洲潬之中，江河常注」啊？万法都是这样。包括这个不锈钢茶杯，里面有没有水呀？都有呀！水火相济，形成这个固体物，是不是？它是不是也是火胜水弱，所以形成这个铁块啊？（众答是）。</div><div class=\"text-indent\">那么我们喝的自来水是属于水胜火劣而形成。它是不是同时也是火？冷水是不是火啊？冰块是不是火啊？往往冰块里头的火比热火还厉害，是不是啊？喝了以后它给你强刺激。</div><div class=\"text-indent\">水势劣火，结为高山。是故山石，击则成焰，融则成水：</div><div class=\"text-indent\">前面讲这个水火交互，它带有一种平和的对待。而这里就是水势劣火，它是一种激烈的对待。这就反映出同样的两种物体，它这个心态是不是不断变化的？（是）。有时比较平和，有时比较刚强……用世间法来讲，它还涉及到量变引起质变的问题。这里水火等于是有点带情绪的对待了。前面的水火交互带有一种平和的合作和交往。那么带有烈性的对待就不是普通的泥巴，火特别刚强的，就变成高山岩石，是不是很硬啊？我们在对待自然界的时候，是泥巴好对待还是这个石头好对待呢？（泥巴好对待）。</div><div class=\"text-indent\">所以教化众生呢，我们一般地专门去多度「泥巴」。有的刚强的众生真是比花岗岩还厉害呀！佛都度不了！就是这样。所以「水势劣火」即是水势劣于火，也就是火强盛，所以结为高山。一般脾气暴躁的人比较贡高我慢，恨不能比天还大！慢山，傲慢如山！你看那个走起路来昂首挺胸的人，我劝大家，你赶快躲开他，咱惹不起。这些人度不了的，他眼睛是长在头顶上的。但也有例外的，有些人专门低头探脑的，那种人也不好度。他那个心里鬼点子很多，他总是在算计人。这两种人，说是大家不要度，实际上是叫大家发心度，懂不懂啊？多用点智慧，他是不是也是我们自己呐？我们都有各种各样的习气。修行人呢，一定要学会逆来顺受，横来正对，就不会冒火星。做一个好的老师就要懂得欺软怕硬。你软，老子就欺你，你给我老老实实的，不然的话老子左右开弓。对于那些硬的人来讲，因为我想度你呀，好吧，你当爷，我就当孙子。诸佛菩萨可以示现各种相度化众生，但心里要有分寸，不然到时要互相伤害。好，这是讲「击则成焰」。</div><div class=\"text-indent\">融则成水，那矿石熔化了以后是不是岩浆啊？如果我们相互之间和气的话，是不是融成一体了？有情法跟无情法是不是相对应的？所以无情的法界是这样在生住异灭，有情的法界也是这样在生住异灭。</div><div class=\"text-indent\">土势劣水，抽为草木，是故林薮遇烧成土，因绞成水：</div><div class=\"text-indent\">这就涉及到树木花草怎么来的，土性跟水性交互作用、互相对立。对立呢，也互相地惹一惹，看看咱们谁厉害。它是带有这种心态来对待。如果土性占下风、水性占上风，那就「抽为草木」，也就是它会显现出树木华草之相。「是故林薮」，「林」就是树木，「薮」就是华草。「遇烧成土」，烧了以后是不是灰啊？是不是「土」啊？就证明它原来带有土性的这种成分。「因绞成水」，树木华草如果把它挤压绞起来，是不是有水呀？那么「成土」呢，如果用伦理学来讲，表它不忘父亲的那种恩德；「成水」呢，是表它不忘母亲的那种恩德。</div><div class=\"text-indent\">有些人讲：「明明这个树木华草是泥巴里长出来的嘛，明明我们周围那些生长的树木华草都是许多种子种下去的嘛」！那么我再问他：「那华草的种子是怎么来的」？所以我告诉大家，水性、土性交互作用成为树木华草，这是真理！至于怎么样变现，既可以从泥巴里长出来，也可以先变现出一个种子，再下到泥巴里去。我们的心可以随缘变现，树木华草当下是不是都是我们一个念呐？水是不是我们一个念呐？土是不是我们一个念呐？认真观照。</div><div class=\"text-indent\">交妄发生，递相为种：</div><div class=\"text-indent\">这里的「交妄发生」是总说。地水火风有各种各样的因缘相聚，都叫「交妄发生」。特别不要忘记了，在讲到「交妄发生」这个过程的时候，要提醒大家「我们的心」这种妙用！回顾一下佛在前面讲的「随众生心，应所知量」！树木华草、泥巴瓦块都是有情，仅仅是因为我们现在烦恼习气重，你没有办法跟泥巴瓦块沟通而已，各有各的同分妄见。正是因为有这种障碍，所以才交妄发生出十法界万法——树还有大中小；还有直弯曲、带刺、光滑；还有红黄黑白。其中任何一种因缘和合来发生以后，就会出现其它的一种现相。</div><div class=\"text-indent\">比如现在苹果树和梨树还可以互相嫁接。嫁接的那个果子既有苹果味，还有梨子味，叫「苹果梨」，你们吃过没有啊？这虽然是人工在搞嫁接，是不是也是我们的心在变？（是）。这个世界上无奇不有，无奇不有！去年在江阴，我第一次看到一个试管婴儿，过去是听说，那次是亲眼见了，跟我们正常人一模一样。</div><div class=\"text-indent\">这个「交妄发生」，不是局限于在自然界里，它有没有离开我们的念啊？（没有）。人是万物之灵，好事坏事都从这里引起。在六道中，在十法界中，这是一个最敏感的法界。它可以上管天，下管地。你看我们还在供佛、供菩萨、供天、供鬼、供神，是不是啊？而且还供那些畜生。鬼道众生、天上的人，如果我们念经、念佛功德回向给他们，他们也能得到福报，就这么不可思议！所以佛讲人身难得，没有讲天身难得，也没有讲鬼身难得，就是人身难得，我们要珍惜啊！</div><div class=\"text-indent\">有的人讲我们人生寿命这么短，而寿命这么短正是我们最大的福报！如果说有几万岁的寿命，那是定业啊！你修到猴年马月啊？在修行人来讲，一岁修行不为早，怎么不为早啊？谁知道他能不能活到两岁呀；八十岁修行不为老，怎么不为老啊？因为他知道没有几天了，没有几天了，他这个心力是不是特别大呀？你就不知他的力量有多大！谁都不能肯定明天眼睛能不能睁开。</div><div class=\"text-indent\">递相为种：前面「交妄发生」是讲因，这里「递相为种」是讲果，「递」是讲带有这个次序性。这种次序既有横向的次序，什么因缘和合而现出什么样的法相，当下现前，即因即果，我们现在造了什么因，果就已经形成，叫横向；又有纵向，前世因今世果，今世因是来世果，而形成十法界的万法，没有哪一法不是因缘和合而现。如果用佛法里两句话来讲，有其事必有其理，有其理必有其事。前面的「交妄发生」是其理，后面的「递相为种」是其事。修行人要把持住自己啊！命自我立，成佛、成菩萨、做人、做鬼就靠我们怎样起心动念，要好自为之。</div><div class=\"text-indent\">以是因缘，世界相续：这个「因缘」讲到根本，就是无明与空昧在交互作用。讲得细一点，就是地水火风万法相互之间的因缘和合。「交妄发生」就是这种因缘。虚空、山河大地、树木华草、天人鬼畜，这样一个世界相续，说尽了十法界的万法万相。这就是从根本上和全局上来开示宇宙人生真理。千古以来无量的伟人、圣人、英雄豪杰、帝王将相、各大宗派、流派、哲学家、思想家……所孜孜不倦探求的宇宙真理就是这个东西。但是他们谁也讲不清，只有过来人，也就是佛把这个道理合盘托出。这一百六十八个字，加上前面的序文和这里的后续，总地来讲，篇幅是不是太短太短了？有慧根的人从这段经文，你即能当下成就！</div><div>"
  }
]