[{
    "title": "吽迦陀野仪轨 第1251部",
    "author": "金刚智 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>吽迦陀野<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a> 卷上</p><p>金刚智</p><p>么迦多闻宝藏吽迦陀野神妙修<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>瑜伽念诵仪轨[阿-可+(俱/寸)][阿-可+梨]漫荼罗品第一</p><p>尔时多闻宝藏吽迦陀王。告一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>言。我守护<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧。为覆护<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>众生。又为南阎浮提五浊恶世若<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>僧<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>僧若在家优婆塞优婆夷等守护。有大陀罗尼法。并大缚一切恶偈咒。名曰根本普通真言如意宝珠真言大禁缚大秘密真言成万事真言大禁缚吽迦陀野相应忿怒偈咒。有善男子善女人。乃至畜生等。闻是真言等名字又我名字。归依此法。诵持真言密印法。生生世世不蒙一切灾难病患。不生诸恶国。不生堕十八<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>苦。不相无量怨敌。常值遇善友善知识。<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>佛道。得无量福德。<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>修得阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。是故多闻王。为一切众生说普礼法。彼印金刚合掌。彼普礼真言曰</p><p>唵迦陀(一)吽那迪(二合)尼(二)娑婆诃</p><p>次自身<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>印。左右手作内缚拳。左右风各一立左以右风本付右风着左风下本自上七遍许放登即净三业也。是明曰</p><p>唵曩谟三满多冒驮喃(二)唵(三)嚩多么驮多曩(四)伽溜[方*耳]野吽(五引)</p><p>即由是印明。诸三业不净悉皆除。得诸佛智惠海即禅波罗蜜意</p><p>次即结圣者吽迦陀野入<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>耶护身印。即是<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>波罗蜜具足。彼印二手合掌。二水并入掌中。叉二火未相柱。二风二火背相付钩形无去二地并立。二空入内并立。辟除结界并印五处。其五所者额右肩次左肩次心次喉。即印引顶上被散当心。即念此印大火聚相。即观罗字。真言曰</p><p>曩谟三满多冒驮南(一)唵(二)救娑兰(二合二一)唵(四)吠室罗么那野(五)唵(六)俱(七)[阿-可+梨](八)毗曳(二合)地梨(二合)智(九)吽支智卢(十)娑婆贺(引)</p><p>依此密印法。身口意业所有一切恶业重罪诽谤佛法僧大乘经典同一阐提罪。依此印明故悉除。又一切臭秽所。是依明法。所有不净悉灭除。得清净事业瑜伽。即念是吽迦陀野一面十手大密藏智大生印。若此印明一度结被。则生生世世无量生不堕。恶所。常值诸佛法僧。闻法得究竟果</p><p>次可结成万事相应心印。二手□。二大入内。二风作宝形。二空真并卧。风未付。即印五处。念于顶上吽之字。彼随心明曰</p><p>唵支智(一)卢(二)娑婆贺(引)</p><p>次念此真言印力。一切毗那夜迦等不祥。人不近来。即是一切如来大智印。是三法即此法三部三昧耶也。初自身净真言即法藏印。次火光印明。诸天密语藏。即当僧伽耶。次随心印语则此一切佛藏。然即<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>身得金刚身。念加持香水真言曰</p><p>吽尾讫梨跢(一)都那伽多僧尼吽(二合三)度缚飒飒(四)吽(五)吽发吒(半音)</p><p>取杵加持散舍水明曰</p><p>吽(一)吽(二)吽(三)吽(四)</p><p>次可诵大禁结请向坛坚缚不祥偈曰</p><p>唵缚日罗(二合一)揭罗陀那多[栗-木+((一/(即-ㄗ))*(一/艮))]耶夜(二)南无毗娑么尼(三)修罗尾普(四)么陀罗耶(五引)社罗(六同)么贺萨埵耶(七引)唬侣(入引)阿罗(入引)达么尼(八引)唵(九引入)么尼么尼(引)[口*悉]哆(引)入入入(入引)婆耶(十引)[攸-ㄆ+(米/心)]多罗(入十一引)么贺(十二)迦罗耶(十三引)[口*悉]陀(入)吽陀罗耶(十四入)</p><p>唵治瑟吒婆耶(十五)唵(十六引)拔悉多(引)唬陀耶(十七引入)曩谟(十八引)</p><p>其土其州其国其寺比丘比丘尼在家等。某甲至心劝请。三世十方一切诸佛菩萨诸明王。声闻缘觉诸贤圣众等。上居地居诸<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>护世四王十二天等。四方四角诸神王一切鬼王等诸夜叉大将众。不舍本誓。来入道场。证明知见诸修<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。是故我比丘比丘尼僧付等至心请向礼曩谟东方各领四悉多唬多耶。曩谟八大曼陀罗界会众。曩谟东方各领八万四千鬼神王。南方各领八万四千鬼神王。西方各领八万四千鬼神王。北方各领八万四千鬼神王。中央各领八万四千鬼神王。大神各领八万四千鬼神王众等。曩谟东方单陀利道断。南方单多梨道断。西方单埵梨道断。北方单荼里道断。中央单多里道断。大神单陀利道断。曩谟东方迦罗迦罗。南方迦罗迦罗。西方迦罗迦罗。北方迦罗迦罗。中央迦罗迦罗大神迦罗迦罗。曩谟东方那吒鬼神王。南方那吒鬼神王。西方那吒鬼神王。北方那吒鬼神王。中央那吒鬼神王。大神那吒鬼神王。十方各立四方亦复如是。曩谟护法圣众摩醯首罗。知足天二十八宿主护。毗<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>天王四大天王众天。三十三天。四分天。知足天。乐变化天。他化自在天。梵众天。梵善益天。大梵天。小光天。无量光天。极光天。小净天。遍净天。无量净天。自在天。无忧天。无烦天。无热天。福生天。广果天。善见天。善现天。色究竟天无边空处天。无边色处天。无所有处天。非想非非想处天。二十八天主护。毗沙门天王。三界覆护者坚牢地主。正了知大将。迦利底女五百眷属。金刚密迹。宝贤大将。僧真儞耶药叉大将。南无三十三天。禅那莫鬼。及紧那罗王。阿耨达龙王。沙竭罗王。阿修罗王。迦楼罗王。大辨天神。及大<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>天。如是上首。诸天神等释提桓因及日月天。阎摩罗王。<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>诸神。违驮天神。及毗纽天。大辨天神。及自在天。大神等大力勇猛大鬼神王。那罗延天等。诸鬼神等。散指为首。百千鬼神。摩尼拔陀大鬼神王。富那拔陀及金刚罗迦毗罗王。阿罗婆帝。宾头卢伽黄头天神。一一诸神。各有五百眷属鬼神。质多斯那阿修罗王。及乾闼婆那罗罗阇根那娑金色发神王。半祈鬼神。及半支罗主。雨大神。大饮食神。摩诃伽吒车钵罗婆有大威德婆那利神。昙摩跢罗摩竭娑罗针发鬼神。绣梨密多勒那翅者摩诃婆。及军陀遮鐱摩舍帝。复有大神奢罗密帝。醯摩拔陀。萨多踦梨。南无娜那多陀耶。曩谟日单捶拔游罗[口*悉]哆婆那。唵拔(长引)曩无金刚童子。一字顶龙王。梨车毗童子。及五亿八千眷属。其名曰师子光童子。师子惠童子。授法授童子。因陀罗童子。大光童子。大猛童子。佛护童子。法护童子。僧护童子。金刚护童子。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>护童子。虚空吼童子。宝藏童子。吉祥妙藏童子。南无十罗刹女等。一切使者大将等。至心坚缚天神。坚缚地神。坚缚四方四角神等。坚缚明神等。坚缚大神。坚缚小神。坚缚恶神。坚缚一切恶灵。坚缚一切怨敌恶人等。坚缚恶人决定调伏。坚缚坚缚。唵拔逝罗坚缚婆四保侣保卢娑耶娑婆诃(长引浪音出引)</p><p>印即金刚拳。各膝上置。嗔目四方见。若有诵持此偈咒。是人消灭百八<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>及六十二见。得无量福德自在。所以者何。此真言诸佛所称叹。从此真言中我心法。此大陀罗尼偈调伏诸恶事。若诵此偈时。可念诸大恶物毗那夜迦诸大恶鬼神王。众外道。天地四方魔鬼众。国内大小神等。皆悉禁缚。摄行者心内若一遍诵音频引嗔音降伏。音诵了即念吽字罗字欠字</p><p><a href=\"/remen/sajing.html\" class=\"keylink\" target=\"_blank\">洒净</a>真言曰</p><p>唵第誐增伽(二合引)野吽(一)索缚伽(引佉)</p><p>若欲此法修。先当可择求佛前塔前僧房若河边林下兰若。又心所爱乐无难所。是为上悉地。是所行修真言者。当可令出髑髅死骨瓦石等恶苦秽物。然后行者至净所。取<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>作坛曼陀罗等。而后修。真言法。若取土时。佛部以真言加持。然后取土作用坛。其坛扇底迦圆。补瑟微迦法四角。阿毗遮噜迦法八角。各八肘作。又作五三肘。加持作坛地真言曰</p><p>唵难驮难驮(一)娜智娜智难达婆里萨嚩贺(引)</p><p>若有<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>真言法。作坛时先诵此真言一百八遍。地加持。及一切虫蚁诸类皆移避他所。其得即清净。即用作坛处了。作大法八大曼陀罗。其名曰一因曼陀罗界。二法入曼陀罗界。三入相曼陀罗界。四入藏曼陀罗界。五妙藏曼陀罗界。六证入曼陀罗界。七圆法曼陀罗界。八相应曼陀罗界也。是名八大曼陀罗界。即是八大曼陀罗。一一其释名。因曼荼罗者。即种子曼陀罗也。法入曼陀罗。即大坛三种有炉坛。入相曼陀罗。即行者护摩时。心念其尊体相。并嗔目<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>位体。即观念曼陀罗也。入藏曼陀罗者。即吉祥天等其眷属部类位列相也。即吉祥天女王。并九人天女众云也。妙藏世界即[俱/十/(口*口)]曼陀罗也。是诸尊悉皆是界来集。定其本位列座。成就所修法。行者此界相明明了了人名阿阇梨。于此界不了了人不名阿阇梨。即此界成就世界。即此界名传法轮坛。证入界。即都钵等诸夜叉大将军座所也。圆法世界。即毗沙门王及二天[(女*丸)/木/心]怒相应八牙天等也。相应世界。即大日如来释迦四千不动尊观音<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨等也。是名八大曼陀罗。行者先可视八大世界。先其相<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>。又作如是曼陀罗了。次心观圆法世界。先中主毗沙门天身。着七宝金刚<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>钾胄。其左手捧塔。右执三叉戟。其脚下踏三夜叉鬼。中主名地天。又名<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>天。左右名使女。左名尼蓝婆女天。右名毗蓝婆神王。三鬼相面好相体。左右女天其相好令具。又座下五大子有。各将军体钾胄被。手各持弓箭并有。又五行道天女有。又被钾胄。面体女相满作。又手持镰刀。又其天有。又被甲胄。嗔面。手执刀镰。各皆座石坐。是名十人大将众。吉祥天<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>好相。诸衣服庄严无比。天女左手持青莲华。右手施手<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>相。顶五宝庄严相。目毗沙门王爱相。细姣面白少赤相莲叶居。九人女众。又好相世无比等吉祥天。各手持宝刀。又将鉾。又持镜。各三人持物也。各莲叶居。又八牙相者背立。面色赤。衣色黑。目各面三。若半三目。若半二目。牙上方指自下方长白牙袖胁下牙各臆当指。一处手下方合掌。一所手上方合掌。下方合掌持独[月*古]。上方合掌持金刚[轮/金]。圆座上居。头天王方胄相。女发登返垂相也。各面甚可怖畏相。见人可[门@迷]惑。九人长众皆长牙。各甲胄被。面相怖畏也。各莲叶居。上方牙短。下方牙长。从座过。各手弓箭持。多闻主中央。吉祥王北方。八牙王南方。各使天众东方。即主王天等座下西方。东北角大自在天。次帝释天。次火天。即老[示*毛]夫相。身相赤。次并自在天。阎魔天。次罗剥天。次水天。次并梵天。次地天。次并风天。日天。次月天。次魔诃迦罗天王。合十二天。皆石座居。被甲胄。手各持独钴刀。但除火天王手持水瓶次手持竹杖身火绕相。是即名入藏曼陀罗。并圆法曼陀罗。行者是世界佛位明了视智。乃至作造曼陀罗如是</p><p>先毗沙门王身印。先二手合掌。风水二指指掌中入。地火空指各立并。五所天上四方结界。即念是依印加持故一切障难者毗那夜迦等恶鬼神悉皆走却。不能害行者人。一切所求成就。即成多闻智惠身体。彼明妃曰</p><p>曩漠三曼多冒驮南(一)唵(二)摩[口*车]都娑缚诃</p><p>次吉祥天女印。各手内缚。各风指立延。各方于乳上念即一切愿成就。乳海悉我行者从身<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>中流出。一切众生施与。若为病即成善药。若为所望即成能便。若为饥馑即成饮食。若为贫穷人则成宝衣食。若为无女无夫无使人者皆如是成一一利益。即此乳海如是有相可观彼真言曰</p><p>唵(一)么贺室唎(二)提婆毗(三)娑婆贺(引)</p><p>次九人使者天女印。各手内缚。各风火延竖应调。左右三返舞喜悦相。即念我一切众生与安乐。是使者悉皆我为使人。即真言曰</p><p>唵(一)摩诃缚曰罗(二二)提婆毗(二)娑婆诃</p><p>次八牙天印。二手内缚。各风延各口从下于膝上三度引垂。即念长牙相一切相应魔降伏相。即明曰</p><p>唵[俱/寸]梨曳多罗吽娑婆诃</p><p>次九人大将等印。各作拳当心上。嗔目见尊像观曼荼罗。又是九人皆此我行人童子。念彼真言曰</p><p>唵多贺陀迦缚曰罗(二合)地儞(二合)曳娑婆诃次</p><p>十二大天总印。二手合掌。二火牙卧。五处印。即真言曰</p><p>曼漠三满多冒驮南(一)唵(二)伊阇陀罗野(三)阿誐阎(四)地利智曳(五)缚噜多野婆吠(六)婆毗利智(七)阿儞(二合)野敬多罗野(八)唵摩贺(引)迦罗曳九娑婆诃(十)</p><p>观想应曼荼罗界。即行者住清净法界中。念大日如来。即顶五宝冠被。种种璎珞庄严。面相圆满好相。作定印。大莲华王座</p><p>次南方弥勒菩萨。手持独钴并三钴。宝冠璎珞庄严。好相具足。妙莲华座</p><p>次南方四手不动尊。色绀发垂。水波甚可怖畏相。正手右持炼[轮/金]左持索。次左手持莲华。次右手持宝珠。须弥座。火光绕身。三十二相具足。忿怒相无比次北方释迦牟尼佛。顶乌瑟相。法衣绕身。<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>印相。新现三十二相八十种好相具足。妙莲花王座</p><p>次又北方<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>。宝冠庄严宝璎珞现前。左手持莲华。右手持如意宝珠。青莲华座。乃至造作又如是。先大日如来智印。次真言。是相应界总印。金刚金合掌顶上被衣各方散。念一切如来被甲胄真言印。彼明曰唵缚曰罗(二二)哆贺吽多罗多(二)娑婆诃(引)次观证入曼[泳-永+荼]罗世界。中央主都钵主多闻天王。弥王上居。山下三夜叉鬼女有。大天王腰大长大刀着。东方牛头有。正面可甚怖畏。顶上十一面怖畏形。各牛角出为出其庄严。又正面左右各一面有。其又畏相。衣服帝释天相也。莲叶居。左手执长大牟。右手持大刀。牛头方左金刚藏王神。天金床蹲踞。甲被。持国天衣服相。合掌。首之发天上登燃火。左方大鉾地立。座下左方授福鬼神王。大鬼形裸形首发燃火。以左手自头发取引。以右手大捧肩荷。藏王神为恭敬。牛头右方天神王主。宝冠璎珞天衣具足。并其形好相等观世音菩萨。四叶莲花居。即大日如来相应天相也。手印合掌。其居座下右方与官神王。其形体如授福神王天。但右手取发。左手持捧肩荷。南方中主右有三人。一迷迟天。甲胄相有。左手持铃。右手持铃。右手持五钴。次返赴须天。左手取铃。右手取独钴。次旁迟天。左右手用三钴。次中主左边即北方一费礼天。右手刀。左手金[轮/金]。次毛都王。右棒左刀。次费解王。左长鉾。右少鉾。已上六天皆石座立。次中主上行事女。金床上居。如吉祥女。左手箱。右手宝珠。其女右第一良侍天。左手鉾右[金*斧]。次赴须王神。左右持独钴。左方一达尼汉天。左右作拳。各牙当臆意左方鉾立。次侍相天。右刃左鉾。次四方东北角一渴都天王。左弓右二箭。次相光天。合掌左方鉾立。次魔王天。左鉾右刀未地付。次俱魔罗王。左刀右棒。左方鉾立。次德达天王。左弓右箭。左鉾立。次宅神摄天。左手持弓横当意。右手持用箭。乃至造作如是。即证入世界。始自良侍王至于宅神构天王。皆悉在右座蹲踞。皆甲胄被。面目不可见人众怖畏相。即大将军神王。此界证入世界总印。二手合掌。二地指开立。即印五处。念大意是大将众得加持守护。彼明曰</p><p>曩汉三满菩多南(一)唵(二)多佉曳(二)娑婆诃</p><p>次观法入曼陀罗尊体瑜伽像。即一面十手大王身。即由此身则多闻天王咒究意身则同等大日<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>诸尊。先其体样。色赤衣绀。<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>青。目白。牙上下方三寸指。正手印。彼根本护身之印。左方第二手捧宝塔。次手持钴杵铃。次手持金[轮/金]。次手持箭与索。右第二手持宝镰。次手持大刀。次手持弓。次独钴与鉾。须弥上居。山下有鬼形。左方膝立。右方膝卧。四方护世四天王立为恭敬。但北方最胜太子有。正面端正好相具足。左右面畏相。右方面赤。左方面黑。顶上赤色。面喉咥细长。发燃状有。正手合掌。左第二右第二手取大刀。次左右第三手取三钴。次左右第四手持鉾。左右手中门大龙王太子与等镰金刚轮当口尾长于至太子足半垂。此太子如是居石上立。次吽迦王下十二神将有。其形甚怖畏。被甲胄。各持刀杖。若彼第一俱毗罗大将居若十二大将。于置次金刚密迹正了知大将有。其形力士裸形甚可怖畏相。正了知诸璎珞庄严持器杖。次下十罗刹女等有。形甚怖畏。被甲胄。各持刀杖。形体端正甚姣诸相具。各手持刀杖。如是造作曼陀罗。以是智行者一一是相观念。今例连其位。先三重作坛。第一第二院各又有三隔。西方第三院横长细。作五尊先中大日如来。北方释迦牟尼如来。观世音菩萨。南方弥勒菩萨。四臂不动尊。中央中院中主毗沙门天王。下方十大将。北方大吉祥天菩萨。下九人天女。南方八牙天王。并下九人长牙大将众。西方十二天。又隔外北方中主都钵王。东方牛头王。缚曰罗(二合)王。并授福神天主王天并与官神。南方良多罗王。毗菩多罗天伊俱罗王返罗天。米得王。北方达尼汉天。侍多罗天。礼王天。毛多婆罗王天。神足伽罗天王。中主上得自在军将天女。西方东北角缚佉罗陀天。相光天。魔王。多罗主。俱魔迦罗天王。德达自在王。天宅主军自在多罗[跳-兆+(田/(歹*寸))]王。东方中院即妙藏曼陀罗界来入坛。四角乍坛隔三重中台大金刚宝[轮/金]。四方十字羯磨。第二院西方军持瓶。南方一大三钴。北方大法螺东塔形。第三院东方师子王。南方大龙王。西方孔雀鸟王。北方罗刹形。四角宝香水瓶自中出莲花形。是名妙藏世界中大轮。名大日如来四方十字王名四大尊。第二院南方三钴三天身名。西方军持名一面十手王。北方大法螺名传法轮之相。行者住此三昧。请召诸尊。并奉供阏伽等。即是结螺印。念我真言行者吹是螺愿诸尊传大法轮。东方宝塔即大法藏也。第三院东方师子王即证入等诸大将众。南方龙一面十臂王一切龙王摄持随从相。西方鸟王法成就速相。北方罗刹王即多闻天降伏一切不祥恶事相也。行者能智是曼陀罗相像。行此世界。即又作随心曼陀良大密教并灌顶。行者住此世界。即又作随心曼陀良。又作心内曼陀罗。次第东方隔外北方院圆坛四方出莲花王四方出三钴杵前杵莲花形居中底于十字是即名扇底迦法入世界。次南外院三角作坛三之面角出独钴二方出莲花中于十字独钴。是名阿毗遮卢迦法入曼陀罗。是即八大曼荼灌样。观念造作又如是行者明智行者智是曼陀罗中妙藏世界所由<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>诸尊悉来。是坛成就法即是瑜伽道场也。行者得观智此世界相世即成就诸法诸大愿圣者印。左右地又伏水各掌内入左右以空各方水未着付。左右火指如柱姣未合本叉相直竖。左右风向天坛方未姣合竖印五处。彼大真言玉曰</p><p>曩莫三满多菩驮南(一)唵缚日罗(二合)萨罗曩(二) 誐多[尸@地](二合)吽增[(上/夭)*(企-止+米)]罗三限吽(二合)索婆诃</p><p>依是真言印加持故。真言行者身同等萨埵等身。更勿所疑。诸佛不延是功德。若为病成药。若一切随所有物如意宝珠。又成就一切法故。如意宝珠明曰</p><p>曩谟三满多菩多喃(一)么贺(引)阿罗(引)阇野(二)唵皿[方*耳](三)苏母多罗(三)旃荼缚萨罗(二合)羯罗枳哩矩噜主鲁沙眤(四)达摩(二合)驮都娑婆诃</p><p>印。各作金刚拳。各火指牙入掌中各膝上(引)于置。即如意宝珠想。若持此法人。于诸众生发慈悲念。无生嗔诳谄害之心。若起嗔即失大神验。常护心勿嗔恚。又持此法咒人。于每日中。忆我多闻圣者及眷属赞叹。恒以十善共相助。我证菩提。由念彼天众。知是事已。皆大欢喜。共来护持。此咒人又持真言者。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长远经无量岁。永离三涂。常无灾厄又令得如意宝珠及以伏藏。<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>自在。所愿皆成就。若求官荣无不称意。又解一切禽兽之语。是真言功德。得略如是。行者若欲作法。先当作曼荼罗地。先直心合掌。三昧心入三昧地无余念。思是地样。先有空轮。色杂形圆即缺字庄严为种子。次念风轮。色黑形半月样。感吽(二合)字为其种子。次思火轮。形三角色赤。罗阿(二合)字为种子。次念有水轮。即鑁字。色白形圆。次念地轮。其形体方。黄色。即以阿字为其大种子。即当意口论彼观三摩地明。即真言曰</p><p>曩谟三满多菩驮南(一)唵(二)欠[冰-水+感]蓝鑁阿娑婆诃(引)</p><p>次观此八大曼荼罗地。如是即是金刚不破世界。诸尊<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>世界。清净法界也。即大天王从此北方有城。名曰阿尼曼陀。其城七宝极不破世界诸尊常住世界妙世界无比。是大天住此界。见且结印诵真言者。不舍三昧耶。必来此曼荼罗。一切众生大愿成就。即诵请迦陀野偈。即颂曰</p><p>敬礼诸佛敬礼天等唯愿大王此方下向下向力故护持坛等所愿满足</p><p>又结净堂内印左右地水并各方掌内入。又各方当空指以各方地水三中间着左右火左火本着。左右火末右。又如是左右风作宝形堂内次净又印五处即成。依是真言印。所欲堂内皆悉净。诸无恶虫等之难。真言曰</p><p>曩谟三满多菩持喃(二)阿跛利多野(二合引)誐誐曩三摩三摩抳野吽(三)发吒</p><p>次宝庄严堂内印。左右手以头上于置随增波诃来去。真言曰</p><p>唵(一)三么耶(二)吽(三引)</p><p>次结治路印左右手内缚地水二指叉卧。二火头合立直。二风左右直伏。右火末左以空着。左火末右以空着。先印五所。次坛中放于。真言曰</p><p>曩谟三满多冒驮喃(一)阿(二合)誐尼野度嚧吽发吒</p><p>次结四大天王结界印二手小指屈入掌中。右押左竖。二中指无名指相离一寸二头指柱。二大指并屈入掌。真言曰</p><p>唵婆帝也畔驮含吽(一)[方*耳]菩溥娑婆贺(引)</p><p>依此结印。一切诸恶悉散远。此印上下各三返。次结四天王印。先以右手叉腰其举风指。以左手小指押其母指[金*余]三指立安脐上。其持咒应以恶意而现嗔相。真言曰</p><p>唵嚧迦婆唎泥(一)社野社野社耶(二)吽索婆贺(引)</p><p>用此印真言。请四天王。即远来最胜拥护</p><p>次结摩诃室利提婆毗瑜伽成办所修法之印。二手合掌。二大母指并立风指侧去一寸许。微曲二小指头相押。屈水火各头相去如钩形即成。七宝迦摩罗真言曰</p><p>唵毗摩罗(一)[萨/木]娑罗伐底(二)三婆罗吽(三)</p><p>次可结使者天女等印。屈右手掩左手上肘后引颈向微曲其身引地。诵此真言。即明曰</p><p>唵阿竭竭儞(一)但地啰(二)满遮吒诃悉作(三)吽发吒作吽</p><p>作此印。即请金刚使者提婆毗等。皆悉欢喜。速咒师所。至即任意。一切所作法悉得成就</p><p>次结请三昧耶印。先合掌十指内相叉。二水竖头相柱。二风竖微屈左空入右掌中押左火甲。右空越左空背入左掌中押火甲。二风随诃音相招。真心持此印法。即请召界会印。真言曰</p><p>曩谟三满多冒驮喃(一)唵(二)唵(三)吠室啰么那野(四)曳醯呬(五)索博贺(引)</p><p>依此印及诵真言七遍。天王眷属降临坛场。天王即慈悲就座。受小<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>所请向从侣等各就本座位。受我供养。即[跍*月]跪手取香炉对天王前。至心奉请诸眷属夜叉罗刹。及大日释迦等诸佛菩萨金刚力士降临道场。为我证明。北方毗沙门天王道场。得成就法。身神通力。得大自在。所愿随意</p><p>次饮食印。左右手内缚。各地指竖末各相立。左右内缚开去五寸一寸三寸。奉供真言曰</p><p>曩谟三满多缚日罗(二合)赦吽尾讫梨[(田*田)/((止/天)*奓)]度佉多[合*牛](引)</p><p>次结上味印。左右手内缚左右风直坚中节边叉各末水牛如角。奉真言曰</p><p>南无尾秫多佉(二合引)野[山/兔]醯缚野(一)吽发吒(引)索缚佉(引)</p><p>次<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>王印。左右水火二指并作宝形。其二空各方二指中间舍柱如二姣竖。二二四地风各开去如柱竖直姣立。百遍许随意令转回。真言曰</p><p>唵多毗(引)智野吽(一)那索佉野尾秫第(三)吽誐 誐曩(四)三么三么(五)吽(六)吽(七)发吒娑缚贺(引)</p><p>次大法全转印左右地风开去如牛角。左右空水火掌中屈入。左手上向右向上。左右地风末(一)所合相。右火末左地风着。左火末右地末着。奉回明曰</p><p>南谟难机[跳-兆+(田/太)]佉那野(一)吽发吒索溥诃</p><p>次可结大密十二都合印。二手内缚顶上四方上下引之。真言曰</p><p>唵[跳-兆+俱]梨含吽(二合引)</p><p>次示现住自在八曼陀罗印。二手合掌。二二四风水外卧牙。即大宝一切成满无所不至印也。明曰</p><p>唵嚩曰罗(二合)钵那么三昧耶(一)萨怛鑁(二合)吽</p><p>次现三种身。赞曰</p><p>唵嚩曰啰(二合)曩(引)娑野泥伊(二合引)嚩(一)婆娑罗(二合)满耶太那野(引)南无卒都帝(引入)摩迦(引)么娑野(引)伊多都耶佉野(二合引入)曩迷(引)索伽多野(引入)娑冒跢尼焱(引)野[其*皮][浪/寸]多(上引)满多曩(音引)娑焱野[茶-木+(兔-(色-巴)+(乏-之))]智(引)佉多(引)瞿尼野(引)曩漠卒都帝(引入)唵(一去)嚩曰罗(二合)入(目返)婆罗(二合引)嚩曰罗阿(引上)嚩娑罗(引)佉多(铃鸣如引)尼(入)婆(入)萨(上)[(阿-可+良)/寸](引)佉[少/兔]佉野(二合引)[最/寸]多野苏[(上/夭)*(企-止+米)]罗(引)阿野满哆婆喃(引)索多(去引)</p><p>曩多(去)曩谟誐野(引)曩谟卒都帝(引)</p><p>已说八大曼荼罗行相了是八大漫荼罗有部母。即分三身。所谓大日佛部。观音莲华部。不动尊金刚部。毗沙门王即佛部。八牙同部。吉祥证入等莲花部。一面十臂金刚部。如是分别摄。即佛部母真言曰</p><p>([咒-几+(俱/木)][咒-几+(阿-可+具)]一)圆[阿-可+梨](二)</p><p>即八大漫荼罗相[阿-可+利]字法入即息灾样。次莲花部母真言曰</p><p>[合-口+((阿-可+具)/寸)](一)[合-口+(俐/木)](二)</p><p>即敬爱增益相。金刚部母真言曰</p><p>[合-口+((阿-可+俱)/(木*歹*木))](一)[合-口+(俐/木)]([林/ㄙ][目/(目*目)]二)</p><p>即阿毗遮卢迦火坛漫荼罗相也。彼[阿-可+(俱/寸)]字上在五口点。即是五如来相。父中于[哎-乂+(林/木)]字。即多闻王相。梨字上于置[圆/寸]字。即此漂息灾相。又莲花部母有[阿-可+(目/寸)]字上无点。即莲花相。梨字有一花点。即敬爱等相。即漂色。金刚部有[阿-可+(俱/木)]之宇上三角点。即金刚之相也。[阿-可+梨]字上有又一三角点。即此阿毗遮迦漂相。彼佛部真言。其声引样[阿-可+(俱/寸)]字上音引诵梨字上声引诵得意上音。莲花部[侍-士+俱]字彼音梨字波浪音频引浪。金刚部[侍-士+俱]字音恶洒声[打-丁+梨]字又如上。是即三部母真言音样也。即此八大法诸尊皆此流出此三部。佛部真言[阿-可+(俱/寸)][阿-可+梨]二字自中即[俱/寸]字即八大曼荼罗相。并供养<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>也。彼[阿-可+(俱/寸)]字加五口点乃至林字。又此八大世界漂相有大树林。即生诸好叶。次生花次生菓次菓熟。生甘林即生诸味。利益有情。然即多闻王如彼大林。又[侍-士+俱]字如同彼大树林是[侍-士+俱]一字。即行者欲修真言心王时即生大树林。次于置心王中其[阿-可+(俱/寸)]一字。即念则生好青五色叶。次修真言者住心王阿娑颇那伽三昧无动念八大道场时。即生好相具足希有花。次行人修真言供养诸尊及大王时。又生菓之实。又次行者至心其意八大漫荼罗运。通达诵真言王。欲所修法成就无他念。思彼尊相体。自心王城现住时。即所生菓实生就。而后行者发广大无比大慈三昧。一切众生利益。所生功德回施法界众生。其罪苦烦恼障断除。念三时即成甘味。施随法界众生。一一其所生所罪。至一一利益安乐。即此[阿-可+(俱/寸)]字诵。本尊天王行人前现形。其人语云。我从随。行人心无所疑念。即毗沙门天王体相种子相也。彼五口点。即佛法僧护持相也。是即天王本三昧耶。其心坚固从中出是五佛。又彼五佛即利益众生。故显天王坚固心中。而行人如是[阿-可+(俱/寸)]字相了知。如法观智成就。此大心王法。是二字即种子曼陀罗云。即行者观能此法[侍-土+(阿-可+具)]字梨字。即此成就种子曼陀罗了。又莲华金刚各加大点。即得意字心如同俱彼点等漂莲华金刚相也。[阿-可+梨]字即如大山。诸大小河江海出此。[阿-可+梨]之法入漫陀罗大事相部母种子。[阿-可+梨]字即大吉祥女体相也。即念[阿-可+梨]字。天女王现立承事法之师。即是[阿-可+梨]字中出。又一法即是护摩法也。一向[阿-可+梨]字供养相应法也。即是二字合为曼陀罗部母真言。即从是二字中出是大密法。即行者口唱[俱/寸][阿-可+梨](二合)一遍。即得如是本誓。一一成就圆满事。故名曼陀罗母真言。若欲供养是曼荼罗。先设供养具始誓行者先至心善闻持未来有情可传授。先欲修法时。先可备供养相应物。于净室中瞿摩夷涂地。作大坛相应坛场。并又用金木土叶螺等器。随时饮食时菓子时花香油灯苏煎饼乳粥等。酪苏蜜[饥-几+(钓-金)]捻头子团。种种甘味团。粥采种种物团。时草采时美并小头等。饼饭诸甘菓。种种和合作药。种种香味欢喜丸。如法清净至心供养。常烧妙香诸名香。所谓安息旃檀龙脑苏合多揭罗薰陆松香等也。皆等也。皆等分和合。一所香炉等可烧。即又以真言等。白线又五色线加持之可身系。是糸诸事业必成就。先又敬礼<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。及多闻伽陀野王所行法。其中间念。此依功德力能施令诸众生一切所愿成就。如是念礼了作法。香烟令不绝。诵前母咒等。昼夜系念。勿令他解。尔时多闻王有子。名禅腻师现童子。来至其所问言。何故唤我父。即报言。我为三宝供养供养为一切愿故请也。时其童子闻了。即还本宫白父言。今有善人发诚心三宝供养。满一切所愿诸念事请。其父报子言。汝速可至彼所言。汝曰曰与一百迦利沙波拏。若满十陈那罗。其持咒者见是相已。知可得成就。当独处净室。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>三宝供养行法。念一切贫者令得宝物。于诸有情起慈悲念。勿生嗔恚诳谄害之心。若起少嗔心即失大神验。常护心勿嗔恚。若持此咒法人。于每日中忆我及男女眷属赞叹。恒以十善相助。彼诸天等福力增光明。普令证无上菩提。而彼天等见是事已。皆大欢喜。共来拥护。持咒者又寿命长远。经无量岁。永离三涂苦。无灾难死。又令得如意宝珠及以伏藏。神通自在。所愿皆成。若求官荣无不成。亦解一切禽兽之语。已说[阿-可+(俱/寸)]曼荼罗供养法竟</p><p>次又可说[仁-二+梨]曼陀罗法印</p><p>吽迦陀野摩诃主布解梵字品第二</p><p>示现三动恶魔三天身梵字根本真言曰</p><p>唵毗地瑟陀[口/可][口*悉]者沙[口/可]</p><p>延命梵本真言曰</p><p>唵梵毗地瑟秫陀娑[口/可]</p><p>悲生梵本真言曰</p><p>唵梵毗地瑟地[口/可][口*悉]地[口/可][口*悉]沙[口/可]</p><p>尔时大日薄伽梵言。未来世众生早欲成就悉地。先从阿阇梨以应受梵字。虽行余法不知此法悉地难成就。所以者何。是三世诸佛肝心也。是释迦牟尼如来二瞳。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之命。多闻王福德藏。一切众生依报。若有众生。不知三世诸佛肝心而何得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。若有众生闭释迦之瞳。何可被释迦护。若有众生。杀一切圣人之命。灭福德藏。闭诸尊瞳。当何得出地狱。若何得福德何得智惠之因。早欲成就<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>出世间愿者。当受持梵本真言梵字。是三世佛肝心故。令受持一切众生。是三种梵本真言。三合二十八字。行者当得梵本意。偈曰</p><p>诸众生身兴一<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。是故诸佛以此大愿说法时。为根本种子</p><p>延命偈曰</p><p>三世诸佛以不杀戒是故是教有智行者来世众生可传是戒</p><p>悲生偈曰</p><p>一切诸佛诸众生等与忍施法当此教人可行是心</p><p>是偈等。彼梵本真言心中心。乃至三聚净意又如是。此故行者以此偈心为观智根本。此偈功尽劫不能说。是偈是横竖无限。意任行者心又吉。观世音菩萨言。汝顺众生机为可说法。若有来世众生。修多闻迦野王之法者。即为延佛法寿命。若不持者为断佛法僧宝之寿命。若欲受持人。每日清旦。合掌一心诵母明千遍。即灭无始<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>以来无量重罪。生生世世常遇诸佛之世。灭罪业故。若可堕<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>依此功德不堕六道。化他故变化六道。受持一遍其功德尚多。何况晓夜三时一心精进。若行是法者。先当根本大咒十万遍诵。先多闻迦陀野根本大陀罗尼曰</p><p>曩谟三满多菩驮南(一)阿他佉噜菩怛罗耶(三)毗舍那药叉吠赊罗跋那阇耶(四)么迦瞿罗阇耶(五)夜叉地婆哩婆么哩耶(六)萨都哩耶婆赊耶(七)钵啰婆诃娜耶(八)喜摩泮钵啰娑耶(九)唵(十)多娑抳始晒毗娑罗么娜耶(十一)么贺(引)曷啰阇耶(十二)佉唎羯伽哆啰耶(十三)唵[口*车]都耶(十四)唵摩[口*车]都(十五)娑嚩贺(引)</p><p>晓夜三时之中。每时诵一千遍。若二十一遍。而母[女*忿]怒真言等念诵。当行者已灌顶阿阇梨所受法印。即受灌顶位。又欲受法。先勤修精进见好相。亦可试神验。若无好相。亦更忏悔得好相。又得神验竟。然后受法。若不灌顶。受法无功德。若随阿阇梨得受法。即受灌顶位即若不得印信。不得灌顶位。此相等不具足。不得传授。若不受得灌顶位。不名阿阇梨。以但心意为本曼陀罗。若此尽果阶业心意不相似。真言行人<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>行事。即此灭大神验。是难密印真言现世悉皆灭尽。而行者得此等之意受法传授。若有受法<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>出来。择其意行者心相威仪。若欲成就世出世悉地。随愿应作方圆等坛。种种设供具作法。三日五日七日九日十四日二十一日三十日九十日百日可为一期。秽处勿行。闲静之处如法念诵。勿以攀缘。若发攀缘。从境观行。息灾本尊曼陀罗向南西。行者为东北面。降伏向尊东北。行人向南西。又蹲踞。若为结跏趺座。敬爱等诸行法。如息灾作。若欲修法。先当作金刚[木*阙]。即形如独钴杵。本如鉾末。杵形即以大界加持金刚[木*阙]真言等加持。其作橛金刚木等真言。行者至<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>作法印。又说摩诃多闻王心中大极密语。行者当可此偈句持。即偈曰</p><p>假使有日月从空堕于地</p><p>或大地倾覆设有如是事</p><p>持明此必成不应少生疑</p><p>除恚心行人此法易成就</p><p>不假于持戒利益贫穷人</p><p>一切人恭敬乃至寿命尽</p><p>加陀王加持远离诸厄难</p><p>药叉将护持当随受持者</p><p>若能持是法诸法悉成就</p><p>迅疾如箭射诸王恭敬是</p><p>所求皆成办必得无尽宝</p><p>千俱胝夜叉守护持明者</p><p>能满诸大愿<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>诸恶趣</p><p>即梵本真言明曰</p><p>曩谟三满多(一)缚曰罗(二合)赦唵(三)阿婆罗耶(四)婆哆般舍儞耶(五)陀娑[口/可](六)唵跋折罗(二合)婆儞多毗使者(七)娑缚迦(引)</p><p>行者当可渴身支分。先作宝印。二手合掌于顶上诸支分令遍。彼初二十八字诵。即彼二十八字真言。则此我身璎珞。次当结天王梵本密语被甲印。即作金刚合掌。心上于置。念即此行人为身甲胄相也。彼偈意悉解知。用此梵本明。若欲无生忍者。观七真言梵字光明。自闭目念。有一金轮绕匝而现七种光明。一青如青琉璃。二黄如沙金。三赤如火挍块。四白如银。五红如颇梨。六青黄共合如玛瑙。七青白和合如车渠。如是光明从自口出入本尊口。即亦出入自顶中。如此相续。一切众生身悉入出。即闭目口诵三部母真言七真言。一[侍-士+俱]字。二[仁-二+梨]字。三二十八字真言。四天王梵本明妃。五大禁缚偈明。六如意宝珠明。七供养会真言等。云七种光明真言。行者得此意即明了观智。已说梵字相了</p><p>次说护摩扇底迦法。[廿/补]瑟征迦法。阿毗遮卢法相应事。当行者至心闻是大密相应大法。闻即信受</p><p>吽迦陀野一面十臂摩诃神王[阿-可+梨]护摩品第三</p><p>修真言行者。当至心如法清净奉持。不生一切非法恶意行事。若有一切众生。欲修护摩法。先当结镇护自身印法则印。左右地水火内缚。风立末合作宝形。二空并卧付掌当口。念即是一切世间诸圣众一一护身印明。我悉皆被。即印五所。明曰</p><p>曩谟三满多缚日罗(二合)赦(一)钵荼罗吠(二)药娑多(三)娑嚩贺(引)</p><p>若入道场欲护摩时。先行道。先先行人可持一刀镰。彼道场作法印。右手取刀。左手挓腰。横行步。彼时于嗔目令有嗔声引。即彼明彼母部二字真言。当三种修法。或用右手作刀印念大刀。即明曰</p><p>[阿-可+(俱/寸)][阿-可+梨]</p><p>次天王一脚三眼印。左右作刀印。若用大刀。若小刀末引从心上牙左右替之。先作本座之大鬼神形。若未若尽其鬼形入堂道间居置。作咒印法。生忿怒想。彼鬼形踏过踰。即取置草座下。若座具等下。自者居其上。行法即就座。当刀臆上。诵根本咒三七遍。次结界阿阇梨身印。以左右手作拳。地卧二水叉伏。印五处。真言曰</p><p>唵誐誐嚩[糸*感]吽(二合引入)</p><p>次大坛法印左右手作拳。二大指叉卧。坛中令遍。明曰</p><p>唵誐[跳-兆+也](二合一)[跳-兆+也]野[糸*感]吽(引入)</p><p>次大坛结印。左右手作拳。风指叉伏。坛上放。明妃曰</p><p>唵誐野(一)弟娑吽(二)索缚贺(引)</p><p>次四方上方下方结印。左右手作拳。空指一所合。明曰</p><p>唵弟誐(二合引)陀(一)吽(二)增婆[口/可]</p><p>次大智大印。左右以手合十指去立打火天王之打不祥魔恶事观知真言王曰</p><p>唵嚩多寸[(序-予+(林/路))/糸](一)陀[加/跛](二)吽(三)</p><p>一切诸大恶魔等令降伏印。法右手作大拳当意。念尔所由。真[言*伯]</p><p>唵恶惹(二合)佉吽</p><p>恶事恶相悉皆断烧印。左右手姣立并合当心于大上。咒曰</p><p>唵誐贺尼吽发吒(引)</p><p>次作结法印。左右水火内方卧。左右地指未调合姣竖。左右风如柱立去。左右母指并放。安坛中。真言[諻-王+去]</p><p>曩谟参漫多嚩娑啰(二合)难(一)诠陀娜[糸*感]吽(二合引)</p><p>尔时多闻王利益众生。犹无力诸大恶魔神等不能降伏。即入阿娑波那伽三昧。作是念云。我更无力大恶魔降伏。即得一切如来同力三昧智。降伏王体相其成体王。即得一切如来金刚身无碍智一切智聚无量福德藏紧固法界王三昧。即此以<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>智为庄严三昧也智惠火绕身。般若智力镰成手持相。以般若为璎珞。以<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>镜为眼。以伏藏为座。右大恶魔鬼王为座持者。以慈悲为体身。以忿怒为面相。以降伏想为手。以智慧火为发相。用利益有情心为眉。三水波相以一切众生其灾患烧尽恶障除。无量恶魔鬼神等降伏。从随事为其下方指三寸牙相。何故牙白有三寸之相。经三世一切众生其过恶<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>灾难怖畏生死<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。若观是生界与无量净身三昧相也。一切恶人于佛法僧生恶事。亦放逸<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>童男童女悉降伏。又不持戒比丘比丘尼等皆降伏。诸不信者伏悉令归依三宝故。如是以心为两足。袈裟色青是何相。一切众生若干大愿满足相。即檀波罗密相。初青物后必成黄。依此念。又地轮之相漂识。衣色黑绀。一切众生诸恶障碍不祥悉除相。衣风轮王漂相。身色皆赤。一切有情令得明镜开惠眼。并又一切众生为照诸闇事故。皆如是相为色相。又大天王心以师子迅疾力诸佛同心三昧也。金刚心为大王意。一切众生<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>事业皆闻知。是念即以为耳相。又诸佛如来一切智慧般若智火。悉皆以为其大火光相。以般若智心为宝塔。以般若道理为金刚[轮/金]相。以诸甘味药为素。以诸灭不净成净所是心为箭相。以般若威光为弓相。以般若妙说肝心为独钴。以一切众生所作恶事佛法僧诽谤诸一切众生罪业皆悉除。令闻诸佛授记音故。是想为金刚铃相。以一切魔障恶事悉皆辟除令无余故。是相为金刚鉾相。以一乘教利为一面之想。以四无量心为四大天体像。亦是王以十二印为大智藏心眼。以此印为金刚身体。若有行人。持是十二印。即现身得自在他心智。得无量自在身。先般若心为其依具。即一面十手根本大火光降伏灾难无所不至大陀罗尼曰</p><p>曩谟三满多嚩曰罗赦(一)陀贺(二)[跳-兆+ㄆ]地[口*梨][廿/娑]泄(三)佉佉(四)欠讫哩(二合五)唵(六)[阿-可+(俱/寸)][阿-可+梨](二合七)毗曳[跳-兆+也]知哩智陀贺(八)跛师[这-言+智]卢(九)吽发吒索缚迦(引)</p><p>大母心真言王曰</p><p>[阿-可+(俱/寸)][阿-可+梨]</p><p>摩诃王心中心咒曰</p><p>唵迦陀野吽索缚贺(引)</p><p>是三种真言说了。即时三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>六种震动。是时大子等大惊曰。是何因缘。即王曰。我出世间事。但只有一大因缘也</p><p>﻿迦陀野仪轨 卷中</p><p>吽迦陀野[阿-可+(俱/寸)][阿-可+梨]护摩品第三之余(二卷)</p><p>即时是大力太子。诸天夜叉乃至鬼神一切善恶诸神等曰。是何因缘。即曰。我出现世事。但只有因缘也。其因缘者。只此真实语真言也。我众生利益大法藏也。又我眼也。我欲见时。此真言尽于坛<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>念意清净行。我尔时一面十臂相现。行者教其生生世世重罪灭除。其所愿闻还本城。而即其大愿成就。又敕最胜太子曰。大梵天王帝释天等始。金刚密主大力士散指鬼神王。摩尼拔陀大鬼神王。总一三千大千界大小鬼神等。悉皆召宣命。而承教敕。城行去即召来敕曰。我汝等召事。我今无比势力众生利益佛与等无异。故汝等召。其所由因缘。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>众生。若男若女等。一心我念。并此大秘密真言持人。令此持真言者加持守护为故也。而汝等天鬼神王等。今日我说护摩大密相应法。汝等一心善闻。若持真言者修此法时。汝等当作大守护使者。即彼法印成就。即是天等悉皆承教命。即付胜地即合掌闻持。爰即大王说从十二印法咒始诸印真言法印。先住慈悲三昧。行者作结印法。先头之印。大金刚合掌。真言曰</p><p>曩谟三满多缚曰罗赦[蹲-酋+俱]梨[糸*感]吽(二合)</p><p>次面印莲花合掌。真言如前</p><p>次眼印左右手各作拳相。地指二立二眼令轮回。真言如前</p><p>次鼻印左右地火各叉立。两水未一所相。二风三角作立鼻未付。真言如前</p><p>次耳印左右手地水火风今四指去立。今一母指掌内入。左右耳付。真言如前</p><p>次口印左右地风叉立。各左右水火并卧。二空如柱立观牙付口。念我金刚(金刚者一切不破处)身。真言如前</p><p>次舌印左右手各风空未一所合。今三指延并立。二手好并相立观口内入。真言如前</p><p>次两肩印左右手五指好相立各方肩付。指未付向口方。诵真言如前</p><p>次腰印左右火指内方向二三节姣相下各指未两母指一所合。腰边令轮回。真言如前</p><p>次两乳印左右地空指各四未并立三角作宝形。左右水火风地方付两乳上散。真言如前</p><p>次左右胁印二手内缚。左右地指未相立两胁令轮回。真言如前</p><p>次半座印右手五指并立少许屈如半莲华形观蹲踞。其真言如前(此八大曼荼罗)</p><p>皆悉依此十二印法。影向持法人所。昼夜无间守护持法人。消灭无量灾难病患。得无量福德自在及官位。尔时说护摩作法样。若有众生。家人厌魅咒咀。欲离此患。当持用护摩法。以此法调伏诸恶事。又欲消灭一切病患及诸恶事。应用此护摩法。若欲用此法。先坛样说有三火坛。一息灾。二增益。三调伏延命法摄息灾法。所望一切事。又摄敬爱法。增益而相应降伏法也。先坛圆。坛口[示*呈]一肘。总方一肘。火坛花缘广三指。下地坛表圆缘七指。四方付莲华。四角三钴。但火炉阿阇梨前花台于十字相于底。次深七指。增益坛。四方四角。坛口渡一肘。方一肘五指。花延三指。地缘七指。深半肘。四方三钴四角花付。前于十字杵伏底十字羯磨次降伏坛。先于四角地坛一肘七指。次上作三角坛。于花缘三角口。又三角口渡一肘二指。方寸如前。深准上所说。三角付独钴杵。付二方师子面坛本于莲台。息灾坛色白。衣色一切皆用白色。敬爱如是所望用青色。增益用黄色坛。色又如是。降伏坛亦又绀色。衣一切物色如是用此色。必必调伏法也。若欲护摩时。用先最胜太子降伏大法印。先左手取大刀。以右手作拳。念四方打。若无大刀。若又用内印。先二手合掌。二地指三寸程开去。二大母指并如师子耳。此即大降伏印。行人至心观想。乃至此印一以一切所持用即成。如法事业。若加持诸物。行者得意用可此印明。即明曰</p><p>唵缚曰罗(二合)拟首耶(一)婆多知也(二合二)娑婆知耶(二合)那(三)矩驮矩驮(四)阿罗驮阿罗驮(五)苏噜儞苏噜儞(六)苏知噜知噜儞唅吽(七)泮(八)吒</p><p>此真言印加持。次四方世悉皆其所有。天地神等不安皆怖畏被缚。而行者以解脱心。乃至随心用结。毗沙门天王行步真言曰</p><p>唵步利(一)唵矩味唅吽(二合)泮吒(引)</p><p>若欲过患难。先作其佉罗都卢。先生老病死形如云色蛇形。若恶人持法人诽难。如是种种若鱼血。若又行法者佉血。以此等尽其色等。此名究意难。若魔一切灾难大鬼形作。若咒咀诸灾难。又作大恶蛇形。若恶人持法人诽谤。如是人当作其人形。又入心内名尽。若行者随心如是灾难形作。佛塔僧坊若行法所。先如是等难形以可踰。又以先印此形等加持。先印二小指无名指相钓向内直立。二中指及二大母指未向外卧延。二风指于掌中护身。若加持一切降伏印。真言曰</p><p>曩谟奢多罗耶(一)南无(二合)三勃陀(二)阿婆耶多罗耶(三)南无婆多婆奈曳萨嚩贺(引)</p><p>若一切恶人诸不祥灾难外道恶比丘等。皆悉欲降伏。如是作其一一形体。以此印明加持。又作骨角金刚橛长六寸五寸。又作法所作盘方九寸若七寸五寸。面悉图师子王。又四角有恶形鬼恶。中有十字大刀下。随心作恶形高三寸。鉴护摩坛前。其形体。横卧置。先用二橛其左右胁打加持。又用二橛其二足立打。用一橛其心上于打加持各百八遍竟。即其恶形悉摧碎如微尘。安掌内念其名等入火中。如是入已了。即彼盘密于阿阇梨座下。如是盘一用二种木调伏。佉多罗木若跋沙罗佉木。若花木等作盘。如是七日七夜护摩。室内难皆悉灭消。若人间恶事。若恶人皆悉不过证中死已修又伏从。若如是行者发慈悲行。息灾法又如故本如是自在大法更不传授。若修法有天地喜悦相。即行人梦见好相。若又有虚空声言。汝所行法悉皆成。皆成就了更勿生疑。若少生疑念。即失大神验。若无空又音。又无好相。大空大雨大云大雪失时节。其音出大风四方吹。如是相皆成就相也。更无生疑。又但阿阇梨人意也。如是相令现。即名摩诃娑阿佉梨。于阿阇梨有三种。如是有大异相人。名摩诃娑阿佉梨。又有于修法。必有其大神验者。名阿阇梨。又有于法信心人名持法者。悉皆具足人名摩诃阿那阇梨。悉皆此等相不具足人名摩诃嚩被者。但不依法不依世间出世一切无福一切无便人。名退陀佉那若阿阇梨。择伴侣人。先用其三种堪能。一福性。二世间出世。三意相<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>威仪作法。如是皆具足名善伴侣。若无福伴侣。其行法成行不行不成。由天王不受。是但至心修佛法。不当不至。彼贫人福如是。阿阇梨分可伴侣。此<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>具足人名大伴人者。一具又名伴侣行者当行护摩。以般若智火为火。一切众生罪若烦恼障为薪。是火不天火地火人火龙火神火木火石火自然火。只如来极秘密般若心智火也。若燃火时。先用此印加持。火加持并木即成炎轮。左右合掌。左中指付右大母指未。右中指又付左大母指末。二无名指掌中节相背屈。二风指二小指皆直立头相柱。真言曰</p><p>唵(一)多近智(二)娑婆诃(引)</p><p>若行者持此法。初时随几现天等障。先其样一一如天等所念说。行者发大心。若嗔心闻当东方大雨雷现迷行者。当知是帝释天难。东南角大色大人相现。又如日光尽。应知是此火天王难。南方死形。尚又生甚怖畏。高声叫唤。手执大刀皆悉劓鼻。手执髑髅咸人血饮。头上火燃。当知即此焰摩天难。西南角两屎尿秽尊像。念种种形甚可怖畏。即是罗剥难。西方雷雨不安世界闻此龙难。西北方大恶风起。悉众生死了。乃至自又可死念。即是风神之难。北方大药叉及女夜叉来恼乱行者。即此我迦陀难。东北角象头猪头狗头异形各持火当知即此伊舍那天王难也。上方现诸天等现大威德自在相。当知上方天等难。下方地动及震裂。即知此下方天等难。行者当知成就时难。只但当大空中央现。当知成就相。若其方其角知观是成就相也。又此即此大德成就相。若梦内见。当知此是大法成就相也。行者此大难现。即念大日观世音等菩萨。即现吉相。若一切鬼神等怀恶意。欲乱持法者现种种难恶事。即行者结手印。其鬼神缚降伏手印。两手合掌。小指无名指各各屈入掌中。二中指头相柱立。二大指未各本相付。二大母指于其二大指上。真言曰</p><p>唵迦陀野吽泮吒</p><p>若欲护摩时。先火天请供养印真言如常。次七曜众印真言请。若用大日如来五字真言</p><p>一切请召印明。若用各本势印明。普通请界会印。二手内缚。二风立二空入内。以风指随索缚贺来去。真言曰</p><p>曩谟三满多菩驮南(一)阿多野吽(二)索嚩贺</p><p>就座印</p><p>二手作金刚拳。左手背上于右手各相背。二地背叉立风又叉立打坛上。真言曰</p><p>唵嚩曰罗佉吽(吽)</p><p>次拳华真言曰</p><p>唵吽</p><p>诸天等请真言曰</p><p>唵嚩曰罗(二合)婆多野曳枳素婆呵</p><p>若用各真言拳送印。彼就座印各风指开来去。真言曰</p><p>唵嚩曰罗(二合)佉多野吽索婆贺</p><p>若欲护摩供养又可诵请文曰</p><p>奉请(其方其天王)降临于我此所供养。愿垂纳受。是偈句。取香炉至心劝请。即诸天圣者悉皆来集坛所。又曼茶罗众请已竟。至诚心作礼而唱此言。即偈曰</p><p>大悲救世尊善导一切智</p><p>福持功德海我今稽首礼</p><p>大力忿怒尊善哉持明王</p><p>降伏难伏者我今稽首礼</p><p>如是礼了。即诵又善来圣者偈</p><p>善来尊者愍我等故降临道场</p><p>复垂哀愍当就此座受微献供</p><p>大悲哀愍成本愿故而见道场</p><p>悲我所能</p><p>梵本曰</p><p>缚树伽罗佉[少/兔]野</p><p>奉送偈曰</p><p>曩祢多尼莲华合</p><p>成就护摩阿毗遮卢迦一切成就忿怒金刚真言曰</p><p>唵虎鲁虎鲁战拏里摩嶝淣(枳反)莎缚诃</p><p>诸天嗔怒成就护摩真言曰</p><p>唵枳里枳里跋曰罗矩噜驮吽</p><p>行者。此印真言。更不可传恶行修人。若传即法悉灭尽。若有人护人护摩供养法印至心奉供。若起他念即法不成就。若此法之师起恶律行外道等事业。百日功木一日内灭无更余。若起<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>律戒威仪。即百日功草木一日内悉皆圆满。此教行人者更无断食。若令身苦。我迦陀身又苦。同苦我令安加天势威光。欲行者身安无令辛苦。若我如是誓愿等成虚语。更不成正觉。又更不还本城。又护摩用七种木。一金刚佉木。二佉多娑木。三毗钵罗多木。四毗钵罗藏木。五时草。六坚寿木。七常荣[廿/形][廿/湅]等也。用如是木。即成就护摩。又用米立五谷。胡摩芥子赤芥子白芥子紫子饭粥五合也。盐油又用酢酒苏蜜酪。若彼紫子多用一时七粒若五粒若三粒若一粒。是一切物中相应物。一切愿成就种子也。从是中生一切愿坚寿木。念诸众生闇除授明事常荣木。念令施主安隐金刚佉木。令施主身常坚固念毗钵罗多木。施主愿速成念毗钵罗藏木。我木我行者并坛授清净爱念佉多娑木。并叶降伏相时草。福德相[廿/形][廿/湅]阿多佉木。皆是大降伏想行者知一一是。又作人形五鬼三鸟形三人形五种大鬼魔相鬼形不成事业神鸟形年不祥恶事人。即行者心念作护摩。若沙弥形童子形未得<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>者。七日护摩供。即得戒。若被盗人取财宝。又七日护摩供养。若被当盗事。七日护摩供养。尽其失物形安时烧。以嗔目见尊。诵失物名。又自血神芥子而打火即成就。若又其伴主件事出言言形作而涂目血彼像面上于盘。以刀切而烧火并又烧性名。若实事即自成息灾。若为人欲恶件言事出云。彼人七日内若相大难。若身命不全。皆悉被诸天神等降伏。心又一生相大难。死后堕地狱。若现世舌堕落。又彼失物出。若闻有所。若他耶心人取他所去悉令还持来分三。一分三宝。一分施并自断。一分彼盗人与而去。彼人命欲即发慈悲意即如本身命。若此持法人。恶人有诽谤事。现世舌切堕。手折足不具足。身意颠倒。更无有实心。诸天皆悉舍离。断其命。若又断世间分。若又断其大愿。若又断其一类结缘一众若干福分并其命根。若不断命贫穷常相刀镰轮弓箭王难。八大世界圣众。观世音菩萨等皆舍离此人。何护法天着发慈悲心。行者即如本。若如是弘誓舍不名护法天等。少无此持法者恶念。若放逸比丘沙弥。童子见吾一面十手想悉皆[山*雀]碎打如恶形鬼形。如地狱断分上流水留他所流。诸天鬼神等皆如是打除却罚。故更我不见。若善心比丘沙弥等持我即与大愿。我是一切众一切众生父也母也。财也辨也。多闻也智惠也。衣服也食也。便主也善药也。又此大毒大刀也。锁轮也火轮也。水轮也风轮也。如是行者心可调。若我持人无非威仪。念常座被赤色半袈裟。若欲降伏怨家。先作印。而作护摩。药叉立身金刚忿怒身印。以右脚直左脚踏右足。地相去一肘许。以左手三指直立。以左大母指捻小指甲上托腰。右手以五指付面上。嗔色音结界供坛右转。一度一咒。如是二遍。即咒曰</p><p>唵(一)帝婆药叉(二)盘陀盘陀(三)诃诃诃诃(四)吽娑婆诃</p><p>若此印明法即成如意结界无所他念但法成就非成就有行人意。又若军事国内满不安人民众。尔时国王大臣王子百官宰相。皆悉归伏我一面十臂之多闻王。尔时我即彼军主令伏。又法若欲降伏。作非小弓箭大刀坚。木皆用。以一当十。以十当百。以百当千。以千当万。如是知彼军人员作此弓等。即护摩七日若九日若二十一日若一百日必降伏。若王宫殿若深山若清净所。修此法。彼辈皆自然被箭大刀自然火皆死已。若伏各还本土。若彼是国王两相。各又令发慈悲利心更无如是事。若件法至心依军事。若一切事行法。我现身法成就。若国内三灾七难发。万民悉不安。乃至到死已天地不和。神鬼已灵皆发恶心疫病。如是有灾难。即念一国人民。我即修大密法。即皆悉留灾难。增长人民命福分。天地神鬼恶灵等。皆以般若自在心令降伏。更令无发。帝尺等天皆怀降伏悉一时此灾灭。若疫病灭。青木香和水加持。又修法所加持令饮。国内人民即得无量寿命福德。无所疑念。已证入世界主都钵王。若干牛头罗剥鬼神悉皆等神皆为眷属。悉皆令从魔取不违天王法教。若违此政。即牛头等神皆被般若火焚烧。更无他念。即失疫病令安乐。众生与无量财宝证入界主疫神主也。是利益众生故。现如是相故。少无疑念。若少生疑念。即失大神验。若欲法供养八曼茶罗界会诸尊。并又八牙天等供养。即成就法。又护摩时。又作五大天王。中央一面十臂。东提头赖吒天。南方毗卢勒叉天王。西方毗卢博叉天王。北方最胜太子。若如是修法时。即法阿阇梨放音高唱即曰</p><p>吽吃哩多陀迦野吽</p><p>是即请召请尊成就法相。若是行法时。经日无验。又作随心曼荼罗。中央弥勒菩萨。左方法音轮菩萨。右大妙相菩萨。四方四大天王。尔时即我多闻于北方。如是行即成就。若八曼陀罗无作此曼陀罗用。若持八曼陀罗是不持。若八曼陀罗前行是密法。即得如意成就。勿生疑。若我如是本誓失更不成正觉。若盗贼来人物来取。即财主至心念我。又大刀手即伏随。而即七日护摩。若人被咒咀。其咒咀人宅方我面向调伏法行即降伏。若死至即发悲心又生。若业尽临死。我七日护摩供养。三日若七日生。若卧病重更无余命。我七日护摩供养即与无量财宝寿命。若恶人于<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>起耶心。即闻其由。又作阿毗遮卢法。又时时讽诵。即悉皆摧碎降伏无余命根。若相大难若发行人慈即成息灾。若有恶人。于三宝物起取心。又三宝护法天等讽诵即辨其由。若有国王我持行法。我常至其所闻其政。若有恶事。我即成大王心。王即转恶成善政。国内人民令悦想。王加持令无诸灾难。大臣百官万民又如是。若本誓舍我不名护法天。又不成正觉。若有法师。我持而日日<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。心清净诵密语。即我悉皆成从人至所所随奉仕。若现世成童子形承事又加护。若法师檀等受事修法起贪欲心。于施等不清净即失法验。现世舌切手折头破吐血。又至大苦死。又清净心行法悉成就法。更无疑念。若作像等。有作人其欲多得。即现世得大蛇身。六根皆悉不具足。常常苦恼又至死。又作间至心华香供养作如是不作不又成造作功德。佛作师之<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。用妙华一轻不失是事。若不而不成功德。于受法师起恶人心一度。即不成法功德。生生世世不遇佛法僧。常随恶道地狱。若授恶意非戒律弟子法灭尽无余。是法此间希有法。又我心眼也。又法欲作大法印。即作妙藏曼荼罗一界行又成。又亦作中央释迦牟尼佛说法相像。左方吉祥天。右方毗沙门天王。作如是曼陀罗即相应曼荼罗也。又成就法若八曼陀罗。及我天王一切护法天欲供养。先当结香华印。二手无名指小指印交叉。二中指头柱以二头指中指背付二大母指付头指。真言曰</p><p>唵摩拏阿罗地(一)钵哆布罗迦(引二)也萨薄贺(引)</p><p>次饭食印。准前香华印。唯改二小指二无名指掌中各开印。真言曰</p><p>曩谟(引)惹岐帝(引)娑跛萨罗帝(引)哆吒罗哆吒罗攞延也悉婆萨嚩贺(引)</p><p>此契及以真言。若加持饮食供物奉献。即得无尽大法宝藏。若无饮食。恒对天王像前空结此契印。及诵真言。供养天王。亦得无尽福利。结王欢喜法药甘味胡麻油灯印。右手小指无名指掘在掌中。其中指直坚头指一屈向掌。以大母指付头指。以大母指未付中指本。真言曰</p><p>唵婆闭底[(匕/示)*(入/米)]萨嚩贺(引)</p><p>以契明供养天王。念神力光照耀自在念得天王欢喜。又结阿遮卢迦灯印。即辛香油苦华香油印也。右手内缚地指一立随百灯心奉供。真言曰</p><p>唵度曳尼罗(二合引)尾誐多野婆罗涕多(引)野吽增婆诃</p><p>灯器即用金银赤熟铜瓦等之中随得。持上新净布作灯炷</p><p>次入三昧耶住坛场印莲华合掌。二大指去开竖。随增婆诃各来去。真言曰</p><p>唵誐婆尼(二合引)吽索婆贺(引)</p><p>阿毗舍卢迦三摩耶曰</p><p>唵阿三迷吽</p><p>金刚座印二手内缚。调八节高出二大母指入内。即须弥念。真言曰阿恶(二合)</p><p>阏伽印莲华合掌中开左右空去开立真言曰</p><p>曩谟三满多冒他南佉[少/兔](二合引)婆尼吽索缚贺</p><p>次涂香印二手合掌。各空风未一所合即掌大仰即成。真言曰</p><p>唵地誐尼(二合)[山*在][少/兔]野(二合)吽</p><p>次烧香印金刚合掌。真言曰</p><p>唵阿野佉多吽</p><p>次净道场印二手内缚。左右地水二掌中入各叉。二大头互。直右火甲上付左空。左火甲上付右空。二风头一所合直立。印五处。并又欲菩提道场苦秽烧净。真言曰</p><p>蓝</p><p>次结净使印左右地水火掌内叉直立。左右风头合直卧延。左右空指去竖。随索婆诃来去。真言曰</p><p>多</p><p>阿毗舍卢迦持数珠印</p><p>右地风直立。水火空入内。即念成降伏体相用。若杂香珠数。真言曰</p><p>曩谟(一)阿娑野(二合引)满多那吽(二合引)增佉誐陀缚野唵(二)吽(三)曩褥(引)佉跨增木婆林野吽发吒素缚佉吽</p><p>扇底迦奉上法真言曰</p><p>唵誐誐尼吽(二合引)素满贺(引)</p><p>敬爱奉上法印二手作奉。各火风并立左上于右印。即各指头叉如[仁-二+鸟]牙。真言曰</p><p>曩婆娑满多嚩萨罗佉曩野吽</p><p>次阿毗舍卢迦奉上真言曰</p><p>唵弟誐(二合引)多野(二合)吽缚沙罗野素缚贺(引)</p><p>若欲作息灾。当加息灾延命句诵得梨大母真言。若持念圣者迦陀大真言王。若持念根本大陀罗尼即成就。若有受持者当清净可念诵二十万遍。天王必成办所作事业。若为降伏他起心动念即成就降伏。若官职念我随汝心所愿。若入月一日若十四日若十五日般若肝心等于坛。又于一前阏伽供。又有饮食即奉供。若无如是从日必成就。若有人更无日分即与食况衣服。若法师至清净心令法久住故行此法。我天围绕恭敬供养。又有弥勒菩萨。其阿阇梨人授左手。俱一座上居。我天王足顶戴恭敬与。大法味。如是知即供养我。有众生作像等日日立礼。若念心不失。即如意得一切大愿。若前生报重不可得福德。因我八曼陀罗界会圣众俱。日日与一分食。况余事也。若有短命众生。我天持供。有前生报不得寿命长远。我当令得寿命长远。事观音弥勒等菩萨。又与寿命。若有女人求男。我七日护摩供养。即得如意男贵人。若有男人求女人。又我七日护摩供养。即得如意女人。况常恭敬供养造像界会。若有法师。我天王日日礼拜供养。常三时承事护摩供养。先其业障消除。其如意一切事成就。更意勿生疑念。况作像日日供养礼拜。若有法师。不护摩供养。常常日日欲供养。当作大法内供养印契。真言法。即成就所愿。若有法师。行法不着不净衣。若常时着不择衣净不净等。此法受。即阿阇梨即得印尽。即得诸天等守护。若不得时。即法灭尽更无余。法则尽了。此人佛法寿命断了一切如是言知了即印信句曰若干诸尊皆授此印法咒了即如是言名尽父若人于此法成少疑心我一切夜叉共此人摧伏大日如来皆依护法天其本愿成我护法天作障难于行者更无佛法德我此一切水火身也。若又发于行人少恶心人成于法咒疑念心。我当说杀法此人摧烧尽。此人神取加摩诃迦罗等内。更无余命。是杀法此八世界成就法也。具太子经说</p><p>吽迦陀野梨杀药法引构八大曼陀罗大灵验法入供养品第四</p><p>若欲成就是八大曼陀罗之法者。当作八曼荼罗。若二寸若三寸若五寸。皆香木用灵木用作。始从东北角。北方安置中天药叉之形。皆形千即大夜叉并女。天地皆尽尊面员若干。若书梵字。前置大刀。并纳小刀。即大刀中自血出。天王身作笼于大刀。若香木并金等皆用。即念本尊天小刀即以结界并切散。即为五天王念此法八大法作了。最后大供养。前行从妙因皆行八大曼陀罗法。前已说曼陀罗行相。是法先取藤七寸切三枚。皆于坛中加持。并作夜叉女形。并作护摩本尊坛。烧念众生有腾并夜女。一切所作功德皆此藤结灭无余。洛行人令作重罪。又是女一切所生子皆食终食失令随地狱如是罪灭断。又更不有。欲行欲是法。当量自身行不而即自所更有何疑。取先切藤。真言曰</p><p>唵佉吽佉吽</p><p>先坛请五方王印通印。真言曰</p><p>唵婆帝吒摩诃噜唵吽(二合)阿罗尽帝娑婆诃</p><p>请是天龙成使者八方难止真言曰</p><p>唵阿婆罗帝婆婆多多娑诃</p><p>一切魔王七里之外避除真言曰</p><p>唵(一)毗摩罗(二)嚩打陵伽罗伽(三)伴(四)伴</p><p>次禁缚使者真言曰</p><p>唵(一)婆罗婆罗(二)伽梨南(三)喏卢喏卢(四)迦罗啫迦罗啫(五)迦奢陀那(六)娑[口/可](七)</p><p>次童子神取咒曰</p><p>唵(一)折婆罗给(二)哞哞(入三)发吒(四)毗利呿底只(五)</p><p>尾帝(六)娑诃</p><p>童子八处对已真言曰</p><p>唵(一)伽梨伽罗(二)伽罗尼那(三)婆罗喇[口*佉](四)婆罗对(五)唵(六)婆尼婆尼(七)[口*对]婆罗唅(八)</p><p>打童子面咒曰</p><p>唵(一)阿婆哞阿婆哞(二)阿娑么(三)皆染悉[口*(差-工+目)]噤[口*空]哞枝吒(四)</p><p>结缚禁真言曰</p><p>唵(一)制婆啰夜(二)娑[口/可]</p><p>解神人神舌口法印真言</p></div>"
}]