[{
    "title": "苏悉地羯啰经 第893部",
    "author": "输迦婆罗 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>苏悉地羯啰经 卷上</p><p>唐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>输迦婆罗译</p><p>请问品第一</p><p>尔时忿怒军茶利菩萨。合掌恭敬。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>尊者执金刚足。发如是问。我曾往昔。于尊者所问。诸明王曼荼罗法。及以次第。复闻明王。并诸眷属。神验之德。唯愿尊者。广为未来诸有情故。唯愿尊者。广为解说。以何法则。持诵<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>。次第速得成就。其请真言法虽有一体。所成就事。其数无量。云何真言相。云何阿阇梨。云何成就者<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。云何方所为胜处。云何真言速成就。云何调伏相。云何诵真言方便及次第。云何花<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。云何用涂香。云何供养食。复烧何等香。云何然灯相。云何扇底迦。云何增益相。云何降伏怨。于是三种中。各成何等事。云何上中下次第成就相。以何法请召。云何供养之。云何作护身。云何广持诵何相得真言。云何作灌顶真言之仪式。云何当受付。云何字得满。云何得增益。云何作护摩。及以次第法。复用何物等。能令速成就。云何成药相。云何净持药。云何药量分。云何诸药相。云何成就诸物相。云何而受诸物相。云何能净诸物法。云何物量及多少。彼诸物等。并相貌。唯愿尊者。具大慈悲。一一分明。当为我说。云何护诸成就物。及以分别为分数。云何受用成就物。唯愿慈悲分别说。云何失物令却得。云何被破却令着彼。云何先知作障碍相。云何成就曼荼罗。云何事相曼荼罗。云何灌顶曼荼罗。如上所随其问要者。唯愿尊者大慈悲。为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>故。唯愿慈悲分别广说</p><p>真言相分第二</p><p>尔时吉祥<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>一切持明王大圣供养者执金刚。告彼大<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>忿怒菩萨言。善哉善哉。大忿怒。能于我所。发如斯问。应当一心谛听最上甚深秘密妙法。此苏悉地经。五种庄严。一谓大精进。二谓明王三能除障。四能成就一切猛事。五能成就一切真言。此苏悉地经。若有持诵余真法言不成就者。当令兼持此经。根本真言。即当速成诸真言之法。于三部中。此经为主。亦能成办一切事。所谓护身结界召请供养。相助决罚教授等事。一切真言。一一次第能令得成。复次或诸心真言中。三虎[合*牛]字者。亦能成办。如上所说一切<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。谓三虎[合*牛]字心真言曰</p><p>囊(上)谟(上)啰怛囊(上)怛啰(二合)夜也囊莽室战(二合)拏嚩曰啰(二合)簸儜(上)曳莽诃(上)也乞沙(二合)细囊钵多(上)曳唵苏地也(二合)悉地也(二合)娑去大也苏悉地羯啰[合*牛][合*牛][合*牛][打-丁+(姊-女)]吒(二合) [打-丁+(姊-女)]吒(二合)[打-丁+(姊-女)]吒</p><p>复次上中下成就法。如别经中说。愿等成就者。应解真言上中下法。此苏悉地经。总通摄三部。所作曼荼罗法佛部真言。扇底迦莲华部真言。补瑟征迦金刚部真言。阿毗遮噜迦。从腋至顶为上。从脐至腋为中。从足至脐为下。于真言中。亦应分别三种成就。于此三部。各分为三。善解了别。于其三部。诸真言中。明王真言。是上成就。诸余使者制吒制征等真言。是下成就。三事法者。一扇底迦。二补瑟征迦。三阿毗遮噜迦。如是三事。于三部中。各皆有三种应须善知次第之相</p><p>佛部之中用佛母号为佛眼。用此真言为扇底迦。佛母真言曰</p><p>那(上)谟婆(去)伽(轻)嚩帝呜瑟腻(二合)沙也唵噜噜娑普(二合)噜若嚩(二合)里底(丁以反)瑟咤(二合)悉驮路者宁(去)萨啰嚩(引二合)啰他娑(去)驮宁(上)娑(去)嚩诃</p><p>此是佛部母真言佛眼是也</p><p>莲华部<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>音母号为半拏啰嚩悉宁。用此真言为扇底迦。观音母真言曰</p><p>那啰舍(二合)囊(上)娑莽嘌(二合)啰舍囊便(去)室啰(二合)嚩娑莽(二合)啰奶囊(上)者写莽含(二合)萨啰嚩(二合)萨怛嚩(二合引)难(去)萨啰嚩(二合)微也(二合)地指抧瑳(上)迦唵微迦[齿*来]迦吒微迦吒迦桢(吒应反)迦[齿*来]婆(去)伽(轻呼)嚩底(丁以反)微若曳莎(去)嚩诃</p><p>此是莲华部母真言。半拏啰嚩私宁是也金刚部中。用执金刚母号为忙莽鸡。用此真言。为扇底迦。金刚部母真言曰</p><p>那(上)谟(上)啰怛囊(上二合)怛啰(二合)夜也那(上)莽室战(二合)拏嚩日啰簸儜(上)曳莽诃药乞沙(二合)细囊钵多(上)曳唵俱(上)兰达哩满驮满驮[合*牛][打-丁+(姊-女)]吒(二合)</p><p>三遍此是金刚母真言。忙莽鸡是也复次佛部中。用明王真言。明王号为最胜佛顶。用此真言。为补瑟征迦。明王真言曰</p><p>囊(上)莽三曼多母驮难(去)唵悖论(引)囊莽</p><p>莲华部中。亦用明王。号曰诃野吃利嚩。用此真言。为补瑟征迦。明王真言曰</p><p>唵阇没嘌(二合)妒婆(二合上)嚩囊(上)莽莎(去) 嚩诃</p><p>金刚部中。亦用明王。号曰苏嚩。用此真言。为补瑟征迦。真言曰</p><p>囊(上)谟啰怛囊(二合上)怛啰(二合)夜也囊(上)莽室战(二合)拏嚩日啰(二合)簸儜(上)曳莽诃(去)药乞沙(二合)细囊钵多(上)曳唵素唵(二合)婆(上)宁(上)素唵(二合)[合*牛]檗嘌(二合)恨儜(二合)檗嘌恨儜(二合)[合*牛]檗嘌(二合)恨儜[合*牛]阿(去)囊也护薄伽(轻)[口*梵]尾儞夜(二合)啰(引)若[合*牛][打-丁+(姊-女)]吒(二合)囊(上)莽</p><p>又佛母部中。用大忿怒。号曰阿钵啰氏多。用此真言。为阿毗遮噜迦真言曰</p><p>[合*牛][打-丁+(姊-女)]吒(二合)地迦(轻)地迦地迦尔囊悉尔迦(轻)[合*牛][打-丁+(姊-女)]吒(二合)</p><p>莲华部中。大忿怒号曰。施嚩(去)嚩诃。用此真言。为阿毗遮噜迦真言曰</p><p>[合*牛][打-丁+(姊-女)]吒(二合)阿唎(二合)[合*牛][打-丁+(姊-女)]吒(二合)</p><p>金刚部中。大忿怒号曰。军荼利。用此真言。为阿毗遮噜迦真言曰</p><p>囊(上)谟(上)啰怛囊(上)怛啰(二合)夜也囊(上)莽室战拏嚩日啰(二合)簸儜(上)曳莽诃药乞沙(二合)细囊钵多曳唵阇没嘌(二合)多军(去)拏里佉佉却醯却醯底瑟吒(二合)底瑟吒(二合)满驮满驮贺囊贺囊(二合)微娑铺(二合)吒也微娑铺(二合)吒也萨啰嚩(二合)尾近囊(上)微囊也迦(引)莽诃(去)言(上)儜(上)钵底(丁以反)饵尾旦多羯啰(引)也[合*牛][打-丁+(姊-女)]吒(二合)</p><p>复次或有真言。不入三部。随彼真言文字。而辨扇底迦等三种法事。其真言中。若有扇底迦噜字。莎悉底句噜字。閦莽字钵啰(二合)閦莽字乌波閦莽字莎(去)诃(去)字者。当知即是扇底迦真言</p><p>若有补瑟征句噜字。落乞涩民(弥寅反二合)那那字乌(去)乳字么罗字嚩嘌(二合)地字[口*露]波字咩驮字但囊但宁(上)也(二合)字醯里宁(上)也字蘖啰(引)莽字囊蘖啰字啰(引)瑟吒(二合)字啰(引)尔阎(二合)那那字囊(上)莽囊(上)莽字者。当知即是瑟征迦真言。若有[合*牛]字。贺囊(上)字[打-丁+(姊-女)]吒(二合)字莽他(二合)字畔若字啰也吒也字乌瑳(去)那也字戍沙(上)也忙啰也字却(引)那也字鴳攞也字齿曳(二合)那也字婆(去)悉咩(二合)句噜字者当知即是阿毗遮噜迦真言</p><p>复有真言句义慈善。当知即入扇底迦。用若有真言句义猛怒。当知即入阿毗遮噜迦用。若有真言非猛。当知即入补瑟征迦用。复次若欲速成扇底迦者。当用佛部真言。若欲速成补瑟征迦者。当用莲华部真言。若欲速成阿毗遮噜迦者。当用金刚部真言</p><p>复次此经深妙。如天中天。亦有真言上中下。若依此法。一切诸事无不成就。此经虽属第三金刚下部。以奉佛敕。许通成故。亦能成就上二部法。譬如国王敕许。依行此法亦尔。准义应知。若有真言字数虽多。初有唵字后有莎诃字。当知此真言。速能成就扇底迦法。或有真言初有[合*牛]字。后有[打-丁+(姊-女)]吒字。或有[口*疑]普字。此是词声。有如上字者真言。速得成就阿毗遮噜迦法。或有真言初无唵字。后无莎诃字。又无[合*牛]字。亦无[打-丁+(姊-女)]吒字。及无[口*疑]普等字者。当知此等真言。速能成就补瑟征迦法。若复有人。欲求摄伏诸余鬼神。及阿毗舍。当用使者及制吒迦等所说真言。速得成就。若有异部真言。说能成就一切事者。但能成就本部所说。不通余部。犹有经演彼有真言。为除毒病故。说不能除诸余苦。当即知其通一切用。善知其部。善识真言所应用处。亦应须知真言功力。复须善解修真言法。随所求事。随称彼法。真言之相。诵彼真言。即得成就</p><p>苏悉地羯啰分别阿阇梨相品第三</p><p>复次我今当说阿阇梨相。一切真言由彼而得。是故明知。阇梨者最为根本。其相者何。谓支分<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>福德庄严。善解一切世出世法。恒依法住。不行非法。具大慈悲。怜愍有情。贵胜生长。调伏柔软。随所共住。皆获安乐。聪明<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>辩才无碍。能怀忍辱。亦<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>慢。常乐大乘。及解妙义。复深信乐秘密之门。纵有小罪。犹怀大怖。身口意业。善须调柔。常乐转读大乘经典。复依法教勤诵真言。而不间断。所求悉地。皆悉成就。复须善解。画曼荼罗。常具四摄。为求大故。不乐小缘。永离悭吝。曾入大曼荼罗。而受灌顶。复为先师。而叹德者。汝从今往。堪授灌顶。为阿阇梨。获斯印可。方合自手造曼荼罗。须依次第。亦合授与弟子真言。若依此者。所受真言。速得成就。不可怀疑。不于如上阿阇梨处。擅诵真言。徒用功劳。终不获果。弟子之法。视阿阇梨。犹如<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。及菩萨等。为能授与。归依之处。于诸善事。而为因首。现世安乐。当来获果。为依阿阇梨故。不久而得无上胜事。所为<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。以是义故。比之如佛。以为弟子。承事阇梨。无有<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。勤持不阙。所授明王。及明王妃。当得悉地。必无疑也</p><p>苏悉地羯啰罗分别持诵真言相品第四</p><p>复次我今演说持诵真言。速获成就<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。三业清净。心不散乱。曾无间断。常修智慧。能行一法。成就众事。复离悭贪。所出言辞。无有滞碍。处众<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。所作速办。常行忍辱。离诸谄佞。无诸疾病。常行实语。解善法事。年岁少壮。诸根身分。皆悉圆满。于三宝处。常起<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。修习大乘。微妙经典。诸善<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。无怀退心。如此之人。速得成就。于诸菩萨。及以真言。常起恭敬。于诸有情。起大慈悲。如此之人。速得成就。常乐寂静。不处众娆。恒行实语。作意护净。如此之人。速得成就。若闻金刚威力。身得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。即以谛信。心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。如此之人。速得成就。若人少欲。及以知足。诵持真言。念所求事。昼夜不绝。如此之人。速得成就。若人初闻真言法。则身毛皆竖。心怀踊跃欢喜。如此之人。成就<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。若人梦中。自见悉地。如经所说。心乐寂静。不与众居。如此之人。速得成就。若复有人。于阿阇梨所。敬重如佛。如此之人。速得成就。若人持诵真言。久无效验。不可弃舍。倍增广愿。转加精进。以成为限。如此之人。速得成就</p><p>苏悉地羯啰经分别同伴相品第五</p><p>复次当说。其同伴相福德贵族生者。常乐<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。不行非法。复怀深信。离诸恐怖。精进不退。奉持尊教。常作实语。诸根支分。皆悉圆满。身无疾病。不过极长。复不极短。不过极肥。亦不极瘦。不用太黑。亦不极白。离如此过。福德同伴。能忍诸苦。善解真言及曼荼罗法。供养次第。诸余法则。常修梵行。能顺诸事。出言柔软。令人乐闻。离诸我慢。强记不忘。有所奉行。不相推托。多闻智慧。复有慈悲。常念<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。善解分别。明王真言。常须念诵。所持真言。与尊行同。兼明结界。护身等法。如是之伴。当速得成就。三业调善。曾于师所。入曼荼罗。归依<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。不习邪法。善知尊者。所须次第。不待言教。随有所求。知时即送。具如此者。为胜同伴。身意贤善。心无忧恼。决定坚固。终无退心。得如是伴。当速成就。于多财利。不生贪着。具如是德。说为胜伴。复于<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>处。心无舍离。若欲成就诸余药等。为作强缘。不应舍离。自然圣戒。具如是德。说为胜伴。于行者处。无所规求。未得悉地。成就以来。终不舍离。纵淹年岁。复无悉地。终不怀于舍离之心。假有大苦及余难事。逼切身心。亦不应舍。具如是德。说为胜伴。若有如前。种种<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。堪能成就。最上胜事。纵无前德。但明真言。成就法则。并复善解诸曼荼罗。智慧高明。复加精进。胜持诵者。如是之伴。亦能成就。最上胜事。为愿成就。最上胜事故。其福德伴。半月半月。与持诵者。而作灌顶。及以护摩。随时所办。香花然灯。诸余次第。拥护简择。随所有为。并须助作。非直助修。如前尊事。若持诵者。有所亏失。其福德伴。依于经法。以理教诲。勿令有阙。乃至广为开示<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。具如是者。最为胜伴。行者每日持诵之时。及所行事。时有忘失。其福德伴。随所见处。相助作之。便令周备。若欲成就药法之时。须常以手。而按其药。或以草干。而用按之。念诵作法。事务虽多。<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>之者。持诵不得废忘。欲了之时。其伴当须侧近而立。看彼尊者念诵既劳。或恐忘作发遣神法。置数珠法。及余法等。见忘作处。应助作之。其伴常须持诵供养。所作诸事。而生福德。并皆<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>。持真言者。满所求愿。有所指受唯共伴语。既欲成就。最胜事故。更许一伴。展转合语。不得参差。其伴所食。与尊者同。非但同食。亦令持者。所食错者。如依法制。具如是者。堪为最上。胜事同伴。第二同伴。第三同伴。亦然一如前说</p><p>苏悉地羯啰经简择处所品第六</p><p>复次演说持诵真言成就处所。于住何方。速得成就。佛成道降四魔处。如是之处。最为胜上。速得成就。尼连禅河。于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>侧。无诸难故。其地方所。速得悉地。纵有诸难。不能为障。所求之事。无不悉地。如是之处。速得成就。或于佛所。转法轮处。或于拘尸那城佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>处。或于迦毗罗城佛所生处。如上四处。最为上胜。无障娆故。三种悉地。决定成就。又于诸佛所说胜处。复有菩萨所说胜处。八大塔处。或于名山。多诸林木。复多果实。泉水交流。如是之处。说为胜处。或于兰若。多诸花果。复有水流。人所爱乐。如是之处。说为胜处。复有兰若。多诸麋鹿。无人采捕。复无罴熊。虎狼等兽。如是之处。说为胜处。或无苦寒。复无大热。其处宜人。心所乐者。如是之处。说为胜处。或于山傍。或于山峰顶。或独高台。或于山腹。彼复有水。如是之处。说为胜处复有胜处。青草遍地。多诸花树。中有其木。堪作护摩。如是之处。说为胜处。或于安置<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>前。或于山中安<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>处。或四河边。或有兰若。种种林木。而为严饰。无多人处。或于寒林烟不绝处。或大河岸。或于曾有多牛居处。或于逈独大树之下。神灵所依。日影不转。或多聚落。一切祠祀处。或于十字大路之边。或龙池边。如是之处。说为胜处。或<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>行。所至之国。如是之方。速得成就。但有国土。诸人民众。深信三宝。弘扬正法。如是之处。速得成就</p><p>复有国土。多诸人众。并具慈悲。如是之处。速复成就。既得如是。上妙处所。应须简择地中秽恶瓦石等物。曼荼罗品中。一一广明。如悉地法。善须分别。三部处所</p><p>复须分别扇底迦法。补瑟征迦。阿毗遮噜迦。如是三法。复须分别上中下。或即于是处随心所置。应涂洒扫。作诸事业。速得成就。悉地之法</p><p>苏悉地羯啰经分别戒法品第七</p><p>复次广说制戒持真言法则。若依此戒。不久当获成就。若有智者。持诸真言。先断于嗔。乃至天神不应生忿。复于余持真言者。复不怀嗔于诸真言。不应擅意。乃至功能。及诸法则。而分别之。应于诸真言。及以法则。深生敬重。于诸恶人。善须将护。何以故。能障大事。及坏彼故。于阿阇梨所。纵见愆过。身等三业犹不生于憍慢之意。亦口不谈种种是非。心意终不分别。愆过之想。有过尚然。况依法耶。纵怀大怒。终不应以自所持真言。缚他明王。及生损害。并苦治罚。亦复不应作降怨法。未曾于阿阇梨处。而受真言者。不应与彼许与受之。于三宝处。不生恭敬。复是外道。虽于阿阇梨所受得真言。亦不可与彼。及至手印。及以真言。并功能法。及普行法。并不得与。未曾经入曼荼罗者。亦不授与。不应跳陌一切有情两足之类。及至多足亦复如是。又不应陌诸地印过。所谓锤轮杵螺拔折罗等。及以素成。并不应陌。诸余药草根茎枝叶。及以子实。亦不应陌。亦不弃于不净之中。若乐成就真言法者。应诘难大乘正义。若闻菩萨甚深希有不思议行。应生谛信。不怀疑心。持真言者。不应与彼别持诵人。更相试验。若缘小过。亦不应作降伏之法。乐成就者。不应歌咏。共人调戏。又为严身。涂香庄饰。及带花鬘。亦不跳行。不应河中浮戏而乐其身。诸戏调笑皆不应作。三业不善。能不应作。所谓虚诳语。染污心语。离间和合。恶口骂詈。所作对答。不假多言。无益言谈。终不习学。亦复不与外道同住。及以难诘旃荼罗类。皆不与语。不应与于诸人谈话。唯除同伴。当念诵时。纵是同伴。亦不与语。持诵余时。自非所须。不与伴语。亦不以油涂身。又不应吃五辛慈葱萝卜油麻。及余一切诸菜茹米粉豆饼。并[饥-几+(廿/丞)]毕豆及油麻饼。并作团食。皆不应吃。一切毗那夜迦所爱之食。及供养残食。油麻粳豆粥。及以乳粥。皆不应食。一切车乘。若有因缘许乘车。骑乘不许及以鞍皆不乘骑。所被陌食。并被触食。一切严身之具。所谓镜花。并以粉药散盖。非因缘事。不应以手揩手。以脚揩脚。不应一切水中。及侧近水大小便利。不但以手承食而食。亦不用锤铜器食诸叶。不翻盛食。不应卧大小床榻。不得共人同卧。欲卧之时。安心寂静。清净而卧。不覆面卧。亦不仰卧。如师子王。右胁而卧。当卧之时。不得张目而睡。一日一食。不得再食。不应断食。不应多食。不应全少。于食有疑。不须食之。一切调戏。及多人丛聚。乃至女人。皆应入中。亦不得看。他身口意等所爱好房。及好饮食。皆不应乐着。应受恶房及恶饮食。皆不应弃。不应着紫色衣裳。及不应着故破之衣。及垢秽之衣。念诵之时。应着内衣。亦不自谦。有多愆犯。无由得成就悉地。复不可言宿世之业。身瘿诸疾。终应违阙。念诵之业。阿阇梨边所受真言。终不应弃。于其梦中。或于<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。有声告言。汝不应持是真言法。亦不舍弃。复不嗔彼。何以故。并是魔故。唯须精进。不应退转。心不恶思。攀缘诸境。纵放诸根。恒常护净。而念诵之。若求大成就。自所持真言。不应摄伏魍魉鬼魅。亦不应用护自他身。亦不救难。及禁诸毒。所持真言。诸余真言。亦不应作。所有随用真言真言。皆应頞频而作念诵。亦不共人竞斗效验。若欲求悉地。当须三时持诵。洗净之时。非但空水。和真言水。而洗净之持诵净水真言曰</p><p>唵[合*牛]贺囊(上)嚩啰(二合)嚩日[口*(隶-木+士)]儜(上)贺</p><p>澡浴之时。应用<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>遍身涂洗应用真言土。诵经七遍。土真言曰</p><p>唵嚩啰(二合)贺啰[合*牛]</p><p>水土之中。多有障难。毗那夜迦。先须发遣。然后用之。诵此真言。而趁遣出于水土中。遣障真言曰</p><p>囊(上)谟(上)嚩啰(引)也[合*牛]贺囊(上)广囊(上)莽他尾特瞢(二合)娑瑜瑳(去)啰也[打-丁+(姊-女)]吒(二合)</p><p>又先取水以手和搅。诵真言讫而用。洗浴真言曰</p><p>囊(上)谟(上)啰怛囊(二合上)怛啰(二合)夜也那(上)莽室战(二合)拏缚日啰(二合)簸儜(上)曳摩诃药乞沙(二合)细囊钵多(上)曳那(上)谟(上)嚩日啰(二合)句噜驮也钵啰(二合)若嚩(二合)里多儞(去)钵多(二合去)能(去)瑟吒咾(二合)得迦(二合)吒婆(上)也[王*风]啰嚩(去)也阿徙母(轻呼)娑啰嚩日啰钵啰输簸舍贺娑多(二合去)也怛儞也(二合)唵闇没[口*栗](二合)多军(去)拏里佉佉佉佉佉囊佉囊(上)佉囊佉囊(上)佉(去)那佉(去)那佉佉(去)那那佉呬佉(去)呬佉(去)呬佉呬底(丁以反下同)瑟吒(二合)底瑟吒(二合)贺贺囊囊(上)挪贺挪贺钵者钵者蘖 [口*栗](二合)恨儜蘖[口*栗]恨儜(二合)满驮满驮蘖啰若(二合)蘖啰若(二合)怛啰若(二合)怛啰若(二合)微娑铺(二合)吒也微娑铺(二合)吒也婆伽梵囊(上)没[口*栗](二合)多军拏里慕(引轻)啰弹难(二合)多(上)拏(上)也嚩日啰(二合)儜(上)萨啰嚩(二合)尾近近囊(上)微囊也剑(引)宁(上)嚩(去)啰也摩诃(去)言(上)儜(上)钵底饵尾旦多迦啰(去)也[合*牛][合*牛][打-丁+(姊-女)](二合)句[口*路]驮(引)囊(上)囊(二合上)曳娑嚩诃(去)</p><p>三遍用此真言水。随意洗浴。之时不应谈话。洗浴未已来。当须心念。次下心真言。浴时心真言曰</p><p>唵闇没(二合)帝[合*牛][打-丁+(姊-女)]吒(二合)</p><p>洗浴既了。应以两手掬水一掬。用前心真言。真言之经七遍用灌其顶。如是三度。应结顶发。亦诵真言经余七遍。当顶作发。若是<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。应以右手而作为拳。置于顶上。如前遍数。同结顶发真言曰</p><p>唵苏悉地羯哩莎(去)诃</p><p>次应洗手取水三度漱口。然后洗自本尊。用本真言。诵经七遍。诵漱口真言。遍身五处真言曰</p><p>唵枳里枳里嚩日啰(二合)[合*牛][打-丁+(姊-女)]吒(二合)</p><p>洗浴都了想浴本尊。复于其处。当诵所持真言。任诵多少。然后可往。常念诵处。乃至未到。彼所已来。应离一切贪痴等。随不善业。一心清净。敬想本尊。而徐徐往。坚持禁戒。如前所制。既到彼所。即应<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>。作诸法事。而念诵之。常治摩曼荼罗所。念诵疲困。当转读大乘经典。或作制多。诸余善事。常不废忘。应三时归依三宝。三度<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>。诸余罪业。三时发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。三时发愿愿成胜事。若如是作。速得成就。为除罪故。应常以香泥造俱胝像塔。<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>散花。赞叹供养。作诸善业。常行惠施。具大慈悲。于诸法教。不生悭吝。常怀忍辱精进。坚固不退。六念在心。所闻经典。谛思其义。常须转读。真言功能。常须供养。真言法经。依经善尽妙曼荼罗。应须念念发大菩提。先令谛信<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>僧入。次<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。次优婆塞。次优婆夷。随次第而入。并皆坚固。发菩提心。决定<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。既入曼荼罗毕已。应当授与。结手印法。及真言等。明藏法则。复应广为宣说。一切真言法则。或十四日。或月八日。及月尽日。或十一日十五日。如是日倍加。供养香花食等。一切供具。及以持诵。并作护摩。加持禁戒。常须忆念。倍加诸事。真言成就。作护摩时。常须以手。执持拔折罗。诵真言之经余千遍。办事金刚真言曰</p><p>唵度囊(上)嚩日啰贺</p><p>欲作办事诸业跋折罗者。应用天火。所烧之木。或苦练木。或取烧尸残火糟木。或紫檀木。随取一木。作跋折罗。应施三股。护摩之时。及念诵时。常以右手。而执持之。能成诸事。故号拔折罗。能成诸事。若执所有一切毗那夜迦。及余作障。悉皆恐怖。驰散而去。紫檀香涂。其拔折罗。置本尊前。所说真言。持诵花香。而供养之。其诸事业。金刚秘密。微细奇能。成就诸余事等。作诸事时。常须右臂手常以真言索继带。右手持珠索。以香臂。以香而涂。持诵真言。或一百遍。或一千遍。罥索真言曰</p><p>唵句兰达哩满驮满驮[合*牛]泮吒(半)</p><p>此明王大印号忙莽鸡。能成一切。明王真言。亦能增益。及能满足。真言字句。亦能成就。诸余法事。乃至护身。清净等事。非但是诸明王母。亦是金刚之母。若金刚部索用一呜噜(二合)捺啰(二合)又穿于索中心而作为结。准金刚部。作索之法。应知二部。用莲子等。而作为。结佛部索者。应用佛母真言。若莲花部索。应用半拏啰嚩斯泥真言曰(如前)带持此等索者。毗那夜迦不能为障。佛部索者。应用佛母真言。其真言号为佛眼真言如前若莲华部索。应用半拏罗嚩斯泥真言如前</p><p>带持此等索者毗那夜迦。不能为障。身得清净。速得成就。满所求愿。又作法时。当用茅草。而作指钏着于右手。无名指上。应当部三字。半心真言。或经百遍。或千遍。后安指上</p><p>佛部心真言曰</p><p>尔囊(一)尔迦(轻)</p><p>莲华部心真言曰</p><p>阿(去)路力迦(轻)</p><p>金刚部心真言曰</p><p>嚩啰地[口*勒](二合)迦(轻)</p><p>若供养之时。持诵之时。护摩之时。应着草钏。以着此草镮故。罪障除灭。手得清净。所作皆成。复取白[叠*毛]丝。及以麻缕。令童女染。而红色或郁金色。合令作线取结。为真言索。持诵七遍。而作一结。一一如是。乃至七结。置本尊前。以真言持经一千遍。或持诵时。及护摩时。欲卧之时。应以系腰。夜卧之时。不失精秽。故应须经。持索真言曰</p><p>唵贺啰贺啰满驮满驮讫啰(二合)驮罗尼(上)悉驮啰赞(二合)莎嚩诃(去)</p><p>念诵之时。及护摩时。须上下着衣。偏袒右肩。若以卧时洗净。及浴之时。不在此制。所著上衣应真言之若大小便。应着木履。若于本尊前。及和尚阿阇梨前。并余尊宿前。不应着之。于诸着之。于诸尊处。用身口意。而供养之。若乐悉地。速得成者。见制多。及以比丘。常应礼敬。若遇外天。形像之前。但应合掌。或诵伽他。若见尊者。亦应致礼。若闻妙法。深生敬信。若闻菩萨。不思议事。或闻真言所。成就诸事。皆应以欢喜心怀踊跃。若欲速成。常应精进。不生懈怠。如前所制。常须思念。若不如是。当违制戒。获大重罪。悉地不成。身等诸根。恒须护念。不应贪爱。复应常行。如前所制。不可废忘。若辰朝时。造诸恶业。至于暮间。即作忏悔。若于夜中。造诸恶业。至晨朝时。诚心忏悔。复须清净。念诵真言。及诸事等。如依本戒。应须如是。不应遣度。时日当于明王戒中。常须作意。不久住于悉地之中</p><p>苏悉地羯罗经供养华品第八</p><p>复次分别说三品法。扇底迦。补瑟征迦法。阿毗遮噜迦法。及余诸法。是为三品。三部各有三等真言。所谓圣者说。诸天说。诸地居天说。是为三部。圣者谓。佛菩萨声闻缘觉说者。是为圣者真言。诸天说者。从净居天。乃至三十三天。诸天所说。是为诸天真言。地居天说者。从夜叉罗刹。阿修罗龙。迦楼罗乾闼婆。紧那罗摩喉罗部多。卑舍遮。鸠槃茶等所说。是为地居天真言。若作扇底迦法者。应用圣者真言。若作补瑟征迦法者。应用诸天真言。若作阿毗遮噜迦法者。应用地居天真言若求上成就者。应用圣者真言。若求中成就者。应用诸天真言。若求下成就者。应用地居天真言。如是三部。各有三等成就。作三种法中。俱当等用。水陆所生诸种色华。名色差别。各依本部。善分别之。以真言华。当奉献之。发是愿言。此华清净。生处复净。我今奉献。愿垂纳受。当赐成就。献华真言曰</p><p>唵阿[可*欠]啰阿[可*欠]罗萨嚩苾地耶驮啰布尔底莎婆诃</p><p>用此真言。真言华三部供养。若献佛华。当用白华香者。而供养之。若献观音。应用水中所生白华。而供养之。若献金刚。应以种种香华。而供养之。若献地居天。随时所取。种种诸华。而供献之</p><p>应献华者。忙攞底华。簸吒罗华莲华。瞻卜迦华。龙蕊华。(以母)缚句蓝华。俱勿头华。婆罗树末利华。举亦迦华。破理迦华。句噜缚剑华。迦淡闻华。未度摈抳迦华。恒[口*栗]拏华。彦陀补湿波华。本曩言华。那缚忙里迦华。阿轮剑华。母注捃难华。那莽难华。注多曼折利通。九种不得。互用诸华。如作法时。求不得者。随所得华。亦通供养。若以华供献。应用当部华真言华献。若无华献。应用苏啰三枝叶。或莽噜闻华。滩敦叶。耽忙罗叶。讫[口*栗]瑟拏末利<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。忙睹捹ひ丁c章奕清纫丁戆嘏Oジ?&lt;爸钕阋└?O愎??取R嗤ü┭?K?蕉∠愣筟蔻-(敲-高)+女]。肉豆[蔻-(敲-高)+女]。甘蒱桃。诸香果等。亦通赞华。用供养之。若无如上华叶根果献者。曾闻献供养华。或自曾献华。随所应令运想供养。最为胜上供养尊法。虽有如前华果等献。若能至心虔恭合掌。顶奉供养本尊华果。如是心意供养。最上更无过者。常应作致。如是供养。勿怀疑惑。则得成就</p><p>苏悉地羯罗经涂香药品第九</p><p>复次今说三部涂香药法。随诸真言供养者。能成就众福。其香药名曰香附子。句吒曩吒青木香嚩落迦乌施啰舍哩嚩 [竺-二+梫]香沉香郁金香白檀香紫檀香嚩啰拏肥噜钵罗拏剑娑啰献(云五玄私)娑北[口*勒]迦钵持莽剑(云柏木)带啰钵[口*栗]抳迦利也剑(或五里而啰云里佛刷子)丁香<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>桂皮天木钵孕瞿阏乳难燥啰盆泥词细罗缚噜剑迦毕贪姥达啰讫啰母剑颇里迦[身*宁]囊里迦始嚩担臂苏嚩[口*栗]拏赊迦蓝忙睹掑炔⑵ざ嗬??℃兜玔口*栗]拏忙斯(云甘松香)那莽难莽噜闻毋罗计施肬(云水苏)忙罗本囊言医罗米夜杰啰曩却设痴罗嚩利嚩湿比迦但胡[廿/绥]儞阎设多补湿波(回香)诃[口*(肄-聿+(企-止+米))]蔬蹄草拏迦脚(白豆[蔻-(敲-高)+女])句蓝若(而夜反)底都以反云肉豆[蔻-(敲-高)+女]。颇罗诸罗。剑劫泮蓝娑缩儞阎地夜莽剑战荼都噜(苏合香)瑟剑钵罗娑但婆嚩计萨蓝等类。及胶汁。所谓龙脑香言陀罗娑娑遮啰娑安悉香薰陆香。设落翅势缚婆娑华勿勒刍殷罗华。迦宅[口*蓝]华。逮折那蓝华。摈抳剑华。优钵罗华。得檗[口*蓝]华。捃难华。迦罗末华等。于林邑兰若。水陆所生。如上等应须善知。三部三品等用华供养。用忙攞底华。得檗[口*蓝]华。捃难华。末理迦华。喻底迦华。那龙蕊华。如上等华。佛部供献。用优钵罗华。俱勿头华。莲华。婆罗树华。势破理罗闻底迦迦本那言华。得檗[口*蓝]华。如上等华。观音部中。供养为胜。用青莲华钵。孕衢华叶枝条。余不说者。等通金刚部中供献。如上华中。白色者作扇底迦法。黄色者作补瑟征迦法。紫色者作阿毗遮噜迦法。如是华中。味甘者作扇底迦法。味辛者作阿毗遮噜迦法。味淡者作补瑟征迦法。或有净处。所生枝华。或始生牙茅草。或小草华。或中树华。大树华。种种诸华。随类当用。其闇底苏末那华。唯通献佛。若红莲华。唯通献观音若青莲华。唯通献金刚。各说为上。佛部中作扇底迦法。用闇底苏末那华。作补瑟征迦法。用红莲华。作阿毗遮噜迦法。用青莲华余二部中。类此作之。上色香华。下色香华。随事分用。或华条或用堕华。以献天后。说为上胜。紫白二色。羯罗末罗华。用献忿怒尊主。及诸使者。说为上胜。向吒惹华。底落迦华。婆罗华。迦[口*栗][月*匿]迦罗华。阿娑曩拏噜莽华。尾螺华。迦侘[口*蓝]华等。随取真言一遍。通三障。而供养之。及上中下除灾等三。复以种种诸华。合成为鬘。或以种华聚。供养遍通九种。用诸华中。唯除臭华刺树生华。苦辛味华。不堪供养。前广列华。无名之者。亦不应用。又木茎华。计得剑华。阿地目得迦华。瞢句蓝华。佞簸华等。亦不应用。长时供养。通九种者。红华閦弭华。钵罗孕句华。[口*骨]路草等。及稻谷华。油麻相和供养。如上所说。种种华等供养。最为胜上。如无此类。诸华献者。但用白粳米。择简碎者。而供养。亦迦等及余有胶树香者。并随本部。善须合和。用诸草香根汁香华等。三物合和为涂香。佛部供养。又诸香树皮。及白旃檀香。沉水香。天木香。前香等类。并以香果。如前分别。合为涂香。莲华部用。又诸香草根华果叶等。和合为涂香。金刚部用。或有涂香。具诸根果。先人所合。香气胜者。亦通三部。或唯沉水香。和少龙脑香。以为涂香。佛部供养。或唯白檀香。和少龙脑香。以为涂香。莲华部用。或唯郁金香。和少龙脑香。以为涂香。金刚部用。又紫檀以为涂香通于一切金刚等用。肉豆[蔻-(敲-高)+ㄆ]脚白罗惹底苏末那。或湿沙蜜苏湿咩罗钵孕瞿等。以为涂香。用献一切如使者天。又甘松香。湿沙蜜肉豆[蔻-(敲-高)+女]。以为涂香。用献明王妃后。又白檀沉水郁金。以为涂香。用献明王。又诸香树皮。以为涂香。用献诸使者。又随所得香。以为涂者。献地居天。或单用沉水香。以为涂香。通于三部。九种法等。及明王妃一切处用。若有别作扇底迦法。用白色香。若补瑟征迦法。用黄色香。若阿毗遮噜迦法。用紫色无气之香。若欲成大悉地者。用前汁香。及以香果。若欲中悉地者。用坚木香及以华。若欲下悉地者。用根皮香华果。以为涂香。而供养之。和合香分不应用。于有情身。分香谓。甲麝紫钦等香。及以酒酢。或过分者。世所不应用供养之。又四种香。谓涂香末香颗香丸香。随用一香。尽坛为华。日别供养。欲献之时。誓如是言。此香芬馥如天妙香。清净护持。我今奉献。唯垂纳受。令愿圆满。涂香真言曰</p><p>阿[可*欠]罗阿[可*欠]罗(一)萨嚩苾地(二)耶驮罗(三)布尔羝莎嚩诃</p><p>诵此真言。涂香复诵。所持真言。净持如法。奉献于尊。若求诸香。而不能得。随取涂香。而真言之。复用本部涂香真言。香已奉献本尊</p><p>苏悉地羯罗经分别烧香品第十</p><p>复次令说三部烧香法。谓沉水白檀郁金香等。随其次第。而取供养。或三种香。和通三部。或取一香。随通部自列香名曰室唎吠瑟吒剑汁娑折(云沙罗膝)啰娑乾陀罗素香安悉香娑落翅香。龙脑香。薰陆香。语苫地夜日剑只哩惹蜜。诃梨勒砂糖香附子苏合香沉水香缚落剑白檀香紫檀香(五叶)松木香天木香。囊里迦钵哩闭攞缚乌施蓝石蜜甘松香及香果等。若欲成就三部真言法者。应合和香室唎吠瑟吒迦树汁香。遍通三部。及通献诸天。安悉香。通献药叉。薰陆香。通献诸天天女。娑折罗娑香。献地居天。娑落翅香。献女使者。乾陀罗娑香。献男使者。龙脑香。乾陀罗娑香。娑折啰娑香熏陆香。安悉香。萨落翅香。室唎吠瑟吒迦香。此七胶香。和以烧之。遍通九种。说此七香。最为胜上。胶香为上。坚木香为中。余华叶根等为下。苏合沉水郁金等香。和为第一。又加白檀砂糖。为第二香。又加安悉香。薰陆为第三香。如是三种和香。随用其一遍通诸事。又地居天等。及以护卫。应用萨折罗沙砂糖诃梨勒。以和为香。供养彼等。又有五香。所谓砂糖势丽翼迦萨折罗娑诃梨勒石蜜。和合为香。通于三部。一切事用。或有一香。遍通诸事。如上好香。众人所贵。妙和香。如无是香。随所得者。亦通三部。诸余事用。如上所说。合和香法。香法善须分别。应其所用。根叶华果。合时持献。又有四种香。应须知之。所谓<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>香。筹丸香。[分/鹿]末香。作丸香。亦须要知。应用之处。若扇底迦法。用筹丸香处。若阿毗遮卢迦法。用尘末香。若补瑟征迦法。用作丸香。摄通一切用。自性合筹丸香。置以砂糖和尘末香。树胶香。应用好蜜合和丸香。或以苏乳砂糖。及蜜和香。自性香上应着少苏如求当部所烧之香。若不得者。随所有香。先通当部。先诵此部香真言。香咒然后。诵所持真言。合和香法。不置甲麝紫钦等香。亦不应用。末儞也等。而和合香。亦不过分。致令恶气而无香气。以此林野。树香胶香。能转一切诸人意愿。诸天常食。我今将献。哀愍垂受。烧香真言阿[可*欠]罗阿[可*欠]罗萨嚩苾地耶驮罗布尔羝莎嚩诃</p><p>诵此真言。真言香须诵。所持真言。真言香烧。如法献故◎</p><p>◎</p><p>苏悉地羯罗经然灯法品第十一</p><p>复次当说三品然灯法。以依法故。令诸天仙。欢喜成就。以金以银。以熟铜。或以瓷瓦。而作灯盏。此五种中。随法取用。本神欢喜作。灯炷白[叠*毛]华作。或新[叠*毛]布作。或耨句罗树皮丝作。或新净布作用。用上香油。众所乐者。或用诸香苏油。其扇底迦法。用上香油。补瑟征迦法。用次香油。阿毗遮噜迦法。用下香油。若诸香木油扇底迦用。若油麻油。补瑟征迦用。若白芥子油。阿毗遮噜迦用。阿恒娑果油。真言妃后用。及诸女仙用。若诸果油。真言主用。若树果油。诸天用。及摩阿迦罗用若鱼脂。祀鬼用。若诸畜生脂。祀药叉用。若拔罗得鸡油。麻子油。祀下类天用。及四姊妹遮门荼等用。若寒林中起吠多罗者用。大肉脂诸油之中牦牛苏。上释通三部。又白牛苏。扇底迦用。黄牛苏。补瑟征迦用。乌牛苏。阿毗遮噜迦用。若有本部别。分别之亦依彼用。若诸药中所生油。补瑟征迦用。若诸香中所生油。扇底迦用。若恶香气油。阿毗遮噜迦用。如上略说灯法则。善自观之。纵此不说。当审用之。虽有灯油。不依部者。以本部真言。而真言之。亦通供养。灯能却障然净除昏。我今奉献。哀愍垂受。灯真言</p><p>唵阿路迦野阿路迦野萨缚苾地耶驮啰布儞羝莎缚诃</p><p>诵此真言已。次诵本持真言。而真言之。复作净法。除诸过故。如前品说。准持修故</p><p>苏悉地羯罗经献食品第十二</p><p>复次我说。应献食法。令诸天仙。悉皆欢喜。速得成就。略说献食。应用圆根长根。诸果苏饼油饼诸羹臛等。或种种粥。及诸饮食。此四种食。通献诸部。未惹布啰迦果。普通三部。又以石榴果。注那果。亦通三部。示其次第。各通一部。若味甘甜。扇底迦用。若味甘酢。补瑟征迦用。若味辛淡。阿毗遮噜迦用。若多罗树果。耶子果。尾罗果。儞跛罗果。及余臭果。众所不乐。亦不应献。或有上味果。世复多饶。而复最贵。献如此果。获上成就。或有诸果。其味次美。世复易求。价无所贵。献如此果。获中成就。或有诸果。其味苦辛淡等。世复丰足。价复最贱。献如此果。获下成就。若欲加意奉献应取女名。所谓柿子杏子桃子等果。以献女天。诸树生果。无苦味者。献真言妃后。室利泮罗果。通献三部。一切忿怒缚拏果。唯献一切药叉。劫比贪果。献室利天。钵夜攞树生果。献钵囇使迦。如是诸果。更有多种。诸有异名。随观其味。而用献之。或于村侧。或兰若清净处。有诸草根。其味甘美。取之奉献。亦得成就。征那唎根。通一切用。复有奇美味。草根枝叶。亦通奉献。非天神人中亦用。若山中所生。根美味者。佛部供献。又熟芋根。亦通佛部。又迦契噜剑根。征那唎缚也赐根。俱举知根。及余圆根。从水生者。莲华部用。又一切药圆根味。苦辛淡及多种生芋。金刚部用。又色白香味。极甘美。如是圆根。佛部供献。又色黄香味不太酸。亦不太甘。如是圆根。莲华部用。又赤色香味。苦辛淡。气臭不甘。如是圆根。金刚部用。如是三部。扇底迦法等。及上中下。并同通用略说。圆根善随其部。依上中下。而用献之。如是分别。速得成就。斯圆根长根生长。及所用如法类。如是[廿/公/心][廿/秝][廿/韭]根。及饼吐。极臭辛苦等。不应用献。莎悉底食。乌路比迦食。布波食。缚拏迦食。及余粉食。或作种种胡麻团食。或作种种白糖食。欢喜团食。莽度失食。毗拏迦食。傧抳拏句择迦食。阿输迦缚侈也食。捐室罗食。饼食。遏罗比瑟吒迦食。赊句杂也食。钵吒食。布剌拏食。莽沙布波食。征诺铎迦食。补沙缚多食。罗缚抳迦食。檗部迦啰迦食。俱矩知食。啰莽迦食。桁娑食。昔底迦食。钵[口*栗]香指里迦食。室利布罗迦食。吠瑟征迦食。嗔诺迦食。叱那罗迦食。遇拏补罗迦食。质但罗布波食。却若罗食。遇拏钵钵吒失[廿/陵]伽吒迦食。竭多食。种种檗侈傧拏布波食。啰若桁娑食。娑若迦食。竭[口*栗]多布罗迦食。劫谟征迦食。句娑里迦食。释句囊食。弭三补吒食。舍拏缚食。诃哩儜食囊食。种种钵罗抳[怡-台+孚][口*栗]瑟吒迦食。地比迦食。若罗诃悉底儞阎食。羯羯罗傧拏迦食。缚罗伽多食。缚底征迦食。吒乞湿底迦食。伽若羯哩抳迦食等。如上等。或用砂糖作。或以苏油。或以油麻和作。如其本部。随法而用。依法奉献。速得成就。米粉食。佛部作。扇底迦。及上成就。若一切麦[麦*丐]食。莲华部作。补瑟征迦。及中成就。若油麻豆子食。金刚部作。阿毗遮卢迦。及下成就等用。一切诸食味中。以白糖而所庄者。佛部之中。常当用献。若室利吠瑟吒迦食。莲华部用。若欢喜团食。金刚部用。若布波迦食药叉用。若女名食。真言妃后用。女名食者。剑谟里食。钵钵征食。是诸食中。最复美者。求上成就。而用奉献。如其次味。余二部用。此中不具。随所作食。八部等用。献食之时。先敷巾果叶。而为庄严。先置莎悉底迦食。路比迦食。布波食。如是先作。三部共用。复如本部。所须饮食。随力献之。以粳米饭。六十日熟。粳米饭。大麦乳饭。不种自生。粳米饭粟米饭。应须献者。作法献之。及诸香味。奇美羹臛。并诸豆臛。而奉献之。乳煮大麦饭。及不种自生粳米饭。求上成就。粳米及饭。六十日熟。粳米饭。求中成就。粟米及饭。求下成就。扇底迦法。为上成就。粟米及饭求下成就。扇底迦法。为上成就。粟米及饭。求下成就。扇底迦法为上成就。补瑟征迦法。为中成就。阿毗遮卢迦法。为下成就。供养饭食。根果饭粥。依上中下。而奉献之。扇底迦法。上佛部。补瑟征迦法。中莲华部。阿毗遮噜迦法。下金刚部。最上悉地。及与中下。善须依法。随类应知。羹臛之中。味甘甜者。扇底迦用。味酢甜者。补瑟征迦法用。味苦辛淡者。阿毗遮噜迦用。乳粥扇底迦用。石榴粥酪粥等。补瑟征迦用。讫娑啰粥。谓胡麻粳米豆子等。阿毗遮噜迦用。如前各说。诸食味等。或随方所种种有异。观上中下。而奉献之。或有诸味。众所称赞。或自爱者。应持献佛。或有本部真言所说。献食次第。宜当依之。若异彼者。不得成就。食中显者。及以恶香。金刚部用。前说涂香灯食等。各依本部。扇底迦等。当品依之。观真言性。为喜为怒</p><p>次复观之。然成何等事。复细寻察。满何等愿。既观知已。前所献食。随力献之。于献法中。见有用。迦弭迦食者。应献莎悉底食。乌路比迦食及余力所办食。沙糖酪饭根果乳粥等是也。此迦弭迦食。通献一切。唯除阿毗遮噜迦。于献法中。见有用。征质睹路食者。应以迦弭迦食中。加三两种。上异饮食是也。于献法中。见有乌肥噜食者。以前迦弭迦食。倍加多置是也。于献法中。见有用三白食者。应以乳酪苏饭是也。复见有三甜食者。苏蜜乳饭是也。于献法中。见有萨缚薄底迦食者。娑也里迦食。陵只里迦食。薝没梨耶食。底罗比瑟吒剑食。酪饭根果。于一前所说。食中随取一两。味置之。稻谷华诸华及叶。盛以大器。置水满中。远持诵处。而弃是也。于献法中。见有扇底迦食者。当用莎悉底乳。粥稻谷华苏蜜乳。及乳煎大麦饭征若布罗等食。决然除灾。无怀疑也。于献法中。见有补瑟征迦食者。应用酪饭酪粥欢喜团。乌路比迦沙糖。室唎吠瑟吒迦等食。决能满愿。无怀疑也。于献法中。见有阿毗遮卢迦食者。应用赤粳米饭。或用句捺啰嚩子。或染作赤色饭。或油麻饼娑布跛迦薝没梨也讫娑罗粥等。决能降魔无疑也。若持药叉真言无献食法者。应依此法。而奉献之。当用赤粳米饭。根果蜜水。及蜜沙糖米粉饼等是也。持女天真言等。应献羹饭。豆子臛等。诸甜浆水。钵啰拏钵哩瑟吒迦缶叶味等。及诸果子。一切女天应献是食也。欲求上成就。本部献法者。应依此献。有诸饮食。根果香等。众所共谈。其味美者。多而复贵。如此上味。求上成就。而奉献之。如上略说。诸献食法。各随本部。所求事法。皆已略陈。或于余方。饮食味异。观其色味。随类献之。欲献食时。先净涂地。香水遍洒。净洗诸叶。复以莲叶钵罗势叶。诸乳树叶。或新[叠*毛]布等。敷说其上。复下诸肴饍。依用此叶。扇底迦用。水生诸叶。及余奇树叶等。或芭蕉等。又补瑟征迦用。拔罗得计树叶。阏伽树叶。或随时得者。又阿毗遮噜迦用。雌树名叶。谓芭蕉始生叶。或莲叶及苦树叶等。又女仙真言用。钵隶迦使干树叶。又地居天等。以草用之。求上中下法。善须知解。先涂洒地。复敷诸叶。当净洗手。漱口咽水。次须下食。先下沙悉底迦食。次下圆根长根果。次下诸粥。次下羹臛。次下乳酪。随本法。依此下之。若作曼荼罗。及拟成就诸事。得诸境界者。应当倍加。奉献清净饮食。华果等类。初持诵时。随其所办。随所得味。依彼本法。而奉献之。若白黑二月八日。十四日十五日。日月蚀时。地动时。广加供养。若护摩时。所须之物。先办置于本尊主前。若持诵人。每欲食时。先出分食。亦同致尊前。如先作护摩。而后食者。应预作食。而出置之。先设供养。所办食已。然后应当。起首念诵。献诸华药。及诸饮食。常须念之。不应废忘。仍依本法。若言一时念诵。一时供养。诸根果食。若言二时念诵。二时供养。若言三时念诵。三时供养。如是依法。当速成就。持诵之人。不献饮食。违本部者。其人乃着。魔障身无精光。风燥饥渴。恒恶思想。不能成就。本尊真言。皆由不献。本尊果食。应当依前。白黑二月等。广设供养。奉献本尊。并诸眷属。初持诵时。于前等日。作扇底迦食。远持诵处。四方弃之。于此不说。或本部不通。纵有所通。以诸下味。而求上成。及所制食。臭恶之类。皆不应用。常献酪饭。其诸部中。求上中下。扇底迦等。并通诸天真言等者。应如是供养。若无本所制食。随其所得。以本部真言。而真言之。此药香美。堪本尊主。我今奉献。垂哀愍受。治食真言曰</p><p>阿[可*欠]罗阿[可*欠]罗萨缚苾地耶驮罗布尔羝莎缚诃</p><p>此真言遍通三部。真言食后。诵所持真言食。而奉献之◎</p><p>苏悉地羯罗经卷上</p><p>苏悉地羯罗经 卷中 (此卷首元落却三品)</p><p>唐天竺三藏输波伽罗译</p><p>◎分别成就品第十六</p><p>我今复说三部悉地成就。乘空自在而进。此为最上。藏形隐迹为中成就。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>诸事三种成就。随上中下。更分别之。三部上成就。法得持明仙。乘空游行成就五通。又多种成。或得诸漏断尽。或得辟支佛地。或证菩萨位地。或知解一切事。或辩才多闻。或成吠跢罗尸。或成药叉尼。或得真陀摩尼。或得无尽伏藏具上等事。名上中上成就之法。三部中成就法。藏迹于身。得大势力。先来懈怠。而得精进勤入修罗宫。得长寿药。成钵[口*(肄-聿+(企-止+米))]。史迦天使。或能使鬼。或能成就娑罗坌尔迦树神。或成多闻未经所闻悟深义理。或合药或才涂足顶。即远所涉无有疲乏。如上所说。悉名上成就之法。三部下成就法。令众喜见。或摄伏众人。或能征罚恶人。降诸怨众。及余下事。名下中下成就之法。若欲成就药物等者。有三种成。光焰为上。烟气为中。熅暖为下。复次圣者真言。为上成就。诸天所说。为中成就。世天真言。为下成就。复次佛部真言。为上悉地。莲华部真言。为中悉地。金刚部真言。为下悉地。若欲以上真言。欲求下成就者。得下成就。或以下真言。祈求上者。得上成就。或以中真言。成上下者。亦等成就。真言之中。具此<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>。当知即悉上中下分。能成大果。谓令成满。辟支佛位。谓令成满。菩萨十地。乃至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。为大<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。复成大德。行谓多诸眷属。前后围绕。满如是愿者。为大德行。复能久住位。谓得王处。转轮王处。长寿仙处。满如是愿者。为久住。形仪广大。威光远照。教修广大。具此四德者。虽是下品真言。能成上品。若上品中。不具此德。虽是上品真言。下品用也。诸佛菩萨所说真言。如是转次。多佛菩萨所说之者。虽属下品。亦能成就。上品等事。或尊等所说真言之中。唯具一事者。谓扇底迦法。补瑟置迦法。阿毗遮嚧迦法。虽具一事。于中各有上中下品。岂有下品真言。能成上事。犹若青泥。出妙莲华。固无疑也。岂有上品慈善真言。能成忿怒下品成就。如白檀木其性清凉。若风击相揩。自然火起。非无因缘也。如是差互。虽非次第。诸余悉地。皆物疑虑。身分悉地为上品成。诸药悉地品为中成。富饶悉地。为下品成。若复有人。久至持诵。下品真言。纵自无力。于本尊边转求。上品自成。若于上品真言之中。心怀犹豫。念持供养。复不精诚。虽于上品真言。由彼诵念心轻。致招下品成就。故知持诵皆由心意。且如诸天之中。亦有贫者。诸鬼部内。亦有富强。此彼知然。真言亦尔。一一真言。皆具三悉地。谓上中下。诚心念诵。皆获悉地</p><p>苏悉地羯罗经奉请品第十七</p><p>复次若欲入本尊室。先睹尊颜。合十指爪。当小低头。复次器盛。净水随所作事。置本献花。复置涂香。依于本法。而作阏伽。烧香熏之。应诵真言。阏伽七遍。则当奉请。已依法供养。盛阏伽器。当用金或用铜。或以石作。或以土木。或取螺作。或用束底。或用荷叶。以缀作器。或乳树叶。如上所说。阏伽器等。当用之时。须知次第。若扇底迦。当用白器。补瑟征迦。当用黄器。阿毗遮卢迦。当用黑器。作上中下悉地。成就类前。所说应可用之作。扇底迦所。用阏伽置少小麦。补瑟置迦。应着胡麻。阿毗遮噜迦。当致粟末。又扇底迦置乳。补瑟置迦置酪。阿毗噜迦。应置牛尿。或着自血。遍通用者。应着稻华涂香。及华胡麻茅草环。用熟铜器。盛以阏伽。若无此器。随所得者。亦遍通用。请召之时。应用当部明王真言。及慕捺罗。若有本法已说请召真言。应当取用。无取别者。先请当部。尊次请明王妃三部之中。皆应如是本法。若无请召真言。应用明王等真言而请召之。本法虽说请召真言是下。岂合请于部主。若以本法真言请召。当速成就。不应生难也。本法若有请召真言。及发遣者。当请之时。此真言主。至部主所请云。今有某甲。为某事奉请。若发遣时。亦复如是。所作事已。愿尊证知。随意而去。明王妃真言。用请女仙等。明王真言。请诸真言主。或有真言主。不受明王真言所请。要以明王妃真言。然可依请。如别部说。致阏伽时。应诵真言。大者一遍。中者三遍。下者七遍。极小者二十一遍。如上所说。阏伽法则。先两膝着地。应须手着净茅草环。捧阏伽。烧香薰之。作如是请。仰惟尊者。以本愿故。降赴道场。愿垂哀愍。受此阏伽。及微献供。有真言主。名曰独胜。奇加忿怒。不受诸余真言。召请用彼所说真言。然降所请。彼诸眷属。亦不受于余真言请。不应用彼眷属真言而请召之。但缘用心真言。或说根本。或明王妃所说真言。而用请召。部心真言。遍通三部。彼请召。当应降赴。加医醯字。此更秘密。速满其愿。当请之时。诚心作礼。再三启白。大慈悲者。请依本愿。来降道场。若不诚心。徒多念诵。乃至真言。亦皆殷勤。以两手捧阏伽器。顶戴供养。为上悉地。置于心间。为中悉地。置于脐间。为下悉地。先观本尊画像。其像若立。持咒之人。亦应立请。画像若坐。亦应坐请。又观彼像。曲躬立势。亦应学之而奉请之。当请之时。先观本尊所止之方。而面彼请。然便回身。置阏伽于尊像前。复有秘观。所作扇底迦等诸余方所。而请召之。或于余时。得诸华果。称本尊意。应须奉请。然可献之。当请之时。合手爪指。随于本方。但至诚心奉请。或以两手捧诸阏伽器。而请召之。然后敷献。所得之物。若欲成就上中下事及扇底迦第。皆须加以真言及慕捺啰而作请召。作成诸事等。或有障起。或魔与娆。或病者加。当尔之时。事缘既速。不可当待办阏伽器。便即用心。启请本尊。作除遣法。如上所说。随其大小。拟欲成就。阏伽请之。急难等之事。诚心请之。若复有人。欲得归仰诸部尊者。应当常作召请法则。持诵之人。速得成就</p><p>苏悉地羯罗经供养品第十八</p><p>复次奉请尊已欲依部类或诸事业。观其大小。依法则而供养之。既奉请已。作如是言。善来尊者。愍我等故。降临道场。复垂哀愍。当就此座。坐受微献供。复起诚心。频兴作礼。而白尊言。大悲垂愍。成本愿故。而见降临。非我所能。启请本尊。如是三时。皆应依此。如前已说。应须办供。先献涂香。次施华等。复献烧香。次献饮食。次乃然灯。如其次第。用忿怒王真言。此等供物。悉令清净。善悦人心。各用本色真言而真言。献涂香已。各列其名。如依前说。即奉阏伽。如是华香。及饮食等。皆亦准此。若涂香烧香华及饮食。无可献者。但诵本色真言。及此手印。以此献之。表云。供物无可求得。但纳真心。后作阏伽。以真心故。速满其愿。离此之外。有四供养。遍通诸部。一切处用。一谓合掌。二以阏伽。三用真言。及慕捺罗。四但运心。此善品中。随力应作。或复长时供养中。置无过运。心如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。说诸法行。中心为其首。若能摽心。而供养者。满一切愿。若成就诸余事者。应当发遣。诸为障者。若不遣除后。恐伤及所以。先须作遣除法。诵忿怒真言。或用当部。成就诸事真言。遣除障已。次应诵本部尊真言。而真言水。遍请护摩及轮手印</p><p>佛部请火天真言</p><p>[盍*欠]写合写.縳[可*欠]曩野莎嚩诃</p><p>诵此真言三遍。请召火天烧食供养</p><p>护摩真言</p><p>唵.阿那曳.[盍*欠]写合.缚[可*欠]曩野.揖(奴立反)比揖比.儞跛野.莎缚诃</p><p>次持牛苏。以此真言。一真言一烧。满于三遍。供养火天</p><p>金刚部忿怒金刚真言</p><p>唵.枳里枳里.跋日罗.矩噜驮.吽[打-丁+市]</p><p>以此真言。一真言食一烧。火食作法。除遣地中。作诸障者。又此真言。或同部尊遍洒华等。复用吉利枳罗忿怒真言。并印当诵真言。左手作印。遍印涂香烧香饮食华等。作净除秽。为自身净故。应以右手。掬持香水。目观香水。诵心真言。灌自身顶。作净除秽。复用一切事真言。并忿怒真言。为净座故。真言香水。洒洁于座。又诵七遍。洒地方界。能除诸秽。而得清净。吉利枳罗真言</p><p>唵.枳里枳里.跋日罗.跋日里.部讷畔陀畔驮虎吽泮</p><p>此上真言.护地方讫。结虚空界。应同次下苏悉地真言。烧香执持。当诵真言。馚馥空中。除诸秽恶。便得清净。苏悉地真言</p><p>唵.素悉地迦履.入缚里亸难那.牟谟罗亸曳.入缚啰入缚攞.畔[马*半]驮.[可*欠]那[可*欠]那.虎吽柹</p><p>此金刚部苏悉地真言。遍通诸事。结空界用佛部结空界真言</p><p>唵.入缚攞虎吽</p><p>此佛部结空界真言。唯通当部。莲华部结空界真言</p><p>唵.钵头弭儞.皤伽缚底慕[可*欠]野暮[可*欠]野.若蘖暮[可*欠][宁*页]莎缚诃</p><p>此莲华部结空界真言。唯当部。次应当用部心。真言香水散洒诸方。复以明王根本真言。或心真言。或真言王使者心真言。随取其一。用结方界。或以此诸心真言。而作结界。所结之处。如置垣墙。当部仙天。常当护卫。无能作障。若诸部事。有为法者。应依<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。军荼利法。而除遣之。又有五种护卫法则。常于道场室内作之。谓金刚墙。金刚城。金刚撅。忿怒吉利枳罗。忿怒甘露军荼利。部母金刚墙真言</p><p>唵.縒啰縒啰.跋日罗.跋罗迦罗.虎吽柹</p><p>金刚城真言</p><p>唵.弭塞普啰.捺啰讫洒.跋日啰.半惹罗.虎吽泮</p><p>金刚撅真言</p><p>唵.吠日啰枳罗虎吽泮</p><p>忿怒吉利枳罗真言</p><p>唵.枳里枳里.跋日罗.虎[合*牛]泮</p><p>忿怒甘露军荼利真言</p><p>怛罗那野.那谟跋日罗矩噜驮野.摩诃缚攞。跋罗讫啰摩野.菩嚩弭[起-巳+乞]那.毗那舍曩耶.唵.虎噜虎噜底瑟他.底瑟他.畔驮畔驮.[可*欠]那[可*欠]那.阿蜜[口*栗]羝.虎吽柹</p><p>若本法中。有如是等金刚墙真言。应重结之。诸事既了。次应持诵。持诵之时。先诵当部母</p><p>真言佛部母真言</p><p>入缚啰.底瑟佗.悉驮路者泥.萨缚刺詑娑驮[宁*页].莎缚诃</p><p>莲华部母真言</p><p>唵.迦制.弭迦制.迦戆.迦制.迦[糸*奓].弭迦[糸*奓].迦戆迦制.皤伽缚底弭惹曳.莎缚诃</p><p>金刚部母真言</p><p>那谟.露迦驮室利曳.那莫.商迦[肄-聿+(入/米)].扇底迦[肄-聿+(入/米)].屈[糸*奓]屈屈.屈抳伽亸野屈置掘莎缚诃</p><p>先诵此母真言。能卫本尊。能蠲众罪。除诸灾障。与悉地门。而得相应。但诵佛部忙莽鸡真言。亦通二部。初后持诵。诸天增卫。若于本法而已说者。持诵之时。先念此者。应随本法而念诵之。或于本法有独胜真言。亦应先诵。无繁别者。如上所说。供养次第。乃至除秽。护净结界。一切等事。初持诵时。及作法时。扇底迦等。所作事时。皆应作之。若以本部尊主真言。或以本部心真言。或以一切真言王真言。或以苏悉地法王真言。或以一切事真言。此五种真言。三部遍有。随作诸事。各于本部。应取其一。而用作之。所谓自护。及护同伴。请召洒水。洁净结界。以法相活。其言不具。为增力故。为治罚真言故。为发觉故。及余诸事。所不述者。亦以当部母五真言中。随取其一。而以用之。当得悉地部心真言。能护本尊。及护己身。护身之时。应诵三遍。或复七遍。结其顶发。而作一髻。若出家人。结<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>角。或结线索。持系护身。或真言头指遍点五处。亦成护身。所谓顶额两膊咽下心上。或以牛黄。或白芥子。或阏伽水。随取其一。而用护身。若阿毗遮噜迦法。应用部尊主真言。而真言而护自身。若作扇底迦法。应用忿怒金刚真言护之。若作补瑟征迦法。应用部尊主真言。及忿怒金刚真言。兼而护之。若真言主现时。持诵人怖者。应用部尊主用护自身。但作诸事之时。常用二真言。而护自身。为部尊主。及忿怒真言。念诵了时。应当发遣。发遣之时。护彼真言主。或部尊主真言。或用部母。或以部心。亦护自身。而作随意。若于秽处。不净等处。缘事须往。先诵乌抠沙摩真言。作印印持五处。任意而往。仍须常诵真言。不得废忘。澡浴之。先诵伏部真言护身。乃至浴了。不应废忘。伏部真言者。忿怒甘露军荼利也。吃食之时。用部尊主真言。护身念持。欲卧之时。用部母真言护身。若作诸法。遂乃忘作。护持法则。令使魔兴。欲除魔故。速应诵持。当部明王真言。将护自身。一切魔部。不得其便。如上备作。护身结界。及余法已。然后摄心。安庠念诵。念诵之人。所坐之座。以青茅草。而作其座。座高四指。阔二磔手。长十六指。如此之座。初念诵时。及持诵时。皆应受用。或用迦势草。或用余青草等。或随部法。取乳树木。最为要妙。用作床座。量亦如上。而净刬治。或用诸叶。或以枝茎。如上而制。随亲事法。取枝叶用为座座。上结加趺坐。作扇底迦上成就法。中加趺坐。作补瑟征迦中成就法。垂两足坐。作阿毗遮噜迦下成就法。供养既了。应起诚心。赞叹于佛。次法次僧。次叹观自在。次叹明王。大威金刚伽陀曰</p><p>大慈救世尊善导一切众</p><p>福持功德海我今稽首礼</p><p>真如舍摩法能净贪嗔毒</p><p>善除诸恶趣我今稽首礼</p><p>得法<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>僧善住诸学地</p><p>胜上福德因我今稽首礼</p><p>大<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>自在一切佛赞叹</p><p>能生种种福我今稽首礼</p><p>大力忿怒身善哉明持王</p><p>降伏难伏者我今稽首礼</p><p>作是虔诚。赞佛菩萨。又复合掌。起殷重心。赞余诸佛菩萨。相好功德。其赞叹文。应用诸佛菩萨所说叹偈。不应自作。赞叹既已。起至诚心。忏悔诸罪。我归命十方世界诸佛世尊罗汉圣僧。及诸菩萨。证知我等。自从过去。及以今生<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>覆心。久流<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。贪嗔痴覆。造诸恶业。或于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>菩萨圣僧父母尊处。一切众生有德无德。于如立处。所造诸恶一切罪业。自作教他见作<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。身口意业。广聚诸罪。今对诸佛菩萨。志心忏悔。所造众罪。如诸佛知。并皆忏悔。起志诚心。尽形归命佛法僧宝。涅槃正路。为除众生一切苦故。归命三宝。如是归依。头顶礼已。欢喜踊跃。发菩提心。求于胜上。解脱甘露。悉地<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。世间众生。无量诸苦。我当救度。令离恶趣。除诸烦恼。令得解脱。所有众苦。种种煎迫。今起大悲。发菩提心。为众生而归依。无主众生为作归主。失路众生为作导师。恐怖众生为作无畏。苦恼众生得安乐故。众生烦恼我为除灭。我从过现未来。所发胜事心。修诸善业。<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。一切功德。尽皆回向。施一切众生。归于正路。同升妙果。速成佛道。乃至菩提。不生懈怠发菩提心。悲念众生。起大慈心。彼有众苦。何时除灭。为净心故。常持六念。心注一境。而不散乱。不应<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。又如过现诸佛发愿。应如发愿。生诸净业。愿与众生。成就诸德。复愿过现。所生功德。愿与一切众生。获无尽财。复能舍施。增益智慧。成大忍辱。常修善品。识<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智。心怀大悲。愿诸生类。所生之处。具如上事。次应合掌。顶礼本部。尊主忆念明王。次依法则。作诸事业。先以右手。而取数珠。置左手中。合掌捧之。思念明王。数珠而诵真言</p><p>佛部净珠真言</p><p>唵遏部[羊*旦]弭惹曳悉睇悉驮剌柹莎缚诃</p><p>莲华部净珠真言</p><p>唵阿蜜栗[言*当]伽迷室唎曳室利摩里抳莎缚诃</p><p>金刚部净珠真言</p><p>唵枳里枳里涝[目*匿][口*履]莎缚诃</p><p>以右手大指。捻无名指头。直舒中指。小指微屈。以头指押中指上节侧。左手亦然。右手掏<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>。通一切用。若阿毗遮噜迦。竖其母指。捻数珠。印菩提子珠。佛部用莲华子珠。观音部用噜挪啰叉子珠。金刚用三部各用。此等数珠。最为胜上。一切念诵。应当执持。或用木槵子。或多罗树子。或用土珠。或用螺珠。或用水精。或用真珠。或用牙珠或用赤珠。或诸摩尼珠。或用咽珠。或余草子。各随于部观色类。应取念持。若作阿毗遮迦法。应用诸首。而作数珠速成故。复为护持增验故</p><p>佛部持珠真言</p><p>唵那谟皤伽缚底悉[月*悉]悉[月*悉]娑驮野悉驮剌柹莎缚诃</p><p>莲华部持珠真言</p><p>唵素么底底室唎曳钵头么理抳莎缚诃</p><p>金刚部持珠真言</p><p>唵跋日罗尔旦惹曳莎缚诃</p><p>用前件珠印。各依部中。而念诵之。念诵之时。珠置当心。不得高下。捧数珠时。微小低头。以至诚心。顶礼三宝。次八大菩萨。次礼明王眷属。次应持诵真言。想真言如对目前。如是倾诚。不应散乱心缘别境。但诸真言。初有唵字。及囊塞迦蓝字者。应静心中。作扇底迦念诵。补瑟征迦念诵。皆应缓诵。或心念诵。或有真言。后有[合*牛]柹吒字者。当知皆应杀作急声。作阿毗遮噜念诵。及余忿怒念诵。三部真言。应看字数多少。字有十五。应诵十五落叉。遍字有三十二者。应诵三落叉。过此数者。应诵十千遍已上。初诵之时。满如上数。观其部类。或上中下。或三种事。或观圣者。说为天所说。为地居天所说。细观部类。当诵持之。乃至成就如是初诵。若不先诵。遍满念持。所求下法。尚不得成。况求上中。悉地成就。以是义故。作胜上心。而先念诵。但诸真言。初持诵时。已如前说。诵持遍数。分为十分。然后念诵。既满祈请真言主悉地因缘。初而<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>貌。复从头作第二第三祈请。若有相貌。即当依法念诵真言。若无境界。弃不应诵。祈请法则。与请召法同。祈请之时。于其梦中。见真言主。背面而去。或不与语。当应更须。起首念诵。如是再三。若于梦中。见真言主与语。当知此人不久成就。若无境界。不应诵持。若强念持。恐与人祸。初持诵时。于净密处。起首诵持。从初日诵持。乃至疲极。遍数多少。一须依定。不应加减。先说三时念诵法者。昼初分后分。于此二时。应当持诵。中分之时。如以澡浴。造诸善业。于夜三时。亦同于上。中分之间。消息之事。于夜中时。持诵作阿毗遮噜迦法。安坦驮囊法。起来多罗法。于夜分作说为胜上。若昼念诵。夜作护摩。若夜持诵。昼作护摩。多具诸药。念诵之前。而作护摩。持诵了后。复作护摩。若能如是。最为其上。如前先出。所说团食。应作护摩。无问前后。恒依此法。念诵护摩。或于法中。但作护摩。而得成者。当知亦须念诵真言。若如是者。诸明欢喜。法验易成。持诵之人。不生嗔怒。不求欲乐。不应自下。伴不勤劳苦生怨。不过勤求。不生轻慢。念诵之时。不作异语。身虽疲极。不纵放之。制诸恶气。世间谈话。皆不思念。不舍本尊。纵见奇相。而不怪之。念诵之时。亦不分别。种种之相。持诵了时。应诵部尊主真言。或诵部母真言。诵此真言。当得卫护。无违部法。依于本法念诵了。或过本数。亦无所畏。应起诚心。作祈请云。我依本法。念诵数满。唯愿尊者。领受为证。于其梦中。为授教诲。<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>诵时。若有謦欬。昏徊欠去。忌真言字。即起就水。作<a href=\"/remen/sajing.html\" class=\"keylink\" target=\"_blank\">洒净</a>法。纵掏数珠。欠一欲匝。有斯病至。洒净已。还从首念。被所障隔。为须一一皆从始。念念掏数珠。将毕之时。申礼一拜。终而复始。又申一礼。于画像前。或于塔前。或于座所。随念诵处。数珠一匝。一睹尊颜。而作一礼。念诵了已。安心净虑。或想真言。及其尊主。三时念诵。但初中后夜。诚心作意。遍数多少。皆一例一类。不增不减。三时澡浴。三时涂地。献华香水。种种供养。除去萎华应具三衣。又内衣一日三时。浣濯其衣干燥。香熏洒净。一一时中随听作一。别置睡衣及以澡衣。于此二时。替换内衣。日别一洗其衣干燥。听以熏洒。献尊钵器。三时洗挑。既除萎华。续致新者。三时常诵大乘<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>等经。及作制多涂曼荼罗。先诵承事真言既了。请祈未得。于中不废阙。一时二时乃至一曏。应当念诵。不得间断。若魔障者。病瘿身心。则不精诚。便常放逸。身心疲劳。违于时节。不依法则。或时不浴。作持念诵。及以护摩。不应作数。摄心用行。依法念诵。其此数者。应记为数。作护摩时。念诵之时。请召之时。此三事中。所有真言遍数。一一皆须依法满数。纵欲数满。欠一未了。而有障起。更从头数。若不依法。作皆不成。若有依作曼荼罗时。或日月蚀时。于此二时。加法念诵。其福增高。不久成就。无有疑也。若于八大灵塔。或于过去诸佛菩萨行处。最为胜上。或于正月十五日时。亦为胜时。或于师主处。受真言先经承事。便当念时。不久速成。于梦中见真言主。而指授者。依彼法则。亦速成就彼念诵人。供养僧伽处所尊胜。或当时分加精诚。其数未满。唯此胜故。真言主悦而赐成就。当知此法悉地。虽速不久。当坏以是义故。先承事了。而所得者。说为坚固。先承事时。应当广供养。于日月蚀时。八日十五日。复加献供。诸神仙众。如余部说前等日。加诸事业。斋戒等事。是日复加献供。本明真言主。瓶盛香水。插垂华枝。或取阏伽器。用甘露军荼利真言之。自灌其顶。能除魔障。或于其日。献诸饮食。涂曼荼罗。及以护摩。然灯等供。并须加之。或有法中。但说持诵。自然验见者。前所[怡-台+贞]像舍利塔等。忽然摇动。或光焰出。当知不久速得成就。得成就时。有何相貌。所谓身轻病苦永除。增益胜慧。以无畏。身威光现建。夜梦常见清净实事。心恒安泰。于诵念时。及诸事业。不生疲倦。身出奇于惠施。钦敬尊德。于真言主。应生敬仰。成就之时。如现上事。当知即是成就相貌。先承事了。依于法则。供养本尊。应加献供。及以护摩。先承事法。依数既了。次应复作。悉地念诵。复先求愿。于其梦中。而希境界。作先承事法。则所念诵处作悉地念诵。不应移处。有诸难事。依前念诵。应作持罚。取部主尊真言。诵一千遍。或时念诵。本持真言。经十万遍。若离此者。还如前说。知作承事。正念诵时。忽然错误。诵余真言。既知错误。诚心忏悔过。由于逸故。致斯误。愿尊舍过。便申顶礼。复须从始。而念诵之。忽于秽处。心放逸故。诵本真言。便<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>已。应须治罚。至持诵处。诵部尊主真言七遍。半月一日不食。次服五净真言。经百八遍。然后服之。服此五净。半月之中所食。秽恶之食。当得清净。真言增力</p><p>佛部五净真言曰</p><p>那谟皤伽缚底乌瑟腻沙野弭秫睇弭罗制始米扇底伽[口*履]莎缚诃</p><p>莲华部五净真言曰</p><p>那谟剌怛那怛啰耶野那莫阿利耶缚嚧枳底湿缚啰耶菩提萨埵野摩诃迦噜抳迦耶唵野输制娑婆诃</p><p>金刚部五净真言</p><p>那谟剌怛那怛啰耶野那谟室战拏跋日啰播拏曳摩诃药麧洒拪那播亸曳</p><p>唵始弃始弃[目*匿]么黎钵罗[月*坒] 钵罗皤莎缚黎谛制谛饶缚底钵罗皤缚底莎缚诃</p><p>取黄牛乳酪苏粪尿。各别真言。经百八遍。和置一处。复百八遍。以波罗舍中盛之。或诸乳树叶。或阏伽器。以茅草搅。诵真言经百八遍。后面向东。蹲踞而坐。顿服三合。如是度如药合升合。当服之时。不应致语。念诵之时。像现声语。先应简敌。即诵部尊主真言及印。若是魔作。自然而退。或出语言。与本法异。当知魔作。或出语言。劝作恶事亦魔作。若见恶梦。即须先诵部母真言。经一百八遍。若不先诵。部母真言。不可念诵。若念诵时。其数减少。不应休止。若增无过。如上所说。念诵次第。皆须依之。若异此法。欲求悉地。不可得也◎</p><p>◎</p><p>苏悉地羯罗经光显品第十九</p><p>复次今说增益神威。令使欢喜。所持真言。而速成就。先具香水。澡浴身手。于上时日。加诸供养。复取苏摩那华。一百八枚。取一一华。诵真言经二十一遍。或经七遍。或时三遍。先观真言。字数多少。而念诵之。奉献本尊。次献涂香。及以烧香。奇香气者。复献饮食。如先陈说。加以沙糖及酪。复作护摩。烧木一百八撅木不过量。次用乳酪和蜜护摩一百八遍。次用苏酪和粳米饭百八遍。而作护摩。此三护摩。经三七日。或复五日。或复三日。此三日既了。应取乳粥。和以牛苏。一百八遍。复作护摩。此既终取阏伽器。诵以真言。经一百八遍。倾致少水。而作护摩。作此等法。真言增威。谓异真言。截渐其威。自得增益。或真言损益。或被罗[口*截]真言不行。或被系缚真言。递相交杂。或真言字增加。如上等患。尽皆除去。而得增威。诸护摩中。所说药草。随取其一。经一百夜。而作护摩真言。欢喜而得增威。复取诸香。和作香泥。作本尊形。献忙攞底华。烧胶树香。或坚木香。一日三时。诵以真言。一百八遍。真言欢喜而得增威。作此尊形。置荷叶上。或芭蕉叶。或乳树叶。或诸草叶。非直尽日夜亦献之。法事了时。如法发遣。送致大河。如上次第。依此法则作者。本尊欢喜。速赐悉地</p><p>苏悉地羯罗经本尊灌顶品第二十</p><p>复次先承事了。若欲真言主增加威德故应灌之。取以金瓶。或银铜等。或新瓦瓶。盛满香水。置于五宝。华叶果香。五种谷子。种种涂香。或坚诸香末。以新彩帛系其瓶。项[打-丁+(乖-北+比)]诸亸树枝。或乳树枝。用部尊主真言。或用部母真言。一百八遍。然后灌其真言主顶。应用金作。或以沉檀。而作其形。置于座上。而灌顶之。灌顶既了。复当献华香等物。或诸璎珞。种种供养具。而供养之。及作护摩。并加念诵。如是作者。能令本尊。增加威力。速得悉地。先承事者。作念诵时。应灌本尊。取阏伽器。摽相本尊。而灌顶之。或自浴了时。复应想念本真言主。三度七度。而灌顶之。先承事时。不应废忘。或时用苏。或时用蜜。盛满瓶中。内置七宝。如法执持。灌本尊顶。所祈之愿。速得满足</p><p>苏悉地羯罗经祈请品第二十一</p><p>复次广说祈请法则。于白黑二月八日十四日十五日。或日月蚀时。一日不食。或经七日。澡浴清净。着新净衣。离此晨日。而祈请者。应用白月。诵扇底迦真言。而祈请之。复于暮间。以诸汤水。及用真言。澡浴清净。除诸垢秽。洒沾五处。如法供养。本真言主。复献阏伽。加诵真言。一百八遍。用阇底华粖。大开者洒栴檀香水。持奉献之。又广献食。名乌那梨食。食中加酪。以忙攞底华。作鬘供养。先取牛苏。而作护摩。一百八遍。次用娑护摩。一百八遍。用白[叠*毛]缕。或布线缕。令童女合。</p></div>"
}]