[{
    "title": "西方陀罗尼藏中金刚族阿蜜哩多军吒利法 第1212部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>西方陀罗尼藏中金刚族阿蜜哩多军吒利法</p><p>序</p><p>慈觉大师圆仁入唐新求圣教目录。有阿蜜哩多军荼利法一卷。惜密部经轨中逸而不传。安然八家秘录。以此法为最澄圆仁二家之请来。然最澄实不请来之故。越州录所记。有军荼利菩萨法。无阿蜜哩多军荼利法。而秘录却不举菩萨法。安然之意虽在同视两者也不待言。奈何其名已殊。按军荼利菩萨法者。盖最澄所传四种杂曼荼罗<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>之一。即不外于陀罗尼集经卷第八所收金刚阿蜜哩多军荼利菩萨<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>神力咒印品耳。恐非圆仁所谓阿蜜哩多军荼利法也。爰田中青山伯。眼高识远。深爱古写经。鉴藏之富甲于天下。牙签缃帙插架百轴。悉是和铜天平乃至隋唐宝迹。无一不稀世之珍。予幸辱知。尝得其许。发厨阅之。偶见一卷。题云西方陀罗尼藏中金刚族阿蜜哩多军吒利法。吒字即荼之讹。内题正书军荼利法。薄麻纸赤漆轴无褾无带。虽少装潢之美。古香却可掬。首尾完具。通卷无一字蠹蚀不可读者。笔致点画纯然唐代之结体也。于是千载古逸经典一朝无端得值遇。惊喜不能支。展舒至卷末。有跋云。时以大唐长庆元年十二月三十日于青龙东塔院<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>海云写记奉阿阇梨教以记他时并勘毕。跋与经文书法全同。宇不甚巧。整而却有<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>。乃知海云自笔本。非寻常经生之所写。不觉合掌瞻礼。有面接古德之想。海云比丘者。与东塔院义真玄法寺法全等同为青龙寺义操之<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。大和八年在净住寺着两部相承传法次第记。密教师资血脉最足的据。圆仁书写请来以传我国。今由是考之。此卷识语中所谓阿阇梨者指义操也。无疑而海云自称梵字传教<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。其通晓悉昙不难想见矣。惟长庆之初尚侍师居青龙寺。义操诵出梵文。海云笔受。译此经以置于东塔院。跋文殆可征焉。开元贞元释教录共不载之者。其为后出耳。而更熟观此卷。有误脱有衍字。润文不雅。章段不整。<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>之用字乱杂无定例。咒文不注语句之数。是固记者不长于文学之所致。虽复不得已。其为未经再治者明矣。非翻译原本而何哉。圆仁以开成五年至长安。留六年。访青龙寺东塔院见诸曼荼罗。令博士王惠摸两部画帧。书写经疏。设<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>入。敕置本命灌顶道场。受胎藏及苏悉地大法于义真。义真给以帧绢。又至玄法寺重受胎法于法全。法全付以胎藏及别尊仪轨各三卷。更就青龙寺南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>宝月学悉昙。事皆详于入唐求法巡礼行记。因想海云虽先移于净住寺。且恐已去世。以义真法全与之同门故。当时此本尚在东塔院。若玄法寺未曾流布于世。圆仁独得之于其师而赍归。他家不传固其处矣。果然则此卷。又为请来原本。真是三绝之至宝。其贵岂啻拱璧而已哉。若不幸微此卷阿蜜哩多军荼利法或永泯灭了。彼土早既逸之。其终不入藏亦宜矣。青山伯语予曰。此经出自石山。顾圆仁请来后不久。出睿岳入石山寺。台密本所为失其传。而淳祐以后石山无硕学之出。终束于高阁不复行于世。阿娑缚抄等无所见何足怪哉。觉禅抄唯举其名而不引其文。东密明匠亦似不传之。通诵一遍。即知其属胎藏系统为杂部密经之一。气味极类陀罗尼集等经。原梵本述作之年代降于集经盖不太远。对较之于尔余军荼利诸法。此经最为广博。坛法之精。成就法之繁。虽集经不敢及之。印咒亦最富赡。可谓军荼利别尊法发展增备之极。密藏中不可阙者矣。呜呼物亦有遇不遇。犹如人间。纵令久隐没。幸免劫灰。留迹于百代之后。得失果孰乎。颇不能无所感。因请借之。孜孜旬日。手写一本。以待镂梓传世之缘。今兹三月。鸥外森博士萱堂长逝。博士至孝。卜其尽七日忌。欲印佛典珍籍颁之戚友以资冥福。托予以采择校刊之事。乃出于箧底而进之施。再校加头注作目次。又用意正段落提头。异画别字多改正字。以付排印令法久住云。尔于时大正丙辰<a href=\"/remen/fodan.html\" class=\"keylink\" target=\"_blank\">佛诞</a>日密乘末资大村西崖记于无记[盒-口+?]南窓之下</p><p>序品第一</p><p>择地法品第二</p><p>成就坛品第三</p><p>成就大法品第四</p><p><a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>大[口*笑]咒等法品第五</p><p>烧火法品第六</p><p>乞雨止雨法品第七</p><p>大秘密心陀罗尼品第八</p><p><a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>安稳法品第九</p><p>斗战胜咒品第十</p><p>使者法品第十一</p><p>大<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>耶坛咒品第十二</p><p>随心咒品第十三</p><p>大随求咒品第十四</p><p>大成就除毒法品第十五</p><p>看事法品第十六</p><p>带咒法品第十七</p><p>手印法品第十八</p><p>漫荼罗受法坛品第十九</p><p>诸使者咒品第二十</p><p>治鬼病咒品第二十一</p><p>种种大发遣咒法品第二十二</p><p>阿蜜哩多军荼利法序品第一</p><p>尔时金刚菩萨。为利益一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>男<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>人童男童女等说拥<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>品。往昔天与阿修罗战。从四天王至帝释天。所有药叉罗刹大威力者。总被阿修罗军摧伏退散怕怖驰走。乃至三十三天皆悉振动。帝释天主及一切天.龙.乾闼婆.紧那罗.摩呼[口*洛]迦等地及<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>住者。日月星辰.仙人.风神.大自在天.婆薮天.火天.水天.一切虐天.大自在天.那罗延天.毗那夜迦天等及诸咒神。一切咒术毒药閞伎等。尾哩呵婆跛底所作药术。及阿闼婆拏等所说药术方法。及竭嚧荼等所说一切法。与阿修罗战皆悉退散。阿修罗军获大胜力。彼劫浊恶世时。众生修福者少。造罪者多。是故诸天减少。阿修罗炽盛。及一切咒术毒药所不能及。当尔之时<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>微薄</p><p>尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。以慈悲眼观见斯事。即告金刚菩萨言。汝今谛听。一切诸天神咒术。皆被阿修罗军摧伏。汝今以威神力救助诸天。得大利益。一切诸佛之所灌顶。当得一切诸大菩萨<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之力至不退地。我今现前与汝受记。当得作佛。号名无量诸胜智如来。尔时金刚菩萨。闻佛受记<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃。以佛加持即化作嗔怒金刚王。身光吓弈犹如千日。即入金刚三昧。现可畏形。千臂千眼具足威德。以神通力<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>满须弥山顶。及住虚空。所谓跋折罗央俱舍.跋折罗跛舍.跋折罗渴伽.跋折罗吒呵娑.跋折罗旃拏儞罗檀拏.跋折罗顿拏.跋折罗愈驮.跋折罗尸结罗.跋折罗没特薜罗.跋折罗跛尼摩诃跋折罗跋折罗世结罗.跋折罗睹摩罗.跋折罗尔多.跋折罗舍罗.跋折罗牟娑罗.跋折罗斫羯罗.跋折罗孽陀.跋折罗铄底.跋折罗什嚩罗.跋折罗钵嚩多.跋折罗驮努嚩[口*(曰/罗)]输罗.跋折罗摩罗.如是等跋折罗。甚大可畏。一切诸佛之所变化。当时诸大见之皆悉怕怖。往诣帝释所告言。天主此来者是谁。为当是阿修罗军欲吞吸我等诸天。及乾闼婆.紧那罗.日天.婆薮天.噜陀罗天等大力天可畏极难瞻仰。以术法力故令我等诸天皆悉迷或。惟愿天帝慈悲救护我等。天主往昔与阿修罗战。以术法化作嗔怒可畏之形相。令彼怕[怡-台+自]。安稳我等及一切诸天。如是劝请帝释已。复赞叹言</p><p>大德天中尊慈悲于一切</p><p>缘此阿修罗数数生<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a></p><p>我等尽神力不能除此魔</p><p>惟求两足尊此怨应退散</p><p>尔时诸天赞帝释已。金刚菩萨即至其前。见诸天等身皆怖惧。即见真身光焰威德。住于天帝前称言。南无<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>。帝释闻称佛声。心中安稳。以佛智警惊觉。即恭敬<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a><a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>供养。金刚菩萨以偈赞曰</p><p>稽首薄伽畔嗔怒金刚王</p><p>心怀大慈悲久修菩萨行</p><p>身如月盛满令我等清凉</p><p>为破阿修罗护助诸天众</p><p>定是佛方便故化作此身</p><p>又能除恶趣及救苦众生</p><p>降伏大药叉罗刹恶龙等</p><p>及诸魔眷属悉能摧伏之</p><p>若有诸众生能见法身者</p><p>灭除四重罪我今头顶礼</p><p>尔时天帝赞叹金刚菩萨了。住一面立。尔时金刚菩萨。为欲破阿修罗军。故即变可畏嗔怒之形。于须弥山顶上四面变化金刚火焰来欲烧。阿修罗军遥见皆悉怕怖。心生烦恼。即散驰走。以金刚威力所不能去。亦不敢回。面看金刚菩萨。所看之处。悉见金刚吞一切阿修罗。以手捉一切阿修罗头。以金刚牙上挂无数阿修罗。目如千电。口如血海。百千万亿阿修罗军悉不能满四边血犹如大星。便变为鬼子母可畏形相。还走赴阿修罗军。血流遍地如江海。大风吹之激成波浪。于中化四姊妹神。甚大可畏。及菩萨地婆诃噜陀罗亦名牟嚧。悉于大海中住游遍大地。复有从窟中生出无数热鬼。大可畏形。又生矩摩罗。即领军众打阿修罗去。从此已后。向窟中生塞干陀.阿跛塞摩罗緼摩陀。能见种种可畏形相。能降阿修罗女取人胎鬼杀小儿鬼日夜游行嗅秽之处吸小儿精气饮血吃肉。如是之辈悉能摧伏。亦护帝释破阿修罗。当尔之时阿修罗军破为微尘。悉无回者。诸天女乾闼婆女皆大欢喜。种种音乐击天鼓散天花而赞叹之。阿修罗军摧碎。诸天获胜已。皆犹嗔怒王威德力如是</p><p>尔时天帝合掌。礼金刚菩萨足。于前住立。及诸天子散蔓陀罗花.曼殊沙花.旃檀香末。于虚空中及散无量俱胝天衣缨珞金银七宝。散于天上化成宝盖。供养嗔怒王已。于虚空中宫殿楼阁以用奉上金刚菩萨供养已礼。尔时金刚菩萨。欢喜踊跃。与帝释灌顶。即从天下来诣世尊所。顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足绕佛三匝。即告之言。善哉善哉。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>威德智惠无量无边。作佛事毕。于<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>中大利益故。汝之法身久已智增长。汝今所有咒法大成就法三昧耶法。降伏一切鬼神法。汝今当说</p><p>尔时金刚菩萨欢喜踊跃。即于佛前说成就<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>一切咒法。而说曰</p><p>那谟啰怛那怛啰夜也那莫失旃拏跋折罗波拏(上音)曳摩诃药叉栖那跛多曳那谟跋折啰俱噜驮也儞(入)底也(二合)钵啰什嚩哩多捻(引)多跋折啰迦啰也屋竭啰邓瑟吒啰得羯吃婆耶弊啰皤也阿斯牟娑逻没特誐啰铄乞底输逻波啰输(去)跛舍呵塞哆也嚩啰迦娜迦跋折罗吠琉璃耶楞乞[口*栗]多设哩逻也萨婆娜伽药迦叉逻刹娑阿素啰毕[口*栗]多毗舍遮尾近娜尾那夜迦而尾旦多迦逻也多涅他唵阿蜜哩多军荼利虎鲁虎鲁主鲁主鲁姥鲁姥鲁诃那诃那陀诃陀诃钵遮钵遮摩他摩他度那度那剑波剑波瞻婆瞻婆悉担婆也悉担婆也牟诃也牟诃也阿度那微度那摩摩(自称名)萨婆设敦[口*仑](二合)尾近娜尾那夜干佉佉佉呬佉呬阿羯哩沙阿羯哩沙底瑟姹盘驮盘驮拟哩衅拏拟哩衅拏阿那也阿那也怛喏怛喏孽喏孽喏尾塞普吒尾塞普吒婆伽畔阿蜜哩多军荼利母[口*勒]驮喃多拏(上音)跋折利拏唬吽唬吽唬吽唬吽唬吽唬吽泮泮泮泮泮泮泮吒俱嚧驮近拏曳俱噜俱噜苏噜苏噜都噜都噜诃诃诃呬呬呬呼呼呼悉佃都咩(铭音)曼怛啰跛娜莎嚩诃</p><p>此是根本大咒。请军荼利时用。亦能成一切法</p><p>军荼利咒水咒</p><p>那谟跋折啰俱噜驮也摩诃俱噜(二合)驮啰惹也阿弭多嚩逻跛啰羯啰摩也唬吽虎吽虎吽泮泮泮莎嚩诃</p><p>此咒咒水七遍用洗面。辟一切毗那夜迦</p><p>军荼利心咒</p><p>那谟啰怛那怛啰夜也那谟跋折啰俱噜(二合)驮也唵阿蜜哩底唬吽泮莎嚩诃</p><p>此咒常<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。所作一切事皆得成就</p><p>军荼利结界咒</p><p>那莫娑漫多跋折啰喃佶啰佉啰哆吒哆吒末吒末吒盘陀盘陀萨嚩努瑟吒药叉罗刹娑南啰刹死南娑漫怛(引)地愈(二合)善那舍担斯摩畔淡俱嚧娑漫多跋折利拏句鲁句鲁阿摩梨尾摩梨俱噜那么曳乌那也乌那也嚩啰嚩啰羯罗羯罗死摩盘驮弭入嚩(二合)罗入嚩罗阿蜜哩多军荼利唬吽泮莎嚩诃</p><p>此咒咒水或咒灰或咒白芥子咒满七遍结界。辟一切毗那夜迦药叉罗刹颠狂鬼比舍遮。及作一切障碍者不能恼乱</p><p>军荼利护身咒</p><p>那谟啰怛那怛啰夜也那谟跋折啰俱噜驮也唵阿蜜哩哆军荼利[口*洛]叉[口*洛]叉摩摩娑嚩萨埵难者唬吽[口*半]莎嚩诃</p><p>此咒诵七遍护身结界。即得成就</p><p>军荼利三昧耶咒</p><p>那谟啰怛那怛啰夜也那谟跋折罗弊罗婆也唵阿蜜哩多军荼利佉佉佉佉佉佉佉虎吽虎吽虎吽虎吽虎吽虎吽泮泮泮泮泮泮泮莎嚩诃</p><p>此咒入坛咒。名三昧成一切事</p><p>军荼利供养咒</p><p>那谟啰怛那怛啰夜也唵阿蜜哩底阿蜜哩多始佶始佶尾末逻尾末逻尾逻而曳(二合)尾啰尔儞唬吽泮莎嚩诃</p><p>此咒所有供养物皆咒七遍。一切鬼神不能为障难</p><p>军荼利阿伽供养咒</p><p>那谟啰怛那怛啰夜也那谟跋折罗俱噜驮也唵阿蜜哩多军荼利诃娑诃娑阿勒遮唬阿勒遮虎吽泮莎嚩诃</p><p>此咒法。取一铜椀满盛净水。取蓇蒌草杂花散于水中。诵咒七遍供养。一切所作皆得成就</p><p>军荼利<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>咒</p><p>那谟啰怛那怛啰夜也那谟跋折罗俱噜驮也唵阿蜜哩底尔期入啰尔期啰娑嚩摩努肾坏言唬吽泮莎嚩诃</p><p>此咒咒香烧香及涂香七遍。然后供养</p><p>军荼利供养饮食咒</p><p>那谟啰怛那怛啰夜也那莫失旃拏跋折啰跛拏曳唵阿蜜哩底诃诃啰嚩哩嚩哩儞莎嚩诃</p><p>此咒咒一切食七遍供养。所作<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a></p><p>军荼利下语咒</p><p>那谟啰怛那怛啰夜也那谟摩诃俱噜驮啰喏也唵阿蜜哩多军荼利喏跛喏跛喏赖跛喏赖跛</p><p>此咒法若教人下语者咒水或白芥子七遍。当面散之烧香即下语</p><p>军荼利能缚咒</p><p>那谟啰怛那怛啰夜也那莫失旃拏毗伽也俱噜驮啰喏也唵阿蜜哩底闷遮闷遮唬吽泮莎嚩诃</p><p>此咒咒花一遍或水一遍。当面上散之手即答之。或作[合*牛]声即解</p><p>军荼利发遣咒</p><p>那谟啰怛那怛啰夜也那莫失旃拏跋折啰跛拏(上)曳摩诃药叉栖那跛多曳阿蜜多孽底伽摩娜也微伽嚩底阿蜜哩底孽车孽车尾地耶(二合)驮罗啰喏拘摩利鸡也他速欠莎嚩婆嚩喃莎嚩诃</p><p>此咒烧香诵七遍鬼神即发遣</p><p>军荼利着甲法咒</p><p>那谟啰怛那怛啰夜也那谟跋折罗俱噜驮也唵阿蜜哩多[口*洛]叉[口*洛]叉摩摩萨啰婆曳瓢吠儞也(二合)迦嚩制唬吽泮莎嚩诃</p><p>此咒诵七遍即成着甲</p><p>军荼利结顶髻咒</p><p>唵阿蜜哩多军荼利[口*洛]叉[口*洛]叉摩摩唬吽泮莎嚩诃</p><p>此咒诵七遍。结顶上发作一结若护同伴咒茅草与戴一切拥护法亦用此咒。然后诵根本咒请军荼利令咒法速成更诵烧香咒及阿伽咒供养咒次第皆诵七遍供养。得灭一切罪得无量福。一切所作皆得圆满。除一切恶。得入三昧耶坛</p><p>立验军荼利缚咒</p><p>那谟啰怛那怛啰夜也那莫失旃拏跋折罗跛拏(上)曳摩诃嚩啰跛啰跛啰羯啰摩也嚩啰迦娜迦啰怛那步洒拏(上)帽哩军荼利逻驮啰也摩诃弊啰嚩噜跛陀哩泥俱噜(二合)驮啰惹也娑漫多跋折啰什嚩罗尾悉普陵誐吒荷娑三勃啰牟哆啰娑娜迦逻也跢侄他唵阿蜜哩多军荼利都噜都噜俞噜俞噜惧噜惧噜没噜没噜唬噜唬噜牟唬牟唬逻惧逻惧怛啰吒怛啰吒末吒末吒迦[口*荼]迦[口*荼]驮迦驮迦度那度那微度那阿娜也阿娜也钵多钵多跛多也跛多也翳呬阿尾舍阿尾舍跛啰尾舍跛啰尾舍翳昙摩努沙舍哩[口*蓝]拟哩呬哆么拟哩呬担嚩(上)娜瑟吒么娜瑟吒(知醎反)嚩(上)钳波跛也钳波跛也儞(入)底耶(二合)跛也喏腊跛跛也跛多也邬他跛也荷娑荷娑跛也嚧娜儞鸡嚧驮跛也乌俱噜舍乌俱噜舍尾俱噜舍尾俱噜舍阿俱噜舍阿俱噜舍阿俱噜舍跛也呵那驮诃钵遮多吒也尾洒也门遮门遮跛也婆誐畔阿蜜哩多军荼利佉佉莎嚩呵</p><p>此咒诵速疾得验。先须供养。每时诵咒一百八遍。然后取黑月八日或十四日。别本二十三日二十四日九日月尽日。一日一夜不食。清净澡浴着新净衣。取种种香花饮食果子。随时力所办像前供养。合掌顶礼金刚手菩萨。若欲得缚丈夫妇人童男童女诵咒七遍。烧安悉香。无问有病无病。悉皆被缚。若转钵合竹转露柱瓮杵。或转劫波罗。或于镜中看事大母指上看事一切所作。皆烧安悉香。诵咒一遍七遍。皆得随意。若欲治鬼魅野道病。及护自身并护他人。降伏诸龙乞雨止雨除灾难。及安稳富饶。降贼傧怨家。降一切毒恶电恶风。及食苗稼黄虫等。亦能调伏一切恶人恶神等。亦能取一切伏藏入阿修罗窟。亦能令他和合。亦能令他相憎驱逐及离去。亦能遣一切无有威德。亦能令一切人福德圆满。一切所作法。皆烧安悉香。此咒能作百千种最上法。所有见佛及金刚手菩萨诸菩萨声闻缘觉辟支佛。能灭一切罪。得大富贵。于一切众生中得大尊重。亦得大闻持。亦能除一切怖畏。亦能除饥馑。能利益一切众生。长寿无病。满足辩才多仆从。仓库盈溢。兴易多利。承事国王皆得欢喜。若入军阵。若有斗诤博戏皆悉获胜。无量百千法皆得成就</p><p>军荼利择地法品第二</p><p>复次说成就坛法地者。先须能拣择其地。须近清净河边。或二河相合处。于沙坦上。或近池边。或山林阿练若处空闲林中。或空闲天祀中。或尸陀林中。或寺中。或<a href=\"/sheli/shelita/\" class=\"keylink\" target=\"_blank\">舍利塔</a>前。或于饶众花处。取有好鸟作声令人乐闻者。其处亦中。及有鹿群住处亦得。其林中若有鹰鹞者。老乌鵄枭[(汉-夫+土)*鸟]获野鹊角鵄野狐如是等诸禽兽住处即不中用。所近河边。其河须有清水满流池中。须有清水溢岸。或海[泳-永+((辰-一)/肉)]边诸佛所赞叹处亦得。先有圣迹处亦得。若得此地。其法速成。然后[栓-王+土]地去其瓦砾塼骨石毛发炭。若见其中有臭泥粪屎坑陷古墓。若见此等亦不中用。若无此等。取好黄土竖筑使平。若撩理地时有恶相来见亦不中用。有好相来取。二相不来亦取。四方有好鸟赤由如火色者看在树上坐。若是好美花菓树上坐生枝即吉令法成就。仍作声吉坐干枯诸恶树上住者。及其树处孔不中其处不中。其鸟来若作怖畏若作恶声亦不中用。若作降怨法。得如上恶处作其法速成。若作吉祥法。得如上好处即得成就。复次更说。若野干[薰*鸟]获棘针沙塠恶处。作一切降怨法总得。若有大虫师子白象作吉祥法则好。若风太急。若作恶声令人怖畏。烟雾雹子恶风雨黑尘。如此处即作恶法时用。若有东南风西北风。作吉祥法不得吉。如是作者不吉。咒者应善思惟作之</p><p>军荼利成就坛品第三</p><p>复次设成就坛法者。先须澡浴着新净衣。莫恶口<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。于一切众生起利益慈悲心无怖畏心。身不战惧足智惠方便不染着恶法者。有道心者。受三归者。常着净鲜洁白衣裳。供养<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。常诵吉祥咒及结界咒。作承事供养法。常诵军荼利心咒一千八遍。于金刚前常坐茅草。吃三种白食粳米乳酪。于前作法诵根本咒请唤。面向东坐。烧沉水香安悉香。作阿伽法香水安安置像前。烧一百盏灯。供养饮食等。随力所办。一日一夜诵咒莫阙。瞻仰军荼利。乃至南方有雷声及大可畏声。咒者勿生怖畏心。亦不须向南看。但闻自起顶礼金刚菩萨。手执香炉。<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>四方诸佛<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。作供养心。若咒师左右出声称善哉善哉大菩萨。汝咒法成就。汝心所作随意得成。从此已后。一切作法即得善巧成就。咒神加被。即得名阿阇梨。一切所作住处得。一切所作住处得一切恭敬。一切世间堪受大供养。能救拔一切众生苦恼。与一切众生作依止处。一切药叉.罗刹.狂颠鬼.厌蛊毒鬼.荼枳尼鬼.蛊毒起尸鬼.王贼水火禁缚等难。博戏诤论大贼小贼饥馑崄难山中恶禽兽等难。恶风雷雹覢电霹雳恶星变怪一切疾病河海等难。此等难处。咒师能护一切众生。令得聪明智惠闻持辩才。一所作业能速圆满。咒师莫妄语。能破一切恶咒术。得如是等无量功能。咒者应知</p><p>复次说五种成就坛法者。占择地法如前品所说。取绳子四方量取三十二肘[栓-王+土]深六尺或一指。去却恶土瓦砾骨石等。取黄土坚筑令平。更量取。若依旧作法即得成就。若有大小不依旧者作法不成。凡一切坛者有三种。所谓上中下。上者国王坛中。者皇后太子宰相坛。下者一切众生坛。其坛或日西时作。或夜时作。上坛三十二肘。中坛十六肘。或八肘。下坛四肘二肘一肘。无法若作亦不得成就。若治病有鬼不合得坛者亦不得与作坛。若合得作坛者即作二肘坛。若不合得一肘亦莫作。如是坛法。咒者应知</p><p>复次我今更说金刚族坛法者。其坛十六肘四方。五色粉画。坛上开四门。于中安置画像。如前所说。供养花香花鬘涂香旃檀香沉水香龙恼香龙花须丁香皮一切香一切花。随力所办多少种种饮食菓子苏油石蜜沙糖乳粥酪饭。如是等香花饮食用供养佛。<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>亦如是。金刚使者吃三种白食三种?骋延霉┭?K兄湔咭蝗杖?樵柙 W湃?职滓隆R蝗找灰共皇场S谙袂白?┎萃畔?辖狨术米?K写笾淝刖?崩?</p></div>"
}]