[{
    "title": "诸星母陀罗尼经 第1302部",
    "author": "法成 译",
    "html": "<div class=\"B1_text\"><p>诸星母陀罗尼经</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法成于甘州修多寺译</p><p>如是我闻。一时薄伽梵住于旷野大聚落中。诸天及龙药叉罗刹乾闼婆阿须罗迦楼罗紧那罗莫呼落迦诸魔。日月荧或太白镇星余星岁星罗睺长尾星神二十八宿诸大众等。悉皆赞叹诸大金刚誓愿之句。威加<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>师子座上与诸菩萨同会一处。其名曰金刚手菩萨摩诃萨。金刚忿怒菩萨摩诃萨。金刚部菩萨摩诃萨。金刚弓菩萨摩诃萨。金刚主菩萨摩诃萨。金刚庄严菩萨摩诃萨。金刚光菩萨摩诃萨。观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨摩诃萨。普见菩萨摩诃萨。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>吉祥菩萨摩诃萨。莲华幢菩萨摩诃萨。广面菩萨摩诃萨。华眼菩萨摩诃萨。妙吉祥菩萨摩诃萨。慈氏菩萨摩诃萨等。诸大菩萨僧前后围绕瞻仰<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。其法名为广大庄严如意宝珠初中后善句义美妙无杂清净清白梵行</p><p>尔时金刚手菩萨观于大众从座而起。以自神力旋绕<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>数百千匝。作礼前住自具倚持。以善跏趺瞻视大众。以金刚掌安自心上而白佛言。世尊有其恶星。色刑极恶具猛利心。色刑忿怒恼乱有情。夺其精气或夺财物或夺于命。长寿有情令作短寿。如是恼乱一切有情。为是等故。唯愿世尊关显法门。守护一切有情之类。世尊告曰。善哉善哉。汝兴大悲为利一切诸有情故。问于如来甚深密义。汝今谛听善思念之。我当说其恶星嗔怒破坏之法。及说<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>行施念诵秘密之义</p><p>若行供养当供养若作其恶当作恶</p><p>如是诸星刑色等云何而令生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a></p><p>诸天及与诸非天紧那罗等及诸龙</p><p>诸药叉等并罗刹人及迦多富多那</p><p>猛利威德诸大神嗔怒云何而殄灭</p><p>秘密言辞供养法今当次第而宣说</p><p>尔时释迦如来从自心上而放慈心游戏光明。入于诸星顶髻足中。寻时日月一切星神从座而起。以诸天供即以供养释迦如来。膝轮着地合掌作礼而白佛言。世尊如来应供正真等觉利益我等。唯愿世尊宣说法门。令于我等而聚集已守卫防护说法之师。令得吉庆远离刀杖消灭毒药作结界</p><p>尔时释迦如来即便为说供养星法及以密言陀罗尼曰</p><p>唵谟呼罗迦耶莎诃唵尸儅奢蔽莎诃</p><p>唵落落当伽俱么啰也莎诃唵报[多*页]也报[多*页]也莎诃唵报伽阿悉婆[多*页]世莎诃唵诃须啰萨多么也莎诃唵吃哩悉囊簸啰那也莎诃唵阿蜜多毕哩耶莎诃唵藉底羯多蔽莎诃</p><p>金刚手。此则是彼八星秘密心咒。读便成办。当作十二指一色香坛中安供养。或瓦或铜金银等器奉献供养。一一供养当诵一百八遍。金刚手。然后诵此诸星母陀罗尼秘密言辞满足七遍。一切诸星而作守护。所有贫穷悉得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。命将欲尽而得长寿。金刚手。若苾刍苾刍尼乌波索迦乌波斯迦及余有情之类。若历耳根而不中夭。金刚手。诸星坛中设供养已每日而读诵者。彼说法师一切诸星如彼所愿悉令满足。与彼同类贫匮诸事皆得消灭</p><p>尔时释迦如来即便为说诸星母陀罗尼。即说咒曰</p><p>南谟<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>耶南谟婆[椔-田+夕]啰驮罗耶南么钵么达啰耶南么萨婆迦啰诃南么萨婆阿奢波啰甫迦喃南谟诺奢多啰喃南谟埵爹奢啰尸喃怛也没底没底簸窒啰簸窒啰钵明钵明娑啰娑啰钵娑啰钵娑啰三婆啰三婆啰基多耶基多耶么啰么啰么讫陀么讫陀伽[多*页]耶萨婆碧建俱噜俱噜晋那晋那乞舍波耶乞舍波耶扇胝[日/工]低[多*页]么耶[多*页]么曳咄噜多儞达奢耶羯么喃薄伽薄帝落叉耶落叉耶么那婆波哩波蓝娑啰波萨都王悉荼萨婆吃诃那乞奢多啰陂多么簸儞簸啰儞簸啰薄伽薄底么诃摩曳萨驮耶咄悉荼么奢耶波波儞么赞底赞底都噜都噜赞底谋榆谋榆资谋资谋诃婆诃蔽屋吃哩屋吃诃爹迷甫啰耶迷末努多蓝萨婆[怡-台+(日/工)]他迦多阿低悉低娑么耶莎诃唵莎诃吽莎诃纥哩莎诃吽莎诃[怡-台+(日/工)]航莎诃钵么[多*页]啰莎诃阿窒哆耶莎诃苏磨耶莎诃[多*页]啰儞须多耶莎诃没他耶莎诃勃多悉波低曳莎诃[仁-二+寂]伽啰耶沙诃吃奢那跋那耶莎诃啰诃蔽莎诃[豸*鸟]多蔽莎诃没他耶莎诃簸[椔-田+夕]啰达啰耶莎诃钵么[多*页]啰莎诃拘么啰耶莎诃诺乞沙多啰难莎诃萨婆鸟钵多啰簸难莎诃唵萨婆簸比底叭叭莎诃</p><p>金刚手。此是诸星母陀罗尼秘密咒句。成办一切诸事根本。金刚手。此陀罗尼秘密咒句。从于九月白月七日而起于首具足长净。至十四日供养诸星。而<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>之月十五日。若能昼夜而读诵者。至满九年无其死畏。亦无星流堕落怖畏。亦无月宿作恶怖畏而忆<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。亦能供养一切诸星。一切诸星随其所愿而授与之。尔时诸星礼世尊已赞言善哉。忽然不现</p><p>诸星母陀罗尼经</p></div>"
}]