[{
    "title": "佛说杂藏经 第745部",
    "author": "法显 译",
    "html": "<div class=\"B1_text\"><p>佛说杂藏经</p><p>东晋平阳<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法显译</p><p><a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>诸阿罗汉。诸行各为第一。如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>第一。乐说微妙法。目连神足第一。常乘<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。至<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>见<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>受<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a><a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。还来为人说之。目连又一时至恒河边。见五百饿鬼。群来趣水。有守水鬼。执铁杖驱驰。令不得近。于是诸鬼迳诣目连所。礼目连足。各问其罪<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。有一鬼白目连言。大德我受此身。常患热渴。先闻此恒水清凉且美。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>趣之。入中洗浴。而便沸热。举身烂坏。若饮一口。五藏焦烂。臭不可当。何因缘故。受如此罪。目连报言。汝先世时作相师相人吉凶。少实多虚。或毁或誉。自称审谛。以动人心。诈惑欺诳。以求利养。迷惑众生。失如意事。是故今日虽闻此水清凉且美。到不如意。此是恶行花报。后方受<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>苦报</p><p>复有一鬼。白目连言。我常为大狗。利牙赤目。来啖我肉。遗有骨在。风还吹起。肉续复生。狗复来啖。我常受此苦。何因缘故尔。目连答言。汝前世时。作天祠主。常教众生。杀羊以血祠天。汝自食肉。是故今日以肉偿之。此是恶行华报。后方受地狱苦果。亿百千倍也</p><p>复有一鬼。白目连言。大德我常身上。有粪遍涂漫。亦复啖之。何因缘故。受如是罪。目连语言。汝前世时。作<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。恶邪不信罪福。有乞食道人。意不欲使更来。即取其钵。盛满中粪。以饭着上。持与道人。道人得已。持还本处。以手食饭。粪污其手。是故今日受如此罪。此恶行华报。后方受地狱苦果</p><p>复有一鬼。白目连言。大德我腹极大如瓮。咽喉手脚。甚细如针。不得饮食。何因缘故。受如此苦。目连答言。汝前世时。作聚落主。自恃豪贵。饮酒纵横。轻欺余人。夺其饮食。饥困众生。由是因缘。受如此罪。此是华报。地狱苦果。方在后也</p><p>复有一鬼。白目连言。我常趣溷欲食粪。有大群鬼。捉杖驱我。不得近厕。口中烂臭。饥困无赖。何因缘故。受如此罪。目连答言。汝前世时。作佛图主。有诸白衣贤者。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>众僧。供设食具。若有客僧来。汝便粗设粗供。客僧去已。自食细者。以是因缘故。粪尚叵得。何况好食。此是华报耳。后当受地狱果</p><p>复有一鬼。白目连言。我身上遍满生舌。斧来斫舌。断续复生。如此不已。何因缘故尔。目连答言。汝前世时。作道人。众僧差作蜜浆石蜜块大难消。以斧斫之。盗心啖一口。以是因缘故。斧还斫舌</p><p>复有一鬼。白目连言。我常有七枚热铁丸。直入我口。入复五藏焦烂。出还复入。何因缘故。受如此罪。目连答言。汝前世时。作<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>行。果蓏子到师所。敬其师故。偏心多与实长七枚。是故受如此罪。此是华报。后受地狱果</p><p>复有一鬼。白目连言。常有二热铁轮。在我两腋下转。身体焦烂。何因故尔。目连答言。汝前世时。与众僧作饼。盗心取二番。挟两腋底。是故受如此罪。此是花报。后方受地狱果</p><p>复有一饿鬼。白目连言。我丸极大如瓮。行时担着肩上。住则坐上。进止患苦。何因缘故尔。目连答言。汝前世时。作市令。常以轻称小斗而与。重称大斗而取。常自欲得大利于己。侵克余人。是故受如此罪。此是华报。地狱苦果。方在后也</p><p>复有一鬼。白目连言。我常两肩有眼。胸有口鼻常无有头。何因缘故尔。目连答言。汝前世时。恒作魁脍<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。若杀罪人时。汝常有欢喜心。以绳着髻挽之。以是因缘故。受如此罪。此是恶行华报。地狱苦果。方在后也</p><p>复有一鬼。白目连言。我常有热铁针。入出我身。受苦无赖。何因缘故尔目连答言。汝前世时。作调马师。或作调象师。象马难制。汝以铁针刺脚。又时牛迟。亦以针刺是故受罪如是。此恶行华报。地狱苦果。方在后耳</p><p>复有一鬼。白目连言。我身常有火出。焦热懊恼。何因缘。故尔。目连答言。汝前世时。作国王夫人。更一夫人。王甚幸爱。常生妒心。伺欲危害。值王卧起去。时所爱夫人。眠犹未起着衣。即生恶心。正值作饼。有热麻油。即以灌其腹。腹烂即死。以是因缘。受罪如是</p><p>复有一鬼。白目连言。常有旋风。回转我身。不得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>随意东西。心常恼闷。何因缘故尔。目连答言。汝前世时。常作卜师。或时实语。或时<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。迷惑人心。不得随意。是故受如此罪。此是华报。地狱苦果在后</p><p>复有一鬼。白目连言。我身常如块肉。无有手脚。眠耳鼻等。恒为虫鸟所食。罪苦难堪。何因缘故尔。目连答言。汝前世时。常与他药。堕他儿胎。是故受如此罪。此是华报。地狱苦果。方在后耳</p><p>复有一鬼。白目连言。常有热铁笼。笼落我身。焦热懊恼。何因缘故。受如此罪。目连答言。汝前世时。常以罗网。掩捕鱼鸟。是故受如此罪。此是恶行华报。苦果在后</p><p>复有一鬼。白目连言。我以物自蒙笼头。亦常畏人来杀我。心常怖惧。不可堪忍。何因故尔。目连答言。汝前世时。淫犯外色。常畏人见。或畏其夫主捉缚打杀。或畏官法戮之都市。常怀恐怖相续。是故受此罪。此是恶行华报。后方受地狱果耳</p><p>复有一鬼问曰。我受此身。肩上常有铜瓶。满中净铜。手捉一杓。取自灌头。举体焦烂。如是受苦。无数无量。有何因缘。罪咎如此。目连答言。汝前身时。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>为道典僧饮食。以一酥瓶。私着余处。有客道人来者。不与之。去已出酥。行与旧僧。此酥是招提僧物。一切有分。此人藏隐。虽与不等。由是缘故。受此罪也</p><p>目连复见一天女坐一莲华上。纵广百由旬。此华独妙殊于余者。所欲资生之具堂殿饮食。随念欲得。尽从华出。进止随身。目连问言。作何善行。受报如此。天女答言。<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛灭度后。遗全舍利。诸弟子辈。建七宝塔。高广四十里。时我作女人。出见宝塔中佛像相好。信敬情发。<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。脱头上华。奉献于像。以是因缘故。受报独妙如此</p><p>舍利弗夏盛热时。游行至庵罗园中。有一客作人。汲井水溉灌于树。此人于佛。无有大信。见舍利弗。发小<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。唤舍利弗言。大德来脱衣树下坐。我当以水浇之。不失溉灌。兼相利益。于是舍利弗。脱衣受洗。身得凉乐。随意游行。此客作人。其夜命终。即生忉利天上。有大威力。次释提桓因。便自念言。我何因生此。自观<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。信心微薄因客作溉灌计水。洗浴舍利弗。我若信心纯厚。知必有报。故设浴具。以为供养。自惟为功虽少。以遇良田。获报甚多即诣舍利弗所。散花供养。舍利弗因其净信之心。即为<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。得须陀洹道</p><p>目连复见一神。身体极大。有金色手。五指常流<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。若有行人。所须饮食。资生之具。尽从指出。恣而与之。目连问言。汝是何天。<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>功德奇特乃尔。天王答言。我非忉利天王。乃至非第六天王。亦非梵天王。我是大鬼神乃依其国大城住。为游行观看故来至此。目连问言。汝作何善行。得如此报。答言。彼国大城。名曰罗楼。我昔在中。作贫女人。又织毛缕囊。卖以自活。居计转贫。屋舍坏尽。逐至陌头。近一大富好施长者家。织囊自活。日欲中时。若有沙门婆罗门持钵乞食。问我言。某长者家。为在何处。我心真实。无有虚妄。欢喜举手。指示其家言。彼处去彼处去。日时欲过。勿复余求。以是因缘故。得报如是。贫女人以<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>心。助行施者。得报如此。何况实行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>者也</p><p>佛在世时有五大国王。迦叶佛时。为善知识。出家为道。释迦文佛出世。皆得道迹。今说一王得道因缘。国名槃提。王名忧达那。其国殷富。人民炽盛。王有二万夫人。第一夫人。字月明。容仪端正。王甚爱敬。王时大会作众伎乐。命月明舞。月明夫人衣以上服。金银名宝。缨络其身。舞甚奇雅。悦众欢情。王善能相见其夫人将终相现。不过半岁。奄然殒逝。恩爱离苦。忧戚不视。月明怪而问之。王以死事大故。恐其忧恼。隐而不说。殷勤重问。王便答言。汝<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>短。将终不久。爱离之情。是故愁耳。月明白言。夫生有死。自世之常。何独忧耶。若顾隆念。但相告示。见放出家。王善其言。听其入道。王欲证明果报增益信心。与之结誓语言。汝若出家。持戒思惟。设未成道。必生天上。生天上已。还至我所。听汝出家。月明即许其誓。于是唤诸<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。即度将去。以贵重能舍五欲。多来问讯。恭敬供养。妨其道业。是故游行诸国。从出家日。数满六月。持戒清净。勤思惟道。厌恶<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。得阿那含道。于一聚落命终。即生色天上。观昔因缘。于王有要。要赴本誓。观王没于五欲[怡-台+龙]戾难化。直尔而往。无以感发。宜以恐逼。尔乃降伏。便自变身。作大罗刹。衣毛振竖。执五尺刀。因王夜静卧。去之不远。在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中。王觉已甚大怖畏语言。汝虽有士众千万。今唯属我。不得自在。死时已至。何缘得济。王即报言。我无因缘。惟恃本所作善。修心清净。死生善处。天可之言。如此因缘。最为可恃。更无余理。王便问言。汝是何神。使我大生怖畏退缩。天答言。我是月明夫人。王放出家。思惟离欲。生色天上。今来赴要。王言。汝虽说此。我犹不信。复汝本形。尔乃可信。天即变形。如本月明。衣裳服饰如本在王边立。王欲心发即趣欲捉。月明念言。此人欲态不净。何可近之。于是即还上升虚空。为王说法语王。此身<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。弹指叵保。譬如朝露日出则灭。不惟无常。贪着于身。王不见。盛年华色。老所吞灭。诸根朽迈。目视不明。耳听不聪。形败腐朽。无所复直。譬如酿酒。綟取淳味。糟无所直。是身既老。无可贪乐。唯有死在。是身既生。死常与俱。王不见。胎中死者。出胎死者。壮时死者。老时死者。是身危脆。死贼常随。须臾叵信。身心火然。但是众苦。心有三毒忧恼。身有寒热饥渴众患。而不生厌。贪着我身。宫人妓女。华色五欲。国财妻子。悉非我有。死至之时。无一随去。身自尚弃。何况余物。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>忧喜。无一可奇。凡细愚闇。迷没五欲。回流生死。莫知出路。王是智人。何不厌离出家求道。王时<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>生。许其出家。月明重化之曰。若当出家。当求好师。当闻妙法。闻妙法已。受而<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。日夕<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。翘勤勿懈。说此语已。忽然不现。王至天明。禅位太子。舍离五欲。投迦施延。出家为道。时人以其国王舍重荣利求正真道。臣吏人民。多来供养。恭敬问讯妨<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>业。于是游行至摩竭国。佛为说法得阿罗汉道。诸根静默无所求欲。执持瓦钵。入王舍城。乞得宿饭。斋还林中。坐草而食。洴沙王出游遇见。诣林问讯。汝本为王出入营。从椎钟鸣鼓。人民聚落。赀输库藏珍奇。资生自然。今作乞儿。独行乞食。岂可乐耶。汝还罢道。相与分半国治。道人答言。我大国王。聚落甚多。今复何缘舍大就小。非我所宜。洴沙王复问。汝本食以上味。盛以宝器。今执瓦钵。乞残宿食。不亦难乎。汝本为王。勇夫将士侍卫。今日单独。岂不恐怖。汝本在深宫。夫人后妃。妓女娱乐。好声妙色。盈悦耳目。坐以宝床。敷以綩綖细褥。今日飘然独宿林野。卧敷草蓐。岂不苦哉。道人报言。我以此知足无所贪乐。洴沙王言。汝是可怜之人。道人答言。汝是可怜人。非我也。所以者何。汝为五欲所缠。恩爱所驱使。不得自在。我今心意静悦。无欲自在。快乐种种。为洴沙王说法已。王即还去。问曰。此<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>皆好佛道。欲行菩萨三事。有欲一日一夜<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。有欲七日行者。乃有终身行者。为得几许福耶。答曰。此问甚深。吾不能答。唯佛能知此福多少。自舍如来不能了也。如月氏国王。欲求佛道故。作三十二塔。供养佛相。一一作之。至三十一时。有恶人触王。王心退转。如此恶人。云何可度。即时回心。舍生死向<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。作第三十二浮图。以求<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。由是因缘成罗汉道。是故此寺名波罗提木叉(秦言解脱生死)。自尔以来。未满二百年。此寺今在。吾亦见之。寺寺皆有好形像。王去世后。一人得庵罗树花。其色如金。是人得好花。欲为首饰即自惟念。此头无常。坏时狐狗食啖。粪土同流。何用严饰。即持入佛塔。见佛像相好。心生念言。此是释迦牟尼佛像相好。续念佛功德。佛是一切智人。大慈大悲。十力四无所畏等功德念已。心热毛竖。即以华上佛。上佛已念言。虽闻佛说一华供养必得大报。不知齐限多少。即出见劝化道人。问言。以一花散佛。得几许福德。答言。我厌世苦舍五欲。出家<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>而已。不<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>书。如此深事。我不能知。当问读经聪明者。即往问读经道人。答言。我如画师。随所闻见。无有天眼神通。不能知见善恶果报。即示<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>道人可往问。坐禅道人。上座是六通罗汉。必知此事。即便往问念佛功德。心热毛竖。以一花散佛。得几许福德。阿罗汉即为观之。舍此身已。次第受天上人中福德。一世至千万亿世。从一大劫。乃至八万大劫。福犹不尽。过是以往。不能复知。阿罗汉自以众所推举。一花果报。云何不知。即语此人。小住语已。遣<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>至兜率天上。诣<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>所。具称贤者所说。表之弥勒。得几许果报。弥勒答言。不能知。正使恒河沙等一生补处菩萨尚不能知。况我一身。所以者何。佛有无量功德<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>甚良。于中种种果报无尽。待我将来<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。乃能知之</p></div>"
}]