[{
    "title": "第一章 禅定的益处",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  禅定的益处</strong></p><p>一、为什么有禅定就有定福</p><p>定分为欲界定、色界定和无色界定，如果识心分别与欲界天境界、色界天境界和无色界天境界相应，命终以后就会生到欲界、色界和无色界天中，成为天人，享受天界殊胜果报，处于相应的禅定中受乐，所以定有定福。定福就是世间福，在世间里享的福，享的是三界世间里的福。</p><p>定代表清净，清净就是福，很多人想清净都清净不了，说明他没有清净福；定能使身体心舒适自在，所以定有定福；定能够降伏和消除烦恼，无有烦恼心得解脱，所以定有定福；定能促使智慧生起，所以定有定福。定能排除杂念和杂事，排除干扰，享受清净快乐的大好时光，所以定有定福；定能发起无量的神通道力，能发起广大的殊胜行，能自利利人，成就一切世间出世间事业，成就一切世间和出世间智慧，所以定有定福；定能躲避灾难，如四禅定舍念清净，三灾不及，所以定有定福。只要有心念，就能招灾，有大的造作尤其是有烦恼的造作，更有灾难。心清净舍去念想，无欲无求，就不招感灾难。</p><p>但是四禅定也不是究竟的，禅定消失以后，苦受就会出现，任何一种禅定都是生灭的，不证果不明心，不修到相当高的智慧解脱层次，禅定都会消失的，消失以后烦恼和灾难都会出现。没有见道的定福都是有漏的福，福享尽就没有了，所以还是要追求从禅定出生的解脱智慧，这是永久长存的殊胜果报。</p><p>二、朱清时讲禅定的益处</p><p>朱清时说：一个人一旦入定了，大脑就处于高度有秩序的状态，就类似于我们说的超导体。大家知道像铜丝电线都是有电阻的，因为里面的原子分子在不断地振动，一振动就增加了电流的阻力，即电阻。你一旦把导体冷却以后，就会发生突变，一下子电阻全都没有了，这时候电流极其强大、能量场极其强大。佛学的禅定也是这样的，教人怎么样安静下来，安静之后入定，一点杂念、一点噪音都没有，这时候你的智慧最高。</p><p>佛学的办法，科学不是不知道的，科学实际上也在不断地重复这个办法，但是没有归纳出来，没有系统的办法提高人的智慧，只有靠反复练习、靠实践来慢慢地提高人的智慧，没有这种禅定的系统方法。佛学禅定的方法是认识真理的一个非常重要的手段，这个东西确实是宝贝，它可以弥补科学的不足。</p><p>把意识比作电流，人脑就像导体。如果修持到深度禅定，人脑可以进入高度有序化的超导状态，意识可以畅行无阻，意识场可能极其强大，可以感知到常人无法获得的宇宙真谛。</p><p>三、禅定是苦行还是乐行</p><p>自己修过禅定的人都知道，修定的时候是痛苦还是快乐的，在行走坐卧的禅定中是痛苦还是快乐的，在出禅定以后，心里是痛苦还是快乐的，也会知道在盘腿的时候，即使是腿痛难忍，心里是痛苦还是快乐的。</p><p>这个问题非常简单，只要修了定就会知道修定到底有多快乐，有多舒服，有多愉悦，有多喜悦，以至于不少人放弃了世间其他享乐，而专门追求禅定之乐。禅定之乐是世间所有的乐受所不能相提并论的，尤其是修到初禅定，那个乐言语表达不清楚不透彻，只有经历过享受过的人才会有亲身体会，因为这种特别的特殊的乐受，就降伏和断除了人间的欲乐，对世间法不再贪欲。修到三禅之时，身心之乐简直难以割舍，所以就障碍四禅定的发起。</p><p>修定究竟有多乐，实际修定的人都有体验和感触，不用我多说。说禅定是苦行的人，是从来没有修过禅定的人，靠想象认为修定一定是痛苦的，一定要压伏烦恼，所以心里感觉苦恼。其实降伏烦恼不是特意压制不起的，是自自然然不起烦恼的，因为身心轻安愉悦舒畅，心境开朗了，烦恼就不现行出来了，看什么都比较顺眼顺心，不愿意计较什么了，心量越来越广大，思想境界越来越高。</p><p>如果禅定是痛苦的，过去那些外道们就不会放弃世间一切去专门修定，甚至一直修到四禅八定非想非非想定，只有乐受才会让人执着不舍。古仙人也都是在深山中一心禅定，追求长生不老，追求永生不死，乃至于现代的各种功法都是修定之法，其中都有乐受让人不舍。所以禅定不是苦行，而是绝对的乐行。</p><p>禅定为什么能让人非常快乐？因为禅定能改变色身的四大微粒结构，从而让色身变得更健康、更舒适、更轻安、更轻灵、更自在，甚至能变成类似于天人的色身，没有人类身体那样粗重的感觉，甚至还能发起不同程度的神通。所以有禅定的时候，心是快乐的、愉悦的、舒服的、慈祥的、慈悲的、善良的、无烦恼的、心力强大的、坚强的、所作容易成办的、心量越来越广大的。</p><p>四、禅定能破除色阴的遮障</p><p>禅定能改变色身四大，也能让识心更清明，所见一切法越来越广大。所有众生在没有禅定的时候，眼见色都被色阴所遮障着，远处的色尘见不到，被障碍物遮挡的色尘见不到，闭眼时眼前黑茫茫的一片，也见不到色尘，在禅定越来越好的时候，色身四大有所改变，眼识的遮障越来越轻微，闭眼时就不会再黑茫茫的了，而是能见到光明。在四禅定突破色阴区宇的时候，见色就不受阻碍了，不管多远的距离都能见到色尘，不管色尘被什么阻挡着，眼识都能见得到。</p><p>在刚开始打坐没有禅定的时候，闭眼时眼前的色彩是黑暗的，稍微有一点禅定时眼前的色彩是灰色的，禅定增强时眼前的色彩是红色的，禅定再增强以后，眼前的色彩是紫色、淡红色或者是淡黄色，或者是灰白色的，再以后就是白色的。紫色类似于红色，可能比红色浅一点。这是因为色阴的遮障作用越来越小的原因，禅定确实能减少色阴的遮障，减少见色的局限性。</p><p>修定修到破除了色阴区宇的时候，色阴区宇通过去以后，眼睛见色就一点遮障也没有了，什么都能看得见，不管有什么障碍物，不管多远多高多深多幽暗的地方，都能见得到，甚至是天上地狱和其他佛国土都能无障碍的见得到。修定修到破除受阴区宇的时候，越过了受阴区宇，觉受就消失了，对色身的冷、热、触、痛没有感觉了，苦受没有了，对乐受也不在意了。禅定再深的时候，想阴区宇、行阴区宇和识阴区宇都能越过，七识的功能作用再也没有遮障了，六根对六尘就相对的非常自在了。</p><p>五、神通道力是世间享乐无法比拟的 </p><p>圆觉经里佛陀教导我们修行，成就一切三昧全部是凭靠定慧等持、止观双运的修行功夫，没有无定的乾慧，也没有无慧的邪定，这样成就的才是定慧等持的三昧，依此三昧的力量能够不断的幻化世间一切法。佛有佛的三昧力，菩萨有菩萨相应的三昧力，诸佛菩萨依靠种种三昧力来变化成就一切法。比如变现种种佛国土依靠三昧力，成就大千世界依靠三昧力，示现种种神通道力依靠三昧力，诸佛菩萨所有的神通都是依靠三昧力。</p><p>三昧力离不开定，也离不开慧，比如八地菩萨神通示现把四大海水吸到肚子里，四大海水极其广大无边际，我们地球在四大海水上面就如一只小球，鱼虾龙蟹都被吸进菩萨的肚子里都无觉知。再比如八地菩萨一手托着众生，一手托举着地球，地球上的众生离开地球也不知道，以为还在地球上，或者把众生送到遥远的其他星体，众生也无觉无知。菩萨就是依靠甚深而神奇的三昧力，依靠智慧和禅定，来度化和利益众生。</p><p>我们追求世间的吃喝玩乐财色名食睡，追求一辈子不管得到与否都没有什么意义，根本没有什么乐趣，看看诸佛菩萨们多么神通自在，想变多少饮食就变多少饮食，百味饮食，千味饮食，亿味饮食，变出来都供养给饥饿的众生，自己却不需要饮食。而我们整天把心思和精力放在吃喝拉撒上简直太没有意义了，这样的生活和蚂蚁无异，无数人却沉浸在其中不能自拔，太没有智慧了，把这些时间和精力都用来修道，成就种种三昧，那该有多自在多解脱！</p><p>如果你要当个八地菩萨，在任何一方面的才能和成就几乎都是世界第一，财宝丰盛的无法形容，因为已经不需要财宝了，所以财宝才会越来越多，以至于无限量，都用来利益众生、度化众生。这一对比就明显的看出来，众生的眼光太狭窄了，只能看到眼前这一点，再远一点的，再广大一点的，都不知道了。我们学佛修行人的目光一定要放长远再长远，不要着眼于一生一世，半生半世，或者是眼前几年，再远一点的就考虑不了，照顾不到了。</p><p>这其实就是福德的问题，是严重缺乏福德导致的目光短浅，眼光犹如绿豆大。站的越高，看得越远，看得越远心量就越大，走的路就越快越直接，目标明确就不会被眼前风景牵绊住，如果留恋眼前的风景，后边的路就走不动了。远行时，对于路边的风景不要留恋不已，要毫不犹豫的大踏步向前走。如果贪图享受欣赏风景，路就走不过去了，因为享受贪着风景，就耽误路途了，那么后世在人中本该有的享受就不会出现，享受不到了，比如说你打算死后上天去享受天界的福，那么其他佛国土的更大的福就享受不到了。所以眼前的风景再好，也不要影响你的脚步，不要停下来，要奔着那最高的目标，一心向前，障碍就会除去。</p><p>六、打坐可以治疗耳鸣</p><p>耳鸣主要是因为通往耳胜义根的经络堵塞引起的，气脉运行到耳根部位，通不过去，就出现了鸣音。而打坐修定时，心清静下来以后，四大调和了，气脉运行通畅了，耳根经络不堵塞了，耳鸣现象就会消失。</p><p>如何用佛法主动的治疗耳鸣，可以先找到耳鸣的原因，如果是肾虚的原因引起的，在打坐的同时同时要调理好肾虚问题，再吃黑色的东西补肾，坐时练习晃海。肾虚也可以观想佛光照耀肾处，黑气排除。自己的意念力很重要，禅定好意念力就强。如果是气堵在后脑部位，打坐时就要念药师咒，观想佛光照触后脑，金色的佛光进入，黑气灰气出去，耳鸣就会消失。这样的治疗方法一是靠佛力加持，二是依靠自己的禅定力意念力。</p><p>七、佛菩萨应化世间是否都是不苦不乐受</p><p>不苦不乐受也是一种受，念念生灭，迁流变化，名为行苦，所以有受皆苦。但是不苦不乐受在受中是最舒服最自在的受，不搅扰内心。这种受，一是由智慧引发，二是由禅定引发，三是由禅定和智慧共同引发。禅定和智慧共同引发的不苦不乐的舍受，能既不偏于苦，也不偏于乐，而且比较持久和牢固。</p><p>如果失去禅定，舍受就会有所偏，有时偏于苦，有时偏于乐，会随缘而变。但毕竟还有智慧在支撑着，所以偏差和变化还不算大，能够随时随地作以调整，这种智慧要求是真智慧，是实证后的智慧，不是意识理解的那种智慧。意识理解的那种智慧，本来就没有禅定的依靠和支撑，所以作用不大。</p><p>佛菩萨应化类似娑婆世界这样的世间里，因为佛是无上智，心永远在禅定中，所以永远是无受的，不受一切受，也就不受一切苦乐受，以及不苦不乐受。比如释迦佛的家族被琉璃王诛杀灭门，亲眷所剩无几，但是佛能坦然处之，与平时无异。这是因为佛有大智慧，明了因果法则，知亲眷幻化无常，并非实有什么亲眷，也没有亲眷的情执，再加之佛的禅定力，就能坦然面对这些所谓的不幸。</p><p>而阿难就不行，阿难面对这件事，内心昏暗，痛苦不已。虽然阿难也是再来菩萨，痛苦可能也是示现，抛开示现这件事来说，阿难痛苦的原因，一是因为还有情执，执著于亲情；二是还看不破众生世间的幻化无常；三是看不透其中的因因果果；四是阿难只有初禅定，还是释迦佛加持的结果，初禅定并不常常现前，心不能总是处于禅定之中。这几个原因就导致阿难的心境与佛陀截然不同，不能舍去苦受，处于泰然之中。</p><p>四地以上菩萨四禅八定圆满具足，心永远处于三昧之中，心永远是不苦不乐的舍受，但是七地菩萨之前还有入无余涅槃的趋势。为什么有入无余涅槃的趋势呢？还是因为心不喜乐于世间，其舍受是不究竟彻底的，还有执念。而八地以上菩萨心更空，法执非常轻微，情执已断尽，宿世业障消除得很多了，智慧和悲心就更深利一些，内心永远与不苦不乐受相应。</p><p>初地之前的菩萨因为没有断除烦恼，有烦恼就有苦乐受，有时也有不苦不乐受。初地到四地菩萨虽然断除了烦恼，但是烦恼习气还存在着，比较重，习气现行的时候就会有苦乐受，不苦不乐受的时候比较多，内心平静的时候比较多。这个时期，菩萨大大小小的业障还会现前，如果禅定弱下来的时候，就会有苦乐受，如果禅定一直比较深，心就会很平静，尽管周遭的环境不尽人意。</p><p>总之，菩萨处于哪种受中，还是处于无受之中，在于定慧三昧力，在于业障的浅深，在于执念的深浅和有无等等因素。</p><p>八、外道修的四禅八定有没有用处</p><p>不管任何人，如果修出了四禅八定，就会有效的降伏烦恼和性障，见道的障碍就少了很多，三十七道品已经修出了多半部分，只是见道的正知见不足，有所欠缺。如果善根福德具足，遇到正知见能够信受不疑，智慧就没有了遮障，就有可能马上见道。佛世时有不少外道听见佛讲法，当时就证得法眼净，成为三果或四果人，也有初果二果。</p><p>禅定的功德在于什么呢？就在于能够降伏意根的散乱和攀缘，六识也会随之得到降伏，不再处处分别和造作。这样心就能随时专一一处，思量性强，智慧就能开发出来。如果具足了与外道共通的四禅八定，再思考佛法，证悟就相对容易很多了。所以说定是证得一切法的必要和必须条件之一，也是最重要的直接条件。                          </p><p>智慧是在静中极静中出生的，把心沉淀下来就清净了，清净出智慧，浊水乱志伤情。如果不修禅定而想证果明心，那就是绝对不可能的事，得到的是泡沫般的果实，没有实用价值，观看久了，也会破灭。</p><p>九、观身体不是我对身体有益处</p><p>问：观身体不是我，也不是我所有的时候，打坐时身体就很软，感觉骨头都变软了，这样的观行对身体有益处吗？</p><p>答：观行色身非我非我所的时候，观行专一，就会出现禅定，色身就会变得柔软，这是气脉通经络的现象，对身体有很大益处，不要空身体柔软好像没有力气了，这是调身体的时候，过后身体素质就会改变，体质会增强。凡是禅定境界，对色身都有益处，看天人的色身就知道了，尤其是色界天人的色身，无比美妙，欲界天人的色身也比人身强太多了，原因是禅定和福德的差别。经常打坐，气脉通，身体就会轻安舒服，浑身柔软，但是气力不一定减少，气脉通得好的时候，还会增加力气，身体健康强壮有力气。</p></div>"
},{
    "title": "第二章 如何才能修好禅定",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  如何才能修好禅定</strong> </p><p>一、降伏烦恼修定就没有障碍 </p><p>降伏烦恼，改变不良心性，修定才能没有障碍。禅定的成就不一定是靠久坐坐出来的，戒律严明了，心的攀缘减少了，烦恼减少了，禅定自然修的就快，不用单纯的依赖长时间的打坐来获得禅定。心性很重要，持戒和烦恼轻微，对禅定的生起起决定性作用。</p><p>贪嗔痴慢疑和不正确的知见都是烦恼，各人烦恼的侧重点不同，障道的因缘就不同，有的人非常贪，有的人非常嗔，有的人非常愚痴，有的人非常慢，有的人疑心非常重，有的人知见很不正，但总的来说都是愚痴无明所引起的烦恼，愚痴是总烦恼和大烦恼，没有愚痴，贪嗔烦恼和我慢烦恼都不存在，疑和不正见烦恼也不存在。学佛人平时应该留心观察，找到自己最大最主要的烦恼，以降伏最主要烦恼为主，解决主要矛盾，其他一切矛盾就都能化解开了。降伏烦恼也是这样，降伏主要烦恼，就能基本上消除遮障，其它的烦恼就会随之消除。大的主要的烦恼，是其它烦恼的起因，找到起因，解决起因，缘就不存在了，修定的遮障就消除了。</p><p>二、打坐时如何才能快速入定</p><p>要想入定快，就要尽量放松身心，入座时把身体松懈下来，心也要空，一定要放空身心，要放松胳膊、手和肩膀，放松腿和脚，不要端着肩膀、胳膊和手，全身都要松下来。头也要放松下来，保持自然直，稍微低垂一点，后背要自然直，不要弯曲和挺拔，肩膀应该轻轻地耷拉下来，往后稍微背一背，轻轻松松的不要用力气，浑身都不要用力气，用力气就代表你挺直身，你这一挺身身体就会僵硬，气机就不动了，气脉不容易运动，身体就不容易打通。</p><p>把身体全部放松下来以后，把心都放松下来，空下来，轻轻松松地，除了所观的法，心中什么都不要想，不惦念，什么都不管，即使天塌下来也不管，放舍一切。身体爱怎么样就怎么样，都不用管他，你越管越执，越不容易发动气机，这气血越不容易通过去，禅定越不容易生起来；反之，身心越空，越放松，禅定越好。练习打坐时把自己身心全部放空下来，舍下来，空下来，这样才能尽快入定。</p><p>三、如何才能入定快</p><p>在打坐时如果思考法义，比默念心经入定来的快，还要深，比调呼吸入定快，比用其它方法入定要快。这是对烦恼轻微妄念少的利根的人来说是这样，因为已经有修定的基础，前行方便就可以省略了，而对于攀缘重心思多的初学定者，越思考则心越乱，没有禅定就是杂思，而杂思能乱心，那就等有禅定基础的时候再思考。我上座时腿一盘，什么前行方法都不用，直接进入深深的思考当中，没有意识的思惟，都是意根的思量。盘腿以后，先是关注需要思考的法，然后就定在那个法上不动了，一点妄念没有，这就是意根参禅参究的状态。</p><p>意根思量的深而慢，但彻底，意识思惟的快而浅，不彻底不透彻。意识思惟是前行方便，目的是引起意根的思考，最初这是必须经过的一个过程。在意根思量参究里，几乎没有所得的知识，不会增加知识量，但是很有趣味，有一种探索的趣味，有一种朦朦胧胧要发现什么的乐趣。开发的都是自己心田里的智慧，智慧不从外得，外得的都是知识。到这种程度，就不感觉累了，我可以坐一上午，也可以坐一天。就是心里有牵挂，不得不下座。</p><p>四、如何修定</p><p>最初修定的方法有很多，最初入定的方法，在《修定与参禅证道》这本书里讲过一些，比如调呼吸，调好呼吸在拜垫上做拜佛的动作，身体调理好了，然后再打坐等等，这些小方法比较容易入手，很实用，还讲了打坐的时候心要如何观想，心特别散乱的时候，要如何念咒、念经，调整这个心，然后心定了如何用功参禅，方法书里都有。可以看看照着一步一步的练习，语音文件也有，语音文件讲的详细一些。</p><p>等心稍微定下来，真想要断我见的时候就按照坐禅三昧经和四念处经来修行，经中讲的修行方法既有定也有慧，非常好，四念处修好了，将来大乘任何一关的见道都可以按照那个方法用功，那个用功方法是定慧等持的，只要功夫到位，就能保证见道，证得佛法。</p><p>有的人修定很长时间了，修定的方法可能用的都挺好，禅定也比较深，但是那个定里却死水一潭不出生智慧，定力好了就什么也不愿干了，成天只想打坐，贪求那个色身舒服的觉受，那就没有智慧来参禅，没有观行智慧，佛法知见就很浅。</p><p> 有些人只是一门心思修定，不生起觉照，智慧不好，临终的时候也会随着业而转，因为毕竟没有断我见，没有出离生死的智慧，也没有明心见性大乘菩萨的那种智慧，后世就免不了生死轮回了。只有用定力观行参究，才能断我见明心见性，生死问题才能解决，这是最重要的。现在学佛人的修行有两个极端，一个极端是专门修定，不具备智慧，不想观行，另一个极端是从来不修禅定，只用意识心广学多闻，或者是用意识散乱的思惟，在解上用心，不在证上用心，只有把这两种极端融合在一起，才能证得佛法。</p><p>五、吃素有助于修定</p><p>佛在楞严经中说众生食荤腥食物，有种种的害处，对修道有很大的阻碍作用。所以要想把禅定修好，就要断除荤腥，荤是指吃到身体里就会有不好闻的味道的食物，如韭菜、葱、蒜、蒜台、蒜苗、圆葱等等，腥是指众生的肉体的食物。</p><p>这些荤腥吃到身体里，使得心不清净，容易生起欲念和嗔恚，也容易吸引鬼神的靠近，鬼神喜欢荤腥，他们会舔你嘴嗅味，这样就不利于修行，还容易遭难，也属于变相的杀生，将来要千百倍的还债。依楞严经中佛陀的开示，应该尽快断除荤腥饮食，尽快入道。</p><p>六、如何才能有未到地定</p><p>要想有未到地定，并且保持住，在日常生活中就要让心专注在自己目前所做的事情上，而且是主要事情，一些小事杂事不用太用心。做不重要的事情时，就要专注于自己的内心，外面的事稍微知道就行，不用管也不用挂心。有所失才能有所得，事事挂心，事事不精，最后一事无成。一定要训练自己能够随时随地摆脱杂事的束缚，专心做主要事，心无旁顾才能出现禅定。</p><p>人一辈子要想成功，一定要学会专注，挑主要事情做，没有用的事少用心。禅定修持出来以后，做事的智慧就能增加，然后再做任何事都能做得好。如果样样事情都感兴趣都用心，虽然也有可能样样通，但是却不能精。精比通要重要和有意义得多，精代表智慧，有智慧就会无事不办，包括成佛这件事。</p><p>现代人都比较贪，什么都感兴趣，什么都想知道，什么都想参与，所求太多，关注得也太多，结果却往往一事无成，什么也得不到。不懂得取舍的人，就是如此。你要想得，就要专心求取，就要舍弃很多不必要的人和事，才能满心满愿。人总共只有两只手，却什么都想抓取，结果就像熊瞎子掰苞米一样，掰一棒丢一棒，最后能得到一棒苞米就不错了。</p><p>你们自己检查一下自己手机里的各种app，所关注的内容有多少，就可以判断出来自己到底能不能修出禅定，心里能不能有定。那些东西你关注了一辈子，又能怎么样？世界上五花八门的新鲜事你都知道了，又能怎么样？你能得到什么？你这辈子到底想要什么？还有人学佛学了十年二十年的，却还没有找到一个与自己相应的佛法，什么法都接触，什么法都学，好像很博学的样子，其实什么都没有学到手，什么法也没有懂，毫无目的的东一头西一头的到处乱撞，怎么也找不到归宿。</p><p>七、观落日的照片的这种修定方法好不好？</p><p>两年前我讲过如何观落日，那个观落日的方法，主要是自己亲自观西方天空中的落日，观看像悬鼓一样悬在虚空当中的金红色的太阳，看完后闭眼睛回想自己亲眼所见到的那个落日，这样记忆犹新，观想的效果是最好的，修观想也比较容易，毕竟是亲眼所见，有所依据，没有凭空想象那样困难。其实这些所有的观行方法都是差不多的，只不过哪个更容易上手，哪个方法更适合自己而已。                                            </p><p>不管用什么方法，只要有一个方法能让你成功修出定力，能够清清楚楚的现量观行就好，只要让观行落到意根，意根能够专注的思量，那么你就修成功了。会用意根专注思量以后，遇到任何一个法，都可以做到用意根思量，让意根证法，那就都能获得大智慧三昧，对于所修的法能够圆融无碍。</p><p>华严经中善财童子五十三参，每参访一位善知识，获得善知识的教导之后，就在三昧定中参究，都是意根专注的思量，没有意识的意解，就证得定慧等持的三昧，最后修到等觉菩萨位。善财童子没有花时间学那么多的理论，并不专心搞理论获得丰富的理论知识，而是求到一种法，就在禅定三昧中加以求证和参究，最后获得定慧等持甚深三昧，既不偏定，也不偏慧，这样才是实证，也是最究竟的实证。所以我们修行也要尽量保持定慧等持的修行状态，不要狂慧，也不要愚定，掌握了一种方法就要定中参究。如果一味的学理论，禅定也很难修出来，导致所有的理论都不能得到消化吸收，堵在心中，增长慢心。</p><p>理论多的人赶快沉下心来去实证，说多少理论都不是自己的经验，说也没有用。只有实证的才是自己的智慧，能带到未来世，生生世世受益。修行路数还没有摸透的，一边修定，一边探索路数。两手都要抓，两手都要硬，不可偏废一方。</p><p>观无量寿经中的第一观，如果能完成，禅定已经超过未到地定，甚至可以到初禅了，这是真实修，容易吗？非常不容易。能完成未到地定的人都很少很少，那要失去很多世俗法，才能做得到。修到初禅，那需要降伏极多的贪欲烦恼，对世间所求很少，哪个人能做得到？何况是在家人，世俗习气那么重。所以不要相信这个得四禅，那个得四禅，未到地定就是很大的一个考验。</p><p>人间的世俗欲望降伏了，才能有未到地定。欲界天人的欲望降伏了才能有初禅定。最低的欲望都降伏不了，就不要指望有未到地定。人什么都想得到，权利金钱势力名誉都想得到，还想出风头，显摆自己，怎么能有禅定？好吃好喝好穿好享受，怎么能有禅定？世间什么事都在意，怎么能有禅定？修行与自己身心相联系起来，与自己的一切身口意相联系起来，不断的对照和反思，不断的修证自己，才能降伏自我，才能修出禅定，道业才能不断进步。</p><p>八、禅定能降伏不良习气</p><p>学佛人都应该努力修习禅定，克服旧有的世俗习气，把心都扭转到修道上来，不要过于关注世俗法，累生累世都经历过的东西，再关注也解决不了生死大事。大事抓好了，世俗一切事都不算什么了，大家要有智慧认清这个理。</p><p>降伏和改变一个习气非常困难，能够反观出自己有某方面的习气也不容易。习气之所以叫作习气，就是因为长久熏习，积习太深，根深蒂固。我们每个思想观念几乎都是顺着习气的，没有相当好的定力去反观和觉悟，自己的想法和观念是不应该存在的习气，所以极大多数人不知道自己有什么习气，不知道自己所思所想都是错误的，是无明业障是烦恼，顺之即是趣向生死。</p><p>即使认识到了无明习气，也很难扭转和改变。这就需要我们时时警觉鞭策自己一心向道，发起猛烈的修道心，不断的反思自己的生死业障，思惟人生真谛，认清真正的价值体系，认清世俗法的虚伪和不实，赶快从生死火坑中跳出来，再回头多拯救一些同胞道友。</p><p>九、如何对待定中的妄念</p><p>总有人说不怕念起，只怕觉迟。但是无论怎样觉，念早已经出现，定没有了，那一刻毕竟没有觉悟。后知后觉，亡羊补牢，毕竟羊已经跑了。在打坐时做得好好的，清清明明的，如果突然间起了一个念头，不要理它，让它过去就完了，再接着定。如果理了，就又起了一个念头，两个妄念出现，觉悟念头的妄念，往往会拉长，再后悔起了这个念头，定就很难保持下去了。</p><p>一切法不理会，自然就会过去了，早晚都会过去的，没有一个法一个现象能长久存在下去，生生灭灭的，生出来自然就有灭的时候。灭的时候，那个法根本不是什么了，生的时候也本来不是什么，不理心自清净。万法来则看着它来，走则看着它走，让它自生自灭，自己玩耍，你只当看戏。</p><p>十、呼吸念佛的正确方法</p><p>念佛时，有声音流出于胸腔口腔之外，是气体从丹田内外身体之外运行，是释放气体的过程，那么吸气的时候就不能念佛了，与念佛的音流对冲，因此无法念佛。只能在呼气的时候念佛，吸气的时候就要一心一意的吸气，注意力都放在吸气的过程上，气到哪里，注意力就要到哪里，这样气血通畅，身心舒适，心定下来非常快。</p><p>吸气时从鼻腔入，一直到丹田里，如果心力足，可以让其到达四肢、全身各毛孔中，同时注意体会和感受身体的觉受。再呼气的时候，呼出去的气息是少而轻微的，因为全身细胞都会进行新陈代谢，都会排除废气，这些废气就会通过全身毛孔排出去，毛孔也能呼吸。呼吸念佛方法能让心气合一，身心协调，气血通畅，得定快，定得深，入定时间长，初学修定的人应该从此入手。具体念佛方法详见《修定与参禅证道》这本书。</p><p>十一、学员定中观行体验</p><p>今天早课，按照师尊的教示“那就训练定中能思惟法义，悬在意根里”。先深呼吸几次，既排尽身体的废气，又把新鲜空气灌满全身，由鼻腔、喉腔、胸腔到气海（丹田），再一顿，就压到了脚踝、脚窝的涌泉处，心里就空灵、柔软、和畅。然后静坐念佛，用音声来作佛事，震动胸腹尤其是头脑的各种细胞，达到疏通经络、排污清染的作用，把头部的气脉通过念佛贯通，把脚底的气脉拉抬上头部，形成“南水北调供水工程”系统，而且畅通无阻，以达到打通南北大动脉的目标。</p><p>再者，静坐拜佛，拉松仼督二脉，心里已经空澄、安宁。于是，就把《楞严经》中最难理解的第四卷法义，富楼那提出的“一切根尘阴处界等。皆如来藏。清净本然。云何忽生山河大地”这个问题，把第四卷略作阅读，因为有定力，随读随入，心能够专注于经文中，随文入观而得解。待到相关法义整理后，交给意根反刍，有时，意根丢一个念头出来，意识接过来，哦，是《大般若波罗蜜多经》的法义，马上与《楞严经》的法义对接，不解之处，如汤销冰。</p><p>原来，意识在思惟法义的时候，意根也在里面忙着，不断地默默地契合意识，这是一种定境专注的状态下双方无缝对接。如果平时对这些法义有疑情，意根就在里面忙活了，当静坐思惟法义的时候，意根一股脑儿地把它准备好的法义输送岀来，意识一边接收，一边欢喜地说：“哥们，哥们，正是如此。”都还未开始悬在意根里，意根就决堤而出了。———兄弟，等你很久了。</p><p>所以，平时的念兹在兹，就是意识与意根“公不离婆、秤不离铊”的合作了，其实，这就是动中定力，《大势至菩萨念佛圆通章》忆佛念佛，和我们平时念兹在兹都是一样的，最后，当然是必定见佛，或者必定心开意解，豁然开朗了。今早的早课由意根思惟法义，很快解决问题，又一定一个多小时。真是定中方一日，世上已千年。</p><p>十二、学员修定体验</p><p>这几天做早晚课，打坐的方法六妙门、专注一处、观呼吸等都尝试过了，感觉到师父教的打坐拜佛、打坐念佛和深呼吸最容易操作、上手最快，效果挺好，特别是静坐拜佛，既可以把下肢血脉贯通，又可以拉长背后督脉，对打通任督二脉非常有帮助，而且得定快，就守着那个定境，或者转向思惟法义，都棒棒哒。</p><p>其他静坐方法，比较适合的是系意鼻端，观出入息，如同守门人，这样就不容易受呼吸影响，容易得定，还有，民国蒋乔维修成功的《因是子静坐法》，系意丹田（气海〉，无思无虑，也容易入定，这两个方法，一个是守护玄牝，一个是守护气海，都是抓住了修定的关键环节。</p><p>师父曾经教导过，适合自己的方法就是最好的方法，修定必须靠自己摸索出一套与自己相应、行之有效的方法，才能快速成功，然后，把法义悬在意根里，让意根象牛反刍一样，慢慢消融法义，汇归自性。修行，关键在于思路（见地），思路决定出路，思路越清晰，行动越有力，效果越好。</p><p>十三、如何让念头越来越少</p><p>问：入座后不久首先感觉身体慢慢会定住，呼吸会变的很微弱，同时会发现有念头不停的跳出来，但意识并不会随着念头跑了，有时觉得像做梦一样，每个念头都像伴有模糊的图像，说图像其实更像影子，随着念头起灭一闪而过，像是在清醒的睡觉。这样的状态算是入定吗？用不用再集中注意力在一点上，让念头减少？</p><p>答：这种情况是有定的状态，只有心定下来了，才能发现自己的念头，才能在定力的支撑下不随念头跑。只有在定力的支撑下，才会细心的观察念头，感觉如做梦一样不实，感觉念头就像影子一样虚幻。这样的状态持续一段时间以后，念头就会逐渐的减少了，无论是可以控制念头，还是不可以控制，只有禅定继续深入，念头就会逐渐的减少，甚至会消失不见了。在禅定比较稳固的情况下，就可以深细的思惟法义，参究法义，把所学之理和佛法的脉络捋顺清楚，然后集中心思重点突破。                      </p><p> 在禅定中能发现念头，是谁发现？谁发现谁的念头？这个发现就是意识的发现，发现了意根所起的念头一个个的出现，由模糊到清晰，说明禅定能让意识发现了从前没有发现的念头，并且观察的越来越清晰，这就是定力所产生的作用。如果意识跟随着意根的念头走，意识发现了这点，就叫作意识的反观，是证自证分，发现意根的念头，是自证分的作用。</p><p>意识不会再随念头跑了，这说明意识和意根是能够分离开的，而且是互相牵制、互相熏习、互相影响的，程度比较深入的时候，心更细致有智慧，就可以看得出来，哪个识心是烦恼染污的，哪个识心稍显清净些，或者是都染污，或者是都清净一些，然后还可以看得出到底谁能牵制谁，谁能影响谁，谁能熏染谁。原来是意根染污重一些，能牵着意识跑，现在有禅定，定力增强了，意识觉悟了就不跟着意根妄念跑，再以后会怎么样？继续修定，意根的念头就会越来越少了，心会越来越清净，染污会越来越轻微。这时候思考问题就会很深入细致，条理脉络清晰明了，智慧得到提升。</p><p>意根攀缘会带着意识跑，让意识念头不断攀缘不止，意根攀缘的表现就是念头不断，心思烦乱。如果说到意根有攀缘性，很多人都承认，可说到意根有念头的时候，有人就会反对，因为很多人根本不知道攀缘的含义是什么，只会背书不能依法，才说意根没有念心所。可实际上意根如果没有念心所，心就不乱了，好坏事都不能出现，在世俗界就类似傻子一个，在修行上就说明心已经非常清净了，禅定深了。实际观行自己的身心世界，才会生出智慧，知道事实是如何的，有如实智，知如真。背书就是依人，不是依法，法需要自己如实的观察，观察出智慧了，就会证得法。</p><p>十四、在行住坐卧中也可以修定</p><p>修定的目的是修心，让心止下来，虽然身止的时候可以减少心动，能让心也止下来，但是如果在身止的定中心很清净了，功夫纯熟的时候，在身体有规律的动中同样可以保持心止和心定，虽然在身体的活动中保持心止稍微困难一点，但还是可以做得到身动而心不动。身动心不动的时候，遇缘比较多，更能考验心的定力，同时证道的因缘也多了很多，这对参禅是比较有利的。断我见也可以在身动的情况下触缘遇境激发出灵感，从而证得身空我空。</p><p>同等程度的禅定，身动的定比身止的定更能体现出修定的功夫，定力更坚固一些。这需要身止的静中的定来保养和维护，二者兼修就会相得益彰，互相促进。一般来说完全的身止，也是一种障碍，不利定力的增强。所以打坐一段时间就应该起身经行，活动一下，气血更通畅，心会更静，头脑思惟更深透。</p><p>十五、修定有多种方式方法</p><p>每个人修定的方式方法不尽相同，一是因为人的根器不同，二是因为禅定来自于多方面，任何方法都可以入定。有的人思惟法义时，禅定就会消失，心里散乱，而有的人思惟法义时，定力生起却很快，禅定也深。后者是靠智慧引导禅定，促使禅定生起和深入，不仅仅依靠打坐来引生禅定。智慧是拨开云雾见光明的手，使用智慧把心引向所思的法义之处，专一而思，禅定生起，定慧结合。而定慧等持最容易出生三昧，获得解脱的果证。</p><p>在修行过程中，应该善于发现自己的特长和优势，扬长避短，则修行快速。智慧好的人，不必与别人一样都从四念处起观，或者都从白骨观起修，不断摸索修行路数，可以制定一套适合自己的独特修行方法，只要发现自己按照这个路数修行进步很快，那就坚持下去。因为毕竟修行路数有无量之多，根器有众多差别，所以不可能是每个人都千篇一律的用同样的修行方法。</p></div>"
},{
    "title": "第三章 禅定与色身的关系",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  禅定与色身的关系</strong></p><p>一、身受与禅定的关系</p><p>身识的受觉，一定要修到四禅定才能消失，不受触尘的影响，外道都能克服灭除色身的觉受，只要有四禅定就行。意识的觉受一定要断我见才能降伏和灭除，五识上的受依赖禅定就可以灭除，意识的受一定要依靠智慧才能灭除。五识的觉受，也可以用转移注意力的方法压伏下来，转移注意力也与禅定有关，注意力不在疼痛之处，就不能感觉痛觉。有些法是用禅定就可以解决的，而有些法一定要依靠断我见的智慧和明心证悟的智慧才能解决，而有的法必须是禅定和智慧相结合才能解决。</p><p>二、四禅定中的色身依靠什么维持</p><p>当修到四禅定的时候，身体上是什么现象？我们原来是用口鼻呼吸的，现在呼吸却停止了，不仅呼吸停止了，心脏脉搏的跳动也停止了，气血运行的现象都停止了。心脏和脉搏起什么作用呢？随着心脏的一收一缩，就把血液输送到全身各处，起滋润身体的作用，如果身体要正常的运转，就需要气和血，气带动血循环往复的在全身运行。血就是营养，是我们身体这部机器所需要的养料，没有养料机器无法运转。在一般情况下身体这部机器运转的越快，需要的养分越多，需要的气血越足，这就需要心脏的功能越健全，这样才能保证身体正常运转，这些气血就是身体需要的四大，由四大种子组成。</p><p> 当禅定很深的时候，身体运转变慢，内脏消耗的养分少了，需要的气血没有那么多了。当身体以最低限度的消耗一点养分，新陈代谢缓慢，不需要那么多四大养分的时候，呼吸就停止，心脏脉搏的跳动也停止。但这时候还是需要少量的气血以维持生命体的存在和运作，只不过不再通过呼吸、饮食等粗重的四大养分，身体毛孔吸收周围空气中的四大微粒就够用了，身体中的废物也会通过毛孔排放出去。而如果一个入定的人，被放在密闭的罐子中，就会因为缺少空气里的四大供给而憋闷死。</p><p>色身也是四大组成的，色身和周围环境是互融互通，互相影响的，物质之间也能够互相传送四大微粒，所以说物质的四大是不断的向外发散的，互相之间有熏染性。也就是说，外界的物质能通过身体每一个细胞，输送这些物质微粒，然后吸收成为身体里的物质，而身体里的物质同时也会往外发送四大微粒，这样输入输出能达到平衡的状态，身体就正常了。色身可以吸收外界的四大养分来维持身体的运转，外界的物质环境就能影响色身，同理身体的四大也会向外发送，身体也能影响外界的物质环境。那么众生身体之间就有一定的联系，也能互相影响，姑且把这种现象叫作共业吧。</p><p>欲界众生进入四禅定以后，身体就依靠周围的环境来滋养，色界众生在定中也要依靠微细的四大滋养，无色界众生没有色身，就不需要四大物质的滋养了。没有禅定的时候，身体消耗的四大养分非常多，身体和思惟活动越多，消耗的四大越多，需要的气血越多，妄念比较多的人消耗的气血就比较多，需要吃的饮食比别人要多，妄念少的人消耗的就少，身体活动少的人消耗的也少。</p><p>我们应该把色身当作一部机器，其实它就是一部机器，这部机器的运转需要消耗养分，要想正常运作必须给它补足养分，机器运转的越快，工作量越大，需要养分越多，需要的能量越大。人类需要的能量从饮食当中来，从物质生活环境当中来，机器需要润滑油运转。如果你想让这部机器长寿，就要减少它的运转，减少工作量。因为机器运转的时候会有磨损，会消耗机器，运转的多了，损耗的也多，机器慢慢的就要变旧，各种功能会衰退。人也是同样的，人的活动量过于大了，人体这部机器磨损的就越大，寿命就会越短。</p><p>禅定当中人的妄念非常少，或者没有任何妄念了，身体也不活动，他需要的养分少，内脏的活动就少，磨损就少，有禅定的人普遍色身健康，而且长寿。现代人不懂，都讲究要活的好吃的好玩的好，要享受饮食，却不知道吃的越多，吃的养分越高，那么身体的内脏工作量就更大，磨损的就严重，这样身体就越不好，越不容易长寿。所以吃的多，吃的营养高，内脏很不容易消化吸收，需要的工作量非常大，内脏消耗的就大，不容易长寿。要想长寿，就要减少身体的磨损，减少工作量，减少运动量，再多修禅定减少妄想。</p><p>禅定能让心静下来，身心活动量都少，磨损少，寿命就长，等修出四禅定以后，寿命长短就由自己来决定。如果想提前舍寿，到其他世界去，比如天界，由自己来作主，如果不想提前舍寿，或者想活到一千年一万年，也由自己决定，因为四禅定当中有神通，对于身体的去留能自由的作主，生死时间由自己作主。但是还不能完全自在，因为还没有断我见，六道轮回出不去，只是这世的生死由你说了算。没有四禅定，于此世的生死就是不自在的，想提前舍寿除非自杀，你想多活一年半年一天一小时，也不由你说得算。</p><p>身体就是我们修行的一个道具，从客观的角度看待它，调理好它，而不执它，不把它当作我和我所，则能很好的利用身体来修道，最起码不让身体成为一个负累，拖累我们生死轮回不休。</p><p>三、修身与道的关系</p><p>当身体出现障碍了，影响禅定，这时候再特意去修身，如果身体健康没有障碍，就不必特意花费时间精力去修身，禅定不受影响和阻碍就不用管身体，忘记身体才会有禅定。如果心里总是有身体的观念，一是阻碍禅定，二是身见难断。空去身体，忘记身体，不去惦念和照管它，禅定容易出现，身见容易断除。</p><p>现代的人与古时的人用功正相反，古时人不在意身体，不管身体，不往身体上花费时间精力，结果禅定很深，证道很快。现代人几乎个个唯身体是从，宝贝得不得了，找借口说照顾身体就是为了修道，结果道没有修成，身体也不一定照顾得好。毕竟业障摆在那里，无论怎样保养养生，身体还是一大堆问题。即使把身体保养好了，内心里的身见也增加了不少，由于身见不断，后世还是苦受不尽。想一想值得吗？为了几十年的身体，而耽误了道业，有珍珠不要，却捡沙粒，多愚痴啊！</p><p>四、禅定能突破色阴区宇</p><p>真正突破色阴区宇的时候，才能不受色身的影响和阻碍，单独修禅定就能突破色阴区宇，禅定需要修到四禅，才能无障碍，就像虚云老和尚那样。理论需要禅定配合，没有禅定只是空玩嘴，徒有思想，而无行动力。我们修学的那些理论，需要在禅定当中去实际观行和参究，然后才能实证，之后才有一些行动力。如果没有实证，意根就不能去改变什么，就会依然故我。不管你心里认为世间多么如梦如幻，没有实证，说是说做是做，丝毫改变不了什么。改变由意根来改，做由意根决定做，意根实证才能做得到。</p><p>五、为什么腿盘得越紧定的效果越好</p><p>一般来说打坐的时候，腿双盘比单盘定的效果好，单盘比散盘定的效果好，散盘比伸腿定的效果好。因为腿盘起来的时候，腿上的气血大都凝聚在上半身，气血凝聚起来，能量集中，运行的就畅快有力度，浑身的经脉才通畅，身就容易调整好。而身调整好了，心就舒畅愉悦，心念集中，得定就快而深。而伸直腿就不容易有这样的效果了，伸开腿，气血也有一部分分布在腿上，气血运行的力量比较分散，力度就不足，不容易打开经脉，身就调整得不充分，当然心就不那么安宁了。</p><p>那么盘腿的时候是不是腿上就没有气血运行，导致瘫痪呢？当然不会，盘腿的时候腿部仍然有一部分气血运行，以保证腿的正常存在。而且气血在上半身运行的时候，也会往腿部运行，运行的力度大，容易把腿部经脉打通，排除腿部疾病，得定也会很快很深。</p><p>六、身心都通畅之后的觉受</p><p>问：当身体的所有经络都通畅以后，在呼吸时丹田收缩和扩展力量是否就减轻了？</p><p>答：经络都畅通以后，身体会极其轻安，没有一点负累，甚至感觉不到有身体，就像大海虽然是流动的，但表面寂静无波，湛然不动。这就是禅定的结果，加上观行智慧，三昧很容易出现。比如骑电动车，如果没有风，就感觉不到阻力，风越大感觉的阻力越大，色身的存在感越强。再比如人心，越无所求，越开通，越放松，越没有纠结，越感觉不到自我的存在。反之，内心就会有很多纠结，自我存在感越强。自我存在感越强，越在意自己，越在意别人对自己的看法和态度，越自尊自爱自傲，是非越多，越不平静。心不通，是非多，身不通，感觉多。</p><p>七、肉身与四大的关系</p><p>时间这个虚假的法很奇妙，如果一个人能飞到天界呆几分钟再折返回来，人间可能已经过去几百年了，人的寿命已经几辈子过去了，可是这个人还是与从前一样年轻，一点不老。为什么如此？  </p><p>衰老与否在于肉身，肉身由四大微粒组成，生灭变异无常，肉身就会不断的成熟发展变化。四大构成了维持肉身需要的气血，如果气血活络，肉身得到充分的滋养，就不容易成熟和衰老，人就显得年轻。气功和各种功法都能让气血活跃流通，滋养肉身，所以练功练得好的人面貌一般都显得年轻。时间能显示出四大的生灭变异，时间越长，生灭变异的越明显，肉身越成熟越衰老。总之年轻与衰老在于四大种子的发展变化。</p><p>天人的色身为什么不衰老？因为天人色身的四大构成与人类色身的四大构成不同，人类的四大粗重，天人的四大微妙，天人能飞，人类就不能飞。人类上天以后，随着天界的生存环境，吸收天界的四大微粒，色身四大也会发生改变，肉身就与天人接近。天人来到人间，吸收人间的四大微粒，色身就向人类靠拢，四大也会发生改变，与人类接近。比如说二禅光音天的天人来到人间，食人间地味，色身四大马上就发生改变，不再能飞行自在，回不到天上了。</p><p>气满不思食，气就是四大组成的物质能量，打坐修定气足了以后，就不感觉饿，可以不吃饭或者少吃饭，身体轻盈舒适。因为气的四大与饮食的四大有区别，气的四大细致轻微，气足能让肉身飘升，饮食四大粗重能使肉身沉重。所以少吃饭，多修定，身体会更健康。饮食即使营养再高，也是粗重的物质色法，不是最好东西，不如气的营养好。</p><p>八、调息的结果  </p><p>平常在空气比较清新的环境下，多做深呼吸，多用呼吸念佛法调理身心，这样容易打通气脉，心清净，头脑清醒，思惟敏捷。行走坐卧都可以调理，不限制身体姿势。人活一口气，气息调好了，等于补充了四大养分，身体就健康了。同时配合冥想，观想气运全身，佛光照耀全身，全身轻松健康，病气业障气都会排出体外。息和身都是四大组成的，调息等于调身，观息也等于观身。观身最后就会空身、无身。</p><p>九、气沉丹田妄想少</p><p>言多妄想多就会劫功德法财，把气修到下丹田，就不愿意想事情，妄念少了，语言也少了，比较专注，记忆力也好了。气到下丹田时，行走坐卧都在下丹田，不用刻意调息和用意念引导，睡觉时气也在下丹田。气在下丹田时，心很沉稳，波澜不惊，心思深沉，考虑问题比较深透，烦恼少。</p><p>十、佛与道在修定上的区别</p><p>学佛修定与道家修定有一定的区别，因为修定的目的不同，方法上就要有一定的区别。道家修行的目的是为了色身健康长寿，并不想解脱生死轮回苦，所以他们修定非常注意色身，全部注意力都在色身上，不在意解脱的智慧。学佛的人应该在修定的基础上多在智慧上用功，修定时关注身体的方面不要过多，道家那些修身理论接触一点就行，我们学佛修定是为了获得智慧得解脱，只有身体不出现障碍，不影响思惟参禅，可以不用管它，为色身花费太多精力不大值得。</p><p>十一、修身的原理</p><p>人体当中本来就有先天之气，大多被后天的饮食给遮挡住了，不能充分的发挥其应有的作用，饮食吃的越多，遮挡越严重，废物垃圾越多，身体越沉重，禅定就越难修。为了调动好自身所具有的先天之气，就要意守丹田，让气汇聚丹田，丹田气具足了，就会发动气机，把气供应到全身，带动血液循环往复的运行，身体的机能就得到激发和运用。</p><p>无数人一辈子都没有利用好身体本来就具有的真气和机能，都是被饮食习惯压制住了。婴儿刚出生的时候，身体机能运行的很好，身体柔软富有弹性，幼年童年时期，身体柔软度高，双腿都能盘得很好，越长大身体硬度越大，腿越难盘，身体垃圾越多，气血运行的越不好。身体里这股先天之气只有通过减少饮食和修炼功法，才能得到释放，发挥其应有的功能作用。所以能充分调动身体的气脉，就能修好禅定，改善体质，延年益寿。修好身体和禅定，才能保证我们的道业不受阻碍，而且不断的进步。否则身体不健康，心就不自在，心修不好，怎么能有道呢？</p><p>我们通过辟谷来修身修心，在辟谷期间不能吃饭，身体还需要能量，那么我们就要运化和吸收其它能量，比如光能、气能。而光能最终也要转化为身体所需的气能，气能带动血液循环和运行，以维持身体能量平衡。吸收光能，一个是晒太阳，一个是打坐观想阳光进入身体里，成为身体里能被利用的能量。还可以念咒观想佛光进入身体里，供给身体能量。同时要把身体里的病气寒气湿气毒气都排出身体之外。这个观想修好了，就会非常有益身体健康，比饮食还要清净，还有受用，没有副作用。</p><p>再练练功法以补充身体能量，增加阳气，具体可以采取如下方法练习：（一）两只手从后背握在一起，往上抬，能提升胃气和肺气，拉伸膀胱经，后背就能挺直了。（二）两只手举起来，在头顶握在一起，身体不动，转动胸部以上。（三）两只手在小腹前手心向上，成抱球式，徐徐往上抬，同时深呼吸，抬到头顶，抬脚后跟，翻掌，停一会，气吸满，然后两只手从身体两侧放下来，气呼出去，脚跟落下。增加肺气。</p></div>"
},{
    "title": "第四章 戒定慧三学",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  戒定慧三学</strong></p><p>一、定慧齐修不走偏路</p><p>要想学佛修行更快一些，就要弄清楚修行的理路，分清修定方法与参禅观行方法的区别，然后再找好目前修行的侧重点，免得耽误时间。比如说如果要降伏前五识和意识，让六识清净下来，不去了别和感受五尘境界，这是修定的方法。用这种方法修定，定力提升之后还是要用五识意识去观察尘境，参究尘境，认清尘境和五蕴世间的生灭变异性和所含藏着的真实相，以获得证悟的智慧。有了这样的智慧，才能解脱生死苦，修行才能如愿。</p><p>再比如说有些人修行一心想着不要境界和泯除境界，这是单纯的修定的方法。但是当定力具足以后，需要实证佛法的时候，就要在五蕴境界上观行才能断我见和明心，获得智慧是离不开境界的。修行应该要先修定，然后再修慧，观行佛法参究佛法，只有定慧等持地修行才能证得佛法。如果没有定力，就去观行，所观皆不成就，其最好的结果也就是个解，但解的话，犹如隔靴搔痒，远水不解近渴，因为解的东西不属于自己所得，意根没有破除无明，就不得实证的智慧，所以解就没有什么实际用处。</p><p>修出禅定之后要如理如法的观行，小乘观行五蕴十八界苦空无常无我，大乘在小乘观行的基础之上，参究是谁见色闻声，是谁参禅参究，是谁拖死尸。观行参禅必然要在尘境上进行观察关注，注意力不分散到不需要的法上去，就是在定中观行参禅。</p><p>修行不能像外道一样一味的修定，一味的对周遭的一切法不见不闻，不觉不知，这样不能开智慧。修行不仅心要定，还要有知，有智慧的知，有一个法不知就是愚痴，成佛就无望。外道一味地修定，心虽然清静，遇到一切境界都不动心，甚至能八万大劫入定，一事不知，痴痴呆呆，可是出定以后如果恶业现前，就会直趣地狱，释迦佛的老师就是这样。即使全世界的人合在一起，都赶不上这样一个外道的心静，可是没有解脱的智慧，最终还是在六道里轮回。如果不能明了五阴无我，不明了世间真相，就不能获得解脱的智慧，免不了继续在生死轮回之中挣扎。所以学佛修行要定慧兼顾，戒定慧齐修，才能不走偏路，直趣涅槃城。</p><p>二、戒定慧三无漏学的功用</p><p>漏是指贪嗔痴烦恼和种种无明，烦恼和无明漏掉的是善法、善愿、善心和善根，心善能脱离轮回苦，心善能成就佛道，把善法漏掉了，恶不善法就盛行，生死轮回苦就不能断绝，因此就要通过修行去除无明烦恼，让心地达到无漏，善法增胜，苦灭轮回息。</p><p>实现心地的无漏主要有三条渠道，那就是戒定慧三无漏学，通过持戒使心无漏，通过修定使心无漏，通过修慧使心无漏。持戒为何能使心无漏？因为能持戒，心就不会违越戒律，不再作恶，不再造作贪嗔痴有漏烦恼业，习惯了善法以后，自然就不再想造作恶业了，烦恼就得到了降伏，善法得到增长，四正勤就修出来了。长期持戒，心得到有效的收摄，不再处处攀缘，禅定就出现了。</p><p>禅定为何能使心无漏？因为心在定中无所作为，不攀缘不散乱，不造作贪嗔痴染污业，就把烦恼降伏下来了，出定之后由于惯性作用，定力也能保持在一定程度，不喜攀缘，心安而不乱造作，仍然能够降伏烦恼漏。如果未到地定具足，就能断除欲界五品烦恼，成为初果向，现世就有因缘条件证入初果。</p><p>外道们的四禅八定定力更强，不但能降伏欲界九品烦恼惑，也能降伏色界九品烦恼惑，乃至于能够降伏无色界九品烦恼惑，这种降伏不等于断除和断尽，因为还缺少五蕴无我的智慧，如果遇到四圣谛理，依甚深的禅定力，敛念稍一思惟就能证道，烦恼立时就断尽，身心脱落，无我无四相。当证得四果阿罗汉时，须发自然就会脱落，袈裟著身，这代表烦恼断尽，自然就是出家人。</p><p>在三果以前因为还有烦恼残留，就不能须发自落，袈裟著身，也就不能自然成为出家人。所以如果是在家身的人想不用通过受比丘戒和比丘尼戒，就要成为出家人的话，就要断尽烦恼，须发自落，袈裟著身，不用人剃度，在家身只要有一丝烦恼就是在家人，如果非要说自己是出家人那就是强行盗取出家僧宝身份，混淆僧俗，属于极重罪。</p><p>智慧为何能使心无漏？证得无我的四圣谛理和大乘真理的智慧能破除无明，心中无我就不会再为我而造作烦恼业行，不为我就无私，无私就是善，善能破烦恼，心就无漏，有我就漏掉善法，有我即有罪，有我即有烦恼。这个无漏慧是以戒和定为基础的真慧，没有戒定的慧就是乾慧，没有实用价值。戒定慧三者统一在一起，共同断尽一切烦恼，善法永不再漏却，当善法圆满具足之后，就成佛了。</p><p>三、观行与禅定的关系</p><p>禅定是止是定，观行是观是慧，二者合起来叫作止观，也叫作定慧。禅定和智慧观行是相辅相成的关系，要想证得任意一个法，必须定慧等持，止观双运，缺一不可。在佛法修证过程中，禅定是先行方便方法，所起的作用非常重要，不可或缺，否则就是乱观和盲观，没有主线，也不会一心深入地观，只停留在法的表面情思意解，不能观行出实质之法，得不出如实的结论，多数是意解，不是如实观察和现量证出来的。</p><p>世尊在最初教导弟子证小乘果的时候，都是一边教导理论，一边教导禅定，让弟子们定慧等持，不偏不倚，弟子们则一边禅定一边思惟观行，这样做功夫非常得力，烦恼得到有效的降伏，思惟也慎密，不久之后就证得了小乘果。其中世尊教导的修定与观行同步的法有四念处经和坐禅三昧经，以及禅法秘要经等等。只有通过禅定降伏烦恼和杂念之后，观行才能走上正轨，才能做得到如理如实的观行，心地才能转变，才能具足三十七道品，从而证果。如果不修禅定，没有禅定的功德，三十七道品和八正道都不能满足，烦恼仍然很重，心地仍然不清净，身心世界都不能转变，则证道的因缘不具足，不能证道。</p><p>外道们遇见佛陀为什么证果那么快，瞬间就能证得四果？原因就是外道们都有禅定的证量，烦恼都得到降伏了，心地也清净了，出离心也很强，只差正确的法义了，佛陀一讲法就会入心，顿时心开意解得法眼净，立时就解脱了，就这么快。所以任何人都没有理由不修禅定，抱着侥幸的心理，想不费力气就得到一个果，在佛教界里真的没有这么便宜的事，得便宜处往往会失便宜。大乘菩萨们证法也需要相当的禅定，所修出来的禅定，也都是此世和前世从修小乘的时候打下的禅定基础，大小乘在禅定方面没有多大的区别，基础禅定的修行都是相同的。</p><p>禅定是降伏烦恼的前行方便，降伏烦恼类似于压服烦恼，不是断尽烦恼，初禅定加上断我见的智慧，才能断除烦恼，甚至是断尽烦恼。先要降伏压服烦恼，不起恶而生善才能断我见，再深修定，有了初禅才能断除烦恼，成为心解脱的三果人，断除烦恼以后的三四果人才可以叫作圣人。佛教里从来都是定慧等持的证果，定慧等持的断烦恼，定慧等持的得解脱。如果烦恼太重，杂念太多的时候，没法修禅定，观行更是杂乱无章，但是可以先思考世间苦，心能平稳下来时，再修定，然后观行，观行之时定力也会不断地增长，定力增长了，观行会更深入，因此说禅定与智慧是相辅相成的。</p><p>四、禅定增强以后应该着手参究观行</p><p>问：打坐时念头越来越少，意识越来越清明，这样内守悠闲有什么用呢？这时候如果思考法义是不是就容易意识解悟，将来就无法证悟？坐到内守悠闲以后我应该如何用功？</p><p>答：在禅定达到养生内守悠闲的时候，心念能够专一了，就要思惟佛法，包括四圣谛理和大乘的般若，如果大小乘的理已经明了了，就要观行五蕴断我见，这时候就不要用意识的思惟了，要用意根思量，把有关五蕴无我的疑情悬挂在意根心中，时时处处让意根思量，这就是参究佛法的功夫。</p><p>禅定的功德受用有很多，比如能增长智慧，降伏烦恼，心得清净，业障减轻等等，在禅定中观行参究能够断我见和明心见性，这对于凡夫位的大多数众生来说，是一段时间内的最终和最高的功德受用，但还有其他的功德受用，比如说内心祥和，身心舒适安泰，改变体质，色身健康长寿，善心增加，恶心减少，所作的善业和不善不恶业增加，恶业减少，后世就会趣向于善道，升天享福。</p><p>初入禅定中，很多人都没有思惟力，不会思惟佛法，心就处于没有念头的空定中，名为内守悠闲的定，没有思惟当然就不能悟道。但是出了禅定以后，会有一个惯性，定的状态会延续，那么身心也仍然是比不修定的时候要舒适和愉悦，其心会比平时要深沉，思考力会加深，浮躁性会降低，由于身心愉悦饱满，其心就和善、祥和、安宁、无烦无恼，待人接物就会宽厚仁慈，遇到事情思惟的深透，处理事情柔和、中道、不偏激，容易看透人事物理，这样自然就会增长福德，增长智慧。这个功德受用没有禅定的人是没法比拟的。</p><p>在禅定中不断的训练自己的思惟力，培养思惟的习惯，慢慢就会如理思惟，如法思惟观行，提升智慧。但是这种思惟不一定就能解悟佛法，如果担心会解悟的话，在最终的观行和参究的时候，就避免意识的思惟，学会用意根思量。在对佛法的脉络还不够清晰的时候，对于所学法义还不够通顺的时候，首先就需要意识的思惟，去理清佛法的脉络和纲领，并且以此熏修意根，让意根明达佛法需要如何的修行，需要如何的用功才能证得佛法。</p><p>这个基础打好了，需要最后实证的时候，就要加深禅定，满足未到地定，这个时候就要以意根的思量为主了，意识配合意根，少作思惟分析推理等等情思意解活动，尽量让意根自己去参究和考量，这样才能达到最后的证悟，避免意识的解悟。这是定慧等持的修行步骤和方法，掌握了以后，就能熟能生巧，功夫牢固了，后世也会避免意识解悟的假修证模式，得到佛法真实的受用。</p></div>"
},{
    "title": "第五章 有关禅定的概念",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  有关禅定的概念</strong></p><p>一、觉观之义</p><p>觉观也叫作禅定和三昧，总共分为三种三昧：有觉有观、无觉有观和无觉无观。在初禅定之前的禅定里，意识心处于有觉有观或者是有寻有伺的状态；在初禅至二禅定之间的禅定里，意识心处于无觉有观或者是无寻唯伺的状态；在二禅定以上的禅定里，意识心处于无觉无观或者是无寻无伺的状态。</p><p>觉是了知、觉知、觉察境界的意思，觉的时候五遍行心所法和五别境心所法都能运行，有思惟活动。观相当于照的意思，意识心不动，没有思想和思惟，但能直观的照见诸法，五遍行心所法和五别境心所法都减少。二禅以上五识灭了，意识却没有灭，有非常微细的知，但没有反观能力，不知道自己有知，好像都灭了一样。</p><p>二、参禅和观行的区别</p><p>参禅和观行，含义有一些差别，观行贯彻修行的始终，有深有浅。而参禅是集中精力全力以赴的参究自性清净心，明了心之功能作用、体性和运作。参禅里有个禅字，代表着真心自性，参真心自性对于修道来说是至关重要的，以此为起点，证悟以后渐趋涅槃和成佛。而观行涉及到的范围比较广泛，层次上深浅不一，任何时期、任何境界都可以拿来观行，一切法都可以进行观行，得出的成果可大可小，观行时间可长可短，只要有一个满意的结论，观行就告一段落，再遇到不明了的问题，再继续观行。</p><p>三、念佛三昧境界</p><p>问：师父告诉我们上坐的时候，要先念三遍“南无本师释迦牟尼佛”，我念了之后，无论是上坐还是下坐，都会自动念这个佛号，不是需要念很多遍，心里就自动念佛了，这是怎么回事？</p><p>答：这是最初步的念佛三昧境界，就是禅定境界，念佛打成一片了，不念而念，意根自动念，不用意识提醒，也可以不用意识念，意根可以单独的自动念佛，也可以与意识一起念。意根单独念佛时，禅定境界深，与意识一起念佛时禅定境界浅。这也可能是佛力加持的结果，一般人心散乱，信力不强，不容易出现这种念佛三昧境界。</p><p>有些人把独头意识见到种种佛的境界叫作念佛三昧，其实这是感应，不是念佛三昧。感应虽然也是善根的显现，但是与念佛三昧有区别，念佛三昧时间会长一些，二三十分钟或者几天几夜不等，佛号声在心里自动生起，余音袅袅，不绝于耳，绕梁三日，身心轻松愉悦，有可能感觉身体在空中飘，高大轻灵，没有障碍，没有身体的沉重感觉。</p><p>四、念佛三昧对应四禅八定的哪种定</p><p>念佛三昧分为定境的念佛三昧和定慧等持的明心境界的念佛三昧，无论哪种念佛三昧，都有具足的未到地定，或者是初禅定。禅定是三昧的基础，没有禅定，任何一种三昧都不会出现，什么法也不会成就，后世就会继续流转生死苦中。所以大家不要满足于广学多闻，不要满足于知识的广博，不要口耳相传的知见，一定要深入禅定参究，力争修出真智慧，不要相信没有禅定照样可以证果和解脱的胡说，要相信佛经中佛所说。</p><p>五、灭尽定、无想定非想非非想定的区别</p><p>无想定里没有六识，意根心所法五遍行心所法全部都在；灭尽定里没有六识，意根心所法灭去受想两个。灭尽定是俱解脱的大阿罗汉境界，如果不是具有四禅八定和断尽一切烦恼的大阿罗汉，不可能入灭尽定中；无想定是外道定，定里的人还把色身当作我，我见不断。</p><p>非想非非想天的众生，意识心的五遍行心所法灭除一部分，所以意识属于半有半没有的状态，与无想天众生有色身全无意识的状态，还是有差别的。无想定和睡眠深沉时，都没有六识的存在。如果再生起六识的念时，必须是意根对六尘境界生起作意和思心所，想要了别六尘时，第八识才出生六识来了别六尘，于是就出定或者是醒过来。</p><p>六、未到地定过暗是一种什么状态？</p><p>未到地定过暗境界，是修到未到地定的时候，心中无念无想，修出了空定，于是在未到地定中没有念头的入定很长时间，甚至能入定几天十几天。这是纯粹的定，没有思惟和观行，也没有疑情，与智慧无关。</p></div>"
},{
    "title": "第六章 禅定与见道的关系",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  禅定与见道的关系</strong></p><p>一、见道所需要的是什么样的禅定</p><p>见道证悟所需要的定力，是不是一直都保持不断的，还是提起时有定，需要时就有定，平时就没有定了呢？如果修行的禅定比较坚固，心就会一直在定中，只是有时强有时弱，世俗里事情多就会分心，这时定力就会变弱。如果修行的禅定不坚固，上座的时候有定，下座时就散乱没有禅定了。</p><p>证果和明心所需要的禅定是比较坚固的禅定，这样的禅定深，思惟观行才能深细而连贯，功夫才能持续，观行智慧才能越来越好、越来越深。这就像烧开水一样，火一直燃烧不断，锅里的水才能越来越热，最后才能烧开。如果火断断续续的，锅里的水就会一会热一会变凉，这个水就不知道什么时候能烧开了。</p><p>修行最低限度的禅定，就是观行思惟时一定要有连续的禅定，要在禅定中观行思惟，保证思惟观行的连续持久以及不断的深入，能保证观行思惟很长时间，定力都够用，否则功夫容易断，保持不下去，思惟不连贯，就无法观行到位而断我见。而且禅定最主要是保证意根能起思量，一心思量参究，不间断，禅定浅意根攀缘就多，不能专注思量佛法，就不能见道。只要禅定足够深，其它见道的因缘具足，戒定慧具足，随时都可能证道。</p><p>二、禅定具足才有能力参究佛法</p><p>学佛不是学知识搞研究，而是要有参究的能力，要去求证，不仅仅是求解。如果禅定不足，各种见道的因缘不具足，因为聪明万一把如来藏推测出来，推测出来的结果差不多，大体相近于如来藏的状态，可能就不好再做功夫参禅了，如果再认为自己悟了，那可就麻烦了。在戒定慧和见道因缘不具足的时候，如来藏这块先捂着遮着盖着，以便于参禅因缘具足的时候参究证悟。所以我不希望你们大家搞研究，因为法差不多已经挺明朗了，聪明的人再研究，研究出差不多的结果，真的很麻烦，还是等菩萨条件具足时在禅定中参究吧。只有多修禅定，才能有能力参究和观行，才能实证佛法。</p><p>在世间学堂里学习比较优秀的人，有多少个到社会上成为栋梁之材了？知识只能让人生存得好，不见得有创造力。学佛想要实证，就应该与世间做学问有所区别，否则学佛就是学知识，知识不能让人解脱，只有实证才能让人解脱。佛的大弟子周利盘陀伽是四果大阿罗汉，在他证果之前人很笨，证果之后也不会讲佛法，可是他就是俱解脱的大阿罗汉。我们都不至于那样笨，所以对于知识的领悟和学习，适可而止，把主要精力用于参悟佛法上，用于实证上。</p><p>三、不用明心证果也可以修出初禅定</p><p>初禅与明心之间没有必然的联系，没有明心和证果，也可以修出初禅定。外道就是如此，他们甚至都修出了无色界的非想非非想定，远远超过初禅定。因为过去时期的外道们心很清静，能够远离世俗界，深山修道，对世间没有贪心，容易发起禅定。再加之那时候整个社会人心都比较纯朴，物质和信息都不发达，环境熏染得不那么严重，人心里的念想就非常少，得定自然就快。</p><p>在现代社会物质信息发达的环境条件下，修定就不太容易，初禅定就更难修了。所以只有在断我见之后，才稍微容易修出初禅定，在证果明心之前，很难修出初禅定，但不妨碍有例外，有特例。在刚刚证果获得的三昧中，如果能趁热打铁，继续加把火，初禅定不久之后也许会出现，过了这个三昧阶段，心会懈怠一些，禅定比较难修，初禅就不容易出现。所以把握修初禅定的时机是很关键和重要的。</p><p>四、在什么禅定中才能证果</p><p>禅定也叫作三三昧，第一种是有觉有观三昧，第二种是无觉有观三昧，第三种是无觉无观三昧。第三种无觉无观三昧也叫作无寻无伺，是二禅定境，这时候五识灭了，意识微弱，没有觉知，也没有观和反观力，不知道境界，也不知道自己入定。既然在二禅定里慧弱不能起观，就不能发起无我等等的智慧，所以在二禅里不能证果。一般情况下是如此，特殊的人可能除外。</p><p>第二种无觉有观三昧，是初禅至二禅的中间定，没有意识粗重的觉知，但有微细的观。在这个定里意识微弱，如果意根没有受熏，心里没有疑情，断我见证果就困难一些，而在初禅的定境里，有觉有观，一心专一，观察力强，才容易断我见证果。在三三昧之前的未到地定里，禅定力也很强，一心专一，也能断我见证果。</p><p>修定和观行达到伺的状态，就是参禅的功夫，把这个功夫练成就了，生生世世受益无穷，因为任何一个法的证得，都是在伺的状态下证得的。再浅一点的定，都有解的成分，智慧都不太真实可靠。</p><p> 五、一切菩萨的证悟和修行都离不开禅定</p><p>古时所有的菩萨们修行都有很深的禅定，能离开修定的案例在佛经里没有记载过，哪个菩萨修行是不用修禅定的，是不通过甚深禅定而证得种种三昧的？而所有的禅定都离不开打坐的静中定。很多菩萨证得三昧的过程各个佛经里都有记载，没有打坐修定的过程和经验就不是真正意义上的菩萨了。菩萨们虽然都修心，但是修行的时候，心和身体是不能分开的，因为身心是互相影响的，身体不好就会影响心的平静，烦恼就无法降伏和断除，心不安静就不细致，无法深入观行和参究，就不会证道。</p><p>楞严经第五章和第六章里介绍了诸大菩萨们证悟种种三昧的过程，都是在打坐的静中定证得三昧获得甚深智慧的，佛陀三大阿僧祇劫的修行，在佛的本生经里全部都介绍了，没有一生一世不是盘腿打坐修定而证道的。在参禅和思考法义的时候，和思考其他问题的时候，仔细品一品，是打坐时思考清晰，还是走着站着思考问题清晰？心在什么情况下最稳定、安详，最细致？都是在静坐中，只有身体稳固了稳定了，心才能稳固和稳定，才能安心，静下来安稳的深思和参究。</p><p>过去的祖师们禅师们，没有一个人修行不盘腿打坐的，静中定都非常好，甚至很多人都有四禅定。有四禅定二禅定的人，哪个能站着走着修出来？就是初禅定和未到地定，哪个人能离开打坐修出来？有的人可能感觉自己并没有打坐过，好像也有未到地定，但是这个人即使有未到地定，那也只是一时，长久不了，不大有坚固的参禅功夫。不管怎么样的禅，都不可能离开打坐的功夫，有了打坐的功底，才能做得到行亦禅坐亦禅，语默动静皆安然。</p><p>还有的人说，修定太浪费时间了，不如把禅定舍掉，省下时间多多闻法思惟。这个观念太无知幼稚了，俗话说磨刀不误砍柴工，用一把锋利的刀才能快速的砍下柴禾，短时间内就能砍出一大堆柴禾，如果拿把钝刀子，或者空手上山砍柴，能折断几根树枝？真正的修行不是把大量时间都用在多闻上，只想多吸收别人的知识和现成的理论，而是以自我修证为主，以开发自己内心的智慧为主。众生是以智慧和福德成佛，不是以知识理论成佛，获得智慧断除无明结缚，不是用理论知识断除的，而是以自我修证出来的智慧断除的。而要想修证出智慧，只有在禅定中依靠禅定，才能出真智慧。有知识仍然免不了生死轮回。</p><p>还有另外一部分极端的人只修禅定不用脑，成天就是傻傻的坐，而没有思考的功夫和能力，不会思惟佛法，下座以后心也不在法义上，修的纯粹是枯禅，没有智慧的生发。修行佛法一定要圆融，不能走偏，执著哪头都无法修成就。宣传佛法也一定要宣传符合佛说的正确的修行方法，依诸佛菩萨修行的事实为准，离开事实，那就是不符合事实，就不是真理，不是真理依止其修行就不能得道和证道。</p><p>六、实证佛法必须修定</p><p>如果每个人都能按照大念住经的方法修行，小乘很快就能成就，禅定肯定能成就。可是现在人心太散了，无法完成这些观行。佛陀住世时，比丘们都是这样修行的。</p><p>现在来看，我们修行需要的大小乘理论部分已经差不多够用了，差只差在实际操作，实际操作必须修习戒定慧，完成菩萨六度修行，尤其是福德和禅定两方面修行。个人修行困难，就得要共修了。佛陀在世，从来没有领着弟子共修过，都是各人盘腿打坐观行思惟佛所讲过的法，然后就证果。</p><p>现代人生活工作太忙，无时间打坐，可是禅定确实修不上去，思惟肤浅不细密，无法实证，这也是事实。静坐以后的定，与只有行走坐卧的定，二者之间的差距之大，只有静坐过的人才能体会得到。自己想办法，自己要对自己负责任。不是说懂得一大堆理论，就是有道了，能侃侃而谈就是有道了。实证之后，即使不是能言善辩，那也有道；能言善辩而没有实证，也不是道。实证才能解决生死大问题，没有任何一个法能比道业更重要了，宁死也要道业成就，否则活着时世俗法再成功，也没有什么用。</p><p>七、如何提升自己的修证功夫</p><p>如今的世间太繁乱，学佛人即使想精进，由于自心和环境的约束，也是无法精进到位，很多人觉得心有余而力不足。如果想在佛法上有所突破和成就，在理论认知上已经比较深入和完善了，需要实证的时候，就应该远离世俗法一段时间，离开原来熟悉的束缚自己身心的环境，找个僻静无人打扰的处所去修定参禅，把修证的功夫提升上来。如果想要证果，更需要有个单独的清净之地，供自己参究参修，否则就没办法提升自己，以至于最后见道证果。</p><p>八、最关键的定是什么？</p><p>在修定当中最关键的定，是要与修定所达的目标相一致的定。修定的目标是什么呢？是要明理和证理开智慧，那么心就要定在所要明的理法上，心心念念在法中，专一于所修的法，这样才能专注的思量，最后思量明了，就证得法获得三昧智慧。所以最关键和首要的定，是意根定于法中，有证法的意愿，有明理的意愿，有观行的意愿，有参究的意愿，有解脱的意愿，这样才能专心一意的观行参究。修定方向明了，修定和修道的理路就与外道有明显的区别了。</p><p>意根如果还没有这些意愿，就不能定在所修的法上，那么禅定就不可能修持出来，因为内在动力不足，外在的定力就修不出来。善根福德因缘都不足，没有发大菩提心，就不会有动力，突破不了所处环境的熏染和限制，犹如蚕被茧所缚。如果意根动力不足，不能定于法上，禅定就修不好，观行就不得力。修定修不好的人，应该检查自己有没有发菩提心，发心是否纯正，内心有没有动力。</p><p>意根的定首先是定于法上，然后意识才能定于法上不散乱，专心观行。因为意识是随着意根转的，意根的指挥棒时时刻刻、刹那刹那都在指挥意识，如果意根不定，拿着指挥棒到处乱点，意识根本定不了。所以禅定最关键的还是把意根定住。意根定住以后，时刻念着法，就会精进修行，动力强，禅定修行就很快。意根定在小乘四圣谛上，就会精进修学三十七道品上，定在大乘般若智慧上，就会精进修行菩萨六度。只有意根精进修行佛法，意识才能精进，意根懈怠了意识就精进不了，意根具足了三十七道品，意识必然具足。</p><p>九、禅定和见道的关系</p><p>禅定从未到地定开始都能对治烦恼，能降伏烦恼，只有降伏了烦恼，去除或者减轻了遮障，才能证得初果。初果人虽然只有见地，只断了见所断的三缚结，但是断除三缚结，一定需要未到地定。虽然未到地定需要修定才能发起，但是与修所断烦恼，不能划等号，不是一回事。</p><p>初果的见地是见道时所断的见惑，还有思惑烦恼没有断。虽然思惑烦恼是在见道以后通过进一步的修道才能渐次断除，但是也属于见地，见地越透彻，越到位，我和我所断除的程度越深，心越空，烦恼越轻微。初果的见惑虽然是初次见道时所断，但是初次见道，也是渐次修道的结果，不修就不能断除见惑。修道的内容就是三十七道品，三十七道品其中之一就是禅定，不修三十七道品或者三十七道品修不满足，就不能见道，更不能断见惑。所以未到地定就是初果人见道所应具足的必要条件。</p><p>在初果见道之前，必须把从前的贪嗔痴烦恼降伏到一定程度，使得贪嗔痴烦恼不至于影响和遮障自己见道。在三十七道品的修行过程中，把极重的贪嗔痴烦恼逐渐降伏下来，烦恼逐渐微薄，心逐渐柔软，智慧逐渐明朗，所有的遮障犹如密布的乌云渐渐稀薄，智慧的阳光才能透过云朵显现出来，于是就见道了。在见道之前的烦恼淡薄微薄，只是与从前严重的烦恼相对而言，不是二果时贪嗔痴淡薄的那种程度，二者是有差别的，都是从相对性的角度来说的，词汇虽然相同，内涵绝对不同，所以二者不能混淆不分。</p><p> 四圣谛内涵包括苦圣谛、苦集圣谛、苦灭圣谛、苦灭道圣谛，其中苦灭道圣谛就是修道的真理，所依据的理论。这个理论的修学，从初果之前就开始了，一直到证得四果阿罗汉。所以修道并不是见道以后才开始的，是在接触四圣谛的时候就开始修道了，在最初修行四念处观的时候就开始修道了，不修如何见道呢？三十七道品中的四正勤：一、已生恶法令断；二、未生恶法令不生；三、未生善法令生；四、已生善法令增长。这些修善灭恶的修道内容正是对治众生烦恼的，对治之后降伏了烦恼，使之轻微，才能见道。</p><p>十、证果是定慧结合的产物</p><p>外道们修四禅八定，修到色界天的无想定时，意识心消失了，没有意识心还有色身的境界，他们就认为没有心的境界是真实的，于是就执着这种境界不舍，不能断我见证果。其实在无想定里虽然没有意识心，还有意根和色身，并不是空无一物，所以这不是证四果的涅槃境界。</p><p>而外道们修到无色界天的非想非非想定时，定里好像是没有了意识心，其实还有非常微细的意识心存在，可是他们自己感觉不出来，就把这个境界当成是证果的涅槃境界。一个人只要不把五阴十八界全部舍弃掉，即使修到三界中最高的定，也不能证果。所以禅定只是证果的条件之一，还要有断我见的法眼净智慧，不是单单依靠禅定就能证得涅槃的。把禅定修到初禅以上之后，只要确认色身和识心的虚妄性，就能证果。而要有这样的确认，需要具足观行智慧，定慧具足，才能证果。</p><p>十一、证得空以后的身心觉受</p><p>没有禅定的人，理解了五蕴皆空无我之理以后，几乎没有什么身心的震撼性的觉受，只是觉得空，仅仅是觉得而已。因为没有禅定，所作的观行根本触动不了自我的根本意根，也就不会有什么身心上触动，更没有震撼之感。只有来自于内心深处意根的触动，身心灵才会有真正的比较深沉和巨大的觉受，从此自己才会感觉就像变了一个人似的。</p><p>目前来说，因为大众的福德以及禅定严重不足，观行上触动不了意根，所作的观行，也就仅仅停留在意识上，观行的结果就是理解了五蕴皆空，感觉自己是空的，实际上并没有空，遇到事情就过不去，理是理，事是事，二者就没有交集不能圆融了。这是目前学佛人的通态，不敢说通病。</p><p>真正证得空以后的觉受，也不适合公开讨论，可以私下问过来人。如果公开说出来真实的感受，有些人知道了，就会到处暗示自己有这样的感受，实际上是暗示自己证果了，目的是为了获得某些东西，名闻利养上的等等。人心不古，自然不单纯，世俗心太严重，无孔不入。</p><p>十二、证与不证的区别</p><p>问：手碰到电流被电得发麻哆嗦，这是否属于证得了电流？盲人用手触摸到灯泡，是否证得了灯，却不能证得灯光？</p><p>答：证与不证，要看具体情况而定，因人而异。比如说科学家触电，百分之百了知电流的原理，其证甚深，相当于佛教里的唯识种智了。而小孩子触电，不一定能知道是怎么回事，即使知道是被电着了，下次会躲着尽量避免触电，也不一定了知电流的原理，不一定了知电流的作用，因此就没有证得电流。盲人手摸到灯泡，也不一定知道是灯泡，首先他得有灯泡的相关概念，眼盲之前见过灯泡，或者是别人告诉他灯泡的样子，他才能知道是灯泡，否则尽管摸多少次灯泡，也不知道是什么。</p><p>同理可知，众生无始劫以来一直都与如来藏打交道，活在如来藏里，时刻用着如来藏，也不知道有如来藏，也不知道如来藏是何相貌。六祖听闻一句话就证悟，其他人听闻一百句对那句话的解释，离证悟可能还遥遥无期，证与不证，关键在当人，智慧根器是相当重要的。阿罗汉听闻凡夫学佛说的一句话，就证得了四果，凡夫学一百年阿含经，也不得初果向，人与人之间没有可比性。</p></div>"
},{
    "title": "第七章 如何参禅",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  如何参禅</strong></p><p>一、禅宗不立文字是什么意思？</p><p>禅宗也叫作宗门，佛法之宗是真心如来藏，禅宗就是参禅证悟真心如来藏的法门。如来藏虽然没有语言文字和声音，但是整个参禅过程也是不用语言文字和声音的，用语言文字传达出来的都不是真心，所以在参禅的时候，传法者和受法者的语言文字和声音就没有用了，所有的书籍理论没有用了，参禅者心里也不用念念有词、絮絮叨叨、哼哼哈哈的了，剥离了可对比的外缘参照物。</p><p>这样就没办法海阔天空、情思意解，比量非量地尽情发挥，意识没有发挥余地了，老老实实的全凭意根现量的思和究。虽然辛苦，彻夜难眠，但成果丰厚，能挖掘出内心意根的潜能和智慧，一旦挖出自家宝藏，从此就会过上自由富裕的日子，再也不用流离失所地乞讨度苦日子了。</p><p>这时候外面的文字和心里的文字，都不管用了，使不上力了，唯有依靠自身的智慧，这样才能开发出自己本身的大智慧，什么推理，什么分析，什么整理，什么归纳，什么拆分，什么整合，什么臆测，什么想象，什么比对，什么教量，什么理论，什么知识，什么学问，全都用不上了，意识歇下来，不用忙碌了。这时候负责任的禅师会告诉你，把佛经拿开，禁止读经看书，违犯者戒尺伺候。一旦参到关键时刻，挨打是绝对的好事，虽然语言文字都用不上了，但还可以挨打，被打的时候照样没有语言文字和思惟，但却能触动意根的灵感。</p><p>在师父给棒子的时候，如果意识很活跃，就会立刻思惟分析说这个可能就是，但结果是：错！意识又分析推理说：真妄和合，这个没错，但结果还是：错！你又进一步用排除法推断臆测说：这个不是眼识，不是耳识鼻识和身识，也不是意识和意根，一定是第八识，但最后结果仍然是：错！你敢动意识，无论怎样都是一个字：错！三个错之后，你再不觉悟，禅师就会给你推出禅堂，甚至会给你推出禅院禅寺，不要你了，因为你还不是道器，没资格参禅。当然具格的禅师是不会乱打棒子的，一定会看准了参禅者的心理状态，在最恰当的时机给棒子，这叫作当机一棒，抛掉一切尘境和情怀，现量识得非尘境非情怀的那个。</p><p>过去祖师大德总说，偷心不死不能悟道，贼心不死不能悟道。偷心和贼心都指什么心？偷什么不能悟道？是谁偷？偷什么了？参禅的时候，怎么去除偷心？参禅时候的偷心，也可以说是投机取巧的心，走捷径的心，是直接把别处的知识理论拿过来当实证当亲证的心。因为不是意根自己亲证的，意识投机取巧拿过来的名为偷。过去常常用一句话来形容有真实证量的祖师们讲法，说是这些法都是从自己心窝子里陶出来的，意思是说祖师们所讲的法，都是自己实证出来的，是自己的智慧结晶，不是意识从别处搬弄过来的现成理论知识，或者是把学来的理论进行整理归纳加工一下，改头换面变成是自己的，因为这样不算作悟道，也会耽误悟道。</p><p>什么叫作自心现量？从自己胸襟里掏出来的才叫作自心现量，胸襟心窝子都是指深深的意根主人那里。与此相反的，是意识不费力的解出来的，不用修戒定慧和三十七道品解出来的，是与学来的理论知识和别人的见解作比对参考推测出来的，这差不多就是白白拿过来的。意识这样的做法差不多就是偷了，偷心不死，意根不能思量参究，就不能证道。意识学了大量的法，实质上都属于偷，因为不是胸襟里的，不是自家的，都是别处的法，是耳入口出的法和现学现卖的法，都不是自家宝藏。</p><p>二、在禅定中可以用疑情替换咒语来参究</p><p>问：平时默念楞严咒已经养成深处提着的习惯后，如果内心深处对法起了疑情，是不是就可以用疑情替换咒语，这样就能行走坐卧都在参究了？</p><p>答：默念楞严经功夫很深的时候，就有了禅定，意根也能一起念咒。禅定深的时候，意根容易起疑情，那就把心里的念楞严咒的念换成参禅的话头，或者换成疑情，在定中专注的参究，不能有一丝毫分心，这样才能有效的解决疑情，出生智慧。没有什么比出生智慧更重要的事情了，念咒也是为了这个最终目标，念咒仅仅是入道的最初方法而已，不能把念咒当作修行的目标，应该当作工具使用才对。</p><p>三、在寻和伺的定中正好参禅</p><p>问：在浅定下，让意识和意根处于一种很敏锐的伺的状态，在这种状态中感觉自己能隐隐的看见自己的身体，能敏锐的觉知到周围几十米发生的细微事情。识心处于伺的状态就是：意识和意根都很专注，被动的感知周围发生的事情，但识心不对发生的事情刻意着意和了别，只是知道这个事情在发生，类似于冷眼旁观不动心念的那种状态。这种状态如法吗？</p><p>答：伺的状态当然属于禅定，而且定的程度比较深和专一，心没有寻的时候粗糙和分散；寻的状态也是禅定，定得比较浅，因为心分散，动的多一些，定就浅。在伺的状态下，心不动却有知，时间长了对于所知就会有智慧性的认知，就能看破所知的法，知法为空，心就能空，从而到达舍的状态。</p><p>寻和伺都是有目标的，而且目标专一，才能出现禅定。有的禅定里没有慧，有的禅定里有慧，禅定里有所缘，才有慧，空而没有所缘就没有观察慧，是纯粹的空定。寻和伺都是清明定，都属于正定，但是在寻的阶段定浅动多，不够静，伺的状态是参禅的后期状态，最容易出生智慧，这时候是以意根为主的思量阶段，意识不动，或动得少而轻微。</p><p>问：如果在很安静的环境保持这种伺的状态，会慢慢感觉周围的时空像凝固了一样，身体也像若有若无似的，识心仿佛游离于身体之外，在静静的感知一切。等从这个状态出来后，发现自己的思维力和感知力比平时要强不少，这可能是识心保持专注后带来的效应吧？当处于这种伺的状态时间逐步加长时，发现意识意根专注力越来越大，觉知力也越来越敏锐，还发现呼吸和心跳越来越缓慢，越来越细长，真担心哪会没了呼吸和心跳，就死了。</p><p>答：在伺的状态，意识只保持一个知，没有多余的心念，意根不受干扰，就会深细专一的思量，慧就容易生起。意根的慧一生起，就能看破所缘境，看空所缘境，就容易证道。如果没有到达伺的状态，意识的思惟活跃，意根的思就会受阻碍，没有真智慧生起。意识所思惟推理分析判断出来的结果，不会落入意根那里，意根不接受，那这个人的意识无论有什么看法，最终仍然是看法归看法，心行归心行，互不交涉，修行仍然不上道。很多人都说自己证果了明心之类的等等，而身心世界却没有一丝毫改变，相反烦恼还会越来越重，慢心反而炽盛起来，那就是意识所分析思惟出一个理，而意根不认，所思所想所做依然故我，还是旧时人旧时的行履，名是圣人名，心是凡夫心。然后又纷纷退转退道，很可怜。</p><p>四、如何离心意识参禅   </p><p>没有禅定或者是缺少禅定的观行和参禅，根本离不开意识，更离不开意识的分析推理和想象猜测。这是过去禅宗祖师们最忌讳和反对的参禅方式，是祖师们经常反对和嫌弃的情思意解。所以要想离心意识参禅，让参禅的结果更究竟更现量，就要努力修出禅定，让未到地定具足，然后再参究观行佛法。这样意根用力多，就会保证实证，而不是意识的解。</p><p>在观行和参禅当中，意识用的越多，作用越大，其效果越打折扣越不如意，越不顶用。意根用的越多，作用越大，爆发力越大，后劲越大，跑的越远，悟的越深，三昧力越大，智慧越利，烦恼越轻，心越解脱。</p><p>五、如何在二禅以上禅定中思量参究</p><p>诸佛都在四禅定里成道，一般人在二禅里就不能参禅了，因为这时意识太微弱了，没办法协助意根思惟考量，只能凭意根自己单独的思量作用。那么诸佛在四禅定里悟道，而且是极深极深的大悟、彻悟、究竟悟，彻法底源的悟，没有意识的协助，意根该是什么样的智慧？</p><p>二禅以上不能参究法义，这是对一般人而说，实际上在二禅以及更高的禅定里是可以思考参究，可以入道的。那么如何在二禅以上定中思量参究？</p><p>那就要在入定前，意根要具有极深的疑情，心心念念都是疑情，没有其他思想念头，其他法都屏蔽掉，这样就一心一意缘于一法，深深的疑，深深的参究，一心想弄清楚法义。这样的话，上座时刚刚把腿盘好，意识就会灭除明显的心念，心清净，不干扰意根的思量，五识由于无所事事就会灭去，二禅定出现，于是意根一心参究。因缘现起时，意根有了杂念，促使意识生出念头，于是五识出现，就出二禅定了。</p><p>意根在二禅至四禅定中思量参究，不仅五遍行心所法具足，五别境心所法也要具足，其胜解力和慧力不是一般的强，而是非常强大，才能悟道，才能把法义参究通达，生出三昧力，处于三昧之中。定慧、胜解力、念力差一点，都无法悟道。意根五别境心所法强大的人，都不是普通人，非圣人莫能为，普通人凡夫和贤人应该精进修持，努力增强意根的五别境心所法，以使道力更强大，修道迅速。</p><p>六、在未到地定和初禅定里才能参话头</p><p>问：如果见道需要在未到地定、初禅、二禅、三禅、四禅，那么禅宗的参话头开悟见道，是否符合佛理?</p><p>答：参话头没有未到地定和初禅定，就参不了，只能在心里念念话头，其实是念话尾，话头是找不到的，那何谈开悟见道呢？在未到地定和初禅定里才能参禅，才能悟道，二禅以上五识就灭了，意识微弱，不能参禅，除非意根被话头熏得很深很深，也许能单独参。过去禅宗祖师悟道都是在初禅之前的定里，他们既打坐修静定，也在日常活动中参禅，二种定相得益彰，悟道才快，只有其中一种，悟道就难一些。</p><p> 七、循第二月觅第一月就是参禅</p><p>如果有人惹我，我就给他一棒子，这一棒子就是第二月，是空谷的回音，依此去找本真第一月，第二月的根源。这有多痛快，畅快淋漓，何必像瞎猫碰死耗子似的，成天坐那里打坐，坐到没有什么妄想了，清静了那么一下，然后与第八识的清净体性对照，就觉得这样的清静境界，没有什么念想，也没有什么妄想，这不就是我的本心第八识吗？不就是我的法身如来佛吗？</p><p>谁教你这样认如来佛的？若如此，在你有妄想、有念想的时候，你的如来佛是不是死的，还没有出生？在你以后定力消失，念头生出来，妄想出现的时候，你的如来佛是不是就消失灭亡了？若如是，你的如来佛怎么是有生有灭的？怎么是有增有减的？怎么是能变化的？怎么是一会儿有一会儿无，需要不断看着的？</p><p>事实是，你这没有念头和妄想的清静境界就是第二月，是从第一月那里转过来的，你不要停留在第二月上，要赶紧追着它的路径去找第一月，那个第一月本来就是清净的，任何时候都是清净无念想的，不用你打坐就本然存在着的，那才是你的真心，是法身如来佛。</p><p>还有人错认啪的一下，前念已断后念还不生的中间空档，觉得历历孤明、了了分明、清清楚楚、明明白白的这个，就是自己那个无念无想本自清净不生不灭的本心如来佛主。若如是，在你啪的一下截断妄念之前，佛主在哪里？还没有出生吗？一会妄念出现了，你的佛主又去哪里了？灭了？没有妄念时清清楚楚的是什么？明明白白的是什么？清楚明白个什么？</p><p>事实是，你这个前念已断后念还不生的中间空档，只是第二月，是第一月幻化出来的，你要循着历历孤明的境界去寻找背后的本尊第一月，这就是参禅。本心自性如来从来不清楚不明白你现在的清静无妄念境界，也从来不清楚不明白任何一种世间五阴境界，祂什么都不知道，无见无闻不觉不知，既不孤也不历，既不在中间，也不在两头。倒是生灭增减的虚妄法意识，一会儿有妄念，一会儿无妄念，一会儿清楚明白，一会儿糊涂不明白，一会儿孤历一会儿宣闹。真认得自心佛的时候，不管你干什么，即使杀人放火，自心法身佛也仍然存在，仍然起妙用，祂没有灭过，时刻刹那都有相应的功能作用，不是空空的呆呆的什么也不干的傻佛。</p><p>祂不是只在你眼前晃动，同时也在你背后默默承事你；祂不只是在你心清净没有妄想和烦恼时出现，也在你混不吝的时候出现，也在你大闹天宫、倾邱倒岳的时候出现；祂不仅在你上天堂时出现，也在你下地狱时出现。你若真发现了祂，就会处处都能发现祂；如果你在别处不能发现祂，那么你在此处发现的就不是祂。真认识了一个人，这个人到哪里你都能认识；认错了一个人，在其它任何地方，你都不能认识真人。</p><p>八、如何觅菩提</p><p>菩提只向心觅，何劳向外求玄。听说依此修行，西方只在目前。</p><p>释：菩提为什么向心觅呢？因为菩提就是心，是哪一种心呢？有什么特征特点呢？菩提向哪个心觅呢？从哪个心上能觅到菩提呢？</p><p>心在身内，或者说在自心内，心不在虚空中，不在外相外尘境上，也不在他人身上，所以寻觅这个心不需要你向外去求索，说玄说妙的都不用，只要回头向心内找就行了。但是这个心时时处处与一切法打交道，包括他人，包括外境，也包括虚空宇宙器世间。当你在与这些外境打交道的时候，回光内敛，反观自心，就能照见这个菩提心。因为菩提是有用的，时刻都起用着，没有闲时，那就要在种种用中觅祂，同时不要被外境蒙蔽了双眼，只见外境，把外境当真，这样的话就不能照见菩提心了。</p><p>这就叫作参禅，只有这样修行，就能证得自心，证得光现大千界的菩提心，证得能圆满成就一切法的菩提心，证得本来就是佛陀的自心如来。找到如来，依之改变七识染污心，使之如菩提心般洁净，如菩提心般的无我无私，如菩提心般的清净无为，如菩提心般的利乐一切有情，这样的修行，能圆满佛道，成为内外通透光明挥发澈照无边际三千大千界的如来，与自心如来合，就会变现出无数大千世界如极乐世界般辉煌美妙，极乐世界时时处处都在眼前，度尽一切苦众生，归于寂灭道场，常乐我净。</p><p>九、觉醒生命泉</p><p>问：如何做，即能见光明？曰：直接用意根观照。但意根这个台阶太高，需要用意识这个脚踏板铺垫，用意识一步步引导意根观照。</p><p>问：见而不分别，听而不分别，做而不分别，无将迎，无内外。即能见光明？曰：若如此，木头石头也不分别，也能见光明。问：有分别但不住于心，即用即离，可否见光明？曰：无明用，无明离，有何益哉？这是修定法门。问：记得师父讲过：意根一作意即止，一触即止，不受，更无想思。可否见光明？曰：这是纯粹的修定，不是参禅，不能开智慧见光明。</p><p>问：知道诸法虚妄，即见实相无相？曰：阿罗汉也见诸法虚妄，却不见实相。证得诸法虚妄的人多了，却没几个见实相的。知道诸法虚妄又有何用？知与证还差十万八千里。</p><p>问：我见万法如影幻，即能见投影仪？曰：先见投影仪，还是先见影？颠倒着见，就不能见实相。问：先见影幻，同时即知是投影仪的作用。曰：如同见影即知月。</p><p>问：万法如泡沫，见泡沫即能见大海？曰：众生无始劫哪天不见泡沫，谁见了大海？问：众生心眼未开，不知探究，本末倒置，故只见影，不知影即是光的效果。当下承担，都是如来，全波即是水。曰：这样实在不容易，是道种智的境界，这之前的路还很长，但愿勇往直前！</p><p>问：我不在波浪之外见，就能见到水吧？曰：波浪是生灭 波浪是幻化，波浪是水生成的，波浪即水，谁还见着波浪？问：波浪外无法，众生只见波浪，不知是水。学佛人见波浪，也不知道是水，却另外去想象一个水。曰：生死一直都在水里却不知，只因太习惯，太密切。</p><p>问：庄子言：鱼相忘于水，人相忘于道。可是这样？曰：是则是，生死却不决。问：狂心不歇，若歇了即可？曰：回头自照，不见本头，如何歇狂？问：生生死死，我却没有来过；潮涨潮落，海水没有生灭。曰：全波即水，海水既不来去，也不起落。</p><p>问：生死是幻法，众生常在涅槃而不知？曰：然。问：我在涅槃中看自己生死，看众生生死变化。曰：在涅槃中应该都涅槃，涅槃中无人为何有见有生死？问：莫非都是幻见？曰：本无见，幻生幻见。</p><p>十、佛与众生见不同</p><p>诸佛还见妄法否？见是见，却不作妄法解，也不作妄法用。诸佛慈悲大人相，入泥入水为众生，心如莲花纯洁无妄。如来藏见妄相否？不见，如来藏不见组合相，不见和合相，不见一合相，不见变异相，只见原相种子相。如来佛祖在原相里，供养众生一切法，入泥入水，却不沾丝毫，不受熏染！</p><p>众生为何只见山河大地妄法？心盲眼瞎，无明遮障。为啥心盲眼瞎无明遮障？无始劫来即如此，没有为啥，无明无因。无始劫以来，瞎却几只眼？眼耳鼻舌身意末那，总共七只眼，全部都瞎。末那一瞎，六只眼都随着瞎，没有明眼。众生如何才能见真不入妄？发大菩提心，愿破一切无明，救度一切众生出无明，修行戒定慧和三十七道品，广行菩萨六度，诸恶莫作，众善奉行，观行无我，证悟自性。</p><p>十一、何为道悟道者谁？</p><p>很多人都把修定的境界当作开悟，还有的人认为开悟必须是把所有的识心都灭掉，连意根也灭掉不起作用，这样才是真正的开悟境界。我们想想这有什么过失？这样的开悟，是谁开悟？悟了什么？在这个境界里没有人，没有五阴七识，只剩下如来藏，显然是阿罗汉的涅槃境界，与开悟没有关系。况且一个凡夫不可能通过修定直接就能把意根灭掉，证得俱解脱大阿罗汉，马上就入到无余涅槃里，即使灭掉五识也是极其困难的，意识更难灭掉了，更何况要灭掉意根。</p><p>有人总是执著根尘脱落是开悟境界，可是根尘脱落时，没有根，也没有尘，根尘不到一起，那当然也就没有六识心了，如果这就是开悟，那么是谁开悟呢？把虚空粉碎，大地平沉的境界当作开悟，可是这时到底是悟个什么呢？这种境界与如来藏的关系是什么都不知道，那就没法证明是开悟境界了。大家错解误会佛法，究其原因，根本问题还是虚妄法和真实法没有分清楚，没有搞明白，福德智慧还不足，还有烦恼业障严重的遮止，障碍福德和智慧的增长，所以真妄法还不能真正的领会贯通。</p><p>真心和妄心各有其不同的体性，比如说，觉有真心的觉和妄心的觉；平等有真心的平等和妄心的平等；清净有真心的清净和妄心的清净；离相有真心的离相和妄心的离相；有为有真心的有为和妄心的有为；无为有真心的无为和妄心的无为，等等很多。总而言之，大家学法，都是很难分清真和妄，常常混淆不清，往往误会很多，这是因为菩萨六度条件还不具足，具足以后就有智慧分辨出真妄二者的体性，悟道就快了。</p><p>十二、淬啄同时</p><p>每个修行人还没有成道之时，都如一枚没有打破的鸡蛋。这枚鸡蛋想什么时候打破，如何打破，确实是一个大学问，有大文章。打破时辰选的不对，打破以后就是剐蛋坏蛋，甚至不能食用，更别说能孵化出一个小鸡雏了，完全指望外力来打破鸡蛋，往往打破的都是剐蛋，什么用也没有了。</p><p>所以修行主要还是靠自己，外力给点温度就行了，内里自己变化自己，自己改变自己。不想做剐蛋废材的，就不要太指望他人的提携。有的人没学多长时间，鸡蛋还是很生硬的时候，就要求师父赶快引导自己开悟。这样悟能悟出什么？悟什么都没用，废材一个。生鸡蛋刚捂热乎一点，就着急破壳，最多炒菜吃了，不成气候。</p><p>蛋壳里的生命渐趋成熟的时候，有种种的特征，到最后鸡雏肯定会自己啄蛋壳，实在啄不开的时候，在鸡嘴即将破碎撕裂之处，外力加持一下轻松打破，生命才能成功的诞生了，这样的鸡雏强壮有力，生命力顽强。小鸡雏的诞生，极大部分是自己努力的结果，一小部分在于外部温度环境，母鸡的呵护。</p><p>修行也是如此，极大部分都靠自己精进努力，少部分在于师父的教导和帮助。过去祖师们接引弟子，都是啐琢同时，时辰掌握的好。为什么？因为祖师是真祖师真禅师，真有道，不仅有道力，还有道眼，明察秋毫，会观机逗教。那时候的学人是幸运的，非常幸运。如果学人三十七道品没有修好，六度还不具足，禅师绝不下手接引，弟子的法身慧命最最要紧，都不逞能，责任心非常强。如果有人胡乱接引，有凑数之嫌，自己就应该知道，那人没有道，躲开最安全。护好鸡蛋，不要轻易去打破，不管谁要主动打破，一律拒绝。</p><p>十三、疫情禅机</p><p>现在疫情当前，小区门口保安们所问的都是直击灵魂深处的生死大问题：1，你是谁？2，你从哪里来？3，你要到哪里去？然后给你额头来一枪。这一枪就是禅宗机锋，悟就当下悟，不悟就去参究以上三个问题。</p><p>每个人活了无量劫，自己是谁都不知道，从哪里来到哪里去也不知道，活得犹如行尸走肉一般，与动物们并没有什么大的区别，都是活着而已。是不是该清醒清醒了？在生死大事面前，保安们代替了禅宗祖师，那一枪犹如祖师们的棒喝，那三个问题就是禅宗话头，犹如大脑撬棍，谁头脑灵光，大脑就先开窍。</p><p>十四、好雨滴滴不落别处</p><p>窗外大雨瓢泼，这雨是心内雨还是心外雨？雨滴落在了哪里？大雨滴滴敲打你的心灵，是敲打在如来藏上了，还是敲打在哪个心灵上了？能不能把心灵之窗给敲打坏了？</p><p>这雨能依人的意志为转移吗？若说能，为什么那么多人受水灾？若说不能，为什么有人滴雨不沾身，且能呼风唤雨，止息阴雨为风和日丽？谁能见雨相即离雨相，不着雨相？谁能见雨相即心相，念念不住相？既然雨在心内，你心里为什么要下那么大的雨？若去外边淋一场瓢泼大雨，对自己有影响吗？</p><p>虽然七识了别的是虚假的幻影，可是这个幻影也显得太真实了，色声香味触全部是立体的，活灵活现，怎么能不让人觉得真实呢？但要解脱身心，该怎么办？</p><p>十五、教外别传的正法眼藏涅槃妙心</p><p>世尊在灵山会上，手拿天人奉献的一枝花面对大众弟子微微笑，一众人天懵懂，只有大迦叶以笑回应世尊，世尊以肉眼天眼慧眼法眼佛眼见大迦叶顿悟禅宗之心，遂说：我有正法眼藏涅槃妙心，实相无相，付与摩诃迦叶。这就印证了大迦叶的顿悟，于是大迦叶成为了娑婆世界第一代禅宗祖师。</p><p>涅槃妙心，是指每个众生自己的真心自性，常在涅槃，微妙现法，是最真实的法相，可是这个法相却没有任何世间相，无色声香味触法相，众生的七识由于无明遮障就不识这个涅槃妙心。在这个公案中，不但世尊的涅槃妙心时时彰显，大迦叶的涅槃妙心也时时彰显，乃至于无数人天大众的涅槃妙心也时时彰显。怎奈众生就是不识啊！心被无明障住了，灵性智慧开启不出来，慧眼不现前，奈何？</p><p>只有那大迦叶不愧为佛陀的第一大弟子，懂佛的心意，见佛陀手拿花朵示众之时，慧眼觑破佛陀的妙精明心，于是微笑起来，自己的妙精明心也被佛陀看透，师徒之间就有了心的交流，心心相印，不用文字语言。禅宗妙法就在众目澄澄之下传授完毕，后边还有一段文字补充，就是世尊说的那段：我有涅槃妙心，实相无相，传予摩诃迦叶……。</p><p>禅宗之法为什么可以教外别传呢？因为传的妙心妙法可以意会，不拘于语言文字如果只能局限于文字语言，那就不妙了，妙心妙就妙在能在一切法中行，不挑剔任何法，妙心妙法非关语言文字，什么法上都行，处处都是祂。何处不是祂？清净的污秽的有声的无声的，有文字的无文字的，活灵活现在一切法上。</p><p>世尊四十九年用语言文字讲出了三藏十二部经典，处处都彰显涅槃妙心，这是教门理门。但还是有点绕，这回世尊给大众示现个最直接的，最干脆的，最爽快的，直指人心的，一句话都不用说，就那么摇曳一枝花于大众面前。哎！大众干着急呀！心想这是干什么？世尊葫芦里有什么药？想不明白。大迦叶不用想，一下子就顿悟了，这是意根顿悟。意识是渐悟，因为意识得想啊！凡是用想的，都不真，祖师看见一棒子都得打死，情思意解汉，有什么出息？</p><p>教外别传的法，就是痛快，就是麻溜，不容你想，等你想的时候，大雁早已经飞走了，黄瓜菜早都凉了。谁在这时候还敢搔首弄姿、抓耳挠腮的，直接一棒子，这是什么所在容你左思思右思思，思前想后的？不是道器，打死不冤枉。</p><p>正法眼藏是什么意思？只有这只眼最正，其余眼都不正，生生灭灭的，无明烦恼的，自身不能独立的，非要有所倚靠的，肯定不正。藏，是含藏的意思，涅槃妙心含藏一切法的种子，能生成一切法，万法蕴含在其中。这就非常妙了，无中生有，幻化世间，让大众得以依靠，进而执取万法。</p><p>十六、临济禅宗四料简</p><p>临济禅师的四料简是：夺人不夺境、夺境不夺人、人境俱夺、人境俱不夺。夺，指剥夺、剥离、遣除、消除、消灭；人，指主观的我，为能攀缘的识；境，指所攀缘的尘境。这三个字的意思涵盖了在参禅过程中所要做的功夫，降伏根尘境界，剥离和消除能和所，逐渐断除身心五阴我见。有我见就是遮障，就是障碍，慧眼不开，只见人境，不见真心。</p><p>凡夫众生虽然都有我见，但在修学的过程中，我见的侧重点不同，有些人偏重于主观的能，执著于识，有些人则偏重于客观的所，执著于境，有些人则二者俱执。由于有我见我执，心不空，参禅无果，这时候就需要具眼的禅师接机示教，当面逼空，夺去学人所执的能所，去除眼障，使其法眼净，这是前三料简。</p><p>得了法眼净的禅者，人境俱空，落到了空处，为了向上一路悟实相，禅师再接机示教，让学人从空处转身，在人和境上悟那个有，这样柳暗花明又一村，境界转折了，大事就得到初步的解决。但在月明帘下转身难，从空到有很不易，这是小乘到大乘的跨度，需发大菩提心，广行菩萨道。第四料简完成大乘见道，开启了向上之路。所以不断我见，不能开悟。</p><p>十七、凝守真心，妄念不生，我所心灭，涅槃法显。</p><p>评议：如果是在修道过程中，证得了真心，最初为了静心，可以凝守真心，以真心为归。随着修道功深，就会知道守着真心，也是虚妄法，也是多余，有守的心行就是妄心的心行，就是生了妄念。为什么要守真心？还是因为把真心当作我和我所有的，所以才去守，那么我所的心就没有灭，心还不够空。这时候心是比从前清净了，好像真心一样，没有其他念头了，这是禅定境界，也可以说类似真心没有念头的境界，说是涅槃的真心显现出来了，也说得通，但比较勉强。因为涅槃的真心不管什么时候都是显现着的，证悟真心的人都知道。</p><p>如果说凝然守心是可以的，这个守心就是指不让妄心虚妄造作，更不要造作贪嗔痴业，回归清净，或者是回归真心自性。守真心这个说法有待商榷，因为真心不用守，证悟的人守真心多此一举，还增加烦恼执著，不能过牢关，没证悟的人想守却找不到祂，如何能守？但是一个守字，就表明了有念头有主观，不管守真心还是守妄心，只要守，就是妄念。这时候只是意识妄念不生，意根绝对有念，没有念时，心空了，什么也不守，也守不了，也没有守的心行了。有念有心时，涅槃的真心和妄心都存在，哪个是显现出来的涅槃心？既然有个守的心行，心行就不灭，所守护的就是我所，不管守护什么，都是守护我所，我所心根本没有灭。</p><p>禅宗与唯识的境界无法比，在修禅宗阶段，心还不够空，即使过了禅宗第三关，心也没有修到唯识阶段的人心空。只要一个心行不空，禅宗第三关就过不去，也到不了第三关。心空才能证得有余涅槃，有能力过禅宗第三关生死牢关。守个真心，就被真心系缚住了，还有生死业，不能涅槃。守就是生死业，守就多事，心不寂静。四禅叫作舍念清净，舍念才是清净，舍念就没有守，心空无守无住。有守也不会入无想定，更不会入灭尽定。为什么不能入灭尽定？因为意根还有受和想，守就是想。无想定中也没有意识的守，意识不能起用。守类似于制心一处的修定，制，就是放置，就是对治，就有动作，有运行。</p><p>我们现在谈的是最终的修行结果，不是谈修行过程，修行过程应该怎样做就要怎样做，可以采取各种方法措施，都是用功所需要的，也是不可避免的，但到最后结果的时候，一定是心行寂灭的。比如说守戒到了不用守的程度，才是于戒自在，而不逾戒，变成了全然的意根的习惯习气，心行天然就如此，不用思考和督导、规范，自自然然的心行就符合戒律。</p><p>十八、用什么方法才能真正证到第八识法</p><p>维摩诘经说：法不可见闻觉知，若行见闻觉知，是则见闻觉知，非求法也。这句话是什么意思？原文的意思是第八识这个法不是可以用见闻觉知就能见到知道的，如果你用见闻觉知去了知祂，那么这样的话就只能是你的见闻觉知作用，是见不到第八识的，用见闻觉知去知第八识不是寻求第八识的方法，这不是证道的方法。</p><p>原文中的法是指众生的本体本源第八识，这个法与其他的法都有本质的区别，这个法决定着一切法，无始劫来众生都迷失了，所以不断的追逐妄法和枝叶，不知有本源。知有本源之后，才懂得去寻找本源，回到本源那里，返璞归真。如何才能追溯到本源呢？不会寻找的人就会用见闻觉知的功能作用去寻找，绝大多数人都是这样，最后结果可能连第八识的影子都见不到，即使见到了影子，也没有用，还是回不到本源那里。</p><p>什么是见闻觉知？见闻觉知是六识的功能作用，眼见、耳闻、鼻嗅、舌尝、身触、意知，这是六识对六尘境界的了别方式，用对六尘了别方式来寻找和了别第八识是不对路的，因为第八识与六尘有着非常明显而巨大的差异，见第八识不应该与见六尘的见相同，所以维摩诘经中说若行见闻觉知，是则见闻觉知，非求法。这句话好好品味一下，特别重要。方法手段用错了，就不能达到目的，实现目标。</p><p>经文里的意思明显是说：见第八识不是六识的见闻觉知功能作用。那是什么作用？是谁见第八识？这里明显的把意识的功能作用否定了，不是用意识那样的见。意识都有什么功能作用？推理、思惟、分析、想象、整理、归纳、总结、比较等等，那就是说用这些功能作用去见第八识，根本见不到第八识本体，如果真以为见到了，那见到的只能是假货。如果有人是用意识心寻觅到了第八识，而认为自己明心了、开悟了、证道了，那都是极大的误会，维摩大士不许。如果是大士所不许的，自己非要坚持不可，那么后果自负，只要能负得起就行。</p><p>所以说，归根结底，还是祖师们的证悟方法正真不虚，既不自欺也不去欺人，最起码不辱佛教，良心过得去。还是那句话，意根主人不证悟，意识作为一个附属工具的作为能有何用？主人没有开尊口，所说一切都不算数。所以想要证得任何一个法，包括世俗法，都必须主人意根亲自去证，亲眼所见，才名为亲证，才有功能受用，才能转变一切虚妄法，才能彻底究竟，才是真实不虚。</p><p>十九、如何证得真正的闻性</p><p>从十八界当中一门深入的修行，是观十八界中的一界，从这一界中悟入法界实相，证得三昧，从而开启大智慧。譬如从耳根门起修，就要在闻性上观行，反观耳根闻性的生灭起处，从而找到不生灭的真正的闻性。这时就不要落入音声里，去思惟音声里的内容，落入虚妄法中，这样就找不到闻性的根本和实质了。</p><p>二十、灵感是如何出现的</p><p>研究发现，面对突发的生命威胁，恐惧的感觉瞬间控制大脑，于是许多哺乳动物（包括人类）会定在原地不动——这就是定格。定格时，体内能量集中，开始全面接收在场的一切信息（瞳孔放大、眼睛睁大等等）。因此，在事后描述时，当事人会对恐惧感袭来这一瞬间的记忆异常清晰且富有细节。而紧随这一瞬间之后的记忆可能会模糊不清，甚至完全不记得。那么就有如下的问题：（一）身体的这些现象是谁掌控的？（二）定格与定住、禅定是否相同？（三）为什么定格时发生的事情记忆非常清晰？而过后就记忆模糊记不清了？</p><p>答：（一）意根随着如来藏能随时了别到色身遇到的所有情况，随时能对色身加以调控，意根心一动，就会在大脑中枢神经系统向全身神经系统发送信号，浑身随之就会出现神经反应，意根的思想情绪就表现出来了。</p><p>（二）定格时就是短暂瞬间的禅定，注意力高度集中，也叫作定住。身体不动，意识思想不动，而意根却能非常专注的思量，寻找对策，寻找机会以脱离危险，往往能急中生智。这正是定的特征和结果，定能生慧，定中意根非常灵敏思路敏捷，往往能转危为安。</p><p>（三）定格时意根能高度集中注意力，心念不分散，六识不乱动，不影响意根的思量，这时候对尘境观察更细微，观察力更好，因此记忆力更好更牢固，所以定格时的场景记忆深刻。而过了定格阶段禅定消失，心就散乱了，所以记忆力就差，过后的情况就记不清楚。</p><p>过去禅师们悟道，也有不少在自己疑情正浓时，遇到一个突发事件应激出现灵感，从而悟道。学人在参禅中疑情很浓时，如果师父突然大喝一声或者其它方法，都有可能触发灵感，从而开悟。过去在禅堂里打坐的间隙，行者们下坐绕禅堂走或者小跑，师父突然喊停，突然停下来时也有可能开悟。淬不及防时容易有灵感出现，这样的开悟是真实用功的结果，都是意根直接悟，直接体验，叫作亲证，不止是意识悟。这时候不容你思考，要悟就悟，不要思考动念头，不要琢磨，直接就悟，就是意根悟。</p><p>二十一、六根圆通</p><p>晨起静坐，鼓声风声念诵声鸟鸣声，声声入耳，心绝尘寰，无有涟漪。</p><p>心声又起，世界家国有情弘法度众，事事浮现，心离诸相，微波不兴。</p><p>世间人事，蛙鸣蝉噪，蚁斗蜂争，博人一笑尔，除死无大事。死生事也不大，沤生沤灭，全部空幻尔。</p><p>出世间事，众苦解脱，弘法利生，认真不得尔，都是梦中事。名闻利养，毁誉称讥，誓愿任责，不过空相尔。</p><p>一切音声如空谷跫音，皆不取，一切色相如海市蜃楼，皆不着；一切事理如龟毛兔角，皆不执；世人威逼利诱，皆为陷阱，世事繁华乱舞，皆为芒刺；言笑语默举手投足，诸有造作，皆为苦业。六根对境，声色犬马，若执一毫，砒霜入口。</p><p>眼色见三者空，耳声闻三者空，鼻香嗅三者空，舌味尝三者空，身触觉三者空，意法思三者空，能空空，所空空，心中空也空，空空也空，直至无纤毫可立，无微尘可得，不立也不立，不得也不得，不立不破，不得不失，方是到家的消息。家无四壁无寸草，也无卓锥之地，毕竟无毫尘，无毫尘也无，无也无。到此者，何止耳根圆通，眼根圆通，鼻根圆通，舌根圆通，身根圆通，意根也圆通，六根都圆通。通个什么？参！</p><p>二十二、事修和理修的关系</p><p>一切法分为事和理两部分，事就是相，理就是如来藏理体。在谈论事的时候，就要从相上来破除相的真实有性，这时候就不能从理如来藏的角度来说了。那会让有些人认为相就是真实的，就会生起执著，从而心有束缚，不能解脱。</p><p>小乘法都是从相上来破有，大乘法是从理和事两方面来修行，从理上来破相，认理就好办，但是也不废相，不会执理而废事，要求理事圆融在一起，不可偏向任何一方，否则佛法就不成就。</p><p>修到究竟理事圆融的程度，那就是佛，理事圆融还不究竟的那是地上菩萨和等妙二觉。明心以后的菩萨也许能圆融一点点，如果观察力不具备，那就一点也不能圆融。</p><p>如果没有证果也没有明心的人，告诉他五阴十八界法，世间一切法都是不生不灭的，他就会认为五阴十八界是真实的，执著这些法就没有错，没有什么不好，因此就不会想办法去灭除自己的贪爱和执著，这样的话，众生的生死问题就不能解决了。一切法皆真如，这是地上菩萨以及佛的现量观行结果，凡夫只能一步一步从基础五阴十八界的生灭相上来修行，不能直接就把五阴十八界当作不生不灭的真如来对待，没有人能现量观察到这个理。</p><p>四禅八定是事修，是修相，相必定有生灭，没有不生灭的相，除了第八识的空相，空相无相，所以不生灭。四禅八定里的六识从相上看就是生灭变异的，第七识从相上看也是生灭变异的。谈论生灭变异的法，修相的时候，就要有生灭变异的相。如果这时候要说七个识和四禅八定，都是不生灭的，那就显得不伦不类了。既然都不生不灭固定不变了，那我们就没有什么好修行的了，已经完美了。</p><p>二十三、什么是佛</p><p>郁郁黄花无非般若，青青翠竹皆是法身。每天放眼望见郁郁黄花时，般若妙理就现于心中，看见青青翠竹时，法身跃然而现。全部是般若妙用，法身周遍。众生须臾未离法身，刹那尽显般若。惟无明遮蔽心眼，不见般若，不知法身。离法身，无业障身，离般若，不见黄花翠竹。</p><p>学人问云门禅师：什么是佛？云门直指：干屎撅。</p><p>离音声听，离文字看。干——屎——撅，法身混迹滚滚来。法身非干屎撅，干屎撅非般若，干屎撅非干屎撅。圣王混迹凡尘中，需拨乌云见慧日，若见干屎，不见法身，若着干屎，不懂般若。</p></div>"
},{
    "title": "第八章 杂谈",
    "author": "生如法师",
    "date": "2021年12月03日",
    "html": "<div class=\"B1_text\"><p>第八章  杂谈</p><p> 一、识心现行的越少禅定越深</p><p>问：在打坐中发现，缘独影境比缘五尘境时的定要深些，是什么原因呢？         </p><p>答：缘五尘境时，六识都活跃，眼识要看，耳识要听，鼻识要嗅，舌识要尝，身识要触，意识要知，这么忙乱，当然不容易得定了，即使有定也是浅定。而把五识降伏住以后，只剩下独头意识的知觉，能更集中的了别和知，当然就容易入定了，一旦入定，定就有可能比较深。当把独头意识也降伏住的时候，只剩下第七识的了知，禅定更深。参与了别的识心越少，定越深，了别的境界越少，定越深。所以最深的灭尽定里没有六识的了别，只有意根单独比较轻微的了别，而且意根的心所法又减少了两个，心就更定了。</p><p>当定力很浅的时候，就不要观行，一观就散乱，观不起来时就一心修定，暂时不要观。当定力深一些的时候再观，效果就比较好。修行方法要灵活掌握运用，具体情况具体对待，不可一概而论。</p><p>二、禅定功夫越好闭眼所见色越明亮</p><p>观呼吸时心沉静下来之后，睁着眼睛感觉眼前一抹黑，这是有初步禅定的好现象，由原来心攀缘六尘境，到心向内转不见尘境，这时候又被色阴区宇所蒙蔽，眼前就是黑的。如果再继续深入禅定，即使闭眼也会感觉眼前是明亮的，但离突破色阴区宇还有很远的距离。</p><p>三、意识与禅定的关系</p><p>思量和参究，都是在深定中进行的，在深定中意识用的非常少，了别轻微，这时候如果用意识来不断的思惟推理，就会从深定中出来，定就浅了或者消失了，结果就会导致无法实证。总之意识用的越多越无法得定，无法有深一些的禅定。只有意识少用，心神才不散，这也是降伏了意根不再处处攀缘的结果。如果意根没有得到降伏，到处攀缘，意识必定也随之处处攀缘，意识就散乱，完全靠意识的肤浅思惟，真正的智慧就开发不出来了。</p><p>四、初入定时要避免突然受惊吓</p><p>问：我在打坐或者走路思维佛法的时候，忽然听到外边一个大声音或者什么动静打扰，为什么会感觉非常难受，心慌心跳加速，有时候会起一身鸡皮疙瘩，好像特别害怕的感觉？</p><p>答：入定时如果心非常静，非常专注，心不外缘，那么突然出现比较大的声音，心理没有准备，就会受到惊吓。所以打坐时就要选择无人打扰之处和时间，免得受到惊吓，惊吓容易出问题。这是直接惊吓到了意根，意根控制色身，所以色身就会出现异常反应，如果尘境过于异常，就容易被惊吓出毛病，导致精神也紊乱。如果惊吓到意识就没什么事，因为意识不能控制色身，只惊吓到意识，说明定浅，或者没有定。</p><p>五、为什么说睡眠是一种盖障</p><p>识心如灯，心性如光，心体起用，灯光现前，照见诸法。睡眠时五识灭去，无有灯光，五尘六尘之法不得显现。睡眠过后，五识现前，意识现前，光明出现，灯光照见六尘，此则是醒。所以说睡眠为黑暗，遮盖自心光明，降伏睡眠，修除盖障，禅定现前。</p><p>六、专注容易受熏染的原理 </p><p>当你盯着一个人看的时候，注意力越集中，越容易受到感染和熏染，越容易受影响。这有什么原理？因为专注的盯着对方的时候，所有注意力都集中在对方身上，定力增强，对方的一举一动都能入心，心容易融入对方的心境之中，与对方的言行举止和面目表情合拍，心就被熏染了。对方如果要点头，你也会不知不觉跟着点头，对方摇头，你也会不知不觉的摇头，甚至会替对方答话，替对方做马上要做的事情，想对方之所想，急对方之所急，会被对方的思绪带着跑。</p><p>慈悲心就是站在对方立场考虑问题，把自己融入对方心境中，心与对方合在一起。如果不盯着对方，心就散乱，对方的心行就不太了解，就不能与对方融合，对方的言谈举止对自己就没有影响力。</p><p>七、气脉没有打通也能得定</p><p>气脉只要没有大的障碍，都可以得定，不一定是身体状态好才能得定，但气脉能决定禅定的深浅。禅定是综合因素形成的，不是单方面原因。</p><p>八、禅定属于哪种道</p><p>道分为世间道和出世间道，世间道也叫作外道，是外于佛法的道，只有四禅八定，没有解脱的智慧，不证解脱果；出世间道分为佛道、菩萨道、缘觉道和声闻道。佛道和菩萨道是四禅八定与大乘般若、唯识智慧相结合的解脱道，缘觉道是四禅八定与十二因缘智慧相结合的解脱道，声闻道是四禅八定与四圣谛智慧相结合的解脱道，四种道都有相应的解脱果。如果出世间道只有四禅八定，但还没有解脱智慧，不能解脱，也总比外道不修佛法强很多。有四禅八定就有五种神通，生死相对没有禅定的人自在，暂时在一定范围内由自己主宰，超越范围就主宰不了，长期来说生死还是不自在的，不出六道轮回。</p><p>在唐朝时候，云门宗的云门禅师的师父叫睦洲，睦洲和尚是有神通的。皇帝曾经请睦洲去作国师，睦洲和尚却不愿意在皇帝身边受约束，坚持自己独自住山弘法。他属下的弟子有很多，但他就是不设置首座，因为身边的弟子他都不满意，他只相中了云门，而云门这时候不但还没有出家，甚至还没有出生。所以尽管睦州和尚度化众生十多年，住山将近二十年，仍然不设首座，首座位置一直给云门留着。有一天他对大众弟子说：我的弟子云门刚出生了。他神通挺大的，云门刚出生他就知道了，当云门长到十多岁开始放牛时，他对大众说我弟子云门正在放牛。</p><p>云门长到成年以后，开始游山到各个寺院去参访。有一天睦州和尚就告诉所有的弟子说：我的首座来了。这时候还是在家人的云门背着包裹从远处走来，那时候他还没有神通，也没有禅定，睦洲就出来迎接他当首座。云门进寺院就剃度，并且直接当了首座。睦洲的个性是宁缺毋滥，他只认定一个弟子，别人都看不上，所以他不设首座。首座是什么呢？首座是当堂和尚的第一大弟子，寺院里一切的大小事的主管，包括学法与禅定，以及寺院所有大小事务都由首座管理，除了师父，他就是第一。</p><p>在唐宋朝的时候像睦州这样有神通的禅师很多，虽然有一些人悟道了，但他们的道行主要表现在有四禅定，有四禅定在一定范围内就能生死自在，可以随时随地的往生，一般都投生到人间，想投生到谁家就投生到谁家，只要跟那家主人打一声招呼就可以了。也有在投生的第二天或第几天，马上就可以出生的，福德大的人可以抢胎出生，不用住胎十个月。有个禅师想证明自己得道了，就示现生死自在，点一炷香，在香还没有燃完的时候，他就投生去了。虽然如此，但是真正得道的禅师会说：你虽然有说走就走的本事，也不表示你生死自在，因为你没有悟道，脱离不了六道轮回，这一世你可以脱离恶处，但下世你就免不了了。</p><p>还有一个禅师修出神通以后，知道南方有一个女子已经怀孕三年了还没有生孩子，是在等着他入胎出生，他的同禅道友多次邀请他到南方去游玩，最后他实在没有办法就一起去了，走到半路，在一个河边看见了那个怀孕女子在河边洗衣服。他知道自己再也躲不了了，就跟道友说：我没办法陪你往前行了，因为我必须要投胎去了，我投胎以后，第九年的时候，你到南方会看见一个九岁的男孩子骑在牛背上吹笛子，那个孩子就是我。结果他的道友九年以后到那个地方，果然看见一个童子骑在牛背上吹笛子。禅师虽然有这些神通，并不代表他得道了。</p><p>唐宋朝时期所记录下来的有关禅师们的各种公案就知道，那个时候的修行人尤其是出家人普遍都有四禅定，在家人也有禅定，他们出家后主要功课就修定，然后再参禅，好多人参禅没有参通，但是禅定都修出来了。他们为什么修定都有四禅定而我们现在不行？因为那时候的人心都比较清静，善根福德都比较深厚，没有那么多的繁杂的人事关系与社会信息，人的心地单纯，所以容易修出禅定。每个寺院里都有禅堂，出家人每天都在固定时间里到禅堂打坐修定参禅，下地出坡干活时心里也都在定中参禅，时时刻刻都在用功办道。没有像我们现在这样，成天忙碌无法修定，学点法就情思意解，甚至都会背了离道却还那么远，修不出禅定，只能意解。</p><p>有四禅定的人想什么时候投生就什么时候投生，想投生到谁家就可以投生到谁家。可以提前跟投生的人家主人打招呼，而且投生方式也可以很特殊，福德大且无欲的人，投生可以不经过男女合和，直接投到肚子里，还可能抢胎提前出生，就像五祖投生的过程一样。五祖前世遇到四祖的时候，是个修道的道人，不是佛家的，年龄也非常大了，四祖就看好他的根器，对他说：你这个色身已经不行了，换一个色身来。五祖马上明白了，就去找投生的机会，走到一条河边看见一个小女孩在洗衣服，他就跟小女孩打招呼说：我没地方住了，我到你家里住行不行？那个小女孩以为他是想到他的父母家去住，不知道他是想投胎，于是就答应了。</p><p>这小女孩回家不久就感觉自己像怀孕了似的，怀孕迹象明显时被父母发现了，小女孩说不清楚是怎么回事，父母就把她撵出了家门。小女孩从此四处辛苦的流浪，最后把五祖生下来了。五祖出生到了几岁的时候就遇到了四祖，并且跟四祖出家剃度，年纪很轻时就悟道了。五祖做外道的时候就有禅定的功夫，而只有禅定的道不是解脱的正道，而开悟证的那个道才是真正的道。</p><p>外道修禅定修得最高的是释迦牟尼佛的外道老师郁兰陀仙人，释迦佛刚出家的时候拜郁兰陀为老师学四禅八定，佛把四禅八定修出来以后，认为这个还不是道，就把四禅八定和苦行舍了，自己要重新修道。于是到河边沐浴，又喝了牧羊女供养的羊奶，之后到菩提树下打坐，半夜睹明星就大悟成道了。悟道以后想度化他的老师，因为佛知道郁兰陀学外道法，不可能得道，却找不到祂的老师，佛用天眼一看，郁兰陀已经不在人间，已经投生到非想非非想天了，在那个天界当中入定八万大劫享受定福。</p><p>八万大劫对于我们来说，时间简直是太长了，但是对于入定的人来说，时间却非常短，转瞬即逝。因为定中的人只有微弱的意识，有意根有第八识这三个识，没有色身，处于无心状态，禅定里又非常的愉悦，所以时间的流逝就显得非常快。八万大劫出定以后，如来藏里不管什么业种成熟，众生都会随着业种出生在六道里。释迦佛用天眼看到祂的老师，在修道当中曾经发过恶誓，他打坐修定时，因为周围的小鸟叽叽喳喳的叫不停，妨碍他修禅定，他就发了毒誓说：等我来世变成大鸟，把你们都杀死。</p><p>他发了这个毒誓以后又接着修道，最后修成了三界中的最高禅定，就往生非想非非想天了。因为这个毒誓，他将来从天上下坠以后，会实现他的毒誓，就是满愿，投生为一个大鸟，然后把那些小鸟们都杀死，这样他就造了大恶业，命终因这个罪业直接下到地狱里受罪报。佛不希望郁兰陀弗将来去造这种恶业，但是没有办法了，佛已经找不到他了，他直至如今还在天上入定。</p><p>所以我们看修道的道，不止有佛道，还有种种外于佛道的外道，佛道是出离生死苦报的道，外道虽然有甚深的禅定，但没有解脱的智慧，不属于大小乘解脱的道。佛道不仅要有四禅八定，还要有大小乘无我的智慧，是定慧双具的道。虽然学佛修道了，如果只有禅定而没有断我见和明心见性，那就还没有得道，不能脱离生死苦。只有定慧双具的道才能免除三恶道业，免除生死苦报，才能了生脱死得解脱，其他的道都不是真正的道。</p><p> 九、辟谷养生的方法</p><p>（一）辟谷的益处</p><p>辟谷的益处多多：能去除身体里的各种疾病包括癌症，排毒排废物，清除血管里堵塞的垃圾和毒素，改善血液循环，更换新鲜血液，细胞组织里分解出来身体所需的营养精华，皮肤白里透红发光发亮，养颜驻颜，皮肤美容，健康长寿，逆生长，让生命更有活力。气脉通畅，身体柔软，双盘轻松，打坐效果好，禅定增加快，身心愉悦，减轻意根对饮食的贪欲和依赖，减少烦恼，头脑灵敏，思惟活跃，开发智慧，定慧增长。</p><p>饮食是粗重的四大，含有赃物和毒素，能增加内脏负担和工作量，内脏磨损，减少寿命。辟谷期间以气为主，气是微细四大，以风大为主，促使身体上升轻灵。神仙和天人都是食气服气，身体轻灵以至于有神足通，能飞行。辟谷期间打坐效果相当好，静坐会不想下座，利用好这个时间修定，身体柔软，腿容易盘得住，心也容易静下来，妄念少，头脑清明。气脉运行的好，气通八达，身体微循环和代谢都好。</p><p>（二）辟谷的准备期</p><p>半辟谷三天大约时间，可多可少，主要是让身体和意根习惯于少食和无食，在正式辟谷的时候，胃里没有饮食了，细胞组织才会快速分解和代谢，排出毒素和垃圾，提供高营养物质。半辟谷第一天只喝一碗小米粥，七分饱，或者半饱；半辟谷第二天也是一碗小米粥，量稍微少一点，六分饱就行；第三天半碗小米粥，四五分饱。正式辟谷就开始只喝水，多喝水，促进细胞分解新陈代谢，促进排毒排废物。</p><p>（三）正式辟谷</p><p>如果是上班，半辟谷选择在星期二、星期三和星期四，星期五正式辟谷。星期六是辟谷的第二天，胃还不太习惯不吃东西，会感觉比较饿，这时候在家里不接触人，就不消耗过多能量，第三天也会有点饿，比第二天能好一些，也是在家里休息，不接触人和事。第四天就差不多适应和正常了，细胞组织里分解的能量也多一些了，人就会感觉精力旺盛，头脑灵活。这是说没有特殊疾病的人，病也不太严重的人，如果血糖太高和太低的最好不要辟谷，出问题没人能负责，旁边有大夫和中医师照顾才可以辟谷，心脏病胃病严重的也不要辟谷。一般禅定共修也不允许病情严重的人参加，万一出事担不起责任。</p><p>辟谷三四天才能初步调理胃部疾病，辟谷时间越长，调理的疾病越多越到位，内脏新陈代谢的越好，血液更换的越多，身体越健康，人越年轻，皮肤越细腻光滑，比美容效果好，没有任何副作用。</p><p>正式辟谷不吃任何东西，胃里没有饮食的时侯，细胞组织才会分解，排毒排垃圾，分解高营养物质供身体吸收，这比饮食还好很多倍。第一次辟谷辟三天到七天就行，超过三天最好，才有一些效果，时间短用处不大。第四天到第七天胃里就习惯没有饮食了，不太感觉饿，除了馋，如果能忍住馋，不接触饮食，一般就能辟谷成功。</p><p>我们辟谷主要是学会观想，能观想阳光照耀自己，进入身体里胃里，就不会觉得饿。再观想佛光照耀自己身上和有病部位，身体饥饿就会得到缓解，胃里很舒服，身体很轻松、轻灵、自在，再呼吸一些新鲜空气，空气里也有四大营养物质，以氧气为主，晚上还可以观想月光，吸收月亮的能量。光能和气能都比食物对身体有益处，都是微细物质四大，食物是粗重物质四大。天人食微细物质四大，所以身体轻能飞，人类食粗重四大，所以身体沉重不能飞。二禅天人下到人间食了地肥，就飞不动，回不去天上了。我们学佛修行人要尽量以气为食，气满不思食，身体就健康有活力了。山中的仙人都食气和其它微细四大物质，所以他们健康长寿，有千万年的寿命。打坐修定的人，禅定修好了，也会健康长寿，有四禅定也可以活千万年或者一劫时间。</p><p>正式辟谷三天到七天，七天还是容易坚持下来的。一年辟谷两三次，身体就会得到有效的调理了。第二次辟谷会比第一次容易，第一次馋病大于饿病，意根贪饮食的习惯不太容易克服。如果口腔里能多产生津液，吞津液也能当作饮食，比饮食更有营养。口里含一些果核之类的，引津液产生出来，然后吞下去，营养能量就够了。津液比燕窝有营养。</p><p>（四）恢复饮食</p><p>辟谷七天以后，就可以恢复饮食了，这是个关键，饮食恢复得好，身体就万象更新，获得了新生。</p><p>恢复饮食依靠小米粥，容易吸收消化，调理脾胃。辟谷之后，胃相当于婴儿胃一样，必须吃易吸收消化的流食，不能吃凉的硬的干的，不能喝牛奶，不能吃饱和过食，这是养胃的最佳时期。恢复饮食头三天，只喝小米粥，少量多餐，免得撑着胃。第四天以后小米粥，加煮烂的叶子菜，或者是山药、胡萝卜、土豆蒸得很烂熟，沾蜂蜜吃。</p><p>恢复饮食七天以后，再增加其它容易消化的饮食，十天以后，就要补气，用红参、桂圆、大枣、枸杞熬水喝。补一个星期以上，多则不限。避免酸辣咸的口味，不刺激胃肠。复食以后，胃会养成新的习惯，这时候要注意培养和形成饮食的新习惯，改正不良习惯，饭量和口味都可以自主改变。</p><p>（五）注意事项</p><p>有些集体辟谷的，期间还吃些水果，或者花好几千元买些酵素喝，结果都失败了。有些中医气功帮助辟谷，索要费用是两三万。我们辟谷一分钱不用花，什么也不用吃，也不用人照顾，如果吃一点东西，细胞就会少分解一点，毒素少排一些，营养少分解，不划算。</p><p>辟谷期间多打坐修心养心，少接触、不接触烂人烂事，容易惹自己动情绪的人，尽量回避。少说话，不说话，保持体力和能量。辟谷期间如果实在是饥饿难忍，可以少喝一点蜂蜜水，可以含一点冰糖，尽量不吃为好。第一次辟谷就是容易馋，饿还好说，容易忍过去，馋病难治。辟谷期间一定要多喝水，大量喝水，促进排毒、排废物和排病。</p><p>辟谷期间，体重每天会减轻1、2斤，平均1.5斤。饮食恢复得好，胃调理得好，体重会变得正常。恢复饮食第四天以后可以吃一点点盐，七天以后再吃是最好的。</p><p>十、催眠语句</p><p>为了安稳自己的身心，尽快成就道业，我们可以每天给自己催眠，编好催眠的句子，自己心念来鼓励自己，让自己心向往之。</p><p>（一）一切法虚妄；</p><p>（二）一切法幻化；</p><p>（三）我是在戏中，我在演戏；</p><p>（四）我这是虚妄想；</p><p>（五）这境界是我虚妄想出来的，不要当真；</p><p>（六）我和大家在共同演戏，共同游戏，我们其实都是戏子；</p><p>（七）我要回归真实，我要认清实相；</p><p>（八）我不想再演戏了，不想活在虚幻的境界中，不想再虚假的过活了。</p><p>（九）我不想再自欺欺人了，我要觉悟一切；</p><p>（十）我要成佛，我要回归真实。</p><p>这些催眠语句，在各种境界中，只适合使用一到二个，多了心容易乱，与法不相应。或者根据自己修行的进展和程度，一个时期只用一两个语句来暗示自己，这样自己慢慢就被催眠到相应的思想境界了。</p></div>"
}]