[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>内容简介</strong></p><p>末法时期众生福薄，处于信息和科技发达时代，竞争激烈，生活压力大，心思繁乱，心不清净，又不具足修定的环境条件；再加之众生喜欢博闻强识，喜欢口头禅，心思轻浮，因此很难修行禅定，定力普遍都很差。而禅定恰恰是佛法修证的关键因素，是佛所强调的重要的三无漏学之一，是获得解脱智慧的钥匙，无定就无慧，因此要想得解脱，修定是迫在眉睫的事情。</p><p>本书介绍了几种修定的具体方法，有念佛、调呼吸、静坐拜佛、背诵经咒、观想等等，都是切实可行的制心一处的修定方法，动静结合，非常实用，也很灵活。书里还讲到了禅定的重要性，以及影响禅定的攀缘心重这个因素，减少攀缘性，降伏性障烦恼是至关重要的。也讲到了如何从修定转入参禅的问题，如何保证真悟不错悟的问题；并且列举了一些实修观行体会，以供学人参考借鉴，不断提高自己的修证质量，保证实证佛法，获得真实的智慧。</p></div>"
},{
    "title": "前言",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>前   言</strong></p><p>如何修好禅定，这是摆在修行者面前最现实的问题，因为没有禅定，一切佛法的实际证得就无从谈起。戒、定、慧三学，在佛法修行过程中是同等重要的，缺一不可，定学处在第二位，说明定力对于修行是至关重要的，也是极为关键的，它是开启智慧宝藏的金钥匙。是通向涅槃彼岸的舟船。</p><p>现在大部分人修行的瓶颈都是在禅定上，禅定修不好，内心散乱不清净，烦恼不能降伏，观行思惟佛法时就显得力不从心，因此不能实证佛法。</p><p>一、世尊在《坐禅三昧法门经》中教导弟子们说过，内心散乱不能现起禅定的原因，是因为有贪嗔痴烦恼的遮障，内心里有很多人和事物的系念牵挂，心很难静止下来。佛教导我们，在修禅定之前要用智慧除去各种觉观，除去散乱思惟，用智慧去观照这些烦恼，然后生起禅定，继而降伏烦恼、断除烦恼。</p><p>二、现在学佛人普遍的现象是修定的条件和福德都不足，因此定力很难修出来。从表面上看，很多人的物质生活水平确实提高了，但是能用于出世间法佛法上的福德却很不足。禅定修不好，内心不空净的人，要经常检查和反观自己的内心，看看心里面是否装满了欲界中的财、色、名、食、睡，是否贪着于欲界的诸般法和人事物理，是否对这些欲界法有着很深的执著，这些贪着都是阻碍修定的病根，导致禅定很难修出来。找到了这个病根，就要想办法除去，不断的思惟分析观察这些法的虚幻性和不实性，以减轻执著性。</p><p>如果一个人喜欢美食，喜欢舒适，喜欢享受，喜欢赞美，对欲界人间法什么都贪着，都很在意，对人间的一切事情都惦念都注重，禅定是不可能修出来的。对人生追求得越多、对人生越有希望和兴趣，越不容易有禅定，因为有物堵心，心的负累就重，不能空静，不能得到轻安。如果我们对人世间的各种贪爱及憎嫉怨恨等等，能够降伏一些，禅定就能很快出现。</p><p>如果我们念念贪着于五阴世间，攀缘很重，不会有禅定的生起。生起厌离五阴世间之心，没有欲求，欲界定才能出现；厌离欲界天人五阴生活环境，色界定才能出现。如果我们对世间一切总有希求，心总是要趣境，就很难容纳更殊胜更胜妙的东西。</p><p>三、把心里的贪念和执念都降伏和减轻之后，再来修定就很容易了。定，一般可分为打坐的静中定和行走坐卧中的动中定，这两种定都很重要，它们各有优势，能互相补充，互相滋养，相得益彰。其中以静中定尤为重要，静中定修好了，身心都能轻松自在，烦恼降伏的也很快，这样在行走坐卧中修动中定时才能得力。尤其观行佛法更得力，更细致入微，能获得更深妙的智慧。</p><p>对于修定还不得力、不得法、找不到入手之处的人，这里介绍一些修定的具体方便方法，作为诸位修定的参考和借鉴。</p></div>"
},{
    "title": "第一章 修定的具体方法",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  修定的具体方法</strong></p><p><strong>第一节  念佛入定的方法</strong></p><p>一、教大家一个念佛打坐、调息排病、清除杂念、快速得定的方法。</p><p>第一步，先用口呼气，把胸腔和肺部里的浊气排出去，尽量呼尽，不要留存，一直到再也呼不出气为止，这时肚子是瘪的，因为气体被排空了。</p><p>第二步，气都呼净以后，暂停一小会儿，再用鼻子吸气，不要用口吸气，用口吸气容易把凉气吸进来，引起腹胀和胃胀。吸气时，让气一直往下运行到小腹丹田处，停顿一下；然后在呼气的同时，口念“阿弥”两个字，要用鼻音，鼻音越重越好，要拉长音，配合呼气。这样声音震动整个胸腔，就能打通胸腔的通道，让气脉运行，从而排除病气，也减少了妄念。当气呼尽时，声音也同时停止。音流的震动能够排除身体当中的阻碍物，排除病气，让气脉畅通运行，身体内部就能得到调整，身体就健康了。</p><p>第三步，气呼净了以后，停顿一下，再用鼻子吸气。吸的气一直徐徐缓慢地从鼻腔进入肺部，再往下运行，尽量到达丹田腹部。这口气往下越到底越好，下到丹田或者再往下，从丹田下边任何一个部位排出去都可。练习纯熟的人，可以观行气从脚心出去。这样气体运行的通道就可以很长，气体所经过的地方就能打通身体任脉和腿部气脉。这一方面也靠自己的意念力，实际上气体未必能够达到那么长的地方。</p><p>第四步，用鼻吸气吸满了以后，要停顿一下，改用口呼气。呼气时，要念“陀佛”两个字，气要呼尽，这时肚子是瘪的，因为腹中没有气体了。这口气呼出去以后，有的人身体不好，中间还可以再正常的呼吸一二次，调好身体的呼吸，不致疲劳就好。</p><p>第五步，上一口气呼出去以后，稍微屏息停顿一下，然后再用鼻子吸气，吸气吸满以后，再念“阿弥”，然后徐徐吐出这口气。念佛的时候，时间拉得越长越好，越缓慢越好，让鼻音流震动身体的五脏六腑，这样就能排除病气，打通气脉。当呼气念“陀佛”的时候，气经过胸腔或者冲到胸腔，整个胸腔就觉得扩展开来，有种空荡荡的感觉，很舒服，自己的心量就打开了，烦恼减轻了。然后气会冲到两个肩膀上，两个肩膀也觉得很舒服，肩膀就自然下垂伸展开来，向后背靠拢，不再含胸，气就通畅。最后气就从口呼出去，呼气时要呼尽，不要留有余气。</p><p>第六步，这样来来回回呼吸几次就行了，最多十次，身体就调好了，心也静了下来，同时会有一种神清气爽的感觉。气运行到丹田时，小腹部位就有感觉，有一种收缩感，进而有舒适感，身体也能发暖，这时就不爱说话了，妄想也减少，考虑事情就觉得很累，于是就不愿意再打妄想。气一呼出去，经过胸腔，胸腔就感觉很舒畅，就好像胸腔都打开了，心量也就慢慢扩大，心境就好了。</p><p>第七步，当气运行到肩膀的时候，两个肩膀自然下沉，肩膀一下沉，全身就放松，心也就沉了下去，就能得定。得定以后，念佛的声音再也发不出来，一出声就觉得累，这时就可改用心里念佛，或者改为其它修定的方法，或者参禅，或者思惟某个佛法的道理。如果定力再强，心里念佛也念不出来了，就改为想佛或者参禅，或者思惟佛法。</p><p>第八步，呼吸念佛几个来回以后，就能感觉到腹部丹田这里紧紧地收缩，气一到这里，妄想就没有了，肩膀及两个胳膊都非常舒服，肩膀也下沉，头部也有感觉，好像被气包裹住牵引着一样，身心都不愿意动，都沉静、稳定、放松下来，那就是得定了，妄想消失不现，心就住在这个寂静的状态中。</p><p>第九步，这种方法念佛是暂时而用，不适合长期用，每次时间也不宜过长，最多半个小时，十分钟或几分钟就行，得定非常快，排除烦恼，排除妄想，也非常快。如果身体是凉性的，那么气到丹田就能感觉到身体暖融融的，身体慢慢变得柔软下来，不再僵硬了。随着声流肺腑的冲击和震动，病气也能慢慢地排出去，通道一打开，身体的凉气和病障之气就能排出去了。</p><p>第十步，要注意一点：不能用口吸气。否则凉气吸进口里和胃里，胃部容易发胀，身体就不适，身心反而不得清静。吸气时用鼻子吸气，呼气的时候用口把废气呼出去。当念佛的声音已经发不出来时，这是最初步的定；以这个为基础再修定，就能很快，定的时间也能长一些。整个五脏六腑感觉热乎乎的暖融融的时候，不想再说话，不再打妄想。用这种方法排除烦恼特别快，心里也特别的舒畅，心情也很好，不再有嗔恨的念头出来，不再记恨别人，心量也能打开了。  </p><p>二、 通过念佛获得禅定</p><p>我们最初开始念佛时，由于心散乱，定力不够，一定要出声音念佛。因为口出声音时，并不妨碍心里攀缘乱想，即使心识很散乱，也能习惯性的念佛，心念不用专一，不需要有定，也不需要专注，所谓的口念心散乱就是这样的。口念佛时，耳识和意识心一起听，意根也缘着念佛这件事。如果口中虽然在念佛，意根照样到处攀缘，意识心就照样胡乱思惟，这时基本上没有什么定可言。</p><p>经过一段时间的念佛，稍微有了一点定力时，意根就能被拴住一点，意识的妄念也减少一些。定力再好一些的时候，出声音念佛心里就觉得很累和多余，念佛时就可以不用出声，默念比较舒服得力一些。心里念佛，一开始要心念心听，意识要专注倾听内心的念佛声，就没有多余精力打妄想了，意根也没有精力和心思再攀缘其它的事情，心就稳定下来，不再心猿意马，这样心能专注，定力生起，较深一些的禅定就出现了。</p><p>念佛的定力再好一些时，心里就不想念佛了，觉得心里念佛很累，总想舍弃念头，这时就要把心里念佛的声音灭除，改为忆念佛，想念佛，或者入定。时时刻刻都要想佛，做一切事情都要想念佛，心不离佛，佛不离心，这样的定力就相当好，能达到未到地定。以这样的定力来参究寻觅真如第八识，时节因缘具足，就能很快证得第八识，从而明心开悟。  </p><p>三、专注念佛降伏妄念</p><p>当我们念阿弥陀佛时，阿弥陀佛四个字是四个妄念，可以把四个字分成两部分，变成两个妄念，“阿弥”是一部分，“陀佛”是一部分。“阿弥”两个字要连起来念，算一个音节，“陀佛”两个字也要连起来念，也算一个音节。这两个音节之间，时间可以拉长，可以间隔很长时间，直到妄念出现了再念另一个音节。这样妄念就不容易插进来，当你念第一个音节的时候，整个心都要十分专注，等着听下一个音节；因为心很专注，你就没有精力打妄想，这样降伏妄念就很快，要达到一心念佛的功夫也不难。</p><p>其实降伏妄念的方法有很多种，需要学人根据自己的修行方法用心去体会。只要我们能够抓住重点，一心在念佛上，一心在念咒上，一心在背经上，那么妄念就不是什么问题了，有与没有都没关系，妄念不能阻碍我们的修行。只要我们一心专注在正念上，不去理会妄念，它自己没趣就会自动消失。  </p><p>四、深入内心念佛而得定</p><p>念佛要想得定，就要深入到内心。我们的意识心有时散乱得像一只猿猴，哪个境界都能到；意根更是到处攀缘，不肯停息下来。为了拴住意根意识这两个识心，就要学会慢慢念佛，念得越慢，心动得就越慢，最后才能停止。心念佛时，同时用心听着念佛的心声，意识心就能被拴住，这样意根也没有办法再去攀缘其它的法尘。这样心就专注在一个念佛境界上，就能达到一心，定力自然就好了。</p><p>修行若能修到意根，一切问题都能解决。从意根下手修行，最快也最直接。因为从我们修定的原理上也可以知道：定就是心的境界，是妄心七识的境界，以六七识心为主。心的各种专注境界，就是动中定，也包括静中定。心里觉知的法越来越少，越来越轻，甚至于消失，这是静中的定，能进入较深的定境。没有悟道之前，不要用过多的精力修这种无念的深定。  </p><p>五、专注听内心的念佛声音容易得定</p><p>修定的时候，听外来的声音入定，还不如听自己心内的声音入定要来得快，定得深。因为外面的声音不容易把意根拴住，让意根专注于声音上，那么意根还是要去攀缘其它的六尘，意识心就要在其它六尘上面分心，这样意识就散乱不容易定下来。如果心里能够念楞严咒或者念佛，让心也专注在听，把意根紧紧拴住，只攀缘一个念咒的声音或者念佛的声音，这样就能让心专注一境，慢慢就能定下来。</p><p>一天二六时中，心常念咒，不作他想，心识就能改变，不再去攀缘世俗，身心都得轻安。而且念咒念佛不仅仅要靠自力，也要靠佛力的加持，自己的力微弱，只因无始劫以来流浪生死太久，心染世俗法太深，很难一时从世俗当中超拔出来，就得依赖佛力及护法神的力来加持自己。念楞严咒的加持力更大，能让自己的修行精进起来，定力提升的也能很快。</p><p>修行过程中，要随时随地想办法对治自己的各种不善心行，不让各种不善心行任随自心随意乱动，最主要的是把意根拴住，不要让祂到处攀缘六尘，这样心识就能集中，思惟才能细密透彻，智慧才能出生。修定一定要从意根下手，这样就能定得深，入定就快。思惟也是如此，通过深深的思惟，就能调动意根的心力，不但道理思惟的通透，而且心行也能得到改变，只要意根认可某个道理，身口意行就能发生改变。所以修行不能只肤浅的修表面的意识，一定要修到意根，只要能熏到意根，就能事半功倍。</p><p><strong>第二节  动禅的修行方法</strong></p><p>所谓的动禅，是指在五阴身行来运往的身口意活动当中，保持心念专一，以能有足够的定力参禅和观行，这是定慧等持、止观双运的修行方法，是参禅证悟的前行方便手段。</p><p>动禅的修行方法有很多，无非都是摄心，达到心念专一，专心致志的目的。比如说佛讲的大念住经就是动禅的标准模式，尤其是身念住的观行，是动禅的基础修行方法。这种方法一定要掌握，尽量做到心念随时能专一，摄心、心不散乱，以此定力才能随时随地思惟观行佛法，因缘具足时就能证果和开悟，获得智慧。我们以大念住经为基准，可以设定很多类似的方便方法，来接引学人进入真正的实修阶段，以期都能实证佛法，受益无穷。</p><p>其中静坐拜佛方法，比较简单，适合初学。如果在静坐拜佛中，心念能达到专一，心中保持一个清醒的知性，对自身的五阴活动就有一定的反观力和警醒力，继而在行来送往中，心中时刻能保持有个清醒的知性，定力具足时，就可以把此个知性换成参禅的话头，转为看话头和参话头，这样就开始正式参禅了。  </p><p>一、打坐前的调呼吸方法</p><p>深呼吸是一个能使身心快速安稳的方法，在打坐之前要把呼吸调整好。呼吸调整好了，气息运行到丹田，不但身体健康，妄念也少，气到丹田时心里如果出现一个念头就感到非常的累心，于是不愿意打妄想，心就静下来了。其修行方法如下：</p><p>盘腿坐好后，先呼气，把浊气吐尽，从腹部开始往外吐气，吐尽了以后，腹部是瘪的。稍微停顿一下，开始吸气，一定要用鼻子吸气，不能用口吸气。吸气时要长而慢，又慢又长、又慢又长，心里一直观想着气从鼻腔、气管、肺部、胸腔徐徐的运行到腹部丹田，虽然一开始气不能运行到丹田，但也要这样观想，因为这有助于气往下运行，有助于打通任脉，打通五脏六腑。吸满气了以后，腹部是鼓的，稍微停顿一下，再慢慢用口呼出去，呼出去也要稍微慢一些。呼尽以后，闭口，稍微停顿一下，再重复吸气和呼气的过程。</p><p>注意，吸气的时间要长，时间越长，注意力越集中，心念越清静，气脉越容易运行，气要一直吸到腹部丹田。如果气脉真的运行到丹田了，那个时候想打妄想都打不出来了，因为打妄想很累心，想一件世俗法的事，你会觉得非常非常的累，于是就不想了，这时的心念就清静了，根本不会起烦恼，也不能有什么不好的心念了。</p><p>呼吸调整好以后，再接着修习打坐拜佛，这样入定又深又快，身心都安好。打坐修定如果修好了，这一天身心都是非常愉快的，然后在活动中再修习禅定，动中定就容易生起和保持住，修定要动静相结合起来修，能相得益彰，互相助益，不能只强调一个动中定，不要静中定。没有静中定滋养的动中定不可靠，容易散掉，一定要动和静互相结合修，所得定才安稳，才能够深入，大家可以好好实践一下。  </p><p>二、静坐拜佛</p><p>如果大家打坐的时候，腰腿还没有被降伏，坐一会就腰酸腿疼，并且心也跟着散乱或昏沉。那么现在教大家一个降伏腰腿的方法，这个方法就是盘腿打坐拜佛。</p><p>1，练习静坐拜佛的好处</p><p>之所以要练习这个方法，是因为我们打坐在刚刚上座时心是很散乱的。为了克服心的散乱与昏沉，可以在打坐或修观行之前，练习盘腿坐着拜佛的动作，修习这个动作既能集中心念，还可以调理色身。在拜佛中，把所有心念都集中在拜佛的动作上，他不旁顾，心念就能集中专一，心清气爽，思惟敏捷。</p><p>为什么说可以调理色身呢？因为当你把双腿盘好，在座位上慢慢伸腰拜佛的时候，后背的两条筋就能被迫拉直。这个筋一旦撑开拉直，就能舒展身体，有助于气脉在后背督脉的运行，容易打通督脉。打通督脉时，气的运行就畅通无阻，这时候得定也就比较容易了。坐着拜佛要慢慢、慢慢地做拜佛的动作，为的是要降伏心念，让心念达到专一，心清静，既不散乱也不昏沉。</p><p>2，盘腿拜佛的具体方法</p><p>第一步，盘腿调息：准备一个较大的拜垫，上座后把双腿盘好，身体坐直，调整呼吸，放松身体。盘腿不一定要双盘，单盘和散盘都可以，不用拘执形式。然后调整呼吸，先呼后吸，排净废气，让心空净下来。无论呼气还是吸气，内心都要知，清醒而不糊涂。</p><p>第二步，拜佛动作：拜佛的动作越复杂越好，为的是训练自己的专注力，有效的增强定力。呼吸调整一小会，感觉气息调匀，污浊的气体已排净，头脑清醒了以后，双手合掌，眼睛四十五度角看着前方，接着把右手伸到身体的前面，放在拜垫的正中央。放好以后，左手再伸出来，慢慢伸向身体的左前方，放在拜垫上，最后右手再慢慢移向右前方放在拜垫上，两手同齐，两个胳膊要伸直。这时把头抬起来，用口呼出胸中之气，呼尽之后，慢慢把腰弯下去，头磕在拜垫上，在两手中间。</p><p>这时，整个身体就贴伏在拜垫上，后背的两条筋就完全拉伸开了。筋拉开以后对身体有很多好处，身体舒张不紧缩，感觉就很轻松自在，还能调整内脏，排除疾病，有利于身体的健康长寿。因为身体里的筋一收缩，身体就显得僵硬，活动不方便，容易有病痛。筋拉伸开了，身体变得柔软，气脉运行畅通，慢慢排除病气，身体就健康了。在练习动作中，无论色身处于什么姿势和状态，内心都要有知，保持清醒，心念专一。</p><p>第三步，翻掌呼气：头磕下去以后，双手慢慢握拳——翻掌——伸开，手心向上，停一会儿，然后再慢慢握拳——翻掌——伸手；翻过来以后，手心要向下，双手平直地放在拜垫上。这时候再抬起头挺身，同时把胸腔中的废气再呼出去。呼气的时候，气从丹田腹部一直冲到胸腔，再冲到肩膀，这个时候两个肩膀会感觉很舒服，心就沉静下来，妄念减少。无论身体是怎样的姿态，气脉运行到哪里，五脏六腑是什么情况，内心都要有知，保持觉知和觉醒。</p><p>第四步，收手挺身：抬头呼出一口气以后，收回右手，放在腿前方的拜垫上，和腿保持平行一致；接着将左手一点一点地抬起来，慢慢回到胸前，身体要慢慢地跟着挺起来。最后把放在前方中间的右手再拿上来，然后双手合十，身体再慢慢的坐直，恢复到原位，这就是打坐拜佛的一个完整过程。无论在此过程身体处于什么姿态，气脉运行到哪里，内脏是什么感觉，内心里都要知，清醒而不迷糊。  </p><p>三、注意事项</p><p>在做这个动作的过程中，要注意几点：</p><p>1，保持心念集中和头脑清醒。心念的注意力要集中在整个身体的运作上，每一个动作心里都要清楚，都要了知。这样，内心里时时刻刻有个知在，有个观照的作用，念头专一和集中，定力就出现，心里不再有其它的妄想，也就不散乱了。将来把这个知和观照的对象转成参禅的话头，就可以参禅了。</p><p>2，动作要缓慢舒展，心念要一直跟随着每个动作。整个拜佛的动作要非常缓慢，就像练习柔道、练习瑜伽一样，注意力不要分散。完成一个完整的动作要达到半分钟或更长一点的时间，时间越长动作越缓慢，注意力越集中，心越清净，后背两条筋的拉伸效果越好，两条腿压得也就充分，周身的气血运转也越通畅。这样有助于气脉的运行和打通双腿的气脉，使双腿柔软下来，周身的血液循环也通畅。气脉运行能使身体健康，身体感觉舒服，精神愉悦，心念就自然而然地清静下来，心念集中不散乱，也不会昏沉了。动作越慢，注意力越集中，定力越容易生起。</p><p>3，做第二个动作前，还要再调整呼吸，调匀了以后，再慢慢的拜下去，每次抬头时都要向外呼气。呼气的同时就把气引到胸腔，并且带到整个肩膀，身体轻松且上浮，感觉舒适，得定快速。坚持练习一段时间，两条腿就慢慢变得柔软了，同时腰部和背部也变得柔软了，身体健康，心情愉悦，烦恼轻微，容易现起禅定。比起强行盘腿打坐，这个方法效果要好一些，大家可以好好修习。</p><p>4，每次修习时间应在十分钟到半小时时间，如果能延长修习时间，作为禅定的基础和前行方便，那就更好了。修习结束后，由于色身比较舒适，心念也比较清静不散乱，妄想也少，以后就可以随意安排了。可以继续静坐、念佛、思惟佛法，也可以修观行。之后在日常的色身活动中，也要训练自己保持觉知，知自己色身的状态，色身的动作，时刻警醒和反观，以此心念专一，定力增强，内心无忧，身心轻安愉悦，反应灵敏，思惟敏捷。  </p><p>四、静坐拜佛的好处</p><p>在练习盘腿打坐的时候，要先把腿盘好，盘腿坐着拜佛，动作要极为缓慢。身体强行把腿压住，这样气脉就容易通过双腿，气脉通过去了腿就柔软。这样盘腿拜佛，因为注意力在拜佛的动作上，不在腿上，就不能感觉到腿疼。原来你的意识注意力在腿上，在盘腿拜佛的时候，把注意力全部转移到每一个拜佛的动作上了，注意力一转移，你就不觉得腿疼了。因为腿被强迫压着不能动，心也就安稳，气脉通过去就快，腿柔软的就快，渐渐就不感觉疼了。腰也是这样，当你强迫盘腿拜佛时，腰疼你也感觉不出来，这样拜着拜着，气脉通了，腰也柔软了，那么整个身体都会柔软下来。以后当你再打坐时，身体就不难过，腿也不疼，腰也不疼，打坐的时间就加长了。</p><p>盘腿拜佛的时候，要慢慢、慢慢地拜，把全部注意力都栓在拜佛的动作上。越慢越好，越慢越好，注意力集中在拜佛动作上，心念就会集中不散乱了，也不会胡思乱想。心静下来以后，气脉运行，身体感觉舒适，身心就被降伏了，静坐时，心就容易静下来。用这样的练习来驯服双腿、驯服自己的腰身，降伏自己散乱的心，效果非常好。在拜佛时，把身体都贴在拜垫上，身体后背的两条筋就会充分的拉伸，身体得到舒张，容易让气脉通过后边的督脉，气脉一动起来，容易排病气，身体就健康了。</p><p>盘腿拜佛时，身体的动作缓慢，就能引得气脉在身体里按照它所应该运行的通道而运行，不断的打通身体的穴位和通道，让身体柔韧和健康，消除病痛和隐患。这样筋伸长了，身体就轻松柔软了，心也清静了，筋伸长了就能去除很多的疾病，也有利于长寿。盘腿拜佛方法与练习柔道术与瑜伽是一样的道理，都能让色身变得松弛柔软，心境柔和，从而让身体健康而长寿。当你盘腿拜佛时，能把后背的两条筋撑开，慢慢的拜佛，越慢撑得越到位，筋越能拉长，拉长以后身体就柔软了。如果总不锻炼活动身体，身体就僵硬。所谓僵硬，其实就是筋短了，筋短了，身体机能受限，没有活力了。</p><p>当盘腿拜佛的时候，不但能拉伸后背的筋，连脖颈的筋都伸展了，再拉伸臀部的筋，再就是两条腿的筋也都拉伸开了。筋拉伸开了，腿也就柔软了，腰也柔软了。刚开始坐的时候，身体可能都是僵硬的，因为筋都是紧缩着的，没有撑开，所以打坐时，就感觉疼痛。坚持练习一段时间就好了，尤其年龄稍微大了的时候，更要修持自己身心，身体各部位的筋都要抻开，身体就柔软有活力了，心也容易静下来，降伏身体的同时，心也就慢慢被降伏了下来。</p><p>在拜佛当中，心念是很重要的，心念集中在拜佛的每个动作上，内心时刻有个知，知道自己目前正在做什么，清清楚楚，明明白白，而没有杂念。然后在行住坐卧时，都带着这个知不放，一心不乱，动中定牢固，就可以参话头了。把心中知的对象，换成一句话的话头，悬在心头，行住坐卧都带着话头，疑情生起时，就可以参究话头，有朝一日，就能明心开悟。这是很重要的一种修定方法，名为动禪，希望能利益大家，早日证道。</p><p><strong>第三节  用背诵经咒的方法修定</strong></p><p>一、用背心经或楞严咒、大悲咒的方法修定，能够让心清净下来，以此能很快的增强定力。每天不管做什么，行走坐卧时心里都要背心经或咒语，有事的时候，就稍微快一点的背诵，因为背慢了就会忘记；没有事比较清闲的时候，就要背得慢一点，心念就能集中，禅定容易出现。心经要按照下面的音节慢慢的背诵，越慢越好：观~自在~菩萨，行~深~般若~波罗~蜜多~时……，要抑扬顿挫，一字一停顿，或者一个词语一停顿，要把全部的注意力都放在听背诵的声音上面，听不见声音就在打妄想了，那就再把注意力放在听佛经和咒语上。这样意根就被栓在经文上，不能再去攀缘其它的事情，意识心的杂念就少了，定力慢慢就能增强。</p><p>如果是打坐背心经，速度再稍微慢点，定力来得更快。慢慢的，越慢越好，过一段时间，注意力就能非常集中，心无杂念。定力相当好时，心就能进入定中，背诵的《心经》和咒语可能就断了，心里也背不出来，就可以入定一段时间，疏通一下气脉，缓解一下疲劳，清净一下身心，不需要太长时间。因为还没有悟道，长期入定无念头就浪费时间，还可能贪着禅定，从而障碍思惟观行等等的智慧修行。</p><p>二、打坐时可以一心持咒，可以定慧等持。但定深一些的时候，持咒就困难了，感觉很累，最后就不持咒了。如果想入定，这时完全可以舍弃咒语，入到定中。出定以后再思惟观行佛法，思路就会很清晰，甚至一天到晚心情都很愉悦，思惟灵敏。所以不是说打坐入定不好，耽误思惟之后的产生，而恰恰能够提升思惟力，还能降伏烦恼，修行进步相当快。</p><p>默念楞严咒，需要定力相当好，定力不够好念咒时必须出声念，意识在发声，意根可以轻松缘声尘，就能开小差了。而默念，意根稍微一放松不注意，意识就想不起来了，因此默念能拴住意根。当定力非常好时，意识念时觉得很累，就不愿意出声了，这时就容易断灭，最好能改为让意根念，意识轻轻缘着，这样定力也强。越不容易念，越能引起意根注意，越能有定。太熟悉的意识不费力，意根就可以开小差，那就散乱了。</p><p>三、心比较散乱的人，为了摄心，最初开始修定，最好还是从念楞严咒开始，每天念三遍、七遍、二十一遍或者四十九遍楞严咒，能达到背诵的程度最好。这样行走坐卧心都在楞严咒上，六尘境界少攀缘，慢慢就能有定了。而且念楞严咒，有诸佛菩萨和护法神的加持力自己的道业进步也会快一些。心散乱的人，打坐时，观想一个极其有趣的境界，过程要长一些，要有一定构思，心思才能专注于观想，禅定就出现了。禅定稳定下来以后，再把这些观想出来的境界舍掉，转换成思考一个法理。如果总是把境界当真，就会容易出偏差。</p><p>四、如何念咒效果好</p><p>在读诵经咒之前，要调整好呼吸，做几次深呼吸，头脑清醒，心念就能清净下来，然后再读诵就能专心了。定力好，记忆效果就好，定力不好，心念散乱，读诵就不容易记住。为了摄心得定，诵咒的时候音调一定要拉长低沉，音调不要上扬，不要旋律太多，免得引起心里情绪的波动，心念散乱，不容易静止。念佛号也是这样，不要有激昂的情绪，旋律不要高扬，曲调尽量低沉，才能不引起情绪上的波动，从而摄心，得定快，容易感应到佛的加持。</p><p><strong>第四节  呼吸与禅定</strong></p><p>一、呼吸与我们的身体健康有密切的关系，也与禅定有密切的关系，与寿命也有密切的关系。一个身体状况不太好的人，他的呼吸一定是急促或短促的，呼吸通道很短而且也不通畅，他的气息只能到达喉咙口就呼出去了，不然就喘不过气来。有的人气息只能到达心口就要呼出去，他的呼吸也很短，身体状况就不佳。</p><p>修习禅定功夫好的人，气息可到达下腹部的丹田，呼吸通道很长，他呼吸一口气需要很长时间，中间没有阻碍，他的身体一定是健康的。气息一旦能到达丹田，心就可以沉静下来，妄念减少，打个妄念都是很累的，不愿意多说话，因此消耗的能量也少。这时候烦恼就能够压伏下来，心也比较清净，思考问题也比较专一，思惟深细而透彻，智慧就容易显发出来。</p><p>禅定功夫好的人达到四禅时，呼吸就要停止，消耗的能量就非常少，他的身体更健康，寿命更长久。这时修习神通，随修随得，不费气力。我们为了身体健康，心得清净，降伏烦恼，平时也可训练自己的呼吸，让气息达到丹田。可以用念佛的方法来训练自己，气息调整好了，禅定就出现，神清气爽，精力充沛。</p><p>在念佛时调整呼吸，开始要先用口呼出肺腑里的浊气，等浊气全都呼尽以后，再闭口用鼻子吸气，让气流缓缓一直到达腹部丹田，甚至能更往下直接排出去。这条通道越长，排除的病气就越多，身体状态就越好。吸气到丹田以后，停一小段时间，或者换一口气，再用口呼出。呼气时念“阿弥”或者“陀佛”，口念心念都可以，气到丹田就念不出来了，甚至于内心中的佛号也会停止，这时可改为忆佛。呼气时念佛，气呼尽了，稍停一会儿，再闭口用鼻吸气。这样训练十分钟或者几分钟，心就能够静止下来。这时可以完全用忆佛的方法来念佛，或者思惟一个佛法道理。这时的定力可以让你往更深入的方向修行，想要达到一心的境界也不难。  </p><p>二、调整好呼吸就能很快心静</p><p>修定或者观行思惟之前要调整好呼吸，心很快就能静下来。先用口呼出胸腔中的浊气，时间长点，呼尽为好，然后闭口用鼻子吸气，让气流一直进入丹田腹部，这样呼吸几次，心就能够安静下来。之后再打坐或者拜佛，或者思惟佛法，观行四圣谛理和修习四念处观，或者念经念佛念咒。修到有一定程度的定时，心是寂静的，身体当中的气脉就开始运行，当气脉从下往上运行到胸腔时，胸腔里的感觉就非常舒适，像是雾蒙蒙的扩张着胸腔，气息非常细微，连带着两个肩膀都是轻飘飘的。</p><p>尤其在初禅定里，五脏六腑好像都不存在似的，气息轻轻的缓缓的就像快要断了似的，身体非常轻灵，内心除了舒适愉悦和喜悦，没有任何一点不好的感受。当打坐时把气息调理好了以后，气脉马上就能运行起来，气一到丹田，妄想就减少或消失，也不想再说话了。平时拜佛，每次抬头时，都要把气呼出体外，那么气流就会冲击胸腔，感受非常好，身体也轻松，定力生起就快。</p><p>三、用深呼吸的方法调整呼吸，有助于打坐修定，容易静心。方法是先把胸腔里的浊气呼出去，呼净以后再不能呼了，肚子瘪瘪的，就静止不动；然后再用鼻吸气，吸满了不能再吸了，肚子鼓鼓的，就停止不动。随着一呼一吸，浊气消除，清气上升，气脉就会运行到肩膀或者是头部，头脑清晰，身体就会感到轻安，心就会静止下来。</p><p>深呼吸之后，如果有人心还是不静，就用呼吸念佛方法，调身调心。呼吸念佛方法主要对治任脉不通致使心不静的问题。浊气呼出去以后，吸气吸满，再呼气时就念阿弥两个字，用后膛音念，让音流震动五脏六腑，把五脏六腑气脉打通。下一次呼气时再念陀佛两个字。呼气时念佛，吸气时不念，练习一段时间，呼吸的通道就长了，越长身体越健康，心越静。</p><p>最后气脉就会上升到肩膀和头部，神清气爽，心清静。音流从口进入到喉咙到肺，再到胸腔到丹田，从丹田再到口腔出去。这样反复练习，胸腔震动，任脉就打通了。一般来说气到丹田，人就比较安静了，妄念很少，就能得止，定深了妄念就能消失。定力修出来以后，可以观想气脉的走向，可以让气脉从丹田往下从脚心出去，这要看个人的观想力和气息的持久力了。</p><p><strong>第五节  修定的最初入手方法</strong></p><p>一、初学修定，可以选择从早到晚专一背诵一部经，或者一个咒语，或者念佛，不作其他的念想，久而久之，心就能定下来，精力集中，心无旁骛，定力就能生起来。修行要止观双运，不能只偏向定，也不能只偏向慧，要定慧等修，才能成就佛法。有定无慧，佛法不能成就，有慧无定，也不能成就佛法；定慧双具，一切佛法必能证得。在学佛人当中，一部分人专门学理论知识，不修定；一部分人专门修定，不学佛法知见也不思惟佛法；这二者都是偏颇的，如果能把修定与修慧结合起来，就能实证佛法，必能成就。</p><p>深入思惟观行之时就是定慧双修，定慧等持。如果能够专心思惟，心里无杂念，在明心顿悟之前，就可以不用专门修定。但不是所有人都能做到这一点，这就要特意去修定。打坐的静中定，能够增强和促进五蕴活动中的定力，有时间尽量修。从另一方面来说，有智慧的人修定也比较容易，内心知道万法虚妄，少于攀缘，修定就非常顺利快速，不知不觉间心念就能集中不散乱，这是前世的根基。没有智慧的人修定就比较困难，心太散，攀缘心太重，把什么都当作是真实的缘故。</p><p>二、幻想趣境修定法</p><p>修定时也可以幻想一个有趣的境界，把整个注意力全部投入进去，忘记自己和周围的一切，然后再舍弃这个境界，心心念念都要知道境界虚妄，不被它所诱惑，又能专一其心，这样入定也是很快的。比如观想西方极乐世界图，或者观想佛菩萨细微的相貌，或者观想自己一点点变成佛菩萨的相貌，或者观想自己一点点的飞升到其它地方，或者观想自己一点点的改造生存环境，变得越来越美好，或者观想自己气通整个任脉或者是督脉，或者是气通任督二脉，等等这些只要有益身心的都可以用来观想，心趣一境，必然得定。或者把呼吸调整好以后，什么方法都不用，心就能静下来，直接入定；或者用观呼吸或数呼吸的方法，都能快速地定下心来。修行当中，我们要随时注意总结经验，多多体会，这样就能懂得如何快速修定，找出适合自己的修定方法。  </p><p>三、解决妄想纷飞的办法</p><p>如果我们平时念经念佛念咒很熟练时，口中能非常轻松地念出来，可是心里照样妄想纷飞，这样没有禅定就得不到法益。为什么是这样，该如何解决这个问题？这种状况就是意识心对于所念诵和背诵的内容已经很熟练，记忆力也非常好，可以不经过意根的深细思量考究就可以流利地诵出来，这样意根闲着无事，就有精力去攀缘其它的法尘，于是妄想就产生了。这样一边诵经一边就会妄想纷飞，禅定无法成就，也就不能静静的深深的思惟明了经中的义理，修行的受用就很小。</p><p>解决的办法是：慢慢地念诵和背诵，越慢越好，这样就把意根牢牢拴住，意根就没有精力再去攀缘其它的法，不能再打妄想了。我们无论念经念佛念咒或拜佛，速度都要慢，这样意根攀缘不了其它法，心就能定住，甚至能达到一心不乱。大家不妨试一试，这是非常好的方法，效果好，得定快，气息能够很好地调匀，又不伤气，身体也能得到有效的调理。</p><p>修行不是追求速度和数量，而是要求质量。质量就是三昧，就是心的境界，就是止和定。有定时，思惟才能深细，才能开智慧，最终就能得到佛法上的最大利益。  </p><p>四、制心一处，无事不办</p><p>世俗法当中有一句话叫作：制心一处，无事不办。试想是一个锥子的椎尖扎入地里深，还是一块板子扎入地里深？答案肯定是锥尖扎入地里深。修定就是此理，心住在一个境界里，心力专一不分散，定心深入，细致思惟一个义理，就能贯通其义，从而生起智慧。没有定时，心就像那块木头板子一样，面积大，力量分散，就不能深入土中。修定，就是要心缘一处，精力集中，这样才能无事不办。</p><p>有一个修定的特例，能证明心念专一定力深，就能证得佛法，获得智慧。释迦佛有个弟子叫作周利槃陀伽，由于前世的业缘而感招的果报，头脑非常愚笨，无论学后忘前，学前忘后，学一句话忘一句话。世尊看他这样愚笨，心生怜悯，就教他念两个字：扫帚。周利槃陀伽每天无论做什么事情，心里都念扫帚两字，最后心就清净下来，能在禅定中思惟小乘的理，最后就证得了四果阿罗汉。周利槃陀伽念扫帚，心无杂念，以此定力，思惟世尊所讲的佛法道理，就证果了。所以我们修定也要心住一境，心缘一念，长此以往，坚持不懈的进行下去，定力就能生起，最后观行思惟就能成功。这一境一念，可以是一句佛号，一个咒，或者一部短经；无论做什么心中都是经咒，都是念佛，心中抛却对人间的贪执，定力一定能够生起。</p><p>五、如何让净念纯熟相继</p><p>在行走坐卧做事情时可以有净念，但净念却不是一个念，最少有两个念，三个念是正常。如果要有定的话，心中无论干什么，都要有一个主念，就是重点，把这个主念保持住不丢掉，就是禅定，其它的念轻轻带着就行。这确实需要一定的功夫，可以当作一个固定的课程去练习，熟了心里就轻松省力了，没有太多技巧，对世俗法减淡，净念就能保持下去。意根以这个念为主，少分心其他法，意识也就随之定于这个念上，其他的事情用心就少而轻微。平时减少兴趣，不重要的事情抱着应付的心理就好。</p><p><strong>第六节  定的状态</strong></p><p>一、定是什么状态呢？定是心不动的状态，主要指六识不动，意根动于少处，动得慢而微。比如愣神发愣的状态，愣神时，意识心专注于一境，定在一境而不动，没有浮浅的思惟作用，而法尘深深的植入意根，意根被迫把主要精力放在此法尘境界上，就不得不深深的思量，这样智慧就能打开，把此法尘境界的根源和实质考虑清楚明白。这是意识与意根共同合作的结果，意识深细思惟，意根宁神助思，亲自参与思量，结果定慧现前。</p><p>发愣、发呆、失神、愣神，愣是呆而不动的意思，神是指意识，愣神就是意识不起思惟分析作用了。因为意识已经把法的表面肤浅的意思弄明白了，再深一步的问题就解决不了了，于是不得不把问题交给意根来解决，意识只负责盯住问题就行了。很多重大和深入的问题意识都解决不了，只好依赖意根宿世的固有的经验和智慧，前期意识把浅显的问题弄明白传递给意根，意根了解个大概，就会单独的思量进一步的问题。比如见到老同学老同事，意识认出来这个人，知道是谁，可就是说不出名字，无法称呼这个人，以至于无法打招呼。这时意识就不能有什么动作了，意根只好搜索这个人的名字，不断的思量寻思，同时让六识张口结舌，眼睛瞪者对方，什么也不要做。在愣神的时候，有时候意识也有一些微弱的思惟活动，以辅助意根的思量，但意识的思惟不会强大，否则意识的思想活跃，就从愣神的状态出来了。</p><p>在世俗法里有很多情况也是如此，遇到必需要解决的重大问题，意识陷入发愣的状态，少动，少分析少情思意解，内心深处也就是意根悬着这个重大事情，就能把事情思量个清楚明白，解决问题的方法就出来了。把愣神专注的定力延长，越长越好，越深入意根越好，意识越少思惟越好，时节因缘具足，不愁不能证得任何一个法。为什么有人看不明白佛经和法义，不懂他人的语言和心理？就是因为缺少禅定，智慧不足以得到开启。缺少禅定，也就是因为缺少福德的缘故，心里浮躁，思惟浅薄。</p><p>二、发愣状态里面不是空，不是一念不生的空无状态，不是呆呆的状态，有深深的思想活动，类似于参话头，深究法义。在愣神时，最好能把意根愣明白，揪出意根的心理活动。</p><p>遇见一个问题，眼睛翻一下直直的不动，意识马上就定住，直直的，脑子深处在转在思惟，非常深，非常隐秘，表面看是不思惟，没有思想了，其实深处在活动着，不显露出来。这是深入了意根，调动了意根的结果，意识少分析，意根多用心亲自思法，智慧的潜能就能发挥出来。这就是参究的原理。</p><p>有些人不懂什么是定，也不会修定，不会使用意根，其实就是禅定越深，意根的作用越大于意识。尽量让意根多参与意识的思惟，意识不浅薄思惟，这叫参究，智慧肯定能开发出来。思惟五蕴，就能断我见；参禅，就能明心证悟；参佛性，就能证得如幻观；观行七识的幻化，就能证得阳炎观；观行万法如梦幻泡影，就能证得如梦观等等，所有的观行都能现量观，现量证，绝不是情思意解和想象。</p><p>三、愣神属于什么状态</p><p>问：愣住神了，法义尚在意根处，盯住它，让其思量，尽量延长这个过程。意根的思是五遍行心所法，所以意根这个思量是时时处处都存在都在运行。愣神就是把意识空下来，给意根空间时间，让意根思量法义吗？愣神时意根肯定在思量，有五遍行心所法可以解释。愣神时，意识的状态似乎是空白的，没有任何思维，连电视影像和声音都无法干扰，至于时间，那是有长有短。意识专注，栓住了意根，使得意根少攀缘。但是意识也同样没有作用，或者是栓住意根就是意识的作用？</p><p>答：延长愣神的过程，就是让意根连续不断的深思细思，能出生智慧，有效的解决问题。愣神也叫作沉思，其实是在定里意根处于意识的免打扰状态，意识专注不散乱，少思惟分析不思惟分析，不打扰意根，让意根也少攀缘，集中作意和思量，才能有智慧出生，从而解决问题。</p><p>在愣神当中，意识与意根一起专注着法尘，配合着意根，只是没有什么思惟。意根不处于一念不生的状态，有思量就有念想活动，有思想活动才有智慧出生。有些时候睡前思考一个问题而没有想明白，睡了一宿觉，早晨醒过来就明白了，这说明意根在晚上还是继续工作思量了。</p><p>发愣状态中有意识，意识不能灭，不是意识的空无状态，不是意识的一念不生状态，是意识的专注状态。意识专注是定，意识有深细思惟是慧，定慧等持，就是三昧境界。意识专注于所思考的法尘上，与一念不生、空空荡荡的状态有明显区别。既然不是一念不生的无心，不是无所事事的状态，意识就有思惟，只是思惟得很深细，动得非常缓慢，非常深，与意根一起和合运作，思考法尘。           </p><p><strong>第七节  用楞神方法修动中定力</strong></p><p>一、问：用楞神来修动中定力，确实是一个善巧方便，但大多数人觉得楞神难以持久。用楞神来作为入口，然后不让语言文字在心中出现，看住它，保持住，慢慢训练，楞神的时间会变长。这其实就是看话头吧？</p><p>答：这个状态就是无语言文字的状态，一开始进入的时间短一些，通过不断的训练，可以延迟时间，定力能深入一些，参究就比较得力。</p><p>这种状态，不仅是与看话头相似，实际上就是参究话头。参究，就有意根思量性的作用，意识少于分析，或者不分析，配合意根的思量，把思量的任务移到意根的肩上，让意根承担一些，然后某个时节因缘相应，意根与意识同时证得法。如果不是这样，意识思惟分析之后，再交给意根，意根不一定认可承认，短时间内意根绝对不能认可承认，因为这不是意根的现量了别，意识也没有把所有的证据都拿出来，也不是完全的现量了别，意根就不与之相应，因此不能证法。</p><p>意根虽然智慧不强，比意识低很多，但祂是作主识，一切法意根说了算作决定，一切事情祂不点头，就不算数。好像一个一家之主，虽然比其他家庭成员智慧低一些，但是一家子的事情都由这个人作主决定。要想让这个人认可决定一件事情，就得用各种有说服力的理由证据说服祂，让他相信以后就能决定下来了。最好的办法就是让他亲自了解这个事情，亲临现场，亲眼所见，在事实面前当场就能相信，然后就爽快的作抉择作决定认可此事。</p><p>二、发愣状态里有意根的思量性</p><p>问：我经过体验，发现发愣状态随时随地可以进行，效率很高。发愣时间有长有短，但是无法使用意根思量法义，用发愣来思量法义恐怕要有个入处，一时无法掌握。于是索性用发愣这个法来锻炼修定。不知是否如理？</p><p>答：如果没有找到意根，就无法知道在发愣的状态中，也有意根的思量性，因为意根的思量性非常隐秘，不容易发现，需要证得意根，了知意根的运作才行，即使在六识都消失以后，意根仍然有思量性，有抉择性，有各种识心活动，何况在意识有定的情况下，更有意根的识心活动了，意根的心理活动从来就没有停止过，只不过祂有什么样的识心活动，思量什么法的差别而已。</p><p>在发愣状态里，意根有思量，没有空，关键在于意根思量的是什么。如果想让意根思量比较重要的法义，前期就要让意识把这个法义理解清楚，缕清大概路数，然后深悬于心，就交给意根了。之后意识不要散乱攀缘，要紧紧盯住这个法义不动，就把意根拴在这个法义上进行思量了。</p><p>这个发愣状态里也有意识的深细思惟作用，还要把意识和意根的思想分开来，这是非常不容易的。愣神时间长一点，能够思量出一个不太深的法义，能够考虑清楚不太难的问题，不动用语言文字。很多人都有过类似经验，就是不能反观，不能总结出来，因为不了解意根的活动。因为我能观察意根的运作，所以能够总结出来这个修定思惟方法，如果我不能观察意根的运作，就不知道在发愣的状态中，意根也启动了，在运作、在思量、在抉择，那就无法告知他人，指导他人。</p><p>发现和总结经验，也是智慧的结晶。运用愣神状态修行禅定也非常好，容易有入手处。意识和意根都要专注在一个点上不动，意识指示给意根一个思量的内容和范围，就把意根定在了一个法上，这样就有禅定了。</p><p>三、愣神与一念不生和发呆的区别</p><p>愣神就是意根对某个事深深的关注了，注意力几乎全部集中在关注的事情上，意识心是没有念头，但意根却有非常隐秘的思量，只是意识不动念，这就是很深的禅定，就看能持续多长时间了。时间长一些，就能足够解决一个问题，顿时就容易有所领悟，茅塞顿开，没有疑惑。</p><p>而一念不生，意识没有念，意根也没有什么事要特别关注思量的，思想比较轻微不够集中和专注，属于意识傻傻的一种状态。因为没有什么问题要思虑，也就不会解决什么问题，不会茅塞顿开，不会有灵感出现，没有智慧出生。</p><p>愣神是把心定住，心里有心事、有思想、有思量、有思虑，不是空的。发呆有时候是因为某些事而发呆，与愣神相近，有时候因为有点闲，心里有点空落，与一念不生相近。</p><p><strong>第八节  训练意根的禅定</strong></p><p>一、甚深禅定当中意识能够离开语言文字，心中可以有思有想，也可以无思，但想的比较简单只是表面的知，而意根从来都是离开语言文字的，祂不与语言文字相应，与语言文字相应的是意识心，思惟浮浅。能离开语言文字思惟时，定力都很好，已经深入到意根、启动意根的思了，容易出生智慧，这样的定力不容易修。定力浅的人思惟时一定有语言文字配合，否则就思惟不下去，所以智慧也不足。由浮浅的意识的思过渡到意根的思，只有在禅定中才能做得到，禅定越深，意根的功用越大，开发出的智慧越大。</p><p>看一个人的眼神和面部表情，就知道这个人是否有定，和定力的深浅。因为有定时眼神与面部表情都与平常不一样，比较凝重和深沉，这是在深思的表情，肌肉绷紧，眼神集中，语言文字动得少，或者不动。意识浮浅思惟时，眼神是活的，深思时眼神凝滞而深邃，表情凝重。所谓的凝，就是定，这是意根在起用。没有定的人散漫懈怠，肌肉松弛，眼神游离不定不集中，因为意根没有专注凝聚在一法上。</p><p>意根是控制指挥身根的指挥官，虽然一般人都不懂这个原理，但是事实就是这样。有人说是第八识控制身根，但是第八识是服从意根，听从意根指挥的，祂自己并不想控制身根和面部表情等等身体的刹那变化。这种用意根隐秘的深深的思量佛法的窍门如果能掌握，修到几地菩萨都能用得上，对于修证非常实用，也非常快速，智慧增长很快。</p><p>二、观察佛像十秒钟，然后再看白色的墙面，就会出现佛像的影像，一会儿影像就消失不见。这个境界是如何出现的？这是视觉暂留现象，是眼识意识的记忆功能，还没有深入到意根，意根没有记住，如果意根记住就会长期停留这种影像。如果眼识意识观察久了，就会影响意根，意根记住以后，就会随时随地出现影像，这就是三昧定境。以眼识为主的视觉暂留时间短，以意识为主的视觉暂留时间要长，而且闭眼之后再睁眼还能看到。</p><p>过目不忘是怎么回事？意识单独记忆的内容，用不了多长时间就忘记了，而意根记忆的内容很难忘记，甚至能不自觉的想起来，再甚至有可能挥之不去。过目不忘，是因为定深，意识意根专注力强，以至于瞬间记忆很牢固，如果定浅，记忆的东西不牢固，忘记的就快。所以所有的定境都由意根引发，意识不能引发长久的定境，只能非常短暂的出现某种境界。我们要想成就各种三昧，一定要深入到意根，由意根来引发境界。</p><p> 如果经常观察佛像，禅定就会出现，让意根记住佛像，看看眼前是否总能出现那个影像。如果总能出现佛的影像，那我们会不会修定？会不会修念佛三昧？会不会修白骨观？会不会修观无量寿经？观想西方极乐世界，意识勤加练习，意根达到不忘，等到命终的时候，不管什么境界，内心只要一想极乐世界，意根就能安住在极乐世界，极乐世界就会现前，必定往生。精进修行的时候谁精进比较有效果？意根精进有效果，意根精进才是真精进。如果想让极乐世界的境像现前，那就让意根念佛，意根与意识一起观想极乐世界。</p><p>三、环境熏染的力量是很大的，如果身边有人口痴，总看着他说话，慢慢可能就被熏染有点口痴，外貌生活习惯，亦是如此，包括情绪都是传染的。这就是由意识的熏染，转化到意根这里，熏染了意根，从而改变了五阴身，所以说近朱者赤，近墨者黑。我们一定要多近善法和善人，多接触乐观积极向上的有正能量的人，自己就能被感染乐观向上，积极进取，如果有能力定力强，才可以去近恶人度化恶人，否则就容易被恶人度。</p></div>"
},{
    "title": "第二章 禅定的内涵",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  禅定的内涵</strong></p><p><strong>第一节  禅定的定义</strong></p><p>一、定的含义</p><p>定就是不动，静中定是心不动，身不动，口不动。日常身体活动当中的定，是指行住坐卧时身体虽然在动，心却专一一境。定力越好，身体动作就越慢，同时心不散乱，缘于一个境界而不动。所以我们念佛、念咒、念经、拜佛时就不能单纯求速度，而应当求质量，质量就是指心清净，定力增强，烦恼减轻，心清明，更加明了修行之理。能够得定，就是功德，以此定力就能打开智慧。</p><p>深层次的念佛定就是念佛三昧，以念佛定而发起智慧，从而明心见性。念咒也是这样，通过念咒来摄持心念，达到定心不动，从而降伏烦恼，生起智慧。拜佛时的速度也要慢，以此来摄心，心不乱攀缘，专注一念，专注一境。但不能把拜佛仅仅当作是锻炼身体，那样至诚心发不出来，就没有功德，也不可能得定。</p><p>专注力就是一种定，把全部注意力集中在一个事物一个问题上，就是心定不散乱。但是这种定里面，有语言文字声音，有心里分析思惟活动。看话头需要的禅定是没有语言文字声音，没有分析思惟，只有一个念头久久悬在心中，能把话头看住，这种定比较就深沉一些，并且不太影响日常工作，很容易达到未到地定和初禅定，对世俗法的执著就能减少减轻。这种定久了深了以后就可以参话头，参究一句话的义理，里面有参究的心思活动，需要的定更深一些，心思才会更细密，才能出生智慧。</p><p>在行住坐卧当中都可以修定，保持心住在一个境界上不动，叫作心一境性，这时心无旁骛。眼见色时，心不动，心里仍然念咒念佛，背诵经文或者观想，专注于所修持的善法上。念佛念咒的功夫深了，心念可以连成一片，绵绵密密，外境不入心，看到就像没有看到一样，听到就像没有听到一样，心念专注于一点，就可以达到视而不见、听而不闻、食不知味，心思不在财色名食睡五欲六尘上。若是看话头、参话头、参禅功夫能达到这种程度，时节因缘具足，就能打破疑情而破参。</p><p>这种看话头参话头的定纯熟了以后，在今后思惟任何法理时都能用得上。比如佛开示的一句话，或者佛法上的一个道理心里不明了时，就把这句话或者这个道理深深地悬在脑海里，不特意分析它，就那样深深地悬着，到一定时候，就能突然醒悟，明了这句话的含义。定力越深，智慧开发的就越深。用参话头这种定可以修到初禅定，还可以接续深入修。</p><p>二、定中意识的觉知性</p><p>所谓的定，是由六识的乱动到有规律的动，到有系统性的动，再到深细的动，最后是不动；由快动到慢动，到微细的动，再到不动。比如孙悟空让妖精定住时，口中喊：定，妖精就不动了。真正的定，深层次的定，就是不动。</p><p>欲界定和初禅定里，意识的觉知性都很强，能专心思惟佛法；二禅以上的定里，五识灭去了，意识心比较深细，单独了别定境的觉知性比较微弱，内心里有深细的喜心，其反观力比较差，不大能了别自己的心行，出了定才知道自己刚才的状态。意识的觉知性如果非常深细，了别性就弱，几乎不能思惟和观行佛法。但是意识还存在着知性没有灭。</p><p>二禅以上定中，一般人不能思惟佛法，不能参禅，极其有训练的人，也许可以。二禅以上定中，普通人的意识肯定发现不了意根的存在，不能发现意根的觉性，有道种智的菩萨也许能发现意根运行的行相。特殊人在二禅里，意识可以深细思惟，只是太深细了。</p><p>在各种定中，意根第七识也有觉性，有了别性，只是意识很难发现，这时意识有见分、相分、自证分和证自证分，四分都有。没有定时，意识思惟是粗燥的，杂乱无章的，浮浅的，没有头绪的；有定时，意识思惟就统一、细密、深入而专一了，因此就能促发智慧的出生，发现事物的本质。</p><p>三、所谓的禅定，即是对意根的降伏程度，意根得到有效的降伏，少攀缘或不攀缘禅定才能出现。从智慧入手，也能修出禅定，心里懂得周遭的六尘虚妄，自我的见闻觉知虚妄，思想念头虚妄，感受虚妄，懂得一切法都虚妄，内心的攀缘就少了。内心的攀缘少，心念也会少了，就能集中精力思惟佛法，然后就容易证得佛法，这是以正念进入禅定的方法。正念就是对佛法的正确认知，知道五蕴是虚妄的空的，知道有自性清净心在五蕴身中永远不生灭的运作着，时节因缘具足，就能证得自性清净心。</p><p>四、定与静的区别</p><p>定包括静，静是定的最初阶段，是定的最初的表现形式。首先是身静不动，再次是心念沉静下来，心静不动。在往后发展，定就会深了，不仅仅是身心的静，而是有些法就要从心里消失了，心念更加的专注统一，甚至心念也消失不见了。二禅定以上，五识消失不见了，四禅定以上呼吸脉搏心跳停止不见了，定越深出现的法越少。法多法少由意根决定，定的深浅在于是否降伏了意根，在于意根攀缘的法多少的问题。</p><p><strong>第二节  禅定的种类</strong></p><p>一、定分为四禅八定，从初禅开始算起，到第四禅是色界定，色界定之后是无色界定，也包括四种：空无边处定、识无边处定、无所有处定和非想非非想定。再往上还有第九地定，是俱解脱大阿罗汉证得的灭尽定，未到初禅的定是欲界的未到地定。</p><p>未到地定，是心一境性，意识专注一境一念，心不散乱，杂念少而轻微，身体轻盈，心少忧虑烦恼。在这种定力作用下，可以看话头参话头，观行佛法，可以达理。欲界有六层天，最高层天是他化自在天，欲界天人的色身比世间人的色身高大无数倍，轻灵而美妙；世间人修定，有了初步的定境时，就是欲界定，身心就与欲界天人相应，就是在人的色身上也同时现起欲界天人的高大色身，两个身体触到一起，内心的感受相当的舒适愉悦，身体感受是轻灵舒适的。定境越深，身体感觉就越是高大轻灵，心里越是安详轻松愉快，烦恼妄念减轻，烦躁消失，思惟敏捷。</p><p>当修到欲界最高定，定福也要增加，如果没有修到色界初禅，定福绝对不能超过魔王波旬，还是要受魔王的操控。魔王波旬生活在他化自在天，他在欲界中的福报是最大的，欲界就由他来掌控。在这个定境中，也不离贪欲，只能伏烦恼而不能断烦恼，因为定力尚浅，断烦恼是要靠初禅定力来断的。没有初禅定，烦恼是压伏着，不能真正的断烦恼，烦恼仍然眠藏在第八识中，自己不容易发现，还以为自己真的没有了烦恼。</p><p>到了初禅，初禅天人的色身比欲界天人的色身更加的高大，更加的轻灵，体表仅有薄薄的一层皮，内里感觉没有五脏六腑，不用饮食吃喝，单靠禅定维持色身。修到初禅定时，体内胸腔的感受非常舒服，身体的感受更加美妙，欲界的人类根本不能与之相比；因为这种胜妙的快乐超过了人中之乐，所以对人中之乐不再感兴趣。有了这种乐就能断除人的贪欲心，不再希求人间的种种欲望。因为快乐，也就不再记恨于人，嗔恨于人，嗔心就能断除。</p><p>在初禅定中，心住一境，住在一个境界上心不散乱，内心喜悦，舒适无比。可以像常人那样的行住坐卧，也可以做一切事情，只是速度比较慢，此时内心非常平缓，波澜不起，几乎不想动。但最大的好处是：在初禅定中思惟，能使思惟的速度缓慢，在思惟的过程中心思十分细密，这样思惟就比平常深入的多，能开大智慧。所以应该多多修习能够开智慧的定，这样的定才是正定，因为智慧能够成就一切，智慧能得解脱，智慧能成就佛道。</p><p>最浅的定就是欲界定，欲界定是指相应于欲界天的定，有定之时色身和心里的觉受类似于天人，那时把人间的事情暂时淡忘而离开了，心念集中，欲界定就出现。相应欲界第六层天的定也叫作未到地定，是一种未到初禅的定，定境比下层的定要深一些，心念更专一，身体更高大，感受更舒适一些。在这个定中思惟佛法，心不容易散乱，思惟细密透彻，从而就能获得智慧。</p><p>要想修好禅定，就要放舍自己对世俗法的贪着心，欲望越少越好，对人间的事不要有什么过多的希求，善于知足是最好的心态。当你的心念不再与下界众生相应，上界的定就会出现，让自己的心总是向上，或者心中无物，无有喜乐，各种层次的禅定就会陆续出现。这是修定的秘诀，不是死死地把身体定住不动，在身体上下功夫，而是在心地上下功夫。一颗追求五欲的心，燥动不安，肯定是与定背道而驰，禅定是不会出现的。善修心者就有定，同时要守持戒律，有戒律来摄心，这样心就不易向外贪求不断，心才能定住。</p><p>二、定的种类很多，其境界也很多，有些时候是思惟佛法中出现禅定，有些时候是在对佛法有强烈感触的时候出现禅定，有些时候是在心很静的情况下出现禅定，有些时候是在不经意间就出现定，有的时候是在极端生气恼火的时候出现定，有的时候是在很痛苦的时候出现定。总之，只要全部心思集中，认为这件事特别重要，顾不了其他的事情，旁无他顾时，就能出现禅定。</p><p>三、觉观与寻伺</p><p>初禅以前的心属于有觉有观，初禅与二禅之间的心属于有觉无观，二禅以上的心属于无觉无观。观比觉心思要粗糙，是主动性的，动得要明显一些；而觉是被动的成分多，在快进入二禅的时候，心已经不再主动的观了，而是被动的觉知，然后不能再觉知，就进入二禅。因此禅定中一定是观先灭，觉后灭。静下心来，观一观，就知道了。而这个观，是有思惟的，比较粗糙。觉就是知，只要有识心存在，就有知，但不一定能观。当心累时，识心微弱时，就不能再观了，但是可以有觉知。</p><p>寻，心行很粗，动得明显，识心是主动去找，想去探究和发现。伺，心行很细，动得轻微，不容易发现，有被动等待的意思，不再主动出击。观，类似观察，心思动得明显，自己容易观察到。觉，有心就能觉，觉知可以非常细微，很多时候，自己都不知道自己在觉知。观类似于寻，觉类似于伺，初禅以后的觉，比伺还微细，还被动。</p><p>定力足够时，深入禅定，自己观察思惟一切法，验证一切法，不要依着既定的习惯的说法，现成的答案不一定正确，除了佛亲口所说，即使正确也要做自己的现量观察，才能增长智慧。佛法是否能学得好，与每个人的心思是否细密有关，也与世俗法中的文字功底有关，对于理论当中的字词语义的准确而深刻的把握，才能有正确如理的思惟，不至于误会文字之义。</p><p>入定时，或者有过很深的定，就能体会到，什么状态是观，什么状态是觉。对字词的内涵把握，属于我们的文字修养，这个功底一定要训练好。以后读文章读佛经，就能深刻领会文字语言的内涵，也就能正确理解佛经原意，不至于误会佛意。很多人读佛经不能真正理解和领悟，错会的情况非常多，往往就以自己错会的意思，来判断别人，说别人错会，却不检讨自己是否错会。</p><p><strong>第三节 止观就是定慧</strong></p><p>止就是定，观就是慧，修行就是要止观双运，定慧等持。止就是把心摄持在一个境界上，缘于一法而不动摇；观就是对所缘的一法观行、思惟、参究、思考。止观是连在一起相通的，没有止，就不能观；没有观行，智慧就生不起来，观的同时也能生定，也能得止，二者是相辅相成的。没有慧，不能定；没有定，不能生起智慧。</p><p>有智慧的时候，对法就有抉择性，就能放弃不必要的世俗法，排除其它暂时没有用的杂事干扰，选择最重要的事情来做。抉择好了，心就能止于一处。慧就是意识通过深细的思惟而能明了道理，在深细思惟的过程中再反熏意根、说服意根的结果。</p><p>无论是止还是观，都涉及到七个识的修行，让七个识专注在一境上，然后意识心仅分别一个对象，精力集中，心无旁骛，就能把问题思惟透彻，就能明了其中隐藏的道理，从而获得佛法智慧。观慧生定，就是意识明理以后再来熏染意根，说服意根不执著世俗法，避免意识散乱的结果。</p><p>无论是止还是观，都是在七个识上用功，让七识专注在一境，让意识心只分别一个对象，精力集中，思惟就能通透，从而能明了其中的真正内涵，获得真正的智慧。虽然第七识不能只缘一境，但是祂毕竟能够减少攀缘，少于作意与思量，也能渐趋于定，这样意识才有定，才能得止，否则意根处处攀缘，意识无论如何也不能止于一处。</p><p>定是开悟的基础和前提条件，菩萨六度和菩萨三无漏学中，定是其中之一，可见修定的重要性。没有定力，无法观行，定力浅，观行不能深入，也不能细致，智慧无法开发出来。如果能修出欲界的最高定——未到地定，观行就能得力了，它是色界初禅前的一种定，有了这个定，参禅或者参究一个法义，或者观行五阴的虚妄，心才能专一，思惟既深刻又很细腻，这样才能把法理思惟通透，才有破参开悟的可能。因为修行的结果和目的就是要开发智慧，有智慧才能出离生死轮回，才能得解脱，有智慧才能成就佛道。悟道开智慧，要比各种定境更珍贵，更重要，如果只有定力而没有解脱的智慧，最多只能升天享福，福尽仍然要下三恶道受苦。所以必须定慧等持，不可偏修。</p><p>止观双运，定慧等修，学佛必有所成。有慧无定者为狂慧，狂慧者未必有德，其见解未必真实可靠，烦恼毕竟不能得到降伏，因此说未必有德。有定无慧者守愚，愚顽不通者无道。有定有慧者，必证解脱，得真实法益，是佛法中的大丈夫。</p><p><strong>第四节  三昧与正受</strong></p><p>一、什么是三昧</p><p>三昧，是印度语，是定的意思。三昧里有禅定的境界，也有不同程度的智慧境界。如果智慧不深，三昧就以定境为主，如果智慧很深，就是定慧等持的境界。</p><p>各种念佛三昧的层次不同，以定为主的念佛三昧，是口念佛号而入定的，行走坐卧都能念着佛号，最后不念而念，佛号声不断萦绕于心，萦绕于耳边，不想听也能听得见，连续不断。</p><p>定慧等持的念佛三昧，证得了无生忍和无生法忍。比如观像念佛和观想念佛，从口念佛和心念佛开始，最后独影境现前，定果色出现，证得无生理，明了了自性佛。</p><p>白骨观不净观修成以后，也是三昧境界，定慧等持。定是一心境界，在初禅以上；慧是证得无生，知色身不净，五阴无我，果位是三果四果，也是小乘的空三昧，独影境现前，定果色出现。 四念处观修成也是小乘的空三昧，定慧等持，成就三、四果。大乘三昧一个是念佛三昧的成就，一个是观无量寿经的十六观，都是定慧等持。没有定，也不成就慧观。</p><p>这些三昧里，往往都是定多于慧。大乘的参禅，最后破参时也是三昧境界，有定有慧。如果定浅，慧就浅，只成就七、八住位；定深慧就深，能到初地二地位。心住于如来藏的空性中，五阴自身都是空性如来藏，行走坐卧犹如处于如来藏中，无五阴我。</p><p>小乘的观行参究断我见时，也是三昧现前，有定有慧，定浅慧就浅，只成就一、二果，定深慧就深，能成就三、四果。证果以后，心处于五阴无我的空三昧中，没有五阴我的觉受，处缘对境，心不起我相，不与任何人事为仇为对，不在意自己周遭的一切，因为心里无我。</p><p>如果是意识的理解佛法，或者是解悟佛法，一点三昧也没有，没有定境，没有空的觉受，心中仍然有我，我心不死，遇缘对境必须依靠意识的作意才能想起来五阴是无我的，一旦意识失去觉照，我心就突然冒出来，身口意行没有把持。而意识的觉照作用非常有限，断续的非常严重和明显，总是会失去觉照，保持不住，即使意识的力量很强大，能保持住一段时间，也早晚都会失去觉照，尤其是命终。</p><p>二、所有的三昧，不管是以定境为主的，还是定慧等持的，都是意根成就的结果。只有把意根定住，不散乱不到处攀缘，才有定境，意根才有足够的精力思量意识带过来的法，才能明了法的根本意义和实质内涵，三昧必出现，这才叫作证得。</p><p>观无量寿经的日观也好，白骨观也好，以及其它各种观行都好，到最后成就的时候，不用意识作意，睁眼闭眼那个景象就会现前，当然意识作意了，那个景象会更明显。 所谓的成就就是自然而然出现的，那个叫作三昧。如果不能自然而然出现，必须意识作意才能出现的，那个都不算成就，不是三昧。</p><p>所谓的三昧就是很深的定境，但不排除同时含有智慧境界，智慧和禅定的有机结合叫作三昧，缺少一种都不是三昧。这种三昧当中已经有比较深的禅定了，一定是把意根也训练成熟了，意根训练成熟了以后，能时时刻刻运作，心里时时刻刻就能显现出这种景象了。</p><p>如果你定力没有修成就，三昧就没有修成就，意根没有被熏习成功，只是意识比较熟练罢了。意识熟练再作意，就带动了意根，意根才能作意，之后就显现境界。那么这种境界就不是熟练的，是断续的，这种定力就不足，那么就不能叫作三昧了。</p><p>三、三昧和正受，是定慧等持的身心境界。当一个人遇到一个法义，起心深深思惟参究之后，突然内心与法义相应，深深的明了法义的内涵，证得了法义所指的深层之义时，智慧涌发，内心感到无比的喜悦，无以言表。之后身心轻安舒适，行住坐卧如处虚空，如入无人之境，内心空旷，广博而宁静，思想深邃，头脑敏捷。气脉涌上胸腔和肩膀，后背挺拔，胸腔开阔，双肩下沉，身轻如燕。内心空空如也，与空相应，与无我相应，与无四相相应；所见一切，都觉虚幻不实，思惟深沉专一，细密而清晰。心中乐感不断，祥和安宁，不再有繁杂的妄想和浮念；没有过去，没有将来，当下也不实在，三际脱空，空也不存。心胸宽阔而慈祥，宽容大度，不争人非，不计善恶，不着色声香味触法，五欲面前犹如行尸走肉，八风吹不动，犹坐珍宝山。</p><p>定慧齐资，不偏不倚，二者缺一，即不是三昧，二者有偏，就不是正受。定慧等持，是真三昧，也是真正受。</p><p>四、所有的三昧，都是定境和智慧的结合，缺少一种都不是真正意义上的三昧。但是有的定境里没有智慧，只能叫作定境；有的定境里有智慧，含藏着智慧，就叫作三昧。定境的范围内涵比较浅和窄，三昧的内涵比较深比较广，所以三昧一定包括定境，没有定境就不叫作三昧，没有智慧也不叫作三昧。各种层次的果证都是三昧，因此三昧必须包括禅定和智慧。</p><p>五、佛家三昧分两种，一种是只有定境，通于世俗外道定；一种是不仅有定境，还有智慧境界。有智慧境界的不通于世俗外道禅定。</p><p>第一种定境三昧有三种，叫作三三昧，包括三种：有觉有观三昧（初禅以下），有觉无观三昧（初禅二禅之间），无觉无观三昧（二禅以上）。</p><p>三三昧，只是摄心，与智慧无关。有观想观行的三昧，能出生智慧，是真正的三昧，包括大小乘的观行智慧。比如观像念佛，成就三昧时，可明心见性；念佛三昧成就的时候，可明心见性；观行五蕴三昧成就的时候，可得法眼净；白骨观三昧成就的时候，能断我见，证得初果到四果；四念处观三昧成就的时候，可证得初果到四果；观经第七观成就的时候，可明心开悟；般舟三昧成就的三昧，十方诸佛面前立，智慧境界是明心开悟。般舟三昧，九十天念佛，不坐不卧，只能走和站立，不能睡觉。到九十天成就念佛三昧时，十方诸佛面前立，就见到佛——如来了，此为开悟境界。</p><p>六、念佛三昧成就的时候，十方诸佛在面前立，眼识所见了了分明，他人却见不得，这是什么境界？白骨观修成之后，见一切人白骨连连，十分分明，他人却不可见，这是什么境界？观无量寿经里，第一观日观成就以后，开眼闭眼，落日如悬鼓显现面前和心中，他人不可见，这是什么境界？十六观每个观成就之后，都有相应境界出现，眼识看见，他人却不可见，这是什么境界？眼冒金星，星星点点在眼前飞舞，他人却不可见，这是什么境界？海市蜃楼，大家都可见，是什么色？比如眼冒金星，眼睛能否看见金色的星星黑色的星星？白骨观的白色的骨头，落日红彤彤的色彩等等，这是怎么回事？眼识见色彩，赤橙黄绿青蓝紫黑白。有眼识参与所见的不能是独影境，但是任何一种禅定中所见的色，都是独头意识见，没有眼识。回忆当中显现出来的色彩，梦里所见的色彩都是独头意识所见，不是眼识所见，这里没有眼识。</p><p>七、真正的三昧是定慧等持，有定有慧，是实证后的境界。修行的方法不同，层次不同，禅定的深浅不同，观行的智慧不同，成就的三昧就不同。凡是需要观行智慧的禅定，都要有未到地定或者是初禅定，在初禅定中观行效果最好，没有初禅定，未到地定越具足越好，越接近初禅定越好。没有未到地定就无法观行，心非常粗糙和肤浅，观察不出什么法，未到地定不足，观行也不得力。</p><p>二禅以上的定中，意识没有念头不能观行思惟，必须从禅定中出来，才能依靠意识观行思惟，禅定越高，出定后的定力也越好，观行思惟越细密深透。除非意识把观行的法已经传递给意根了，意根想弄清楚，在二禅以上的禅定中，意根就可以单独思量参究，没有干扰。诸佛都是在四禅定中悟道，可能就是意根独立悟道，意识的作用不大。</p><p>具足禅定，学会观行，很多人修行自己就可以有下手处，可以证得任何一种法。这是非常重要的修行方法和路线，也是现代学佛人难以突破的瓶颈。意识理解佛法以后，能深深的观行求证，法义在意根那里，能保证意根思量法义和疑点，思量通达以后才能非常确认，才会不疑法，那个心境是非常轻松愉悦的，解脱就是那样子。</p><p>八、如何成就三昧</p><p>所谓的三昧就是定与慧完美结合到一起的境界。《坐禅三昧经》里介绍了几种三昧的修行方</p><p>法，其中有观像念佛成就念佛三昧的方法，在修习观像念佛时，身心端正，专心一意，不缘他法，一心观想面前的佛像。在观像时禅定具足，戒律具足，观慧具足，戒定慧都具足，最后成就观像念佛三昧，定慧等持。其它几种三昧的修持都是戒定慧具足才成就的，戒不具足，心思散乱，内心躁动，定就不具足，定不具足就不能生起观慧，观慧不足就不能出生三昧。</p><p>楞严经中介绍了二十五位圣人所修的种种三昧境界，都是戒定慧具足，在甚深禅定中，深细思惟参究，成就甚深三昧，获得广大智慧。获得三昧境界，离不开甚深禅定，离不开六七识的观行智慧，意根在其中所起作用远远大于意识，所以证得甚深三昧时，就有大神通现前。</p><p>华严经中善财童子五十三参，参访的每一个老师都教他一种修习三昧的方法，他就在定中一一深细观修，每成就一种三昧，智慧就得到增长，上一个台阶，最后智慧达到等觉菩萨。所以戒定慧是前行方便，定是中间纽带，观慧是桥梁，三昧是道果。五十三个老师教导善财童子五十三种法，善财童子都精进修习，道业突飞猛进，超越其他菩萨两三个无量劫的修行时间，他的修行真正是神速。为什么这么快速？愿力弘深，尊师重道，禅定甚深，智慧深利，无比精进，所以能成就一切三昧。</p><p><strong>第五节  禅定境界</strong></p><p>一、在初禅里时间和空间观念都有，知道是什么时候，在哪里。在二禅里感觉不到有念头，无觉无知，出定才知道自己入定了。有人说四禅里还有念头，我头一次听说。二禅里，意根是有念，只是意识不知道。因为那时候入定很深一无所知，可是有人小声说一句过斋了，当时就听见了，于是心就出定。为什么听到那么小的声音，能出定呢？就是因为意根在惦念着吃饭这件事，听到小声音，就让意识出生了别，于是就会出定。</p><p>二禅里意识没有灭，但是非常微细，我是觉察不到什么，不知道自己入定了，好像是什么也不知道。在二禅里如果意根不惦记着吃饭，有人说过斋了，就不会出定。因为我在入定时，周围几十个人都在互相谈话，没有静下来过，可是我却听不见，只听见过斋这句话。</p><p>我没有进入过四禅，无法知道四禅里意识心的状态，没有实证就没有发言权。三禅可能进去过一天，太快乐了，因为怕入魔，就舍弃了。在二禅里意识就没有反观力了，也不知道当时意识是什么状态。</p><p>二、二禅定可以一瞬间就能入进去，然后就什么也不知道了，出定也是一瞬间，出定后才知道自己刚才入定了，感觉身体非常舒适，心情特别愉悦，头脑特别清晰。一个微弱的声音，足以唤醒耳识，于是出定了。因为意根还有惦念的事情，所以时间到了，重要的事情有人一提醒，哪管是蚊子声，也能听到，于是就出定。入定前，在非常嘈杂的声音中，心很快的就能沉静下来，嘈杂声音越来越微弱，然后就听不到了，人就入定。</p><p>三、在未到地定就可以升起轻安状态，三摩地是在初禅以上的定中出现的定境。未到地定有轻安状态，只是与初禅定的轻安差别很大，初禅简直就像神仙的感觉一样了。未到地定的轻安稍微差一些，身体有可能出现高大、庞大、轻微、轻飘的现象，走路轻快，身体上扬，浑身轻松，走路无声，内心安定。每个人在同样的禅定里，身心的状态也不完全一样，同样的一个人在不同时间里，表现也有一些小小的差别。欲界定的状态也有好多种，定的深浅都不一样。同样是初禅定，每个人的身心感受和状态，也不完全相同，一个人在不同时间，入同样的定，其身心状态和感受也不完全相同。</p><p>同样一个轻安的词语，其界定的界限也是不同的，其表现的程度，还是不同，无法严格确定轻安的临界点在哪里，每个人的定义可能都有差别。如果有人心不太平，一定要辩论，那就只有各执一词了。三摩地，严格地说，应该在初禅以上的定里，这是正式的禅定，是四禅八定的初始。</p><p>四、初禅以上的境界</p><p>初禅以上的境界，色界初禅以上的天人都没有欲界众生的贪欲，没有性别，不分男女；没有鼻识，没有舌识，他们不嗅香味，没有饮食，不用吃喝拉撒；二禅以上的天人在定中没有五识，不分别五尘境界。无色界的天人没有色身，没有前五识，只有意识、意根和第八识。无想天的天人，意识心也灭掉，没有意识就没有想心所，只有意根和第八识。俱解脱的阿罗汉入灭尽定时，没有意识心，意根的五遍行心所法也灭掉两个，受和想灭掉，也叫作灭受想定，但是意根还有三个心所法，第八识还在持身，所以灭尽定中的阿罗汉是活人，第八识一离开就是死人。</p><p>第六节  世间定与出世间定 </p><p>一、禅定是所有众生共同所修证的内容，是所有外道与学佛人共通的定，在特征上没有什么差别，但在功用上却有很大差别。</p><p>其差别在于在外道定里，对五蕴没有思惟、没有观行、没有观修、没有参究等等思想活动，因此没有无我智慧的出生，不能得解脱。而佛门里如理的定，一定要有思惟观行参究活动，依此能出生相应的解脱智慧。如果学佛人修的定一直都是在定中，没有思惟观行活动，就属于外道定。</p><p>一般来说，学佛人修行的定大多数都与外道定相通，只有到后期在定中起思惟观修活动时，才属于不共于外道的定。所以每个学佛人不必排斥外道定，以及任何禅定，只要最后能利用各种定出生正确的解脱智慧就行，这才是修定的根本目的。</p><p>二、外道不持杀生戒的定与佛门的定有什么区别 </p><p>定有定福，不持杀生戒的定里，定福少。但是随着定力的加深，身口意造作的越来越少，以至于不再造作身口意行，那么这些外道定都是持戒的定，不持而持，自然有戒。这样的戒要比学佛人持的五戒八关斋戒还要清净，甚至比大多数人的菩萨戒还要清净。 因为有这样深的不犯任何戒的禅定，外道们在听佛说法的当下，瞬间思惟，立即证得四果阿罗汉，不必经过初果二果三果，学佛人能比得上吗？</p><p>外道定虽然不能断除我见，断除烦恼，但是外道定能降伏自我降伏烦恼，与五阴我藕断丝连，与烦恼藕断丝连，最后佛陀开示佛法，外道们就深信佛陀，真正归一了佛陀，就会快速证果，我见和烦恼不再藕断丝连，而是彻底断除。 学佛人修的浅定，如果不能降伏自我，不能降伏烦恼，还没有藕断丝连，那离断烦恼，还有很长的路要走。</p><p>三、世间定与出世间定的区别</p><p>世间定是指四禅八定，是五阴身心所入的定，是在意识觉知心上修的定，都是有出有入的定，因此是生灭的、无常的，需要时时刻刻保持，一旦保持不好，定力就消失不见。单纯的只有这八种定之所以不能使得众生得到解脱，是因为这些定只能调伏意识心，不能断我见，不能断生死结缚。众生要想解脱，首先需要断除五阴是我的知见，然后修出初禅，断贪爱，断烦恼，最后对三界的贪爱都断尽无余，再也不贪不爱不心喜了，才能得解脱。在四禅八定里，还有对禅定的贪爱，还执著五阴当中的某部分为我，执著禅定中的意识觉知心为我，所以不能得解脱。</p><p>有的众生在从前可能修过四禅八定，但是这种定，并不能使众生脱离生死轮回得解脱，因此当定力消失的时候，又会下堕，回到人间或者是三恶道。那么怎么样才能脱离生死得解脱呢？只有断我见，证解脱果，才能出离生死，得到解脱，别无他路。为什么众生要那么喜欢修定，把修定当作是唯一的修行方法呢？就是因为众生都以为禅定能够让自己得解脱，不相信灭掉各种意识觉知心的我，才能得涅槃，得解脱，出轮回。所以修学佛法，获得正知见，最为重要，以佛法的正理来指导修行，如法修行，才能得到成功。</p><p>出世间定，是指第八识如来藏的不出不入的楞严大定，也叫作楞伽大定，因为只有如来藏不在三界世间里，其余的法都在世间里，不离意根和意识心，如来藏常在定中，永远不出不入，不生不灭，常恒自在。如来藏常住大定中，从来不出定，也没有入定时，祂不攀缘一切法，对于六尘，祂从不起心念和心行，从不散乱，从不掉举，从不昏沉，从不入睡，方便说祂在定中，所以如来藏没有定与不定之说。如来藏也是本不动摇的，对一切法都无见无闻，因此从来不动心念。祂的运作，是完全随顺众生的业力、习气、因缘，虽然随顺也不动念想，因此也叫作首楞严大定。</p><p>楞严经中讲楞严大定，整部经都在讲如来藏，这就是我们的真心，祂常在定中，从不出定也不入定，没有出入，这才是真正的不生不灭的禅定境界，非常坚固，因此也叫作楞严大定。为什么如来藏不出定不入定，常在定中？因为祂无眼，不见色，色来时，祂不分别，不起心动念，从不乱心，对于其它五尘，也是不分别，不动念，心不散乱。祂永远不与六尘相对，永远不生心动念，永远不随境界而动，这就是楞严大定。六祖说：那伽常在定，无有不定时，就是这个意思。</p><p>如果有人说楞严大定不是指这个心体之定，他的意思就是指四禅八定了。但是四禅八定是有出有入的定，不是常定，有生灭变化的定，就不是楞严大定。四禅八定如果要修，首先要修到欲界定，就是欲界六层天的定。欲界第六层天的定是未到地定，未到地定过去以后就是色界的初禅天的定，初禅以上的定才是真正的四禅八定。</p><p>欲界和色界天人的色身都比我们人高大无数倍，他们的心里觉受也是非常愉悦的。当我们修到这两个定时，天人的色身就在我们人的色身上同时现起，我们就会觉得身体无比高大，心里感受也是很舒适的。要达到这些定境，你就要对人间的人事物理都不太在意，没有什么希求，五欲要减少到很淡薄，才有可能修到那些定境。修到未到地定时，要降伏五盖，对欲界的东西都不喜欢，才能有初禅现前。然后再往上修，一直修足四禅八定。虽然如此，四禅八定仍然是有出有入的定，不是永远在定中，心还是有动摇的，仍然是意识心虚妄的妄法，不是真正的永远不动的定，因此就不是楞严大定。</p><p>四、什么是邪定？什么是正定？如何把邪定转换为正定？</p><p>邪定是不在解脱路上的定，是不能出生解脱智慧的定，是不能趣向于解脱的定，是共外道的定。在这种定里，识心沉闷或者昏沉，无所用心，不起思惟，不思教理。</p><p>正定当中最正的定，在定中心不颠倒，不思世间一切法，不思善也不思恶，不着一切法，却能有无上智慧随顺众生出生一切法，不被一切法所拘碍束缚，解脱于一切法。其次正的定，定中能深细思惟种种正理，不着世间一切相，不着善恶，能出生种种解脱的大智慧，能变化世界，成熟自他一切善根福德因缘，心向正道，心在正道。</p><p>当禅定修到一定程度，心清净下来，心力能够高度集中，思考有一定的深度时，定中就要起思惟，思考目前需要解决的佛法问题，思考目前需要弄懂的问题。并且出定之后，也要用心思惟佛法，朝斯暮斯，心心念念，都围绕着佛法，围绕着目前需要解决的佛法的问题。这样就能明了佛法，因缘条件具足时，有可能证得相应的法，开启智慧。</p><p>在比较深的正定中，意识思惟较少较轻微，没有情思意解，却有意根不易觉察的思量，意根要深思，用功多于意识，以意根的思量为主。这里有定有慧，定就是正定，邪定里没有这样的思量。自己要踏踏实实的做功夫，掌握思量的技巧，学会思量，一定有益处，百益无一害。</p><p>禅定中的昏沉有几种原因，把原因找出来，对治一下，就能解决昏沉问题。一个是气血不通，堵塞血管，供血不足就会昏沉。坐时可按摩穴位，疏通气血。一个是睡眠不足或者是身体疲劳。可调节呼吸，做几次深呼吸。一个是缺少意根感兴趣的所缘法，致使心沉闷。这时可以观想有趣图景，把心从沉闷中解脱出来。</p><p>没有禅定时，先不要观行佛法，定力不足时，也不要观行佛法，这样容易推理推论出一个结论一个答案，以后再无法真正用功参究，后续很难实证，道业就受大阻碍。没有禅定的思惟观行，于解脱无益，于道业无益，只增长知见和我慢，不能断除我见，没有功德受用。</p><p>五、神通是会消失的</p><p>外道修到四空定，修出了神足通，为什么还见色起心并且失去了神足通？淫欲心的断除是初禅定配合断我见的证量，二者结合才能成为三果人，才能做得到断除欲心。只有初禅定和四禅八定，或者只是断我见，都不能断除淫欲心。因此外道虽然有禅定和神通，仍然要见色起心，之后，禅定和神通全部消失。可见没有断我见的智慧，只有禅定，是不能断除淫欲的。</p><p>以前经文里记载过，有禅定有神通的人，因为见色起心，心念一起，神通和禅定就退失了，来时飞行，回去时走路。那是因为没有证初果的功德，只有禅定。断除淫欲，必须断我见证初果加初禅定，只有禅定不行。所以说初果的分证解脱功德受用还是很大的。  </p><p>提婆达多同样是没有断我见而修从出神通上天，因为动了偷天花的念头，神通立时消失，就从天上掉下来了。如果证初果以后，有初禅定，再有神通，就是三果，不会再动邪念头，不会再犯戒，也就不会失神通。</p></div>"
},{
    "title": "第三章 如何修好禅定",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  如何修好禅定</strong></p><p><strong>第一节  减少欲望才能修好禅定</strong></p><p>一、欲贪严重的，不仅不能有初禅定，也不能有欲界的未到地定，甚至不能有欲界的最粗浅的定，那就没有一丝禅定。要想有禅定，必须要降伏欲贪。贪，就是贪爱贪执，爱，是喜爱喜乐。对三界不再喜和乐，爱就断。爱断，三界的业即了；欲贪断，欲界的结就断。欲界结断就能出离欲界，这时色界的初禅定必出现，命终即可出生在色界天中。</p><p>因为凡是定，都是心与天人境界相应，不与人中的境界相应，心性高于人，境界就高于人。有欲界定的人，其心肯定是淡薄人中的欲念，有色界定的人，其心淡薄欲界人、鬼、畜生和欲界天人的境界，有无色界定的人，其心淡薄色界和欲界的境界。</p><p>有无禅定，全在于心念，心念一动，定即消失，心念就是这样厉害。抱怨自己禅定修不好的人，就要检查自己心中的念头是否清静，是否与人中的人事物理太贴近了，心心念念都是人中的事情。如果念头不清静，熬腿强行修定都没有用。</p><p>诗词歌赋，琴棋书画，各种艺术等等，都属于人中的东西，如果喜乐这些东西，贪爱这些东西，执著这些东西，都不会有禅定，不能出离欲界。我们只要把属于人中的东西找出来，心里远离这些东西，不贪爱不牵挂这些东西，在心里排除这些东西，禅定必然出现。这是修禅定的实质和根本。</p><p>辟支佛当国王，为什么稍微思索一下因缘法，就能证得辟支佛果，禅定神通立时出现，飞出宫殿，而出家修道？就是因为他的心中没有人中的事，不喜欢人中的事。虽然处于国王的位置，采女宫妃成群，他的心却是离欲的，不喜欢喧闹和娱乐，所以就能非常快的证得辟支佛果，这也是前世修道的根基。</p><p>二、不贪图安逸的生活才能有禅定</p><p>每天遇吃就吃，遇喝就喝，肠胃头脑内心，从来都不想休闲那么一小会儿，如何能有禅定？每天吃穿住用行那么讲究，那样的享受，心思都没有用在修道上，如何能有禅定？不是搞是非，就是搞名声、搞势力，搞金钱，挖空心思的钻营，如何能有禅定？心里乌七八糟、乱糟糟的一片，如何能有禅定？让受戒时，就躲个十万八千里，如何能有禅定？</p><p>现在的生活条件太好了，都习惯于享受，从来不觉得过分，因此身体的诸多变化都不知不晓，心里的散乱更是不知不晓，即使心念不清净也无觉无知，这样的话，如何能有禅定？前世修的那点福，都用来享受了，用在道业上的福不足，道业怎么能有进步？不付出一些代价，不付出一些辛苦，一边想享受生活，一边想得道，什么都想得，这么大的贪心，怎么能得道？</p><p>每天贪吃高营养大补的营养品，造成身体能量过剩，内心就会躁动不安，心不清净，即使有禅定也会消失。胃肠工作时，内脏工作时，意根一定要守护着，这样意根就不清净，得不到清闲，要分心分神，再怎样盘腿静坐，心都不能定下来，不盘腿时，更是定不下来。</p><p>修定最忌讳肠胃总是在工作消化饮食。有些人不但吃三餐，还有一顿夜宵，吃四顿饭，这哪叫修行人，能修出什么？根本不会有禅定，肠胃成天在工作，意根时时关注肠胃身根，清闲不下来，禅定肯定不会出现的。如果连一点点口福都不肯舍，就不可能得道，无舍就无得。除非不要禅定的解悟，可以不用忌口，想吃就吃，想喝就喝，要多享福就多享福。这个世间的人，没有几个像个修道人的样子，过去禅师祖师或者是修禅人的样貌，现在根本看不见了，世人连装都不肯装了，皮都不像祖师，肉也不像，骨头更不像，还想在佛法上有多大成就，就不可能了。</p><p>三、少于攀缘禅定才容易出现</p><p>如果心总是随各种境界动摇，随境界而转，那就不能止，没有止，就不能观。戒律是防非止恶，防止心散乱的，是用来降伏烦恼的。烦恼压伏下来以后，心不乱动，境界出现，心少于攀缘，修定才容易。内心注重吃穿住用，爱好愿望颇多，在意的人事物颇多，心乱如麻，那要如何止？减少兴趣爱好，减少心中所缘，心能稍微止下来。尽量对周围一切人事物不感兴趣，不在意，心少攀缘，心往内收，不向外散，定必出现。</p><p>在人中，兴趣爱好颇多，人中事样样都攀缘，时时处处想表现自己，内心里总有个我出现，心里不会得寂止。命终时就会发现，这辈子其实一无收获，徒劳无益。所以现在不如早日回头，多多开发内心宝藏，不要向外贪求把心搞乱。人生总有一得一失，自己要算计好，得什么才是最大的收益，后世才能有可靠的保障。</p><p>四、阿罗汉到命终时，意根不再对任何一法生起作意，也不会有思心所的运行，五遍行心所法都不现行，这样如来藏了别不到意根的心行，也就不能输送意根的识种子，意根就灭了。我们的意根如果对一切法都是作意不断，思量抉择不断，如来藏就会不断地出生六识，身口意就会不断地现行，心就寂止不下来。意根对感兴趣的法，才去作意，感兴趣的越多，作意的就越多，意识就会非常的忙碌，那就没办法寂静下来，定就修不成功。</p><p>我们要想修好禅定，就要减少对世俗法的欲望，对一切世俗法都不要感兴趣，尽量少于人间的享乐，有出离心的时候，禅定就能修得很快。如果对某些人事总是有觉观，有嗔恚心，有贪爱，就说明意根的攀缘不断，作意不断，思量不断，六识的念想就不断，那样禅定是不能修成功的。减少人间的欲望，欲界定就容易出现，少贪不贪人间的法，天上境界就现前。总觉得人间什么都好，总喜欢人间的人事物理，心就不会有定。减少贪心和欲望，不要太顾及自己，心念不要总围绕着自己，尽量舍弃自己，心里装着道业，禅定就容易出现。</p><p>五、修禅定也是修心，降伏贪嗔痴烦恼就是修心，修心就是修定，心里清静下来，禅定就出现了。修不好禅定的人，肯定是心里的俗事多摆不开，六识就不断地起念想，不能定于一处。所以要想修好禅定，应该经常检查自己的内心，看看里面都有些什么，尽量把放不下的人事物都排除出去，那样六识就会寂静下来，就有定了。</p><p>我们每天无论做什么，心中都要缘于一法，别无他念，或者其他的念要淡一些，处理完就丢掉。世俗事只是应付应付就可以了，不要太较真。修定时，只要我们能收摄心念，少攀缘世俗法，动中定肯定会修好的。心对于世间法要尽量隔离开，事情可以做，做过就丢，心里不要攀缘，少惦念一些事情，这样定就会容易出现。应该努力作到，每天除了睡觉，无论什么时候做什么事，心里都要缘于一法，或者念佛，或者念咒，或者背经，或者观行，或者参禅，或者参话头，或者参公案。时间长了，身心自然就会出现舒适的觉受，禅定就出现了。</p><p>六、欲界众生最贪的是什么？欲界里有五欲乐，色声香味触。一切法上都有法尘，有色法尘，还有心法尘。心法尘就是七识心，还有七个识的心所法。</p><p>众生最难舍的是识心和心所法，主要是受心所法和想心所法，总想了知，总在意感受，意根就不想寂静。不想灭除这些觉受和了知性，心就散乱如麻，因此修定才非常困难。</p><p>众生对自我和一切法的贪爱，实际上是贪爱阿赖耶识，因为这些法都是阿赖耶识的功能作用。可是尽管贪爱，都不知道自己贪爱的实质是什么。 欲界众生有了权利就不肯舍，有了地位不肯舍，有了金钱也不肯舍，自身各种享受无论如何都不肯舍，太贪了。不知道做佛有多殊胜，多值得贪，却都没有想做佛的心，这就是深重的无明。</p><p>七、如果心里不杂思乱想，就去除了散乱心，没有散乱心，禅定自然现前。杂思乱想是意根攀缘的习气，很难克服，必须想办法降伏意根的攀缘习气。如何能有效降伏意根的习气呢？抓住意根的特点，祂最怕闲下来无事做，那就给祂找一个有意义的事情做，让祂主要做这件事，告诉祂这件事非常重要，祂一旦认为很重要了，一定能把精力放在这件事情上。</p><p>什么样的事情最有意义？让祂念咒念经念佛，一开始规定数量和时间，祂一旦形成了习惯，就不用再规定数量和时间了，祂就能自动自觉的念咒念经念佛，睡觉也能保持这种状态，定力就修成了。意根的精力太充沛了，想办法吸引祂的注意力，让祂把精力集中，意识就能专心致志，意根也能专心思量佛法。这就在于意识如何引导意根，如何牵引意根。平时不管干什么，心里都要念楞严咒，不求数量只要能专注就好，这样加持力很大。</p><p>尽量挤时间修定，定力好一些，就思惟五蕴十八界，从色身无常无我开始观行。在五阴活动的当下，分开色身是什么，受阴是什么，都有几个识的受，想阴是什么，都有几个识的想，行阴是什么，都有几个识的行。六根是什么，六尘有哪些，六识在干什么，然后观察这些法的生灭变异的情况。</p><p>八、多培养专注力就能有禅定</p><p>禅定无非是一种专注力，集中精力做好目前应该做的事，心无他想，这样才能把事情做好。首先要对自己所做的事，有一种高度的责任心，有一种浓厚的兴趣，然后才能一门心思钻进去，把问题解决。越专注，解决得越好，越能发现深刻而重大的事理，智慧越高深。</p><p>比如科研人员、研究人员、科学家，他们对自己研究非常有责任感，非常喜欢，有浓厚的探索兴趣，因此就孜孜不倦、日以继夜的钻研，废寝忘食，旁无他顾，最后就能研究出一定的成果，有惊人的发现。</p><p>心还散乱的人，白天行走坐卧心里坚持诵咒，或者背诵心经。空闲时间打坐，心才能静下来，以后才能观行思惟佛法。打坐中能思惟佛法之后，在白天行走坐卧当中，再训练自己思惟简单的佛法。初步训练自己，当前正在做的事情，心里应该清清楚楚的知道，不得无记、散乱、攀缘，心住于目前正做的事情上，是粗浅的专注。</p><p>九、如何以智慧引生禅定</p><p>修定也需要一些善巧方法，不是强行熬腿就能坐得下去修好禅定的，对一切法攀缘不断，内心觉观思惟不断，心不寂静，就坐不下去，禅定不会出现。如何让心寂静出现禅定呢？要减少意根的攀缘，减少觉观思惟，心就会渐趋清净，禅定才会出现。</p><p>《坐禅三昧经》里讲过好多修定的方法，在修定之前首先通过智慧来认知一切法的虚妄，以破除攀缘心，攀缘减少了，禅定就会出现。比如说如果有人有眷属欲，就用一种方法来破除眷属想，心里没有什么想法，就会寂静下来，心就能定住了；如果有人眷恋国土家园，就要破除国土想，心中不再想家园国土，禅定就出现了；如果有人心里有贪爱，就要想办法降伏贪爱，心无贪爱就会寂静下来，禅定就出现了；如果有人心里有嗔恚，就要想办法降伏嗔恚，心不嗔恚寂静下来，禅定就出现了。在盘腿之前，首先找出自己心里有什么烦恼，有什么念头盘踞在心中，然后找个相应的方法来对治，把自己说服了以后，烦恼和念头不再出现，修定就容易了。这样靠智慧把攀缘心灭除，心就静下来就入定。</p><p>当心被降伏下来禅定出现以后，就要在禅定中思惟观行，对治烦恼，获得三昧以后就能灭除烦恼。嗔恚重的人就修慈心观，慈心观如何修，坐禅三昧经里有具体方法；如果是贪心重就修白骨观，把人观成白骨就没有贪心了。有眷属欲就思惟观行眷属的生灭、虚妄、不可靠性等等；内心总是眷恋国土，有国土想就思惟观行国土里的灾难、危脆、不可靠性。这样由定就能引生出真正的大智慧。</p><p>定慧实际上是互相促进相辅相成的，有智慧观察世间无常性就会减少心的攀缘和散乱，就容易定下来。观察自己心里有什么结缚，然后思惟分析心中的结缚如何不如法，分析透彻了，就会慢慢解开结缚，不再纠结，心就静下来了。要了解自己的内心在想什么，如果不了解就没办法把所想破除掉，心就静不下来。要靠智慧来引导禅定，修出定以后，在定中再思惟，又引发出更进一步的智慧，叫作三昧。所以有智慧好修定，无智慧不容易修定，有禅定又容易出智慧。</p><p>十、降伏五盖才能发起初禅定</p><p>初禅现起的条件是要降伏五盖，贪欲、嗔恚、睡眠、掉举、疑，都要得以有效的降伏，财色名食睡都要尽量远离，才能发起初禅定。</p><p>五盖是：贪欲、嗔恚、睡眠、掉举、疑。如果内心里有嗔恚，思绪和觉观就会总现前，心里不能平静下来，禅定就不会出现。如果内心有贪欲，心里烦恼不断，也不能得到寂止，修定也很困难。睡眠还是属于昏沉，内心浑浊不清静，当然就会障碍禅定了。掉举，内心攀缘过去的人事，回忆、追忆不断，希望觉想不断，也会障碍禅定。</p><p>疑，心里有问题不能解决，对自己疑，对他人疑，对法疑，疑念悬在心里，卡在心里，觉观不断，当然也会障碍禅定。悔，总想着自己做错的事，心里思虑不断，烦恼不断，念头不断，六识不能寂静，禅定就不会现起。所以修定之前，要把自己的内心检查一遍，把心里的灰尘打扫干净，内心空净了，一盘腿，就会有定，平时心中无事，行走坐卧也会有禅定出现。</p><p>而要降伏五盖，就要生起出离心和强烈的修道心，不贪欲界世俗中的物质生活享受，吃穿饮食都不在意也无所用心，住用都不在意也无所用心，这样才能达到心无所住，远离欲界法，对色声香味触都不贪爱，才能发起初禅定。</p><p>现在的人都很讲究享受，讲究生活舒适自在，还要面子，不断与人攀比，整个心都沉浸在世俗里，这样就严重障碍了禅定的生起。吃穿住用都很讲究，非常贪爱的人不可能有禅定。色界初禅天人没有舌识，不需饮食，如果我们喜欢吃，喜欢吃好的，贪着味尘，初禅定就不能现起；色界天人没有鼻识，不嗅香，如果我们总是喜欢香味，讨厌臭味，在意香尘，初禅定也同样不能现起。</p><p>不贪人世间的法，欲界天的定才能出现，对人世间事不感兴趣，欲界定就会生起，喜欢人间的人事物，就不会有欲界定。不贪欲界天人的境界，色界的禅定才能生起，舍弃下界的享受和贪爱，上界的禅定才能出现，这是禅定现起的法则和条件。</p><p>如果我们每天对欲界的事全身心的投入，算计来算计去，就不能有初禅定的现起，什么都要追求，什么都要想得到，什么都想比别人好，就不能有初禅定的现起。如果学佛修行所得的福报都用来物质生活的享受，道业需要的福就不够用了，多留一些福作为修道用，道业才能不断进步。</p><p><span> </span><strong>第二节  不能入定的原因</strong></p><p>一、修不好禅定的原因</p><p>禅定修不好，有很多原因，自己细心找一找，然后把不该有的贪习都要除一除、改一改。想修好禅定每天心都清净，就要少吃，不要贪吃；饮食的营养也不要过剩，口味也不要太浓，清淡一些心就清净一些。人中的衣穿住行，吃喝拉撒，尽量都不要贪着，适可而止是最好的。这样就容易脱离人类的生活，与天界生活相应，禅定就容易出现了。</p><p>适当的断食，对身体有很多好处，能延长寿命。不要怕饿，饿有饿的好处，少吃点肠胃的工作量减少，磨损就少，内脏器官寿命当然就长了。少享受少消耗福报，福报留存着滋养色身，就能延长寿命。喝水要适量，身体够用就行，喝多总是要新陈代谢排泄出去，也耽误时间，同时也增加内脏器官的工作量，磨损内脏。在断固体饮食的情况下，只吃一些流质的饮食和水果，身体轻松，心也很清净，修行禅定，不仅定力好，还能去除疾病，让身体更健康。我们学佛人有福不要享尽，恶业尽量忍着都消尽，后半辈子以至于后世就轻松愉快了，多为后世着想，尤其是多为自己的道业着想，这才是一个智者。</p><p>几乎所有的人最难舍的是情和欲，修行应该先舍欲，欲在所有的烦恼里是最粗重最容易舍去的。天人有情却没有欲，欲界天人虽然也有欲，但是欲很淡，所以他们才在欲界天上生活。有禅定，身心都舒畅美妙。我们先从最容易舍的开始舍，把生命质量提高上来。</p><p>初禅天人不吃饭，也不嗅香闻味，没有男女之事。我们要想有初禅定，就不要贪饮食，不贪饮食的色香味，不贪饮食的营养。同时也不要在意周围生活环境的气味，不追求香味，不厌恶难闻的气味，对气味不挑剔，不在意，一切都随缘，无所谓。对于男女色都不贪着，性别只是一个幻化的假相，四大组合与猪肉一样，没什么好贪爱的。保持这样的心，不愁没有禅定，再降伏睡眠和散乱心，初禅定就容易生起了。</p><p>阿含经里佛告诉比丘初夜精进，不贪睡眠，中夜精进不贪睡眠，后夜精进不贪睡眠。少吃少喝，不昏沉，少妄想，睡眠就少了。</p><p>我们应该经常观察自己的心，打扫清理自己的心，让心干干净净的，无挂无碍，禅定很快就能生起来。修定并不是很难，现代生活太富裕了，容易让人生起贪心，所以禅定就不太容易修出来了，加上四面八方的信息太发达，都侵入人的心中，每个人的心里都被塞得满满的，心不空，如何能能有禅定？再加上生存环境，不容易持戒，持不了戒，如何能有禅定？</p><p>二、我们打坐修定为什么总不能入定，为什么定力很浅？就是因为意根不肯歇息下来，攀缘不断。心里什么都惦念着，放不下来，这就是无明。心里以为真有个外面世界，真有人事物的存在，所以内心就摆不开。那么打坐时意根总是要处处攀缘，弄出一些事情出来，意识心就得要了别这些事情，心就不能安稳，不能定下来，更不能灭掉妄念。如果没有无明，意根不攀缘不执著，不弄些法尘出来，意识就不用去了别，心定下来很容易。</p><p>定中所见的一切人事物，也是意根攀缘弄出来的，也是虚妄，不执著这些人事物，那些境界慢慢就能消失，定就深了。要记住世尊曾经告诉过我们的“凡所有相皆是虚妄”这句话，时时提醒自己，就能减少攀缘，无明薄了，定就容易修了。 </p><p>三、每个人都要好好的训练一下自己的思惟，不要偏离正方向太多。思惟不清晰，一定是缺少禅定，那就要努力修禅定。如果禅定修不好，检查自己是否是福德欠缺，或者是戒律修持的不够好，或者是习性太重，或者是身体方面有障碍。很多人都是缺少禅定，定力不足，思惟跟不上，很多法看不懂就无法胜解，修行慢慢的就掉队了。</p><p>每个人在修行中都要努力找自己的症结，找自己的不足和欠缺之处，找到之后，要想办法改进。回头看自己，查缺补漏，就是一种精进。 定力少一点点，观行就不能到位，那所说就没有证据，不一定是事实真相。所以说只要自己观行力不够好，逻辑思惟力不强，就不要肯定表达自己的观点见解，那是不究竟的。</p><p>四、修定的禁忌，定就就是不动、安静、不躁动。如果想让身心安静，身心不动，就要减少饮食，饮食不要太饱，减少饮食的营养和量，不要吃得太好太多，这样的话身心就能安静下来，不躁动了。如果饮食能量太足太多就会要往外泄露，泄露时身心就躁动，静不下来。身体正常，饮食一般就好，不要贪求营养和能量，这不利于修行。当然缺少营养，阳气不足，身体虚弱也无法修行，要保持身体适当、中和，心才能安静，禅定才能修好。</p><p>五、持戒忏悔罪业才能修好禅定 </p><p>一切法的证得，真的是要在甚深禅定中，缺少禅定，学到的就是知识，不是真正的智慧。所以一定要重视禅定和观行。禅定不足的原因是心散乱，心散乱的原因是攀缘多贪求多，把心收摄起来，必有禅定。收摄身心需要持戒，持戒之前需要受戒，受戒之前要忏悔所有罪业，罪业消除，遮障消失，心清净。</p><p>忏悔，第一要改变种子，忏悔造作的新业，抵消旧的罪业，通过忏悔，心行转变，业就转变，后不再造。意识和意根变得清净了，这是真忏悔的结果，有这个结果，一是消业，二是不再造新业。如果没有这个效果，说明忏悔心不诚，是假忏悔。判断忏悔以后罪业是否消除，首先要看是何等罪业，是轻是重。重罪要见好像，之后内心比从前清净了很多，一些障碍消除了，修行速度加快了。轻的罪业忏悔之后，心也是清净的。</p><p> </p><p><strong>第三节  修定的原理</strong></p><p>一、修定时，浅定是修五俱意识，深定一定要修到独头意识。修定的一般程序是，由制伏五俱意识，渐渐深入转换到独头意识，然后再制伏独头意识。甚深禅定都是从独头意识起修，如佛经中的各种观想法门，都是制伏独头意识的。在所有修定过程中，从头到尾，都由意根主宰和牵引六识的生灭变化。虽然有时候和最初都是由意识牵引意根，利用思惟、说理来说服意根不要胡乱攀缘，最后实质还是意根决定了六识了别的有无和轻重，由意根牵引六识的来来去去，由意根把六识减弱和灭去。</p><p>因为独头意识出生受到的限制条件较少，也不容易灭去，因此独头意识远远比五俱意识活跃得多，不容易制伏，一旦制伏，禅定轻而易举。一旦能抓住和牵引独头意识，入定出定就有门路了。抓住和牵引六识都由意根来作，所以意根一定有欲心所，降伏意根的欲，调动意根的欲，牵引意根的欲，禅定就轻而易举。所以修定，还是修意根降伏意根，牵引意根。</p><p>修定的次序：降伏五识，只剩五识之一，这叫专注。然后五识之一也要减弱，让五俱意识功能增强。之后把五俱意识的功能，转换到独头意识，再减弱五俱意识，增强独头意识。再之后让独头意识专注、专一、深入。</p><p>再深定，就减弱独头意识，最后灭去独头意识。如果独头意识太强，也影响禅定，尤其是深禅定。比如总是要思惟法义，心中总是要有念头，念头不能断，还要转换念头，这时深禅定很难保持。</p><p>从修定的原理来看，意根一定与定心所相应，定就是定意根，定六识没有用，也定不住六识，孩子必然要跟着母亲走，定住母亲，同时就定住孩子。看事情不能看表面现象，一定要深入到事情的本质和究竟处。观察不了意根的运作，也就观察不到深层次的本质，只能停留在事情浮面，观察一些假相，这样是不会有智慧出生的。</p><p>二、有多少人在学佛过程中，都在不断的与妄念搏斗，以为把妄念消除了，就能证得佛法，可是即使与妄念斗争一百年，把妄念降伏了，最终仍是不懂佛法，没有智慧的出生，不能解脱。正确的修行方法是，让意根把注意力转移到对佛法的思惟当中，妄念自然就减少，转换注意力，转换攀缘的对象，修行很快就能成功。</p><p>总是在妄念上计较来计较去，对于佛法的修行和获得智慧是没有助益的。最直接的方法是把攀缘的对象转换过来，从攀缘世间法转换到攀缘佛法，把对世间法的执著转移到佛法上，把兴趣转换，把贪的对象转换，把世智辨聪世间法的小聪明，转换成观行佛法的智慧，这样定慧马上就出现，何愁不了道。善于学佛者，应该善于利用妄念，不是压死念头，而是懂得转换念头，转换成思惟佛法的念头，心心念念都在佛法上，心心念念都是佛法，这样定慧就成就了。</p><p>如果天天都与妄念搏斗，无异于外道的修行方法，而且根本也赶不上外道的禅定高深。过去外道们修定，四禅八定都修出来了，五神通也修出来了，但因为还没有断除我见，仍然认五蕴十八界中的某个法为我，为真实，邪见颠倒见都没有破除分毫，依此邪见，就不免轮回生死；纵使能入定长达八万大劫，八万大劫出定后，仍然要沦堕三恶道，仍然不免生死轮回之苦。众生就是因为执我的邪见而造业，而生死轮回，如果断除了我见，就把捆绑自己的结缚打开了，就能保证不入三恶道。修行破除邪见，获得正知见是非常重要的，否则修行无量劫，还是走在邪路上，不能回归正路，也不得解脱。</p><p>只要福德具足，目标正确，方法得当，要想开悟也不是很难的事。每个人的根基不同，修行方法就不一样，从小就喜欢清静、喜欢独处、兴趣爱好比较少的人，修定就比较快，即使不打坐，心也少于攀缘，精力集中，只要遇见佛法，就能专心思惟佛法，深入于佛法中。当他熏习一段时间佛法的正知见以后，有了正知见，就懂得了参禅的方法，自动自觉的开始参禅。相反有的人打坐十年二十年，还是不能专心思惟佛法，不懂得如何观行佛法，也不能分辨出法的正邪和层次。</p><p> </p><p><strong>第四节  修定的好处 </strong></p><p>一、早晨在静坐中，听到QQ叮咚一声响，先是只知道声音，没有声音的定义和概念，也没有任何觉受，只是简单的知，这个过程很长，这是耳识的了别，比较粗。之后才有意识的了别，意识了别了，才分别出是QQ声，有了定义和名言，有了觉受。同时又懒懒的不想动，有点贪着舒服的感觉，想继续坐下去，这是意根的贪着。在耳识没有听到响声之前，是意根的知，意根知时模模糊糊，不辨是什么声音，不辨里面什么内容，只有意识出来才能逐渐辨别出是QQ的叮咚声。如果不是静坐入定，这个了别过程非常短暂，快速就过去了，可是在定中，心很细腻，了别的很细微，耳识意识意根都比平时细微，整个过程显得漫长了些，内容细腻了些，了知得单纯了些，心不容易生起情绪，容易降伏烦恼。   </p><p>这都是意根的功劳，如果再降伏意根，叮咚声音响起，祂也不想了别是什么，那么耳识意识就不出生，五识都不出生，无觉无知，就进入到二禅境界。</p><p>静坐当中，心会变得很细腻，感知很真切，又客观不带情绪，就能发现平时发现不了的事实真相，只要心不进入境界里，单纯的感知，客观的了别，断我见和明心就会比较容易一些。</p><p>有禅定的人，心是很细腻的，了别细微看人看事都很准，能抓到根本，作事时心很细，细节周全，接触新鲜事物很快就能学会，出差错少，人聪明智慧。心散乱的人，可想而知，心粗气躁，寥寥草草，马马虎虎。</p><p>二、禅定能降伏五欲烦恼魔</p><p>魔王波旬最不希望众生修习禅定，因为一旦有人修到未到地定具足，与他的禅定相等，魔王就管不住此人了；一旦有人修到初禅定，就脱离魔王掌控，魔王就更管不着了。所以如果有人阻碍我们修禅定，否定禅定的作用，就要小心了。此世间五欲烦恼炽盛，没有禅定，无以降伏烦恼和断除烦恼，后世果报可畏。</p><p>三、有禅定时思惟清晰通透</p><p>如果思路不够清晰，一个是缺少智慧逻辑思维能力，再一个就是缺少禅定，应该多修定让心念专一，思惟清晰就能一些。定力不足时，意识思惟不能顺着一条主线，就会四处分神，没有重点，就像气脉不顺着一条线运行，在身体里四处串一样。一个人逻辑思惟能力强，依靠强大的定力，才能达到专一，如锥子深深的锥于一个点上。没有定力的人，如木板平放地上，没有痕迹。</p><p>如果定力足够，知见也足够，应该配合打坐的静中定，加强定力，然后观行佛法，观行五蕴。之后再参禅，心里时刻有参究的疑情。先断我见，再参禅明心。</p><p>学法的目的，就是为了观行，然后再证得。不能观行，说明思惟力不够好，也就是定力不够好，没有思惟修的禅定，对于证法起不了多大作用。所以应该学会修定，让禅定起到应有的作用。</p><p>四、禅定能打开六根功能</p><p>打坐坐到极静时，有时能听到空中很美妙的音乐旋律，这就是中国古人所说的天籁之音，在佛经中说是一种叫紧那罗的天人所发出的歌声，这是接近于天耳通的境界。禅定能把耳根功能开发出来，把心打开，减少了了别声音的阻碍，了别功能就强大。禅定能促使如来藏通过耳根把更遥远的声音四大微粒摄取过来，让耳识意识听到，天耳通就出现了。当然这个所谓的遥远的距离是对于身根而说的，对于如来藏来说，并没有丝毫距离，这些声音都是如来藏变现和执持的，都在如来藏里。</p><p>众生之所以不能发起禅定，不能发起神通道力，就是由于心的散乱性、攀缘性和贪嗔痴烦恼的遮障。严重阻碍禅定的就是贪嗔痴烦恼，谁贪嗔痴比较重，谁受到的阻碍就严重，遮障就严重，其自身功能就受阻碍，心不灵通。我们本来都能作佛，也能拥有一个大千世界，但就是因为贪嗔痴无明烦恼的遮障，不断执著自己，不但得不到大千世界，反而因此失去了人身自由，枉受无量的生死苦，贪小失大，得不偿失。可见众生无始劫以来都在造愚痴业而不自知，众生都是这样为了些微蝇头小利而失去大千世界。</p><p>五、静中定更容易出生智慧</p><p>行走与坐卧，有什么区别？行走时，身识和意识要放在色身的运作上，注意力在色身以及周围环境上，独头意识思惟法义的注意力就要减少，精力不够用，不能专一，思惟不深细，智慧不容易出生。而在坐卧中，识心分散的少，独头意识注意力更集中，思惟就深细细密，容易出生智慧。因此说，坐卧的静中定，更容易出生智慧。坐卧中，心理没有更多的负担，可集中精力，细密思惟，不用担心行走会遇到什么情况，因此心安，静坐更容易生起未到地定和初禅定。</p><p>因定生慧，这个定是指未到地定和初禅定，所以证果和开悟，最低要具足未到地定。只要不是无念的未到地定和初禅定，定深时思惟更细密，开智慧发现新大陆是没有问题的。没有禅定，无法观行，定浅，观行不得力，心也不细致，与法不相应。所以学法之后，就是禅定和观行两个修行方式。</p><p>六、修定养心也能养道</p><p>在静坐的初禅定和未到地定中，都可以思惟观行佛法，思惟的程度都要比活动中的思惟细腻得多，深细得多，智慧更容易打开，更深透。二禅以上的定中无觉无知，因此不能思惟佛法，打坐入二禅定中虽然不能有思惟，但是出定以后思惟佛法却是很深细，行住坐卧中的定力也保持得相当好。</p><p>打坐中思惟佛法，没有负担，心里安稳，内心沉静，不浮躁。下坐以后，一天当中的身心都是愉悦舒展，没有烦恼，思惟也敏捷。打坐的静中定，能真正的资养身口意活动当中的定；只修活动当中的一点点定，不能解决根本问题，不能降伏烦恼，思惟佛法既不细密也不深透。</p><p>末法时期众生福薄，大家都为物质生活的享受而奔波，没有修定的时间和环境条件，所以大家为了将就自己，都说有个动中定就行了，其实这是远远不够的，不能解决实际问题，不容易实证佛法，嘴皮子功夫多，心里仍然很浮躁，贪嗔嫉妒仍然很炽盛。</p><p>现在的众生都生活在喧嚣动乱的环境当中，多数人的我执强烈而坚固，所以斗性很强盛，互相之间争来斗去，搞得整个社会及各个团体都是一片的乌烟瘴气，很难收拾，这就是因为众生心中没有禅定，不能压伏烦恼，以至于烦恼泛滥。这样继续下去，佛教分裂和衰弱是必然的趋势，谁也阻止不了佛教的消亡；而且这种消亡要从内部开始，由于佛教团体内部的分裂，导致佛教必然消亡。学佛修行没有禅定的滋养，就没有真实的身心受用，对众生和佛教的发展前途没有益处。所以奉劝每个学佛人一定要学会静坐养心，养心就是养道，就能净化社会环境，净化人心，促使佛教事业稳固发展。</p><p>七、四禅八定不仅通于佛门，也通于外道，不分大乘和小乘，但是菩萨们所修的禅定要远远殊胜于外道。在获得初步的定中，身体有能动的现象，也有不能动的现象，可以随意动转的定比较灵活，虽然动转，心念比较专一，妄念也少。在欲界定中，身体有轻飘的感觉，走路像一阵风似的，没有什么动静，身体好像是被往上托举一样的轻盈，不再像从前那样沉重地拖着腿走路。</p><p>初禅定中的身体比这个更轻灵，接近于没有身体的感觉。初禅中没有身体发痒的感觉，全部是舒适和轻安，感觉美妙无比，用人间的语言无法形容，人中的感受与初禅定中的感受真的不能比拟。正因为有了这样的美妙感受，就不再喜欢人中的五欲之乐，财和色都不再感兴趣，感觉世间五欲都比较粗劣，因此而不再向往。</p><p>初禅中的身体觉受没有沉重的感觉，都是轻灵和轻安的，身体直往上飘，体内也没有五脏六腑的感觉。没有凉热的感觉，没有发烧的感觉，没有身体发涩的感觉，没有任何不舒服的感觉，内心清明，神清气爽，没有昏沉。正好相反，可以用美妙轻灵这样的词汇来表达此时的身体觉受。如果有一点不好的感觉，那就是苦恼，不是初禅所应该具有的功德觉受。</p><p>八、有禅定能断疑生信</p><p>禅定不足，智慧就浅，必然对法生疑，疑见必然存在。尤其是那些深法，唯识种智的法，每个人都会有不同程度的疑，因为禅定智慧不足，福德也不足的缘故，不能实证，不能现量观察，疑就更深了。所以佛在金刚经中就让众生断疑生信。</p><p>在自己不能实证的情况下，有疑在所难免，但是一定不要下定论，定论错了，就是谤，果报严重。有智慧的人对自己无法实证的法义，都不轻易肯，也不轻易否，不给自己添加业障。</p></div>"
},{
    "title": "第四章 佛经中所讲的修定观行方法",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  佛经中所讲的修定观行方法</strong></p><p>一、圆觉经中提到修行三摩钵提定慧结合的方法，以心变化境界，由心转境，境随心转。这个方法也不难，在定中，心非常专注的冥想一个境界，随着定的深入，心的转变，境界就会逐渐转变。原来心里是恶念，随着定的加深，内心松弛下来，恶念就会转为善念，想恶却恶不起来了，一切事物都变得美好起来，心由嗔变为喜悦，境界由丑变为美，心转境界就转。所以禅定能降伏烦恼，断除烦恼，转变心念，改变一切法。诸佛大菩萨们都是修三摩钵提，成就了一切法，成就和转变三界器世间，变秽土为净土。</p><p>二、四念住的修行方法</p><p>四念住经是一部定慧齐修得法眼净非常好的经典，因为我们没有定力和慧力，心思粗糙不会反观自己，这部经教我们如何把心修到细致入微的程度，越来越清晰的反观自己，认可自己五蕴的生灭变异不实，进而断除我见，证得小乘的四个果位。</p><p>经中讲的是观行四念住的修行方法：观身念住、观受念住、观心念住、观法念住。观身念住的时候，首先观自己的呼吸，心念一直跟随自己的呼吸而转，心缘一法，得定得止，然后起观，证得色身生灭无我。之后再观整个色身，直到把自己的身行造作都观行透彻，自己目前正在做什么清清楚楚明明白白，最后就剩下一个身念，然后空掉那个念，舍掉那个念想，内心知道一切法都是空的，不是我。</p><p>将来要参禅的话，靠着定力把这个念换成一个参禅的话头，或者需要解决的法义，行住坐卧就带着这个参究的念，到一定时候就能把法义参究出来。现在我们的心都不够警觉，不了解自己，也不会反观自己，通过修定，让心细致入微了以后，就能很了解自己，了解了才能够解决自己的问题。</p><p>修一段时间就能尝到修行的甜头，虽然一开始入手的时候会觉得苦，内心挣扎不愿意受束缚，但是坚持下来养成习惯就好了，随时随地能反观自己，身在干什么，心在干什么，自己的身口意行就了解了，了解的很透彻了，知己知彼，就能百战不殆，把自己的问题解决了。用法来对照自己，管理好自己，检查自己如不如法。能管理自己了，将来就有能力管好别人了，连自己都管理不好，就不能管理别人，无法当菩萨当众生的导首。</p><p>要懂得自己当下的造作就是身见我见，把这些行为造作都当成真实当作我去执著去抓取，有能力反观的时候就知道这是我执，执着一切法的功能作用为真实是法执。先能观察到就好，别管能不能做得到，早晚都能做到。怕的就是自己现在不知道，不会观察自己，那就是无明。如果不知道自己的知见是错误的，不知道自己有执著和无明，那怎么能改呢？</p><p>从观呼吸开始观身，修身念住，然后修受念住。众生或者大多都是为了自己感受舒服而驱役自己心去造作种种业行，这些感受都是生灭六识的功能作用，也有意根的作用，都是生灭变异不定的。然后观心无常，观心一开始观意识六识心，到最后还涉及到意根。内容写的都不长，但是每一小段内容要做到观行熟练了，也需要很长的一段时间，至于多长，那就因人而异了。</p><p>四念处经里最后讲到观法无我，这个法无我，不是指一切法不是第八识这个我，小乘的观行不是这样观的，这样观不能证果。小乘里的我，是指能散坏的能毁灭的那个我，其实没有能恒常不灭的我，一切法都不能恒常存在，早晚都要归于灭亡，因此才说法无我、不是我。</p><p>三、佛经原文：<strong>转变者，谓佛菩薩依定自在。若于其地起水胜解，即令成水如实非余；火、风胜解亦复如是。若与其水起地胜解，即令成地如实非余；火、风胜解亦复如是。若于其火起地胜解，即令成地如实非余；水、风胜解亦复如是。若于其风起地胜解，即令成地如实非余；水、火胜解亦复如是。</strong></p><p>答：诸佛菩萨能依甚深禅定的自在力量，改变地水火风，从而变化世界。比如诸佛菩萨看见大地时，想要把地性变成水性，就会不见地大，而这在地大上见水大，于是大地山川就变成河海江流，除了河海江流没有其余物质尘境；诸佛菩萨见大火时，强行在大火上见水，于是火大种子转变成水大种子，大火变成了大水，除了大水没有其余物质尘境；诸佛菩萨看见大风刮起来的时候，想要灭除大风，强行把大风观想成大水，于是风大种子变成水大种子，大风转变成大水，除了大水没有其余物质尘境。</p><p>如果诸佛菩萨看见大水，想要灭除大水，强行把大水观想成大地，于是水大种子转变成地大种子，大水变化为大地，除了大地不见其余物质尘境；如果诸佛菩萨看见大火时，不想大火存在，强行把大火观想成大地，于是火大种子就转变成地大种子，大火变成了大地，除了大地不见其余物质尘境；如果诸佛菩萨看见大风吹来的时候，不想大风存在，强行把大风观想成大地，于是风大种子转变成地大种子，大风就变换成大地，除了大地不见其余物质尘境。</p><p>总之，诸佛菩萨因为有甚深禅定，其心自在，能随意转变四大种子，改变一切物质色法，能随心所欲的变化一切世界。以无量神通道力度化一切众生，令入佛道。</p><p>制心一处，无事不办。外道能制心一处，阿罗汉辟支佛也能制心一处，诸大菩萨能制心一处，诸佛更能制心一处，都能使心得自在，都能相应的随心所欲，都能成就相应的事业。但是由于心量不同，禅定深浅程度不同，智慧不同，心的自在程度就不同，成就的事业就有所不同。</p><p>四、摩诃止观原文：<strong>听观多。如日焦芽。即应听止。润以定水。或听定淹久。如芽烂不生。即应听观。令风日发动。使善法现前。或时驰觉。一念叵住。即应听止。以治散心。或沉昏蒙蒙坐雾。即当听观。破此睡熟。或听止豁豁。即专听止。或闻观朗朗。即专听观。是为自修信行。八番巧安心也。</strong></p><p>释：当心里对法义的思惟观行多的时候，就像太阳光照在蔫了的小芽苗上，这时候就应该停止思惟观行，把心止息下来而修定，就像给蔫了的牙苗浇水滋润一样。当心处定中很久之后，就像水淹牙苗，使得牙苗腐烂而不再生长了一样。这时候就应该从寂止的定中生心动念去思惟观行法义，使得心里出现和增长善法的功德，就像用风吹拂快腐烂的牙苗，用阳光照耀快腐烂的牙苗，地水火风的营养均和的加之于牙苗上，牙苗才能茁壮的成长。</p><p>在修行过程中，有的时候觉观驰骋不息，念头涌动止不住，心里躁动，善法功德消失或者不现前，这时候就应该修定，把心止住，以对治散乱攀缘心，令出生智慧功德。在修行的过程中，有的时候静坐头脑中昏昏沉沉，朦朦胧胧如在雾中，心里昏暗不生智慧功德利益，这时候就应该起心思惟观行法义，破除昏睡状态。在修行的过程中，当在定中内心清明朗照，如日在中，这时候应该继续一心的修定，因为这样比较容易出生智慧水。有的时候反观到自己观行智慧如涓流汩汩而出，这时候就应该继续一门心思的修观行，以保证智慧水不断的涌出。</p><p>以上就是众生在修行过程中，应该懂得和运用的八种巧妙安心的方法，要尽量做到定慧等持，不可偏废一方，否则修行不能成就。       </p><p>五、观无量寿经第一观 </p><p>原文：<strong>（佛说）如来今者，教韦提希，及未来世一切众生，观於西方极乐世界。以佛力故，当得见彼清净国土。如执明镜，自见面像。见彼国土极妙乐事，心欢喜故，应时即得无生法忍。 佛告韦提希：汝是凡夫，心想羸劣，未得天眼，不能远观。诸佛如来，有异方便，令汝得见。 时韦提希白佛言：世尊！如我今者，以佛力故，见彼国土；若佛灭后，诸众生等，浊恶不善，五苦所逼，云何当见阿弥陀佛极乐世界？ 佛告韦提希：汝及众生，应当专心系念一处，想於西方。云何作想？凡作想者，一切众生，自非生盲，有目之徒，皆见日没。当起正念，正坐西向，谛观於日欲没之处，令心坚住，专想不移。见日欲没，状如悬鼓。既见日已，闭目开目，皆令明了。是为日想，名曰初观。 </strong></p><p>释：佛陀为了心力赢劣的人命终往生极乐世界，教导众生一种方便方法，就是首先面向西方观想日落、水观和地观，三观成就以后，保证命终往生极乐世界。总共有十六观，每一观里都有佛力的加持，如果单独靠众生自己观想成就，恐怕很难，因为佛说众生心想赢劣，观想力弱。为什么众生的心想赢劣观想力弱呢？因为众生无量劫以来，业种深重，世俗法的攀缘太多，心思太散乱，无法集中全部精力在一件事上，因此不容易成就一件事，只能依赖佛力的加持来完成观想。</p><p>佛说，我现在教导韦提希夫人以及未来世的一切众生，观想西方极乐世界。以佛力的加持缘故，现世就能见到极乐世界清净的国土，就像手拿一面明亮的镜子看见自己的容貌一样，能现前眼见极乐世界的胜妙庄严之事。于是就心生欢喜，由于内心欢喜，当时就证得无生法忍，知一切法依自心而幻化，都是无生，都不真实存在，忍于此事，就得无生法忍。</p><p>佛对韦提希夫人说：你现在还是凡夫，心力很弱，没有观想能力，没有天眼通，观不到太远的距离，更观不到极乐世界，诸佛如来却有一些善巧方便，能让你观见极乐世界。</p><p>韦提希夫人对佛陀说：世尊，像我现在这样，因为佛力加持的缘故，能够见到极乐世界佛国土；如果世尊您灭度以后，后世那些众生心性污浊不善，又被生老病死苦所逼迫，他们怎么能够现前见到阿弥陀佛的极乐世界？</p><p>佛告诉韦提希夫人说：你和这些众生应当专一其心的把心系在一处，想于西方。如何想呢？凡是愿意观想的这些众生，都不是生来就是眼盲的人，有眼能见色的这些人，都能看见太阳要落西山的景观。你们应当生起正念，只念一处，面朝西方而端坐，仔仔细细的一心观察太阳要落下来的地方，让心非常坚忍的住在这个景象中，专门观想这个景象不移动。这时应该能可见太阳马上就要落下去了，其形状就像悬在半空中的大鼓一样圆圆的。看完落日以后，闭眼开眼都能很清晰的看见落日的模样。时时能见，不再失去，就成就三昧。这就是日想观，就是十六观中的初观。</p><p>原文佛讲的就是这个意思。我们为了方便观想，在太阳下山时，用手机录像，录像更生动清晰，更有助于观行记忆。落日不要白色的，经中说是橙红色的，红中稍微带黄的那种。落日的真实相是什么样的，要亲眼所见，越真实越好。西方的落日，一般是五六点钟时候的，不要想象的，不要P出来的。选定一种自己比较喜欢的，存在手机里，长期观看，长期观想。不要观好几种，一定要专一，不要杂，否则禅定不会出现。也不要加其它图案和背景，有图案和背景会分散注意力，不容易得定，图像越单调越好。我们不是要欣赏景观，有个欣赏的心，就是散乱心和贪爱心，那样就不能有禅定了。</p><p>选好落日景象，然后天天观看，看完之后独头意识再想象回忆。回忆的比较坚固了，时时能回忆得出来，再训练自己闭眼眼前要看见落日景象；闭眼能时时出现落日之后，最后再睁眼闭眼，眼前都是落日，这个景象不会消失不见了，日观三昧成就了。</p><p>第三观成就时，佛陀保证众生命终往生极乐世界，在这期间禅定永不失，这种修法非常殊胜。三昧成就时，重罪变轻，轻罪消失。所以所有禅定三昧成就时都能消业，尤其是修净土有佛力加持的更能消业，还能保持三昧境界不失。等到第七观成就时，三恶道业全部消灭，立时开悟，见十方诸佛在面前立。</p><p>这是改变和降伏意根的方法，意根一旦降伏下来，再修任何一种禅定，很快就能成就，各种三昧一修就容易成就。日想观成就之后，再观水，水观也能很快成就；之后是地观，地观成就，就保证去极乐世界了。</p><p>选定一种落日景象，长期观看，然后回忆。能时刻回忆出来，不会丢掉了，再闭眼时刻在眼前，能时刻闭眼显现出来以后，再练习睁眼看到，如果睁眼闭眼时刻都能见到落日景象，不会丢失散坏，第一观就成就。第一观成就以后，第二观就容易观成功，乃至于第三观也容易观成功。往生极乐世界就有保证了。第一观成就以后，修其它任何观行，都容易成就，念佛三昧，明心见性都不难了。有比较大罪业的，这样观行，佛已经保证能灭罪，而且还能往生极乐世界，还能明心见性。</p></div>"
},{
    "title": "第五章 戒定慧三学的重要性",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  戒定慧三学的重要性</strong></p><p><strong>第一节  戒定慧是证悟的关键因素</strong></p><p>一、世尊在娑婆世界住世时经常教导弟子修学戒定慧三学，反反复复强调：因戒生定，因定生慧。戒定慧等学，能达到心无漏：持戒能使心无漏，修定能使心无漏，智慧增长能使心无漏；漏就是无明烦恼，心无漏，就能得心解脱，得慧解脱，果位地地增上，戒定慧三无漏学究竟圆满以后必定成佛。</p><p>戒定慧三学在开悟之前，修行到一定程度，相应地满足到一定程度，就能断我见或者明心证悟；再往后戒定慧三学增上修，就能入初地达到心无漏；再增上修无漏戒定慧，就能地地增上，直至八地；再增上修就能修至十地等觉，再增上修圆满具足戒定慧以后，就能成佛了。所以戒定慧三学以及三无漏学是非常重要的，是成就佛道的关键因素。菩萨六度当中也包含了持戒、修定和般若智慧三度，以持戒、修定为基础修学方法，达到具足般若智慧为最终成果。</p><p>菩萨六度中定学之后才是慧学，佛说因定而生慧，真正大智慧的获得一定是由禅定中深细思惟观行所引发出来的，这是实证出来的智慧，不是情思意解出来的乾慧；从证初果直到成佛整个过程都是如此，每个中间环节，都有禅定的支撑，每种智慧都是禅定的结果。</p><p>二、戒定慧具足才能证悟</p><p>佛说：因戒生定，因定生慧。戒定慧不仅指意识要具足，意根也要具足。意根要想有断我见的智慧，明心的智慧，也要有禅定，在禅定中参究思量无我之法，参究思量真如佛性，才能断我见和明心见性。</p><p>如果意根不能亲自参究思量，那就不能认可意识灌输给祂的道理，最后也是意识解悟。而意根要想参究思量无我之理，也同样要有禅定，否则祂就会分心散乱。如果意根没有禅定，就会带动六识散乱，六识散乱，不断的了别，总是要把了别的内容汇报给意根，意根就要不断的分心，无法集中精力参究，也不能参究出一个理想的结果。</p><p>什么方法也代替不了禅定，解悟的修行方法一定要小心。按照世尊教导的方法修行，一定不会错。佛世时的所有弟子全部都是打坐修定的，这样平时行住坐卧心都在定中思惟佛法。唐宋朝时明清以前民国以前的修行人都是以打坐修定为主，之后行住坐卧中都能有禅定，心常在定中，这样心思细密，破参的机缘容易成熟，触缘即证。我们如今回头看他们证得佛法好像都是那么容易，殊不知他们的基础修行都相当好，善根福德具足，三十七道品具足，当然里面包含禅定也具足，思惟伶俐清晰，闻到相应的某种法，立时就能证悟。</p><p>所有人讲法中，佛讲的是最圆满最究竟的，没有人能超过佛的智慧，信佛语绝对没有错。无论什么时代，佛法永远不变异，佛法永远适用于一切时代。多读佛经，就能增长智慧，不会走冤枉路，也不容易被人欺瞒。所有菩萨的讲法，与佛相比都有缺漏和渗漏，都有不圆满不究竟之处，所以我们修学佛法还是以佛经为主。</p><p>三、戒定慧的实质</p><p>    修行的根本目的是为了断除无明烦恼得解脱，不能只盯着果位，果位是修行的副产品，以降伏烦恼，去除无明为目标，以获得大智慧无量智慧为目标，以救度众生为目标，设立这个目标就纯正没有障碍了。目标确立了之后，就要修行戒定慧三无漏学。</p><p>戒定慧实质就是戒心定心，使心生智慧。戒就是戒除心里的贪嗔痴慢疑，戒除烦恼，戒除我性，戒除遮障，戒除无明，这是戒的根本作用。戒除无明和遮障，心不起非，才能有定。定就是定住心不攀缘不散乱，思惟观行佛法才深透有力度，才能证得佛法，出生智慧。慧就是让心熏习正确如理的佛理。三者具足了，就会出生真实的见地，从而发起大智慧而得解脱和成就佛道，有能力度脱众生。</p><p><strong>第二节  戒定慧三者的关系</strong><br/></p><p>一、戒是定的前提和基础</p><p>戒是定的前提和基础，不守戒而修定，如蒸沙石成饭，不是饭本，终不得饭。末法时期，守戒的人已经很少很少了，得戒体的人已经很少很少了，因为为人授戒之人本身就没有戒体，或者是因犯戒而失去了戒体，他人就无法从其处得戒体。没有戒体，对于犯戒的心就没有了遮障和屏蔽作用，那么恶緣出现时，很容易就犯戒造恶业了。</p><p>所以如今学佛人，很少能有成就禅定的，其观行智慧更难具备了。那大多数人只能看书理解法义，学得了一些知识以后，就以为自己有所得有所证，于是慢心高涨，这样于己于人都无益处。没有禅定作为观行的基础和充分必要的条件，实证是根本谈不到的，只能像三岁孩子一样玩玩口头禅，讲些大道理，讲到八十岁，仍然做不到，心口无法一致。</p><p>二、佛法修证的关键部分，佛反反复复给我们讲，就是戒定慧三无漏学。戒学方面一定要严持戒律，之后心才能定，心定之后才能有观行智慧，观行成熟就会出生般若大智慧。有般若大智慧非常重要，能导向解脱。而般若智慧的出生要依靠深细的观行智慧，观行智慧的获得要靠禅定，禅定的产生要依赖于戒律。戒定慧三学一环扣一环，都很重要，哪一环节都紧密相连，缺一不可，不能省略和丢弃不要，否则就无法实证。</p><p>禅定修出来以后，要学会转化为观行的智慧，善于转换心念，否则禅定永远是禅定，与外道定没什么差别，不出生般若智慧，不能证得无我，不能解脱得自在。不少人都对静坐不感兴趣，原因是心太散乱了坐不住，于是不得不依靠动中定。可是静中的心不容易把握，动中的心就更难把握了。即使动中定修好了，那个定也比静中定浅，心粗，思惟不细密，观行智慧也粗浅，无法真正实证。所以静中定即是基础，也是最后的皈依处，大智慧必须是从静中定出生，历代祖师诸佛菩萨都是如此。</p><p>静中定修好了，思惟就会灵敏和深细，行走坐卧心常在定，烦恼能降伏下来，心境轻松愉快，心念自然是善念多。所以静中定是非常重要的，这是十方诸佛菩萨祖师大德流传下来的法宝，一定要珍惜好好修持。</p><p>三、因戒生定因定发慧</p><p>楞严经第六卷，佛说：阿难，汝常闻我毗奈耶中宣说修行三决定义，所谓摄心为戒，因戒生定，因定发慧，是则名为三无漏学。</p><p>毗奈耶是经律论三藏之一，是佛所说之戒律，也是调伏自心调伏身口意之意，调和身口意之作业。调伏的结果，就能降伏烦恼断除烦恼，达到心地无漏，身口意都无漏无烦恼，无烦恼习气，无无明，毕竟成佛。为什么以摄心为戒？摄哪个心才能成就戒？心不收摄时，身口意就要妄动乱动。身，不该做的事非要做，不该到之处非要到，不该动时非要动，于是严重的就要造作杀盗淫业，禅定无法成就；即使轻微的身体乱行妄动的也不能有禅定，因为身体定不住，不可能有禅定。</p><p>心不能收摄时，口就要妄说乱说，不该说的也要说，不能说的也要说，严重的就要妄语绮语两舌，搬弄是非，违犯五戒十善，这样心不清净，不可能有禅定。即使不违犯五戒十善，因为口乱说，口行多，心肯定是乱想了，心行多，心不寂止，不可能有禅定。</p><p>心不收摄时，意业肯定不清净了，不该想的也要想，不该思的也要思，不该觉的也要觉，不该观的也要观，这样贪嗔痴烦恼必然要现前，心水浑浊，如何有定？</p><p>不该想的人，非要去想，不该虑的事，非要虑，不该挂的情非要挂，心里何能寂止？何人不该想？有的人情多，内心时时刻刻挂着另外一个人的影像，挥之不去，召之即来，抹也抹不掉，这样如何能有禅定？打坐时，这些影像肯定要遮障自心，遮障观行思惟，遮止寂静，如何有定？如果能把这些影像换成佛菩萨的影像，佛菩萨加持，心清静，马上就有禅定。</p><p>有的人不摄心，于己无关的事，不是利于人的事，念念在心，时时不忘，事事都要挂心，心里装得满满的，没有缝隙，这样心水汹涌澎湃，鼓动喧闹，如何有定？心不收摄，时刻挂着财色名食睡，六尘缘影重重叠叠，心不空，有物遮盖，如何有禅定？</p><p>很多人抱怨修定修不好，那就要检查一下自己，到底是什么原因修不好禅定，心里到底有什么东西遮障着自己，把这些东西挖掘出来，解决掉，心空了，禅定自然容易修成。影响禅定的，就是贪嗔痴烦恼，心里执取着世俗法，不肯放舍，把什么都当作真实，当作有用之物，不抓取不行，宁死也要执取这些世俗法，这样如何有定？</p><p>这样讲了之后，还是有很多人不会检查自己，不知道自己心里到底都有些什么。因为心随境界流散惯了，与境界贴得太紧了，分不开，就无法跳出境界之外来观察自心，这样怎么能有观察智慧，如何能观察自心的烦恼和习气？能跳出圈外跳出境界之外，跳出心外，观察自心，才能有观察智慧，有观照力，能发现从前所发现不了的事相，才能有办法对治自心，扭转自心，才能有力量降伏自心。</p><p>现在首先要做的是把心从境界上拿开移走，让心是心，境是境，人是人，物是物，诸法各住法位，与己心各不相干。心离境，觉照力强大，容易觉悟诸法实相，禅定自然增长，智慧自然现起。</p><p>以上讲的是因戒生定的原理，收摄自心就是戒，心不起非就是戒，心不乱想、乱思、乱动乱抉择、乱造作，就是戒。这个心主要指第七识意根，意根的触作意受想思，能引发六识的作意触受想思，引发六识的身口意行的散动。收摄意根，就相当于控制了身口意行的总开关，就相当于降伏了将军和指挥官，那么属下的六识士兵就会乖乖听话，服服帖帖不乱动，何愁没有禅定？</p><p>修学最重要的一点是：因定发慧。发，是生发引生的意思，佛陀指示我们，心由于禅定的定力，心定就有力量，这个力量能发起生出智慧。就像有一种力量，能使芽从土里拱出来，拱出来叫作生，叫作发。智慧就是由于禅定的力量，从心里拱出来的，生发出来的，没有禅定，心就没有力量，就不能生长智慧。</p><p>佛陀留给我们的宝藏，就是戒定慧三无漏学，如果我们因为不能持戒和修定，就要把前两个宝藏抛弃掉，说这两个没有用，只要一个宝藏就够用了。那我们想一想，我们是不是败家子？败坏了佛陀的传家宝，弃之不顾，我们还是佛陀的弟子吗？不守护佛陀的家宝，我们就不是佛陀的孝子贤孙，没有前两个宝藏，就不能有最后一个宝藏，最后这一个即使有，也是一个假货色，不是真正的智慧。   </p><p>戒，如果展开说，说不完；定，如果展开说，也说不完；慧，如果展开说，更说不完。归根到底，戒定慧由浮浅的六识心的戒定慧，达到归根究底的第七识意根的戒定慧，这才是真正的戒定慧。真正的戒定慧是心戒心定心慧，不仅仅是表面六识的身行和口行，不仅仅是意识的心行，而是第七识意根的心行问题。意根收摄，不起非，不乱动，必然有智慧出生。意根的戒定慧统领一切法，最后必由意根的戒定慧而究竟成佛。</p><p>四、禅定为何难修</p><p>过去世尊在世时讲法，是从戒定慧三方面同时着手，要求比丘们严格持戒，精进修定，多闻深思，勤修观行，弟子们在戒定慧上的成就很快，证果的人很多。可如今末法时代就大大不同了，讲法要倒着讲，先讲法义，后修禅定，最后再学戒律，一点一点循循善诱。众生就要倒着修，学了一大堆理论，而没有禅定观行，因为戒律不成就，无法生起禅定，也就不会出生真正的智慧，所学仅仅都是知识。</p><p>戒律无法先讲，对大多数众生无法严格要求戒律，就怕众生因为无法持戒，害怕戒律的约束，而不再学佛，或者不愿意受戒。意根的野性难调，时常践踏良田苗稼，如果用戒律的鞭绳约束，恐怕牛角伤人，牛蹄踏毁良田。戒律之鞭只能对那些心性调柔之良马有效，良马见鞭影即能驶上正路，而劣马即使皮鞭抽在身上皮开肉绽，也不知不觉。</p><p>我们很多人都抱怨禅定难修，可是难修的原因，谁也不清楚，也不去分析研究，对于阻碍发起禅定的因素无人知晓，更不会有人去加以对治，调伏自心。很多人在日常生活中习惯了顺己意顺己习，不知道己意己习都不善不正，与修行人应该有的习气不相应，差距还很大。这样学佛的结果就是无论修多长时间，戒律不成就，禅定不成就，智慧不成就，顶多有个乾慧，可以借此口头禅，过过口瘾，实际修证根本谈不到。如果不知不觉再造些恶业，那果报就难免三途，白来一世，白遇一次殊胜的佛法，美餐终究没有解决饥渴，仍然穷困加潦倒。</p><p>五、鱼与渔的区别</p><p>授人以鱼不如授人以渔，鱼代表什么？渔代表什么？鱼是果实，渔是获得果实的方法。授人以鱼，鱼了即了；而授人以渔，掌握了根本技能，可以获得无穷尽的果实，未来衣食无忧。</p><p>渔，就是戒定慧三无漏学，通过持戒，通过修定，通过观行参究，通过思惟，获得解脱的智慧。最初的慧是学慧，通过学习得来的智慧，最后是得慧，观行参究之后开发出来的智慧，是从自己心窝里掏出来的智慧，属于自己单独所有，任谁也夺不去。而学慧，昏眛死亡以后就会烟消云散，不知所踪。</p><p>没有前边的持戒，就没有中间的禅定，没有禅定，就没有观行智慧，没有观行智慧，就不能获得智慧鱼。</p><p><strong>第三节  禅定能出生智慧断除烦恼</strong><br/></p><p>一、修学佛法一定要修定，没有定的慧就是狂慧乾慧，乾慧之人，没有解脱的功德受用，学佛人都如此必然要导致佛法的没落。没有真修实证的人，把他人的见解拿来作为自己的口头谈资，每日口若悬河，倘若人人都如此，佛法必然衰败无疑。六祖坛经流通以后，大家都拿着坛经中的思想见解，当作是自己的悟处，到处争论不休，不去真修实证其中的真理，只有口头禅，没有实证的证量，结果禅宗就渐渐没落了。禅宗一没落，佛法就没落，因为禅宗是佛法的顶梁柱。没有禅宗实证的第八识，佛法就无法成立，没有第八识之禅，与世俗法无异，佛法就成为了世俗法。</p><p>禅定是很重要的，有定力时，就有能力思惟反观自己的身口意行，缺少定力，就办不到了。定力浅了，观行力也不足，很多问题自己就发现不了，即使发现了，也控制不了，没有能力改变自己。平时的静心思惟，就是在修定力，包括慧力，定慧同时熏修。如果一个人非常忙碌，修定不足时，遇事时理智性就不够，如果心不忙碌，定力比较好时，遇事内心就会波平浪静。有定水滋润的心，平和、舒适、轻安、清凉，没有定水滋润的心，干枯、易折、易爆。所以说修定是非常重要的，定力能使心细致入微，智慧能得到增长，烦恼能得到降伏。</p><p>为了佛教事业的永续流传，为了自身的道业，大家都应该走踏踏实实的真修实证的修持之路，不去建立华而不实的空中楼阁，把佛陀所教导给我们的戒定慧三学彻底贯通到一起，不缺戒，不少定，不狂慧，牢牢地打好佛法大厦的基石，让佛法牢牢地植根于三界世间，真实利益更多的佛子。</p><p>不修定者常常谈的口头禅，只是把他处得来的理论知识当作是自己的知见，无法实证其中的法理，内心浮躁，丝毫不能降伏烦恼，不得佛法的真实功德受用。结果理论仍然是理论，烦恼仍然是烦恼，烦恼炽盛时就能影响到众生对佛法的信心，同时也殃及到佛教事业的稳步发展。烦恼不能降伏的人，贪嗔嫉妒到处泛滥，成为一个德不配位的无德之人。</p><p>众生可分为四种：第一种人，无才无德，是痴人。第二种人，有德无才，是庸人。第三种人，有才无德，是狂慢人。第四种人，有才有德，是圣人。希望大家都能做一个有才也有德之人，降伏自己的烦恼，不让自己的烦恼殃及他人，不使众生失去对佛教的信心。</p><p>二、十方世界里第一尊佛威音王佛是如何见道的？没有其他佛来开示一切法都是如来藏性，他自己是如何摸索到有个不生不灭的阿赖耶识能出生五阴世间一切法的？世间一切法的无常变异生灭现象虽然很难证得，但经过长期观察还是能够观察得到的，阿赖耶识是如何观察证得的呢？后人在诸佛的教导下，经过多生多劫就可以承认有第八识如来藏常住，第一尊佛完全靠自力观察出第八识的存在，简直不可思议，成佛道上的每一步都是很现实的走过来了，他是如何做到的呢？</p><p>一切法空可以自证自通，如来藏出生一切法，这就很难自证自通了，除非有人提示：有物先天地，无形本寂寥。独觉佛的修证也不算很难，只要用功参究，放下世间一切。大乘如来藏的参究太难太难，所以开辟天地的第一尊佛是极利根利智者。</p><p>禅定究竟有多么的重要？能带来怎样的现量观察，让佛把一切法都串连起来，并归拢总结到如来藏这里？理论与对事相的观察思惟，哪一个更重要？当然是现量观察更重要。第一尊佛是开疆拓土者，根本没有理论可依凭，都是自己一个人对于各种事相一点点的观察思索，最后得出一个正确的符合事实的结论，从而形成了理论，为后人修行所依。现在五蕴无我的法讲得这样细致，无数人还是不得门而入，众生之间的差距为什么这样大？如果没有先驱那些正确的理论指引，后人更是犹如盲人摸象。</p><p>第一尊佛凭什么自修自悟，证得了一切法？甚深的禅定和智慧，超强的逻辑思惟能力，勇于探索真理的顽强意志，这些素质远非普通人所能比拟。第一尊佛一个人都没有依，也没有一个法可依，一个人长期不谢的努力探索世间真理，务求一切法存在的事实和真相，威音王佛只有事实真相可依，还是自己单独探索出来的。我们后人应该怎样学习效仿威音王佛？智者应该向威音王佛学习，依事实说话，勇于探索真理，后必成佛。威音王佛差一点点定力，都不能成佛，全靠禅定的功德探索出全部真理，无依无靠，我们修行也要尽量依靠自己的戒定慧，以证得诸佛所揭示出的越来越多的真理。</p><p>三、没有止不能观行</p><p>没有止的观，纯属就是杂观，心思散乱，不能深入，往往是情思意解，不能有大智慧的出生，几乎所有的众生都能这样散乱思惟，不足为奇。最可贵最难做到的是止时的观，得止后的观，这是相当不容易的。真正意义上的止观修行，需要修行一段时间才能修出来。</p><p>可是有些人竟然说不用修定不用修止，就可以观行，那这是什么样子的观行，能观出什么现量境界，得出什么现量结论呢？任何人都有这样所谓的观行，可是于证法，获得智慧和解脱是没有什么益处的，这样的观不能生起观行智和观察智。如今的佛法泛滥得让人摸不清头脑了，用一大堆的巧言妙语包装，说得天花乱坠，可是里面却没有实质的修证内容，不能让人依凭着一步一个脚印踏踏实实修证出来。众生无智，往往被那些华丽的辞藻所迷惑，而不自醒。</p><p>四、定慧齐修的重要性</p><p>奢摩他，是止，也是定；毗钵舍那，是观，也是慧。定慧等持，止观配合，修行才能有所成就，这是菩萨所依止的修行方法。有止无观，有观无止，偏于一方，都不能出生大智慧，无法实证佛法，获得正慧，只可以解悟佛法，获得知识。佛所说的戒定慧三无漏学，止观就是其中之二，也是菩萨六度其中之二。</p><p>若有人长年累月的打坐修定，而不起心思惟参究佛法，永不得证悟，不得解脱。若有人偏于吸收知识，广学多闻，而不修习禅定，心思散乱浮躁，不深入禅观，也永不能实证佛法，最多解悟佛法，获得知识，不能获得智慧，心地不能解脱，不断三缚结。知识永远不能代替证量，但是外行人无法辨别，多是崇拜知识学问的不开眼者。</p><p>五、悟后如何发起初禅定</p><p>初禅定比较难修，必须要有特殊的因缘条件才能修成功。比如刚断我见证声闻初果，以及刚刚明心或者见性，内心喜悦，生起了觉明，烦恼轻微，睡眠少，容易修除五盖。五盖就是财色名食睡或是色声香味触，严格来说就是贪欲、嗔恚、掉悔、睡眠、疑盖。内心对五盖都不贪着，就容易降伏和修除五盖，五盖一降伏，初禅定即可现前。</p><p>如果在证果或者在明心时，禅定的功夫不是很好，内心喜悦不大，觉明时间很短，烦恼没有得到有效的降伏，五盖就不能降伏，初禅定就不能生起。那么过了觉明这段时间，心懈怠了，再去修初禅定，就很困难了。很多人悟后一辈子，也不见有初禅定的影子，所以悟前修好禅定是非常重要的。</p><p>缺少定力和福德，即使明心了，以后的进步都会很慢，定不足而明心了，觉明时间非常短，后续的禅定就不容易生起，贪嗔痴烦恼不能减轻。因为定力不足，观行的智慧也不容易生起，很多法就观行不到。证果和明心，一定要在极好的定力下去获得，然后禅定就能迅速地生起来，借此机会，不久就能修到初禅，过了这个时候，初禅定就不容易生起，二果三果不容易获得，禅宗二三关就不容易过去，那么今世想成为三果人进入初地，就没有指望了。</p><p>六、三昧境界都有甚深禅定</p><p>我们应该学学善财童子，好好思惟一下善财童子为什么能成就的那么快，听闻一个法，深细思惟观行，不久就能证得相应的三昧境界；其证得的标志，三昧现前，身心觉受非常，出现很多具有特殊意义和象征性的境界，表明善财童子的智慧层次很高。如果善财童子不修禅定，没有四禅八定，不可能有深细的观行和思惟，不可能出现各种甚深三昧，显现出一个又一个的禅定和智慧境界，以及各种神异变化。我们如果修行有相应层次的成就，都应该有各种智慧境界的显现，如七住位明心、十住位见性、十行位的阳炎观、十回向位的如梦观等等，都有各种境界显现出来，身心都有各种觉受和变化，来证明自己的修证水平和层次，这是禅定和智慧的结合，缺一不可。否则对所学的法最多是个解，绝对不能证。</p><p><strong>第四节  禅定是证果的先决条件</strong><br/></p><p>一、禅定具足才能很快证果</p><p>阿含经里记载的事例，和大涅槃经里记载的事例，都有真实性，确实是有些外道们在修出四禅八定以后，闻佛讲法，只思考几分钟就断我见、断我执，成为四果阿罗汉，然后就入无余涅槃。这些外道非比寻常，四禅八定的功德非比寻常。我们很多人闻佛法一辈子，都不能断我见，外道有四禅八定，只需要几分钟或者更短时间，不仅断我见，还能断我执，立即就能入无余涅槃，不可思议。大家想想，他们为什么这么利根？因为在他们修行四禅八定当中，意根已经得到降伏，只是还有一个知见上的错解没有厘清，没有断除，一旦断除这个邪见，所有的烦恼和执著，当时就脱落，这就是四禅八定的功德。由此可知，降伏意根的烦恼，与四禅八定的关系非常密切，禅定是非常重要的。</p><p>二、实证的条件之一就是禅定</p><p>有人说：禅定通于外道定，学佛人不应该修外道定，只要有正知见就可以入道了。这个观点是否正确？当然不正确。既然大乘和小乘的修行，都必须要修习禅定，佛陀又反复强调戒定慧三无漏学的重要性，禅定就是必须修的重要内容。又既然佛教所修的禅定，与外道定有共同的部分，是否因为与外道共同，学佛人就要避免共同，而舍弃禅定而不修？这个想法是愚痴的见解。</p><p>因为佛法不离世俗法，外道也要吃饭穿衣、语默言笑，难道学佛人为了避免与外道共就要舍弃穿衣吃饭、语默言笑，才是独特，才是高于外道吗？既然离开与外道共同的禅定，就没有禅定；没有禅定，就不能见道，不能解脱，那么怕与外道共而不修禅定，又是为了哪般？如果连外道都具有的功德受用，所谓的内道都没有，那是不是意味着内道还不如外道强大，不如外道有修行？没有必要的清高，内道人去追求，以至于不得禅定的真实受用，是不是代表着愚痴？愚痴人所具有的所谓的正知见，是否是正知见？请内道人三思！</p><p>也盼望内道人发明一个与外道不共的禅定，让大众共同修行，以获得禅定的功德受用。如果这个与外道不共的禅定，也有禅定的特征，身心也出现舒适、高大、轻灵、轻安、纾缓、愉悦、喜悦、慈悲、祥和、慈柔、少于烦恼、思惟敏捷等等现象，那么对不起，这些现象外道定也都具有，外道们也受用于这些功德，此禅定并没有脱离外道定，还是与外道禅定共，内道人仍然清高得毫无道理。</p><p>正知见固然重要，要想正知见变成自己真正的见地，就需要实证正知见，而实证正知见的方法之一就是禅定。离开禅定的修行，知见永远是知见，任你口若悬河、唾沫翻飞、侃侃而谈、头头是道，这些只不过是知见罢了，最多定义为解悟，仅此而已。望真正想如理实修者，不要仅仅挂其名，而无实质，只在言语口舌上着力，实证不是如此。</p><p>三、有禅定才能证得如来藏</p><p>如来藏体性有些内容很深，我们要反复熏修，才能理解一些，更多的法是在证得如来藏以后，才能慢慢懂得，慢慢观行到。但是佛法的证得必须要在禅定中思惟观行，才能真正证得，否则最多只能理解，理解的毕竟是不可靠的。禅定和观行非常重要。如果没有禅定，很多法就思惟观行不出来，以后讲的深法就不能理解，慢慢就要掉队了。</p><p>大家有时间都应该修禅定，没有禅定，就不能证得佛法，理解的东西毕竟还是属于知识层面的，抵挡不了生死；而深一些的法，没有禅定，根本也理解不了。学佛路上，没有禅定，不能观行佛法，就不能证得如来藏；即使勉强明心，后续的各种观行也做不到，那就不能圆满各个果位的修行内容，往后的修行路就走不通了，或者走得非常慢，所以大家一定要努力修定。</p><p>四、毕陵伽婆蹉尊者的证果经历</p><p>楞严经中毕陵伽婆蹉尊者在身体中毒刺时，摄念不久身心忽空，证得无生忍。这时尊者意识的心念肯定是收摄了，不缘疑情以外的法，甚至也不缘身体，不知道有身体的存在了。意根的心念也收摄了，否则意识就收摄不了，必随意根攀缘。因为意根收摄不缘其他法，身体和识心都空了，这不仅仅是禅定中的无，也是思想观念上的空，是证得身心不是我的证果境界。而收摄身心就是禅定，之后更深的禅定出现了，身心无我的智慧开发出来了。</p><p>如果没有禅定，是否能有真正的智慧出生？不可能。即使有所谓的智慧，也是乾慧，属于知解宗徒。现在到处如是知解宗徒，不知道能不能教也。六祖那时候骂神会和尚，就等于骂现在的人一样，况且还不如神会和尚那般的知解，如今的人却都不知道觉悟，学法都在意识的情思意解上，没有办法实证。</p><p>五、各种层次的果证，都是三昧，因此都必须有禅定境界和智慧境界，缺一不可。 我有一次一边跟人谈话，一边缝纫僧服，结果就发现僧服缝反了。缝纫衣服这样简单的事，几乎不用思惟，注意力不够集中就缝错了，那么断我见明心这样天大的事，比天还要大的事，为什么不用禅定就能成就呢？这么轻松容易呢？ 事情多的时候，内心就会不太安定，这时候整理书稿，思惟就紊乱不够清晰，我就不得不静坐一会儿安下心来，才去校对书稿。那么断我见和明心这样的生死大事，关乎生生世世无量劫的大事，不用禅定或者是少定，怎么就能解决得了呢？</p><p>六、如果没有禅定，各种观行一个都不能过关，尽管自己认为一切法都如梦如幻，即使意识知道了一切法如梦如幻，意根也绝对无法证得，那么就会说是说做是做，况且意识也不是真正证得了这些理，证据都不足。</p><p>从禅宗第三关开始，往后的如梦观、如境观等等都必须具足初禅定，才能过关。之前的所有观行包括断我见，必须具足未到地定，否则哪关也过不去。如果有人认为自己断我见了，还没有未到地定，那么自己应该仔细考量这件事是否可靠，临命终就是一大生死关，丝毫含糊不得。</p><p>七、如果缺少观行的定力，参考解剖图来观行色身虚妄无我，不管观到什么时候，解剖图还是解剖图，你还是你，没有什么作用，只是多了人体解剖学的知识而已。对解剖学侃侃而谈，也不代表自己有断身见的智慧证量。说归说，没有定，就谈不到观行，只是学习而已。止观双运，定慧等持，才是真正的修行入手处。学习理论知识，与实际观行，是两个修行次第。千万不可把学习理论当作观行，然后把背诵的知识当作是自己的智慧。</p><p>未到地定不具足，甚至一点禅定也没有的人，而说自己断我见了，是初果二果之类的，那是不可能的。内心不会有那种确认的，即使意识也许能确认，但内心深处还是有疑，不敢真正确认。</p><p>八、实证佛法必须修定</p><p>如果每个人都能按照大念住经的方法修行，小乘很快就能成就，禅定肯定能成就。可是现在人心太散了，无法完成这些观行。佛陀住世时，比丘们都是这样修行的。现在来看，我们修行需要的大小乘理论部分已经差不多够用了，差只差在实际操作，实际操作必须修习戒定慧，完成菩萨六度修行，尤其是福德和禅定两方面修行。个人修行困难，就得要共修了。佛陀在世，从来没有领着弟子共修过，都是各人盘腿打坐观行思惟佛所讲过的法，然后就证果。</p><p>现代人生活工作太忙，无时间打坐，可是禅定确实修不上去，思惟肤浅不细密，无法实证，这也是事实。静坐以后的定，与只有行走坐卧的定，之间的差距之大，只有静坐过的人才能体会得到。自己想办法，自己要对自己要负责任。不是说懂得一大堆理论，就是有道了，能侃侃而谈就是有道了。实证之后，即使不是能言善辩，那也有道；能言善辩而没有实证，也不是道。</p><p>实证才能解决生死大问题，没有任何一个法能比道业更重要了，宁死也要道业成就，否则活着时世俗法再成功，也没有什么用。</p><p><strong>第五节  解脱离不开禅定</strong><br/></p><p>一、阿罗汉的解脱离不开禅定</p><p>有一部分阿罗汉是靠智慧解脱出离三界的，是慧解脱阿罗汉，他们只有初禅定，没有更深的禅定，也没有神通境界，命终依自己断除三界贪爱的智慧而出离三界，不被三界之法所束缚。首先慧解脱阿罗汉都断了我见，否定了五阴十八界是真实不灭的自我以后，再证得初禅定，断除了烦恼，断除了对三界世间的所有贪爱，三界世间里没有一法是他们所留恋的，对自我五阴世间的执著已经去除，命终他们就有能力灭掉自己的五阴，入无余涅槃。</p><p>还有一部分阿罗汉是俱解脱阿罗汉，不仅有解脱的智慧，还有四禅八定，以及灭尽定，最后依靠智慧和禅定出离三界生死轮回，得到解脱。大多数阿罗汉是慧解脱的阿罗汉，不依赖禅定而得解脱；但是慧解脱的阿罗汉有初禅定，也非不依赖禅定而解脱。所以要想解脱，只靠打坐修禅定是不能得解脱的，只靠智慧没有禅定也不能得解脱。</p><p>二、禅定和智慧对于解脱的重要性</p><p>四禅八定就是色界四禅天的定再加上四空定，四禅八定通于佛教和外道。外道不懂佛教修证之理，却想解脱生死，出离生死轮回苦，由于他们有出离心，已修除五盖，禅定就能够达到三界世俗的最高定非想非非想定。世尊的外道老师及世尊临涅槃时最后度的外道弟子都修到这种无色界的最高定，命终都生到非想非非想天享受天福。但是他们仍然在三界当中轮回，仍然不免下三恶道，所以只有禅定的人，是不能解脱生死的。</p><p>解脱要靠智慧，有智慧才能出离三界生死轮回。这个智慧的获得，必须依循世尊所教导的解脱之理，首先要断我见，认可五阴十八界非我、不异我、不相在。并且也了知认可各种识心的禅定境界也非我、非真实法。断我见以后，禅定只要达到初禅就可以断贪爱，断嗔恚，烦恼断尽，就知道如何出离三界，命终怎样灭掉自己的五阴十八界。这是慧解脱的阿罗汉所修证得的。</p><p>解脱之理是，听闻世尊教法，先断了我见，再依赖自己的禅定断除烦恼，命终就能灭掉自己五阴，入无余涅槃。俱解脱的阿罗汉兼具慧解脱和定解脱，有定有慧，能入灭尽定，可以随时灭掉自己，提前舍寿，也可以延后舍寿，寿命由自己掌握，他们都是三明六通的大阿罗汉。</p><p>由此可见，智慧对于修证小乘解脱之道来说非常重要，对于修学大乘成就佛道来说就倍加的重要。佛法修行，主要是修智慧，靠智慧来解脱，靠智慧来成佛。但是智慧的增长，需要定力作为辅助手段，没有定不行，定浅了也不行。如果不具备初禅定，就不能成为三四果人，不能得解脱。没有初禅定，不断烦恼，就不是三果人，那么修学大乘开悟以后也不能入初地，不能成为初地菩萨，不能入如来家，成真佛子。而三地菩萨的四禅八定五神通不修出来，就不能入四地，成不了四地以上的菩萨。</p><p>由此看来定力和智慧同等重要，那就要知道何时修定，修什么定才能有助于修道。定浅了，不能观行出生智慧，定深了心就沉没不能观行，障碍智慧的生起。证三四果以后，如果菩萨心性较弱，成佛之心不强，就容易走小乘的无余涅槃之路，定深了一不小心就会入无余涅槃，那就没办法成就佛道。所以在证果开悟之前，修到初禅定或者初禅之前的未到地定就可以了，这样也能够作小乘和大乘法的观行，比较容易生起智慧。修到三地菩萨的果位时，则必须要加修四禅八定五神通和四无量心，才能三地满心而进入四地。</p><p>要想观行和思惟法理，一定要有未到地定的功夫，定力不足，心容易散乱，无法观行，或者有观行也很粗浅不深细，所得的智慧就不深细。如果修无心定，总是处于无心状态，那也不能观行，虽然身心感受是舒适的，烦恼能得到降伏，却不能获得智慧，那个禅定就与佛法修行无关。古代的禅师们都很反对修无心定，说那是坐在黑山鬼窟中，百无所思，什么也不能成就，无心于事，无事于心，什么也不能成就，即使是修得神通，说走就走了，说投生哪里就投生到哪里，也不能成就什么。我们明白此理以后就应该好好拣择一下，如何修定成就最快最大。</p><p>三、为什么有甚深禅定，心就能得大自在呢？</p><p>禅定也叫作制心一处，而制心一处，无事不办。外道能制心一处，阿罗汉辟支佛也能制心一处，诸大菩萨能制心一处，诸佛更能制心一处，都能使心得自在，都能相应的随心所欲，都能成就相应的事业。但是由于禅定深浅程度不同，智慧不同，心量不同，心的自在程度就不同，成就的事业就有所不同。</p><p>一般人对禅定的理解是，定是一种束缚，是一种约束，束缚身体头脚四肢，约束心灵自在遐想。可是如果身体不受束缚，四处游荡，力量四处分散，就不会有一种强大的力量去变化和改变一切法；如果心灵不受约束，任意遐想八方分散，就没有一种强大的力量去指挥和创造一切法。这样身心就会永远受环境的约束，反而不自在了，更何况大自在。</p><p>在修定的最初阶段，身体是受到了束缚，心灵也受到了约束，可是随着禅定的逐渐深入，身体上的四大发生变化，气血通畅，就会感觉很舒服，不再受地水火风四大的约束，而越来越轻安和自在；同时心灵也不再受色身和境界的束缚，而越来越恬淡和快乐，也越来越自在，越来越有力量。</p><p>得自在和解脱的心是哪个呢？最开始是六识心，五识不受身体内外五尘境的束缚而感觉苦痛，意识不受法尘的约束而感觉烦恼。逐渐意根不受色身内外境的束缚，也不随意攀缘尘境，渐渐集中于一处，力量集中，心力增强。那么这时候意根想要什么境界，什么境界就会现前，如来藏随祂护持祂，意根就会利用六识和如来藏改变一切法，变化一切世间。但是禅定越深，六识的功能作用越小，最后可以不用六识，意根带着如来藏随意天上地下，十世古今任意遨游，不受任何约束，得到了大自在，这就是解脱。</p><p>所以解脱一丝一毫都离不开禅定，也离不开大智慧。最初也离不开戒律。虽然说戒律一开始能约束身心，让身心不像从前一样的自在随心所欲，但那样的自在随心所欲就是不自在，能造作恶业，感召苦报。一旦身心习惯于戒律，不再造作恶业，身心就不会感到戒律的约束，而随时随地感到自在，不会感觉到戒律的存在和约束。</p><p>就像最初制定的交通规则是左侧通行，众生任性惯了，左右中间随意走，不愿意靠左侧通行，这时候是感觉交通规则的约束不自在的。等到习惯于交通规则以后，自然而然的就左侧通行，丝毫感觉不到约束，这时候才是真正的自在，并且能保障通行安全。从前不守交通规则的所谓自在其实是不自在的，不能保障人身安全。</p><p>对于一切法则，不习惯的时候就觉得是一种约束，习惯了就会感到自在了，没有约束感。修行是让众生具有好的习惯善的习惯，以改变过去坏习惯和恶习惯。好习惯善习惯是一种解脱，坏习惯恶习惯是束缚和不解脱，能遭受苦果。</p><p>有些人不愿意受五戒，更不愿意受菩萨戒，害怕戒律的束缚。可是佛陀说戒律能带给众生解脱，叫作别解脱戒，守一条戒，于此戒就自在，少造一种恶业，身心就得到一种解脱。习惯于守戒，就不会感觉到有戒律的存在和制约，也没有守戒的思想观念，这就于戒自在了，能随心所欲而不逾矩。</p><p>诸佛菩萨久远长劫的守戒，早已经不受戒律的约束了，所以诸佛菩萨们都不守戒，也不犯戒。佛是无戒者，所以是最大的自在解脱者。凡夫必须经过受戒和守戒的修行阶段，一旦习惯于戒律，也就不再受戒律的束缚而如诸佛菩萨一样自在解脱了。</p><p>四、初禅定不是心解脱的唯一条件</p><p>仅仅获得初禅，不是心解脱，也不能得心解脱。有初禅定只能降伏烦恼，并不能断除烦恼，所以不能得到心解脱。单纯的初禅定和解脱没有必然联系，心解脱的条件和标准是有断我见的功德受用，再加初禅定，二者缺一不可。</p><p>断我见之后，在初禅定中，就能依次断除贪欲和嗔恚两种烦恼，心就解脱于欲界的贪欲和嗔恚，不被这两种烦恼系缚，叫作心解脱的三果圣人阿那含。但还有色界和无色界的愚痴没有断除，如果三界的愚痴无明烦恼断尽以后，就是智慧解脱的四果圣人阿罗汉。三四果人的大乘菩萨，将来才有资格成为初地以上的圣人。</p><p>所以不修禅定，没有任何一种三昧境界，不能得解脱，更不能成佛，不断除我见同样不能解脱，更不能成佛。这两个关卡，在初地和三果人之前，必须通过去，无论如何也绕不过去，躲不过去，无论修出什么花样来。即使把三藏十二部经讲得天花乱坠，不过这两个关口，与解脱和成佛都无关，与真实证量也无关。无论口头智慧有多高，高到佛地，两个关口一个都不能跨越过去，都必须经过。否则就叫作高谈阔论，与解脱涅槃成佛都无关。</p><p>心解脱的条件是具备较好的禅定功夫作为基础，意根在较好的禅定中，通过意识的辅助作覌行，证得五蕴虚妄，然后断了我见，不再死死执着色身，意根就获得最初步的解脱，有初果的解脱功德受用。</p><p>解脱实际是解脱意根，是意根被无明系缚，是意根轮回生死。如果不破除意根的无明，只破除六识的无明，到死亡时，意根被无明牵引，就要继续沉沦生死苦海，那时六识都消失得无影无踪了，根本不能到后世去。那时意识有无明和无无明都无所谓了，只是在五阴身在世时，无无明的意识能有效的熏染意根，让意根也破除无明，无无明。如果意识在五阴活着时有无明，就不能熏染意根让意根破除无明，意根仍然要作主造作身口意恶行，就会留下未来世的恶业种子，免不了继续受生死轮回苦。</p><p>五、单纯的四禅八定不能脱离生死轮回</p><p>从古至今修出过四禅八定的人可能不少，但是单纯的四禅八定，并不能使众生脱离生死轮回得到解脱，因为还把五阴当中的某一法当作自己而执著着，因此就被所执著的法而束缚住，不得解脱；当定力消失的时候，又要下堕，回到人间或者是三恶道。那么怎么样才能脱离生死得解脱呢？只有在相当好的定力的支持下断除我见和我执，证解脱果，才能出离生死轮回，得到解脱，别无他路。</p><p>为什么众生要那么努力的修禅定呢？就是因为众生都以为禅定能够让自己得到解脱，不知道断我见，断除五阴中的各种我的知见，是得解脱的因；不知道灭掉各种觉知心的我，才能得涅槃，得解脱，出轮回。所以修学佛法，获得正知见，最为重要；以佛法的正理来指导修行，如法修行，才能修行成就。</p><p> <strong>第六节  历劫以来的成就者都具足禅定</strong></p><p>一、坐禅三昧经里教的思惟方式，就是教导观行，思路清晰，只是比较粗燥一些。禅定加观行，足以证果和证得各种三昧，定慧齐修。佛陀在世时比丘们修行也是禅定中观行，比丘们闻法之后，一边修禅定，一边思惟观行，然后就证果，那时就是这个修行路线，效率很高。唐朝宋朝时也是这样，大众们都有很深的禅定，都会参禅，禅师上堂开示时，时节因缘具足就有人明心见性。</p><p>而外道们个个都有禅定功夫，遇见世尊时，世尊一讲法，他们就能马上思惟观行，当时就证果了。所以不要看人家最后一个证果的程序是闻法当下获得智慧，在这之前，禅定已经成就了，心已经清净了，三十七道品也修出来了，就差正知见，世尊讲法就补足了他们的正知见，于是闻法当下证果。我们不要看人家最后的成果，要观察他们所修行的过程，过程很重要，没有如理的过程，也就不可能有正确的果证。</p><p>过去禅宗祖师都是修定高手，个个都有禅定，菩萨六度都已经修好了，修行的过程都已经完成了，禅师上堂开示，座下弟子就悟，果是这样出现的。我们不能只看成就的人的结果，最主要的是要看人家的修行过程，包括前世都修到什么程度了，如何修行的，有什么样的根基。根基已经打好的人，闻法当下就能顿悟，不用渐修，因为从前或者是前世已经渐修过了，那段路程已经走完了。对修行人的修行过程只截取最后一段，那是严重的断章取义，害人不浅。</p><p>初学佛的人，应该多读一些佛陀的本生事迹，参考一下佛陀从初发心开始修行的路程，对我们应该有很大的启发。学佛学佛，就是应该学佛陀所修和教导的一切法，走佛陀所走过的足迹。</p><p>    二、阿含经里记载的事例，和大涅槃经里记载的事例，都有真实性，确实是有些外道们在修出四禅八定以后，闻佛讲法，只思考几分钟就断我见、断我执，成为四果俱解脱的大阿罗汉，然后就入无余涅槃。这些外道非比寻常，四禅八定的功德非比寻常。我们很多人闻佛法一辈子，都不能断我见，外道有四禅八定，只需要几分钟或者更短时间，不仅断我见，还能断我执，立即就能入无余涅槃，确实不可思议。</p><p>大家想想，他们为什么这么利根？因为在他们修行四禅八定过程当中，因为有这样深的禅定，意识心非常细密非常灵敏，意根已经得到了降伏，只是还有一个知见上的错解没有厘清没有断除，一旦断除这个邪见，所有的烦恼和执著当时就脱落，这就是四禅八定的功德。由此可知，降伏意根的烦恼，与四禅八定的关系非常密切，禅定是非常重要的。</p><p>虽然能读万卷书，而不知其意，也不是真正的精进。学法的根本目的，是获取智慧，不是为了收藏无数的知识和学问，不是为学而学，更不是学给他人看的。所以为了获得智慧，我们要做什么，如何做，是应该要用心思考的。学佛人，是学佛的心和行，不是要收集所有佛的语言，而是通过佛的语言，了解佛的心，然后学习佛的心，效仿佛的行，最终才能与佛平等无二，慈悲于人。</p><p>三、从楞严经二十五圣的修行来看，过去的修道人修行都很务实，学习的理论并不是很多，他们稍微熏习了一些理论，马上就去禅定中实际观修，修行都是以禅定和观行为主，修定和参究占据了修行的百分之八十还多，修行非常踏实，所以他们很快就能证理，获得三昧，成就的很快，证理的多，说理的很少。</p><p>如今的人却相反，把百分之九十以上的精力都用来学理论知识，复述背诵能力强，却没有独自修行的能力，不喜欢修定，心思繁乱得也修不出禅定，观行只靠意识的情思意解，认为自己懂得多就有道了，知道一个相似的答案就是证得了，全然不知知解宗徒和说食不饱的后果是什么。然后著书立说，广收徒众，丝毫不考虑会不会误人子弟，把众生引向歧途。这是末世众生思想浮躁，思惟浅薄的结果，放眼望去，都是说理的说客，几乎见不到证理的道者。众生越不具福德，这些现象越严重。这些事说多了惹人恨遭人骂，想要复古遵从古仙人修行足迹太难太难，没有几个人能意识到佛教存在着很大的危机，不良现象有多严重。</p><p>在世俗界各行各业里，凡是有所成就的人，都是具有相当禅定的人，他们在定中专心一意，别无他顾，很容易出现灵感和创意，就会成为别人眼中的天才和成就者。这里所说的灵感和创意，一般都来自于意根，只是最初由意识的构思和情思意解，但是到最后意识就使不上力了，却激发出了意根的智慧和潜能，一个优秀的作品就出来了。在甚深禅定中的思惟创作，远远超异于没有禅定的普通人意识的情思意解，这就是天才区别于常人的特异之处。</p></div>"
},{
    "title": "第六章 修定中出现的问题",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  修定中出现的问题</strong></p><p><strong>第一节  观呼吸的问题</strong></p><p>一、问：打坐观出入息，到后来只有观的念头存在，没有观的对象出入息，入定差不多一个小时，这样修对吗？</p><p>答：能观，是见分，所观，是相分。只要有能观，就有所观，观的结果，叫作自证分。心里有观，却没有呼吸，那就有其它的相分存在。如果只有独头意识的观，却不知道观了什么，这是意识没有反观力了，说明是入定了。观呼吸的目的，是为了摄心，为了把心定在一处，一得定，二出生观慧，以证得法。那么观里没有呼吸，却观的很好，心很定，也达到一定的目的了，没有什么不对。当定力很好的时候，再把心移动到观呼吸上，继续观呼吸，以证得呼吸生灭变异无常，非我非我所。</p><p>不管什么样的禅定，外道定也好，内道定也好，摄心为戒，只管拿过来用，心摄住以后，再在定中观行佛法，都无可非议。佛陀所修的四禅八定就是外道定，然后在四禅定中思惟佛法，证得了阿耨多罗三藐三菩提。没有与外道共的四禅八定，诸佛都不能成佛，凡夫不能证得菩提成为菩萨。不管黑猫白猫，抓到耗子就是好猫。</p><p>修定是为了有观行慧，有观行慧能证得佛法，出生大智慧。不必在意什么定，怎样定，定下来就好，总比凡夫心处处攀缘好。目标定下来，奔着目标而去，不用在意走水陆和旱路，是直路就行。外道的色身与学佛人的色身是一样的，学佛人的心与外道不学佛人的心是一样的，如果为了降伏其心，世俗的心理学生理学，同样适用于学佛人，调伏心最重要。</p><p>修定是为了观行，观行是为了出生智慧。而出生智慧不在乎一个小时的时间，如果能入无心定一个小时，没有思惟，可是出定以后，身心舒畅，觉受非常，一天当中身体舒服，心情舒畅，不生烦恼，思惟灵敏，反应敏捷，应对人事都很有智慧，也有修养和涵养，品德提高，何乐而不为？禅定就是用来调伏身心世界，提升人品修养的，即养心又养道，何乐而不为？  </p><p>二、问：是不是定加深时呼吸会变的缓慢和短，呼吸间隔的时间长？而且最近观行思惟法义、<span>经常出现观行到半路就没有语言文字的卡在那里，感觉跟前面的思惟的内容有点接不上。</span></p><p>答：禅定越来越深的时候，意根因为有定，就放松了对身体的控制，也不太控制呼吸了，对呼吸不太执著，呼吸就越来越轻微舒缓，呼吸时间加长，中间好像停止了似的，误会为呼吸间隔时间短。因为呼吸轻微，就错误觉得呼吸要断了似的，实际上是呼吸一口气儿需要的时间长了，非常缓慢了。感觉是非常的慢，非常的轻，非常的深。感觉要断的时候，内心紧张，就会加快呼吸，才感觉呼吸短。四禅定里才能断掉呼吸，在四禅之前仍然有呼吸，只是有可能感觉像是要断了似的，中间间隔拉长了，这个时候思惟也要断，思惟很缓慢，感觉很累，空却大脑才感觉舒服。</p><p>在定中思惟定深的时候，意根不愿意攀缘什么法，意识就运行的非常缓慢，感觉意识要灭，就不想有语言文字了，觉得多余和烦累。心行越来越缓慢时，就不愿意想问题，妄念也少，有妄念也累。意识无所造作，意根的作用就突出出来了，因为意识思惟活跃时，意根的作用就掩盖住了。禅定深时，意根的作用就突出出来，就会发现这个时候心里没有语言文字。但是意识没有语言文字，意根出来也是没有语言文字的，意识不动和少动的时候意根的作用就非常突出和明显了。<span> </span></p><p><strong>第二节  静坐中身体方面的问题</strong></p><p>一、定中为什么面部容易痒</p><p>问：打坐修定观呼吸，心比较定时，感觉呼吸非常微弱，慢慢过段时间，鼻子附近，鼻翼两侧、嘴唇都特别痒，痒得受不了，这是什么原因？</p><p>答：心比较定时，由于意识的注意力集中，缘于一境，那么也牵制意根缘于此法尘上，对其他法尘就少缘或者不缘，对身根的控制力就弱了，身体里的气脉就会运行起来，经络不通有阻碍之处，就会出现障碍，显现出一些病状，气脉通过去就没有了。如果观呼吸时，意识的注意力在鼻翼左右，气脉也被牵引到那里，因为那里有毛病，有阻碍，气脉一时通不过去，就觉得痒。当意识定于一处，意根也牵引着，就不再执身，就可获得身心的轻安和舒适，出现各种胜境，心情很愉快。</p><p>二、定中后背为什么是笔直的？</p><p>问：我们打坐修定的时候，脖子不歪、腰挺直；但是如果不是入定，而是睡着，身体就歪了。入定与睡着时第七识都在，区别的就是入定的时候第六识在，睡着的时候第六识说不定暂停。可见，身体等五根还是第六识控制，第七识不控制；如果第七识还控制的话，睡着了应该还是笔直的。是这样吧？</p><p>答：第八识有持身的功能作用，意根有控制色身的功能作用，六识也有持身的功能作用。如果六识消失，就不能持身，不能保持身体的直立状态，所以身体要东倒西歪。意根控制身体不是全部都能控制，需要六识配合，六识是意根的工具。有六识和无六识，意根对身体的控制程度就不同。有六识时，意根能指挥六识的身行，和六识共同控制身根，就能保持身体的笔直状态。睡着时就不行了，意根肯定要让六识灭失，让色身充分休息，这时意根就不能指挥六识保持色身的某种状态。</p><p>无想定里，也没有六识，灭尽定里也没有六识，身体却不会东倒西歪，可见意根是持身的。意根若不持身，第八识就离开，众生就死亡。睡着时东倒西歪，是因为意根想让身体休息，不让六识持身，自己也少于攀缘；入定时有定支撑就不一样了，所以长期入定不睡觉，身体也受不了。</p><p>三、问：这两天打坐念佛，原先是念着念着，念头就在眼前消失念不出来了，昨天开始感觉这念头从肚脐下面消失，这样下去会不会出偏差？</p><p>答：这只是注意力问题，注意力在哪里，就感觉念头在哪里。意守丹田，气到丹田，身体气脉通，心念清净，容易不起念头。所以不会出偏差。</p><p>四、问：静坐中为什么会出现身体高大的现象？</p><p>答：有粗浅的禅定时，身体出现一些膨大的现象，这是意根执身减轻所出现的现象，心跳出人间，稍微与欲界天人相应的反应。只要抛弃人间的境界，淡化人间的五欲执着，必然就有天人的境界出现。</p><p>色界初禅定之前的定，都属于未到初禅的定，分为多种层次，心不同，定的粗浅层次就不同，但多多少少都与欲界天人境界相应，越远离人间的五欲，定越深，身体变化越大，身心觉受越舒服。所以我们应该知道，离开人间的欲望，就会更自在一些，一切感受都是美好的。贪着人间的六尘境界五欲生活，该有多么的不智，人间的生活该有多么的下劣和不堪。</p><p>无数人都贪着喜爱人间的花花草草、山河大地、人事物理，以拥有人间的权利、地位、财色、家亲眷属而自豪自傲，其实与天人的殊胜境界相较很低劣粗陋，根本没有任何可值得骄傲傲慢的，目光短浅没有见过大世面的人才会如此。</p><p>五、问：在禅定中气脉有什么作用？</p><p>答：气脉，是心静下来以后身体的气机发动现象，它在身体中有规律运行，疏通筋骨、脉络、肌肉和内脏。它就像是一个探病器，比医院中的各种检查仪器还要灵敏，还要准确。仪器只能查出已经存有的病状，但有时还不准。而气脉能够检查出身体中隐藏的各种疾病，这些疾病如果不静坐就发现不了，可能要在几年以后或者要在晚年才能发作或者显现。当气脉运行到隐藏疾病的地方，就因堵塞而过不去，身体就会出现病痛，气脉能慢慢给予调整，稍微疏通一下，气脉就过去了，但病不一定马上就完全好。    </p><p>气脉的运行能够探测出疾病来，身体有疾病堵塞的地方气脉就过不去，堵在那里，那个地方就痛，病消了就不痛。或者病没有好，心乱时气机就不能发动，没有气脉的运行，身体也不痛了，但病没有消。严重的疾病，气脉要经过好多次的反复调整，不知要经过多久的时间，疾病才能彻底根除。人的色身因为业障的关系，随着年龄的增长逐步在衰老，隐藏的疾病就会越来越多，很多时候自己都发现不了，还自以为很健康。</p><p>人体有三脉七轮，气脉就按照这些脉络来运行。任脉从头顶，经过五脏六腑内脏器官一直到会阴。督脉从会阴经过后背，到头顶。这样循环一圈就是气功讲的小周天。然后气脉循环到会阴再经过中脉，走身体中间的脉络，到头顶，从头顶出去后，整个经络脉络都打通了，身体百病皆消。身体素质越好，心就越静，气脉运行就越顺畅，身体就越健康。气脉运行的状况，每个人不尽相同，这期间要经历很多病痛的折磨，如果采取相应的对治措施，就能让身体尽快好转起来。<span> </span></p><p><strong>第三节  静坐中心念的问题</strong></p><p>一、问：如何处理打坐中出现的问题？</p><p>答：在打坐修定时，如果心中有事，不空净，心里一直攀缘不停，这时要想心清静坐得安稳是不太可能的。因为意根喜欢到处攀缘，心里惦念某些事，心中就妄念不断，所有事都是意根攀缘出来的。所以要想修好禅定，先要把心里的念头打扫打扫，先检查一下自己心里有什么事情还没有放下，有什么事情还惦记着。凡是心中惦记着的事情，先把它给处理好安排好，然后心里就不要再惦念了，全部放下，不要让自己受到这些事情的影响。处理好之后再盘腿打坐，心就能清净了。只要意根心里惦记着一件事，意识心再想静下来，也不太容易，这件事就能影响到你。</p><p>打完坐以后，如果体内有残留的气，有气脉不通阻滞的地方，要想办法把气排出去，最好观想气从头顶出去，然后再搓搓手，搓搓头顶，感觉哪个地方不舒服时，气可能停留在那里，你就按摩按摩那个地方，然后观想气从那个地方散出去，按摩按摩、疏通疏通，拍一拍身体，气出去，身体就舒服了。</p><p>打坐的时候如果容易昏沉、容易入睡，要想改变这种情况，一是要减少饮食，不要吃得太多，或者吃完饭消化到一定时候再打坐，不要吃饱了就去打坐。打坐修定的人一定要少食，一般七分饱就可以了，吃太多影响禅定，头脑容易昏沉，心就不清明了。而且少食对身体也好，减少身体里胃的负担，如果胃总在工作运动，就要不停地摩擦，容易磨损受损耗，导致身体的其他部位也被损耗，所以还是少食为好。少吃一些饮食，对身体没有什么影响，多吃反而对身体不好，让身体的脏器负担过重，内脏器官消耗就快，人就老得快、寿命就不太长了。</p><p>二是要错过容易昏沉的时间，如果每天都有容易昏沉的某个时间段，那个时候就不要打坐，换个时间再坐。三是打坐昏沉的时候，如果心比较沉闷，可以修观想，观想一个有趣的境界，自己非常感兴趣的情景，把心的积极性调动起来，让心活跃起来。由于对这件事情感兴趣，所有的注意力都会被集中到这一件事上来，你就有精神，能克服昏沉，然后再按原来的修定方法接续修行。</p><p>每当昏沉时，说明你的观慧不足了，那就要修观想。如果你的心太活跃时，心不能止下来，可以用调整呼吸的方法，把呼吸引到下丹田，气息一到丹田的时候，思惟就不再活跃，没有妄想了，那个时候入静入定都比较快。这些方法可以随时随地调用，当出现各种症状时，要善于用相应的方法来调整对治。还要注意随时随地总结经验，当经验累积多了，你就能有办法调整对治，那么修定就没有障碍，入定比较快。</p><p>  二、问：观想时觉得妄念越来越多是怎么回事？</p><p>答：妄念本来就是虚妄的，你再去对治虚妄的法，对治的心本身还是虚妄的，对治的时候心就不清净了，然后再想把能对治的心灭掉，又多了一层虚妄，这样妄上加妄，何时了？</p><p>观想佛像，这是心的目标，是正行，你只管盯着目标，不要管目标以外的东西。就像本来要去北京，结果被一路上的风景所迷住了，不断的欣赏路边的风景，何时能到达北京？</p><p>没有禅定的时候，心散乱，因为心散乱，就发现不了自己心散乱。一旦把心收回一点，静下来一点，才能发现原来自己的心是散乱不清净的。有所发现才说明自己心觉悟了，发现不了自己有妄念，那个心就没有觉悟。是发现有妄念好还是发现不了妄念好？</p><p>就像愚痴的人，永远不知道自己是愚痴的，别人指出他的愚痴来，他不但不承认，还起嗔心报复人，这样是不是更愚痴？愚痴的人一旦觉悟了，就会发现自己原来是这样的愚痴，知道自己愚痴，才会想办法对治，才会变得聪明。如果一个人连自己愚痴都不知道，那什么时候能变得聪明一点呢？</p><p>当一个人肯承认自己种种的不好，种种过错，才会是觉醒的人，一旦觉醒就会慢慢改正自己的缺点和过错，才能开始进步。如果连过错都不承认，怎么能指望他改正过错呢？那就只好一直带着过错，一错到底了。</p><p>三、问：打坐时出现幻觉怎么办？</p><p>答：一切法都是幻化不实的，即使我们感觉非常真实的法也是不实幻化的。那么打坐时出现的幻觉更是幻化，幻上加幻，那就不需要去做什么对待和对治，不理就好，幻化的境界会自动消失不见，幻觉也就没有了。</p><p>过去有人打坐入定，看见有人拿刀要杀自己，他把那个人当作了真实，为了自卫，就拿刀刺向那个人，出定以后发现自己身上有刀痕，还出血了，于是就明白自己被假象骗了，非常懊悔。还有人打坐把境界当真，入到境界中，结果入了魔。</p><p>在打坐修定中，应该有正确的理念，无论定中出现什么境界和感觉，全部都是幻化不真的，一律不理睬就安全无恙了。心静的人，打坐时不容易出现境界，心有所想和所执才容易出现境界，才有种种幻化的觉受。平时应该训练自己不着相，不着境，心空无念想，打坐时入定快，也不会出现境界。</p><p>四、问：入定时对外界是否有感知？</p><p>答：定可分为很多种层次，粗浅的定是欲界定，心稍微平和一些，清净一些，杂念少一些，色身轻灵一些，在这个定里仍然有六识能了别六尘，有六识对六尘的感知和思惟，也有身口意行为，那就能待人接物。欲界的未到地定中，心能专一思惟，能作到无杂念，心更清净，色身更轻灵，也有六识对六尘的感知和思惟，也有身口意行为，那就能待人接物。在色界初禅定中，心念更加清净专一，六识中没有了鼻识和舌识，剩下的眼耳身意四个识仍然能了别四尘，仍然有对四尘的感知和思想。处在这几种定中，都可以待人接物，烦恼轻微，思惟敏捷。二禅以上的定，就不能待人接物，因为五识没有了，身体不能动，不能了别色声香味触，不能有身行和口行。</p><p>修行当中有禅定现前时，心的功能得到开发和扩展，色阴的阻碍就变小了，原来闭着眼睛，眼前是黑暗的，现在闭着眼睛也能看见眼前的光明。实际上眼睛不管闭与不闭、睡与不睡，如来藏都要通过眼根传导色尘，只是在于识心的分别能力如何，是否被色阴所遮障。睡着时仍然有外色尘不断传导到胜义根中，譬如早晨有时候我们是被强烈阳光刺激醒过来的，这是因为先有胜义根里的色尘和法尘，后出生了眼识和意识，于是就醒过来了。打坐有定时，眼前并不黑暗，而是有一定的光明，至于是什么样的光明，亮到什么程度，就在于禅定的深浅程度。</p><p>五、问：为什么打坐的时候，容易把问题思考明白，意根容易受熏染？</p><p>答：因为打坐时，意识静下来时不再散乱妄想，心专注思考问题，就能明了问题解决问题。打坐时，意识专心思考问题，意根少攀缘，就能明了意识所思所想，容易受到意识的熏染，同时意根也可以思量意识所思考的问题，容易明理，理通的也快。</p><p>六、问：是不是没有正思惟的定就是邪定？有时候会碰到呆呆的转不动念头的情况，也思惟不了，也念不了佛，这样的情况是要离开的吧？</p><p>答：一般把外道修的定叫作邪定，外道入定以后不思惟解脱的真理，以为定中不起心就能得解脱，在定中不能出生解脱智慧。所以说长期入定不起思惟，不观行解脱之理，不参禅悟道，其定就不是正定。但是在短时间内在定中没有思惟不属于邪定，以为没有思惟的禅定能调伏身心，滋养身心，降伏烦恼，之后才能很好的利用禅定思惟观行佛法，证果会很快。</p><p>禅定很重要，能澄净自心，降伏烦恼和性障，能使心定于法上起思量，从而生起大智慧。定分很多种，也有各种层次上的转折。目前来说能有定已经是很可贵了，心稳定以后再找时机把心转换成能思惟佛法的定就行了，不必刻意厌弃和躲避枯定，好好利用枯定转变身心，再变幻定的方式就可以了。一般人也无法每天十多个小时的正思惟，那是很累心的，适当的呆呆发愣，也是非常养心养身养神的。   </p><p>七、问：为什么有禅定时，识种子流注的越来越少，识心的了别越来越弱？是谁决定要了别，是谁决定少了别和不了别？</p><p>答：因为在禅定里，意根由于意识的牵引作用被束缚在特定的境界上，于是意根就不再处处攀缘其他尘境，这样如来藏就不会在其他尘境上出生意识和五识，六识的识种子流注出来的就减少了。当意根对特定的法尘也减少攀缘时，如来藏输出的六识种子或者是意识的种子越来越少，这样六识的了别就越来越弱，以至于灭去不了别，甚深禅定就出现了。</p><p>在禅定里为什么意根决定少了别和不了别？为什么不在禅定里意根就不这样决定？意根与禅定是什么关系？禅定主要是对于意根的约束作用，意根由被动的少攀缘到主动的少攀缘，对尘境越来越没兴趣，就决定少了别和不了别，六识心了别的就会越来越弱，最后就停止不了别。由此可见，对尘境的了别是由意根掌控的，约束和控制意根的攀缘性，就能出现禅定，那么禅定就是定意根的。如果禅定只把六识定住，不定意根，意根八处攀缘，八处强烈想了别，结果是六识就随着意根八处了别，强烈造作，那就没有任何禅定了。意根少攀缘不攀缘消停下来，就能出现禅定，内心平稳安和。</p><p><strong>第四节  禅定与果位的问题</strong></p><p>一、问：贪欲心压伏就能修出初禅，贪欲心断就是初果吗？</p><p>答：贪欲心属于五盖之一，降伏五盖，降伏贪欲心，能得初禅定。贪欲心断，是三果人。证初果以后，再加初禅定，二者结合，才能断除贪欲，缺少一个都不行，这个果位就三果，不是初果了。初果与初禅是断贪欲的必要条件。</p><p>二、问：不证如来藏是否能断我执?</p><p>答：断我执是断除对五蕴世间的执著，不涉及是否证得如来藏的问题，没有证得如来藏的人也能断我执，阿罗汉没有证得如来藏，就断我执了，辟支佛缘觉佛也是这样，不用证得如来藏，就断我执了。在初禅以上的禅定中，把五阴十八界彻彻底底观行透彻，断除一切烦恼，我执即断尽，对三界没有留恋了，命终保证能离开三界世间，不回来了。</p><p>当然证得如来藏的大乘菩萨也能断我执，断我执以后即使八地菩萨了，在此之前，菩萨都不会断我执，避免入无余涅槃。大乘菩萨的断我执，是在证得如来藏之后，再过如幻观阳炎观，过禅宗三关，过如梦观，进入初地，才有能力断我执，但是不能完全断，如果完全断，就会入无余涅槃。</p><p>没有初禅定，阳炎观禅宗三关，想都不要想，不可能过得去，甚至也不能到达第三关。有的人第一关都不是实证，然后天天观行如梦观，也没有禅定，观着观着，就觉得自己证得如梦观了，这个误会有多么大。一般来说，第一次证悟，到如梦观，需要经过几大劫时间，一生不可能修到如梦观，况且也不修禅定，所有的观行都不能入门。</p><p>入地以后就开始断法执，法执很深细，小乘的智慧无法断法执，只有证得如来藏的地上菩萨的智慧才有能力断法执。当证得每个细微的法都是如来藏出生执持的，都不是真实的，都是无我的时候，就断了一个法执。现在大家能不能明白什么叫作实修？什么是实，什么是修？所有人都说自己是实修，但是离开戒定慧其中之一，都不是实，也不是修。</p><p>三、问：阳炎观和如梦观分别相当于小乘的几果？</p><p>答：修到如梦观的时候，已经过了禅宗第三关，第三关相当于小乘三果，在初禅定里断除了贪欲和嗔恚两种烦恼。如梦观过后就入初地成为初地菩萨，具有了唯识种智。</p><p>修到阳炎观的时候，相当于小乘的二果或者是三果，证得自他所起的任何心绪都像沙滩上的水雾幻影一样不实，因为这时能现量观察到如来藏是如何如画家泼墨一样幻化出六七识心，六七识心的造作是那样的不真实，似有似无。</p><p>每一种观行，都需要禅定，在禅定中观行，才能证法，才能过各个关口，否则一个关口都过不去。证三果断除烦恼时必须有初禅定，第三关以后必须有初禅定。第二关以前和二果以前必须有未到地定，如果没有未到地定，什么法也不能证，只能解一解，不痛不痒的。</p><p>四、问：有人说有未到地定就可以成为慧解脱的阿罗汉，不必有初禅以上的禅定，是这样吗？</p><p>答：这句话显然不是佛说的，佛在阿含经里说初禅以后断除贪欲和嗔恚成为三果人，再断除我执，才能成为慧解脱的阿罗汉。三果人都必须有初禅定，更何况四果人，更应该有初禅定。有些人无法修定，就要千方百计否定修定，没办法，众生的业力太大。</p><p>初果以后修出初禅定，才能断除烦恼，没有初禅定任何烦恼都不能断除，不能断除烦恼就不能证得三果，那怎么能成为四果呢？有些人非常希望不用修定就能直接成佛。然，这是天方夜谭。</p><p>五、问：有人说打坐不能成佛，那么不打坐是否能成佛？</p><p>答：有些人片面理解打坐不能成佛的意思，认为既然打坐不能成佛，那就不打坐了。由只打坐修定的一个极端，走向不打坐的另一个极端。都走在极端上，当然就都不能成佛了。</p><p>我们都应该知道，成佛有很多很多的条件和因缘，而打坐修定就是成佛的因缘条件之一。只有一个打坐的因缘条件，根本不能开智慧，不能成佛，还需要极多极多的因缘条件。所以不能把所有的时间精力都用在打坐这一个修行内容上，还要学习和思惟理论，还要修行三十七道品菩萨六度等等。如果再把打坐这个因缘条件去除，不打坐了，那就又缺少一个成佛的因缘条件，更不能成佛了。</p><p>要想修行有成效，就要兼顾其它方面的修行，统筹安排，不可偏废一方。根据自己的修行情况，合理安排修行内容，应该修的法，都要修到位，不能顾此失彼，有所偏废。</p></div>"
},{
    "title": "第七章 修定杂谈",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  修定杂谈</strong></p><p><strong>第一节  禅定不是真如</strong></p><p>一、六祖对于禅定的看法</p><p>定分为世俗定和真如心本具的大定，打坐修的定，是世俗定，有出有入，有生有灭，是意识妄心入的定；而真如本具楞严大定，不用修，只要证得就行了。</p><p>有人说六祖不重视打坐修定，其实不是这样。六祖并非不重视打坐修定，六祖讲法都是围绕着真如心而讲，他把世俗法的禅定境界与真如这种禅心严格区分开来，以免众生把世俗法当作真如来误会佛法。因为众生不懂真如的体性，往往误会打坐入定的状态就是见真如，就是明心开悟。这样就把定当作真如这个禅，这个误会就大了。因此六祖在坛经中就没有着重讲打坐这种世俗禅定，直接引导众生明得真如大定，楞严大定，没有出入的那伽常定，以开发众生的大智慧。如果只认世俗的四禅八定，正定不具足，智慧不开，不能真正得解脱。</p><p>二、女子出定公案</p><p>一个女子在世尊身边入定，众人皆认为不如法。文殊菩萨就三弹指让女子出定，可女子就是不出定，文殊菩萨又把她举到天上，又举到其它佛国土，还是不出定，无论怎样做，都不能让女子出定。一个七佛之师都不能让一个普通女子出定，众人不解，问世尊怎么能让女子出定。</p><p>世尊说：在下方世界有一个网明菩萨，能让这位女子出定。于是世尊招来网明菩萨，网明菩萨在女子耳边弹指一下，女子立时出定。众人更是不解，一个初地菩萨这么容易让女子出定，等觉菩萨为什么就不能？而且文殊菩萨早就应该取得佛的果位，示现成佛了，神通定力与佛相媲美，对付一个普通女子还不如初地菩萨，这里究竟有什么奥秘呢？</p><p>六祖说：那伽常在定，无有不定时。意思是说本心第八识常在定中，从来就没有出过定。众生也本来就在第八识中，从来没有离开第八识这种楞严大定。而众生后来修的觉知心的定，也不能离开第八识而有，依第八识才能入定和出定。世尊就是如来，如来就是性德，性德就是第八识。</p><p>女子代表五阴觉知心，网明菩萨代表无明。众生常在定中，因为无明，就能从定中出来，现起根身器界；心明，没有无明的时候，就常在定中，不出定。所以文殊菩萨没有无明，不能让女子出定，网明菩萨是初地菩萨，还有无始无明随眠没有断尽，尘沙惑没有断尽，就能让女子出定。众生世界因第八识缘于无明而出现，灭了无明，众生就回归到自性本心当中，不出定而常在定中。</p><p>三、打坐修定或者观照时，如果身体出现了轻安和舒适，这是有定的一种好现象。心得定以后，身体的状态就不一样了。如果人的心理状态都与世间人的境界相应，就没有禅定。心专一在观照当中，把世间的事情暂时忘了，就与欲界天的境界相应，这样欲界天人的色身就与人间的色身相互交织摩擦，身体的感受就非常的舒适、轻安，同时也觉得身体很高大。观照得越深，心念越是专一，定就越深，身体和心里的感受就越是美妙。</p><p>如果把欲界的欲望看淡了，那么色界的定就会现前，色界天人的色身就会出现，与人的色身交织摩擦，那个感受更是美妙，身体更是高大。那时就觉得自己是人中最快乐的，简直像天人一样的快乐。以后对人世间及欲界的五欲六尘都不再喜欢，贪欲就断了。</p><p>这种情况属于定境，不是开悟见本心的智慧境界。见本心没有境界，只是智慧的展现，是发现了一个真理，知道本心是如何运作的。很多人把自己的定境当作开悟，或者自己偶尔心静了一下，见个一无所有，就当作是开悟，这都是明显的错悟。</p><p><strong>第二节  禅定与智慧</strong><br/></p><p>一、增长定慧的方法</p><p>修定比较快的方法，就是深深的思惟一个法义，把这个法义凝聚成一个点，悬挂在内心里，不要散掉，时时刻刻挂着，心就不散乱。对这个法义越感兴趣，心越专注，定力就越好。以后就能养成专注思考的习惯，智慧增长很快。我们平时要多训练自己，多动脑筋思考，把一件事思考清楚，然后再表达。如果思考不清楚，尽量不要表达给人知道，除非想得到他人的帮助。动脑筋思考的时候，就能增强禅定力，又能出生智慧。</p><p>二、如果定力不足，就不能思惟观行佛法，读书犹如走马观花，不得其要。修定时尽管去定，不用害怕定得太深，定深也没关系，出定以后再参究思惟佛法，内心清净，心思细密，观行相当得力，总比没有禅定或者定浅收益大。定越深越好，定中转变身心以后，再来参禅思惟观行，非常得力，得心应手，观行非常快，也到位。</p><p>外道修出四禅八定以后，听佛讲法当下就证果，就是受益于甚深的禅定，出定闻法思惟观行，智慧很快就能出生。没有禅定的人，明了点理就知足，观行智慧出不来，二十年还在原地踏步，道业根本无法增进。还有的人修定，贪图定的境界，在定中享受，玩感觉，以为有各种境界就是殊胜的，不知道修行为何，修定为何，这样的人纯属是玩感受，不是修行。</p><p>三、百无所思不能出生智慧</p><p>有一部分人学佛，认为安住于当下就是万事大吉，佛法就修成就了。他们不知道这仅仅属于修定的方法，而且与外道方法相近，根本不能证得佛法而出生智慧。</p><p>现在胡乱修行的人非常多，不知道如何是真正的修行，也不知道修行究竟是为了什么。于是各种发明创造就出来了，有的人就说：修行就是安住于当下，不起念想，就能明心见性，就能成佛。殊不知，这样就是外道的修行方法，最多能成为一个成功的外道，但现在的人根本没有过去时的外道有定力有出离心，所以外道定也修不成，别说明心见性的般若大智慧了，连影子都见不到。</p><p>只安住于当下，觉知于当下，什么都不思惟，什么都不想，这样修行好不好？这是外道修的定，他们以为让心不起念就能解脱生死，得涅槃。但是静坐时若百物不思，就不能获得智慧，没有智慧就不能出离生死轮回。</p><p>但是偶尔修一些无念的定，出定后身体轻松精神愉悦，减少烦恼，心思细密，借此机会正好思惟观行佛法，则此定也大有助益于思惟观行和降伏烦恼。只是不要一味的这样修，浪费宝贵的修道时间。</p><p>四、只有正定才能生智慧</p><p>能出生智慧的定是正定，是有觉知并且专一的禅定，不是灭除意识觉知的外道定。外道的定中不能出生智慧，因为外道修定都是为了压伏六识，灭除六识的作用，意识什么法义也不思惟，就是为了证得一切法都是空，把六识都空掉。意识空掉就不能思惟，没有思惟的主体和内容，意根了别不到任何法义，也就没有什么可思量的，只有执身执定境，执顽空了，那就不会出生任何无我的智慧，心中有我，我见不断，生死就不能了脱。也不能参禅，从而明心见性，获得般若智慧，更不能转识成智，究竟成佛。</p><p>在修定时，如果外道定的成分多，修定就是浪费宝贵的修行时间，到临终时就会发现自己一辈子的修行一无所是，什么智慧也没有，还是要随着生死业缘轮回不断。不少人还很自豪自己的禅定好，一入定就什么也不知了，或者什么神奇事都出现了，其实到最后这些都要消失得无影无踪，仍然什么也得不到。修定的目的是让心沉静下来，然后专心思惟观行佛法，以期能证得佛法，获得解脱的智慧。如果不能获得解脱的智慧，那个禅定就不值得追求了。</p><p>心要有正念，修出禅定以后，要专注念真如，念五阴无我，念一切法无常，心里念着佛法就是正，心念散乱就不正了。既然知道身体和识心都不是我，应该就是思惟观行的结果。观察正在想做一切事情的心不是我，这就是观行；一边做事一边问自己：这怎么能是我？如何不是我？这就是观行。定中观能深入到意根，意根参与观行，与之相应，这样修行就有希望证道。</p><p>五、如何具有自观自省的定力</p><p>意识如果能跳出自己色身之外观察自己，以旁观者的角度观察自己，就是意识的证自证分功能，是意识的反照作用，是反观力，也叫作慧力，能清楚的照见自己的心行和烦恼习气。既然叫作力，就有力度，能解开心中的疑惑，能解决问题，这是正修行。当然如果解决了问题，其中就有意根的力量，意根借助于意识也观察到了自己的心行状态，从而决定改变自己，如来藏就帮助改变了。</p><p>那些成天盘腿打坐的人，无论怎样坐怎样定，仍然不能观察自心，不能反观，没有觉照力和慧力，仍然不知五阴无我，不能出生无我的解脱智慧，不能解决生死大事。我们应该好好按照四念住的方法修行，定会有大收获，慢慢都能如实观察到五阴的作用都不真实，都不是我。</p><p>把意识心跳出身外观自己，才能有所觉悟，与色身全部融合在一起，会失去觉照力。我们要检查自己的心行的时候，也要把心跳出来，反观自己，才能观察出自己的心行。最后观察能观与所观，都不是我，心住于舍的状态，心里泯灭一切相。要自然而然得出那个无我不真实的结论，不要生搬硬套，也不要牵强附会。</p><p>六、有人说禅定通于外道，修之系缚。但是外道享受禅定乐，学佛人用来开智慧，解脱生死苦未尝不可。譬如利刀，外道用之杀生，学佛人用之切菜削水果以利大众和自活，不能说外道用的学佛人一定避之不用，这是蠢人思想。同样事理，外道恶用，学佛人善用，岂不方便？一切法众生恶用之，佛却都是善用，学佛岂不善哉？一切事理，学好就能用好，并非是事理有碍，关键在于会用，会用以后，一切法都圆融，一切法都无碍。</p><p>七、很多人说禅定难修，心不寂静。可是有的人禅定又过深，深得没有念想，觉知微弱，身心麻木，痴痴呆呆，不出智慧，命终也是一个大问题。所以如何正确修行禅定，对我们想明心见性的人来说，是非常重要的。<span>               </span></p><p><strong>第三节  禅定与烦恼</strong></p><p>一、压伏烦恼和断除烦恼的区别</p><p>压伏烦恼和断除烦恼，是两个概念，是修行的两种层次，二者相差很大，或者说极大。压伏烦恼只靠禅定就行，一旦禅定退失，烦恼就会出现。而断除烦恼不仅依靠初禅以上的禅定，还要有断我见的智慧，定慧结合才能断除烦恼。修出四禅八定的人，禅定都很高，好像都断除了贪欲等等烦恼，心很清净，但是禅定消失，烦恼就现前，命终以后还是处于生死轮回之中，换一个身体之后，禅定没有出现时贪欲等烦恼继续现行，然后又因为淫欲心而投胎受生，但有可能比没有禅定的人烦恼轻微一些。如果没有断我见证果，所谓断除贪欲烦恼都不是断除，而是压伏，暂时不现起，不代表以后不现起。禅定消失以后，烦恼马上就出现。</p><p>二、具足初禅定才能断除烦恼</p><p>因为在初禅定里身心感受相当的美妙，就会对欲界爱不感兴趣，这样就能降伏或者是断除欲界爱；因为在初禅定里内心有喜悦，就会降伏或者是断除嗔心。所以没有初禅的功德受用，是不能断除贪爱和嗔恚的。但是有个前提就是，必须首先要有断我见这个智慧，没有这个前提，即使修出初禅定，也是不能断除贪爱和嗔恚，只能压伏烦恼，不能断烦恼，一旦定力消失，烦恼还会出现。所以断烦恼就是在获得初禅定以后，之前一定要断三缚结。任何法的证得，都是禅定与智慧的结合，缺一不可，前提还要有福德。</p><p>三、外道也有禅定，却没有解脱的智慧和法界实相智。要想具足智慧，需要在禅定中如理思惟观行四圣谛和法界实相，正思维非常重要。</p><p>所有的禅定都能降伏意根的执着和烦恼，但不能断除烦恼和灭除执着。因为烦恼的断除，执着的灭尽，不仅需要禅定，更需要具足智慧的认知，如理思惟真理，证得真理，也就是说禅定和智慧二者兼具，才能断除烦恼和执着得解脱，成就佛道。</p><p>四、八正道：正见、正语、正业、正命、正思惟、正精进、正信、正念、正定。八正道修行满足，就会脱离八邪道，与圣性相应，才能证果，从而进入圣贤行列。 如果一个人奸诈、险恶、卑鄙、心术不正、不择手段、谎言欺骗，显然是不符合八正道的要求，不是正语，不正思惟，没有正念，不谋正业，心不正定，此人则没有八正道。那么讲起道理口若悬河，头头是道，也不能说明此人有真知灼见，不能说明此人断我见，证得初果二果了。</p><p>邪念炽盛的人，不可能有禅定。有禅定的人心念清净而正直，妄想少，攀缘少，浮躁的思惟没有了，心意端直，不可能有邪心思。因此一个人心术不正，计谋很多，说明心不在定中，没有禅定。</p><p>小乘八正道的正信，一定要信苦空无常无我。大乘八正道的正信，一定要信自身有不生灭的自性清净心如来藏，信因此而能成佛，信如来藏能出生五阴身及一切法。大乘正信圆满，修菩萨六度，才能明心证悟。</p><p>众生愚痴的多，总是喜欢受人笼罩，喜欢夸夸其谈之理，崇拜侃侃而谈之人，真理不是口头禅，道不在口头上，侃侃而谈者未必有道，若有道，过去的文人墨客胡适等人，个个口才朗朗，文章咄咄，佛法著作禅宗著作等身，长篇大论好不让人羡慕，可是他们并没有道。<span> </span></p><p><strong>第四节  禅定在参禅中的作用</strong></p><p>对于佛法的探讨，由于每个人禅定力的差别，导致人们思惟佛法的力度上也有差别，禅定力大的人思考佛法叫作参究，定力弱和没有定力的人思考佛法就是搞研究。</p><p>研究是没有定力或者是定力不足的表现，定力不足意根无法使力参与其中，只好由意识单独思惟分析推理判断，所以只能浮在法义的表面，无法深入法义之中去探索深层次的内涵，所得结果也比较肤浅，泛泛而谈，不得精髓。没有定力时，心神分散，是发散性思惟，没有力度，犹如蜻蜓点水，无法专一深入其中，去搞清楚法的来龙去脉。结果是没有实证的，给不出实证的具体方法和步骤。</p><p>而参究的思惟活动，是在有一定的禅定力的情况下进行的，思惟深细专一深透，先是意识用心，然后意根参与，最后以意根思想活动为主，意根的功用最大。这样用心非常有力度，直达法义深处，甚至细节都能摸清摸透，疑情都能攻克，结果深信不疑，断除思想结缚。参究的结果，他人看来无懈可击，又能给与他人修行入手处，引领他人思路，达到自利利他的目的。</p><p>古来搞研究者，文人墨客居多，因为文人墨客定浅情重，喜欢在文字表面做文章，对于佛法浅尝即止，不能入深潭攫取宝藏，只能在潭边掬些清水。即使想入深潭，定力不足，其思惟无法如锥尖一样猛力，无法深入法中，获得深义。因此唐宋朝时期的李白白居易苏东坡等人的佛学思想，影响带动不了佛教的发展，及至民国时期及以前的文人如胡适丰子恺等等，禅宗著作丰厚，洋洋洒洒，所说也仅为皮毛，触及不到禅宗皮里，其著作读一遍都嫌多，几句话即知其落处，对于广大学人没有一丝借鉴之处，不要说影响佛教了。</p><p>喜好研究者，定浅言多，文字丰富，思想贫乏，虽著作等身，糟糠多，营养少。参究者定深寡言，思想深透，文字虽少，精髓多。比如达摩祖师、傅大士、宝志公，还有唐宋朝时期的禅师，虽其著作有限，可是一言九鼎，一句话回味无穷，可令人参究数十年。其言符其行，其行符其言，言行永远一致，表里如一，充分体现了道者的风范。禅师著作语录，不仅体现禅师修行的历程和心得，也含藏着做人的品格和菩萨的风范，都是实修实证的成果，是佛教的宝藏，带给大众无穷的利益。</p><p>所以说要想解救自我，解救众生，带动佛教发展，只有在定中深入参究实证，证出成果，自利利他，才能推动佛教的发展。<span> </span></p><p><strong>第五节  禅定与睡眠</strong></p><p>一、如何让睡眠质量好一些</p><p>睡眠不好，是因为意根的攀缘重，心不空净，烦恼重，思虑较多，因此睡不安稳，身体素质不好的除外。如果禅定修得比较好，熏习佛法的力量比较大，心中都是佛法，就不会多想多惦念世俗法，就能让心平静下来、清静下来。如果精进修学佛法，心中都是佛法，睡觉的时候梦里都是佛法，心里其他的事情都装不进去，睡眠就会非常清明。多修禅定，也有助于睡眠质量的提高；不仅打坐是修定，行走坐卧都要修定，训练自己的意根不攀缘世俗事，按照四念住经修行，禅定提高的会很快，内心的攀缘都会减轻。</p><p>有个生死迫切的心，就不会在意世间法了，生活太幸福了，出离心就不强；经常观照一切法的无常性，就能有出离心，道心就坚固。因此要常常观察自己是否与世俗法脱离一些了，是否有出离心，道心增强了。多找自己不足的部分，想办法弥补上，争取早日明心和断我见，这个事情太重要了。</p><p>二、有禅定时，睡眠就少，身体不需要太多的睡眠。因为禅定本身，就能让六识少于活动，少消耗四大营养。禅定也能让意根少攀缘，减少色身的活动，减少对全身神经系统的牵动和控制，大脑神经系统和五脏六腑以及全身都能少活动少消耗四大，身体也就不疲劳，意根也就不会贪睡眠了。</p><p>禅定越深，所需要的睡眠越少，以至于完全可以不再睡眠。因为这时意根很安静，不再想有什么造作，也就不再过多的调动大脑神经系统，很少有身根活动和识心活动。意根越定，攀缘越少，调控活动越少，消耗四大越少，越不需要睡眠和吃饭。</p><p>有的人在日常工作中，工作虽然不少做，心念却很少，他消耗的就少，不需要吃那么多的饭，不需要有那么多的睡眠，仍然精力充沛。这说明最能消耗四大能量的还是意根的心思活动，六识本身消耗的并不很多。所以六识的工作量一点也不少，意根的心念少了，活动量就减少，工作就不觉得累。</p><p>可见意根对色身的情况随时随地都能掌握了解，随时随地都能调控和指挥，祂了别得非常伶俐，意识都不知道身体的各种状况，还需要意根暗示和警觉。</p><p>三、治疗神经衰弱的方法：打坐时或者静下来时，非常慢地背诵心经或者药师咒，一边背诵一边观想，观想佛光照在头部，尤其是后脑部位，佛光是金色的，一直流入头部或者是后脑里；再观想黑色或者是灰色的业障气，屡屡从头顶排出去，修到睡眠好转，再也观想不到有黑气时，就不用再观想了。定力越好越有效果，定力比较好的用这种方法是很管用的，同时也能加强定力，得定很快。观想金色的佛光从头顶四面八方进入都可以，直射和倾斜角度都可以，定力越强，观想的范围越广，这样也能快速地增强定力。自己可以想象，怎么方便就怎么观想，身体其它部位的疾病都可以照此方法观想。也可以给别人观想，但是要替人背负业债。</p></div>"
},{
    "title": "第八章 如何参禅参话头",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  如何参禅参话头</strong></p><p><strong>第一节  参话头的方法</strong></p><p>一、什么是参话头</p><p>所谓的话头，就是一句话的前头。不管这句话有多长，心都要住在这句话的第一个字前头，第一个字以及后面的字都不让它在心里出来，出来一个字就不是话的前头。</p><p>话头有很多，都能让我们生起疑情。比如：参禅的是谁？念佛的是谁？拖死尸的是谁？万法归一，一归何处？狗子有佛性也无？——无。风吹树摇；风来浪涌；（风树浪都是比喻，比喻真我与假我。）菩萨举足下足都从道场来。（什么是道场？）凡事都要起个疑问，问个谁，这个疑情生起来后，才能起心参究，最后就能解决疑情，从而明心证悟。</p><p>比如：吃饭时要疑吃饭的是谁；走路时要疑走路的是谁；写字时要疑写字的是谁；说话时要疑是谁在说话；一切时中对一切事都要打个问号，不要认为本来就如此。如果本来就如此，怎么不是本来如彼呢？死人为什么不能本来如此？植物矿物为什么不本来如此呢？是本来就如此吗？楞严经中佛说，一切法本非因缘，非自然性。佛否定了本来如此的自然性，结论都是如来藏性。这样的话，我们就可以对一切法起疑，不是本来如此，而是有奥秘的。奥秘是什么呢？这得通过参禅来解决，通过参禅得出合理的结论。</p><p>二、如何参话头</p><p>首先选定一句话，这句话不要太长，感觉最亲切，最容易起疑情，最直接，意思也比较明朗。比如：拖死尸的是谁？选定之后要清楚明白这句话的表面意思，把这个意思浓缩成一个点，悬在脑海里，要作到头脑里总能显现这句话的意思，时时提撕而不出现文字语言；不是在心里念叨这句话，更不是琢磨分析话的内涵。参话头最忌琢磨分析，分析研究最好的结果是解悟，但是却没有什么智慧生起，绝对不能证悟。因为定力不足，思惟的不细不深不究竟，那就得不到真实的受用。解悟就是理解明白真心的大概作用，没有证得或找到哪个是真心，不明白真心具体在哪里起什么作用，是如何产生万法的产生五阴的，心里也就没有解脱的真实受用。</p><p>参话头：拖死尸的是谁？把这个问话作为没有语言文字形象的念头悬在心里，把这个话头的含义悬在心头，内心不要出现声音念诵这句话，也不要有这句话的语言文字，因为这样是没有定或者是定浅的表现，定浅就没法参究话头。心里有问答时，是觉知心意识肤浅的问答，那个定就浅，分析的成分多，可以解悟，很难证悟。如果是解悟，所得的都是知见推理的智慧，这种智慧很肤浅，后续的修行就很困难。真正的悟，是用心眼看到如来藏在深细运作中的行相，由此而产生的智慧是般若智慧，与解悟的智慧不可同日而语。</p><p>定力很深时，意识心很深细，心思就很细致细密，智慧就能生起，配合意根的思量就能找到第八识以及五阴一切法的来龙去脉。参一句话，应该把这句话的意思浓缩成一团或一个点，然后把这句话的意思悬在脑海里，同时划个问号。拖死尸的是谁，与阿弥陀佛四个字是一样的，念佛定修好了，自然就能转入参话头，二者的功夫境界是一样的，只是文字内涵不同罢了。先看话头，看熟了以后，再来参究话头。</p><p>三、什么是提撕</p><p>提撕就是心里总保持有这句话的含义，心住在话头上，不想其余杂事。丢掉了再提起，打妄想了，再转回来。眼见色时，注意力不在色上，心中仍有话头明显存在；六根对六尘时，注意力都不要在六尘上，都在话头上。初期参时，很难进入这种状态，心里总要念出文字语言来。你可以训练自己，先念出第一个字，后面的字不要念出来，然后整句话的意思就悬在脑海里。一旦散乱了，再提起第一个字。熟练以后，把第一个字也去掉，不用再念了，让心里总有这句话的意思就行了。</p><p>这是怎么个心理状态呢？说一个比喻，比如说一个人的钻石戒指丢失不见了，心里很急，翻箱倒柜到处找，满屋都找遍了也没找着。这时她已经很累了，就索性坐下来休息；脑子也累了，没办法想那戒指到底在哪里。这样身心都休息下来，虽然休息，可她并没有忘记这件事，心里还在悬着这件事，只是没有思考戒指在哪儿。这种状态就是参话头的状态。如果她不是很累，心还清明的话，坐着休息一会儿以后，就有可能突然想起：啊！戒指在那呢，我一时糊涂忘记了。她现在想起来了，就去找，果然在那个地方找到了。找真如也是这样去找，不要去分析、研究、归纳、推理、判断，这些都不需要。只要把话头在心里带着，心里有疑情，深深的悬着，拴住意根，动用意根的力量，时节因缘具足就能破参，证得真如如来藏。</p><p>再打个比喻：文化大革命时，邓小平被软禁。他在一个农村院子里，每天晚饭后都要在院子里散步，思考复出的大事。他就在院子里走啊走啊，走了很长时间，心已经渐渐地定了下来，不能再思考问题了。可是问题仍然悬挂在脑海里，没有消失，把意根调动起来，深刻缘着这个问题不放松，这个状态就是参禅的状态。到一定的时候就能解决他的问题，参禅参话头亦复如是，诸位好好体会一下。不妨每日也这样经行散步，参个话头试一试。</p><p>话头是宋朝以后才出现的，宋朝之前的人们，心地较单纯，没有杂思乱想，参禅很容易入道。宋朝以后的人心乱了，根性钝了，妄想也多了。禅师们为了统摄这个散乱的心，不得不用参话头这个办法，让参禅人心思容易集中。心念力集中，定力就好了；定力好了才能破参，就能解决禅这件大事。所以我们平日修行时，尽量少去接触人和事，心里尽量放下或摆开一些世俗事，做过的事，已经处理完了就不再挂念；让自己的心里时时刻刻都清清净净的。以这种心态来思惟佛理、参禅，入道就快。        </p><p>四、念话头、看话头与参话头的区别</p><p>看话头是修定力，让心住在一句话的前头，文字语言不要出现。当定力不足时，文字语言都要出来，心里声音不断，这就是念话头。所以说没有定力，心里才反反复复重复一句话，有定力时，心里的声音和文字相都要消失。</p><p>当看话头定力足够时，意根参与，才能真正开始参话头，参究这句话的意思，文字语言几乎不出现，不会只有意识的情思意解，这样才能真正的证悟，而不是解悟。定力不足的人，如果要悟，只能解悟。话头就是指向真如的一句话，话中含着秘密，能够让人生起疑情，疑之后参究，就能解开其中的秘密，从而破迷开悟。所谓的话头就是心住在这句话的前头，这句话一个字也不要在心里出现，但是心头却有整句话的意思在悬着惦念着，意根把参究这事当成了自己必须要解决的问题，不想舍弃，暗中与意识一起用心，水到渠成时，就能破解秘密。参公案与参话头，随各人的习惯和喜好而定，都能让人破迷开悟。</p><p>参禅不是猜谜语，首先要有深厚的佛法基础理论功底，知道参禅是为了什么，参的内容和标的是什么，如何参，从哪里下手。把理论基础打好了，定力也具足了，才可以参话头或者参公案。参公案时，要知道什么叫作公案，公案的内容和标的是什么，公案给我们指示了什么，能让我们得到什么。还要知道公案的关键地方在哪里，公案为什么是这样，又说明了什么。等到我们的定力、福德、因缘都具足的时候，就能对所参究的内容生起疑情，疑来疑去，一旦水到渠成，就能悟得真心第八识，这就开悟了。</p><p>看话头是修定力，参话头是参究话头的内涵，定力具足时才能生起疑情，有疑情才能参究，参究以后，就能解决疑情而证得参究的标的——如来藏，这就是开悟，那时话头里所含藏的一切秘密就都知道了。至于参话头还是参公案比较合适，这要因人而异，一般来说，公案的内容多，指示的方向比较清晰一些，方法简洁明快，思路比较活泼，容易入手。参话头或者参公案，应选择自己感兴趣的，疑情比较重的，好像能有切入点的来参比较快。在这之前要检查自己的菩萨六度修行的程度，菩萨的条件是否具足，然后再尽量完善六度的条件，六度还没修好时暂时不要着急参禅，修行是一个阶梯一个阶梯地上进，每一步都要踏踏实实的打好基础，基础稳固，后续的修行就如顺水推舟一样顺利，没有阻碍。         </p><p>五、如何由忆佛转为看话头</p><p>忆佛和看话头，二者的功夫有些相同相似，所谓的忆佛，是心里有一个想佛的念头存在，是一个知念；而看话头也是心中有一个话头的念想存在，是一个知念。二者的心理状态是一样的，因此就可以由忆佛转变到看话头。具体方法是，当忆佛的念头很清晰，定力很好时，心里能够时刻忆佛想佛，念头也不断，就可把心里忆念的阿弥陀佛四个字，改为一句话，如：拖死尸的是谁？这个功夫和忆佛想佛的心里状态是相似的，只是文字多了两个，内涵变了，并且多了一个问号，增加了内心的疑情。忆佛转为看话头，需练习一段时间，当话头不清晰或者断掉时，就提起第一个字，以后的字就不要出来，这时整句话的意思都要悬在心中，熟练后，再把第一个字也去掉。反反复复练习，直到看话头功夫，和忆佛的功夫一样绵密不失时为止。</p><p>这时心念就住在这句话的前头，这句话的意思就在心中悬着，行走坐卧，无论做什么，心里都带着这句话。同时对这句话生起疑情，疑个谁，到底是谁？把这个疑情轻轻带着，疑情连续不断，非常浓时，就可以起心参究这句话，探求这句话的奥秘。剩下就等待时节因缘，找出这个谁来。再把这个谁，对照经论来检验，看看是否符合经中的圣教量，之后有一些般若经典能够看懂，粗浅的公案也能看懂一些，才可以确认自己确实明心。一般来说，不建议自己认证，自己往往会误会，现在不缺少善知识帮助检验，有善知识检验，还可以提升自己的智慧水准。</p><p>忆佛念佛和看话头时，如何把念放在这句话的前头呢？忆佛的状态就是心里想着佛，这个想佛的念一直在心里不断。一句话的意思就相当于忆佛的念想，把这句话的意思作为一个点悬在心里，文字相和语言声音相不要出来，因为有这些相，内心还很粗糙，定力不够好，无法参究话头，也不能破参明心。这句话里的一个字也不要在心里出来，心念就在这句话的前头，名为话头。心中有佛和心中有这句话的意思含义是一样的，这样就可以把阿弥陀佛四字，换成拖死尸的是谁，把想佛的念想换成一句话的含义，牢牢的拴住意根，这个定力足够参禅了。      </p><p>六、用念佛的方法转入参话头</p><p>我们学佛的目的，首先要明心见性；要明心见性，就要参禅、参话头、参公案；而参禅就得具足欲界的未到地定，有了这个定，才能在行住坐卧中参究一个话头，从而达到破参的目的。既然是参话头，心中就不能空着，不能入到定境里面去。在定境中，心是空的，不能思惟法理，不能达到破参明心见性的目的。行住坐卧都在参禅，就是活动中的定，入到定境里是静中定，进入定境里无法参禅，在静中定里，也要有参禅的念头，也要参话头，否则对于参禅没有大的用处。</p><p>未到地定不具足，心就会常常散乱，心思不集中，没法参究话头。过去时的参禅人，二六时中心里总是抱着一个话头不放，话头掉了再捡起来，内心作功夫绵绵密密，不散乱，也不沉没。沉没就是昏沉，或者是无念想了。他们无论上山还是下田，烧火做饭，都不离参禅，不离参话头。</p><p>我们现在也应该练习动中定，不能参话头时就念佛。用阿弥陀佛四个字来代替话头，熟练了，定具足了，慧也有了，就可以改参话头：如拖死尸的是谁？念佛的是谁？话头就是一句话的前头，第一个字的前头，如果出来一个字或者整句话都念出来了，就是话的尾巴。</p><p>用念佛的方法练习时，最关键的一点就是：阿弥陀佛四个字都不要出来，而且心中还要有佛，处于念佛的状态中。这个念不是口念的念，而是心中念佛的延续状态。这个状态可以这样体会，我们平时打佛七的时候，口念累了，就是有定了，就改心念；心念有定时，心里也念不出来了，这就是处于一种念佛定中，是粗浅的念佛三昧。在这个定中，心里虽然念不出佛号，但是没有散乱，也没有昏沉，心中还是有佛，并没有落空，是一种念佛想佛的境界和状态，与心中空落落的什么也没有的状态截然不同。</p><p>那么，我们可以把这种念佛三昧直接拿来练习。怎么练习呢？把阿弥陀佛四个字分成两部分，阿弥和陀佛。念完阿弥，再念陀佛，熟了以后，念完阿弥，停顿下来，先不念陀佛，细心体会这时的心里状态，是不是在等陀佛出来呢？肯定是的，念完陀佛，不念阿弥，心里在等阿弥二字出来。这时心中不空，是一种念佛的延续状态，是处在想佛状态。再把这种状态延长，直到散乱了，再提起阿弥两个字，心中在想佛；散乱了再提起，不散乱时总是处于这种想佛状态，这是一种念佛定。     </p><p>功夫能够延长绵密了，就可以把阿弥陀佛四个字改为一个话头，如拖死尸的是谁？心中总是悬着这句话的意思，一个字都不要让它出来；散乱了，可以单提一个拖字，心中整句话的意思就应该有了；再熟练时就可以参究，参究通了就明心。这是大体的参禅框架，细节要靠自己去练习体会。如果修定，心中无念想，入到定中没有话头没有思惟，就不能参究，也不能明心开悟。   </p><p>七、参禅与修定的区别</p><p>要想开悟明心见性，就要用参禅、参话头、参公案的方法才能证得如来藏，明得真如心第八识。所谓的参，就是用意识意根参究真如之理，去寻觅第八识的所在。既然是参究，当然这个意识心应该是清醒的、有智慧和明理的，而不是糊涂的昏沉的，更不能在定中消失不见了。有理智的意识心才能够参究和寻找第八识，没有意识心或者意识心昏沉了，就不能参究和寻觅，其结果将是一无所知，就不能达到明心悟道的目的。</p><p>就像是我们要找一个人，必须有一个寻觅的心，而且知道要到哪里找，如何找。如果不知道到哪里找和找的方法，也不知道那个人是什么样子，也没有那个人的相片，无论如何也找不到那个人。参禅寻觅第八识真如也是如此，我们必须事先要知道第八识的体性，这样就等于有了第八识的相片。仅仅有了第八识的相片还不够，你还得知道要如何找，祂一般都在哪里出现，如果这些都不知道，就像大海捞针一样，徒劳而无获了。</p><p>这样的话用数息的方法就不能开悟，因为没有参究的心念，用关注念头的方法也不能开悟，因为没有寻觅第八识的心念；用打坐入定的方法也是不能开悟的，因为定中的意识一无所知，也就不能和第八识相应。这些都是修定的方法，不是参禅的方法。因为数息时注意力在数字上，不是在参究寻觅第八识上，肯定找不到第八识，而且数息的时间长了，容易昏沉或者入定，更不能找到第八识了。关注念头，意识心注意力在念头上，不去参究寻觅真如，也不能悟。打坐入定时，无觉无知，没有参究寻觅的心，什么真理也发现不了，也不能找到真如第八识。    </p><p>以上那些修定的方法，都不能用来参禅证悟，方向不明，方法也不对，错用心思，结果可想而知，将是一无所获。如果持续这样的话，修到一段时间后就容易失去信心，难免要退道。修行过程中明理最重要，有智慧有正知见最重要，不能盲修瞎练。学佛人应该常常探究自己的修行方法路线是否正确，能不能达到目标。如果不能，就要随时调整自己的修行方向，细心选择一个适合自己的方法。修定要用修定的方法，开悟也要用参禅的方法，明白了什么是禅，该怎么参，何时开始参等等。这一系列的问题都要弄清楚，还要观察自己参禅的条件是否具足，努力完善各种必备的条件以后，才能开始参禅。     </p><p>八、开悟之时并不是无念之时</p><p>总听有人说：妄念顿歇，歇即菩提。意思是歇了妄念，没有妄念时的心就是菩提，这时菩提出现，此即是明心，即是开悟，这里的意思表明菩提是有生之法，有生就会有灭，而菩提本不生灭。而实际上在开悟的一刹那，正是念头动转之时，不是念头止息，此时刚好识得在五阴活动中的如来藏，突然间就明白了如来藏与五阴身和合运作的关系，这时也正是念头运转之时，根本歇不了念头。试想，我们在茫茫人海中找到自己久别的亲人，这时正是认亲之时，转动念头在辨认观察之时，这时肯定不能歇念头，心中不能无事，内心深处一定有喜悦，有观察和辨别的思想活动，情绪是起伏波动的，不能平静得像无事一样而心中无念，绝对不能歇心息念头，虽然过后，心意已足，再无他想。</p><p>开悟时也如是，念头根本停止不了，思惟很深细，对如来藏的辨别、确认、观察种种的思想活动都要出现，内心的喜悦按耐不住。如果开悟时，念头能停止，内心没有思想活动，那么智慧要如何出生？六祖如何能在开悟时明了五个何期自性？怎么能说出五个何期自性？如果没有念头了，就不能观察如来藏，对如来藏的运作也就一无所知，那么开悟有何功德利益？与禅定又有何区别？修禅定时就能无念，就能歇心，就能止息念头，何必参禅开悟？</p><p>没有开悟过的人，各种想象，情思意解，认为开悟时就是无念头、无妄想的状态，是一无所知的无智慧状态，若如此，我们干脆一直修定，多么简单、轻松、愉快、舒适，还用费那脑筋精力参禅，参得废寝忘食、衣带渐宽人憔悴？参禅时，如果泯灭念头，掐断念头，达到无念，那如何叫作参？没有心念，如何参？如果开悟时冷暖自知，不得说向人，不得吐露出，那么六祖为什么说出了五个何期自性？历代祖师为什么能教导学人参禅悟道？佛为什么能讲出那么多明心见性的法，讲出那么多大乘如来藏法？</p><p>真正开悟，悟时悟后，都能知道有关如来藏的运作和体性，不是像那种什么妄念消融不可说示于人，无言无语，心行止息，像傻子一样，如入定一般。如果这样，谁来继承如来家业，说法度众生？智慧何以传承，如灯灯相燃？修禅定时能一念不生，禅定有无念状态，参禅绝对不能无念，不能一念不生，不能没有了别，不能没有意识，不能无知，不能没有智慧的显现。禅定里可以不涉及到如来藏，参禅一定要与如来藏有关，否则就是禅定。禅定里如果没有知，不思惟，绝对不能出生智慧，那与外道的定无异了。     </p><p>九、参禅是用意识参究真心</p><p>参禅就是我们要用见闻觉知的妄心去参究无见闻觉知的真心如来藏。要想明心见性，就要用参禅参话头的方法，参禅参话头就是用意识心和意根，用能了知心法的有慧心所的识心来参究如来藏。而参究如来藏一定要在定力足够的情况下去参究祂，最好在心里起疑情之后，对自我五阴的一切活动都能起疑情，内心时刻悬着那个疑情，或者悬着一个话头，然后再体究疑情，最后就能解决疑情。</p><p>如果没有相当的禅定功夫，没有深深的疑情，就不要着手去参，心很粗糙，功夫不到位，无法实际参究。不要用意识粗略地分析思惟想象，这样的情思意解最多就是解悟，不能真实的证悟，不能出生智慧，也许连解悟也做不到。如果不能证悟而是解悟的话，般若智慧就很难生起来，往后的路走起来很困难，烦恼也不容易降伏。还不如把各方面的基础打牢固了再求悟，基础打牢固而悟的话，智慧就能很深利，烦恼也能有效降伏，能得到真实的功德受用。     </p><p>十、如何作参究的功夫</p><p>比如说现在要参究意根是否是舍受这个问题，有个话头或者是事例比较长一些，如：人在非常高兴时手舞足蹈、兴高采烈，在生气时恶语相加、大打出手。首先我们要知道，这些身行和语行，是意根主导指挥造作出来的，里面有身识和意识的参与，还要眼识和耳识的参与，几个识共同合作，出现了这些身行和口行。既然是意根指挥主导造作出来的，那意根为什么要指挥造作出两种不同的身行和口行？为什么高兴时，意根指挥造作手舞足蹈，表明了自己的高兴和兴奋，为什么生气时恶语相加，表明了自己的嗔心气愤？意根是否在高兴时不高兴，只是舍受，是否在生气时不生气，也是舍受？意根是否没有高兴的情绪和生气的情绪反应？如果意根没有高兴的情绪，不觉得快乐，为什么还能主导六识手舞足蹈？如果意根没有不高兴的情绪反应，没有苦受，那么生气时为什么还能主导六识大打出手？</p><p>这些问题虽然长一些，但是意识要仔细思惟分析，把这些语言当中的意思都了别清楚透彻，这时是有语言文字和声音形象的，心里要反复出现语言文字相。意识把这些语言的意思在表面上弄明白以后，就要把这些意思凝聚成一个点，无形无相，交给意根，然后心里就深深悬着这个无形无相的意思，这是意根的思量方式，没有语言文字和声音，静悄悄的，深深的，连续的，朝也斯暮也斯的，绝不移转的，最后梦里梦外都不放弃的，这就是意根的参究，以意根为主，意识为辅。前边在思惟理解语言文字内容时，是以意识为主，意根辅助意识，现在正好相反。这就是真正的参禅方法，是真正的参究功夫，因缘一到，必能破参，找到答案，证解心中所疑，疑情大开，参禅证悟。</p><p>意根在参究意根自己的功能体性时，也没有意根和自己的概念，不与概念和文字相应，没有语言和废话，直直白白，简简单单，利利落落，直趋中心和重点。祂可以不影响吃喝拉撒，不影响行走坐卧，不影响五阴的正常生活活动，只是没有杂念，没有更多的心思，比较专注，不杂用心。</p><p> 这是意根对自己的参究，参究如来藏也是如此，参究任何法义都是如此，无论有多深的法义，都要如此做功夫，都要如此用功。意识和意根互相紧密配合，如来藏当隐形助手，无名的资助者，供养参究所用的一切所需和给养。     </p><p>十一、如何是离心意识参</p><p>过去学人问禅师：参禅时如何用心？禅师回答说：离心意识参。过去的学佛人几乎全部都有禅定，有禅定的人比较容易用功，也会用功，所以悟道的因缘容易成熟。所以禅师们虽然不懂意根的体性，却会参禅，告诉徒弟们参禅的诀窍，不要意下卜度，不要情思意解，离开意识，少用意识琢磨推理。这种参禅方法用心就很深，功夫踏实，禅师上堂开示的时候，下边的人随时就可以悟。在别人看来好像很容易，可是他们的功夫做得很到位，一天二六时中，不杂用心，全部参禅，包括下田间劳作，烧火做饭，甚至睡觉时也能用功。如果意识用功，睡着以后功夫就断了，意根用功时睡着了也不耽误事。</p><p>后来有的人就不老实用功了，三一群俩一伙聚在一起研究公案，禅师看见了就会一棒子打散，不许研究讨论，也不许看书，佛经也不能看，全身心的用功参禅。   </p><p>再后来，六祖坛经流传开，实修的人渐渐就少了，每个人手捧着坛经开始口若悬河，雄辩滔滔，都以为自己有道，于是禅宗衰落凋零了。现在的人比起那时候的人还能口若悬河，雄辩滔滔，有过之而不及，人人会讲，鹦鹉学舌，却人人没有真功夫，口里喊着实修实证，脚却踏在云端里，没有天梯却都能上得去。</p><p> <strong>第二节  参禅所需要的禅定</strong></p><p>一、禅定具足时才能随机悟道</p><p>禅定通于外道，有禅定不一定有道，但是没有禅定，一定不能有道，离开禅定，不可能成就道业。没有定力的人，心思粗糙，不可能参透较深的佛法之理，那就不可能真正完全的断我见和明心。所以，参禅需要极好的定力，在参禅之前一定要修好禅定，然后再参禅。</p><p>历代祖师都教导弟子要修定，过去寺院里设置的禅堂就是供学人打坐修定、参禅用的。唐宋时期的修行人各个都有禅定，那时经书很稀有难遇，极少能遇到读到，学佛人只能打坐修定，所以他们的定力都很好。静中的定和动中的定都具足，心不外缘，常在定中，所以他们遇到禅师开示佛法真实义时，很快就能悟入，也能随时随地的离世和投生，随心所欲地投生适合自己学佛修行的父母家。</p><p>具足那么好的定力，禅师们上堂随机讲法时，有人堂下就开悟了。过去的学佛人二六时中都在参禅，都在思惟佛法，所以他们触缘随即能悟。他们那时没有太多的禅法知见，没有很多的佛法理论，只知道如来藏真如心的一些体性，并且信受不疑，就开始参禅，寻觅如来藏，所以悟的比现在人要快要容易，就是因为戒定慧具足，善根福德也具足。过去禅师讲法的语言都比较隐晦，表达的都不太直接和显露，如果学人的戒定慧不具足，就很难证悟。不像现在，佛法已经说得很清楚了，学人还仍然不明白就里。</p><p>二、参禅需要有色界的初禅定或者是初禅之前的未到地定，才能参究真心如来藏，从而能够破参，觅得真心如来藏。就是相应于欲界第六层天的定，定再深或者再浅，就不好参禅体究真心如来藏。定如果再深，就进入了二禅，眼不见色，耳不闻声，没有五识，只有意根和意识心，就不能在身口意行的真妄和合上觅得真心。进入深禅定中来寻觅如来藏，是不容易觅得的，那时的意识心比较微弱而不灵敏，很难发现哪个是真心如来藏，况且这时身行口行也没有了，只有微弱的意行，意识心不容易在意行上面找到真心，很难找到。寻觅如来藏是在身口意行造作的当下，尤其是在身行和口行的造作当下，在真妄和合时才能找到真心如来藏。</p><p>意识微弱，意行很少时，很难找到真心如来藏，如果不是极好的根器，就不要指望入深定中明心开悟。定浅了，或者没有定，意识心就比较散乱，心思粗躁，也不能打开智慧悟得真心。在中间的未到地定或者初禅定中，意识不散乱，比较专注，就可以达到一心不乱，这样思惟比较细密，容易打开智慧。</p><p>开悟是不能离开意识的制心一处，也离不开专心致志的这种专注力。所以参禅开悟，不能在定很深，也不能在定很浅的状态下来悟。 凝心一处、制心一处的禅定功夫修出来以后，还得知道这一处是什么处？这时得要知道参禅的方向和入手处在哪里，否则还是不能悟。要知道悟个什么，悟的标的是什么，如果不知道，还是没办法开悟。</p><p>明心之后，智慧打开，知道如来藏是如何配合五阴和七识运作的，身口意行是怎样造作出来的，如来藏的一些体性能够观察一点，以后也能够知道一切事情生起的因缘。这时如果没有修得甚深的禅定，就不可能有神通，也不能知道世俗上的秘密事情。开悟的境界与禅定的境界不同，二者是不能混在一起。知晓一切，那是神通禅定境界，与开悟无关；虚空粉碎大地平沉，那是禅定境界，也与开悟的智慧境界无关。</p><p>三、戒定慧还没有修好，六度没有具足的时候，还不到参禅的时候，那就且慢参究，禅定要跟得上才行。如果禅定不好，就无法真正用心观行，观的也不会深和透，犹如雾里看花。但禅定不足，观行就成为了意识的研究分析，虽然也能研究出一个相似的结果，但是身心却没有受益，没有功德受用，这是非常不足取的。菩萨六度尚且不具足，如果急于参禅，往往事与愿违。师父不给大家拔苗助长，你们也不要自己拔苗助长。一颗小树苗，刚刚露头，却给它拔到一米高，这课幼苗还能活吗？幼苗死了，小树以及大树就没指望了。学佛这一生被解悟，不仅这一生人才废弃，后世这个人也不容易成为人才，拔苗助长毁的可能不是一生，下一生的栋梁都无法成就，就失去了成为栋梁的机缘。</p><p>不少人都劝我赶快搞禅三，我问为什么要搞禅三？他们说引导三天参禅准备开悟。大家说说我能不能三天让大家开悟？香岩禅师在他师父身边当十八年侍者，那个根器那个方便条件都没有开悟，如今末法时代的众生，没有禅定，不能持戒，菩萨六度不具足，给三天的机缘就能开悟吗？那佛陀在世间，娑婆世界末法时期会有多少人开悟？佛陀为什么不这样搞？</p><p>但是三天时间我可以让所有人悟，不是不可以。一句话的事，不难。可是大家这样悟了之后，每个人会成为什么样？娑婆世界会成什么样？佛法的走向会变成什么样？</p><p>古代曾有禅师，弟子在狭路堵截，拿刀威逼相向要禅师说出密意，禅师面对这样的情事也毫不畏惧，不肯直答。只是一把推开弟子说：你过来，我过去。这是对弟子高度负责的师父，不做买卖和交易，也不炫耀自己度的弟子多，自己有多能。弟子因缘条件具足则自动悟，因缘条件不具足则再继续补足六度条件，修戒定慧，绝不送人情。古代这样的实例很多，这才是对佛教对众生负责的好禅师，只有如此，才能报四重恩，不为个人名闻。</p><p>佛法流久成弊，其实在佛陀灭度一百年时就开始有弊了，开始一点点变质了，把生灭法说才成水老鹤，已经让阿难痛心不忍，涅槃走人。如果阿难来到佛法已经流传二千多年的如今世间，估计他一天也不想留，一点恶法恶习也不想知道和容忍。还好他修出了四禅和神通，有说走就走的本事，可以眼不见心不烦。没有他那样本事的菩萨该怎么办呢？只有容忍、接受，再想办法转化恶的风气，没有什么退路。   </p><p>四、定力深时意根才能参究</p><p>参话头就是参究直指如来藏的一句话，也就是要明了这句话的真实义，从而找出如来藏的真实作用，证得如来藏。参究一句话的义理，也是同样意思，想要明了这句话的真实义。在作参究的功夫时，意识表面粗浅的思惟比较少，其心理活动以内心深层次的思惟活动为主，其心又专又深，能探究出一句话的实质和深层次含义，定浅就做不到了。</p><p>作功夫的无所念而念，是意识表面没有念头，不念法，而意根深处还是有念的，心里悬着念头不断，这就是参究的功夫和状态。用意根的功夫不容易，因为定力不足的缘故。真达到意根用功时，意识也不容易观察得到，意根的作用太隐蔽了，意识的观察智慧也非常薄弱。</p><p>参禅的疑问疑情越切近目标越好，范围越小越好。这与找人是一个道理，把范围设定在全国范围，等于没有设定一样，设定在某个具体区域，就能很快找到人了。只不过是设定的范围越小，需要的证据资料越多，了解到的情况越多，智慧越深细。禅宗最直接的话头是，拖死尸的是谁，在行蕴上证得如来藏最快，但证量小一些，智慧浅一些。如果能在唯识上悟，悟到识心的究竟来源处，则一通百通，尤其是在意根的功用上悟最直接而究竟彻底。</p><p>五、有一些人长期修无念无想的定，不管修多长时间初禅也不会现起，也不会见道开智慧。这样修就是在浪费宝贵的学佛时间。长期无念无想，没有对佛法的如理思惟观行，无法出生任何智慧，不能证道，命终要如何安置这个有漏身？定力修好了，知见具足时，在禅定中就要有参究的念头，不能再百无所思了。有念头有疑情，才能破除疑情，获得智慧。没有定，有疑情，难听的话叫作瞎琢磨。</p><p>只修身体，不修心，入定不管多长时间，也不会出现初禅定。对欲界离欲，去贪去执，初禅定才能出现。长期在未到地定黑暗暗的境界里安住，有何益处？</p><p>六、修行要定慧等持</p><p>佛说菩萨们修行应善于修定和修慧，如果发现自己定多慧少，就要多修慧；如果慧多定少，就要多修定，尽量要做到定慧等持。虽然菩萨都是慧大于定，但是定慧之间的差距也不要过大，否则佛法修行就要受到阻碍。外道有定无慧，罗汉定多慧少，菩萨慧多定少，佛是定慧等持。</p><p>菩萨真正成就的标志是慈悲喜舍四无量心，有这些心性才代表此人是一个真正能利乐众生的菩萨。一个有狂慧的人不能代表此人是真正菩萨，心性不调柔故，不能利乐众生故，我心重故。所以我们学佛修行，最重要的就是修出菩萨的慈柔的心性，悲舍于众生，修行的最根本目的是为了众生，不是为了一己之私利，真正的菩萨应该是这个心念。</p><p>七、修行必须是定慧齐修，按照佛陀教导我们的修戒定慧的方法去修行，不能脱离佛陀的教导，自己想怎样修就怎样修，那是不行的。如今这个世间现存的环境条件，使得众生都是很难修定，不能因为定难修，就只强调一个动中定，或者只强调有个粗浅定就行了。定浅的人，烦恼是非非常多，一个团体就会非常混乱，大家在一起，就会有很多纠结和矛盾，你争我斗非常激烈，那样哪个团体也不会和谐团结，就会导致佛法慢慢消失灭亡，佛教就会垮掉。而且定浅的人，观行非常不得力，别看他口中振振有词，头头是道，滔滔不绝，大多数都是从外学来的，不是自己用功观行出来的，因此就不属于自己的智慧，对于生死问题就没有办法解决。<span> </span></p><p><strong>第三节  参禅的用功方法    </strong>    </p><p>一、参禅的方式是寻和伺</p><p>参禅最初用功是用寻的方式。寻，就是意识心比较粗燥地寻找第八识这个目标，因为定力不够深，慧力就不够大。当定力好，意识心也很深细时，参禅就可以转为伺。伺，就像猫发现了目标，不动地方地在那等着目标出现。因为意识心已经发现了第八识出现的大致目标，就能很深细地观行，心念几乎不动。参禅，这时就应该有方向了，知道第八识如来藏大概在哪里出现，意识心才能如猫伺鼠的静悄悄的观察，才能深细思惟观行，这样离悟道就不远了。</p><p>参禅这个法，是真妄心和合在一起才能进行的，真妄心要同时起作用。其中真心第八识不能进行思惟活动，祂不能分别法尘，不能进行直接的参禅活动。妄心意识能思惟一切法，了别六尘，也能配合意根参禅，所以还是以妄心为主来进行参禅活动。因为意识心能够对应法尘，分别法尘，其分别思惟可以非常的深细，了知性非常强。在比较深的禅定中，意识把自己所了知的法传递给意根之后，不动用过多的心思干扰意根的思量，意根就会专心的参究考量意识所传递过来的信息，从而证悟。</p><p>参禅就是所谓的思惟修，也叫作参究。意识参禅虽然离不开思惟，但也不是凭空想象，不能情思意解，不能有太多的分析，也不能臆想。需要在定力具足的情况下深细参究，那是深层次的思惟，已经深入到了意根。这种思惟是很深细的，思想念头几乎不动，近乎于在等待。先是寻找目标，找到第八识出现的目标以后，就要如猫伺鼠，就等着抓住祂了。这个时候也不是被动地等待，内心还是有深层次的思惟参究活动在进行着，很隐秘很细心的探寻虚妄法背后真心运作的蛛丝马迹。</p><p>参禅的最初阶段是寻觅或寻找，主要是意识寻觅，最后才是伺才是等，思想动得又深又慢，这是动用了意根，参禅达到了意根。有人说参禅必须离开意识心，如果离开意识心就没有思惟可言了，离开意识心就是灭去了意识心；没有了意识心，就是处在无想定中或者处在睡着无梦时，没有意识心就不能参禅。二禅以上的意识心太微细，也不能参禅。参禅的定境要把握好，才能处于最佳的参禅状态，最后才能明心或见性。   </p><p>二、精思等价于参禅和止观</p><p>世俗法当中有一句话叫作精思可以入神，精思就是深细的思惟，然后就能得定得止，这是由观入止。由止还可以深观，止观等持，止观互助。我们读经时可以深入地慢慢地思考其中的一句话，一个义理，把所有的注意力都集中在这句话上，把定力引发出来，借助这个定力，观行思惟就可以做到非常的深细。进而就能进入未到地定中，又能进入有觉有观的初禅，也能进入有觉无观的初禅到二禅之间的定，再把有觉无观当中的觉和观灭去，就能进入到二禅中。</p><p>观行，深细地思惟一个法义，入定就很快，定力提升也很快，明理也很快，在思惟定中，身心都是愉悦的，精力充沛。要想提高定力，可以找个没有人打扰的时候，观行思惟一两个小时，就会发现定慧齐生，身心安稳。实在没办法修定，不能进行深细思惟观行的，就是福德还不够；福德严重不足的，就会原地踏步不前。要想增加福德，就要多发大愿，多考虑他人，少存私心慢心，减少性障就能增加福德。</p><p>深思的法义，每个人的大方向应该是相同的；具体的法义，每个人所面对的都不尽相同，都有自己目前所解决不了的疑问。把这个疑问深悬在心中，思惟观行，心心念念都在这个疑问上面，心无旁骛，这就是定；有了这个定，再进一步深细思惟，就能把疑问慢慢解决了。</p><p>只要我们把福德修足了，修定就不难，修行一切法也都不难。而我们的清净大愿如果能够发出来，福德的集聚就很快，性障烦恼如果能够降伏，福德集聚的也能快。这样佛菩萨加持力量就很大，我们的道业进步就会很快。每个人不要心心念念都是我，动不动就是我，遇到事情就要把自己突出出来，摆出来，那样佛菩萨的加持力量就非常的小。因为这样的人对佛教对众生没有多大用处，加持以后还是为自己，只想到个人的利益，这样的人，佛菩萨的力量就加持不上了。</p><p>定力还没有修好的人，要多检查自己的福德是否已经具足，检查自己的烦恼性障是否已经减轻，检查自己内心里是否是贪着的东西还很多，牵挂的人事物很多，惦念的事情很多，平时很多事情都摆不开，心里念念都是世俗法，心不太平。也要检查自己是否愿力不足，只是随缘度日，没有方向和目标。检查出来以后，就要想办法弥补这些不足和努力消除自己的性障烦恼。如果检查出来后还克服不了，就多念楞严咒，靠佛菩萨和护法神来加持自己。</p><p>我们现在的修行目标是降伏自己的性障烦恼，多检查自己，找自己的不足，修自己，大家在一起和谐相处，小心自己的语言不要伤人，如果他人有错，尽量善巧方便帮助他人；如果他人没有错，加以批评指责，就要损失自己的福德，对他人是有利，而自己就要背负一部分的业。我们的福德是在每个无意间流失的，自己却浑然不觉不知。凡事都要占上风，说上话，私心慢心很重，这样就损自己的福德。谦下平和才是福，尽量降伏自己，虽然降伏自己非常不容易，但也得要做。福德大的人，烦恼就轻微，慢心也轻微。能知自己恶念不少的人是有自知之明的人，意识五十一个心所法里恶法要远远多于善法，所以每个人都不要认为自己很好，不要自信满满就认为自己一切都好都对，这样就没办法再进步了。  </p><p>三、理修和事修入道方法</p><p>外息诸缘，内心无喘，心如墙壁，可以入道。这是达摩祖师说过的一句话，这句话可以有两种解释，第一种说的是一种修行当中的定境，另一种暗指第一义谛。从第一义谛来说，真如理体如来藏，没有外也没有内，没有外缘，不攀缘任何一法；祂不了别一切尘境，不知一切境界善恶是非如何，因此自心没有思虑，没有思想，没有知见，没有看法；也因此故，一切外法不能入心，心内又不出思想观点见解，如来藏心就像墙壁一样，内外不通，也没有内外。那么了知了如来藏这样的体性以后，就可以参究祂取证祂，从此以后就入道中。这是理修入道。</p><p>从另一方面说，就是事修入道，事修就是通过修定，然后定中参禅证悟如来藏。这种定可以是色界初禅定，也可以是初禅以前的欲界未到地定。达到这种定时心念集中，就可以参禅、参话头，参通了就开悟。具体说来，修定修到能够不再攀缘于外界的色尘、声尘、香尘、味尘、触尘，心里也不再攀缘其他的法尘，不打妄想，不回忆，不杂乱思虑。把心修到就像墙壁一样，贪嗔痴烦恼都进不来，无关的六尘也进不来，而能专注于一个法上，思惟参究真如之法，如来藏之法，参一个公案或者参一个话头。因缘时节具足时，就能找到答案，明得法理，证得真如心体。</p><p>话头可以是：拖死尸的是谁？念佛的是谁？吃饭的是谁？走路的是谁？也可以思惟参究佛经中的一句话，比如《楞伽经》中佛说：如机关木人，机发相起。这句话能检验出学人是否真的悟道，悟的对与不对。如果悟错了，这句话的意思就不能懂，也不懂菩萨举足下足皆从道场来这句话的意思，这是《维摩诘经》中的句子。话头还有很多，能契合自己根基的最好。总之，这种定在现在这个世道不太好修。唐宋朝那个时候极大多数人都有这种定，所以悟道就很快。   </p><p>参禅不一定都要坐着，行住坐卧当中都可以参禅，随时随地都可以参。心思集中，心无旁骛，触境遇缘时，随时都可以悟入。从古到今悟道的祖师极大多数都不是在坐中悟的，坐中也不好悟。有的人是听人说一句话就悟的，有人是听声音悟的，有见色时悟的，也有嗅香时悟的。他们都是参禅已经参到一定程度，被偶然一个机缘触发灵感而悟道。也有很多人是听师父开示而悟的，也有的人是因为师父打一拳一棒一喝而悟的，每个人的悟缘好像都不一样。参禅也需要修到了一定程度才可以参，定力不足，不能强参，强参无益。定力已达到欲界未到地定，行住坐卧心能不杂乱思惟，能够专注于一个境界，才是参禅的最好时机。这时候再来参禅就能起疑情，解决了疑情，很快就能明心开悟。  </p><p>四、参禅的方向</p><p>参禅的方向，应该在行住坐卧的一切五阴活动当中，在每一法现起的时候，探究它的实质究竟是什么。都说五阴是虚妄的，既然是虚妄的，为什么还能出现呢？行住坐卧的行阴都是幻化，究竟是如何幻化的，是谁幻化的这些相。打坐时，有打坐这个人吗？是谁在打坐？第八识如来藏不打坐，第七识意根不打坐，意识心也不打坐，前五识也不打坐，身体如果没有识心也不会打坐，那么我们想一想，有打坐这个人吗？是谁在打坐呢？打坐这个法是如何形成的呢？这就是参禅，参通了，就开悟。</p><p>在我们说话的时候，应该想一想：是谁在说话，有说话的人吗？说话这个法是如何形成的呢？第八识如来藏不说话，第七识意根不说话，意识心不说话，前五识不说话，舌头如果没有识心也不说话，否则死人也能说话。到底是谁在说话？又是如何说话，语言如何形成的呢？这就是参禅，参通了，就开悟。念佛究竟是谁在念呢？读经究竟是谁在读经？对于一切事都要起疑情，因缘到时，就能解决疑情，破迷开悟。   </p><p>五、直觉与参禅的关系</p><p>参禅参到最后的参究状态，是一种没有语言文字相的“寻伺”状态，也就是深入到了意根，意根参与了参究活动。而直觉就是意根的功能作用，是意根的觉性，是意根的感知，语言不容易说清楚，因为意根不与语言相应。意根的直觉作用是很大的，也比较准，很多人都是相信自己的直觉。</p><p>心里所有的问题都属于法尘，如来藏把法尘变现出来的时候，意根先触先知，然后产生觉知性；有的法尘意根能明白个大致情况，只是不细致不具体，然后意根指引意识再触法尘，仔细观察问题，分析问题。有些时候意识是要按照意根觉知的方向入手思惟分析，最后才把问题搞清楚。往往是当意识顺着意根的直觉方向去思惟时，解决问题就很快，又比较准确。</p><p>而参禅和参究，是意识和意根共同配合，把一个问题搞清楚。意识需要意根的直觉作用配合，意根需要意识的逻辑思惟和分析的数据，意根用这些数据，再加以感知和验证，就把问题敲定了。</p><p>把那种直觉感知，一直带着，既是禅定，也是参究活动，深入到意根了。多数人都有此经验，就是不懂，也不会利用。深入参究时没有动用意识思惟分析，而是意根在暗暗的深深的思量着，祂又不能表达，不与文字语言相应。意识再轻微的配合，以意根为主，就是参究的状态。以意识为主是思惟分析的状态，比参究的状态层次要浅一些，这是参禅的前行方便，后续才能出现参究的状态。</p><p><strong>第四节  如何寻觅第八识</strong></p><p>一、参禅寻觅证悟第八识，不仅要了解第八识的体性，更要知道祂都在哪里显露头角，在何时何地露出踪迹。这样我们才能在某时某处去捕捉祂，去与祂相认，从而携手归家稳坐，其乐融融。</p><p>第八识出现的时间和处所是在哪里呢？第八识时时刻刻都存在都显现着，时时刻刻都在起作用，与五阴身不离须臾。在六根处，在六尘处，在六识处，在十八界上，在五阴上，到处都有祂的显现，处处都有见祂的缘，处处都能得逢渠。就像过去禅师所说的生缘处处，哪里没有祂，哪里不是祂，祂活活泼泼，触缘皆是。</p><p>这样找到祂的机缘就有无限多，不是意识尽量不去分别。如果意识不分别，你又如何识得自家宝贝，如何识得久违的父母双亲，而在分别之处，也正是祂大显身手的时候！第八识自心本来就是离念的，祂不念诸法，也不行诸法，不用我们刻意把意识心也修成无念。修成的无念，无论如何也不是本来就离念的第八识，因为心体不同故。就像白薯漆成红色，也不可能是红薯，本质不同故。</p><p>所以参禅寻觅自心第八识，不用把意识心离念，根本没有这个必要。第八识不仅在意识离念时显现，更是在意识念念动转时显现，而且生机勃勃。第八识的踪迹遍一切时，遍一切地，遍一切处，遍一切界，遍一切法，任何时候，任何处所，第八识都是活灵活现地显现着，从来不隐藏丝毫。如果意识心离念是就有第八识或者就是第八识，那么意识心又有念了该怎么办？有念无念本是生灭变异法，第八识心体永远不生灭，不变异。</p><p>还有人说，第八识是无所住的心，要想证得第八识，我们的意识心就要念念不停留，也要做到心无所住。暂且不论意识心能不能做得到无所住，即使意识心真的修到了无所住，也仍然是意识心，不可能变成第八识，两者本质不同故。第八识的无所住是本来就无所住，祂根本不管意识心的住与不住。而当意识心念念不住的时候，也正是第八识大露风光之时。我们尽管停留尽管住，停留之处，住之处，就有第八识的身影，这时识得祂，就可回到祂的家乡。</p><p>第八识既然遍一切处，哪里不是祂，何处没有祂？没有祂，就没有一切，也没有何处，也没有哪里；有祂就有一切，就有何处，就有哪里。多么灵活的法，不必把意识弄得死死板板的，也不必在意识心上大作文章。我们只要用意识心反观，观其来处，观其起处，自然就能找到归家之路。证得祂以后，智慧就能生起，从而发起实相般若智慧，等到智慧圆满具足之时就可成佛。</p><p>二、真正的念佛是念如来藏</p><p>佛藏经中说：念无所念即名念佛。念这个“无所念”的法，就是念佛，这个“无所念”的法就是指如来藏，这是证悟后的念佛。悟前参禅参究如来藏的念佛，是把如来藏无语言文字形象地记挂着，就是以念佛作为参禅参话头的一种方式方法，无语言文字形象地记挂着如来藏就是看话头。</p><p>真正的佛如来藏，祂本身是无所念的，祂不念任何一个法，因为祂不见不知世俗法，也不攀缘任何法，不记挂任何法。真正的念佛，就应该念不生不灭的真实如来法身佛。但这是在证得如来藏以后的念佛，知道祂在哪里，功德体性都是什么，如何起用的，理事能圆融在一起的念佛。证悟如来藏以后，念如来藏的真如性和功德性，念祂的有为性和无为性，才是真正的念佛。</p><p>在悟前都是念假佛，或念相似的佛，或者是念假想出来的如来藏和真如。这些都是相似的念佛，不是真正的念佛。看话头，必须得有一句话作为话头，看话头功夫纯熟之后，再参究话头，因缘具足，就能明心证得如来藏。心里记挂着第八识如来藏，这不是看话头，是一个词组不是一句话，可以算是相似的念佛，对修行也有很大的帮助。</p><p><strong>第五节   参禅证悟的前提条件</strong></p><p>一、六度是参禅的基础</p><p>顿悟的前提是渐修，任何顿悟的人，都要经过或长或短时间的渐修过程，没有渐修，就没有顿悟。要想顿悟，就要把基础打牢，菩萨六度是基础和条件。要想成为菩萨，就必须具备相应的菩萨条件，并非无缘无故就能成为菩萨了。解决无量劫以来的生死大事，不是一件简单的事，一定是要付出相应的代价才能办得到。</p><p>只要这些条件达成了，一定能顿悟，因为开悟没有名额限制，世间法中的好事都有限量，也许还要投机取巧走后门才能成办，开悟明心这个法不用，谁够条件谁就能悟道，他人无法阻止。所以一定要修好自己，完善自己，让自己向圣贤靠拢再靠拢，最后就能进入圣贤群里。</p><p>现在的学佛人有一种急躁情绪，不打基础，六度不修，直接参禅，马上就要悟，很多人的心态是只要第七层楼，不要一二层。世尊反复讲菩萨六度，福德和戒律都非常重要，心性的降伏也是极其重要的，学佛人都不管这些，只求最后一个般若慧，这是不可能得到的。智慧的获得要有一些前提条件，就是福德资粮要具足，戒律也要受持，这样定才能够具足，最后才有慧的出生。</p><p>我们不能只在理行上、慧行上用心，不在基础的福德与戒律上面用心，这样修行不可能有成就。我们必须要信受佛语，佛让我们作的，我们一定要努力作到。皈依、受戒、守戒、降伏心性都是很重要的，不能抛开这些条件就想直接得果。一个世俗染污很重的人，是不可能成为圣人的。修行人与圣人之间的差距不能太大，所以五戒、八关斋戒、菩萨戒都应该受持，心从世俗法中稍微脱离一点才能证道，才能进入圣人的行列。</p><p>二、参禅之前要积累足够的福德</p><p>学佛修行不能急着参禅开悟，如果很多基础的东西，资粮道粮还不具备，菩萨六度没有修好，暂时不要参禅，参也是意识心在那里猜测揣摩，不能参通。初学佛的人应该着重福德的修行，多修福，戒定慧才能圆满，那时再来参禅，一参就成功，就容易开悟。如果福德不具足，修着修着就要掉队了，就会被各种业障卡住了，不是退道就是原地踏步。</p><p>有一些年轻人头脑智慧很好，就是不修福，再聪明伶俐也修不上去，退失道心的大有人在。相反，有些年龄大的人，觉得自己的腊头短了，寿命不长了，修行就很精进，积极布施，积累福德，虽然比较笨，记忆力也不好，但是却一直能够跟着修下去，而且智慧都在增长。我们不能轻视修福，以为修福不重要，其实修福很重要，而且是修行的第一关口。当你福德足够了，冤亲债主拿你也没有办法，根本阻碍不了你，你就不容易被业障障住。</p><p>积累福德很不容易，我们多生多劫心里的惯性势力很大，悭贪吝啬的心理作用很大，舍不得把自己钱财布施出去。那么平时应该多注意不要白白消耗福德，或者少消耗福德，在世间生活中，少些享受。更要注意不要损减福德，尽量多为别人付出，不要让别人为你自己付出。多恭敬他人，不要轻视蔑视他人，为人不要处处想占上风，不求他人恭敬奉承，对人要多说柔软语、和气语，为人做事不求回报等等。尤其不要惹父母师长气恼，不要让父母师长多费心思，尽量孝顺父母师长，这样得福又多又快。</p><p>修福得福最大最快的就是供佛，每天要坚持供佛。所有的素食，不管生的或熟的，都可以拿来供佛。新衣被褥都可以供佛，各种蔬菜水果，粮油米面都可以供佛。拜佛也是积累福德的好方法，读经打坐修定也是修福，各个方面的福，我们都要修积。布施的福要修，钱财物品的布施，帮助众生的无畏布施。法布施，自己还没有什么佛法证量时，可以选择佛经，为人介绍佛经，网上发佛经，或者认准是正确的有益的佛法，都可以发到网上，向其他人宣传。可以介绍道友来学习正法，如果他人获益，自己的福德就能增加。别人因为你得到法益，自己就增福。相反，阻碍他人闻法，就损自己的福德，未来世还有恶果报。</p><p>三、先断我见再参禅最省力</p><p>要参究如来藏，最好是修足了定力再参，这样对五阴的各种活动都能生起疑情。定力不足时，五阴的虚妄性没有观行通透，我见不断，如来藏的体性思惟不清楚，疑情就不容易生起。关键点还是五阴虚妄之理不透彻，心里没有否定五阴的一切活动，就会认为五阴的各种活动是理所当然应该存在的，是自然而有的，那样就不能怀疑五阴的动力源泉，也不会观行五阴是如何现起的，也就不能参究及寻觅与五阴同时存在的如来藏。小乘的底子如果牢固，断了我见，不必特意生起疑情，再有制心一处的定力，疑情自然而然就能生起，然后参究如来藏就得心应手，容易契入了。</p><p>断我见时，要观察行住坐卧以及言谈语笑当中自己整个五阴的虚妄性，观察色身的虚妄性以及意识心的虚妄性。虽然在知见上，在理论上知道身体不是我，六识和作主识也不是我，我是无形无相的，但是意根还没有认可，意识心虽然知道自己虚妄，也没有实际的作用，作主导的还是意根，身口意行的造作还是意根说了算，意根不知真理，内心还是要以意识为我，认五识和意识的细微的功能作用为真实不灭的，认自己的作主性是真实不灭的，这样参禅就大费周章。</p><p>要想真正断我见，必须深入禅定，再细心思惟，反复熏意根，让意根了知五阴的自己确实是虚妄，不真实的。当因缘成熟时，意根就会认可五阴的功能作用并不是真实的，不是我，那时内心就会发生大的转变。以后再参禅寻觅真心如来藏，证悟就相对容易一些。</p><p>先断我见再参禅，参起来就比较轻松，五阴死透以后，疑情才能生起，带着疑情参禅，证悟就很快。定力如果不足，不能生起疑情，慧力不足，也不能生起疑情。时常检查自己用功的方向对不对，方法合适不合适，六度条件还欠缺了什么，然后想办法圆满菩萨六度，以后必成为真正的大乘菩萨。</p><p>平时要多检查自己的菩萨六度条件已经具足了多少，还差那些，不足的条件再努力去补足，尽量完善这些条件。还要检查自己的心性和愿力如何，心量扩展了多少，眼界放大了多少。我们要修的内容实在很多，每个内容都要稳稳当当的一步一个脚印地实际修持出来，这样就能不知不觉地层层增进，成为大乘真实义的菩萨。一个能够悲悯众生的人必定是真正的菩萨，真正的菩萨一定是实义菩萨，所以菩萨的标志，总括起来就是慈悲喜舍，这是菩萨的最根本标准。</p><p>四、断了我见才能触证如来藏</p><p>在触证如来藏之前，首先会出现暖、顶、忍、世第一法。暖顶忍世第一法，是指通过参究如来藏，或者通过修学阿含经中的五阴无我之理，内心里逐渐否定了五阴为我，智慧逐渐清明，逐渐明朗，最后完全认可了五阴非我不异我，断除了我见，超越了世间凡夫，成为世间第一之人。只有在完全否定了五阴之后，否定了七识为我之后，否定了六根六尘六识之后，才能证得真实的我，从而开悟明心。过去禅宗祖师说：“打得五阴死许汝法身活”，也就是这个意思，只有先否定了五阴的真实性，断了五阴为我的我见，清净而真实的法身才能活灵活现的显现在心中，立时确认这就是自性，这就是如来藏，这就是法身。一死一活之后，成佛的基础就建立起来了。</p><p>虽然二者之间可能会在极短的时间内，甚至在否定五阴的一瞬间找到了如来藏，那也是断我见之后的事。一般人都说是在明心之时或之后断我见，可是实际上不否定五阴和七识，是不能证得如来藏的，因为五阴七识的迷雾在遮挡着如来藏的显现，鱼目混杂，暂时还不能辨别真假。一旦断了我见，否定了假，真就跃然而出，就证悟如来藏了。如果没有否定假的五阴，智慧之眼不得现起，无法识得如来藏，还要继续参究，直到断除我见，然后才能找到不属于五阴十八界中的如来藏，也许这属于一瞬间的事。</p><p>五、“桶底脱落”的前提条件</p><p>过去的参禅人，参到找到第八识悟道了，就说是桶底脱落。什么是桶呢？楞严经中佛把人的身体比喻为一个肉桶，形状就像一个桶。而众生就是把这个肉桶当作自己，当作真实存在不灭的我。当参禅人悟得第八识的时候，就知道第八识是真实的，永远都不消失，是真正的自己，五蕴身只不过是第八识所变现出来的一个假壳子而已，非为真实，非是我，但也不异第八识这个我。这样他就不再认五蕴为我，否定了五蕴身这个肉桶，卸去了五蕴重担，这时身心皆空，轻安无比，就比喻为桶底脱落。</p><p>桶底脱落的前提条件是：戒定慧要具足，福德要具足，菩萨六度也修完了，入道的资粮也已经具足，时节因缘成熟之时才能桶底脱落。这时也同时证得小乘的初果，断了三缚结，永不下三恶道。因为小乘初果是证五蕴十八界苦空无常无我，悟得第八识时也就知道五蕴十八界非我，是虚妄、空幻、不真实的。所以证得大乘果的同时也证得小乘果，但证得小乘果不一定能证得大乘果，这就是大乘法包括了小乘法的道理。</p><p>六、六度满足念佛时才能证悟</p><p>念佛的心有两种，一个是真心，一个是妄心，二者和合一起运作，我们才能念佛。在念佛这一法当中，我们就能找到真心第八识从而明心开悟，获得般若智慧。如果找到的是妄心，那就是错悟，大多数人都是错认妄心为真心，因为福德禅定智慧资粮都不够，这样就不可能找到真心，只能认妄为真。</p><p>在现前当下的一念当中，也是有真心和妄心在一起和合运作，在五阴的任何一个法当中，都是真妄和合在一起运作的。比如眼见色，耳听声，鼻嗅香，舌尝味，身觉触，意思法，在六根门头都是真妄和合在一起运作，都是有真也有妄。大多数人只能认个妄心，还不能认识到真心。因为妄心很容易找到，不用多少福德、禅定、智慧，也不用太多修行就能知道，所以错悟的人满山遍野，真悟的人极少极少。</p><p>念佛时是八个识和合运作，七个妄心一个真心，菩萨六度条件不满足，就会把念佛时的妄心当作真心来承担，那是什么后果呢？任何人修任何法门，都不能脱离佛所讲的证悟之法门。无论怎样修行，要想证悟，都必须满足菩萨六度条件，这六度无论何人都越不过去。即使往生极乐世界以后，花开见佛时悟了无生，也得满足这六度，否则花就不开，不能见佛闻法悟无生。十方世界的佛法都是一样的，达到某个条件就是某个果位，达不到，就不是某个果位的菩萨。</p><p>学佛人对佛法的真实义，有多少是不知不觉，又有多少是错知错解，按照现在众生对佛法的认知程度，即使过去世真正的祖师再来，开示真实的佛法道理，也很难被众生信受。众生之所以肯承认过去祖师大德的讲法，那是因为他们已经有了名声地位，并不是众生自己真正懂得了祖师大德们所讲的法。如果他们现在再来时没有名声，还是照样被否定得一塌糊涂。</p><p>众生只能认名声大小，不懂真正的佛法，这是如今普遍存在的现象。如果是真正地信受祖师大德的佛法，众生早就不是现在这个样子了，捧着祖师大德的书籍阅读，到底明白了多少真实的义理？真正明白时，就离开悟不远了。不明白，说明还处于盲信仰信崇信阶段，不是正信，修到有正信的程度非常的不容易。</p><p>七、参禅所需要的几个条件</p><p>所谓的参禅，就是观行思惟参究如来藏，证得真如佛性。参禅就像找人的道理一样，要想找到人首先要认识这个人，或者要有这个人的相片，心中知道这个人的模样，才有可能找到这个人。其次还要知道往哪里去找，如果是漫无目的盲目乱找，犹如大海捞针，肯定是希望渺茫。还要把这个人可能出现的地方都要了解清楚，哪里可能藏人，哪里有暗道机关，都要知道。第三，还要有适当的交通工具，有时间，有路费。还得要有识别这个人的眼力，否则即使对面相遇也不相识。最好最稳妥的是有见过那个人，认识那地方的人领路，这是最快的途径。所以找一个人都不是容易的，何况我们无始劫以来一直不认识不了知的真如佛性，更是难上加难。</p><p>所以参禅要把基础打牢，所需要的条件都应该具备。打基础就是修行菩萨六度，差一度都不能证悟，参禅都不会得力。比对找人的方法，参禅找真如心如来藏也需要几个步骤。</p><p>首先就要了解如来藏的体性。熏修大般若经如心经和金刚经等等，具备正知见，然后才能着手寻觅如来藏。</p><p>其次，要知道如来藏都是在哪里显现出来的。通过学般若，要明了祂在五阴的各种活动当中出现，在六根触六尘当中出现，所谓生缘处处，处处生缘。凡是有妄法出现的地方，都有如来藏的显现，每一个法的出生都是真妄和合的。真妄和合之处是很重要的一个观察所在，这个知见一定要具备，非常的关键。</p><p>再其次，既然如来藏是在五阴活动当中显现，所以也要把五阴的体性都了解清楚。七个识加之于色身上就有了五阴，那么七个识就是关键，七个识的体性也要了解清楚。这样就能做到真法清楚，妄法也清楚，当真妄和合时，就可以在各种五阴的妄法当中找到真法。</p><p>这些都是正知见，有了正知见，还要有福德，也要有相应的定力去参究，最重要的，是要有善知识的引导和帮助，才能不走冤枉路，不再盲目做功夫。要想定力具足，持戒与忍辱是前提，还得具备精进修持之心。这些就是菩萨六度的大致内容和条件，具体的内容还要自己细心参阅经典，细心体会，然后具体去做。最后还要等待时节因缘具足时，才能找到第八识如来藏，从而明心悟道。所以满足做菩萨的条件，是我们目前应该努力用功的方向，也是修行的下手之处。修行不能急躁冒进，要一步一个脚印，一个台阶一个台阶的走，脚力不足就不能跑，急功近利的思想必须要克服。</p><p>八、具足菩萨条件才能证悟</p><p>参话头，参通了就明心开悟，就获得了般若大智慧，从而成为真正的有实际菩萨证量的菩萨。而般若大智慧的获得，是修行菩萨六度的结果。那么参话头之前一定要修行了菩萨六度，具足了菩萨六度。如果戒律没有受持，没有修行过布施，菩萨的福德没有具足，修行的精进度不足，对世俗境界的忍度不足，对如来藏法的认可度不够，禅定也没有修持出来，如来藏般若之理也没有充分的理解，那么参话头就是一件苦恼事，即使参一辈子，仍然徒劳无功。</p><p>在成为真正的菩萨之前，检查一下自己的心行心性心量是否与菩萨相应，是否能承担菩萨的大业。禅定不足，所谓的参话头也只是念话头重复一句话的文字而已，心不能住在一句话的前头，都在话中话尾打转。这样修行有何意义？学佛人修学如果都是为了个人，抱着一种自私自利心理，没有一点利人利他之心，自私狭隘绝对不能与菩萨心性相应，菩萨应该具备的福德无法集聚起来，那就不能成为真正意义上的菩萨。</p></div>"
},{
    "title": "第九章 参禅需分清真妄心",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  参禅需分清真妄心</strong></p><p><strong>第一节  真心与妄心的区别</strong></p><p>一、妄心有七个，第七识意根和前六识，真心只有一个第八识。意根是时时处处都在作主宰的心，我要这样，我要那样，我应该这样，我应该那样，总是思量、执取、攀缘不断，时刻做主宰，这就是第七识的体性。而六识是分别六尘的，眼睛一见色尘，就知道是什么了，这个知是眼识和意识的知，二者共同了别色尘。耳朵一听声，就知道是什么声音，这个知就是耳识和意识的知。这些知都是生灭无常的，能生灭变化的就是妄法。打妄想时的心是意识心，知道不打妄想的心也是意识心，这是意识心对自己的反观作用。打坐时，前际已断，后际不生，中间一段了了分明，清清楚楚，这个就是意识妄心，是意识妄心知道自己此刻有没有念头，只要有知就是妄。真心不知入定没入定，不知有没有念想。</p><p>楞严经中佛说：知见立知，即无明本。这是第六意识的知，意思是说把第六识的知当作真实就是无明的根本，就是妄。又说：内守悠闲，犹是法尘分别影事。这也是指意识心中无事，悠哉游哉的境界，就是法尘境界，是意识所分别的，这个心就是妄心第六识，不是真心。打坐坐到一无所知时，第六识也清楚知道自己一无所知，知道自己入定了，这个知就是妄心第六识的反观作用，不是真心。因为能分别和了知自己入定的这个定境法尘的心是第六识，真心不知，不能把这个心当作真心而认为自己悟了，这不是悟境。</p><p>对六尘有知都不是真心的知，真心永远不知六尘。法尘也是六尘之一，入定的境界就是法尘境，是意识心所了知的。即使修到三界当中最高的定非想非非想定，定中还有个想，这个想就是知，也是第六识。灭了知，就证得四果罗汉，马上就入无余涅槃，了生脱死，出离三界，得解脱。所以只要认某个知是真的，就不能证果，不能断我见，这就是生死凡夫。</p><p>定中了别定境，知道已经入定的心是意识心，意识心暂时没有妄念，就能入定。当意识出了定，马上就有妄念产生，一会儿有念，一会儿没有念，变来变去的就不是真实的心，真实的心永远不改变，永远都是如此。况且定中无念的心，保持不了多长时间，早晚都会改变，都是暂时出现的一种无念现象。即使能入定八万大劫，意识心也要出定，一出定照样有念想，照样散乱，因此定中无念的意识心是生灭法。第六识的体性有一点和第八识相像，都是无形无相的，所以就不好分辨。必须把二者的体性都彻底分辨清楚，才不致弄错。这个地方至关重要，生死大事含糊不得，把经典学透彻以后就知道了。  </p><p>二、离念灵知和无念真心的区别</p><p>六祖说的无念是：无者无妄想，念者念真如。这是指真心的无念，真心本来就没有任何念想，真心不会念三界世间里的任何一法。既然真心本来就是无念的，我们就不用把意识修成无念以后，就认为这时就是无念的第八识，这时的无念是通过努力修定后转变出来的，不是原本就一直无念的第八识。如果定力消失了，念头又出来时，第八识又哪里去了呢？第八识是变来变去的生灭性的一个识吗？当然不是，因此一会儿有念一会儿无念的心，根本就不是第八识，而是意识心。</p><p>第八识不是生出来的，是本来就有的，是不生不灭的，谁也生不了祂，反而是祂出生了一切。这些道理都要懂，我们才能明心悟道，才能生出智慧，八个识的体性都证得了，没有不知道的了，我们才能成佛。尤其是证得了第八识，我们的妄心七识就可以皈依祂，学习祂，七个识才能越来越清净，染污就能消灭，无明就能灭尽，那样才能成佛。  </p><p>把各种法的相貌都弄明白，我们就知道哪个是生灭的，哪个是不生灭的，就不再执著生灭法，就能转依不生灭的真如自性，也就能破尽所有的无明。我们就得把所有生灭的法都弄明白，都找出来，不再认取生灭法，生死的问题就能解决。所有的法都落在了识上，八个识的根还是第八识，第八识就是中观，就是中道，没有第八识就没有一切法的存在和衍生。  </p><p>三、离念灵知心到底是什么</p><p>第八识遍一切时，遍一切地，遍一切处，遍一切界，遍一切法。遍一切时的意思是说，第八识刹那刹那存在着，从来没有离开过众生，没有离开过第七识意根，也没有离开过五阴。遍一切地的意思是说，三界九地的众生都有第八识的存在，凡是众生都有第八识，生存在三界九地里的每个众生都有第八识，即使出三界入了无余涅槃，仍然有第八识，只是没有了众生自已。</p><p>遍一切处的意思是说，第八识遍六根，也遍六尘，在众生的六根接触六尘的时候，都有第八识的存在和显现。遍一切界的意思是说，在六根上有第八识，在六尘上有第八识，在六识上也有第八识。遍一切法的意思是说，只要是存在的法，不管能不能被认知到，都有第八识的住持；不管是色法还是心法，都有第八识的执持；不管是有为法还是无为法，都有第八识的住持；只要有存在的法，一切的人事物理，都有第八识的住持。</p><p>很多人都不明白，离念的灵知心到底是第六识还是第八识，现在我们就来分析看看这个离念的灵知心。离念的意思是这时候刚好没有念头和妄想，灵知的意思是灵灵觉知，知道自己离念，知道自己没有念头，知道自己暂时没有妄想和思想，在离念的状态下，甚至还能了知其它的境界。那么这个离念的境界到底有几个识呢？既然第八识是遍一切时的，这时肯定有第八识的存在，否则就没有五阴的存在了，也没有七个识的存在，也不会有离念状况的存在。</p><p>这时候有没有第七识呢？当然有，如果没有第七识，众生就会入到无余涅槃，根本就不可能出现离念灵知的状况。这里有没有第六识呢？当然也有，除了在五种情况下是第六识是断灭的，那就是：睡着无梦时，昏迷时，死亡时，无想定时，灭尽定时，而离念灵知不属这五种情况，那就说明第六识心也存在。而且还能了知自己无念的法尘境界，这就说明离念灵知时还有知的心正是第六识。至于离念灵知时有没有前五识，只要能了知色香味触五尘存在，就是五识的了知。</p><p>既然在离念灵知时，至少有第八识、第七识和第六识这三个识，如果有人说在这时候开悟了，到底是悟的哪个识呢？这里就有很大的差别，悟对了，就是悟到第八识；悟错了，就是悟到第六识。第七识一般人不容易悟到，第八识也是不容易悟到，这需要特殊条件。这个特殊的条件就是，佛所说的菩萨六度条件。如果不具足六度条件，就不可能悟到第八识，不能明心而成为真实义的大菩萨，不能脱离凡夫位，从而让未来永远不堕三恶道。</p><p>如果这个人的修行，福德不足，也没有持戒，心性还不够好，忍辱不够，在布施、持戒、忍辱、禅定、般若的修学方面都不够精进，禅定也不具足未到地定，佛法知见也不具足，第八识的体性也不了知，那么可想而知，这个人无论如何也不能悟得第八识。如果有人认为在这个时候悟了，那就要仔细检查一下，自己悟的到底是哪个识？把八个识的体性都学懂学通了，再来判断自己和他人的所悟，就知道悟的是什么了。  </p><p>四、如何区分意识的知和真心的知</p><p>问：如果修到未到定和初禅的时候就可以明心见性，那么这时怎么分清是意识心的知还是真心的知？明心明个什么心，见性见个什么性？</p><p>答：在未到地定和初禅这两种定中如果能明心见性，是意识带着知性，找到或知道了第八识，明白了第八识在五阴中运作的粗略情况，所以初禅定和未到地定是意识心入的定，然后意识心思惟观行就能生起智慧，发现到第八识的运行轨迹，这就是明心。明心是意识意根明的心，明的是第八识；见性是意识心见到了第八识的性用，就是见佛性。</p><p>明心时的知和明，一定是意识心的知和明，知和明的对象都是第八识，而真心第八识不知不明开悟明心之理，真心不找自己，不证自己，不明自己。意识心是一个极好的修行和生活工具，祂能了别一切法，明了一切法，如果没有意识心，众生就什么事情也不知不明。学佛修行时就要充分的利用意识心，用祂去分析、思惟、判断、推理、求证，包括意根的参究，最后明白一切法，证得一切法，成就佛道。我们不需要修极深定的时候，就不要削弱意识的作用，更不要灭去意识，因为没有意识这个工具就不能做事，不能思惟和观行，不能参禅，不能获得甚深的智慧，成佛就指望意识呢。  </p><p>五、前念已断后念未生，中间的状态是什么</p><p>前念已断后念未生时，并不代表七识断灭和七识没有出生，恰恰是七识都存在，都在运行着。其中第七识除了四果罗汉入无余涅槃时能断灭，其他人都没有能力断，凡夫没有能力断灭，地上菩萨以及诸佛虽然有能力断灭，但都不愿意断，所以第七识不断。当我们偶尔没有念头，或者在念头生起的中间状态时，意识心或者五识心并没有断灭，还存在运行着，这时还是有一个知存在着，知道自己这时暂没有念头，这个知就是以意识为主的生灭的妄心，如果把这个心当作是第八识，那就错悟了。</p><p>在这个状态中，眼识照样能见色，耳识照样能闻声，鼻识照样能嗅香，舌识照样能觉知口中的味道，身识照样能觉知身体是否舒适，意识照样能知道自己有没有念头。这时六个识都在，意根也在，第八识是必然存在的，可见无念时，八个识都在。那么前念已断，后念不生，这中间到底是什么？这是意识心不攀缘法尘的暂时的定，里面还是有意识的存在和意根的存在，不是只有第八识。因此在此时悟，不一定悟得第八识，如果意识无念，不知道不认识第八识，那就更不能悟了。</p><p>没有念头时，或者至少有第六识、第七识、第八识，三个识都在，这时是可以悟到第八识的。但是一般人没有能力悟到第八识，因为不具备开悟的条件，凡夫异生心性远远没有得到降伏，根本还没有资格当胜义菩萨，所以就不能在这当中明得第八识，从而得到证悟。因此，往往就把没有念头时的意识心认定是真心第八识，就成了错悟，是错误的误了。</p><p>真心与妄心是同时存在的，找到妄心容易，想要找到真心就很困难，这需要有一定的因缘条件，因缘条件不具足，无法证得真心第八识。没有证得第八识，就不能从第八识开始起修，找到第八识以后才能悟后起修。无念的意识与第八识特别容易混淆，很多人以为意识无念就是第八识，其实第八识不管你有念无念，祂一直都存在着，不是后来修行才变成有第八识。</p><p>古代祖师们参禅开悟时，有在见色时开悟的，有在听声音时开悟的，有在被棒喝时开悟的，也有是在被门挤时开悟的，悟的方式多种多样，非常灵活。无须一定要在没有念头时才能悟，其实没有念头时想要开悟，是非常困难的。因此祖师们不允许弟子们修无念的定，无念的定即使修成了也不能悟。</p><p>多看禅宗公案就可以知道，大多数祖师的开悟是真悟，因此都是得道的人。现代的人善根福德都不足，往往传错佛法，让众生修行走弯路，我们的辨别能力还不够，对与错无法辨别。如果没有念头时就是第八识，那么一会儿念头又出现时，是不是第八识就消失了？这样第八识不就变成生灭的了吗？了了分明，了就是知，分明就是明白，也是知，只要有知就是妄心，真心不知，不了了分明。</p><p>了了分明时的心能知道各种境界，不是不知道。能知道六尘境界的就不是真心，真心不知六尘境界，目前自己处于一种什么状态，真心不知道，这正是意识心所能知道和了别的，这才是证悟的关键。意识心有时是离念的，是灵知，这还是知，能知六尘的心就不是真心。大家应该与古代禅宗的法多比对一下，看看祖师们都是怎么悟的，在什么时候悟的，悟的内容是什么。</p><p>六祖悟时，知道了五个何期自性，如果悟个离念灵知心，无论如何也不能知道五个何期自性。和心经比对，真心不生不灭，永远不变，这个灵知心是生灭的，变来变去的，无法永远保持不变的，灵知心是真心还是妄心，心里就应该了然了。这个问题太关键了，一定要小心，生死大事含糊不得，学法要小心谨慎，多方求证，万一学错，那可不是一生一世的事情啊！  </p><p>六、真知真觉与妄知妄觉的区别</p><p>众生通过六根才有见闻觉知，通过眼根见色，通过耳根听声，通过鼻根嗅香，通过舌根尝味，通过身根觉触，通过意根知法。在六根门头的觉知，有前五识和意识心的妄觉妄知，也有真如的真觉真知。但是两种觉知的体性截然不同，觉知的对象和内容范围也不相同。知穿衣吃饭，知行住坐卧，知动知静，都是六识心的知，因为六识心对六尘有了知性；真如心不对六尘，对六尘没有了知性，因此不知六尘。意识是生灭变异之法，那么知六尘境界之知就是生灭法，不是真如的不生不灭的知，真如从来而且永远也不知这些六尘。</p><p>有人认为了了灵知就是真如，其实不是，那是意识心的体性，是意识的知，因为知的对象是六尘境界，而且知的本身也是生灭变异性的知，不是真知，真知永远不生灭变异。意识心即使不动妄念时，也能了知六尘，知道六尘，而这个知，就是想阴和想心所，这正是妄心的作用，真如从来都不知道六尘。</p><p>眼见色时，有四个识能生起觉知的作用，即眼识意识意根第八识；如果在见色时认为自己开悟了，那就得检查自己是悟了四个识中的哪个识，是真识还是妄识，悟得妄识就不是开悟明心，是错悟，悟得真如第八识才是真正的明心。如果菩萨六度条件不具足时，就不能悟得真如。</p><p>耳听声音，鼻嗅香，舌尝味，身觉触的时候，都分别有四个识在参与了别，起觉知的作用，在这当中只有找到真正的第八识才能说自己悟了，认意识为真心，只能是错悟和误会。如果当真实义的菩萨条件不具足时，不可能悟得真如，往往悟错，悟个妄知妄觉，向别人说出来，就构成了大妄语业，未来世就有恶果报。所以学佛修行应该小心谨慎，不要错会佛法。</p><p>很多人开悟就是悟个灵知不昧的心，那是意识心，不是真如第八识，悟个没有念头一念不生的灵知不昧的意识心，确实需要保任，需要保持这个意识心一直没有妄想，一直没有念头，让意识与真正的第八识的体性相似相像，才能是一直属于开悟的状态，好像只有这样就是没有念头的真如第八识了。这种所谓的开悟要不断的修定，以保持无妄想和妄念，却不是六祖说的那枷常在定的真如第八识。这是把妄心当成了真如，找到了一个假真如，不是本来就没有念头的真如第八识，不是本来就不用修行的真如第八识。悟得第八识是不用保任的，第八识永远不跑掉，不丢失，任何时候都不起念想，祂打也打不走，灭也灭不了，何用你保任。</p><p>真如第八识自体的存在性是真实有，虽然看不见，摸不着，感觉不到祂。祂不以六尘相的形式存在，不以三界世间任何相而存在，祂的存在方式非常特别。众生无论如何思惟想象也想象不出来，所以明心证悟祂极其困难，悟个意识心却很容易，不需要多少的福德，不需要多少戒定慧，就能轻易发觉到意识心，所以假开悟的人非常多。如果是发现了意识心就是开悟，岂不是圣人遍地跑？</p><p><strong>第二节  意识不是要证得的标的</strong></p><p>一、学佛的目标是要出生般若大智慧，有般若大智慧，才能成佛。而般若之体就是第八识如来藏，所有佛经都是围绕着如来藏而展开，因此如来藏就是成佛的关键和主体识。意识心很容易就能找到证得，找到意识并不能知道法界的真实相，也不会有般若大智慧的出生，这不是学佛的根本目标。</p><p>学佛修行的根本目的，就是要证得第八识如来藏，从而明心见性，成为大乘菩萨，然后再生起各种观行智慧，最终才能成佛。八个识的道理都很重要，都要明了，这样我们就有了大智慧，有一法不知，就是无明。无明断尽，就具足了一切种智，心里都是明，没有不通达的法，就成佛了。</p><p>学佛明了了意识的体性，就能断意识我见，就不再把意识当作真心第八识来悟。明了妄心七识的体性，就能找到七个妄心，剩下的一个第八识就很容易找了。找到了第八识如来藏就是明心开悟，就能知道六祖所说的五个何期自性，我们的智慧就能打开，就知道世出世间法的一切来龙去脉，知道万法的根源。  </p><p>二、六祖为什么悟后修了十五年</p><p>六祖是被人一路追杀，不得已才混在猎人队伍中。他那时所处的环境只能修定，但是六祖修定不是为了保任真心，他是在定中思惟真如之理，然后获得了很深的后得智慧。真正证得如来藏的人，无须保任如来藏，一悟永悟。如果悟得了离念意识心，就需要保任意识的无念状态，总要修定让意识心达到无念，没有妄想，如果不修定，妄念就又出来，那就不是悟了，显然这种是错悟，误会极大。</p><p>因为他们把没有妄想时的意识心当作如来藏来悟，有妄想就不是如来藏了，所以必须借修定来保任住意识不生妄念，以期达到很长时间没有妄想才行。这是把生灭的意识当作了不生灭的如来藏来悟，错修错悟，误会太大了。真正的悟不需要保任，如来藏永远没有出现妄念的时候，不用意识心去把祂修成无念，不用意识来保任如来藏无念，根本没有这个必要。</p><p>虽然悟得如来藏以后也要修定，但目的却不相同，目的是想让自己获得更深的禅定，然后再观行，以获得更深的智慧，减轻或者去除烦恼，心得清净。六祖在那十五年中，四禅定修出来了，神通修出来了，智慧修出来了。他不是去保任第八识如来藏，六祖明心证悟了如来藏，就永远认识了如来藏，不会再迷失了，通过修禅定，更加深刻的体悟如来藏的体性，使自己的心更加清净，般若智慧更加深广。  </p><p>三、在闻声时应该识取真心</p><p>当我们听声音的时候，有耳识的参与，有意识的参与，同时也有第七识和第八识的参与，这四个识都是无形无相的。如果要在闻声时悟道，就要分清楚哪个是第八识，哪个是第七识，哪个是意识，哪个是耳识，在这几个识和合运作当中一定要分清真心和妄心，分清楚以后，认取那个真心，这就是明心开悟。</p><p>如果福德、定力和慧力都不具足，往往就要认妄为真了，错把意识心当成是真心第八识来悟。悟得意识心的时候也有一种空的觉受，内心也能清静一下，也能看空一些人事物理，也能稍微看明白一点点的佛经，也可以把空理套上去，但就是不知道第八识是如何具体产生五阴七识万法的，悟错的人是绝对不会知道的。这就是真悟与错悟的分野之处，真是差之毫厘谬以千里。</p><p>意识心和第八识都是无形无相的，都有某些相似之处。一般人就把意识稍微清静一下，没有了杂念妄想，没有了心绪起伏，能清清明明的感知身心内外的一切境界相，就把处于这种清明状态的意识心，当作是本来无念无知的清净第八识，这样就认错了主人公。意识无论怎样的清明，怎样的不知，只要有意识心存在，就有了知六尘境界的知；或者意识有定了，也有知定境的知，因此就不是第八识，不是真正的开悟。只是自己的意识心比较愚痴，很难反观到此时自己所处的状态，就认为这就是第八识的不知，从而认定自己证得第八识了，这是多大的误会。</p><p>其实意识心变得很微细的时候，其反观力也变得很微弱，再加上学佛人不了解意识心的体性，错认意识心为真心第八识的现象就非常的普遍。现在自认为开悟的人到处都有，但是多年下来以后，智慧还是原来的水平，还在原地踏步，并没有得到增进，禅宗公案还是看不懂，经典还是看不懂。</p><p>所以劝导那些自认为已经开悟的学佛人，为了自己的生死大事，尽快回头检查一下自己的所悟到底是什么，对照经典去检查，把意识的体性和第八识的体性再作仔细的分析与判定，严格区分开真心和妄心的种种不同，然后再努力圆满具足做菩萨所必备的条件，当你做菩萨所必备的条件都具足了以后，再来重新参禅，以求真正地进入佛门，做真实义的菩萨。</p><p>四、真妄心永远不能互相转换</p><p>明心见性不是把妄想变成真心，妄心永远是妄心，真心永远是真心，二者之间不能互相转换。很多人总想把心修到无念想，以为这个无念想的心就是真心，这就大错特错了。意识心通过修行也能无念想，但无论如何的无念想，永远是意识心，不能成为真心。真心不管我们有没有念想，祂都在运行着。五祖说：要见性，轮刀上阵也见。意思是说如果开悟见性了，应该在行住坐卧都能时时刻刻见到祂，不一定非得在没有念头时才能见性。没念头时，那时最容易见到没有念头的意识心，不容易见到真心。</p></div>"
},{
    "title": "第十章 有关证悟的正知见",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  有关证悟的正知见</strong></p><p><strong>第一节  悟后如何修行</strong></p><p>一、悟后也要努力修定</p><p>证得第八识明心开悟以后，大小乘的理要继续深入的观行修证，禅宗公案由浅入深要不断参究，以增强明心时所获得的对第八识如来藏的总相智慧，生起更深细的别相智慧，观行出更多更细的第八识运作行相，了知更深细的第八识的功能体性。同时还要继续修禅定，一方面是为了能更好更深入的观行，一方面是为了降伏自己的性障和烦恼，为了将来修出初禅定以断除烦恼。禅定深入以后，福德也足够时，就要参究佛性，准备见佛性，证得如幻观。然后再发起初禅，有能力断烦恼，小乘方面就能证得三果，大乘方面能证得阳炎观，再过禅宗牢关，以后再证得如梦观，那么大乘的三贤位就修完了。</p><p>开悟以后，禅定、福德、智慧，菩萨六度都要在内门更深入地修行，大小乘的理，都要初步的通达，禅宗公案都要透彻通达，再深入学唯识，准备入初地，成为真佛子。</p><p>二、悟后的修行次第</p><p>开悟以后的修行，有两种途径，一种是修福修定，要眼见佛性，证得如幻观，出现身心世界如幻如化的觉受，淡薄一切贪嗔痴烦恼，进入十住位；然后继续往上修行，证得初禅定，断除贪嗔烦恼，成为三果，再深细观行般若，证得阳炎观，成为十行位菩萨；再参禅过禅宗三关，观行五阴诸法，证得如梦观，就有能力入初地，以后次第修行到八地直至佛地。这是一种修证的方式途径。</p><p>另一种途径是，可以不经过眼见佛性的阶段，只要九地菩萨之前能够眼见佛性就行，开悟以后努力观行修定，淡薄贪嗔痴，空五蕴，成为二果人；再发起初禅，成为三果人，深细观行般若，证得阳炎观，再参禅过牢关，继而再进行深细观行般若，证得如梦观，以后修学唯识种智，入初地、二地，直至八地九地，最后成就佛道。</p><p>证得如幻观相当于小乘的二果，知道身心内外都是幻化的虚妄相，不真实有，不再把五阴世间的一切法当作真实，从此贪嗔痴烦恼非常微薄，几乎没有，就会生起甚深禅定，甚至发起初禅定。明心以后逐渐感受到身心内外都是不实的如幻化的一般，从此贪嗔痴都非常微薄。再以后禅定会增进，就会达到初禅，断掉贪爱和嗔恚，成为三果人，两种烦恼断得干净，次第过禅宗三关，通达大小乘佛法，就入初地。这其中还需要有很多证悟细节，先不一一细说，因为我们现在离初地果位的距离还很远。</p><p>如果不明心，而是直接证得二果，让贪嗔痴烦恼淡薄下来，也不能证得如幻观，明心是证得如幻观的前提；如果不明心，即使修到四果也不能成为七住位菩萨，更不能成为十住位菩萨，因为没有观行般若，没有出生般若智慧。但是大阿罗汉们一旦明心，就不一定是七住位了，也许更高，他们在大乘法的修行上会非常快速。</p><p><strong>第二节  解悟与证悟的差别</strong></p><p>一、菩萨道的修行，禅定福德智慧都是很重要的，一定都要深入修行。这其中还涉及到降伏心性，培养菩萨性，发大愿，广利众生；随缘接引初机众生，自度度他，才能够渐具福德。其中的禅定，静坐中的定也要尽力随缘修，这是获得定力的重要途径，定力是很重要的，有定力就能实证一切法，能够切身体悟一切法的如幻如化、如阳炎、如梦幻，这样烦恼才能真正的得到降伏和灭除，大小乘的智慧证量才能得到增进。定力不够好时，无法参究佛性，不能亲证佛性，即使参究出佛性的内涵，因为定力不足，虽然有可能解悟佛性，不能亲自证得佛性，也就没有解脱的功德受用，烦恼不能有效的降伏。</p><p>定力不足时，对于佛法大多数都是理解的，不能真正证得，多是嘴皮子功夫，实际上什么事也做不到。有定时，才能真真实实的证知佛法，对于一切法才有切身的感受。定深，悟的就深，感触就会很深，心行就有极大的转变。有定和无定，差别很大，不要看一些人讲起佛法口若悬河、头头是道，可内心里并没有实证，没有真实的智慧，所说都是学语的多。</p><p>没有实际证得，所说仅仅是理论罢了，这样的话要改变内心是非常困难的，烦恼仍然很重，内心不得解脱的功德受用。有定就不一样了，可以不用学很多的佛理，只要接触佛法，仔细思惟，就能贯通，并且能触类旁通，自然就有很多感悟，其思想境界转进的也能很快。没有定，心散乱，不能深细观行思惟佛法，就会遮障自己对佛法的真正认知和感悟。所以奉劝大家不管悟前还是悟后，都要修好禅定。</p><p>二、如何亲证避免解悟</p><p>所谓的亲证就是意根亲自证得了，不是靠意识单独的推理和猜测。所谓的解悟，只是意识理解了如来藏的某些体性，隐约感到了或者是猜测推理得到了如来藏的大致所起的功能作用，就认为自己证得了如来藏。但是这不是真正的证得如来藏，不是通过现观如来藏的运作而得知了如来藏在五阴上所起的功能作用，因此就不知道如来藏确实在何处出现，真正起何种功能作用，更不能现前观察如来藏是如何运作的，因此不是证悟。真正证得如来藏的人，是能够现前观察如来藏的运行，从而真真切切的知道如来藏的体性、功能、作用，知道如来藏是如何现起五阴的，就如观手中物那样的清楚。</p><p>正教量，就是佛陀所教导的所有正真之理，我们听闻之后，能够达到初步的理解和信受。但是因为没有证得，心里还不是真正的了知，不能现前证实这些法的正确性。那么这些法对于自己来说就不是现量，也没有办法真正去奉行和执持，不能实际去操作和运用，也就不能真正改变自己的思想和行为。</p><p>要想让佛的正教量变成自己的现量，就要通过参禅实际亲证如来藏法，这样自己的内心就能深刻认知这些法，内心就有了真正的依托和归宿，从而内心就可以发生巨大的转变。从此以后就能逐步地现前观察如来藏法，就能获得更多更深的智慧，使佛陀的真理成为自己真正的智慧认知，成为自己的见地。</p><p>亲证，需要通过参禅、参话头、参公案等方法来亲证，这需要修出禅定力，在具足相应的定力情况之下来参究如来藏，才有可能证得。前提还要福德具足，戒定慧具足，心性调柔，忍辱柔和，与大菩萨的心性渐渐相应，与贤人的心性渐渐相应，才能脱俗，成为圣贤。</p><p>三、照见五蕴皆空中照的含义</p><p>照见五蕴皆空的照，是在初禅或者在未到地定当中，证得了五蕴都是如来藏所生，五蕴非实有，五蕴非我之理。这个照的境界既有禅定又有智慧，定慧等持，这就是证悟的甚深智慧的显现。不是意识在缺少定力的情况下，心思浮躁的情解思惟，解悟佛法。</p><p>这个照字，是说明意识心非常的深细，观慧非常的强，心能止，慧才深。照这个字在这里用得非常好，非常的准确，这是真实的用功下手处，正好照应了世尊所说的具足了戒定慧三无漏学，才能实修实证，发起如实智。所以一定是在甚深禅定中来参禅，从而证得如来藏，明悟真如之理。</p><p>四、知识不等于证量</p><p>知识不等于证量，现代人由于通讯发达，很容易获取丰富的佛法知识，但因为缺少福德和禅定，所以不能实际证得所学知识，仅仅停留在理论阶段，没有真实受用，无明烦恼和生死问题无法解决。过去人由于科技通讯不发达，听经闻法非常不易，可是因为心清净有禅定，再加上那时佛法纯正，实证却很容易，一但遇到一点佛法，稍微观行就能证得，有证量的人不少，很容易得到佛法的真实受用。</p><p>菩萨修行的果位，是以实际的证量为准绳，不是以知识多寡来决定。每一种必须要有的观行都没有实际观行过，即使学富五车，智慧仍然不能与通达佛法的菩萨相提并论，因为没有证量，没有实际证得故。相反，即使没有多少文化，也没有学过多少佛法的人，接触一点佛法就能通过自己的思惟而观行出来；以此为基础，还能观行出更多的佛法，他的证量就很了不得，智慧就比学富五车的人要高深，还能生生世世得到佛法上的受益。现在有好多人都说自己已经证果，已经明心了，实际上都是理论上的知识，不是实际证得的，烦恼如故，身心没有改变，没有受用故。所以在末法时期，实修实证就显得非常重要了。</p><p>五、找到自性如来藏才算开悟</p><p>开悟必须以找到自性如来藏识，以如来藏为证悟标的，知道祂是如何配合七个识产生五阴活动，产生世间万法的，所悟的内容要符合六祖说的五个何其自性。不是明白某些道理就算开悟，那些道理书中都写着，他人常议论，不是自己通过找到自性而悟得的，不算是悟，而是表面的理解推理比量思惟，有的连理解也谈不到。</p><p>我们不能把佛法中所讲的理论直接拿来作为自己修证的结果，那是佛的智慧结晶，佛的智慧总结，跟我们自己没有关系。学佛语或者学祖师大德的话语，不是自己从内心深处所感悟所证悟出来的，都不属于开悟。真正的修行人，要自己运用已知的佛法理论去重新证得这些佛法理论的真实性，从而变成自己的内心的东西，生出自己的真实智慧，而不能直接拿他人修行的结论当成是自己的结论，整天挂在口头上，那就是口头禅，口头禅没有一点实际的功德受用。</p><p><strong>第三节  明心的误区</strong></p><p>一、 有一部分人学佛，认为安住于当下就是万事大吉，佛法就修成就了。他们不知道这仅仅属于修定的方法，而且与外道方法相近，根本不能证得佛法而出生智慧。学佛修行不是让心静安稳就算行了，这不是解脱，不能解决生死问题。解决生死问题需要在禅定中心静安稳的情况下对五蕴自身进行观行思惟，去了解和认识五蕴世间的真实相，去认识到五蕴世间的生灭无常无我性，从而看破五蕴世间，放下自我，才能得到解脱。</p><p>现在毫无目的盲修的人非常多，不知道如何是真正的修行，也不知道修行究竟是为了什么。于是各种发明创造就出来了，有的人说：修行就是安住于当下，不起念想就能明心见性，就能成佛。殊不知，这样就是外道的修行方法，最多能成为一个成功的外道，但现在的人根本没有过去时的外道有定力有出离心，所以连外道定也修不成，别说明心见性的般若大智慧了，连影子都见不到。所以修行不能只图安心安稳，还要起正思惟，以出生解脱智慧为目标来修行。</p><p>二、明心一定是妄心明了如来藏</p><p>问：学禅宗的人说，身心俱空或身心脱落时，就是明心见性。这时他知道了那个（知）。如果明心见性是意识心在分别的话，他怎么能明心？怎么能见性？</p><p>答：第一，有人说开悟时身心俱空，身心脱落，这是什么人说的，具体是什么意思，此人是否开悟，如何判断此人悟与不悟，依的是什么，是法义还是名声？第二，他知道自己明心见性了，他是如何判断自己已经明心见性的，依据是什么？你根据什么相信他对自己明心见性的判断是正确的？第三，真正明心见性时，到底是意识明心和见性，还是如来藏自己能够明白自己明心见性，如来藏能够自己见自己的性用吗？如来藏是否能明白自己，是否能够知道自己是如何与五阴七识配合产生万法的？</p><p>第四，如果是如来藏知道这些事，明白了自己，就破无始无明了，那么在这之前的如来藏就是无明的，这就与心经所说的无无明相违背，与般若经相违背。第五，如果是如来藏自己明心见性，明白自己，那是如来藏自己的事，与五阴七识无关，五阴七识意识没有明心见性，没有明白，仍然是无明，没有破无明。没有破无明，五阴仍然是凡夫，不是明心见性的贤圣，那就没有明心见性。第六，因为什么说明心见性以后意识就没有分别，没有妄想了？没有分别和妄想是什么情况，什么境界？意识的体性是什么？第七，身心俱空身心脱落，是明心见性的境界还是感应，还是禅定境界？</p><p>这里的问题，如果要问起来还有很多很多。大家学佛如果真正想有所成效，就应该不要盲从，要仔细又仔细，反反复复地深思再深思，多方求证，多学经典，踏踏实实。要舍得付出自己的身心，一定要多难为自己，多跟自己过不去，不要太顺应自己的无明习气，不要太宝爱自己，不要认为自己一切都对都好。</p><p>三、意识不见一法时不是开悟境界</p><p>众生学佛修行时，容易进入一个误区，就是喜欢一门修定，认为修定修到心清净了，就是开悟见本心了。所以有人往往是修到心里偶尔有一点清净，没有念头的时候，就以为自己什么也不见了，他就把这种不见一法的空的境界当作是开悟。其实不见一法的见，是意识刚好无念，这时也不是不见一法，而是意识自己见到自己空了和无念了，这是意识的反观作用，是意识的证自证分。如果意识什么也不见了，那怎么能知道自己无念了和不见一法了？这是谁知谁见的？就是意识心知见的，意识不是不见一法。</p><p>有人恰恰说这时不见一法就开悟了，这种关于开悟的知见是一种断灭空的知见，认为连如来藏法也没有，也不存在，内心里空空落落的否定一切法的存在，就是开悟了。这种断灭空的知见是外道的一种邪见，其结果让众生不能证得实相心如来藏，不得开启法界实相的大智慧。</p><p>众生的知见不是落在有处，就是落在空处，总是在空有两边左右摇摆。其中关于“有”的知见就是常见，常见是认为五阴中的意识心是实有，能延续到未来世，是相续的心，把这种心当作是众生的本心，这样就会遮障自心，不见本心，不证法界实相。又有一部分众生的知见是落到一无所有的空上面，这种空见就像浮云又遮住了自己的心，也不能见本心。总在空有两头纠结不走中道的人，纵使修行的再久，也是生死系缚，不能得到解脱。</p><p>打坐入定时那个不知一法的心，是知没有一法的意识心，意识心非是本来就有的不生不灭真如心。如果错认一法也不知的心就是空性的如来藏心，认为这时候的心正好与如来藏心性是一样的，就是如来藏，那么就是认错了主人公。其结果不能破无明，不能了生死，不能得解脱。</p><p>四、证悟真心是成就佛道的先决条件</p><p>修行是佛力和众生自力的共同成就，而在自力当中，也是真心的力和妄心的力和合起来才能成就。那么就要在各种事情当中寻觅哪个是真心的力，是怎么起作用的，不要把一切事情当作是自然而然的，本来就这样的，时时刻刻对一切身口意起疑问开悟才能快。</p><p>找到真心之后，般若智慧就开发出来，后得的智慧就能逐渐显现出来，慢慢地就能出生道种智，那么佛地的一切种智，将来也一定可以获得。所以证悟真心，是成就佛道的先决条件，也是必须要经历的一个阶段。</p><p>不管在十方世界哪个佛国土修行，都必须经历这个阶段。如果有哪个法门说，不用证悟真心如来藏就可以直接快速成佛，而且当生即可成就，那就要小心这样的法门，这肯定是不对的，我们应该好好保护自己不走错路和冤枉路。在十方世界各个佛国土，每个人不管怎样修，修什么法门，都必须要经过禅宗明心见性这一关，所有的修法都要汇集到这一点，谁也越不过去。而且悟的内容必须符合佛说的真如第八识的体性，不可能各宗各门所悟不一样。</p><p>然而开悟不以思虑所得，但也离不开能思虑的意识心，在意识心修出定慧时，就能发现真心的妙用。是意识心能明了真心是哪个，在哪里，是如何运作的。离开了思虑的意识心，也就不能修行了。明心见性虽难，但只要修行的方法和方向都对，六度具足，迟早都能明心与见性。</p><p><strong>第四节  如来藏不离世间法</strong></p><p>一、佛法不离世间觉的含义</p><p>如来藏在五蕴十八界世间当中显现，祂总是不离万法而存在，不离世间法而运行着。要想找到祂，就要在五蕴十八界的活动中去发现祂运行的轨迹，在万法的显现中去感知祂，不离身口意行来证得祂。离开这一切的世间法，祂就无法显现，无法运转，就与无余涅槃的境界一样，你就没办法再找到祂。所以参禅是不离虚妄法而觅得真实法。</p><p>二、在行走坐卧中寻找如来藏</p><p>骑驴找驴，我们每时每刻都依赖着如来藏，生活在如来藏中，与如来藏紧密相连，未曾分开须臾，但我们现在却不认识祂，不知祂在何处，需要我们用特殊方法去寻觅祂证悟祂，这就是在骑驴找驴。早上如来藏与我们同时起床，晚上与我们同时睡眠，白天与我们同在一起。因为我们与祂太亲密了，联系的太紧密，离祂太近，太习惯于祂，所以才觉悟不了祂。当我们起心动念想找祂的时候，离开祂，也就没法找到祂，是祂帮助意识心在找，帮助意根心去证。祂是很奇怪的一个东西，世间里没有像祂一样的法，祂不是世间法，所以才是这样的难理解难寻觅。</p></div>"
},{
    "title": "第十一章 观行答疑",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  观行答疑</strong></p><p><strong>第一节  如何观行实修</strong></p><p>一、问：如何实修，实修就是时时刻刻观照自己吗？</p><p>答：修行的目的是解脱生死，解决轮回的问题，最终成就佛道。要达到这个目的，就要按照佛所教导的修学方法，努力去实行实践，然后再证实佛所说法，就能证得解脱，证得不灭的真我如来藏，从而解决生死大事。佛是如何教导我们修行的呢？佛在世时讲的法，一个是能让五阴得解脱的四圣谛法和十二因缘法，一个是般若实相法。</p><p>我们把这些理论内容弄明白，然后按照这些道理一一去实际观行思惟，思惟通达之后，就能证得佛所指向的各种结论：一个是五阴无我，一个是真我实相般若。要达到这样的结果，就要通过修行满足相应的条件，才能证得，从而获得解脱。这些条件就是布施、持戒、忍辱、精进、禅定、般若这菩萨六度，总体来说就是戒定慧。</p><p>八个识的法义必须要学，参禅的方法要掌握会用，禅定必须要修，福德必须要具足，总括起来就是菩萨六度条件都要满足。当福德够用，禅定也够用时，般若正理就能明了到一定程度，这时就可以参禅，参话头，参公案，就能知道如何寻觅第八识，因缘具足时，就能证得第八识，从而明心开悟。证悟以后，就能获得大智慧，逐渐心得解脱，具足般若智、别相智、道种智、一切种智，最终就能圆满佛果。</p><p>二、问：看话头时是精神内敛，向内收摄吗？</p><p>答：应该把注意力集中在话头上，不要放在其他事情上。话头如果放在脑中，就把注意力集中在脑中，如果头部发胀，就放在别处。有时候话头跟着外面声音跑了，就轻轻拉回来，不要随声音而流跑了，这就是精神内敛，向内收摄。</p><p>看话头时只要意识清醒就要不间断的看，一切时中都要看住话头，这样就能念念打成一片，功夫自然就能纯熟得力，很容易生起疑情。生起疑情以后，就转入参话头阶段，起心参究自性如来藏，因缘具足时就能悟道了。</p><p>三、问：每天观照自己，妄念起而不随，慢慢的有力量了，无观无照才是真观照吧？</p><p>答：这只是单方面修定的方法，不是参禅的方法。参禅是心里要有话头有疑情，心中有话头的念，不是无念。无念就是死水一潭，没有生命力，不能证得真心如来藏，因为里面没有寻觅的心，没有探究的心，就不能发现真理。所以要想明心，不能追求无念的定，心中应该有参禅的念头，不能落空。</p><p>四、问：观行就是观行如来藏怎么生起身体，怎么随顺七识的吗？</p><p>答：这些都是找到证得如来藏的时候观察的，或者是悟后很长时间内所作的观察。悟前因为还没找到如来藏，无法现量观察祂，只能是推测，推测分析的成分多，结果不能如实，往往不能得到正确的结论。推测分析出来的结论，自己往往不敢确认，心里发虚，心中不踏实，脚跟不点地，不敢确定地证实某种真理，就能阻碍大智慧的生起，不容易出生后续的观察智。</p><p>观行分为对虚妄法的思维和对真实法如来藏的参究。对如来藏的参究是要在五阴身的运行上参究如来藏在何处现起，找到之后才能观察祂究竟起何作用，如何出生五阴身和七识，如何随顺七识出生万法的。</p><p>五、问：有时动中定清清静静，心的感觉就像一张大的空白幕布，而见闻觉知就像幕布上出现的影像画面，虽然空白幕布和画面影像都是意识境界。打个比方就像有一个人刷刷地在空白幕布上一笔一笔地涂鸦作画，清静自在。这种感觉主要在耳根、眼根生起的根识和意识，感觉自己就是虚无的意识流或者肉体，看家人亲人有种陌生感，所在的世间也陌生，有种自己不属于世间的感觉，有想岀离的感觉。心里虽然清静但空落落的，有想岀离的感觉。这种感觉是怎么回事？</p><p>答：这种感觉是在禅定当中的观行感悟，在禅定当中能很客观的观察五阴世间，能降伏世间的烦恼和情绪，降低了对世间的情执，减轻了对亲人的贪爱，心变得清净了。禅定比较深时，心就会很清净，，思惟观行就能很深细，对法的认知就能清晰而深刻，理解的能到位。所以任何法的证得一定是在心无杂念，专心致志的情况下感知和证得的，是意根亲自证明了的。当意根亲自感知和证明了世事的虚幻无常，才能发起真正的出离心，不再追求虚幻的世事，转而进求无上的佛道。</p><p>六、问：我在平日里走路时，着意训练自己的‘受’，对境不起任何罣碍，不让念头进入到‘想’的阶段。这是着力在内相分还是外相分上？这样把念控制在‘受’的阶段，不让其进入‘想’，将来是在破我执上受用还是在破法执上受用？</p><p>答：这里的受和想主要是指六识的受想，六识对应了别的都是内六尘，我们需要对治的是自己的内心，不管什么内外相分。外相分我们接触不到，很多人又不知道有内外相分的区别，实际上我们接触到的一切法都是内相分。</p><p>把心控制在受的阶段，这个受，最初是领受领纳尘境的接受，后继才是苦乐忧喜舍的感受。如果是感受，就在想（了别）的后边出现，阿罗汉一般是把受停留在最初接受领纳阶段，不进一步的了别执取，这样就没有下一步的感受，也就没有心的苦受和乐受了，这就是修行，能灭除贪爱，能灭苦。这对破除我执、对自我的贪着有很大的益处，同时也能慢慢的破法执，减少对一切法的执著，这样修行是很得利的。</p><p>这样的修行同时也是修定的方法，证明有定就能压伏或者降伏烦恼，没有定，心要继续往下分别执取，然后生出苦乐受，进一步就要贪取或者厌弃，业行就要出来了。业行一出来，就有业种，将来就有业报，生死就不能了，不能出离三界。阿罗汉们都明白这一点，所以他们都尽量不了别六尘境界，尽量减少减轻对六尘的觉受，让心清净无染，才能不受三界生死系缚，出离生死轮回苦。而菩萨修行，为了弘法度众生，经常要生心动念，修定就困难一些。但是菩萨知道六尘境界都是自心所现，唯识所变，不害怕境界缠缚自己。</p><p>有时间时，稍微收摄身心，反观自心和六尘境界，定力就现前，就能不被一切法所迷惑，临终也不颠倒，这是大福德大智慧所支撑故。这种修定方法，既利于断我执，也利于断法执。所谓的执著，都是指意根对五阴世间的执取，在禅定的状态下，意根少于攀缘执取，六识不了别或者少于了别，六识无所造作，或者少于造作，这样才能降伏意根和意识。</p><p>七、问：意识慢慢的熏习，意根将来就会认可没有我及我所，整个一片都是第八识。有七识存在就有万法生起，没有七识就是无余涅槃，意根到哪里，第八识就在哪里生起万法，是否是这样？</p><p>答：意识不断的学法，不断熏习意根，意根就会起思量，日夜参究，有一天就知道无我和无我所的道理，就能断除我见。但没有禅定就熏不了意根，意根不能很好的思量，意识思惟也肤浅，无法实证。证得世间整个一片片都是第八识，这是地上菩萨唯识种智的智慧境界，刚开悟的人不能有这样的甚深智慧，观行不出来这样的结果，只能想象一下而已。有七识存在就有万法，没有七识的存在，就是无余涅槃境界。意根是生起万法的动力，意根攀缘什么，第八识就配合变现什么法；第八识见什么，第七识也随之见什么。照这样不断的观行下去，意根就能认可十八界的虚妄。</p><p><strong>第二节  如何证得第八识</strong></p><p>一、问：如果是时时刻刻依止第八识，转依第八识，时间长了意根就能接受吗？</p><p>答：在证得第八识以后才能依止第八识，转依第八识，还没有证得第八识，无法真正依止，靠不上去，更不能真正的转依，这仅是一种相似法而已。不过这样也有作用，断我见能快一些，心能清静一些。但是要把真正的智慧生出来，必须要在定中自己去作实际的观行，真正证悟，才能解决问题，画饼不能充饥。证悟第八识是意根亲自去思量参究而证得的，叫作亲证。如果没有禅定，意识的思惟就无法熏染到意根，意识肤浅的念无法让意根真正接受，必须在禅定中让意根亲自参与参究，才能亲证，之后就会逐渐的转依于第八识的清净性。转依是意根指挥出来的身口意行，如果意根不证，就无法转依，身口意行依然故我，没有改变。</p><p>二、问：我平时就把五蕴和周围的一切都放在第八识里，这样慢慢就能看空五蕴，找到第八识吗？</p><p>答：五蕴和周围的一切本来就不离第八识而存在着，不出第八识之外，不用特意放在第八识里，没有这个必要。再者说，没有找到第八识的时候，谈何放在第八识呢？想象出来的第八识，对于修行益处不大，学佛尽量不要过于解读佛法，对于实证有很大的障碍。正确的修行方法是应该尽快修定，在定中参究观行，动用意根，不是只用意识的推理分析和想象。定中意识深细思维观察这些法都是生灭无常变异的，都不是我和我所有的，带动意根参究，证得了就能看空五蕴了，再以后通过参禅，找到证得第八识。</p><p>证得第八识以后，再现观第八识是如何出生五蕴的，就知道五蕴确实是空的、生灭的、无我的，就照见了五蕴皆是第八识生起的。这就是《心经》里所说的，照见五蕴皆空的真理。要想找到第八识，要通过定中参禅参究的方法才能证得第八识。</p><p>三、问：要证得第八识，我先把五阴十二处十八界都看空，否定不是我，等我出现，这样可以吗？</p><p>答：第八识的我不是等出来的，而是参究出来的，修行不是被动的等，而是积极主动的圆满悟的条件，主动的参禅，才能开悟明心。要通过参禅参话头参公案的方式找到那个真我第八识，不是把五阴十八界观透就行了，不是断我见就行了，断我见之后还要参禅，参究出来就能明心见性了。其实第八识无时无刻不出现，只是我们没有定慧去发现祂；在有定慧时，要主动去寻觅祂，等是等不来的。</p><p>四、问：确定如来藏和妄念不二，一切一切都离不开如来藏，都是如来藏的妙用，非常肯定而不再疑惑，算是明心见性吗？</p><p>答：这些内容都是悟前的推理、猜测和想象，一点证据也没有，怎么能断疑呢？拿着佛经上或者是别人的理论，自己思惟理解了就当作自己的见解和观点，这与亲证差距还有很大一段距离，没有任何的关系和参究，理论终究是理论，知见终究是知见，毕竟不是自己的真实智慧，离明心见性差得还很远。现在很多人都是自己琢磨琢磨就认为有多高的证量了，其实连理解都没有到位。</p><p>想要明心见性，具体要证得妄念与如来藏是如何不二的，能够现前观察如来藏在运作当中是如何起妙用的，如来藏是如何配合五阴运行的，祂在哪里起作用，这些都要通过参禅才能知道，知道的时候就是明心。明心以后，就可以知道哪个是如来藏，以后才能现前观察祂，了解祂更多的体性，才能获得更多的智慧。知道如来藏在一切法上都有作用，这不属于明心见性，这是理论知见，书中都写得很明白，我们是经由熏习以后才能知道的，这并不是证悟。</p><p>五、问：当我们一个念头接着一个念头的时候，这些妄想念头就是七识在起作用，如何才能感觉到第八识如来藏的存在呢？念头与念头之间短暂空隙，就是无念，无念之时是八识的。如果没有经过修定训练，念头迁流不息，经过修定练习使念头慢下来，愈来愈慢一直到无念，第八识才能现出来是吗？</p><p>答：无念之时不仅有第八识，也有七个识，有第六识。因为一切法都是由第八识出生和显现出来的，打妄想时是这样，不打妄想时无念的状态也是这样，是第八识出生和显现出来的，第八识无所不在，无时不在。第七识也是无时无处不在，否则就没有色阴、受阴、想阴、识阴和行阴，而无念时恰恰五阴都存在，因此意根第七识就存在。同时第六识也存在运行着，在色身上有受觉，有了别性，有知性，知自己无念了，就是第六识的知性作用。如果还能见色、闻声、嗅香等等功能作用，五识也存在运行着，八个识都存在。</p><p>因此说，不是在念头中间没有念头时才有第八识出现，第八识时时处处都在。也不能说修到这种状态就是第八识，就是开悟了。中间没有念头的那个主要是指意识心，是离开念头的意识心，属于意识偶尔没有念头和妄想的境界。不能说无念了，没有念头的那个就是第八识，这里还是有八个识，至少有三个识。</p><p>在理论还不通透、禅定还不够深、六度还差很多的时候，不要总是琢磨如来藏在哪里起什么作用，猜测和推理想象都耽误真正的修行，阻碍道业，妨碍智慧的出生。应该严格按照修行次第把菩萨六度逐渐完善起来，该持戒就持戒，该修定就修定，该完善理论就完善理论，等各方面条件都差不多了，再开始定中参禅，没有禅定的时候不要琢磨最终的结果。</p><p>六、问：通过妄想念头，只能够知道第八识在作用，能否明白地知道第八识是如何作用的，并且让它显现出来？</p><p>答：想要明白的知道第八识的作用，就得把菩萨六度都修好，条件都具足了，用参禅的办法来明心，证得第八识，才能知道第八识是如何起用的。其实第八识一直都在显现着，从来没有间断过，也没有隐藏过，只是被无明所遮盖，不能证得而已。我们现在应该努力完善作菩萨的条件，多积累福德和定慧，就能证得第八识。不要总是猜测和到处打听第八识，这样对修行只有害处没有害处，知道不如证到，知道的越多越难证到，偷心不死，不会出生智慧。</p><p>七、问：拖死尸的就是妙明真心如来藏吗？如来藏只能靠自己悟出证出吗？</p><p>答：拖死尸的就是妙明真心如来藏，这是个结论，需要我们参禅去证明这个结论的正确性，之后知道妙明真心如来藏是如何拖死尸的，如何起作用的，如何出生五阴万法的，如何配合七识运作的，要符合六祖开悟时所说的五个何期自性。修行就是通过实证来证明这些理论的正确性，我们才是知其然也知其所以然的证悟菩萨。</p><p>证悟如来藏是自己经过辛苦参禅的结果，不能直接从他人那里去找现成的答案，因为知道答案也没有什么功德受用，其参究和证明的过程，才是增长智慧的关键，才能有身心世界的转变。因此不能从他人处找结果，一定要经过自己千辛万苦的参禅和参究，来收获果实，参出如来藏在何处，在起何作用，这样才能生起大智慧，有解脱的功德受用。意识越聪明，越能理解，越难证得，聪明反被聪明误，聪明永远不如智慧。</p><p>八、问：我见断彻底以后如来藏就能主动浮现出来吗？</p><p>答：这是偷心不死的思想，走捷径不想付出努力和代价的思想万万要不得，得便宜处就是失便宜处，不经一番寒彻骨，哪有梅花扑鼻香。</p><p>如来藏本来就明晃晃的存在和运行着，只是因为无明的遮障，而不能证得。最严重的遮障就是把五阴十八界当作真实的我，这个我见就把真实的如来藏隐藏遮蔽起来了。我见断彻底，容易生起大疑情，就会怀疑：既然五阴我是虚妄的，为什么还有五阴的作用呢？通过参究就能找到五阴背后的主宰者真心如来藏，不会再把各种意识境界当作如来藏来悟，不易悟错。</p><p>断我见要在日常活动当中认清五阴的虚妄，认清六识的虚妄，认清十八界的虚妄；认清五阴十八界虚妄法当中的各种我、各种六识都是虚妄的，不是真实的我。意识最好能跳出身心之外观察身心的虚妄，这需要内心有高度的警觉性，反观自心的能力越强，越容易断我见。</p><p><strong>第三节  对于第八识理体的认知</strong></p><p>一、问：第八识一直在见吗？意根的见就是一个点一个点，这些点就是识，就是第八识流注的种子形成的识吗？</p><p>答：除了在无余涅槃中第八识无见，在其余情况下，第八识都是有见性的。意根随第八识而见，随六识而见。但三个识所见是有差别的。所谓的点点，就是刹那刹那的生灭变异，识种子就像电子一样一个一个的不停地流注出来，意根才有识别性。种子流注灭了，识就跟着灭了，这样就什么也不知道了，识种子就是第八识流注出来的。</p><p>二、问：七转识不在身体里面，也不在身体的外面。如来藏无形无相，无处不在，恒常不变，能生万法。所以哪里有法出现，识就在哪里了别，这就是种子的流注吧？</p><p>答：七个识本身也是无形无相的，所以也不能说七识在身体的内外，楞严经第一卷里讲了这个问题。如来藏在六根处变现内六尘，而不在其它处所，因为没有其它处所可以变现内六尘，所以六根触六尘就是关键之处。根尘识三者和合触，这里十八界俱全，也有五阴的功能，再没有其它处所可以变现六尘。哪里有法出现，哪里就有如来藏，就有第七识，但不一定有六识。七识在哪里出现，在哪里了别，如来藏就在哪里输送识种子，以配合七识的运行，让五阴正常运转。</p><p>三、问：如来藏是体，妄法是用，如来藏遍法界都在，妄法依祂而有一切相，离一切相就显现不了如来藏的妙用。所以一切妄法也是真空生的妙有，知如來藏是如如不动的，相是如来藏变的，是这样吗？</p><p>答：这个知见挺好，理论是不错，但还需要进一步参禅证悟如来藏的体、相和用。如来藏的本体是无形无相的，但如来藏出生的一切法都是如来藏的相和用，如来藏的用还包括七大种子、业种和如来藏的心所法。把定力修好时，再参话头参拖死尸的是谁，因缘具足以后就能悟明为什么是这样。如来藏并不是遍虚空，因为如来藏不是色法，不能存在虚空里，虚空里如果有如来藏，就不是虚空了；相反，是虚空在如来藏里，是如来藏里非常微小的一个色边的色法。</p><p>四、问：每个人都有如来藏，人与人之间的如来藏是相容相互重叠的吗？</p><p>答：众生之间的如来藏是相容的，但不是互相重叠的，如来藏没有形和相，不能重叠，有形有相的法才能谈得到重叠与否。但是众生的如来藏之间有相互紧密的配合关系，共同生成、显现、执持众生的生存环境，如来藏之间互相有联系，联系方式独特，范围非常广。有了道种智以后，才能把其中的秘密一点一点的挖掘出来。</p><p>五、问：众生的如来藏，就像很多灯泡在一起，光光相融而不妨碍，是不是两个人握手的时候如来藏就融合在一起，不握手的时候如来藏就分开了？</p><p>答：我们要知道最重要的一点就是，如来藏是无形无相的，不像有相有形的五阴身或者物质色法那样可以重叠在一起，可以碰触到在一起，可以和合在一起，如来藏和如来藏绝不会融合在一起的。如来藏可以比喻为灯，其所发出来的灯光，光光相融而不妨碍，互相都有我们暂时不可知的密切配合关系，互相能了知各自所存的业种。手和手可以握，如来藏之间无法融合。</p><p>六、问：如来藏无形无相，大到不可知不可穷尽，世间万法都在其中。每个人有每个人的世界，每个人的世界由每个人的如来藏显现吗？</p><p>答：如来藏无大无小，说祂大就是在说祂小，不管说祂多大都是小，说有大小，那就是有形和相了，多大都是小，多小都是大。无相却包罗万相的法哪里有大小？包罗也不是物质色法的那种包罗。</p><p>每个人五蕴世间的一切，都是自己的如来藏显现出来的，与他人的如来藏没有关系。但也不是完全没关系，虽然每个人接触到的一切六尘境界，都是自己的如来藏变现出来的内相分，但是这些内相分是依据外相分而来的。外相分是所有共业众生的如来藏所共同变现的，与每一个共业众生的如来藏都有关系。如果其他众生是大善或者是大恶，就能影响到外相分，从而也影响到每一个人的内相分。所以众生的如来藏之间是有牵连的。</p><p>七、问：学如来藏法的用处是什么？</p><p>答：知有如来藏和证得如来藏，才能彻底知五阴无我，才能断尽无明，了生死，得解脱，出生死轮回苦。不知有如来藏不证如来藏，就认为万法为实有，这样就不能去除贪爱，不能去除无明，不能彻底了生死，不能究竟得解脱。无明使众生执著、造业、受苦，学如来藏法能断尽无明，彻底解决生死。证得如来藏，了知世间和出世间的真实相，能出生大智慧，以此智慧，成就佛道，永无生死。</p><p>八、问：亲证第八识以后，才能逐渐全部了知第八识的体性，心行才能真正转变吗？</p><p>答：亲证第八识以后可以现前观察祂的运作和在运作当中表现出的清净体性，这样就对第八识的清净无为性逐渐清楚了知，有了修学的榜样；同时也越来越逐渐深入的观察到自身五阴身和一切法的幻化不实性，内心的烦恼和执著性就慢慢减轻了，心行就会渐渐转变了。</p><p>没有证得第八识时，观察不了第八识的运作过程，无法现前观察祂的清净无为性，内心没有依止，心行就不能转变。不知道第八识在哪里，不识得祂，就不能现前观察了别祂，所以证悟是非常关键的。证得真心，依止于真心，妄心才能慢慢清净下来，慢慢得到降伏，降伏以后才能心得自在。证得真心，知道五阴世间的一切法都是真心所现起的假相，就不再为了五阴而造作恶业，不再为了五蕴而造贪嗔痴业。破除了无明就知道了何为真何为妄，从此不再认妄为真，烦恼就能得到降伏。</p></div>"
},{
    "title": "戒定慧具足才能证悟避免解悟",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>戒定慧具足才能证悟避免解悟</strong></p><p>佛说：因戒生定，因定生慧。戒定慧不仅指意识要具足，意根也要具足。意根要想有断我见的智慧，明心的智慧，也要有禅定，在禅定中参究思量无我之法，参究思量真如佛性，才能断我见和明心见性。</p><p>如果意根不能亲自参究思量，那就不能认可意识灌输给祂的道理，最后也是意识解悟。而意根要想参究思量无我之理，也同样要有禅定，否则祂就会分心散乱。如果意根没有禅定，就会带动六识散乱，六识散乱，不断的了别，总是要把了别的内容汇报给意根，意根就要不断的分心，无法集中精力参究，也不能参究出一个理想的结果。</p><p>什么方法也代替不了禅定，解悟的修行方法，一定要小心。按照世尊教导的方法修行，一定不会错。佛世时的所有弟子全部都是打坐修定的，这样平时行住坐卧心都在定中思惟佛法。唐宋朝时明清以前民国以前的修行人都是以打坐修定为主，之后行住坐卧中都能有禅定，心常在定中，这样心思细密，破参的机缘容易成熟，触缘即证。我们如今回头看他们证得佛法好像都是那么容易，殊不知他们的基础修行都相当好，善根福德具足，三十七道品具足，当然里面包含禅定也具足，思惟伶俐清晰，闻到相应的某种法，立时就能证悟。</p><p>所有人讲法中，佛讲的是最圆满最究竟的，没有人能超过佛的智慧，信佛语绝对没有错。无论什么时代，佛法永远不变异，佛法永远适用于一切时代。多读佛经，就能增长智慧，不会走冤枉路，也不容易被人欺瞒。所有菩萨的讲法，与佛相比都有缺漏和渗漏，都有不圆满不究竟之处，所以我们修学佛法还是以佛经为主。</p></div>"
}]