[{
    "title": "第一章　宣无常劝精进",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第一章    宣无常劝精进</strong><br/></p><p>原文：<strong>导师说难遇    闻者喜亦难</strong></p><p><strong>          大人所乐听    小人所恶闻</strong></p><p><strong>          众生可愍伤    坠老死险路</strong></p><p><strong>          野人恩爱奴    处畏痴不惧</strong></p><p><strong>          世界若大小    法无有常者</strong></p><p><strong>          一切不久留    暂现如电光</strong></p><p><strong>          是身属老死    众病之所归</strong></p><p><strong>          薄皮覆不净    愚惑为所欺</strong></p><p><strong>          汝常为老贼    吞灭盛壮色</strong></p><p><strong>          如华鬘枯朽    毁败无所直</strong></p><p><span>释：三界大导师释迦牟尼佛说，这个坐禅三昧经难值难遇。听到这部经的人能生起欢喜心也是极难的。发大心趣求无上佛道的人才愿意听闻，而心量狭小不愿意趣求无上菩提的人就不愿意听闻。众生是非常值得怜悯和哀叹的，坠堕在生老病死的险恶之途中，成为生死旷野中恩爱的奴才，处在令人畏惧之处却不知道恐惧害怕。不管世界是大还是小，世间一切法都没有长存不灭的，一切法都不久留，都是暂时出现然后像电光一样迅速消失。</span><br/><strong/></p><p>这个无常的色身属于生老病死一切烦恼之所聚集处，薄薄的皮肤覆盖着肮脏不净之物，愚痴的人就被这样的不净色身所欺骗。你们常常被衰老之贼吞掉了健康盛壮的身体，就像花蔓枯萎腐朽毁坏以后，没有一点价值。</p><p>原文：<strong>顶生王功德    共释天王坐</strong></p><p><strong>　　　报利福弘多    今日悉安在</strong></p><p><strong>　　　此王天人中    欲乐具为最</strong></p><p><strong>　　　死时极苦痛    以此可悟意</strong></p><p><strong>　　　诸欲初软乐    后皆成大苦</strong></p><p><strong>　　　亦如怨初善    灭族祸在后</strong><strong> </strong></p><p><strong>　　　是身为秽器    九孔常流恶</strong></p><p><strong>　　　亦如那利疮    绝治于医药</strong></p><p><strong>　　　骨车力甚少    筋脉缠识转</strong></p><p><strong>　　　汝以为妙乘    忍着无羞耻</strong></p><p><strong>　　　死人所聚处    委弃满塳间</strong></p><p><strong>　　　生时所保惜    死则皆弃捐</strong></p><p>释：昔日有顶生转轮圣王，统治四天下以后，上天与欲界天主释提桓因共坐一座，分领天界，果报殊胜福德广大，可是现在他在哪里呢？此顶生王在人天当中娱乐资具最为殊胜，死亡之时却是极度痛苦。从这里应该悟出一个道理，一切世间的五欲之乐最初可能是舒适快乐的，后期全部都成为极大的痛苦。就像冤家相遇时，最初都是和善的，可是灭去九族的祸患却紧追在后。</p><p>这个五阴色身是充满肮脏之物的器具，九孔常流恶露不净物，也就像恶疮一样，再也没有医药可治。用骨头做成的车其拉力太小了，筋脉缠绕几个识心就这样运转着，你们都以为它是非常美妙的撵御车乘，一直忍受着折磨却毫不感到羞耻，最后丢弃在死人所聚集之荒野坟墓间。活着的时候百般保护爱惜，死后可就全部都丢弃掉了。</p><p>原文：<strong>常当念如是    一心观莫乱</strong></p><p><strong>　　　破痴倒黑暝    执炬以明观</strong></p><p><strong>　　　若舍四念止    心无恶不造</strong></p><p><strong>　　　如象逸无钩    终不顺调道</strong></p><p><strong>　　　今日营此业    明日造彼事</strong></p><p><strong>　　　乐着不观苦    不觉死贼至</strong><strong>　　　</strong></p><p><strong>　　　匆匆为己务    他事亦不闲</strong></p><p><strong>　　　死贼不待时    至则无脱缘</strong></p><p><strong>　　　如鹿渴赴泉    已饮方向水</strong></p><p><strong>　　　猎师无慈惠    不听饮竟杀</strong></p><p><strong>　　　痴人亦如是    勤修诸事务</strong></p><p><strong>　　　死至不待时    谁当为汝护</strong></p><p>释：你们应当常常要有这样的念头，专心一意的观行此法莫要心思散乱，一定要破除愚痴迷惑颠倒的黑暗大宅，手执智慧的火炬以明眼来观察。如果舍离四念处的止观修行，心就会无恶不作了。就像一头大象逍遥放逸没有钩锁，始终不能顺从调象师所指之路而行。今天做这样的事，明天经营那样的事，乐着所作之事，而不观察其中的苦，不知不觉中死亡之贼就到来了。</p><p>一生一世当中匆匆忙忙的营造自己的事业，其他之事也同样操心费力。可是死亡之贼不等时节，来到之时你们就再也没有逃脱的机会了。就像野鹿渴时奔赴泉水之处，正在喝着刚刚找到的泉水，可是猎师竟然一点也没有慈悲恩惠心，不等野鹿喝完水就把野鹿杀掉了。愚痴的人也是这样，精勤的造作诸事业，死亡来临时不选择时机，到时候谁能来保护你们。</p><p>原文：<strong>人心期富贵    五欲情未满</strong></p><p><strong>　　　诸大国王辈    无得免此患</strong></p><p><strong>　　　仙人持咒箭    亦不免死生</strong></p><p><strong>　　　无常大象蹈    蚁蛭与地同</strong></p><p><strong>　　　且置一切人    诸佛正真觉</strong></p><p><strong>　　　越度生死流    亦复不常在</strong><strong> </strong></p><p><strong>　　　以是故当知    汝所可爱乐</strong></p><p><strong>　　　悉应早舍离    一心求涅槃</strong></p><p><strong>　　　后舍身死时    谁当证知我</strong></p><p><strong>　　　复得遇法宝    及以不遇者</strong></p><p>释：人心都期望得到大富大贵，众生贪着五欲之情永远不知道满足。所有的诸大国王之辈，没有一个能免得了此之生死过患的。那些山中的长寿仙人，拿着加持了咒语的宝剑而练功修道，也免不了生生死死之事。一旦无常的大象一脚踏来，众生都像蚂蚁一样贴伏在地上。普通人且不说了，诸佛已经成了无上正等觉，已经超越了生死流，还是照样不常在世间存在。因此你们应当知道，你们觉得所有可爱可乐之人事物，都应该早早的舍离，一心求取涅槃之乐。最后舍身死亡时，谁能知道我是遇到了佛法之宝藏，还是没有遇到。</p><p>原文：<strong>久久佛日出    破大无明暝</strong></p><p><strong>　　　以放诸光明    示人道非道</strong></p><p><strong>　　　我从何所来    从何处而生</strong></p><p><strong>　　　何处得解脱    此疑谁当明</strong></p><p><strong>　　　佛圣一切智    久违乃出世</strong></p><p><strong>　　　一心莫放逸    能破汝疑结</strong><strong>　　　</strong></p><p><strong>　　　彼不乐实利    好着弊恶心</strong></p><p><strong>　　　汝为众生长    当求实法相</strong></p><p><strong>　　　谁能知死时    所趣从何道</strong></p><p><strong>　　　譬如风中灯    不知灭时节</strong></p><p><strong>　　　至道法不难    大圣指事说</strong></p><p><strong>　　　说智及智处    此二不假外</strong></p><p>释：久远时劫才能遇到一尊佛出世，打破世间巨大的无明黑暗，为众生放射出智慧的大光明宝藏，指示给众生什么是正道和非正道。众生于是心里生起疑问：我从哪里来，从什么处而出生，在哪里能得到解脱，这些疑问谁能给我破解？佛是世间的大圣人，是一切智人，久远时劫才能出现在世间，你们应当一心谛观思惟不散乱，就能破解你们的疑结。</p><p>你们过去世时都不喜欢真实的利益，心行渺小弊恶，你们现在是众生中的长者，应当追求实相之法。谁能知道自己死亡之时，所投奔的是哪一道，譬如风中的孤灯，不知道什么时节就灭了。能通达到菩提大道的佛法并不是很难，佛陀大圣把这些路途都已经铺设好了，告诉大众说获得智慧以及智慧所行之处，都不在心外而求。</p><p>原文：<strong>汝若不放逸    一心常行道</strong></p><p><strong>　　　不久得涅槃    第一常乐处</strong></p><p><strong>　　　利智亲善人    尽心敬佛法</strong></p><p><strong>　　　厌秽不净身    离苦得解脱</strong></p><p><strong>　　　闲静修寂志    结跏坐林间</strong></p><p><strong>　　　捡心不放逸    悟意觉诸缘</strong><strong> </strong></p><p><strong>　　　若不厌有中    安睡不自悟</strong></p><p><strong>　　　不念世非常    可畏而不惧</strong></p><p><strong>　　　烦恼深无底    生死海无边</strong></p><p><strong>　　　度苦舡未办    安得乐睡眠</strong></p><p><strong>　　　是以当觉悟    莫以睡覆心</strong></p><p><strong>　　　于四供养中    知量知止足</strong></p><p>释：如果你们修行能一心精进不放逸，常常专一其心修行佛道，不久就能证得大涅槃，到达第一永久的常乐之处。利根有智慧的人应当多亲近善知识，尽心尽力恭敬佛法，厌离污秽肮脏的色身，才能离去苦难得到解脱。悠闲自在静静的修行，淡泊明志，常常在树林间结跏趺坐，收敛自心不放逸，体悟我所说法义，觉悟一切境缘的虚幻。</p><p>心如果不能厌离三界有，心安理得的大睡，自己不觉悟，不念着世间无常，对于可怕的世界也不知道畏惧。烦恼深重得没有底边，生死的大海也就无边无际。自己能度生死苦海的法船还没有造好，怎么能安心的贪于睡眠。因此应当觉悟，不要再用睡眠来遮盖自己的修道之心，应当于饮食卧具医药四种供养中善知止足，不要有过分需求。</p><p>原文：<strong>大怖俱未免    当宜勤精进</strong></p><p><strong>　　　一切苦至时    悔恨无所及</strong></p><p><strong>　　　衲衣树下坐    如所应得食</strong></p><p><strong>　　　勿为贪味故    而自致毁败</strong></p><p><strong>　　　食过知味处    美恶都无异</strong></p><p><strong>　　　爱好生忧苦    是以莫造爱</strong></p><p><strong>　　　行业世界中    美恶无不更</strong></p><p><strong>　　　一切已具受    当以是自抑</strong></p><p>释：对于生死的巨大恐惧和担忧都没有免离时，应当勇猛精进的勤于修行。不要等到一切苦难都来临时，悔恨交加，躲避不及。你们应当穿着出家衣树下端坐，思惟佛法，按照自己所应该得到的饮食而食，不要因为贪求美味的缘故，而毁坏了自己的道业。饮食过后就知道，一切味尘无论好坏都没有差别，不要挑剔饮食之味，有所喜爱，就有忧苦，所以不要造作贪爱之业。人生活在大千世界中，好坏之事没有一样没有经历过，一切事情全部都领受过，因此应当降伏控制自心，不要再多有贪求。</p><p>原文：<strong>若在畜兽中    唌草为具味</strong></p><p><strong>　　　地狱吞铁丸    燃热剧迸铁</strong></p><p><strong>　　　若在薜荔中    脓吐火粪屎</strong></p><p><strong>　　　涕唾诸不净    以此为上味</strong></p><p><strong>　　　若在天宫殿    七宝宫观中</strong></p><p><strong>　　　天食苏陀味    天女以娱心</strong></p><p><strong>　　　人中务贵处    七馔备众味</strong></p><p><strong>　　　一切曾所更    今复何以爱</strong></p><p><strong>　　　往返世界中    厌更苦乐事</strong></p><p><strong>　　　虽未得涅槃    当勤求此利</strong></p><p>释：你们过去生中，曾经托生到畜生野兽之中时，吃野草作为最美的饮食；托生到地狱中时，吞噬铁丸作为饮食，那铁丸燃烧得那么剧烈而滚烫，还往外迸发火星，可是由于恶业你们不得不食；托生到恶鬼中时，以人类吐出的脓痰、猛火、粪便、尿液、鼻涕等等为最美的饮食而食。托生到天上的七宝宫殿中时，食奶酪上味儿的天食甘露等，有天女以共相娱乐。托生到人中富贵人家时，食七种珍宝，具足一切色香美味。种种这一切，你们都曾经经历过，现在为什么还要因为贪爱而往返六道之中，再经受种种苦乐之事？你们现在还没有证得涅槃乐，应当精勤努力，以求获得此种殊胜的利益功德。</p></div>"
},{
    "title": "第二章　贪嗔痴烦恼的特征",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　贪嗔痴烦恼的特征</strong></p><p>原文：<strong>学禅之人。初至师所。师应问言。汝持戒净不。非重罪恶邪不。若言五众戒净。无重罪恶邪。次教道法。</strong></p><p><strong>若言破戒。应重问言。汝破何戒。若言重戒。师言如人被截耳鼻。不须照镜。汝且还去。精勤诵经。劝化作福。可种后世。道法因缘。此生永弃。譬如枯树。虽加溉灌。不生华叶及其果实。</strong></p><p><strong>若破余戒。是时应教。如法忏悔。若已清净。师若得天眼他心智。即为随病。说趣道之法。</strong></p><p><strong>若未得通。应当观相。或复问之。三毒之中。何者偏重。淫欲多耶。瞋恚多耶。愚痴多耶。</strong></p><p>释：想要修学禅定之人，最初到师父所在之处，师父应该询问他：你持戒清净否？是否犯过戒行？所犯戒行不是犯的重罪非常恶邪的那种吧？学人如果说自己五戒都清净，没有重大的罪业和恶邪业。之后，师父就应该教他禅定之法。</p><p>如果学人说自己破戒了，师父应该再问他：你破了什么戒？学人如果说破的是重戒。师父则应该说：就像人被割截掉耳朵和鼻子以后，此人就不用再照镜子了。你先回去，精进的诵持佛经，多修福德，这样就能种下后世修道的因缘，今世就没有机会得道了。譬如枯干了的树木，虽然多施予雨水灌溉，也不能再生长花叶和果实了。</p><p>如果学人破的是其它的轻戒，这时候师父就教导他如法的忏悔。如果此人忏悔，心得清净了，师父如果修出了天眼通和他心智通，就要根据他的具体情况为他宣说适合他的修道之法。如果师父没有修出神通，应该观察这个人的外表相貌和心行之相状。再问他，贪嗔痴三种烦恼毒之中，你是哪个偏重一点？你是淫欲偏重，还是嗔恚偏重，还是愚痴偏重？</p><p>原文：<strong>云何观相。若多淫相。为人轻便。多畜妻妾。多语多信。颜色和悦。言语便易。少于瞋恨。亦少愁忧。多能技术。好闻多识。爱著文颂。善能谈论。能察人情。多诸畏怖。心在房室。好着薄衣。渴欲女色。爱着卧具。服饰香华。</strong></p><p>释：如何观相呢？如果是多淫的相貌，为人比较轻浮，娶多个妻妾，言语偏多，也多信从他人；面色和悦，言语随和，心少嗔恨，也少忧愁；掌握多种才能和技术，见多识广，喜欢歌词诗赋，能言善辩；善能观察人情世故，多所畏惧；心乐房室，喜好穿着薄薄的衣饰，渴望贪着女色，喜爱卧具，穿着讲究，喜欢香气和鲜花。</p><p>原文：<strong>心多柔软。能有怜愍。美于言语。好修福业。意乐生天。处众无难。别人好丑。信任妇女。欲火炽盛。心多悔变。喜自庄饰。好观彩画。悭惜己物。侥幸他财。好结亲友。不喜独处。乐着所止。随逐流俗。乍惊乍惧。志如猕猴。</strong></p><p>释：淫欲心重的人，心多柔软，有怜悯心能怜悯他人，言语柔和美妙，喜欢修福，也向往升天享乐，处在大众中无所畏惧，很受欢迎，随和自在。善于分别他人外貌好丑，容易相信女人。欲火炽盛，心却容易后悔而改变初心，心不长久。喜欢装饰打扮自己，爱好观看彩色画像。吝惜自己的财物，而能很幸运的得到他人的财物。喜欢结交亲里朋友，不喜欢独处。乐着所居止处而随波逐流。对于人事总是一惊一乍，志向如猕猴一样不定。</p><p>原文：<strong>所见浅近。作事无虑。轻志所为。趣得适意。喜啼喜哭。身体细软。不堪寒苦。易阻易悦。不能忍事。少得大喜。少失大忧。自发伏匿。身温汗臭。薄肤细发。多皱多白。剪爪治须。白齿趣行。喜洁净衣。</strong></p><p><strong>学不专一。好游林苑。多情多求。意着常见。附近有德。先意问讯。喜用他语。强颜耐辱。闻事速解。所为事业。分别好丑。愍伤苦厄。自大好胜不受侵。喜行施惠。接引善人。得美饮食。与人共之。</strong></p><p>释：目光短浅，没有远虑，作事不计后果，志意轻薄下劣，对合己心意的人事感兴趣，遇到不合己心的事情就爱啼哭。身体瘦削无力，忍受不了寒冷和苦痛，这些是轻浮的表现。遇事不能堪忍，不是退缩就是喜悦异常，稍稍有所得就能大乐，稍稍有所失就会忧愁懊恼。头发紧贴头皮，喜欢梳理头发，好着装打扮。身体温暖，出汗有臭味，这是心不清净的外在表现。心不清净的人，身体有种特殊的气味，汗液难闻，体味难闻，大小便臭味重。皮肤薄，头发细，皮肤较白皱纹多。经常剪手指甲修理胡须，牙齿洁白，喜欢穿洁净的衣饰。</p><p>兴趣广泛，不专一修学一种才能技艺，喜欢四处游玩。情感丰富，贪求极多，心意着于俗常见解，头脑简单。如果附近有有德行修养的人，能够主动攀结问候，喜欢随和他人言语，强装笑脸善于忍耐，屈迎符合，听到事理，马上就能理解明白。善于分别好丑，同情他人的苦恼和困难。自大而喜欢争胜，不愿意受他人的侵犯和凌辱。喜欢施舍他人，接引一些善人，自己有美食能与他人共享。</p><p>原文：<strong>不存近细。志在远大。眼着色欲。事不究竟。无有远虑。知世方俗。观察颜色。逆探人心。美言辩慧。结友不固。头发稀疏。少于睡眠。坐卧行立。不失容仪。所有财物。能速救急。寻后悔惜。受义疾得。寻复喜忘。惜于举动。难自改变。难得离欲。作罪轻微。如是种种。是淫欲相。</strong></p><p>释：心里不存目前和细小之事，志向远大，好高骛远。眼睛喜欢见美色，作事不究竟彻底。没有远虑，善知人情世故，会察言观色，探究人心。能言善道，却交友泛泛，没有深交，朋友也不稳固。头发稀疏，少于睡眠，行走坐卧，却能保持仪容。</p><p>能把自己所有的财物救济他人的急难，过后不久却后悔惋惜不已，这种人帮助人想要快速得到回报。不久就会忘却自己的发心，而不采取行动实现自己的承诺。习气很难改变，也很难离欲，但是所作的错事还是轻微，不太严重。</p><p>以上这些种种特征，就是淫欲相。人的每个细小的身行和口行，都能表露自己的心性品德，细节处往往自己注意不到，他人也往往忽略。但是细节确实最能说明问题。一个表情，一个动作，一个脸色，一个语气，一个态度，一个眼神，都能把心态习气德行表露出来，自己却难发现和控制。大的方面，可以伪装，细小的方面却注意不到，没法伪装。</p><p>原文：<strong>瞋恚人相。多于忧恼。卒暴怀忿。身口粗䵃。能忍众苦。触事不可。多愁少欢。能作大恶。无怜愍心。喜为斗讼。颜貌毁悴。皱眉眄睐。难语难悦。难事难可。</strong></p><p>释：嗔恚心重的人的相貌，忧愁烦恼多，往往要突发性的暴怒，内心总是怀着愤怒不平。身体粗大雄壮，口业粗鲁。能忍受常人所不能忍的苦难，遇事总是不平，不随顺他人的见解。面露愁容，少于欢乐，不高兴的时候多。容易做大恶事，心狠无怜悯心，喜好斗争诤讼。面相丑陋，皮肤粗糙，萎黄暗黑，容颜憔悴。喜欢皱眉，斜眼看人。一般人很难跟他说得上和气话，也很难悦可他的心。难于交往奉侍，难可他意。嗔恚心重的人，一般长相比较丑陋难看，凶相多。</p><p>原文：<strong>其心如疮。而宣人阙。义论强梁。不可折伏。难可倾动。难亲难沮。含毒难吐。受诵不失。多能多巧。心不懒堕。造事疾速。持望不语。意深难知。受恩能报。有能聚众。自伏事人。不可沮败。能究竟事。难可干乱。少所畏难。譬如师子。不可屈伏。</strong></p><p>释：其心不平，像受过什么创伤似的，喜欢说人缺陷，示人短处，言词强悍，喜占上风，一般人折服不了他。其心难于动摇，别人劝不动，难于让人亲近，也难于使其丧失意志，遇事心不退缩。一旦内心怀于嗔恨，难于平息消除。凡所经历之事，轻易不忘。做事能力强，技能出众，心灵手巧，勤奋不懒惰。做事快速，遇事观望不语。</p><p>有嗔毒的人，遇事就藏于心中，不好言语。心意隐藏很深，他人不容易知，受人恩惠，则能回报。才能出众，能聚拢人众，能平事，能压伏众人。遇难事而不退缩，不容易沮丧，不容易挫败，能把事情做得究竟彻底，不会半途而废，别人很难阻挡干扰得了，这样的人一般也是无所畏惧，就像狮子一样，决不屈服。</p><p>原文：<strong>一向不回。直造直进。忆念不忘。多虑思惟。诵习忆持。能多施与。小利不回。为师利根。离欲独处。少于淫欲。心常怀胜。爱着断见。眼常恶视。真实言语。说事分了。少于亲友。为事坚着。坚忆不忘。多于筋力。肩胸姝大。广额齐发。心坚难伏。疾得难忘。能自离欲。喜作重罪。如是种种。是瞋恚相。</strong></p><p>释：譬如狮子，一向不回头，直冲直撞。所遇人事，能忆念不忘。内心思虑繁多，思惟敏捷，喜欢记忆读诵，能多布施，豪侠仗义。惠人小利不求回报，也不计较。能指导他人，根性猛力，能离事俗欲，喜欢独处，少于淫欲。心里常有胜人之心，独断专行，执取自己的独断见解而不放。常常恶眼视人，喜欢实话实说，不说谎言，处事耿直。亲友少，交往也少，做事坚持己见，不听人劝。记忆力强，身体强壮，肩膀和胸膛宽厚结实，额头饱满宽阔平齐。内心坚强难于调伏，反应迅捷，遇事不忘，能离贪欲，好造大恶业。</p><p>以上这些种种都是嗔恚相貌。嗔恚心不平不静，就会障碍禅定。执念不忘，心不清静，障碍禅定。</p><p>原文：<strong>愚痴人相。多疑多悔。懒堕无见。自满难屈。憍慢难受。可信不信。非信而信。不知恭敬。处处信向。</strong></p><p><strong>多师轻躁。无羞搪突。作事无虑。反教浑戾。不择亲友。不自修饰。好师异道。不别善恶。难受易忘。钝根懈怠。诃谤行施。心无怜愍。破坏法桥。触事不了。</strong></p><p>释：愚痴人的相貌，遇事心中不明疑心偏多，做事之后常常后悔，心性懒惰，不勤思考，没有主见，总是犹豫不决，决而又生悔。心中常常自满，难以信受他人善语劝告，不肯屈服妥协。内心无知又不承认自己无知，难于被说服劝导。无知骄慢，却又不接受人言，不信服他人。该相信的人事不信，不该信的人事却偏要信。不知恭敬可恭敬之人，不辨是非，轻信人言，遇什么就信什么，不能深思熟虑作以考察。</p><p>处处师从，不择良人和善法，心思轻躁浮动，无有羞耻，莽撞唐突。做事不动脑筋，思惟劣弱。自己愚痴反教他人，为人浑噩粗戾。不择亲友，不知亲疏，糟糟蹋蹋，不假修饰。喜欢师学邪道，不能分别善恶是非曲直。对于所学难于受持，常常忘记，根性暗钝，心常懈怠。呵骂诽谤布施之人，没有怜悯之心。常常破坏法教，遇事心不清明，也不明了。</p><p>原文：<strong>瞋目不视。无有智巧。多求悕望。多疑少信。憎恶好人。破罪福报。不别善言。不能解过。不受诲喻。亲离憎怨。不知礼节。喜作恶口。须发爪长。齿衣多垢。为人驱役。畏处不畏。乐处而忧。忧处而喜。悲处反笑。笑处反悲。牵而后随。能忍苦事。不别诸味。难得离欲。为罪深重。如是种种。是愚痴相。</strong></p><p>释：对于亲友和善人，常以嗔心相向，恶眼相视，头脑愚木没有智慧和善巧。四处贪求，心性多疑，不信他人所言。憎恶好人，易造恶行，毁坏福报。不能辨别他人好言好语，也不能晓了自他的过失。不接受他人的教诲和譬喻言辞，对亲友易生憎恨和怨恼。人前行事不知礼节，喜出恶口。蓬头垢面，指长衣垢。多被人驱使，险难处却不知畏惧。处乐处而忧恼，处忧恼处而乐，可悲之处反而高兴，可欢喜之处反而悲伤。被人强牵，随人之后，却能忍斯苦事。不能辨别酸甜苦辣，处处贪着，难于离欲，往往造罪较为深重。以上这些种种都是愚痴相貌。</p><p>贪嗔痴三毒烦恼中，贪欲最容易降伏和断除，嗔恚在其次，最难降伏和断除的是愚痴。因为愚痴，不别善恶，不进人言，那就没办法改变自心。嗔恚比较坚固难断，但只要有智慧，听人劝导，还是有办法克服的。贪欲的人，如果不愚痴，深思利害得失，修出一些禅定，最容易受熏染，容易断除和降伏。</p><p>原文：<strong>若多淫欲人。不净法门治。若多瞋恚人。慈心法门治。若多愚痴人。思惟观。因缘法门治。若多思觉人。念息法门治。若多等分人。念佛法门治。诸如是等种种病。种种法门治。</strong></p><p>释：如果是淫欲多的人，用不净观来对治，如果是多嗔的人，用慈心法门来对治。如果是思虑过多的人，用数息法门来对治，如果是几种都重的人，用念佛法门来对治。像如是等种种的心病，要用种种法门对治。</p></div>"
},{
    "title": "第三章　治贪欲法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　治贪欲法门</strong></p><p>原文：<strong>淫欲多人。习不净观。从足至发。不净充满。发毛爪齿。薄皮厚皮。血肉筋脉。骨髓肝肺。心脾肾胃。大肠小肠。屎尿洟唾。汗泪垢坋。脓脑胞胆。水微肤脂。肪脑膜身中。如是种种不净。复次不净渐者。观青瘀膀胀破烂。血流涂漫。臭脓啖食不尽。骨散烧焦。是谓不净观。</strong></p><p>释：淫欲多的人，应该多修习不净观。其观行方法是从脚观到头发，观察都充满着不净，污秽不堪，没有一处是干净的。如：头发、汗毛、手脚指甲、牙齿、薄皮和厚皮、血肉和筋脉、骨髓、心肝、脾胃、肾、大肠、小肠、屎尿、唾液、汗液、眼泪、脑浆、脂肪、脑膜等等，全身所有物件有种种不净，都是肮脏的。不净观其次再渐进观身体的青淤、肿胀、烂坏、脓沧，流出的血液到处弥漫，散发腥臭味，骨头散掉，支离破碎，被火烧得焦糊等等这些现象，都是不净相。</p><p>不净观可以打坐时观想，可以见人时观想对方和自己，都是这样污秽肮脏不净，观到一定时候，就会生起厌离心，不再喜欢身体，不想再多淫欲了。观到最后，成就白骨观三昧，开眼闭眼能见自他色身皆为白骨，这属于定果色，他人不能见，只有修出这种三昧定境的人可见。这样的定境，是通过意识长期的观想，成功熏染了意根，意根就会认为色身即是白骨样貌，于是如来藏就会显现出白骨相，意识随时随处就能见到白骨相，于是观想成就。</p><p>所以一切的定境和三昧，都是意识观想，成功熏染改变意根的结果。意识很容易认可各种理论，只是意根因为无明深重，习性大，很难认可，这就造成了修行的不易。每个众生的意根无明程度不同，习性也不同，无明越薄，修行越快，越容易出现禅定，越容易进入三昧，越容易证法。白骨观成就时，首先就会断除身见，否认身体为我，贪欲得到降伏，不再严重的执身，得一分解脱；其次能断我见，证得四果阿罗汉，解脱三界烦恼束缚。</p><p>原文：<strong>复次多淫人。有七种爱。或着好色。或着端正。或着仪容。或着音声。或着细滑。或着众生。或都爱着。若着好色。当习青瘀观法。黄赤不净色等亦复如是。若着端正。当习膀胀身散观法。</strong></p><p><strong>若着仪容。当观新死血流。涂骨观法。若着音声。当习咽塞命断观法。若着细滑。当习骨见及干枯病观法。若爱众生。当习六种观。若都爱着。一切遍观。或时作种种。更作异观。是名不净观。</strong></p><p>释：再次，多淫欲的人有七种爱着，或者是喜欢好看的色相，也就是美色，或者是喜欢端正的色相，或者是喜欢他人的仪容外表，或者是喜欢他人的音声，或者是喜欢他人细滑的肌肤。或者是喜欢一切的众生相，或者是全部都贪爱着。</p><p>如果是喜欢贪着好看色相的人，应该修习身体青淤肿胀烂坏的观行方法，或者观行色身黄脓红血等等种种不净。如果是贪着相貌端正的人，应当修习身体膨胀身体散坏的观行方法。</p><p>如果是贪着外表仪容的人，应当修习观想刚死之人血流满身、涂污骨头的观行方法。如果贪着美妙的音声，应当修习喉咙堵塞卡死而断命的观行方法。</p><p>如果是贪着细滑皮肤的人，应当修习白骨观，及修习身体得干枯病逐渐干枯的观行方法。如果是一切生相都贪着的人，应当修习以上六种观行方法。如果是贪着身体一切相貌，那么就全面的观行色身所有不净相，一一都要观行，不空过。或者把身体所有的相貌都要作变异的观行，观行其死后的不可爱的相貌。</p><p>这些观行方法很快就讲完了，可是具体观行时，可能需要几个月，一年半载，或者是更长时间，才能降伏贪爱，不再贪着色身，减轻欲心。平时应注意观行身体各部位的肮脏污秽相、血涂相、肿烂相、破败相，贪着心就会减轻了。看见喜欢的人，就把对方换成一个最肮脏丑陋的人的相貌，心里就会不太喜欢了。</p><p>原文：<strong>问曰。若身不净如臭腐尸者。何从生着。若着净身。臭腐烂身亦当应着。若不着臭身。净身亦应不着。二身等故。若求二实净。俱不可得。</strong></p><p><strong>人心狂惑。为颠倒所覆。非净计净。若倒心破。便得实相法观。便知不净。虚诳不真。复次死尸。无火无命无识。无有诸根。人谛知之。心不生着。以身有暖有命有识。诸根完具。心倒惑着。</strong></p><p>释：问：如果色身不净如臭秽腐烂的尸体，那还因为什么而生执著？如果还贪着清净的色身，臭秽腐烂的色身也应当贪着；如果不贪着臭秽腐烂的色身，清净的色身也不应当贪着，两种身体都一样故。如果寻求两种色身真实的清净相，却了不可得，因为都是生灭法。</p><p>人心狂乱迷惑，被自己的颠倒知见所遮盖，把不净的色身计着为清净。如果破除心的颠倒知见，就能得到实相法的观行，就能知道不净相虚诳不真实。再者说，死尸没有火大温度，没有命根，没有识心，没有六根，人仔细观察之，心就不生贪着。因为身体有暖度，有命根，有识心，六根完备，观察之，心就会生起颠倒迷惑贪着。</p><p>原文：<strong>复次心着色时。谓以为净。爱着心息。即知不净。若是实净。</strong></p><p><strong>应当常净。而今不然。如狗食粪。谓之为净。以人观之。甚为不净。是身内外。无一净处。若着身外。身外薄皮。举身取之。才得如㮈。是亦不净。何况身内三十六物。</strong></p><p><strong>复次推身因缘。种种不净。父母精血。不净合成。既得为身。常出不净。衣服床褥。亦臭不净。何况死处。以是当知。生死内外。都是不净(此下经本至二门初)。</strong></p><p>释：复次，心贪着色身时，就认为色身是清净的，贪爱心熄灭时才知道色身不净。如果色身确实是清净的，应当恒常清净，可是现在却不是这样，因此说色身确实是不清净的。比如狗是吃粪便的，就把粪便当作清净，从人这个角度来看粪便是非常不清净的。色身内外都无一处是清净的，如果贪着身体外面的薄皮，就把全身的皮都取下来，才知道身体皮肤就像一张树皮一样，也是不清净的。何况身体内的三十六物，更是不清净。</p><p>复次，再推论色身合成的因缘，有种种的不清净相，是由父精母血的不净物和合而成的。和合成色身之后，还常常流出种种不净物，衣服和床褥也被熏染得臭秽不清净，何况死亡的时候，更是非常肮脏。因此应当知道，生和死时，身内和身外都是不清净的。</p><p>原文：<strong>复次观亦有三品。或初习行。或已习行或久习行。若初习行当教言。作破皮想。除却不净当观赤骨人。系意观行不令外念。外念诸缘摄念令还。若已习行当教言。想却皮肉。尽观头骨不令外念。外念诸缘摄念令还。</strong></p><p>释：复次，不净观也分三品观行，一是刚刚开始修习观行的初学人，二是已经观行了一段时间的人，三是已经观行很久的久修人。如果是初次修习不净观的人，应当教导他把色身观想成剥去皮肤的样子，除去色身中的不净相，应当观行赤裸裸的骨头人像。一心谛观，不让心念向外弛散，想念其他的事情；如果心念攀缘其他的法，就要摄心把念头拉回来。如果是已经修习了一段时间的人，应当教导他，把色身观想成除去皮肉的样子，全心全意观想头骨，不让念头向外攀缘，如果向外攀缘了，就把念头拉回来。</p><p>原文：<strong>若久习行当教言。身中一寸。心却皮肉。系意五处。顶额眉间。鼻端心处。如是五处。住意观骨。不令外念。外念诸缘。摄念令还。常念观心。心出制持。</strong></p><p><strong>若心疲极。住念所缘。舍外守住。譬如猕猴。被系在柱。极乃住息。所缘如柱。念如绳锁。心喻猕猴。亦如乳母。常观婴儿。不令堕落。行者观心。亦复如是。渐渐制心。令住缘处。若心久住。是应禅法。</strong></p><p>释：如果是久修不净观的人，应当教导他说，观想身体中一寸厚处，在心里把皮肉都除去，把意念系缚在五个处所：头顶、额头、眉间、鼻端、心窝处。意念住在这五处，应该观行这五处的骨头，不让意念向外攀缘流散；如果心念向外攀缘，就要摄住心念，把念头拉回来。心念常常都在观心上，如果心跑散了，就要强制性的摄持住。</p><p>如果心攀缘久了感觉非常疲劳，就会把念头住在所观的骨头上，不再向外攀缘，心就停留止息在所意念的法上不动，舍去外缘，守住所观行之处。譬如猕猴被系缚在柱子上，挣扎得疲劳了，于是就歇息下来，不再蹦跳乱动。所观行的法比如柱子，意念比如绳索，心比喻为猕猴。也如乳母常常观照婴儿，不让其掉落。</p><p>观行的人观心也是这样，渐渐制服心念，令其住在所观行的法上。如果心能久久的安住，禅观就能修出来。</p><p>原文：<strong>若得禅定。即有三相。身体和悦。柔软轻便。白骨流光。犹如白珂。心得静住。是为观净。是时便得色界中心。是名初学禅法得色界心。心应禅法即是色界法。心得此法身在欲界。四大极大柔软快乐。色泽净洁光润和悦。谓悦乐。</strong></p><p><strong>二者向者骨观。白骨相中。光明遍照净白色。</strong></p><p><strong>三者心住一处是名净观。除肉观骨故名净观。如上三相皆自知之。他所不见。上三品者初习行先未发意。已习行三四身修。久习行百年身学。</strong></p><p>释：如果修出了禅定，就会出现三种状态：一、身体润泽，颜色和悦，柔软轻便，心中出现白骨流光相，白骨犹如白色的贝壳一样，心寂静下来了，这就是不净观。当观行成就时，心就与色界相应，入到色界中，成为色界心，色界的初禅定就出现，这就是初学禅法所得的色界心。心与色界禅定相应，就是色界法。心得色界法，而身体却仍然住在欲界的人间，四大的色身及其高大、柔软而快乐，肤色光洁鲜润，内心和雅悦乐，这是第一悦乐相，心喜相。二者，先前修习的白骨观，出现的白骨流光相中，散发出光明，遍照一切，都变成清净的白色。三者，心止于一处，没有杂念和妄念，就是净观。除去皮肉观行骨头，所以叫作净观。</p><p>以上所说的三相，修成就的人只能自己知道，自己能见到，他人见不到。以上讲的三品是：初次修习不净观者，还没有证果的人；已经开始修习，证了初果，还要在人中修习三四次才能涅槃的人；久久修习在此世百年人身中，修习之后就能涅槃之人。</p><p>观行白骨，心念要想象出来白骨那个样子，保持住那个状态，再变化那个状态，最后所观想的像总是显现在心中，永远保持不变。最后成就时，不用特意观想，像自然出现在心中，并且开眼闭眼就能见到。这就是三昧，就是禅定。降伏贪欲时，初禅定自然现前。因为欲界的心消失了，色界的心自然就出现。心在欲界法，就不能到色界法中，心在色界法中，就不能到无色界法中。有下位心，就不能有上位心。所以还是要先舍后得，不舍不得，这是修学佛法的关键处秘密处，我们一定要掌握，并且学会运用。</p></div>"
},{
    "title": "第四章　治瞋恚法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　治瞋恚法门</strong></p><p>原文：<strong>若瞋恚偏多。当学三种慈心法门。或初习行。或已习行。或久习行。若初习行者。当教言。慈及亲爱。云何亲及。愿与亲乐。行者若得种种身心快乐。寒时得衣。热时得凉。饥渴得饮食。贫贱得富贵。行极时得止息。如是种种乐。愿亲爱得。系心在慈。不令异念。异念诸缘。摄之令还。</strong></p><p>释：如果有人嗔恚心偏多一些，应当修学三种慈心法门。按照三种修习人分别教导，一是初修习的人，二是已经修习了一段时间的人，三是已经修习很久的久修行人。</p><p>如果是初次开始修习的人，应当教导他，慈悲于自己所亲所爱的人。如何慈悲于亲近的人，愿意把快乐带给亲人？修习此法者，如果得到种种身心方面的快乐，如寒冷时得到了衣服，天热时得到了清凉，饥渴时得到饮食，贫贱时得到富贵，行路疲乏时得到了歇息，如是种种的身心快乐，都愿意给与所亲爱之人，心心念念都是这种慈心，不让心有其他杂念想法。如果心念转换有杂念时，就把心收摄回来。</p><p>原文：<strong>若已习行当教言。慈及中人。云何慈及中人而与乐。行者若得种种身心快乐。愿中人得。系心在慈不令异念。异念诸缘摄之令还。</strong></p><p><strong>若久习行当教言。慈及怨憎。云何慈及彼。而与其乐。行者若得种种身心快乐。愿怨憎得。得与亲同。同得一心。心大清净。亲中怨等广及世界。无量众生皆令得乐。周遍十方靡不同等。大心清净。见十方众生。皆如自见在心目前。了了见之。受得快乐。是时即得慈心三昧。</strong></p><p>释：如果是已经修习了一段时间的人应当教导他，应该慈悲于不亲近也不厌恶的人。如何慈悲于不亲不厌之人，而给与他们快乐？行者如果得到种种身心快乐，希望能让自己不亲不怨之人也能得到。心心念念在这种慈心中，不要有其他杂念妄想。如果心念转换，有杂念，就把心收摄回来。</p><p>如果是久修习此法之人，应当教导他慈悲于冤家和憎厌之人。如何慈悲于自己憎厌之人？行者如果得到种种身心快乐，希望冤家和憎恶之人也能得到，所得到的快乐与自己亲人得到的一样多。一心希望所有人都能得到同样的快乐，心广大清净，亲人与不亲不怨之人及冤家同等对待，慈心扩大到整个世界中，无量众生都能得到快乐，此心周遍十方世界，都是同样的清净大心量。见十方众生都像自己心眼见到的一样，心里非常清楚的见到所有众生都得到快乐，清清楚楚，这时就证得了慈心三昧。</p><p>原文：<strong>问曰。亲爱中人。愿令得乐。怨憎恶人云何怜愍。复愿与乐。答曰。应与彼乐。所以者何。其人更有种种好清净法因。我今云何以一怨故而没其善。复次思惟。是人过去世时。或是我亲善。岂以今瞋。更生怨恶。我当忍彼。是我善利。又念行法。仁德含弘。慈力无量。此不可失。</strong></p><p>释：有人问说：我们能做到让亲爱的人得到快乐，如何能做到怜悯恶人，希望那些冤家和憎恶的人也能同样得到快乐？回答说：都应该给与他们快乐。为什么这样说呢？这些人中更有种种喜欢清净法的因缘，更希望清净自己而得到快乐，我现在怎么可以因为一个怨结而剥夺隐没他们的善法，不让他们得到善法的利益呢？</p><p>再次思惟，这些人过去世时，有可能是我的亲人和恩人，怎么能够因为现在的嗔恚再生起怨恨憎恶心呢？我应当忍耐他们，我因此种忍耐而获得善法上的利益。又应当知道行此善法仁义之德广大，其慈悲之力无量大，我不应该失去这个机会。</p><p>原文：<strong>复思惟言。若无怨憎。何因生忍。生忍由怨。怨则我之亲善。复次瞋报最重。众恶中上。无有过是。以瞋加物。其毒难制。虽欲烧他。实是自害。</strong></p><p><strong>复自念言。外被法服。内习忍行。是谓沙门。岂可恶声。纵此变色憋心。复次五受阴者。众苦林薮。受恶之的。苦恼恶来。何由可免。如刺刺身。苦刺无量。众怨甚多。不可得除。当自守护。着忍革屣。</strong></p><p>释：再次思惟说，如果没有冤家憎恶的人，我还能有什么因缘出生忍辱之力，忍辱力的出生是由于有怨家之缘才能出现，所以怨恼的人就是我亲善的人。复次，生嗔的果报最重，是一切众恶之首，没有超过其上者。因为嗔而加之于他上，这种毒心难于遏制。虽然这种嗔恨能烧恼于他人，其实是自己害自己。</p><p>再自我念言，出家人身外披着法服袈裟，内心修习忍辱行才是真正的沙门。怎么能够出恶言来放纵自己的嗔心，致使自己脸色大变而心生堵？再说，五受阴就是一切苦的聚集处，是忍受众恶的所在，苦恼怨恶怎么能避免呢。就像众多的针刺刺身一样，苦毒之刺有无量，众多怨害极多，是根本除不尽的，所以应当自己守护自己，时刻穿着忍辱的鞋履。来到娑婆世界就是来受苦还债消业来了，五阴身不受这种苦，也要受那种苦，反正是必须要受苦，既然避免不了，那就忍受吧。以后遇事就要这样劝慰自己，肯定管用。心平平静静的无事，禅定就容易生起来了。</p><p>原文：<strong>如佛言曰。</strong></p><p><strong>以瞋报瞋　瞋还着之　瞋恚不报　能破大军 </strong></p><p><strong>能不瞋恚　是大人法　小人瞋恚　难动如山</strong></p><p><strong>瞋为重毒　多所残害　不得害彼　自害乃灭</strong></p><p><strong>瞋为大瞑　有目无睹　瞋为尘垢　染污净心</strong></p><p><strong>如是瞋恚　当急除灭　毒蛇在室　不除害人</strong></p><p><strong>如是种种　瞋毒无量　常习慈心　除灭瞋恚</strong></p><p><strong>是为慈三昧门。</strong></p><p>释：就像佛所说的：用嗔恚的方法报复嗔恚之行，嗔恚还是粘着自心。有嗔恨不报复，能破除烦恼大军。能忍辱不生嗔，是心量大的菩萨大人之行持。小心量的人喜好嗔恚，其嗔恚心像山一样难以动摇。嗔恨是巨毒，伤害的人多而广。如果不再去伤害他人，也就不再能伤害到自己了。心有嗔恚是大黑暗，就像有眼睛却不能见色一样。嗔恚是灰尘污垢，染污自己的清净心。像这样的嗔恚心行，应当快快的灭除。比如毒蛇在房间里，如果不清除出去，就要害人了。像这样种种的嗔毒有无量之多。常常修习慈心三昧，以除灭嗔恚毒。以上为慈心三昧法门。</p></div>"
},{
    "title": "第五章　治愚痴法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　治愚痴法门</strong></p><p>原文：<strong>若愚痴偏多。当学三种思惟法门。或初习行。或已习行。或久习行。若初习行当教言。生缘老死。无明缘行。如是思惟。不令外念。外念诸缘。摄之令还。</strong></p><p>释：如果愚痴偏多，应当修习三种思惟法门，愚痴偏多的人中有初始修习的人，有已经修习了一段时间的人，还有已经修习很久的人。如果是初始修习的人，应当教导他，生缘老死、无明缘行等十二因缘法门，引导他思惟，让他认识到生命的过患能产生老死之苦，无明的过患能引发一切业行，而流转生死。缘于这样的思惟，不让心念向外攀缘，如果心念移转散乱，就摄持牵制回来。</p><p>无明缘行，是因为意根有无明，不知法界实相，不肯安住于寂静的真如当中，起心要向外贪求，阿赖耶识就随顺意根的无明产生出意根的心行，意根内心就产生躁动，想要执取三界法以及五阴身心，想要有身口意行。</p><p>生缘老死忧悲苦恼，因为五阴身是生灭幻化性的，出生以后，阿赖耶识执持，不断输出四大种子，让色身不断生长，慢慢变老，最后死去。在这其中，会有无量的生死苦，忧悲苦恼无尽。这些生老病死苦，也都是阿赖耶识依缘出生的，根源还是意根的执取性，以及意根的贪爱，灭除意根的贪爱才能灭除一切苦受。</p><p>原文：<strong>若已习行当教言。行缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。如是思惟。不令外念。外念诸缘。摄之令还。</strong></p><p>释：如果是修习了一段时间的人，应当教导他修习十二因缘中的行缘识识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有。按照次序一一思惟，不让心念外缘流散，如果心念散乱，就收摄心念，专一思惟。</p><p>行缘识，是由于意根这种躁动不安和向外求取的心行，阿赖耶识就满足意根的思心所，产生六识，让意根利用六识来达成自己的意愿，造作一切身口意行。</p><p>识缘名色，由于意根的心行不断，六识的身口意行不断，阿赖耶识就会自动收藏业种，这样就种下了未来世受生的种子。命终时意根心行不断，求取五阴身，阿赖耶识就会出生中阴身，在中阴身里，意根不满足暂时的色身，还要有下一世的五阴身，当父母缘具足时，阿赖耶识随着意根投胎，名色就产生了。</p><p>名色缘六入，名色受精卵形成以后，阿赖耶识随顺意根对五阴身之想，根据业种和业缘不断变造色身，在色身上生长出眼根、耳根、鼻根、舌根，身根也不断的增长和完善，五根就被阿赖耶识创造出来了，加之意根，六入具足。</p><p>六入缘触，六入的缘具足以后，因为意根想要见六尘，阿赖耶识就通过五根传递外六尘到五胜义根中，六根就会接触到六尘，这个触也是阿赖耶识产生的。</p><p>触缘受，六根能够触六尘时，意根想了别六尘，阿赖耶识就会出生耳识、鼻识、舌识、身识和意识共同了别六尘境（在母胎中，还不能出生眼识见色）。于是六识就对六尘有了觉受，苦、乐、不苦不乐三种受都有，意根在其中也有自己的受，这些受也是阿赖耶识出生的。</p><p>受缘爱，因为有六识的三种受，意根依六识的受而有自己的受，自己接触尘境时也有受，或者是贪爱的乐受，或者是厌弃的苦受，或者是舍受。因为这些受，就会产生贪爱，尤其是意根的贪爱，阿赖耶识依之能产生后续的一切身口意行，产生更多的法。六个识的受以及意根的受，都是阿赖耶识输出识种子产生的，六识的爱也是阿赖耶识输出识种子产生的，尤其是意根的贪爱，是阿赖耶识缘于意根的受而出生的。</p><p>爱缘取，因为意根有贪爱，就会产生执取性，对三界六尘万法想要占有和执取。这种执取性也是阿赖耶识输出识种子产生的，离开阿赖耶识就没有意根，何况还有意根的受、爱和执取性。</p><p>取缘有，由于意根对三界万法的执取，阿赖耶识随顺意根心行而不断的产生三界世间一切法。有缘生，三界世间法产生以后，五阴身的生存环境就具足了，这样阿赖耶识就会出生五阴身。</p><p>原文：<strong>若久习行当教言。无明缘行。行缘识。识缘名色。名色缘六入。六入缘触。触缘受。受缘爱。爱缘取。取缘有。有缘生。生缘老死。如是思惟不令外念。外念诸缘。摄之令还。</strong></p><p><strong>问曰。一切智人是有明。一切愚人是无明。是中云何无明。答曰。无明名一切不知。此中无明能造后世有。有者无。无者有。弃诸善。取诸恶。破实相。着虚妄。</strong></p><p>释：如果是久修习的人，应当教导他，无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死。十二个生死环节都要仔细思惟，不让心念流散外放，如果心念散乱了攀缘外境，就牵制回来。</p><p>有人问说，一切智者都有明，一切愚人都有无明，什么是无明？回答说：无明就是一切事理不知；无明能引起后世的三界世间出生，后世的生命不断绝；无明就是应该有的智慧没有，不应该有的无明烦恼却存在，弃舍一切善法而取诸恶法；排斥实相愚于实相，着于虚妄相。</p><p>原文：<strong>如无明相品中说：</strong></p><p><strong>不明白益法    不知道德业</strong></p><p><strong>而作结使因    如火钻燧生</strong></p><p><strong>恶法而心着    远弃于善法</strong></p><p><strong>夺众生明贼    去来明亦劫</strong></p><p><strong>常乐我净想    计于五阴中</strong></p><p><strong>苦习尽道法    亦复不能知</strong></p><p><strong>种种恼险道    盲人入中行</strong></p><p><strong>烦恼故业集    业故苦流回</strong></p><p><strong>不应取而取    应取而反弃</strong></p><p><strong>驰闇逐非道    蹴株而躄地</strong></p><p><strong>有目而无慧    其喻亦如是</strong></p><p><strong>是因缘灭故    智明如日出</strong></p><p>释：如无明相品里说：不明白清净增益的法，也不知道有道德的业行是什么，因此就有了无明结缚，如用火石取火火即生。心着恶法，就会远远的弃去善法。这是夺取众生心明的贼人，无明一来，明就被劫去了。认为五阴就是常乐我净的，恒常存在，是清净可爱乐的，是真实的我，这样颠倒作想，就是无明结缚，即使是苦集灭道四圣谛法也不知道。就像盲人入于种种险恶道中行路一样，因为烦恼故，业行不断的积集起来，因为烦恼业故，生死苦轮转不断。不应该执取的而执取，应该取着的而弃舍。在黑暗中行驰在邪路上，遇到矮树根就摔倒在地。有目而无智慧，就是用来比喻无明的，以修习因缘法无明灭后，智慧的光明就会像太阳一样出现了。</p><p>原文：<strong>如是略说。无明乃至老死亦如是。问曰。佛法中因缘甚深。云何痴多人能观因缘。答曰。二种痴人。一如牛羊。二种种邪见。痴惑闇蔽邪见痴人。佛为此说当观因缘以习三昧。</strong></p><p>释：如是简略的说，无明一直到老死也是这样思惟。有人问：佛法中因缘法甚深，愚痴多的人如何能观察因缘法？答曰：痴人有两种，一种是如牛羊般的愚痴无知，第二种是指有种种邪见的人，愚痴迷惑颠倒，内心黯闭不明。有邪见的愚痴人，佛就为这些人说应当思惟观察十二因缘法来修习三昧。</p><p>佛讲的坐禅，让我们先从思想知见上下功夫，把心清扫一下，心地清明了，禅定自然出现。所谓功夫在诗外，禅定不在腿上，那些不修心，一味的靠盘腿死坐的人，很难修出禅定，即使能修出来，也是死定，如入黑暗，无一丝光明。</p><p>总结：修行无论修什么法门，都是修心。心能通一切法，心能达一切法，心能明一切法。心明以后，修行结束，从此无学无为。</p></div>"
},{
    "title": "第六章　治思觉法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　第四治思觉法门</strong></p><p>原文：<strong>若思觉偏多。当习阿那般那三昧法门。有三种学人。或初习行。或已习行。或久习行。若初习行当教言。一心念数。入息出息。若长若短。数一至十。</strong></p><p>释：如果一个人内心思虑念头偏多，应当修习阿那般那三昧法门。修习此法的人有三种，第一种是初始才开始修习的人，第二种是已经修习一段时间的人，第三种是久修之人。如果是才开始修习的人，应当教导他，一心一意念数呼吸，入息和出息，长息短息都要数，从一数到十为止。入息时数一单数，出息时数二双数，不管呼吸是长是短，都要从一数到十，然后再从一开始数。这样周而复始不断循环往复，心就能慢慢静下来，不再有过多的思虑了，身体也会健康起来。这是六妙门的第一妙门：数。</p><p>原文：<strong>若已习行当教言。数一至十。随息入出。念与息俱。止心一处。若久习行当教言。数随止观。转观清净。</strong></p><p>释：如果是已经修习一段时间的人，应当教导他，数呼吸时，从一数到十，心念随着气息入和出，与气息在一起不分离，然后心念看着出入息，随着出入息，出息知出息，入息知入息，把心止在气息上，不缘他法，专一其心，得定得止。心念不要在数数上，要安住在出入息上，随出入息自由出入，心念就能止住了。这是第二妙门：随。</p><p>如果是久修之人，应当教导他，数数的念头随着出入息，止在出入息以后，应当起观照作用，可以观行，观照自心，这样念头就能随着止观而逐渐清净下来。这是第三四五六妙门：止、观、还、净。</p><p>原文：<strong>阿那般那三昧。六种门十六分。云何为数。一心念入息。入息至竟数一。出息至竟数二。若未竟而数为非数。若数二至九而误更从一数起。譬如算人一一为二。二二为四。三三为九。</strong></p><p>释：阿那般那三昧法门，有六种妙入门十六品。如何数息？就是一心念着入息，入息完了，就数一；一心念着出息，出息完了就数二。如果入息和出息都没有完就数数，这个不算，应该从头再开始数。如果数到二或者数到九，数错了，再从头数起。譬如数人数，一一为二，二二为四，三三为九。</p><p>原文：<strong>问曰。何以故数。答曰。无常观易得故。亦断诸思觉故。得一心故。身心生灭无常。相似相续难见。入息出息生灭无常。易知易见故。</strong></p><p>释：有人问：为什么要数息？答：数息法容易观察无常，无常的观念容易成就，也能容易断除思虑觉观，心容易清净，能专心一意，修出禅定。因为平时身心的生灭无常现象，相似于真实，又连续不断的运行，定力不足时，很难见到这种身心生灭无常的真实相貌。而入息和出息这种生灭的无常现象，容易了知和见到。</p><p>原文：<strong>复次心系在数。断诸思诸觉。思觉者。欲思觉。恚思觉。恼思觉。亲里思觉。国土思觉。不死思觉。欲求净心入正道者。先当除却三种粗思觉。次除三种细思觉。除六觉已。当得一切清净法。譬如采金人先除粗石砂。然后除细石砂。次第得细金砂。</strong></p><p>释：再次说，把识心牢牢的系在数息上，能断除一切的思想、思虑和觉观。思想觉观包括贪欲思想觉观、嗔恚思想觉观、忧恼思想觉观、家亲眷属的思想觉观、国土家园的思想觉观、希望永远不死的思想觉观。</p><p>如果想要清净自心入佛正道的人，应当先除去三种粗的思想觉观，然后再除去细的思想觉观。六种思想觉观除去以后，就能证得一切清净之法。譬如采金之人，先要除去粗大的沙石，然后再除去细的沙石，这样次第就能得到细金沙了。</p><p>原文：<strong>问曰。云何为粗病。云何为细病。答曰。欲瞋恼觉是三名粗病。亲里国土及不死觉是三名细病。除此觉已。得一切清净法。问曰。未得道者结使未断。六思觉强从心生乱。云何能除。答曰。心厌世间。正观能遮而未能拔。后得无漏道。能拔结使根本。</strong></p><p>释：有人问：什么是粗病？什么是细病？答曰：贪欲觉观、嗔恨、恼害觉观三个是粗重的觉观，家亲眷属觉观、国土家园觉观、希望长生不死觉观是三个细觉观。除去这些觉观，就能得到一切清净法。</p><p>又问：没有得道的人，烦恼结使没有断除，六种思想觉观很强大，都是从心里生出来的乱想，怎么能除去呢？答曰：当修习到心厌世间的时候，能正确如理观察到这些思想觉观，就能遮障自心产生这些觉观，但是这不彻底，能拔除这些觉观思维，只是压服降伏而已。随后修行证得无漏道果时，就能从根本上拔除这些烦恼结使。</p><p>原文：<strong>何谓正观</strong></p><p><strong>见多欲人求欲苦    得之守护是亦苦</strong></p><p><strong>失之忧恼亦大苦    心得欲时无满苦</strong></p><p><strong>欲无常空忧恼因    众共有此当觉弃</strong></p><p><strong>譬如毒蛇入人室    不急除之害必至</strong></p><p><strong>不定不实不贵重    种种欲求颠倒乐</strong></p><p><strong>如六神通阿罗汉    教诲欲觉弟子言</strong></p><p><strong>汝不破戒戒清净    不共女人同室宿</strong></p><p><strong>欲结毒蛇满心室    缠绵爱喜不相离</strong></p><p><strong>既知身戒不可毁    汝心常共欲火宿</strong></p><p><strong>汝是出家求道人    何缘纵心乃如是</strong></p><p><strong>父母生养长育汝    宗亲恩爱共成就</strong></p><p><strong>咸皆涕泣恋惜汝    汝能舍离不顾念</strong></p><p><strong>而心常在欲觉中    共欲嬉戏无厌心</strong></p><p><strong>常乐欲火共一处    欢喜爱乐不暂离</strong></p><p><strong>如是种种呵欲觉。如是种种正观除欲觉。</strong></p><p>释：什么是正观？看见贪欲多的人追求各种贪欲很是辛苦，即使得到了所求，守护所得到的也是很辛苦，等到失去时内心生起忧恼仍然是大苦，心里得到所贪爱的却无满足同样是苦。欲望是无常和苦的因，也是忧恼的因缘，众生都有这些烦恼苦处，应当觉悟贪欲然后舍弃掉。譬如毒蛇入到人居住的舍宅里，如果不赶快除掉必将有危害。种种贪欲颠倒乐，没有定相，也不真实，轻薄不贵重。</p><p>比如具足六神通的阿罗汉，教悔有欲觉的弟子说：如果你不破戒，不与女人共宿，戒行就清净，缠绵贪爱不相舍离，内心里充满了贪欲结缚的毒蛇。既然知道身戒不能毁犯，为什么心里还常常怀着欲火不熄灭。你是出家追求佛道之人，为什么这样的放纵自己？父母生你养你，宗亲眷属呵护送你出家修道，所有亲人都涕泣怜惜你，你都能舍离他们而不挂念，可是心里却常怀贪欲，放纵贪欲心无厌足，常常喜欢处于欲火中，欢喜爱乐一时也不愿舍离。</p><p>应该像这样用种种言词呵责欲觉，如是用种种正观来除去欲觉心。</p><p>原文：<strong>问曰。云何灭瞋恚觉。答曰。</strong></p><p><strong>从胎中来生常苦    是中众生莫瞋恼</strong></p><p><strong>若念瞋恼慈悲灭    慈悲瞋恼不相比</strong></p><p><strong>汝念慈悲瞋恼灭    譬如明闇不同处</strong></p><p><strong>若持净戒念瞋恚    是人自毁破法利</strong></p><p><strong>譬如诸象入水浴    复以泥土涂坌身</strong></p><p><strong>一切常有老病死    种种鞭笞百千苦</strong></p><p><strong>云何善人念众生    而复加益以瞋恼</strong></p><p><strong>若起瞋恚欲害彼    未及前人先自烧</strong></p><p><strong>是故常念行慈悲    瞋恼恶念内不生</strong></p><p><strong>若人常念行善法    是心常习佛所念</strong></p><p><strong>是故不应念不善    常念善法欢乐心</strong></p><p><strong>今世得乐后亦然    得道常乐是涅槃</strong></p><p><strong>若心积聚不善觉    自失己利并害他</strong></p><p><strong>是谓不善彼我失    他有净心亦复没</strong></p><p><strong>譬如阿兰若道人    举手哭言贼劫我</strong></p><p>释：问：云何灭除嗔恚觉？答曰：从胎而生心里常常怀苦，因此说众生不要常嗔恼。如果修道人心有嗔恼，慈悲心就没有了，慈悲和嗔恼不能同时存在，二者没有可比性。如果你心念慈悲，嗔恼就灭去。譬如明和暗不能同时相处。如果想守持清净的戒律，却有嗔恚的心念，此人就会毁破戒律，自失佛法的利益。譬如大象入到河里洗澡，再把泥土涂满身，实是不智之举。所有众生都有生老病死苦，种种苦恼像用皮鞭抽打一样痛苦不堪。为什么一个善人怜念众生，却要给众生增加苦恼？如果生起嗔恚心想要损害对方，还没等加害到对方，自己就先被嗔火烧到了。</p><p>因此应该常常要有慈悲的心行，内心里不要生起嗔恼和恶念。如果有人常常有行善法的念，这样的心就是在修习着佛念。因此不该有不善之念。常常念着善法，心就是快乐的，今世得乐后世还是快乐的，证得常乐的道果就是涅槃。如果心里还集聚着不善的觉观，不但能失去自己的利益，也能恼害他人，因此说有不善的心念，彼我都有损害，他人的清净心也没有了，譬如住在清净阿兰若道场的人，举手哭喊着说贼人打劫我了。</p><p>原文：<strong>有人问言。谁劫汝。答言。财贼我不畏。</strong></p><p><strong>我不聚财求世利。谁有财贼能侵我。</strong></p><p><strong>我集善根诸法宝。觉观贼来破我利。</strong></p><p><strong>财贼可避多藏处。劫善贼来无处避。</strong></p><p><strong>如是种种呵瞋恚。如是种种正观除瞋恚觉。</strong></p><p>释：有人问：谁打劫了你？答言：劫财之贼我不害怕，因为我不聚集财产求世间的利益，哪个劫财之贼能侵犯我？因为我在积集善根佛法的宝藏，觉观贼来就能让我失去佛法上的利益。劫财贼人容易避开，藏匿之处很多，劫善法的贼人来就没法避开了。像这样用种种言词呵责嗔恚，如是用种种的正观来除去嗔恚觉观。</p><p>原文：<strong>问曰。云何除恼觉。</strong></p><p><strong>答曰众生百千种    诸病更互恒来恼</strong></p><p><strong>死贼捕伺常欲杀    无量众苦自沉没</strong></p><p><strong>云何善人复加恼    谗谤谋害无慈仁</strong></p><p><strong>未及伤彼被殃身    俗人起恼是可恕</strong></p><p><strong>此事世法恶业因    亦不自言我修善</strong></p><p><strong>求清净道出家人    而生瞋恚怀嫉心</strong></p><p><strong>清冷云中放毒火    当知此恶罪极深</strong></p><p>释：云何除去恼害觉观？答曰：众生有百千种之多的疾病，常常交替着来恼害，死亡之贼时常来追捕，想要杀害五阴身，众生常常沉没在无量多的苦痛中。既然是善人为什么还要再来加害众生，谗言毁谤谋害众生，没有仁慈心而去伤人的人还没有伤害到他人，自己就先遭殃了。世俗人起心恼害他人还可以宽恕，因为这就是世俗法中造恶的起因，世俗人也从来不说自己要修善做善人。可是想求得心清净的出家人，心里怀着嫉妒心而生起嗔恚，就像清冷的白云中施放毒烈的火焰，当知这种罪恶是极重极大的。</p><p>原文：</p><p><strong>阿兰若人兴嫉妒    有阿罗汉他心智</strong></p><p><strong>教诫苦责汝何愚    嫉妒自破功德本</strong></p><p><strong>若求供养当自集    诸功德本庄严身</strong></p><p><strong>若不持戒禅多闻    虚假染衣坏法身</strong></p><p><strong>实是乞儿弊恶人    云何求供养利身</strong></p><p><strong>饥渴寒热百千苦    众生常困此诸恼</strong></p><p><strong>身心苦厄无穷尽    云何善人加诸恼</strong></p><p><strong>譬如病疮以针刺    亦如狱囚考未决</strong></p><p><strong>苦厄缠身众恼集    云何慈悲更令剧</strong></p><p><strong>如是种种呵恼觉。如是种种正观除恼觉。</strong></p><p>释：一个住在寂静道场中的人心生嫉妒，有个阿罗汉有他心智通，教导劝告他，苦苦的呵责他说，你为什么这样的愚痴，嫉妒心能破坏你所修得的功德本钱，如果想要求得供养，你自己就要去努力积功累德，用诸多的功德来庄严自己；如果不修持戒行，不修习禅定和广学多闻，就白白的穿着出家服而破坏法身慧命。这样做表明自己实际上就是一个乞讨的弊恶人，为什么还要贪求供养来养自己的色身？</p><p>饥渴冷热的百千种苦恼，众生常常被困在这些烦恼病痛中，每个众生身心所受的苦厄烦恼无穷无尽，为什么作为一个善人还要来给众生增加诸多的苦恼？譬如一个人生了病疮，然后再拿针刺来刺伤他，也如监狱的囚犯，受着严刑拷问，生死不定，众多的苦厄缠绕色身，众多的苦恼也集于一身，云何有慈悲心的人更要来加重他的苦恼？</p><p>就像这样用种种的言词来呵责自己的恼害觉观，如是用种种的正观来除去恼害觉观。这就是修心法门，要学会观察自己的心，学会呵责自心，学会教育自心，学会引导自心向正，心地就会越来越清净，越来越有智慧，道业进步就快了。</p><p>原文：<strong>问曰。云何除亲里觉。答曰。应如是念。世界生死中自业缘牵。何者是亲。何者非亲。但以愚痴故。横生着心。计为我亲。过去世非亲为亲。未来世非亲为亲。今世是亲。过去非亲。譬如鸟栖暮集一树。晨飞各随缘去。家属亲里亦复如是。生世界中。各各自异心。缘会故亲。缘散故疏。无有定实。因缘果报。共相亲近。</strong></p><p>释：问：如何除去想念亲眷的觉观？答：应该这样想，在娑婆世界生生死死中，都是自己的业缘所牵引的结果，谁是亲人谁为非亲，都是因为愚痴的缘故心里强执著为我的亲属。过去世时非为亲属，今世成为了亲属，未来世不是亲属，今世是亲属，今世是亲属过去世不是亲属。譬如飞鸟晚上聚集在一棵树上，早晨却各自随缘飞去，家亲眷属也是这样，生在一个世界中一个人一个心思，统一不到一起，因缘聚会时是亲属，因缘散去时就疏远了，并没有固定的真实的因缘果报，能让所谓的亲人互相亲近。</p><p>原文：<strong>譬如干沙。缘手团握。缘捉故合。缘放故散。父母养子。老当得报。子蒙怀抱。养育故应报。若顺其意则亲。若逆其意是贼。有亲不能益而反害。有非亲无损而大益。人以因缘故而生爱。爱因缘故而更断。譬如画师作妇女像。还自爱着。此亦如是。自生染着。染著于外。</strong></p><p>释：譬如干燥的土沙用手握成团，由于手握的因缘和合在一起，手握的缘消失沙团就散去。父母由于抚养子女的缘故，老时应当得到子女的回报，子女受到父母恩养的缘故，就应该报答父母之恩。如果能顺从对方的意志，就是亲人，如果违背了对方的意志就是贼人。有的亲属不但没有益处，反而还有害处，有的人不是亲属不但没有损害，反而有大益处。人都是因为某些因缘而产生爱意，由于爱是因缘所生的缘故，缘散就会断除。譬如画师画出了一个女人像，之后自己就对女人像产生贪爱，家亲眷属也是这样，都是自己生起的染爱心而贪染着外缘。</p><p>原文：<strong>过去世中汝有亲里。今世于汝。复何所作。汝亦不能益过去亲。过去亲不益汝。两不相益。空念之为是亲非亲。世界中不定无边。如阿罗汉教新出家恋亲弟子言。如恶人吐食。更欲还啖。汝亦如是。汝已得出家。何以还欲爱着。剃发染衣是解脱相。汝着亲里不得解脱。还为爱所系。三界无常。流转不定。若亲非亲。虽今亲里。久久则灭。如是十方众生回转。亲里无定。是非我亲。</strong></p><p>释：过去世中你也有亲属，今世对你还能作什么，你也不能对过去世的亲属有什么益处，过去世的亲属也不能对你有什么益处。互相都不能有什么益处，心里空空念着是亲人不是亲人，空无所得，世界里不定因素有无量之多。</p><p>比如阿罗汉教导新出家的仍然还怀恋亲人的弟子说，如胃里不舒服的人吐出饮食，还想再吃回去，你也是这样。你现在已经出家了，为什么还要贪爱亲人？剔除须发穿着染衣就是解脱相，你贪着亲人不得解脱，还被贪爱所系缚。三界世间都是无常法，生死流转不定，是亲非亲都是不定的，虽然今世成为亲属，长时间以后就不是了。因此说十方众生生死轮回，亲人不定，那就不是亲属。</p><p>原文：<strong>人欲死时。无心无识。直视不转。闭气命绝。如堕闇坑。是时亲里。家属安在。若初生时先世非亲。今强和合作亲。若当死时复非亲。如是思惟。不当着亲。如人儿死。一时三处父母。俱时啼哭。诳天上父母妻子。人中亦为诳。龙中父母亦为诳。如是种种正观。除亲里觉。</strong></p><p>释：人要死时，没有了心识，目光直视不动，气停命绝，如堕落在黑暗的大坑，这时候你的家亲眷属在哪里？如果刚刚出生的时候，前世都不是亲属，今世勉强聚在一起成为了亲属，当死亡的时候又不是亲属了。这样思惟就应当不再贪着亲人了。比如一个人在小时候就死了，三个地方的父母同时都哭泣，天上的父母妻子被欺诳，人中的父母妻子被欺诳，龙中的父母妻子也被欺诳了。像这样用种种正确的观行就能除去亲属觉观。</p><p>原文：<strong>问曰。云何除国土觉。答曰。行者若念。是国土丰乐安隐。多诸好人。恒为国土觉绳所牵。将去罪处。觉心如是。若有智人不应念着。何以故。国土种种过罪。所烧时节转故。亦有饥饿。身疲极故。一切国土无常安者。</strong></p><p>释：问：如何除去国土家园觉观？答曰：修行人如果心里念着，这个国土富饶安稳快乐，有诸多好人善人，那就常常被国土觉观之绳索所牵引，绑缚到罪恶之处。觉观心就是这样系缚于人。如果是有智慧的人不应该念着国土，为什么不应该如此念着国土？因为国土有种种的过罪，如被烧毁或者是因缘时劫变了，国土就改变了，也有饥荒之时，民众忍饥挨饿，身体疲弱无力等等。一切国土世间没有恒常安乐之者。</p><p>原文：<strong>复次老病死苦。无国不有。从是间身苦。去得彼处身苦。一切国土去无不苦。假有国土安隐丰乐。而有结恼。心生苦患。是非好国土。能除杂恶国土。能薄结使。令心不恼。是谓好国土。</strong></p><p><strong>一切众生有二种苦。身苦心苦。常有苦恼。无有国土无此二恼。复次。有国土大寒。有国土大热。有国土饥饿。有国土多病。有国土多贼。有国土王法不理。如是种种国土之恶。心不应着。如是正观。除国土觉。</strong></p><p>释：再者说，生老病死苦没有一个国土没有，从一个世间除去了身苦，到另一个世间又有了身苦，一切国土没有无苦的。假使有一个安稳快乐的国土，可是自己内心有烦恼结使，仍然要心生苦患，因此这个国土也不是好国土。能除去杂恶业行的国土，能使众生淡薄贪嗔痴烦恼结使，让众生心里没有恼害的国土，才是好国土。</p><p>一切众生有两种苦，身苦和心苦，因此常有苦恼，没有一个国土中众生没有这两种苦恼的。再次说有的国土中有大热天气，有的国土有大寒天气，有的国土有饥饿的现象，有的国土有多灾病的现象，有的国土有贼盗多的现象，有的国土有国法不合理的现象，如是有种种国土的过患恶患，因此心不应该念着国土。这样正确的思惟观察国土，就能除去国土家园的觉观。</p><p>原文：<strong>问曰。云何除不死觉。答曰。应教行者。若好家生。若种族子才技力势胜人。一切莫念。何以故。一切死时。不观老少贵贱才技力势。是身是一切忧恼诸因缘。因自见少多寿。若得安隐。是为痴人。何以故。是谓忧恼因依是四大。四大造色如四毒蛇。共不相应。谁得安隐者。出息期入是不可信。</strong></p><p>释：如何除去希望永远不死的觉观？答曰：应当教导修行者，如果出生在一个好的家庭，如果这个家庭种族后代的才能、技术、势力都超胜于人，这一切心里也不要念着。为什么不能念着？因为一切人死亡的时候，不管你是老是少，是贫富是贵贱，有才能有技艺有势力，一律都要死亡，这个五阴身就是一切忧悲苦恼的因缘聚集处，因此如果自己觉得能再长寿一些才能安稳快乐，那就是一个愚痴人。为什么这样说？因为忧悲苦恼的因缘是依着四大而有，四大造就了色身，就像四个毒蛇在一起，互不调和，谁能得到安稳？这口气出去了，还期望它再入进来，这是靠不住的。</p><p>原文：<strong>复次人睡时。欲期必觉。是事难信。受胎至老。死事恒来。求死时节。言常不死。云何可信。譬如杀贼。拔刀注箭。常求杀人。无怜愍心。人生世间。死力最大。一切无胜。死力强者。若过去世第一妙人。无能脱此死者。现在亦无大智人。能胜死者。亦非软语求。非巧言诳。可得避脱。亦非持戒精进。能却此死。以是故当知。人常危脆。不可怙恃。莫信计常。我寿久活。是诸死贼。常将人去。不付老竟。然后当杀。</strong></p><p>释：再者说，人在睡着以后，想要自己一定能醒过来，这事也难预料。投胎出生到老，死亡这些烦恼事也不断出现，该死的时候，常常希望不死，这怎么可信？譬如杀人的贼人拔刀相向、剑拔弩张，常常要杀人，没有怜悯之心，死亡之贼也是这样。人活在世间，死亡的力量是最大的，所有一切没有能比死亡的力量更强大的。就像过去世时最胜妙的人也没有逃脱过死亡，即使现在也没有大智慧人能战胜死亡的。因为死亡不是你软言巧语能求到的，也不是能用巧舌欺诳能逃避得了的，也不是通过持戒精进修行就能抵挡得了的。因此应当知道，人是非常危脆的，不可依估，不要信赖期望自己能够长寿能够活得很久，死亡之贼常常把人抓去，不等年老就把自己杀死了。</p><p>原文：<strong>如阿罗汉教诸觉所恼弟子言。汝何以不知厌世入道。何以作此觉。有人未生便死。有生时死者。有乳餔时。有断乳时。有小儿时。有盛壮时。有老时。一切时中间死法界。譬如树华。华时便堕。有果时堕。有未熟时堕。是故当知。勤力精进求安隐道。</strong></p><p>释：如阿罗汉教导被觉观贼所恼害的弟子说，你为什么不知道厌离世间赶快入道？为什么总是有希望自己不死长生不老的觉观？有的人还没有生出来就死了，有的人刚刚出生就死了，有的人还在乳哺时就死了，有的人在刚断奶时就死了，有的人在少儿时就死了，有的人在盛壮之年就死了，有的人到老时才死。一切时中，死亡时节不定，譬如树上的花，有在开花时掉下来，有在结果时掉下来，有果未熟时掉下来，因此应当精勤的精进，追求真正的安稳之道。</p><p>原文：<strong>大力贼共住不可信。此贼如虎巧覆藏身。如是死贼常求杀人。世界所有。空如水泡。云何当言。待时入道。阿谁能证言汝。必老可得行道。譬如险岸大树上有大风。下有大水崩其根土。谁当信此树得久住者。人命亦如是。少时不可信。父如谷子。母如好田。先世因缘。罪福如雨泽。众生如谷。生死如收刈。</strong></p><p>释：与死亡的大力贼共住，是不可信赖的，这个贼人如虎一样巧妙的隐藏着自己的色身，如是死贼常常要寻觅着杀人。世界所有都是空如水泡，云何而说到一定时候再修道？谁能保证说你一定能活到老，那时才能修道？譬如一个危险的悬崖上有一棵大树，上边有大风吹拂，下边有大水冲崩树根之土，谁能相信这棵树能长久住世？人命也是这样，没有一点可信之时。父亲如谷子，母亲如好田地，前世的罪福业因缘如雨露润泽，才有人命。众生如谷麦，生死如收成。</p><p>原文：<strong>种种诸天子人王智德。如天王佐天。斗破诸阿须伦军。种种受乐。极高大明。还没在黑闇。以是故莫信命活言。我今日当作此。明后当作是。如是正观种种。除不死觉。如是先除粗思觉。却后除细思觉。心清净生得正道。一切结使尽。从是得安隐处。是谓出家果。心得自在。</strong></p><p>释：种种诸天天子、人王的智慧德行，如忉利天王率领天子战败阿修罗军队一样，种种享乐，显示的智慧极高又英明，可是还是照样沉没在黑暗深坑中。因此不要相信命还健在的人说，我今日要做这件事，明天要做那件事。</p><p>像这样种种正确的思惟观察，就能除去想要不死的觉观。如是先除去粗的觉观，再除去细的觉观，心清净以后，才能证得道果，一切烦恼结使都能消灭。从此就到了安稳之处，这就是出家的果德，心得大自在。</p><p>原文：<strong>三业第一清净。不复受胎。读种种经多闻。是时得报果。如是得时。不空破魔王军。便得第一。勇猛名称。世界中烦恼将去。是不名健。能破烦恼贼。灭三毒火。凉乐清净。涅槃林中。安隐高枕。种种禅定。根力七觉。清风四起。顾念众生。没三毒海。德妙力如是。乃名为健。如是等散心。当念阿那般那。学六种法。断诸思觉。以是故念数息。</strong></p><p>释：身口意三种业行都达到最清净，就不用再投胎受生了，因为对三界法都不贪爱，没有了执著，三界的业就消除，没有业就不用受生投胎。读诵种种经文，广学多闻，修到一定程度时就能得到修行上的业报果。得到果报时，断除贪欲嗔恚，就能破除魔王军，降伏魔王，获得第一勇猛的名称。生活在世界里，被烦恼所系缚，不叫作有力的健将，能破除烦恼贼，灭除贪嗔痴的三毒火，心得清凉寂静，在涅槃林中安稳而住，高枕无忧，具足种种禅定，五根、五力、七觉分具足，还能顾念怜悯众生没在三毒海中，威德妙力到如此程度，才名为勇键。</p><p>如果有种种散乱心，应当念阿那般那，修学六种妙法断除诸多觉观，所以说应念数息法。</p><p>原文：<strong>问曰。若余不净念佛四等观中。亦得断思觉。何以故独数息。答曰。余观法宽难失故。数息法急易转故。譬如放牛。以牛难失故。守之少事。如放猕猴易失故。守之多事。此亦如是。数息心数不得少时他念。少时他念则失数。以是故初断思觉应数息。</strong></p><p>释：问：如果用其它方法如不净观、念佛等四种观想方法也能断除思觉，为什么只学数息法？答曰：其它的观行方法缓慢，难于去除思惑觉观，数息法快速，觉观容易转换过来。譬如放牛，因为牛不乱跑，很容易守护，不用费力；如果是放牧猕猴，猕猴容易到处乱跑，所以就要多用心照看。数息法也是这样，数息时，心里念数一刹那也不能念着其他事，否则就忘记数目了，就要多用心专心数息，没有杂念，因此最初断除思觉应该用数息法。</p><p>原文：<strong>已得数法。当行随法。断诸思觉。入息至竟。当随莫数一。出息至竟。当随莫数二。譬如负债人。债主随逐。初不舍离。如是思惟。是入息是还。出息更有异。出息是还。入息更有异。是时知入息异。出息异。何以故。出息暖入息冷。</strong></p><p>释：数息数到心清净下来，数目不乱以后，应当修习随息法，以断除觉观思觉。随息法是，入息结束时就跟随着息运行，不要再数一了，出息结束时就跟随着息的运行，不要再数二了。譬如欠债的人，债主跟随在后一刻也不离开，出入息比如欠债的人，心念比如债主。</p><p>随着入息和出息，思惟判断现在是入息还是出息，出入息有什么差别，现在是出息还是入息，还有什么差别。这时就应该知道入息不同于出息，出息不同于入息。为什么知道二者不一致？因为出息时气暖，入息时气冷。</p><p>原文：<strong>问曰。入出息是一息。何以故。出息还更入故。譬如含水。水暖吐水水冷。冷者还暖。暖者还冷故。答曰。不尔。内心动故有息出。出已即灭。鼻口引外。则有息入。入故息灭。亦无将出。亦无将入。复次少壮老人。少者入息长。壮者入出息等。老者出息长。是故非一息。</strong></p><p>释：有人问说：一入息一出息合起来是一次呼吸，为什么这样说？因为出息以后还要入息故，出息以后并没有结束。譬如口含着水水就暖，口吐出水水就冷，冷水还能变暖，暖水还能变冷。答曰：不是这样，内心动时就有息出去，出去以后息就没有了，鼻口吸外气就有息入进来，入进来以后，息就灭去了，根本没有息再出去或者再入进来的事情。再者说，少儿、青壮年和老人的出入息情况都不一样，少儿的入息比出息长，青壮年的入息和出息一样长，老人的出息比入息长，因此说出入息不是一个息脉，不是一次呼吸。</p><p>原文：<strong>复次脐边风发。相似相续。息出至口鼻边。出已便灭。譬如[夢-夕+棐]囊中风开时即灭。若以口鼻因缘引之则风入。是从新因缘边生。譬如扇众缘合故则有风。是时知入出息因缘。而有虚诳不真。生灭无常。</strong></p><p>释：复次，肚脐边的风发动的时候，连续不断的向上排出，就是息出，出到口鼻处的时候，再出去就灭去没有了。譬如韛囊中的风，韛囊打开的时候，风就灭了。如果用口鼻把风吸引过来，风就入到鼻中，那么入息就是因为一个新的因缘而产生的。譬如扇子因为有多个因缘和合在一起，就有风出。思惟观察到此，这时候就知道入出息都是有因缘的，是因缘而生法，是虚诳不真实的法，生灭无常变异。</p><p>原文：<strong>如是思惟。出息从口鼻因缘引之。而有入息因缘。心动令生。而惑者不知。以为我息。息者是风。与外风无异。地水火空。亦复如是。是五大因缘。合故生识。识亦如是。非我有也。五阴十二入十八持。亦复如是。</strong></p><p>释：应该像这样思惟，出息是因为有口鼻的因缘引出去，才有入息的因缘，都是心念波动，产生了出息入息现象。而心里迷惑的人却不知道，还以为出入息就是自己的息脉。</p><p>所谓的息，就是风，与身体外的风没有差别。身体里的地水火空也是这样，与身体外的地水火空没有差别。这五大的因缘和合时就出生了六识，因为五大能形成色声香味触法，六尘出现，六识就会因根触尘而出生。因此六识也是因缘所生，不是我（意根）所有的，五阴、十二入、十八界也是这样，因缘所生，不是我（意根）所有的。</p><p>原文：<strong>如是知之。逐息入息出。是以名随。已得随法。当行止法。止法者。数随心极。住意风门。念入出息。</strong></p><p><strong>问曰。何以故止。答曰。断诸思觉故。心不散故。数随息时。心不定心多剧故。止则心闲少事故。心住一处故。念息出入。譬如守门人门边住。观人入出。止心亦尔。知息出时。从脐心胸咽至口鼻。息入时。从口鼻咽胸心至脐。如是系心一处。是名为止。</strong></p><p>释：如是应该知道，心念追随着息入和息出，就叫作随息。修完随息法以后，应当修习止息法。止息法就是数息随息运行一段时间以后，心里觉得疲劳，不想动了，就把所有的注意力集中在风息出入之处，心念专一在出入息上不移动，不用再随息运转了。</p><p>有人问：为什么要把心念止在出入息上？答：为了断除思觉，防止心散乱。数息随息时，心念还有动转，游移不定，心动剧烈。心念止在气息的入出处，内心清闲，所需做的事比较少。因为心念住在一处，只注意气息的出入情况，没有其他事情，心容易止，定就深。譬如守门人站在门边看着人来人往，不用到处走动，心就能安定下来。把心止在气息的出入上也是这样，知道气息出去时，是从肚脐开始往上渐次而出，经过心脏、胸口和咽喉，再到口和鼻端；气息入进来时，从口和鼻端开始，到咽喉，经过胸口、心脏，最后到肚脐处。这样就把心系在一处了，这叫作止息。</p><p>原文：<strong>复次心止法中住。观入息时五阴生灭异。出息时五阴生灭异。如是心乱便除却。一心思惟。令观增长。是名为观法。</strong></p><p><strong>舍风门住。离粗观法。离粗观法。知息无常。此名转观。观五阴无常。亦念入息出息。生灭无常。见初头息。无所从来。次观后息。亦无迹处。因缘合故有。因缘散故无。是名转观法。</strong></p><p>释：复次，心在止息法的修行中要住在观行上，观察入息时五阴的生灭和变异性，出息时五阴的生灭变异性，这样就能把散乱的心念除去了，再专心思惟，使得观行逐渐深入，名为第四观法。</p><p>舍去气息的出入处口鼻处而住息，离开粗糙的观法。舍离粗糙的观法以后，知道气息是无常的，这是第五转观。观五阴无常，也念着入息和出息的生灭无常，观见前边第一个气息无所从来，再观后边的气息也没有踪迹可寻，都是因缘和合才出现的出入息，因缘散去就没有了，这就是转观法。</p><p>原文：<strong>除灭五盖及诸烦恼。虽先得止。观烦恼不净心杂。今此净法。心独得清净。复次前观异学。相似行道。念息入出。今无漏道。相似行善有漏道。是谓清净。</strong></p><p><strong>复次初观身念止分。渐渐一切身念止。次行痛心念止。是中非清净。无漏道远故。今法念止中。观十六行。念入出息。得暖法、顶法、忍法、世间第一法、苦法忍乃至无学尽智。是名清净。</strong></p><p>释：继续修习，当禅定和观行越来越深入时，渐次除灭贪欲、嗔恚、睡眠、掉举、散乱五盖及诸烦恼。虽然从前先得止，能观烦恼不清净心念杂染，现在得此清净法，心里就得到清净了。复次，以前观察出入息生灭变异的修学方法，是相似的行道法，念头在气息的出入上，还不究竟，没有达到无漏。现在修学的无漏道，降伏了烦恼，是相似的行道，是善的有漏道法，这叫作第六清净门。</p><p>复次，初次观行色身不净，心念止在身念住以后，渐渐的一切有关色身是清净的心念都止住了，色身不净观成就。再次修行让心念止在受觉上观受是苦，受觉也不清净，离无漏道还远。现在修习法念处，让心止息下来，证得法无我，要观十六个行相，次第得到暖、顶、忍、世间第一法、苦法忍等等，一直到证得四果无学的尽智，有智慧灭除五阴身，出轮回，得解脱，这就是清净的观法。</p><p>原文：<strong>是十六分中初入息分。六种安那般那行。出息分亦如是。一心念息入出。若长若短。譬如人怖走上山。若担负重若上气。如是比是息短。若人极时。得安息欢喜。又如得利。从狱中出。如是为息长。一切息随二处。若长若短处。是故言息长息短。</strong></p><p>释：这十六种修行的方法中，最初是念入息方法，有六种阿那般那修行次第，念出息时也有六种修行次第。最后得暖、顶、忍、世间第一法，断我见证果。在修行中一心观察气息入和出时气息是长还是短，譬如一个人害怕逃走时、上山时、背负重物时、气息从下往上运行时，气息都是短的。如果一个人疲劳至极得到安息心里欢喜时，或者是得到利益犹如从牢狱被释放出来时，气息都是长的。所有的气息都随两处而存在，不是长处就是短处，因此说气息分为两种，息长和息短。</p><p>原文：<strong>是中亦行安那般那六事。念诸息遍身。亦念息出入。悉观身中诸出息入息。觉知遍至身中乃至足指。遍诸毛孔。如水入沙。息出觉知。从足至发。遍诸毛孔。亦如水入沙。</strong></p><p><strong>譬如[夢-夕+棐]囊入出皆满。口鼻风入出亦尔。观身周遍。见风行处。如藕根孔。亦如鱼网。复次，心非独口鼻。观息入出。一切毛孔。及九孔中。亦见息入息出。是故知息遍诸身，除诸身行。亦念入出息。</strong></p><p>释：观察气息时也要按照次第修习六种阿那般那法，观察一切气息遍布全身。观察气息是出还是入时，遍身中的出息和入息都观察到，心的觉知也要遍行到全身中，气息运行到哪里都要觉知，从头到脚指头全身所有毛孔，都要觉知到，犹如水浸润到沙子中浸湿每粒沙。气息出去时也要觉知到，气息从脚趾头运行到头发，以及遍身所有毛孔，都要觉知到，就像水浸润到沙子中，遍及所有沙粒。</p><p>譬如一个韛囊中风入风出，都充满了韛囊，口鼻处的风出入也是如此充满全身。观察遍色身一切处都有风的运行，身体就像莲藕根上的孔一样，也像渔网一样，风息自由出入。再次，心念不仅要在口鼻处观行息的出入，在全身所有毛孔中和色身九孔中都要观行息出和息入。因此就能知道气息遍布全身一切处，身体止息了行为造作时，这时也要继续观行入出息。</p><p>原文：<strong>初学息时。若身懈怠睡眠体重。悉除弃之。身轻柔软。随禅定心受喜。亦念息入出。除懈怠睡眠心重。得心轻柔软。随禅定心受喜。复次入息念止中竟。次行痛念止。已得身念止。实今更得痛念止。实受喜。复次已知身实相。今欲知心心数法实相。是故受喜。亦念息入出爱乐。亦念息入出。是喜增长。名为乐。</strong></p><p>释：初步修习数息法六种观行时，如果色身懈怠懒惰，睡眠多，身体沉重，禅定生起时都能修除弃舍掉。这些状况都除去以后，睡眠重的能减少睡眠，身体沉重变得轻灵，身体就会轻松柔软，随着禅定的增强，心里越来越轻安，越来越喜悦。修到心念随息出入时，能除去身体上极重的懈怠懒惰和睡眠，心里轻松柔软，因为禅定的加深，内心越来越喜悦。</p><p>复次，在入息时身念止息下来，得身念住，再修习在入息时止息受觉。得受念住，已经得到身念寂止了，现在再修得受念止，内心会非常喜悦。在身念止的时候，知身实相为空，真实的得到了喜悦。复次，已经知道色身的实相是什么了，现在想知道几个识心的实相，因此内心感受喜悦。心念也随着息的入和出而生起爱乐，心念也随着息的入出而让喜悦增长，这就是乐。</p><p>原文：<strong>复次初心中生悦是名喜。后遍身喜是名乐。复次初禅二禅中乐痛名喜。三禅中乐痛名受乐。受诸心行。亦念息入出。诸心生灭法。心染法心不染法。心散法心摄法。心正法心邪法。如是等诸心相。名为心行。</strong></p><p>释：复次，在最初的禅定中，心生愉悦是名喜，后来遍身都有喜悦，是名乐。复次，在初禅和二禅中的乐受是名喜，三禅中的乐受是名受乐。能感受所有一切心行，也观行气息的出入，观行各种心行的生灭性，观行心的染污性和不染污性，观行心散乱和集中，观行心是正是邪，如是这些心相就是心行。</p><p>原文：<strong>心作喜时。亦念息入出。先受喜自生。不故作念。心故作喜。问曰。何以故故作喜。答曰。欲治二种心。或散心或摄心。如是作心。得出烦恼。是故念法心作喜。复次若心不悦。劝勉令喜。心作摄时。亦念息入出。设心不定。强伏令定。如经中说。心定是道。心散非道。</strong></p><p><strong>心作解脱时。亦念息入出。若意不解。强伏令解。譬如羊入苍耳。苍耳着身。人为渐渐出之。心作解脱。诸烦恼结亦复如是。是名心念止作解脱。</strong></p><p>释：在内心喜悦时也要观行到气息的入出，先感受的喜悦是自动生起的，不是故意作意起念，心里故意生起喜悦。有人问：为什么要故意生起喜悦？答曰：为了对治两种心，一种是散乱心，一种是摄持心。如是这样对治心，能够修除烦恼，因此念息出息入法，心里就生出喜悦。复次，如果心里不喜悦时，应该劝导自己生起喜悦。心念集中时，也念息出息入，如果心不定时，强制压伏令定下来。如佛经中说，心定就是道，心散就是非道。</p><p>心要想解脱时，也念息出息入。如果内心不想解脱，强行降伏令心解脱。譬如羊入带硬刺的苍耳草丛中，苍耳沾满身，主人要一点点的把羊拉出草丛中。想要求取解脱时，烦恼结系缚身心，也要这样一点点的把身心从烦恼结缚中拉拔出来。这就叫作心念止息以求得解脱。</p><p>原文：<strong>观无常亦念息入出。观诸法无常。生灭空无吾我。生时诸法空生。灭时诸法空灭。是中无男无女无人无作无受。是名随无常观。观有为法出散。亦念息入出无常。是名出散。诸有为法现世中出。从过去因缘和合故集。因缘坏故散。如是随观是名出散观。</strong></p><p>释：观行无常法时，也同时观察息出息入，观行诸法无常、生灭、空、无我。生时，诸法的空相出生了，灭时，诸法的空相灭了，在这生灭现象中，无男相，无女相，无人相，无作者，无受者，叫作随顺无常观。观有为法的出生和散灭时，也要观察息入息出的无常，叫作出散观。</p><p>一切有为法在现世中出生，从过去世时的业因业缘和合，才能出现，因缘散坏时，一切有为法就散掉。如是这样随顺观行叫作诸法出生和散坏观。</p><p>原文：<strong>观离欲结。亦念息入出。心离诸结。是法第一。是名随离欲观。观尽亦念息入出。诸结使苦在在处尽。是处安隐。是名随尽观。观弃舍亦念息入出。诸染爱烦恼。身心五阴诸有为法弃舍。是第一安隐。如是观是名随法意止观。是名十六分。</strong></p><p>释：观行自心离开贪欲结时，也要观察息入息出。能使心舍离烦恼诸结缚的法门，是第一法门。这是随顺离欲观。观行到诸烦恼结使灭尽时，也要观察息入息出。在一切法的现行中诸烦恼结使的苦受都灭尽，一切法的现行处就是安稳处，叫作随顺烦恼断尽处观。观行弃舍烦恼时，也要观察出息入息，所有一切染污爱着五阴身心烦恼的有为法弃舍掉时，是第一安稳。像这样观行叫作随法意止观法门。</p><p>以上所说就是十六种观行法门。</p></div>"
},{
    "title": "第七章　治等分法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　治等分法门</strong></p><p>原文：<strong>第五法门治等分行。及重罪人求索佛。如是人等。当教一心念佛三昧。念佛三昧有三种人。或初习行。或已习行。或久习行。若初习行人。将至佛像所。或教令自往谛观佛像相好。相相明了。一心取持。还至静处。心眼观佛像。令意不转。系念在像。不令他念。他念摄之。令常在像。</strong></p><p>释：第五个对治烦恼的修行法门，以及犯重罪的人要忏悔业障，求佛加持消除重罪，应当教导这些人一心念佛，修成念佛三昧。修习念佛三昧法门分为三种人，其所用的方法有所不同，有初修习念佛法门的人，修习了一段时间念佛法门的人和久修习念佛法门的三种人。</p><p>对于初修习念佛法门的人，把他带到有佛像之处，或者让他自己到佛像之处，仔细观察佛像的相好庄严，佛的每一庄严法相，内心里都要明明了了、清清楚楚。之后，内心专一观想佛像，到一个寂静之处，用心眼再观想佛像，意念佛像，使心念念念在佛像上，不至他处，专一于佛像上。如果意念转移，就牵制回来，保持内心都是佛像，心念一直都在观想佛像上。</p><p>原文：<strong>若心不住。师当教言。汝当责心。由汝受罪不可称计。无际生死种种苦恼无不更受。若在地狱。吞饮洋铜食烧铁丸。若在畜生。食粪啖草。若在饿鬼受饥饿苦。若在人中贫穷困厄。若在天上失欲忧恼。</strong></p><p><strong>常随汝故令我受此种种身恼心恼无量苦恼。今当制汝。汝当随我。我今系汝一处。我终不复为汝所困更受苦毒也。汝常困我。我今要当以事困汝。如是不已心不散乱。是时便得心眼见佛像相好光明。如眼所见无有异也。如是心住。是名初习行者思惟。</strong></p><p>释：如果其心不能住于佛像上，其师应当教导他这样自责其心：因为你（心）的缘故，我所遭受的罪苦无法计算，无边无际的种种生死苦恼没有一样没有经受过。如果在地狱中，就吞食烧热的铜汁和烧红的铁丸；如果在畜生中，就吃粪食草；如果在饿鬼中，就忍受饥饿之苦；如果在人中，就过着贫穷困苦的生活；如果在天上，就为失去所贪爱的境界而常常忧恼苦闷。</p><p>因为我常常随着你（心）故，让我忍受身体和心上的无量苦恼。我现在要制约你（心），你应当随着我而行。我现在把你（心）系缚在一个所在之处，我再也不被你（心）所困扰和苦恼了。你常常困扰我，我现在要用念佛的方法把你系缚住。如是不断的牵制自心，心就再也不会散乱了。这时候心眼就能见到佛像的相好光明，与肉眼所见没有差别，念佛三昧就现前成就了。这样修习住心，就是初修习念佛法门者所应当系心思惟的方法。</p><p>这里的我，是意识五阴；你，是意根。</p><p>原文：<strong>是时当更念言。是谁像相。则是过去释迦牟尼佛像相。如我今见佛形像。像亦不来我亦不往。如是心想见过去佛。初降神时震动天地。有三十二相大人相：</strong></p><p>释：这时就应当再思惟说：这是哪尊佛像的相貌，原来是释迦牟尼佛的相好之像。如我现在见到的佛的形象，像也没有来，我也没有去，只是像这样意想，就见到了过去时的佛，佛最初降神来到人间时，震动了天与地。佛像有三十二大人相：</p><p>一者足下安平立。<br/>      (足底脚心是平直的，没有凹陷处，走起路来却很安稳。）</p><p>二者足下千辐轮。<br/>    （足底脚心有一千个宝轮相）</p><p>三者指长好。<br/>    （手指纤长媚好）</p><p>四者足跟广。<br/>    （脚跟宽广）</p><p>五者手足指合缦网。<br/>    （手指间有縵网，脚趾间也如是。）</p><p>六者足趺高平好。<br/>    （脚稞又高又平又好）</p><p>七者伊尼延鹿�。<br/>    （小腿犹如鹿腿一样平直）</p><p>八者平住手过膝。<br/>    （手臂垂直下来，手过于膝盖。）</p><p>九者阴马藏相。<br/>    （男根犹如良马一样，隐秘不现。）</p><p>十者尼俱卢陀身。<br/>    （身体威严端正，纵横相称。）</p><p>十一者一一孔一一毛生。<br/>    （一孔各生一毛青琉璃色）</p><p>十二者毛生上向而右旋。<br/>    （佛身所有毛发向上而右旋）</p><p>十三者身色胜上金。<br/>    （全身都是真金色）</p><p>十四者身光面一丈。<br/>    （身光普照大千世界，四面各有一丈光芒。）</p><p>十五者皮薄好。<br/>    （皮肤细薄润泽，一尘不染。）</p><p>十六者七处满。<br/>    （两手两足两肩颈项七处饱满柔软）</p><p>十七者两腋下平好。<br/>    （两腋下骨肉圆满不虚）</p><p>十八者上身如师子。<br/>    （上半身宽大饱满如狮子王）</p><p>十九者身大好端直。<br/>    （佛身大而端直）</p><p>二十者肩圆好。<br/>    （两肩圆满丰腴庄严）</p><p>二十一者四十齿。<br/>    （佛有四十齿齐密如白雪）</p><p>二十二者齿白齐密等而根深。<br/>    （牙齿齐密雪白压根很深）</p><p>二十三者四牙白而大。<br/>    （上下各二牙雪白而大）</p><p>二十四者颊方如师子。<br/>    （面颊方圆如狮子）</p><p>二十五者味中得上味。<br/>    （一切饮食味中得上味）</p><p>二十六者舌大广长而薄。<br/>    （舌头广大长而薄软）</p><p>二十七者梵音深远。<br/>    （声音清净如梵天的音乐）</p><p>二十八者迦兰频伽声。<br/>    （声音又如迦陵频切鸟的声音一样美妙）</p><p>二十九者眼绀青色。<br/>    （佛眼是绀青色如青莲花）</p><p>三十者眼睫如牛王。<br/>    （眼睛睫毛整齐而不杂乱如牛王的眼睫毛）</p><p>三十一者顶发肉骨成。<br/>    （佛顶有肉髻相）</p><p>三十二者眉间白毛长好右旋。<br/>    （眉间白毛广长而右旋）</p><p>复次八十种小相：</p><p>一者无见顶。二者鼻直高好孔不现。三者眉如初生月绀琉璃色。四者耳好。五者身如那罗延。六者骨际如钩锁。七者身一时回如象王。八者行时足去地四寸而印文现。九者爪如赤铜色薄而润泽。十者膝圆好。十一者身净洁。十二者身柔软。十三者身不曲。十四者指长圆纤。十五者指纹如画杂色庄严。十六者脉深不现。十七者踝深不现。十八者身润光泽。十九者身自持不委陀。二十者身满足(三月受胎二月生)。</p><p>二十一者容仪备足。二十二者住处安(如牛王立不动)。二十三者威振一切。二十四者一切乐观。二十五者面不长。二十六者正容貌不挠色。二十七者唇如频婆果色。二十八者面圆满。二十九者响声深。三十者脐圆深不出。三十一者毛处处右旋。三十二者手足满。三十三者手足如意(旧言内外握者是)。三十四者手足纹明直。三十五者手纹长。三十六者手纹不断。三十七者一切恶心众生见者皆得和悦色。三十八者面广姝。三十九者面如月。四十者众生见者不怖不惧。</p><p>四十一者毛孔出香风。四十二者口出香气众生遇者乐法七日。四十三者仪容如师子。四十四者进止如象王。四十五者行法如鹅王。四十六者头如磨陀罗果(此果不圆不长)。四十七者声分满足(声有六十种分佛皆具足)。四十八者牙利。四十九者(无汉名故不得出也)。五十者舌大而赤。五十一者舌薄。五十二者毛纯红色色净洁。五十三者广长眼。五十四者孔门满(九孔门相具足满)。五十五者手足赤白如莲华色。五十六者腹不见不出。五十七者不凸腹。五十八者不动身。五十九者身重。六十者大身。</p><p>六十一者身长。六十二者手足满净。六十三者四边遍大光光明自照而行。六十四者等视众生。六十五者不着教化不贪弟子。六十六者随众声满不减不过。六十七者随众音声而为说法。六十八者语言无碍。六十九者次第相续说法。七十者一切众生目不能谛视相知尽。七十一者视无厌足。七十二者发长好。七十三者发好。七十四者发不乱。七十五者发不破。七十六者发柔软。七十七者发青毗琉璃色。七十八者发绞上。七十九者发不稀。八十者胸有\"卍\"字手足有\"吉\"字。</p><p>原文：<strong>光明彻照无量世界。初生行七步。发口演要言。出家勤苦行。菩提树下降伏魔军。后夜初明成等正觉。光相分明。远照十方。靡不周遍。诸天空中弦歌供养。散华雨香。一切众生咸敬无量。独步三界。还顾转身。如象王回。观视道树。初转法轮。天人得悟。以道自证。得至涅槃。佛身如是。感发无量。</strong></p><p>释：佛身光明彻照无量世界，佛刚刚出生时行七步，开口演说法要：天上天下唯我独尊！长大以后出家勤苦修道，在菩提树下降伏魔军，后半夜天刚蒙蒙亮时，成就佛道，成等正觉。佛身光明远远照见十方世界，周遍覆盖，没有空过。各层天的空中鼓乐歌玄，散花雨香供养于佛。一切众生对佛都生起无量的敬仰和尊敬。世尊独步在三界当中，再回头转身顾视，如象王转身回头顾盼一样，观看自己成道时的菩提树，开始初次转法轮。人天大众得道者无数，自作证心得解脱，慧得解脱，终至涅槃。佛身如是，能感化无量众生发起菩提道心。</p><p>原文：<strong>专心念佛。不令外念。外念诸缘。摄之令还。如是不乱。是时便得见一佛二佛。乃至十方无量世界。诸佛色身。以心想故。皆得见之。既得见佛。又闻说法言。或自请问。佛为说法。解诸疑网。既得佛念。当复念佛。功德法身。无量大慧。无崖底智。不可计德。</strong></p><p>释：就这样专心念佛，不让心念他缘外散。如果心缘外法，就把心收摄回来，这样心就不散乱，定于念佛上，三昧现前，就能看见一佛二佛乃至于十方无量世界诸佛色身。因为这是心里所见，所以才能全部见到。见到佛后，就能听到佛所讲法声音，或者是自己请问佛法，佛为解说，破除疑网。修出这样的念佛三昧以后，心中都是佛念，应当再念佛的功德法身，无量的大智慧，无涯底的智慧，不可称计的功德。</p><p>多陀阿伽度(多陀秦言如阿伽度言解亦言实语又言诸余圣人安隐道来佛如是来复次更不来后有中也)阿犁(鲁迷反)呵(阿犁秦言贼呵言杀佛以忍辱为铠精进为坚牢禅定为弓智慧为箭杀憍慢等贼故名杀贼)三藐(无灼反)三佛陀(三藐秦言真实三佛陀言一切觉觉苦因习涅槃因道正解见四实不可转了尽无余故言真实觉一切)鞞伽(除夜反)遮罗那(鞞伽秦言明遮罗那言善行明三明也行清净之行以之独成无师大觉故言明善行也)三般那(秦言满成)宿伽陀(秦言善解亦名善自得又言善说无患)路伽惫(皮拜反路加秦言智智者知世因知尽道故名世智世智知世也)阿耨多罗(秦言无上善法圣智示导一切大德无量梵魔众圣莫有及者何况能过佛尊德大故言无上)富楼沙昙藐(富楼沙秦言大丈夫昙藐言可言可化丈夫调御师佛以大慈大悲大智故有时软美语有时苦切语或以亲教以此调御令不失道故名佛为可化丈夫调御师法也)舍(赊音)多(都饿反)提婆魔㝹舍喃(奴甘反秦言天人师尽能解脱一切人烦恼常住不退上法)佛婆伽婆(过去未来现在行不行知行尽不尽一切诸法菩提树下一切了了知故名佛婆伽婆言有大名声。复次婆名女根婆名吐永弃女根故女根吐也)。</p><p>原文：<strong>尔时复念二佛神德。三四五佛乃至无量尽虚空界。皆悉如是。复还见一佛。能见一佛作十方佛。能见十方佛作一佛。能令一色作金银水精毗琉璃色。随人意乐。悉令见之。尔时惟观二事。虚空佛身及佛功德。更无异念。心得自在。意不驰散。是时得成念佛三昧。</strong></p><p>释：念完一佛的功德，再念第二尊佛的功德，第三第四第五尊佛的功德，乃至于无量无边尽虚空际的诸佛功德，也是如此念。然后再见一尊佛，能见一尊佛化作十方诸佛，能见十方诸佛化作一佛，能令一色化作金银水晶毗琉璃色，随念佛人的意愿，全部都能见到。这时应当只观行两件事，第一是观行像虚空一样的佛身，第二是观行佛的功德，不要再有其他念头，于是心就能得到大自在，心念不驰散他缘，念佛三昧就成就了。</p><p>原文：<strong>若心驰散。念在五尘。若在六觉者。当自勖勉。克励其心。强制伏之。如是思惟。人身难得。佛法难遇。故曰众明日为最。诸智佛为最。所以者何。佛兴大悲。常为一切故。头目髓脑救济众生。何可放心不专念佛。而孤负重恩。若佛不出世。则无人道天道。涅槃之道。</strong></p><p><strong>若人香华供养。以骨肉血髓。起塔供养。未若行人。以法供养。得至涅槃。虽然犹负佛恩。设当念佛。空无所获。犹应勤心。专念不忘。以报佛恩。何况念佛。得诸三昧。智慧成佛。而不专念。是故行者。常当专心。令意不散。既得见佛。请质所疑。是名念佛三昧。除灭等分。及余重罪。</strong></p><p>释：如果心驰散，念着五尘境界法，如果心对六尘境界有觉受，就自己呵责自心，勉励自心，强行压制降伏下来。心里要思惟人身难得，佛法难遇。因此说一切光明中太阳光最亮，一切智慧当中佛的智慧最广大。为什么如此？佛兴起大慈悲心，常为一切众生得利益，用头目髓脑救济众生，为什么我还不把心放下专心念佛，而辜负佛恩？如果佛不出世，就没有机会修学人道、天道和涅槃道之法。</p><p>如果人用香花供养佛，用骨肉血液髓脑起塔供养诸佛，也不如修行人用修学佛法的方法来供养佛，最后得到涅槃。虽然这样，还是辜负佛恩，如果修习念佛还空无所获，还应该精勤专心念佛，以此来报佛恩，何况念佛证得各种念佛三昧智慧而成佛，更是报佛恩的心行，为什么还不专心念佛？因此修行人，应该常常专心念佛，意念不散。见到佛以后，向佛请法，请教心中所疑。这种念佛三昧能除灭贪嗔痴烦恼和其它重罪。</p></div>"
},{
    "title": "第八章　观欲界过证四禅八定",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　观欲界过证四禅八定</strong></p><p>原文：<strong>尔时行者。虽得一心。定力未成。犹为欲界。烦恼所乱。当作方便。进学初禅。呵弃爱欲。云何呵弃。观欲界过。欲为不净。种种不善。当念初禅。安隐快乐。</strong></p><p><strong>观欲云何。知欲无常。功德怨家。如幻如化。空无所得。念之未得。痴心已乱。何况已得。淫欲缠覆。天上乐处。犹不常安。何况人中。人心着欲。无有厌足。如火得薪。如海吞流。如顶生王。虽雨七宝。王四天下。帝释分座。犹不知足。如那睺沙（姓也。）转金轮王为欲所逼。堕蟒蛇中。又如仙人。食果衣草。隐居深山。被发求道。犹复不免。欲贼所坏。</strong></p><p>释：这时候修禅者，虽然证得专一其心的禅定境界，但是真正的定力还没有成就，还被欲界里的贪嗔痴烦恼所恼乱着，这时候应当想办法进一步修习初禅定，呵责爱欲，弃舍爱欲。云何呵责？应当观察欲界的种种过患，知道爱欲的种种不净不善相，应当念着初禅的安稳快乐。</p><p>观察爱欲的结果是什么？知道爱欲无常，能夺取修道的功德，是功德的冤家，爱欲也如诸法一样如幻如化，空无所得。心念爱欲，在未得爱欲之时，心已经浊乱了，更何况陷于淫欲之中，被欲心所缠缚。天上美妙快乐之处，天人还常常感觉不安稳，何况人中苦乐参半的境界。人心痴迷于爱欲，无有厌足之时，如火上加柴火更旺；如大海吞没众流更加汹涌澎湃；如昔日的顶生王虽然能降七宝雨，统治四天下，帝释天主分与半座仍然不知止足；犹如那睺沙转金轮王被欲望所逼迫堕落在蟒蛇中；又如仙人吃山果穿草衣隐居深山，披着长发，一心求道，道心仍然不免被淫欲之贼所破坏。</p><p>原文：<strong>欲乐甚少。怨毒甚多。着欲之人。恶友相近。善人疏远。欲为毒酒。愚惑醉死。欲为欺诳。走使愚人。疲苦万端。不得自在。唯有离欲。身心安隐。快乐无极。欲无所得。如狗咬枯骨。求欲勤劳。极苦乃得。得之甚难。失之甚易。如假借须臾。势不得久。如梦所见。恍惚即灭。欲之为患。求之既苦。得之亦苦。多得多苦。如火得薪。多益多炽。欲如搏肉。众鸟竞逐。</strong></p><p>释：淫欲当中所得到的乐处太少太少，而其中的怨怒毒害却是很多很多。贪着于淫欲的人，恶友与其亲近，善友与之疏远。淫欲为毒酒，使人愚痴迷惑，迷醉而死，淫欲就是欺诳，能驱使愚人身心疲累，痛苦万端，不得自在。只有离欲之人，身心安稳，无比快乐。淫欲之后并无所得，犹如狗咬枯骨一般。勤苦追求淫欲，极其苦痛之时才能得到，得到淫欲之欢甚难，失去时却是很容易，犹如借用享乐一瞬间，其势力不久就会消失；犹如梦中所见，迷迷糊糊就灭去了。淫欲过患极多，追求时就很痛苦，得到以后也是痛苦，得到的越多越痛苦。如火得到薪柴，得到的越多，燃烧的越旺，剩下的灰尘也越多。淫欲犹如啃食死人肉，众多的鸟类都互相竞争夺取。</p><p>原文：<strong>以要言之。如蛾赴火。如鱼吞钩。如鹿逐声。如渴饮咸水。一切众生为欲致患。无苦不至。是故当知。欲为毒害。当求初禅。灭断欲火。行者一心。精勤信乐。令心增进。意不散乱。观欲心厌。除结恼尽。得初禅定。离欲盛火。得清凉定。如热得荫。如贫得富。是时便得。初禅喜觉。思惟禅中。种种功德。观分别好丑。便得一心。</strong></p><p>释：总而言之，淫欲如蛾扑火，被火烧尽。如鱼吞钩，被钩所害。如鹿追逐空谷之声，空费其力。如人渴喝咸水，越喝越渴。一切众生被欲望所害，苦患无穷。因此应当知道，淫欲就是毒害，应当远离。所以应当追求初禅，熄灭欲火。修行者一心精勤信乐于初禅，令心意乐不断增进，心不散乱。观察淫欲过患，心生厌离，除去爱欲烦恼结缚。证得初禅禅定，离开欲望的盛火，得到清凉的禅定乐。如热天得到阴凉，如贫穷得到富贵。这时就得到了初禅定的喜觉观。思惟禅定中的种种功德，观察分别自心的好丑，便得到一心的禅定境界。</p><p>原文：<strong>问曰。修行禅人得一心相。云何可知。答曰。面色悦泽。徐行端正。不失一心。目不着色。神德定力。不贪名利。击破憍慢。其性柔软。不怀毒害。无复悭嫉。直信心净。论议不诤。心无欺诳。易可与语。柔软惭愧。心常在法。勤修精进。持戒完具。诵经正忆。念随法行。意常喜悦。瞋处不瞋。</strong></p><p><strong>四供养中。不净不受。净施则受。知量止足。寤起轻利。能行二施。忍辱除邪。论议不自满。言语鲜少。谦恪恭敬。上中下座。善师善知识。常亲近随顺。饮食知节。不着欲味。乐独静处。若苦若乐。心忍不动。无怨无竞。不喜斗讼。如是等种种相。得知一心相。</strong></p><p>释：有人问说，如何能知道修禅的人修到了一心的禅定境界？答曰：如果此人面色愉悦润泽，身行语行缓缓徐徐，轻柔端正，就知道他处于一心的禅定境界中。如果此人对境，目光不追逐于境界，不贪着于境界，神色泰然自若，就知道此人有禅定力。此人不贪着于名闻和利养，破除了自心的骄慢，心性柔软，没有毒害之心，也不再有悭贪和嫉妒心。此人心直正心，内心清净，与人论议不起争讼，没有胜负心，也没有欺诳他人之心，容易与之交谈，心怀柔软和惭愧。此人心常住于法上，精进修行，勤勤恳恳。严持戒律，律仪具足，读诵经文能正忆念，心念随法而行，而不越矩。心意常喜常悦，于可嗔处而不嗔。</p><p>在饮食衣服医药卧具四种供养中，不清净的供养则不接受，清净布施则可接受，并且知量知止足。睡眠起后，身心轻利，能修行法施和无畏施两种布施。常能忍辱，除去邪见，与人论议，从不自满。言语极少，谦虚低下，恭敬上座、中座和下座同参道友。常常亲近随顺良师和善知识。饮食有节有度，不贪着味欲。喜乐于寂静处独处，处苦乐境界，怀忍而不动。心中没有怨恼和争竞，不喜欢斗争和讼诉。看到如是等等行相，就知道此人得到了一心的禅定境界。</p><p>这是初禅定相，与此不相应，则没有禅定。好争好斗之人，心里没有禅定，更不能证法。心行邪曲，好欺诳他人，设置骗局之人，也没有禅定，更不能证法。</p><p>原文：<strong>此觉观二事。乱禅定心。如水澄静。波荡则浊。行者如是。内已一心。觉观所恼。如极得息。如睡得安。是时次第。无觉无观。生清净定。内净喜乐。得入二禅。心静默然。本所不得。今得此喜。是时心观。以喜为患。如上觉观。行无喜法。乃离喜地。得贤圣所说乐。</strong></p><p>释：心里有觉有观，能扰乱心得禅定，如澄净的水面，波涛荡漾，水则浑浊。修行者也是这样，内心已经达到一心的境界了，如果心里有觉观，就能恼乱其心，失去禅定。就如极度疲劳时得到休息，如睡眠人得到安稳，这时候就要想办法次第除去觉观，达到无觉无观，生起更清净的禅定，内心寂静而有喜有乐，进入二禅。内心寂静了无声息。本来没有这样的寂静禅定，现在得到了，内心喜悦涌动。这时候用心眼再观察，内心喜乐与前边的觉观心一样还有过患，因此就要再修行，让心没有喜悦，除去喜乐心，于是就离开喜悦的二禅地境界，得到贤圣所说的乐地。</p><p>原文：<strong>一心谛知念护。得入三禅。已弃喜故。谛知忆念乐护。圣人言乐护。余人难舍。乐中第一。过此以往。无复乐也。是故一切圣人。于一切净地中。说慈为第一乐。乐则是患。所以者何。第一禅中。心不动转。以无事故。有动则有转。有转则有苦。是故三禅以乐为患。</strong></p><p>释：一心仔细了知此种境界，并且善于护念，就会证入三禅境界，因为已经舍弃了二禅喜心的缘故，则能入三禅。之后再仔细回想观察三禅中的乐受，应该善护己心，不应着于乐受，因为着于乐受也有生死过患，所以应当舍弃。只有圣人能修除乐受，其余人都很难舍除，因为三禅中的乐受是乐中第一之乐，无有过于此者。乐受过后，就再也没有乐了，因此说一切圣人，在一切清净地中，说慈心是第一乐，而乐受就是过患，为什么这样说？因为在最好的禅定中，心是不动转的，心中无事故。心动就有转动，转动则是苦，因此说三禅的乐有动转，就有苦患，能遭受灾患。</p><p>原文：<strong>复以善妙。舍此苦乐。先弃忧喜。除苦乐意。护念清净。得入第四禅。不苦不乐。护清净念一心。是故佛言。护最清净第一。名第四禅。以第三禅乐动故。名之为苦。是故四禅除灭苦乐。名不动处。渐观空处。破内外色想。灭有对想。不念种种色想。观无量空处。常观色过。念空处定。上妙功德。习念是法。逮得空处。</strong></p><p>释：再以善巧方便，舍除这些苦乐受。先去除忧愁喜乐心，除去苦乐的心念，使得心念清净，进入第四禅，不感觉苦也不感觉乐，心念清净专一其心。因此佛说维护心念最清净之地就是第四禅。因为第三禅还有乐心涌动，也叫作苦处，因此第四禅除灭了一切的苦乐受，名为不动处。从此处开始渐渐观察空处，破除内心的内色和外色的念想，心里有什么念就灭除什么念，不念想任何一种色相。观察无量的空处，常常观察种种色相的过患，想念空处定的殊胜美妙的功德，修习这样的念法，就能得到空处定。</p><p>原文：<strong>念无量识处。观空处过。念无量识处功德。习念是法。逮得识处。念无所有处。观识处过。念无所有处功德。习念是法。便得无所有处。念非有想非无想处。若一切想。其患甚多。若病若疮若无想。是愚痴处。是故非有想非无想。是第一安隐善处。观无所有处过。念非有想非无想功德。习念是法。便得非有想非无想处。</strong></p><p>释：再念无量识处，观察空处定中的过患，念想无量识处的种种功德。修习这样的念法，就能证得无量识处禅定。再念无所有处定，观察无量识处禅定的过患，念想无所有处定的种种功德，修习这种念法，就能证入无所有处定。</p><p>然后再念非想非非想定，如果有任何一种念想，都有极多的过患，是病想是疮想是无想，都是愚痴处。是故说非想非非想定是所有禅定中最安稳之善处。观察无所有处定的种种过患，念想非想非非想定的种种功德，修习此种念法，就能证得非有想非无想定。</p><p>原文：<strong>或有行者。先从初地。乃至上地。复于上地。习行慈心。先自得乐。破瞋恚毒。次及十方无量众生。是时便得。慈心三昧。悲心怜愍。众生之苦。能破众恼。广及无量众生。是时便得。悲心三昧。能破不悦。令无量众生。皆得喜悦。是时便得。喜心三昧。能破苦乐。直观十方无量众生。是时便得。护心三昧。二禅亦复如是。三禅四禅除喜。</strong></p><p>释：有的修行者，最先从第一地的欲界定开始，乃至再上一地初禅地，在初禅地中修习慈心三昧，自己首先得到乐处，破除嗔恚毒害。其次慈心顾及到十方无量众生，这时就得到慈心三昧。悲心怜悯众生之苦，就能破除众生的嗔恼，悲心广大遍及无量众生，这时就能证得悲心三昧。能破除不悦心理，令无量众生都得喜悦，这时就证得喜心三昧。能破除苦乐心，直接观察十方无量众生，这时就证得护心三昧。在二禅定地中也是如此修习，在三禅和四禅地中修习，没有喜心三昧。</p><p>原文：<strong>次学五通。身能飞行。变化自在。行者一心欲定。精进定一心定慧定。一心观身。常作轻想。欲成飞行。若大若小(以欲定过为大以欲定减为小)。此二俱患。精进翘勤。常能一心。思惟轻观。如能浮人。心力强故。而不沉没。亦如猿猴。从高上堕。心力强故。身无痛患。此亦如是。欲力精进力。一心力慧力。令其广大。而身更小。便能运身。</strong></p><p>释：修完慈悲喜舍四无量心以后，再修学五种神通，身体就能飞行，能自由自在的变化色身。行者一心修习禅定，起欲心想要发起禅定和神通变化色身，想要得自在，以此欲心，增益禅定力，满足欲如意足。精进修习此禅定，希望尽快满足欲望现起神通道力，不断增长禅定力，满足精进如意足。又修习专注力，一心想获得神通自在，不断增长禅定力，以满足念如意足。行者再修习慧观，不断增强禅定力，以满足观如意足。</p><p>行者一心观行色身，常常观想色身越来越轻，想要飞起来的样子。其禅定力时大时小，依欲如意足的禅定力而定，超过欲如意足定为力大，欲如意足定不足为力小。不管是大还是小，这两种定都有过患。行者再精进修习，常常专心观想色身轻微，一心专一思惟观想身体轻举飞升。如能浮水之人，因心力强大之故，身不沉没于水中；也如猿猴从高处跳堕于地，由于心力强故，身不受伤，没有伤痛。观想色身轻微而能飞行也是如此，由欲如意足力、精进如意足力、念如意足力、观如意足力，使得心力广大，令其色身变得更小，于是便能运身自如。</p><p>欲如意足，是哪个心具有的？修习禅定时，想要飞升变化的心，是指哪个？都是指意根，于是如来藏配合意根的思心所，满足意根的所需和欲望，让色身飞行变化。欲如意足，主要是意根的欲，满足意根的欲，意根有力量，想要达成某种目的，如来藏不得不满足意根。意根没有力量，如来藏也没办法配合。其中还是靠意识的观想和牵引，配合意根，达到目的。可见，意根利用了六识和第八识，来实现自己的一切心思。意根的力量，就是禅定力。欲如意足主要就是意根的定，通过意识的修习，让意根有力量达到目标，满足意根的欲望。</p><p>原文：<strong>复次观身空界。常习此观。欲力精进力。一心力慧力。极为广大。便能举身。如大风力。致重达远。此亦如是。初当自试。离地一尺二尺。渐至一丈。还来本处。如鸟子学飞。小儿学行。思惟自审。知心力大。必能至远。学观四大。除却地大。但观三大。心念不散。便得自在。身无挂碍。如鸟飞行。当复学习。远作近想。是故近灭远出。</strong></p><p>释：复次再观察色身的空大，把色身当成空的，常常如此修习观察，欲力更加广大，精进力、专注力和观察慧力变得极为广大，这时就能把身体高举起来，身体就渐渐离开座位，升上虚空。如有很强大的风力作用，把很重的物体吹向很远之处，举起身体也是这样。刚开始时自己应当一点一点的试验，让身体离开地面一尺二尺，渐渐离开一丈，然后再回到原处。就像小鸟学飞行一样，像小孩学走路一样。自己不断的思惟审查考量自己的心力，到一定时候知道自己的心力已经很大了，一定能飞到远处。</p><p>再修习观察自身的四大地水火风，除去心中的地大，只观察水火风大，让心念专一不散，之后身体就能得到自在，没有了任何挂碍，如鸟飞行一样。这时应当再学习观察，把远处当作近处想，灭去空间距离想，身体就能瞬间到达远处，如在近处一样。</p><p>为什么把远处当作近处想，灭去空间距离想，身体就能瞬间到达远处，如在近处一样？因为这样想，就让意根相信，意根确实相信了，就如此认为，如此认为，如来藏必随顺意根变造如此的境界。神通即如此，一切法都如此，意根相信什么，就会出现什么，改变意根就能改变一切。所以真正的自信，就是意根的信，只要意根相信，无事不成办，成佛就是如此原理。那么意根证得无我，相信无我，其无我之力该有多大？断除我执和一切烦恼，灭除一切的我，心得解脱，入寂静涅槃。</p><p>原文：<strong>复能变化诸物。如观木地种。除却余种。此木便变为地。所以者何。木有地种分故。水火风空金银宝物。悉皆如是。何以故。木有诸种分故。是初神通根本。</strong></p><p><strong>四禅有十四变化心。初禅二果。一者初禅。二者欲界。二禅三果。一者二禅。二者初禅。三者欲界。三禅四果。一者三禅。二者二禅。三者初禅。四者欲界。四禅五果。一者四禅。二者三禅。三者二禅。四者初禅。五者欲界。余通如摩诃衍论中说。</strong></p><p>释：修出神足通等等神通之后就能变化物质色法，改变物质，如观察一块木头的地大种性，除去水火风种子不观，这块木头就能变成大地。为什么如此？因为木头有地大种子的缘故，分别观察木头的水大、火大、风大、空大种子，把木头变成金银珠宝，也都是如此原理。为何如此？因为木头里有这些诸大种子的缘故。这些观行方法就是最初的神通变化的根本。</p><p>四禅有十四种变化心，初禅有两个果证：一个是初禅定果，一个是欲界定果；二禅有三个果证：一是二禅定果，二是初禅定果；三是欲界定果；三禅有四个果证：一是三禅定果证，二是二禅定果证，三是初禅定果证，四是欲界定果证；四禅有五个果证：一是四禅定果证，二是三禅定果证，三是二禅定果证，四是初禅定果证，五是欲界定果证。其它神通如摩诃衍论所说。</p></div>"
},{
    "title": "第九章　修习四念止观趣向涅槃",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong><span>第九章　修习四念止观趣向涅槃</span></strong></p><p>原文：<strong>世尊弟子。习学五法门。志求涅槃。有二种人。或好定多。以快乐故。或好智多。畏苦患故。定多者先学禅法。后学涅槃。智多者直趣涅槃。直趣涅槃者未断烦恼。亦未得深禅。专心不散。直求涅槃。越爱等诸烦恼。是名涅槃。身实无常苦。不净无我。以心颠倒故。为常乐我净。以是故事事爱着其身。是则卑下众生。</strong></p><p>释：世尊的弟子修习五种法门，立志求取涅槃，求取涅槃的人分为两种，一种人是喜好修定，一直修到非想非非想定，因为禅定能使人快乐的缘故，因此迷于禅定，定多慧少，成为定解脱的阿罗汉；一种人是喜好智慧，因为害怕生死苦的种种过患，不愿意花时间修习过多的甚深禅定，以能保证解脱生死就好，因此智慧多于禅定，是慧解脱的阿罗汉。定多的人先学禅法，后学涅槃之理；智慧多的人，直接趣向涅槃，不修二禅至非想非非想定。</p><p>慧多定少直趣涅槃的人，在没有断除烦恼，也没有证得甚深禅定时，能专心致志的系心不散，观行五阴苦空无常无我，以求取涅槃，就超越断除了三界爱系等等所有烦恼，故能涅槃。色身确实是无常和苦的、不净和无我的，因为心有颠倒想，认为是常乐我净，因为这些颠倒想故，事事都爱着其身，就沦落于卑下众生，乞讨于三界。</p><p>原文：<strong>行者欲破颠倒故。当习四念止观。观身种种多诸苦患。从因缘生故。无常种种恼故苦。身有三十六物故不净。以不得自在故无我。习如是观。观内身观外身。观内外身。习如是观。是谓身念止。身实相如是。何故于此。而起颠倒。爱着此身。谛思惟念。身边乐痛。以爱乐痛。故着此身。当观乐痛。实不可得。</strong></p><p>释：修行人如果想要破除种种颠倒，就要修习四念处观，观察色身种种有诸多的苦患，都是从因缘而生，是无常的，有种种烦恼的，因此是苦的。色身有五脏六腑等等三十六物，所以不净，因为色身不自在所以无我。应修习这样的观行，观察内身，观察外身，观察内外身，修习这样的观行，就是身念住。色身的真实相就是这样，为什么要对色身生起颠倒想，而爱着此身？仔细思惟，原来是因为贪着色身的乐受，因为贪爱乐受的缘故，而贪着色身，应当观察乐受确实是了不可得的。</p><p>原文：<strong>云何不得因衣食故致乐。乐过则苦生。非实乐故。如患疮苦。以药涂治。痛止为乐。以大苦故。谓小苦为乐。非实乐也。复次以故苦为苦。新苦为乐。如担重易肩。而以新重为乐。非实常乐也。如火性热。无暂冷时。若是实乐。不应有不乐。</strong></p><p>释：为什么不能因为衣食的缘故而获得快乐？因为快乐过后就有苦恼出现了，这种快乐并不是真正的快乐。如身体生了疮疤而生苦恼，用药涂抹身体，疼痛止息就感觉快乐了。因为经受了大苦，就把小苦当作乐，这并不是真实的乐受。再次说，因为把原有的苦当作苦，新出现的苦就以为是乐。如肩上担负重担，换个肩膀担担子，另一个肩膀担上重担就当作乐，这并不是真实的乐。就如火性永远是热的，没有一刹那是冷性的，色身的苦性也如是，无暂乐时。如果有真实的乐，不应该有不乐的时候。</p><p>原文：<strong>或曰。外事是乐因缘。不必是乐。或时乐因。或时苦因。若使心法与爱相应。尔时是乐。与恚相应尔时是苦。与痴相应不苦不乐。以此推之。可知有乐无乐。答曰。无也。淫欲不应是乐。何以故。若淫欲在内。不应外求女色。外求女色当知淫苦。若淫是乐不应时时弃。若弃不应是乐。于大苦中以小苦为乐也。如人应死。全命受鞭。以是为乐。欲心炽盛。以欲为乐。老时厌欲。知欲非乐。若实乐相。不应生厌。如是种种因缘。欲乐相实不可得。乐失则苦。佛言。乐痛应观苦。苦痛应观乐。如箭在体。不苦不乐应观生灭无常。是谓痛念止。当知心受苦乐受。不苦不乐。</strong></p><p>释：有人说，身外之事都是生乐的因缘，因缘不一定是乐的，因缘有时是乐的因，有时是苦的因。如果使心与喜乐相应，这时候心就是乐的；与嗔恚相应，这时候心就是苦的；与愚痴相应，这时候心就是不苦不乐的。以此推求苦乐因，就知道心有乐有不乐。</p><p>对于这个问题的回答是：不是这样，淫欲不应该是乐的。为什么如此说？如果淫欲在身内，不应该向外再求女色而得乐，如果向外贪求女色，当知淫欲是苦的。如果淫欲是乐的，乐受不应该一点点的消失，如果乐受能消失，不应该是乐，这是在大苦当中把小苦当作了乐。比如说一个人应该死去，如果能保全他的性命而接受鞭刑，他就以为鞭刑是乐。</p><p>同理，淫欲心炽盛的人，以淫欲为快乐，年老时开始厌离淫欲，知道淫欲并不是乐：如果淫欲确实是乐相，不应该对淫欲生起厌离心。如是阐述种种乐的因缘，说明淫欲的乐相确实是了不可得的，乐受失去苦恼就来临。佛说，乐受时应该观察其中的苦，苦受时应该观察乐，无论苦受还是乐受都如毒箭藏在身体里一样，不苦不乐受时应该观察受觉的生灭无常性，这叫作修习受念处。这时应当知道心里在受着苦乐受和不苦不乐受。</p><p>原文：<strong>云何心。是心无常从因缘生故。生灭不住。相似生故。但颠倒故。谓是为一。本无今有。已有还无。是故无常。观知心空。</strong></p><p><strong>云何为空。从因缘生。有眼有色可见。忆念欲见。如是等和合眼识生。如日爱珠。有日有珠。有干草牛屎众缘和合。于是火生。一一推求。火不可得。缘合有火。眼识亦尔。不住眼中亦非色中住。不两中间住。无有住处。亦复不无。是故佛言。如幻如化。现在心观过去心。或苦或乐。或不苦不乐。心各各异各各灭。有欲心无欲心亦如是。各各异各各灭。观内心观外心。观内外心亦如是。是名心念止。</strong></p><p>释：什么是心？所谓的心是无常的，从因缘里而出生的，生灭性从不停止，于是就有一切法好像是出生了。只是由于心颠倒的缘故，认为心是恒一永久不变的。心本来没有，现在才出现，出现以后还会灭去，因此说是无常的。</p><p>为什么是空的？因为心是从因缘而生的，有眼根有可见的色尘，有忆念的心，有想见色的欲望，这些因缘条件和合，眼识就出生了，因此眼识就是空的。如日爱珠生火器，有太阳、有凸透镜、有干草或者是牛粪这些因缘条件和合，于是火就生出来了。一个因缘一个因缘的推求，火性是了不可得的，因缘和合才有火。眼识也是这样，不住在眼根中，也不在色尘中住，也不在眼根和色尘中间住，没有一个住处，又不是不存在。</p><p>因此佛说，一切法如幻如化。用现在的心，观察过去的心，或者是苦的，或者是乐的，或者是不苦不乐的。心各各有变异，各各有灭，有欲心和无欲心也是如此，各各变异，各各灭去。观察内心，观察外心，观察内外心，都是如此，念念生灭变异，这就是心念住。</p><p>原文：<strong>复次观心为属谁。观想思惟念欲等诸心相应法不相应法。谛观其主。主不可得。何以故。从因缘生故无常。无常故苦。苦故不自在。不自在故无主。无主故空。</strong></p><p><strong>前别观身痛心法不可得。今更总观四念止中。主不可得。离此处求亦不可得。若常不可得。无常亦不可得。若常应当常苦常乐。亦不应忘。若常有神者。无杀恼罪亦无涅槃。若身是神。无常身灭。神亦应灭。亦无后世。亦无罪福。如是遍观无主。</strong></p><p>释：复次，观察心属于谁所有，观想的心、思惟的心、念着贪欲的心等等这些与心相应的法和与心不相应的法，仔细观察这些心的主人，主人了不可得。为什么？因为这些心都是从因缘而生，所以是无常的，无常就是苦，苦就不是自在的，不自在所以无主，无主就是空。</p><p>以前个别观察身、受、心、法都不可得，现在再总体观察四念住中，其主人也不可得，离四念住中求主人也不可得。如果常法是不可得，无常法也是不可得。如果有常法，应当是常苦和常乐，不应该苦乐都能变异转变，也不应该忘记了苦乐受。如果常常有神识存在，也就没有杀害和恼怒的罪，也没有涅槃，因为这时候神识不是变异就是灭了。如果身体是神识，无常的色身灭了，神识也应该灭了，也没有后世，也没有罪福性。如是遍观察，确实身、受、心、法都没有主人。</p><p>原文：<strong>诸法皆空不自在。因缘合故生。因缘坏故灭。如是思惟缘合法。是名法念止。若行者得法念止。厌世间空老病死法。都无少许常乐我净。我于此空法。复何所求。应当入涅槃。最善法中住。建精进力。得深舍摩陀故(深舍摩陀者住心一处名也此土无是名)。</strong></p><p>释：一切法全部是空的不自在的，因缘和合时才得以出生，因缘散坏时就灭去。如是思惟因缘和合法，就是法念处。如果行者修行法念处，得到心念止息，不欲着法求法，就会厌弃世间的空法生老病死法，在其中没有少许的常乐我净，那么我在这些空法当中还求索什么，应当入到涅槃最善法中住。我现在就要精进修行，以期证得甚深奢摩他。</p><p>原文：<strong>是时得深舍摩陀。住第四法念止中。观诸法相皆苦无乐。无乐是实。余者妄语。苦因爱等诸烦恼及业。是非天非时非尘等种种妄语中生。是烦恼及业出生此苦。是苦入涅槃时一切灭尽。非色无色界及世界始。世界始(外道谓一切有法之初色为世界始外道谓涅槃也以此有始能化作万物即名造化也)等种种妄语能灭此苦。正见等八直。是涅槃道。非余外道苦行。种种空持戒。空禅定空智慧。</strong></p><p>释：于是精进之后就证得了甚深奢摩他，住在第四念住法念住上，心得止息。观察诸法法相皆是苦没有乐，无乐是真实相，说可乐不苦等等都是妄语。世间苦因为贪爱诸烦恼和业障而有，因为有妄见非天非时非尘等等妄语，苦受就出生了。因为有烦恼和业障才有这些苦受，这些苦受在入涅槃时就会全部灭尽，再也没有色界无色界和世界的开始了，世界有生等等这些妄语不真实语的苦受也灭去了，正见、正语、正信、正业、正命、正精进、正定、正慧等八正道是趣向涅槃之道，不是其余外道那些苦行能趣向涅槃，也不是他们种种空持戒、空禅定和空慧能趣向涅槃。</p><p>原文：<strong>何以故。佛法中戒定慧三法合行。能入涅槃。譬如人立平地。持好弓箭能射杀怨贼。三法合行亦如是。戒为平地。禅定为快弓。智慧为利箭。三事备足。能杀烦恼贼。以是故外道辈。不得涅槃。行者是时。作四法缘。观缘如射博。观苦四种。因缘生故无常。身心恼故苦。无一可得故空。无作无受故无我。</strong></p><p>释：为什么如此说？佛法中戒定慧三法共行，才能入涅槃。譬如人站在平地上，手拿好弓箭才能射杀怨贼，戒定慧三法和合修行也是这样。戒是平地，禅定是好用的弓，慧是弓箭，三者都具备，才能杀烦恼贼。因为这个道理那些外道辈不得涅槃。行者这时候缘于四个法而作观行，观行诸法因缘就像射箭一样。观行四种苦受：一切法因缘而生，所以是无常：身心有所烧脑，所以是苦：世间无一法可得，所以是空：也没有造作者没有受苦者，没有一法属于自己的，因此一切法都是无我的。</p><p>原文：<strong>观习四种烦恼有漏业。和合故集。相似果生故因。是中得一切行故生。非相似果相续故缘。观尽四种一切烦恼覆故闭。除烦恼火故灭。一切法中第一故妙。世间过去故出。</strong></p><p><strong>观道四种。能到涅槃故道。不颠倒故正。一切圣人去处故迹。得脱世愁恼故离。如是观者得无漏相似法。名为暖法。云何名暖。常勤精进故名暖法。诸烦恼薪无漏智火。烧火欲出初相名为暖法。譬如钻火初钻烟出。是名暖。是为涅槃道初相。</strong></p><p>释：观行修习四种念处，知道烦恼有漏业是和合起来的，所以叫作集起。因为烦恼能集起世间五阴身，未来有相似的果生，所以烦恼有漏业是未来果报的因。在实现因缘果报过程中会有一些业报的运行，所以有果出生。不属于果报的法相续不断的运行是果报现行的缘。把这四种法都观行透彻，就知道一切烦恼能覆盖自心，所以叫作遮闭。能除灭烦恼火，所以烦恼能灭。四念处观是一切法中第一之法，所以是妙法，能让众生从世间法里脱离出去，所以是出离法。</p><p>观行的方法有四种，能达到涅槃所以叫作道，能使心不再颠倒所以叫作正，一切圣人都要从此经过，所以叫作圣迹，能脱离世间的忧愁烦恼，所以叫作离。如是观行的人，能证得相似的无漏法，名为暖法。</p><p>什么叫作暖？内心能常常精进修习四念处法，所以叫作暖法。用诸烦恼的薪柴烧出无漏的智慧之火，智慧火即将要出来的时候，叫作暖法。譬如用钻隧钻火，刚刚开始钻时，冒出的烟，叫作暖相。这是涅槃道上的初相。</p><p>原文：<strong>佛弟子中有二种人。一者多好一心求禅定。是人有漏道。二者多除爱着。好实智慧。是人直趣涅槃。入暖法中。有暖相者。深得一心实法镜。到无漏界边(镜中像似面界边非中故以为喻)。行者是时大得安隐。自念我定当得涅槃。见此道故。</strong></p><p>释：佛弟子分为两种人，一种人喜乐于禅定，多修禅定，一心求于禅定的舒适自在，却不勤求增长智慧和降伏烦恼，修行有漏道。一种人是勤求智慧，注意反观自己的烦恼，以消除自己的贪爱，这种人能直接趣向涅槃。修行初步入于暖法中，得到暖相的人，就能证得一心的初禅禅定境界，修到断除烦恼的边缘。这时修行人才能得到大安稳，因为即将断尽烦恼，趣入涅槃了，自己知道自己一定能够证得涅槃。证得暖相。</p><p>原文：<strong>如人穿井。得至湿泥。知当得水不久。如人击贼贼已退散。自知得胜。意中安隐。如人怖死。人欲知活不。当先试之。以杖打身。若隐胗脉起者。知是有暖必可得活。亦如听法人。思惟喜悦心着。是时心热。行者如是有暖法故名为有暖。亦名能得涅槃分善根。</strong></p><p>释：犹如人凿井，凿出了湿泥，心里知道不久就能出水了。如人打击贼人，贼人已经退散了，就知道自己得胜，心里安稳了。如人害怕死亡，想知道一个人是否已经死亡，应当先试一试，用木杖击打他的身体，如果身体脉象微动，知道身体还有暖度，必能活过来。也如听法的人，思惟佛法喜悦心生，这时心里感觉好像有股热流。行者如是有暖相，叫作有暖，也叫作能得涅槃分的善根，分证涅槃解脱。　　</p><p>原文：<strong>是善根法有十六行四谛缘。六地中一智慧。一切无漏法基。野人能行安隐(于无漏疏故名为野人案梵本尔先言凡夫人非)。是名有暖法。增进转上更名顶法。如乳变为酪。是人观法实相。我当得苦脱。心爱是法。是为真法。能除种种苦患及老病死。</strong></p><p>释：这种善根的修持方法缘于四圣谛有十六种行相，在欲界和色界的六地中都可以生出涅槃智慧，是一切无漏法的基础，烦恼重之人修行也能得到安稳，叫作暖法。此智慧再得到增进增长，就叫作顶法。犹如从牛乳变为酥酪，此人观行出了佛法的真实相是空苦无常，即发愿我应当脱离此苦，心里爱乐四圣谛法，认为这是真实法，能除去种种苦患和老病死。</p><p>原文：<strong>是时思惟。此法谁说。是佛世尊。从是得佛宝中信心清净。大欢喜悦。若无此法。一切烦恼谁当能遮。我当云何。得实智慧少许明。从是得法宝中信心清净。大欢喜悦。若我不得佛弟子辈好伴。云何当得实智慧少许明。从是得僧宝中信心清净。大欢喜悦。是三宝中得一心清净。合实智慧。是顶善根。亦名顶法。亦名能得涅槃分善根。</strong></p><p>释：这时就思惟，四圣谛法四念处法是谁所说，是佛世尊所说，因此就得到对佛宝的清净信心，心大欢喜。又心念思惟，如果没有这样的佛法，我一切的烦恼谁能来遮止降伏，我应当如何证得这样的智慧，得到少许的智慧光明。于是就得到对法宝的清净信心，心大欢喜。又思惟，如果我没有佛弟子辈的好伴侣善友，如何能得到真实智慧，有少许的智慧光明。于是得到了对僧宝的清净信心，心大欢喜。在三宝中得到一心清净信乐，和真实的智慧，就是顶善根，也叫作顶法，也叫作能涅槃的解脱分善根。</p><p>原文：<strong>如波罗延经中说。</strong></p><p><strong>佛宝法僧宝    谁有少信净</strong></p><p><strong>是名顶善根    汝曹一心持</strong></p><p><strong>云何为少信。于佛菩萨辟支佛阿罗汉边为少。于野人边为多。复次此可破可失是故名少。如法句说。</strong></p><p><strong>芭蕉生实死    竹生实亦然</strong></p><p><strong>骡有子则死    小人得养死</strong></p><p><strong>破失非利故    小人得名誉</strong></p><p><strong>白净分失尽    乃至顶法堕</strong></p><p>释：波罗延经说，佛宝法宝僧宝，谁能对此三宝有少许的清净信心，就是最顶的善根。你们大众应该一心奉持，恭敬三宝。什么称作有少许信心？对佛菩萨辟支佛阿罗汉有少信为少，对于与无漏善根远的烦恼重的人有少许信为多。此少许信心容易退失和破坏，所以说是少。</p><p>如法句经中说，芭蕉一旦生长出实心就会死去，竹子一旦生出实心也会死去，骡子生子就死，小人得到恩养和尊重也会得意而失心，恩养对小人没有好处。小人一旦得到名誉，善根就会消失殆尽，所修得的顶法也会退堕。</p><p>原文：<strong>复次未断诸结使。未得无漏无量慧心。以是故名少。复次勤精进一心。入涅槃道中。更了了观五阴四谛十六行。是时心不缩不悔不退。爱乐入忍。是名忍善根。忍何等。随四谛行。是名为忍。是善根三种。上中下三时。云何名忍。观五阴无常苦空无我。心忍不退是名忍。</strong></p><p>释：再次，没有断除诸烦恼结缚，没有得到无漏的无量慧心，因此就说是少信。精勤精进修行证得一心三昧，入到涅槃之道中，再仔细细微观行五阴四圣谛的十六种行相，这时心不退缩不后悔不退失，心爱乐修习四圣谛法，入到忍位中，叫作忍善根。忍什么法？随顺四圣谛法所行就是忍，忍善根分为上中下三种。什么是忍？观察五阴的无常苦空无我，心里忍可不退失，叫作忍。</p><p>原文：<strong>复次。观诸世间尽。苦空无有乐。是苦因习爱。等诸烦恼。是习智缘尽。是名上法。更无有上。八直道能令行人得至涅槃。更无有上。如是信心。不悔不疑。忍是名忍。是中更有忍。种种结使。种种烦恼疑悔。来入心中。不能令破。譬如石山。种种风水不能漂动。是故名忍。是事得名真好野人。</strong></p><p><strong>如佛说法句中。</strong></p><p><strong>世界正见上    谁有得多者</strong></p><p><strong>乃至千万岁    终不堕恶道</strong></p><p>释：再次观察所有世间都是苦空没有乐，熏习贪爱等等烦恼是苦的因，贪习缘尽获得解脱智慧是上忍法，更无有上。八正道能让修行人得到涅槃之乐，因此是更无有上之法。像这样生起对四圣谛法的信心，不悔也不疑，如是忍耐是名忍。种种烦恼结使种种疑悔都来侵袭自心，而不能破坏自心的清净信。譬如石头高山，种种的风和水都不能飘动石山，因此叫作忍。修成这种程度，才是真正的修行人。</p><p>如佛在法句经里说，世界上所有的正知见是最无上的，谁获得的多，谁就多得，乃至于千万年中，始终不会堕入恶道中。</p></div>"
},{
    "title": "第十章　修习十六心的果德",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong><span>第十章　修习十六心的果德</span></strong></p><p>原文：<strong>是世间正见，是名为忍善根。是人多增进一心。极厌世界行。欲了了四谛相。作证趣涅槃。如是一心中。是名世间第一法。一时住四行。无常苦空无我。观一谛苦法。忍共缘故。何以故。观欲界五受阴。无常苦空无我。是中心忍入慧。亦是相应心心数法。是名苦法忍。身业口业及心不相应诸行。现在未来世。一切无漏法初门。是名苦法忍。(法无漏法忍信受也)</strong></p><p>释：这种世间的正知见，就名为忍法善根。获得忍的善根，此人就多增进一心的禅定力专注力，极其厌离世间生灭变异的行法，想要明了四圣谛相貌，以身作证趣向涅槃。像这样的一心专注于四圣谛法，就是世间第一法。一时间心就住在了四种行中：苦空无常无我。观行四圣谛中第一谛苦法，忍于与众生共同的业缘。为什么如此说？观察欲界众生的五受阴是无常苦空无我的，在此法中心里能够忍受认可，就能获得智慧，是相应的心法和心数法所证得的智慧，叫作苦法忍。在观行四圣谛中所生起的身业口业及与心不相应的诸行法，在现在未来世界中，是获得一切无漏法的最初之门，叫作苦法忍。</p><p>原文：<strong>次第生苦法智。苦法忍。断结使。苦法智作证。譬如一人刈一人束。亦如利刀斫竹。得风即偃。忍智功夫故。是事得办欲界系。见苦断十结得得。尔时异等智得。无漏智未得。无漏慧得。是时成就一智(等智未来成就)。第二心中成就法智苦智等智。过第三心第四心。成就四智。苦智法智比智等智。</strong></p><p>释：证得世间第一法之后，次第出生苦法智苦法忍，知道五阴世间一切都是苦，能忍可于五阴世间就是苦的这个真理，断除烦恼结使，有苦法智作证。譬如一个人割草或者是割稻麦，另一个人捆扎；也如利刀砍竹子，有风吹来竹子即倒。有忍智功夫就能脱离欲界的生死系缚，证见世间苦，断除十种结缚就成就了忍智功夫。这时得到了异等智，还没有得到无漏智，但无漏慧得到了，这时候成就一个智慧，以后才能成就等智。第二心中成就法智、苦智和等智，第三心和第四心之后，成就四个智慧：苦智、法智、比智、等智。</p><p>原文：<strong>习尽道法智中。一一智增。离欲人知他心智成就增。苦比忍苦比智。断十八结。是四心苦谛能得。习法忍习法智。断欲界系七结。习比忍习比智。断色无色界系十三结。尽法忍尽法智。断欲界系七结。尽比忍尽比智断色。无色界系十二结。道法忍道法智。断欲界系八结。道比忍道比智。断色无色界系十四结。道比智是名须陀般那(下子上子)。实知诸法相。是十六心。</strong></p><p>释：修习世间尽道法智中，每一种智慧都要增加，以至最后圆满具足世间尽智，出离三界，得到涅槃解脱。已经离欲的人能成就他心智通，增加了他心智，还有苦比忍智和苦比智，断除色界和无色界的十三个生死结缚、成就尽法忍和尽法智，能断除无色界的十二个生死结缚。道法忍和道法智成就，能断除欲界的八个结缚系着。道比忍和道比智的成就，能断除色界和无色界十四个生死结缚。道比智就是须陀般那，能真实的了知诸法法相，叫作十六心。</p><p>原文：<strong>能十五心中。利根名随法行。钝根名随信行。是二人未离欲。名初果向。先未断结。得十六心。名须陀般那。若先断六品结。得十六心。名息忌陀伽迷(秦言一来)。若先断九品结得十六心。名阿那迦迷(秦言不来)。先未离欲断八十八结故。名须陀般那。</strong></p><p>释：能修到十五心，利根者叫作随法行，钝根者叫作随信行，这两种人都没有离欲，还没有断除任何结缚，叫初果向。修到十六心，就是须陀洹：如果先断除六品结缚，得证十六心，就是斯陀含：如果先断除九品结缚，就是三果阿那含。还没有离欲就断除八十八结缚，叫作须陀洹。</p><p>原文：<strong>复次无漏果善根得。得故名须陀般那。利根名见得。钝根名信爱。思惟结未断。余残七世生。若思惟结三种断。名家家三世生。圣道八分三十七品名流。流向涅槃。随是流行。故名须陀般那。是为佛初功德子恶道得脱。三结断三毒薄。名息忌陀伽迷。</strong></p><p>释：复次，以善根故而证得无漏果的初果，所以叫作须陀洹。利根的人是证见道，钝根的人叫作信受爱乐。初果须陀洹的思惑烦恼结没有断，需要七次人间天上修行才能断除。如果思惑烦恼结断除了三种，叫作从家至家出生三世。八正道三十七品修成，心心流向涅槃，随顺是流而行，叫作须陀洹，也就是佛的最初功德成就的初果弟子，得脱了恶道。三结缚断除，贪嗔痴烦恼微薄的人，叫作二果斯陀含。</p><p>原文：<strong>复次欲界结九种(上上上中上下中上中中中下下上下中下下)。见谛断。思惟断。若凡夫人。先以有漏道。断欲界系六种结。入见谛道。十六心中得名息忌陀伽迷。若八种断。入见谛道。第十六心中一种。名息忌陀伽迷果向呵那伽迷。若佛弟子得须陀般那。单断三结。欲得息忌陀伽迷。是思惟断欲界系。九种结六种断。是名息忌陀伽迷。八种断。是名一种息忌陀伽迷果向阿那伽迷。</strong></p><p>释；复次，欲界的结有九种：见结、取结、疑结、爱结、恚结、嫉结、悭结、慢结、无明结，分为见道时断的三縛结，和修道时断的贪嗔痴等思惑烦恼。如果一个凡夫众生修行，首先以有漏的修行断除欲界系的六种结缚，而见道入道，在十六心中就名为二果斯陀含。如果断除八种结缚而见道，属于十六心中一种，名为斯陀含向阿那含，在二果与三果之间。如果佛弟子证得初果，只断除三个结缚，想要再证得二果，就要思惟如何断除欲界所系的烦恼，九种结缚断除六种，就是二果斯陀含，断除八种就是二果向于三果阿那含。</p><p>原文：<strong>若凡夫人先断欲界系九种结。入见谛道。第十六心中名阿那伽迷。若得息忌陀伽迷。进断三种思惟结。第九解脱道名阿那伽迷。阿那伽迷有九种。今世必入涅槃阿那伽迷。中阴入涅槃阿那伽迷。生已入涅槃阿那伽迷。勤求入涅槃阿那伽迷。不勤求入涅槃阿那伽迷。上行入涅槃阿那伽迷。至阿迦尼吒入涅槃阿那伽迷。到无色定入涅槃阿那伽迷。身证阿那伽迷。行向阿罗汉阿那伽迷。</strong></p><p>释：如果一个凡夫众生先断除了欲界所系的九种结缚而见道，在十六心中名为三果阿那含。如果证得二果斯陀含以后，再进一步断除三种思惑烦恼结，就进入第九解脱道阿那含。阿那含有九种，分为：一、今世必入涅槃的阿那含；二、在中阴身中入涅槃的阿那含；三、再投生之后入涅槃的阿那含；四、不断勤求入涅槃的阿那含；五、不勤求入涅槃的阿那含；六、生到色界天再入涅槃的阿那含；七、生到阿迦尼吒天后再入涅槃的阿那含；八、生到无色界天再入涅槃的阿那含；九、身作证的阿那含，行止趣向阿罗汉的阿那含。</p><p>原文：<strong>色无色界九种结。以第九无碍道金刚三昧破一切结。第九解脱道尽智修一切善根。是名阿罗汉果。是阿罗汉有九种。退法。不退法。死法。守法。住法。必知法。不坏法。慧脱。共脱。濡智。濡进。</strong></p><p><strong>行五种法退是名退法。利智利进行五种法不退。是名不退法。濡智濡进利。厌思惟自杀身。是名死法。濡智大进自护身。是名守法。中智中进不增不减处中而住。是名住法。少利智勤精进能得不坏心解脱。是名必知法。利智大进。初得不坏心解脱。是名不坏法。不能入深禅中诸漏尽。是名慧解脱。得诸禅亦得灭禅诸漏尽。是名共解脱阿罗汉。一切有为法常厌满足。更不求功德。待时入涅槃。</strong></p><p>释：色界和无色界共有九种结缚，用第九无碍道金刚三昧来破除一切结缚，证得第九解脱道的世间尽之尽智，修得一切解脱的善根，就是阿罗汉。阿罗汉有九种：退法阿罗汉、不退法阿罗汉、死法阿罗汉、守法阿罗汉、住法阿罗汉、必知法阿罗汉、不坏法阿罗汉、慧解脱的阿罗汉、共解脱的阿罗汉、濡智阿罗汉、濡进阿罗汉。</p><p>修行五种法不成就而退失，是退法阿罗汉。有深利的智慧修行五种法不退，就是不退法阿罗汉。智慧微少，精进力微少，厌恶思惟以至于自杀提前舍报入涅槃，名为死法阿罗汉。智慧微少，可是有大精进力以护持自身，名为守法阿罗汉。智慧中等，精进力中等，两方面都不增也不减而住，名为住法阿罗汉。以少智慧，勤行精进，能得不坏心解脱，名为必知法阿罗汉。</p><p>智慧利根，有大精进力，初步得到不坏心解脱，名为不坏法阿罗汉。不能入到二禅以上的禅定中，而断尽了烦恼，就是智慧解脱的阿罗汉。证得各种禅定，也证得灭尽定，就是共（俱）解脱的阿罗汉，他们一切有为法包括佛法常常厌离，满足目前状况，等待寿终时入涅槃。</p><p>原文：<strong>有阿罗汉。求四禅四无色定四等心。八解脱八胜处十一切入九次第六神通。愿智阿兰若那三昧(秦言无诤阿兰若。言无事或言空寂。旧言须菩提。常行空寂行。非也。自是无诤行耳。无诤者。将护众生。不令起诤。于我耳起诤。如舍利弗目连夜入陶屋中宿致拘迦离起诤者是也)。超越三昧熏禅三解脱门及放舍(放舍者三脱门空无愿无相空无愿无相即十二门念反著者也)。更作利智勤精进。入如是诸禅功德。是名得不退法不坏法。</strong></p><p>释：有的阿罗汉，求得四禅、四空定、四等心，具有八解脱、八胜处、十一切、九次第定、六神通，具足寂静无诤三昧、超越三昧、熏禅三个解脱门及放舍，更是求取猛力的智慧，勤行精进，入到这些种种甚深禅定之中，具足三昧功德力，名为不退法不坏法阿罗汉。</p><p>原文：<strong>若佛不出世。无佛法无弟子时。是时离欲人辟支佛出。辟支佛有三种。上中下。下者。本得须陀般那。若息忌陀伽迷。是须陀般那于第七世生人中。是时无佛法。不得作弟子。复不应八世生。是时作辟支佛。若息忌陀伽迷二世生。是时无佛法。不得作弟子。复不应三世生。是时作辟支佛。</strong></p><p>释：如果佛不出世，没有佛法，也没有佛弟子时，这时就有离欲人辟支佛出世。辟支佛有上中下三种，下者，原来证得过初果须陀洹和二果斯陀含，须陀洹在第七世出生在人间时，没有佛法住世，不能做佛的弟子随佛修学，又不能再投生天上和人间，不能再第八次的转世了，这时候只能当辟支佛，独自觉悟佛法。二果斯陀含要上天再回到人间二世投生，这时候也没有佛法住世，不能做佛的弟子随佛修学，又不能第三世投生，这时候就当辟支佛，独自觉悟佛法。</p><p>原文：<strong>有人愿作辟支佛。种辟支佛善根时。无佛法善根熟。尔时厌世出家。得道名辟支佛。是名中辟支佛。有人求佛道。智力进力少。以因缘退(如舍利弗是也)。是时佛不出世。无佛法亦无弟子。而善根行熟作辟支佛。有相好若少若多。厌世出家得道。是名上辟支佛。</strong></p><p>释：有人愿意作辟支佛，种了辟支佛的善根时，无佛法住世，可是辟支佛的善根却成熟了，这时候就会厌世而出家修道，证得道果名为辟支佛，是中品辟支佛。有的人寻求成佛之道，可是智力不足精进力也少，因为某种因缘就退失了成佛之道。这时候没有佛法住世，也没有佛弟子在世，辟支佛的善根成熟了，就作了辟支佛，修出或多或少的相好庄严，厌离世间，出家就得道了。这是上品辟支佛。</p><p>原文：<strong>于诸法中智慧浅入名阿罗汉。中入名辟支佛。深入名佛。如遥见树不能分别枝。小近能分别枝。不能分别华叶。到树下尽能分别知树枝叶华实。声闻能知一切诸行无常。一切诸法无主。唯涅槃善安隐。声闻能如是观。不能分别深入深知。辟支佛少能分别。亦不能深入深知。佛知诸法分别究畅。深入深知也。</strong></p><p>释：在诸法修学中所得的智慧比较浅的，就是阿罗汉，智慧中等的是辟支佛，智慧最深的是佛。比如远远看树木时看不清树枝，走近一些才能看清楚树枝，但还不能看清花和树叶，走到树下，才能完全看清花叶和果实。声闻人能证得一切诸行都是无常的，一切诸法没有其主，只有涅槃是安稳快乐的。声闻人只能观察到这些，不能更进一步了知更深的内容。辟支佛了知的比声闻多一些深一些，也不能再深入了知更深的法。唯有佛能究竟圆满了知一切诸法，深入到底，具一切种智。</p><p>原文：<strong>如波罗奈国王。夏暑热时处高楼上坐七宝床。令青衣磨牛头栴檀香涂身。青衣臂多着钏。摩王身时钏声满耳。王甚患之。教次第令脱。钏少声微。唯独一钏寂然无声。王时悟曰。国家臣民宫人婇女。多事多恼亦复如是。即时离欲独处思惟得辟支佛。须发自落着自然衣。从楼阁去。以己神足力出家入山。如是因缘中品辟支佛也。</strong></p><p>释：如波罗奈国王在夏天非常炎热时，坐在高楼上的七宝床上，让侍女碾磨牛头栴檀香，然后涂抹身上。侍女的手臂戴着多个宝釧，给国王涂抹身体时，宝釧互相碰撞的声音很喧闹，国王很不喜欢听，让侍女一个个的摘掉，留在手臂上的宝釧越少，声音越微弱，只剩下一个时，什么声音也没有了，很寂静。国王这时就明白了，说：国家臣民宫人婇女，人多事多烦恼就多，就像这些宝釧互相碰撞发声一样。国王此时就离欲独处，独自思惟，证得辟支佛果，当即须发自落，袈裟着身，从楼阁中飞身而去，以自己的神通力出家，到一个山中修行去了。如这样证得了因缘法，就是中品辟支佛。</p></div>"
},{
    "title": "第十一章　云何修习各种三昧",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  云何修习各种三昧</strong></p><p>原文：<strong>若行者求佛道入禅。先当系心专念十方三世诸佛生身。莫念地水火风山树草木。天地之中有形之类及诸余法一切莫念。但念诸佛生身处在虚空。譬如大海清水。中央金山王须弥。如夜闇中然大火。如大施祠中七宝幢。佛身如是。有三十二相八十种好。常出无量清净光明于虚空相青色中。常念佛身相如是。</strong></p><p>释：如果行者追求佛道，想要入深禅定中，首先应当系心专念十方三世诸佛的应化身或者是报身，不要念地水火风组成的一切物质色法山树草木等等，天地之中一切有形之类以及其他一切法都不要念，只念诸佛的色身处在虚空当中，佛身譬如大海清水中央的金山之王须弥山，也如暗夜中点燃的大火，又如堂祠中的七宝幢。佛身金山就是这样有三十二相八十种好，在虚空相的青色中常常放出无量清净光明。</p><p>原文：<strong>行者便得十方三世诸佛悉在心目前。一切悉见三昧。若心余处缘。还摄令住念在佛身。是时便见东方三百千万千万亿种无量诸佛。如是南方西方北方四维上下。随所念方见一切佛。如人夜观星宿。百千无量种星宿悉见。菩萨得是三昧。除无量劫厚罪令薄。薄者令灭。</strong></p><p>释：行者常常想念佛如是身相庄严，就能证得十方三世佛悉在前立三昧，一切十方三世诸佛悉皆见。如果心缘于他处他法，还要摄受回来，令念头住在佛身上。这时候就能看见东方三百千万亿种无量诸佛，如是也能看见南方、西方、北方四维上下，随于自心所念，都能见到如是多数目诸佛，就像人半夜观看天上的星宿，百千无量种星宿都能看见。菩萨修行证得如是三昧，能除去无量劫罪，令重罪变轻，轻罪灭去。</p><p>原文：<strong>得是三昧已。当念佛种种无量功德。一切智一切解。一切见一切德。得大慈大悲自在。自初出无明。四无畏五眼。十力十八不共法。能除无量苦。救老死畏。与常乐涅槃。佛有如是等。种种无量功德。作是念已。自发愿言。我何时当得佛身佛功德。巍巍如是。复作大誓。过去一切福。现在一切福。尽持求佛道。不用余报。复作是念。一切众生甚可怜愍。诸佛身功德巍巍如是。众生云何更求余业。而不求佛。</strong></p><p>释：证得如是三昧以后，应当念佛的种种功德，念佛的一切智、一切解、一切见、一切德，修得大慈大悲自在，从刚刚破除无明壳，到获得十力四无所畏、五眼六通、十八不共法，能除去众生无量苦，救护众生老死的怖畏，给与众生常乐我净的涅槃，佛有如是种种无量功德。菩萨作这样的念想之后，自己发大誓愿说，我什么时候才能得到像这样巍巍的佛身佛的功德，众生为什么还要希求其他的业行，而不求取佛道？</p><p>原文：<strong>譬如贵家盲子堕大深坑。饥穷困苦食粪食泥。父甚愍之。为求方便。拯之于深坑。食之以上馔。行者念言。佛二种身。功德甘露如是。而诸众生堕生死深坑。食诸不净。以大悲心我当拯济一切众生。令得佛道度生死岸。以佛种种功德法味悉令饱满。一切佛法愿悉得之。闻诵持问观行得果为作阶梯。立大要誓被三愿铠。外破魔众内击结贼。直入不回。如是三愿。比无量诸愿。愿皆住之。为度众生得佛道故。如是念如是愿。是为菩萨念佛三昧。</strong></p><p>释：譬如高贵人家的盲儿子，堕落在深坑中，饥饿贫穷困苦，食粪食泥，父亲很是怜悯他，寻求方便手段，把他从深坑中拯救出来，给他上妙的饮食。菩萨行者想到，佛的二种身功德，就是这样的甘露。而诸众生堕在生死深坑中，食诸不清净物，我也应当以大悲心拯救一切众生，令众生走上佛道度越生死之岸，用佛的种种功德法味，让众生全部得到饱满充足。一切佛法愿他们全部都能得到，闻经、讽诵、受持、咨问、观行、证果，作为众生修行的阶梯和次第，树立大誓愿，被服三个誓愿铠甲，在外破除魔兵众，在内击破烦恼结贼，直入佛道而不回头。如是三个愿力，堪比其它无量诸愿，为度众生得到佛道故愿皆住于这些大愿中。如是的愿，如是的念想，就是菩萨的念佛三昧。</p><p>原文：<strong>行菩萨道者于三毒中。若淫欲偏多。先自观身。骨肉皮肤。筋脉流血。肝肺肠胃。屎尿涕唾。三十六物。九想不净。专心内观。不令外念。外念诸缘。摄之令还。如人执烛。入杂谷仓。种种分别。豆麦黍粟。无不识知。</strong></p><p>释：修行菩萨道的人，在贪嗔痴三毒烦恼中，如果淫欲偏多，首先要观察自身，观察骨头、肌肉、皮肤、筋脉、流动的血液，以及肝肺肠胃屎尿涕唾等等三十六种物件有种种的不净，专心向内观察，不让心外缘散乱，向外念着诸法时，就把心收摄回来，系在内身三十六物中。就如一个人拿着蜡烛进入杂谷粮仓中，把各种粮谷加以区别，大豆小麦粟米土豆等等没有不了知的。</p><p>原文：<strong>复次观身六分。坚为地分。湿为水分。热为火分。动为风分。孔为空分。知为识分。亦如屠牛。分为六分。身首四支。各自异处。身有九孔。常流不净。革囊盛屎。常作是观。不令外念。外念诸缘。摄之令还。若得一心。意生厌患。求离此身。欲令速灭。早入涅槃。是时当发。大慈大悲。以大功德。拔济众生。兴前三愿。以诸众生。不知不净。起诸罪垢。我当拔置。于甘露地。</strong></p><p>释：然后再观察身体的六个部分，坚硬的为地分，湿润的为水分，热的为火分，动的为风分，有孔的为空分，了知性为识分。也就像杀牛一样，把牛分为六个部分，身体和头、四肢各自分开，身有九孔，常流不净物，如皮囊盛装屎尿一样。常常作这样的观察，不让心念外缘，一旦外缘他法，就要收摄回来。如果这样观察，得到一心的初禅禅定境界，就会心生厌患，想要脱离此身，想要快快的灭度自己，早入涅槃。这时候就要发大慈大悲之心，以此修行的大功德拔济众生，实现自己先前所发三个大愿。因为诸众生不知色身不净，造诸罪恶烦恼垢，我应当把他们救拔到有甘露之地。</p><p>原文：<strong>复次欲界众生。乐着不净如狗食粪。我当度脱。至清净道。复次我当学求。诸法实相。不有常不无常。非净非不净。我当云何。着此不净。观不净智。从因缘生。如我法者。当求实相。云何厌患身中不净。而取涅槃。当如大象。度驶流水。穷尽源底。得实法相。灭入涅槃。岂可如猕猴诸兔畏怖驶流。趣自度身。我今当学如菩萨法。行不净观。除却淫欲。广化众生。令离欲患。不为不净观所厌没。</strong></p><p>释：再次，欲界众生喜乐不净物就像狗吃粪秽物一样，我应当度脱他们到清净道路上来。复次，我应当修学寻求诸法实相，既不是常也不是不常，不断不常，非净非不净。我应当如何观此不净，观察不净的智慧是从因缘而出生的。像我这种情况，应当追求实相，如何才能厌患色身中的不净，而取得涅槃。应当如大象渡驰流的大河一样，穷尽河流的底源，证得诸法实相，灭度自己入涅槃，岂能像猕猴和兔子一样害怕湍流的河水，只顾自身安危。我应当学菩萨法，修行不净观，除去淫欲，广化众生令众生离开贪欲的苦患，不被不净观所吓退道心。</p><p>由此可见，菩萨如果有某种烦恼，或者某种烦恼较重，也要修习小乘的种种观行，加以对治，然不取小乘人的心行，而发大乘菩萨心。</p><p>原文：<strong>复次既观不净。则厌生死。当观净门。系心三处。鼻端眉间额上。当于是中开一寸皮。净除血肉。系心白骨。不令外念。外念诸缘。摄之令还。着三缘中。恒与心斗。如二人相扑。行者若胜心。则不如制之令住。是名一心。</strong></p><p>释：复次，既然能观察出色身的不净，就会厌患生死，应当观察清净法门，让心系在三处，鼻端、眉间和额头上，在这三个地方观想打开一寸的皮肤，除去血肉，没有残余，之后一心系在白骨上，不令心念外缘，发现心念外缘，就收摄回来，放在这三处，常常与散乱心搏斗，如两个人相扑搏斗一样。行者若想调服自心，就要把心安住在此观想上，以此证得一心的初禅境界。</p><p>原文：<strong>若以厌患。起大悲心。愍念众生。为此空骨。远离涅槃。入三恶道。我当勤力。作诸功德。教化众生。令解身相空。骨以皮覆。实聚不净。为众生故。徐当分别。此诸法相。有少净想。心生爱着。不净想多。心生厌患。有出法相。故生实法。诸法实相中。无净无不净。亦无闭亦无出。观诸法等。不可坏不可动。是名诸法实相。(出过罗汉法也)</strong></p><p>释：如果因为厌患色身和生死，为了慜念众生，起大悲心，悲悯众生为了贪得色身中的空骨而远离涅槃，堕入三恶道中。我应当勤力作诸功德，教化众生，令其开解色身的空相，骨头外裹皮囊，实际上都是不净物的集聚。为众生故，应当慢慢的分别这些法相，开始时还有少少的色身清净念想，心里还有爱着。不净的念想增多时，就会对色身心生厌患，观察出一些真实的法相，故生实法相。诸法实相中，没有清净相也没有不清净相，既不入也不出。观察一切诸法都平等一相，不可坏，也不可动，这就是诸法实相，超过于阿罗汉法。</p><p>原文：<strong>行菩萨道者。若瞋恚偏多。当行慈心。念东方众生。慈心清净。无怨无恚。广大无量。见诸众生。悉在目前。南西北方四维上下。亦复如是。制心行慈。不令外念。外念异缘。摄之令还。持心目观。一切众生。悉见了了。皆在目前。</strong></p><p>释：修行菩萨道的人，如果内心嗔恚偏多，应当修行慈心观，心念东方世界的众生，心地清净，慈慜众生，没有怨恼和嗔恚，心量广大无边际，见东方众生都在目前。心念南方西方北方四维上下世界众生也复如是，牵制心念住于行慈悲慜念众生上，不让念头向外攀缘，如果心念缘于他法则收摄回来，专心观想十方世界众生，皆在眼前，全部都清楚可见。</p><p>原文：<strong>若得一心。当发愿言。我以涅槃。实清净法。度脱众生。使得实乐。行慈三昧。心如此者。是菩萨道。住慈三昧。以观诸法实相。清净不坏不动。愿令众生。得此法利。以此三昧。慈念东方一切众生。使得佛乐。十方亦尔。心不转乱。是谓菩萨慈三昧门。</strong></p><p>释：如果证得一心的初禅境界，应当发愿说：我以涅槃真实的清净法，度脱众生，让众生得到真实的快乐。修行慈心三昧，心得如此者，是为菩萨道。心住慈心三昧而观察诸法实相，清净无染，不动不坏，希望众生获得此法的利益。以此三昧慜念东方一切众生都能得到佛地的快乐，慜念十方世界众生也复如是，心不转动和散乱。这叫作菩萨慈心三昧法门。</p><p>原文：<strong>问曰。何不一时总念十方众生。答曰。先念一方。一心易得。然后次第。周遍诸方。问曰。人有怨家。恒欲相害。云何行慈。欲令彼乐。答曰。慈是心法。出生于心。先从所亲。所亲转增。乃及怨家。如火烧薪。盛能然湿。问曰。或时众生遭种种苦。或在人中或地狱中。菩萨虽慈。彼那得乐。答曰。先从乐人取其乐相。令彼苦人。得如彼乐。如败军将。怖惧失胆。视彼敌人。皆谓勇士。</strong></p><p>释：有人问说：为什么不同时都念十方世界众生？答曰：先念一个世界的众生，容易得一心的初禅定，然后再次第念他方世界的众生，再周遍所有世界的众生，如果是一齐念同时都念，恐怕心力不足，就念不出来了。又问说：每个人都有冤家，常常想要恼害自己，如何对他们行慈，想要他们快乐？答曰：慈悲是心法，从心而生，先从自己的至亲开始行慈心，然后转转增加亲属，最后扩展到冤家，就像火烧柴禾时要不断的增加柴禾，火旺盛时才能燃烧湿柴。</p><p>问说：有的时候众生要遭受种种的苦受，有时是在人中，有时是在地狱中，菩萨虽然能修行慈心，那些人要如何才能得乐？答曰：先从快乐的人那里，取得快乐的相，让那些苦恼的人也得到与他们一样的快乐。就如战败军队的将领，已经害怕，失去了勇气和胆量，看自己的敌人都是勇士。</p><p>原文：<strong>问曰。行慈三昧。有何善利。答曰。行者自念。出家离俗。应行慈心。又思惟言。食人信施。宜行利益。如佛所言。须臾行慈。是随佛教。则为入道。不空受施。复次身着染服。心应不染。慈三昧力。能令不染。</strong><strong>复次我心行慈。于破法世。我有法人。非法众中。我有法人。如法无恼。慈定力故。菩萨行道。趣甘露门。种种热恼。慈凉冷乐。如佛所言。人热极时。入清凉池乐。复次被大慈铠。遮烦恼箭。慈为法药。消怨结毒。烦恼烧心。慈能除灭。慈为法梯登解脱台。慈为法船。渡生死海。贫善法财。慈为上宝。行趣涅槃。慈为道粮。慈为骏足。度入涅槃。慈为猛将。越三恶道。能行慈者。消伏众恶。诸天善神。常随拥护。</strong></p><p>释：问说：修行慈心三昧有什么利益？答曰：行者心自念言：出家离开了世俗，应该修行慈心。又思惟说：受用信众的恭敬布施，应该对信众有所利益。如佛所说的那样，须臾间行慈，是随顺佛的教导，是为了入佛道中，不空受用信众的布施。再次说，身穿坏染的出家服，心应该不再染污，慈心三昧的力量才能令心不染污。</p><p>复次，在坏乱佛法的世间里，我心行慈，就是心有佛法之人，在不行正法的众生中，我是行正法之人。如法修行心无恼，慈心定力摄持故。菩萨的修行之道，趣向于甘露门，心中种种热恼，慈心能令其清凉，心得法乐。如佛所说，人感觉非常热的时候，入到清凉池中就快乐了。再次，菩萨如果要披上大慈悲的甲胄，遮蔽烦恼毒箭，慈心就是法药，能消灭怨结的毒害；当烦恼灼烧心灵的时候，慈心就能灭除烦恼火；慈心是佛法的阶梯，是登上解脱的台阶；慈心是法船，能渡越生死海；如果缺少善法财，慈心是最上的宝贝，应当行慈；修行如果要趣向涅槃，慈心就是道粮，慈心就是有力的双脚；如果要想度入涅槃，慈心就是勇猛的将士，能超越三恶道；行慈心的人，能消灭降伏众多恶贼，诸天善神常常随从守护。</p><p>原文：<strong>问曰。若当行人。得慈三昧。云何不失。而复增益。答曰。学戒清净。善信倚乐。学诸禅定。一心智慧。乐处闲静。常不放逸。少欲知足。行顺慈教。节身少食。减损睡眠。初夜后夜。思惟不废。省烦言语。默然守静。坐卧行住。知时消息。不令失度。致疲苦极。调和寒温。不令恼乱。是谓益慈。</strong></p><p>释：问：如果修行人证得了慈心三昧，如何才能保持不失，还能不断的增长慈心三昧？答曰：应当修学戒律，保持心地清净无染，与善相应，深信佛法而生起轻安和喜乐。修学诸禅定，具足一心的禅定和智慧，乐于处在空闲处，心常不放逸，有少欲望善能知足，心行上随顺佛陀慈悲的教导，约束自身，减少饮食和睡眠。在初夜和后夜，常常思惟佛法，不荒废时日。减少不必要的言语，默然守持清净的心境。行住坐卧知时知节有度，不过分造作，而使身心疲累和苦恼。善调色身，不令过寒过热，令身心恼乱。这样不断的调节身心，就能不断的增长慈心三昧。</p><p>真心学佛修行人，应该这样调节身心，戒定慧三无漏学才能成就。如果身行心行与此相违，应当调整过来，改变过来。努力降伏贪染，不尊崇色身，不贪爱色身，守持戒律，禅定才能成就，身心才能轻安，观行智慧才能具足，修行才能证法。</p><p>原文：<strong>复次以佛道乐。涅槃之乐。与一切人。是名大慈。行者思惟。现在未来。大人行慈。利益一切。我亦被蒙。是我良祐。我当行慈。毕报施恩。复更念言。大德慈心。愍念一切。以此为乐。我亦当尔。念彼众生。令得佛乐。涅槃之乐。是为报恩。复次慈力能令一切。心得快乐。身离热恼。得清凉乐。持行慈福。念安一切。以报其恩。</strong></p><p>释：复次，修行人应该把修学佛道之乐涅槃之乐带给一切人，这是大慈悲心。行者应该这样思惟，现在和未来的佛菩萨大人行慈悲行，我也蒙彼恩德。佛菩萨是我的良师，佛法是我的良祐，我也应当行慈，完全报答良师施与我的恩德。再思惟说，大德的慈心慜念一切，以慈心为乐，我也应当如是，慜念一切众生，令得佛法的乐趣和涅槃的乐趣，此为报恩之行。复次，慈悲之力能令一切人心得快乐，身心离开热恼，得到清凉之乐。行持慈悲的福德，慜念安乐一切人，以报良师之恩。</p><p>原文<strong>：复次慈有善利。断瞋恚法。开名称门。施主良田。生梵天因。住离欲处。除却怨对。及斗诤根。诸佛称扬。智人爱敬。能持净戒。生智慧明。能闻法利。功德醍醐。决定好人。出家猛力。消灭诸恶。骂辱不善。慈报能伏。结集悦乐。生精进法。富贵根因。办智慧府。诚信库藏。诸善法门。致称誉法。敬畏根本。佛正真道。若人持恶向。还自受其殃。五种恶语。非时语非实语。非利语。非慈语。非软语。是五恶语。不能倾动。一切毒害。亦不能伤。譬如小火。不能热大海(此下应出优填王持五百发箭)。</strong></p><p>释：复次，慈心有善法的利益，能断除嗔恚法，获大名声，众生得知无不亲近，于是就会成为施主的良好福田。慈心无嗔恚心是生大梵天的因，住在离欲之处，除去冤家对头，及斗争诤讼的根源，诸佛都称扬，智者都爱护敬仰。能受持净戒的人，就能出生智慧明。能听闻佛法得到利益，出生的功德犹如醍醐，决定是善人利根之人，出家之后修行猛力，能消灭一切恶法，骂辱等等不善法，用慈心回报，就能加以降伏。</p><p>多集结善缘，让众生悦乐，就是在佛法中的精进修行，是结富贵因的根源，能建立智慧府邸，和诚实守信的库藏，是一切善法的大门。获得大众的称誉，是大众敬畏的根本，佛法的正真之道。如果有人以恶心向之，就会自受其殃。有五种恶语:不该说的时候而说的话、不是真实的语言、不是有利益的语言、不是慈善的语言、不是柔软的语言。这五种恶语都不能令其慈心动摇，一切毒害也不能伤之。譬如小火，不能让大海发热。</p><p>原文：<strong>如毗罗经中优填王阿婆陀那说。有二夫人。一名无比。二名舍迷婆帝。无比诽谤舍迷婆帝。舍迷婆帝有五百直人。王以五百箭。欲一一射杀之。舍迷婆帝语诸直人。在我后立。是时舍迷婆帝入慈三昧。王挽弓射之。箭堕足下。第二箭还向王脚下。王大惊怖。复欲放箭。舍迷婆帝语王言。止止。夫妇之义是故相语。若放此箭。当直破汝心。王时恐畏投弓舍射。问言。汝有何术。答言。我无异术。我是佛弟子。入慈三昧故也。</strong><strong>是慈三昧略说有三种缘。生缘法缘无缘。诸未得道是名生缘。阿罗汉辟支佛是名法缘。诸佛世尊是名无缘。是故略说慈三昧门。</strong></p><p>释：如毗罗经中优填王阿婆陀那说，有两个夫人，一个名叫无比，一个名叫舍迷婆帝，无比诽谤舍迷婆帝，而舍迷婆帝有五百个忠诚耿直的仆人，国王用五百支箭，想要一一射杀，舍迷婆帝对这些仆人说，站在我身后。这时舍迷婆帝进入慈心三昧中，大王拉弓射来，结果箭堕在了脚下，第二支箭还是堕在大王的脚下。大王惊怖害怕，又想放箭射杀，舍迷婆帝对大王说：止止，因为念着夫妇之恩义，所以告诉你，如果射此箭，这支箭就要直接射向你的心。大王惊恐害怕了，扔下弓箭不再射杀。问舍迷婆帝说：你用的是什么招术？舍迷婆帝答言：我没有什么招术，我是佛弟子，进入慈心三昧，所以才能如此。</p><p>这种慈心三昧大略说有三种缘：生缘、法缘和无缘。那些还没有得道的人是生缘，阿罗汉辟支佛是法缘，诸佛世尊是无缘，这是略说慈心三昧法门。</p><p>原文：<strong>行菩萨道者。于三毒中。若愚痴偏多。当观十二分。破二种痴。内破身痴。外破众生痴。思惟念言。我及众生俱在厄难。常生常老常病常死常灭常出。众生可怜不知出道。从何得脱。一心思惟。生老病死。从因缘生。当复思惟。何因缘生。一心思惟。生因缘有。有因缘取。取因缘爱。爱因缘受。受因缘触。触因缘六入。六入因缘名色。名色因缘识。识因缘行。行因缘无明。</strong></p><p>释：修行菩萨道的人，在贪嗔痴三毒烦恼中，如果愚痴偏多，应当观行十二因缘分法，破除两种愚痴，内破色身愚痴，外破众生愚痴。应当思惟说，我和众生都在苦恶灾难当中，常常出生，常常老去，常常病苦，常常死亡，常常灭去，常常出没，众生可为怜悯，不知出离之道，不知从何处解脱。</p><p>又一心思惟，生老病死从因缘生；再思惟，生是从什么因缘出；一心思惟，生是缘于三界的有，有是缘于执取，取是缘于对三界的贪爱，贪爱是缘于受，受是缘于根尘相触，触是缘于六根，六根是缘于名色五阴，名色缘于前世的六识不断造作，前世六识缘于意根的心行，意根的心行缘于意根的无明。</p><p>原文：<strong>如是复思惟。当何因缘。灭生老死。一心思惟。生灭故老死灭。有灭故生灭。取灭故有灭。爱灭故取灭。受灭故爱灭。触灭故受灭。六入灭故触灭。名色灭故六入灭。识灭故名色灭。行灭故识灭。痴灭故行灭。</strong></p><p>释：如是，再思惟，应当以何因缘，灭除生老病死。于是一心思惟，生只要灭了，老死就灭了；三界有灭了，生就灭了；取灭了，有就灭；爱灭了，取就灭；受灭了，爱就灭；触灭了，受就灭；六根灭了，触就灭；名色灭了，六根就灭；前世的六识灭不造作了，名色就灭；意根的心行灭了，六识的造作就灭；意根的无明灭了，心行就灭。</p><p>原文：<strong>此中十二分云何。无明分不知前。不知后不知前后。不知内不知外。不知内外。不知佛不知法不知僧。不知苦不知习不知尽不知道。不知业不知果不知业果。不知因不知缘不知因缘。不知罪不知福不知罪福。不知善不知不善不知善不善。不知有罪法不知无罪法。不知应近法不知应远法。不知有漏法不知无漏法。不知世间法。不知出世间法。不知过去法不知未来法不知现在法。不知黑法不知白法。不知分别因缘法。不知六触法。不知实证法。如是种种不知不慧不见闇黑无明。是名无明。</strong></p><p>释：这里的十二支分如何？无明分法是不知前，不知后，不知前后；不知内不知外，不知内外；不知佛，不知法，不知僧；不知苦，不知集，不知灭，不知道；不知业，不知果，不知业果；不知因，不知缘，不知因缘；不知罪，不知福，不知罪福；不知善，不知不善，不知善不善；不知有罪法，不知无罪法，不知有罪无罪法；不知应该亲近法，不知应该远离法，不知有漏法，不知无漏法；不知世间法，不知出世间法；不知过去法，不知现在法，不知未来法；不知黑法，不知白法；不知分别因缘法，不知六触法，不知实证法。如是种种不知不见，就是没有智慧，心中黑暗和无明，就是无明法。</p><p>原文：<strong>无明缘行。云何名行。行有三种。身行口行意行。云何身行。入息出息是身行法。所以者何。是法属身。故名身行。云何口行。有觉有观。是作觉观已。然后口语。若无觉观。则无言说。是谓口行。云何意行(痛名世界人所著三种痛。痛应为受。受则随界受苦乐。上界所无故。宜言受想出家所患也)。痛想是意法。系属意故。是名意行。</strong></p><p><strong>复次欲界系行。色界系行。无色界系行。复次善行不善行不动行。云何善行。欲界一切善行。及色界三地。云何不善行。诸不善法。云何不动行。第四禅有漏善行。及无色定善有漏行。是名行。</strong></p><p>释：无明缘行，如何是行，行有三种：身行、口行、意行。什么是身行？入息出息是身行法，因为这个法属于色身上的行为，所以叫作身行。什么是口行？内心有觉受有思想观念，有了觉观以后，口中的语言就出现了，如果没有觉观，就没有言说，因此觉观就是口行。什么是意行？受想是意行法，系属于意，叫作意行。</p><p>复次，欲界行、色界行、无色界行，都属于行。再次，善行、不善行、不动行都属于行。什么是善行？包括欲界的善行，以及色界的初禅天善行、二禅天善行和三禅天的善行。什么是不善行？所有不善法，都是不善行。什么是不动行？第四禅有漏的善行，以及无色界定中善的有漏行，这些都属于行。</p><p>意根的无明不能直接产生这些行，但是意根因为无明却能有各种心行，也就是意根的心行，包括五遍行心所法和各种心所法，之后阿赖耶识配合意根的心所法而出生六识，六识才有各种身口意行，包括善行和不善行，欲界色界无色界的行，包括四禅以上的不动行，包括各种有漏行。</p><p>原文：<strong>行因缘识。云何名识。六种识界。眼识乃至意识。是名六识。识因缘名色。云何为名。无色四分。痛想行识。是谓名。云何为色。一切色四大及造色。是谓色。云何四大。地水火风。云何地。坚重相者地。濡湿相者水。热相者火。轻动相者风。余色可见。有对无对是名造色。名色和合是谓名色。</strong></p><p>释：行的因能出生识，什么是识？六种识界：眼识乃至于意识，叫作六识。六识之因能出生名色。什么是名？无色界的四种：受想行识就是名。什么是色？一切的色法，四大种子及造色的大种，就是色。什么是四大？就是地水火风。什么是地？有坚硬沉重相的就是地，有濡湿相的就是水，有热相的就是火，有轻动相的就是风。其它的能见的色相，与五根有对和无对的就是造色。名色和合起来，就是名色五阴。</p><p>原文：<strong>名色因缘六入。云何六入。内六入。眼内入乃至意内入。是名六入。六入因缘触。云何触。六种触界。眼触乃至意触。云何眼触。眼缘色生眼识。三法和合是名眼触。乃至意触亦如是。触因缘受。云何受。三种受。乐受苦受不苦不乐受。云何乐受。爱使。云何苦受。恚使。云何不苦不乐受。痴使。复次乐受生乐。住乐灭苦。苦受生苦。住苦灭乐。不苦不乐受。不知苦不知乐。</strong></p><p>释：名色之因出生六入，云何六入？就是内六入，眼的内入、耳的内入、鼻的内入、舌的内入、身的内入、意的内入，合起来就是内六入。六入之因产生触，什么是触？触包括六种触界：眼触、耳触、鼻触、舌触、身触、意触。什么是眼触？眼根缘于色尘生眼识，三者和合名为触。如是耳触、鼻触、舌触、身触、意触也复如是。触之因产生受，云何受？有三种：乐受、苦受和不苦不乐受。什么是乐受？贪爱所使然，贪爱引发出来的受，就是乐受。什么是苦受？嗔恚使然，嗔恚所引发出来的受。什么是不苦不乐受？愚痴使然，愚痴引发出来的受。复次，乐受能生乐，住在乐受上就能灭苦；苦受生苦，住在苦受上就能灭乐；不苦不乐受，不知苦也不知乐。</p><p>原文：<strong>受因缘爱。云何爱。眼触色生爱。乃至意触法生爱。爱因缘取。云何取。欲取见取戒取我语取。取因缘有。云何有。三种有。欲有色有无色有。下从阿鼻大泥梨上至他化自在天。是名欲有。及其能生业。云何色有。从下梵世上至阿迦尼吒天。是名色有。云何无色有。从虚空乃至非有想非无想处。是名无色有。有因缘生。云何生。种种众生处处生出。有受阴得持得入得命。是名生。生因缘老死。云何老。齿落发白多皱。根熟根破气噎。身偻拄杖行步。阴身朽故。是名老。云何死。一切众生处处退落堕灭。断死失寿命尽。是名死。先老后死故名老死。</strong></p><p>释：受觉之因出生贪爱，云何贪爱？眼根触色尘、耳根触声尘、鼻根触香尘、舌根触味尘、身根触触尘以及意根触法尘，产生贪爱。贪爱之因产生执取，云何执取？取着欲界中的生死烦恼，不肯放舍；取着我见邪见烦恼，不能弃舍；取着不是解脱之因的戒条和律则，不肯弃舍；取着内心自我的觉观，不能弃舍。执取之因产生有，云何有？欲界存在的法、色界存在的法和无色界存在的法，三种统称为有。下从阿鼻地狱上至他化自在天，就是欲界存在的法以及欲界能出生的业行。色界下从初禅天上至阿迦腻吒天所存在的法以及能产生的业行，就是色界有。从空无边处天上至非想非非想处，是无色界的存在法以及无色界产生的业行。</p><p>三有之因产生生命，云何生？种种众生在三界里处处出生，无三界有就无生命体出生，生之后有五受阴四受阴可以持身、可以进入，可以得寿命，这就是生。生之因产生老死，云何老？牙齿脱落，头发花白，皮肤多皱纹，身根老耄坏败，气力不畅通，腰身弯曲，走路必须拄拐杖，五阴身腐朽就表明老了。云何死？三界里的一切众生，在各各生存之处退落堕毁灭亡，寿命断尽，就是死。先老后死，名为老死。</p><p>原文：<strong>是中十二因缘。一切世间。非无因缘边。非天边非人边非种种等邪缘边出。菩萨观十二因缘。系心不动。不令外念。外念诸缘。摄之令还。观十二分。生三世中。前生今生后生。菩萨若得心住。当观十二分空无有主。痴不知我作行。行不知我从痴有。但无明缘故行生。如草木种从子芽出。子亦不知我生芽。芽亦不知从子出。乃至老死亦复如是。是十二分中一一观知。无主无我。如外草木无主。但从倒见。计有吾我。</strong></p><p>释：这里所说的十二因缘法，是说一切世间法相，并非是无因无缘而出生的，都是从因缘边际出生的，并非是从天边、从人边、从种种的缘边出生的，而是借助于这些种种的缘，由因而出生。菩萨观察十二因缘，系心不动，不令心念外缘他法，如果心念缘外法向外攀缘，就把心念收摄回来。观察十二因缘支分出生的三世，今世前世和后世。</p><p>菩萨如果在观行中心能住此法中，应当观行十二因缘支分都是空的，没有主人，没有真实的每一支分法。愚痴无明不知道自己是造作身口意行的因，身口意行不知道自己是因为愚痴才有的。只是因为无明的缘才产生了行，比如说草木的种子是从草木子和牙苗中出生的，种子也不知道自己能生芽，芽也不知道自己是从种子中出生的。同理，无明乃至老死也是这样，互不相知其所生。因此观察十二因缘支分中，每一支分都要观察其无主无我性，如外界的草木无主，但却以颠倒知见而记着有我。</p></div>"
},{
    "title": "第十二章　四谛三十七品十二因缘",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong><span>第十二章　四谛三十七品十二因缘</span></strong></p><p>原文：<strong>问曰。若无吾我无主无作。云何去来言说。死此生彼。答曰。虽无吾我。六情作因。六尘作缘。中生六识。三事和合。故触法生。念知诸业。由是去来言说。从是有生死。譬如日爱珠。因日干牛屎和合。方便故火出。五阴亦尔。因此五阴生。后世五阴出。非此五阴至后世。亦不离此五阴。得后世五阴。</strong></p><p>释：问说：如果没有我，无主无作，云何有色身来去和言说相，并且从此处死在彼处生？答曰：虽然没有吾我，六根作为因，六尘作为缘，中间就出生六识，三者和合，触法就出生六识，六识就能念法知法，于是五阴身的去来言说诸所有业行由此出生，那么生死也就出生了。譬如日爱珠这种生火器，因于太阳光和干牛粪和合这些方便法故，火就出生了。五阴身也是这样，因为此世的五阴出生，后世的五阴就要出生，并不是此世的五阴能到后世去，但也不离此世的五阴身，而有后世的五阴身。</p><p>原文：<strong>五阴但从因缘出。譬如谷子中芽出。是子非芽。亦非余芽边生。非异非一。得后世身亦尔。譬如树未有茎节枝叶华实。得时节因缘华叶具足。善恶行报亦复如是。种子坏故非常非一。芽茎叶等生故。不断不异。死生相续。亦复如是。</strong></p><p>释：五阴身只是从因缘中出生的，譬如从谷子中有芽生出来，谷子本身不是芽，但芽也不是从其他物中出生，谷子与芽非一非异，既有关联又不是同一体。得后世的五阴身也是这样，与今世的五阴身非一非异。譬如树木还没有长出茎节枝叶华果的时候，时节因缘具足就能生长出来了，善恶业报也是这样。种子坏掉，才能有后边的枝叶花果，所以种子不是常存不是恒一不变的；后续的芽茎叶等等由之出生，种子就是不断的，也不异于芽茎叶等等，五阴身的死生相续也是这样。</p><p>原文：<strong>行者谓法。无常苦空无我。自生自灭。知因爱等有。知因灭是尽。知尽是道。以四种智。知十二分是正见道。众生为缚着所诳。如人有无价宝珠。不别其真。为他欺诳。是时菩萨。发大悲心。我当作佛。以正真法。化彼众生。令见正道。</strong></p><p>释：修行者认为五阴世间一切法，都是无常苦空无我的，自生自灭。了知五阴身是由于贪爱等等因而有，了知把五阴身出生的因灭掉，五阴身就灭尽，了知灭尽五阴身就是道。以这四种苦集灭道的智慧，了知十二因缘各个支分是修行的正确知见道。众生都被烦恼结缚所诳惑欺骗，如人有无价宝珠，却不能识别其为真宝，被人所欺诳。这时菩萨发大悲心说：我应当作佛，以正真的法，化导这些众生，令他们得见正道。</p><p>原文：<strong>问曰。如摩诃衍般若波罗蜜中言。诸法不生不灭。空无所有。一相无相。是名正见。云何言无常等观。名为正见。答曰。若摩诃衍中说。诸法空无相。云何言无常苦空等不实。若言不生不灭空是实相者。不应言无相。汝言前后不相应。</strong></p><p>释：问说：如大乘般若波罗蜜经中说，诸法不生不灭，空无所有，都是没有相的一相（如来藏相，自性清净相），这就是正知见。云何说诸法无常苦空无我等等观念名为正见？答曰：如果大乘法中说诸法空无相，云何说诸法无常苦空等等都不是真实法？如果说不生不灭、空是实相者，不应该说无相，汝言前后不相应。</p><p>原文：<strong>复次佛说四颠倒。无常中常颠倒。亦有道理。一切有为无常。何以故。因缘生故。无常因无常缘。所生果云何常。先无而今有。已有便无。一切众生皆见无常。内有老病死。外见万物凋落。云何言无常不实。</strong></p><p>释：复次，佛说四颠倒中，众生把无常的法当作常是其中一个颠倒。这也是有道理的，一切有为法都是无常的，为什么？因为都是因缘所出生的，无常的因，加之无常的缘，所生的果如何是常的？先无而今有，有已还无，就是无常的。一切众生都能见到无常法，内有五阴身的老病死，外有万物的凋零落谢，云何说诸法无常不是真实的法理？（道理虽然真实，却不是大乘实相的实，此真实不是彼真实。）</p><p>原文：<strong>问曰。我不言有常为实。无常为不实。我言有常无常俱是不实。何以故。佛言。空中有常无常二事不可得。若着此二事是俱颠倒。答曰。汝言不与法相应。何以故。言无法。云何复言二俱颠倒。一切空无所有。是为实不颠倒。</strong></p><p>释：问说：我不说有常法是真实的，无常法是不真实的，我说有常无常都是不真实的，何以故？佛说空（空性心中一法也无，何况常与无常，都不存在。）中有常无常二事都不可得，如果着于二事皆为颠倒。（空中是指实相空性心，祂非常非无常，既常也无常，心体本是空的，不含常和无常二法。）答曰：你说的不与法相应。何以故？说是无有一切法，为什么又说有常无常二者都是颠倒？一切法空无所有，才是真实不颠倒的法。（这还是小乘的空之真理，不是大乘的究竟空之理。）</p><p>原文：<strong>若我破有常着无常。我法应破。而不实我。有常颠倒破故观无常。何以故。无常力能破有常。如毒能破余毒。如药除病。药亦俱去。当知药妙能除病故。若药不去。后药为病。此亦如是。若无常法着。应当破不实故。我不受无常法云何破。</strong></p><p>释：如果我破除有常而着于无常，我之一切法空、无所有之法就应该破除，而没有真实的我法。有常法之颠倒破除了，应当去观察无常法。何以故？无常法有大力能破除有常，如一种毒药能破除其它的毒药。如药能去除疾病，最后药也应一起去除。当知药性善能除去诸病，但如果药不除去，药也是得病的因。此常无常法也是这样，如果着无常法，应当破除，因为无常法不实故；我不接受无常法，云何破我心中的无常法？</p><p>原文：<strong>佛言。苦是四真谛中言实苦。谁能使乐。苦因是实因。谁能令非因。苦尽是实尽。谁能令不尽。尽道是实道。谁能令非道。如日或可令冷。月或可令热。风可令不动。是四真谛终不可动转。汝于摩诃衍中不能了。但着言声。摩诃衍中诸法实相。实相不可破。无有作者。若可破可作。此非摩诃衍。</strong></p><p>释：佛说，苦是四真谛中所说的真实有的苦，谁能让苦变成乐？苦因是真实有的因，谁能令真实有的因，变成非因？苦尽的修行方法是真实的方法，谁能让苦不尽？ 苦尽的修行方法是真实的道，谁能让它成为非道？如太阳可变成冷的，月亮可变成热的，风可以让它不动，这个四圣谛始终是不可动转的。汝于大乘法不能抉了，只能着于言语音声。大乘法中的诸法实相，这个实相不可破除，没有能破除的造作者。如果实相可破可制作，这就不是大乘摩诃。                                                                         </p><p>原文：<strong>如月初生一日二日。其生时甚微细。有明眼人能见指示不见者。此不见人但视其指而迷于月。明者语言。痴人何以但视我指。指为月缘指非彼月。汝亦如是。言音非实相。但假言表实理。汝更着言声。闇于实相行。若得如是正知见。观十二分和合。为因果二分。果时十二分为苦谛。因时十二分为习谛。因灭是尽谛。见因果尽是道谛。四种观果无常苦空无我。四种观因集因缘生。</strong></p><p>释：就如月亮刚刚出生一天两天，就是每月的初一初二时，其月生相很微细难见，只有明眼人能看见，然后指示于看不见者，这个看不见月亮的人，只能看见他的手指头，而不能见月。明眼人说：痴人你为什么只看我的手指头？手指头是见月亮的缘，指头并非是月亮。你也如是，言语音声并不是实相，但是要借助于言语音声表示实相之理，你却着于言声，昏昧于实相之行。如果能得到如是的正知见，观察十二因缘的和合相为因和果两个部分，结成果时十二因缘都是苦谛，在因位时，十二因缘都是集谛。因灭就是灭谛，见因果灭尽就是道谛。这是四种观行因集谛，因缘由此而生。</p><p>原文：<strong>问曰。果有四种。但名苦谛。余者无谛名也。答曰。若言无常谛复疑。苦谛亦疑。无我谛亦疑。一种难处。复次若言无常谛无咎。空非我谛亦无咎。若无常苦空无我谛。于说为重故。是故于四说一。</strong></p><p>释：问说：果有四种苦、空、无常、无我，只有苦叫作苦谛，是苦的真理，其它三种都不能叫作真谛真理。答曰：如果怀疑无常是真谛真理，怀疑苦是真谛真理，怀疑无我是真谛真理，就堕入一种难处了，世间就没有真实之理，没有真谛。复次，如果说无常谛没有过咎的话，空和非我谛也没有过咎。如果无常、苦、苦、无我谛，在言说上有重复性，因此四种谛中只说一种苦谛。</p><p>原文：<strong>问曰。苦有何异相。于三中独得名。答曰。苦是一切众生所厌患。众生所怖畏。无常不尔。或有人为苦所逼。思得无常。无有欲得苦者。问曰。有人欲得捉刀自杀针炙苦药入贼。如是种种非求苦也。答曰。非为欲得苦。欲存大乐。畏苦故取死。苦为第一患。乐为第一利。以是故离实苦得快乐。是故佛以果分独名苦谛。非无常空无我谛。</strong></p><p>释：问说：苦有什么特殊的相貌，在无常、空、无我中独独叫作苦谛？答曰：苦是一切众生所厌患的，是所有众生所怖畏的，无常却不是这样，有的人被苦所逼迫，却想得到无常法，实际上没有想得到苦的人。问说：有人想拿刀自杀，想用针刺痛自己，想吃苦药，想入贼人中，如是种种行为并不是求苦。</p><p>答曰：这些行为都不是想要得到苦，是想要求得大乐，因为害怕苦才寻求死亡。苦是众生第一害怕的苦患，乐是众生第一大利。因此离开真实的苦就能得到快乐。因此佛以果的支分，独称苦为苦谛，没有说无常、空、无我也是谛。</p><p>原文：<strong>是于四谛中了了实智慧。不疑不悔。是名正见。思惟是事种种增益故。是名正觉。除邪命摄四种邪语。离余四种邪语。摄四种正语。除邪命摄身三种业。除余三种邪业名正业。离余种种邪命。是名正命。如是观时精进。是正方便。是事念不散。是名正念。是事思惟不动。是名正定。正觉如王七事随从。是名道谛。是事一心。实信不动。是名信根。一心精勤求道。是名精进根。一心念不忘失。是名念根。心住一处亦不驰散。是名定根。思惟分别无常等觉。是名慧根。是名增长得力。是名五力。</strong></p><p>释：这样在四圣谛中明了真实的智慧，既不疑也不悔，名为正见。思惟这些事理对自心有种种增上的益处，名为正觉。除去邪命所摄持四种邪语：妄语、绮语、恶口、两舌，离开这四种邪语，摄持四种正语。除去邪命所摄持的身体三种业：杀、盗、淫，摄持色身不杀不盗不淫三种业，除去杀盗淫三种邪业，名为正业。离开其它的种种邪命活，名为正命。精进的如是观行，就是正方便。对于此事理常念不散，名为正念。对此事理如此思惟，心不动转，名为正定。</p><p>正确的觉悟如转轮圣王身后一定有七宝随从，名为修道谛。对于此理一心实信不动转，名为信根。一心精进勤求道证，名为精进根。一心念法不忘失，名为念根。心住一处不驰散，名为定根。思惟观行无常等等观念，名为慧根。五根增长，势力强大，名为五力。</p><p>原文：<strong>问曰。八正道中皆说慧念定等。根力中何以重说。答曰。随入行时初得小利。是时名为根。是五事增长得力。是时得名为力。初入无漏见谛道中。是功德名八正道。</strong></p><p><strong>入思惟道时名七觉意。初入道中观念身痛心法。常一心念。是名四念止。如是得善法味四种精勤。是名四正勤。如是欲、精进、定、慧初门。勤精进求如意自在。是名四神足。</strong></p><p>释：问说：八正道中都说正慧、正念、正定等等，在五根五力中为什么要着重说？答曰：进入四圣谛理修道的时候刚刚获得了一点功德利益，这时候就叫作根。五根势力增长以后得到更大的利益，这时候就叫作五力。最初入到无漏的四圣谛见谛中，其见谛功德叫作八正道。</p><p>从见谛道进入思惟道时，名为七觉支，初入七觉支的念觉支中，观行身、受、心、法，常常能一心观行，心念四种法，叫作四念处观。如是修行得到了善法味，起四种精勤，名为四正勤。这样想要精进修习定慧初门，勤苦精进求得各种如意自在，名为四神足。</p><p>原文：<strong>虽名四念止四正勤四神足五根等。皆摄随行时。初后少多。行地缘各各得名。譬如四大各各有四大。但多得名。若地种多水火风少处名为地大。水火风亦如是。如是三十七品中各各有诸品。</strong></p><p><strong>如四念止中有四正勤四神足五根五力七觉八道等。如是观十二分四谛行四念止四正勤四神足五根五力七觉意八正道。其心安乐。复以此法度脱众生。一心誓愿精进求佛。</strong></p><p>释：以上虽然叫作四念处、四正勤、四神足、五根、五力等等，都是根据修行时间的先后，需要用功修行的多寡，修行的层次以及所具足的缘而分别取名为这些名字。譬如地水火风各个都有四大，根据四大的组成成分，以多者而命名，如果地大种子成分多，水火风大种子少，就叫作地。水火风也是这样，自己的种子成分多其它大种少。</p><p>如是，三十七道品中各各都包括了其它道品，如四念住中含有四正勤、四神足、五根、五力、七觉支、八正道等等。如是观行十二因缘、四圣谛、四念处、四正勤、四神足、五根、五力、七觉分、八正道，心就能得到安乐。再用这些法度脱其他众生，一心誓愿精进修学，求于佛道。</p><p>总之，三十七道品的修行次第大略如下：由最初的五根修习，增长五力，之后进入八正道中，发起思惟修，修习七觉支，在念觉支中修习四念处观，得善法味，起四正勤，最后结果勤苦修习得四神足之果乐，心得自在解脱。三十七道品中每一品，不仅是意识要修习和获得，同时也熏习意根，使得意根也要修习三十七道品，并且完满具足，获得每一道品，成就四神足。</p><p>原文：<strong>是时心中思惟观念。我了了观知此道不应取证。有二事力故未入涅槃。一者大悲不舍众生。二者深知诸法实相。诸心心数法从因缘生。我今云何随此不实。当自思惟欲入深观十二因缘。知因缘是何法。</strong></p><p>释：这时心中思惟观察自己的心念，我现在心中能很清楚的观察到，修行四圣谛法不能取证四果和涅槃。由于有两个事的力量，促使我不能入涅槃中，一者是大悲心怜悯众生，我不能舍弃众生不顾；二者是我深知诸法实相，一切心法识心的心数法都从因缘而生，我如今怎么能随顺这些不实之法。我应当仔细思惟，入深定中观察十二因缘法，究竟了知十二因缘是何法。</p><p>原文：<strong>复更思惟。是四种缘。因缘。次第缘。缘缘。增上缘。五因为因缘。除过去现在阿罗汉最后心。余过去现在心心数法。是次第缘。缘缘增上缘。缘一切法。</strong></p><p><strong>复自思惟言。若法先因缘中有。则不应言是法因缘生。若无亦不应言因缘中生。生有半无。亦不应因缘生。云何有因缘。若法未生。若过去心心数法失。云何能作次第缘。若佛法中妙法无缘。涅槃云何为缘缘。</strong></p><p>释：又再思惟，有四种缘，因缘、次第缘（等无间缘）、缘缘（所缘缘）、增上缘。五因可以说为是因缘，包括：俱有因、同类因、相应因、遍行因、异熟因。除了过去现在阿罗汉的最后心，意根断除我执，不贪爱三界法，就不再引生后有，不是次第缘，其余的众生过去现在的心法和心数法，就是次第缘，能引生未来世的五蕴身。缘缘和增上缘，能辅助识心缘一切法增长一切法显现一切法。</p><p>复又思惟说，如果法原先就在因缘中存在着，不应该说这个法是从因缘中所出生的。如果法在因缘中本不存在，也不应该说法是从因缘中出生的。如果生出来的法，在因和缘二者之一中存在，也不应该说法是从因缘中出生的。如何能有因缘呢？如果法还没有出生，如果过去的心和心数法都灭去了，这些识心及心所法如何能做下一个识心的次第缘（等无间缘）？如果佛法中的妙法是无缘就能出生的，涅槃又为什么是所缘缘？</p><p>因缘，因是能引生另外法他法出现的法，缘是帮助因引生他法出现的法。比如甲打乙是因，当二人再次相遇是缘，这时就引生出来乙对甲的报复，也同样打了甲，乙打甲就是因缘所生法。因和缘都是出生他法的方便因，犹如导火索。一切法最根本的因是万法出生的出处如来藏，包括因和缘两个法都是最根本因如来藏出生的。</p><p>次第缘，也叫作等无间缘，同等同样的法相等无间断次第的一个一个出生灭去，以引生下一个同样的法出生。比如识种子，前一个识种子（如意识的识种子）出生在某处某尘上，然后灭回去，下一个同样的识种子（意识）在同处出生，再灭回去，再一个识种子在同一个处所尘上出生，再灭回去。这样同等同样的识种子连续不断的在同一个处所出生灭回去，就形成了连续不断的识心活动。心所法也是这样。</p><p>所缘缘，所与能对应，能是有主观能动性的七识心，七识心能缘一切法，尤其是六尘境界，是能缘的心；所缘就是一切法或者是六尘境界。所缘缘就是一切法生起的缘，六尘境界生起的缘。</p><p>增上缘，能帮助出生此法的其他一切助缘，除了自身之外。</p><p>原文：<strong>若诸法实无性。有法不可得。若因缘果生。因此有彼。是说则不然。若因缘中各各别。若和合一处。是果不可得。云何因缘边出果。因缘中无果故。</strong></p><p><strong>若因缘中先无果而出者。何以不非因缘边出果。二俱无故。果属因缘。因缘边出。是因缘不自在。属余因缘。是果属余因缘。云何不自在。因缘能生果。是故果不从因缘有。亦不从非因缘有。则为非果。果无故。缘与非缘亦无也。</strong></p><p>释：如果说诸法确实都没有其自体性，三界的有法就不可得。如果说有因有缘，因缘和合，就有一个果出生了，因此就有另外一个法出生，这个说法其实是不对的。如果因与缘都不相同，各有各的特征，二者和合一起，是不可能出现什么果的，怎么说是因缘边际出生了果呢？因与缘中都没有果故。（此因缘都是缘，实际上出生果的是根本因如来藏。）</p><p>如果因与缘中原来没有果而能有果出生者，为什么不在非因非缘边出生果呢？非因非缘二者中都没有果故（比如父母和合，出生孩子，父亲身体当中没有孩子，母亲身体当中没有孩子，和合后也不可能有孩子。父精中没有受精卵，母血中没有受精卵，精血和合也没有受精卵。一定是另外一个因，在因缘和合中出生了受精卵和孩子，这个因就是如来藏）。果是属于因缘边际的，在因缘边际出生，这些因缘也是不自在的，因此果属于其他因缘。既然果在其他因缘边出生，云何不自在？因缘能生果，因此说果不是从因缘中生的，也不是从非因缘边生的。所以说本没有果。因为根本没有果，因与缘也不存在。</p><p>原文：<strong>问曰。佛言十二因缘无明缘诸行。汝云何言无因果。答曰。先以被答不应更难。若难者更当答。佛言眼因色缘。痴边生。邪忆念痴是无明。是中无明何所依住。若依眼邪。若色中若识邪。不应依眼住。若依眼住。不应待色常应痴。若依色住。不应待眼。是则外痴。何豫我事。若依识住。识无色无对。无触无分无处。无明亦尔。云何可住。</strong></p><p>释：问说：佛说十二因缘法无明缘行，你为什么说没有因果？答曰：以前已经答过了，不应该再来非难，若再来非难，就再次回答。佛说以眼根为因，以色尘为缘，眼识在愚痴边出生，邪心忆念法的愚痴性就是无明。这里的无明依着什么法而住着？是依着眼根而住，还是依着色尘中住还是依着眼识中而住着？不应该依着眼根而住着。如果是依着眼根而住着，不应该等待色尘出现的时候而住，应该是常常愚痴的。</p><p>如果愚痴是依着色尘而住，不应该等待眼根的出现才住着。因此说愚痴是外界的愚痴，跟我有什么关系？愚痴如果是依着识心而住，识心没有色相，没有相对法的存在，没有触没有支分，也没有处所，无明也是这样，云何可住？</p><p>原文：<strong>是故无明非内非外非两中间。不从前世来。亦不住后世。非东西南北四维上下来。无有实法。无明性尔。了无明性。则变为明。一一推之痴不可得。云何无明缘行。如虚空不生不灭不有不尽。本性清净。无明亦如是。不生不灭不有不尽。本性清净。乃至生缘老死亦尔。菩萨如是观十二因缘。知众生虚诳系在苦患。易度耳。诸法若有实相。难可得度。思惟如是。则破愚痴。</strong></p><p>释：是故无明非内非外非在两中间，不从前世来，也不住后世，非东西南北，四维上下而来。没有实法存在，无明性也是这样。了了无明性，就变为明了。从以上一一推论，愚痴不可得，云何有无明缘行？如同虚空一样，不生不灭、不有不无，本性清净，无明也是这样，不生不灭不有不无，本性清净。乃至于说十二因缘最后的生缘老死也是这样。</p><p>菩萨如是观行十二因缘，了知众生虚诳被系缚在生死苦患当中，众生是容易度脱的。诸法如果是有实相的，是真实的，那么众生是难于度脱的。如是思惟，则破除了愚痴无明。</p></div>"
},{
    "title": "第十三章　菩萨修行法门",
    "author": "生如法师",
    "date": "2021年11月01日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章　菩萨修行法门</strong></p><p>原文：<strong>若菩萨心多思觉。常念阿那波那。入时出时数一乃至十。一一心不令驰散。菩萨从此门得一心。除五盖欲行。</strong></p><p><strong>菩萨见道应行三种忍法。生忍柔顺法忍无生忍。云何生忍。一切众生或骂或打或杀。种种恶事。心不动转。不瞋不恚。不唯忍之。而更慈悲。此诸众生。求诸好事。愿一切得。心不舍放。是时渐得解。诸法实相。如气熏着。</strong></p><p>释：如果菩萨心里思想觉观杂念很多，应当常常修习阿那般那数息法。入息再出息时数一至十，每次数息时，都不令心驰散。菩萨从这里入门，得到一心的初禅定，除去贪欲、嗔恚、睡眠、掉举、散乱五盖和淫欲行。</p><p>菩萨见道应该修行三种忍：生忍、柔顺法忍和无生忍。云何无生忍？一切众生或骂或打或杀，种种恶事相加，心不动转，不嗔不恚，不仅仅是忍受，而且还要慈悲于众生。此诸众生如果想求一切好事，祝愿他们一切得成，心不舍弃众生。这时就渐渐得解诸法实相，如气熏染着。</p><p>原文：<strong>譬如慈母爱其赤子。乳哺养育。种种不净。不以为恶。倍加怜念。欲令得乐。行者如是。一切众生。作种种恶。净不净行。心不增恶。不退不转。复次十方无量众生。我一人应当悉度。使得佛道。心忍不退不悔不却。不懈不厌不畏不难。是生忍中。一心系念。三种思惟。不令外念。外念诸缘。摄之令还。是名生忍。</strong></p><p>释：譬如慈母爱恋其子，乳哺养育，其子种种的不清净物，母亲不但不会嫌恶，而且还会加倍的怜爱和挂念，想要其子得到快乐。行者也如是，一切众生造作种种恶事，不管清净行还是不清净行，心里都不憎恶，度脱之心不会退转和动摇。复次，十方无量众生，我发愿一人全部度脱，使令都得佛道，对此内心坚忍不退却，不悔恨不畏怯，不懈怠不厌倦不畏难。在此生忍中一心系念此三种思惟，不令心外念他缘，如果心外念他缘，发觉之后马上再收摄回来，这就是生忍。</p><p>原文：<strong>云何柔顺法忍。菩萨既得生忍。功德无量。知是功德。福报无常。是时厌无常。自求常福。亦为众生。求常住法。一切诸法。色无色法。可见不可见法。有对无对法。有漏无漏。有为无为。上中下法。求其实相。实相云何非有常非无常。非乐非不乐。非空非不空。非有神非无神。</strong></p><p>释：什么是柔顺法忍？菩萨得到了生忍的无量功德之后，知道此功德福报的无常性，这时应该厌离无常法，寻求有常之福，也要为了众生寻求常住法。一切诸法，色法和无色法，可见之法和不可见之法，有对法和无对法，有漏法和无漏法，有为法和无为法，上中下法，都要求得其真实相，不要停留在虚假的表相上。应该要追究这些法的真实相为什么是非有常非无常、非乐非不乐、非空非不空、非有神非无神的？（这里的实相还是小乘的真实理，不是指大乘的实相如来藏之理。）</p><p>原文：<strong>何以故非有常。因缘生故。先无今有。故已有还无故。是故非有常。云何非无常。业报不失故。受外尘故。因缘增长故。非无常。云何非乐。新苦中生乐想故。一切无常性故。缘欲生故。是故非乐。云何非不乐。乐有受故。欲染生故。求乐不惜身故。是非不乐。</strong></p><p>释：为什么非有常？因为一切法都是因缘生故，原来没有后来出生之法。所以还会灭去，因此不是常法。为什么也不是无常？因为业报不失，必受报故（受报之前是无常，即使在受报之时也是无常，受报之后更是无常），容受外尘的缘故（也是无常），因缘不断增长的缘故，所以是非无常（仍然是无常）。云何是非乐的？五阴是贪欲染污法而出生的缘故，是非乐的。为了得到快乐，不惜身命故，也是非无乐的（有乐）。</p><p>原文：<strong>云何非空。内外入各各受了了故。有罪福报故。一切众生信故。是故非空。云何非不空。和合等实故。分别求不可得故。心力转故。是故非不空。云何非有神。不自在故。第七识界不可得故。神相不可得故。是故非有神。</strong></p><p><strong>云何非无神。有后世故。得解脱故。各各我心生。不计余处故。是故非无神。如是不生不灭。不不生不不灭。非有非无。不受不着。言说悉灭。心行处断。如涅槃性。是法实相。于此法中信心清净。无滞无碍。软知软信软进。是谓柔顺法忍。</strong></p><p>释：云何是不空的？对内外十二入的受都很清楚的缘故，确实有罪福报的缘故，一切众生都相信的缘故，因此说不是空。云何非不是空？一切法确实是因缘和合而生故，分别推求这些法都不可得故，是靠识心的攀缘力运转出来的缘故，因此说非不是空，是空的。云何非有神识？因为第七识不自在故，第七识界不可得故，第七识的相貌也不可得故。因此说非有神识。</p><p>云何非无神识？因为有后世五阴身故就有第七识，五阴身能得解脱故，就是第七识解脱，各各众生都有我心生，第七识执我不计他处故，因此说并不是没有神识。如是不生不灭、非不生非不灭、非有非无，既不受法也不执著法，灭去所有的言说相，心行处于寂灭的境界，如寂静的涅槃境界一样，这就是诸法的实相。在修学这些法中，有清净的信心，对于实相法心无滞碍，以柔软心知法信法精进学法，这叫作柔顺法忍。</p><p>原文：<strong>云何无生法忍。如上实相法中。智慧信进。增长根利。是名无生法忍。譬如声闻法中暖法顶法。智慧信精进。增长得忍法。忍者忍涅槃。忍无漏法。故名为忍。新得新见。故名为忍。法忍亦如是。时解脱阿罗汉。不得无生智。增进广利转成。不时解脱。得无生智。</strong></p><p>释：什么叫作无生法忍？于如上所说的实相法中，慧根信根精进根增长，根性利顿，名为无生法忍。譬如声闻法中在暖法和顶法阶段，智慧根、信根、精进根得到增长，就得到忍法。所谓的忍就是能忍于寂静的涅槃法，忍于无贪嗔痴一切烦恼法。刚刚得知刚刚证得刚刚见法，名为忍。无生法忍也是如此。待时解脱的阿罗汉没有得到无生智，后时再修行甚深禅定时，智慧不断增进广大，不用等到临命终时再取得解脱，这时就得到了无生智。</p><p>原文：<strong>无生法忍亦如是。未得菩萨果。得无生法忍。得菩萨真行果。是名菩萨道果。是时得般舟三昧。于众生中得大悲。入般若波罗蜜门。尔时诸佛便受其号。堕生佛界中。为诸佛所念。一切重罪薄。薄者灭。三恶道断。常生天上人中。名不退转。到不动处。末后肉身尽。入法身中。能作种种变化。度脱一切众生。具足六度。供养诸佛。净佛国土。教化众生。立十地中。功德成满。次第得阿耨多罗三藐三菩提。为菩萨禅法中初门。</strong></p><p>释：无生法忍也是这样，没有证得菩萨的果德时得到的是无生法忍，证得菩萨真正的修行果德时名为菩萨道果。这时候通过实际修行证得了般舟三昧，对众生能生起大慈悲心，入到般若波罗蜜门中。尔时诸佛便授予菩萨法号，进入佛法界中，为诸佛所护念。自身中一切重罪转轻，轻罪转灭，三恶道断绝，未来常常出生在天上和人间，名为不退转的菩萨。修到八地不动地时，最后的肉身了断，入到法身中，能作种种的自在变化，度脱一切众生。以具足六度波罗蜜的功德来供养诸佛，清净佛国土教化众生，于十地修道位次第功德圆满，得成阿耨多罗三藐三佛陀。以上为菩萨禅法中的最初入门处。</p><p>原文：</p><p><strong>行者定心求道时    常当观察时方便</strong></p><p><strong>若不得时无方便    是应为失不为利</strong></p><p><strong>如犊未生允牛乳    乳不可得非时故</strong></p><p><strong>若犊生已允牛角    乳不可得无智故</strong></p><p><strong>如钻湿木求出火    火不可得非时故</strong></p><p><strong>若折干木以求火    火不可得无智故</strong></p><p>释：行者坚定信心求道的时候，应当常常观察时节是否合宜，因缘是否成熟，是否有方便的手段。如果不到证得的时节，没有方便的方法，这时候贸然求道就要失利而不能得利。譬如牛没有生牛犊时去吸允牛乳，牛乳是不可得的，时节不对故。如果牛已经生出了牛犊，这时候去吸允牛角，也同样得不到牛乳，没有智慧故。譬如用钻隧钻湿润的木头想出火，火不可得，时节不对故。如果用拗折干木头的方法想取得火，火也是不可得的，没有智慧故。　　　</p><p>原文：</p><p><strong>得处知时量己行    观心方便力多少</strong></p><p><strong>宜应精进及不宜    道相宜时及不宜</strong></p><p><strong>若心调动不应勇    如是勇过不得定</strong></p><p><strong>譬如多薪炽大火    大风来吹不肯灭</strong></p><p><strong>若能以定自调心    如是动息心得定</strong></p><p><strong>譬如大火大风吹    大水来浇无不灭</strong></p><p>释：在应该得处，要知时节因缘是否合适，量度自己的定力三昧力是否具足，观察自心的方便力有多少。思惟这时是应当于法精进修习还是不应当精进，这时候是应当得道还是不宜得道，都要清楚了知。如果这时心里还是散乱调动不已时，不应该勇猛精进，过于勇猛精进也不能得定。譬如众多的薪柴燃烧起了大火，如果有大风来吹火，大火肯定不能灭，这时如果自己以定力来调心，这样调动气息心就能得定了。譬如用大风来吹拂大火，越吹火势越大，如果用大水来浇灭，大火就会都灭了。</p><p>原文：</p><p><strong>若人心软复懈怠    如是厌没不应行</strong></p><p><strong>譬如少薪无焰火    不得风吹便自灭</strong></p><p><strong>若有精进勇猛心    如是转健得道疾</strong></p><p><strong>譬如小火多益薪    风吹转炽无灭时</strong></p><p><strong>若行放舍止调缩    设复发舍失护法</strong></p><p><strong>譬如病人宜将养    若复放舍无得活</strong></p><p>释：如果人的心力弱而又懈怠，这时不应该让心止息，应当勇猛精进修行。譬如少少的薪柴没有多少火苗，不用风吹就会灭去。如果有精进勇猛心，心力就会强大起来，很快就能得道。譬如小火就要多加薪柴，再用风吹，火势就会越来越旺，不会灭去了。这时不应该修行放舍，不应该修止调息收缩心识，因为如果想再起心时，就没有了护法的力量。譬如病人应当将养时，如果把他放舍不管，他就不能活了。</p><p>原文：</p><p><strong>若有舍想正等心    宜时勤行得道疾</strong></p><p><strong>譬如有人乘调象    如意至凑无踬碍</strong></p><p><strong>若多淫欲爱乱心    是时不应行慈等</strong></p><p><strong>淫人行慈益痴闷    如人冷病服冷药</strong></p><p><strong>淫人心乱观不净    谛观不净心得定</strong></p><p><strong>行法如是相应故    如人冷病服热药</strong></p><p>释：如果有不喜不厌的舍心念想，有正等心，应该勤行精进，快速得道。譬如有人乘坐调御好的大象，就能顺心如意的到达目的地，没有障碍。如果一个人淫欲心多，贪爱的烦恼乱心，这时候不应该修行慈心三昧等，因为好淫欲的人修行慈心，会增加他的愚痴和迷闷。就像人得了冷病，却给他吃冷药一样不合时宜，只会增加其病。淫欲多的人心乱，应当修习不净观。仔细观察色身的不净相，心就能得定了。修行的方法应当这样相应，相应的修行方法就如人冷应当吃热药一样，这样对治才得当。</p><p>原文：</p><p><strong>若多瞋恚忿乱心    是时不应观不净</strong></p><p><strong>瞋人观恶增恚心    如人热病服热药</strong></p><p><strong>若人瞋怒行慈心    行慈不舍瞋心灭</strong></p><p><strong>行法如是相应故    如人热病服冷药</strong></p><p><strong>若多愚痴心闇浅    不净行慈悲行法</strong></p><p><strong>二行增痴无益故    如人风病服麨药</strong></p><p><strong>人心痴闇观因缘    分别谛观痴心灭</strong></p><p>释：如果一个人多于嗔恚，恼怒乱心，这时候不应该修行不净观，好嗔恚的人观察恶相会增加嗔恚心，如人得热病却吃热药一样不对症。如果人喜嗔怒，应该修行慈悲心，修行慈悲不弃舍，嗔心就灭。修行的方法应该这样才能相应，如人的热病吃冷药一样对症。如果一个人愚痴多，心多暗闭浅薄，那么不净观和慈悲观的两种修行方法，只能增加其愚痴，无有利益，如人得风病却服麨药一样。人心愚痴黑暗应该观察因缘法，十二因缘每一支分别仔细观行，就能灭除愚痴心。</p><p>原文：</p><p><strong>法行如是相应故    如人风病服腻药</strong></p><p><strong>譬如金师排扇炭    用功非时失韛法</strong></p><p><strong>匆匆急韛不知时    或时水浇或放舍</strong></p><p><strong>金融急韛则消过    未融便止则不消</strong></p><p><strong>非时水浇金则生    非时放置则不熟</strong></p><p><strong>精进摄心及放舍    应当观察行道法</strong></p><p>释：修行佛法应该如此相应，如人得风病应该服用腻药一样。譬如炼金师烧炭炼金，加工时间不当，掌握不了火候，就冶炼不出黄金。匆匆急火不知时宜，有时用水浇注有时放舍不管，金矿消融后用急火，黄金便融化过头，金矿没有消融时便停碳，黄金则不能消融。不到浇水时浇水，金就生而不熟，放置时间不合宜黄金也不熟。修行也是这样，什么时候应该精进摄心，什么时候应该放舍身心，应该好好观察仔细观察，究竟如何行道才合时宜。</p></div>"
}]