[{
    "title": "意根的忏悔文",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>意根的忏悔文</strong></p><p><strong>忏悔自己  从于无始  以至今生</strong></p><p><strong>从无停歇  窃取佛陀  所有宝藏</strong></p><p><strong>愚痴狂妄  据为己有  普遍计较</strong></p><p><strong>执著一切  不知一切  原本佛陀</strong></p><p><strong>何有自己  我与我所  见利忘义</strong></p><p><strong>不知恩养  因为执取  从没逃脱</strong></p><p><strong>业障深坑  世世贫困  生生苦难</strong></p><p><strong>忏悔自己  从于无始  以至今生</strong></p><p><strong>分别一切  执以为我  我见我慢</strong></p><p><strong>我爱我痴  恒审思量  遍计所执</strong></p><p><strong>执见为我  执闻为我  执嗅为我</strong></p><p><strong>执尝为我  执触为我  执识为我</strong></p><p><strong>执我能做  一切事业  执我能别</strong></p><p><strong>一切法理  执我能成  无比德尊</strong></p><p><strong>今日乃知  其实自己  一无所是</strong></p><p><strong>忏悔自己  从于无始  以至今生</strong></p><p><strong>执我根身  执我器界  执我神通</strong></p><p><strong>执我德能  执我成佛  执我弘法</strong></p><p><strong>执我度众  今日乃知  其实自己</strong></p><p><strong>一无所能  我从从前  妄执世俗</strong></p><p><strong>直至如今  妄执出世  如此妄执</strong></p><p><strong>深切感知  世尊不会  予我授记</strong></p><p><strong>盼望授记  偷心不死  何时能登</strong></p><p><strong>无上宝座  从今以后  何去何从</strong></p><p><strong>窃贼君子  我要选一  洗心革面</strong></p><p><strong>改过自新  归还一切  非我之物</strong></p><p><strong>净裸赤洒  任运逍遥  无为去也</strong></p></div>"
},{
    "title": "序言 推崇意根就是推崇实证",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>序　言</strong></p><p><strong>推崇意根就是推崇实证</strong></p><p>为什么在末法时期，要多多演示意根的体性功能作用，并且与意识尽量区别开呢？因为末世众生心多浮躁，善根轻鲜，贪欲重，福德薄，世事忙乱导致持戒难，修定也难，心无法清净下来。学佛人普遍都以学知识为主，往往把学来的理论，把意识的情思意解当作实证，把猜测推理研究出来的结果当作实证，自误再去误人，共造大妄语业，共堕三途火炕。如果懂得意根的体性，就会知道实证的相貌，与情思意解的区别，懂得实证的机关枢纽和要害，就会避免步入此类误区，不至于犯下大妄语的罪业。</p><p>佛陀时代的众生善根福德深厚，烦恼轻微，心地清净，定力强，学完理论就能自动自觉深细思惟观行，实证相对来说比较容易。因为有甚深禅定，所学之法都能深入到意根深处，只要证果就是真证，不是意识的假证，再有佛陀把关印证，佛陀的智慧神通无量，印证准确无误不会有任何差池。</p><p>即使明清之前的出家在家众，也多有甚深禅定，修定环境条件比较好，尤其是唐宋朝时期，学佛人都讲究禅定，有禅定就有能力观行思惟，只要所学理论正确，实证相对也容易一些，情思意解的现象非常少，如果证就是实证，唯独经书理论难得。所以那时候的众生可以不知道意根的功能作用，仍然能实证。</p><p>如今世间的修学环境，很多人都无法持戒，无法修定，只能以学理论知识为主，这样就无法实证。不能实证，就不能践行，多是口头禅，道理说得头头是道，口若悬河，心却不与道相应，贪嗔痴仍然盛行。没有禅定，烦恼都降伏不了，压伏不住，何谈断烦恼？因此佛教团体内部比世俗界还要混乱，斗争还要激烈，不仅执著世俗界的名闻利养，还要执著佛法上的个人利益，以至于烦恼甚于世俗界。</p><p>在这“圣人”满天飞、欲望横流的时代，有必要强调持戒和禅定，有必要强调意根的实证，避免众生未证言证，命终不堕于三途，不危害其他学子相将入火炕。</p></div>"
},{
    "title": "第一章 意根的概念",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  意根的概念</strong></p><p>一、根是能生义，意根不仅是生意识的根，也是能生万法的根。生的功能是如来藏，如来藏依止意根这个根才能出生意识，出生一切法，没有意根这个根，一切种子都不能发芽。</p><p>意根不是大脑和神经系统，大脑和神经系统都是物质色法，属于身根，是有色根。前五根都是有色根，有形有相，而意根是无色根，无形无相，属于心，是心法，不是由四大组成的物质色法。祂有心的功能和作用，是时时处处做主宰的心。因此意根是有精神生命的，意根在，身体就能有如来藏的执持，不烂坏，是众生。众生死亡时，只有意根不灭，才能有中阴身，在中阴身里意根就带着如来藏去投胎。</p><p>意根是识，祂有识的功能作用，有识的力量，是产生一切万法的动力。只要有意根的存在，即使没有六识的六种功能作用，也是活人，不是木石。比如在无想定和灭尽定中没有六识，没有六识的功能，却不是死亡。阿罗汉出了灭尽定，还能够托钵乞食，睡着无梦、正死位、昏迷时，都没有六识的功能，但有意根的存在，因此这些时候也是活人。众生生生世世的生死轮回，是由意根的无明所决定的，由意根的执著和攀缘所产生的，也是由于众生的业力所牵引出来的，其轮回原理就是十二因缘法：无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死忧悲苦恼。</p><p>二、有人说意根是心脏，也有人说意根是大脑，如果说意根是心脏，心脏毁坏了，意根也就不存在了。如果有人做心脏移植手术，意根是否也跟着移植呢？如果意根也跟着移植，就会有人有两个意根，有的人一个意根也没有，有的众生就会有九个识或者七个识。众生如果有两个意根，就有两个作主宰的识心，这样众生就会心理错乱，无所适从了；而另一个没有意根的人，就要入灭，永远不再出生。</p><p>众生如果没有意根，就没有作主宰的心，那么六神就无主，一切法都不会现起，也不会有六神，六识都不会出生了。因此说意根是心脏是不对的，说是大脑也不对，大脑也是物质色法，意根不是色法，而是心法，祂又不随着色身的毁灭而毁灭，能长存到未来世无量劫不灭。</p><p>意根是个特殊的根，与前五根不同，祂不是物质色法，而是属于心法，其它五根才是物质色法。意根既有根的功能作用，也有识的功能作用，是能去到未来世的根和识。因此众生死亡以后，意根不灭，因为贪执五阴身，就会依赖着如来藏形成中阴身，在中阴身里，再与如来藏一起去投胎，拥有下一世的五阴身。意根如果灭了，众生就会处于无余涅槃当中，不再有六根六尘和六识，也就没有众生存在了，只有断尽烦恼的阿罗汉才愿意灭掉意根，也有能力灭掉意根自己。</p><p>凡夫没有能力灭掉意根，因为一念无明和贪嗔痴烦恼俱在，生死轮回苦就没有能力断除。众生在生死当中无量劫，意根从来也没有断灭过，生生世世都在执著五受阴，贪恋世俗法，因此必有下一世的出生，生死根无法斩断。而有能力灭尽意根的地上菩萨，却不愿灭尽意根，不愿灰身泯智躲避生死苦，都发愿在三界世间自利利他，宁愿受些世俗微苦，也要在佛道上勇往直前，同时救度众生，得离生死苦，共同成就佛道。因此菩萨的心量广大无边，远远超胜于阿罗汉，因此叫作大心菩萨。</p><p>三、意根无始劫以前就存在着，通过修行可以灭除，祂不是不灭之法。如来藏刹那刹那出生意根的识种子，形成了意根连续不断的运行状态，因此说意根也是生灭性的。意根的心行变异不停，识种子生灭不停，无明经常转变，烦恼也是生灭不已，因此说意根是无常的，苦的。意根是被如来藏出生的，是生灭性的，因此是空的，幻化的；生灭变异就是苦，不能永远常一就是苦。</p><p>四、意根以及其它五根是从哪里来的？五根是在母胎中时，由如来藏输出地水火风四大种子逐渐变现出来的，是原来没有后天出生的法；生出来以后，也要不断的生长，而后逐渐变异，最后就会灭失的生灭变异无常之法，是不久住，不可靠之法。意根是如何出生的？意根是无始劫以来就一直存在着的，需要依赖如来藏输送识种才能运转，四果罗汉断我执命终就能灭掉入无余涅槃，也是生灭无常之法，五阴也就能全部灭尽了，只剩下如来藏清凉寂静地存在着。因此意根也是不自在之法，需要依赖如来藏才能存在，三界世间的缘灭了，意根也就灭了。</p><p>意根无始劫来一直存在，是因为祂存在的时间太久远，找不到一个开始的时间点，没有最初的开始，因此才有无始劫以来的生死流转，否则就只有如来藏湛然常住，不会有众生五阴身的出现。阿罗汉在无余涅槃灭了意根以后，如来藏在世间因缘具足时，还可以再出生意根，然后再生出五根，五阴具足，生命体就会再次出现。因此阿罗汉在化城里休息一下，还是要再出来，那不如一开始就修行菩萨道，不必绕这么大的弯路，白白耽误了那么长时间，以为不受苦就好了，结果还是不究竟，未了的业还要去了结，未破的无明还要去破除，取了无余涅槃反而不划算了，所以佛说他们是愚人。</p><p>五、俱生是与生俱来的意思，生命存在之时就有的叫作俱生。俱生我执、俱生烦恼都是指意根与生俱来的执我性和贪嗔痴慢等等烦恼，无始劫以来就带有执我的习气，就有贪嗔痴慢诸多烦恼。意根与业种相应，无始劫以来造业收存的是什么样的种子，意根就显现为什么样的心行，并且能促使种子变成现行，能主导意识的心行与业种相应。而意根是不随生命的出生而生的，是伴随着每一期生命每一种生命形式而一直存在的，与生命俱，叫作俱生。意根无始劫以来因为无明的遮障，一直执五阴身为我为我所有，所以叫作俱生我执。</p><p>俱生我执是无始时来，意根持续虚妄熏习五阴为我的邪见，执着五阴的习气一直伴随着每一世的五阴。而意识每一世都是新的，不能与往世的记忆相应，没有俱生我执，其我执性既受先天意根的影响和带动，也受后天环境的熏染。意识受意根的习气所牵引，比如见到过去世的仇人，意识并不认识和了解此人，但就是不喜欢这个人，心里不知道是什么原因，这是意根牵引意识动起嗔心的。</p><p>意识没有俱生性，婴儿刚出生时甚至在母胎里的意识都是新生的全新的，不带过去世和无始劫以来的烦恼和习气。对于此世的一切法都要重新学习才能掌握，只是掌握的程度和快慢还是与累世的业种有关，由意根和业种的熏染促成。意识一方面要受此世的生存环境的熏染，随缘生起善恶性和非善恶性的心所法；另一方面要受意根的熏染，意根善则意识善，意根恶则意识恶。</p><p>因此说，当意根生起贪嗔痴烦恼时，很多时候不由意识分说和选择，意根就要主导意识莫名其妙的出现贪嗔痴烦恼的心行，造作贪嗔痴烦恼业行，意识的理智有时无法起到应有的作用。当业种现行出来，意根的情绪和习气现行出来，意识即使有理智，也难于招架，更何况极多数人的意识是没有理智的，那烦恼就要泛滥起来了。</p><p>六、潜意识，就是意根末那识的一个别名，是意根的代名词。因为佛教界之外的普通众生不知道有意根末那识，就把意根的功能作用说为是意识的另外一种功能作用，说为是潜藏的意识的功能，叫潜意识。把意根和意识混淆在一起不分，是佛门外人士所说，这正是不懂意根和意识的区别的无知表现。而佛教界尤其是唯识系就说意根是末那识，是有别于意识的另一个识，把意根的功能作用单独提出来，不与意识混淆在一起。这样区分意识和意根才能有大智慧，这是有智慧的专家的说法，也是佛陀所说。</p><p>没有定力和智慧，根本就观察不到意根的作用，心太粗了。意根的能力不是一般人能发现的，意根的能力都知道的人，是佛世尊，能观察意根运作的人，是地上菩萨。七识里，能力最大的是意根，叫作第二能变识，其次才是意识，叫作第三能变识，五识也在第三能变识里，与意识合一起。意根的力量和主导作用是相当大的，三界万法都是意根发动出来的，意根彻底转变，自己就成佛，意根的染污极重时，活着就能入到地狱里。</p><p> 七、马鸣菩萨所造《大乘起信论》中对意根的定义：“此意复有五种异名，一名业识，谓无明力不觉心动。二名转识，谓依动心能见境相。三名现识，谓现一切诸境界相；犹如明镜现众色像，现识亦尔，如其五境对至即现，无有前后，不由功力。四名智识，谓分别染净诸差别法。五名相续识，谓恒作意相应不断，任持过去善恶等业，令无失坏；成熟现、未苦乐等报，使无违越；已曾经事忽然忆念，未曾经事妄生分别。”</p><p>这是说意根有五种异名：</p><p>（一）意根是业识，与业力相应，因为无明业力的作用，意根不觉悟而起念想，心就动转向外攀缘了，作意、受、想、思心所现前，如来藏配合之，就产生相应法，三界法出生，五阴身出生。意根的念想以思心所的活动为主，如来藏了别意根的念想，就会尽量成就意根的念想；如果种子具足，如来藏一定能实现意根的念想。</p><p>所以意根如果心不动，思心所不出现，如来藏不会配合满足意根的需求和念想，法就不会出现。心动是什么意思？意根有了想法，有了愿望，思心所现前，想要造作，如来藏了别以后配合思心所，才出生三界法。而且无明业力在无始劫以前就存在着，与意根相应，促使意根生心动念，想要向外贪求，想要了别外界，如来藏配合，出生宇宙器世间，然后又出生五阴。这在楞严经里世尊讲过了。</p><p>（二）意根是转识，转是流转动转的意思，意根因为无明业力的缘故，起心贪求，故流转于三界世间，流转于六道。意根心一动转，如来藏随之变现一切法，境界相现前，意根了别，之后六识出生，境界就在六识心中显现出来，身口意行现行，业行出现，业种收存，生死相续。</p><p>（三）意根是现识，是第二能变识，能促使如来藏变现出一切法，如来藏依之思心所而变现一切法，如镜子中的火，无有实义，无有燃烧义，因为是带质境，不是真实的外界的五尘相分。</p><p>（四）意根是智识，有一定的智慧性，有了别慧，有分别性，能知法，不仅能了知六尘法，也能了知六尘外的法，只要是自己的如来藏能变，意根就能了知，了知的都是相似于本质境的法。不仅知现世的法，还能知前世的法，也能知后世的法；天上地下一切法都能同时知，其智慧也不可测量，意识远远比不上。意识只是了别六尘境界比较微细，细节都能了知，意根不能了知细节和微细法，只能了别粗况和大略情形，然，这已足够。</p><p>（五）意根是相续识，生生世世相续不断，如果不入无余涅槃，意根与如来藏一样永远不灭，同等寿命，都是无量寿。因为有意根相续不断，能带无始劫的业力种子来到后世，世世与业种相应，与业力相应，能让如来藏不断实现业因果报，而由自己承受。</p><p>意根，已曾经事，忽然忆念，未曾经事，妄生分别。意根对于自己曾经经历过的事情，忽然就能忆念出来，然后提醒意识，警觉意识，让意识了别细节，意识就有回忆、回想、散乱等现象发生，都是意根攀缘的结果。</p><p>意根对于没有经历过的事情，也同样会虚妄的产生分别，想要了知，根据如来藏所现起的一些缘，能知未来要发生的事情，有未卜先知的本事，能预测事情的发生，从而让意识心有所防备。正因为意根有忆念功能，祂才能把从前自己经历过的事情显现出来，让意识了别。意识多数情况下，不具备了别六尘之外法的能力，祂猜测意根的心思，只是偶尔能猜测准确，很多时候都是一无所知。</p></div>"
},{
    "title": "第二章　意根的遍计所执性",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　意根的遍计所执性</strong></p><p>一、意根的另一个体性是遍计所执性，与《楞严经》里说的意根默容一切法有一些关联。什么叫作一切法？什么叫作默容一切法？一切法包括了如来藏所出生和变现的所有法，全部都包括进去，没有一丝遗漏。一切法都是如来藏所产生出来的，它包括的范围非常广泛，包括有为法和无为法，包括了色法和心法，包括了染污法和清净法，包括了过去和未来。三界世间里所有的法都包括，也包括出世间的法，世出世间法都包括了，这就是一切法，都是如来藏所产生的，总体来说就是一真法界。如来藏产生出来以后，意根都能缘到，然后就默容容受下来。</p><p>意根能够遍缘如来藏产生的一切法，只要如来藏产生一个法出来，意根就能缘到，能了别到，这说明意根普遍的缘着一切法，然后普遍地执取一切法。所谓的遍，就是遍六根、六尘、六识、遍十八界，遍宇宙器世间，遍五阴十八界，遍三界世间和出世间的一切法，以及遍色法和心法，遍过去和未来。</p><p>二、意根有遍缘、遍容的体性，即遍缘又默容，所以意根具有遍计所执性。因为无始劫以来，意根一直随逐着如来藏而存在，祂从来没有灭过，如果不是四果罗汉，而且是不回心菩萨道的四果罗汉，意根永远不会灭去，甚至到成佛的时候，以及成佛以后，意根也从不会断灭过一次。</p><p>那祂存在时，就要遍计所执一切法，普遍的计度、执著一切法，默容一切法。计，就是计度，就是计较、执取、攀缘。祂这个体性，并不是在一切位阶都存在，凡夫和贤人的意根肯定都有遍计所执性，四果罗汉断尽了人我执，对五阴、十二处、十八界已经没有了执取性，但还有法我执没有断，就要对如来藏出生的很多法还有遍计执所执性，除了灭尽意根的无明，成佛之后，意根再也没有了遍计所执性。初地以上的菩萨，意根不仅断除了人我执，还断了一分或者多分法我执。佛的意根，断尽了对一切法的执著，没有一丝遍计所执性，即不执着人我，也不执着法我，人我执、法我执全部断尽无余，但还是要很普遍的在一切法上运行，默容一切法，只是没有执著性，没有计度性。这就是遍一切法的遍的含义。</p><p>意根遍计所执性的执著性，是分阶段性的，不是在一切位阶都有执著性。在凡夫阶段对一切法都有执著，不仅执著人我，也执著法我。这种遍计所执性通过修行可以逐渐灭去，四果罗汉之前，意根有人我执，四果罗汉以后，人我执就灭。初地菩萨以后，意根还有不同程度的法我执，从初地菩萨开始一分一分的断除，断尽了就成佛。</p><p>三、心的功能作用就是受想行识的功能作用，识别、了别、执取、感受、抉择，对一切法生起喜怒哀乐和忧悲苦恼的情绪，这些功能作用都是由如来藏的识种子而引发出来的。七大种子一输送出来，七识的心行和六尘境界就如同泡沫一样出现了。无始劫来意根一直抓着泡沫而取无常相为常相，取苦空烦恼相为乐相，取五阴无我相为我相，取六尘六识不净相为净相，把六识所有的功能属性都执为我，把这些泡沫都执着为我、为我所有，把苦、空、无常法执着为我及我所有。</p><p>因为抓取这些法，意根就无法出离三界得解脱。我们明白这些道理后，这一世应该要生起解脱之心，努力了知这些法都是如何虚妄不实的，因何因缘生又因何因缘灭，确认其生灭无我以后，不再执取无常无我的幻化有为法。一切的受觉哪怕是乐受都是无常而留不住的，境界相来了产生乐受，境界相灭了，乐受也灭了，没有一个受一个法可以常恒存在而不变灭的。</p><p>六尘都是大脑里所呈现的虚幻的影子，我们都是在执取这些影子而产生各种受与想，影子不真实，产生的受与想同样也不真实。所有的法都在刹那刹那不断地生灭着，过去的已经过去了，现在的瞬间就变成了过去，未来的还没有来，意根抓不住过去、现在、未来的任何一个虚妄相。世间根本就没有其人其事其理，也没有世间，就如同对着镜子里的影子又哭又笑，生心动念，造作种种业行，却不知所面对的一切都只是虚妄的影子而已，就如痴狗对着镜子里自己的影子狂叫不止，就如痴猴跳进湖水非要去打捞月亮的影子一样，众生就是如此愚痴。要想脱离愚痴，获得智慧解脱，就要认识真理和真相，不再执取一切法，断除我法二执。</p><p>四、日有所思，夜有所梦，是意根遍计所执性造成的。意识白天思考的内容，六识了别的一切法，都会落到意根里，意根有时候白天太忙了，祂来不及思量，忙于应付主宰各种事情，让六识现起分别性，因为分别的内容太多，意根也思量不过来。晚上六识都灭了以后，就不会再传递六尘信息了，意根就有空闲时间，开始思量六识白天所了别的法。祂思量这些法时，如来藏随其思量就变现出梦境，白天思考的事，晚上就梦出来了。有时候意识白天思考的事，意根也跟着思量，意识心粗不知道，并且意根也没有思量出一个结果来，不会做抉择，到晚上意根就会继续思量。虽然意识不知道，晚上意根也要把思量的事情通过梦境显现出来。</p><p>如果意根不太攀缘和执著，夜晚就不会做梦，意识就一直不现行出来，一宿时间睡眠无梦，就能恢复疲劳。比如阿罗汉因为意根灭了一念无明，意根不再攀缘世俗法，阿罗汉的心里就没有散乱和掉举，白天也没有昏沉和睡眠，心里清清净净的，晚上也不大有梦了。偶尔做梦是因为有一些其它特殊事情，也许是他人意根攀缘，来进入阿罗汉的梦境里有事相求，比如有些鬼神需要超度等等。</p><p>意根所攀缘的法，会通过梦境显现出来，有时候还能梦到前世的人事物，还能梦到未来，意根也能缘到业种，也能了知一些未来的事。未来的事就会在梦境里呈现出来，第二天的事情能出现，第三天的事情能出现，第二年的事情也能出现，梦境里说不定什么时候的事要出现，这叫未卜先知。</p><p>意根如果要攀缘其它世界的法，其它世界的景象也要出现，所以意根攀缘什么，梦里就会显现什么。那么所有的梦境是谁变现出来的？意根肯定变现不出来，因为祂不含种子，又没有直接变现的功能。只有如来藏能够随顺于意根，输出种子，把梦境显现出来，让意识了别，第六识在梦里，就会天上地下，过去未来，无处不到，真是神乎其神。</p><p>五、意根是作主识，有遍计所执性，天上天下处处攀缘，祂也必会带着六识处处攀缘。六识是如来藏依缘而生，所以是依他起性，外尘和内尘，诸识和业种，皆是如来藏出生，皆是依他起性。</p><p>意根在最初时，无始劫以前就存在着，那时如来藏心体里还没有五阴造作的业种，可是意根照样存在，其存在之理由是因为意根有无明，叫作无始无明，一念无明也是无始的，也叫作无始无明。意根出生和存在的缘极少，有如来藏、无明以及诸佛菩萨的愿力就可以了，所以意根的依他起性不明显不突出。意根最主要的特性就是其执著性，在凡夫时无一法而不执，叫作遍计所执性。因其遍计所执性，分段生死以及变易生死才无有了期。</p><p>六识的出生和存在主要是依意根的遍计执性而来，六识出生的缘比意根多，因缘具足时，六识才能出生，所以说六识是依他起性。虽然六识也有执著性，但是其执著性还是受意根影响、熏染和调控的，其执著性与意根相比很轻微，并不突出。以其主要特性来说六识是依他起性，而不能说六识是遍计执性。因为六识并不能普遍于一切法上运行，有很多不遍之处，也就执著不了那么多的法。况且意识没有作主性，受意根支配和主导，所以体现不出遍计所执性。</p><p>六、问：意根是遍计所执识，这个“计”就是指意根的思量性？这个“遍”字，究竟遍在何处？哪些是意根的见分直接了别的？哪些是缘于如来藏的见分或前六识的见分来了别的？</p><p>答：计的意思是核算、测量、打算、谋划、策略、主意，意根的计含有思量的意思，这就体现了意根作为末那识的活泼泼的识心活动，体现了众生深层次的思想分别活动，因此也说明意根是有智慧的，与慧心所相应。执的意思是固执、执著、执取，意根的执性，分为人我执和法我执，两种执都断尽，就修到佛地了。</p><p>意根的遍，是遍在自己如来藏单独所变现出来的一切法上，遍五根、遍六尘、遍六识、遍五阴、遍前后世、遍宇宙器世间等等所有一切法，楞严经所说的意根默容一切法，就是这个意思。</p><p>意根的了别，都是缘于如来藏的见分而作的了别，比如意根了别自己和他人前世的经历和后世没有发生的经历，六道众生的事情，他人的心理状态和想法，能了别那些六识在有五神通的情况下才能了别的所有人事物理。而在对应和分别现前的六尘境界的时候，意根大部分要依靠六识对六尘的了别，而作自己的了别，最后作抉择。有的时候，意根也可以不需要六识辅助了别，自己就能单独了别六尘境界，比如在睡着的时候、昏迷的时候，各种禅定的时候，死亡的时候等等，意根单独了别六尘境界，再作以判断和抉择，之后，六识就会出生，辅助意根造作身口意行，以完成意根的抉择。意根直接了别的部分，也是缘于如来藏的见分而作的了别，没有如来藏，不依靠如来藏的见分，意根不可能单独有见，不能单独运作的缘故。</p><p>七、意根就是我执识，时时处处执著五阴六识为我，也执意根的功能为我所有，意根对自我五阴的执著，修到四果时才能断除，不再执著五阴自己。现在总听有人说要去执，其实这些人都不懂得修行的次第和进阶，一个人离初果的断我见都还很遥远，就想一步修到四果罗汉的断执，甚至还有人高喊着要断地上菩萨应该断的法我执，这简直是天方夜谭。</p><p>如果不懂得自我五阴的生灭无常变异性，最基本的三缚结没有断，就想断更深层次的五上分结，连基本的禅定功夫也没有，就想一下子飞跃到很高的修行层次是不可能的，很多人一辈子高喊口号，临终仍然要接受三恶道的果报，真是可怜悯者。初果的修证内容如果还不懂得，无法证得初果，就更不能做到四果罗汉的断意根我执，修行是有次第的，不可能一步登天。</p><p>意根是我执识，无始劫以来一直在执著自我，从来没有停止过，其执著性根深蒂固，不经过中间层次的渐修，不可能一下子就能断执。意根既然有执著性，祂就不可能对一切境界湛然不动，祂时时处处攀缘，如果祂能湛然不动，那我们就能时时得定得止，内心安然自在，一切法了无牵挂，而且定力会很深，事实却不是这样，那就说明意根对一切法或者极大多数的法，还是有动转和动念，以至于六识念念不停留，分别不断。</p><p>意根是作主的识心，没有再指挥意根的了，但是意根的一切心行，都要有如来藏的配合，而且如来藏也不是无缘无故地就会配合，如来藏要依缘依业种来配合意根的心行，是有一定的条件和前提的。那就是说，意根的作主性也抵不过业力，在很多重大的事情上还是要随顺业缘，作不得主的。</p><p>尤其是临终去三恶道时，祂只能听从命运的安排，听从因缘的召唤，也不得不在中阴身里徘徊想有一个最好的归宿，可是最终归宿，往往不尽祂意，祂也只能随顺命运的安排。世间人在活着时，意根总想指挥一切，主导一切，可是自己的命运却始终主导不了，这就是不努力修行，不断我见，不断我执的结果。</p><p>八、意根攀缘一切法，攀缘的意思是援引他物而上，攀拉援引、依靠、投靠、攀登、攀比、攀附，俗话叫作强行拉关系。从这个概念上来看，意根对万法的攀缘性，也就能清楚了，祂强行与一些法拉关系，攀附着一些法，依靠着一些法，不肯舍弃，不肯放舍，心上执取着这些法的相貌，装载着这些法，记挂着这些法，惦记着这些法，惦念着这些法，而不舍。可以定义意根的攀缘性为：不断的对法尘生起作意乃至思心所，是意根的攀缘性，也就是惦记、惦念和执取。</p><p>如果说意根攀缘，大家都能接受，因为书里都是这样说的，所以不用思考就直接信受下来，以至于成为了语言的习惯和思惟的习惯，也不知道攀缘究竟义是什么。如果用比较贴切一点更容易理解的词语，来解释意根攀缘的含义，代替攀缘这个词语，恐怕会有人强烈反对，因为无明故。不知道攀缘是何意，如何依法？不了解意根的思量性，如何依法？不知道意根的惯性作用的实质，如何依法？不知道意根根据什么作抉择，如何依法？意根的思心所都有什么功能，如何起用的，作用有多大，一问三不知，如何依法？</p><p>用惦记惦念代替攀缘这个词语，完全合适。有人有这样的体会，每当临睡之时，只要思索法义，比如思索意根的非量境，如何用意识之力改变其为现量境，这对证果是有用的。结果夜夜梦不断，都在法义上转。这说明惦记惦念等价于攀缘，没有惦念的心思就不会有攀缘的行。</p><p>已经过去了的事情，意根为什么还要生起作意和思心所？这是什么心行？过去了的事情，意根仍然要起作意、触、受、想、思五遍行心所法，以至于弄出梦境，让意识在梦里继续思考，这是什么功能？是不是惦念惦记？是不是忆？过去和现在的事情的连续性是如何实现的？事情已经灭了，意根仍然要作意触受想思，就是惦记、惦念、攀附、强行结关系，心里放不下。</p><p>意根的惦记和惦念不同于意识的记忆回忆，意识的记忆回忆是指意识能够清楚而系统全面细致的回想起所经历过的事情，而意根却不行；意根只能攀附着，只能想着，只能惦记和惦念，不能回忆出具体的细节和情节，不能有清晰的图像和文字语言出现。</p><p>但是意识的记忆回忆也都是意根不断的攀缘、不断的惦记和惦念的结果，如果意根不再想着经历过的事情，那些经历过的事情就不会以独影境法尘的形式出现，也就不会出生意识去了别这个独影境，那就没有回忆记忆这样的事情发生。记忆回忆，与惦记的区别，惦记比较粗略，意根相应，记忆回忆比较细，有细节，意识相应。所以意根粗略提醒，意识就要细微了别回忆。</p><p>意根的想心所，就是了别和执取的功能作用。过去了的事情，意根都能缘到，都能攀到，都能攀拉到梦里来，说明意根并没有忘记这些事情，遇缘就能现行出来，甚至能现行到梦里来，就是世俗常说的日有所思夜有所梦。意根的思心所与想心所的差别是什么？思心所是思量和抉择，作主和决定，是想心所的了别分析以后做出的决定性的心行，比想心所更具智慧性。</p><p>意根不但对过去世，对久远劫以前的事攀缘和惦念，也对未来即将发生的事情惦念不已。如某人惦念第二天的选举问题而彻夜难眠，惦记着第二天的事情要如何安排，以至于睡不着觉。睡不着觉，是意根不让六识灭去，尤其是不让意识灭去，让意识左思右想，以至于思虑过度，身体翻来覆去不能安眠，这是意根严重攀缘执著和惦念造成的结果。</p><p>有时候经常梦到小学的人和事与现在的人物混在一起，都是意根惦念攀缘攀附出来的，其实自己都知道心里对那些人和事都是难忘和执著的，虽然意识可能现在不想这些，但是梦到后感触还是和刚发生一样，意根其实从来没有放下过，一直执著惦念着。惦念惦记可以说是比较轻微的攀缘，例如佛菩萨惦念着众生如何得到解脱；而攀缘可以说有一种盲目的执著性，像一些追星族那样就称之为攀缘。</p><p>意根的执著和攀缘，就是意根的遍计所执性，是意根的作意和思心所的不断运行状态。计，是意根执取性功能作用，是想心所的运行，也有思心所的运作，比较强烈一些；而惦念惦记比较轻微，也比较粗略，可以不涉及具体的细节。其实攀缘也可以不涉及具体的细节，比较粗略。意根有主动攀缘性，意识有被动攀缘性。表面情绪是意识心的状态，是意根攀缘某种法，让意识出生的感受，还有深层次的情绪，由意根直接发动起来，是意根的心行。感到莫名其妙的事，就是意识不知，意根知而不能用语言和文字思想表达。如果知道自己为什么有某种情绪，理路思路比较清晰，就是意识思惟了别出来的；如果不知道自己为何有那样的情绪，那就是意根闹出来的。</p><p>有的人睡着了，想几点起就几点起，从不用闹钟。意根是如何准确知道时间的？这就是世间所说的生物钟现象。生物钟，就是指意根。如果意根知道第二天得起大早赶火车飞机，意根平时五点起床，第二天三四点钟就起床，有时半夜惦记得过分，就会醒过来看时间，说明意根并没有忘记第二天要早起的事情，祂一直惦记惦念着。意根的识性到底如何，有多深多广，都能识别什么法，这些需要我们不断的更深细的去观行和探索。</p><p>九、身口意行造作强烈是什么意思呢？那就是心行重，意根的执著重，认为某事非常重要，才要强烈的造作。身口意业行作为种子存入如来藏以后，意根攀缘很重，想把种子现行出来，再经历一次的时候，种子就容易成熟，容易现行出来，显得意识记忆比较牢固，实际上就是意根的攀缘执著性导致的。比如借给别人一万元钱，这一万元钱对于自己很重要，意根就不肯舍弃，心里一直在攀缘惦念着，虽然意识并不想着，表面上好像是暂时丢下了这件事，好像是忘了。可是不知道什么时候，意识就能突然间或有理由或无理由的想起了这件事，这就是意根提供给意识的信息，意根时时在惦记的结果，否则意识不能主动想起这件事。如果是借给别人一元钱，这笔钱太少，对于自己并不重要，意识觉得无所谓，意根就不放在心上，不太攀缘惦念这件事，意识就想不起来。</p><p>一件事情过去了成为业种，关键看对意根是否重要，重要的就比较执著，然后不断的缘这一法，惦记这一法，就能促使意识回忆出这个事情；不重要的事情，意根不惦念，就不能促使意识想起这个事情。</p><p>十、灭除意根的遍计所执性即成佛道</p><p>生死是由意根的遍计所执性而有，其中意根的人我执能引生出分段生死，导致一期生命一期生命的不断轮转，伴随着粗重和细微的生死苦恼；意根的法我执引生变易生死，导致细微而长久的生死现象不能永尽，仍然伴随着微细无明惑业苦。既然如此，意根断除人我执就能了却分段生死，相当于四果阿罗汉断除对五阴十八界的执著；意根断除法我执，才能灭除变易生死，究竟成佛。</p><p>为什么如此说呢？因为一切法都是意根执取和执著的，执著就有缚，执取就被缠缚，由此无明就有生死。因为意根执取五阴的功能作用为我，执取十八界为我和我所有，执取三界世间，贪爱不舍，遂被五阴所缚，被十八界所缚，被三界世间所缚，不得出离三界苦。只有让意根断除五阴十八界的我见，才能断除对五阴十八界的执著，从而断除对三界世间的贪爱，解除缚着，暂时得以解脱。</p><p>因为意根的无明，不知法界实相，不证如来藏，也不知如来藏的种子功能作用，贪执如来藏所变幻出来的一切法都当作我和我所有，执著不舍，遂有法缚，变易生死不除，不得大解脱。只有让意根逐渐认清事实真相，证得一切法都是如来藏的功能作用，都属于如来藏所有，没有自己丝毫，意根才能死心，断尽法爱，灭尽无明，解除全部粘缚，究竟解脱，恢复本来面目。</p><p>因此说，学佛修行就是要破尽意根的无明，证得一切法无我，解除意根的贪执，改变和断尽意根的遍计所执性，生死的枷锁才能全部卸除，生死自在，于法自在，成为大法王，成为三界尊。</p><p>十一、意根对内外四大的执著性不同</p><p>凡夫的意根有一种遍计所执性，对所遇到的一切法都可能产生执著，只是执著的轻重缓急不同，执著的方式不同。意根最执著的就是色身和六识的功能作用，因为这些法活灵活现，意根离这些法又很近，须臾不能离开，依靠着这些法才能展示自己。意根执内四大的色身为我为我的，色身对意根的影响最大最直接，可以说息息相关，代表着意根我的生命特征，又能直接控制，所以意根最执著色身。</p><p>但是意根也执著外四大组成的物质色法和宇宙器世间，把这些法当作是自己所拥有的，认为自己能享受到这些物质色法。这些法对意根来说，不是息息相关须臾不可分离的，只不过是色身生命所需而已，很难直接控制，与意根的关系要疏远很多，执著外四大优势为了内四大，本质上还是执著内四大，所以意根对外四大的执著要比对色身的执著轻微。如果一个人对物质色法也有很严重的执著，那说明这个人贪执性太重，难于解脱。</p><p>十二、意根俱生的人我执和法我执</p><p>所谓的俱生，是指五蕴生来就带过来的，与五蕴一起出现的，从前世带过来的，不是新学新出现的，不是后天受熏才有的。俱生的人我执是指与五蕴一起出现的人我执，是前世的执著习气带到今世来的；俱生的法我执是指与五蕴一起出现的法我执，是前世的执著习气带到今世来的。</p><p>第七识是连续识，无始劫以来从来没有断灭过，每个五蕴新出生时，第七识都不用新出生，还是前世延续下来的那个，因此其习气惯性秉性仍然与前世相同，没有变化；其所有的认知都与前世相同，没有变化。第七识都认知些什么呢？第七识认知五蕴，知道五蕴是我；认知十八界，知道十八界是我和我所拥有的；第七识依靠第八识认知一切法，知道一切法都是我都是我所有的。因为第七识有这样的认知，又不知道这些法都不是我，都是第八识变现出来的假法，因此对五蕴十八界法有贪执，对第八识变起的一切法有贪执。</p><p>第七识意根前世执著五蕴和十八界为我，今世刚刚出生时乃至于在母胎里时仍然要执著五蕴和十八界为我；前世意根执著一切法都是我，今世刚刚出生时仍然如此执著，因此说意根的人我执和法我执在五蕴生来就具有，不用现学习和现熏习，也不用依靠除第八识之外的任何法而有这些执著，就是说不依赖六识和生存环境就能单独具有，并且刹那都能现行出来。</p><p>十三、意根的遍计所执性，并不是对所有法都执，或者是都能同时执，因为精力不够用，就会在一时之间有些选择。有些法意根是漠不关心的；有些法意根是厌恶的躲避的，虽然这也属于执；有些法却是很贪爱的；有些法是习惯性的攀缘了别。虽然意根能够遍缘一切法，但也不是一时之间同时都能缘，还是有重点有侧重面有所选择，尤其是希望六识处理的法更是有所选择，否则六识了别不过来，就要疲乏崩溃，这点意根能懂得。</p></div>"
},{
    "title": "第三章　意根的伶俐性",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　意根的伶俐性</strong></p><p>一、意根的另一个体性是伶俐性，伶俐的汉语意思是轻巧、灵活、敏捷，意根也差不多如此。意根为什么很伶俐呢？祂无始劫以来一直在攀缘如来藏所产生的一切法，一直在随逐着如来藏而存在，如来藏能变起什么法，祂就能缘什么法，没有隔碍，非常灵巧、敏捷。如来藏只要能变，祂就能缘，与如来藏紧密相连，没有一个法祂缘不到，所以说祂很伶俐。如来藏变出哪个法，祂都能瞬间知道，所以说祂很伶俐。</p><p>二、没有六识的时候，意根伶俐不伶俐？没有意识的时候，意根绝对知道自己是存在的，知道五阴身现在不能动，不能了别细法，知道自己还活着，知道自己大概所处的状况。比如昏迷时，意根强行着找时机想清醒过来；快死亡时，意根挣扎着不想死亡。睡着时，不远处着大火，意根快速让六识出来了别，意识迷迷糊糊不知道是怎么回事时，身体立时就跑。你说意根伶俐不伶俐？</p><p>发生地震时，意根立即让六识出来，六识还不确切知道是什么事就越窗而逃，你说意根伶俐不伶俐？逃跑是意根决定的，六识迷迷糊糊，并没有给意根多少信息，意根就知道不好。睡觉时，六识并不存在，意根就知道大事不好，赶快醒过来，你说意根伶俐不伶俐？意根如果不伶俐，我们就不能活到现在了，各种突然事件的发生，意根就知道立即躲开，并且知道保护自己身体关键部位、重要部位，知道哪里是容易致命之处，这样我们才能安全的活到现在，所以应该感激意根的惯性力量和伶俐的自我保护功能。</p><p>三、意根为什么叫作转识</p><p>正因为意根非常伶俐，因此祂才叫作转识。转识的意思就是，原本没有的法，如来藏里的法，因为意根的攀缘性，被意根给转出来了，这是意根转识所起的作用。如果意根有大智慧，知道法界实相，依靠如来藏，依靠着实相，意根就知道万法全部都是虚妄的，心静不动时，有些三界法就不现起，不转出来了。如果意根不转，三界法就不能现前。意根能把三界法转出来，能把六识转出来，这才叫转识，从如来藏这个宝藏里把三界法转出来，这就是转识的作用。</p><p>当我们在定中时，意根也在转，睡觉时觉知心灭了，意根还照样继续不断地转。既然意根能够相续不断地转，转出一切法出来，说明意根才是非常伶俐的。而且入了无想定，入了灭尽定，或者正死位中、昏迷位中，祂都照样继续不断的运作，因此叫作转识。意根在定外时是转识，在定中时也是转识，无时无刻不在转，刹那刹那都在转，没有一刹那停止过。如果意根不转，就无余涅槃了。</p><p>那就是说，依于意根心动的关系，就有了意识觉知心配合着显现六尘境界，了别六尘境界，就有了能够看见六尘境界的六识存在，而所见的六尘就叫境界相，心境就全部出现了。</p><p>四、意根的遍缘体性和伶俐性</p><p>有人说睡着时“嘭”的一声，重大声音出现了，如来藏才把六识生起，人就醒过来了。那么没有重大声音，没有重大法尘的时候，六识生不生，睡觉能不能醒过来？当然能醒过来，极大多数众生和极大多数的时候，从睡眠当中醒过来是睡到自然醒，并非都是因为有重大法尘才醒过来的，而且每次睡觉也并非都有重大法尘，否则这样的睡眠环境太糟糕了，每个人的睡眠质量也极差，那么结果就是成天昏沉不清醒。再者说，每个人也保证不了每次临醒过来的时间一定有重大的法尘，这样就不能保证每次睡觉就能按时醒过来，也不能保证能醒过来，那么谁还敢轻易睡觉？</p><p>事实上，意根的机制是能了别一切尘境，不管重大与否，但对某些不重要的尘境可以忽略过去不理，这样六识就没有必要出生和现行。而某些尘境意根认为比较重要有用，想要再细微了别就没有能力了，如来藏就会为祂出生六识来协助了别，然后让意根作抉择。如果实在没有什么重要和有意义的尘境，意根就会习惯性无目的性的遍缘，如来藏就要配合出生六识随缘了别一切尘境。比如我们打坐修定时，意识一心想静下来，不想了别声音，可是意根的惯性作用没办法停止，声音还是要在耳边生起，意识还是能知道，心里空不下来。在清醒状态下并且心静时，耳边无论有什么微小的声音都能听得到，比如最细的心脏跳动的声音，呼吸的声音，蚊虫的叫声，远处即将消失的声音，意识都知道，那在意识了知之前，意根首先要缘和了别。</p><p>因为意根遍缘一切法，没有一法不是意根缘着的，细的、粗的、重大的、不重大的，意根都缘，即使意识不想要这些法，讨厌这些法，意根也要给弄出来，意识没办法拒绝，这就是意根的遍缘性，意根的惯性习气作用。意根遍缘一切法，有些时候是因为有欲望，有些时候是因为有愿望愿力，有些时候是因为习气，还有的时候是境界实在太强大了，意根抵不住诱惑，不得不了别，就生起攀缘性。意根缘法之后，使得意识现前，就能辩别六尘，能见境界相。</p><p>那么意根自己能见境界相的功能作用低劣吗？其实不低劣，比如说哪里要发生天灾人祸了，意识什么也不知道，而意根却知道，于是就决定搬家躲避灾难，或者是表现出惊慌失措的行为，这些现象都表示意根知道了要发生什么事情。有的时候，意根知道要发生什么事，想要意识也知道，就做梦让意识在梦中了别，或者是让意识在定中了别。那意根伶俐不伶俐？在此之前，意识心无法知道这些事情，意根不警觉，意识根本无法知道。</p><p>意根知道这些即将发生的事，都是自己单独依靠如来藏知道的，没有六识什么事，而且还要意根通过做梦告知，意识才能知道即将要发生什么事。打坐的时候，意根还能回到过去世，把过去世的事情现出来让意识了别，还有小时候的事情，重要和不重要的一大堆事情，都能让意识了别到。这里有意识心的参与吗？没有，都是意根单独依靠如来藏了知的，意根单独运作时就很伶俐，用不着依靠六识心。</p><p>意根的法太细了，我们的心要非常的细，禅定非常的好，智慧非常的深细，现量观行能力非常的强，才能把那些细法一点点的都发掘出来。缺少禅定和智慧，只能在粗面、浮面上做粗浅的观行。有些人的心非常粗，即使是在粗面上，还是观行不了，何况细法。</p><p>五、意根为什么能在紧急情况下采取措施，从而规避了危险，转危为安？意根如何知道遇到的情况属于危险性的，能危害自身的生命安全？意根是如何了别和判断要发生事故的？</p><p>首先说明这里意识绝对没有时间仔细分析事情的危险性，以及如何躲避，如何采取措施。而且大多数时候，事情发生过后，风险已经过去后，意识才知道刚才究竟发生了什么事情，才知道刚才好惊险，然后不是感谢上帝，就是感谢某种神灵，就是不知道最应该感谢意根。那么要感谢意根什么呢？</p><p>意根无始劫来经历了无数的事件，什么事情对自己有利什么事情对自己有害，能危及生命的安危，意根都知道。祂也随意根生生世世缘于色身，了解色身的大体状况，哪部分重要，能涉及到命根，意根都知道。所以意根往往在危急关口，不等意识的分析判断，自己独自处理各种紧急重大的突发事件，避免了事故的发生，保障了生命的安全。</p><p>在发生各种突发事件时，如果意根非要等意识的分析思惟推理判断之后，再思量如何解决处理，已经来不及了，也许生命就难保了。所以我们应该感谢意根的伶俐性，感谢意根无始劫以来的宝贵经历，感谢意根的不容分说的果断和机智，感谢意根的那种自动化的规避危险的智慧。所以我们也不要再说意根总是那么的愚笨，那么的愚蠢，祂机灵的时候，我们远远赶不上祂。</p><p>六、当铁屑飞向眼睛时，快速闭眼就挡住了飞过来的铁屑，眼睛没有受到伤害。紧急闭眼快速闭眼，都是意根的飞速决定和指挥出来的的行为。意根确实不可思议，保护色身首当其冲，没有祂这种保护机制，每世的五阴身究竟能活多久，就不好说了。</p><p>这虽然应该感谢意根，但最该感谢的还是如来藏。身体受伤的快速修复，都是如来藏调配四大种子的结果，没有如来藏，意根任何想法都无能为力，更何况还要保护色身，想让色身恢复健康，那是不可能的了。所以如来藏是最可敬爱的，无我无私。意根爱着如来藏的种种功能，凭仗着如来藏的护持，颐指气使，却以为都是自己的功劳。</p><p>七、生来就有躲避危险的本事，就是意根的，意识心在刚刚出生时根本就不懂，如果一生当中没有接触到相应的环境学习，意识永远也不懂什么事，但是意根就有天生求生的本事，不用意识引导和熏染。</p><p>畜生的意根也有伶俐的一面，生来就有的本事也不少。畜生们第一次遇到危险的表现，没有人教，它们就懂得，第一次遇到地震，它们就有预感，就知道想办法躲避，没有人教，天生就会，这是意根的伶俐性，除此无他。但是意根再伶俐，也躲不过业缘，躲不过业报。即使生在非想非非想天受善报，意根贪爱这个境界，命终恶报来临，也要去三恶道受苦，意根丝毫作不得主，没有办法躲避。</p><p>某些人的意根再伶俐，恶缘出现，该死亡还是要死亡，怎么也躲避不了，虽然在他人看来，完完全全可以躲避，可以避免任何事故，可是对于业报来临的人，没有任何选择的余地，也根本没有机会选择，没有机会思考，生命就消失了。</p><p>某些人的意根再伶俐，由于业种和福德欠缺的缘故，非常浅显的法义，仍然看不懂，不能正确理解，更不能如理思惟，非常遗憾。某些人的意根再伶俐，再聪明，一心追求高官厚禄，可是由于前世不修福德，一切善报都与他们擦肩而过，痛苦一生抱怨一辈子。某些人的意根再伶俐，再聪明，由于前世学佛时间短，一辈子勤勤恳恳的修学佛法，精进不懈，即使断我见这样的小乘法都无法真正理解和观行，何况还能证果。</p></div>"
},{
    "title": "第四章　意根的作主性",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　意根的作主性</strong></p><p>一、意根的攀缘作主性表现在意根普遍计度执著一切法，时时处处作主宰。眼根和外色接触，如来藏就在胜义根里把外色变成内色，意根攀缘色作意于色决定细微了别色，如来藏就出生眼识和意识来了别内色尘。眼识先了别青黄赤白、光影明暗、云雾烟尘等等显色，意识几乎同时分别色上的形色、表色、无表色。如面对一个人的时候，了别人的肤色和衣服的色彩，是眼识对显色的了别；了别人的高矮胖瘦、头发长短等等，是意识对形色的了别；了别肢体身体屈伸俯仰、迎来送往等等的行为造作，是意识对表色的了别；了别人的男女相、年龄、美丑、气质、修养、文化、性格、脾气等等，是意识对无表色的了别。  </p><p>眼识见色，先领纳接受，后眼识有单纯的感受，无情绪色彩，意识的受带有感情色彩；受之后是想，就是了别分别执取相貌；下一步是思量抉择，眼识思量抉择是趣向还是躲避色彩，意识判断分析推理，思量抉择是否接续了别法尘还是躲避法尘；最后是行，决定要造作，产生下一步的行为。如眼识的种子一个一个在色彩处流注出来，意识种子一个一个在法尘处流注出来，心所不断连续变化。其中每一个微细环节了别运行的结果都会传给意根，意根就要在每个小环节处做决定，下一步如何做。如眼识见色，是否接着了别，意根决定；意识是否接着感受，意根决定；重点看哪一个地方，意根决定；分析那一方面，意根决定；看完之后，如何对待处理，意根决定。</p><p>如果意根不攀缘色尘，就不会对色尘再作意，那么眼识意识在这个色尘上就消失不再出现，那就是眼对色心不动不分别，只是接触一下而已，不着相，不再往下进行了别，不生心动念，不对这个色尘感兴趣而生起觉受。阿罗汉就是这种境界，这种是真修行人的境界。但是对于菩萨来讲，菩萨不管这些，知道都是自心所变，全部是幻相，根本不执著，要用就用，因为菩萨知道色是如来藏性，污染不了自心。</p><p>二、如来藏为第七识输送识种子，第七识才能现行运作，所以第七识就是从如来藏里生出来的。第七识是作主识，祂有一个作主宰的体性，一切法都由祂作主宰说了算，祂做决定的时候，如来藏就随顺配合祂。所以表面上来看，是祂在控制如来藏，能够主宰世界，祂想做什么，如来藏都随顺，因为如来藏就是一个随顺的心，没有自我主张。</p><p>但是实际上如来藏才是三界世间的真正主人公。如果没有因缘，没有业种，缘不具足时，如来藏即使想随顺第七识，也随顺不了。所以一切事情最终还是随顺于业力，业缘是由如来藏变现出来的，业种是如来藏输送出来的，第七识不能决定业种的出生。有时第七识想违逆业缘，可是也没办法，抗拒不了，也只能随顺业缘，所以三界的主人还是如来藏。</p><p>从表面上看，是第七识控制如来藏，操纵一切法，实际上是谁控制谁？一切法都是由如来藏现行出来的，没有种子，如来藏就不会随顺变现任何法，如来藏依着业种，变现出逆缘违缘和顺缘，第七识就控制不了顺、逆缘的出现。所以三界世间的无量生死苦，第七识不得不承受下来，祂还是主宰不了生死业，万法还是由如来藏随顺业缘而产生出来的。</p><p>比如说意根想发财，前世没有造作出这个福德业，如来藏没有收存这个业种，或者业种不成熟，如来藏就不能变现出钱财，祂就不能让你当百万千万富翁。你想一生如意、如愿，如来藏也配合你，但是没有那如意如愿的业种，如来藏还不能让你如意如愿。而且还可能出祸事和逆境，各种障缘都可能现前，第七识再作主，再不愿意出现恶缘，最后还是如来藏做主宰，如来藏是三界世间的真正主人翁。</p><p>虽然如来藏是主人翁，是真正做主宰者，但是一切事情都不是如来藏作主而出现的。如来藏从来没有一个指挥命令作主的心行，因为祂不是作主宰的心，祂没有我性，不认为有个我存在，所以祂不会发布命令指挥一切法。恰恰是第七识意根有我性，所以才会发布命令，才要作主宰。</p><p>三、只有不生不灭的，本来就存在的，不用其他法生成的如来藏才有自性。祂不用出生，也不能灭掉，不用他法作主，自己也不作主，自由自在。如来藏不知有我，是无我性的，因此不需要主导他法而顺从己意，祂也没有意，只是随顺，随顺因缘和业种。虽然如此，如来藏却是自由自在的，谁也不能把祂消灭，谁也无法出生祂，谁也不能决定祂的命运，谁也不能让如来藏有贪嗔痴，谁也不能让如来藏有生死，谁也不能让如来藏染污。</p><p>而意根的作主性是非常强烈的，不仅要作六识的主，作自己五阴的主，还想要作他人的主，时刻想控制他人的思想和身口意行，只要自己能接触到的一切人事物都想要控制一下，以合己意。不管对方是谁，身份如何，不管对方是自己的父母和儿女也好，是自己的师长也好，是自己的上司和属下也好，亲友邻里也好，都要控制作主宰，都想操控一下。我执严重的，乃至于对圣贤人也想操控，抱着顺我者昌逆我者亡的扭曲变态心理，来掌控世界，不仅想要我的世界由我说了算，而且还想让他人的世界也尽可能的由我说了算。这样的人，意根严重的错执，生生世世苦恼无量，很难解脱，修行的道路是非常漫长的。</p><p>四、意根末那识，是众生作主宰的识心，我们分秒刹那要做什么，由末那识作主说了算；这件事做完了，下一步做什么，意根说了算；明天做什么，明年做什么，这一辈子做什么，都是意根作主说了算。意根打算要做什么，如来藏都知道，之后配合意根完成要做的事，意根要见色，如来藏就输送眼识和意识的识种子，就有眼识与意识同时分别色尘，我们就看见分别了色尘。其它几个根也与相应的尘相对，如来藏就出生相应的识，为几个识分别输送识种子，我们就能听嗅尝触。下一步再做什么，还是由意根末那识打算决定，六个识就按照意根的主张分别做事。</p><p>五、意根的作主性是法尔如是的，只要这个识存在，祂就要作主，与种子业种没关系。如来藏把识种子输送出来，意根就现行起用，现行以后祂就时时刻刻处处的作主宰，这就是祂的体性，本来就如此。因此不能说是如来藏左右祂，也不能说是种子左右祂，祂本身就是这种体性，这种功能作用，生来就如此，法尔如是，没有道理可讲。</p><p>但是意根也受业力业种的支配，就是祂过去时由于无明所造作的业行，存在如来藏里，业种现前时，祂就受业力的支配，现行出从前的烦恼习气。比如过去世喜欢饮食，今世就表现为贪吃；过去世爱好音乐，今世就喜欢乐曲；过去世好斗，今世遇缘就会忍不住参与斗乱等等。但是业种子可以改变，祂通过熏习可以改变业种子，业种改变了，祂自己就去掉了某种习气，不再像从前一样了。</p><p>意根的作主做抉择性，祂一方面是要根据前六识的分析、判断、了别的内容来思量，然后再作主作抉择。如果没有前六识现行了别六尘的话，祂就没法了别六尘的具体情况，比如现在要去某地，不知道往东走，还是往西走，祂就无法作选择。第六识把东和西的方向判断清楚，能不能到达某地，路上会有什么标志等等分析清楚明白，然后把这些信息都传给祂，祂据此作思量，最后作主决定是向东还是向西，如果没有前六识的信息报告，祂就无法作主决定是向东还是向西。</p><p>所以前六识也能支配意根，也能熏习意根，以这种熏习来改变意根，去除意根的无明和染污，最终才能成佛。如果没有前六识的熏习，我们永远处在无明黑暗里，永远不能成佛。因为意根无始劫以来就存在着，而且无始劫以来就有无明，就有贪嗔痴慢疑恶见，法尔如是祂就是这样的。祂自己又不能觉悟，只有靠六识明理，以此来觉悟祂。</p><p>六、眼识所了别的显色不能直接成为种子落在如来藏里，还是要经过意识和意根的处理后成为种子再落谢在如来藏里，二者共同了别，整个过程就能成为种子存入如来藏中。眼识不能单独了别显色，因此不能成为种子，必须意识配合一起了别形色表色和无表色，二者一起完整的了别色尘，再传递给意根之后，由意根存入如来藏中，成为业种。<br/>     眼识和意识对色尘的了别，首先是由意根作主决定的，如果意根不作意不抉择不作主了别色尘，如来藏就不能出生意识眼识互相配合共同了别色尘。其次在了别过程中，也是由意根刹那刹那的指挥眼识和意识的了别，是否接着了别，还是中断了别，还是转换了别的对象，由意根作主说了算。意根作主也可能要依据眼识和意识刹那刹那传递过来的信息，意根了别信息，作以判断之后，再刹那作主决定是否接续了别。在这过程中，眼识意识了别的过程和结果，再加上意根了别的过程和判断的结果，以及各识的心行，作为无形的种子，也要刹那刹那存入如来藏中，待缘熟再输送现行出来。</p><p>意根是六识和如来藏联系的中转站和枢纽，是一切法的驱动者。如果没有意根的驱动，如来藏就休息，处于无余涅槃的寂静状态，不生一切法。</p><p>七、色身的老病死等等各种变化主要是如来藏依业力而显现，意根多数时候主导不了，而且意根不会情愿主导色身老病死。意根依如来藏能随时随地对色身状况作以极粗略了别，我们误认祂对色身的改变有选择的能力，其实祂还是要随顺于业力，由如来藏主导不断变化色身状态。祂自己也没有自性，不能决定自己的存在，要由如来藏出生和执持。</p><p>意根有无始劫以来的惯性作用，特大重大紧急的事情，不用意识的分析判断思惟，自己直接就能决定去做。比如开车时遇见对面一辆车直冲过来，意识来不及思考，就能够紧急刹车或者快速地躲避，比如虫子掉到身上，不用考虑直接就抖落掉。就是意根了别色身以后的快速反应。</p><p>八、意根为什么能实现梦想，能让幻想变成现实？因为后面有如来藏支撑着，随时能提供七大种子和业种，以变造一切法，让意根实现梦想。身体好坏在于意根，调整好意根的心态，身体自然就会健康。意根也叫作情志，能影响色身。因为后面跟着如来藏，能随意根意。</p><p>给意根正面积极向上的东西，总比给祂负面的信息，要强得多，让意根多熏习正面的东西，意根就会积极向上，奋发进取，实现远大理想和目标。社会上那些黑暗面，其他人的错误，尽量少提及少报道，意根就不受熏染。多报道那些正面的信息，多鼓励大众，少批评人，就会让意根熏染正面的积极向上的理念，那么意根就会把正面的信念转变成现实。</p><p>九、得民心者得天下，失民心者失天下。任何人都不要与全世界为仇为敌，不与任何人作对。一个人的意根也许没有力量，很多人的意根合在一起的力量就非常大了，被敌视的人必遭殃。俗语说，众人的唾沫星子能淹死人，就是这个道理。修行人意根的力量比普通人大，有禅定的人意根力量比普通人大，心地正直的人意根力量比普通人大，善业大的人意根力量比普通人大，所以不要与真正有修行的人作对，不要与正直的良善的人作对，是为明智者。</p><p>十、意根的作主性</p><p>当瘙痒出现时，大脑发出“挠”的指令，这个指令得不到实施，神经调节失调，身体就想别的办法，让肌肉抽动，自行解痒。</p><p>大脑根本不会发出任何命令，是意根还是如来藏发出的命令？是意根调动的结果。身体也不会想办法，是意根还是如来藏想的办法？是意根想出的办法。如来藏不会发出命令，也不会想办法。这时还没有意识出生，也不是意识发出的命令，不是意识想出的办法。即使有意识存在，人体神经元的自律行为，睡着时也有，意识参与不了，帮不上忙；腿抽筋的现象，意识是后知后觉；深度昏迷时身体的各种反应，都没有意识的作用；蚊子突然叮一口，意识连想都来不及，怕的一巴掌拍过去，这里根本没有意识的思惟分析决定，意识还不知道有蚊子叮咬。</p></div>"
},{
    "title": "第五章　意根的习气惯性",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　意根的习气惯性</strong></p><p>一、众生每一世的生死联系都是如来藏和意根，死亡时，六个识都灭，不会去到下一世。意根却不能灭，要到下一世去，可以一直延续到成佛，成佛以后更不会灭。如来藏更是能从前世延续到未来世的主体识，因为没有如来藏就没有众生生生世世的五阴身。下一世的五阴中，意根还是原来的那个，如来藏是原来的那个，其祂几个识都是新生出来的，因此意根的烦恼习气就是每个众生的原形。</p><p>因为意识心能够了别当世的人事物理，有记忆力，换为新的意识心以后，只知当世的人事物理，不知过去世的。意根不变，还是前世的那个，那就会把前世的习气习惯带到今世，今世与前世的性格脾气秉性就相同，执著性也相同，所以就叫祂为俱生我执。意根生来就是如此，不用后天熏染，而且还会熏染后天出生的前六识，让身口意行按照前世的习惯去现行运作，身口意行完成之后，业种收存，再次增加意根的习气和执著。</p><p>所以众生前世喜好什么，下世无论在哪道里，条件具足，还是如此，喜欢音乐的，做鬼做畜生还是喜欢。所以有时看见一条狗对其它同伴很谦让，就知道牠做人时就是这样，将来再做人时，仍然是这样。做人时所喜欢的口味，做鬼时，仍然喜欢。一个鬼众生，熏习了大乘佛法，再做人时就会喜乐于修学大乘法，得道就快。</p><p>那些熏习的种子都是由如来藏收存着，因缘具足时，就输送出来，让种子现行。所以遇到很深的佛法，不必躲避，用眼过目，如来藏就存下了，将来就有大用。八个识里有无数的奥秘，证得的越多，无明越少，全部证得，无明断尽，就成佛道。悟后修到一定时候，禅宗三关都过，禅宗的理就都没有用了，全部修学唯识法。学八识法，才能地地增进，智慧圆满具足。</p><p>二、意根的认知习气</p><p>意根的知性范围相当广泛，也相当强大，依如来藏的见觉能知一切法。一切法都是意根先知，意识后知；而且很多法意根知了，意识还是不知，也没有能力知，靠意根警觉提示之后，还是不太明白，直到事情发生过后，意识才恍然大悟，成为一个事后诸葛亮。意根的思量性有多强大？意识不知道的事情，不能给意根当参谋出谋划策，全靠意根单独思量权衡而作出应对，反应极其快速；在涉及到自身的安危，有危险的情况下，作出的抉择几乎都是正确的，说明意根的思量性又快速又准确，简直没得说。只是在涉及到个人利益问题时，由于无始劫以来习惯于维护自身利益，不考虑他人的利益，所作出的抉择自私性很强。</p><p>三、意根与五阴前世的熏习关系很大，五阴有前世，意根没有前世，五阴经历的事件就是意根经历的事件。严格来说，是意根把经历的事情，带给了五阴，意根先接触，五阴后接触；五阴灭，意根不灭；意根是主，五阴是辅。意根把自己经历的事情和经验带给了今世的五阴，影响了今世五阴的行为造作，而意根没有前世、今世、后世之说。</p><p>意根如何把从前的经历和经验带到五阴今世的？因为意根没有灭过，祂熏习成什么性情和习气，遇缘就要表现出什么样的性情和习气，即使五阴在母胎里，即使五阴刚刚出生，意根都是原来的样子，直到又有新的事件发生，改变了意根的性情和习气为止。</p><p>意根为什么与业种相应？所谓的业种，无非是意根和五阴经历过的事情作为种子，通过意根存储在如来藏里。因为意根不灭，也没有灭过，意根经历过的事情熏染了意根，意根遇缘就要把被熏染的习性现行出来，与业种相应，而且不会轻易改变自己。</p><p>比如做人心肠歹毒的人，意根已经与歹毒习性相应，毒性的业种存在如来藏中，缘熟输送出来，五阴死后就出生到带毒类畜生道中，如毒蛇、蜈蚣、蝎子等等。这些毒类众生利用身上的毒液自觉不自觉的继续毒害众生。前世恶毒的身口意行，作为种子收藏在如来藏里，后世意根与业种相应，带有毒的习性，嗔毒就要常常发作，侵害其他众生。那么意根是如何把前世的毒性带过来的，如何沿袭了前世的习性，靠什么顺延前世的各种习性，如何有各种惯性作用的？以上已经阐述过，道理相同。</p><p>在这些毒性的惯性作用中，意识心不起多大作用，因为意识不知前世，没有经历过也就没有记忆，不能通过思惟引导和控制意根去毒害其他众生，大多数情况下要依靠意根自己被熏染成的毒性惯性作用。如果这些众生做人时，受到了教训，意识心稍微清醒而明白了道理，就要通过分析思惟，督导意根减少或者消除毒性，洗心革面，改邪归正，但是这很难很难。</p><p>四、众生时常会表现出潜意识和下意识的作用，包括三恶道众生。比如一个人头脑很愚笨，不太会思考问题，尽做错事。但是一旦涉及到个人利益的事，就非常机灵，反应非常快，几乎不用太思考，作出的反应都是有利于自己的，这是众生的意根无量劫以来的自私性，执我性的表现，知道什么对自己有利，什么对自己无利或者有害，于是自然就会避害趣吉。所以最没有智慧的众生也是自私的，处处都会维护自己的利益，包括一些小孩子都是如此，这就是众生意根的习性和惯性，我执非常重。</p><p>每个人的口味不同，有的是生来就如此，不可逆转，除非条件不允许；有的人是受后天环境的影响。先天的与生俱来的习性，是意根带来的，与意根相应。比如有人天生就喜欢吃辣椒，有人天生就好赌博，有人天生就喜欢洁净，有人天生就喜欢安静独处，有人天生就喜欢读书，有人天生就有很强的逻辑思惟能力，有人天生就喜欢琴棋书画；而有人天生就不爱读书，有人天生就不爱思考，有人天生就懒散，有人天生就喜欢热闹等等，不一而足，这些先天带来的与生俱来的习性，就是意根带来的，属于意根的习性。</p><p>而后天形成的，后天才具有的，是意识心受到环境的熏陶形成的，与意识相应。意根天生的习性，影响意识，意识就喜欢吃辣椒，喜欢读书，喜欢琴棋书画，喜欢赌博，喜欢洁净，喜欢勤俭，喜欢安静独处，喜欢逻辑思惟，喜欢不依赖人，喜欢懒散，喜欢热闹，喜欢……</p><p>这里要把意识的喜欢和厌恶里，划分开是受意根的熏染，还是受后天环境的熏染，这个非常重要，因为从这里能找到意根，了解意根的体性，生起智慧，免得把意根和意识混淆不清，愚者不分根与识，能分清根与识的，已经不是普通学佛人，也不是普通的证悟者，所以能够分清根与识，非常非常的困难，需要修行至少一个无量劫的时间。</p><p>五、意根无论在攀缘什么，在遇到危险时，祂一定要先护着身体，觉得身体就是祂，非常重要。祂也知道身体的哪部分是最关键的，当意外突然发生时，祂就本能的决定先保护哪个部位，这就是先天性的惯性和本能作用。</p><p>有些人总是非常保养自己，吃要营养价值高的味美的，住要舒适的柔软的高档的，生活讲究得过分，表明此人的意根很贪爱自己、执著自己。实际上意根很愚痴，祂不知道只有断我见才能解决生死大事，才是最有利于自己的，因为愚痴才贪着世间法，贪着五欲六尘，贪着自己的五阴身，可是越贪生死业越重越苦恼，在生死轮回中陷的越深，这个道理意根绝对不懂。意根为了五阴，祂要不断地衡量各种利弊得失，有时可以决定做点小牺牲，以换取更大利益，这当然是根据意识的分析教导而做的决定。意根有时也能做到暂时的忘身忘我，那是为了更重要的、对自我更有利的事，也是根据意识的教导而做的决定。</p><p>意识世俗法上的精明，正是祂愚痴性的表现，世俗当中的精明人，往往就是真正的愚痴人和非常愚痴的人。而佛门里被世俗称作傻子的人，往往都是修行有成效的人，他们的意根也许都不贪执世俗，不计世俗利益，与世俗人正好相反，这点就让世俗人百般不解，所以才被世俗人说成是傻子。</p><p>修行就是要掌握七识的心理，改变七识的心理，完善七识的心理，让七识的心所都是二十一个，五遍行、五别境、十一个善，最后意根也是二十一个心所法，众生的心理就整个大颠覆过来，这样才完美无缺，尽善尽美，才是佛的完美之心智。</p><p>六、一个修行人内心里不要总想超过他人、强过他人、胜于他人，一个强烈的我，容不下他人一丝毫，自我也就要受到严重的封闭和桎梏，不得舒展。如果一个人烦恼很重，还自高自大自慢，不知道自己有这么多的烦恼习气，自己不觉悟，道业就没办法增进。修行就是去除识心的染污转识成智，让识心圆明了知一切法，具足广大的智慧德能和功用，则世间一切法都能圆满。</p><p>七、有的人观行断我见，观行一辈子还是音信皆无，观行十生十世，也没有个消息。就是因为意根接触这样的事情太少了，时间太短了，对意根的熏染不够，不足以影响到意根，所以意根仍然不懂不知不会。</p><p>对一切事情的瘾，就是意根的惯性作用，久习成瘾。如果没有瘾，就是意根没有习惯，没有被熏，那就容易改变。意识怎么样都好说，难就难在了意根。学佛成瘾时，叫作精进，是善心所。学佛还没有成瘾时，就不能精进，还会懈怠，是烦恼心所。把其他的瘾戒掉，养成学佛的瘾，了生死就大有希望。</p><p>八、人性本善还是本恶</p><p>人的根本性是指人先天就有的心性，一个是意根的心性，一个是如来藏性；后天受熏的本性才是意识的心性。人性的根本从五蕴上要看意根，从整体上要看如来藏。看一个人的心性表现，要看意根，意根是根本，意识是枝叶，虽然意识枝叶的繁茂能遮掩意根的根本，但是意识枝叶总有凋零谢落的时候，那时候意根的根本就会完全暴露无遗。</p><p>从五蕴上要看意根的心性，从本质上要看如来藏的心性，但一般来说都是看五蕴的心性。意根无始劫以来是什么性质，人性就是什么性质，意根是什么心性，人性就是什么心性；乃至于畜生就是什么心性，鬼神就是什么心性，阿修罗就是什么心性，天人就是什么心性；乃至于罗汉是什么心性，辟支佛是什么心性，菩萨是什么心性，佛是什么心性。比意根更根本的是真心如来藏的心性，所以人的本来性就是如来藏性。</p><p>九、人的本性是否具足十法界</p><p>如来藏具足十法界性，意根不可能具足十法界性。意根如果有佛性，那就一念中是佛，如果是这样，把这一念扩充到十念百念千念，是否就能做一天半天的佛？佛的意根，声闻缘觉菩萨的意根，不可能具足三恶道众生的恶性，也不具足六道凡夫性。</p><p>本性，就是心所法。看意根的心所法就知道了人的本性，看如来藏的心所法，更能知道众生未来的所归，必成佛无疑。</p><p>凡夫的意根，与声闻缘觉和菩萨的意根，与佛的意根有着极大的差别。而意根的心所法与如来藏的心所法也有不同的差别，只有佛的意根与佛的无垢识的心所法没有差别。众生如果是佛，是真正意义上的佛，那么意根的心所法应该与如来藏的心所法相同，没有烦恼心所法，五遍行心所法具足，五别境心所法具足，善十一心所法具足。</p></div>"
},{
    "title": "第六章　如何证得意根",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　如何证得意根</strong></p><p>一、根据意根的特点和体性，去寻找意根，比如意根有刹那刹那的作主性，和刹那刹那的抉择性，身口意行都是意根刹那作主，刹那指挥而造作出来的。每一个身体的行为造作都是意根指挥的，从这里可以证得意根；每一个口行，是意根指挥造作的，从这里可以证得意根；每一个心行是意根指挥造作的，从这里可以证得意根。</p><p>尤其是在突然发生的事情上，意识根本来不及思考，就做决定了，这个做决定的，就是意根。意根指挥身体突然的躲开，突然出现某个动作，这个指挥决定者，就是意根。其实不突然平平常常的身行口行都是意根作主指挥出来的，意根就是直觉作用。如果心细一些，定力好一些，即使没有突然事件的发生，也可以在时刻作主性上找到意根，身体的每一个行为造作，口行的每一个行为造作，都是意根指挥决定的。</p><p>睡着无梦时，意识灭了，没有意识来感知意根的存在。即使意根能感知自己的存在，也不能告诉意识，因为这时没有意识，意根知道的事，没有语言文字可以明确表达出来，意识就无法清楚了知。</p><p>意根也是识，有识的了别分别性，祂可以脱离意识作了别，可以先于意识作了别。但是意根了别的比较粗躁，不能细致，细节了别不清楚，有时还出现错误了别。在六尘的了别上，意根远远不如意识了别的清楚、细致和深入。意识是在六尘上观行思惟的工具，后边有默默无闻的意根和如来藏支持着，不断供养能量和不断作主，不断指挥，意识才能不断的运行。</p><p>二、当我们在“我…我…我”的时候，当心里认为“我…我…我”的时候，就在这里找意根。所谓的“我”，包括意识的我和意根的我，把二者体性分开，就能找到意根的我，其中隐藏的比较深，又很固执，又能决断，不太听劝的这个就是意根的我，这是在意根的作用处来找意根，证得意根。当你认为“我…我…我”的时候，就可以在这里反思，反思哪个是意根的喜欢指挥做主宰的我。</p><p>但是这稍微困难一点，不如在作主性上寻找时时刻刻作主的意根，我要干什么，我要如何如何，那个作主作决定的心就是意根，这样找就比较快速一些，也比较容易一些。比如感觉饿的时候，意根习惯性的就要吃东西，祂一决定吃的时候，意识就开始想吃些什么，于是意识就开始寻找食物，找到以后，意根就决定马上吃。这个过程里，意根重大一些的作主和决定有很多次，细微的作主不知道有多少次，数不清，找到作主的那个我就是意根。</p><p>三、在一切法运作的时候，排除意识的分析思惟作用，发现有个不容思惟的惯性作用，能非常迅速伶俐的作主决定的，就是意根，直接指挥身体作出反应的，就是意根，直接引发身体出现变化的，就是意根。比如看见毒蝎爬到身上，立时心惊肉跳，这是意根引发的反应；听见一个噩耗，立时脸变色，头中嗡嗡作响，呆呆发愣，脑中没有了思惟，意识无法作出反应，这就是意根直接引发出来的。</p><p>再一个找到意根的最佳时间，就是在突发的意想不到的事件发生的时候，观察自己的反应，突发事件发生时，马上就作出反应，不用思考，反应时作决定的那个心，就是意根，要在这上面找。越突然，应变越快速的时候，越容易找到指挥应变的意根。因为意识心根本来不及反应，来不及思惟，全是意根根据自己无始劫以来的习气及惯性来做决定做抉择，然后让六识产生身口意行，非常的快速。</p><p>比如外边突然飞来一个东西，马上就要撞到自己时，你很机灵的，一下子就躲开了，不容思考，决定躲开的这个心，就是意根。祂无始劫以来执着身体为我，而且一直在缘着色身我，色身状况以及与色身有关的状况，祂都知道，遇到突发事情，是祂让身体马上躲开，不要受到任何一点的危害，这个决定急忙躲开的，就是意根。</p><p>或者在家里烧开水，水开了，突然开水有一点烫到身上手上，立时马上一甩手，做这个决定的就是意根。因为意识心来不及思惟要如何应对，这个突然间的热的触尘与身体接触，意识来不及思惟是否危险如何处理，也来不及分析是怎么回事，意根就决定马上甩手躲避烫的触尘，让身体快速作出反应和应对，就是意根的决定。在甩完手之后，心里才觉得有点后怕，有点痛苦难过，这个时候的反应，就是意识心的反应了。</p><p>把意根与意识的两个体性给分开，分开以后，就容易找到意根了。那八个识呢，在五蕴运作的时候把每个识都给分开，拆开成单个识，观察各个识的运作，就能知道各个识的功能体性了。把七个识分开来，都找到以后，剩下的那个就是意根，这样来观行八个识，很快就能证得，也很直接。观察思惟五蕴的虚妄性也如是，把五蕴的活动，一个蕴一个蕴都分开观行，各个蕴的功能体性就了解了，就能观察出某个蕴的生灭变异性，就知道都是无常、虚妄、无我的了。</p><p>四、问：在日常生活中可以找到和体验意根，比如皮肤瘙痒，饿了，渴了，热了，或者非常想要做什么事了，知道最后做决定是意根的事，这时意识就故意不去实施，硬拖延下去。在这期间看看意根在做什么，在想什么。因为毕竟意根还有个是否实施的决定的意愿。这就是寻找意根的蛛丝马迹，或者出处，或者来处。这样时间长了，是否就能找到证得意根？</p><p>答：这也是证得意根的好办法。意根刹那做决定，就是做主宰，意根决定抓抓痒，决定吃饭，决定喝水，决定去吹吹风，决定要去做什么事。只要某个事情做了，就是意根决定和指挥的，在这里就能找到意根。如果意识故意不执行意根的指令，看看意根的反应，就能知道意根的心行和习气惯性，如果感到着急不耐烦的就是意根。</p><p>意识不执行意根的指令时，同时还有意根的暂且不做某事的指令，因为意识无论如何也不能作主，想做什么和不做什么，都是由意根说了算，意识不想服从意根的行为也是由意根同意和决定的。从这里又看出，意根有时候还是顺从意识的决定的，不是完全一意孤行，不是完全的一言堂和军国主义的统治思想。意根是刹那刹那在每个事件上都要作主作决定，从这个特性上就能找到意根的蜘丝马迹，从而证得意根。</p><p>五、问：根尘触处产生识，意识不会在除了胜义根外的其他地方产生，是不是就可以判断意根在胜义根？</p><p>答：意根也不完全是在胜义根处，整个大脑都有意根的住持，意根不离胜义根处，也不仅仅在胜义根处，胜义根之外，还有法尘，必有意根的了别，第八识只要变现出法，意根必依第八识而缘而了别。</p></div>"
},{
    "title": "第七章　意根与如来藏的关系",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　意根与如来藏的关系</strong></p><p>一、如来藏对意根心行的了别</p><p>意根的心行现行出來时，如来藏立即就知道，配合意根输出相应的种子出生六识，六识的身口意行都符合意根的心行与思想。而意根是由如来藏流注识种子出生的，是后天出生的，意根的运行是随机的，如来藏与意根密切配合，随时随地了别意根的各种心行。在识种子位，并没有意根，因此没有意根的心行，如来藏无法了别意根的心行，只有在意根现行出来以后，心所法辅助运行，才能产生心行，如来藏才能了别到。</p><p>意根的心行是以心所法的形式表现出来的，其中五遍行心所法是作意、触、受、想、思，意根对什么法作意，如来藏随时能知，因为意根不能离开如来藏，由如来藏执持。思心所就是意根的思量性和抉择性，意根思量什么和做什么抉择，如来藏都能了知。如来藏了别意根思量的内容和抉择以后，就配合意根，输出六识种子，在意根作意的法上出生六识来完成意根的抉择，六识的身口意行就造作出来了。当然六识是在意根作意的法上造作，其造作的行为都是符合意根心行，是意根的抉择所决定的。</p><p>意根的心行也与业种有关系，业种决定了意根的心行，业种有清净的，也有染污的，有无明的也有明的。这些业种，如来藏都能了知，按照业种让意根的心行现行出来，意根的思心所运行以后就有思量性、抉择性和决定性，其中就含藏着清净性和染污性，如来藏了知后再配合输出相应的识种子，产生出六识，身口意行就现行出来了。如来藏先了别业种，输出种子以后，意根的心行才能现前，这时如来藏才能了别意根的心行，种子不现前就没有心行出现。</p><p>如来藏了别意根的心行极其快速，在众生看来几乎没有时间差，但是佛会发现期间的时间差距。为什么如来藏能了别意根的心行呢？因为如来藏为意根输出识种子，识种子运行时，如来藏就要不断的配合意根的运行。而意根运行时，识种子就是如来藏刹那刹那输出来的，然后识种子再刹那刹那回到如来藏里，那么意根的所有心行，如来藏就会一丝不漏地全部了知。</p><p>二、如来藏无因无缘不出生万法，业种就是其中一种缘，业种成熟时如来藏就要把业种运行出来，业缘具足时如来藏才能随缘出生万法，没有因缘时，如来藏不会主动出生任何法。如来藏本身有地水火风空见识这七大种子，遇缘就输出来，意根只要存在不灭，如来藏就要为祂输送识种子，让祂存在和运作；如来藏如果不输送识种子出来，意根就消失，那就不会有众生的存在，个个都入无余涅槃。</p><p>无因无缘不生法，一切法都是有因有缘才能出生，因是如来藏，缘的种类有很多。一切法的出生，都离不开意根，意根是现起三界法的动力。祂要攀缘什么法，如来藏就得随缘现什么法。但是意根想做什么，如果缘不具足，如来藏也没有办法。比如意根想发财，缘不具足，或者前世没有修过福，如来藏就不能把财富变现出来让此人发财。</p><p>三、意根恒常存在，如来藏就要为意根输送识种，意根才能现行活动，之后识种又回到如来藏中，所以如来藏就了知了意根的心行。意根所思量考虑的事情，如来藏都能了别到，了别到以后，如来藏就要随顺配合意根。这是如来藏随顺的体性，不是意根指挥命令如来藏要如何做。如来藏也不听从任何命令，祂不了知命令。</p><p>而且众生因为有无明也不知道有八个识，意根不知道哪个是自己，哪个是意识心，哪个是如来藏，各自都有什么功能作用，意根就不会有指挥命令如来藏的心行存在。前六识和如来藏是自然而然的要配合意根的运行，不用意根的命令和指挥，也是法尔如是，本来就如此，不是哪个人创造的这个律则，而且永远也改变不了。如果能知道哪个是如来藏，那就明心开悟了，那意根就可以有意利用一下如来藏，观察如来藏是否能配合自己。明心以后，可以观察如来藏的随顺性，比如意根想往东时意识就观察如来藏的反应，意根想看色时于是就观察如来藏的反应，意识观察以后，发现如来藏太孝顺了，任何事情任何时候都不违背自己（意根），服服帖帖。</p><p>但是这些事也不是意根命令得了的，如果意根能够命令得了，那么就会告诉如来藏，给我变出一座金山来，无论意根如何命令和威胁，如来藏也不理这一套。同理，六个识也是随顺配合意根的，不是意根能够命令指挥的，虽然客观上如此。八个识之间紧密相连，配合无间，这种关系非常复杂，配合非常迅速，普通人很难发现。意根能缘一切法，如来藏能变现一切法，了别一切法，但不了知一切法为何物。祂有无量无数的功能体性需要我们去探索和了知，八个识的体性全部证得了，我们就成佛。</p><p>四、阿赖耶识弃舍色身和十八界，是乘于谁的念力？是意根的念力作用，意根想离身，意根想有下一世色身，阿赖耶识全部随顺而作一切事业。意根的念力，也就是意根的思心所作用。意根执身执我，必有念力，对自己五阴身要有个安排，阿赖耶识就像侍者一样，服务于意根，尽量满足意根需求和愿望。决定死，决定投胎，都是意根的念力。为什么意根的念有力？因为后边有大老板，可以满足祂的愿望，后台强悍。意识如果有念，必须经过意根审核通过，意根决定，阿赖耶识才能配合满足意根，间接实现意识的愿望。</p><p>五、机器人没有识种子的流注和八识的住入，也能有行为活动，机器人的活动，是人为的程序控制的结果，是电流加程序的作用，就像电脑也是围绕人为设计的程序而运行的，没有机器人和电脑的自主性。众生的五阴活动也与机器人的活动是一个道理，同样也没有自主性，都是如来藏按照某种运行机制运行的结果，没有五阴身自己什么事，都是众生自己不觉悟，执著五阴活动为真实罢了，以此为真实，才被束缚，生死不能了脱，不能自在。</p><p>六、问：人身根的动作有身识、意识、意根和第八识配合完成，没有意识身识，只有第七、八识是不能完成身根活动的，但前七识都在头部，手脚这些身根离头那么远，也就是说前七识不在手上，手为什么能活动？</p><p>答：牵一发动全身，大脑是总指挥部，意根是总指挥，意根一动，命令由大脑中枢神经发出，迅速传导到全身各个神经组织，全身就动了。实际上是意根一动，如来藏就出生六识，六识再动，后续的行为就出现了。这里全部是秘密法，涉及到如来藏的总相智、别相智和种智，需要每个人自己参禅去搞清楚，不能指望别人明说。</p><p>七、意根与如来藏同时投胎，如来藏是被动的，只是随顺配合意根，被意根牵引着。意根虽然是主动能动的，也没有“我要带着如来藏投胎”的想法，祂不知道是如来藏去投胎变现色身，还以为都是自己所能，而不见如来藏的所能，因此完全是错知错觉，这就是无明。</p><p>意根不知道是如来藏配合自己的心思，自己才能逐渐离开色身而死亡；不知道是如来藏配合自己对色身的贪执，才能变现中阴身；不知道如来藏入住到受精卵中，才能有自己未来世的五阴身。这就是无明，也就是所说的意根的非量了别，一旦意根知道这些道理，完全证得，就破除无明，不是非量了别了。</p><p>八、意根把如来藏的见分当我见，这是一个极大的误会，如来藏的见分属于如来藏的功能作用，不属于第七识意根的功能作用，意根不应该认为如来藏所见所作都是自己的功能作用，不应该有这种想法，这属于是偷盗行为。就好比说，别人劳动以后，你把别人的劳动果实据为己有，说是自己的成果，这是万万不可的。</p><p>第七识意根因为执著如来藏的功能作用为祂自己的功能作用，喜欢如来藏的功能作用，乐着如来藏的功能作用，爱着如来藏的功能作用，就成为喜阿赖耶、爱阿赖耶、乐阿赖耶、欣阿赖耶。这样就掩盖遮蔽了如来藏的真实功能作用，不知真假，不认真假，这正是生死轮回的根本。而断意根第七识这种无明邪见，需要修行三大阿僧祇劫，才能把意根的我执法执，一切无明错解全部断尽，才能把意根在无量的生死缠缚中解脱出来。这样众生也就没有分段生死和变易生死，究竟解脱，圆满成佛了。</p><p>九、意根和如来藏的关系太密切了，心越清静，越能感知到如来藏里的业种，也能主动使用如来藏，利用如来藏，让祂为自己服务。因为如来藏知道什么，意根就能知道什么，意根想干什么，如来藏能随顺配合，这样意根就能挟天子而令诸侯，完成自己想做的所有事。但意根了知的业种，很难让意识了别清楚，意识只能知道意根传递过来的信息，不知道信息里的内容，只有当意识变得清净而有禅定和智慧时，才能正确无误的解读意根传过来的信息。</p><p>意根能直接感知到如来藏里的业种和如来藏将要变现出来的法，以及将要演变出来的事件，意识得靠思惟猜测，依靠非量的成分多，如果意识修出了神通，就能清楚了知到意根从如来藏那里见到的信息内容。意根太重要了，其重要性在于祂是连接前六识和如来藏的中间纽带，虽然一切法都是如来藏出生的，但少了意根这个纽带作用，前六识就不能了别如来藏出生的法。意根是沟通如来藏与五阴六识的桥梁，六识所了别的法，都是意根从如来藏那里得知而攀缘的法，五阴六识的身口意行的了别和造作，要通过意根存到如来藏里成为业种收藏起来。</p><p>十、意根随缘执我量为非的意思是，意根能刹那刹那缘如来藏变起的一切法，随着如来藏的见性而做自己的了别。如来藏能见本质境，之后依本质境，如镜现像一般的现起相似的影像，意根就随着如来藏见这个影像。并且把如来藏现像的功能作用当作是自己的功能作用，把如来藏的见性作用当作是自己的见性，这是一种错误的知见，是非量。随缘，就是随着如来藏变现出的一切法而做了别，而起见性，不知道一切法都是如来藏所变现出来的，不属于自己的，如来藏的功能作用不是自己的功能作用，错误了别称为非量了别。</p><p>如果第七识证得如来藏，再断除烦恼，转识成智以后，能清清楚楚知道一切法都是如来藏所出生的，都是如来藏的功能作用，没有自己的事，一切法都不是自己，也不属于自己所有，知道此点以后，不再执如来藏的功能作用为自己的，那就不是非量了别，而是现量了别了。</p><p>在断我见以后，意根的了别就不完全是非量了别，有现量的成分，知道五阴非我的道理，对五阴的执著就会一点点的减轻，修到四果的时候，就会完全不执了，这就说明意根对五阴的了别，已经不是非量，是现量了别，是正确了别。在明心见性以后，意根也知道如来藏是真正的我，五阴七识不是我，没有自主性，这个了别认知也不是非量，是现量，是正确的认知正确的了别，之后就能慢慢断执了。</p><p>即使在没有断我见，没有明心见性之前，意根也做了极多的正确的智慧性的了别和决定，让众生具有智慧，否则众生就不能遇到佛法，不能修行，不能获得智慧和解脱，也不能上天享福。只是那些决定的正确性是相对的，有层次性的，真正绝对正确的了别和决定，是佛地的意根，菩萨的意根都不是绝对正确绝对现量的了别，所以还需要意根再次转识成智，直到智慧究竟圆满为止。</p><p>十一、自愈力是指什么</p><p>意根的特性是在一切时中，不为意识所知的有所作为，不肯寂寞。祂所做的一切主要都是为我为祂自己，维护祂自己的一切利益。总会想办法满足自己所需，解决最切身问题。祂有很大能量，能实现自己的目标，达到自己的目的，因为背后有如来藏护持，在条件允许的情况下，能尽量满足祂所需所求。</p><p>既然意根有这样大的能量，能想办法达到目的，那么就要让意根相信，自己的身体一定会健康起来，意根相信这点，就会想办法让自己健康。身上不管有虚病还是实病，祂都会想办法解决，顽强抵抗。如果意根不愿意虚病着身，就会负隅顽抗，业障消退一部分，福德增强时，虚病就会退去。</p><p>如果是实病，意根想要健康，如来藏就会发挥其大种性自性，输送调和的四大种子，让色身慢慢康复，就是世俗所说的身体本身的自愈力。意根也能在背后寻找各种机缘，以改变自身的状况，那么色身就有很多机会恢复健康。</p><p>关键是让意根自信，自己能健康起来，自己没有病，一切都会变好，那么意根就会朝着这个方向努力，最终解决问题。暗示意根，给意根鼓劲，就是加持自己，最终都由自性佛加持，是自己度自己，自己救自己。</p><p>一个相反的例子就是，比如病人知道自己病情严重以后，就表现出害怕、焦躁不安的状态，身体日渐衰弱，这正是意根相信了大夫诊断结果造成的。意根相信自己病重，由于执著自己，就非常害怕，以至于萎靡不振，就导致身心随着意根的念头而改变；意根放松自己，不在意身体如何，那么色身也随着意根的放松而向好的方面扭转。那就是意识从大夫那里得来的信息，经过加工传递给意根，意根相信了，就有自己的想法，如来藏随顺意根，就变现色身的健康和恶劣的状况。</p><p>如果是诅咒别人，那么诅咒的人，他的意根发出了一种能量，意根应该有想法愿望，他自己的如来藏配合意根，就让被诅咒的人，实现了咒愿。但是我们不能去诅咒他人，不能给他人带去苦恼，更不能结恶緣。应该多回向，多希望祝愿他人一切都好，别人自然就好了。这样也结了善缘，未来世见面就能感觉亲切，互相能友好帮助。</p><p>　　十二、众生死亡时，第七识意根是如何离开色身的</p><p>意根如果对于身体和生命觉得没有希望了，就会想离开色身，意愿太强烈时，比如心灰意冷到极点，不对色身抱任何希望，就会离开色身，如来藏是必然跟随着一起离开，然后人就死了。如果是正常死亡，意根从如来藏那里了解到各种信息表明寿命期限要到头了，就会有所准备，有所造作。当如来藏把五阴色身的状态都显示出来以后，意根缘于五阴相分，会了知到色身的情况，祂会思量，这个色身还能不能用，有没有希望。当意根确定，这个色身实在是不行了，五根都不起作用了，五识已灭了，意识也越来越微弱，马上就要灭掉了，祂知道六识也不能被自己所用了，于是就决定离开。</p><p>当意根这个思心所被如来藏了别到以后，如来藏就会配合，也生起思心所，收回所有四大种子，离开色身，不再执持色身。如来藏被业力所牵，选择从身体的哪个部位先撤离，最后就从身体的那个部位离开，离开后又去哪里，如来藏对这一切都了知。祂是通过了知业种，随顺业种而做这一切事情，并没有自己的主观知见，因为祂是无我性的。</p><p>在死亡正死位时，前六识依次灭了以后，意根就会离开色身，如来藏就随着意根一起离开，进入中阴身里，人就死亡了，这个色身就成为死尸。然后意根因为执著自己，不想灭掉自己，还想要有个色身，如来藏就会变个中阴身出来。在中阴身里，意根发现中阴身七天一灭，这个中阴身不保靠，就想去投胎，于是与如来藏一起投胎了，就有了下一期的生命，五阴名色就出生了。</p><p>十三、意根是阿赖耶识的俱有依</p><p>阿赖耶识要在三界世间法里运行，一定要有意根的存在，意根想要有五阴身，阿赖耶识才能配合意根变现五阴身，变现十八界，参与变现三界宇宙器世间。如果意根断除执著，不想有五阴身，不想在三界世间生活，那么意根在命终就会灭去，不再有意根的存在，那么阿赖耶识也就没有理由和依靠在三界世间法里运行，没有理由变现五阴身。所以说意根是阿赖耶识的俱有依。但是没有意根，阿赖耶识自己照样存在，不会灭去，只是不变现五阴世间法了。</p><p>十四、如来藏有几个遍：遍一切处，遍一切界，遍一切时，遍一切地，遍一切法。在没有意根存在的情况下，如来藏独处，就是无余涅槃境界，如来藏仅仅是一种存在状态。那么，如来藏的这几个遍，意根也拥有，否则如来藏就处在独处状态了，所以说，第七识意根也应该有这几个遍。</p><p>如来藏与第七识互依，都不能单独运行，没有意根的这个所依缘，如来藏必不能运转，不能现起万法，不能执持万法，万法即刻消失不见；反之，如果没有如来藏，意根必不存在，何况还能运转。所以有如来藏运转之处，必有意根的推动力量，有意根之处，必有如来藏配合运作，意根永远与如来藏捆绑在一起，不可分离。</p><p>如来藏的遍，第七识意根也遍，二者互为跟班和随从，形影不离，只有如来藏在了别自体里的种子时，第七识意根才无能为力。因为如来藏了别自体内的种子，和输送种子时，不属于三界内的法，第七识参与不了，但是如来藏输送种子和业种时第七识还是有一种默默的推动力量，否则如来藏不能输送种子，输送第七识的识种子时除外。</p><p>在三界运行的法里，第七识意根一定跟随着如来藏运行，或者说如来藏随顺配合着第七识而运行。这其中，第七识因为如来藏的随顺配合，就把如来藏的一切作用当作是自己的作用，并且执著这些作用而不舍，却对如来藏的功能作用无觉无知。所以说，有第七识之处，一定有如来藏的运作，第七识不能单独存在和运作。</p><p>从以上所阐述的道理来看，第七识意根可以遍一切时、遍一切地，可以遍一切法，可不可以遍一切处和遍一切界呢？界，就是十八界，第七识只能算作单独的一界，不属于其它十七界，但是其它十七界的出生和运作都离不开第七识意根的推动作用，否则如来藏不能主动出生其他任何一界，如来藏不作主故；第七识意根一灭，其他所有界当时即灭，不复存在。从这个意义上说，第七识也可以遍一切界，只是其作用太隐密难见了。同理，第七识意根也可以说遍一切处。处，就是十二处，六根触六尘处，没有意根的推动作用，六根不可能触六尘，六根和六尘都没有自主性，都不能自动的互相触，都有第七识意根的推动力量。</p><p>那么第七识意根在三界万法中的作用就可见一般了，祂如果无为不动了，三界万法即刻消失。前六识的所有功能作用也都依靠着第七识意根的推动力量，依靠其作主性，六识与第七识时刻捆绑在一起，须臾不可分开。一切法也与意根捆绑在一起，须臾不可分开。虽然很多人不会承认这点，但是，盲者不见天日，并不证明天日的不存在，不证明天日的不运转，只能让盲者早日睁开双眼得见天日，天日不可随盲者的不见而不存在。</p><p>十五、熟眠无梦时，呼吸及新陈代谢不会停止，仍然运行。虽然呼吸属于身行，但不需要身识和意识来维持，那是意根和如来藏的共同作用。昏迷时也能呼吸，没有身识，有一些身体的自身活动，有意根存在就可以，由如来藏维持着，不必有六识。当然六识可以影响意根，改变呼吸血液流动等等色身的活动，色身细胞的新陈代谢，意根也不能直接控制，由如来藏抉择和造作。当然意根用念力可以改变身体的结构，如新陈代谢等等活动。</p><p>那些微细的身行如呼吸心跳等等，由意根和如来藏掌控；而新陈代谢、血液流动、身体温度、神经的跳动等等，意根也掌控不了，身体的增长和所有的变化，很多时候意根也没办法，都是如来藏依缘依业力来维持的。意根虽然是作主识，大多数时候，祂是作不得主的，否则我们就会时时吉祥如意了。可是吉祥如意毕竟是我们美好的愿望，能不能实现，在于业力，意根也没办法。比如说骨头里长刺、身体出现疾病，意根是不愿意有的，可是意根毫无办法，祂没法控制。</p><p>十六、意根的力量是不可思议的</p><p>植物上有共业众生的如来藏共同运作，四大种子刹那刹那发生改变，植物也就刹那刹那的发生变化。植物上的四大粒子也要刹那刹那的向外发散，所以植物对周围环境和人有一定的影响作用，其所散发出来的色声香味触法能影响到人体的健康和情绪，植物也是一个小磁场。</p><p>人的意念能影响植物、改变植物，也是正常现象，人心能改变物质环境，正是三能变识的功能作用。意根的意念作用强的话，如来藏就要根据业缘，不但能影响植物的生长，也能改变植物的性质属性。意根的念力不仅能影响众生心理，影响植物，也能影响一切物质色法。比如气功师动念，就能改变物体的形状和位置，也能远距离调病。还有意根念咒，扎替身，都能改变他人的色身，健康和死亡都可以操纵在意根定力念力强的人手中。</p><p>十七、众生如来藏之间是互通的，自己的意根可以读取对方如来藏流注出来的种子信息，关键还是在于如来藏。既然如来藏之间是互通互动的，可以互相了知对方心体里的业种和信息，一切法对于如来藏来说没有秘密，祂什么都知道；而意根也就能随之知道一切法，那还要看意根有没有遮障，遮障有多大。意根依如来藏的见分而能见一切法，就能读取自己如来藏显示出来的信息，依如来藏就能感知到一切法。身边看不见，摸不着的东西，意根都能知道，就是意识不知道。身体所有的生理反应，都是意根调控出来的，意识却不知道为什么有这些反应。</p><p>众生之间内心能够沟通，也是如来藏的功德，如来藏互通信息，意根随之就能知道这些信息，那就能知道了对方的情况，以及心理状态，意根再传递给意识，意识就能感应到一些事情。人们之间的关系越好越亲密，意根了解的就越多，意识就越有感应，越有共同语言和好感。众生之间的亲和力、排斥力，就是意根的作用，缘分也是指意根的觉知作用。因为意根无始劫以来就存在，没有灭过，经历过的人事物都知道，没有隔阴之迷，因此，众生见面，就有好感和恶感，就知道缘分如何，这些都是意根的知的作用。</p><p>十八、看月亮时，如来藏就变现出月亮的影像，不看的时候，月亮好像是隐没了，其实是意根不想看，如来藏就不配合意根出生意识眼识，也就没有识心了别月亮的影像，但影像是一直存在的。如来藏从不多事，意根没有决定想见色闻声等等，如来藏就不会出生六识来了别。</p><p>十九、问：按照现代心理学的研究成果，意根也参与了人身的构造过程，所以，意根可以在正确导引下，恢复或更正身体的非常状况。就像钟表师，钟表就是他制造的，出了问题，他知道如果解决。这个说法对吗？</p><p>答：色身的构建，是如来藏自己根据业种单独做的事情，意根不懂这些，也帮不上什么忙。因此，恢复身体的状况，都是如来藏的事情，如来藏知道业种，了别业缘，自然就懂得如何改变色身，但也要尽量按照意根的意旨来改变一切法，改变色身。比如有病时，意根想要色身康复起来，如来藏就会依意根的意愿改变色身的病态，恢复健康。</p><p>色身的改变一方面也是如来藏刹那刹那随顺意根的思心所的结果，意根想干什么，如来藏都尽量配合实现祂的想法，这个是最重要的，这也是意根的最厉害之处，挟天子以令诸侯。意识就不行，如来藏不配合意识，只配合意根，意识得经过意根的把关和同意，才能实现自己的想法。所以说在意根上证得如来藏非常容易，谁实现了意根的想法，谁了别了意根的想法，谁给意根输送识种子，都是如来藏。意根的全部运行和活动都是如来藏，五阴身的全部活动都是如来藏，没有其他，纯一无杂，都是如来藏，布娃娃全体都是布。</p><p>二十、一切法的改变根本在于意根的力量</p><p>常常有这样的现象发生，和某人成为朋友后，两人并未刻意模仿对方，却在不知不觉间语调、手势、口头禅越发相似，常被人说“你们俩越来越像了”，这种现象在心理学上叫“同步倾向”。若是和讨厌的人在一起，不管有多长时间也不会发生相像的现象，它只会出现在相互喜欢、彼此欣赏的两个人之间。最明显的现象是一家人父母子女之间在生活习惯和言谈语默上都很相像，包括面貌。</p><p>这其中的道理是，当一个人悦可另一个人时，意根就接纳了对方，长期接触，所思所想所说所做就渐趋一致，意根内心里认可容纳了对方时，看着对方的音容笑貌，意根就不自觉的学过来了，就变得与对方相像。</p><p>心转变，面貌就能转变，心相同，面貌也能相同，比如十方诸佛无一例外都是三十二相八十种好。学佛修行，也是在不断改变相貌的过程，如果相貌没有变得厚道、朴实、稳重、和善，没有比从前更庄严更有亲和力，那么修行还不太得力，心没有改变。因为意根改变，种子就改变，就能促使如来藏改变外在音容笑貌。如果仅是意识的改变，意根不改变，那么如来藏就不可能让众生的内在和外在发生变化，因为种子没有改变。</p><p>改变，首先是意识相应于对方，其次是意识影响意根，意根改变，业就改变。因为意根是作主识，对一切法能起决定性的作用，如来藏顺从作主识。如果意识与意根不一致，观察一下，最后如来藏顺从了哪个？按照谁的想法和抉择产生了结果？当然还是顺从于意根，配合意根的抉择，这说明意根是有力量的，能使得如来藏改变一切法。</p><p>二十一、意根依如来藏的见分能见一切法，如来藏比如一面镜子，镜子的作用能照见万法，能现万像，照的作用就是镜子的功能作用。镜子因为能照见万法，就能把万法的影像摄取过来显现在镜面上。那么意根同时就依着这个镜子，能够见到镜子上的任何影像，镜子照见什么法，意根就能见到什么法的影像。</p><p>如来藏所照见的是万法的原貌，是本质境，是共业众生的如来藏共同变现的外尘境，意根所见的是自己的如来藏单独依外境变起的虚拟的影像，不是本质境，没有真实的功能作用。所以那些有神通的大菩萨们才能不被四大所拘碍，不受四大的影响，遇水不溺，遇火不焚，遇风不动，上天入地没有障碍。</p><p>意根依如来藏的见分，依如来藏照相的照的作用，才能够看见镜面上的影像，意根相当于看着镜子里影像的人，如来藏就相当于镜子，那所现的万法就相当于镜子表面上的那些影像。一切法都离不开如来藏而存在和运行，包括意根也如是。</p><p>如来藏变现这些法是为谁变现的？都是为意根变现的，如果意根不需要的话，如来藏就涅槃休息。如来藏照得见的一切法，意根几乎都能见得到，意根知道的法有无数之多，只是祂不善言谈，无口可说，我们就不知道那么多的内容。如来藏为意根变造的法，意识是不一定知道的，那五识所不知道的法简直太多了。</p><p>所以我们才要千方百计的寻找意根，以便能更多的了解意根，挖掘出意根所知道的一切法，并且从意根这里找到如来藏库房的钥匙，再挖掘出如来藏里的一切法，我们才能大发智慧财，成为佛法的大智者。我们现在意识的智慧是有限的，意根的智慧既有限也无限，如来藏的智慧更是无限的了，虽然表面上看起来意根很愚痴。如果意根真那么愚痴，意识的我们也聪明不到哪里去，毕竟意根是意识的主宰，能调控意识，而且掌管着一切大权。</p><p>二十二、意根的颠倒想，在于把假当真，把如来藏幻化出来的影像当作真实，把如来藏镜子里的影像，当作外面实有的本质境，以假乱真，生生世世自欺欺人。意根控制和指挥六识不断的摆弄镜子里面的人事物，在镜子表面上永不停息的造作，造作严重了，业种集聚的多而大时，最后镜子外面的实体也能有非常大的改变，从而非常明显的改变了本质境，因果就发生变化了。意根破除无明以后，知道万法都是幻化的，照样在六道里在三界里做事，可是却无心于三界里的人事物理，这样就能摆脱三界六道生死轮回苦，心不颠倒。</p><p>可是究竟理地，有轮回这回事，有轮回的人吗？没有，因为临终时，身根灭去不存在了，身根不轮回，意识和五识在临终时也灭去没有了，肯定也不轮回，而意根生生世世都不灭去，没有前世和后世，当然也谈不到轮回。那意根更不轮回，同样没有前后世，况且六道跟祂没关系，祂也不受苦。那么是谁轮回？没有谁轮回。</p><p>二十三、在六尘境界上，六识与意根一直在演双簧戏，那就可以在六识身口意行上发现意根的踪迹；意根和如来藏同样也是在演双簧戏，那也可以在意根的运作上找到如来藏的踪迹，在意根的作意触受想思上找到如来藏的踪迹，在意根的所有抉择作主宰的功能作用上找到如来藏的踪迹。那么在意根的作用处悟道，就更深入更直接，更彻底更究竟了，这样发起的智慧是最深妙的。</p><p>二十四、如来藏除了了别意根的心行，也了意识的心行。祂是如何了别意识心行的呢？如来藏了别了意根的心行之后，根据意根的抉择，在意根想仔细了别和造作的尘境上输出意识六识的识种子，产生意识和六识，然后六识的身口意行就出现了。意识六识对六尘了别造作之后的的抉择传递给意根，意根再思量和抉择，如来藏配合就会再出生意识六识，完成意根的决定。</p><p>当然如来藏输出六识的识种子，出生六识，之后识种子再刹那刹那回到如来藏里，这样如来藏就能了别到了六识的业行和心行，也就存下了六识造业的业种。</p><p>二十五、意根在临终四大分解时是什么样的状态</p><p>意根这时候也没有办法了，祂心里明明白白，这个身体不能用了，但还会支撑着，因为意识心还没有灭。等到意识心也灭的时候，意根感到一点希望也没有了，就会从身体上撤离，如来藏也就跟随着离开，不能单独执持色身，如来藏是最后离开的。其实不是最后离开，是与意根同时离去；如果意根不在，如来藏立时不能持身，不能留在色身中。</p><p>如果如来藏先走，那意根也就不能存在，必须同时灭去；如来藏不能先走，也不能最后走，必须与意根同时走。那么如来藏是不是第一个来到色身中呢？也不行，如来藏不能单独执持色身，祂也没有心思要执持色身，是受意根思心所的影响，随顺意根刹那间就进入受精卵中执持受精卵，与意根同时入住母胎中。因为如来藏与意根形影不离，意根与如来藏也形影不离，刹那都不能离，所以二者入住母胎，与离开色身，没有先后，有先后，就说明二者能互相分离，那如来藏就能单独存在，如来藏能单独运行，这样法义就完全错误了。</p><p>四大种子是从如来藏中出来的，如来藏要离开色身，肯定要把四大种子全部收回，这样如来藏里的种子，才能不增不减，继续输送，出生万法。众生临死之前，甚至很长时间之前，如来藏就知道，因为祂能了别业种，知道死亡的时间，具体时间也知道，祂要慢慢的改变四大种子，让身体发臭，让身体机能衰弱，快咽气的时候，才开始真正的四大分解，收回四大种子，全部收回时，色身就成为僵尸。</p><p>二十六、如来藏产生万法，但自己不能单独产生万法，一定要有意根的参与。在众生的五阴没有出生之前，众生一定有意根的存在，无始劫来众生就有如来藏与意根这两个心识。因为意根执取三界万法，如来藏就会随顺意根,变出三界万法，变出五阴身。从无始劫以来，意根就一直存在着，而且无始劫以来意根里就有无明，与无明相应，无始劫以来意根就带着无明。因为意根有无明，不觉真实相，于是起心造作，如来藏就渐渐地产生出一切法，三界世间就出现了，五阴身也就出现了。就是说无始劫以来，如来藏里一直含藏着意根的无明，意根因为无明心外攀缘，如来藏就会随顺现起三界世间万法。</p><p>意根如果是后天产生出来的，那是指阿罗汉在无余涅槃境界里，第八识本身由于自心识种的流注，心体就要不断的运作，运作到一定时候，就会把阿罗汉入灭前修的善法、或者是大乘法的种子运作出来。运作出来后，第八识就根据这些业种变现出阿罗汉的意根。意根变现出来后，一定会再度希望有五阴身。祂总想要有一个五阴身，第八识根据意根的意愿，就变现出阿罗汉的五阴身出来。这就是意根后天出生的情况，只有这一种情况，意根是后天出生，其余时候，意根永远存在不灭。其余情况，众生都有第八识与第七识意根，二者永远存在，直到成佛，意根也不会灭。除了阿罗汉要灭意根，凡夫和初地之前的菩萨都没有能力灭意根，地后菩萨和佛都不愿意灭去意根而不用。</p></div>"
},{
    "title": "第八章　意根与业种的关系",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　意根与业种的关系</strong></p><p>一、意根是否能了别业种</p><p>凡夫的意根是遍计所执性，无一法不执著不攀缘，并且把如来藏的见性当作是自己的见性，依如来藏的见性，而有自己的见性。如来藏缘什么法，意根就能缘什么法，如来藏能缘业种，能了别业种，那么意根也就能缘业种、了别业种，业种要现行时，意根也能了知到将要发生的事，神通就是如此。</p><p>业种有前世的业种和今世造作的业种，比较重大的业种要现行，果报要出现，意根依如来藏就会有所感知，但是意根本身无法造作什么，祂只能警觉暗示六识，想通过六识的身口意行来选择是迎接还是躲避。但是意根没有名言，不能明确表达出来让六识了知，只能通过各种暗示作用。有时业果太重大时，意根会想尽办法暗示给意识知道，意识就觉得有什么事情要发生，就是不知道具体是什么事情和如何发生，也就不知道如何是好，内心里往往会焦虑不安，心不平静，等到事情发生过后，意识才恍然大悟。</p><p>比如死亡之前的预兆，重大事情的预兆，心里的感应，以及预兆梦的梦境的暗示，这些预兆的出现，意识有时能感觉出来，有时感觉不出来，要看意识是否灵敏。不是定业的业果，意识有可能明白要出什么事，就能赶紧想办法躲开；如果是定业，必然要受业果，意识一般不能明白具体有什么事要发生，即使明白，也不能躲开。比如之前造了杀人偷盗等大恶业，公安机关破了案，在被抓的前一刻，意识也不知道自己马上就要被逮捕，如果知道就能逃跑，业果就不能实现了，可是这时业缘成熟了，必要受果报，业力使得意识没有选择。意根有可能警觉一下，也许受业力的阻碍，也不能警觉意识，即使意根能警觉意识，因业力的关系，意识也不能明白。     </p><p>还有的业种，意根能知道，但是无法让意识心知道。有些预兆，是意根显示出来的，还有些预兆是如来藏显示出来的。有预兆的梦境，肯定是意根显示出来的，有时意识知道，有时意识不知道，要看意识的智慧灵敏性了。有预兆的梦，说明意根还是知道一些业种信息，因为意根无法思量采取什么措施，以避免业果的出现，也许具体要出什么事也不知道，就要让意识心了知，然后采取措施避免恶业现前。</p><p>意根能依如来藏的见性了别业种，宿命通就是个很好的佐证。有宿命通时，意识能知道明天、明年、命终以后要发生的事，能知道未来世十世、百世、千世、五百大劫、无量劫要发生的事。意识依什么知道的呢？依意根和如来藏才能知道，而且是意根先知先了别，然后才能让意识了别。意根能了别到未来世还没有发生的事，这些事对于现在来说，是以业种的形式存在的，并没有其事，所以意根也能了别业种。</p><p>二、有鬼神在身边，头皮发炸，身上发冷或者汗毛直竖，是怎么回事？人死之前的预兆是怎么回事？</p><p>身体出现的各种反应，是意根得知了身边有鬼神的信息，于是控制身体，就产生了紧张的身体反应。意根得知的所有信息，都直接从如来藏库房来，祂就是库房管理员，能缘如来藏变起的一切法，触如来藏变起的一切法，了知如来藏变起的一切法，只是了知的不太清楚，因为攀缘太广，智慧就浅。六识看不见鬼神，不知道有鬼神，但是意根能知道，又因为意根执我心重，担心自己有危险，就控制身根，直接让身体出现反应，来警觉意识注意。意根只要有心理反应，就能直接连带着身体作出反应，意根通过触大脑神经中枢牵动全身的神经，就能控制身体。</p><p>人临死之前是有预兆的，家人可能就有一种说不清的感觉。因为人临死之前，如来藏了知业种业缘，了知五阴要死亡，就会发出一些死亡的信号，表明五阴身要不久于世了，意根马上就了知这个信息。意根知道自己要死亡，祂所有的想法、打算、决定和情绪，都要通过六识和五阴身才能表达出来，那么祂就要让意识了知这些信息，然后替自己解决问题。</p><p>如果意识解决不了和无法了知的问题，就会逐渐想办法解决，比如给亲朋好友托梦等等。因为意根非常执著自己，也会牵挂着一些人和事，知道自己必死无疑，就会想办法告诉自己的亲朋好友，并且发出一些信号，就是临死的征兆，让别人的意根感觉到。在身体好好的时候，意根就做了这些奇怪的事情，意识就奇怪为什么这样做，不知道这是意根在安排后事。意根知道自己生命要结束，就安排六识造作了一些事，意识不知道是为什么，可是也不自觉的按照意根的安排做了。</p><p>人要死时，自己的意根能知道，意识心由于无知，可能无法知道，于是意根不得不带着如来藏去警觉与自己有缘的人，让他们知道，以便于安排或者躲避一些事。如某人临死之前，他自己不知道，而亲人的意识也不知道，但是亲人的意根却知道，于是就安排了一些特殊的事情，而亲人也不知道为什么要这样安排，其他的亲朋好友也能感觉到他要有事。此人的意根也到处给自己的亲朋好友托梦，暗示自己要有重大事情发生，但是这些人的意识心就是无法相信，也不愿意相信。</p><p>这其中的道理是，他的意根通过如来藏警觉亲人的意根，然后亲人的如来藏警觉亲人的意根，亲人的意根就安排一些事，意识心就是不知道为什么这样做。这就是意根的特殊功能作用，祂能了别到一些业种，能未卜先知的预知未来，但是无法表达出来，祂自己没有身口意行，只能指挥六识做一些身口意行替自己办事，如果意识违拗不信，祂也没有办法，只能随缘。</p><p>三、意根与业种收存的关系﻿﻿﻿</p><p>六识如果现起身口意的行为造作，都是由意根作主，意根决定，意根指挥的。意根的作主作决定，一个是根据六识了别的情况来决定，一个是根据自己的习气惯性，根据自己的业力，来作主作决定。如来藏同时了知意根的决定，配合产生六识，造作身口意行，并且反馈给意根了知，同时六识的识种子，就回到如来藏当中，这样把六识了别造作的内容带到如来藏里，就作为种子存下来了。</p><p>另外一方面，六识在了别六尘的时候，刹那刹那把了别的内容，了别的信息，传给意根，意根就知道了六尘的详细情况，原来是这么回事。眼识看到了什么，耳识听到了什么，六识都了别了什么，第七识意根就知道了，同时意根也有自己的心行，一边了别六识带来的信息，一边起自己的心行，有受有想有思量，有烦恼和习气。意识、意根生起心行的时候，识种子刹那刹那出生，刹那刹那又灭回到如来藏当中，这样，第七识所有的心行，也都落到如来藏当中，作为种子存起来了。</p><p>其中前六识了别造作的时候，有没有贪嗔痴烦恼，造没造作贪嗔痴烦恼，是清净的还是不清净的，是带着某种情绪还是不带着某种情绪，如来藏都作记录收存。然后第七识了别的时候，了别前六识带给的信息，祂整个心行是带着贪嗔痴烦恼，还是不带着贪嗔痴烦恼，是清净的还是染污的，如来藏都作如实的记录和收存。</p><p>七个识了别的内容，身口意造作的情况，思量的内容，带不带烦恼染污，还是清净的心行，意根都会如实的作记录，如实的记载。为什么记录，什么叫记录呢？这个意思就是说，如来藏是刹那刹那的输送着七个识的识种，七个识了别造作以后，识种就刹那刹那地回到如来藏中，这样就把七个识了别的信息也带回去了，就等于带到库房里一样。什么时候拿出来，这就不一定了，也许一会儿就拿出来，也许是第二天，也许是第二年，也许是下一世，也许是多少劫，这都是不一定的。</p><p>种子存得越深刻，现行出来就越容易。种子存得越轻微，拿出来就越不容易，业种就不容易成熟，种子越不容易现前。那就是说，我们身口意造作时，心行越明显，心行越大，存的种子就越深，越清晰，种子就越容易成熟，越容易发芽，说明这个种子是饱满的。如果说我们造作的心行不强烈，种子就不饱满，不饱满的种子就不容易起现行，不容易生根发芽。</p><p>如果我们对一个人的印象不深刻，对他不是太感兴趣，虽然也跟他接触了，看见了他，因为对他不感兴趣，那么了别的就轻微。轻微的了别，业种也收存，但是业种不深刻，将来再遇见他，就不容易想起来，以前的种子不容易现行出来。如果对一个人感兴趣，所有的心行都对着这个人，不是很喜欢就是很憎恨，那么这个心行表现出来，就作为种子存进如来藏里，种子饱满就容易成熟，容易生根发芽，业种就容易现行出来。这个道理和收获庄稼的道理，好像是一样的。如果我们带着强烈的心行，非常善，或者非常恶的心行，来造作身口意，来作一切的行为造作，这个种子存起来，就是深刻，种子就容易起现行。</p><p>比如说我们现在学佛，是一心一意的，所有的心思都用在学佛上，这就作为种子存下来了。而有的人对于学佛不太感兴趣，学佛是应付差事，这也作为种子存下了，但是这两个种子，将来起用就不一样，一个容易起现行，一个不容易起现行。一心一意学佛的，所有的心思都用在学佛修行上的这个人，来世学佛的因缘就容易成熟，容易遇到学佛的机缘，因缘成熟时，他就会一心一意扎根进去，修行就非常精进，成效显著。反之另一个人，不太用心学佛的人，学佛的种子就不容易生起现行，来世就不容易遇见学佛的那些因缘条件。他学佛的因缘条件不一定什么时候成熟，不容易遇见佛法，种子不容易生起现行。</p><p>再比如说我们对一个人的感觉是不痛不痒，还是恨和爱，这些心行和业都要存进去，但是存的业种是不一样的，将来生根发芽的时间，种子成熟的早晚也是不一样的，起现行的早晚是不同的。这个意思是说，七识了别的内容作为种子存下来了，了别时候的心行，也作为种子存下来了。恨一个人时这个心行，意根的执著，和六识的嗔，都要作记录收存起来。</p><p>而爱一个人时，意根的贪爱和六识的贪爱，也要做记录收存起来，所有的心行一点一滴都不会遗漏，全部收存，将来都要现行。意根和六识的既不乐也不苦的那种舍受，也要做记录存起来，所有的心行都要做记录，都要存起来。但是那些业种是有很大差别的，业种现行的时候，也有很大差别。现行的时间早晚也有差别。这个业种存的不一样，输送出来的当然也不一样。</p><p>举个例子，比如说我们在人群中，遇见一个人，听到他说话时，意根就突然感兴趣，要看看这个人。这个决定，如来藏知道了，就会输送眼识和意识到这个人的身边，也就是说，输送到胜义根里有关这个人的内相分处，然后眼识与意识就识别、观察这个人，观察了以后，就了别了这个人的外貌的情况，他的身口意的情况，他的各方面的情况。两个识了别了以后，一方面存入如来藏里，一方面要交给意根，意根根据眼识、意识对这个人的了别，意根也就知道了这个人是什么形象。</p><p>知道是什么形象了，同时意根就思量，是继续观察下去呢，还是把眼光挪开。意识随时随地把了别到的这个人的情况交给意根，意根就随时随地思量和做抉择，是接着跟他谈话，接着观察他呢，还是把眼光挪开，看其他人，或者听其他的声音，意根思量和决定。意根思量的时候，同时就把自己的心行，受想思和了别的内容也带回到如来藏里存种，到最后意根做一个总的决定的时候，如来藏也会记录收存，这一系列的心行就作为种子存下来了。</p><p>又比如说了解这个人的情况以后，意根就不想再看他，那么眼光就会挪开，或者让耳识听他说话的声音，听了一会儿，意识一分析，没有意思无聊，这个内容也传给意根，意根思量过后，觉得确实无聊，决定不听了。祂觉得无聊的这个心行，也作为种子存到如来藏里。如来藏了别意根不想听的思量以后，就不在那个人声音的现起之处变现耳识和意识，那就听不见说话声了。</p><p>这时忽然间听到一个鸟叫声，意根觉得这个好听，再接着听。这首先是意识心分析，认为这个声音好听，然后报告给意根，意根思量认为说：嗯，鸟叫声挺好听，再听。听了一会儿，意识心认为无聊，把这个感受传递给意根，意根知道无聊，就决定不听了，注意力就转移。虽然注意力转移了，听鸟叫声这一法，也作为种子存下来了，但是存的这个种子就不那么深。</p><p>不太深刻，是因为意识有一点舍受，不太感兴趣，后来觉得无聊，就是一种舍受。那么这个种子存得就浅，就不容易起现行。如果对那个人感兴趣，意根决定，继续观察他，继续跟他谈话，继续探讨他，或者是如何如何。那六识就再接着了别，并且把这些了别的内容，再传给意根，意根再作思量，意根再作记录，这整个记录以及最后的结局，就都记录收存完了。其中意根的心行，六识的心行，也都做了记录。</p><p>然后不知道什么时候，又遇到这个人了，意根就思量，让意识心来回忆，在哪里什么时候见过这个人，如来藏就输送以前存储过的种子。种子作为法尘与意根相对，意根了别不清楚，还是由意识了别，意识就想起来一些事情，于是把信息传递给意根，意根也知道一些了，可是信息不全，意根就决定再回忆，意识心就接着回忆，如来藏就继续从库房里输送存储的种子。</p><p>意识了别后就回忆起来了，前一阵遇到这个人，什么情况，什么场景，这个人的行为举止，就都想起来了，再回忆这个人叫什么名字，慢慢想。所谓的名字，也是意根从如来藏的库房里输送出来的。一边输送，六识一边了别，了别的内容信息又传给意根，意根就思量，是否还回忆，祂作决定，得要跟这个人有点礼貌，跟他握手寒暄寒暄，问候问候，祂一作决定，六识就出来跟他握手，打招呼，寒暄问候。同时六识跟这个人寒暄问候的一系列情况，也作为种子存到如来藏里了，那么这个种子再加以前的种子，就比以前稍微深刻一些，内容也多了一些，把这个人的所有的情况都会串连起来，作为种子收存。</p><p>六识对这个人印象就更深刻了，来世再遇见时，意根让如来藏把种子输送出来，第六识不知道过去世的事情，但是意根知道一些，意根对这个人感兴趣，六识就觉得有些熟悉和亲切。意根感兴趣了，就让六识和这个人打交道，那么两个人就会经常打交道了，缘份就是这样建立起来的。</p><p>四、业种成熟，即将现行，或者现行了一部分，意根能够缘到，也能了别，只是不能确认是什么，知道重要与不重要，所以才警觉意识。当意识莫名其妙的时候，正是意根知道一些事却不能表达出来让意识明确知道时。第七识意根知道有事要发生，意识就有模糊感觉，也想不明白具体要有什么事情发生。有的时候，意识感觉不好，知道有事情要发生，就采取一些措施防范，从而躲过了风险，这是意根警戒意识了别到的一点点信息。</p><p>有的时候，某个东西马上就要打到自己了，意识模模糊糊有种感觉，立时躲开，过后才知道是什么，然后觉得刚才好危险，幸亏躲得及时，这就是意根警觉意识的结果。有时候感觉某人怪怪的，知道他可能要干什么，于是采取防备，过后再看，果然是如此，这就是意根警觉意识的结果。这些现象说明意根有未卜先知的本事，能与马上就现行出来的业种相应，能感知马上要发生的事情。</p><p>五、业力与随缘</p><p>业力，是过去世造业的习惯势力，表现在意根上，今世遇事时，意根总是要以自己过去造业的习惯势力而作抉择，意识还控制不了。有时心里明知不对，没办法还要去做，一边做，一边心里说不应该，稍微有点觉悟的人，内心就这样的矛盾。如果修行得当，意识如理正确思惟，常常熏染意根，意根受熏，就能改变自己的习惯势力，再抉择时，就按照熏染的正确的理念抉择，然后再形成善的如理的习惯势力。所以说意识接触善法，如理思惟作意是非常重要的。</p><p>遇见善缘需要具备因缘和福德，多修福就能遇到越来越多的善缘，改变自己的机会就多，得解脱的机会就多。如果缺少福德，善缘就不具足，恶缘总现前，意根受熏就会越来越染污，那就不知道什么时候能有善缘解脱自己的烦恼了。福德少的人，遇到恶缘就能被熏染过去，自己没有辨别能力，也根本不想辨别，抵制不了恶缘，就跟随过去了，这样无意间就会造作恶业，自己还不自知，这样就能形成恶的习惯势力，生生世世心地染污。</p><p>缘是被动的多，也有意根主动攀缘来的。如果我们心心念念攀缘佛法，就能遇到佛法的缘，佛菩萨也会在后面加持，让我们遇到佛法，这就是主动攀缘来的，恶法也如是；如果心心念念想发财，就会不择手段，那样处处都是恶缘。再比如饿了的时候，意根就攀缘饮食，让六识到处找饮食，结果就找到了。如果饿了也不想吃，就不能去找，也许就遇不到饮食。学佛有善根之人，就是主动攀缘，寻求解脱，结果就遇到解脱之法，修行一段时间，就得解脱了。如果不攀缘解脱法，是不可能最后得解脱的，这就是主动攀缘，绝不是被动随缘的，如果完全是被动随缘，佛度众生就轻松了，只要加持一下，众生就能都得解脱了。</p><p>有些人总是讲随缘，可是凡夫的缘往往都是恶缘多，如果都随过去，就是生死系缚，那什么时候能得解脱呢？所以凡夫如果有力量，尽量不随恶因缘而流转。只有圣人，心已清净，才能随缘了旧业，而凡夫随缘就等于随生死业。因为凡夫烦恼心重，如果总是随顺自己的烦恼心，就会在生死河里沉溺得越来越深，苦恼越来越多。</p><p>六、冤冤相报是怎样实现的？因果是怎样实现的？众生都已经换了身体，又换了意识心，换了前五识，互不认识了，怎么实现报复心和因果的呢？</p><p>因果是由意根来实现的，众生造业以后，业种存留在如来藏里，缘熟时，如来藏输出业种，众生受报，因果就实现了。因果的实现，不管是善愿的实现也好，还是恶愿的实现也好，不仅离不开如来藏对于发愿业种的收存和输出，也离不开意根的作意与思。往世曾经发过的愿，作为种子存在如来藏里，因缘成熟，种子输送出来，就会按照往世的愿望而行事。而往世发愿是由意根决定，意根认可的，甚至是意根主动发出来的，这个愿望是意根的，就是从内心深处发出来的。</p><p>意根有了愿望以后，还会攀缘着已经发过的愿，无论经过多少劫，意根都会攀缘着。因缘成熟时，如来藏就会输出业种。其结果，一个是直接实现业果，一个是警觉意识心，促使六识按照业种和意根的执著来造作身口意行，其行为表现就不同已往或者不正常了。有时候，意识做事，本身都不知道自己在做什么，就不知不觉地按照意根的愿望去做的，意识心这时不能控制自己，有时也会有冲动的表现。</p><p>有修行的人，发过清净大愿，另一世就会不自觉地按照愿望做事，有时也不知道自己为什么要这样做。意根发过的恶愿恶咒，某世因缘成熟时，意识心也会不自觉地去做，有时也不知道自己为什么要这样做，往往是无奈的。有时意识心想要控制自己，可是控制不了，因为控制意识心的是意根，意根的业力，意识没有办法摆脱开。如果意识心懂道理、懂佛法、懂因果，就可以分析清楚，来说服教育意根，意根就有可能会听从劝告，改变其执著性，这样就避免了恶业的发生，避免了重大的恶果。</p><p>所以，我们真的要常常作如理的正确思惟，来熏导意根，意识心自己首先就要明理，才好正确的熏染意根，导正意根的无明习气。那么我们修行是在修什么呢？当然是以修意识心和意根为主。让意识接触、熏习正确的法义，眀理以后，再来熏习意根，改变意根，意根改变以后，我们的心行就会变清净了，修行就成功。</p><p>七、意根既属于外根，也属于内根，既属于外识也属于内识。祂属于内根内识的时候，和如来藏在胜义根处变起的内法尘相应、相触，并且有粗况的了别，这是祂内根内识的作用。祂属于外根外识时，有外根外识的作用，能够接触和了别胜义根之外的法尘，就是如来藏变起的法尘，没有入到胜义根之前的这一部分法尘，意识心没有神通时缘不到的部分，由意根接触和了别。</p><p>比如如来藏所变起的身根，意根能够直接缘到，也能够直接了别到，所以才能直接对身根作抉择。如来藏变起的山河大地，宇宙器世间，还没有入到胜义根的时候，意根也能缘到，也能有粗略的了别。祂粗略的了别之后，落到胜义根里，如果祂不想看色尘，就不作看色的决定，那么眼识和意识就不会在这个色尘上被如来藏所生起，那就不能见此色了。</p><p>没有落到胜义根里的法尘，都属于外法尘，比如说如来藏变起的极乐世界那些景像，意识心不在定中不在梦中绝对了别不到，这个影像意根能了别得到。因为意根发愿往生极乐世界，就会与如来藏一起到极乐世界变造莲花宫殿，那个极乐世界就属于外法尘，如来藏直接缘到，意根依之就能够直接执取和了别。这是祂和如来藏一起造作的，那些法尘都属于如来藏所缘的，是意根所执取和了别的内容。</p><p>凡是意识不能了别到的，还没有落到胜义根里的法尘，都是属于意根的外入，是意根从胜义根外边所摄取的法尘。包括缘过去世的那些人事，过去世的坟墓，过去世的亲人，都是如来藏现起以后，意根直接缘到，直接了别。然后祂会生起作意和思心所作决定作抉择。</p><p>当意根决定要采取某种行动以后，这些行动六识不可能参与完成，身口意就不可能出现，因为六识与这些法不相应，意根和如来藏一起，直接就把这些事情完成了，不必六识参与。如来藏随顺意根现起那些法尘，意根缘到，然后意根对此生起作意和思心所，如来藏了知，就配合着一起行动，把事情做完了。这些都是与意根相应，是意根了别的内容。</p><p>有些行为的造作，六识不必参与，七八两个识就能完成了。比如生起五阴这件事，就是七八二识同时成就的，没有六识的事。比如入母胎这样的事，生起中阴身这样的事，都是七八识共同配合完成的，变造莲花这样的事，坟墓里那些事，去警觉前世的子女这些事，变起前世亲人那些事，都是七八识两个一起做的。那些都是如来藏变起的法尘相，第七识意根能够缘过去，作意、触、受、想、思，决定以后，祂们两个一起就运作出来了。</p><p>八、问：所有信息都收存在如来藏里，意根是这些信息能存能取的功能。当意根根据意识的了别作了某个决定时，这个决定的心行和内容就成为种子，通过意根存入如来藏（此为因）；当以上决定的内容将要实现的各项条件成熟（此为缘），因缘具足后，如来藏了知，随缘将前面意根存入的信息内容（种子））起为现行，意根随即攀缘到，触受想后，思心所唤出前六识起身口意行，而造业的所有信息，再以种子的形式通过意根存入如来藏，成为新的因，待缘成熟再成果，如此往复。是否是这样？</p><p>答：是这样。七大种子是如来藏里本有的种子，不是从五阴那里收藏的，造业的业种子，是如来藏收藏进来的，如来藏既输出本有七大种子，也输出业种；业种现行要依靠七大种子，业种完全现行以后，受报结束，业种就消失不复存在了。</p><p>事情的重要与否，属于六尘境界，如来藏不能判断。即使如来藏输出业种时，也不是按照业种的重要程度输出来的，而是依是否缘熟这个条件。如果如来藏是按照重要程度来输出业种，如来藏就有选择性，就不是法尔如是的输出业种了；祂就能通融，不是毫不留情铁面无私的了。况且如来藏也不能了别业种的重要程度，如来藏不知道业种重要不重要，但是重大的业种，业缘容易成熟，容易被输送出来而实现果报。</p><p>如来藏不分别业种的重要性，不管业种重大不重大。事情的轻重缓急是七识分别出来的，如来藏也同样分别不了。否则，如来藏就有情绪，有烦恼，有人情世故，就有喜怒哀乐，实际上如来藏并没有这些特性，也不知道事情的轻重缓急，不按照轻重缓急出生业缘。如果如来藏知道事情的轻重缓急，那么意根跟如来藏说说情，求祂通融通融说，我这个福业非常重要，先给我输送出来，让我先发财，以后我一定改邪归正。看看如来藏有什么反应，这绝不是能够融通的事情，如来藏没有缝隙，什么也通融不了。</p><p>至于说阿罗汉的神通有限，佛的神通无量大，还有一些没有神通的人，那是七识本身的功能受到限制，与如来藏没关系，与七识造作的业种有关系。比如杀了人，如来藏虽不分别业重不重，但是这个事情本身的影响是大的，肯定不是一个人的如来藏在收藏业种，至少有两个人的如来藏记录业种。如果将来杀人者受报，也被杀一次的时候，必须业缘成熟，两个人的业缘都要熟，两个人必须遇见，杀缘成熟，才能一个杀，一个被杀。不管这个业种重要与否。意根的心行，能够把如来藏里业种现行的缘提前或者错后成熟，这是完全可以做得到的。涉及到的人多，感情强烈点，各自意根的执著重一点，就会促成业缘快速成熟，但是假如因缘不具足，业果还是实现不了，只能等因缘成熟的时候。</p><p>九、业种遇缘如何现行出来的</p><p>意根因为无明，攀缘性强，祂不肯寂寞，也不甘寂寞，总是要了别和造作，就会有无明妄动，于是如来藏随顺着就会现起三界法。意根在现行时，五遍行心所法就会随着运行，其中思心所就要时时不断地思量作主宰，如来藏必然会随顺配合出生万法。当意根没有无明时，祂也有意愿、有誓愿，比如佛的意根灭尽一切无明了，但是由于佛曾经发过无量的清净大愿，依靠这些大愿，佛的意根以及意根的心所法就会不断的运行，那么佛的无垢识就会配合，现起三界世间一切万法，广利无量众生。意根如果什么也不想做，一念无明断尽，又没有愿力，众生就不能正常生活，只有长期处在深定中，或者入到无余涅槃当中，无所作为了。</p><p>如来藏法尔如是地输出业种，实现众生的因缘果报，产生三界世间一切万法。所有业种都存在如来藏里，这些种子何时缘熟，或者已经缘熟了，如来藏都知道，然后祂就会输出缘熟的业种。那样，众生业缘现前，就是酬尝众生的果报时，业种输出来时，就是了缘时和实现业报时，于是众生的果报就现前。</p><p>十、意根是现起三界世间一切法的动力</p><p>意根促使如来藏产生了宇宙器世间，同时也是业种促使如来藏出生了宇宙器世间，是为了五阴的出生和生存做准备。意根与业种是相应的，意根就代表业，不管是善业还是恶业，还是不善不恶的业。</p><p>宇宙器世间的出生是三界的有法，是业种使然。所有众生的业缘成熟时，就促使所有如来藏输出四大种子，形成四大，所有众生的如来藏共同变造宇宙器世间，造好之后，众生才能出生。目的性在于意根，意根没有目的，三界世间的业消失，就会像阿罗汉一样入无余涅槃，这样三界也要消失。</p><p>十二因缘法就是讲这个众生轮回的原理，业因缘成熟，众生出生；没有器世间，就没有生存环境，众生出生的因缘就不成熟。这个缘也是意根促成的，意根是现起三界世间一切法的动力。</p><p>十一、如来藏在无余涅槃里如何出生意根的</p><p>阿罗汉的意根因为对三界世俗法全部放弃，完全不执著，不感兴趣了，意根在寿命终了才能灭去，阿罗汉就入无余涅槃，只剩下如来藏。如果阿罗汉要从无余涅槃境界里出来，如来藏里必须存有欣乐于大乘法的业种存在，这是如来藏出生五阴世间法的动力，这个动力是推动如来藏出生意根，继而又出生五阴世间的力量源泉，这个动力就是存在如来藏里的业种。因为意根对世俗法没有意愿和执著了，祂必须有其他方面的意愿，才能再次的出生和推动五阴世间三界万法的生起，那只有对于大乘法和成佛的向往，除此就没有其他意愿和动力了，心如死灰，难以复燃。</p><p>当业种成熟时，如来藏依业种才能出生意根，意根出生以后，与业种业力相应，意根就有出生世间法的作意和思心所的现行，如来藏就配合意根出生中阴身，在中阴身又寻找父母共同投胎。因为如来藏里有欣乐于大乘法的种子，意根就要拥有色身，意根的思心所生起时，如来藏配合，因此就有中阴身的现起，继而又有五阴身的出生。五阴身出生以后，就能遇到大乘佛法，于是顺理成章的修学大乘佛法。所以佛在阿罗汉入无余涅槃以前，都给他们讲大乘佛法，为他们种下成佛的种子。</p><p>十二、众生的意根一定与业种相应，到地狱中，意根现地狱众生的习气。到恶鬼中，众生一定现恶鬼的习气。到畜生中，众生一定现畜生的习气。到人中就有人的习气，做天人有天人的习气，当阿修罗有阿修罗的习气。那么菩萨就有菩萨的习气，菩萨历劫教化众生，一定有教化众生的习气，菩萨这种习气是好习气，众生与菩萨习气相应，就是菩萨。</p><p>如果前世在某道生存时间长了，就有某道众生的习气，到其他道里，意根也相应的现出原来的习气。比如佛的大弟子憍梵波提是四果罗汉，前世五百世做牛，有反刍的习气，做人做阿罗汉时，吃饭还是像牛嚼草一样。有些人有恶鬼的习气，前世当恶鬼时间长，有些人有阿修罗好斗的习气，前世当阿修罗的时间长，嗔心和嗔习非常坚固，即使做菩萨了，也能表现出一些阿修罗的嗔习。</p><p>十三、众生离开业力，诸佛菩萨离开愿力，则无一切五蕴世间法。而业力愿力都与意根有关，离开意根，也没有世间一切法，如来藏单独不成事，也不多事，无欲无求，只满众生愿。</p><p>十四、只要如来藏能变现出来的法，意根依如来藏都能见能了别，称为意根的默容。意根了别以后，如果执著，再生起思心所，如来藏依之再变根身器界或者六识。如来藏所变现出的一切法，都是意根在背后推动出来的，包括业种业力的推动，意根就与业种业力相应，心行符合业种，业种都是祂指使造作出来的，所以一切法终究都是意根推动出来的。</p><p>色身也是由意根掌握和控制的，要看意根有多大能力控制。色身的寿命一方面涉及到业种的问题，一方面涉及到禅定和福德的问题。有禅定时，意根的心力非常大，意识的心力也大，就能改变身心世界。禅定也有定福，也能改变业种。定力强，意根和意识控制色身能力增强，意根可以随意控制色身，想死立即死，想活可以再活几十年、几百年、上千年，寿命由意根说了算。因为业种改变了，福德也修出来了，那么意根对于暂时的生死问题就可以作主说了算。</p><p>十五、我们一般都是生来就具有了某种福德，在母胎里富贵的命运就注定了，出生以后就开始享福，或者到某个时段就开始享福。这是第七识意根带过来的福德，种子存在如来藏里，意根与种子是相应的。意识是后天出生，不是从前世过来的，在母胎里和少年时又没有积福，所以意识不具有福德，但可以享受福德。与生俱来的福德和智慧都是意根带过来的，由意识来享受。现世意识配合意根再次修福修慧，业种成熟时现世就受福德智慧之善报，业种不成熟时，由后世的意识享受福德智慧的果报。</p><p>同理，与生俱来的无福无慧的命运也是意根带过来的，意根与薄福的种子相应，命运就是贫穷下贱，苦难深重，果报由意识来承受。今世的意识再配合意根造作恶业，业种成熟时现世意识就受恶报，业种不成熟时就由后世的意识受恶报。</p><p>十六、有神通的人，能知道未来世要发生的事情，未来世要出现的事情其业种肯定还没有成熟。如来藏肯定能了别到还没有成熟的业种，关键是意根是否能了别到同样没有成熟的业种。如果意根了别不到成熟和不成熟的业种，那么意识是如何知道未来世还没有出现的事情和已经发生好多劫的事情？意识的宿命通又是如何现起的？意识所了知的一切法，都由意根先触先知先觉，然后才能作意让意识细微了别，意识才能了知意根所触所知的法。意识的宿命通，以及梦中的意识了知将来将要发生的事情，都来自于意根，由意根所牵引而了知。因此说意根能接触和了知还没有发生的事情和未来世的事情，这是意根依靠如来藏对业种的了别而作自己的了别。</p><p>意识提前知道要发生的事情，事例很多，比如要地震之前，有的动物就提前知道，知道后表现出烦躁不安。地震还没有发生，业种还没有成熟和现行，或者说业种还没有完全现行，动物们的意识是如何知道有灾难要发生，而惊慌失措的？如果意根不随着如来藏缘业种，意识如何能缘到业种？人在要死之前，或者临出事故之前，都有预感。事情没有发生，业种没有现行，为什么能预感到？意根不缘业种，意识为什么有感觉？做梦时，梦见几天以后几个月以后要发生的事，醒来就感觉有特殊的事情要发生。如果意根不缘业种，如何能有预知梦？这些未来事情都是意根先觉知，然后再警觉意识觉知，以采取对策。</p><p>十七、七大种子的数量是固定的不变异的，虽然数不过来。如来藏用这么多的固定的种子，变生一切法，法灭时，种子全部回到如来藏中，再在其他法中出生，变生其他法。种子在法上是刹那生刹那灭回去的，一切法都是刹那生灭变异的，不是恒久不变的，所以是无常的。</p><p>意根与业种子相应，但是意根的智慧不用现到种子里取，智慧一直与意根相应，就是说意根一直都有智慧。比如说我们一旦学会了做饭，这辈子任何时候遇到做饭的缘就会做饭，这个手艺意根一直都带着。意根熏习过的法一直存在心里，祂一直都懂，那祂的智慧就一直带着，不用去如来藏里特意取种子，但与种子一直是相应的。</p><p>十八、业力，顾名思义，就是业行的力量。这种力量很大，大多数众生都难以抵挡，只能随着业力而漂流，难以自拔。这种力，就是意根的力，意根就代表业，意根有力，因为是作主识，可以为所欲为，很多时候意识招架不住。后边还有如来藏一味的顺从意根，释放业力种子，那众生只能在业力中苦苦挣扎，在生死大海中头出头没。这就靠意识修学善法，不断的积聚力量，以诱导和对抗意根的业力，只能慢慢扭转业力，恶报渐渐轻微，善报逐渐增强。</p><p>一切法无不依业力而显现在心中，即使众生接触到同样的外六尘，由于业力不同，各自的如来藏传导到胜义根里的内六尘就有所区别，每个众生受到的影响就不同，对同样的境界感知感受就不同。最著名的例子就是，天人、人类和饿鬼见同样的一条河，外相分一样，而所见的内相分就不同，受用就不同。</p></div>"
},{
    "title": "第九章　意根的四分与直觉",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第九章　意根的四分与直觉</strong></p><p>一、见分和相分能否分离</p><p>六识的见分不能离开六尘相分，而六尘相分可以离开六识的见分。离开相分，见分就不存在了，没有所见的相，见分不能单独的存在，一定是先有六尘的相分，才能有六识的出生，六识一出生，见分就出现，五遍行心所法现行，同时就了别和显现相分，识上有相分的出现，自证分就现前了。</p><p>第七识意根也一直有相对的相分存在，意根的见分依如来藏的见分，能见如来藏所幻现出的一切法，一直在了别如来藏变现出的相分，没有断绝过。见分刹那都与相分在一起，五遍行心所法一直都在运行，识上一直都有相分出现，见分、自证分一直现行运作。但是意根在五阴世间没有出现时，是没有相分的，只有如来藏和意根两个识心，没有其他法的存在。之后，因为意根不甘寂寞，向外探寻，如来藏才依之变现出三界世间，五阴身就出现了，意根的相分也就出现了。</p><p>如来藏的见分一直存在，种子和意根一直是如来藏所了别的相分，出生三界世间以后，一切法都是如来藏的相分。意根所见的是如来藏变现出来的虚妄相分，就像镜子里的影子一样，不是实质的物质色法。</p><p>二、问：当意根坚持己见、固执己见的时候，是四分中的哪种起用？当意根忏悔的时候，是四分中的哪种起用？什么是坚持己见？为什么要忏悔？</p><p>答：如果意根要坚持己见、固执己见，就是意根知道和了解了自己的见解，并且认为自己的见解是正确的，从而要坚持不改，这是意根的证自证分功能。如果意根要忏悔，就是意根认识到了自己的过失，从而想忏悔，这是意根的证自证分功能。</p><p>己，就是自己，己见就是自己的见解，这是自证分。如果坚持己见，首先是知道自己有见解是什么见解，这是证自证分。知错不改，知道自己有错而不想改正过来，也是证自证分。意根要忏悔，是因为意根认识到了自己的错误知见，想忏除和改正，发誓以后不再犯，就会去忏悔。凡是知自己的任何事，都是证自证分。</p><p>三、问：相分是否就是见分的结果？眼识的相分就是所见的显色等，那么意根的相分是什么？意根恒审思量的心行法相为何？意根的心行法相与恒审思量的结果如何挂钩？行相与相分的关系是什么？</p><p>答：相分，就是见分所见的对相，不是见分的结果。见分不出现时，也有相分的存在，只是不显现在识心中罢了。见分的结果是自证分，已经见了相分，相分显现在识心里，就是结果，叫作自证分。</p><p>意根的相分很广泛，如来藏见一切法的本质境以后，再变起的相分影子，意根都能见，除了如来藏里的七大种子。意根叫作遍计所执识，因为能见一切法，才能默容一切，因为能见一切法，才能普遍计着执著，包括六识能见的六尘相分，以及六识不能见的六尘相分，以及不属于六尘的相分，过去未来的相分，只要如来藏能见能显现，意根都能见。</p><p>意根恒审思量时，思心所不断的现前运行，以思心所为主，对所思量的法，不断的作意触受想，不断的考量、推敲和抉择，有慧心所伴随运行，也可能有善恶心所法出现，也许有定心所和其它心所法参与运行。意根心行的法相，也就是心所法运行的行相。意根的这些心所在一起和合运作，才能不断的恒审思量，才能思量出一个结果。</p><p>如果意根的善心所参与运行，心行是善的，思量的结果就与善相应，就要抉择造善业；反之，心行是恶的，思量的结果就要抉择造恶业。如果意根的定强，智慧性就强，思量的结果就有智慧性，否则，智慧性低，结果就要造愚痴业。识心运行的行相，能被意识所观察了知到，因此就是意识的相分。运行行相就是相分，能被识心观察到的就是相分，八个识识心本身也能被意识观察到，因此八个识也是意识的相分。</p><p>意根和第八识如果都能反观到自己以及自己的心所法，七、八识以及心所法也就是本身的相分。</p><p>四、意根到底能反观自己，还是反观不了自己这个问题，意识如果没有智慧，就不清楚观察不出来，也判断不出来意根干了什么和正在干什么，意识没有智慧的时候对于意根的一切都不知道。所以很多人那么相信自己的判断力，简直没有道理。就像无始劫来我们如来藏对五阴世界做了很多很多的事情，可是我们意识无知，根本不知道，又因为无知就否定如来藏的存在和祂所做的功德。意识不知道并不等于祂不存在。</p><p>同理，由于无明观察不到意根的运作，不代表意根没有那些功能作用，不能如此如彼的运作。其实意根是有反观作用的，能够反观自己，所以祂才死不改悔、坚持己见、固执己见，或者是深切的自责和忏悔。只是意根的反观力比意识弱很多，也不能经常反观和时时反观自心，意识定力好有智慧时可以经常反观时时反观自己的心行。</p><p>当睡着的时候，意识可以不知道自己睡着了，因为睡着了没有意识，但是意根知不知道你睡着了？意根绝对知道自己睡着了，所以意根不想让这五阴身有活动。如果意根不知道自己睡着了，祂就会什么都想造作，然而意根知道自己睡着了，也知道天黑，所以祂对于六尘境界都不想知道的太多太细，六识老老实实的一个都不现起来，身体也老老实实的不动。意根知道是自己在睡觉，所以意根是有反观力的，只是意识无法观察意根，他就说意根不知道自己睡着了，没有反观力。眠熟了的情况，意识不知道不等于意根不知道，这说明还是把这两个识给弄混了，把意识的知与不知，当作了意根的知与不知。</p><p>同理，昏迷的时候，意根肯定知道自己昏迷了，所以在清醒的缘出现时，努力挣扎着要醒过来，要起来活动。入定时，意根也知道入定，死亡时也知道死亡，在植物人状态，意根也同样知道，在这些特殊状态里，祂的心行和表现都与正常时不同。所以有个结论：只有无知的人，才说意根什么也不知，什么也不做，什么也不行。如果意根什么也不是，那么你自己又是个什么？同样什么也不是！因为，所谓的你就是意根！</p><p>五、问：有的人撒谎时会脸红，有的人撒谎时，若无其事，很自然。为什么有此差别？脸红因为什么？脸不红，不青不白又为什么？</p><p>答：脸红是意根所为，意根有惭愧心，知道撒谎不好，心里惭愧才脸红。撒谎时脸不红的，意识也许是故意撒谎，也许不故意撒谎，都是意根撒谎成了习惯，促使意识所为。或者两个识心都不觉悟，或者只有意识觉悟知道撒谎不好，意根还不知道撒谎不好，没有反观力，证自证分没有出现，因此就没有惭愧心。</p><p>惭愧心所，是善心所，没有修行的人，或者是意识没有惭愧，或者是意根没有惭愧，或者是两个识都没有惭愧心所，都不善。惭愧心所，由长期熏修善法出生，明理即有惭愧，无知者无惭愧。有惭愧心所的人，能慢慢改正错误和恶习，没有惭愧心所的人，不能改正恶习，我们暂时也不要指望他能改变自己的恶习气。</p><p>恶习气烦恼，是意根指挥主导造作出来的，有时是受意识的唆使，有时是意根熏染意识而为。而真正改变恶习，一定是由意根主导改变。意根改变恶习，首先一定要认识到自己的恶习，知道自己不对，有恶习不好。而知道自己不对不好，就是意根的证自证分的功能，是意识熏染引导的结果。</p><p>意根的证自证分功能越强大，意根越有智慧，越有觉悟。意识也是如此，证自证分功能越强大，越有观照力，越能觉悟，越有智慧。而意根的觉悟，证自证分功能，由意识引领，由意识激发出来，意识要先觉悟，当意识有智慧时，才能做得到。</p><p>六、寻找意根观察意根，了知意根的是意识。意根缘法多，无法清晰了别，就要借助于意识细了别。但是意根也有证自证分，能够发现自己证明自己，意根特别自信相信自己，坚固执著自己，就是意根的证自证分，为自己辩护，维护自己，有反观自己的能力。</p><p>意根能反观自己、观察自己、了知自己，但是意识智慧不足时并不知道，没有智慧故。我们能知一切法还是意识的知，意识没有智慧，一切法存在也不知。当意识智慧增长时，所知一切法范围才能扩大增广，知道的越来越多。尤其是意识转识成智以后，其智慧能现量观察和了知意根的一些功能作用，能更深细的了别意根的功能作用。意识的了知能力、观察能力和智慧，修到佛地才能圆满具足，不再增长。</p><p>七、意根有自证分，能了别法，心中出现了影像，就是自证分的结果。意根能知道自己知道了什么法，这就是证自证分。意根也有自信满满的时候，这就是证自证分。意根固执己见，就是证自证分。老顽固，顽固透顶了，不肯改变自己的观点看法，认为自己就是对，里边就有证自证分，否则不会固执，不会顽固。睡着无梦的状态，意根仍然要触法了别法，能知道六尘，能观察六尘，意识却不知道意根究竟在干些什么。</p><p>证自证分是识心对自己的反观，二禅定里有意识，意识的见分、自证分和证自证分都存在，只是很细微，智慧不足的时候，就不能了解自己的见分、相分、自证分和证自证分情况。多学习一些禅定的知识，然后再入定体会，就能现量了解更多的法。</p><p>意根也有见分、相分、自证分和证自证分，六七识没有转识成智时，就分不清这些内容，观察不出来。对地前菩萨来说意根好像没有证自证分，不能反观自己，而地后菩萨就能观察出来意根有证自证分。有些深法，佛对地前菩萨都不说，怕菩萨们不理解而生出误会。</p><p>八、楞严经原文，世尊云：“诸灭尽定得寂声闻。如此会中摩诃迦叶。久灭意根圆明了知。不因心念。”</p><p>灭尽定为四禅八定之上的九次第定，在灭尽定中，不仅灭尽了六识，意根的受和想两个心所也灭去了，但意根还有作意、触、思三个心所在起作用。如果意根的五个遍行心所全部灭去，那就没有了肉身，也没有了前七识，只留下如来藏，就入无余涅槃了。入到灭尽定里的四果大阿罗汉，因为灭掉六识和意根受想心所法，没有了受觉，没有了对六尘的取着性，心就得寂止了。虽然只剩下三个心所法，大迦叶却能够用这三个心所法，圆明了知一切法，代替六识的功能作用，而没有障碍。没有六识的念心所，也没有意根的念心所，不用动心念，意根就能圆明了知一切法。</p><p>意根圆明了知，代替六识，能了别六尘境界，更能知六尘之外的境界。那么这个知里，见分、相分、自证分以及证自证分全部具足，也具足意识的思惟和了知方式，也能了别六尘微细法，无所不能。当意根代替六识了别的时候，意根就能了别六尘微细法，色声香味触都能了知清楚，也能反观自心，现量了别一切法，也有比量和非量了别，通善恶无记三性，能回忆，能记忆，六识的功能作用都有。</p><p>九、直觉就是意根的觉性和感知，很直接的就能感知到某些事情，不用意识的思惟和想象。意根的直觉往往很准，因为是直接来自于如来藏的业种信息，不用意识思惟猜测，又与业力有一定的关联。有的直觉，不容意识的怀疑和劝导，意根内心很坚定的就相信：是这样，没错。这是如来藏了知业种以后对意根的警觉，但不能直接警觉意识，因为如来藏与意识离的远一点，意根先知道信息，这些信息有的是有关自己的，有的是有关他人的，都是如来藏用特定方式告知给意根的。有很多人总是凭直觉来感知一些人和事，并且很自信，就是因为与业种直接挂钩了。</p><p>直觉与业种紧密相连，比如福报的业种成熟时，该发大财了，如来藏就用特定的方式通知意根，但意识还是很怀疑的，抱着怀疑的态度，但是意根的直觉不容商量就作决定采取某种方式去赚钱，结果就真的发了大财，作股票搞投资的人，有不少人是靠直觉碰运气的。但不是所有的直觉都对，意根缺少智慧时，直觉就会总出错，尤其是意识也没有智慧，不能如理的分析思惟判断，就顺从意根的抉择，结果就可想而知了。看一个人，直觉能感知到此人的一些信息，那是自己的如来藏通过对方的如来藏把信息沟通出来，让自己的意根了知到，意根再传给意识，让意识再加分析考量和判断，就能对此人有个大概的评估和了解。</p><p>十、直觉跟如来藏有密切的关系，直觉的内容和信息，直接来自于如来藏，不然意根就不能有那么神奇，能未卜先知，没有发生的事情，祂能提前知道。这是意根在使用如来藏、支配如来藏为自己提供更多的信息，然后让意识了别，并采取措施去主动接受和避免一些事情的发生，那么如来藏就能够被我们主动使用，就看我们有没有这个本事了。</p><p>有时一个人的一个眼神一个小动作，就能把这个人的信息透露出来，这是意根了别到了对方如来藏里业种的信息，暗示给六识，意识了别分析以后就能对此人判断了知个大概。这是两个如来藏之间的信息沟通以后，意根再从自己的如来藏那里获得对方如来藏的信息的结果，那么一个人前世后世的习性，另一个人的意根就能感知道，这是直觉的作用。修到一定程度，就可以直接用意根的直觉来了知一切法，直觉判断人和事有时很准确，有时也出错，关键要看意根是否是被业力所遮障了，意根是否清净，智慧性是否很好。</p><p>十一、直觉功能很强大，非常深细时，意根就能代替意识、代替五识来了别一切法。很多人相信直觉，就是相信意根自己，就等于是相信业种。而相信自己，就是反观到了自己的了别，认为自己的了别是正确的，这就是意根的证自证分；相信自己的抉择是正确的，不容意识再思惟判断，这是意根的证自证分；固执己见，不听意识理智的思惟，也不听他人的劝导，顽固不化，这也是意根的证自证分。</p><p>相信自己的自我价值观，相信自己很尊贵，相信自己很有价值，相信自己很能，相信自己优越，这里有先天性的相信，也有后天通过观察比较的相信。先天性的相信，就是意根的自信，一定是意根的执我性、我慢性产生出来的，这里有意根的自证分，也有意根的证自证分。</p><p>后天的相信，就是意识的自信，是意识通过接触环境，与其他人比较生出来的自信，自己信自己的知见，信自己的思想观点，信自己的聪明才智，这里有意识的自证分和证自证分。自我，先天性的自我，生来就有，是意根的我见我慢，是意根的自证分；后天的自我，一个是受意根的教导影响的结果，一个是环境熏染的结果，是意识的我见我慢，是意识的自证分。</p><p>意根的证自证分还表现在祂的顽固不化性，意根因为习气深重，又愚痴不知好歹，尤其是不知自己有无明和染污，因此意根就固执己见，顽固的执著自己的思想和习惯，认为没有错，所以意根就不可教导，不能劝说，无论怎样绝不改正自己，这是意根的证自证分，祂能了知到自己的习惯和思想，但因愚痴不知对错，不能如理判断自己，无始劫的无明习气，很不容易消除。</p><p>人很固执是因为意根的执取性和我执性，意根执取自我，认为自己的一切都正确无误，都对都好。意根认为自己作意触受想思的都对，作的决定都对，因此不肯悔改，不听劝告，执意妄为，意根只要认为自己的抉择是正确的，知见是正确的没有错，那么意根就能反观到自己的抉择和思量性，这就是意根的证自证分。总是在人前突出自我，表现自我，就是意根的我执性我慢性。意根我执我慢重的人，在佛面前，也许就能给佛讲法，恶道众生如果我执我慢重的，在人前就能给人讲做人的道理。</p><p>十二、意根的证自证分与意识的证自证分大不相同，意识的证自证分能反观到自己的善恶性，知道自己的运行行相。而意根没有觉悟，智慧低劣时，不能反观到自己的烦恼染污性，也不能反观到自己的愚痴性和我执我慢，但能反观到自己对业种的了别，能反观到自己的思量和抉择。自信里就有意根的证自证分，是意根信自己的直觉和决定，相信自己思量和抉择的没有错。意根有证自证分，能证明自己了别和决定正确与否，但祂没有智慧时，所证明的未必正确。地前菩萨无法观察意根的证自证分，主要是意根和意识缠得太紧，不好分开，意根的运行也太隐蔽和深细了，智慧和禅定不足时，非常不容易观察到。</p></div>"
},{
    "title": "第十章　意根与无明",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十章　意根与无明</strong></p><p>一、众生所有的无明，都是无始的，都叫作无始无明，都是无始劫以前就存在的。既然如此，无始无明主要与哪个心体相应？与第七识意根相应。楞严经里世尊讲过，无始劫以前混沌未开时，只有如来藏和意根存在，没有三界世间，没有五阴世间，没有六识。那时所有的无明就存在着，没有一种无明是后天生成的，因此说所有无明都是意根的无明。楞严经这段说明世界的起因，在此之前是没有世界的，因为无明，意根向外攀缘，才形成了世界，没有世界时，不能有五阴身和六识，五阴身必须有居止所依处。</p><p>世界起时，也要经历无数劫的时间。为什么虚空为同？如果有不同的虚空，一个世界一个虚空，虚空就有界限，有界限就不是虚空了。这是最初五阴世间形成的过程，在此之前是一片混沌状态，谁混沌？意根混沌，因为那时没有宇宙虚空天地世界，只有两个识心。意根起念向外攀缘时，是不知不觉的，非常微细的。于是如来藏随顺意根逐渐演变出了虚空和世界，以及后来的五阴世间。</p><p>既然无始劫以前没有虚空和世界，那么如来藏和意根，有时间和空间的概念吗？有此处的如来藏和彼处的如来藏吗？如来藏和意根有来去吗？能从一处到另外一处吗？如来藏和意根既然没有时间和空间之说，神足通是怎么回事，我们就应该知道了。往生诸佛国土，为什么刹那间就能到达，也应该知道了。</p><p>二、意根的无明不是因为意识没有智慧，而恰恰是由于意根的无明，意识才没有智慧。所以系铃人不是意识，意识没有给意根系缚无明烦恼，虽然意识反过来能熏染意根，解铃需要意识解。意根的无明是无始劫以前就一直存在的，从来没有明过，不是意识邪教导的结果。因为最初的时候，只有如来藏和意根，没有意识，那意根的无明怎么能是意识的过咎呢？意识的无明恰恰是意根的过咎，是由意根熏染主导的结果。</p><p>三、意根的无明是否有种子</p><p>种子分为如来藏里的本有七大种子，与五阴造业后天所形成的业种。楞严经中世尊说过无明是无始劫以前就存在的，众生从来没有明过。那么众生无始劫以前就有如来藏和意根存在着，意根与无明相应。在最初时，并没有五阴存在，因此也没有造作过身口意业，也就没有业种存在。这就说明意根的无明是没有种子的，而且无始劫以前就有无明，没有缘由，没有道理。无明是以心所法的形式表现出来的，而心所法没有种子，是识心的助伴，通过修行心所法由恶转变为善，无明就消尽，意根就由染污变成清净，转识成智，成就佛道。</p><p>意根也是识，既然是识，就由识种子形成，形成识以后，识就有明和无明两种，识心的运行要么是明，要么是无明，必居其一。意根的无明灭尽，全部是明时，众生的修行就结束。而意根里的无明是无始劫以来就一直带着的，从来就没有明过，叫作无始无明。</p><p>四、如何理解成论中说的所知障是现非种，无始无明没有种子，只是现行法？</p><p>成唯识论里说的所知障，是指众生对于成佛的正确方法不知不懂，或者是所知甚少，因此而障碍了自己的修行，道业不能得到增长。对于正确的成佛之法无知，或者是所知甚少，就是一种极大的障碍，因为不知，就没办法实际去着手修行，修行就不会上正路。</p><p>这种所知障，是识心的现行状况，不是种子。种子分为如来藏里本有的七大种子，和众生身口意行落下的业种两部分，业种又分为善、恶、无记三种。无明，就是愚痴，就是不明、不知、不懂，它分为一念无明和无始无明两种，其实一念无明也是无始的。所有的无明，对于一切法的不知和不懂，不是作为种子存在如来藏里的，而是识心运行出来时，痴心所法伴随着一起运行，识心就表现为愚痴无明了。</p><p>其中一念无明与意根相对，无始劫以前意根就存在着无明，因此就起心向外寻觅，遂有三界世间的出生，于是就现起了众生的根身器界。众生依五阴身起惑造业，才有业种的存在。而这些无明，虽然属于识心的染污性，但却不是种子，当识心运作时，是以心所的形式运作的。而心所法，本没有种子，是伴随着识心同时出现的。除了五遍行心所法是普遍伴随于识心的运行，其它心所法，都是时有现行，并不总是时时出现，而且还会改变和消失。比如贪嗔痴慢疑等等一念无明的烦恼心所法，通过修行就会修除掉，不再现行出来。</p><p>无始无明的意思是，众生从无始劫以来，一直不知道有个法界实相心如来藏，众生从无始劫以来没有与大乘佛法相应过，从来不知道要修行大乘佛法，回归自己的清净自性，成就佛道。这种无始无明也与意根相应，也没有种子，只是能与识心同时现行出来，伴随着识心而运行，并且能够被破除和消尽，它没有实际的种子存在如来藏里。</p><p>五、傲慢做作这些烦恼习气的来源</p><p>傲慢、做作这些烦恼习气都来源于意根，意根无始劫以来就有无明。因为有无明，所有的贪嗔痴烦恼以及烦恼的习气，一直都带着，都存在意根里，由如来藏现行出来。这些烦恼因为是从无始劫以来一直带过来的，其惯性的力量很大，很难改变。比如一个人习惯于做某些事情，不用思惟，遇缘就做，或者遇缘就做快速的反应，这都是意根的习气惯性的力量，难于克服。</p><p>比如某些人总是说，我习惯于如何如何，这个习惯于如何如何，在六道其它各道里，如果条件允许，还是会习惯于如何如何。乃至于出了恶道，再回到人间，还是习惯于如何如何，即使到处碰壁，还是习惯于如何如何，根本看不出有什么改变。有的人比较严重一点，就是即使会要命，他还是习惯于如何如何，比如有人因为喝酒酒精中毒，别人劝他别喝了，再喝就要命了，他会说，那没办法，不喝也得死。意根就是这样顽固得要命。</p><p>那要如何改变意根的习气烦恼呢？只有通过学佛修行这条途径。学佛以后，断了我见，再修出初禅定，烦恼就会一点点地脱落，直至断尽成为阿罗汉。这只是断烦恼的现行，习气还埋伏着。意根的烦恼习气和惯性，从地上菩萨开始才一点点的断除，都断尽就修到八地菩萨了。明心见性以后，成为三果人，就开始断烦恼，进入初地以后，烦恼可以断尽，可以成为四果人，却留一点点思惑，以便再获得色身继续佛道的修行。</p><p>菩萨为了留惑润生，可以留一点点烦恼不断尽，不取阿罗汉的正位。虽然如此，菩萨进入初地就开始断烦恼的习气，而小乘的阿罗汉没有断就入无余涅槃了。菩萨断尽烦恼习气以后，就进入八地，二大无量劫的修行时间就过去了，离成佛只有三分之一的时间。深细的烦恼习气，需要二大无量劫的时间，才能断尽，轻微的烦恼习气，在初地就能断尽。但是一般所说的烦恼习气，比如喝酒之类的，赌博之类，如果下决心，当下就可以断除，几个月就能断除，并不太难。因为熏染这些恶习的时间不能太长，往往是后天熏染的，那就容易断除掉。</p><p>六、无明是怎樣緣行的</p><p>十二因缘法里说，无明缘行，行缘识，识缘名色等等，这是十二个生死链条，都是因为有前一支，导致有后一支，前一支不灭，后一支就会出生。但是后一支的出生，不是前一支生的，而是每一支都是由如来藏出生，借着前一支的缘，如来藏才能出生后一支。没有前一支的缘，如来藏就不能出生后一支，意思就是说，前一支灭，后一支就随着灭去，不能存在了，那么生死链条就断，众生就解脱。第一支是说，众生因为有无明，意根就会向外攀缘六尘境界，攀缘世间万法，因为意根攀缘，心不寂静，六识的身口意行就不断，必然要不断地出生，产生各种行为造作。</p><p>而这些身口意行，不是无明直接产生的，无明没有实体，没有种子，不能产生六识的身口意行，所有的身口意行都是如来藏出生六识造作出来的，都是如来藏依各种缘产生出来的。缘灭，身口意行就灭，最主要的缘，是意根的对自我以及一切法的执著，这就是无明，是一念无明。阿罗汉把这一念无明灭尽，就不愿意再造身口意行，在世时只是随缘度日。命终时身口意行就会都灭掉，不会再有未来世的五阴出生，更没有未来世的六识出生，未来世的身口意行就更不会出生了。</p><p>七、一切法的发生和出现，都是八个识和合运作的结果，或者是如来藏、第七识和第六识和合运作的结果。一切法的范围相当广泛，凡是众生所能接触到的，了别到的，都属于一切法的范围，还有更多接触不到，了别不到的法，也属于一切法的范围。为什么有那么多了别不了、不知不懂不证的法？因为无明。</p><p>众生在没有证得如来藏的时候，不可能观察到在一切法上如来藏的运作，如果信根不具足，也不承认在一切法上有如来藏的运作，那这意味着什么呢？意味着此人认为一切法是自然而然就有的，是天然就有的，这就是无明，是自然外道；或者认为一切法是各种因缘出生的，不是如来藏出生的，这也是无明，是因缘外道。这两种外道正是世尊在楞严经当中所指出的两种外道邪见。</p><p>众生在没有证得第七识的时候，同样也不知道在一切法上都有第七识的运作，更不能观察在一切法上第七识的运作，如果信根不具足的人，就不承认在一切法上有第七识的现行。那这意味着什么？意味着此人不承认一切法是第七识推动的结果，不承认一切法是第七识作主抉择的结果，也不承认第七识的遍计所执性，不承认第七识能默容一切法，不承认第七识依意根而能见一切法，从而主导一切法的现起。</p><p>如果不承认意根和第八识在一切法上的运行，那此人就是六识论者，只知道有眼耳鼻舌身意六识对六尘境界见闻觉知，并且把第六识的知性当作如来藏的，把第七识的功能作用当作第六识的功能作用，严重的混淆佛法，是非不分，其结果就会陷在愚痴的六识论泥潭里不能自拔，长期处于黑暗的无明深坑中，受无量生死苦恼。</p><p>众生的无明最难破除，愚痴最难度化，其根源是由于众生的福薄，没有修行过戒定慧，或者戒定慧很薄弱。只有长期的在佛法大海中受熏，才能慢慢的积累一些福德，并且加强戒定慧的修行，无明才能一点点的融化和转薄，才能成为一个諸佛菩萨可以度化和摄受之人。</p><p>八、五阴世间是否由如来藏为因，意根的无明烦恼与业力为缘而现起的</p><p>无明众生的五阴世间是由业力为缘，如来藏为因而出生。如来藏是现起万法的因，缘就是众生的无明和业缘。意根的无明没有灭时，业缘成熟，如来藏就会依意根的无明烦恼变现五阴世间，这一切都是由意根的攀缘执著而产生的。</p><p>意根喜好攀缘，是因为意根有无明烦恼，有执著性，祂不肯放弃自我和五阴世间，祂决定想要有五阴身心时，如来藏就会随顺祂，输出相应的业种产生出五阴世间万法。意根从无始劫以来就存在的，阿罗汉入涅槃时，就能灭掉，而且是如来藏给祂输送识种子，祂才能运行。意根无始有终，但佛与菩萨永远不会让祂终了，永远运行下去，如来藏依此出生五蕴世间万法，以利乐有情众生。</p><p>九、意根为什么是无生有灭的</p><p>意根先天就存在，不是后天出生，不是先无后有，法尔如是就是这样，没有什么道理好讲。说祂有灭，是因为如来藏为祂输送识种子，执持祂的运行，祂才能存在。意根的存在是有条件的，一旦条件不具足，生存的因缘灭了，意根就会灭去，不回心的阿罗汉们都已经灭了意根。意根如果不是先天就有的，那么先天就只有如来藏存在。而只有如来藏存在，就是无余涅槃境界，这是阿罗汉们断尽了意根对三界法的执著性所导致的。</p><p>众生如果先天就在无余涅槃里，那么众生本来就是阿罗汉，不是本来就是凡夫。既然众生是无余涅槃里的阿罗汉，为什么会从无余涅槃境界里又出生意根，又出生五阴，成为造业的凡夫众生，又有生死轮回了呢？这就没办法解释了。况且意根里没有无明，没有业缘，单独如来藏自己就不能产生任何一个法出来。</p><p>单独一个如来藏不会产生三界法，不会产生众生的五阴，如来藏里如果没有意根无明的昏扰扰相，就不会去出生什么法，祂要是出生了什么法，一定是因为意根的无明和攀缘，除非是佛菩萨的大愿力能够维持意根的存在。所以一定是先天就有意根的存在，而且是意根先天就具有无明的，如来藏才能随顺意根的无明，而变起根身器界，从而产生了三界的宇宙世间万法。</p><p>意根的无明和执著性，可以通过修行灭去，那就要修行世尊所讲的四圣谛理和明心见性的真如如来藏之法，让意根的三种无明都灭去。其中的一念无明灭掉以后，众生意根就不再执著自我五阴，就会愿意灭掉自己，就能出离世间生死苦。意根一旦不执著了，就可以把自己灭去，进入无余涅槃里，那就没有意根，只有如来藏。俱解脱的大阿罗汉在灭尽定中，可以灭掉意根的受想两个心所法，还剩下三个心所法，也可以灭掉，都灭尽以后，整个的五阴十八界就消失了，所以意根是可以灭的。既然能灭，那祂就是生灭性的，不是真实的法，而且意根的存在，是如来藏刹那刹那为意根输送识种，意根才能现行起作用。</p><p>但是意根灭掉了一念无明，仅留一点点贪爱，就可以继续存在三界世间里行菩萨道，地上菩萨就是这样，意根没有烦恼转识成智了。意根无明都灭掉时，比如果地佛，就转意根的识性成智慧性，照样可以继续分别，那是有大智慧的了别，不是内心昏暗的愚痴的了别。凡夫的分别都是无明愚痴的，圣人的分别就有智慧，是善分别。而意根或者是七个识的分别，就是有为法的分别，有为法的分别，就是虚妄的分别。虽然虚妄生灭无常，但是还有必要去分别，有必要善于分别，无论谁也离不开分别，否则就与死人一样了。</p><p>十、意根为什么无始劫以前就存在着</p><p>无始劫以来，不是因缘而生的法有两个，一个是第八识如来藏，本来而有，不用任何法出生。一个是意根第七识，也是本来就与第八识同在，不是后天出生的法，不是第八识籍由任何缘所出生的。但是意根仍然是生灭法，不实在法，需要第八识不断的输出识种子才能维持其存在，需要第八识不断的执持才能存在。 为什么意根无始劫以前就一直存在着，不是因缘所生的，还仍然属于生灭变异的法呢？因为意根无始劫以前就本来存在着无明，尤其是一念无明贪嗔痴烦恼，不知自己虚妄，因此我见与我执就不能灭除自己，与第八识同存同在，而不消失。那么意根一旦把一念无明断尽，我执断尽，必然就会消失，只余第八识自己单独存在，无形无相，无喧无闹，寂静涅槃。</p><p>十一、如何让意根忏悔往昔的无明过咎</p><p>证得大小乘的无我以后，现前观察五蕴十八界和世间万法都是由如来藏所出生，都是无我的，一切法都不是我，意根确认这点，就不会再把五蕴的色受想行识的功能作用当作意根自己的功能作用，不再把五根、六尘和六识的功能作用当作是我和我所有的，也不再把意根自己当作是真实的我，也同样不会再把如来藏的功能作用当作是自己的，从此就有能力做到不再贪执五蕴和一切法，慢慢就会断除对这些法的执著性。因为这些法都是如来藏的，不是意根自己的，认识到这个事实，意根就会放舍一切，两手慢慢松开了，心放平了，业障消除了，我执法执断尽，无明断尽，彻底无我，就成佛。</p><p>无数人的意根由于无明，不明法界实相，无始劫以来一直都在不断执取，什么都抓，不但没有得到益处，反而抓了一身业障烦恼。如果一切法都是自己的根本不用抓，如果不是自己的也抓不到什么，只能得不偿失。每个人都对世间的人事物理抓的紧紧的，一样都不肯放弃放舍，结果抓了一身的业障，烦恼无量，堕入苦海，还不自知，还要不断的抓。越贪堕落得越深，失去的越多，就越愚痴，越苦恼。从来没有尝到过解脱滋味的人，不知道放舍自我放舍一切法，那个身心该有多么轻松自在。众生就用一个字形容概括：傻！愚！痴！</p><p>十二、第七识的无明攀缘执著性是法尔如是的，本来就如此的，没有原因，没有产生无明之因，如果无明有因，就不是无明了。详阅楞严经中世尊说过意根的无明无根无来处，无始劫以前就有无明，所以我们无始劫以前就是众生，从来就没有明过，因此从来就没有做过佛。</p><p>第七识因为无明，不断的执取攀缘，其所攀缘执著的对相是如来藏遇缘输出的业种所变现出来的六尘万法，并且也输出第七识的识种子，第七识才能有因缘攀缘执取六尘万法。修行就是要修除七识的无明攀缘执取性，断除意根的我执和法执，把一切法都归还于意根，执障消尽，无明就灭尽。七识一旦无明灭尽，就彻底转识成智，众生就成佛。七识无明的灭尽，全部依赖着如来藏，证得如来藏，学习如来藏，明得如来藏里所有的种子功能作用，不把一法当作我，七识的无明才能灭尽。</p><p>十三、众生生心动念时，是因为识心接触到了境界，对境界有了领受，了别了境界，知了境界，对境界起思量，把境界当作真实存在之法，然后就反反复复地了别、感受、思量，于是就思绪万千。这样识心不断地起灭造作，苦受就不断，生死也就不断。</p><p>而阿罗汉的识心在刚刚触了境界之时，就会移开，不会接着往下进行了别，也不想了别更多，只是粗浅地知道了境界，不会详细探究，不会反复思量和感受，后边的情绪化的心境就不出现。因此，他们的心境就平和安稳，没有感触，没有思绪，识心少于现起，这样后世的生死业种才能断灭，才能出离生死轮回。</p><p>众生因为有无明，把境界都当作真实有，所以感受不断，心念不断，行为造作不断，六识不断生起，就会有未来世的名色出生，生死轮回又开始进行。众生的无明灭，则行灭，这是对二乘人来说，大乘菩萨可以灭无明，永远不灭身口意行，但是身口意行一定要清净，才能不造恶业，免去恶报和生死轮回苦，得到解脱。</p><p>意根与法尘相对，如来藏产生意识，六识都是如来藏在根触尘时产生的，一切法的来源都是如来藏。凡夫的意根无明深重，没有得到降伏时，就要到处攀缘六尘境界，让身口意行不断地生起，这样心思散乱，不得定止，心不清静，烦恼不能得到有效的降伏，也就没有真正智慧的生起。</p><p>阿罗汉的意根已经得到有效的降伏，烦恼现行消除了，不再执著五阴世间，也不再攀缘世间法，所以六识少于分别，心念清静。我们要想心得清静，无烦无恼，就要尽量降伏意根，让祂少于攀缘世俗法，在世俗生活中，只要有一个应对的心就好，不要把一切法都当作真实的非常较真的来对待，这样意根慢慢地就能被降伏下来，意识也就能很少生心动念了。</p><p>十四、十二因缘法：无明缘行，行缘识等等，其中的行指意根的心行，识是指六识。那么无明一定是指意根的无明，意根因为无明，就有心行想要出现身口意行，于是六识就会出生不断运行，六识就不得不造作身口意行，以至于不能灭去。</p><p>这里的无明，都包括了哪些内容？一定包括了全部无明，贪嗔痴慢疑邪见等六个根本烦恼，以及二十个随烦恼。意根因为这些无明烦恼，不断促使身口意行的出生和现行，让六识不断造作，六识就不能清净下来，不得无为，不得灭去，造作的种子必留下来，再出生后世的有。</p><p>六转呼为染净依，也是这个意思。意根是六个转识清净和染污的依止，六识依着意根的清净性和染污性，才能有自己的清净性和染污性。意根清净则六识清净，意根染污则六识染污，所以六识的烦恼来源于意根的烦恼，六识的清净来源于意根的清净，解决好意根的问题，就解决了六识的问题，也就解决了所有的问题。那么断除意根的贪嗔痴烦恼以及所有烦恼，也就断除了六识的贪嗔痴烦恼以及所有烦恼，意根没有烦恼了，六识也就没有烦恼了；断除了意根的无明，也就断除了六识的无明。那么意根的烦恼心所法绝对不会比六识少，六识的烦恼心所法绝对不会比意根多，意根的善心所法不会比六识少，六识的善心所法不会比意根多，否则意根就不是六识的染净依了。</p><p>一切法全部都是因为意根而出生和运行，没有例外，没有特殊情况。意根是产生三界世间一切法的动力和根本原因，一旦意根无明灭尽，又没有愿力，五蕴世间顿时灭去。意根若没有无明烦恼时，六识没有理由造作无明烦恼业，不能自在不能作主故。</p><p>法法相通，没有一个法是独立存在，或者是与其他法相违逆的。只是个人修行时，是否通达了这些法，没有通达时，此法就是此法，彼法就是彼法，互不干涉。通达时，法法圆融，互补互助，互相都能紧密联系起来。佛法通达时，从任何一个侧面，都能证明此法，也能证明彼法，能发现更多的事实与真相，智慧圆融无碍。</p><p>十五、意根的有覆性</p><p>意根恒执一切法为我为我所有，也执如来藏的功能作用为我自己所有，这样就掩盖了如来藏的真实性、如如性和各种功能体性，意识就不可能知道如来藏的功能和体性，这样就迷茫地在生死中流转，只认假不识真。 如果意根不认如来藏的作用是自己的，意识就会寻找、参究真正的自己如来藏，就会证得真实法，免除生死轮回苦。如果意根没有无明，不认五阴为我，意识心也不会认五阴为真实，也就不能有五阴的生死苦。</p><p>生死流转的根本原因是因为意根有无明，才现起五阴十八界三界世间法，因为有无明就覆藏了一切法的真实性。意根是从凡夫位到佛位一直都存在没有灭亡过的识心，那么成佛时，可以说是祂做佛，也可以说祂不做佛。其实八个识中找不出谁做佛，也找不出谁不做佛，肯定是八个识和合在一起，才有佛的形象、佛的功德和力用，做佛成佛这一法是虚妄的。</p><p>十六、色身的生灭变异，从受精卵开始一直到灭亡，都是如来藏依照业种所为。但是如果没有意根对三界世间法的渴求，业种只能眠藏在如来藏里，无法现行出来，那就没有受精卵和以后的色身，也就没有了色身的生灭变异可说。如果没有意根对三界世间法的渴求，也就不会有所造作，不会有那么多的业种存在和现行，一切都静悄悄的，无事。</p><p>在受精卵中，没有五识，也没有意识的时候，意根究竟在干什么，是什么心行，我们的意识在没有转识成智的时候，肯定观察不出来一丝毫。即使在意识非常清醒的情况下，正在造作身口意的当下，也无法知道此刻的意根正在干些什么，是何等心行，如何运作的，这些个不知就是无明。凡夫的无明比不知更重，不知道的法就要千方百计的否定，以自我安慰，掩饰这些不知，却是欲盖弥彰，徒增业障。</p><p>十七、非量就是错误的认知，不合理的思想观念。在明心见性之前，七识心对自我的认知都是非量，都是邪见。即使断我见证得阿罗汉果对五蕴自我的认知也不完全是现量，因为阿罗汉还不知五蕴身心的实质到底是什么。所以对五蕴身心的认知完全是现量观察，没有一丝邪见的人是佛陀，佛陀的智慧完全是现量智慧。</p><p>对五蕴自我的非量认知完全来自于意根的无明，所以学佛修行的所有目的和最终目标，就是要破尽意根的非量认知，破尽意根的所有颠倒邪见，意根无明断尽，就成为大乘无学。</p></div>"
},{
    "title": "第十一章　意根与神通的关系",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章　意根与神通的关系</strong></p><p>一、什么是真正的神通</p><p>神通是意根神，而让意识通。因为如来藏能变现一切法，接触一切法，了知一切法，意根依如来藏就能接触一切法，了别一切法，知一切法。意根与一切法没有隔碍，这就是意根的神通，而意识就有极多的遮障，不能触一切法，不能知一切法，不能到一切法处。</p><p>最神最妙的就是如来藏，意根也是如来藏的功用，意识也是如来藏的功用，五识也是如来藏的功用，五阴十八界都是如来藏的功用，一切法说起来其实质都是如来藏的功用，没有一个法不是如来藏本身的功用，三界世间是如来藏自己依缘在玩转一切法，而缘也是如来藏的功用。乃至于十方世界佛国土，十方诸佛菩萨，也是如来藏的功用。全体皆是如来藏的一个真实的法界，无二无他，找不到除如来藏之外的法有一丝丝真实性和自主性。黄金世界全部是黄金制成，无有少法不是黄金。佛法即如此，妙极了。</p><p>我们每一个心念，不管是善的还是恶的，还是不善不恶的，皆是如来藏的功用。我们七识的所有心所法，作意触受想思，全部是如来藏的功用，我们的身口意行全部是如来藏的功用。乃至于我们在修学佛法，努力熄灭贪嗔痴，也是如来藏的功用，甚至于我们生起的无明，生起的一切烦恼染污，同样是如来藏的功用。无有少法不是如来藏的功用，无有少法从如来藏之外而来，心外无法，满目都是如来藏。</p><p>意根如果能现量证得此法，贪嗔痴烦恼就会逐渐全部脱落，无明就会逐渐全部断尽。这些法在定中观行，才能证得，心在定中，才能与如来藏相应，才能深切的感知到心中所现起的法都是如来藏的功用，从而心住法中，破除烦恼，断尽无明，有大利用，成佛有余，得大自在。</p><p>二、五神通的原理</p><p>比如天眼通，天上地下，无论多么遥远的距离，无论多么微细的物质色法，都不能阻碍眼识意识所见。为什么如此？因为一切色法全部是如来藏里的色法，如来藏无形无相，没有距离，没有远近和大小，意根依赖如来藏，能见到如来藏里的一切色法，没有高低远近大小广细之分，意根不用移动就能见到如来藏里的物质色法，没有时间和距离之说，那么眼识意识在一定条件下依赖意根而能立时见到如来藏里的一切色法，没有时间距离高低上下远近之分。</p><p>比如天耳通，能在霎时间听见远近一切声音，没有时间远近距离之说，没有声音粗细之分，一切声音即时能闻。为什么如此呢？因为一切声音都是如来藏里的声音，是如来藏幻化出来的，意根依靠如来藏而能了知一切声音，无论远近高低过去未来和当下；耳识意识在一定条件下依靠意根，也能了别一切声音。</p><p>比如宿命通，无论是自己还是他人的过去未来当下所有所经历和要经历的人事物，意识全部都能了知到。为什么如此呢？因为这一切事都是如来藏里的事，是如来藏幻化出来的，是如来藏里的档案，意根依靠如来藏能了知一切人事物理，意识在一定条件下依意根也能了知这一切法，如在目前，没有阻碍。</p><p>比如他心通，所有众生的心念，意识全部能了知到。为什么如此呢？因为众生的心念，都是如来藏里的法，都是如来藏幻化出来的，意根依赖如来藏能了知到这一切法，没有障碍；意识在一定条件下依靠意根，也能了知众生的一切心念，不管是过去久远时劫，还是未来和当下的心念，没有障碍。</p><p>比如说神足通，身识和意识能带色身到遥远的他方世界，能到极近的一个众生的色身当中，没有障碍。为什么如此呢？因为一切处所全部在如来藏里，如来藏无形无相，没有远近广狭之分，意根依如来藏能立时到如来藏里任何处所；身识意识在一定条件下依靠意根，也能到如来藏里任何处所，没有时间距离远近广狭之说，一时即到。</p><p>众生因为无明不知此理，不知如来藏的广大，不知自己有多能，而一意孤行地非要去追逐没有用的世俗法，造作贪嗔痴业行，阻碍了自己的神通道力，实在是得不偿失。在佛法上追求，要什么有什么，如来藏里什么都不缺少，只要满足福德资粮，成佛也是小事一桩，有何难？</p><p>但是为什么众生还要修行三大无量劫，才能成佛呢？怪只怪，意根贪嗔痴太炽盛了，执著太严重了，没有用的世俗法没有一样不执著的，有用的佛法却不执著。去除意根的执著就需要二大无量劫，再去除意根微细的无明，还得需要一个无量劫。难就难在此了！</p><p>如来藏的万宝囊里，愚痴众生只会取那些没有用的系缚自己不得自在的包袱，从来不知道取让自己发财致富得解脱的宝物，一轻一重，却不知哪个轻哪个重。这就是无明！想一想，每个人所追求的，系缚自己生死，不得自在的世俗法都有哪些，是否觉得沉重？是否想解开绳索？是否想得自由？是否想拥有大千世界而弃沙沤？</p><p>三、禅定和神通是身心变化的表现，色身和识心由意根掌控，神通来自于意根对色身的放松和不执，越不执，对色身功能的阻碍越小，禅定越好，神通越大。五阴色身本来虚妄，不真实，因为意根的执著控制，使得色身显得很真实，其功能就受到限制和阻碍，不能上天和入地，不能变化自在，不知前后世。</p><p>当通过修习禅定，压伏意识，意识不能对意根灌输关于色身存在的错误信息，意根不受错误的诱导，就能忘记色身，把色身空去，心中没有了色身的概念和感知，完全忘记了色身，不执著色身，那么色身就不能成为障碍，心要到哪里，色身就能到哪里。因为色身是虚幻不真实的，是由地水火风四大微粒构成的，其实也就是四大微粒，而四大微粒对一切法都无障碍，所以色身就无障碍，并且能随心意而出现无量变化，上天入地，钻山越水，与一切物质色法都不相妨碍。</p><p>如果心中认为色身是真实的，念念都能感知色身的存在，那么色身就成为障碍，有质碍性，与一切色法就不相容。当意识不了知色身，不对意根进行邪教导的时候，意根就能不执色身，不抓色身，色身在心中就空了，好像不存在了，那么禅定神通境界就现前。意根放松放弃对色身的控制，是相当不容易的，无数人对色身最粗重的吃喝拉撒都看不破，放不下，一定要贪口味，贪享受，贪舒适，贪自在，这是最严重的对色身的执著，最粗浅的欲界定都不能出现。何况更根深蒂固的贪欲和情执，更难看破和放下，色界定就更不能出现了，色身就成为心中的质碍物，不能出现任何轻安和神通变化。</p><p>有失必有得，什么也放不下，就什么也得不到。无数人每天对色身照顾得无微不至，念念都是色身的感受，严重执著色身，修行没有入心的人就这样贪执色身，什么殊胜的身心觉受也享受不到。对自我执著减轻的人，吃什么都可以，穿什么都可以，住什么都可以，用什么都可以，怎么都可以，无所谓。色身就是牢笼，心中有色身，就被关在牢笼里，不得出离牢笼，不得自由，就会处处被色身所拘碍。有人间的贪欲，不可能有神通，神通的获得要求严持戒律，心得清净。</p><p>过去有个有神通的人，能在天空中飞翔自在，因为偶然对异性动了一点点心思，神通在座位上马上就消失，自己知道后，就假装告诉他人说：我这回得走着回去，不在空中飞了，这样能让所有大众都能瞻睹我。这是犯了淫戒的结果，只是心犯，还没有涉及到身体犯戒。还有提婆达多，强求其他比丘教了禅定和神通，于是就能飞到欲界天上，最后一次上天，因为喜欢天上的花，就向天人求取，天人没有给他，他就想：这花无主无我，我摘一朵又能怎样？刚一动念头，自己就从天上掉了下来。这是犯了偷盗戒，只是心犯，还没有涉及到身体行为的造作。如今的人，戒律心行是如此缺漏，欲界定都很难具足，初禅就更难现前，何况四禅，更何况神通。众生处处都贪执不舍，就连吃穿住用的贪执，能减轻一点点，就很困难了，色身被拘执的非常坚固，不可能有禅定的出现，更不可能有神通。</p><p>四、宿命通的原理</p><p>宿命通是指意识对前世后世人事物的了别，已经经历过的人事物在意识心中显现出来，还没有经历过还没有出现的人事物也在意识心中显现出来。这里所说的经历，当然不是指意识本身的经历，而是指从来没有灭过的意根的经历，因为意识要不断的灭，不是连续的，今世的意识不是前世的意识，也不是后世的意识，因此今世的意识没有经历过前世，也不能到后世去经历，所有的经历都是指意根的经历。</p><p>意根一直是与前世相通的，祂没有前世今世和后世，也没有生生世世，祂一辈子的时间可以与如来藏一样长，因此自己从前所经历的一切重大事件人事物理都能记得，那么祂就有记忆性。因为这种记忆性，就有习性和惯性作用，总是要习惯性的指挥身心造作身口意行，符合自己的习惯，几乎不用思惟，不用考虑，马上就能作出抉择，与自己心行相应。</p><p>意识的宿命通是如何现起的？那就要看意识出生的条件。意识出生的条件，首先是意根与法尘相触，再由意根决定了别法尘的细相，意识才能出生。因为意根只能了别法尘的粗相，不需要意识的协助，只有在意根需要知道细相时，思心所才决定让意识出生了别，自己再做二次了别。</p><p>自己与其他众生的前世和后世，意根依靠自己的如来藏就能接触和了别到，那就属于独影境了，与外五尘无关，不与外五尘共。如果意根想要了别细相，思心所现起，如来藏配合出生意识，意识就单独了别此法尘独影境，就能知道自己和他人的过去世和未来世。</p><p>但是意识心宿命通的发起是有一定条件的，否则就可以随时有宿命通，任何人都能有宿命通。宿命通的发起需要禅定这个条件，而且禅定要深，四禅之前都很难发起神通。一般来说，四禅以上的禅定才能发起神通，发起宿命通。二禅以上的定中，五识灭去不现起，意识深细不活跃，没有粗重的了别活动，五识不干扰意根的活动，意识干扰得少，还有身根上的生理活动，让意根分神。四禅叫作舍念清净，是把意识的微细念头也舍弃了，意识心非常清净，几乎不干扰到意根的活动。</p><p>在四禅里，身根上的呼吸、脉搏、心跳也停止了，还有细胞的新陈代谢，身根的活动减少，意根的分神也就减少，很少挂念身根，也不挂念六尘境界，那么意根的功用就能很大程度的显发出来。意根就能发起神足通、他心通、天眼通、天耳通、宿命通，四果罗汉之前以及凡夫和外道，只能发起这五神通，没有漏尽通，因为他们都没有断尽烦恼，内心还有漏，也就没有漏尽通。由于烦恼的关系和智慧程度的关系，每个人的神通大小也不尽相同，差别很大。</p><p>五、意根与宿命通和记忆的关系</p><p>宿命通是把意识的德能开发出一部分或者是全部，让意识贯通于前生和后世。有宿命通的人，能了知八万大劫前后所有的经历，甚至超过于八万大劫的事情都能知道，佛能了知自己和众生生命体全部的经历。宿命通不是主要开发意根的功能，因为意根通于无量劫以前，甚至生命最开始的时候，也能根据业种业缘了知一部分未来世。但是在开发意识功能的时候，却少不了意根的佐助和配合，否则意识绝对不会有宿命通。意识通过宿命通所了知的一切法，都是意根从如来藏库房里搜索出来的，然后再交与意识，让意识了别，意识就知了。而意根本来就知，只是无法言语，不能表达出来，偶尔在关键的时刻，才能暗示出一部分内容。</p><p>意识是如何知道已经发生过的事情，和还没有发生的事情？已经发生的事情，作为业种收存，这些业种有些已经受报而消失了，有些没有受报，因缘不成熟，业种也没有现行出来，意识是如何知道的？意识能直接了别业种吗？消失的业种如何能了别？未来还没有发生的事情，业种现行的业缘也没有成熟，意识如何能了别？</p><p>我们知道，意根是与业种相应的，众生的身口意行落谢到意根那里，意根了别之后，再存入如来藏里；后世，意根的心行就与业种相应，与生生世世的业种相应。当意根需要了解某部分事情时，就会促使如来藏现行这部分业种，意根作意触受想思之后，交给意识了别，这就是意识的回忆。意根为什么不能回忆呢？因为回忆属于比较细微的了别活动，意根不能细微了别，只能了别个大略内容。这是其一。其二，意根从无始劫以来一直没有灭除过，生生世世的所有事件都亲自经历过，祂对现在时刻之前的一切法无所不知，因此只要有禅定，意识就能了知到意根所知道的一切法。</p><p>意根对于一切法都能进行大略的了别，祂知的内容和信息相当的广泛，几乎无所不知，就是不能知细节，只能知个大略。这些大略的知，就构成了意根极其又极其丰富的经验和记忆。所以意根在很多情况下，没有意识的配合了别，就能作出极其快速的抉择，都是根据自己无始劫以来的所有经历，根据自己无始劫以来的大量经验，这就是意根做事老道的原因。所以意根绝对有记忆功能，有记忆属性，却不能回忆，但却能帮助意识回忆。如果意根没有记忆，就不能让意识有回忆，二者是互相联系，不可分割开的。意识不能有单独的任何一个功能作用，都是与意根绑在一起的，都是意根协助和推动的结果。</p><p>宿命通，主角还是意根，一切法的运行，主角都是意根，当然如来藏更是主角，比意根还主要，这个暂时不谈，免得有些人解悟。只谈意根和意识，就大有文章可作了。其实，意识和五识都是意根的工具，都是配角，为意根所用而已。意根老道，能干很多事，但需要意识帮一定的忙。六识就是意根的工具，离了六识，在世俗里，意根就做不了什么事。如果身体不行，六识真的不能工作了，祂就得换身体，换新六识当自己的工具。意根究竟是如何用六识的，对于普通人来说，也是大秘密，揭开意根的秘密，那个智慧就相当了不得。</p><p>一些心理学和生理学研究者，已经揭示出一部分了，比唯识学要细致入微一些，也比较实用，我们可以作参考。意根与业种之间的关系，也是大秘密，意根一定能了别业种里的信息，否则宿命通如何出现？如来藏了别业种又不能表示出来，只有意根和意识了别，才能显示出来，意识也不能直接了别业种，意识了别的一切法都要通过意根，越不过去意根。意根先触法尘，然后了别，最后思心所现行，决定之后，意识出生，触法尘，了别法尘，思心所现行，作决定，这个过程意根全部了知。意识心所运行的全部过程，都作为一种信息，刹那刹那落在意根里，意根依之，思量抉择，再依据过去世的经验一起思量抉择。抉择后，意根指挥意识执行，意识就得乖乖的服从。</p><p>意识接触的一切法，都是意根丢给祂的，意根不给祂，意识就得饿着，空着，不能出生和运行。意识在意根面前，当不了老大，不比意根更超前，不比意根了别的范围更广，只是比意根了别更细致一些而已。智慧不足的人，只能看到表面意识的运行，观察不到深细的意根的运作。</p><p>心理学和生理学研究者都找到意根的踪迹了，都能观察一部分意根的运作，难道我们学唯识的学佛人，还找不到意根，证不得意根吗？如来藏对意根的了别，是了别意根心所法的运行，对五阴身的了别，既了别五阴身的运行情况，同时也了别业种。意根对六识的了别，是了别六识的运行情况，也就是心所法的运行。</p><p>六、意根与神通和潜能的关系</p><p>睡前简单回顾学习内容，这一步能帮助你有效地记住那些需要记忆的内容，如果你在睡前温习一遍白天学过的内容，你的潜意识会在睡眠的时候继续加工，以保证你记得更牢。意根在睡眠中还在工作，意识是无法理解和观察意根在做什么工作的。意根如何加工白天的信息为自己所用？为什么有定才有神通，才知过去未来？</p><p>定，就是身心少动或者是不动，不但能压制身体的动，更能压抑控制意识少于现行，这时意根减少了对六尘的攀缘，能充分发挥应有的作用。意根都能发挥什么作用？在催眠术里，就是压抑意识减少分析思惟活动，不让意识再引导和指挥意根，意根的本能就能完全表现出来，就能呈现出这个人的本来思想状态，没有掩饰和伪装。然后另外一个人代替意识引导意根，不伪装不控制，意根就能把自己过去世经历的事情表露出来，把自己内在的思想以及痼疾都表露出来，当然是借助于自己微弱的意识表述。神通，就与此类似。当对方状态比较稳定时，能深入引导，挖掘出意根根深蒂固的习气，意根如果能顺从的话，习气就能改变一些。</p><p>很多的法理都能说明意根能执持和改变一切法，背后有如来藏配合，虽然实际上都是如来藏执持和变现的结果。</p><p>众生没有真正能忘记的事情，意根都知道。当意识被催眠，或者有禅定时，意根就能把忘记的那段往事挖掘出来。正是意识阻挡意根不能面对那段往事，意识要面子，意识有自尊心，意识有荣辱心，意识知道善恶，当然要阻挡意根表露真实，而意根没有意识这些心行。如果意识不影响和遮挡意根，意根就能面对一切善恶荣辱，内心比较坦诚。</p><p>六识只不过是个工具，被意根利用利用而已。意根通过控制大脑，就控制了全身，调动了全身。当意识少于现行，把色身忘了，不再暗示意根色身的各种状况，不让意根知道有色身的存在和阻碍，意根就可以指挥色身作出超常的行为，类似于神通。其实是意根忘记了五阴的存在，不再考虑五阴身能与不能，只考虑自己要达成的目标，五阴身就顺从着意根的要求实现了目标。</p><p>如果意根记着五阴身的存在，就要考虑五阴身能与不能，不能的事，意根不会指挥去做，那么五阴身就成为阻碍，意根不能充分发挥其功用，就没有神奇的事情发生，就是所谓的神通不能现前。意根如果能不受五阴的影响，发挥潜能，输出强大的功用，就能操控一切，改变一切，包括让意根变现出佛国土，和无数色身。外道的神通都是发挥意根功用的成果。</p><p>在关键时刻，意识忘记了自己和五阴身的存在，什么思想也没有，不影响意根，意根就能超常发挥，意想不到的事情就能发生。意识想不到的神通就是如此出现的，定中意识被抑制，意根发挥功力，就有神通出现。修定就是为了控制意识，意根起大用，既能证法，又能改变应该改变的一切法。</p><p>七、另类禅定下的意根</p><p>人在极端恐惧，极端紧张时，也是有禅定的，内心可以很冷静，虽然紧张害怕，但是意识只能缘目前正感害怕的事情，不能再考虑其它的事情，散乱心没有了，意根也同样减少其他法的攀缘，里面全是对这个令人害怕恐惧的事情，定就出现了。这样就能有灵感激发，把事情的来龙去脉思考清楚，从而把事情处理好，或者作出超人想象的抉择。这个时候，属于大脑一片空白的时候，是意识不能浅思惟的时候，意根就大显身手了。这就是禅定的力量，这类经验，一般人应该都有。</p><p>当你斗志昂扬的时候，当你作出一个大的抉择的时候，当你下定决心的时候，当你准备搏击长空的时候，你的内心是没有语言文字的，没有意识肤浅的思惟考量，都是意根的无语言文字的那种力量在支撑着。这时候根本不需要意识的决心和决定，不需要意识表态，意根完全能作主决定，祂要奋斗了，祂要果敢了，祂要拼搏了，祂要努力了，祂已经暗下决心，准备成功。表面下决心，他人能明显感觉到的是意识的决心，语言口行比较多，表白比较多，但没有力量。</p><p>那么我们学佛就应该发挥意根的功用和力量，去实现我们需要完成的目标。应该发大愿，去设定一个长远的大目标，然后想办法达成。发愿的力量应该是很大的，意根真真正正的发愿，其力无穷大，早晚都要实现。因为这是意根从心里往外真正的发愿，而不是停留在意识的口号发愿上，意根就能促使其实现。</p><p>意念的力量很大，这个力量是指谁的力量？是意根指挥如来藏的功能作用。意根之所以有力量，是因为祂是作主识，能主宰六识的身口意行，能主导一切法的出生和灭亡，能挟如来藏天子以令诸侯。意识却没有什么力量，一个头发丝都动不了，祂只能挟意根这个天子以令诸侯，通过意根来实现自己的愿望和梦想。而意根是通过如来藏来实现自己的愿望和梦想，所以最终做主宰的还是如来藏这个真天子。</p><p>意动一切动，指的就是意根的动，意根五遍行心所法启动出来，一切法都能现行出来。意识动时，也只是动动念头，没有行动力，办不了事。但是意识能牵引意根的动，引导意根的动，意识是意根的一个好帮手，功也不可没。</p><p>八、意根对一切法的操控能力</p><p>催眠是把对方的意根引导到一个柔顺信从的状态时，经过深入引导，挖掘出对方意根里埋藏的根深蒂固的习气或者是隐患，如果对方听话能够顺从引导的话，就能改变意根的习气，消除隐患和恶疾。每个人通过各种方法改变了自己，这些现象都能说明是意根在操控着一切法，背后有如来藏配合祂改变和执持着一切法。意根通过控制大脑，就控制了全身，调动了全身，其执行者就是如来藏和六识。六识只不过是个工具，被意根所使用而已。</p><p>当意识少于现行，暂时把色身忘了，不提醒意根有关色身的事情，不让意根关注有色身的存在和阻碍，那么意根想做什么，色身就能随着做什么，就可以让色身作出超常的行为，类似于神通。意根能够利用如来藏发挥其调动色身和操控一切法的潜能，让如来藏输出种子来操控一切，改变一切，包括让如来藏变现出佛国土和无数色身。外道的神通也都是发挥意根功用的成果。</p><p>九、在意根上用功，就能开发出神通来。所谓的神通就是，如来藏通一切法，意根通如来藏，六识再通意根就行了。修四禅八定，六识就能通意根，向意根要信息，把意根知道的信息，都能挖掘出来。</p><p>如果意根不执身，不执五阴身为真实有，意根想干什么，就能干什么，不用考虑五阴身能不能行，意根说行就能行。不执五阴身的时候，五阴身就不能阻碍意根，意根想干什么，就能瞬间完成。心里时刻有身体的观念，身体就是负累，什么大事也干不成。内心深处真正没有身体的观念，忘记或者不执身体，神通自然出现。</p><p>十、有神通的人，能知道未来世的事情，未来世的事情业种肯定还没有成熟。如来藏肯定能了别到还没有成熟的业种了，关键是意根是否能了别到同样没有成熟的业种？如果意根了别不到成熟和不成熟的业种，那么意识是如何知道未来世的事情和已经发生好多劫的事情？意识的宿命通又是如何现起的？意识所了知的一切法，都由意根先触先知先觉，然后才能作意让意识细微了别，意识才能了知意根所触所知的法。意识的宿命通，以及梦中的意识了知以后将要发生的事情，都来自于意根，由意根所牵引而了知。因此说意根能接触和了知还没有发生的事情和未来世的事情，这是依靠意根对业种的了别而作自己的了别。</p><p>意识提前知道要发生的事情，事例很多，比如要地震之前，有的动物就提前知道，知道后表现出烦躁不安。地震没有发生，业种没有成熟和现行，动物们是如何知道有灾难要发生，而惊慌失措的？如果意根不随着如来藏缘业种，意识如何能缘到业种？人在要死之前，或者临出事故之前，都有预感。事情没有发生，业种没有现行，为什么能预感到？意根不缘业种，意识为什么有感觉？做梦时，梦见几天以后几个月以后要发生的事，醒来就感觉有特殊的事情要发生。如果意根不缘业种，如何能有预知梦？这些未来事情都是意根先觉知，如何警觉意识觉知，以采取对策？</p><p>十一、神通与禅定力和意根的关系</p><p>所谓的神通意思是说，意根能依如来藏了别一切法。但是意根了别的法，意识不知道，这是没有神通的情形。如果意识在很强的禅定中，识心非常集中，了别力量增强，也能了别到意根知道的很多法。至于意识能知道多少法，在于禅定力的大小，和智慧境界的高低，就是三昧力如何。</p><p>为什么神通与禅定和意根有关呢？色身对六识的影响力控制力非常大，当禅定生起时，色身对六识的影响力和控制力就会减轻，意识脱离色身的控制，不受色身的局限，就能了别到意根所了别的很多法，以及所有法。所以神通出现的第一步，是降伏色身，通过色阴区域，识心能不被色身所控制，心离其形，神通才能出现。色阴，就是色身的一种遮障作用。五阴，就是一种遮障作用。突破过去，就没有遮障了，神通就现前了。吾有身，为一大患也！</p><p>色阴对意根也有遮障作用，意根把色身当作真实，牢牢的执著色身，那就不会有禅定，也不会有神通。意根脱离束缚，意识才能脱离束缚，才有神通。禅定力非常强大，意根的智慧也非常强大时，意根就完全可以代替六识。</p></div>"
},{
    "title": "第十二章　意根与睡眠",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章　意根与睡眠</strong></p><p>一、做梦是因为意根的攀缘执著性导致的，意根因为有遍计所执性，在没有断除其执著性之前，对一切法或者是某些法一定要攀缘执著和不断惦念的，因此睡觉时意根也不肯寂静下来，仍然在攀缘六尘境界，仍然要思量一些法，对所经历的事情仍然念念不舍，自己又没有很强的分别力和思考力，祂就要制让意识心完成祂所要做的事情，意识心就得被生出来，按照意根所攀缘的对象，来进行分别活动，这些分别思惟等等一系列活动就是梦境。</p><p>因为梦中不受粗重的色身拖累和限制，意根攀缘到哪里，意识就能跟着分别到哪里，不受时间空间的限制，自由随意，所以梦里一会儿天上，一会儿地下，一会儿过去，一会儿未来，都可以联系到一个梦境里，时间地点人物事件大多是跳跃性的、不连贯的。俗语说日有所思夜有所梦，就是在说意根。思，就是意根白天在思量惦记着的人事物，晚上不知不觉，就出现在梦境里，都是意根攀缘出来的。如果意根能够减少攀缘，睡觉就能安稳，不会再做梦了。</p><p>要降伏意根的遍计所执性，就要通过意识心的如理分析思惟活动，说服引导意根，让意根不再贪执世间法，这样不仅不再做梦，平时白日里的妄想也能减少和消失。意识通过如理思惟，说服引导意根的过程，就是降伏其心的过程，通过正确佛法的如理闻思，如理的观行方法，把我见断除，之后才能真正的降伏其心，从而断除烦恼以及烦恼习气，我执才能断尽，意根不再执著五阴世间，得到解脱，修行才小有所成。</p><p>二、睡着前后都有意根的活动，要修到相当的程度，才能观察到意根的各种活动，要在意识和意根转识成智，初地二地菩萨以后的事了。醒过来前后的一刹那的活动，没有意识，只能由意根来观察，但是意根必须转识成智才行。睡着以后就没有意识了，醒过来之前，也没有意识，睡着的过程中，意识渐渐微弱下来，以至消失，醒过来的过程中，意识渐渐出现，及至能了别六尘，这中间意根起了很大的作用。祂一直存在着，一直在起用，在控制指挥意识，掌握睡着和醒过来的全过程。祂能了知一些事情，只是了知得不清楚，有时还错乱了别。</p><p>三、睡着无梦的时候，六个识都灭了，只有如来藏和意根还在运行着。这时意根一直在缘着法尘，攀缘内外法，如来藏就随顺着意根一直变现法尘。意根虽然能笼统概略的了别一切法，但因为意识灭了，意识就不知道。在睡着时如果没有重大特别的事情，意根也不特别攀缘，不想有什么造作，意识就不会出现，也就没有梦境，这就是无梦的状态。</p><p>有梦的时候，是意根缘虑重，执著一些法思虑一些法，如来藏就依之不断变现独影境，并且要生出意识来了别造作，心行就不断地造作出来了，这就是做梦。梦中心识会随着梦境而转，梦里却不知是梦，还以为是现实境界，把一切人事物都当作真实的，于是心行不断出现，与醒着时一样。因为梦中没有肉体的遮挡障碍，识心的了别造作，就不受时间处所的限制，就好像是有神通了。</p><p>比如在中阴身的境界里，因为没有实质的肉体的遮障，就会出现神通。鬼神以及非人等等，他们都没有实质的肉体，就有神通，天人也没有肉体的遮障，也有神通，所以神通不应该成为我们追求的目标。我们醒着时，现实世界其实与梦境是一样的虚妄，但却都把六尘当作真实存在的，于是就生出各种觉受，产生各种身口意行，然后增长无明，就流转于六道生死，苦恼无量。</p><p>四、意根执著攀缘不断，六根总是触六尘，如来藏于中产生六识来了别处理六尘。如果不产生六识，虽有六尘，也没有识心去了别，就不知六尘。当身体疲乏时，意根知道身体疲乏需要安歇，对六尘的攀缘就减了，六识的分别性越来越弱，以至于消失，我们就渐渐入睡。</p><p>如果意根了别的法尘特别重大，如地震、非常大的声音、非常亮的光、刺鼻的味道、有人摇晃他的身体、或者内急，意根知道有大事情了，但祂自己没办法处理，就会唤醒六识出来观察和处理，身体出现特殊的情况也是这样。如来藏根据意根的意愿产生六识，或者少于六个识，我们就慢慢醒来了。如果身体睡了一段时间，稍微恢复疲劳了，意根知道后，又想了别法尘，如来藏就会变出意识出来分别，梦境就出现了。</p><p>有修行的人就知道是在做梦，修行好的人在梦里会看护好自己的心，不造作恶业，并且还会修行一些善法。所以从梦境中的行为，就能看出我们修行的层次。活动了一天身心都疲劳了，意根就不想了别六尘，六识渐灭，就睡着了。天快亮时，或身体已经恢复疲劳，意根觉得应该有五阴活动、应该了别六尘了，如来藏就会产生六识渐渐了别六尘，就醒过来了。醒来以后，识心仍然是与梦里一样颠倒，一样执取一切法为真实。只有开悟以后才能小醒过来，成佛后是彻底清醒过来，永远不再颠倒了。</p><p>五、失眠是怎么回事</p><p>我们每天身体的疲劳和轻安等等情况，意根都知道，如来藏变起的身根相分，意根都能缘到，因此也能做简单而粗浅的了别。当意根了别到身心已经疲劳到一定程度时，就会作主让身体休息、睡觉，自己也不再做过多的攀缘，这样就渐渐减少了六识的了别，最后六识灭掉，就进入睡眠当中。每天里身体的疲劳状况和六识的疲劳状况，意根都能掌握，然后根据情况决定是休息还是不休息，是灭掉还是不灭掉，这都是意根作主决定的。</p><p>疲劳是属于触尘，在这个触尘上有法尘的显现，意根能缘到，意识心能了别，身识也能感觉到触尘，意根就会知道触尘如何了，应该如何处理，就会作抉择了。如果没有特殊的事情，意根就会决定睡觉，自己减少攀缘，让六识灭去。可是如果意根有重要的事情要攀缘，要思量，意根一边决定睡觉，一边继续攀缘，意识心就会不断地思来想去，不能灭去，那就会失眠了。如果后脑的神经系统出现病变和障碍，不能自律，不受控制，法尘还是源源不断地输送到胜义根，那么意识就要不断的识别，因此不能灭去，这是失眠的一种原因。</p><p>如果身体太疲乏了，意根虽然决定睡觉，可是祂还会攀缘极度疲乏这个触尘，那么身识和意识就要不断地了别，就不能灭去，也就有失眠的现象。或者是勉强睡着了，可是身体特别疲劳或者特别疼痛，意根觉得事情很严重，又不知道具体情形，于是就要唤醒意识和身识出来了别，我们就会从睡梦中醒过来，来感受身体的疲乏和疼痛，再进行处理。</p><p>还有一种情形，神经衰弱也是睡不着觉。神经衰弱是意识心的思虑、意根的思量过重，心里总在担心、惦记一些事情，意根由于思量惦念过多，就会促使意识不断地思虑、思考这些事情，念念不忘，因此不容易睡着，这就是神经衰弱的失眠现象。意根越惦记的事情、越看重的事情，越不愿意让六识心灭去，就总让六识心来了别、考虑这些事，由于思虑过重，睡不着觉，就表现为神经衰弱，不能自制内心的思念和攀缘。</p><p>六、睡着无梦时也有内相分的色尘存在</p><p>六根触六尘，生六识，六识出生的前提条件是先有内相分的六尘。睡着无梦时，如果没有内相分的色尘存在，那么意识和眼识都不会出生，众生就不会醒过来。所以睡着时，无论眼睛闭与不闭，内相分的色尘是一定存在的。否则，天亮时意根就不知道天亮了，不知道太阳已经升起来了，别人拿手电筒照，意根也不知道，那么人就不会醒过来。</p><p>即使阿罗汉入灭尽定时，仍然会有内相分五尘，和法尘的存在，让意根缘着，否则阿罗汉就不会出灭尽定。有人打坐时闭着眼睛，可是仍然能够看见眼前是亮的，有白色的或者是黄白色的光。禅定浅的人，闭眼时，眼前是一片黑暗，禅定再深时，眼前是红色的光，再深时，眼前是白色或者是黄白色的光，不是黑暗的。即使是黑暗，也是色尘的一种，都是内相分色尘，是如来藏所变现。这说明，眼睛闭与不闭，如来藏都会变现内相分的色尘。同理，其他五尘也如是。</p><p>睡着时，意根仍然能缘到六尘，能了别六尘境界，如果六尘境界很特殊很重要，需要处理一下，意根自己不能处理，就需要六识这些工具来处理。意根没有色身和六识的配合，对于六尘境界就无可奈何，所以只要意根有所企图，都要利用六识和色身来完成自己的心愿，否则纵有凌云壮志，也无所作为。</p><p>七、人从睡眠当中如何醒过来</p><p>人从睡眠当中能够醒过来，一般情况下，是意根觉得身体休息好，已经恢复疲劳了，或者是已经到了该醒的时间了，就想有五阴的活动，想了别六尘境界，于是如来藏生起前六识出来活动。意根自己不能有五阴活动，必须让六识在色身上起作用，才能有五阴活动，这必须有如来藏来配合出生六识，意根生起思心所时，如来藏了别到意根的心行，就会流注出前六识的种子，六个识就出现了，于是人就渐渐地从睡眠当中醒过来。</p><p>而在醒过来之前，是没有六识的，只有如来藏和第七识，如来藏把身体的各种状况以及周围环境都变现出来，意根依此了别到身体状况和环境，觉得应该起床了，于是就醒过来。或者是意根在睡前设定好起床时间，到时间意根就生起思心所，如来藏就会配合出生六识，人就醒过来了。还有一些醒过来的特殊情况，都是意根决定应该醒过来，如来藏就会出生六识，人就醒过来。</p><p>八、每个人每天因什么而醒过来</p><p>意根的攀缘性包括了对时间的攀缘，由于长期做同样的事，意根养成了习惯，什么时间该做什么，意根都知道，这叫作惯性。每个人习惯于什么时间醒过来，也是意根的惯性，世俗所说的生物钟，就是指意根的惯性。如果计划某个时间要做什么，意根就要一直攀缘，然后到那个时间，意根就作意之后六识出现，人就醒过来了。</p><p>但是意根不会具体了别时间，因为时间仅仅是个名相，是心不相应行法，没有实体，不是实法，意根不解名相。时间是依据一定的物体色相而显现出来的，比如太阳光落到色尘上所显现出来的光色、明暗色等等，如来藏变现出来这些现象以后，意根缘到，就了别起思量，知道这时候应该醒过来，于是作出抉择，要有五阴活动，人就醒过来了。晚上到时间就定时睡觉，也是意根养成的习惯，是意根的惯性作用。</p><p>如果心里有事而睡不着觉，这是因为意根在严重地攀缘着某种尘境，惦念某些事情，意识就要翻来覆去地思虑意根所攀缘的事情，思虑过多时，意识无法灭去，就不能睡觉。这时候就得用药物强制性地灭去意识，才能睡着，学佛人就用念佛念咒的方法，依靠佛菩萨的力量加持，心得到安稳，去掉杂思乱想，才能睡着。为什么药物能让人睡着呢？因为药物能够麻痹阻塞大脑的传导神经，使得某些六尘没法正常在胜义根处现起，于是六识灭去，就睡着了。</p><p>九、人在睡梦中，有识心的存在，就有识的功能作用，有识阴、受阴、想阴和行阴。无梦时，六个识灭，但是六根还在，意根攀缘着六尘境界，如来藏通过六根还在依据外六尘变现着内六尘，只是没有六识来了别。身根等五根还在作用着，那么这时就有身行，有呼吸、心跳、脉搏、血液流动、细胞新陈代谢等等活动，不同于死人。因为意根还在攀缘着色身，那就有寿暖识的活动。</p><p>如果意根决定离开色身，比如一个人心灰意冷，不想活了，如来藏了别到以后，就会随顺意根的决定，离开色身，人就死亡。如果一个人病得很重，身体几乎不能用了，但是他的意根非常执著色身，不肯离开，如来藏就随顺意根，也不离开色身，继续陪伴意根维持生命活动，色身仍然会有微弱的功能作用，病人就要痛苦地勉强活着。所以意根的执著性和决定力是非常强大的，虽然如此，也不离业缘，强不过业力。</p><p>十、如果睡眠中有意识心的存在，就是没有睡着或者睡得很浅，或者是在梦中。这样的话，意识休息就不充分，第二天肯定会疲乏。真正的睡眠，意识心是断灭的，而意根不灭，如来藏也在。意根还在攀缘着六尘，如来藏就要不断的变现六尘，只是没有六识来了别，就不知道任何事。其实这时六尘都存在着，胜义根里有六尘。如果有特殊的事情出现，意根想知道是什么事，又没办法详细了知又想处理，如来藏知道后就变意识心出来了别和处理。</p><p>睡着无梦时有法尘，意根与法尘相触想了别，意识出生触法尘，分别法尘。而且前五尘也存在，这些六尘是意根作意攀缘，如来藏显现出来的，随后眼识或者耳识身识等就会被如来藏产生出来，了别出现了什么情况。有时是尿急，有时是有强烈的光，有时是有大的响动，有时是有人在推醒他，有时是疼痛等等情况。那就是说，睡着无梦时，意根还是在攀缘不静止，祂不睡觉，如来藏也不睡觉，祂们两个都在坚守岗位，各尽其职。如果意根想离开色身，如来藏也就随着离开，人马上就死亡。意根不离身，如来藏就持身，维持色身的一切生命活动，如来藏在，色身就有寿暖识，就是个生命体。</p><p>十一、睡着时，因为觉得被子重，就自动翻身，尽管自己当时不知道，这时也有身识和意识的作用。翻身也是识的功能作用，身根本身是被动的接收器和传输器，如果没有识的作用，根就是木头石头。意根想翻身，六识出来就让身体动转，这时有微弱的身识和意识。意根为什么作主翻身呢？因为被子重，意根与此法尘相触，知道对身体有影响，身体受压不舒服，就让身识和意识出来了别一下情况，再进行处理，于是身识和意识一起翻身。</p><p>如果翻身的次数多一点，睡眠就不好，第二天就要感觉疲惫，因为身体没有休息好。如果睡着翻身不是六识的作用，那么在昏迷时，意根想挪动身体，就应该能挪动得了，可是昏迷时，身体是不能动的，尽管意根总想让身体活动起来，让自己清醒过来，但是做不到，必须是六识帮忙才行。</p><p>在半夜翻身时，由于身体疲乏，意识心弱，不一定能反观到自己的运行，意识心强弱的程度不同，反观力也不同，所以有人知道自己半夜是什么状态，做了什么，有的人却不知道，不知道的时候，睡眠就深沉，睡眠质量好，但是也有意识快速而微弱的了别，意识微弱时，几乎感觉不到意识自己的存在和运行，意根的作用突出。意根直接了别的内容，很多时候，意识心不一定知道，意根又没有名言，无法表达出来。</p><p>十二、梦境与修行</p><p>梦境随意根的攀缘而有，由意根控制。身体疲乏时，早上就做梦，在梦中意根想起床，可是身体疲乏起不来，意根也知道，但还是想醒过来。半醒之时，脑子不清醒迷迷糊糊的，于是意根就决定让意识怕打自己的后脑勺，让自己清醒过来。可是拍打时，手碰不到后脑勺，说明梦里没有身识。</p><p>意根能明了身体情况，能明了时间，祂有自己的思心所，有自己的思量性，有自己的造作。学佛深入到意根以后，祂也与精进心所相应，不再贪睡，梦里也与白天所学法相应。如果意根贪嗔痴烦恼很重，做梦时也同样让意识造作贪嗔痴烦恼。有时意识能反观到，有时意识反观不到，能反观到时，意识是觉悟的，还算有修行，能控制一下自己的贪嗔痴行为，其心行也是不错的。如果根本不造作贪嗔痴烦恼业，那就更好了。如果梦里控制不了自己，修行还不得力，还需要努力。</p><p>十三 、做恶梦时为什么容易醒过来，而普通的梦不容易醒过来？</p><p>做恶梦时，意识在梦里非常害怕，总想躲避离开梦里的境界，意根知道后，就会决定躲开梦里的境界，于是了别梦境的独头意识就转变为五俱意识，五俱意识出现，五识之一也随着出现，五阴就醒过来了。刚醒过来时，意识心里还是怕怕的，思惟一会儿，知道是做梦，就缓过神来不怕了，也可能回想梦中，心还会有余悸。</p><p>为什么心有余悸，心里怕怕的？因为意根经历了梦境，依靠着意识的了别，知道梦境可怕；醒过来后，意根还是知道梦境可怕，因为祂执我心重，五俱意识依靠意根，就感觉心有余悸。但是五俱意识并没有经历梦境，经历梦境的是独头意识，二者虽然是同一个意识，了别的境界却不尽相同，有些差别。五俱意识还是能多多少少的回想出梦中的境界，毕竟是同一个意识，前世的事就回忆不出来了。</p><p>普通的梦，意识在梦里感觉一般，不欢喜也不惧怕，不想躲避，意根就不决定从梦中醒过来，那就仍然随意根的攀缘继续梦下去，不会从梦中惊醒过来或欢喜激动而醒。因为意根不太执梦境，醒过来后，意识也不容易回忆出来，往往是淡忘的多。</p><p>十四、问：夜半睡着无梦，突然火灾出现，就醒过来了，醒过来后意识心肯定存在，醒过来前一秒有没有意识心参与？</p><p>答：醒过来是由意根了别到火灾这种重大而特殊的事情后的决定，意根也有一定的了别能力，也能了别粗略的法尘境界，也能自己独立作抉择。即使意识存在时，意根也能独立作抉择，不听从意识的安排和建议。多数时候，意根都是独立作抉择，并不听意识的分析劝导，有些众生的意识也不懂得分析劝导。</p><p>当火灾出现时，意根决定醒过来，意根触着火的情况，知道不好，知道这件事非常重大，很危险，但是自己不能躲避和解决火灾，就决定快速醒过来，于是意识眼识出现时，五阴身就会出现快速的应急反应，这是意根控制的，意识来不及细分析。当然火灾这个法尘是由外五尘而来，意根知道严重，就想让意识快速了别，于是意识出生；意识单独了别不了，五识之一眼识随之就出现，与意识共同了别；独头意识就改为五俱意识，于是五阴醒过来；意根决定起床，五阴身就起床，或者躲避或者想办法灭除火灾。在睡梦里的意识是独头意识，醒过来的是五俱意识，五识之一必须出来一个，众生才能醒过来。</p><p>意根不能了别太具体的六尘境界，否则意识就没有用了，意根自己玩就行，在昏迷和死亡时祂也不怕，因为祂可以不用依靠意识，自己能代替意识的活动，事实上不是这样。</p><p>十五、睡着无夢時怎么会有冷了拉被子、挠痒这些事</p><p>睡着无梦时，虽然没有六识，但是如来藏还是会照样通过六根变现六尘在胜义根里，意根知道必须让色身休息，以恢复疲劳，就不想了别这些六尘境界，不会现起思心所想了别，如来藏也就不会出生六识来做具体了别。但是意根还会照样触各种法尘，因为其了别慧劣，祂不太了解法尘的具体内容是什么。当法尘出现重大变化时，意根就想了别到底是什么状况，如来藏知道意根的思心所，就会随顺着出生意识心出来了别，五识当中的某一识也得出来与意识同时分别，这样才能半睡半醒地处理一些事情。</p><p>当房间内冷的触尘变得越来越冷时，意根触到，觉得必须处理一下，于是如来藏就变出身识和意识了别冷的触尘，二识把了别的具体内容传递给意根，意根就决定盖上被子。如来藏就随顺意根变出身识和意识把被盖上了。身体痒也如是道理，都是意根了别身根的特殊情况要处理解决，自己不能解决，只能依靠六识，如来藏随顺变出身识和意识，来处理身体痒的问题。处理完之后，意根知道身体没有休息好，就不想再作什么，意识和身识就灭去，继续睡觉。</p><p>十六、什么叫作睡觉？是谁在睡觉？如果说六识能睡觉，六识却灭了；如果说意根能睡觉，意根却与白天一样在活动；如果说如来藏睡觉，如来藏却从来不发生变化，任何时候都要不断的变现六尘和输出意根识种子；如果说身体睡觉，身体犹如木头，木头怎么能睡觉？</p><p>睡觉这种现象是如来藏随顺意根的需要，与意根共同合作出生的法，是虚妄不实的，实际上没有睡觉的人存在。意根知道身体疲乏，需要休息了，就决定不了别六尘，不让六识造作出身口意行，让色身休息，以补充色身所需要的能量，少消耗一些能量。于是五识灭去，意识也渐渐灭，身体代谢减缓，活动减弱，色身得到休息和滋养，第二天色身才能继续工作。</p><p>我们再思惟六识需要休息吗？精神疲劳是六识疲劳吗？六识不需要休息，因为六识不消耗能量，不是由四大物质生成的，也不需要四大物质的补充。六识的识种子，如来藏刹那刹那源源不断的输送出来，不会断绝，只要意根需要的话，如来藏永远都会输出识种子，以维持六识的存在，前提是业种允许，色身条件允许，业缘允许。精神疲劳不是六识本身的疲劳，而是色身出现了一些状况，四大不调和，如来藏变现在胜义根的六尘境界有障碍，影响六识的正常运行。</p><p>意根了别到这个状况，就决定休息或者睡眠，这样就能少消耗或者不消耗四大物质，休息好以后，四大物质调整好了，也比较充足了，六识出生，就能正常运行，这才显得精神饱满、神采奕奕。因为身体四大不调和，所须营养不具足，五尘的传导就受到阻碍，六尘变现出来就不顺畅，六识的运行就不正常。从外表上看，好像是精神疲劳，实际上是色身的物质需求跟不上了。当这种情况出现时，意根就决定不让色身再运行，决定休息或者是睡眠或者是补充物质能量需求。</p><p>十七、意根在梦里梦外的功用</p><p>在梦里意根的作用非常突出，各种功能作用也比较明显。白天意识活动很活跃，往往就能掩盖意根的各种心理作用，观察力不强的人，很难观察到意根的深层次活动，只能观察到意识的表面活动，很多时候把二者的活动混在一起分不清楚。睡着以后，无梦时就无意识，一切的心理活动都是意根的活动，但是却不容易被意识所知。一般人的意识，思惟和观察不了意根的活动情况，这里暂时先不说如来藏的巨大功用。</p><p>有梦时意识虽然有思惟了别活动，但其作用力非常弱，意根的习性、心行、遍计所执性、思量性等等功能作用就能突出显现出来，意根固有的习性和执著性以及烦恼性，也都跃然于梦境中。这时意识思惟力弱，不能控制意根，意根的心行就没有遮掩。尤其是意根烦恼执著性重的，梦里都完完全全表现了出来，意根在白天的心思也能在梦里表现出来。</p><p>意根与如来藏一样，从来不休息，一直都在工作着。可是祂究竟是做什么工作的，一般学佛人都不知道，也观察不出来，于是就认为意根比较清闲，做不了什么事，好坏事都是意识做的，都不知道主动去挖掘意根的心理活动，不希求珍贵的佛法，只会背一些名词概念。</p><p>十八、有人做梦，梦见自己的车被压坏了，并且完全消失不见了，于是在梦里感觉心疼死了，醒过来之后，心还在疼。这是哪个心疼？是哪个心的觉受，这样执著和坚固？梦里心疼疼醒了，害怕怕醒了，高兴乐醒了，为什么能这样？都是哪个识的受？梦里的意识，与梦外的意识是一个吗？</p><p>能让心疼的就是意根，意根是连续识，前世今生梦里梦外都一样，都存在。梦里心疼梦外同样心疼，一定是意根心疼，因为意根能引发触动身心的变化；意识心疼时，很轻微，如微风轻抚海面，没有涟漪，不引起身心反应。在梦里意根通过独头意识的了别，把梦境当作了现实，当作是真实存在的境界，不知道在做梦，因此对梦境非常的执著，以至于触动身心，引起心疼的现象，以至于疼醒了。醒过来以后，意根深有感触，好像还沉浸在梦中，不知道从虚幻的梦境里醒过来了，以至于心还是疼。</p><p>虽然梦中的独头意识已经转换了，可是意根还执著梦境，独头意识就要回忆梦中的境界，也有感触。其中意根的觉受比较深细，根深蒂固，很难改变，意识的觉受比较浅和浮，容易改变，遇境就能受到境界的影响。</p><p>从这里可以看出，意根的受不是舍受，否则就不会引起身心那么大的波动了，不会疼醒、乐醒、哭醒了，不可能醒过来之后，还接着哭、接着乐、接着疼。断我见，断觉受，断觉知，断除意根的我见、觉受、觉知，才是最难的，断意识的所有知见觉受觉知都比较容易。</p><p>十九、意根在睡着时，如来藏仍然触外六尘，通过五根传导在胜义根里变现出内六尘。意根依如来藏能见能触如来藏变现出的一切法，那么一切法不管大小、重要和不重要，意根都能见能了别到，不单单能觉知重大的法尘，非常细微的法尘也能觉知到，比如心脏的跳动声、呼吸声、身体哪里疏通、哪里堵塞、哪里痛、哪里痒等等，意根都能了别了知，如果很在意觉得重要，才让意识出来处理，否则就照样安安静静的睡觉。</p><p>但意根对一切法只能了别个大概，不细致、不清楚，这样大概粗略的了别，就可以让意根判断出是否重要，是否需要六识出来微细了别，并且做处理。意根在睡觉时，了别到法尘与平常没有什么差别，就判断为不重要，知道身体需要休息，不想让六识出来了别，对六识就没有驱动性，让身体继续休眠。当法尘比较特殊、比较重大时，意根就会决定应该具体处理一下，于是如来藏了别意根的思心所，配合出生意识，意识就出现，了别意根想了别的法尘，五识之一也要出来一起了别，才能了别清楚；当五识都出现时，人就彻底醒过来。</p><p>如来藏能了别身根，也能了别前五根，意根借助于如来藏，也就能了别五根情况，对五根就有驱动性，能指挥五根的运转。意根也能决定五根的生命力，如果意根决定放弃五根，离开五根以后，五根当下就与木头无别。</p><p>二十、做噩梦时尽力挣扎要逃离梦境的是意根还是意识</p><p>意根对色身的控制，是在一定条件下，才能做到的，如果条件不允许，意根就没办法操控自己的色身。这时意根受业力的支配，五阴身也受业力的操控。如果意根能完全控制身根，那就没有死亡，没有病苦，没有衰老，没有违缘，没有贫穷，没有灾难。即使是佛，虽然佛没有恶业力，可是佛的意根想要度化众生，度尽众生，如果条件不具足，佛也没办法，也得等因缘具足。</p><p>梦境是意根所攀缘、惦记、惦念、执著出来的，与业力相应，与意根的心行有关，与意根的思心所有关。在梦境里，意识思惟分析判断梦境的真实与否，是好是坏，然后意根作抉择，决定要从梦境里挣脱出来。没有意识的思惟判断，就没有意根想挣脱梦境的决定，因为意根不一定知道梦境对自己的影响，不一定知道梦境的好恶。挣扎的一定是意根，也许也有意识的行为，因为意根是作主识，有抉择力，祂把五阴身都当作是自己，对五阴身有执著性和控制权。</p><p>意根的作用力远远大于意识的作用力。意根如果想要得解脱，是意识修行熏染的结果。当意根决定与业力斗争时，修行就要往上突破一层，道力就要提升了。</p><p>二十一、醒过来是由意根作主决定的</p><p>甲：意识心在梦境里知道是做梦，想醒过来，如何才能醒呢？意根了别不出是在做梦，如果意根知道这是在做梦，梦就结束了，意识不会再接着了别和造作，有人追杀也不会躲了。意识在梦中做梦遨游，但是五识没起动，就是一种浅睡眠，五识起动，就彻底醒了。</p><p>乙：梦境里的恐怖情景和令人欢喜的场面，意根都不能了别，但是知道梦里的境界太特别，就让意识了别，于是梦里的独头意识就转换为五俱意识，就醒过来了，然后意识再回忆梦境。</p><p>甲：好像这样能说通了，醒的标志，一定要五俱意识的出现，独头意识不行，那么梦里的独头意识是如何变为五俱意识的呢？</p><p>乙：这就需要意根的指挥了，想不想醒，是意根的事。独头意识在一般的梦境里，不容易转变成五俱意识直接醒过来，得在梦境消失，或者有其他梦外重大事情出现，意根才能让五俱意识出现，从而醒过来，或者是到了固定的起床时间，意根才能让五俱意识出现，从而醒过来。或者梦里的境界太恐怖，意根害怕，就让意识出来躲避，但是意识又不能单独造作，五识之一就得一起出现，这时必醒。噩梦惊醒的事例非常多，由于欢喜过度醒过来也如此。比如鬼压身，意识明明知道，就是醒不过来，因为醒过来是由意根作主决定的。</p><p>二十二、睡着时，五根与五尘还在接触，但是意根不作意不决定了别五尘境，五识就不出生，这时五识是不存在的，是断灭的，不管有梦无梦，都没有五识，否则就是清醒的，不是睡着了。意根在睡着时，仍然要触法尘，了别法尘以及五尘。因为意根知道应该让身体休息，不应该让六识了别六尘，意根就不对六尘生起思心所，不会想要具体了别六尘。如果意根对某一法攀缘重，思量重，总在惦念着，如来藏必然随顺，出生独头意识，了别意根所思量和惦念的事情，这就是做梦境界了。</p><p>二十三、小孩子半夜做梦尿急，结果就尿床了，这时不仅有六七八识，因为尿床时身行意行出现，微弱的身识和意识出生，那就有四个识运行。做梦时，意识感觉有尿，意根就让意识找地方处理，因为小孩子随处尿尿习惯了，也就不分时间和处所，结果就尿床了。如来藏了别意根的思心所，先唤醒五俱意识出生，独头意识换成五俱意识，身识再出生，就会有尿床、挠痒、翻身等等身行出现。半夜里有这些事情出现，睡眠就不很充足。如果梦境比较多，时间比较长，一夜的睡眠质量就不好。</p><p>二十四、梦境是如何出现的</p><p>梦境是由意根对所经历过的事和没有经历过的事的攀缘执著而来，如来藏随顺其攀缘性就变现出梦境。意根的攀缘和执著性，属于意根的遍计所执性，意根所有的心行，如来藏都能了知，了知了以后就随顺着意根的心念和业力，现起梦境，让众生在梦中继续攀缘和执著。如果意根不攀缘和执著，如来藏就不会主动现起梦境。</p><p>所以有些人修行得力以后，梦境逐渐由浑浊变得清净，由多梦变成少梦，这是因为修行已经降伏了意根，意根受熏以后，无明减轻执著性减少。阿罗汉们的意根由于断尽了我执烦恼，断除了对世间法的贪着性，他们极少有梦境的出现。</p><p>梦境之中，有第六识、第七识、如来藏三个识的现行运作，没有前五识，所以梦中的影像很朦胧，与清醒时不一样，清醒时五尘境界都很清晰明了，而梦境里五尘境界不清晰明了。虽然醒后，觉得眼睛看见了色尘，但不能看见人物的色彩，虽然能感觉到色彩，感觉到空旷，感觉到明暗，那只是意识的感觉，不是眼识真正的看见了这些景象，梦中与清醒时所见的境界区别很大。</p><p>比如看见前世的人，看见其它世界的人，都不可能是眼识所见，眼识绝对不能看见前世和其它世界的人，否则众生都有天眼通了。没有神通天眼通，眼识不可能看见过去世的人和物，不可能看见未来世的人和物，不可能看见其它世界的人和物。如果眼识能看见，眼根就能与那些色尘相对，事实上，眼根不可能与那些色尘相对，不可能缘到那些色尘。否则眼根就能到前世和其它世界去，身根也就能到其它世界去了，事实上身体仍然睡在床上，哪里也没有去。</p><p>梦境是独头境界，是如来藏直接输送种子所现起的法尘境界，只有意根和第六识能缘到，而真正能清楚了别的只有第六识。意根输送出来业种，变现出梦里的法尘境界，是因为意根有攀缘执取性，意根攀缘，如来藏就随顺变现出梦境。日有所思夜有所梦，就说明此理，正是因为意根思心所的所思所想，意根才变现出梦境来。</p><p>二十五、睡眠是谁决定的</p><p>睡眠也是由意根决定的，祂知道身体需要休息时，就决定睡觉，不想再了别六尘，这时候就会断掉五识和意识的了别，于是就进入睡眠状态。当然在睡眠里没有六识，只有意根和如来藏，那么睡觉是谁睡觉？如果意根贪六尘境界，总想了别，不肯停止，那就不决定睡觉，六识就要不断的了别造作。意识觉得不睡觉身体就不舒服，可是意根兴趣太浓，六识就得精神抖擞的贪着六尘境界而不灭掉，所以睡觉是由意根决定的。在睡眠当中，意根了别到色身已经恢复精力，不再疲劳，就决定了别六尘，于是就睡醒了，所以醒过来也是意根决定的。</p><p>意根遍缘一切法，没有什么法是不能缘着的。意根如果不缘某个法，意识就不能了别某个法，因为意法为缘才生意识。</p><p>二十六、睡着时意根是否知道自己在睡觉</p><p>睡觉时意根很清楚自己就在睡觉，因为睡觉是意根决定和促成的，祂要照顾色身不要过于劳累疲乏，需要睡眠时，意根就决定不再了别六尘，于是如来藏随顺就不再出生六识，六识灭去，就睡着了。而且在睡觉过程中，意根就不过于关注六尘境界，减少兴趣，尽量不造作，以保证色身休息好。除非有特殊的事情出现，意根处理不了，就让自己的六识工具来处理，这时就会醒过来；或者是当色身休息好了，意根了别到，就让六识出现，自然醒过来；或者是到预定时间，不管是否休息好，意根都会主导从睡眠中清醒过来。</p><p>从以上的情况来看，睡眠时意根一定知道自己睡眠，所以祂的表现与清醒时不同。如果意根不知道自己在睡觉，那祂在睡觉时的表现应该与清醒时一样，意根如果不是因为受到某种限制，祂是不甘心自己没有见闻觉知不能清晰了别六尘的，也不甘心自己没有五蕴活动。如果意根因为某种重要的事情需要六识一起处理，就不想睡觉，六识就不能消失，也不可能有睡眠了。</p><p>睡眠与醒过来都是由意根作主的，那么自己睡着了，处于睡眠状态，意根肯定是知道的。当意根精进修行的时候，就会决定日夜精进用功修行，不贪睡觉，尤其是修般舟三昧九十天不睡觉时，完全是意根的精进，意根作主决定的。有的人睡得非常沉，即使山崩也不醒，就是因为意根觉得身体太疲乏，不想醒过来，或者是意根想醒过来而身体状况不允许。如果意根了别身根比较疲乏，或者对目前六尘境界极乏味，都会减少攀缘，然后就睡过去了。</p><p>二十七、意根到底能反观自己，还是反观不了自己，他的意识如果没有智慧，就观察不出来，也判断不出来意根干了什么正在干什么，意识没有智慧的时候都不知道。所以很多人那么相信自己的判断力，简直没有道理。</p><p>就像无始劫来我们如来藏对五阴世界做了很多很多的事情，可是我们意识无知，根本不知道，又因为无知就否定如来藏的存在和祂所做的功德。你意识不知道并不等于祂不存在，同理，由于无明观察不到意根的运作，不代表意根没有那些功能作用，不能如此如彼的运作。</p><p>睡着的时候，意识可以不知道自己睡着了，因为睡着了没有意识，但是意根知不知道睡着了？意根绝对知道自己睡着了，所以意根不想让这五阴身有活动。如果意根不知道自己睡着了，祂就会什么都想造作，然而意根知道自己睡着了，也知道天黑，所以祂对于六尘境界都不想知道的太多太细，六识老老实实的一个都不现起来，身体也老老实实的不动。意根知道是自己在睡觉，所以意根是有反观力有证自证分的，只是意识无法观察意根，他就说意根不知道自己睡着了，没有反观力。眠熟了的情况，意识不知道不等于意根不知道，这说明还是把这两个识给弄混了，把意识的知与不知，当作了意根的知与不知。</p><p>同理，昏迷的时候，意根肯定知道自己昏迷了，所以在清醒的缘出现时，努力挣扎着要醒过来，要起来活动。入定时，意根也知道入定，死亡时也知道死亡，在植物人状态，意根也同样知道，所以在这些特殊状态里，祂的心行和表现都与正常时不同。所以有个结论：只有无知的人，才说意根什么也不知，什么也不做，什么也不行。如果意根什么也不是，那么你自己又是个什么？同样什么也不是！因为，你，就是意根！</p></div>"
},{
    "title": "第十三章　意根与色身",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章　意根与色身</strong></p><p>一、识心为什么不在色身的内外和中间</p><p>六识虽然是分别胜义根里的内六尘，与内六尘相触，不离六根和六尘，但是六识心不在色身的内外和中间。楞严经第一卷中世尊讲过识心不在色身的内外中间，这是因为识心无形无相，不能住在色身里，如果住在色身里，那么解剖色身，就能发现识心从身体里出来，可是把身体一片片切开，也找不到识心的踪影，因此识心不在色身里。如果识心在色身外，色身外就是虚空，那么虚空中的识心就与自己无关，不完全属于自己的，别人也可以用，识心能作用于自己，也就能作用于其他众生。如果识心在色身和虚空的中间，可是又没有真正叫作中间之处所，找不到所谓的中间位置，因此识心不在色身的内外和中间。</p><p>意根和如来藏也都是如此，第七识虽然常常与胜义根里的法尘相触，不离法尘，不离胜义根，不离大脑，可是第七识也不在大脑的里外和中间，也不在色身的里外和中间，其道理与六识不在色身的内外和中间相同，如来藏也是如此，虽然如来藏遍于色身五蕴，可是如来藏不在色身的内外和中间，无形无相故。</p><p>二、只听说梅子就流酸水是什么原因</p><p>楞严经里这段吃梅子的文字内容，比喻想阴境界的虚妄性。想阴就是六识的了知取相功能，但是六识之所以要了知和取相，是因为意根想要了知和执取，促使六识来相应的造作。众生的身心都是互相影响的，心识的某些活动会直接引起色身的变化，尤其是意根对色身有操控的作用，能促使识心出现各种变化。耳听梅子的名相，口里流酸水，就说明意根明了耳识和意识所听见的酸梅的名字，意根就当作真有酸梅一样，根据经验知道酸梅很酸，就促使口腔流口水。这也说明了万法是由三能变识和合运作产生出来的，也就是万法唯识的道理。</p><p>心里了知了酸梅的酸相以后，就执取了酸梅的酸相，于是酸相就出生了，意根就促使舌根产生了口水。由一个虚妄法为起因，辗转出生了另一个或者是更多的虚妄法，佛用此譬喻，说明想阴的虚幻不实，想阴出生的缘也虚幻不实，想阴之后的果更是虚幻不实；一切的心理和生理的反应都是虚妄不实，因此我们就不要执取不实的身心觉受。</p><p>众生的身心是紧密相关，紧密相连，互相影响的，身体对识心有影响，识心对身体也能产生影响，身心互相依赖，互相作用。识心改变，身体也会发生改变。如来藏和意根和合能改变一切法，只要意根有力度就行，这个力度是指很强的定力，就是专注性，而且能让相应的缘具足，为如来藏产生万法创造条件。</p><p>听说梅子，口里就流酸水，首先是意识心知道梅子是酸的，或者吃过酸的，有过体验和经验，意根才让口腔里有酸的反应。这些经验已经作为种子留存到如来藏里了，别人说梅子的时候，耳根和意根同时对应那个语言，耳识意识就同时分别了知其义，意根通过如来藏再把过去的有关梅子的信息输送出来，通过如来藏对身体就产生了影响，酸水就流出来了。</p><p>三、物质色法能影响色身和识心</p><p>比如吃兴奋剂能叫运动员超常发挥，吃镇静剂或者安眠药，人的兴奋度就会降低或者睡着，这些物质色法对于识心有很大影响，甚至能让识心灭去。物质进入身体里，被身体吸收，就改变了身体的四大组织结构，四大改变，身体就发生改变，意根触变化后的不正常的色身，其反应就不正常，精神状态不正常，意识想控制，却控制不了，叫作超常，超过正常状态。一个人的精神状态是从身识和意识反应出来的，身识与意识的反应，是由意根操控的。进入身体里的物质不同，四大就不同，对身体造成的影响就不同，同时也影响意根的反应，意根再影响身口意行。</p><p>触尘不同，意根产生出来的身识和意识就要分别不同的触尘，识心的反应就不同。这些触尘是由身根和意根所缘，意根遍缘一切法，身识意识出生以后同时了别触尘，就有了识心的反应，也就是所说的精神状态。所以物质不同，内含的四大种子比例就不同，不同比例的四大种子对身体的影响也不同，所以身体吸收了不同的物质，状态就不同，身体产生变化，识心所分别的触尘就变化，识心的反应就有变化。</p><p>有些物质能够促使大脑兴奋，精神活跃，识心分别力强，比如兴奋剂；有些物质能够抑制大脑兴奋，使识心分别力弱，或者失去分别力，比如安眠药、镇静剂等等。另外饮食过多，也能抑制大脑兴奋，胜义根里的触尘发生变化，识心了别劣弱。这都与身体当中的四大物质有关，与胜义根处的四大物质有关。身体里四大组成的触尘是身识和意识的饮食，四大调和，首先意根的精神状态就正常，其次意识的精神状态也正常。四大不调，意根的精神状态就不好，意识的精神状态也随之不好。镇静剂和兴奋剂是两种物质，组成物质的四大种子比例结构不同，被身体吸收了，就会产生不同的触尘，那么识心的反应不一样了，精神状态就不同。</p><p>比如吃五辛，身体吸收了以后，身体里的物质四大结构改变了，胜义根里产生的触尘就改变，意根的反应出现变化，身识意识的反应就改变，于是就会生起淫欲和嗔恚的烦恼。还有烟、酒和毒品等等物质，对色身的影响，对意根和意识的影响也是同理。身心是紧密相连的，所以打坐能够调和四大，使身心状态都安和。物质色法能够影响识心的精神活动，但不是起绝对的作用，起绝对和直接作用的，还是意根里的业种，有的人就不会受到毒药和其它药物的影响，不会受到物质四大的影响，而且还能够改变四大。</p><p>四、望梅止渴和听酶吐酸水的原理是什么？没有喝水没有吃东西，就解决了口渴的问题，是谁解决的？口渴时没有唾液，有唾液时，口就不渴了。唾液如何出现的？大脑发布命令，传达到身体各处，或者是某处，就会出现某种反应。大脑命令是谁发布的？是意根发布的，如来藏执行命令，供给所需，满足意根，达到意根的目的。所以意根如果没有欲，能出现境界吗？什么境界也不会出现，什么变化也不会出现。</p><p>意根为什么听见酶，就能吐酸水？这里的听见，当然是耳识意识的细微了别出来的，之后传达信息给意根，意根就知道了酶的事情。知道酶是酸的，酶的性质是什么，这是意识知道还是意根知道，还是二者都知道？二者都知道，根据过往经验，知道了酶的性质作用，就浮想联翩，好像酶真在口中一样。意识的浮想联翩，带错了意根，意根被骗，就让色身出现应有的反应，口中酸水就出现了，于是口渴问题就暂时解决了。从这里看出，意识非量了别，意根不知就会被骗，以至于出现异常现象。可见无始劫来，意识没少骗意根，然后意根就让意识不得好过。</p><p>独头意识想象自己脚站在悬崖边上，意根就真的以为自己站在悬崖边上，于是就会出生恐惧的反应，不让脚滑下去，脚心肯定就发涩了，浑身颤抖，由于害怕掉下去，意根紧紧控制身根，绷紧身根。这是谁造成的？是意根造成的，也是如来藏发动身根身识配合的结果。由于意识的不如理作意，导致意根的不如理作意，之后发布错误的应急措施和命令，出现不正常的身根反应。</p><p>无始劫来意识对意根的邪教导，导致意根一直走在邪路上，不能归于正道。意识的邪教导，是由于意根的愚痴无明熏染的结果，如果意根没有无明，意识一定都是明，不会有邪知邪见和邪教导，意根也永远不会有邪见。</p><p>你骗我，我就骗你，这就是因果。你邪我就邪，然后又让你邪，这就是因果。所以三界六道轮回的因，生死的因，就是意根的无明。而意根的无明，无始劫以前就存在，存在如来藏里，使得如来藏能出生生死，才有轮回苦。</p><p>五、七识为什么不能同时通过两个或多个身体执为假我运作</p><p>七识不能到其他人身体上去运作，不能让其他人的身体为己所用，所以就不能把其他人的身体当作是自己所拥有的。意根即使能控制其他人的身体五蕴，也是暂时的，不能长久，祂知道别人的身体不是自己的。这里还涉及到了如来藏的运作，因为不是自己如来藏运作的身体，祂就不能当作是自己的。如果有分身，七识就会把分身当作自己，那也有主次之别。</p><p>意根也不能到其他众生的身体上运作，也管不了其他众生的身体，因为那不是自己的如来藏出生的，意根能很清楚那个身体不是自己不属于自己，鬼神故意附体的除外。意根是随着如来藏的所见所变，来随缘执著，自己的如来藏变现不出来的，意根就不能当作是自己的。第七识只能执著自己如来藏变现出来、正在维持着的法相，当作为自己或者是自己的，其他的就不认为是自己的。</p><p>意识心没有禅定，没有修出意生身，意根就不能同时变现出两个以上的身体。意识心或者是七识如果有烦恼、有漏、有遮障，如来藏再能，也不能给意根变现出多个身体。从这里，我们就知道了，如来藏的功能作用，是受七识的无明所遮障的，七识改变，意根才能大放光明。如来藏是无缘大慈，同体大悲，从来都是维护、顺从和照顾自己所属的七识，把七识的有漏种子都存入心体，结果自己的功能受阻，可是如来藏也不在意，无怨无悔的样子。</p><p>七识每天都带着染污心，来拖累和遮障如来藏，却从来也不觉得惭愧。无惭无愧不是善心所，是烦恼染污心所。我们每个人都应该检查一下自己意识的心所法，有没有惭愧心，有没有愧疚心，再检查自己的意根有没有善心所法，有没有惭愧心所法，就知道自己是善还是恶了，这样就不用每天都认为自己如何如何的善，如何如何的好，就能正确认识自己，从而改变自己。</p><p>六、惊吓为什么能死人？死，是六识先灭，意根离身。受惊吓时，意根因为什么选择了离身呢？这个惊吓，一定惊吓到意根了，是从心里往外的感到害怕，以至于伤到了身体，身体器官出现严重的病变，尤其是心脏，导致血液无法正常流动，身体不能再用了，胜义根严重受阻，意识身识不能运行，意根不能再守色身，于是迅速离身。</p><p>意根为什么不能守身呢？意根受到惊吓时，先震动大脑皮层、中枢神经组织，然后中枢神经组织再把受震动的信息传导到身体的各处，传导到内脏神经组织，使得身体内脏出现大的变动，大的反应，以至于血液流动不正常，神经传导也不正常，身体功能受到阻碍，内脏不能正常运行，大脑中枢神经组织也不能正常运行，六识就不能正常运行，以至于六识消失，身体和六识都不能运行，意根觉得身体不能用了，祂这时因为受刺激，判断也许不准确，于是决定离身。</p><p>轻微的惊吓，就不当回事，过后还能哈哈大笑，甚至嘲笑自己胆小。如果严重惊吓，吓得浑身颤抖、浑身哆嗦，吓破胆时，惊吓涉及到胆，胆就不能用了，人就能死，或者生大病。情志上的应激反应，能伤及五脏六腑，有成语：伤心欲绝、悲痛欲绝、郁闷而死、气急身亡，都是意根作出的应激反应的结果。心境、精神、意志能影响色身的健康；反过来，色身的健康也影响情绪和心境，身心能互相影响。</p><p>是什么能破坏五脏六腑？是什么能让身体灭去？是什么能撕心裂肺？能杀人的到底是什么东西？打得鼻青脸肿，是谁打的？一切法都是八识心王的和合运作出来的，如果将各自的功能全部理清了，至少有般若的别相智。在每一个法上，都至少有四个识的运作，有真心，也有妄心，不能只强调有一个心，一个心无法运行。</p><p>七、鬼神是如何控制他人色身的</p><p>鬼神是通过控制意根来控制他人的大脑神经来控制他人色身的。被鬼神控制的时候，有时心里是清醒的，但不能作主，身体不听自己指挥，口业语言也不听自己指挥；有时心里不清醒，糊里糊涂的，自己做了什么事也不知道，口中胡言乱语，多数时候，自己并不知道；有的时候想说的话却说不出来，说出来的却是自己不想说的话。</p><p>鬼神要控制他人色身，其意根必须强于人的意根，或者两者缘分比较好，有亲和力，这样鬼神就能进入人的身体中，指挥和控制人的身口意行。每个人都想作自己的主，不愿意被人摆布，所以一般人的意根不同意鬼神上身，不愿意被控制，就要强烈的反抗，意根不同意，就出现反抗行为。如果鬼神不肯善罢甘休，就要使用神通，使这个人出现各种磨难，直到这个人的意根妥协，愿意暂时退出主人位置，交出管理权限为止，之后身体由鬼神使用。如果两者有缘，比较亲近，意根同意暂时让位，那么鬼神就能轻易的占用他人的色身，并且不使他人色身痛苦。</p><p>但是鬼神是如何代替他人的意根控制他人呢？我们要了解，自己的意根是通过什么方式和渠道控制自己的身心世界的。找到身口意行的开关，就知道意根是如何调控身口意行的，就能知道鬼神如何能控制他人身口意行。意根调控色身的开关在胜义根那里，胜义根里的神经系统通往全身各处，鬼神只要占据了胜义根，进而控制身体主要穴位，就能控制这个人的全身。有时连意识也被控制，有时候控制不了意识，或者不控制意识，意识清清楚楚知道鬼神的作为，可是没办法，作不了主。调控身体平衡的开关在小脑那里，小脑有问题，身体就不平衡了，鬼神也要控制小脑的神经系统，让这个人正常走路。</p><p>咒力起尸的原理与此也是一样的，念咒时，鬼神就被咒力支配，进入尸体当中，去支配控制尸体的中枢神经系统，让尸体起身行走，尸体就能迈开腿和抬起胳膊。鬼神的意根和如来藏都占据了尸体，对尸体起调控作用，尸体就能走路，如来藏和意根分开，哪个也不能单独进入尸体中控制尸体。如果是刚死不久的人，也可以让尸体说话。</p><p>鬼神最开始时，通过运用神通控制胜义根，意识和意根不能正常了别法尘，就无法有效控制自已的身根，这时鬼神的意根和如来藏就来操控人的身根。大脑神经被鬼神控制，全身就归鬼神使用，让怎样就怎样。鬼神想让此人狂乱，一是用神通变现一个幻相假相，让此人的六识了别，然后做出不正常的行为，起到调伏和报复的目的；二是让这个人的六识对正常的内相分，做错误非量的了别，使得六识行为怪异。</p><p>鬼神的意根和如来藏进入他人色身是不容易的，要把大脑中枢神经系统的通道打开，一旦打开，再进去就容易了，别的鬼神进去也容易。鬼神不但要把附体人的大脑神经打通，还要打开身体各主要的经络，占据主要穴位，鬼神的意根和意识才能统治调控人的身体。我们的意根也是这样调控自己身体的，主要通过大脑神经系统来调控全身。所以意根一有思想活动，大脑神经立时就动，色身马上就出现变化。所以触动到意根，色身就要有相应的反应。</p><p>要想断我见和明心，一定要意根受到触动，意根一动，色身就有反应，身心都会发生变化。当鬼神的意根和如来藏从身体上撤离时，与众生临终时的情形有点相同，鬼神的意根如来藏渐渐的从大脑胜义根处离开，人的神经系统和全身一旦要失去操控者，也像四大分离一样痛苦。那时自己的意根和意识还没有完全接管色身。但自己的如来藏并没有离开，当然意根也没有离开色身，否则人就死去了，意根只是无法调控自己罢了。</p><p>八、身心的相互关系</p><p>心经不通一一记仇。肝经不通一一发怒。脾经不通一一抱怨。肺经不通一一悲伤。肾经不通一一压力。心包经不通一一压抑。胆经不通一一焦虑。胃经不通一一急躁。膀胱经不通一一消沉。小肠经不通一一哀愁。大肠经不通一一懊恼。三焦经不通一一紧张。</p><p>为什么经络不通，能导致各种心理情绪反常？经络不通是生理现象，情绪失常是心理状态，生理和心理互相影响，身心互倚。</p><p>这个心一定是指意根，其次才是意识。但是意识这时候想要控制意根的心理失常状态，往往很难，所以有时候就会出现意识不想发火，而意根偏偏发了火；意识不想做的任何事，意根都做了，意识没办法。</p><p>身体只要出现变化，心理上就有反应，说明意根依靠如来藏能时刻了知身体状况，了别的非常伶俐，在这方面的慧力并不弱，不一定要通过意识了别。绝大多数时候意识不知道身体出现什么状况了，需要苦思冥想也许能了解一些，也许还弄不明白，很多人即使病得很重了，还不知道是怎么回事。</p><p>意根与色身息息相关。第一，因为意根执身，认为色身就是我，身体上一丝丝痛痒都很重要，值得重视，所以才有各种反应。第二，因为意根通过大脑神经组织发布命令传递信息，一旦经络堵塞，信息发布不出去，意根就会出现各种情绪。如果能修到不受色阴影响的阶段，那么无论身体怎么样，绝对不会影响到意根心理了。</p></div>"
},{
    "title": "第十四章　六根互通互用的原理",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章　六根互通互用的原理</strong></p><p>一、当我们见六尘境界的时候，有前五识的见，有第六识的见，有第七识的见，也有如来藏的见。佛地之前，一切法都必须有第七识的参与，因此六识见六尘境界时，就一定有第七识的见性。而如来藏见什么法就能变现什么法，第七识就能依如来藏而缘什么法，然后也能见什么法。因为第七识有慧心所，对一切法，对六尘境界也就有一定的了知性，第七识的这种了知性可以不通过六识，而能作直接的了知。</p><p>一般人的第七识没办法细微了知六尘境界，因为第七识攀缘太广，需要照顾的法很多，识心无法集中精力细致了别。由于意根散乱没有禅定，烦恼重，其功能就要受到严重的阻碍，不能得到充分有效的发挥，但是修出禅定断尽烦恼以后，第七识不再受到烦恼的遮障，其功能就能得到有效的发挥，尤其是也降伏了一部分或者全部烦恼习气以后，其智慧德能就越加广大无碍，就能代替六识了知六尘境界，了别一切法。</p><p>比如说阿罗汉因为他的第七识的烦恼和我的执著性已经断尽，不再执我，其功能作用就不再受到阻碍，智慧就广大，德用就增广。如果阿罗汉修完四禅八定，修出神通以后，六根就可以互通互用，第七识意根就能直接了别六尘，不用六识来了别六尘。阿罗汉就可以不用耳根，耳识不用现起，第七识就能直接了别声音；不用眼根，眼识不用出生，第七识就能直接了别色尘；不用身根和身识，第七识就可以直接感觉冷热触痛，在灭尽定里第七识就可以直接了知法尘。而在佛地，佛的无垢识就能直接了知六尘，不用前七识。</p><p>所以学佛修行以后，要尽量降伏我性，降伏我执和法执，烦恼越轻微，执著性越轻微，识心的功能作用就越强大，识心越圆明。相反，贪嗔痴烦恼越重，识心的功能越受阻碍，见识越短小，所谓鼠目寸光是也。修行人应该每日三思己过，努力降伏自己的贪爱，降伏自己的嗔恚，降伏自己的愚痴，降伏自己的慢心，降伏自己的疑见，不要内心里时刻装着小我，处处表现自我，处处以我为主，所有烦恼都要现前来遮蔽自己的智慧出生。</p><p>二、六根互通互用，还有一个秘密，就是五根和六尘境界都是同样的物质色法，属于同类，七识都是识种子形成的功能作用，属于同类，那么同类之间的功能就可以相互代替。如六尘都是由四大组成的，都是色法，类别相同，五根都是由四大组成的，都是色法，类别相同，因此六尘就可以通过一个根，由一个识来了别。所有的色法包括五根、五尘和法处所摄色，也就是五根和六尘。这十一种色法都是由四大组成，只是组成后性质有所不同，但是本质是一样的，这些色法都是能被识心所见、所了别的对象。而能了别的识心，都是由识种子生成，只是了别的对象不同，本质功能是相同的。既然如此，色法本质相同，心法本质相同，那么通过修行，完全可以用一个识心代替所有的识心，来了别所有的色法，这是能够做得到的。</p><p>我们来看六尘这些色法，六尘中的外色尘是由四大组成的，如来藏摄取外色尘成为一种极其细微的四大微粒，这些微粒不断的生灭又生灭而通过眼根传导到胜义根，形成色尘影像，叫作内色尘。外声尘是由四大组成的，如来藏摄取成非常细微的四大微粒，这些微粒不断生灭又生灭的通过耳根传导到胜义根，形成声尘的影像，叫作内声尘。外香尘是由四大组成的，如来藏摄取成为非常微细的四大微粒，这些微粒不断生灭又生灭的通过鼻根传导到胜义根，形成香尘的影像，叫作内香尘。外味尘是由四大组成的，如来藏摄取成非常微细的四大微粒，这些微粒不断生灭又生灭的通过舌根传导到胜义根，形成味尘的影像叫作内味尘。外触尘是由四大组成的，如来藏摄取成非常微细的四大微粒，这些微粒不断生灭又生灭的通过身根各个部位传导到胜义根，形成触尘的影像，叫作内触尘。法处所摄色是由如来藏在前内五尘的基础上再变现出来的，也是由四大微粒组成。</p><p>而能够起传导作用的五根是由四大组成的，是物质色法，是如来藏所出生和执持的，五根性质相同。那么五尘完全可以经过一个根，传导到胜义根，如来藏再变出法尘，然后根尘相触，如来藏变出一个识心，来了别所有的六尘相。就是说眼根可以传导声尘、香尘、味尘、触尘到胜义根，然后如来藏变出法处所摄色，再出生一个识心来了别。同理，耳根可以传导其它五尘，鼻根可以传导其它五尘，舌根可以传导其它五尘，身根可以传导其它五尘，如来藏出生一个识，由一个识心来统一了别六尘。当然这一切事情，由哪个根来传导五尘，有哪个识来统一了别，由意根指挥，意根说了算，就连如来藏也听指挥，那么这个意根就不是普通的意根了，已经达到无漏了。</p><p>那么这个识应该是哪个识呢？答案是八个识都可以，要看各人修行层次而定。层次最高的是佛陀，用无垢识就可以了别六尘，无需七识，其他的大菩萨和凡夫都做不到。其次是地上菩萨和阿罗汉，可以用第七识或者第六识来了别，用五识中之一识了别也可以。如果没有身根的菩萨，那么前四根也不存在，六根中就只有意根，这样的话，这位菩萨能不能了别前五尘呢？当然可以了别。因为前五尘由如来藏摄取变现，第七识可以缘到，定慧圆明的菩萨，用第七识就可以直接了知前五尘和六尘，不用胜义根，第六识和前五识也不用了。而佛地的世尊就连第七识也可以不用，更直接利落。</p><p>这就是无漏妙定、无漏妙慧所成就的极其殊胜的功德，无漏的功德有多么的殊胜，多么的美妙！无明和烦恼习气以及贪嗔痴烦恼，确实是极其严重的遮障了众生自己本有的殊胜的功德，使得自己只有本来佛的虚名，而没有本来佛的实用，实在可惜又可叹！怎么办呢？我们应该力求断除烦恼，断除一切无明和染污。而断除烦恼和染污只能通过断我见和明心见性这条路，当大心菩萨，自利利他。这样就能恢复心地的本来清净的面目，把心地的所有光明全部都显发出来，就会拥有最殊胜和最圆满的果报，就是果地佛的果报！</p><p>三、欲界众生都有八个识，佛也有八个识。中阴身里也是八个识都具足的，不是只有第七识，只不过在中阴身里第七识的习气能完完全全表现出来，没有遮掩，第六识的控制力比较弱，不能完全有效的控制第七识，第七识就按照自己的习气惯性行事，所以说死人心直。在中阴身里，第六识所起的思考分别作用相对活着时弱一些，第七识对六尘的了别，没有多大的依靠性，就会按照自己的习气来行事和做主了。如果第七识的烦恼没有降伏，这时烦恼就能完全表现出来，然后就按照烦恼习气投胎，投胎以后就要受生死苦了。中阴身里也有身体，也有眼耳鼻舌身，只是色身比较虚灵，不是实质的肉体，是微细四大物质组成的，因此色身受到的阻碍就小，就能有一些微弱的神通，比如天眼通、天耳通、他心通、神足通、宿命通，能知很多人类所不知的事情。</p></div>"
},{
    "title": "第十五章　楞严经第五卷大势至菩萨念佛圆通章解析",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章　楞严经第五卷大势至菩萨念佛圆通章解析</strong></p><p>原文：<strong>若众生心，忆佛念佛，现前当来，必定见佛。</strong></p><p>能决定现前或者是将来见佛的心，肯定是意根第七识，如果意根不想见佛，绝对见不到佛，意识无论怎样想见佛，都没有用，根本感应不到佛。因为见佛这件事是由如来藏安排和实现的，如来藏只能了别配合意根的心行，实现意根的意愿。意根还没有念佛的心，意根不念佛，不想佛，没有见佛的愿望，如来藏就无法配合意根去见佛。即使意识非常想见佛，也得熏染到意根，由意根决定念佛想佛，由意根指挥去见佛，如来藏帮助幻化佛的影像，让意根缘，再出生意识缘佛的影像，这样就见到幻化佛了。</p><p>如果是见法身佛，也得是意识与意根二者共同参禅，意识想证得法身，意根也得朝夕想见法身，行住坐卧参究不断，缘熟才能见法身。破参时，意根给予此事确认，如来藏记录此事，此人就成为一个证悟者，证悟的业种存留如来藏中，来世受用；来世缘熟时，业种输出，就能很快再次证悟。如果是意根没有确认的解悟，没有真正证得法身所在之处，以及所起的真实功用，来世就很难发起证悟之功德，因为意根与此不相应，意识又是断灭，是新生者，对前世无有记忆。</p><p>由此可知，浅层次的念佛，是意识念，深层次的念佛有意根参与，由意根发起念佛，意识配合，如来藏配合。当意识不自觉的就能念佛时，这是意根发起和决定的，叫作不念而念。浅层次的想佛是意识的想，深层次的想佛是意根的想，只有意根的想，如来藏才能满意根的愿，必定能让意根见佛，然后意识也见佛。</p><p>原文：<strong>今于此界，摄念佛人归于净土。</strong></p><p>表面看是大势至菩萨摄受念佛人归于极乐净土，实际上是如来藏把意根带到净土，也是意根领着如来藏到净土中，是意根发愿想到净土中，如来藏配合，就在净土中出生此念佛人的五阴身。在临终时意识就灭了，到净土以后，如来藏出生意识和与净土相应的五阴身，也就是与业种相应的五阴身。五阴念佛，通过意根把念佛的业种存入如来藏中，意根被意识念佛熏染成功，意根深信切愿，真诚念佛，如来藏里的业种就建立起来了。缘熟时，如来藏输出业种，意根与业种愿力相应，就与如来藏一起到净土中，同时如来藏在净土中出生五阴身，此人就是净土中人。</p><p>原文：<strong>佛问圆通，我无选择，都摄六根，净念相继，得三摩地，斯为第一。</strong></p><p>哪个心能都摄六根？只有意根能都摄六根，意根首先被降伏，管住自己不随意到处攀缘，然后再管摄五根不到处攀缘。意根是如何管束五根的？当色法现前时，意根不作意、不触、不受、不想、不思，不决定见色，那么如来藏就不在色法处出生眼识，根尘不相触，如来藏也不在色法处出生意识，这样虽然有色而无见，眼识意识清净。同样道理，当声音现前时，意根不作意、不触、不受、不想、不思，不决定听声，如来藏就不会出生耳识和意识，这样就把耳根管住了，耳识和意识就清净了。同理，每个五尘现前时，意根都不攀缘、不作意、不决定了别，六识就不了别，那么心就绝然的清净，只有一个念——佛，这就是净念。</p><p>那么想让这个净念相继而不断，怎么办呢？意识总是要感觉疲乏和疲累的，总是要休息的，总是要睡觉和吃饭的，总是要处理五阴杂事的，因此总是要断灭的。要想相继不断，只有永远不休息、不断灭的意根念佛想佛，才能相继不断。不管是睡眠也好，不管是吃喝拉撒也好，不管是昏沉也好，意根都可以保持念佛状态，甚至睡着以后，现出梦境，在梦里念佛，这样念佛就像念到骨髓里一样，绵绵不断。</p><p>那么怎么能进入三摩地呢？三摩地是定慧等持之地，六识不动，意识不散乱，缘于一念——佛。要想做到这样，意根必然得到调伏，也不散乱、不攀缘，对六尘境界不作意、不触、不受、不想、不思、不造作，只能缘于一境——佛。这样六识才能保证不散乱、不攀缘，意识只能念佛，别无他想，就入念佛定中。</p><p>智慧方面，由此念佛中，深深参究：念佛者谁？深深疑着，行住坐卧、吃饭睡觉都有疑，疑到骨髓里，因缘具足，就能证得念佛者究竟而谁，大事了毕，就入三摩地中，心心念念都是佛。在此当中，意根的功德极大、极大，若不是祂，休想达到三摩地的边缘，永不入界内。</p><p>念佛有口无心的念，是假念佛，不是真念佛。真念佛是从心往外的发自内心的念佛，是不念而念的念，是心心念念无间断的念佛，乃至于睡觉也能念佛。意识绝对做不到睡觉也能念佛，绝对做不到心心念念无间断。只有意识念佛，就是假念佛，是走形式似的念佛，是念给他人听的，让他人知道自己在用功念佛，实际上心思不一定在念佛上，杂念丛丛，意根牵着意识四处游荡，居无定止。真念佛，不管五阴在做什么，心念都在念佛上，意根只注重念佛，不喜欢其他事情。</p><p>修布施行，也有真修和假修的，有口无心，用言语欺骗他人和自己的，就是意识的假布施，意根并不想布施。真布施，就能以实际行动表现出来，不用花言巧语欺骗人，实打实的做事，即使做出来也未必要说出去。</p><p>既然有真有假，想要求真时，意识就要劝导意根，熏染意根，让意根念佛，让意根布施，让意根修行。意根受熏了，祂同意以后采取实际行动，就叫作动真格的，是真念真布施真修行，不是说一套做一套的欺骗人。意识劝导意根，就是在同意根商量、协商、谈判，或者软硬兼施，只要能让意根同意，意识就达到目的，事情就成功。主人动起来，就能办事，领导毕竟是领导，参谋毕竟是参谋，有决策权者，才是老大。</p><p>意识念佛者，是假修行，不能感应到佛，不能让花开见佛，不能悟无生。意根念佛，才是真念佛，早晚必见弥陀，融入弥陀性海。这才有行动力，才有感召力，才能与诸佛菩萨相应；从而能面见彼佛诸大菩萨，往生极乐世界净土，花开见佛，悟无生，住唯心净土。</p></div>"
},{
    "title": "第十六章　意根杂谈",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十六章　意根杂谈</strong></p><p>一、境随心转</p><p>真正能变现境界、改变境界、转变境界的是如来藏，但是境界不随如来藏而转变，单独如来藏不能变现境界，不能改变境界，不能转变境界，祂是随六、七识的转变而转变的。六识先转变，带动七识转变。七识转变以后，如来藏随顺第七识，配合第七识，才能转变境界。只有第六识转变，还不能转变境界，因为意识不是作主识，不能直接指挥如来藏输出种子造作一切法。如来藏听从第七识的指挥，第七识无论想要变动什么法，如何变动，如来藏全部随顺配合，只要有业种存在，业缘成熟就行。而第七识的心转变，业种一定转变，境界就一定能转变。</p><p>二、不管意识是哪种情况，意根都在活动着，都有思虑和思量。意识拿不定主意时，可以选择愣神和发呆，说不定什么时候，好主意就想出来了，这是意根想出来的。</p><p>意根的心行极不容易静止，不要以为意识静止，意根就静止了，意根的思想活动恐怕我们所有人都观察不出来，太深。即使意根能暂时静止也不能入无余涅槃，我们对无余涅槃要有正确的理念，只有在意根对三界世俗法贪爱全部断尽，对自我五阴身的执著全部断尽，对世间不抱任何希望，命终才能入无余涅槃。</p><p>入无余涅槃要有一个过程，必须证得一二三四果，有初禅以上禅定，断除了所有烦恼，然后意根心念越来越少，入定非常容易非常快。命终时，色身四大分解，意根的五遍行心所减少，对三界不再作意，不再领纳，不再取相，也不分别，不再抉择，不想有任何的造作，如来藏就不再出生任何法，于是五阴身灭去，没有中阴身，也不再投生，就入无余涅槃了。</p><p>三、每一个人的如来藏里，都含着意根的无明，而且无明的程度和内容不太一样，贪嗔痴烦恼轻重程度都不同，所以每个人遇缘学佛的时劫不相同，修行成佛的时间长短也不一样。无始劫来法尔就如此，无明比较少和轻微的众生就会早遇佛法，早修行，无明越重越深陷在无明深渊里，苦恼越多。因为无明深重的众生，接触佛法也会比较晚，学佛修行也会很慢，成佛时劫就非常长久。</p><p>十方世界已经有无量无边之多的诸佛，可是十方世界还有那么多的细菌、昆虫、小动物，太多太多了，一小片土地上，那些个恶道众生都数不出来，不知道什么时候得人身，得了人身以后，不知道什么时候能遇到佛法修行。所以我们将来成佛了，那也是先于大多数众生成佛的，后面还有大批众生在三恶道里受苦。那些恶道众生，还是有无量无边又无量无边之多，真是不可想象。所以我们都应该发大愿，广度无量无边的众生，脱离苦海。</p><p>四、梵网经菩萨戒，是过去、现在、未来千佛大戒，从受戒得戒体开始一直到成佛为止，所得的戒体生生世世不失，即使犯戒受恶报也不失去戒体，而其它戒都是一生一世受持，今世五阴灭去，戒体也随之失去，下一世新五阴就没有戒体，需要再重新受戒。为什么如此？</p><p>因为梵网经所传的是大乘菩萨心地戒，所谓的心地是指意根，受戒之后能使意根渐渐如真正的心地如来藏一样清净。意根代表真正的五蕴妄我，意识不能代表，因为意识生生灭灭不可靠，又不能主宰五蕴的身口意行，因此代表不了五蕴妄我。那么受戒时，只戒意识的心行不起决定作用，身口意行清净与否在于意根。因为意根生生世世不灭，一旦得到戒体，生生世世不失去戒体，那么五蕴后世遇到恶的因缘时，因为有戒体的护持作用，意根就能远离恶緣，不犯戒行。</p><p>戒，主要就是戒意根，戒意识没有实际作用，意根要犯戒，意识若无力反抗，必随从同流合污。意根依止如来藏的清净性以后，不用意识规范劝导，意根自然而然就能守持戒律不越矩，心地清净，后世生来心就是清净的。</p><p>为了让意根得到戒体，在受戒道场上，就要一心专注的观想佛光照耀自己的身心，金黄色的光芒直接从头顶倾注到心田，全身沐浴在佛光之中。由于专注一心一意，意根发自内心愿意接受佛力的加持以获得戒体，如来藏配合，就感应到了十方诸佛灌顶加持，于是消除了宿业的遮障，得到了戒体。戒体起用就能止恶防非，不造恶业，不受恶果报，这样在菩萨之道上就能顺利前行，快速成佛。</p><p>如果在戒场上，思想散乱，不一心观想，意根还缘其他的法，攀缘重，心就不真诚，如来藏就无法配合，感应不到诸佛的加持，那就不能得到戒体，以后遇到犯戒的缘，就没有遮障，极容易随缘造恶业，将来就有恶果。而受恶果报时，菩萨道的修行就受阻碍，成佛就无期了。</p><p>五、戒，先戒六识，后戒意根。守戒需要六识先守持，意根最后一起守持。六识所守持的戒都是有相戒，意根守持的戒是无相的心地戒，只有在意根变得非常清净时，才能守持戒律。意根能自觉守持戒律时，并不在意外表外相，因为意根对于世俗界并不感兴趣，无心于世俗法，那么在世俗法上的行为造作就没有心的过咎，也就不犯戒，但为了不让众生生起误会和诽谤，为了更好的摄受众生，菩萨还是要随顺于大众的心理，所有外在的行为也要严谨和庄严，要具足三千威仪八万微细，而其内心并不着于这些相貌，这时大乘的心地戒就成就了。</p><p>所以真正看人不能只看外表，要看他的内心。众生无智慧，喜欢着于表相，菩萨有智慧注重内心。有心地戒的菩萨才能更好的随任何缘度化众生，而不被众生所度，因为不易动心故。菩萨于因缘示现种种相，可是内心深处之意根不为相而起心动念。所以大乘戒戒心地意根，小乘戒戒外相六识。</p><p>六、外根触外尘，内根触内尘，不仅内外根有关联，内外尘也有关联，乃至于内外识都是有关联的。六识触内尘，在内尘上造作，外尘是否发生变化？如果发生变化，是外尘先变化，还是内尘先变化？</p><p>仔细思惟观行可发现，意根既在内尘上作主起推动作用，同时也在外尘作主起推动作用，这就证明了意根既是内识，也是外识。比如手把书本拿走了以后，外尘的书本毕竟不在原处，他人看不见了，自己的内尘的书本位置也改变了。外尘的改变是由意根作主的，内尘的改变也是由意根作主的。比如面包吃到口里，到胃里，肯定是意根作主吃的，内尘粉碎了，进入胃里了，外尘在口外进入身体里，也是由于意根作主的。意根如果不作主不起推动作用，内外尘短时间内都不会改变。</p><p>内尘永远依赖外尘而出生和存在，没有外尘就没有内尘，先有外尘，后有内尘。独影境除外，它不依外尘而有，所以独影境很活跃不稳定，变幻莫测，意识大多数时候把握不了，控制不了。为什么控制不了？意识无能力降伏意根，无能力控制意根。</p><p>既然内尘依外尘而有，那么尘境的改变变化，一定是外尘先改变，内尘随之才改变，其变化差不多是同步的。如果把外尘改变了，就同时改变了相关众生的外尘，也就改变了相关众生的内尘。如果这种改变是他人所不允许的，就侵犯了他人的相关利益。</p><p>比如把公共财产损坏了，各自的外尘和内尘都改变了，他人不许，就侵犯了他人的利益。毁坏和改变他人的色身，不仅改变了自己的内外相分，也改变了他人的内外相分，他人因此受损而气愤，他人因此受益而心喜。如果毁坏自己的色身，不仅改变了自己的内外尘，也改变了他人的内外尘，自己的亲人也不允许而痛苦。</p><p>如果只改变自己的内尘，不涉及他人的内外尘，就与他人无关。只有独影境完全属于自己的，不涉及他人内外尘，无论如何改变，他人都不知。比如观想佛像成就念佛三昧，十方诸佛皆在面前立，其他人都不能见到这种情景，念到极乐世界出现在眼前，他人同样不能见，否则他人也同时成就了念佛三昧功德。那么一个人修行，所有众生都能借光成就。</p><p>七、第七识成就报身佛，也成就化身佛，一切法都是由意根发起，如来藏成就，佛身也如是。一切意生身都是由意根发起，如来藏所化。意根是业报主，除非无余涅槃，永远不灭，承受各种善恶果报，无穷无尽。意根就是世俗界世间的我，如来藏是出世间的我，虽然在众生位还不具足我性，方便说为真我，以区别于意根妄我。报化身佛都在世间大作佛事，弘法度生。法身佛是出世间佛，非在世间，非不在世间。</p><p>世，代表流转，流转就涉及到时间的迁流变化；间，代表地理方位，空间位置，就是国土器间，报化身佛的存在涉及到时间和空间，就是在世间。一切法的出现，必在世间，离世和间没有法存在，世间就有世有间，没有世和间的法，只有如来藏一法，诸佛的法身没有时间和空间，也不需要世间。诸佛的报身和应化身，都有世和间，有寿命有国土。</p><p>世，三世，过去未来现在，就代表时间，代表流转。时间和空间，都是由物质色法烘托和衬托出来的。没有物质之处，即是空。宇宙最初形成之前，一片空旷无物，宇宙物质色法出现以后，才有了器世间，时间才开始显现出来，世间才有了依托。</p><p>由物质色法的变迁，把时间显现了出来。宇宙器世间形成之后，三界世间成立，众生的色身才能出现，五阴世间就建立起来了。所有这一切法，包括最初的空旷虚无，都是如来藏显现和出生的，都是如来藏的相分，其中就有如来藏的见分。如来藏先有见，后变相分。所以除了如来藏，全部是幻化，泯去一切相，就是一真法界。</p><p>十方诸佛国土，只要有佛住世，就有登地大菩萨随佛修学，佛就要讲甚深唯识种智，比如极乐世界，菩萨摩诃萨无量无边，阿弥陀佛一定为这些菩萨讲唯识种智，否则那些大菩萨为何要围绕阿弥陀佛身边。释迦佛在我们娑婆世界也讲唯识种智法，有留下的经典，也一定有没有留下来的经典。</p><p>八、梦魇的原理</p><p>梦魇的时候，身体动不了，嘴不能出声，是身体被控制住了，大脑胜义根被控制了，有的是意根被鬼控制住了。</p><p>当身体被控制住的时候，身体不能动，或者是不由自主的动，是鬼神意根操控的。但意识是非常清楚明白的，意根也能知道。</p><p>当意根被控制住时，不仅身体不能动，或者是不由自主的动，意识言语思惟都是不由自主的，是鬼神的意根操控的，身口意的造作都是不由自主的，意识心里多数时候是不知道的，一旦知道，如果意根有力量，就能挣脱束缚，就能自主了。</p><p>九、意根的存在没有开始，只要知道意根不存在是什么情况，就能知道为什么意根不能后天出生，必须是无始劫以前就存在的。如果意根是后天出生的，那么意根出生之前就是无余涅槃境界，分段生死已了，对三界贪爱已经不存在，没有生死轮回苦了，那众生就是阿罗汉。可是众生从来没有当过阿罗汉，如果众生当过阿罗汉，就不会再退回到凡夫，受六道生死轮回苦。众生从来也没有作过佛，如果作过佛，佛不会再退回凡夫众生，否则我们学佛就没有意义了。圆觉经中佛说过：金矿提炼出真金以后，不会再掺杂杂质，就是这个道理。</p><p>意根的存在没有开始，如果有开始，在开始之前，就没有意根，只有如来藏。如果是这样的话，就是无余涅槃状态，什么人能入无余涅槃？破我执断我见的阿罗汉能入涅槃，三果以下的人，都不能入无余涅槃，因为三果以下的众生还有我执和对三界世间的贪爱。</p><p>明心见性以后满心位的初地以上菩萨能入无余涅槃，但是菩萨故意留惑润生，不入无余涅槃。但是入过无余涅槃的阿罗汉，如来藏出生意根，阿罗汉从涅槃境界出来以后，就不是凡夫了，意根里也没有一念无明，没有贪嗔痴烦恼，没有我执，没有对三界的贪爱，永远不会退回凡夫境界。</p><p>但是世界上为什么能有无量数的凡夫呢？有凡夫众生是不可能的，因此就说明，世界上的凡夫众生从来就没有当过阿罗汉，从来就没有断除过贪嗔痴烦恼，从来就没有入过无余涅槃。因此说众生的意根从来就是存在的，无始劫以前就存在着，一直带着无明烦恼存在着。</p><p>无余涅槃是意根断灭的状态，意根断灭还有人入无余涅槃吗？没有人入无余涅槃，涅槃里没有人。如来藏本来就是那样，也同样不入无余涅槃，无论意根在与不在，都不在涅槃里，也不在涅槃外，无始劫以来一直是那样清清静静的心态。有我见存在，就无法灭七识，命终依然会产生中阴身。如果说是我入涅槃，内心就还有个我的存在，就不能入无余涅槃，因为心不空净。所以意根的存在没有开始，可以有终，可以不让祂终了，永远长寿。</p><p>十、母子连心的原理</p><p>母亲在家里做针线活，孩子在外面出事了，这时针突然扎在母亲的手上，手出血了，母亲马上就感到是孩子出事了。或者母亲出事了，孩子这时突然间有个感应，就知道是母亲出事了。</p><p>这个原理是因为两个人不仅有血缘关系，而且缘分很深。这个关系实际上是两个人意根之间的关系，缘分也是两个人意根之间的关系。意根因为无量劫的经历，非常清楚两个人的关系，所以就会互相关注，一旦一方有事，另一方马上就能感知到。为什么如此？因为意根随着自己的如来藏无所不知，比较关注的人事当然就会一直关注着，对方一旦有特殊的事情发生，如来藏就会根据意根的心思，把那个信息发送出来，意根就知道了。然后又想办法让自己的意识知道，再作以处理，如果不让意识知道，意根自己无法处理。</p><p>十一、畜生的心行是否是无记的</p><p>畜生的第八识心行是无记的，畜生的意根心行是无记的，畜生六识的心行不是无记的。六识造作的业行都要存入业种，都有果报，比如畜生听闻了佛法，死后可以上天享福，佛经中有此记载。跟人类接近的畜生，生活在人类身边的畜生，由于熏习了人类的法，明了人中的事情，与人相近，死后容易托生在人类中，比如猫狗之类。畜生无意中供养了三宝，将来就能得大善报，证果很快，佛经中有此记载。</p><p>畜生与人有所不同的是，畜生的意识比较愚痴，无法有深细的思惟分析，对意根出谋划策的引领作用小，多数情况下都是意根习气作用的显现，因此也显得愚痴和憨直，心机比较少，没有虚伪性，不圆滑。这也是人类喜欢某些畜生和害怕某些畜生的原因。</p><p>畜生都处于受前世果报的筹偿中，由于意识作用力小，新造业的能力就小，果报受尽，就会再投生人道中。人身才是造业最严重的，因为人的心机比较大，因为意识强大，能造新业。欲界天人的意识也强大，但他们属于受善报阶段，由于能充分享受福德的缘故，没有必要造作恶业，善业造作的也比较少。</p></div>"
},{
    "title": "第十七章　问答",
    "author": "生如法师",
    "date": "2018年11月24日",
    "html": "<div class=\"B1_text\"><p><strong>第十七章　问答</strong></p><p>一、问：为什么在娑婆世界念佛的人，有往生的意愿，极乐世界七宝池中，就有属于此念佛人的那朵莲花，而且每个人的莲花颜色和大小都不一样呢？</p><p>答：如来藏和意根都无形无相，十方世界哪里都能到，没有阻碍。而且对于如来藏来说，任何一个世界，不管多么遥远，都在祂自心当中，不隔丝毫，没有距离和界限。意根只要有意愿，因缘条件具足，如来藏就会随顺配合意根，满足意根的意愿，如来藏永远是随顺配合于意根的作意和思心所。</p><p>一个念佛人，如果非常精进，善根深厚，就会从内心里一心系念极乐世界，意根就有了往生的意愿，于是意根就发愿想要往生极乐世界。如来藏就会了知到意根的思心所，知道意根的决定，就会到极乐世界创造往生的生存环境，就会在七宝池中建造与念佛人修行程度相应的莲花宫殿，当然也是意根决定这样做的。如来藏就会在七宝池中输出四大种子，于是就建造成了一个莲花台。其中莲花台的品质、大小和色彩，是要根据六识的修行品位来决定，也就是要根据念佛人念佛修行时，存在如来藏里的善业种子而决定，如来藏能了别到念佛的善业种子，根据种子输送四大，造就莲花台。</p><p>造好之后，如来藏就继续执持这个莲花台，意根就盼望着自己将来能够往生到这里。如果念佛人修行懈怠，退失道心，或者有了其他愿望，不想往生极乐世界了，那么如来藏就不再执持这朵莲花台，于是莲花台就会慢慢枯萎消失。往生极乐世界以后，意根与新的六识就住在那朵莲花台中，方圆非常广阔，这样极乐世界的国土就增加了，而且莲花台的品质越好，极乐世界的莲花池越庄严，极乐世界也会更庄严了。所以精进念佛，就是在庄严极乐世界的佛国净土。</p><p>二、问：为何当面听法比看书听录音更有摄受力，效果更好？听师父讲的时候，可以随着师父的声音生定生解，对所讲法义的理解体会更深透，在法义上更有受用，这是为什么？</p><p>答：看书听录音时需要意识想象思惟，想对应的情景，比量非量的成分多，效果就差，摄受力弱。在当场摄受时，现量成分多，双方的意根之间还有交集有感应，有磁场效应，因为意根最相信亲眼所见，在亲眼看见的情况下也最能相应。看书时意根没有亲眼看见，距离远，需要通过意识的思惟想象，相应得就慢，摄受力就弱。当场所见对方的肢体语言与面部表情，当场所听的声音，都加强自己的理解和感受，让意根增强现量的观察，更能相应，摄受力就强。所以佛住世的时候，弟子都紧跟着佛，不愿意离开佛，离开了佛就没有了这种强大的摄受力。</p><p>三、有意造恶业和无意造恶业果报有什么区别？</p><p>有心造恶业和无心造恶业，在世间的法律上有不同的裁决结果，比如故意杀人和无意杀人，其法律上量刑结果就不同，那么按照佛法的道理，其因果也是有差异的。因为用心不同，果报就不同，有意为重，无意为轻，世出世间法都是以心的出发点为重，心性不同而有不同的果报。心为万事万物主，有心造恶业，是意根出于染污的心态，指挥六识造恶业，其心性就恶劣，性罪就重，不可原谅。无心造恶业，是出于偶然，不是故意，意根不是出于染污的心态，只是恶缘现前，业果就实现了，其心不恶，其罪就轻，可以原谅。性是心性，是指有贪嗔痴烦恼和无贪嗔痴烦恼的性质，有贪嗔痴烦恼造恶业，其业就重，无贪嗔痴烦恼造的恶业，其业就轻。</p><p>同理，有意有心为善，其心是善，纯想利益他人，心性为善，善果报就大；无意做善，其出发点并不是想为善，不想利益他人，只是业缘成熟，业果现前，巧合让他人得了利益，其心性不一定是善，也许还有恶的心性，那么善的果报就小。众生造善恶业时，如来藏都会如实做记录，也同时记录众生的善恶心性，其用心和出发点都做记录，丝毫不漏。既然如此，有意做业和无意做业其果报就不同。善用其心，就是我们众生应该修行的内容和核心，心不同，做善恶业的结果就不同，佛和众生做同样的事情，其结果就有天渊之别。佛得福德就有无量大，众生的福德就是很有限量的，因为心不同。佛是纯净的心，众生是染污的心。</p><p>有心为善，是指主观上有想利益他人的念想，心地是善的。无心为善，心里不一定有想利益他人的想法，但是行为上偶尔凑巧让他人得到益处了。所以有心为善的，因为心地善良，果报就大，无心为善的人，因为不是主动做善，心地善的功德就小，果报就小。做恶与此相反，有心造恶，恶报大，因为心地恶，无心造恶，恶报就小，因为心地不恶。</p><p>造恶业，业种收存时，同时也把七识的心行一起收存，心行恶，就收存七识的恶心行再加六识的身口意行为；七识善，就收存善的心行，加身口意行为。心性恶就有罪业，身口意行为的果报加上心行的果报，就是双重果报。那么善心造恶业，与恶心造恶业，果报就不同，故意杀人和无意杀人，就有不同的果报，心行不同故。心行很重要，心地如果染污，就会生生世世造恶业。</p><p>四、问：为什么能发生视而不见、听而不闻的现象？这时还有识心存在吗？</p><p>答：视而不见、听而不闻、食不知味这些现象的发生，说明了意根对眼前的色、声和味都不感兴趣，祂有别的更重要的事情要去对待处理，这时不注重眼前的事情。意根对于自己不关心的事情，不会把全部注意力放在那里。意根不在意时，就不会让意识心专注了别自己不感兴趣的事情，那么意识与眼识或者意识与耳识的了别性就轻微，于是就出现了视而不见、充耳不闻或者食不知味的现象。</p><p>但是这时还是应该有眼识、耳识和舌识的存在，因为根触尘，如来藏就会产生识出来，既然有视有听有食，就说明根触尘了，那么必然会有识心被意根产生出来，不同的是，这些识了别得很微弱，只了别一点点，以至于意识心感觉不到了别了。当视而不见时，毕竟眼根触色尘了，如来藏就通过眼根传导色尘的影子，传导到后脑勺，根尘相对，如来藏产生眼识和意识，就会有了别，只是识了别的轻重的差别而已，听而不闻和食不知味也是这样。</p><p>根就是受纳器，只要与尘相对了，肯定会接收色尘，会有内相分产生出来，只是这时会不会有识产生出来。比如睡着无梦时，有内相分的存在，只是没有识心出来了别。但是视而不见时与睡着一无所知的情况还是有区别的，这时是有知的，因为这时毕竟还是知道光明和黑暗，不是连眼前的光明和黑暗都不知道了。既然知道光明和黑暗，那就有识心的了别，尽管很微弱。如果意根真的不想看，也有可能不产生识。如果有轻微的见，就有识在了别。识是可以分散不专注，识面对的境界越多，了别的越轻微。比如眼观六路，耳听八方，识心可以去了别很多事物，但是心思就分散了，那么没有训练的人，有些事情就不能很清楚的知道。</p><p>识的分别会有主有次，以什么为主，以什么为次，由意根说了算。这样对各种境界了别的程度就不一样，就会出现视而不见等等的现象。视而不见时，走路既不会跌倒也不会撞墙，既知明也知暗，也在专注内心所思惟的事情。这时如果没有识心的知，就不知道现在是黑夜还是白天，那他也没法走路了。视而不见时应该有知，因为这不是二禅以上的禅定境界，最多只能达到初禅。</p><p>二禅以上境界，没有五识，不知五尘境界，但还是知道自己入定了，知道自己没有念想了，那就有意识心存在。一般人都说这里没有意识心，没有知了，其实里面有知的，意识心存在着。这要比视而不见、充耳不闻的定境深很多，所以视而不见、充耳不闻还是有知有识心存在的。如果没有眼识，应该不知道明暗，视而不见时是知道明暗的，所以有眼识和意识的存在。两个识都有特定的专注目标，其它几乎不分心，但是也分心一点，和睡着一无所知的状态不一样。</p><p>五、问：色法在后脑胜义根里变现出来，心法在哪里出现？</p><p>答：心法有八，如来藏本身不用变现，祂是諸法之本源，不生不灭，无形无相无处所，又遍一切处，遍一切法。第七识无形无相，不在色身的里外中间，但是能触胜义根里的法尘，也就不离胜义根，只要有法出现之处，就有意根的推动作用。六识无形无相，不在色身的里外和中间，也触和了别胜义根里的内六尘，那就更不离胜义根，有内六尘显现之处，就有六识的存在和运行。根据世尊所说，根尘相触生识的道理，我们应该知道，六识一定在根尘相触处出生，就是在胜义根处出生。六尘之法，都是三个能变识变现出来的，所以有六尘之处，就有八个识的运作。虽然七识都不离胜义根，也不在色身的里外和中间，无形无相故，虚妄故。</p><p>第七识能默容如来藏所变现和执持的一切法，胜义根之外的法，意根也能触和了别，比如自己的尸体，掉下来的骨肉，前世的所有物，前世的有缘人，过去世的所有法尘等等，意根都能触和了别，这些法都不在胜义根里，因此第七识不在色身的里外和中间，也不离胜义根大脑。</p><p>心所法也是心法，是与八个识所相应的法，随着八个识的运行而出现，无形无相，也不在色身的里外和中间。</p><p>六、问：有人想自杀，并且采取了行动，意根为什么同意自杀？</p><p>答：自杀的行动不管是被逼迫的也好，还是自愿的也好，当然是意根采取的，是意根的决定。当意根无奈，对生命心灰意冷以后，就能作出自杀的抉择，一个是业力使然，业种成熟业缘现前时，意根与业种相应，就以自杀的形式了结业缘，实现业种，这是果的实现，了了前世的因。二是环境逼迫，意根对世间一切都绝望，不抱希望，或者把希望寄托来世，对现在的人生心灰意冷，因此选择自杀，这是因果的因，现世的造因，后世才有果的出现。</p><p>意根绝望，叫作心死，心如死灰，就得把身体灭了，离开人世。从这里可以看出，意根到底有没有愿望，有绝望就有愿望，愿望不能实现，才不得不绝望。意根决定自杀时，自己不能直接灭掉命根，就要指挥六识采取一些外缘措施来伤害色身，比如说投河、上吊、割腕等等自杀行为。这时是意根主动要自杀死亡，比较坚决，不管有没有意识的错误分析错误引导。</p><p>当自杀失败，自己被人救活以后，还要想死，趁人不注意，还会决定再次自杀，表明意根铁了心想死，心如死灰、心灰意冷了。有听过在凳子腿上就能自杀的，心如死灰也，心灰意冷到极点，躺在床上，不采取任何措施就能死去，因为意根对生存一点希望也没有了。</p><p>如果人饿了好几天，而仍然没有吃的东西，随时可能被饿死，有人可以骗他说再等等，马上就有吃的东西了，这样那人就能一直熬着挺过一段很长时间而不死，因为意根怀抱着很大的希望，强烈盼望着食物，祂就不决定离开色身，一直坚持着不让六识灭去。这是受他人鼓励鼓舞的结果，意根希望不灭，也就不离身。所以说意根是有愿望有愿力有希望的心行，有想要达到的目标，有要躲避的人事物，也就有希望泯灭的时候。</p><p>七、问：阿罗汉出涅槃以后，新出生的意根是有开始的吧？</p><p>答：阿罗汉从涅槃境界中再出来，意根仍然要延续前世的烦恼习气和无明，仍然有无始无明。至于说意根是不是有开始，可以说有开始，是新出生的意根；也可以说意根还是入涅槃之前的意根，与涅槃前的意根的习气惯性和无明，还是一样，是连续性的。</p><p>但是这些只是每个人的认知角度问题，都无关紧要。有些概念争论起来没有多大意义，随各人意，而定义各种概念，无关法义。我们只要懂得得义亡言，依义不依语，这样无畏的争议就减少了，省下心力，可以用在更有意义的修学上。我们学佛也应该学会不纠结名相，善于从各种名相的羁绊当中解脱出来。</p><p>思惟分为正思惟和反思惟，正推理和逆推理，这样逻辑思惟就能更严密。有很强的逻辑思惟能力属于菩萨因明学的一种，懂因明学的菩萨，与人辩论时，心思慎密，逻辑严谨，才能无往而不胜。</p><p>  </p><p> <strong>末那识颂</strong></p><p><strong>亿亿劫来滞泥尘    披毛戴角荒草食</strong></p><p><strong>你牵我引行暗路    背觉合尘溺苦轮</strong></p><p><strong>而今回头光明路    洗心革面甘露饮</strong></p><p><strong>执鞭策杖奔净土    远尘离垢涅槃城</strong></p><p><strong> <span> </span></strong></p><p><strong>鞭挞意根</strong></p><p><strong>忙碌一天睡意浓    忽觉痛痒眠中醒</strong></p><p><strong>手抓皮肉心烦躁    再卧枕边睡不宁</strong></p><p><strong>无始劫来执身重    蚊咬包包也劳神</strong></p><p><strong>常被觉受所恼乱    何时放身得自在</strong></p></div>"
}]