[{
    "title": "第一章 意根的相关概念解释",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  意根的相关概念解释 </strong></p><p>一、意根的五个名字含义（一） </p><p>大乘起信论原文：<strong>生灭因缘者。谓诸众生。依心意识转。此义云何。以依阿赖耶识。有无明不觉起。能见能现。能取境界。分别相续。说名为意。</strong></p><p>释：一切法的生和灭，都是由于因缘所现起的，这些因缘包括阿赖耶识、意根和意识这三个能变识，其中意根是一切法现起的最重要的因缘，众生都依意根而流转着。虽然说阿赖耶识是一切生灭法出生的直接之因，但却是由于意根所促成的，没有意根这个因和缘，阿赖耶识则不出生任何法。意根依着阿赖耶识，随着自心的无明就会见阿赖耶识出生的一切境界法，然后再在心里显现出阿赖耶识所出生的一切境界法，取着阿赖耶识所出生的一切境界法，不断地相续地分别，而丝毫不觉悟自己有这样的无明。这样的心体名为意根。</p><p>原文：<strong>此意复有五种异名。一名业识。谓无明力。不觉心动。</strong></p><p>释：这样的意根有五种不同的名字。第一个名字叫作业识，意根是造业的主人，因为有无明，又不觉悟自己的无明，无明力就促使意根心动起意，作意了以后，后续就有触受想思的出现，意根心得决定以后，六识的身口意业行就造作出来了，继而留下了业种，以挨后世受报，于是生死相续不断。所以说意根是业识，与无明业力相应，与业种相应，与生死相应，当然通过修行就会与空相应，与清净相应，与寂静相应，与解脱相应。所以修行就是要修意根，断我见，明心见性，转识成智，具唯识种智，最后成佛。</p><p>既然意根与业力相应，与业种相应，那么断我见的清净业由意根任持，明心见性的清净业由意根任持，只有意根断我见和明心见性才能任持这样的清净业种，否则意根不能任持，后世就没有这样的清净果报。同理，造恶业的业种也是由意根任持，意根心恶才能造作恶业，才能任持恶业的种子直至后世。所以意根具足一切烦恼心所法，也具足一切善心所法。</p><p>原文：<strong>二名转识。谓依动心。能见境相。</strong></p><p>释：意根的第二个名字叫作转识，转是流转的意思，也是运转的意思，意根靠着无明力，能把法从阿赖耶识里流转出来运转出来，意根心一动，阿赖耶识就会随之出生境界，意根就会见到境界相，心再动，六识就会出生造作业行，五阴的作用就会现行出来了，后世的生死就不断。境界和五阴都是随着意根心动而出现的，生死也是随着意根心动而出现的，所以说意根是转动一切法的开关，意根就是转识。</p><p>原文：<strong>三名现识。谓现一切。诸境界相。犹如明镜。现众色像。现识亦尔。如其五境。对至即现。无有前后。不由功力。</strong></p><p>释：意根的第三个名字叫作现识，这个现是呈现的意思，意根见一切法以后，就会呈现出一切法，一切法在意根心中就会呈现出影像。意根依着阿赖耶识，阿赖耶识变现什么境界，意根就能了别什么境界，心中就能呈现什么境界。犹如明镜一样显现出一切境界相。比如说五尘境界像，意根一触马上就会呈现出五尘境界像。在阿赖耶识出生境界的时候，意根几乎是同时没有前后次序地在心中把境界呈现出来，也不用刻意加工。</p><p>为什么说是五尘境界像，而不说是六尘境界像，或者是法尘境界像呢？这里的五尘实质上是包括了法尘的六尘，以五尘为代表，各自都有各自的法尘，这是省略说法。否则就说色尘和色尘上的法尘，声尘和声尘上是法尘，香尘和香尘上的法尘，味尘和味尘上的法尘，触尘和触尘上的法尘，这样非常繁琐，于是就简略说五尘。</p><p>通常来说意根触法尘生意识，可是五识是如何生起的呢？有的人就会说，五识是五根触五尘生起的。但是五根是色法，不是心法，不是识心，怎么能主动与五尘相触有识心的能动性呢？实质上五根触五尘，还是由意根作主促成的。意根主导五根触五尘生五识，同时触法尘生意识。既然意根是主导，那么五尘境界像，意根也会触，触之后就会呈现出完整的六尘像。作抉择之后，就会出生六识了别和处理六尘境界像。六识了别一些六尘境界，而不了别另外一些六尘境界，这就是意根所起的抉择和主导作用。</p><p>二、意根的五个名字含义（二）</p><p>原文：<strong>四名智识。谓分别染净。诸差别法。</strong></p><p>释：意根第四个名字叫作智识，能够分别一切善恶是非等等染污和清净的法，能够分清一切法的差别相。起信论里说意根是智识，是绝对正确的，一个作主识代表着众生的根本，决定着众生的一切，如果五阴身的作主识没有如此的智慧，那么五阴就没有智慧，世间就没有有智慧的人了。如果说意根慧劣，那是不完全正确的说法，在具体分别过于具体微细的法尘的时候，意根确实不如意识，所以才用得到意识，一旦意根有能力分别细微的法尘的时候，意识和五识就没有用了，意根自己直接就代替了六识的功能作用，舍识用根，也就没有那么多麻烦事，没有那么多遮障了，大神通就显现出来了。</p><p>原文：<strong>五名相续识。谓恒作意。相应不断。任持过去。善恶等业。令无失坏。成熟现未。苦乐等报。使无违越。已曾经事。忽然忆念。未曾经事。妄生分别。</strong></p><p>释：意根的第五个名字叫作相续识，意根之所以叫作相续识，是因为意根的五遍行心所法永远相续不断的运行着，阿赖耶识就会随着意根不断地产生一切法，运作一切法，五阴世间就会相续不断地出现，此世灭，后世生，生生不已。这样一切善恶、染污、清净法都会随着意根不断地呈现出来，善恶业就不断绝，善恶果报就不会失坏，并且意根能够成熟现在和未来的苦乐等果报，不违背因果轨则。意根生生世世无始劫以来所经历的事，在有因缘的情况下就会忽然的忆念出来，还没有经历的事情也会虚妄地加以分别。</p><p>马鸣菩萨说意根能够任持善恶业，不让业种丢失和毁坏，并且能够成熟业果报。这个含义是非常深的，意义也非常重大。六识造作的身口意行，一是作为种子存入阿赖耶识中，由阿赖耶识执持含藏；二是由意根任持，带到未来世。什么是任持呢？任持就是担负、背负的意思，对业行负责任的意思。</p><p>为什么业行要有意根来背负和负责任呢？因为意根是作主识，是五阴身的主宰，是一切业行的主宰和始作俑者，六识只是起着助手配合的作用，不是主宰。而阿赖耶识更不是业行的主宰，不作主造业，所以造业之后，一切业行都由意根负责任，背负业果。六识想背负业行也背负不了，一是不作主，二是命终灭坏，无法把业种带到后世。既然一切法都是意根作主造作出来的，业行的善恶就体现了意根的善恶，意根的善恶心所法全部具足，与业行业种相应，并且把善恶心所法都延续到后世。所以修行就是修意根，熏染意根，改变意根。</p><p>意根还能成熟善恶苦乐业报，与因果相应。有人会问：业报不是由阿赖耶识成熟的吗？阿赖耶识只是能现行成熟的业种，实现业报，却不会成熟业报和业种，当业缘具足业种成熟时，阿赖耶识才能把成熟的业种现行出来，业报才会出现。成熟业种和业报不是阿赖耶识的事，而是意根的事。意根有业随身，当外缘现前的时候，业报就会出现。</p><p>起信论这里说意根有忆念作用，这个说法是极其正确的，因为意根也是心，而且是极其重要的心，起着极其重要的作用，一切法意根都经历过，既然经历过，当然就会忆念起来，并且会促使意识依此忆念回忆过往。因此说意根有念心所，会忆念惦念一切法。一切法只有主人才会惦念着、忆念着，想要处理的时候，才会召唤助手去具体处理，助手不常出现，必须是主人需要的时候才能出现，主人不需要就不会现前。</p><p>意根的五个名字的内涵法义很深奥，信息量很大，颠覆了极多人对意根旧有的不合理的认知，也颠覆了古今各唯识论师的认知。毕竟意根之法义属于唯识种智范畴，没有唯识证量的人是无法现量观察意根的，误会是难免的。历史上被世尊认证和资料记载的初地菩萨，第一个是龙树菩萨，其次是无著菩萨，再其次是马鸣菩萨，据说阿难也入了初地，只是没有传唯识的法，禅宗当中入初地却没有传唯识法的祖师可能还有其人，只是初入地时，唯识种智不深，对唯识的观察力不强，所以还不能传唯识法。</p><p>除此之外，其他人传唯识法的，没有资料证明有初地菩萨的证量，所以所著的唯识论著都有瑕疵和纰漏，法义不是完全正确的，只能作以参考，不能全部信受。唯识论著中，马鸣菩萨著作的大乘起信论的证量是非常高的，能如实观察到意根的心所法，其译者实叉难陀菩萨证量也很高，翻译精确如理如实，这是一部值得信赖的唯识论著。</p><p>三、意根是现识的含义</p><p>现识是现量识的意思，是现量的见法，现量的识别法的意思，或者是现量的呈现法的意思。意根虽然也如如来藏一般有如镜现像的功能，有像镜子一样显现法像的功能作用，但是如来藏所现的像是自己出生的像，意根所现的像，是呈现的如来藏所变现的像，意根不会变像。如来藏这个镜子和像之间的关系是生与被生的关系，能生者一定是不生不灭的法才行，被生者却是生灭变异的，而意根与像之间不是生与被生的关系，同样都是被生的法。并且意根所呈现出来的像与如来藏所现的像有本质的区别，如来藏现的是本质境，是如来藏最原始所变造出来的法，意根所现的像是带质境，是如来藏对于法的二次变现，已经不真实了。</p><p>为什么说意根是现量识呢？因为意根见法是见的现前存在的法，见的是如实的法，没有比量和非量见法的功能，如来藏幻化出法的第一刹那意根就能见得到，这是带质境，接近于本质境，比较真实可靠。意根见带质境以后，如果想要进一步详细的了别，才把法传递给六识见，那么六识所见的就不是比较真实的带质境了，见的是已经经过变异了的法，其显现出来的法离本质境和真实境又隔了一层，比意根所见的法更虚幻了。况且意识见法还有比量和非量，其所显现出来的法更加的不真实。</p><p>如果比照现识的内涵，如来藏见法更是现量的见，比意根见的更加的真实可靠。如来藏不管见什么法都是自己现前所出生和执持的法，与法没有一丝的隔碍，生什么法就见什么法，执持什么法就见什么法，不生则不见，不执持则不见，更没有比量和非量见法的情况发生。对于如来藏来说，根本没有过去的法，也没有未来的法，都是当下的法，即使是无量劫以前的法也是当下的法。但对于六识来说就不是当下的法了，其实六识是见不到当下的法的，不管见什么法都是已经变异了的法，都是过去的法。</p><p>四、什么是业力？</p><p>业力也叫作业行的习惯势力，分为善业力、恶业力和不善不恶业力。比如一辆车开足马力开往前方危险之地，车速很快，司机意识到了前路危险，觉得应该减速刹车掉头改方向，可是因为两种原因车速不减，根本不能刹车和调转方向。一个原因是司机虽然是意识到了，但没有行动力，或者是心智不清，手忙脚乱，行动力弱；另一个原因是车本身的惯性作用太大，或者是刹车失灵。这两个原因致使车还是朝着危险之地快速前进。</p><p>虽然很多事情意识到了，不一定能做得到。意识到了就是意识知道了，但是意识知道却做不到，因为意根没有抉择。如何才能做得到？众生五蕴这辆车以无始劫以来的巨大的恶业力，惯性地驶向三恶道，开车的司机或者是车主是谁？当然是作主识意根。要想脱离去向三恶道的轨道，调转方向奔向三善道，奔向佛国净土，五蕴车的司机或者是车主是极其关键的。意根为什么要把车开向三恶道？有人说开车的是意识，那么意识灭了的时候，五蕴车是开着还是熄火了？意识喝醉了，车怎么处理？意识只能当个副驾驶，当个导航，指引和督促司机把握好方向盘。</p><p>众生趣向三恶道，是因为有三缚结，缚着五蕴车行驶在三恶道途中，实际上是意根司机的三缚结，让意根开车在三恶道途中。所以所谓的业力，主要是指意根之业力，意根断除我见，断除三缚结，就会调转方向，把车开到善道上来。</p><p>在面对六尘境界的时候，业力就出现了。比如在财色面前，不同众生的意根有不同的业力，有不同的对待财色的惯性力量。恶业的力量大，就会贪取财色，善业的力量大，就会弃财色于不顾，甚至是布施财色，不善不恶者则随缘取中道。众生业力现前的时候，一切劝导如耳旁风，不入耳，听不到。如果善业力量大，身处逆境不受染污，不同流合污，仍然保持一颗洁净的心。处污泥不染者，名为菩萨。如果意根不改其恶业的力量，烦恼不降伏，想要断我见断三缚结，脱离三恶道，那是决然不可能的。四正勤断恶修善，是必须要修好的，恶不断，善不具，三恶道不免。</p><p>五、什么是触</p><p>触就是接触和碰触、碰到的意思，分为有心触和无心触。无心触就是物体的触碰，有心触就是识心的触，是触心所法。只有触了，才有后续的了别，见面互相认识，不见面就无法认识和了解。意根触法尘是有心触，意识出生以后，三者再和合起来触，就是三者都互相触，如果不触了，就没有意识了，也没有后续的了别。这时意根既触法尘，也触意识，意识既触法尘也触意根，所以意识既了别法尘也知意根的心思，意根既粗略了别法尘也知意识的心思。法尘同时被意根和意识触，也被意根和意识同时了别。意根又通过意识的了别再了别法尘，就对法尘有了清晰的知。</p><p>但是六识的触，却分为有意的触和无意的触，有意的触是先有作意，作意就是有心有意，然后再触所作意的法；无意的触，是先触法后作意，这是无心无意的触，是由意根完全作主宰之后的触，一般是突然间的触，没有准备的触。</p><p>六、意根的平等性智</p><p>第七识在极喜初心地有平等性智，意思是说在入到极喜地的初地心中，第七识转识成智，具有了一分平等性智。第七识经过修行菩萨六度，明心开悟以后具有了般若智慧，般若智慧增长具有了后得智，通过修道发起了初禅，断除烦恼，依次过阳炎关和如梦关，证得有余涅槃以后，熏修唯识，具有一分唯识种智，进入初地，第六识初次转识成智，具有初分妙观察智，第七识初次转识成智，具有初分平等性智。两个识在成佛时要经过三次转识成智，无明染污断尽，全变成明，第八识和五识才分别变成大圆镜智和成所作智，圆满佛道。</p><p>初地菩萨断除了异生性，入如来家，成为真佛子，这是在学佛修道中极大的转变，标志性极强，内心极喜，因此称为极喜地。第七识的平等性智，是在明心之后的三贤位修道过程中转变出来的，是成功转依第八识的标志，第七识证得第八识的平等性，经常观察一切众生虽然果报不同，其呈现果报之因第八识却是平等的，因此相也是平等的，这样就破除了人相、我相、众生相和寿者相，如实证得一切众生实质上都是平等的，最终都会成佛，第七识心也渐具平等性，断除烦恼转识成智以后就入初地。</p><p>所以在最初明心的时候，一定是第七识和第六识都同时明心，才能具有般若智慧，才能都破除四相，才能都断除烦恼，才能过禅宗三关，才能都证得阳炎关和如梦关，才能都断除异生性，才能都证得初地菩萨的一分唯识种智，才能都证得一切法的真如性，才能都证得一分一真法界，才能都最终成佛。</p><p>阿罗汉的第七识没有平等性智，因为阿罗汉没有明心开悟，不具备般若智和唯识智。但也有一些平等性，其平等性立足点与初地菩萨不同，阿罗汉看一切众生都是空的和无我的，心中断除了一切烦恼，破除了四相，从这个空的角度，第七识见一切众生都是平等的，但不能见一切法平等，不知道一切法都是第八识性，都是真如性，都是一真法界，因此就没有平等性智。</p><p>从阿罗汉全部的修道过程来看，初果到四果的法眼净智慧，都是第七识和第六识同时证得的，否则就不能断除烦恼，入有余和无余涅槃，也不能破除四相。如果第七识意根不能断我见，就不能断除无明烦恼，生死不能了，三界尘劳不可出，轮回不能止，苦就不能断，修道就无意义。</p><p>七、意根内执阿赖耶识为我是什么意思</p><p>这个意思是说意根执着阿赖耶识的功能作用为我的功能作用，而不知道这是阿赖耶识的功能作用，随同阿赖耶识所见的法，认为这些法都是我和我所有的，不知道是阿赖耶识出生的，归阿赖耶识所有，本质都是阿赖耶识性。因此意根就爱着阿赖耶识的功能作用，喜欢阿赖耶识的功能作用，乐着阿赖耶识的功能作用，执著阿赖耶识的功能作用。意根因为有这些执著和贪爱，而被系缚，不得解脱，遂有生死不能舍离。意根根本不知阿赖耶识为何法，所以并非执著阿赖耶识，而是误以为阿赖耶识产生的所有功能作用都是自己的功能，所有法都归自己所有，从而产生了执著。</p><p>阿赖耶识的功能作用都有什么？无非是五蕴十八界运作的功能作用，无非是一切世俗法的功能作用，意根就把这些功能作用都当作是我和我所，这个误会一直到证得阿赖耶识以后才开始慢慢解除。当意根证得阿赖耶识的时候，就会随同意识一起观察出，五蕴十八界的功能作用都是阿赖耶识出生的，是阿赖耶识的功能作用，不是意根我的功能作用，于是慢慢断除了我执。再相续证得其他一切法都是阿赖耶识的功能作用，并不是意根我的功能作用，于是就逐渐断除了法执，无明逐渐断尽，成无上涅槃，得大解脱。</p><p>畜生们都有我执法执，哪个能知有阿赖耶识？只是把阿赖耶识产生的那些功能作用，出生的那些法，当作是自己的罢了。意根执著的只是阿赖耶识出生的那些法，岂是执著阿赖耶识？学法不是拆解文字，不能在字面上绕来绕去，要深入观行其甚深义究竟义。多数人学法都是很浮浅的意识思惟，从来不修定深入思考观行，所以那么多人修学小乘苦空无常无我，最后却得出五蕴非第八识不异第八识这样的结论，逻辑都不通，哪有凡夫具有五蕴是第八识这样的观念？有这个观念的人就不是凡夫了，根本就不用再观行断我见和实证第八识了。</p><p>八、意根执第八识见分为我是什么意思</p><p>第八识能见一切法，意根随着第八识也能见一切法，但意根和第八识所见的一切法的相是不同的，所见内容有差别，第八识见的是非世俗相，意根见的却是世俗法相。意根依着第八识的见分，见了一切法之后，就认为这一切法都是我，都是我所有的，这就是我见，包括人我见和法我见。</p><p>因为有这样的我见，意根就执取这一切法，不肯舍离，普遍计度执着，所以意根又是遍计所执识。众生都是先有我见，后有我执。意根因为无明不懂得一切法都是第八识所生，都是归第八识所有，都有第八识的属性，依靠着第八识见一切法之后，就误会为一切法都是自己的，归自己所有。这个误会从无始劫以前一直延续到如今，如果不通过观行把这个误会消除，我见就不能断除，生死苦就不能灭，轮回就不止。</p><p>九、意根与五蕴的关系</p><p>意根既独立于五蕴，也不独立于五蕴，既与五蕴和合，也不与五蕴和合，既能脱离五蕴，也不脱离五蕴。为什么如此？意根不独立于五蕴，是因为意根所有的思，所有的想法和意愿，都必须通过五蕴来实现和完成，所以意根把五蕴当作我；而五蕴的运作，又增强和启发了意根的思，使得五蕴围绕着意根团团转，意根又围绕着五蕴团团转，互相纠结在一起，不可分离。</p><p>意根完全能独立于五蕴是因为：（一）在最初世界未建立之前，没有五蕴，只有第八识和意根存在；（二）在正死位，五蕴灭去，只有第八识和意根存在；（三）在受精卵位，五蕴没有生起来的时候，只有第八识和意根存在；（四）在灭尽定中，五蕴中只有微弱的色蕴存在，六识的受想行识蕴都不存在，第八识和意根存在；（五）在昏迷的时候，和其他时期，五蕴中只有微弱的色蕴和识蕴存在，而第八识和意根不受影响的存在着；（六）阿罗汉刚刚出无余涅槃的时候，只有第八识和意根存在，五蕴还没有出现。所以意根能完全独立于五蕴，但不能独立于第八识。（七）即使在五蕴存在的情况下，意根也完全可以有自己单独的心行，这些心行不因五蕴而有。</p><p>在五蕴不断的运行过程中，意根与五蕴也有独立的层面。意根把五蕴当作祂自己，或者把五蕴当作是祂自己的所有物，当作实现自己想法和意愿的工具，就含有独立于五蕴的意思了。五蕴有第八识的属性，因为是第八识用七大种子变化出来的，到处都显示第八识的信息，其实五蕴全体都是第八识。但如果说五蕴有意根的属性，是因为五蕴合于意根的习气，是意根无明的结果。</p></div>"
},{
    "title": "第二章 意根与意识的关系",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  意根与意识的关系</strong> </p><p>一、意根是意识的俱有依</p><p>俱有依，俱是两个法多个法都在一起的意思，俱有是与生俱来就在一起了，出生时就在一起了，依是依赖，有此就有彼，此法依赖彼法才能出生和存在。</p><p>有人说五根是意识的俱有依，那就是说五根就是意识出生的必要条件，没有五根，就没有意识，有意识一定要有五根。可事实是这样吗？从众生的形态来说，很多众生并没有五根，可是仍然有意识。比如无色界天人，比如显现无身的菩萨和大阿罗汉们等等，他们都有意识，却没有五根。所有众生的独头意识，并不依赖五根出生和存在，在甚深禅定中意识出于身体之外，仍然能了别尘境，不需要五根。所以五根不是意识的俱有依，意识的俱有依是第八识、意根和种子。</p><p>意识出生所需要的缘非常少，所以容易出生，也容易灭去。五识在二禅以上定中就全部灭去不存在了，意识只在无想定和灭尽定中才能灭去。因此说意识的俱有依不是五根，也不是五识，而是意根。意根是意识能够出生的根，意识依靠意根才能出生和运行，意根作意和抉择之后，意识才可以出生，否则就不能出生，所以意识一直都与意根相伴，为意根服务，并且调控和熏染意根，但意根并不一定陪伴意识，不一定与意识俱，意根单独存在的时候有很多，睡眠就是这样。</p><p>二、意根与意识的四种关系</p><p>人的心理问题，一般都是意根的问题，意根长期得不到理解和宣泄，被压制时间长了，就出现心理问题，现出了一些心理病症。对意根心理问题的疏导，一是依靠懂心理的其他人，二是依靠自己的意识，意识明了意根的心理状态，并有解决问题的方法，有解决问题的能力和智慧，就能循序渐进的疏导意根的心理情绪，让意根心开意解，消除抑郁，压抑情绪得到疏导。</p><p>一般来说，意根与意识的关系大约有四种，意识与意根和合一致分两种情况，意识与意根不和合一致也分两种情况。</p><p>第一种情况，意根善，意识也善，二者和合一致善，意识不违逆意根，而且能增益意根的善，结果就是毫无犹豫的善，痛痛快快的善，从里到外的善，不存在心理问题，做了善事以后心理更畅快，这是大善，能得大善果报，善业种子成熟的快，受善报也快。</p><p>第二种情况，意根恶，意识也恶，二者和合一致的恶，意识丝毫不违背意根，而且还会增益意根的恶，二者就会和合一起痛痛快快的恶，没有犹疑，造作恶业以后更觉畅快，心理舒服，不觉羞愧和惭愧，没有心理问题，但这是大恶，恶业种子成熟的快，受恶报也快。</p><p>第三情况意根恶，而意识善，意识一心向善的时候，意根就不舒服，不愿意善，但迫于环境压力不得不善，意根心理就会出现问题，过后也许会后悔，这个心理问题有时候能解决，有时候就解决不了，这属于真恶假善，本质是恶。如果意根恶的力量大于环境的力量，意识善比较弱，没有影响到意根，熏染不成功，就会造作恶业，这是真恶。但不一定总是如此，如果意识受良好环境熏染，越来越善，感染了意根，战胜了意根的恶，以后就有可能造作善业，不再作恶。</p><p>第四种情况，意根善，而意识受环境影响有恶心，意根受环境逼迫不得不恶时，心理就会有阴影有压抑有悔恨，这个心理问题有时候能忏悔弥补，有时候弥补不了，意根心理的结就结下了，这属于真善假恶，本质不坏。如果意根善的力量比较大，意识恶的力量小，战胜不了恶，熏染不了恶，最终还是意根的善作主造作了善业。但不代表总是如此，如果恶的环境持续，意识恶的力量增强，意根也可能要顺从意识的恶而决定造恶业，意根就被恶熏成功了。</p><p>三、为什么染污的意根只能出生染污的前六识？</p><p>因为前六识是依意根的抉择（思心所）而现起的，是意根所需的，意根需要什么，六识就出生做什么。那么意根染污，六识就会随之造作染污的业行，意根清净，六识就会随之造作清净的业行。根据十二因缘所显明的众生流转生死的根本因，是因为意根有无明，就以无明为缘产生了意根无明的行，以意根无明的行为缘就产生了六识无明的身口意行，身口意行都会落谢在阿赖耶识里成为种子。</p><p>意根的行也就是意根的抉择行为，意根抉择之后就会有六识出生辅助意根造作，所以如果意根染污有无明，作为助手的六识就要辅助意根造作染污业行。如果意根虽然有染污，在不抉择染污行的时候，意识可以依靠自身的清净熏染意根，意根也许可意识的清净行，那么就会产生清净的业行。所以修行就是要熏习善法，并且以此善法熏染意根，从而破除意根的无明，改变意根，心就清净了，将来就会有清净的果德可受用。</p><p>四、修行就是打扫心地</p><p>独影境的显现是因为意根攀缘法尘、作意法尘之后起了念，如来藏就生出独头意识以完成意根的指令，实现意根的念想。意根作意在什么法上，独头意识就在什么法上出生，之后按照意根的旨意运行。意识念起以后才有知，知法是什么，这个法是一个类似信息的法尘，和五尘没关系，也许是一个思想观念，也许是一个忆想，也许是对未来的憧憬，也许是对问题的思惟分析判断。意根要回忆，意识就忆念从前的人事，意根要知道某句话的含义，意识就思惟分析某句话，意根要考虑第二天的行程，意识就思惟第二天的行程安排。</p><p>独头意识起念，是由意根牵引的，随意根的念头和想法而生灭和动转。比如意根想到一个人，第八识立即现起这个人相关的法，意根触、思之后，作出抉择想考虑考虑，于是独头意识出现，作意于这个人相关的法，触受想思，于是意根知道以后就会有个决定，之后独头意识可能会继续深入运行，或者在这个法上消失，而在其他意根所攀缘的法上出现。</p><p>由意根的种种攀缘生出独头意识的杂念，念头刚升起那一刻并没有境显现，第一刻知念起，然后才有境像，念起和显境是有一个过程的。境界原来就在那里，但没有意识就不能知，意识出现时，第一第二刹那了别不完全、不清楚，第三第四刹那了别让法较为清晰地显现出来，才能得出一个结论，有个法的轮廓出来，再往后才有思惟分析，才把法搞清楚。</p><p>心里的杂念大部分都是从前经历过的，叫作曾习境。可见意根对法经常是有意无意的执取，惯性力量强，心不空，放不下经历的一切人事物理，把这些法都放在心里盘旋着不肯舍弃，就像垃圾一样堆满心间，污秽肮脏，却从来不知道清理打扫。修行就是要经常的清理打扫心间里的卫生，大扫除大清理，保持心地的洁净，心室才能光明洁净。打扫卫生由意识引领和督促，意根同意，还是由意识打扫，出谋划策和办事执行都是意识，意根只管点头下令拍板就行。</p><p>五、身口意行是意识造作的还是意根造作的</p><p>身口意行都是意识造作的，是受意根的无明驱使造作的，意根如果没有无明，就不会促使意识造作无明染污业。这就是十二因缘中所讲的：意根的无明，促使意根思心所产生，有了想造作身口意行的抉择，意根抉择之后意识五识出生，造作符合意根心行和抉择的身口意行。其中意根是主导，意识只不过听从意根调控而已。比如五岁孩子出门打酱油，是大人指使的，大人在家里作主管理柴米油盐，不够用了就让孩子出去买；比如职员的工作是由领导安排和分配的，职员必须听从领导的管理；比如社会各行各业的开展，是由国家上层领导核心部署的，下层各单位要根据上层领导部门的部署开展工作，不得违抗命令。</p><p>众生身口意行表面看都是意识五识造作出来的，实质是体现了意根的意旨和主张，体现的是意根的习气和习惯。一主一仆和合运作，五阴身才协调，如果不能和合运作，有可能会导致意根精神分裂和崩溃，导致精神病。当然有时候意根对某些法不懂的时候，就没有了主意和主张，就会听从意识的意见和看法，甚至有时候都是盲目地听从，也不太懂意识所主张的究竟如何，这时候就显示出意识的强大了，如果意根有智慧，意识就不能比意根强大，永远是意根自己作主拿主意。</p><p>六、意根与六识的身口意行的关系</p><p>问：既然意根主导了人的身口意行，那么在身行和口行上六识具体体现在哪些作用上？</p><p>答：意识是身行和口行的具体执行者，就是造作者，从身行和口行上就应该知道意识是如何运行的，起了什么作用。比如行住坐卧、言谈语笑、吃饭喝水等等都是意识和身识运作出来的，但操控者是意根，表面看好像是意识在指挥，但意识只是给意根提供建议，具体决定却在于意根。在运行过程中，意识可能会生出其他想法，给意根参谋，意根如果觉得合理就会采纳，如果不同意，抉择和命令就不变，意识就得照常运行。</p><p>身行是意识与身识的和合运作，口行也是意识与身识的和合运作，见色是意识与眼识的和合运作，闻声是意识与耳识的和合运作，嗅香是意识与鼻识的和合运作，尝味是意识与舌识的和合运作，觉触是意识与身识的和合运作。六根的运行当中都有意识的运作，没有意识，五阴身就不能动，意识弱，五阴身也很难动得起来。</p><p>众生在定力不足，观行智慧也不足的时候，只能看到六识在身口意行中的运作，看不到意根的主导和抉择作用，更看不到第八识所起的根本作用，因为意根和第八识的运行行相太微细了，一般人因为善根福德不足，很难观察得到。因为观察不到，有人就说一切法都是六识的功能作用，没有什么意根和第八识，这就是六识论无智慧的说法。</p><p>七、意识对意根来说有什么用</p><p>意识五识和五阴，都是意根所必须使用的工具，没有这些工具，意根自己在世间里就无能为力，祂就需要六识和五阴来为自己服务，利用六识和五阴在世间里贪取一切法，没有六识和五阴意根就束手无策。</p><p>所以意根能知很多法，但必须要意识去处理这些法，比如说身边有鬼神出现，意根觉得挺可怕的，怕威胁到自己，但自己没法对付鬼神，也不能单独躲开，于是就一边汗毛直竖，一边警觉意识知道这件事，意识就奇怪：到底是怎么回事，我怎么感觉害怕呢？感觉周围阴森森的有什么事呢？意识聪明的时候想一想，就可能知道了周围有鬼神，于是就想办法躲开，这样意根就达到目的了。</p><p>所以意根虽然有知，事情却需要意识和五阴去办理，意根证法以后，身口意的清净行需要意识五阴去行持，那么六识清净的身口意行就体现了意根的清净。但修到相当高的层次以后，四禅八定修持出来了，具足无量神通道力，意根可以代替六识了，这时候就可以不用六识出来，一切事都由意根自己承办，非常快捷方便。所以意识的功能、地位与意根无法比，二者之间永远是主仆关系，主人就是要用仆人打理琐事，主人能力大的时候，全部是现代化的程序，就可以不用仆人，自己都能处理得好处理得妙。</p><p>八、意根和意识二者为什么能互相传达心意</p><p>比如意根想吃饭，如来藏顺从意根之意，出生意识，意根就传达给意识了别眼前的各种各样的菜，在这些菜当中选择自己喜欢吃的，意识能领会意根的心思，意识了别之后，意根也能领会意识的心思，二者能刹那互相沟通。但是意根了别前世的法传达给意识，意识却领会不了，或者只明了一点点，这是为什么？因为对于前世意识没有经历过，也就没有记忆，不能加以了别。</p><p>意根决定了别各种菜，以确定吃哪个菜，意识就出生来替意根了别，意识把各种菜的特色都作以了别判断之后，传达给意根，意根知会了就会决定吃什么。也有可能意识仅凭和眼识一起观察还不能了别全面，于是意根决定吃点品尝品尝，于是舌识和鼻识一起参与了别判断，意根知会以后，就知道哪个好吃，是自己喜欢的，于是大吃起来，对于不好吃的就不理会。</p><p>这些菜意识和五识一起可以现前触得到，所以就有受想思，能作以判断。对于前世的法，没有神通时五识根本触不到，意识没有心通，也没有经验，智慧不足，就了知不了意根心中所思所想。如果意识有大智慧，就能清楚了别意根心中所思所想所暗示的法。</p><p>意识与意根为什么能互相传达心意呢？因为意根与法尘相触，生出意识，三者再和合触，对于法尘，不仅意根能了别，意识也能了别，只是在于了别程度如何，是否清晰。而在这过程当中，意识与意根也一直相触着，心与心相触，当然互相就能了知心意，差别在于了知的程度如何，有深度和范围的区别。只要意识存在，一定是与意根相触的，所以各自的心意随时随地能得到传递和交流。如果交流的不好，心理就会闹别扭，交流通畅了，心情就愉快。这与两个人的交往关系有些类似。</p><p>九、意识应该如何引导意根？</p><p>意识与意根所缘的法是相同，意识了别的一定是意根所攀缘的法，否则就不用出生意识。意识出生就是为意根服务的，就是要服从意根，但意识出生了别了法以后，通过思惟分析，就有了自己的见解，可能会忤逆意根，不符合意根的心意。如果意识有正知见，就可以慢慢扭转意根，还要看意根能接受到什么程度，如果意识太激进，就可能惹火意根，那就不能让意根上道了。</p><p>所以如果意识聪明伶俐，就会善巧引导意根，如果意识愚笨，就不会有效果，也许会适得其反，也许会被意根牵着走。学佛人的意识应该对意根抱着这样的态度：你领我乱跑，我不跟随，你领我贪嗔痴，我不跟随，慢慢的意根没办法，也就不领路了，反过来被意识领。</p><p>要想让意根有定，意识就要少缘法，少了别法，少念法，或者是不缘法，不了别法，不念法，这样的话意根得不到意识的回馈，知道再念着法也没有用，也就不动心思了，这样意根就渐渐的定下来了。</p><p>十、意根不与语言文字相应是什么意思？</p><p>意根不与文字语言相应的意思是，意根不能用文字语言来表达自己的思想、观念和见解。但意根并不是不懂得文字语言，祂既然是总揽全局的作主识，就有权利指挥调动六识，虽然不能说话，不能用文字表达，却可以让意识说话，让意识用文字表达，很多做不了的事都可以动用六识协助完成。比如总统精力有限，分身乏术，只能掌管国家整体大局，不能搞市场调研、统计分析等等具体工作，但他可以任命属下去完成这些工作。意根因为要总揽全局，具体事情无法亲自操办，只能用五俱意识、独头意识来处理具体琐碎事务，意根听取报告就可以了。在听取报告过程中，用思心所、慧心所和胜解心所作以判断和抉择，然后再发布命令，让六识按照指令解决问题。</p><p>意根犹如喑哑人，虽然不会说话，但可以听得懂人说话。第八识也是，虽然不能说话，不通于语言文字，但祂有独特的了别方式，了别的是独特信息，不同于七识，意根也不同于意识。意根的思不比意识的思差，如果总统腾出时间精力，专门搞市场调研，也许做得比下属都好，只是没时间精力而已。意根如果要代替六识，有可能胜于六识，只是现在精力不够用而已。所以才要修定、修定、再修定，就是要给意根腾出时间精力，专注、专注再专注，这样意根的大智慧才能涌现出来。</p><p>把意根当作一个识，或者当作一个人，就能了解意根的体性和心所法了。意识五识就是替意根做事的，如果意根智慧足够，六识无论做什么事，意根都能一清二楚。如果意根智慧不足，胜解力也不强的话，就会有误会，或者理解不了六识的做法，不清楚六识所为。如果意识不会表达，或者表达不清楚，意根也就不能充分理解，不明了意识的心思。</p><p>十一、意根为什么不与语言文字和声音相应</p><p>语言、文字和声音，这些法的运作，离不开身根和身识，是身识与意识共同运作出来的，是五俱意识的功能作用。语言和声音的出现，最先由意根发意，想要表达自己的想法和思想，意根动念时，脑电波波动，意旨就由中枢神经系统传达到与身根相应的系统或者叫部位，就有风或者气流在丹田处发起，这股气流向上涌动，一路到达舌根处，声音流出现，于是形成语言和声音。</p><p>所以说话是需要气力的，气力不足，声音就微弱，或者发不了声音。语言声音是意识和身识共同和合运作出来的，需要身根配合，舌头这时候属于身根的一部分，不起触味尘的功能作用。文字方面，写字打字是意识与身识和合运作出来的，需要身根配合。独头意识可以有心里的声音，心里也可以出现文字相，独头意识反观的时候，可以知道自己的心声和文字相。</p><p>以上属于六识的口行和意行，还有身行。身行是意识与五识共同和合运作才能完成，需要有五根的配合，离开五根，就无法完成身行的运作。六识的身口意行的造作，是意根促成的，是意根意念的作用。意根好比一个指挥官，六识是命令的执行者。指挥官动意，脑电波传动，命令发布出去以后，全身神经系统就操作起来。</p><p>意根的意好像是一个信号或者是密码，意识能懂一部分或者是大部分，智慧不足是不能都懂的。六识执行命令，具体运作的时候，语言文字声音才出现，这是操作系统的功能作用。指挥系统只以密码代码的形式操作，不必有五根的配合，意根的意行就完成了。没有五根的配合，当然就不可能出现文字、语言和声音了。</p><p>独头意识离开色身的时候，没有五根的配合，同样是没有文字、语言和声音，说不了话，写不了字。心念也是类似代码、密码的东西，但意识自己完全懂。懂了以后，有五根的配合，就能表达出文字、语言和声音。意识如果懂意根的心念，同样能用文字语言和声音表达出来。所以文字、语言和声音，是心念的表达工具，意根无法这样表达，只能通过意识和五识来表达，有神通时除外。</p><p>第八识的密码、代码，当六七识转识成智以后，具有相当程度的道种智的时候，才能懂得，在这之前，六七识都无法破译，但能享用到第八识所给与的福利待遇，享用却也不知，还以为是自己努力得来的福利待遇，是自己天然应该拥有的。代码需要智慧破译，无智慧就会弄巧成拙。密码代码都是比喻，用来说明心念的形式的，并没有什么密码代码。</p><p>十二、意识烦恼的来源</p><p>意根是意识出生的俱有依，也是意识心地染污和清净的所依，意识是在意根和法尘相接触之后，意根抉择造作才产生出来的。意识的烦恼是由那里来的呢？一个来源处是由意根调控和熏染而来，另外一个来源处是由周遭的染污环境熏染而成。</p><p>意根是如何调控和熏染意识的呢？当意根接触六尘境界的时候了，大致能判断出尘境不可心，意根心里先起烦恼，并且想要对治尘境，于是意识出生，意识根据意根的指令，对当前的法尘了别，采取身口行动的时候就带着烦恼，身口就是染污的，这是意识受意根调控的结果。熏染的意思是，意根的烦恼每次出现的时候，都能熏染意识，意识渐渐受熏，就有了与意根相同的烦恼。比如说婴儿刚出生，意识没有烦恼，时间长了意根先天的烦恼就左右了意识的心行，意识越来越与意根烦恼一致，就是被意根所熏了。意识有觉悟的时候，才能减轻一些烦恼，并且能反过来控制意根的烦恼。</p><p>意识烦恼的第二个来源，就是尘境的熏染，常处同类人种种烦恼当中，日积月累地熏习，心里就出现了烦恼。意识的烦恼再反过来熏染意根，让意根也具有了同样的烦恼。断了烦恼以后的意根就不容易受熏，即使偶尔起烦恼，也是意识的临时烦恼，过后就会消除，不会长久持续下去。</p><p>十三、意识是如何想起以前的事情的</p><p>有时早上醒一小会儿了还不知道自己在哪里睡，一两分钟了还不知道是在自己的家里，这是意识断片了。意识大断片是新五阴出生以后，懵然无知，忘记了过去世的一切，没有神通就会忘记一辈子。小断片是昏迷醒过来以后，喝醉酒醒过来以后，睡觉醒过来以后，死亡后中阴身生起之时，只要意识没有连续现起，就会出现断片现象。</p><p>意识靠什么与从前连接起来？靠俱有依意根，当然还有第八识，这个先不说。意识最开始出现的时候，努力回忆过去，一切念头都是意根给祂的，在迷迷糊糊的时候，只能了别眼前的境界，不知道清醒过来之前的所有事。意根促使意识想、回忆，意识就回想，回想的内容也都是意根缘来的法，意识就不断的加以了别判断，然后就回忆出来了。其实意识所回想的那些法都是如来藏给呈现出来的。</p><p>十四、意根法理的作用</p><p>佛教里断我见的法理和意根的法理，对佛教和人类都有极大利益，心理学家和社会学家从中都能得到很大的受益，懂得意根或者说潜意识之理，他们就会自我反观，观察到自己的心理现象，从而了解自己，正确对待自己，甚至改变自己，虽然他们还不懂佛法。企业搞销售的人员也有受益，能知己知彼，从而掌控对方的心理，加以顺势引导，销售就会成功。各行各业都会受益于心理学，也就是潜意识意根的法理，成功学上所说的“自己跟自己对话”，就是意识熏染和引导意根，降伏自我。</p><p>心理障碍的问题全部是意根和意识的问题，精神分裂也是意根和意识的问题，当自己跟自己对话的时候，两个自己谈不下去，就分裂了，精神分裂的根本问题就是意根与意识的思想观念不统一，价值观不一致，意识不能说服意根顺应这个社会，有些时候意识也没有明白问题所在，就更不能有效的说服引导意根了，如果实在和这个社会格格不入，走到一个误区和死角出不来了，思想观念被束缚住打不开了，精神就分裂了。能够把五蕴的问题和意根意识搞清楚，实证万法全部是空的，任何人就不会有精神和心理方面的疾病。</p><p>十五、强迫症的唯识解析</p><p>强迫症这是六七识之间的冲突表现出来的症状，一个人的意根非常固执想要做某种事，但是意识却非常理智不愿意做，认为这么做不好。但是意识又不知道意根为什么要这么做，也就不能有效的说服劝导意根，只能强硬的拒绝实行，拒绝行动。</p><p>意根为什么有这样的念头，要做这样不合情理的事情呢？最合理的解释就是业障，有时候也叫作习惯势力，意根随顺于业力，受业力的控制和摆布。意识明理懂理，有理智，知道这个想法非常不好，于是就控制和反对意根的决定，不去执行意根的决定和命令，于是二者激烈冲突，强迫症就出现了。比如说一个孩子前世可能伤害过妈妈，今世由于业缘遇到一起，妈妈就会报复孩子。可是意识没有这样的想法，不愿意随顺业力，就会阻止意根的报复行为。业力与理智的对抗，爱孩子的情感与恨孩子的情感对抗，爱恨交织，发生冲突，内心极度纠结，就很痛苦，这是因为前世的业缘逼迫。</p><p>究竟谁会占上风，要看谁更强大，是意识的理智强大，还是意根的业力强大。要想让意识强大占上风，就要增长说服劝导的智慧，理明的透，思惟清晰，有理有据，有耐心，有方法，有善巧，就能慢慢引导意根放弃原来的想法。意识要细心耐心了解意根为什么有这样的想法，要劝导意根心量宽宏大度，要好好维护母子关系，多考虑孩子将来带给自己的无穷利益和乐趣，多思考孩子的苦，善待孩子就等于善待自己，思惟自己怀胎的辛苦和不易。</p><p>从意识与意根的关系中，我们发现意识意根都有各自不同的主张，为什么二者的思想观念能不一致呢？如果二者能完全一致，好不好？强迫，有意识强迫意根，也有意根强迫意识。强迫症一般都是谁强迫谁？都是意根强迫意识，而意识不从。如果二者能一起破除无明，直至破尽无明，究竟转识成智，六七识即完全统一，协调一致，配合完全默契，行动力强大。行动是六识的身口意行，行动力一个是来自于意识的力量，一个是来自于意根的力量。意识的力量可以传导给意根，意根的力量可以加持于意识，二者和合一致，行动力最大。</p><p>十六、意根能传达出前世什么信息</p><p>比如憨山大师见到苏东坡的遗物，当时感到特别亲切，特别熟悉。这是意根传达出来的信息，意识作以了别并且生出亲切的感觉。这种了别模模糊糊，无法确定什么，但是感觉却非常，是意根带给意识的感觉。如果意识有智慧能更进一步识别意根的心思，就会知道的更多、更细致准确的信息，那就不仅仅是觉得熟悉、亲切的感觉了，那样意根就有可能满足自己的心思，再有更进一步的想法和行动。</p><p>比如乙在背后总说甲的坏话，甲的意识不知道，意根却有感知，那么甲见到乙的时候，意根肯定传递信息，意识就会莫名其妙的感觉不舒服，不太喜欢乙。可是具体为什么不喜欢，意识弄不明白，意根明白却无法表达。如果意识有智慧，就会知道为什么，知道乙总是说自己的坏话，就有可能计划要采取什么行动报复，意根一旦也同意报复，那么甲乙两个人就有戏了。所以不要在背后议论人、评价人，更不要背后使坏下绊子，因为什么天机都能泄露，没有不透风的墙，与人结下恶缘，早晚都会受报，没有人能出因果之外，没有什么事不落后果。</p><p>意根还能传递给意识贪嗔痴一切烦恼，比如贪财物，见到财物就想据为己有，意识不太好意思也不太敢为，可是意根在背后怂恿和作主，意识就会小心翼翼地、偷偷摸摸地、暗暗地想办法把财物据为己有。如果意根正，也能传递给意识正直的心念，意根果敢，也能使得意识坚强，意根有智慧，也能使得意识所作如理如法，遇到染污境界而不受熏染。</p><p>十七、默念的原理</p><p>意根是作主识，身口意行都受意根调控和主导，心里默念经咒也是这样，意根想默念时，意识就不出声的在心里念诵了。出声念诵也是意识念的，是意根想要念诵，意识就念诵了。也有可能是意识想要念诵，意根觉得可以，意识才能念诵。总之念诵这件事就是意根决定，意识造作。</p><p>为什么意根抉择是出声念还是默念呢？这个抉择非常隐秘，难于观察，意识总是觉得这是自动的，自然的就如此，这样的感觉说明意识心很粗，也没有定力，观察不出来其中的细微处、隐秘处。意根有出声和不出声念诵的抉择，是根据身心状态来定，根据身体内是否气足来定。有禅定的时候，心运动起来就会觉得很累，出声消耗的能量大，意识感觉累，所以意根就自动的选择不出声。有定力和身体疲乏的时候，也会选择不出声在心里念诵。表面看好像是自动的，其实是因为意根依着第八识，非常快速和紧密的了知身心状态，能够非常迅速的作出有利于身心的抉择，很多人的意识并不知道这些事。</p><p>默念能增加定力，或者说定力增强以后，出声就念不动了，出声念感觉心累，于是就会自动默念。定力再增强以后，默念也累，于是就改为金刚持诵，只摆口型不出声，心里的声音也轻微。等到金刚持诵也觉得勉强的时候，就改为头脑的忆念，定力再增强的时候，忆念也不行了，就会入到深定中，没有任何念头和念想了。</p><p>十八、业障是由意识消除的还是由意根消除的？</p><p>业障就是无明的障碍，由无明力造作的恶业所感召的对自心的障碍，障碍自心不得善报，不得善果，也不得善业，善法不成，更障碍对一切法的智慧认知。无明最初在意根，根本在于意根的无明，意识的无明最初都由意根而来，由于受意根无明的影响和推动，导致意识也受环境的熏染。当意根无明断除之后，意识就不再受环境熏染，更没有意根的无明熏染，这样意识就清净了。意识的最终清净就是由于意根清净的结果，如果意根不清净，一定会推动和促使意识行不清净业，染污业种形成以后，就有后世的业障。所以一切业障都是由意根清净以后消除的，因为意根是始作俑者，解铃还须系铃人。</p><p>当意根的福德增加了，定力增强了，智慧也增大了，无明消除一部分，心性就会转变一部分，性障就会消除一部分，对善法、善业、善果、善报、善缘的遮障就去除一部分，学佛当中的遮障已经减轻一部分。意根的无明消除多少，心就清净多少，业障就减少多少，善业就会增加多少。</p><p>断我见证果和明心见性时，禅定和智慧大增，心性也同时得到根本的转变，心清净了，得法眼净，性障就消除了一部分，这样三恶道的业就随之消除了，预示着不用再去三恶道受苦报了，其余的业在人中受报就行了。众生每证得一种三昧，就会消除一部分的业障，包括小乘的二果、三果和四果，包括大乘的各个关口，也包括入地，一地二地三地。智慧增长了，思想观念改变了，心改变了，性障消除了，相应的业就会消除。忏悔也能消除宿世业障，因为内心意根认识到自己的无明愚痴烦恼，决心改正，心改变了，于是相应的业障消除，或者消除一部分。</p><p>业，分成定业和不定业，定业不可转，一定要受报才了；但是不定业可以转，不一定要受报才了，或者是通过忏悔消除一部分，再受报一部分。即使是定业，特殊情况也可以转。特殊情况是指众生的心力强大，智慧强大，禅定力强大，忏悔殷重，心性极大的扭转了，业也就转了。如果业全部都不能转，都必须受报才了，世间就无一人可成佛。因为众生业太多太重，根本无法受完报完。又如果业不能转，众生忏悔就没有用了，不能消业。</p><p>十九、意根与五识和内外五尘的关系</p><p>首先来说，五识的生起和动转是由意根而来，意根若不作意和抉择，五识则不出现，意根作意和抉择之后五识和意识同时出现，在意根作意和触之处了别六尘。因此说五识的出现不是由意识决定的，而是由意根决定的，意识只是五识出生的必要条件之一，二者和合才能共同了别完整的尘境，其出现次第几乎不分前后，五识的出生和运转不由意识决定。</p><p>既然意根能决定五识的出生，那么为什么意根能主宰五识呢？我们知道，五识的出生必然是五根与五尘相触促成的，而五根与五尘相触是意根促成的结果。五根与五尘都是色法，不是识，不会主动互相触，再决定生五识，导致五根与五尘相触并且生五识的是意根。</p><p>意根为什么能导致五根触五尘呢？因为意根攀缘了六尘，想要仔细了别六尘。意根不是只攀缘法尘触法尘，而是攀缘整个尘境，完整的包括五尘的尘境，如果只攀缘法尘，不缘五尘，对于尘境的信息就不完整，就无法作抉择和选择，六识就不会出生。比如面前有五颜六色的鲜花，法尘和五尘和合起来是完整的鲜花样貌，如果意根不缘五尘，就不知道鲜花的色彩，那祂要如何决定触红花或者是蓝花、紫花？如何选择花？六识之所以有所选择地了别尘境，就是因为意根对尘境的抉择，其中一定少不了五尘境，五尘在六尘中所占比重是挺大挺重要的，而且还会先显现出来，容易识别，所以意根不会把六尘分开来缘，然后作抉择。</p><p>比如意根攀缘人相，不会只缘人的法尘相而剔除人的肤色和衣服的色彩相，而恰恰在最初是色彩最突出最吸引人，其次才是细的法尘相，对于其他尘境也是如此，所以意根是缘五尘的。在六尘进入胜义根之前的五尘境，意根当然也是能缘能作抉择的。比如在车祸发生之前，意根缘对面的车，知道马上要相撞了，于是紧急抉择躲避，如果意根只缘车的法尘，不缘车的五尘境，如何能知对面有车并且要相撞？如何能决定避开对面的车？在巨大的爆炸发生之前，意根如果不缘爆炸声音的五尘境，如何决定立即逃跑？</p><p>意根作了任何一个抉择之后，五识马上与意识生起去完成意根的指令，说明五识的出生是由意根决定的，是与意识一起听命于意根的。五识与意识在哪个尘境上了别，了别多长时间，重点了别哪些内容，都由意根指挥作主导。总而言之，意根是作主识，对五根、五尘和五识都能作主作决定，祂们之间是主动与被动的关系，是主导与服从的关系。</p><p>二十、意根的思想情绪是由六识表现出来的</p><p>现在社会上不少人有抑郁的心理状态，连中学生都出现了抑郁症，这个问题大部分属于业力问题，少部分属于个人的因缘问题。抑郁的主要症状是内心封闭，与人没有交流，不善表达内心的想法，心情沉闷不开朗，对于这样的心理状态，意识往往是莫名其妙的，不知道自己为什么心情沉闷，这是意根心境不通畅导致的。</p><p>因为意根有思想情绪发泄不出去，没有人理解自己的想法观念等等，甚至不知道如何找人述说和求助，因此就没有人能给予疏导。同时又和自己的意识沟通不了，意识不理解，就解决不了问题，意根才出现了抑郁。很多人根本原因是业力问题，就是意根过去世所经历的事件，造作的业行所应该得到的果报。</p><p>而个人的因缘问题就是，心里有意愿实现不了就会抑郁，环境不能满足自己的心理需求，就会抑郁。抑郁的人有个普遍的特征，就是想的多，做的少，导致想法不能实现，心理不能得到满足，想法积压太多，就形成了负累，抑郁就出现了。抑郁也叫作郁郁不得志，有种种欲望，却无法满足，导致心情低落和压抑沉闷。</p><p>有的人内心里会出现六神无主、不想活的想法，这也是意根的情绪主导出来的，意识表现的正是意根的心行。六神无主就是六识不知道干什么才好，不知如何做，因为意根拿不定主意，犹豫不定，始终不肯作决定下命令，六识就会惶惶然。由六识来表达和反应意根的思想情绪，就是六识的慌乱，没有主心骨，没有归宿感，所以就觉得无聊，不愿意活着了。</p><p>情绪激动时心跳就加速，这同样是意根的情绪导致的，比如说怒从心头起，恶向胆边生，这是意根怒了而起恶的表现。心和胆，五脏六腑都是意根通过大脑神经系统调动的，色身整体都是意根通过大脑神经系统调动的，意根可以控制全身，引导全身活动。而意识生气意根不生气的时候，是假生气，无论怎样气，心里没反应，行为上没有反应，或者有行为也是假装的做做样子而已，真生气真怒的时候，就会有行为造作和身心状态发生改变，这就是意根的情绪了。</p><p>二十一、如何如实理解意根的功能作用</p><p>为什么有些人总认为第七识意根什么也不能呢？因为极多人只能看到表面的意识的功能作用，看不到意根的功能作用，所以就把五阴的一切功能作用都当作是意识的，忽略和抹杀了意根作主识的功能作用，不知道意根是一切法的先导，一切法之所以出现，之所以意识能触和了别以及处理，完全是意根抉择的结果，意根是五阴身的家长。</p><p>如果一个什么也不能的废物当家做主，可想而知，这个家会是什么样子。可是世间有极多的大福德大智慧之人，五阴身做了极多的善业和有智慧之业，都是意根主导的结果。即使是畜生，其意根的功能作用也是很殊胜的，六识无法相比。想一想，在一个或大或小的团体里，下属成员为什么会听领导者的安排和调遣？除了权力，难道没有别的了吗？如果领导者无能，一无所是，成员却唯命是从，那么这些成员是不是更弱、更无能？</p><p>国家总统或者元首不可能如诸位下属一般，具体事、具体技能样样精通，也不可能把下属的工作都担当起来，他是站在制高点统管全局的，不可能去做具体工作。你不能说元首没出来应对具体的群众，不做具体工作，不精通技术，他就没有工作。他是领导者，需要总揽全局，统筹安排，和下属的工作分工不同，各负其责，和合运作，才能管理好整个国家。</p><p>一个五阴身也是如此，意根站在制高点，统领全局，祂不可能像意识那样深入细致的了别具体的尘境，思惟、推理、整理、归纳、统计、分析、推敲，细致又细致，一切都到位。祂的精力不允许这样做，只有禅定达到一定程度，排除许多不重要的事，精力集中才能旺盛，能量大了，才能代替六识工作，剔除六识。凡夫的意根只能用六识来办具体事宜，应对具体的尘境，否则六识也没必要存在了。</p><p>意根是恒审思量的识心，工作起来兢兢业业，恒常运转不断绝，为什么还有人说意根什么也不是，意根没有什么作用？认为意识重要而意根不重要的人，是没认清谁是领导者，谁起决定作用，谁的工作更辛苦。因为领导隐藏太深，他没见过，所以认为领导不存在，或者认为员工就是领导。领导不懂技术，技术员上报一项技术项目，领导虽然不懂，也考察审核，最后审批通过实验，实验的过程以及结果领导还是不懂。意根就是领导，是作决策的，意识就是技术员，是为领导提供技术服务的，所以有意识的服务，不必意根事事亲为。</p><p>二十二、对法相的取着都由意根作主</p><p>七个识对所触所爱的法都有取着性，但最终都由意根执取，才收为业种，流传后世。六识的取着最初也是由意根发起和决定，意根对六尘的时候，如果有兴趣探查其中的法，就会生出六识了别，六识了别之后，生出受和爱，之后也许会有取着的心行，意根了别了六识了别的六尘相之后，生起了受和爱，之后产生取着的心行，于是六识就贪爱不已。</p><p>取法相的识心主要有意识和意根两个识，五识也有，但作用微小，可以忽略不计。意识对法尘的时候，是意识取法相，之后意根根据意识的了别和爱取，也生出爱取心行，意根取之后，结果出现。在意识没有了别法相之前，意根也有触和取，只不过意根对法相不是究竟了知，所以取法相的目的是要六识了别，意识参谋，再最后抉择。对于五尘相，五识也有取着，但五识没有决定权，其取心特别微细，智慧不足的时候，极难观察到五识的心行，也极难分得清五识与意识的区别。五识的心所法一般都是与意识和意根捆在一起，观察不出来，所以就忽略了。</p></div>"
},{
    "title": "第三章 意根的警觉作用与梦",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  意根与意识的区别</strong></p><p>一、意根与意识活动的区别</p><p>如果意根动心了，在色身上就会有种种反应，如脸红心跳、害羞或者是青筋暴露、浑身发抖等等，单独的意识心动，身体就没有什么反应，比较平静。只说不做的人，都是单独的意识动，而意根不动；说一套做一套的人都是意识说，而意根不想做，于是就不做；有欺骗习惯的人，都是用意识来表演，意根根本不动心。所以观察一个人的品德，要看他是如何做的，不要只看他是如何说的，做比说更实在。</p><p>意根活动是要耗费一定能量的，而意识活动不一定耗费能量，或者耗费的比较少。意识活动如果消耗能量，也是要涉及到全身的，因为能量是通流到全身各处的，全身使用的是同一股能量，能量不分家，只不过是喜欢动脑思惟的人先消耗大脑里的能量，大脑能量不够用了，才会消耗全身能量。大脑会带动全身，大脑累的时候，全身也会跟着疲乏，就需要休息了。</p><p>在意识的活动里，并不是完全没有意根的活动，多少都会涉及到意根，所以需要消耗能量，涉及的多消耗的能量就多。我如果不用心思考问题，一天静静的只做意识表面活动，一天一宿也不觉得累，也不太感觉饿。如果用心思考问题，一会儿就感觉累了，也容易饿。所以我一点也不愿意接触人和事，不愿意动心思，不愿意考虑某些不重要的问题，除非是有意义的比较重要的。</p><p>用心参禅的时候，也会消耗很多能量，修定不思考的时候，就不太消耗能量，身体反而会感觉很舒服和轻松。修定不思考比较省力，观行思考有可能会烧脑。用意识思惟的时候，因为用心浅和少，所以比较快和轻松，可以泛泛而谈，行云流水，妙语连珠，但内涵浅白，体现出来的是知识水平和记忆发挥的水平，很少能体现出智慧水准。而用意根思考的时候，因为用心很深，识心运行的比较慢和累心，但内涵深，意义深远，体现出的是一个人深层次的智慧。</p><p>用个比喻来说明一下用意识和用意根的区别，比如说一个人走在泥地里，如果泥比较浅，只没到鞋底子那里，走起路来还是比较快、比较省力的；如果泥没在脚脖子或者是腿肚子或者是膝盖那里，把脚拔出来就不容易，每走一步路就很费劲，走路会非常慢。用意识思惟就相当于走在泥浅的路面上，用意根思考就相当于走在泥深的路面上。所以用意根思考问题的人，如果总处于意根的深层面，比较专注，每转移一个念头，每转换一个问题的时候，思绪都会很慢，需要消耗的能量多，感觉有些累，所以就喜欢安静，不希望有外界的人和事来打扰。</p><p>二、意识和意根同时了别和动念</p><p>在对一切法的了别过程当中，不管是动念还是不动念，念头明显不明显，无论在寻的状态下或者是在伺的状态下，都有意识的了别，也有意根的了别，只要是了别了法，这两个识肯定是同时存在的，区别是谁了别的清楚，谁了别不清楚，谁了别的明显，谁了别的不明显，了别是以谁为主的问题，只要一动念这两个识肯定在一起同时出现。因为意根是意识的俱有依，有意识必然有意根，意识的现起是意根思择的结果，所以意识动的时候意根必然已经动了，如果缺少意根的了别和动念，意识就不会出现了。</p><p>而意根是无间断的识，时刻都存在着，都运行着、攀缘着，都在执取着，无时无刻不在动念，无时无刻不在思，只不过祂动的明显不明显，心思是散乱的还是集中的，是有执着的还是无执着的，意识是否能发现祂的存在和心思，有这些区别。</p><p>很多人意识不动念，又观察不到意根的时候，就觉得自己现在挺清静，没有什么念头，其实这时候意根是有念头的，祂是有攀缘和思量的，意识是无智慧观察罢了，指不定什么时候意根作个决定，然后意识这边就静不下来了，就要开始有什么行为造作了。身口意的每一次行动不管是大的还是小的，轻微的还是重大的，都是意根思量的结果，祂要有所造作的时候，意识就清静不下来，就要随着意根的想法去造作。</p><p>三、在默念和知念时都是什么心的行为</p><p>念咒时不管是出声念还是默念，都是独头意识在念，意根的念是无语言文字的。知默念的知是意识的反观力，意识的反观力就是证自证分，是独头意识了别和反观独头意识自身。当然如果念得非常熟了，也有意根的念和知。在意识默念时，意根有知，在意识反观时，意根也有知，这个知深秘，难见难察。意根把独头意识的反观作用，和默念咒语的功能，都当作是自己的功能作用，都认为是自己在念在知。</p><p>如果禅定比较好，意根也能参与念咒，意识能观察得到，就是分不清意识和意根各自的功能界限，容易混淆。有禅定的时候，一是身心可以分离，清清楚楚，联系不是那么密切，六七识也可以是各自都分离的，彼此分开一段距离，才显得清清楚楚，对每个法有虚妄的感觉。如果没有禅定，各个法扭在一起分不开，看不清楚，就觉得混合起来的法很真实很实际，执取性就大，导致烦恼重。禅定的好处说不尽，没有禅定，就不要说自己有修行。</p><p>四、意根与意识的思和知</p><p>意根与意识一样都是识，都有思心所法，都能思惟思考思量，因为极大部分人观察不到意根的思，就认为意根与意识的思有差别，把意识的思称作思惟，把意根的思称作思量，认为思惟不是思量，思量不是思惟，若说意根思惟思考，就认为不对，是意识的思惟思考；若说意根的心理活动，不少人就说不对，那是意识的心理活动。所以观察不到意根的心理活动而还要学唯识，内心还很执拗，就很麻烦。</p><p>为什么很多人都说意根的思很深沉很隐密，难于观察呢？究其原因是因为众生都是以意识的知为知，意识知什么，众生就知什么，而意识所不知的，就不知什么。意识如果智慧不足，不知意根的心理活动，不知意根所知，那么众生就不知意根的心理活动，不知意根所知，就觉得意根的心理活动很深沉很隐密很微妙。其实是应该责怪意识的无知才对，当意识有智慧的时候，智慧无碍的时候，能现前观察到意根的心理活动了，就不觉得意根很深奥难懂了，不觉得意根很隐密难知了，也就不会误会意根的心所法了。</p><p>如果众生都以意根的知为知，情形会怎么样呢？如果众生都以意根的知为知的话，意根所不知的就不知了，意根如果不知意识所知的，不管意识知什么，知多少法，意根都不知，那就是众生不知了，所以意识所学的那些理论就没有多少用处了；意根更不知第八识，要想开悟就更困难了。这时候众生就会说：意识的心理活动深细难知，很隐秘，难于窥探，第八识更是深沉隐密难知，行相微细。</p><p>实际上诸法隐密不隐密，显白不显白，在于识的智慧，不在于法的本身。有智慧的时候，任何法都是显白易知易懂的，无智慧的时候，再显白的法，也觉得深沉隐密。所以六七识转识成智以后，意识就能现前观察到意根的心行以及第八识的心行，并不觉得很困难。佛观察一切法都很轻松，甚至不用观察就能知一切法，对于一切法都是了然于心。</p><p>众生如果是以意根的知为知，就会有神通了，互相之间也许就没有秘密了，前世后世都会了然。这样就能知因识果，也许为了少受恶报，会少造恶业。但还是有不少的人我执重，明知道自己因为造恶业受了很多苦，可还是不断的造恶业，屡次进监狱的人就是这样，死不悔改。但意根因为没有意识明显的引导作用，单纯幼稚，情执会更重，我性会更重，意识很难制约祂，造恶业的几率就会更大了，断我见就更困难了。</p><p>众生如果都是以第八识的知为知是怎么样情形呢？第八识不知不见世间法，不知人我他她，不见色闻声，不知六尘境界，这样的话，众生就无法生存了，六根关闭，处于涅槃状态。这样好不好？有人会说这样菩萨就无法度众生了，但是这个时候，还有哪个众生不处于涅槃状态，还需要佛菩萨去度化？如果众生都是以第八识的知为知，那就不用学佛学法了，也没有佛和众生的区别了。</p><p>如果众生都是以五识的知为知的话，那就无法生存了，五蕴世间就不能作出运转了。因为五识只了别粗重的五尘，不了别细微的五尘，更不了解心法，不知意识，不知意根，不知第八识，除了粗重的五尘境，什么也不知。如果连意识也不知的话，那怎么还能知五尘的粗境？五识必须与意识配合了别，才能知五尘的粗重相，但只知五尘的粗重相，不知五尘的细相，不知法尘，不知心法，是断然活不了的。总之，要想知一切法，以哪个识的知为主，哪个识都必须有大智慧，转识成智，用智识才能知一切法。</p><p>五、以意识的知为知正是无明</p><p>各识的证自证分是什么意思？各识自证的相分，你能知道是什么内容吗？比如说第八识有见分，是能见性；第八识的相分是第八识所见的相，比如说种子；第八识的自证分是第八识自己见到了相分种子，知道了、了别了相分种子；第八识的证自证分是第八识证明了、证得了自己的自证分，知道了自己了别了相分种子，知道了自己完成了对相分种子的了别，知道了自己了别了相分种子。第八识自己干了什么，祂自己清楚，六七识是不清楚的，除非有很深的道种智。</p><p>我们清楚第八识是否了别了相分种子吗？我们不清楚。第八识又不代替意识知，意识不知的，不代表别的识不知。不能拿意识的不知来代替别的识的知。第八识用甲来表示，意识用乙来表示，甲所知道的法，乙不一定知道，乙不知道，不代表甲就不知道。甲的证自证分，不代表乙的证自证分，乙不清楚甲所证得的相分，不代表甲没有证得，不代表甲不知道。还有许多意根的知，意识都不清楚，既然是不清楚，就不要说意根也不知。</p><p>众生的知，大多数都以意识的知为准，意识不知的，就说我不知道，就说某事没有发生，不存在。其实第七识知道某事发生了，知道某事。但是第七识没有语言文字功能作用，不会表达，没法让意识知。意识就觉得自己不知的就是不存在的，别的识同样也不知。这样断定，非常武断，没有道理。</p><p>凡夫众生的意识武断到什么程度？意识自己证不得意根，观察不到意根，意根的自证分和证自证分，意识就不承认有，意根对自己有反观性，有反观能力，能反观到自己的了别，意识不知道，观察不出来，却说意根没有反观力，没有证自证分，某些自证分也没有。当意识这样认为的时候，正好说明了意识自身的愚痴、无明、暗钝，所知太少太浅，误会太多，而不自知。佛说，慎勿信汝意，汝意不可信。为什么？因为无明深重。</p><p>六、没有意识的时候意根是否有知</p><p>有人说：意根既然也是识，就应该对外界有感知，当人昏迷时为何对外境没有一点感知了呢？这个问题是这样，昏迷时没有感知是意识没有感知了，而意根仍然有感知，意根感知的时候，意识一旦灭失了，就不知道意根的感知，即使意识不灭，如果没有认知的智慧，还是不知道意根的感知作用。这是因为意根的知，要让意识知，之后众生才能知，众生都是以意识心的知为知，意识不知的就认为是不知了。</p><p>但意识不知道，不代表意根也不知道。所以在睡觉无梦时、昏迷时，意识消失时，意根的知就无法传达到意识，意识就不知，意识不知众生就不知。即使意识能正常运行不消失，祂没有智慧时也不知道意根的知。意识没有智慧时，意根是什么样的心行，感知到了什么，意识也是不知道的。所以意根是否有证自证分的反观，意识观察不出来，意根是否知道自我的存在，意识也观察不出来。所以在意识观察不出来的时候，就不要下判断说意根如何或者不如何的。</p><p>七、觉观思惟与显境名言的区别</p><p>觉观是意识的觉观，思惟也是意识的思惟，意识还有能够通过文字语言显示出六尘境界的功能作用。由觉观可以产生出思惟，思惟可以出生语言文字，有语言文字可以表达显示出境界。但是最初的觉观是没有语言文字的，最深细的觉观也是没有语言文字的，有语言文字的思惟比较粗糙和肤浅，不细腻。意识没有语言文字、觉观思惟的时候，与意根的无语言文字的状态，二者极难分清，明暗混在一起，几乎是分不清哪个是哪个。</p><p>八、意根与意识慧的区别</p><p>问：所谓记忆就是在意根的参与下，把前六识所经历的内容存储起来，以后在需要时，由意识主导进行回忆；而理解是在意识的智慧引导下，引发意根的思考，从而意根明白事物的内在联系和道理，所以在遇到相关问题时，就不需要进行回忆，由意根直接给予解答和处理。所以意根有智慧时处理问题简洁快速，意根没有智慧时就得去搜寻记忆，结果处理问题时时间就长而且低效。以上的理解对不对？</p><p>答：以上的理解大致都对。回忆由意识回忆，但却是意根主导和决定的。理解是以意识为主的解，也会或多或少的涉及到意根的解。意根没有智慧时，需要经过意识的回忆，然后进行对比、比较、衡量，才能作出或对或错的决定。智慧越浅，比较衡量的时间越长，越是犹豫不决，越是没有信心。那种快刀斩乱麻，不用意识思惟、分析、比对、较量的抉择，是意根直接的抉择，或慧或不慧。不动声色，不用动心思，不用翻来覆去的思考，默默的自动就把事情解决了，都是意根的智慧。处事老道的人，意根都有智慧，经验丰富，能把事情处理得圆融无碍，不给人留把柄。</p><p>意根没有智慧的学生学习，一般都靠意识的死记硬背，不能自由发挥，遇到非知识性问题，就束手无策。而意根有智慧的学生，从来不愿意记忆，都是理解了问题以后随意发挥。所以学校考试，得高分的不一定是真正有智慧的学生，要看考试的试题是知识类的内容还是发挥性的内容，是考知识还是考智慧。                佛法也是这样，一讲就一大套理论的人，不一定是有实证智慧的人。如果他读的书多，博学多闻，博识强记，能够很好的运用意识对所学的法进行整理、归纳、总结、分析，就可以整理出一套理论体系，但这不代表就是实证的智慧，也有可能是知识的累积。</p><p>知识的累积不能断除烦恼，只能说明意识聪明罢了。跟着意识聪明的人学法，可以获得很多的理论知识，但实证很困难，跟着有实证的人学法容易实证，而知识并不一定丰富，但实证之后智慧增长了，能够渐渐的扩充知识面，补充一些必要的理论知识。</p><p>意根有智慧时智慧深，无烦恼，格局大，心胸宽广，有气魄有胆识，目光长远，大是大非拿得准，不会做错事。而意识的聪明没有深沉的大智慧，心量不够大，有可能聪明反被聪明误。一个人天生的智慧，都是意根带过来的，是意根的智慧，后天的智慧是新学的，是意识的智慧，也可能有意根的智慧。</p><p>九、意根的智慧和意根的思</p><p>意根本身没有语言文字和声音相，不会用语言文字来思惟，动用心思的时候也没有声音，所以意根的心思和运行的行相隐秘难察，不容易捕捉，定不足时心不细致，就很难观察到，那么对意根的误会就在所难免了。</p><p>意识有时有智慧，有时无智慧，意根也是有时有智慧，有时无智慧。意识的智慧发挥得好，可以辅助意根的了别和抉择，而如果意根本身就有智慧，就不需要意识的智慧辅助，或者是不需要意识来辅助思惟分析，只帮助了别就行了，意根只要了别到法的粗略相和细相，马上就会知道如何处理和对待。意根本身有智慧的时候这样，意根没有智慧的时候，就需要意识不仅辅助了别，还要辅助思惟分析推理判断，然后意根依据意识的判断进行思量，而作自己的判断，但不一定与意识判断的一致，其抉择有可能出乎意识的预料。</p><p>意识反观自心，是证自证分，如果意识观察到的是意根的心念，就是自证分。但意识没有智慧时，不一定能分清到底是自己的心念还是意根的心念，就会都当作是意识自己的心念。所以很多人都说这明明是意识的功能作用，怎么说是意根的功能作用呢？其实是自己的意识没有智慧辨别清楚意识和意根的差别和界限，没有道种智，想要分清意识和意根的作用，确实是非常困难的。</p><p>十、对世间真厌离与假厌离的区别</p><p>对于世间法厌离分为表面意识的厌离和深层次意根的厌离，表面的厌离只不过是意识觉得世间无聊无意义，但只是说说而已，说归说做归做，不会动真格的，该怎样贪婪还是怎样的贪婪，不会改变什么，这是假厌离。而当心里真正生起厌离心的时候，直接在行动上就表现出来了，不再会想许多办法取得世间利益，而是尽量躲避世间人事，多一事不如少一事，不再贪恋世间，这是深层次的意根生起的厌离心，是与解脱相连系的心。达到这种程度不容易，是多生累世所修行的善根，浅学者绝对不会有这样的心行。</p><p>如何才能达到深层次意根的厌离？首先需要修禅定，在禅定中观行五阴苦空无常无我，初步证得无常苦空无我之后，还不能对世间生起厌离心，需要继续深入观行，直到发起初禅定之后，断除了贪爱烦恼，这才对世间生起了厌离心，不想再在世间里继续流浪生死虚度光阴，有了解脱的心、出离的心。所以出离心、厌离心都离不开深层次的禅定和智慧，如果不修禅定，就只有口头上的厌离，实际上非常贪爱，一点也不厌，口是心非，心口不一。</p><p>十一、意识与意根喜欢的区别</p><p>心有所喜欢大约分两个层次，或者是两种程度，粗浅的是意识的喜欢，深深的是意根的喜欢。做不了主的是意识的喜欢，喜欢就千方百计得到、就采取行动要得到的，是意根的喜欢，上瘾和着迷，念念不忘，都是意根的喜欢。比如说一个家庭是家长说了算，喜欢一件事，有孩子的喜欢，也有家长的喜欢。但是孩子无论喜欢什么都不能作主，必须经过家长同意，才能有办法得到所喜欢的，而家长喜欢什么就想办法得到什么。孩子相当于意识，家长相当于意根。</p><p>如果意识的喜欢，影响到了意根，意根也喜欢，或者同意意识的喜欢，意根就会决定得到所喜欢的，去取。意识的喜欢一是受意根影响，一是受环境六尘境界影响，意根的喜欢一是来自于无始劫的烦恼习气，一是来自于意识的熏习。如果意识的喜欢没有影响到意根，意根就会置之不理，意识白白喜欢，得不到。比如喜欢学法，是意识先喜欢，意根后喜欢。如果意识喜欢学法，意根不喜欢，就不会精进。如果意根也喜欢学法，就会孜孜以求，精进修学。能坚持长久的不放弃的，都是意根的喜欢，断断续续的就是意根不太感兴趣，被意识牵引控制着，控制不了，意根就跑了。</p><p>十二、意根智慧与意识智慧的区别</p><p>遇到一件事，马上就知道事情的原委，无语言文字和声音地快速地了然于心，这是意根的智慧，非常不容易观察，一般人都不知道。而遇到事情不能马上就知，需要思惟分析归纳整理比较想象，然后才能知，这是意识的智慧。意识动用了语言文字和声音，动用的是粗浅的思惟作用，这部分作用容易观察出来。</p><p>为什么有的事情能马上知道，有的事情就不知道呢？事情刚一发生，是意根作意触受想思，意根对于非常熟悉的事情，从前经历过的事情，能马上就知道，并且能自动作主加以处理应对，对于不熟悉没有经历过的事情，不能马上知道，思量过后也不知道，于是就生出意识，让意识了别思惟，意根根据意识的分析的结果再思量，然后再行处理应对。意识的作用就是辅助意根了别的，如果意根自己很清楚事情，就不需要意识了别思惟，直接做决定，快速地把事情处理应对了。</p><p>十三、意识所不知道的意根触的法</p><p>意根与如来藏捆绑在一起，如来藏现什么法，意根就触什么法见什么法，但是意根的了别也是分重点和层次的，祂所注重的法如果自己了别不清楚，就会作意和抉择，六识就会出来了别。如果意根自己能了别清楚的法，但是无法处理，就会作意和抉择让六识出来了别并且处理。</p><p>意根自己能够了别清楚不需要处理的法有极多，意识都不知道，意根触的法不需要六识了别的也极多，意识都不知道。意根触和了别清楚的法也极多，想让意识知道并且处理的也极多，可是意识因为智慧不足却无法知道，稀里糊涂的，甚至对于意根的提示暗示还感觉莫名其妙，最后不了了之了。</p><p>如来藏把六尘境界现出来，六尘最初出现的时候，是意根先触先了别，意根对六尘了别不清楚，六识就出来仔细了别，六识刚了别的时候，对六尘没有可对比的，也了别不清楚，意识就感觉模模糊糊的，等了别了几刹那之后，前后六尘有可对比的了，尘境连贯起来了，意识才知道六尘是什么。比如写字，写出第一笔，别人不知道是什么字，写出第二笔，也不知道是什么字，写出第三笔，能模模糊糊猜测出是什么字，写出第四笔，就知道是什么字了。</p><p>十四、一念不生是什么状态</p><p>一念不生的时候，没有独头意识，独头意识存在的时候一定有念，念就是独头意识的念，五俱意识只是知、了别、分别。当五俱意识只处于了别和知，而不去分别的状态时，就是一念不生的状态，这时候意根的知的功能作用就比较明显地凸显出来了，意根是有知的，也是有念的，只是意识不清楚。这时候也是处于禅定的状态，心不乱不复杂，事少而简单。一念不生的时候，意识是不生念了，但是意根可不是，意根的念一般都不断。比如说在一念不生时，突然想到一件事情，于是马上起身出门办事，这就是意根在意识不生念的时候，念头转动的结果。</p><p>这个状态是如何出现的？这也是意根作主抉择促成的，意根不攀缘，不想分别法，意识只能听话，安安静静的存在和运行。这也是意根没有什么想法的时候，是意根没有什么明显的念的时候。如果意根有想法，就会促使意识去造作，实现意根的想法，如果意根念着其他的法，意识必分神去处理，不会安安静静的，而是动荡和忙乱的，这样定不住就没有禅定了。</p><p>十五、离念灵知与意根的关系</p><p>灵是灵敏灵动，离念是暂时离开了思想念头。这样的知有意识的，也有意根的 ，意识离念还算容易做到，意根离念相对就难了，但也不是不可以。意识为什么能离念呢？首先是意根没有什么欲望和想法，不攀缘尘境，也没有粗的思想念头，其次是意识本身没有了别境界的欲望，也没有所惦念的事情，这样才不会调动意识去思去念去想去造作。而意根那些特别微细的思想念头，无需意识参与现出身口意行，意识也无力发现和参与。</p><p>这时候意根处于稍微清静的状态，也就是禅定状态，无欲无求状态。所以当意识处于离念的状态，一定是在意根清静，并且处于禅定之中，不管禅定多深，时间多长。其实这时候还有细念，没有念如何能有知？只不过是对于境界非常熟悉的时候，不用费力分别就能知，这时候思想活动非常轻微，就叫作离念灵知。离念灵知这个词语不是来自于佛经，佛经对此没有具体描述，都是后人根据自意提出的一个概念，并不是很准确。这都需要很深厚的唯识修养和观察力才能加以观察和辨别。</p><p>十六、人体肌肉活动是意识的还是意根的</p><p>问：意根直接调配人的神经系统，而神经系统又直接控制人的肌肉收缩，由此可见，调配人体肌肉活动的直接操作者是七识，而不是六识。那这样的话又为什么说身行是意识的功能作用？</p><p>答：肌肉活动属于神经系统活动，是大脑中枢神经系统发布命令之后的反应，而大脑中枢神经系统是由意根调控的，意根的抉择一发动，大脑皮层就动，中枢神经系统就会发布命令，传达到身体相应的神经系统，产生肌肉收缩现象。而身口意行虽然是由意根作主和指挥的，但具体的运作都要由意识和五识来共同完成，六识如果不能正常现起，身体就不能运行了。</p><p>神经系统的收缩放松虽然都是意根调控的，也是下意识的行为，但是很隐密，很微弱，包括呼吸，有意识参与部分，也有很大部分不用意识参与。身体的移动，如果没有意识，无论如何也完成不了；细微的神经系统活动可以不用意识，如睡着以后的身体的抽动，眼皮的跳动，轻微的身动，可以不用意识，轻微的呼吸也可以不用意识，但是意识可以主动的调节呼吸，比如深呼吸等等。</p><p>和肉体紧密相连的肌肉神经活动意根单独就能调控，可以不用意识配合，意识参与也可以，但只能引导意根，不能指挥全身，因为意根单独就能控制中枢神经系统，在那里发布命令，指令能传导到全身。意识参与的神经活动叫作有意识行为，意识不参与的叫作无意识行为，比如呼吸活动、肌肉伸缩活动、大小便失禁、胃肠蠕动、气血运行，还有一些特殊的情绪活动，如心惊肉跳、怒发冲冠、吓得屁滚尿流等等，都可以不用意识参与，意根单独就能完成了。而身根的运动活动必须有身识和意识与意根共同运行调控。</p><p>十七、色身修复与意念的关系</p><p>想让气沉丹田，通过深呼吸，让气一直往下到达丹田那里就行了，配合观想，观想气到丹田，就能把气引到丹田，气随意走，意到哪里，气血就会跟随到哪里。这个意不仅有意根的意，还有意识的意，但只有意根的意才能引导气血运行，意识的意只能引导意根。</p><p>色身上的功能作用，一个是如来藏单独的作用，一个是意根与如来藏和合起来共同的功能作用。通俗点说，在色身上大部分功能作用都有意根的作意成分，意根的意有不到之处，很多事也做不成。丹田之处意识尽管去意去守，但却不会有什么功效，除非意识的意成功导引了意根，意根也发动了意，才有功效。意识守丹田，是假守，气不会跟着过去，意识引不了气和血，只能引意根，这是意识最大、最有用的本事了。</p><p>色身上组织细胞的修复与调节，有一部分也有意根的参与作用，如果意根积极配合，持乐观态度，不急不火，身体正能量就会上升，身体修复得就快。色身修复的时候，有意根参与和无意根参与，差别很大。比如针灸的时候，把意念加进去，加到针尖上，效果非常明显和快速，色身一下子就能改变。如果有人修炼出真气了，用真气配合针灸，效果就更好了，足以快速改变身体的四大，色身恢复相当快，可能马上就能得到恢复。身体里如果有真气运行，用手掌往别人的后背里灌输，意念越强，气入身体越多，气在身体里运行越快，身体马上就能得到改善，气血充盈身体就健康。</p><p>意到哪里，气就到哪里，所以色身的修复，有意根主动参与的恢复的就相当快，意不到之处，运行就不顺畅，或者不运行。比如吃饭时注意力分散，气血就分散，消化就不好，刚吃完饭的时候，如果聚精会神的思考问题，气血聚在大脑部位，胃脏的气血不够用，也影响消化，长期以往胃病就出现了。再比如大小便时如果注意力分散，大小便就不顺畅，意走气就走了，意在气在，所以意念的作用力非常大。意念这个力是如何产生的呢？是定力增强以后，心力就增强了，心力就是意念力。</p><p>十八、双重人格是意根的多格</p><p>一个人有双重人格，究竟是意识和意根各有一个人格，还是意根有两个人格？第一个人格现起的时候，身口意行是一个样，第二个人格现起的时候，身口意行是另一个样，两个人格不同，或者是截然相反，好像是两个人似的。</p><p>为什么会出现多重人格的现象？因为意根有多个心理需求和意愿，互相兼顾不了，就出现了多重人格，以满足不同的意愿，或者是展现多个性格。也就是说自己不能满足自己的意愿了，多个性格不能和谐相处了，多种经历不能重叠糅合和在一起了，没办法就形成了多重人格，以满足各个意愿和自我。意根太纠结了，化解不开矛盾，就强行地把自己一分为二，一分为多。</p><p>从多重人格的现象上，可以提前体会到诸佛菩萨的化身和报身。报身是意根现起的身，化身是分身，是由意根的意愿化现的六识的分身。双重人格各自的身口意行不同，相当于多个分身六识的造作不同。诸佛菩萨的化身身份不同，造作也不同，观世音菩萨的愿力是众生应以何身得度，就现何身而说法。何身就是无数化身，是以意根度众生的意愿所化成的。一个菩萨，用化现两个或多个身份来到世间，各个色身有可能都不相知。</p><p>诸佛菩萨的愿力广大而弘深，一个色身没办法实现这么多、这么大、这么深的愿力，就要化现无数分身去实现众多愿力。意根是作主识，祂只要福德、禅定、身体、愿力足够，就会作主分身，变现众多的六识身，一套六识身有一套身口意行，众多套六识身有诸多身口意行，身口意行各个不同，都摄属于同一个意根和如来藏。而多重人格的人格，摄属于同一个意根的不同侧面，不同性格，不同意愿或者是不同心愿。</p><p>大家学完唯识，应该能成为心理咨询师，或者是心理学者，或者是心理辅导师，从事心理研究和导引者。别人的心理一看就知，谁也瞒不了你们，谁也骗不了你们，而能掌握别人心理，对人循循善诱。世间人无非都是贪嗔痴，都是执取五阴我，看不透现象界，当然就解决不了心理问题了。多思惟观行，就会把各个法义贯穿在一起，就会清晰的看到未来的走向，对佛法修证的前景感到乐观，感觉前途光明。</p><p>十九、五蕴是如何运作的</p><p>以喝茶为例来说明。喝茶是五蕴整体的和合运作过程，色受想行识五蕴和六根六尘六识十八界全部都参与其中，根尘识三者相触和合在一起运作。其主导者是意根，负责协调和调控六识与五根六尘的触受想思活动。最伶俐快速的是意根，意识很多时候都觉察不到什么就把事情做完了，五识配合着就像没有思想一样，完全忠于意根的意旨，意识有时候就琢磨不透。</p><p>喝茶的整个过程也是这样，如果茶太烫，洒在手上就会激灵一下甩掉，来不及让意识了别和思惟分析。意根想要端茶杯想要喝茶，根尘就会相触生出六识去配合运作，完成意根指令，茶才能喝到口里。具体六根的运作，六识的运作要自己去对号入座观察，尤其是细节更要自己定下心来观察，需要把五蕴的概念弄清楚，十八界的功能作用弄清楚。</p></div>"
},{
    "title": "第四章 如何用意根思量和参究",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  如何用意根思量和参究 </strong></p><p>一、意根恒审思量的恒的含义</p><p>既然意根也是生灭的法，其恒审思量中的恒如何理解？恒，有两种含义，一种是不生不灭永远长存不灭；一种是代表时间非常长久长远，在相当长的时间里一直保持不变，一直是如此的。第一种是第八识的恒，是绝对的，没有可比的，不生不灭的；第二种是意根的恒，意根的恒是相对的，是指在意根不灭的状态下永远保持思量不变。</p><p>意根的恒可以到成佛以后也不会灭去，所以有意根就有意根的思量性存在。但不去灭意根，并不代表意根不能灭，阿罗汉辟支佛都能把意根灭尽入无余涅槃，七地以上菩萨以及诸佛都可以灭尽意根，而故意不灭。意根是第八识输送识种子所生出来的，靠第八识才能出生和运行，不是不生不灭的本来法，一旦意根不再执取三界世俗法，第八识就不再输送意根的识种子，意根就灭了。所以意根恒审思量的恒只是相对于六识而说，跟第八识的恒无法比。</p><p>二、在禅定中如何调动意根的思量</p><p>在禅定中不用意识的思惟而用意根的思量，这个功夫是相当深的，一般人很难做得到，需要有很深的禅定基础，还需要有一定的观行功夫，禅定和观行修行到一定程度，就能把意识的思惟转换到用意根思量了。意识思惟比较浅，浮在表面，一般人都能观察出来，比如反观此刻心里有哪些念头，就知道自己此刻在想着什么，在思考着什么，在打算着什么，这些念头一般都浮在表面，都是意识的思惟。</p><p>在这同时，背后也有意根的支持和主导作用，如果定力和智慧不够，就不容易观察出来，认不清自己内心的真正想法。等把心修到非常细致的时候，就能够观察出来在意识思惟的时候，背后有一个力量在起主导作用，那个力量和思绪就是意根的。等到发现了意识背后意根的那种力量，能够抓到意根的时候，就要渐渐地把意识的思惟作用淡化，淡化到一定程度再舍去意识的念头，舍去以后还要保持心里有念头，有意根的思考活动，不让自己完全无念无想，这是很不容易的。</p><p>在禅定中要学会努力发现内心深处的那种力量，祂其实是有念的，有思想活动的，是能思考的，那就是意根的思量活动。发现以后就努力保持那个思量活动，不要灭失掉，把意识所思惟的法义交给祂，让祂继续独自思量，这就属于比较深的参究状态了，参禅就是这样，思量五蕴非我就是用这样的功夫。这样就把意根的思量调动起来了，这种思考方式，这样的功夫就叫作意根的思量。</p><p>要做到这一点离不开甚深禅定，禅定功夫需要非常好，能把粗的妄念舍掉，而且到一定时候就连细的妄念也要舍掉。妄念就是思惟其它无关紧要的法的念头，也就是杂念和多念，这些念头对于正念都是干扰，所以都要去掉，就剩一个意识所需要思惟的法，然后再把意识的思惟也去掉，让意根来思量这个法，意识和意根交换过来思考问题。这个时候意识还存在着，它起着一种很轻微的了别作用，但是不深度思惟、分析和推理，而是让意根来深深地思量，没有语言、文字和声音，这种思量作用在禅定和智慧不足的时候不容易观察出来。</p><p>意根这个思量的功能作用也叫作内心深处的想法。每个人心里的想法都分为两种：一个浮在表面，是浅层次的意识的想法，另一个隐藏在深处，是深层次的，也就是内心深处的意根的想法，代表自己真正的想法。比如说我现在对别人说我打算干什么，其实我没有这种想法，说出来的这种想法有敷衍的意味，内心还有另一种声音和想法。那个想法比较隐秘，也不想让人知道，就用意识的语言来掩盖，或者是转移视线。</p><p>不断的反观自己意根内心，抓住自己的意根内心，然后把原本意识所挂念和思考的法转交给意根，让意根来挂念，这样就能让意根时时处处地挂念这个法，意根的思量性就现前了。意根同意就熏染成功，意根没有接受就没有熏染成功，只有功夫到位了才能成功。</p><p>在日常生活当中，我们都能用到意根和意根的思量作用，只是观察不到，分别不出来，也不会做总结，就分不清楚是意识的思惟还是意根的思量。这就需要增加禅定功夫和观行智慧，才能把这些问题搞明白。只有禅定深入了心才能细致，才能发现意识和意根的区别，也能区别开内心的声音和表面的声音，从而明了意根思量的状态，抓住意根的那种思量性，慢慢就会运用了。</p><p>要达到这种程度，就要加强禅定的修行，提高智慧的分辨力，降伏烦恼，减少妄念，心缘佛法不攀缘世俗法。禅定修得越来越深，心就越来越专注，妄念就越来越少，以至于想舍妄念就能舍掉。心越来越细致，智慧越来越深的时候，意根的功能作用就会发挥得很好。</p><p>当色身得到调伏以后，达到定慧等持的程度，就可以直接用意根的思量来解决问题。在对一个法的疑情比较重的时候，直接把这个法挂在心里头，一开始意识挂着，然后把意识的作用减轻、减淡，让意根挂着这个法，这时候就进入了比较深一些的禅定，让意根深深地思量这个法。意根越专注思量，禅定越深，禅定越深，意根思量的也越专注和深入细致，最后就能把这个问题搞清楚，同时就进入一种三昧境界，法喜充满，身心轻安，禅悦出现。三昧就是定慧等持的境界，这个境界出来以后，一天的精神状态都会非常好，身心都非常轻安。</p><p>三、如何快速入定和参究法义</p><p>现在给大家介绍一个既能很快入定，又能同时参究和观行的方法，让大家快速进入参究境界。</p><p>要断我见，五阴当中的我很关键，就思量这个我到底是个什么。如果是在坐中思量，上座盘腿之后，调整好呼吸，一般是深呼吸几次，让身前任脉通畅没有阻碍，头脑清晰不昏沉。然后单提一个我，一开始是意识心中这个我字和我的意思就出现了，然后让意识把这个我的疑情传递给意根，交给意根之后，意识的心念就要逐渐消失，感觉好像心空了，没有什么念头了。</p><p>而心并没有空，意根那里在悬着这个我的疑问，感觉很深，似有似无，好像能抓住，好像又抓不住。这时候意识不要动念，让意根心中的我的疑情越来越清晰，越来越深入，就像刻在心里一样牢固。这样禅定就生起来了，一心一意参究个我，这时候意识像傻了消失了一样，意根却不是，意根的那种思量意识不容易抓得到，也不容易感受得到，但是定力增强了，心细的时候还是能够感觉得到意根的那种深深的思量，绵绵不断，深细极深细。</p><p>这时候心里应该静极了，除了那个我的疑，心里应该什么也没有，这既是甚深的禅定，又是一心一意的参究和观行功夫，定慧等持，不偏不倚。因为禅定深，身体感觉非常的舒服，头脑非常的清晰。在这其中，如果感觉昏沉了，或者是要入无念的定里了，意识就要再提醒意根，提起我字，注意力全部放在我字那里，心不空不乱。一个小时的时间就会很快过去了，起座的时候，感觉神清气爽，精力充肺，精神愉悦。意根思量出的结果，有可能清晰明确，有可能不太清晰明确，但心里是有信心的，比从前是明了多了。</p><p>只要还没有出现一个明确的答案和结果，没有定慧等持的三昧出现，没有断我见，以后再继续这样用功，直到结果满意为止。依据这个方法，再依次思量其他不明了的法义。如思量色阴，思量受阴，思量想阴，思量行阴，思量六根六尘六识。任何一个法义都这样思量，能从根本上断除疑惑，断除三缚结。</p><p>一开始上座时，意根没有经验，不能进入思量者的角色，进入角色了以后，也不知道思量个什么，这就需要意识提醒引领意根朝向哪个方向去思量，还不能提醒得太多，每次只需要提醒一点点，模模糊糊的，意根一旦能够专心的思量了，就会越来越明，越来越通透。出定之后，意识要进行整理归纳，把意根思量出来的全部法义都思惟一遍，这样能加深印象，得到确认。</p><p>在打坐中这样用功夫，在行走做事情当中也要这样用功，只不过比较困难一些，精力要分散一些，达到同样的效果所用的时间要长很多，方法都是相同。意根的疑情很深的时候，行走坐卧都可以专心用功，为什么如此，里面有什么奥秘，就会知其所以然了，法的来龙去脉探究清楚就证悟了。</p><p>四、如何用智慧进入禅定中</p><p>上座调整好呼吸之后，心里调出需要思惟的问题，用意识把问题捋清内涵之后，不去分析、推理、猜测和想象，不动用表面的意识的思惟之中，把意根调动起来，问题深深的植入意根心中，让意根悬挂着这个问题，这时候意识和意根心里都没有文字语言和声音，这样甚深禅定就出现了，定力生起来了。意根处于思量问题状态中，如果色身没有什么阻碍，心里没有杂念，意根越思量越专注，禅定越深，智慧越开解，身心状态越来越调和，精神越愉悦。</p><p>在这样甚深的禅定当中思量法义，完全等于是甚深观行、参禅和参究，心里对法义就会越来越清晰，一旦能思量通透，内心会很笃定，没有疑，断除了疑惘。如果是用这样的方式思量断我见的内容和有关自性明心的内容，一旦思量参究明了，就会断除三缚结，疑结必断。如果是意识推理臆测出来的，意根不明了，疑结就不断，业障也不除，生死就不能绝。</p><p>极多人都只会用意识的肤浅思惟方式，不会用意根的深深的思量方式，所以都不会用功参禅和参究，导致情思意解，疑情不灭，疑结不断，遇到风吹草动，疑心炽盛，从前所推导出来的法就会被推翻，即使不推翻，也不是实证亲证，没有实际用处。所以现在很多自认为悟道的，假悟道的比率是纯金率，或者更多，只多不少。这就是末法时期的现状，不管有多少人心有不甘，这就是事实，与末法时期的众生根器和时代背景相应相匹配，不会比正法时期和像法时期更好，绝对不会。</p><p>五、如何以智慧引发禅定</p><p>以智慧引发禅定，入定非常快，前提条件是禅定和观行基础都比较好，一上座心里能很快排除杂念和妄想。心里思考一个法义，内涵清晰，能很快的专注思考，而且越来越专注，把明显的意识思考减弱和消除，但内心里的意根还是在思考着思量着，没有语言，没有声音，没有文字，思考的非常深。刚开始修习的时候会比较勉强和难耐，习惯了以后入定非常快，身心都非常舒服，浑身通透，头脑清晰，出定以后身心愉悦，精神百倍，比睡眠效果好很多。</p><p>在意根思量过程中，可以观察到，意根不会去参考什么法义，不会与其他法义相比较，也不会猜测和想象，所以意根没有比量和非量的思考方式，完全是现量的思考，一旦得出结论就是现量的智慧，比较真实，不容易推翻和后悔，值得信赖，用意识思考就不是这样了。因为意根的思量没有语言、文字和声音，祂所思量出来的结论要想形成语言、文字和声音，就需要意识来帮忙，需要唤醒意识，把结论传递给意识，意识明了了以后再组织语言，形成文字和声音，形成的语言和文字会很简洁、明了、通透、到位。</p><p>这个过程就比较复杂和缓慢了，比意识单独思考问题要慢很多，但尽管慢，却很深、很究竟和到位，代表了自己的真实智慧。所以如果一个人用意识思考的非常多，以意识思考为主，他写文章和演说虽然会很快，内容也会很多和庞杂，但质量无法保证，更保证不了是现量智慧，比量非量成分会很多，参考的内容会多一些，记忆力可以很好，发挥的也可以很好，只是不完全代表自己的真实智慧。所以好饭不怕晚，也不怕慢，精致美味最为享受。</p><p>六、如何才能入定快</p><p>在打坐时如果思考法义，比默念心经和咒语入定来的快，还要深，比调呼吸入定快，比用其它方法入定都要快。这是对烦恼轻微妄念少的利根的人来说是这样，因为这些人已经有了修定的基础，前行方便就可以省略了，而对于攀缘重心思多的初学定者，越思考则心越乱，没有禅定就是杂思，杂思乱心，那就等有禅定基础的时候再思考。我上座时腿一盘，什么前行方法都不用，直接进入深深的思考当中，没有意识的思惟，都是意根的思量。盘腿以后，先是关注需要思考的法，然后就定在那个法上不动了，一点妄念没有，这就是意根参禅参究的状态。</p><p>意根思量的深而慢，但彻底，意识思惟的快而浅，不彻底不透彻。意识思惟是前行方便，目的是为了引起意根的思考，最初这是必须经过的一个过程。在意根思量参究里，几乎没有所得的知识，不会增加知识量，但是却很有趣味，有一种深深的探索的趣味，有一种朦朦胧胧要发现什么的乐趣。开发的都是自己心田里的智慧，这种智慧不从外得，外得的都是知识。到这种程度，就不感觉累了，我可以坐一上午，也可以坐一天，就是心里有牵挂，不得不下座。</p><p>七、用意根思量的益处</p><p>问：我好像明白怎么用意根思量了，那是一种不能用想的心的活动，一想意识就参与了，意识一参与，那种状态就变的没有那么深细了。是这样吗？这个状态时间很短，思量到问题卡壳地方，就用意识想了，马上状态就没那么深细了。还有打坐时对身体的状态一觉观，会出现没有这个色身的感觉，只是轻微的觉受和意识构成的这么一个身体，很不实在。突然有种想法，平时看到的事物只不过是图像影像，是变现出来的，有这样的感觉，出了定后看看周围却还是那么真实。</p><p>答：你现在大概能分得清楚打坐当中是意识在思惟，还是意根在思量，方法用得也正确，只是功夫还不够纯熟自如，需要慢慢来，逐渐加深功底。静中思考佛法，确实是用到意根的时候心思很深细，用意识的时候就有些肤浅，好像隔了一层，不够深透。</p><p>打坐时观察色身比较专注的时候，定力就会提升，定力加深时，反而觉观变得轻微了，就没有了色身的知觉，心就空了。定力能让心思细密精准，往往能观察到平时观察不到的事情，能发现事情的真相，从而参透和悟透真理。那么在定中感觉看一些事物好像是图像似的，不那么实在了，这是一种正确的知见，在正知见的基础上，再把功夫做得纯熟，就有希望证悟。</p><p>证悟之后，出定就不会再把虚妄之法当真了，在证悟之前，知见仅仅是知见，改变不了什么。但正知见毕竟有一些脱离了虚假的认知，趣向于发现事物的真相，把这种修行状态再保持和深入下去，更能看透种种事理非常虚幻不实，因缘时节具足的时候，就有可能证得空。所以一切法的证悟都是在甚深禅定当中证悟的，即使是在活动中，也是有定力的，这种定力都是缘于打坐的禅定功夫，是静中定的延伸延续。</p><p>八、如何才能契理入理</p><p>五阴十八界十二入，是由各种因缘聚合而有，因缘散即消失。此理要如何契会？意识想一想就能明白个大概，可是你自己也能知道这不是真正的懂，还需要深深的确切的明了其义，有理有据。这就需要在禅定中，把此理悬在脑海中，让意根一心一意思量，时时刻刻绵密的思量。意根的思量隐秘、连续而不粘境，有一定的高度和深度，叫作高着眼看。</p><p>九、心如墙壁可以入道</p><p>问：有一天晚上我在睡梦中进入禅定，心里明明朗朗，周遭的人事物都清清楚楚的知道，但又觉得这些人事好像和自己没有任何联系，也影响不到自己。自己好像是身处真空中一样，心中没有一丝杂念，只有思维法义的一个念头（具体什么法义记不得了），就像只有一个太阳孤零零的照在天上，一点乌云都没有的感觉，同时全身心感到无比的轻安舒适，终于知道了原来在禅定中是这么的舒服！醒来后都还感觉得到那种舒服，如果有这种禅定，真的不会再去贪图世间的享乐了，那种感觉非常的轻安自在，是世间的五欲乐无法比的。请教师父：为什么会在梦中出现这种现实都没有经历过的境界？</p><p>答：这种梦境是在禅定中参禅的状态，有定有慧，止观双运。你过去世修过这种禅定，是未到地定，意根前世经历过，有记忆，现在是心里向往，还想要经历这种禅定境界，但在现世生活中比较忙碌，修定的因缘又不具足，于是意根只好做梦，在梦中享受禅定和参禅的快乐。看来意根也挺可怜和无奈的，现代社会太繁乱了，竟然无法摒绝繁乱的生活一心修道。</p><p>在梦中，意识处于清明的无念状态，明明了了，没有念头，应该在未到地定中，但意根起用处于参究法义的状态，在思量着佛法，只有这样思量佛法才能解决根本问题，才能证道。参禅参究就是这种状态，心中无一丝杂念，外境不入心，心如铜墙铁壁一样如如不动。达摩祖师说心如墙壁可以入道，说的就是这个意思，禅定和思惟达不到这种程度，就不要指望证道。</p><p>意根的这种思量参究状态，只有在极静的环境条件下才能生起并且保持连续不断，才能参究出深细极深细的法理。所以真正的修行人会摒绝一切外缘，是绝对的孤寂和寂寞，孤无等侣，修道本是孤家寡人所做的大事，不是处愦闹结伴能成就的，耐不得寂寞的人走不上正修之道。禅定能降伏烦恼和断除烦恼，能获得轻安、喜悦和快乐，没有比修道更让人快乐的了，所以有禅定的人都不喜欢世间法，心不着于世间，不追求财色名食睡和名闻利养，不喜权势地位，贪于世间法实在是不明智的行为。</p><p>有的人说只要有十多分钟时间没有杂念地思惟法义，就可以证果明心，这样说简直是太胡闹了，只有这么短的时间思惟佛法根本不可能有多深细的思惟，也不可能修到参禅的定慧等持状态。就如要烧一大锅开水，需要一个小时时间，如果烧五分钟十分钟就停火，第二天再接着烧，这样连续烧一年十年也不能把这锅水烧开。这样拿佛法当儿戏，戏弄佛法的果报相当不善，佛法如果这样容易修和证，哪里还会有那么多的三恶道众生？世人都喜欢投机取巧，可是投机取巧的结果却害了自己。一分耕耘一分收获，想要有所成就，就要放舍身心，舍得下功夫才行。</p><p>十、意根恒审思量为什么还需要睡眠？</p><p>睡眠是灭除六识，让色身和六识休眠，而意根不灭也不休眠，所以睡眠并不影响意根的恒审思量，意根恒审思量也不影响睡眠。</p><p>睡眠是为了恢复色身精力，消除色身疲劳，为了六识更好更有效果的正常运行。意根把色身当作自己所有的，把六识当作自己所有的，把五阴十八界都当作是自己所有的，又依靠第八识刹那了知色身的情况。六识活动会消耗能量，为了减少能量的消耗，意根决定不让六识再活动，主动关闭六识对六尘的了别，不想再知六尘，只靠意根自己的知就行了。这样能量不断的集聚，精力恢复到一定程度，意根就会决定醒过来，接触尘境，继续五阴活动。</p><p>如果色身疲乏了，就需要睡眠，以恢复精力，意根就会决定睡觉，不让六识再活动了，意根自己想关闭六尘，不了知六尘，这样五识和意识就会逐渐灭去了。所以不是意根需要睡觉，而是色身需要休息，补充能量，恢复精力。这正是意根恒审思量的结果。但睡眠并不影响意根的恒审思量，意根可以在睡眠中继续思量，还可以现起梦境，在梦境里思量。</p></div>"
},{
    "title": "第五章 意根的警觉作用与梦",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  意根的警觉作用与梦</strong></p><p>一、意根的警示作用</p><p>问：以前心里有恐惧、害怕、焦虑的时候，总感觉有事要发生，但也不知道要发生什么，心里不安宁，结果真的有事情发生了。这是意根提前知道吗?</p><p>答：恐惧、害怕、焦虑等等这些心理现象就是意根的情绪表现，让意识觉得有什么不好的事情要发生，却不知道到底是什么事。意根能提前预知很多事情，几乎什么事都知道，就是不能亲自去应对，只有警觉意识，让意识了解了才能着手去做什么，加以筹划和安排。意根焦虑要发生的事，但不知道如何表达才能让意识知道，等事情发生以后意识才知道是什么事，但往往晚了一步，于事无补了。</p><p>有时候在梦里梦到的事也是意根在惦念着，然后要警觉意识了知，让意识处理，结果梦中的事情以后确实都发生了，这是意根的警醒作用，也叫作预知梦。因为意识聪明智慧有分析思考力，能想出解决问题的办法，并且可以采取具体措施和行动，意根无法有什么行动，因此在预知有事情要发生的时候，才会用各种方式警觉意识，提醒意识知道。意识一旦受到警觉和暗示，就有可能领悟到会有什么事发生，提前做好准备。意根如果有智慧警觉意识，就能让意识容易领悟，意识有智慧，也容易领悟意根的警示和暗示。</p><p>预知梦是意根提前让意识知道以后要发生的事情，意根能知未来还没有发生的事情，能去至未来。为什么如此呢？因为如来藏根据业种，能知过去现在未来三界世间事，意根依如来藏所见的法，能起自己的见，如来藏能见一切法，意根就能见一切法，但二者见的法本质有所不同。</p><p>二、意根对意识的警觉作用</p><p>问：我有次在一片坟地旁边挖茵陈，总感觉背后有人，但其实四周没有人，这是意根的感觉还是意识的感觉，是真有人还是错觉？</p><p>答：感觉有人是意识的感觉，这种感觉是意根传递给意识的，意识没有见到背后有人，但意根可以见到，因为无法处理此事，就让意识感觉之后再处理。如果这时候意识不懂，就处理不了。如果意识明白了背后可能会有鬼，就会做决定离开还是不离开。胆子大的，就不离开，胆子小的就会离开。当然这个胆子是指意根的，最后决定离开的还是意根的决定。</p><p>意根能知道意识看不见的人和事，包括阴界众生，但意识不知道，意根想让意识知道，意识就会起疑有感觉。如果意识有智慧，就会合理分析思惟推断，就会知道有什么事情了。</p><p>三、为什么做噩梦时一念佛噩梦就没有了？</p><p>意识在平时念佛，把意根熏成了，意根心里有佛，也懂得念佛的好处，在梦里遇见险境时直接提起佛念，念出佛名，佛名是脱口而出的，不用意识思惟再决定念佛。梦里能念佛，这是真念佛，就能感应到佛，佛力一加持，噩梦就消失了。境随心转，梦境比现实更虚幻，所以念佛心一出现，噩梦境界就消失，心境由痛苦转变为平静安详。</p><p>四、觉受与意根的关系</p><p>问：为什么做梦被迫打断了，醒来时就感觉头痛，梦做完自然醒就不头痛？</p><p>答：做梦是意根做，意根有心事不寂静，就要在梦里表现出来。梦境突然被迫打断了，意根的心意未了，就会难受，祂难受就会让头痛。这是心影响身的表现，意根高兴和不高兴，都会有所做作，在身体上就会表现出来。比如手舞足蹈、喜笑颜开、浑身颤抖、怒发冲冠等等。从这些现象上看，意根有受，而且不仅是只有舍受。梦被迫打断，立即醒过来时，也立即感觉头痛，这个头痛与意识无关，意识只是感觉头痛而已，促使头痛的是意根，祂想做的事没有做完，心里不高兴受不了，就要发泄出来。平时多念咒念佛，心里清净无事，就不做梦了，睡眠质量也好了。</p><p>五、梦境是意根思念出来的</p><p>问：夏天开空调睡着了以后，有时做梦，梦到自己走在冰天雪地中，感觉浑身发冷，从唯识的角度看，这是怎么回事呢？</p><p>答：半夜开空调睡着了，身体很冷，却没有六识来感知冷，就无法解决身体冷的问题。意根是不睡觉的，虽然知道身体冷，可是却没办法处理此事，不能给自己盖被子或者关闭空调。为了解决此事，于是就做有关身体受冷的梦，在梦中让意识感觉身体很冷，在冰天雪地里冻得瑟瑟发抖。</p><p>意识聪明伶俐一些的就会醒过来，醒过来以后知道真的是身体很冷，再观察为什么冷，知道原来是开着空调，于是就把空调关掉，盖好被子，事情处理完了，继续睡觉。意识警觉性比较差的，就会继续挨冻，直到天亮才醒过来，甚至被冻感冒。这件事证明了意根能知很多法，但没有六识当助手的辅助祂做事，祂就无能为力，没办法运行五阴活动。六识是服务于意根，为意根做事，满足意根需求的。</p><p>梦境都是意根思念出来的，意根的心理活动体现在很多方面，体现在梦境里，体现在身口意的行为造作上，体现在种种心念活动上，体现在情绪上，体现在身体下意识的反应上，体现在身体不自觉的反应上。意根与如来藏一起掌控调节着色身和五蕴，意根心思一动，身体就动，五蕴就运行起来。</p><p>普通人观察到的都是六识的表面现象，或者把意根的心行也都归类到意识上，意根和意识的心行分不清楚。当意识消失或者变得微弱无力以后，意根非常想有五蕴活动，想让五蕴正常运行起来，可是六识不出现，六识软弱，没办法让五蕴运行，意根那种捉急无力感，一般人体会不出来，即使知道也是误会为这是意识的捉急和无力，思想认知只能停留在意识上，为意识马首是瞻，无法再深入探究意识背后的意根深层次的心理。</p><p>六、梦中知梦是意识的证自证分还是自证分</p><p>证自证分是反观识心自身以及自身心所法的，自身的意思是意识了别意识，意根了别意根，五识了别五识，不是互相了别的意思。自证分是识心对相分境界的了别，这个相分包括一切法，当然也包括第八识及其心所法，就看了别的智慧如何了。梦是指梦境，是相分，知是识心的见分，识心了别尘，是见分了别相分，是自证分，不是证自证分；见分见自己是证自证分。见分与相分结合起来，才有自证分和证自证分，证自证分其实是自证分其中的一种，只不过相分变为识心自己了，自己及心所法成为了相分。</p><p>了别梦境相分的见分是六七识的见分，而且六识是独头意识。见一切境界主要是六七识的见，众生所能感觉和观察到的只是意识的见，体察不到第七识的见，咱们现在且说意识的见吧。睡着做梦时，为什么独头意识不知道是在做梦呢？因为在梦中意识昏沉不清明，睡眠本身是一种盖障，是遮障，遮蔽意识的智慧认知。</p><p>除掉睡眠盖，没有遮障了，意识清明了，就会获得初禅定；或者说当禅定越来越深的时候，睡眠就会越来越少、越来越浅，那么在梦中意识就会越来越清明，以至于能清楚地知道自己在做梦，梦中也不会造恶业，甚至能作善业。所以梦中知梦，说明六七识是具有定慧的，睡眠盖障轻微，梦中不知梦，是六七识的识性被睡眠遮盖住了，心里不清明。</p><p>梦中的知见是独头意识的见分，意根对意识的见影响很大，这里先不谈具体的影响。梦中独头意识了别境界有限，不如五俱意识有五识的辅助了别的全面和清晰。梦中不知梦，是独头意识的自证分功能不具足，智慧力弱，这与色身和意根有关。意识所有的了别功能强弱，不仅与意识自身的定慧有关，也与意根的定慧有关，与色身有关，不能脱离色身和意根谈意识的功能作用。</p><p>为什么与色身有关呢？清醒时候意识的了知受色身影响，这是大家都知道的理，睡眠中意根又不想了别境界，六识就都不生起；在做梦中，独头意识被迫生出来了别梦境，但由于神经系统活动的都比较缓慢，意识的思惟受到了抑制，认知智慧比较低，分辨不了所对的境界是梦境，就把梦境当成现实。这与醉酒时的情况是一样的，都是神经系统不活络造成的。</p><p>梦中如果意识有证自证分，那就是意识能了知意识自己及心所法，这是反观力，这要比意识了知尘境需要的定慧更强，难度要更大。如果梦中意识的自证分功能不足，证自证分的功能几乎是没有的，不会证知自身，因此不能反观，除非是禅定非常好的人，觉悟性强的人，有四禅八定的人梦中的反观力就更好了，但是禅定深的人几乎没有梦。</p><p>意识的几种功能作用的强弱，不仅是意识自身的定慧问题，更是与意根有关。虽然从古至今，几乎没有人能认识和观察到这个问题，但是意识的功能作用确实是都与意根脱离不开，二者相辅相成。脱离意根谈意识，那是舍本逐末。</p><p>七、为什么梦中不知梦？</p><p>梦中知梦是谁知？醒时知尘是谁知？梦里梦外六、七识都有知，知一切法以六七识的知为主，五识只能知现实中的五尘境，不能知梦中境，因为梦中无五尘境。意识的知性与色身有很大的关系，色身有阻碍，意识的知就弱或者断灭。有四禅八定的人，色身没有阻碍，意识的知是清明的广大的，无论睡着与否都能很清明地知，即使喝多少瓶酒，也不会醉，酒不再能麻痹大脑中枢神经系统了，因此意识就不受影响。</p><p>意识的知也与意根的知关系很大。一般来讲，意根知一切法，只不过涉及到是否能如实知的问题。意根能如实知的这部分，如何能影响到意识，让意识也知，并且及时处理所知，那就涉及到两个识之间的沟通能力了。所谓的沟通能力就是智慧，意识所知的如何能有效的影响和引导意根，也是涉及到沟通能力，就是智慧如何。智慧又与禅定密切相关，禅定能使心安静、平和、沉稳，思考能力增强，智慧力大，这样两个识互相的影响力就大。禅定又能使色身无碍，色身无碍，意识没有阻碍，知的就灵敏通达，就能有效影响到意根。反过来，意根也能有效影响到意识，二者互通有无，知一切法就通畅、阻碍小。</p><p>醒梦一如是修行出来的智慧境界，知是梦，不被梦境所困即是智慧，这个修行主要是指禅定的修行，禅定是必不可少的修行环节，有禅定才能开发出智慧，使得六七识的知更如实如理，知的更真更细更广大。而除去睡眠盖，才能发起深禅定，禅定深一些的人，清醒时思惟清晰，梦中也不颠倒，同清醒时一样，了知境界无碍。</p><p>普通人的知都有障碍，就是俗语说的没有神通，而有神通的人的知就无障碍，有他心通、天眼通等等，这就是定慧的功德果报，梦中知梦就是禅定非常好的人心清净了所得的果报。济公和尚有四禅八定，有神通，无论他喝多少酒，他的神经系统不会受到影响，不麻醉，他的意识永远是清醒的，能如实观察和知一切境界。普通人睡着以后意识灭了，意根依靠意识了知境界这部分功能就不起作用了，所以做梦时意根辨别力微弱，不知是梦，梦中的独头意识辨别力也很微弱，也不知是梦。而有修行的人，禅定力强，色身无碍，六七识清明，分辨力就强，在做梦时就知是梦，不迷惑。</p><p>窥基大师有四禅八定，有神通，晚上睡觉时非常清明，比普通人清醒时还清明，六七识敏锐，睡着以后一个虱子腿掉了，疼得直叫，窥基大师都能听到，这是禅定力神通力的功德。睡着时能听到虱子的叫声，是不是说明他并未睡着？对于普通人来说，睡眠是一种遮盖，能遮蔽其心不见不闻，犹如死人一般。而灭掉了睡眠遮盖的人，所需很少睡眠就足以滋养色身了，禅定会达到初禅以上，其心清明，遮障轻微，或者完全没有遮障，在睡眠时未必是完全断除意识，但睡眠也充足，这与普通人有所区别。</p><p>尤其是有神通的人，其睡眠如清醒时一样，甚至比普通人清醒时还清明。古时有武功的人睡眠也轻，警觉性高，这个警觉性可以说是意识的，但是意根确实也有警觉性，祂的警觉比意识的功能作用还很强，所以离开意根不能把意识的功能作用说清楚。睡眠与昏沉同类，都属于盖障，能遮蔽识心的光明，当睡眠盖障消除以后，初禅定才会出现。睡觉时越昏沉，说明禅定功夫越不好，或者没有禅定，盖障重；梦中越迷惑，越没有禅定；喝酒越容易醉，色身阻碍越大，越没有禅定。禅定功夫深的，能把色身调理好，不受环境因素影响，不障碍六识功能作用的发挥。所以定力非常重要，即使不学佛修行，禅定修好了，受用也非常大。</p></div>"
},{
    "title": "第六章 意根的习气与受熏",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  意根的习气与受熏</strong></p><p>一、酒品人品就是意根的品质</p><p>酒后的状态反映的是意根的习气，是意根本来的面貌。喝酒以后麻醉了脑神经，五根作用力弱，出生的六识了别力弱，这样六个侦查员不能如实侦查六尘境界，意根就切断、半切断了信息来源，意识的参谋助手的作用也不大了，意识的思惟力弱，对意根的督导、引导和监管力度弱，意根就按照自己的本性行事。这时全靠意根自己的智慧，意根的本性、品质就完全显露出来了。酒后吐真言，就是喝酒以后所说的话，完全是这个人意根的心声，是这个人真实的想法，没有了意识的遮掩和作假。人们常说的酒品和人品，就是指意根的品质，这是一个人的本来面目。</p><p>二、意根的本性 </p><p>净和的经历体验：有一天我坐在椅子上带着耳机听大悲咒，听着听着睡着了，没有做梦。这时眼前（其实不是眼前，因为没有方向感，但当时并没有意识到没有方向感，好像茫茫宇宙当中。）一片黑暗中似乎有点动静，一种好奇心生起，想弄明白原因，这时这个动静变成一点亮光。</p><p>我（当时是没有我的概念的）继续趋向亮光，就在我接触到亮光时，意识产生了，明白了那个动静原来是耳机大悲咒的声音。（这时突然意识到：原来有个东西从身体进入了大脑，五官就产生了功能。）然后回忆意识产生之前的状态，好像是不懂事的小孩子，或是小动物一样。有个动静一勾引就跟着走了，没有一点反省能力。</p><p>评：睡觉时的眼前不是眼前，而是意根相对的法，因为这时眼识意识即使不灭，也非常微弱了，没有前后的方向感，意根对法不能明确的知，所以就感觉茫茫的一片。有好奇心生起趋向亮光的正是意根，这是意根要缘法了，但不知道自己要缘法，对自我感知力弱，缘到大悲咒的声音时又辨别不清楚，只能感觉亮光，因为大悲咒有加持力，就好像亮光一样。</p><p>意根刚缘到大悲咒的声音，刚刚感觉到亮光时，微弱的意识出现了，意识了别出这是大悲咒的声音。当意识了别到声音时，意根已经感觉到亮光（声音）进入大脑，意识瞬间就明白了，这时五识出现，就清醒很多了。清醒之后意识回忆刚才的过程，感觉意根就像小孩子似的，没有定力，随着出现的动静就好奇的跟过去，非常单纯幼稚，也很伶俐，哪有事哪到。当然意识的回忆，也是意根想明白刚才的事，让意识回忆，回忆意识出现之前的事，是靠意根提供场景素材，意识（也就是我们）才能明白刚才到底发生了什么事。</p><p>这段正好准确的描述了意根的心态，单纯幼稚原始，没有自制力，需要意识照管和牵制，需要意识督促和领路。好好体会这段对意根的如实描述，品味意根的特性，多了解意根体性。</p><p>三、业种与习气的关系</p><p>业种与习气的关系，其理非常深奥，属于唯识种智范畴。习气是久习之法成了气候，成了习惯，就以此习惯主宰身口意。造作业行之后，再存入种子，就加深、加重了业种，导致今后的习气更重。</p><p>习气也是由业种而来，既然久之成习，必然有业种。习气由意根兑现出来，意根主导六识的身口意行，造作之后存入业种，后世现行，叫作习气。业种，是由意根主导造业形成的，意根完全与业种相应，意根是什么性质，业种就什么性质；业种是什么性质，意根就现行什么性质的业行。要想留下无我的业种该怎么办呢？要想形成无我的习气该如何修行？后世要想生来就看空五阴世间，今世该如何修行？</p><p>须菩提在母胎里，就知道世间空寂，这个习气有多深？修行证得了空的时长超过了无量劫，这么长的时间里心都是空的，当然空的良好习惯延续了无量劫之多。须菩提的心空的习气与今世意识的熏习没有一点关系，在意识没有出现的时候意根就是空的，这样的心空该有多么的轻松自在解脱。</p><p>理论上的空，当面对俗法时就不空了，死的时候也不空了，死后更不空了，后世更无法空了，所以理论上安住在什么如梦如幻，什么真如法性，那都是自欺，什么事用都不顶。事到临头，该怎样做还怎样做，临终该怎么死还怎么死，解决不了生死问题。理论上的这些明白，一遇事情就会现原形，就会原形毕露，所以才说不顶事。意根证得以后，形成业种，生生世世得受用，遇事也不回原形，受生时也不迷。如果住胎时也不迷，出胎时也不迷，成长过程中也不迷，那就是恒时解脱的。</p><p>四、什么叫作熏意根？</p><p>意识对法的思惟，形成了自己的思想、观念、见解和知见，这同时就有对意根的熏习作用，思惟的过程就能熏到意根，意识专注的思惟更能深入意根心中，熏的效果才能明显。如果引起了意根的注意和正视，就是最初步的效果；如果意根生起了警觉和思，效果就显著一些；如果意根思的专注和深入，又如理如法，熏的效果更明显了；如果意根的思有头绪了，效果就显现出来了；如果意根思出法的意味了，并且有了初步的抉择，真正的效果就出来了；如果意根得出非常明确而如理的结论，非常坚定的认可自己所思，并且作出了相应的抉择和判断，就可以说熏染成功了。意根转变了，以后的一切心行都会转变，围绕着意根的判断和抉择而转，就熏到家了。</p><p>五、六识的身口意行是由谁主宰的</p><p>六识造作的事相，是后面第七识意根作主决定的，也代表意根的心行，意识表面的行为造作、身口意行，后面都有意根做主宰。身口意行可以依意识的决定，但要意识的力量大于意根，有说服力才行，意根愿意听从意识的建议和牵引才行。如果意根的力量大，不愿意听从意识的建议，那就完全由意根作主宰作决定。比如杀生时一边杀一边怜悯众生，就说明意识的怜悯仍然抵不过意根的杀习，仍然依着意根把杀业造了。</p><p>意识暂时拗不过意根，等到意识再强大一些，更加懂法懂因果，说服力就大了，把意根说服了以后，就不再造杀业了。意识没有把意根熏染成功时，就会一边顺从意根造杀业，一边心生怜悯。意识本身善心所法还不够坚固和强大时，引导不了意根，拗不过意根，就会一边造善业，一边贪嗔嫉妒，唯利是图，只想利己不想利人。意识善心所法不够强大坚固，没有完全被熏成功时，四正勤就没有修出来，意根的未生善就不能生，已生恶就不能断，不能断恶修善。</p><p>六、管理好身口意行的关键是调伏意根</p><p>管理好自心意根，就能管理好六识的身口意行。阿罗汉的意根早已得到调伏，断除了烦恼，对于世间无可留恋和贪爱，从三果开始就心得解脱了，身口意行清净。平时出外托钵乞食，眼看前方一尺之地，低眉顺目，不顾左右与他方，眼不乱触，心不乱想，一心或无心。当眼睛不得不触色尘时，知色即止，不生受想，更不生取，不留业种，不受后有，四大威仪感动人天大众。</p><p>如果有外境熏染，意识都不受熏，意根就更不受熏，即使意识有微动，意根也不动，烦恼断尽故。阿罗汉们不用意识去督促、监督和调控意根，意根反能调控意识。而修行比较上路的凡夫众生，必须用意识时时处处督导意根、调控意根，限制意根，因为意根没有受熏，不调控就会犯人苗稼，本性就暴露出来了。所以总用意识提醒自己的人，修行还差得远，至于连意识都迷茫不清醒的人，根本就谈不到有什么修行了。只有意根受熏之后，破除了无明，身口意行才能逐渐清净，自动自觉，不用看护。</p><p>七、诸佛菩萨为什么不受恶熏</p><p>如果众生处世之中，遇到恶缘还会受到熏染，从而出现了烦恼，说明众生的意根是与烦恼相应的，还没有断除烦恼，所以遇缘就染，遇缘就现恶业。诸佛经过三大阿僧祇劫的修行，早已经断尽了贪嗔痴慢疑恶见等一切烦恼染污，以及一切烦恼习气，无复余习，来到五浊恶世，与诸烦恼众生相接触，根本不会受到众生烦恼的一丝熏染和染污，心地永远是纯净无染的。因为佛在初地时就断除了烦恼，心地已经没有染污了，只是那时候还有烦恼习气未断尽。</p><p>诸佛在初地之前就开始断除的烦恼，是六七识都断除的烦恼，因为第七识断除了烦恼，才能转识成智，具有了平等性智，观一切法平等无二，无自他之别，所以没有私心，平等待人对事。因为第七识意根断除了烦恼，后世不管再出生于何处，意根都没有烦恼，不受熏染。但烦恼习气没有断除时，习气偶尔会现行出来，这是难免的，意识偶尔也会受环境熏染。虽然意识会受熏染，呈现出一些烦恼，但是会很快消除，不会持久和坚固，也不会熏染影响到意根。</p><p>因为意根不受熏染，本身又没有了烦恼，所以意识的烦恼才易断，否则意识受意根左右，烦恼不容易断除，即使断除也会再生起。八地以上的菩萨，意识就不会再受熏染了，不会现行烦恼习气，诸佛的意识更是不受一丝熏染和染污，烦恼和习气都不会出现，见色不贪，见财不爱，不求权势和地位，不嗔不怒，不烦不燥，心地柔软调和，寂静极寂静。而凡夫众生的六七识则具足一切烦恼，遇缘就受熏染，往往总是随顺于环境，对于环境没有多少抵抗力，见色则爱，见财则贪，喜欢权势，追求名利，逆缘现前嗔怒常随其心，私心我心极重。</p><p>由此可见，凡夫众生的意根具足贪嗔痴慢疑恶见一切烦恼，意识随于意根，烦恼也会常常现前，遇到染缘，意识很容易受熏。因为意根连接前后三世，又具足一切烦恼，所以才生死轮回不断，在中阴身以及后世一出生时就具足一切烦恼，与前世无异，生生世世烦恼不已。但除了我见、我执、我慢和我痴烦恼一直恒常伴随着意根不断的运行，没有暂停时，其它的烦恼则不是恒常伴随意根运行，而是遇缘才会现行出来造作恶业，存留业种，以延续后世的生死轮回。</p><p>八、如何调伏熏染意根减轻烦恼</p><p>净和的观行：我最近对意根的体会也有一点小收获，就是感觉意根的”动作“是分层的，祂在五俱意识产生之前主要是疑性，在五俱意识产生之后才表现出明显的贪、嗔等性。在日常生活中一般要到贪、嗔等习气产生后才能反醒过来，在坐中尽量是在五俱意识产生之初就反醒反观。但这个反醒放下的过程，一般都要用意识来做一些引导，并不能做到反醒后马上就放下（这就是意根对五蕴的空性还没有完全认同），现在苦恼的就是这个。</p><p>评：意根最初的疑，是对法的不确定性，所以还不能作出抉择，一旦内心确定不疑了，就会有一个抉择，抉择之后六识出生按照意根的想法去造作。在造作过程中，意识会对法进行观察，观察中会发现自己有贪嗔痴，这个自己就是指意根。意根的贪嗔痴要通过六识的造作反映出来，这时独头意识是有观察力或者是反观力的。一般来说，独头意识觉悟不太强的时候，都是在身口意行造作完成之后才观察到自己的贪嗔痴习气，这就晚了一步。如果独头意识觉悟力强，在要决定造作的的时候，就发现自己有贪嗔痴，要造作的是贪嗔痴业行，并且决定不造作，这个决定反馈给意根，意根再作自己的抉择，最后结果怎么样就看意根的觉悟了。</p><p>如果意根觉悟性不强，习气重的话，还是会坚持自己的抉择，不想改变身口意行，让烦恼继续现行。但是即使这样，独头意识的反观仍然是有效果的，给意根埋下了一个种子，熏染了意根，让意根知道这种行为是贪嗔痴，是不好的，不应该做的，下次意根再想现行烦恼的时候，心里就有了迟疑和障碍，烦恼的力度会减轻。意识多次的阻止和劝导，意根的心意就会改变，不再延续烦恼的造作。所以修行不是一朝一夕的事，意识的每一次反观，都是对意根的熏染，都会埋下消除烦恼的种子，这些种子早晚都会生根发芽，开花结果。意根累生累世的烦恼堆积如山，不是短时间就能改变的，有耐心的熏修是必要的，应该经常保持觉悟。</p><p>九、对理论的熏习层次</p><p>学习和修行分为两个层次，最初是在意识的浅层次，最后才能达到意根的深层次。任何一种理论知识的学习，首先都是意识开始学，最初还达不到意根那里。意识一边学一边在熏意根，熏成功了，就把理论知识掌握到手了，变成了自己的真知灼见，成为了自己的学问和技能，随时随地都能得到发挥，没有障碍，也不会忘记。只有意识掌握的知识才会忘记，因为那是学来的，是别人的东西，不是自己的，属于自己的东西是不会忘记的，也不用特意去记持，随用随有，这叫作自心流露，不是鹦鹉学舌，在佛法的修证上也有人说是自性流露。</p><p>十、意根受熏后的觉受</p><p>问：弟子思维色身苦空无常无我，思自己思他人，生老病死吃喝拉撒，身不由己，平常走路思维不深，静下来思维时，感觉身心有喜悦觉受出现，好像进去一个新天地，身心进了另一个境界一样，很喜欢这个感觉。这个觉受是意根受熏了一点吗？</p><p>答：这是七觉分中的喜觉分，正是在佛法熏习过程中的一个好的现象，意根受熏才有喜觉分出现，有喜悦才能坚持长久修行，之后就会有倚觉分出现。发自内心的喜悦都是由意根受熏而来，表现在色身上和意识心上。意根受熏才有身心上的各种变化，包括苦乐的觉受，以及不苦不乐的觉受，因为意根有了新认知，思想观念转变了，就会促使身心转变。经常思惟观察五阴无我以及其他佛理，意根和身心变化就会越来越大、越来越多，最后由量变到质变，脱胎换骨，鲤鱼跃龙门，转凡成圣。</p><p>十一、意根受熏的程度有深浅不同</p><p>问：如果听了一个知见，学了一个法，比如五蕴虚妄、无常空无我，心确实在生活中改变了，无论是工作生活的大方向调整，还是再见到之前贪爱的不太贪着了，感觉很淡薄，这算是意根的转变吗？</p><p>答：这是处于修行三十七道品阶段的改变，修行比较得力了，一个受熏了，心就开始转变了，转到在八正道上，降伏了一些粗重贪的的烦恼。身心世界转变了，就是意根受熏而转的，就是说在修行的任何阶段，只要意根受熏，修行就见效果。三十七道品也要修到意根这里，否则就是假修行，还没有上道。但是这种身心转变还不足以转变到脱胎换骨，以至于能够断我见。所以很多自称断我见的人，在断我见之后身心各方面都没有多少改观和变化，骨头没变，凡夫胎就不能换成圣人胎。</p><p>在证果之前，佛法都要熏习到意根，意根受到善法熏习就会有所改变，身心就会发生变化，证果的当下更是如此，那才叫作三昧力。如果在学习佛法过程中，没有熏习到意根，只是意识对知识的吸收和理解，意根还会一如既往，不会有身心世界的转变，那么断我见和证果就遥遥无期了。</p><p>在证果之前即使把意根熏习了，但没有达到一定程度，也不能断我见证果。所以身心的转变，身口意行的转变，断我见和明心见性都必须把意根熏染到相当程度，意根只改变一点都不行。脱胎换骨，必须彻底转变意根，消除意根烦恼染污心，断除欲界五品思惑烦恼。这样业种存入第八识中，后世才能保证往生人天善道，不入三恶道。还有人抱着意识证果的顽固态度，跟意根证果的观念相对抗，顽抗不化，死犟死犟的，真是无可救药了。</p><p>十二、意识应该有效地熏染和改变意根</p><p>不少人在面对境缘时不自觉地表现出喜怒哀乐的情绪，过后才发觉，就说喜怒哀乐是老早就安排好的，是不由自主的。其实都是意根的烦恼习气，是意根自然的反应，依靠六识表现出来的。情绪显现出来过后，意识觉悟明了了，才发现了自己刚才出现了喜怒哀乐。当意识发现了以后，就觉得好像不是自己能控制的，不得已才说这些情绪是早就安排好的，是不由自主的。如果意识的觉悟性高一些，定力好一些，观察力强一些，是可以观察得意根的一些情绪和心理状态，并且可以稍微控制一下情绪。尤其是在平时应该多做自我教育，以此熏染意根，改变一些意根不该有的烦恼习气。</p><p>有的人意识的思想情绪也不正，没有能力自我教育，进行有效的心理建设，就借口说意识这么折腾也折腾不出意根习惯的圈子。如果意识怎么折腾都跑不出意根习惯圈子，修行还有什么用？修行就是要用意识来改变意根，意识好好折腾折腾，意根就不得不随顺意识，修行就上道了。</p><p>由于意根的各种心行、思想情绪，引生出种种身口意行，如果想要有清净的善的身口意行，就要充分发挥意识的能动性和引导作用，积极地引导意根向善，造作清净身口意行和有福德的身口意行。如果意根习性太重的话，意识虽知恶而不能改，就像毒瘾发作一样，虽知毒害己，却仍然要吸毒。众生烦恼重的时候，虽知是烦恼，虽知烦恼有过患，却仍然烦恼不止。这是最初基学人的状态，修行的路还很长。</p><p>十三、念佛三昧是意根的念佛功夫</p><p>脑子里不自觉出现的念佛声是如何生起来的？是谁在念佛？不自觉出现的念佛声，都是由意根发起来的，是意根在念佛，一开始意识觉知不到，等觉知到以后，又控制不住，不得不随着听佛号声。自觉是意识自己的觉，不自觉就不是意识自己的觉，而是意根的觉，意根的行为。这种念佛三昧是禅定境界，这个定还比较牢固，借着这个三昧境界，再观行四念处，心也是清净的，容易观行。</p><p>不自觉出现了念佛声音，而且连绵不断萦绕在心间脑子里，这就是念佛三昧。种种三昧都是由意根发出来的，为什么意根能发起三昧呢？念佛功夫不纯熟的，就不会有念佛三昧出现，各种观行功夫不足的，也不会出现三昧境界。所谓的功夫纯熟，是指由于长期坚持一种修行，成功地熏染了意根，意根被熏成就了，就会自动自觉地念佛和观行，就出现种种三昧了。各种三昧的出现，不由意识决定，不受意识控制，意识只能被动接受，被动融入三昧境界当中，去体会三昧和身心觉受。</p><p>十四、对牛弹琴</p><p>琴曲虽然悠扬雅致悦耳，而牛很愚笨最初会听不懂，更欣赏不了。因为意根这个牛无明太重，无始劫以来在生死轮回中极大多数时间都在受苦报，没有机缘熏习世出世间真谛，所以从来不懂得解脱之理。尽管佛法是这样的美妙，可是意根却不知不觉，不解其义，甚至也不求解脱之法，意识对于意根的熏染就如对牛弹琴。</p><p>这时候意识就要训练自己弹奏技巧，并且耐心的长期弹奏下去，终有一天意根牛就会明了其中的韵味。意识要加强训练的功夫，是要做到不管弹奏什么曲调，保证意根牛都能听得懂，这是非常不容易的，要下一番苦功夫。等牛听懂曲调以后就好办了，修行就会顺风顺水了。</p><p>十五、什么叫作刻意？</p><p>刻意是意识压制意根、调伏意根、调控意根、熏染意根、带动意根、引导意根、规劝意根，这时候意根还没有被熏，没有养成良好习惯。等到意根被熏成功，养成了良好的习惯，老牛听话就会改了牛脾气，意识就不用再管理意根、压制意根、调伏意根了，不用再刻意的去做什么，可以随顺于意根的良好习惯，不会违越规矩。</p></div>"
},{
    "title": "第七章 现量、比量和非量的区别",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  现量、比量和非量的区别</strong></p><p>一、现量、比量和非量了别所运用的心所</p><p>三种了别当中，五十一个心所法不一定要用到哪些，具体情况要具体分析，情景不同，用的心所法就不同，不同的人由于种种原因用的心所法都有差别，即使是同一个人，不同时间和场景，不同的身体状态和心理状态，不同知识水平，不同的智慧水准，所运用的心所法也不相同。五遍行心所法都会用得到，五别境心所法不一定都用得到，善十一心所法不一定出现，根本烦恼和大、中、小随烦恼心所法也不一定能出现，都视情况而定。</p><p>现量了别需要有足够的数据，那就需要很深的智慧，胜解心所法要非常强，定心所法要现前，念心所法要具足，做到心心念念无间。比量了别相对来说智慧浅一些，必须通过比对，不比较没有参考就不知道，如果没有相对的缘，就无下手处，而现量了别不用比较直接就知道，或者是当下就知道，根利一些。非量了别是实在找不到证据了，在没有足够的数据，也没有比对对象的情况下，不得不运用想象、猜测、推理等等手段，用的方法比较多，用的越多说明智慧越有限，胜解力越弱，当然定力和念力都不足，以至于不能直接加以判断，不能直接得出结论。</p><p>比量好比是一个人能力不足以单独完成一件事，不得不找人帮忙才能搞定。非量是连个可以帮忙的人都找不到，不得不一个人左搞搞右搞搞，也许凑巧能搞对，即使搞对了，智慧也不足，不属于现量。就像看不见别人现在穿什么衣服，又没有对照的，就不得不想象猜测，即使猜对了，也不是直接见到的。</p><p>有的人智慧不足，不懂得如何引导他人一步步修证以求现量见道，却还要去引导，就采取排除法。比如此地有五条路通向城外其他五个地区，其中只有一条路通向北京，他不会引导人如何正确的作以抉择，就采取排除法，先是指着第一条路，对方犹犹豫豫的指了又指不敢确定，就看他的眼神暗示说不对，然后选择第二条路。对方再看他脸色觉得也不对，于是就排除掉第二条路，这样就把四条路都否决掉了，只剩下最后一条路。对方就说就是这条路，是这条路通向北京，于是这个人就说：这可是你说的，不是我指教的，恭喜你见道了。大家说说，这就算见道了吗？这样的见道生出什么智慧来了？坑人者误人子弟者，就是此种人也，不折不扣的骗你没商量，对方也被骗的欢欢喜喜，愚痴人一双！</p><p>二、现量与非量的重大问题</p><p>昨天有人根据各项数据指标，分析预测今天股票会上涨10%，结果今天确实上涨了10%，一点不差，很准。这个人昨天的预测是现量吗？这个人根据今天股票的走势和技术数据指标，分析预测明天股票会下跌2%，等明天一看，果然股票下跌2%，那么这个人今天所分析预测的是现量吗？都不是现量，预测的都是非量，即使数据再准确无误，股票行情也不是亲眼所见，因此不是现量。依靠数据指标推导、思惟、分析、推测、推理，就是非量。我预测你明天要干坏事，但是眼下你毕竟没有干坏事，所以干坏事不是事实，是独头意识预测、推测出来的，因此不是现量，是非量，现量是当场见到他正干坏事，但实质上他是在干好事，你所见也是非量。</p><p>我两只手握拳，一个拳头握有一元硬币，一个拳头是空拳，然后伸出右拳，问一个人：这个拳头里有没有硬币，对方想了想说：有硬币。恭喜他猜对了，但即使如此，也是非量，不是现量。因为这个答案不是他现量观察得到的，而是猜测出来的。如果说是现量观察出来的，他并没有看见拳头里有没有硬币，如果有神通，天眼所见也是现量见，可是他又没有神通，那么肉眼看不见的就不是亲见，那只能是猜测、臆想、推测的，是非量。没有见到事实，就是非量，不是现量。</p><p>究竟什么才是现量，大家现在能否真切的理解了？现量是现前存在的法，亲眼所见了，见的真实无误，这才是现量观察，有现量智慧认知。如果不是现实存在的法，不是现前见到的法，仅凭独头意识思惟推测想象出来的，纯粹是非量。股票行情现前不存在，得第二天才能见到，现在的观点结论不是亲眼所见得出的，心里的推测预估当然是想象的非量，预估再准确，也不是亲眼所见，不是现前观察股票大盘走势所得，所以百分之百是非量。</p><p>同时也不是比量，因为没有法与法之间的平等比较，比量是两个法或多个法互相比较而得出的结论，是两个以上的法并存关系，能互相比较，不比较就无法得出结论，也不能做决定。亲眼所见和想象，其智慧认知、心境和觉受能一样吗？正在看着亲人渐渐死去的场景，和想象亲人以后的死去场景，心境和觉受能一样吗？想象亲人的死，虽然任何人以后必死无疑，毕竟亲人现在还活着，和亲眼所见的死，心境觉受能一样吗？</p><p>不少人根据所学的如来藏理论，根据所学的如来藏种种功能作用和体性，推测出如来藏就是在某处某界某根某法，起某种功能作用，然后就认为自己亲证了如来藏，开悟明心了，成为圣人了。这个误会简直太大了，后果也相当大。就像一个贫穷下贱人，想象自己当了帝王，把这个想象境界当真，就说自己是帝王，结果真帝王知道以后大怒，派兵把他抓起来就斩首示众了，并且株连九族。想象出如来藏起某作用，然后说自己是开悟的圣人了，后果要比斩首示众严重得多，修行不得不谨慎。</p><p>大妄语的问题出在哪里了呢？出在不懂现量与非量的区别，不懂得什么才是现量观察，不懂得推测分析思惟出来的实质是非量，不是现量观察，现量与非量不会区分，这个问题就很严重。有不少人不清楚自己得出的结论是猜测推测出来的，根本不是亲眼所见的现量见，所以当自己推导出一些结论时，就认为自己现量证了，实际上根本不是，是非量想象和推测推理。尤其是没有禅定的人，都是意识的推导作用，即使有禅定或者禅定浅的人，也有意识的推导作用，即使禅定深的人，在思惟的时候正好不在甚深的禅定中，而用了意识的思惟，也都是意识的推导作用，所以说不见得有禅定就一定是现量证。</p><p>三、法住智能知过去和未来，这是现量知还是比量知和非量知？</p><p>有法住智就能得解脱，所以法住智是现量证得十二因缘法的智慧，即使能知过去未来，也是现量知，没有比量。比量而知的智慧很浅，必须依靠某个法才能知的智慧是不可靠的，不究竟的，一旦所依的法不出现，比量知就消失了。比量知当中，没有意根亲自参究的过程，所以意根不能亲证，意识也不能独立知。推理当中有一部分属于比量，有一部分属于非量，即使推正确了，也不是现量，因为意根不知。意根的知，要知就知，不知就不知，非常快的就有了分界线，当下呈现，不用意识慢腾腾的思惟研究。</p><p>有人说既然不能见到过去和未来，过去和未来的法不能现前，对于过去和未来的法应该就是比量知，这样的说法是不对的。所谓的现前不一定非要出现在眼前，智慧不是由眼识发起的，是由意识和意根共同发起的，意识和意根完全可以证知证实过去未来的法，尤其是意根根本不受时间和空间的阻碍，随着如来藏能知一切法，过去世的法说想起来就能想起来，未来世的法说了知就能了知，梦境定境就说明了这点。所以说意根不知的就不能是现量智慧，意识现量知时，意根不一定现量知，意识的知就会随着不同的因缘而被忽视和取消。</p><p>四、意识单独对法进行思惟分析理解推理而知，是现量智慧吗？</p><p>意识思惟推理得出的结论，不是实证出来的，不是亲自证得的，没有真实可用的证据作以资助，内心的疑惑并没有断除，到一定时候遇到与此相左的事实，就会反悔和推翻自己从前的结论。而意根内心深深的疑惑，意识没有智慧时根本发现不了，所以意识的推论不能断疑，不能令意根生信，那就没有实用和受用。</p><p>即使推理结果完全正确，百分之百正确，也是非量。为什么？比如说你推理我一定偷了你的东西，实际上我也确实偷了，但是你没有亲眼看到亲手抓到，你的推理就没有用，法院不会依据你的推理和谁的推理给我定罪判刑。即使我自己承认自己偷了，而拿不出有力的证据证明自己偷了，法院也不能判罪。有些人为了开脱与自己有缘的人的罪业，而自己愿意去代替其受罪受罚，如果没有真实有说服力的证据，即使到法院去认罪，承认是自己亲自造作的罪业，与他人无关，法院也不能依据一面之词而定罪判刑。</p><p>在佛法上如果没有禅定的时候，在五阴十八界活动中推出了个第八识，想象到了第八识有某种作用，有某些作用，但是由于没有亲证证得，这种推理就没有功德受用，不会改变什么，照样我见犹存，照样有三缚结绑缚自己，免不了命终三恶道的果报。允许你把第八识推对了，允许你想象出五六成，六七成，七八成，但是仍然不会出生大智慧，仍然没有三昧境界，仍然没有功德受用，仍然是凡夫，永远不会因此想象和推理而断除无明烦恼。</p><p>历劫历代的祖师们所用的修行方式和方法，所走过的路，绝对正确，符合现量，成果真实可信，对佛教都有极大的正面影响和推动力，祖师们的开示都显示着修证的真理，都是实践出的真知。后世众生由于福薄障深，无法像祖师们那样舍出身心的用功办道，多是投机取巧心理作怪，都想走捷径。修行就是要舍弃自我，不计一切代价，哪里有什么捷径可走？少走一步路，就会少得一份功德，少一份身心体验，多吃一份亏，实际上这是自欺再欺人的做法。如果有捷径可走，难道佛陀不会告诉我们引导我们吗？众生这样苦，佛陀难道不希望众生尽快成就佛道，少走弯路吗？</p><p>凡是不符合佛陀教法的修行，违背佛陀本怀损害众生利益的修行，到最后都会被毁灭和剔除出佛教，只是时间早晚的问题。</p></div>"
},{
    "title": "第八章 意根心所法",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  意根心所法  </strong></p><p>一、五遍行心所法的运行 </p><p>五遍行心所法中的一切俱，是指五遍行心所法与一切识心俱，与一切法俱。只要有识心在运行，一定有五遍行心所法在运行着，离开五遍行心所法识心无法运行，不能存在，不能有了别活动。那么在一切法上，也有识心的五遍行心所法，因为在一切法上一定至少有第八识和第七识的运作，五遍行心所法必然要伴随着两个识运作。</p><p>五遍行心所法互相俱生的意思是，这些心所法是聚集在一起出生运行的，比如第八识要出生一个法，五遍行所有心所法都要伴随第八识至始至终的运行，一个都不缺少。而六七识则不一定，六七识作意以后，如果不感兴趣，就不会触，尤其是第七识意根；触了之后，未必要受，尤其是第七识意根；受之后未必要想，尤其是第七识意根；想之后未必要思，尤其是第七识意根。意根心所法如果不往下运行，六识就不能出现，出现也会消失停止运行，尤其是意根的思心所法不出现，六个识都不能出现。可见意根的王者统治地位，祂的权利有多大。</p><p>佛法甚深，思惟稍微不得力，就会出现偏差，而极大多数人思惟都是有偏差的，自己无法发现。就是因为自己思惟不得力，没有办法只好百分之百信受名人的言论，依止一个现成的答案，以为究竟，认为这是保靠的，错也不知。这是目前佛教界极其普遍的现象。</p><p>二、意根的受</p><p>意根不仅仅只有舍受，还有苦乐受。因为意根有无明和烦恼，有善恶心所法，就一定会有苦乐受，由于苦乐受而生起贪和嗔烦恼。意根如果只有舍受，被人打骂欺辱都会无动于衷，虽然意识有可能心里不好受，但一会儿就过去了，不会有什么报复的作为，这是大修行人的良好修养和品德，一般人根本不具备。意根如果只有舍受，被赞叹捧上天，都会无动于衷，在权色名利面前仍然会无动于衷，不会去追逐权色名利，淡薄荣华富贵。虽然意识有可能喜欢这些，但也仅仅有点喜欢罢了，不会有所作为，付诸行动。这是大修行人的德行修养，一般人根本不会这样。</p><p>因为意根对六尘境界的领受很多时候需要借助于六识，六识对境界有明显的了别功能作用，所以受也很明显和直接，而意根的受就显得间接一些，隐晦一会，不容易被意识发现，因此就说意根没有受。对于色身上的受，是意识和身识直接领受的，色身上的疼痛和舒适是身识和意识直接感受到的，没有六识的时候，色身上的痛触和乐触，意识和身识都没有感觉，但是这时候意根是否有感觉呢？意根肯定有感觉，所以在昏迷和睡着以后，意根才会唤起六识去了别，并且想办法处理色身上的问题。即使没有唤起六识清醒过来，在昏迷和睡眠中，色身上的面部表情和身体姿态也说明了意根有觉受。</p><p>众生都是以六识的受为受，意根的受就体会不到，在意识智慧不足没有道种智的时候，也观察不到意根有受，所以众多人都说意根无受也就不奇怪了，但这不是正理。五遍行心所法是作意、触、受、想、思，意根也有五遍行心所法，所以意根一定有受。</p><p>三、意根的舍受</p><p>舍受是不感觉苦乐受的受，说意根是舍受也有一部分道理，意根对于身触是舍受的，不直接感受六尘境界。无论色身如何疼痛，意根不会感受到疼痛，是身识和意识感觉疼痛，没有身识和意识的时候，色身就不会感受到疼痛。比如说动手术的时候，如果有身识和意识存在，人就清醒着，一定会非常疼痛。为了灭除痛觉，就要打麻药，让身识先灭去，再让意识灭去，这样开刀色身就不觉得疼痛了。</p><p>牙疼的时候，睡着以后六识灭去就不觉得疼痛了，但是牙的炎症还存在着，醒了就会接着疼痛，有时候半夜还能疼醒。为什么半夜能疼醒过来呢？在昏迷时虽然身体很糟糕，但是却不觉得疼痛，醒过来就会感觉疼痛难忍了。在地狱中受报时，疼痛得昏死过去才不感觉疼痛，但是业力不会让罪人昏死过去，业风一吹，罪人就会清醒过来，继续受报。在禅定中痛觉也会减轻或者消失，因为六识或者消失或者微弱。</p><p>所以痛觉是身识和意识共同体验的觉受，意根没有这样的觉受，即使有，意识也不知道，观察不出来。众生都是以六识的觉受为觉受，当六识灭去或者微弱时，无论意根是怎样的觉受和心理，意识都不知道，不知道就认为意根没有什么感受，没有什么心行，或者说意根很简单，智慧很浅。</p><p>当意根的功能作用强大起来代替六识的时候，一切觉受都是意根的，但这时意根禅定智慧的修为已经非常超胜了，几乎都是舍受，没有什么情绪波动了。一般众生的意根还是有苦乐受，不仅仅是舍受，有类似于意识那样的心理觉受，委屈压抑烦闷愤恨，喜悦快乐兴奋，情绪波动很大，才会有怒火滔天、手舞足蹈和喜形于色这样情绪出现。</p><p>四、推敲中所蕴含的心所法</p><p>推敲一词来源于唐朝诗人贾岛作诗的典故，本是描述贾岛在作诗时选词择句的思惟方式和用功状态。诗人为了寻找恰当的字词，心里不断的搜索词语，用以显示该诗所要表达的意境，身手同时配合推敲。最开始由意识推敲寻伺，逐渐过渡到到意根的推敲寻伺，意根的推敲寻伺非常细密和隐蔽，以至于意识好像不动没有思惟了，如同参禅一样。</p><p>贾岛在琢磨推敲词句的时候，都有什么心所法出现？有五遍行心所法、五别境心所法，也许还有善心所法和烦恼心所法。推敲时首先要针对推敲的法升起作意心所法，把心引到要推敲的法上；触心所法出现，心触要推敲的法；受心所法出现，接受领纳推敲的法；想心所法生起，认识和取着所推敲的法；思心所法出现，不断的思量这个法，直到最后搞通、确定，再接后续的行为。在用手比划推和敲动作的时候还有五识和五俱意识的五遍行心所法出现。</p><p>作意的时候心思比较集中，意识意根集中在所对应的法上，受心所法的出现可能会比其他时候少，脑海中在盘算着思考的问题。在推敲的过程中如果触及到特别的意根敏感的画面可能会有受心所法，这种受是心里的触动和感受，而不是因为外界六尘变化引起的感受。受心所法最初是接受、接纳、领受的意思，因为如果不把问题领纳接受下来，就不能接着想这个问题，也就不能思，不能有最后思的结果，不能有抉择和往后的造作，更没有智慧的生起。</p><p>在想和思的过程中，一直都有定心所法的伴随。还有胜解心所法，胜解应该是正确的理解了法的大概意思，也就是明白了大概，针对思考的法能解出比较合理的答案、见解、观念和结论。在推敲过程中，也有欲心所法、念心所法和定心所法的出现，欲心所法是想要推敲，驱动六七识去推敲，去选词造句，胜解之后对词义形成念心所，专注于推敲就是定心所的功德。</p><p>五、胜解心所法</p><p>对于法的胜解，七个识都有，因为七个识都有各自对应的法，如果哪个识对于自己对应的法不能胜解，那么这个识心就不能认清所对应的法，就不会出现后续的运作，或者后续的运作就会全部错乱，众生就不能正常地生活工作和修行，什么都谈不到了。六识是这样，第七识更是如此，作主识不能胜解所对应的法，就等于天下大乱一样，想做个愚痴众生都很难，连细菌都能胜解所面对的状况，身为高级众生的人天大众，作主宰的第七识不能胜解尘境等等诸法，那要如何调控五阴身的运行？不能是像瞎猫撞死耗子似的迷迷瞪瞪的作指挥，这样的五阴身无法生存。</p><p>比如说一个人要买花这件事，去了花市见到众多的鲜花要做挑选，眼识对所见的花色要有胜解，才知道鲜花的色泽是什么，意识也要对鲜花有胜解，才知道鲜花是否艳丽和新鲜，是否是自己所要买的，意根对于鲜花更要有胜解，更应该清楚六识所见和挑选的鲜花品种色泽和价格等等情况，最后才能决定买与不买，如果不清楚，或者拿不定主意，就会继续让六识挑选和比较，直到完全清楚和满意，才作最后的决定，然后买鲜花这件事情才会结束。对于一切法都是这样，六识的了别情况，第七识意根必须都能胜解，才能推动一切法的运行，才不会错乱，让五阴身能正常的生活和工作。</p><p>六、意根的慧最关键</p><p>八个识都有慧心所，第八识的慧心所先不谈，前七识的慧心所中，第七识意根的慧心所最重要，在修证中最关键，祂代表着一个众生的根本智慧程度。因为意根决定着六识的出生和运转，决定着六识的一切身口意行，也在一定程度上决定着六识的智慧，前六识是受制于意根的，所以意根的智慧起决定的作用，关乎着众生的生死存亡，以及是解脱还是生死系缚。</p><p>如果意根没有智慧，六识再有智慧也无济于事，六识造作的业行由意根做主宰，有什么样的业种由意根的心行来决定，未来世有什么样的业果报由意根的心行来决定，后世是生死轮回还是解脱成佛由意根的心行来决定。所以断我见的智慧和证悟的智慧，以及一切的三昧智慧，都由意根获得，离开意根的智慧，修行就谈不到成果，包括初果和初果向，包括凡夫阶段的种种转变。</p><p>七、意根的两种烦恼心所法</p><p>意根的烦恼心所法分为两种，一种是常恒伴随意根现行，须臾不断的烦恼心所法，如瑜伽师地论里提到的我见、我慢、我爱和无明（我痴）；另一种是不常恒伴随意根现行的烦恼心所法，这是指除以上四种烦恼之外的心所法，如嗔喜怒等大中小随烦恼，如果这些烦恼恒常现行，那么众生的自他身心就会严重受损，生活繁乱，生命就不会长久，只有我见我爱我执我慢烦恼才是凡夫众生恒常现行的烦恼。</p><p>一切人等遇到深法，无法现前观行，只能稍微理解一点表面意思，所以只能背书。十二因缘法显示出，众生之所以在六道里生死轮回不休，就是因为意根的无明，意根若无无明，十二因缘尽，众生烦恼尽，就解脱了生死。无明缘行，行缘识。这七个字充分理解了，就会明白意根到底有没有嗔。意根的无明里若没有嗔，也就不会促使六识造作嗔业，生死业就减少了近一半，而意识有嗔是无所谓的，因为意识不能决定造作嗔业，也就不会有嗔业种子，也就没有嗔的生死业。</p><p>再者说，意识的嗔是从哪里来的？如何出现的？很多人既不能现前观察意根是否有嗔，也捋不清意根与意识的逻辑辩证关系，也不知道六识身口意行的由来，只会背书，并且认为自己浅薄的理解是正确的。如楞严经中说，众生生命的最初期只有意根和阿赖耶识，意根起念之后，才有天地万物和五阴六识，意根若没有嗔，意识的嗔是哪里来的？嗔业是如何出现的？众生之间互相争夺打斗，是因为什么？是如何出现的？</p><p>意识的烦恼很容易降伏和断除，只要懂得了理论，明了了理论，就会有效的控制了烦恼，但是由于意根不断烦恼，在遇到根本问题时，意识一疏忽，烦恼立刻就会出现，人就现原形了。比如梦中，比如醉酒以后，意识弱了就没有理智了，意根的烦恼就会全部表现出来。醉酒以后的嗔心嗔行，难道也是意识的？为什么酒后更容易造恶业？为什么酒后现原形？为什么酒后见人品？</p><p>降伏烦恼是指把意识的烦恼断了，但是这只是暂时性的，不是长久的，如果意根的烦恼不断，意识所断的烦恼在因缘具足时还会生起来，根本控制不住。所以嗔烦恼在三果的时候才能断尽，那就表明意根在三果时才能断尽嗔烦恼，而意识的嗔烦恼，在凡夫明理阶段就可以断除，但不究竟，遇到特殊缘分意识还会出现嗔烦恼。比如有一些人性格温和，脾气特别好，平时无论怎样都不会生嗔，这是意识无嗔的情况。但是一旦遇到特殊情况，触碰到他的底线，这样的人也有可能会杀人，这就是意根的嗔现行出来了。</p><p>八、意根的烦恼心所法</p><p>问：如果恨的情绪到了咬牙切齿的程度，就是意根的深恨，是意根的反应，意根有恨的小随烦恼吗？</p><p>答：意根是作主识，身口意行由意根作主和指挥支配，咬牙切齿的身根活动是意根支配和指挥造作出来的，意识不管有什么心思什么想法和情绪，都不能指挥和支配身体有咬牙切齿的现象发生。把意根当作一个正常的识心，就容易理解意根所有的心行活动，就不会有误解了。</p><p>意根是五阴身的主人，时刻主宰着五阴身一切身口意行，我们修行就是在修意根，改变意根，意根三次转识成智之后就成佛，如果意根没有某种无明烦恼，那么修行就只修意识就好了，不用理会意根。而修意识是非常简单、非常轻松和容易的，只要学了理，意识思惟之后理解就明了、有智慧了，心行就能发生变化，就转变了。而实际上修行是非常不容易的，绝不是这样简单和快速，改变自己很困难，必须经过长期熏习，长期的反观和历缘对境的降伏自己，才能取得一点点的进步。意根的无明烦恼极多极深，不容易降伏和断除，修行才觉得困难。</p><p>十二因缘是由意根的无明导致后续无量的生死轮回苦，就说明意根具足一切无明烦恼，如果意根没有无明烦恼，只有意识有，就不至于有无始劫的生死轮回苦了，意识的无明烦恼都容易解决。那么还要再思考，意识的无明烦恼是从哪里来的？</p><p>我们通常所说的我，就是指意根，主要是指意根，一说我的时候，就是意根的思想观念出来了，根深蒂固习气深重的我的思想观念，就是意根。那么想要观察意根，就观察自己的起心动念和习气惯性就可以了。我就是意根，观察意根就要观察我，从这个角度来用功就不困难了。内心当中比较深邃难以发现和观察的思想观念，都是意根的，根深蒂固的骨子里的习气烦恼和智慧，都是意根的，非常隐秘难知难改。意识的思想观念都浮在表面，容易被熏，也容易发现，容易降伏，容易改变。如果不涉及到意根的修行，那么学佛就是轻松愉快的，成佛也就很快速了。</p><p>意根在五蕴当中的所有功能作用，都能观察得到，知道事实是什么，真理是什么，才能说意根有什么和没什么，或者确切的说，或者肯定的说，否则就要按照佛说的：不要信汝意。自己的判断会严重受到现量观察智慧的局限，智慧不足观察不出来的时候，就要努力修行，争取早日能够如实观察和现量观察，以获得真实的智慧、如实的智慧和现量智慧。在此之前，怀疑毕竟属于怀疑，不能得出如实的结论，那就不要下结论。学佛修行都要本着这样的态度，才不会有误评误判的过失。</p><p>努力把法贯通，连贯起来，就能捋顺法义了。任何一个法都不是孤立存在的，都是有主体有主线联系起来的，从整体上把握所有法的内涵，就容易理解和掌握了。学佛修行不是背诵什么法则，而是要理论联系实际，要实际去观察，看看所遇的理论是否如理如法，是否是实际。要努力去实地观行，在五蕴的运作上观察，在身口意上观察，实践出真知，实践是检验真理的唯一标准，佛法与世俗法都是这样。学佛是要追求真理，真理就是事实，无人能改变的事实，以事实为自己所依，以真理为自己所依，就是佛教导我们的依法，这样才能有所成就，不会错谬。</p><p>九、从十二因缘的角度看意根的心所法</p><p>十二因缘中讲的无明缘行、行缘识、识缘名色这三个环节，很明显的揭示出众生的生老病死苦，都是因为意根的无明所导致的。因为意根的无明，众生就有了善恶业和六道轮回，那么意根的无明就包括了一切烦恼，具有一切烦恼心所法。众生因为有一切烦恼，才有分段生死和变易生死，而意根的无明一旦全部断尽，众生就成佛，这时意根就具足了一切善心所法，并且恒常伴随着意根运行，从前是不恒常，尤其是凡夫阶段，很少伴随意根运行。</p><p>总结起来说，意根具足一切心所法，不比意识少。如果意根不具足一切烦恼心所法，心就不会太染污，就会少造作生死业，苦受就少，然而众生无量劫以来，具足了一切生死苦，造作过一切生死业，这说明意根具足了一切烦恼心所法。如果意根不具足一切善心所法，心就不会完全彻底清净，那就不能成佛，然而一切众生最终必将成佛，所以意根具足一切善心所法。只不过这些善恶心所法不是恒常伴随着意根运行，凡夫众生的意根，只有我见、我慢、我执、我痴四大根本烦恼恒常不断的伴随着意根运行，须臾不相舍离。可见，这四大根本烦恼是生死业和生死苦的祸根，由这四大根本烦恼，引发出其它烦恼时现时隐的现行。</p><p>如果我见烦恼一断，其它三个根本烦恼也会随之渐渐断除，四大根本烦恼一断，其它一切烦恼就会随之全部断尽，分段生死即了。所以说众生断我见以后，我见烦恼既不能恒常伴随意根运行，也不能断续伴随意根运行了；乃至于我执我慢烦恼断尽以后，我执我慢烦恼既不能恒常伴随意根运行，也不能断续伴随意根运行，而是永远不再伴随意根运行了。乃至于我痴烦恼也是如此，一旦断尽，意根的现行烦恼就断尽了，命终就可以出离三界，入无余涅槃了。</p><p>凡夫众生意根的善心所法不具足，不能恒常伴随意根运行，而是时有时无，时隐时现，一旦意根断除烦恼心所法，善心所法就会逐渐具足，而且会恒常伴随意根运行，这就是圣人的心行，不是凡夫的心行了。总结起来说，凡夫众生的意根只有四大根本烦恼恒常伴随意根运行，其它烦恼时有时无、时隐时现，瑜伽师地论即是如此论述。凡夫众生意根的善心所法也是时有时无、时隐时现，断除烦恼成为圣人以后，善心所法就会时常伴随意根运行，乃至于最后恒常伴随意根运行。</p><p>近几十年来，很多人都是极大的误会了意根的心所法，究其原因是由于定慧严重不足，无法现前观察意根的心行，理解力也不强，误会了菩萨的论述，这个误会一直延续到现在。由于各大菩萨的定慧层次参差不齐，高低不等，菩萨的论述中就难免有矛盾之处，如果出现这种情况，就应该以智慧最深的弥勒菩萨的论述为主，如果有佛经为佐证，就应该以佛经为主。如果没有佛经来佐证，就要以真实的证量为准，以事实为准，因为事实毕竟胜于雄辩。</p><p>十、慧心所法的运行作用 </p><p>八个识都有慧心所法，慧，就是明，无慧就是无明。慧心所法是表明识心对所缘相分的明了性，当然这个明了性有程度的区别，只有第八识对所缘相分完全彻底明了，没有无明，其它七个识对所缘相分的明了有不同程度的区别，不是完全的明，还有无明，并且无明多于明。明的程度体现在对所缘不同的相分明了性不同，在不同因缘条件下对所缘相分明了性不同。</p><p>慧心所法与其他心所法并行混合运行，不相分离。如果识心在运行过程中慧心所法不起用，则识心运行错乱，了别对应的相分不清晰，则无法作出正确如理如实的抉择，也不能迅速作出抉择，其结果是什么可想而知。慧心所法在五遍行心所法运行的任何一个环节都会起用，在五别境其它心所法运行中也要起用，否则识心错乱，无法有如实如理的抉择。</p><p>比如眼识的运行，眼识自身最初的作意和触可能没有慧心所法的参与，再往下运行就有慧心所法参与了，当眼识把色尘接纳过来时，慧心所法起用，就知色为何了，之后执取色尘时慧心所法起用，抉择色尘时慧心所法更会起用。慧心所法越强，抉择得越有智慧，结果越善。其它几个识也是如此，尤其是第六识和第七识的运行，慧心所法的作用力更大，慧更强。但是这个慧也分为世间上的慧和佛法上的慧，世间慧实际上也是无明，不是真正的明，不能导致解脱和成就佛道，也许还会相反，深陷世俗轮回而不自知。</p><p>在别境心所法的运行中，慧心所法也会同时与之一起运行，慧心所与欲心所结合在一起运行，与胜解心所法结合在一起运行，与念心所法结合在一起运行，与定心所结合在一起运行，但是慧心所法的慧力有强有弱，作用大小不同，结果就有极大的差别。</p><p>十一、胜解心所法与慧心所法的关系</p><p>论中说，胜解是于境印可，知境是境，信境是境，不错谬，不犹疑。比如说心对花对月时，就会胜解其为花和月，不犹疑，能够信己所解，不轻易被转，即是胜解。胜字突出了对于境界解的程度，接近于境界的真实性。但还不是最后的完全确信，也没有证得境界的真实性。所以后边还有个慧心所法，慧心所法现前的时候，才能证得境界了，确信了境界，完全知道了花和月的境界。</p><p>胜解相当于知其然，慧相当于知其所以然，一个是解，一个是证，胜解是浅慧，是慧的基础，慧是究竟的最后的认知。在佛法的修证上，胜解心所法相当于解悟，慧心所法相当于证悟。解悟要想变成证悟，要经过念心所法和定心所法两个阶段，将所解的法牢牢的印持于心中，念念不忘，修成禅定，心念定于此法不间断参究，最后心开确信，大智慧现前，就证悟了。</p><p>胜解花和月，是世俗的事，好像并不太难，只要具足世俗法的理念和知识，六根正常，没有遮障，就会胜解花和月，其中也含藏一些比较浅的解慧。而在佛法上达到胜解的程度，是不太容易的，要具足佛法上的相关知识和理念，也需要修行三十七道品，减轻业障的遮障，才能胜解，但距离证还有相当一段路要走，还要完善一定的因缘条件才能顺利的证。</p><p>十二、七个识都有胜解心所法</p><p>胜解，是识心对于所接触的法，能够如实的了解和理解，是最合理的理解，最到位的理解，不会错解和邪解，也不会误会。如果错解不能胜解，那就无法做正确无误的抉择，其行为造作必错，必有严重的后果。如果我在讲法时，你们始终不能胜解，那我就白讲，你们就白学，没有结果，也许还会出现误解。如果别人跟你谈话，你不能胜解，那就会歪曲他人的意思，不能作出合理正常的回应，两个人就不能正常交流，交流也没有用。这样人们之间无法沟通和打交道，无法生活在一个空间。</p><p>七个识中，不管哪个识没有胜解，哪个识就不能正确解读所对应的法，就不能作出正确合适的抉择，其结果犹如盲人，不能走路，识心无法正常运行。五识也有胜解，五识能明白佛法吗？畜生的识心都有胜解，畜生都学佛吗？畜生的胜解力如果全部都低于人，那牠们如何准确及时的捕食？如何能生存下去？其实给你家毛毛狗一个眼神一个表情，毛毛就能秒懂，二话不说就执行命令，人更是如此。一切众生的身口意行都是由意根抉择的，既然能有正确的抉择，让五阴身正常地运转，那么意根就一定有胜解这个心所法，不仅六识有胜解，意根比五识更有胜解力，比五识更伶俐得多。</p><p>十三、观察催眠状态中意根的心理活动</p><p>一个人的意识如果很微弱，对意根的警醒作用和牵引力就非常小，这时候如果要对他进行催眠，意根就容易被催眠师诱导，把自己所知道的一切秘密都说出来。而如果意根本身很强大，有警觉力，意志坚定，就不会受到催眠师的诱导，能保守心底的秘密。有个催眠案例，催眠师想知道一个人的账号密码，就利用这个人处于半昏迷中，意识的抵抗力和分辨力非常低的状态，来催眠这个人，同时在他的头上安装了一台监测脑电波的仪器，以随时获取这个人脑电波的信息，通过脑电波来了解这个人内心里的思想念头和秘密，并且把脑电波翻译成文字信息。</p><p>可是这个人意志力很强，早有防备，催眠师问他无关紧要的问题都会如实回答，而问到有关密码的关键问题开始是胡乱回答，后来是闭口不答，但是心里的思想念头还是有的，所以仪器就能显示出这个人的脑电波的波动情况，仪器上有电流信号闪烁，并且即时翻译出了脑电波的文字信息。但到最核心的密码问题，这个人不但不回答问题，心里还舍掉了思想念头，关闭了大脑思惟，脑电波就一片空白显示不出来了，当然文字也翻译不出来了，结果催眠师用了很多方法都没有让这个人透露出账号密码。</p><p>从这个现象能观察出什么呢？在催眠的过程中，意识非常微弱，只能起到轻微的了别作用，五识也很微弱，与意识一起起轻微的了别作用，把所了别到的催眠师声音的内涵传递给意根，把身体中的痛觉传递给意根。最初意识还能有微弱的思惟分析作用，随着昏迷程度的加深，意识越来越不清醒，以至于消失了，六识传递的六尘信息越来越不清晰，思惟分析的辅助作用就没有了，这时候差不多全靠意根自己面对催眠师的催眠指令。</p><p>在意识正常运行的时候，意根可以听从意识思惟分析出来的意见和建议，而意识的思惟也差不多是围绕着意根进行的，所以意根所听从的差不多还是自己的指令，顺从的还是自己的思想。而在被催眠时，催眠师的指令代替了意识的引导和建议，意根如果意志不坚定被催眠成功，就会听从催眠师的指令，直心地毫无遮拦地说出心中的秘密。意根与六识是主仆的关系，六识负责观察和了别六尘，传递六尘信息，服从意根的指令，用身口意表达意根的思想观念。在六识很微弱的时候，意根的思想观念就显露不出来，很多功能作用得不到有效的发挥，但是意根仍然能缘和了别六尘境，仍然有自己的主导思想。</p><p>六识微弱或者消失以后还有没有我见？这时候的我见是不是与六识存在的时候是一样的？这时候的我见是不是更明显了？其实我见就是意根所具有的，意识只是依从于意根的我见，表达了意根的我见而已。这个案例中人被催眠了，六识微弱或者消失了，意根是不是表现出了很强的我见和我执？其实一直在维护着我的就是意根。我执来源于我见，没有我见就没有我执，意根的我执强大正说明意根的我见强大。</p><p>语言是如何产生的？脑电波是如何产生的？为什么身体虚弱就说不出话了？为什么身体虚弱到极点，脑电波就没有了？为什么意根怕泄露密码就灭掉念头，从而让脑电波消失？仪器测量发现，是先有脑电波，后有语言声音，语言声音是意识的功能作用，而脑电波完全是意根有想法有念头的表现，没有六识意根照样有思想活动，有脑电波。意根一有思想念头，脑电波就有波动，脑电波无关意识，意根直接灭掉意根自己的念头，没有念想了，就没有脑电波。</p><p>如果身体不虚弱有气力，在丹田处就会产生一股气，这股气往上运行到舌根的时候，就会有语言产生。说明意识的活动是受意根调控和指挥的，是围绕着意根的。当意根不想说话，不想表达思想的时候，就没有语言文字，当意根不想动脑子的时候，脑电波就波动的平缓。这说明了什么？说明了意根是主是王是君，六识是仆是臣，擒贼先擒王，修行就是要在意根上使力，改变意根才是王道。</p><p>意根到底有没有念心所？在催眠状态中，意根因为有心念，脑电波才能出现，没有心念就没有脑电波。想要达成某种目的就是欲心所，意根有没有欲心所？在催眠状态中，意根想要保护心中的秘密，就灭掉念头，想要保护的想法这就是欲心所。明了、胜解尘境，就是胜解心所，意根有没有胜解心所？在催眠状态中，意根明了催眠师说话的声音内涵，明了催眠师的目的，就是胜解心所。意根坚定不移的保护心中的秘密，就是定心所。为了保护秘密，关闭了心中的念头，就是意根的慧心所。一切烦恼心所法也是以意根的为主，意识的烦恼都是围绕着意根转的，都不算回事，容易生也容易灭。只要意根没有烦恼了，意识当然就不会有烦恼了，王不让做的事，仆从怎么能做？</p><p>再看看战争时期，共产党员被敌人抓起来，严刑拷打逼供，忍受着肉体和精神的非人折磨，意志坚强的人，到死都没有背叛和出卖组织，这是意识坚强还是意根坚强?是意识有信仰还是意根有信仰？仇恨是意识的还是意根的？一切法都在于意根。意根非常仇恨一个人，可是外表却用六识装扮自己，表现的似乎很喜欢这个人。可是有智慧的人一看就知道他骨子里是仇恨而不是喜欢。在催眠状态中清晰的观察到了意根主导地位和心所法，意根的功能作用是极其重要的。</p><p>十四、意识的心所法与意根心所法的关系</p><p>问：“识种子出生形成七个识以后，心所法伴随着运行，识心才有善恶无记三性。\"这个心所法是属于意根的心所法吧？因为意根里有俱生和分别习气，而前六识由识种子出生形成时应该都是清净的，受意根心所法影响后才有了三性，这么理解是否正确？</p><p>答：哪个识运行，就有哪个识的心所法伴随着。因为意识受意根调控和指挥，意识运行起来以后，祂自己的心所法现起是必然受意根的心所法影响的，受意根调控的。意根想行善，善心所法现起以后，必然带动意识的善心所法出生，以完成意根的指令。恶心所法和无记心所法现起都是这样。</p><p>意根要布施，必然要指挥六识去具体操作，这样六识的出生就是用来配合意根的，是要执行布施这件善事的，所以意识的心所法一出生必然是善的，与意根的心所法一致。意根要布施，必然要指挥六识去具体操作，这样六识的出生就是用来配合意根的，是要执行布施这件善事的，所以意识的心所法一出生必然是善的，与意根的心所法一致。如果意根不想布施，那么在布施这件善事上，就没有意识以及意识的心所法出生和运行。那就是说只要识心的心所法运作，就会出现三性，所以要清净识心，只要把根源的意根心所法清净了，其余识心也就跟着清净了。</p><p>意根想要杀人放火，就会出生六识来完成这件恶事，因为杀人放火的具体操作必须有六识才能完成，意根无法操作，所以六识一出生，心所法必然是恶的，与意根的心所法一致。所以意根具足一切善恶无记心所法，才能让六识具足一切心所法去操作身口意行，不像某些人说的意根只有一部分心所法，如果意根的心所法不全，很多事意根就无法作主造作了，意根不作主的事，六识如何操作？</p><p>意识的心所法一开始与意根是一致的，但是通过思惟之后如果觉得事情不对，也会改变心所法，回头来说服熏染意根。意识也有违背意根的时候，比如意根想做坏事，可是意识犹豫不决，不实行，改变想法之后也可以改变意根的想法，这就是意识的熏染作用。改变意根都是通过意识的熏染，经历某件事，意识都会思考利弊，这样意根就会知道利弊，以后做事就会有取舍。只不过意识熏染有快有慢，这在于意识的智慧善巧。</p><p>十五、意根的强大</p><p>随着不断深入的修行，定慧越来越具足的时候，意根就会逐渐强大起来，意根强大的标志就是转识成智，心所法转变了。意根的强大代表着心所法的强大，心所法强大意根就强大起来，无坚不摧，具足五遍行和五别境、善十一心所法，烦恼心所法早就完全断除了，也许还有一些非常轻微的烦恼习气，还有一些轻微的法执。意根强大到一定时候，就会取代六识，不需要六识的助缘，单独就能了知六尘境界，粗的细的都不成问题，这时候大神通就会显现出来。</p><p>十六、修行是修什么</p><p>修行到最后到底是打死意识，还是打死意根？打死意识为因，打死意根为果，打死意根虽为最终目的，但下手处还得从意识处下手。意识每天晚上都死，植物人的意识也差不多一直都是死的，可后世还是照样不免三恶道，何况六道轮回。这说明了什么？说明了生死的大权是掌握在意根手里的，所以修行必须落实到意根这里，把意根搞明白，把意根降伏下来，把意根的无明断除。灭意根的无明，究竟要如何操作？无明会延伸出一切烦恼心所法，那么烦恼心所法主要是谁的心所法？由意根的无明导致生老病死苦，哪些烦恼心所法意根不具足？如果意根不具足一切烦恼心所法，那修行是不是很轻松愉快的？</p><p>有些人非要说意根是不善不恶的，既然如此，我们还用修行吗？如来藏是不善不恶的，所以如来藏从来都不修行，也根本不用修行。修个什么呢？让祂改正什么呢？祂没有无明，没有恶，也不邪。如来藏如果去修行，恐怕就会修邪了，修歪了。善恶皆无明，有无明必然是善和恶的。如来藏无无明，所以既不造善业，也不造恶业，随缘应对，无所用心。有无明，才有嗔心，才会起心造杀业，有无明才有愚痴，才会造杀业。</p><p>十七、意根在十二因缘中的决定性作用</p><p>众生有生老病死纯大苦聚，全部是因为有无明，而这个无明就是意根的无明，意根有无明才有心行思心所，有思心所就有造业的抉择，之后才出现了六识。十二因缘前两个支分都是意根的，第三支分的六识也是因为意根才出现的，所以意根对于生死有绝对的主导作用，对于其他法都有推动作用。即使第三支六识的业行，也是随顺意根而有，落谢下来的种子也是因为意根而有，所以后世的名色就是因为意根而有。意根染污六识就染污，种子就染污，名色苦受就多，尤其是三恶道的苦。</p><p>名色增长以后，出生六入，六入与六尘的触，由意根作主，意根攀缘多触就多，生死业就多，攀缘少触就少，生死业就少。触之后的受、爱、取，虽然有六识的受爱取，实际上起决定作用的，能引出下一支出生的是意根的受爱取，意根没有受爱取，就没有下一个支分出现。最后三支的有、生和老死，完全是因为意根的取出现的。所以生死轮回的出现，意根起着决定性的作用。</p><p>十二因缘阐明了意根是生死的根，解脱和沉沦都在于意根，要想了脱生死，就要解决意根的问题，破除意根的无明。意根也是四圣谛苦集灭道的根，苦是由意根无明心行促使六识造业而来的，集是意根促使六识造业落下的种子而来的，灭是灭除意根的无明心行，道是意根证法而得来的。</p><p>既然意根在生死轮回之中，具有如此巨大的决定性作用，那么意根就具足了一切心所法，具足了所有善心所法和烦恼心所法，以及不善不恶心所法，意根的心所法决定了五识的心所法，决定了意识的心所法。意根心所法改变，六识的心所法就改变，一切法都随之改变。如果不改变意根的心所法，六识的心所法即使改变了，也会再变回去。意根烦恼不断，意识即使断了烦恼，也会重新生出烦恼，意根没有禅定，六识即使有禅定，也持续不了多久，必然会再次散乱。</p><p>十八、世间法的划分</p><p>心所法顾名思义，就是属于心所有的法。情绪、态度、意见、建议、着急、上火、嫉妒、难过等等，都是心上起的法，属于心所有的法，所以都叫作心所法。身上所起的法，属于身体所有的法，顾名思义叫作身所有法。色身所有的法，比如生病了，体重变化了，出现种种变故，生出一些东西，或者减少了一些东西等等，身体上所有的生灭变异都是身所法。色身分为内身和外身，内身就是身体，外身就是色声香味触法六尘，合起来都是五阴身。身体是色法，身体上起的法也都是色法，所以属于色法所有的也都是色法。所有属于身所有的法，也都是心所有的法，这个心是指哪个心？</p><p>一切世间法分为色法和心法，以及非色非心法，其所属性分为心所有法和身所有，以及非身非心所有法。这一切法都摄归如来藏所有，一切法都归到如来藏以后，就什么也没有了，我们现在还贪执什么呢？都是空的，都是假相。怎奈贪执的习惯太根深蒂固了，太难转变了。究其原因还是法界的实相没有搞明白，没有看清楚，这件事需要三大阿僧祇劫才能彻底弄清楚，这时修行也就结束了。</p></div>"
},{
    "title": "第九章 意根与实修的关系",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  意根与实修的关系</strong></p><p>一、意识的推理不等于观行和参究</p><p>在修定观呼吸时，意识只观行呼吸，知息入出，知息长短，不必加个意念说知的本源是什么。不要管这个知到最后是什么结果，那是以后的事情，现在结果还没有出来，就不要推测。意识的推理是意识的一厢情愿，而一厢情愿永远解决不了问题，意识与意根的两相情愿才能一拍即合的把事情圆满解决了，最后结果才会如实出现，那才叫作证。</p><p>意识的推理不是不好，但它仅仅是个指路标而已，具体走不走和如何走，还要依靠意根的抉择，意根不抉择，意识怎样指路也没有用。有时候意识不推理，还能顺利解决问题，推理反而耽误事，如果方向正确，不推理可能走的更快更稳，意识用得太多不是好事，意识用得越多，意根越无能，意根无能，就是你整个人的无能，操作指挥系统有问题，那还如何操作？</p><p>修行是傻子干的事情，太聪明就不会一老本实的做事情了。意识指个大方向，就闭目养神，暗中监督就行啦，不要管太多。意根靠自己的能力一旦走出去，到达目的地，祂的本事简直太强大了，靠意识拖着走，意根就弱智和无能，什么大事也做不成。</p><p>意识的推理，实质上也就是妄想，妄想就是见不到的意思，见到了就不叫作妄想了。有些人意识妄想出一个第八识，在某处起某作用，然后定义这个叫作明心开悟，不用断烦恼，不用修禅定，顶多有几分钟十几分钟心能定下来就可以见道了。这样做的后果是什么，大家应该能知道。如果这也算开悟，那么做梦梦见也算数，梦里见金山银山，醒过来应该发大财才对。梦境毕竟不是现实，不是事实，独头意识的推测等种种作为怎么能当真呢？要想有大智慧真正智慧，就老实修定观行参究，不要让意识灵活机动的推导结果，意根不认那个结果，意识一切所为都白费。</p><p>二、意识与意根二者境界一致才能证悟</p><p>望远镜可以刹那间看到几公里、几十公里以外的高山大海，可是要亲自见到和触碰到高山大海，需要亲自走过几十公里地，走到山脚下大海边，才能亲眼见到高山大海，碰触到高山大海，才知道高山大海的样貌和容颜，才可以对人说：我亲眼见到了那座高山那个大海，真是壮观极了，我的心境顿时打开了，简直太高兴了。三昧境界就类似于此，意根必须亲到，离开望远镜，亲眼所见，才有定慧等持的三昧，意根不到，那是借助望远镜所见，不是真见、无条件的见、赤裸裸的见。</p><p>意识就如望远镜，不管望多远的境界，所见都不真，境界模糊不清，意根所见清清楚楚、透透彻彻，彻法底源。如果意根没有跟上，望不到意识所见，就不是亲眼所见，不是亲临现境，不是亲证。因为意识所见离境界远，所见不真，犹如隔了一层镜片，有所遮障，景色既不细致，也模糊不清，只是一个轮廓而已，细节必须有待意根亲自去见，才能查明，知其所以然。</p><p>在凡夫地意识读了一些佛经，知道了佛的境界，可是意根不知道，就不是亲证佛境。这种知无比的粗糙，与不知没有什么区别，要想亲证佛境，细知、深知、真知佛境，必须再修行三个大阿僧祇劫，也就是三个无量劫，中间没有捷径可走，该修的法都要修，该证的法都要证，戒定慧、三十七道品、菩萨六度种种行持一样不能少，中间过程全部亲历，偷工减料走捷径绝对不行。</p><p>在凡夫地，意识学了一些法，知道了八地菩萨应该具有的无功用行境界，能于法任运而行，不用心思，能现量观察如来藏对根身器界的了别和运作，但是对于此种境界，意识知道归知道，粗糙无比，离实际证得还有两个无量劫的修证距离，在这期间不管怎么说，你都无法现量观察到如来藏究竟是如何了别和运行根身器界的，要想亲自证得此种境界，你必须再修二大阿僧祇劫才行，中间过程必须全部走过，不许偷工减料偷奸耍滑。</p><p>在凡夫地，意识学到了真如三昧这个名汇，觉得很好很殊胜，但是具体什么叫作真如三昧，境界如何，内心却一无所知，所知见的只是一种臆想而已，要想亲自见到真如三昧境界，还需要再修一个无量劫，就是一大阿僧祇劫。因为真如三昧是真如境界，是在一切法上证得的，见一切法或者部分法都是真如性，都是如来藏的真实而如如的性质，都是一真法界中的一部分。</p><p>一切法究竟如何都是真如性，如何都是一个真实的法界，这是道种智唯识种智的境界，是初地以上入如来家的佛子才有能力现量观察得到的，初地以上的菩萨摩诃萨分证法身，分证即佛，分证一真法界，才知一切法的部分真如性，凡夫即使真的证得了如来藏，离真如三昧的智慧境界还是太遥远了，只能想一想，绝对见不到，见到的时候就有道种智，成为入地大菩萨了。</p><p>在凡夫地，意识学了金刚经，知道一切法如梦泡影，可是意识再感觉一切法如梦泡影，也要再经过接近一个阿僧祇劫的修行时劫，达到十回向位才能亲证如梦境界。中间要逐渐的实证如来藏，发起种种三昧，修出初禅定，断除贪嗔痴烦恼现行，成为三果人，过禅宗三关，现量证得有余涅槃，命终有能力入无余涅槃而不入，留一品思惑烦恼滋润生生世世的五蕴身，继续自度度人。达不到这些条件，不经过这些境界，意识所觉得的如梦幻泡影，也只是说食，怎么能饱腹呢？</p><p>意识望远镜所望见的，与意根亲眼所见的可能差得非常遥远，望见很容易也很快，可是亲证就需要意根用脚步一步一步的丈量，亲自走到那个境界边缘，才能见到那个境界，极其辛苦，要付出极大的代价和努力。二者所见的境界极不一致，所以望见归望见，证得要经过相当长一段时间才有可能，没有证得的时候只能过过嘴瘾，说一说罢了。不要觉得证得什么法很容易，那是错觉，实际并非那样，非常不容易，无量劫的业障，业力如山大，哪有那么容易排除越过去的，虽然佛的加持力不可思议，自己的业力同样也不可思议。只有业障消除，善根福德种种因缘都具足的时候，意根拉近与意识的距离，与意识所见合一，彼时才能顿悟，除此都是误会的误。</p><p>三、身临其境</p><p>用望远镜可以望见极远极远的星空，望见浩瀚无垠的海洋，望见天边的山川大地，但是身体相隔何止千山万水。见的再远再高，也不代表身临其境。既定的目标，不是靠手指达到，不是靠空口说到，需要用脚去度量，所以总要开步走。一步一步地走，不能跑不能跳，更不能飞跃，这样才能稳妥到达目的地。不要嫌路远，就用意识臆想，也不要嫌辛苦，就用意识的臆想，更不要嫌路费贵，就用意识的臆想。想入非非，终究是幻境，要想王土，身临其境，必用意根脚踏实地，一步步丈量，亲触每寸土地。</p><p>四、意识的臆想不能代替实修</p><p>有时候学了一些佛法，意识就觉得明明自己可以改变一切，可以呼风唤雨，一使劲什么都可以做到，没有什么困难，包括成佛也不是那么困难。可是呢，自己一个心念都控制不住，固执一件事就是不能放开，身口意行什么也改变不了。</p><p>这是怎么回事呢？因为没有意根的实证，意识想当然的认为什么、理解什么、想什么都没用，落不到实地上，有力气使不出来，常常会觉得无可奈何。所以即使觉得成佛特容易，也要老老实实的经过三大阿僧祇劫，觉得证果明心就像吃大白菜一样容易，也得一步一步修四正勤七觉分八正道，老老实实的持戒修定，修四念处，老老实实的修完菩萨六度。佛讲的这些修行路途都不是没用的摆设，是必须要实行的。绝大多数人一辈子能把这些前提条件修完就很不错了，这些条件不能圆满具足，靠意识的推理和臆想证果明心，那是无济于事的。</p><p>为什么这么说？因为实修实证涉及到意根，在修三十七道品和菩萨六度的过程中，都在熏修意根，改变意根固有的知见，只有修到位了，意根的知见才能改变，从而一切都随着意根的改变而改变，这时候才能证果明心。但意根不是那么容易就能改变自己固执知见的，意根不改变，什么也改变不了。所以学佛还是要老老实实的实修，意识妄想没有用，即使觉得自己明天就能成佛了，也要过三大无量劫以后。有些人还高谈阔论说要不取相分别，心无住无执，这要等到几地菩萨时再说吧，地前菩萨根本做不到。意识断我见，意识证果，意识明心，意识成佛，先在梦里试试，行得通不？</p><p>五、理见与事见</p><p>佛法修证的最高境界就是佛陀的理事圆融，事事圆融，事事无碍，都合于理，理能显事，事能显理，理事永远不脱节。要做到这样，必须从佛法修证的最初见道开始，终至最后见道成佛。前后所见之道逐渐转深，也就是所见的理越来越深细，而事也随之越来越圆融圆满，从最初见道时开始，事就随理而行，理到哪里，事就跟随到哪里，不相脱节，直至佛陀最后见道，夜睹明星悟道，理圆满，一切事即刻随之都圆满，理事都不用再修，位尊无上法王。</p><p>见道分为理上见和事上见，理见和事见有什么区别？理上见，是从理到理，在意识层面上充分认识了理，明了了理，而事不相随，这时候事与理是脱节的。因为意根没有见，定慧具足圆融的三昧境界就不出现，事就不与之相随，事由意根来掌控，意识无法让事相随和圆融。</p><p>而事上见道，是在事上参理证理，这样见道事必合理，事必随理，理事必能融合在一起，不相脱节，从此才能脱胎换骨，洗心革面。外表看人还是那个人，从心行上看不再有旧时行履，思想品质焕然一新，心空无我，有为上显无为，无为又为了有为，空而不空，不空而空。</p><p>所以真正的见道是在事上作了充分参究的见理和入理，是事随理、事显理的证理，理事不分，三昧相随。理事融合，不一定圆融，也不一定无碍，因为理不彻，理彻即成佛。在事上见理，就是证得，在事不见理，就不是证。如果理只是理，不与事融合，这个理就解决不了事，解决不了事的理，就没有实用。所以只知理，不在事上见理显理，就不是实证。</p><p>六、如何才能真修实证有现量智慧</p><p>很多人都把自己理解的法当作实证，甚至理解的还很粗浅，甚至对于法都是猜测、推导、臆测出来的，弄不清楚解与解悟与证悟之间的界限和差别，误会很大，导致大妄语。很多佛法的答案和结论都是佛给出来的，也有一些是诸大菩萨善知识们讲解出来的，自己在修习的过程中，对这些结论和答案加以理解，并不是实证，甚至连解悟都谈不上，离解悟还有很远的距离。</p><p>实证是什么呢？譬如佛说一切法如梦如幻，这是诸佛通过修证得出的结论，是佛的证量，其他人加以理解了，也仅仅是理解，解悟也不算，真正证悟如梦如幻就到了菩萨十回向位，很快就有资格进入初地了，那么凡夫众生通过阅读理解诸法如梦如幻，能直接成为十回向位的大菩萨吗？显然不可能，戒定慧菩萨六度都不具足，哪方面也没修圆满，连初开悟都不算，怎么能越过接近一大阿僧祇劫的时间成为十回向位的大菩萨？</p><p>如果要实证五蕴世间如梦如幻，就要在修足戒定慧菩萨六度的基础上，由浅入深的观行和参究，次第证得各个层次的法，由禅宗的初关二关直至三关，最后才能证得如梦观，这要经过多劫的时间，接近一大阿僧祇劫的修行。对如梦如幻的理解，还分为很多层次，即使是完完全全究竟彻底的理解，也不等于是实证，因为根本没有实际参究的过程，没有证明，结论不是自己得出来的。</p><p>就像几何证明题一样，最终的结论是老师给出来的，是现成的，不是自己得出来的，需要自己一步步的证明，有过程有步骤，最后才能证明老师给出的最后结论，如果过程不完整，不属实，即使得出与老师一致的结论，也是错误的，不是现量证得。佛法与此道理是一样的，人人都能说最后的结论如梦如幻，说的虽然是正理，但也不是自己的现量证。</p><p>佛法中佛给我们无数最后的答案和结论，都在三藏十二部经里，即使我们把三藏十二部经都背诵下来了，甚至口若悬河的宣讲，也不是自己的证量，仅仅代表自己的理解而已，与解悟还有很大的差距，证悟就不要谈了。佛讲的每一个法，甚至每一句话，都需要自己在甚深禅定中去思惟参究，如实如理的观行，才有可能一一实证，实证之后的智慧才是自己的现量智慧，否则任何说法都不是自己所证，真实智慧与所说法不相应。</p><p>真要实证，并且要有所成就，甚至连观行五蕴比较细的情节都要忘掉，抛之脑后。只管观行和参究，细节需要自己在观行的时候厘清，然后才能出生智慧。很多人用功就是用不到意根这里，那是因为禅定严重不足，怎么也体会不了如何只让意根思量。定力不够用，那如何有体会呢？没有禅定的时候，最好什么也不要参究，如果意识聪明就会解出不少东西，却没有真实用处，玩嘴皮子倒是可以，实用是没有。那意识解法还不如不解，留着到禅定提升、因缘具足时再参究是最好的。</p><p>七、理论研究非修行正途</p><p>当今佛门里出现一种只注重理论知识的流弊，觉得理论学的越多越好，如果能学富五车就觉得很棒很自豪，如果能写出若干篇文章、若干本书来，就觉得更棒、更自豪了。但是这些理论知识能不能指导和规范自己的身口意行，能不能扭转一些七识的心行，能不能让自己心清静，减少无明，能不能有真实的受益，这些就都不管了，还美其名曰说菩萨不用管烦恼的事，知见正确到时候自然就会断除烦恼了。</p><p>可事实却不是这样，仅仅有理论知识，仅仅有意识的知见，对于烦恼来说永远是无济于事的，临命终时后世的去向是由贪嗔痴烦恼的现行来决定的，是由贪嗔痴造作的业行来决定的，不是由理论知识和佛法上的知见来决定的，所以这个问题非常重要，每个学佛人都应该加以重视，不可掉以轻心。</p><p>理论和知见，就好像是烹饪用的菜谱，学了好几本烹饪书，却从来没有在厨房里亲手操作过，甚至连食材都没有挑选和搭配过，所掌握的烹饪知识，烹饪知见能解决饥饿问题吗？花费宝贵的时间精力用来研究又研究，研究之后又著书立说，广招徒众，致使名声显赫，却不得不忍饥挨饿，徒有其表。譬如一个孩子从小学开始学习，一直到大学，到研究生，到博士生，再到博士后，都是学习的理论知识，大学以上的可能会搞一些科研和实验，有一些实证，大学生以前学到的都是知识，知识的东西不能直接用于生产工艺上，中间需要经过实习和实践阶段，知识才能转化为生产力。</p><p>学习佛法也是要这样应用于五蕴世间生活当中，这就需要不断的持戒修定，在甚深的禅定中努力的参究，与自身的五蕴相连结，与身口意行相联系，让理论得到实践，努力的亲证实证，破除无明，增长实智，改造身心，转变身心，这样修行才算成就，才有实益，才是正道。</p><p>八、臆想臆测是完全不可靠的修行方法</p><p>众生由于智慧有限，禅定不足，无法深入思惟，意根的思量也无法运行，对于一些较深的法就习惯于用臆想、臆测的方法，而臆想臆测就是意识心的功能作用，丝毫没有意根的智慧。臆想臆测最严重的就是信口开河地说：开悟以后就能观察到第八识是如何出生根身器界的。根是身根身体，第八识如何用种子一点点出生身根的，如何出生眼根耳根鼻根舌根的，开悟以后再修一个无量劫也许能观察到一点点，两个无量劫差不多能观察到许多。器是宇宙器世间，众生生存的空间环境，第八识如何用种子出生宇宙器世间的，开悟以后再修行一个无量劫，也许也观察不到，两个无量劫差不多能观察到一些。</p><p>界是十八界，六根六尘六识，第八识是如何用种子出生六根和六尘的，开悟以后再修行一个无量劫也很难观察得到，两个无量劫还差不多能观察到一些。第八识是如何用识种子出生六识的，开悟以后再修行一个无量劫能观察到一些，但不能完全具足的观察。但无论能观察到什么，如果没有因此改变自己的内心，身口意行都不因此观察而发生变化，所谓的观察都不是观察，而是臆想推测。臆想臆测都是意识的思惟方式方法，不涉及到意根作主识的思量，所臆想臆测的就没有作用力，不能转变身口意行，不能消除烦恼和恶业种子，没有清净的功德受用。</p><p>九、知解并非证</p><p>常乐我净，是涅槃四德，常，是指佛陀的无垢识没有种子变异了，永远保持长恒不变；乐，是指佛陀一切业障永尽无余，无垢识里没有苦受种子了，所余一切都是乐受和不苦不乐受的善业种子，果报为寂灭乐；我，是指佛陀的无垢识里灭去一切生灭业种，不受业障拖累，是完全的我性，可以称为我；净，是指佛陀的无垢识灭尽一切染污种子，彻底清净无垢了。</p><p>第八识也受业障的遮障，心体里如果没有存业障的种子，第八识就会发挥无尽的功德，光照大千，就如佛陀的无垢识一般无二，无一法不遍、无一法不周、无一法不现。而众生的第八识由于受业障局限，不能变现极多的殊胜美妙的境界，不能变造众生的分身，不能变造佛国土，不能遍缘一切境。所谓的第八识受局限，就是祂有无穷无尽的功德作用不能发挥，非是无殊胜的功德作用。到佛地，第八识再也不受局限了，一切功德作用尽数发挥。</p><p>以上的道理都懂都知吗？能为人讲解吗？对于法的学习，所有的理解和知都落于意识心上，没有落于意根心中。虽然解和知了，但离证还有十万八千里地，甚至远远超过十万八千里地，即使能为人解说，写出一百本书，离证也有十万八千里地。对于五蕴无我，即使都能理解，都能知，知解的可能很深透，但都不是证，也许离证还有极远的距离。对于第八识，无论怎样理解和知，知解的也许还很深，甚至能推测和琢磨出第八识的功用，但也属于解，不是证，离证也许还有极远极远的距离。</p><p>很多人都把这种解当作证，口才好的，就以善知识的身份到处讲经说法，口若悬河。但无论怎样，耳入口出之法都不是证。比如苏东坡对佛法的解：八风吹不动，端坐紫金莲。结果禅师评价：屁！苏东坡一看立马就不高兴了，我写得这么好，竟然说是屁？于是立时过江找禅师说道说道。禅师说：你不是八风吹不动吗？怎么一个屁字就跑过来跟我算账？</p><p>所以说知解不中用，证的才管用。有的人说自己明心开悟了，一遇境界就被转走了，然后就用意识劝导，好了一会，境界再来，又被境界转走，如此反复多年不能自主，这种人真的证果明心了吗？对于最粗重的烦恼都不能降伏，遇见漂亮的异性都不能无视或者无动于衷，心思飞扬，把持不住，这种人能是明心证果的人吗？凡是用意识不断压制说服自己的，都不是证。真证了，证到哪里就会做到哪里。</p><p>有不少人也说自己鲤鱼跳龙门了，可是他把龙门的门槛设置的很低很低，甚至拆掉了门槛，轻易的就过去了，实际上这是游过去的，不是跳过去的，这是鲤鱼跳龙门吗？游过这样的龙门，仍然是鲤鱼而不是龙。</p><p>十、如何判断一个结论是意识分析出来的还是意根思量出来的</p><p>1+1等于2是用意识心思维出来的还是意根思量得出的结论？1+1=2这个结论，如果你能很确信，有理有据，清清楚楚知道其中的原理，就是意根得出的结论。如果你虽然能算得出1+1=2，但却不知道其中是什么原理，说又说不清楚，就知道是这个结论，那就是意识依据所学的理论相参考或者是比较而得出的结论，跟背诵差不多。否则为什么科学家还要深入研究为什么1+1会等于2？ 我们从小学到大学所学到的知识，究竟有多少得到实证了呢？每次考试虽然都过关了，也许都得了一百分，但是考试考的是知识的理解和背诵，是知识量的掌握，没有多少是考实证的。实验室里的内容才涉及到实证，步入社会以后才涉及到实证，所以很多学霸到了社会里往往不太适应，跟不上社会的节奏，不能学以致用。</p><p>单独意识思惟分析出来的，并不能断除疑惑，遇到因缘就会疑惑重重，不再相信从前的结论。所以意识思惟分析出来的结论不坚固，主人有疑，主人作主，主人有自己的主张，关键时刻就会把助手的结论否定掉不用。所以很多意识证果明心的人会不断的退，就是这个原因。意识的思惟分析，可以没有禅定的辅助，可以在散乱心状态下，但是越有禅定，意识的思惟越精细、越准确、越到位、越如理。但无论怎样精细准确如理，都不是意根自己得出的结论，所以不叫作亲证，没有断德，没有受用，不能抵挡生死。</p><p>意识的思惟，往往能被意识感知到观察到，能被意识发现，相对于意根的思肤浅一些，粗糙一些。意根的思比较深沉隐秘，不容易被发现，但能念念不断，只有疑惑非常深的时候，意根才去思量，以解决疑惑。这就涉及到禅定了，念念不断就有禅定，能定在疑惑的探究上就是定，无论什么时候做什么事，无论醒着还是睡觉，疑问就在心里，弄不明白甚至就会上火，吃不好睡不好，像丢魂了一样。</p><p>意识心粗的时候，对于意根的思无觉无知，觉察不出来，对于自己心里的事发现不了，自己真正想要什么，想干什么不知道，自己的心思掌握不了。所以那么多人都不能发现意根，不了解意根，掌握不了意根，观察不了意根。用意根思量必须有禅定，禅定越深越好，能剔除其他杂事的干扰是最好了，最好六识也不要打扰到意根，只配合意根轻轻的细细的了知就行了，不要引起意根的杂思。</p><p>十一、想要证悟需要做些什么</p><p>问：我的一切都是如来藏变化来的，那么我怎么能见到如来藏呢？比如我打坐，见到法尘，知道它是如来藏幻化的，知道了有意根作意，也知道了是意识在了解，知道了如来藏在一切法处，但是也还是见不到祂的面目，现量境就看到了法尘，然后有个觉知分别，其他的都见不到，那些幻化之说也是听来的，怎么样才能真见如来藏呢？</p><p>答：首先来说，你的这些知都来源于理论知识，都是意识从他处学来的，也有一些属于意识的推理、推测和猜测、意解之类，不是实证到的，全都无法当真，因此你知道这些内容，对于自心意根来说不会有什么实质性的影响，意根的认知不转变，身心世界就不改变。实际上这些知也等于不知，毕竟耳听为虚，眼见才为实。学来的理论知见，离实际证得还很远，对于几个识的运作仍然是一头雾水，遇到一些逆缘，疑心就会增加，也许会否定从前的这些认识，其见解有可能会相反。</p><p>要想真见如来藏，就要努力做功夫去证知如来藏，而不是根据理论去推理，或者是鹦鹉学舌似的学。证知如来藏需要很多的因缘和条件，首先来说业障要消除，福德要增加，定力要具足，信心要圆满，戒律要严持，忍辱功夫要好，并且精进于修持这一切法，最后般若智慧也要具足。总之，证得如来藏是要转凡夫心性成菩萨性，身口意行任何一方面都要与菩萨相匹配， 戒定慧与菩萨一样，烦恼性障减轻，具足菩萨的大福德和大智慧，心量与菩萨一样广大，恒顺众生，发大心利乐众生。</p><p>这样就等于脱胎换骨一样，身心世界都要有相应的转变，与凡夫阶段有明显的差别和大进步。总而言之就是要具足菩萨的六度万行，如果不足就不能见道成为真菩萨。从现在开始，要有计划和步骤的全面完善和提高自己，等待因缘时节成熟，不要有急迫的心情，不要患得患失，不要有功利心，发心要大，因上努力，果上要随缘。</p><p>十二、无上妙法只可意会不可言传</p><p>意会是意根的实证，言传是用意识语言的解说。无上的妙法是最高最妙的如来藏法，这是需要每个人亲证实证的，其他人用语言的开导和提示，都代替不了自己的实证。实证需要诸多因缘条件，戒定慧和福德都要具足，而且已经发起了深深的疑情，能够念兹在兹的参究，功夫做到意根这里，然后才能实证如来藏妙法。言传只能够先落到意识心里，意根的功夫没有做到位，就不能触动意根，所以言传代替不了意根的思量和参究，终究无法亲证。</p><p>禅定和参究的功夫不够深的时候，要专心做功夫，不要听别人的见解，不要参考佛经和别人的理论知识，因为这会障碍亲证实证。修行这样的事，都是自己的事，犹如吃饭谁吃谁饱，佛法谁参究谁亲证，不参不证，听来的法等于窃取来的，不属于自己的，三昧境界只能自己发起，智慧由自己心中生，学三藏十二部，永远不如自己悟。修行人应该如大丈夫一样，勇于行持，亲力亲为，摒绝一切偷机取巧。</p><p>无上妙法不可言传，还有一层意思，如来藏这个微妙甚深法，不能用语言表达出来，不管怎么说，说出来的都不是祂，无说无示，指出来的也都不是祂，不管怎么样，祂就是不出头不现身不说话不作为，低调无我，也没有调。对于这样的法怎么办？只有实证亲证亲悟才能见得祂的真面目，听来的看来的都不是，任何人传法都传不出来，那你还要听别人的指示吗？</p><p>十三、如何才能舍识用根</p><p>有人说舍识用根的根是指众生的根性，其实是指意根。根性，也是识之功能作用，离开识，就谈不到根性。善根和根性，一般都是指与生俱来的第七识意根的智慧。</p><p>舍识用根，一般人在参禅时能用得到，舍去六识，尤其是舍去意识的情思意解和琢磨、揣摩、分析、推理、比较、判断，而专用意根的思量性，这样才能证道。证道以后，后续的修行，也都尽量用意根，用意根来得直接、深透，显得耿直、正直、纯正、纯真、纯洁，能成办一切事，说到做到，甚至做到了也不一定说。</p><p>没有禅定，很难用到意根，都用意识的推理和解，轻松但肤浅。解的比证的快很多，但不管用，没有三昧，不得解脱，不了生死，意识一灭就作废。禅定越深，意根的用越多，力量越大，越能解决问题，越有三昧，三昧越深，智慧越透脱，解脱的力量越大。</p><p>十四、境随心转是随意根转</p><p>问：我有一次一边开车一边思维，一开始思维比较乱，忽然感觉一点杂念没有了，就看见周围环境特别陌生，好像认不得路了，看见什么都感觉新鲜，空气都感觉特别清新，然后就迷路了，那条路公路其实非常熟悉。为什么有这样的感觉呢？</p><p>答：因为心专注于思惟佛法之后，注意力就不在周围尘境当中了，意识专心思惟使得意根对佛法有了进一步的观感，内心喜悦，就会看什么都愉快，有点类似纯粹禅定的三昧境界出现。心能转物，境随心转，这是修行过程当中暂时出现的果，还不是最后的结果，最后的结果是相当殊胜的。没有这些修道的过程，以及过程的积累，任何人都不要谈论自己有什么什么果，塑料果没什么好炫耀的。</p><p>十五、依理比对和想象不等于实证</p><p>菩提的含义总括起来是指成佛之道中所有应该具足的佛法，其层次由浅入深有很多层次，最初是断我见，包括初果至俱解脱的四果，然后是大乘明心证得菩提的根本如来藏，直至佛地的四智圆明。证得如来藏就算证得菩提，但是不等于证得全部的菩提，因为如来藏体性深广无边，只有全部证得，才是证得阿耨多罗三藐三菩提。所以证得才是一个开始，还有很多法都要一一证得，才能圆满菩提。</p><p>如果是仅仅知道如来藏到处都参与，到处都是如来藏的身影，一切法都是如来藏，全体即真如，这只是意识从书上得知的理论而已，还不涉及到意根，与意根无关，那么这个理论不是自己实际证得之后得出的结论，那就是学语。没有实际证得，就是理解也理解的不够深入，知其然都谈不上，更不能知其所以然，那生死问题如何解决？如果能把眼界打开一条缝，再往里能窥探一点点，就会得知一点点真相。</p><p>有的人知道了全体即真如这个理论以后，就耍小聪明，开始发挥想象说，这也是真如，那也是真如，到处都是真如，然后自以为是的说：我这不是开悟了吗？于是就去找人印证。</p><p>如果能见到如来藏是如何具体存在和显现出来的，那就相当不错了，可以说是真开悟了。学佛就是要先断我见，只有把五阴无我之理搞透彻了，之后明心就不难了。比如说大家都知道电流在电线里面，而看不到电流，只能看到它的应用，它让电饭煲煮饭，令洗衣机洗衣，手碰到电流，被电得发麻哆嗦，这也不属于证得电流。看见洗衣机洗衣服，就知道有电流，是根据理论知识理解的成分比较多，还不知道电流的具体作用，就不属于证得。</p><p>十六、意识与意根的智慧此消彼长</p><p>在学生学习阶段，因为是对知识理论的吸收阶段，因此都是意识用得多，学习结束之后就进入实践阶段了，这个阶段是理论应用于实际操作，全靠个人发挥真才实干了，这个时候是意根用得多。如果意根用不好，就会被人讥笑为书呆子和学究，只有学问没有才干，没有真材实料，所学无所用。</p><p>在学生做几何题时，明显是用意识推算，因为有结果有答案，只要往答案那里推演就行了，个别定力好的学生，能用到一点意根的思量作用，但不太多。如果题目没有答案时，用到意根的思量可能会多一些，得出正确的结论则可能会显示出学生一定的真智慧，但也不排除用的意识推理的成分多一些。在几何题推算推理过程中，有一定的原则和规律可遵循，依靠的越多，意识作用越大，意根作用越小，智慧越浅。</p><p>同理，在观行参究的过程中，别人给的提示越多，意识用得就越多，意根用得越少，智慧越浅。如果是完全靠别人提示，口说耳入式的，都是意识的作用，意根一点没使力，则意根一点智慧也没有，今世后世都不得解脱的功德受用。而在没有任何提示的前提下，完全靠自己参究出来的，发挥的就是最好的，智慧最深。相反，别人给的帮助越大，自己的能力就越小，没有任何帮助就把问题解决了，所有的智慧都是自己的。独觉佛一个人在山上参究十二因缘，证法前后的那个智慧，阿罗汉没法比，凡夫就更不用说了。阿罗汉有佛陀和佛法可以依靠，智慧开发的有限，不如独觉佛的智慧深细。</p><p>外缘依靠的越多，意根用得越少，能力智慧越差。有些人学法总是祈求得到种种帮助，不知道得到的帮助越大，开发的智慧越少，受用就越小。遇到问题能自己用功，开动脑筋，获得的才是最大的智慧。总喜欢问法的人，智慧比较浅，自力不够，没有独立解决问题的能力。有的人总想求人帮助悟道，帮助悟的，到底是属于谁悟的？是谁的智慧？佛法上的智慧，以及世俗法上的智慧，都是谁自力谁得，靠人不如靠己。</p><p>十七、什么情况才可以发愿留在娑婆世界？</p><p>类似娑婆这样的世界才有三恶道，如果要发愿留在娑婆世界，最起码要保证能断除三恶道的业，灭除三恶道的果报，后世能不入三恶道才行。而不入三恶道，就要断除三缚结，三縛结是意根证果时断的，断除三縛结时就断除了粗重的烦恼结缚，否则后世免不了三恶道的苦受。不是意识断三縛结就能免除三恶道业的，意识的烦恼和三縛结依意根而有，意根不断，意识即使断了也没有用，祂是受意根支配的。</p><p>断除欲界五品烦恼成为初果向之后，才能证初果断除三缚结，先观察自己的五品烦恼有没有，重不重，能否断除，然后才能判断自己能否有希望断除三缚结，再根据自己的实际情况发愿，让后世不受极重苦。如果弄不好，发愿留在娑婆世界，却长期在三恶道里受苦，自己本身就是一个等待被度的对象，你还怎么去度别人？这样的话，后世是不是很苦恼？</p><p>如果你保证不了断三缚结，甚至意识的结缚都不能保证能断除，三恶道就不能免除。即使意识没有了三缚结，意根有三缚结，也不能免除三恶道业。而且如果意根的结缚深，烦恼重，意识的三縛结随时随地都会现起，不由自主，后世定会趣向三恶道，那么这样的发愿就等于发愿留在三恶道受苦一样。所以发愿一定要小心，什么情况发什么愿，根据自己的修证水平和实际情况，不能头脑发热，什么都不管不顾的，智慧是个好东西，一定要多动脑筋，开启智慧，再有所行动。</p><p>十八、断我见不下三恶道的原理</p><p>断我见证得初果以后的人，不会再下三恶道受苦报，为什么如此？因为其心改变了，心与三恶道业不相应，不会再造三恶道业行，也就不会再下三恶道受苦。心证得无我，就空了，心空的人不可能再造三恶道的业行。什么是三恶道的业行？就是违犯五戒的业行，违犯十善业的业行。受持五戒才能得人身，不得三恶道众生身，受持十善才能得人和天人身，不得三恶道众生身。断我见证果的人粗重烦恼断除了，心行一定与五戒十善相应，才能免除三恶道业和身。</p><p>那么这个断我见的心，与五戒十善相应的心，不与三恶道业相应的心，是哪个心呢？意识当然是这样的心，最主要的意根绝对应该是这样的心，而且意根是无间断的心，断我见之后，意根才会无间断的有毗钵舍那和奢摩他的双运道功德，不管是睡觉、昏迷、死亡和中阴身的任何时候，都有断我见的功德在身，就会以此功德受生、投胎和入胎，那么意根是什么心行，有什么业，就会有相应的胎身。想要不入三恶道，就需要意根断我见，具诸功德，只有意识的闻法智慧、推理智慧、臆测智慧和情思意解的智慧，绝对保证不了断除粗重的烦恼现行，保证不了不造作三恶道的业行，保证不了不违犯五戒十善，也就保证不了命终不入三恶道。</p><p>十九、由净和的观行来看意根的运行</p><p>净和：今天早上开车上班，双车道我在左侧紧跟前车行驶，这时右侧有车加快行驶，然后右侧车道没车了。这时眼睛不自觉的向右观察（这其实是意根觉察到右侧车道变空，指挥眼睛进一步详细观察），观察之后立刻取了一个“右车道空”的法尘（感觉是在大脑里），接着立即有一股“力量”在心口窩出现（这个力量是指挥手脚做动作变换车道，这个应该是意根的思心所？）如果观察到了这个力量，手脚就不会有动作，这个力量似乎是被六识的反观力截断了，如果不反观它，它就会让手脚做动作（这其实就是意根的思心所指挥身识的现象）。</p><p>这整个过程中有一个有意思的地方，就是取到“右车道空”这个法尘后，有的人是立即变道，有的人可以是不变道，这个区别是怎么产生的呢？这个区别就是由每个人的“知见”不同产生的，这个“知见”很有意思。</p><p>观无我：意根觉得有必要就变，没有这个意愿，或觉得不安全就不变，这个取决意根的经验和决定，意识只是按意根的意愿去收集分析信息，再交给意根去决定。知见其实应该包括意根与意识，两个识共同作用。先有意根作意才有意识生起，所以用意识去找意根不容易，多在定中练习深细观察。</p><p>净和：对，是这个意思，我只是把这种经验表述成了“知见”这个词。我就觉得这个知见有意思，观察它，它无形无象，根本观察不到，（知道靠第六识来描述它，才勉强算能让它现点相。）但它又在我们每一个身口行背后起着作用。意根为什么向“a\"作意而不向”b＂作意？就是由这个知见决定的（个人理解）</p><p>观无我：这就是意根的心所法相互配合来判断和决定，无始劫来留在意根中的经验。意根的慧，一般人想象不到，大多数人都习惯使用现世意识的慧，这样往往会障碍意根的慧发挥出来。</p><p>净和：决定的依据是什么？就是依据这个知见。您说的判断是指思心所吧？但这个知见的影响应该是作意的同时就起作用了。我觉得观行中，就是要让微弱的意识一点点引导意根的变化。</p><p>观无我：我在观行中发现意识干扰意根很明显，有五遍行也有五别境，心所一般都是相互配合作用的。所以我在入定以后，尽量不去注意生起的境界相，那个很容易分散意根的关注点。有效观行比入定要难很多，花的时间也很多，慢慢摸索吧。</p><p>评：他们这些对意根作用的观察和讨论都很好，方向也对，常作此观察，定慧都能增强。观察到了心口窝的这股力量，本来想要有所动作的手脚就没有了停止了，如果不去观察这股力量，手脚就会顺着这股力量动作起来。这是为什么？因为心口窝离心脏很近，意根调动身根的时候，就是在大脑神经中枢这个位置，意根心一动，神经中枢就会通过所有神经向全身发布命令，心脏就负责供血。如果意根有情绪，或者情绪比较严重，心脏输送血液就会受影响，需要大量供血，这样导致面色出现变异，如果供血不足，就会出现休克等等现象。</p><p>当感觉到心脏有异常的时候，一般都是意根出现某种情绪了，或者是意根有什么特别的念头了，需要消耗更多的血液，心脏或者是心口窝就会有反应。心脏功能不强的人，要严格控制意根的情绪，是谁来控制？是理智的冷静的意识来控制，所以意识的作用还是很大的，通常都比意根理智得多。在凡夫阶段意根的情绪化比意识要严重得多，像个小孩子一样，需要意识哄着、安抚着和调控着。当意根断除烦恼以后，情绪化越来越低，智慧越来越高，就越来越有理智。</p><p>大多数人都知道用意识观行，那么意根能不能观行？当意识非常微弱的情况下，意识就不能观行了，这时候还有没有观行？能不能再观行？佛陀在四禅定里证道成佛，诸大菩萨和阿罗汉辟支佛在四禅定里成就一切神通道力。而二禅以上五识就灭了，意识非常微弱，无法思惟，四禅定里意识就更加微弱了，那么在四禅定里是如何证道和发起神通道力的呢？</p><p>真开悟真证果的时候，是意根依靠意识证道，还是意识依靠意根证道？两个识是谁先证道，还是同时证道？当然如果是解悟，不管大乘还是小乘，都是意识的作用，是意识分析思惟推理猜测整理归纳出来的，意根不太知道这些结果，也不同意这样的结果，所以意根不断疑，心性不能转变，身口意行也不能转变。</p><p>四念处观行开始的时候，都是用意识起观，定力出现的时候，就会稍微涉及到一点意根。现在应该训练自己，让意识的观行作用越来越弱，逐渐让意根来代替。这个功夫要如何做，自己考虑考虑。</p></div>"
},{
    "title": "第十章 意根与证果的关系",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  意根与证果的关系</strong></p><p>一、意识证果是末法时期修行的歧路</p><p>娑婆世界修行的歧路很多很多，如果不具相当大的善根福德，真的很难辨明方向，尤其是细微之处，没有走过那条路，真的会误入歧途，一个小歧路就足以浪费极多修行时间，退出来都不太容易，何况大的歧路，更难辨明和退出。证果明心到底是只意识证果明心就算，还是意根必须与意识一起证果和明心才算，这个问题是小歧路还是大歧路？不用断烦恼就可以证菩提，是大歧路还是小歧路？</p><p>证法的问题，是众生个人和全体佛教的最重大问题，是生死存亡的关键问题和转折点，因此任何其他的法都可以错，只这个问题绝对不能错，这个问题如果错，则是根本原则的大问题错了，关乎众生和佛教命运的大问题错了。越到末法时期，佛法修证上的歧路越多，古代人学佛叫作修和行，现代人学佛大多数只能叫作学，很少涉及修和行。可是古代修和行的人中开悟的慢又少，而末法学的人中倒是开悟的快和多，这是不是很反常？当然很反常，佛法将来要灭，就灭在此处，是从修证的根源上灭，如果没有实证，佛法将难以为继。所以我好多年都在讲意根证果、意根明心，讲了好几本意根的书，就怕佛法快速的被搞灭了。</p><p>我三百六十度无死角的讲意根证果，可还是有钝根的学者阿师死活不肯认此理，也不敢认此理，因为一旦认此理，自己大小乘的果位就泡汤了，消失不见了，变成了凡夫一枚，真是不甘心啊！但这样做是非常不理智的人，不是以道业为重的人，也不是以法以真理为所归的人，规避事实不是大丈夫所为，是我心重的表现。</p><p>如果众生善根福德深厚，即使遇到了歧路，也会凭借自己的善根福德最终走出歧路，回归到正路上来。所以每个学佛人应该多修福德，多种善根，才能保证今生和后世不入歧路，有择法眼，有辨别力，不被误导，不入恶道。越到末法时期，修福的机会越多，种善根的机会越多，真想成道的人发大心大愿的人，都要好好把握每个机会，多种善根福德，这样自己不仅生生世世受益无穷，还能加速佛道修证进程，早日获得智慧解脱，自利利他。</p><p>二、意识证果仍然是具缚凡夫</p><p>意识证果非常快捷省事，不用付出多少代价，也不用费脑子、费功夫参禅，最主要的是不用修禅定，这简直太省事了。禅定这关最难过，特别辛苦，耗费时间还要辛苦熬腿，耽误很多世俗事。意识证果不用怎么持戒，三皈五戒也可以免了，最麻烦的三十七道品不用修，省去了极多的时间精力，福德也不用有多好，菩萨六度的前五度都可以免了，简直太省事了。只用个意识学学理论知识，然后思惟、理解、分析、揣摩、推理、整合、归纳，这些操作都不用有多专注，不用太费脑累心，这些事情相当于小秘书的日常工作一样，一般智商的就可以应付了。</p><p>这样证果多便宜，不用付出多少代价，理论知识有一大堆，还能博人眼球，受人崇拜，也不用抛妻弃子出家修道，不用辞亲割爱，也不废世间事业，还可以接受大众供养，还能当菩萨法师，或者当个胜义僧压过出家僧，出家在家的利益兼收并蓄，世间利益最大化了。意识证果的好处这么多，谁能舍得放弃？</p><p>但是这样证果以后根本断不了一丝丝烦恼，与具缚凡夫没有任何区别，有些人就给自己找借口说只有三果和四果才断烦恼，初果二果都有烦恼，这不足为奇，初果人与凡夫的烦恼一样多一样重，也不足为奇。如果说初果与具缚凡夫一样，那就说明初果人本质上就是具足一切烦恼的凡夫，初果有名无实，怎么能是断我见的初果人？佛法这样搞下去，佛教怎么能不灭？</p><p>虽然世间邪法邪师众多，但是那些邪法都很低浅，破坏不了佛教的根本，动摇不了佛教的根基。比如某法师讲的如来藏根本是胡说八道，但是他怎么也影响不了佛教的主流发展，他度的众生根基都特别浅，费尽心思拉出来也没有什么作为，对佛教不构成威胁。再比如双修法，那根本是个外道法，层次非常低劣，有点智慧的人就能辨别出来，不会入进去，入进去的大多数都是业障深重善根浅薄的人，即使费劲给他们救度出来，也不能成什么气候，不可能成为佛教的中流砥柱。能够毁灭佛教的永远都不可能是外道和外道法，都是从佛教内部毁灭的，所谓狮子身中虫自食身中肉。</p><p>三世佛教的根基和重点，都在证果和明心见性这个极其关键的环节里，只要这个环节不出大事，佛教未来的发展就会平稳，不会有事。所以断我见和明心见性的根本法，不是什么人都能传授的，绝对不能胡乱搞，如果乱搞祸害众生的法身慧命，将来即使想当五百世野狐也是痴心妄想，所受的恶果要比这严重无数倍。护持乱传法的人等于助纣为虐，果报也相当不好，所以敬请大家深思因果，严肃对待佛法，对众生和佛教要秉着高度负责的态度。</p><p>三、不断烦恼能否证菩提</p><p>有的人说，明心和证初果，没有断烦恼，身心没有什么变化，没有转变，这是正常的。可是这却是非常不正常的，这样大的生死大事，颠覆了从前重大的错误知见，对五蕴世间的认知从有到空，身心怎么能没有任何改变？四正勤如法的修行，身心怎么能不发生变化？七觉支的如理修行，身心怎么能不改变？心不改变，如何是证果和明心？即使在世间法里，意根真正知道个什么事情，也会激动得异乎寻常，身体有很大变化，心里激动万分，或者热泪盈眶，或者身心颤动，或者神情肃然，或者几天睡不着觉等等。</p><p>在证果之前修行三十七道品过程中，身心都会一点点的发生变化，与从前有很大的区别，如果区别很明显了，断除了欲界五品惑，就是初果向了。如果身心始终没有什么变化，那就是没有如法修行，修行方向不对，或者是根本不精进，或者是只停留在广学多闻和情思意解上，或者是在世俗法上用心比较多，法理并没有真正入心。</p><p>俱舍论里讲只要真修道，如理的修道，必降伏烦恼惑，然后断除烦恼惑，在修道的过程中就是这样，修道的结果更是这样，然后才能成为初果向，再次成为初果。不断一丝烦恼惑，身心没有转变，就仍然属于具缚的凡夫，被烦恼惑五花大绑动弹不得，如何能进趣菩提道，转变身份？如果强行索取身份，那就只能有其名无其实，名不副实的，叫作欺世盗名。</p><p>很多人都以为，只要能讲出法就已经实证了，可事实却不是这样。如果不是经过实证以后来讲法，就没有真正的指导意义，那段路自己都没有走过，就无法指导别人具体如何走，自己心里如果贪嗔痴烦恼炽盛，处处都是渗漏，是没办法指导他人降伏烦恼和断除烦恼的。</p><p>有个一指禅公案，师父在一个引导他的尼师竖起食指的时候，立时就悟了，小沙弥看见了就想：原来这就是悟啊！于是小沙弥在师父不在的时候，见人问法就同样竖起食指，告诉对方这个就是那个真如，鹦鹉学舌学的可像模像样了。如今人的悟，与这个小沙弥的悟没有什么区别，虽然能比比划划的，与祖师们的作略还挺相像，好像是个机锋似的，也好像能引导人，但是外行看热闹，内行看门道，这些手法只能欺骗一些外行人罢了。各种机锋都是八个识和合，有真有妄，如果真妄不分，把妄也当作了真，再怎样比划也不是机锋。</p><p>阿难在佛涅槃一百年的时候，听见一个小沙弥把生灭法念成了水老鹤，就给他纠正过来，可是小沙弥问他师父哪个对，他师父说你别听阿难的，他已经老糊涂了，按照我教你的念就对了。于是小沙弥还是一如既往的念，阿难听到了就想，佛刚刚涅槃一百年，佛法就被误传成了这样，未来世离佛更远，佛法该演变成什么样？众生真是太愚痴了，于是阿难一伤心就决定马上涅槃走人，不想看到佛法慢慢被毁的惨景。那时候的佛法就已经变质了，何况几千年后的今天！今天的时代，绝不是满大街圣人的时代，很多人都非常严重误会佛法的修证了。</p><p>如今大小乘法都不是那么珍贵，不是稀有之法了，只要闻法思惟思惟，果位就拿到手了，不需要什么戒定慧，也不需要修六度万行，守戒和修定的人都是傻子。现在什么果都能容易拿到手，比如如梦、如幻观、十回向位的果都不是什么难事，如来藏观行修证之法只要口耳相传，就能把果拿到家里，众生愚痴和颠倒得已经让人无话可说了。</p><p>四、什么是无间见道</p><p>真正见道以后，就会心心无间在道中。心心无间是什么意思？哪个心是无间心？哪个心是间断的心？为什么能间断？第八识和意根是无间的心，前六识是有间断的心，见道要想无间，就要意根意识同时见道，不能单独的意识见道。真见道，意识断灭了，道果还在；而假见道，意识一旦灭了、弱劣了，道果就没有了。</p><p>真正见道就是意根见道，意根见道以后，心就永远住在道中，不会再退道了。而意识见道就不是这样，意识是有间断的心，是不能作主的心，如果意根不见道，意识就会听从意根安排和调动，不认所谓的道，就不在道中了。如果意识再生起疑心，就会退转。即使意识不退，因为是意根处处作主，身口意行也不会发生改变，依然故我。</p><p>有一些人因为意识见道，或者认禅定定境为道，为了不退，就常常打坐修定，保持定境，以把所悟得的境界保持下去。而另一些人，就努力的用意识牵引意根随顺自己，但这终究不是长久之事，纸怎么也包不住火，事情最终还会败露无遗。意根见道以后，境界对于意根和意识的吸引力不大了，意识容易被扭转，意根一旦认理，对于真理就很难扭转，十牛拉不动。</p><p>正因为意根是这样的拗劲，祂无始劫以来的邪知邪见根深蒂固，想用正法拉意根也不是那么容易的，意根不容易受熏，所以证果才那么难。有些人烦恼重，跟他轻描淡写的讲一些理根本没有用，只有受大恶报了，碰壁很严重了，头破血流了，才能稍微知道反省一下自己，这样的人就是根器差的人，十牛拉不动，认死理，不通融，喜欢较劲。</p><p>五、如何检查是解悟还是证悟</p><p>洞山和尚过河，睹河中的影子，突然间悟，偈曰：渠今正是我，我今不是渠。问：渠是指谁？我是指谁？二者什么关系？洞山和尚手指河里的影子说：你现在就是我，可我却不是你。影子，第八识映现出来的五蕴，从第八识中来，是第八识的影子。五蕴从唯识究竟义上讲可以说是第八识，但第八识可不是五蕴。</p><p>这些法想一想、琢磨琢磨就能明白了，没什么了不起。说解悟也行，说没解悟也行，说证悟就需要从里到外从上到下的好好检查一番。检查什么？检查他的内心改变没有，智慧生起来没有。因为证得了五蕴只是一个影子，肯定吃惊不小，内心波澜起伏，原来的认为的执取的都错了，这时内心是什么状态？没有证悟很多次的人，没有心通的人，怎么能够知道这个人是证悟了还是解？一般人绝对检查不出来，可以说百分之百检查不出来，只会人云亦云。</p><p>证悟是大智慧，能够如实检查出是否证悟，更是大智慧，比证悟的智慧还要大很多很多。证悟能够现前观察第八识比较简单而粗略的运行，非解悟所能比拟。解悟心里只是有个朦朦胧胧的影子，说不清道不明，不知道第八识究竟是如何运作的，五蕴是如何出生的，别看他讲一堆理论，可没有一点准确细致的东西，就像浮在水面，入不了水，不知道水里的情况一样。</p><p>有的人说自己是开悟证得第八识如来藏的大菩萨，可是这个大菩萨多少年也并没有讲出第八识如来藏稍微细致一点的运作情况，都是笼笼统统、模模糊糊的一些大框理论，那些理论看看经书和菩萨的论著也就能琢磨出来大概了，没有什么稀奇的。至于禅宗公案，看看祖师们上堂接人时比比划划的，大概也知道点什么了，有样学样，不少人也都会，没什么稀奇的，一指禅师的小小徒儿也会用一指比比划划的，外表跟他师父一样，可是却不是禅。现代人造假的能力无与伦比，从世俗到佛教都如此，业重、烦恼重、我重使然。</p><p>那些学禅宗祖师们的作略比比划划的人，可以说是解悟，可以说是连解悟的边也不着。把意识的作用当作第八识的作用，这是外道，把八个识共同的作用当作第八识单独的作用，这是推理猜测，外行人绝对看不明白，往往被唬得一愣一愣的。这个招数可以瞒天过海，因为众生见识太短浅了，实在是愚痴可唬。所以当你被骗的时候，应该回头来检查自己，为什么能被骗？别的人为什么就眼明心亮不被骗？当你走到大街上不小心撞到一个人，那个人对你瞪着眼珠子说：我是证果的圣人，你怎么敢撞我？你一听，就哈哈一笑，说声对不起就完了，不必奇怪，也不必说什么。</p><p>六、用排除法能否明心</p><p>什么是排除法？譬如自己在心中确立一个标的，在自己所选择的范围内排除与标的不同的对象，剩下的那个就被确立为自己心中的标的，不管所选的范围全面不全面，只要自我确认，就自以为是了，明心证果方法非常简单。</p><p>即使把一条狗训练好了，狗子也会用排除法找到主人所指定之物，其它畜生训练训练都能会，因为这个不必太用脑，不费力，不用善根福德，不用禅定，不用持戒，不用精勤努力的修习三十七道品，即使是白丁在人暗示下也能明心证果。比如说主人在狗子面前，摊开ABC三张牌，让狗子指出哪个是C，狗子先指出A是，主人摇一摇头说不对，于是狗子又指出B是，主人再次摇一摇头说不是，最后还剩下一张牌，不用想也知道剩下的就是C，狗子自然就指出了C是，主人说这回对了。于是狗子高兴了，觉得自己很能，还得到了主人奖励的一根骨头。</p><p>用排除法找第八识也是这样，总共就有八个识，能知六尘的六识肯定不是第八识了，一下子就排除了六个，还剩下意根和第八识两个，意根一般人真的观察不到，不知为何物，即使告诉他说是时时处处作主的那个，还是找不到意根，找意根非常难，观察意根的了别性就更别想了。于是就把意根排除去不找了，就单独找第八识。</p><p>第八识是什么样的呢？不少人都知道第八识不了别六尘，于是就找来找去，最后找到了一个好像是不了别六尘的东东，臆想一下这个东东好像是有了别性，了别的好像还不是六尘，至于到底了别了什么，实在是观察不出来，因为悟后有别相智道种智的人才能观察到第八识的了别性，知道第八识究竟能了别什么，凡夫根本没办法观察第八识的了别性，除非根据理论猜测臆想。最后想一想第八识好像是了别根身器界，因为经论里都这样说，那么就是它了，没错，于是急急忙忙、高高兴兴去确认，好像觉得不疑了，断除了三缚结。</p><p>这样的智商如果不是天生的，就是后天脑子里曾经进过水，连大脑发达一点的孩子都不如，怎么能是一心想修证菩萨道的菩萨？单纯得要命了，要是遇到过去的祖师爷，以祖师爷们的直心，他们一句话都不会跟你说，直接大棒子打到头顶开花，竟敢祸害宗门？幼儿园智商没法教育了。我若不是考虑到宗门的兴衰，对这样的人连看都不屑看一眼，奈何宗门明心是佛法修行最关键之处，是众生的生死命门，是今世和未来世无数众生的皈依解脱之处，如果有人把这个门破坏掉了，众生就再也不能鲤鱼跳龙门了。</p><p>即使是知解宗徒也比这个排除法要尊贵多了，排除法都不用多少知解，不用多少智商，像挑豆子一样，把坏豆子挑出去就行了，剩下的都是好豆子，多简单。何必修什么四念处、七觉分、八正道、四正勤、四如意足、五根五力的，不用受戒持戒，不用修禅定，任何定力都不用，一个挑豆子的活儿用不着这么麻烦，佛说的那些条件都是多余的，最上根器的没必要遵守佛说。</p><p>六祖座下十三岁的神会小和尚聪明伶俐善根深厚，求法心切，爬山越岭千里迢迢找到六祖求道，六祖只印证他是知解宗徒，当时禅风是那样的兴盛，开悟的祖师、善知识是那样的多，可是神会和尚竟然活到九十六岁仍然是知解宗徒，著作的文章不少，一生与北宗神秀和尚渐修一派斗法争宗。如今时人哪个有神会和尚的求法精神和善根福德？竟然梦想用排除法找第八识超越神会和尚，第八识是不会让你这样找到的，用臆测的方法倒是可以臆测得出来，但那是画饼充饥，终不饱腹。总之，请大家认明一个事实：末法时期毕竟是末法时期，千万不要妄想什么，实事求是为善，妄想为恶。</p><p>七、众生心中所确认的法一定是正确的吗？</p><p>非也。如果是这样，佛就不会告诉众生：汝意不可信，证阿罗汉果才可信汝意。这里的阿罗汉果是指小乘极果四果，三果还差一点。确认就是意根肯定和认可，形成了无间作意，深入骨髓，不可动摇，也深不可知。譬如我见，众生意根就确认这个，根深蒂固，不可动摇，叫作我执。</p><p>非常信自己的意无疑，非常肯定自己，就是意根的确认，可是凡夫众生的确认都有很大的过失，有很大的生死过患，譬如凡夫都确认五阴是我，这样的确认是邪见，不是正见。凡夫众生无始劫以来，一直都确认自己的见解正确无误，可是无始劫都因为错误颠倒的见解而生死轮回，受诸恶报和苦报。</p><p>汝意不可信，佛陀不仅用此规劝凡夫众生，也规劝初果二果至三果人，因为四果之前对五蕴世间空的认知还不到位不究竟，思想观念里我见没有断尽，还有我执，四果阿罗汉我见断尽，空得彻底，我执我慢消除了，其空的思想观念才纯正，才可信汝意。这种空的思想是在小乘法范围内的彻底和究竟，相比于大乘法，还是很不彻底不究竟的。</p><p>所以凡夫证果不证果，一般来说，其智慧不足以自我检验，一是修行时劫短，经验不足，二是见闻少，没有比对，很容易误判错判，加之于心中有我，不能隔爱，就会偏袒和高估自己，容易造成假悟和妄语，最终因果不爽。</p><p>八、能确信就是真的不疑了吗？</p><p>据说科学家用仪器检测说地球是椭圆形的，几乎所有人都相信了，而且好像还是确信不疑的那种信，好像这样的信，已经根深蒂固，不可更改了。有人不信他还会去跟人辩论，甚至还奚落挖苦人家，但这也不是真信真不疑。信也分很多层次，乃至于有人坚信不疑，确信无疑，简直是丝毫不怀疑。但如果没有亲自证实，这些信都属于盲信和迷信，不是证信，所以疑仍然存在，只是很深沉隐秘，不容易观察得到。</p><p>知道地球是椭圆形的，仅仅是听说而已，不是亲眼所见，那就是意识的道听途说的知，意根没有亲自见到，就没有断除疑惑。甚至很多人亲眼所见的，也未必是真是实，看错了的情况非常多，眼见也未必为实，所以意根的疑惑不能断除。一旦有个其他因缘出现，说地球原来不是椭圆形的，而是菱形的或者是三角形的，于是不少人对以前的信就动摇了，变成不信了。</p><p>为什么信心能改变？就是因为没有实证，意识的确信，不管信到什么程度，都不可靠，因缘一变，意识的疑就出现了。为什么？因为意根原来就不信，意根没有断疑，因缘一变，没有意根实证的支撑，意识就善变，没有主心骨了，或者说意识的主心骨始终是意根，关键时刻一定是随着意根转的。只有真实见到了地球，从整体和宏观上确实见证了地球的形状，意根才能断疑生信。未来即使因缘变了，意根仍然坚信不疑，那么意识就随着意根坚信不疑，即使意识有疑也不起作用，还会信意根的。</p><p> 有人说只要你自己确信断我见了，不疑了，就是证得初果了。这样的说法该有多么的幼稚可笑。凡夫的确信不疑，可靠吗？如果可靠，为什么众生那么善变，一有风吹草动就变了，不信了？如果凡夫的确信和不疑都是可靠的，佛为什么说慎勿信汝意，汝意不可信，证阿罗汉果才能信汝意？</p><p>历史上有记录的为人印证断我见证果的人，一是佛世的佛陀本人，二是佛陀涅槃之后的四祖般若鞠多，佛陀就不用说了，无量的智慧，无限的神通，无所不知，他心通宿命通，众生的心思全部能如实知见，弟子们证果与否，佛陀不用见面就能立即知道。而四祖般若鞠多不仅证得了阿罗汉果，而且还有大神通，甚至亲自降伏过波旬种种扰恼，还佛教以清净。</p><p>按四祖的解脱证量和宿命通他心通，弟子们是否证果，当然也能立即知道，不会错谬。其他人没有证量，智慧证量不足，也没有神通道力的，恐怕无法如实的观察他人的心理状态，因此不能为人印证证果与否。智慧非常深的，生生世世证果无数次的，经验丰富的人，可以在没有神通的情况下能够如实为人印证证果之事，除此之外其他人就没有为人印证的能力和资格了。更何况是凡夫自印证，由于没有经验，判断失误根本就不可避免，造成的后果也不可想象。</p><p> 修行佛法比世间法更应该务实和严格，不能拿佛法当儿戏，以为佛法很简单，实际上没有比佛法更难的了，因为众生无始劫以来都在搞世间法，对佛法是太陌生了，太生疏了，加之于重重的业障，阻碍之大，往往超出了我们的想象。所以踏踏实实学佛修行是我们的本分，这样才不至于再增加业障烦恼，在生死的深渊里陷得更深。</p><p>九、愚笨能证阿罗汉果聪明不免三恶道  </p><p>周利槃陀迦的意识非常愚钝，一句佛法理论也忆持不了，其思惟力更是弱，更不会推理、整理、归纳、概括、分析、比较，仅仅观鼻息，为什么就能证得四果阿罗汉？古今中外文学墨客浩穷三藏，著述诸多，诗集偈颂妙语连珠，为什么没有证果的影子？佛法不在说，也不在解，不在文词多优美动人，能受用才是佛道。如苹果吃到口里，吞到胃里，填饱肚子才是最大的福利，总比研究苹果，撰写苹果论文拿去获奖实惠太多了。</p><p>周利槃陀迦那么愚笨不懂理论的人，在观鼻息的时候，意识的种种功德基本上用不上了，在观行的时候也不可能投机取巧了，分析不了鼻息等等诸行刹那生灭，苦空无常无我，也推断不了诸行无我、五蕴无我，这正好省去了意识的情思意解，意根的功能作用就得以充分的发挥了，结果他不仅断我见，还直接证得了四果阿罗汉。可见佛法最后的修证不是在意识上用功，不懂理论不要紧，只要用功的方法和方向正确，并且能精勤修行，照样可以悟道。</p><p>而浩穷三藏、学富五车的理论家、研究家们都只能在意识上用功，尽管雄辩滔滔，辞藻华丽，受人追捧，风光无限，名声显赫，最终却一无所获，得便宜处正是失便宜处。譬如苏东坡无论对佛法多能解，感悟有多少，在修证上却一无是处，文人的习气是严重的障道因缘，不容易克服，琴棋书画一切世间技艺都是障道的因缘，世人却以此为荣，实是颠倒。那些爱好理论，喜欢有所得的学人是不是应该反思了？</p><p>十、意识的不可靠性 </p><p>问：听人说开悟以后会忘了开悟内容，那么忘了开悟就不属于开悟的人了吧？开悟怎么还能忘记呢？</p><p>答：意识学习的理论知识会忘记，意识所理解和背诵的内容会忘记，鹦鹉学舌会忘记，忘记就回忆不出来了。而开悟却是自心智慧的证量，是意根与意识同时所开发出来的智慧，不从他处所得，所以根本不涉及记忆与忘记的问题。</p><p>回忆与忘记是意识的功能作用，而意识是依他起性，生灭变异，缘不具足的时候，意识就会衰弱和消失。比如大脑有病变，或者受到刺激，或者精神受到刺激，或者年纪大了大脑萎缩，意识的功能就衰弱了，不能正常发挥，就会回忆不出从前的很多人事物理，这叫作忘记。而意识消失了更不会记起从前的任何人事，比如睡着了、昏迷了、死了、投胎以后，意识消失了，从前经历的人事暂时或永久性的消除灭去。在中阴身里虽然有微弱的意识，但功能受限，受业力操控，一点主作不得。</p><p>如果只是意识开悟明了若干理，意根没有开悟的话，这就太没有保障了，意识一消失，什么内容都忘失得干干净净。因为意识是因缘而生，变异的非常快，受到某种影响说变就变，说翻脸就翻脸，说忘记什么事就想不起来了，一打盹的功夫心里就一片空白。所以如果没有经过辛苦的参禅过程，也没有参究过，却妄想一步登天让意识直接知道大致结果，没有熏习意根，这个结果说没就没了，几乎没有什么功德受用。</p><p>不经过具体的修道阶段，也没有辛辛苦苦参过禅，意根不受熏，只能靠意识的推理、想象、猜测、臆想，一点现量也没有，都是非量，臆想的内容当然就会随时想不起来，不起作用，指导不了身口意行，不能成为无间断的连续不断的思想境界，甚至连续不了几分钟，灭是早晚的事了。</p><p>而通过辛苦参禅参究的过程，意根参与其中，悟得真心自性，就是现量智慧境界，三昧出现，成为无间见道，身口意行清净，这样的话意识想忘也忘不掉，想丢失也丢失不了，想退也退不了了，因为这事由意根作主，意根悟了，意识就得随顺意根，受意根指挥支配，即使忘了也不得不想起来。其实根本不用意识想不想的，意识灭了也没关系，意根是悟的，就永远悟了。无论是睡着了、昏迷了、死了，在中阴身里，都是悟的，就会以悟者的身份去投胎，得到证悟的善果。</p><p>学佛修行只用意识会吃大亏，依靠生灭变异无常的意识来解决生死大事，那是绝对没想明白修行这件事。自己吃饭自己饱，总依赖外缘，缘会灭的，总不能靠到无量劫以后，所以有智慧的人不能把砝码压在不断生灭变异的不保靠的意识上，世出世间任何事都是如此。再次总结说：意识证的果，都是纸糊的果，纸质的最容易烂坏。</p><p>十一、如何避免解悟 </p><p>现在有不少人都担心自己在大小乘的修行当中会解悟，阻碍自己今后的证悟。所以现在就有个问题：如何避免解悟。</p><p>解悟是什么情况呢？解悟就是对于法义很熟了，大小乘法的修行思路已经很清晰了，几乎明确知道就是那个理，就是那个样子，好像没有什么疑问了。但是这还是停留在对法的胜解层次，离证还有段距离，虽然已经有不少人在这个时候都认为自己开悟了，也会很容易被引导认证为开悟。胜解后边还有念定慧，最后那个真正的慧，意根的慧要开发出来，才是真悟，在这之前还有一大段艰苦的路必须要走，这段路非常艰辛难耐，靠毅力、功夫、愿力、信力、忍力、慈悲力才能过关，到达暂时的终点或者叫作目标、目的地。</p><p>意识对法的胜解之后，还要熏染和带动意根也要胜解，意根胜解之后也不属于开悟，要形成心心无间的念力，念力成熟，才能出现定力，定力具足，才能开发智慧，出现大小乘见道的智慧，识得那个道，证得那个道，确认那个道，才能永远不退转于大小乘菩提道，永远不失见道功德，否则遇缘就会轻易退转菩提道，因为意识解，意根未明，否认从前意识解得的是最正常的事。这种退转也是意识的退转，是意识不认，但意根并没有退，因为意根从来没有进入过，没有见过道，何来的翻脸不认，何来的退转？这种所谓的退转就是在见道之前的外门那里闹腾，一旦入得了门里，就会因为真实的定慧等持的三昧境界，而安静下来，心空了寂静了，根本不会闹腾。</p><p>胜解、念、定，这三个步骤都很关键，没有前就没有后。其中法义由意识到意根是个非常关键之处，意根一旦认法了，疑情就会出现，心心念念的疑着，到一定时候禅定必出现，往后就涉及到了修定和参禅两个关口。对法有了一定的胜解以后，如何提高定力，又如何参究呢？比如说断我见之理，心里已经有了大概的理解，无我的思想大约也都清楚了，这时候还不属于证，再往下要如何修行？这时候有的人是没有定力的，有的人有一些定力，但是定力还不足，这时候当然首要任务就是想办法修定，提升定力。</p><p>定力提升之后，意根在定中思量有关我的内涵和外延，把有关我的所有法义都要一一贯通起来，从而明了什么是我，思量通达有可能断我见。但是这些内容太多太深，不可能一时都思量清楚，就需要一点点的由浅入深，由表及里，内涵越来越深透，外延越来越宽广，最后整个我清清楚楚的在心中摆明了。</p><p>以上是定中参究证悟的方法，以此方法用功，就会避免解悟。在参究当中，意识要把所学的法义比较细致的部分尽量忘掉，不要传递给意根，或者不要把比较细致的法义当作是最终答案，对法要起疑，要有疑问，疑越深越好，要多问为什么。意识所学所知的都是知其然不知其所以然，通过参究让意根弄清楚为什么，智慧就会不断的增长，能带到未来世。</p><p>好多法其实都不用学，学佛不是要学成个理论家和辩论家，也不是要学成个杂家和全家，在真参实究当中，会触类旁通，法义一点点扩散和融会贯通，原来不知不会不懂的法，通过深思，都会一一贯通。贯通之后的法，就是自己所有的，不是学来的，今世和后世想忘也忘不掉，张口就来，不必思考。智慧深的人，都是自己去证法，去探究法，而不是去学他人的法，学来也不是自己的，死后就忘记了，来世还得重新学。有不少人都是学富五车的样子，一提起法义来，侃侃而谈，口若悬河，好像辩才无碍了，可是一个法义都没有通，一个都没有实证过。知识丰富不代表真懂法，不代表真智慧，意识一消失，什么都不是。</p><p>大小乘的法，在多闻阶段，只要弄清楚大概轮廓，脉络清晰就可以了，不用再到处学、到处闻，同样差不多的法，学多少也是那样，并不能增加智慧，真正的智慧是通过参究参出来的。参究一点，出生一点智慧，同时还会触类旁通，证得更多的法，一点点连接起来，就懂得了许许多多的法，而且是真懂，甚至睡觉时也能用功。思想脉络清晰了以后，并不需要意识的提醒和引领，所以没有意识的时候，意根照样能独自参究。</p><p>十二、意根证果才不会退失</p><p>意识的解，不能断除任何烦恼结缚，因为结缚是意根的结缚，是意根的无明，意识不能代替意根破除无明，断除三缚结，意识的解根本不能断除意根的疑，将来肯定要退转的。而意根断除结缚、断我见了，永远不会退转不承认。即使遇到极大的逆缘，有可能撒谎骗对方说自己不是个断我见之人，不是个菩萨，但是内心里的意根也不会退失信心和智慧之见地，无论怎样意根都会坚定不移，永远不会退失菩提道。</p><p>退不退是意识的问题，意根没办法退，定型的智慧认知，不会因外力而发生改变。众生因为那个我，生生世世生死流转，无量劫在地狱中受苦，也没有断除我见。一个意根证果和明心的人，怎么能轻易就退转，思想是那么容易转变的吗？意根证法思想转变，不会再变回去了，否则成佛也会变回凡夫。意根证法如果能退转，那就是很奇葩的一件事。如果思想是那么容易转变，断我见和开悟就是非常容易的事，成佛也是非常容易的事，何来的三大无量数劫的辛苦修道，才最终成佛？</p><p>十三、一切法的取证都在于意根</p><p>众生都把五阴的功能作用当作我，尤其是把识阴六识的觉受当作我和我所，执着自己的受觉，为此造作种种善恶业行，甚至不惜造作恶业行，因此业行就会沉沦生死受苦报。六识的觉受哪里来的？是在根尘相触以后生出来的，之后意根以此觉受为我而加以执取，造作贪爱的无明业。要想解除生死，就要观行六识觉受的虚幻不实性、苦性、空性和非我性，知道觉受是空幻不实的，不再注重觉受，心逐渐空了，就能够断我见，不再执取觉受了，贪嗔痴烦恼就会淡化和消除，不再造作无明恶业。能够把觉受观空是非常重要的一件事，五阴无我，觉受也非我，这是很重要的思想观念。</p><p> 六识的觉受容易观察得到，后面隐藏的意根的觉受是非常重要和关键的，意根因为有受，就会有贪嗔痴烦恼，因为执取觉受促使六识造作业行。意根认为一切法都是我的，都属于我所有，把意识当作是我的用，那么断我见是断意根的我见，证悟也是要意根证得第八识如来藏，因此一切法的取证全部在于意根，不在于意识。通过如实如理的观行，越观行越觉得最根本的修证就在意根上，意根是成佛的关键，也是生死轮回的主宰，把意根熏修成功了，就得解脱，成就佛道。</p><p>意根通过参究和思量，一旦证法，就会颠覆原来的不如理作意，心行改变，不再执取五阴，就得初步的解脱，这是修行的关键。为什么有些人学了很多理论以后，都觉得五阴不是我了，觉得是空的幻化的，但还是要为了五阴身造作染污业行，丝毫没有改变自己的心行？因为那些觉得是意识理解的那种觉得，根本不算数，意根没有实证，就会一如既往的认取五阴，随顺自心烦恼造业，因此所有的觉得都不可靠，任何一种法一定是意根证得才算数。</p><p>意根也一直把如来藏的种种功德都当作是自己的，把如来藏生出来的一切法都当作是我和我所，不知道一切法都是如来藏所幻化出来的，不知道就连自己本身也是如来藏幻化出来的，所以才造作无明业行。修学佛法就是要让意识从理论上知道这些法是无我的，知道如来藏的真实性，然后再熏染意根，让意根思量取证一切法中的如来藏，证得一切法都不是我和我所。</p><p>一切法都是如来藏幻化出来的，都不是意根的，都是如来藏的功能作用，意根证得这个理以后，心才会空，才能不再执取自我五阴，这样不仅能断我执，还能断法执，法执断尽就究竟成佛了。所以修行的关键都在意根，无明是意根的，断除无明就是要断除意根的无明，断除烦恼也是要断除意根的烦恼，得解脱是让意根得解脱，意根不再执取一切法，就没有束缚了，这就是解脱。成佛是谁成佛？因为六识是每生每世都会断灭的，所以六识不能成佛，是意根成佛，如来藏也不成佛，但究竟理地，意根也不成佛，到成佛那一天就知道了，没有佛可成，才能究竟成佛。</p><p>十四、直觉悟道是真悟</p><p>乔布斯说，要相信你的直觉，它超越思维，让你看到思维看不见的东西。乔布斯说的直觉就是意根的觉知，思惟就是意识的觉知。意识所能觉知的法是有限量的，意根的觉知是无限量的，意识无法觉知到很多意根所能觉知的法。</p><p>意根的觉知为什么叫作直觉呢？因为意根依着如来藏能直接了知一切法，意识了知法必须依靠意根，是间接了知的。楞严经中表达为意根默容一切法，一切法意根都能快速缘得到，至于对法知的程度那是另外一方面的事。所以意根的觉知非常快，直接与法相对，直接快速的了别法，知则知，不知则不知，不经过意识的分析推理，这时还没有意识的生起。而法一旦落入到意识里，必然要有一番思惟、分析、推理和判断，这就绕了很大一个圈子了，时间比较长，最后的结果就不真实，因为有推理测度的成分，不是当下见、当下知。</p><p>过去禅师引导学人开悟，一问话，学人如果翻眼挠脑思考，禅师上去就是一板子，告诉他说：要会则会，思量个什么？禅师们都是引导学人直觉悟道，不落思惟，问话当下悟则悟，不悟就不悟，不许落入意识的思惟当中。如果禅师引导你悟道，你琢磨了又琢磨，在你刚开始琢磨的时候，就应该一棒子打回家去，谁允许你琢磨又琢磨的。而如今有的人开悟却琢磨好几个小时，甚至好几天，这个结果就更不可信了。答案有可能琢磨对，但再对也不是，就是因为是意识琢磨出来的，不是直接见的，不是意根亲见的。</p><p>如果拷问一个人是否知道某件事，如果这个人支支吾吾的想了又想，不直接回答，那么这个人的话就不可信了，里面的思惟就有掩盖和掺假的成分。比如说你思惟、分析、推理、想象、琢磨北京的相貌，最后断定北京是如何又如何的，恭喜你琢磨对了，北京大略就是这个样子。但是因为你没有到过北京，就不是亲见北京的人。只有到过北京进入北京城里了，才是亲见北京的人，描述北京的相貌就会真真实实、细细致致，非常肯定，不容怀疑。这相当于断我见的断除三缚结，断除疑惑，没有疑虑。而没有到过北京的人，无论怎样描述北京的相貌，内心都是不踏实的，心虚的，不敢百分之百肯定的。这相当于意识的解悟，不能断除三缚结，无法断疑生信。</p><p>自己在背后默默的做足了功夫，只差那么一点点时，禅师才能引导你开悟证道，水到渠成，自自然然，丝毫不做作，丝毫不掺假。或者只差个因缘时节，那么禅师会观察你，会留意你的状态，看你到没到时节，时节一到，会给你机缘，让你悟入。如果观察你发现还差很多，那么禅师是绝对不会上手引导你的。可如今的开悟，学人还差十万八千里地，就硬是拿铁钩子拽，结果等于拔大萝卜一样，活活给拔死了，后世果报极其可怕。</p><p>十五、证悟后的心行转变</p><p>禅宗祖师说：悟后不异旧时人，只是不是旧时行履处。意思是说证悟以后，人还是原来的那个人，只是为人处事的心行却改变了，与从前不一样了，不同于过去的心行了，做事的用心改变了，对世界的看法改变了，对于五阴身的知见改变了。这些改变，说明证悟不仅是意识悟，意根必须悟，这样悟后才能不异旧时人，却不是旧时行履处。如果行履处没有改变，心行心性没有改变，那就要检查一下自己是真悟还是假悟。</p><p>十六、意识想归想意根做归做</p><p>一切法都无所得，心经里说以无所得故，菩提萨埵；金刚经里说，世尊因为心无所得故被燃灯古佛授记。有些人就想：既然一切法都无所得，都无我和我所，那根本都不要去折腾了，连思想也停下，干脆无为算了。这样想的时候心里就感觉非常轻松，但是这种状态并不能持续多大一会儿，马上又都有为了，遇缘遇事遇人一点都不无为。</p><p>因为在没有证得诸法空相的时候，意识所认为的空，一点力量也没有，根本做不了主，该怎样有还是怎样的有，丝毫空不了。意识想不动不造作，却不能作五阴身的主，作主的意根有所追求，想要造作什么，意识还必须随顺，一点办法也没有。所以意识虽然明了一些理，意根不明了，还是解决不了任何实质性的问题。所以意识证果明心根本改变不了什么，烦恼还照样烦恼，无明还照样无明，生死还照样生死。只有把作主的那个意根搞定，才能解决一切问题，发生天翻地覆的变化。</p><p>十七、意识和意根能否割裂开</p><p>意根是六识的染净依，意根染六识必染，意根净六识必净。那么意根不断我见，意识是否能够断我见？意根不断烦恼结缚，不断三缚结，意识能否断除三缚结？由于意根没有断除三缚结，命终被业障牵引去向地狱受报，意识这时候要去向哪里？</p><p>意根处于凡夫的无明位，意识能否单独成为初果的贤人？此人算作凡夫还是证果的贤人？还是一分为二割裂开？如果某人伤害了自己，意根非常执拗于我，非要实施报复不可，意识如何应对此事？在意识清醒并且明得正理，已经受熏的时候，可以给意根讲理，反熏意根，从而压制和降伏意根不去报复，造作恶业，而在临命终和中阴身时，意识力弱就没办法牵引意根，说服意根了。</p><p>在梦中意识能不能引导规劝意根？如果在梦中都不能把握自己，临命终时更不能把握自己了。什么叫作把握？是意识明理调伏意根，归正意根，把握好意根的方向。显然在临命终和中阴身里意识是没办法把握意根了，意根这时候就要随业力所牵，或者是随愿力所牵，不随意识牵。那么修行只停留在意识阶段，不肯前进一步，是不是很危险、不保靠？</p><p>十八、大脑决定意识功能的强弱</p><p>梦里的独头意识和梦外的独头意识有什么区别？在睡眠当中，气血运行弱下来了，大脑当中的气血运行也就弱下来了，六识是依靠大脑胜义根出生和运行的，在梦里独头意识出生以后，由于胜义根的问题，意识心功能比较弱，意识在梦里了别的就不够清楚和细致，记忆的就不牢固。如果意根觉得梦境非常重要，对其刺激很大，印象就会深刻，就会让独头意识加深印象。醒过来以后，意识就能记忆犹新，很清楚的回忆出梦境。</p><p>由于外力原因，损伤了大脑，造成了昏迷，六识消失。醒过来以后，有的人就会失忆。这是因为大脑受损，阻碍意识功能作用的发挥，意识对于信息的整合功能紊乱或者变弱，导致回忆不出某段时间的人事。一旦给与大脑强刺激，意识有可能会恢复记忆，回忆出从前的人事。儿童和幼年时期的记忆不牢固，就是因为大脑发育不完全，导致意识功能作用弱，记忆不牢固。老年人的意识普遍比年轻时候的意识功能弱，了别不细致，心思粗糙，就是所说的老糊涂。</p><p>气血运行不畅通，会损伤大脑，人会变得愚痴呆傻。所以六识是依他起性，是因缘所生法，是极其虚妄的，不可以依赖的，六识就不是我，也不是我所。在中阴身里，意识的功能作用更是微弱，因为中阴身是临时生起的，四大粗劣，远远比不上人身，严重阻碍意识的功能作用。所以在中阴身里，以意根的心行为主，意识无法有效的调控意根，意根的本性就决定了后世的趣向。所以意识证果，就是纸糊的果，意根同时证果，证量才会坚固不退，带到未来世。</p><p>十九、关于证果的对话</p><p>甲：证果明心只需要意识证就可以了，不需要意根也同时证。</p><p>乙：意识证果成为圣人以后，晚上睡着了，这时候是圣人身份还是凡夫身份？</p><p>乙：如果这个人没有醒过来的时候，是凡夫还是证果的人？如果这个人永远深度昏迷不醒了呢？</p><p>甲：第八识留有法种。</p><p>乙：第八识里的法种有很多呀，还有地狱极多极重的业种，到底以哪个业种算作他的身份？</p><p>甲：以业种重的意识证果为主。</p><p>乙：意识虽然证果了，但意根没有证果，意根的贪嗔痴无明烦恼也是重大的业种，意根无数的贪嗔痴地狱业种是不是要强于意识证果的业种？</p><p>甲：·········</p><p>乙：在投胎的时候意识灭了，是意根和第八识投胎，这时候是以意识的证果身份投胎，还是以意根的凡夫身份投胎？</p><p>甲：以第八识里的业种投胎。</p><p>乙：第八识里意根无数的贪嗔痴烦恼业种肯定强于意识的业种，意识熏习的法都不会成熟，因为太轻了，而与意根相应的烦恼业种非常重，这时候要投胎到哪里？</p><p>甲：意识证果的业种重。</p><p>乙：意识证果与意识相应，不与意根相应，由意识现行证果的智慧，意根的烦恼业种与意根相应，由意根现行烦恼的业行，这时候意识灭了，意识不能现行证果的智慧了，而意根却会现行贪嗔痴我见的烦恼业行，这时候要投胎到哪里？</p><p>甲：········</p><p>乙：如果熏习佛法都是意识熏习，在中阴身里意识还能有多大作用？中阴身里是意根的染污业力作用大，还是意识熏习的力量大？</p><p>甲：投胎时不一定都要经过中阴身，比如直接入地狱和升天。</p><p>乙：不经过中阴身的投胎都是生前造作了重大的善业和恶业，众生意识证果的善业大，还是意根不证果的贪嗔痴染污业大？意识证果难道不需要中阴身就直接升天吗？</p><p>甲：熏习了正法终究是有用的。</p><p>乙：虽然熏习了正法，但贪嗔痴烦恼具足，一点没有断，烦恼业种都留存在第八识里，中阴身里烦恼业现前，是依着烦恼业投胎，还是随着熏习的法投胎？</p><p>甲：依着意识证果的善业投胎。</p><p>乙：但是，意根毕竟没有证果，生前的贪嗔痴非常重，染污业种大于意识证果的业种，这时候应该是以强业先牵，以意根染污的凡夫身份投胎吧？</p><p>甲：·······</p><p>乙：如果想当然的认为只要学了佛法，就存了业种，就会投胎善道，离开了三恶道，这是非常偏执的想法。每个人虽然都熏习了善法，但是第八识里的恶业还是很重，善法不足以对抗恶法，终于还是以强大的恶法占据主导地位，这样怎么能避免三恶道的果报，而投生到善道呢？意识的熏习无论怎样也敌不过意根的业力，只有改变意根的业力，才能有把握投生善道。业力就是意根的力，意根不证果，业力就不能改变，必随意根的染污去向三恶道受报，无数学佛人命终的状况就证明了这个道理。</p></div>"
},{
    "title": "第十一章 意根杂谈",
    "author": "生如法师",
    "date": "2022年10月30日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  意根杂谈</strong></p><p>一、如何观察和降伏意根的遍计所执性</p><p>意根的遍计所执性就是普遍计较执著一切法，毫不间断地攀缘一切法，依靠着第八识能缘第八识所变现的一切法，刹那刹那都处于了知的状态，不肯舍弃于法，对接触的一切法都粘滞不休，过去的法、现在的法、未来的法在心中都粘滞不已，念头相续不断，无一法不念，无一法不粘，无一法不滞着，这就是意根的遍计所执性。因为意根有这样的特性，导致心中纷乱如麻，散乱如猿猴，念念不止，所以祂没有禅定，不能专注，消耗了极多的时间和精力在无意义的法上，智慧无法增进。</p><p>如果你有办法观察到意根的这些念头，就证得意根在攀缘和执著什么法，就会有办法对治和降伏意根的遍计所执性，从而能专注其心，提升定力和慧力。如何观察意根的遍计所执和念头呢？一是观察睡梦中出现的境界和心念，观察这些境界和念头是否是有序的还是杂乱无章、没有重点的，如果能观察到境界所指向的重点，和意根的心念所想，就能知道意根所执著和关注的内容，以及心中所存在的问题。</p><p>二是在刚刚睡醒的时候，观察自己的念头是什么，情绪如何，这些念头都是意根的，不是意识的，因为意识刚刚生出来，还来不及有什么念头和情绪。三是在定中观察来来去去的心念，定中意识已经清静下来没有念头了，可是内心还有一些心念不定止，忽明忽暗，忽轻忽重，不断的出现，生了灭，灭了生，这些心念都是意根的。在所有情况下心里的念头都是散乱的，没有定止，大多数都是不重要的无意义的，从这里就能了解和观察到意根的遍计所执性。由于这个遍计所执性，无始劫以来我们消耗浪费了极多的精力，却没有得到应该得到的善果，如此的处处攀缘真的得不偿失。</p><p>如何遏制和减少意根的遍计所执性呢？那就要不接触无意义的无用的人事物理，少接触种种境界，尽量屏蔽世间的烂人烂事和纠缠不清的人事，能少知一法就少知一法，能不知就不知，那些人事都没有什么意义，徒浪费时间精力，给心里留下不清净的念头。心中要不断的缘着一个有意义的法，专注于这个法上不动摇、不间断、不夹杂，以这个法为主线，日久功深心中的杂念就少了，散乱心就能得到降伏，心定了，精力集中了旺盛了，智慧就会增长。</p><p>二、意根的伶俐性</p><p>半夜睡觉了，六识灭了，屋里着火，意根想要跑，怎么办？意根的这个想法，没有身根的配合，没有六识的配合，祂无论如何，都无法实现。所以并不是说意根智慧很低劣，什么也做不了，而是祂要做什么，得有工具去用，如果没有工具就没有办法，只能像个低能儿一样了。</p><p>意根遇到这样紧急燃眉之事，肯定是急于醒过来，让意识了别到着火的事情，然后与五识一起跑路。意根一急，独头意识先出现，独头意识了别不清楚，就转为五俱意识，五识也随之出现，于是就醒过来了。意识一了别到事情紧急，就决定跑，意根同意以后，作主让五阴身跑，色身就跑出门去了。</p><p>在醒过来的时候，意识和鼻识一起生起，因为烟味大，所以鼻识先其他识生起。然后是眼识、身识、耳识和舌识出现，五识出现是有次第的，哪个尘重大，对应的哪个识就先生起。如果火光大，眼识先生起，如果房间里太热，身识先生起，如果火声大，喊声大，耳识先生起。</p><p>在危急时刻，身体动作非常快速，意识来不及想什么，就快速的躲过了危险。如果危急时刻，等意识了别了别，思惟思惟，恐怕人就出事了。这时候意识的作用就是与五识一起听从意根的安排，迅速行动。意根在危急时刻是非常伶俐的。</p><p>三、意根的活动是在大脑里还是在大脑外的虚空里？</p><p>意根如果在大脑外，跟自己就没有关系了，意根如果能在虚空里，那是谁的意根？思量的结果谁来执行？如何能根尘相触生出六识来反馈意根的思量？因此说意根不可能在大脑外的虚空里。大脑外是什么所在？一定是虚空吗？楞严经云：虚空生汝心内，如片云点太清里。这个心当然是指如来藏，但是意根是否也要随如来藏了别虚空？那么虚空是在意根内还是外？或者是意根是在虚空内或者外？意根默容和了别一切法，并不会拘碍于色身之内，十方三世的法随如来藏都能了别。从这里看出，我们的心究竟有多大？包太虚。</p><p>意根也是识心，识心不在色身的内外和中间而运转，因为识心无形无相，不能说识心在色身里或者是在色身外。而意根这个识心，能统摄色身内外一切法，与如来藏共同运转，如来藏所在之处，一定有意根跟随，如来藏不能单独运作什么法，本质境除外。意根不在之处，就没有生命现象，大脑里如果没有了意根，不但大脑不能运行了，整个色身都不能运行，生命就不存在了。五阴身所接触得到的法，都是如来藏运行的，都有意根相随，意根依如来藏都能了别，而五阴身所接触不到的法，也是如来藏运行的，也都有意根相随，这些法意根同样能了别得到。</p><p>比如说如果有人念佛得三昧，真想往生极乐世界，那么极乐世界莲花池中就会有他的莲花出现。这个莲花不单单是他的如来藏化现的，而是如来藏随着发愿往生的意根在极乐世界莲花池中建造的。那么意根在大脑内还是大脑外运作？这时候意根是不离大脑不离色身同时又在极乐世界。如果说意根只能在大脑内运作，那么极乐世界的莲花怎么说？属于谁的？诸大菩萨的意生身都由一个意根来统摄，各个分身的意根是在色身里还是色身外？</p><p>再比如说眼识看见面前有十个人，那么眼识到底触在哪个人的色相上？既然同时看见了十个人，那么十个人的色相，眼识都同时触了，没有说只能触到一个人不能同时触其他人。意根也如是，依如来藏能触同时如来藏所执持的一切法，不分内外和中间。胜义根内外都有同样的法，大脑内外都有同样的法，意根都能缘，也都能思量。但实际情况是，有胜义根的众生，不管他去到哪里，都跑不出他的胜义根，即使跑到天边去，也没走不出胜义根。意根的恒审思量是在一切法上，不仅思量胜义根内的法，也思量胜义根之外的法。祂不仅执身，也执法，就这个执最难办，三界世俗的执念，我们现在都没办法脱离开，所有的思惟都被限制住了，见识短的缘故。</p><p>四、五受阴尽是什么状态</p><p>五受阴对于众生七识来说是五种遮障，障碍七识的广大功德作用的发挥，障碍七识的神通妙用，使得七识所知和所做都被局限在小范围内，不得逾越，同时也障碍第八识的功德作用的发挥，大圆镜智不得现前。只有通过修习四禅八定，达到四禅以上禅定，才能渐次突破五受阴的限碍，而冲出五受阴的牢笼，如鸟出笼，获得自由，飞翔于广阔天地。</p><p>灭尽和破除五受阴，需要四禅以上的禅定，四禅定是舍念清净定，心没有念头，就没有一切障碍，可以发起任何神通道用，灭除身心上的遮障，不受任何阻碍。色阴是色身和一切有色之法，也是六尘境界，对七识有遮障妨碍作用，尤其是对六识有遮障和妨碍作用，意根要用六识作事，六识就作不了，所以才说五受阴对第七识也有遮障。</p><p> 色阴尽的时候，色身和境界色法对于六识心就没有遮障了，这意味着什么？色阴对六识心的遮障是什么？受色身和物质色法的影响，眼识要看远处而看不见，要看天上地下而看不见，要看其他星体而看不见，其他佛国土更是看不见，见色被局限在距离空间中；眼识要见高墙外、高山那边、深水和地里之色，却见不到，被物质色法所隔碍；眼识要在漆黑无光之处见色也不能见，见色被局限在光明中。</p><p>同样的，耳识要听远处的声音听不见，中间相隔密度大的物质就听不见声音，超出一定范围的声音都听不见，听声被空间距离和色法所阻碍；鼻识嗅不到遥远之处的香尘，被密度大的物质包装的味尘也嗅不到；舌识尝不到不与舌根相触的味尘；身识觉不到与身根不相触的触尘，意识不知前后世的人事物，也就是没有宿命通。</p><p>如果修到四禅定时，色阴就能破除，见色、听声、觉触就不会被色阴所阻碍了，那么眼通、耳通、鼻通、舌通就出现了，身体的神足通也会出现，意识的他心、通宿命通也会出现，这就是所说的五通自在，外道修行四禅八定也有这五通，还有一个漏尽通外道不能获得，因为那是断尽烦恼的智慧通，外道没有断我见，我执就不能断尽，就不能有漏尽通。色阴尽之后，要渐次破除受阴、想阴、行阴和识阴区宇，所见广大无碍，没有局限。</p><p>受阴区宇破尽了，才能不受身体觉受的局限和管控，不管色身如何，心都不受影响，火烧、刀割、水淹也奈何不得这个肉身，面对任何境界心都会如如不动。没有破除受阴区宇的时候，肉体的触觉就会影响六识心的波动。</p><p>这些神通都是意根发起的，原来意根也是想要了知广大的境界，迫于六识被五受阴遮障住了，意根就无可奈何，现在遮障被清除了，意根所愿就能实现无碍了。这需要非常大的福德作支撑，也需要戒律和禅定力的支撑，缺少这三种条件之一，都不能发起任何神通。</p><p>五、意根的决定性作用</p><p>眼根触色尘，分为外眼根触外色尘，内眼根触內色尘。只有内眼根触内色尘，才能有眼识出生了别色尘。可是眼根是物质色法，不是心，怎么能主动触色尘呢？例如眼前有树木，有石头，有草，有鲜花，眼根怎么就单单选择触鲜花，然后眼识就只了别鲜花，而不了别其他物体呢？眼根触色尘，要多长时间，眼识了别鲜花要多长时间，是由什么决定的？</p><p>这一切都由意根决定，意根是五阴身的主宰，是作主者。当然意根是个假主人，狐假虎威罢了，背后依靠着真正的主人第八识却不知。意根这个假主人在面对众多内色尘的时候，独选鲜花，因为内心心悦于鲜花，目前没有其他事情要照管，就只想欣赏鲜花，如果有重要的事情，就顾不上鲜花了。</p><p>意根想看鲜花，这个鲜花的色尘本来就落在内眼根那里，意根一决定，就会有眼识出生，这样眼根、色尘和眼识三者和合触，眼识就识别出了鲜花的色尘。眼识了别多长时间由意根决定，意根欣赏够了，不想再看鲜花，于是眼识在鲜花上消失，在别处出生。这个过程就有种子落谢下来，存入第八识中，就会产生后世的有，其中意根的贪爱和意识的贪爱也都被第八识如实的记录下来，成为种子。眼识也有轻微的贪爱，祂随顺于意根和意识才会有贪爱，眼识根本作不得主，完全不由自主。</p><p>我们要想解脱于世间苦，就不要让自己的行为落下种子，尤其是贪嗔痴的种子。那怎么办呢？就要控制意根的心念，不要有贪嗔痴烦恼，不要让六识造作不善的身口意行，或者是少造作一些身口意行，并且在造作时不要生起贪嗔痴烦恼，留也要留下清净的业种。</p><p>少造作业行由谁决定呢？由意根决定，业行的源头在意根这里，意根的无明缘行，是意根由于种种原因、种种心行、种种无明想要造作，业行才会出现，业种才留存下来，后世的苦才会出现。这样生死苦的源头找到了，以后应该如何行于世间就应该清楚了。减少触，减少触的时间，如果非触不可，在触时就要减少或者灭除心行，让心尽量空，不落下烦恼种子。慢慢这样训练自己，解脱就有希望了。</p><p>六、断我见和参禅的次第问题</p><p>究竟是先断我见然后再参禅，还是直接参禅求证悟，这个是没有定论的，需要视根器而定，法无定法，因人而异。对于大多数人都应该先求断我见，把五阴假我认识清楚了，在后续参禅时就不会真假不分，把假当真。如果是根器比较好的人，我见烦恼比较轻微，禅定也非常好，不落入意识的思惟当中，可以直接参禅，在参禅过程当中先把我见断掉，然后证真。</p><p>因为参禅就是在五阴身当中参证，离不开五阴十八界，在参究过程中，也能够一一辨别清楚五阴身的生灭不实性，从而断除我见。古时禅师们悟道都是如此，但是不保证没有解悟者，禅宗一千七百则公案中，并不都是证悟的，定力差一点，意识的功德作用就会强于意根，那就会解悟。解悟时，见得真心模模糊糊，只是一个大略的影子，观行智慧发不起来，烦恼不能减轻，我见也不能断除。这样反而耽误了道业，欲速则不达，适得其反。</p><p>现代人的禅定力普遍都比古时弱很多，意识心的思惟不容易压伏下来，意根的作用就会羸弱，证悟就很难，断我见也是很难的，理论了解的多，解悟容易，证悟反而更难。所以我们尽量都先观行五阴无我，之后再参禅，这样比较稳妥。</p><p>七、意念力的作用</p><p>为什么禅定深的人，用意念的力量就能治好病人的病？是直接第八识与第八识之间互动的结果吗？意念力最主要是意根念力的作用，其次也有意识念力的作用。意根的念力如果强大，心力就大，意志坚定，第八识就会配合，顺从意根的念力，实现意根所思所想所愿。意根的念力如果要强大，必须有很深的禅定，保证意根的作意力全部集中于一处，这样作用力才强大，促使第八识随顺其心，实现其愿。</p><p>如果念力强大，意念杀人，也能杀死人，意杀有动念和业行，所以也与身行一样属于杀人罪业，有恶报；意念救人，也能把人救活，有动念有业行，这属于善业，有善报；意念改变别人，也能把人改变，有业报。所以心念力非常强大的人，千万不要故意去招惹他，尽量随顺。如果触怒对方，对方一起意，不用动眼珠子，你就会倒霉，自己还不知道因为什么倒霉。意念力非常强大的人可以以一顶一万十万，相当于一个军队的力量，能改变对手的运势。心念力强大，一是福德所致，二是禅定力所致，三是慧力所致。修行就是以自己为主，佛菩萨为辅，相信自己的力量，逐渐减少依赖性，就会逐渐强大起来。</p><p>八、如何离苦</p><p>在修行过程中，一点点的把意根的无明灭除，烦恼灭除，我执灭除，意根无心于三界，三界法就会灭除，最后意根必灭，入无余涅槃，寂静清凉。无明是生死轮回的根本因主因，无明不灭，意行不断，三界中的贪欲就不断，生死苦就不断。然而众生习惯了生死苦，久处粪坑不觉臭，并不觉得生死是大苦，不觉得生死中有大苦，对于生死贪恋不已，在众生不想觉悟时，佛来也救不了。 </p><p>九、有心造业和无心造业哪个业大？ </p><p>有心是指有准备有目标有目的，是有意；无心是指没有准备没有目标没有目的，是无意。有心造业时，心不空，造善业时业小福小，无心行善时，心空，业大福大；有心造恶业时，心恶，业大罪大；无心造恶业时，无恶心，业小罪小。有心无心，要从目的和心行上去理解和观察，有无目的，有什么样的目的，也是关键。众生行善有心有目的，善就小，没有目的行善，善大；无心行恶，恶就小，有心故意行恶，恶就大。</p><p>发自内心的造业，是意根想造善恶业，善恶业都大，因为作主的根本心是善恶性质的。众生无心行善，就是本来没有行善的想法，心不善却机缘巧合下恰巧行了善，其福就小。这与佛的无心，不是一个道理，也不是一个层次的。行善不考虑果报，也属于无心，其福就大。由于善法的力量大，能暂时阻止恶业因缘成熟，大的恶业永远不让它成熟，这就是大愿的力量。没有这个力量，命终必随恶业势力而去，多数人都是如此。如来藏任何时候对任何人事都是无心，既没有福，也没有罪，其福其德最大。佛作一切事情都无心，其福无边大。</p></div>"
}]