[{
    "title": "第一章 意根的我见我执",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  意根的我见我执</strong></p><p>一、意根的我见</p><p>意根是六根之一，十八界之一，五蕴与十八界有一一对应关系。当每个人表达出我我我的时候，意根的我就冒头了，六识所表现出来的都是意根我的心行，体现的都是意根的心性。会观察人心理的人，能观察出一个人的本质也就是意根的心行，不会观察人的人，只能观察六识外表造作的假相，容易被假相所迷惑。现在看来，分不清意根与意识，还真的难断我见。</p><p>在观行六根的时候，就能观行到意根，祂是生起意识之根，同时也是作主识。只要观行这个作主识的不断变异性、不固定性、不自在性、能灭性，就知道了意根不能永远存在，其心行不断变异，也是无常的，因此也不是我。</p><p>确认意识的功能作用不是我，首先是意识反观自己，意识确认，再经过禅定中深细观行，意根参与对意识的观行，再进行思量参究，最后意根也确认意识的功能作用不是我，非我不异我。 还有一个时时处处作主的意根我，也要确认其虚妄无我，也是空的无常的。能依之生起意识的意根，也是非我的，先是意识确认，最后意根自己确认。在这之前要观行五识的功能作用，确认其生灭无常无我，这样几个识心的我见我所见就断除了，我所见也是不容易断除的。</p><p>这一切法的观行确认，主要是让意根确认，意识确认是第一步。因为就是意根把一切法当作我，才去指挥六识执取，执取之后意根就把六识的执取作用当作是自己的作用，认为我如何如何了，这个我就出现了现前了，明晃晃的。</p><p>意根无始劫以来一直把五蕴当作我，把色蕴当作我，就说身体是我（身我见），或者说我的身体（我所），然后就会贪爱色身，保养色身，护持色身，为了色身而促使六识不惜一切代价造作一切业行，包括恶业行。</p><p>意根把受蕴当作我，有时当作我所，认为受蕴就是我，我就是受蕴，受蕴是我所有的，我有受蕴的功能作用。于是为了受蕴，指挥六识不惜一切代价造作一切业行，包括恶业行。</p><p>意根把想蕴当作我，或者当作我所，认为想蕴就是我，我就是想蕴，我有想蕴的功能作用，想蕴的功能作用是我的。我能想，所想的法就是我的。于是指挥操控六识不惜一切代价造作一切业行，包括恶业行。</p><p>意根把行蕴当作我，或者当作我所，认为行蕴就是我，我就是行蕴，行蕴是我所有的，我有行蕴，我能行，我行的就是我所有的。于是为了行蕴，指挥操控六识不惜一切代价造作一切业行，包括恶业行。</p><p>意根把识蕴当作我，或者是我所，认为识蕴就是我，我就是识蕴，识蕴是我所有的，我有识蕴。我能识别，所识别的就是我所有的。于是为了识蕴不惜一切代价造作一切业行，包括恶业行。</p><p>二、观行不到意根如何断我见？</p><p>观行五蕴断我见，要知道意根是六根之一，也要观行其无我性，才能断我见证果。佛陀在楞严经里教导我们观行意根的方法，很究竟彻底，只是很难。越究竟的方法越难修，越简单的方法越方便，越不究竟。所以有能力的人不要贪图便宜快捷省力，不要怕付出世俗方面的代价，回报最重要，最有价值。世俗法再好也是苦恼，舍去苦恼，换回永不消失的珍宝，何乐而不为。</p><p>现在有一个很严重的问题出现了，意根为五蕴十八界之一，观行时也要把意根的虚妄无我性完完全全的观行出来。大多数人都观行不到意根，或者说极大多数人，或者说几乎所有人都观行不到，那怎么能断我见呢？怎么断除意根的我见？</p><p>三、观行无我时心烦意乱说明是触动到意根了</p><p>有的人为什么在思惟五阴无我到一定的时候，就开始心烦意乱，观行不下去了？这是因为意根有些感觉到了五阴是无我的，自身是不实在的，祂害怕真的无我了，害怕自己消失不见了。这正是意根无始劫以来执我的习性使然，从前没有接触过无我这样的内容，现在通过意识的思惟，明白一点，还没有完全明白无我之理，害怕意识再思惟下去，自己就没有了，抓不到了，于是就会心烦意乱，不让意识再思惟观行。</p><p>从这个现象看出，断我见就是要断意根的我见。在深细思惟观行的过程中，意根都参与，意识的思惟观行内容意根都知，然后自己再思量这些内容。意根在熏修到一定程度，完全可以理解无我之理，理解第八识之理，之后就能证得。意根对于佛法有一定的胜解力，否则意识熏染不了意根，学佛也就没有用了。意根开悟以后，就会逐渐获得大智慧，转识成智，获得平等性智，智慧圆满就成佛。</p><p>四、我执法执是如何出现和灭除的</p><p>无始劫以前，只有意根和如来藏，没有六识和五阴身，也没有世界。那时候意根就有无明，这个无明没有业种，因为没有六识去为意根造业。所以称意根是无记的，祂单独无法造业，必须有造业的工具才能造业。意根在后边垂帘听政，只负责拿着指挥棒指挥就行了，前线交际的事就交给了六识。表面看好像是六识造业，实际上都是意根坐镇指挥的，不明就里的人就把功过算在了六识头上。</p><p>而我执与法执也属于无明，没有业种，无始劫以前就存在着，不是造业造出来的。但是意识后天在环境当中的熏染，也会增加意根的我执和法执，强化意根的自我执着。这些无明只有通过修道才能逐渐灭除。因为无始劫以前就有无明，因无明而无缘无故造作业行，没有无明就不想造作业行了，佛菩萨的清净大愿除外。</p><p>因无明造作而形成的业种，叫作无明业，无明业又能辗转熏染强化意根的无明。这些无明业行是能够通过受报而灭除的，但无明必须通过证道才能消除，证得什么程度的道，就消除什么程度的无明。</p><p>五、观行无我时叹气说明意根的无奈</p><p>问：我观想五蕴非我时，忽然叹了一口气，有种失落感。叹气这个现象是在无意的时候发出的，显然不是意识的作用，应该是意根的作用，意根长久以来坚固的我执认定五蕴就是自己，可是结果不是这样，意根心里产生了落差，从而就叹气了。是这样吗？</p><p>答：这确实是意根无可奈何的叹气，祂有点不喜欢五蕴无我这个理，更不想否定自己无始劫以来的见取和执取，可又没有办法，因为五蕴无我也可能是事实，可能真的是如此。意根还没有思想准备去接受这个道理，就不得不叹口气。</p><p>六、意根如何才能断尽我执</p><p>意根之所以有我执，是因为有我见，之所以有我见，是因为有一念无明。意根因为一念无明的缘故，把第八识变现出来的一切法都当作我和我所有的，不知道都是第八识的，于是就有了我见和我所见。因为意根有了这样的恶邪见，知见不正，就执著第八识所出生和变现的五蕴十八界为我和我所有，不肯放弃，烦恼炽燃，生死不断。</p><p>要想断除意根的我执，首先就要断除意根的我见，有我见才能有我执，断除我见之后，才能慢慢断除我执，见错了才有执著。如果意根的见正了，知道五蕴十八界苦空无常无我，是不可把握的，就不会再执著五蕴十八界了，才能心清净得解脱。</p><p>意根断除我见，对五蕴无我的认知分为不同层次，因为无明不同，禅定不同，观行智慧不同，我见断除的深浅就不一。分别有四果的断我见，有三果的断我见，有二果的断我见，也有初果的断我见，每个果位，断我见的深浅程度也不同，获得的智慧也不同。就像一个学校里学生们的水平参差不齐，同年级同班级的学生水平也参差不齐一样。</p><p>初果断我见之后，再继续观行熏习五蕴苦空无常无我之理，智慧禅定越来越深，我见断得越来越彻底，因此对五蕴的执著越来越轻微，我执断尽就成为四果大阿罗汉。我见断尽我执断尽的人，一念无明也就断尽了，命终能入无余涅槃。</p><p>所以我见是我执的根源，断我执之前一定要断除我见。意根在四果时断尽我执，我见是什么时候开始断的呢？一定是初果就断除意根的我见了，断我见之后意根对五蕴的执著性才能一点点的松动减轻，烦恼也就越来越轻微，到一定时候就会证得二果。由于执著减轻烦恼轻微，五盖得到有效的降伏，初禅定才能发起，然后以初禅定中的功德受用，就断除了贪欲和嗔恚烦恼，成为三果人，之后我慢我执断尽，成为了四果人，与世间缘尽时就会入无余涅槃。</p><p>如果意根不断我见，就不能成为初果，也没有初果的解脱功德受用，就不能在此基础上再进一步观行成为烦恼轻微的二果人；不能成为二果人，就不能发起初禅成为三果人；不能成为三果人，就不能成为断尽烦恼的四果人。小乘修行次第就是如此，大乘菩萨也不能越过而不修，大乘菩萨的修行也要遵循此理此次第此程序。</p><p>七、意根执五蕴的功能作用而不是概念</p><p>意根也有证自证分。在观察的时候，是意识先观察，意根根据意识的观察，再做自己的观察，再思量，于是就会有自己的知见，得出自己的结论，一切都以意根的结论为主。意根依靠第八识见得第八识幻化出来的一切法，然后对这一切法生起自己的知见看法。意根不能了解的法，就要通过六识来了解，然后根据六识了解的内容，再做思考判断，得出自己的观点和结论。</p><p>意根对于我和我所的概念不是清晰的，甚至没有什么具体的概念，祂只看中功能作用，执取五蕴十八界的功能作用，包括执取自己本身的功能作用，而没有意根自己的概念。这点与意识的差别很大。当意根不认取五蕴我的时候，也包括不认取意根自己的功能作用。但是在初果的时候，对于无我的认知不如二果时清晰深透，二果不如三果清晰深透，三果不如四果清晰深透。所以初果时得法眼净，执取性虽然比从前降低减轻了，但不如二果三果时执取性轻微，四果时干脆没有执取性，不再取着五蕴十八界了，包括不取着意根自己的功能作用。</p><p>八、意根因为什么能断尽我执</p><p>意根因为学习了佛法，逐渐认识到了五阴无我之理，在真理和智慧阳光的照射下，心里的坚冰才会一点点的融化，最后灭尽。这个阶段需要很长时间，严格说从证得五阴无我时开始，不严格说，从接触了四圣谛法，能如理观行时就开始了。</p><p>首先要证得五阴无我，之后才能慢慢的破我执，这是修行次第。证得五阴无我的程度不同，意根减轻执著的程度就不同。断我见以后，意根对五阴的执著是越来越轻的，轻到一定程度，我执才能立刻就断。凡夫众生和初果人意根的执著很重，不是一次性断除的，是一点点减轻的，就像久积的坚冰，在阳光的照射下，先是一点点的融化，最后才消失不见。意根断除执著也是这样，先减轻，最后才能消失不见。这些法，如果没有禅定，就没有适当的思惟观行，那就无法理解，心里不能与法相应时，必然不感兴趣。如果连意识的理解都谈不上，那就不要谈实证了。</p><p>禅定不足时，所有的思惟，只能导致意识的解，不能实证。如果自己认为意识的解是究竟的，那么就无法实证了，所以有时候多知多解，也不是好事。禅宗祖师们最反对参禅人多知多解，认为知解是障道的根源。而现在人，几乎百分之百的人都追求多知多解，以知多而为傲。所以如今实证者寥寥无几，知解宗徒却遍地开花，佛法一旦泛滥，必迅速灭亡。</p><p>九、学佛成就的标志就是心空</p><p>如果认为一切法都是真实存在的，心就不能空，这个观念就是无明。有一个法你认为是真实的，这个法就会障碍你，成为你心中的尘埃，这个思想观念就是无明惑；乃至于说喜欢成佛，认为成佛这个法也是真实的，这仍然是无明。所有的无明都破尽，空去一切法，心中一法不留，才与如来藏等同，才能成佛，修到最后有一个想成佛的心，心中有成佛这个法，也成不了佛。修到内心里万法皆空，无相、无愿、无作，才是真正的成就。</p><p>八地菩萨之前的心有为的成分多，到八地菩萨时心就真无为，空了，内心才真正的无为无所作，随缘任运供养三宝，为众生、为佛教做事业时心也都是空的，佛才给授记成佛。心不空时，七地菩萨之前，尽管有为善法造作得很多，非常精进地供佛、供法、供僧，佛也不会给授记成佛，因为心里还是有为，法还是没有空净，与如来藏的无为不完全相应，无明还明显，佛就不给授记。虽然这个菩萨生生世世供佛，把三千大千世界的珠宝全部供养给佛法僧三宝，佛都不给授记，何况是造作那些世俗的有为法。</p><p>但是通过做这些有为法能增加自己的福德，用来获取成佛智慧的资粮增加了，才能使得智慧增长，所以不能说一切法皆空，我就什么福德也不修，那你心里还是空不了，还是有我。没有福德的支撑，真正的空的智慧就不会出现，就算认为某某法空，但也不能证得，所以不是真正的空，在行为造作上心还是不空。</p><p>既然修行是要认识和证得一切法空，我们在做事情的时候，不要认为做的越多越有功德，不是这样；在度众生的时候，不要认为摄受的众生越多越有功德，也不是这样。实际上是通过度众生这些菩萨事业，一方面能增加自己的福德，一方面能增长自己的慈悲心，一方面能不断的消除自我，灭除我心，让自心越来越空，越来越能看破，越来越不着相，心空到一定的程度，才是真正的成就，才有大作为。</p><p>功德的多少与做事情的多少不一定成正比，与度众生的多少也不一定成正比，关键是在做这些事情当中，心空到了什么程度，达到了什么程度的无为。所以真正的菩萨不会成天绞尽脑汁的想要摄受和影响多少多少数量的信众，认为这样才是最大的成就，不是这样；而是在这个过程当中，对于一切法的认识程度，心空到什么程度，这才真正代表你证得佛法的程度和深度，以这个为标准来衡量自己的功德，判断自己的菩萨果位。所以不要执著相，要通过相来观察其中的用心，在相上心越空，越无为，证法的程度越深，果位越高，所以修行千万不要执着什么相，抓取什么相。</p><p>就算你一年开一百场法会，摄受了十万百万众生，写出一百本书，或者一年供养三宝一亿十亿百亿，这些都是有为法，以此来生起内心的执着和傲慢，就是我相，着在相里，越执着心越不空，果位和证量越低。不明白这个理，就会在有为法上疯狂造作和攀比，我比所有人都强，比所有人都能，我是第一，我是唯一，这一切一切所谓的成就，全部落在了相上，全部是有为的，全部是执着的，内心一点也不空，那这就是生死业，造作得越多，心越不空，越是无明，越不得解脱。</p><p>有些人做的事情虽然没有那么多，但却有空的智慧，能看透一切事情的实质，不被现象所迷惑，不落入现象中而不能自拔。自身具有很深的空慧，自然就能带动身边的人也心空不执相，这样度众生的质量就高。如果菩萨心不空，随学的弟子心如何能空呢？菩萨执相，后边的人更执相，这样就背道而驰，与道不相应。所以修道就是要破相，破自心无明，执相是法执，是生死的根源。</p><p>十、断除意根的我见我执不需要现观意根的运作</p><p>现量观行意根的心行和运作以及心所法，需要修到意识和意根都转识成智的程度，也就是最低是初地菩萨的程度。意识意根转识成智，一是要断除我见，断除烦恼的现行，具有初禅以上的禅定，成为三果以上的圣人；二是要明心证得真心自性，具有甚深的般若智慧，具有大乘菩萨的别相智；三是过禅宗第三关，证得有余依涅槃；四是具有唯识种智。总体来说，要具有初禅以上的禅定，和大小乘的甚深解脱智慧。</p><p>这些观行都是用意识去观意根，同时意根也能随意识起观，而断我见是让意根意识都断我见，只要能观行证得意根也是能够灭亡不可久住的法就能断我见，不用现观意根的心行和运作这样特别深细的法。同理断除意根的俱生我执，只要让意根证得五阴十八界都非我非我所，在初禅定中依次断除烦恼就可以了，意根的我慢我执等等都会断除，从而成为四果大阿罗汉，不需要现观意根的运作和心行。</p><p>十一、佛法修证的根本目的就是解脱一切法缚</p><p>我们学佛修行从凡夫到成佛整个这一个过程，就是在不断的去证得这一切法都不是真实的，都是幻化的，都是影子，都是梦，都是无我的。到最后证得世俗界全部有为法，所有的法都不真实，都不是我，那个时候我们就从这个生死大梦当中彻底醒过来，那个时候才究竟解脱而成佛了，再也不用修行了。所以修行过程是不断的改变自己认知的过程，把一切法都当真，这样愚痴无明的心，我们在修道的过程中要慢慢的改变，改变到最后，认识到所有这一切法都不是真实的，最后全部都证得确实如此，都不是真实的，那么全部的心行就会都改变过来了，成为没有染污、没有愚痴无明的心，七识心彻底转识成智，就成佛了。</p><p>学佛修行的过程就是这样的，在这个过程中，自心不断脱离法的束缚，不断解脱出法缚，越来越自在。凡夫之所以不得解脱不得自在，原因就是认假为真，把三界世俗这些假象、幻化出的影子当作真实的，在其中执取、造作，然后被业行所拘执，心就不得解脱不得自在，就在这三界里生生死死的苦恼着。通过修行破除这些无明，让我们不再认假为真，破除一切相，得大解脱。</p><p>理就是这样一个理，看着不难，可是实际修行的过程要非常的漫长，因为意根无明太多太重，我执法执也太重，所以破无明需要非常非常漫长的时间。</p><p>十二、意根的我执是执什么？</p><p>意根的我执是与生俱来的，叫作俱生我执，主要是执五蕴十八界为我和我所有，为有真实作用，执我、执人、执众生、执寿命、执六尘境界、执六根作用、执六识的知和见、执受想行识、执色身。而对其他更微细的法的执着取名为法执，执法为真实的，为我所有的，为有实际作用的。当然对于很多法还不知道不了解的时候，就没办法执取。随着修行程度的不断加深，接触的法越来越多，越来越微细，心里的法执就会不断的出现和增强，就要不断的观行去伏除和断除。</p><p>意识也有执，只是没有意根严重，是处于境界中才出现的对境界的执著。对六尘境界接触的越多执著越多越重，叫作分别我执。意识的分别我执断断续续，时有时无，意识灭，执著就灭，意识明理时执著会降伏或灭亡。意识对境界的执取比意根的执著要轻微，。不那么顽固，说舍就能舍掉，也许睡宿觉就忘了。意根的执著，睡一辈子觉都忘不了，消除不掉，顽固透顶，有些时候，越逆着越顽固。</p><p>十三、意根的遍计所执性</p><p>大迦叶行头陀行，树下一坐，从来不在一棵树下打坐超过三天，到第三天必换一棵树，因为要避免对树产生执着，从而有生死系缚。俱解脱的大阿罗汉心都已经解脱了，随时随地都可以入无余涅槃，为什么还如此地看管自己的心呢？能看管的心是意识，觉悟性强，理智性强。被看管的心是意根，觉悟性和理智性差，具有遍计所执性，很容易对所遇的法生起执着，凡夫的意根可以说遇什么法就执着什么法。</p><p>意根为什么这么容易执着呢？意根从无始劫以前就无明深重，不知法理，不见法的实质和本质，只知法的表相，执取假相为究竟。又因为无明愚痴，不知自己愚痴，执取自己的见解不肯舍弃，因此意根很难度化，不容易扭转其认知和习气习惯。说起意根的习气和习惯，意根只要接触与自己的心相应的事物，超过三次就容易形成习惯。所谓的习惯，就是意根的惯性力量，愿意和喜欢顺前所思所做所想，不会灵活变通。意根的有些习惯，也并不是意根所喜欢的，接触多了，就会形成机械化的思想和心行。</p><p>为什么意根有机戒化的惯性？因为意根愚痴，不善思惟，对于接触成熟多时间长的法，就会自动接受下来，然后执取照做，从而形成了习惯和自然性。对于意识六识，就是不自觉的就说了什么做了什么想了什么，控制不住。因为意根执拗，怎么能容易控制呢？况且如果意识也不觉悟，没有控制的想法和念头，就更突出了意根的习气和惯性。</p><p>十四、意根习惯的形成</p><p>世上本没有路，走的人多了也就成了路，意根本没有习惯，接触多了常做也就成了习惯。一旦意根养成了习惯，就不会轻易的去除和改正，哪管是无意义的事，意根一但习惯了，以后照做不误。祂不会思惟说，这件事是否有意义，是否值得去做，是否值得付出多大的代价，祂全然不顾，从这点来看，意根是愚痴的，智慧低劣。</p><p>从意根的愚痴性和容易形成习惯性来看，意根具有遍计所执性，如果是智慧性的，就不会有遍计所执性，有智慧就不执，更不会遍计所执。因为意根的愚痴性，对于善法反倒不容易形成习惯，也不容易生起执着。当然执着善法也是生死系缚，不能解脱，但修行是有次第的，以善治恶，是修行的初步，恶法去除，善法也不留，心空与道相应，道力具足。</p><p>无始劫前，意根所处的环境是恶法多，善法少，或者没有善法，所以意根与恶法相应，与善法不相应，祂就习惯于恶法，不习惯于善法，用善法熏染比较困难，但是要想脱离苦海轮回，再困难也要坚持熏染善法，只要坚持就是胜利。</p><p>十五、意根的遍计所执性能不能去除</p><p>执，就是滞、不通、阻碍、障碍、结缚、生死、不自在，因此有执就不能涅槃解脱；无执，就是融通、软、柔韧、通达、豁然、贯通、光明。</p><p>意根一旦恶也不执，善也不执，不善不恶也不执，所遇一切法都没有障碍，心融通解脱无碍，成佛有余。近朱者赤近墨者黑，意根无明重执着重的时候，远离恶法，亲近善法，才能不熏染恶法，逐渐去除恶法，不执恶法；亲近善法，才能熏染善法，心善解脱。每个人的意根都执着些什么法，平时多加以观察，只要知道自己在执着什么就好办，早晚会改正去除执性。</p><p>意根的遍计所执性包括执着与五蕴十八界有关的人我，和执着微细的法我。凡夫两种执着都比较严重，以执人我为主，对法我的认识不多也不深，因此还谈不到有多执着。阿罗汉辟支佛的意根断除了人我见，因此随后也就断除了人我执，不再执着五蕴十八界人我。而十地菩萨断除了不同程度的法我见，因此也随后断除了不同程度的法我执，当菩萨把法我执断尽时，菩萨无明断尽，就成佛。</p><p>一切的执着都因错误的知见而有，一旦破除错误的知见，执着随后就会逐渐断除。因此意根有无明就有邪见，也就有遍计所执性。意根的无明断除一部分，遍计所执性就会减少一部分，以至执着越来越少越来越轻微，最后灭尽成佛。可见，意根的遍计所执性通过不断深入的修行就能够灭除。</p><p>十六、众生为什么不解脱</p><p>因为末那识恒执赖耶见分所见的法为我和我所有，被法所系缚，所以不解脱。阿赖耶识见什么法，就如镜子般显现出什么法，显现出来的法，被末那识缘到以后，就认为这些法都是我和我所有的，于是生起了贪爱和执着。如果末那识明确认识到这些法明明都是阿赖耶识的，并不是我的，末那识就断除了无明，断除了人我见和法我见，获得了正见，就不再执取这些法为我和我所有，于是就解脱于一切法，成佛了。</p><p>十七、断我执的人是否还有念头</p><p>断我执之后，还有一些有关切身生存方面的念头，与人打交道时不可能没有念头，遇到各种境界时都会生起如何处理的念头，为众生随缘讲法也会生起念头，这些念头比较清净轻微，都是随缘性质的，没有刻意想造作的念头，不是很执自我什么的念头。佛陀到世间来也有念头，那些念头都是清净的无我无私的，没有什么执著的。因为几个识的心所法里都有念心所法，识心运作免不了有念头出现。</p><p>但断我执的人与没有断我执的人念头有很大区别，念头能够体现出一个人有没有执著，执著的人念头强烈，不执著的人念头轻微，心境是随缘轻松。断我执的人对未来世没有什么念想了，不会安排后世为后世打算，当然今世是随缘活着应付周遭的一切，没有什么追求了，活一天算一天，不与人争，对于度众生的事同样是随缘，有缘时讲点法，无缘时也不想，总之，所有的念头大多是被迫生起的，很少主动生起什么念头。</p><p>在应付的心态之下，意识的念头明显，意根很淡。由于意根的念头淡而少，导致意识的念头也少而轻微，被动的时候多。由于意根没有什么大的心思想法，就没有梦境，平时心安气闲，心境平和。</p><p>十八、器官被移植以后意根仍然会执</p><p>问：器官移植时，内脏出来以后，六识不在内脏上活动了，那么内脏一蹦一跳的是什么功能作用？把内脏移植到别人身体中，会有什么现象？</p><p>答：内脏离体以后，就与六识无关了，但与意根和如来藏还有关系，意根还执为我，如来藏的执持作用还存在，内脏的神经系统暂时还会活动，内脏看着就是一蹦一跳的。器官移植，相当于父母把本属于孩子的宝贝东西送给其他小朋友一样。如果两个小朋友关系不错，父母把自己的宝贝送给小朋友还能接受，也许心里要忍一忍，并且能忍得住，不会反对和要回来。如果两个小朋友关系不好，那么就不会允许父母把自己的宝贝送给对方，就会耍脾气大闹起来，或者去夺回来。</p><p>这里主要是意根的问题，器官移植成功与否，多数在于意根，意根不执著自己的器官，移植成功把握就大；如果意根很执著自己的器官，移植后就会出现排斥反应，移植就不会成功。即使健康的正常人，如果意根不再执取自己的色身，完全放弃色身，有可能马上就死亡，所以生死在于意根。</p><p>器官移植以后，两个人的如来藏共同合作一小段时间，意根差不多完全放弃自己的器官时，那个器官就成为移植人的了，器官就由移植人的如来藏单独执持维护。如果移植大脑，意根没有了住处，就会跟着大脑过去，就等于把全部意根都移走了，那么移植的人大脑就改换了，不再是原来那个人的思惟模式了，情绪等等也都改变了。</p><p>病人在移植器官以后，会出现排异反应，除了基因等等各种因素之外，其中一个原因是捐献器官的人意根排斥。大多数捐献器官都不是本人主动的，生前没有表态说死后愿意把器官捐出去，而是家属作主把死者的器官捐出来的。如果死者不愿意，那么器官到病人身体里以后，死者意根干涉排斥，就会出现排异反应。或者死者生前虽然同意捐献器官，但是在临死还没有死透的时候，就动刀摘器官，死者非常痛苦，就会起嗔心后悔，那么器官到病人身体里，死者意根可能有抵触情绪，病人就会出现排异反应。</p><p>十九、肉离体以后还能动是意根执的缘故</p><p>问：一个人意外断指后，因意根执着，在一定时间内及时接上，就能恢复使用功能。可是当器官或部分肉体离开主身后，还能有鲜明的生命特征(如扭曲，跳动等），有点难理解了。意根通过什么来让那个器官或部分身体保持活动的呢？就如同没有了浮尘根，意根和如来藏是怎么掌控离体器官或被切割的肉体呢？如来藏可以凭空通过意根给离体器官输出种子吗？还是这个跳动只是无意识的神经性反应?</p><p>答：刚刚离体器官和身体上的器官一样，都是由意根和如来藏共同维护的，如来藏提供四大种子满足身根的需求，意根一旦认为离体器官没用了，就会放弃，那么如来藏就不再输出四大种子，那些器官就没有生命活力了。</p><p>四大种子在器官上不断的生成和散灭，器官就会有四大特征，有风的动转性，有地的牢固性，有水的滋润性，有火的暖性。种子组成的微粒不断的生住异灭，促使微粒不断的运动变化，就有了各种能量。比如动能、热能、势能等等。</p><p>刚刚离体的肉会动，是因为神经组织仍然有传导功能作用，细胞功能没有坏死，意根和如来藏都在维护着。意根越执着，肉动的时间越长。有的畜生已经死了很久了，身体被分解成一块一块的被卖掉，肉还在动，这个畜生非常执着自己的身体，谁买了它的肉，它都知道，将来一定会讨债讨回去的。众生遇到一起，有报恩还债的，有冤冤相报的，恩恩怨怨关系特别复杂，没有一个人没有冤家的。</p><p>二十、意根的苦受</p><p>问：当畜牲的肉体被分解后仍在抽搐，此时意根的苦受是否特别严重？被分解的肉体还会有强烈的痛苦感吗？</p><p>答：肉体无论被分解以及免疫被分解，都没有苦受和乐受，有受的是识心五识和意识。意根不会有色身触尘上的苦受和乐受，这是身识所感知的生理上的苦受，意识的苦受是精神上的。违逆其心，不顺己意，意根不高兴就是苦受。意根非常贪爱和嗔恚，因为其执着，越执着就越贪爱不舍，也越嗔恚。意根不希望死，不希望被杀被吃，所以有嗔心有苦受，如果自己被救，也会有感恩之心。所以意根会报恩、抱怨和报仇，意根心里的嗔毒足以让人不舒服，嗔愿足以让人受恶报和恶果。</p><p>二十一、意根的执著性</p><p>从活体当中刚刚取出的内脏，个个都是鲜活有生命力的，神经细胞都在动，生命特征很明显。为什么内脏离体了还是鲜活的？因为有意根的执取，如来藏就会输出种子维持内脏器官的存活。</p><p>从人类临死亡时来看每个人意根的执身性，越执身的人死亡越慢，苦受越多越重，执身越轻微的人，死亡越快速，苦受越少越轻微。趣向地狱众生除外。执身严重的人都是烦恼重的人，这样的人善业轻微，往往是临终没有什么瑞相，不知往何处去，就会严重执身，越执身心越苦。这是恶性循环，一般人没有修行跳不出来。善业多而大的人，临终往往有一些瑞相和好的征兆，就心向善处不太执身，死亡就快速。</p><p>所以平时多训练自己，尽量减少对于人事物理的执著，临终就少有苦受，在平时日常生活中，苦受也会非常少。所以越少执着，越接近解脱，活得越轻松。不管执着什么都是负累和负担，执，本身就是愚痴的一种表现，有智慧的人能看得明白，放得下，不会去执着什么人事物理，以增加自己身心的负担。</p><p>二十二、意根的遍计所执性什么时候能去除</p><p>众生就是因为意根的遍计所执性，才有种种生死轮回苦，去除意根的遍计所执性就会得涅槃。但是遍计所执性不是那么容易去除的，需要断我见，断我执，证真如，法我执也都灭尽的时候，意根的遍计所执性才能完全彻底的去除，得大解脱。</p><p>二十三、凡夫众生能否执著第八识为我</p><p>证得第八识的人才开始执著第八识为我，没有证得第八识的时候，凡夫的意根没有办法执第八识为我。真正证得第八识开悟以后，经过后续不断的修行，也要渐渐的断除意根对第八识的执著，才能到禅宗第三关，才能得解脱。</p><p>众生如果能执著第八识，就不再执著五阴为我了。如果不证得第八识，如何能执著第八识？每个人尽管去执著第八识，只要能稍微执著一点第八识，就会发起一点真如三昧，功德无量。</p><p>二十四、无余涅槃是谁把意根灭了</p><p>到临涅槃时，十七界灭尽，意根自动消失，没有能灭意根者。如果有能灭意根者，那就还有一个我，有我就不能入无余涅槃，无我才能灭度。如果还有一个能，能就是我，所就是我所，没有谁把意根当作我所，无能无所，才能灭度，有能有所，无法灭度。</p><p>灭度也不是意根愿意灭掉自己而灭，也不是灭掉了意根。而是因为意根不再执著任何一个法，不再对任何一个法有欲，意根不欲造作，无所希求，思心所不出现，如来藏也就无所造作，不再出生法，一个个法就会消失掉，最后如来藏见意根什么心行也没有了，就不输出意根的识种子，意根自然灭掉。</p><p>二十五、意根能控制刚刚断掉的蛇头</p><p>问：蛇头被打断，蛇头仍然能咬人。指挥条件反射的神经在蛇的肢体上，头断后，各个器官在一定时间内还是能单独维持原有的动作功能，所以斩下的蛇头一经触碰，仍然会发生条件反射而咬人。用唯识原理如何解释呢？</p><p>答：刚刚斩断的蛇头，还有意根和第八识执持着，大脑的神经还连接着蛇身，所以意根还能够控制全身，主要以控制头部为主。因为意根就在大脑部，控制中枢神经系统，以控制全身。这时六识还没有灭，头部的活动，仍然有身识意识参与。如果神经断了，意根无法再通过神经系统指挥身体，蛇身就不能动，只能指挥控制头部。</p><p>六道生死轮回的凡夫执身都很严重，不仅仅是蛇。有的动物头掉了还能走路，半个头还能活好几个月。有的人成为植物人很久了，也不肯舍弃身体，也有人很久不能进食非常虚弱了，却还要顽强的活下去。一般人称这种现象为生命的意志，其实就是意根对色身的执着。</p><p>这里面有没有意识的执着？六识这些工具和助手，意根能用则用，实在用不了才放弃，这时就选择离身而死亡。生命到最后还顽强，是意根执身，努力不让六识灭去，努力用六识进行了别活动，努力让意识保持清醒，六识就要挣扎着活动和活着，尽管很痛苦。</p><p>从这里看出，所谓的我，就是指意根，意根在百分之九十多的程度上代表着五阴我，所以断我见必须要断除意根的我见，否则就没有断我见。意识断我见没有任何力量，意根还会让意识有我见，意识摆脱不了意根的控制。</p><p>二十六、如何让意根快速接受佛法改变自己</p><p>意根无量劫在欲界里生存，对于五阴世间的世俗法已经非常熟悉了，意根对于佛法比较陌生不熟悉，因为无量劫的接触，有世俗法的智慧；佛法对于意根来说比较新鲜不熟，智慧和经验不足，无法作出正确合理快速的判断，因此不容易接受佛法，也不容易理解佛法，更不容易依佛法修持自己，极不容易依佛法改正自己。这就有必要让意识常常接触佛法，正确合理的理解佛法，以此来熏染意根，让意根熟悉佛法，对佛法感兴趣，愿意修学佛法，愿意依佛法改正自己。让意根对佛法的生处转熟，对世俗法的熟处转生，修行进道就会很快了。</p><p>二十七、如何破意根的法执</p><p>法执的范围太广了，凡是有所执都是法执，包括对五阴身的人我执，除了五阴身之外的更细微而宽泛的法，对其有执著都是法执。如何破法执呢？首先需要证得如来藏，修出唯识种智，然后观察一切法是否真实存在，是否有其自在自主性，通过深细观察发现一切法都是如来藏依某些缘出生的，都是生灭幻化的，没有自身的真实性自主性自在性，实质都是如来藏的功能作用，是一真法界中的一法，全部是如来藏运作的，根本没有什么可执著的，抓不住取不了。这样心就会松动，不再执取了，法执就破。</p><p>世俗界没有实质的有为相，那还要造作什么呢？心究竟空了，就成佛。对每个法的无明执取性都灭了，也就没有什么可贪着执著的。破法执的路途非常慢长，从初地开始到成佛，两大阿僧祇劫这么长的路要走。一大阿僧袛劫破我执，两大阿僧袛劫一直破法执，仅仅是断我见就有很长的路需要走，可见修行的不易，意根的无明和执著多么的深重。</p><p>所有的执著，我执和法执都是意根的执，意根是这样的执著，所以破意根的执著。首先就要破意根的我见和法见，破意根的思想缠缚，那就要断意根的我见和法见。一切法为真实的知见都要一点点的破除，之后执著才能减少和灭除。执著灭尽了，无明断尽了，心全部空寂了就成佛。</p><p>修行成就的标志，就是在于心空的程度，在于无明知见破除到什么程度。把一切法的法相都看空，观察它如何是空的、无我的、不自在的、不真实的、生灭变异的，心就空了，就不想再造作无意义的有为法，内心里无相无愿也无作，与如来藏一致，就是如来佛。</p></div>"
},{
    "title": "第二章 意根与证果",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  意根与证果</strong></p><p>一、前世证果时间越长今世证果越快</p><p>佛在世时的大根器众生、极大根器的众生可以在听闻五阴无我之理的当下，不用反反复复的思惟观行，就证得四果阿罗汉，袈裟着身，须发自落，神通现前。比如大迦叶、舍利弗、须菩提等等，那是因为他们前世证得四果到现在已经无量劫了，甚至是三个无量劫，其身份可能是佛再来者，生来就有禅定，就有宿命通，生来就是阿罗汉，他们当然可以示现听闻一句话马上证果。因为意根在无量劫以前就证果了，意根一直没有断灭过，一直都知道五阴无我，不用意识再费力的熏意根教导意根，他们今世的五阴虽然是新的，意识虽然是新的，遇到佛法意识稍微一思惟，意识就证果了，这样证果才非常快，因为不用管意根证果的事。</p><p>如果意识有宿命通，意识也同样生来就知道五阴无我，不用再断我见证果了。但为了度众生，影响众生，可以示现证果，今世的意识听闻一句佛法，不用思惟，就能证得五阴无我。而意根一直是知道的，凡是前世证过果的人，今世证果都很快，不用意识再去熏染意根，教导意根。前世证果的次数越多，今世证果越快，因为意根没有无明遮障了。意根被熏染被扭转过的人，非常伶俐，只要意识能理解就可以了。如果前世证得了初果，今世再证得初果就容易，但证得二果就不容易了，因为意根只相应到初果那样的观行智慧。</p><p>前世证得二果的人，今世再证得二果就比较容易，但证得三果就不容易了，因为意根与三果还不相应，必须再熏染教导三果的内容，意识与意根才能证得三果。前世证得三果的人，今世再证得三果比较容易，但是证得四果就不容易了，因为意根不与四果的境界相应，必须再熏染教导四果的内容，意识与意根才能证得四果。这就是再来人证果和明心比别人快速的原因。</p><p>二、意根前世是否证果决定今世证果的快慢</p><p>没有隔阴之谜的再来人，生来就是圣人，对于一切法都不迷，自己知道自己修行的果位，智慧程度如何。因为意根前世已经证了，今世的意识虽然是新的，但是有宿命通，前世证得的佛法今世照样都知道，一点也不迷，由于六七识都不迷，都有智慧，与前世都能连接得上，因此生来就是圣人，不用再重新证。</p><p>如果前世只是意识证，意根不证，意根还是迷，那么今世意根迷，意识也是迷，两个识都迷的话，必须共同修定观行思惟，准备证果。但是由于前世意根没有证，对于五阴无我一点印象也没有，熏染意根非常困难。意识又是新的，对前世修行的也没有印象，必须从头开始，这样的话，就需要很久时间的熏习，非常不容易。</p><p>有隔阴之谜的再来人，今世重新证果明心，还需要非常精进的修学几年，才能重新证果和明心。那么多前世没有基础的凡夫，今世遇见佛法短短两三年三五年就说自己证果了，这里肯定有很多误会。</p><p>佛说证果明心的前提条件是三十七道品具足，菩萨六度具足，戒定慧具足，之后因缘具足，才能证果。可是现在不是这样了，佛说的话都不起作用了，不需要辛苦修行三十七道品和菩萨六度，也不需要修戒定慧，戒律可以不受不守，禅定可以不修，参禅可以不用参，理解理解，知道某个浅显的理就行了，果就到手了。越没有禅定，烦恼越重，越不能守戒的人，证果越容易，一步步老老实实按照世尊指示修行的人反而不容易证果，这就是颠倒时代的乱象。</p><p>三、证果的快慢要看前世熏习的时间</p><p>阿难的身份据经上记载，可能是佛再来者，与释迦佛同时发心修行。释迦佛身边十大弟子其身份都很特殊，据经上记载，也都是佛再来，护持释迦佛在娑婆世界弘法，一佛出世，千佛拥护。不仅十大弟子的身份特殊，佛身边的大弟子们身份都很特殊，乃至于外道身份外道头目的身份也都很特殊。一佛出世弘法，弟子们都会化作各种身份来维护辅佐世尊，才能演好娑婆世界度众生的大戏。</p><p>因此说前世在无量劫中都证过果的人，今世在闻法的当下就会证得阿罗汉果，那都不是什么问题，都不用思考几分钟，这就是根器。只有他的意识明白五蕴无我就行了，意根生生世世都证得了阿罗汉果，自然不用再熏习。而前世没有熏习过四圣谛法的人，今世不可能很快断我见证初果，需要熏习很多世，才能证初果，二果就很困难了。所以不要看一个人证果的时间早晚和速度，要看他前世熏习了多长时间。修行是累生累世的事，不是一生一世就能成办的。不要看别人的成果，要看他的过程，过程最能说明问题。</p><p>四、真正断我见时断一个老实一个</p><p>有人觉得意识意根从本质上本就没有所谓的自己，都是如来藏自己玩的把戏，意识意根都不是我，本质上都是如来藏。如果有人真有这样的感觉也是相似的理解，臆测而已，不是证，还需继续努力求证。因为这种认知太肤浅，根本没有任何证据，意识都不当真，何况意根，更不当真了。只有真正证得的时候，才知道意识意根都不是我，证得第八识以后，现观六七识是如何被第八识出生的，才真正知道六七识本质上也是第八识，这种现观非常困难和不容易，需要证量很大，禅定力很好，否则还是理解猜测的成分多。有些法理解了一万年，也不见得有证悟的缘出现，真实证悟需要累生累世积累善根福德各种见道资粮，不是说一说就轻松证得了。</p><p>有些人非要说佛世时那些人证悟非常容易，其实他们得到那个果时，已经积累了相当长时间的福德资粮，戒定慧都已经具足了，遇到佛那样的大因缘，一下子就证悟了。他们前世的身份都挺特殊，生生世世修行都非常精进。其中有不少人都是示现，为了配合佛陀弘法，一班人里什么身份都有，都是十方世界过来配合佛陀唱戏的。</p><p>为什么意识的理解和明白不是证呢？譬如学佛人都知道畜生属于六道轮回之一的众生，我们前世也都当过畜生，吃畜生肉就是不慈悲众生，就是欠畜生债，将来要加倍偿还。可是这种知有什么用吗？因为都是没有实证，只是相信佛陀所讲的因果道理，亲身经历的都忘记了，所以心里还是将信将疑的，导致断肉戒荤腥是那样的难。信归信，做归做，没有实证的信，很难起用。</p><p>现在学习的所有理论知识也是这样，意识虽然理解认可了，因为没有实证，这种解仍然不能有实际作用。在生死大事上，非常容易的证悟是不可能出现的，轮回了无量劫又不可说劫，无明深重得不可说，怎么能看看书，学习学习，了解了解就是证了呢？很多人都抱着侥幸心理，其实就是投机取巧的心理作怪，这恰恰证明了大多数人还是很无知，无明深重。</p><p>真正断我见时，断一个老实一个，谁断谁老实，因为真实的证得了无我，真知道无我了，心里马上谦卑下来，不会再张扬去炫耀自我了，不会去炫耀我证果了。如果有炫耀的心，那就没有断我见，而且又多了一个证果的我，这样两个我出现，当然烦恼会比从前还要重，简直不可一世，我慢炽盛。我遇见好多位证果明心的人都有点飞扬跋扈，不可一世，感觉自己比天还高，心中那两个我，一个比一个明显，自己却不自知，就是因为被果给害的。</p><p>五、推理出来的结果不能当作现量</p><p>推理的方法是比量，不是现量。比如世俗法中公安人员办案，都是要到有关现场查找嫌疑人犯罪证据的方式来办案，没有依靠坐在办公桌前意识分析推理来办案的，即使推理正确，也决不能当作证据。虽然在调查取证过程中有推理活动，但是推理是为了尽快的寻找证据，没有找到证据，此种推理就作废，推倒重来。如果没有可靠准确的证据，犯罪嫌疑人的嫌疑再大，也不能定罪，只能无罪释放。法院给犯人判案，全部依据事实和有力的证据，没有用推理给犯人定罪的。</p><p>比如说甲对办案人员说：根据乙的日常表现，以及他的习惯，我的金表一定是乙偷走的。这是推断，不是事实，没有现场抓到乙正在偷金表，推断属于比量和非量，不是现量。办案人员以及法院不可能根据甲的推断而给乙定罪，即使甲推断正确，也不能算是事实，不能作为定罪的依据，即使大家都明知道一定是乙偷的，也不能给乙定罪。</p><p>佛法上的证悟也如是，即使逻辑思惟力再强，推理再正确，也不是事实，不属于证悟。在推理过程中不能否定自己从而断我见，因为意根没有见到事实，没有身心的触动，就不能否定五阴自己，就不能断我见。没有断我见，就不能证悟，但允许解，解就没有什么功德受用了，不能得法眼净，不能出生解脱的心。佛法的实证都严格体现了客观规律，比世俗法更严谨，不容一丝一毫差错，没有确凿的事实依据，意根就不能证得，这是没有办法的。</p><p>意识的推理是为谁推的？是为意根推理的，为了让意根明白。意识的分析是为谁分析的？是为意根分析的，为了让意根明白。因为意根不会推理和分析，因此往往遇事拿不定主意。意识分析推理之后，就会明白一些事，就能作以判断，做决策。</p><p>六、口耳相传和意下卜度出来的都是赝品</p><p>推理永远代替不了现量观察，如果能代替实证现量观察，那么佛把自己内心的证量，一点一点全部讲给我们听，之后我们花几十年时间理解背诵发挥，最后烂熟于心，那不就成佛了吗？花几十年时间就与佛的智慧完全等同，那是多么便捷的修行方法，佛为什么没有教我们这样修行呢？还要修什么戒定慧，那么辛苦。这样修行一生成佛不是什么难事，诸佛为什么还要修行三大阿僧祇劫那么久远？背诵佛语总比修行戒定慧、菩萨六度要轻松无量倍。如果佛把所有佛法修证的秘密都告诉我们，我们是不是都能实证一切种智，然后快速成佛？</p><p>真实的道理是，口耳相传的不是从自己胸襟里掏出来的，永远是假货，经不起风吹浪打。意识推理用多了，意根就使不上力，这是禅宗祖师最反感反对的，说是意下卜度，情思意解，不是真功夫。意识心用多了，意根就无法用功，那就不能实证。此消彼长，用谁的知见证量最好呢？</p><p>意根的主导性是实证的基础，如果不用意根实证，满天下都可以是烦恼深重的圣人，用意根实证只有久经修行的大善根大福德人才能证得，这样的人数量极少。各人吃饭各人饱，意识知的证的代替不了意根，意根必须自己也知也证，才能断疑，才能解决生死问题。要想让意根证，就离不开禅定，因为实证就是三昧，一切三昧都离不开禅定，没有禅定，就没有三昧，没有三昧就没有实证。如果想让意根出生智慧，在关键之处关键之时，需要实证之时，修定让意根参究，不要浮浅的思惟念叨话语。</p><p>理就是这个理，知道多少密意都没有用，不能断疑。在我自己身上，能很清楚的感觉到，有定时是什么样的智慧，身心是什么状态，无定时是什么样的智慧，身心是什么状态，非常明显。所以没有禅定意根就使不上力，就没有实际证量，烦恼也无法降伏。</p><p>实证的前提要有禅定，还要如理思惟，才能有智慧，出生智慧，禅定是必要条件之一，不是全部条件。但是没有禅定，肯定没有真实的智慧，可以有乾慧，这种慧不解决实际问题。把外道的禅定拿过来，加上我们的观行智慧，二者结合，就能证得很深的佛法，二者分离，那就没有实证。还包括菩萨六度，三十七道品，全部都需要修，不可逾越，这些条件满足了，才能实证。</p><p>七、意识推理和意根亲证差距极大</p><p>由好记性不如烂笔头，想到意识与意根的不同功能作用对身心世界的影响力。如果对于世俗法某人某事，意识推测出来、推理出来、分析出来的，与真正见到亲眼目睹、亲耳所听、亲身经历，内心的觉受和触动有什么差别呢？对于五阴十八界法、对于如来藏法，意识如果是从文字上推理出来、推测出来、分析出来一个结果，对身心世界有什么影响呢？如果意根也亲证，对身心世界又会有什么影响呢？</p><p> 意识推测出某人可能在骂我，与亲耳听见某人在骂我，意根会有什么不同的反应呢？身心世界有什么不同的反响呢？意识推导出某件事是这样的，与亲自经历了某件事是这样的，意根的觉受和反应会有什么差别呢？身心世界有什么不同呢？ 意识从文字上推理出五阴十八界是空的不是我，与亲自证明了五阴十八界是空的不是我，意根会有什么不同的反应，有什么不同的智慧呢？身心世界有多大差别呢？</p><p>意识从文字上推理出来、判断出来、分析出来，如来藏是起如此作用的，大约是这样运行的，与亲自在禅定中参禅辛苦参究，最后真真正正的见到了如来藏所在之处，以及具体如何运作的，这二者对意根的影响有什么不同呢？意根的智慧有什么差别呢？对身心世界的影响有多大的差别呢？</p><p>推导出来的、推理出来的、推测出来的、分析出来的，算不算实证呢？里面有实修的过程吗？什么叫作实修？什么又叫作实证呢？</p><p>想象一个凶杀场景，与亲眼所见一个凶杀场景，对内心的触动有什么差别呢？想象一个和蔼可亲的面容，与亲眼所见一个和蔼可亲的面容，内心的感触觉受有什么差别呢？对一个人的影响有什么差别呢？推测出父母双亡，与亲自看见父母双亡，身心世界有什么差别呢？对自己的影响有多大差别呢？</p><p>想象佛在灵山会上讲法，与亲自坐在灵山会上听佛讲法，效果差别有多大呢？对身心的影响力差别有多大呢？想象推理判断推导分析出来的，有三昧证量吗？属于开智慧的三昧吗？想象灵山会上的场景，是三昧境界吗？与智者大师定中参加灵山法会的三昧，有什么差别呢？</p><p>念佛三昧，想象十方诸佛在面前立，与亲自证见十方诸佛在面前立的三昧，有多大差别呢？白骨观，想象出来的白骨观，与白骨观真正现前的三昧，有什么差别呢？想象出来的白骨，是意识心的思惟分析作用，没有白骨的色尘出现，因此是虚幻又虚幻的。自动自觉现前的白骨，是意根与意识同时证见的，有定果色出现了，虽然也是虚幻，比想象的要真实多了。</p><p>整个佛教界乱糟糟的一片，不能再乱了，所以佛教界要整顿，要收缩，不能再扩大和扩张了，否则佛教必毁灭。每个人每个团体都在说自己是实修和实证，可是哪里有实？谁在踏踏实实的修行？都在利用意识心玩聪明，玩文字游戏，都在玩自我，哪有真正无我的？</p><p>有多少人都推导出五阴世间如梦如幻了，都说自己证得了如梦如幻。真的如此吗？真证得如梦如幻观是十回向位，马上就入初地了。娑婆世界有这么多快入地的大根器菩萨，有这么多久修的再来菩萨吗？如果是，禅定在哪里？有初禅定吗？烦恼断除了吗？你这样问，照样会有人说自己有初禅定，断烦恼了，处于有余涅槃状态。谁拿这些众生也没办法，就认为自己能。</p><p>有多少人从文字中推导出第八识了？有多少人猜测出第八识了？有多少人分析出第八识了？有多少人打听到了第八识了？有多少人被告知第八识的大略作用了？这有什么用吗？智慧开发出来了吗？有真实的功德受用吗？有法眼净的真实证量吗？真断了我见了吗？有多少人开悟多年，我见还没有断，并且离断我见还有相当长的路要走，此生未必有断我见的资格和条件。六住位的断我见没有证得，就能证得七住位的明心吗？</p><p>参禅的过程，能让意识意根慢慢的认清五阴的苦空无常无我性，能慢慢的认清五阴身的虚妄不实性，能慢慢的降伏身见和我见，如果没有这个过程，在文字中推理出第八识在五阴身中可能是如此运作的，或者是推导出，或者是分析出，或者是打听到，或者是被告知，都不可能降伏身见和我见，更不要说断除身见和我见了，那么知道这个第八识的结论，于己身心世界有何意义？有什么功德受用？没有功德受用，知道个第八识有什么用？大街横幅广告牌上，告示天下学佛人大家都有个真心第八识是如此起作用的，听到的人就能断除身见我见，断除三缚结吗？能灭除三恶道业吗？如果能，有此好事，佛陀为什么不采用？</p><p>八、意根亲证的智慧才代表众生的真智慧</p><p>问：证果是指意识证果了以后，还需要意根印可是吧？正如单位的年终总结，需要单位加盖公章才承认吗？另外，智慧附属于意识，经过意识和意根认可后的智慧也可以作为种子储存在如来藏，意根的智慧是否就是习气种子呢？</p><p>答：意识单独明了，不属于证，意根同时也明了才是证。因为所谓的我，就是意根，意识附属于意根是下属，意根是领导起主导作用。断我见，一定是断意根的我见，只断意识下属的我见还不行，意识是服从意根我的一个功能作用。</p><p>智慧有意识的智慧，也有意根的智慧，意根的智慧才真正代表着一个人的智慧。因为意识的智慧是暂时的、不稳定的、不能作主的。意根生起智慧的时候，才能时时有智慧，这个人才是有智慧的人。意根的智慧才能真正存种子，后世能继续起用。意根完全与种子相应，意识又代表后天环境熏习的那部分。意根是有习气，善恶习气都有，意根的智慧属于善习。</p><p>九、意识证果明心仅仅是个化城</p><p>每个人在意识清醒的情况下，有意识的控制，心行表现要比意识不清醒没有意识控制的情况下文明、品行好，有理智、有素养、品端行正，两种情况下的表现相差很大。为什么有这么大的差别呢？因为意根与意识的心所心行差别大，意识在六尘境界中了别微细，比较聪明，知道什么对自己有利，知道在人前应该如何表现，而意根对六尘境界了别不清楚，习气重，比较固执，不知道如何表现对自己是有利的。这样的话，一旦通过催眠或者是酒精麻醉，意识不清醒的时候，意识就与意根差不多，无法再表现自己，也无法控制意根了，意根的本性就暴露出来了，表现就与清醒时大相径庭，各种丑行纷呈。</p><p>一个人的内心世界就是指意根的心所心行，能被意识的表面心行所掩盖，掩盖意根的心行叫作伪装，意识与意根不一致叫作虚伪。只在意识上用心做文章，作用不大，转识成智以后的菩萨，意根转变成平等性智，烦恼已经断除了，给他催眠和施以酒精麻醉，他的意根依然故我，与清醒时差不多。所以意根才是一个人的根本，代表一个人真正品行和品德，单独的意识表现，不是真品德。</p><p>在清醒时意识可以掩盖意根的愚痴无智，在中阴身里意识微弱就没办法继续遮掩和控制意根，意根的无明愚痴烦恼就会毫无遮拦的现行出来，最后因为意根的无明烦恼而投胎，继续后世的无明烦恼。意识证果明心，在中阴身里没办法继续保持证果明心的智慧，没有证果明心的意根就要现行出无明，我见我执烦恼深重，最后以意根的我见我执烦恼去投胎，继续后世的我见和我执，继续轮回生死。因此真正有智慧的人，应该力求真正的断我见和明心，不要停留在意识的解上，这是化城，不是真正的歇息处和依止处。</p><p>十、证果时一定是意根证果</p><p>为什么舍利弗在母胎里时，使得其母论辩智慧大增？是舍利弗意识的智慧，还是意根的智慧？这是意根的智慧，假如意识的作用在母胎里很强大，每个人生下来，应该都是平等的，都有智慧。有的孩子在三、四岁的时候不用人教，就会盘腿打坐，这是意根从前世带来的，天才儿童表现出的智慧，也是意根的智慧。</p><p>为什么有人非要说意根的智慧很低劣？如果意根的智慧在任何时候任何方面都很低劣的话，就没有天生的大智慧者了。比如诸佛菩萨入胎、住胎、出胎时都不迷于五蕴世间，都有大智慧；还有一些有特长的凡夫众生，从小就有某种天赋，不用从他处现学，不用人教导，这都是意根带过来的，是意根的智慧。</p><p>同样的意识心，为什么舍利弗听佛说法当下证得四果阿罗汉，而其他人还是凡夫呢？因为舍利弗的意根前世已经很多次证果，只不过此世意识是新的，所以再次听闻法理，不用从头再思惟观行，意识听闻佛法的当下就证得了无我，延续上一世的果位。而其他人的意根没有证过果，听闻佛法时，只是意识明了一些，还需要在定中仔细思惟观行才能证果，所以他们在没有禅定不能有效思惟观行的时候就不能证果，还是凡夫。</p><p>十一、意识证果到命终就作废</p><p>在证果时，如果说不用意根证果，来世这个人还有没有证果的智慧？初果人七返人天之后要证得四果，取证无余涅槃。证初果之后命终上天，那么他的意根没有证果，意识又是新出生的也没有证果，他到天上，还是初果人吗？显然不是了。这个人到天上还要重新再证初果吗？当然需要再次观行证果，因为意识意根都没有证果。</p><p>这个天人在天上再次证果以后，命终再生到人间，由于意根没有证果，意识仍然是新出生的也没有证果，这个人就还要再重新证初果，然后他还要七返人天，他需要再重新证初果，这样的话，这个人永远都要重新取证初果，无法成为二果三果和四果人，一旦在人中或者是天上，证果的因缘不具足，连初果都无法证得，只能做个凡夫，那何时才能成为四果人解脱三界生死？所以证果必须是意识和意根都证果才是。</p><p>十二、想象和推理不等于实证</p><p>比如说白骨观，想像出来的白骨，是意识心的思惟分析作用，没有白骨的定果色出现，没有三昧的成就，因此是虚幻又虚幻的。自动自觉现前的白骨，是意根与意识同时证见的，有定果色出现了，是三昧境界，虽然也是虚幻，但比想像的要真实多了。</p><p>凡是意根亲自证得的法，都有一定的真实性，意识推理推论出来的法，没有真实性可言，因此对身心世界几乎没有什么影响，与从前的心理状态差不多。修行的过程和结果，都要改变身心世界，从无始劫以来最初遇到佛法，开始信受修行，身心世界就开始转变了。直到真正断我见，才是一个明显的转变，到三果时转变更大，以后依次不断的转变，直至成佛，三十二相出现，身心世界转变结束，不再转变了。</p><p>而身心的转变全部由意根促成，意根证得多少，就转变多少。在没有证果没有断我见之前的实修三十七道品过程中，身心就开始一点点转变了。有的人真信佛还没有真正修行时，身心也有一定程度的转变，一年一个变化，以至于能影响和带动身边有缘人也信佛。不是像有些人说的那样，非要等到证得三果的时候，身心才开始转变。众生身心的明显转变是从断我见开始的，三果时有初禅定断除了烦恼，身心转变得比较大，前后比较明显。</p><p>十三、强行认为自己证果我见重</p><p>如来藏是真正的主人，而意根妄认自己是主人。这个假主人把一切法都当作我和我的，把第八识的功能作用当作是我的，把六识的功能作用当作是我的。如果断我见，这个主人不断我见，六识这个随从断我见有什么用？主人意根成天我我我的，不让祂断我见，却让他的参谋、勤务员、助手、下属、随从断我见，这有什么用？</p><p>现在还不开窍的人，真应该检查一下自己的大脑，是不是哪个地方生锈了？有没有什么办法，能给大脑擦一擦除锈剂？意根与意识同时证果明心的理，我反反复复的讲，已经很烦，几乎不愿意再讲了，可是还有一些人坚持只有意识证果明心就行了，这些人究竟为什么智慧这样的低劣，这么简单的问题，都想不通？什么业障遮障着自心，非要守着自己的假果位不肯前进一步？因为意识证果很容易，意识证果以慰藉自心，比起意根证果遥遥无期，还是能得到些许安慰。</p><p>喜欢一个果位，喜欢他人仰视自己崇拜自己，喜欢互相恭维你是菩萨我是菩萨，咱们大家都是菩萨，这还是一个我，这个我不除，能是断我见之人吗？这种我心比世俗人的我可重多了，比世俗人的我多了一个证果开悟的我，就会感觉非同一般，世俗人根本不能与之相比，这个我比世俗中熏染的我慢还要难以戒除。</p><p>十四、没有实证无法把任何一个法当作第八识</p><p>佛法讲究实证，也要求实证，没有实证，仅靠口耳相传和推理意解，早就离大道十万八千里了。如果心中确立了一个空，为真实，为实在的法，那么空就是真实的，就成了法缚，不得解脱。一切法都是空的，那么空的这个法，是不是空的？如果一切法都是空的这个法不空，那怎么能说一切法都是空的？</p><p>很多人都没有真正的断我见，五阴没有空，然后去猜测想像法空，把一切法都看成第八识，看到六七地菩萨的时候，才能真做到了把一切法都看作第八识。但是六七地菩萨，包括八九地菩萨，也不能把全部的所有法都看作第八识，因为还有那么多的法没有证得，没有证得的法，根本不能如实的看作第八识。即使是最粗浅的五阴身也没有证出来是第八识出生的，没有真正观行到这点，就不能真正如实的把五阴身看作第八识，否则早就断我执，入初地了。</p><p>很多人因为没有实证过什么法，于是就假想一个修行方法，假设一个修行路线，那个路线图画得模糊不清，自己都看不明白。现在的佛法流传就是这样，根本不涉及一步步的实际修行，没有一个切实可行的方法和手段。</p><p>十五、意根需要足够的证据深深的思量才能断我见</p><p>认为五阴是我的邪见，属于愚痴心所法，意根先天性的就有愚痴无明，认五阴身为我，意识随之也有愚痴邪见。通过修行能破除两个识的愚痴无明，从而断我见证果，之后愚痴的心所法就改变了一分。</p><p>那是不是我们只要告诉意根，身体是假的不真实的，觉受也不是真实的不是我，只要想办法让意根相信这一切都不是自己的不是真的，就能断我见了吗？意根的无明重，因此意识告诉祂什么祂不一定就能相信什么，祂需要足够的证据资料，然后根据这些数据资料，进行自己的审定和思量，自己亲自要作以判断。祂愚痴严重的时候，即使证据确凿，事实充分，也不能很快确认，不愿意承认五阴无我这个事实。需要长期熏陶，一点点转变，冰冻三尺非一日之寒，久积的坚冰非几日的阳光所能融化的。</p><p>有人问说断我见之后，是不是就能慢慢的断掉自己的觉知，不会感觉到冷热、痛痒等等？不是这样，断我见只是断除不正确的知见，不能灭掉知觉。灭掉知觉需要极深的四禅定，不断我见也能做到。在四禅定里，破除了色阴区宇和受阴区宇，才能空掉色身的觉受。否则阿罗汉也会有色身上的各种感受，只是不执著，感觉就不那么痛苦，最起码意识心的受不是那么苦恼，身识的受与凡夫是差不多的。</p><p>十六、无梦无想时主人公在哪里</p><p>这是禅宗第三关公案，无梦时，就没有六识，只有意根和第八识。无想时，也没有六识，只有意根和第八识在一起运作着，意识却无觉无知，也没有意识，即使有意识，意识没有甚深智慧也不知意根和第八识究竟是如何一起运作的。</p><p>那么证悟以后，要过禅宗第三关的生死牢关，得到解脱，有能力出离三界，意识就要有大智慧，能现前如实的观察意根与第八识的和合运作，从而破生死牢关。那就要在证悟修出初禅定以后，过阳炎观以后参究第三关的公案。在参究这个公案时，意识还是要与意根一起共同参究，那当然第八识也要参与进去，否则六七识都会灭去，不能运行。</p><p>那么为什么参究出第八识在无梦无想时与意根的运作实相，就能破牢关，得解脱呢？如果修到禅宗第三关时，还不能证得意根，能很粗略的观察一点意根的运作情况，那就无法参究第三关公案，也就无法破牢关，不能出离生死轮回，不得解脱。这时意根的证自证分必然会更强大。意根有自知之明时，必然会破除执著，不仅不执五阴身和六识，也不执自己，也不执第八识，如果执第八识，也不能出离三界，得解脱。</p><p>意根证得的法越多越深，解脱的功德越大，如果连最微细的法都证得了实相，那就能断除一切微细法执，得大解脱究竟解脱，成就佛道，从此不用再修行了。所以我们修行究竟什么才是最重要的，心里一定要清楚，不可糊涂。</p><p>小乘没有证得第八识，当然不会执著第八识，就不用过禅宗第三关，一关也不用过，只要完全证得五阴无我，就能断除我执，得解脱，出三界。有的人非要说凡夫众生的意根都是执著第八识为我，这误会有多严重。凡夫意根如果知道有第八识，那就不是凡夫了；如果不知道第八识，如何执第八识？佛倒是希望所有凡夫众生都能执著第八识，那样就不会执著五阴身，就没有分段生死了。</p><p>十七、证悟是六七识的自证分功能</p><p>证悟是意识和意根都发现了真理和事实，真理是相分，发现就是见分，发现真理就是自证分，不是证自证分。能否证悟，也在于意根本身的智慧认知能力，也在于意根无始劫以来邪见深重与否，不仅仅在于意识收集证据资料和分析思考的能力。意根的贪习现行出来，必须通过六识来体现，意识有时有觉悟会抗拒，但不一定能抗拒得了，意识有时没有觉悟不抗拒。</p><p>十八、如何用功才能证悟</p><p>八个识都有执身的作用，只是各识的作用不同，缺少一个识几个识，色身的状态就不同了。比如说没有五识的执身作用，人就坐不住站不住了，意识也不执身就会睡着了，色身东倒西歪。</p><p>很多人都说自己悟，其实在所悟的那个法上，也仍然是八个识的和合运作，分不清各自的功能作用，如何说悟到了第八识呢？把所有识的功能作用都当作是第八识的，就是张冠李戴。这样的悟很简单，知道有如来藏的人都可以悟，并不难。即使能分清八个识的各自作用，如果定力不足，依靠逻辑推理的方式，推论出第八识的作用，仍然不是证悟，只是解，没有功德受用，不能断我见，不能得解脱。</p><p>很多事情，轻易让一个人知道，对此人就没有触动，不起什么作用，改变不了什么。只有让他自己一步步去探索，寻找事实真相，他才会真的相信这件事，自己才有所触动。人都相信自己，不相信外来强加于人的思想观念。意根也是如此，不轻易相信意识的思想观念，只相信自己亲眼所见，所以就不得不让意根去根据意识提供的信息，自己去参究去考量，自己考量出的结果，才能真正相信，从而断疑。</p><p>在参究的过程中，意识用心多，意根用心就少，意识用心少，意根用心就多。让意根多用心才能证，但是这就需要很深一些的禅定，否则意根没法用心，只有意识的用心了。意识的作用好一些的无非是推理和逻辑思维，但也代替不了意根本身的思量考究。要学会用意根，才能生起真正的智慧，起决定作用的智慧。当自己禅定不够好的时候，不要去思惟根本之法，不要去参禅，免得解而不证。</p><p>十九、如何断疑结</p><p>内心有不能抉了的法存在，不能确定五阴到底是不是真实的，是不是生灭无常的，到底是不是能够依赖的不灭的我，是不是能到未来世去。对此疑惑不清，就会犹豫不决，由于不能抉择，于是就会继续对五阴有所依赖，有所信任，依五阴而造作的三恶道业就不能消除，就会随业而流转于三恶道。这个疑见就是烦恼结缚，如果不断除，必有烦恼或业苦不灭。</p><p>如何断疑见烦恼呢？有人说我一想五阴确实是没有我的，心里就不再疑惑了，就确认了五阴无我，断了疑结。那么意识稍微思惟思惟五阴苦空无常无我，能不能断除内心深处的疑惑？恐怕不行。无始劫以前，我们对世俗法的无数事都没有疑惑，甚至有的人一辈子对自己做的事不怀疑，认为自己很对，很有智慧，可是到死之前他可能都没有做对一件像样的事，他活着时确实也很自信，由于他缺少智慧，不知道自己是无智慧的，不知道自己的自信是不可靠的，不是真正的自信，信的没有道理。所以有一些人很自信自己确实认可五阴无我断我见了，可是这个确信确认是盲目的，临终时事实摆在面前，只有随业漂流的份儿，丝毫做不了主。</p><p>怎样才能断除疑结呢？必须修定，在禅定中细心观行思惟，或者按照佛讲的四念处的观行方法，真真实实的用功，不能投机取巧。踏踏实实修行八正道七觉分，发起禅定，才能证得空三昧。</p><p>二十、意根的疑结</p><p>断我见时，断除三缚结中的疑结，不可以只断意识的疑，而不断意根的疑。如果意根带着对于我见的疑到中阴身，就不免三恶道，被疑结所绑缚，解脱不了三恶道。只有把意根的疑解除了，无明才破，把意根所有的疑都解除了，无明断尽，就会成佛了。没有一尊佛的意根带着疑问结缚去成佛的，也没有一位菩萨的意根带着疑结去成为破除无始无明的大乘菩萨的，更没有一位解脱道圣人的意根带着疑结去解脱三界生死苦的。</p><p>二十一、推理猜测于修行无益</p><p>学佛修行真正证得不是那么容易的，解可以随意解。在关键问题上讨论，也许能讨论出来一个正确的结果，但这样的讨论就是推理，推理的结果就是解，再正确也不是证，不能证得的法对个人修行并无益处。祖师常常说：即使能讲出三藏十二部经，若不开悟，也是魔说。如今世间人学佛大多是用意识的思惟分析推理推测，真修真参真究的，下苦功夫的人很少很少，即使能猜出八地菩萨的境界，猜出佛地的境界，都没有什么用，与解脱生死毫不相干；讲法讲得天花乱坠，也没有用，与解脱生死也毫不相干；一辈子写出一万本书，与解脱生死仍然毫不相干。</p><p>修行的结果是要破除一切相，在这些相上转没有什么用，仍然是束缚。以有所得心、有所求心来学佛，学来的也是有为法，有为法都是生死业。学佛如果不是为了无我，不是为了解脱烦恼，不是为了消除无明，这明摆着是为了世俗的我以及我的……。这样根本不能获得解脱的智慧，不能脱离生死，这是另一种迷惑颠倒。学法只要结果只要答案，不要中间修行过程的，都是有所求心有所得心，也就是生死心，这样学佛也是生死业。</p><p>如今人学佛即使能悟多少次，但就是不能断我见，为什么？因为不踏踏实实的修定和观行，不去真正用功参究求证，那就不可能证得真理，就不能断我见，结果是可以用任何形式搞到手的，但实际修学过程却是用什么手段都不能得到的。在修行这个问题上，精明人不愿意辛苦用功，真正用功的人却如傻子一样孜孜以求，只管耕耘不问收获，可是越精明的人却越傻。修行是傻子做的事，不是精明人所为。</p></div>"
},{
    "title": "第三章 解与证的区别",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  解与证的区别</strong></p><p>一、如何确保实证而不是解</p><p>在观行和参究的前期，意识可以多思惟学习法义，了解法义的大概义理，正知见具足时，就可以修止观参禅了。观行参禅的时，在禅定中意识把了解的法义内涵凝聚起来，形成一个非常容易理解的意思，深深的悬置于心，朝斯暮斯、废寝忘食的用功，这就是参究。</p><p>意识少于分析思惟，多让意根自己思量考量，这是确保实证的最有效的方法，也是获得最大智慧的方法。如果意识思惟分析的多，一旦知道答案，就不想再参了，意根也就没有什么机会参究，这样就可能永远不能证悟。所以明心的答案，随便去打听出来，随便讲出来，意识知道了以后，意根就不能用功了，那就无法证悟。断我见的内容也是，不能要求师父讲得太细，如果意识都知道了，意根无法再思考，断我见就很困难了。</p><p>用意识思惟会感觉累，让意根多用心就不会感觉累。禅定非常好时，意根就能参与观行，没有禅定意根插不上手，不能专心思量考究。参禅时的疑情，就是意根一心想弄明白想找到答案才出现的。法义让意根审，一旦审清楚通过了就是证得。</p><p>以意识为重的人说意根是木头和摆设，没有什么用。如果观行参究真的不用意根的话，我们就向全世界公布实证答案，让全世界的人，不管学佛与否，全部都知道答案都开悟成佛，这可能吗？根本不可能，各人吃饭各人饱，别人经过辛苦参禅证得的法，自己听一听理解了就复制下来，成为自己的了，这是自欺欺人的行为。</p><p>二、什么代表众生的身份？</p><p>在无数世的生死轮回中，是什么代表着我们的身份？从凡夫到佛陀的修行过程中，是什么代表着我们的身份？</p><p>比如说成佛的时候，是什么代表佛陀的身份？成为八地九地等觉菩萨的时候，是什么代表这样大菩萨的身份？成为初地以上菩萨的时候，是什么代表初地以上菩萨的身份？明心开悟以后，是什么代表明心菩萨的身份？证得初果直至四果，是什么代表初果二果贤人的身份？是什么代表三果四果圣人的身份？证得辟支佛果以后，是什么代表辟支佛的身份？</p><p>在凡夫位，是什么代表着地狱众生的身份？是什么代表着恶鬼众生的身份？是什么代表着畜生的身份？是什么代表着阿修罗的身份？是什么代表着不同天界天人的身份？是什么代表着不同人类的身份？</p><p>当众生每次死亡之时，六识灭了，五蕴身灭了，只有意根和第八识还存在着，并且一起去至后世，出生后世的五蕴身。生生世世都是如此，那么只有意根和第八识能代表众生的身份，但是每个众生的第八识都是相同的，都是同样的德行，丝毫差别都没有，那么第八识就不能代表众生的身份，否则所有众生的身份都是一样的，没有任何区别了，所以只有意根代表着众生的身份。</p><p>意根是什么德行，就是什么众生，是佛的德行，就是佛世尊，代表佛陀的是意根成就的报身佛，明显区别于众生的果报身；意根是等觉菩萨的德行，众生就是等觉菩萨；意根是八地菩萨的德行，众生就是八地菩萨；意根是初地菩萨的德行，初步转识成智了，众生就是初地菩萨。</p><p>意根明心证悟，但没有转识成智，众生就是三贤位菩萨；意根仅仅证果，没有明心，就是小乘圣贤；意根证得辟支佛果，具有辟支佛的德行，众生就是辟支佛。意根的心性如地狱众生般的狠毒嗔恚，众生就是地狱众生；意根非常悭吝贪婪，众生就是恶鬼；意根非常愚痴不可教，众生就是畜生；意根的德行非常嗔恚好斗，但有福德，众生就是阿修罗；意根的德行有善有恶，时善时恶，众生就是人；意根的德行善大于恶，众生就是欲界天人：意根的德行不仅善，还是禅定，众生就是色界和无色界天人。</p><p>人身是关键，决定着后世是上还是下，如果学佛修行不修到意根，不把意根的德行提高和改变，临终六识一灭，意根就会以现前的德行决定后世的身份，与如来藏一起去投相应于意根德行的胎中，因果法则就是如此。无数人修行就像蜻蜓点水，浅尝即止，不走意根心，不把佛法落实到意根心中，那就让意根带着无明继续投无明的胎藏中，出生无明苦众生。</p><p>我苦口婆心的反反复复的讲意根，讲意根的重要性，还有愚痴众生不认意根，证果不让意根证，明心不让意根明，那后世就让没有证果没有明心的意根继续投胎，但其身份绝对不是证果和明心的身份，到时候再后悔已经来不及了。</p><p>三、意根代表众生和众生的身份</p><p>问：如果只有意识证得第八识，意根没有证得，也不用意根证。那么这个人死后往生极乐世界，或者是生天了，到极乐世界以后，色身是天人的色身，意识是新出生的天人的意识，如果意根没有证得第八识，这个人在极乐世界还是不是开悟明心的菩萨？果位是什么？与凡夫到极乐世界的情形是一样的吗？都属于凡夫吗？与凡夫待遇一样吗？</p><p>答：众生不管在任何世界以何种形式存在，其身份果证都是以意根为主，意根是什么众生就是什么。因为意根是众生的主人，是作主识，又与业种相应，又能连续后世，所以意根造作了什么业，就要受什么果报，意根造作凡夫业，后世就做凡夫；意根断我见，后世就是初果至四果人；意根明心见性，后世就是开悟的菩萨，其果位以意根的明和无明的程度而定。</p><p>如果在人身上意根没有证得第八识，就是凡夫，后世往生到极乐世界是以凡夫身份去的，到极乐世界仍然是凡夫，在莲花中住若干劫不等，业障消除一定程度时，花开见佛，闻法悟道，这才成为真正的菩萨。在人身时意识的解，不起根本作用，如果熏染到意根了，就会存入相应的微弱种子，后世意根能稍微容易受熏和证悟。</p><p>四、证果是否只有意识证果就行</p><p>如果仅仅是意识证果就算证果，我们那些群里没有一半也有三分之一的人意识证果了，如果我当面引导一下，就会有四分之三或者是五分之四的人意识证果。再加唯识群里的人，有至少一两千人意识证果，五六千人意识证果都不奇怪。仅仅是意识明心就算明心的话，我开个大会，宣布一下如来藏是如何具体运行的，所有人的意识都知道了，不否认的人都成为明心证悟的菩萨了，那这个世界即使没有佛陀时代的壮观也差不多了。</p><p>如今群里有不少人都能辨别意根法义了，唯识方面的智慧也不低。如果意识证果就可以，那我们群里现在就能有好多个具有唯识种智的地上菩萨了，二十多年后，我们可以培养出千八百个地上菩萨，这不是什么难事。但是佛法的修证真的是这个样子吗？真的就这么容易吗？口口相传就能证？</p><p>现在佛教界为什么在整顿，有智慧的人应该懂得，表面看是世俗界的行为，实际上佛陀早就知道现在佛教界的状况，佛陀能不想办法吗？佛陀在背后的护持，众生都不知不觉，就知道看表面现象，不知道背后真正的原因，每次佛教界的动荡，其实就是内部出现了大问题，才感召到外部的动荡。诸佛菩萨和护法龙天都知道。</p><p>五、各种三昧都是意根证得的</p><p>意识的解不是证，因为意识不是五阴的主人，对于一切法包括明理证悟等等都不能作主，其见解都不算数。但是修行先有意识的那些解，再有后来意根的证，意识的解也就是正知见，是证悟的前提条件。证首先离不开解，只要不停留在解上，后续的证是早晚的事。</p><p>楞严经里佛说阿难：<strong>菩提涅槃。尚在遥远。非汝历劫。辛勤修证。虽复忆持。十方如来。十二部经。清净妙理。如恒河沙。只益戏论。汝虽谈说。因缘自然。决定明了。人间称汝。多闻第一。以此积劫。多闻熏习。不能免离。摩登伽难。</strong>在这里世尊已经明确说了菩提修证不是那么简单的，背诵复述经典，所有的多闻都是戏论。所以我说，那么多证果断我见和明心的都是解，都是戏论。</p><p>如果是意识证得三昧，意识明心，那么机缘成熟的时候，我们组织几场万人法会，把如来藏在五阴当中的种种运作，讲给大众，大众听完后多数人就会明白了。然后我问有多少人明白了如来藏的运作过程，证得了如来藏，你们大家都举手，那我就恭喜大家都证悟了。这样的话，两万本菩萨证书绝对不够用，还得再印十万本，恐怕也不够用。这样搞行不行？意识明白就算证悟，那我清清楚楚的告诉大家，你们的意识不是都明白了吗？明白了就是证悟，那何必让大家持戒修定参禅，走那么多的冤枉路？</p><p>意识理解就算证，那么一个世界只要有一个人证得了，就可以告诉所有人，一传十十传百，这样整个世界的人，不就都证得了吗？还用修定，还用参究干什么？佛还让弟子修戒定慧干什么？不用守戒，只要意识聪明，就能证得佛法，从而了生脱死了吗？什么七觉分八正道三十七道品，这些都不用修行，佛陀真是多此一举，这么啰嗦的难为众生，佛法是多么简单的事情，搞这么复杂干什么？</p><p>如果意识理解就算证悟，那么我们坐下来，回忆一下梦境，再思惟思惟现实世界与梦境一样，就证得了如梦观，十回向位成就，即将入地。然后再坐下来，思惟思惟一切法如镜子中的像，比照镜子里的影子来思惟，想一想确实是都像镜子里的影子，那就证得境像观，初地满心，就成为二地菩萨。这样学佛是不是非常轻松愉快呢？</p><p>证得佛法，成佛为什么不是那么容易的需要三大阿僧祇劫？就是因为意根愚钝，无明深重，难于理解法义。如果证悟不涉及意根证，修行确实非常容易，那么成佛根本不用三大阿僧祇劫这么久远的时间，很快就会走完全程了。</p><p>六、念而不念就是念佛三昧</p><p>真正的念佛三昧，是由意识充分熏染意根，由意根成就的，是证得本心的境界。这时有定又有慧。在整个修习过程中，由意识引导意根，从念佛菩萨的形象到念真正的佛菩萨真如，最后意根成就三昧，意识不念而意根念，甚深禅定出现，之后智慧出生，从而证得真心自性。</p><p>不念而念，就是意识不念，而意根念，意根自动念时，意识是控制不住的。懂得此理，就应该懂得如何用功修行，如何参禅参究，如何思惟观行，就知道证道悟道的原理和过程了。</p><p>念而不念，虽然到最后完全是意根念佛，然而意根并不如意识般的念佛，表面上祂是不能念佛的。其实真正能念佛的那个，也是不念佛的，无口无心的，那个是什么东西？参！</p><p>七、念佛三昧由意根成就</p><p>真正的念佛三昧，是由意识充分熏染带动意根念佛，由意根成就的念念都是佛的三昧境界，是证得本心佛的定慧圆融的境界，既有定又有慧。在整个修习过程中，由意识引导意根，从念佛菩萨的形象到念真正的佛菩萨真如，最后意根成就真如三昧，意识不念而意根念，甚深禅定出现，之后智慧出生，从而证得真如自性。</p><p>其中的禅定是动静结合，两方面都不偏废。最初在静坐中修比较容易，心静下来的快，静中修持有了功夫，活动中心也就容易安定，比较专心一意，因为静能养动。在动静结合中能一心念佛，定力修持出来以后，般若智慧也具足一些，就可以参究念佛的是谁。那就要有个转折，在禅定中加入智慧的观照，也叫作观行。心念由佛念转换成疑念，深深的疑着，没有其它念头。有朝一日，就会疑情打开，参究出念佛的是谁。</p><p>很多人都不愿意也没有办法这样辛苦的用工夫，个别人就要耍聪明走捷径了，心里琢磨分析，情思意解起来，最后可能琢磨出来说：念佛的不就是那个吗？但无论怎样琢磨，那个东西到处都是，一切法上都存在着，佛已经公开说出来了，你说念佛的就是，实际上念佛还是八个识的和合运作，真妄都有，怎么就是那个呢？</p><p>有些人就推理说，在行住坐卧当中就是那个，我参出来了，开悟了。可是行住坐卧离开哪个识你能行住坐卧？把八个识和合运作的法当作第八识单独运作的法，这是明显的凡夫知见，不是禅宗的明心证悟。时下所谓的开悟，几乎所有人都是这样的悟，差不多百分之百都是这样的悟，那就是误会的误，自己误自己而已。误了自己以后，烦恼就会越来越炽盛，我慢越来越突显，贪嗔痴烦恼就会无所顾忌现行了，因为两个我出来了，结果必然是这样。</p><p>而真悟的人，我见断除了，头低下了，身心轻安，烦恼轻了，定慧增长了，心空无为。所以要想真悟，对自己负责任，就要下真功夫，真参实究，不要投机取巧，喜欢出风头。</p><p>八、理解与证的区别</p><p>意识理解出来的真理，与意根在禅定中观行证得的真理，天差地别。前者尽管能够大谈特谈，著作一箩筐，徒众成群，就是没有功德受用，没有实用价值，不能破除无明，不能解决生死，无法解除烦恼束缚。后者，有可能不会大谈特谈，不会讲法写文章，也可能没有一个徒众，但是心却是解脱的，了生死可期，其影响力熏染力超大，磁场超强，摄受力也强，一言九鼎，无形当中也度了众生，摄受了众生，只是无心，众生在无形当中，就能感知到威力威德，无意当中受到了感化。</p><p>接触到信息，接触到真理，六识都没有听懂，不知所云，如何能有效完整的把真理和信息传达给意根呢？没有禅定，六识如何把真理和信息转交给意根呢？没有禅定，意根如何吸收和消化这些真理和信息呢？意根不能吸收和消化，如何消灭无明，让心变为明呢？意根不明，如何去执得解脱呢？</p><p>九、研究与参究的区别</p><p>研究是没有定力或者是定力不足的表现，定力不足意根无法使力参与其中，只好由意识单独思惟分析推理判断，所以只能浮在表面，无法深入法义之中去探索深层次的内涵，所得结果也比较肤浅，泛泛而谈，不得精髓。没有定力时，心神分散，是发散性思惟，没有力度，犹如蜻蜓点水，无法专一深入其中，去搞清楚法的来龙去脉。结果是没有实证的，给不出实证的具体方法和步骤。</p><p>而参究的思惟活动，是在有一定的禅定力的情况下进行的，思惟深细专一深透，先是意识用心，然后意根参与，最后以意根思想活动为主，意根的功用最大。这样用心非常有力度，直达法义深处，甚至细节都能摸清摸透，疑情都能攻克，结果深信不疑，断除思想结缚。参究的结果，他人看来无懈可击，又能给与他人修行入手处，引领他人思路，达到自利利他的目的。</p><p>古来搞研究者，都是文人墨客居多，因为文人墨客定浅情重，喜欢在文字表面做文章，对于佛法浅尝即止，不能入深潭攫取宝藏，只能在潭边掬些清水。即使想入深潭，定力不足，其思惟无法如锥尖一样猛力，无法深入法中获得深义。因此唐宋朝时期的李白白居易苏东坡等人的佛学思想，影响带动不了佛教的发展，及至民国时期及以前的文人如胡适丰子恺等等，禅宗著作丰厚，洋洋洒洒，所说也仅为皮毛，触及不到禅宗皮里，其著作读一遍都嫌多，几句话即知其落处，对于广大学人没有一丝借鉴之处，不要说影响佛教了。</p><p>喜好研究者，定浅言多，文字丰富，思想贫乏，虽著作等身，糟糠多，营养少。参究者定深寡言，思想深透，精髓多。比如达摩祖师、傅大士、宝志公，还有唐宋朝时期的禅师，虽其著作有限，可是一言九鼎，一句话回味无穷，令人参究数十年。其言符其行，其行表其言，言行永远一致，表里如一，体现道者的风范。禅师著作语录，不仅体现禅师修行的历程和心得，也含藏者做人的品格和菩萨的风范，都是实修实证的成果，是佛教的宝藏，带给大众无穷的利益。</p><p>所以说要想解救自我，解救众生，带动佛教发展，只有在定中深入参究实证，证出成果，自利利他，才能推动佛教的发展。</p><p>十、解悟与证悟的区别</p><p>解悟知其然而不知其所以然，证悟是知其然也知其所以然。解悟的麻烦是，已经知其然了，就认为到家了，很难再想知其所以然，即使想知其所以然，由于禅定不足，加上慢心，就无法再知其所以然，由解悟转为证悟很困难。而一般人所说的解悟，仅仅是指理解了一些佛法理论而已，谈不到知其然，不知道佛法的最终指向是什么，离解悟还很遥远。</p><p>十一、意根不作最后确定的事就半途而废</p><p>以眼识思心所的运作为例，说明成功见色在于意根的最后抉择。思是抉择、决定、确定的意思，代表一种思择力。识心确定了一个法之后，就要造作。思，也表示行、造作、行为、行动、运行等等。八个识都有思心所法的运作，都有思择力，了别之后都要有个抉择选择，都要做个决定，决定之后就要实行。这是思心所的意义。</p><p>其中眼识对色法的了别离不开意识的了别，那么眼识的思心所的运行就离不开意识思心所的运行。举个例子说，意根想要抹药，就决定寻找药瓶子。这个工作是由眼识和意识共同来完成的，单个不能见色寻找色法。意根做出决定之后，眼识意识出生，去到桌子上寻找药瓶子。桌子上的物品有好几个，意根决定逐个排查，于是眼识和意识就会挨个了别每个物品，最后眼识定格在药瓶子的色彩上，意识定格在药瓶子的形状上，合在一起的信息，就显示出是药瓶子，当然药瓶子的概念是意识给出的。两个识一起工作永远是意识的工作量大，意识的心念多，分别的法多。</p><p>眼识意识定格在药瓶子上，等于是作意于药瓶子，触药瓶子，接纳药瓶子，了别药瓶子，分别出药瓶子，最后就确定是要寻找的药瓶子。其中，确定就是思心所的作用，包括眼识确定药瓶子的色彩，意识确定药瓶子的形状、标签、内容物。一切色法的确定，以意识的确定为主，眼识的确定为辅。确定了之后，信息传到意根那里，意根审核思量，也确定了是自己需要的药瓶子，于是就决定拿过来，这是再一次的思择，这时眼识意识和身识三者和合运作，包括意根，也包括某某识，行为造作就产生出来了，拿到了药瓶子。这个过程也就二十秒钟，可是叙述起来需要几分钟。</p><p>在了别色法的过程中，眼识不确定，意识就无法确定，意根更无法确定，那某某识就旁观，确定不了什么。眼识确定了，意识不一定确定，意根也不能确定。直到意识确定了之后，意根再思量审核，最后可能就会确定，也许还不能确定。那就会让眼识意识再次的甚至是反反复复的了别确认，提供更多的信息给意根，意根才能确定，做抉择。</p><p>有些人总想把修行修到意识这里就行了，最后一道关键工序不要了，那能成什么事？有什么作用？证果不让意根证，那意识得出的结论能有什么用？明心不让意根明，意识明的有什么用？老板不拍板，手下员工所说的能有什么用？半途而废的修行，做的差不多是无用功。竟然有人做事喜欢半途而废，不要最后的成果。</p><p>十二、意根断我见和我所见才有用处</p><p>断我见包括断我所见，关键是意根认可不认可五蕴是无我的，意识心的认为没有用，不是真的断我见，必须内心深处完完全全地不再认为五蕴是我是我所，不再认为六尘是我所有的，那样才行。在思惟观行中意识心必须经过深细思惟，以此来引导意根，让意根明理，意根明理后就会改变自己的思想观念，从而整个身心都得到很大的转变。自此以后，意根逐渐的不执六识的受想行识功能作用为我和我所，不执色蕴为我和我所。证得大乘法以后，就会逐渐把五蕴十八界这些功能作用归还给第八识这个真正的主人，大乘的各个关口才能一个一个过去，智慧不断的深利，身心越来越解脱。</p><p>    十三、死后没有意识的时候能否开悟</p><p>只有第七识和第八识没有六识存在的情况有下列几种：昏迷不醒时、睡着无梦时、入无想定时、入灭尽定时、死亡以后中阴身没有出生时。最后一种情况里不仅没有六识，也没有五蕴，只有七八二识，两个识心无形无相，这时候一般人的第七识属于发懵的状态，急着寻找新的五蕴身，以作依托。佛能不能发现这时候的七八二识？不得而知，第七识没有第八识不能单独存在，第八识没有第七识不能运行任何法，处于涅槃状态，佛也不能发现第八识。两个识和合一起共同有所运作的时候，才能被人发现，但是一般人是发现不了的。</p><p>那么没有五蕴和六识，只有七八二识的情况能不能开悟呢？那就要明了是谁悟，并且悟什么的问题。悟，当然是妄心悟，悟得第八识。没有六识也没有五蕴，这时候的妄心只有第七识，第七识能否单独悟？恐怕除了佛有这个本事，八地以上菩萨也许能悟，其他人恐怕很难，凡夫绝对不能。因为意根的辨别力非常低，没有意识的辅助，意根自己无法辨别清楚六尘，何况最最微细的第八识。</p><p>在只有七八识没有六识五蕴的情况下，第八识只维持第七识的存在，不能运行什么法，而证第八识，要在第八识的运作上证，第八识不运作，无法证第八识，在涅槃里的第八识佛也证不了。而在五蕴身中没有六识的情况下，只有七八识，能不能证得第八识呢？根本不能。</p><p>十四、意根思量的越深透证悟的智慧越大</p><p>五蕴无我那些法，意识想一想大约就明了了，可是意根无法明了，意根不明了，就无济于事，什么也改变不了。如何熏染意根，让意根也明了，并且断我见呢？那就要修好禅定，在定中意识思惟清楚了，把法义悬在意根那里，就在定中一念不生，让意根去思量。意根的思量越活跃越好，受到的触动越大越好，到一定时候，就能颠覆意根固有的知见，确认五蕴是无我的，就断我见了。</p><p>如果在定中还是依靠意识来思惟，一是说明定浅，二是说明法义没有传递到意根那里，意根没有受到熏染，就不能思量法义，于是不得不靠意识思惟。如果意识一念不生了，意根也不思量，那就能入到枯定当中，没有观行智慧，不出生般若大智慧。</p><p>没有禅定的人，往往觉得证果很快很容易，就是靠意识的思惟理解，那当然比意根思量快很多倍。有禅定的人，就不觉得证果是很快很容易的，因为意根的无明重，接受真理比较慢，思量法义也比较慢，所以断除意根的无明非常不容易。</p><p>以念佛为例，没有禅定的时候，意识可以大声念佛、高声念佛，当念佛定出现一点以后，念佛的声音就小了，定越好，念佛的声音越小。定深的时候，干脆无法出声念佛，就在心里念佛，用心念而不是口念。定再深的时候，意识的心念也不能念了，就入定中，如果意根受熏，就用意根来念佛。意根念佛时，没有意识的口念和意识的心念，但是内心深处确实缘着佛想着佛，没有空。念佛熏到意根就是这样，所以没有禅定，佛法修行就是不能修到位，犹如隔靴搔痒，不能解决什么问题，佛才讲修行要具足戒定慧，三大法宝一个都不能少，信佛语尊佛教才能有所成就。</p><p>十五、六祖悟道是现量观察第八识</p><p>凡是大乘菩萨参禅的实证，都是亲自证得了第八识，能现前观察第八识的功能作用，而不是靠推理推论的形式来推断第八识的存在和功能作用，推理推论不是实证。六祖在听五祖讲金刚经的时候悟道，实证了真如第八识，马上就能现前观察第八识，于是就说出了五个何期自性。其他禅宗祖师在开悟的时候，都是实证真如第八识，没有靠推理推论的。</p><p>只有实证才能现量观察出第八识的功能作用，获得了般若大智慧。以至于般若智慧满足的时候，能现前观察第八识的极多功能作用，如观手中的庵摩罗果，不是想象手中有一个庵摩罗果，而是眼见庵摩罗果真实的存在。证得第八识也是，不是想像推理有个第八识，想像着祂起何种功能作用，而是现前就能观察到第八识在五蕴十八界当中的种种作用。</p><p>推理和想像是意识的功能作用，实证涉及到意根的亲证。意根实证是现量呈现，当下就见，不用在遇见什么法时再努力的思惟这个法当中的第八识，现思惟的东西不可靠，意识灭的时候就无法思惟了，就不见第八识。尤其是命终以后，没有意识时就不能再思惟第八识，不见第八识存在就是凡夫，就会以凡夫身去投胎，一生所修唐捐其功，甚是可惜。所以凡是不能现前马上当下就见第八识功用的，靠推理来证明第八识的存在的，都不是证悟。</p><p>十六、解与证的区别</p><p>解是意识解，而意根不解不知；证是二者都知都解，都不愚。对于一个法，意识解了，是知其然，意根证了，是知其所以然。知其然是知表面现象，不知内里，是比较肤浅粗糙的知，没有观察力，一问具体和实质、细节等就会一问三不知，对于法只能懂得一些粗略和粗糙的东西，无法细致深入了解观察更多、更深、更具体的内容，因此对法讲不太清楚，更不透彻，给人一种模模糊糊隔靴搔痒的感觉。</p><p>知其所以然，是知法的内在原理，深入表里，知法的实质和来龙去脉，观察力强，能了知法的具体细节，思路清晰，理路透彻，逻辑严谨周密，智慧强大。所以观一个人对法的认知程度，就看他对法的描述是停留在粗略的表面现象，还是能够深入到具体细节，越具体，说明实证的程度越深，智慧也越深；越粗略，越没有实证，离实证越远，智慧越浅，越是意识的解，越没有意根的作用。</p><p>十七、说理与证理的区别</p><p>达摩祖师遇见梁武帝的时候，为什么不愿意度他，听他说几句话，转身就走？梁武帝派兵追赶，达摩祖师也不回头，宁可河南嵩山石洞中一个人面壁九年，也不出来度人，更不度梁武帝。梁武帝是何许人也，可以网上查一查，建寺院，度人出家，供养三宝，亲自讲金刚经，傅大士上堂说法，梁武帝蹲下身子，用后背给傅大士当台阶走上讲堂。这样的人物，福德深厚，善根不浅，达摩祖师为什么不接引他？梁武帝若是在如今这个时代，早就悟个十八、九次了，那个根性在现在的社会也很难遇，达摩祖师就是看不上眼，连引导他多说几句话都不肯，究竟为什么？祖师在面壁九年的时间里，能度多少人却只管一个人面壁，究竟为什么？</p><p>梁武帝的福德确实很大，对于三宝特别护持，善根不可谓不深厚，但毕竟没有深厚到能明心开悟，言下识宗的地步，所以达摩祖师没有功夫一点点的教导他向上一路，如果对方不是宗门那块料，多说没有用。禅门度的是那些想解脱生死并且因缘也具足的人，因缘不具足的人不能强行引导悟入，否则就危害佛教和众生。</p><p>真正得道的祖师最反感能说不能做的说理者，所寻找的都是真正能证理的有道器的弟子。所以达摩看到没有因缘成熟的人，就面壁九年以等待因缘成熟的弟子到来。梁武帝尽管当时能讲金刚经数座，能当座主，但毕竟只是一个说理者，还无法证理。没有证理而去说理，所说水分极大，无有实义。达摩祖师对他用什么心思也没有用，因为梁武帝毕竟还不是道器。</p><p>就如德山禅师昔日未悟之时，金刚经不知讲了多少座，人称周金刚，肩担两担青龙疏钞，奔向南方破魔，结果被龙潭禅师度化开悟以后，毅然的一把火把自己多年的心血两担疏钞全部烧毁，口里喃喃：“穷诸玄辩，若一毫置于太虚；竭世枢机，似一滴投于巨壑。”意思是自己从前说多少理，辩多少论，也就像一根毫毛扔到太虚空里一样，根本没有分量；倾尽自己所有的智慧才能，也就像一滴水投到巨大的沟壑中一样，无足轻重。未真悟前，写多少书都是废纸。</p><p>说理与证理有什么区别？说理者用意识说，证理者用意根证。达摩祖师血脉论里有一句话：若不见性，说得十二部经教，尽是魔说，是魔家眷属，不是佛家弟子，既不辨皂白，凭何免生死？意思是即使能讲十二部佛经，若不见性（开悟），即同魔说。</p><p>说理多证理少的现象很普遍，尤其是现在末法时期，到处都是说理者，几乎看不到证理者，漫天遍野都是说理的，很让人堵心。那些说理者，说他解悟，都是高抬几级台阶了，还对解悟这个名称不满意。解悟的人都有个真实实际修行的过程，只是没有达到最后一个实证层次，最终的一个结果没有实证，推理了一下想像了一下，但禅定还是有的，只是不太具足，智慧是有的，只是水分多点，三十七道品也修习了，只是不圆满，菩萨六度也修了，只是还没有修完。为什么现代连解悟佛法的条件都不具足，还会有那么多证悟的人出现呢？答案大家自己思索。</p><p>十八、有深禅定的辟支佛都是实证十二因缘</p><p>阿含经中讲辟支佛顺推十二因缘和逆推十二因缘，虽然描述辟支佛参究的语言比较简练，介绍的修行过程比较简单，可是辟支佛们的修炼都不是很容易的，中间过程曲折又艰辛。实际观行思惟的时候，都是在甚深禅定当中，意识一边思惟，意根同时思量，所以结果当然都是实证。没有禅定时，只有意识的思惟，没有意根的同步思量，所以不能证，可以解，但是解没有用。</p><p>辟支佛具体实修过程，佛不能给详细的披露，目的是为了让后人自己去用功实证，功夫做不到位，说多了容易让人意解，所以只能那样简单的说。在那些简单的思惟和对话当中，千万不能认为辟支佛就是靠意识的推理和逻辑思惟而得出了一个结果，那样说等于诽谤辟支佛。辟支佛的禅定非常高深，意识的作用绝对不能占主导地位，不可能压倒意根，意根的参究和思量要占主导地位。禅定越深的人，意根用的越多；反之禅定越浅的人，意识用的越多，主要靠意识的想像推理推测，无法用得上意根。</p><p>同理，阿罗汉们都有很深的禅定，对于过去和未来的五蕴观察，都不用意识推理，不用比量和非量，都是现量观察，意根参与。因为那些色身与当前的五蕴身一模一样，属于同类，证得当前的，就知道过去和未来的。比如现在有一批产品需要检查，因为产品都相同，只要抽样检查其中一个，就知道全部产品如何。当然不包括有人在里混淆其它产品。在保证一模一样的前提下，检查一个几个就可以知道全体了。所以阿罗汉们的证都是现量证，是什么就是什么，没有想象的那种思惟模式，没有比对的思惟模式。没有禅定的人，那就免不了意识的比量非量的思惟作用，其结果都是解，无法实证。</p><p>十九、意根不证法不能成四圣</p><p>三千大千世界是否能有一位意根带着无明，带着错知错解错执的人成佛的？是否能有一位意根带着我见、不见实相第八识的人成菩萨甚至转识成智的？绝对没有。</p><p>佛是四智圆明，都圆明了哪四智呢？首先意识圆明究竟转识成智了，其次意根圆明究竟转识成智了，然后五识圆明转识成智了，最后第八识圆明转识成智了。修到初地菩萨，意识第一次转识为智成妙观察智，意根第一次转识成智为平等性智。意根凭什么能转识成智呢？就是因为断除了我见，断除了我执，证得了法界实相真如心，破除一分法执，具有了大智慧，才转识成智。不然意根凭什么转识成智呢？</p><p>只修意识，不到达意根，就不能修成什么法，只让仆人吃饱饭，不给主人吃饭，主人饿死仆人就散灭了。打仗作战时，参谋意识看完地图，将军意根看不见地图，这场战争就无法进行，因为意根不了解情况无法作主指挥作战。</p><p>学佛成佛由意识单枪匹马，意根带着所有的无明，连我见都没有断，能成佛吗？生死轮回以及成就佛道不由意识作主了，解脱不由意识作主了，都是由意根作主起决定作用。死亡的时候如果意根都是无明，就会投到无明胎里，还是无明众生，不能投到圣胎里；涅槃的时候，意根带着所有无明，我见具足，贪执三界，意根还有三界无明，就不能涅槃。</p><p>有些人总是想让意识当主人当将军，一切法由意识说了算。这是不可能的。如果有可能，我们都希望这样，意识作主，学佛修行轻松愉快，成佛用不了几劫时间，比坐火箭还要快。意识琢磨琢磨理解理解，佛地境界明白了就成佛。然，这是绝对不可能的，所以还是要努力修行意根，让意根明理破无明破执著。</p><p>二十、意识对法的感悟和感慨还不究竟</p><p>某学佛人感悟：想想意识我、意根我，是不是很虚妄的一种存在而已？强大而真实的存在，只有真如心，真如心才是不可思议的真常体、智慧体。知道了这些，您还为这个渺若微尘、虚妄不实的人世间之爱恨情仇、喜怒哀乐、得失成败耿耿于怀么？</p><p>以上的感慨也叫作感悟，但是尽管有这样的感悟，身心世界要想得到根本扭转和改变，还是要在此基础上，如实的在禅定中观修，实证了之后，才能改变身心世界，真正得到某种程度的解脱。想想是意识的能力范围，实证要靠意根，意根要现量。所以只是想想，用处不大，还要现量观察，现量认知。知道世间什么都是空的，都是如来藏幻化出来，也没多大用处，需要有下一步的实际修证，只有证得了，心才空，才有解脱的力量。</p><p>有一些人，整天心里想着世间如梦幻泡影，就觉得好像真的就是梦幻泡影。可是事到临头，该怎样还是怎样，丝毫不是梦幻泡影。真证得梦幻泡影时，在十回向位，快成初地菩萨了，那时候心行才能改变。但是在实际观行之前的理论知见还是要具足的，心要有个相似的空，对理论有一定程度的解，有了这个基础，就可以在禅定中实际参究观行，实证才有希望。</p><p>二十一、黄蘖禅师反对知解</p><p>黄蘖禅师云：我此禅宗，从上相承以来，不曾教人求知解。只云学道，早是接引之词，然道亦不可学。情存学解，却成迷道……第一不得作知解。又云：古人心利，才闻一言，便乃绝学，所以唤作绝学无为闲道人。今时人只欲得多知多解，广求文义，唤作修行。不知多知多解，翻成壅塞。《黄蘖传心法要》</p><p>给你一片绿叶，挖出一窝红薯，才是证悟。向人要一大堆红薯，却看不见一片叶子，那是别人挖出来的红薯。还有人收集了一房屋叶子，至死也没有发现一根红薯，连解悟都没有达到。</p><p>佛法修证的方式方法，越古越接近佛陀的本怀，越没有水分和沉渣，越不变质，越纯正。如今的人，意识简直聪明得过了头，就像充满了气的气球，只可欣赏，千万不要碰！</p><p>二十二、达摩祖师所讲的入道三个条件</p><p>达摩祖师教导禅行的方法：外息诸缘，内心无喘，心如墙壁，可以入道。前三句的条件和方法，后者是目标和结果，没有前三个充分和必要的条件，就没有后一个结果。凡是修行当中与达摩祖师讲的入道条件不太一致，与三个条件相差比较大的，一定是掺杂了意识的情思意解，所悟就不真，见道就偏，如雾里看花朦朦胧胧，真智不现前，道业就会停滞不前。</p><p>外息诸缘，用功参禅时，要把心外的六尘境界的缘都屏蔽掉，心不着六尘相，不被六尘境界转，见山非山，见水非水，不去分别山水相，心就不住山水上，不住在世俗有为法上。</p><p>内心无喘，内心里也不要有种种贪求和烦恼，不要有种种参禅之外的思想和念头，不要有什么思想情绪。</p><p>心如墙壁，在参禅的过程中，把心修炼得平平静静、严严实实、密不通风如墙壁一般，外尘不入，八风不侵，内心杂念不起，无烦无恼，定力如山，一切境界不可催伏。</p><p>在参究过程中没有语言、文字和声音，相当于参禅的后续阶段伺，如猫伺鼠，静伺机缘，伺机而动，等着所参的目标出现，然后一把揪住，就可以享受战功了。达摩祖师所讲的这个用功境界，不是纯粹的一念不生的禅定境界，而是定慧等持的参禅境界。意识在其中确实是没有念头，但意根却在深深的思量着，疑情很浓，思量很重，念念都是疑，念念都不放松，念念都是道，无世俗念，对于所参究的目标穷追不舍，一心要究明无始劫以来的生死本。</p><p>功夫只有达到这样，才能证道和入道，才叫作意根的亲证，从此以后，后得智差别智才能渐渐生起，能现前观察第八识在五蕴身中运行，能现前观察第八识的无为性和有为性，而不是依靠想象和推理。七识既能学到第八识的无为心性，也能学到第八识的有为心性。若是依靠意识的解，只能想象第八识的无为性，不能现前观察第八识具体是如何无为的，也观察不到第八识的有为性，观察智就不能出现。</p><p>凡是通过甚深禅定入道的，都是意根亲自参究了，也亲自证得了，才叫作亲证，否则都是意识证，说个亲证就多此一举了。能够入道的禅定有未到地定和初禅定，还要是具足的未到地定，如果未到地定不具足，悟道就浅，有初禅定就更好了，悟的就会深和透。</p><p>二十三、参禅和逻辑推理的区别</p><p>（一）参禅是过去禅宗祖师们提倡的明心证悟的修行方法，通过参禅这种方式就可以证得本心自性第八识。参禅要求一定要有甚深的禅定，能够朝斯暮斯的用功而不间断，二六时中心都在参究觅道上，心思细腻，因缘成熟时，触缘遇境才能随时自悟，或者在禅师的机锋下瞬间悟道。</p><p>初期功夫不纯熟，参禅叫作寻，意识比较用力，思惟的多一些，明显一些，随着禅定的加深，功夫的纯熟，就进入伺的阶段，意识就不能用心，意根的思量作用就体现了出来，这样才能朝斯暮斯，白天黑夜醒着睡着都能用上功夫，打成一片，疑之至深，以至于心思非常灵敏，遇到相应的境界，就会证悟，得成三昧。禅定浅一点，功夫就无法深入，不能发起证悟的三昧定慧境界。</p><p>而逻辑推理逻辑思惟完全落在意识心上，功夫比较浅，有禅定也可，无禅定也行，乃至于中学生都能用逻辑思惟和推理的方法解决学习中的疑问，上至各层次的学术研究者，普遍都用逻辑推理的方法，即使有禅定者禅定也比较浅。逻辑思惟和推理相当于正式参禅之前的入门阶段，入门以后，就不可以再用逻辑推理了，逻辑推理是禅宗参禅的大忌，是所有禅宗祖师极力反对的，说为是意下卜度、情思意解和鬼家活计。禅师们都严格禁止弟子们意下卜度、投机取巧，要求离心意识参，就是不让用意识的思惟，离一切语言文字声音的来参禅，没有禅定就做不到。</p><p>意识有语言文字时，肯定是禅定非常浅或者是没有禅定，禅定深时，意识无法有粗浅的思惟活动，甚至细微的思惟活动都会自动断掉，但不妨碍意根的思量活动。诸佛甚至在四禅中都能证道，一般人的意识在二禅就没有了思惟，三禅和四禅里更是灭去了意识的思惟，虽然意识还会存在着不灭，还有极深细的知性。所以比较深的禅定能抑制意识的思惟，而能激发意根的思量。在意识意根共同存在的情况下，其思虑活动此消彼长，如果意识思惟太活跃，就阻碍了意根的思量，意根无法用心。</p><p>逻辑思惟和推理都有语言文字，离不开语言文字，都是意识的思惟活动，意根使不上力，因此意根就不会证得最后的正确结果。因为意根无语言文字，所以真正的参禅和参究都是以意根为主，禅宗祖师所说的离心意识参，就是不让有粗浅的意识思惟。</p><p>（二）逻辑推理是比量，现量平直，当下即是，不用再比较分析。逻和推都属比较分析，辑也属比较分析，辑字本意是在车上合理摆放大小长短不一的箱子，故需要分析比较车体和箱子的匹配度。</p><p>参究参禅，无语言文字，疑情正浓时，遇到一个缘，触到一个境界，突然相应顿悟了，一拍大腿，就是它，于是找到了亲娘。如果还用逻辑推理说：十年前我娘是四十岁，十年后我娘应该是五十岁，看这个人的年纪与我娘差不多，应该就是我娘了，结果认个后妈。临终时后悔，怎么也来不及了。逻辑推理都是意识的思惟活动，意识单独认的都是后妈，跟随意根认的才是亲娘。</p><p>意识有定无定，都可以逻辑推理，其结果是明白了一个理；而证果和明心都需要具足未到地定，这样才能一门心思的参究，其结果是顿悟。而逻辑推理不需要多少禅定，心念集中一小会就可以了，要求的定力非常低，因此逻辑推理智慧劣弱，无法证果和明心。当禅定深时，意识的思惟活动就会受到限制，无法正常进行，当疑情非常浓重的时候，意识的思惟活动也衰弱了下来。定力越好，意识的作用越弱，意根的作用越强，现量智慧越深细。</p><p>二十四、多讲意根是为了避免佛教的乱象越来越严重</p><p>对于意根，声闻人能简单理解一下意根是六根之一，是出生意识的俱有依就行了，知道意根也是生灭变异的就行了，不需要了解太多。大乘菩萨在明心之前，同样不需要太多了解意根，刚明心的初级阶段在过阳炎观之前也不需要太多了解意根。</p><p>只是末法时期，尤其是现阶段，由于众生修学都是有急功近利之心，心性又浮躁，又没有禅定，也不能修禅定，往往都把意识理解的当作悟，或者是把意识解悟当作悟，未来世果报可畏，所以在如今时代必须要多讲意根，避免以解为悟的难堪现象越来越多，避免口空心不空的现象越来越严重，佛教里的虚浮现象越来越严重，佛法一变质，后世人就没有可依止的了。讲意根，让大家分清解悟与证悟的区别，是解燃眉之急，避免佛教乱相越来越严重，避免佛教提早灭亡，实在是不得已而为之。</p><p>不少人既不想好好持戒，怕受约束，也不想辛苦修禅定，好逸恶劳，不想改变自己的心性，破除无明烦恼，只想尽快得到最后一个果当圣人，以风光无限，不知道天上何时掉过馅饼。有这等好事，释迦佛和十方诸佛不让众生知道，却讲什么戒定慧和菩萨六度，让众生这么辛苦修行，不知何意。</p></div>"
},{
    "title": "第四章 意根在参究中的作用",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  意根在参究中的作用</strong></p><p>一、修行的过程</p><p>当我们听别人说一件事，当下就知道了，但是知道了并不会马上就信，需要去核实、检验和验证，才能相信。只有头脑简单、智慧不足的人才不加以验证马上就信受，并作出反应。这个验证信息的过程，就相当于证悟的过程。前边听别人说事相当于意识的了别，中间的知道相当于意识的解，后边的验证相当于意识与意根的参究，最后边的信相当于意识与意根的证，和意根的信。再后边有奉行，相当于意根改变自己以后所采取的行动。</p><p>整个参禅修行过程可以用六个字总结归纳：知、解、参、证、信、行。六个字代表六个修行阶段，其中意识的信，相当于第一和第二阶段，这里就省略掉了。</p><p>不少人都把意识的知和解，当作修行的终极，以为修行到头了，满足了，于是就高傲起来。其实这才仅仅是开头，还没有到中间阶段，只有意识的知解正确如理，才能到达中间参究的阶段。可见意识正确的知解也是很重要的，不是很容易的。极大多数人都停留在这个阶段，越不过去，无法接续参禅。因为基础还没有打好，知见还不如理，没有建立好。如果只停留在这个阶段以为究竟，智慧该有多浅，难怪要起慢心了。</p><p>六个阶段后边的信，才是真正的信，叫作证信真信，不是仰信和迷信，意识的信就是一种仰信迷信和崇信，不是正信、真信和证信。没有修到正信真信证信阶段的人，对于所信仰的法，都会有退转的可能，因为基础不牢靠，知见没有完全建立好，没有经过对法的验证。根基越浅的人，验证的时间越长，根基非常好的人，很快就能验证出来。人的修行真的不能看一生一世，一定要多看前世的基础，前世修行越好，根性越利，今世修行越快。意根信了就有行，意根证了才能信，意根见到现量才能证。为什么那么多人修行还能退转？因为不是真信，没有实证。</p><p>二、意识证果和意根证果</p><p>证果和开悟时，到底是意识明白就行，还是需要意根同时明了一起证果，这个问题也是唯识种智的问题，只有转识成智以后的地上菩萨才能真正观察出来，才能真正明了这个问题。因为地前菩萨和凡夫都不能观察到意根及其运作，观察不到意根在证果当中所起的微妙深细作用，因此否决意根在证果当中的作用，就是不如理的，是谤法和坏法的行为，果报不轻。</p><p>跟着一起宣传意识证果的，今世后世果报，都不甚乐观，犹如盲人指路的果报一样。我们都应该在自己还不懂法的时候，尽量选择闭口，少发表态度，就少遭灾惹祸，不发表言论就不遭灾惹祸。病从口入，祸从口出，这个道理应该人人都懂得。</p><p>三、真正的证法是意根证</p><p>真正参禅用功时，因为禅定很深，意识几乎无所用心，只有意根处于伺的状态想要明了，深深的究着，最后因缘具足时，意根就会突然间找到五蕴上正在运行的如来藏，于是证悟了，同时就把这个消息传递给意识，意识于是恍然大悟，与意根几乎是同时证悟的，意根指挥意识一拍大腿。只要是意根证悟了，当时的身心都要不同于平常的反应，身心轻安，心情愉悦喜悦，轻松自在。只有意识的解，就没有这些征兆和反应，因为意识不作主，主导不了身根。没有禅定，或者禅定浅，意根就派不上用场，因为祂缘的法多，不能单独参究，不能与意识一起参究。</p><p>一般来说，真正的证得任何法，都有禅定，意根都参与参究过程，最后都是意根证，再告诉意识。如果是意识先证，再告诉意根，意根就无法充分的参究思量，是勉强同意意识的观点见解，悟的程度浅，意根不是完全充分的了解，很容易退转。意根自己先证的，往往非常坚信，不会退转。</p><p>而意识自己单独情思意解的，意根没有参与整个思惟活动，即使意识明白一些理，意根还是稀里糊涂，疑惑重重，意识心粗时一般发现不了意根的心理状态。意识自己单独得出任何结论和答案都不究竟和彻底，没有证据，或者证据不充分，谈不到退转不退转之说，因为根本没有前进，何谈退步。</p><p>禅定越深，意根越能派上用场，禅定越浅意根越无力。退转与不退转在于意根，意根牢牢实实的自己参究思量，去找答案，一旦得出结论，祂就非常确信，不会怀疑，谁都是最相信自己的。</p><p>所以用力少，证的就浅，疑不能断尽，将来容易退转。意根不证，疑惑一点不能消除，就不属于证，不能断结缚，因此谈不到退转问题。如果是参究如来藏，也谈不到转依如来藏问题，因为没有证得，如何能依？不能依，就不能转。没有前进，就没有退步。</p><p>只在意识上弄精魂，临终时吃大亏，再后悔还来得及否？有的人会说，证初果，没有断烦恼，身心不会转变，没有什么变化，这是正常的。可是在世间法里，意根真正知道个什么事情，也会激动得异乎寻常，身体有很大变化，心里激动万分，或者热泪盈眶，或者身心颤动，或者神情肃然，或者……。</p><p>在证果之前修行三十七道品过程中，身心都会一点点的发生变化。没有变化，那就是没有修行，修行方向不对，或者是根本不精进，不上心。</p><p>四、乘坐公交车譬喻意根的知和证</p><p>一个人要坐车到甲地去，走到公交车站，发现有一路公交车和二路公交车，他看了看两个车的站名，意识知道应该坐二路公交车，于是决定去坐二路公交车，坐上车以后，就会到目的地了。</p><p>问：意识所知道的内容，意根知道吗？决定坐二路公交车是意识决定的，还是意根决定的？坐上车，是意识指挥的还是意根指挥的？   </p><p> 答：意根利用六识来了别自己想要了别的法，意根与尘相触生意识，意识了别的法，意根也一直触作意受想思，意根如果不触法了，意识就在这个法上消失。所以意识知道的法意根同时也知道，差别在于两个识知道的是否一致。</p><p>意根不能了别细微内容，意识就替祂了别，意根无法分析推理判断，意识替祂分析推理判断，意根知道后，自己再思量考量，如果与意识的观点一致，就同意意识的判断和决定，如果不一致，再让意识想一想，然后意根再思量思量。意根的这种恒审思量作用，时时现起，一切法祂都要把关，然后才能放行，做自己最终的抉择。</p><p>问：当意识知道了二路公交车才能到达目的地时，意根是否也要证得这个道理？如果意根不能思量证得这个道理，是否能坐车到达目的地？</p><p>答：意根要想知道意识了别的内容，必须经过自己亲自思量，不是意识说什么就是什么。意根的恒审思量就是起这个作用的，所以意根有自己的思想和智慧，不是呆瓜。</p><p>当意识知道了二路公交车才能到达目的地时，意根不一定知道这个道理；如果意根不能思量证得这个道理，就不能到达目的地。这就涉及到了意根的智慧问题，也涉及到了意识的思惟分析能力问题，还涉及到了有没有烦恼遮障的问题，这里还有定力的问题。</p><p>意识理解知道的很多法，意根不理解，就会迟迟不做决定，一直不采取行动。比如布施这件事，意识觉得应该做，意根不了解，就不愿意去做。那么同理可证，当意识思惟分析五阴苦空无常无我的时候，意识走马观花，不仔细思惟观行，意根由于分析理解力差，就不明白这个道理，也害怕真的就无我了，不知道无我有什么好处，就不让意识再思惟这件事。</p><p>所以有的人意识虽然明白一点五阴无我，意根不一定能明白，意识知道的，意根不一定能证得。意根不能证得五阴无我，那么就不能断除三缚结，一切身口意行都不能改变，生死问题不能解决。 坐公交车都是由意根决定的，难道生死大事就不要意根决定，由意识决定？第一口吃饭，第二口吃菜，都是由意根决定的，意识你参谋参谋就行了，至于吃什么不吃什么，吃多少，还是意根主人拿主意。</p><p>学佛了生死，不能像鸵鸟一样把头埋进沙土里，就觉得没事了，要正视问题，解决问题，不能回避问题，生死大事回避不了，必须面对它解决它，才能安心。</p><p>五、没有意识时意根的特殊作用</p><p>念佛深入到意根，扭转了意根的思想，睡觉的时候照样能念佛。参禅引起了意根的疑情，睡着了照样参禅，睡不踏实。问题没有解决，意根认为非常重要，睡着以后照样思量，醒过来眼睛一睁开，意识就会突然明白，问题解决了。</p><p>把意识没有明了的法，交给意根，意根深深的疑着、思量着，意识该干什么就干什么，不知道什么时候，意根解决疑情，意识突然间就明白了，恍然大悟。</p><p>对于佛法，意根是利用意识去学习佛法理论知识，之后意根依此学来的理论知识，再消化吸收，相当于牛在休息时的反刍。很多人只靠意识到处学习收集大量的知识，然后再输出出去，从来不懂得让意根吸收消化，从而变成自己所需的营养，成为自己真正的智慧。祖师们说没有实证的人讲法就是耳入口出法，或者是情思意解法。自身尚且没有获益，何况让他人受益。</p><p>六、把疑念悬在意根心中就是参禅</p><p>降伏和改变意根，让意根明理最快的方法，就是意识把理大概明白以后，在定中把这些道理悬在脑海中，不用去思惟，就那么静静的看着放着，然后指不定什么时候就会觉得有一点点的明白了，或者是突然间就明白了，这是让意根单独思量的结果。这个方法非常管用，我经常是这样用的，而不喜欢意识粗浅的分析研究。心里、头脑里悬挂着的念头就是一个疑问，只要是不懂的问题，都可以放到意根那里，让祂思量，意识或者配合，或者不惹事不干扰，或者照常处理日常琐事。至于意根什么时候能给出答案，那要看意根本身的智慧，也在于禅定如何，在于意识配合得如何。</p><p>心里悬挂念头的方法，就是过去禅宗祖师们常用的参禅方法，对于如今世间没有禅定的人来说，比较难修。一开始往往不得其门而入，觉得没有下手处，需要自己不断的揣摩，不断的实验，一旦掌握了方法，入了门就好办了，以后遇见疑难问题就用这样的方法，能从根本上解决问题。有好多道理看着好像懂却不是真懂，其实就是意根不懂，意识是多多少少明白一些的。静下来，给意根时间精力，让祂考量，出来的结果就会相当满意，没有疑虑。这需要意识有个思考的大方向，稍微明白了一点道理。定慧都好的人，意识不明白也行，就把问题悬在内心深处，不久就能明白。</p><p>没有禅定几乎都是意识思惟了，意根使不上力，思惟一般都是比较浮浅不深入。现代人因为普遍缺少禅定，会参禅的人很少很少。可是有些人从来没有参过禅，也悟了，有些人从来没有修过三十七道品七觉分四念处，也断我见证果了。这样投机取巧的走后门，损失最大的是自己，将来最苦恼的还是自己，这是得不偿失的。</p><p>七、法义太熟反而障碍悟道</p><p>学法是为了证法，要想证法，就不能让意识对于佛法烂熟于心。为什么这样说呢？因为意识烂熟于心，就会觉得自己已经懂得了，不屑于也不感兴趣再仔细思惟参究，这样就会流于口头禅，是懂非懂的，很障道。意识对于不太懂的法，才会感兴趣去深究，意根因此就会参与其中，从而才有证法的可能性。</p><p>因为很多人都修不出禅定，不能深细思惟观行，就不得不反反复复不断的读诵法义，以至于法义都能烂熟于心，倒背如流，而无法深刻的领悟其中的内涵，更无法证得，不能藉此消除深重的业障，很是可惜。</p><p>经常钻进故纸堆的人，智慧远远不如看书不多而喜欢深思的人，后者说出来的话都是自己悟出来的语言，从来不拾他人唾沫，前者一说话，都是他人的声音，重复他人之语。</p><p>八、想不到阿赖耶识是什么意思</p><p>想不到阿赖耶识，就是用意识琢磨研究分析理解。阿赖耶识不是理解出来的，不是想像出来的，也不是研究出来的，必须在禅定中实证，破除意识意根两个识的无明，意根的无明不破，身口意行永远是无明的，并且继续把无明带到后世，生生世世还是无明。</p><p>不少人在文字里翻来覆去的琢磨阿赖耶识，拆解文字，禅宗祖师称作钻故纸堆，两只眼睛几乎要把文字看化了，把纸看穿了。有些人把学习资料整理出一大堆，天天读，有的人都能倒背如流，文字都非常熟悉，张口就来，可是都没有真正消化吸收那些法义，为什么？没有禅定，证不得，真正的义理不懂，学些皮毛，就像背书一样。</p><p>这样用功是在用哪个识？都是在用意识分析推理研究，没有禅定，不能深入到意根，调动不了意根，就不能把法变成自己的，永远是学语。没有禅定，思维稍微深入一点就停止，深入不下去，只好浮在表面，知些浅显的知识。所以每个人应该反观自己的修行方式方法，不对的赶快纠正过来，尽快让自己走上修行正轨，获得大智慧。</p><p>九、意识重复不等于意根的思量</p><p>问：要不断重复行为，让行为成为习惯，无意识的习惯才是意根的“知”。对吗？</p><p>答：重复，再重复，没有禅定，重复多少遍，意根如果不对重复的内容进行有效的思考思量，还是不知其所以然，不能证，不能真知。有定的时候不用重复，法义直达意根，让意根自己去思量，有朝一日，就会思量明白，那就是证。</p><p>十、意根的思量就是参究</p><p>五阴十八界十二入，都是各种因缘聚合而有，因缘散即消失，因此虚妄不实无我。此理要如何契会？意识想一想就能明白个大概，可是自己心里清楚这不是真正的懂，知其然还不知其所以然，还需要继续深深的确切的明了。这就需要在禅定中，把此理悬在脑海中，让意根思量。意根的思量不粘境，有一定的高度，叫作高着眼看，也叫作深细参究。</p><p>十一、意根思考问题就会半夜明白</p><p>问：晚上打坐思惟法义，直到下座也只是似懂非懂，心里一直悬着不懂的问题就睡着了，睡到半夜突然明白了，明白的当时心里特别清明，兴奋的就睡不着了。半夜明白的，是谁明白？</p><p>答：如果思惟问题比较深，一直悬在心里，就是意根也参与思量了，如果没有得出结论，没有思惟明白，意识就会疲乏、转移注意力或者是灭去了，而意根还会继续思量，不知道什么时候意根就把这个问题思量清楚了。</p><p>很多问题，晚上考虑的比白天要清楚，为什么？因为受到的干扰小，意根相对专注，较多的参与了思量。攀缘，是意识攀缘还是意根攀缘？是意根攀缘，但是因为没有六识的配合，意根的攀缘就减少了。所以六识安静下来以后，意根就能集中精力单独思量一个问题。晚上没有六识，意根攀缘少了，六识不把分别出来的信息干扰意根，意根就开始反刍了，专心思量意识所思考不明白的法义，就有可能半夜里突然间明白了法义。</p><p>十二、意根证的过程</p><p>在未到地定或初禅定中，意识把某一法义如理思惟的过程和结果传递给意根，意根经过仔细思量，证明和确认了意识的认知，或者是意根意识并没有得出一个如理如实的结论，没有结果，意根在意识提供的线索的基础上，自己单独思量参究，最后得出一个符合事实的结论，这就是证。意根的证离不开禅定，离开禅定意根就会散乱和攀缘，无法专心思量和考究，就无法实证。但是意识思惟和理解可以有禅定可以无禅定，对禅定的要求并不高，因为意识的慧力大于意根。</p><p>在前期意识的思惟观行过程中，一定要现量观察，越现量对意根的启发越大。意根在很多时候即使是意识现量观察的法也难认知，何况不是现量观察，意识的非量想像和推理推测，无法让意根认知和认同。意识的比量和非量思惟，对意根的作用小，意根不容易认可相信。意根要依靠意识的现量观察，然后起自己的思量性，思量明白了就会认同证得了；思量不明白，还是意识自己单独知。</p><p>比如意识明明知道色身一年一年变化得很快，人从幼年转眼间就长大，再转眼间就长成青壮年，尤其是到了中年和晚年，由于心境的关系，更觉得日子过得太快了，很怕自己过早离世，很是惜命。为什么惜命怕时间过得快？都是因为知道色身早晚会灭去的，不是永远不老不病不死的，知道是无常的，有些时候也觉得是苦。可是意识知道这些有什么用，意根从来不理会不思量，所以每生每世该怎样还是怎样，生死轮回就必不可免。很多事情意识知道的都没有用，意根不知道，该怎样做还是怎样做，丝毫改变不了什么。</p><p>因此意根的证非常关键和重要，祂是连接过去、现在与未来的作主识，生死轮回由祂说了算，断除烦恼和无明由祂说了算，解脱由祂说了算，成佛也由祂说了算。在修行上没有比意根更重要的了，第八识虽然比意根更重要，但是修行不用修第八识，没有意根，第八识就无所作为，只有第八识没有什么用，成就一切法全靠意根的推动力量。所以意识思考过的法，一定要熏染到意根，让意根来思量权衡取舍，让意根也证法，意识所作才有功德，才有结果，才有果报。</p><p>十三、恒审思量性说明意根在参禅中的重要作用</p><p>意根恒审思量的审字，揭露出了意根的心理活动，也把意根所起的作用揭露出来了，这说明意根不是废物和摆设，有祂非常重要的决定性作用，是一个活活波波的识心。意根接触任何一个法都要审一审，六识了别出来的法，意根都要审一审，如果审过了，就要做决定，就要处理了。那么意根在参禅中起什么作用？在断我见时起什么作用？在明心见性时起什么作用？在证得一切法时起什么作用？都是起决定作用的。</p><p>一切法都要意根把关，意根没有审查合格，就不能做处理。意根审查时，就有自己的识心活动，自己要有考量，并不完全听从六识，不是六识了别什么就马上认可什么。所以六识的一切所见，必须让意根清清楚楚的明了，意根不明了，审查就不合格，过不了关，意根就不能决定下来。断我见以及明心见性都要经过意根审查审核，意根不同意，就不能断我见，不能明心见性。意识单方面的断我见和明心，那是意识自己理解认为的，主人领导不同意就不算数。意识不经过意根领导同意，擅自做主说断我见和明心，这是不算数的，没有此理。</p><p>十四、如何用功参禅</p><p>当意识把理论知见部分都差不多通透了，定力也差不多够用的时候，就开始参禅参究观行了。不管是静坐，还是行走坐卧，心里都要带有疑情，时刻都能观行思惟参究。在参究过程中，意识先把法义的路数思惟清楚，大致的方向弄明白，思惟的内容要弄清楚，需要的基本数据要掌握清楚，然后把法义凝成一个点，交给意根，心里没有了语言文字，好像空了。</p><p>其实在这个时候意根并没有空，意根就会在心里悬挂着法义，祂会时时刻刻的思量考究，心里疑情不断，非常精进。这需要定力相当好，定力若不好的话，意识的思惟就出现了，意根就没法深入法义当中，无法深深的思量，更不能连续不断的精进用功。</p><p>在参禅之前先把心静下来，定力要修足够用，若心一天静不下来，就不要参禅和观行，一个月静不下来，更不能参禅参法。当你带着足够的定力参究的时候，越参究定越深，定越深参究的思路越清晰。定非常深的时候，意根也没有多少参究的法义了，就会入到甚深禅定当中了，出定以后再接着参究，功夫也很得力。偶尔入定也挺好，先入定再出定，行住坐卧都有定力，就可以很精进的参究观行了。参禅的步骤要一步一步走，一点一点的琢磨，就会累积足够的经验，后世也能很快用上手，他人也能借力吸收这个经验。</p><p>所有的修定和摄心的方法手段，无非是让意根证得佛法。当然意识肯定要先有一定的智慧，要充分的领悟佛法，再让意根去证得。如果没有定，就把意识的领悟当作证得的智慧，那就误会大了。</p><p>没有定水滋润的智慧叫乾慧，乾慧的意思就是意识明白，意根不证不懂，不起实际作用。如果在修行实践过程当中出现了问题，遇到了瓶颈，就要回头来寻找理论，重新把原理修正，找到方向再去实践。学法一定要实证，只有实证了，生命体身心灵就会转变，思想观念转变。意根明理思想观念一定会转变，世界就会随之转变，一切的行为和处世的方法态度也就随着转变，这也是修行的目的所在。不可自以为自己已经懂理了，不用再修什么，如果不在意识明理的基础上实际修行，在事上还是原来那样，还是跟着贪嗔痴烦恼转，结果还是入生死轮回中，不得解脱。</p><p>十五、什么才是真正的参证功夫</p><p>把需要参究实证的法在禅定中观行，定越深越好，忘记周围一切，内心只有无语言文字声音的法义，只有深深的疑，深深的思，似参非参，是思非思，不断不离，是有若无，杳杳冥冥，拿又拿不起，扔又扔不掉。做得这番工夫，实证是早晚的事。切忌将没有禅定的思惟称作观行，把意识浅思的结果当作证。</p><p>十六、真修行犹如反刍</p><p>老牛白天站着走着吃草，晚上静下来卧着反刍，以消化吸收营养，维持色身所需。晚上的反刍才是最重要的，才能满足色身所需能量，白天吃草只是提供草料的一种方便活动，供夜晚加工。同理，意识在五阴的活动中大量汲取各种知识，意根在静下来的时候，细细思量，以消化吸收。结果禅定和智慧都增长，道业增进。真正用功，应该如此用功，不可满足于意识汲取的那些粗燥的理论知识，而不得营养其心。知识不等于证量，实修是正道，实证才有证量。</p><p>十七、意识的熏习和意根的思量</p><p>问：有下面两段话是不是有些矛盾？一是：“如何让意根自己得出结果和答案？意识少分析思惟，多让意根自己思量考量，这样是最有效的。意识一旦知道答案，就不想再参了，意根也就没有什么机会参究。”二是：“要意识多分析思惟去熏染意根。”</p><p>答：两段话并不矛盾，最初打基础阶段，意识一定要多熏习佛法理论知识，把法义吃透搞明白以后，着重让意根也明了法义。但要证得法义，意识就要离语言文字相，把这些法义凝成一个点时时悬挂在意根心里面，这时意根的思量作用就要多于意识，意识就要少思惟分析，或者干脆不用意识思惟分析，全部是意根的思量参究。</p><p>意识熏习法义好比调查员收集市场信息，情报一定要详细，收集完材料后就交给老板意根审查，这时就没有下属多少事了，而老板看不明白的再适当解释一下，补充一下。法义凝成一个点悬在心里，就是意根老板要审查资料了，这时员工不要多打扰老板，等老板审核之后，得出自己的结论，就拍板认定了。这就是证得。</p><p>譬如世间的法律要判人有罪需要有完全充足的证据，所以意根(司法官)起疑情，需要意识(检察官)搜查证据，搜到意根笃定才算，才能量刑定罪。</p><p>十八、推理不等于现量</p><p>佛对一切法都是现量的知和觉，是什么不是什么，当下就知觉，根本不用去推理。不能现量知的时候才去推理，这表明意根和意识的智慧力不足，必须依靠推理才能获得准确信息。而佛是福德和智慧两方面都圆满具足的无上智，没有不现量知的法。</p><p>因地的菩萨们以及所有众生，智慧都不圆满，对于一切法还有不能现量而知而证的法，因此有时就会不得不使用推理这种方式，使用的越多，越说明智慧有缺陷。智慧足够的人，当下便知，没有障碍。因此说在参究和求证过程中，如果使用了推理的方法，说明此人没有现量智慧，不得不采取次要的方法，采取不如理的方法去获得信息。而推理类似于猜测揣摩，观察力判断力不足，只好揣摩猜测，不能肯定的方式做判断，得出的结论就不是现量的，不能完全正确的，即使完全正确也是巧合和凑巧。</p><p>有现量观察智慧的人，表达观点都是非常肯定，智慧不足就会用半肯定句表达，没有智慧就用疑问句表达，表明信心不足。使用推理方式的人，信心不足，当别人提出疑问和责问的时候，内心就会犹豫和动摇，不够坚定，这说明他获取信息的来源没有把握。</p><p>总之，在佛法修证过程中，推理只是一种辅助手段，不得已而为之，然后再用参究的方式，去证明推理的正确性。因为推理用意识，真参实究用意根，意根是主宰者，祂得出的结论，当然会掷地有声，铿锵有力，毫无动摇，谁也奈何不了。意识得出的结论，就不是这样了，祂不作主，必须等作主的人审批才能落槌定音，所以心中会坎坷不安。佛法的修证到最后关键之时，还是少用不用意识为好为妙为究竟，此乃大丈夫所为，非小根小器者堪比。</p><p>十九、思考问题一个比较省力的方法</p><p>对于一个问题，意识思考起来还没有头绪，专心思考还觉得非常累，这时候怎么办呢？就让意识把这个问题打包浓缩起来，然后交给意根，让意根时时带着这个问题，思量这个问题，意识该干什么就干什么。可以做一些轻微的活动，比如活动身体、整理衣物、收拾卫生等等，尽量不去想其它事情，免得过多牵扯意根的注意力，让意根分心太多而无法思量主要问题。</p><p>在这些轻微的活动中，意根虽然也分心分神，但还是有一部分精力考虑问题。如果活动过多过大，意根分心得多，就无法考虑主要问题了。等到意根对此问题特别感兴趣，想要解决的时候，有可能就会在睡觉时继续思量，也许会有梦境出现，而在梦中拉着独头意识一起思考参究，同时还能睡觉，这是最好最省力的了，意识不觉得累。</p><p>如果意识不怕累，在白天也要专注思惟这个问题，与意根一起攻克难关，这是最快的方法。意识怕累不参与思考，等到意根考虑出个大概思路，这时候还是需要意识细细思惟，还是要与意根一起解决问题。但是一个总原则就是一定要意根参与，如果意根不参与，就不能解决问题。</p><p>二十、如何引导意根思量参究</p><p>让意识把一个问题打包浓缩起来，然后交给意根，这个方法是这样操作的。意识把问题里的全部意思化作一个念头，悬在意根里，也就是内心深处，不管自己干什么，心里都要带着这个疑问的念头，深深的带着，不要舍离。如果心里没有那个念头，没有疑问了，没有思量了，意识再把那个问题丢给意根，再提醒祂。同时意识自己也不要有过多和复杂的思想活动，以免分散意根的注意力。禅宗参禅参话头就是这样参，方法是一样的，深细最深细的思惟就是这样。在世俗法当中很多人都用过，只是不会归纳总结出来为佛法所用。</p><p>只有意根能够思量和参究，才能证悟。而要想让意根参与法义的参究，必须有禅定，法义才能深入到意根那里，没有禅定意根就使不上力。如果没有禅定也要强行观行，那就叫作猜测和情思意解，这样的结果是什么，大家都已经知道了。所以禅定与证悟的关系，意根与证悟的关系，大家一定要搞明白弄清楚，才能着手用功参禅。</p><p>二十一、用意根深深思量的方法</p><p>盘腿静坐，深呼气再吸气，心静下来、安稳下来以后，开始深深的思考一个问题。一开始肯定是由意识思考，渐渐专注在问题上以后，意识只管看着问题心不动，改由意根深深的思量参究，意根虽然动也动得极慢极慢，最后好像也不动的样子，问题就悬在空茫茫的大脑中，或者是胜义根，或者叫作黑匣子。</p><p>随着意识的关注和意根的思，没有语言文字的信息就会闪现出来，意根知意识也懂，但不一定很清晰明了；如果定力足够不减弱，信息随后就会越来越多，越来越清晰，心中越来越明了是什么信息，问题的答案逐渐呈现了出来，心里就轻松敞亮了。出定以后，需要意识再从头到尾把大脑里出现的信息过滤一遍，回忆一遍，检查一遍，最后再确定，意根也随之确定，结果就确定下来了。</p><p>整个过程都需要很深很专注的禅定，在深思的过程中，有可能定力越来越好，以至于心入到定中，轻松愉悦舒适，只是不一定有意根的思量。出定以后，或者定力减弱以后，再接着思量参究，最终结果也会出现。</p><p>二十二、定慧互生的三昧境界</p><p>这种境界是由粗浅的禅定引生智慧，由智慧引生深定，由深定引生深智，进入三昧，从而开启大智慧境界。</p><p>上座以后盘腿，深呼吸数次，气沉丹田，心沉静下来以后，头脑放空，观空空的头脑里空空如也。心进一步沉静下来之后，生起疑情，这个疑情就是自己现在需要解决的疑问，如：色蕴为什么是空的，胜义根为什么是空的，六尘为什么是虚妄的，六识为什么是虚幻的等等。每次只能带出一个简单的疑问，定慧不足时不可贪多贪深，否则定力退失，智慧也无。</p><p>就这样带着疑情，先不急于参究，意识不要动，不要思惟，只盯着疑问就可。这样盯着盯着，定力越来越深，越来越深，到一定时候自然而然就会产生心动，想明了这个问题，这是意根的蓄势而动。如果有明显的动就是意识的动，一定要制止，不要意识的浅思惟，于事无益。意根心动，非常隐秘，难于观察，深而又深，但是能解决实际问题，开启甚深智慧。</p><p>意根动念没有语言，没有文字，没有声音，静悄悄神秘秘。慢慢的好像有一点明火想要出现，隐隐而发，大脑屏幕将要出现光明，问题的答案将要呼之欲出，然后模模糊糊、朦朦胧胧的出现一点，再出现一点，以至于越来越多的答案呼之欲出，但还不够明确，还是朦朦胧胧，但是已经有了光明，有了信心。</p><p>再继续深定细细的隐秘的参究，思路越来越清晰，心里越来越亮堂，越来越清明，越来越明了，大脑清晰透明，内心喜悦，进入三昧之中。直到最后答案出尽，心里明确，没有疑问了，从三昧中出定，交给意识思惟整理整个过程，把内容理顺，严谨逻辑，意根再确认，此事结束，定慧圆融无碍。</p><p>以此三昧力，究尽一切疑难和问难，破除一切无明，成佛有期，何况成菩萨，成阿罗汉。只怕众生福不具，福越不足，越难生福，越难生定，越难生慧，这是恶性循环，如何突破，个人思惟。</p><p>二十三、现量与非量</p><p>闭目打坐，一段时间后，攀缘渐少，会出现种种画面，非意识心想出的，用意识心想看清时，画面消失。再静坐又出现种种画面。</p><p>静坐时，有些画面是意识想出来的，有些画面不是意识心想出来的，是从脑子里直接出来的，也就是从意根那里出来的，是现量境界，最真实，可用，开智慧。用意识心去观察时，定力已经减去了淡化了，境界就会消失。意识有干扰作用，干扰的是意根的智慧的生起。</p><p>而从意识心那里想出来的，是情思意解的结果，有时也是胡思乱想出来的，没有多大用处，多数是非量境界。要证明的东西，要亲证的东西，必须是从脑子里直接出来的，意识后知后觉，然后恍然大悟，真正的悟，就是此种情形。如果没有定力，就不要妄想有这种根本的悟和最直接的悟。</p><p>二十四、问：凌晨时分还未起床，处于一种懵懵懂懂、似睡非睡，似醒未醒的状态中，意根在深深地思量，意识作用非常微弱，这不算是在做梦，是在定中吧？</p><p>答：似醒非醒的状态，意根可以有深深的思量，祂可以一夜都在参究思量，早上即将醒过来时，意识出现，发现了意根在思量。似醒非醒时，意识弱，意根当然是处于没有六识干扰的定中。半夜意根思量参究时，没有六识的干扰，也可以说处于定中。甚至有可能早晨一醒过来，意识就知道了意根所惦记和思量的结果。在晚上入睡前，设定一个需要思考的问题，意根如果很关注，这一夜，意根就会一直思考思量，一直到醒过来。意识灭去，意根照样工作，却不觉得累，这样就能节省许多修行时间，又直接效率又快，不用意识再去熏习意根，少走一个弯路，所以唯识法最究竟。</p><p>二十五、意根的格局</p><p>如果能充分有效的利用意根思量，养成了习惯，很多高精尖上的事情就能迎刃而解。我们修行人应该学会习惯用意根，佛法修证上所有一切问题就不是太难的事。一切大成就者，都会使用意根，但即使用也不知道自己在用，是不自觉的用，因为不会总结归纳，也没有意根和意识的概念。</p><p>经常用意根的人多好，深沉、细密、果断、决绝、老练、浑厚、单纯、纯洁、大智若愚、指挥若定、临境不乱、气定神闲、高瞻远瞩。而只能用到意识的人，肤浅、浮躁、心浮气躁。意识心在表面，就气躁，也是气浮，没有定，心和气都定不住。小女人小男人，凡是小，都是停留在意识那里，深入不下去，用不到意根，所以眼界和格局都小。</p><p>意识的格局远远小于意根，因为意识所缘的法少，而且还停留表面，意根所缘的法极多极广极深，十世古今、从生到死、从内到外，遍计所缘，默容一切法，而且还能作主决策，是意识的主人，见多识广。所以如果说眼界论格局，还是在意根，不修到意根，怎么能有大智慧呢？</p><p>二十六、真智慧是意根的智慧</p><p>由脱口而出，能观察到意根的运作，意根的功能作用也就是意根的心所法。意根都有什么心所法，有什么心理作用导致脱口而出？</p><p>如果有人提出问题以后，张口就回答，不用思考，说明自己对问题很了解很熟悉，以前经常接触，不用现考虑琢磨思惟。这个自己就是意根，反应快的人，意根对此事情有经验智慧，无需意识帮助分析。反之，意根不熟悉，或者没有经历过，遇到事情，就需要意识帮助思惟分析，意根据此作出自己的决定，这个过程就慢了，不能马上回答和解决，中间有意识思惟的过程。再得出结论，说明意根是没有智慧的，从前不知不懂。</p><p>所以说禅宗祖师说：“思而得，虑而得”，是鬼家活计。真智慧一定是意根的智慧，不用现学，不用现买现卖。假智慧，是通过意识的现琢磨分析得来的，靠意识打探消息得来，也就称不上智慧了。所以古时禅师们见学人用意识的思惟和琢磨，用意识法语言境，就会一棒子打过来，就是不让你用意识，就是让你离意识而参究思量。</p><p>二十七、鬼家活计与心地通达的悟</p><p>禅宗祖师曾经说过：“思而得，虑而得”，乃鬼家活计。鬼为阴，不光明，有暗暗偷窥的意思，不是正大光明的得，这里的鬼喻为意识心。意识心喜欢的是推理、猜测、猜分、偷窥、情思意解，而不是心地光明的证，不是从里到外的开通。</p><p>所以禅师说，真正的悟，不是用意识心的那种思就能得到的，也不是用意识那种分析思惟就能得到的，意识的思惟活动得不到真正的悟，不是正大光明的悟。禅师告诉我们参禅不要在意识上用心，而应该再深入下去，割断情思，割断猜解，进入禅定中，深深的参究，带着疑情，踏踏实实的用功办道，最后才能光明正大的证得，才能入道。这就是通向大道的天梯，摘取宝藏的云梯。</p><p>二十八、意识思惟的细致意根才能受熏</p><p>一个人如果知道自己错了，何去何从，怎样对待错误在于什么？意识知道错了以后，还要让意根知道错，意根一旦知道错，那就好办了。意识要把自己的错误原原本本一五一十的说出来传递给意根，意根就会起心思量对错。</p><p>意识简单粗略的知了以后，还要思惟观行，要了知的细一些，在这个过程中，意根就能起自己的思量，容易受熏。意识要思惟了知的细密一些，证据更确凿一些，在禅定中才能思惟细密透彻。意根要思量得清楚明白，必须在禅定中，不受干扰。</p><p>意识知道要用祂自己来熏染意根，意根这个时候不一定知道意识想要熏祂和正在熏祂。一是在于意根是否有智慧能理解意识的心思和想法，二是在于意识在心里能否深深的理解法义内容，能否思惟得很清楚，三是在于意根在平时是否很了解意识，二者沟通协调能力是否很好。</p><p>意根发现意识想要熏染改变自己时，如果意根的我执习气很重，意识的想法严重违拗意根，意根就不高兴，心里很难受，甚至想躲避和反抗。如果意识的想法不太违拗意根，意根可以接受，意根得到降伏以后，越明理越容易接受熏染和说服教育。</p><p>二十九、意根念兹在兹就是最好的参禅</p><p>问：有时东西长时间不用，就忘记放哪里了，刻意去找总找不着，无奈之下只好先放弃寻找，但内心很牵挂，因为东西很重要，过几天突然想起来放哪了，东西找到了，这个是否也是意根的功劳呢？</p><p>答：是意根的功劳，意识没有办法一直惦记着一件事，意根关注的事会时不时惦记，而且通常意识不知道意根在惦记。找东西，解答问题也是这样，做梦梦到好多年前上学的事和好多年前的老朋友其实都是意根的功劳，意根惦记问题是不受时间限制的。</p><p>意根念兹在兹，这就是参禅原理，用功方法。这是天梯，不是天机，是渔，不是鱼。如何能让意根念兹在兹是个非常重要的问题，但一般人的意根都是对世俗的事惦记的多。很多人都喜欢讲第八识的功德，其实都是意识的想像和推理，意根天南地北的惦记，就是不惦记思考第八识的事。意根惦记世俗的事，已经很久劫了，一下子就转过来是不可能的，除非是再来人。</p><p>三十、意根与禅定和证悟的关系</p><p>意根的思量要比意识的思惟深细和究竟，所以只有意根也同时思量和参究法理，才可能证悟。而要想让意根参与法义的参究，必须有比较深的禅定，法义才能深入到意根那里，才能引发意根专心思量考究，如果没有禅定意根就不能专心，对参究就使不上力。如果没有禅定也要强行观行，那就叫作猜测和情思意解，这样的结果是什么，大家都已经知道了。所以禅定与证悟的关系，意根与证悟的关系，大家一定要搞明白弄清楚，才能着手用功参禅。</p></div>"
},{
    "title": "第五章 意根与意识的关系",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  意根与意识的关系</strong></p><p>一、意识与意根的修行关系</p><p>譬如一个人要上台演讲，在台下准备十天半个月，每天不断的练习预演，就是为了台上一个小时半个小时的顺利演讲，把平时自己精心准备的内容不折不扣的宣讲出去，以影响和打动大众。在台下的准备相当于意识的修行，在台上的正式演讲相当于意根的修行，所以修行意根远比修行意识重要得多，意根的修行关系到成败，是修行成就与否的标志。</p><p>因为即使台下练习再好，台上发挥失利，也没有人捧场，观众们不会在意台下如何用功，只在意台上的表演。同理，意识不管如何用功，如果没有深入到意根，就没有结果，预期目标没有达到，因果就不领情，就改变不了什么。但是没有意识修行的基础，不可能熏染意根，就谈不到意根修行了。</p><p>二、意根离开意识，功能作用是否能减少</p><p>我们应该知道意根有极多的功能作用，在六尘的功能作用上，如果离开了五阴身和六识，意根纵使有千般意愿万条妙计，也难以展现难以发挥，没有执行者没有实施者故，没有从属没有手脚故。所以从这点上来看，意根就是无记识，其善恶心行都无法实现，善行恶行都无法造作，身口意善恶种子不能存储，善恶果报就不能实现。所以无始劫以前，没有器世间和五阴身以前，意根纵使有无数无明烦恼，却没有无明烦恼业行，与如来藏一起处于杳杳冥冥中。所以意根离开意识，其功能作用还是有那么多，只是无法展现，无法运作。</p><p>三、意根若离意识的别境慧是否无所作为</p><p>如果意根离开意识的别境慧，就无所作为了，这个意思是说没有意识的慧心所的了别，意根就会什么也做不了，无所事事。这就意味着意根不能离开意识，离开意识色身五阴都不能运转了，一切法也不会出现了。这个问题其实不攻自破，意识没有别境慧处于灭亡不了别的状态，总共有五种情况：死亡时、昏迷时、睡着无梦时、入无想定时、入灭尽定时，而无论哪种情况，意根都会单独有自己的功能作用，意根从来没有停止运行过，除非在无余涅槃里。意根一旦无所作为的时候，就不会再持身了，色身五阴的功能就会消失，这个人就会死亡了。</p><p>没有意识的情况比如睡着无梦和有梦的时候，这时候的意根在干什么？是否是无所事事，不触尘境，不了别境界？显然不是。意根属于众生的命根，这个命根也特别的在意和执著色身以及与自己有关的一切法，没有意识的时候，意根仍然要执持和维护色身，了别色身的状况，了别周遭的一切法，思量一些与己有关和无关的法，思量一些重要和不重要的法，思量一些有意义和无意义的法，攀缘不止，五遍行心所法以及其它心所法都会照常活动，心理活动并不停止。</p><p>在一切时中如来藏都会出生和变现一切法，意根有默容一切法的特性，祂一定会依靠着如来藏去触如来藏二次幻化出来的法，把如来藏所见的法，当作是自己所见的，并且把这些法当作是自己所有的，而生起种种心行和想法，以至于让梦境出现。梦里的一切思想观念都是意根的，一切心行也都是意根的，意识只起辅助意根的作用，所以一个人真正的修为如何，从梦中的表现就能看得出来，从意识不清醒醉酒的表现也能看得出来。</p><p>昏迷的时候没有意识，意根却不甘心这样昏迷下去，发现身体稍微好一些的时候，就会挣扎着想醒过来。这说明意根在昏迷没有意识的时候，有思想活动，心所法都在运行着，时刻关注着身根的情况，能了别身根的状况，知道昏迷不好，也想办法醒过来。有的人在昏迷时神识还会去找亲近的人解救自己，传递信息，告诉亲近的人自己在哪里，是什么情况。所以意根可以代表着一个独立的人，有各种心行心所法，内心活动很多，只是操作的时候，需要意识和五识配合去完成罢了。总结起来说，意根在很多时候都不必依靠意识而有自己的各种功能作用，只是在具体了别六尘境界处理问题的时候，才需要意识。</p><p>四、没有意识的时候意根是否能单独的了别和思量</p><p>意根有恒审思量的特性，恒代表常常、总是、永远、不间断，审就是审查、审虑，思量就是思虑、度量、衡量、思索。意根有这个性质，就表明意根是一个决策者，是一个作主者，对于一切法都说了算。那么意根的这个功能是如何起用的呢？是意根通过五遍行心所法以及五别境心所法以及善恶心所法来起用的。</p><p>意根既然是一个作主的识，对一切法都说了算，祂必须有相当的判断力，才能作主作抉择。而意根如何判断、依靠什么来判断和抉择呢？意根要依靠自己的思量性来判断和抉择。如果意根自己单独不能思量，那就没有办法作出自己的判断，没办法抉择什么，就没办法做主宰，也就不是一个作主识了。意根自己单独的思量，有时候也依赖六识传递过来的信息，依靠意识的思惟分析逻辑推理等等，但无论怎么样，意根得到了六识的信息，也要自己亲自思量审查，作出判断。</p><p>有时候意根在白天得到了大量的信息，来不及思虑，来不及思量，就会在晚上没有六识的打扰，自己把那些信息不断的过滤，不断的思量，有时就会出现梦境，让意识在梦境里帮忙。如果晚上意根把事情考虑明白了，得出了结论，第二天早上一睁开眼，意识就明白了，有可能也会回忆出梦境里的情况。</p><p>据说元素周期表就是在梦中解开的，很多科学难题都是梦中解决的。很多时候有些事情意识想不明白，就不考虑了，却不知道什么时候，自己就突然间明白了，这就是意根思量的结果，没有动用意识自己单独解决的。有些科学家因为热爱科研事业，废寝忘食的日夜探索，即使睡着了，半夜也会醒过来继续思索，或者弄出梦境来思索，都是意根在思索思量参究，不分白天黑夜，念兹在兹。这就是意根在用功，是意根的精进。</p><p>如果意根的心所法不完备不具足，根本不能做出这么多的事情，搞出那么多的发明创造，参究出那么多深奥的问题。心所法不具足，是无能为力的。</p><p>五、昏迷欲醒的状态证明意根是作主识</p><p>有个脑受伤的病人由于脑干出血，深度昏迷不醒，身体完全不能动，没有意识。经过治疗止血之后，神经开始跳动，人却没有醒，还是昏迷；再之后身体有触觉，喂食流食，舌能吞咽，却还是没有醒，有微弱的意识，却不能思考分析。那么在昏迷的前期和后期，没有意识的佐助，意根都起什么作用维持了色身的微弱功能作用？</p><p>不少人都说，意根像个傻子一样，什么都不是，可事实上，恰恰是这个傻子用自己独特的功能作用维持着生命体的存在。没有意识的时候，色身意根第八识组成的生命体，仍然是众生我，所以这个我，主要指意根还是意识？哪个更重要？谁也不能说：六识没有了只剩下意根，那就没有我了，意根不是我。那么六识意识灭掉以后，剩下的是否可以忽略不计？不算作一个人头？</p><p>在昏迷时，意识不会想我应该动动眼珠、扯扯嘴角、神经抖动抖动。这时即使有意识也是非常微弱的，没有什么思惟功能，也了别不了境界，都是意根强大的功能作用，想要色身有所觉知，试图有所活动，吞咽口水和流食。那么意根都有什么心所法，也就不难辨别了，不要再说意根什么都不是，什么功能都没有，什么心思都没有，什么念头想法都没有。如果意根没有什么想法，昏迷的人还能清醒过来吗？还能努力挣扎着让色身活动起来吗？</p><p>一个人有顽强的生命力，能适应一切生活环境，能享受五阴世间，不仅要感谢如来藏，还要感谢意根的坚强不屈的执著或者是毅力。这一切主要是意识享受，所以应该是意识来感谢如来藏和意根，让自己有见闻觉知性，能享用五阴世间。</p><p>反过来，意根也要感谢意识，有意识这些助手为自己做事，为自己了别六尘境，从而自己就拥有了世间一切法。所以昏迷时意根着急，千方百计的让意识醒过来，有个健全的五阴活动。这就证明了一切法都为意根所用，意根把一切法都当作我和我所有的。还有人说意根离开意识就无所作为，可是没有意识的时候，意根都做了些什么？没有转识成智，谁也观察不出来。</p><p>六、行蕴当中真实作主的还是意根</p><p>我们每天都是如何从东到西从南到北，如何把色身切换到任意一个处所的？这都是受意根的作意所驱使，受意根的思想观念和目的所驱使。而意根的想法，也受意识的想法、思想、观念所影响和带动。那么有些人就说，明明是我意识想干什么就干什么，怎么是意根作主决定的呢？表面上看来，好像意识想干什么就干什么了，可是实际上意识的想法要经过意根的同意和接纳，然后再由意根作主抉择，之后就体现出了意识的想法和目的。</p><p>比如开车，每一刹那都是由意根决定如何开，开向哪里，其中意根也是刹那刹那受意识的思惟分析打算判断所指引的，意识指引之后，如果不符合意根的想法，意根可能不会听从意识的指引，只有意根觉得意识的想法合理时，才会接受意识的指引。</p><p>在这个过程中，意识的心行比较明显，意根的心行比较隐秘，因而智慧不足的人观察不到意根的心行，只能粗略的观察一下意识的心行。那么智慧不足时的认知观点和看法都不足以为凭，那就不要认为自己的观点绝对正确。</p><p>七、意根为什么要思念和想念</p><p>意根是因为什么有思念想念呢？还不是因为意根记忆了一些事情，比较惦记的才会去想念，比较重要想要进一步解决的，才会去思念。一切法靠意根的念而出生，意根念第八识才能配合，才能出生意根所念的法。意根不念，第八识就不管，六识就不出生，那就不能解决什么问题。意识所念所想所思惟的法，所了别的法，都是由于意根的念而引生出来的，没有意根的念，意识就不能出生，何况还有其他心行。</p><p>有些时候，意识出生以后想念某些法，但是这些想念和想法如果没有熏习到意根，意根不念的话，意识所念的法就不成就。比如背佛经，意识念得很熟，可是意根不入心，意识就背不下来，能背下来就是回忆，意根没有记住，意识就不能回忆。意识的回忆，是由意根来引导的，意根无法引导佛经内容，意识就不能背诵。如果意根对念经不感兴趣，意识念一会儿就念不下去，心长草了。意根比五识要灵活机动，比意识也灵活机动很多，祂是现起万法的动力。所以祂的功能作用一定要远远超过于五识，超过于意识，才能办得到。</p><p>八、意识说服力强大时就能扭转意根</p><p>意识的正见起作用的时候，是意识有强大的说服力，降伏了意根所致，也是意根正见不足，需要正见指导决定的。意识与意根，相当于两个人，观察两个人之间的交往关系，就知道意识与意根各自的体性作用了。当意根正需要建议时，给予适当的建议作参考，会很愿意接受。当意根很固执的时候，意识说什么也不愿意听，更不能接受，意识就不会坚执自己的看法。当然扭转意根的固执性，还在于意识不断反复的强调灌输，一开始意根肯定不愿意听，不接受，时间长了就不会太固执了，这时候再给祂进一步的劝导，就能扭转祂。</p><p>九、意根与意识犹如眼睛与眼镜的关系</p><p>意根与意识的关系，犹如眼睛与眼镜的关系。眼睛有些东西看不清楚，就需要带眼镜帮助了别，眼镜帮助了别的内容，眼睛就以为是自己了别的。而有些比较粗糙的容易分辨的东西，眼睛自己就可以了别，不用戴眼镜，不需要眼镜的帮助，相当于意识不用出生。眼睛自己单独了别不用佩戴眼镜辅助的时候还是很多的，意根自己能单独了别的法确实是很多的，这部分内容意识并不知道，不知道却不等于意根没有了别那些法。所以对于一切法，意根有绝对的主动权控制权，一切法都要为意根服务，为意根所用，包括意识。</p><p>如果眼睛有污垢，只清洗眼镜，能保证眼睛清晰的了别东西吗？意根无始劫以来一直有无明，因为无明有种种邪见，只让意识断我见明心见性，只去除意识的无明，能保证万法的假主人心地清净吗？能保证主人智慧性的处理对待一切法吗？</p><p>看不清东西，是治疗眼睛还是修理眼镜？很多人学佛，都只停留在修理眼镜阶段，不肯或者无法再进一步治疗眼睛。清洗完眼镜，还要清洗眼睛，否则照样看不清东西。意识明了，还要让意根明，否则还是愚痴。</p><p>既然意根与意识是如此的关系，那么众生的心行心性主要就指意根的心行心性。意根的无明，意根的明，意根的心所法，是极其重要的。意根的心所法如果没有无明，都是明，就不用再修行，意识对意根也没有熏染作用了，老牛到家，牧童完成任务可以休息了。</p><p>十、智慧广大时才能知道各识都是在互用的</p><p>我一定要好好利用意根，意识说这句话时，意根就已经这样决定了，才让意识如此坚决的表达出来。意识要利用意根，意根知道不知道意识要利用自己？无始劫以来，我们却都一直在利用意根，意根也在利用如来藏和意识，只是互相都不知而已，如果知了，那个智慧就了不得。</p><p>十一、意根受惊吓就会目瞪口呆</p><p>震惊得说不出话是怎么回事？吓得目瞪口呆是怎么回事？气得无语是怎么回事？</p><p>意根受到的震动比较大，过于激动，反应强烈时，就沉浸在境界里，没时间和心情指挥意识说话和表白，觉得语言很乏力，或者是不知道说什么好，意识暂时先歇会儿，意根顾不上祂。意根受到惊吓时，顾不上五根和六识了，眼顾不上看，耳顾不上听，鼻顾不上嗅，舌顾不上尝，身顾不上触，意识顾不上思，口顾不上说，呆呆愣愣的，在消化受到的惊吓，做不出什么反应。</p><p>意识受到惊吓，意根没有受到惊吓时，表现与平常差不多，意根还能继续调控五根六识该做什么就做什么，不会表现得呆呆愣愣的。当意根生气时，心沉浸在事件当中，只顾生气，没有精力和心情调控意识去表达什么。意识生气而意根不生气时，意根调控五根六识该干什么还干什么，不会受到什么影响。</p><p>十二、意根指挥意识的思惟活动</p><p>第八识只要变现出法，意根必依第八识而缘而了别。意根虽然没有问题，大脑有问题，意根就不能通过大脑神经系统正常指挥全身运动，意识也受影响。大脑正常以后，意识的思惟才能正常。后世大脑正常，意根的指挥控制才能正常，意识思惟活动也能正常。</p><p>十三、意根缘内法尘才有意识的产生</p><p>十一种色法，五根、五尘、法处所摄色（色法尘），一定是先于六识出生，否则六识就无法出现。六识出生以后，可以推动独影境的出现，独影境也是意根妄想出现的，让意识了别，并且推动幻化独影境的进一步出生和幻化。根尘相触，后生识心，意识不会在内法尘出现之前出生。意根缘外法尘时，不能出生意识，没有意识出生。</p><p>意根受无明的遮障，了别一切法时，不知其实质，不知其真实相，不能破除无明出生智慧，就使得六识的功能受阻受限。当意识修学佛法时，不断的熏习意根，意根明理之后，就会证知五阴世俗法都是生灭变异不实的，是空的无我的，进一步再证知五阴身和一切法的实质都是如来藏。</p><p>十四、一对器官为什么必须协调一致才能有所造作</p><p>如果两只手要一起动作的时候，必须要协调一致，动作要相同，才能做得出来，否则就困难。两只眼睛、两个耳朵、两个鼻孔、两只脚、两条腿也是这样，必须动作协调一致、目标一致或相似，才能容易完成，否则就不容易完成不一致的动作。这是为什么？两只手的动作，是大脑给出的指令，大脑由意根指挥控制。当意根想用手做某件事时，就会发出指令，两只手就要同时协调去做。如果意根想要用左右手同时做两件不同的事，大脑传导的指令就要分成两部分，意识身识就要分流，神经系统配合起来就要吃力，除非经过一段时间的特殊训练。</p><p>而两只眼睛无论怎样训练，也无法各触各作意各了别，很难分开。两个鼻孔也很难分开，一个呼一个吸，特殊训练过的也许可以。两只耳朵相对来说比较容易分开活动。两只脚两条腿分开各自单独不协调的活动也比较困难。之所以困难，是因为属于一个根，一个神经传导系统，一个大脑指令。难易在于意根的注意力和精力是否充沛够用，也在于六识的精力是否够用。</p><p>把意根与意识的功能作用分开，能更好更清晰的了解意根和意识的各自性能，混在一起，哪个识的性能也了解不清楚。意根与意识的功能作用分开以后，单独观察意根，就能知道意根都有哪些特性，有哪些烦恼，有哪些习气，有哪些心所法，不用再去咀嚼别人的话头，自己就有能力观察出真实情况。</p><p>十五、意识能影响意根的决定</p><p>清净四大有生成义，能生成物质色法，物质色法是被如来藏生成的，依众生的业缘而生起，生灭变异。具体还是三能变识和合运作的结果，不完全由如来藏当中的业种决定，也有后天因素，后天因素就离不开意根和意识。比如说如果意识活在世间，处处不如意，就会感到世间百般无聊，意根了知以后就可能有不想活的想法，于是有可能想办法自杀。意识如果不在意色身，意根就会决定不给自己加强营养，于是色身就会羸弱。意根和意识的意念可以指挥一切，改变一切，我们的意念力强，也可以改变外界的事物。</p><p>十六、如何正确合理的引导意根</p><p>意识学习五阴世间的苦空无常无我法，思惟时就会熏染引导意根，不要再攀缘这些生灭无常法。学习各种法义时，都要思惟熏染意根，一旦意根懂得法理，就会越来越减少攀缘和执著。意识经常作正确如理如法的思惟观行，就是引导意根的有效途径。</p><p>十七、明心开悟需要具备的条件</p><p>明心首先的一点是，六七识应该处于正常状态，比较安详，内心平和，具足定力，有甚深的思惟观行的智慧，五阴身的问题比较了解熟悉，断我见之后或者是接近于断我见，才能有机会明心。</p><p>极大多数人在正常状态下，都无法有清晰的思路，不能断我见，也不能明心，那么在极不正常的状态下，更不可能有清晰的思路，不能断我见明心。比如在昏死状态，睡着无梦和有梦状态，中阴身状态，死亡后中阴身未生起状态，极度气愤状态，极度虚弱状态，艰难困苦状态，迷迷糊糊状态，发疯状态，精神错乱状态等等，意识不能有正常思惟，如何能悟？</p><p>昏死过去的时候，为什么不能明心开悟？因为没有意识，没有思惟，意根恐慌，不能参究就不能开悟。睡着无梦的时候，为什么不能明心开悟？因为没有意识，不能引领意根参禅，因此不能开悟。如果意根被熏非常成熟，睡着以后，能单独参究，也许能参究出来，但必须等到醒过来以后，警醒意识，意识也明了了，才是开悟。睡着做梦的时候有意识，为什么不能明心开悟？因为意识不能清晰思惟，不能引领意根参究，因此不能开悟。除非意根被熏成熟，梦里也能参究，但是这样的特例太稀少，不是普遍性。</p><p>死亡以后，中阴身没有出生之前，为什么不能明心开悟？因为没有意识思惟和引领，意根又恐慌，不能参究，就不能开悟。在中阴身里，为什么不能明心开悟？因为一般的业障凡夫，在中阴身里极度恐慌，不知未来，没有平静的心情参究，没有禅定，也无法一心参究，因此不能开悟。在中般涅槃里能不能开悟？中般涅槃，那是三果人证得的涅槃，三果人有初禅以上的禅定，一般来说有四禅以上的禅定，才能证得中般涅槃。如果没有发成佛之心的三果人是不能参禅的，如果能在入中般涅槃之前就参禅，明心开悟了。在无余涅槃里，能不能明心开悟？无余涅槃里没有六七识，没有参禅者就没有开悟者，因此不能开悟，第八识不能代替六七识开悟。</p><p>极大多数众生家里出一件小事，心里都不平静了，不能正常学佛修行，何况还能思惟佛法参禅？更何况在中阴身里，在中阴身没有出生之前，在梦里梦外？出一点小事，打字手都哆嗦，还能明心？有人来骂，马上不忍回骂过去，还能明心？平时造恶业多，烦恼重的人，全部是没有禅定的人，心不清净，容易激动，在特殊时期更缺少禅定，不能思惟佛法，何况参禅？因此在特殊时期都不能明心开悟。</p><p>如果有四禅定在中阴身里能明心吗？在人身上有四禅定，出定时可以明心，因为这个人平时不在四禅定中，定力也相当好。在中阴身里，定力也相当好，中阴身不会影响到他，因此可以开悟。四禅八定的好处是，能让人时时刻刻心有定力，处理一切人事，平平静静，周周全全，四平八稳，思惟清晰。</p><p>十八、定深时意识推理意根可以思量</p><p>能推理推论的心是意识，在推理推论的时候，浮在上面表面的推理思惟是意识，可是同时意根也在背后深深的思量着，两个识都在同时运作着，离开意根，意识也就不能推理了。定力好一些的时候，意根比较有力度，有比较专心的思量活动，这样才能推导出正确合理的结论，意根也会非常坚定的认可这个结论。</p><p>十九、意识为什么能处于一念不生的定中？</p><p>有人说回忆完全是意识的功能作用，没有意根什么事。意识确实能回忆，可是意识是因缘所生法，有因有缘，意识才会出生，因缘不具足，意识就不能出生。是什么因缘促使意识出生并且回忆呢？意识为什么能回忆呢？当然是意根想起从前的事，独影境出现，根尘相触，意根欲有所为，第八识随顺意根的心行，意识才会出生并且去回忆，否则意识就不能出生。所以意识能否回忆，在于意根是否缘过去的事，是否想弄明白一些事。如果意根不念过去的事，没有什么心行，意识就不会出生，更不会去回忆，去思惟，也不会出现各种情绪。</p><p>如果意根没有什么心行，不想造作什么法，意识就可以处于一念不生的状态；如果意根有心行，想要造作什么法，意识必然会随顺意根的心思造作，不可能处于一念不生的状态。所以意识一念不生的定，完全由意根决定，受意根操控，意根攀缘其它法，意识就没办法定下来。</p><p>在意识一念不生之时，意根也同样可以一念不生，或者生念也不至于影响意识，没有想要造作什么的想法，意识也仍然可以一念不生。</p><p>二十、意识运行的背后秘密和主因</p><p>意识既然是因缘所生法，就没有自主性，不会由自己作主处于一念不生状态，也不会由自己作主去生心动念，祂所有的活动都由意根作主和支配。意法因缘生意识，根尘相触生意识，但是即使意根与法尘相触，如果意根不作任何抉择，意识还是不会出生，更不会有所造作。</p><p>所以说离开作主识离开意识的根，而谈意识如何如何，都是妄谈，不究竟，也不靠谱，甚至会出现许多错误而不自知。出现问题的关键，就是因为定力不足，没有现量观行，无法深透观察出意根与意识的关系，无法深刻的观察出意识运行的背后秘密和主因，忘记了意识的不自主性，而把意识背后的主宰者忽略掉了。所以任何人传法谈法都不要太自信了，盲目自信就是自大。</p><p>二十一、意根是六识的染净依</p><p>六识没有自性，自己不能决定自己什么，不能做自己的主宰，因为六识是被出生的法，所以无体、不自在，其表面的功能作用都是如来藏赋予的，都来自于如来藏。一切法如果有自性，也都来自于如来藏，客观上说也都是如来藏的自性。</p><p>六识染污的源头在意根，来自于意根，意根染污六识必然染污，意根清净六识必然清净，意根是六识的染净依。一切法的出生现起一定是有七八二识的伴随，是七八二识运作的结果。</p><p>二十二、意根是连接如来藏与意识的中转站</p><p>意根是连接如来藏与意识的中转站，从如来藏那里拿东西给意识受用和了别。意根不仅是中转站，本身也能记忆自身所经历的无量劫的事情，这些事情同时也作为种子存在如来藏里，意根与种子总是相应的，协调一致的。当需要某件事时，意根就促使意识回忆，意根再把事情丢给意识，意识就回忆出来了，并且还能着手处理。</p><p>二十三、意根能否为意识提供妄想种子</p><p>意识的妄想确实是由意根引发出来的，是由意根提供的妄想内容和方向，是受意根调控的，体现了意根的愿望和心意。但是这个种子以及所有的种子，还是由如来藏提供的，只有如来藏里能够蕴藏用来妄想的识种子和法种子，意根里不能储藏任何种子，因为意根不是实体，又生灭变异，不能自在和自主。如果意根能提供种子，就有两个能藏心体，那就乱套了。事实上是意根有了妄想的打算和决定，如来藏了知就会配合输出妄想所需要的种子，包括意识的识种子，于是意识才能够妄想。意根只要先行妄想攀缘就可以了，就会促成妄想的出现，祂是妄想的动力和源泉。最终的源泉还是如来藏，一切法最终还是由如来藏中流出。</p><p>二十四、意识明理才能控制意根习气</p><p>问：有时候知道自己的心行不好也不如法，可是控制不住，表现出了不好的心行。过后虽然愧疚，下次有同样的事情发生时还是控制不住自己，这怎么办好呢？</p><p>答：这是意识知道自己（意根）的心行不好，但是意识的说服力弱，说服不了意根，也就控制不住意根的习气，还是按照意根的心行行事了。要想调控意根，就需要意识多明理，反反复复的说服劝导意根，那么意根的习气力量就会逐渐减弱。</p><p>要发现自己（意根）的不良习气，意识就要有觉悟，要清楚了知，要知道如何不对，如何才是对的。这样即使控制不住意根的习气，也有很大作用，以后遇到同样情况，心里就会犹豫不决了，意识违背意根的次数多了，意根也就不会再执意错误的心行，这样就成功的熏习扭转了意根的不好习气。</p><p>二十五、意根什么时候才不做幕后的隐者</p><p>当意识没有觉知的时候，意根是否有觉知呢？意根有觉知的时候，我们意识知道吗？没有意识的时候，谁来观察意根？即使有意识的时候，极大多数众生根本观察不到意根，那么意根的功能作用就会被埋没和错解。当意根反观自己的时候，意识也观察不出来，意根也表达不出来，那么我们就没法清楚如理如实的了解意根的功能作用，意根就不得不做幕后的隐者和作主者、指挥者、决策者。</p><p>意根什么时候才不做幕后的隐者、作主者、指挥者和决策者而走到前台来呢？前台后台根据什么而说？根据意识的智慧程度而说。意根要走到前台，条件是意识必须有很强大的智慧和观察力，意识要有强大的智慧和观察力，必须明心之后具足初禅以上的禅定力，这时果位是在入初地前后，一般来说是初地以后，烦恼断除，意识和意根都转识成智了。这时候并不是意根走到前台，而是意识终于具足智慧，观察到了意根，意根的功能作用再也不被埋没了。</p><p>二十六、为什么有一些人总把意根当傻子？</p><p>极大多数人的意识因为没有智慧，没有妙观察智，观察不了意根，也就不了解意根，才把意根当傻子。转识成智以后具有妙观察智的意识才能现量观察意根的运行，从而挖掘出意根的深细的体性功能作用和心所法。而转识成智需要具有初禅定，断除了烦恼，成为初地以上的菩萨，具有唯识种智，意识没有了遮障，才能清楚的观察意根的运转，这同时意根也转识成智了，具有大智慧，心所法与地前菩萨都有差别。</p><p>二十七、意识观察不到意根的心所法不代表意根没有</p><p>意识与意根是观察和被观察的关系，但是意识观察不到意根的心所法，并不说明意根的心所法不存在，因为意识愚痴无明缘故。就如意识观察不到第八识，并不证明第八识不存在。睡眠里意根到底有什么心行，一般人确实观察不到。那不证明意根就没有什么心行，佛就能了知意根在任何时候的任何心行。</p><p>意根极多的心行，一般人的意识都观察不到，但那并不说明，意根没有那么多的心行。修行就应该好好运用一下逻辑思惟，只有好好提高逻辑思惟能力，再加定中对法的思量，才能有效的提高智慧，不断破除无明，观察更多更深的法，证得更多更深的理。</p><p>佛地的八识心王，任谁也观察不到，因此不能作为自己辩论的依据。佛地之前的八识心王，地上菩萨能观察少分，因此其他人也不可以拿来作为辩论的依据。只要不是自己亲自观察出来的，都不可以作为辩论的依据。</p><p>二十八、意识在定中思惟才能熏染意根</p><p>意识所缘的法包括独影境的法尘，和与五尘同时显现的法尘。独头意识的回忆妄想幻想等等所缘的都是独影境，对于独影境容易观察判断出是虚幻的影子。而眼睛见色时，意识观察法尘不太容易断定是影子。</p><p>因为一心在观行上，禅定出现了，意根不太执身也不太执法，就有了身体上的轻安舒适等等禅定境界。只要心比较专注有禅定，意识所思惟观察的法义，就容易被意根接纳，意根一接纳下来，就有境界上的变化，各种禅定境界就会出现。</p><p>每天都这样观行，对于意识和意根都是一种智慧的提升，当然禅定也会得到增强。一开始观行的时候，非量比量成分多一些，到最后现量的成分就会越来越多，心里越来越能认可五蕴世间的虚妄不实。观行都有一定的过程，定力增强的同时观行智慧也会增强，智慧增强就会促使禅定增强。对于观行出来的法，意识确认比较容易，意根不容易。意识单独确认的没有一点身心上的变化，意根确认什么程度，就有什么程度的转变。</p><p>意识看一切好像都很虚幻不真实，遇到境界时，为什么会被境界带跑，被境界转了？就是因为意识观行的境界，还没有得到意根的认可，没有深入到意根心里，以至于遇到做抉择的时候，意根的抉择与从前的习性一样，把境界当真。</p><p>刚开始观行的时候，观行的深度、广度都不够，范围比较狭窄，各个法不能连贯起来，就不能有效的熏染带动意根。如果意根所缘比较少，心里的无明不是很深重，无始劫以来没有累积无量的生死业障，那么意根就能像意识那样有智慧，即使证据不足，也能判定出一个如理的结论，从而证得真理。可是意根不是这样，所以才让我们修行实证那样的困难。</p><p>二十九、意识的知熏染了意根才有用</p><p>不少人心生烦恼时，对自他影响都不好，意识知道不该如此，可是一点办法都没有。意识控制不了意根，只能任由意根烦恼现行，听意根摆布。意识知道不应该，可是知道的不细致，意根不知道，想不烦恼就做不到。意识要想不造作烦恼业，应该仔细思惟烦恼的后果熏染意根，意根明理以后，意识就能控制得了意根，就做得到不烦恼了。</p><p>意根带着无明烦恼去后世，不是意识去后世，所以意识所学所知所解，无论如何都要落实到意根那里，否则意识一灭，意根因为无知无识因为烦恼而投胎，就没有好果报了。二鸟在林，不如一鸟在手。意识所知所解所学，如果不送到库房里，意识一灭，后世就没有可用的种子，那岂不可惜？</p><p>三十、头脑和牙齿各代表什么？</p><p>俗语说：应该磨砺你的头脑，不要磨砺你的牙齿。这句话的深刻含义是什么？头脑和牙齿各代表什么？二者之间是什么关系？</p><p>世人说话时，语言的产生，必须通过启动牙齿，才能产生出来，语言是意识心的功能，浮浅轻浮，不一定有智慧。而头脑大脑是思考出生智慧所依之根，代表一个人真正的智慧和见地，意根处在大脑之中指挥六识的身语意行，犹如总司令。总司令一动，牙齿等等全军听令，所以应该让意根这个总司令增长智慧，磨砺意根头脑，不要把精力用在牙齿这个工兵身上，用嘴皮子对付是没有力量，不解决问题的。</p><p>磨砺意根为根本，根本磨砺完善了，一切法都会完善起来。只用嘴对付用语言对付，还不能解决根本问题，意根不磨砺出来就不究竟。所以拥有一个智慧的头脑，要比拥有锋利的牙齿丰富的语言花言巧语，强很多很多。毕竟是头脑才代表自己，牙齿语言不代表自己真正的智慧。没有头脑的人，出口就成恶业，而且还不自知，即使受报了也不知为何，没办法对治和救度。</p><p>三十一、意根能否修证自己的善恶心行</p><p>意根如果要修正自己的心行，首先需要能反观到自己的心行，并且能认识到自己心行的不足，然后还要愿意修正。意根如何能反观到自己的心行呢？通过意识对自己心行的观察、分析、思考，得出一个结论，反馈给意根，意根就会思量这些信息，从而正确的认识自己的心行。同时意识思惟说这样的心行必须修正了，否则会造下恶业受恶报，或者道业会受到阻碍，增加许多苦受，意根知道了，就会决定改正自己。离开意识的正确如理的思考分析，意根无法认识自身存在的问题，也就不能改正自己，意识是意根降伏无明烦恼的助手。</p><p>三十二、发生突发事件为什么能快速反应</p><p>发生重大事件和突发事件的时候，下意识非常快速的就作出了反应，就是因为意根先见法，然后传送到胜义根，六识再见，六识一出生就要完成意根的指令，来不及让意识思惟和抉择，就必须行动处理事件。意识处理完之后，还会莫名其妙，不知到底发生了什么。意根反应如此之快，就是因为先见法，先知法。</p><p>三十三、意识的禅定和智慧不足时怎么办？</p><p>意根能作意和触如来藏变起的一切法，祂也能反观自己，但意识没有禅定和智慧的时候，就不知道意根有这些功能作用。意根能知无量劫前和无量劫后的事情，意识没有禅定智慧，仍然不知道意根的这些知，所以才没有神通。意根能上天和入地，意识没有禅定和智慧，仍然不能跟着上天和入地。那就不要否定怀疑意根有那么多的神奇功能作用。</p><p>当你对一些法不知道的时候，不要否定，要这样想：我的意识没有禅定，没有智慧，没有福德，暂时还不能了知这些事情，问题出在意识自己身上，不要去否定贬低自己不了解的人事物理。意识如实了知自己没有禅定、没有智慧这种情况后，就要想办法改变这种情况，如果不能如实了知，就不能想办法。想出办法以后，就不要总暗示意根自己这不行，那也不行，而是要暗示意根我一定能弥补，一定能纠正，一定能行，一定能成佛。这是善熏如理如法的熏意根。</p><p>三十四、什么是下意识反应</p><p>下意识反应非常快就完成了，并没有意识的思惟分析的机会，意识五识立刻服从意根指令。因为很多人都不知不懂意根，就把意根这种作用叫作潜意识或者是下意识反应。意根习气太重的时候，遇见自己喜欢的东西，就会有类似条件反射的现象出现，根本不给意识说理调教调控的机会，完全按照习气应变。</p><p>任何身口意行都有意识，没有意识，意根自己单独不能有身口意行，否则人昏迷就昏迷，意根不会挣扎着要醒过来。意识和身识五识是平行并列的关系，同时出生共同完成身语意行，谁也无法指挥谁，都受意根指挥。</p><p>三十五、脱口而出是哪个识的功能作用？</p><p>遇到非常熟悉的问题，就不用思考脱口而出，这显示的是哪个识的功能作用？是六识的还是七识的？是第七识意根的功能作用，意根对于这个问题太熟悉了，以至于根本不用意识现思考，就促使意识脱口而出表达了出来。祂触尘的时候，马上就知道了尘境，作出决断，有了反应，不容意识再思惟，不用意识再考虑，就独断专行作出了决定，六识立时服从。过后有可能要后悔，这是意识分析思惟以后，觉得刚才做得不对，太莽撞了，于是后悔。</p><p>三十六、意识与意根是否互缘</p><p>根尘相触生意识，根尘识三者再和合触，意识就了别法尘境，意根依之作总抉择。意识与意根互触，必然要互缘互知其心，互相配合，法才能不断运行下去，才有身口意行的造作。如果意识与意根不互缘，则意识无法运行，意识出生就没有用，以后意根再也不会抉择让意识出生了。意识出生的目的，就是配合意根服从意根需要的，意识当然一生出来就知道意根让祂干什么，于是就会自动自觉的按照意根的心意去做。当然中间免不了提些意见和建议，有时候还有自己的主张，与意根的心意不一致，内心就有矛盾，遇事抉择不下。</p><p>三十七、意根主宰意识生灭的原理</p><p>问：意法为缘，意为增上缘，是助因，意识的种子才是生因，作意心所才决定意识的生起，为什么要说意根主宰意识生灭呢？</p><p>答：根尘相触，是六识出生的必要和必须的条件，意法为缘生意识，意根与法尘相触，这是第八识出生意识的必要和必须的条件，缘代表条件，代表前提。如果没有意根这个根，并且与法尘相触，第八识就不能出生意识，因为没有前提条件，也就是没有理由出生意识。那么这就说明第八识出生意识和五识，必须要有前提条件，有个理由，第八识不会无缘无故出生六识，因为第八识没有我性，不自作主张，不操控什么法，不作主宰，祂是随缘的一种心行，有缘就出生法，无缘就不出生。</p><p>另外不管出生任何法，都是第八识生，因为第八识有种子，用种子生，没有种子的就不能生。意识的识种子是出生意识的一个因或者叫作条件，但是种子没有心没有心所法，因此种子本身不能出生任何法，是第八识用自体中含藏的种子出生法。</p><p>另外作意心所法不是识心，没有主动性，不能决定意识的生起，意识的生起，一个是由意根的思心所决定的，一个是由第八识的思心所决定的，然后第八识就出生了意识。所以意识的出生有两个重要的主宰者，一个是意根，意根不决定，意识就不能出生；一个是第八识，第八识思心所不决定，意识就不能出生。而第八识的思心所的决定，是由意根的思心所决定引起的，意根的思心所如果不决定，第八识的思心所就没有决定。</p><p>三十八、意根是如何被成功熏习的</p><p>意根被意识成功熏习，一定是对接触的境界法或者是意识传递给祂的信息，经过了自己的思量，并且思量通达明白了，才加以信任和确认，信受了以后，思想观念就转变了，就被这个法所转。而意根能够把法思量清楚通透，一定是在减少攀缘的前提下进行的，在干扰比较少的情况下进行的，有一定的专注力，才能有智慧思量通达，法才能入心。所以意根的智慧一定与禅定有关，禅定越深智慧越通透，，而意识思惟不一定需要多少禅定。意根熏习成功不在于意识对意根念叨多少遍，不管意识念叨多少遍，意根不起思量，或者思量不明白，意根还是没有智慧认知，还是不能转变。</p><p>如果意根没有被熏染成功，其思想观念就不能转变，不能破除无明断尽烦恼，就会依然故我。如果意识掌握的理比较强大，也可以降伏意根压伏意根，但是一旦意识不太清醒时，学的理不起作用，就无法调控意根，意根的烦恼就会现行出来。这是众生在断除烦恼之前的时候，在这个时候众生只能守持身口戒不犯，不能守持心意不犯戒，大乘心地戒无法严格守持或者是自动守持不犯，还不能持菩萨的心地戒，因为其心没有转变。这是众生学佛修行的一个过程，这个过程的长短因人而异，依众生的善根福德而定。</p></div>"
},{
    "title": "第六章 意根与意识的区别",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  意根与意识的区别</strong></p><p>一、对于色身的信号意根先知</p><p>人想吃什么说明体内缺什么，这究竟是谁想吃，这么了解身体的需要？身体是最诚实的，语言可能非常虚假。身体为什么是诚实的欺骗不了人？语言为什么可以造假容易骗人？身体上的神经元与意根联系非常密切，身体上任何微小的变化，意根依如来藏都知道，所以身体上的需求信号就会促使意根去解决，意根就会出现各种想法念头。这是身体直接发出来的信号，意识要晚意根一步知道，也可能不知道。而语言是意识的功能作用，意识未必与意根的心理相一致，不一定代表意根的思想想法，二者不一致时，就是造假了。</p><p>二、江山易改本性难移</p><p>江山易改，指意识心的容易受熏性；本性难移，指意根的习性坚固难于改变性。只要意根不改变，什么法也不能改，还是一如既往。本性不改，即使江山改了，还会变回来，还会再生出来。</p><p>五大种子永远不变易，永远恒常存在，包括识大种子见大种子。业种要想改，首先意根要改才行，意根不改，业种就不能改。所以要想消业，只有把意根的无明去除，才能消业。染污业是由意根的无明促成的，没有无明就没有染污业。而要去除意根的无明，必须要意根认识真理和真相，断除我见和证得实相。个别业如果要消除，意根必须忏悔，只有意识忏悔没有用。</p><p>三、好记性不如烂笔头是什么道理？</p><p>记性，就是不理解时的死记硬背，是意识的功能作用。记忆的内容如果还没有熏染到意根，意根就不懂。如何有效熏染意根，让意根明了，以后随时随地都能想得起来？那就要不断的写，写就是实际操作，写时非常慢，一边写，一边熏习意根，这样意根就容易懂了。</p><p>写得慢，就是定，能专注意根就能消化吸收，以后遇到这些内容，就能明了，不用特意背诵。没有理解特意背诵的内容，容易忘，不可靠，后世更不能想得起来。意根明了，后世也能得到受用。</p><p>死记烂背，这是对于所学内容意根没有理解，全靠意识强记背诵。意识背诵的再流利，意根也仍然不解。而对于所学的内容，意根和意识真正理解了，根本不用背，不用记忆，用的时候，自然能够拿得出来，自然能够发挥自如。理解力不好的人，喜欢背诵，智慧好的人，理解以后就不管了。意识用功与意根用功的区别太大了，意根的智慧是真智慧，意识的智慧是假智慧。</p><p>四、意根和意识的了别特点</p><p>意根了别范围广，掌管全局、整体，把握宏观，突出战略性。而意识了别范围有限，掌握局部的、细微的、深入的，突出战术性。意根有智慧的人适合做领导将军，意识聪明的适合做参谋和部门领导，负责具体事物管理。二者结合起来，可上可下，可广可细，既有战略又有战术，所向披靡。</p><p>有大将军气概的人，就是意根有智慧有经验，搞科研的人意识心细入微。所以一个人的气势气质风度涵养，多在于意根，多指意根。这个东西是学不来的，现学来不及的了，意识如果要装，也装不了多长时间。与生俱来的东西，就是一个人的特质特征，那不是现学的，不能伪装。</p><p>对于佛教界的发展和总体走向，能准确把捉的人，一定是久学菩萨。由于久学，意根经历的多，见多识广，经验丰富，比新学菩萨能了解很多佛教和修行历史，能看透很多佛教里的现象。所以什么如法，什么不如法，佛法里的利弊看得很清楚，众生的根基利顿也看得很清楚。这都是意根的功劳，当然也不离意识的分别思惟。</p><p>新学菩萨由于经历的少，烦恼重，没有什么经验，佛教里的事情看不明白，众生的根基利顿看不清楚，法的走向和利弊看不明白。往往看问题很片面很肤浅，不透彻，出现的错误就会多一些，看走眼的人事就会多一些。</p><p>五、意识比意根先觉悟</p><p>众生因哪个妄心的想而沉沦生死？当然是因意根的妄想而沉沦生死。沉沦生死的帮凶是谁？意根的作案工具是六识，六识又助长意根的妄想和无明，这样生死就无出期了。总得有个先行觉悟的，谁能先行觉悟？意识没有先天性的执著，无明没有那么根深蒂固，分析思惟能力强，思想敏捷灵活，容易接受新鲜事物，遇到佛法就会最先觉悟。遇到染污的事情，意识接触后，也是最先受熏染，然后影响意根。可见，意识很容易受到周遭环境的熏染，然后再去熏意根。</p><p>六、表面的是意识隐蔽的是意根</p><p>意根为什么不容易被发现呢？因为意根没有语言文字，心行隐秘深邃，没有意识那样明显的推论、猜测、思惟、分析、想象、幻想等等作用，但是意根作主性决断力还是相当明显的。定力不足时，智慧就不足，心思粗燥，意根作用再明显也不容易观察出来。</p><p>比如说喜欢撒谎的人，往往有两个意图，一个在表面运作，比较明显，另一个在背后隐藏暗暗运作。一个人的真实意图就是背后这个，不是表面那个，表面那个只是起打掩护作用，声东击西，背后那个隐秘，不轻易暴露出来，不让人知。找到背后那个，就找到意根了，意根就是一个人的本质品性，代表人品人格，起关键作用。</p><p>很多人在人前，有两个心声，一个是能让人看得出来，表现给人看给人评价的，另一个是不愿意让人知的实质性的，故意隐藏的。在人后一个人独处，犹豫不决的时候，也有两个意见，两种想法，两种打算，两个心行，由于不统一，就进行内战。如果决绝不下，就要长期内战，这样就难免内心崩溃，精神分裂，身体出现隐患，身心是互相影响和牵制的。</p><p>唯识也就是心理学，学好唯识，能察微知著，观察人心理并不难，但知人的时候，不要轻易说出来，免得麻烦，不好相处。直心的人有什么想法就直接说，不会九曲十八弯，肠子绕八圈；心曲的人，有想法隐藏着不直接说，领人绕圈子，给人转迷糊以后，就进入自己设计的圈套中，达到自己的目的。</p><p>七、忏悔能否灭罪</p><p>忏悔也许能灭罪，也许不能灭罪。浅层次的意识忏悔，不能灭罪，作用不大，深层次的意根与意识一起忏悔才能灭罪，灭罪到什么程度，要看意根的真诚程度。因为意根的心行决定了业种，意根利用六识造业存入了恶业种子，必须意根自己亲自忏悔改变心行，才能消除一部分或者全部恶业种子。意识忏悔不能消除业种的影响，业种仍然存在，未来世的苦受避免不了。</p><p>八、意根不会说服意识</p><p>意识可以批判意根，但意根却不批判意识。因为其一意根是作主识，有决定权，完全可以不理会意识的决定和态度，也完全可以扭转意识。</p><p>其二，意根没有语言文字的功能，不可能去批判、否定、说服意识，不会跟意识辩论。如果意根不满意意识的思想观点，或者是意识不理解意根的思想观点，意识不服从意根的意志，意根有可能心里感觉不舒服，或者是抓狂，或者是抑郁，更有可能不理会意识的建议，自顾自的作决定。意根仅仅是需要意识的理解、支持与配合，这样就会比较坚定一些，内心也会比较坚强一些，如果意识不理解，一般来说也要意识服从。</p><p>九、眼识意识的辨别受意根的支配</p><p>问：比较相近的两种色彩，眼识意识看完之后，还不能确认，怀疑自己没有看清楚，于是决定再看一看，以辨别清楚。这个疑和决定，是眼识的疑和决定还是意识的疑和决定，还是意根的疑和决定？在交通路口看见红绿灯，于是就决定停车和开车，这个决定是眼识的决定，还是意识的决定，还是意根的决定？</p><p>答：眼识和意识的了别活动，是意根驱使才能出现的，是受意根支配指挥的，是意根了别色尘的工具。既然如此，意根就要明了眼识意识所了别的色尘，之后就要做抉择做决定，六识就会有进一步的活动。比较两种色彩是意根决定和支配的，两个识辨别之后，确认不了，意根也就确认不了，意识对色彩起疑，意根就起疑，于是意根决定再次辨别。</p><p>了别和辨别色彩，虽然是眼识的本分事，但是眼识不能单独出生和了别，必须与五俱意识一起了别，意识能了别色彩的深浅程度，色彩的名称和内涵，看着舒服不舒服，光亮不光亮等等细相，眼识了别色彩的粗相，不知道名称和光亮程度舒适度等等。所以对于色彩方面的五尘，意根也能触和了别，只是了别不明白，需要借助于眼识和意识两个工具。</p><p>在交通路口看见红绿灯也是眼识和意识所了别，由意根支配和指挥，意根在两个识了别的基础上，作自己的了别，于是决定停车和开车，以及左转和右转。这些决定当中，首先是意识的决定，供意根参谋，意根起自己的思量，做决策，但并不一定完全听从意识的意见和看法。</p><p>十、意根对色身的主宰作用</p><p>一个人遍体鳞伤，疼得昏了过去，可是醒过来之后还是要继续疼痛，意根为什么还要选择醒过来呢？因为意根怕死，非常执身，总是希望自己有五阴活动，不希望五阴功能灭失。当六识出生的因缘条件具足时，意根一定会作主生起六识，产生五阴身活动。特别疼痛时，身根受到的损伤比较大，阻止意识继续了别和出生，意识就不得不灭去，当身根稍微恢复一些，意根就想了别身体情况，于是意识和五识就出生了；或者说有其它比较强烈的尘境出现，意根想要了别，六识也就出生了，于是就从昏迷中醒过来。由此可见，意根对五阴身是多么的执著。</p><p>还有人高兴得乐死的，大乐时为什么能死亡？意识控制不住的乐，心里觉得不应该这样的乐，可没办法，控制不住，那就是意根的乐。当乐的心行过大时，心脏的血液却远远供应不上，致使身根无法正常运作或者毁坏，那么六识也就不能正常活动，以至于灭去，意根发现身根毁坏不能用，六识不能再出生了，于是就决定离身，弃身离体，五阴就死亡了。横死之人，意根没有准备，更不想离身，可是身体被毁得七零八落，也没有完整的色身了，意根再不能执身，就迅速的舍弃了色身，进入中阴身阶段。</p><p>十一、自信的差别</p><p>从自己的自信里找意根的自信，比较一下，意识的自信和意根的自信有什么差别，然后在意根的自信和不自信里，观察意根的证自证分。不断的提高自己的思考能力和观察能力，将来自学自修的能力就强，不必总去背书，背来背去，也不知道背得对不对，没有能力依法，就不得不依人，致使道业很难有进展。</p><p>十二、鬼神附体时意根意识都有什么反应</p><p>一开始意根不愿意，表现为不舒服，意识懵然不知何事。后来意识渐渐明白了，就想对策，与意根一起开始强烈反抗，直到赶走侵略者。意根知道被附体，自己是无可奈何的，必须想办法让意识明白，才能对付附体者。意识一旦觉醒，就会想办法解脱，赶走附体。如果是业力大，与附体者怨结深，也可能互相之间纠结一辈子，甚至后世也会在一起纠结。</p><p>十三、聪明反被聪明误</p><p>意识聪明伶俐，而意根烦恼重，这不是好现象。意识如果觉得自己很聪明，就不会检查自己的内心，不知道反省，那就无法发现自己内心的烦恼，也就无法克服自己，越过障碍，聪明反被聪明误就是这样。</p><p>十四、意根作主识的特点</p><p>内心的焦虑焦躁等等情绪化的东西，都是意根的，外在表现为意识和五识的状态，也就是由六识来显示和发泄。内心的冲突多数表现为意根与意识的冲突，二者认知不同，理解力不同，思想观念不同，就会出现冲突。</p><p>意根有什么，我们就有什么，意根没什么，我们就没什么。意识并不是作主识，祂有什么没什么，只要不影响意根，都没有什么用。 意根如果没有欲心所，就什么事也不打算做，就会无欲无求，心就清净了。意识不管有什么欲望，也影响不了意根，意根不受影响，什么事也不会做。可是意根就是有贪有欲，叫作贪欲，断除贪欲，就是具有初禅定的三果人，后世能生色界天。</p><p>十五、意根代表真实意识代表虚假</p><p>意根的作用如此之大，远远超过意识，不管有没有意识的时候都是如此。所以要看一个人真正的想法、态度和目的，不要看他嘴上意识说的有多好，要看他意根内心里真正的想法和动机。有些人嘴上说得天花乱坠，实际上想法正好与此相反，这个人非常虚伪。我们平时与人打交道要善于观察人，了解他的真实想法是什么，不要只相信他表面意识所表现出来的，要观察他的内心意根，意根是作主识，代表一个人的思想品质，也代表一个人真正的修养。</p><p>十六、发呆发愣是意根的思量状态</p><p>发愣、发呆、失神、愣神，愣是呆而不动的意思，神是指意识，愣神就是意识不起思惟分析作用了。因为意识已经把法的表面肤浅的意思弄明白了，再深一步的问题就解决不了，就不得不把问题交给意根来解决，意识只负责盯住问题就行了。很多重大和深入的问题意识都解决不了，只好依赖意根宿世的固有的经验和智慧，前期意识把浅显的问题弄明白传递给意根，意根了解个大概，就会单独的思量进一步的问题。</p><p>比如见到老同学老同事，意识认出来这个人，知道是谁，可就是说不出名字，无法称呼这个人，以至于无法打招呼。这时意识就不能有什么动作了，意根只好搜索这个人的名字，不断的思量寻思，同时让六识张口结舌，眼睛瞪着对方，什么也不要做。在愣神的时候，有时候意识也有一些微弱的思惟活动，以辅助意根的思量，但意识的思惟不会强大，否则意识的思想活跃，就从愣神的状态出来了。</p><p>十七、意根与意识的分工</p><p>纸上谈兵是意识的事，实际作战是意根的事；学理论明理是意识的事，实际操作是意根的事；学习研究棋法是意识的事，棋盘上对垒是意根的事；学习曲谱是意识的事，上台演奏是意根的事；学习绘画艺术是意识的事，绘出图画是意根的事；学习金融是意识的事，从事金融工作是意根的事；学大厨面点理论是意识的事，成为厨师炒菜做饭是意根的事；学驾驶技术是意识的事，开车上路是意根的事。</p><p>学习数理化知识是意识的事，工作当中实际应用是意根的事；学习医学理论知识是意识的事，治病救人是意根的事；学习农业技术是意识的事，田里种地是意根的事；学习建筑设计是意识的事，实际设计图纸、建筑房屋是意根的事；学习政治是意识的事，当上领导成为政治家是意根的事；学习佛法是意识的事，证悟成佛是意根的事。意识与意根如何分工合作、各司其职是戒定慧的事，也是一个相当大的学问。</p><p>十八、涅槃里和无想定、灭尽定里六识的灭有什么区别</p><p>涅槃里不仅六识灭，主要还有意根的灭。无想定里六识虽然灭，意根还在，也有五遍行心所法在运行，属于有心状态。灭尽定里六识灭了，意根还在，但意根的五遍行心所法灭去了受想功能，属于半有心，全无心时就涅槃了。</p><p>六识灭分为暂时灭和永久灭，无想定和灭尽定六识暂时灭，是因为意根暂时不攀缘境界。可是意根并没有放弃五蕴世间，所以还会让六识出生从定中出来。在睡眠时六识灭，是因为意根需要色身休息，这是暂时的，意根心不灭，就会让六识出生再醒过来。</p><p>昏迷时，是因为色身出现障碍，胜义根不能正常接收六尘，六识不能继续了别，可意根还想拥有六识的功能和色身的功能，当色身阻碍消失的时候，意根还会促使六识出生。死亡时四大分离，六尘境界无法传入胜义根，无法继续维持六识的功能作用，意根无奈才离开五蕴身，生出中阴身继续使用六识的功能作用，这是意根的被动行为。</p><p>而涅槃状态的出现，是因为意根没有任何心行了，六识无法再继续运行下去，六识就灭了，意根自己也灭了，这是意根的主动行为。</p><p>六识犹如境界风，能把阿赖耶识的大海吹起七识的波浪。意识分别的境界，传入意根，意根就会受到熏染，起心动念，从而使得心海波涛浪涌不平静了。所以意识不再继续分别了，意根就清净下来，逐渐趣向了涅槃。</p><p>众生生到极乐世界也是这个道理，意识在极乐世界长期接触不到类似娑婆世界的染污境界，心就会清净下来，不再熏染意根恶法，意识清净，意根也就清净了。意根清净了，与极乐世界相应，就会从莲花中出来见佛闻法，悟无生。</p><p>十九、意识的了别慧大于意根的原因</p><p>意识的了别智慧大于意根，一个是因为意识所缘比意根少很多，祂不是作主识，一切事都不用作主，所以没有那么多的牵挂，容易专注思考问题，了别境界比较清晰。意根所缘、牵挂和了别的法有很多，凡是如来藏出生的法，意根都能缘得到，古往今来一切与己有关的事情，身根上每刹那的微小变化意根都能了别到，都能知，即使与己无关的，由于攀缘的习气，也要去攀缘挂念。因此心念不容易集中，了别智慧就弱，对法的认识就不清晰。</p><p>意识智慧大于意根的再一个原因是，意识只存在一世，受环境熏很轻微，没有意根那么多的烦恼和无明，也没有那么多的业障，遮障少，所以意识比意根聪明。如果意根所缘比较少，心里的无明不是很深重，无始劫以来没有累积无量的生死业障，那么意根就能像意识那样有智慧，即使证据不足，也能判定出一个合理的结论，从而证得真理。可是意根不是这样，所以才让我们修行实证那样的困难。</p><p>二十、意识的想阴能影响意根并受意根支配</p><p>想阴属于融通妄想，由于妄想幻化出某些境界，身体就随着妄想而出现了变化。身体并没有接触到妄想出的境界，仅仅是心里想念，身体就出现变化，说明身体是随着心想而动的，是受心指挥的。这样不由自主的身动是多么虚妄不真，是谁在指挥控制着身体，犹如魔术师在幻化和操纵似的？是意根，身体和识心是相通的，互相能融合在一起，心念力能驱使身体，决定身体的动转。哪个心的念力这样大这么有力度？是意根的心念能做主宰，有力度，能改变色身。意识的心念只能影响和改变意根，不能直接运转色身和改变色身。</p><p>想阴主要指意识的想，而意识的想一是由意根支配决定，二是能影响带动意根。想明白的不属于证悟，很多理都可以想明白，但就是不属于实证，所以想明白之后还需要去实证。</p><p>高兴时手舞足蹈，或者身体虔诚的礼拜，身体和心有什么关系呢？识心想起伤心事，为什么眼睛会流泪呢？想起让自己生气的事，手为什么会握拳，心脏会突突的跳呢？心情郁闷，身体为什么会得病呢？心情愉快，为什么身体病好了呢？这些想阴都属于融通妄想，也属于是胡思乱想，非常的虚妄，没有什么实事。天下本无事，庸人自扰之。</p><p>二十一、意识明一套意根暗一套</p><p>有一些人做事表面一套暗地一套，或者是说一套做一套。明面上给人错觉的都是意识的想法，暗地里实际做的都是意根的思想；说的都是意识的想法，做的都符合意根的想法。所以我们平时与人打交道要善于观察，不要看对方口头上说的多好，要观察他意根内心真正的想法。有些人嘴上说得天花乱坠，实际上想法却与此相反，这个人非常虚伪不诚实。</p><p>如果一个人想要给你某些东西，要观察他是真想给你，还是假给有其它想法和目的；如果意根不愿意给，但行为上意识不得不给，那么后果可能不太好，他会想办法讨回去的。我们如果想要别人的东西，要观察他是否真正愿意接受，意根同意，还是只有意识愿意接受而意根并不愿意接受。不要只相信他表面意识所表现出来，要观察他的内心意根。意根是作主识，代表一个人的思想品质，也代表一个人真正的修养。</p><p>二十二、意识与意根互熏烦恼</p><p>问：当我观察到心里要生起一个烦恼的时候，之后意识就真的感觉烦躁了，意识所想到的全是负能量并且非常消极，抑郁就出现了。这个烦恼是不是意根产生的？</p><p>答：从你叙述的情况来看，确实是意根先有烦恼，然后促使意识在烦恼处出生，了知烦恼，感觉烦恼，然后就表现出烦恼和情绪，这是意根对意识的熏染。意识在了知法以后，可能要产生自身的烦恼，之后熏染意根，让意根也染上烦恼，这是意识对意根的熏染。</p><p>意识的产生是意根和法尘相接触，接触以后想造作才产生意识，意识的烦恼由那里来的呢？一个是由意根而来，一个是由对境界起心而来。意识的烦恼如何由意根而来呢？意根触尘境以后生起烦恼，想要发泄出去，或者是表现出来，就会调控意识，促使意识发泄烦恼情绪和造作烦恼业，于是意识就表现为烦恼，如嗔恨、贪爱等等。</p><p>意识烦恼的第二个来源处，就是在意识接触和了别了尘境以后，可能会生起烦恼。当意识出现烦恼想要有所造作的时候，把想法传递给意根，意根受到蛊惑但没有起烦恼，就会被动的同意意识去造作烦恼业，发泄情绪；如果意根受到意识的蛊惑和感染，也生起了烦恼，就会主动的促使意识造作烦恼业，发泄情绪。如果意根不受意识的蛊惑，就不会允许意识造作烦恼业。</p><p>所以众生在起烦恼的时候，有时候是意识单独的烦恼，有时候是意根单独的烦恼，有时候是意根和意识共同起的烦恼。意识单独起烦恼，能够很快就退去和消失，容易转化，意根如果自行起烦恼，很难平复下来，不容易劝服和转化，不容易降伏下来。如果意根和意识共同起烦恼，一定要造作烦恼业了，这时候没有控制情绪者，将会一发不可收拾。</p><p>二十三、哪个意的念管用？</p><p>练气功时意念导气运气聚气用气，全部是意根的意念。意根意念气聚手心劳宫穴，气强到一定程度，再意念伸手把气打出去，功夫到者，山崩墙塌，火车停滞，汽车倒走，这纯粹是气功了。但是气功也好，什么功也好，全部是训练意根的念力作用，念强心力强，气强能量强，然后可以为所欲为，所向披靡。</p><p>有人就会说了，意根没有念，都是意识念。那好，你意识念试试，如来藏看得上你管你否？念的有用否？能实现作用否？意识念的气功，什么功力也没有，什么用也不顶，花拳绣腿，摆设而已。</p><p>气随念走，是随意根的念走，不是随意识的念走。否则人人意识可念，可是练好气的人却极少，而且需要练相当长时间才能练成功。为什么要练这么长时间？因为是用意识训练意根，意识容易，意根不容易。众生主要的差别在意根这里，意识都会想都会念，可是没有用。</p><p>二十四、思考是哪个识的作用？</p><p>思考分为浅层次思考和深层次思考。浅层次的思考是意识单独思考，有点走马观花式；深层次的思考是意识与意根共同思考，这需要定力了，定力不足，思考只在意识表面，深入不到意根那里，也就不能真正思考明白，不能真正解决问题，心中的疑问还是不能解决。</p><p>二十五、意识与意根心行的区别</p><p>众生的心理状态分成意识层面与意根层面的，一浅一深两种层次。意识本身是被动的，祂要想作主宰，必须把意根给影响过来，熏染成功之后意根才会顺应意识的想法作出相应的决定。如果意识不能成功熏染意根，意根就顺着自己以往的习惯来作主，意识的思想和建议不起作用。</p><p>意识所有的心行造作是因为什么产生出来的呢？意识因为什么而生？因为意根触法尘后需要作细致分析判断，如来藏就配合出生了意识，意根想造作的时候，必然让意识出生来帮助祂造作，因为意根自己在某些法上无法造作，这时就需要意识来替自己造作。</p><p>比如从生气这件事来看意识和意根心行的区别，意识生气的时候所表现出来的行为是因为什么产生的？是因为意根生气产生的，意根想要发泄或者表现出自己的愤怒，就借用意识或者是六识来表达内心的气愤，此时六识就表现出忿怒的身行和语行。生气时有诸多表现，比如面部表情狰狞、语言上恶口、身体上的握拳挥拳和手指着对方等等，这些都是意识和身识共同造作出来的，都是顺应意根的心行而造作的，表达的是意根的心行。</p><p>但是造作嗔业后二者的反应有明显区别，意识相对明理，马上就能够反观这些行为是好是坏，觉得刚才的行为确实不对，为什么不对，一想就能想明白。虽然意识想明白了，但是意根还没有明白过来，心里还照样在生气，气鼓鼓的。意识此时就劝说：算了别再生气了，本来是自己不对。可是意根还不理解，照样生气。</p><p>当意根特别愤怒的时候，意识根本控制不住，比如意根气到极点想要打人的时候，意识这边觉得打人不好，那边身体却控制不住的去打人。意识无法控制意根，祂就要按照自己的习气来造作，毫无办法。六识就只能充当帮凶，代替意根来造作这些行为，这就是意识无法说服意根时随顺意根的心行所表现出的行为。</p><p>二十六、意识与意根业行的区别</p><p>如果要区分意根造业与意识造业有什么不同，那就要看这个业是符合意根的心行还是符合意识的心行。一般来说意识所造的业行都符合意根，因为是意根促使意识来造业，意识造的业就是意根造的业，意根让意识造业意识才能造业，意根不让意识造业就不能造业，这是在一般情况下。</p><p>还有另外一种情况，意识力量非常强大，扭转了意根，会迫使意根按照意识的想法来作主造作业行，意根就不得不服从意识的意志作抉择。这时候意根作主造的业就符合意识的心行，意识把如何这件事的道理分析得头头是道，理由很充分，就把意根扭转过来了。</p><p>此时意根的力量不如意识强大，意根就随着意识的心思作决定，表面上是意根作主，实际上是意识作主了，身口意行符合意识的心行，这个业就是以意识为主造的业。如果意根完全被意识说服控制，意识说这样好，意根就完全同意赞同，那么这时候意根指挥六识造的业，就属于意根和意识共同造的业。</p><p>如果意根的力量强于意识的力量，意识的观点、意见、看法意根都不同意，那么意根一定要按照自己的心意来作主抉择，表现出的行为就符合意根自己的习气，祂促使六识所造的业行，就符合意根自己的心行，这种情况就属于意根造的业。</p><p>这里的层次分成好几种，不是像我们想像的表面行为那么简单，具体的情况要具体的分析对待。要观察业行是符合意识的心行，还是符合意根的心行，需要从以下几个方面着手分析：看意识和意根的心行是否一致，当心行一致时六七识都同样的善，或是都同样的不善，这时所造作的业行就符合二者共同的心行；如果不一致，那就看是以意根为主造的业，还是以意识心行为主造的业，要根据具体情况来区分。</p><p>二十七、意识疑和意根疑的区别</p><p>意识疑，疑的程度比较浅，只在表面，不是真正的疑，比如一解释，心里明了了，疑就消除了。意根的疑程度比较深，因为意根是作主识，是主人，主人的一切心行和抉择都起作用，有结果。意识不是主人，祂的疑不能起主要作用，也容易消除。比如说意根对自己所造作的善法起疑，这是真疑，这样就会把之前善法的心行和业行抵消一部分或者全部，从前所造作的善法功德就没有了或者减少了。因为意根后边有如来藏配合，意根的心行如来藏都知道，意根要是怀疑不相信有那些功德，如来藏就把这些善法的功德记录给减轻，功德就减少。</p><p>所以疑心重也不好，疑是一种烦恼，在我们需要断除的三缚结当中属于疑缚。有疑不决，生死不了，所以我们要解决心中的疑，解决对于解脱之法的不明和不抉。意根如果怀疑自己已经做的功德，功德就要打折扣，所以我们造作了善业，就不要有所怀疑，要从内心认可这是善业，将来肯定就能如实得到善果。</p><p>在我们临终的时候，如果心里念念都是今世所造作的恶业，如来藏就会配合让这个恶业种子提前成熟，我们就会随恶业所牵去受恶报。我们应该调整心念，心里一直想着此生所造作的所有善业，所造的恶业在临终之前都要努力忏悔清净，实在忏悔不了的，到临终之前也不要把恶业在心里形成一种强烈的念头，尽量不要去想它，而想善业，那么如来藏就有可能（不是完全）不让恶业种子成熟，而成熟善业种子。</p><p>这就是说临终时的心念就是心愿，如来藏都会配合你，让这个念和愿实现。所以临终时只要我们都是善愿，想往生极乐的愿，如来藏就会配合让我们往生极乐。如果我们临终的那个念不好，与这辈子的恶业相应，那么恶业果报就现前，我们就可能去三恶道。如果临终对极乐世界或者是对阿弥陀佛起疑，就去不成极乐世界，勉强能去，也是去极乐世界的边地疑城，不见佛不闻法，直至疑心疑业消除，所以临终的念是最重要最有用的。</p><p>二十八、意根默容一切法的含义</p><p>默，就是默默的、无声息的、在暗地里、悄悄的。这是意根的特性，意根就是这样默默的不被人知，无声息的、静悄悄的、在暗地里。容，是容许、共容、一起、容纳、容忍。这说明意根是容纳一切的，容许一切法存在的，与一切法共存的，共同运转的，容忍容受一切法现行的。这个意思也在说，有一切法的存在，就有意根，意根永远与一切法在一起共同运转。</p><p>而意识不是默容一切法，不能与一切法在一起共同存在和运转。那么许多法的出生和运行就与意识无关，不受意识指挥和控制，意识没有控制一切法出生的权限。只有第八识和意根永远与一切法在一起，共同运行，而第八识没有指挥进行操控的心行和特性，没有作主性，那么就证明只有意根才能对一切有操控权限和作主权限，我心我性很重，所以生死业也重。</p><p>二十九、概念和经验出于哪个识</p><p>概念只有意识心中才有，意识与概念相应，五识、意根和第八识都没有法的概念，因为意识与法的相貌相应，有思惟分析归纳概括的能力，其祂识都没有。</p><p>经验，是经历相应法的过程中所累积的智慧认知，五识对五尘境有经验，意识对法尘有经验，六识的经验都是一生一世的，有遗忘性。而意根积累的是生生世世的经验，不灭，关键之时能快速起用，保护自身的安危和利益。而第八识虽然生生世世不灭，但祂没有记性，没有经验之说，因为其智慧是固定的法尔如是的，不增不减，所以就没有经验，不需要经验，照样能有序正常的运行一切法。</p><p>三十、意根任运与意识寻伺的关系</p><p>任运是指识心随顺自然随顺因缘而自动自觉的运行，不曾有人为的干涉而受到阻止，使其停滞不行。八个识中只有第八识和意根是任运而转的识心，六识都不是，六识要受意根的限制，不能运转的时候非常多，所以六识不是任运而转的识。</p><p>寻伺，是意识单独或者带着五识的寻觅、推敲、思惟、参究、研究等等行为，以解决意根心中的疑问或者是什么问题。所以意识或者六识的寻伺直接受意根指导，意根让上东寻伺意识就上东寻伺，让上西寻伺意识就上西寻伺，事先意识可以提建议供意根参考和抉择。</p><p>虽然意根没办法自己单独有五阴身的活动，但是意根有下属有帮手能替祂做很多事，意根就要使用，领导事务繁忙，不能亲自做具体事，就要安排下属去做，这是天经地义的事，六识按要求完成意根的指令，也是责无旁贷的，其职责就是如此。</p><p>第八识没有寻伺的行为，也没有寻伺的心行，因为第八识是无为不作主的心，祂心中无事，事事都与祂无关，也就没有必要寻伺个什么。意根在对一切法的运行当中，因为无明和攀缘广，对一切的认知非常粗燥，常常有弄不懂的事情，即使依靠六识，也有很多法不懂，为了弄懂，就要起寻伺心去探究，就需要六识去完成探究的任务。所以任运而转的意根，正是六识寻伺行为的发起者、监督者和指挥者，结果由意根受用。</p><p>三十一、意识不是作主识</p><p>问：如八识规矩颂讲动身发语独为最，以及审虑思、决定思、动发思，都是讲意识是作主识吗？</p><p>答：这些都没有讲意识是作主识。动身发语的意思是，意识能与身识一起动转身体，造作身业，意识能与身识一起出生语言声音，造作语业，身业口业以意识的功能最大，以意识的功能为主，身识为辅，功能较弱。</p><p>审虑思、决定思、动发思，这是讲意识的思心所功能，意识虽然有这些思心所的功能，虽然能够做决定，但是祂的决定最终是否起到应有的作用，还在于意根是否接受和接受的程度。比如小孩子决定要买一个玩具，最终能不能买成，在于他的父母是否同意，因为钱由父母掌握，父母有花钱的决定权。比如说一个参谋下属决定要发动军事演习，但是最终是否办成这事，是由首长和司令总指挥决定的，参谋下属仅仅是提个建议而已，听不听由领导说了算。</p><p>意识就是为意根服务的，意根能够作意识的主，意根不需要意识服务，就不决定出生意识，那就没有意识的出现，那就谈不到作主和作决定了。五识也有思心所，能作决定，但是五识的决定比意识的决定还弱，管不管用听不听，都在于意根。然后意根作主决定了，能不能办得成，还在于第八识，如果没有业种和福德，第八识也无能为力。所以意根能够作主成事出生什么法，那也是有前提条件的，不是意根想干什么就能干成什么的。</p></div>"
},{
    "title": "第七章 意根的了别性",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  意根的了别性</strong></p><p>一、意根的了别范围</p><p>意根了别的范围极广，一切法都能了别，不管这些法变动与否，有些法长久不变动，意根仍然能了别，细小的不变动的法也能了别。如果有意根不了别的法，就不能出生六识再去细微具体了别。</p><p>意根不仅了别胜义根内的法，也了别胜义根外的法。内六尘境界都能了别，才能出生六识去了别六尘。意根了别色尘之后想要具体了别是什么色彩是什么东西，就会出生眼识意识；意根了别声尘之后想要知道是什么声音，就要出生耳识意识具体了别，对于其它色声香味触法也是这样。</p><p>粗重的五尘意根也能了别，比如说面前有五彩缤纷的花朵，意根如果对紫色的花朵感兴趣，就会在紫色的花朵上出生眼识意识专注了别，意根越感兴趣，了别时间越长，越专注。眼识意识能专注观赏紫罗兰一两个小时，说明意根对紫罗兰非常感兴趣，一直在触紫罗兰，一直在了别紫罗兰，否则眼识意识就会消失不见，不再欣赏紫罗兰了。对其它几尘也是如此。</p><p>为什么非要说意根只了别变动的变化的法尘呢？不变动的法尘六尘意根都能了别，否则就会失去觉照作用，六识就不能出生。一大堆色彩出现，意根选择紫色的话，就会让六识一直专注的欣赏，而看见粉色的花，再也不去看第二眼，意根既然有这样的抉择，说明意根是知道各种色彩的差别的。那么意根就能触全体六尘，也有一定的对六尘的胜解力，能让六识专注欣赏，说明意根也一直在触，所以意根也有定，意根如果没有定，跑到其他尘境上了，六识马上就在原来尘境上消失不见。</p><p>在一大堆鲜花中，去寻找自己非常喜欢的紫罗兰，说明意根有欲望，有欲心所，意根如果不想见到紫罗兰，就不会出生六识去寻找紫罗兰。意根有不到之处，六识就不会出现。</p><p>二、六识的了别由意根作主</p><p>有人说意根只缘法尘，可是五识去了别五尘这件事，是由谁主导的，是什么原因生起的？六识的出生以及在六尘上的了别活动都是由意根指挥控制的，是意根想要在六尘上有所造作才出现的。五识了别五尘同样也是由意根作主决定出来的，比如说眼识总是随着某种色彩运转，这是由谁决定指挥的？是意根对某种色彩比较感兴趣，眼识才随着这种色彩运转；耳识总是追逐着某种粗燥的声尘，关注着轰隆轰隆的响动，这是由谁决定和指挥的？还是由意根操控的，意根觉得声音特别，想了别清楚，所以就会让耳识一直关注了别。</p><p>大多数人都说，自己（意识）不知道的法就不存在，实际上存在的法不一定让你意识知道。意识不知道的法，意根却知道，意根能缘得到，能有粗略和概况的了知。有些法是无法让意识六识知道的，原因有几个：一个是因为意识没有智慧感知，一个是因为意根没有智慧促使意识知道，一个是缘不具足意识无法知；有些法是没必要让六识知道的，因为意根不想仔细了别和处理。无数人都是把六识当作自己，其实真正的假我自己还是意根，不是六识。</p><p>我思故我在，这是指意根，深层次的思，内心的那种思想观念，都是意根的。一般人都说我知故我在，这种知就指六识，六识不知时，意识就觉得自己不存在了。但是不管六识知不知道，内外六尘都存在着，无数法都存在着，即使六识能知，也知不了多少法，了别的范围有限。</p><p>三、不管法尘重大与否意根都能了别</p><p>不能如实现量观察意根运作的人，就会对意根有诸多误解。楞严经中佛说意根默容一切法，这一切法的范围极其广泛，如来藏能变现什么法，同时就能了别什么法，意根随着如来藏就能缘什么法。这是佛经的意思。</p><p>有人说意根只缘重大的法尘而且还得是变动的，不重大不变动的就不能缘，是不是这样呢？意根如果有不缘的法，六识就更不能缘了，只要意识了别出来的法，都是意根所触所了别的。其实在日常生活中，意识不管法尘重大与否、动与不动，都能了别出来，比如蚊子的嗡嗡声，自己的心跳声，耳朵里的细小声音，肚子里的声音，这么微细的声音，意识都知道了，就是意根攀缘出来的。</p><p>那意根一定是先触先了别的，只是了别不细致，意识六识才被出生帮助了别。所以不管法尘重大还是微小，意根随着如来藏都能缘得到，也都能了别。只有意根认为比较重要和有用的或者是习惯于了别的法尘，才让六识出生了别。六识没有出生来了别的部分，意根还是能够缘得到，了别得到，只是意识不知道罢了。</p><p>即使法尘不变动，意根也能一直了别，比如意识眼识看一个不动的景色可以看一天半天，那么意根就对这个景色触一天半天而不动，意根并不是只触经常变动的法尘，也不是只缘法尘，不缘五尘。比如意根首先接触到一大堆色彩，只对个别色彩感兴趣，于是就在自己感兴趣的色彩上出生眼识意识来共同了别，其他的色彩却不去了别。</p><p>真正想学佛有所成就者，一定要依止真理和事实真相，不要依人依权威。</p><p>四、为什么不喜欢听的声音却挥之不去呢？</p><p>为什么意识不喜欢听的声音，却挥之不去呢？有的时候想静静的思考问题，可是耳边总是能听到细微的杂音，还有虫鸣等等，觉得有点吵，分散注意力。为什么意识不喜欢听的声音，却挥之不去呢？这是意根的习惯性攀缘，毫无目的性的攀缘所致。意根的习惯太厉害了，意识没办法管得住，只有长期修定，把心沉浸在非常感兴趣的事情上，才能屏蔽意识不想了知的法。</p><p>当禅定很深，意识很专注时，意根攀缘的法意识不喜欢不愿意了别，意根知道后，也就逐渐不再攀缘，知道意识不理会祂，祂就稳定下来，注意力也集中了。修定的原理就是这样，意识不再顺从意根，意根就不得不收敛围着意识转，这样二者都定下来了。</p><p>如果修得太急，意识违拗意根太严重，意根就会非常闹心，非常不舒服，有时就要发脾气，感觉很抑郁，那么意识就要放缓节奏，不要太强扭意根，选一个意根感兴趣的法来沉浸其中，把意根的习惯改变，然后再走上修定的正轨。</p><p>五、意根处理境界离不开意识</p><p>蚊子突然落在脸上，你不自觉的在脸上打一巴掌，过后才知道是蚊子盯在脸上了，自己是在打蚊子。自己不知道的事情，为什么能做得出来？是谁做的？</p><p>蚊子落在脸上，是很轻很轻的，意识一般都发现不了。但是发现不了，也自觉的打了蚊子，当然这完全是意根指使的。可见，不管多么微小的六尘境，意根都能首先了别到，对于涉及到自身安危的尘境，立刻决断处理，于是六识出生处理危急自身的事情。那么意根在没有意识帮助了别判断的情况下，仍然能分别重大和细小的尘境，能分别对五阴身有益处和害处，能快速的采取行动，其智慧也不低。意根了别境界时，可以不用意识，但是处理境界时，一定离不开意识，意根不能处理任何事，必须有意识的协助才行。所以很多时候，意识或者是六识的身口意行，正体现了意根的思想和德行修养，体现了意根的心行。</p><p>意识身识对于蚊子咬的处理有时是打，有时候是挠痒，有时候是摸，有时候是抠，各种动作都不一样，为什么会选择不同的动作？这都是意根作主指挥造作出来的，意根对于触尘有判断力和抉择力，各种情况的触尘都能了解，因而情况不同，抉择不同，意识身识的造作就不同。</p><p>六、意根了别的法远远多于意识</p><p>问：有时候在走路时，看不见后边有人跟着，却能知道后边有人，这是怎么知道的？背后的人和物，是否是大脑里的内相分？色尘能否不通过眼根传导，就能进入大脑胜义根？</p><p>答：背后的人物，不能通过眼根传导到大脑胜义根里，因为眼根不对脑后，楞严经里佛说眼根在一千二百功德当中只有八百功德，意思是说，眼根能接触正前方的色尘，左右各能接触三分之二，其余的就接触不到了。因此知道身后有人跟着，这个知是独头意识所知的独影境法尘，并不能知道色尘。这个独影境法尘是意根接触并了知的，意根认为这个重要，就警觉意识知道。极多的法，意根都知，但是无法表达，意识又没办法知道意根所知，所以意识就不知，有的人就说我不知，其实意根是知的，意根知而意识不知的法有极多，所以意根知一切法，意识没有神通和大智慧所知的法就有限。</p><p>打喷嚏是突然间的事情，意识没有心理准备，那就是意根发动的。鬼来了，意识不知道，但是身体会打冷战，这是意根引发的。大事情要来临时，意识不知道是什么事情，但是会莫名其妙的高兴或者闹心，这是意根发动和暗示的。</p><p>七、现量了别的内涵</p><p>现量了别，一是指识心了别的智慧境界，二是指识心了别的方式。识心的现量了别是有一定智慧性的，智慧程度不同，现量了别就有差别，识心所面对的相分越直接就会越真实越符合事实，越容易有现量了别，认知越准确越如实，越不容易了别错误。识心的现量智慧深，触到境界法时当时即知，马上就知，不用分析，不用研究，不用琢磨，不用打听，不用臆测，而且知的准确无误。如果不能立时即知，就说明智慧不足有缺陷；如果比量非量很久也不知，就是愚痴无智慧；如果知的不正确有误差，智慧就浅。</p><p>第八识能现量了知一切法，准确无误，包括久远劫以后的事情，只要了别了业种，就能当时即知，不用比对研究分析臆测打听琢磨，因为第八识没有无明，智慧深广无边。一切法都是第八识亲自变现，亲自所缘，了别就不会有差错。如果第八识了别出现差错，那么因果就不可想象，五蕴身就不能正常运转，生命就不会有序的进行下去。这种现象是不可能发生的，所以第八识了别一切法必须是现量了别。</p><p>第七识意根所对应的相分是带质境，来自于第八识出生的本质境，是依第八识的见分而见，接近于真实，所以意根所了别的是现量境，但是了别结果却是非量，有不同程度的误差。佛地的意根因为完全彻底转识成智了，了别结果都是现量，没有非量。</p><p>五识所对应的相分是性境，也比较真实，不随心转，所以五识是现量了别。但如果眼根出现业障，五识的了别就会受到一定的影响，了别的结果可能会出现非量。</p><p>意识所对应的相分是似带质境假带质境，与本质境相差比较大，所以意识了别就有现量、比量和非量，需要的智慧很深很细致。意识了别的结果现量和非量都有，往往会影响意根的认知和抉择，容易熏染意根。</p><p>与如来藏比，七识都是非量了别，结论都有错误。七识所谓的现量，是在一个范围之内，是相对的现量，假现量，不是绝对的现量。因为世俗谛并非真的是世俗谛，实质是圣义谛，所以七识不知此理，对世俗谛的现量了别结果也是非量。</p><p>实际上一切认知都符合事实的，只有第八识心，以及成佛以后的七识心。在成佛之前，因为还有无明，七个识心就有不同程度的非量认知，越接近于佛陀的智慧，非量认知越少，现量境界越多，越是凡夫越是非量，没有或者少有现量。即使见眼前的山河为山河，也不是现量，还是非量，因为只见假相，不见相的实质。</p><p>八、现量与非量的概念</p><p>现量，现是现在当前、眼前、实际、真实、如理如法的事理，量是估量计量量度。现量就是对所缘的法有符合事实符合真理的计量估量量度，见法时当时就见就知，就能判断出来，不用意识想象、幻想和比对，不用特意加工。</p><p>非量，与现量相对，不是自己的智慧境界，不能如理如法的正确认知，了别出现错误，需要意识思惟、分析、想象、幻想、回忆等等才能知。非量还有一个含义，就是错误的估量考量衡量计量，得出的结论是错误的，不符合事实。</p><p>九、七个识的三量</p><p>七识心对于六尘的了别，分为现量、比量和非量三量。量是估量计量量度的意思，正确如理的量度是现量，比较着量度是比量，不能如理如实如法的量度就是非量，智慧所不能及是非量。</p><p>现量了别是了别当前的、现有的、正在运行的、存在着的、实际的、实法、真法。比量了别，是通过两种或者两种以上的法相互比较的方式了别，对事理的确定一定要有参照物，否则无法辨别，可见比量了别智慧不足。而现量了别没有参照物，完全靠现有的智慧当下了别判断。</p><p>非量了别是了别非现前存在的、非实有的、想像的、虚构的、幻想的、虚法假法、非亲缘的、非亲证的、幻有的法。此种了别有两个极端，一种是有丰富想象力的智慧型的；一种是无边际的纯粹妄想型的，后者体现不出现量智慧。</p><p>五识都是现量了别，了别的都是现前存在的、实有的、不是虚构的法，五识不能想像，也不能比量，当前的法是什么样，就了别什么样，不能幻想。但是五识也有了别错误的时候，把色法上的色彩看错了，比如把红色看成绿色，这就是非量了别，只有在眼根等五根出问题的时候才会这样。因为五根损坏，显现出来的内五尘是失真的，五识了别失真的五尘，就好像了别错了，结果是非量。</p><p>意识可以现量、比量和非量了别，了别范围宽广，虚法假法都能了别，能想像、幻想和比较、思惟，但结果有现量也有非量。意根的了别比较深密难知，对六尘的了别智慧确实是不够细致，祂不能把两个法互相比较着了别，因此没有比量；意根也不能想像，不能幻想，不能无根据的猜测，祂不能作这些非量了别，所以只能现量了别，但结果往往是非量。意根是用现量了别的方式了别，只对当前存在的法、实有的法进行了别，但是祂的认知总是错误的，不符合真理，把一切法都当作我和我所，实际上都不是我和我所，所以祂在了别结果上是非量。</p><p>真正的现量了别只有第八识，没有一丝比量和非量，了别的都是诸法真实的相貌，非六尘境界，非世俗界的相貌。意根所想都非真理，所以要在三大阿僧祇劫的修行中，逐渐让其认识真理，实证真理，使其妄想非想都变为真实的现量智慧，去掉其非法所执，归还一切法给真正的主人，不占有一切法，意根就改造完毕。从此以后，消除了一切负累，从一切法的束缚中彻底解脱出来，登上佛的宝座。这时意识的使命就结束了，不用再学习什么法，不用再熏染意根。</p><p>意根既然不能非量了别，那么意识的非量了别又是如何出现和延续下去的呢？某件事情由意根决定之后，意识具体执行，执行的时候就会采取非量的形式，意根就把意识了别的内容当作现量进行思量抉择。比如观想佛光照耀自己的色身是非量，观想成功以后，色身真的健康了。如果真把佛光观想出来了，佛真的放光照耀自己，观想佛光就是现量，色身健康也是现量。观想由意根抉择，意识实行。在观想当中，是意识主观的想像，定力深时，意识观想到哪里，意根随之了别到哪里，意根以意识观的内容为现前境界而加以了别，属于现量了别，意识的观就是非量的思惟想象，其结果如实现前的时候，都是现量境界。</p><p>十、七识心了别的三种方式</p><p>非量了别是指识心了别的结果是错误的不符合事实的，还是说识心了别的方式可以想象、幻想、猜测、预测？是指识心了别的方式可以想象、幻想、猜测、预测。那就只有意识才能有非量的了别方式，五识必须现量了别，意根必须现量了别，第八识都是现量了别，了别的都是现量境界，因为一切法都是第八识当下变现出来的，对于第八识来说都是现前存在的法，因此都是现量境界。</p><p>不是现量境界的法，第七识意根无法缘到，无法认知，所以要想让意根接受和认可什么法，必须是现量的法，有事实依据，非常真实，理路清晰，有章法可寻，所以意根断我见比意识断我见困难得多，不可以想一想琢磨琢磨就了事，必须深透的思惟观行，意根不断的考量取舍，直到理由充足，道理清晰，呈现出是事实，意根才能认可。</p><p>五识也是现量了别五尘境界，目前没有的五尘，五识无法去想像着了别，无法幻想出什么五尘境界。而意识所想象幻想的回忆的展望的任何法，都必须是由第八识呈现出影像，可以说是无中生有，都是第八识幻化和执持的，所以第八识了别的都是现量法，不用去非量比量了别什么法。</p><p>意识了别时都有三量：现量、比量和非量。现量了别，是了别当下现前存在的法，目前不存在的法不了知，不用去回忆和想象比较，对于法不作加工，当下是什么就是什么，但是七识了别的结果却有现量和非量两种。</p><p>十一、意根到底是不是非量的</p><p>从了别的智慧来看，错见错解错执为非量，那么意根就有非量，同时六个识都有非量，因为都有错见错解，智慧都不圆满。从了别的方式来看，意根是现量了别，不是非量了别。意根如果能有意识那样的非量了别智慧，学佛修行就容易多了，在世俗法中生活也容易多了，遇见佛法就容易正解，不用费力的修定参禅参究观行了，成佛也就不用三大阿僧祇劫了。至于用这么长时间修行成佛，就是因为意根智慧不足，需要长期熏染，摆事实讲道理。</p><p>意根对一切法的智慧认知确实是非量的，因为无明，错见错解以至于错执，所以学佛修行就是要破除意根的无明，纠正意根的一切颠倒见，无明断尽，全部是正见，一切错执也断尽，就成佛。纠正意根的错见，需要依赖意识的正解，意识要想正解，就要学习佛经，深刻正确理解佛经，然后正思惟，熏染意根，让意根随顺意识正解而正思量，从而让意根具有正见，导正从前的错知解以及错执。最初需要破除的意根无明，就是意根的我见，之后才能断尽意根的我执。再次需要破除的意根无明，就是不让祂把第八识出生的法当作我和我所，认第八识为法界主人而自己不是一切法的主人，之后才能断尽意根的法执。法执断尽，众生就成佛。</p><p>所以学佛从始至终，都是在修意根，目的是断除断尽意根的无明，完全回归自性，不再颠倒。在这其中，需要靠意识引导，所以意识首先要破除颠倒见，才能引导意根趣向解脱的正途，最终彻底大解脱。总之，修行意根才是正修，只修意识，不知主仆，是颠倒见，修不到位，不能得解脱。</p><p>十二、意根对法是用现量的方式了别</p><p>意根为什么必然是现量了别呢？因为意根刹那刹那依赖于第八识来了别，第八识变什么法就了别什么法，而第八识变现出来的都是现量的法，都是种子生成的法，都是实有的法，不是想像的法，因此意根就是现量了别。意根了别五识和意识传递过来的法，也是现量了别，因为五识传递过来的法意根要现量去了别，不会去比量和非量的了别，意识传递过来的法也是如此，对于意识比量和非量了别出来的法，传递到意根这里，意根都是作现量了别，不会再去比量和非量了别。因此说意根的了别必然是现量了别。意根会不会比较着了别呢？也会比较了别，但这种比较和意识的那种比量了别还是有很大区别的。</p><p>十三、非量起观能不能达到现观实证？</p><p>观行佛法一般都是从现量境界上起观，观察起来比较容易入手，从容易观察得到的现象境界入手，才能观行成功，容易证得到。但并非都是如此，观行也可以从非量想象思惟上起观，禅定力增强，慧力也增强了以后，就会渐渐的从非量过度到现量，一旦现量境界现前，非量就完全变成自己的现量境界，三昧境界一出现，观行成就，自己就证道了。这种证，禅定力和智慧力都很深，三昧境界不容易退失，身心世界改变非常大，非常受益。</p><p>比如说白骨观，最初肯定观察不到白骨，只能想像白骨，或者一步步从能观察到的皮肤肌肉起观，逐渐转到白骨上，一开始是意识非量观白骨，努力想象白骨。定慧增强以后，白骨就会自然现前，不用意识特意想，特意想不会是出现的，是意识实在不能想了，而已深入到意根心中，最后白骨由意根想起，自然现前。意识是想不到的，想去掉也去不掉，因为这已经不是意识境界了，意识把控不了。</p><p>其他种种的三昧境界都是由于功力深，由意根自然现起，不是意识境界，意识控制不了。比如念佛三昧成就时，行走坐卧佛号声不断，不念而念，不是意识念，而是意根念。意识想灭掉佛号都不可能，想控制佛号也不可能，想控制色身的禅定状态都不可能。从这方面来说，所有证果和明心以及种种悟道的三昧境界，都有定有慧，都不是意识境界，全部是由意根发起，意识只能随顺，无力操控。意识也可能感到莫名其妙，感到不可思议，其实意根知道是怎么回事，所以神情淡定，心开意解，处于甚深禅悦之中，其心无法描述。</p><p>再比如说观无量寿经中的十六观，从第二观开始到第十六观，都是非量部分，意识根本观察不了，因为意识根本见不到极乐世界以及极乐世界的地、水、树木等等，见不到阿弥佛陀以及观世音菩萨大势至菩萨，只能想象。这些想象是有次第和章法的。第一观就是铺垫，一是练习定力专注力，二是把心引向极乐世界之处，与极乐世界相应。第一观三昧境界出现之后，第二观完全是在第一观的基础之上进行观行的，虽然是非量，但如顺水推舟一样，水变成极乐世界的琉璃地。</p><p>这个三昧境界出现以后，定慧又增进，再后边的非量境界也会自然的水到渠成，变成自己的现量境界。一直到把阿弥陀佛的像、观世音菩萨大势至菩萨的像都观出来，所有的像都非常的细腻精致美妙无比。</p><p>这些三昧境界其实都不是意识心想象出来的，意识绝对想象不出来，无论如何也想象不出来，只是最初借助于意识想象一下罢了。甚深的禅定智慧一出现，意识就没有多大用处了，熏染完意根以后，几乎都靠意根，意根一动，三昧境界就出现，如来藏绝对给意根面子，绝对配合意根，所以主帅毕竟是主帅，远远强于参谋助手。</p><p>所以很多事情，意识感觉根本想像不出来，感觉都很困难，感觉没有下手处。这不要紧，你只要把意根熏染成功，剩下的事都交给意根，保证能完成一切意识想不到的事业，包括成佛这件天底下最大最大的事，意根最后都能任运自然的办得到。</p><p>十四、观想一般都是从非量到现量</p><p>在观想法门中，由于所观想的对象都不是现前能够观察得到的，并不是在眼前存在着的，是自己目前的智慧所达不到的境界，因此就不是现量境界，就需要依圣教想象思惟，或者幻想，或者比较相似的境界相，以达到自己现前能够缘得到见得到，从而成为自己的现量智慧境界。</p><p>所谓的观想，就是一边观一边想，想就有想象和幻想的含义，这就是采用了非量的方法作为入手处，定慧增长以后，非量的想象逐渐减少，现量的成分逐渐增多，以至于最后完全达到现量，所观想的对象活脱脱的呈现在自己的心中，或者叫作眼前，成为自己殊胜的独影境，自心处于三昧之中，觉明现前，心地光明涌现，定慧等持。</p><p>比如说白骨观，最开始观行自他，都看不见色身就是一堆白骨，而是活灵活现的肉体，白骨对于自己来说，就是非量。因此只能靠想象，依照佛陀的开示，脑中努力的构思和想象，把参考图比照在自己身上，或者是他人的身上。时间长了，定力增强，意识逐渐把意根熏染带动起来，意根对于白骨逐渐熟悉起来，不用意识努力加工，也知道白骨模样，心中就会逐渐出现白骨状。等到某一刹那，初禅定具足，观行慧也具足，缘也具足，白骨瞬间显现在心中，清清楚楚，历历在目，如在目前，挥之不去。这是纯粹的现量智慧境界了，得法眼净，断除身见我见，证得三果或四果。</p><p>现量境界根本不用观想，看眼前的一切不用想象，是什么就是什么。比如现量境界看石头就是石头，如果在石头上想看黄金，那就需要观想了，因为黄金不在眼前，是非量境界，需要转换为现量境界，那就去观想，观想成功了，石头就变黄金。</p><p>十五、意根的知与意识的知有区别</p><p>妄心的知性，一个是六识的知，一个是意根的知，由于禅定的深浅不同，知时有专注和散乱之别，知的内容就有深细广狭的不同。</p><p>见闻觉知性，是识种子加上心所法的共同功能作用。这些作用是刹那生灭变异的，犹如水流一样。无数水滴形成的水流在风力和惯性的作用下，忽急忽缓，忽强忽弱，忽断忽续。识种子形成的识心在心所法的作用下，其了别性忽强忽弱，忽急忽慢，忽细忽粗。水龙头一关闭，水滴不流出来，水流就消失；识种子不流注出来，识心就消失，其开关在哪里？</p><p>在知一切法的时候，反观自己的这些知，是意识的知，还是意根的知。意识知归知，不能改，做不到；意根知，马上就能做得到，能改正自己。佛法修到意识这里，仅仅是百尺竿头，还需更进一步，到达意根这里。如果所有的法都到达意根这里，就会马上成佛，不用再修了。</p><p>十六、一切法是意根先触先了别</p><p>意根在大脑，调控整个大脑神经系统以调控全身，脑神经一动，全身都动，六识随后就动了。识心无论在哪里，也都是无形无相的，没有具体处所，这里所说的意根在什么处，那是指意根的作用范围。</p><p>六识的动永远是在意根动之后出现，这就证明了一切法是意根先触先了别，随后才有六识出现，所以没有什么法是六识知而意根不知的，只是差别在于知的内容真实与否，清楚与否，粗细程度如何。比如说在商业活动中，竞争对手发布了新产品，总经理首先知道了这件事，但是不知道具体详情，就让所属部门调查此事，负责调查的人调查清楚之后，首先汇报给部门经理，部门经理再汇报给总经理，这样的话，总经理、部门经理和具体调查人员都知道这件事了，但是在调查人员没有汇报的时候，三个人所知道的内容是有一定差别的，就是汇报完之后，三个人所知道的内容还是有一定的差别，不可能完全一致。</p><p>十七、意根转识成智以后了别功能越来越强</p><p>十八界中眼识眼根对应的是色尘，耳识耳根对应的是声尘，鼻识鼻根对应的是香尘，舌识舌根对应的是味尘，身识身根对应的是触尘，意根意识对应的是法尘。前五根五识的活动，受意根的驱使和调控，不能自主。五蕴中的色蕴，就是十一色法：色声香味触法，眼根耳根鼻根舌根身根。</p><p>知十八界境界的知，是想蕴，想蕴的对相是相分。相分包括色声香味触法，包括心法。心法包括受想行识，也就是心的运行行相，就是心所法。比如意识对八个识的了别，对八个识的知，这时意识是见分，八个识的运行相貌是相分。</p><p>意识能了别八个识的运行行相，能了别八个识的心所法。意根有证自证分，能反观自己，了别自己。可是这个能力不够强大，转识成智以后，意根的智慧增强，证自证分功能就强大了一些。意根依意识可以了别八个识的运行行相，但能力不够强，转识成智以后，其了别性才越来越增强。</p><p>在转识成智之前，意根也有很多了别功能，只是意识没有转识成智的时候，观察不出来，所以有些人就说意根了别慧低劣。众生都是以意识的知为知，意识不知的就认为没有和不存在。</p><p>十八、意根同时了别整体法</p><p>整体法就是五尘与法尘的结合，缺一就不成法。意根既然是作主识，决定着六个识的生灭变异，那么意根就能了别五尘，不是仅仅了别法尘，能对五尘与法尘组成的和合境进行粗略的了别，所以意根才能促使六识都出生，共同了别任何一种尘境。对于和合六尘境界，意根的了别也可能有侧重点，比如对鲜花的了别，可能要着重了别色彩，而不是形状长短，这时眼识在意根的指挥下，会寻觅意根喜欢的色彩，意识随之一起寻觅色彩上相关的法尘。</p><p>意根首先接触和了别的是完整的尘境，不是五尘和法尘分开的尘境。所以不要说意根只了别法尘，而不了别五尘，若如此，五识凭何出生去了别五尘？由谁引导和指挥？意根了别的是整体尘境，包括五尘和五尘上的法尘，不是单独了别五尘，或者单独了别法尘。所以六识出生时，一定是五识与意识都同时出生共同了别尘境，不能分开。意根粗略了别，不能细致，五识能细致了别，意识更能细致了别。</p><p>意根除了不能了别最初出现的本质境，一切胜义根内外的六尘境界，意根都能了别。六识只能了别胜义根内的六尘境界。有神通的人，意识了别的境界比较广大，非胜义根里的尘境也能了别。</p><p>十九、意根能够了知到五阴身的不同状态</p><p>意根的了别慧有时候也不弱，在没有六识的各种情况下，睡着与昏迷的区别祂懂，睡着与身体不能用的区别祂懂，昏迷与要死亡的区别祂也懂。因为在睡着、昏迷、要死亡、无想定、灭尽定里，意根的情绪和表现都不同，所以意根还是有不微弱的了别智慧的，并且这个智慧还很大，祂的功能作用是完整而强大的，所以祂才能有资格成为作主识，领导着全部五阴身的一切活动。不是像有些人说的，意根什么也不是，什么功能都欠缺软弱，根本不是这样。</p><p>二十、意根的烦恼习气</p><p>问：我每次出差前，心里莫名其妙有种失落感，胸稍微有闷，结果一到那里，吃喝拉撒条件恶劣。所以我出差前就先察觉下自己内心，有莫名其妙失落感的，基本上就是去的地方吃住不好。用这个笨办法也能观察意根吧？</p><p>答：只要了解一下意根的功能体性，也能稍微了知到意根，知道意根大致的习气习性、烦恼以及清净性。意根太讲究享受，喜欢舒适，才不愿意接触条件比较差和恶劣的环境，所以在换环境之前，都会作意让意识知道，目的是让意识想办法解决这个问题。</p><p>意根如果不高兴，身体就有异样，意根高兴，身体也会有异样，因为身体由意根控制，表达意根的思想情绪。</p><p>二十一、意根有心念别人的意根也能知道</p><p>问：意根可以攀缘十方三世自己的过去现在未来身（或者与自己有缘的人事）吗？比如意根一作意，他人会收到信息吗？</p><p>答：众生都是以意识的知为知，意根所知的如果意识不知，就等于不知一样。意根依如来藏能知一切法，就是无法让意识知。只有修出四禅八定，意识才能知意根所知的内容，才叫作神通。自己的意根发出信息，对方的意根也能知道，就是对方的意识不知，那就是不知。除非意根用特殊方法让意识知了，那个人才能知。</p><p>意识转识成智以后，能知道一些意根所知的内容，能现前观察意根，就能了解意根一些心行和体性，有的人就说意根知的范围大了，内容多了。其实意根从前就能依如来藏知极多的法，意识感觉不到而已。其中意根对自己的知，意识不知道的时候，有些人就说意根不知自己，没有证自证分，这是歪曲事实。</p><p>二十二、意根的了别慧</p><p>现在要确立一个前提，就是说意根的了别慧劣，是在六尘境上来说的，并且是意根单独面对六尘境时所表现出来的。但意根的了别范围极广，了别方式又很奇特。六尘的细相由六识来了别，意根自然不需要有此功能，但意根能缘六识来了别六尘，也就是说六识的了别结果全部要归到意根这里，由意根作处理。意根只要有一法不知，六识的这部分了别功能就没有用，因为六识作不了主，了别六尘也是为意根所了别的，是为意根服务的，也是意根指使和同意的。六识只是意根了别六尘的工具，凡是六识了别的，意根都能了别到，六识的相分说到底就是意根的相分，不同的是，一个直接，一个间接。</p><p>二十三、没有六识时尘境对意根的影响</p><p>意根与法尘相触，之后才生意识了别法尘。是意根先触法尘先知法尘，意识后触后知。只不过意根知的没有意识清楚细致，知之后也没办法有所作为，必须依靠意识和五识才能有所作为。所以一切尘境都是意根先知，不用六识反馈。但是六识了别六尘比较详细，意识有很强的逻辑思惟观察能力，能带给意根很多建议，意根得到五识意识的反馈，能充分详细的了解尘境，再作以最终的抉择。所以尽管意根不能充分了别六尘境界，但也可以熏习，或者了解个大概，对于习惯的尘境，了别的可以清晰一些，这样对意根就有不知不觉的影响力，就可以存入种子。</p></div>"
},{
    "title": "第八章 意根的作主性",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  意根的作主性</strong></p><p>一、意根的作主性</p><p>意根是作主识，五阴十八界中一切事情大大小小，都是由意根作主指挥的，谁也代替不了意根，意识也不行。虽然意识的思惟判断可以引领意根的抉择，但是最终作主抉择的还是意根。如来藏也不能代替意根作抉择，不能指挥六识的身口意行，不能在世间法上作主。因为如来藏是无我性的，不能像意根那样有我的心行，没有我心就不会去作主。祂也不见有世间法，所见的都是非世间性质的法，因此无法对世间性质的法作主，也不能指挥造作世间法。</p><p>修行就是去除意根的无明，让祂知道五阴十八界不是我，知道真正的主人公是如来藏，一切法都是如来藏现起的虚假相，不是意根自己所有的。这样意根才能渐渐的断除我执和法执，执著断尽才成佛。</p><p>二、意根是作主识的理由</p><p>意根是任运而起的识心，恒常存在，除无余涅槃时都不灭，从无始劫以前一直存在着，没有能决定意根出生的法，也没有能决定意根灭去的法。既然意根的出生和灭亡没有能主宰祂的，意根的任运运转没有能主宰祂的，祂在七个识里就是王，是统领是首领。除此之外就没有能做统领和首领的了。</p><p>意识不能做统领和首领，因为意识每天都有生有灭，不能自主，祂的出生是有条件的，要有意根，要有法尘，意根要与法尘相触，意根要做决定造作身业语业，意识才能出生。既然如此，意识如何能够作主？连自己的出生和灭亡都作不了主，说了不算，控制不了，那祂如何有能力去控制意根和其他的法呢？祂如何能作主呢？</p><p>尤其是在意识没有出现的时候，在意识很微弱的时候，在意识不能思惟的时候，如何作主呢？睡觉和醒过来，这些事意识如何能作主？在半夜睡得很死的时候家中突然着火，突然出现异常，意识如何能作主醒过来逃跑？意识本身都不存在，还能作主吗？在昏迷不醒的时候，根本没有意识，意识如何作主挣扎着醒过来？植物人的时候，意识那么微弱，几乎都灭去了，如何作主决定翻身？祂连思惟都没有了，如何作主决定吃饭？如何决定是继续活着还是死了好？</p><p>意根虽然是无记识，不能自主和独自造作善恶业行，但这与是否有作主性没有关系。就像总统不能编程序，他可以作主指挥程序员编程序，他有这个权力，他不必事必躬亲，有手下专门办各种事情，他只管发布命令就行了。意根不能亲自造作身口业行，祂作主指挥六识造作就可以了，六识就是为意根服务的，六识若没有用，办不了事，意根就不决定让六识出生，那六识就没有用了。</p><p>三、五识了别的五尘直接传达给意根</p><p>五识所了别的信息，是直接传达给意根，还是传达给意识呢？是直接传达给意根，不是传达给意识。因为意根是五蕴六识的作主识，直接管理六识的生灭变异，意识不是作主识，不能决定五蕴五识的生灭变异。并且意识与五识是平行并列的识心，了别的五尘和法尘是平行并列的法，共同组成六尘境界，五尘和法尘缺一不能组成六尘。所以五识了别的五尘直接传达给意根，同时意识了别的法尘也与五识一起传达给意根，意根才能知道色法如何，才能知道声尘如何，才能知道味尘如何，否则无法知道任何一种尘境。</p><p>意根得到五识意识传达的信息，作自己的思考考虑权衡取舍，然后作出决定，下一步如何处理，那么六识就会再出生在意根想要处理的尘境上，也有主次之别，了别的也有轻重之别。</p><p>四、意根并非只能了别法尘的重大变化</p><p>六尘的了别都由意根作主，由意根说了算。有人说意根只能了别法尘有没有重大变化，事实却不是这样，比如说身边的人呼吸声非常小，自己却能一直听到，说明意根不管多大多小的法，变化不变化的法，都能了别到，并且能作主促使意识进行了别分别。</p><p>法尘有五种类型：色法尘、声法尘、香法尘、味法尘、触法尘。这五种类型的法尘，意根都能了别，否则意根又如何思量决定，让前五识中的哪一识现起？同一类的法尘，意根也能作大体上区分，比如说眼前突然出现好几个人，意根只对其中一人感兴趣，那么就作主决定了别这个人，意识就不会对其他人进行了别。</p><p>意根对五尘也能了别，比如说色彩是眼识所见的色，面前出现各色鲜花，意根只对紫色的花感兴趣，那么眼识只能分别挑选紫色的花，而不理会其它色彩的花。</p><p>五、意根作意才能出生意生身和化身</p><p>意生身和化身，确实是意根作意如来藏化现出来的，都有意根的执持作主作用。一个身有一套六识。但是意根却能统摄所有身，意根一动念，所有身就会收回到一个身中，再一动念，一身就会变出一切身。</p><p>不修意根，就没有那么多的功德性，意根的功能就受限制。不断除意根的烦恼，意根的功能作用就受限制。烦恼断尽，遮障消除，智慧开发显现出来，一切神通道力就会都出现了。</p><p>六、意生身的意是指什么</p><p>诸佛菩萨都有意生身，这个意是指作主识的意根。意根主人一旦动意动心，如来藏响应，就会化现出无数个化身，也叫作意生身。每个意生身都有一套五蕴身和六识。既然是意根作主动意出现的意生身，那么意生身化身就都属于这一个意根拥有的色身五蕴。而一个意根对应一个如来藏，每个化身都有一套八识。</p><p>凡夫没有禅定和智慧，意根无论如何动念动心动意，都不会有分身化身，意根无力故。意根一旦具足力量，意念即成一切法，意根无力，念什么都不成就。修定能强大意根的力量，修慧能强大意根的力量，什么也不修，意根就软弱无能。</p><p>修行一旦把意根的力量修足了，意根能力强大，就可以甩开助手和工具，不用六识和色身，单独就可以成就一切法。比如二禅定以上，不需要五识，四禅定以上，不需要色身的呼吸，不需要脉搏和心脏的跳动，输送给养。无想定里不需要意识，无色界的四空天不需要色身，其中无所有处天也不需要意识，灭尽定中只有自己和第八识就够了。俱解脱大阿罗汉和八地菩萨意根单独就可以了知一切法，不需要六识。</p><p>    七、临终受生由什么决定去处</p><p>众生到天堂、到地狱、到极乐世界，以及投胎，是意根带着第八识，还是第八识带着意根？如果是意根带着第八识，谁的意根愿意带着第八识去地狱，去三恶道受生？</p><p>临终受生的事，既由意根决定又不由意根决定；既由第八识决定也不由第八识决定；既由业力决定也不由业力决定。究竟由什么决定？如果由意根决定，意根不愿意去三恶道；如果由第八识决定，第八识不作主，不管事；如果由业力决定，业力比须弥山大，定去三恶道，这样修的善法就无用，佛菩萨也无奈；如果由愿力决定，很多人的愿力不足以抵抗业力。</p><p>事实上后世的去向，由综合因素决定，业力再加意根的念力和愿力。业力可以是固定的，也是不定的，修善法可以改变业力，清净愿力可以抵制一些业力，意根临终强大的念力，可以抵制业力。而意根的念力和愿力都可以通过修行熏陶佛法来培养，积累善业种子可以抵挡一部分业力，只要善业大于恶业，或者是临终善业缘熟，意根的念力强大，福德现前，就能保证往生善道。修行佛法熏染善心，就要严格持戒，身口意不要越矩。而足够的福德能抵挡恶缘的出现，让善业成熟起用。</p><p>八、随事取行、随识取行、随如取行的含义</p><p>行，是运行行为的意思，指识心的活动，尤其是指六识的识心活动，包括菩提行、菩萨行、修行。这句话省略掉了主语意根，因为取主要是作主识的意根来执取，之后才会有六识的行。六识应该有什么样的行，取决于意根有什么样的取。意根根据什么取呢？根据事相，根据六识的了别、思择、判断，根据业，根据菩提心，根据愿力等等。</p><p>最后那个如，一般是指真心自性，但凡夫众生的意根并不知道有真心自性，没有证悟的菩萨的意根也不知道真心自性是哪个，那就不会直接随顺真心的思择。但是当真心随顺业种而要现行出业行的时候，意根就会随顺业种，做抉择起思择，这也是意根的行。</p><p>一句话里把主语、谓语、宾语找到了，就知道主语想干什么，对象是什么。这三句话里，主语没有明说，但是有个谓语取字，后边有宾语行字，就会判断出主语是什么，只有作主识才能取法，才能取行抉择行。</p><p>取的前提条件是随事随识随如，再把事、识、如三个字的内涵弄清楚，就会知道意根所取的行是什么了。意根不管取着什么法，只要取了，后边就会有行。那就应该知道，意根抉择之后，都是六识来执行，六识的行就是五阴的身口意行，是善行还是恶行，是大行还是小行，是无我利他行，还是自私自利行。</p><p>取，既然是意根来执取，才有以后的法出现，我们就应该知道，一切法的出生、三界世间的存在、五阴身的轮回等等，都是意根执取的结果。那么三界法的假主人作主识必属意根无疑，意根的重要性远远超过了六识，意根不取法，不需要六识实现意根的取，六识就不会出生。</p><p>十二因缘当中，如果没有意根的取着，就不会有生死轮回。可见生死轮回，意根是主因。意根为什么要取着呢？因为无明。没有意根的无明，一切法都休废，都不存在。所以那么多学佛人，不在意根上用功着力，却只顾及意识；不管主人，却去随顺仆人，都是弄错了对象。其结果是什么？吃力不讨好，白费力气。到如今，证悟原理已经讲得很清楚透彻了，还有坚持只有意识断我见、明心就可以的人，那是什么智商？实在不敢恭维。修行人遇到问题，要学会如理思惟，有一定的逻辑思惟能力就是自己最大的财富，生生世世受用不尽。</p><p>九、把意根关闭就清净了</p><p>关闭心的关键在于意根，把意根关闭，处理好意根，就不攀缘杂境，六识就不会贪着受想行识，就能断除烦恼和执着。修行的关键就是意根，祂是万法的大闸门总开关。意根一止，万法寂静，无事无心，无心无境界，涅槃寂静。</p><p>十、意根接收到的信息是五识和意识共同传达的</p><p>问：当意根要了别某一个事物时，前五识是不是同时进行了别，并且五识所了别的信息是直接传达给意根的？意根接收到五识传达的信息，再决定是否深入了别，决定意识是否出生？</p><p>答：五尘与法尘合在一起，才是完整的尘境，而了别完整的尘境需要五识与五俱意识和合共同了别，不能分开了别。所以意根接收到的信息是五识和意识共同传达的。</p><p>众生在同一时间了别时，是五识意识同时运作的，比如说意根知道了面前有一个人，就想仔细看看这个人，眼识意识就在这个人色身的色尘上出生，了别这个人的相貌，同时耳识意识出生，了别这个人的声音，以及周围的声音。但是这时候鼻识也出现，也可以嗅到味尘，身识也可以存在，对气温和自己的身体有所感受。</p><p>五识以及五俱意识都存在，都有了别。但是了别一定有重点，因为意根的注意力有限，精力也有限，定力也有限，所以意根有个关注的重点，不是六尘全部都要重点关注，而是有主有次。主要的法就会重点特殊了别，次要的法轻轻一带就过。如果意根重点关注面前这个人，眼识耳识意识就会多些注意力了别，而周围的气味可以嗅不到，或者不在意，身体上的感受可能就忘了，或者感觉轻微。</p><p>为什么是意根的关注有轻重，六识的了别就会出现轻重不同的了别？因为五识意识的出现，是由意根决定的，重点和不重点的了别也是由意根决定的，而不是由意识决定的，更不是由五识决定的。意根着重关注什么法，六识就重点了别什么法，六识完全由意根调遣，注意力由意根分配。所以说六识是不由自主的，虽然意识在了别时，也有自己的主张，但是意识的主张和意见，意根可以采纳，也可以不采纳。</p><p>十一、中阴身是意根业力的体现</p><p>中阴身里也有六识，但这时候六识的作用力比较弱一些，没有在活着的人身上强大。因为中阴身是业力的体现，是业力最强的时候，意根与业力相应，作主性最突出，这时候的意识无法调控意根。再者，中阴身的色身与人身差别很大，依中阴身而有的意识其思惟分析判断功能就弱，对意根的牵制作用力弱，意根没有意识的牵制作用，业力习性就会完全表现出来。如果意根的烦恼习性没有得到转变，戒定慧都没有修习，不与善法相应，没有断除三缚结，一定会被烦恼结缚所缚而去三恶道受生。中阴身一切活动都以意根的业力为主，意根善则去善道受生，恶则去恶道受生，或者是随意根的愿力受生。</p><p>临命终时，五根的功能作用越来越弱，如来藏不再维持五根，四大微粒分解，六尘也运送不进来，出生意识的缘不具足，意识就不再出生。六尘传导的越来越少，六识就会越来越微弱，最后灭去，意根与如来藏就会离开，进入中阴身中。</p><p>十二、意根对六识有主导推动作用</p><p>本质境是共相分，是所有如来藏共同的相分，是实四大种子变造出来的，是色法里最真实的了。之后单个如来藏如镜现像，再通过见分把本质境显现出来成为外相分，意根才能缘到，这个像与本质境就有很大差别了。外相分六尘是带质境，如来藏依本质境变现出的影子是镜像。七识能缘到的永远只能是种子现行的结果，而不是种子本身。</p><p>意根能缘六尘境，而不是只能缘五尘上的法尘，第一因为意根是作主识，对于一切法的现起，意根都要先作主抉择，法才能生起；如果意根不能缘五尘，那么五识如何才能出生了别五尘？是谁作主让五识出生，并且了别特定的五尘？如果意根不决定了别五尘相，如来藏不可能出生眼识见色、耳识闻声等，眼根耳根等也不能趣境。就是说五识不是作主识，不能自己决定自己的出生和存在，必须有作主识的决定，五识才能出生见意根特定的五尘境。所以意根一定要缘五尘，才能知五尘相。</p><p>意根对六识有主导推动作用，意根不想了别六尘，六识就不能出生。睡着时内六尘不断的出现在胜义根里，只是意根不想了别，众生就不能醒过来。只要有五根存在，如来藏必依五根传导外六尘，在胜义根里变现内六尘。昏迷时也是这样，定中也是这样，否则就不能出定，不能醒过来。先有根和尘，后生识，有识一定有尘，但有尘不一定有识。</p><p>意根既能缘到前世的尸骨，能缘到西方极乐世界的那朵莲花，能缘到过去世的人事物，就应当说意根能缘到胜义根之外的六尘境。如果外六尘只有变现为胜义根里的内六尘时意根才能缘，那么胜义根之外的法有那么多不同的层次，意根都不能缘，意根就不是默容一切法的识了，这样有违佛陀圣教，与事实也不相符合。</p><p>如来藏缘本质境时，其见分能见本质境，之后就要变现同样的镜像，意根缘，意根依如来藏的见，而有自己的见性，也能见外六尘相，但是这个外六尘相是如来藏见过本质境以后又幻化出来的镜像，二者所见有所不同。意根如果想了别镜像，就会促使如来藏出生六识了别镜像，但六识所了别的是胜义根里如来藏再次变现的镜像，与外六尘的镜像有所不同了。</p><p>十三、五识的出生由谁决定</p><p>五根触五尘之后是否出生五识由什么决定？五根是固定不动的，如来藏把五尘分别出生在五根上，五根自然而然就与五尘相触了。但是触归触，是否了别，由意根决定。既然五根触五尘是否出生五识去了别五尘，由意根决定，那么意根就能大略的知道五尘是否重要，是否是自己感兴趣的，否则意根凭什么决定了别五尘，然后六识就出生去了别呢？</p><p>佛在楞严经中讲过修到一定时候六根可以互通互用，意根可以代替其它五根，并且举几个实例来证明，如大迦叶圆明了知不因心念、如憍梵波提异舌知味、舜若多神无身觉触。大迦叶知而不用心念，就是意识不念不知，不用意识了知，那就是用意根，意根代替了意识，也能代替五识。那么意根也就能具足五识的功能作用，具足意识的功能作用，能具体而详细的了别六尘境界。这就是说意根能见能触物体的具体色彩等等粗糙的五尘境界，能代替意识了别非常微细的法尘境界，能思考分析推理判断回忆等等。</p><p>如虚空藏菩萨没有身体却能感觉触尘，意根代替了身根和身识意识。那么意根就是无所不能的了，祂的功能就不受限制，六识的心所法，意根全部能具足，只有意根和第八识就可以维持生命体的存在，就可以大显神通，无事而不做。</p><p>憍梵波提为什么不用舌根就能知道味尘是什么呢？一般来说，味尘通过口腔里的外舌根神经传导到胜义根里的内舌根，根尘相触，意根决定了别时，舌识和意识才出生了别，如果意根不决定了别，忙于更重要的事情，舌识意识就不出生，饮食是什么味道就不知道。没有外舌根，就不能传导味尘到胜义根中的内舌根，就不会出生舌识意识。</p><p>可是尽管味尘不能传导到胜义根里，在如来藏触饮食里味尘本质境以后，如来藏就如镜现像般的表现出与本质境相同的味尘，这时意根随同如来藏就能见到这时的外味尘，一直到如来藏把外味尘传导到外舌根的时候，意根都能触到外味尘，能大略的粗略的领略一下外味尘。</p><p>这是普通人的意根，没有什么修证，只能这样。若是有大智慧和甚深禅定的阿罗汉和地上菩萨，意根就能比较细微的了别五尘和法尘，因为五尘上连同着法尘，外六尘意根都能触和了别。所以大修行人的意根可以知道六尘境界如何，与六识了别的一样，甚至比一般人的意识了别得更微细更究竟。同理，舜若多神无身觉触也是这样，意根代替了身根触触尘、了别触尘，代替了身识和意识。</p><p>法法都是相通的，当我们对佛法通达时，一切法义都是贯通在一起的，不是彼此不相干的东西。只是在佛法没有通达时，自己的认知有障碍，是自心局限了自心，是烦恼性障局限了自心，非是法义限制了自己，法义无心限制人明理。</p><p>十四、任何一个法出生都需要意根这个缘</p><p>如来藏在传导五尘的过程中，意根就先了别到了，随着如来藏近水楼台先得月，之后如来藏才把五尘传到外五根那里，如果五尘加法尘非常重要紧急，意根马上决定作出相应的反应，六识就会快速出生服从意根的指令做出反应，之后意识才明白是怎么回事。如果意根不先了别六尘五尘，遇到重大危险之事，怎么能够非常快速的采取应急措施呢？做出应激反应的时候，意识都不知道是怎么回事。可见意根不简单，我们不能小看了祂。意根遍缘十二处十八界，任何一个法出生都需要意根这个缘，如来藏没有意根这个缘就不能直接出生任何法，意根本身除外。六根包括眼根耳根鼻根舌根身根，这五根没有意根的缘，就不能出生；六尘包括色声香味触法，没有意根这个缘，如来藏也不能出生六尘。</p><p>身根等等五根最初是如何出生的？意根与如来藏一起投胎住胎，如来藏依业种输出四大种子，才逐渐形成了五根。五阴身出生以后，五根的任何情况，意根依如来藏全部都了知，如果情况特殊严重一点，意根没法处理，就会作主产生六识替意根了别和处理；如果不重要一般般，就不会产生六识，意根自己知道就好了。色声香味触法六尘境界也是，意根随如来藏都能接触到，如果想了别和处理，才会作主产生六识，如果不需要细了别和处理，就没有六识出生，六识就不知道境界。但是意根有攀缘的习气，即使有很多意识不想了别的法，意根还是要六识了别到，不管有用无用。</p><p>日常生活中出现的意外情况，是在意识了知之外，业力来的太快，来不及出生六识了别和处理，只好被动的承受。意根单独知道什么也没有用，祂无法单独处理，必须依靠六识来处理。</p><p>十五、意识与三业相应随意根而转</p><p>问：意根在未转依位是恒与有漏法相应的，而意根又是恒行识，所以第八识受意根牵连，永远只与有漏种相应，意识一现行，就与有漏种相应。所以只要意根未转为无漏，意识就不可能转为无漏吧？</p><p>答：意根如果没有断除烦恼，转识成智，与无漏法相应，意识就不能断除烦恼，与无漏法相应。这就证明了意根是作主识，六识依意根而现行，意根含藏了一切烦恼，而不是一部分烦恼。如果意根不断烦恼，意识就不能断烦恼，意根不破无明，意识就不能破无明，只能降伏和压伏。所以只在意识上修，还不究竟，还会毁坏，还会随意根转，尤其是后世。</p><p>意根虽然与有漏法相应，但也有善心所法，与善法相应，也操控六识造善业，也存善业种子，第八识也就含有善业种子，不只是有恶业有漏业种子。那么意识和五识现行出来以后，也会依意根造作善业，与善业种子相应，不仅与恶业种子有漏种子相应。意根和意识与三种业都相应，时而善时而恶，时而不善不恶。</p><p>十六、依止一个法相是由意根说了算</p><p>依止一个法相是由意根决定的，决定之后才能带着五阴六识就开始依止。意根为什么要作这个决定呢？因为祂见到了这个法相，认识了这个法相，知道这个法相是牢固可靠的，是可依止的，依止之后会有益处，这才决定依止。</p><p>所以意根如果不断我见，不明心证真的话，祂怎么能知道如来藏是真可依止之处？祂怎么能作主决定一点点的依止如来藏而造作五阴身的身口意行？所以只意识证果和明心，就不能降伏身心世界，烦恼还会越来越盛，因为觉得是有所得了，增加了一个我，有我必然有烦恼。只有意根也同时证果明心，身心才能处于三昧之中，降伏烦恼，使得烦恼越来越轻微，最后得以断除。</p><p>十七、依止真如自性由意根作主</p><p>所谓的依止是依靠的意思，就像要依靠一颗大树下，因为知道大树牢固，能遮风避雨，能避免阳光的热晒，能让身体歇息，同时知道大树所在之处，才能走向大树，倚树而坐或卧；也就像依靠大山而活，因为知道大山当中有种种山珍野味可食，有树木可建房屋，有木柴可烧火做饭，也知道大山所在地形地势海拔等等信息，才能投奔大山，安置家业。</p><p>任何事情的操作都由意根作主，意根是总指挥和调控者，当然依止真如这个法也是如此，没有例外。那么在依止真如之前，意根就要了解真如之性相，知真如之所在，然后才能依真如之性，调整自己的身心，心行趣向于真如，剔除种种染污，逐渐转于清净无为。这样的话，意根必须证得真如自性，才能谈得到依止依靠趣向，如果不证真如，就不能趣向真如，犹如盲人不见日。所以意识证果意识明心仍然与盲人无异，无法趣向无为，无法心空。</p></div>"
},{
    "title": "第九章 意根与禅定",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  意根与禅定</strong></p><p>一、如何修三昧定境</p><p>观察佛像十秒钟，然后再看白色的墙面，就会出现佛像的影像，没有定力，一会儿影像就消失不见了。这个境界，是如何出现的？这是视觉暂留现象，是眼识意识的记忆功能，还没有深入到意根，意根没有记住，如果意根记住就会长期停留这种影像。如果眼识意识观察久了，就会影响意根，意根记住以后，就会随时随地出现影像，这就是三昧定境。以眼识为主的视觉暂留时间短，以意识为主的视觉暂留时间要长，而且闭眼之后再睁眼还能看到。</p><p>过目不忘是怎么回事？意识单独记忆的内容，用不了多长时间就忘记了，而意根记忆的东西很难忘记，甚至能不自觉的想起来，再甚至有可能挥之不去。过目不忘，那是意根的定深，以至于瞬间记忆很牢固，如果意根定浅，记忆的东西忘记的也快。所以所有的定境都由意根引发，意识不能引发长久的定境，只能非常短暂的出现某种境界。我们要想成就各种三昧，一定要深入到意根，由意根来引发境界。</p><p>如果经常观察同样的佛像，就会让意根记住，从而出现禅定，看看眼前是否总能出现那个佛像的影像？如果能，那我们会不会修定？会不会修念佛三昧？会不会修白骨观？会不会修观无量寿经？观想西方极乐世界，意识勤加练习，意根达到不忘，等到命终的时候，不管什么境界，内心只要一想极乐世界，意根就能安住在极乐世界，极乐世界就会现前，必定往生。精进修行的时候谁精进比较有效果？意根精进有效果，意根精进才是真精进。如果想让极乐世界的境像现前，那就让意根念佛，意根与意识一起观想极乐世界。</p><p>二、断我见必须有禅定的配合</p><p>断我见的模式，佛早已建立好了，哪种模式也离不开禅定力，都是在禅定中思惟观行的。即使在佛讲法时，也要求弟子听法时要定心听闻，并且要会思惟。佛都是说：谛听，谛听，善思念之。那时候的人由于心思单纯，都有不同程度的禅定，一边听法一边能思惟，都会思惟观行，所以证果显得很容易。</p><p>我们如今的人福报不太好了，心思不单纯，杂思乱想，没有禅定，由于环境条件限制，修不好禅定，以至于讲的法很细致了，还是不会思惟观行，还是不起疑情。如果有一定的禅定，看着文字就能起观行，疑情就会出现，就会越来越疑，道心很强的人就要放弃一些世俗事，非要把疑情解决了不可。没有禅定，就无法观行，没法深入到意根里，意根使不上力，答案现现成成的摆在那里，也得不到。</p><p>佛讲的大念住经，里面的方法既有禅定又有智慧，定慧结合起来，断我见是最快的。那些思惟方式佛讲得很清楚，也很细，只要用功按照那些方法修，断我见是不太难的。大念住经是很好的修行方法，适应所有人等，就是很多人不肯下功夫。</p><p>三、意根也可以有禅定</p><p>问：意根是否时时刻刻都攀缘一切诸法，从来不会专注于一法？</p><p>答：意根确实有攀缘一切法的功能和体性，但是祂未必能够同时攀缘全部法，也未必愿意同时攀缘全部法，也未必有精力同时攀缘全部法。意根非常散乱同时攀缘很多法时，如果意识不愿意跟随祂去攀缘，意根知道自己这样去胡乱攀缘是没有用的，于是就不去攀缘意识不感兴趣的法了，就会逐渐安定下来，精力逐渐集中起来，从而降伏了自己的散乱心，出现了禅定。这就是修定的结果，是意识智慧熏染的结果，是意识牵制的结果。</p><p>所以意根是可以有禅定的，是能够降伏自己的广泛攀缘性的，其心是能够越来越集中的，以至于越来越专注于某些法和某方面的法。其注意力有所侧重和偏重，所缘法有所选择，意根就有定了。意根对于自己非常感兴趣的事情，不用意识的牵制，自然而然就能集中精力专注起来，六识就会被意根牵制专注于意根感兴趣的事情上。所以要想修好禅定，意识就要选择一些意根非常感兴趣的法让意根去缘，这样意根专注下来以后，禅定就会出现，三昧就能很快成就了。</p><p>四、六根功能可以转移</p><p>聋哑人眼根特灵敏；如果语言功能差，动手能力就会强；嘴能说的往往不能做；畜生思惟能力差，直觉特灵敏。这些现象说明了什么？大脑超常的人，有特殊才能的人，有个共同特点，比如画家音乐家，各种艺术家，还有科学家，凡是能成为各种家的人，他们共同特点就是，自身有某种某些缺陷，与世俗人不一样，不是生理缺陷，就是心理缺陷，在世俗生活中有点无所适从，与世俗人不调和，做事常常违背常规常理。这是为什么呢？</p><p>一个总开关控制着七个水龙头，关闭一个水龙头，其它六个水龙头水流增大；关闭两个水龙头，其它五个水流又增大了；关闭三个水龙头，其它四个水流再增大，关闭六个水龙头，剩下一个水龙头，水流是最大的，其势凶猛。</p><p>六根也是此理，关闭眼根，其它五根功能加大；再关闭耳根，其它四根功能加大；再关闭舌根和鼻根，身根和意根功能加大；最后再关闭身根，意根功能最大。意根再关闭，就涅槃，没有水流了。修定就是让意根减少所缘的法，心念集中，禅定就会出现，心力就强，就表现出某方面的特长和天才。</p><p>五、闭目为什么能养神</p><p>神，就是心识。一是指眼识，二是指意识，三是指意根。第八识不用养，既不消耗能量，永远也不累。</p><p>意根能累吗？意根无始劫以来与第八识一样从来没有休息过，虽然不总是任劳任怨，但执著一切法，没有不操心的。直到什么时候才不愿意操心了呢？当意根认识到有些法真的是得不到的，才不得不放弃，不操心了。意根也有腻烦厌烦和疲累的时候，祂不能一以贯之，至始至终。所以意根也需要休息，转移注意力到比较轻松愉快的事情上，烦恼的事就不去攀缘了。攀缘太多的时候，背不动了，也知道暂时放下。</p><p>最需要养的是意识，因为意识一动，需要消耗一些营养物质，尤其是大脑细胞。当物质能量不足时，意识就会感觉到疲累。思考问题比较多的时候，意识的思路就跟不上了，这时就需要休息，不再了别、分别、辨别、思虑。</p><p>眼识是否需要养呢？眼睛视物比较多的时候，眼睛会疲劳酸乏疼痛，视力下降，视物不清，头昏脑涨等等。但是，这不是眼识的问题，而是眼根长期固定在一物上不动，会引起神经疲劳。而眼根的物质色法属于身根一部分，眼根出现问题，就是身根的问题，感觉疲劳和酸痛，这是触觉，是身识分辨的内容。</p><p>由于眼根视物时间长，需要消耗的能量也多，意根的注意力和意识的注意力都转移到一物上，需要消耗大脑细胞，也会引起疲劳和疲怠。如果眼神经一直绷紧不会有问题，那么眼识视物多长时间都没关系。眼神经通肝经，长期视物，肝经疲劳受损，肝脏会出问题。肝脏出问题，会影响意识的思惟了别。色身影响识心，识心也影响色身，身心相倚。</p><p>其实识心永远没有问题，问题在于身体的物质能量是否能供应充足。识心正常运行，需要六尘正常出现，大脑细胞能正常活动。物质色法消耗过多，或者供应不足，识心运行就会受到影响，就不能正常起了别作用了。</p><p>闭目养神，也可以说调节神经系统活动，不让神经系统过多过量的活动，尤其是不要一个劲一个方向的强直性活动，则身体不受损伤。</p><p>六、意根有禅定时观行就能专注</p><p>每天都作观行，对于意识和意根都是一种智慧的提升，当然禅定也会得到增强。一开始观行的时候，非量比量成分多一些，到最后现量的成分就会越来越多，心里越来越能认可五蕴世间的虚妄不实。观行都有一定的过程，定力增强的同时观行智慧也会增强，智慧增强就会促使禅定增强。对于观行出来的法，意识确认比较容易，意根不容易。意识单独确认的没有一点身心上的变化，意根确认什么程度，就有什么程度的转变。</p><p>意根如果能一心在观行上用功，对其它的都不感兴趣，不太执身也不太执法，就会出现禅定，身体上就会有轻安、舒适等等现象。只要心比较专注有禅定，意识所思惟观察的法义，就容易被意根接纳，意根一接纳下来就容易观察和领悟，就有思想境界上的变化，就会出现各种禅定，就是三昧境界。</p><p>七、意根能否缘于一法</p><p>意根不可能只缘于一法二法，但是祂所缘的法要有重点和侧重面，有的在意有的不在意，有的用心有的不用心，这样就能把重点突出出来，让六识了别重点部分，这就是定。</p><p>意识也不可能只缘一法，很多时候要超过二法三法等等，比如意识处于念佛三昧之中，重点缘于佛号和佛念，可是意识也知道白天黑夜，也知道行走坐卧，也知道东南西北，也知道周围情况，也知道躲避什么，不是像傻子一样除了念佛一无所知，但是意识就处于三昧定中。眼识处于定中，只关注眼前一个事物，但是眼识也知道光明和黑暗等等。</p><p>这说明，定不是只缘一法才称为定，注意力集中，专注力足够，就是定的状态。有一些定力强的人专注力强，同时做几件事都能处理好，不往无用之处分神。</p><p>意根虽然有遍缘性，但是不一定都要同时缘一切法所有法，祂精力不足就要有一定的选择性，目前当下祂觉得重要有意义的就去缘，习惯于缘的法，由于惯性作用一定要缘，但不一定分配过去多少精力和注意力，心里只要轻轻一带就行了。比如说我有权利管理五百人，但是在同一时间，我未必有精力和兴趣五百人都照顾到，每一时间，都会有所选择。意根也是如此，权利归权利，能力归能力，兴趣归兴趣。因为意根的禅定力精力不足，智慧力也不足。</p><p>而第八识就不一样了，第八识那种无有比的楞严大定，那种无上的大智慧，同一时间既能遍缘一切法，也能同一时间处理一切法，不论远近和古今，没有时空隔碍的都能加持和处理。所以第八识有定有慧，绝非七识的定慧所能比，也超乎地前菩萨的想像。</p><p>八、有定的人意根才有定心所法</p><p>意根与定心所法相应，但是极大多数人的意根并没有定，只有修出了禅定的人，其意根才有定心所，没有禅定的人，意根就没有定心所。如果说有禅定的人意根也没有定心所，那他的六识如何能定得住？</p><p>比如说意根对面前的紫罗兰感兴趣，让六识欣赏，同时又对旁边的鸟叫感兴趣，六识就要分散注意力去听鸟叫，一会意根又对一个人感兴趣，六识就要分散注意力去观察品评那个人，这样的话，六识如何能有定？六识的定，就是因为意根定的结果，意根不定，六识就定不了。</p><p>九、意根减少攀缘就有定</p><p>当意识在定中的时候，意识真的是专注在一个法上吗？比如念佛时，意识能只专注在佛号上，不知道其他事情吗？如果这样这个人就无法工作，也不知道天昏地暗了，东南西北也不知道了。即使在静坐中入定，也无法只有一个念，除了念佛之外，还知道自己在静坐，还知道白天晚上，这就不是一个念了，但也叫作入定。</p><p>所以意根也有定，意根定的时候，接触的所有的法，不一定都要去受想思，而是有选择性的对某少部分法受想思，这就是定了。如果意根对所有的法都要受想思，那么意识就要出生对一切法都了别，这样不仅意识没有定要崩溃，意根也受不了。</p><p>比如面前有一百个人，意根都能接触到，如果意根同时对一百个人都要受想思，谁的意根有这样大的精力？意识就更忙不过来了。如果有人有这样的本事，那就同时交给他一百件事让他完成，一个人的工作量就能顶得上一百个人的工作量，此人就是天才，实际上这是不可能的。　</p><p>十、意识扭转意根的攀缘散乱才能有定</p><p>意识的散乱，独头意识的出现，是由意根引发出来的；如果意根不散乱，意识根本散乱不起来。意根如果不惦念过去的人事，意识不可能想起从前的人事。如何降伏意根的散乱攀缘呢？意识要先有觉悟先明理，并且能检查出意根都在哪些方面有攀缘的习气，喜好攀缘什么法，就分析这些法的生灭变异无常性，让意根知道妄想也没有什么用，处处攀缘如何不好，然后经常牵引意根缘于一法，以扭转意根的散乱习气，意根慢慢就不再攀缘了，妄想就会减少，心就定下来了。</p><p>十一、意根抉择到意识出生的时间极其短暂</p><p>一刹那间有81000个识种子生灭过去了，一弹指间有90个刹那，一弹指最多有一秒钟时间。意根触法尘之后，让意识再出生，接触法尘、了别法尘，需要的时间0.01秒都不能有，半个刹那时间也不能有。这么短的时间，估计仪器测量不出来，只有在非常非常深的禅定中，意识非常细致，才能感觉出来，八地菩萨之前根本没有办法感知到。所以说有极多的事实真相，没有甚深禅定是不能证得的，不修禅定想证得什么佛法，那是不可能的，没有禅定都是靠推理猜测臆想，推理分析出来的没有什么功德受用，不能断疑。</p><p>十二、禅定能促使意根专心思量</p><p>为什么打坐的时候，容易思考明白，意根容易受熏染？因为打坐时，意识静下来了，不再妄想，就很少出现非量比量了别，现量的成分居多，这样容易熏染意根，也会带动意根一起思量法义，容易明理，理通的快。</p><p>十三、禅定是实证的前提条件</p><p>意根慧浅，是因为意根所缘的法太广泛，无法专心细致的作了别和思量，加之自身烦恼习气重，处处攀缘不能专注。但在禅定状态下，意根可以最大程度的保持专注从而增加思量的慧力，意识也容易现量观察，意根认同意识现量观察结论的几率也高，更容易导致实证结果的出现。</p><p>综上所述，实证一定是诸多因素促成的产物，包括禅定条件，意识的现量观察，意根保持专注，意根思量有力才能最后确认。在以上诸多因素中，禅定则是前提条件。没有禅定，意识不易现量观察，意根不易专注，无法专心思量，也不会轻易认同意识的观察。所以在实证过程中，禅定起着至关重要的作用。禅定的前提条件是守戒，心不乱动，守好戒的前提条件是有福德，菩萨六度都不能少。</p><p>十四、有禅定意根才能自然证果</p><p>问：大小乘之所有证果，必然是六、七二识同转的，若只是意识明理，末那未转，顶多是思慧成就，而不能说是实证。可是小乘佛法如《四念处经》，世尊所教种种观行法门，明显是意识所修，并未说到意根末那识，请问意根在证果时是如何起用的？</p><p>答：世尊在讲法时虽然没有明确指出意根也应该参与修行观行之中，但是所有的修行都包括意根的修行，只不过当人没有禅定时，修行就只落在意识层面，有禅定时必然会落到意根那里，即使不懂意根，不了解意根的体性，也会自然而然的落实到意根那里。就像所有众生都不知道有眼识，但是所有众生都一直在用眼识，二者是一个道理。</p><p>世尊在教导四念处观的时候，众生只要老老实实依这个教法修行，就会出现禅定，只要有禅定，观行就会落实到意根那里，意根也与意识一起观行和证果，之后意根就会改变身心世界，处于法眼净的三昧之中。如果不老老实实按照世尊所教而修行，抱着投机取巧的心理，肯定不会出现禅定，意根也不会被熏染到，不会随之一起观行，就不会证果，不会出现法眼净的三昧境界。</p><p>十五、怎么才能证明意根不攀缘了？</p><p>意根不攀缘，心就在定中。只要有定，就说明意根攀缘减弱。二禅以上只有意识的微弱了别，说明意根攀缘的更少了。意识功能减少和消失，都说明意根不再凭借意识去了别法尘，意根就没有多少攀缘性了。没有意识的定是无想定，意识的功能心所法减少是非想非非想定，而意根连自身的功能心所法都减少了是灭尽定，意根彻彻底底不攀缘了，就会入无余涅槃。</p></div>"
},{
    "title": "第十章 意根与无记",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  意根与无记</strong></p><p>一、无记是指什么</p><p>楞严经中佛说，众生的五蕴世间没有出现时，只有意根与如来藏处于杳杳冥冥的状态，浑浑噩噩，不知天高和地厚。意根愚痴无明，但因为没有六识五蕴的配合，意根无法造作什么业行，也就没有善恶业以及善恶业的果报。这就是意根的无记性。</p><p>在众生的五蕴身出现的时候，意根即使有善恶心行，有不善不恶的心行，在六根不能互通互用的时候，祂自身也无法造作什么，只能通过六识来实现自己的想法，满足自己的心行。众生之所以出现了果报，即是因为意根通过六识的身口意行实现了自己的心行，有身口意行为的记录，存下了业种，业种输送出来才有果报。</p><p>在六识的不善不恶的无记业当中，如果出生喜乐心、贪爱心，就是生死结缚，就会被缚在生死中，这就是果报。即使六识没有贪爱和嗔恚，其不善不恶的无记业也要作为业种存入如来藏中，只要有业种就有果报。佛菩萨到此世间来在造作的善业和无记业中，没有贪爱没有喜乐心，因此就没有生死结缚，不会系缚佛菩萨在六道生死中。同样做事，有人有心，有人无心，果报就不同。</p><p>二、无记是什么意思</p><p>无记的心行，是不属于善业也不属于恶业的心行，这些心行都不能记入善业里也不能记入恶业里。比如说第八识的一切心行，不能划入善恶业里，不管第八识有什么心行，都不存入业种里，没有果报。</p><p>那么意根的心行是否能存入业种，有善恶果报呢？楞严经中讲无始劫以前，生命体中只有第八识和意根两个识，意根虽然有无明，也有善恶心所法，但是意根的心行无法表现出来，祂自己无法造作业行，没有业种，也就没有什么果报，善恶果报都没有。实际上意根的无明和心念力就是因，果就是最终三界世间和五阴身的产生，从此就有了生死轮回。意根因为无明，有了心念，这个就是业行，之后就有了果报，果报就是三界器世间的出现，五阴身的产生，从此就有了生死苦报。 </p><p>由于意根向外攀缘，第八识出生了器世间和六识五蕴身，这才有了六识的身口意业行，第八识就开始记录业行，存入业种，五蕴身有了善恶果报。但是六识这些业行，完全是受意根的无明和善恶心行的指使和影响。意根有善恶心所法，就有善恶心行，能指使六识造作善恶业，本身却无法造作身口业行，只有意行。</p><p>六识的所有心行，都属于业行，都会存入业种，都有果报，包括善的心行、恶的心行以及不善不恶的心行。意根的心行能影响六识的行为，是善恶业的主导和主要因素，是造业的主人，所以真正受报的还是意根。表面上看确实是六识受报，实质是意根受报，六识可以灭去，可以换新的，没有六识的情况也是果报身，比如睡着时、死亡时、入胎时、无想定时、昏迷时和灭尽定时，都是由意根单独受报。</p><p>三、意根是否是无记性的</p><p>无记性是指心性不归于善也不归于恶，属于不善不恶性质的。因为意根是作主识，主宰着众生的身口意行，如果意根没有善性，众生的身口意就不能有善行，世界上也就没有善人，天界就不存在了，众生学佛也不能变为善人，学佛就没有用。如果意根没有恶性，就不会指挥六识造作身口意恶行，世界上也就没有恶人，世间也就没有三恶道了。事实上不是这样，六道轮回就是因为意根有善恶心行，促使六识造作善恶行，世界上才有善人和恶人，众生才在善道恶道里生死流转。</p><p>如果意根不善也不恶，意根就没有烦恼心所法，也没有善十一心所法，那么众生本没有烦恼，学佛就不需要断除烦恼了；众生本不善，学佛也不能成为善人以至于成佛。如果意根没有善恶性，只是无记性，世界上的善人都是由不善不恶的中性人变为善人的，世界上的恶人都是由中性人变为恶人的，那就没有天生的善人和恶人，都是由后天意识熏染善恶法变成的，然而这是不可能的。</p><p>况且这样的善人就是意识善的假善人和意识恶的假恶人，没有真正的善人和恶人。如果意识无论怎样受到善恶环境的熏染变为善恶，意根也不会受到意识的熏染变为善恶，那就没有善恶人。因为意根不与善恶心所法相应，没有善恶，是中性的，也永远是中性的，那么众生无论怎样修行都不能成佛，不能存下善恶业种子，也无法在六道里生死轮转。</p><p>这样的话，意根就不是作主识了，五蕴活动不由意根说了算，意根意识各自为政，五蕴就要乱套了。意根作主造一种无记业，而意识作主造善恶业，意根想上东，而意识想上西，最终色身往哪里去？意识想学佛，意根不想学佛，五阴身要如何造作，一分为二不成？精神分裂人格分裂，都是意识与意根严重不一致不协调造成的，互相僵持不下，意根苦恼万端，几乎要崩溃了。如果意识意根各有业种，就有两套业果报，意识上天堂，意根入地狱，最终五阴身是上天堂还是入地狱？所以说意根有善恶性，有善恶心所法，不仅是无记性。</p><p>四、记忆的种子通过意根存入如来藏</p><p>记忆的内容，以及一切法都会成为种子存在如来藏里，不能存在大脑里。种子是无形无相的，大脑是有形有相的物质色法，是能够毁灭的，二者不相容。如果记忆的内容都存在大脑里，大脑毁灭了，后世这些内容就会全部消失，那就没有因果了。今世脑细胞生灭变异，记忆的内容也会生灭变异，那过后就不能回忆得出来了。</p><p>第八识没有记忆记持的功能，五识有微弱的记持功能，意识和意根都有记忆记持的功能，但只有意识才能回忆。意根攀缘到过去的法尘，叫作忆持，不叫作回忆，回忆比较微细，意根无法微细了别，辨别不了细节。</p><p>五、失忆是意识忘记不是意根忘记</p><p>有一种失忆的人，还有一种老年帕金森患者，忘记了自己是谁，以及自己与周围一切人事的关系。意识的问题与胜义根有关，意根是否会忘记呢？患失忆症的人，如果病治好了，就会恢复记忆，说明意根始终了知过去的一切法。失忆的人遇见一些人事，也会迷迷糊糊感觉好像熟悉似的，说明意根了知。失忆的人努力想回忆，想恢复记忆，就是意根的想促使意识努力想办法。</p></div>"
},{
    "title": "第十一章 意根与梦境",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  意根与梦境</strong></p><p> 一、梦里有五识吗？</p><p>梦里的境界都是独影境，都是法尘境，没有相对比较实在的性境五尘，因为缺少五尘，独影境就缺失不全，独头意识单独了别的法尘就不是很清晰的，是大略的，显得很是虚幻不实。所以意识和意根就不能了别得很清楚，错误在所难免，有时候错误还特别多特别大，往往是张冠李戴。梦里以意根了别为主导，意根对于不熟悉的境界了别智慧不强，没有准确的判断力，了别的法就不清不楚。如果意根有定有慧，或者是对于很熟悉的境界，才可以了别的八九不离十。</p><p>如果梦里有五尘境，五识就会参与了别，那与清醒时就没有差别了，也就没有梦境没有睡眠了。梦里看见血流成河，感觉血是红色的，本来应该是眼识了别红色，可是梦里没有眼识，是谁知道是红色的？楞严经里说，修到一定程度，意根能代替六识的功能作用，一般在梦里意根也可以代替五识的功能作用，那么五识所应该了别的五尘，意根也缘，也有一些粗略的了别，知道流的是红色的血。而有的人意根在梦中，就不知道血或者火是红色的。意根有时候知道五尘境是什么，有时候就不知道；有时候梦里好像有色彩，比如红色的火光，有时候就没有色彩，明明应该是色彩非常鲜艳的梦，可是梦里就没有色彩。</p><p>二、做梦时为什么不知道自己在做梦</p><p>众生之所以做梦，是因为意根不断攀缘执著某些法，第八识随顺就出生了梦境。梦境属于独影境，意识心单独了别，没有五识的配合。因为独影境现起所需要的缘比较少，意根只要执著惦记某些法，独影境就能出现，然后意根与独影境相触，第八识就出生意识了别独影境。但是在梦中意识思惟和判断力不足，分别力比较弱，识别的势力不太强盛，多是被动的被梦境牵着走，而不知道这是在做梦；同时意识的反观力也比较弱，智慧性差，也不知道自己的活动是在梦中，是在了别梦里的独影境，因此就不知道自己在梦中，是在做梦。</p><p>如果一个人比较有修行，意根受到了佛法和善法的有效熏染，就不会指挥意识造作恶业，能控制意识的行为。那么这个人在梦里在中阴身里，意根也有可能控制六识不造作恶业，不随恶缘而现业行，能主导六识行善，造善业。这样心善就与善道相应，托生善道的几率比较大，而且意识也懂得选择善道，就有可能托生善处。</p><p>三、意根与梦境</p><p>意根分不清梦里梦外，有时候把梦境当作现实，有时候把现实当作梦境。睡着的时候，意根是清醒的，依如来藏能了别一切法。看见有人过来，觉得这件事很重要，于是意识出来也了别到，意根知道自己在睡觉，给意识错觉，意识就认为是在梦里，其实梦里梦外都没有搞清楚，就起床做防备措施。主要原因还是意根害怕了，于是警觉意识，害怕时心就不分别是梦里梦外了。</p><p>四、预知梦</p><p>预知梦是意根提前让意识知道以后要发生的事情，说明意根能知未来还没有发生的事情，能去至未来。为什么如此呢？因为如来藏根据业种，能知过去现在未来三界世间事，意根依如来藏所见的法，起自己的见，如来藏能见一切法，意根就能见一切法，只是二者所见的法本质有所不同。因为一切法都是虚幻的，所以才神奇，其实都是空的，没有什么好神奇的。</p><p>五、梦里梦外的独头意识</p><p>做梦时是独头意识在梦里了知梦境，醒过来时，是五俱意识先醒过来，然后五识出现。回忆梦境时，是独头意识回忆，与梦里的独头意识有一定的差别，再加之记忆力的问题，导致独头意识并不能完全清楚的回忆出梦境。</p><p>六、意根了别梦里梦外一切法</p><p>如果做梦时梦里的境界与梦外的境界能挂钩，就说明梦里梦外一切法意根都能了别到，并且是意根先了别了梦外现实世界的情境，比较关注那个情境，就把梦外的境界弄成了梦境，让意识也参与其中了别。</p><p>人虽然睡着六识灭了，但意根仍然能依如来藏了别一切法，外面录音机里讲法的声音，意根也能听得见，但是祂分辨和了别的智慧不是那么强，又对讲法感兴趣，就做梦让意识了别梦境里的讲法。可是意根对于梦外境界了别的不是很清楚，梦境虽然和外境有关联，但是还有一些差别，说明很多境界意根没有弄明白。</p><p>由此我们就知道，意根不管是醒着的时候还是睡着的时候，六尘境界中的一切法祂都知道，关键是祂了知的细致和准确程度如何。如果是无始劫以来，意根非常非常熟悉的事情，了别就非常的快也非常的准；如果不是很熟悉的事情，了别的就慢也不准，错误比较多，弄出来的梦境和现实就有一定的差别。</p><p>我在刚接触佛法的时候，有一天中午家里播放着一个有关超度方面的录像，是几个密宗的法师给西藏地区成群宰待的牛做超度，那些牛数量非常多，前边超度的场面非常隆重，后边杀牛的场面非常凄惨，血流成河，那些牛很恐惧叫的也凄惨。录像大概放了半个小时至一个小时的时间，由于我还不是完全信佛，所以放录像带时睡着了，一边睡一边能听见播放录像的声音，然后梦境就出现了，做的梦和外面录像带放的内容一模一样，录像放到哪里，做梦就梦到哪里，中间也想醒过来，可就是醒不来，也知道录像的内容，梦里呈现的都是血腥的场面，还有牛的惨叫声，有的牛都甚至都给人跪下来了。</p><p>这个梦境完全是由意根导出来的，虽然睡着了六识不能见，意根对这件事情却很感兴趣，就弄出梦来了，由外面的带质境影像转换成独影境，让意识也了别，里外的境界意根同时都能缘得到，外面录像内容祂知道，梦里的梦境也知道，梦境里把超度和宰杀牛群的场景描述的活灵活现，梦里梦外的境界几乎相同，心里也知道那些场面一个一个不断的变换，但想醒就是醒不过来。</p><p>做梦和外面现实的情景没有联系的时候，也说明梦境是意根白天感兴趣、比较惦记和关注的内容，晚上意根就把梦给弄出来了。日有所思夜有所梦，意根白天关注，晚上也关注，所以才出现了梦。从梦境就能判断出一个人修行的程度，所以有些梦境还是有一定意义的。</p><p>七、梦境能显示烦恼的变化</p><p>修行达到意根的时候，意根无明减轻智慧增长就能改变根本，能把很多世间法和出世间法处理得越来越圆满，所以修法一定要深入到意根。因为意根是作主识，决定身口意行，决定业种和果报。祂了别的法非常多，能在事情未发生或刚发生的时候，事先作主宰作决定，想好对策处理好事情，这样我们应对一切就会圆融无碍，和周围环境人事物理越来越和谐，能度越来越多众生。</p><p>如果修到意根，无明一点一点减少，贪嗔痴就会一点一点地淡薄下来，就把意根改变了。意根的贪嗔痴烦恼减少淡薄了，会通过梦境显示出来，比如平时意根对于一些法不想再贪执的时候，会有相应的心行有想法和愿望出现，如来藏就配合着用梦境显示出来。如何显示呢？贪嗔痴代表心的污秽，心的污秽要用物质色法的污秽境界表示，心清净污秽减少，就显示此人所处的环境都是污秽不堪的，外边越污秽，代表从心里排除的烦恼越多，内心是比从前清净了，境界虽然不净，可是却衬托了心的清净。</p><p>所以梦境也说明一个人修行的程度，贪嗔痴烦恼是不是减轻了，内心是不是在逐渐清净。当然悟前和证果前的这种排染，和证果以后的降伏和消除贪嗔痴，还是有一定差别的，证果之前在修三十七道品的过程中，由于戒定慧的修学，烦恼确实应该降伏一部分，心要比从前清净一些，这是悟前和证果之前戒定慧修学的结果，否则戒定慧和三十七道品修学还达不到标准，贪嗔痴的遮障还很严重，无法证果和明心。</p><p>八、梦中的意根</p><p>睡着没有梦的时候，只有第七识和第八识存在，没有前六识，把这时的第八识证到，就可以过牢关，有能力出离生死了。做梦和梦游时，都有第六识的存在。懂得梦游的境界是怎么回事，必须明心以后，有甚深的唯识智慧才行，意根的法也能证得时，意根的运作也能观察出来，才能慢慢捋清梦游是怎么回事。</p><p>梦游、做梦都与意根有直接关系，梦里走路，意根通过控制后脑，控制意识，就能控制整个身体，所以梦游时，手脚和身体都能动。小时候经常梦里找厕所，结果就尿床了，都是意根的事，意根了别身体里状况，知道有尿，有尿意就想上厕所解决，于是就做梦，让意识来解决；如果不做梦，就直接在床上解决。</p><p>在睡醒前，意根了别法尘，只是不清楚，然后意识再了别，就逐渐清楚，我们就醒过来了。梦里的意识是独头意识，醒过来的意识是五俱意识，了别的境界不一样，所以醒过来的意识，不一定知道梦里的境界。梦游就属于这种情况。</p><p>九、睡着以后与昏死过去有什么区别</p><p>睡着是意根主动选择的状态，在睡眠中一般来说比较安详，能安心于睡眠状态，如果意根觉得睡够了或者有事，就会决定醒过来。而昏死过去，是被动的不情愿的状态。由于身体严重受创，六尘不能正常传导到胜义根，致使六识无法继续活动，五阴活动不得不停止，意根了知到五阴身这种状况，心里焦急万分不甘心，因此总是要寻找机会清醒过来。等身体稍微缓过来，就会挣扎着想起来活动，然后身体实在不行，就再次昏过去。甚至有的人，还会让灵魂出体去告知家人，寻找他人的帮助。可见，意根并不愿意昏死而不能使用五阴身，祂依靠着五阴身才能在世俗法中生存，所以就会执著于五阴六识，不愿意死去，也不愿意昏迷不醒。</p><p>十、睡觉时听法能否熏染意根</p><p>问：睡着的时候，第七识会睡觉吗？床边一个播经机里很小声念的经，第七识能听见吗？会把信息存进第八识吗？</p><p>答：第七识永远不会睡着，也不会睡觉。第七识如果睡觉的话，只剩下第八识，那就入无余涅槃成为阿罗汉了。第七识不会睡觉和灭去的，除非阿罗汉辟支佛入无余涅槃。睡着以后放播经机，第七识仍然能了别，只是祂能否听懂的问题。但是播放时间长了，也能受到熏习。第七识只要了别到声音，就会存入第八识里，听懂和听不懂，存的种子不同。</p></div>"
},{
    "title": "第十二章 意根与无明",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  意根与无明</strong></p><p>一、无明是否有来处</p><p>无明之所以称作无明，就是因为无明是不明，不明是没有出处的，没有出处就没有来处。如果无明有出处有来处，那么无明出自于哪里？没有出无明之前，那就是明的，既然是明的，那就是佛。可是众生从来没有做过佛，如果做过佛不可能再出现无明变为众生。</p><p>意根在无始劫以前本具无明，本来就不明，本来不是佛，不是后来从哪里出生了无明，由明变为不明。现见世间没有出生无明之法，无明没有出处和来处。如果无明有来处，就有归处，来处在哪里？归处在哪里？如果无明有归处，聚集在某处，那么某一天无明就会爆满而冲出去，再次让意根具有无明，佛陀就再次变为众生。这样的事是不会发生的，否则学佛成佛就没有意义了，费尽周折仍然不能脱离生死大苦，众生永远是众生。</p><p>如果无明有来处，那么无始劫以前就没有无明，无明是后来的，没有无明的时候就是佛，佛如何出生无明变为众生的？灭除无明的时候，把无明灭到哪里去了？无明无根，不是实体，没有来处，也没有灭处，明来了无明自然就会消失，二者不并存，此生彼消，此有彼无，如称两头，低昂相等。</p><p>二、生命是无明的产物</p><p>生命，顾名思义，就是有生又有命。什么是生呢？出现了六识的五蕴活动的迹象就是生，其中出现识蕴和行蕴活动的现象就是生；出现识蕴、行蕴和想蕴活动的现象就是生；出现了识蕴、行蕴、想蕴和受蕴活动的现象就是生；出现了识蕴行蕴想蕴受蕴和色蕴活动的现象就是生。</p><p>什么是命呢？只要有意根存在，有意根心所法活动的现象，就是命，意根就是命根。除了无余涅槃状态，其余状态都有命根存在，都有有情众生的命根，包括佛陀也是有情，只是不属于众生。</p><p>从十二因缘来看，众生生命的出生是意根无明妄想的产物。妄想消除，无明断尽，生命归于寂静，处于涅槃，轮回路绝，生命苦灭尽。</p><p>三、意根的无明无始</p><p>在无始劫以前，意根就与第八识共同存在着，没有一个开始点。那时的意根就是无明的，所以才与第八识共同存在，以至于无明起用，促使第八识出生三界世间和五阴身。如果意根没有无明，无始劫以前就不会有意根的存在，只有第八识，这是无余涅槃态，而且这个无余涅槃会永远保持下去，不会再有意根从无余涅槃里出生，当然就不会只有五蕴身出生。那个状态就是本来佛的状态，所以才说众生本来是佛，那个心就是佛。可是实际情况却不是这样，第八识出生了众生，那么心、佛、众生三者就有一个很密切的关联点第八识，而第八识是一个，自己与自己没有差别，体性相同。</p><p>四、六七因上转五八果上圆</p><p>这是在说修行之后的结果是四智圆明。四种圆明的智慧包括五识的智慧，意识的智慧，意根的智慧，第八识的智慧。圆明就是圆满明妙的意思，智慧达到了究竟顶端，再也不会增长了，那就意味着不用再修行了，达到了一切法无学位，最高位，就是佛位。</p><p>既然在佛位是四智圆明的，那就说明四种识心都可以具足究竟圆满明妙的智慧，只是在众生位不是圆满明妙的，是有漏的，有无明的。而第八识没有漏，没有无明。为什么在众生位却不是圆明的，还需要转识成智呢？因为前七识的业种存在第八识中，拖累着第八识不能绽放究竟圆融无碍的光明，或者是虽然能绽放圆满无碍的光明，但是七识的无明遮蔽了一部分第八识的无碍光明，使得第八识的功能作用受到了遮挡，有了一定的局限性。一旦七识无明断尽，这种遮障就消除了，第八识的大光明就全部显现出来了。</p><p>既然前七识在众生位是有漏有无明的，那么三大阿僧祇劫的修行，就要把七个识的无明全部断尽。最先降伏的无明是意识的无明，紧接着降伏的无明是意根的无明，而断除无明时，是意识与意根的无明同时断除。因为意根是意识的俱有依，是意识的主人和主导者，意根不断除无明，意识即使能断除，在意根的主导作用下，还会生出无明，造作无明业。</p><p>所以意根要破除无明，获得大智慧，乃至于要转识成智，一定要与意识一起断我见和明心，一起获得无生忍和无生法忍，才能一次二次三次的转识成智。意根不断我见和明心，就不能破除无明断尽无明，也就没有无生忍和无生法忍的智慧，就不能转识成智，五识和第八识也不能转识成智，究竟成佛。</p><p>在断我见和明心之后，意识与意根破除了最初的无明，获得了最初的无生忍智慧，然而这时六七识无明还是比较重，智慧不够深，还有比较重的分别性，还有相当程度的我性，还不足以转识成智。直到过牢关入初地以后，断除一部分法执，无明转薄，这时就开始第一次的转识成智，对世俗法的分别性减弱，无为性增强，空性更深，智慧甚深。但是五识由于比较愚钝，大智慧没有现起，所以无法转识成智。而第八识还是要受七个识无明的遮障，智慧功用受到一定程度的限碍。</p><p>初地菩萨继续修行到八地菩萨，六七识破除的无明越来越多，无明越来越轻微，智慧越来越深利，就会第二次的转识成智。六七识第三次转识成智时，五识随后就转识成智，七个识都没有无明遮障了，业种全部清净，第八识就变为大圆镜智，光照一切法，没有一丝遮障，智慧圆明。</p><p>五、修行就是要改造心</p><p>心是惑业主，心是轮回主，心是生死主，心是一切法之根，解决心的问题，才能解决一切问题。佛陀在十二因缘法中告诉我们，生死轮回的根源就是心的无明。因为意根的无明，才有五阴世间的苦，修行就是要断除意根的无明和染污，染污剔除，无明断尽，生死苦才能灭尽。所以修行就是修心，就是认识心改造心，除此无他。</p><p>修行的目的如果不是为了改造心，所修何为？如果修行的目的都不清楚，还谈什么修行？生死因为什么而来都不清楚，如何能抓住生死烦恼贼得解脱？</p></div>"
},{
    "title": "第十三章 意根与催眠",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章  意根与催眠</strong></p><p>一、催眠的原理（一）</p><p>现在讲讲催眠的原理，就昨天的三个催眠案例来讲。第一个案例，催眠大师对被催眠者一发出睡觉的指令，那几个被催眠者马上就互相倒在一起睡着了，之后大师又发出醒过来的指令，于是那几个人都从深度睡眠当中醒过来。醒过来以后，对于自己在睡眠状态中互相倒在一起的情况都不知道。</p><p>为什么会出现这样的情况呢？我们平时清醒的时候，意识和意根二者能够互相信赖、互相依止、互相指导。平时意根祂听从意识的指导或者是控制，听从意识的命令，受意识的影响。现在意根不受自己意识影响了，受谁影响？受催眠大师的影响。催眠大师他这个角色就相当于被催眠者意识的角色，意根就完全听从完全信从催眠大师所有的指令，说什么信什么，百分之百的服从，超过对自己的意识的信受，催眠师的指令超过了自己意识的指令。所以催眠大师说什么，被催眠者意根就相信什么，他一相信马上就能够做得到。</p><p>为什么一相信就能做得到？因为意根是作主识，是有力度的，祂想做什么，只要没有影响祂的因素，就能够做到什么。催眠大师让他睡觉，因为没有意识来控制引导意根，那么意根就听话，马上决定睡觉，于是就放下一切的缘，没有意识来参与，立时就睡着了。而睡着这个状态当中没有五识也没有意识，所以睡眠时这些人互相倒在一起，他们自己的意识也不知道，当然意识醒过来以后还是不知道。睡眠当中意识灭了，就不知道睡眠当中自己的睡眠的状态是什么情况。</p><p>为什么在催眠当中很快就能睡着了，平时睡觉就没有这么快？因为平时准备睡觉时，需要先把五识的了别灭去，再把意识的了别和心念灭去，意识灭去稍微困难一些；而在催眠当中，意识直接就不起用了，因此说睡就睡着了。</p><p>如果我们每个人修行打坐入了深定以后，意根就会发现六尘境界，发现自己色身，发现一切境界，跟以前不一样了，因为在深禅定当中，意根心思集中，开发了智慧，祂就知道色身是可以由自己来控制的；知道境界的虚妄不那么真实了，或者不把境界当回事。因为在深禅定中没有意识的控制，意根想干什么，就能做得成，要发起神通就能起神通妙用。</p><p>比如说在四禅定里意根想：我要飞上天空，这时候没有六识的干扰，意识不干扰祂，祂也没有天空的概念，也没有色身的挂碍，马上就能够飞向天空，穿山越岭。如果意根想：我要听远处的声音，或者是天上的声音，因为没有意识干扰，祂一想，就能听得到极远处的声音。意识怎么干扰?意识一直告诉祂这是不可能的，那是不可能的，这一说不可能，意根就觉得真不可能了，这事就做不成。 </p><p>没有意识干扰，意根说我想干什么什么，祂就马上就去做，做的时候后边的老板就帮祂做成了，无量的神通就这样开发出来了。有意识干扰的时候意识靠自己的生活经验，现实的生活习气来影响祂，说这样不能做那样不能做，因为意识没见过真实相，所有的想法思惟都不对，对意根的干扰是非常大的。在没有意识干扰的情况下，每个人的神通潜能都能得到开发。</p><p>从这个原理就可以看出来，只要意根相信什么，这种信不是普通的信，而且是非常非常的深信，深信不疑，说什么是什么，一点不用自己内心的思量，不考虑是对和错，没有意识来控制，意根自己分辨六尘能力比较弱一些，祂不加以分辨。只要信了催眠师，催眠师说什么是什么，让干什么就干什么，说意根的智慧劣就劣这上了。如果有意识，意识能够思考，能够辨别是非对错，就能够采取一些措施，就能控制意根。现在意根没有六识做帮手，没有意识做帮手，自己没有那么强的分辨能力，催眠师让他睡觉，意根都不用思量什么，马上就能够睡着。</p><p>现在催眠师的作用代替了意识的作用，催眠师说什么意根就相信什么，相信什么就能做到什么。神通是这样发起来的，催眠的原理也是这样。</p><p>二、催眠的原理（二）</p><p>第二个催眠案例，催眠师给一个人催眠，告诉他睡觉，这个人马上就进入睡眠状态睡着了。进入睡眠状态以后，催眠师就暗示他，你现在是很饿很饿的，他的意根就相信了，于是就觉得很饿。这意根为什么相信？因为祂没有细致的辨别能力，没有意识给祂分别六尘境界到底是什么，催眠师的话是不是如实有道理。因此催眠师说什么意根都相信，催眠师就代替了他的意识。</p><p>催眠师暗示饿以后，就问他饿不饿，他说饿，催眠师就说我给你苹果吃吧，你咬两口就不饿了。结果催眠师给他递一个洋葱不是苹果，却告诉他是苹果，他的意根也分辨不出来是洋葱还是苹果，他就相信了这个东西就是苹果，吃着洋葱却感觉是苹果味，这就是虚妄的分别和感受。</p><p>想阴和受阴就是如此的虚妄分别、虚妄感受，根本没有什么道理可讲。所有众生对于世俗界的感知和觉受也是一样的虚无缥缈，毫无道理，生死轮回得没有一点实际意义。想阴虚妄我们参考着楞严经佛讲的想阴那段，楞严经当中佛是怎么说的？佛说一个人坐在家里心想登高，心想自己站在悬崖上，一想站在悬崖好像就站在悬崖上了，这时候还怕掉下去，神经绷得紧紧的，足心就感觉非常的酸涩，就是那种害怕掉下去的感觉。</p><p>或者有人心想酸梅的时候，并没有吃也没有看见，口中酸水就出来了。嘴里也没有吃什么酸梅，为什么出酸水？就是虚妄想的结果，想阴出来了，就有和想相应的境界产生。六尘境界和五阴身也是虚妄的想出来的，虚妄的心想出来虚妄的境界，再作出虚妄的分别，虚妄的反应，五阴世界犹如夏日阳炎和海市蜃楼般。</p><p>这个催眠案例可以证明世尊所说的想阴虚妄，所以说我们日常生活中每一件事，每个人每生每世所经历的一切，全部是想阴想出来的，全部是虚妄的，没有真实性，也没有什么道理。我们都应该好好学学楞严经，讲的都是世尊让我们觉悟的法，好好读读想阴虚妄、受阴虚妄、行阴虚妄、识阴虚妄这几个段落，再着手实际观行，就会觉得五受阴全部都是虚妄的，真是开悟的楞严。</p><p>众生生生世世在三界这个舞台上演戏，虚妄的活着，由于各种想，狂想、妄想、虚妄的想，把不真实的世界不存在的的世界凭空都想出来了。想出来的世界真实吗？绝对不真实，可我们就是当成真实的，然后再出现一些更虚妄的境界，又把这些假境界当成真实的，于是又有虚妄的受想行的反应，这个反应也是不真实的。</p><p>所有这一切不真实的境界都是妄想出来的，然后再对着妄想境界作出不真实的反应和应对，没完没了就这样毫无意义的生存和游戏着，结果生生世世耍戏着自己，苦永远多于乐，乐也不是真乐。每一个众生在三界世间究竟在干什么呢？就像跳梁小丑和戏子似的，却不知道自己在戏中，不知道自己在演戏，还认认真真的演戏，是不是很傻？这些事情这些理，我们在定中要好好的去观行思惟，用心仔细去体会，就会感觉到自己确实是太愚痴太愚蠢了。什么时候能觉悟呢？</p><p>如果不觉悟，就会永远愚弄自己，天天都过愚人节，自己把自己愚弄的苦不堪言，却还要贪，还执着不已，还要有所求。在生死大戏中种种角色都扮演遍了，五味杂陈，什么感受都有，哪一件事情是真实的？都不真实，从头到尾就没有一件真实的事。受阴、想阴都不真实，妄想狂想虚妄想，都是病态的想，哪有真实？想出虚妄境界，还要在境界中遭受生死苦，太不值得了。</p><p>三、催眠的原理（三）</p><p>曾经有一个人在自己家的禅堂里打坐入定了，入定以后他就忘了自己在哪儿在干什么了。定中他突然想起一件事，马上决定去隔壁房间找一个东西，房门其实他自己给锁上了，结果他就直接越过墙体走到隔壁房间。到了隔壁房间，他立时就想起来自己在旁边的禅堂里打坐呢，怎么从那个房间出来到这个房间了呢？门还锁着，隔着墙他就过来了，他把自己正在打坐的事情忘了，径直走向隔壁房间，根本没有考虑禅堂和隔壁的房间是隔着墙的，禅堂的房间是锁着的，两个房间的情境他给忘了，把墙这事也忘了，一抬腿就走到隔壁了。</p><p>当时意识没有给意根分析说两个房间隔着墙不能过去，需要打开门，出这个房间再进那个房间，意识没有给意根这个暗示。意根就没有两个房间的概念，没有墙的概念，想做的事情却马上就做成了，如果有意识的思惟，这事就做不成了。等到了到隔壁房间意识醒过来了，就想我怎么能到这里来了呢？再想回去就回不去了。意识对意根就有一种阻碍作用，意根明白了意识告诉祂的情况，我现在在这个房间，刚从那个房间出来了，两个房间的概念出来了，墙的概念出来了，意根再想回到原来自己那房间，就回不去了。</p><p>这和催眠的原理其实是一样的，不管对面有没有人给你催眠，只要是意根相信，信催眠师也好，信自己也好，信什么人也好，信什么就是什么，不容置疑。有的人从小到大自己给自己不好的催眠，总是意念自己这不好那不行，遇见任何事情就说我不行，就给自己来一个不好的催眠，那么到一定时候再遇到任何事情他真的就不行了，这是自己给自己催眠。</p><p>有的人接受别人给他的催眠，比如遇到任何事情他打算去做时，别人告诉他：你不行。他就相信了自己不行，就没去做。再遇见什么事情想去做时，别人告诉他：你不行。给他催眠说不行，他就相信了，一来二去时间长了，面对每件事情的时候，他就没有勇气去做了。他真的认为自己不行，所作所为真的就不行了，这是别人给他的催眠。既然意根相信什么就能成就什么，这个特点太厉害了，不管是什么事情，是真还是假，肯定就能成就，前提条件是需要有相当的业种。那么我们就相信自己是佛，要真信、正信和证信，把成佛的理论掌握了以后，在甚深的禅定当中，让意根把理论变成现实，那么我们一旦变成一尊佛，就成佛了。</p><p>在定中意根心思集中思量法义，容易出生智慧，能改变从前对法的错误认知。如果祂相信自己的身体根本不是真实的，身体就不能障碍祂；如果祂相信外边的山河大地也根本不是真实的，山河大地就不能障碍祂，祂想干什么就能干什么。对面没有真实的山，要穿山就穿过去了，山对祂就不形成一个阻碍，马上就能穿过去。</p><p>祂认为天空没有真实性，那么祂就会想飞到多高就能飞到多高；祂认为大海也没有真实性，就会很自然的穿山越岭越过大海，瞬间就越过去，身上不会沾到一滴水；祂认为时间不是真实存在的法，想到未来世就能到未来世，想回到前世就回到前世，这就是神通。意根有这样的功能作用，把握好了，修行就能够成佛；把握不好，就生生世世当凡夫，生生世世的轮回轮转，生生世世的受苦，然后在轮回中再继续虚妄的想、虚妄的受、虚妄的苦。我们学佛应该好好利用这个原理，努力修行，不作凡夫而作佛。</p><p>四、梦游类似于催眠</p><p>在催眠状态里，意根完全听从催眠师的指挥，催眠师说什么，意根就信受什么，让做什么就做什么，完全成了木偶。意识被麻木了，没有了参谋的作用，催眠过后，意识一无所知，不知道在催眠状态里自己都做了什么。就像在酒精的麻醉状态下，自己都做了什么，说了什么，醒过来之后意识一无所知。酒精麻醉的是意识，意根正常，这时的意识作用微弱，对意根没有牵制作用，完全顺从意根。酒醉的时候意识答应的事，醒来就忘，不会承认。</p><p>梦游的现象也与催眠状态差不多，意根清醒，意识糊涂，成为了意根的木偶，完全听从意根的指挥，没有主见。意根随顺自己的习性，东西南北的游走，意识就顺从。等梦游结束了以后，意识却浑然不知，不知道自己在睡觉中究竟做了什么。梦游里五识都起用，以眼识和身识为主，那么意识就是五俱意识，但这个意识不够清醒，盲从于意根。梦游里的表现，体现的是意根的习性。</p><p>以前我曾经想过，利用催眠的方法让学人断我见证果和明心证悟，现在想来就觉得是不切实际的想法。在催眠状态，即使意根顺从引导，承认五阴无我，十八界无我不真实，可是意识不清醒，醒过来之后，意识不知道五阴十八界无我，没有断我见证果，那等于没有断我见一样。所谓的隔阴之谜，就是指意根知而意识不知的状态。催眠状态中断我见，醒来与隔阴之谜是一样的，意识没有断我见，也等于没有断我见。所以断我见明心证悟，是要意识和意根共同明理，共同证，缺一其心行就不完整。</p><p>五、催眠是潜意识的沟通技术</p><p>催眠术是运用心理暗示和受术者潜意识沟通的技术，因为人的潜意识对外来的信息的怀疑、抵触功能会减弱，因此施术者会用一些正面的催眠暗示，又称信息，例如信心、勇气、尊严替换受术者原有的负面信息，又称经验，例如焦虑、恐惧、抑郁，从而让受术者能够产生和原有不同的状态。上述关于催眠的文章说明了什么？人的思想情绪都来自于哪里？尤其是比较隐秘难见难于处理和克服的思想情绪，来自于哪里？这些思想情绪是不是受觉？受觉是不是很复杂？为什么会有受觉？</p><p>文章说明了人的思想与情绪都来源于意根，是意根对境的反应，对境界的受觉，也就是受想行识。因为对境时把境界当作实有的，因此不能无心，就出现了受觉。那些思想情绪都不好玩，都不令人喜乐，不令人舒心，所以才彻夜难眠，千方百计去治疗以消除那些思想情绪和感受，不想保持下去。这些受有乐受有苦受也有不苦不乐受，不是只有一种受。</p></div>"
},{
    "title": "第十四章 意根心所法",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章  意根心所法</strong></p><p>一、意根心所法是实修的指归，也是实修的操作系统</p><p>指，心所法能指向自己修行的目标，破除无明，降伏烦恼断除烦恼，转变心行，转变业种；归，让心归于智慧，归于清净，归于解脱。操作系统，依循于心所法，不断的修正心所法，转变心所法。实修也就是操作心所法的过程和心所法的操作过程，是自心改变自心的过程。</p><p>心所法能够改变的原因是意识对意根的熏染，让意根转变了心行，根本因是如来藏，是如来藏把意根的心所法转变了，但如来藏不是作主识，不作主，没有主观能动性，是被动的随着意根的心行转变种子。万物生发虽然是如来藏生出来的，但是背后的推动力量却是意根的心所法，意根不欲有所为，如来藏就无所作为，一切法都不生。</p><p>意根有主观能动性，心态转变就会促使业种变化。意根心所法转变是因，业种改变是果；意根实证是因，心所法转变是果；意根精进修行三十七道品是因，实证是果；意识如理熏染和引导是因，意根受熏是果。当然实际真修行的每个步骤都会使得意根的心所法发生变化，心所法变化就是果，因还是意根心所法促使自己的心所法变化，前提要有意识的心所法推动意根的心所法。</p><p>二、心所法必与识心同时出现</p><p>心所法是识心的助伴，必须要伴随着识心运行，否则识心就会无所作为。只要识心出现，心所法必同时出现，没有心所法识心就无法运行，那么世间一切法也就不能出生和存在了。即使第八识的运行也需要本身的心所法的配合，第八识本身的存在同样离不开心所法的陪伴。</p><p>四食的出现和运行，都是识心的功能作用，识心离不开心所法的助伴，四食就离不开心所法。凡夫离不开四食，圣贤人在欲界人间也离不开四食，禅定境界比较高的可以离开团食、思食，有时候也能离开触食，但不能离开识食，众生的生命最基本的需要有第八识和第七识的识食。</p><p>三、众生的心所法</p><p>思念当中有什么心所法运行？思想里有什么心所法运行？研究当中有什么心所法运行？推敲当中有什么心所法运行？参究当中有什么心所法运行？明白了是什么心所法？愿意是什么心所法？希望里有什么心所法运行？理解是什么心所法？打算里有什么心所法运行？盼望是什么心所法？祝愿是什么心所法？愿力里有什么心所法？</p><p>懂得、证得、知道是什么心所法？同意、赞同、附和是什么心所法？念兹在兹是什么心所法？心中的影像挥之不去是什么心所法？念念不忘是什么心所法？牢记在心是什么心所法？坚定不移是什么心所法？制心一处是什么心所法？目不转睛是什么心所法？良知是什么心所法？思心所法都有哪些作用？想心所法都有哪些功能作用？</p><p>心的状态、心的特点、性格、脾气、秉性都属于心所法，有善性，有恶性，有不善不恶性。严格来说，心所法不只有五十一个，如果要细细的划分，至少有几百个上千个。天亲菩萨只是大略粗略的归纳为五十一个，归纳的并不全面。如果佛来归纳这些心所法，那就细微极了。所以我们学佛，除了可以完全依佛所说，其他人可以依，但要酌情处理，要有灵活变通的能力。</p><p>即使是依佛所说，也应该有一定的变通能力，完全了解佛所说也是非常不容易的，有时候佛语与佛意有一定的差别和差距，并不完全一致，因为众生的智慧有限，佛不能完全把自己的意思说透，往往是隐含着说，巧妙的说，智慧不足时，容易误解。不少人讲佛经，其实讲的并不是佛的本意，曲解佛意的现象太普遍太平常了，佛也都忍耐着，虽然没有忍的心。</p><p>四、不同的人有不同的心所法</p><p>心所法当中，除了五遍行心所法，其它心所法都是不经常出现的，只是个别时候或者偶尔出现运行。五别境心所法是个别时候出现，智慧越高的人现行的时候越多；善恶心所法和不善不恶心所法，也是个别时候出现，不是时时能现行的，越善的人善心所法现行的时候越多，越恶的人恶心所法现行的时候越多。到佛地的时候，心所法可能要时时现行，比如定心所法，佛心时时在定中，不出定；比如慧心所法，佛心时时有大智慧，没有无智慧的时候，比如胜解心所法，佛心时时都能胜解一切法；比如善心所法中的无贪无嗔无痴，佛心永远时时无贪无嗔无痴；比如不放逸、轻安、行捨、不害心所法，佛的心时时都如此。</p><p>一个人一个性格脾气秉性，每个人的心所法都不同，众生心有多复杂，世界就有多复杂，世界是由众生的心变幻出来的。如果众生的心都如佛的心一样，世界就简单殊胜多了，云淡风轻，甚至连云淡风轻也没有，静悄悄，寂寥廖，没有语言能准确形容那种美好。</p><p>世界到最后都是那样的，众生修到最后心都是那样智慧且单纯，一点都不复杂，性格个性都泯灭，脾气秉性都消除，心所法都是善没有恶，只有二十一个，不多不少。可是把心消融到这种程度，要经过三个无量劫，可见修心太难了，改变心太困难了。心不改变，就要受煎熬，煎熬自己，也煎熬他人，互相煎熬，不知道众生同根，只能互相煎，然后自己熬。</p><p>五、意根是否有判断力</p><p>有智慧就有判断力，有思量就有思量的结果，意根一定有判断力，思量就是判断。因为意根是作主识，主宰整个五阴身的运行，没有判断力就无法主宰五阴身的身口意行，那也就不能成其为作主识了，那么谁来作主呢？意根的判断力不可或缺，只不过是涉及到判断力大与小的问题，以及准确与否的问题。</p><p>意根在哪些法上判断力大，在哪些法上判断力小；什么时候判断力大而准确，什么时候判断力小而不太准确；什么情况下依靠六识的了别作判断，什么情况下可以不依靠六识的了别作判断，存在这样的差别。在意根了别清楚的法上判断力就大，因为了别清楚才好判断，才能快速而准确的判断；如果意根了别不清楚，就无法判断，或者无法快速而准确的判断。意根对于不能理解的法，不是犹犹豫豫，就是判断失准，这样意根所作的决策就是盲目和错误的。意根的抉择错误了，六识的执行就会错误。</p><p>但是我们可以观察一下，在世俗法中，众生的抉择都是错误和盲目的吗？显然不是，正确无误的时候不少，应该是多数时候都是合情合理的。这就说明意根是有判断力的，判断力也不算小。判断不了的情况也存在，犹豫不决的情况也存在，判断失误的情况更是存在。这与意根本身的智慧有关，与意根的胜解力有关。</p><p>意根的判断，一方面直接依据法而判断，意根越熟悉的法，经历越多的法，越容易单独作判断，对越重大和危急的法，越容易单独而快速的判断，之后就会作抉择，六识出生再去造作。如果意根不能胜解接触的境界法，就会无法作出快速而准确的判断。另一方面，意根了别的粗糙，要想细了别，就要依靠六识的了别，依靠意识的思惟分析研究推理和判断，然后再根据六识传递过来的信息，作自己单独的思量和判断，六识出生执行。如果意根不能胜解六识了别的内容，不能胜解意识所思惟分析理解判断的内容，也不能作判断和抉择，或者是判断抉择错误，六识再错误执行。</p><p>六、五蕴与十八界的对应关系</p><p>色蕴的概念范围功能作用，受蕴的概念范围功能作用，想蕴的概念范围功能作用，行蕴的概念范围功能作用，识蕴的概念范围功能作用，以及六根（眼根、耳根、鼻根、舌根、身根、意根）的概念范围功能作用，六尘的概念范围功能作用，六识的概念范围功能作用，各自都是什么？对应关系是什么？十八界具体对应于五蕴中的哪个蕴？</p><p>五根、五尘和法尘，对应于色蕴。六识和意根对应于识蕴和受蕴、想蕴、行蕴。受想行识与七个识息息相关，色与识也有关联，没有识就没有五根的色蕴。但一般人观察不出来意根的受蕴、想蕴、行蕴和识蕴，即使五识的受想行识的功能作用，多数人也分不清楚，所以小乘法中一般不提意根的受想行识的作用。</p><p>色蕴由四大种子积集而成，受想行识蕴由识种子积集而成。单独识种子不能起任何作用，必须有心所法配合运行，所以受蕴、想蕴、行蕴和识蕴也就是心所法的功能作用。六识的心所法，离不开意根的心所法，意根心所法不运行，根本就没有六识及六识的心所法。所以五蕴和十八界应该是一一对应的关系，前五根五尘对应色蕴，意根意识五识对应受蕴、想蕴、行蕴和识蕴，让这一切法运行起来的总指挥是意根，总司令是如来藏。</p><p>七、意根只了别重大的法尘与意根默容一切法相违背</p><p>问：有人说：“意如刀剑锋，不能自割自者，乃是说第七识意根，亦名末那识。佛说此第七识名为意根，是意识种子自第八识中现起之动力故，意识依末那识之作意方能现起故，现起后悉依意根末那识之作意而运行，故说末那识是意识之根。此意根之别境慧极劣，只能于五尘上之法尘作极简单之了别——譬如五尘上之法尘有无大变动？此第七识非如意识觉知心能于五别境心所法伶俐运作，不具「欲、胜解、念、定」心所法，而于慧心所（别境慧）之功能亦复极劣，唯能于法尘上之变动作极简单之了别。</p><p>如是，于五尘境尚不能作了别，须唤起意识，而后依意识之别境慧，方能于诸境界作种种思量，云何而有能力返观自己？云何而有能力思维诸法？云何而有能力修正自己之心行及习气？是故此第七识虽极伶俐而能遍缘一切法，复能依意识心之别境慧而处处作主、时时作主，复能思量决定种种心行；然而若离意识之别境慧，便无所能为；由如是体性，佛说意（意根末那识）犹如刀剑之锋利（喻其能遍缘一切法之伶俐性。意识虽有别境慧，然不能遍缘一切法），而不能自己割自己（喻其无别境慧之「证自证分」故不能修正自己之善恶心行）；意谓此识之「欲改变其染污性、欲转变为清净意根」者，必须依靠意识之别境慧及思维慧，方能有所转变，非唯依自身功能便能除断自身之相应烦恼也，是故佛云意如刀剑锋，不能自割自。”</p><p>上边这段话总觉得哪里不对劲，能否分析一下讲一讲？</p><p>答：意根既然能遍缘一切法，那么任何一个法都能缘，没有缘不到的。上边文字里却说意根只缘五尘上的法尘，而且是重大的变化的。这是自相矛盾的说法。</p><p>比如说观日，可以观一个小时，或者是一天半天，日在一个小时内不会有什么变化，意识为什么能一直观下去？意根不缘一直不变化的日吗？意根缘什么法，意识才有资格了别什么法。意识所知道的，六识所了别的，都是意根所缘所决定了别的。意根怎么能只缘五尘上的还是重大的还是变化的法尘？ 楞严经中说意根默容一切法，细小微细的六尘意根如果不能缘，就不是默容一切法了，那么细小微细的六尘境界我们永远不知道。</p><p>意根没有欲，不想造作，六识都不出来，万法都不出现。眼识在一大堆色彩中，只选择紫色，就是由意根决定的，可见意根也缘五尘境，才能作主让六识了别哪个五尘境。如果意根不触不缘五尘境，五识就不会出生了别五尘境，对于五尘境就没有抉择性。</p><p>有意根不能缘的法，意根就不是遍缘一切法了。意根不能胜解，总是稀里糊涂的，就不能作主做出正确如理如实如法的事情，也就不能躲避危险，不能转识成智。意根没有念，就不能让意识出来念，什么法也就不能出现了，念佛也不能念，参禅也不想，万法就不会出现了。意根不能思量思惟，意识熏染意根就没有意义，更不能转识成智，什么智慧也不会出现。意根不能有定，六识无论怎么修定，也定不了。</p><p>意根如果不能修证善恶心行，那就永远不能改变善恶心行，善永远善，恶永远恶，如何能降伏烦恼，断除烦恼？意识熏染意根也就没有任何成效，搪费其功。 意根没有反观力，没有证自证分，佛却说八个识都有证自证分。众生那么信任自己，非常顽固，就是意根证自证分起用。倔强得要死，坚信不疑，就是意根的证自证分，他就认为自己对。</p><p>意根有恒审思量的作用，一切法都必须经过祂的审批才能通过，才能做抉择。意根的慧如果总是那么低劣，如何能合理审查审批，如何能做出智慧抉择？不能做出智慧抉择，众生的身口意行时时处处都表现出愚痴无智性，世间怎么能有聪明人存在？学佛还有什么用，怎么能够开智慧成佛？</p><p>八、依人不依法才有争议</p><p>能现量如实观察意根的运作，必须有唯识种智的智慧，有最低初地菩萨的观察智慧才行。因为观察不到意根，不真实了知意根，才会有争议。浅法没有争议，因为大家都能现量观察得到，对于观察不到的，才去争议，否则有什么可争议的？白就是白，黑就是黑。分不清黑白，才去争议。</p><p>意根到底有什么心所法，哪个人能够实际观察验证？六七识都是染污烦恼，遮障那么重，有什么能力去实际观察？如果有能验证者，就把验证过程讲出来。</p><p>依法，是依意根运行的真实相，如果观察不了意根，如何能依意根的真实相来定义意根？如何能真正依实际的实相法？依不了实相法，那就是依人，依人就不符合佛法修证宗旨，就有错漏，不合佛意，更不能得道。</p><p>九、没有六识时五阴身中所有的心行都是意根的心行</p><p>半夜睡着了，身体冷触出现，然后身识意识出现以解决冷的问题。半夜睡着了，身体痛触出现，于是身识意识出现感受痛触并处理。如果意根知道是冷是热是痛，意识为什么还要出生？因为意根知道出现问题以后，无法亲自处理解决问题，五阴身的问题需要六识处理。</p><p>在没有六识的情况下，五阴身出现的心行都是意根的心行，在六识非常羸弱的情况下，那些心行也几乎都是意根的心行。观察植物人的状态，植物人是否觉得痛苦？是否愿意当植物人？是否愿意继续躺在床上？吃饭时是否愿意吃？看见最亲的人有什么表现？这些都能说明意根的心行和觉受。</p><p>在昏迷时，意根是否愿意昏迷，有什么表现，从这些表现上就能观察到意根的心行。如果在昏迷时，意根是舍受，那么意根就应该像如来藏一样无所谓，继续昏迷就好了。可是身体稍微恢复一点，意根就会促使六识出现，促使五蕴功能出现，这说明意根不愿意昏迷，不甘心昏迷。为什么不愿意昏迷、不甘心昏迷、不喜欢昏迷呢？昏迷当中一是不好受；二是没有五蕴活动，无所作为就觉得无聊，无聊也是苦受，昏迷时如果觉得舒服，意根当然会保持昏迷状态；三是意根怕死亡。打坐入定时不愿意出定，是不是说明意根觉得舒服？当然如果意识比较清醒也觉得入定很舒服，就会贪着静坐，不愿意起座。</p><p>十、七个识的五别境心所法</p><p>七识的五别境心所法包括：欲、胜解、念、定、慧五个心所法。七识由于无明的缘故，这五个心所法中的定、慧和胜解不能时时处处现前运行，而是个别时候才能现前运行出来。因为无明的缘故七识有时就没有禅定，因为无明的缘故七识有时就没有智慧，因为无明的缘故七识有时就不能胜解法义。如果无明灭除，不遮障七识，七识就会时时处处都能在禅定中，比如七八地以上的菩萨和诸佛就是如此；时时处处都有智慧，时时处处都能胜解法义，比如诸佛。</p><p>而诸佛的本尊佛真如无垢识，却是时时处处都在禅定中，都有大智慧，都能胜解一切法，没有无明。众生的第八识也是如此，但与七识的定慧和胜解的内容有别。七识在四圣谛中有定慧和胜解，而第八识胜解的不是世俗法，其定也非世俗定，其慧更不是世俗慧。</p><p>十一、意识的念是由意根念的结果</p><p>如果是意根不念的法，意识如何念？意根与所念的法相接触，想了别清楚，如来藏随顺就出生意识，意识听从意根的指令就会了别和念着意根所念的法。如果意根不念法，就不与法接触，不想了别和造作，如来藏就不能出生意识有进一步的念的行为，就没有意识去念着法。意根不念什么法，就不会出现什么法，意识所念的法都是意根念的结果，都是意根安排调动的结果。意识无意根的触缘不能出生，没有意根的思心所决定就不能出生，意识不能单独决定自己的出生和一切活动，祂不是作主识，不自在的缘故，是意根的工具，听从意根的调遣。</p><p>十二、意根的念和定心所</p><p>如果念佛念经没有成功熏习意根，意根如果没有念佛念经的心念，没有记住佛的名号和经文，那就不可能出现意识醒过来以后，发现自己还在念佛念经，或者是意识忙完工作，回头发现自己还在念佛念经。意识不自觉的念佛念经，都是意根指使的，是意根自觉修行的心行，意根喜欢念佛念经，意识受意根指挥，不管干什么都不忘念佛念经。所以说意根一定有念心所，一定有记性，也一定有胜解，否则意根不能受熏，不会总想着念佛念经。从另一方面来说，意根也一定与定力相应，变成了习惯，坚持一件事情就是定，这样意识才能恒一的做一件事。</p><p>十三、意根的胜解</p><p>要充分的熏染引导意根，意识就要勤思惟，不思惟不观行，就无法真正如理的引导意根。识心对于所接触的法，能够如实的理解，最合理的理解，最到位的理解，不会错解和邪解，也不会误会。如果错解不能胜解，那就无法做正确无误的抉择，其行为造作必错，必有严重的后果。如果意根没有胜解，那么意识的思惟观行理解，能不能引导意根？意根能不能受到熏染？显然不能。意识无论怎样造作，意根就是不胜解，意识的表演根本就没有用。所以意根只要受到了影响，就是被熏染了，就是胜解了意识传递过来的信息。</p><p>如果意根没有胜解，意识传递什么信息也没有用，那么意根也不会再决定让意识帮助自己去了别什么法，了别之后意根还是不懂，意根就不会决定了别，意根慢慢就会安静下来，犹如盲聋喑哑一般。实际上意根非常喜欢让意识去了别判别，然后告知自己，就说明意根一定胜解了意识的了别内容，才会不断的促使意识了别、分别、思考、判断，然后自己就有所抉择，造作相应的身口意行。</p><p>如果我讲法，你们始终不能胜解，那我就白讲，你们就白学，没有什么结果，也许还会互相耽误。别人跟你说的话，如果你不能胜解，那就会歪曲他人的意思，不能做出合理正常的回应，两个人就不能交流，交流也没有用。这样人们之间无法沟通和打交道，无法生活在一个空间。七个识中，不管哪个识没有胜解，哪个识就不能正确解读对应的法，就不能作出正确合适的抉择，其结果犹如盲人，不能走路，识心无法正常运行。</p><p>意根如果不能胜解，意识说我应该去东，意根不解的话，不是到西就是不动，最后不仅办不成事，还会非常懊恼，能导致精神错乱。对面一辆车快速开过来，意根不能胜解情况的危急，就不能立刻躲开，结果是什么？开水烫到手上，意根不能胜解身体的状况，那就会一直烫着，直到身识受不了了，意根还不知道怎么回事，那会是什么结果？</p><p>意根相当于国家总统，他不能亲自做的事，就会让助手们去做，自己不必事事亲为。但是如果说总统什么也不是，智慧很低劣，不能胜解，不能有欲和念，也不能有定，那你想想这个国家能好吗？贬低总统相当于贬低全国人民一样。如果汽车发动机生锈了不好使，这个汽车会是什么样？</p><p>修行不是背课文，而是实打实的智慧观行，如果观行不出来，说什么都是枉然。能现量观行出来各心所法，也需要有相当好的禅定力和观行智慧，最起码意识意根都已经转识成智了。背别人的东西，也需要智慧，没有现量观行智慧，背错了也不知。即使背对了，也是巧合。</p><p>十四、意根的自证分和证自证分证明意根有胜解</p><p>唯识这些法非常深细，开悟之前距离能现量观行唯识种智的法，差不多需要一个无量劫的时间。所以不管有人认为自己多有智慧，都不要太自信了。</p><p>既然八个识都有证自证分，能证明自己所了别的法，说明识心有胜解，有一定的智慧。第六识的证自证分现行的时候比较多而明显，所以容易观察，一般人也承认意识有智慧，有极强的胜解力。愚痴的人意识就没有反观力，证自证分不现前，没有胜解力，世间法和出世间法都搞不清楚。</p><p>第八识有证自证分，说明第八识有智慧，有胜解力，其胜解力体现在如实了别业种，不错解业种，如实实现业种而不错乱；也体现在第八识能如实如理的了别意根的心所法，而密切的配合意根，满足意根所需，产生一切法；第八识的胜解力也体现在如实了知根身器界，然后输出种子维护和改变根身器界。</p><p>第七识也有证自证分，能够证知自己所了别的法，说明第七识有胜解力，能了解自己的认知和状态，与智慧相应，因此将来才能转识成智。第七识的胜解力体现在能了别第八识所现行出来的法，并且作出正确的决定，指挥六识去运作；体现在第七识能正确了别六识所观察了别的法，了解意识的分析思惟判断的结果，而能依此作出正确的决定，产生如理的身口意行而不错乱。</p><p>其胜解力发展到极大时，就能转识成智，胜解力最大时，就能第三次转识成智，最终成就佛道。没有说意根还很愚痴，没有胜解力，没有大智慧时，就能成佛的，如果能，成的就是愚痴佛；也没有说意根没有胜解力，没有大智慧，就能转识成智，成为地上菩萨入如来家，做真佛子的。如果能，成的也是愚痴菩萨。</p><p>五识也有微弱的反观力，有证自证分，有范围非常小的胜解力，能配合意根的指令而运行。但是五识的胜解力比意根差多了，比意识就更差了，也不如第八识的胜解力，虽然第八识不能胜解六尘境界，不能胜解世间法。</p><p>当意识没有智慧，观察不出来这几个识的证自证分时，几个识的证自证分照样存在和运行，不管意识是否能观察得出来。</p><p>十五、意根的受</p><p>（一）七识在面对六尘境界时是什么表现？执取、贪爱、厌恶、仇恨等等，从七识面对六尘境界的表现，就知道意根很多时候不是舍受，情绪激烈和反常，内心躁动如猿猴。为什么如此？七识知善恶是非曲直，知对自己的利害得失，知损益。七识心中有我，一定要以我为出发点来看待事物，一定要维护自己的利益，一定会有喜怒哀乐的思想情绪，而面对境界心情不平静，那就不是舍受。如果是舍受的，心境就会是平和的，心行是无为的，境界怎么样都行，无所谓。</p><p>（二）长期处母胎中不能出生，属于恶报。佛的儿子罗睺罗在母胎里六年才出生，是因为前世曾经堵老鼠洞六天，致老鼠闷死在洞穴里，于是就受到处母胎中六年的恶报。处在母胎里，开始时没有意识，只有意根和如来藏，既然处胎属于果报，那么意根就能承受果报。</p><p>在母胎受恶报时，意识还没有出生，意根是什么感受？如果意根感受舒服和没有感受的话，就不叫作恶报了。昏迷的时候，成为植物人的时候，都属于恶报，或者是苦报，这时没有六识，只有意根受苦报，那意根就不能是乐受和不苦不乐受，否则就不叫作苦报了。中阴身里前路茫茫，一般来说都是苦受，意根因为不喜欢苦受而急着投胎以躲避苦受，这时意根不能是乐受和不苦不乐受。睡着以后意根是什么感受，谁能知道？刚刚醒过来时意根是什么感受，谁能知道？遇见各种事情时意根是什么感受，谁能知道？这些法都很深细，智慧不足，就无法现量观察出来。</p><p>十六、心所法就是心性和心行</p><p>识心心所法的运作和一个人的性格、脾气、秉性、智慧都是相关连的，如果想了解心所法的运行，可以观察每个人从接触一件事情开始到最后作出决定这段时间里，他的表情、眼神、脸色、言谈、举止、反应的快慢等等，可以观察出每个心所法运作的过程和快慢程度，以及每个人的习性有多重、智慧有多好。这一系列心行既是一个人心性、习性、烦恼和智慧的体现，也是心所法的体现。</p><p>有些人是急脾气，心也粗糙一些，在接触到人事之后，只粗略了别不管对错和细节，就以为自己了别的是究竟无误的，于是受觉就出现，或喜或嗔或贪或厌，执心很重，然后不管三七二十一，直接作出抉择，他的心所法的运作就简单、快速，但后果可能不堪设想。而有些人在粗略了别，受觉出现后，自己会再次仔细了别分析，然后扭转自己错误的了知，觉受改变，然后再作决定。他的心所法运行的稍微复杂一些，会反复运行。不少人会随着了别的不断深入，受心所法不断的发生变化，随人事物所转，心都沉浸其中，不能超脱。</p><p>理智的人，往往不把人事物了解透彻，就不会出现什么思想情绪，也不会轻易下判断作抉择，不把自己暂时的粗略的了知当作是究竟的，他会反反复复的观察、甄别、推敲。有修为的人，即使了别出的人事物是自己喜欢和不喜欢的，心也不为所动，超然物外、解脱。</p><p>粗枝大叶的人，心所法运行快速而简单，心思细密的人心所法运行的缓慢深细复杂；烦恼重的人心所法运行也复杂，纠结不清；愚钝的人也许快速了别之后，发现自己能力不及，就放弃了，心所法快速消失，也许想了别清楚，心所法运行的就会极其缓慢，长时间的了别，长时间的受，长时间的思量，就是不能作出最后的抉择。聪明智慧的人，也许也快速的就能了别清楚，深知其内涵，也许会能够非常深入细致的了别究竟，不出差错。</p><p>心所法的运行非常错综复杂，与每个人的性格、脾气、秉性、烦恼和执著的轻重是紧密相关的，也与每个人的修养、修为、禅定、戒律和智慧是紧密相关的。</p><p>十七、意根五遍行心所法的运行</p><p>意根对什么法作意是由什么决定的，这个问题瑜伽师地论里谈到过，是由意根的念和欲、习气、习惯、想法、兴趣、爱好、打算、愿望、要求等等，来引起意根本身识种子的作意。六个识的作意都由意根引起和决定，意根想在哪个法上起作用造作，六识的种子在如来藏中就有一个出生的方向，有意要生到那个法处，这就是作意，之后识种子一定在那个法上出生。</p><p>意根作意后，不管哪个识，肯定都要与相应的法相触，因为识种子出生在哪个法上，就会触哪个法，触了以后就会领纳接受下来。比如手触到球以后就接受这个球，领纳这个球，然后才能有感觉，也就是受，之后是知。比如眼根触色尘，先把色尘接受后，就知色尘，再执取这个色尘，生起想法、打算、计划、筹谋等等，执取色尘后才有了感受，那受又在想后面生起，有了感受之后再继续思量，接着细微了别作决定作主宰，想要如何处理。</p><p>处理前意根必须将此法执取完毕，执取之前必须了别清楚，必须对这个法先有受，受了之后就会升起一个抉择。这个抉择就是思心所的作用，这个抉择不一定是最终的抉择，也许是一个不成熟的暂时的抉择，待后边再细了别之后，觉得有把握都了别清楚了，就会作最终的抉择，那么七识在这个法上的运作就结束。</p><p>在这个法上的运作没有彻底完成之前，意根的思心所就会相续不断的运作，直至这个法全部了别结束，所有的思心所、五遍行心所也就都结束了，便会进入下一个法的运行中，五遍行心所法继续运行新的内容。如果这个法没有结束，那么触、作意、受、想、思仍会相续运行不断，来回反馈，不断修正。就像我们看一件东西，刚刚看时先接纳过来，接受了以后想看清楚，就会去了别。刚开始有可能还看不清楚，那就不断的触，不断的受，不断的了知，了知之后再生起苦乐三种受，然后就会执取这个相，作出抉择，六识就要造作业行了。</p><p>十八、作意心所法是如何生起的</p><p>识心对法的作意是一个非常复杂的过程，要观察清楚非常不易。最初对于法的作意是在种子位，也就是识种子还没有输送，识心还没有出生的时候，因为当识种子要出生之时，需要有一个出生的处所，一个作意的方位，这个方向与处所就是作意的对象，是法的所在处。</p><p>比如打篮球时要把篮球投向篮筐，眼睛就要瞄准篮筐的方向投球，不能朝其它方向投，这个方向就相当于作意的处所，也就是篮筐。其中篮球相当于识种子，人眼睛相当于识心，瞄准相当于作意。当手拿着球时目标应该朝向蓝筐的方向，在投球时手要对准篮筐方向，需要在这个方向上做准备投过去。那么识种子在如来藏里出生之前也是一样，也需要有一个出生的方位，所有的识种子在出生前都是有作意的。识心在某个处所出生，在某个法上出生，就要作意于某个法之处。</p><p>识种子出生后，识心会继续相续不断的作意。因为在识心在某个法上持续运转时，对这个法要一直作意下去，如果不作意了，那么识种子的输送就要转移方位，其它的心所法触受想思都不再出现。所以识心要持续作意对于某个法的了别才能相续下去，一旦不作意就没有之后的触、受、想、思。作意心所法很重要，如果没有作意心所法，其它心所法也不会出现，对于那个法就没有识心的作用了。</p><p>十九、五遍行心所法运行的过程犹如临摹绘画</p><p>绘画临摹的时候，眼睛对着景物反反复复不断的观察了别，意识一边观察一边不断的记忆，临摹时一边绘画一边不断的回忆，再去反复的重复这个过程，作品完成，直至临摹结束。看一眼景物画一点，琢磨一会，再画一点，再琢磨一会，反反复复，直至画完为止，这幅画就放在旁边，不琢磨也不画，也不作意了，就换下一个活动。</p><p>五遍行心所法的运行过程类似于临摹，绘画的过程和识心的运作原理类似，当识心在某一种法上运作，必须运作完了才把这个法放下不管。运作没有完成时就会反复作意，反复接触、接受、领纳、了别、了知、感受、思量，不断的分析思择，反复运作执行，过程非常复杂。心所法运行顺序并非是先受后想，运行时是不一定的，在于识心的认知智慧和程度。当运行完了才有更深的感受，感受后再了别，了别后再感受，直至意根觉得已经了别清楚，即会停止作意。如果意根过后什么时候想到还需要了解什么，就会再次的对法作意触受想思，了解清楚想明白了，就停止在此法上的心所法运行，此法在识心中又消失了。</p><p>有时候思量完了就作出决定，有时候思量完了并不会作出决定，这是因为意根觉得没有了别太清楚也不彻底。只要意根不作出最后的抉择，五遍行心所法就不结束，直到意根觉得满意了，达到目的了，就不再思量，立刻作出决定要如何处理。</p><p>二十、五遍行心所法运行过程</p><p>五遍行心所法最初是按照作意、触、受、想的顺序运行，后来就不一定了，运行的次序就会颠倒。思心所不一定是什么时候出现，意根不一定在什么时候作抉择，也许在中间出现过很多次思择，一开始是一个小的决定，对某个环节的部分抉择，运行到最后才是一个总的最终的抉择，中间的抉择不是究竟的，但是对最终决定也起到了相应的作用。比如说吃完这口饭，下一口饭还吃不吃，以及吃什么吃多少，思心所要有个抉择，整顿饭都吃完了，思心所还要作一个总的决定说吃完了不再吃了，于是五阴身就会放下碗筷。有时候自己不想再吃，旁边有人劝再吃一些，思心所这时候可能拿不定主意，于是思心所就会权衡利弊得失，再快速的对自己所吃的饮食以及胃部的感觉作意触受想，最后思择说不能再吃了，这顿饭就结束了。</p><p>作意是识心活动的开始，是一切法生住异灭的开端，不作意就不能接触法，不接触就不能接纳和感受，不接纳就不能了知，不知就不会思量和抉择，不抉择就没有身口意的造作。所以作意很重要，思更重要，思的作用最大，思的过程可能最长。但是在受想思的时候，一定有触，不触就没有受想思，所以触也很重要。受想是思的前提和基础，无受无想，也就没有后续的身口意的造作，识心就寂静了，清净了。所以大修行人只对法有轻微短暂的作意，触了之后，不生起觉受，不想了知，就没有下一步的行为造作，既无心也无事。</p><p>在运行一个法的时候，作意一直存在，当仔细去想的时候，六尘就转变为单独的法尘了，法的重点的转移，说明另一个新的作意出现了。在刚开始从作意到想的过程，作意、触、受、想、思运行的可能特别短暂、特别快速，刹那间就到了思，由于了知的不清楚，思量就不明白，就要重新作意触受想，这个过程反反复复，相续不断。要把这个过程观察得细致是很难的，即使是粗略的观察也是相当的困难。但可以通过观察自己和其他人的身行、语行、思想、观念，也能对照着观察出一部分。</p><p>二十一、意根了别时有五遍行和五别境心所法的参与</p><p>执取是想心所的功能，其作用是了别相、取相，然后为相安名，有了名字，名言就出现了，对于相和名就认可下来。意根取了相之后，才能思量和作决定要如何造作。当然五遍行心所法要反反复复的运行，最后才能作出一个总决定，之后才能采取行动。所以看一个人在犹豫不决时，就知道意识和意根在思量，在不断的作意触受想思，心所法轮流运行，五别境心所法也参与运行，非常复杂。所以说人的大脑，比电脑要复杂无数倍，电脑根本与人脑无法比较。所谓的大脑，主要还是指意根的功能作用，六识次之。</p><p>二十二、当意根恒审思量的时候，心里有没有什么念头？</p><p>意根有想念的法，才去思量和审查，先有念，后有思量审查，没有念就不思量。如果意根心里空空的，什么也不念想，就没有思想活动，不必去审查什么，思量什么，这时意根是清净的。而意根没有降伏的时候，攀缘比较重，心里的念头非常多，所以心里就会不断的没完没了的思量琢磨审查评判衡量，白天弄不通，晚上接着审查思量，严重的就会半夜醒过来睡不着，所以才说众生的意根有恒审思量性。意根已经降伏了的阿罗汉们，心里几乎没有了什么念头，不大想什么事情，意根只是偶尔有思量，但不是常常，不能叫作恒。所以只要意根思量法了，就有念头，思量的法就是念头，是意根所念。</p><p>二十三、意根思心所法决定了眼识意识的了别</p><p>眼识见色，见的是显色，青黄赤白，光明黑暗，云烟雾霭及空。光明是一种物质，由四大组成，刹那生灭变异，是虚妄不实的。</p><p>眼识本身具有思心所，领纳了色尘以后，了知色尘，然后生起思心所，决定造作，是躲避还是多看一会。眼识与意根和意识同时密切配合协作，没有意根的作意与思心所法，就没有眼识和意识的出生和了别，也就没有眼识五遍行心所法的运行，也没有意识的五遍行心所法的出现。眼识见色，第七识不能见色；意识分析推理判断，第七识不能推理分析。识有分别了别识别性，才叫作识，否则就不叫作识，七个识都有了别分别识别性。</p><p>二十四、对意根几个说法的纠正</p><p>问：有人说：“意根有个怪异的习性是不为常人所知的，祂常常贪着嗔的韵味；譬如有人看不惯别人好，只要别人比他强他就起嗔心；更有甚者，乃至以残害众生性命满足自己的快感。意根又是个两面派，一面是染污，一面是清净；所以唯识宗称祂为染净依，因为祂的一边是第八识如来藏，另一边是六转识；所依如来藏常恒而清净，所依之六转识常转而染污；由是缘故，学唯识者得知意根为染净依。”以上说法妥否？</p><p>答：意根的极大多数习性都不为常人所知，因为常人定慧都不足，不能证得意根，即使有人证得，因为烦恼的遮障没有转识成智，就观察不了意根的运作，无法确切了知意根的心行，所以误会极多。没有断除烦恼的人，没有转识成智的人，意根具足了一切烦恼，最大的烦恼习性就是贪和嗔。如果意根要生起贪的心行，祂一定认为所贪的法对自己有用，自己喜欢，觉得舒服快乐，能满足自己的喜好、利益和虚荣。</p><p>嗔心现行出来，生气的时候有什么韵味？这个说法很奇怪，因为嗔是心所法，是识心的心行，说意根贪着自己嗔的心行，这个说法根本讲不通。嗔本身是伤害身心的行为，甚至是不愉快的，谁喜欢自己不愉快，与自己过不去呢？除非有自虐症，平常人都不会喜欢嗔，能避免嗔都是要尽量避免的。即使想报复别人，也是伤人七分，损己十分，一般人都不喜欢这样，所以说意根会贪着嗔的韵味，绝无此事。从另一方面来说，韵味是识心对色声香味触法六尘境界的感受，识心可以贪着对境界的感受，尤其是快乐舒服的感受，不会贪着自己生气时候的不愉快感受，没有这个道理。</p><p>嗔恚心比较重的人，会经常起嗔行，他会把心里的火气散发出去，施加到别人身上，自己才能平和下来。所以嗔心特别重的人就会对他人施暴，以发泄自己的嗔，嗔发泄出去了，心里才能舒服一些，或者感到高兴快乐。有的人找不到发泄情绪的对象，就对自己进行发泄，对物体进行发泄，然后心情就平静下来，只有极少数特殊人才是这样，大多数人都不如此。但这也不说明是贪着嗔的韵味。嗔就是嗔，贪就是贪，没有人喜欢嗔，可是没办法，意根就是有嗔心，时不时要发作出来。</p><p>第二段说的染净依不是那样解释的，染净依的真实意思是，意根是六识清净和染污的依止处和来源处，六识是染是净要依靠意根来定。因为意根是作主识，能按照自己的心行指挥六识的造作，所以六识的心行如何在于意根的心行，意根染污，必然指挥六识造作染污业，意根清净，必然指挥六识造作清净行，或者六识少运行不运行。</p><p>意根无始劫以来一直都依靠着如来藏才能出生和运作，依靠如来藏见一切法，祂却从来不依如来藏的清净而清净，一直都是染污的。所以如来藏不是意根的清净所依。只有真正证得如来藏以后，才能逐渐依止如来藏的清净性，而转变自己的染污心行，变得越来越清净。</p><p>另一方面，意根虽然依靠着六识去了别六尘，造作身口意行，但是意根的染污是先天就有的，不用六识熏染就存在着染污，没有六识的时候，意根也一直都是染污的。相反在六道轮回中，意根却不断的把自己的染污熏染给六识，教导六识贪嗔痴，六识再在轮回中接触染污环境，把熏染到的贪嗔痴再传递给意根，这样又增加了意根的贪嗔痴染污性，所以意根的染污性也不是依靠六识才出生的。但是，意根要想转变清净，就要依靠六识对佛法的熏习，六识清净，意根才能逐渐清净；反之，意根清净了，六识不容易再受染污环境的熏染，必然也清净。</p><p>二十五、意根有善心所法众生就善</p><p>众生有什么样的心，意根就有什么样的心所法。众生是善人有善心，意根就有善心所法；众生修禅定有定力，意根就有定心所法；众生有智慧应对世出世间一切法，意根就有慧心所法。</p><p>意根如果没有善心所法，世间就没有善人，学佛就不能有什么成就，众生也不能上天享福，不能有善的果报。意根不善，意识怎样熏染意根也没用，众生永远不能善。意根如果不与定心所法相应，修定就没有什么用，怎么修也不会有定。意根如果只能有低劣的慧，那就不能有什么智慧性的抉择，也不能做对什么事，修行也不能证果和明心了，没有智慧、智慧低劣那就永远不能转识成智，永远不能有佛那样的智慧。</p><p>二十六、众生意根的作用相同心所法不同</p><p>问：人和人之间的意根，其功能作用是否一样？六道众生的意根，其功能作用是否一样？凡夫众生和圣贤人的意根功能作用是否一样？畜生和人的意根是否一样？</p><p>答：所有众生的意根功能作用是一样的，只是心所法不同，含有的无明程度不同，明的程度不同，起作用时，就会有好作用和不好作用之分。譬如所有的刀都有切割的作用，因为刀的利钝不同，削出来的东西效果不同，利刀削出来的东西完美整齐有价值，钝刀削出来的东西不整齐，不能用，也许能毁坏东西，没有好效果。意根的智慧不同，造就的事业就不同，烦恼不同，造作的业行不同，果报就不同。无明轻微的意根能善用，无明深重的意根就恶用，其结果就有很大差别。因为意根的无明程度不同，明的程度也不同，所以世上众生就分为三六九等，有凡夫和圣人之分，众生成佛的时劫就不同。</p><p>二十七、业行是如何出现的</p><p>五遍行心所法运作的过程就是造作业行的过程，如果善心所法加入其中，造作的就是善业；如果恶心所法加入其中，造作的就是恶业。作意和触心所法本身是不善不恶的，如果加入善心和恶心，其作意和触就是善意的和恶意的。受想思心所法本身也是不善不恶的，如果加入善恶心所法，其受想思心所法就含有善恶性了。如果五遍行心所法运行中有慧心所法参与其中，业行就是智慧性的，反之，就是愚痴性的业行；胜解心所法参与其中，此人聪明，善解人意，理解力强；定心所法生起时，受想都轻微，五遍行心所法运行的都缓慢而轻微，作意和触都是被动的生起，受想思心所随缘现起运作，任运而为。</p><p>意根在一切法的运作过程中，起着推动的作用，是业行的主宰者，这从平时的身口意行当中可以观察到。比如将手举起，然后拿起笔，再把手按到纸上。这个过程如果细心观察，就能明显感觉到有一种心力在推动着，有时推动明显，有时推动不明显，有时很随意，好像不推动，其实是惯性而为。但是意根的运作再随意和不用心，意识无智也是很难观察到。</p><p>再比如我们非常熟练的骑自行车时，好像没有用心骑，意识不用思惟和考虑如何骑车，但是意根却刹那刹那都在指挥运作着，都在用心思，只是意识不知道而已；熟练骑自行车时，即使想摔倒，也不容易摔倒；不会骑车时，不想摔倒却还是会摔倒。因为熟练时意识不用思惟控制，意根已经掌握了，能够自如的指挥控制；不熟练时，意根没有学会，意识就要反复思惟熏染意根，直到意根完全掌握，能够自由控制，意识就不用什么心思了。</p><p>有些人总说自己做某件事时是无意的，可你意识再怎么无意，意根却是有意的，是意根在推动着做某件事，某件事才成就了，只是自己不知道而已。熟悉的运作情况下，无意识和下意识的动作，皆是意根在运作指挥操控，而不是意识，意识只是单纯的配合意根，没有什么思想意见看法。再有，意识无意时并不等于意根无意，意根无意时，心才是真正的无为了。</p><p>二十八、定是慧的前提</p><p>多动症的孩子，由于精力不集中，一般来说学习都不好；同样，学佛心散乱，也不能修行好。算算数题的时候，意根精力集中与不集中，结果就不同，表面看就是意识的专注与不专注，意识专注与否是由意根决定的，专注用功时，发挥的不同，思惟能力不同，智力不同，结果就不同。诗人吟诗作画，凝神静思，踱步推敲，与参禅的功夫一样。有定才能有慧，学佛这样的大事，没有定绝对不能成办，定浅也不能解决问题。</p></div>"
},{
    "title": "第十五章 心所法与种子的关系",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章  心所法与种子的关系</strong></p><p>一、心所法就是心的运行行相</p><p>心所法就是心的运行行相，也就是心态、心念、心行、善心、恶心、不善不恶心、定心、散乱心、智慧心、愚痴心、无明心等等，范围非常深广。几个识心的这些行相运行出来时，第八识就会随时随地记录收存下来，成为了种子。这里的种子是指业种，不是指七大种子。</p><p>在身口意运行时，七个识的心行心所法都要记录在第八识里，成为业种。当第七识意根不与六识在一起运行时，意根的心所法，还能成为业种吗？意根单独的诅咒发毒誓，有人真受害了，这个能成为业种否？意根入到亲人梦里求救等等，入到冤家梦里恐吓人，要死去的人意根来见自己等等，这些都能成为业种否？无想定灭尽定里，意根的心行，能成为业种否？无想天的天人的入定情况，能成为业种否？</p><p>昏迷没有六识，这个情况能成为业种否？属于受报否？一天睡眠十多个小时，这时都没有六识，能成为业种否？属于果报否？天人不用入胎，人必须入胎，入胎属于果报否？能成为业种否？住胎时间长短属于果报否？能成为业种否？</p><p>以上的各种情形，各种心行，都是业，都会存入业种，都有果报。十二因缘法第一个链条：无明缘行。意根最初的无明虽然不是业种，但是意根因为无明，起心向外攀缘，想要明了什么法，于是如来藏随顺，就共同造就了宇宙器世间，之后每个人的如来藏又造就了五阴身。业行就出现了，之后就有业种。</p><p>二、意根单独的活动属于业行也存种子</p><p>修净土者在娑婆世界修行得力，意根与如来藏到极乐世界化现莲台，这是业种；业种成熟，死后到极乐世界莲花里化生，这是修行的果报。修行时存下了业种，种子成熟，到极乐世界受善报。意根离开意识在极乐世界促成莲花台的出现，这也应该属于业行，也属于修行的果。但这个果最终能不能得到，还要看因缘，看种子能否成熟；如果修行退步了，不成熟的种子就枯萎了，极乐世界的莲台就消失，临终不能往生。</p><p>睡了一宿觉，早晨一醒过来，意识就觉得想通了一件事，明白了一个理。这一宿当中意识没有出现，完全是意根自己单独的思想活动，结果想明白了一件事，意识出现时就明了了这件事。这也属于业行，也存种子，也有果报。如果意根这一宿都在念佛、念咒，或者是一宿都在参禅，即使没有意识出现也是修行，而且是最好的修行，最成功的修行，属于业行，也存种子，也有果报。但是意根单独所作的思想活动和参究活动，但是从前与意识一起修行，受意识熏染的结果，所以意根单独的业行，也属于果。</p><p>如果意根半夜跟人讨论佛法，也能增长智慧。如果半夜去找观世音菩萨请法，观世音菩萨还耐心解答了，醒过来以后，意识就明白了，就得到佛法的甘露了。如果得大病了，意根半夜去找仙人或者是菩萨讨药吃，吃了以后，第二天就醒过来病好了。这属于业行，存种子，也有果报。</p><p>三、业种与心所法的关系</p><p>如来藏了众生心行，是指了意根的心行。当意根心行现起时如来藏才能了知，并为其出生前六识等种子。一切法是由意根作主促成的，意根不抉择造作，六识就不出生。所以如来藏一定是配合意根的，一定是了知意根心行的，之后才能出生六识完成意根的心行。如来藏在一切法的运作中主要是和意根的互动，同时也随顺业种。业种成熟的时候，不管意根是否需要和喜欢厌弃，如来藏一定要把业缘现行出来。</p><p>业种就是心所法运行的记录，身口意行就是心所法，一切行为都是心所法。心所法清净，行为就清净，业种就清净。心所法改变，业种就改变。身心相应，比如嗔心所法出现，身体发生变化；轻安禅定心所法出现，身体发生变化。心所法是谁来改变的？是心所法改变了心所法自己，自己改变自己，不是佛改变自己，不是如来藏改变自己。所以修行无论如何都是自己修，不要指望谁人能代替，觉得加持一下就登天了，不是这样。</p><p>四、意根能否使如来藏把法寄存在很重要或是不重要的处所？</p><p>问：有人说：意根亲自经历后想要攀缘的某一个法，由于意识没有极强烈的意愿想要记住，意根依循意识的判断，就不会使如来藏寄存在很重要的处所，于是时间久了以后就忘了。意根能否使如来藏把法寄存在很重要的处所或者是不重要的处所？</p><p>答：如来藏无形无相，里面没有处所，祂也没有里外。六识造作形成的业种是无形无相的信息，同样也不能有形相和处所。如来藏里既然没有处所，当然就更没有处所重要与否之说了，如来藏也不能了别业种和业行的重要与否，祂没有这种判断能力，也不能分别哪个法重要与否。那么业种的收存就不可能是按照法的重要与否来收存了。退一步来说，即使如来藏里有重要和不重要的处所，也不是意根使得如来藏按照法重要与否来存种子，这与法理不通，与如来藏法尔如是的自然任运的存种子之理不通。</p><p>事实上，五阴身心所造作的一切法，如来藏不加鉴别的随时都要存入心体中，业不同，种子不同；心行不同，种子也不同，种子成熟的时劫也不同。什么叫作心行不同呢？就是说意根和意识在法的运行中的表现，有否贪嗔痴烦恼，是有心还是无心，是故意还是不故意，思想观念是什么，是否执着，是否厌离，是有智慧还是无智慧，是定心还是散乱心等等等等，不一而足，总之就是几个识心的心所法。六七识心行不同，对法的关注不同，用心不同，形成的业种就不同。通俗点说，业种就是心的行为的记录，心行不同，记录当然就不同了。</p><p>另外一方面，对所经历的法，意识有时候是用心想记住，关键是还要看意根是否有心想记住，意根不想记住，无论意识如何想记住都没有用，最后都记不住。记住与记不住都存种子，但存的种子却截然不同。能分清意根与意识的主从关系，就不会把意识的作用抬这么高了。</p><p>五、第八识对业种的了别</p><p>没有成熟的业种，第八识能不能缘？当然能缘得到，也能了别得到。俱解脱的阿罗汉的神通能知众生八万大劫前后的事情，这么长时间以后才能发生的事情，阿罗汉为什么能知道？因为阿罗汉的意根依自己的如来藏了别到未来世才能成熟的业种，意识依意根也就能了别到未来世的业种现行情况。有神通的地上菩萨所能了知的事情，要远远超过阿罗汉，比八万大劫这个时间范围还要大，佛的神通道力比菩萨们还要殊胜无比，能知道一个无量劫两个无量劫之后的事情。比如佛为八地菩萨授记一个无量劫以后的某时成佛，偶尔也为初地菩萨授记。</p><p>佛菩萨阿罗汉是如何了别到这么久远以前或者以后的事情？这都是禅定和智慧相结合的结果。佛菩萨和阿罗汉是哪个识心知道久远劫以前和久远劫以后的事情的？是意识知，意识从意根那里知道的，意根是从如来藏那里知道的，如来藏了别业种知道的。但如来藏知的内容与六七识知的内容有所不同。</p><p>佛如果观察众生，能观察众生三个无量劫以前的经历，甚至无数个无量劫以前的经历，这是怎么回事？久远劫前所发生的事，如对目前，就像看着眼前正在发生的事一样，这就是现量观察到的，是现量境。包括久远劫以后发生的事，如对目前。久远劫前发生的事，那个业可能早就消失灭亡了，久远劫以后要发生的事，业种远远没有成熟，佛是如何知道的，哪个识心知道的？有的业种还没有形成，业行还没有造作，佛是如何知道的，菩萨是如何知道的，阿罗汉是如何知道的？</p><p>一个外道有神通，也能知道一两年以后几年以后发生的事，业种同样是没有成熟，他是哪个识了知未来的事情的？算命先生也能知道临命终前要发生的事情。没有神通的人，如来藏也能缘没有成熟的业种，意根依如来藏能证得未来世将要发生的事情，只是意识无法从意根那里知道。</p><p>八地菩萨才能六根互通，俱解脱的大阿罗汉能六根互通。普通的神通离六根互通差得极远，也能知未来世的事情。这个知是意识知，那么意识能知未来世没有成熟的业种吗？意识显然不能知业种，不管是现在的，还是过去和未来的。但是意根依如来藏的见大作用一定知，意识依意根就能知未来世的事情。楞严经中佛说意根默容一切法，容就是容纳容受，一切法就是如来藏所见的全部法，意根随之都能见。</p><p>六、意根的推动作用</p><p>业种，是意根欲有所做之后如来藏配合出生六识造作形成的，但是有很多法的出现，并不是由意识推动出来的，完全是由意根单独推动出来的。比如说在五受阴没有出生之前没有意识，是意根促使如来藏出生宇宙器世间这个生存环境，再出生五阴身，才有了意识，才有了五阴身的行为，才有业种出现的；在睡着醒过来之前没有意识，是意根想醒过来，之后才能醒过来；在昏迷的时候没有意识，是意根根据身体状况想醒过来，之后才出生六识醒过来的；在母胎里最初没有意识，是意根想投胎就投胎，想住胎就住胎，想出生就出生的；在无想定、灭尽定里没有意识，是意根住于定中，再出定才有意识的产生。在这些没有意识的情况下，意根所经历的事，都有如来藏记载存种子，对后世都有影响，有神通的人都能了知到。</p><p>七、身心的相互关系</p><p>身心互相影响，互相关联，关系紧密，甚至是刹那刹那都在互相牵制。三个能变识刹那刹那改变着色身，色身也刹那刹那影响识心的觉受和想法。</p><p>佛说，如来藏中七大种子永远是清净的，不善不恶，不管它们帮助众生造作了什么善恶业，回到如来藏中仍然是绝对清净的。众生是由清净的七大种子构成的，只不过识心的心所法不清净罢了。</p><p>修行其实就是在修行心所法，不是修七大种子，不是修识种子。心所法有明也有无明，最初时都是无明，最后都是明。中间的过程就是修道修心的过程。从心所法上能了解众生的心行，从心所法的变化上，能了解众生修行的程度，心行转变的程度。意识发生变化以后，让意根也发生变化，身心立时就发生变化。</p><p>身心转变主要是意根转变的结果。修行出现禅定时，身体立时就发生变化，所以禅定一定是意根有定，意根心转变了，不再严重的控制色身和攀缘境界。</p><p>八、习气是否有种子</p><p>某种事情经常做，做习惯了，以后遇到类似的事，就会不知不觉的去做，叫作习气。习气在意根，意根习惯做的事，就有习气现行出来，意识对意根的习气往往不知不觉。习气分为好习气和坏习气，坏习气属于无明烦恼，意根无始劫以前就存在着无明烦恼，叫作无始无明，它没有种子。可是意根无始劫以前却没有烦恼习气，因为没有五阴身的造作，也就不能养成习气。后来出生五阴身以后，意根利用五阴身不断的现行无明烦恼，也就形成了习气，造作的无明烦恼就形成了种子，因此习气是有种子的，无始无明却没有种子。</p><p>五阴身生生世世在世俗界运作中，不断的增加和减轻无明，无明习气就要不断的增强和减轻。所以修学当中所断的一切无明烦恼，都是以断意根的烦恼为主，意根烦恼一断，意根的烦恼习气以及六识的枝叶烦恼慢慢就会随之消失殆尽。实际上，在修行过程中，却是意识先降伏和断除烦恼，因为意识明理快，明了正理就能修证自心，意根烦恼深重明理慢，修正自己很困难。所以意根不降伏和断除烦恼，意识的烦恼断除之后还会依意根再生出来。修行就是要断除意根的所有无明，增长意根的明，无明断尽，明到极限，佛道成。</p><p>九、意根与意识合作中的秘密</p><p>意根与意识合作中有很多秘密要去挖掘，不是像流传的那样简单。意根胜解与不胜解，存的种子也不同，意根有心无心，存的种子也不同，意识占主导和意根占主导，存的种子也不同，意识知道的而意根没有证得存在的种子，与意根同意识一起证得存在的种子也不同。佛法非常精细，不是像大众流传的那个样子。</p></div>"
},{
    "title": "第十六章 意根与第八识的关系",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十六章  意根与第八识的关系</strong></p><p>一、开悟之前的猜想假设，永远做不到心空</p><p>一切法都是第八识变现的，都是空的。在六七识没有证得这个真实理之前，只是猜想和假设，没有真实证得的时候理是理，你是你；空是空，你是你，二者没有瓜葛。开悟之前的猜想假设，永远做不到心空。在开悟之后，经过不断的对第八识和五阴世间的有效观察，心才能逐渐的空一些，断除烦恼入地之后，心才能空一大部分，直到八地菩萨以后才能空去绝大部分。只有真正实证第八识，才能逐渐的转依于第八识的清净体性，转依成功，六七识就会转识成智，成为地上菩萨，完全转依成功就成佛了。所以第八识的空，不能代替六七识的空，六七识必须经过修证，才能认识和证得空，之后心才能空，否则口空心不空，烦恼魔就不离身。</p><p>在六七识没有完全成功转依第八识之前，第八识所具有的种种清净体性，不代表六七识也是如此。比如说第八识从来不持戒，但六七识不能像第八识一样不持戒，因为第八识没有无明烦恼，永远不会犯戒，那就不用持戒，祂也没有心去触犯什么。而六七识则不然，烦恼染污极重，经常为自己私利造恶业，如果不持戒，恶业就会无休无止，恶报也就无休无止，那就无法脱离恶趣和六道轮回苦，不能得解脱。</p><p>再比如说第八识不修定，六七识却不能像第八识一样也不修定。因为第八识心从来不散乱，从来不攀缘一切法，又有无上智慧，心常在定中，不入定也不出定。六七识就不行了，散乱如猿猴，念念变异无有定止，心水浑浊，看不清真理和真相，愚痴烦恼重重，因此必须修定，以降伏自心，有能力善思惟，求得真实的智慧解脱。再比如说第八识不断烦恼，六七识不能不断烦恼，因为第八识没有烦恼可断，而六七识烦恼无明极多，如果不断，沉于生死苦海，无有出期。</p><p>如果要与第八识相比，那就比在世间五欲六尘中，第八识是如何清净的，六七识也要像祂一样清净；第八识如何是无我无私的，六七识也要像祂一样无我无私；第八识是如何永无休止的勤劳为众生服务的，六七识也要学过去；观察第八识是如何具足一切智慧的，六七识更要学过去，只有这样攀比，才能早日成佛。但是如果没有真实证得第八识，与第八识还攀比不上，想像的第八识体性，无法成为自己真实所缘，不能改变自心。因此还需要努力修行菩萨六度，以期实证。</p><p>网络上各种空的调门，空得天花乱坠，实际上尽管高喊各种空，心无论如何也空不了。必须实证到空，见到了空，心才能开始一点点的空。没有证得空，都是口号似的，都是想像思惟，无济于事。但是对于实修之法，过去世没有修习过，都不知道如何实修如何实证，都是想像的修，想像的证。究根追底，就是福德不具足，以及禅定等等戒定慧因缘不足。</p><p>二、意根是否也默容如来藏</p><p>问：意根默容一切法，包括默容如来藏，如来藏对一切法不自作主，没有我性，必须与意根一起运作，与意根密不可分。是否可以说意根是心王，而如来藏是意根的心所呢？</p><p>答：意根虽然是默容一切法，但这一切法不包括如来藏，因为意根不知道有如来藏，也不知道如来藏具体有什么用处。意根是默容如来藏所起的那些功能作用，喜欢和执着如来藏所起的那些作用，而不知道这些功能作用都是如来藏的，误认为都是自己的功能作用，才一直不断的加以贪爱和执著。</p><p>如果意根能默容如来藏，祂应该知道如来藏的运作，知道五蕴世间法都是如来藏运作出来的，没有自己什么事。这样的话，意根不仅能断我见，也能断我执和法执了，祂心里的无明都应该能破除了。事实上却不是这样，所以说意根不是默容如来藏，而是默容如来藏所起的功能作用，以及所变现出来的一切法，把如来藏的那些作用误认为是我的功能作用，叫作内执如来藏的功能为我。也所以意根才会生起我慢我爱我执等等诸多烦恼，无明深重。</p><p>如来藏虽然没有作主性，不会主动主宰一切法，总是随顺意根去运行一切法，离不开意根。但是如来藏并不归于意根所有，祂不是意根的心所，意根并不是如来藏的心王，而正相反，如来藏是心王，意根是心所，归如来藏所有。因为如来藏能决定意根的存在与否，为意根提供生存的种子，所以如来藏是意根的心王，意根是如来藏的心所。从另一方面来说，如来藏并不能总是随顺意根，很多时候，如来藏是随顺业种，意根的许多愿望和所求，如来藏都满足不了，却能永远不断的输出业种，随顺业种。所以意根没办法作如来藏的心王，如来藏不能是意根的心所，不归意根所有。</p><p>三、如来藏和意根谁是真正的主宰者</p><p>如来藏所对应的法、了别的法多于意根所对应和了别的法，意根所对应和了别的法远远多于意识所对应和了别的法。从这里就看出，一是如来藏出生了一切法，祂无所不包；二是体现了意根对意识的作主性，意根是妄法的主宰和代表；三是体现了意识的依他起性和不自主性。</p><p>对于一切法的处理，表面看都是意识来处理的，其实都是意根在背后指挥处理的，实质上都是如来藏用七大种子处理的，如来藏才是一切法的主宰者。其处理速度，如来藏是无速，当时当下，须臾没有与法分离过。如来藏对于法的处理，一是依据业种，二是依据意根的所求和对法的抉择。</p><p>意根对于自己能清晰了别的部分，处理得相当快，在意识不知的情况下就能处理完了，意识为后知后觉，如色身出现的一些微小事变，意根马上就能处理掉，偶尔要借助于意识处理。意根对于自己了别不清楚的法，要借助于意识的了别，其处理也要借助于意识来处理，其处理速度慢于意识。意识单独无法处理什么事，都是配合于意根处理，或者协助意根处理，或者是要挟意根处理，意根不同意，意识什么也处理不了，但不排除意根被意识欺骗和强制的情况。</p><p>四、五阴与名色</p><p>五阴也叫作名色，色是色阴，名是受想行识四阴，四阴不可见，只是一个名字。色包括根身与内外六尘，不包括本质境。意根和第八识刚开始入胎时只有受精卵这个色，没有别的色，只有意根这个名，没有别的名。一切法都只是一个名字，没有其实体和自性，除了如来藏本体和性用。唯识中五法三种自性：相、名、分别、正智、如如。第八识出生的一切法有法相，给各个相安立一个假名，用识心给与分别，正确的认知就是正智，这一切法都是如，是如来藏出生和显示出来的假相。</p><p>身行，是身识和意识共同运行出来的，口行是身识意识运行出来的，意行有表面意识的心行，也有深层次意根的心行。身口意行背后同时都有意根的意行。我们给六识的某种功能作用取个名字，叫作行阴，叫作想阴，叫作受阴，叫作识阴，也都是名字而已，没有实际的功能作用。实际的功能作用是什么？ 都是第八识的功能作用。</p><p>行阴的蕴集，是谁蕴集出来的？想阴的蕴集是谁蕴集出来的？受阴的蕴集，是谁蕴集出来的？识阴的蕴集，是谁蕴集出来的？第八识完完全全有蕴集的功能作用。大乘甚深法中，第八识也应该有蕴的作用，能蕴集五蕴，配合意根出生五蕴。第七识意根当然也有蕴集作用，调动第八识来蕴集一切法，其功不可没。</p><p>识心在色身五根上的功能作用，叫作受想思，色身与识心联合起来，有五阴的功能作用，有五蕴的功能作用。色身是识心的工具，六识是意根的工具。</p><p>五、妄本无因因迷而有的意思</p><p>妄本无因，因迷而有。这与因缘法并不冲突，因为无始劫以前，意根没有任何原因心体里就有无明，但并没有产生这些无明的因。因为意根的无明，又出生了一切虚妄法，这些虚妄法的产生，只是因为意根迷惑颠倒才出现的。这就是妄本无因因迷而有的意思。因为意根有这些无明，如来藏才出生后边所有的一系列法，符合十二因缘法。</p><p>六、死后意根和如来藏的表现</p><p>死亡时，意根决定离身走人以后，第八识配合离身，人就死了。死亡过程很复杂，可能要经过八个小时或者十多个小时，才能真正死亡。第八识舍身的部分，色身就变得冰冷和僵硬，因为四大分解开了，身体上就没有了火性、风性、水性和地性。</p><p>这个时候意根在干什么？是否离身了？六识灭去时，意根就会离身，但是因为意根执著一切法，包括自己的尸体，因此一定还会眷顾自己的尸体，那么如来藏就不能完全不管这个尸体，管的方式与管理五阴身的方式肯定大不相同了，因此尸体毕竟不能有五阴身的功能作用，而且要渐渐的腐烂消失，于是意根就执著剩下的骨头，那么如来藏也不能完全不管骨头，管的方式与管理五阴身和尸体还不同，以至于骨头渐渐的风化消失。</p><p>即使意根不执著尸体和骨头，尸体和骨头也有着个人的标记和信息，不会抹杀，大神通者凭借一块骨头，就能了知骨头的主人过去与未来的一切信息。要想人不知，除非己莫为，造业的痕迹永远抹不掉。每个人无量劫出演了无数出闹剧，自己都忘了，只去看别人的闹剧。</p><p>七、意根和第八识各见什么法</p><p>意根刹那刹那跟随着第八识，离不开第八识，第八识也是刹那刹那伴随着意根，二者形影不离。没有意根，第八识不能变现任何一个法，离开第八识意根就灭，也不会有任何法可见。所以意根所见的法，都来自于第八识，依靠着第八识而见法，只要第八识现出法来了，意根依之就能见得到。那么问题来了，意根究竟见的是什么法呢？与第八识见的内容是否相同呢？</p><p>我们应该知道，第八识是圣义谛，意根是世俗谛，所以第八识见的都不是世俗法的内涵，有别于意根所见的内容。而意根也不能见第八识所见的法的内涵，二者身份地位不同，功能作用也不同，对于法所见的角度、层次、次第和内涵等等都不会相同。</p><p>二者对于法的引生功能也不同，见法之后，对于法的抉择作用也不同，抉择之后，对于法的处理也不同。总体来说，意根和第八识对于法的作意、触、受、想、思都不同。因为意根是世俗谛，第八识是胜义根，世俗代表着无明和烦恼，圣义谛代表无无明无烦恼，所以意根有无明有烦恼，第八识无无明无烦恼。</p><p>因为意根见的是世俗法，就会引生出烦恼，引生出我心出来；第八识不见世俗法，就没有世俗烦恼可言，清净无为，没有我。那么我们如果讲法之后，不落在世俗相中，也会与第八识一样不引生我出来，不会生起烦恼，心就清净了，大放光明。</p><p>到底意根见的是什么法呢？既然意根见不到第八识所见，又紧密依第八识而见世俗法，第八识见法之后就会不断的传播和显现变现，经过第八识变现之后的法，就是世俗法，这部分才能被意根所见。</p><p>第八识见到的是最原始的法，最根本的法，没有被七识动过加工过，七识触及不到。第八识见过原始法之后，就会吸取法中的四大微粒开始传播出来，形成影像，就属于世俗法部分了，意根就见这个影像，第八识传播过程中会经过一些中间的介质，四大微粒就会被遮挡一部分，第八识所传播的法就会改变一部分，不管第八识所传播的法中途改变多少次，意根都能依之有见，直到法落在后脑胜义根里，意根一直都能有见。</p><p>那么意根所见的法，就是第八识见原始法之后变起的各种层次的世俗法，第八识一路上所传播的法意根都能见得到，所以意根能了知这个法一路的改变状况，对于意识六识来说，意根叫作未卜先知，叫作预感和灵感，没有语言文字和思惟，却能知一切法判断一切，很多都是不容意识辩驳和抵抗的。</p><p>第八识所见的原始法是什么，当然不离构成法的四大种子，是种子的结构相貌比例成分，这部分不会引起第八识出生烦恼，如果七识都是见的这些内容，当然也不会引生出任何烦恼，因为不是世俗法，没有任何世俗法的利益和利用价值。</p><p>第八识见过原始法之后，变现出的世俗法，还见不见呢？当然会一直见，否则意根就见不到了。但是第八识虽然也能见意根所见的法，绝不会落在世俗相里，第八识不见法的世俗相，见一切法都是见法的圣义谛相，就是法里所含藏的种子内容。所以第八识见大千世界所有法，无法不见，却没有烦恼，也没有无明，没有不知，光明朗照大千，也不想拥有大千，没有我心贪心和嗔心。</p><p>七识所见的世俗法，都见错了，不是事实真相，因为无明，所以有烦恼。法的事实真相是什么？就是第八识所见的种子内涵，无别法，一切法都是种子，无别法。所有种子都是第八识所有，所以第八识是大富长者，不需要去拥有什么，更不会去贪图什么，穷人才有贪，人穷必然会希冀得到什么，心穷之人才会贪得无厌。第八识很知足，也表现不出知足的心境，祂没有心境，没有感触，从不感慨万千万亿的，平静寂静。</p><p>第八识才是原始佛法，原始佛教，没有第八识什么法也没有，连意根都没有，更没有六识，没有五蕴；没有第八识七识什么法也见不到，不学第八识，只截取第八识衍生出的极少一部分法，就是愚痴。所以佛说阿罗汉是愚人，凡夫是痴人。</p><p>八、意根与第八识的联系</p><p>意根和第八识两个识紧密相连，意根离不开第八识而存在，离开就灭了。但不妨碍各有各的体性和心性，各有各的功能。意根所了别的是第八识变现出来的法，因为了别的法很多，智慧不够细微，只能了别个大概和大框。要想细了别，必须让六识来帮助了别，然后才能做抉择。</p><p>第八识没有我性，完全依据业种来造就一切法，也依据因缘和意根的意愿来出生一切法。第八识如果要运行一些法，必须有意根同时运行，如果没有虚妄的世俗法需要运行，第八识就涅槃无所作为。</p><p>九、意根与如来藏密不可分</p><p>离开第八识就没有第七识。两个识必须捆在一起，共同运行，第七识才能有作用，第八识也才能有作用。第七识只要没有消业，业种成熟的时候，必随成熟的业种现行而投胎受报。不能说第八识舍报，因为第八识没有果报，不造作世间身口意行故。</p><p>修行是有次第有步骤的，先降伏自我，压伏自我，然后断除自我，最后去执。前边没有做到，后边就不能做得到。</p><p>十、意根和如来藏就是鱼水的关系</p><p>如果把鱼喻为虚妄法，把水喻为妙明真心，鱼离不开水，妄法离不开真法。鱼动水就动，水掀起浪花，鱼不动水就不动，波平浪静。意根动如来藏就动，现起境界，意根不动，如来藏就不动，涅槃寂静。</p><p>十一、意根和如来藏谁适合做电影制片人</p><p>制片，就是制造，需要资金原材料。意根没有这些东西，祂没有库房，没法存储。只有如来藏具足这些法，有一切法的种子，才能创造出一切法，这相当于制片的角色。如来藏根据业种制片，业种就是如来藏的选择，这就是有为法。</p><p>如来藏也有有为性，一切法都是如来藏有为出来的。若如来藏完全无为，一切事都不管，世间就不会出生和存在了，五蕴也不会有，甚至意根也不会存在。有什么样的片子，确实是由如来藏说了算，意根说了不算，无法作主。决定了片子，就决定了业报，因果由此酬尝。</p><p>十二、如来藏对意根和意识业行的记录</p><p>问：电影演员扮演反面人物或演坏人，演的很真切，入戏很深，这时如来藏要怎样记录演员的业行，业种如何？</p><p>答：演戏又名假装，心行不是真实如此。所谓的演戏假装，就是意识认为应该如何做，而与意根思想不相一致，行为为意识的造作，意识尽量去真实表现非意根所具有的心行，让人觉得像是真实的，真有其事。</p><p>意识主观现起的业行，与意根主导控制出来的业行，有极大的差别，存的业种不同，果报就不同。就像家中的孩子做坏事，与家长做坏事，性质不同，受到的处罚和责罚就不同，孩子受到的责罚轻微，家长受到的责罚就重。</p><p>而孩子在受到责罚时，一定会连累到家长，要家长代为受罚。意识主观造业轻微，但责罚也会落到意根那里，意根自主造业，责罚全部落到意根自己身上，家长要承担一切责任。但是家长所应该受的也会让孩子具体承受，或者代为承受，家长尊贵故；意根的果报具体也会由六识代为承受，意根主人尊贵故。</p><p>造业时存什么业种，将来受什么果报，完全在于意根的心行，或者以意根的心行为主。演戏的是意识，是假装坏人做坏事，意根并不坏，所以本质上就不坏，就不能存恶业的种子。如果意根在游戏中动心了，起了与戏中同样的心行，那就不属于演戏了，就是纯粹的造业，业种就被如实记录。如果意根没有动心，只是意识假装，也有业种，所有的行为造作也要记录下来。但是业种的性质不同，有什么样的业种和果报完全由意根的心行决定。</p><p>如果意识在游戏过程中，没有演好，演的不像，说明意识的技巧不够好，说明意识与坏人角色不太相应，也说明意根不坏，没有把意识熏染坏，就不得不努力假装坏人，发挥得不够好。但是即使意根是一个非常好的人，但意识的演戏技巧高超，会演会装，入戏就会快而深。所存的业种也是演和装的业种，不是意根坏的业种，果报就不坏。如果长期假装坏人，也会暗暗的熏染意根，让意根不知不觉的熟悉了坏，适应了坏，就有可能某时就坏上一回。</p><p>同理可证，在修证佛法过程中，仅仅是意识证果，而意根不证果，是假证，不是真证，相当于演戏差不多，也存种子，但善果轻微。真正的实证，是以意根为主导的证，主人都证果了，手下还有什么好说的，随主人受果报享受果位。没有说意根主人没有证果，手下意识单独就能证果享受果位的，难不成仆人还能在主人之上，位高于主人，喧宾夺主吗？没有此理。</p><p>十三、意根与如来藏各自相对应的相分</p><p>问：外六根触外六尘，产生的外六入是外相分，还未成为内六入，主导六根接触外六尘的，是否由意根粘出如来藏的四大种子去接触呢？</p><p>答：外六尘本来就由如来藏的四大种子所生，生出来以后，如来藏不断的输出四大种子，以维持外六尘的存在。那么外六尘只能由如来藏去触，意根所触的，是如来藏摄取外六尘四大以后所幻化出来的那部分，不能触如来藏实四大种子所出生的实外六尘境界。</p><p>意根如何粘出如来藏里的四大种子呢？共业众生的如来藏共同变现出来的外六尘，只有如来藏才能触得到，这些外六尘的四大种子不断的生灭变异，四大微粒不断的散发出来，各个众生的如来藏触到以后，吸收传播，这个过程如镜现像，意根才能接触到如来藏传播过来的像。然后经过六根传导到胜义根里，成为内六尘。意根在如来藏现像的一系列过程中，依如来藏都能了别，只是能否了别清楚。所以意根对一些法能够非常快速的做出反应，意识还没有反应过来，意根早已经处理好了。意根是先知先觉，意识是后知后觉。只有意根实在了别不出来的法，依靠意识的了别才是后知后觉的。</p></div>"
},{
    "title": "第十七章 意根杂说",
    "author": "生如法师",
    "date": "2020年08月22日",
    "html": "<div class=\"B1_text\"><p><strong>第十七章  意根杂说</strong></p><p>一、无余涅槃以后意根就有一个出生的时间</p><p>问：俱解脱的阿罗汉，有能力灭了意根，让五阴十八界消失。那么俱解脱阿罗汉灭了意根之后，有可能再从如来藏中生出意根吗？假如可能的话，那么意根不是变得有一个开始点了吗？</p><p>答：无余涅槃以后，再出生时，意根当然会有一个开始点。在无余涅槃之前却没有开始点，因为无始劫以前心中就有一念无明，因此意根一直没有灭过。</p><p>入无余涅槃时，意根灭去了，是谁灭了意根，有灭意根者吗？如果有灭意根者，这个就是一个我，一个作主者，此人就没有断我见和我执，不能入无余涅槃。在临涅槃时，如果意根心里想：我要灭掉自己，有这个心念，就没有断掉执著，就不能入无余涅槃。如果是如来藏要灭掉意根，如来藏就有作主性，有七识那种我性，就不是无我性的如来藏了。那么意根是如何灭去的呢？临终时，意根万念俱灰，心所法都不出现，如来藏无可奈何，无法再输送种子，意根自我就自动消失不出现了，这就是无余涅槃。</p><p>二、点石成金的原理</p><p>所谓“点石成金”的神通力，是意根发指令，如来藏把出生石头的种子改变了，改变成能组合成金子的种子，石头就变成金子了。意根能让自己的如来藏把石头转化成金子，有可能让众生如来藏共同执持的外尘如石头变成金子吗？或者，有可能让别人的如来藏把石头转化成金子吗？答案是有可能，也完全能够。众生通过内在力，能够把外界共同的物质据为己有，为自己所用。比如一切能吃的饮食，一切能穿的衣服，一切能用的物品，这些物质或者是被自己所毁坏，或者被自己单独所用，或者被自己所改变。石头变金子就是公共的石头被自己所改变，成为自己单独所拥有的物质了。</p><p>点石成金主要依靠个人的禅定力，同时也要依靠福德力，如果福德不足，纵使能把石头变成黄金，个人也享用不到。福德是成就一切事业不可或缺的一个重要条件，一个真正的修行人永远不会嫌弃自己的福德多，永远不满足于自己的福德，也不会随意消耗自己的福德。</p><p>三、初地菩萨永伏性障如阿罗汉是什么意思</p><p>性，指众生的本性，众生的根本之性是意根之心性，意根之心所法。正因为意根之心性不善，才一直遮障着众生证得无上菩提，所以消除意根心性之障碍，才能成就佛道。</p><p>初地菩萨开始一点点断除意根的所有烦恼习性，但不可能完全断除。在不能完全断除的情况下，有些影响三界生死的性障是要降伏下来的。从另外一方面来说，意根的烦恼现行如果完全断尽，就会如四果阿罗汉一样断尽人我执著，就会入无余涅槃，不能成就佛道。佛要求初地至七地菩萨不入解脱道的正位，也就是不取四果阿罗汉的果位，以免不小心入无余涅槃。</p><p>所以初地菩萨要留一点点贪爱，以保证还能在三界世间出生。但不能留严重的贪爱，只能留一点轻微的贪爱，对禅定之类的有点贪就行了，也可以有对大乘法的贪，就是永远压伏意根的贪，而不是完全断尽，才能生生世世自利利他，直至成佛也不入无余涅槃。</p><p>四、色身与识心的关系</p><p>色身休息不好为什么会影响意根？身心互相依倚，这个心表面来看好像是指六识，好像是指意识，实际是意根依靠色身，利用色身来感知境界，之后就会有所造作。表现比较明显的是在没有六识的时候，意根完全的依靠色身而活，当自己的能力达不到时，就唤醒六识来替自己办事，于是就出现了身口意行。</p><p>色身状态不好能影响六识和意根，身根只是四大组成的木头一样的东西，没有任何觉受，有觉受的是身识，不是身体。如果身体有感觉，死人的身体也应该有感觉，木头石头也应该有感觉。所以能感觉的一定是识心，不是物质色法。</p><p>身心互相影响，因为身体的四大状态不同，如来藏依之变现的内六尘就不同，尤其是触尘不同，识心了别之后的觉受就不同，思想行为就不同，作出的决策就不同。同理，识心也能影响和改变身体的四大物质，意根认为自己能做某些事，意志力顽强，即使色身状态不太好，也能做得很好，色身的状况也能改变。</p><p>五、意根与身口意业行的关系</p><p>身业、口业和意业三者的关系是什么？哪种业容易防守，哪种业最不容易防守？哪种业粗糙易断，哪种业细微难断？应该先断哪种业？</p><p>身口意三种业行，都受意根支配和调动，身业是六识的行为造作，口业是六识的行为造作，意业分为意识的心行心所法和意根的心行心所法。身行口行受心支配，无心不能造身口业。身口业由六识造作，六识受意根指使。但意识明理可以压伏意根，强制不造身口业，所以身业最容易断，口业次之，二者用意识压伏就行了，难断的是意识的心行，最难断的是意根的心行。</p><p>意根非常不容易压伏降伏，更不容易断除烦恼，因此意根的意业肯定是贪嗔痴不断，只不过意识明理，知道因果，会降伏压伏身口不造作恶业。如果意根烦恼重，身口也压伏不了，一定会造作恶业。所以身体不造作杀盗淫相对来说比较容易，口不造作两舌妄语绮语恶口也稍微容易一些，最难的是意根，贪嗔痴念头无法降伏和压伏，更难断除。</p><p>有一些人一看身体守戒比较困难，口守戒也比较困难，于是就找借口说我守意业就行了，只要心清净意业不犯就行了，身口无论怎样都不算犯戒了。这是最颠倒的愚痴想法和做法，如果连身体的造作都控制不了，更不能控制意根的烦恼念头，如果口业的造作都制止不了，就更不能制止意根的烦恼念头了。意根的烦恼念头如果能止住了，那是三果以上圣人才能做得到的，一个凡夫怎么能直接守意根的意业，让意根清净不犯戒呢？</p><p>小乘的五戒、八关斋戒和出家比丘戒比丘尼戒，一般来说都是以戒身口恶业为主，只要身口不犯，心里邪思邪想也不算犯戒。大乘的戒如梵网经菩萨戒主要是戒心地，修心地，顺便也戒身口。而瑜伽师地论里的菩萨戒，是已经断除烦恼以后的地上菩萨所应遵守的心地戒，一切都以众生利益为首为重，只要能够利益众生，身口可以与小乘戒行不一致，与清净的意根心地一致就行，意根不违背小乘戒律就行，这样一切为众生的心行就是大乘菩萨心行，符合大乘菩萨戒律的规范。如果贪嗔痴烦恼没有断除的凡夫和贤位菩萨，就无法受和守瑜伽师地论中的菩萨戒，有私心烦恼故。</p><p>六、身口意同时由意根支配和控制</p><p>一个问题萦绕在脑海里，久久不能解决。在一个比较闲的时间里，意根决定好好思索一番，于是意识和意根两个就开始苦思冥想。可是为什么苦思冥想的时候，手还会配合拖着下巴，眼睛还会配合微微闭上，这样身体才会安静下来不再乱动？当苦思冥想终于得到答案，解决了问题时，为什么双手要配合着拍巴掌，手舞足蹈，脸上要心花怒放？</p><p>当意根明了当下这个问题很重要的时候，就会专注思考，而顾不上攀缘其他法尘，意根是前六识的作主识，当意根安静的时候，身体就安静了。修不出禅定的人，应该好好检查一下自己的意根，里面都装着什么东西，赶快把意根掏空。降伏不了意根，就不要想有禅定，也不要想能真正精进的修行。</p><p>不少人都以为自己很不错，那也许是意识不错，意根还不是，骨子里还不是不错。真正能看得明白自己的人并不多。有一些人不敢探索自己的内心深处，怕检查出什么不好的思想观念，很多好人的意识要比意根好，说明什么？很多坏人的意根要比意识好，说明了什么？说明了环境的熏染力量是很大的，意识容易受到善恶的熏染。意根比意识好，这种现象是否存在？在比较恶劣的环境下，意识受到了恶熏，就可能要比意根坏，有些坏人骨子里是不坏的，被环境逼迫而已。</p><p>七、心想成佛就能成佛吗？</p><p>楞严经：心想登高，足心酸涩，色身为坚固第一妄想。心想登高，意根就以为自己真的站在高山顶上，心里害怕，就促使脚心酸涩。同理，色身也是意根妄想出来的，是最最坚固妄想的产物。</p><p>那么心想成佛是否也能成佛呢？关键是意根修不到想成佛的地步，准确点说，意根对成佛的信心是不足的，如果信心十足，肯定也能成佛，只是早晚的事。我们现在是信心一点点的增强，离成佛就会一点点的接近。真想成佛的人，修行的精进度非常大，能不顾一切阻碍，放弃一切世俗法，专心修道。</p><p>八、意根的证自证分</p><p>当我说师父是好师父的时候，有意识的证自证分，如果我非常肯定的这样认为，毫无疑问，同时就有意根的证自证分。而意根的证自证分，属于现量了别自己，如果证据不充分，心里没底气，也就不会毫无疑问，意识的证自证分未必是现量的。意根的自证分是现量的，意识的自证分却未必是现量的。现量的，事实充分，绝无疑问，丝毫不怀疑；非量最容易起疑不信，比量心里也不落底，还是有疑不绝，因此不属于实证。</p><p>参禅后的结果里，有意识意根的见分和自证分，也有相分。参禅的结果，是意根的自证分，不是证自证分。证自证分是用来证明自己的，不是用来证明其他法的。很多时候，意根即使证自证分现前，也未必正确无误，如果受意识错误引导的多，意根的证自证分就是错误的。比如在世俗法里的很多知见和观点，意识就认为自己对，意根也非常肯定的认为自己对，事实上却是错误的。比如无始劫以来意根一直认为五阴是我也是我所有的，意识也这样认为，结果证明这是最大的邪见，即使现在再自信，将来也会推翻自己的见解。</p><p>九、如何才能观察到第七识的四分</p><p>第七识的法一般来说都属于唯识种智范畴，理非常深奥，需要修到六七识都转识成智的地上菩萨，才能现前观行意根的心所法和四分，这很难。</p><p>要观察第七识的见分、相分、自证分和证自证分，首先得要证得第七识，然后才能现前观察祂。没有转识成智的智慧时，多数都是分析推理，不能现量观察，这个阶段是以熏习这些法义为主，地上菩萨才以现量观察为主。要知道第七识都对应于哪些法，祂在哪里，如何运作的，才能观察祂的四分。意根的证自证分就是意根的反观能力，这更难观察，没有唯识种智就不要想了。</p><p>观察第八识也需要首先证得第八识，明心开悟具有别相智以后，才能现前观察到第八识的运作，才能观察到第八识的四分。没有证得第八识的时候，对于第八识等于是相似的理解，观察不了。</p><p>十、熏染的力量</p><p>环境熏染的力量是很大的，如果身边有人口痴，总看着他说话，慢慢可能就被熏染有点口痴，外貌生活习惯亦是如此，所以说近朱者赤，近墨者黑。我们一定要多近善法和善人，如果有能力，才去近恶人度恶人。情绪也都是传染的，我们应该多接触乐观积极向上的有正能量的人，自己就能被感染乐观向上，积极进取。</p><p>十一、不按次第修行徒劳其功</p><p>现在学佛人修行没有章法和次第，方法五花八门，想怎么修就怎么修，都是想当然。比如有的人在修如梦如幻观，可是没有证悟的人无法现前观察如来藏的运作，最基本的未到地定没有，初禅定更别想了，这怎么能修出如梦如幻的观行？超越那么多级修行，到底是多大的根器？如梦观修完就是十回向位，马上就能入初地了，禅宗三关过了，生死关过了，那是小乘三果人的证量，到此佛道已经修行了无量劫，其善根福德相当大。</p><p>没有证果，没有明心，没有初禅定，那需要修无数劫才能过这个关口，其中还要经过未到地定、断我见、二果、初禅定、三果、明心、如幻观、阳炎观、牢关，然后才能成就如梦观。跳跃这么多层次来修行如梦如幻观，连意识的理解也很难做到，即使意识能理解一些，想要证得如梦观也需要无数劫的时间，再来人除外。</p><p>还有人在修平等观，看一切人事物理都平等平等，真如一相。这是什么境界？什么叫作平等？依据什么才有平等？平等法有三种：一种是如来藏的平等，对待一切人事物理都平等平等，不区分高下，因为如来藏不分别一切法；一种是证得一切法空的阿罗汉的平等，看待一切众生都是空的无我的，因此能在一定程度上把一切众生都观空；一种是转识成智以后的地上菩萨，其意根证得了如来藏，转依成功以后就获得了平等性智，看一切众生都是如来藏性，一切法都是如来藏，因此能在一定程度上平等对待一切众生。没有证悟大小乘法的凡夫，如何修地上菩萨的平等观，把一切众生一切事理都看成真如一相？其中的差距几乎相差了无量劫的时间，如此修行没有什么益处，白费功夫。</p><p>还有人修行心无所住，要在世间一切人事物理的交集中，心都要做到无所住。可是这个无所住不是无缘无故就能做得到的，是要证得某个理，依靠着某个理，才能渐渐的心无所住，这需要很长时间，断除烦恼以后，证得平等性智以后，才能逐渐做得到。如果没有相当好的证量，没有实证佛法，要依靠什么做到心无所住？地上菩萨能做到无所住也不是很容易的，也不能完全做到，一个凡夫怎么能做得到无所住？</p><p>还有人跨越修戒，要在人间一切逆缘顺缘中心不着任何戒相，泯灭一切相。如果连五戒都守不好，身行方面的戒行都做不好，杀盗淫酒都戒不了，素食也做不到，口行方面妄语两舌恶口戒也守不住，内心贪嗔痴烦恼仍然很重，有相的戒不能守，如何能排除这些戒相，心里不着戒相，去修无相的戒？在有相戒当中能守好身行和语行都不易，怎么能做到无相，不要戒相？这是地上菩萨才能做得到的，凡夫如何修无相戒？</p><p>如果强行这样修，只能自欺欺人，处处犯戒，却认为自己心地达到无相，不在乎这些相了，其结果就是三恶道的果报。过去唐朝就有人当时就受恶报。有个已经真实证悟的禅师，智慧很高，心地清净，就把佛菩萨的名字写在裤腰上，而另一个人看见了，就挺感兴趣，认为他这样做就没事，自己做也应该没事，于是也学禅师把佛菩萨的名字写在内裤上，穿在身上。禅师知道后想阻止，可是已经晚了，那人没几日就大吐血，恶报来得这样快，真是始料不及，命终以后的果报将会更惨。因此学佛人心地还没有清净，没有断除烦恼，没有转识成智，根本没有资格修无相戒，强行让自己不着戒相，这只能让自己堕入烦恼的深坑，除此没有任何益处。</p><p>末世众生就是因为太聪明太伶俐了，浮在表面，不能深入到意根，不能发挥意根的功用，意识什么都懂，可意根什么都不是，结果果报就随意根转。意识好高骛远修初地至八地菩萨所修的法，意根的人格人品修为却还没有修好，到命终的时候，后世的命运如何抉择？依意识还是依意根？意识修佛地的法，命终能做佛吗？</p><p>十二、真正的精进是什么状态</p><p>真正的精进是不管白天黑夜，能一直不断的用功，不会停歇。用功的人半夜都能思考问题，不用功的人，白天也不思考问题。意根白天晚上都不灭，可见真正精进是意根精进，祂在白天黑夜都能一直用功下去。而意识的精进是断断续续的，总能被一些事情所干扰，尤其是晚上意识睡着断灭，就无法思考问题了。即使是在白天里意根如果只注重世俗法，不想在佛法上用功，意识脱离不了意根的主导作用，就精进不了。所以只有意根精进起来，才是真精进。</p><p>十三、众生为什么没有宿命通</p><p>众生由于没有宿命通，不知前世后世的因缘果报之事，有宿命通才能知道自己和他人前世后世的所有因因果果之事。因为众生死后五阴改变，不是原来的了，六识改变，不是原来的了，前世的人事物，与自己有关的一切就都不知道了，因因果果的事也就更不知道了。因为此世的六识心在同一个五阴上，是相续有记忆的，六识能了别此世的人事物理，就能记住此世所经历的一切法。而下一世，不是原来的五阴，六识是依赖新五阴又新生起的，没有经历过前世，对前世的人事物理就没有记忆，无法回忆起前世的事情。</p><p>而意根是从无始劫以来一直延续下来的，经历了无始劫的人事物理，累积着生生世世的习气，与生生世世的业种相应。所以此世的五阴与前世的五阴在习气烦恼上是相续的，如果不修行，今世再新熏一些恶习，习气就会越来越重。第八识也是从无始劫以来一直延续下来的，未来世永远也不灭，那么这世的自己和前世的自己肯定有连带关系，不是互不相干的，我们修行就要多为后世的自己着想。</p><p>宿命通的获得，修到四禅以后才能获得，修到四禅以后，修五种神通，就能随修随得。</p><p>十四、众生生生世世所连贯着的是什么</p><p>人死后，意根和如来藏不灭，又一起带着业入胎出生，出生下一世的另一个你。意根从前世到后世不断绝，所以世世有连贯的东西，那就是你。由于前世不懂因果，不管后世的你，任意妄为，造做苦业，使得今世的你受苦连连，今世再这样继续任意妄为，不明因果，后世还是苦恼不断。苦的永远是自己，不是别人，生生造业，世世后悔，却不长记性。</p><p>十五、意根是什么有情就是什么</p><p>菩萨的化身是凡夫还是圣人？观世音菩萨三十二应身，应以何身得度，即现何身而为说法。凡夫与圣人，要看意根。意根是什么，这个人就是什么。意根没有悟道，这个人就是凡夫，意根修证到什么程度，这个人就是什么果位。</p><p>佛陀化现无数五蕴身，那些五蕴身是佛陀还是凡夫？是出家还是在家？佛陀的意根没有无明，彻底转识成智，成就佛陀果位，佛的意生身当然是佛陀，不是凡夫，当然是出家身不是在家身。供养佛陀的意生身和应身，等于供养佛陀。释迦佛就是化身，我们只能见到化身，见不到法身和报身，所以供养任何身都等于供养佛陀。</p><p>十六、意根与五根的区别</p><p>（一）五根只是五识现起的一个缘，五根不能决定五识是否出生和运转，以及如何运作。因为五根纯粹是色法，没有识心的心所法，因此没有作主性和决定性等等。而意根不仅是出生意识的根和缘，也是识心，有识心的属性，有识心的心所法。而且意根也不是与六识平等的识心，祂有着非常特殊的属性。这个特殊性，主要是体现在祂的恒审思量性上，就是说意根总是、一直、常常审虑着一切法，思量着一切法。为什么祂要对一切法都审虑思量呢？因为祂有权限有责任有义务管理好一切法。</p><p>意识就不行，祂在每个法上必须现出生，法已经出现了，祂才出生，那祂就谈不到对法的管理了。只能对后续的法提供建议，为意根出谋划策，还是在一部分法上，不是全部的法，因为意识对应不了全部的法，祂没有那个权限，没办法。所以意识的格局远远低于意根的格局，是眼界的问题和见识少的原因。</p><p>（二）十八界包括六根六尘六识，六根包括眼耳鼻舌身意六根，其中前五根是由地水火风四大种子组成，浮尘根在身体表面，众生肉眼能看得见摸得着触得到，能够毁坏和变异，有肉眼可见的生灭现象；五根的胜义根在后脑部位，通过手术可见，也是看得见摸得着触得到的色法，能够毁坏和变异，是生灭无常的苦法。五根毁坏时，色身功能受阻和废弃，成为植物人，甚至死亡。</p><p>而意根是无色根不是有色根，意根不是由地水火风四大种子组成，是由识种子形成，因此不是色法，是心法，有识心的功能作用。色法是因缘所生法，没有自主性，被动的由如来藏、意根和合出生和显现出来，离不开意根的推动作用，如果意根不推动，色法即刻消失。而意根不是后来出生的，是无始劫以前就与如来藏共存在一起，由如来藏提供识种子而存在不断，不用其它因缘，不是因缘所生法，只要意根有所攀缘，就不会灭亡而继续在世间存在，五蕴世间也就会随之生灭不断。五蕴五根虽然生灭不已，意根却从来不会灭亡，没有人能消灭意根，阿罗汉辟支佛入涅槃除外。</p><p>无色法的识心意根与有色法的五根功能差别极大。五根没有识别功能，没有心所法，没有染污和清净性，能受意根影响，其接收五尘的功能受意根指挥，而不能指挥五尘和五识，更不能指挥意根，但能影响意根的受和决策作用。</p><p>意根心法的功能作用非常强大，对五蕴身有作主和抉择作用，主导一切世间法的出生和变异以至灭亡，有识心的心所法作用，有染污也有清净性，有识别性、了别性、判断作主性，有趋利避害性，有我性和无我性，有愚痴性和智慧性，有习气、习惯和烦恼，有遍计所执性，能决定众生的生死轮回，决定众生趣向涅槃，成就佛道，天上地下由意根主宰。而色法的五根无此特性，心法的意根才有这些特性，所以意根是心法不是色法，是无色根。</p><p>根，有出生识心之义，但这个所谓的出生，不是直接生，而是能导致六识出生，是六识出生的一个最直接的缘，直接出生六识的是如来藏，如来藏假借业缘和六根来出生六识，但如果意根对一切法无心，如来藏就无法出生六识。所以五根的生缘是很被动的，意根的生缘是非常积极主动的，出生六识和一切法的动力非常强大，也决定着五根的出生与否。这样自主的强大动力，只有无色的心法才能有，有色的五根不能有，所以说意根是心法不是色法，是无色根不是有色根。</p><p>十七、意根的饮食习惯</p><p>意根无始劫以来习惯于饮食，习惯于定时定量饮食，习惯于美味，如果想要意根断食辟谷，改变意根的饮食习惯，就要一点点的减少饮食，不能一下子掐断饮食，要给意根一个适应过程，让祂有心理准备。等到意根适应了少量饮食，再把饮食断掉，祂才不会反抗抵制，即使七天不进食，半个月不进食，一两个月不进食，身心也不会出现问题，甚至精神旺盛。</p><p>意根的习性太深细、细微难以觉察，对于习惯的人事物理，过于执着，只有一步步的不知不觉的转移祂的习惯，减轻祂的习惯，才能在不知不觉中改变祂的习惯，减轻执着。用同样的方法也可以修习波舟三昧，达到九十天不睡不卧不坐，改变意根睡、卧、坐的习惯，时刻精进于念佛，改变身心，与佛心相应，从而明心开悟。修习时，先从一天一夜不睡不卧不坐练起，然后修习三天三夜不睡不卧不坐，适应了以后，再修习七天七夜，然后依次是二十一天日夜，四十九天日夜，最后九十天不睡不卧不坐就能坚持下来，因为心中念佛，一心无二，有佛力加持，就能坚持下去，直至明心证悟。</p><p>十八、物质真有重量吗？</p><p>面对大于自己体重无数倍的物体，如果是在非常非常非常情急的情况下，忘记了物体的重量，或者是来不及考虑物体的重量问题，只顾着解救物体下面的人，这个人就能瞬间把那个物体推出去。把人救出来以后，一看原来自己推的是那么重的东西，心一惊，这时再去推那个东西，无论怎样也推不动一点点了。为什么是这样呢？</p><p>情急之下，意识没有思惟力了，不会告诉意根这个物体非常重，意根不考虑物体重量问题，只作意决定把物体推开救人，结果意根达到目的了。之后意识一看那个物体就惊讶，知道了物体的重量，告诉意根，意根知道后，就知道凭自己的力量是无论如何也推不开那么重的物体的，于是如来藏就不会帮助意根了。</p><p>万法唯心造，既唯如来藏造，也唯意根造，也唯意识造。意识意根只要想造什么法，如来藏就会提供原材料出产品，前提条件是要符合业力。没有禅定，意识心花乱放瞎指挥，意根听从就受阻碍。禅定中意识力量弱控制不了意根，意根自己想干什么就干什么，就能成功。只知道抓意识的人只知道围绕着意识转来转去的，不知道抓主人抓主干抓重点抓根本，那个智慧该有多浅。催眠时把意识控制住，不让祂瞎指挥，就能利用意根挖掘出很多秘密，改变意根也不是很难，回到过去，去到未来，都没问题。  </p><p>不管多重的物质，即使大到须弥山，重如须弥山，也是四大种子组成的物质，四大种子没有重量，组成的物质色法也应该是没有重量的。众生被无明所遮障，不知此理，由于业力的缘故，就会感觉到物质色法的重量。有甚深禅定的人，降伏了无明，心力打开，才不会被物质以及物质的重量所拘碍，才能随意处理物质，如高举、粉碎、组合、穿越等等，也能随意变现物质，能玩转四大，玩转物质色法。</p><p>十九、菩萨如何游戏人间</p><p>菩萨有时也会随顺众生去演戏，实际意根心行与戏不一致，意根绝对的清净，表现给众生看的一面可能不清净。为什么要这样？为了摄受众生，为了度众生，菩萨就要利用一些方法手段去降伏众生。目的纯正，结果是善，方法就无可厚非。但是如果菩萨的意根还没有清净，还有烦恼，就不能采取非常的方式方法，因为会与意根烦恼相应，存业种。三果以上的地上菩萨意根已经断除了烦恼的现行，心地不与烦恼相应，就可以使用一些善巧方法，如杀盗淫妄酒，表面上与凡夫同行，实际上是为了降伏凡夫，归于正道。</p><p>菩萨要想游戏人间，必须要有游戏的本事，心行必须要超脱于人间，才能不被人间拘锁住，否则必须会深陷人间泥潭，不能自拔。如果自己都不能拔自己，谈何去拔济众生？游戏人间不等于享受人间，享受人间的人，一定无法游戏人间。不受不享，才有资格和本领游戏于人间；否则就不叫作游戏，应该叫作身陷囹吾。</p><p>二十、阿罗汉的意根习气</p><p>如果大迦叶听见音乐就跳舞是任运而起的，那所有的众生听见音乐都要起舞，甚至不听音乐也要跳起来。事实是闻乐起舞，不是每个人都有的现象，不是普遍性，因此跳舞这件事不是任运而起，是有喜爱歌舞烦恼习气的人才能出现的现象。前世喜欢跳舞的人，其习气根深蒂固，听见音乐就会惯性的跳舞，意识不能控制。</p><p>习气也叫作惯性，比如刹车，车已经刹了，可是还会往前跑一段路。也比如我们在冰地上走路，脚底打滑，明明已经停住脚步了，可是还会往前滑一段路，控制不住。这就叫作断了现行的烦恼，可是习气还要现前，不能止住，会不自觉的出现。开车越快，刹车以后惯性力量就越大，烦恼越重习气就越大。</p><p>大迦叶阿罗汉虽然断除了烦恼，还没有断尽烦恼习气，前世有喜爱歌舞的烦恼习气，今世听到音乐就会不自觉的跳起舞来。那么没有断除烦恼的凡夫，如果有喜爱歌舞的烦恼，听见音乐时，其烦恼和习气就会更重。贪爱音乐和跳舞比较严重的人死后要去鬼道受报，只有习气现行是不用去三恶道受报。</p><p>二十一、意根的考量本质上就是趋利避害的</p><p>意根能不能对一切法进行趋利避害的考量？祂无始劫以来所经历的人事物理，能累积成经验和记忆，堆积在心中，从而在后世后后世再遇到同样的人事物理，就会根据以往的经验和记忆，作出选择性的应对行为，结果就趋利避害了。</p><p>我们应该知道，意根从来都是与业种相应的，意根所经历的都会存下种子，而意根的心行都与种子相应。当意根投胎为种种众生时，意根的心行与抉择等等就与当前众生相应，以为自己就是这种众生，不会想到自己还可以是他种众生，特例除外。</p><p>意根投胎做人时，心行和行为应该主要与人相应，但不排除前世非常大的习性，包括做圣人的习性，或者是做畜生的习性，做恶鬼的习性，但还是与人的习性最相应。当业种现行的时候，意根更与业种相应，比如重大恶业缘熟，意根就恶，重大善业缘熟，意根就善，他人看来不可思议。</p><p>所以说意根所经历的一切，都会成为自己的经验和记忆，然后遇缘就会释放出那些经验就记忆，对自己的抉择有所影响，或者说有绝对的影响，结果就是趋利避害的，还非常自信，不容外界因素干扰和阻挠。</p><p>二十二、随心所欲而不逾矩是什么境界</p><p>矩是规矩的意思，有人能克制自己守规矩，有人不用克制，任性而为，却不跨越规矩，不违犯规矩。当意根被驯服了以后，断除了烦恼，没有烦恼心，就不造烦恼业，干什么都不会超越规矩界限。心不与烦恼相应，不会造作烦恼业，犹如一头牛被调伏以后，无人看管和监督也能自觉不践踏庄稼；犹如猴子被调伏，再也不会四处撒野。</p><p>二十三、色身影响识心心所法</p><p>当身体气脉不通，气被堵塞，人就会想把这股气释放出去，释放的途径也叫作发火，也叫作出气，拿自己拿别人拿东西当作出气筒，如拍桌子摔东西就是出气的一种方式，直到把堵塞的气释放完了，气才消，心安静了。如果气释放不出去，堵在身体里，就会出现气滞，身体就会生病。有修养的人不愿意把火气释放出去，就压在心里，长期这样就会形成肝郁气滞，或者形成肿瘤和癌症。气堵塞严重，气就大，发的火气也大，爆发的力度大，时间也长；气堵塞不严重，气小，发火就小，时间也短，气消的快。生气非常伤身体，谁也不愿意生气，都愿意乐呵呵的，所以没有一个人的意根会贪执生气的韵味，喜欢生气的感觉。</p><p>二十四、意根对生命活动的调控</p><p>凡是色身的变动、迁流和活动都属于行蕴范围，直接受意根调控，有身识意识参与，但不一定有意识的思惟分析和支配作用。意根执这些活动为我和我所，就是我见。身体外在的活动，必有意识和身识参与，如走路时比较熟悉的路段，不用意识思惟和指挥，意根就能主导意识和身识走完这段路；如果这段路是不熟悉的，意根一定要依靠意识的思惟分析引导，才能主导意识和身识走完这段路。</p><p>但是色身肌体的自主活动，比如内部脏器活动，心跳、脉搏、胃肠蠕动、细胞组织的新陈代谢、甲生发长、组织结构的改变、肌肉骨鄂的生长和变化等等不受意识和意根的调控，都随着业种和业缘而发生改变，是如来藏依业种和业缘对生命体进行的执持活动。</p><p>二十五、八个识对色身的影响和操控</p><p>色身在没有身识的情况下，也能有微弱的活动，比如有的众生头被砍下来了，身体却还能扭动，这是因为意根执身的时候，虽然不能调控大脑中枢神经系统，但还有脊髓神经系统存在，意根就会通过控制脊髓神经系统让身体扭动，这时不一定有身识和意识参与。再比如睡着以后，甚至深度睡眠的时候，身体也有微弱活动的现象，这也属于神经系统活动。半夜说胡话和眼皮的眨动，也是无意识的活动，意识和身识都不现起。</p><p>身体内部活动，比如：心跳、脉搏、呼吸、神经系统活动、胃肠蠕动、消化吸收、细胞新陈代谢等等，一般来说都由如来藏自主调控和执持，七识往往使不上力。内部脏器的活动不需要身识，睡着了都在活动，否则人就死了，身体的活动好多都不是身识意识能主宰得了的，也不是意根能主宰得了的。人的生老病死都不是意根能控制得了的，意识更不能控制，都是如来藏依业种而为。观察身体内的任何一种功能作用，如果不听我们的指挥和控制，那就是由如来藏单独执持的。血压体温都是，不是我们想怎样就能怎样的，有禅定和神通的除外，意念力强的除外。</p><p>但是七识的情绪和心理活动能够影响和改变色身内脏的运行，意根能影响和改变如来藏对色身的执持作用，六识的活动是意根主导的，也能影响如来藏。七识对色身内脏的影响和调控与如来藏那种执持方式、控制调控方式有很大区别。如来藏也听六七识的，也听五识的，所以我们修行才有用处，否则都是固定不变的，修行就没有什么用了。经常打坐静坐，色身里的一切都能改变，修行主要是在六七识上面用工夫，六七识修好了，就会发生天翻地覆的变化，直至成佛。</p><p>二十六、意识熏习的力量</p><p>刚才听完一首歌，脑子里却还在回响着那个旋律，这是意根念着，意识回忆歌曲。如果学佛能像听歌曲这样快这么容易该有多好，世俗法熏习这么快，佛法熏习却是那么慢，因为世俗法无量劫熏习的太久了，究竟熏染了多久，我们无法计算出来，佛法才熏染没有多长时间，与世俗法相比时间太短了。</p><p>观日的修行有多难多细吗？显然不是，却怎么也观不成就，因为从前没有观过，心不感兴趣，也不熟悉具体观行的方法才觉得难。世俗法却非常让人感兴趣，因为非常熟悉，不想让它出现都压抑不住。修行是生处转熟，熟处转生，生处是佛法，熟处是世俗法，关键是要会转，并且要有决心去转。</p><p>二十七、七识也是无所得的</p><p>七识好像是有所得的，好像得到了世间的五欲六尘，实际上也没有得到，因为愚痴无明，强行认为自己得到了什么，其实什么也没有得到，也得不到什么，白白的辛苦劳碌，白白的算计，费尽了心机，结果是白忙了一生一世生生世世。这些内容需要在禅定中静静的思考，长期思考求证，才能知道自己确实得不到什么。学佛修行，就是要让自己破除无明，认识到自己是无所得的，然后什么也不再求了，也不再想得什么了，就解脱成佛。</p><p>知道了终究是无所得，七识就会心空无为，但是无为仍然要做事利益自他，做事时心空，就是无所求，不为个人私利着想，没有个人目的和动机，不考虑个人得失利益成败。这样的话，虽然做了很多事，就像没做一样，不觉得自己有功，不居功自傲，不沾沾自喜，不去与他人和团体做利益交换。不自私比不执着容易得多，先做到不自私自利，之后才能做到不执着。不考虑个人私利，才能慢慢做到无所得和无所求。</p><p>二十八、如何让意根守戒</p><p>漏，就是有贪嗔痴烦恼，无漏，就是无贪嗔痴烦恼。六识都有贪嗔痴烦恼，意根也有贪嗔痴烦恼。如果意根的贪嗔痴不断，就要指使六识造作贪嗔痴业，六识就不能无漏，所以无漏主要是指意根的无漏。从这里看出，改变意根，是多么的重要，极其重要。</p><p>如何让意根守戒呢？意识就要修学佛法，懂得戒律的作用，知道守戒的益处，然后不断的分析思惟受戒守戒的种种功德，思惟不受戒不守戒，就有什么样的苦果，以此熏染意根，让意根明白此理。意根一旦明白，就会主动受戒和守戒，那就是心持戒了，而不仅仅是意识口头上的假持戒。当意根没有被熏染成功时，祂就不想受戒，也不想守戒，有时也被动的受意识的唆使去受戒，但绝对不会守戒。</p><p>当意根不懂因果时，也绝对不会自动自觉的守持戒律，意识就要强迫意根，这叫作压伏意根，意根不是心甘情愿的。初受戒时就是这样，以后意根明理了，才会自动守戒而不犯。</p></div>"
}]