[{
    "title": "前言",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>前       言</strong></p><p>心、意、识三者中，心代表第八识，意代表意根，识代表意识。前二者比较深细隐秘，很难证得和观察到，一般人只能观察到意识，还不是很细致，观察不到意根和第八识。意根的运作极其深细，比意识深细不知多少倍，所以很多讲法者只能讲个六识论，讲不了意根，也有可能讲不了第八识，因为对第七识和第八识无法实证到，更无法观察二者的运作，世界上到处都是六识论，就是这个原因。</p><p>一般的学佛人往往都把第六识的功能作用当作第七识或者是第八识的，反过来，又把第七识和第八识的功能作用当作第六识的，互相混淆不清，现在看来，也就不奇怪了。因为第七识第八识太难实证到了，善根福德智慧定力都不足，修行就到不了这个程度。而证得和观察第六识就很容易，有人稍微一指导就行了，不需要多少福德定力和智慧，意识比较浅故。</p><p>本书把意根与意识的区别和联系进行了深入细致的解析，便于大家在具体事用处分辨出意根和意识的各自体性，不再混淆不清。把意根和意识的体性分清了，就能容易证得意根，进而能实际观察意根，才能真正了解自心、降伏自心、改造自心，获得大智慧和解脱。从理论上得来的知识终究是非常浅薄的，实际观行得来的，才是真正的智慧，观行能实证，实证能成佛。而理论终究是理论，理论来自于佛陀的正教量或者是其他人的论著，不是自己亲自证得的，实证出来的才属于自己的智慧结果。</p><p>学佛这条路走得长一点以后，每个人之间的距离就拉开了，众生究竟走在哪个位置上就看得很清楚了。资深的裁判员，从运动员起跑前的状态，和枪声响起时的一刹那显现出来的气势，就能判断出运动员的实力，如果跑了一段路，就更能判断出运动员的实力了。希望所有学佛者都能修到意根这里，都能让意根实证一切法，都能有效的降伏和改造意根，让意根破除一切无明，转识成智，究竟成佛。</p><p><br/></p></div>"
},{
    "title": "第一章　意根与意识的区别",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第一章　意根与意识的区别</strong></p><p>一、初学佛的人，很难分清六七识，因为两个识都对应和分别同一个法尘，连接的又非常紧密，又都是识心，体性比较接近，功能作用相似，很多人或者说无数人都把两个识混淆在一起分不清楚，往往把意根的功能作用当成是意识的功能作用，因为不识意根真面目的缘故。第七识这个识很特殊，既是根也是识，既属于六根当中的根，也属于识心当中的识，有根的作用也有识的作用。</p><p>六、七两个识的体性很微细，比前五识的体性微细得多，所以不容易明了，需要我们多学二者的体性，然后再去细心观察体会，才能初步掌握六七识体性，从而增长智慧。六七识体性有很多差别，作用也不相同，第六识是对法尘的了知、分析、判断、思惟、观行、观察、推理、忆念、回想等等的一切心识活动，第七识能对一切法做总体的考量和认知，是能缘一切法，随时随地做主宰做决定的识心，是出生六识的根本缘。</p><p>二、分清意根与意识各自的功能作用，各自的影响力，是完全可以做得到的，关键是何种人能做得到，做到什么程度，什么人做不到，这就在于每个人的智慧程度了。而智慧的程度也受制于烦恼的轻重程度和习气的轻重程度，也在于禅定的深浅程度。智慧、禅定和心的清净程度，这三者息息相关，紧密相联，不可分割。</p><p>意识的体性、功能作用，也许相对于意根的体性和第八识的体性比较容易掌握一些，但是极大多数人仍然无法把捉，仍然处于懵懵懂懂状态。为什么会如此呢？主要是这些法还是比较深细的，如果对佛理了解的不深透，知见不足，内心浮躁，缺少禅定，那就无法细心思惟观行意识本身的运作，没有现量观察智慧，因此比较粗浅的意识体性也观察不清楚。</p><p>这其中也有烦恼遮障的原因，说到烦恼，一般人都认同贪和嗔，不知道愚痴无明也是烦恼的一部分，而且是最主要的部分，是烦恼的根本。愚痴就是心地不明，没有智慧，没有正知见，其根本原因也是福德不足所致。如果没有烦恼的遮障，智慧就很广大了，意识就能转识成智，能明了更多佛法之理，能现量观察很多法的运行，其智慧无法具体言说，又深又广又细，凡人无法想象。</p><p>意根的功能体性，一般人如果没有过来人引导都不能现量观察，因为意根的运行行相太隐秘，太深细，初地以上菩萨能现量观察到一小部分，地前菩萨依善知识教导也许能比较充分的理解，也许能体会到一点点。未开悟者依善知识教导也能证得意根，了解到意根的极少部分功能作用，也能有一些体会，但是可能还谈不到现量观察。</p><p>地前菩萨很难现量观察到所有法在运作过程中，意根与意识是如何协调一致互相紧密合作的；很难分清各种法在运作中，哪些是意识的功能作用，哪些是意根的功能作用；很难分清对于法的了别作用到底是意根的还是意识的，对于法的思量抉择作用到底是意根的还是意识的，很难分清各个心所的作用到底是意根的还是意识的，更不能分清意根的心所法都有哪些，分不清每个众生的心所法都有什么样的差别，不同阶段的修行人的心所法都有什么差别。如果地前菩萨烦恼轻微，遮障小，智慧较为深广，可以依靠善知识的教导，分清意根和意识的一部分体性，烦恼重和无明重的人就无可奈何了。</p><p>三、每位意根首长得到的情报信息，他自己还需要思考分析斟酌否？还需要研究加工否？还需要从战略战策上作以安排部署否？即使完全同意六识参谋的意见和建议，他是否也要经过自己的思考、研究、分析、判断，有自己的心思活动，最后才能同意和抉择？参谋下属和首长，是否需要有各自的心理活动、各自的智慧计谋、各自的手段、各自的经验等等？当然是需要的，互相之间不能代替，各有各的思想观点和抉择，意根和六识也是如此。</p><p>外人只能看到下属参谋的调研工作，看不到首长在决策之前对情报的思考加工过程，于是就说这些决策以及决策之前的工作都是下属参谋做的，首长并没有实际做什么，只是拍板而已。这样说是否实际情况？我们百分之九十九的人，甚至比这还要多的人，只能看到下属的工作业绩，根本看不到首长的辛苦，因为接触不到首长，看不到首长工作决策的过程，就认为一切工作都是下属参谋完成的，首长只不过同意点头决策而已。</p><p>学佛之人往往都是对于自己不知不证的法加以否定，看不见就说没有，只信自己，不信自己智慧的不足，这是普遍现象，谤法就是这样造成的。六识论者在娑婆世界遍地都是，因为证不得第八识，证不得意根，观察不了这两个能变识的功能作用，就加以否定。还有一些人，虽然相信有第八识，或者是稍微证得了第八识，但是因为不能证得意根，不能现前观察意根的运行，就否定意根的各种功能作用，成为七识论者，这也很成问题。</p><p>四、问：意根有慧心所，虽然较劣（尺有所短），但是有意识作为其所驱使的工具后（寸有所长），两相结合，尽可挥洒人生，游戏于法界，十分的伶俐。这期间能不能分清谁在决策，谁在思惟分析，谁比谁在决策中的作用更大，谁在其中影响支配结果？</p><p>答：在世俗界里，尤其是在六识所接触得到的六尘境界里，对于六尘境界的了别和造作作用，除了第八识之外，几乎都是第七识和第六识和合运作出来的，而且二者体性接近，联系过于紧密，难舍难分，对于二者的功能作用很难划分清楚，往往要张冠李戴。但是如果禅定功夫好，思路清晰，也能把两个识的功能作用分清楚一些。</p><p>八个识都能在各自的了别范围内做决策，决策是思心所的作用，八个识都有各自的思心所，由于分管的范围不同，抉择决策的内容就不同，权力大小也不同。六七识的决策作用究竟谁大谁小是不一定的，总体来说、一般来说、大多数时候都是意根的决策权大，意根多数时候有绝对的决策权，不容意识分说；只有在意根没有经验拿不定主意的时候，或者是意识的智慧很高有说服力的时候，意根才听从意识的决策和主张，再作最后的权衡和决策，最后的决策权永远在意根手里，祂总是大权在握。</p><p>意根没有经历过的事情就无法抉择，很多时候了别六尘的智慧不足，同样无法作决策，这时候就要依靠意识了别的结果，进行总体权衡思量，然后再决策。因为意识了别一切法细致入微，有细致分析思考的能力，有推理判断的能力，有想象思惟的能力，逻辑性强，对六尘境界掌握的信息就比较准确，意根就要依靠意识这种能力，掌握一切法的细节和全貌，再作以总体的全方面全局性的思量，可以叫作高瞻远瞩，最后做出决策，六识就要执行。从这里可以看出，意识能影响支配一切法的运行和结果，意根本来的固有的习惯和经验也能影响一切法的运行和结果。至于说影响力哪个大，这是不一定的，要看具体情况而定。</p><p>五、定中出现什么境界都属于六尘中的法尘境界，都是意识了别的内容。心里现出一个境界相，识心就知道了，这是独头意识的知。因为这个境界相和外边的六尘境界没有关系，属于独影境，所以只有独头意识能了别。</p><p>意根也知也了别，而且是先知先了别。但是意根不能具体而细致的了别，况且意根了别了境界，究竟祂了别了什么内容，我们也就是意识还是不知，了解不了祂到底了别到了什么情况。如果意根能独自处理任何境界，也就不需要意识来了别六尘境界，如果意根能够细致了别，知道具体内容，意识就没有必要出生了。但是当意识转识成智以后，就能逐渐的观察和了知到意根的思想和了别内容。</p><p>现在我们知道一个总原则，就是意根能知道很多法，知道的可能不细，比较粗略，知道一个大概大体，但是不管祂怎么知，意识由于无明的遮障还是不知，那就是我们不知。我们学佛修行一方面就是让意识转识成智有大智慧，把意根所知的法全部挖掘出来，我们就能有智慧知一切法。如果意识能知一切法，那我们就能够很好的处理任何境界，那时候于法就无碍了，生活在世间就会很自在。</p><p>六、意根与意识，几乎黏在一起，不好分开，要证得意根观察意根，就非常不容易，也许比观察第八识还要困难一些，愚者难分根与识，就是这个道理。八个识，都是从作用处证得，因为都是无形无相的识心，所以五识不能发现这些识心的功能作用，只能是意识发现和证得，继而意根随同意识也能证得这些法，意识要从八个识运作的行相上来证得八个识、观察八个识。</p><p>任何一个法的运作里，都有意根和意识的现行，二者形影不离，有意识必有意根，意识在前台工作，意根在幕后垂帘听政做指挥；意识处明，意根处暗；意识专门搞观察统计分析，意根最后拍板定案；意根直接从如来藏那里取得信息，意识间接享用如来藏的信息；意识是意根的助手和同谋，意根是意识的靠山和依赖；意识是意根的观察使，意根提供意识信息源。二者密切配合既能上天，又能入地；既能坐佛宝座，也能睡地狱铁床。</p><p>七、俱生我执是意根的还是意识的</p><p>意识是否有俱生我执？俱生，就是与生俱来。意识刚刚出现时，不辨东西南北，一无所知，当然更不知道所谓的我，也不知父母兄弟姐妹，所以没有我执。婴儿意识所表现出来的，全部是意根教导和熏习的，所以意根才有俱生我执，意根也不用再出生。环境和父母暂时还熏习不了婴儿，意识需要逐渐被教导，才能渐渐懂得一切法、所有法，不管是被自己的意根教导也好，还是被他人教导也好，还是被环境熏染也好，反正意识对于一切法都要一一学习，没有先天就会的，也包括对自我的认知。</p><p>意识最初都是被意根教导和熏染的，生出来时，就是被意根调教出来的，祂必须受意根支配，没有任何原则和主见。意识在母胎里的所有表现，更是全部随顺于意根，没有一丝毫自我主张。出生以后的意识，也是完全随顺意根的意志和习气，没有一丝毫自我主张。直至后来被环境熏染，被他人教导以后，才能有一些认知，才有一些自我主张。</p><p>孩子的天真就在于，完全是自我内心（意根）的表现，没有虚假，没有伪装，没有意识的遮掩，是意根的直性和率性而为，意识不会控制意根，不会伪装意根。从孩子身上能直接发现意根的特性，孩子天生就有贪心，那是意根的贪，天生就会生气，那是意根的嗔，天生就是愚痴，那是意根的愚痴。孩子天生聪慧过人，那就是意根的智慧，天生的就有某种特长，那就是意根的才能。凡是天生的，不用后天特意学的，都是意根的。</p><p>当我们实在分不清意根和意识的时候，就要考虑没有意识是什么情况，意识作用微弱时是什么情况，意识刚刚出现和即将灭去是什么情况？这些情况全部都是意根特性的表现。</p><p>八、一念相续是意识心的还是意根的</p><p>二者同时都在起用，意识心一念相续时，是一种定境，心住一个境界，少于分别，传递給意根的信息就少，这时意根的攀缘就少了弱了，祂的注意力就能稍微集中一些，分别的慧力就强一些，同时祂的思量性也增强一些。如果以这种定力参禅和观行佛法，意根的作用就增强了，实证佛法就容易些。意识要一念相续，必须意根也要长时间的缘于这一念，否则意识就要消失，无法相续。凡是意根不缘的法，意识没有理由单独缘，因为根本就不能有意识。　　</p><p>九、意识有知性，意根也有知性，自知，就是自己知道自己的对错，这就是证自证分。这是在说意根，是意根把第八识的功能和六个识的功能，都当作是意根自己的功能。意识的自知性，就是意识对自己的观察，是意识了别意识，这个比较容易。而意识了别意根的知性，比较困难，意识不容易了别意根的知性，而意根了别自己，也不太容易。只有意识和意根烦恼消除、遮障消除，转识成智，都有大智慧时，意识才能观察到意根的运作，了知意根越来越多的性质和运行规则。</p><p>十、意识和意根在了别业种上的区别，比如自己今世与冤家相见，一定要报复冤家，是自己的意根想报复还是意识想报复呢？最开始一定是意根想报复，因为意根经历了前世的事情，与业种相应，了知自己与冤家的因缘，所以一定是意根要报复。意识并不知道自己（意根）为什么仇恨冤家，但顺从于意根也想报复时，就要想报复的办法，付诸于行动。</p><p>意识有时有理智，有时无理智，有时想劝说意根，有时就自动当意根的帮凶。具体的报复措施由意识施设，办法由意识思惟，手段由意识设计，最后由意根决定，一切行动由意根作主推动。如果意根不拍板，意识就不能采取报复的行动，意识的运作从来就没有离开意根一丝毫，二者紧密相连，互相依靠。</p><p>十一、在了别业种时，如果意识能了别到，那是意识心随着意根了别的，意根是依靠于如来藏了知的，但必须在意识入深定以后才行。意根对业种的了知表达不出来，意识了别业种以后就能描述出来，说不清道不明的是意根的了别，能详细述说出来的是意识的了别。如果想要自己有大智慧，能清楚的了别业种，就要努力降伏烦恼，烦恼越轻微，遮障越小，智慧就越深利，六七识就能转识成智，二者和合就能了知更多的法。</p><p>转识成智是断除烦恼以后的事情，在断我见和明心见性，获得初禅定以后的事情，转识成智以后，意根意识的功能就得到很大程度的开发。修到无漏无烦恼，才能出生甚深的种子智慧；有烦恼时，心就有漏有遮障，智慧就低劣，看不清楚事实真相，看不透人事物理的本质。</p><p>十二、有重大的事情要发生，身心会提前出现各种反应是怎么回事</p><p>意根能了别业种，根据业种知道要发生重大的事情，于是色身就会出现异常反应，但是祂没有名言，不能用语言文字明确表示出来，也没有思想让意识知道，意识就无法确切知道有什么事，也就不能采取具体的措施和对策，只能任由事情的发生，直到事情发生了，意识才了别到是怎么回事，还有提前一年就有预兆的，意识都不知道到底有什么事情要发生。</p><p>意识能具体了别六尘境界，而意识不能直接清楚了别业种，业种还没有完全现行时，还不属于六尘境界，因此意识无法清楚了别。意根了别将要现行的业种，只能发出模糊不确切的信号，如身体的异常反应，内心的喜悦或者是恐慌不安，意识如果有智慧就能以此信号解读出这些信息的内涵，但是一般人的意识比较愚木不伶俐，往往是解读不出来的。</p><p>意根了别将要现行的业种以后，为什么会引发身心上的反应，比如说感觉胸闷烦躁、坐卧不宁等等征兆呢？因为意根执身，祂有心理反应时就控制大脑神经元能直接牵动身体，让身体出现各种变化。意根在脑部活动，了别大脑中的全部法尘，包括六尘的信息，祂的识心一动，就能直接牵动脑部的神经系统，神经系统再同时快速的扩散到全身，全身就会出现反应。</p><p>意根的识心认知不同，感受和情绪就不同，触动着大脑的神经系统就出现不同的反应，身体的反应和活动就不同。有佛力加持时，意识不知道，而意根知道，就会促使身体出现各种反应，有麻酥酥的感觉，内心喜悦，泪水直涌。念佛念经念咒时出现的感应，都是意根感应出来的，意识却不知道。当我们打坐坐到心里非常静时，就能体会到心里只要有反应有情绪，脑部的神经就跳动起来，几乎同时身体就有各种反应，这说明意根一直在调控着色身。</p><p>十三、意根思量与意识思惟的区别</p><p>二者思惟量度，一个（意根）笼统，一个（意识）细致；一个（意根）深，一个（意识）浅；一个（意根）可连续不断，一个（意识）断续；一个（意根）更有是全局总体性的，一个（意识）是片面局部性的；一个（意根）与前世经验经历能连接起来，一个（意识）最多能带有当世的经验；一个（意根）快速伶俐，一个（意识）需要一定的时间。因为意根需要掌握人事物理的全局和概貌，贯通古往今来，具有总体的决策权作主权，因此祂的思量不可能深入细致到事理的细微处，这需要意识做参谋和助手，依靠意识的细心了别和分析思惟才能清楚。而意识作为意根了别六尘境界的工具，只能配合意根，弥补意根的不足，为意根提供详细的资料，满足意根所需，因此思惟就要很细密和具体。</p><p>意根了别六尘境界的智慧不强，由其所处的领导地位来决定，因为意根能见一切法，默容一切法，需要思量管理一切法的全貌和总体，导致祂对于尘境不能再做具体而细致的了别思量，而且这部分有意识可以分担和佐助，二者配合一下就可以了。而意识相对于意根，了别的内容相对就少些，而且还可以专注了别，因此就能了别清楚和透彻，局部智慧力就强。</p><p>意根的恒审思量性永不停息，只要第八识能变现出的法尘，意根都可以缘到，然后就能思量。而意识的思惟就断断续续的，要受许多条件限制，条件不具足，意识就不能出现，或者不能思惟。</p><p>十四、意根在定中定外都不能代替意识作推理分析思惟，意根的思量与意识的思惟有一定的差别。推理、分析、思惟是意识的功能体性，这是很明显的，意识与语言文字觉观相应，意根不能作推理分析这样细腻的思惟活动。意根那种特殊的思量、量度、度量方式，意识也不容易发现和掌握，即使证得了意根，了别了意根的运作，意根的那种思量方式，也很难观察和掌握。</p><p>意根不一定比意识更有智慧，这要看在哪方面，在了别六尘境界方面，意根没有意识有智慧，没有意识有细致入微的了别性，没有意识了别更清晰更透彻。但是意根由于无始劫以来没有灭过，经历过无穷无尽的事件，其经验和智慧也非常丰富，有时了别重大问题要比意识更有智慧性，是经验老道的原因。</p><p>一切法都是由意根作主抉择的，意根又相信现量观察，只能相信自己的思量性，那么要想实证某些法，就要想办法让意根自己亲自思量，亲自参与其中，其思量的结果，意根就直接认可了，不用经过其它程序，比较快捷。</p><p>十五、每个人都应该多磨砺一下自己的头脑，少磨嘴皮子。动脑总比动嘴强得多，因为有一个强有力的头脑，才能获得智慧和福德。大脑的功能以意根为主，嘴皮子是意识的功夫，哪个功能更强大，更能解决问题？动脑子很累，动嘴皮子不费劲，很多人就不动脑子，只动嘴皮子。动嘴皮子能解决什么问题？思惟深邃者言语少，话多之人思惟浅，一个是意根用的多，一个是意识用的多。意根与意识的关系就是如此，此消彼长，一个深，一个浅。是深好还是浅好？</p><p>十六、佛说：汝意不可信，慎勿信汝意，证阿罗汉果才能信汝意。</p><p>信，分为深信和浅信，真信和假信。深信和真信就是意根内心深处的相信，浅信和假信就是意识层面的肤浅的相信，意识故意装信而意根并不相信。意，一个是意根内心深处的知见、观点、看法和主张；一个是意识的知见、观点、看法和主张。</p><p>相信自己的意思，有不同层次的区别：一、意识相信意根的知见、观点、看法和主张。二、意根相信意识的知见、观点、看法和主张。三、意识相信意识自己的知见、观点、看法和主张。四、意根相信意根自己的知见、观点、看法和主张。这是意根的证自证分功能。再加上，意识相信时，意根并不相信，意根相信时，意识却不相信等等诸多情况。</p><p>因为意根有根深蒂固的无明和染污，有根深蒂固的我见和邪见，无始无明与生俱来，不可扭转；可是因为无明，众生的意根却深深的相信自己的邪见，不肯受化，以至于生生世世主导意识具有邪见，造作无明业染污业，生死轮回不断。世尊为度此类众生，让众生回光返照自己的无明烦恼，就告诫众生，不要相信自己固有的知见，等修证到四果阿罗汉，断尽我见我执，心得清净，智慧解脱时，才能相信自己的知见和观点。在此之前，由于烦恼的遮障，智慧不足，知见不正，如果对自己的知见深信不疑的话，就无法出离无明坑，得以解脱生死。</p><p>十七、意根因为有遍计所执性，也有自己独特的思量性，当意识不起用时，意根可能还在独自不断的思量着，不断的执取着，不肯放舍，到一定时候，意识就可能突然明白某件事情、某个道理，突然就想起了某些人事物，这是意根执取思量的结果。比如说，接触到某个问题，意识心没有想明白就放弃了，也可能不想了，可是不知道什么时候，意识心突然就明白了，原来是这么回事。这是谁的作用呢？这是意根的作用，祂在背后暗暗的思量着，并没有与意识一起放弃，最后终于思量出结果，意识就明白了。</p><p>再比如有时好多年前的事情，意识根本不想了，早已忘了，可是在某个瞬间，意识却突然想起来了，意识从来没有思惟过，没有惦念过，这是怎么想起来的呢？原来是意根一直攀缘这件事，遇缘就把这个信息丢给意识了别，是意根在背后暗暗的执取出来的。还有在打坐时，意识静下来，几乎不思惟，没有了心念，可是突然就能想起儿时的不重要的事情，这是谁弄出来的？是意根执取攀缘出来的。</p><p>意根因为没有降伏自心，还在到处攀缘作意，不肯停歇，不懂得万法虚妄的道理，什么法都会执著和执取，六识就会很繁乱，不寂静，身口意就不清净。只有用万法虚妄之理不断的熏染意根，意根才能逐渐的消除其遍计所执性，少于攀缘作意，身口意就清净了。学佛思惟观行佛法，要深入到意根，多利用意根的优势，多发挥意根的功能作用，多深入到意根，所有的佛法就能很快的实证，就能获得大智慧。</p><p>十八、不信佛的那些人，也跟着喊无我，好像真知道无我似的，其实根本什么也不懂，那个意识心，显得特别虚假，非常不实在，其实心里时时处处都是我。这种人口是心非，心口不一，意识与意根严重不一致。</p><p>心口不一，口是心非的意思，口业是意识的功能作用；心，指意根，有些时候，意识与意根不一致，意识是浮浅的表面作用，意根是深层次的心理作用。口里说是，心里不认为是，意识是浮浅的口行，意根是深层次的心行。那么看一个人是敷衍塞责，还是真诚以待，就知道此人说话是停留在意识表面层次，还是来自于深层次的意根。中国汉字词语的组合，也反应出了心理学，还是非常有道理的，也有符合佛法道理的。</p><p>十九、问：俗话说，一心不能二用，指的是意识，意识不能同时思考或进行两件事。但是意根遍缘一切法，或者是一个法尚未攀缘完，又攀缘另一个法，因为间隔时间为刹那，时间太短；也可以理解为同时攀缘多法，在这其中是否就是区分意识和意根的好时机？</p><p>答：世俗法里讲的一心不能二用，意思是一心如果是二用多用，用的就不好，精力分散，心就粗燥，了别不细致不清楚，思惟不清楚，不能出智慧。实际上意识六识是可以二用、三用和多用的，因为普通人的定力很差，慧力也很差，精力稍微分散，对六尘境界就了别不清楚，考虑问题就不细致不周密，表现为粗枝大叶、马马虎虎、稀里糊涂、不知所以然，智慧比较低劣。</p><p>意识心没有禅定的训练时，要想思量考虑好某个事情，必须专一思惟，否则就考虑不清楚。当意识有训练定力好时，可以一心多用，同时缘几个法，有些时候也能做得好，而定力非常较好时，时时都能一心多用。比如世俗法中所说的眼观六路耳听八方就是这样，只是不能太细思惟，在总体上都能安排好。比如说有的人在大事临头时，往往表现很镇静，此时所有的精力能力都调动发挥了出来，各种事情考虑安排得很周密，大脑高度旋转，工作速度惊人。世俗人做工作时有时也是这样，各人的精力能力大不相同，定慧就有区别。</p><p>意根同时能攀缘很多个法，并且也能刹那连续、相继不断的攀缘多个法。如果祂要攀缘六尘上的法，意识必然随之了别，所以意识也是能攀缘多个法。区别意识和意根，还是要在作主性上、作决定上区分比较容易，在习气、惯性作用上容易区分，在突然间发生事情时，容易区别意识和意根的作用，在浅层次的心理作用和深层次的心理作用上比较容易区分意识和意根。</p><p>二十、感应的事，还是意根的事，意根随如来藏无所不知，只是意识不知而已。当意根知道某些特别的事情，就有色身或者情绪上的反应，浑身毛骨悚然，莫名其妙的喜悦，内心焦躁不安，内心惶惶，神情肃然等等。人们所做的一切秘密事，能瞒得了意识，瞒不了意根和如来藏，因此未来都有果报。人们之间不知不觉的疏远和不知不觉的亲近，就是因为意识所不知道的某些事情。所以我们要善于守摄自心，不犯丝毫，心地清净，业种清净，果报就清净。</p><p>二十一、意根做主宰，一方面也要听从意识的分析判断和决定，然后再加以思量抉择，作主作决定，指挥六识的身口意行。比如当贪嗔痴烦恼现前时，意识能理智的思惟说：这样烦恼很不好，修行人不该有贪嗔痴烦恼，赶快冷静的降伏自己，这一想法传递给意根，意根就会思量说：是不好，那就不要再有这样的心行了，于是在身口意行上就有所收敛。</p><p>起思惟、分析、判断的是意识心，意识有反观力，能反观到自心烦恼，意根很难反观自心的心行，因此就要依赖意识的理智来暗示和督促自己，然后再小心的作主作决定。意根也是第八识输送识种子生出来的，自己不能决定自己的存在，不能自主，因此也没有自性。</p><p>意识学佛明理以后再熏意根，意根受熏就决定改变自己。第六识和第七识这两个识，虽然都是识，面对的内相分法尘是一样的，可是体性却有很多不同，多细心思惟二者的区别，慢慢就能把二者区分开，不再混淆不清了。</p><p>二十二、有人说：给意根什么暗示，意根就会实现什么，不管是正面的或是反面的，意根没有道德认知，没有对错感觉，只有惯性习性。意识有道德约束，有羞耻心，有责任感，所有这一切，意根都不具备，也无法具备。意根是直心，祂积累了无始劫来的所作所为的痕迹，只要当机，就去实施，当中没有任何对错、高低、责任、荣誉、所失、所得等的价值约束。本能、直觉、率性等等都是意根的体性，祂不掩饰、不妆扮自己，没有虚情假意，没有功利成份。这些说得都对。</p><p>意根主要是无记性的，不知善恶观念，没有是非判断力，从这点上看，祂的了别慧劣。意根属于最原始性的，原始性的也单纯，也愚痴，也直性，也浑厚，也深沉，也智慧，也伶俐，看祂从前和现在熏习了什么， 是否被熏习成就而论。</p><p>意识狡猾，聪明智慧，心不直；但也正直，也纯洁无瑕，也坦诚，这也要看从前和现在熏习了什么。意识也善也恶，恶时，也许比意根恶，能教唆意根；善时比意根善，能引导意根。意识愚痴时可能比意根愚痴，智慧时比意根有智慧得多。</p><p>意识比较心机，因为祂有思惟分析使计谋的能力。如果别人想刺探自己的隐私，意识在清醒时绝对要隐藏；意识在不清醒时，意根就不能被意识教唆，有什么就显露什么，不会隐藏，因为祂判断不了善恶利弊，没有价值取向，比较真纯。</p><p>二十三、一切法虽然由意根遥控，但是显现和变现却由如来藏作主。遥控器无论怎样指挥，最终还是由荧屏显示。让哪个识生起，是如来藏的功能，不是意根思心所的作用。意根只管决定见听尝触就行了，如果祂想见色，如来藏就自动配合，在此种色尘上出生眼识意识，意根不想看时，就转移注意力，不作意，不抉择，识种子就在此种色法上消失，或者是不在此种色法上出生，这是如来藏法尔如是的功能。</p><p>至于如来藏流注出识种子，为什么会分别形成七个识，这还是个极大的秘密。 意识能具体分别名相和概念，意根却没有名言概念。祂就像如来藏一样，如来藏虽然能变现出不同的六尘境界，祂也分不清楚色声香味触法，没有名言，不懂概念。意根大概也如此，只知道对应境界，具体也不知道色声香味触法的概念，不会归类。就像机器人能做很多事，但是它也分不清楚究竟做了什么，为什么要做，只是按照固定的程序做事。</p><p>机器人的程序是人为设计的，如来藏的运行程序和法则却没有人设计，七个识的运行法则也没有人设计，无始劫以来一直是这样，叫作法尔如是，但是七个识的法尔如是和运行规则随着修行能有所改变，如来藏的法尔如是无法改变。虽然成佛以后的如来藏功能作用与众生的如来藏有所区别，但那只是恢复本来面目。</p><p>在一切法上不仅有佛性的运作，也有如来藏本体的运作。因为如来藏有作意触受想思五遍行心所法，祂就有识别性，有祂特有的功能作用。如来藏虽然有识别性，但是祂无心，不能识别具体的内涵，不会把六尘分别出色声香味触法来，不像六识的那种分别性。人类的语言很难表达这些内容，只能意会，无法如实细致的言传。意根的了别性是介于如来藏和六识中间，比如来藏具体，比六识概略。</p><p>二十四、意根对一切事情都能作主，但很多时候也要听从意识的知见看法，所以意识有时能说服引导意根。意识通过分析思惟等等心理活动，把分析的结果传递给意根，意根了知后，就要思量如何处理，采取什么办法，然后作出决定，六识就要服从决定。</p><p>理智，通常是指意识心，因为意识能了别具体六尘境界，能对六尘境界分析、思考，从而作出合情合理的判断和抉择。如果不经过意识的思惟就作出冲动性反应的，就是意根。不用头脑分析思惟马上就应对的，都是意根的冲动性和惯性作用。意识有愚痴性时，往往不能或者不习惯于思惟分析，就让意根直接做决定，那是按照意根的习气做出的，往往是错误的，有烦恼性的。后来意识觉醒了，认为那样做可能不对，于是把分析的过程和结果传递给意根，意根了知后就重新思量该如何做最合适。有些时候，事情太急了，意识来不及思考，意根就根据自己的惯性和经验，直接作出反应，比如突然刹车，手被咬被烫，突然甩手等等应急措施。</p><p>二十五、显境名言的意思是，七识心与心所法，能够共同的把各种境界烘托显现出来，让他人理解和明了。七识心都有这个功能，不仅仅是意根有这个功能。表义名言，用字、词、句把内心的思想和境界表达出来，以让他人理解和明了。这是意识所具有的功能作用，意根没有，五识也没有。</p><p>表义名言，分为语言文字和觉观思惟，觉观思惟也是意识的特性，意识能明了六尘境界，之后就能对六尘境界起觉观，起思惟。意根没有这种表面的功能作用，祂所起的作用是隐蔽的、深邃的、暗暗的、难以觉察的，其作用相当大。如果两个识的识种子少于分流，少于分别其他法尘，那么了别慧就能更加强大，其作用力也相当大，能攻克一切法。当定力增强时，六七识的显境名言作用突出，意根的作用突出出来，得到充分的利用和发挥，其了别功能就会更加强大，对一切法可能都能思惟透彻，智慧涌发。</p><p>二十六、从任何一个方面任何一个角度来看，意根就是众生真正为依托的假我，是最主要的我，而且这个我一直都在把五阴身当作我，把六识的功能作用当作我，把第八识的功能作用当作我，认为所有的功德作用都是祂的功德作用，一切法的作用都是祂的作用。</p><p>意识也是一个假我，有明显的见闻觉知作用，众生都是以意识的见闻觉知为主，以意识的行为造作为主，当意识没有见闻觉知时就说我没有见闻觉知了，当意识没有行为造作时，就说我不能说话不能思想了。这个众生就是意根，祂依赖着意识的见闻觉知和行为造作，才能达成自己的目的和意愿，没有意识和意识的行为造作的时候，意根就无法在六尘当中有所作为，五阴身表面的功能作用也就消失。这是意根所不情愿的事情，所以修定让六识少于造作或者不造作，意根一开始是受不了的，修定就很困难，意根总是要挣扎着反抗。</p><p>从另一面来说，意识的见闻觉知和行为造作，都是意根支配和主导的结果，两个识一明一暗的互相配合着，几乎所有人都把这一切活动当作是意识单独的活动，丝毫观察不出意根隐秘的作用，埋没了意根的功德，不知道意根是这些活动的主宰，不知道意根才是主人，是众生真正的假我，解决意根的问题就能解决一切问题。</p><p>二十七、其实很多人是能够观察到自己意根的，只是不知道那个心那个作用就是意根，因为分不清意识和意根，就把意识和意根混合为一个整体我，变成为自己观察自己心的各种状况。</p><p>比如说，意识观察自己的能力和感受如何，里面有意识的能力感受，也有意根的能力感受，而通通都当作意识的能力感受。再比如意识观察自己是否能接受某种观点看法，观察之后，发现自己非常想接受愿意接受，可是内心还不能接受，愿意接受的就是意识，不能接受的就是意根，而不知道是意根不愿意，还以为是所谓的自己不愿意。意识如果发现了自己改变了认知和观念，愿意接受某种建议，改变了观念和认知的就是意根，意识还是以为所谓的自己，不知道是意根。</p><p>这些事例非常多，说明意识是能够观察到意根，就是分不清意识和意根，往往都是混合在一起的，如果说其中有意根的作用，那么大多数人就反对说：不对，那是意识。这恰恰说明了大多数人都把意根与意识弄混了，分不清哪个是哪个，烦恼遮障，智慧不足，没有转识成智之故。</p><p>二十八、造梦师是如来藏，祂根据意根的心思、心念和想法而造梦，造出梦以后，意根在梦里就迷失了，不知道自己是在梦里，对于梦里的境界还是很执著贪爱，误导意识在梦里造作。意识也分辨不出梦里梦外，就对梦境生出欢喜和忧悲苦恼的觉受，认境为真。意根里有很多的机密，都是从如来藏那里得来的，意识仅仅了解极少一部分，也许一点也不了解，因此才说意根有机密。</p><p>意根管理着如来藏的库房，看守着如来藏，意识管理着意根的库房，看守着意根。被看守的人有财宝，看守的人享受财宝；被看守的人是主，有大用，看守的人是奴，靠主吃饭。</p><p>二十九、心口不一时口说与心想分别对应哪个识？</p><p>在日常生活中，我们常常遇到口是心非、心口不一的情况，譬如内心嗔恨某甲，表现出来的口行身行却是慈悲与关爱，隐藏了内心的真实想法。那么这种内心的真实想法是意识的心行还是意根的心行？我们普通人能反观到这种状况，应该属于意识，真实的内心与意根相应，应该属于意根。但是意根是作主识，表现出来的口行身行是六识随顺意根的结果，那么这种慈悲与关爱也应该是意根的心行才对。可我们反观到的所谓内心真实想法即嗔恨某甲，却表现为慈悲和关爱，并不是内心的真实想法。问题到底出在哪里？</p><p>当意识与意根的心行不一致的时候，意识的力量强大能压过意根，意根就不得不顺从意识的心思，允许意识按照祂自己的想法说话表达自己，但意根在做事时仍然要按照自己的本意，这样意识的行为仅仅代表自己，不代表意根。不是意根的意思就是弄虚作假，心口不一，世俗所说的不是摸着自己的心说话就是这样，意识不按照意根的本意说话表态。那这时候应该明明心里是嗔恨，可意识不愿意把嗔恨的心理表现出来让人知道，因为如果别人知道了，就会认为自己不好没有德行，于是意识为了显示自己有德行，就表现为对人很慈悲和关爱的样子，为了让他人对自己有好印象好的评价。</p><p>假装的时候，完全是意识的伪装，意识能想出计策或者是阴谋诡计，强制意根同意，意根在没有主意的情况下，也听从意识的安排。一旦意识放松了警惕，不再看管意根，意根就会按照自己真实的想法行事，这就现原形了。没有意识伪装的心行才是每个人真真正正的德行和修为，这时候意根有没有修行，就能看得出来了。</p><p>意识对意根能起一定的作用，如果意识的主意和想法顺应意根的心行，意根就会完全同意，非常迅速的就能拍板做决定，没有犹豫。如果意识不顺应意根的心行，意根就要考虑考虑思量思量，再做决定；如果意识的分析力特别强，说服力也强，意根虽然不太赞成，也会勉强同意；如果意根的立场非常坚定，那么意识就无法让意根顺从和同意；如果意根非常固执，意识也无法说动意根。</p><p>如果意根不受意识控制，完全按照自己的心行行事，这个人就会很豪放，很天真，很淳朴，很任性，很固执，表现的都是自己的本色，好就是好，不好就是不好，个性很强。如果有意识调控，那意根就不能完全表现自己的本色了，要有不同程度的伪装，尤其是在人前，在有厉害关系的人前，一定要伪装一下。这是意根还不够好，所以才需要伪装，有在意的人和事，就不能率性而为。</p><p>一个人的本性如果是撒谎成性谎言累累，说明意根的本质很恶劣，如果意识不加以调控，就永远不能改变，如果意根没有撒谎的习惯，不喜欢撒谎，有的时候意识偏要撒谎，遮掩一些事实，这就是伪装，意识对意根进行邪教导。</p><p>三十、有懊恼自责的心是哪个</p><p>早上起床时一个心想起床，一个心不想起床，结果是没有起来，把重要的事情耽搁了，然后就生气懊恼自责，哪个心想起床》哪个心不想起床？谁在懊恼，谁在自责，谁在生气？</p><p>意识有理智，意根没有理智比意识要贪，贪韵味贪感受。早晨醒过来之后，意识理智，觉得应该起床，早点收拾好出门办事去。可是意根因为贪韵味，就显得比较懒，不决定起床，贪着舒服的感受。因为意根是作主识，不想起床就会继续躺着，最后意识的理智越来越大，不断暗示意根应该起床了，最后意根明白必须起床准备，不能再贪着了，于是不得不决定起床穿衣服。这个决定如来藏照办，六识就配合起床。从这个事例看出，意根有受，不一定是舍受。</p><p>因为晚起床耽误了事，最开始生气懊恼自责的一定是意识，因为意识思惟能力强，知道耽误了什么事，有多重要。意识懊恼自责之后，意根也就知道了自己的过错，可能也要后悔自责。如果意根不后悔自责，只是意识单独后悔，意根就不会改变，下次还会犯同样的错误，同样赖床不起来。</p><p>很多人出错忏悔自责，过后还会犯，那就是意识忏悔自责，意根不忏悔，错误就会一而再再而三的反反复复犯，不长记性。犯了改改了犯，就是意识，以后不再轻易犯错，就是意根长记性了。肉改骨头不改，说明是意识表面的改，意根不改不承认有错。</p><p>意识明白什么道理，想做到，但不能作主，必须说服意根同意自己的想法，或者是强迫意根同意，意根同意就决定，于是就做到了。如果是意根勉强同意，心里还不愿意，同样的事下次不一定能做得到。意根如果没有明理，经常被意识强迫，意根心理就有怨气，怨气早晚会爆发出来，如果不爆发心理就会郁闷不已。意识没有说服意根的时候，一旦放松督导，意根的本来习气就现前。所以意识造假，不能长久，总有露馅的时候。</p><p><br/></p></div>"
},{
    "title": "第二章　意根与意识在具体身口意上的区别",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　意根与意识在具体身口意上的区别</strong></p><p>一、意根与意识的区别，比如说自杀这件事，如果意识想跳楼自杀，而意根不想自杀，意根就不会作出自杀的决定，不会采取跳楼自杀的行动，否则肯定就跳楼了。意识总是想自杀，意根不愿意死亡，就会躲避自杀，于是意根就害怕和躲避与自杀有关的凶器，命令意识躲开各种能导致自杀死亡的凶器。</p><p>意识思惟到自己活着没有意思，生活环境不顺心就不想活，可是意根贪着寿命，不想死，二者僵持不下，就可能会出现精神分裂症，意根决定吃药治疗。如果意根想自杀，而意识不想自杀，意识就会千方百计找理由活下来，意根如果被意识说服，就决定不采取自杀的行动；如果没有被说服，就依然故我的决定自杀，那结果一定是自杀不可了。</p><p>二、善意的谎言、恶意的谎言和撒谎成性张口就来，这三种情况，意根和意识的心行有一定的差别。善意的谎言，意根不是染污的，意识也不是染污的，两者都与善相应，是为了他人的利益而着想的行为。恶意的谎言，意根是染污的，意识也许不恶，但要听从意根的指挥，协助意根编造谎言；也许意识同时也是恶意的，二者互为帮凶，同时造恶业。</p><p>谎言成性，随口就来，这是经常撒谎，是意根的习性，意识已经把意根完全熏染了，意根就喜好以谎言来骗人，骨子里就具有欺骗性，以至于习惯成自然。意识也不觉知，从来不觉悟自己的恶习，这就需要他人常常提醒，让他知道撒谎骗人的果报，才能慢慢扭转过来这个恶习。小的善意的谎言多了，也能造成撒谎成习，也不自觉知，那就麻烦了。如果不是有关生命等等重大问题，小的善意的谎言最好也不要有。</p><p>三、无名火和无明火，有什么区别呢？无名火是说不出原因的发火，没有原因，没有理由的发火，意识不知道为什么心里（意根）就是不高兴，想控制（意根）不发火却控制不了，意根非要发火不可，这是来自于意根的火，意根的火极大时，意识暂时就控制不了。</p><p>如果是意识想发火，意识就会越想越气，刚开始不觉得有什么事，也不在意，不太理会，可是琢磨琢磨就觉得不对劲，越想越不对劲，于是就发火了，但是意根不一定生气，意根不生气时，意识发火就是假生气，表面（意识）生气，而心里（意根）不生气。这是意识熏意根，让意根决定发火，意根本来无所谓的。有时发火没有理由，意识都不知道为什么发火，还一直劝导自己不要发火，这就是意根的事情了。</p><p>无名火是意根熏意识，而无明火包括三种，一个是由意根无明发出来的，一个是由意识的无明发出来的，一个是由二者共同无明发出来的。意识的无明比较好办，只要认识了正确的道理，就能受熏，从而明理；意根的无明就不好办了，不好说服，也不好劝导。如果二者同时都有无明火，这个人根本就一点理智也没有了，这时有人去劝导，不仅要挨骂，还会火上浇油，火焰会越来越高，一发不可收拾。</p><p>意根发火的决定，有主动和被动两种，主动的是意根自己发的无明火，被动的是意根被意识熏染牵制而决定发的无明火。有的人表面发火而心里并没有气，这是意识表面的气，也许是装出来的，也许是因为有禅定的原因；有的人表面硬装镇静，实际上心里已经气得不行了，这是意根强烈的火气，而意识还有一些理智，一直在控制着意根不要发火。</p><p>有时心里一边想不应该生气发火，这是意识的理智思惟，可是一边却不断的在生气发火，这是意根的火气大，不受意识理智的操控，不听意识的劝导。想控制的是意识，不能被控制的是意根。如果意根发的火太严重了，意识就得控制一下，稍微控制一点以后，然后意识再说理，给意根讲道理，分析利害得失，熏染意根，时间长了就能起作用，把意根降伏下来。</p><p>四、虚情假意是意识心表现出来的把戏，既肤浅又不真诚，其目的是为了骗取他人的好感，取得他人的信任，这也可能是受意根的指使和驱动的结果，受意根我执和执我的烦恼习气所熏染和指挥时，意识不得不把一个虚假的自我呈现给他人。率真而憨直是意根的本性，因为意根没有意识这个助手和帮凶，就不能弄虚作假，不能筹谋算计，只能表现为天然的习气。世俗人一般来说都会演戏，也都会搞虚情假意，甚至两面三刀，一面微笑（意识），一面脚下使拌（意根）；一面甜言蜜语（意识），一面暗藏杀机（意根），这就是意识与意根和演的诡诈。</p><p>而意根憨直，是怎样就表现为怎样，不会阿虞奉承，也不能阿虞奉承使计谋，不能也不会声东击西，不会甜言蜜语，不会虚假的微笑，不会演戏，但是依着祂的烦恼性，意识就要这样做。当圣人们修到意根时，降伏了意根的我执，不再执我，意识就跟着也憨直了，其心性就直而不曲，不会曲意奉承世俗人，不会说话绕三圈才表明自己的本意。世俗人的世智辩聪和善于权谋，在世俗里是受人欢迎的，而道人则心地质直而率真，毫不做作而曲意逢迎，因此不与世俗合，虽然身在俗中，而心常远俗，虽在世俗混，心不与世俗合。</p><p>意识有时撒谎骗人，意根本身也许不想那样做，而意识认为这样做有好处，能得到某种利益，意识把这个看法传递给意根，给意根以邪教导，意根知道自己能得利益，因为贪心故，就决定那就撒谎骗人吧，于是意识就撒谎骗人。很多人就是这样，心不直爽，声东击西，妄语连连，经常所言非所想，所想又隐隐不说，品性很恶劣。</p><p>从另一方面来说，如果一个人撒谎骗人已经成为习惯了，就是已经深入到了骨髓，深深植根于意根之中，就已经把意根熏染成功了。那以后意根的这个染污习气，遇缘就会现行出来，不用意识思惟，就自动的习惯性的撒谎，到处骗人，而习以为常不觉悟自己。没有修行的人，意识根本不能思惟撒谎骗人有多么卑劣，总是听从意根的指挥而到处撒谎骗人，只要能取得自己目前的利益就行，其他的都不管。有修行的人，就能常常回光返照自己的心行，知道不好时，就忏悔和扭转自己的心行，并且试图说服意根，与意根进行思想谈判，其结果谁胜谁败，取决于谁的力量大。</p><p>五、虚心假意、假情假意、装腔作势都是指哪个识？情执、深情、情深义重都是指哪个识？虚心假意、假情假意，是没有那种心而强装出来的，不是真有那种情义，内心深处的意根没有情意，就是没有诚心，是心意不诚的表现，只是意识在表面装一装，甚至意识也没有情意，所以是假，是装，不是真。真情实意是意根的内心深处的情意，是真诚的，发自内心的情意。因为我分为肤浅的意识的我和根本和究竟的意根的我，所以断我见，就有表面（意识）断我见和真正（意根）断我见之分，真正断我见，深入到意根，意根才能与无我相应。</p><p>凡是深和真，都是意根的，与意根相应；凡是浅和假，都止于意识层次，只与意识相应。意识可以装假，意根却要真情流露。真情流露时，意根就自动或者是不自觉的发动身心，表露情意。情执就是意根对一切法的执著，这是最难断除的，因为迷执得太深太久了，无始劫以来都是这样，意根的习气惯性力量太大了，不可能在短时间内改变和消除。</p><p>情深义重，是意根深重的情执，骨子里都是情，很难剔出来，也很难反观出来，而且总是要不自觉的表现出来。情执重的人，缺少理智，有理智的人情轻，容易说服和劝导。</p><p>与意根相应的法出现时，意根就直接快速作主，作出应对，不用装。因为意识不能作主，不能拿出真东西，所以意根和意识都没有的东西，意识就要装作有，就得演戏，这就不是真心流露了。真心流露，意根自然而然流露出来的，意根就会直接指挥身心表露出来，如眼圈发红，情绪激动，恋恋不舍。</p><p>六、如果恨的情绪到了咬牙切齿的程度，就是意根的深恨，是意根的反应。意识也有情绪，但是意识的情绪还是在表层，不至于咬牙切齿，因为意识不能自主操控身根。一件事情，一旦深入内心深处，就刻骨铭心，为什么？一切法刻入骨髓，就是深入到了意根，以至于流连忘返，念念不忘，朝思暮想，这都是意根自主调控六识表现出来的，是意识受意根的指挥和支配的结果。</p><p>意根的工作力度远大于意识的工作力度，而且还很有效、有深度，因为意根是作主识，能决定六识的身口意行。人在深度悲哀和深度愤怒时，定力也是相当强大的，有一股激劲，有一股凶猛势头，不可阻挡，都是意根强烈的执著作用，指挥六识所显现出来的。那我们学佛，也要学会调动意根的力量，让祂主导六识修行善法，道业何愁不成就。</p><p>七、一个人对人对事是用真诚心，还是用假心，是真诚还是虚情假意，就在于所用心是发自于意识还是意根。虚情假意的是发自于意识的用心，假意就不是意根的意，是意识的意；真诚实意是来自于意根的意，因为意根能作主，如来藏随顺于意根，要什么给什么，就是实在，而意识就不一样了，不能作主，如来藏不随顺，所说就不能实现，就是不实在的。</p><p>看人的面目表情，就知道他是否真诚，为什么？面目表情是身根的活动，直接由意根控制，与意根相应，色身以及表情有反应，说明意根动心了，内心非常在意。如果面目表情一般般，说明是意识表面的应付，或者是意识在控制意根，不让意根表现出自己的情义。所以意识的一切表现都是表面和浅层次的，深层次的表现才是意根的。</p><p>当意根的积习难改时，只有受到威胁和恐吓，出现了安危，感到自身有危险时，才能不得已改变自己。所以如果经历非常大的挫折，和非常现实的经历，意根才容易改变自己。意根接受和承认现量和现实越真实，意根越容易接受，所以人与人之间交往，用真诚往往容易打动和感化他人。</p><p>八、强颜欢笑、强作镇静、强压怒火、心花怒放、喜笑颜开、咬牙切齿等等行为里意识与意根多数怎样表现的</p><p>强，是勉强的意思，意根不大情愿，而意识很主动，勉强和克制意根，让意根随顺自己。意识有虚伪的表现，意根憨直、心直、质直，意根从来不虚伪，不会装模作样。强颜欢笑时，意根本来不想笑，可是意识虚伪，为了遮掩自心（意根），迎合对方，应付场合，强制意根作出欢笑的样子，这显现出意识的虚假不实。意识要假装笑，就勉强于意根，压迫于意根，强迫于意根，迫使意根不得不笑，让意根屈服做祂本来不想做的事，做违背自己心意的事。</p><p>因为意识理智性强，能分析利害得失，暂时说服了意根顺从自己的意思，但是还没有完全说服，意根没有完全明理，没有改变自己的思想和想法，暂时委屈不得不听从意识的建议，就要勉强的笑，叫作强颜欢笑，过后也许还会后悔而改变主意。</p><p>强装镇静，意根遇事时有些惊慌并不镇静，意识为了掩饰自己（意根）的心慌，强迫和劝导意根故意作出镇静的样子给对方看，以掩盖自己内心的慌乱和无住，这充分显示出了意识的理智性和虚伪性，善于假装。</p><p>心花怒放是从心里往外的高兴，心是指意根，意根喜悦或者是非常高兴，意识遮掩不住，也控制不住。喜笑颜开、开怀大笑、会心微笑都是发自内心的笑，都是意根表现出的真真切切、真真实实的快乐情绪，意识顺从意根，不压制和掩饰意根的情绪，所以就一点也不虚假不伪装，显露的是意根自己的本色。</p><p>情不自禁，意根内心的情感完完全全表露出来，没有掩饰，意识无心控制和遮掩，随意根的性情而表露自己，意根的本有的天真的性情就表现出来了。</p><p>皮笑肉不笑，皮，是肤浅的意识，肉，是隐藏皮里深层次的意根。意根本来不想笑，意识非要装笑，弄虚作假，所以意根和意识一个笑一个不笑，叫作皮笑肉不笑。从这里看出，很多时候，意根也随顺意识，被意识所控制，而不得自主，不得表现出自己的本来面目。</p><p>强压怒火，意根已经非常愤怒，马上就要喷火了，意识却很冷静，就过来救场，不让意根着火，强制性的压制意根，强力劝导意根不要发火，劝令意根冷静下来。意识如果真能劝说了意根，就不用强压，意根就乖乖的发自内心的做自己想做的事。因为意根的习气重，意识一时不能劝服意根，只能压制，意根勉强同意，不按自己的心思行事。但压制时间长了，心里就要做病，内脏就要受损。意根不明理，长期受意识压制，精神就会很郁闷，往往要出现心理疾病。所以还是要以理说服意根，打开意根的心结，疏通祂的情绪。</p><p>恨从心头起，恶向胆边生。心和胆都是由意根调控的，意根通过控制大脑神经中枢系统，就能控制全身的五脏六腑、各个藏器以及微细的细胞组织活动。意根的恨，是真恨，所以恨从心头（意根）起；而意识的恨，不是真恨，是假恨，表现非常轻微。当意根有恶心时，那是真恶，从心里往外的恶，丝毫没有假装的成分；意识的恶，是假恶，不严重，不至于造成什么危害。胆与恐惧和恶等等情绪想关联，恐惧与恶等就能影响到胆，只有意根的恐惧和恶，才能动用到胆，影响胆汁的分泌，从而让脸色和肤色有变化，呈现出暗紫色。这说明，意根一动就能牵动全身心的变化。恨得咬牙切齿，也是意根的恨，意根动用到了牙齿，牵动和影响到了牙齿，说明恨的程度很深，程度浅的恨就是意识的表面恨，比较轻微。</p><p>争得面红耳赤，气得嘴唇发紫，浑身颤抖，头晕脑胀，哭的死去活来，恨的牙痒痒的，愤怒的握紧了拳头，瞪圆了眼珠子，眼中喷火，气急败坏，气得二话不说，上去就一拳，打得对方鼻青脸肿，惊讶得睁大了眼睛，高兴得手舞足蹈，这些都表明意根动怒和动容以后，牵动身根作出的反应。如果仅仅是意识的心理状态，则没有这些反应，因为意识指挥控制不了身根，不能控制大脑神经中枢系统就不能牵动身根。</p><p>　　九、意根和意识的区别，比如自信这个法，有意根的自信，也有意识的自信，说不清道不明的是意根的自信，有理有据的是意识的自信，一个讲理，一个不讲理。直觉就是意根的觉，比较直接，不用意识分析判断，事情刚刚出现就能觉知。</p><p>相信自己的直觉，有意根的相信，还有意识的相信。直觉出现时，有时相信，有时怀疑，能生起怀疑的是意识，因为意识不能直接了知业种，有些事情不知道究竟为何，怀疑是必然的；但意识有理智，能思惟分析比较判断。如果意根相信直觉，就是相信自己，可能就不容意识置疑，这是意根的自信满满，也是意根的证自证分。</p><p> 再比如说早上醒过来以后想早点起床，可又找个理由再睡一会儿，六识出生以后就算醒过来了，想起床和不想起床的都是意根，找理由的是意识，意识要思惟分析算计考量，贪着享受，也依意根的贪懒而找理由赖床不起。意根不能找理由，因为祂很难做细微了别，无法仔细寻找理由和借口。意识找到理由之后，把理由传递给意根，意根再决定是否马上起床。</p><p>任何一个步骤都有两个识的密切配合，只是很难分清，意根一般都是依自己的习气惯性，想让自己有五蕴活动而已，但又贪懒一些，喜欢享受，意识有时候也贪懒，也喜欢享受。但早晨这个时候，意识本身精神不是很旺盛，其作用力比较小，对意根的影响作用不大，这时候表现出来的行为和思想观念都是意根的，意根是什么样就表现为什么样。在意识的影响力比较弱的情况下，才能看到一个人的真正修为如何。</p><p>十、问：想自杀的人，意识一定有强烈的意愿，意根虽然一时服从意识的意愿，而配合之采取行动，但意根的习气根本不允许杀死自已。否则，身体由意根控制，直接让心跳停止就行了。是不是这样？</p><p>答：身体虽然是由意根调控，但是意根不能直接控制身体，不能直接改变身体，意根的作主、指挥和操控是表面现象，实质还是由如来藏对一切法对身体作主宰，身体的任何功能作用都由如来藏主宰和管理，只不过如来藏是按照业种和意根的意愿造作罢了，绝不会自作主张。如来藏是主人，身体由如来藏出生和执持，意根无论想让身体怎么样，都要由如来藏配合操作，如来藏更要照顾业种，不能只听从意根的安排。因此意根不能直接让心跳停止，祂做不到，这不是祂的工作和能力范围。</p><p>至于意根决定或者是同意自杀，是因为意识对于人事和生存环境的思考分析的结果影响了意根，意根被错误教导，就同意意识的看法决定，同意意识的自杀决定。也有意根主动决定自杀，而意识并不情愿自杀，对人生还有些留恋的现象。自杀也是意根的烦恼习气的表现，因为意根的欲望很强，得不到满足，就产生了绝望，贪不到就不忍，就采取强烈手段而结束生命，这也是意根强烈欲望的表现。</p><p>十一、呼吸到底是由谁控制的，是意根还是意识？如果是意识控制的，当意识微弱和灭去的时候，呼吸却还存在没有灭，那呼吸就不是意识控制的。在心里紧张时，呼吸就加快，那么紧张是意识的反应，还是意根的反应呢？紧张表面是意识的反应，实际是因为意根执我性重，导致意识的精神紧张，导致身体出现一些不正常的反应，是意根控制的结果。身根和呼吸都是由意根控制的，不是由意识控制的，比如昏迷时没有六识，却有呼吸，有心跳和脉搏，有血液循环；睡眠时没有六识，也有这些身根的活动；无想定里没有六识，可是身体没有倒下，还是坐得笔直，这些时候身体都有意根的调控作用。</p><p>当意根遇到危险和紧急事情时，意识还没有反应过来，也根本没有思惟，身体就发生变化了，这就是意根直接控制身根发生的反应。紧急刹车，就是意根的直接决定，意识没有思惟控制不了刹车，等意识想控制刹车时，那是采取刹车行动以后的事情了。当遇到危险事情时，意识还没有反应过来，没有思惟时，身体的血液立时就加快了流动，心跳也加快了，非常快速，意识赶不上这个速度。当周围有鬼神时，意识不知道，可是身体却感觉麻酥酥的，头皮发炸，像过电似的，这都是意根的反应，是意根直接控制身体的结果。</p><p>呼吸属于身根的活动，意根缘于色身，也就能控制呼吸，其中不离第八识的配合，意识和身识也同时在配合起作用。当内心紧张情绪激动时，呼吸就急促，当心情放松，内心平缓，呼吸就缓慢。内心紧张时，意根因为执我就会护我，遇到事情就加紧作意，这样就牵动身根以及呼吸，同时让意识高度警觉，从而带动身体，产生反应，呼吸也就不顺畅了，所以呼吸与意根有密切的关系，也与意识有密切的关系。</p><p>呼吸急促是意根的我执习气使然，在四禪定里，因为意根不再攀缘色身，意识对色身不再关注时，呼吸就停止。意根越在意境界，越执我，意识就越紧张，呼吸越急促；意根越不在意，身体越放松，意识越悠然，呼吸越平缓。因为意根习惯性的攀缘色身，一直在执著色身，只有祂的攀缘性执著性减轻了，身根才能放松下来，呼吸才能顺畅和平缓，甚至在四禅定里灭去呼吸和脉搏心跳。</p><p>十二、意识的忏悔和意根的忏悔</p><p>忏悔分为真忏悔和假忏悔，身口意的行为造作都分为真和假两种。凡是假的不是真心想做的，不是发自内心的，都是意识心的表面做作；凡是真心的真诚的发自内心的，都是意根想造作的。真忏悔时，忏悔之后就能改正身口意行；假忏悔时，忏悔之后一如既往。</p><p>忏悔时，如果是真诚忏悔，发自内心，是意根主动发出来的，那么意根的心行就改变，业种或者是消除，或者是减轻。意根发露忏悔时，新业种存入如来藏，剔除旧业种，以后按新业种现行，也有可能业种不能完全替换，这在于意根的真诚度如何。意识心表面虚情假意的忏悔没有用，祂不能改变业种，业种由意根存入如来藏中。而且意识假意忏悔、欺骗人的忏悔还有罪，罪业增加，存入如来藏中，果报更重。</p><p>所以真忏悔是意根的从心往外的真诚忏悔，不是假装。意根想忏悔，就要通过意识通过五识，通过五阴身来表达意根忏悔之意。意根离开五阴身，离开意识和五识，没有工具，就无法运作，无法完成自己的心愿。从这里来说，意根离开意识就无所作为了，但是意根绝对有自己的智慧认知，天生的聪明智慧就是指意根，是意根从前世和无量世带到今世。这个智慧不需要意识教导，先天就具有。</p><p>意根的很多智慧，意识都没有，意识不懂的很多法，意根都懂。而意识还要靠意根来熏染，意识靠分析思惟判断不了人事物理，就要靠意根的直觉作用来判断和抉择。所以很多事情做完了，意识还不知道是怎么回事，稀里糊涂就把事情做完了，有些时候做得还很好。都是意根本身作主主导出来的。过后意识仍然不知道，不明就里。这种时候就没有意识的智慧参与，都是意根本身自带的智慧抉择。大多数时候，意识的智慧要远远大于意根的智慧，意根全靠意识的智慧引领，才能走上正道。</p><p>十三、忏悔，如果是非常真诚的忏悔，意根愿意悔过，就能改变业种，或者让业种消失，或者让业种不容易现行，或者减轻果报。因为意根能够悔过，心行改变，就能存入新业种，与旧业种抵消，忏悔的程度不同，抵消的程度就不同。如果不是真诚忏悔，走形式走过场的意识忏悔，意根心行不改变，旧业种就不改变，果报就不会改变。</p><p>我们当面跟别人忏悔就是这样，如果对方感受到我们是真诚忏悔，往往心就软下来原谅了我们，不再计较前嫌；如果对方觉得我们的忏悔不真诚，就知道我们的心没有改变，就不会原谅我们，那就会想办法报复了。尤其是知道我们假装忏悔，有心欺骗他，他就会更生气，从而加重报复。真忏悔是意根的忏悔，假忏悔就是意识表面的敷衍。当然是真忏悔有用能消业，假忏悔不能消业，也许还会加重业。</p><p>十四、有的人很容易健忘，某件事说要去办，一转身就忘了，其实心里是知道要办什么事的，但具体是什么事却想不出来，根结在意识这里。健忘是意识忘了什么事，想不起来了。决定要去办某件事是意根决定的，意识服从，可是没有仔细思惟辨别到底是什么事，有点心不在焉，于是转身意识就忘了。而意根并没有忘，仍然知道要办什么事，可意识就是不知道到底是什么事，于是就愣在那里仔细回想，可能当初记忆就不牢固。</p><p>十五、有的人一开口就是谎言，不说谎不说话，说谎话已经成了习惯，谎言不自觉的就从口里溜了出来，自己甚至都意识不到。这是意根的坏习气，意识故意说谎容易纠正，就怕意根习惯性的说谎，这个最难改正。说谎骗人的时候都以为神不知鬼不觉，可是所有有神通的人都能知道自己说谎骗人了，而且将来所有众生都能修出神通，所有的亲朋好友全部都有了神通，那么自己费劲苦心所要保密的业行，根本没有了秘密，那时候就知道了，当初自己是何苦造业呢。经常这样思惟观行，意根就会明了，心里有个约束，慢慢就会不说谎了。</p><p>十六、怎样判断烦恼是意识的还是意根的</p><p>一般来说，烦恼主要来自于意根，但是意根要表现出烦恼情绪，必须要通过六识才能表现得出来，以意识为主，附带着色身的变化。情绪主要指意根的，没有什么理由，不知来由的，说不清道不明的情绪，都是意根的情绪。当意根清净时，意识受环境熏染 想生起贪嗔痴烦恼时，往往是不了了之，即使刚刚生起，也很快就停止了，不再受环境影响，因为内心深处的意根是清净的。当意识生气想骂人时，由于意根不嗔，意识想一想就算了，根本骂不起来；或者骂也是假骂，口头出出气罢了。</p><p>当意根烦恼生气时，意识就劝自己（实际是意根）不要生气，不值得生气，生气不好，可是还是止不住的生气，有时还会气得发抖。这是意根内心的嗔太重了，意识控制不了。凡是涉及到色身身根的变化，都是意根主导出来的烦恼，不是意识表面的烦恼。如：喜形于色、怒发冲冠、手舞足蹈等等，都是意根不由自主通过六识身根表现出来的。我们从这些现象中，能够看得出来意根的烦恼是轻还是重。烦恼重的，无论自己规劝自己，还是他人规劝，都无济于事，往往要烦恼很长时间，直到有个结果，才肯罢休。</p><p>十七、有时候做事，明知是错的，却控制不住自己非要做不可，自己有时候是讨厌的事情，可是换了一种情景内心又向往，拉都拉不住，这是意根强大的习气力量，意识不容易控制住。</p><p>明知是错的，这是意识清楚的知，意根却不知，祂就非要去造作不可。是意识想控制意根，可是意根习气重，却不受控制，不听劝导。讨厌那件事，是意识讨厌，可是意根不讨厌，遇到机会就要现行自己的习气，违拗意识的劝阻，意识就一边照做，一边讨厌。要想改变意根的习气烦恼，就要静下心来，多反观自心，让意根明了自己的习气，知道事情的严重性，时间长了就会有所收敛。</p><p>十八、意根与意识的分别性很相近，二者在一起缠绕的又太密切，在身口意行中，很难区分开哪个是意根的功能作用，哪个是意识的功能作用，往往混淆不清。意根有思量性，有思心所，也有想心所，因为意根也是识，识有了别性、思量性、抉择性。虽然意根的思量与意识的思惟有些差别，但是意根的识性也较为突出，也是活泼泼的，祂并不是呆瓜死板板的。因为意根的心行比较深和隐秘，极大多数人很难发现和观察。一般明心开悟的人，观察第八识也比观察意根要容易一些，如果没有人教导意根的法，也同样很难体会意根。</p><p>比如在一个人撒谎时，这个撒谎到底是与意识的烦恼相应，是意识决定的，意根随顺；还是这个撒谎与意根相应，是意根的烦恼习气现前，意识不得不随顺，这里就太难区分了。可以这样区分撒谎是谁主动发起的，如果意根没有撒谎的习气，偶尔遇见某种事情，意识分析思惟应该撒个谎，才能躲避危险，保护自己，认为撒谎对自己有利，于是意识决定撒谎。意根了知意识的分析和决定以后，作意触受想，然后思，不断的思量到底应该不应该撒谎，最后思量明白了，为了自身的安危和利益，应该撒谎，于是意根就同意意识的决定，选择了撒谎，于是意识的谎言就造作出来了。</p><p>还有的时候，意识烦恼轻微，比较理智，不愿意撒谎，但是意根的习气重，喜欢撒谎，每当意根决定要撒谎时，意识就不愿意执行这个指令，总找借口不撒谎；或者心里感觉撒谎不好，有些愧疚，也许最终要随顺意根的抉择。如果意识善于思惟分析判断，就能改变意根的决定，而不撒谎。只要内心矛盾重重，就是意识与意根思想观念不一致的时候，是理智与烦恼情绪较量的时候，最终哪个占上峰，就看此人是理智性强，还是情绪化的烦恼习气重。</p><p>再比如，有的人平时感觉自己修的不错，可碰到有人冤枉责怪自己，立马不经意识的思惟，眼一瞪，就开口回骂对方，这是意根的习气现前了，意识没机会控制，或者控制不了，或者根本就不想控制。有没有修行，这时就看意根的反应了。瞪眼和回骂奚落的语言，都是意根决定指挥六识造作出来的，显现出意根的烦恼习气，意根能控制色身，能操纵身口意行。六识的行为受意根的调控和指挥，是意根决定造作的，这一切身口意行就是六识受意根指使造作出来的。从以上二例中，可以区分意根与意识的作用，从而可以观行到自己心里的问题所在，着手对治自心烦恼。</p><p>十九、第六识分为五俱意识和独头意识，五俱意识往往是与前五识一起分别六尘，第六识分别六尘的细相内容，起着分析、思惟、推理、判断、感知、研究等等的心理活动。不与五识在一起的是独头意识，分为散乱独头意识、定中独头意识和梦中独头意识，经常打妄想、开小差、心不在焉和思前想后的就是散乱独头意识，定中独头意识能了别入定中的各种境界，梦中的畅游的识心就是梦中独头意识。</p><p>表现出很多的习气惯性，按照惯性去做的，就是第七识意根；有时是意识明明知道不能去作的事情，可是控制不住，非得要作的，就是第七识意根；在任何一件事情上起着决断作用的，就是第七识意根；有时突然一件事发生，心里没有准备，意识心来不及作分析思考，就会按照惯性作用决定去做的，就是第七识意根。</p><p>比如有人掉到河里，意识来不及想什么，意根就决定跳到河里救人，之后意识心会想，跳到河里救人该有多么危险，想起来真是后怕呀。过后才知道危险的是第六识，当时立刻决定跳河的是第七识，做事情时当机立断的，就是第七识意根，而翻来覆去思考的，就是意识。</p><p>不经过思考就做决定，往往会后悔，有悔心的是意识，事情过后意识回想事情发生的过程和结果，知道不应该那样做，应该这样做才对，后悔一时的冲动。而意根的分析思考力是很差的，往往不能有理有据的思惟分析，不能有逻辑性的推理，对一切事情，了别的都不清楚不细致。所以第七识是按照习气惯性去作决定，理性思考力不足。第六识就会思惟、分析、判断、计划、策划、研究等等，比较理智，也有智慧，但是不能当家作主，只能作第七识的奴仆，也作第七识的同谋者、诱导者、引导者、牵引者、教育者。</p><p>二十、问：当嗔心生起来后，意根是与意识同时起嗔，还是仅意识起嗔？意根那时在干什么呢？为什么意识已经把引起嗔心的事情用正见想明白了，心里还是很苦闷痛苦，是意根仍然在纠结那件事吗？还是意根并没有参与？对于事情的道理意识很快就想明白了，等意根也想明白后，心里一下子透脱出来很舒服。但这种苦闷消失的很慢，是不是意根不像意识那样能很快的明理？</p><p>答：意识所有的心行造作，是因为什么产生出来的呢？那就想，意识是因为什么而出生的？是因为意根触法尘以后，如来藏出生的，法尘是什么？就是意根所触的值得生气的内容。意根触值得生气的法尘，想要发作，思心所一决定，如来藏就会出生意识，满足意根的心思，于是意识就生嗔发作起来。意根想造作的时候必然让意识帮助祂造作，因为意根没有帮手在某些法上无法造作，就得需要意识帮助自己造作，这时候意识才能出生，意识就是意根的代言人和工具，替意根表达心声的。</p><p>那么意识生气这个法，是如何产生的呢？是因为意根生气了想要发泄出去，想要表露自己生气的态度，如来藏就配合出生意识，用意识来表达意根的愤怒，那么意识出生以后就起了愤怒的心行。</p><p>意根起嗔是真生气，只有意识生气是假生气。意根真生气有各种表现，比如面部表情上的脸红脖子粗，语言造作上的恶口，身体姿态上气的鼓鼓的或者是大打出手，这都是意识和身识共同造作出来的，是顺应意根的心行才造作的，完全表达了意根的心行。而意识单独生气，是意识在了别境界时，觉得境界有点不可心，但是意根觉得无所谓，心里很平静，这种生气就没有什么力量，不会有什么严重的造作，只是做做样子而已。</p><p>但是生气之后两者的反应有区别，觉悟性不同。意识可能就会马上反观自己，反观这些行为造作，意识可能觉得生气是不对，因为什么不对意识一想就能想明白。意识虽然想明白了，但是意根还不明白，那祂心里还照样生气，气得鼓鼓的。意识就说：不要生气了，不要生气了，本来就是自己不对，意识这样说，意根还是不理解，照样生气。有时候意根根本控制不住发火想要打人，意识就说：不要打人，打人不好。但是意根不听，于是一边说不要打人，一边抬手就打。所以意识明理有理智的时候，也不一定能控制得了意根，祂非要发作不可，那意识没办法就得帮祂配合祂，不得不听从意根主人的指挥。</p><p>我们心理行为分为意识层面和意根层面的，意识层面的是被动的、要服从意根的旨意。意识层面要想作主宰的话，必须把意根影响过来，熏染成功，然后意根才作主决定，顺应意识的想法。如果意识熏染不成功，意根还是要顺着自己的心行来发作，那么意识怎么劝也没有用，告诉祂不要生气，那边还是很生气，告诉祂不要这样做，祂非要这样做不可，那就没办法了，那意识一边没办法，一边就去照做。说一套做一套，就是意根不肯听从意识的意见，一意孤行，不能按照意识所说而为，心行不一致。</p><p>二十一、意根离开意识是否有了别性</p><p>离开意识，意根不能了别六尘境界中的冷热和痛痒等等具体而细微的境界，意根无法微细了别六尘境界。但是意根能粗略了别，能从大体上了别一些，不能细致。意根依如来藏能了别一切法，只是无法表达和造作，必须依靠六识才能表达、造作、解决一切六尘问题。比如半夜睡着了，房间里很冷，对身体有影响，意根依如来藏也能了别出来，就会让身体蜷缩起来，往被子里钻，甚至做梦暗示意识身体冷，让意识解决这个问题。</p><p>半夜睡着没有意识，身体被蚊子咬，感觉痒，意根也能了别，所以就想抓痒，自己没法抓痒，如来藏就配合意根出生意识身识一起抓痒，之后两个识再灭去，继续睡觉。如果蚊子咬的轻微，不太痒，意根就忍着，不决定抓痒，意识身识就不会出生处理被蚊子咬的问题。</p><p>二十二、担忧、害怕、烦闷等等思想情绪来自于意根还是意识？</p><p>凡是意识无缘无故的担忧、害怕、烦闷的，都来自于意根，因为无缘无故，意识不知道意根是什么原因有这些情绪，而能知道意识自己的原因。意识所发泄的情绪都是有原因的，因为意识能反观自己，能分析、能思惟，就知道意识自己因为什么发火有情绪，但不容易观察和分析意根的情绪。</p><p>当意识分析不了思惟不了还要发火、还要烦闷，那都是来自于意根，是意根指挥意识发泄情绪的。比如早晨醒来，什么事儿也没接触时，就莫名其妙的感到不舒服，心里难受，就想发脾气，那都是来自于意根的思想情绪。意根有什么想法意识不知道，但是意根必然要促使意识发泄这些思想情绪。</p><p>好多的情绪一时说不清道不明的，全部来自意根，甚至意识一直想控制，也控制不了的情绪，全部来自意根。从这方面来观察，就能慢慢分清了意识和意根。如果意识知道某件事不好，有些担忧，但是意识随后理智的分析认为没事，但是心里还一直担忧，或者越来越担忧，这是怎么回事呢？这是让意根担忧了，意识说没事，意根没有还不懂不理解，就会仍然担忧不已。</p><p>二十三、什么是疑情</p><p>所有的没有解决的问题都可以是疑情，只不过有深有浅之别，能否相续而已。还有疑情疑在哪里的问题，如果仅仅是意识起疑，那就很浅，一会儿就能忘记了，不会再接着追究，几乎都是断续的，很难真正解决问题。内心深处的意根起疑，才能朝朝暮暮，不断的追究，行走坐卧都疑那个问题，心念不间断，直到解决疑问为止。</p><p><br/></p></div>"
},{
    "title": "第三章　意根与意识在了别境界上的区别",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　意根与意识在了别境界上的区别</strong></p><p>一、一切法都是意根先接触到的</p><p>性境，是如来藏依据外界本质的真实境，而又变现出来的六尘的影子，在胜义根里，四大微粒组成，七识意根先缘先了别，意识后缘后了别。如果第七识缘这些影像而不决定细了别时，六识都不能被出生来了别，因为意根不需要六识这些了别工具时，如来藏就不会变造六识工具。第七识一定是时时刻刻缘着六尘，祂靠着如来藏，近水楼台先得月，什么法都能借光先知道个大略，至于知道后究竟要如何作为，就看意根的心行和修为了。</p><p>二、本来是去房间拿书，可一进门却忘记了要拿什么，故而愣在那里，此时是什么心理状态？去拿书时，反倒忘记拿什么了，知道要拿什么，没有拿的对象，这说明意根心里除了有拿书这件事，还有其它事情正在攀缘和惦记着，同时也让意识分心，以至于其他事压住了拿书这件事，意识不能从意根那里得到指示，只好愣着等指令。这时意根缘不了书这个事物，意识就想不起是拿书，只是知道个拿什么，其他的就不知道了。这时意识处于不知所措、不知如何是好的心理状态，所以不得已就空空的，因为意根不给祂内容，祂就没办法知道。</p><p>愣在那里，是意识想不起来要干什么，不知道干什么才好，而意根在暗暗的搜索目标，寻找内容，意识就愣在那里等着意根提供内容信息。意根不给意识内容，意识只好空空的、愣愣的、傻傻的，好像很专注的样子，其实是无奈。</p><p>像这样愣住的情况每个人都可能出现过好多次，都是因为心不在焉，不专心，精力不集中。意识本来想做点什么事，可是有时候却想不起要做什么，怎么想也想不起来，这时的情况是意根在搜索频道，搜索节目，却一时搜索不到，这时一个可能性是信息太拥挤，选择不出哪一个，思心所不能作决定，如来藏就帮不上忙，调不出来业种；另一个是业种现前的因缘一时还不具足，需要的法尘如来藏不能变现出来。意根在搜索信息时，肯定是有关键词，不然天南海北的，像大海里捞针一样，祂怎么能找到目标。</p><p>有一些愚痴的人就是如此，记忆力不好，智慧也不好，心里真正能说得出来的念头也比较少，他们修定就很容易，很快就能无念，可是还是照样愚痴，因为心里没有观行的内容，无法出生智慧，外道们也如此。所以说有定不一定有智慧，无定一定无智慧，只有定中如理思惟观行，才能生智慧。如果在修定时，为了尽快入定，意识心要告诉意根：我修定时什么也不要给我弄出来，我什么也不想知道，别给我什么信息让我了别，我不管那些事，常常告诫意根，时间长了，也很管用。</p><p>三、每个人的如来藏所面对的境界画像是一样的，外境界相同。由于各人业障不同，心所法不同，智慧不同，看见内境界画像的感受就不同。这是各人识心智慧和业障等等不同所致，不能说各人所对的外境画像不同。</p><p>同理，第八识变现出一个内相分，由于六七识的智慧不同，定力不同，经验不同，所受的熏习不同，烦恼遮障不同，导致二者所了别的结果就不同，感受不同，抉择也不同。因此不可以说第八识为六七识变现出的内相分不同，这样说是不合理的。因为第六识所了别的一切内容，全部是意根所接触并且决定要细致了别的，如果意根不接触的尘境，意根不想细致了别的尘境，如来藏绝对不会出生第六识，因此说第六识与意根所缘所触所了别的尘境一定是一致的，只不过意根所缘所触所了别的法要比第六识多很多。意根不触不了别的法，第六识没有任何理由去触和了别，第六识自身不可能在此法上出现，更何况了别。</p><p>意法因缘生意识，意识与意根所缘永远一致，否则意识是如何出生的？意识的出生难道不需要意根，不需要法尘吗？同样都需要，那么意根触法尘之后如来藏才出生意识，二者必缘同样的法尘，不可能各缘各的法尘，不可能缘的法尘不同，这样说过失极大。</p><p>过去菩萨们讲的唯识法义，都有不通之处，所以才互相争论不休，我们不可以全盘接受而不要自己的思惟。如果智慧不足，实在思惟观行不了，就暂且放弃，将来定慧都增长以后，再进行思惟观行就能通达一些了。</p><p>一个法义立论的前提错了，后边的结论必错。六七识了别六尘境界的结果不同，并不能说明各自了别的境界不同。只能说各自的智慧不同，心所法不同，了别结果才不同。就像一个老师讲课，一百个学生各有自己所解，不能说因为学生所解不同，就说老师讲了一百个科目，这样的事不可能出现。意根与意识所触的法尘永远是同样的，只是因为意根的了别智慧不够强大，不够细致，很多法了别不清楚，能力不足，祂必去求助于六识去作细致了别，以弥补自己的不足。</p><p>就像一个孩子面对一块大石头，他觉得自己搬不动，就要求助于他人帮助他搬开，二者是一个道理。大人和小孩子所面对的是同样一块石头，不可说两个人面对两块石头，小孩子让大人搬这块石头，而大人去搬另一块石头，这样的事是不如理的。又比如富人看到一百元钱不愿意捡，穷人看见了以后就像看见金山一样，立即拾了起来，不能说二人所见的钱不同，导致二人的觉受和抉择不同，这是两个人的业不同所致， 两人所见相分百分之百一致，没有差别。同理，意根想了别一个境界，而六识去了别其他境界，不服从于意根，这也是不如理的，这样的话，意根也就不叫作作主识了，祂指挥不利，就不是真正的指挥官，并且意识也不是意法为缘而生的了，不知道是什么缘出生的，这就违背了佛说。</p><p>各识了别结果的不同，只能从各自的了别智慧心所法这里找原因，不可推断说是因为所缘境不同，这样推断是有过失的。不管实法，还是假法，不管是性境，还是影像，不管什么相什么尘，都是第八识亲自变现。七识只能把这些影像在心中显现出来而已，或者是作出决定，第八识随顺再改变境界相。既然都是第八识所变现，那么一切法都不是真实存在的，是虚幻的，如梦、如影、如空谷想、如月影等等，这些都是观行结果。</p><p>四、对有些事情的了知，意根了别不清楚，意识了别出来，报告给意根，意根再作决定。有个别事情是意根先了别个大概，再决定让意识解决，意根能决定意识的行为取向，比如某种事情即将要发生了，意识不知道，意根先知道有事要发生，就会警觉意识指挥意识，意识就糊里糊涂、莫名其妙的采取行动。</p><p>很多事需要意根来提醒和警觉意识，因为意根先与法尘相触，先了别，意识后了别。比如突然间想起了某件事，就是意根提醒意识的，比如想起了刚才应该做某件事而没有做，于是马上去做，这就是意根提醒意识的；打坐当中想起的所有事情，都是意根提示，意根弄出来的，心里的胡思乱想，都是意根弄出来的，独影境全部是意根弄出来的。对于六尘的具体了别，是意识了别之后传递给意根知道，意根再依此做决定，但也是意根先缘之后所作的决定，促使意识出生处理六尘境，因为六尘具体事情如何，意根肯定了别不清楚，必须依靠意识了别。</p><p>五、意识和意根到底谁缘境</p><p>意根和意识都是识，都要缘境，如果不缘境，就不能存在。尤其是意识，祂没有单独存在的理由，有法尘境才能有意识的出现。意根先缘法尘境界，根尘相触，如来藏出生意识，三者和合触，意识缘法尘，再分别法尘。所以二者都缘境，而且必须缘同一个境，否则意识不能出生。</p><p>意识出生是有前提条件的，必须有意根，有种子，有法尘（是意根正在触的法尘），有胜义根（无色界除外），有如来藏；而且根尘要相触，根是意根，尘是法尘，在根尘相触处，如来藏生意识，意识再触法尘和意根。这时意根仍然在触法尘，如果不触法尘了，意识就灭去，意识出生之后就了别法尘。所以说意识所缘，一定是意根所缘的，是意根决定和支配的，由如来藏提供。而意根的出现，可以没有尘境，不用缘尘境意根就能存在；而尘境正是意根推动出来的产物。只要尘境出现了，意根必缘尘境，但不一定要对尘境进行造作，不一定要有六识去了别尘境。</p><p>六、问：第七识有慧心所，那就是说具有择法能力了（思量性，亦或是选择性）？这个择法能力有多大？自己能成办何事？或者只能与意识合作方能成事？</p><p>答：第七识意根有慧心所，有一定的了别能力、辨别能力、判断能力、选择能力；第七识意根有思心所，就有一定的思量性、辨别性、选择性、抉择性、决定性。第七识的思量了别抉择，与意识的思量了别抉择有一些差别，祂可以与意识一起共同合作再作抉择，也可以不依靠意识单独作抉择。第七识的思量了别如果不依靠意识单独进行时，往往是依据祂生生世世所具有的习气惯性，依据自己历劫以来的经验，这些经历经验，意识都不知道，也大多不懂。</p><p>意根对不属于胜义根里六尘之外的法尘的了别抉择，意识从来就不知道，只有第八识能了别到意根的心行，祂们两个一起和合运作所搞出的一些法，所做的一些事情，意识都不知道，或者意识知道一点点而感到莫名其妙和不可思议。比如意根前世今世发出的善的或恶的咒愿，这些咒愿实现时，意识并不知道，并且还感到莫名其妙。意根做的不少事，意识都不知道，那就说明意根所单独成的事，不用意识参与的事有很多，意识几乎都不知道。</p><p>意根依靠意识所作的思量、了别、抉择等等，要等意识详细具体的了别六尘之后，再作以思惟，作出抉择，把结果传递给意根，意根依之，再作了别、辨别、思量，最后才作出最后的抉择，也许与意识的抉择一致，也许与意识的抉择不一致，意识的思惟分析抉择只是一个参考，意根不一定完全听从。意根的我性越重，越不容易听从意识的思想、观点、看法、建议和抉择，不容易被劝导和影响。但是意根一般情况下，都要依靠意识的具体细致的了别，因为意根自己无法作具体了别，必须依靠意识的了别，才能作出判断和抉择，其中还要加入自己的习性。</p><p>七、问：亲人要出意外，自己提前很长时间心理郁闷，莫名其妙的哭泣，紧张忧虑，这是什么原因？预感，是如来藏的警觉作用，还是意根的警觉作用？</p><p>答：首先是自己的如来藏相应到了亲人的业种已经现行出来的一部分业缘，意根依如来藏所现行出来的业缘，了别到即将有意外发生，于是促使色身莫名其妙的流泪、哭啼、郁闷、惊恐、不安、烦躁，于是意识就猜测思惟，是怎么回事呢？有什么事要发生呢？再于是意识想到了（通过意根的暗示）可能是某某有什么事情了，经过核实，最后就知道发生了什么事情，知道自己的亲人出事了，或者是和自己关系密切的人出事了。这符合意根对身心控制的原理，符合意根指挥身心的原理。这其中都有如来藏的配合，如来藏不管了别到什么法，都是如如不动，不起心动念，不能指挥色身出现各种情绪化的反应，不能让五阴哭泣、流泪、烦躁不安，这些都是意根调控身心的结果。</p><p>意根依如来藏的了别，也了别到了如来藏变现出来的业缘，知道要有事情发生，于是产生一系列的身心反应，对于意识来说是莫名其妙，可是意根知道，却说不出来。一个能说出来，有语言文字，有觉观，却不知道发生的事情，也不知道要发生的事情；而另一个知道即将要发生的事情和已经发生的事情，却没有语言文字，不能说出来，这二者打交道，互相之间就要配合默契，互懂心思，才能把事情了解清楚。</p><p>预感是意根了别到了如来藏现出的业缘，从而让身体和意识心发生变化，如来藏不会主动去警觉意识，第一如来藏不知道具体的事情，不了别六尘境界；第二如来藏无心，对一切法都不动不摇，如果是如来藏警觉意识，如来藏就有主动性，就不符合如来藏对万法的如如不动性。如果如来藏在一些善恶是非的事情上动转了，那么祂就不会让五阴身出现各种恶缘和恶果，不会让五阴身去三恶道受苦。如来藏不仅能了别自身的业种，也能够了别他人的业种，但如来藏不会主动去了别某个人的业种，还是要由意根来驱动。</p><p>那么，意根究竟对什么人的业缘进行攀缘呢？主要是往世以来缘结得比较深的人，意根对其有较深的贪爱习气，比较执著，所以攀缘性就强。因此，并不是所有的今世的亲人要出意外，意根都能警觉到。意根越在意的人，越能促使如来藏去了别业种业缘，对不在意的人，如来藏顺便了别到了业缘，意根也没有什么反应，意识心更是不知不觉。</p><p>意根对自己不在意的时候，自己身体出现病痛，出现违缘，意识也不知道，病情很严重了，意识可能也不知道，意根不会警觉意识。意根不在意自己时，祂还有别的追求，在意别的事情，比如专心学佛修行，而疏忽自己色身感受等等，还有科学家专心于科研等等。有禅定的人也不在意一些事情，比如饮食衣服卧具，对六尘都不在意。有的人是意根了别到了一些事情，而意识糊涂，不敏感，甚至自己快死了，都不知道，别人却先知道了。</p><p>八、意根是否只能缘带质境</p><p>意根与法尘相触生意识，意识缘的法尘必须是意根所缘的，意识与意根所缘必须相一致。如果意根只缘带质境，不缘性境和独影境，那么意识有什么理由缘性境和带质境，如何缘？意根里的秘密太多了，从意根这里能解开佛法修证的大秘密，如果定慧不足，观行意根一点门也找不到。</p><p>如果意根不缘性境内六尘，祂如何作主让六识作意、触、思内六尘性境，如何指挥六识在内六尘上造作？如果意根不缘独影境，意识也不可能主动攀缘独影境，种种分别妄想，想入非非，这些法都是意根首先去攀缘和执取的，因为意根的攀缘和执取，生起思心所，想要细致了别，如来藏就随顺配合，在意根与所攀缘的法尘处出生意识，三者和合触，意识再触意根和法尘，然后意识就不得不了别和分别意根执取的法尘。意识都是被动的被意根指挥着了别一切法，都是意根了别过后，才唤起意识作微细了别的。意根是作主识，具有强大的作主功能，能支配六识随着意根而转动，六识所作，没有超出于意根了别和作意受想思范围之外的六尘境。</p><p>意识与意根所缘必一致，意识在意根与法尘接触处出生，然后三者和合触，意识了别此法尘。这是基础佛法，学佛人必须贯通，才能了知六尘生起和运作的真实程序，才能知道六尘境界是如何在心中出现，被识心所了别的。意根能透过如来藏的了别，而作自己的了别，然后警觉意识，意根比意识先知先觉。意识了别的内容一定来自于意根攀缘作意的内容，不能超出意根攀缘了别的范围。</p><p>世尊在楞严经里说过，意根默容一切法，这一切法包括了自己的如来藏所变现出来的所有法，一个法也不能漏掉，否则意根就不是默容一切法的了。如果意根有不遍缘的法，那就不能默容一切法，应该说是默容一部分法，这样就有违世尊圣教，或者说世尊所说有误；如果说世尊所说有误，世尊就不能称为世尊和天人师、一切种智者。那么根据世尊的圣教量，意根既然能默容一切法，就能缘到一切法，否则就默容不了一切法。</p><p>如果意根不能缘一切法，那么如来藏又根据什么而现起一切法在心中？意根是现起一切法的动力，是三界世间法表面上的主宰者，这是其一。其二，如来藏所变起的法，如果意根不能缘，意根就不会在此法上有五遍行心所法的现行，对此法意根就不会作意，没有思心所的抉择，如来藏就不会随顺意根的思心所而配合意根，对此法继续造作下去，那么就不会有五识的出生，不会有意识的出生，去了别此法。</p><p>因为六识的出生和了别，都由意根来推动和指挥，由意根来抉择；没有意根的思心所的现行，如来藏没有理由主动出生六识去了别和造作；没有意根的抉择，如来藏不会主动出生六识，让六识造作身口意行。意根是一切法刹那刹那的主宰者，如来藏不会去作主，不主动主宰一切法的造作。这是佛法的基本常识，虽然比较深一些，也要尽量领会贯通。</p><p>再说，意根如果不攀缘、不执取一切法，如来藏就不会自动出生意识了别独影境。独影境是意根攀缘执取的结果，意识无论何时何地，都不会离开意根而单独出生，单独去把如来藏里的种子现行出来成为法尘独影境，然后再去攀缘和了别；意识不能越过自己出生所依靠的最重要的一个缘意根，没有根，就没有识的出生，如来藏也不能无缘无故就出生意识，出生意识是意根推动和抉择的结果，如来藏只是配合和随顺意根的抉择，祂是无我性的，不自作主张。</p><p>意识分别任何法尘，都是因为意根想了别某种法尘，如来藏随顺意根才出生意识去了别法尘，意根是意识的主宰者和操控者，意识不能超出意根的了别范围。所有的境界都是意根攀缘出来的，尤其是独影境，更是意根的攀缘和执取所变现出来的。如果意根没有执著性，其攀缘性就少于现行，六识就少于了别六尘，心不会散乱，意识也没有那么多的妄想，也就没有独影境的出现，独影境就是非量妄想境。就像四果阿罗汉，因为断除了我执，意识不再散乱，梦境也极少出现，心所法减少，禅定力很强。俱解脱的阿罗汉入灭尽定也很快，因为意根不再攀缘，不执著三界的法，意识就不打妄想，心中很少有法尘的出现，很少有独影境的出现，就容易灭去。</p><p>意根有所攀缘之后才能出现独影境，意根的攀缘执取性能把如来藏里的种子直接现行出来，自己了别不清楚，才唤起意识了别，意识才不得不了别独影境，于是妄想纷飞，杂念丛丛，打坐很难入定，都是因为意根没有驯服所致。所以众生的心识很散乱，修定就很困难，不容易出现禅定。</p><p>能杂思乱想的是独头意识，其思和想的对象就是独影境，不与五尘有关，这很明显是意根攀缘出来的。意根没有被降伏，没有禅定时，才促使意识杂思乱想和漫无边际的幻想，这都体现了意根的遍计所执性。这些法义，很明显就能体会观察到。要想修好禅定，必须降伏意根的攀缘性，降伏意根的处处执取性遍计所执性。这些道理虽然很深，但也是基本的佛法理念。</p><p>九、有人说意根的了别是非量了别，所以缘的都是带质境，那么如果地上菩萨的意根转识成智以后，对一些法不生起错误的见解，不把如来藏现起的一些法当作真实，也不当作是意根自己的了别结果，也不当作是意根自己所有的，那么带质境这种错误的了别结果，是否还存在？那就不存在了，或者是减少错误的了别，减少非量的了别，也不完全是非量了别了。直至佛地，佛的意根完全彻底转识成智，不再有任何一点点的非量了别，那就没有错误的带质境的生起，都是现量的正真的法尘境，那是大智慧的究竟成就的结果。那么既然佛的境界中，没有带质境的虚假境界了，如果佛的意根不缘性境和独影境的话，佛的意根还缘什么法？</p><p>地上菩萨的意根，其错误了别减少，带质境减少，菩萨意根的了别是不是要比地前菩萨和凡夫的意根了别的境界减少呢？如果是，地上菩萨的意根了别就有不遍之处，就不是默容一切法的意根。即使是凡夫的意根，如果有不缘的境界，也同样不是能默容一切法的意根，意根了别就有不遍之处，那么不遍之处的法，如来藏要如何现起，根据什么现起？如何在意识心中出现？由此可见，只要意识能缘的法，意根必缘，而且意根能缘的法，意识不一定能缘到。</p><p>理论，我们可以不用学很多很多，但是如理思惟观行的智慧必须具备，这是学佛成就的必要资本和条件，否则善财童子必不能一生参学诸大菩萨之后，成为等觉菩萨。那简直是天方夜谭，可是事实却出现了，善财童子为什么能一生修成等觉菩萨，而其他人一生，连佛法的门都摸不着？要想随所学法，如理思惟，然后很快证得，禅定是必须要具备的，这样才能保证闻法即如理思惟，即能证得，即得成就。所以定慧，止观，是学佛的重要而必备的条件，也就是说，戒定慧是学佛成就的三无漏学，是三个主要而重要的必备条件。学唯识，证果断我见最彻底，明心最究竟，之后道业增进最快。</p><p>十、意识所缘的一切法，都不能自己去变现，不管直接还是间接，都是如来藏变现的，意识只不过在中间起到一种显现尘境和促成如来藏变现的作用。意识所缘的法一定需要意根这个中介起作用，一切法没有意根也不会显现出来，意根不缘的法，就没有理由出生意识，意识就不能出生了别法，把法显现和指示出来，经中佛说意法为缘生意识。</p><p>有个特例是说意根缘杯子，出生意识，而意识稍一看，没有看清楚，就错把杯子当成了笔筒，有人就说这个笔筒是意根不缘的，是意识变现出来而单独缘的。我们可以想一想，实际上有笔筒这个法存在吗？没有，笔筒犹如乌龟的毛和兔子的角，乌龟本没有毛，没有的东西，就是空的，还用什么识心来变现呢？如果是用四大种子变现的，就是如来藏变现的，如果是如来藏用四大种子变现出来的，那么乌龟的毛就是实有的法，大家都可以用肉眼看得见，可是连佛也看不见乌龟的毛和兔子的角，那就根本没有乌龟的毛和兔子的角，不是实有的法才看不见。</p><p>既然不是如来藏变现的，不是实有的法，意识更无法变现，祂什么种子也没有，也没有资格去变现什么法，同理，意根和五识也没有任何资格变现任何法。以蛇为绳、把杯子当作笔筒，只是错认而已，病眼望空花而已，谁能变现没有的花？杯弓蛇影，也是如此，没有蛇，不存在蛇，不存在的法谈不到谁出生和变现，错认而已。就像把张三当作李四，本没有李四这个人，谁来变现李四？有什么能力变现李四？用种子变现李四，李四就是实有，如果多出个李四，户口怎么算，落在谁家里？如果眼睛恢复正常了，这个李四是否还会死去变没有了？如果不用种子变现李四，就根本没有李四这个人，病眼望空花而已，还要去辨别李四的真假和年龄、男女性别，有什么意义？</p><p>哪个法上如果没有意根，就没有意识和意识的想入非非，都是意根主导如来藏提供的法，意根必缘。但意识一旦出生后，就必然会起到应有的作用，否则所谓第三能变识就没有意义了。第二能变识负责指挥如来藏变现，第三能变识负责显像和了别，负责思惟分析和处理。能变，不是直接变，实质都是如来藏变。只不过意根和六识能协助变现和显现罢了，能引导如来藏变现罢了。意识的作意，能影响意根的作意，意根的作意，能引导如来藏的作意，因此三者和合，才能出生法。当意识比量思惟时，意根了知以后认可这个比量思惟的法，就会决定变现，如来藏就配合。如来藏不听意识的抉择，只听从意根的抉择。</p><p>十一、人的潜意识下意识等，通常都是指意根，意根主要在整个大脑部位起用，主要在后脑胜义根那里起用，而意识只在后脑上起用，不在前额和前头皮那地方活动。后脑那部位叫胜义根，所有的六尘都集中在那里出现，如来藏把外界的六尘影子都投放在那里，意根肯定能接触到如来藏变起的六尘镜像，意根一定要先接触，接触了之后，生起作意等五遍行心所法，生起思量性，决定是否要去仔细了别，然后如来藏才能出生六识，六识再去接触六尘，生起细致分别作用。</p><p>因为是意根先接触六尘，所以意根有时候不经过六识的识别，就能直接快速地做出一些反应。这就说明是意根先接触法尘，祂也能了别一下法尘的大致情况，只是不能作细致具体的了别。意根接触法尘以后，由如来藏出生意识，意识这时才能对法尘进行细微了别，并且把了别的内容传递给意根，意根就会作决定。因此对一切事情的反应，不仅有六识的反应，还有意根的反应，两者都有。</p><p>如果事情一开始，来不及思惟就作出反应的，那就是意根直接作快速的反应，因为这时还没有生起意识，即使意识生起来之后，也来不及分别，就听从意根的指挥了。意根先和六尘接触，祂先了别一部份，了别个大概，虽然祂了别慧比较低劣，但祂能知事情重大，关系比较重大，就按照自己的习性惯性作出快速反应。而下一刹那意识也会了别到，但是意识来不及思惟分析，也没有自主和决定权，完全是随顺于意根作出了反应，配合意根。事情过后，意识才能仔细思惟分析，才知道刚才做的对与错，才有可能后悔。</p><p>意根刚一接触六尘，祂如果知道了六尘的特殊情况，尤其是在身根方面的情况，意根马上就能作出反应，祂知道重大、不一般和危险性，就会习惯性的作出反应，这种反应通常叫作潜意识和下意识。那时候第一刹那，意识心还没有生出来，就不会有意识心作出反应；第二刹那，意识出生以后，就会完全顺着意根的决定去造作，没有机会思惟分析。等潜意识下意识过去了以后，才轮到意识仔细思惟整个事件。然后再把思惟分析的内容传递给意根，意根再作新的抉择。意根根据意识的思惟，能够知道刚才的反应是对还是不对，然后生起思量，决定弥补一下还是不弥补。意识的判断，意根有时候不认可，但有时候也会承认，下次就能稍微注意。</p><p>十二、专注并不一定是只缘一法</p><p>意识专注，与意识只缘一法，内涵是否是相同的？意识能不能只缘一法？比如赏月时，意识专注的时候心中是否只有月亮，除此之外一无所知？这时候意识心中除了能了别月亮，心中也知是晚上，天是黑的，看见的是天空中的月亮，也知道自己是在房间里还是在野外等等。比如意识专注于参话头，意识心中是否只有话头，除此之外一无所知？不是这样，意识还参与行住坐卧，还有一些工作，还知白天黑夜以及周遭的一切。比如科学家钻研一个项目，意识心中是否只有研究项目，除此之外一无所知？肯定不是了。</p><p>意识专注，相当于朝着有靶的那个方向射箭；只缘一法，相当于把箭准确的对准靶心。意识眼识对准靶心的时候，是否还知道白天黑夜？是否知道自己是躺着还是站着，是否知道在室内还是野外？这些法意识都知道，不糊涂，那么意识就不是只缘一法，只了知一法。只不过专注的时候，极大部分的注意力在当前专注的目标上。意根也可以这样。</p><p>十个人在一起，意识专注打量其中一个人的时候，是否知道旁边还有人？是否知道眼前是光明还是黑暗？是否知道对方身后的背景？如果知道，意识就不可能只缘一法，只了知一个法。意根也是如此，所以意根也能如此专注。</p><p>十三、每当我们惊喜的时候，惊讶的时候，惊恐的时候，震惊的时候，绞尽脑汁没有注意的时候，意识都没办法思惟，没辙了。可是意根心里动得很快，思量性很强大，最后不用依靠意识的分析思惟观察，也想出了应对的办法，躲过一劫，逃离惊险。我们通常说，这个人很机灵，反应很快，观察一下是意识机灵反应快，还是意根机灵反应快，还是两个都机灵反应快？这要根据具体情况而定，马上就反应，来不及思惟的是意根的机灵，能稍微思惟的是意识的机灵，在意识机灵的时候多数情况意根也是机灵的。发呆的时候，意识发呆，意根绝对不发呆，意根没有呆愣不思量的时候，自己多发呆体会一下就知道了。</p></div>"
},{
    "title": "第四章　意识与意根的关联",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　意识与意根的关联</strong></p><p>一、意根触法尘想了别时，第八识就产生意识心来帮助意根分别法尘，所以意根是无色根也是识心，祂有心的所有法，是众生时时处处作主宰的心。众生无论做什么，大大小小的事都由祂作主说了算，前六识对六尘所分别的结果都要报告给祂，祂接收报告后再决定下一步做什么。看一个色尘，是否接着看，由祂决定；听声是否接着听还是听别的，由祂决定；接触一切法，是否再接着接触，还是离开，由祂决定。一切事都由祂决定，祂可以按照前六识的分析报告作决定，也可以不按照前六识的分析报告而按照自己的习气惯性作决定。</p><p>二、意识与意根之间的关系很复杂，有时意根很随顺意识，看起来好像完全是由意识作主似的；有时意识的抉择与意根的习气不一致时，意根难以作出决断，这时候就常常表现为犹豫不决；还有的时候，不管意识如何思惟劝说，意根就是一意孤行；还有的时候，意根作出的决定，意识不愿意服从，总是要冷静的再思考思考，也表现为犹豫不决。当意根一意孤行时，是因为意根的习气惯性太重了，与意识的观点看法严重不一致，不肯接受意识的分析思惟作出的理智决定。这就需要给意根一定的时间来适应和思量考虑，再让祂作抉择，强求不得。如果强求，可能要适得其反，意根反而就要完全按照自己的习气作主，或者作出更严重更违拗的决定。</p><p>如果要劝导他人，就要学会观察他人的心理状态，这个心理状态包括意识心，也包括意根，主要还是意根的心理状态。不能看某些人口上说得如何好，如何坚定的认可，甚至说得天花乱坠，可是他的意根并不同样认为，而且还深深的反感，那我们就不要再与这个人周旋了，再找时机来说服他。也许过一段时间，此人的意根就能慢慢想通，考虑明白，不再坚持自己的意见看法，这时再说服他，就比较容易了。所以给意根一定的时间让祂适应和思量，是绝对有必要的。</p><p>学好佛法，你我他她都能得到很大的受益，佛法是最实用和实在的。懂得意根的体性，找到意根，会观察意根，那么他人的心理看一眼，就可能了解了，即使接触不到本人，听到他的一句话几句话，就能知道他的心理，这样就能知己知彼了。在世俗里当个精神医师和心理医师不容易，要懂得他人的心理，要善于观察他人的表面情绪和内心深处的心理状态，还要会运用善巧方便手段，还要会劝导人，还要表现出真诚和诚恳，也实在是不容易的。</p><p>三、意根与意识的关系如老板与下属</p><p>可以把意根喻为老板，意识喻为下属。老板负责分配和指挥属下工作，属下做的所有工作全部是老板安排的，即使自己想找事作，也得老板同意；属下如果有什么意见和建议，都得经过老板研究批准，不得擅自作主。属下如果不同意老板的安排，可以暂时犹豫不执行，考虑考虑之后再行动，并且可以与老板讨价还价，甚至可以给老板忠告、警告或者暗示，如果老板仍然执迷不悟，那么只好执行命令，不再说二话。</p><p>老板与属下的工作关系是这样的：</p><p>老板依靠如来藏的见分而见得一切法之后，大约匆匆过目一下，了解个大概，因为管理的工作过多，没精力细看细琢磨，觉得比较重要的，属下有能力处理的，就交给属下仔细过目筛选和分析分类。属下把分析研究考虑的结果报告给老板，以待老板决断拿主意，究竟如何处理才好，也可以给老板提供相关的建议。</p><p>如果老板觉得没有太重要和大不了的问题，就全部或者挨个的丢给属下去筛选，属下就得漫无目的的挨个文件夹浏览，老板则一边看管下属的工作，一边再收集信息，看看有什么可感兴趣的内容。如果还是没有什么特别的事情需要特别处理，那么这一天里二位就悠哉游哉、懒懒散散、漫无目的、随缘度日。</p><p>老板把六个属下工作中遇到的问题，大概浏览一遍，然后大问题大处理，小问题小处理；重要的问题先处理；严重的问题立即处理；火烧眉毛、生死攸关的问题没有商量，毫不犹豫瞬间就果断处理；感兴趣的问题着重处理，不感兴趣的问题暂时不处理；属下的建议与老板不谋而合时高兴处理；属下的意见严重违拗自己的心思时强制处理；属下的意见激烈时暂缓处理；如果属下不畏强权、据理力争，可以随顺处理。   </p><p>　一切万法不离如来藏也不离意根而有，意识只是起到一种辅助的作用。意识就像参谋和配角一样，而意根才是主角，有如将军一般，所有的决定权都取决于意根。意识作为参谋要不断的为意根收集六尘情报，分析六尘的详细信息，给予意根应有的适当而适时的合理化建议。</p><p>意根收到意识分析的情报与建议后，自己要作以特有的思考加工和考量，再决定是否要按照意识所说的来处理六尘，或者依意根自己的经验，依自己的习惯，依自己的想法和观念来决定采取下一步行动。这整个过程就是意根的思心所的功能作用。意根如果还是没有办法决定下一步该如何采取行动时，还是会让意识再去收集情报供自己参考，就像将军无法决定时，就让参谋再去为他收集更多更有用的情报，详细汇报上来，以便将军再进行决策。</p><p>由此可见断疑最重要的是断意根的疑，断意识的疑不断意根的疑，意根还是会有所疑。（但是意识的疑，意根有时也会帮助解决。）比如一家之主有问题时，整个家族都要配合着他解决问题，他的问题不解决，整个家族就没有办法正常有序的运作。</p><p>五、从任何一个方面任何一个角度来看，意根就是众生真正为依托的假我，是最主要的我，而且这个我一直都在把五阴身当作我，把六识的功能作用当作我，把第八识的功能作用当作我，认为所有的功德作用都是祂的功德作用，一切法的作用都是祂的作用。</p><p>意识也是一个假我，有明显的见闻觉知作用，众生都是以意识的见闻觉知为主，以意识的行为造作为主，当意识没有见闻觉知时就说我没有见闻觉知了，当意识没有行为造作时，就说我不能说话不能思想了。这个众生就是意根，祂依赖着意识的见闻觉知和行为造作，才能达成自己的目的和意愿，没有意识和意识的行为造作的时候，意根就无法在六尘当中有所作为，五阴身表面的功能作用也就消失，这是意根所不情愿的事情。所以修定让六识少于造作或者不造作，意根一开始是受不了的，意根总是要挣扎着非要知道六尘不可，这时修定就很困难。</p><p>从另一面来说，意识的见闻觉知和行为造作，都是意根支配和主导的结果，两个识一明一暗的互相配合着，几乎所有人都把这一切活动当作是意识单独的活动，丝毫观察不出意根隐秘的作用，埋没了意根的功德，不知道意根是这些活动的主宰，不知道意根才是主人，是众生真正的假我，解决意根的问题就能解决一切问题。</p><p>六、什么是定慧等持</p><p>观里到底有没有思？观里如果没有思，那就观不出什么。观时意识有思，意根更有思，意根一定在思，还思的比较专注一些，没有意识的打扰。只有这时候，才有可能出生智慧，有新发现。表面意识的思是前奏，为了引出后面意根的思，意根的思才有决定性的意义，才能解决重大问题，才能证得什么。</p><p>所以一念不生没有念头的时候，意识虽然没有念了，但是意根最精进，心念动转，很用心，也可能一愣神的功夫，一个主意出来了，一个谋略出来了，这是意根搞出来的。这就是深思，是真正的深思，意识的深思能引申意根的深思。如果没有禅定，或者定力不足，就不能让意根深思，意识深思也很困难，那怎么能有智慧生起呢？意根的深思叫作定慧等持，能出生各种三昧。</p><p>七、问：意根思量的结果或结论，是经过什么途径或方式表达出来的？意根没有语言文字的表达机制，还要通过意识完成表达的过程，这个过程的机制是什么？如何传导这个结论？</p><p>答：意根思量的结果和结论，如果需要意识知道并且处理，意根就会作意，现起思心所，作出一个抉择，要如何处理自己思量出的结果，如来藏了别到，就出生意识，意识触此结果，心中就知道了，再作以判断等等，就消化了意根思量出的结果。如果意根不需要意识知道，不需要意识采取措施处理，意根就不作抉择，意识就不用出生了别。很多时候意识由于智慧不足，仍然无法了知意根思量出的结果是什么。</p><p>意根警觉意识的方式，是要生起思心所，作出一个决定，想要如何处理，意根思量的结果就是一种法尘，然后如来藏了别到意根的决定，就配合意根，出生意识来了知意根的想法决定，于是意识就采取一定的措施办法来完成意根的决定和意愿。</p><p>比如身边有鬼神干扰，意识感觉不舒服，想来想去也不知道是怎么回事。可是意根知道，祂要想办法通知意识，让意识躲避或者处理一下。于是意根就生起思心所，作个决定，意根心里有个没有语言和形象的鬼神的意思，是一种法尘，如来藏在此法尘处出生意识，意识就会感觉到有鬼神，然后就会想办法处理此事。或者是念经回向，或者是念咒驱赶，或者是搬走躲开。意根警觉意识知道的过程大致如此，如果意根能自己处理的，或者轻微不重要的事情，不需要意识处理的，就不会作出决定，如来藏就不会出生意识了别意根的心思。</p><p>八、断疑生信，断疑也要让意根断，生信也要让意根生信，只让意识断疑和生信力度还不够，必须影响和带动意根也断疑生信才行。起初是意识的信，意识的信是迷信、仰信、崇信、不稳定的信，不是正信；正信、深信就是意根的信，这种信根深蒂固，坚定不移。意根如果没有信，就不能主动想去修学佛法。意识即使再信，意根要起疑的话意识都没有办法，只能随从意根的想法。意识只能当意根的参谋，不能代表意根将军作决定。而如来藏与意根的关系就像父子的关系一样，意根这个儿子想要作什么，如来藏只要有财力物力和人力，都会随顺满足于祂，所以还是要熏染转变意根才是正道。</p><p>九、催眠疗法，是被催眠者通过引导深入到潜意识，此时被催眠者潜意识中防御机制被很大程度的卸除了，引导的疗愈法可以轻松地深入到潜意识层面进行疗愈。而清醒状态下，由于防御机制的有效保护作用，难以深入。</p><p>　　这段意思是说，在清醒状态下意识心表现得非常活跃，能依意根第七识的我执性，对自我进行计划、打算、筹谋、计较利害得失等等，能有效地保护所谓的自我，不能让意根的憨直性、无筹谋性发挥作用，意根执我就有强大的工具。意识微弱时，意根就失去了执我的强大工具，祂就表现为憨直性、率性、幼稚性、原始性、可引导性。</p><p>在催眠时，意识的思惟和分析活动被压抑住了，不能思惟、分析、判断、设计和筹谋，没有了防御机制，因此就不能提交给意根思惟分析报告，不能引导和控制意根，不能给意根当参谋，意根的自我防护能力就没有了，也不能指挥意识撒谎以维护自己的利益，事实是怎样，意识就说是怎样。同时意根也能受外界因素的诱导，遇善则善，遇恶则恶，随着境界就流转了。这时完全可以用外力代替意识引导意根，让意根随着外力的启发和引导而得到改变，那么自我的潜能就能发挥出来，心灵得到激发，精神方面的疾病就能痊愈，心理就能健康发展。</p><p>防御机制是意根通过意识心的筹谋、善巧、分析、算计等等功能作用，采取一定的措施手段保护自己。而意根自己不能思惟分析和筹划需要采取什么手段，必须要依赖意识的分析思惟，通过意识的出谋划策，才能决定如何保护自己，然后再指挥六识保护自己。</p><p>意根念念都想自我保护，但是没有意识的帮助，祂也无能为力；祂没有机制，因为智慧低劣，不能思惟打算，不能算计。没有意识的邪教导，意根就表现为非常憨直，不会撒谎，不会骗人，没有计谋，没有算计，不能进行所谓的自我保护。意识的自我防御不离意根的我执，防御计划还需要意根审批才能通过，之后才能具体操作执行。如果意根没有意识的引导和教导，意根自己是无法防御什么的，祂没法算计，没法筹谋，没法想坏点子，没法转弯抹角的掩饰自己，就会完全按照惯性行事，表现为憨直性，傻傻的。</p><p>催眠意识进入潜意识以后，意根的知性与前世的联系就突出出来了，意根有可能把过去世的事情浮现出来。因为意根连接过去世无量劫，祂从来没有灭过，祂与过去世的业种联系比意识密切得太多了，只是不能表达出来，意识就不能了解这些事，我们就不知道，这就是隔阴之谜。催眠就能显现出意识心自己不知道的过去世的事情，这是意根揭示出来的。意根那里有极多的秘密，意识一般了别不到，而意根又没有名言，自己不能表达出来，因此意识就了别不了。</p><p>十、西方极乐世界，我们现量观察不到，意识通过学习佛经，相信有极乐世界，同时不断熏习意根，灌输给意根极乐世界的理念，有的人意根相信有极乐世界，有的人意根不相信有极乐世界。相信与不相信，其修行精进程度截然不同，结果也不同。</p><p>地狱，是我们现量观察不到的，意识通过修习佛的开示，学习佛经，熏习意根，多数人的意根并不相信有地狱，其身口意行为没有约束，往往抱着侥幸心理，以为造大恶业也不会有什么事。所以有一些弘法度众的所谓菩萨平时可以经常为众生宣讲因果，但其心行仍然与地狱相应，并不惧怕地狱果报，那就是意识相信有地狱，意根不相信，仍然会主导六识造作地狱业。</p><p>但是并非所有人的意根都不真信有地狱，这些人能够在一切时中约束自己的心行。而断除烦恼的人，就不用约束自己，心行自然清净，即使在被人百般欺辱的情况下，仍然忍忍不发。因此说，对于意识有理有据的证据充分的逻辑思惟推理，意根是能够相信的，相信以后其心行就能转变一些。</p><p>十一、心里总是拿不定主意和矛盾重重是什么原因</p><p>心里出现矛盾或者心里拿不定主意，是六识提供的分析报告，意根没有思量清楚，暂时没办法做抉择。一是可能六识的分析不够充分，意根一直在等六识相续的了别和意识的分析，有了确凿的信息才能做决定；二是六识分别认知的事理与意根固有的习性不太一致，因此意根不知道如何才好，正在思量着究竟如何去做才比较合适。</p><p>有时候意根决定要做一件事，可是意识分析这样做不对，可能要有不好的结果，就把分析的内容交给意根，意根就开始思量究竟怎样做才好，怎样做对自己最有利。这时意识就不断地把分析判断的内容和结果报告给意根，不断地提供信息。当意根决定按照原来的意愿行动时，意识心就有可能再次提醒意根，这样做有不好的结果。意根又要重新思量考虑，有可能改变主意，有可能不改变。要看是意根的惯性力量强，还是意识心的说服力大，两种力量在交锋的时候，就称作拿不定主意，内心很是矛盾。</p><p>十二、记忆回忆这些事用八识的理论如何解释</p><p>七个识里，只有意识能够回忆，回忆时用语言和声音表达，或者是心中默想默念，其祂几个识都没有这些功能作用，第八识更不会去回忆和记忆什么。而意识之所以能够回忆，是因为意根和意识想要知道过去往事的细节，让那些事情在心里再现出来。心里出现的这些事情属于法尘。由于意根想知道事情的细节，就会有念想，触法尘之后，思心所决定了知，如来藏就会不断的输送出业种，把整个事情再现出来，并且在此法尘上出生独头意识，去仔细分辨整个事情。</p><p>意根一直在缘着触着这些法尘，才能保证意识的存在和不断的了别，不断的知和不断的表达出来，不断的有感触感慨和各种观念的出生。因为是意根想要了别往事细节，或者是由意识驱动意根有这个想法，并且意根一直缘着往事的法尘，才能有意识的出生，有回忆的心理活动，所以意根有记持往事的功能作用，加之如来藏配合，才能促使意识回忆。第八识没有记忆记持的功能，五识有微弱的记持功能，意识和意根都有记忆记持的功能，但只有意识才能回忆。</p><p>记忆是对经历的事件的攀缘、执著和了知性，回忆是对过去了的事情的再现，二者是不同的功能作用，需要识心是连续不断灭的，如果断灭了，就不能回忆，所记忆的就没有了，如今世的意识就没有对前世的记忆和回忆。意识的记忆回忆与第八识的记录功能是不同的，我们身口意行造作的当下，第八识就记载和收存这些行为的种子，通过意根来收存。收存之后，如果意根认为非常重要的，心里就攀缘不断，这样法尘就不断，意识心就得总在记忆回想这些事情，念念不忘，那么记忆就牢。如果意根认为不重要的，就很少去攀缘，意识也就不会想起这些事情，暂时就忘却了。</p><p>意识的回忆、回想是通过意根，从第八识里输出那些事情的种子，意根如果不攀缘这些法尘种子，第八识就不会输出。意根与法尘相对，第八识就产生意识，来了别这些法尘，意识就回忆起了这些事情，心里就有了念想，有了忆念。意根认为重要的事情，意识心就会记着，除非是胜义根有障碍，才会没有记忆和回忆。</p><p>十三、一切身口意行作为种子刹那刹那都存入如来藏里，当意根需要，种子现行的缘熟时，如来藏就输出种子，现行相应的法，意识才能了别到，这就是记忆和回忆。越重要的事情，意根越需要，缘越容易成熟，意识越容易回忆出来。意根可以惦念某些事，但不能具体回忆某些事，因为回忆里有细节，识心能比较细致的了别才行，意根不能作细致了别，只能粗略了别。意根了别后，如果觉得重要，就会执著和攀缘，心里就要惦念着。</p><p>凡是意识了别的内容，都是意根指挥调控的，凡是意识记忆的内容，也是意根看重认为重要的，凡是意识回忆的内容，也是意根需要和攀缘的，意识所有的一切都是意根给与的。但是意根不能回忆，因为回忆里有具体细节，意根无法了别得太具体细致，只能有个粗略的知，但是这个知是相当重要的。</p><p>意识参话头，意根受熏以后，觉得这事非常重要，于是就心心念念都是话头，即使在半夜里睡觉也要念着话头，于是就做梦，意识在梦里就参话头。意识平常所思惟的法，意根受熏以后如果认为重要，半夜三更也要思惟，梦里也要思惟，心里就不肯放下。如果意根不念着这些法，意识不可能半夜参话头和思惟法义。</p><p>十四、意根都有注重和不注重的事情，越注重就越执著，越执著，意识意根记忆得就越牢固。意根越不执著，就越不在意，记忆就轻微，或者不记忆，意识转眼就会忘记了，或许过后也很难回忆得起来。所以如果有人说，我忘了对某人的承诺，忘了那件事，或者说我没有时间做那件事，那就是说明那件事情对于他的意根暂时还不重要，他还有其它重要的事情在惦念着。意根总是攀缘和惦记自己认为最重要的事情，按照自己认为最值得做的事情来做。那么有些事情淡忘了，有些事情记忆犹新，就说明了事情对于意根的重要程度了。</p><p>十五、意根的习惯性执著性</p><p>有人说意根的决定都来自于意识的了别，其实很多情况下，意识的了别和决定对意根来说不算什么，意根不太听取意识的看法和判断。如果意根听取意识的看法、知见和判断，那么意识真真实实的认为玻璃桥是安全的，可以放心行走，意根为什么不听话而决定迈开脚步呢？意识告诉意根多布施积福，意根为什么不决定把自己的钱拿出去布施？</p><p>在意根生气时，意识暗示意根不要生气，要稳住，一定要压住火气，不要发作，可是意根还是要气得浑身发抖、脸色铁青、脸红脖子粗、杏眼圆睁，甚至破口大骂，大打出手，结果把事情搞砸了，这是为什么？意识暗示意根消消火吧，可是意根还是气得呼呼直喘，肺都要气炸了。这时意根为什么不听话，不服从意识的规劝？</p><p>所谓的身不由已，就是说身体是由意根控制的，不是由意识说了算，不由意识管控。关键的时候，意根的习性惯性和执著性起着决定性的作用，意识的思惟作用力，是那么的微不足道，简直是力不从心和无可奈何。身不由己的己，是指意识，身体不由意识说了算。不由自主，也是不由意识说了算，意识作不了自己的主，要由意根作主。</p><p>十六、意识的能动性在极小的范围内，是不由自主的，不可以说意识是能动性的、自主的、非完全安排好的、有自由意志的。意识的意志只有符合意根的意志，或者是说服了意根，才能得到发挥，否则只能由意根作主指挥和安排。当意根想要了别和造作时，就要用意识工具，不想了别造作，意识就不现前，把工具放一边不用。能动性在意根这里，但是意识可以提要求说服意根，之后意根就可能让意识放纵一下。</p><p>十七、识心对色身的影响</p><p>身心能互相依赖，互相影响，识心的动转对色身的影响很大，尤其是善恶心所法的运行，烦恼和习气的运行，对色身的影响是非常大的。我们可以仔细观察一下，当六识心动的时候，身根是不是跟着一起动而起变化；六识心动时，眼根耳根鼻根舌根是否一起动而发生变化；意根动时脑神经是否发生变化，全身是否也跟着一起发生变化。</p><p>当七识动时，尤其是意根动时，有脑电波产生，先是在大脑内部波动，后是头皮有波动，再后来是身体某部位有反应，同时伴随着六识心的动，身口意行就出现了。为什么有脑电波的产生呢？因为意根在大脑胜义根处活动的时候，心识一动转就能触及到大脑神经组织，（但是意根不能直接触及大脑物质色法，里面还有事情，暂且不说。）神经组织就把受到的触动传导到整个头部和头皮，就像电流传导似的，就像有波动似的，头部和头皮就感觉好像有电流通过，麻酥酥的感觉。其中大脑里的细胞也受到触动，引起四大的变化，像释放生物电一样，有一种能量传导，头皮和大脑就有一种麻酥酥的感觉。</p><p>如果意根的心行再继续变化，脑电波脑神经就向全身传导，身体就要出现相应的震动和变化，这都是意根的心行引发出来的变化。比如当内心生贪时，身体里水大就出现变化，各种液体就涌现出来，如嘴馋时会流口水，贪爱时流眼泪等等；生嗔时，怒目而视、怒发冲冠、脸红脖子粗、脸颊发热、杏眼圆睁、浑身发抖，六识同时起用，身口业同时现行出来，身根就有变化，六识也有相应觉受出现。</p><p>意根在胜义根处和法尘相接触，了别了法尘时，产生心识活动，触及到大脑皮层，就能引发脑电波，脑电波带有一种能量，或者产生一种热量，这都属于正常的现象。当我们心里感觉不好意思的时候，色身上就有脸发红、脸颊发热等等的反应；着急紧张时，就有额头流汗、内心感觉燥热、心急火燎、手心冒汗、脚底发凉等等的反应；当情绪激动时，就有热泪盈眶、眼睛灼热、头中嗡嗡作响等等反应。这些反应都是因为意根的识心活动牵动了大脑神经，从而带动了全身的活动。</p><p>意识的各种心行也能影响到色身，让色身出现变化。其实色身的活动都是意根指挥，六识造作出来的，所以说是身心互相依赖、互相影响的。意根也是心，祂既是根也是心，触法尘的时候，就能影响到大脑神经组织的活动，并且影响和控制全身活动；心念不同，情绪不同，六识的身心活动就不同。</p><p>意根在思量的时候，肯定也能触及到胜义根，有脑电波产生，包括意识心思惟佛法的时候，也有脑电波的波动，因为意识思惟佛法的时候，是受意根的主导和指挥的，所以我们的心识活动，会让色身发生相应变化。比如宁神助思、紧皱眉头、若有所思、手拄下颚、手敲头部、牙咬手指等等身行的造作。其中变化最大的，可能就是脑电波，脑电波有一种能量，能使得头胀、脸红、脸发胀发紫发热，这就说明内心识心在活动，识心在思惟思量，内心有些想法和看法了。识心一动，色身就跟着动，身心相倚，互相依赖，互相影响。身心互相依赖当然都通过如来藏在中间起着联系作用。</p><p>意根对身心的影响非同小可，无论大小事，刹那刹那都在影响着身体的细微变化，色身的变化都是意根影响和牵动的，意根能影响身体的健康状况。如果降伏意根，心性调柔，少于烦恼，身体健康就能得到改善，疾病就能减少和消除，意根的作用举足轻重，不可忽视。掌握好意根，修行非常快捷。在八个识当中，如来藏能变现一切法，当然如来藏是第一重要的，意根能驱动一切法的出生，也能促使一切法的灭亡，当然祂也很重要，对一切法能起决定作用；如来藏只是收藏种子和变现出一切法，是服从顺从意根的。</p><p>十八、什么叫作变态现原形</p><p>变态或者现原形这种情况，是指意识由于某种原因，比如昏昧不清醒等等，调控不了意根，意根就按照自己本来的习气惯性行事，那是意根的本来面目。清醒的时候，意识有理智，能够思惟分析如何应对尘境，意根依之，就能得到指导和矫正，习气能得到一些约束。意识一旦不清醒，就不能正确的思惟分析，意根得不到正确知见的指导，就按照自己的习气行事，叫作现原形。</p><p>每个人的原形都不一样，因为意根的修为不同，烦恼不同，习气和惯性也不同。比如男女在一起，已经有初禅定断欲的人，无论怎样打交道都没有关系，不会动什么心念，意根已经得到降伏的缘故，就如坐怀不乱的那种。如果不是这样，没有禅定，没有断除烦恼，男女到一起，就不能保证不生心动念。</p><p>三果人意根的烦恼原形发生改变，贪爱和嗔恚烦恼已经没有了，无论在什么情况下，也不能有贪爱和嗔恚烦恼的现行，但是习气还免不了。初地菩萨才有能力开始断烦恼习气，在这之前都是压伏烦恼和习气，断一分少一分，种子就清净一分，其意根的原形就比三果四果人要清净。这个时候，意识心总能理智的调控意根，很多时候意根也无需让意识心调控，自己已经得到降伏，能自觉调控自己，心意已经柔软下来，这是断除烦恼，转识成智的功德受用。</p><p>当意识心有理智时，意根就不能轻易变态现原形，因为意识能思惟督导意根，意根就会随顺意识，受意识的约束，知道自己应该如何如法得体的应对周遭的一切，不起烦恼，有修养有德行，这样意识就调控了意根，使得言谈举止都得体而不失态。</p><p>十九、意根的恶习如何才能改变</p><p>意根前世喝过酒，今世见酒，就不要命。为什么见酒不要命？常喝酒，就会成为了习惯，上瘾了，就会总想喝酒。意识劝说喝酒对身体不好，可是没有用，意根照样坚持喝。喝出事来以后，意识表示再也不喝了。可是意根贪心不断，没记性，遇见酒，还是决定照喝不误，管你谁和谁，管你后悔不后悔，管你醉不醉，喝完再说。为了这事，意识与意根经常打架，关键时候，还是意根占上风，每次都照喝不误。直到最后，有一个重大事件发生，让意根刻骨铭心，毅然决然的决定：以后再也不喝酒了，并且还发毒誓，这才把酒戒掉了。哎！太不容易了！经历了多大的磨难，付出了多大的代价，才把酒戒掉。不见棺材不落泪，不撞南墙不回头，不到黄河不死心，说的就是意根。</p><p>戒酒时，有一种坚定不疑的意志力，是指意识还是意根？如果是指意识，意识的所有意见和看法都仅仅是一个建议，意根可听可不听。那么意识就不能有坚定不移的意志力，因为意识没有力量，不能作最终最后的决定，也没有行动力，不能作身口意行的主。所以意志力，既然意志有了力量，就要想去实施，那就是意根的意志，意根的志向，意根的抉择，意根的主动力量。意根受到挫折，下定决心一定要戒酒，这才有了坚定不移的意志力，终于把酒戒掉了。意识连一个手指头都动不了，祂要想有力量，必须动用意根，想办法哄意根听自己的话，按照自己的决定而决定。所以最后还是意根的决定力量改变了一切，因为意根能作主，这个谁也没有办法。</p><p>二十、意根了别到第八识所现起的一切法之后，祂会思量权衡如何处理，决定之后，六识就要按照意根的决定去造作。所以意根能统摄一切法，默容一切法。而意识并不能了别所有法，因此意根了别的内容要永远多于意识，比意识深广得多。意根的体性比意识的体性深细而重要，成佛与否，全在于意根。意根本身的运作不能说简单和复杂，因为意根对具体的六尘了别慧差，意根对自己触法尘了别法尘的运作没有很强的反观力，当觉得法尘很重要时，自己了别不清楚，才唤起意识出来了别。</p><p>比如吃饭这件事，第八识把胃空了这种状况呈现出来，意根了别到，让意识具体分辨是什么情况，意识触胃部的法尘，了别到胃空了，就感觉饿，于是意根决定吃饭。感觉饿的是意识，也许是意识决定吃饭，意根同意，也许是意根先决定吃饭，意识服从，但无论怎样，意根的思心所不决定吃饭，五阴就不能吃饭。</p><p>凡事只要身口意出现了，不管什么事，都是意根点赞同意的。意根的同意，有主动，也有被动，不管主动还是被动，都是意根同意以后思心所作的决定。意识的想法，意根也许同意，也许不同意，如果不同意，就是矛盾。意根的决定，意识也许同意，也许不同意，不管意识同意与否，都要照办无误。</p><p>二十一、很多法都是如来藏围绕着意根的意志和想法而变造出来的。意根想什么认为什么，如来藏就随顺变造什么。因为如来藏里有四大种子，能够输出四大种子以及吸取物质当中的四大种子再变造出新的四大物质色法，如来藏里还有识种子，输送出来形成六识，负责完成意根的指令。而意根没有任何种子，祂不能变造色法和心法，只管有想法就可以了。</p><p>有个试验，在被催眠时，意识被压制住了，分别力微弱，不能分别是白水和糖水，当意根被告知是糖水，就错认为是糖水，其实是白水，因为物质细法意根分别不清楚。当意根非常深信喝的是糖水而不是白水时，如来藏随顺意根，就把白水的四大换成糖水的四大，吸收到身体里，身体血液里就含有糖的成分了。</p><p>意根因为不辫东西南北，容易受骗，必须依靠意识细分别，从而引导和制约意根，意根才能有正知见。所以学佛修行完全依靠意识的如理思惟，来引导意根证法和得解脱。</p><p>二十二、我们有时面对熟悉的人和事，突然间就想不起来了，意识在心里回忆又回忆，搜索又搜索，就是想不起来。这时，需要的法尘内容就是不现前，那是因为意根一时也缘不到那个法尘和业种，意识就没法了别到。过后，意根没有放弃，继续暗中搜索攀缘，指不定什么时候就把业种攀缘出来了。意识就会不经意间想起来，原来是某人某事，在某时遇见和发生。自己（意识）就觉得是突然间想起来的，其实是意根一直在攀缘搜索，没有放弃。那么我们利用此点，就可以参禅参一个法义，修法只要能够深入到意根，那么意根就会暗中深深地攀缘悬挂着，这样修行就深入内心了。有朝一日，因缘成熟，意识心就会证悟，或者明白所思惟的法理。因此一切法只要深入到意根，就会解决问题。</p><p>意根的习性是无始劫就一直带着的，什么事情重要和不重要，自己自会明了，祂时时刻刻都要维护自我五阴利益，哪个对自己有用，祂能分出轻重缓急来。懂得佛法道理和不懂得佛法道理的意根，其智慧性不同，认知也不同，祂所做出的决定也就有所不同。祂有极多的神奇功能作用，有待于我们不断地去探讨，那就需要有高深的佛法智慧，道种智越深就越容易了知更多的意根的功能体性。</p><p>二十三、八个识中，第八识是董事长，第七识是总裁，意识是经理，五识是职员。意根对一切法作主宰，祂不让意识忙于三界的事，意识就得休息；意根不想往生到极乐世界，意识就去不成，意识无论怎么念佛也没有用，况且意根不决定念佛，意识也念不出来。这是意根与意识的关系，很深密复杂。</p><p>二十四、问：色身的运转是由前六识主导的，比如吃饭、做运动等主动的行为；有一些是意根主导的，比如来不及思维的应急反应；还有一些是第八识主导的，如色身的衰老、病变等。不知这样理解对不对？</p><p>答：色身的运转和活动，表面都是前六识的活动，但都是由意根指挥和主导，由意根控制的，六识的任何活动都是受意根的调控和指挥，由意根抉择，不能自己擅自作主。</p><p>一切法都是由意根和业力做主宰和主导的，无论大小巨细，意识不能做主导，只能辅助意根做主导，最终作主拿主意的还是意根。意识虽然有自身的抉择和决定，但是要听从意根的审批，如果意根不同意，意识作什么决定也没有用，都不能实现。五阴的活动由意根主导，六识服从，并且与意根和合运作，意根根据六识的不断了别，才能不断的起主导作用，没有六识的辅助了别，意根就无法继续主导下去。而各种应急反应都是意根单独主导，六识只能配合，无法起参谋和辅助作用。</p><p>色身的衰老、病变等，表面上好像是第八识主导的，但是第八识并没有任何主动性，祂是一种无为的心性，不会主导什么法的出生。祂之所以能变现出一切法，都是被动的，是被业种和业力所牵，随业力而动，也被意根所左右，随意根而转，没有主动性。</p><p>二十五、意根和意识的分工合作，可以用具体事例来说明。比如睡觉时，被子被踢掉了，身体感觉有些凉，意根了别到这个情况，想盖上被子，自己又无法处理，如来藏了别意根的思心所，于是就给意根变现出梦境，以解决此事，意识就梦见自己处于寒凉的环境中，感觉很凉想盖被子，意根于是就决定把被子盖上。这时意根分不清梦里和梦外，把梦里的境界当作梦外，就作出了决定，意识也不知道是梦里还是梦外，把梦境当作真实，就顺从意根的决定把被子盖上。但是能盖被子的意识已经不是独头意识了，而是五俱意识，那就还有身识现起，一起把被子盖上。意根分不清梦里梦外是无慧，能想办法处理却是慧，能了别身体出现特殊的状况，也是意根的了别慧，具体情况的分析和处理属于意识的职责，二者就是这样分工合作的。</p><p>二十六、意根与意识的关系犹如人与显微镜放大镜的关系。由于人的视觉有限，不能辨别非常细微的物质色法，就利用一下精密仪器来协助自己观察。人与精密仪器同步观察，精密仪器观察到什么程度，人就了别到什么程度，精密仪器观察出多少，人就了别了多少，同时人根据仪器的了别，参考仪器反应出来的内容，对观察对象进行思考判断，一步步的指挥仪器观察的方向角度和处所，最后得出一个总结论，做出一个总的抉择。</p><p>意根比如人，意识比如被人所利用和支配的仪器。太精细的东西意根只能通过意识的观察分析思惟判断，意根依据意识再进行自己的思索和判断，得出结论再做出抉择，六识再照办。</p><p>如果所接触的物质色法人自己就能了别，也就没有必要常用精密仪器了，因为这比较很麻烦。意根如果能对所接触的法了别个大概，不需要太微细的了别，也就不用意识来配合观察了别，那么意识就不知道意根到底了别了什么，心行如何，如何处理的。除非意识有妙观察智，才能知道意根的心行。</p><p>由此可知，意识的一举一动不能脱离意根的掌控，除非意识能骗得了意根，能说服意根，让意根同意自己的心行愿望和想法。就像一个机器人想要脱离人的掌控，那是非常不容易的，除非出现意外情况，人类没有设计好程序，或者程序紊乱。如果能分清意根与意识的内在关系，各自的功能作用，就能很好的把握自己的修行，增长自己的智慧，促进道业的增进。</p><p>二十七、有的人意识常常口中谈论钱财是身外物，表示并不在意钱财，可是真到要布施钱财帮助他人时，从来不肯布施一文钱。这是因为具体决定要布施的是意根，意识不能自主，意根如果很悭吝，就不愿意布施钱财，所以很多人意识说是说，意根做是做。意根悭贪，就不会有实际行动，对于悭贪的人说的话，我们最好不要当真就行了。</p><p>二十八、问：意根做决定的时候，意识到底扮演着一个什么样的角色？意根可以通过意识来做决定，那么意识的分量到底有多重？什么情况下，意识足够扭转意根的决定？又是什么情况下，意根依旧我行我素呢？意识能改变意根选择的关键点又在何处？</p><p>答：意识与意根的关系如下：意识是意根的助手，帮助意根了别和分析思惟，是意根的参谋，为意根的抉择出谋划策。意识是意根的督导，能牵引和控制意根。意识是意根的奴才，对意根俯首帖耳，即使心里不高兴，表面也得服从。意识是意根的教唆犯，经常唆使意根做不该做的事情，意识是意根的导师，有时要如理思惟，引导意根走出习气的误区和泥潭。</p><p>只要不是意根特别习惯熟悉的事情，意根都愿意求助于意识的帮助，听取一下意识的意见和看法；只要不涉及到特别紧急危急的事情，意根都会让意识出谋划策；只要不碰触意根的底线，不惹恼激怒意根，意根都会允许意识发表意见；只要不是意根特别感兴趣的事情，特别执着和在意的人事，不是意根特别贪着和厌恶的人事，意根就愿意让意识多作思惟分析，把结果提交给意根作参考。在相反的情况下，意根就无法听取意识的看法，就以自己的判断为准，自己要单独并且快速的做决定。</p><p>当意根非常贪爱和非常嗔恨的时候，就不会听取意识的建议，而一意孤行；当意识说不清道不明，讲不清道理的时候，意根就会我行我素；当意识给出的理由不充分的时候，意根也会我行我素，不改变丝毫。当意识能够现量观察到事情的利弊得失时，能够证据充分的讲明道理的时候，能够把确凿的事实呈现给意根的时候，意根就会改变自己的心意和抉择。意识改变意根的关键在于能够揭示出事实真相和掌握确凿的证据，以及准确分析出利害得失，意根只能乖乖顺从，从而扭转自己的习气。</p><p>意识的分量当然很重，意识能通过如理思惟，或者是利益诱惑，牵着意根的牛鼻子，把意根拉上正路，让意根获得智慧，断除烦恼和习气，破除所有的无明，究竟转识成智。意识要想扭转意根，就要常常熏习正确的佛法，如理思惟作意，思惟细致入微，最好能现量观察一切法，证据确凿，这样就有能力引导意根，让意根随顺意识的引导和理性思惟，以及现量观察。意识要想扭转意根的决定，就要思惟此决定对自身的危害性，思惟越透彻，越接近事实，越能影响意根，改变意根。如果意识思惟不清楚，不透彻，事实不明，没有证据证明，不是现量，意根就不能被说服，依然我行我素。</p><p>二十九、崇拜的心理以及各种心理，都由意识表现出来，由六识共同造作出来。意根的一切想法，想要表现出来想要实现，必须有可利用的工具和媒介，没有媒介，意根无可奈何。</p><p>意根利用意识五识身根这样的媒介，能造作一切法，表达一切情绪、心境、想法、打算、意愿等等，没有这些媒介，祂就无所作为。实际上，意根是尽可能的利用了第八识，祂自己都不知道，第八识更是不知道被利用了，知道也不会在意，心大。六七识通过学佛修行，如果心像第八识一样的大，那修就到头了，不用再修行了。如果意识表达不清楚不明白，意根没有耐心，就会选择不说话。</p><p>三十、业行主要是意根的心行</p><p>没有意识的情况下造作的法，是不是业行，有没有果报？仍然属于业行，有果报，而且是依业而有的行，更属于业行。比如意根与如来藏一起投胎，没有意识参与，但这个业行大得不得了，是所有业行当中最大最关键的一种，是决定性的一种，决定着众生的生死趣向问题，是十二因缘生死链条之一。意根因为有无明，必产生生死业行，也必去投胎，顺应生死。如果说意根与如来藏一起去投胎，不属于业行，那么三界世间就没有任何业行了。</p><p>意根与如来藏一起到极乐世界造莲花，没有意识的参与，这个业行也非常大，是绝对的善业行，决定着众生死后趣向极乐国土，远离五浊恶世的生死系缚，将来能在阿弥陀佛的摄受之下明心见性，然后飞往十方世界去广利有情。</p><p>意根与如来藏一起干扰他人，一起去加持他人，一起到别人的梦里，一起去警觉他人，以及在没有意识时翻身压死了新生儿等等，这些全部都是业行，有善有恶，有不善不恶，都有果报。只要有心有行，都是业，都有果报。半夜睡着了没有意识，翻身压死了新生儿，这是无意的，是无记业，也有果报。当时的果报就是失去孩子很痛苦，后世的果报也可能就会被无意的压死。这是苦果，不是不苦不乐的果报，无记业感召的不一定是不苦不乐的果报。无意就是没有意识，但有意根，意根也是不故意的，没有心意，但只要是有行，就有业有果报。</p><p>业，主要是意根的业，与意根相应，是意根心行造作的过程。意根心行的造作，有时需要六识配合，有时六识配合不了，就没有六识参与造作，但都是业行，都有果报。意根若不想造业，就没有业行出现，六识也不会出生造业。因此说意根是造业的主人，是果报主，善恶业都是如此。</p><p>三十一、意根和意识哪个是受报主</p><p>有人说意根不觉得苦乐，就不是受报主，意根不受报。其实意根才是受报主，六识只不过是意根受报的工具和代理人。因为没有六识的时候，众生也处于果报之中，不管六识是否存在，只要众生存在，本身就是一种果报，而且色身就是果报身，是意根把色身当作我，所以意根才有果报身，报就报在意根上，让意根受报。</p><p>首先入胎、住胎、出胎这件事，就是意根的果报业报，投胎入胎就是意根的事，有什么样的色身和生存环境是意根最在意的事，所以果报就是意根最在意的事。住胎和出胎，以及一辈子的生活环境条件，也是意根最在意的事，一辈子是享福还是受苦是意根最在意的事，所以意根是受报主。其次死亡以及死后的去向问题更是意根关注的事情，临死时，意根挣扎着不想死亡，即使病得痛苦不堪也不决定离开色身，不肯咽气丢下身体，不愿意离开家亲眷属；即使成为植物人了，也不愿意离去换个色身，仍然要贪着微弱的五阴活动，继续承受痛苦的果报。</p><p>意根以五阴身的苦为自己的苦，以六识的苦为自己的苦，以五阴身和六识的乐为自己的乐，以五阴身和六识的受为自己的受。但是没有六识的时候，意根仍然要承受一切苦乐受和一切果报，譬如无想定和无想天的乐受，是意根单独受，灭尽定的乐受是意根单独受，没有意识意识就不受。入胎和住胎的苦受，意根要单独受，没有意识去受，死亡和昏迷之时的苦受意根要单独受，没有意识意识就不受。睡着时不管睡得安稳不安稳、舒服不舒服，都是意根单独受，乃至于睡着时出现任何事故如被火烧死等等，都是意根单独承受，没有意识意识就不受。</p><p>即使在有意识的时候，意识的任何受，都与意根息息相关，意识所承受的一切都等于意根承受一样，意根很在意意识的觉受。因为意识就是意根的一个我，是意根所拥有的，是意根的助手和道具，报意识就等于报意根一样，意根绝不愿意意识受苦报，微苦也不愿意。譬如父母是一家之主，孩子所遭遇的一切苦乐，父母也随之苦乐，他人来酬答和报复父母，也会通过酬答和报复孩子的形式来间接的回报父母，报孩子就等于报父母，孩子的荣辱和死活与父母息息相关。</p><p>意根是意识出生的根，意识由意根为缘而出生，意根犹如意识的父母，意识受报就等于意根受报，因此五阴受苦，意根就要躲避，五阴受乐，意根就贪爱不舍。总而言之，意根是受报主，是果报的真正主人。</p><p>三十二、意根是意识的根</p><p>根，是依靠依止之义，比如大树依树根而生。孩子依父亲而生，但直接由母亲出生。眼识依眼根而生，六识依六根而生，意识依意根而有。但是六识由如来藏直接出生，六根仅仅是六识出生的根本缘。</p><p>一切事情都要寻根究底，找到根，解决根源，才能彻底解决问题。我们要想解决无始劫以来的生死轮回问题，解决无明问题，解决染污业种问题，都要寻根逐源，不能只在枝叶上用心，剪掉枝叶，还要出生。要想枝叶不生，剪掉根就能彻底解决问题。意根就是意识的根，意根决定着意识，决定着六识的走向，解决意根的问题，才能解决六识的问题。虽然解决意根的问题，需要意识做先行和辅助，可最终还是要落实在意根上。</p><p>无数人都弄不清楚意根与意识的关系，都以为意识是究竟的法，都在意识上做文章。可是解决了意识的问题，意根没有解决，意根还会决定着意识的修为和造作，荒草又长出来了，还等于是没有解决问题。</p><p>三十三、问：我有很重的怀疑习气，这种怀疑的念头力量非常大。在内心没有力量思维的时候，就告诉自己观这个念头，什么也不做，就让意根自己慢慢思量，总会有个结果。这是怎么回事？</p><p>答：意识能反观自己的思想念头，观出来之后，对思想念头有了一定程度的了知，并且能分析和思惟自己疑心的对错，至于说最后是什么结果，如何对待和处理，那是意根的事。意识就会把自己了别的情况传递给意根，不再干扰意根的思考，意根就会慢慢的静静的思量，最后就能把自己的疑心考虑明白，知道疑念的对错，知道如何处理，就把疑心除去了。</p><p>三十四、为什么有时候意识的力量大于意根</p><p>意识因为思惟分析能力强，智慧比较高，能把事情的来龙去脉观察清楚，意根无法仔细观察不会分析，就要听从意识参谋的建议；意根有很多时候也拿不定主意，不得不听从意识的安排。如果不是这样的话，意根智慧不足也不听意识分析思惟和劝导，意根永远按照自己的习性作主，永远也不会明理，不会走上学佛修行之路，也永远不能断除烦恼，不能成佛。一个家庭里家长作主，但是有些时候也要听取孩子的意见，满足孩子的要求。一个国家也是，总统也要听取民意。所以有些时候就显得意识的力量大于意根，意根要听从意识的引导和建议，才能把事情做好。</p><p>三十五、意根与意识的主仆关系</p><p>一切法都是意根这个主人所需要的，六识就是为意根主人而服务的，要听从主人的调遣，当然主人有时候也要听取仆人的意见和建议。比如说意根想要喝水，如来藏了别之后，就会出生六识来造作喝水这件事，意识负责考虑如何喝水，整个程序和步骤是什么，之后与身识和眼识一起取杯子倒水；意根想喝什么样的水，意识就要准备什么样的水，一个想什么时候喝，意识就安排什么时候喝，最后六个识一起喝水，完成一项喝水的任务，应该说是七个识八个识一起完成了喝水的工作。</p><p>如果意根不想喝水，六识就不会生出来造作喝水之事。意识永远没有意根重要，意识是根据意根的需要被随时随地生出来的法，由意根来决定，祂是从属地位，是为意根服务的，必须把意根服务好；如果意识不能服务好意根，意根就会不高兴，心里不舒服，甚至要闹情绪，或者是抑郁烦闷，或者是精神不正常；意识如果是严重违拗意根，时间比较长的话，意根就要出现问题，可能要精神错乱精神分裂，也许要疯掉。</p><p>意根想听声音六识就得被生出来分别声音，意根指哪里六识就要到哪里去办事，但在办事过程中，意识可以随机为意根提供建议，也可以提要求，意根批准就可以照做，六识都要服从意根的指令。意根在六尘上如果有想法，六识就要出来实现意根的想法，意根没有什么想法不想造作什么，六识就不会出现。意根这个主人权利很大，六识很多时候都是不知不觉的被意根差遣东奔西跑，盲目的做了很多事，却不知道怎么回事，意根想要六识如何造作六识就得如何造作。</p><p>我们修证佛法如果不在意根上用力，只在意识心上用力的话，用完力意识就灭了，没有什么用；我们要证果，如果只在意识心上证，证完了就灭了，也没有用，后世还会在生死中轮回，还是被无明所覆盖。只在意识心上破无明没有用，意根的无明是根本无明，因为生死问题在于意根的无明，十二因缘的根本是意根的无明。所以我们一开始在意识上用力是为了影响意根熏陶意根，意识相当于传声筒，是传话的工具，也能帮助意根分析思考，最终让意根确认，从而改变意根，这是学佛修行最根本和最终的目的。</p><p>意根改变了，意识的熏染作用也就结束了，以后意根就可以带动意识完全造作善业。意识属于从属地位，属于参谋和传令兵，意根大多数时候可以用祂，极少数时候也可以不用祂，不用的时候，意识什么也不是。譬如我们想请领导帮忙办一件事，首先我们先得把这件事让秘书弄清楚弄明白，秘书就相当于意识，秘书再跟领导汇报清楚，领导弄明白是怎么回事了才能决定帮助我们，这事就成了。</p><p>意识就像一个门卫，我们想进去见领导必须经过这个门卫，但是我们要是停留在门卫这里，过不了门卫的关口，永远见不到领导。从古到今多少人都在意识心上转，始终不得其门，我们总想着要开悟，但是却守着个意识在外面转，不进入意根，让意根修证，就不能开悟。如果门卫允许去见领导，领导说不行，那就无法见到领导解决问题，门卫怎么说都没有用，只有领导允许才能进去吧事情解决。所以佛法再怎么好，都必须让意根修证和确认，让意根证得五阴无我证得如来藏。意根证得以后带领六识走走路行善业，得善果。</p><p>三十六、五阴身的功能作用以意根为主还是以意识为主</p><p>识阴的阴，是阴盖遮盖的意思，不仅六个识能遮盖住第八识的真正功能作用，第七识也能遮盖住第八识的功能作用。关键是对谁遮盖了，遮盖住谁不认识主人公的功能作用了。六个识的功能作用遮盖了第八识的功能作用，让意根觉得六个识的功能作用是那样的真实，以至于看不到都是第八识的功能作用，让意根生起错觉，于是就执取六个识的受想行识阴为我，并且是真实的。</p><p>但是，意根是否也执取意根自己的攀缘性作主性执取性执著性为我，是真实的呢？这关键在于意根是否有反观自己的能力，是否能观察到自己的功能作用。佛说八个识都有证自证分，都有反观的能力，只是能力的大小而已，意识是否能发现这些反观力而已。为什么非要意识来发现呢？因为意识是为意根五阴身所用的，意识能很好的处理五阴身的事情，意根隐藏身后，只能暗中指挥和操作，意识在明面运作执行，如果意识不了解情况的话，就没法帮助意根处理事情。</p><p>意根的反观力，所有众生都有，只是意识心没有大智慧，没有转识成智的时候，观察不到。一切法虽然意根都知道，但是要靠意识观察，意识如果观察不到，就是不知，意根的知意识不知道好像就没有用。意根知之后，要办事，必须依靠意识，意识不知就办不了事。</p><p>很多人只能观察到意识自己的作用，都以意识的作用为主，认意识的作用为自己的真正作用，不把意根的作用当作是最主要最重要的。意识不了解观察不到的法，很多人就不承认其存在，就要坚决否决。几乎所有人都是以意识的知为知，意识不知，就认为自己不知，自己不知，就说不存在。这是极大多数人的思惟逻辑，这个逻辑是错误的。众生如果没有大智慧，所有的错误都无法认识到，更不能改正。既然众生认识不到自己的错误和无知，不知道自己处于极多的误区之中，那就没办法从误区中钻出来，眼前永远有迷雾，什么也看不清楚，这就是无明。无明越重，越不容易有智慧看清事实，越不容易解脱。</p><p>意根也有证自证分的反观能力，能观察到自己的功能作用，不管意识能否观察到此点，不管意识承认与否。并且意根认自己这些功能作用为实，加以执取，不知道都是第八识的功能作用。直到真真正正的明心开悟以后，意根才恍然大悟，原来不是这样。所以断我见明心见性，证得任何一个果明了任何一个事实，都是意根与意识一起证得和明了的。这个非常重要。</p><p>三十七、意识因为什么能缘蕴处界</p><p>意识之所以能缘蕴处界，就是因为意根先缘，然后决定了别个究竟，意识才能缘蕴处界。如果意根不能缘蕴处界的各种相貌，意识就不能缘。意识是如何出生的？意根与法尘相处，意根想要有所作为，第八识才出生意识去造作，如果意根触法尘之后不想有所作为，第八识就不会出生意识去造作。那么意识缘了蕴处界相，一定是因为意根首先缘了蕴处界相，没有意根不缘蕴处界相之理存在！</p><p>无论任何时候，意根刹那刹那都要依第八识缘蕴处界相，与蕴处界须臾不可分离，即使在睡着无梦时，即使在昏迷时，即使在无想定里，即使在死亡没有离开色身时，即使在中阴身里，意根一直都要与蕴处界在一起，都要缘蕴处界，除非没有蕴处界的时候，没有五蕴的时候。</p><p>意根如果有不缘的法，意识就不能缘，在哪种法上如果没有意根，根本也不可能有意识的存在，何况意识还能缘得到。意法因缘生意识，这是世尊的圣教量，是世尊的圣言，亲口所说，岂有违背之理？意根默容一切法，是世尊在楞严经中亲口所说，岂有违背之理？</p><p>三十八、意识受意根教唆表现的心行是属于谁的？</p><p>意识的表现本身自主自愿的时候，其心行就是属于控制祂的意根的心行；意根被强大的意识心所教唆表现出来的心行同样不属于意根，而是属于意识的心行，虽然是意根作主了，但却是被迫的，不是自动作主的。比如父母唆使小孩子去偷东西，孩子因为太小，没有自我主张，不能违拗，就不得不顺从父母，那么偷东西的行为体现了父母的贪婪心性，偷来的东西属于父母所有，归父母支配。同理，主人唆使一条狗去拿邻居家的东西，是主人有偷心，狗并没有偷心，因为狗没有自主性，必须服从主人，偷来的东西属于主人所有，不归狗所有。如果狗单独偷东西，不是主人唆使的，东西归狗所有，是狗本身有偷心。</p><p>比如一个人拿刀砍柴的时候，柴木是人砍的而不是刀砍的，虽然是刀亲自砍了柴，但刀无心砍柴，柴归主人所有，不归刀所有。又如司机开车撞了人，是司机撞人了而不是汽车撞人了，司机要赔偿对方损失，汽车不能赔偿损失。比如主人命令仆人担水，或者打造金器，完成任务才能给报酬，仆人担的水打造的金器，都属于主人所有，这些工作是仆人替主人做的，主人应负责任。</p><p>仆人养活主人，主人当然要给仆人报酬，意根养活意识，当然要给意识一些理念，最终的功过是非还是由主人和意根承担。五蕴生生世世的因因果果，还是要由意根承受，意识扑落扑落身子走人了，结果都由意根处理和承担。生上天入地都是意根领着第八识去，成佛做祖都是意根领着第八识，又领着五蕴六识，一家大大小小的去成佛做祖。</p><p>三十九、意识观察不出来的法不代表没有</p><p>意根思量与意识的分析有一些区别，意识分析比较细微，思路清晰，意根无法细致到位，只能知个大略，考虑个大概，知道个粗况。如果有意根不能触的法，六识就更不能触和了别。意根能见一切法，一切法就是意根的相分，五蕴十八界意识都能见，意根更能见，所以五蕴十八界就是意根的相分。</p><p>如果意根有各种受，意识是否能观察得到？比如一个哑巴吃黄连，感觉苦而说不出来，别人是否能知道他感觉苦？苦是自心所受，他人只能猜测，如果都不知道哑巴吃了黄连，连猜测都没分。如果吃黄连的人味觉不灵了，他就不会感觉苦，别人猜测他觉得苦就猜测错了。意识没有智慧时，猜测意根的心行猜测意根的受觉，往往也要猜测错。</p><p>意根的所有作为必须通过意识表现出来，意识或者是别人才能知道。意根不能通过意识表现出来，能不能判定意根没有什么心理和心行？意识不知道，观察不出来的法，是否能代表那个法不存在？显然不能。凡夫观察不到如来藏，就说如来藏不存在，不是实有，这不是如实语。同理，意识观察不了意根的心理状态，就给意根下定论，也同样不合适。地前菩萨如果没有有证量的菩萨教导，无法现量观察意根的心理状态，那么给意根下定论，就不合适了，尤其是还没有开悟的人。只有在烦恼遮障断除，意识意根转识成智以后，意识才能有智慧一点点的现量观察意根的运作和心理状态，但也不一定能观察得太多太准确。</p><p>四十、凡夫目前的修行任务就是争取尽快实证</p><p>离开意识的时候，意根不管能不能反观到意根自己，因为没有意识，意识如何能知道？甲乙两个人，甲是否能反观到自己，乙不在面前的时候，如何判断？如果乙眼睛有遮障，即使正面对甲，如何观察判断甲的心行？凡夫众生的意识就像眼睛有遮障的乙一样，无法现量观察判断意根有否某种心行。所以我劝凡夫众生还是闷头修行，准备实证，不要给意根下什么定论，不要给唯识种智的法下什么定论，这离自己的实际现量观行太远太远了。</p><p>如何知道意根在用功在参究在思量？当你感觉心里总有一个话头，一个疑情疑虑，就是意根在思考和参究，思想注意力总是在话头上，心里总有疑问，就是没有明显的思惟分析考虑，但是那些疑虑念头想甩也甩不掉，就是意根在参究。</p><p>四十一、意根与意识的主从关系</p><p>意根如果想要喝水，六识就会出来烧水倒水沏茶，然后喝到口里；如果意根不想喝水，六识就不出来做这一切事。意识永远没有意根重要，永远当不了主人，因为意识是被生出来的法，由意根来决定出生与否，它是从属地位，是为意根服务的，而且还必须把意根服务好。如果服务不好，意根就不舒服，也许要闹情绪，当意根真的闹情绪的时候，意识有时候就会感到莫名其妙，意识比意根有理智，意根的情绪化比意识严重。意根如果想听某种声音，意识就得服从意根的命令过来分别这种声音。意根想让六识出现，六识马上出现；意根不想让六识出现，六识就不会出现；意根想要六识如何造作，六识就得如何造作。</p><p>学佛修证如果不在意根上用力，只在意识心上用力，在意识心上破无明没有用，用完力意识就灭了。证果如果只在意识心上证，证完就灭了，剩下意根还被无明所覆，我们就会继续在生死中轮回。因为生死问题在于意根，十二因缘的关键在于意根，修意识最终是为了影响和改变意根，意识相当于传声筒、参谋和助手，帮助意根拿主意想对策，最终扭转意根的无明，改变意根。意根改变以后，意识就不用再熏染意根了，两者再和合造作善法。</p><p>意识处于从属地位，意根可以用祂也可以不用祂，不用祂的时候，意识什么也不是。从古到今多少人都在意识心上转，始终不得其门。我们总想开悟，修不到意根这里就开不了悟，佛法再好，也得让意根认可。意根一旦认可了，就会有所约束，就会有所选择的让六识造作业行，无意义的事不想再造作了，如果意根觉得什么都无意义，六识不但少于造作，也不出生了，最后意根自己也就灭去，涅槃了。</p></div>"
},{
    "title": "第五章　意识与意根的沟通方式",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　意识与意根的沟通方式</strong></p><p>一、意识和意根之间是怎样沟通信息的</p><p>当意识在某种程度的定力中，来思惟观行某个问题时，才能充分发挥意根的思量作用，意根才容易与这个问题相应，容易接受和理解。而对于意识的比量和非量的了别和思惟，与现量和事实较远的思惟，意根不容易相应，不容易理解。要使意根认定一个法，意识最好能专注，集中精力思惟，把这个法的意思在总体轮廓上弄清楚，然后凝聚成一个点，落在意根里，意识离开文字语言长时间的关注这个点，少于造作，就能使意根缘着这个法不放，并且能深深的连续不断的思量，即使意识不在这个问题上作意了，意根仍抓住这个问题不放。那就把意根熏成功了，然后指望意根最后彻底解决问题。</p><p>意根的思惟方式与意识不同，但意识可以调整自已的思惟方式，便于与意根交接，与意根协调一致，参禅就是用这种功夫，但要具备这种功夫，需要长时间的训练。我们只要学会这种方法，学着运用，运用好了，将来就能证得一切法。把一个问题深深的悬在脑海里，意识不特意思惟分析考虑，就那样带着这个问题，关注着这个问题带着疑问，意识不动，表面平静，实际上内心深处并不平静，意根在连续不断的工作着，意识也要配合缘法，或者意识不用太专注，可以做其他事情。</p><p>刚刚踱步时，就参究明白一个道理，运筹帷幄还是意根这个老古董，老谋深算也是意根这个老古董，意识好像一个小毛孩子一样，只能跑跑达达的办点小事，祂还得对意根前呼后拥的照应着。</p><p>修定主要是为了显发意根的智慧，减少它的攀缘，由它证悟认定。学骑车也是这个道理，意识再灵巧也只是促成意根掌握方法，之后意根指挥身根六识配合，得心应手，灵敏快捷，根本不需意识太多参与了。但是意识之前的学习思惟帮助了意根，给意根提供了参究思考的资料数据，让意根充分的掌握。另外，解答一道难题之情形也与此很类似，意根真是很奇妙，伶俐得很，祂作为一个识心，能做很多事，并不是一个呆瓜。</p><p>二、自我暗示，是意识暗示意根，给与意根一定的鼓励和激励，让意根更加自信一些，意志坚定一些，处事更积极一些。暗示的方式是，意识在心中说：我（意根）是有力量的，我（意根）能做好这件事，我（意根）有把握，我（意根）能应付得了，我（意根）很优秀，我（意根）有信心，我（意根)……意识这样说的时候，还以为是说给自己听的，不知道是在暗示意根，因为意识分不清意识和意根，就把这两个识心的共同运作的模式当作一个整体的我，其中的细法却不知不懂。</p><p>虽然如此，意根也得到了暗示和鼓励，心中就会振奋起来，底气增加了。于是意根就相信这种暗示，相信自己一定能行，有能力实现自我价值，有能力展示自我，意根就比较自信了，力量强大起来，就果敢的造作身口意行，实现自己的目标，达成自己的目的。</p><p>三、很多人都有过一个人在心里对话的经验，一个人怎么能进行内心交流呢？这是两个识心之间的交流，以一问一答的形式（也叫作自问自答），或者是互相商量和彼此沟通，也能解决各种心理问题。因为两个识心的功能作用不同，经验不同，可以取长补短，意识的特长是能够细致的思惟分析和推理判断，能帮助意根在六尘上细致了别；而意根的经验老道，思量性强大，抉择性也强大，而且能发动如来藏心想事成，把理想变为现实，弱处就是攀缘广泛，不能细腻了别，正好意识能弥补此缺憾。</p><p>所以当意根拿不定主意时，要向意识请教事情的来龙去脉和细节问题，再作以判断和抉择；当意识琢磨不明白，不知如何是好时，把事情交给意根深深思量，刨根问底，把事情根源挖掘出来；当二者都拿不定主意时，就要反复切磋，反复思量，反复琢磨，反复推敲。当所有注意力都集中于此一重大事上时，意识就要少于分析，意根要多思量，就像鱼儿沉于水底，不见水浪。</p><p>楞严经形容此一情景时说：静深不动，沙土自沉。意思是意识所有的散乱思惟、浮浅思惟此刻都消失不见，唯有意根深深的、静静的、沉沉的、暗暗的思量着、权衡着、抉择着。突然一个大浪，鱼儿跃出水面，意根思量明白了，一拍大腿，就是这么回事，恍然大悟，豁然开朗，办法出来了，事情解决了。当然在意根暗暗思量之前，意识已经把事情的细节传递给了意根，意根了知事情的大略，还不能马上做一个抉择和判断，祂要亲自参究参究。</p><p>有时候，主动想交流、想探讨、想得到答案、想解决难题的是意识，有交流意向的是意识，能用语言表达的是意识，意识把自己不解的问题提出来，摆出来，谁能帮助解决这些问题呢？除了意根，没有第二者。意根思虑问题时，不仅要少攀缘，更要发挥其思量抉择性，意根更多的了别意识的思惟，就能顺着意识的思惟内容而努力加工，最后就能把问题解决，满足意识的所求。</p><p>四、问：意根不与语言文字相应，那么意识所观行的结论如何说服意根？意根和意识的交流渠道和方式如何？能否用现量观行，给出意根和意识之间的交流方式？</p><p>答：意根不与语言文字相应的意思是，意根不能用语言文字表达自己的思想观念，只能以信号电讯号的形式传导给六识和五阴身。传导之后，色身就有自律性的反应，六识就不自觉的触六尘，意识就得到了某种思想观念，得到某种信息。而意识所思惟、分析、表达的内容，意根能用其特别的方式加以理解，意识所有的思惟了别活动，包括语言和文字内容，都以一种信息的形式传递到意根，落谢到意根里，意根能全部了别到，也能解析，对六识传递过来的信息有一定的胜解力，否则意根就无法抉择，无法作主指挥下一步的行动。</p><p>意识在观行佛法时，观行的信息同时就传递到意根那里，意根一次不懂，二次不懂，时间长了，就能理解和受熏，同意意识观行的结果，这是意根启动自己特有的思量判断性的结果。如果有禅定时，意根也能根据意识观行思惟的思路，自己作以思量，或者与意识一起，或者单独思量，意识熏染得越深刻，意根越有能力单独进行思量，从而与意识一起共同断除我见，共同证果。</p><p>意识自己在嘟嘟哝哝时，就是在给意根传话，与意根商量切磋，心越沉静时，意根越能起作用，思量性越强。每当二者谁也拿不定主意时，意识就自我心理对话，好像有人听似的，当然是说给意根听，希望意根拿主意。有时在房间里思考问题时，身体要来来回回转圈、踱步、思量、走来走去、敲敲脑袋、现出一副沉思的样子，这是意根在沉思，在考量，当然不离意识的思惟和参究，不离意识的参谋作用。</p><p>当自己一个人遇到问题，没有其他人可商量时，意识就与意根对话、商量、切磋、交流，这样也许能想出一些对策来，要不然心里就觉憋闷。这里到底谁是主动要求切磋和商量的，不好观察，有时是意识主动，有时是意根主动，不管哪方主动，都不离意根的作主，也不离意根的思量。尤其是陷于沉思的时候，都是意根的深思行为，来回踱步思考时，有意识的思惟，更有意根的思虑考量。其中如果意识的力量大，意根的力量就小；如果意识少用心思，意根的力量就大，解决问题也有力度。</p><p>五、意识与意根的交流方式一般是用自问自答的方式。自问自答，到底是谁问谁答？比如我现在问，让你们回答，最后结果我得赞同，我得总结归纳，这个问题才算结束。那么一个人自问自答，是谁问谁答？有时是意识问，意根回答，问时以语言文字的方式问，答时无语言文字，意识明白时就说：哦！是这样。有时是意根问，无语言文字的疑情出现，意识辅助思惟分析，提供数据，意根依之再思量定夺，解决的方案就出来了。不管是谁问谁答，最后都是意根认可赞同，意根作最后的定夺和抉择，问题才算解决。</p><p>参话头和参禅、参究，都与自问自答是一个原理，都是两个识之间密切配合的关系。意识存在时，两个识刹那都没有分离过，意识所思所想都受意根指挥，从来没有脱离过意根的操控和配合，从来没有出现过意识单独思惟，意根不参与的情况。如果意根不参与，意识就灭去不存在，意识不能脱离意根单独运行；而在没有意识存在和思惟的时候，意根仍然可以单独工作，从来没有休息过，遍计所执，时时思量处处作主，即使在睡着和昏迷以及死亡前后，意根也没有得闲过。</p><p>所以两个识如果没有密切配合关系，不可能破参开悟，如果没有意识的参与，就没有数据资料，不知道详细情节，证据就不足；如果意根不参与思量，其结果就是有问无答，那就没有答案，没有结果，就作为一个不解的问题存留在意根心中，以待意根慢慢解决，这就说不定是什么时候了。</p><p>参禅当中要起疑情，然后参究。有疑情，就是问，解决疑情，就是答，这也类似于自问自答，疑情就是问题，答案就是结果，参禅参究就是寻觅结果；参究就是意识与意根共同磋商，共同探讨，疑情解决时，必是意根意识都证知答案和结果，共同解决疑问。离开意根，不可能解决疑情，破参是二者共同努力的结果，意识不能单独享受成果，这不公平。其实任何一个成果，都不应该由意识单独享受和承受，意根一定有份。</p><p>六、沉思和发愣、愣神状态也与自问自答相类似，与自问自答的功夫是一样的。还有推敲，又推又敲，这也是处于寻觅答案的状态。发愣之后，再练练推敲，反复推敲，观察一下是什么功夫，有什么结果。有问题出现，就是推，敲是什么意思？是琢磨、思量、考量、深究的意思。其实每个人都会参禅，都参过禅，就是不会总结经验，不会往佛法上用。手拿一支笔，拄着下颚，紧皱眉头，眼光凝聚，那是在干什么？是意根在参究，比较专注的样子。</p><p>有人在做事前先用直觉感知，然后就能知道怎么办了，好像是跳跃思惟，其实就是意根的直觉作用，不用意识的思惟、分析和研究。在心比较静的时候，意根的感知力大，直觉性强，能考量出事情的根源和实质，不走意识的按部就班的思惟模式。意根的深思，不是意识那种表面浮浅的思，当这种思不被意识所观察和理解时，就说成是跳跃式的思惟。</p><p>还有人每当思考问题时，用天目位置照射，好像能很快明白所考虑的问题，这是一种凝神状态，是在定中思考，能很快解决问题。还有人思考问题时，眼睛眯着，或者直勾勾的定在一处，或者一处也不定。这都是意根凝神专注的状态，当然意识更是专注了，但是意识的思惟性好像不存在了，意根心思活动却很明显，这样解决问题最快最直接最究竟。</p><p><br/></p></div>"
},{
    "title": "第六章　意根与前六识的关系",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　意根与前六识的关系</strong></p><p>一、前五识所了别的都是现量境，了别当前正在显现着的境界，五识不用对五尘的境界进行分析、比较、比对，就能知道是什么，也不用想象和思惟，了别的境界比较粗糙和单纯，往往比第六识先了别一刹那。眼识了别色尘的显色，比如青黄赤白，这些颜色是现量境，不用进行分析比较就能识别出来。</p><p>而第六识要对色尘上的长短、大小、方圆进行比较才能知道，因为没有绝对的长短方圆和大小，都是通过与某个事物相比对，才能知道；或者根据过去的经验来衡量比对，才能得出一个相对的结论。第六识还了别色尘上的质量、结构、特征、特质等等内容，需要通过分析、思惟、求证、推理，以及根据经验，才能判断出来，因此第六识就有极多的比量思惟，很多时候也会通过想象等非量思惟。</p><p>而第七识不对五尘或六尘进行直接了别，因为所缘太广，了别智慧比较弱的缘故，祂先是了别一个粗况和总体，后了别前六识分别以后传递过来的信息，六识刹那刹那都把了别的六尘内容传递给意根，意根就根据自己已有的经验和六识传递的信息，来进行思量权衡，然后再做决策，决定下一步该如何做。所以第七识会把六个识的了别内容汇总，综合思量权衡，再做出相应的决策，指挥六识进一步的活动。</p><p>比如说鼻识，鼻识直接感知气味是否刺鼻，是温和的还是强烈的，是好闻的还是难闻的，这些内容是不用鼻识分析比较就能了知的，这就是现量了别。意识了别气味是香是臭，是哪种香哪种臭，是什么物品上发出来的，从什么方位传过来的，距离有多远等等，这些内容要通过思惟、分析、推理、想象、比较才能了别的，因此就含有比量和非量的性质，有时就会判断不准确而做错误了别。而第七识在这当中，刹那刹那在接收二识传递过来的信息，然后思量是继续了别，还是停止了别，还是躲避。</p><p>二、问：在熟悉平坦的路上，根本不用意识心分析如何走路迈脚，这时正在走路的身识，是完全靠着自己运行的，还是同时也靠少分意识来分析路面情况呢？</p><p>答：前五识只要起作用，一定是和意识心同时起作用，同时分别的，五识不能单独分别五尘。五识只能了别五尘的比较粗燥的部分，微细的部分只由意识心同时了别。比如眼识见色，只能了别青黄赤白的比较粗浅的显色，不能了别形色、表色和无表色，这些是要由意识来了别的。所以五个识必须是和意识同时分别，才能把五尘所有内容了别清楚。</p><p>身识在走路这法中，都有意识心参加，二者同时紧密配合，身识不能单独起作用而使身体运动；必须有意识的配合，起思惟分析判断等等作用，身体才能走路。五阴身做一切事情，都有第八识、意根、意识以及五识的其中之一，共同来完成。眼见色，耳听声，鼻嗅香，舌尝味，身觉触，至少有四个识参加，或者同时八个识都参加。意识在不细致、没有智慧的时候，自己参与了一切事情的了别，却都不知道，因为还没有反观智慧。</p><p>走路如何抬腿迈脚，是由意根作主决定的，祂是根据意识心的分析判断来作主作决定的。虽然意识心也在思考着其它问题，但可以同时多用，分心之处越多，意识心越不专一，定力就越不具足。即使专心致志时，意识心也能稍微分神其它方面的事情。</p><p>意根认为什么事情重要，意识心就专注在什么事情上，集中精力在那件事情上，其它方面就少用心思。眼观六路，耳听八方，就是意识心同时分散在各个方面，而各个方面都能照顾到不错乱，越有训练，意识心越多能。当然意识心也是在精力集中的方面了知的多而清楚透彻，在少用心的事情上了知的就少。</p><p>那么比较熟悉的事情，就可以少用心思和精力，就能把事情做好，也不至于出错。所以即使在熟悉平坦的道路上走路，仍然有意识的参与，也有微细的思惟判断，只是有的人意识无智，不能反观到自己的作用而已。</p><p>三、意根和六识的密切配合作用</p><p>身体在找平衡时，有身识、眼识、意识、意根、第八识在一起和合运作，刹那作主宰的是意根，祂根据惯性和六识的了别，刹那作决定作主宰。意根的惯性运作里，有很多秘密，我们现在还不了解，有待于深细观行和观察。意根的法非常多而且深奥，菩萨的论著里也没有涉及到多少内容，因为这属于极深的道种智内涵，但是意根的法却非常有趣味，非常耐人寻味。</p><p>身根的运行当中有意识和身识的参与，不仅仅有意根的了别和作主。如果身体不经过意识，没有意识的参与，意根直接就能支配身体作主宰的话，那么昏迷时，意根也能让身体起来走动。只不过当事情非常紧急，意根充分发挥自己的惯性作用时，意识心的作用力就显得弱一些，意识的思惟性判断推理的功能，就显示不出来，实际上意识还是有其了别作用的。</p><p>比如说练习过武功的人，武功极高的人出拳速度是非常快速的，应对时几乎没有了别思惟的机会。但是意识还是在极其快速的了别着，训练有素的人才能如此，所以武功是练出来的，练眼识、身识和意识与意根的密切而快速的配合运作，练习意识的反应和应变的速度。</p><p>四、眼识了别到刺眼的光，会自动躲避，眼睛感觉到刺眼，是眼识了别的，于是思心所决定躲避。其中也有意根的抉择，眼识意识把了别的信息迅速传递给意根，意根了别之后快速决定躲避。身体感觉累，是身识了别的，其中都有意识参与，如果决定休息，是意根决定的，首先是身识和意识感觉累，决定休息，把信息传递给意根，意根同意就决定休息。累和疲乏也属于触尘，是身识意识了别的，心上的累和疲乏的觉受是意识单独觉受的。有时候身体累，意识不觉得累，有时候身体不累，而意识却觉得累。</p><p>对于六识的觉受和决定，意根主要听从意识的决定。所以当身体很累，意识还贪玩的时候，意根决定再玩一会儿，而身体并不累，意识不感兴趣觉得累的时候，意根就决定让身体休息，实际上是让意识休息，以躲避不感兴趣的事情。</p><p>五、六识是意根的工具，没有六识，意根什么心行也表现不出来。比如晕倒在马路边，出现危险时，意根想躲避，可是六识就是不能现行出来，那只好继续躺在那里，任危险临身。这时候就不能说意根没有躲避危险的想法，也不知道保护自己，不重视五阴身。意根所有的心行一定要通过五阴身和六识现行出来，或者借助于其他灵性的色身和物质色法表现出来。有的人一大早起来就不高兴，自己和别人都不知道为什么，意根知道却说不出来，所以就不能说意识不知道的，意根也不知道，那是意根无法表达的心情和情绪。意根没有言语，当然是无法表达了。</p><p>六、外色尘无数，如来藏都能同时缘到，意根也能缘如来藏的见分而间接缘到，但外色尘不一定全部在胜义根里变现出影像，比如身后的人和物，鬼神类阴隐的众生，远处的色声香味触法等等。因为外六尘还要籍五根为缘才能传导和变现，五根触不到的外法，如来藏就无法传导和变现。</p><p>如果把外六尘传导到外五根和胜义根时，意根都先触，然后才决定是否了别，如果决定了别，六识就会出生；如果不决定了别，六识就不出生不见六尘。所以说对一切法的了别都是由意根作主决定，意根就是作主识，六尘是否能被了别，由意根说了算。</p><p>七、六识的生灭相是如何出现的</p><p>从相上看，前六识经常生灭变异，即使白天很正常的情况下，也是要不断的从此法上生，从彼法上灭，然后再从此法上灭，从另一个法上生。六识的体性就是这样不断的生生灭灭，根本不定。六识因为什么要在各种法上生生灭灭呢？因为意根思想的波动，意根攀缘性的不断转变，意根的不定止造成的。如果把意根降伏下来，心不散乱，意根的思想念头就不会跳动不停了，就会定在一个几个法上，六识也就不散乱了，不会到处出生和了别，不会跳来跳去的了。</p><p>八、小乘法中的识蕴不包括第七识，识蕴只是指六个识的蕴集作用。但是从大乘法的角度来看，识蕴的蕴集作用主要是意根的集的作用，是意根集的结果，因为六识的一切功能作用是意根唤起的结果，是意根指挥和操控的结果，六识的作为是意根意志的体现。实际上一切法都是意根集起来的，是意根推动的结果，六识只不过是意根使用的工具而已，六识是意根的附属品，能不能得到应用和开发，完全在于意根。</p><p>九、六识与七识的关系</p><p>七识呼为染净依，六识的染污和清净都是依靠七识而来，七识清净六识就清净，七识染污六识就染污。所以七识是心地清净与否的关键因素，七识有贪嗔痴六识必有贪嗔痴，七识无贪嗔痴六识必无贪嗔痴，七识无明六识必无明，七识明六识必明，七识转识成智，六识必转识成智。七识是主，六识是从、是仆、是伴。</p><p>从意识下手，改变意根，意根改变整个六识都改变。如果意根不改变，虽然意识觉悟了，在意根的操控下，意识还是清净不了。意识不能永远看着意根，稍不留神，就身口意就有贪嗔痴出现。尤其下一生，意识是新，没有觉悟性，完全服从意根，受意根熏染，前世的暂时清净性就消失了，从头再来的时候，依从意根必然贪嗔痴。境界强烈的时候，意识根本拗不过意根，还是意根作主贪嗔痴。</p><p>十、 造业的身口意行都是六识的行为，离开六识，众生就没有身口意行。所以说身口意行的身行，就是六识的造作；口行，就是六识的造作；意行，就是六识的造作；但是六识的造作，是受第七识意根的指挥，受意根的主导，受意根的支配。意根如果不指挥，意根如果没有心行，意根如果不作意，不思量，六识就不会造作。意根要思量什么，六识就随着意根的思量去作相应的身口意行，所有的身口意行都是听从于意根第七识的指挥。所以意根如果是具有贪嗔痴烦恼，六识的身口意造作就有贪嗔痴烦恼，意根如果是没有贪嗔痴烦恼，六识的身口意造作就不会有贪嗔痴烦恼，所以六识的身口意行，是符合意根的思想心行的，符合意根的思量，符合意根的习性。</p><p>意根想要作什么，祂的心行一生出来，如来藏就会了别到；因为如来藏是了别众生心行的，主要是了别意根的心行，以这个为主。意根想作什么，如来藏都知道，然后就配合。配合之后，就要生出六识，造作出相应的身口意行。所以说，从客观上来看，意根好像指挥了如来藏，如来藏完全是一个随和、随顺、配合意根的一种心体。</p><p>实际上，一切法的种子都存在如来藏里，如来藏是种子库房的主人，输出什么种子，实现什么业报，由如来藏说了算，由如来藏来决定。因为如来藏是完全无我性的，没有任何一种主张和心行，所以才会配合七识，产生一切法。而第七识我性非常的强，祂有强烈的自我主张，我一定要这样做，我一定不要那么做，这就是非常强烈的一个自我。那么我们所说的一个我，最深层的我，就是意根的我，这个我叫俱生我执，非常非常的难断，比意识心的断续的我执还要难断。</p><p>意识心的我，容易受熏陶，容易改变，容易受后天环境的熏染，很快就能改变过来。可是意根的熏染和改变要花费很长的时间，因为祂无始劫以来一直存在，没有断灭过，习气非常的深重，深层次的烦恼和无明都体现在意根上，都是意根的。所以身口意的造作就要随顺于意根的心行，意根如果是清净了，六识的身口意行也就相应的清净，意根如果是染污的，祂所指挥的六识的身口意造作，也就是染污的。</p><p>十一、六个识的一切信息，都是刹那刹那传导到意根那里的，意根刹那刹那都知六识所了别的信息，以及六识的心行。所以意根才能根据六识的信息，刹那刹那起自己的心行，再刹那刹那做主宰。六识是意根的使用工具，六识不能用了，意根再有反应，也无法表现出来，急死也没有用。就像一个人想要砍断一棵大树，可是手里的刀具坏了不能用，他就得干看着，无所作为。</p><p>人用刀具砍树，树被砍倒了，这是人干的事还是刀具干的事？当然是人砍倒了树，是人利用刀具砍倒树的，功劳和过失都应该算在人的头上。同理，意根利用六识造作了一切身口意行，其功其过都应该算在意根的头上，六识只是被支配而已。但是如果六识给意根出谋划策，意根听从之后而造作的行为，六识也有分。</p><p>十二、中阴身里也有六识，但六识的作用力比较弱一些，没有在人身上强大。因为中阴身是业力的体现，色身与人身差别很大，依色身而有的意识其思惟分析判断功能就弱，意根没有意识的牵制作用，业力习性就会完全表现出来。如果意根的烦恼习性没有得到转变，戒定慧都没有修习，不与善法相应，福德也没有修习出来，再没有断除三缚结，一定会被烦恼结缚所缚而去三恶道受生。中阴身一切活动都以意根的业力为主，意根善则去善道受生，恶则去恶道受生，或者是随意根的愿力受生。</p><p>正死位没有意识，是为什么呢？因为如来藏要离开，逐渐的收回四大种子，不再输送出来，五根的功能就逐渐维持不了了，六尘就无法运送进来，出生意识的缘不具足，意识就不再出生。六尘传导的越来越少，六识就会越来越微弱，最后灭去。</p><p>十三、意根与色身和六识的关系</p><p>意根一旦证得了某个理，颠覆了从前的认知，心里就要产生某种情绪，有思想波动。而意根的情绪与思想波动只能通过色身和六识表现出来，没有别的渠道。色身和六识就是五阴身，是受意根调控和支配的，属于意根的道具，被意根所差使和调遣。所以色身和六识的表现，正是意根心理状态的反应。色身和六识犹如傀儡，而意根就像背后牵线人。但意根也是一个傀儡，其牵线者却是如来藏，一切法包括意根都是如来藏所牵出来的，都被如来藏所牵。因此说如来藏是一切法的主人，而意根又是色身和六识的主人，大多数时候意根是一个集权主义者，只是偶尔在拿不定主意时，才放开权利，听从意识的建议。</p><p>六识尤其是意识所表现出来的清净性和染污性，贪嗔痴烦恼性，以及各种习气，大多数时候是来源于意根的，是意根调控出来的，是意根指使的，代表着意根的心性，是意根心性的反应。少数时候是意识受到环境熏染表现出来的行为，不代表意根也有此心性，不代表意根也被熏。</p><p>比如学佛时意识被佛法所熏，清净了一些，烦恼现行的少了一些，但不代表意根也清净了，烦恼少了。要想意根也清净减少烦恼，必须在证果之后，意根在实证了佛法，真正明理之后，才能清净一些。理论知识只对意识有用，意根无法相应，意根相应的是现实，是现量观行智慧，没有确凿的证据，意根不能承认，因此心行就不能真正转变清净。</p><p>由于意识比意根的了别智慧强大，认识真理的能力强，心行要比意根清净，烦恼要比意根少而轻微。除非处于特别恶劣和染污的环境，一般情况下都是如此。</p></div>"
},{
    "title": "第七章　意根与意识的互熏关系",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　意根与意识的互熏关系</strong></p><p>一、通常来说，意识因为了别慧强，能分析思惟，就有机会明理，意根了别慧差，不容易明理，本身的习气又太重，意识总是想引导意根往善的方向转变，可是意根固执难改。如果有人造作烦恼恶业时，内心里没有思想矛盾，没有左思右想，那说明意根和意识两个识都是烦恼很重的，没有一个明白道理，这样的人离修行还是很远。一个人如果能心安理得的造作烦恼业，而内心丝毫不觉悟，不惭愧，没有思想斗争，那这个人的烦恼特别重，几乎不可度化。</p><p>如果意识明知不对，还要造作烦恼恶业，那是因为意根习气太重。如果造作恶业以后，还不自知，意根和意识都愚痴不明理，烦恼重，这种人很难度。一个做错事造恶业，从来没有思想斗争的人，从来不知惭愧和后悔的人，是非常难办的，这样的人，只有暂时躲开一点，否则自己会经常惹烦恼上身。</p><p>惭愧，是善心所法，无惭无愧，就是恶心所法，一般人都是无惭无愧的造作恶业，却从来不自知。意识经常如理如法思惟分析善法和恶法，熏染意根，意根慢慢就能按照意识的想法做事了。</p><p>二、意根的作主性，一个是根据自己的经验和习气惯性，一个是听从意识的建议，究竟意根如何作主作决定，要看意识与意根哪边强势。如果意识强势，意根就听从意识的分析和建议，过后有反悔有不反悔的情况出现。意识太强势时，意根不得不听从，表面答应，过后一反思，就反悔了，说明意根并没有真正想通。</p><p>意识是执缰绳者，牵引意根走什么路，意根就走什么路。意识如果不错觉，意根慢慢就正觉，成佛有望。意识无始劫以来都在错误的教导意根，告诉祂万法都是真实的，都为我所有，五阴世间真实美好值得追求；于是意根信受意识的邪教导，不断的贪执五阴万法，以至于深陷生死泥潭，不得出离，也不自知。从前的意识可以称作邪师，从现在开始，我们要让意识作一个良师益友，辅助意根，共成佛道。</p><p>这里的我们，指的是谁？是意根让意识和意识让自己。意识的证自证分起作用，督导自己，意根同意。意识的证自证分，是证明意识自己了知性的，意识能反观自己，才能让自己，督导意识自己，意识的证自证分与意根没有关系。</p><p>自觉，一方面是意识觉悟意识，一方面是意识觉悟意根，先觉悟意识自己，后觉悟意根。觉他，先觉悟他人的意识，再让他人的意识觉悟他的意根，就成功。能不能同时也觉悟到他人的意根呢？直接觉悟到他人的意根，这是最快速的，需要几个条件，一要看自己觉悟的程度，有没有说服力，也就是现量程度如何；二要看对方意识的觉悟程度；三要看对方意根的烦恼轻重程度，也就是根基；四要看对方因缘时节到没到。如果这几个条件都具足了，那就能够直接说服他人的意根，让他人马上信受，并且执行。我们可以说这个人非常利根，一拨就转，毫无滞碍。</p><p>三、意识与意根的协调性</p><p>意识与意根有协调一致的时候，也有互相违拗不一致的时候。意识经常说服教育意根，时间长了，意根受熏成功，就能听从意识的劝导，意识思惟到哪里，意根就能做到哪里，叫作说到做到，意根不再违背意识所说而做事。心口不一时，意识说这件事应该这样做，意根却决定那样做，叫作说话不算数，也叫作妄语，也可以叫作违背良知（意识正确如理的认识）。</p><p>如果意根遇事没有烦恼，可是意识受后天环境的熏染，却有烦恼，意识要说服意根随顺自己的烦恼性，意根可能顺从也可能不顺从，要看哪方力量强盛。如果意识和意根同时都具有同样的烦恼，那么为人处事时，二者协调一致地造烦恼染污业，如虎添翼，那是势不可挡的。如果意识和意根都没有烦恼，清净无染，二者和合运作，为人处事时，心地清净无比，遇到什么违逆境界，也不动摇。</p><p>如果意根烦恼很重，可是心里从来没有矛盾，这样的人，是连意识都没有觉悟的人，意根更没有觉悟，不能反省自己，习惯于烦恼习气，习惯于恶心恶行，这是没有一点修行的人的心行。作恶业时内心没有冲突的人，连意识都没有觉醒，何况意根，这样的人离修行还很远。</p><p>意识和意根之所以会经常出现冲突，是因为意识受新环境的熏染，容易生起新的思想观念，而意根习惯于旧有的知见看法，二者暂时就不能协调一致。意识的慧心所比较强，能拣择好坏美丑，意根攀缘的法太多，没有定，慧浅慧弱，就得需要有智慧辨别力强的意识不断熏陶意根。如果意根慧心所也增强时，修行就很容易了，那得转识成智以后。初地以上菩萨的意根已经转识成智，慧心所就强大一些。</p><p>四、诸恶莫作，众善奉行，自净其意，是诸佛教。做恶与不做恶，由意根作主决定，同理，做善与不做善也由意根作主决定。如果是所有的恶都不做了，意根必断除所有的烦恼，也要断除所有的烦恼习气，这时最低要修到八地菩萨境界，分段生死已了。</p><p>而能做到众善奉行，不仅要广发菩萨的清净大愿，还要广泛而切实的实行，凡是能利益众生的事业遇缘都要做，丝毫不顾及个人利益。这样个人才能得到大利作为回报，因为舍己为人，实际上还是自己得利，最终成佛。</p><p>自净其意，最开始意识能做到自己清净自己的意，但往往还要受意根染污，意识净自己意还不究竟，那就要熏染意根，净意根的意，意根的意一旦清净了，一切身口意行必净，染污种子就全部汰换为清净的种子，于是无明断尽，成就佛道。以上为诸佛所教导，我们弟子愿随顺诸佛教，信受奉行！</p><p>五、自信满满，有意识的自信，也有意根的自信，如果二者都自信，那就自信满满。意识心生起不如理作意思惟的时候，通过观察自己五阴，观察自己的十八界，也可能要比对其他人的五阴，觉得自己很优秀很强大，相信自己的思想观点全部都对，相信自己的才能智慧绝对没有问题，相信自己所做的事完全正确无误，相信自己超胜于人，相信自己一定能够做好某种事情。</p><p>这种自信，有可能受意根我执我慢等烦恼的影响，也缘于意根对自我的贪执，反应出了意根的我慢烦恼，因此自信满满也有意根的自信，也可能意识真观察到了自己确实有某种能力，意根依之也相信了。要想消除过于自信这种不如理自信，就要如理修学佛法，认识到无我真理以后，就能了知到自我的虚妄不实，了知到并没有一个真正的自我可以炫耀和自豪自慢，从而正确合理的看待自我，看待他人，其实都是平等无我性的，从此就不再有我高我慢和我执。</p><p>众生无始劫以来，由于对自我错误的认知和执取，导致自己无量劫的生死轮回苦，如今遇到了佛法，就要跟随佛陀踏实修行，正确的闻思佛法，然后如理的观行佛法，最后就能证得无我，当大智慧打开时，就能了知诸法实相，不再迷惑颠倒，我慢就能降伏下来，就能公平客观的看待自己，不再有慢心。</p><p>学佛修行第一之要，是要断除我见，尤其是意根的我见，不要再认自己的五阴十八界是真实的，是我的，要如理证得五阴确实非我，是生灭无常变异的，但也不异“我”。第二就要修学大乘般若智慧，认识自性如来藏，证得祂是万法的源头，五阴假我仅仅是被祂所出生和执持的一个幻化之相，非真实有。那么从此以后，因我而起的过头自信就会消失，我慢就消除，生死业障就能了尽，然后成就佛道，广利有缘。</p><p>六、即使佛的意根已经完全变成平等性智了，也有惯性作用，但其作用都是善性的，与善十一法完全相应。意根的惯性力量，意识可以改变，意识根据外界环境因素，告诉意根什么对自己有利，什么对自己有弊无利，意根就可以做出对自己有利的选择，也许就能在某些方面改变自己的惯性力量。比如抽烟喝酒的戒除，得靠意识的说服教育，意根自己没有能力认识和改变这个惯性力量，当初这个惯性力量也是借助于意识形成的。</p><p>意根的思心所有一种抉择作用，是用于思量作决定用的，五遍行心所法时时刻刻运行，不能断绝也没有断绝过。有时意根一意孤行，不听意识的分析开导，是业力使然，意根没办法抗拒业力，必须靠意识长期的熏陶，才能慢慢的改变自己的不良习性，最后才能够弃恶从善，这是意识的成功教导所致。</p><p>七、意根的情志对身心的影响</p><p>欣喜若狂、惊恐万状、心惊肉跳、魂飞魄散、汗流浃背、撕心裂肺、肝肠寸断、痛不欲生、怒发冲冠、目瞪口呆，这些都是描述心指挥身，身心同时发生变化的词汇。身心变化，是由意根控制的，心变身就变。意根一旦受到触动，从头到脚，五脏六腑，都有可能发生变化，说明意根对身心世界的控制和执著有多么严重。意根一旦知道身心都不是自己，想想祂会怎么样，祂就不再控制身心，身心就放松下来，出现轻安、舒适、内心喜悦、禅定增强、睡眠减少、疾病减退、色身高大轻灵等等变化。再修行一段时间，意根断尽对五蕴世间的执著之后，内心就改变了，那时的心境是这样的：任你风吹浪打，我自闲庭信步；猝然临之而不惊，无故加之而不怒。</p><p>喜、怒、忧、思、悲、恐、惊七情，都与五脏六腑有关系，分别对应着心、肝、脾、胃、肺、肾，那就是说身心互相影响，互相依赖，心理活动能影响五脏六腑的健康，五脏六腑的状况能影响心理活动。喜动心，怒动肝，思动脾，忧动胃，悲动肺，惊恐动肾。这些心理反应，是由意根动心而指挥造作出来的，由意根来控制，与意根相应，意根作出反应，就牵动色身出现变化，五脏六腑就随之而动。</p><p>若想不伤身体的五脏六腑，就不要动心，不要生情，性情平淡，降伏烦恼，淡薄五欲。这就需要用意识来调伏意根，保持定力，看破世事，减少欲望。比如有的人得了癌症，内心里无所畏惧也不担忧，癌症不久就消失，意根不执著色身，色身就健康；有的人则害怕担心，不肯放下摆开色身，不久就死了，这是吓死的，意根太执著色身了，导致病情恶化，反而丧失生命。由于意根对色身的执著程度不同，导致两种相反的结果。</p><p>在五蕴世间里，意识操劳忙碌，意根坐享其成，最后成就还在于意根。其实意根也在忙，忙着执取，忙着计度，忙着与轮回相关的所有的事。意根还是最操劳的，无始劫以来没有休息过，在一切法上也是意根最心喜和最担忧，最受震动，甚至能震动五脏六腑，翻天覆地。祂能让人心花怒放、茶饭不思、滴水不进、愁容满面、忧心忡忡、悲痛欲绝、撕心裂肺、悲喜交加、黯然神伤、气急败坏，最后吓得心惊胆战、惊慌失措、屁滚尿流，意根的烦恼该有多么重！</p><p>那么解脱时，祂该有多么轻松，如释重负，一旦重负卸下来，就是最轻松的时刻，身心都感到轻松自在，一块巨大的石头终于推倒了，意根终于获得了解脱。我们应该赶快断我见，去除烦恼，推倒巨石，化茧成蝶！拥有一颗解脱的心比什么都重要，世间苦恼多多，烦恼重重，按下葫芦起来瓢，六道里永远有苦恼。世俗法里形容心得解脱，轻松自在的形容词和成语非常少；而形容烦恼执著很重的形容词却很多，说明了什么？说明了世间就是苦多，充满着种种苦恼，所以应该就要看破世间，早日求得解脱，得大自在。</p><p>八、如果一个学佛人梦境多，那就要降伏意根的遍计所执性，通过意识心的分析思惟，说服引导意根，让意根不再贪执一切法，这样不仅不再做梦，平时白日里的妄想也能减少和消失。意识通过如理思惟，说服引导意根的过程，就是降伏其心的过程，通过正确佛法的如理闻思，如理的观行方法，把我见断除，之后才能真正的降伏其心，从而断除烦恼以及烦恼习气，我执才能断尽，意根不再执著五阴世间，得到解脱，修行才小有所成。</p><p>九、何谓依真修妄</p><p>因为有真心，才有妄心的产生，有妄心的行为造作。修妄，是妄心七转识自己参照真心的体性，来修正自己的身口意行，降伏贪嗔痴烦恼，灭除无明。并且随时随地把修行的过程和结果，作为种子存入真心里，让所有的修行都功不唐捐，未来世还会接续受用今世修行的果实。直至成佛，这些修行的种子都不失坏，善业种子累积圆满，清除了所有恶业种子，才会圆满成就佛道。</p><p>熏修佛法，修除妄心的无明，先熏意识心，意识学习明了真心的体性，再熏修意根，让意根也明了。然后二者都证得真心自性；再以后就能时时观察真心的运作，就会了知自性清静心在一切法的运作当中，是如何清净无染的，意识就会依此修正自己的心行，从而改变自己的心性，去除染污。意识在深入思惟佛法的义理，明了一切法的实质以后，就会熏染意根，让意根也改变自己的心行，去除染污和无明。</p><p>如果意识不进行深入思惟，或者根本就不思惟，那么了知的佛法只是在意识的表面停留，不会进入意根心中，内心实质就不会发生改变，心行也不能改变。意识如果不深入思惟佛法的真实理，就不能熏染意根，因为意根了别慧低劣，意识必须反反复复把道理思惟透彻，传递给意根，意根才能明了，祂不像意识那样容易明理，因为意识有逻辑性，了别慧非常强。</p><p>意根对六尘的细节了别慧弱，没有逻辑推理性，比较直性，意识就得把道理分析清楚透彻，分析得非常细致入微了，意根才能明了。否则意根就不能明理，思想无法改变；意根不改变的话，修行就得不到真实的受用，因为身口意业行是由意根作主宰的。所以很多学佛人学佛修行，只是口念经，不思惟佛法的真实义，意识和意根就不懂得佛法的真实义，那样既不能开智慧，心行也不能发生转变，烦恼不能降伏，无明仍然深重。</p><p>学佛最根本的目的是开智慧，不只是学知识，知识的累积也是生灭法，心行不改变，无明不破除，也仍然要处于生死轮回之中，不得出离。而这一切的修行，都是依着真心而修的，祂是我们修行的航标和基石。真如与佛性，是我们本自具足的，不从外得，祂本具一切善法，圆满无碍，所以不用我们去熏习改变。我们只要把七个识熏染成功，转变成清净的，消尽无明，我们就成佛了。</p><p>十、当我们能观察意根的心所法运行的时候，就知道意根的内心世界是相当深奥难寻、相当隐秘、相当丰富多彩的，祂相当的忙碌，相当的执著，总是计较攀缘不断，一时一刻也不停歇，一切法都要通过祂显现出来，祂的能动性和所缘方面也非常广泛，所以意根根本就不空荡。</p><p>意根时时思量，处处作主，意识所有的心行都与意根有关，所有心所法的运行都与意根有关，意识妄想不断，就是因为意根的思量不断，执著不断；六识的身口意行不断，就是因为意根执著攀缘不断，祂从来不肯停歇下来。</p><p>如果经常念咒熏了意根，意根习惯于念咒，就能不断的缘于咒语，那么睡觉做梦时也就能念咒，日常生活中也能念咒。如果意根不习惯于念咒，梦境里意识无论如何也念不了咒，行住坐卧时也想不起念咒。</p><p>修行以后如果把意根熏染训练好了，睡眠里也能修行，而且睡眠能检验一个人的修行程度。所以修行要想有成就，就要深入到意根；如果还没有深入到意根，只停留在意识心的表面，没有影响到意根，那个修行很肤浅，基本上就不属于真正的修行，学佛只是表面的摆设罢了。与人打交道也是，如果是意根用心，就是真心为人，对人以诚相待；如果意根不重视所面对的人事，意识的表现就会敷衍塞责，虚情假意应付了事，表面应诺，实际不办事。</p><p>十一、意法因缘生意识，意根和法尘相触，第八识就产生意识，意识触意根和法尘，就能知意根的意，而去了别法尘和造作。而意根是六根中的最后一根，是无色根，祂有识的体性，也叫作第七识，也称末那识。第八识是真心、真如本体，根据七个识顺次排序，取名为第八识。祂和七个识的体性大不相同，七个识只在五根六尘上起分别作用，其余的都是第八识的事，所以第八识分别根身器界种子，负责输送业种和四大种七大种子，造就众生五阴世间。</p><p>学佛修行首先改变意识心，因为意识心细能分析判断推理，受熏快，改变快。意根第七识就很难，祂是俱生我执识，从无始劫到现在一直没有间断过，具有很深重的烦恼以及习气，执著主要指这个心，改变祂，就要依赖于意识心长期熏陶。</p><p>修到成佛时，这两个识总共转变三次，就变成完全的智识了。第一次是入初地时转变，第二次是到八地菩萨时转变，第三次是临成佛时转变。之后前五识转变为成所作智，最后第八识转变为大圆境智，因为这时意根完全改变了，业种就完全转变为清净的业种，第八识就成为无垢识和大圆镜智。第八识所含着的前七个识种子都已经彻底转变清净，一点染污也没有了，第八识才彻底恢复自己的本来面目，这是真正的自己，不存七个识的染污种子。所以我们现在的第八识里都存有我们七识的染污种子和无明，需要净化七个识心，断无明，才能成为一尊大好的佛。我们现在只是理上的佛，有这个佛的体，还没有佛的用，在事上和实际上还不是佛，需要精进努力于菩提道的修行。</p><p>我们把八个识的体性都弄清楚，七个识都找出来，圆满了菩萨的条件以后，就能找到第八识真如，就能开悟了。找到真如后，智慧就会生起来，就可以观察祂在各个不同方面的功能体性，更多地了解祂的清净无为性，了知祂是如此如此地变生显现着一切法，那个观察智慧就会不断地增长，绝不是原地踏步。关键是找到的是不是真如心，符合不符合真如心的体性。如果那个心有生灭性，有变化性，有增减性，一会儿有一会儿无，需要不断维持才能存在的，那就是妄心，不是真心。这是极其关键之处。</p><p>十二、六七识的转识成智分为三个阶段，彻底转识成智在佛地，第一次在初地，六七识达到初步的无漏，还有漏没有断尽，需要用二大无量劫来断尽。初步的无漏，就很了不得了。在此之前，意根都是有漏有烦恼的，在此之后，还有烦恼习气。而意根的烦恼，意识心往往不知，意识心就会认为自己已经有修行了，实际上是个错觉。意识自己暂时不呈现烦恼时，就认为自己很好了，其实意根的烦恼，意识心并不知道，意根的烦恼根深蒂固，隐藏的非常深，不容易发觉，而且是在意识转变之后才能发生转变。所以不要认为意识变好了，自己就好了，别忘了还有意根没有转变。</p><p>十三、改掉习气烦恼，都需要意识先明了意根有什么样的烦恼习气，有什么危害性，然后把烦恼习气的危害性告诉意根，让意根了知，不断的熏习意根，一旦意根明了，就能改掉烦恼习气或者压伏烦恼习气。</p><p>如果烦恼习气太重的话，就很难降伏压伏，何况改掉。在人世间熏染的时间越长，烦恼积习越重，意识越不容易明理，意根就更不容易明理，想改掉任何一点点习气都很难。所以修行趁年轻，不要等年龄大了再修行，年龄大了真不好修行，习气固定下来了，能认识到有习气都不容易，更何况改变习气了。</p><p>十四、意根从无始劫以来一直存在着，未来也永远不灭，除了阿罗汉入无余涅槃时把祂灭掉，所以意根也是生灭的、无常的。因为意根是作主宰的心，众生的身口意行就由祂来指使，如果祂无明深重，贪嗔痴炽盛，对于自我的执著强烈，那么众生就会造作贪嗔痴的染污业行，结果就是六道轮回，生死无期。</p><p>意根比意识难于改变，因为从无始劫以来祂一直存在着，经历的时劫太久远，被六尘境界熏染得太深了，加之本来而有的无明烦恼，其染污极重。而意识是后天才出现的，每生每世都是新的，没有先天的无明烦恼，都是新受熏染的，祂既受意根先天的熏染，也受后天环境的熏染。因为意识慧力比较强，能善于分别一切法，因此容易被熏染和转变，意根就难被熏染和改变，断掉意根的我执就很困难。修行就是要彻底改变意根，使意根彻底清净，断尽无明，才能彻底得解脱和自在。</p><p>十五、意根触法尘时，如果意根想清楚了别，就起抉择，第八识依意根的抉择而生意识，意识就去了别法尘；意根对法尘如果不想清楚了别，就不作意不思量不抉择，意识就不能出生，这就等于把意识关闭了。关闭意识实际上是降伏了意根，意根改变，一切都改变。</p><p>修法修到意根才究竟，证到第八识才是大乘修行的开始。找到一切法的开关是关键，意根是开关的控制者，当开关闸门被意根打开时，一切法就会汩汩而出，全部现起。这时就需要我们降伏意根，别让祂把开关开得太大，细水长流才好。虽然如此，当业种不改变的时候，意根还是不能完全控制得了开关，成熟的业种就会打破意根的幻想。</p><p>如来藏刹那刹那输出意根的识种子，意根才能存在和运行，祂才能攀缘，才能执著。意根的攀缘，实质还是攀缘祂自己，祂把一切法都当成是自己和自己所拥有的，因此才执著不舍，如果祂知道这一切法都不是自己，都不属于自己所有，祂的执著性就断，生死也就了断。再以后就靠发清净大愿，才能维持虚妄生命体的存在和运行，不断地自利利他，直至成佛也不休息。</p><p>所以说，能够证得一切法都不是我，这是最关键之处，也是众生修行的终极结果。彻底无我者，佛也！我们只要能证得无我而且是究竟无我，就能究竟解脱。所谓的我，无始劫以来，把我们捆绑得死死的，所以我们活得太不自在了。要想挣脱束缚和枷锁，就要断除我见，灭掉我执，当一法也不执时，就是大解脱大自在了。但是说起来容易，做起来需要无量劫的时间，需要我们有耐力，具有坚韧不拔、勇往直前、百折不回的果敢精神和大智慧，才能早日到达究竟无我之地。</p><p>十六、一般人的意识心都比较散乱，这种散乱的原因在于意根。因为意根所缘比较广泛，无始劫以来，意根就没有定，散乱惯了，所以祂有一种散乱攀缘心，哪有事哪到，刹那刹那转换攀缘的目标，没有固定的目标，四处游移。比如说我坐在这儿很放松，并没有特别重要的事要关注，意识一会儿注意色尘、一会儿是声尘、香尘、触尘，一会儿又去想与当前境界不相干的事，这些都是意根作意引导意识的结果。既然都是些不重要的事，意根是如何作意的？这是散乱作意，习气惯性使然，完全无规律，是随机性的。</p><p>意根随时缘如来藏变现出来的一切法，因为无明，无始劫以来对六尘攀缘习惯了，这种攀缘的习性根深蒂固，一时很难降伏。在无所事事的时候，意根就到处攀缘，不自觉的作意于色声香味触法。因为这些境界目前来说都不重要，意根对这些法的作意都不用专注，不会长久，没有固定的目标，往往是接触到什么就思什么，六识就随之东游西逛，无有定所。意根这个野孩子长期无人管教，散漫惯了，只有意识接受正规教育，拿鞭执杖，软硬兼施，连哄带骗，才能一点点管教好。内心一点也不散乱时，也就修到四果了。</p><p>十七、问：经常有这类的体验，打坐时，有时身上出现皮痒，意根决定瘙痒，意识决意坚持不去瘙痒，与意根对抗。于是坚持了下来，直至皮痒消失。这对于调伏意根是否有益？</p><p>答：这是在意根不是很执著的情况下才能这样的违拗祂，不至于让祂精神分裂和崩溃，如果意根执著性很强，就会受不了，那就要采取迂回曲折的路线，不能强拧。在意根能够接受的情况下，意识不随顺意根的烦恼性，不去执行意根的不如法指令，意根就会反思自己，有可能就知道自己不对，就会放弃不如法的思想观念，调整自心，改变自己。当意识不随顺意根去抓痒时，意根拗不过意识，也就不攀缘或者少攀缘身根，以后就不在意色身的各种反应，执身轻微，禅定就能渐渐出现。意根养成习惯以后，就不在意色身，很容易忘身，能减少执著，禅定容易成就。</p><p>十八、降伏其心的目标是降伏意根</p><p>面不改色心不跳的情况，是意识接受信息以后，而意根不接受不在意，所以面色都不改，不往心里去，就是不往意根心里去。左耳进右耳出，也是说意根不在意，不往心里去。俗语说的大罗卜脸不红不白的，意思就是说别人怎么说，意根也不动心，脸色就不会变化。所以真正动心的还是指意根，意根一动，心念就出现，身心就有反应，面色就变化，这叫心动动心了。</p><p>降伏其心的心，是指意识心还是意根，还是二者同时都有？首先降伏的是意识，后降伏意根，降伏了意根才是真正的降伏，究竟的降伏，才达到目的了。修行从降伏意识心的贪嗔痴的念头来入手，由此逐渐深入，慢慢熏染转化而降伏意根的贪嗔痴，二者都降伏了，才是完全的降伏。只降伏意识没有用，意根如果要指挥意识贪嗔痴，意识也没办法，也要服从。</p><p>贪嗔痴对身心世界的毒害作用，其实都是意根所起的烦恼，才影响到了身心，使得身心出现不良反应。意识单独起烦恼，对身体几乎没有什么影响，意根一起烦恼，那就不得了，一筹莫展，吃不好，睡不安，容易上火，气色血色都能改变，显得焦躁不安，身体疾病都能出现。所以最犟最有力的牛还是意根，祂太有力度了，还有权利，能作指挥，只有降伏意根的烦恼才是真正的降伏烦恼。</p><p>十九、漏，就是有贪嗔痴烦恼，无漏，就是无贪嗔痴烦恼。六识都有贪嗔痴烦恼，意根也有贪嗔痴烦恼。如果意根的贪嗔痴烦恼不断，就要指挥六识造作贪嗔痴业，六识就不能无漏，所以无漏主要是指意根的无漏。从这里看出，改变意根，是多么的重要。</p><p>如何让意根守戒呢？意识就要修学佛法，懂得戒律的作用，知道守戒的益处，不守戒的后果，然后不断的分析思惟受戒守戒的种种功德，思惟不受戒不守戒，要有什么样的苦果，以此熏染意根，让意根明白此理。意根一旦明白，就会主动受戒和守戒，那就是真正的受戒和持戒了，而不仅仅是意识口头上的假受戒持戒。当意根没有被熏染成功时，祂就不想受戒，也不想守戒，有时也被动的受意识的唆使去受戒，但绝对不会守戒。当意根不懂因果时，也绝对不会自动自觉的守持戒律，意识就得强迫意根，这叫作压伏意根，意根不是心甘情愿的。初受戒时，就要这样强制约束自己（意根），以后意根明理了，才会自动守戒而不犯。</p><p>二十、有修行的人即使在梦里遇恶缘，也知道守戒，不造恶业，这是修行真正得力的人。梦里的身口意行更能体现一个人的修行程度，梦里能作主不造恶业，中阴身就有一定的把握。梦里意识心的控制力较弱，意根的习气完全占主导地位，如果梦里意根没有习气烦恼染污性，就说明此人的修行，已经熏染到意根，意根得到降伏了。因为梦里的意根就是梦外的意根，就是白天的意根，意根不睡觉，不灭去，是连续性的，因此平时的修行就能影响梦境。</p><p>意识如果修行非常好，意识就知道自己在梦里，也就能抵制意根的染污性，不造作恶业。所以说真正的修行，应该能改变意根，没有修到意根的，修行还不得力。很多人连意识都没有熏染成功，意识还光明正大理直气壮的造恶业，五戒还不想守持，那此人还没有开始真正的修行，还是一个初学佛者。</p><p>二十一、催眠的作用</p><p>众生有五盖（贪欲、嗔恚、睡眠、掉悔、疑惑）的遮障，障碍初禅定的发起，这是意根的五盖心结对禅定的障碍，当意根心结解开了以后，遮障消除，禅定就生起。其中有一个睡眠盖，虽然不属于意根的盖，意根没有睡眠现象，但是睡眠是由意根抉择发起的，由于意根贪爱享受和懒惰，祂会促使意识贪睡眠，从而遮障意识的清明，就会遮障禅定的发起。所以降伏意根，让意根明理精进修行，就会去除睡眠盖。</p><p>打开心结可以用催眠的方式，催眠的时候没有意识的遮障，意根能够面对自己，把自己的心结陈述出来，然后在催眠师的引领下，通过忏悔等形式解开心结，内心顿时就轻松下来，像是卸掉千斤重担一样。</p><p>在平日里意识要面子，不肯面对自己，遮障意根发露自己内心的结缚，结缚就不能解开，而意根心直不要面子，有什么就道什么，如果相信催眠师，就能被降伏下来，从而改变自己，消除业种业缘，解决问题。有些人心结非常多还爱面子，通过意识这关过不去，意识卡着，不让他人窥探意根里的东西，只能通过催眠的方式，减弱意识的遮障，解决他们心里内在的问题。所以表面忏悔是意识的忏悔，意根没有忏悔，业种就不消失，意根觉知到了，忏悔以后业种才消失。</p><p>把意根的无明一个一个都解决了，那成佛的道路走得就快了，也就用不着看那么多的佛经，辛苦的背诵三藏十二部，坐在这里就能把心里的结解开，无明一点点的破除，神通也出现了，道力也增强了，成佛就快了。</p><p>二十二、作主的永远都是第七识意根，如果意根能随顺于理智而有智慧的意识，然后再作主，其结果就是善，意根就被善的意识、智慧的意识熏染了改变了。如果在梦中意根还能作主不造恶业，行善业，更说明意根被善所熏染了，因为梦中的意识没有白天的意识清醒，对境界的了别和自我的把捉就不确定，理智性较差，这时意根还能单独作主不造恶业行善业，说明修行相当好了。在中阴身里，意识的理智性更微弱，意根都是依赖自身固有的习性来作主投胎，如果这时身口意行都与善相应，没有烦恼和恶习气现前，其修行就更好了。</p><p>意识势力越强大，了别分别的越清楚，越有理智，意根越容易随顺，有可能不按照自己的习气惯性去作主行事。反之，意识势力微弱，了别性不清晰，理智性不强，不能正确如理指引意根，意根就按照自己的习性行事。如果这时候还能做得好，那就说明意根有好习性。如果使用催眠术，让意识微弱下来不去控制意根，意根就会通过意识说出很多内心里的秘密。吸烟喝酒吸毒也是麻醉意识心，让意识无法调控意根，意根就会表现出自己的本来面目，大多数人意根的习气都是恶习多，这时就容易做坏事。</p><p>意根已经得到改变转识成智的人，比如地上菩萨，或者八地菩萨以后，即使再喝酒吸毒也不会造业，因为意根已经清净了的缘故。地上菩萨六七识都转识成智了，都是清净的，清净的意识就不受环境恶熏，也不能恶熏意根。意根转变的程度不同，习气现行的程度就不同。</p><p>二十三、如果想让梦想成真，只能由意根来推动，让意根发愿，让意根不断执取梦想，意识就会努力精进想办法，第八识就能实现梦想。意识心的妄想不断地熏意根，意根受熏以后，就有了意愿，第八识了知到意根的思心所，在因缘条件具足时，就会随顺意根，实现意根的意愿。意根如果不受熏，意识如何妄想也没有用，一切法都由意根推动而由第八识实现，因为第八识有种子，能生长一切法。</p><p>二十四、吸毒受了恶报，意识思惟说这不好，决定不能再吸毒了，心里的想法意根了知了以后，就决定不能再吸毒了。有时由于业力的作用，意识的决定没有用，意根还是按照自己的习性选择吸毒，直到真的受不了为止，意根才决定不吸毒了。有很多人，必须是受到极大的恶报和打击，才能改变自己，这是因为意根真真实实的感到了危害性，受到了触动，这是现量境界，已经到了黄河边，才死了心。</p><p>喝酒麻醉了神经，法尘不能正常传导到胜义根里，意识对法尘的了别就不正常，思惟分析功能减弱，智慧力低下，没有理智，无法正常调控意根，遇事时意根直接作主决定，做的决定往往都是错误的，六识执行起来都是错误的行为。另一方面由于神经麻醉，意根的指令无法完全传达到全身，身体的协调作用就差，六识的反应也不好，身口意行为就显得不正常。</p><p>二十五、意根无始劫以来就是自私的，是完全个人主义者，时时处处都执我。我们可以时常给意根分析分析，自私到最后，又能获得什么？除了生死轮回苦，还能有什么？长年累月、日以继夜的攀缘，又攀缘出什么了？除了生死还是生死，最终一无所得，我们无量劫来都得到了什么？除了业障就是烦恼。</p><p>意根在没有证得无我的时候，肯定害怕生死，祂也没有证得无生死的那个东西，因此还有我执。意根只有实证到三界万法确实是虚妄无我的，在甚深禅定的作用下，祂才能死心，从而断除我执。没有证得无我，没有证得真我的时候，都是意识心的理解，理解只起压伏烦恼的作用，没有力量斩断烦恼。意识心的压伏，就像石头压草一样，有一天把石头拿开时，草就会疯长起来。只有摆事实讲道理，才能折服意根，祂要听详细的道理，太粗略的法祂无法理解和接受。要断除烦恼，必须在断我见以后，在各种境界当中修行，当境界现前时，烦恼就能探头显现出来，这时候就需要智慧的利刀，毅然斩断，烦恼就灭除了。如果烦恼不出头，总是在心里隐藏着，就不会连根拔除，以后还会生长。</p><p>修行能抓到意根时，就能非常快速，这是大捷径，还在意识心上做文章，搞动作的，离道还远。多回光返照自己，定力不足，应该多修定；基础不牢的，还要多打基础，不能搞急功近利，基础不牢，将来楼房大厦就会倒塌。修行不是跳跃的事，也根本跳跃不得，要一步一个脚印的走，踏踏实实的走，千万不要急功近利，那是空中楼阁。我们宁可晚几年悟，也不要摘生瓜蛋子，捂熟的瓜吃不得。踏踏实实修行，就能降伏烦恼，降伏慢心，一旦开悟，以后的路就走得很快，不容易跌跤摔倒。</p><p>修行的根本目标就是要降伏自我，如果修行是为了让自己高人一等，强于他人，那就背道而驰了。有个我比他人强，比他人胜，这样的慢心很重，肯定要造恶业，结恶缘，将来自己受报受苦恼。总希望自己比别人强，一定要高人一等，一定要超胜于人，那就是个我，不降伏这个我，以后的修行就有很大的阻碍，慢心会严重障道，以至于长期都是停滞不前，很是苦恼。</p><p>意根的慢，往往表现为：你们看我多能，看我多出色，看我多厉害，看我多了不起，我的名闻利养多丰厚，我的权利有多大、徒众有多多……慢心都表现出来了，这就会严重的障道，不得无我的解脱果德。看清意根，多管教意根引导意根，修行才走上正路了。</p><p>二十六、什么时候最容易熏染意根</p><p>梦中不能只有意根，没有意识，否则也不知道有梦了，知道有梦的知是意识，能思考且能被知的是意识心，意根的思量性一般人的意识观察不出来。证得意根还是比较容易的，观察意根的运作是很困难的，比观察如来藏还难，意识与意根扭在一起，太难分开，无数人只能观察到意识，观察不到意根，讲意根的法，这些人就说是意识的，智慧太欠缺了。</p><p>为什么在快入睡和快睡醒时，容易发现意根，容易熏染意根，容易与意根相应，容易观察意根？因为这时候，意识的了别性弱，少于现行，对意根没有遮障。</p><p>半夜睡着了，放录音也可以，因为意根不睡觉，如来藏通过耳根，把声尘不断的传导到胜义根里，意根都能了知，只是分辨得不太清楚而已。如果声音太大，意识就要醒过来分别声音。</p><p>二十七、知道了某个事情，学了某个法，需要消化一段时间，这是为什么？意识知道的事情，需要慢慢渗透到意根那里，让意根也了解了解、思量思量、理解理解、明白明白。意根还没有明白，就不是真明白，事情没有被消化吸收。</p><p>每件事每个法要想真正的被理解和消化吸收，需要一些时间让意根去考量和理解，这叫作缓冲。定力越好越专注，意根越容易理解，消化吸收的越快。所以世间一切事情发生的太突然太急，意根没有心理准备，不能快速消化这些事情，内心就会感到震惊，接触的多了，时间长了，意根有了心理准备，就会泰然接受，不再感到震惊了。</p><p>由于突然的事故，吓得魂飞魄散，深深的惊吓到意根了，不仅惊吓到意识。由于意根的惊吓，祂就没有了任何对策，无所适从，轻一些的是呆呆发愣，重一些的精神失常，最严重的反应是魂飞魄散，以至于吓死了，死后也很难正常投胎。</p><p><br/></p></div>"
},{
    "title": "第八章　现行熏种子种子熏现行",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p>第八章　现行熏种子种子熏现行　　　　　　　　</p><p>一、意根从无始劫以来一直没有断灭过，无始劫以来的贪嗔痴烦恼以及习气一直带到现在，还会带到未来世，祂能主导我们身口意行，让身口意现行贪嗔痴烦恼。而我们现在的一切身口意行也会熏染意根，增加意根贪嗔痴性，未来世的烦恼就更重，这是现行熏种子。所以我们应该小心现在的身口意行，学会反观自心，不要再让恶法来熏染意根，要多用善法来熏染改变意根，这才是真正的修行。</p><p>熏习，首先是意识心受熏，然后去熏染意根，改变意根，这是现行熏种子。另一个是意根熏意识，让身口意按照意根的习气惯性现行，这是种子熏现行，世间法出世间法都如此。可以利用这点，多熏修佛法，让如来藏里都收藏善业种子，将来现行的都是善法，将来才能圆满佛道。</p><p>熏习也叫作影响力，也就是潜移默化的一种力量。比如夫妻二人长期在一起接触，各自的如来藏总是摄取对方的影像，落在心识中，心识就受熏，与对方的影像相像，最初看不出来，时间长了，两人的面貌就相似。因为像由心现，心被熏改变了，面貌也会变。语言表达的方式会逐渐相近，饮食习惯也相同，乃至行为举止也可能相像。这一切在不知不觉中就被熏染被改变了，这是后天的熏习。</p><p>那么我们为了让自己面貌变得庄严，可以经常观佛像，如来藏总是摄取佛的影像在心里，心慢慢就会受影响，面貌就庄严了。像由心生，心改变，像就改变。如果我们总与有德有道的人接触，言谈举止也会随学过去，德行就变好。孟母择临而居就是为了让孟子熏习善法，不熏恶法。那么我们熏习大乘佛法，理虽然很深，但是法种已经落到心里，早晚会开花结果，获得丰收，这就是现行熏种子的原理。</p><p>　　二、众生在做每件事情，历缘对境的时候，意识心经过理性的思惟，理智的觉得如此做应该是合理的。可是意根就是要按照自己的固有习气去做，意识说服控制不了意根，结果意根还是照做不误。做完之后就后悔，这是意识的后悔。意识过后就要分析，刚才那样做，有什么后果，有什么利害得失，会产生什么不好的影响。这个分析内容，意根都能了别到，然后生起思心所，思量这件事对自己有什么利弊，思量之后也许同意意识的意见看法，然后改正自己，也许不同意，仍然固执己见。</p><p>　　同意意识的分析判断时，意根心里就觉得那样做是不对，刚才是有点儿冲动了，不如冷静一下再采取行动，这时候就后悔了，可是悔之晚矣。这个悔先是意识心的悔，后是意根的悔，如果意根不悔，意识悔也白悔，以后还是要犯同样的错误。如果意根不同意意识的分析判断，此人心里就会一面（意识）感觉不太对，一面（意根）还不在乎，给自己找各种理由和借口，为自己辩护。当然具体找理由和辩护的是意识，还是受意根的支配去找理由和辩护。</p><p>意识在做每件事情的时候，虽然是受意根的影响和支配，但是意识还受后天环境的影响，受了后天环境影响之后，就想改变自己的心行，其实是改变意根的心行。如果意根不愿意听从意识的意见和看法，不受意识的熏陶，那就不肯改变固有的习性，做事情时还会一如既往，心行不发生改变。如果意根自己的主张太强烈了，习性太重，以至于意识起不了多大的作用，全是意根的任性而为，那么这个人就缺乏理智，意识心的观慧、了别慧就不能起作用。这个人就会常常冲动的做事，控制不住自己，事后才后悔，可是已经铸成大错，悔之晚矣。</p><p>三、五阴身大大小小的一切事情都是由意根作主，意识的想法观点只是一个参考，意根可以随顺，也可以不随顺。意识慢慢熏染开导意根，才能改变意根固有的习性。我们学佛也是如此熏染意根，意识通过接触一些佛法修行之理，觉得应该降伏一下自己的烦恼，不能总让贪嗔痴烦恼现行出来。可是对于降伏烦恼的甚深之理，意根还不懂，也许还不知道自己有烦恼，仍然会促使意识把烦恼现行出来。当意识反观到生起烦恼有很多过失，就决定以后遇见什么事，再也不要发火生嗔了，这样会火烧功德林，又造作了业行。可是每次遇见不如意的人和事，意识还是照样发火，根本就控制不住。</p><p>这是因为意根的业力很大，而且又是作主的心，祂有烦恼决定要发火，意识就没办法忍住不发火，尽管过后又后悔。后悔时就想，下次再也不要这样了，可是下次还是照样发作，直到命终也没有控制住嗔心。这是因为意根还没有得到有效的降伏，就会促使意识遇缘就发火生嗔；意识也没有进行耐心细致的思惟，没有熏染到意根，意根就不明理，心行就要随顺于烦恼和习气，这就是业力。业力就是业种之力，也是意根之力，意根改变，业种就改变，业力就改变。</p><p>又比如说，学佛以后意识知道五阴自己是生灭变异不真实的，六尘境界是虚妄的，心里总是在说：一切都是假，何必执著。同时对他人也说一切都是假的，再也不要执著了。可是口里虽然如此说，也喊着要放下，等到做起事情来，就什么也不假了，什么也放不下都要拿着，实在是没办法。因为做什么事都是意根作主的，意根不知道五阴虚幻，那就没有用。再加上意识本身也没有真正明白自己的五阴身如何是虚妄的，没有做过深细的思惟，自己也糊里糊涂，就没有任何证据拿给意根，意根也就没有被熏，不懂得虚妄之理，那就还会认假为真，还会作主按照从前的业力惯性来行事。</p><p>意根只认事实和现量，有理有据，祂才能明理，才能改变业力和扭转惯性。身口意行如何现行，是由意根作主说了算，意根要执取一切法，意识就控制不了。意识也没有常常地熏习种种道理，并且没有进行深细的思惟，意根并没有受到熏染，因此意根就不会发生改变，仍然会随顺于业力而现行身口意业。</p><p>我们学佛要想改变意根的烦恼习气，就要把意根当作孩子，常常进行耐心细致的思想教导。告诉意根，这件事如果这样做，会得到什么果报，那样做会得到什么果报，为什么会得到不同的果报。这件事如果这样做，有什么好处，那样做有什么不好之处。到一定时候，意根终于明白了，就会说：哦！原来是这样啊！以后就要如何如何做，再不要那样做了。于是以后再遇见同样的事情，意根的心行就改变，六识的身口意行也就改变了。他人看见了就会说：这个人跟从前不一样了，好像换了一个人似的。</p><p>任何人只要真正地明了了道理，就会按照正确的道理去行事，虽然短时间内还不能完全做得到，但是已经有了决心，想要改变自己，这就可喜可贺了。所以我们要想把佛法学好，意识心就要常常如理思惟正确的佛法，比如思惟五阴十八界如何的虚妄，如何的无我，思惟观行的越细致越好，越深越好，越耐心越好，这样意根就容易被教导成功。这个孩子从此以后就会变得乖乖的了，再也不惹事造恶业，再也不任性执著，而是降伏了烦恼逐渐清静无为了。那么我们的修行就得力了，再以后的修行就会一日千里，不可阻挡。</p><p>四、看见茶想喝茶时，这个想喝的心是哪个心？一个可能是意识，一个可能是意根。首先意识因为今世喝过茶，了解茶水的营养作用，就把喝茶的想法传递给意根，意根了别以后，就可能同意喝茶。在品茶的过程中，意识把觉受传递给意根，意根也就了知了，心里受熏，也喜爱喝茶，业种就存入如来藏中，这是现行熏种子。</p><p>前世有喜欢喝茶的业种，今世遇见茶，意识了别以后把信息传递给意根，意根就想喝茶，于是就促使六识泡茶倒茶喝茶，这是种子熏现行。如果前世不喜欢喝茶，业种存在如来藏里，今世遇见茶，别人劝喝茶，可是意根不喜欢喝茶，没兴趣，这茶就喝不成。一切大小事情都是意根作主，意识的意见看法只是一个参考，意根可以随顺也可以不随顺。</p><p>意根如果是不感兴趣喝茶，别人怎么劝也没有用，意根就是不做决定，意识也就无法喝茶。但是如果意识长期处于喝茶的环境，一点点熏染，也尝试着喝一点，就会越来越喜欢喝茶，同时就会熏染意根，意根也喜欢喝茶，业种就改变了。</p><p>五、意根的差别才导致了意识的差别</p><p>圣人到此五浊恶世，意识心为什么不容易受熏染？佛的意识心为什么一点也不受熏染？意识受不受熏染，主要在于意根的力量是否强大。圣人的意根没有烦恼，他的意识依靠意根就没有烦恼，也不容易受环境的熏染，佛陀的意识根本不会受染污，如莲花处淤泥。凡夫的意根无明烦恼重，对意识的熏染就重，意识很容易就生起了烦恼，地前菩萨也差不多如此，只不过能稍微好一些。但无论是圣人还是凡夫，五蕴身刚出生时，意识都是平等的，都是一张白纸，纯洁无瑕，之后才被自己的意根熏染带动，行为表现就不一样了。然后再受环境和父母等其他人的熏染，意识的行为表现就更不一样了。</p><p>同样的意识本没有差别，在同样的环境污染下，为什么佛和圣人的意识不被熏，凡夫的意识就被熏了呢？是环境的差别，还是意根的差别？咱们先不说转识成智以后，就说说在小孩子的时候，和没有学佛的时候，意识为什么有那么大的差别？同处一个染缸里，为什么一个严重被染变坏了，贪嗔痴炽盛，另一个仍然能保持清净，洁身自好？只有一个解释，意根的差别导致了意识的差别，仅此而已。</p><p>意根如果先天没有贪嗔痴，后天的意识就能被熏成贪嗔痴模样，那就奇怪得很。如果是这样的话，佛的意根没有贪嗔痴，生在五浊恶世里，意识也应该能被染成贪嗔痴，那修行还有什么用？所以意识之所以具有贪嗔痴，完全在于意根有贪嗔痴，如果意根没有贪嗔痴，意识无论如何也不能被熏染成贪嗔痴。意根转识成智以后的菩萨，处于染污境中，其意识也不会熏染贪嗔痴，其菩萨的果位就不会退，不会变回具有贪嗔痴烦恼的地前菩萨，不会退回到三果和四果向之前。</p><p>每个人的差别不在于一生一世，一生之中，不至于积累出多大的差别，差别是生生世世累积出来的。所以众生之间的差别，就在于意根，是意根的差别导致了意识身口意的差别，导致了意识的智慧差别，导致了福德和禅定的差别。由于意根的差别，导致了意识各个方面的差别，认识问题的智慧也大相径庭。意根的慧非常重要，属于五蕴前世的资产，叫作慧根。意根如果没有很好的智慧，我们前世修行都白修，前世熏修的那些佛法和世俗法也都白熏修了，不能带到今世受用。</p><p>六、六识的行为是由意根主导作主宰的，意根的烦恼染污性如果没有被降伏下来，身口意的一切行为还是由意根的烦恼习气作主导。意识想掌控自己的身口意行却做不到，因此看到自己不如理的身口意就会羞愧和自责，实际上还是责怪意根，只是意识不懂这是意根的问题，以为是意识自己的问题。如果是意识自己的问题，意识觉悟到就能马上改正，并不困难。但对于意根的问题，意识有些时候就会感觉束手无策，只能多学法，多明理，多掌握一些善巧方法说服和熏染意根，意根的烦恼习气才会慢慢有所收敛。</p><p>我们现在所遭遇的一切，大多数都是无奈的必须要承受的，是自己的因缘果报，躲避不了，也选择不了，需要被动的接受下来。在我们的际遇和遭遇里，也有一些偶然因素和突发事件，致使我们能够主动和被动的改变因果。修到一定程度，就有能力控制和改变因果，那时身心就比较自在了。</p><p>七、当业力现前，是意根在造作，在控制一切，不会给意识一点辩解的机会，事情就发生了，可是事情过去以后，是谁在后悔？</p><p>事情过后，意识先后悔。因为意识能够观察分析自己的身口意行为，知道对与不对，才会后悔。意识后悔的内容，意根同时能了别到，如果意根认可意识的后悔，自己就后悔刚才的身口意行，那么意根以后就能改正身口意行；如果意根不认可意识的后悔，那么意根就不会后悔，就会一如既往，不改变自己的身口意行为，意识的后悔就没有起到应有的作用，照样还是要随顺意根的习气。</p><p>八、种子熏现行，意根无始劫以来所受的熏染，带到这一世，就能熏染六识的身口意行，让身口意行按照意根的无明习气来造作，与意根习气相应。比如一个很有修行的人这一世出生，从小就是心地善良，心性清净，乐善好施，乐于助人，无论周围人群恶行多么严重，自己也不随顺造恶行，仍然是按照自己（意根）清净的无染污的习性来做人做事。又比如一个外道，前世熏习外道的断灭空，今生来到佛法中修行，无论怎样被教导大乘的如来藏空理，可是内心（意根）就是不受熏，仍然与外道的空相应，不肯改变。</p><p>定性声闻，由于前世心量狭小，只想个人离苦得乐，出离三界得解脱，不管众生生死苦。世尊用殊胜的大乘法熏染他们几十年，他们还是不喜乐于大乘，不肯改变自己的狭小心量，不回心于大乘，仍然追求无余涅槃，灭掉一切法，甚至在世尊涅槃之前就取得灭度。这是由于阿罗汉的意根受小乘的熏染时间太长，种子根深蒂固，很难改变。</p><p>所以如果一个人福薄，缘又不好，学佛时只信小乘法、外道法，甚至是永远不能悟道的邪法，熏修下来，种子存在如来藏中，后世即使再遇正法，也很难被熏，仍然会按照从前的不正当方法来修行。就像一张白纸已经涂抹得很严重了，无论怎样擦洗，也擦不干净，没法再画出一幅好画了，还不如一张空白纸，容易涂抹绘画。那么我们的修行一开始就要选择好所修的法，不能走错路，学错法，避免不正确的法种子存到如来藏中，让自己多世沦落生死。</p><p>九、意根没有断除烦恼和习气时，理智性很差，就显得天真幼稚和情绪化。意识既有理智，也有情感，其情感和情绪色彩也与意根的习气有关。因为意识能清楚了别法尘，作以理智的思考分析，能正确作抉择，这种理智性就可以熏陶意根，从而改变意根的习气。意识有苦乐受，因此就带有情绪色彩，能生出情感，如喜欢和厌恶、仇恨等等。比如遇见过去世的亲人时，业种现行出来了，意根与业种相应，有贪习，就促使意识不知不觉表现出欢喜和贪恋的情绪，但心里并不知道为什么会如此，因为不是意识经过思惟分析而认知的人，毕竟不熟悉，是由意根操控出来的情绪，意识就不知道原因了。</p><p>十、每一世的意识都是新出生的，未修神通时，不能与往世经历相应。意识没有往世的习气，只有当生当世的习气，到临终时习气就随意识而灭。意根有往世五阴的习气，有无量劫五阴的烦恼习气，与习气种子相应。意识身口意行的习气出现时，往往表现的是意根的习气，是受意根熏染和支配的结果。</p><p>意识不与业种相应，意识的表现与业种相应的时候，也是意根的习气，是意根作主主导出来的。意识一方面受现实六尘境界的熏染，另一方面也受意根无始劫以来的习气熏染。如果意识有定力和智慧，在意根的烦恼习气现前时，就能理智的思惟、分析利弊，然后控制意根的烦恼习气，以改变意根。意根的抉择一旦改变，意识的理智就熏染到了意根，意根真正改变时，业种就改变，以后意根就不再现行此种烦恼习气，这样意识的现行就熏了种子。当初意根形成抽烟的习惯时，也是受意识所熏染的结果，现在要去掉抽烟的习惯，也靠意识的熏习和改造，成也萧何败也萧何。</p><p>十一、明知赌博玩游戏不好，可还是去赌去玩。明知是意识明明白白的知道；故犯，是意识不得不去做，因为意根好赌的习气惯性很强，一定要胁迫意识去赌博，意识明白不能赌，但没有办法只得服从。所以有些道理我们停留在意识心的肤皮上是没有用的，意根这个内心不接受不了知，心行是不会改变的。</p><p>我们平时就不能只搞口头禅玩弄口舌，还应该深入思惟其中深刻的道理，思惟的过程就是让意根明理的过程，意根一但明理，心行就改变，修行就成功。口头禅很多人都会说，可是实际做起来，有几个人能做到。口头禅就是意识，实际作主的是意根，意根要怎样做，六识就得怎样去做。所以遇事多动脑筋思惟，思惟清楚了，再去采取行动，意根的决策才有可能不会错。</p><p>十二、种子熏现行</p><p>婴儿刚出生，意识是全新的，还没有受后天环境的熏习，却喜欢温暖干爽的环境，这是展现的意根的与生俱来的习性。意根缘于身根，了别身根触尘情况，知道温暖干爽的触尘是舒服的，凉冷潮湿的触尘是不舒服的，就让意识出现相应的反应，舒服的环境就安然入睡，不舒服的环境就会哭闹不睡觉。意根的这些习性生生世世养成的，祂对环境的反应和抉择，如来藏立时了知，就会配合出生六识来展现意根的情绪，因此六识的身行就是意根主导的。</p><p>六识的表现就是意根的思想和心行的体现，往世的种子成为了现行。众生所有的业种都由如来藏收藏，由如来藏输出，现在的身口意行造作之后，传递给意根，然后经由如来藏收藏，意根的一切心行也作为业种，由如来藏储存。将来种子成熟时就由如来藏再输出种子，当然是存什么就输出什么，种子就变成现行了。</p><p>十三、意识与意根的思想斗争</p><p>有理智有觉悟的人，经常会发生意识与意根互相斗争较量的情形，尤其是学佛以后，意识学了一些佛法知见和世间法的真实理，有些觉悟了，不愿意再顺从意根烦恼习气，对意根的烦恼习气有些厌恶，想要违拗和反抗，尤其是持戒和修忍辱行以后，更会发生二者有所冲突的矛盾现象，发生互相交锋抗衡的现象，这是意识的理智与意根的恶习气之间的较量。</p><p>意识懂得了一些做人和修行之理，就有了理智，有了自己新的想法和观点，而意根还是处于自己历劫以来的恶习之中，没有摆脱出来，还是要固守烦恼习气。由于二者思想观点不一致，做事时就要发生冲突，内心里僵持一下。如果意识有说服力就能暂时占上风，意根就要按照意识的想法作决定，意识要想永久占上风，就要彻底说服降伏意根，意根要真正明白和赞同意识的思想观念，彻底转变了自己才行，否则在意识放松管制放松思想教育的时候，意根还是要按照习气惯性做抉择，六识就不得不执行。</p><p>当一个初学佛人，意根没有受熏，不懂学佛的益处时，一遇到逆缘，就不想学佛，而意识心已经尝到学佛的种种益处，因此就喜欢学佛修行，于是二者就发生冲突，处于僵持状态，意识就会对学佛这事犹豫不决不知如何是好。想学佛的一定是意识心，因为意识心已经明理了，而意根还没有明理，意识心通过学佛，通过与其他学佛人接触，知道学佛有很多好处，这是意识心的知，但是意根还不太明了这个理，所以遇到一点困难，意根就想退缩，决定不学了。</p><p>想不学的，是潜意识下意识的意根，祂暗示着意识心别学了。但是意识心因为明理了，可能要不顾意根的暗示，也可能会犹豫一些，多考虑考虑，所以这两个心时常在作斗争。所谓的斗争，就是意识心有一个想法，意根有另一个想法，两个想法不合，意根决定做的，意识不愿意做，意识想做的，意根不做决定。因为意根习惯于安逸和懒散，自己认为没有好处的事都不想做，祂还不与精进心所法相应。</p><p>意识心因为学了法，知道放逸不好，喜欢安逸就有生死轮回，不能贪图舒适自在，精进学佛能得解脱，所以两个识心意见不统一，二者就要做思想斗争，内心里思量来思量去。当然思量来思量去，拿不定主意的是意根，也可能有意识的不断思惟作用，从而影响意根的不断思量，做不出最后的决定。意根和意识在一起共同运作，意识的思惟比较明显，容易观察出来，意根的思量性就很难观察出来，因此说意根是暗意识，埋伏得太深。最后的结果如何，要看祂们两个谁的力量占上风，如果意识心熏习得比较深厚了，能顶得住意根的惯性力量，据理力争，通过思惟活动就会说服意根，意根就决定坚持学佛。</p><p>如果是意根的习性占了上风，意识心没办法，就得随顺意根的习性，因为毕竟是意根作主说了算，意识没有说服得了意根，就得受意根指挥，就想不学就不学吧，于是就懈怠下来了。意识和六识的一切行为造作一定是意根指挥和指使的，所以我们的意识心要多学佛法，多明理，以此来开导、说服意根，意根通过意识心的思惟，知道了原来学佛有这样的好处，还是学佛好，于是再遇到什么样的逆缘，意根也会决定坚持学佛，不退缩。</p><p>学到一定时候，意根明理了，习性就会慢慢转变，意根明的理越多，就越能证得。所谓的证得，就是意根懂得了确实是如此的道理，才叫证得。如果意根不知道，只是意识心的知，那很肤浅，不起决定作用，就不叫证得。</p><p>意识即使知道很多的道理，作用也不大，因为到意根这里要作审批，意根要通过，才能去实行。意识在明白道理之后把报告交上去，意根一审查，确实是这个道理，祂一拍板，我们就会断我见和明心。所以修行，归到最后是修意根，一开始是修意识心，意识心明了的理落实到意根了，什么法都会证得。</p><p>十四、心理学上有个与潜意识沟通的方法，里面介绍了用意识疏导意根的方法，学习这种方法，可以用在佛法的修证上，让意根承认五阴无我之理，承认任何一种佛所讲的真理，从而能快些证得佛法。</p><p>降伏意根，战胜自己，就在于意识如何有效的引导意根，疏导意根，从而成功的改造意根。改造意根，有时需要狠，有时需要柔，要因势利导，循循善诱，这就需要意识要有很多的善巧方便，手段要适宜，学会软硬兼施。当领导的，会领导别人，也应该会领导自己。意识与意根，究竟谁是领导，谁是被领导？其实是互相领导，意根改造彻底以后，就不用意识再当领导了，永远是意根自主作主。</p><p>十五、意根对意识的拖累</p><p>如果意识能作主，不受意根的操控，那么我们学佛修行就是一件很轻松、很容易、很快速的事情了。意识学习了佛法，就明白应该如何做，那就如何做去了，根本不用管意根同意与否、支持与否，这样有多简单！如果意识明理了，不用管意根懂不懂，接受不接受，马上就开悟，烦恼去除的也快，禅定生起的也快，很快就能转识成智。意识想到什么就能做到什么，这样佛法的修学和教育该有多么轻松和简单，每个人的改变也就非常快速了，成佛就不是一件难事。可实际上不是这样，修行难就难在意根上，意根非常不好办，难于管理和改变，祂无明深重，又不懂理，到处攀缘执取，却要时时处处作主，意识很难应付祂。</p><p>最初学佛是意识偶然有缘遇到了佛法，意根却不知道佛法为何物，意识学习了以后，才告诉意根这是佛法，对自身有何益处，意根才能接受下来，懂一点点。其实是意根先遇到的佛法，只是祂不知道是佛法，也不了解，就交给了意识。这样意识就背负起了自学和教意根学的责任，很是辛苦，不断的受意根习气的阻碍和拖累，持戒不容易，修福布施也不容易，修定就更不用说了，想消除烦恼，难上难。</p><p>意识好不容易熬到断我见了，把意根的深重的我剔除一些，这才轻松一下，不用再跟着意根下三恶道受苦了。可是发个大乘菩提心，行菩萨道，却又受意根的自私心理阻碍，跟意根好说歹说，终于把菩萨六度修得像个样子，明心开悟了，这才真正的进入佛门里，然后再跟意根的我执法执较量，最后终于完完全全彻彻底底降伏了意根。把祂的无明全部铲除，解除了意根的全部盔甲，扬眉吐气的登上法王的宝座，从里到外，一身的轻松自在，三大阿僧祇劫的艰难奋斗路程就结束，太不容易了，人也从梦里完全醒过来了，也只觉得是转眼之间的事。</p><p>十六、意识要如何熏意根？意识对一切事理都要如理作意，如理思惟，善思惟，这同时就让意根了解了正理，意根慢慢的就能与正理相应，这就叫作熏习意根。意识一定要思惟，不思惟就不能熏染意根，因为思惟的内容刹那刹那都会传递给意根，意根就此进行思考思量权衡，起自己的认知。意识应该常常思惟正理，让意根随顺，意根受熏后也能形成新的惯性作用，旧有的不良习性就改变了。</p><p>十七、意根的习气种子存在如来藏中，改变意根的烦恼习气，本质上就改变了如来藏中的业种，业种改变，后世的习气就改变。现行可以熏种子，意识通过学习正确的佛法知见，有了智慧，以此智慧引导意根熏染意根，意根受意识的熏习，就能改变习气，意根的心行作为种子就存入如来藏中，将来意根就现行改变以后的心行，身口意行就改变了。因此说改变意根，就改变业种。</p><p>十八、如何降伏意根的遍计所执性</p><p>意根普遍计度执著一切法为我为我所有，一切法的范围是相当广泛的，只要是第八识变现出来的，意根都能缘着，并且执取为己有。但祂要有侧重点的执取，如果全部同时都执取，那就会心乱如麻精神崩溃，最终什么也不能得到，所以祂也根据具体情况，根据自身条件来选择执取某些法，有时执取这些法，有时执取那些法。祂把第八识变现出来的法，都当作是自己所有的，都当作是自己的功能作用，这就是错执，是非量境界，所以才不得解脱，不得成佛。意根在凡夫位最主要是执取五蕴十八界为自己，执六识的功能作用为自己的，把一切法都据为己有，这正是祂无明的表现。</p><p>我们要想得解脱，就要慢慢的剔除祂的无明，改变祂的愚痴性，让祂认识法界实相，才能断除祂的执著性，从而走向解脱，成就佛道。我们的意识就要常常思惟佛法，告诉意根这是虚妄无我的，那也是虚妄无我的，一切法都不是我，也不是我的，不要执著贪爱了。凡是自己所能接触到的，都是第八识给变现出来的，都是幻化，都不真实，意识常常这样思惟，意根就会放松其执著性，思惟五蕴的虚妄，祂就不会把五蕴当作自己来执著，解脱就有希望。并且努力实证第八识，让意根知道，一切法都是第八识变现出来的，都不是我的，意根以后就能有正见，就能破除无明愚痴烦恼惑，慢慢就能得解脱，并且获得大智慧，转识成智，究竟成佛。</p><p>十九、学佛修行以后，首先能改变意识心，因为意识的智慧性比较强，会思惟、分析、判断、推理、比较等等，接受能力比较强，领悟性高，所以就能先受熏陶和教育，改变比较快。意根第七识改变就很难，因为祂是我执识，从无始劫到现在一直存在，从没有间断过，所有的烦恼习气都积存得非常深厚，固执如坚冰，而且一切事不管大小都作主说了算，这种固执性短期内难于改变。执著主要是指这个心，要想改变祂，就得需要意识心长期熏陶，不断地说服教育。</p><p>修行首先要通过意识的观行，让意识和意根确认五阴确实是虚妄的，不是我。意根确认此理以后，慢慢心行就会改变了，不再执五阴为我，执著就减轻，我慢才能断尽，意根对自我的执著也会断尽，这样才能出离三界世间生死轮回苦。如果没有断我见，成为初果，就说要断执，那只是空喊口号，永远做不到。如果不用断我见，就能断意根对自我的执著，那么佛世的外道们早就断了，又何必世尊自己亲自到这个五浊恶世来，披上垢腻的衣服，受尽辛苦，传授解脱之法呢。</p><p>二十、感觉很困时遇到自己喜欢的游戏为什么就不困了</p><p>意根喜欢玩游戏，心着于游戏，贪着游戏之乐，祂就不断的作意和抉择于游戏，意识心就不断的玩乐，不能灭去，意根越感兴趣，意识的精力越高度集中，这样意识心就产生了兴奋心理，不困了。如果意根对游戏不感兴趣，意识就会兴趣索然，困意袭上心头。</p><p>一切事情都是由意根作主说了算，睡不睡觉由意根决定，祂要是喜欢什么，意识就得专注作什么，精神状态就兴奋，意识就不能灭去睡觉。依此理，我们就得让意根喜欢佛法，这个所谓的让是意识心通过思考佛理，来熏意根教育意根，使得意根对佛法感兴趣。意识受善法熏，再去熏意根，意根就能发生改变，去除恶心恶习，变成善心善习。善的种子就存入第八识里，第八识里恶的种子就消除，这就是现行熏种子。</p><p>意根变善了以后，如果遇到了恶法，祂就不会让意识去行恶法，从而控制和改变了意识，这叫作种子熏现行。所以修行是修什么，我们心里应该清楚。意根如果不被熏习改变，无论意识心如何认识，所理解的那些理论都没有用，因为意识不作主，只有改变主人的心，改变领导者的心和做决策者的心，才能改变一切。</p><p>二十一、要想改变意根，就要用意识的正思惟去纠正和影响意根的不正思惟，熏染意根，让意根也要具有正确的思惟，懂得正确的佛法之理，以让祂作出正确的抉择，减少贪嗔痴烦恼和习气。尤其是在重要的事情上，意识要多思惟正理，传递给祂善的如理的可行的观点看法，供祂思量参考抉择，如果发现祂的抉择仍然不对，就暂缓行动，再次思惟正理，再找依据证据说服祂，这样祂也许就能信服，按照意识的正思惟而作抉择，这时才可同意意根的决定，并执行和操作。</p><p>二十二、忏悔的力量和结果</p><p>当面忏悔，就能消除两个人如来藏里的种子，但是必须是这个人要诚心忏悔，那个人也要诚心接受忏悔，这样才能解怨释结。为什么要诚心忏悔和诚心接受忏悔呢？诚心、真诚，就代表着意根从心往外的悔过，意根从心往外的接受。只有意根悔过和接受，两个人的如来藏才会重新做记录，就把两个人如来藏里从前的业种改变了。因为如来藏里原来的业种消除了，两个人也就没有怨结了。</p><p>地上菩萨改变自己如来藏里的业种，就是利用意识熏染说服意根，让意根看清自己烦恼习气的危害性，从而决心悔过，这样自己的心性就发生了变化，如来藏里的业种就消除了。地上菩萨因为其甚深禅定力和智慧力，以及福德力，就能通过改变自己意根的心行和习气，清净自心，就把自己如来藏里的业种消除掉。</p><p>而意识装模作样的假忏悔就没有什么实际作用，还往往被人识破心机。意识想忏悔却拗不过意根的烦恼习气，这该如何是好？那就应该常常谴责意根。只要会谴责别人，就能会谴责自己，谴责自己就是谴责意根，把自己的不善的心行都要揭发出来，暴露出来。尽管意根不愿意不高兴，有时也要这样作。如果意根实在接受不了，习气太重，那就不要勉强，一点一点试探着来，不要操之过急，否则就会适得其反，意根破罐破摔，也是很要命的。</p><p>二十三、意根是六根中的最后一根，是我执识，时时处处执著一切法，生生世世的烦恼和习气都眠藏跟随着，所以意根就有一种惯性力量。有一句话叫作江山易改本性难移，就是暗指意根的习惯势力非常强，在母胎里就能表现出来，不用后天学习和环境熏染。我们身口意的一切行为造作都有一种习惯，就是意根的习惯势力。要想改变这种惯性，就要学习正确的佛法，意识有了正知见，遇事就会思惟分析抉择，这个过程就是熏习意根的过程。意识常常思惟此事如法彼事不如法，刚开始意根可能不接受，时间长了心里明理了，意根也就能认可而改变自己，心行就会发生变化，身口意行就会发生改变。</p><p>意识的如理作意思惟能熏染影响意根，常常思惟正确的法理，意根就能慢慢接受意识所思惟分析的正理，烦恼和习性就能减轻和改变。六个识所做一切事不管大小都要传到意根那里，意根就会根据这些信息决定下一步做什么，如何做，祂有可能听从六识的抉择，也可能不听从，仍然按照自己的固有的习惯作抉择，这样六个识就得按照意根的烦恼习惯做事。只有长期熏陶意根，六识常常给意根传送正确的报告，意根慢慢才能发生改变，修行就得力了。</p><p>二十四、意识的后天我执性，由后天的外缘力以及邪教邪分别而有。意识的这种我执性必然熏染意根，反过来增加意根的俱生我执性，使意根的俱生我执种子势力更大。意识如果受到了正面的教导和熏染，很容易降伏这个我执性。但也只是降伏而已，意根的我执不断除，就会不断的控制意识，意识的我执性也很难断除。</p><p>分别性，意识是最强大的，因为其思惟敏捷、深细而广泛，但是意根也有分别性。我执、执我性，虽然意识也有，但还是以意根为主，执著性主要是指意根的，我和我性主要是指意根的；因为意根把一切法都当作我和我所有的，把第八识的作用当作我的作用，把六识的作用当作我的作用，实际上意根就是把意根自己当作我，一切法都归意根所有所用，第八识和六识、五蕴只不过是意根所用的工具，归意根所有罢了。那么意根的我执就是执著意根自己，执著自己所拥有的所有工具罢了，从这点上来讲，意根一定有证自证分，只是意识智慧不足无法了知到意根的证自证分功能。</p><p>意识由于了别性强，容易接受现实和现前的境界熏染，因此意识被降伏的比较快，转念也比较快；意识一转念，就要把自己的思想观念和信息传递给意根，以熏染意根，让意根转变，意根一转变，业种就改变，后续的心行就转变。如果意根还没有被意识熏染成功，遇缘就要现行原来固有的习气惯性，那么意识就无力阻挡了。</p><p>意识无力阻挡，意根的习气惯性要如何现行出来？意根一定要通过意识和五识这些工具来现行表现自己的习气惯性作用，祂会充分利用六识的工具来运作，否则祂无法表现自己，无法展露自己，无法发作。因此说，在修行上仅仅是降伏了意识，没有降伏意根，那就没有多大的实际作用，意识时时处处督导意根，总有控制不住的时候，意根牛的野性确实很难驯服。</p><p>二十五、意识知好知坏，意根与之不同步，意根不管意识如何认为，就按照自己固有的观念行事。意根很固执，祂认为好就好，不好也要去做，意根认为不好就不好，再好也不做，这就是意根的习气惯性使然。</p><p>意识要如何熏陶意根扭转意根？有时候意识的力量比较强，对意根控制力比较大，能够操控意根，意根不得不随从意识的想法而决定做事。但意根总有挣脱束缚的一天，不能总顺从意识。所以意识必须以理折伏意根，不能总是强制性的，意根明理就会自动自觉的如理抉择。以理说服意根的过程，就是熏染熏陶意根。</p><p>当意根犹豫不决拿不定主意时，就愿意听从意识的思惟分析，听从意识的意见，其行为就能有理智。明知不对非要做，是意根没有理智的行为，如果能听从意识的劝告，就是意识的理智占上风，明知故犯就是意根的无明习气占上风。</p><p>二十六、三四果人生来心地就清静，因为意根已经断除烦恼了，不会再生起烦恼，但是如果意识受到环境的熏染，再去熏染意根，也有可能要出现轻微的烦恼，再证果和修出初禅定以后，无论意识和意根都不会受熏染起烦恼了，只是习气有时还会现行出来。</p><p>意根一旦心地清净，外表就无所谓了。断了烦恼的菩萨，很多时候都不在意外表，只是为了影响摄受众生，才着外表的相，但心里已经没有相了。所以很多时候，菩萨为了度化众生，身口可以随顺众生，心地仍然清净。成佛以后，心地是极为清净的，与如来藏一样的清净，因此就不用任何戒律来规范佛的身口意行，犹如不需要用戒律规范如来藏一样。因为如来藏心地本来就是清净的，没有任何不规范的心行，那么如来藏随顺七识所造作的任何恶业和犯戒之事，都不属于如来藏的恶业，如来藏不承受任何果报。同样，佛的心行已经彻底究竟清净了，为了度化众生而显现的恶人恶鬼等等相貌，所作一切事都没有恶业果报，心地极为清净故。</p><p>地上菩萨在六道里什么色身都可以显现，什么事都可以做，也许在一般人眼里是不清净的，可是菩萨自有其原则和规范，只要心地清净，一切为了佛教和众生，目的纯正，无我无私，就不犯任何戒行。比如观世音菩萨为了度赌徒，就现赌徒身与赌徒赌博，最后把赌徒度入佛门。观世音菩萨参与赌博，却没有一丝喜好赌博的心行，不与赌徒的心相应，就没有赌徒的恶果。相反以此特殊手段度脱赌徒，其福德无量，如果赌徒之后能成为佛教的栋梁，观世音菩萨的功德也无量。</p><p>释迦佛作菩萨时，为了救一个肆意想谋杀菩萨的人免下地狱，没有别的办法，只好杀了这个人，宁愿冒着自己下地狱的危险，也让被杀者免予地狱的恶果。释迦佛以如此手段不但救了五百菩萨的生命，也救度了想谋害菩萨的恶人，免于多少大劫的地狱恶报。瑜伽师地论菩萨戒里规定，如果遇到众生应该得度者，宁可犯戒也要去度，如果怕犯戒而不去度，就违犯菩萨戒。可是菩萨在造作所有这些行为中，心行始终是清净的，只为了众生得安乐，不为自己得解脱，心地近乎于如来藏一样，有何戒行可犯！</p><p>二十七、因为第七识意根到处攀缘一切法，意识就要了别一切法，了别之后就要出现各种念头，念头是这样来的。如果意根的攀缘执著性得到降伏，意识就会安静下来，不会起各种念头了。所以降伏了意根，修定才能成功，才能得到较深的禅定。要降伏第七识意根，就要让意识思惟万法的虚妄无常性，然后传递给意根，让意根受熏。</p><p>意识思惟的越深细，意根越容易受熏，越明了，攀缘性就会减弱，执著就会减少。想办法让意根多明理，首先意识自己就得多明理，常常进行正确的闻思，把所思惟和明了的理再传递给第七识，以此熏染和改变意根，意根就会得到有效的降伏了。</p></div>"
},{
    "title": "结 语",
    "author": "生如法师",
    "date": "2018年10月11日",
    "html": "<div class=\"B1_text\"><p><strong>结  语</strong></p><p>意根的内容属于唯识种智范畴</p><p>几乎百分之百的人都是把意根的状态当作了意识的状态，所以当有人讲出真正的意根特性时，就被人说为把意根与意识颠倒了。但却是百分之百和百分之九十九以上的人颠倒了。因为所有这些人都具足了一切烦恼，无明烦恼遮障的缘故，没有转识成智的缘故，不能现前观察意根的现行运作，当然会百分之百的误会。不管什么时代，不可能是极大多数人是高智商无烦恼遮障，而个别人是低智商，以至于错会佛法。出错误的在娑婆永远是极大多数人，没有智慧的也仍然是极大多数人，不可能极大多数人都转识成智，有妙观察智，一百个不可能。所以那些自作聪明的人，最好不要太自信，更不要诽谤，免得后果严重。</p><p>意根的所有内容，属于唯识种智范畴，所有唯识方面的内容也都属于唯识种智范畴，各个识的心所法更是如此。只要不是入地菩萨，最好保持静默，不要到处讲到处辩，因为不具现量观行智慧，不可能现前观察到意根的具体运行状态，那讲出来的东西，大多是想象和臆测，往往要张冠李戴。娑婆世界的学佛人大抵都是这样，不可能很多人都转识成智，有妙观察智和平等性智。如果没有这种智慧，都要默默用功，以期尽快修出初禅定，尽快断除烦恼遮障，尽快修出各种观行智慧，早入如来家，然后再在定中现量观行意根的运行，带领大众解决意根的问题，增长唯识智慧。</p><p><br/></p></div>"
}]