[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>内容简介</strong></p><p>意识是佛法修证的一个最得力的工具，用之来接触佛法，思考佛法，获得正知见，然后熏染意根，最后实证。意识的功能作用一般人都能观察得到，祂的特点有很多，总的特点是生灭变异无常。但是很多学佛人把意识的某个体性当作是不生不灭的第八识的功能，这样的话，如果说悟就是错悟，不能解脱生死。<br/></p><p>此书讲述了意识的种类、了别的功能作用、贪嗔痴的表现和危害、定中与定外的差别，以及了别境界的方式，讲述了意识的见闻觉知作用出生的原理，对境了别的生灭变异过程等等，充分说明了意识与第八识的体性有很大的差别，让学人认清二者的区别，不再认意识为真，从而走上正确的参禅之路，不枉费一世修行之功。外道都是以意识为自己真实的灵知性，因为内心遮障重，不见真心第八识的实质作用，如果能认清意识断断续续的生灭性，外道们很快就能断除我见，解决生死问题，出离轮回。所以懂得意识的体性，是非常重要的。</p></div>"
},{
    "title": "第一章 意识的种类",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  意识的种类</strong></p><p>一、意识也叫作第六识，其体性是起分别、了别各种法尘境界的作用，具有思惟、分析、推理、判断、回忆、发愿、打算、妄想、研究等等心理活动，有善性、恶性及不善不恶无记三性。意识的存在形式有两种：一种是五俱意识，另一种是独头意识。</p><p>五俱意识：与前五识同时出现，并与前五识在一起共同分别六尘的意识。譬如眼见色时，眼识分别色尘的色彩、明暗、尘雾及空与不空等粗相的显色，意识心则分别色尘所显现出来的品质、种类、内涵、轻重、性别、美丑、善恶、修养、韵味、形色、表色及无表色等细相；耳听声时，耳识分别声音的波动、频率、振幅等等粗相，意识心则分别高低、远近、粗细、声尘上所显现的内涵、意义、种类、出处、善恶性、好坏、男声女声、韵味等细相。意识心亦与鼻识、舌识、身识同时分别，即与五识同时分别，故称作五俱意识。</p><p>独头意识：不与五识一起分别五尘，而单独对法尘生起分别和了别的作用，并回忆过去和展望未来、打妄想、了别定境和梦境等独影境的意识，为独头意识。独头意识又分为：散乱独头意识、定中独头意识和梦中独头意识以及狂乱独头意识。</p><p>二、意识的功能体性是对法尘境界进行思考、分析、推理、判断、思辨、抉择等等一系列的思惟活动。意识之所以能够产生，是由于意根缘于法尘、作意法尘、了别法尘以后，起心决定要细致了别法尘，如来藏就出生意识加以微细了别，意根才能借助于意识了知微细的尘境。意根缘法尘，如来藏出生意识，意识生出来以后，就有了分析、思惟、推理、判断等等这些心识活动。</p><p>意识所分析思辨的法尘境界是从哪里来的呢？祂的来源之处就是如来藏，是如来藏依缘所变现出来的虚妄法。意识所对应和了别的法尘，到底是和前五尘在一起还是不和前五尘在一起的，这就要看这个法尘是否与五尘有关联，是否是五尘的微细相，意识心的了别是否需要五识为助缘；如果是不与五尘有关的法尘，就是独影境，是独头意识了别的法尘，不需要五识就能了别的就是独头意识，没有五识的配合就不能单独了别的就是五俱意识。</p><p>如果意识心是五俱意识，就必须与前五识在一起同时分别，这个意识心所对应的法尘，一定是与色声香味触五尘在一起的法处所摄色，与五尘有关。这就是说，如来藏把外六尘通过六根变现到胜义根里，这样内六尘就出现了；根尘相触，意识和前五识就一起出生来分别六尘境界，所以意识所了别的法尘就与前五尘有关。离开前五尘，这个法尘也不存在，意识心也就不能出生了，所以这种意识就叫作五俱意识。</p><p>三、独头意识</p><p>独头意识又分为散乱独头意识、定中独头意识和梦中独头意识以及狂乱独头意识。</p><p>（一）散乱独头意识是指意识和前五识一同分别五尘上的法尘时，意识不专一，还要单独思虑、妄想、回忆、了别其它的法尘，导致心思散乱而不能缘于一境、定于一境，并且心水浑浊，无定无慧，任何事都不能考虑清楚。六识同时分别六尘时，部分意识心不仅与五识同时分别六尘，还单独有散乱独头境界，缘虑其他法尘，那么意识单独对应的这一部分法尘就不和前五尘在一起，是如来藏另外变现出来的法尘，是从如来藏的种子库里直接输出的法尘，是意识心单独了别的独影境。</p><p>比如我们眼睛正在看某一个物体，意识和眼识一起在了别着这个物体；与此同时，意识又缘虑其他的事情，并不专一于观察了别目前的物体。此时意识心的注意力分散，祂不仅和眼识在一起缘现前的事物，同时还要单独思虑其他方面的事情；此种情况是意识的识种子分流，俗语叫作”注意力不集中，注意力分散”。意识心分流时，其注意力偏向于哪一方面，哪个方面了别得就更为清楚；识种子流注较多的缘故，了别势力较强故。如对眼前的事物不太专注，识种子流注出来较少，了别势力就较弱，对眼前的事物了别就不清楚。</p><p>识心注意力的分流好似河水分流一样。原本一股强大而迅猛的水流如分成几股，每股水流的流量就变小；流量小了，水流的势力就跟着弱下来了，它的作用力也就微弱了。意识心若分流，其注意力就分散，这样在各方面的了别都不清楚，因为势力弱，了别能力也弱。</p><p>意识的注意力是一种力量，相当于意识的作意心所，意识作意于多个境界，就要同时触多个境界，领纳多个境界，接下来就要了别多个境界。这样意识的力量分散，其作用力就很微弱；了别每个境界的力量弱，了别得就不清楚，智慧不能生起。所以意识不专一，就没有禅定；没有禅定，就没有智慧的生起。</p><p>同理，听声时如意识心不专注即注意力分散，就听不清声音的内涵，不知道声音的深刻的含义；在嗅香时如意识不专注，注意力分散，就分别不清是何气味，了别的不细致不究竟；在尝味时如意识心不专一，心中还思虑其他事，即出现食不知味的现象；在觉触时如意识不专一，内心还在思虑其他的事，就不清楚身体所发生的状况，即使被蚊虫叮咬，身体出现异常情况，自己也浑然不知。如果大家都能以此种心态修行佛法，不对身根以及色声香味触感兴趣，淡忘周围一切，修行佛法就能收到很大成效。</p><p>在修学佛法时，意识如果注意力大多用来思惟佛法，不在意其它五尘境界，对五尘境界自然就能够浑然不知，这时的意识心大多作意在佛法的修证内容上，就能够忘身，这也是一种定。最怕的是意识心在缘多个境界的时候，却是哪个境界也不用心，一概的心猿意马，心中就会对任何事情也不清楚，一片的茫然无知。</p><p>散乱独头意识，还包括一种情况，就是意识自己在单独思惟了别时，也是散乱的，并不是专一思惟一个事理，而是跳来跳去的思惟很多个法，内心杂乱无章，没有头绪，结果什么事情也不能思虑明白，其智慧就很浅薄，或者根本就没有智慧可言。</p><p>（二）定中独头意识所了别的法尘为如来藏直接变生出来，和前五尘没有关系，不与前五尘在一起。前五识不现行，就由意识心自己单独了别定境法尘。</p><p>真正的定是指四禅八定，其中初禅之前的定是欲界定。欲界定共有六种层次，分属欲界六层天；如果对人间之事越淡薄，定的层次即越深，色身越高大，感受越自在，越轻灵舒服。最高层天是他化自在天，离色界初禅天最近，与之相应的定叫未到地定，是未到初禅地前的一种定，也分为不同层次，有完全具足的定，也有不具足的定。在欲界定当中都有五尘现前，前五识都现行。如睁开眼睛能看见眼前的境界；耳能听到周围的声音，只是此刻意识心较为专注，只专注在所缘境上，或专注于某种感受上，或专注于某种心念上，其它尘境轻微了别。</p><p>比如专注于思惟参究佛法，参究一个话头，这时前五识还是存在的。因为意识不太注意五尘，五识自己的分别力又比较弱，了别的比较粗劣。前五识虽然存在，当有定境法尘时，还是意识自己单独了别定境法尘，五识不参与了别。五识仍然只能微弱地了别五尘，意识心也同时参与了别，但是了别比较微弱一些，了别的不太清楚，因为意识也同时在作意其它的法尘，要专心思惟其它的法。</p><p>从色界天开始就有四禅八定，色界初禅天的初禅定里，五识当中的眼识、耳识和身识都现前存在，也在了别色尘、声尘和触尘境界；意识也存在，也同时了别这三尘上的法尘境界。但是意识若专注在一个境界上，心念就比较专一，不散乱。这时的意识就能专注于思惟一个法义，专注于了别定境法尘。如果意识注意的境界比较多，心就散乱，就可能从初禅定中退出来。</p><p>二禅以上的定中，只有独头意识在单独了别定境法尘，没有前五识的存在，因此独头意识就不能知道五尘上的法尘。无想定中的独头意识也灭了，因此就没有识心来了别定境法尘，六个识都不存在，只有第七识和第八识存在，二者在共同维持着色身的存在，生命体才能不消失。在阿罗汉的灭尽定中也没有独头意识的存在，没有识心来了别定境法尘，只有第七识的作意、触、思三个心所法的存在。最重要的是有第八识的存在，才能使得色身继续存在而不灭失。</p><p>所谓的定，就是心住在一个境界上，既不扰动，也不散乱。初禅和未到地定的心都能住在一个境界上，或者以一个境界为主，其他的境界都不专注，都不在意。当意识心专注在一个境界时，因为注意力集中，识种子不分流，其识别的作用力强，了别得比较深细，分别比较清晰，就能出生智慧。所谓的智慧，就是对事物了别得很清楚，了别得透彻，能明白事物的真实相和真实意义。</p><p>（三）梦中独头意识，是如来藏单独所变起来的，前五识不现行，只有意识心在梦中了别梦中的法尘境界。意识心单独分别梦中独影境，没有前五识，肯定就没有前五尘，只有梦中的意识心所了别的法尘。</p><p>在梦中，我们好像到了好多地方，好像也做了很多事情，天上地下可以随意来去，没有任何的限碍，其实我们什么都没有做，哪里也没有去。多数的人觉得梦中好像有前五识，五识都在活动分别着，其实在梦中的前五识是不存在的，梦中只有意识心的存在，这叫作独头意识。如果有五识存在，身体就会与清醒着时一样动转，那就不是睡眠，而是醒着了。因为在梦里，我们从一个地方突然转换到很远很远的另一个地方，甚至眨眼功夫就到了天上，如果有前五识存在，身体一定是动的，也能跟着一起到天上，到很远的地方。实际上，我们的身体哪里也没有去，仍然在床上纹丝不动躺着，所以梦中没有五识的存在。</p><p>梦中如果有眼识存在，我们的眼睛就会随着色尘的转变而动转，其实我们梦中的眼睛并没有动。梦中如果出现天人，眼识是不能见到天人和鬼神的；梦中见到过去世的亲人，眼识也不能见到过去世的亲人。在梦中，如果有五识，梦中吃饭时口舌应该动，胃里应该有食物，并且能感觉到吃饱了，可是醒来仍然饥肠辘辘。如果梦中有五识的存在，我们就能喝水或者做一切事情，但事实上我们身体并没有动，醒来以后仍然要口渴，所以梦中没有五识的存在。因此梦中只有独头的意识心在随境界飘忽不定，并没有前五识的存在；如果梦中真有前五识的存在，那就可以支配色身的运转了。</p><p>当意识心单独在梦中存在时，就可以不受时间和地点的限制，不受前五识的限制，不受身体的限制，可以瞬间到天上，瞬间到其他世界，瞬间能回到过去生，瞬间能穿越到未来世。在有前五识存在的情况下，这些都是不可能做到的，因为身体必须要连带着一起动转，这样就不可能回到过去，穿越到未来，也不可能上天入地。没有前五识的参与，就没有身体的参与，只有意识心单独活动，就不受色身的拖累；意识就可以有神通，不管过去与未来意识都能去。如果有身体的参与，我们哪儿也去不了，只能在床上躺着睡觉。</p><p>（四）狂乱独头意识，是一种病态和幻觉，是神经错乱出现的症状。意识分不清现实与妄想出的狂乱境界，产生幻觉，把幻影当作真实，意识颠倒发狂。</p><p>四、无论做梦还是清醒时，意识所见都是如来藏现起的影像，对于胜义根来说，醒时的山河大地和独影境是等效的；人从梦中醒来，是从一个梦境进入了另外一个梦境，由独头意识转换为五俱意识，同样都是意识。在清醒时，散乱独头意识，与五俱意识和五识同时起用，那么内五尘、内法尘、独影境就会同时出现，同时存在。心里散乱时，人在两个梦中，一个是现实一些的现量梦，一个是纯属想象的非量梦，这样意识就不专一，思惟紊乱，智慧很难出生。如果意识有侧重点，或者只在五尘上的一个法尘上了别，或者只在非量的独影境上了别，也能有定，也能出生智慧，这就是念佛、思惟、观行和参禅的专一境界。</p><p>五、物质的色法是由地水火风四大种子所构成，色声香味触五尘也是物质色法，当然也是由四大种子所构成。在五尘上所显现出来的法尘，叫作法处所摄色，也是由四大种子构成。缘灭之时，四大种子分解，五尘就随着消失而灭亡，五尘上的法处所摄色也随着消失而灭亡。所以六尘是生灭无常的，不是真实的，都是如来藏出生和显现出来的。</p><p>法尘属于法处所摄色，是微细色法，由地水火风四大种子所构成。五尘是色法，由粗略的地水火风四大种子所成，与五色根相对应；在五尘上面同时也有法尘显现，与意根相对。五尘与五根相对时，在五尘上同时显现的法尘就与意根相对，这样六根触六尘，第八识就出生六识，六识再触六尘，于是就有了六识的受、想与思的心所法。</p><p>在色尘上有法尘的显现，眼根触色尘，意根触法尘，第八识就出生眼识和意识同时触色尘和色尘上的法尘，两个识就能同时分别色，但是这两个识分别的角度不同，粗细的程度也不同；眼识分别的色尘较粗，意识分别的色尘较细。离开五尘境的时候，可以有单独的法尘存在，意识心单独起作用分别这种独影境的法尘境界，这时的意识心就叫作独头意识。</p><p>比如听见一种声音以后，意识就陷入了沉思，反反复复思考这种声音里的意涵，这是意识所对的法尘境界，没有五尘，是单独的法尘影像，比较微细。凡是了别了六尘境界以后，陷入了沉思的状况，就属于独头意识对独影境的了别。还有在禅定中的境界里没有前五尘，意识心单独思惟、回忆、分析、推究、观察，出现的定果色是法尘境，没有五尘，意识单独了别；在梦中没有前五尘，意识单独在梦中活动，这都是独头意识。</p><p>六、睡着时不管有梦无梦，五识都不出现，都不现行，因为梦境属于独影境，是独头意识单独了别的法尘境界。睡着时六根仍然要起作用，外六尘也一直不断地进入根尘相触之处，内六尘也不断地变幻着，因为色身处在眠熟位而不出生六识时，当然也不能了别六尘。</p><p>有人说睡着作梦时有身识参与，如果真有身识参与，那么作梦上天时，身体就能跟着上天，可是身体还在床铺上，没有动过。做梦被人追杀逃跑时，如果有身识，身体不知道要跑到哪里去了，根本不能还在床上。做梦吃饭时，如果有身识，饭早就已经吃到肚子里，醒后的肚子应该是饱的，早晨无须再吃饭了。做梦发财时，如果有身识，金银珠宝就已经收到口袋里或者存起来，醒来后就应该能找到金银珠宝。做梦做饭时，如果有身识，早晨醒过来时，应该直接有饭吃才对，不必再去做饭。由以上的推论可知，做梦时并没有五识的存在，只有独头意识在了别独影境的梦境。把五识的功能作用都了别清楚了，就知道梦中到底有没有五识的出现了。</p></div>"
},{
    "title": "第二章 意识的觉知和了别作用",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  意识的觉知和了别作用</strong></p><p>一、意识是修行不可或缺的工具</p><p>意识在六尘境界里起判别、了别、分别、推理、思惟、研究、思考等等作用，以此功能作用能了知一切法。意识心一灭，我们什么也不能知道，这些功能作用全部都消失不见了。开悟的人也有知，而且在很多法上的知都是带有一定的佛法智慧，无明的知和愚痴的知就相对减少了。</p><p>因此说悟后的菩萨也要依靠意识的功能作用在世间里正常的生活和活动，也要依靠意识心的功能作用继续修行佛法。开悟以后的菩萨要用意识心观察真如自性各个方面不同的体性，观察如来藏更深细的运作，这样就能获得后得智或别相智，甚至唯识种智也要依靠意识的观察智慧而出生出来。菩萨们说法、修行、穿衣吃饭、看书、思惟都要用意识心，意识心是非常重要的不可或缺的修行和生活工具。</p><p>祖师大德们悟后都要用意识心，离不开意识心这个工具，没有意识心他们就不能讲法，不能修行，不能生活，只能长年累月的入到无想定中；但是没有修到这种深度的禅定，只能长期昏迷和睡觉，因为没有了意识和意识的了知性了。因此我们不能说六祖讲真如自性不用意识心讲，如果用意识心讲法，六祖就是没有悟，这样说话是有很大过失的。</p><p>认识和了解了意识的体性以后，就知道意识的诸多之用，众生依靠意识的用才能正常的生存和修行；找到意识心时，自己现前来观察意识的体性，就能知道众生确实都离不开意识，离不开意识的知性和了别性。</p><p>找到意识不是很难，只要知道了意识心的体性，马上就可以找到，并且能现前观察意识所起的作用。只是没有甚深智慧时，还不能观察得很深很细而已。很多人只要告诉他意识的功能作用，就知道了哪个是意识心。找到意识、观察意识是很容易的，非必要到开悟时才能证得意识。学佛的根本其实就是在学八个识，八个识都证到了，唯识种智就能逐渐具足；种智圆满具足时就是一切种智，有了一切种智就能圆满成佛。</p><p>二、意识的几种功能作用</p><p>（一）逻辑思维</p><p>逻辑思维是人在认识事物的过程中，借助于概念、判断、推理等思维形式，能动地反映客观现实的理性认识过程，又称抽象思维；是把对于事物认识的信息材料抽象成概念，运用概念进行判断，并按一定逻辑关系进行推理，从而形成一个相对完整的思想，加以理解和掌握，达到认识的目的。逻辑思维的特点是以分析、综合、比较、抽象、概括和具体化作为思维的基本过程。</p><p>（二）归纳与演绎</p><p>归纳是从多个个别的事物中获得普遍的规则，例如：男人、女人、老人、孩子可以归纳为人类。演绎与归纳相反，是从普遍性规则推导出个别性规则，例如：人类可以演绎为男人、女人、老人和孩子等等。</p><p>（三）分析与综合</p><p>分析是把事物分解为各个部分加以研究，是认识事物整体的必要阶段。综合是把事物各个部分按内在联系有机地统一为整体，以掌握事物的本质和规律。分析与综合是互相渗透和转化的，在分析基础上综合，在综合指导下分析。</p><p>（四）抽象与概括</p><p>抽象是从众多的事物中抽取出共同的、本质性的特征，而舍弃其非本质的特征，形成概念、判断、推理等思维形式，以反映事物的本质和规律。概括是形成概念的一种思维过程和方法。</p><p>（五）比较思维法，比较分为同类事物之间的比较和不同类事物之间的比较，也可以分为求同比较和求异比较，在相似中，求不同处；在不同中，求相同或相似处。</p><p>（六）因果思维法，由因推导出果，就是由甲推导出乙的逻辑思维方式。</p><p>（七）递推法，就是按照因果关系或层次关系等方式，一步一步的推理。原因产生了结果后，这个结果又作为原因产生下一个结果，于是成为因果链，因果链就是一种递推思维，譬如十二因缘。</p><p>（八）逆向思维法，逆向思维法与因果思维法相反，逆向思维法是由结果推理原因，譬如逆推十二因缘。</p><p>三、意识的分别性</p><p>七个识都是分别心，都起分别作用。离开了七个识的分别心，身口意行就无法现行出来，那就是有口不能说话，有身不能做事；离开分别心，与死人就没有什么区别了；没有分别心，有关人我他她以及世间生存环境一切事情都不知了；没有分别心，东西南北就分不清，父母也不识别，就不能过正常生活。</p><p>既然我们身口意行一直在不断地现起，一直在应对着周遭的一切，就说明我们的七识心一直都在分别。分别就是了知，就是了别，就是对色声香味触法的明白和清楚了知，这是妄心七个识本具的分别体性。只要有七识存在，就有对六尘万法的分别了知性。这种分别了知性如果不存在时，一定是在六识心灭去不起用的时候，就是睡着无梦时、昏迷时、正死位、入无想定中、入灭尽定中。在这几种情况下，众生恰恰不能正常生活，也不能修学佛法，所以只要有七识在，就有分别性。</p><p>现在普遍所说的不分别，是指不分别众生的好坏，不分别贫富差别，不分别环境的优劣等等；这种不分别是不挑剔不在意的意思，而六识的分别性宛然存在，并没有断灭。内心有修行的人，才能不在意也不分别一些世俗法，看一切法都平等无二，能修到这种程度的人，那是极少又极少的。众生在三界世间中生存，其分别六尘万法的功能作用不可能灭去，总要现前起用，想灭也灭不了。有根有尘，就有识心生起分别作用，众生才能正常生活。</p><p>四、能和所是指什么</p><p>能是六识的能知性，所是六识所知的法。比如觉知和疼痛两个法，觉知是意识和身识的能知性，疼痛是两个识所知的触尘，一能一所，能所和合才能把法显示出来。</p><p>能觉知心共有六个（严格说也包括第七识意根），眼耳鼻舌身意六识，能分别和觉知不同的六尘境界。所觉知的法有色声香味触法六个，是六识所知的尘相，第七识不仅能觉知六尘，还能觉知六尘之外的一切法。</p><p>在觉知当中有受，受是六识的感受，六根触六尘生六识，六识触六尘之后就有了受。前五识的受比较粗浅，第六识的受比较细腻复杂。身识和意识一起分别触尘，两个识共同感觉到了疼痛，第六识感觉的疼痛带有情绪化。这时的觉知心包括身识和意识，是能觉，触尘是所觉。</p><p> 能觉与所觉分不开，能知与所知分不开，能观与所观分不开。没有所觉所知所观，就没有能觉能知能观；没有能觉能知能观，就不知道有所觉所知所观，二者是互相依赖的。就是说，没有六尘就没有六识，没有六识就不知道有六尘。意法因缘生意识，三者和合触，意识就知法。六根触六尘生六识，三者和合触，六识就了别六尘。把六根六尘六识的体性界限弄明白了，一切法就清楚了。</p><p>能知和所知都不是真实的，意识所知的法，不仅包括六尘境界，包括七个识和心所法，也包括第八识和心所法，也包括心不相应行法，因为这些法也能被意识心了别和观察到。</p><p>断我见时证得能（七识）所（六尘）皆空，这个空是空幻的意思。如果内心真的认为一切能和所皆空时，就已经达到初地的果位了，这个空是空性心如来藏的意思。一般人只是粗浅地认识到这点，但内心还是不能确认，没有切实观行的缘故。如来藏也有能有所，但祂确实是不灭也不断的，如来藏也确实有识性和知性，但普通情况下，对一般人也都不讲这些甚深的内涵，恐众生不解和误会。</p><p>五、识心的出生和分别的原理如下：</p><p>六根触六尘，第八识产生六个识。眼根触色尘，第八识产生眼识；根尘识三者和合触，眼识就见色。耳根触声尘，第八识产生耳识；根尘识三者和合触，耳识就听见声音。鼻根触香尘，第八识产生鼻识，根尘识三者和合触，就嗅到气味。舌根触味尘，第八识产生舌识，根尘识三者和合触，就尝到口里的酸甜苦辣咸味。身根触触尘，第八识产生身识，根尘识三者和合触，就感觉到触尘。意根触法尘，第八识产生意识，根尘识三者和合触，就了知一切法。根尘识三者和合触各有各的作用，各有各的界限，互不相代，尤其是根与识要区分开。根能触尘接收尘，识能分别了别尘，众生就能了知六尘万法。所以众生只要有生命活动，就不能灭去分别觉知性，是一定要分别万法的。</p><p>六、意识在母胎里四五个月就出现了，直至出生都有意识存在，胎儿没有意识就无法出生，出生的过程就有意识参与，没有意识的出生就是死亡。先天性无脑儿也带有微弱的意识，否则就是死胎无法出生；植物人也有弱意识，否则也会死亡。只要有意识存在，意根就不会离开五蕴身，祂非常的执着六识身的功能作用，因为意根自己无法做什么，祂必须用六识去做，用身体去做。</p><p>七、意识在中阴身里的了别性</p><p>问：如来藏在胜义根处成像，其实胜义根也就是如来藏的相分，意识在其间了别。有人身时意识的了别很伶俐，但是在中阴身时，同样是如来藏执持着中阴身，同样有胜义根，同样在中阴身的胜义根中成像，那么为何中阴身时的意识了别却很弱呢？难道意识还要有个物质的大脑或大脑细胞作为基础才能起用吗？</p><p>答：中阴身是微细的物质色法，与人身有一定的区别，因为中阴身的色身比较微细，不是粗重的物质色法，因此色身对意识心没有严重的遮障，意识就有五神通，能知道人类所不能知的很多事情。但是意识在思惟推理分析判断时，就要依靠物质色法胜义根。如来藏要在胜义根处变现法尘，依胜义根中的四大物质而变现法尘，胜义根处物质不发达，法尘就不清晰，意识的思惟功能就受阻碍，不能完全发挥出来。那么意识就不能通过强有力的思惟活动来影响和调控意根，意根受不到约束，就要完全表现出自己的本来习性，表现出祂的质直性，没有虚伪，没有掩饰，没有做作，是什么本性就显现出什么本性。</p><p>意识思惟活动的强弱是与大脑胜义根有关的，大脑物质不发达，缺少营养，思惟就不敏捷，不灵活，就不能有效的控制意根，众生的本性就完全表露出来。因此，在中阴身里意根去投胎，是完全按照自己的习性去投胎的，习性与业种相应。习性恶，与三恶道相应，就投胎到三恶道；意根的习性与三善道相应，就投胎到三善道。</p><p>中阴身里因为胜义根的问题，意识的思惟能力弱，意根的习气作用大，往往是与业力完全相应的。比如幽冥界的那些众生，都表现为本来的习性，没有理智，不加掩饰。理智就是意识的如理思惟力和调控力，意识思惟力弱，无法对意根进行调控，意根的烦恼重就表现为没有理智。</p><p>愚痴的众生，意识几乎没有多少思惟力，都是按照惯性习惯生活着。投胎时，要按照意根的习性，也就是按照业力去投胎，被加持者除外。所以，意根不改变，与三恶道习性相应，肯定就要去三恶受苦道。只有断我见，成为初果以上的圣贤，才能保证不去三恶道，因为这时三缚结断了，不再被绑缚着去三恶道。</p><p>八、六识的思想活动</p><p>六识的思想活动就是想阴、行阴和识阴。想阴就是六识的想：眼识的想、耳识的想、鼻识的想、舌识的想、身识的想、意识的想。想，是心上有相，心取了相，了别了相，执取了相为想。六识都能了别相对应的六尘相，之后执取、认取六尘相貌为想。然后产生名言，进而有其它的思想活动，这就是行阴；内心的思想活动，包括抉择决定造作等等，这就属于行阴，属于思心所的范围。这些思想活动，以意识心为主。五识依意识心，也有各自的想和思，有想阴和行阴，有抉择和造作，但没有名言。</p><p>九、没有念想的微细意识</p><p>意识的各种状态，微细的意识是指什么，都有哪些？当我们比较粗重的意识分别作用不现前时，在比较明显而强烈的觉知作用不现前时，在情绪化的感受和各种心理作用不现前时，一般人就认为意识心已经灭去，不存在了，有些人还认为是入定，没有意识了，其实微细的意识还是存在着，还在起了别的作用，只是反观力不像原来那样强罢了。</p><p>比如在身体轻安的状态，心也定下来，觉知性就减少了，好像不知道身体和心里的感受，好像没有什么念想，有点傻傻呆呆的样子，好像忘记了身体的存在，也没有什么思想；但是意识心并没有灭，仍然在静静感知着，窗外明亮而暖和的阳光还是能看见和感受到，也知道周围静悄悄的，也知道自己没有什么想法，也知道此时比较清静和舒服；甚至心里还在细微地想着不着边际的事情，这是细微的乱想。而这一切都是意识心起用的结果，意识心如果不起用，就会睡着或者昏昧过去。</p><p>再比如学佛修定，内心中逐渐沉静下来时，感觉好像没有念头和思想，有些人就认为自己已经无心，意识消灭了。但是周围的一切情况还能敏锐观察到，只是心里的感觉细微得多，眼前的色彩是明是暗心里还是知道的，耳边是动是静也是知道的，有人过来碰触自己还是知道的；既然有知，就一定有意识心在了别，在感知，那就是比较微细的意识心在起用，并不是意识断灭消失了，更不可把此时没有粗重分别的微细意识当作寂静的第八识，那就大错特错了。</p><p>再比如入到定中的禅定状态，未到地定、初禅定、二禅定、三禅定、四禅定及四空定等等，这些定中都有微细意识或者是极微细意识的了别作用，除了外道无想定中没有意识，或者是阿罗汉的灭尽定中没有意识的存在，其余的定中都有意识的存在，只是微细极微细，不容易觉知到罢了。只因为意识的反观力弱，不容易反观到意识的存在，于是就认为自己无心，识心都灭了。</p><p>十、等无间，是指同类种子相等无间断的连续出生灭去。比如意识的识种子，前一个在某处出生灭去，后一个马上接上，也在此处出生灭去，这样一个个的识种子次第出生灭去，意识才能连续不断的进行识别了别活动。</p><p>等无间缘，等是相等相同同样，比如眼识的种子和眼识的种子是相等相同，意识的种子和意识的种子是相等相同，意根的种子和意根的种子是相等相同。无间，是没有间隔、没有间断的意思，一个挨着一个，没有中断，没有缝隙。等无间缘的意思就是，同类识种子，一个出生了马上灭去，紧接着下一个识种子出生在前一个识种子出生和灭去的位置，再灭去，之间没有间隔，是连续性的。前一个识种子能引导后一个识种子出生，是后一个识种子出生的缘，能开辟后一个识种子出生的处所。</p><p>只要有识心存在，就有等无间缘，识心灭去，等无间缘也不存在了。意根在无余涅槃境界中，本身就不存在，识种子也不用出生，等无间缘也不存在。这是识心出生和运行的其中一个缘，不包括所有的缘。</p><p>十一、问：当我在思维一个法时，心里却在自言自语说着其它事情，没有说出声。思维的心是哪个心？自言自语的又是哪个心？凡是有语言文字的不管是出声还是默语都是意识的作用吗？</p><p>答：能思惟法的识是意识，俗语叫作琢磨、核计，心里自言自语的也是意识，不管有没有语言文字，都是意识。因为意识比较细腻，能分析细节，了解具体情况。第七识不行，只能了解个大概的粗况，具体不知，细节不知。意识可以缘多个尘境，但容易散乱分心，识心分流，注意力就分散。但在定力相当好时，可以应付好几件事，意识完全可以分流，不会受到太大影响。</p><p>十二、觉知心，一般来说是指七个识，是觉知六尘的知，特殊情况专门指意识心，因为意识的觉知最强，范围最广。</p><p>魂，都是指意识心，能对六尘境界，能了别六尘境界，因为能了别六尘境界，才能被吓而惊慌失措，魂不附体，魂飞魄散，失魂落魄，魂不守舍。意根永远守着身体，不离不失不散，否则身体就成为尸体，第八识更是如此。</p><p>十三、细心体会身口意的行为，究竟与哪个识相应，主要体现哪个识的造作。当然所有身口意都离不开意根，也离不开意识，但是里面还有一些差别。身行，是六识的造作，这表面现象已经很明显了，虽然背后有意根的主导作用，也有意根的随从作用，更有第八识的作用。</p><p>口行，主要是意识的造作，以意识为主。当然其中还有五识的配合，也有意根的主导作用和随从作用，更有第八识的作用。意行，还有以意根的心行为主，主要体现意根的思想和心性。虽然也有意识的作用，更有第八识的作用，但是意行绝对完全与意根相应，是意根的想法和观念，虽然有意识的督导和调控作用。</p><p>十四、不感觉疼痛是否是好事</p><p>疼痛，就是身识和意识共同感觉到的触尘，是内相分，都是如来藏变现出来的。一种触尘来自于身体表面的接触，一种触尘来自于身体内部。外道修得神通，能生到最高层天，都免不了生死轮回，修到能忍疼痛，不知疼痛，又算得了什么，解脱是智慧解脱，与一些小神通没有关系。断了我见才能免除三恶道业，而断我见和三缚结都是智慧观行，智慧的结果，与能忍疼痛没有什么关系。</p><p>如果不再感觉疼痛，受了伤也不知疼痛，到底伤得怎样了也不知道，病的很重可能要死了也不知道，那就不会想办法救治自己，有可能就死亡了。如果身体得了癌症也不知道疼，到晚期也不知道疼，临终要死也不知道疼，最后的结果就是死亡，无痛苦的死亡。追求身体没有知觉，心里不感受不觉知，是没有益处的。真正的道不是这些，而是大智慧，有智慧就能获得一切，无智慧就能失去一切，无论解脱与成就佛道，都是靠智慧。</p><p>十五、意识是因缘所生法，要有尘境、有意根的作意与思、有第八识输送种子，五俱意识还要有五尘境与五识的配合，才能现起意识的功能作用。意识的功能作用包括觉知诸法和觉知五识、觉知意根、觉知第八识的功能作用，也能反观自心。</p><p>但意识不能时时反观，如睡着以后，意识消失不能觉知，更不能反观；做梦时意识有觉知，很难有反观力；昏迷时意识消失，没有觉知，也没有反观；死亡时意识消失，没有觉知，也没有反观；中阴身时意识有觉知，反观力弱；二禅以上，意识有觉知反观力非常微弱，或者没有反观；无想定里意识消失，没有觉知，也没有反观；灭尽定里意识消失，没有觉知，也没有反观。愚钝的人有觉知，反观力弱，或者没有反观。</p><p>十六、意识是否是觉性</p><p>意识有觉知的功能作用，但不能直接称为觉性。因为觉性代表觉悟的心性，一般指本体第八识的无无明性，有时候也指觉悟以后有大智慧的六七识，没有智慧不觉悟的时候，不能称为觉性。可说意识有知性，能知各种法尘境界。</p><p>十七、一切物质色法，不管识心去观察与否，其状态是一样的，不会是识心观察时是一个状态，识心不观察时是另外一个状态。没有识心观察，谁能知道色法是什么状态？只能猜测，猜测出来的法，不可靠也不可信。所以并不是所有科学都有科学性。</p><p>比如说张三的外貌，不管他人的识心观察与否，大体上不会有什么大的差别。自己家的房子，不管自己在家与否，观察到与否，房子总是那个样子，不会有什么差别和变化。包括自己所能接触到的一切物质色法，不管自己是否观察，其相分都是差不多的，不会有什么差别和改换。</p><p>十八、有名言的意识与无名言的意识</p><p>婴儿看天花板，还没有天花板的概念，眼识意识就生起了，这个时候意识是没有名言的，但是作为人类的名言种子是存在的，只是出生名言的因缘不成熟。名言与意识心相应，是意识心安立出来的。意识分为两种，一种是有名言的意识，一种是没有名言的意识。也就是说意识了别以后可以出现名言，用名言来表达自己的觉观，也可以不出现名言。意识先有觉观思惟，然后才生出名言，安立名相。</p><p>眼识看天花板之时，肯定是眼识先生起来，然后必须有意识在一起配合，才能了别天花板；意识了别之后，才有了觉观，才能有名言的出现。但是婴儿的意识这时还没有概念，只有觉观，因为还没有经过后天的学习，没有形成天花板的概念，对于生存所需要的知识还不具备，因此这时只有觉观，没有名言。</p><p>十九、法尘，在五尘上本来就有，与五尘一起构成尘境，不能单独存在。比如花儿的美丽性是花儿的法尘，与花儿的本体是和一起存在的，有花儿就有美丽性，花儿消失美丽性也无。不是因为意识了别以后，才新出生花儿的美丽性，只是这种法尘意根不能细微了别，要由意识来细微了别，然后才能知道花儿是美丽的。美丽性先由意根接触，但无法细分别，就交给意识，意识就能分别出花儿的美丽性，分别时，也不能离开花儿而去了别美丽性，离开花儿，就找不到美丽性的法尘。</p><p>美丽性的显现，是由三个能变识共同显现出来的，不能离开意根。色尘上能同时显现出形色、表色、无表色的法尘，韵味属于无表色，气质、修养、素质都属于无表色，与色尘同时同处出现，不可分开。</p><p>二十、意识思惟观察的重要作用</p><p>从隔阴之谜、醉酒、梦游和催眠的现象，看意识的作用究竟有多大？讲意根，就把一切都归于意根，而忽略了意识。现在思惟意识的作用，这是断我见最重要的一个环节。</p><p>这个问题的思路应该是这样：思惟分析隔阴之谜的种种现象，找出都有哪些现象，然后从这些现象当中观察意识的作用有哪些，有什么特点，有多重要，这叫作意识的反观，也叫作证自证分。</p><p>再依次思惟分析醉酒之后的现象都有哪些，从这些现象上观察意识的作用和特点以及重要性；思惟分析梦游以及醒过来之后都有哪些现象，从这些现象当中观察意识的作用特点以及对领悟六尘的重要性；思惟分析催眠以及催眠之后都有哪些现象发生，观察这些现象当中意识的作用特点，以及意识对六尘分别的重要性。</p><p>以上思路是授人以渔，而不是单纯的授人以鱼。掌握了渔的要领，会使用渔，以后就能自力更生了。</p><p>要学会观察，会寻找和分析现象，观察力非常重要，这是以意识的智慧为主，里面也有意根的智慧。只有意识的智慧先具足了，意根才能提升智慧具足智慧。意识的智慧在先，意根的智慧在后。意根具足了智慧，后世时，意根的智慧在先，意识的智慧就在后。然后意识以此类推，又出生其它的智慧，再带动意根，让意根也具足其它智慧。生生世世就是这样一步步一点点的转变了六七识，最后转识成智。</p><p>很多人连意识的智慧都没有，无数事实真相摆在面前，都视而不见，无觉无知，非常愚痴。很明显很明白的现象都看不明白，理不出头绪，甚至被人告知了一遍又一遍，仍然不知所云。如果意识的思惟力都没有，观察分析能力都没有，那就谈不到具足智慧了，更谈不到熏染带动意根也同样具足智慧，愚痴无明不破，解脱就一点希望也没有。</p><p>二十一、法尘包括色法尘、心法尘和非色非心法尘。色法尘是法处所摄色，心法尘包括七个识和心所法，也包括第八识和心所法，非色非心法包括心不相应行法。法处所摄色，就是五尘色法上所显示出来的法尘，叫作色法尘，也是由四大种子组成。</p><p>心法尘是意识所能对应和了别的八个识心以及识心的所有心所法。当意识有智慧时，尤其是转识成智以后，意识就能了别到八个识，以及八个识心所法的一部分，能全部了别时就是第三次转识成智的佛的果位。意根依意识也能了别心法尘，开悟以后了别的有所增加，转识成智以后能了别更多一部分，成佛以后全部都能了别。</p><p>无色界天人定中，意识也缘定境，是独影境，意识的思惟，需要独影境，也许思惟色法尘，也许思惟心法尘，也许两者都有，不一定。无色界天人生存环境里没有色，也就没有法处所摄色，所以没有什么环境，只有独影境法尘，直接从如来藏种子里出生，那就不妨有色法尘的定果色。</p><p>如果定境里有七识和心所法的法尘 ，意识就要缘七识和心所法，那意识动得有多粗，这可能吗？不可能。不管什么人，如果定境里有七识和心所法，意识一定在思惟，这个定境就浅，二禅以下。二禅以上是无觉无知，没有觉观思惟，初禅以下包括初禅才有觉观和思惟。</p><p>二十二、见闻觉知性是如何出生的</p><p>（一）第八识中本来含藏着七大种子，七大种子常存在第八识里，其中之一就是识大种子。第八识输送出识种子产生前七识，如来藏为前七识输出识种子以后，前七识就开始以心所法的形式运行。</p><p>第七识现行出来，也是以心所法的形式运作，现行的前提必须有第八识为祂输送识种子，而只要不是处于无余涅槃里，第八识刹那刹那都为第七识输送识种子，一弹指间就输送出八万一千个生灭种子（数字仅仅是个比喻，表示一刹那中输出种子的数量非常多），一个种子生出来灭去；又一个种子生出来，然后又灭去；生了灭，灭了又生，就形成了第七识无始劫以来连续不断的运转，五遍行心所法一直伴随着第七识不断的循环往复的运行。</p><p>第七识如果想要了别六尘，就生起思心所，第八识配合祂出生六识。眼根就趣向于色尘，耳根趣向于声尘，鼻根趣向于香尘，舌根趣向于味尘，身根趣向于触尘，意根就趣向于法尘。六根和六尘相触相对应的时候，第八识马上就输送出六识的识种。眼识就开始动了，眼识的种子一个一个生出来，非常的快速，刹那刹那生出来，生出来又灭去，生出来又灭去，这样就形成了眼识一段时间内的了别性，眼识的了别性也是以心所法的形式来运作的，主要是以五遍行心所法来运作，当然眼识还有善心所法，还有烦恼心所法，还有五别境心所法有时也要现行出来，其他几个识亦复如是。</p><p>第八识为第六识输出识种子，就出生了第六识，识种子刹那刹那输送出来形成连续的识心运作，就像一滴一滴水连续流出形成了水流，就有了一定的了别势力，能起识别、了别、思惟、判断等作用。如果第六识在很多法上都要了别，祂的分别势力势必就要弱，了别法尘时就不可能了别得太清楚，智慧力就不能生起，这是由意根到处攀缘造成的结果。但是如果意根减少攀缘，少于作意，让意识只了别一种法尘，第六识就可以在一个法上详细分别，第八识只往这一种法尘上流注意识心的识种子，这样意识心的分别势力强大，了别就清楚，智慧力就强。</p><p>接着，这些识种子再一个一个的回到第八识中，又从第八识中生出去，又再回来，象循环水泵似的不断循环运转，第六识就这样一直在分别着。第六识的运行也是以心所法的形式来运作的，其中五遍行心所法肯定要伴随意识心运作，还有其它的五别境心所法，还有善和烦恼的心所法，还有不善不恶的心所法，这些心所法有时都要伴随着第六识起用。通过心所法的不断运行，七个识就能了别世间的一切境界，于是我们就有了见闻觉知性，就能了别这世间的一切法。</p><p>（三）识在触尘时，根尘识三者和合触，其结果是什么？六识的作用都是什么？三者和合触，这件事非常重要，其结果是识有了受、想、行的作用，身口意由此造作出来，业种留下来了。如果识不触尘，识就没有任何作用。</p><p>各个识都触什么样的尘？把各个识所能触的范围弄清楚，所有的法都能了解思惟透彻。然后思惟没有六识还能作什么，这些用都是六识造作出来的，是生灭虚妄的。</p><p>无色界众生没有色身五根，为何还有意识的存在，意识依于什么而存在的?意识了别功能的强大是依于什么条件？这些问题弄清楚了，将来无论在大乘还是在小乘的修证上，都能悟得深透一些。很多人观行都不全面不深透，仅在意识上理解的人越来越多，证不得内心就没有什么功德受用，烦恼还是照样很重。有些人看见别人说东道西的，凭其聪明伶俐，也能了解其中某些关键处，自己就觉得好像是悟了，可是并没有参究出问题的根源和实质，因此并不是证悟。</p><p>根触尘，生识，根不触尘，就不能生识。命终四大先分解，这时还有识的存在，还能了别和感受，所以感觉非常痛苦。每个人的色身都是自己的第八识所执持的，自己色身的改变也是自己的几个识作用的结果。那么一个人如何能去杀死另一个人，从而改变另一个人的色身状况呢？没有意识，五识不能生起运转，了别六尘是意根的决定，由意根作主宰，意根一定是触法尘的；意根不决定，不作主宰，第八识就不生五识；而意根主宰了，就是触法尘了，之后一定生意识，意识也是五识的俱有依。</p></div>"
},{
    "title": "第三章 意识与禅定",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  意识与禅定</strong></p><p>一、睡眠和禅定的区别</p><p>所谓的禅定，就是心念集中不散乱，收摄六根，缘于一境，不杂乱攀缘。眼识意识专注于一处色尘，屏绝其他的尘境；或者是耳识意识专注于一处声尘，屏绝其他的尘境；或者是意识专注于一处法尘，屏绝其他的尘境。六识的这些专注，以意识为主，由意根统摄一切法，意根若不杂乱攀缘，只缘于少数的法尘，六识就能够专注一境。因为意根是作主识，六识都要听从意根的旨意，所以降伏意根，修定才能有成效。</p><p>所谓的睡眠，就是六个识都暂时断灭而不出现，这样身心才能消除疲劳。如果六识不灭，识心就要现行活动，与清醒时一样，这就不是睡眠了。那样身心就得不到真正的休息，身体感觉还是照样的疲累。</p><p>睡眠分为有梦与无梦两种，睡着无梦时，六识不现起，只有第八识和第七识在坚守岗位，以维持色身的生命活动；有梦时意识心在梦境中参与轻微的分别活动，这样睡眠就不深沉，身体不能得到充分的休息，第二天就会出现疲劳的感觉。</p><p>禅定和睡眠二种情况当中，都有第七识和第八识的运行，禅定当中的第七识已经得到有效的降伏，攀缘减少了，攀缘越少越轻微，意识入定就越深。睡眠当中的第七识仍在攀缘身根和法尘，只知道身体需要休息，不让六识出来分别而已。</p><p>初禅前的定中，有六个识分别六尘，但分别六尘的程度不同，识心的专一程度不同，身心感受也不同。初禅当中鼻识和舌识不现起，二禅以上的禅定，前五识消失了，只剩下第六识、第七识和第八识，意识住于比较深细的定境当中了别定境法尘。无想定和灭尽定中，意识也灭尽，只剩下第七识和第八识。</p><p>二、五俱意识比独头意识的了别力大</p><p>比如说意识心想着方的月亮，大脑里就出现一个方的月亮；看天上的圆月亮时，再想象眼前的月亮是方的，可就是想象不出来方月亮。这是意识的定力不足，被眼前的境界干扰了，很难再清晰的非量想象构思了。</p><p>开眼时，意识所见的是五尘上的法尘，闭眼时意识想象的是独影境。如果开眼看见五尘上的圆月亮，五俱意识了别完圆圆的月亮，又有眼识的现量配合，亲眼所见的力量就强大，意根就能确认和支持。看完圆月亮，再来想象方月亮，就很困难，因为圆月亮的影像一直留在意识心中，意识要同时分别两种境界，识心就被分流了，所起的想象作用就很微弱，想象方月亮就不太容易。</p><p>独头意识最容易受到干扰，方月亮的想象力就不具足；毕竟独头意识是非量了别，外在的缘比较少，圆月亮是现量了别，再加上眼识同时了别，想象圆月亮的势力就大，想要独影境现前就比较困难一些，所以心中的方月亮就不容易出现。</p><p>如果意识的定力相当好，独头意识有可能要占上风，心中就能想象出方形的月亮，这与色尘上的月亮相违背。这时的圆月亮，可能要与方月亮轮流出现，一会儿圆，一会儿方。定力非常好的人，可能两个月亮都能同时显现出来，也可能只显现一个方月亮。试试练习一下自己的定力，看哪种意识能占上风。如果这种定力能够练习出来，将来就能改变一切法，也能一念之中变现出三千大千世界。给人治病调病，也全靠这种定力，改变他人的心意，也全靠这种定力。</p><p>三、意识的思惟功用，在什么情况下，才能得到最大程度的发挥，思惟的最好最清晰？意识只缘一法，或以一法为主，缘两三个法，从散乱朝向专注时，思惟最为清晰，这是禅定力的作用。散乱时，意识思惟力弱，思路不清晰；定太深时，意识不能动，心念停止，思惟很累。只有在既有定，定还不过于深时，意识的思惟才能深细而清晰，思路开阔。</p><p>四、意识在清醒位，在六尘很多的法尘上了别，心识种子的流注比较分散，但也有一个主导方向，要想完全流注在一个法上，除非经过训练，如修定有了定力，定力越深越能集中流注。所以佛才教我们修定而后观行参禅，这样才能有成效。但一般人也不可能将心识种子平均分布在两个或两个以上的法尘上，总是有主有次。如果需要同时了别几个法尘，意识的注意力就要在不同的法尘上不停地跳跃。比如说，我们走在车辆人员都非常多的路上，意识要不停地了别色法尘、声法尘和触法尘，在三个法尘上都要同时流注识种子，但也有主次之分，主次关系随着外界的变化而不停地切换。</p><p>上述的说法对于一般人来说是正确的，也就是对于没有定或者定少，没有经过特殊训练的人是如此。如果经过训练，定力比较好的人，即使同时了别多个境界也有定力，都能了别清楚，所谓眼观六路耳听八方者是也。定力好的人，同时作几件事也没关系，都能作好，精力都能高度集中在几件事上，应付得很好。识心训练有素，定慧都非常强，就是如此。</p><p>五、想问题的时候手会拿错东西是怎么回事</p><p>在想问题时，意识可能非常专注的思惟问题，只有极少部分的精力去注意手要拿的东西，所以就无法正确判断选择要拿的东西是否是自己所想要的；身识分辨东西的能力非常差，一定要与意识心一起来分辨才行，意识心一分散，就会拿错东西，所以注意力不集中，不专一，就会做错事。但是训练有素有定力的人，他可以眼观六路，耳听八方，各方面的事情都能协调得很好，做得很好，所以专注、禅定、定力是非常重要的。</p><p>有定力时，意识思惟就能清晰明了，有智慧，就能把事情做得井然有序，世间法上的慧和出世间法上的慧都是如此。在佛法上要把一个法义思惟清楚，注意力就要非常专一，没有杂念干扰。专注思惟以后，才能明了法义的内涵，才能理解经中的真实义，所以注意力专注是很重要的，定力是生起智慧的关键和前提。极个别训练有素的人能够一心多用，同时能应付好几件事，是因为他的定力高强；而有的人做一件事都做不好，因为他的意识心太散乱，没有一点定力，思惟就紊乱肤浅，因此任何事情都做不好。</p><p>六、有个科学家看书非常专心用功，吃馒头时沾着墨汁吃而不觉知，他的意识全部专注在书中，他这时是否有舌识呢？有舌识肯定知道墨汁不好吃，他为什么不知道？</p><p>吃东西一定有舌识参加，意识不能单独品尝食物。专心看书时，馒头沾着墨汁吃而没有发觉，这种情况是意识专注于看书，不注意吃什么，有分别只是分别的比较模糊，舌识是存在的，仍然在分别食物，只是分别食物的粗相，细相是意识心所分别的，比如是哪种食物，具体的味道口感如何，舌识不能分别这么细。如果意识心专注在看书上，舌识又不能分别很细，因此吃了墨汁那个科学家也没有发觉，不觉知。由这个例子也可以证明，修行人只要不在意世俗法的享受，就能减少对世间法的贪着。</p><p>七、有些人有灵魂出窍的体验和经历，不知道是哪个识出体了。当灵魂出窍的时候，这个人并没有死亡，生命体还存在着，那么第八识和意根就共同维系着色身的生命活动，没有离开色身。前五识又不能离开色身五根而能单独存在，有单独的分别性；只有意识心能够离开身体，不需要五根的配合就可以有识心活动，但是意识的存在和分别活动，也不可能离开意根和第八识而有，三者是和合在一起而密不可分的。</p><p>众生总共有八个识，意根和第八识可以随时随地在色身外，甚至能在过去世和未来世，但同时又不离开色身，不离现在当下。因为第八识遍一切处，遍一切法，遍一切时，在祂那里，没有空间距离，也没有时间，没有三世；意根随着如来藏，也没有空间距离，没有三世。</p><p>意识心要想主动出离身体，需要有某种神力的加持或者要有禅定的功夫，依靠定力才能离开色身而单独活动。定有深有浅，浅定仅能偶尔达到一心专一的境界，暂时忘却色身，不理会色身的存在，这时意识就能出离色身以外。意识出去以后，能看见自己的色身处在什么状态，是死亡的状态还是打坐的状态，周围是什么情况，意识都能了别到。</p><p>留下的色身，虽然能躺着或者能打坐，却没有情感，不带情绪，内心麻木，就像机器人一样，而情感情绪正是意识的功能和觉受。如果寿命没有到，与此世的缘还没有了，意识还能回到色身当中，五阴的功能就能恢复正常。意识出体，在菩萨那里叫作意生身。菩萨明心见性以后，再修出四禅八定，就有意生身的出现，在肉体五阴身的基础上，意识再化现出多个的色身，像天人的色身一样，比较虚灵，没有实质的肉体，因此就有无量神通道力。诸大菩萨的一百个化身、一千个化身甚至更多的化身，都是意识心修出四禅八定以后所变化成就的，是第八识、意根和意识三个能变识和合运作的结果。</p><p>八、意识离体的时候，感觉就是飞在身体的上方或者旁边，而看着身体。意识不离体的时候，感觉与身体是一体不可分的。这些感觉毕竟是感觉，不管离体与否，都不真实。应该好好参究一下楞严经中所讲的一切法的如来藏性，都没有出如来藏之外，在如来藏里，如来藏根本没有里外。那么这些法是什么或说者是什么状态，有没有实体，这些内容非常重要，简直太重要了，悟透这些法，心一空到底，这样才能直接成佛，其它的都不能直接成佛。</p><p>九、意识有离体这种现象，这时候一是处于定中，二是意识有非常独立的反观性，能反观到自身（身体）的状态，反观到自己的心念和感受。但是与意识不离体的那种反观不同，比较客观，就像观察另一个人似的。这与人离魂很相似，当一个人动手术时，六识灭了没有感知了，或者是人昏迷了死亡了以后，识神离开身体，看着身体，想办法回到身体中，想活过来。这两种现象相同，只是心境不同。意识离体以后，身体就像木头一样麻木没有情感和思想，但可以活动，意识观察身体，就像观察另一个物体似的。</p><p>十、我们修行人，要想实证佛法，定力是极为重要的，每一步佛法的实证都要靠定力来观行，而后才能明了诸法实相。比如说，要观行到底是眼识先出生，还是意识先出生，是先有显色还是先有形色，都必须先有定力才能观行得到；否则心思散乱，肯定观行不出正确的结果来。我们可以看外边的景色，可以看天空，看树，看花草树林，看河流，当眼识放出去的时候，先看看眼睛所对的外境，是先看到显色，还是先看到形色，或是先看到这些色里的内涵，这样一步一步的，有了定力才能观行出来；若没有定力而只靠大脑想象，是绝对想不清楚的，也无法实证佛法。</p><p>佛法的实证，离开定力都不叫实证，那都是想象、思惟、情思意解。靠情思意解，我们不能有真正的智慧，原来有的智慧也不会提升，只从外边学来这点智慧，智慧增长非常慢。没有定力，即使勉强明心了，知道第八识在哪里这个答案了，但是观行不出来，智慧也不能得到增长，观行智也不能出现。</p><p>离开了定力，明心以后十住位的如幻观就现不起来，身心特殊的觉受也不会出现，身心不能发生任何变化。若身心感受没有变化，就没有证得如幻观；离开定力，十行位的阳焰观也观不起来，就没有阳焰观的那些身心觉受，不可能越过十行位；再加上十回向位的如梦观，若缺少定力，如梦观的感受也不会现起。这些观行，若一观一观的都过不去，那菩萨的道业就原地踏步，不得增进。离开定，想实证佛法，那是天方夜谭。有了定力，在断我见和明心的时候，身心的那种觉受和禅悦简直没法用语言表述，以后的智慧增长、定慧增长、菩萨果位增长也都快得很。</p><p>如果要观行是耳识先听到声音，还是意识先听到声音，耳识听到的是什么样的声音，那必须得修定，动中定和静中定都要修，定力足够才能观行。不是说先观行，而后再修定，这样是颠倒修行；即使修成了，也是通过前面的散乱观行，渐渐达到心止一处，定力具足，然后再开始真正的如理如法的观行，还是先定后观，叫作止观，不是观止。</p><p>如果没有打坐的禅定（静中定），只有很微弱的动中定，也没有太大的作用，而打坐这种静中定，能养动中定，并让我们的思惟能够很深入、很细腻。我们要观察体会听声音时的耳识和意识的活动，就可以在定中观察，外边出现一个声音，你就观察声音对耳鼓的振动是什么样的，耳识听到的是什么样的动静，要一一分别出来。但如果没有定力，那是万万观察不到的。而且对定力的要求不能是一般性的，要比较深一些比较专一的那种，才能观察出来。一个巨大的声音，一个微小的声音，先是观察耳识和意识分别听到的是什么，耳识听到的音声对耳鼓耳根有什么影响，然后再观察意识听到的声音、感觉到的声音，都是什么状态，如果你都能一一了别，就能分清楚是耳识先出生，还是意识先出生，两个识各分别的是什么样的尘境。这些观行里，都有定慧的现行，缺少一样，观行就不能成就，因此修学佛法，就是定慧等修，止观双持。</p><p>再比如说观行意根的法，不但要有禅定，还要有智慧。若没有禅定，就算把意根的法都告诉你，还是观行不出来。等有了禅定，又有一定智慧的时候，再把意根的法教给你，然后看着文字，随着文字观行观察，就能够很快证得意根。证得意根以后，还能观察到意根的一些微弱的体性，那智慧就很了不得了。如果缺少禅定，就算把意根运作的各种法告诉你也没有用，因为证不到意根，就观察不到意根，就不能真正了解意根的体性，智慧就不能有实质的增进，换一个情景又不知道意根是如何运作了。</p><p>所以智慧的增强，菩萨道的修证，各种层次的观行，离开了充足而必要的定力，都是无法做到的。离开了定力，要想有观行的智慧、真实的智慧，那是不可能的。佛给我们讲了“戒、定、慧”三无漏学，我们千万不能把戒丢弃，不能把定丢弃，然后只要一个乾慧狂慧，这差不多相当于画饼充饥一样。有一些人，佛法的知识和大道理好像懂得很多，好像有智慧了，也能够侃侃而谈，但是所谈的内容，只是一个空洞洞的理论，讲不出具体要如何操作，以实现这个理，让事符合这个理，都是在笼统的道理上的语言描述，非常不具体，很粗糙，说明自己并没有实证，讲不出具体的如何修证问题；尤其是尽管能侃侃而谈，心行却不能改变，不与所说相一致，没有任何心性上的解脱的功德受用。</p><p>如果我们不用功修定，缺乏定力，那么越来越深的法，越来越细的法，就没法理解，更谈不上观行，修行就逐渐跟不上，就要掉队了。然后就会失去信心，就转身去学其它的浅法，而那些浅法有很多的错漏之处，自己没有能力分辨，学了一辈子也证不到佛法，自己宝贵的时间也白白浪费掉了。</p><p>为了身心的大解脱，为了实证佛法，为了早日得成佛道，我们一定要重视禅定；若没有禅定，遇到关键而重要的法，就不能理解和消化，那就证不得，殊胜的佛法就受用不到，就不能依之得解脱。所以奉劝大家尽量抓紧时间，充分利用现有的条件，甚至要创造条件来修定，行走坐卧的动中定，打坐的静中定，我们都要修，把自己的心修得随时能静下来，修得再细致一些。这样再观行所学之法，就容易证得，之后就能发起智慧，知识就转化成自己的实证体验，有真实的受用。这样修行，定慧都能不断的增进而圆满，修行非常快速，功不唐捐，就能取得佛道上最大的成就。</p></div>"
},{
    "title": "第四章 意识的记忆性",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  意识的记忆性</strong></p><p>一、记忆，就是记别和忆念，这是意识心的功能作用。当前所发生的一切事情，身口意的一切造作，都有意识心的参与运作，意识所了别和造作的内容随时随地都交付给意根，意根了别以后，就作为种子落谢到第八识心体中，第八识就把这些内容作为种子存储起来。以后当意根攀缘想了别时，第八识了知到意根的思心所以后，就随顺配合意根，把从前存储的种子输送出来，这样就形成了法尘。意根触法尘以后，因为了别慧不细致，了别不了具体的内容，就生起思心所，决定要细了别这个法尘，于是第八识就配合出生意识，这样意识就了别了到底是什么法尘，也就是说意识想起从前的事情来了，这就是记和忆的过程。</p><p>如果发生的事情不完整，或者是意根不在意，意识了别和造作的轻微，业行就轻微，第八识存储的业种就轻微；第八识输出种子时形成的法尘就不是很清晰，意识了别的就不完全，也不清楚，俗话叫作记忆不牢。比如说，我们背一篇文章没有完全背熟，这个业行也作为种子存储起来，第八识再输出时，意识就不能完全了别清楚，这篇文章就不能完全背诵出来。</p><p>再比如说，意根不太在意一个人，对这个人的作意很少，思心所就没有相当的决定性，意识对这个人了解认识的也就不完全，印象不深刻，此事也作为种子存储起来。当种子缘熟，再遇见这个人时，第八识输出过去的业种，意识就不能清楚的了别这个人，对这个人的印象就模模糊糊的不清晰。</p><p>第八识输出业种，形成了法尘，业种输出给胜义根时，如果胜义根有问题，有障碍，比如小脑萎缩等等障碍，第八识输出的影像与业种就不能完全一致，显现出来的法尘是不如实的，这时意识心不能正确无误的了别，就成了颠倒的了别，或者根本就不能了别，这就是失忆症。</p><p>胜义根受到毁坏，或大脑受过刺激，或者大脑缺乏营养，都能引起不同程度的失忆。所以学生考试前要加强营养，就是要胜义根中的四大物质成分协调，能够让第八识正常的变现出内相分的影像，意识才能够正常了别这些影像，临场考试时思惟才能清晰，才能发挥好，考试成绩就好。</p><p>胜义根如果有问题，第八识变现出的影像可能就成为混乱的信息，这样意识的了别就混乱，就可能出现颠倒的了别或错误的了别，别人就认为这个人精神可能不正常，而他自己却认为很正常，丝毫都不认为自己是不正常的。</p><p>二、婴儿为什么记忆力比较差</p><p>这里所说的记忆力，就是一种记别和忆念的能力，也叫作印象。什么叫作印象（像）呢？印，就是烙印，用手按在某处，或者用某物按在某处，就是印下来，刻下来，印持下来；象（像）就是影像，留下的痕迹，按在某处和印持了之后，才有像，这叫作印象。印象与念心所有关，与记忆有关。</p><p>印象有深有浅，印象深刻，是经过反反复复多次的按和印，或者是深深地按和印，留下的像，印出来的像就很深刻。深深和反复多次的印持于心，就是定，定于一境不变动，才能印象深刻。记忆里有印和象（像），以后遇缘才能把印象回忆出来。记忆的前提条件，一个是要有胜解，能够理解明白所经历人事物理的真正意思是什么，才能印持下来，形成影像，往后才能有记忆；另一个前提是要有定，反复印持于心，深深地印持于心，才能有深刻的印象。</p><p>婴儿没有多少记忆能力，记忆差，因为婴儿胜解力弱，此事对极大多数事情没有经验过，没有体验过，也就没有比对的能力，加上思惟力非常微弱，因此就没有多少胜解，很难留下印象，也就记忆不下来。婴儿心力弱，也没有定，不能专注，他们就不能把一切人事物印持下来，因此记忆力就差。婴儿大多数事情需要父母反复教导，多次重复，才能有一点记忆。但是这不包括婴儿自己所习惯和感兴趣的饮食与玩具等等，不包括婴儿天生的与生俱来的习性，因为这些先天性的习惯和兴趣是从前世带过来的，生来就如此，世俗人称此为本能，是每个生命体适应生存的一种与生俱来的本能性。</p><p>婴儿识心很弱，感知力差，思惟力差，他们因为没有多少胜解力，忆念力就极差，没有多少记忆力。但是有些特殊情况除外，比如婴儿有天生的习性，他们对触尘的感觉很敏锐，而承受力比较弱，又不能用语言表达，因此一不如意就要哭闹，以此来表达自己不舒适的感受。温饱属于触尘，婴儿非常敏感，再加上饮食是众生的生命活动所必需的，因此婴儿天生对于饮食和温饱有胜解，对于触尘有胜解，有记忆，但不是通过特别的思惟而来的，是本能就如此的。也因为饮食和身体上的触尘常常存在，婴儿也常常接触，相当于定在饮食和触尘上，婴儿对此就有胜解，有忆念，有记忆，除此以外，婴儿的记忆就很差了。</p><p>记忆是意识心的功能体性之一，在胎儿阶段，当意识一旦出现的时候，就有记忆功能，因此才有胎教。胎教，就是让胎儿听到母胎内外的声音时，内心有一定的理解，能受熏陶，从而得到教育。胎儿在母腹四五个月大的时候意识就出生了，那时就有感知能力，因此就有胎动现象。有意识心出生才有胎动，没有识心，身体就不会动；因为有意识心才能有胎教的作用，否则胎教就没有什么用处了。</p><p>没有意识心，就没有胜解和记忆，胎儿就不能受教。胎动，是意识和身识共同活动的现象，否则就不能动。意识和身识，能了别母胎中的环境，了别以后就有感受，这样身体就有了相应的反应，才有胎动现象的发生。胎儿了别声音时，内心一定有感受，内心的情绪就由身体表现出来，或者由静到动，或者由动到静。</p><p>以上说的胜解、定、忆念、记忆，都是意识心的功能体性，是意识心的五别境心所法，另外加上欲和慧心所法。与意识共同生起分别作用的五识，也有五别境心所法；婴儿只要有六识的存在，就一定有五别境心所法，只是这些心所法表现得微弱一些罢了，随着出生以后生存经验的累积，别境心所法的功用就能强大起来，记忆力才能随之增强起来。</p><p>三、问：回忆属独头意识，也是靠第八识流注种子而刹那回忆起来，意识为什么不能了别回忆前世呢？</p><p>答：此世的意识心，是此世新生的意识心，不是前世的意识心；此世的意识心没有经历过前世的人与事，当然就没有前世的记忆。如果能了别前世的人事，就不能叫作回忆，只有亲身经历的事情，才能叫作回忆。如果说能回忆前世的事，那是一种方便说法，这是以意根为主，从意根的角度来说的，因为意根能连接前世和后世；而意识是一段一段的，此世的意识能了知前世的事，严格来说不是回忆，而是间接了知。有神通的人如果说：我忆往昔，这个我就是指意根的我，虽然意根不能回忆，但是意根执著意识的功能为我，祂就要这样说话，这时意识是通过意根了别到自己未曾经历过的人和事。</p><p>前世的五阴与今世的五阴是非一非异的关系，既有共同的部分，也有不共同的部分。前世的五阴，不为今世的五阴考虑后果，造作了恶业，所以今世的五阴就要承受前世五阴造作恶业的苦果。前世与今世是否有联系？肯定有联系，意根和第八识还是前世延续过来的意根和第八识，习气秉性与前世还是一样，冤亲债主还是一样的，善业恶业种仍然一直都带着。今世如果继续再造恶业，后世的五阴就要受苦，而且还是自己的五阴在受苦，意根和第八识都不受苦。各位就好自为之吧。</p><p>四、意识有隔阴之谜。所谓的隔阴就是隔开的五阴，不是同一世的五阴，今世的五阴灭了，下一世的五阴又重新出生，身体和六识都换成新的，六识就不知道前一世的事情，对前世已经不能记忆了，这就叫作隔阴之迷。如果没有加修四禅八定，没有宿命通，也没有生来就报得的宿命通，六识对于前世的经历就一无所知。没有宿命通，就不知前世后世的事情，有宿命通就能知道自己和他人的前世后世的一切事情。</p><p>众生前世死后，此世的五阴变成新的了，六识也是新的，已经不是前世的六识了，肯定就不知道前世的人事物。因为此世的六识心在此世的五阴上记忆了别一切人事物，只记忆此世的事情，所以只能了知此世所记忆的一切法。而此世的五阴，不是前世原来的五阴，六识对前世的五阴所造作的事情，当然就不能有记忆。</p><p>而意根从无始劫以来就一直存在没有灭过，祂自身蕴积着生生世世的烦恼习气。所以此世的五阴与前世的五阴，在习气烦恼上面是相续的，如果不学佛修行，习气就会越来越重。第八识也是从无始劫以来一直延续下来的，因此这世的五阴和前世的五阴就有连带的关系，不是互不相干的两个生命体。所以我们学佛修行，就要为后世的自己着想，不能只活在今世，而不管自己的来生。如果不想有隔阴之迷，就要修学宿命通，禅定修到四禅以后就能修成宿命通，但是宿命通与解脱和智慧没有多大关系。在没有证得菩提之前，没有必要修学神通，否则就成为障道的因缘。</p><p>五、问：隔阴之谜能导致往世已经开悟了，还需要此世重新再悟，那么是否可以理解为修行有倒退的现象呢？尤其是在无明的情况下又造作了好多业。</p><p>答：只要没有修得宿命通，即使今世开悟了，后世也是不知道的。后世一开始也未必能够信佛和懂得佛法，但是以今世所修行的善根和福德力，在后世因缘成熟之时又可以重新步入佛门修行，而且后世的修行将比此世修得更快速，修行一段时间以后照样可以明心开悟，这样就与此世的修行连接上了，他学佛修行可能都不需要他人的指导，自己就能顺着此世的修行方式而自行重新开悟。即使没有善知识的引导，自己也不会走入歧途，而且修行的层次不仅能与上一世连接起来，还可以超过上一世的修证水平。</p><p>当我们看到有些人此世修行的速度非常快，根性也很利，就无须怀疑他前世修行的根基深厚，基础牢固，才能成就他今世修行的深利智慧。今生修行非常缓慢的人，一定是前世就没有打好学佛的基础，佛法熏修的不够深厚，以至于久修而没有成效，甚至可能还走入邪途，熏修一些错误知见，自己也不知晓。有些人则是前世学佛就修错了，走错了路头，今生仍然顺着前世的惯性而照样修错法，而不知悔改。所以只要修对了佛法，只要是证悟了，就不用怕有隔阴之迷，此世懂得多种善根，多累积福德，后世的道业就能快速增进。</p><p>六、问：都说今世的意识是全新的意识，与前世无关，不了别前世。意识是意根缘法尘第八识所生，其所生难道带有特征？意识每天都是新的，均由第八识出生，毫无区别。记忆与胜义根有关，胜义根是成像处，意识只在胜义根处分别。今世的胜义根决定了今世的意识特征。之所以不记得前世，不在意识，在于全新的胜义根。因为胜义根是色法，前世的色法不能随其如来藏和第七识转世。意识的特征与胜义根相关，意识的性质由胜义根决定。从胎儿就开始建立这一世的胜义根，以及这一世的意识特征。同一个如来藏出生的意识，其心所法是一样的，不同或者差别还是在于胜义根，是否是这样？</p><p>答：意识是意根与法尘相触之后，如来藏出生的。意识依五阴身而有，五阴身改变，胜义根改变，意识就变了。前世今世意识所依的胜义根不同，意识就有差别。梦中的意识与醒时的意识也有不同。今天和昨天的意识，是同一个意识，同样的五阴身上的，记忆同样的内容，但是也稍微有些差别，认识事物有差别，观点看法有差别，记忆有差别，了别性有差别。尤其是业障发生变化，胜义根发生变化，意识的了别性认知性，就有变化。</p><p>记忆问题，与业种有关，与胜义根有关，与意根有关。意根感兴趣的，记忆肯定好；意根越在意的，记忆越好。</p><p>意识出生有一定的缘，缘不具，意识不出生；缘改变，意识就改变。梦中意识与醒时的意识，识种子是一样的，可是梦中独头意识了别的内容，醒时的五俱意识不容易知道。当植物人时的意识，与正常时的意识，更是有所不同。胜义根没有阻碍，大脑营养丰富，意识的记忆功能就好；反之，大脑缺乏营养，意识的记忆功能就减弱，了别性也减弱，思惟也减弱。小脑萎缩的人就是这样，还能出现幻觉和不正常了别的现象出现。</p><p>七、问：为什么观行佛法时，记忆就牢；不观行，强记的就不容易记住呢？</p><p>答：观行，就是思惟，意识思惟时，意根就受熏。意根了别了，第八识就把它作为种子，存入自己的库房里。种子将来遇缘，就能从库房里被取出来，自己就能享用到了。如果不思惟，单纯地记忆，意根没有受熏，对这些内容就模模糊糊的，这也作为种子存入第八识库房里，但存入的种子就不清晰，种子不容易成熟，不容易呈现出来，或者虽然呈现，也是模模糊糊不清晰的，意识就不容易回想清楚。</p><p>八、有些学佛人，经文很熟，张口就来，好像是明白其中之义，其实是没有真正明白。因为经文太熟了，不容易再去思考其中的真正含义，就停止在对表面意思的理解上。读经背经，是意识用心，比较省力，不用深思，不累脑不累心。而深思，就要动用意根，牵动大脑神经细胞，耗费大脑能量，身体要源源不断的为大脑提供气血资源，心里感到累，于是众生就挑选比较轻松的事情做，只是读读经，背背经，再加上定力和慧力不足，就不能作以深思。</p><p>读经念咒，都是以意识心为主的心识活动，意识作用突出。背诵经文和楞严咒，也是以意识心为主，意识作用突出。背熟以后，意识就能快速背诵，也能背得很熟练，像行云流水一样，非常流利，不用思惟。如果背诵得稍微慢一些，意识的作用就减小一些，意根的作用就突出一点；如果再慢一些，意识的活动减弱，意根的作用就增强，越慢越能突出意根的作用。结果就是，意识活动越少，背诵越不流利，最后就想不起来要背诵的内容。</p><p>因为意根不能回忆，不会背诵经文，回忆属于意识的功能，意识活动减弱，功能发挥的就小，背诵就困难。在清醒的状态下，意识的活动越少，定越深；而定越深，意识越少于现行。当意识的活动小到一定程度，干脆就不能背诵经文了，口不能动，一个字也吐出不来，甚至心念要停止，心里也不能默诵了。</p><p>因此，要修习好禅定而能参禅，身口意行都要慢、慢，减少意识的活动，意根的功用增强，其直觉作用就突出。当意根的直觉作用达到一定程度，就能在行走坐卧中直接感觉到色身的机械化，从而能断身见，或者断我见，或者明心，这都说不定了，定就是起这种作用的。</p><p>没有定，或者是定浅时，意识的了别作用很活跃，那就起读诵、背诵的作用，起学知识的作用。虽然意识的思惟非常活跃，非常聪明伶俐，但所学较浅，属于理解范围和知识层面，内心深处还没有深解其义，因为意根没有证得。意识所学得的，都是他人的思想观点，也许都是佛说佛所证得的，但是自己并没有实际证得，都属于知识层面的东西。</p><p>这样学来的知识，不可以对外说是自己证得的，自己已经证明了是正确的；因为自己毕竟暂时还没有证明，也没有找到证据。只有在意根配合意识，深深的思量过后，真正的证得了，所思所想，才是自己的观点看法，是自己的见地，才可以对外说：我认为如何如何，否则就不可以说我认为我觉得。如果非要说我认为我觉得，那仅仅是意识的认为和觉得，与意根不相干，还不是真知灼见。</p><p>九、记忆是如来藏储存的法尘种子，不是前五尘相分，因为回忆出来的尘相只能与意识相应，前五识对回忆出来的尘相就不能了别。</p><p>一切法都可以作为种子存储起来，身口意行的一切行为造作，所经历的一切人事物理也就是六尘境界，全部作为种子由如来藏收存。之后意根攀缘想了别，如来藏就随顺意根的思心所，把种子输送出来成为法尘，就是独影境。意根缘了之后如果想细了别，如来藏就出生独头意识一一了别，这就是所说的回忆，所以回忆里有细节。</p><p>回忆出来的境界属于法尘，不是五识所能了别的，因此五识没有回忆的功能作用。前五尘的相分也作为种子存在如来藏里，因缘具足时，如来藏也要输出五尘，再依意根的思心所，如来藏出生六识来了别。但是，这不属于回忆了。</p><p>十、问：如来藏记录众生业行，记忆全部由如来藏记录，为什么一般人2-3岁前是无记忆的，或者说对小时候的事没有印象？</p><p>答：因为孩子小，他的意识的功能还不完全具足，小时候的事儿，就不容易记得，长大以后意识功能强大，有了一定的生存经验，记忆力才强。年纪太小，大脑胜义根还不完全发达，依胜义根而运行的意识功能就弱。比如在母胎里，胎儿也有意识，也许他也能记住一些事，但是出了母胎什么也不知道了。一岁两岁，三岁五岁之前，经历过的大多数事都记不住，那时候大脑还不够完善，意识的记忆力回忆的功能还不够强。</p><p>有些人的大脑有毛病，大脑营养不足的人，刚刚做完事儿，一会儿就忘了，大脑营养不良能导致记忆力不好。所以意识心里回忆的功能，也利用大脑里的物质，大脑不够发达，他的记忆就不好，意识的功能作用是依赖于大脑的。</p></div>"
},{
    "title": "第五章 贪嗔痴三毒的毒害作用",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  贪嗔痴三毒的毒害作用</strong></p><p>一、修行如果没有把贪嗔痴烦恼有效的降伏下来，心性就不能调柔，不能柔软，性障较重时，不仅能障碍道业，也能障碍自己的身心健康。烦恼性障重的人，一方面给他人带来烦恼和不愉快，双方难免结下恶缘和怨结，未来世自己也要受到烦恼的果报，苦受是避免不了的。另一方面最受害的还是自己，最苦恼的也是自已。当烦恼严重的时候，自己的内心就会感到苦受，感到烦躁，身心因此而受到搅扰，自己内心是最不愉快的。对方如果有修养也许不会受到烦恼的困扰，即使有苦受也能很快就过去，但是你自己却要不断受到烦恼性障的侵袭，心里总能生起忧悲苦恼。</p><p>学佛修行如果能降伏烦恼，我们生生世世都受益，都得自在和解脱。降伏了烦恼，不损恼他人，就不再流失自己的福德，不会与人结下恶缘；如果能处处都为他人着想，都给他人带来利益，自己福德的增加就很快速，受益最大的还是自己，所以一定要降伏烦恼性障。</p><p>烦恼性障重，心不清静，自己的身心要受什么样的毒害呢？贪嗔痴烦恼，我们通常叫作三毒。什么叫作毒呢？既然叫作毒，当然就有危害性和毒害性，危害别人还是其次，最受危害的还是自己。内心有贪嗔痴，身口意行难免就要造作贪嗔痴恶业，造作恶业就必然要受恶报，这就是贪嗔痴的毒害作用。</p><p>再者，烦恼障重而起嗔心的时候，色身必受影响，当色身受到影响时，身体的四大组织结构就随之发生改变，血液流动的速度也跟着发生改变，血液的成分也发生了改变，体内产生了毒素，毒素直接危害身体的健康。最明显的例子就是我们生起嗔怒的时候，面色表情在瞬间就变样了，变得又涨又红又紫又黑。为什么又紫又黑呢？有毒的物质往往都是紫黑色的，当血液的流通受阻，血液成分发生了改变，皮肤的色泽就明显变成紫黑，发生改变的血液成分对自己身体就有严重的毒害性。血液里含有毒素，血液的流动就不顺畅，心脏的机能就要受到阻碍，血液中的毒素能严重地侵害色身，身体就要生病。烦恼嗔心重的人，得心脏病的几率就比较大，得与血液有关的疾病也比较多。</p><p>贪嗔痴烦恼这三种毒素能侵扰我们的色身，更能侵袭我们的心灵，让我们生生世世苦痛不已，而且让我们流落三恶道受苦。因为嗔心重，暴怒的火气能使血液的流动不正常，身体负担加重。而且血液里面的毒素，也让心脏的血液流动变得不顺畅，爱发脾气的人就容易得心脏病和其它疾病，所以嗔毒的危害是最大的，既伤人又伤己。当贪嗔痴烦恼发作的时候，色身也跟着发生变化，血液里面的组成成分已经改变，气体和血液的运行就不正常，身体就会出现堵塞的状况，病根就由此而慢慢滞留了下来。</p><p>只要嗔心一动，身体就要受到影响，所以烦恼重的人，他的病也重，身体也不健康，现世身体健康就受到影响，何况是未来世。因为嗔心重，未来世的相貌就变得丑陋而不庄严。又因为贪嗔痴烦恼造作了恶业行，恶业就损减自己的福德，让自己流转三恶道，将来苦恼无尽。而且造了恶业，我们将来的色身就会出现各种各样的病苦；因为色身属于正报，所以恶业能直接影响色身，身体不健康，多灾多病，恶报严重的人大多是短寿的果报。</p><p>如果总是有事无事习惯于惹恼他人，让他人心起苦恼，感到不愉快，自己将来的果报也非常不好，所受的苦恼远远要超过他人。自己不但不愉快，心中苦恼，而且也要遭遇短寿的厄运，短寿与贪嗔痴烦恼有密切的关系，与造作的恶业也有密切的关系。造作了恶业，损害了他人，自己也同时减少了福德，必然要受到恶报。</p><p>最明显的切身例子就是：在我们生起贪心的时候，心念因贪而变得不清静。心念不清静，就会影响到色身，色身中的水大就跟着发生改变。因为水是往下流动的，在临终之时，贪心之水就使得自己下堕到三恶道。因为贪心生起，也使得色身的血液流动加快，头脑不冷静，思惟不清楚，对一切事物的反应就变得迟滞混乱，对人事物理判断处理的就容易出现偏颇和极端。</p><p>在起嗔心的时候，四大的组成比例和排序就要发生改变，色身血液的四大结构就跟着发生改变，毒素就这样产生出来了，接着血液的流动也发生了改变。尤其是嗔心很严重的时候，脸色马上就发青，这说明血液中已经产生毒素，这样血液的流动就受到阻碍，脸色就发青。时间长了，一是易得心脏病，再一个是容易生出有关血液方面的疾病，容易出现瘤和癌症。身体里供血方面都会成问题，脑部供血不足，就要出现脑部方面的疾病，到晚年的时候，就容易得小脑萎缩等等脑部疾病。所以不要以为自己贪嗔痴造作出来只能使他人产生苦恼，其实自己才是最大的受害者。</p><p>当我们的身体不健康的时候，就要检查自己的心理状况，是否有阻碍影响色身的贪嗔痴方面的思想情绪，这些情绪最能使自己的身体产生毒素，使身体机能受到影响。身体不健康，一个是现世的烦恼因素，另一个是前世带来的业力使然；前世所造的恶业行，能感召到此世不健康的色身，出现种种疾病的色身，因为色身是果报之主。我们现在生起贪嗔痴烦恼造作恶业时，色身状况必定要发生改变，对身体就有一个不好的影响。影响到色身后，色身就慢慢的悄悄的发生了变化，一开始的变化不容易发现出来，等到积累时间长了，色身就将有一个质的变化，于是病状就明显地表现了出来。</p><p>我们的心理情绪，贪嗔痴烦恼以及各种不善心念都能影响到色身的健康，六识的心行也能影响我们的色身。既然色身能受六识的影响而发生改变，那么产生万法的就不仅有第八识这一个识，还有意根第七识和前六识，八个识一起和合运作而产生了万法，但是种子都来自于第八识。我们的色身每时每刻都在发生变化，这不仅和第八识有关系，也和当下的六七识的心行有关系。</p><p>如果对境有反应的六、七识心是平静的、平淡的，色身就保持原来的状态不变，色身不受影响。如果六、七识心不平静也不平淡，情绪遭遇突变，则色身就是另一种状况，如心惊肉跳、浑身发抖、青筋暴跳、面色蜡黄、嘴唇发紫、腿肚哆嗦、脸红脖子粗、晕厥等等，色身的运行就不平顺，也不正常了，这说明色身的运行状况都与六、七识有关系。万法是由三和合识共同变现出来的，不单单是由第八识自己产生出来的，这叫作万法唯识。三界唯心的意思是说，三界世间一切法，都来自于第八识，是第八识用种子变现出来的，所以一切法都来自于第八识。</p><p>第八识遇缘就能出生和变化世间万法，变化五阴色身，这些缘当然包括了六识心的心行。六识心运行时是清净的还是染污的，是有贪嗔痴烦恼的还是没有贪嗔痴烦恼的，这时色身的变化就不一样。贪嗔痴慢疑恶见这六个根本烦恼，都在毒害着现在的心灵，也在毒害未来的五阴身心。为什么六个根本烦恼也能影响将来呢？因为造业种子被存进第八识中，将来这个种子遇缘再输送出来的时候，六识心行就是染污的。一世又一世染污业种的积累，贪嗔痴烦恼就变得越来越严重，色身就越来越不健康，正报和依报越来越不如人意。</p><p>所以我们每个人，都应该好好地降伏一下自己的烦恼性障，降伏了贪嗔痴慢以后，不仅能带给他人愉悦和谐的气氛，而且受益最大的还是自己，身体健康，精神愉快，内心豁达，无忧无恼，福德增加。对治好自己的贪嗔痴烦恼，了却所有的烦恼忧愁，周遭的一切都是愉快的，自己不仅生生世世无烦无恼，将来还能成为菩萨摩诃萨，也能成就佛道，成为三界尊、人天师。</p><p>二、现代人太贪恋世俗，所以总是觉得世间的一切都美好，都喜欢，这样的人心里绝不会厌世，很难生出出离心，他们看不到世间的苦、空、无常的一面，只看到世间虚假的享乐的一面，就是因为贪爱世俗的心很重。人心是入俗的还是离俗的，从他们的言语当中都能清楚表达出来，可是他们自己却不知道，没有反观力，没有觉照力，内心不觉悟。</p><p>因为贪恋世俗，六根六识都放逸，眼识的放逸，就是随意看色；耳识的放逸，就是随意闻声；鼻识的放逸就是喜香厌臭；舌识的放逸就是贪食美味；身识的放逸就是寻求舒适自在；意识的放逸就是散乱、昏沉、掉举；意根的放逸就是处处攀缘、执著。阿罗汉们的六根从不放逸，他们绝对不到处去看，去听，去嗅，去尝，去触，意识也不杂思乱想。</p><p>有的人总是喜欢饮食，喜欢美味，那就是舌识和意识的共同放逸；有的人总是喜欢嗅香，那就是鼻识和意识的共同放逸；有的人总是喜欢穿好衣服，睡好床，一切都要舒适惬意，那就是身识和意识的共同放逸；有的人总是喜欢回忆过去，攀缘未来，那就是意识心的放逸；有的人总是喜欢事事攀缘，那就是意根的放逸。</p><p>学学我们的第八识，祂一无所好，心常在定，没有贪时，没有嗔时，没有痴时，没有我见，又不作主，随缘度日，又没有日可度。七识若如此，成佛有余。</p></div>"
},{
    "title": "第六章 识心的染污与清净性",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  识心的染污与清净性</strong></p><p>一、前七识的心体既有染污性，也有清净性，其染污性并不是因为七识有分别性才出现的，七个识本身从无始劫以来就含藏着无明，含藏着贪嗔痴烦恼，本来就是染污的。七识在万法的运行当中，在分别万法当中，各种染污性一定要表现出来。因为七识本身有无明，不知法界的真实相貌，因而就对三界万法不断地产生执取心行，贪染性就要现行出来。</p><p>七识有分别性，七识本来就是要分别的，只要有七识心的存在，一定就有分别性；如果不分别，那就不能在三界中出现。前七识之所以叫作识，是因为识心的自性本来就是起分别或识别作用的，而且永远都有分别性，否则就不叫作识，与木头无别。第八识既然也叫作识，当然第八识本身也有分别性；八个识都有分别性，所以才叫作八识。直到成佛以后，八个识照样还是有分别性与了别性，对一切法都要作了别和分别。</p><p>什么是分别呢？当你知道了一切法，就是分别完成了；没有分别，就没有了知性，没有分别就是一无所知，那样就与木头无别。因此成佛了，仍然要知道一切法，而且知道的比我们众生还要圆满，还要圆明，无有一法而不知。佛的这个了知性分别性已经达到彻底圆满，究竟圆满，分别一切法时，究竟了义，彻法底源，佛的了知性遍一切时空，没有任何的阻碍和隔绝，没有丝毫的无明和无知。众生七识的了知性分别性都有局限，都有限碍；因为无明深重，了知的就不圆满不圆明，只能了知其中极少的部分。只要七识中还含着无明烦恼和染污，其分别性就有极大的遮障和阻碍。</p><p>成佛时，八个识还是有分别性，只是分别时具有极大的智慧，能完全彻底地了彻色声香味触等一切法，透透彻彻地分别三界世间的一切法。如果说八个识都不分别，不分别是什么状态呢？不分别就像是石头，众生不是石头，成佛了以后就更不是石头。既然不是石头，识心当然就要去分别与了知各种法，正因为有分别性和了知性，我们才能在这世界中生存，才是活蹦乱跳的众生。</p><p>有的人说，识不分别，就清净了。这个说法显然是不对的，清净性是指识心在分别一切法，在造作身口意行时是清净的没有染污的；识心在分别时，不带有贪嗔痴烦恼，不带有无明，这样的心才是清净的；如果识心都不分别，人们就不能正常的生存和生活。有无明的时候，识心就不能清净，就会颠倒分别，或者分别得不清楚，没有智慧性，对于法就不能正确的了知，很多法就不容易观察出来，看什么也看不明白，想什么也想不清楚。</p><p>七识心如果想要具有大智慧性的分别，就必须去掉染污，去掉无明。当无明断尽，智慧性的分别就达到了圆满，就能圆满了知一切法。七识心如果没有无明，就不再颠倒了，能够圆明了知一切法。圆满了知一切法的心，就是有智慧的心，有智慧的心就是无漏的。既没有贪嗔痴烦恼，也没有无明，就叫作无漏；有烦恼，有无明，就是有漏。识心的无明越少，分别一切法时就能识得真相实相，分别的就越清楚越透彻。有无明有漏时，识心分别的就不圆满不彻底，就有障碍。越是有障碍，心量越是狭小，认知的范围也越狭小，认知的程度就越浅，智慧性就不足。当识心修到无漏的时候，智慧就很广大，甚至可以广大到无量无边，能观察到从前所观察不到的真相，能把所有的人事物理都观察得彻彻底底，透透彻彻，圆圆明明，深入到最究竟的实相和真理中。</p><p>所以我们六识在身口意行运作当中，一定要降伏贪嗔痴慢疑恶见这些烦恼。当这些烦恼被渐渐降伏了，我们就能渐渐达到无漏，智慧就渐渐增长。达到无漏时，心量广大了，心所缘的范围就广阔无边，就能了知无量无数的法界真实相。心越无漏，就越有智慧。所有的无明都断尽之时，世出世间没有一个法是我们所不能了知的，全部都能了知。要想去掉这些贪嗔痴烦恼，就要去掉邪见，拥有正知见，靠定慧破除无明烦恼和习气。</p><p>去除邪见的第一步，就要修学四圣谛，断除我见，我见就是邪见之一，把五阴十八界当作是真实的我，这是最大也是最根本的邪见，也是所有烦恼的根源。因为这个邪见，而产生出了其它许许多多的邪见出来，轮回生死就是由此而来的。因为我们的知见不正，贪嗔痴烦恼不断，心就有漏，智慧就不圆明，看一切法就会看错，做事情就会做错，身口意行都不清净。</p><p>比如当我们内心生起嗔恚烦恼时，心水就已经混浊了，定力就消散，智慧混乱不堪，不能彻照万事万物的真实理，那么我们就要把一切人事物理都看错，认识错；认识错误，想法就跟着错误；想法有错，跟着就说错或做错，整个身口意行都错，造作了错误的染污的身口意行之后，业行就作为种子存在第八识里。这些业种成熟时，我们就要受到恶报。我们当下每时每刻的一切身口意行造作，都作为种子存到了第八识中，成为我们每生每世每时每刻的历史档案，当档案遇缘打开时，马上就要受到恶报。</p><p>当我们修得了宿命通时，历劫以来的所有的身口意的造作，所经历的一切，都能历历在目，如在目前，那时的内心是非常惭愧的。这些历史档案，直至到成佛时也不消失，每尊佛都能回忆起自己历劫又历劫以来的所有行为和受到的所有果报。也能知道所有众生的历劫以来的所有档案，一点都没有遗漏。所以我们一切的身口意行，一定要小心造作，说话一定要如理如实，做事一定要如法。不懂的就不要装懂，不清楚的事情就要懂得沉默，要学会忍耐，心中不明之理不要强以为知，一定要隐忍不发，一定要守护好我们的身口意行，不要再造作恶业和不善业。这是我们每一个学佛者，都必须努力要做到的。</p><p>只要造作了一点恶业，果报就是无情的，即使我们没有任何恶意的与别人开一个玩笑，这个玩笑如果是带由愚痴性或无明性的，这种行为也将作为档案而保存起来，将来输出来的就是愚痴的业种，我们就要受到愚痴的果报。比如说，你给别人起了个外号，这个外号与动物有关联，或者含有讽刺挖苦意味，或者不太好听，说时好象没有特别的恶意，但是果报却很不好，将来就有可能投生到畜生道中去当畜生。我们往往都以为自己所说所作的并没有什么，不严重，不会有什么果报，可是当真正受果报时，心里还是非常难过痛苦的。好多人说话做事，造作的那些身口意行都让人心惊胆战，没有办法，谁也阻止不了，众生都以为自己说的都对，做的都对，可事实和结果却都是错的，他们根本就不知道。</p><p>有些人以善心说话做事，以为就有善的果报，没有什么恶果报。结果呢，心是善的，说出来的话却都是错的，做的事也都是错的，他根本就不知道自己的所说所做都是错的。当业行造作出来以后，这些业种就被存储起来，将来因善心造作的恶业就要受到恶报。善心得恶报的事情，我们无始劫来做的太多了，几乎每个众生都这么做过。有些人可能出发点是善的好的，可结果和行为本身都不善，他自己根本不知道这些。身口意的行为都不善，最后的果报也肯定不善，众生不知此理，因为愚痴的缘故。</p><p>我们在身口意行上一定要注意，说出去的话就像泼出去的水，覆水难收。种子一但存到第八识中，它就会结结实实的在那里扎根，将来就要发芽结果。所以我们要经常检查自己：今天、昨天、前天，这个月、上个月，今年、去年、前年以及这一辈子，都造作了什么样的身口意业，都要好好的检查，检查后发现不当之处，一定要诚心诚意的忏悔。忏悔能消除一部分已经存进去的种子，如果不忏悔，这些种子就定了型，成为了定业，将来必定要受到恶报。</p><p>殷重忏悔了以后，有的业能消掉一部分，有的业不能消掉；有的定业能转变为不定业，不定业就能消散一部分，将来就只受到轻微的恶报或者不受报。如果不忏悔，我们所做的一切身口意行，都要受到恶果报。尤其我们说话的时候，一不小心就说错话，还以为自己说的都对，以为自己能明了一切事情的真相，其实我们没有智慧，怎么能看明白人事物理呢？每件事情都没看懂，好多事情都看不懂，看不明白，因为我们有无明。每个众生都自以为是，都以为自己看明白了，然后在不知不觉中身口意行就造作出来，造作出来以后就成了恶业，留下了恶业种子。</p><p>什么时候能把人事物理都看懂看明白呢？佛说：不证四果阿罗汉时，不要信汝意，汝意不可信。众生的身口意都不清净，心有染污，有无明，看问题时就看不明白，人事物理就不能正确了知。于是反应出来的，就是一个不正确的身口意行或者是恶的身口意行。即使明心见性后，内心中还有贪嗔痴烦恼，有无明，菩萨如果没有修到三果四果的果位，也同样有贪嗔痴烦恼，这些烦恼也要现行出来，也会造作身口意的恶业，但菩萨的烦恼业比凡夫稍微轻一些而已。</p><p>直到证得了三果入了初地，烦恼才能得到有效降伏。入初地时，菩萨一定是三果人或者四果人，贪嗔痴无明烦恼断除了，心清净，智慧深广了，达到了初步的无漏。当心能达到初步的无漏时，这时既有定力又有智慧，看一些人事才能看的清楚明白。他所做的身口意行一定比其他人清净，这时才能自信，才能信己意。当然很多时候是因人而异，不可一概而论。在此之前我们都不要太自信，看人看事看问题都会出错，因为没有智慧分辩的缘故。</p><p>总之，识不清净，见就不清净；见不清净，了别就不清净；了别不清净，想就不清净；想不清净，说就不清净；说不清净，做就不清净。因为七识有染污无明，就导致了身口意行都不清净，身口意行不清净，业种就不清净；业种不清净，果报就不清净。其中的业种不清净，就导致了下一世的身口意行仍然不清净，以至於生生世世都不清净，于是就生死轮回不已。可见，学佛修行，去除无明，去除染污是多么的重要！</p><p>二、如何心得清净</p><p>意根对六尘作意以后，不触六尘，后续的心行就不会出现，六识也不能出生，六根对六尘无心。意根对六尘作意触之后，不领纳，不接受，后续的心行也不产生，六识不出生，六根对六尘无心，心清净。意根对六尘作意触受之后，不想不执取，后续的心行不产生，六识不出生，六根对六尘无心，心清净。如果意根执取六尘之后，思心所必现行，抉择必出现，生出六识或者趣向六尘，或者躲避六尘，喜厌心行必出现，心不清净。</p><p>如果六识压伏了烦恼，对六尘不喜不厌，也是无心，心清净。六识对六尘时，也可以作意触，但不受、不想、不思、不决定造作，心得清净。六识对六尘时作意触受，但不想、不执取，心得清净。这就是在境界上修心，才能降伏烦恼和断除烦恼。</p><p>六识对六尘时，作意触受想，之后能压伏自己的心思，控制自己不思、不去造作，就能避免造作业行，但是心已经不清净了。</p><p>这时的压伏，是压伏意根，使得意根不作决定让六识造作业行；如果意根没有降伏，六识即使不想造作业行，也得要服从意根的指挥，必然要造业。但有时，六识不决定造作，意根就随顺，心就歇息，不造作任何身口意行。</p></div>"
},{
    "title": "第七章 意识与胜义根内相分",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  意识与胜义根内相分</strong></p><p>一、脚痛的痛觉在哪里产生的？肉体的脚那里疼不疼？</p><p>疼痛的感觉，是在胜义根那里产生的，浮尘根的脚那里不会感觉疼痛。能感觉疼痛的是身识和意识，而身识和意识在胜义根那里出生，就在那里感觉内触尘的痛，因为内触尘是在胜义根里出现的，身识和意识就要在胜义根里出生和了别触尘。</p><p>身体所有部位的感觉，都在胜义根那里产生，即使脚趾头坏了，也是在后脑胜义根那里感觉疼痛。浮尘根的脚没有疼痛。因为浮尘根只能由如来藏接触，意识接触不到，如来藏对触尘没有觉知作用，浮尘根本身是尘，没有觉受，只有识才有觉受，由身识和意识觉触。</p><p>如来藏通过浮尘根，与触尘接触，吸取四大微粒，通过身根的传导神经，传导到后脑胜义根，根尘相触，如来藏就出生身识和意识，根尘识三者再和合触，两个识就能感觉到疼痛。脚部的触尘通过神经系统传导到胜义根，出生身识意识，才能被了知，在浮尘根那里没有了知触尘的识心。</p><p>至于是否能感觉疼痛，要看身体的传导神经系统是否正常；如果不正常，识心无法出生，就了别不到痛觉，但是脚有问题却是真的。后脑有问题的人，脚断了都没感觉，但是脚断了确是事实。不管哪里坏了，如果用上麻醉药，就不会感觉疼痛，麻醉消失了，触尘又能传导在胜义根里，身识意识出生，又能感觉疼痛了。</p><p>后脑胜义根有问题，就感觉不到身体的疼痛。这不是好事，因为中间的传导神经坏了，中断了。如果骨折了也不知道痛，那就得瘫痪，得了癌症也不知道痛，只有等着死亡。</p><p>只有如来藏能了别根身，意根在身识、意识之前，也能缘如来藏来了别根身。痛觉触尘在后脑胜义根那里产生，与胜义根接触，如来藏出生身识和意识，二者了别的是胜义根里的痛觉触尘，不能了别到脚趾头那里的触尘。那么脚趾头那里的触尘是谁了别的？是如来藏接触的，但是如来藏也不分别，不知脚痛与不痛。</p><p>半夜睡觉时，六识都灭了，脚突然疼就能疼醒。为什么能醒过来？因为身根与痛的触尘相接触，意根了别到问题有点严重，就让意识醒过来了别一下有什么情况，于是如来藏就出生了意识和身识，人就醒过来了。脚那位置的触尘是外相分，传导到胜义根，就成为内相分。要分清谁触外相分，谁触内相分，就能把各个识的功能分清楚。如来藏缘浮尘根来了别六尘外相分，然后在胜义根处显示六尘内相分，外相分当然是如来藏了知的，祂有见分。</p><p>看见自己的脚趾头流血，这个流血现象是在哪里出现的？是眼识和意识了别到的胜义根里的内色尘。流的血液是色尘，如来藏通过眼根浮尘根接触到色尘血液，通过眼的传导神经传导到胜义根，根尘相触，出生眼识和意识，就了别了流血现象。</p><p>二、人打了麻醉药以后，如来藏就不能通过浮尘根来正常传导外六尘进入胜义根中。因为麻醉药能麻醉神经传导系统，外六尘就不能通过神经系统在胜义根处显示内触尘，身识就不能出生，人就不知道疼。</p><p>如来藏永远都能接触外六尘，了别外六尘，不管浮尘根是否正常，也不管是否有浮尘根。如果浮尘根不正常，如来藏就不能通过浮尘根传导五尘的微粒，或者是不能正常传导五尘微粒，五尘要发生扭曲变形现象。如来藏所接触和了别的浮尘根都是相分，不是种子，种子在种子位在如来藏里，没有形和相，有形和相的就不是种子。</p><p>麻醉药是用来麻醉胜义根中枢神经系统或者是部分传导神经的，以不让识心生起觉知疼痛。如来藏除了正死位不能通过浮尘根摄取六尘，其余任何时候都能摄取外六尘，什么也影响不了祂。</p><p>如果是全身麻醉，五根都不能用，如来藏不能了别和传递六尘，那么时间太长的时候，意根可能就不抱希望了，要离开色身，考虑重新投胎。事实上身体麻醉时，血液还在流动没有停止凝固，呼吸还存在不是断气，心跳还在运动没有停止，人还是活着的，那么如来藏就能通过五根了别和变现五尘，以维持色身的生命活动。血液心跳呼吸，都属于六尘尘境，如来藏还在执持和变现着，祂肯定能了别得到六尘，意根依之了别，就能知道自己还活着，身体还能用。</p><p>麻醉也只能麻醉神经，让神经不能正常传导信号，或者传导出微弱和变形的神经信号，或者传导少分，不能完全停止传导，否则意根什么也了别不到，祂会恐慌，不抱希望时就要决定离开色身，从而死亡。</p><p>全身重度麻醉时，人的前六识已灭，如睡着无梦一样。六识的现起，必须要有意根、法尘为缘，这时意根没问题，肯定也是想要意识生起的。问题肯定出在六尘上，麻醉药物的作用，是直接作用于胜义根脑部，如来藏还能了别外相分，但内五尘及法尘肯定不能完全现起，只能现起一部分，保证不了识心的出生。从昏迷中醒过来时，就是麻醉药物失去作用时，不能再麻醉中枢神经系统了。如来藏就能通过传导神经把六尘的微粒传导到胜义根，内六尘正常出生和现起，这时意识才能出现，五识出现，人就从昏迷中醒过来。</p><p>如来藏对于身根的了别，不仅是了别种子，还能了别本质境，就是外六尘，意根也能缘于如来藏的见分，有自己的见性，对身根进行了别，身根是否能用，意根当然也能知道。药物的麻醉作用一般时间不会太长，在这段时间内，还有一些少量的六尘内相分存在，意根不会决定舍报，祂知道身根还能用，对五阴身是抱有希望的；但如果药物作用的时间太长了，意根心里没底，也会作出错误决定而放弃身根。</p><p>虽然麻醉时，中枢神经系统不能正常传导六尘的相分，胜义根里六尘微弱不完整，而且黑暗也是色，静也是声，胜义根里不可能完全没有内六尘。盲人眼前见黑，也是见，聋人听静，无声也是声。麻醉昏迷时，肯定有六尘存在，昏迷时，意根会尽量想办法清醒过来，根据什么想办法？祂能了别到六尘，才能尽力清醒过来，不想继续昏迷。如果想清醒过来，必须有五尘上的法尘，只有独影境还不行，还得要有性境。只是这些境界不是很强大，比较微弱，如来藏不能依之出生六识来了别。</p><p>麻醉昏迷时，如来藏依于不正常的胜义根，显现的肯定也是不正常的法尘。有个别昏迷的人清醒过来以后，说自己好像做了什么梦，梦里有某种境界出现，这就说明不是完全没有内六尘，还能有独影境的现起，那么意根就不能放弃色身，众生就不能死亡。</p><p>一般性的麻醉，是麻痹触觉神经，不让身体某部分感觉疼痛就行了。这部分痛的触觉不能传导到胜义根，就没有身识和意识感觉这部分的疼痛。重度麻醉，也可能导致死亡，麻醉面积太大以至于浮尘根也受到了影响，血液不能正常循环，氧气不能正常输送，心跳脉搏就要渐渐的停止，那么五阴确实不能运转，意根了别到，肯定就要离开色身，那就死亡。</p><p>三、六识了别的内六尘，是实四大种子组成的色法，叫作性境，依性境现起的幻境是带质境。</p><p>五识所缘为性境，现量了别。意识所缘有性境、带质境和独影境，有现量、比量和非量了别。意根把第八识的见分当作自己所见，把第八识现起的一切法都当作是自己的，归自己所有，这是错知错执，因此是非量了别。</p><p>意识所缘的带质境如下：捏目所现起的第二月，其实没有第二月，只有一个月亮，第二月就是虚幻的带质境。意识在暗夜里把远处的灯光当作鬼火，其实没有鬼火，是灯光，鬼火就是虚幻的带质境。意识把见到的草绳当作蛇，其实没有蛇，只有绳子，蛇就是虚幻的带质境。意识把见到的某甲当作某乙，其实没有某乙，只有某甲，某乙就是虚幻的带质境。</p><p>四、问：意识明显受到大脑器官的影响，比如疲惫困倦的时候，意识的推理能力和速度都会下降，再就是人老了，意识的推理能力和速度也会下降，比如围棋选手要想出成绩，就必须在十几岁和二十多岁的时候取得成绩。这都表明了意识与色法密切相关，是否是这样？</p><p>答：意识的思惟活动确实与大脑物质色法密切相关，但这些并不表明意识具有物质属性，只能说身心是互相依赖互相影响的。当身体疲惫、疲乏、衰老时，身体四大结构改变了，如来藏依之变现的内六尘发生改变，胜义根发生改变，识心分别就要有所不同。当如来藏在胜义根变现出来的内六尘渐渐减少，渐渐扭曲，渐渐变形，六识尤其是意识了别六尘也就渐渐费力，渐渐扭曲，渐渐不灵活。</p><p>出生六识的原则：根尘相触，如来藏出生识，如果根出现变异，识的了别性就出现障碍，尘如果发生改变，识的了别性就出现障碍。而识本身的识种子永远不发生改变。组成身体的四大种子的结构，总是随着业力和各种缘而发生改变，物质色法就要不断的发生改变。神经传导都通过身根五根，离不开五根，如来藏依五根传导四大微粒，变现内六尘。如来藏也依胜义根变现法尘。根尘发生改变，识心也随之发生改变，了别必然要出问题。</p><p>法尘依胜义根而变现，胜义根有问题，意识了别必然有问题。五俱意识离不开五尘，离不开五根，离不开胜义根而有。独头意识仍然离不开胜义根，胜义根有障碍，独头意识也不能出现，人就处于昏迷状态。如果独头意识与胜义根没有关系，那么植物人的独头意识也应该正常，没有问题。可是植物人的独头意识很少现起，他不会思惟分析判断推理，几乎也不能回忆。所以我们得出一个结论是：意识的现起，与色法有密切的关系，与大脑胜义根也有密切的关系。</p><p>五、六识虽然分别的是胜义根里的内六尘，与内六尘相触，但是识心不在色身内外，也不在色身中间。《楞严经》第一卷中，世尊就讲过这个问题，说识心不在色身的内外中间，这是因为识心无形无相，不能住在色身里；如果住在色身里，只要解剖色身，就能发现识心的所在。</p><p>可是当你把身体一片片的切开，也找不到识心，因此识心不在色身里。识心也不在色身外，如果识心是在色身外，那就是在虚空中，这样六识就与自己无关，不属于自己所有。六识在虚空中能作用于自己，同样就能作用于其他众生，意识就属于共用的，这是不可能的。如果识心在色身和虚空的中间，可是又没有真正叫作中间的处所，找不到所谓的中间位置，因此识心不在色身内外和中间。</p><p>六、左手握住右手时，能感觉左手凉和右手热，两个手各有觉知，那么一个人到底有几个身识和意识？</p><p>六识都是在后脑胜义根处出生，在胜义根处了别胜义根里的六尘，左右手都是胜义根里的，包括触尘，觉受就在胜义根里觉。既然如此，能有几个眼识和意识？了别一百个色尘，触一百种触，也都是胜义根里的色尘和触尘，也都是在胜义根里了别和感受，在热手的触处有身识意识了别，在冷手的触处有身识和意识的了别，识心分流感知，定力分散。识心不出胜义根之外而了别，以一敌百时需要极高的定力。大悲千手千眼，浑身都是手和眼，何意？</p><p>七、脚被蚊子咬得很痒，却又找不到具体哪个地方痒，说明了什么道理？转移注意力思惟问题，又感觉不到痒了，为什么？</p><p>外脚部的触尘传导到胜义根里成为内触尘，意根和意识了别胜义根里的触尘，辨别不清楚具体位置。也许是因为传导神经有问题，也许是没有把位置传导清楚，也许是变现的不清楚，也许识心辨别不清楚。总之，六七识了别的触尘，不是真实的脚的触尘。那我们就不用太在意七个识所接触的色声香味触法，因为都是虚幻不实的法。而七个识也仍然是虚幻不实的，七个识的觉受同样是虚幻不实的。因此识心受觉非我。</p><p>意根和意识不对脚部内触尘作意，也就没有清晰的觉受，所以转移注意力，就感觉不到痒了，可见觉受的虚妄。</p><p>八、山高和水深，高和深，是形色表色，有山色的显色才能衬托山高的形色，有山高的形色，才能框定出山体色彩的范围。有水色才能衬托出水深的表色，有水深的表色才能对水量有所框定。显色的五尘色与形色表色无表色的法尘，互相紧密结合，须臾不可分离。否则哪种色也不能存在和显现。因此说外尘一定是有法尘，六尘相具足，不能只有外五尘，同时没有法尘，没有法尘的外五尘是不存在的，是想象出来的。</p><p>法尘在后脑胜义根依照五尘变现出来，这种说法没有任何依据，根本不成立。外尘一定是完整的六尘相，如来藏最初变造时，不能只单独变造色彩等显色，而没有形体没有内涵的茫茫一片色彩，世界不是单纯由色彩构成。各种物体都有其形状和性状，这样才是丰富多彩的物质世间。比如如来藏变造五阴身，不可能只变造色身的色彩，然后高矮胖瘦等等法尘在别人的胜义根里另外再变造出来，这是决然不可能的，任谁幻想，也幻想不出这样的人类和众生相。</p><p>再比如极乐世界的黄金地，不可能只有金色，没有坚硬性和广博度、界限，否则如何能走在黄金地上？如来藏如镜子现像，镜子是忠实于外相的原貌的，不可能原貌没有长短大小高矮胖瘦，如来藏就能擅自主张在镜子表面上照出长短方圆大小高矮胖瘦来，那是如何照出来的？如来藏还是否如镜子现像？</p><p>九、国外有人发明了个杯子，用某种频率的电磁波刺激嘴巴和舌头，然后就会产生喝到水的错觉，其实没有水，只是电磁波，但人被电磁波刺激了之后就不渴了。实际原理是，电磁波传导到浮尘根的口腔里，传导到浮尘根的舌头上，然后再经过神经系统的传导，传导到后脑胜义根里，形成水的影像，与舌根相触，生身识舌识意识，识心就触水的影像，受想之后，就思，决定喝，之后有受觉出生，以为喝到水了。于是感到满足，口不渴了。想想饮食以及一切法，多么的虚妄，我们还时时处处贪爱，一直在自欺欺人，多愚痴可怜！</p><p>众生实际上就是自欺欺人，活在虚妄的感官世界里。如果在黑暗中给某人一块猪肉，此人以为是人的皮肉，就会有特殊的感觉，于是生起贪爱。如果此人眼见是一块猪肉，就会感到恶心。可见，一切法只是自心觉受而已，人常常被自己的觉受所欺骗，沉浸于各种觉受之中不能自拔，越想越觉得我们众生可怜可悯。</p><p>人无始劫以来，其实是跟一堆堆的四大微粒在一起吃喝玩乐，吃的穿的住的用的玩的乐的，都是一堆堆的四大微粒。如来藏用无数四大微粒堆积出各种玩具，众生就在这些玩具中玩耍得不亦乐乎，沉眠于其中不肯出来，就像小孩子玩过家家游戏一样。</p><p>还有一种手机新出的功能，屏幕传给手一种电磁波，手就真实的感觉摸到了某种物体。人的神经传导系统象光纤一样，在里面跑的都是电信号。给人各种不同频率的电磁波刺激，人就可以满足一切了。当我们心里再生起贪爱时，就应该意识到自己所贪爱的对象只是种种电磁波而已，实质也就是四大微粒。众生也真够可怜的了，被自己骗的，被如来藏骗的晕头转向，却不知道受骗了无量劫。</p><p>我手里拿着的，表面看是手机，实质是一大堆粒子组合成的虚幻的影像，在后脑勺里，没有真实的手机。身识和意识的所谓感觉是什么东西？是像连续不断的水流电流一样的识种子连续不断运行时，产生的虚幻的感觉，一旦识种子断开，识心消失，就没有起感觉作用的主人了。那么所谓的感觉为何物？是你吗？</p><p>说归说，做归做。说是意识说，做是意根做，不是一个心，结果就是这样。没有禅定功夫，什么事也做不到，空玩嘴皮。这些理论终归是理论，没有禅定，不能实证时，就不能真正认识实相，心就不能转变得清净自在了。</p></div>"
},{
    "title": "第八章 眼识和意识的和合运作",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  眼识和意识的和合运作</strong></p><p>一、眼根触色尘的时候，这个色尘是后脑胜义根中的内色尘，这时眼识先生出来了别。因为如来藏在眼的胜义根那里先显现出色尘的显色，这个显色与眼识相应，也是眼识所分别的，所以根尘相触之时，眼识就先生出来。眼识生出来以后，就了别内色尘的显色。同时如来藏在显色的基础上又变现出形色、表色和无表色，这三种色叫作法尘，或者叫作法处所摄色。</p><p>法处所摄色与意根和意识心相对，是意识所了别的对象，属于法尘；法尘和意根相触时，如来藏就出生了意识，意识就了别法处所摄色。那么我们见色时，第一刹那是眼识先触到内色尘上面的显色，先了别显色；第二刹那才是意识心触内色尘上的形色、表色和无表色，了别法处所摄色；然后第三刹那，眼识还继续出生，意识也要连续出生，所以第三刹那，眼识和意识同时了别内色尘，眼识和意识二者和合运作，才能完整地了别整体的内色尘。</p><p>在一种色尘上面，同时显现出显色、形色、表色和无表色，才能形成一个完整的色尘相貌，眼识和意识二者必须和合运作，共同来分别这个内色尘，才能知道内色尘的显色、形色、表色和无表色，才能把色尘完整了别，了别得清清楚楚。第一刹那和第二刹那都不能把色尘了别清楚，也看不清是什么色尘，到第三刹那时才能看清一点点，因为第三刹那眼识和意识共同了别完整的色尘。</p><p>每个识种子了别到的色尘，都和前面了别到的的色尘进行比较，了别到的色尘比较多了一些，才能把色尘前后相连接起来，意识和眼识才能知道这个色相的完整形象是什么。识种子一个一个地流注出来，一点一点的对色尘进行了别，后边的眼识种子和前边的眼识种子所了别的色要连接起来比较，连接起来后才能知道是什么色相。</p><p>意识心在刚开始了别时还不是很清楚，没法对色尘进行回忆和比对，也不能分析和判断。第一刹那非常快过去了，了别的不完整，也无法比对，因此是模模糊糊的；第二刹那也非常快的过去了，仍然没有可比对的，因此仍然是模模糊糊的，不清楚；第三刹那才了别到一点点，知道个大概内容。第三刹那以后，才有了可比对的内容，色尘的影像才能前后连接起来，才能模糊的了别到一点内容，知道是什么色尘。而且第三刹那是眼识和意识共同了别的，整体的色尘相就能了别到了，那么这个色才能现出一个完整的形状出来，才知道极其微弱的一个大概色尘相。接下来的第四刹那第五刹那第六刹那，都是眼识和意识共同来了别内色尘的，了别的就清晰了一些，了别的时间越长，越清晰透彻。</p><p>当我们看一个色体的时候，看第一眼的时候得要停顿一下，这一停顿，有多少个刹那过去了。经过一秒钟半秒钟的了别，我们才能知道这是什么色体。佛说：一弹指间，就有八万一千个种子生灭过去，就有八万一千个刹那。那么识种子的流注速度该有多么的快，怪不得我们都感觉不到生灭的现象存在，原来是生灭的太快速了。</p><p>这说明在第一刹那第二刹那我们并不知道色尘是什么，要到第三刹那第四刹那以后，才能知道一点点色尘，而有的人可能要在第五刹那或者更久的时间才能看清一点点。视力有障碍的人，也许就要看个一分钟半分钟，具体要看多长时间那就不一定了，这要看人的识别能力，也就是看眼识和意识两个识的识别能力如何了。识别能力越弱的人，看的时间就越长。比如说有的人是近视眼、老花眼，属于视力有障碍的人，识别色尘所需要的时间就要长一些，还有一些人智慧低劣，见识短浅，辨别的时间就更长了。</p><p>但是在这看色的中间，第八识一直没有停止过运作。从第一刹那祂生起内色尘之前，就一直在传导外色尘的微粒，一直在传导，通过视神经传导到胜义根，然后变现出显色；变现出显色之后，又依据显色再变现形色、表色和无表色，同时还接连不断地从外色尘上面再摄取四大微粒，再接着一直变现出显色、形色、表色和无表色。如果第八识在哪一刹那停止了，不传导四大微粒到胜义根中，不再变现这些内色尘了，那么眼识马上就要消失，看不见色尘，意识也马上就消失，不能了别色尘。换句话说，也没有了眼识和意识的出生，这两个识当然就不能分别色尘。</p><p>所以第八识每一刹那都没有停止过运行，时时刻刻都在传导和变现着这些色尘。这些色尘传导到后脑胜义根以后，内色尘就显现出来了。第八识一刻都没有停止过，一直都在变现，偶尔有一刹那不变了，色尘就停止显现，眼识和意识就全都灭去而分别不了了。因为没有了色尘，就没有识的存在，识的产生是由根和尘相触为缘，然后依据这个缘，第八识再变生出眼识和意识，我们才能看得见内色尘。</p><p>如果没有了色尘，识的出生就缺少一个重要的缘，第八识就无法出生六识，当然就没有六识的存在了。当色尘消失时，原来正在了别色尘的眼识意识马上就跟着灭去，识灭了，就不能了别色尘，也没有了了别的对象。所以，第八识从无始劫以来的每一刹那都没有清闲过，没有休息过，也没有停止过，祂就是这样不辞劳苦的永不停息地运作着，为我们无私的服务。</p><p>如果有人说他只用眼识就能看见色，这可能不可能呢？这是不可能的。一个色相上有显色、形色、表色和无表色，显色就是色彩，青黄赤白的颜色，眼识只能分别显色，不能分别形色、表色和无表色。一人看色不能只看色尘的显色，还要看色的形状，看色的内涵，形色、表色、无表色都要了别，色的本质是什么，色的名相是什么？都要了知到，才能够分别完成，所以一定要有意识的参与了别，才能清楚了知色尘。除了颜色之外，其余的那些色都属于法处所摄色，这是由意识心来了别的；只有青黄赤白等颜色才是由眼识所了别的，眼识和意识二者共同和合了别，我们才能知道色尘到底是什么。</p><p>所以要看一个色，把一个色看清楚，分析判断所见的色尘到底是什么，一定要眼识和意识共同和合运作，二者共同分别，我们才能知道面前的物体是什么。面前是书本，面前是桌椅，面前是杯子，这些物体不仅有色彩，还有长短方圆等形状，还有材料质地等等内涵，需要分别的内容很多。只有眼识绝不可能了别得非常清楚，必须要有意识同时与眼识一起分别，二者和合运作，我们才能够看清楚这些物质的色法。</p><p>经过仔细观察体会就可以知道，我们看见物体的时候，第一刹那是看见了眼前物体是什么颜色，肯定是先看见物体的颜色色彩，模模糊糊的色彩先显现出来；第二刹那，才是意识心出来了别，这时就稍微了别了一点儿影像；第三刹那，才能知道那一点影像是什么色尘，这时色尘的形状就出来了；再以后，才能知道色尘的内涵特质，才能够知道这个色尘具体的名相是什么。那么面前的沙发也好，床铺也好，桌椅也好，这些物体的名相、形相、本质、内涵都看清楚了，就叫作了别。</p><p>如果想要了别更复杂的一些东西，所需要了别的时间就要更长一些。比如看见一个人，了别这个人的年龄，判断这个人的气质、学问、修养等等，意识心分别的时间要长一些，眼识看的时间也要长一些。这两个识一定是共同和合运作，才能把这个人看清楚。其中眼识只分别颜色色彩，除了颜色之外的，都是由意识心来了别的。意识心的工作量非常大，意识所了别的内容非常的多，所以说意识心是相当重要的。尤其是学佛修行，都要用意识作思惟观行，所以意识是修学佛法很重要的一个修证工具，若是没有意识的参与，我们就不能够学佛修行，不能参禅悟道，不能成佛。因此我们不能舍掉意识心而不用，如果学佛修行都不作思惟，都不作观行，这和愚痴就没有什么区别了。</p><p>二、眼俱意识的第一个识种子出生，一定在眼识第一个识种子出生之后，然后两个识的识种子再同时出生，不分先后。第二个以后的眼识种子的出生，必有意识伴随运行，否则也不能出生。我们可以去愣愣神，自己亲自体验一下，看色时是眼识先见还是意识先见。如果是意识先见，那么意识所见的形色里是否任何一种色彩都没有，既没有白和亮，也没有黑和暗，赤橙黄绿蓝靛紫更没有？显然不是。</p><p>再观察体验一下，当不见色时，是意识先消失，还是眼识先消失，还是同时消失。根据理论，是意识先消失，眼识后消失，因为法尘依靠色尘才能显现出来，比如形色的长短方圆，如果没有显色的色彩，就不能映衬出长短方圆来。如果色尘不存在、消失了，法尘肯定就不能存在了；而法尘消失了，色尘还可以停留一刹那，仅仅是一刹那，不能有第二刹那，否则眼识就能单独存在了。不可能色尘没有了，法尘还存在，这个是绝对不可能的，因此眼识不可能在意识之前消失。醒过来时，与此相反，一定是先有意识后有五识，或者由独头意识转为五俱意识，然后五识生。</p><p>三、问：唯识当中的一个理论是，意识是五识的俱有依，故意识必须先于五识生起，或者是与五识同时生起，不可能在五识后生起吧？</p><p>答：禅定中的真实体验就是眼识耳识先一个刹那了别到色声，随即才发现色声的细法，这是意识发现的，是事实。也许其中意识了别的时间多一个刹那，才能把法尘了别清晰一点，才能识别出法尘是什么，辨别时间比五识多一刹那。但这么短时间可以忽略不计。极大多数没有禅定的人，永远发现不了这个事实。不管是世俗法还是佛法，事实永远重于理论。学佛就是为了证得一切法的事实真相，而不是死板的学理论，却无法验证，以至于智慧生发不出来，不能得解脱</p><p>四、人眼有视觉暂留的现象，实际的色相已经灭去了，那个影像还会暂留一会，暂留的影像是不是就是意识所了别的独影境？不是独影境，也有色尘境。视觉是眼识和意识共同的作用，视觉停留，停留的应该是眼识所见的显色，但同时肯定有意识在了别形色表色和无表色，意识同时也得有停留作用，眼识不能单独有视觉停留作用，否则那就不是一个完整的色尘。停留的不是独影境，独影境是独头意识单独了别的，这里还有眼识在共同了别。因为有视觉停留作用，我们才觉得见色的行为是连续的，所了别的色尘也是连续的。其实都不是连续的，而是刹那生，刹那灭，是断续的，断了又续上去的。</p><p>五、观察一下视而不见的时候，是否知道眼前有光明？如果知道眼前有光明，就有眼识的了别，意识有非常轻微的了别。因为意识要分散一部分注意力，或者是大部分注意力去思考其他重要问题，所以意识了别非常轻微，才能出现视而不见的现象。观察见色的时候，是否是先知道有光明，有影像，然后才能知道物体的细相。如果是这样，就说明先有眼识，后有意识。如果没有现量观察，定力差，再加上理论错误，无论如何也不能得出正确的结论。</p><p>在刚开始了别某个法时，涉及到五识先出生还是意识先出生的问题，都出生以后，就不涉及到哪个识出生先后的问题，闭上眼睛，再睁开时，就涉及到是先有眼识还是先有意识的问题。即使闭着眼睛，隔着眼皮，还能感觉到有光明，那就是眼识没有灭去，还能了别显色，眼识只了别显色，色尘上的色彩，瑜伽师地论第一卷里有描述。</p><p>五识了别的都是如来藏依据外五尘，摄取外五尘上的四大微粒，传导到后脑胜义根里变现出来的四大微粒，比较粗糙的色法部分，接近于如来藏接触和了别的外六尘本质境。眼识见色只有开始时才要重新作意，比如说房间里有很多东西，眼识从一处转移到另一处，所见物品变换时，眼识就要重新作意，意识也要重新作意，所以当所见色改变时，就涉及到眼识意识出生的问题。但无论怎样，都是眼识先出生，刹那之后意识再出生。见色时都是眼识先见朦朦胧胧的色彩，是空还是有物，意识后见形态大小长短方圆和内容内涵等等。但是从睡眠中清醒过来，一定是独头意识转化为五俱意识，先出生，然后五识后出生。与清醒时的次序是颠倒相反的。</p><p>凡是粗糙部分，迷迷糊糊朦朦胧胧的，都是五识先了别的内容，细的内容是意识后了别的。五识与意识的连接极其快速，没有禅定的人，根本辨别不出来。所以很多人即使告诉他这些内容，他仍然观行不出来，无法实证，只能背诵别人的理论。六识每见一个色法，都要重新作意，意根更是先要重新作意，不断的作意，才能引导六识作意和了别。这些细法，没有禅定，根本观行不出来。</p><p>听声音是意识和耳识一起听，单独耳识听不了声音。打坐时突然听到声音，耳识先出生了别，意识后了别，耳根先感觉震动，后意识才知道是什么声音。耳识听声时，先有震动声传导到耳根，震动耳鼓，这是耳识了别的粗声，后有意识了别声音的高低远近大小内涵等等细的内容，这说明耳识先于意识了别，先于意识出生。</p><p>六、六识对六尘的了别过程</p><p>法尘有六种，色尘中的法尘、声尘中的法尘、香尘中的法尘、味尘中的法尘、触尘中的法尘，以及独影境六种。前五种由五俱意识了别，后一种由独头意识了别。</p><p>当禅定比较好的时候观察色尘，看书也行，看花儿也行，看山也行，看什么都行，闭眼再睁眼，刚一睁开眼睛的时候，最先看见的肯定是一种色彩，这是眼识所了别的显色，刹那之后色彩就出现了形状，显示出长短方圆厚薄，这就是法尘，是意识了别的，再之后色的相貌就清晰了，内涵特质都显示出来，这些都是色的表色无表色，是法尘，意识所了别，了别到最后名言就出现了。</p><p>整个了别过程是眼识先出现，刹那之后意识出现，只有眼识不能了别法尘，只有意识不能了别色彩，二者和合才能把眼前的色尘粗色和细色都了别清楚，色尘完整的相貌才能呈现出来。但是这其中是眼识了别的色彩先出现的，色彩是最粗略的色，法尘是比较细的色，越细的色显现出来的越晚；意识了别的法尘是后出现的，之间的时间差极短极短，两个识互相依赖，缺一不可。其余四个识与意识的关系也是如此。</p><p>    七、为什么眼根坏了看不见色尘</p><p>眼睛等六根是显示器，观看显示器的人是眼识等六识。显示器总是开放着，可是人却不一定时时都会观看。不管观看不观看，显示器里人事物一直播放着显现着。显示器显现什么是由如来藏说了算，六识观看不观看，由意根说了算。 是否换频道，也由意根说了算。至于观看什么不观看什么，也会由观看者六识提出建议，意根采纳之后，由如来藏根据业种决定。所以显示器里的一切法，是三个能变识和合作用而显示出来的。眼睛坏了，相当于显示器开关出问题了，修理好开关，眼识还会看见显示器里的人物。但是眼根坏了，不代表没有眼识的见性，眼识还是能看见黑暗。显示器黑屏也是显示器的一种状态，观看者也能看到，眼睛坏了眼识能看见黑暗。</p><p>八、虽然闭眼不见色，塞耳不听声，但六尘境界也不是五识六识七识变现出来的，都是如来藏幻化出来的。五识六识七识，都只能把如来藏变造的相显现在心中，不能变造相。而显现相是有一定条件的，条件不具足，心中就没有相。</p><p>眼识看不见花，是因为闭眼没有光明，没有光明则眼识不见光明相的花，但可以见没有光明的黑暗。修行如果突破了色阴区宇，则不在此例。同理，耳识听不见声音，是因为声尘不入耳，则耳识听不见外界传过来的声音，但能听见耳鼔里的嗡嗡声。</p><p>如来藏变造所有相，不仅要依业种，还要依种种缘，包括依六识七识的心所法，依六七识的意愿和想法。然后七个识配合如来藏把相显现出来，六识才能有知。</p><p>九、眼识的知五识的知没有名相，意识的知有名相。比如眼识知太阳光知刺眼，没有太阳光的名相，没有名言，没有刺眼的名相，没有刺眼的名言，意识与眼识共同了别太阳光时，意识才知道是太阳光，才知道太阳光刺眼。但是闭眼躲避太阳光，是意根的抉择，眼识和意识只不过是不自觉的快速执行而已。</p><p>为什么意根能快速的做抉择呢？因为眼识和意识刹那间对太阳光的了别，都会传达给意根，意根刹那都能了知，而且是正确的了知，才能正确合理的抉择，以趋利避害。如果眼识意识了别的是意根不熟悉的色法，意根就没有那么快的抉择了，因为意根不一定能够如理的理解传达过来的色法，要思量审查，直到思量明白，才做抉择。也有意根思量不明白的时候，那就不能如实理解传达过来的色法，如果迫不得已做抉择，就会做错误抉择。所以意根抉择的快慢正确合理与否，也在于意根的经验和智慧。</p><p>十、六根触六尘，第八识产生六识，然后六识了别六尘。先有六根，后有六尘，最后有六识。那就是六根对六尘时，不是马上就知道了六尘，中间有个时间差。比如眼睛与色尘相对，一开始不知道是什么，看了一会儿，才知道是什么。</p><p>这其中眼识种子是一个一个流出来的，第一个眼识种子出来与色相对，灭了，不能看清是什么；第二个眼识种子又出来与色相对，灭了，还不能看清是什么；第三个眼识种子出来与色相对，灭了，能看清一点；第四个眼识种子出来与色相对，灭了，看清了是什么色尘，我们就分别了这个色。如果视力有问题的人，可能看的时间还会长一些。</p><p>眼见色时，不是单独一个眼根眼识在起作用，同时还有意根意识在起作用。眼根触色尘，意根同时触色尘上的法尘，第八识分别产生眼识和意识，来共同分别色尘。眼识分别色尘的粗色，就是显色，包括青黄赤白的色彩、光明阴暗和虚空当中的晨雾等等，意识分别细色，表色、无表色、形色等等。单独一个眼识不能分别，必须和意识心同时分别，才能知道是什么色尘。</p><p>那么眼见色时就有眼识意识意根三个识参加，第八识如来藏是必须参加的，各有各的作用，互不替代。因此我们做一件事情时，就有八个识心共同起作用，不是一个识心，不能说我只有一个心在做事。比如，吃饭时，眼识看着饭及其它东西，耳识听着吃饭的声音及其它声音，鼻识嗅着饭香及其它香，舌识尝着饭的味道，身识感觉着饱饿渴冷热等等，意识同时分别这一切，在五尘上都参与。</p><p>意根随时随地指挥下一步做什么，还吃不吃，吃什么，吃多少，其它事情怎么应付等等。如果做每件事时，都能找出各个识心来，心就很细密了，知道各个心是如何和合运作的，智慧就生起了。时间久了，就能找到第八识，知道祂的运转，就是明心了。</p><p>十一、问：看一个线条瞬间一看是不平行的，这个不平行是眼识了别的，还是意识了别的？后来又觉得是平行的，这种矛盾心理是意识的，还是眼识和意识的矛盾？</p><p>答：图案的形状属于形色，是法尘，意识了别的范畴。眼识只见色彩，其余都是意识分别的内容，判断平行与否是意识通过思维分析比对判断出来的。当意识了别决绝不下时，就有矛盾情绪，无法最后决定平行与否。</p></div>"
},{
    "title": "第九章 意识的了别与五识了别的区别",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  意识的了别与五识了别的区别</strong></p><p>一、前五识与第六识的区别是：第六识往往与前五识一起分别，生起了分析、思惟、推理、判断、感知、研究等等心理活动，五识了别五尘的粗相，第六识了别五尘的细相。第六识不与五识在一起分别时是独头意识，打妄想的第六识是独头意识，思前想后的第六识就是独头意识，梦中的识心活动就是独头意识。比如看一个人，意识就要通过分析，了别到这个人有气质、有修养、有文化、有德行，这个人的年龄大约是多大，是男是女，性格脾气秉性如何，这些都是第六识所了别的内容。</p><p>意识一般情况下都与五识一起了别五尘，五识分别的是粗略的色声香味触，意识分别的是细的色声香味触，所谓细的色声香味触就是法尘。比如眼根触色尘，第八识产生眼识，意根触色尘上的法尘，第八识就产生意识，于是眼识就和意识一起分别色尘，这样就能了别清楚色尘是什么。比如看电饭锅，眼识知道电饭锅的颜色，意识知道电饭锅的形状、新旧、质量、具体大小、构成、材料等等。其实眼睛看色，是由眼识和意识共同来了别的，不是眼根有能见之性就能看见东西，死人虽然也有眼根，但却没有了眼识和意识，所以死人不能见色。见色的时候，能够分别出色彩、明暗等等信息的是眼识，除此之外，能分别出物体的大小、方圆、长短以及其它法尘的识心是意识心。</p><p>二、眼睛的浮尘根与外色尘相接触的时候，能够摄取色尘四大微粒的其实不是眼根，而是如来藏。眼根就像一个摄像机一样，只是一个工具和道具罢了。如来藏通过眼根这个工具，摄取外色尘上的四大微粒，如来藏把四大微粒摄取过来以后，经由眼根、眼球、玻璃体、视觉传导神经，然后到达后脑眼根的胜义根那里，并直接在那里形成外色尘的影像。其中色彩属于色尘显色，法尘就是法处所摄色，包含了形色、表色、无表色，三种合起来就是法尘。</p><p>因为色彩比较单纯，简单不复杂，所以眼识能比较快速的了别出来，而法尘就比较复杂，难于了知和辨认清楚，因此了别的时间相对就要长一些。第一刹那显色与眼根相触后，如来藏生出眼识；第二刹那意根和法尘相触后，如来藏再生出意识，这样就正好对应了第一刹那眼识了别、第二刹那意识了别的关系。然后眼识和意识再共同了别色尘，这样了别到的就是完整的色尘（这是第三刹那之后的事了）。</p><p>为什么第一刹那一定是先出生眼识了别显色，之后才能有意识了别形色、表色和无表色呢？因为显色一定要先形成先存在，这样才能显出形色、表色和无表色，这三种色法以显色为基础，比如说形色当中的大小、方圆、长短，如果没有显色的色彩衬托，就不可能表示出大小、方圆、长短；表色是依显色和显色才能显现出来，以显色和形色为基础；无表色要依显色、形色和无表色才能显现出来，以显色、形色和表色为基础。因此说，先有显色，眼识就要先出生了别显色，意识后出生了别法尘。</p><p>只要有定力，在观察色尘的时候，就会发现一定是眼识先看见色彩，这个色彩或是青、黄、赤、白，或是黑，或是昏暗，或是空无、混沌。第二刹那会看到模模糊糊的形状，然后再有形态，于是色尘的更多信息就都显现出来了，所以意识所了别的内容又多又细。若有定力向外观察时候，先是眼识看见，意识后见、后了别，也即是显色先出来，然后产生眼识，第二刹那产生形色、表色、无表色，然后生出意识，意识后出生，说明这个形色、表色、无表色是后于显色显现出来的法尘。</p><p>在后脑胜义根那里，分成很多区域，其中一个区域是眼的胜义根，显色就在那里变现；一个区域是耳的胜义根，声音的粗的形态在那里变现；一个区域是鼻的胜义根，粗略的香尘在那里变现，这些粗略的五尘都是由四大微粒所形成的。另外还有五尘上的法尘出生的处所，是法处所摄色所产生的处所，这个处所和前五个胜义根的处所是否在一个区域里，目前还没有观察出来，也没有理论和科学依据来证明。后脑这个位置特别的复杂，分成好多个区域，我们看不见，科学家们用高度精密的仪器可以细致的观察到。如来藏变出来的色声香味触在不同的区域产生出来，在色声香味触的基础之上所产生的法尘，五尘上的法尘，有可能在另一个区域上产生。</p><p>如果没有色声香味触的粗糙五尘，就没有由此五尘为基础所显现的细微法尘。与粗糙五尘在一起的细微法尘就叫作法处所摄色，也属于色法，但是比粗糙的五尘要细微。粗糙的五尘，是由实实在在的地水火风四大物质颗粒所形成的，但由粗糙五尘显现出的法处所摄色却是非常细微的。这个细微度可以用一个类比来说明：我们的色身是由粗糙的四大所形成，中阴身、鬼神、天人的色身是由细微的四大所形成，细微的四大所形成的色身，和粗糙的四大所形成的色身，就有很大差别，粗糙的色身就感觉粗重和沉重，不能飘动，不能飞行，没有神通，没有神足通；而微细的色身就与之相反，这也就相当于显色和五尘上的色（法处所摄色）的差别。</p><p>例如一面镜子，前面不管有什么物，它都能一一显现出来，镜子不能用来比喻胜义根，但可以用来比喻如来藏。如来藏就像一面镜子，所有五尘来了，祂都能“照”出来，比如眼前的色尘，不管远近，四面八方的声音，周围的香尘，不管粗细、香臭、远近，如来藏同时全部摄住，全部能够“照”出来。色、声、香、味、触五尘以及无量之多的五尘类，如果和我们相对，如来藏都能同时全部摄受过来，全部映照出来，都能同时形成影像，这就是如来藏的作用。</p><p>三、在各种层次的定中观察六识了别境界，包括昏沉定中，是五识先了别，还是五俱意识先了别，这时就能很清楚的证得是五识先了别，五俱意识后了别。定中突然听到一个声音，心里没有准备，过了好一会儿，意识才能分辨出是何种声音，给声音定义取名字，再了别声音的其它内容。再比如模模糊糊的睁开眼睛，先看见一片茫茫然的色彩，再后是形状，再后是更细的内容。</p><p>四、广百论释论：眼谓眼光，是眼用故，不离眼故，亦得眼名。若此眼光，行至色处，何故远色，见不淹迟。如何月轮，与诸近色，举目齐见，无迟速耶。未见世间，有行动物，一时俱至，远近二方。由是因缘，应立比量，照远色见，不至远色，照近色见，时无异故。</p><p>释：眼就是眼识，是眼根所用的，不离眼根，所以取名为眼（识）。如果眼识能去到色尘之处，那为什么说远处的色尘，眼识见到并不比近色晚呢？为什么天上的月轮与眼前的近色，抬眼都能一齐看见，没有快慢之别呢？从来没有看见过世间能动转之物，能同时去到远近两个处所。（那么眼识就没有动转，并没有去到色尘处，就是说，眼不到色，而有见。为什么如此？）因为这个缘故，应该立论为这是比量所见，眼识照见远色有见，而不到远色；眼识照见近色而有见，也不到近色，见远近色，没有时间上的差异。</p><p>眼识究竟为什么远近色同时见？眼不到色，色不到眼，而能有见；耳不到声，声不到耳，而有闻性，实不可思议。如果用胜义根来解释，就很容易懂了，六识所见都是胜义根里的六尘，内六尘都在胜义根里，哪有远近之说。不管多远多近的色尘，只要传导到胜义根里，就不分远近，都是影子。识心识别就能同时了别到影子，不是了别的实质的物质外色尘；如果了别外色尘，才有远近之说。而如来藏能了别外色尘，但是外色尘对于如来藏来说，也没有远近之别。</p><p>五、觉知疼痛时，有四个识心运作：身识、意识、意根、第八识，四个识和合运作，才能觉知脚疼，缺少一个不成事。具体感觉疼痛的是身识和意识，意根和第八识不感觉疼痛。怎么样才能区别开这四个识呢？如果能区分开，就有大智慧。</p><p>感觉疼痛的感觉属于受阴，当受阴尽时，才能不感觉疼痛。修到受阴尽，必须四禅以上，明心见性以后，要修到四地菩萨以上的境界了。玄奘法师的印度唯识师父，还头疼得想走人，观世音菩萨就来阻止他，说教完玄奘法师唯识再说，并且告诉他过去世的因果。现在世人有修到玄奘法师印度师父那种智慧程度的人吗？即使修到，也没有到受阴尽的程度，可能也没有到色阴尽的程度，那谈什么没有痛觉呢？</p><p>没有痛觉的人，一个是生来报得的果报，福尽就消失。一个是他类众生给与的加持的，更是生灭不可靠。再一个是修四禅八定修出来的，也是生灭法。但是四地以上的菩萨能保持住，不是明心见性和证果的圣人，根本就保不住。</p><p>六、什么叫作眼的余光？几个识心的功德有什么区别？</p><p>所谓眼的余光是不正眼看色，眼角稍带着扫瞄到面部两旁的色相。眼看色时，眼识的大部分注意力用在眼睛的正前方，眼的余光也看色时，眼识极少部分的注意力用在眼睛周围方向的色尘。注意力越集中，眼识了别的越清晰，这也是由定生慧的道理。余光看的色，看不清楚，眼识只是轻微地了别一下，注意力不集中，眼识的势力弱，了别的就不清楚，了别出来的色尘是模模糊糊的。</p><p>眼识的了别是现量了别，意识与眼识同时看色时，有时要通过比较和推理分析才能知道是什么色，意识了别就有比量和非量了别。正在看色时，意识也可能要回到过去或者想象着未来，但是眼识只能看现前的色，不能缘过去和未来的色，因此眼识的了别纯粹是现量了别，当前有色则能见色，没有色就见不到色，眼识不能想象出来色。意识可以有比量和非量的了别，非现实的了别结果有可能不符合事实，所以意识通过比较得出的结论，通过思惟想象得出的结论并不完全可靠。</p><p>楞严经中世尊讲六个识的功能作用时说，眼识只有八百功德，只能看三分之二，脑后方就看不见了，其见色功德不圆满；耳识有一千二百功德，周围和身后的声音都能听得到，隔着障碍物也能闻声，没有障碍，耳识的功德是圆满的一千二百功德；鼻识和身识的功德都不圆满，也只有八百功德，舌识圆满一千二百功德，所以娑婆世界众生耳根最利，舌识也利。意识也是一千二百功德，前际、后际和现际，意识都能缘到，都能思惟和想象出来。</p><p>众生有业障，智慧受局限时，几个识心所分别了别的都可能是错误的，都不可靠。六个识心是由意根和如来藏统摄起来的，如来藏是不观的心，祂是随意根和业缘而显现一切法。如来藏既随意根又不随意根，既观又不观，既知又不知，祂不落两边，叫作般若中观智，这样的般若中观很难理解，证得如来藏以后，中观智就能渐渐出生了。</p><p>在一切法的现行中，如来藏往往要听从意根的指挥而随顺着出生一些法，祂不像个老板的样子，倒像个侍者和随从；而意根好像是老板，什么事都是祂作主说了算。其实业缘现前时，意根也毫无办法，完全处于如来藏现起的逆缘之中，不能挣脱。在众生位时，意根和如来藏谁也作不了五阴身的主，众生的五阴要随着业缘而出生和流转生死，自身也不能作主，众生就是这样毫无主宰地流浪于六道生死之中。</p><p>七、五识的了别性，五识依着第六识才有其了别性，继而有简单的分别、辨别性。比如，眼识最初看不清某种物，就要再作意，触色尘，再领纳色尘，再分辨色尘，最后取色尘之相，只是没有名言；再生起思心所，起抉择作用，决定是接纳继续看，还是躲避不看。眼识也能感觉简单的苦乐受，但是没有情绪色彩，也不细腻。耳识、鼻识、舌识、身识都是如此。因为眼识有分辨能力，看物体时，才要翻来覆去的看，仔仔细细的看，以作最后的抉择和判断。当然这同时是有意识心的共同配合作用，五识不能单独了别五尘境界，因为五识只能了别五尘中粗糙的部分，更多的内容，需要五俱意识配合了别，才能了别出完整的五尘。</p><p>八、天亲菩萨在百法明门论中言：一切法者略有五种，一者心法：眼识、耳识、鼻识、舌识、身识、意识、末那识、第八识，总共八个识。二者心所有法，略有五十一种：五遍行，五别境，善法十一，六个根本烦恼，二十个随烦恼，善恶不定的有四。三者色法，略有十一种，五个有色根、五尘及法处所摄色。四者心不相应行法，略有二十四种。五者无为法，略有六种：虚空无为、择灭无为、非择灭无为、不动无为、想受灭无为、真如无为。</p><p>色法十一包括：五根、五尘和法处所摄色。五根是眼根、耳根、鼻根、舌根、身根；五尘是色尘、声尘、香尘、味尘、触尘。前五根是有色根，由地水火风四大种子构成，也叫作浮尘根，在身体表面，与众生眼根相对，众生能见，属于色法；后脑部位的五胜义根，也是地水火风四大种子构成，属于色法，五根之性为生灭、变异、无常、非我。五尘，由地水火风四大种子所构成，与众生眼根相对，众生眼根能见，因此属于色法，也是生灭、变异、无常、非我。</p><p>法处所摄色，在五尘上有五尘的法尘同时显现出来，也属于色法，叫作法处所摄色，也是由地水火风四大种子构成。法尘依五尘而显现，与意根相对，意根攀缘接触，由意识具体了别，也是生灭、变异、无常、非我。意根触五尘上的法尘之后，如来藏产生意识，就能识得法尘。那就是说意识这时是与前五识共同识别五尘的，五识识别五尘的粗略色，意识同时识别五尘上的细微法尘；五识了别的粗，意识了别的细。以上是极简略概括叙说，细说就要分为内根、外根、内尘、外尘、内法尘、外法尘等等，内容非常复杂。</p><p>九、眼识现起的条件</p><p>佛言：因缘所生法，我说即为空。众生见色、分别色尘是眼识的功能作用，眼识是因缘所生法，祂的现起、出生须具九缘，也就是九个条件，缺一不可，否则眼识不出生，众生就不能见色。眼见色这一法是依赖外缘而存在的，不是自己本身单独就能存在的，因缘所生的法，就是虚妄的、空的、生灭的、不自在的。</p><p>眼识出生的缘有九种：眼根、色尘、空、明、作意、眼识种子、末那识、意识、阿赖耶识。</p><p>（一）眼根</p><p>包括眼的浮尘根和胜义根，胜义根若毁坏，即不能产生眼识见色，所以分别色尘的是眼识，不是眼根。眼根的浮尘根是接收色尘的受纳器，胜义根是产生眼识的处所。眼球玻璃体是外眼根，也叫浮尘根，后脑部主管视觉的大脑皮层，这是内眼根，也叫胜义根。胜义根若受损伤，众生就不能正常见色。</p><p>胜义根与色尘相触生眼识，色尘是胜义根里的内色尘，阿赖耶识通过眼的浮尘根与外界的色尘接触，吸收色尘的四大微粒，经过视觉神经的传导，落在大脑皮层，变生出与色尘一模一样的影像。影像与胜义根接触，阿赖耶识生出眼识，眼识就能见色，众生还觉得见的是真色，不知见的是影子，是幻相。所以眼根是产生眼识的一个处所，是十二处之一。整个见色的过程描述出来需很长时间，而实际的运作比火箭还快无数倍，几乎没有时间间隔。其实还是有一个时间差。</p><p>（二）色尘</p><p>色尘是眼识所分别的对象，若无色尘，眼识就不能产生。色尘包括外色尘和内色尘，外色尘对于众生来说是实有的，由地水火风四大种子组成，眼根和眼识都不能接触到，只能由阿赖耶识来接触，因阿赖耶识有四大种子，与色相应。所以佛说：色不到眼，眼不到色，而能有见。阿赖耶识接触外色尘后，如镜子一般即刻现起和外色一样的影像出来，这个影像称作内色尘。它是一种微细的物质微粒，能通过神经传导到后脑，阿赖耶识就产生眼识来分别这个影子。所以众生所见的色尘是虚妄的、假的、空的、不真实的。</p><p>（三）空间</p><p>空间是出生眼识的一个条件，眼根与外色尘之间需有一定的空间距离，才能见色，否则就不能见色。把一个物体贴在眼睛上，就见不到物体了，因为没有焦点，不能成像，这和摄像机的原理是一样的。这就证明众生所见的色是和录像机录下来的影像一样的虚假，不真实，众生见不到真正的外色。眼也不能自见眼，不能见面、见口、见脖子，因为没有空间的距离，不能形成焦点，就不能成像。所以阿赖耶识就像摄像机，眼识是看录像的人，意根是操控者。</p><p>（四）光明</p><p>眼识的生起必有光明这个助缘，不包括天人、阿修罗、鬼神、非人类，以及有天眼之人。其它众生没有光明就不能见色，众生如果长期处于黑暗之中，眼根的功能就衰退，慢慢的眼根就退化丧失了，成为无眼众生，后代也就无眼。</p><p>（五）眼识种子</p><p>电灯发光必须有电流，电流由发电机发出，一个电子一个电子发出来，形成了电流，通过灯体就发亮了。眼识由眼识种子形成，种子存在阿赖耶识里，由阿赖耶识输出，一个种子一个种子接连不断形成眼识，就有眼识见的功用，众生才能见色尘。</p><p>（六）末那识</p><p>也就是意根、第七识。祂是时时处处作主的心，众生要作什么，不作什么，何时作，何时不作，都由意根作主。意根像一个总经理，什么事也不作，分别慧低劣，但能发布命令，前六识就照祂的命令去了别六尘，产生身口意行。比如说意根决定要买珠宝，身识就得拿起珠宝，眼识就分别，意识就分析判断评价，这一切了别的过程都传递给意根，意根根据意识的分析，决定买不买，讲不讲价格。所有事情无论巨细，都由意根作主，前六识服从，第八识配合完成。意根如果不想看什么，就没有眼识去分别什么色尘，或者视而不见，眼识和意识无心分别色尘。因为意根对色尘不感兴趣，祂可能专注在其它事情上。所以意根是产生眼识的一个缘。</p><p>（七）作意</p><p>作意是眼识想要触知色尘，然后把注意力引到色尘上，眼识才能接触色尘，对色尘产生领受、领纳，然后才能了知色尘，只有连续不断的作意，才能连续不断的接触，连续不断的领受，连续不断的了知，连续不断的造作抉择，眼识才能不断的运行下去。如果没有作意，眼识就不能产生了。</p><p>（八）第六识</p><p>眼识不能单独现起，因祂只能分别色尘的粗相，如青黄赤白等显色，这些是现量境界，其它细相由第六识同时分别，所以第六识是眼识起用的助缘。如看花时，眼识看花的颜色，外观的粗相，意识分别花的形态、品种、名称、生长状态、美丑、韵味、情调、产地等细相。若无第六识，眼识则不现起。看人时，眼识分别人的肤色、衣服的颜色，意识则分别人的性别、年龄、皮肤的粗细、美丑、性格、脾气、气质、修养、内涵、文化、烦恼的轻重等，分别衣服的种类、质料、做工等这些细相。若无意识心来配合，眼识则不能单独起用。</p><p>（九）阿赖耶识</p><p>阿赖耶识是产生眼识的直接根源，直接出生眼识。祂是识种的仓库，存储和输出识的种子，才有眼识作用。眼根和色尘接触时，阿赖耶识就在接触的地方输出第一个种子，灭了又回到阿赖耶识里，第二个种子输出到第一个种子的位置，灭了，回到阿赖耶识里，第三个出来到第二个种子的位置，又灭了，这样形成眼识，象水流一样不断，才有分别作用。所以眼识乍一见色，还分别不清楚，需有多个种子出来，看一会儿，才能看清楚。阿赖耶识是产生眼识的最重要的缘因，因此可见，只要是因缘所生的法，必是可灭的，必是假的，必是空的，必是无我的，所以不可执著。</p><p>十、《大乘百法明門論解》卷2：</p><p>「言十觸者，身之所取，可觸之義，故名為觸。有二十六種，謂：地、水、火、風、輕、重、澁、滑、緩、急、冷、暖、硬、軟、饑、渴、飽、力、劣、悶、癢、粘、老、病、死、瘦、是也。初四乃實，餘皆依四大假立。或曰：『餘既是假，身識何緣？』曰：『即實緣故，既即實緣，何知輕等？五俱意識分別之也。』」</p><p>释：身体上所感觉的触尘，是身识和意识共同和合接触和了别的。总共有二十六种，其中四大微粒组成的比较粗略的实法，是身识所了别的；依此所谓的实法而有的虚法，比较细腻一些，是意识所了别的，叫作法处所摄色。</p><p>身体轻安舒适等等各种触尘，是身体中的地水火风四大种子改变所显现出来的，身识意识共同感觉轻安舒适，身识感觉粗略相，意识感觉细微相，细微相依粗略相而有，前者是五尘实法，后者是法尘虚法。</p><p>这二十六种触尘，都是地水火风四大变化的结果，有五尘实法，也有法尘虚法，身识意识和合共同了别感觉。四大种子的变化所显现出来的触尘，依第八识、第七识、第六识、前五识而产生，说明心改变尘就改变，身心相倚，互相影响，互相依赖，修心就能改变身，改变物质色法。天地乃心所创造和改变，所谓三界唯心，万法唯识是也。</p><p>心的改变，一个方面是通过修定而改变的，心住一境，缘于一念，或绝于念想，不再缘虑，意根少执于身，或不再执身，身体四大改变，身心轻安舒适；或产生更大的变化，出现神奇妙用，神通现前，皆是意根不执所致，复本还原，本有功能现前，得大自在。可见，意根执著，束缚自身与自心，不得自在解脱。那么修行是修什么？根本来说就是修意根，通过修意识和意识修行来改变意根，意根改变，一切法都改变。</p><p>十一、心里念咒，口不出声，声尘就不存在。心里念的咒属于法尘，是独影境，由独头意识单独了别，不用耳识了别。因为没有声尘，就不会出生耳识。独头意识了别时叫作心听，念也由独头意识念。</p><p>但是在念咒时，有意根作主宰念，由意根督导意识念，有意根作主让意识听，由意根督导意识听。这其中还有第八识提供一切所需，勤劳服务。三个识共同完成了心念心听。</p><p>十二、问：耳根触声尘生耳识，识种子在声源声尘处生，还是在耳根处生，还是在胜义根后脑勺那里生起？其它的识出生也如此吗？</p><p>答：第八识在后脑胜义根那里变现内五尘，胜义根与内五尘相触，意根作意，第八识在胜义根处就出生五识；五识、五胜义根与内五尘，三者和合触，产生五识的受。五识就能与意识共同了别胜义根处的内五尘以及法尘，就是黑匣子里的六尘。五识不在黑匣子里，也不在黑匣子外。第八识出生耳识，耳识的功能作用是了别内声尘，耳识不能了别胜义根外面的声音，所以耳识不在外；耳识又无形相，也不在内，却如此起作用了。</p><p>十三、在没有意识出生的情况下，前五识不能单独出生。意根触整体的一个法，包括五尘和法尘，如果意根同时触五尘和法尘，同时了别五尘和法尘，需要六识具体了别时，则五识与意识同时同刹那出生。如果意根触一个法时，最先了别五尘，第二刹那了别法尘，那么五识就会先一个刹那出生，第二刹那意识出生，然后同时了别这个法。五识与意识同时了别，也同时出生，但不排除相差一个刹那。</p><p>一个物，包括色和形以及质，色是显色眼识了别，其余的软硬大小方圆质地等等由意识了别。任何一个物，都是法尘居多，以意识的了别为主。从禅定中现量观行来看，眼识先了别色彩显色，第二刹那意识了别形色形状，再了别表色无表色。耳识先了别粗重震动性的声尘，意识第二刹那了别声音的大小远近，再了别声音的粗细类别等等。五识与意识是并列关系，都是为意根所用，为意根服务。意根不需要，谁也不能出生。</p><p>十四、开悟时，也是独头意识找到和证得第八识如来藏，五识不参与见证。虽然是在眼识见色、耳识听声、鼻识嗅香时，意识证得了如来藏，但是如来藏的运行行相，只有意识单独观察得到，如来藏的运行行相不属于五尘境界，与五尘无关，因此五识不能觉知。</p><p>十五、五俱意识了别的法尘，是法处所摄色，与五尘在一起，不能离开五尘，法尘与五尘和合在一起，才能构成完整的色声香味触，否则五尘也不能现起，五识也不能出现，五俱意识也不能了别法尘。在五俱意识了别法处所摄色时，有独头意识单独了别其他内容，或者是反观五俱意识的了别内容和状态。五尘与法尘同时出现，法尘不是后出生变现出来的。比如眼睛里的倒影和形象就是法尘，在还没有传输到后脑胜义根时就存在了。因此说外五尘上有外法尘，与外五尘须臾不可分离。</p><p>五识不能单独运作起了别作用，必须与五俱意识一起运作了别，只是五识种子仅仅先出生一个，不到一刹那时，意识种子出生，几乎是同步，然后五识与意识共同运作了别六尘。因此说五识的五遍行心所法离开意识也不能单独运作，意识的五遍行心所运作时五识的五遍行心所也同时运作。</p><p>法处所摄色属于色法，色法都是性境，不随识心而改变。比如一个人的相貌，不管对方识心如何，根本不发生任何改变。皮肤颜色属于显色，眼识了别的内容，不随对方眼识的变异而发生改变，高矮胖瘦等等形色表色无表色也是如此。高矮胖瘦是形色，是法处所摄色，五俱意识了别内容，也是性境，不随意识的错会而改变。定力强的人，五俱意识了别法处所摄色时，独头意识就能作其他想，从而改变法处所摄色。</p><p>观想需要很强的定力，主要依靠独头意识的非量比量了别作用，五俱意识的定力不够好。定力主要指独头意识的强大作用力，无中生有，有中变无。心中想日，落日现前，日观成就；心中想白骨，白骨现前，白骨观成就。</p><p>十六、问：我一直在思维“法尘”的内涵。法处所摄色应当不仅是指意识所见的细的色相，还包括眼耳鼻舌身识所见的粗的色相。因色与心相对，有色尘的概念，却无“心尘”的名相，而以法尘统摄，色占一半，心占一半，法包括色法和心法。</p><p>阿那律无眼所见的色，既有粗的色相，也有细的色相，如果不见粗色，细色又怎么能见呢？无眼而见色，无眼根自没有眼识，当然只有意识见色了，所见的法处所摄色，粗细皆分明。</p><p>答：法尘的概念内涵相当广泛，一切法都是法，都叫作法尘。尘，就是世间相，犹如灰尘一样，念念不停留，楞严经中世尊称作客尘，是世间客人，不能常住世间，生来又灭去的，不是主人。</p><p>十一色法：眼根，耳根，鼻根，舌根，身根，色尘，声尘，香尘，味尘，触尘，最后一个法处所摄色。法处所摄色包括：色尘处所摄的法尘，声尘处所摄的法尘，香尘处所摄的法尘，味尘处所摄的法尘，触尘处所摄的法尘。法处所摄色的法尘不能单独出现，一定要与五尘同时出现，五俱意识所了别。所以识心了别到的法处所摄色，一定有五尘的粗略相同时出现，没有这些粗略相，就没有细相。</p><p>阿那律没有眼根，肉眼不能见色，他见色都是用天眼，有神通的天眼见色，无色不见，与肉眼见色有很大区别。阿那律因为无眼，就没有胜义根里的显色，也就不出生眼识，没有眼识和意识见色。但因为阿那律修出了天眼，他见色就用天眼见，比肉眼所见要广大和微细得多。</p><p>十七、在各种层次的定中观察六识了别境界，包括昏沉定中，是五识先了别，还是五俱意识先了别，这时就能很清楚的证得是五识先了别，五俱意识后了别。比如定中突然听到一个声音，心里没有准备，过了好一会儿，意识才能分辨出是何种声音，给声音定义取名字，再了别声音的其它内容。再比如模模糊糊的睁开眼睛，先看见一片茫茫然的色彩，再后是形状，再后是更细的内容。</p><p>十八、巨大的声音，能够震坏耳骨，使耳朵变聋。这说明声音是一种物质色法，有物质色法的冲击力量，那就有触尘，与物质的耳朵相触，从而震坏耳朵。声音的粗燥相与耳根相触，有耳识先分别粗燥的声音，意识后分别细相的声音。我们往往是耳识先感觉耳根的震动声，这是五尘，然后意识才能知道具体是什么声音，以及其它细法。</p><p>十九、鬼王有一千只眼睛，眼识种子流注在一千只眼根处，一千只眼睛都能同时见色。有一千只手和脚，身识种子同时流注到一千只手一千只脚上，一千只手一千只脚，就能同时有作为。比如一个人的浑身上下，从头到脚都属于身根，身识种子流注到身根各处，全身上下里外都能同时有所作为。人的心念有很多，意识种子流注到各个法尘处，意识就可以广泛分别，广泛作意和触受想思，广泛造作业行。</p><p>大悲千手千眼，哪个是正眼？正眼不见色。</p><p>二十、识触尘时，根尘识三者和合触，结果是什么？结果是眼识了别了色，耳识了别了声，乃至于意识了别了法。</p><p>三者和合触，这件事非常重要。根不触尘，就没有识，识不触尘，识就没有任何作用。各个识都是触什么样的尘？把各个识所能触的范围弄清楚，然后思惟没有六识还能作什么？无色界众生没有色身五根，为何还有意识?这些问题弄清楚了，将来悟时就是证悟。否则定力不够，理论又不通透，无法深细观行，修行到最后最多是一个解悟。现在解悟的人越来越多，几乎没有什么功德受用，烦恼还是照样很重。</p><p>根触尘，生识；根不触尘，就不能生识。命终四大先分解，这时还有识，还能了别到色身四大分解的状况，就会感觉非常痛苦。</p><p>每个人的色身都是自己的第八识所执持的，自己色身的改变也是自己的第八识作用的结果。那么一个人怎么能去杀另一个人，从而改变另一个人的色身状况？没有意识，五识也不能生起。了别六尘是意根的决定，由意根作主宰，意根一定是触法尘的，意根不决定，不作主宰，第八识就不生五识；而意根主宰了，就是触法尘了，一定生意识，意识也是五识的俱有依。</p><p>二十一、如来藏在后脑胜义根处变现起色声香味触法等六尘，一定是前五尘先变现出来的，前五尘是粗略的色、声、香、味、触，先变起一个粗略的五尘，供前五识来了别；在粗略的前五尘之外，再变起细微的法尘，叫法处所摄色，根与尘一相触，就产生了六识，根尘识三者再和合触，六识就能了别六尘。</p><p>既然先变出粗略的色声香味触，五根当然就先触五尘，肯定是前五识先出生，先了别五尘，然后才是下一刹那微细的法尘变现出来，意根与法尘相触，意识才能出生来了别法尘，意识一定是在前五识后面才出生的。这就是第一刹那，前五识先了别粗略的色声香味触，第二刹那才是意识了别微细的法处所摄色；那么第一刹那是五识，第二刹那是意识，第三刹那是五识和意识和合运作共同了别，再以后都是两个识和合运作共同了别六尘法，一直到在这个法的了别活动结束为止。</p></div>"
},{
    "title": "第十章 六识的现量了别",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  六识的现量了别</strong></p><p>一、什么是现量、比量和非量</p><p>现量就是对于法能够现前观察思惟，见的是法的真实相貌，确认的是法的当前状态，不会扭曲真实相。如果不能如实见到法的现前状态，不能如实的观察法的真实相貌，就会采取其它方法，如采取与参照物相比较对比的方法，这是比量。比量也许能够比较出一个正确的结果，也许不能比较出一个正确结果。比量如果要比较正确，有个前提条件，就是用来作参照物的法要准确无误，那么比较出来的结果准确率就能高一些，因为有现成的参照物，就不需要过细的思惟，所需要的智慧不多，所需要的定力不深，也可以没有禅定，就能比较出一个结果，准确与否不一定。</p><p>如果现量智慧不足，还可以采取另一个方法，那就是想象、幻想和臆测，可以沿着一定的思路和轨道，也可以完全想入非非，没有章法和逻辑，这是非量。非量是在没有什么证据情况下的思惟，凭空想象成分比较多，没有能力收集和掌握证据才不得不如此，可见非量所需智慧更浅，也不需要什么禅定。由此可见，现量需要相当的定力和智慧，其智慧是非常可贵的，是可值得信赖的，实证佛法就靠现量智慧。</p><p>在非量当中，由于没有证据，全靠意识的想象，就像天空中的风筝，也许有线牵，也许无线牵，在这当中，意根使不上力，意根的智慧无法像意识一样漫天飞舞，无法想象臆测，意识想什么就是什么，意根无法确认，因此不能实证，但不排除巧合和撞大运。这样意根的智慧不会增长，只增长意识的智慧。再遇到不相类似的问题，不能举一反三，意识只好再重新非量一番，说明其智慧增长很有限。</p><p>在比量当中，拿两个事理相比较，主要靠意识的推导排比作用，意根的智慧使不上多大的力，意根也只能旁边看着，其结果意根无法真正确认，但不排除比量正确的结果，但也解决不了意根的心疑，意根的智慧不会增长，只增长意识的智慧。</p><p>二、比如一颗参天大树，想要得到其高度值，有三个渠道，一个是现量观察，一个是比量，一个是非量。采取非量的方法就是没有什么根据的思惟想象猜测，对于树的高度没有什么经验，不知道如何比较，更不能如实观察，其结果可想而知，恐怕连自己都不能确认，何况他人。采取比量的方法，就是与旁边的电线杆子比较，与高楼比较，与山体比较，然后得出一个大约值。其结果就是心里半肯定半不肯定的，表面上可能要自信一些，但如果有人非要较真，或者有更确切的证据来否定，心里就没底气了。当然如果有人也同意这个结果，心里会增加一些底气。</p><p>除此之外还有一个渠道和方法，就是现量观察，但是这非常不容易，需要很多的证据资料，需要丰富的经验，观察力要敏锐要准确，心思要细密，数据要准确。而有丰富的经验，有大量准确无误的数据资料，这需要下一番苦功夫，经历了相当一段时间的探索，其辛苦程度常人难比，其观察时的定力常人难比，因此最后的智慧也同样常人难比。</p><p>在探索收集数据的过程中，意根一直都在观看，慢慢受着熏染，当意识一旦得出一个结论出来，非常有信服力，意根再经过自己的思量，就会确认下来，因为有理有据。意根由于智慧浅没有分析能力，就容易相应于证据充分的，相信现量境界。其实这个结果也是意根自己得出的，一切数据都摆在那里，非常现实，意根自己就会起思量，就有结论出来，只有自己得出的结论才能确信不疑，当然自己是最信受的，不管别人如何说，自己都能果敢承担，没有商量的余地，也不容易撕毁自己的结论。</p><p>由于现量观察是这样的辛苦和不易，追求短期效应怕吃苦的人不愿意长期辛苦探索，修行时间短的人定慧都不足，都无法累积足够的经验，因此无法相应于现量观察。因此喜欢比量和非量，喜欢臆测和比对的人很多，因为这些方法都比较省力，所需时间不用多久，也不用多少定力和慧力，就能有最后的结果出来，这多么轻松，这些人只要结果，中间的过程不需要。</p><p>而恰恰中间的过程非常重要，这是提炼证据的过程，是熏陶意根的过程，是降伏各种烦恼的过程，是量变到质变的过程，没有这个过程，就没有质变，自心烦恼永远不能降伏不能改变。所以有一些人到处打探结果，企图不经过辛苦参究的过程而轻而易举的得到果实，这个果实就不是自己的，无法享用，自己仍然是穷人一个，再妄称法王，只能遭到诛杀，后果可畏。</p><p>说到这里，有的人会问，你说了半天还是没有说清楚如何是现量观察。可是我告诉你，别人所说的现量观察，自己知道了，就是比量，已经不是现量了。真正的现量就需要自己亲自去观察，去认证，所以打探出来的结果，猜测出来的结果，非常不可靠，即使是从现量观察的人那里打探出来的结果，也不属于自己的，如果是从比量得出结果的人那里打探结果，那就更不属于自己的，更不可靠。再辗转传播结果和打探结果，其结果就很可怕了。在此郑重警告一些不愿意下苦功的人，只有亲自参究，才能亲自得果，自在用果，否则就是苦果，这个苦果是完全要自己亲自受用、单独受用的，果报不虚。</p><p>三、我们通常所说的现量境界，是指目前、当下、现在正发生着的种种境界。而现量了别，就是指六识对六尘能够现前观察、了别和证知某些法的真实存在性，不用比较、比对、想象和推理等思惟活动，了别出来的都是事实真相。前五识完全是现量了别五尘境界，了别当前就存在的、正在发生、正在运行着的五尘境界。第六识有比量、非量和现量等三量的了别，但第六识也能现量了别当前存在的境界，在很多的情形下，第六识的了别是比量和非量的。六识现量了别境界就是了别当下，了别现前所存在的境界，不用去比对和想象参究，了别的结果与事实完全相符，就叫作现量了别。</p><p>意识心在了别现前境界的时候，比如正在观察眼前的山河大地，这时候眼识是现量了别山河大地的显色，比如山水的色泽，大地的颜色，见色时刚一入眼帘的就是这个景象。意识则是了别山河大地的形色、表色和无表色，比如山的大小、高矮、形状等等，河水的长短、宽窄、深浅等等，这些是形色。山势、水势、水流的状态等等是表色，山的巍峨、陡峭、光秃、挺拔，水的汹涌澎湃、幽深、恬静等等是无表色。这些境界都是现前存在的，能够被意识现前观察和识别出来的是现量境界，不用比较，不用幻想，了别的真实，因此意识和眼识都是现量了别。意识也有比量和非量的了别，有些境界要通过对比和想象思惟才能了别清楚，了别明白，这就是意识的比量了别。当然也可能有了别错误，判断错误，思惟错误的情况发生，这种错误的了别，一定是属于非量了别。</p><p>思惟判断错了，再加上经验和智慧的不足，由比量得出的结论往往就是错误的结论，结论与事实不符，就是不如实了别，不如实了别，就是非量了别，因为这种了别不符合实际情况。愚痴众生当中非量了别的几率比较大，独头意识中非量了别的几率也比较大，神经和精神不正常的人当中非量了别的几率就更大了。比如一个人在狼吞虎咽在吃某种食物，吃得好像很香的样子，旁边的人就认为：这个人吃的这个食物，一定很美味，要不然他怎么能吃得那么香，根本想不到那个人已经饿了很久，吃什么东西都觉得好香。这人于是就跟着一起吃，结果吃了第一口咀嚼一下，马上就吐出来，他感觉到食物中有一种霉味，于是就恶心起来。这就是比量的错误了别，判断错误，经验不足所致，这样的例子非常非常之多，不可胜数。</p><p>四、意识和眼识一起了别事物时，意识有现量了别，也有比量了别，也可能有非量了别。比如山的高度，意识有时不能马上就判断出来，就要通过与其它物体的参照比较，才能准确判断出来，这就是比量了别。当意识判断思惟错误时，就是非量了别。当山河大地正处在自己的眼前，一般来说不需要意识通过想象、思惟、比较才知道，直接就能了别到而没有错谬，这时的意识就是现量了别现量境。如果看见远处的山顶上有白云在飘动，飘动白云衬托下的大山好像在移动，意识就判断是大山在移动，这时的意识就是非量了别，属判断失误。</p><p>当意识心正在作现量了别五尘上的法尘境界的时候，前五识肯定是存在的，也同时在现量了别五尘，否则意识心就不能了别前五尘上所显现出来的法尘的现量境界。但即使是目前真实存在的现量境界，意识有可能作比量和非量了别，有时准确，有时却不准确；不准确的了别，完全是非量的了别，是错误的了别。</p><p>耳朵在听声音的时候，耳识是现量了别声音的音量、振动频率，意识心对于声音也有现量方面的了别，其了别的内涵要比耳识了别的内容要丰富得多。意识所了别的现量境，就是目前传过来的声音的微细法尘，不是回忆从前听到的声音，也不是去幻想并没有出现的某种声音。意识不用对声音进行比对分析而能了知声音的内涵，这是意识的现量了别。比如听到说话的声音，意识心马上就知道了声音的来源、音质、内容等等信息，判断无误，这是现量了别；意识也有可能去作比量的了别，用思惟、推理、判断、比较等等方式来了别声音的内涵，说话人隐藏的目的和企图。意识有时能了别得正确，有时则是了别错误，了别错误时，则完完全全就是非量了别。</p><p>又比如听到风吹雨打的声音，耳识直接现量了别风雨声音的振动及声波对耳膜耳鼓的冲击和影响。意识则是了别风雨声的大小、粗细、来源、方向，缓急等这些内涵，意识直接就能了别这些内涵，不用比对和分析，这就是现量了别。但有时也有比对、分析、思惟、推理的情况存在，意识要借助于比较和想象的思惟才能判别清楚，这就是比量了别；如果了别错误，则完全是非量了别。意识可以离开耳识的参与，自己单独作比量和非量的了别。在意识心了别的时候，如果耳识心不现行，意识就不能了别声音，两个识心必须同时存在才能现量了别到声音；所以意识在五尘上的现量了别，都要有前五识的参与。</p><p>在鼻嗅香气的时候，气味就是现前存在的现量境，鼻识和意识都可以了别这些现量境。鼻识第一刹那现量了别气味对鼻黏膜的刺激程度，进而意识第二刹那了别气味是香是臭，再以后意识就了别是哪一种类的香或哪一种类的臭，香臭都到了什么程度，是从什么物体上发出来的，离自己有多远或有多近等等。这些法尘有意识的现量了别，也有可能作比量和非量的了别，因为意识对气味的知识面不全，就不能完全是现量了别。只有智慧达到圆满了，这时了别一切法都是现量了别，这可能只有佛陀一人能做到。</p><p>如果佛陀还要作比量和非量上面的了别，那么佛陀就不是一切种智的拥有者，说明佛陀的智慧还有不够圆满之处，还有自己不能现量了知的法存在。那么就不能称其为一切种智的佛陀，最多是个妙觉菩萨。佛陀能现量的圆满了知世间一切法，不用比对和想象思惟，其智慧德能圆满具足故。</p><p>在品尝饮食的时候，舌识现量了别饮食粗糙的味尘，第一刹那的了别一定是舌识，第二刹那是意识的了别，第二刹那之后二者同时了别。意识心了别饮食细微的味尘，了别具体的酸甜苦辣咸淡及其程度，味道太浓，如果不适应，就要把饮食吐出来，这是意识现量了别的结果。当然其中也有比量和非量的了别，根据记忆来了别的是比量，想象成某种饮食的味道，则是非量。如果对于味尘知识的了解是有限度的，就得用比量和非量的了别，其结果往往是错误的。即使是现量了别，有时也有错误，不一定都完全正确。当意识作比量和非量了别时，是意识的独头境界，前五识不参与这种了别。</p><p>在感受色身上的触尘时，身识第一刹那现量了别触尘的粗糙相，意识第二刹那现量了别触尘的细微相，接下来二者同时再作现量了别。但是当接触的触尘非常特殊时，身识和意识各了别一二三个刹那，就得马上离开，不能再接触触尘了。比如当身体碰到火时，身识马上就觉得烫，但是没有概念，意识马上就了别到火热的程度，还没有来得及分析、比对和思惟，于是意根当即决定，立即躲开火源。这是意根缘于身根和身识意识的了别而作的现量了别，于是就直接作出决定：躲开。这里的身识、意识和意根三个识都是完全的现量了别，没有比量和非量的了别，因为意识来不及作比量和非量的了别，意根就决定马上躲开，身识和意识随即就在火的触尘上面消失不见了。</p><p>又比如手指偶然接触到一根针的针尖，身识和意识都是在第一刹那就了别到了疼痛，意识来不及思考分析作决定，意根就直接作主决定把手拿开，于是手就突然的抖了一下。这里三个识都是现量了别，没有意识的比量和非量的了别，因为已经来不及了。等到手指躲开针尖以后，意识再继续了别刚才突发的情况，就知道到底是怎么回事，原来是不小心手指触到了针尖。这时才有意识的比量和非量的了别。比量的了别，也有可能是正确了别，从而得出正确的结论；而非量了别则是不正确的了别，与事实完全不符。</p><p>在禅定当中的六识也有现量了别，在未到地定中，六识都存在，就可以现量了别当前正存在或显现的六尘境界。其中身体的轻灵、高大、舒适、舒展等状态，是身识和意识共同的现量了别，而内心的一种空灵、虚脱、清静的感受，是意识心单独的现量了别，属独头境界。意识也有可能因为智慧不足或者禅定知见不足，不能对禅定境界作完全的现量了别，就存在有比量和非量的了别。</p><p>在初禅定中，意识与眼识、耳识和身识三识，共同现量了别色、声、触、法四尘，意识可以单独现量了别内心的轻安、喜悦、宁静和空幻等等感受，可以单独现量了别定境法尘。意识也可以有比量和非量的了别定境法尘。在二禅的定境中，只有意识自己单独存在，没有前五识的存在，因此在二禅的定境中，意识单独现量了别深细的定境法尘，这时意识的现量了别是极其深细的，几乎感觉不到有自己的了别，也感觉不到内心还有个知，也几乎感觉不到内心深深的喜悦和舒适，因为太深沉了。在这个境界里，没有意识的比量和非量的了别，因为没有杂乱的幻化的定境出现，意识处在无觉无观中，已然没有了思惟分析的活动。</p><p>在断我见时，意识可以现前观察到五阴的生灭虚妄性、苦性和空性，心中明确知道五阴非我、不异我，五阴与第八识又不相在。这个知，就是现量的知，因为五阴非我是一种真实之理，叫作真理。意识对这个真理的认知是真实而又现实的，同时也颠覆了从前的一切错误知见。因此，意识此时所见的就是如实之见，是完全的现量了别，纠正了从前的非量认识，这是智慧的现量认知。因此真正的断我见，就是现量境界。</p><p>在明心之时，意识证得了真正的自己第八识，这时就能够现前的观察第八识的体性和运作，观察第八识的清净性、真如性、不生不灭性、不动摇性等等，意识此等的观察就是现量了别，就是现量境界。六祖开悟时所说的五个何期自性，就是现量观察实证的现量境界。第八识与五阴七识的和合运作，是当前正在发生着的活动，是现实的，此时的意识观察了别就是现量了别，也就是意识证得第八识是现量的智慧境界，没有一丝的比量和非量。如果是非量的了别，就没有真正的明心开悟可言，这样的开悟就是想象中的悟，不是真实的开悟，因为没有亲证的缘故。</p><p>在眼见佛性时，是证得整个身心世界的如幻观，能够现前真切感受佛性的美妙运作，现前真实地感受自己身心世界的如幻如化。因而此时的意识是现量了别，是现量的智慧境界，不是比量和非量境界，否则那就是想象的见性，并不是真实的见性，因为没有亲证的缘故。在明心见性以后的修行过程当中，各种观行的证得都是意识的现量了别，都是现量境界。修行的越深，意识的现量境界就越多，比量和非量境界就越少。一直修到佛地，佛地的意识全部是现量境界，没有比量境界，更没有非量境界。</p><p>五、现量了别，是对当前正在发生和存在的现象界能进行如实的观察了别，而没有错谬。比量了别，是意识能够进行思惟、分析、推理、判断，有可能是如实的了别，也有可能是不如实的了别，而非量了别是依赖于意识的幻想推理想象，其结果有可能是对的，也有可能是错的。知道有现量境的存在，就有识心的分别和了别活动，否则就不知道有现量境的存在，如果没有了识心的分别或了别，我们对世间就真的一无所知了。</p><p>现量境，就是现前存在的境界，七识当下直接就能了别到，不用与其他尘境相比对，也不用思惟想象，不用假设，没有了这些环节，也能直接可以发现到现前存在的五尘境。前五识肯定是直接了别到现前存在的五尘境界，意识依于五识，也能直接了别现前存在的五尘境。如果还需要通过比较，通过假设，通过想象才能作出了别的，显然是意识比量了别，所以意识就有了现量、比量和非量三种了别。</p><p>第七识只相信现实，相信事实，证据不足或不可靠的五尘境和事理，第七识都不肯相信。当然现实和事实也有层次上的区分，也是相对的，证据也有真证据和假证据，意根无始劫以来就相信了假证据，认为五阴就是我和我所，现在就要把那些假事实假证据推翻，去求证真理。</p><p>意识即使是非量了别，如果在证据确凿的情况下，得出的结论是完全符合事实的，第七识也能相信。只有第七识相信了以后才能作出决定，否则第七识就暂时不作出决定，因此，第七识要根据现量作出决定。所以必须要在证据确凿、没有疑问的情形下，意根才愿意相信，因为祂自己的智慧不足，只有把现成的尘境事理摆在祂面前，祂才肯相信，祂自己不能作详细的比较和想象，因其具体分析的智慧不足故。</p><p>因此遇到任何事理，想要让第七识认可或肯定，必须要有充分的证据，这就需要意识作细致的思惟分析，拿出有说服力的依据来，这样，思惟观行与整理就显得尤其重要。如果意根的智慧也是具足的，我们学佛就不必如此大费周章了。</p><p>六、怎样的观察才是现量呢？比如我们观察色蕴的虚妄、生老病死，我们大家都可以现前观察到，这是现量。但色身的刹那生灭，凡夫是观察不到的，如果根据物理学上所讲的电子瞬间生灭的原理，用来推求出色身是刹那生灭的，这种推理是否也算是现量？实际上色身的刹那生灭现象，可能只有佛陀一人能现量观察到，这需要极深的定力和深妙的智慧，没有极深的定力是绝对观察不到的。我们只能通过比量而知，比量而知如果是正确的，符合佛陀的正教量，也可以方便说是现量。</p><p>比如我们依照佛陀的教导，观察宇宙器世间的生灭虚妄性，实际上我们无法用眼识现量观察到眼前宇宙器世间的生灭虚妄性，因为我们的寿命太短暂了，我们没有足够的时间长度对宇宙器世间生灭虚妄现象进行观察；宇宙也太广大了，我们的眼界也太有限了，无法观察到整体的宇宙器世间，但是如果我们内心通过的如理思惟，最后能真正的认可此理，这也算是现量证得宇宙器世间的生灭虚妄性，就是如理如法的思惟结果，并不是非量。</p><p>再比如刑警破案，根据现场掌握的罪犯证据，采用比量和非量的思惟推理推敲等方法，最终破了案，使真相大白于天下，这样所作的比量及非量观察的结果是正确的，这也是现量境界。也就是说，凡是符合事实的比量及非量的推理，也算是现量境界。再比如学生解几何题，也是通过比量和非量的思考方式，最后证明了题目的正确性，这也是现量境界。我们虽然不能现前观察到色身的刹那生灭现象，但是可以通过如理如法的思惟观行，最后证明到这一点，那么所得到的结果就是现量境界。</p><p>七、定中意识所缘有三量，如果缘色身觉受，是现量了别；如果观想思惟，有非量了别，也有比量了别，也有现量了别。如观想自己在本地，变成某种形象飞往彼地，想象各种境界，都属于非量了别。如观无量寿经中的日想观，开始时是非量了别，到观行成就时，落日不观而自动现前，定果色出现，意识的了别就是现量了别。</p><p>如果比较色身与从前的差别变化，比较境界的善恶美丑，是比量了别；如果思惟得出一个正确而现实的结论，就是现量了别。二禅以上定中意识所了别，全部是现量了别，因为没有思惟，不能观想，只是单纯的了别定境法尘，只是觉知不出来，不能反观自己的了别性。定的层次越深，其了别越是现量了别。如果定中过去世的影像现前，意识也是现量了别，未来世境界呈现出来，意识也是现量了别。</p><p>八、思想不动念是否能了别境界？坐在家里沙发上，看着家里熟悉的家具，心里又没有念头，这时候心里能不能很清楚的知道各个家具的名词属性作用？早上刚刚睁开眼睛，没有语言文字心里念头，是不是能知道自己在家里躺在床上，并且刚刚睡醒？如果能，就是了了分明 。</p><p>六识现量了知，一定有知，但不一定有念。念是五别境心所法，不是时时处处都要现行出来的，而知、了别是五遍行心所法，必须时时处处现行出来，只要有识心，就有五遍行心所法，但不一定有五别境心所法。所以识心有知有了别的时候，不一定有念头和心念。有的人比较懒散的时候，就不愿意起念，定力好时，也不愿意起念头，但肯定有知，有了别性。如果是比量了别和非量了别，一定有五别境心所法的念心所，一定有念头，有思想，有动转。</p><p>九、意识的现量，知的正确就是现量；了解的法如实无缪就是现量；符合事实就是现量；体现真理就是现量；不用比较而知，知的正确就是现量；不用想象幻想而知，知的正确，符合实际情况，就是现量；回想小时候的事，明白一件事，也是现量；观察前世的色身不是我，观察后世的色身不是我，观察正确时，就是现量。有神通知无数劫前的人事就是现量，知无数劫后的人事就是现量。眼睛看着苹果，却认为那是梨，这是非量，不是现量；睁眼说瞎话，就是非量。如果意识都是现量，意根的非量必随之得到扭转，就会如实知道一切法。</p><p>十、七识心了别的三种方式</p><p>非量，是指识心了别的结果是错误的不符合事实的，还是说识心了别的方式可以想象、幻想、猜测、预测？是指识心了别的方式可以想象、幻想、猜测、预测。</p><p>那就只有意识才能有非量的了别方式，五识必须现量了别，意根必须现量了别，第八识都是现量了别，了别的都是现量境界，因为一切法都是第八识当下变现出来的，对于第八识来说都是现前存在的法，因此都是现量境界。</p><p>不是现量境界的法，第七识意根无法缘到，也无法认知，所以要想让意根接受和认可什么法，必须是现量的法，有事实依据，非常真实，理路清晰，有章法可寻，所以意根断我见比意识断我见困难得多，不可以想一想琢磨琢磨就了事，必须深透的思惟观行，意根不断的考量取舍，直到理由充足，道理清晰，呈现出是事实，意根才能认可。</p><p>五识也是现量了别五尘境界，目前没有的五尘，五识无法去想象着了别，无法幻想出什么五尘境界。而意识所想象幻想的回忆的展望的任何法，都必须是第八识呈现出影像，可以说是无中生有，但都是第八识幻化和执持的，所以第八识了别的都是现量法，不用去非量比量了别什么法。任何人的意识了别时都有三量：现量、比量和非量。现量知，是知当下现前存在的法，目前不存在的法不了知，不用去回忆和想象比较，对于法不作加工，当下是什么就是什么。</p><p> 十一、为什么说同类事物的类比不是比量而是现量呢？比如说人类，肯定都具有相同的特点，单独一个人肯定与人类有相同之处，不用把这个人再与同类进行比较才能确定这个人确实是人，而非其他类。新生婴儿出生时，不用与比较就知道是人，非他类，甚至在母胎里就知道这个孩子是人而非他类。这样的知就是现量的知，不是比量知。</p><p>一个模具生产出来的产品，都具有同样的特征，知道一个是什么特征，就知道其它产品是什么特征。这个知是现量知，不是比量知。</p><p>如果是同类之间进行比较，而知二者的差别，是比量而知。比如说不知道某人个头高矮，就要与另一个标准个头的人比较，与大部分人比较，然后才能知道，这是比量而知。但是这个比量知的结果，可能正确，也可能错误，那就是说结果可能是现量，也可能是非量。</p><p>比量知某人个头高矮，不如现量知某人个头高矮的人聪明，现量知，遇见某人当下就能根据经验智慧判断出来，不需要去比较衡量，比较衡量说明没有现量智慧，观察力判断力都不够好，所以不得不去比量。如果现量判断出来的结果不符合事实，那就不是现量，而是非量了，说明他的智慧也不够好，也可能过于自信，还不如比量的人谦虚谨慎。</p><p>十二、以此类推的类比不是比量</p><p>世俗界有个类比，相同种类的事物，证明了其中一个或者是一部分，就证明了这个同类都是如此，不用全部都证明，这是世俗界的规矩，佛法也同样适用。人类检查搞的抽样调查，调查一部分，就能证明全体同类。这属于比量吗？不是比量。我观行自己五蕴，证明了我的五蕴苦空无常无我，就会得出他人的五蕴也是如此，所有众生的五蕴都是如此。这是比量吗？不是比量。</p><p>比如我参禅开悟了，证得了自身中的第八识，然后就知道他人的第八识也是如此，所有众生的第八识都是如此。这是比量吗？不是比量。几何算数所有学术上的实验和推理，经常用到如此方法证明：以此类推。写文章分析事理，都会用到以此类推这个词汇，表示后边的与这个的相同的，不用再证明推导了，这就是同类的结论。这是比量吗？不是比量。</p><p>证明一切事理结论的正确，有时候不从现量出发，而是从非量出发，思惟考证，最后得出一个现量的结论，非量也有很多很大用处。头脑够用的人，胡思乱想得有道理，那就不是胡思乱想，叫作头脑灵光。头脑不灵光的人，无论给他多少现量数据，就是得不出一个如实正确现量的结论出来，这种人太多。</p><p>经历了数不清的苦痛，仍然不知道苦，内心思想麻木，实际上就是愚痴。愚痴的人占百分之九十以上。经历了无数挫折，不知道回头，仍然钻死胡同，一根筋的愚蠢。苦空无常无我，明明都是现量，有那么多的现量数据证明，所有人就是看不清楚，还要学佛法，思惟观行，还观行不出来，这叫作愚痴。明明五欲六尘，无常生灭变异，抓不住，执着不了，事实真相都已经现量呈现出来了，明晃晃的，无数人就是看不明白，管不住自己，还要去死死的抓取执取，不肯松一松手，歇一歇，可怜又愚痴。</p><p>十三、现量与非量</p><p>见绳为蛇，属于非量，还是比量？因为既没有正确的了别绳，也没有如实的认识蛇，都是错误了别，不是事实所以是非量。骑驴找驴，是什么量？自己骑的驴不认识，不把驴当作驴，还要去另外找驴，不能正确的认识驴就是非量。自己的五阴身全体都是第八识，自己却不了解，还要另外去找一个第八识，是什么量？同样是非量。凡夫看见父母认父母，看见儿孙叫儿孙，也不是现量，是非量。所以佛陀教阿奢世王观行没有其父这个人，没有杀父这件事，让他证得五蕴空无我，灭除非量认知，回到现量中来，杀父罪业才能灭除。</p><p>阿罗汉所证得的五阴非我不异我，生灭变异空，是什么量？阿罗汉所证得的五蕴空无我，虽然是现量，但是半现量，还不究竟，所以还需要修学大乘法，证得究竟法。菩萨们证得了第八识以后，获得了各种层次的智慧，这是什么量？阿罗汉和菩萨所证得的法，虽然都是现量证，但都是相对的现量，不完全是现量，还有非量成分。</p><p>观自在菩萨照见五蕴皆空，是什么量？如果观自在菩萨照见五蕴皆空，完全是现量的，那修行就到底了，成佛了，不需要再接续修行了。因为包括等觉妙觉菩萨证得的法还不究竟，所以还需要再破除最后一品无明，才完全成佛，无明破尽，才是完全的现量智慧。</p><p>严格来说，只有佛陀的智慧认知，才是完全现量智慧，才是究竟的毫无疑问的，是完全符合现实和真理的。其余菩萨们的智慧认知有不同的现量成分，还不究竟。阿罗汉辟支佛们的智慧认知比菩萨还不究竟，空的程度层次都不够。凡夫完全是非量，没有现量，即使见山是山，见水是水，看父母是父母，见冤家是冤家，一点不错乱，那也都是非量，迷惑颠倒。非量认知，相当于精神错乱的认知，众生都有不同程度的精神病，都不健康。</p><p>十四、从究竟义上面来说，一切法对于佛陀来说都是现量的，对于凡夫来说都是非量的，因为佛陀是完全如实了知，众生是错谬了知。众生的六识心，自无始劫以来一直都在有意或无意的欺骗自己的意根，传递给意根的都是非量境界，因此就导致了意根的染污性越来越严重，无明越来越深厚。如果意识通过接触正确的圣教量，通过如理作意和正确的思惟，就可以让六识和意根有了如理如法的现量境界，从而知道一切法的事实真相。凡夫现量观察一切法都自认为是真实的，其实结果全都是虚妄的，凡夫就没有得出过一个正确的结论，得出的往往都是错误的结论；凡夫的现量观察并不可靠，因为没有佛法真实智慧的缘故，依此所谓的现量观察，结果生生世世就因此错误的结论而受到生死轮回之苦。</p><p>十五、意识在观行五蕴无我时，有逻辑思惟分析推理作用，这算不算现量？意识思惟观行时，三量都可以体现出意识的智慧。意识在观行五蕴时的逻辑思惟分析推理也有三量，智慧越高越有现量，观察到的事实越多，证据越充分，理由越充足，越能熏染意根，离实证越近。</p><p>意识寻找证据越充分越现量越好，因为意识是为意根来搜集证据的，现量的证据有说服力，能让意根接受，理由充分。意识非量的想象幻想证据不足，意根无法接受。这样对于意根的思量就起不到引导和推动的作用，就不能实证。</p><p>现量不是指一定要亲身经历的，看到他人发生的事，所有众生身上发生的事，都属于现量观察，只要符合事实，道理通达，逻辑严密，就可以了。但是类似四大种子这个问题确实无法现量观，因为智慧不足，只能算作熏习，算作非量，但对于诸佛就是现量了。我们每个人意识的智慧都有限，所以有极多的事实和真理无法现量观察，所以实证很难很难，只能实证一些比较浅的真理。</p><p>对于某部分人比较难于观行的法，对于另外一部分人就比较容易，差别在于意识的智慧不同，意根的智慧也不同。对于四大种子诸佛当然都会马上现量观察到，我们就不行，只能顺着理去思惟推断，起着熏习的作用。无始劫以来，众生在生死轮回当中，经历了无数生死苦，都是现量，可是众生却不能现量观察，感知不到，不会从中吸取什么经验教训，以至于生死轮回不断，苦受不绝。</p></div>"
},{
    "title": "第十一章 六识的心所法",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  六识的心所法</strong></p><p>一、六识的出生以及心所法</p><p>六根触六尘，生六识，六根和六尘合起来就是十二入。六根指胜义根，在后脑勺那里，五个胜义根再加上意根，就是六根，也叫作内六入。六尘就是内五尘，再加上一个法处所摄色，就是内六尘，也叫作外六入。内六入与外六入合起来叫作十二入。其中根与尘肯定是合在一起的，内五尘是出生在后脑胜义根里的，第八识变起的五个法处所摄色，都与意根相触。根尘在一起，才能相触，触之后意根抉择，第八识才能产生六识。</p><p>根尘相触，说明根尘肯定在一起，五个胜义根在后脑部位，内五尘在胜义根后脑那地方产生出来。根尘接触以后，意根抉择，第八识就会产生五识，同时法尘也在后脑胜义根处与意根相触，意识也会同时产生出来，与五识同时分别六尘，这叫作五俱意识。</p><p>六根触六尘，六识生出来以后，三者再和合相触，那就是六识再触六尘，就了别了六尘。这个根和尘一直在相触着，如果根和尘不相触，六识就要灭去。然后六识再触六尘，触了六尘以后，就有了领纳性，领受、接受了六尘。接受了六尘以后，六识就了别了六尘，执取了六尘，那就是想心所出来了。</p><p>了别六尘以后，六识就开始思量，思量不清楚，再重新作意，对六尘再生起作意。作意以后，又了别，又感受，这时候的感受就有了苦乐忧喜舍的受觉出来了。一开始的受是领纳、接受，接受了以后，就相当于把六尘取过来，然后才知道是什么六尘，这个接受代表取过来。再以后的受，就有情绪的色彩出来了，苦乐忧喜舍的感受就会生出来。</p><p>感受出来以后，如果感受不清楚，再取相了别，想心所还会生出来，想心所生出来，了别相以后，就开始思量。思量不清楚，重新再去触，触了以后，再了别，或者再去想，或者再接着感受，这样了别感受以后再思量，直到最后，把这件事情思量清楚，了别明白了，六识生了决定心，就开始要造作了。</p><p>六识了别的内容也要传递给意根，意根同时也会对六识了别的六尘境界，用五遍行心所法运行，出生一系列的心理活动。最后意根生起一个决定心，决定要如何如何造作的时候，第八识了别到，就根据意根的思量决定性，和祂的作意，配合着运行。因为第八识需要知道意根作意于什么，作意哪一方面的尘境，知道以后，第八识才能在那一尘境上现起六识。六识现起来以后，就开始造作身口意行了。</p><p>如果意根还思量不明白，就会接着触，接着作意，接着受，接着了别，最后再思量，再作决定。没作决定之前，这个五遍行心所，一直反反复复的运行，其顺序可能不是按照作意、触、受、想、思的顺序，也可能颠倒。有可能触在前，了别在后，也可能触在前，受在前，了别在受的后面。也许了别了以后，再有受，受和了别再不清楚，就再接前思量。再思量不明白，就再接着触，接着感受，接着了别。</p><p>哪个心所在前，那就不一定了，这里的顺序就打乱了。一开始是作意，作意肯定在种子位，在种子位时，对应着那个法尘，生起作意，然后识种子生出来，就在那法尘之处，意根就接触到法尘。作意哪个法尘，种子就生到哪个法尘上去，形成识心。和那个法尘相触，是先作意，后生种子，种子出来以后有识心了，才能触法尘。</p><p>触了以后就领纳，领纳以后就取相了别，了别之后就思量。思量不明白再接着触，触之后就有领受感受，或者这时候再去作意，然后再有了别性。再有触，再有了别性，这里后边的心所的顺序就会打乱，一开始的顺序就按照作意、触、受、想、思那个顺序，心所法运行就是这样的。</p><p>二、说起根尘识三法，当然就要涉及到六识的五个遍行心所法：触、作意、受、想、思。六识的触是三和合的，三和合是根尘识三者的相合，叫作触，三者缺一不可。六根六尘相触之后，就出生六识，六识去触六尘，与此同时六根仍然在连续地触六尘，并没有离开过六尘，因为内六尘就是在胜义根处出生，意根也一直在与法尘相触。这里所说的触，是指根尘相触的触，不包括第八识的触。意根和第八识的触只需要直接触相分就可以了，不需要有其他的根来引生。</p><p>意根的触，直接就触第八识变起的法尘；第八识的触就直接触根与境，就是触根身器界以及触业种。六识的触心所和第七识第八识的触心所有差别，六识的触心所必须有根来引生，不离六根才有触。受心所也是如此，受心所是六识触六根六尘以后所生起的受，这里的受不仅有领纳领受，之后还有情绪方面的感受，苦受、乐受、不苦不乐受。第八识的受就是单纯的领纳领受，不带一丝的情绪，没有苦乐受，只与舍受（不苦不乐受）相应。而意根也有三受，有苦乐受和不苦不乐受。比如意识告诉意根，不要生气，可是仍然气得要死；意识告诉意根不要激动，可是仍然激动得不得了；意识告诉意根不要太高兴了，可是仍然控制不住的手舞足蹈；意识告诉意根我应该原谅他的无知无理，可是意根仍然不肯照做。意根到底有没有情绪化？莫名其妙的哭笑，莫名其妙的发泄情绪，莫名其妙的就是意根的。</p><p>六识出生以后，作意心所和触心所到底是谁在前，谁在后，这并不一定。刚开始阶段，六识在种子位的时候，一定是作意在前，把识心引到所需要面对的境界上去以后，作意就完成了，识心产生出来就有触尘，六识才能触到境界，触到境界以后才能了别境界。这是最初的作意在前，触在后。触了以后，就有了受想思，思了以后，识心再接着触，触了以后可能再生起作意，再领受，再了别，再起思，再有感受。这样几个心所的次序可能就要颠倒，有可能是触在前，触了境界以后就把注意力引境界上，这就是作意了。</p><p>五遍行心所法的现行，有时候一开始是作意在前，等五遍行心所都运行起来以后；有时候触在前，先触然后再作意。六识触境界以后产生了受，就能领受领纳境界，然后再执取境界，这样就有了名言，有了想；有了名言和想之后，思心所就开始造作，于是就有了思惟、思量、考虑；有了思量以后，也可能生出苦乐舍三种受之一，这时就要作出初步的决择，身口意行就开始造作出来了。</p><p>身口意行造作出来以后，有可能再触；因为对境界不能完全决定，就要再触再领受，再了别再思，反反复复一直到能够完全理解，完全清楚了，作出最后抉择以后才告结束。这里面的程序相当的复杂，太细的就观行不到了。五个心所法，不一定都是按照固有的排列顺序去运行，也不一定要按五个程序都要轮番来过，有可能到受的地方就要从头再接着触，有可能到想的地方再接着触；有可能在思完了以后，暂时还不能决定，就要再去触，触了再作意；或者先作意再触，其顺序是不一定的，五个心所现起的次数和时间长短都不相同。</p><p>思心所的思，含有思量、造作、决定之义，这些心行都属于运转性，属于行；行可以叫作行蕴，也可以叫作行阴。为什么要叫作行阴呢？因为如果我们把这些的心行，这些的功能作用都当作是真实的，当作是我和我的，那就遮障了真实法的体性，遮障了妙明真心，那么就只见这些法的运行而不见第八识的本体功能性，所以把行也叫作行阴。为什么叫作行蕴呢？心识的运行是由各种缘所集起和蕴集的一种功能作用，所以又叫作行蕴，其实都是心所法，是六识心的一种功能。</p><p>思是一种行为造作，凡是有行为造作，有变化，能运转的，都叫作行。行阴的范围要比思心所的范围来得广泛，行阴还包括了色身上的运行功能，身心两方面的运行是完整的行阴范围。思心所的运行也很复杂，其作用为思量、权衡、抉择、造作，最后一个环节是决定造作。思心所有三个过程：包括思考、思惟、分析、判断，作出抉择，最后是采取实际的行动。前五识的思比较单纯，只决定趣境还是离境，第六识的思是最为复杂的，要反反复复的考量思惟，其智慧力比较强；前五识的思，要依着第六识的想和思才能运行。所以思的本身就是意行，意行造作出来以后，就有了身行和口行，这样五识也参与了其中。</p><p>受心所的受，是指六识本身的领纳和领受，领纳领受就是接受了境界，接受了境界以后再了别，了别之后，六识才有情绪化的苦受、乐受和不苦不乐受。带着情绪化的受出现之前的受，是领纳和接受境界的受。比如眼识触色尘以后，眼识领纳色尘并接受下来，接受下来之后就是了别和了知性的想，然后再生起执取性的想，因为有了知和执取才有了苦乐受。</p><p>如果不了知，就没有情绪化的苦乐受；如果不执取，也没有苦乐受的出现。所以受心所的范围要比五蕴当中的受蕴要广一些，受蕴是以情绪化的受为主，包括了苦、乐、不苦不乐等三种带情绪的受。如果是第七识和第八识的受心所，就与六识的受有些区别，八识只有舍受，没有苦乐受，也没有情绪化的色彩，八个识的五遍行心所法各有许多微细的差别。</p><p>三、五蕴或者叫作五阴，受想行识四蕴全部是六识的体性，受蕴是六识受的体性和作用，想蕴是六识想的功能作用，行蕴是六识行的功能作用，识蕴就是六识识别的功能作用。四蕴分别对应六识的受想行识四个心所法，六识触了六尘之后就有受心所，有想心所，有思心所。思心所，有动身发语的意思，有思惟造作的意思，有能现起身口意行的意思。</p><p>六识的五遍行心所法，是先作意，作意就是把注意力引到境界上来，意根第七识想分别什么法，六识就作意什么法，所以六识的作意是由意根来作主决定的。六识作意了以后，识种子出生，六识就现起，于是根尘识三者就相触，相触了以后最先是领纳。什么叫作领纳？领纳不是指感受苦、感受乐的感受，刚开始时还没有情绪化的感受，是先领纳境界，六识把六尘的境界领纳了，也就是先接受过来。接受了以后，想心所就开始了别，是先接触，尔后了别。</p><p>例如有人给你一个东西，你先把注意力转向那个东西上面，然后用手接触，之后再把这东西接受过来，拿到手里以后再仔细分别观察，观察之后就取相，对此物就有了决定心，于是就生起了觉受。再往后的受心所和想心所，谁在前谁在后就不好说了，它们两个是轮流出现的，五个心所法的次序就被打乱了。很多人同时了别同一个事物，其心所法的次序都不相同，这与各人的慧力、定力、业力和烦恼习气都有关系。</p><p>一般的情况是对境界领纳了以后才有想，有了别和取相的功能体性之后才能生出感受来；感受不清楚，就再接着触和想，再接着了知，了知之后生起抉择心，也就有各种感受。触、想和思所占用的时间越长，内心的感受就越多，心境的变化就越大；说明这是在不断的想，不断的受；不断的受，再不断的想；心里的情绪在波动着，内心也在不断地取着境界相，五个心所法来回不断的反复运行，五个心所法的前后顺序往往是被打乱的。比如思心所的运行，当想心所了别境界不清楚的时候，思的就不明白，思心所的决定性就不能生起，没有抉择力。这时就要回过头来再让触心所和想心所运行，了别清楚了以后，思心所才有了抉择力，才能作出最后的抉择，那么五遍行心所法在这个境界上的运行就告结束。</p><p>在想心所没有了别清楚的时候，就再接着了别和思，当思心所还不能作决定的时候，六识就要反复不断地思和想，再反复地了知；了知以后再感受，感受以后再了知，了知了以后又再思，没思明白就再作意。作意以后再接着触，或者再接着直接想，或者触了之后再想，想完再受，受完再思，思完了再受，前后次序都是不一定的。</p><p>五个心所法都运行出来以后，如果再作意，就是把六识的注意力集中到要了别的境界上，然后根尘识三者和合触。和合触了以后，最先是接受和领纳，然后再了知；了知清楚了，就有了感受。如果没有感受清楚，就再接着了知，可能要反反复复地作意、触和了知。六识都作了知和执取，待生出感受以后，才能决定下一步所应采取的相应行动，这就要先作思量、考虑、判断，之后再作出抉择，决定要采取哪些身口意行。这里要分为许多步骤，层层递进，层层深入，直至身行口行都造作出来。如果没思考明白，就需要再接着触，再接着作意，再接着想，再接着了知，直到最终了别清楚了为止。</p><p>在五个心所法一系列的运行过程当中，触心所是必须存在的，也就是说根尘识必须是和合在一起，不能分离，否则识离开了尘境，触就要消失，不能再存在和运行了，尘也不能离开根，否则就没有识的出生。再者，只有六识触六尘，才能接受和了别境界，触是前提条件。我们如果不想再了别，不想再感受，不想再有身口意行，那么识就不要再继续触尘，把六识的注意力移开，也不要再作意了，那就没有了后续的心行。这就是修定修心的最好方法，以此修行就能达到忘却尘境，不起念想或者少起念想，阿罗汉们即是如此。所以他们一般来说，没有情绪波动，少有感受，对境无心。</p><p>一般众生接触境界时，因为有贪爱，有愚痴，一旦接触了境界就不肯离开，长时间的了别和感受，长时间的思虑，内心不得清闲，思绪纷乱。有些人就是因为没有慧力，了知得不清楚，也思考不明白，就不能作出决定，因此就要连续不断地去触境界，翻来覆去的思来想去，辗转反侧，心绪不宁。因为想不明白，思量不明白，就抉择不了，所以就要不断地反复作意和触。</p><p>有些人接触一个境界需要很长的时间，思考一件事情也要思考很长的时间，一个是因为心有贪爱，一个是因为事情复杂，了别慧不足，一个是因为这件事情很重要，一定要了别思考清楚，然后再抉择。如果了知的不清楚，感受就不清楚，思考思量的也就跟着不清楚，这就要不断地作意，不断地触，不断地了别。其中作意和触，运行到后面，谁在前面运行，谁在后面运行就不一定了；受和想谁在前面运行，谁在后面运行也是不一定的，几个心所的前后顺序都是不一定的。</p><p>四、五遍行心所法运行的真实情况，可以用一个譬喻来说明。譬如有一个画师在画画，五遍行心所法可以比喻为画师，心所法所了别的六尘境界，就比如画师所画的山水画。画师要画画临摹时，先要看眼前所临摹的风景，当他抬头看眼前的风景的时候，就是作意于眼前的风景，他把眼识转移到风景上，相当于把注意力引到眼前的风景上面，然后引出下一步的触和取相的心行。画师看风景就是作意，作意之后就触了风景，触了风景之后就有受；这时的受，一般是领纳之义，是把六尘境界给领纳过来，并接受了境界。</p><p>这个时候还没有带情绪化，不含有苦乐忧喜舍等等情绪，也不认为眼前的山水很美，很壮观，也不会认为眼前风景很凄凉而生出内心感触来。因为还没有开始了别和取相，只是单纯的把境界接受过来。接受过来以后，再加以了别，了别就是想，他就能知道这是什么，这就取了相，取了境界。取了境界相之后，眼睛收回来心中忆持作想，把山水境界牢牢地记在心里，就决定要如何临摹了，这就相当于思心所的运行。山水境界记在心里以后，就在画板上开始描摹，描摹的这些动作就相当于思心所的造作，已经生起了身口意行。</p><p>画师临摹了一会儿，再往下就不知道如何画，因为心中的影像模糊了，就要再抬头看眼前的风景。这就是再作意了，再触风景，触了以后，他就又领纳领受，这时就有情绪化的感受，觉得眼前的山水是如此如此的秀丽和壮观，内心里面的诗情画意就出现了，这种感受在最开始描摹的时候可能就有。领受了境界以后他要再了别，了别以后再思考该如何描摹。思考了以后就开始再次描画，这一系列的行为造作的过程，就相当于作意、触、受、想、思五个心所法的反反复复的运行过程。</p><p>作意以后，就触了境界，触了境界之后就是受，受之后是了别，了别的不清楚就再触；他可能不用再作意，因为他一直都看着眼前风景，注意力并没有转移到别处去，他就再接着触，这时他可能也不用再另外去触，因为他一直在触境界，并没有离开过眼前的境界。触了境界以后再领受，这时也可能不用再领纳境界，因为他一直都在领受境界，就直接生起了想心所，反反复复地进行了别和思量。这一系列的行为在持续不断地造作，一直到把这幅山水画描摹完成为止，这就相当于六识已经完全了知，作出最后的抉择，此事就算结束，五遍行心所在这个境界上的运行就算完了，身口意行造作完毕，这幅画就临摹完了。</p><p>五遍行心所法可以比喻为画师，他总是在接触需要临摹的山水境界，作意那个境界，了别那个境界，思考那个境界，然后按照所了别到的境界开始临摹，六识的五遍行心所法也是类似于这样运行的。</p><p>五、六识的作意心所法是从什么时候开始作意的</p><p>意根攀缘如来藏变现出的法以后，觉得重要的法，意根就要作意，作意了以后就有了触受想三个心所，之后再生起思心所，如来藏了别了意根的思心所和作意心所以后，就主动配合意根，意根作意什么法，思量什么法，决定要了别什么法，第八识就在什么法上面生起六识。生出来的六识，一定是在意根的作意和思量的法尘上面，如果是意根不作意的法，六识就不能出生；所以六识的了别，都是由于意根的作意和思心所引发出来的，意根思量了以后，第八识就配合意根出生六识。</p><p>比如说意根作意在一朵花上，对这朵花触、受、想了之后，就生起思心所，第八识也同时了别到意根的思心所，就在后脑胜义根处的花的内色尘上，生起了眼识和意识。在眼识生起之前，眼识在种子位就趣向作意于内色尘花，种子位就是处于识种子阶段，识种子要出生之前，必须有一个出生的方向和处所，并朝着那个处所去出生。因为后脑胜义根处的六尘非常的多，到底要在哪个尘上出生眼识，出生六识，就在于意根作意在哪个法上；意根作意在花处，眼识种子就输出在花处，那么识种子在出生之前，就准备在后脑胜义根的花的内色尘上出生，这个准备就是作意。</p><p>眼识和意识在种子位要准备出生到那个花的处所了，首先是花的显色处所，在种子位里的眼识种子就准备要出生到花的显色上，就等于是作意在花的显色上，作意了以后，眼识种子就在花的显色上面输送出来，眼识随即就出生了，眼识出生之后，就是眼识的触、受、想、思四个心所的运作。同时后脑胜义根处还有花的形色、表色和无表色，它们是法尘，意识的识种子就准备在花的形色、表色、无表色处输送出来，意识种子就在花的法尘处输送出来，意识就奔向花的形色表色那个法尘上面去出生，于是意识就形成了，接下来就有了意识对花的触、受、想、思四个心所的运作。</p><p>眼识与意识出生以后，二识就触花儿，作意在种子位就已经出现，二识出生以后就开始触心所的运行。最开始时的作意一定是在种子位进行，触了花以后生起受心所、想心所和思心所；这样运行了以后，再作意，这时候的作意就不再是种子位的作意，而是眼识和意识本身运行当中的作意，经过再次的触、受、想、思，了别之后生起一个最后抉择，眼见花这件事就告结束，这是眼识与意识生起运作的顺序。</p><p>六、《成唯识论》中说，最初的六识作意心所，不是六识出生以后的作意；第七识也是如此，最初了别六尘时的作意，一定是在种子位时就最先开始作意的，在种子位作意以后，再把识种子出生出来形成了识，六识就开始现行出来。识种子的出生必须要有个方向和处所，要有个出生的目标，不能是漫无目标的随机出生，这样的话意根作意就没有用了，如果六识遇见什么法就了别什么法，那么众生的生活一定是混乱不堪的，什么事也做不成。如果在种子位不作意，不奔着某个法，识种子要生到哪里呢？识种子必须有个出生的方向和处所，这个方向处所必须在种子位就定下来，所以作意心所法就在种子位最先起作用。</p><p>意根第七识的作意心所法，最初也是在种子位就开始对六尘生起作意的，作意了以后就对六尘生起触、受、想、思心所的运行，意根决定要了别六尘，六识就跟着出生。第七识的识种子也要有出生的处所，不是随机遇到什么法，识种子就出生的，这样众生的心更是乱糟糟的一片，几乎就没有安宁日子可过了。</p><p>六识的识种子也要有出生的处所，在种子位如果不作意，识种子就要随机漫天的出生，六识就要乱套，众生就不知所措了。所以识种子必须要先有出生的处所，就在种子位先作意，然后种子再出生；出生以后，六识直接就触六尘，触心所是在识生出来以后运行的，如果六识不能生起最后的抉择心，就再对六尘生起作意；这时的作意就是六识现行以后的作意，而不是种子位的作意。</p><p>七、悔、睡眠、寻、伺四种不定心所，有时属于善心所，有时属于恶心所，要看具体情况，要看达成的结果，要看当时的状态和所指向的结果。如果是贪睡，则睡眠是恶心所，能引发心智昏沉和愚痴；如果睡眠能够调节精神状态，有利于修行，则属于善心所。</p><p>悔，如果一个人总是无智地懊悔自己的过去，后悔不该像从前那样作事，以至于心思烦乱，没有定力，不生智慧，悔就是恶心所；如果自己做了恶事，能够及时忏悔，决心后不再造，悔过之后，心得清净，定慧生起，则悔是善心所。</p><p>寻，如果意识心漫无目的地到处攀缘，以至于无有定力，心思散乱，寻则属于恶心所；如果意识心在思惟寻觅一个真理，比如是参究寻觅第八识，则属于善心所。伺，内心在伺察世俗法，心神不定，障碍正智的生起，则属于恶心所；如果为了明了一个佛法的真实义，有了目标，专一深细思惟，则属于善心所。</p><p>八、心所就是识的助伴，有识就有五遍行心所法。有的心所法，当六识生起来运行的时候，心所不一定要现前运行出来，那就不叫遍行心所法，可能是五别境心所法，或者是烦恼心所法，也可能是善心所法，这些心所法不是时时现前出现的。遍行的意思是有识就有这种心所，心所和识是伴随在一起不分的，就叫遍行心所。五遍行心所法和如来藏的遍是有区别的，如来藏的五个遍，是指如来藏本体遍一切时、地、处、界、法的运行，如来藏本体的运行也是有自己的五遍行心所法的伴随。</p><p>识都是以心所法的形式来运行的，心所法没有种子，不是种子生成的，只要某个识一现前，这个识就以心所法的形式运行。心所法是伴随着识运行的，是识的助伴。心所没有种子，第八识里不存心所法的种子，其祂几个识也不存着心所法的种子，心所法没有种子，就像无明也没有种子的道理一样，就像心不相应行法也没有种子的道理一样。</p><p>九、受蕴的受是六识心的心所法，是六识心的一种功能性，实际上是识触尘以后的感受，最初的领受领纳相，只是接受了六尘，还属于是一种粗相，发展到出现喜怒哀乐的感受时，才是细相。受蕴，不仅仅是识触尘的最初受，最初受是领纳接受，还没有苦乐受的生起，受蕴包括领纳受和后期的三种受。想，不但是了别，也有取相的作用，意识的想与名言相应。到想的时候也有粗相和细相，有粗略的了别和细微的了别和执取相。粗和细的了别之后，才有六识粗的感受和细的感受。</p><p>如来藏含藏的受的种子，并不外于识种子，识种子运行时，伴随着受心所法的运行，因此识心才有感受功能作用，并不是说在识种子以外，单独有一个受的种子。五遍行心所法没有种子，依附于识心才能运行，是识心的助伴。识种子出生，五遍行心所法同时就伴随运行，是识心的依附。所以受没有单独的种子，想也没有单独的种子，都是六识种子出生以后，识心运行起来，就有受心所和想心所伴随运行，五遍行心所法都如此，八个识都有各自的五遍行心所法。</p><p>五遍行心所法在识心的了别过程中，要反反复复的运行，不是运行一次就结束；运行起来以后，之间的次序要互换和颠倒，顺序是不一定的。所以六识的受不是运行一次二次就结束了，也许要运行无数次，想心所和思心所也如是，作意和触心所法运行的次数相对要少一些，六识可以一直作意六尘，一直触六尘而不动，受想思心所运行要反反复复，来来回回的运行，才能有最后一个最终的抉择，六识对六尘的了别才告结束。心所法的运行，特别细腻，到佛地才能完全观察出来。</p><p>十、意识心在凡夫位有五十一个心所法，贪嗔痴烦恼具足；在声闻三果位，意识的心所法就减少，没有了贪心所和嗔心所；在入地以后的转依位，意识的烦恼心所法还要减少，逐渐转变成善性的；到了佛地，意识的心所法有五遍行、五别境和十一个善心所法。所以修行，就是逐渐改变六七识心行的过程，六七识的心行和体性不是一成不变的。所以讲心，要说明这个是凡夫的心行，还是有禅定的人心行，还是贤人的心行，还是圣人的心行，还是佛的心行。</p><p>十一、五识的五别境心所法</p><p>前五识只有现量了别功能，没有比量，五遍行心所法一直都跟随五识运行，五别境心所有时也会现行及运作。前五识有定心所，如果五识没有定，眼识着多种境，耳识着多种境，鼻识着多种境，舌识着多种境，身识着多种境，意识一定也跟着着多种境，这样心岂不大乱？五识如果没有定，意识也不能定，意识必然随着五识处处了别，这样就容易心乱如麻。</p><p>现见五识可以各自定于一处二处不散乱，了别细微，说明五识可以有定，与定相应。如果六识没有定，说明意根是不定的，因为五识六识着境是由意根主导攀缘的结果，意根不想见境，六识就不能见境。所以说，如果意根没有定，与定不相应的话，就永远不能有禅定了，四禅八定也无法修出来，世人只能生活在欲界人间，天上就没有众生存在了。</p><p>五识有了别慧，能对五尘生起判别和确认，能对五尘有明确的了别和判别，因此五识有慧心所，五识慧强时，也是由五识的定心所引发出来的，由定生慧，就是此理；同理，意根的慧，大部分也是由定所引发出来的，尤其是断除烦恼，转识成智以后的智慧，更是意根的定心所引发出来的。既然能确认五尘究竟是什么，说明五识有胜解心所，能够明了和胜解五尘法的相貌。</p><p>五识对于五尘境界能趣境和避境的性质，说明五识有欲心所。比如，眼识遇到柔和的色彩，能主动趣向，遇到强烈刺眼的太阳光就自然躲避，这是眼识的欲心所。耳识遇到刺耳的声音极力躲避，而遇到柔和的轻音乐，心向往之。鼻识遇到刺鼻的气味有躲避之心，遇到温馨的香气就要趣境并生起贪爱。舌识遇到美味就会主动寻觅而趣境，遇到刺激味要极力躲避。身识遇到轻触和妙触趣境并会生起贪爱，对于违逆强烈痛苦的触，就要紧急避开。以上说明五识有微弱的欲心所，比意识的欲心所微弱得多，表现不明显，不容易观察出来。</p><p>五识对于曾习境，也有一定的念性，因此念性，就能有欲心所，并能生起贪爱，不欲离境，粘着境界不放。</p><p>五识具足五别境心所法，只是微弱，一般都表现为五俱意识的五别境，但是细分，还是能分辨出来。从总体上来说，五识的现行和运作还是由意根控制和决定的，这样五识的欲心所就显得更加的微弱和模糊了，被意根的操控所掩盖住了，很难发现。</p><p>十二、离开尘相，识无法现起，因此前七识的五十一个心所运作时，必定要缘于一定的尘相，前五识只能缘于五尘相分，属色法尘，六七二识所缘有色法尘，也有心法尘。</p><p>六识出生的条件之一是根尘相触，六尘是六识出生的必要条件。心所法的运作条件是，只要有识存在，心所法必伴随着识心运行，识就是以心所法的形式运行。但意根出生现行不灭的条件是要有三界的种子，有贪有欲有愿力。虽然意根无始劫以来就一直存在着，但是意根无始劫以来一直有贪嗔痴烦恼，有无明，所以一直不灭。</p><p>前五识所缘是色声香味触五色尘，不属于色法上的法尘。六七识所缘有色法尘就是五尘上的法尘，还有独影境，还有心法尘八个识和八个识的心所法，还有非色非心法尘，如心不相应行法，第七识也缘五尘境，与法尘境同时缘。</p><p>十三、五遍行心所法的运行开始是有一定的顺序的，但运行到一定阶段，其运行顺序要发生变化，不管如何变化，一定是以思心所结束。然后再在其他法上运行五遍行心所法。</p><p>而五别境心所法，没有固定的运行顺序，五个心所法也不一定都同时或者次序出现，也许出现一个，也许出现两个，这是不一定的。智慧越高的人，五别境心所法现行的越多越频繁和广泛。转识成智的菩萨，五别境心所法经常现行，活动频率很高。</p><p>众生越愚痴，五别境心所法越不容易出现和运行。降伏了烦恼，转识成智的地上菩萨，其意根五别境心所法很活跃，常常出现，意根的智慧和胜解力相当强。所以菩萨观察判断抉择，很多时候不仅依靠意识，还依靠意根，往往是不太用意识的表面思惟分析，用意根思量作用的时候比较多一些。</p><p>十四、五别境是否是在五遍行中的受心所之后运行的</p><p>遍行的意思是，只要有识心出现，五遍行心所法一定伴随着识心运行，识心可以没有其它心所法伴随，但一定要有五遍行心所法伴随。其真正含义是，比如两个人见面，叫作接触，之后才能了别和感受，最后有个抉择判断，如果不见面就不能了别对方，不能决定其他事情。见面之前是作意，趣向于某处，然后才能在某处见面。了别相当于了解对方，这有一个过程，时间长短不一定。眼睛见色也是有一个过程的，不能立刻就判断出是什么色。</p><p>五遍行心所运行时首先是按照次第而运行的，没有次第如何运行？如果没有次第，根尘识三者和合触之时，一切事当时就有了结果。可实际上大结果最终的结果，以及小结果分段结果，都是在触之后一段时间才出现的，并不是触了就有结果。结果就是抉择和后续的行为造作。</p><p>没有触，就没有后边的接纳领受，没有领受就没有了别，没有了别，就没有后边的感受，没有最后的抉择，也就没有后续的心行。五别境心所一般在识心的受心所之后，想心所之后，思心所之后，不一定具体是在哪个环节出现的。没有作意和触，也没有欲心所，没有想心所，也就没有胜解心所，也就没有念心所，没有慧心所。另一方面，没有欲心所，也可能不会去作意和触，也就没有五遍行心所。</p><p>定心所法在作意触受心所之后生起，然后就可以定在作意上，定在触上，定在受上，定在想上，之后才能出生智慧，有最终的思心所出现。但也有可能首先有定心所，定在一两个法上，再运行五遍行心所法，作意触受想思，也可能思心所之后才能有定心所的出现。</p><p>总体来说，五别境心所法不一定在五遍行心所法的哪个环节上出现和运行。因为五遍形心所法是不断的循环往复运行着的，不会只停留在某个环节上，如果停留在某个环节上，那就是定在哪里了，识心就有定了。</p><p>定力不足，智慧不足，心不是非常细致 确实不容易观察心所法的运行。不管哪个识的心所法，都属于唯识种智范畴。</p><p>十五、五十一心所中，善心所，烦恼心所等，不但与意识相应，也与意根相应，意识所缘的法尘有色法尘，有心法尘，同时也有非色非心法尘二十四个心不相应行法。</p><p>色法尘与色有关，色是四大种子形成的，与四大种子有关的属于色法尘。与识种子有关的、与八个识有关的、与心所法有关的属于心法尘，除此就是非色非心法尘。意识缘自己的贪嗔痴烦恼等等心法尘时，属于意识的反观作用，是意识的证自证分。意识观察其他识的心所法的时候，属于见分和自证分，所缘的都是心法尘。</p><p>十六、问：害怕的心常常出现，害怕是一种心所吗？为什么百法中没有害怕这个心所？内心害怕，是意识害怕还是意根害怕？有些害怕莫名其妙的，没有原因，是不是意根在害怕？</p><p>答：害怕这个心行在五十一个心所法里找不到，因为众生的心所法种类繁多，五十一个心所法只是归纳出一个大概，没有把所有的心所法，尤其是非常微细的心所法都包括进去，如果都包括进去有几百个也不止。《大乘百法名门论》里心所有法并不全，还有千法名门、万法名门、亿法名门，百法明门之外还有极多的法没有包括进去，所以害怕也是心所法，只不过百法名门没有总结出来，归纳进去。所以我们学佛修行，不应该教条的认为自己目前所接触的法一定是究竟的、不可更改和变通的。</p><p>想到了害怕的人和事，首先是意根想到了，想不明白的时候或者是想要造作什么的时候，才让意识细细的想，并且有所反应。害怕分为两种层次，浅层次的害怕是意识心的怕，并不涉及到根本，不会造成身心上的影响和后果；而深层次的害怕，是意根的害怕，严重的叫作恐惧，内心波动较大，在身体有不同程度的反应，引起气息、血液和神经传导上的变化，进而促使肢体和内脏器官出现病变。在睡着以后如果意根感觉到周围环境出现变故，心里害怕恐惧，就会促使六识醒过来，去了解清楚到底有什么令人害怕的事情出现。做噩梦的时候，意根非常害怕，就会让意识醒过来，不再处于噩梦之中。</p><p>意识的害怕和意根的害怕有区别，意识的害怕不会促成身体出现各种状况，意根害怕就会有身体的症状，比如身体发抖、脸色难看，心脏紧缩震动、血液流动加快等等；意根害怕在情绪上也有反应，比如神情紧张、内心焦虑等等。这些症状说明是意根害怕了，只有意识害怕不是真怕，不会造成身体上的反应。意根能控制传导神经指挥全身的运作，所以意根心行一动，全身都跟着起反应，意识心动却动不了全身，因为全身神经传导作用是意根指挥的，不是由意识指挥的。</p><p>如果害怕是莫名其妙的，意识心觉得自己害怕了，还不知道害怕了什么，琢磨来琢磨去我怕了什么呢？不知道怕什么还是害怕，那么就是意根的害怕，意根的害怕跟意识说不明白，意识不了解，但就知道害怕。那就是意根的害怕，内心深处的害怕，就是意根的害怕。</p><p>十七、识心的四分与五遍行心所法的关系</p><p>识心的四分是见分、相分、自证分、证自证分。如果识心所见的相分也是识心的话，这四分都要依靠心所法才能运作，才有见的功能作用，才叫作见分，才能见法，才能见自身。其中心所法以五遍行心所法为主，时刻刹那都不离五遍行心所法的运作，没有五遍行心所法，识心就无法运行，也就没有四分。</p><p>五遍行心所法运作起来的时候，识心就能触法、受法、识别法、运行法，于是见分、相分、自证分和证自证分才显现出来。四分显现的同时，可以体现出五别境心所法，表现出善、恶、不善不恶的心性，也就是说四分出现的时候，要带着其它心所法一起出现，体现出识心的强弱势力和善恶心行，以及是否有定慧等等。</p></div>"
},{
    "title": "第十二章 六识的自证分和证自证分",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  六识的自证分和证自证分</strong></p><p>一、意识知道自己当下所处的状态，就是反观，是证自证分的功能作用。不知道自己当下所处的状态时，就说明意识的反观力弱，心思粗燥，智慧低劣，就没有定力。有好多人烦恼显现出来时，还不知道自己有烦恼；自己无知的时候，也不知道自己无知，这样的意识心根本不觉悟，没有反观力，智慧太差。能够念念自知，时时自觉，这就是意识的证自证分；知是自证分；自知，自己知道，就是证自证分。证自证分里有两个知，自证分里有一个知。</p><p>意识知道自己所处的状态，能够了解自己，认识自己，就是证自证分，也叫作自我觉知，也就是自知，也就是对了知的了知。人难得有自知之明，证自证分就是明，就是慧，这样的人有理智，有定力，容易化导。</p><p>所谓的自证分，就是亲自了知了相分，证得了相分，知道了相分。有个知，不管知什么，都是自证分。相分起时，就是知道有相分，知就是见分，有见分有相分，知道了就是自证分。比如：看，是见分，因为还没有结果，而看见是自证分，看见之中有见分和相分；听，是见分，还没有结果，听见是自证分，有见分和相分。以此类推，带有结果的，就是自证分；还没有结果的，就是见分。反观自己的，监视自己一切行为造作的，是证自证分。心有警觉的人就是证自证分现前，没有警觉，就不一定有证自证分。</p><p>眼识的证自证分，比如眼识看见阳光时，觉得阳光太亮，太刺眼睛，眼识马上就闭眼不看，一会儿意根贪太阳或者是什么原因，决定要看阳光，眼识就不得已缓缓地睁开眼睛，为什么是这样呢？眼识的见分、相分和自证分已经出现了，哪个是证自证分？后续要如何发展？眼识不得已再去看阳光，缓缓地睁开眼睛，就说明眼识知道了阳光刺眼，可能还没有缓过劲儿来，就不愿意睁开眼睛看，眼识知道了刚才看阳光时的苦受，就是证自证分。眼识因为有苦受，才不愿意再看太阳，但是眼识也得服从意根的命令，就得缓缓地睁开眼睛。</p><p>当然看太阳的过程当中也有意识的证自证分，眼识的证自证分离不开意识，否则五识就不能现起。意识不了知自己的感受，就没有证自证分，如果意识能了别到意识自己的感受，意识就有了证自证分。眼识知道自己的感受，就是眼识的证自证分，意识这时不一定有证自证分。关键是眼识对自己的感受要如何区别和了别到，就看意识有没有智慧了。</p><p>眼识的苦受一般有眼识的知，也有意识的知，意识能知道眼识的不舒服；但意识的苦受，只有意识能知，眼识不能知。五识和六识的知与觉受也是有区别的；比如感觉疼，身识感觉的疼是肉体本身的疼，意识感觉的疼是内心的一种苦受。有时身识感觉很疼痛，但意识并不觉得难过，有人还很快乐，头悬梁锥刺股就是这样的情形，自虐狂也是这种的情形。</p><p>二、六个识的体性功能，就是了别和分别，所谓的了别分别，就是知，只要有知，就有六识的存在。这个知，有时感觉非常明显，我们自己都能感知到，有时的感觉就不很明显，我们也不知道自己是在知。自己知道心里有个知的时候，就是意识的证自证分，这个知有时是内心的声音语言文字，有时是没有心声，没有语言，没有文字。</p><p>这个知有时有念头，有时没有念头，不管有没有念头，都是意识的知。没有念头的知，是在有一点定力的情况下，或其它特殊情况下才能出现的，比如受到惊吓或者极度心喜，或者悲哀，或者入定，这时的心里并不是一无所知。只要有个知，知道自己没有念头了，知道自己心静了，这个知就是意识心的自知。</p><p>如果还能清楚知道五尘境界，这里就有五识的知。当然也不离开第八识和第七识的知。当意识心能够反观自己的时候，能观察到自己有知或者是知道了什么，知道自己的心理状况，这就是意识的证自证分。当我们智慧不足，定力也不足时，这种反观能力就很弱，不能完全真正地了知自己的心态，也不能检查出自己的贪嗔痴烦恼，因此烦恼性障就不能得到主动的降伏，修行就很难进步。</p><p>三、人的思想，是意识心通过分别、分析、判断、思惟、推理、比较等等心理活动而形成的观念和见解。意识心的体性有粗有细，细的时候，我们自己很难发现，有很多时候意识心刹那刹那都在起作用，都在了知，除非意识已灭去时，才不起作用，没有了别性。其余时间，只要有意识存在就有意识在分别法尘，但是我们自己却反观不出来。为什么反观不出来？因为智慧不足，定力也不具足的缘故。</p><p>当反观不出来意识在分别法尘时，有的人就说自己已经达到无心状态，或者说自己无念了；还有的人说，他证得了无妄想又无念头的真心，但是这个误会就太大了。这是明显的真妄不分，《心经》根本就没有看懂。心经讲真心不生不灭，而他却把意识由有妄念的变成无妄念的状态当成是真心；这种所谓的真心就是生灭法，有妄念时真心不存在，无妄念时真心又出现了，这完全不是佛说的真心。</p><p>四、意不随迁，心无所住时，这是意识有了定力，不住法。意识能了别定境法尘，知道自己不随境界转，知道自己不在意色声香味触法了，这个知道的知，就是意识的知，这是意识的反观性，是意识证自证分的现起。知道自己已经心无所住，这个知一定是意识心，心无所住是法尘境界；这个境界与意根和意识相应，是意识了别的内容，不与第八识相应，但也不离第八识而有。</p><p>真正的心无所住，不住六尘境界的心是第八识。因为第八识不与六尘相对，不住六尘也不了别六尘为何物。七个识只要存在，就必定与六尘相应，必定要了别六尘，肯定是住在六尘中。即使意识心非常的微弱，也能知定境法尘，所以只要有知，就有意识心。一般人只能与意识相应，不能相应到第八识，因为福德、禅定、般若智慧等种种菩萨条件都不具备故，所以就不能找到第八识，也没办法观察第八识的无所住的运行状态。</p><p>五、意识思惟观察的重要作用</p><p>从隔阴之谜、醉酒、梦游和催眠的现象，看意识的作用究竟有多大？讲意根的体性，有些人就把一切都归于意根，而忽略了意识。现在就要思惟意识的作用，这是断我见最重要的一个环节。</p><p>这个问题的思路应该是这样：思惟分析隔阴之谜的种种现象，找出都有哪些现象，然后从这些现象当中观察意识的作用有哪些，有什么特点，有多重要，这叫作意识的反观，也叫作证自证分。</p><p>再依次思惟分析醉酒之后的现象都有哪些，从这些现象上观察意识的作用和特点以及重要性；思惟分析梦游以及醒过来之后都有哪些现象，从这些现象当中观察意识的作用特点以及对领悟六尘的重要性；思惟分析催眠以及催眠之后都有哪些现象发生，观察这些现象当中意识的作用特点，以及意识对六尘分别的重要性。</p><p>以上思路是授人以渔，而不是单纯的授人以鱼。掌握了渔的要领，会使用渔，以后就能自力更生了。</p><p>要学会观察，会寻找和分析现象，观察力非常重要，这是以意识的智慧为主，里面也有意根的智慧。只有意识的智慧先具足了，意根才能提升智慧具足智慧。意识的智慧在先，意根的智慧在后。意根具足了智慧，后世时，意根的智慧在先，意识的智慧就在后。然后意识以此类推，又出生其它的智慧，再带动意根，让意根也具足其它智慧。生生世世就是这样一步步一点点的转变了六七识，最后转识成智。</p><p>很多人连意识的智慧都没有，无数事实真相摆在面前都视而不见，无觉无知，非常愚痴。很明显很明白的现象都看不明白，理不出头绪，甚至被人告知了一遍又一遍，仍然不知所云。如果意识的思惟力都没有，观察分析能力都没有，那就谈不到具足智慧了，更谈不到熏染带动意根也同样具足智慧，愚痴无明不破，解脱就一点希望也没有。</p><p>六、问：在静下心来仔细体会的时候，能清楚体会到有一个清清明明的我存在，那个“我”是什么？知道那个“我”的知道又是什么？</p><p>答：体会到一个清清明明的我，这个我就是最容易被观察体会到的意识的各种功能作用，如这个我在体会，在观察，在分析，在思考，在判断，在觉受，在感知，在抉择，在思想，在推理，在寻求等等这些受阴想阴行阴识阴的功能作用。而知道这个我的各种功能作用的知，就是意识的反观作用的知，是意识心的证自证分。</p><p>其中在这一切法的运作过程中，在意识的各种知当中，都有意根的知和第八识的知，都有意根和第八识的功能作用。当意识知的时候，必有意根的知相伴随，也必有第八识的知相伴随。缺少意根的知，意识必灭亡不存在，也不能生起，没有第八识的知，意识的知也必然不存在，必然不生起，必然灭亡消失。</p><p>七、问：在平时念佛的时候，除了知道佛号以外，还有一个知道念佛的那一知，那一知是什么？在体会佛说什么是“声”，什么是“闻”的时候，能清楚地体会到什么是能闻的“闻”，可是还有一个知道“闻”的“知”，这个“知”是什么？</p><p>答：知道佛号以及念佛声音，是意识心的知，也有耳识的知。念佛是意识心念佛，而知道自己在念佛的知，还是意识的知，是意识的反观作用，是意识的证自证分功能作用。能闻声的闻，以意识的闻性为主，辅助有耳识的闻性，能知闻声的知是意识的知，是意识的反观作用，是意识的证自证分功能作用。</p><p>当然在闻声时，有四个识心，不仅仅有意识和耳识，还有第七识和第八识，一切的闻性，以第八识为主，但是表面上都是意识和耳识的闻，第八识的闻性非常隐秘难知，意根第七识的闻性也同样隐秘难知，一般人观察不到这两种闻性，能比较容易观察到意识的闻性。</p></div>"
},{
    "title": "第十三章 意识与第七识的区别",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章  意识与第七识的区别</strong></p><p>一、第六识与第七识的区别是：第七识是作决定作主宰的识心，也是意识赖以出生的所依根，每时每刻都在主宰指挥身口意行的就是第七识。有很多的习气与惯性的就是意根，按照惯性去作决定的就是意根。有时突然出现了一件事，心里没有任何的思想准备，意识心也来不及分析与思惟，意根就按照惯性作出决定要如何处理。应付事情的时候，来不及思考就要决定作的就是意根；而翻来覆去思考的，就是我们的意识。不经过思考就仓促决定去作的，事后往往要后悔，因为事情过后意识重新思惟时就想，那件事情不应该那样做。所以意根是按照习气惯性去作主的识心，意识心是理性思惟的识心。这两个识心有本质的区别，不能混同为一个识心。</p><p>二、对于某一种法的内容，由于学习的时间短，接触的内容量少，就不能达到质的飞跃。所学的法义在最初时，不容易想起来，不容易融会贯通，因为最初的学习是以意识为主，没有得到要领的时候，意识基本上是复述背诵式的，没有达到意根那里。而复述背诵的内容容易忘记，毕竟没有证得的时候法还不是自己的。只有意根理解了以后，才不容易忘记，随时随地就能想起来，张口就能说出来。所以真正理解和证得的东西，用不着记忆背诵，用到的时候，理马上就通，就能讲得出来。背诵复述的东西，再现出来，需要一段时间，不能马上呈现出来，需要回忆回忆，回忆的也不一定周全。</p><p>三、人的意识发动过程，实际上是通过“动念”进行测量，然后产生念头。</p><p>动念，一定是意根先动念，然后意识的念头才出来。没有意根的念，就没有意识的念。参话头里，最终是把意根拴在话头上，念念不忘，朝斯慕斯，最后才能破参。念头有具体的内容，就是意识的念，意识的念还没有出生没有具体内容时，完全是意根的念，即使意识在有念头时，也有意根的作意触受想思，也有意根的念头，如果没有，意识马上消失不见，意识不能单独有念。根尘相触，识现行，根一旦不触尘，识立时消失。</p><p>四、第八识、第七识和第六识，三个识都有知，只是知的对象和内容各不相同。详细的境界知，一定是意识的知。第八识知意根的心行和心愿，第七识知意识了别的信息和抉择，第八识和第七识都知根身，第八识知种子和业缘。</p><p>意识也有思心所，对某人某事的了别之后，也要抉择，抉择就是肯定和否定，给与判断，又产生后来的念想。意根的思心所，是对下一刹那六识应该作什么而作主作决定。意根的抉择，有如来藏的配合，六识一定要采取行动。意识心的抉择，不一定能采取行动，必须有意根的批准，意根决定，才能采取行动，还是意根的思心所抉择的作用。知自己有没有念头，是意识心的反观力，是意识的知。意根不会分析，意根了别的内容和抉择，意识不知时，叫作莫名其妙。</p><p>紧急情况，意识了别一下，来不及分析，就影响不了意根，意根就凭借过去的经验而作抉择，意识只是把了别的信息快速传达给意根而已。</p><p>意根没有断我执，就不能消失灭亡。指挥身体活动，是意根的功能，意识是想指挥身体，可是得要经过意根的同意并且作抉择，六识才能造作；六识一动，身口意行就出现了。六识不出生不活动，身口意就不现行出来。</p><p>五、意识是否有俱生的人我执</p><p>意识有没有俱生的人我执呢？如果第六识也像第七识一样在五蕴刚刚出生时就有与前世同样的认知，祂当然也会有与前世一样的执著性，叫作俱生人我执。意识如果生来就有俱生人我执，不用后天教导和熏习，那祂首先一定要知道有个五蕴，并且知道是我，一定要知道有个十八界，并且知道是我。</p><p>但是意识在刚刚出生时不用教导就知道有五蕴吗？意识生来不用教导和学习就知道有十八界吗？祂认识五蕴色受想行识的功能作用吗？认识十八界六根六尘和六识的功能作用吗？能分清自己与他人的区别吗？有自己与他人的概念吗？有我相人相众生相寿者相吗？刚出生的意识显然都没有。如果意识有五蕴十八界所有法的认知，就有人我执；如果没有这些法的认知，意识就没有人我执，也没有想执的心行，因为没有 概念和认知，即使想执也没有能力去执。        </p><p>如果意识生来就有这些认知，那父母和亲人就省力了，不用教孩子这是父母，那是兄弟姐妹，这是男那是女，这是我的东西，那是你的东西等等，孩子睁开眼睛就知道每个人的不同，知道自己与每个人的关系，哪些物品属于自己的，哪些物品属于别人的，于是就会执著自己以及所有物，执著自己的生存环境；父母也不用教孩子这是饭那是水，这是衣褥那是床，这是黑那是白，这是好那是坏，这是灯那是鞋等等，因为这些孩子的意识都知道，孩子生来就会贪执和挑剔这些；乃至于世间一切生活上的知识父母都不用教，孩子的意识生来就会，并且生来就对这些生活资具有执著性和挑剔性，生来就知道护持着自己所有的一切，不让人碰和拿走。</p><p>可事实上意识在五蕴刚刚出生时一无所知，不知道有五蕴，不知道有自己，不分怨与亲，没有名言和任何概念，没有辨别善恶是非能力，不会懂得自我保护，也不懂得护着自己的所有物，什么都不懂，任何事都必须依靠父母大人等等耐心教导和灌输，否则就永远一无所知。</p><p>譬如意识要执著父母，首先要认识父母，知道有父母，也知道父母的重要性，然后才能执著父母；譬如意识要执著金银珠宝，首先意识要认识金银珠宝，懂得金银珠宝的价值，才能执著金银珠宝，如果不认识金银珠宝，给他金银珠宝也许要咬坏，不会戴在身上或者收藏起来；譬如意识要执著美丽的风景和威尼斯水上乐园，首先要认识风景了解风景和乐园，懂得欣赏，然后才能谈得到执著与否。</p><p>譬如有人拿刀杖要伤害自己，意识要执著自己的生命，躲避刀杖，首先就要知道有生命和生命的重要性，知道刀杖的危险性，才能为保护自己的生命而躲避刀杖；如果意识不知道有危险，不知道害怕，就不知道保护自己，任何危险到来，都是懵无所知；譬如意识要执著蛋糕等饮食，首先要认识蛋糕，了解蛋糕的香甜，然后才能执著蛋糕，否则父母把蛋糕给狗吃，意识也不会有任何反应，不会有一丝执著和贪爱。因为刚出生时意识一无所知，父母把婴儿送与他人或者丢弃或者变卖，婴儿一点反应也不会有，因为意识不懂不知，就不会执著自己和父母家庭等等。既然婴儿对于五蕴十八界一无所知，就不会有喜厌和贪爱执著，那么意识在五蕴刚出生时就没有俱生的人我执，不懂才不执。</p><p>这些法都需要婴儿的意识在后续的生活中一点一点的学习，在后天的环境中一点一点的熏陶。直到孩子渐渐长大，意识的贪执性才一点一点的出现，才会护着自己的饮食衣服玩具等等，其他复杂一些的事物比如权利地位名誉等等还是不知道，因此无法贪执。其天生的贪性和自私是意根熏染的，意识的所有行为都是受意根指使和支配的，意识并没有什么思惟分析能力，直到生长到一定时候，受环境的熏染和意根的不断熏染，才能逐渐的有思惟分析能力，才知道去贪执一些事物。</p><p>意识都不分东西南北，不知善恶是非好坏，那还有什么可执的呢？刚刚出生的婴儿，没有我的概念和理念，没有思想，一无所有，极其简单的五蕴活动完全受意根指使和支配，心理的思惟活动没有，那祂要如何执呢？执，必须有一定的思惟活动，有一定的思想，有一定的认知，才能起执心，否则就没有执的能力和条件。</p><p>六、意识是否有俱生的法我执</p><p>法执的内容比我执的内容更加的广大，涵义更加的深细难懂，意识刚刚出生什么法也不认识，就无法执著。譬如意识要执著财色名食睡，首先要认识财色名食睡及其重要性，才能生起执著，才有能力去执著，如果意识不知财色名食睡为何物，那就没有执著的心行，谈不到执著与否；譬如意识要执著权势和地位，执著富裕的生活，首先要了解权势地位是什么和如何重要，其意义是什么，懂得享受生活，然后才能执著这些法，以及生起贪爱的心行，如果对这些法茫无所知，那就无法也无能力执著，也谈不到执著与不执著。因此说初生的意识没有法我执，不懂得执著，意识没有俱生的与生俱来的任何执著，包括人我执和法我执。</p><p>七、睡着时，因为意根觉得被子重，就自动翻身，但是意识当时不一定知道，这时有没有身识和意识呢？翻身也是识的功能作用。根，本身是被动的接收器和传输器，如果没有识在根上的作用，根就是木头石头。意根想翻身，一定要调动身识和意识，两个识生出来就能让身体翻动，翻身时就有微弱的身识和意识。</p><p>意根为什么作主翻身呢？因为了别到被子重，意根与被子法尘相触，知道对身体有影响，就让身识和意识出来了别，身识和意识觉得沉重，意根就决定翻身，于是身识和意识共同翻身。如果翻身的次数多一点，睡眠就不好，第二天就感觉身体疲惫，因为六识总出现，身体没有休息好。如果睡着翻身不是六识的作用，那么在昏迷时，意根想挪动身体，就应该能挪动得了，可是昏迷时，身体是不能动的，尽管意根总想让身体活动起来，让自己清醒过来，但是做不到。</p><p>在半夜翻身时，由于身体疲乏，意识心弱，不一定能反观到自己的行为造作，意识心强弱的程度不同，反观力也不同。所以有人知道自己半夜是什么状态，做了什么，有的人却不知道，不知道的时候，意识现行的少，睡眠就深沉，睡眠质量就好，但是也有意识快速而微弱的了别，意识微弱时，几乎感觉不到意识自己的存在和运行。这时意根的作用突出明显，意根直接了别的内容，很多时候意识心不一定知道，意根又没有名言，无法表达出来。</p><p>意根默容一切法，而意识不是这样，那么意根了别的内容要永远多于意识，比意识深细得多，所以意根的法比意识深细而重要，成佛与否，全在于意根。意根运作的本身不能说简单和复杂，因为意根对六尘的了别慧差，意根对自己触法尘、了别法尘的运作不太能作反观分析，如果法尘太重要，自己想了别却又了别不清楚时，才唤起意识出来了别。</p><p>八、问：五根与五尘始终是相触的，法尔如是，不管意根作意与否吗？只要相触，第八识就无条件出生五识？意根是只作意法尘，还是在六尘上都作意？</p><p>答：五根的浮尘根时时与五尘相触，如来藏时时依五浮尘根传导和变现五尘到胜义根中，出生内五尘和法尘。那么内五尘和法尘就时时出现在后脑胜义根中，五尘和五胜义根也是时时相触的，可是五识并不能时时都出生，在很多时候都没有五识来了别内五尘，我们并不知道五尘境界。那就是说，五识的出生是有条件的，有什么条件呢？眼识的出生有九个条件，耳识的出生有八个条件，鼻识的出生有七个条件，舌识的出生有七个条件，身识的出生有七个条件。五识如果出生，五俱意识必出生，五识与意识和合了别五尘（包括法尘）。</p><p>那么六识有时出现，有时不出现，出现的最重要的前提条件肯定是意根作意，如果意根不作意，意识肯定不能出现，那么五识当然也就不能出现。意根作意就显得很关键了，意根肯定是要作意法尘的，这样意识才能出生，可是意根是否作意内五尘呢？如果意根不作意内五尘，如来藏就不会随顺配合出生五识，这样意识也不会出生。</p><p>有的人就会问了：打坐修定时，或者平时根本不想了别五尘六尘，为什么还有六识出来了别六尘，想躲也躲不开呢？这是因为意根的攀缘性太重了，习性难改，意识对祂的牵制力也不够强，这时意识是无奈的。当把意根驯伏了以后，祂的攀缘性减弱，六识才能定，不想了别的内容就不再出现了，能够专心致志，达到专注思惟，或者灭除觉观。</p><p>依此推论，六识的出生，六识了别色声香味触法，必然有意根作意和思心所的运行，六识才能出生，否则不可能有六识以及六识的了别活动。六识都是听从意根指挥，由意根决定了别何种境界，意根不决定了别，意根不想知道的，必没有六识去了别，没有六识不服从意根的意旨和决定的，这是绝对不可能出现的事情。因此总结起来说，五浮尘根与五尘相触，不必意根作意，五识六识对五尘六尘的了别，一定有意根的作意。</p><p>九、问：俗话说，一心不能二用，指的是意识，意识不能同时思考或进行两件事。但是意根遍缘一切法，或者是一个法尚未攀缘完，又攀缘另一个法，因为间隔时间为刹那，时间太短，也可以理解为同时攀缘多法，在这其中是否就是区分意识和意根的好时机？</p><p>答：世俗法里讲的一心不能二用，意思是一心如果是二用多用，用的就不好，精力分散，心就粗燥，了别不细致不清楚，思惟不清楚，不能出智慧。实际上意识六识是可以二用和三用的，因为普通人的定力很差，慧力也很差，精力稍微分散，对六尘境界就了别不清楚，考虑问题就不细致不周密，表现为粗枝大叶、马马虎虎、稀里糊涂、不知所以然，智慧比较低劣。</p><p>意识心没有训练时，要想思量考虑好某个事情，必须专一思惟，否则就考虑不清楚。当意识有训练定力好时，可以一心多用，同时缘几个法，也都能做得好。比如世俗法中所说的眼观六路耳听八方就是这样，只是不能太细思惟，在总体上都能安排好。比如说有的人在大事临头时，往往表现很镇静，此时所有的精力能力都调动发挥了出来，各种事情考虑安排得很周密，大脑高度旋转，工作速度惊人。世俗人做工作时有时也是这样，各人的精力能力大不相同，定慧都有区别。</p><p>意根同时能攀缘多个法，并且也能刹那连续、相继不断的攀缘多个法。如果祂要攀缘六尘上的法，意识必然随之了别，所以意识也是能攀缘多个法的。区别意识和意根，还是要在作主性上、作决定上区分比较容易、在习气、惯性、作用上容易区分，在突然间发生事情时，容易区别意识和意根的作用，在浅层次的心理作用和深层次的心理作用上比较容易区分意识和意根。</p><p>十、六识通过意根把种子存在第八识里，一切法都通过意根，意根是联系六识和第八识的中转站和纽带，一切法意根都默容。意根是六识染净的依靠依止，意根染污，就会指挥六识造作染污业；意根清净，就指挥六识造作清净业。另一方面，六识分别和造作的所有内容都作为信息传递给意根，意根才能了别、思量和作主，这同时就将信息落到第八识里，作为种子存下了。意根本身的一切活动也都落到第八识里，作为种子存下了。那么学佛法，最初和最后的下手之处我们就应该明白了。</p><p>只有懂了如来藏法，才能通经论；要想懂如来藏法，就要证得如来藏；要想证得如来藏，就要参禅；要想参禅，就要修六度波罗蜜。如果我们开悟的条件都具足了，那么一个月当中所听闻的佛法，足以让我们开悟很多次了，断我见，也断很多次了。</p><p>十一、问：能不能这样理解，我们绝大多数情况下，使用表义名言思惟各种问题，包括世间法和出世间法，这时意根虽然参与了，但参与得很浅。如果没有经过训练，意识很难用显境名言来思维。通过训练，如修定具有了一定的定力后，就可以不用表义名言，而直接用显境名言来思维。这时候意识和意根共同参与了，且意根能更深地参与。以上说法是否正确？</p><p>答：显境名言的意思是，七识心与心所法，能够共同的把各种境界烘托显现出来，让他人理解和明了。七识心都有这个功能，不仅仅是意根有这个功能。表义名言，用字、词、句把内心的思想和境界表达出来，以让他人理解和明了。这是意识所具有的功能作用，意根没有，五识也没有。</p><p>表义名言，分为语言文字和觉观思惟，觉观思惟也是意识的特性，意识能明了六尘境界，之后就能对六尘境界起觉观，起思惟。意根没有这种表面的功能作用，祂所起的作用是隐蔽的、深邃的、暗暗的、难以觉察的，其作用相当大。如果两个识的识种子少于分流，少于分别其他法尘，那么了别慧就能更加强大，其作用力就相当大，能攻克一切法。当定力增强时，六七识的显境名言作用突出，意根的作用突出出来，得到充分的利用和发挥，其了别功能就会更加强大，对一切法可能都能思惟透彻，智慧涌发。</p><p>十二、问：我们心里有个“知”是不变的观者，是不是意根？与梦中的“知”一样吗？为什么睡着就没有了，保持这个明觉的“知”就是正知吗？</p><p>答：心里这个知，是变化无常的，很多情况下，就不能知了，因此是生灭无常的意识的知性。梦里也有这个知，也是意识的知。但是一切法上同时也有意根的知，只是意根隐藏的非常深，很难发现祂的知性。</p><p>保持这个知性，明了六尘性，属于修定方法，不是见道。如果不是明心境界里意识的知，落在五阴当中的知就不是正知，因为不知第八识，不知第八识的运作，只知生灭法，不知不生灭法，这是意识的不正知。真正的正知是第八识的知性，如来藏的知性，不落于五阴、十二处、十八界上，祂没有漏，没有无明，没有生灭无常变异性，这是真正的正，彻底而究竟的正，不用出生，永远也不灭。</p></div>"
},{
    "title": "第十四章 如何观行断除意识的我见",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章  如何观行断除意识的我见</strong></p><p>一、意识的生起缘由，是因为意根触法尘，第八识在根尘相触之处产生了意识，根尘识三者再和合触，意识就开始了别法尘，于是就有分别心的现起，分别作用就这样产生了。六识当中，意识的活动范围非常的广泛，凡是我们没有昏厥时的清醒状态，没有真正睡着时的清醒状态，都有意识心的存在，都有意识心在活动运作着。所以意识活动的范围确实非常的广泛，在我们现在身口意行现起的每一个当下，都有意识的现行。意识的体性就是：我在思惟，我在了别，我在观照，我在反思，我们往往把意识当作我，这个我的表现最为突出，最为强烈。</p><p>是谁把意识当作我呢？一个是意识自己，最主要的就是意根，祂严重的执意识为我，把意识所有的功能作用当作我。意根是遍计所执性，普遍计度执取一切法为我，为我所有。祂不仅执取第八识为我，也执取六识为我，执取一切法都是我，归我所有，其贪执性特别的大。在我们身口意行每个活动当中，每一个的思考作用，每一个的心理作用，都是意识的功能作用；包括分别作用、思考作用、判别作用、反思作用、观照作用等等。思惟的作用，不管思惟什么法，思惟世俗法也好，思惟佛法也好，参究话头也好，都是意识心在起用，可见意识的用处相当的广泛。</p><p>要断我见，就要思惟观行意识的生灭性、虚妄性，要思惟意识生起所需要的各种缘，了知由缘而现起的法必定是空幻的生灭的。意识心现起的每个当下，都需要有各种缘，需要有各种的助缘，意识才能够生起，才能够活动；如果没有了助缘，意识心就不能现前，就处于断灭的状态。观行意识的另一个方法，就是从意识心总体的生灭现象来思惟意识的虚妄，意识形成了以后，表面上看来好像是连续不断的，意识心的分别作用也好像一直都存在着，其实这些作用都是虚妄的，生灭的，也是断续的。在以下五种情况下，意识必定要断灭的，譬如：真正死亡时，昏迷时，睡着无梦时，入无想定时，入灭尽定时。</p><p>思惟所得出的结论应该是：凡是因缘所生的法，都是虚妄的，都是生灭的，都是空的，都不是我。这个观念的形成也是很不容易的，需要颠覆无始劫以前的错误的思想观念，才能建立起现在的如理如实的思想观念，从此以后，就不再错认缘生法为真实，这就断我见了。</p><p>我们来思惟观行，现在正在思虑的心，在了别事物的心，是什么因缘所生起的呢？没有这些缘，我这个分别心是不是就没有了呢？没有这些缘，我现在的思考力就没有了，我现在的了别性就没有了。这样思考来思考去，就能知道这个心有多么的虚妄，有多么的不真实！慢慢思惟以后，就不再错认能思惟能了别的意识心为我。最好在有定力的情况下来思惟，这样的思惟就很深细，意识和意根就容易认可这个理，不再执取意识为我，于是就断了我见。</p><p>意识可分为：五俱意识和独头意识两种。与五识同在一起时起了别作用的是五俱意识，不与五识同在一起，能单独起作用的就是独头意识。和眼识在一起的这个意识心，看色的时候能同时分析此色尘的质量、来源和内涵，以及这个色尘有多么无聊或者多么有趣，于是就产生出对于色的感受，对于色的分别，对于色的了知，对于色的判断，这些都是意识心的分别作用。</p><p>意识心是由什么因缘而现起的呢？意识心的现起，必须有眼根，有色尘，有意根，有第八识，有自身的识种子等这些缘。由于这些因缘条件的存在，我们的意识才能现前，才能分别色尘的具体内涵，了别色，判断色，思惟色，打算处理色，推测色。这就是和眼识在一起的意识心，若差一个条件，意识就不能出生，不能生起了别。从这里，就知道我们的意识心有多么的虚妄。</p><p>再有和耳识在一起的意识心，分析思惟有多么的虚妄，是如何生灭的。我们听声音的时候，肯定要有意识参加，意识能分析这个声音是属于什么声音，来源在哪儿，离我有多远有多近，声音的内涵是什么，声音有多粗有多细，是男的声音还是女的声音，是物体上发出的声音，还是宇宙发生的声音，对我有什么影响，如何处理和对待这个声音等等，这都是意识心所了别处理的内容。</p><p>与耳识同在一起的意识心现起需要什么条件呢？祂的现起要有耳根、耳识、第八识、意根、意识的自身识种子，还要有外界的声音。具足这些条件以后我们才能听见声音，才能对这个声音起分别、了别、判断、分析，思惟、打算，生起各种喜心、贪心、厌心，才能有各种心绪的产生，这都是意识心的功能作用。</p><p>分析思惟这个意识心的生灭性，如果外面的声音消失了，意识心就不能了别此处的声尘，就转移到别处去分别，不在此处继续分别声尘。如果缺了一个缘，如耳根毁坏了，那么耳识心也就不存在了，意识心也就不能关注这个声音，可见这个意识心是多么的虚妄。外面的声音都是由各种因缘而生起，没有了外面的声音，意识心也不能现起。如果没有了识种子，意识心也不能现起，如果意根对法尘不感兴趣，不对这个声尘生起作意，意识心也不能现起。如果人困了，昏迷了，意识心也不能现起，我就听不见声音了。那么我这个能听见声音、分析声音、思惟声音内容的意识心也是生灭的，是无常的，是因缘所生的，所以意识心不是我，是生生灭灭的，根本就不能是我。</p><p>还有一个和鼻识在一起的意识心，和鼻识一起闻气味的意识，祂能分别气味的性质、来源、品类、程度、有无危害性、对自己以及环境的影响等等，还能思考如何处理，如何对待。这个意识的现起还有很多条件，要有外面的香尘，不管是香味也好，臭味也好，什么味道也好，反正得有这个味尘生出来。还要有意根，有第八识，有意识自身种子，有鼻根，有鼻识，有这些因缘条件，意识心才能现前和产生分别作用。</p><p>意识心现前了以后，就能了知这个味是从什么物体发出来的？哪种味，品种是什么，香到什么程度，臭到什么程度，离我们有多远，然后生起喜心，生起厌心，生起各种觉受，对这味尘进行分析、打算、判断、思惟、推理，这些作用都是意识心的起用。意识心的产生，第八识是因，还要有各种各样的缘，这些因缘聚集在一起时意识心才能出生，之后才能生起了别、推理、判断、思惟等等一系列心理活动。所以说这意识心是生生灭灭的，是不自在的，是不自主的，是虚妄无常的，根本就不是我。</p><p>再有就是和舌识在一起的意识心，祂是在什么条件下现起来的呢？祂的现起要有舌根，舌根要完好不坏，要有舌识，还要有第七识和第八识，还要有意识的识种子，还要有饮食中的味尘，意识心才能现前。意识心现前以后，就能分别这是什么味，具体的酸甜苦辣咸淡到了什么程度，是什么物体的，好不好吃，吃了对自己有益处还是无益处。然后还要有其它的思想活动，分别、了知、推理、分析、判断、打算，各种各样的思惟都是意识心所运行的。意识思惟活动的现起，要有这些因缘条件，差一个条件，意识思惟活动就不能现起。既然是因缘具足了才能现起的法，那当然就是虚妄的，生了灭，灭了又生的无常法，就不是我。</p><p>还有和身识在一起的意识心，这个意识心现起的条件，需要身根完好，身根不坏。意识现起的缘是需要有身根，有身识，需要有意根，有第八识，有意识自身的种子，还要有触尘。触尘有外触尘与内触尘，外触尘是外面物体所散发出来的，与我们身体相接触，然后又被第八识变现成内相分的触尘。内触尘是我们色身内部产生的触尘，如：饥渴、饱饿、疲乏、舒适等等。有了这些条件，我们的意识心才能被第八识变现出来，然后才可以了别身体当中的触尘，了别我现在是不是饿了，是不是渴了，是不是疲乏了，现在是哪里疼痛了，现在哪里舒适了等等，这是意识在分别身体上的触尘。</p><p>意识也能分别身体外的触尘，比如阳光照到身上有多暖和，有多温和，风吹到身上是多柔和，或者风刮到我身上是多么猛烈，物体打到我身上是多么疼痛，分别感受各种触尘，都是意识心的作用。当然身识也在其中共同作用，意识要分别是什么样的触尘，是好或是不好，其产生的影响和后果是什么。然后生起了种种的思想活动，这些都是意识心的思想活动。这些思想活动要受一定条件的制约，如果没有了这些条件，思想活动就无法现起。所以意识就是生灭的，是因缘所生的，就是不自在的、不自主的，那么这个与身识在一起的意识心就不是我，我们不能再把祂当作是我。</p><p>意识心单独所进行的思想活动，是不与五识同在一起的，那就是独头意识。比如我们在思考一个佛法或一个义理，或者禅思，或者回忆，或者遐想，或者想心事等等，这种种的思想活动，就是散乱独头意识。又比如在定中了知自己心里出现了各种定境，分别这是什么境界，有什么意义，内涵是什么，内心就能生起各种的感受，出现各种的思想活动。这是定中的独头意识，祂不与五识同在一起的了别活动。还有梦中的独头意识，我们在梦中的活动，了别各种的梦境，这些都是意识心的单独活动，这些活动得要有很多个条件的具足才能出现，差一个条件，独头意识就不能现起。独头意识不现起时，我们就不能进行这些思惟活动、了别活动、分析活动、打算活动、观行活动，所有这一切的活动就都没有了。</p><p>独头意识的生起，需要有第八识和意根，需要有意识自身的识种子，也要有法尘的参与。这时独头意识的现起，所需的缘要比五俱意识所需的缘少，也比五识现起需要的缘少。所以散乱位的独头意识最容易现起，可见我们内心散乱的时候多，因此修定就很不容易，做事时也不容易专心，总是喜欢想东想西，胡思乱想，有时候心里想些什么，连我们自己都不知道。这些独头意识，都是意根攀缘万法而产生出来的，根源就在意根这里。所以降伏意根，让意根不到处攀缘，才能心念专一，意识心才能有定。</p><p>既然独头意识心的生起，也需要有一定的条件，那么这个意识心就是因缘所生的，就不是自在的。由因缘所生的法，就是生灭无常的，根本就不是我，变来变去的法，就是不恒常的，就是苦的，苦的也不是我。真正的我是不苦的，是常的，不是生灭的，也不是断续的；祂不被任何条件所制约，本来就在，无有生生灭灭的现象，那个才是真我。除此之外，都是虚妄的，都是幻化的假我。要受到各种条件制约的，就不是真实的，因此都不是我。常常思惟此理，慢慢就能把自己的思想转变过来。</p><p>西方有一种哲学思想说：我思故我在。这里的我，一方面是指能思量的意根的我，另一方面则是指能够思考的意识心的我。我在思考，我在了别，我在分析，我在打算，我在判断，我在思虑，我在了知等等。这个我是意识心的我，祂总在了知，这一天我在干什么，我在吃饭，我在走路，我在了别，我在看书，我在思惟，我在思考，我在观行，我在参禅，我在拜佛，我在工作等等。</p><p>那么这整个一个我，都是由于各种因缘才能现起来的，必然要受到很多因缘条件的制约，这个我当然就是生生灭灭的假我，根本不是真正的我。这个我是一个被第八识所幻化出来的空壳子，其表面所具有的功能作用都是第八识给予的。如果第八识没有识种子，如果第八识不配合造作，这些分别性等等功能作用，都将消失而不存在，那么意识就是生灭的虚妄的，幻化的空的，就不是我。</p><p>我们应该清楚地认识到：当下正在说话的我，正在想事的我，正在做事的我，都是因缘所生的，都是生灭的，因此都不是我，这样我们就断了以意识为我的我见。世间里所有的哲学家、思想家，都把能思考的意识当作是我，可见都是我见没有断的凡夫。即使是天人，欲界色界无色界等三界的天人，包括最高层天的非想非非想天的天人，也同样是把意识心当作我，当作是真实永恒不灭的我，所以他们必然都要生死轮回不断，苦恼不已，可见断我见有多么的重要！</p><p>我们今世无论要付出多大的代价，也一定要断除我见，断了我见之后，生生世世就可以受益无穷。所以我们心中要尽量抛弃世俗法，这些世俗法只可以应付，不可以当真，不可以执著，更不可以执取。心里能抛弃多少就抛弃多少，抛得一干二净那是最好的。然后再回过头来抓取佛法，你可以执取佛法，再怎么执取佛法暂时都没有关系，因为生死问题已经解决了，佛法又能让我们成就佛道，何乐而不为呢！</p><p>二、识种刹那刹那生灭，在睡着无梦、昏迷、正死位、入无想定、入灭尽定等五种情况下，六个识必然灭去和消失；因此识心是生灭变异、无常、苦、空和无我的。只要有第七识的存在和运行，就有第八识跟随，第八识就像跟班的侍者，二个识体性相差极大，并且紧密相连。第八识最微妙甚深，其次第七识也很微妙甚深，再其次第六识也微妙甚深，最后五识也微妙甚深，八识心王都微妙甚深，八个识的体性全部都了知无余，众生就成佛。</p><p>在非想非非想天中，第六识极为微细；定的层次越高，意识心越微细，其了别性越弱。非想非非想定是三界世俗中最高的定，在那里入定的意识心没有证自证分，不能反观自己的存在，也就是不知道自己存在；在其它的定中，意识心还能反观自己，知道自己的存在。初禅定和欲界定中的意识心，还能了别五尘上的法尘；二禅以上的定中意识就不能了别五尘上的法尘，因为前五识已经消失，意识无法单独了别前五尘。因此说意识是生灭变异的，不是真实而永远存在的，那就是无我的，五识也是如此，第七识也是如此。</p><p>三、如何断除意识为我的我见</p><p>在普通情况下所能发觉的意识，都是有明显而强烈的分别觉知作用，有明显的感受作用，有明显的思惟作用，有明显的心理情绪作用，这是比较粗重的意识，容易被我们感知到。修行断除这样的意识为我的知见并不是太困难，要观察到比较细微的意识的心理作用，心不细致，没有智慧分辨，就比较困难了。没有禅定，思惟粗糙，就不能断除深细意识为我的邪见，我见不能断尽，生死就不能了，三恶道也不能免。</p><p>学佛修行只要知道意识是虚妄的，不把意识当作是我就好，实际证得意识是生灭虚妄的非我的，就断我见，不被意识的觉知作用所系缚，就能得解脱；然后要好好地利用意识心来获得更大的智慧，将来就能成佛。平时要观察观行，确认意识非我，非我所有，意识的各种行相都不真实，都不是我，这样就能破除无明，不被生死系缚。凡是能觉知到的世俗法都不是我，自己的一切功能作用都不是真实的，都不是我。认可这些理就需要有较好的定力，在行住坐卧中修定，定力越好，就越能体会到五阴的虚妄，越能知道意识自己的虚妄。</p><p>如果识心全都灭了，不可能知道自己入定，也不能知道自己很清静，不知道自己无念想，也不知道定中所有的状态和境界。既然知道，就有意识心的存在和运行，意识心仍然在起了别作用。只有把这些微细意识也观察到，认可所有的了别作用的微细意识都不是我，这样才是完完全全断除了意识为我的邪见，就是真正的断我见。这时再参禅，不会再把微细意识当作本来就清净的第八识，就不能悟错走错路。</p><p>四、六识触六尘之后，就有受和受觉，众生都以为种种受觉是这样的真实，种种受觉都是我，于是就要对种种受觉起相应的反应，或者喜爱贪爱，或者嗔恚怨恼。实际上各种受觉非常虚幻不实，识种子生成之物，就像电子输送出来形成的电流一样，非常不真实，何必太在意受觉，而造作不善业行？</p><p>观察想象电流的生成过程，就知道电流是由无数电子聚合流动而形成，电子又是无形无相的，生灭变化的，由发电机输送出来的，形成电流，电子又回到发电机中。电流就是生灭变异幻化的，起作用之后就消失。受觉也是如此，有何可执著的？有何可当真的？</p><p>观行六七识心和五识心也是虚幻不实的，比观行六尘境界还要重要得多。心生种种法就生，心灭种种法就灭。擒贼先擒王，识心是法的主人，看住主人，任他牛羊处处跑。</p><p>抓住受觉，看住受觉，思想观念必然要净化，恶业必然要消灭，不必要的业行必然要少于造作，内心必然逐渐清净，烦恼必然要淡化，禅定必然要生起，智慧必然要出生。身轻觉安，身心必然发生改变，何乐而不为？何必每日里沉浸在各种受觉中而不能自拔，苦恼恼苦，身心憔悴？</p><p>五、观察五阴十八界无我，主要观察意识的无我，意识的境界比较多，有粗有细，有清净的有不清净的，有空的有不空的。要观察意识，就要体会各种意识境界的生灭无常苦空无我。意识有各种境界相，比如种种烦恼相、种种清净相、种种空相、种种知相、种种了别相、有语言文字相、无语言文字相、有声音相、无声音相、寂静相、喧闹相等等，这些相和境界都是生灭无常的变异法，都不是我，都是空的。</p><p>包括心静下来，一念不生的时候，就是意识的寂静相，识破祂的虚妄性，不认祂为实为我为法身为如来，就断除了这时候的意识我见。但还有其它时候的意识我见，前念不生后念没有来的中间空隙，好像是清静的，实质还是意识境界，识破祂，才能断除意识的我见。</p><p>六、如何观行识阴</p><p>观行五阴受想识中的识阴，要观行识种子生成七个识的功能作用，以六个识的功能作用为主。受想行识的识种子输出来以后形成了六识，然后才有六个识的种种功能作用。</p><p>六识生出来以后，就有了受觉，然后有识觉的分别作用，又有行觉，有受阴、想阴、行阴、识阴的所有功能作用，具体都有哪些功能作用，自己要一一仔细的观察清楚，不要错过一个。要知道识种子生出来以后，识心就有这些作用，这个很重要，观察清楚，大小乘都能证悟。</p><p>识阴当中主要观察受的虚妄性，我们的五阴还是以受阴为主，众生都把自己的觉受当成真实，以觉受为中心而展开五阴身口意活动。观察这个受觉如何是不真实的、生灭的、空的、苦的、不是我的；然后再往下观察想阴、行阴，想阴就是执取、取相，心上取相，了别分别，或者是种种的思想思惟。</p><p>行阴，有识就有行，因为识必然要运行，识运行了以后才有受、想，才有分别、这些功能作用，把识种子形成识这个内容观察清楚了，大小乘法都在这上证，将来证悟的智慧会非常深，开悟一下子就悟到唯识上了，这个悟就比禅宗的悟要深透得多，悟到识上了，智慧就非常深，将来就能很快具备唯识种智。</p></div>"
},{
    "title": "第十五章 问答",
    "author": "生如法师",
    "date": "2020年05月10日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章  问答</strong></p><p>一、意识有睡眠吗？什么叫作意识的睡眠？如果意识有睡眠，在睡觉时意识必须存在，能了别尘境，能思惟能观察，有情绪，不能灭去，如果是这样的话，那就不是睡觉，与清醒无异。</p><p>比如说我在娑婆世界有家亲眷属，我离开娑婆世界的时候，娑婆世界的家亲眷属还是我的吗？还归我管吗？他们有什么事都与我无关，我不负责。睡觉这个法里，没有意识没有五识，睡觉这件事与灭去的六识有什么关系？有事可以找意根处理，意根如果处理不了，就会让六识处理，那就没有睡眠了，六识仍然没有睡眠心所法。</p><p>享受睡眠滋味、受用睡眠的是谁？没有六识，六识受用不到，当然是意根受用睡眠了。意根如果不想受用睡眠，祂会决定不睡觉，意识怎样抗议也没有用。意识如果享受睡眠，第二天就没有精神，就要无精打采的，精力不足事情就做不好，这是一种做梦的特殊情况，不是常态。所以不能说意识有睡眠，意识不在睡觉现场，睡觉这件事就伴随意识所为。</p><p>睡眠大体是什么状态，所有人共同点是什么，通常状态是什么？特殊的除外，八这些问题弄清楚，就会知道意识是否有睡眠了。睡眠总体状况是灭除六识，灭除的是五俱意识和独头意识，做梦时有独头意识，但没有多少思惟观察能力，身心是休息状态，不管有梦无梦。独头意识与有梦睡眠相应，这是特例，不是通常情况，所以睡眠里没有六识，六识不睡眠。</p><p>真正的睡眠就是灭去六识、没有明了意识、没有五俱意识的休息状态，这种状态里没有六识。因此六识没有睡眠一法。是意根控制睡眠的有无，控制六识的生起与灭去。</p><p>二、六识有睡眠这个法吗？</p><p>六识不管有什么法，必须是在六识存在的状况下，如果六识本身都不存在，怎么还能谈得到拥有什么法？没有识心，就没有识心的心所法。比如没有张三这个人，就不能说张三有什么物；没有房子，不要谈房子里面有什么东西。同理，睡眠当中没有六识，就不要谈六识有睡眠这个法。那么睡眠是谁的法呢？是意根的法。虽然意根不睡觉，但是意根根据身体情况需要睡眠，以解决身体疲劳困倦的问题，如果不睡眠，身体劳顿，意根就无法正常的使用六识去完成各种工作。那就是说睡眠是意根所需，由意根决定，是意根主动的行为选择。意根选择睡眠的目的，是为了五阴身更好的工作，如果五阴身没有疲劳困顿，意根就会让五阴身继续运行下去，不会中止，天人就是如此。所以说睡眠与意根相应，不与六识相应，六识灭才有睡眠。</p><p>三、为什么梦中听不到说话的声音却能知道说什么？</p><p>语言声音的产生需要一定的条件，首先是心有觉观，想要表达出来，于是有风触脐，风息顺着脐一路触到喉咙、舌，语言声音就会出来了。声音的大小与风息的大小有关，风息的大小与觉观的轻重有关，与意根和五俱意识的情绪大小有关，与心所法有关。</p><p>在梦中只有第八识、意根和独头意识，没有五俱意识，身根也不太起作用，意根意识虽然有表达的意愿，语言和声音却无法产生出来。梦中的色声香味触法都属于独影境，只有独头意识才能了别，五识和五俱意识都不能了别，所以耳识听不到梦里的声音。虽然没有语言声音，却能明白对方所表达的是什么，因为意根不需要语言声音就能明白对方意根的心思，意识在梦中没有色身的拘碍，就有小神通，也能明白对方的意思，也能上天入地。</p><p>四、问：小孩子意识是新的，但意根却是“老油条”了，小孩看天花板，应该知道那就是天花板，知“名”但不知“言”，如来藏没输“言”种子，所以小孩不能说出那是什么。不知对否？</p><p>答：如果小孩子知道那是天花板，他必须经过学习，有人告诉他那就是天花板，他才能知道。但是没有学会说话的时候，却表达不出来，不会语言表达。意识学会了表达的时候，由于语言种子不同，每个孩子语言表达的方式方法就不同，效果就不同，有的表达清楚，惹人喜欢，有的表达不清楚。</p><p>种子需要遇到缘才能现行出来，缘不具足，种子暂时就不起作用。语言的种子现行，需要意识学习环境知识这个缘，意识还没有世俗知识时，语言种子不起作用。</p><p>五、问：遇事总往坏处想，烦恼越来越重，能不能改变为往好处想？</p><p>答：遇事总往坏处想的原因，一个是因为有我执，比较在意遇到的事情和切身利益，害怕那些事情不好，所以才往坏处想，作最坏的打算。另一个是因为对自己没有信心不自信，觉得事情不能成功，实际是非常希望自己成功。不自信属于我慢的一种，因为内心里有我，就会在意与我有关的事情，就会情不自禁的往坏处想。把事情往坏处想等于下诅咒一样，结果有些事情就会往坏处发展。因为真正往坏处想就是意根往坏处想，力量强大的话如来藏就会配合，事情果真就不往好处发展，往往会弄糟了。</p><p>要想改变这样的情况，最根本的下手处，就是减轻对我对我所的执著，凡事要看开，随缘不在意，烦恼就会少很多。要改变自己的思惟习惯，对所遇到的事情如理作意，或者抱着随缘的态度。因为每个人都有善业和恶业，感召到的事情就有好事和坏事，即使贵为皇帝皇亲国戚，都难免遇到各种好坏事，兵来将敌水来土堰，有随业受报的心理准备，就能看得开了。</p><p>如果总是把事情往好处想，意根的力量大，如来藏就会配合，慢慢也能把事情搞好了。比如说身体有病的时候，心理不悲观，对身体信心十足，总想身体一定能好，就等于给自己好的暗示了，这种暗示如来藏能了知，意根想办法如来藏就会配合，身体就会不知不觉的变好了。如果心理没有病成天想着病，如来藏也配合，慢慢病就会找到身上来。这是人的心念的作用，好的心念好的暗示有好的结果，不好的心念不好的暗示有不好的结果。就像给人下恶咒一样，给别人下恶咒和给自己下恶咒结果都不好。如果发个善咒或者善愿，对别人和自己都有好处，因为后面有个如来藏，祂会配合你。</p><p>多作冥想、观行、思考，给自己好的暗示，等于给自己鼓励打气，暗示自己能变得多么好，能实现什么愿望，将来能如何如何，这个叫作善愿。发了一个善愿，就是好的暗示，将来就变得好了。如果意根发愿了，如来藏就会配合实现愿望。佛总让我们发一些清净大愿和善愿就是这个意思，发愿成佛就能成佛，如果总说我成不了佛，那就不能成佛了。但早晚有一天还要发这个成佛大愿，发的愿越大越勇猛，实现的越快，这是意根和如来藏之间的事情。</p><p>用意识经常善思惟来熏染意根，给自己一个好的暗示，我能力十足，我能办好这件事情，我能断我见，我能明心见性，我能处理好一切事情，然后仔细思惟事情该如何如何做，不知不觉的就把事情做好了。常常这样心理对话，心理暗示自己，冥想、暗示、催眠、熏染等等对自己有很多好处。在睡觉时躺下放松身心，给自己设定一些积极向上的暗示语，心里自己与自己对话，就是意识与意根对话，时间长了就熏染过来了，遇事就会信心十足。</p><p>六、依他起的法也是缘起法</p><p>依他起，是依靠他法别法才能生起的法，他和别，就是法出生的缘，所以依他起的就是缘起法。因缘所生的法，离开所依的缘法就不存在，缘发生变化，法就会随之发生变化，缘灭了，法就会随之灭去。所以依他起的缘生法是幻化不实的法，是虚妄的法，是空的，是生灭变异的。</p><p>缘起法包括五根、六尘和六识。眼耳鼻舌身是缘起法，依赖众多的缘，才能出生和存在以及发展变异，是不可靠法，因此我们不能完全依赖它，不能总是依赖它，修到一定时候，完全不依赖它的时候，心空了，就会解脱了。六尘是缘起法，依赖众多的缘而出生、存在和发展变异，因此六尘是不可靠的，不可依赖的。我们应该逐渐摆脱对六尘的依赖，减少对六尘的贪爱和执著，修到一定时候，完全不依赖六尘，心空就解脱了。</p><p>我们依赖什么法才能对六尘有所依赖呢？执取六尘需要六识，六识对六尘产生分别之后，就会对六尘有所依赖。是什么法执取六尘需要六识呢？是意根执取六尘，然后出生六识，用六识来取六尘，意根再执六尘，再执六识的功能作用，这样生死循环往复不间断。执的心是意根，用六识工具来取，实际上能取的还是意根。六识也是缘起法，依赖众多的缘而出生、存在和发展变异，是不可靠法，不可依赖的法，因此我们应该要逐渐远离六识，减少对六识的依赖。修到一定时候，完全不依赖六识的时候心就空了，就会得解脱了。</p><p>这一切真理是讲给谁听的？是讲给我们自己听的，我们指谁？自己指谁？都是指意根，六识是传达兵，负责把这些信息传达给意根了知，何去何从由意根作主拿主意。如果这些信息只停留在六识这里，没有传达到主人意根那里，这些信息就没有什么用，不能影响和改变主人的心意和抉择，一切就会依然故我，生死循环不已。</p><p>如何让这些真理和信息传达到意根那里呢？修定，禅定中思惟观行，禅定越深，传达的效果越好，意根越能吸收消化这些信息，越能改变心意，那么一切的无明执取就会消失殆尽，就会解脱于一切法，没有生死苦了。</p></div>"
}]