[{
    "title": "第一章 第一节 第一处征心—识心居在身内",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  第一卷七处征心</strong></p><p>佛为什么要在楞严经的开篇讲七处征心呢？在开篇讲的目的是要破妄显真。第一卷里破的是妄法六识心，通过与阿难的七番征心，寻找爱乐佛的妄心所在，结果找来找去都找不到妄心究竟在哪里，没有意识所在之处。那就说明了妄心是虚妄的虚幻的，不是真实存在的，告诉众生不要把妄心六识当作自我而执取不舍。只有舍弃妄心，才能证得真心，识得自家财宝，才能破迷开悟，解除生死系缚，从而获得大解脱。</p><p>根据第一卷世尊的开示，每个人只要定力足够，在禅定中深深的观行思惟，就能够破除六识的我见，进而破除七识五蕴的我见，断我见断三縛结还是不难的，难就难在戒和定，以及观慧上。受戒、修定、如理思惟，这三者应该循序渐进的修行，断我见就有希望，明心见性也有希望。</p><p><strong><span>第一节  第一处征心—识心居在身内</span></strong><br/></p><p>楞严经第一卷讲的是阿难受困于淫女邪咒，被文殊师利菩萨带着世尊加持的楞严咒救度出来以后，阿难就悲泣忏悔道力不全，乞求世尊授予十方如来成就妙菩提的奢摩他、三摩禅那的最初方便之路，世尊就开始领着阿难和大众征心。征心所在是寻征心在何处，知道妄心在何处，就能降伏妄心，而得解脱。因为阿难是因为爱乐佛而出家的，爱乐佛的心就是妄心，佛就让阿难找妄心在哪里，是否有自体性，然后再降伏妄心，修行就成就了。</p><p>现在开始征求阿难所说的爱乐佛的心在哪里，这是生灭的妄心，结果阿难找来找去都找不到，最后得出一个结论：妄心七识不在色身的里外和中间。但是识心又在胜义根里与内六尘在一起，触内六尘，了别内六尘。征心的根本着眼点是要理解识心不是色法，无形无相，因此不能说在身体的内外中间几处，所以说识心没有自体性，也就没有处所。　</p><p>内六尘是影子，不是实质的物质色法，因此六识可以触胜义根里的内六尘影子，而不能具体在身体的里外和中间。识心如果在身体里，就能触实质的身体色法了，实质的物质色法是外六尘，妄心不能触，因此识心不在身体里。同理，如果识心在身体外能了别身体，这个身体就与识心无关，身体属于实质的外六尘色法，妄心能触实质的物质色法无有是处，实质本质的物质色法只有如来藏能接触，妄心六识不能触，因此妄心也就不能在里外中间等七处。　　</p><p>原文：<strong>阿难。我今问汝。当汝发心。缘于如来。三十二相。将何所见。谁为爱乐。阿难白佛言。世尊。如是爱乐。用我心目。由目观见。如来胜相。心生爱乐。故我发心。愿舍生死。</strong></p><p>释：现在开始讲第一处征心，是什么原因引起要征心呢？征心的原因是：阿难对佛说：我因为爱乐佛故，才愿意舍弃生死发心出家。然后佛问阿难：当你发心出家时，是因为喜欢如来的三十二相，你是用什么看见如来三十二相的，又是谁爱乐佛，因为什么爱乐佛呢？阿难说：因于心目，我用心目爱乐佛的三十二相，由于眼根看见了如来殊胜的相貌，心就生起爱乐了，所以我才发心出家，愿意舍弃生死。</p><p>原文：<strong>佛告阿难。如汝所说。真所爱乐。因于心目。若不识知。心目所在。则不能得。降伏尘劳。譬如国王。为贼所侵。发兵讨除。是兵要当。知贼所在。使汝流转。心目为咎。吾今问汝。唯心与目。今何所在。　</strong></p><p>释：佛告诉阿难说：像你所说的那样，你真心爱乐于佛，是由于你的心和眼根，如果你不知道自己的心目在哪里，那就不能降伏自己的尘劳烦恼了。譬如国王为贼寇所侵犯，就要兴兵讨伐那些贼寇，除去隐患。但是去讨伐的军兵们一定要知道那些贼寇在哪里，才能降伏他们。讨伐降伏自己的心贼也是这样，使你有不断的生死轮回的是你的心目，心目是有生死过患的罪魁祸首，所以要降伏心目。我现在问你，你的心目在哪里呢？</p><p>佛的意思是说，你的心目就是烦恼贼，自劫家宝，能劫夺你自己家的摩尼宝珠，让你在六道里贫穷流浪，流离失所，生死轮回不已，这都是因为心目的缘故。我们要把心目贼抓住，以后就能降伏烦恼，回归到自性家园中，不再认贼为子，认贼为父，不要把妄心当作自己的主人，当作自性了。</p><p>佛问阿难：你所说的心目到底在哪里？这就开始征心了，佛是让阿难找出爱乐佛的心，认识此心是烦恼贼人，才能剔除假主人，找到真主人，从而回归自性家园，归家稳坐。爱乐佛的心是有生有灭的七识虚妄心，是自劫家宝的烦恼家贼；而自性清净心，自己的主人公没有爱乐，没有喜厌。于是世尊就开始征心，问阿难心目在哪里。阿难听佛这一问，就开始寻觅，这就是第一处征心了。</p><p>原文：<strong>阿难白佛言。世尊。一切世间。十种异生。同将识心。居在身内。纵观如来。青莲华眼。亦在佛面。</strong></p><p>释：阿难对佛说，世尊，一切世间里的十种异生，都认为识心住在自己的身体内。即使能看到如来您的青莲花的眼睛，也是在佛的面上。</p><p>一切世间包括三界所有器世间、所有诸佛国土、大千世界，总共有十种异生。什么叫异生呢？异就是变异、变化；生代表众生，众生包括菩萨，包括声闻，包括缘觉，包括六道凡夫，是众生就不是佛，异生就是异类而生、异时而生、异地而生的意思。</p><p>异类而生，比如说我们现在投生为人类，下一世不当人类了，换一种生类，有可能是鬼类，有可能是地狱类，有可能是畜生类，有可能是阿修罗类，有可能是天人类，有可能是声闻类，有可能是缘觉类，有可能是菩萨，那都是不一定的，换了生命的种类，就叫作异类而生。众生这一世是人身，下一世可能是天人身，这叫异生，换了种类，叫异类。还有一个异时而生，所谓的异时，比如说我们人类的生命，现在是几十年的光阴，那么几十年光阴之后，生命就结束，又有下一段的生命体出生，这叫异时，在另一时间段又出生叫异时而生。</p><p>还有个异地而生，所谓的异地，地代表三界九地，三界即欲界、色界、无色界；九地就是三界中的九地，欲界是一地，色界的初禅、二禅、三禅、四禅四天是四地，再加四禅天上面有四空天，总共是九地。异地是众生的出生地不同，比如说现在在欲界人间出生，因为修出了初禅，下一世可能在初禅天出生，这叫作异地而生，出生的地点不同了。众生现在在欲界地出生，下一世也许会在色界出生，或者在无色界出生，出生之地改变了，叫异地而生。</p><p>众生有十种异生，十种异生这个十，是一个大约数，不一定就是指固定的十个。如果包括佛，法界有十种，六道凡夫是六种，声闻是一种，缘觉是一种、菩萨是一种，佛是一种。异生不包括佛，佛不是异生，不是众生，也不变异。十个种类如果细分的话，能分很多种，比如人可以分为很多种类，畜生细分更是无数种了，鬼类众生也有很多的种类，地狱众生也有很多种类，每一道众生的种类都非常多，种类只是一个大约数。</p><p>异生的众生最高位是七地菩萨，八地菩萨没有异生性了，已经了分段生死了，只有变易生死，阿赖耶识改为异熟识。八地以上菩萨的生命不是一段一段的，寿命非常长，不会这一世死亡，然后再托生到下一世，祂没有异类、异时、异地出生的现象，所以八地以上菩萨，不属于异生。八地以下的菩萨，再加上六道的凡夫、声闻、缘觉，都属于异生性，因为这些众生都有分段生死，而四果罗汉和真正证得辟支佛果的人，也没有异生性，没有分段生死了。</p><p>分段生死指生命是一段一段的，人类一段一段的生命几十年、几百年、几万年都有，畜生的生命是几分钟、半天、一天、一年、十年、二十年都不等，恶鬼的生命按劫论，地狱众生更是论劫，都是分阶段的。这一段时间果报受完，再有下一段的生命体出生，受下一段时间的果报，这叫异生。</p><p>阿难对佛说，能够生起爱乐的识心居在身体之内，这是他提出的第一个论点。论据是什么呢？他叙述说：纵观如来青莲华眼，亦在佛面。世俗人都说：眼睛是心灵的窗户，意思是说心灵透过眼睛，能看见外面世界，眼睛的神采神色就表明了此人的思想感情。其实神采和神色是意根控制的，所以表现出来的是意根的思想情绪。阿难此时也差不多如此认为，他说看见佛的青莲华眼和众生一样，也是在佛的脸上，那佛的识心，也肯定在脸面里，在身体里。佛的眼睛叫青莲花眼，形状象青莲花一样，眼睛像四大海水一样，佛的眼睛青莲华眼在佛的脸上，识心就在身体里。</p><p>原文：<strong>我今观此。浮根四尘。只在我面。如是识心。实居身内。佛告阿难。汝今现坐。如来讲堂。观祇陀林。今何所在。世尊。此大重阁。清净讲堂。在给孤园。今祇陀林。实在堂外。</strong></p><p>释：我现在观察我的浮根四尘在我的脸上，识心确实在我的身体里。佛对阿难说：你现在坐在如来的讲堂里，观察祇陀林，现在在哪里？阿难回答佛说：此大重阁清净讲堂在给孤独园，今祇陀林确实在讲堂外面。</p><p>浮根就是浮在身体表面的根，大家能看得见的，表面的根指眼根、耳根、鼻根、舌根、身根这五根。脸上有四根，这里没有包括身根。在脸上有眼根、耳根、鼻根、舌根，别人都能看得见，都在我的面上，就连佛的眼睛也在佛的面上。</p><p>阿难接着得出结论说识心就在身体里，通过脸上的四根而能识别了知一切色法。浮根在外面，那么识心就在里面，从里面能通过脸上的浮尘根看见外面，他以这个论据来证明说识心确实在身体之内。浮尘根也是尘，尘包括四大组合而成的眼耳鼻舌四根尘，身根也是尘，是色法尘，意根属于心法尘，属于心法，不属于色法。</p><p>佛用讲堂来比喻众生的色身，识心在色身里能了别觉知色身外边的物质世界，包括脸上的浮根四尘都能觉知到，是因为识心在身体里的缘故，这是阿难的观点。</p><p>原文：<strong>阿难。汝今堂中。先何所见。世尊。我在堂中。先见如来。次观大众。如是外望。方瞩林园。阿难。汝瞩林园。因何有见。世尊。此大讲堂。户牖开豁。故我在堂。得远瞻见。</strong></p><p>释：佛说：阿难，你在我的大讲堂当中，最先看见了什么呢？阿难回答说：世尊，我在这讲堂中最先看见的是如来，因为我坐在如来的对面，如来坐我对面的上首，肯定是先观如来；观完如来以后，再观如来周围的大众（出家众）；观完出家众以后再往外边看，就看见讲堂外边的林园祇陀林了。佛接着问阿难：你看祇陀林的时候，因为什么而能看见呢？因为什么有这个见性觉知性呢？阿难回答世尊说：世尊，这个大讲堂因为有窗户，窗户与门都敞开着，所以我在讲堂里，通过门窗就看见了外边远远的祇陀树林。</p><p>佛为什么要用讲堂的问题来问阿难呢？佛是有用意的，因为这个讲堂可以代表众生的色身，讲堂的门窗代表众生的五根，讲堂里的人物可以代表众生身体当中的色尘物质，阿难就代表识心。</p><p>阿难你这个识心能看见讲堂里的如来大众，还能看见窗户外边的祇陀林，那意思就是说，识心不仅能看见色身之内，通过门窗也能看见色身之外，门窗就代表五根，用这个来比喻。既然你阿难在室里能看见如来大众，还能透过门窗看见外边，那你阿难的识心就应该能看见身体里的物质，也应该能够看见五根或者四根，还应该看见眼根外的色尘，可是如今不是这样的啊！往下佛就会一一的道来，否定阿难识心在身体内的说法。</p><p>原文：<strong>尔时世尊。在大众中。舒金色臂。摩阿难顶。告示阿难。及诸大众。有三摩提。名大佛顶。首楞严王。</strong></p><p>释：世尊就在大众中伸出了自己金色的手臂，摩阿难的头顶。告诉阿难以及所有大众说：有个三摩提名字叫作大佛顶首楞严王。</p><p>佛就开始讲正题了，这个正题是什么呢，就是大佛顶首楞严当中的主旨如来藏，佛开始叙述如来藏修行法门了。阿难回答世尊的问话之后，佛舒金色臂，舒就是舒展开，佛的手臂可以伸到很长很长，这是佛的三十二相之一。阿难离佛很远，但是佛一伸手，就能摸到阿难的头顶，即使阿难在讲堂的最后边，佛金色的手臂舒展开来，也能摸到阿难的顶，这叫佛摸顶。</p><p>三摩提是佛教用语，印度语，代表三摩地，三摩地一个是定地，一个是慧地，确切讲叫定慧等持之地。是什么法定慧等持呢？三界世间法不是定慧都等持的，除了佛本身能觉知一切法的心是定慧等持的，其他众生都不是定慧等持的。不修道的凡夫无定无慧，外道有定无慧，声闻缘觉定多慧少，菩萨慧多定少，佛是定慧等持。</p><p>除此之外，能真正定慧等持的是什么？是这部楞严经讲的主旨和中心——如来藏。如来藏这一法，叫三摩提、三摩地，叫定慧等持之地，如来藏既有定又有慧，既圆满的具足了一切的禅定，又圆满的具足了一切的大智慧。而且这个定叫首楞严大定，不出不入，无始劫来如来藏常在定中，不出定，无始劫中如来藏具足一切法，具足一切大智慧。</p><p>为什么如来藏叫作常定、三摩地呢？因为如来藏永远是对三界世间万法，不动心念，祂虽然能了别三界器世间以及业种，但祂对于三界法永远不动心，不会生心动念，心地无有转动，永远处于定中，所以祂叫三摩地。如来藏的智慧是指什么？如来藏的智慧是指祂能够出生三界世间一切法的大智慧，有这种大智慧，世间一切法都跟祂无法相比，无法相提并论。一切法包括出生佛的应身、化身、和报身，出生佛的五蕴，出生佛的三十二相，出生宇宙大千世界，出生众生的五蕴身。这就代表着如来藏的大智慧德相，所以如来藏是定慧等持、定慧双具的，就叫三摩提。</p><p>后边的名大佛顶首楞严王，这个三摩提也叫作大，大就是如来藏的特性。如来藏也叫一真法界，祂包罗了三界世间一切万法，包括十法界、十方诸佛国土、十方诸世界海、诸幢王刹，一切法全部都包罗到如来藏心当中，没有一法能超出一真法界之外，所以如来藏名为大。佛顶又是什么意思呢？我们看每一尊佛的佛顶，我们看着諸佛好像是有头顶，其实佛是没有头顶的，佛的无见顶相是没有头顶的。无见顶相代表佛的法身、佛心，代表佛的无垢识，就是说佛顶是无顶的，谁也见不到顶。</p><p>神通第一的大目健连因为不相信佛是没有顶的，他就升到虚空当中想见佛的顶，结果看不到佛顶，他不死心，再升到最高层天看，也看不到佛的头顶，最后又升到上方世界的其他佛国土中，又升到上方世界的很多佛国土中，也都看不到佛的顶，这说明佛顶是不可见的。佛顶代表着佛的真心无垢识，祂是无形无相的，无形无相怎么能看得见呢？不管有肉眼也好，有最好的天眼也好，都不会看见佛的头顶，不会看见佛的真如心。所以无见顶相就代表佛无形无相的真如心体，佛的法身。</p><p>首楞严王，首代表如来藏，祂是三界万法之首，因为有如来藏，依祂就能出生三界世间万法，三界世间万法都以如来藏为首，以如来藏为尊，才会有后边一个一个的世间法出生。先有众生的七识心，七识心攀缘身心世界，如来藏就随顺七识心变现身心世界，三界世间万法就出生了，所以说如来藏是三界万法之首。楞严是一种宝，楞严这种宝坚硬而不可摧毁，任什么人的力量，都不可能摧毁楞严这种宝，楞严王是宝中之王，代表着如来藏是三界世间之中最坚固的、不生不灭的、永远不损坏的、永远不会灭掉的宝贝，祂是众宝中之王，宝中之宝。</p><p>原文：<strong>具足万行。十方如来。一门超出。妙庄严路。</strong></p><p>释：下面讲具足万行，万行也代表着如来藏，具足指如来藏具足一切法的种子，因为祂具足一切法，就能行一切的道。如来藏能行什么道呢？祂能出生三界世间万法，祂能出生众生的五蕴，祂能依众生的意根，依众生的五蕴，而产生三界世间万法，配合意根，配合五蕴，出生五蕴所需要的一切法，圆满完成五蕴的因缘果报，五蕴需要什么，祂就能配合现出什么，尽量满足五蕴的一切需求。</p><p>祂能配合五蕴现出三界世间一切法，世间一切法都是祂运作出来的，没有祂就没有一切，所以说如来藏具足万行。没有一个法不是如来藏运作出来的，没有一个法不是祂所创造出来的，没有一个法不是祂所维持和运行的，所以如来藏具足万行。祂满足众生的一切需求，众生的一切所需都是祂提供出来的，所以如来藏具足万行，祂是一个真正的大菩萨，永远都是对众生慈悲喜舍的无私无畏的大菩萨。</p><p>十方如来一门超出妙庄严路，这句话的意思就是说，十方如来都因为有这个三摩地，才能依止于三摩提这条修行路，究竟超出生死火坑，心得清凉，证得大般涅槃。意思是说十方如来依着如来藏这个法门，修行如来藏这一根本大法，才能彻底超出生死，走向究竟涅槃。超出生死证得大涅槃这条路，就是一条妙庄严路，这里的生死包括了分段生死，也包括变易生死，两种生死都灭除无余，就能究竟超出生死。</p><p>妙庄严路就是指依如来藏走向解脱之路，学如来藏法，获得如来藏中全部的秘密宝藏，就能庄严菩提大路，超出一切生死，这条路是非常微妙、非常庄严的，直达佛地的究竟解脱、究竟涅槃，真是妙不可言。这句话点明了全经的主题，众生从初学佛到最后究竟成佛，这期间就是一条庄严菩提之路，依微妙的如来藏理体，以微妙的如来藏为中心，究竟得解脱。佛插了这么一句话，这一句话如果要细讲，以佛的智慧来说，要讲几劫，到底是几劫和几大劫就不清楚了，专门讲如来藏体性，也许几大劫都讲不完，这一句话如果讲解完，这本楞严经可能就讲完了。</p><p>佛讲这句话的意思是说，阿难你不要总认你那个虚妄的心、能爱乐佛的心是真实的，那不是真实的；真实的心是这个三摩提、大佛顶、首楞严王，你把这个抓住修证了，就能超出生死轮回；而你阿难如果以心目为究竟自己的话，那就是认贼为子，心目贼就会劫你的家宝，让你生死轮回不已。佛用真妄心对比的方法告诉阿难，不要认贼为子，认贼为父，不要把你的心目当成你究竟的阿难；另外有一个真正的阿难，只有依止祂，才能究竟超出生死轮回。</p><p>原文：<strong>汝今谛听。阿难顶礼。伏受慈旨。</strong></p><p>释：佛介绍完首楞严王这一法门之后，就告诉阿难，汝今谛听，你现在仔细听，我再接着给你讲。阿难顶礼，伏受慈旨，伏就是心甘情愿，降伏了自心的我慢，表示愿意听从佛的慈悲旨意，完完全全信受佛语。受是接受，阿难因为信佛，完完全全的信受佛的所有言教，这叫伏受。佛慈悲的旨意，阿难全部都接受采纳，他在佛前没有一点慢心，不会说我的知见一定是对的，而是时时征求佛的看法，询问自己的知见是否正确。阿难在佛前总是带着一种不确定的心态来表述问题，每次叙述完自己的观点，都问佛：我说的对不对，这是谦卑无慢和顺佛敬佛的心态，值得我们效仿。</p><p>不像我们很多人，明明自己的知见不对，却从来不加以检查，盲目的认为自己是对的；然后非常肯定的对别人述说，还让别人一定要相信，如果别人不相信或者否定，他就不高兴了，这是严重的我慢和我执。而阿难就不一样了，阿难在佛前，完完全全的伏受世尊的所有的旨意，佛说什么，阿难就信什么，没有一点怀疑，在佛前从来不执着自己的观点知见是正确的，总是征求佛的意见，非常信受佛所说的话，谨尊佛教，这才是佛的真正弟子。</p><p>原文：<strong>佛告阿难。如汝所言。身在讲堂。户牖开豁。远瞩林园。亦有众生。在此堂中。不见如来。见堂外者。阿难答言。世尊。在堂不见如来。能见林泉。无有是处。</strong></p><p>释：世尊告诉阿难说：就像你所说的那样，你的身体在讲堂内，门窗全部敞开着，通过门窗就能看见远处的林园了。但是也有众生在此讲堂中，不见如来，却能见到堂外。阿难回答说：世尊，在讲堂里看不见如来，却能看见树林和泉水， 众生不可能的。</p><p>这句话非常关键，直接把阿难引向自己观点的矛盾处，从而让阿难不得不承认识心在身体之内这个说法是不对的。佛说，如果识心在身体之内，就能看见身体内的五脏六腑，就像阿难你在讲堂里一样，你代表识心，讲堂代表身体，那你在讲堂里应该先看见佛，看见佛之后才能看见外边的林园；没有说看不见佛而能看见外边林园的。</p><p>因为你阿难面对的是佛，佛后边是窗户，旁边是门，你一边看着佛，再看着佛背后的窗户和旁边的门，通过窗户与门才能看见讲堂外边的林园，那么看见窗户肯定能先看见世尊，看见林园肯定是先看见了窗户。这个比喻是说明识心如果在身体之内，就应该先看见身体里，再通过五根六根看见身体外面。佛讲这个比喻，是故意给阿难将了一军，让阿难处于矛盾之中，从而承认自己的论点错误。</p><p>佛说也有在此堂中不见如来，而能见堂外的人，阿难一听就说不对啊，如果人在讲堂里，一定是先见如来，再看见讲堂里的大众，然后再看见门窗外的祇陀林。</p><p>原文：<strong>阿难。汝亦如是。汝之心灵。一切明了。若汝现前。所明了心。实在身内。尔时先合。了知内身。</strong></p><p>释：佛说：阿难，你就是这样的人啊，刚才你不是说识心在身体之内嘛，你的识心对于一切法都明明了了，能觉了和知见一切法。如果你这个现前能明了一切法的识心在身体内，那眼识、耳识意识等识心应该先了知你的内身，了知身体里的情况，因为识心在身体内，当然应该先了知身体里的五脏六腑。如果是这样，你应该先看见身体里，看见身体里以后，再通过眼根，看见身体外的色尘。</p><p>原文：<strong>颇有众生。先见身中。后观外物。纵不能见。心肝脾胃。爪生发长。筋转脉摇。诚合明了。</strong></p><p>释：如果众生真的是都能先见身中，后观外物的话，那么众生们即使不能见得自己的心肝脾胃，指甲生头发长，筋骨的运转气脉的摇动，也应该明了自身里的一些情况，可是为什么不知道呢？</p><p>佛说，真的有众生先见身中，后观外物吗？（颇一般在古代语中当作“很”与“非常”的意思。）这个反问句就代表并没有这样的众生。没有一个众生的识心能看见自己的心肝脾胃，也不知道手指甲是如何出生的，头发是如何长出来的。如果识心在身体里，是应该能看见这些物的，这就说明了识心不在身体里。如果识心在自己身体里，就能看见自己头发的生长，能看见心肝脾胃，能看见筋转脉摇；如果识心在身体里，确确实实应该能明了这些物质色法，可是众生都不知道。</p><p>原文：<strong>如何不知。必不内知。云何知外。是故应知。汝言觉了。能知之心。住在身内。无有是处。</strong></p><p>释：为什么不知道呢？一定是识心不了知内身的情况，如果连内身的情况都不了知，如何能了知身外的情况呢？所以应该知道，阿难你所说的能够觉了一切法的心、知一切法的心住在身体里，根本没有一点的道理。</p><p>这就把阿难的第一个观点识心在身体内，彻底给否决了。否决了以后，阿难还要提出下一个观点出来，那就是第二处征心了。</p></div>"
},{
    "title": "第二节 第二处征心—心在身外",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  第二处征心——心在身外</strong></p><p>原文：<strong>阿难稽首。而白佛言。我闻如来。如是法音。悟知我心。实居身外。所以者何。譬如灯光。然于室中。是灯必能。先照室内。从其室门。后及庭际。一切众生。不见身中。独见身外。亦如灯光。居在室外。不能照室。是义必明。将无所惑。同佛了义。得无妄耶。</strong></p><p>释：阿难顶礼世尊以后，对佛说：我听闻如来这样说法，终于明白了我的心确实是居在身外的。为什么这样说呢，譬如在一个房间内点燃一盏灯，灯光就在房间里出现了，那么灯光一定能先照见房间内，再从房间的门，传播到房间外，照见院落周围。所有的众生都看不见身体里，唯独能见身体外，也就像灯光一样，如果灯光居在房间外，就不能照见房间内，这个道理是很明显，很容易明白的，应该没有什么疑惑了。我说的这个道理，应该符合世尊您的真正了义之说，不会再错了吧？</p><p>阿难提出识心在身外，这是论点，论据是什么呢？他举个例子说：譬如灯光在房间内，肯定是先照房间里面，后照外面了，意思是说识心在身体外，所以才看不见身体内。</p><p>提出一个论点以后，找出论据来证明自己论点的正确性，这叫因明学，有论点一定要有论据，论据是用来证明论点的。要证明一个论点，最好要从正反两方面都能证明其正确性，逻辑要严密，论点才能成立，不容易被攻破；如果有一方面不能证明论点的正确合理性，论点就不成立。</p><p>如果能从正面或者是一个方面证明论点是正确的，可是没有考虑到另一方面的情况，别人就可能从另一方面找出破绽，证明你的论点是错误的，那么最终结局，你的论点还是不成立的。因此菩萨要造论、和众生辩论讲法的话，一定要懂因明学，自己提出一个论点来，从正、反面以及各个侧面都要能证明自己论点的正确合理性，论据要充足，让对方无懈可击，只能认可你的观点，他就被折服，并且从中受教，我们做菩萨将来都应该学会因明学。</p><p>原文：<strong>佛告阿难。是诸比丘。适来从我。室罗筏城。循乞抟食。归祇陀林。我已宿斋。汝观比丘。一人食时。诸人饱不。阿难答言。不也世尊。何以故。是诸比丘。虽阿罗汉。躯命不同。云何一人。能令众饱。</strong></p><p>释：佛告诉阿难说，众比丘们刚刚随从我在室罗筏城各处托钵乞食，再回到祇陀林精舍中吃饭。我已经吃完饭了，你看看这些比丘们，如果有一个比丘吃饭的时候，把食物吃到胃里，其他比丘是否感觉饱了呢？阿难回答说其他比丘不饱，因为这些比丘虽然都是阿罗汉了，可是身体不同，一个人吃饭怎么能让大众都饱呢。</p><p>其实这里还有奥秘，食物是如何吃到胃里的呢？肯定是用识心来吃的，没有识心，只有身体就不能吃饭。一个比丘既然能吃饭，胃又饱了，他是用身体吃的，但是用身体本身不能吃，是识心利用身体，识心和身体合和运作，就把食物吃到胃里了。然后身体上有觉，识心上也有觉，识心就觉得胃里有食物，已经饱了，这是识心和身体和合在一起的作用，二者不能分离，分离后既不能吃饭，又不能感觉饱；感觉饱感觉胃里有食物，身体和识心都有觉，离开了谁都不能吃饭，也不能感觉饱。而身体上的任何觉知，都是身识的觉知，还是识心的觉。</p><p>但是世尊没破这一点，而是问阿难一个人吃饭吃饱了，其他人没有吃饭能不能饱，一个人能不能代替其他人吃饭。意思是问阿难，这个人和其他人是不是有关联的，肯定是没有关联的，两个身体两个识心，两个人都是单独的个体，互相没有关联，这个个体接触的东西，一定归这个个体所有，那个个体所接触的法，一定归那个个体所有，识心和身体不能共用，不能互相代替。</p><p>佛就用这个比喻说明个体不同，不能互相替代。如果把识心和身体分离开，识心是一个个体，身体是一个个体，这是两个个体，两个个体不能互相和合起作用。那么识心所了知的法，身体就不知道，身体上能觉知的法，识心就不知道。例如眼识在身体外，看见了外边物，但是眼根没有觉，见色与眼根没有关系，见色这件事就不成立，因此识心和身体不能分开。</p><p>耳识如果在身体外听到了声音，耳根如果没有听见声音，耳根上就没有觉，觉跟耳根没有关系，耳根就没有听声，听声这件事就不成立。鼻识如果在身体外嗅到香臭味尘了，而鼻根没有觉，嗅香和鼻根就没关系，嗅香这件事不成立。身识如果在身体之外感觉冷了、渴了，而身体却没有感觉，因为是两个个体，互不相干，身体没有感觉，那么感觉冷和渴这件事是不成立的。</p><p>原文：<strong>佛告阿难。若汝觉了。知见之心。实在身外。身心相外。自不相干。则心所知。身不能觉。觉在身际。心不能知。</strong></p><p>释：佛对阿难说，如果你能觉知了别的心确实在身体之外，身心就是相离的，身和心既没有联系也不相干。那么识心所感知到的，身体就感觉不到；身体上有感觉，识心就不知道。</p><p>比如花和眼根相触，你能不能看见花呢？眼根和眼识分离，身体上没有识心，就看不见花，虽然花在眼前，和眼根能接触，但是眼识看不见花，就等于你没有看见花一样。因为眼根、身体、和识心分离了，眼根触花，眼识不触花，眼识不触花，就看不见花，等于你没看见花一样。如果身体之外的识心能看见花，可是身体就觉知不到花，看花这件事就与身体无关，也等于没有看花一样。眼根和眼识不能共同来触一个色尘，身体和识心不能合和运作，功能就不能互相代替，否则死人也能看见花。</p><p>耳识也是，耳根那地方有声音，声音触到耳根了，耳识却听不见，那就等于没有听见声音一样，听声这件事就不成立，否则死人也能听声音。因为耳根和耳识是两个个体，它们不能共同和合触一个声尘。鼻根和味尘相触，但是没有鼻识，鼻识在身体之外，就嗅不到气味。因此别人打了你一巴掌，触尘和身根相接触，但是没有身识，身识在身体之外，不能感觉被打，也不觉得疼痛，如果五识、六识都在身体之外，那么无异于死人一样。如果身体之外的五识有知，而身体没有知，就等于无知觉一样。</p><p>原文：<strong>我今示汝。兜罗绵手。汝眼见时。心分别不。阿难答言。如是世尊。佛告阿难。若相知者。云何在外。是故应知。汝言觉了。能知之心。住在身外。无有是处。</strong></p><p>释：佛说：阿难，我让你看看我的兜罗绵手，你眼睛看见我的手时，识心分别了吗？阿难说：是的，世尊，我识心分别出来了，看见佛的手了。佛告诉阿难说：如果眼睛和识心都同时知道了，识心怎么能在身体外呢？所以你应该知道，你所说的能觉知能分别的识心在身体外，根本是不对的。既然你看见了我的手，说明不仅你的眼根触了我的手相，你的识心也同时触到了我的手相，了知了我的手相，这说明你的眼根和识心合在一起，是一体的，识心并不在你的身外，识心在身外这个说法不成立。</p><p>我们学佛就要学佛的大智慧，学佛的严谨、周密、细致的逻辑思惟推理能力，我们看佛的逻辑思惟都非常严密，任何人都无懈可击。佛在世弘法的时候，也经常跟外道辩论，可是佛提出一个论点，说出一个论据，那些外道们从来都辩论不了，而佛能把外道的论点、论据全都能攻破，所以佛的因明学是非常圆满严密的，能摧破一切外道的言论，佛自己的立论，外道却永远不能摧伏。这是佛成就的大智慧，说明佛的因明学已经圆满具足，对于一切法都达到了无学。</p><p>我们也应该跟佛好好学因明学，作论时，先提出自己正确如实的论点，之后找证据证明其正确可信性，论据一定要能把论点说明清楚，让自己的论点证据确凿。这样对方就无法攻破你的论点，从中找不出一个破绽来。证明论点时，不仅要从正面提出论据证明，还要从反方面和侧面提出不同的论据证明，多方面的论据都要充分，才能说明自己的论点是正确的。对方在各个方面都找不出破绽，不能破除你的论点，他只有承认你的观点正确，这样你就把众生度了。</p></div>"
},{
    "title": "第三节 第三处征心—识心潜伏根内",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  第三处征心——识心潜伏根内</strong></p><p>原文：<strong>阿难白佛言。世尊。如佛所言。不见内故。不居身内。身心相知。不相离故。不在身外。我今思惟。知在一处。</strong></p><p>释：阿难对佛说：世尊，就如佛所说的那样，识心看不见身体内，就不住在身体内；身体和识心还能共同觉知，不相分离，识心就不在身外。我现在思惟以后证得识心是在一个地方。</p><p>阿难说识心不见内，不见五脏六腑，不能居在身体内。如果眼识不见五脏六腑，肯定不在身体之内，内是指五脏六腑、筋骨和肌肉、血液等等。佛说法破识心在七处，主要以眼识心为例说明六识心不见内就不在身体内，把眼识心不在内外中间、不在七处都证明了，那就同理可证，其它的识如耳识、鼻识、舌识、身识、意识都不在身体的内外中间，都不在七处。</p><p>阿难说身体和识心又互相有连带关系，因为这个连带关系，才能共同和合运作，了知外物，所以身体和识心是不能相离的。既然身体和识心不能离开，那么识心就不在身体的外边；如果在身体的外边，就和身体分开了，成为两个个体，两个个体不能在一起合和运作同时起用，不能了知外物。阿难现在懂得这两点以后，又提出一个论点来，当然他的思惟是识心意识情思意解，他没有经过深细的论证和思惟，思想观点还比较肤浅，论点是不对的，提出的论据也不对。</p><p>原文：<strong>佛言。处今何在。阿难言。此了知心。既不知内。而能见外。如我思忖。潜伏根里。犹如有人。取琉璃碗。合其两眼。</strong></p><p>释：佛说：识心在什么地方？阿难说：这个了知心既然不在身体内，还能看见身体外，就像我考虑思量的那样应该藏在根里。就像有人拿一个琉璃碗扣在眼根上一样。</p><p>以眼根为例，眼识心潜伏在眼根里，同理耳识心肯定潜伏在耳根里，鼻识心要潜伏在鼻根里，舌识心要潜伏在舌根里，身识心要潜伏在身根里。意识心的根叫意根、第七识、末那识，意识心就潜伏在意根里。我们这一看就知道不对了，意识心不能潜伏在意根里，为什么呢？因为意根无形无相，是没有里外的，那意识心怎么能潜伏在意根里呢？这一点以后再说。</p><p>阿难把识心潜伏在根里的论点提出来以后，接着提出了论据，想要证明自己论点的正确性。阿难说，就像有人取来两个琉璃碗，扣在自己的眼根上，合就是合在一起，就是把琉璃碗和眼根合在一起了，左边一个，右边一个。琉璃碗是一个透明体，它的形状就像我们吃饭或者盛物用的小碗一样，边是圆的，中间是凹凸的，琉璃碗的边缘肯定要和眼睛合在一起，扣在眼根周围。它不可能合在眼球上和眼的玻璃体上，合不上去，即使能合眼球也会受不了，肯定是合在眼框上。因为琉璃碗既是圆的，又是凹凸的，中间有空隙，琉璃碗的底就在眼根外边，也是透明的，和眼根相对，之间有一个距离，叫作空间。</p><p>因为琉璃碗的底部和眼根有一定的空间，琉璃的底部就能在眼根上成像，最初在眼根玻璃体上成的像是倒立的，等到这个倒立的像从眼根视网膜、玻璃体那里通过视觉神经元传导到后脑那个地方时，就变成一个正立的像，又倒过来了。然后后脑胜义根里的影像与胜义根接触，如来藏就出生眼识，眼识就能分别琉璃底部的影像，看见的是和外边的玻璃碗的底部一模一样的正影。最初成像是倒立的，然后第二次成像又正过来，我们看见的是经过二次变现所形成的像，和外物非常相似。</p><p>在后脑处二次成的像叫作影子，我们看见和了别的都是影子，觉得这个影子就是外边的实物，因为和外边实物一模一样，看不出是虚幻出来的，于是我们所有人就把影子当作真实的，认为自己看见的是真实东西，从来不怀疑自己所见是否是真实的，因此而生起贪执，就被拘束在六道轮回里受苦无量。其实每个众生看见的都是真实物的那个影子，因为是通过眼根的二次成像形成的，这些在初中物理学上都讲了。</p><p>取琉璃碗扣在眼根上，眼根就能看见这个琉璃碗。如果不用琉璃碗，现代化的辅助眼睛视觉的工具是什么呢？就是有形眼镜和隐形眼镜，有外边带框的眼镜，是在眼睛外边带着的。还有一个是隐形眼镜，隐形眼镜是一层膜，这个膜非常轻柔，可以和眼睛的玻璃体、眼球贴在一起，而不伤眼球。贴在一起眼睛与隐形眼镜就没有空间没有距离了，眼识的出生就缺少了一个缘，那么隐形的镜片，就不能在眼睛的玻璃体上成像，既然不能在眼根上成像，也就不能在后脑那地方再次成像。</p><p>二次成像一次都没有成，那么眼识就分别不了隐形眼镜，因为不能出生眼识的缘故。但是外边带框的眼镜，因为和眼根、玻璃体有一段距离，眼识出生的条件具足时，眼识就能分别带框的眼镜，但是不能分别隐藏在眼球上的隐形的眼镜，就是因为中间没有距离的缘故。因为眼识见色要有九个缘，就是九个条件，其中一个条件就是要有空间距离，空间距离就是为了成像而用的，物体和眼睛要有空间距离才能成像。成的像一开始是倒影，倒影再往后传到后脑胜义根那里，再倒过来就是正影，所以最后眼识分别的就是正影，其实眼识是不在眼根那里的。</p><p>原文：<strong>虽有物合。而不留碍。彼根随见。随即分别。</strong></p><p>释：阿难说用琉璃碗合上两个眼睛，虽然眼根和物体合在一起，但是物体并不妨碍眼根的见色功能，眼根能够透过琉璃碗物体，看见琉璃碗之外的物质色尘。那么眼根随着它所接触的外物，随即就能分别物体了。</p><p>随就是随时随地，碰到什么就能见什么，分别什么就能知道是什么。即就是马上的意思，几乎是同时的，其实这之间还是有一个非常短暂的时间差，不是物来了真的同时就能见物，中间还有一个刹那的传导过程。这个传导过程太快了，我们眼识根本分辨不出来，就觉得是物来同时就看见物了，其实是物来了一会，一刹那两刹那之后，我们才看见这个物，不是同时看见的。其实能分别的还是识心，是眼识心的分别性，也是眼的见性，分别之后就了别了色尘。</p><p>原文：<strong>然我觉了。能知之心。不见内者。为在根故。分明瞩外。无障碍者。潜根内故。</strong></p><p>释：然而我能觉了了知万物的心，能知晓万物的识心，不见身体之内的物质，是因为识心潜伏在根里的缘故。识心不能见到身体里的五脏六腑，但是能够通过眼根毫无障碍的看见眼根外边的物质色法，是因为识心潜藏在根里的缘故。</p><p>既然识心在根里，就应该在了别身体外的同时也应该能了别根身，比如说眼识在眼根之内，在看到身体外部世界的同时，应该能看见眼皮，应该能看见眼球，能看见玻璃体，能看见视网膜。可是我们现在睁眼看看，却看不到自己的眼睛，说明眼识在眼根里根本不对。</p><p>阿难又提出了第三个论点说：识心潜在根内。为了证明自己的论点是正确的，阿难就说了一个琉璃碗的譬喻：譬如有人拿透明的琉璃碗扣在眼根（这里主要指眼浮尘根即眼根）上，虽然有透明琉璃碗扣在眼根上，眼睛还是可以毫无障碍的看见琉璃碗外边的色尘。</p><p>这里把眼识类比成眼睛，眼根类比成琉璃碗，眼识潜藏在眼根内，既不与眼根分离，也不用见身体内，还能与眼根和合运作，眼根触到色尘的同时，眼识也就了别到了色尘。阿难认为他这次提的论点，貌似解决了佛陀驳斥他提出的矛盾点——识心不在身内也不在身外的问题，他想这回应该对了。这回也不对，阿难说完这个譬喻，佛就从正反两方面破阿难的论点，使得这个论点不成立，最后阿难就无话可说，承认了自己的论点是错误的。</p><p>原文：<strong>佛告阿难。如汝所言。潜根内者。犹如琉璃。彼人当以。琉璃笼眼。当见山河。见琉璃否。</strong></p><p>释：佛问阿难，就像你刚才所说的，眼识潜藏在眼根之内，识心都潜藏在根之内，就像琉璃碗一样，有人用琉璃碗扣在眼根上能看见山河，是否还能看见琉璃碗？你看见了琉璃碗外边的山河大地，但是这个琉璃碗你是不是能看得见呢？</p><p>琉璃碗现在比喻为眼根了，眼根相当于琉璃碗，识心就相当于扣着琉璃碗的那个眼根。你说眼根外扣一个琉璃碗，眼根能见琉璃碗外边的物质；如果你这个结论成立，眼识在眼根之内，眼根在眼识之外，那你的眼识能通过眼根见到外物吗？</p><p>原文：<strong>如是世尊。是人当以。琉璃笼眼。实见琉璃。佛告阿难。汝心若同。琉璃合者。当见山河。何不见眼。</strong></p><p>释：阿难不加思索就回答：是的，世尊，如果有人把琉璃碗扣在眼根上，这个人当然能看见琉璃碗。佛对阿难说：你的眼识如果和琉璃合在一起，还能看见琉璃和琉璃之外的山河大地，为什么却看不见眼根呢？眼识如果在眼根之内，和眼根合在一起了，能看见山河大地，也应该能看见眼根，为什么看不见自己的眼根呢？</p><p>如果识心在眼根里，是应该能看见眼根的。任何人都看不见自己的眼根，看不见视网膜、看不见玻璃体、也看不见传导神经，说明眼识不与眼根合，不在眼根里。佛不用阿难回答，就把阿难的论点破了。</p><p>原文：<strong>若见眼者。眼即同境。不得成随。若不能见。云何说言。此了知心。潜在根内。如琉璃合。是故应知。汝言觉了。能知之心。潜伏根里。如琉璃合。无有是处。</strong></p><p>释：佛又接着说：如果你的眼识能够看见眼根，那你的眼根就和外边的山河大地一样，都是一种六尘境界相，不是眼根，不能起着眼根的作用。如果识心不能看见眼根，你怎么能说那个能了知的识心潜藏在眼根内，就像眼根与琉璃碗合在一起一样？因此你应当知道，你所说的觉知心潜伏在根里就像与琉璃碗合一样，是一无是处没有道理的。</p><p>眼识如果能看见眼根的话，眼根就和外边的山河大地一样，是同一种性质的东西，不是根。如果你的眼识看不见眼根的话，那你说的琉璃碗能合的譬喻是不对的，说眼识能看见眼根也不对，不能看见也不对。眼根通过琉璃碗能看见外物，眼识就在眼根之内这个论据是不对的，论据错误，论点也是错误的。佛从正反这两方面都把阿难的论据破了，论点也就不成立。</p><p>这地方稍微复杂一点，细心体会就能明白，阿难把眼根比喻成琉璃碗，又把眼识比喻为眼根，这样一比对，我们就知道了，琉璃碗那个比喻不对，那眼识在眼根之内的这个类比也是错误的。</p><p>佛以眼根眼识这一个例子，来说明识心不在根里，同理可证，耳识不在耳根里，鼻识不在鼻根里，舌识不在舌根里，身识不在身根里，意识不在意根里。这几个识怎么破呢？来个反证吧，如果耳识在耳根里，肯定能听见耳根里的声音，耳根里有什么声音呢？耳根听声音时鼓膜要震动才有声音，如果耳识潜藏在耳根里，听见声音的同时我们应该也能听见鼓膜震动的声音，可是我们却听不见耳根鼓膜振动的声音，只能听到外界的声音，那就说明耳识不在耳根内。</p><p>破鼻识不在鼻根之内，鼻识如果在鼻根之内，应该能嗅到鼻根之内的味道。鼻根之内有什么气味？鼻根之内的气味有生肉味、血肉味，可是鼻识却闻不到自己鼻根的血肉味，就说明鼻识不在鼻根之内。</p><p>再一个舌识，舌根属于身体里的一部分，有身根和舌根两种作用。舌识如果在舌根之内，那么舌根的血腥的味道，肉的味道，舌识应该品尝到，可是舌识品尝不到舌根里的血肉味，那就说明了舌识不在舌根之内。</p><p>身识是感觉触尘的，身识如果在身体之内，身体之内的触尘如冷热、软硬等触都属于触尘，你被碰了一下时细胞挤压触神经形成了触觉，为什么你感觉不到放电本身电流的感觉呢？再比如身体之内的骨头是硬的，身识应该知道，可是身识感觉不到骨头是硬的，触不到骨头，身体里的血液是温的热的，可是身识感觉不到血液的温度。再有血液是流动的，流动性和身根相触，就有触尘，可是身识感觉不到血液的流动。因此从种种方面只能说明身识不在身根之内，这就破了前五识在前五根内的错误论点了。</p><p>还有一个意识，意识好破，如果意识在意根之内，那我们就想，意根是第七识，第七识不属于物质色法，属于识心；识心是没有形没有相，没有阻碍的。既然意根没有形没有相，没有阻碍，意根就没有里也没有外，意识心怎么能在意根里呢？如果意识心在意根里，那么意根所了别的法，意识心也能了别；可是意根了别了那么多的法，意识心却都不知道，如果知道了，就叫作神通。意根了别的业种，意识心不知道，意根的打算，意识不知道，意根能了别其它世界的那些法、了别前世，意识都了别不了，说明意识心不在意根之内。这样就把六识在六根之内这个论点都破了，最后说明识心不在六根之内，识心不在根内。这就是第三处征心。</p></div>"
},{
    "title": "第四节 第四处征心—开眼见明闭眼见暗",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第四节  第四处征心——开眼见明闭眼见暗</strong></p><p>原文：<strong>阿难白佛言。世尊。我今又作。如是思惟。是众生身。腑藏在中。窍穴居外。有藏则暗。有窍则明。</strong></p><p>释：阿难说我现在又作如下的思惟，每一个众生的身体中，五脏六腑都隐藏在身体之内，（腑藏在中，这个不念藏（丈音），念藏（尝音），藏是藏着、隐藏的意思。）五根中的眼窍耳窍鼻窍舌窍身窍都处于身体的外面。只要藏在身体里的就显示暗色，开窍于身体外面的就显示明色。</p><p>窍穴居外，窍是里外相通的通道，穴就是穴位，里外相通的穴位叫作窍穴，主要指眼根等四根，包括身根，身根全部通于外界，全部都是明的。阿难说众生的五脏六腑隐藏在身体之内是黑暗的，识心看见黑暗就等于看见五脏六腑，所以识心是在身体内，这是阿难的观点。阿难认为识心在身体里，就能通过眼根这个窍穴看见眼根外边的光明和色空等相，这些都属于外色。阿难举出这两点想说明识心还是在身体里。</p><p>原文：<strong>今我对佛。开眼见明。名为见外。闭眼见暗。名为见内。是义云何。</strong></p><p>释：阿难说：我现在面对着佛，睁开眼睛就看见了光明，这叫作看见身体的外面。我把眼睛闭上，就看见了黑暗，这叫作看见身体之内。我这个观点是对还是错？</p><p>阿难用开眼见明，说明识心就在身体之内，才能透过眼根这个窍穴看见外边的光明，也看见了佛，这样就等于看见了外面，所以说识心在身体里能看见外边。当闭上眼睛看见黑暗时，因为识心在身体里，不通过眼窍看身体外了，这回是看身体里，于是就看见了黑暗，看见黑暗就等于看见身体内的五脏六腑。因为身体内没有光明，全是黑暗，那我看见黑暗就等于看见身体内。阿难以这个论据就想证明眼识在身体之内，他说完以后，其实心里还是没有把握，就问佛他说的这个道理怎么样，对不对。</p><p>佛把阿难的三个立论都破除以后，阿难又想出一个观点，告诉佛说：这个识心开眼能见外，闭眼能见内，识心在身体内。论据是什么，怎么证明识心还是在身体内呢？阿难说了两点：第一点是，开眼能见明，因为识心在身体里，光明在身体外，一睁开眼睛就能看见光明，看见外边了，这说明识心肯定在身体里；第二点是，眼睛一闭上就看见了黑暗，因为身体里面没有光明，五脏六腑是黑暗的，黑暗就等于自己的五脏六腑，看见黑暗就等于看见身体里的五脏六腑了。阿难提出这两点来证明他的第四个立论。</p><p>原文：<strong>佛告阿难。汝当闭眼。见暗之时。此暗境界。为与眼对。为不对眼。若与眼对。暗在眼前。云何成内。若成内者。居暗室中。无日月灯。此室暗中。皆汝焦腑。若不对者。云何成见。</strong></p><p>释：佛问阿难：当你闭上眼睛看见黑暗的时候，此暗境界是与眼根相对的，还是不相对的？如果黑暗与眼根是相对的，那么黑暗就在眼前，既然在眼前，黑暗怎么能在身体内呢？如果黑暗是在身体之内，是你的五脏六腑，那么你住在黑暗的房间内，没有太阳月亮和灯光，这个房间所有的黑暗都应该是你的三焦五脏六腑。如果黑暗不与你的眼根相对，怎么能有你识心的见呢？</p><p>第一个论据开眼见光明，佛就不破他了，佛专门破他闭眼见暗这个说法，这个论据证明不了识心在身体内。第二个论据闭眼见暗，佛分两种情况来破，每种情况再从正反两方面破，这样就把闭眼见暗这个论据推倒，随即就把识心在身体之内的论点破除。</p><p>闭眼见暗的说法，佛从两方面来破。佛问阿难，当你闭眼看见黑暗时，黑暗是在你的眼前呢，还是不在你的眼前？不管怎么说，佛从两方面都会推倒识心在身体里的论点。第一方面，佛说黑暗如果与你阿难的眼根相对，那么黑暗就在你的眼前；但是黑暗在眼前时，黑暗不在身体里，黑暗就不是你的内脏。</p><p>佛说如果黑暗与你的眼根是相对的，在你的眼前，那黑暗怎么成了你的五脏六腑了呢？这个不对啊。所以闭眼见暗，并不是见的身体里的黑暗，识心在身体里的说法不成立，这是从正的方面破。光明是一种境界，与光明相反的就是黑暗，黑暗也是一种境界，都属于眼识所见的色尘。黑暗境界如果与眼根相对，黑暗境界就在你的眼前，眼根在身体表面，或者说是外面，不在身体内，与阿难说的论据见暗就是见内是相反的。</p><p>退一步说，黑暗与眼根相对，也属于身体内的五脏六腑，那么当你居住在黑暗的房间里时，这个房间里既没有日的光明，也没有月的光明，也没有灯的光明，房间里的黑暗都应该是你的五脏六腑，可是这是不可能的。因为你阿难说看见黑暗就等于看见五脏六腑了，你在特别黑暗的房间里，房间里的黑暗不就成了你的五脏六腑了吗？这样佛就破了黑暗与眼根相对的论据。</p><p>从另一方面说，黑暗如果不与眼根相对，不在你的眼前，而在身体里，属于身体里的五脏六腑，眼前就没有黑暗。那么根尘就不相对，也就没有识的出生，那就不能有见。既然没有黑暗就见不到黑暗了，也就没有识心的见了。识心在身体里闭眼见暗的说法就不成立。这样的话，黑暗与眼根相对是错误的，不与眼根相对也是错误的，不管黑暗在你的眼前，还是在你的身体里，这两方面都不对。</p><p>原文：<strong>若离外见。内对所成。合眼见暗。名为身中。开眼见明。何不见面。若不见面。内对不成。</strong></p><p>释：如果离开外面能有见，眼根与黑暗的身内相对成立的话，闭上眼睛能够看见黑暗，就叫作看见身体内了，那么如果把眼睛睁开看见光明的时候，你为什么却看不见脸面呢？（所以说识心不在身体里）如果开眼不能见到自己的面孔，眼根与身体内的黑暗相对就不成立。（所以说眼根不与身体里的黑暗相对，闭眼见暗就不成立，识心就不在身体里不在窍穴里不在五根里。）</p><p>佛说如果闭上眼睛看见了黑暗，就等于看见身体内、看见五脏六腑了，识心在你的身体当中，能看见身体里的黑暗，你这个说法能成立的话，那么把眼睛睁开，你的识心通过眼根能看见外边的光明，也应该看见你自己的脸。脸在你眼根外边，你的识心在身体内，通过身体和眼根，应该先看见脸。如果你的识心看不见你的脸，识心就不在身体里，不和五脏六腑相对。</p><p>原文：<strong>见面若成。此了知心。及与眼根。乃在虚空。何成在内。</strong></p><p>释：佛说如果你的识心能看见你的脸，这件事情成立的话，那么能看见脸的识心以及你的眼根，应该在虚空里，怎么能说在身体内呢？</p><p>识心与眼根一定是合在一起起用不能分开的，识心如果能看见自己的脸，那么就与脸相对，在脸的外边，眼根也应该在脸的外边，和脸相对。如果识心和眼根在脸的外边，就等于在虚空里，那你怎么能说识心在身体内呢？这不是互相矛盾了吗？况且眼根明明是在脸上，不在身体里，也不在虚空里。这样佛就彻底否定了阿难的论点，识心在身体里的立论不成立。</p><p>原文：<strong>若在虚空。自非汝体。即应如来。今见汝面。亦是汝身。汝眼已知。身合非觉。必汝执言。身眼两觉。应有二知。即汝一身。应成两佛。是故应知。汝言见暗。名见内者。无有是处。</strong></p><p>释：如果你的识心和眼根在虚空里，那就不属于你身体拥有的；如果是属于你身体拥有的，现在面对着如来，我能看见你的脸面，那么我也是你的身体。你的眼识已经有个知觉识别性了，你的身体却没有觉知，如果你阿难一定要执著说，身体也有一个觉，眼识眼根各有一个觉，那就应该有两个知觉性，那你阿难一个人就成了两尊佛。因此你应该知道，你所说的看见黑暗祭祀看见身体内的说法，是不对的。</p><p>佛说如果一身有两个知觉，一个人就有两个个体，一个是身体一个是眼识和眼根，这两个个体是互相独立的，就应该有两个如来藏。身体有一个如来藏，能成为一尊佛，身体外虚空中的识心和眼根也有知性，也应该有如来藏，能成为一尊佛，否则就没有眼根也没有知性。如果你有两个如来藏，那么你一个众生身就成了两尊佛，这显然是不成立的。</p><p>佛从这几方面来破阿难，就得出一个结论，你阿难说的见暗名见内者，无有是处。佛在这里从黑暗与眼根是相对还是不相对，这两方面来破阿难的观点，如果不相对，又从两方面来破，层层递进，把阿难所有可能成立的证据都给破除了，哪方面也不成立，都不能证明识心在身体之内能够看见身体之内的五脏六腑。第四处征心，开眼能见明，闭眼能见暗，这个立论就破除了。</p></div>"
},{
    "title": "第五节 第五处征心—随所合处心则随有",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第五节  第五处征心—随所合处心则随有</strong></p><p>原文：<strong>阿难言。我尝闻佛。开示四众。由心生故。种种法生。由法生故。种种心生。</strong></p><p>释：阿难对佛说，我常常听见佛对四众弟子（四众是指出家男女二众与在家男女二众，合起来就是佛的四众弟子。）开示说，由于心出生的缘故，各种法就随着出生了；又由于各种法的出生，于此相应的心就出生了。</p><p>能被出生的心，不是不生不灭的真实心，是被真实心出生的七识心，七识心出生以后，八个识和合运行就产生了三界世间万法。七识心出生以后，三能变识和合运作，五阴之法、十八界之法、宇宙器世间、三界世间万法就出生了，众生所需要的十八界法就出生了。只有如来藏不能单独出生五阴世间法，必须有后天出生的七识心配合如来藏，才能产生这些法，尤其是有第七识的存在，祂能引导如来藏出生三界世间法。后天出生的就是妄心，七个妄心是由如来藏输送识种子所形成的，七识心生出来以后就开始运行，身口意行出现，八个识就共同造作出一切法。</p><p>由法生故，种种心生，三界世间万法出生了以后，又导致了种种心的出生。种种心不是一种心，是依法出生的前六个识心，什么法对应着什么心，种种心也是后出生的，就是生灭的妄心，不是真心。这一句话代表了虚妄的唯识门。唯识门有两个，一个是真实唯识门，一个是虚妄唯识门。真实唯识门是指三界唯心，三界是指欲界、色界、无色界，一个大千世间、无数大千世界的三界世间全部是由一个心出生的，这个心就是真实的如来藏心，这是三界唯心的意思。一切法、三界世间法，都是由如来藏用大种性自性出生的，如来藏的七大种子输送出来，就能产生三界世间万法，这叫三界唯心。</p><p>三界唯心后边还有一个万法唯识，万法唯识是指虚妄唯识门。万法也都属于三界世间法，三界世间法虽然都是由如来藏生出，但是若只有如来藏，则不能出生三界世间万法，必须有虚妄唯识门，虚妄的七识配合真心如来藏，八个识合和运作，才能出生三界世间万法，这就是三能变识的功能作用。虚妄唯识门是指虚妄识心配合真实心，三能变识共同合和运作，产生出三界世间万法。虽然三界世间万法，都是由如来藏自己单独用种子变现出来的，但是这同时需要七识妄心的和合运作与配合。</p><p>虚妄唯识门首先有意根第七识，然后再出生六识，七识与如来藏一起和合出生万法。如来藏输送识种子，意根的识种子刹那刹那出生，刹那刹那灭去，第七识才能现行运作。第七识意根一运作就向外贪求，如来藏配合意根产生了宇宙器世间，产生身根，再出生六识，这样五阴具足，三界世间万法就这样出生了。单有如来藏不能产生三界世间万法，单有七识，没有如来藏，就没有种子，也不能产生三界世间万法。必须是如来藏、第七识意根、前六识这三个能变识合和运作，才能出生五阴世间的三界世间万法，能变识指能变三界世间万法的识。</p><p>三界世间万法出生了以后，种种心随之出生，种种心就是指六识心。比如说色尘出生了以后，色尘法尘和根之间根尘相触，如来藏出生六识，眼识心、意识心就出生了；声音这一法出生以后，与耳根相触，如来藏出生耳识，又出生意识，耳识意识就了别了声尘，这是由法生故种种心生的意思。</p><p>种种心生，种种法再生出来，心法互相为缘，如来藏为因，循环往复，生生不已，众生的生死轮回就这样延续下去了。这里面到底谁出生谁呢？比如说意根现在想打字，这是意根的心生出来了，意根想打字，如来藏配合，出生六识，六识就有身口意行，六识运作时就在手机上电脑上打字。这样由意根这个心出生，又出生六识，六识七识合和运作就产生了打字这一法，文字就从电脑手机上一个字一个字打出来，身口意的行为造作就出来了。身行打字，口行起观，意行思惟，身口意行合和运作，身口意行的法出生，文字文章等等法就出生了。</p><p>种种法出生了以后，种种根与种种尘再接触，又产生了种种识心—六识心。比如打出了文字以后，第七识想要校对，如来藏就配合出生六识，六识就开始在电脑手机上，对着文字进行校对修改，眼识意识看着文字，意识思惟文字，身识和意识在电脑手机上对文字修改、润色，身口意行再次造作出来了。心生，法就生，法出生了以后，又产生了种种识心，不断的运行造作，产生了新的身口意行。整个这句话就是先有心，心出生，那是指意根，意根要造作，如来藏配合出生六识；那么六识和七识合和运作产生法。这些法产生出来后，意根又有心行，如来藏再配合出生六识，六识心再有身口意行的造作，出生了种种法。</p><p>这样就不断循环往复，由心生故，种种法生；由法生故，种种心生。心能出生法，是出生法的一个缘，法出生了以后，法也是出生六识心的一个缘。心法互相为缘，互生互助，这样诸法再加上六七识心就不断的出生，不断的运行，众生的五阴世间就生生不已，无有止境。这是三界唯心、万法唯识，八个识合和运作产生世间一切法的真实含义。</p><p>原文：<strong>我今思惟。即思惟体。实我心性。随所合处。心则随有。亦非内外。中间三处。</strong></p><p>释：阿难说，我现在能思惟的就是思惟的心体，这个心体确实是我的心性。随着根与法相合之处，心就随着出现了，也不是在身体的内、外和中间三处。</p><p>阿难把自己能思考缘虑、能打算、能计划的心体当作自己的真实心，其实这还是生灭的意识心，这句话一说出来，还很肯定的说这就是我的真心，这无异于认妄为真。</p><p>合处一般是指六根合于六尘之处，比如说色尘出现，眼根与色尘合，识心就生出来了，当根和色尘合一起时，心就显现出来了；耳根与声音合一起，耳识心就出现了；鼻根和香尘合在一起，鼻识心就出现了；舌根与味尘合到一起，舌识心就在味尘上出现了；触尘上也如是，法尘上也如是。只要有法出现，法就和根合在一起，识心就在此处显现出来。</p><p>阿难的意思是，我的心是随着尘的出现而出现的，这样出现的心没有处所，既不是在身体内，也不是在身体外，也不在身体中间，三处都不在。因为之前佛否定了识心在身体的内外中间三处，阿难就避开这三处而征心所在，这回阿难确认自己的心确实不在内外中间三处，而是在法尘出现的地方随时而有，随所合处就有我的心在。阿难就把自己能思惟的心当成他自己真实的心性，认妄为真，能思惟的心当然是意识心的体性，是生灭虚妄的，阿难此时还没有认识到这一点。</p><p>原文：<strong>佛告阿难。汝今说言。由法生故。种种心生。随所合处。心随有者。是心无体。则无所合。若无有体。而能合者。则十九界。因七尘合。是义不然。</strong></p><p>释：佛告诉阿难说，你现在说由法出生的缘故种种心就生出来了，随着法所合处，心就随着出现了，可是这样的心是没有自体的，那就不能合。如果心没有自体也能合的话，就相当于有个十九界，是因为心与第七尘境合起来而出现的一样，这是没有道理的。</p><p>阿难说的这个心是没有自体的，因为是被生出来的，又是由法决定的，没有法就没有心，这样的心无法决定自己的存在，就不能与法合在一起。如果你这个心没有体，而能和法合到一起，那就意味着有个十九界，是因为七尘合而出现的。第七尘境是子虚乌有的，没有任何相貌和自体，无法合起来成为第十九界。除了六根六尘六识十八界之外，那第十九界怎么也找不到；如果有第十九界的存在，那也是因为有第七尘，与六根六尘六识和合起来成为了十九界，事实上这是不可能的。同理，六识也是没有自体的，没有来处和去处，没有固定处所如何能合？六识不能合，就不能说随所合处心则随有。</p><p>七尘和第十九界就相当于乌龟的毛和兔子的角，子虚乌有。能思惟的识心与龟毛兔角同样都是虚妄没有体，没有体的不能合，与什么法也不能合到一起，那么随所合处心则随有是不对的。</p><p>原文：<strong>若有体者。如汝以手。自挃其体。汝所知心。为复内出。为从外入。若复内出。还见身中。若从外来。先合见面。阿难言。见是其眼。心知非眼。为见非义。</strong></p><p>释：如果你说的这个心是有体的，就比如你用手自己碰触自己的身体，然后有个能觉知的心就出现了，这个觉知心是从身体里出来的，还是从身体外进去的？如果你这个能觉知的识心是从你的身体内出来的，知道自己碰触了自己，你这个识心就能看见身体内；如果这个觉知心是从身体外进来的，就应该先看见自己的脸。阿难辩驳说，见面和见一切法是眼根见，不是心知；知是心知，不是眼根知，心知是识心的作用，能看见脸是眼睛看的，不是眼识心。</p><p>佛又退一步假设说，如果你阿难说的这个识心是有体的，那你这个心体是从身体里面出来的，还是从外面进来的？比如你拿你自己的手碰触你的胳膊、碰触你的腿、或者摸触你的脸，那碰触摸触了以后就是身根与法合到一起了，这时就有一个能感知的心出现了，就知道自己碰触了自己。那你这个能知的识心是从哪里来的呢？是从身体内出来的，还是从身体外边入进来的呢？ </p><p>如果心是从身体里出来的，应该知道身体里的情况，比如说血液流动、筋转脉摇、肌肉骨骼、身体内温度以及身体内种种的情况，身体里的东西你都应该能见得到。可是你的心现在并不知道身体里的情况，血液流动的情况不知道，体温情况不知道，肌肉骨骼情况不知道，内里的气体运行的情况不知道，细胞的新陈代谢也不知道，身体里的情况都不知道，那说明你这个识心不是从身体里面出来的。</p><p>如果你这个能知的识心，是从身体外入进来的，知道自己碰触了自己，那么你这个能知的识心，应该先看见自己的脸；可是你现在看不见自己的脸，那就说明识心不是从身体外边入进来的。所以说识心既不从里出，也不从外面入，那就说明识心没有体，是虚妄的。佛这段话说明，没有自体的心随所合处则有是不对的。</p><p>原文：<strong>佛言。若眼能见。汝在室中。门能见不。则诸已死。尚有眼存。应皆见物。若见物者。云何名死。</strong></p><p>释：佛说如果眼根能看见的话，你在房间里，门能看见吗？如果门能看见，那些已经死了还有眼睛存在的人，应该都能看见物。如果死人眼睛能看见物，那什么叫作死亡？</p><p>这是很关键的类比，比如说阿难在屋子里，通过门能看见门外的物体。这个门比喻为阿难的眼根，在屋子里的阿难比喻为识心，佛说如果你的眼根能看见外边的色尘，那屋子里的门就应该能看见外边的物体，门就相当于你的眼睛，识心就相当于屋子里的阿难你。那你看看现在，能见外边色尘的，是门见还是识心的阿难你见的？是眼根见的还是眼识见的？</p><p>佛说如果门能看见外边的色尘，那就类比说如果你阿难的眼根能看见外边色尘的话，那么已经死去的人都有眼根，死人也应该都能看见物体了；如果死人也能看见物体的话，他们怎么能叫作死人呢？应该还是活人才对。以上类比和比喻把阿难的观点都否定了，说明能见物的是识心，不是根。如果是根能见，死人也有根，死人也能见；可是死人不能见物，死人如果能见物，他就没有死。</p><p>你阿难的眼根相当于门框一样，如果门框不能看见外边的色尘，那么眼根也不能见外边的色尘；看见外边色尘的是你阿难这个人，相当于你阿难的眼识，是众生的眼识识心能见，那就说明是识心能见不是根能见，这就把阿难的狡辩否定了。说明能见的不是眼，是识心。识心既然能见，现在你的识心不能见到自己的脸，说明你的识心不是从身体外边入进来的，也不是从身体里出来的，那就是说识心没有处所，没有处所就没有体。没有体就是一个虚妄的，不是你的心性，你就不能把这个能思惟之心，当作你真实的心性来悟。</p><p>原文：<strong>阿难。又汝觉了。能知之心。若必有体。为复一体。为有多体。今在汝身。为复遍体。为不遍体。若一体者。则汝以手。挃一支时。四支应觉。若咸觉者。挃应无在。 </strong></p><p>释：假如说你阿难这个能觉知的识心，一定是有体的，那我就要问你，这个体与身体是一体的还是多体的？识心在你身体里，是遍满整个身体，还是不遍满身体只在一处？如果你的能觉之心与身体是一体的，那么你用手碰触一只胳膊时，四肢都应该有知觉才对；如果四肢都有知觉，所谓的碰触就没有处所了。</p><p>假如说能觉知的心与身体是一体的，那么当你的手碰触你一只胳膊的时候，你另外一支胳膊和两条腿四肢都应该有感觉，当你碰触身体的一个处所，其它处所都应该有感觉，都应该有个知出现，可是众生都不是这样，那就说明知觉与身体不是一体的。如果碰触在一支胳膊上，四肢都应该有感觉，那还能叫碰触吗？碰触一支胳膊还有什么意义呢？碰触你的头，脚也知道，那碰触头还有什么意义呢？那就没有意义了。</p><p>原文：<strong>若挃有所。则汝一体。自不能成。若多体者。则成多人。何体为汝。</strong></p><p>释：佛又接着说，如果碰触摸触身体时是有处所的，而且全身都有感觉，那么识心与身体是一个体是不对的。假设觉知心与身体是多体的，不是一个体，那么你阿难就成了多人，哪个体是你阿难呢？</p><p>比如说碰触到你胳膊有一个心体出现，碰触到你脚上又一个心体出现，碰触自己鼻子的时候又一个心体出现，碰触自己眼睛的时候又一个心体出现，那你阿难有多少个心体呢？显然这件事是不成立的。一个心体是一个人，那你有这么多心体，你阿难就有这么多人，你把哪个心体当作阿难呢？你是把碰触胳膊的心体当作阿难，还是把碰触鼻子的心体当作阿难，还是把碰触眼睛的心体当作阿难？把哪个当作阿难都不对，所以说你阿难有多个心体是不对的。</p><p>原文：<strong>若遍体者。同前所挃。若不遍者。当汝触头。亦触其足。头有所觉。足应无知。今汝不然。是故应知。随所合处。心则随有。无有是处。</strong></p><p>释：佛说，你的知觉心体如果是遍布整个身体，就像刚才说的那样，手碰触在一处浑身上下都有感觉；如果知觉不遍整个身体，只在身体的某一处，当你触碰头部时， 再同时碰触脚部，头有感觉，脚应该没有感觉。因此你应该知道，随着法的合处，心就随有，没有一点道理。</p><p>如果知觉不遍身体，用手摸头的时候，说明知觉在头上不在脚上，你再用手去摸脚的时候，脚就应该没有知觉，可是不是这样，手碰到哪里，哪里就有感觉。如果心体在你的头部，你用手去摸自己的腰，那你的腰部应该没有感觉，可是当你用手摸腰部时，腰部确实是有感觉的，那就说明知觉心体不遍整个身体也是不对的。</p><p>佛把心体存在的几种情况都否决了，说明阿难所说的心是有体这个观点是不对的。阿难说自己的心是有体的这一个论点就是不对的，因为这个心没有体，没有体就不能合，比如说乌龟没有毛，那你就不能再往下谈乌龟毛的问题；兔子没有角，我们就不能再往下谈兔子角的任何问题，因为都是没有意义的。阿难你这个能思惟的思惟体，就是自己的真实心是不对的。这样佛就把阿难第五处征心的论点破除了。</p></div>"
},{
    "title": "第六节 第六处征心—心在中间",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第六节  第六处征心—心在中间</strong></p><p>原文：<strong>阿难白佛言。世尊。我亦闻佛。与文殊等。诸法王子。谈实相时。世尊亦言。心不在内。亦不在外。</strong></p><p>释：阿难对佛说：世尊，我也听见佛与文殊菩萨和一些法王子谈论实相时，世尊也说过心不在身体内也不在身体外。</p><p>阿难作为佛的侍者，经常随佛到各处法会听法。佛到欲界诸天时，佛也以佛的威神力加持阿难，带着阿难到欲界天宫；佛到色界諸天时，佛也以自己的威神力摄受阿难到色界天宫。佛和诸法王子谈诸法实相时，阿难跟随着佛参与法会，借佛威神在旁听法。这个事情就可以说明佛能见什么，阿难依着佛的神力也能见什么，这叫见佛所见；但是见的结果与佛就大相径庭了，因为智慧不同，佛有无上圆满之智，阿难的智慧就有业障的遮障。</p><p>那我们可以把阿难比喻为意根第七识，把佛比喻为如来藏根本心、大智慧之心，第七识随着如来藏才能有自己的见，如来藏能见什么，第七识意根随着如来藏也能见什么，但是见的法实质和程度不同，结果就截然不同。因为如来藏是大智慧之心，没有无明，祂不仅能见一切法，而且能彻法底源；而第七识意根因为有无明，就有颠倒见，不能见諸法实相。佛与阿难也是如此，佛是三界之尊，有究竟无上的大智慧，阿难无明俱在，只是声闻初果人，他以初果人的身份，作为佛的侍者，乘佛威力，随佛到世界各处，天上地下无有阻碍，到佛所到，见佛所见，就是不能到佛的大智慧境界。</p><p>当佛与菩萨们谈大乘实相法的时候，佛能见得一切法的本源相貌，彻法源底，而阿难因为无明的关系，不能得见诸法实相。他所领会的佛的法音，有很多不解和错解，当然这是阿难为协助世尊弘法故意而作的示现。佛与阿难的关系可以比喻为如来藏与意根的关系，这个比喻应该算是比较贴切的。所以才有下文，世尊和诸法王子谈实相时，阿难在旁边闻法时，不懂佛所讲实相法而生误会。</p><p>以文殊菩萨为首的诸法王子都是等觉菩萨，甚至是妙觉菩萨，祂们都是诸法王子。诸法王子是要继承法王王位的等觉妙觉大菩萨，法王是指三界世间的佛法之王、佛法之主，三界世间只有诸佛可以称为法王，是佛法之王，是世出世间一切法之王，居于王位。法王只有佛才能尊称，其他人都不能称作法王，即使是等觉菩萨、妙觉菩萨也不能称为法王，因为祂们还有佛法没有全部证得，还没有登上法王之位。</p><p>如果不是等觉菩萨、妙觉菩萨也不能接替佛的位置，所以能接佛的位置马上可以成佛的，只能是等觉菩萨、妙觉菩萨，祂们可以称作法王子，十地以下的菩萨都不能称作法王子。那么法王法主的称号，只能由佛来承担，其祂的菩萨都不能作为法王和法主，也不能自称其号。</p><p>在佛与文殊菩萨等诸法王子聚在一起谈论诸法实相时，阿难随着佛一起在会听闻，可是并没有理解諸法实相的真实义。实相的实就是如实的实，实际的实，实就表示真实，表示存在，表示有；相是相貌、行相的意思。相可以分成很多种，有色法尘相，有心法尘相，色法尘相就是色声香味触法相，心法尘相就是七识的运行行相和所有心所法，也包括第八识的运行行相和心所法。实和相合起来是真实相的意思，真实的相是真实存在的，永远不能灭，也不用被其它法出生的如来藏心体。因为实相本身是真实存在着的，所以能产生万法，因为祂真实，一切万法就能依靠祂而虚妄的存在，幻生又幻灭。</p><p>如来藏可以比喻为魔幻师，魔幻师通过意念作法，能够变现出一切的色声香味触法，变出一切的山河大地、宇宙器世间和所有众生。既然他能变幻出山河大地、宇宙器世间和各种众生等等，魔幻师必须是真实有的；如果魔幻师本身是虚幻不真实的，他不可能再变现出这些虚幻的法来。所以魔幻师一定是真实存在的法，才能够幻化出不真实的法，实相心如来藏也如是。</p><p>真实存在的如来藏，如魔幻师一样，能够变现出众生的五阴世间、三界世间、大千世间，所以三界世间也叫作一真法界。一切法都依靠着如来藏这个实相心而存在，一切法都是如来藏所幻化出来的，依靠着如来藏，才能有这些法的存在。但是一切法的存在却是幻生又幻灭的，幻化出生了，像幻化一样又灭去了，一时有一时没有，就是无常的。生灭的就是变异的，变异的就是无常的，无常、变异、生灭的法不是真实的法；真实的法没有无常性，是常存永远存在的。</p><p>如果魔幻师不是永远存在的，魔幻师一灭，他所变幻出的一切法都随着他而灭去，魔幻师灭了要如何出生，谁出生他呢？没有出生魔幻师的法，如来藏也是如此。但是宇宙大千世界、十方诸佛国土总是要存在的，这个国土灭了，那个国土又生，此时灭了彼时又生，那说明了什么？说明如来藏这个魔幻师是永远存在不灭的，所以祂才能不断的变现三界的宇宙器世间，变现着三千大千世界。只有这个永远存在的如来藏存在，一切法才能不断的生灭、变异，此法生，彼法灭，此时生，彼时灭。</p><p>原文：<strong>如我思惟。内无所见。外不相知。内无知故。在内不成。身心相知。在外非义。今相知故。复内无见。当在中间。</strong></p><p>释：如我思惟的那样，心在身体内什么也看不见，心在身体外和身体又不能互相觉知，因为不觉知身内，心就不能在身内；身心又是互相觉知的，心在身外也不成立。因为身心是互相觉知的，又不能见身内，心应当在中间。</p><p>世尊跟法王子们说诸法实相心不在内也不在外，还谈了很多，阿难可能不记得了，他只叙述出这一句话来，说心不在内也不在外，不知道这是指实相心不在内外。他现在想起了这句话，还以为是自己能够思惟的心、能推论推理的心、能爱乐佛的心不在内也不在外。</p><p>世尊说实相心不在内不在外，阿难却联想起自己的虚妄心，把自己的虚妄心当作实相心，错会是这样的严重，所以把阿难比喻为有无明的意根。类似意根的阿难是颠倒的，虽然依靠着佛世尊这个如来藏能见一切法，但是见法之后却是误会很多。仔细思惟这个比喻，就能恰当的认识第七识意根，祂能见一切法默容一切法，但是不能见得一切法的真实相，所以才有众生的六道生死轮回，才需要破除意根的一切无明。</p><p>阿难想起这句话以后，接着表述自己的观点，成为第六处征心。他说，我现在终于明白了，我那个能思惟的心能爱乐佛的心，既然看不见身体内，不了知身体之内，识心在身体之内就是不对的了；而且也不在身体外，如果在身体外，那么识心有知身体不知，这是不对的，心知身也知，身和心合在一起才能有知，知又不能离开身，一定和身联系在一起，所以识心不在身体之外。这个识心一定是在中间之处，这次他取了一个折中——在中间。</p><p>原文：<strong>佛言。汝言中间。中必不迷。非无所在。今汝推中。中何为在。为复在处。为当在身。若在身者。在边非中。在中同内。</strong></p><p>释：佛对阿难说：如果你要说有一个中间，这个中间之处一定能指出来，你一定知道中间在哪里，不会迷惑不知。如果你不知道中间在哪里，那你所得出来的中间这个结论就是错误的。这个中间一定有一个位置，那你说说这个中间到底在哪里？是在尘处，还是在身体上？如果这个中间位置在身体上，在身体之表面就是在边上，不是中间；如果中间位置是在身体中，等于是在身体内一样，同样都不对。</p><p>识心不在尘处，也不在身体和处所的中间，没有一个中间的位置。如果识心在身体上就不是中，如果说你的识心在身体中就等于在身体内一样，所以你说识心在身体中，这是不成立的，因为识心看不见身体内的五脏六腑。那么你说识心在身等于在中就错了。</p><p>原文：<strong>若在处者。为有所表。为无所表。无表同无。表则无定。何以故。如人以表。表为中时。东看则西。南观成北。表体既混。心应杂乱。</strong></p><p>释：如果说你的识心在一个处所，这个处所是是能指出来的，还是不能指出来的？如果这个处所你指不出来，那就等于没有处所，你的立论就不对了；如果这个处所能指得出来，指出来的处所也是不定的，这个处所也不一定是中间，不一定是东西南北。为什么这样说？如果有人能指出来这个叫作中间的处所，如果把这个处所作为中间，你从东边来看，这个处所就在西边；你从南边来看，这个处所却成为了北，根本没有中间。这样的话，这个能表示出来的体就混乱了，心就会随着杂乱起来。</p><p>原文：<strong>阿难言。我所说中。非此二种。如世尊言。眼色为缘。生于眼识。眼有分别。色尘无知。识生其中。则为心在。</strong></p><p>释：阿难反驳说：我所说的中间不是这两种意思，不是指在身体上，也不是指在身体的某一处所，我所说的中间没有处所，不是在什么处。正如世尊您所说的，眼根和色尘是一种助缘，出生了眼识。眼根有分别性，色尘却是无知的，可是它们一相触的时候，眼识就在其中生出来，这样识心就现前了。</p><p>阿难说，识心在眼根和色尘当中出生，这个中就指根尘之中的中。识心在眼根和色尘中间出生，识心在眼根和色尘之中间，我所说的中是指这个。</p><p>原文：<strong>佛言。汝心若在。根尘之中。此之心体。为复兼二。为不兼二。若兼二者。物体杂乱。物非体知。成敌两立。云何为中。</strong></p><p>释：佛说，识心如果在眼根与色尘的中间，那你这个心体是兼容着根与尘两种，还是不兼容根和尘两种呢？如果你的识体兼容根和尘两种，物体是杂乱的，尘物没有知性，根体有知性，这样二者是两相对立的，那把什么叫作中间呢？</p><p>佛又分两方面来破识心在根尘之中间。如果你所说的心在根尘中间，这个心体是兼容根和尘呢，还是不兼容根和尘？根能够发知，它是发知的根本，而尘没有知，根和尘是两种属性，一个有知性，一个没有知性，如果你的识心兼容根的属性，也兼容尘的属性，在根尘中间，这样的识心就是混乱的。这个中间怎么算？是有识性还是没有识性？有了知性还是没有了知性呢？</p><p>如果你说识心有了知性，那是不对的，因为你兼容了色尘，而色尘是没有了知性的。识心没有了知性也不对，因为你这个识心兼容了根的体性，而根是有了知性的，能够发出识心的知来，所以你说识心在根尘之中就是混乱的。根和尘是相对立的两种属性，识心不能兼容了这两种属性，所以说识心在根尘之中就不对了。佛这是从兼容这方面来说。</p><p>原文：<strong>兼二不成。非知不知。即无体性。中何为相。是故应知。当在中间。无有是处。</strong></p><p>释：从另一方面来说，如果识心不兼容根的属性和尘的属性，不把两种属性兼容在一起，而尘是没有知性的，根是有知性的，那么识心到底有没有知性呢？说识心有知是不对的，说识心没有知也是不对的。识心没有体性，中间是什么相貌呢？那么说识心在根尘之中，就一无是处。阿难一听，就不再辩别，默认自己的观点是错误的。</p></div>"
},{
    "title": "第七节 第七处征心—一切无著名之为心",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第七节  第七处征心—一切无著名之为心</strong></p><p>原文：<strong>阿难白佛言。世尊。我昔见佛。与大目连。须菩提富楼那舍利弗。四大弟子。共转法轮。常言觉知。分别心性。既不在内。亦不在外。不在中间。俱无所在。一切无著。名之为心。则我无著。名为心不。</strong></p><p>释：阿难对佛说，世尊，我从前看见您与神通第一的大目健连、解空第一的须菩提、说法第一的富楼那、智慧第一的舍利弗四大弟子一起谈论佛法的时候，世尊常常说觉知分别心性，既不是不在内，也不是在外，也不在中间，哪里都不在，一切法都不著，所以才说之为心。那么我那个无著的就是我的心吧？</p><p>佛与声闻弟子转法轮时讲的是小乘法，这时候世尊只能谈能觉知的妄心六识，在小乘这里绝对不具体讲第八识的觉知性。阿难回忆世尊所讲的话，说能够觉知分别六尘万法的心性，既不在内也不在外，不在中间；内是身体之内，外是身体之外，没有一个中间，不在任何一个处所上，不附着在一切法上，名之为心。阿难前边叙述的是佛说的原话，后边是他自己理解的意思，佛说的原话是没有问题的，他自己的理解却错了。</p><p>阿难问佛：则我无著，名为心不？既然一切无著，在一切法上都找不到识心，识心不附着在任何一个法上，那么这个不附着在任何一个法上的识心，是不是我的识心？阿难就像猜谜语那样，这个不对，就猜那个，那个不行，就再说另外一个，总是在猜测。阿难最后说无所著的是我的心，这个说法到底对不对，他自己也不敢肯定，就问佛。佛也很耐心的回答，佛为什么这么耐心呢？因为世尊要讲诸法实相，要讲大佛顶首楞严经，是为了利益无量的众生，佛就耐心细致的为阿难讲，其实佛是为了后世的所有众生在讲。</p><p>原文：<strong>佛告阿难。汝言觉知。分别心性。俱无在者。世间虚空。水陆飞行。诸所物象。名为一切。汝不著者。为在为无。无则同于。龟毛兔角。</strong></p><p>释：佛告诉阿难，你所说的觉知分别心性，在一切法上都不存在，但是世间的虚空是一切法中的一法，水陆飞行的动物植物、一切物体星体，这些法都是一切法中的一法，你所看见的所有的物相、色声香味触法、天宫、人物、六道众生、所有的星体、宇宙器世间一切法，都是一切法当中的一法，你都能分别得出来，你所不著的心是存在还是不存在呢？如果你的心是不存在的，就像乌龟的毛与兔子的角一样。</p><p>原文：<strong>云何不著。有不著者。不可名无。无相则无。非无则相。相有则在。云何无著。是故应知。一切无著。名觉知心。无有是处。</strong></p><p>释：怎么叫作不著呢？如果你有一个不著的心，还是有一个心，不可能说你的心是不存在的，说没有心就不对了。如果你的心一点相貌也没有，才能说确实没有心；可是你的虚妄觉知分别心性还是有相貌的，不能说你没有觉知心性，因为还能觉知分别这些六尘万法。如果你觉知分别的心性是有，那么觉知心就有运行的行相，有分别觉知的相貌存在；如果有觉知相貌的存在，那就是说明你的心还是存在的，既然你的心是存在的，怎么能说是不著一切法呢？</p><p>如果你的心真的不著一切法的话，那么你就不能觉知一切法，也不能分别一切法，可是你的心确实能够觉知一切法，分别一切法。我领你到天宫，你还是能看见天宫；我领你到地狱，你还是能看见地狱，水陆飞行的所有的动物植物，所有的物相你还是能看见的，还是能觉知、能分别，那就说明你的觉知心是有相貌的。既然有相貌，就是存在的，你怎么能说你的觉知心一切法都不著呢？所以你说一切法都不著的才是你的觉知心，这是不对的。</p><p>原文：<strong>若汝执吝。分别觉观。所了知性。必为心者。此心即应。离诸一切。色香味触。诸尘事业。别有全性。</strong></p><p>释：如果你执著能够分别色声香味触法的心，能感觉到六尘的心，能观察到六尘的心，一定是你的真实心，那么这个心应该是离开色声香味触法这一切境界，还应该有自己全部的特性存在，不会随着六尘有而有，不会随着六尘灭而灭。这个心应该是自在的心，本来就在的心，不能是因为有六尘才能出现的心。可是那个分别觉观的心，离开六尘就不存在了，那就不是你真实的心。</p><p>这是第七处征心的论点，世尊又一次破除了。阿难无言以对，承认他所说的心所在的七处都是不对的，觉知分别心性不在这七处，那到底在哪里呢？这时候的阿难很迷惑了，那么下文的述说就显得很重要。前面的七处征心都是征的阿难认为能思惟的心、能推理的心、能够爱乐佛的心，他把这个心当作真实的，然后就找寻这个心所在，最后佛都给否定了，说心确实不在内外中间三处，也不在阿难所说的七处，因此这样的心不是真实的心，是生灭虚妄、因缘而生的妄心，那真心到底在哪里呢？请看《楞严经》后面要叙说的。  </p><p>七处征心，都没有征到六识心所在，说明六识没有处所，来无所来，去无所去，幻化虚妄不实，依他起，无自性。现在虽然有这样正确的认识，可是还不是实际证得。要想实际证得，就要在甚深的禅定当中，动用意根仔细的深思参究，理路思路清晰了，证据确凿了，所有的疑都断除了，意识与意根都没有任何疑惑，就是实证。</p></div>"
},{
    "title": "第八节 两种根本颠倒",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第八节  两种根本颠倒</strong></p><p>原文：<strong>尔时阿难。在大众中。即从座起。偏袒右肩。右膝著地。合掌恭敬。而白佛言。我是如来。最小之弟。蒙佛慈爱。虽今出家。犹恃憍怜。所以多闻。未得无漏。</strong></p><p>释：这时候阿难在大众中从座位上站起来，偏坦右肩（右肩膀露出来，这是过去出家人穿衣服的方式），右膝着地左膝曲弓（这个叫胡跪），合掌恭敬对世尊说：我是佛最小的弟弟，一直承蒙佛的慈爱，虽然现在出家了，还是仰仗佛对自己的憍宠和怜爱，所以一直广学多闻，没有真修实证，也没有证得无漏。</p><p>阿难因为爱乐佛，有个爱乐佛的心，他一直把这个心当作真实的自己，当作真实心。于是佛就问他：你的这个所谓的真实心在哪里呢？阿难于是里外中间的说了七处，这七处世尊一一都给破除否定了。阿难实在想不出真实的心在哪里，所以再次请佛开示修行之路。</p><p>阿难的多闻是他无始劫以来熏闻佛法而积累成的善根，今世阿难随着佛修行，作为佛的侍者，随佛四处听经闻法，广学多闻。听经闻法之后他没有真正实修，因为他认为佛娇爱怜悯他，一定能把道果全部都给予他，不用自己去修；因没有实修，所以未得无漏，烦恼以及习气俱在。</p><p>这个漏就是指贪嗔痴烦恼，无漏就是没有贪嗔痴烦恼。修学佛法、闻得佛法以后，要加修禅定，然后定中深细思惟观行，通过观行才能实际证得佛法，取得相应的果位。以后还要加修甚深的禅定，最起码也要有初禅定，修出了初禅定才能断除贪、嗔、痴、慢、种种烦恼；烦恼断除以后，达到无漏，才能全具道力，不被贪嗔痴烦恼所逆转，所有的善法都不能漏出去，这叫无漏。没有贪嗔痴烦恼就不会漏善法；有贪嗔痴烦恼，善法不能长久，还要漏出去，故而无漏就是指断除了贪嗔痴烦恼。</p><p>阿难随佛修学，已经证得了初果，初果还是与贪嗔痴烦恼相应，他的意识和意根里贪嗔痴烦恼都没有断除。初果和二果都有贪嗔痴烦恼，只有证得果位之后，再修到初禅，在初禅的作用力下，才能够断贪、断嗔，以后再断痴。贪嗔痴烦恼断了，才能达到无漏，阿难只是多闻证了初果，二果都没有证得，他没有初禅定，三果四果更没有证得，因此没有达到无漏。当然阿难是为了作佛的侍者故意不证更高的果位，故意不断除烦恼，否则无法做佛的侍者。</p><p>原文：<strong>不能折伏。娑毗罗咒。为彼所转。溺於媱舍。当由不知。真际所诣。</strong></p><p>释：因为阿难还有贪嗔痴烦恼，没有达到无漏，所以不能折伏娑毗罗咒，被咒力所摄受，沉溺于摩登伽的淫舍。之所以受到这样的磨难，就是因为不知道自己的真心所致。</p><p>娑毗罗咒是一种外道咒，摩登伽淫女修外道法的母亲念了这个娑毗罗咒，就把阿难摄入到淫女的房舍里。阿难因为没有道力，故不能折伏这个外道咒而被咒所折伏，便不自觉的随着这个咒进入了淫女的房舍里；如果阿难断除了烦恼，这个咒力对阿难来说就不起什么作用。为什么阿难一听到外道的邪咒，心就被咒所麻痹，从而不自觉的走入了淫女的房舍呢？是心麻痹了，意根本性当中的无始劫以来的贪嗔痴烦恼就起了作用。</p><p>所谓麻痹就是意识心暂时失去了思惟能力，失去了说服引导意根的能力，那么意根这个时候完全按照烦恼习气作主。因为没有意识心通过思惟观行来控制、引导、说服意根，意根本身又有贪嗔痴烦恼，没有达到无漏，这时意根本身的贪性就不自觉的显现出来，随着这个邪咒进入淫女的房舍。所以阿难说溺于淫舍，溺就是被咒力强行按着，沉溺在那个房舍里不能自拔。</p><p>阿难遇到这种磨难，是因为他没有断除贪嗔痴烦恼所造成的。为什么没有断除贪嗔痴烦恼呢？是因为不知道自己的真实本际在哪里，没有证得自己的真心，没有找到自己的主人，一直把妄心妄觉的作用，当成了真实的自己，就没有断除烦恼漏，所以才被恶咒所逆转，于是就出现了这次磨难。多亏阿难故意有这次磨难，我们才能有幸听闻到这么殊胜的楞严经。</p><p>原文：<strong>惟愿世尊。大慈哀愍。开示我等。奢摩他路。令诸阐提。隳弥戾车。作是语已。五体投地。及诸大众。倾渴翘伫。钦闻示诲。</strong></p><p>释：阿难就乞求世尊说：惟愿世尊您大慈大悲，能哀愍我们，为我们开示奢摩他路，令那些断善根的一阐提人，摧毁邪知邪见，走上正途得以解脱。阿难说完以后就五体投地，所有在场的大众们，都渴望着、盼望着世尊尽快开示奢摩他路，恭恭敬敬想听世尊开示止观成佛之路。</p><p>五体投地包括头和四肢，礼佛拜佛有头着地的，有头不着地的。此时阿难是两胳膊两条腿，再加上头，全部都匍匐在地上，整个身体全部贴在地上，叫五体投地。这说明阿难折服了自已的慢心，完完全全的信服于世尊、折伏于佛，在佛面前没有了那个自我。</p><p>奢摩他路就是止观之路，由这种止和观的修行，就能证得清净涅槃，证得无上的佛法，达到寂灭之地，获得成就。成佛之路不离定和慧，不离止和观，有止有观，止观双运，就能够证得佛法，最后能达到清净涅槃的境地。</p><p>阿难请求世尊开示止观之路，修行成就之路，如果能达到止观境地，就能令诸阐提隳弥戾车。阐提的意思就是说这种人已经断了善根，断了成佛的种子，有善根才能够信受大乘佛法，信受自心中有真实的如来藏不生不灭，信受万法由真心自性所出生，而这种人恰恰不相信，而且还诽谤，因此就成为外道，断佛种性，不相信众生心中有如来的智慧德相，不相信众生身中有如来藏不生不灭，湛然长住，这种人不但不相信，而且诽谤，那么他就是一阐提断大善根之人，必堕地狱。</p><p>阿难说只要佛能开示这种奢摩他路，就能让这种断大善根之人隳弥戾车。隳就是摧毁，弥戾车是指邪见、恶见，隳弥戾车，能让一阐提人，摧毁他们的恶见和邪见，获得正知见。</p><p>原文：<strong>尔时世尊。从其面门。放种种光。其光晃耀。如百千日。普佛世界。六种震动。如是十方。微尘国土。一时开现，佛之威神。令诸世界。合成一界。其世界中。所有一切。诸大菩萨。皆住本国。合掌承听。</strong></p><p>释：于是世尊从面部上放射出种种光明，种种色彩斑澜的光辉；其光晃动，极其耀眼，就像一百一千个太阳光照一样耀眼。世尊放光以后，显现出所有的佛世界，所有的佛国土都出现了六种震动，像这样，十方世界如微尘一样多的诸佛国土（十方是指东、西、南、北、东南、西南、东北、西北、上方、下方总共十个方向）也都出现六种震动，这么多的佛国土同时显现出释迦世尊的威神力，然后世尊又用神力把所有的十方世界诸佛世界，都合成一个世界。在所有的世界中，所有的诸大菩萨都住在自己的本佛国土，合掌承听世尊演唱微妙法，开示的奢摩他路。</p><p>世尊观察在场的大众都来请法，就现出瑞相，以增强大众信心，让大众信受世尊所讲的大乘佛法，世尊现神通瑞相就是起这个作用。六种震动指震动声音从西边升起，从东边落下；从南方升起，从北方落下；从上方升起，从下方落下，；再反方向的生起和落下，声音总共有这六种震动的方式，就叫六种震动，是一种吉祥瑞相。</p><p>原文：<strong>佛告阿难。一切众生。从无始来。种种颠倒。业种自然。如恶叉聚。</strong></p><p>释：佛对阿难说：一切众生从无始劫以来，都有着种种的颠倒，思想观念的颠倒，对于一切事理认知的颠倒。这些众生因为种种颠倒，业种自然而然的就收存到如来藏中，然后又开花结果，生成果实。这种现象就如恶叉聚一样，三粒聚在一起，不可分离，众生的烦恼、业行以及业种总是相连在一起，使得众生生死死生轮转无穷。</p><p>恶叉聚是印度的一种果实，这个果实好像是三个果实结合在一起，不可分离，这叫恶叉聚。众生因为自己知见颠倒，造下业行，然后业种收存，业种又现行出来生成果报；众生颠倒的知见，加业种，再加果报，这三种就象恶叉聚一样，不可分离。只要你有邪见就造恶业，造了恶业就有业种，有业种就有果报，那么邪见、业种、果报就象恶叉聚一样，生生世世相随。这是众生生死流转的根本原因，因为有恶邪见。</p><p>原文：<strong>诸修行人。不能得成。无上菩提。乃至别成。声闻缘觉。及成外道。诸天魔王。及魔眷属。</strong></p><p>释：所有修行人虽然想出离生死轮回，但是因为知见颠倒，错乱修习，不得佛的正法滋润，不识修行的正理，因此就没有得成无上正觉，仍然是在心外求法；甚至有的人只修成了声闻缘觉和外道，降伏了识心，得个禅定境界，命终升天享乐；或者修得了一些福德后世做了魔王及魔王的眷属。</p><p>稍微好一些的人，因为不识本心，不求取无上涅槃，只能得个声闻缘觉菩提，断除五阴十八界的各种虚妄相而已，不能成就圆满的佛道，不能圆成一切种智。这样由于不识本心的错乱修习，就像煮沙子，想让它成为美味佳肴，纵然修行像灰尘那样多的劫数，也做不成美味佳肴。因为沙不是饭本，因地修行不真，果地就不是真正的目的地，早已曲向它途了。为什么是这样呢？</p><p>原文：<strong>皆由不知。二种根本。错乱修习。犹如煮沙。欲成嘉馔。纵经尘劫。终不能得。 </strong></p><p>释：佛说：众生没有走上无上菩提大道，没有修成佛，根本原因是由于众生不知道两种根本，错乱修习。错乱修行的人本来想成佛，想出离生死轮回，但因他们知见颠倒，修行方法不对，最终没有修成就。就像有人把沙子淘净了，放到锅里，本来想煮熟了以后自己能够当饭吃饱，结果没有成饭，因为煮的是沙子，不是米，沙子永远是沙子，不会成为米饭。如果谁想要把沙子煮成为最美味的佳肴，来填饱肚子，就算经过微尘数劫那么长，始终是不能成就的，这就是由于知见不正，错乱修习所导致的结果。</p><p>我们现在学佛也是如此，正知见是很重要的，知见不正，依着邪知见来修行，纵经尘劫，仍然不得成就。为什么有的学佛人，学了一生一世，三生三世，又有的修了很多劫，仍然没有修行成就，是因为他最初所接触的知见是邪知见，不能让他走上修行的正路，因此他不能修行成就，修不成佛。</p><p>佛说众生总共有八种颠倒，把无我当作我，把无常当作常，把不净当作净，把苦当作乐，这是四种。另外四种，与此相反，众生把我当作无我，把常当作无常，把净当作不净，把乐当作苦。</p><p>第一种颠倒，众生把无我当作我。五阴无我，不是我，生灭变易，没有我性，众生却认为五阴是真实的，永远常恒不变，是我以及我所拥有的。这是众生的我见邪见，由于有这个我见，内心就有结缚，我见结、见取见结、戒禁取见结，因为有这些结，就把自己捆绑在六道中不得出离，生死苦恼不断。</p><p>第二种颠倒，把无常当作常。五阴无常，十八界无常，见闻觉知无常，而众生却当作是常恒不变的，追逐不舍，以至于三界有不断，六道里的生命体不断，业行不断，苦恼就不断。</p><p>第三种颠倒，是把不净当作净。众生的色身不净，种子不净，入胎不净，住胎不净，饮食不净，识心染污不净，而众生却以为是净，贪爱不舍，执取不舍，因此生死轮回不断。</p><p>第四种颠倒，是把苦当作乐。众生无始劫流转于六道，生死死生，辗转无穷，受尽煎熬，苦不堪言。可是众生无智，从不觉悟，喜贪六道，爱乐自我，贪执五阴，执著十八界，不肯舍离，犹如粪池里的虫，贪执粪池，犹如火宅中的愚童，贪于玩乐。</p><p>与此相反的四种颠倒，第一种颠倒，是把常当作无常。真如佛性是常，大涅槃是常，众生却以为无常，把祂当作假名字，当作虚妄不真实有，当作相对待法，当作生灭，当作意识心的神我，因而否定祂，抛弃祂。因此不能努力地去寻求大涅槃，也就不能证得涅槃，其结果仍然是生死轮回无期。</p><p>第二种颠倒，是把我当作无我。佛地无垢识为真实永不变异的我，大涅槃心为真正的我，众生却弃之如弊履，认取离念灵知的意识心为我，为真实，为能到未来世的心体，因此不能断除我见，不能证取真正的涅槃。</p><p>第三种颠倒，是把净当作不净。大涅槃心，寂静寂灭，清净无染，不贪不嗔不痴，妙明湛然，离一切污垢。众生却认为祂有生灭、染污、变异，弃之而认无明的觉知妄心，弃金却拾土石，因此穷困他乡，流离失所。</p><p>第四种颠倒，是把乐当作苦。涅槃寂静，寂灭为乐，无见无闻，无觉无知，无喧无闹，舍弃一切受。众生却以此为苦，不喜寂静，却喜见闻，不喜寂灭，却喜喧闹。因此惑业不断，流转泥犁，辛苦备至，难成佛道。</p><p>以上八倒，即为八邪，邪见炽盛，心地污浊，穷劫修行，无有出期，犹如煮沙，欲成嘉馔，无有是处。</p><p>原文：<strong>云何二种。阿难。一者无始。生死根本。则汝今者。与诸众生。用攀缘心。为自性者。</strong></p><p>释：众生有哪两种颠倒呢？阿难，第一种无始劫以来的生死根本，就是你和所有的众生把能够攀缘尘境的妄心，当作自己的真心自性。</p><p>所有的众生都是把这个能够攀缘于六尘境界的妄心七识，当作不生不灭的真心，认为真实，这样就是认贼为子，自劫家宝，家财荡尽，流浪生死。以七识妄心为自己为真实不灭，就是我见和邪见。因有我见，就把自己捆绑在六道中，不出三界，不出生死。</p><p>断我见的重要内容之一就是断除认七个识心的功能作用为我的错误知见，这个很难断除，因为众生的意根长劫执著六识的功能作用为自己的，不肯舍离，无明深重，贪染不已，也执意根自己的功能作用为真实不灭的。若不长期熏习正确的佛法知见，不熏习四圣谛理，不熏习大乘般若法义，就不能有智慧有能力认可七识的虚妄，就不能彻底断除我见，三缚结不断，三恶道就不能免除。</p><p>不管是阿难还是其他修行的众生，都是把能攀缘六尘万法的攀缘心，当作自己的真实心，当作自己的自性，这样颠倒来修行，根本就不能有成就。这是众生无始劫以来，堕在生死当中不能出离的一个根本原因，把妄心当成真心。</p><p>原文：<strong>二者无始。菩提涅槃。元清净体。则汝今者。识精元明。能生诸缘。缘所遗者。由诸众生。遗此本明。虽终日行。而不自觉。枉入诸趣。</strong></p><p>释：佛说，第二种颠倒是，从无始劫以来众生都有一个真实的菩提心，也叫涅槃心，不生不灭的清净之体，没有无明的真心自性。那么你现在的那个本来就清明自在的识精，能出生一切法，但却不属于一切缘和法。所有众生都不知道有此本觉明心，把祂遗失了，这样的话，虽然大家每天都在精勤的修行，可是没有觉知到自己有这样一颗菩提涅槃清净体，就以妄为真，造作业行，生生世世落入六道生死轮回之中。，</p><p>无始劫以来就存在的菩提心、涅槃心，本来就是非常清净的，没有一丝染污，没有一丝无明，相上虽然是无，体性作用是真实有。这个菩提心是本来就清净的，不用你后天修行去变出一个清净的心。众生生活在世界上，所能遇到的一切境界法一切缘，都是这个清净体所出生的，而不属于这一切缘一切境界法的那个东西，就是每个众生的菩提涅槃之体。但是所有的众生都把这个本来就明了的清净体给遗失了。或者根本就不知道自己有一个真实的清净心、涅槃心，无量劫来生死死生，从来没有觉悟过这个心。因为不觉悟这个妙明真心，认五阴为我，才在无始劫中辛苦奔波于六道，白白地受于生死轮回，毫无益处。</p><p>落入六道生死轮回的原因是什么，佛已经讲了，是由不知两种根本造成的。第一种根本就是把妄心当成真心；第二种根本就是本来自己都有一个真实的心，能明了一切法的本明心，可众生不知道，遗失了，没有证得祂，没有找到祂，于是仍然在生死轮回当中不能出离。</p></div>"
},{
    "title": "第二章 第一节 见性具四种缘",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  第二卷段落释义</strong></p><p><strong>第一节  见性具四种缘</strong></p><p>原文：<strong>阿难白佛言。世尊。必妙觉性。非因非缘。世尊。云何常与比丘。宣说见性。具四种缘。所谓因空因明。因心因眼。是义云何。佛言。我说世间。诸因缘相。非第一义。</strong></p><p>释：阿难问佛说：世尊，如果那个微妙的觉明性一定不是因缘性，可是您常常对诸比丘们说见性有四种缘，比如说所谓的眼识见性，是因为有虚空、有光明、有识心、有眼根，就能见到色尘了，这是怎么回事呢？佛说：我这说的是世间的因缘相，因缘所生的法，不是在说第一义的见性。</p><p>这里的见性是指六识见六尘的见性功能作用，如眼识见色的功能，是因缘所生法，需具备四缘或九个条件才能见色，当因缘不具足时，这种见性就不存在了。所以见尘境的见是生灭性的是假法，不是第一义真心的见性。真心的见性没有条件，不用因，不用缘，不管明和暗，有空间和没空间，有眼无眼，有眼识心无眼识心，都有见性的功能作用。</p><p>原文：<strong>阿难。吾复问汝。诸世间人。说我能见。云何名见。云何不见。阿难言。世人因于。日月灯光。见种种相。名之为见。若复无此。三种光明。则不能见。</strong></p><p>释：阿难，我再问你，所有世间人都说自己有能见性，什么叫作见？什么叫作不见？阿难说：世间人借助于太阳、月亮和灯光能看见种种事物的相貌，就叫作见；如果没有这三种光明就不能见，叫作不见。</p><p>原文：<strong>阿难。若无明时。名不见者。应不见暗。若必见暗。此但无明。云何无见。阿难。若在暗时。不见明故。名为不见。今在明时。不见暗相。还名不见。如是二相。俱名不见。若复二相。自相陵夺。非汝见性于中暂无。如是则知。二俱名见。云何不见。</strong></p><p>释：阿难，如果没有光明的时候叫作不见，那应该也看不见黑暗；如果确实能看见黑暗，仅仅是因为没有光明是不见，怎么能叫作不见呢？阿难，如果在黑暗的时候不见光明叫作不见，那么现在有光明的时候看不见黑暗，还应该叫作不见才对。如果光明和黑暗都有不见，二者互相遮障和侵夺，并不是你的见性在其中消失不存在了。因此说在光明和黑暗的时候都有见性，都叫作见，怎么能说是不见呢？</p><p>原文：<strong>是故。汝今当知。见明之时。见非是明。见暗之时。见非是暗。见空之时。见非是空。见塞之时。见非是塞。四义成就。</strong></p><p>释：佛说：因此你现在应当知道，见到光明的时候，见性不是光明；见到黑暗的时候，见性不是黑暗；见到虚空了无一物的时候，见性不是虚空；见到有物不空的时候，见性不是壅塞和物质。这样光明、黑暗、空和塞四个法义才能成就，见性也能成就了。</p><p>佛在这里说第一义如来藏的见性，不归于尘境，六识的见性当然也不归于尘境，只不过六识的见性由尘境而起，第一义真心的见性不由尘境而起。当六识见明的时候，如来藏的见不是明，当六识见暗的时候，如来藏的见不是暗。见空的时候，如来藏的见不是空，见塞的时候，如来藏的见不是塞。如来藏的见不与明暗相关，明时也有见，暗时也有见，一直作用着不断的是如来藏的见；不与空塞相关，空时也有见，塞时也有见的，就是如来藏的见。</p><p>见明见暗的见是六识的见，见空见塞的见是六识的见，如来藏的见不见这些相。如来藏见什么呢？如来藏见的相不属于世间相，不属于六尘境，所见都与种子有关，不落入世俗相中，没有世俗心，没有喜怒哀乐等等的情绪，没有烦恼，不会造作善恶业行。</p><p>原文：<strong>汝复应知。见见之时。见非是见。见犹离见。见不能及。云何复说。因缘自然。及和合相。汝等声闻。狭劣无识。不能通达。清净实相。吾今诲汝。当善思惟。无得疲怠。妙菩提路。</strong></p><p>释：佛说：你应当知道，当你见到了你的见性时，你这个见到见性的见不是第一义见性的见。见性的见是能够离开能见见性的见而单独存在的，是不依能见见性的见而有见的，不管你见不见，见性的见都存在着不灭。你见到见性的见与见性的见不是同类，二者不能等同。你怎么还说见性是因缘生成的，或者是自然而有的，或者说见性是和合起来的相？你们这些声闻人心都是狭劣没有什么见识的，因此不能通达法界中清净的实相义。我现在告诉你，你应当好好思惟，不要对微妙的菩提大道再生懈怠心了。</p><p>第一义的见性能够离开六根六尘，也能离开六识的见，自己单独就能有见，见性本来存在，不是因缘出生的，不依靠外缘，眼见色、耳闻声的六识之见与见性不能等同。所以不能说见性是因缘所出生的因缘性，也不是自然而有的自然性，也不是各种事物和合到一起而凑成的。要想证得祂，必须修福修慧，用智慧之眼，无形的慧眼去发觉祂，肉眼不能见。</p><p>见见之时，第一个见是妄心七识的见，第二个见是如来藏见性的见。当我们见六尘境界时是妄心的见，背后还有个如来藏的见性，两个见一真一妄，不可混淆不分，也不可等同。妄心六识的见性不是如来藏本来的见性，两个见要区别开来，不要把六识的见性当作如来藏的见性。如来藏的见性，能够离开六识的见性而有，是不需要六识的见性就能单独存在的，有如来藏就有如来藏的见性（无余涅槃时除外）。</p><p>而六识的见性不能与如来藏的见性相提并论，也不能像见六尘境那样见如来藏的见性。但六识的见性是假见，真见和实质的见还是如来藏的见性，就像皮影戏，你所见的都是假相，实质都是幕后人所为。所以不要再把六识的见当真见，真见不见六尘境界。</p></div>"
},{
    "title": "第二节 别业妄见和同分妄见",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  别业妄见和同分妄见</strong></p><p>一、原文：<strong>阿难。一切众生。轮回世间。由二颠倒。分别见妄。当处发生。当业轮转。云何二见。一者众生。别业妄见。二者众生。同分妄见。云何名为。别业妄见。</strong></p><p>释：阿难，一切众生在世间里轮回，是由于两种颠倒所产生的虚妄的分别见，在颠倒妄见的当下就产生了业，由于业行就流转于生死。什么是流转分别的妄见呢？第一是众生个别业的妄见，第二是众生共同的妄见。什么是个别业妄见？</p><p>这一小段讲众生的共业与别业，不管是共业还是别业，众生所见的一切宇宙世间山河大地，都是妄见。别业是一个众生的业，或者是一部分众生有别于其他众生的业。共业是一部分众生共同的业，或者是一个地区、一个国家的全体众生共同的业，或者是一个星体众生的共同之业。因为众生有别业，又有共业，众生所看见的一切生活环境，六尘境界都是妄见。妄见就是虚妄的看见有这一切境界，把这一切境界都当作真实的，其实都不是真实的，没有其事，这些境界都不存在。</p><p>那么不是妄见该见个什么呢？不是妄见应该在宇宙器世间当中，在六尘境界当中，见自己的真如佛性的妙用，而不是见山河大地的实有。众生所能看得见的山河大地，看得见自己的生活环境、六尘境界，这些都属于妄见。如果不再妄见了，他就能在这一切的景象之上，见得自己的妙真如性，见得自己佛性的妙用，就不再认六根六尘六识为实有的了。而众生不见自己佛性的妙用，只是妄见山河大地、国土世间真实的存在，只看见这些境界，因此叫作妄见。其实真正的见是如来藏的见，不见境界的这个见才是真实的见。</p><p>原文：<strong>阿难。如世间人。目有赤眚。夜见灯光。别有圆影。五色重迭。于意云何。此夜灯明。所现圆光。为是灯色。为当见色。阿难。此若灯色。则非眚人。何不同见。而此圆影。惟眚之观。若是见色。见已成色。则彼眚人。见圆影者。名为何等。</strong></p><p>释：阿难，如世间人眼睛有翳病，眼球里有一层红膜，晚上天黑以后看见灯光下，除了灯影，另外还有一个五种色彩重叠在一起的圆影。对于这个现象你怎么看？今晚的灯光所显现出来的圆光，那团圆影，是灯上的色相，还是见上的色相？阿难，如果这个圆影是灯上的色相，那么没有眼病的人为什么看不见，而只有眼睛有病的人才能看见呢？这个圆影如果是见上的色相，见性已经是色相了，那么有眼病的人所看见的圆影，又叫作什么呢？</p><p>二、原文：<strong>复次阿难。若此圆影。离灯别有。则合傍观。屏帐几筵。有圆影出。离见别有。应非眼瞩。云何眚人。目见圆影。是故当知。色实在灯。见病为影。影见俱眚。见眚非病。终不应言。是灯是见。于是中有非灯非见。</strong></p><p>释：再者说，阿难，如果这个圆影是离开灯另外而有的，与灯无关，那么在其它地方如屏风、帐篷、茶几、餐桌上也应该有圆影出现，如果没有出现，就说明圆影与灯有关，离灯无有。如果说离开见性而能另外有圆影出现，那么这个圆影就不是眼睛看见的，与眼睛无关；既然是与眼睛无关，为什么有眼病的人却看见了圆影呢？</p><p>因此你应当知道，色相确实是灯光显现出来的，看见眼睛上的眚病就当成了圆影。这样的话，圆影和眼见二者都是眚病。但是能够映照出有眚病的见性却没有病，因此就不应该说：看见圆影是灯上的或者是见性上的，在这其中又说圆影离开灯而有或者是离开见性而有。离灯无见，离见无灯，灯与见都是妙明真心真精妙体，圆满菩提。</p><p>原文：<strong>如第二月。非体非影。何以故。第二之观。捏所成故。诸有智者。不应说言。此捏根元。是形非形。离见非见。此亦如是。目眚所成。今欲名谁。是灯是见。何况分别。非灯非见。</strong></p><p>释：所见到的圆影就像第二月一样，第二月既不是月亮的本体也不是月亮的影子，离本体没有第二月，第二月就代表了本体。为什么这样说？因为之所以看见了第二月，是由于用手捏眼睛才出现的假相，那些有智慧的人不应该说用手捏出来的东西，是有形相的还是无形相的，是能离开见与不见而有的。圆影也是这样，是眼睛有病造成的，不是真有什么圆影。现在想要分别出圆影摄属于谁，是摄属于灯还是摄属于见，恐怕都不是，何况还要分别出不摄属于灯、不摄属于见。</p><p>三、原文：<strong>云何名为。同分妄见。阿难。此阎浮提。除大海水。中间平陆。有三千洲。正中大洲。东西括量。大国凡有。二千三百。其余小洲。在诸海中。其间或有。三两百国。或一或二。至于三十。四十五十。阿难。若复此中。有一小洲。只有两国。惟一国人。同感恶缘。则彼小洲。当土众生。睹诸一切。不祥境界。或见二日。或见两月。其中乃至。晕蚀佩玦。彗孛飞流。负耳虹霓。种种恶相。但此国见。彼国众生。本所不见。亦复不闻。阿难。吾今为汝。以此二事。进退合明。</strong></p><p>释：什么是同分妄见？阿难，这个阎浮提洲，除去大海水，中间是平坦的陆地，陆地上有三千个洲，正中间有个大洲，东西两方都很开阔，洲中的大国有两千三百个，其余的小洲处在各个海中，小洲中有的有三二百个国家，有的有一两个国家，有的有三十个或者四十个或者五十个国家。</p><p>阿难，如果在这些洲中，有一个只有两个国家的小洲，其中只有一个国家的人，国土感召到了恶緣，那么这个小洲中国家的众生，看见的一切不吉祥的现象，如看见了两个太阳，或者看见了两个月亮，以及这个国家中出现的日蚀、月蚀、扫帚星等等星宿上的种种凶恶的现象，只有这个国家的人能看见，另外那个国家的众生则看不见，也听不到。阿难，我现在用这件事来为你说明什么是别业妄见和同分妄见。</p><p>四、原文：<strong>如彼众生。别业妄见。瞩灯光中。所现圆影。虽现似境。终彼见者。目眚所成。</strong></p><p>释：就像那个众生有别业妄见，看见了灯光中所出现的圆影，虽然圆影出现于灯光中好像真有境界似的，但终究是见圆影的人，他的眼病所造成的。</p><p>瞩是看见的意思。过去的人，晚上照明的时候是用油灯，在桌子上放着油灯，然后把灯点燃了以后。灯就会发出光明。但是有别业的众生，除了看见灯光所发出的光明之外，他在灯光当中还看见了另外一团圆影，那这个圆影是怎么现出来的呢？这就是别业妄见了。</p><p>这个众生有一个业障病，叫眼病，楞严经这里把这种眼病叫作眚，所谓的眚是什么意思呢？就是眼睛里长了一层膜，我们现在的普通话，可能是叫作白内障之类的，这里是红色的膜。因为眼睛长了一层红膜，他看见灯光时，在灯光当中还出现了一团彩色圆影，这个圆影和灯光的颜色不一样，是五色的，而且是一团，叫作圆影，有别于灯光。因为他眼睛有一层膜，因此在看见灯光时，就会看见灯光里还有另外和灯光不一样的一团色彩，他看见这个圆影，就好像真实地在他眼前一样。为什么说似呢？似就是好像有圆影的意思，实际上是没有的。眼睛没有眚病的人，他就看不见灯光中的圆影，眼睛有红膜的人才会看见这一团圆影，这团圆影，就是别业妄见的结果了。</p><p>这团圆影是怎么形成的呢？那就是外边的灯光通过眼根，如来藏摄取了四大微粒，并通过眼根传导到后脑的胜义根里，形成内相分的灯光。眼睛有病的人，眼根上有一层红膜，四大微粒通过红膜的时候，就受了阻碍，受了阻碍以后传过来的四大微粒就改变了；改变以后，再传到后脑眼睛胜义根那里，那么四大微粒形成的内相分就发生了变异，与外相分的灯光就不一样了，变现成了扭曲的内相分，有眼病的人就会看见另外有一圈圆光，就是四大微粒没有通过红膜传导过去的那部分。从这个事例，我们就会知道，每个众生接触到的六尘境界，都是自己的内相分，不是众生共同的外相分。</p><p>这个内相分不仅有外边灯光光明的色彩，而且还有另外的圆影，就是通过红膜这一块传过来的四大微粒，产生变异所形成的内相分，这个圆影就是由于红膜所造成的。因为四大微粒改变了，就另外现出一个圆影出来，这个圆影就是别业。圆影现出来以后，有别业眼病的人看见了就叫作妄见，不是真见。他看见圆影以后感觉圆影非常的真实，和他的眼根相对，好像就在他的眼前，其实是没有的。</p><p>眼睛有红膜的人，他除了看见灯光之外，另外还看见灯光中有一个五色圆影，就是他另外所看见的圆影。而没有眚病的人看见灯光，就是纯粹的灯光，不会另外看见所谓的一圈圆影。这说明了什么？说明了每个众生所看见的境相，其实都是自己的内相分。每个人因为自己的业障不同，所见的内相分就有差别。当眼睛有了红膜时，如来藏通过眼根，摄取外面灯光的外相分，摄取过来以后，影像就变了形，另外现出一个圆影。其它几根所见也是这样，由于业障不同，所见就有所不同，都是妄见，不是真见。</p><p>圆影就是因为有别业之人，眼睛有眚病所造成的，只有他才能看见另外一圈的圆影，其他没有这种眼病之人就看不见，所见的色尘都是正常的，不会出现幻觉和幻视。同理，心有病之人，就会妄见山河大地、五阴器世间；心无病之人，就会见得自己以及众生的真如佛性之妙用。</p><p>原文：<strong>眚即见劳。非色所造。然见眚者。终无见咎。</strong></p><p>释：他的眚病就是见性劳触之后出现的劳病，不是由色相造成的眼病。然而见眚病的那个见性，却没有见的过患。</p><p>眚字就是眼睛有红膜的意思，劳字是尘劳、劳累、过患的意思，一种病垢。众生因为有知见上的过患，无始劫以来就有见病，这就叫作眚。因为有见病，就有妄见，就会见到类似于圆影的并不存在的山河大地宇宙器世间等等，众生妄见这些法之后，就认为这些法是实有的，于是攀缘执著不舍，不断执取抓取，造业不止。</p><p>众生因为有见病，心眼见法有遮障，于是就只认类似圆影的假法，不见类似灯光的真如佛性。这是由于无始见病所成，不是由于外色外法所造成的，真如无咎，见性也无咎。就比如眼睛有眚病的人，视觉出现了障碍，见色就出现了一种错觉。其所见到的并不存在的圆影，不是灯光造成的，而是他的眼睛有病所造成的，才会另外看见了一圈圆影。</p><p>佛说众生见圆影，就叫别业妄见。眼睛有红膜的人，他所见的一切都是眼睛有病所造成的。那眼睛没有病的人所见的一切还有没有病患呢？佛就接着往下讲，把这个例子给它扩展开来，以此为例来说明所有的众生，其实和这个眼病的病患者是一样的，所有的众生都有心病。</p><p>为什么见眚的那个见性是没有过患的呢？因为这个见性只是单纯的照见，境界是好是坏，善恶是非美丑，都不管，也不分别，只如实地呈现出境界，也不知境界为哪般，所以任何境界出现，祂都是无过患的。</p><p>原文：<strong>例汝今日。以目观见。山河国土。及诸众生。皆是无始。见病所成。见与见缘。似现前境。</strong></p><p>释：此例类比于现在用眼睛观看到的山河国土，以及众生，都是无始劫以来的见病所形成的。能见色相的见性以及见性所需要的缘，如山河、国土、众生等等，相似于真实境界一样都在自己的眼前出现了。有无明见病的众生，他们见六尘境界的见性和见性所缘的法，都相似真实似的浮现在自己的识心中。</p><p>所有的众生为什么能够看见山河国土以及众生呢？众生从无始劫以来由于颠倒见，所见的一切都是虚妄见，看见的一切都是妄相，见不到实相，把不实之法当作实法，所以才能看见山河国土及诸众生，才有生死轮回苦，就像眚病者在灯光下所见的五色圆影一样。如果众生无明病消除了，没有颠倒知见，那他所见的应该都是自己的佛性，都是妙明真体；而不会妄见虚妄的六尘景象、山河大地以及众生等等，并且取以为实。就像没有眚病的人在灯光下只能见到灯光，没有圆影一样。</p><p>佛以有眼病的众生所见的圆影来作比喻，比喻所有的众生，因为心有无明病，才不能见到自己的真如佛性。其实众生见不到真如佛性，只见得虚妄的六尘影像，包括山河大地、宇宙器世间，以及所有的众生。山河大地、宇宙器世间以及众生，就和那个圆影是一样的。佛是用见灯影这种别业妄见，来比喻心有无明病的所有的众生，所看的山河大地，也是别业妄见，有别于诸佛菩萨所见的真如佛性。</p><p>佛用眼眚的人见圆影，来类比众生所看见的山河大地，皆是无始见病所成。众生由于心有无明病，知见是颠倒的，这就是无始无明。众生因为无始无明无始见病，因此所见的一切都是虚妄见，无论是见山河国土、宇宙器世间，还是见到所有的众生都是妄见，即使见十方诸佛也是妄见。</p><p>五、原文：<strong>元我觉明。见所缘眚。觉见即眚。本觉明心。</strong></p><p>释：本我的那个本觉明体是清明的，本觉之见性所缘的法如山河大地等却有眚病，是见病过患产生出来的。去觉悟本觉见性的见也是眚病，本觉依然，见性常在，若无无明，何必多此一觉？本觉本来就是圆满妙明真心，何用再去觉见什么。</p><p>元是本元是根本，无始劫以来就存在的，不是后天出生的那个叫作元，当然这是指本觉。元我觉明意思就是说，我本来就有一个非常明了的觉性，这个觉性是明的，能明了一切法见一切法。但是见性所缘的妄法却有眚病，有生死过患。因为见性的运行和显现，是缘于六根六尘六识，缘于五蕴器世间，没有六根六尘六识这些缘，见性就无所见。</p><p>原文：<strong>觉缘非眚。觉所觉眚。觉非眚中。此实见见。云何复名。觉闻知见。</strong></p><p>释：能觉见诸法所缘的本体妙明真心没有眚病，而能觉与所觉处于眚病中，本觉却不在眚病中。这样胜解才能真实地见到本觉的见性，怎么能还把本觉的见性当作七识的见闻觉知性呢？</p><p>一切见都是本觉的妙真如性，一真法界妙明真体。本来的真觉没有无明，没有病障，不在众生的眚病之中，也不是众生眚病的结果，是众生本具圆满清明之觉性。如果我们见得了自己本来的那个不在眚病中的真觉，这个见才叫作真实的见，在一切妄法上，应该见得不妄的本觉佛性，见得一切法的妙真如性，才是没有眚病之见，才是明见和实见。而妄见只能见得山河大地，世界国土以及诸众生，真见就要见得我们本来的那个觉性。如果众生生出了实见，在一切法上都见得真如佛性，那么就知道一切法都是真如佛性的妙用，所有的见，如来藏之见，那就没有眚病的妄见，也就不叫作七识的觉闻知见了。</p><p>原文：<strong>是故汝今。见我及汝。并诸世间。十类众生。皆即见眚。</strong></p><p>释：因此说，如今你们大家能够看见我（指佛世尊自己）以及你们自己，并且还能看见世间里的十类众生，这些见皆即见眚，全部都是妄见，是见病的结果。</p><p>因为众生心有无明，所以皆即见眚，所见就有过患。有见病，就会看见世间一切的妄相，所见得的一切相全部是虚妄的，众生之见都是妄见。即使看见了佛，也是妄见，因为佛的五蕴身也属于六尘境界当中的一个相，所以看佛的时候，见到佛的五蕴相也是妄见。不妄见的时候，就会见自己的佛性，不是只看到佛的五蕴身。</p><p>原文：<strong>非见眚者。彼见真精。性非眚者。故不名见。</strong></p><p>释：没有眚病见病之人，他们就会时时处处见到那个真精妙明性，本觉之妙精明性没有眚病，所以不能说有与七识相似的那种见性。</p><p>那个真精就是本觉见性，见性并没有尘劳过患，没有眚病，没有无明，所以见性本来是明的，没有妄见，不是如七识那样要分别出具体的六尘境界，祂只是平等地照见出一切法，不作具体尘境上的分别，与七识分别的法相截然不同，所以不说祂有六尘之见。</p><p>六、别业妄见和同分妄见</p><p>什么叫妄见？妄见就是不真实的见，虚妄的见，颠倒的见，所见的法同样是不实的虚妄的，是如来藏幻化出来的，见也是我们的妄心所见，能见的是七识心，所见的就是六尘境界，总之，能见所见都是虚妄的。七识心和六尘境界都是如来藏所变生出来的，不是真实法，包括业种都是虚妄的，因为能够消灭，能够变化，有生有灭，不是永远长存的。</p><p>别业，就是有别于其他众生的业。从最小的个别业来看，就是单个众生自己所感召的善恶业，叫作别业；再扩大一点，两个人三个人，或者一个地区，某一个村庄，某一个聚落，某一个省份或者某一个国家，单独感召的善恶业，这也叫作别业。别业妄见，是个别众生自己，或者一部分众生单独的业，不和其他众生共有的业，叫别业，别业显现出来，众生感召到了，叫作妄见。</p><p>同分妄见，是指具体相同业力的众生的共同业障，由这些众生共同虚妄地感知。同就是共同，一部分众生共同的业叫同分，叫作共业。妄见，是众生的妄心觉知到这些虚幻的业相，是错误颠倒的见。</p><p>共业是指众多众生共同的业，如整个娑婆世界众生的共业，或者娑婆世界整个南赡部洲众生的共业，或者南赡部洲当中我们整个中国所有众生的业，或者中国当中某一个省份所有众生共同的业，这叫同分。同叫共同，共业众生共同所见，共同感召的善恶业，叫作同分妄见，当然所见也是错误的颠倒见。</p><p>别业和共业都是相对来说的，不是绝对的，看相对于哪一部分的众生。比如南赡部洲我们中国整个地区的一个业，可以叫作共业，也可以叫作别业。如果叫作共业，就是整个中国地区当中所有众生共同的业；如果叫作别业，就是中国和整个地球或南赡部洲其他众生的业不共同，这个也叫别业。只有个别众生的业，一个众生的业，完完全全是别业，不叫作共业。两个人的业，对于两个人来说是同业是共业，对于其他众生来说，也叫作别业。不管是共业还是别业，都是妄见的结果。</p><p>一切法除了如来藏，其他都是虚妄的，所以佛说叫作妄见，不管是别业妄见还是同分妄见，都是妄见，我们所见的都是大脑胜义根里的假相。比如说在某一个城镇里发生了地震，发生了火灾，这个算别业，也算共业。不管是别业还是共业，外相分是有的。外界的火着起来，外界的地发生震裂，地震和火灾都是众生外界的现象，也就是外身，但是众生六识所见的都是依外界而有的内界内身。众生感到地震，看见火灾，甚至殃及到自己，这些能够觉知到的都是内相分，是依着外相分而显现出来的。外相分、内相分、共业、别业，全在如来藏里，都是如来藏所幻化的。</p><p>再比如说飞机失事，飞机上有几百个人，飞机失事对这几百个人来说，是属于这几百个人的共业；但这几百个人相对于其它地区的几亿人，几十亿人，千万亿人，无量数的众生来说，则属于别业。不管是共业和别业，飞机失事这件事有外相分，也有内相分，但是众生所见的都是内相分，真正的外相分本质性境，只有如来藏能够接触到，六识接触不到。外相分的飞机粉碎了，他们所见粉碎的飞机都是内相分，外相分他们不知道是什么状况，与内相分差不多一样。这就是共业、别业和外内相分它们之间的关系。</p></div>"
},{
    "title": "第三节 五阴虚妄",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  五阴虚妄</strong></p><p>一、原文：<strong>佛言阿难。汝犹未明。一切浮尘。诸幻化相。当处出生。随处灭尽。幻妄称相。其性真为。妙觉明体。</strong></p><p>释：佛言：阿难，你还没有明白一切的浮尘以及幻化出来的假相，这些假相在当处出生，又在出生之处灭尽。幻化虚妄不实，所以把它们叫作相，而真实的法却没有相，这些相的本质，确实是本觉妙明之体。</p><p>浮尘包括外六尘和内六尘。外六尘被幻化出来以后，我们六根接触时，本觉再把它们变现一次，落到胜义根，产生六识来分别。二次幻化更为虚幻不实。</p><p>当处出生，这些浮尘都由妙觉明体所出生，是生在妙觉明体心中，不出心体之外，心体之外什么也没有。随处灭尽，灭失时也是在心体之内灭失，不出心体之外，即使是十方諸佛国土，也不出这个心体之外，都是一真法界，一真如性。这些幻化虚妄的称为相，有形有相。而能幻化这些浮尘的本觉，确实真实不虚，非幻化而有，无形无相，没有一个法相。</p><p>这个处是指一切妄法的出生处——如来藏，不在别处，也没有别处，如来藏之外没有法。那么如来藏依据业种依缘，输出七大种子，出生五阴世间，缘尽妄法灭去，仍然在如来藏里灭，不在别处，也没有别处。那等于诸法生而无生，灭而无灭。七大种子输出也没有输出，没出如来藏之外，往哪里输出呢？尤其是输出第七识的识种子，是往哪里输出呢？没有第七识的推动就没有五阴世间，第七识在妄法当中第一存在，除此就没有其它任何妄法，第七识存在哪里，灭时又灭向哪里？都是在如来藏里，在如来藏处，其它幻法妄法也都是如此。</p><p>想想这件事非常有意思，更有意义，世间本没有法，也没有世间，什么也没有，若见法即见如来藏，若有见即如来藏见，还有什么呢？除了如来藏。一切法都了无所得，不可得，绝对不可得。</p><p>什么叫作生？出体，出现另外一个事物，叫作生，一切法都没有出如来藏之外，都在如来藏里，所以都没有出生，既然没有出生，也都不灭，一切法本如来藏，不生不灭。也所以说，一切法空，无自性。我们每时每刻都在忙，有什么意义呢？</p><p>忍可、认可这个理，就得无生忍和无生法忍。意识容易忍下来，容易认可，关键是意根，意根如果能忍可就是实证，完全彻底的实证就成佛了。想一想很容易，做起来需要三大阿僧祇劫，非常不容易。长伸两脚卧，事事不关心。为什么这么悠闲？一切法与我无关，也没有什么我，万法安闲，我也安闲。世间有什么可闹腾的？</p><p>原文：<strong>如是乃至。五阴六入。从十二处。至十八界。因缘和合。虚妄有生。因缘别离。虚妄名灭。殊不能知。生灭去来。本如来藏。常住妙明。不动周圆。妙真如性。性真常中。求于去来。迷悟生死。了无所得。</strong></p><p>释：佛说：同样是这个道理，幻妄之法扩展到五阴、六入，从十二处再到十八界，都是因缘和合才虚妄出生的，因缘分开不聚合了，也就虚妄的灭去了。众生却不知道，这些法的生灭和去来，本来都是如来藏的常住妙明、圆满、湛然不动、遍及一切法的妙真如性。在妙真如性中，去找一切法的来去，去找众生的迷悟和生死，都是了不可得的，根本什么也得不到，什么也没有。</p><p>五阴，色受想行识；六入，眼耳鼻舌身意六根；十二处，六根加六尘。十八界，六根六尘六识。这些都是因与缘和合起来，虚妄的产生出来的。色阴产生的缘是业缘、父母缘加上意根的贪爱执著性，外界六尘的产生是由于所有有缘的众生的业缘。六根触六尘，六识出生。六识的产生各有各的缘，这些缘具足了，十八界的一一界才产生出来，缘不具足，就不能产生。这就说明依赖缘而产生的十八界是虚妄的。</p><p>六个识出生了，五阴的功能作用就出现了，五阴也是因缘所生。佛说有因有缘世间集，有缘无因还是不行，集不起五阴十八界。万法的因、五阴十八界的因和源头就是本觉妙明的如来藏，因和缘别离了，虚妄的现象也就消失灭亡了，五阴十八界也就灭亡了。而众生不知道，这些生生灭灭的浮尘，五阴身的来来去去，本来就是如来藏的常住妙明性。</p><p>如来藏常住不动，虽然不动，其体性遍及十方一切諸佛国土，圆满成就一切法。一切法都是如来藏的妙真如性，也即是佛性。在真如性的真实而常住之中，想要寻找到五阴的来来去去、万法的生生灭灭、众生的迷和悟以及生死，都了不可得。因为这一切法都是妙真如性，是真如所显所变，虚妄的、空幻的，才了不可得。</p><p>二、原文：<strong>佛言阿难。云何五阴。本如来藏。妙真如性。阿难。譬如有人。以清净目。观晴明空。唯一晴虚。迥无所有。其人无故。不动目晴。瞪以发劳。则于虚空。别见狂华。复有一切。狂乱非相。色阴当知。亦复如是。</strong></p><p>释：佛言：阿难，怎么说五阴本来是如来藏的妙真如性呢？阿难，譬如有人，以清净的眼目，观看晴朗明净的虚空中，只是个晴朗清净，什么也没有。这个人也没有什么原因，就目不转睛地看着虚空。眼睛瞪长久了以后就疲倦了，因为疲倦，出现幻觉，看见虚空中狂飞乱舞的花点，以及一切狂乱的本来没有的相。这些花点和乱相并不是实在的东西，都是幻化出来的虚妄法，色阴也是像这些狂花一样，本来不存在，是幻化的虚幻的假有的法，是众生心颠倒迷惑所见到的虚幻相，没有实体。</p><p>原文：<strong>阿难。是诸狂华。非从空来。非从目出。如是阿难。若空来者。既从空来。还从空入。若有出入。即非虚空。空若非空。自不容其。华相起灭。如阿难体。不容阿难。</strong></p><p>釋：佛说：阿难，这些狂乱的花点不是从虚空中来，也不是从眼睛里出来的。阿难，事实是这样的，若乱花从虚空来的话，还会灭回到虚空里去。如果有东西能从虚空里出来进去，那么虚空也不叫虚空，不是空无的了，虚空就成了实体，若是实体，自然不会容受这些花相的起灭和出入。就像你阿难的身体，不会再容另一个阿难了。</p><p>原文：<strong>若目出者。既从目出。还从目入。即此华性。从目出故。当合有见。若有见者。去既华空。旋合见眼。</strong></p><p><strong>若无见者。出既翳空。旋当翳眼。又见华时。目应无翳。云何晴空。号清明眼。是故当知。色阴虚妄。本非因缘。非自然性。</strong></p><p>釋：这些狂花如果是从眼睛里出来的，还会从眼睛里进去。因为是从眼睛里出来，那么这些花点的性质应该和眼睛一样有见性。如果花点有见性，花点从眼睛里出去，就到虚空里了，如果花从虚空当中回来时，应该能看见眼睛，可实际上是看不见的。可见花没有如眼睛一样的见性，因此说花点不是从眼睛里出入的。</p><p>如果花点没有见性，从眼睛里出去时，就会遮障了整个虚空，从虚空中回来时应该遮障了两只眼，这时眼睛应该什么也看不见。事实上却不是这样，虚空和眼都没有被遮障。可见花不是从眼睛出入的。而且眼睛看见狂花时，应该没有疲劳和病幻，而恰恰是眼睛疲劳了出现幻觉，才看见狂花。如果是疲劳有幻觉看见狂花了，怎么能称作是清明的眼睛和晴朗的虚空呢？这就说明狂花不是从眼睛出入的。</p><p>总之，狂花不是从虚空来的，不是从眼睛出入的，它来无所来，去无所去，本是虚幻的。它的性质本不是因缘性，也不是自然性，而是如来藏性，是如来藏的功能和妙用。色阴也如是虚妄，来无所来，去无所去，非因缘性，非自然性，都是如来藏性。</p><p>三、受阴虚妄</p><p>原文：<strong>阿难。譬如有人。手足宴安。百骸调适。忽如忘生。性无违顺。其人无故。以二手掌。于空相摩。于二手中。妄生涩滑。冷热诸相。受阴当知。亦复如是。</strong></p><p>释：佛言阿难，譬如有人手脚安闲静止不动，身体各个骨节各个部位都舒适自在，这时就把自己忘了，内心暂时忽略了身体的存在，好坏的感觉都没有了。这个人无缘无故把两只手在空中互相摩擦，两手触到一起就虚妄地产生了粗涩、细滑、冷热等觉受相。</p><p>这些觉受本来是没有的，就因为两手接触而产生，从无到有，所以是虚妄。受阴也是这样，本来没有各种受觉，就因为六根触了六尘，虚妄地产生苦乐忧喜舍受，然后又消失。从无到有又无，虚妄地感受。</p><p>原文：<strong>阿难。是诸幻触。不从空来。不从掌出。如是阿难。若空来者。既能触掌。何不触身。不应虚空。选择来触。</strong></p><p>释：佛言阿难，这些虚幻的触觉，不从虚空中来，也不从手掌中出。是这样，阿难，如果触觉从虚空中来的话，既然它能触手掌，为什么不能触身体呢？不应该是虚空有所选择的来触什么。现在身体并没有产生觉受，只是两手有觉受，那么这个触觉就不是从虚空中来。</p><p>原文：<strong>若从掌出。应非待合。又掌出故。合则掌知。离则触入。臂腕骨髓。亦应觉知。入时踪迹。</strong></p><p><strong>必有觉心。知出知入。自有一物。身中往来。何待合知。要名为触。是故当知。受阴虚妄。本非因缘。非自然性。</strong></p><p>释：如果触觉是从手掌中来，那么手掌自然会常常出觉受，不用两手互相摩擦才产生觉受。而且如果触觉是从手掌里出来的话，手合到一起手掌有觉知，手分开时触觉应该回到手掌里，顺着手掌入到身体里，那么手腕、手臂、骨髓也应该觉知触觉进入了身体里，身体各个部分都有觉知才对。</p><p>如果是这样的话，一定有个知觉心知道触觉从手掌出去了，又回到手掌里了，这样的话，自然有一个物在身体中来来往往。既然有这知觉的物，为什么要两手合起来的时候才知道？也就没有必要在两手相摩时才有觉受，两手不合时也应该常有触觉和觉受，那么身体不与触尘相触时，也应该有觉受，能知触。</p><p>这样的话，触的定义也应该改变了，不是根触尘的触了，根不触尘也有觉受。这样就违背了六根触六尘生六识之理，无因无缘就有识的觉受，那么修行人打坐入定熄灭六根功用时仍有觉受，也就不能入定得寂止了。是故当知，幻触不从空来，不从掌出。来无所来，去无所去，本非因缘非自然性，都是如来藏性。同理可证，受阴也同样虚妄，来无所来，去无所去，本非因缘非自然性，即是如来藏性。</p><p>四、想阴虚妄</p><p>原文：<strong>阿难。譬如有人。谈说酢梅。口中水出。想踏悬涯。足心酸涩。想阴当知。也复如是。</strong></p><p>释：佛言阿难，譬如有人谈论着一种酸梅，说着说着口中就流出酸水来了。没吃酸梅，只是谈论就出酸水，这是一种极其虚妄的现象。言语不产生酸水，是众生心作想，了知了酸梅的酸，产生生理反应，酸水出来了。如果有人心里幻想自己站在悬崖边上，想着想着内心害怕，连带反应就是足心酸涩，害怕脚踩地不稳掉下悬崖，其实人在家里坐着呢。</p><p>本来心里想事和脚没有关系，足心出现的酸涩反应那就是完全虚妄的，出现这种情况是没有道理的，想阴也是这样的不真实。想即是了知、知道、思惟、幻想、想念、忆念，谈说酸梅时，心中了知了酸，产生觉受。心想悬崖时，了知了危险性，产生觉受。觉受时马上有生理反应。这种了知性是虚妄的，并没有酸梅这物在口中，双脚也并没有站在悬崖边上，虚妄地想，无缘由地想，不符合实际的想，却也有虚妄的觉受出现，实在是虚幻。</p><p>就像一个精神病患者，他对外界的认知是错乱的，内心的思惟就不可能正确，而后一系列的行为造作肯定是违反常理的，那么他的认知和想就是虚妄的、不实际的、不正确的、不如理的。我们的想阴也是这样不如理、不如实，因为无明。而諸佛的想和知没有无明，完全如理如法，没有丝毫错乱。</p><p>原文：<strong>阿难。如是酢说。不从梅生。非从口入。如是阿难。若梅生者。梅合自谈。何待人说。若从口入。自合口闻。何须待耳。若独耳闻。此水何不。耳中而出。想踏悬崖。与说相类。是故当知。想阴虚妄。本非因缘。非自然性。</strong></p><p>释：佛说阿难，像这样对酸梅的谈说，不是从酸梅中产生，也不是从口中进去的。如果是从梅中产生的谈说，酸梅自己会谈说，还用人来谈说它吗？如果谈说是从口中进去的，口会自己听闻，不用耳来闻了。如果单独用耳来闻的话，酸水为什么不从耳朵里出来，而是从口中出来的？所以这样的谈说是虚妄出现的。内心有想有觉观，就会有语言出来，语言又会触动更深一层的想和知，产生酸的觉观，口水就出来了。它们是互相影响，互相关联的，全部虚妄，没有实事，执著它，就会生死相续。</p><p>脚踏悬崖之想也是这样虚妄，这个想不从悬崖上来，否则悬崖自己想，与人无关；也不从脚中生，如果脚能生想的话，就会常想常酸涩，不能正常生活了。心中假想站在悬崖边上，无事生事，之后又没有道理的产生害怕的觉受，又更是没有道理的足心酸涩。这一切没有一样是真实事，都是几个识心在颠三倒四。众生就是这样被自己玩转着，苦恼不堪，甚可怜悯。佛说想阴也是这样虚妄，这些想念、思念来无所来，去无所去。本非因缘，非自然性，都是如来藏性。</p><p>五、行阴虚妄</p><p>原文：<strong>阿难。譬如暴流。波浪相续。前际后际。不相踰越。行阴当知。亦复如是。</strong></p><p>释：阿难，譬如暴流水，波浪滚滚，相续不断绝，后边的波浪总是跟着前边的波浪，没有超越的，次序不乱。行阴也是这样，一个行阴流跟着一个行阴流，前后次序井然。</p><p>比如眼识的行阴流，前一个眼识种子生来灭去，后一个眼识种子在同一位置生起又灭去，一个接着一个生起灭去，形成眼识流动，众生才能见色，身识也如此，这样才有身体的觉受和身根的运转施为，意识如是，意根如是，血液流动也如是。凡是动转而不静止的都属于行阴。</p><p>原文：<strong>阿难。如是流性。不因空生。不因水有。亦非水性。非离空水。</strong></p><p>释：阿难，这种水的流动性，不是由于虚空而产生出来的，也不是因为水而产生出来的，也不属于水的性质。因为水是湿润性，而暴流是流动性，二者不是同一属性。但是暴流也离不开虚空和水而存在，因为离开虚空，没有了空间，暴流就不能流动，成了静止状态。就像满瓶水，没有空间，无论怎么晃动也是静止状态。如果离开水，也没有水流了，怎么还能涌动呢？</p><p>原文：<strong>如是阿难。若因空生。则诸十方。无尽虚空。成无尽流。世界自然。俱受沦溺。</strong></p><p><strong>若因水有。则此暴流。性应非水。有所有相。今应现在。若即水性。则澄清时。应非水体。若离空水。空非有外。水外无流。是故当知。行阴虚妄。本非因缘。非自然性。</strong></p><p>释：是这样，阿难，如果暴流是因为虚空而产生的话，虚空无边无际，那么无边无际的虚空中都会有暴流产生，十方世界都会受到暴流的侵袭和淹没，则没有生命能够存活。可见暴流不因虚空而有。</p><p>如果暴流是因水而有，水是湿润性，暴流应该有湿润性，可是暴流却是流动性的，它有自己的属性和样貌，没有水的湿润性。暴流如果是因水而生，有水就应该有暴流，那么水澄清不动时，怎么不见暴流，全是水呢？可见暴流不因水有。如果离开虚空和水而有暴流，虚空之外一无所有，暴流不能存在，它只能存在虚空里，离开水也没有水的流动性，暴流也不能存在。</p><p>总之，暴流不是因虚空产生的，不是因水产生的，也离不开虚空和水而有。它来无所来，去无所去，本是虚妄。行阴也如是，来无所来，去无所去，本来不是因缘性，也不是自然性，都是如来藏性。</p><p>六、识阴虚妄</p><p>原文：<strong>阿难。譬如有人。取频伽瓶。塞其两孔。满中擎空。千里远行。用饷他国。识阴当知。亦复如是。</strong></p><p>释：阿难，譬如有人拿一个频伽瓶，装满虚空，塞紧瓶孔，不让虚空跑出去，然后把这个瓶子里的虚空送给千里之外的另一个国家。这是愚痴行为，这件事本是虚妄，不能成立。因为虚空是无法，不是真实有，瓶子里本身就是空的，装上虚空也还是原来的空，等于没有装一样。因此虚空没有来去，也没有动摇，不能从此处移动到彼处。众生的识阴也是这样的虚妄，盲目认知本不存在的六尘境界。</p><p>原文：<strong>阿难。如是虚空。非彼方来。非此方入。如是阿难。若彼方来。则本瓶中。既贮空去。于本瓶地。应少虚空。若此方入。开孔倒瓶。应见空出。是故当知。识阴虚妄。本非因缘。非自然性。</strong></p><p>释：阿难，这样的虚空不能从他方来，也不能进入到此方的虚空里去。如果虚空能从彼方来，那么瓶子装满了彼方的虚空，彼方的虚空应该减少，把瓶子里的虚空倒入此处，打开瓶子时，应该看见虚空从瓶子中出来，此处的虚空应该增加才是。事实上绝无此事，可见移动虚空这件事，本是虚妄。识阴识取六尘也是这样的虚妄，六尘本不有，如何让我们任意抓取，是几个识心虚妄地分别而已。而识阴不是因缘性，也不是自然性，都是如来藏性。</p></div>"
},{
    "title": "第三章 第一节 六入虚妄",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  第三卷段落释义</strong></p><p><strong>第一节  六入虚妄</strong></p><p>一、原文：<strong>复次阿难。云何六入。本如来藏。妙真如性。阿难。即彼目睛。瞪发劳者。兼目与劳。同是菩提。瞪发劳相。因于明暗。二种妄尘。发见居中。吸此尘象。名为见性。此见离彼。明暗二尘。毕竟无体。</strong></p><p>释：复次，阿难，六入为什么本来是如来藏微妙的真如性？阿难，就是你的眼睛瞪视视物所出现的活动相、劳动相、运行相，眼睛是眼根，劳相是行蕴，二者都是妙菩提运行和显现出来的劳触相。眼根借助于明和暗两种虚妄的尘境，触色尘，就在其中生出了眼的见性，见性吸收这些尘境，从而显现出尘境，就叫作见性。这个见性离开明暗两种虚妄的尘境，根本就没有见的体。</p><p>佛陀一开始就讲六入如何是本如来藏的妙真如性，那意思就是说六入全体都是如来藏出生的，是如来藏的功能属性，那么从六入当中就能发现如来藏的功能作用，证得如来藏。眼根与意根的活动相、劳触相，就是妙真如性，出生的见性就是妙真如性，而且出生见性的明暗两种缘也是妙真如性，众生所见所接触所运用的都是妙真如性，无一法不是妙真如性。</p><p>证得如来藏其实是不难的，到处都是如来藏的身影，祂都不躲藏，关键是众生自己的业障如何，见性的因缘条件是否成熟，菩萨性是否具足，戒定慧是否具足，难就难在这里了。</p><p>原文：<strong>如是阿难。当知是见。非明暗来。非于根出。不于空生。何以故。若从明来。暗即随灭。应非见暗。若从暗来。明即随灭。应无见明。若从根生。必无明暗。如是见精。本无自性。若于空出。前瞩尘象。归当见根。又空自观。何关汝入。是故当知。眼入虚妄。本非因缘。非自然性。</strong></p><p>释：如是，阿难，你应当知道这个见性，不是从明暗二相出来的，也不是从眼根中生出来的，也不是从虚空中生出来的。为什么这样说？见性如果是从光明中生出来的，黑暗来临时见性就没有了消失了，那就不能见到黑暗，也不知黑暗了。见性如果是从黑暗中生出来的，光明出现的时候，见性就会消失不见了，那就见不到光明了。</p><p>见性如果是从眼根中生出来的，一定没有明暗相，这样的见精本来就没有自己的体性。如果见性是从虚空中生出来的，往前看是尘像，回来应该能见到眼根，可是却不见眼根。又因为虚空自己能见，和你的眼根又有什么关系呢？因此你应当知道眼根入处是虚妄的，本来不是因缘所生，也不是自然性，而是如来藏性。</p><p>二、原文：<strong>阿难。譬如有人。以两手指。急塞其耳。耳根劳故。头中作声。兼耳与劳。同是菩提。瞪发劳相。因于动静。二种妄尘。发闻居中。吸此尘象。名听闻性。此闻离彼。动静二尘。毕竟无体。</strong></p><p>释：阿难，譬如有人用两手的手指紧紧的塞进两个耳朵里，由于耳根劳触，头中就会发出嗡嗡的声响，耳根与手指触耳朵的劳触相，都是菩提心运行出来的虚妄相世俗相。耳根借助于动和静两种虚妄的尘境，在手指与耳根的劳触中生发出闻性，闻性吸取这些动相和静相，显现出动静相，就叫作听闻性。这种闻性离开动静二尘，毕竟没有自己的体性，也就是说，没有动静就不会有听闻性，离尘无识无闻。</p><p>原文：<strong>如是阿难。当知是闻。非动静来。非于根出。不于空生。何以故。若从静来。动即随灭。应非闻动。若从动来。静即随灭。应无觉静。</strong></p><p><strong>若从根生。必无动静。如是闻体。本无自性。若于空出。有闻成性。即非虚空。又空自闻。何关汝入。是故当知。耳入虚妄。本非因缘。非自然性。</strong></p><p>释：如是，阿难，你应当知道这种闻性不是从动静当中生出来的，不是从耳根中生出来的，也不是从虚空中生出来的。为什么这样说呢？因为闻性如果是从静相出来的，当动相出现的时候，闻性就会消失不见了，那就不能听闻到动相了。闻性如果是从动中出来的，当静相出现的时候，闻性就会消失不见了，你就再也感觉不到静相了。</p><p>闻性如果是从耳根中出来的，就会随同耳根的属性，既没有动相也没有静相，就不会听闻到任何动静，这样的闻性本来就没有自体性。闻性如果是从虚空中出来的，虚空有闻性，那就不叫作虚空了；并且是虚空自己听闻，和你的耳根有什么关系？因此说，耳根听闻性虚妄，本来就不是因缘性，也不是自然性，是如来藏性。</p><p>三、原文：<strong>阿难。譬如有人。急畜其鼻。畜久成劳。则于鼻中。闻有冷触。因触分别。通塞虚实。如是乃至。诸香臭气。兼鼻与劳。同是菩提。瞪发劳相。因于通塞。二种妄尘。发闻居中。吸此尘象。名嗅闻性。此闻离彼。通塞二尘。毕竟无体。</strong></p><p>释：阿难，譬如有人急急的抽搐自己的鼻子，抽搐时间长了，鼻子就会有劳触相，在鼻子中就会感觉到一种凉凉的触觉。因为鼻子触到冷相，就会知道鼻子是通的还是堵塞的，是空的还是实的。如是乃至于鼻根触到所有的香臭气，鼻子都知道有触觉。而鼻根与这些劳触相，都是菩提心所生发出来的劳触相。由于虚通和堵塞了知虚妄的尘境，在其中生发出嗅闻性，嗅性吸取这些尘相，显发出各种味尘，就叫作嗅闻性。这种嗅闻性，离开虚通和堵塞二尘，毕竟没有自己的体性。</p><p>原文：<strong>当知是闻。非通塞来。非于根出。不于空生。何以故。若从通来。塞则闻灭。云何知塞。如因塞有。通则无闻。云何发明。香臭等触。</strong></p><p><strong>若从根生。必无通塞。如是闻机。本无自性。若从空出。是闻自当。回嗅汝鼻。空自有闻。何关汝入。是故当知。鼻入虚妄。本非因缘。非自然性。</strong></p><p>释：阿难你应当知道，这种嗅闻性不是从虚通和堵塞中出来的，不是从鼻根中出来的，也不是从虚空中出来的。为什么这样说呢？嗅闻性如果是从虚通中出来的，堵塞的时候嗅闻性就消失不见了，怎么能知道鼻子堵塞呢？嗅闻性如果是从堵塞中出来的，虚通的时候嗅闻性就消失不见了，这样怎么能辨别和触香臭气呢？</p><p>嗅闻性如果是从鼻根中出来的，就会随同鼻根的属性，既没有虚通也没有堵塞的尘境，就不会知道虚通与堵塞，这样的嗅闻性还有什么自性呢？嗅闻性如果是从虚空中出来的，这个闻性自己应当去嗅你的鼻子，虚空自己有闻性，和你的鼻入有什么关系呢？因此你应当知道嗅闻性是虚妄的，本来不是因缘性，也不是自然性，而是如来藏性。</p><p>四、原文：<strong>阿难。譬如有人。以舌舐吻。熟舐令劳。其人若病。则有苦味。无病之人。微有甜触。由甜与苦。显此舌根。不动之时。淡性常在。兼舌与劳。同是菩提。瞪发劳相。因甜苦淡。二种妄尘。发知居中。吸此尘象。名知味性。此知味性。离彼甜苦。及淡二尘。毕竟无体。</strong></p><p>释：阿难譬如有人用舌头舔舐自己的口腔，时间长了就会感觉疲劳，这个人如果有病了，舌头就会感觉出苦味，没有病的人就会感觉有微微的甜味。由甜苦两种相，就显示出舌根的作用。舌头不动的时候，口中总是淡淡的。舌根和疲劳两种尘相，都是菩提心所出生和显发出来的劳触相，由于甜苦和淡味两种味尘，舌根在其中生发出知性，吸取这些甜苦淡等等尘相，就叫作知味性。这个知味性，离开甜苦和淡味二尘，毕竟没有自己的体性。</p><p>原文：<strong>如是阿难。当知如是。尝苦淡知。非甜苦来。非因淡有。又非根出。不于空生。何以故。若甜苦来。淡则知灭。云何知淡。若从淡出。甜即知亡。复云何知。甜苦二相。</strong></p><p><strong>若从舌生。必无甜淡。及与苦尘。斯知味根。本无自性。若于空出。虚空自味。非汝口知。又空自知。何关汝入。是故当知。舌入虚妄。本非因缘。非自然性。</strong></p><p>释：如是，阿难，你应当知道能够品尝苦味、了知淡味的知性，不是从甜苦相中出来的，不是从淡味中出来的，也不是从舌根中出来的，更不是从虚空中出来的。为什么这样说呢？这个知性如果是从甜苦味中出来的，淡味出现的时候，知性就会消失不见了，这样怎么能够知道淡味呢？这个知性如果是从淡味中出来的，甜苦味出现的时候，知性就会消失不见了，那怎么能够知道甜苦味呢？</p><p>这个知性如果是从舌根出来的，随顺舌根的属性一定没有甜苦和淡两种尘相，不知道甜苦相和淡味相，因此说这样的知性本来没有自己的体性。知性如果是从虚空中出来的，虚空自己有知味性，你口里的舌头就不知道了，而且是虚空自己知道味尘，与你的舌根有什么关系呢？因此说，舌入是虚妄的，本来不是因缘性，也不是自然性，而是如来藏性。</p><p>五、原文：<strong>阿难。譬如有人。以一冷手。触于热手。若冷势多。热者从冷。若热功胜。冷者成热。如是以此。合觉之触。显于离知。涉势若成。因于劳触。兼身与劳。同是菩提。瞪发劳相。因于离合。二种妄尘。发觉居中。吸此尘象。名知觉性。此知觉体。离彼离合。违顺二尘。毕竟无体。</strong></p><p>释：阿难，譬如有人用一只冷手去触另一只热手，如果冷势大于热势，热的手熏染到冷气，就会变冷了；如果是热的势力大，冷手熏染到热气，就会变热了。像这样利用与觉知在一起的触，显发出离合的知性，由于两手相触时间长了，就造成了冷热势力的平衡。兼顾身根与劳触二者，都是菩提心中所显发出来的劳触相，借助于离与合两种虚妄的尘境，身根在其中生发出觉知性，吸取触尘相，叫作知觉性。能知能觉的身根离开离合与顺从违背这两种尘境，毕竟没有自体性。</p><p>原文：<strong>如是阿难。当知是觉。非离合来。非违顺有。不于根出。又非空生。何以故。若合时来。离当已灭。云何觉离。违顺二相。亦复如是。若从根出。必无离合。违顺四相。则汝身知。元无自性。必于空出。空自知觉。何关汝入。是故当知。身入虚妄。本非因缘。非自然性。</strong></p><p>释：阿难，你应当知道这个知觉性，不是从离与合的相上出来，不是因为随顺和违背而有，不是从身根中出来，也不是从虚空中出来的。为什么这样说呢？触觉如果是从身根与触尘相合的时候出来的，当身根与触尘离开时，触觉就消失不见了，这样怎么能知道根尘分离了呢？如果触觉是从根尘分开的时候出来的，当根尘合在一起时，触觉就消失不见了，那怎么能知道根尘合在一起了呢？</p><p>如果说触觉是从顺从和违背二相之一出来的，那就不会觉知到另外的相。触觉如果是从身根出来的，随顺于身根的属性，一定没有离合相，也没有顺从违背相，就不会觉知到这些相，所以说你身体上的触觉本来就没有自体性。如果触觉是从虚空中出来的，虚空自己有触觉，和你身体的触觉身入又有什么关系呢？因此你应当知道，身入是虚妄的，既不是因缘性，也不是自然性，而是如来藏性。</p><p>六、原文：<strong>阿难。譬如有人。劳倦则眠。睡熟便寤。览尘斯忆。失忆为忘。是其颠倒。生住异灭。吸习中归。不相踰越。称意知根。兼意与劳。同是菩提。瞪发劳相。因于生灭。二种妄尘。集知居中。吸撮内尘。见闻逆流。流不及地。名觉知性。此觉知性。离彼寤寐。生灭二尘。毕竟无体。</strong></p><p>释：阿难，譬如有人，疲劳倦怠了就会睡觉，睡好了就会醒过来。（意根）接触到尘境就会生起（意识的）忆念，忆念不出来就叫作忘记。这就是意根所住的生住异灭的颠倒相。意根吸取这些尘相到自心中，一个尘相接着一个尘相，次序井然不乱，叫作意知根。意根与意根触法尘的劳触相，都是菩提所生发显现出来的劳相。意根借助于生灭两种虚妄的尘境，在与法尘相触中生起意识的觉知性，意识吸取意根心内的法尘相，生出见性和闻性，心外追逐法尘，永远不知道法尘来自于何处，悟不到诸法的本源，这就叫作觉知性。这个觉知性离开睡眠觉醒和生灭的两种尘相，毕竟没有自体性。</p><p>意根是六根中的一根，与法尘的劳触相是行蕴，都是菩提所显发出来的虚妄相。身体疲倦了，意根就会安排睡觉，意识灭去；休息好就醒过来，意识出现起觉知性。意根攀缘尘境，意识就会忆念，忆念不出来就是忘记了，叫作失忆。这种意识的觉知性是由于睡觉睡醒和生灭这两种尘相出现的，睡着后意根不揽尘相时，意识灭去，意根揽尘相时，意识出现醒过来。其中意根是颠倒的，不断的攀缘于尘相，当作真实，让意识生生灭灭向外觉知一切法相，从不觉知这些法相的根源处，如果没有睡着清醒与生灭这两种虚妄的尘境，也就没有意识的觉知性。向心外觅法是逆法流，心内寻觅顺法流才能知道法源，从而悟道。</p><p>原文：<strong>如是阿难。当知如是。觉知之根。非寤寐来。非生灭有。不于根出。亦非空生。何以故。若从寤来。寐即随灭。将何为寐。必生时有。灭即同无。令谁受灭。若从灭有。生即灭无。谁知生者。</strong></p><p>释：如是，阿难，你应当知道能觉知尘境的根，不是从睡觉睡醒中生出来的，也不是从生灭现象中生出来的，不是从意根心中生出来的，也不是从虚空中生出来的。为什么呢？这个觉知性如果是从清醒的时候生出来的，睡觉时觉知就消失不见了，那是谁知道睡觉呢？觉知性如果是从睡觉法尘中出来的，睡醒了就消失不见了，那是谁知道睡醒了呢？如果觉知性是在法生的时候出来的，那么法灭了觉知性就消失不见了，那么是谁能感觉法灭呢？觉知性如果是从法灭中出来的，法生的时候觉知性就会消失不见，那么是谁知道法生呢？</p><p>原文：<strong>若从根出。寤寐二相。随身开合。离斯二体。此觉知者。同于空华。毕竟无体。若从空生。自是空知。何关汝入。是故当知。意入虚妄。本非因缘。非自然性。</strong></p><p>释：如果觉知性是从意根中生出来的，意根没有睡着和睡醒两种法尘，觉知性随着意根的属性，必然不知睡着和睡醒。睡着和睡醒是随着身体的舒展静息出现的，开是身体伸展活动，合是身体蜷缩静止，离开睡眠和睡醒，觉知性就如虚空中的花，根本不存在。觉知性如果是从虚空中出生的，当然是虚空自己有知，与意根的摄入法尘有什么关系呢？因此应当知道，意根的入是虚妄的，根本不是因缘所生，也不是自然而有，而是如来藏性。</p><p>七、万法本非因缘非自然性</p><p>万法本非因缘，非自然性，世尊在楞严经中是否定了万法产生的那两种因缘性和自然性，那就只剩下一种，万法就是如来藏性，是如来藏所出生幻化的，所以万法都具有如来藏性，只能得出这个结论。不知道或者不承认有如来藏的外道们都说，一切法或者是由于各种因缘而生出来的，或者说是自然而然的，自然而有的。而世尊却说都是如来藏出生的，没有如来藏，一切法都不成立。</p><p>世尊说五蕴、六根、六尘、六识、十二处、十八界，每一种法的来源处都是如来藏，不是各种因缘聚集的，不是天然就有的，是如来藏根据各种缘而产生的。世尊讲得很透彻，把其它产生一切法的处所和来源，都否定和堵塞了，只有如来藏才能产生这一切法。世尊在楞严经里的分析，就是教导众生观行五蕴、十二处、十八界都是虚妄的，都是后天出生的，都是生灭的，都是来自于如来藏。据此我们也能够观行断我见，再找到如来藏的所在，了知祂所起的作用，就是明心证悟。所以楞严经足以让我们证悟如来藏。</p></div>"
},{
    "title": "第二节 十二处虚妄",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  十二处虚妄</strong></p><p>一、原文：<strong>复次阿难。云何十二处。本如来藏。妙真如性。阿难。汝且观此。祇陀树林。及诸泉池。于意云何。此等为是。色生眼见。眼生色相。</strong></p><p><strong>阿难。若复眼根。生色相者。见空非色。色性应销。销则显发。一切都无。色相既无。谁明空质。空亦如是。</strong></p><p>释：世尊说：阿难，为什么说十二处本来是如来藏的妙真如性呢？阿难，你权且看看这个祇陀林以及所有的泉池，你怎么认为呢，见色这种现象是怎么来的呢？是色相本身产生了眼识的见，还是眼根产生出来的色相呢？</p><p>阿难，如果眼根能产生色相的话，那么看见虚空时，虚空没有色相，眼根见到虚空，色相就消失。色相消失了，能见色的见也就消失。见色的见如果消失了，就不能看见虚空，并且什么也不能见了。色相如果没有了，眼根就没有见了，可是却能知道虚空什么也没有，是谁明了空无一物和虚空的？可是你明明能看见虚空，你的见并没有消失，不是随着色相的消亡而消失，说明眼根不能生色相，是另有一个事物产生了色相。</p><p>原文：<strong>若复色尘。生眼见者。观空非色。见即销亡。亡则都无。谁明空色。</strong></p><p>释：如果是色尘能产生眼见的话，看见虚空时，虚空是没有色相的，虚空就不能产生眼见，这时的能见性就没有了，那么一切想就都没有了。这样的话，又是谁知道明了虚空无色呢？因此说，能见性和虚空以及色尘都没有什么处所，色尘与见性都是虚妄的，既不是因缘性，也不是自然性，当然就是如来藏的性质了。</p><p>这里佛陀暗指如来藏产生了色相，而且这个色相是内相分，是外色的影子，是如来藏的二次显现，或者叫作显发。如果是色相产生了眼识的见，那么虚空不是色相，就不能产生见。看见虚空时，就没有见了，既然没有见，怎么能看见虚空，知道是虚空呢？</p><p>原文：<strong>是故当知。见与色空。俱无处所。即色与见。二处虚妄。本非因缘。非自然性。</strong></p><p>释：是故当知，眼识的见与色相与虚空，都没有处所，色相和眼识的见，都是虚妄的，不是因缘性，也不是自然性，而是如来藏性，都来自于如来藏。这样如来藏产生一切法的立论就成立了，所以世尊得出一个实质性的结论：一切法都是由如来藏出生，唯如来藏心所现。</p><p>十二处，六根和六识，世尊告知众生都是如来藏性，都是如来藏出生。没有六根六识的自体性和真实性，都是被出生的法，是幻化的不实的。色相和眼识的见，没有处所，也没有自体性，不是本来就有的，所以世尊说这些法都是虚妄的。</p><p>把阿含经里的根尘识弄明白，看楞严经就容易一些，六根触六尘，然后如来藏出生六识，六识再触六尘，就有了见。其实是三者一直和合触，才有连续不断的见。六根已经出生完了，外界的六尘已经出生过了，如来藏再把外界的六尘变幻成内六尘，胜义根再触内六尘，六识出来就分别了内六尘。这样来看，六根六尘十二处，是不是很虚妄呢？这些法是从哪里出生的也就知道了。</p><p>二、原文：<strong>阿难。汝更听此祇陀园中。食办击鼓。众集撞钟。钟鼓音声。前后相续。于意云何。此等为是声来耳边。耳往声处。阿难。若复此声。来于耳边。如我乞食室罗筏城。在祇陀林。则无有我。此声必来阿难耳处。目连迦叶。应不俱闻。何况其中一千二百五十沙门。一闻钟声。同来食处。</strong></p><p>释：阿难，你再听听这个祇陀园中，召集吃饭时大鼓的声音，招乎大众集合撞钟的声音，钟鼓的音声前后相续不断。你怎么认为呢？你听见声音是因为声音来到了你的耳边，还是耳朵到声音那里去了？阿难，如果是这些声音来到你的耳边，比如我在室罗筏城乞食时，在祇陀林里就没有我。同理，如果声音来到你的耳边，目犍连和大迦叶那里就没有声音，他们就不能同时听到声音了。那些一千二百五十个比丘就更听不到了，他们怎么能一听到钟声就同时到达了吃饭之处呢？</p><p>原文：<strong>若复汝耳。往彼声边。如我归住祇陀林中。在室罗城。则无有我。汝闻鼓声。其耳已往击鼓之处。钟声齐出。应不俱闻。何况其中象马牛羊。种种音响。若无来往。亦复无闻。是故当知听与音声。俱无处所。即听与声。二处虚妄。本非因缘。非自然性。</strong></p><p>释：如果是你的耳朵到了声音那里，就像我乞食回来到祇陀林中，而室罗筏城那里就没有我了一样，你听见鼓声耳朵就到鼓声那里去了，钟声再响起来的时候，你应该不能同时听见了。那就更听不见象马牛羊的声音以及种种声音了。如果你的耳朵和声音互不相到，你就什么也听不见了。因此应当知道，听与音声这两个处所都是虚妄的，本来不是因缘性，也不是自然性，都是如来藏的妙真如性。</p><p>三、声音虚妄，本如来藏声音不到耳边，耳也不到声音之处，而能听声，说明听的不是真实的声音，是假声音，听声音这件事是虚妄的。如果是声音到一个人的耳畔，就不能到另一个人的耳畔，那么一个人能听到，其他人就不能听到。</p><p>如果是耳根到声音之处而听见声音，那么耳根能到一个声音的处所，就不能同时到另一个声音的处所，就不能听见其它的声音，实际上我们能同时听见各个不同地方的声音，那么听的声音就不是真实的声音。</p><p>同理，见色时，如果色到眼根处而有见，其他人就不能见，因为色不能同时到两个或多个地方去。如果是眼根到色处而有见色，那么眼根就不能同时到其它色处，这样也就看不见其它色了，实际上我们同时能看见多个地方的色相，那就说明我们见的色不是真实的色，是虚幻的，见色这件事就不真实。</p><p>因此，众生所接触的六尘是虚妄的，分别六尘这件事就是虚妄法，不是真实的。声音的震动传播，这是一种假像，好像是传导到了每个人的耳朵里，实际不是。声音是一种物质色法，地水火风组成，物质就是固定的一个体，如果这个物质到了一个地方，那就不能到达另一个地方，声音也如是，能到达一个人的耳朵里，就不能到达另一个人的耳朵里。</p><p>可是所有人却都听见同一种声音了，说明所有人听见的不是真实的外界的声音，而是如来藏又变现出来的声音的影子，是内相分。所以众生听见的都是内相分，是影子，是假像。世尊说都是如来藏性，声音和色相都是如来藏性。听声音时，感觉好像是听到声音，其实这是一种错觉，并没有这件事。</p><p>世间一切现象并不是真实有，我们的识心被表面现象所蒙蔽了，认为所接触的一切都是那么真实，悟后发起了各种观行以后，就会觉得一切都是幻化的，就像阳炎一样，就像做梦一样，就像看镜子上的影子一样。那时虽然烦恼习气还在，很多时候内心的感受就不一样了。如果不是有愿力的支撑，就没有必要活下去，谁也不愿意活在假象里。</p><p>我们接触到的一切都不真实，都是虚妄，而出生一切法的本体，包括出生五阴十八界、宇宙器世间的这个本体，这个本心却是真实的。只有证悟了祂，观察祂，才能确实知道祂的真实性，以及祂的所有体性。悟前可以熏修学习祂的体性，达到相似的理解。</p><p>四、原文：<strong>阿难。汝又嗅此炉中栴檀。此香若复然于一铢。室罗筏城四十里内。同时闻气。于意云何。此香为复生栴檀木。生于汝鼻。为生于空。阿难。若复此香。生于汝鼻。称鼻所生。当从鼻出。鼻非栴檀。云何鼻中有栴檀气。称汝闻香。当于鼻入。鼻中出香。说闻非义。</strong></p><p>释：阿难，你再嗅一嗅香炉中的栴檀香气，此种栴檀香，如果点上一株，室罗筏城周围四十里内，所有众生都能同时闻到。你怎么认为呢？这香味是从栴檀香中生出来的，还是从你鼻子中生出来的，还是从虚空里生出来的？阿难，如果此种香是从你鼻子中生出来的，称作鼻子生的香气，那么香气应该从鼻子中出来。但是鼻子不是栴檀，鼻子中怎么能有栴檀香气呢？之所以说你能嗅到香气，应当是香气入你鼻子中鼻子嗅到才对，如果是鼻子中生出香气，说是鼻子闻到香气，那就不对了。</p><p>原文：<strong>若生于空。空性常恒。香应常在。何藉炉中。爇此枯木。若生于木。则此香质。因爇成烟。若鼻得闻。合蒙烟气。其烟腾空。未及遥远。四十里内。云何已闻。是故当知。香鼻与闻。俱无处所。即嗅与香。二处虚妄。本非因缘。非自然性。</strong></p><p> 释：如果香气从虚空当中生出来， 虚空常在不灭，香气应该常生常在，为什么还要借助于香炉点栴檀木呢？如果香气是从栴檀木中生出来的，那么这个栴檀香的本质，因为点火变成了烟雾。如果你鼻子闻到了，应该是被烟所熏到了。而烟雾升上虚空以后，不会到达很远的地方，四十里地以内，怎么能闻到呢？因此应当知道，香气、鼻子和闻性都没有处所，其中能嗅性和香气两个处所都是虚妄的，不是因缘也不是自然性，而是如来藏的性质。</p><p>五、原文：<strong>阿难。汝常二时。众中持钵。其间或遇。酥酪醍醐。名为上味。于意云何。此味为复生于空中。生于舌中。为生食中。阿难。若复此味。生于汝舌。在汝口中。只有一舌。其舌尔时。已成酥味。遇黑石蜜。应不推移。若不变移。不名知味。若变移者。舌非多体。云何多味。一舌之知。</strong></p><p>释：阿难，你常常每天有两个时辰在大众中托钵乞食，乞食的时候也许能遇到酥酪醍醐，食中最好的美味。你怎么认为呢？此种美味是从空中生出来的，还是从舌头当中生出来的，还是从食物中生出来的？阿难，如果此种美味是从你舌头中生出来的，在你的口中，只有一个舌头，舌头生出酥酪醍醐味，再遇见黑石蜜的时候，还应该是酥酪醍醐味，不应该再有黑石蜜的味道。如果舌头上的味道不变，就不能说舌头能尝味知味。如果舌头上的味道能改变，那么舌头一人只有一个，并没有多个舌头，为什么一个舌头能尝到很多的味道呢？</p><p>原文：<strong>若生于食。食非有识。云何自知。又食自知。即同他食。何预于汝。名味之知。若生于空。汝啖虚空。当作何味。必其虚空。若作碱味。既碱汝舌。亦碱汝面。则此界人。同于海鱼。既常受碱。了不知淡。若不识淡。亦不觉碱。必无所知。云何名味。是故当知。味舌与尝。俱无处所。即尝与味。二俱虚妄。本非因缘。非自然性。</strong></p><p>释：如果酥酪醍醐美味是从食物中生出来的，食物没有舌识，怎么能品尝自己的味尘呢？再者说，食物自己知道美味，等于是你舌头之外的知，不是你舌头品尝了食物，吃饭这件事就与你无关，你怎么能知道酥酪醍醐味呢？</p><p>美味如果是从虚空中生出来的，如果你尝尝虚空，会尝出什么味道吗？如果虚空是咸味的，那么品尝虚空不仅能咸了你的舌头，也能咸了你的脸，那么这个世界上的人，就和海里的鱼一样了。既然世人常常感受咸味，就不会再了知淡味了。如果世人不能了知淡味，也就不能觉知到咸味，就会什么味道也不知道了，这样的话，怎么能尝味知味呢？因此应当知道，味尘、舌头与尝味的识，都没有处所，尝味与味尘二者都虚妄，本来不是因缘性，也不是自然性，而是如来藏的性质。</p><p>六、原文：<strong>阿难。汝常晨朝以手摩头。于意云何。此摩所知。谁为能触。能为在手。为复在头。若在于手。头则无知。云何成触。若在于头。手则无用。云何名触。</strong></p><p>释：阿难，你常常在早晨用手摸头，你怎么认为？摸头所产生的知，谁是能触的知？是手能触知，还是头能触知？如果是手能触知，那么头就不能知触，这样怎么叫作手触头呢？如果是头有触知，手就没用了，不知道触，这样怎么能叫作手触头呢？</p><p>原文：<strong>若各各有。则汝阿难。应有二身。若头与手一触所生。则手与头。当为一体。若一体者。触则无成。若二体者。触谁为在。在能非所。在所非能。不应虚空。与汝成触。是故当知。觉触与身。俱无处所。即身与触。二俱虚妄。本非因缘。非自然性。</strong></p><p>释：如果是手和头都是能触知的，那么你阿难就有两个能触知的身体。如果头和手是因为一个触而出生的感知，那么头和手就是一体；如果是一体的，触就不成立，因为不能自体触自体，譬如鼻子不能触鼻子，脖子不能触脖子，甲不能触甲自己，乙不能触乙自己，必须甲乙二者相触，触才能成立。</p><p>如果头和手是二体，那么谁是能触呢？能触的有知，所触的无知，如果手是能触，头就是所触，所触无知，头就无知，可是头却与手一样有知；如果头是能触，手就是所触，手就无知，可是手却与头同时有知。不应该是头手与虚空相触，虚空是所触无知，而头手是能触，都有知，这个道理不成立。因此说所觉的触尘与身体都没有处所，身体与触尘二者都虚妄，本来不是因缘性，也不是自然性，都是如来藏性。</p><p>七、原文：<strong>阿难。汝常意中。所缘善恶。无记三性。生成法则。此法为复。即心所生。为当离心。别有方所。阿难。若即心者。法则非尘。非心所缘。云何成处。若离于心。别有方所。则法自性。为知非知。知则名心。异汝非尘。同他心量。即汝即心。云何汝心。更二于汝。</strong></p><p>释：阿难，你常常在意根心中所攀缘的善恶和无记三个性质的法出生的法则，法尘是在意根心里出生的，还是离意根心另外有出生的处所？阿难，如果法尘是意根心里产生的，那么法尘就不是尘了，意根也就缘不了了，那意根怎么能成为根尘相触的处所呢？如果法尘离开意根，有另外出生的处所，那么法尘的自性有知性还是没有知性？如果法尘有知性，就叫作心，意根之外的心又不是意根，也不是法尘，就是另外一个心，与意根的性质是一样的。两个心一个是你阿难，一个是心，那么你阿难的心为什么有两个呢？</p><p>原文：<strong>若非知者。此尘既非。色声香味。离合冷暖。及虚空相。当于何在。今于色空。都无表示。不应人间。更有空外。心非所缘。处从谁立。是故当知。法则与心。俱无处所。则意与法。二俱虚妄。本非因缘。非自然性。</strong></p><p>释：如果法尘没有知性，就不是心而是尘了，可是这个法尘又不是色香味触，没有离合冷暖的五尘色相，也没有虚空相，非色非空的法尘在哪里呢？没法用色法来表示法尘，也不能用空法来表示法尘，人间不应该还存在虚空之外的法尘，虚空之外无法。离开意根的法尘，意根不能缘，那就不能立个处所了，意根不是法尘的处所，法尘也不是意根的处所。因此说法尘与意根心都没有处所，那么意根和法尘二者都是虚妄的，本来都不是因缘性，也不是自然性，都是如来藏性。</p><p>意根与法尘相触生意识，法尘包括五尘上的法尘和独影境，性质有善恶无记三种法。譬如有人在布施做善事，如来藏把这个法尘变现出来，传导到意根那里，意根与法尘相触，就缘到了这个法尘，如果感兴趣就会出生五俱意识来进一步的了别这个法尘，如果不感兴趣，五俱意识就不出生。如来藏把昨天打架的事变现出来，传导到意根这里，意根与这个独影境相触，如果感兴趣，就会出生独头意识了别和思惟这个独影境法尘。所以意根一定是与法尘在一起，在同一个处所，不可分开，否则就没有法尘，意根也不缘。</p><p>八、如何思惟一切法都是如来藏性</p><p>楞严经中世尊反复讲五阴十八界都是如来藏的性质，不是因缘性，也不是自然性。不是因缘性，不是自然性，多思惟思惟，就能理解了。可是如来藏性，就非常难理解了，即使证得了如来藏，也难以观察，理解上也不是那么容易的。</p><p>无形无相的四大种子，组成了最最微小的微粒，微粒再聚集，组成了稍微大一点点的微粒，然后四大种子不断组成微粒，微粒不断的聚集在一起，最终形成了肉眼能看得见的物质色法。从无到有，从空的无形的种子，到有形的最最微小的微粒，这本身就是非常神奇的，就像魔幻一样，所以才说如来藏就是魔幻师。</p><p>说是如来藏输出四大种子，实质上四大种子并没有出如来藏之外，组成的微粒也没有出如来藏之外，形成的物质色法也没有出如来藏之外。我们的色身就在如来藏里生生灭灭，没有出到如来藏之外，如来藏无形无相，色身就不可能有形有相，那到底是什么状态呢？</p><p>如果说物质色法有生，一定要脱离如来藏，出到如来藏之外，有单独的形相，四大种子出到如来藏之外，灭了四大种子又回到如来藏里。可是四大种子无形，怎么会变出有形的物质？如何转换？在如来藏之外，物质如何存在和变化？谁来依托物质？</p><p>四大种子组成微粒，微粒聚集，组成更大的微粒，四大种子不断组成微粒，微粒不断聚集，最后色身出现了，有形有相。色身却无生，没有出到如来藏之外，四大种子没有出如来藏之外，色身就不能出到如来藏之外。如果四大种子离开如来藏形成了微粒，四大种子离开如来藏，如何有功能作用，谁给它们的？种子离开如来藏，如何运作？如何从无形变造出有形？色身出如来藏之外，如何存在和变异？谁来依托它？死亡时四大分离，种子回到如来藏中，是如何回去的？如果不出如来藏之外，也就谈不到回到如来藏之中。原来都是如来藏自己在玩，自己在搞游戏，自己魔幻给自己看的，自娱自乐。</p><p>识种子生出来，形成识心，识种子不出如来藏之外，识心就不出如来藏之外。离如来藏没有种子，离如来藏没有识心，没有识心的心所法，没有受想行识。如果受想行识在如来藏里运作，生生灭灭，乱起乱灭，那么色受想行识都是如来藏家里的事，幻化也没有幻化出家外，如来藏独享，自娱自乐。</p><p>一切法都没有出如来藏之外，所以无生，也不会回到如来藏中，所以无灭。世间什么现象也没有，也没有世间，什么也没有，什么也不存在，那么就成天睡大觉吧。可是是谁睡大觉呢？如来藏里的规则法则那么神秘，神神叨叨的，不弄明白，恐怕也睡不好觉。</p></div>"
},{
    "title": "第三节 地水火风空见识七大虚妄",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  地水火风空见识七大虚妄</strong></p><p>一、原文：<strong>阿难。如汝所言。四大和合。发明世间。种种变化。阿难。若彼大性。体非和合。则不能与。诸大杂和。犹如虚空。不和诸色。若和合者。同于变化。始终相成。生灭相续。生死死生。生生死死。如旋火轮。未有休息。</strong></p><p>释：佛说：阿难，确实就像你所说的，由于四大和合才出现了世间种种的变化。阿难，如果四大种性其体性不是和合的，那么诸大之间就不能混杂和合在一起，就像虚空不能和一切色法合在一起一样。如果四大能够和合在一起，共同变化世间，世间相就会永远存在，生灭相续，生了死死了生，生生死死就像旋转的火轮一样，永远不会休息下来。</p><p>原文：<strong>阿难。如水成冰。冰还成水。汝观地性。粗为大地。细为微尘。至邻虚尘。析彼极微。色边际相。七分所成。更析邻虚。即实空性。</strong></p><p>释：阿难，就像水能结成冰，冰能融化成水一样，你来观察地相，粗糙的是大地，细微的是微尘，一直到接近于虚空的极细小的微尘。析分那些极其微小的色尘接近虚空边际的色相，分成七分，再次的析分，就更接近于虚空了，这时就看出来微尘确实是具有空性的。</p><p>原文：<strong>阿难。若此邻虚。析成虚空。当知虚空。出生色相。汝今问言。由和合故。出生世间。诸变化相。汝且观此。一邻虚尘。用几虚空。和合而有。不应邻虚。合成邻虚。又邻虚尘。析入空者。用几色相。合成虚空。</strong></p><p>释：阿难，如果这些临近于虚空的微尘，再被析分成虚空，就应该知道虚空能出生色相。你现在说，由于四大和合的缘故，出生了世间一切的变化相。你且观察一个临近虚空的微尘，是用几个虚空和合才有的？不会是因为临近于虚空的微尘又合成了临虚尘。再如果说临虚尘能进一步的析分成虚空的话，那是用多少的色相合成了虚空？</p><p>原文：<strong>若色合时。合色非空。若空合时。合空非色。色犹可析。空云何合。汝元不知。如来藏中。性色真空。性空真色。清净本然。周遍法界。随众生心。应所知量。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：佛说：如果色相能和合时，和合起来的只能是色相并不能成为虚空相；如果虚空能和合起来，只能是和合成虚空相并不能和合成为色相。色相是可以析分和合的，虚空如何析分和合？阿难你根本不知道，在如来藏中，色相的性质就是真实的空性，空的性质就是真实的色相。色和空都是本然清净的，周遍于法界当中，随顺着众生心所应该了知的量的大小、多少而显现出来，众生顺着自己的业才能发现。世间人都无知，糊涂迷惑的认为色空是由于因缘出生的，或者是自然而然而出现的。这都是众生识心的分别和计较度量，只要众生有所言说，不管说什么都没有实际意义。</p><p>这里世尊否定了色能生成虚空，虚空能生出色。物质的色尘如果能够细分为虚空，那么虚空就是由色组成的，虚空是用多少微尘色相组成的呢？如果微尘能组成虚空，虚空就不是虚空了，若如此，虚空也能组成微尘色相，那么用多少虚空能组成微尘呢？如果虚空能组成微尘，虚空也不是虚空，微尘也不是微尘，二者就都失去了自体性。</p><p>如果微尘色相能合成虚空，虚空就是色；若虚空能合成色，色就是虚空。虚空与色相怎么能够互相合成转换呢？它们之间是平等对立的关系，有此就没有彼，有彼就没有此。色是地水火风四大种子形成的，是有相貌的，而虚空是由空大种子形成的，是没有相貌的，所以色不能转换成虚空，虚空更不能转换成色。</p><p>色是由如来藏生出来的，不是虚空转换合成而生从来的，虚空也是由如来藏生出来的，不是由色析分生成的。世尊在楞严经里说得很明白了，万事万物都由如来藏生，都来源于如来藏。只要有色的地方就不空，空的地方肯定没有色。没有色的地方，就显现出空来了，所以空是因色而显发的。最后总结归纳说，都是如来藏性，所以色空不二。</p><p>色相分到最后就是微尘临虚尘，虚空和微尘临虚尘之间不能转化，二者都是由如来藏出生，是如来藏性，世尊否定了二者的互相转化关系。虚空和微尘都是由如来藏产生的，如果虚空和微尘能互相转化，那么虚空就是由微尘转变来的，其出处就不是如来藏了，况且微尘根本也转变不了虚空，与如来藏产生一切法，万法唯识这个真理相违背。</p><p>二、原文：<strong>阿难。火性无我。寄于诸缘。汝观城中。未食之家。欲炊爨时。手执陽燧。日前求火。阿难。名和合者。如我与汝。一千二百五十比丘。今为一众。众虽为一。诘其根本。各各有身。皆有所生。氏族名字。如舍利弗。婆罗门种。优楼频螺。迦叶波种。乃至阿难。瞿昙种姓。</strong></p><p>释：阿难，火性没有自体性的那种我性，是隐藏在各种生火的缘中，缘具足，火就会生出来。你观察王舍城中还没有吃饭的人家，他们要烧火做饭时，手里就会拿着点太阳火的工具，在太阳下求火。阿难，什么叫作和合呢？譬如我和你，一千二百五十比丘，现在成为一众人，虽然是一众，推究其根本，却是各有各的身体，都有自己的家族姓氏和名字。比如舍利弗是婆罗门种姓，优楼频螺是迦叶波种姓，乃至于你阿难是瞿昙种姓。</p><p>原文：<strong>阿难。若此火性。因和合有。彼手执镜。于日求火。此火为从。镜中而出。为从艾出。为于日来。阿难。若日来者。自能烧汝。手中之艾。来处林木。皆应受焚。若镜中出。自能于镜。出然于艾。镜何不镕。纡汝手执。尚无热相。云何融泮。</strong></p><p>释：阿难，如果此种火性是因为和合而有的，那么他们那些人手拿镜子，在太阳底下取火，生出来的火是从镜子里出来的，还是从艾草当中出来的，还是从太阳里出来的？阿难，如果火是从太阳里出来的，火既然能燃烧手里的艾草，路途当中所经过的林木都应该被烧着了才对。如果火是从镜子里出来的，既然镜子里能出火把艾草点燃了，那么火为什么没有把镜子烧化了呢？拿着镜子的手连热度都没有，更不能融化了。</p><p>原文：<strong>若生于艾。何藉日镜。光明相接。然后火生。汝又谛观。镜因手执。日从天来。艾本地生。火从何方。游历于此。日镜相远。非和非合。不应火光。无从自有。汝犹不知。如来藏中。性火真空。性空真火。清净本然。周遍法界。随众生心。应所知量。</strong></p><p>释：如果火是从艾草当中生出来的，为什么还用借着镜子和太阳的光明和合一起，才能把火生出来？你再仔细观察，镜子因为用手拿着，太阳光从天上下来，艾草是大地里生的，火是从什么地方来到这里的呢？太阳和镜子相距太远了，那时无法和合在一起的，不应该是火光没有来处天然出现的。你还不知道在如来藏中，火性就是真实的空性，空性就是真实的火性，都是本然的那种清净，不好发生任何变异，周遍于法界当中，随顺着众生的心所应该了知的量的多少而出现。</p><p>原文：<strong>阿难。当知世人。一处执镜。一处火生。遍法界执。满世间起。起遍世间。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：阿难，你应该知道，世间人在一个地方手拿镜子，火就在一个地方生起来，如果遍法界拿镜子，火就会满世间的生起，并没有什么具体固定的出生处所，随顺着众生的业力出现罢了。世间人无知，糊涂迷惑的认为火是因缘性和自然性的，都是虚妄识心的分别和计着量度。只要有所言说，都没有什么实际意义。</p><p>三、原文：<strong>阿难。水性不定。流息无恒。如室罗城。迦毗罗仙。斫迦罗仙。及钵头摩诃萨多等。诸大幻师。求太陰精。用和幻药。是诸师等。于白月昼。手执方珠。承月中水。此水为复。从珠中出。空中自有。为从月来。阿难。若从月来。尚能远方。令珠出水。所经林木。皆应吐流。流则何待。方诸所出。不流明水。非从月降。</strong></p><p>释：阿难，水性是不定的，流动和止息都是无常的。比如室罗城里的迦毗罗仙、斫伽罗仙以及钵头摩诃萨多等等几个大幻师，求取月亮里的太阴精用来做和幻药。幻师们在阴历十五之前的白月晚上，手里拿着装水的器皿，接月亮中流下来的水。这个水是从器皿中生出来的，还是虚空中本来就有的，还是从月亮里来的？阿难，水如果是从月亮里来的，月亮能从那么遥远的天上把水流注到器皿中，那么月亮流注水的时候，所经过的林木也都应该流出水来，林木里应该都是水，还用等着装水的方珠出水吗？如果林木没有水流出现，说明水不是从月亮流注下来的。</p><p>原文：<strong>若从珠出。则此珠中。常应流水。何待中宵。承白月昼。若从空生。空性无边。水当无际。从人洎天。皆同滔溺。云何复有。水陆空行。汝更谛观。月从天陟。珠因手持。承珠水盘。本人敷设。水从何方。流注于此。月珠相远。非和非合。不应水精。无从自有。</strong></p><p>释：水如果是从方珠中生出来的，那么这个方珠中应该常常流出水来，何用等待半夜里去接十五之前的月亮流下来的水。水如果是从空中生出来的，虚空无边无际，流出来的水也应该无边无际，那么从人间到天上都应该流水涛涛，被水侵没，众生怎么还能在水陆空中活动呢？你再仔细的观察，月光是从天上照射下来的，方珠是人手拿着的，装水的盘子是本人拿来摆好的，水是从什么地方流注到水盘中的呢？月亮和方珠距离那么遥远，和合不到一起，不应该是水精没有任何来处就出现了。</p><p>原文：<strong>汝尚不知。如来藏中。性水真空。性空真水。清净本然。周遍法界。随众生心。应所知量。一处执珠。一处水出。遍法界执。满法界生。生满世间。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：阿难你还不知道在如来藏中，水性就是真实的空性，空性也是真实的水性，二者都是本然清净的，周遍于法界中无处不有。水性随顺着众生的心所应该了知的量度，在一处拿着方珠接，这一处就有水生出来；如果遍法界中拿方珠，水就会满法界生出来，根本没有方向和处所的限制，遵循着众生的业力才能被众生发现。世间人无知，糊涂的认为是因缘出生的或者是自然而有的，都是虚妄识心的分别和计较量度，只要有所言说，都没有什么真实的意义。</p><p>四、原文：<strong>阿难。风性无体。动静不常。汝常整衣。入于大众。僧伽梨角。动及傍人。则有微风。拂彼人面。此风为复。出袈裟角。发于虚空。生彼人面。阿难。此风若复。出袈裟角。汝乃披风。其衣飞摇。应离汝体。我今说法。会中垂衣。汝看我衣。风何所在。不应衣中。有藏风地。</strong></p><p>释：阿难，风性没有自体性，动静不定不是恒常存在的。你常常在整理衣服之后才进入大众之中，你的袈裟角飘动起来的时候，就碰到了其他人，这时候就有微弱的风吹拂到他人的脸上。这个风是从袈裟角出来的，还是从虚空里出来的，还是从旁人的脸上生出来的？阿难，这个风如果是从袈裟角生出来的，那么你成天就会披着风而行住坐卧，如果衣服里有风，衣服就会飘起来，离开你的身体。 我现在正在说法，在法会中我的衣服却是垂下来的，并没有飘起来，你看我的衣服风在哪里呢？不会是衣服里有藏风的地方吧？</p><p>原文：<strong>若生虚空。汝衣不动。何因无拂。空性常住。风应常生。若无风时。虚空当灭。灭风可见。灭空何状。若有生灭。不名虚空。名为虚空。云何风出。若风自生。被拂之面。从彼面生。当应拂汝。自汝整衣。云何倒拂。汝审谛观。整衣在汝。面属彼人。虚空寂然。不曾流动。风自谁方。鼓动来此。风空性隔。非和非合。不应风性。无从自有。</strong></p><p>释：如果风是从虚空生出来的，你衣服不动的时候，怎么就没有微风吹拂的现象呢？虚空常在，风应该经常生出来，这样的话，如果没有风的时候，虚空也就灭了不存在了。风灭了的时候，我们可以看得见，灭掉虚空是什么状态？如果虚空也有生灭现象的话，其它一切法就无法存在，虚空也就不能叫作虚空了。如果还叫作虚空的话，怎么还能有风生出来呢？</p><p>如果风是从被吹拂的人的脸上生出来的，风也应该吹拂到你身上，你自己整理衣服，如何风倒吹到自己的脸上？你审慎的再仔细观察，整理衣服的是你，被吹的脸是别人的，虚空寂然不动，风从什么地方鼓动着到这里来的？风性和空性不是同一属性，不能和合在一起，风性不应该是没有任何来处自己就存在的。</p><p>原文：<strong>汝宛不知。如来藏中。性风真空。性空真风。清净本然。周遍法界。随众生心。应所知量。阿难。如汝一人。微动服衣。有微风出。遍法界拂。满国土生。周遍世间。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：你现在还不知道在如来藏中，风性就是真实的空性，空性就是真实的风性，二者本来都是清净的，周遍于法界，随顺着众生的心所应该感知的量度而出现于世俗界。阿难，如果你一个人轻轻的整理衣服，就会有微风生出来，如果遍满法界抖落衣服，就会满国土生风，风周遍世间，并没有局限什么方向和处所，只是遵循着众生的业力才被发现的。世间人无知，糊涂的认为是因缘出生的，或者是自然而有的，都是众生虚妄的识心分别和计较度量出来的，只要有什么言说，都没有实际意义。</p><p>五、原文：<strong>阿难。空性无形。因色显发。如室罗城。去河遥处。诸刹利种。及婆罗门。毗舍首陀。兼颇罗堕。旃陀罗等。新立安居。凿井求水。出土一尺。于中则有。一尺虚空。如是乃至。出土一丈。中间还得。一丈虚空。虚空浅深。随出多少。此空为当。因土所出。因凿所有。无因自生。</strong></p><p>释：阿难，虚空性没有什么形体，借着色相才能显示出来被发现。如室罗城，离河比较远的地方，有刹利种以及婆罗门种、毗舍首陀种、颇罗堕种、旃陀罗种等等族人，建新房子安居的时候打水井，把地里的土凿出来一尺，地里就有一尺的虚空，凿出一丈的土，地里就有一丈的虚空。虚空的浅深，由出土多少而定。这个虚空是因为土出现的，还是因为凿子出现的，还是没有什么原因生出来的?</p><p>原文：<strong>阿难。若复此空。无因自生。未凿土前。何不无碍。唯见大地。迥无通达。若因土出。则土出时。应见空入。若土先出。无空入者。云何虚空。因土而出。若无出入。则应空土。元无异因。无异则同。则土出时。空何不出。</strong></p><p>释：阿难，如果这个虚空是没有原因自己生出来的，没有凿土之前，为什么没有这个虚空呢？只见得土地的阻碍，不见通达的虚空。如果这个虚空是因为土生出来的，那么土出来的时候，应该能看见虚空进去。如果土先出来了，而没有虚空进去，怎么说虚空是因为土出才出现的？如果土和虚空没有出入，二者的出现应该没有差别，没有差别就是相同，同出同入，那么土出去的时候，虚空为什么不出去？</p><p>原文：<strong>若因凿出。则凿出空。应非出土。不因凿出。凿自出土。云何见空。汝更审谛。谛审谛观。凿从人手。随方运转。土因地移。如是虚空。因何所出。凿空虚实。不相为用。非和非合。不应虚空。无从自出。</strong></p><p>释：如果虚空是因为凿子出现的，那么就应该凿出了虚空，而不是凿出了土；如果虚空不是因为凿子出来的，凿子只能凿出土，为什么却能见到虚空出现呢？你再仔细审视观察，仔细审查仔细观察，凿子随同人手运转的方向而运转，土是因为地移动才出去的，虚空是因为什么出现的呢？凿子和虚空一虚一实，不能互相利用，也无法和合在一起，不应该是虚空没有任何出处的自己生出来的。</p><p>原文：<strong>若此虚空。性圆周遍。本不动摇。当知现前。地水火风。均名五大。性真圆融。皆如来藏。本无生灭。阿难。汝心昏迷。不悟四大。元如来藏。当观虚空。为出为入。为非出入。汝元不知。如来藏中。性觉真空。性空真觉。清净本然。周遍法界。随众生心。应所知量。</strong></p><p>释：如果这个虚空的性质是圆满遍周法界的，本来就是不动摇的，应当知道虚空与现前的地水火风，合起来叫作五大，其性真实，互相之间圆融和合没有障碍，都是如来藏性，本来没有生灭。阿难，你心昏沉迷惑，没有悟到四大本来就是如来藏。你应当观察虚空，是有出入的，还是无出入的。你根本不知道在如来藏中，觉性就是真实的空性，空性就是真实的觉性，本然清净，周遍法界，随顺着众生所应当了知的量度而现前。</p><p>原文：<strong>阿难。如一井空。空生一井。十方虚空。亦复如是。圆满十方。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：阿难，如是凿出一个井，就有虚空出现在一个井中，在十方凿井，也像这样，有十方的虚空现前，虚空圆满出现在十方没有障碍，并没有什么一定的方向和处所，只是遵循着众生的业力才出现的。世间人无知，糊涂的认为是因缘所生的，或者是自然而有的，都是众生虚妄识心的分别计较和度量罢了，只要有什么言说，都没有实际的意义。</p><p>六、原文：<strong>阿难。见觉无知。因色空有。如汝今者。在祇陀林。朝明夕昏。并太虚空。为同一体。为非一体。或同非同。或异非异。</strong></p><p>释：阿难，见性和觉性本身并没有什么知性，由于色和空二尘才出现了见性和觉性。比如说你现在在祇陀林，早晨明亮，晚上昏暗，如果在半夜的时候，在阴历十五之前的白月就有光明，十五之后的黑月就会黑暗。这些明暗色空等相，是因为有见觉性而分析显现出来的。那么这个见性与明暗相和太虚空是同一个体的还是不同体的？还是也同也不同，也异也不异？</p><p>原文：<strong>阿难。此见若复。与明与暗。及与虚空。元一体者。则明与暗。二体相亡。暗时无明。明时无暗。若与暗一。明则见亡。必一于明。暗时当灭。灭则云何。见明见暗。若明暗殊。见无生灭。一云何成。</strong></p><p>释：阿难，这个见如果是与明与暗以及与虚空原本是一体的，那么明暗二体是不能同时存在的，黑暗出现的时候就没有光明，光明出现的时候就没有黑暗。见性如果与黑暗是一体的，光明出现的时候，见就消失了，那就不能见到光明了；如果见与光明是一体的，黑暗来临时，见就灭去了，如果见灭去，如何能见到黑暗呢？如果明暗有差别不是一体的，见性没有生灭，三者如何是一体的呢？一体就不成立了。</p><p>原文：<strong>若此见精。与暗与明。非一体者。汝离明暗。及与虚空。分析见元。作何形相。离明离暗。及离虚空。是见元同。龟毛兔角。明暗虚空。三事俱异。从何立见。明暗相背。云何或同。离三元无。云何或异。分空分见。本无边畔。云何非同。见暗见明。性非迁改。云何非异。</strong></p><p>释：如果这个见精与明和暗不是一体的，你离开明暗以及虚空相，再看这个见精是什么形相的？离开明暗和虚空，这个见精本来就与乌龟的毛和兔子的角一样，了不可得。明暗和虚空三者都不相同，从哪个相上来确立见精呢？明暗是相背离的，怎么能说是见与是同体呢？离开明暗虚空三者本来就没有什么见，怎么能说或许是不同呢？根本谈不到同与不同。分别开虚空和见，二者本来没有边界和联系，怎么能说是不相同呢？根本谈不到同与不同。无论是见明还是见暗，见性从来都不改变，怎么能说非异呢？</p><p>原文：<strong>汝更微细审详。审谛审观。明从太陽。暗随黑月。通属虚空。壅归大地。如是见精。因何所出。见觉空顽。非和非合。不应见精。无从自出。若见闻知。性圆周遍。本不动摇。当知无边。不动虚空。并其动摇。地水火风。均名六大。性真圆融。皆如来藏。本无生灭。</strong></p><p>释：你再仔细审查，微细详细的观察，光明来自于太阳，黑暗伴随着黑月，通达无碍属于虚空，壅塞不通属于大地，如是见精是因为什么出现的？见觉无形，空而顽冥，没有和合性，不应该是见精没有任何来源处自己出来的吧？如果见闻觉知性圆满遍周法界，本来是不动摇的，你应当知道，见性与无边不动的虚空，以及动摇的地水火风都是六大之一，本性真实圆融，都是如来藏，本来没有生灭。</p><p>原文：<strong>阿难。汝性沉沦。不悟汝之。见闻觉知。本如来藏。汝当观此。见闻觉知。为生为灭。为同为异。为非生灭。为非同异。汝曾不知。如来藏中。性见觉明。觉精明见。清净本然。周遍法界。随众生心。应所知量。</strong></p><p><strong>如一见根。见周法界。听嗅尝触。觉触觉知。妙德莹然。遍周法界。圆满十虚。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：阿难，你的心性还在沉没沦溺，还没有悟得见闻觉知本来就是如来藏。你应当观察见闻觉知是生灭的，与尘境有同有异，还是不生灭的，与尘境没有同异。你从来都不知道在如来藏中，见性就是真觉的清明性，真觉的见精就是清明的见性，二者都本然清净，周遍法界，随顺着众生的心所应该了知的量度来显现。</p><p>比如单个能见的根，能见遍法界的色法，听的根、嗅的根、尝的根、触的根，能觉触能觉知一切法，奇妙的功德光明清净，遍周法界，圆满十方世界，哪里有什么方向和处所，众生依各自的业力而发现。世间人无知，糊涂的认为是因缘所生，或者是自然而有的。出现这些思想观念，都是众生识心的分别计较和度量的结果，只要有所言说，都没有实际的意义。</p><p>七、原文：<strong>阿难。识性无源。因于六种。根尘妄出。汝今遍观。此会圣众。用目循历。其目周视。但如镜中。无别分析。汝识于中。次第标指。此是文殊。此富楼那。此目犍连。此须菩提。此舍利弗。此识了知。为生于见。为生于相。为生虚空。为无所因。突然而出。</strong></p><p>释：阿难，识的性质没有来源处，借着六种根和尘虚妄的产生。你如今普遍观察一下此大会中的圣贤众，用你的眼睛依次观察，眼睛就能遍观周围一切法。但是眼睛所见如镜子中的像，没有特别的作以分析。你的眼识在观察当中，次第的标示出这个人是文殊师利，这个人是富楼那，这个人是目犍连，这个人是须菩提，这个人是舍利弗。你这个眼识的了知性，是从见性当中生出来的，还是从色相上生出来的，还是从虚空中生出来的，还是没有什么原因突然出来的？</p><p>从这里看出，是先有见性，后有六识的识别了知性，在眼根上有见，在耳根上有见，在鼻根上有见，在舌根上有见，在身根上有见，在意根上有见，见之后，就有识性。而且六识的识别了知性不是从见性中生出来的，那么见性与六识的识性是什么关系呢？二者有什么区别呢？见性与如来藏是什么关系呢？如果见性就是如来藏的见，那么如来藏见之后，还有一个意根的见，意根见之后，作主才能有六识的识性出现。且如来藏不见具体的明暗相和色空相，如来藏的见性不会落到世俗相当中，否则如来藏就有世俗烦恼了，那就不是清净的心了。</p><p>原文：<strong>阿难。若汝识性。生于见中。如无明暗。及与色空。四种必无。元无汝见。见性尚无。从何发识。若汝识性。生于相中。不从见生。既不见明。亦不见暗。明暗不瞩。即无色空。彼相尚无。识从何发。</strong></p><p>释：阿难，如果你的识性，是从见性当中生出来的，如果没有明暗相，没有色相和空相，四种相都没有，那就没有你的见性了。见性尚且没有，从哪里出生识性呢？如果你的识性是从色相中生出来的，不是从见中生出来的，那么你的识性既不能看见光明，也不能看见黑暗。如果看不见光明和黑暗，就没有色相和虚空，看不见明暗相，就没有色相和虚空，识性是从什么处生发出来的？</p><p>原文：<strong>若生于空。非相非见。非见无辨。自不能知。明暗色空。非相灭缘。见闻觉知。无处安立。处此二非。空则同无。有非同物。纵发汝识。欲何分别。若无所因。突然而出。何不日中。别识明月。</strong></p><p>释：你的识性如果是从虚空中生出来的，虚空没有相也没有见性，识性就会没有色相也没有见性，没有见性就没有辨别性，识性自然就不能了知光明、黑暗、色相和虚空的生灭因缘，见闻觉知就不能成立了。空相当于无，有相当于物，在这两种对立的现象中，纵然能生出你的识性，你要作什么分别呢？识性如果是没有什么原因的突然出现的，那为什么不在白天太阳下，另外识别出月亮呢?</p><p>原文：<strong>汝更细详。微细详审。见托汝睛。相推前境。可状成有。不相成无。如是识缘。因何所出。识动见澄。非和非合。闻听觉知。亦复如是。不应识缘。无从自出。若此识心。本无所从。当知了别。见闻觉知。圆满湛然。性非从所。兼彼虚空。地水火风。均名七大。性真圆融。皆如来藏。本无生灭。</strong></p><p>释：你再仔细的参详，微细的详细审查，见性依靠和承托你的眼睛才能有，色相就是你眼前的境界，有形状可见才叫作有，没有相就是无。可是识心是因为什么而出现的？这样的识性出生的缘是什么呢？识心是动的，见性是澄清的，二者无法和合在一起，听性、嗅性、尝性和触性也是这样。不应该是识心无缘无故没有处所自己生出来的。</p><p>如果这个识心，本来没有出生的处所，你应当知道，识心的了别性、见闻觉知性都是圆满清净安然存在的，其性不是从什么地方生出来的，与虚空、地水火风一起都是七大之一。其性真实圆融，都是如来藏，本来就没有生灭。在如来藏里，什么法也不生，什么法也不灭。</p><p>原文：<strong>阿难。汝心粗浮。不悟见闻。发明了知。本如来藏。汝应观此。六处识心。为同为异。为空为有。为非同异。为非空有。汝元不知。如来藏中。性识明知。觉明真识。妙觉湛然。遍周法界。含吐十虚。宁有方所。循业发现。世间无知。惑为因缘。及自然性。皆是识心。分别计度。但有言说。都无实义。</strong></p><p>释：阿难，你的心粗糙浮躁，还没有悟出见闻觉知的明了和了知性，本来就是如来藏。你应该观察这个在色声香味触法六处的识心，与六处是相同不同，还是非相同非不相同，识心是空是有还是非空非有。你根本不知道在如来藏中，识性就是明了湛然的真性的知性，真觉明性就是真实的识性，微妙的觉性清净安然淡泊，遍及一切法界，包容十方虚空，哪里有什么方向和处所，都是随顺着众生的业力而出现。世间人无知，糊涂的认为是因缘所生，或者是自然而有的，都是识心虚妄的分别和计较度量。只要有什么言说，都没有实际意义。</p><p>八、四大、六大、七大的概念</p><p>四大是地水火风，是形成物质色法的种子。物质色法细分，分到最后不能再分时，就是四大极微，但还不是四大种子本身，仍然是由四大种子组成的。</p><p>楞严经里的七大是：地、水、火、风、空、见、识，组成众生世间的七个因素，四大以及空，组成物质色身色蕴，识组成众生的识阴、受阴、想阴、行阴。大种性自性是指四大种子的功能，如果说六大，是指地水火风空识，不包括见大。这个见也是如来藏里的种子，是指如来藏本身所具有的见性，名为佛性。除去见大，这样就可以把七大缩略为六大。</p><p>地水火风四大种子不可再分，四大组成的物质可以分，分到最后就是邻微尘。地也是四大组成的，水也是四大组成的，火也是四大组成的，风也是四大组成的，只是四大的比例结构不同，就形成了不同的物质。</p><p>四大极微也是四大组成的物质色法，分成不能再分的邻虚尘，接近于无了。这个邻虚尘还是由四大组成的，只是极其微细。物质细分为邻虚尘，不是把物质的四大种子分散分解，成为地性部分、水性部分、火性部分、风性部分，从而使得物质就解散，消失不存在了，或者变成虚空了。而是物质本身的分割，分割成为极微细的物质微粒。</p><p>如来藏中有地、水、火、风、空、见、识七大种性，皆如来藏性。如来藏中本有这七大种子，因各种缘而显发五阴十八界和世间万法，那么世间一切法都是如来藏性，由七大种子和合而产生。</p><p>空性无形，因色显发。虚空无形相，色边无色的地方，假名为虚空。物质当中也有空，身体当中也有空，没有物质的地方，假名为空，空非真实有，是因色而显现出来的。楞严经中世尊举例说明，挖土凿井，土出，就是空，就显出空了。循业发现，随着业的显现，空就现前，本如来藏。见觉无知，因色空有。见色见空，见明见暗，此个见精，从如来藏来，不从色空和明暗来，也不自出。见闻觉知，本如来藏。</p><p>如一见根，见周法界，听嗅尝触，觉触觉知，妙德莹然，遍周法界。妙，从如来藏来才是妙，具如来藏性德，随缘周遍法界，有缘即现。六根上的见性，从根本上来说，都来自于如来藏的见性，都是如来藏微妙的真如性，如果不执著于六识的见性，就会见到如来藏的见性，就会知道一切法都是如来藏见性的作用。</p><p>识性无源，因于六种根尘妄出。六根触六尘，如来藏产生六识。六根虚妄，六尘虚妄，六识也就虚妄地出来了。为什么虚妄？被如来藏生出来的，不是本来就有的，不是真实的。如来藏为六个识输送识种子，六个识才有功能作用，才能了别六尘。大是指大种性自性，是如来藏中的种子，如来藏依各种缘输出种子，才出生世间万法。</p><p>而世间相中的地等有形状的物质，是由地水火风四大种子和合而成的，地中不仅有地的种子，还有水的种子，有火的种子，有风的种子。比如石头，里面有地的坚硬性，敲击它出火星，说明有火性，泥石流的发生，说明石头有水性，石头里还有空间，那就是空性，有空间就有风的存在，就有风性。外界物质都是大种性和合而生成的，不是单一种性物质。</p><p>识是有情众生特有的功能属性，物质色法没有，因此物质色法叫作无情物。妙，指如来藏性，这才是真妙，无形无相，却还有那么多的利用，一无所有，却还能产生那么多法出来，真空却妙有。祂分秒刹那都没有离开过我们，对我们永远是不离不弃，又不相在，不混合在一起。</p><p>九、性色真空，性空真色；性水真空，性空真水；性火真空，性空真火；性风真空，性空真风。</p><p>宇宙器世间的地水火风是由如来藏的四大种子组成的，所以地水火风的性质就是四大种子的性质，四大种子无形无相是空的，因此地水火风就是空性；四大种子的性质是如来藏性，因此地水火风的性质就是如来藏性，也就是妙真如性。如来藏由于含藏四大种子，四大种子能生成宇宙器世间的地水火风，地水火风就是如来藏性，是如来藏用四大种子转化成的，那么如来藏就含藏着地水火风性，也有地水火风的性质。如来藏非地水火风，也即地水火风，如来藏与地水火风不一不异。</p><p>性空是指如来藏的空性，如来藏所出生的万法，其性为空而不实，是如来藏的一部分种子流注而生成，因此如来藏的一部分就变成了色，那么一切色法的本质就是真实的空性心如来藏。空性心如来藏能够产生一切色相，因此一切色相也就是如来藏性。性色真空，色相的性质本质就是如来藏，是真实的空性心如来藏性。与心经中的色即是空空即是色这句话略同。同理，水火风与如来藏也是这种关系。</p><p>十、性觉真空，性空真觉；性见觉明，觉精明见；性识明知，觉明真识；性真圆融。</p><p>性觉真空，性空真觉，觉性就是真实的空性，虚空性就是真实的觉性。这个觉字是如来藏的觉，觉性如来藏能够出生虚空，虚空是色边色，没有色相之处就是虚空。虚空的本性本质就是如来藏性。虚空、色相、空性心如来藏三者之间的关系，需要弄明白，两种空能够区分开，看经就好懂了。</p><p>性见觉明，觉精明见，见性就是清明的觉性，觉性就是清明的见性。由清明的觉性如来藏出生见性，见明见暗及见虚空，都是觉性，是如来藏性。</p><p>性识明知，觉明真识，六识的识性就是如来藏清明的知性，如来藏的明觉性就是六识真正的识性。识性由清明的觉性如来藏出生，因此是如来藏性。</p><p>性真圆融，总结起来说，地水火风空见识，七大的性质都是真觉如来藏的性质，能互相圆融无碍，共同构成了五蕴世间一切法，使得一切法都能随缘随心量现行出来，本质都是如来藏一真法界。</p><p>十一、一切法都是真如实性，无一法不是真如实性。虽然现在知道了这个理，知道了这个结论，但是一定要实际证得，知道为什么，一定要有证据证明这个理这个结论，知其所以然。因为这个结论是佛陀得出来的，是佛陀自己亲自证明的，然后佛陀为众生宣说出来，成为了真理。这个最终的结论，最终的真理，也同样需要我们一点一滴的一步一步的亲自去证明，证明了以后就会知其然也会知其所以然，再也没有迷惑，没有无明了。</p></div>"
},{
    "title": "第四节 阿难发愿偈",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第四节  阿难发愿偈</strong></p><p>发愿偈原文：</p><p><strong>妙湛总持不动尊。首楞严王世稀有。销我亿劫颠倒想。不历僧祇获法身。</strong></p><p><strong>愿今得果成宝王。还度如是恒沙众。将此深心奉尘刹。是则名为报佛恩。</strong></p><p><strong>伏请世尊为证明。五浊恶世誓先入。如一众生未成佛。终不于此取泥洹。</strong></p><p><strong>大雄大力大慈悲。希更审除微细惑。令我早登无上觉。于十方界坐道场。</strong></p><p><strong>舜若多性可消亡。烁迦罗心无动转。</strong></p><p>释：绝妙寂湛的如来藏是佛法的总持和纲领，在三界世俗法当中总是如如不动，不与万法合，因此尊贵无比。这个犹如楞严一样坚硬的宝贝，在世俗法中稀有难见，因为祂是出世间法，不属于三界当中的法，因此不在三界世间里。</p><p>我闻世尊讲如来藏，就明了五阴非是真正的我，是自己的如来藏所幻化出来的假相，这样我无始劫以来，把五阴当作真实我的颠倒想，就彻底灭除了。在我悟得了如来藏这个真实法时，顿时就证得了自己的清净法身，不用经历阿僧祇劫那样长的时间就顿悟了。</p><p>我现在发愿，早取佛果，成为法王，再度那些像恒河沙一样多的众生。把我这颗深切愿心奉献给像尘沙一样多的诸佛宝刹，去度宝刹当中的无量无边众生，这样才能回报诸佛度化我的恩泽。愿请世尊来证明，我要发誓到这个五浊恶世来普度众生，如果还有一个众生没有成就佛道，我就不取证无上佛果——大涅槃，也就是佛地的无住处涅槃。</p><p>雄猛无畏、十力自在、大慈大悲的佛世尊，希望您能够再帮助我，仔细地剔除我心中的无数无量的随眠烦恼，和尘沙无明，让我把所有微细的无明都破尽，登上无上的法王宝座，在十方世界坐道场，降伏十方魔军，度化十方众生。我的空幻虚妄的浮心，可以生生灭灭，可以刹那消亡，可是我的坚固不动的金刚心，绝对没有动转之时。</p></div>"
},{
    "title": "第四章 第一节 地水火风本性圆融",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  第四卷段落释义</strong></p><p><strong><span/></strong></p><p><strong>第一节  地水火风本性圆融</strong></p><p>一、原文：<strong>富楼那。又汝问言。地水火风。本性圆融。周遍法界。</strong></p><p>释：佛说：富楼那，你现在问地水火风四大种子，本性圆融而且周遍于各个法界。</p><p>楞严经这段是世尊与富楼那的对话，前提大意是这样，富楼那故意问世尊说：地水火风四大种子其本性是圆融无碍，可为什么水火不相容，水能克灭火，火能烧灭水，地能阻碍虚空？本性圆融就是说四大种子的本性就是如来藏性，没有自己实质的属性，既然如此，地水火风各个种子就能够圆满地融合在一起，共同构成了三界世间的一切万法，包括众生的五蕴十八界。比如说土地是由地大种子、水大种子、火大种子、风大种子按照比例融合一起而形成的，只是地大成分所占比例为多。又比如血液，也是由四大种子按照比例组成的，水大成分多些。</p><p>周遍法界，是说地水火风的四大种子能够遍于一切法界出现，四大往往是以组合融合的形式出现，构成了各种法界，此为周遍一切法界的意思。法界包括三界：欲界、色界、无色界。这三界的组成就是由地水火风这四大种子和合起来构成的，包括欲界的器世间、色界的器世间。十法界就是六道凡夫法界和罗汉、缘觉、菩萨、佛四圣法界。十法界的色身、五蕴就是由地水火风四大种子和合起来组成的。</p><p>原文：<strong>疑水火性不相陵灭。又征虚空。及诸大地。俱遍法界。不合相容。</strong></p><p>释：你怀疑水性和火性为什么能够融合在一起，却不互相陵灭，你认为水火是不相容的，水能灭火，火又能烧干水，有水就应该没有火，有火就应该没有水。你又质疑虚空和大地，能够和合在一起遍满一切法界，遍布三界世间，你认为地大和空大是互相不相容的。你认为有大地的地方就没有虚空，有虚空的地方就没有大地，他们是不能互相圆融的。</p><p>而实际上地水火风的本性是圆融的，乃至七大种子都是圆融的，并且周遍法界。四大种子的本性是如来藏性，没有不能融合的，那么虚空和大地是能够融合到一起的，比如树木里有地大也有空大，也有水大和火大、风大，圆融和合在一起。比如身体里有虚空，有空隙，也有地大，组成肉体骨骼这些物质，它们是能够圆满融合在一起的。圆满融合到一起，就能够组成各种物质，组成三界世间。比如石头主要是由地大组成的，内部也有空间，就是空大，就是虚空。也比如虚空当中可以融合种种色法而没有妨碍。</p><p>原文：<strong>富楼那。譬如虚空。体非群相。而不拒彼诸相发挥。所以者何。富楼那。彼太虚空。日照则明。云屯则暗。风动则摇。霁澄则清。气凝则浊。土积成霾。水澄成映。</strong></p><p>释：富楼那，譬如虚空，它的体性没有一切法的相，什么相都没有，一无所有。如果虚空有一个相，就不是虚空了，但是虚空并不拒绝和排斥一切相在虚空中显现出来，它能够容纳一切相，包容一切相，与一切相和合在一起。</p><p>为什么呢？富楼那，你看那广阔的虚空，太阳一照下来，虚空当中就有了明亮相，光明就显现出来了，虚空并没有排斥太阳和光明。云朵堆积起来遍满虚空，遮障了阳光，虚空就昏暗了，虚空并没有排斥云彩和黑暗。风在虚空中一摇动，整个虚空就有风刮起来了，虚空并没有排斥风和风的摇动相、飘动相。</p><p>虚空一切相都不排斥，都能包容。雨过天晴，虚空就非常清澈澄净；污浊的气体聚集凝聚起来，虚空则显得很污浊昏暗，朦朦胧胧看不清楚色相；尘土聚积，就形成了土堆山丘；水流平静下来，非常澄澈时，就可以映照出万物的影子。虚空并没有排斥清净相和污浊相，并没有排斥气体、尘土和水流，并没有排斥土堆和水的清澈相。</p><p>这个道理就像虚空的譬喻一样，虚空的体不是一切色相，但是虚空并不阻碍色相的存在。因为在太虚空当中，太阳照射时，虚空就是光明的，云彩囤积时，虚空就是黑暗的，风刮起来时，虚空就有动相，雨停的时候天空则晴朗了，气聚的时候，空气则浑浊，土堆积起来则有小山丘，水澄清下来就能照物。</p><p>原文：<strong>于意云何。如是殊方。诸有为相。为因彼生。为复空有。</strong></p><p>释：佛言：富楼那，你怎样看待这些现象，像刚才所说的各种不同的有为造作的现象，这些有为相是从那些物体中产生出来的呢，还是从虚空当中产生出来的呢？比如太阳照射，虚空就明亮起来了，明亮是从太阳中产生出来的，还是从虚空生出来的呢？黑暗是云彩堆积所生出来的，还是从虚空里生出来的呢？土堆山脉是土尘生出来的，还是虚空生出来的呢？</p><p>水中的影子是水生出来的，还是虚空生出来的呢？是物体能产生那些现象，还是虚空能产生那些现象呢？所有的一切相是由于各种事物的原因生出来的，还是虚空本有的呢？你怎么想富楼那，这些各个不同的有为法相，如光明、黑暗、风动、晴朗等等，是因为太阳、云彩、风雨、土地、河水等等出生的，还是因为虚空出生的？</p><p>原文：<strong>若彼所生。富楼那。且日照时。既是日明。十方世界。同为日色。云何空中。更见圆日。</strong></p><p>释：富楼那，如果那些有为相，都是从相对应的物体所生出来的，比如光明是因为太阳生出来的，昏暗是因为云朵生出来的，风动是由风生出来的，水清澄澈能够映照物色这一性质是由水生出来的，高山土地是由沙土所生出来的。如果光明是太阳照出来的，既然是太阳产生的光明，那么十方世界都应该是光明的，但是在世界上的一部分地区有光明色相，另一部分地区就没有光明色相。太阳是一直存在的，可是为什么光明并没有遍照呢？那就说明光明不是太阳生出来的，而是如来藏生出来的。</p><p>如果是因为太阳等物出生的，那么太阳照射的时候，既然是太阳出生的光明，十方世界都有光明，应该都是太阳光，为什么十方世界却没有太阳只见光明呢？（这个意思是说，光明不是太阳出生的，是如来藏出生的，没有太阳的世界仍然有光明。）</p><p>如果光明是从太阳生出来的，太阳在虚空当中，十方世界也在虚空当中，那么十方世界都应该有太阳的光照，都应该是光明的，只此光明一个色法，不应该再有其它的物质了。但是我们却在虚空当中，看见了圆圆的太阳，那个除了光明之外的另一种物质。这与前面所说的，十方世界都是日色都是光明，是相违背的。</p><p>这就说明光明还有其他的来源，不是从太阳产生出来的，那么这个来源是什么呢？佛说就是如来藏。这个意思就是说十方世界都在虚空当中，太阳也在虚空当中，既然光明是从太阳产生出来的，十方世界都应该是光明的，不应该有的地方是光明的，有的地方是黑暗的，所以也就否定了光明是从太阳生出来的这种说法。</p><p>原文说同为日色，就是说十方虚空全部是太阳的光明，不应该再有其它东西了，也不应该有太阳，因为太阳和光明是两种物质。可是我们现在却看到了太阳，就说明十方世界不是同一日色，光明不是从太阳产生出来的，还有其它的东西。如果光明从太阳产生出来，那么十方世界都应该同样是日色。最后世尊会总结说，光明是从如来藏中产生，是如来藏性。</p><p>原文：<strong>若是空明。空应自照。云何中宵。云雾之时。不生光耀。当知是明。非日非空。不异空日。</strong></p><p>释：如果是虚空当中本有光明，不需要太阳来照射，一切世间时刻都是光明的。既然如此，那么虚空自己可以时刻照亮一切了，世间没有黑暗时，可是为什么在半夜的时候、云彩聚积的时候、雾霭遮障的时候，就没有了光明相呢？这说明光明不是虚空本有的。</p><p>如果光明是虚空出生的，虚空当中应该时时都有光明，不应该有黑暗的时候。所以说光明不是由太阳出生的，也不是由虚空出生的，那就是如来藏出生的，但也不离太阳和虚空而有光明，太阳和虚空是如来藏出生光明的助缘。</p><p>二、原文：<strong>观相元妄。无可指陈。犹邀空花。结为空果。云何诘其。相凌灭义。观性元真。唯妙觉明。妙觉明心。先非水火。云何复问。不相容者。真妙觉明。亦复如是。</strong></p><p>释：观察这些相，发现都是虚妄不实的，没法指出这些相的来处。却还要弄来那些空花，结成空的果实，这更是不可能的，更是虚妄的。所以就不要再诘问如何是四大互相凌灭的了。水火本没有互相凌灭的现象，水火生生灭灭都是由于如来藏，不是因为其对立方，大地与虚空也是这样，都是如来藏的原因才有生生灭灭的现象出现，不是因为其对立方。</p><p>所以观察如来藏的性质确实是真实不虚的，一切法的性质都是如来藏性，都是如来藏的妙觉明性。可是如来藏的妙觉明性，却没有水火之类的虚妄相，你为什么还要问水火怎么不相容这些虚妄相呢？真心妙觉明性也是这样，圆满圆融无碍，没有违碍不相容性。</p><p>原文：<strong>汝以空明。则有空现。地水火风。各各发明。则各各现。若俱发明。则有俱现。云何俱现。富楼那。如一水中。现于日影。两人同观。水中之日。东西各行。则各有日。随二人去。一东一西。先无准的。不应难言。此日是一。云何各行。各日既双。云何现一。宛转虚妄。无可凭据。</strong></p><p>释：你心想要明了虚空的时候，虚空就出现了，你心想要明了地水火风的时候，地水火风就会一个个出现，如果你想要这些法同时都出现，那么这些法就会同时都出现。如何同时都出现呢？富楼那，譬如在一条河水中，呈现出了太阳的影子，有两个人一同观察水中的太阳，然后二人各往东西两个方向走，就会出现两个太阳随两个人分别走，一个东一个西。你不应该责难说，太阳的影子本来是一个，为什么现在出现了两个，并且随着两个人各往各处。随两个人走的太阳加一起是两个，为什么最初在水中却呈现的是一个太阳影子？这怎么想都觉得是虚妄的，找不到任何证据说明这些现象。</p><p>事实上，是众生的如来藏根据天上实质四大种子生出来的太阳，在各自心中变现出虚拟的太阳，意根缘到之后想要明了，如来藏就随顺意根出生意识了别，众生就会看见自己心中的太阳，每个众生都是这样，所以每个人都会看见有太阳随着自己走，众多太阳是这样出现的，所以众生看见的都是影子，都是虚假的。</p><p>其实水中不管有几个太阳影子，都是如来藏出生幻化出来的，即使天空上的太阳，也是如来藏出生幻化出来的，不要认为这些太阳影子有什么真实性，而去对其猜测说，明明一个太阳为什么却变出两个三个或者是多个。有因缘的时候，如来藏就出生万象，没有因缘的时候，如来藏就不出生，法界规律就是这样。</p><p>三、原文：<strong>富楼那。汝以色空。相倾相夺。于如来藏。而如来藏。随为色空。周遍法界。是故于中。风动空澄。日明云暗。众生迷闷。背觉合尘。故发尘劳。有世间相。</strong></p><p>释：佛说：富楼那，你认为色和空在如来藏中是互相对立不圆融的，有此无彼，有彼无此。而如来藏却能随着色和空，周遍整个法界。（整个法界就是指众生的五蕴十八界法界，如来藏遍于其中，五蕴十八界就都是如来藏性。）因此，在如来藏中，有风飘摇，有空澄清，有太阳明亮，有云朵黑暗。众生迷惑愚昧无知，心背离觉性如来藏，不见如来藏相，只见如来藏出生的五蕴世间尘俗相。因此就生发出了尘劳，世间相就产生了。</p><p>原文：<strong>我以妙明。不灭不生。合如来藏。而如来藏。唯妙觉明。圆照法界。是故于中。一为无量。无量为一。小中现大。大中现小。不动道场。遍十方界。身含十方。无尽虚空。于一毛端。现宝王刹。坐微尘里。转大法轮。灭尘合觉。故发真如。妙觉明性。</strong></p><p>释：而我观察色和空的妙真如性，不生不灭，合于如来藏的性质。而如来藏具足微妙的觉明性，圆满光照法界。因此在如来藏当中，一代表了无量之多的法，无量的法也就是一法；微小的法中能显现出大法，大法中能现出微小的法；如来藏却从来不离开自己的道场，如如不动就能遍及于十方法界，含藏十方无边无尽的虚空；在一个毛发顶头，就能幻现出摩尼宝王的宝刹；坐在微尘里，运转着佛法之轮，没有一丝尘劳烦恼相，完全合于觉性，所以才能显发出真如的妙觉精明性。</p><p>如来藏是一种非常微妙的觉性之体，祂有微妙的明觉，而没有无明，这种明觉，能圆明地照耀着一切法，显发出一切法，无一法而不知。虽然没有一个法而不知，但也不是对六尘境界的知，不属于六识七识的那种知。真如无知无不知，圆满地照着一切法界，六根六尘六识上都有祂的觉性和祂的关照。祂是怎么关照的？这需要自己参，参出来了，佛法的理路就通一部分了。四圣六凡中都有祂的觉性，也有祂的关照，每个众生都有祂的关照和护持。</p><p>四、原文：<strong>而如来藏。本妙圆心。非心非空。非地非水。非风非火。非眼非耳。鼻舌身意。非色非声。香味触法。非眼识界。如是乃至。非意识界。非明无明。明无明尽。如是乃至。非老非死。非老死尽。非苦非集。非灭非道。非智非得。非檀那。非尸罗。非毗黎耶。非羼提。非禅那。非钵剌若。非波罗蜜多。如是乃至。非怛闼阿竭。非阿罗诃。三耶三菩。非大涅槃。非常非乐。非我非净。以是俱非。世出世故。</strong></p><p>释：而如来藏原本是一个微妙圆满的真心，既不是七识那样的心，也不是空无所有；既不是地也不是水，既不是风也不是火；既不是眼也不是耳鼻舌身意；既不是色也不是声香味触法；既不是眼识界也不是耳识界、鼻识界、舌识界、身识界和意识界；既不是明也不是无明以及明和无明都尽，既不是老也不是死，也不是老死尽；既不是苦也不是集，既不是灭也不是道，既不是智也不是得。</p><p>既不是布施度，也不是持戒度，既不是忍辱度也不是精进度，既不是禅定度也不是般若度，乃至于也不是到彼岸；既不是如来也不是阿罗汉，既不是正遍知也不是大涅槃；既不是常也不是乐，既不是我也不是净，乃至于如来藏什么都不是，不是一切世间出世间法。</p><p>原文：<strong>即如来藏。元明心妙。即心即空。即地即水。即风即火。即眼即耳。鼻舌身意。即色即声。香味触法。即眼识界。如是乃至。即意识界。即明无明。明无明尽。如是乃至。即老即死。即老死尽。即苦即集。即灭即道。即智即得。即檀那。即尸罗。即毗黎耶。即羼提。即禅那。即钵剌若。即波罗蜜多。如是乃至。即怛闼阿竭。即阿罗诃。三耶三菩。即大涅槃。即常即乐。即我即净。以是即俱。世出世故。即如来藏。妙明心元。离即离非。是即非即。</strong></p><p>释：但如来藏原本就是清明的微妙的心，能变现一切法，所以如来藏既是七识心也是空，既是地也是水，既是风也是火；既是眼也是耳鼻舌身意，既是色也是声香味触法，既是眼识界也是耳识界、鼻识界、舌识界、身识界和意识界；既是明和无明，也是明和无明尽；如是乃至既是老也是死和老死尽；既是苦也是集，既是灭也是道，既是智也是得。</p><p>既是布施度也是持戒度，既是忍辱度也是精进度，既是禅定度也是般若度；乃至于也是到彼岸；既是如来也是阿罗汉，既是正遍知也是大涅槃；既是常也是乐，既是我也是净。因为如来藏即是世间出世间所有一切法的缘故，如来藏这个微妙精明的本心，既离开即是（一切法），也离开不是（一切法）；既是即（一切法），也不是即（一切法）。</p><p>原文：<strong>如何世间。三有众生。及出世间。声闻缘觉。以所知心。测度如来。无上菩提。用世语言。入佛知见。譬如琴瑟。箜篌琵琶。虽有妙音。若无妙指。终不能发。汝与众生。亦复如是。宝觉真心。各各圆满。如我按指。海印发光。汝暂举心。尘劳先起。由不勤求。无上觉道。爱念小乘。得少为足。</strong></p><p>释：为什么世间里的三界众生，以及出世间的声闻缘觉，用他们所能分析思惟的了知心识，来猜测和度量如来的无上大菩提，用世间的语言来契入佛的知见呢？譬如琴瑟、箜篌和琵琶，虽然能发出微妙的音声，但如果没有巧妙的手指，无论如何也发不出来音声，你和众生们也是这样，以意识心来揣度如来的无上菩提，那怎么能揣度出来呢？每个众生宝贵的觉明真心都是无二圆满的，但是如果我一按手指，海印三昧就现前，你们刚一起心，尘劳境界就先出现了。这是因为你们不勤苦的追求大乘无上的觉悟之道，心里一直爱念着自度的小乘，证得那么少的法就满足，不肯再进一步往上修学了。</p><p>五、上一段里描述如来藏非眼耳鼻舌身意等等法，一路非下来，又接着说如来藏即眼耳鼻舌身意等等一切法，又一路即下来，这是什么意思呢？</p><p>如来藏本体无形无相，不生不灭，而眼耳鼻舌身意等等法是生灭幻化的，是有相的，二者非一，不能互相替代，然而二者又非异，眼耳鼻舌身意等等法都是如来藏出生的，不异于如来藏，二者之间有密切的关联，就像金首饰与黄金的关系一样。黄金与金首饰的功能作用不能互相代替，但是二者本质上是一样的，黄金也叫作金首饰，金首饰也就是黄金，离开黄金就没有金首饰。</p><p>如来藏即元明心妙等等这一段是说，如来藏本体不是地水火风空，不是色声香味触法，不是六识，不是生老病死，不是无明，但是这一切法都是如来藏出生和造作出来的，那么如来藏就流转为这些法，也就是这些法，这些法也就是如来藏，在本质上如来藏与这些法是一，在现象上不同，是非一非异的关系。没事的时候，拿一块泥，涅一个泥人，反反复复思惟二者的关系，就能明白如来藏与万法的关系，生出来的那个智慧就相当的深妙了。</p><p>自己体会，自己观行，才能出大智慧。明白泥人的道理，就能明白自己的五阴十八界是什么不是什么，那么断个我见，有何难？再仔细思考如来藏是如何流转为万法的？万法本质上是不是如来藏？一真法界是指什么？全体即是真如，好好观察思考，哪里还有什么虚妄法？所有的佛法都是一个体系，全部都能贯通在一起，都不是单独独立的一个分支，都是整体当中的法，也就是如来藏法。在现象上说有种种的不同，所有的相都是虚妄，在本质上说全体即真如，全部是真实的。佛法非常奇妙，如果不用心仔细体会，那就不妙了。要在定中观行思惟佛法，随观随证，随观随得，如果没有定，一切都免谈。</p></div>"
},{
    "title": "第二节 迷人忽悟喻",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  迷人忽悟喻</strong></p><p>原文：<strong>富楼那言。若此妙觉。本妙觉明。与如来心。不增不减。无状忽生。山河大地。诸有为相。如来今得。妙空明觉。山河大地。有为习漏。何当复生。</strong></p><p>释：富楼那问佛，如果这个本觉妙眀真心，在佛不增，在众生不减，本为无漏，没有无明，为什么无缘无故地就生出山河大地这些有为法相呢？如来已经完全回归到自心的圆妙觉明中，没有一点有为习漏，怎么还能生出山河大地有为有漏的法呢？</p><p>这要分两点说明，第一，众生心能够产生有为法相，不是无缘无故，都是因为无明所造的业种子存在真心如来藏中，缘熟，真心如来藏必然要根据业种产生有为有漏法相出来，与众生业种相应，与众生的无明相应。另一方面来说，众生无明不灭，七识有漏习气总是要现行出来，就会感应到有为有漏法出生。</p><p>第二，佛已经证得了圆满的本觉妙明，回归到本觉妙眀中，一切习漏断尽，则不会再出生任何有漏有为法。但佛为度化众生，可以方便示现有为法，叫作无漏有为法，这是为了方便接引众生入道。佛的自心本觉仍然有有为法性，有四大种子存在，佛不灭这些有为法，可以根据众生的缘，用四大种再现这些有为法出来，以此利乐众生无穷。虽然现出这些有为法，佛不是因为无明习漏，而是因为悲心大愿，不舍众生所致。而众生所现的有为法相，是因为无明的缘故，因为迷了的缘故，迷了，就是无明。</p><p>原文：<strong>佛告富楼那。譬如迷人。于一聚落。惑南为北。此迷为复。因迷而有。因悟所出。富楼那言。如是迷人。亦不因迷。又不因悟。何以故。迷本无根。云何因迷。悟非生迷。云何因悟。佛言。彼之迷人。正在迷时。倏有悟人。指示令悟。富楼那。于意云何。此人纵迷。于此聚落。更生迷否。否也世尊。</strong></p><p>释：佛陀告诉富楼那：譬如一个迷路的人，在一个村落里，迷惑的把南当作北，这样的迷惑是因为自己的迷惑才有的，还是因为明白了不再迷惑而有的？富楼那说：这个迷路的人既不是因为迷惑也不是因为觉悟了才迷路的。为什么这样说？因为迷惑本身是没有根本、没有原因的，怎么能是因为迷才迷的呢？觉悟了就不会迷惑了，迷惑怎么能是因为觉悟引起的呢？</p><p>佛说：那个迷路的人，正在迷惑时，忽然有不迷的识路人指示他正确的路途，让他明了正确的方向，富楼那你怎么看，这个人纵然原来迷惑不识南北，现在对于这个村落还会迷惑不识路吗？富楼那说，不会迷惑了。</p><p>佛讲解用这个比喻这个理，说明迷本无根，没有产生迷的原因，有原因就不迷了。而破除这个迷，却是有因缘的，是因为他人指出走出迷茫的方向，迷就消失了，从此以后就不会再迷了。迷，就是无明，就是不知、不懂，它没有来处，没有存无明的地方，知了懂了，无明就消失，消失了迷惑也没有去处。</p><p>众生依各自的本觉而有无明，无明即是本觉性、如来藏性。一切法都是如来藏性，一切法都是依如来藏而有。那么诸佛已经断尽无明了，将来还会不会重新再迷，又在六道里轮回呢？当然不会，迷的时候，就像含着杂质的黄金，悟的时候，就去掉了杂质，提炼出黄金，黄金提炼出来以后，就不会再去掺杂杂质，也就永远没有杂质了。就是说，诸佛断尽无明，成道以后就不会再出生无明，不会再回到众生的迷惑颠倒状态成为众生了。</p><p>原文：<strong>富楼那。十方如来。亦复如是。此迷无本。性毕竟空。昔本无迷。似有迷觉。觉迷迷灭。觉不生迷。亦如翳人。见空中花。翳病若除。花于空灭。忽有愚人。于彼空花所灭空地。待花更生。汝观是人。为愚为慧。</strong></p><p>释：富楼那，十方如来也是这样，一旦彻底觉悟，就不会再迷惑颠倒了。这种迷并没有根本，其性质毕竟是空的。往昔的时候，本来没有迷，看似好像存在着迷惑之后的觉悟，其实一个人觉悟了迷惑之后，迷惑就消失不见了，没有迷惑就是觉悟，没有真实的东西叫作觉悟，觉悟不会出生和引起迷惑。也如眼睛有翳病的人，就会看见虚空中有花点飘动，眼睛翳病如果消除了，花点就会在空中灭去了。如果有个愚痴的人，在哪个灭去花点的地方，等待着花点再次出现，你看看这个人的愚痴还是智慧。</p><p>原文：<strong>富楼那言。空元无花。妄见生灭。见花灭空。已是颠倒。敕令更出。斯实狂痴。云何更名。如是狂人。为愚为慧。佛言。如汝所解。云何问言。诸佛如来。妙觉明空。何当更出。山河大地。又如金矿。杂于精金。其金一纯。更不成杂。如木成灰。不重为木。诸佛如来。菩提涅槃。亦复如是。</strong></p><p>释：富楼那说：虚空本来没有花点，是识心虚妄的看见了花点的生和灭。可见花点在空中灭去，已经是颠倒了，还想让花点再出现，这人真是疯狂愚痴。怎么能还说这个狂人是愚痴的还是有智慧的呢？佛说：就像你所理解的那样，那你怎么来问我说，诸佛如来的微妙觉明的空性，为什么还要出生山河大地再现有为习漏呢？犹如金矿，其中掺杂了一些精细的黄金，把黄金提炼出来以后，再也不会有杂质了。又比如把木头烧成灰，灰再也不会重新变成木头了。诸佛如来，证得了菩提涅槃也是这样，不再出生有为习漏了。</p><p>第三节  演若达多喻妄无所因</p><p>一、原文：<strong>富楼那言。我与如来。宝觉圆明。真妙净心。无二圆满。而我昔遭。无始妄想。久在轮回。今得圣乘。犹未究竟。世尊。诸妄一切圆灭。独妙真常。敢问如来。一切众生。何因有妄。自蔽妙明。受此沦溺。</strong></p><p>释：富楼那说，我与如来本来都有同样无比珍贵的妙眀真心，具足一切法，微妙清净无为，没有比祂更圆满，更美妙的了。佛已经完全证得了祂，没有不圆满、不究竟的了，没有迷茫和虚妄；而我从昔以来，一直在妄想当中轮回不已，现在虽然已证得了圣果，还不究竟，只是一个小乘的了脱生死而已，还没有走上大乘之路。</p><p>世尊，当各种妄想通过修行全部都灭去了以后，只有一个圆满的妙眀真心，永远常存常住不变。那么我要问问世尊您，一切众生因为什么，有那么多的妄想，遮蔽了自己的妙眀真心，从而沦落受苦不止呢？</p><p>原文：<strong>佛告富楼那。汝虽除疑。余惑未尽。吾以世间。现前诸事。今复问汝。汝岂不闻。室罗城中。演若达多。忽于晨朝。以镜照面。爱镜中头。眉目可见。嗔责己头。不见面目。以为魑魅。无状狂走。于意云何。此人何因。无故狂走。富楼那言。是人心狂。更无他故。</strong></p><p>释：世尊告诉富楼那，你虽然已经除去了疑惑，还有一点点的迷惑没有断尽。我现在以世间现前存在的事情来问问你，你难道没有听到吗，在室罗城中有个演若达多，突然在一天早晨，用镜子来照面，于是就喜欢上了镜子中的头面，眉眼可观，于是嗔怪自己的头，怎么就没有面目呢？于是就认为自己是个魑魅鬼，不是正常人，他就无缘无故地狂乱奔走。富楼那，对于这件事你怎么想，这个人有什么原因无故狂走？富楼那说，这个人心狂乱了，再也没有别的原因了。</p><p>原文：<strong>佛言。妙觉明圆。本圆明妙。既称为妄。云何有因。若有所因。云何名妄。自诸妄想。展转相因。从迷积迷。以历尘劫。虽佛发明。犹不能返。如是迷因。因迷自有。识迷无因。妄无所依。尚无有生。欲何为灭。</strong></p><p>释：佛言：本妙觉性，本来清明而圆满，本来圆满明净而奇妙。那你把妄想称为虚妄，虚妄能有什么原因呢？如果有原因，又怎么叫作虚妄呢？众生自从无始劫以来就有妄想，以这些妄想作为因，又辗转生出新的妄想，从旧迷产生新的迷，经历了像尘埃那样多的劫数，一直都在迷惑颠倒着。</p><p>虽然佛一直在不断地为众生开示本觉妙眀，但是众生仍然不能返归自性。像这样的迷，有什么原因呢？因为迷才有迷，没有其它原因。认识到迷本无因，妄想也没有所依，也没有原因，妄想本来就没有生，还想灭它做什么呢？</p><p>二、原文：<strong>得菩提者。如寤时人。说梦中事。心纵精明。欲何因缘。取梦中物。况复无因。本无所有。如彼城中。演若达多。岂有因缘。自怖头走。忽然狂歇。头非外得。纵未歇狂。亦何遗失。</strong></p><p>释：证得菩提，返本还原的人，就像醒了以后，在诉说着梦中的事情，他的心已经是很清明觉醒的了。还会有什么因缘取着执著梦中的人事物，还有什么理由对梦中物不肯放舍呢？何况妄想本没有产生的原因，妄想也本来没有，本来就不存在。就像那个城市中的演若达多，哪有什么原因就自己恐怖于无头而失心狂走呢？如果他忽然歇下了他的狂心，就知道了自己本来是有头的，不用再向外寻觅。即使他没有歇下狂心，他的头也没有遗失啊！</p><p>原文：<strong>富楼那。妄性如是。因何为在。汝但不随。分别世间。业果众生。三种相续。三缘断故。三因不生。则汝心中。演若达多。狂性自歇。歇即菩提。胜净明心。本周法界。不从人得。何藉劬劳。肯綮修证。</strong></p><p>释：佛言：富楼那，虚妄性就是这样，能有什么原因存在呢？没有原因，你只要不随顺于你的分别妄想，不认分别妄想为真，那么三界世间、业缘果报以及众生五阴，这三种相续的缘就断了，妄想就灭，就没有虚妄了，三界世间、业果以及众生这些虚妄相就会都不存在了，剩下的就是真实。这样的话，你心中的演若达多，狂乱性自己就没有了，无明灭尽。所留下来不灭的，就是菩提心。这个殊胜清净眀妙的本心，本来遍布于法界当中，本来就存在着，不是从哪个人那里得来的。何用你辛辛苦苦，费尽心机地去向外追求，想从外面去求得呢？</p><p>原文：<strong>譬如有人。于自衣中。系如意珠。不自觉知。穷露他方。乞食驰走。虽实贫穷。珠不曾失。忽有智者。指示其珠。所愿从心。致大饶富。方悟神珠。非从外得。</strong></p><p>释：就像有个人，在自己的衣服里面，藏了一个如意宝珠，而自己把这个宝珠忘记了，由于没有财物可享用，就贫穷孤独地去向他方，过着乞讨的生活。虽然这个人很贫穷，但是宝珠并没有丢失。忽然有个有智慧的人告诉他说，你衣服里有如意宝珠在某处，于是他就找到了宝珠，拿出来享用，从此就称心如意地过上富裕的生活，。此后他就明白了这个神奇的宝珠，并非是从外面得来的，而是自己本有的家珍。</p><p>三、原文：<strong>即时阿难。在大众中。顶礼佛足。起立白佛。世尊。现说杀盗淫业。三缘断故。三因不生。心中达多。狂性自歇。歇即菩提。不从人得。斯则因缘。皎然明白。云何如来。顿弃因缘。我从因缘。心得开悟。</strong></p><p>释：这时候阿难在大众中起立，顶礼佛足之后对佛说：世尊，现在说杀盗淫三种业行，如果能引起杀盗淫的三个缘断灭了，能生起杀盗淫的三个因也不出生，那么众生心中的演若达多的狂性自然就歇息下来了。歇下来以后的心就是菩提心，这个菩提心不是从他人那里得到的。可是这个因和缘，是非常清楚非常明了的，为什么如来您一下子就否定了因缘，说不是因缘出生的？我就是从这个因缘当中，心才得以开悟的。</p><p>原文：<strong>世尊。此义何独。我等年少。有学声闻。今此会中。大目犍连。及舍利弗。须菩提等。从老梵志。闻佛因缘。发心开悟。得成无漏。今说菩提。不从因缘。则王舍城。拘舍黎等。所说自然。成第一义。惟垂大悲。开发迷闷。</strong></p><p>释：世尊，因缘生法这个道理，不仅是我们这些年轻的还在继续修学的声闻众，还有在这个大会中的大目犍连、舍利弗、须菩提等等无学的大阿罗汉等，都是从年长的婆罗门那里听到佛开示的因缘法，而心得开悟的，乃至于修成了无漏大阿罗汉。现在您却说菩提不是从因缘生出来的，那么王舍城的拘舍黎等外道们所说的自然，就成了第一义了。希望您发大慈悲心，解开我们心中的迷闷。</p><p>阿难在这里误会了佛所讲的菩提义，他以为佛还是讲的从前的因缘所生的小乘菩提，不知道真实本具的圆满妙明的大菩提如来藏心。如来藏不生不灭，岂是因缘所生的法？非因非缘，也非自然，这就是如来藏。</p><p>四、原文：<strong>佛告阿难。即如城中。演若达多。狂性因缘。若得灭除。则不狂性。自然而出。因缘自然。理穷于是。阿难。演若达多。头本自然。本自其然。无然非自。何因缘故。怖头狂走。</strong></p><p>释：佛告诉阿难，比如王舍城中的演若达多，心中发狂的因缘如果灭除了，那么他的不狂性自然就显现出来了。因缘性和自然性的道理最多就是这样。阿难，演若达多的头本来就是自然而然存在的，本来就是那样的，没有然也不是自。到底是什么因缘他害怕头消失不见了而发狂的乱走呢？</p><p>原文：<strong>若自然头。因缘故狂。何不自然。因缘故失。本头不失。狂怖妄出。曾无变易。何藉因缘。本狂自然。本有狂怖。未狂之际。狂何所潜。不狂自然。头本无妄。何为狂走。若悟本头。识知狂走。因缘自然。俱为戏论。</strong></p><p>释：如果是自然就有的头，由于某些因缘让他发狂，为什么不也是自然的由于什么因缘而失去头呢？本来而有的头不会失去的，由于发狂害怕，自己的头丢失了这样虚妄的想法就出现了，但不管怎样他的头都不会有什么改变，不会丢失掉。如何还能借着因缘头又有又无的呢？如果说发狂是自然而有的，本来就有发狂恐怖的话，那么在没有出现发狂状态时，狂燥藏在哪里呢？如果不发狂是自然而有的，那么头本来就有，不是虚妄的，他为什么还要发狂乱走，与自然性的不狂相违背呢？如果悟得了本来就有的头，就会知道发狂乱走，既不是因缘也不是自然，因缘自然都是戏论，因为都是生灭法，不是本来而有的法。</p><p>原文：<strong>是故我言。三缘断故。即菩提心。菩提心生。生灭心灭。此但生灭。灭生俱尽。无功用道。</strong></p><p><strong>若有自然。如是则明。自然心生。生灭心灭。此亦生灭。无生灭者。名为自然。犹如世间。诸相杂和。成一体者。名和合性。非和合者。称本然性。本然非然。和合非合。合然俱离。离合俱非。此句方名。无戏论法。</strong></p><p>释：因此我才说，杀盗淫三种相续的缘断除了以后，剩下的菩提心如来藏就显发出来了。菩提心出生了，生灭的心灭了，这个仍然是生灭，灭的现象和生的现象都灭了，从此在菩提道上不用再施功了，自然任运。</p><p>如果有自然性，就会显明有自然的心出生了，生灭的心灭了，但是这样还是生灭法。没有生灭的现象才叫作自然，就像世间各种相混合在一起成为一体的法，叫作和合性。不是和合起来的法叫作本然性，是本来而有的法。本然而有的法就不是自然性，和合起来的法不是一体的合。合与自然二者都离开，离开与合都不是本然。这句话所指示的才叫作无戏论法，因为指示的就是那个不生灭的本来而有的法，不是因缘和自然的法，不是合成的法。</p><p>五、原文：<strong>菩提涅槃。尚在遥远。非汝历劫。辛勤修证。虽复忆持。十方如来。十二部经。清净妙理。如恒河沙。只益戏论。汝虽谈说。因缘自然。决定明了。人间称汝。多闻第一。以此积劫。多闻熏习。不能免离。摩登伽难。何因待我。佛顶神咒。摩登伽心。淫火顿歇。得阿那含。于我法中。成精进林。爱河干枯。令汝解脱。</strong></p><p>释：证得菩提和涅槃，离你还很遥远，必须要你经历很多劫的修证才能成办。你虽然能够记得十方如来十二部经，像恒河沙一样多的清净微妙的理论，也只是戏论。你虽然自己已经非常明了了因缘法和人自然法，世间人也说你是多闻第一，但是以你累劫的多闻熏习佛法，却不能躲避摩登伽的磨难，还等待我用佛顶神咒的咒力，把摩登伽的淫欲心熄灭，让她证得了三果阿那含，在我佛法中精进修行，然后爱河彻底干枯，这才让你解脱。</p><p>在这段里世尊严厉的呵责了阿难只是多闻，并没有真正的修持，所有没有道力，遇到摩登伽被困，还需要世尊去解救。摩登伽一听到楞严咒，淫心就息了，成为三果人，灭掉一切爱欲，不再贪爱阿难，阿难这才得解放，实在是不容易。一个人无始劫的贪爱非常坚固，很难灭除，只有借助佛力，才能消除贪爱。</p><p>原文：<strong>是故阿难。汝虽历劫。忆持如来。秘密妙严。不如一日。修无漏业。远离世间。憎爱二苦。如摩登伽。宿为淫女。由神咒力。消其爱欲。法中今名。性比丘尼。与罗睺罗母。耶输陀罗。同悟宿因。知历世因。贪爱为苦。一念熏修。无漏善故。或得出缠。或蒙授记。如何自欺。尚留观听。</strong></p><p>释：因此阿难，你虽然历劫以来一直都能够忆持如来秘密微妙修证之理，却不如在一天当中用功修习断除烦恼的无漏法，远离世间的憎爱两种苦恼。比如摩登伽，她宿世都是做淫女，由于我楞严咒的神力加持，消除了她的爱欲，跟我出家修道，给她取名为性比丘尼，与罗睺罗的母亲耶输陀罗一起共同觉悟宿世的因缘，知道自己历劫以来的种种因缘，懂得了贪爱确实很苦，于是一念熏修无漏善法，一个出离了贪爱的生死缠缚，一个得到了成佛的授记。可是你阿难怎么能够自欺，还停留耳听的熏习佛法阶段，不抓紧实际修证呢？</p><p>这段还是呵责和鞭策阿难赶快进行实修，不要再停留在多闻上，并以此为满足，不全道力。如今末世的学佛人比阿难还甚，更是满足于耳入口出的嘴皮子功夫，以情思意解作为实证，自欺再去欺人，连阿难的百分之一千分之一万分之一都不如。楞严经里这段话，正好指出了学人修行的痛点，只停留在意识心的多闻习学上，而不真正的如法修行。意根不修，意识修多少都不能解脱。末法时期的现象比这要严重得多，最突出的特例就是把意识的闻熏当作实证，误会太大，而不知反省，死亡来临时，悔之晚矣。</p></div>"
},{
    "title": "第三节 演若达多喻妄无所因",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  演若达多喻妄无所因</strong><br/></p><p>一、原文：<strong>富楼那言。我与如来。宝觉圆明。真妙净心。无二圆满。而我昔遭。无始妄想。久在轮回。今得圣乘。犹未究竟。世尊。诸妄一切圆灭。独妙真常。敢问如来。一切众生。何因有妄。自蔽妙明。受此沦溺。</strong></p><p>释：富楼那说，我与如来本来都有同样无比珍贵的妙眀真心，具足一切法，微妙清净无为，没有比祂更圆满，更美妙的了。佛已经完全证得了祂，没有不圆满、不究竟的了，没有迷茫和虚妄；而我从昔以来，一直在妄想当中轮回不已，现在虽然已证得了圣果，还不究竟，只是一个小乘的了脱生死而已，还没有走上大乘之路。</p><p>世尊，当各种妄想通过修行全部都灭去了以后，只有一个圆满的妙眀真心，永远常存常住不变。那么我要问问世尊您，一切众生因为什么，有那么多的妄想，遮蔽了自己的妙眀真心，从而沦落受苦不止呢？</p><p>原文：<strong>佛告富楼那。汝虽除疑。余惑未尽。吾以世间。现前诸事。今复问汝。汝岂不闻。室罗城中。演若达多。忽于晨朝。以镜照面。爱镜中头。眉目可见。嗔责己头。不见面目。以为魑魅。无状狂走。于意云何。此人何因。无故狂走。富楼那言。是人心狂。更无他故。</strong></p><p>释：世尊告诉富楼那，你虽然已经除去了疑惑，还有一点点的迷惑没有断尽。我现在以世间现前存在的事情来问问你，你难道没有听到吗，在室罗城中有个演若达多，突然在一天早晨，用镜子来照面，于是就喜欢上了镜子中的头面，眉眼可观，于是嗔怪自己的头，怎么就没有面目呢？于是就认为自己是个魑魅鬼，不是正常人，他就无缘无故地狂乱奔走。富楼那，对于这件事你怎么想，这个人有什么原因无故狂走？富楼那说，这个人心狂乱了，再也没有别的原因了。</p><p>原文：<strong>佛言。妙觉明圆。本圆明妙。既称为妄。云何有因。若有所因。云何名妄。自诸妄想。展转相因。从迷积迷。以历尘劫。虽佛发明。犹不能返。如是迷因。因迷自有。识迷无因。妄无所依。尚无有生。欲何为灭。</strong></p><p>释：佛言：本妙觉性，本来清明而圆满，本来圆满明净而奇妙。那你把妄想称为虚妄，虚妄能有什么原因呢？如果有原因，又怎么叫作虚妄呢？众生自从无始劫以来就有妄想，以这些妄想作为因，又辗转生出新的妄想，从旧迷产生新的迷，经历了像尘埃那样多的劫数，一直都在迷惑颠倒着。</p><p>虽然佛一直在不断地为众生开示本觉妙眀，但是众生仍然不能返归自性。像这样的迷，有什么原因呢？因为迷才有迷，没有其它原因。认识到迷本无因，妄想也没有所依，也没有原因，妄想本来就没有生，还想灭它做什么呢？</p><p>二、原文：<strong>得菩提者。如寤时人。说梦中事。心纵精明。欲何因缘。取梦中物。况复无因。本无所有。如彼城中。演若达多。岂有因缘。自怖头走。忽然狂歇。头非外得。纵未歇狂。亦何遗失。</strong></p><p>释：证得菩提，返本还原的人，就像醒了以后，在诉说着梦中的事情，他的心已经是很清明觉醒的了。还会有什么因缘取着执著梦中的人事物，还有什么理由对梦中物不肯放舍呢？何况妄想本没有产生的原因，妄想也本来没有，本来就不存在。就像那个城市中的演若达多，哪有什么原因就自己恐怖于无头而失心狂走呢？如果他忽然歇下了他的狂心，就知道了自己本来是有头的，不用再向外寻觅。即使他没有歇下狂心，他的头也没有遗失啊！</p><p>原文：<strong>富楼那。妄性如是。因何为在。汝但不随。分别世间。业果众生。三种相续。三缘断故。三因不生。则汝心中。演若达多。狂性自歇。歇即菩提。胜净明心。本周法界。不从人得。何藉劬劳。肯綮修证。</strong></p><p>释：佛言：富楼那，虚妄性就是这样，能有什么原因存在呢？没有原因，你只要不随顺于你的分别妄想，不认分别妄想为真，那么三界世间、业缘果报以及众生五阴，这三种相续的缘就断了，妄想就灭，就没有虚妄了，三界世间、业果以及众生这些虚妄相就会都不存在了，剩下的就是真实。这样的话，你心中的演若达多，狂乱性自己就没有了，无明灭尽。所留下来不灭的，就是菩提心。这个殊胜清净眀妙的本心，本来遍布于法界当中，本来就存在着，不是从哪个人那里得来的。何用你辛辛苦苦，费尽心机地去向外追求，想从外面去求得呢？</p><p>原文：<strong>譬如有人。于自衣中。系如意珠。不自觉知。穷露他方。乞食驰走。虽实贫穷。珠不曾失。忽有智者。指示其珠。所愿从心。致大饶富。方悟神珠。非从外得。</strong></p><p>释：就像有个人，在自己的衣服里面，藏了一个如意宝珠，而自己把这个宝珠忘记了，由于没有财物可享用，就贫穷孤独地去向他方，过着乞讨的生活。虽然这个人很贫穷，但是宝珠并没有丢失。忽然有个有智慧的人告诉他说，你衣服里有如意宝珠在某处，于是他就找到了宝珠，拿出来享用，从此就称心如意地过上富裕的生活，。此后他就明白了这个神奇的宝珠，并非是从外面得来的，而是自己本有的家珍。</p><p>三、原文：<strong>即时阿难。在大众中。顶礼佛足。起立白佛。世尊。现说杀盗淫业。三缘断故。三因不生。心中达多。狂性自歇。歇即菩提。不从人得。斯则因缘。皎然明白。云何如来。顿弃因缘。我从因缘。心得开悟。</strong></p><p>释：这时候阿难在大众中起立，顶礼佛足之后对佛说：世尊，现在说杀盗淫三种业行，如果能引起杀盗淫的三个缘断灭了，能生起杀盗淫的三个因也不出生，那么众生心中的演若达多的狂性自然就歇息下来了。歇下来以后的心就是菩提心，这个菩提心不是从他人那里得到的。可是这个因和缘，是非常清楚非常明了的，为什么如来您一下子就否定了因缘，说不是因缘出生的？我就是从这个因缘当中，心才得以开悟的。</p><p>原文：<strong>世尊。此义何独。我等年少。有学声闻。今此会中。大目犍连。及舍利弗。须菩提等。从老梵志。闻佛因缘。发心开悟。得成无漏。今说菩提。不从因缘。则王舍城。拘舍黎等。所说自然。成第一义。惟垂大悲。开发迷闷。</strong></p><p>释：世尊，因缘生法这个道理，不仅是我们这些年轻的还在继续修学的声闻众，还有在这个大会中的大目犍连、舍利弗、须菩提等等无学的大阿罗汉等，都是从年长的婆罗门那里听到佛开示的因缘法，而心得开悟的，乃至于修成了无漏大阿罗汉。现在您却说菩提不是从因缘生出来的，那么王舍城的拘舍黎等外道们所说的自然，就成了第一义了。希望您发大慈悲心，解开我们心中的迷闷。</p><p>阿难在这里误会了佛所讲的菩提义，他以为佛还是讲的从前的因缘所生的小乘菩提，不知道真实本具的圆满妙明的大菩提如来藏心。如来藏不生不灭，岂是因缘所生的法？非因非缘，也非自然，这就是如来藏。</p><p>四、原文：<strong>佛告阿难。即如城中。演若达多。狂性因缘。若得灭除。则不狂性。自然而出。因缘自然。理穷于是。阿难。演若达多。头本自然。本自其然。无然非自。何因缘故。怖头狂走。</strong></p><p>释：佛告诉阿难，比如王舍城中的演若达多，心中发狂的因缘如果灭除了，那么他的不狂性自然就显现出来了。因缘性和自然性的道理最多就是这样。阿难，演若达多的头本来就是自然而然存在的，本来就是那样的，没有然也不是自。到底是什么因缘他害怕头消失不见了而发狂的乱走呢？</p><p>原文：<strong>若自然头。因缘故狂。何不自然。因缘故失。本头不失。狂怖妄出。曾无变易。何藉因缘。本狂自然。本有狂怖。未狂之际。狂何所潜。不狂自然。头本无妄。何为狂走。若悟本头。识知狂走。因缘自然。俱为戏论。</strong></p><p>释：如果是自然就有的头，由于某些因缘让他发狂，为什么不也是自然的由于什么因缘而失去头呢？本来而有的头不会失去的，由于发狂害怕，自己的头丢失了这样虚妄的想法就出现了，但不管怎样他的头都不会有什么改变，不会丢失掉。如何还能借着因缘头又有又无的呢？</p><p>如果说发狂是自然而有的，本来就有发狂恐怖的话，那么在没有出现发狂状态时，狂燥藏在哪里呢？如果不发狂是自然而有的，那么头本来就有，不是虚妄的，他为什么还要发狂乱走，与自然性的不狂相违背呢？如果悟得了本来就有的头，就会知道发狂乱走，既不是因缘也不是自然，因缘自然都是戏论，因为都是生灭法，不是本来而有的法。</p><p>原文：<strong>是故我言。三缘断故。即菩提心。菩提心生。生灭心灭。此但生灭。灭生俱尽。无功用道。</strong></p><p><strong>若有自然。如是则明。自然心生。生灭心灭。此亦生灭。无生灭者。名为自然。犹如世间。诸相杂和。成一体者。名和合性。非和合者。称本然性。本然非然。和合非合。合然俱离。离合俱非。此句方名。无戏论法。</strong></p><p>释：因此我才说，杀盗淫三种相续的缘断除了以后，剩下的菩提心如来藏就显发出来了。菩提心出生了，生灭的心灭了，这个仍然是生灭，灭的现象和生的现象都灭了，从此在菩提道上不用再施功了，自然任运。</p><p>如果有自然性，就会显明有自然的心出生了，生灭的心灭了，但是这样还是生灭法。没有生灭的现象才叫作自然，就像世间各种相混合在一起成为一体的法，叫作和合性。不是和合起来的法叫作本然性，是本来而有的法。本然而有的法就不是自然性，和合起来的法不是一体的合。合与自然二者都离开，离开与合都不是本然。这句话所指示的才叫作无戏论法，因为指示的就是那个不生灭的本来而有的法，不是因缘和自然的法，不是合成的法。</p><p>五、原文：<strong>菩提涅槃。尚在遥远。非汝历劫。辛勤修证。虽复忆持。十方如来。十二部经。清净妙理。如恒河沙。只益戏论。汝虽谈说。因缘自然。决定明了。人间称汝。多闻第一。以此积劫。多闻熏习。不能免离。摩登伽难。何因待我。佛顶神咒。摩登伽心。淫火顿歇。得阿那含。于我法中。成精进林。爱河干枯。令汝解脱。</strong></p><p>释：证得菩提和涅槃，离你还很遥远，必须要你经历很多劫的修证才能成办。你虽然能够记得十方如来十二部经，像恒河沙一样多的清净微妙的理论，也只是戏论。你虽然自己已经非常明了了因缘法和人自然法，世间人也说你是多闻第一，但是以你累劫的多闻熏习佛法，却不能躲避摩登伽的磨难，还等待我用佛顶神咒的咒力，把摩登伽的淫欲心熄灭，让她证得了三果阿那含，在我佛法中精进修行，然后爱河彻底干枯，这才让你解脱。</p><p>在这段里世尊严厉的呵责了阿难只是多闻，并没有真正的修持，所有没有道力，遇到摩登伽被困，还需要世尊去解救。摩登伽一听到楞严咒，淫心就息了，成为三果人，灭掉一切爱欲，不再贪爱阿难，阿难这才得解放，实在是不容易。一个人无始劫的贪爱非常坚固，很难灭除，只有借助佛力，才能消除贪爱。</p><p>原文：<strong>是故阿难。汝虽历劫。忆持如来。秘密妙严。不如一日。修无漏业。远离世间。憎爱二苦。如摩登伽。宿为淫女。由神咒力。消其爱欲。法中今名。性比丘尼。与罗睺罗母。耶输陀罗。同悟宿因。知历世因。贪爱为苦。一念熏修。无漏善故。或得出缠。或蒙授记。如何自欺。尚留观听。</strong></p><p>释：因此阿难，你虽然历劫以来一直都能够忆持如来秘密微妙修证之理，却不如在一天当中用功修习断除烦恼的无漏法，远离世间的憎爱两种苦恼。比如摩登伽，她宿世都是做淫女，由于我楞严咒的神力加持，消除了她的爱欲，跟我出家修道，给她取名为性比丘尼，与罗睺罗的母亲耶输陀罗一起共同觉悟宿世的因缘，知道自己历劫以来的种种因缘，懂得了贪爱确实很苦，于是一念熏修无漏善法，一个出离了贪爱的生死缠缚，一个得到了成佛的授记。可是你阿难怎么能够自欺，还停留耳听的熏习佛法阶段，不抓紧实际修证呢？</p><p>这段还是呵责和鞭策阿难赶快进行实修，不要再停留在多闻上，并以此为满足，不全道力。如今末世的学佛人比阿难还甚，更是满足于耳入口出的嘴皮子功夫，以情思意解作为实证，自欺再去欺人，连阿难的百分之一千分之一万分之一都不如。楞严经里这段话，正好指出了学人修行的痛点，只停留在意识心的多闻习学上，而不真正的如法修行。意根不修，意识修多少都不能解脱。末法时期的现象比这要严重得多，最突出的特例就是把意识的闻熏当作实证，误会太大，而不知反省，死亡来临时，悔之晚矣。</p></div>"
},{
    "title": "第五章 第五卷二十五圣所悟圆通法门",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  第五卷二十五圣所悟圆通法门</strong></p><p>一、原文：<strong>世尊普告众中。诸大菩萨。及诸漏尽。大阿罗汉。汝等菩萨。及阿罗汉。生我法中。得成无学。吾今问汝。最初发心。悟十八界。谁为圆通。从何方便。入三摩地。</strong></p><p><strong>骄陈那五比丘。即从座起。顶礼佛足。而白佛言。我在鹿苑。及于鸡园。观见如来。最初成道。于佛音声。悟明四谛。佛问比丘。我初称解。如来印我。名阿若多。妙音密圆。我于音声。得阿罗汉。佛问圆通。如我所证。音声为上。</strong></p><p>释：世尊对诸大菩萨及阿罗汉们说：你们诸大菩萨和阿罗汉，在我佛法中出生，修成了四果无学，我现在问你们，你们每个人在最初发心修学想证悟十八界的时候，是以哪个界为圆通法门，用什么方法修行，证入了三摩地？</p><p>憍陈那五个比丘马上从座位上站起来，顶礼佛足对佛说：我们在鹿野苑及鸡园，亲眼看见如来您最初成道，为我们讲四圣谛苦空无常无我，我们在佛的音声上证悟了四圣谛。佛问我们五个比丘对四圣谛理的修证情况时，我们说刚刚证解了四圣谛，于是如来就印证了我们是阿若多，于佛的微妙法音悟明秘密圆通。我们从音声这个声尘上，证得了阿罗汉果。佛问圆通法门，就像我们所证得的那样，在音声上证悟是最殊胜的。</p><p>憍陈如五比丘是从十八界中的声尘界上悟得圆通的，其他二十四圣分别从各个尘界上悟得圆通。</p><p>憍陈如五比丘，从佛刚开始出家去雪山修道时，就跟随着佛陀一起修道。那时候佛陀是跟随外道修四禅八定，所以憍陈如也一直跟随佛陀修习四禅八定，没有其它修行方法。当佛陀证得四禅八定以后，也没有获得解脱的大智慧，也没有成佛，世尊就知道，只一味的修习禅定不能得解脱，这不是解脱成佛的修行方法，于是就舍弃了一味修定的方法。</p><p>那时候佛陀一日只吃一麻一麦，饿得皮包骨，佛陀就意识到单纯的苦行也不能得道，于是舍弃苦行，到泥连河边沐浴。出浴后就接受了牧羊女供养的羊奶，喝完羊奶以后，世尊就到菩提树下重新参究佛法。憍陈如五比丘一看佛陀不修禅定，也不修苦行了，就认为佛陀退道了。于是五比丘离开佛陀，到另一处单独修行。</p><p>直到佛陀成道以后，找到五比丘，教导他们四圣谛理，他们马上就证得了阿罗汉果。五比丘为什么证果这么快呢？因为他们跟随佛陀修习四禅八定，有甚深的四禅八定禅定基础，禅定非常好，戒律也守持的非常好，心细，思惟深透，一听佛陀讲法，瞬间就能在禅定中观行出无我真谛，就证果了。所以说只有在戒定慧具足时，才能证果。</p><p>如果他们没有禅定基础，闻法之后，既要修习禅定，又要理解思惟佛法，然后才能在禅定中思惟观行，指不定什么时候能证果，直到禅定具足，思惟观行才敏捷而深透。所以佛法的成就离不开戒，离不开甚深禅定，也离不开观行智慧。佛陀在菩提树下夜睹明星悟道成佛，也离不开最初跟外道所修习的四禅八定，没有四禅八定的基础，佛陀不可能悟道成佛。</p><p>所以说苦行虽然不是道，但是离开苦行也没有道，适当的苦行，能培养和保持道心，能培养和保持出离心，贪图享受很难有出离心，很难有道。外道的四禅八定虽然不能解脱生死，但是离开四禅八定也同样不能解脱生死，不能成就佛道。</p><p>二、原文：<strong>优波尼沙陀。即从座起。顶礼佛足。而白佛言。我亦观佛。最初成道。观不净相。生大厌离。悟诸色性。以从不净。白骨微尘。归于虚空。空色二无。成无学道。如来印我。名尼沙陀。尘色既尽。妙色密圆。我从色相。得阿罗汉。佛问圆通。如我所证。色因为上。</strong></p><p>释：优波尼沙陀立即从座位上起立，顶礼佛足之后，对佛说：我也观察佛陀最初成道以后对比丘们讲法，我选择修白骨观，观色身的不净，心里生起了对色身很大的厌离心。悟到了一切色法的本性，都是从不净的白骨色相化为微尘，逐渐归于虚空，悟到空和色都无，成就了四果无学位。如来给我印证为尼沙坨（微细色）。观行到最后，六尘的色相在心里消尽以后，微妙的色相所含藏着甚深秘密，我从色相上证得阿罗汉。佛问我圆通法门，就像我所证得的，观察色身不净最为根本。</p><p>优波尼沙陀修白骨观，观色身的不净，把色身观成了白骨，又把白骨观成了微细的色尘，最后微细的色尘消失，成为了空无。这一切的观行都是在甚深的禅定当中进行的，所观行出来的白骨属于定果色，他人不可见，只能自己在禅定中慧眼见，这个见不是肉眼见，否则他人也能见了。他在定中见到白骨以后，继续观行，把白骨观行成最微细的微尘，接近于虚空的微粒，最后就化为了无，心里色和空都没有了，全部都空了。这些境界都属于定果色，是三昧境界，有定有慧，依此三昧境界，就能解脱出三界。</p><p>如果没有禅定，就来观行这些法，只能用意识想象一下，但永远想象不出白骨和微尘，更不能把微尘化为空，并且把空也空掉。所以定慧等持叫作实修，实修的结果才叫作实证。一切法的修证都是如此，没有其它捷径可走，禅定是躲不过去的。</p><p>优波尼沙陀把色相看成空，并不是看见微细色相变成了虚空，成了空无，而是他证得色身是空的，内心的认知改变了，思想观念转变了，大智慧境界出现了，出现了定慧具足的三昧境界。在证道的三昧里有定有慧，在定境中出现了定果色，色法变成了空，空和色都消失，一片空无。但是出了定境以后，优波尼沙陀见色还是由四大种子组成的色，不会把色变成虚空，因为色与空是对立的，色不能析成虚空，虚空不能合成色，再微细的色尘也不能变成虚空，成为空无。</p><p>三、原文：<strong>香严童子。即从座起。顶礼佛足。而白佛言。我闻如来。教我谛观。诸有为相。我时辞佛。宴晦清斋。见诸比丘。烧沉水香。香气寂然。来入鼻中。我观此气。非木非空。非烟非火。去无所著。来无所从。由是意销。发明无漏。如来印我。得香严号。尘气倏灭。妙香密圆。我从香严。得阿罗汉。佛问圆通。如我所证。香严为上。</strong></p><p>释：香严童子这时候就从座位上起立，顶礼佛足之后对佛说：我听见如来教我仔细观察一切诸有为相，我离开佛以后就开始一个人在寂静处观行思惟。有一天看见几个比丘们在烧沉水香，香气不知不觉的飘过来进入我的鼻子当中。我就观察这个香气，心里思惟这个香气不是从香木中来，也不是从虚空中来，不是从烟中来，也不是从火中来，香气消失了以后也不附着在任何物上，没有任何去处，香气来的时候，也找不到一个来处。</p><p>想着想着，我的心念都没有了，所有的意想都消失了，就证得了四果无学，漏尽成阿罗汉。如来印证我得了香严的称号。从此以后，世间的尘气在我的境界中就不存在了，微妙的香气微密圆妙，我从香严上证得了阿罗汉。佛问我圆通法门，就像我所证得的，以香严最为上首。</p><p>香严童子在观察香气的时候，定力非常深细，思惟很灵敏细致，观察入微，以至于发起了三昧。香严童子思惟：沉水香气是从什么地方过来的呢？如果是从香木上过来的，那么香木所在之处应该都有这样的香气，可是香木不点燃的时候就没有这样的香气；如果香气是从虚空来的，那么虚空常在，香气应该常存才对，可是却不是这样；如果香气是从烟中过来的，可是普通木材的烟中却没有这样的香气；如果香气是从火中来的，可是其它的火中却没有这样的香气。最后确定香气来无所来，去无所去，香气是空的，于是心就空了，所有的烦恼都脱落尽净，证得了阿罗汉果。</p><p>证得阿罗汉果最低要具足有初禅定，最高要有四禅八定，有这样深的禅定，心思是非常细密的，观行都是现量观行，没有情思意解，没有想象和揣测。意识的思惟作用非常少，意根的思量用得非常多，所以解靠意识，证一定是依靠意根。意识知其然不知其所以然是解，意根不仅知其然，更是知其所以然，所以是证；意识的解粗而略，无法细致入微，意根的证细致入微，深入表里，知其来龙去脉。所有的三昧智慧境界都是意根与意识同证，定慧具足。</p><p>四、原文：<strong>药王药上。二法王子。并在会中。五百梵天。即从座起。顶礼佛足。而白佛言。我无始劫。为世良医。口中尝此。娑婆世界。草木金石。名数凡有十万八千。如是悉知。苦醋咸淡。甘辛等味。并诸和合。俱生变异。是冷是热。有毒无毒。悉能遍知。承事如来。了知味性。非空非有。非即身心。非离身心。分别味因。从是开悟。蒙佛如来。印我昆季。药王药上。二菩萨名。今于会中。为法王子。因味觉明。位登菩萨。佛问圆通。如我所证。味因为上。</strong></p><p>释：药王和药上两位法王子以及在会中的五百梵天众，从座位上起立，顶礼佛足，对佛说：我们兄弟两人从无始劫以来，生生世世在这个世间做良医，我们口中品尝这个娑婆世界的药草药材和金石之类的东西，数起来有无量之多。所以我们能够知道这些药材的苦味、酸味、咸味、淡味、甜味和辣味，以及这些味尘和合在一起的混合变异味。这些药材是凉性的还是热性的，有毒还是无毒的，我们全部都能知道。</p><p>自从奉事供养如来以后，逐渐了知这些味性既不是空也不是有，既不是属于身心上的，也不离身心而有。我们参究味尘出生的因，所以就开悟了，承蒙如来印证我们兄弟二人，并且取名为为药王菩萨和药上菩萨。在此大会中，我们是作为法王子来参与法会的，因为辨别味尘的起因而觉悟诸法，悟明诸法的真实相，登上了菩萨之位。佛问我们修学的圆通法门，就像我们所证得的那样，是以辨析味尘出生的因，为第一圆通法门。</p><p>药王药上二菩萨是从六尘中的味尘入道，修到了法王子的阶位，成为离佛最近的等妙觉菩萨。在长期接触品尝药材味道的过程中，起了疑情，想探究味尘的由来，探究来探究去，找不到味尘的来处和去处，于是证得了味尘是因缘和合所出生的法，非空非有，空非真空，有非实有，是如来藏依缘幻化的产物。于是般若大智慧出生，被佛印证和授记，成为法王子，即将成佛，继承佛位。一切万法，如果在甚深的禅定中去探明起因，因缘时节成熟的时候，都会证得小乘的空和大乘的空，明了其中空有不二，非一非异的微妙关系，从此再也不被诸法所迷惑。</p><p>五、原文：<strong>跋陀婆罗。并其同伴。十六开士。即从座起。顶礼佛足。而白佛言。我等先于。威音王佛。闻法出家。于浴僧时。随例入室。忽悟水因。既不洗尘。亦不洗体。中间安然。得无所有。宿习无忘。乃至今时。从佛出家。今得无学。彼佛名我。跋陀婆罗。妙触宣明。成佛子住。佛问圆通。如我所证。触因为上。</strong></p><p>释：跋陀婆罗与他的同伴十六名菩萨大士，从座位上起立，顶礼佛足，对佛说：我们是在威音王佛那时候闻到佛法出家修行的，在一次僧人们洗浴的时候，我也随着按照次第进入浴室。在洗浴的时候，忽然间就悟到了水的因缘，它既不能清洗尘灰，也不能清洗身体，在洗浴的中间并没有什么事发生，水是水，尘是尘，身体是身体，互不相触、互不妨碍，没有相生相克之事。于是证得一切法空，并没有什么法能够得到和拥有。</p><p>我把一切法都看空已经成了习惯，生生世世不能忘记，遇到任何法心里都是空，一直到今世跟随佛陀出家修道，证得了四果无学的果位。佛给我取名叫作跋陀婆罗，因为洗浴时的妙触，而心地开明，坐到佛子的宝座。佛问我圆通法门，就像我所证得的那样，以触尘作为最上的圆通法门。</p><p>为什么水不能洗尘也不能洗身体呢？因为诸法无自性，无情物的色法更是无自性，因此水并没有洗尘洗体的功能作用，尘被清洗下来，并不是水的功德，身体变得清洁了，并不是水的功德。水与尘了不相触，水与身体了不相触，同理，身体与尘也了不相触。既然色法之间本没有交界，那就不能互相改变什么。可是结果呢？尘确实是被洗下来了，身体确实被洗干净了。这也确实是神奇的事，所以跋陀婆罗证得了诸法本性，就把这神奇事叫作妙触，并且把这妙触的证量宣明了出来，让众人知，以启发众人都能证此妙触。</p><p>但是要想证得这个妙触，要有甚深的禅定，离开禅定就没有任何证量，情思意解出来的没有实际功德受用，说食不饱。禅定深的时候，疑情才能深，能随时随地在疑情中，遇到相应的缘，敛念深思，就能悟道。之后，知其然，也会知其所以然，三昧现前，大智慧生起，甚至大神通显现，实证者皆如此。</p><p>六、原文：<strong>摩诃迦叶。及紫金光。比丘尼等。即从座起。顶礼佛足。而白佛言。我于往劫。于此界中。有佛出世。名日月灯。我得亲近。闻法修学。佛灭度后。供养舍利。燃灯续明。以紫光金。涂佛形像。自尔已来。世世生生。身常圆满。紫金光聚。此紫金光。比丘尼者。即我眷属。同时发心。</strong></p><p><strong>我观世间。六尘变坏。惟以空寂。修于灭尽。身心乃能。度百千劫。犹如弹指。我以空法。成阿罗汉。世尊说我。头陀为最。妙法开明。销灭诸漏。佛问圆通。如我所证。法因为上。</strong></p><p>释：大迦叶和紫光金比丘尼等人从座位上起立，顶礼佛足，对佛说：我过去某个劫，出生在这个世界中，遇到一尊佛出世，名叫日月灯如来，我与此尊佛亲近，听闻佛法跟随佛修学佛法。日月灯佛灭度以后，我就供养佛的舍利，并且为佛燃烧长明灯，延续佛前的光明，又用紫光色的金子涂画佛像。从那时候以来，我生生世世色身常常布满紫金光色，这位紫光金比丘尼就是我那时候的眷属，跟我同时发心供佛修道。</p><p>我常常观察世间，六尘境界是无常不可靠的，总是在不断的变坏，所以我对一切境界心常空寂，渐渐的修出了灭尽定。在灭尽定中身心不动，经过百千劫犹如一弹指的时间。我因为能空掉一切法，成为了阿罗汉，世尊说我是头陀第一。我以微妙的开启我智慧的光明，消灭一切烦恼漏。佛问我修行的圆通法门，就像我所证得的那样，空法为最上第一。</p><p>大迦叶阿罗汉有三个特征：一，由于用紫金涂佛像，生生世世全身都是紫金光色；二，生生世世行头陀行，少欲知足；三，心常空寂入灭尽定中。大迦叶在深定中观察六尘的无常生灭，所以心是空寂的，对于世间没有任何希求和乞求，灭去执取心，才能入灭尽定中，不但意识不知一切法，意根对一切法也是无受无知，能随时随地入无余涅槃而不入。现在还在鸡足山入定，等待五亿多年以后弥勒佛下生，把释迦佛的金缕袈裟转交给弥勒佛。</p><p>心空是最有力量的，能降伏一切法，不被一切法所降伏。为什么心能空掉一切法？因为一切法本身是空的，所以心根本求取不到任何法，这样就不得不空。既然心都空了，还有什么法能系缚得了空了的心呢？还有什么法能征服得了空了的心呢？谁都奈何不了心空的人，一切法在心空的人面前都失去了威力，无所能为，而心空的人能为一切法，成就一切事业。</p><p>七、原文：<strong>阿那律陀。即从座起。顶礼佛足。而白佛言。我初出家。常乐睡眠。如来诃我。为畜生类。我闻佛诃。啼泣自责。七日不眠。失其双目。世尊示我。乐见照明。金刚三昧。我不因眼。观见十方。精真洞然。如观掌果。如来印我。成阿罗汉。佛问圆通。如我所证。旋见循元。斯为第一。</strong></p><p>释：阿那律陀从座位上起立，顶礼佛足之后，对佛说：我刚出家的时候，总是喜欢睡眠，如来就呵责我，说我像畜生似的贪睡。我听到佛的呵责，忏愧自责，七天不睡觉，熬坏了双眼，世尊您就教我修行乐见照明金刚三昧。金刚三昧修出来以后，我不用肉眼就能看见十方世界的景象，非常精细真实，洞彻无碍，就像观察自己手中的庵摩罗果一样，如来印证我成为了阿罗汉。佛问我圆通法门，就像我所证得的那样，由原来眼睛向外看物，反过来向内看，观察能见色的根源，证得了色空我空，成为四果无学，这是我所修证的第一法门。</p><p>阿那律陀修这个乐见照明金刚三昧，每天用心眼反观能见色到底是什么，是如何见的色，禅定越来越深，观行智慧越来越深，最后找到了根源，三昧出现，天眼通随即现前，成为四果。修行时戒定慧完全具足，非常精进，金刚三昧必然现前。这就是实修的样板，不是像有些人那样精进学一些知识就满足，以为到家了，慢心炽盛却一无所是。靠意识积累的知识，犹如空中楼阁，死后什么也没有，意根一贫如洗的与如来藏一起去到后世，能有什么？</p><p>八、原文：<strong>周利槃特迦。即从座起。顶礼佛足。而白佛言。我阙诵持。无多闻性。最初值佛。闻法出家。忆持如来。一句伽陀。于一百日。得前遗后。得后遗前。佛愍我愚。教我安居。调出入息。我时观息。微细穷尽。生住异灭。诸行刹那。其心豁然。得大无碍。乃至漏尽。成阿罗汉。住佛座下。印成无学。佛问圆通。如我所证。返息循空。斯为第一。</strong></p><p>释：周利槃特迦从座位上起立，顶礼佛足，对佛说：我对经文和偈颂不能很好的诵持，记忆力不好，最开始遇见佛时，听见佛讲法，我就跟随着佛出家修道了。我想背诵一句偈子，在一百天当中，背得了前边的内容，就忘记了后边的内容，背得了后边的内容，就忘记了前边的内容。佛怜悯我的愚痴，教我安居在一处，专门调出息和入息。</p><p>我就开始观呼吸，越观呼吸，呼吸越微细，以至于渐渐呼吸断尽，进入四禅定。出定后再观察呼吸的生住异灭，以及一切身行刹那的生灭，一切行蕴的刹那生灭，心就豁然开明，证得了诸行的空和五蕴的空，心对五蕴世间再也没有滞碍了，于是烦恼断尽，成为四果大阿罗汉。住在佛座下，被佛印证为无学位。佛问我圆通法门，就像我所证得的，反观自己的呼吸渐渐深入，顿入空无，证得诸行都是空，这是我修证的第一圆通法门。</p><p>周利槃特迦对于法理比较愚钝，没有忆持力，佛知他的根性，教他观呼吸方法，证果方法不是从理论入手，而是在实际的身行上入手，观呼吸心逐渐止在呼吸上，禅定越来越深，心越来越细，呼吸也越来越细，细到一定程度就断了，于是周利槃特迦就观到了呼吸的生住异灭的现象，再逐渐观行到五蕴身运行的生住异灭的现象，就证得了五蕴诸行法的空，证得了阿罗汉果。</p><p>所以实修是要身体力行，一定要心止一处才能起观行的智慧，定慧等持，才能证得三昧，得法眼净，超越生死得解脱。观行力不足的人，应该多修习禅定；修行不得力的人，仔细寻找原因，适当的调整自己修行的方向和方法，一门深入的修行，才能有所成就。真修行根本不是耍聪明能成办的，必须脚踏实地，步步有脚印，不下决心修出禅定，一切都是空中楼阁。</p><p>九、原文：<strong>憍梵钵提。即从座起。顶礼佛足。而白佛言。我有口业。于过去劫。轻弄沙门。世世生生。有牛齝病。如来示我。一味清净。心地法门。我得灭心。入三摩地。观味之知。非体非物。应念得超。世间诸漏。内脱身心。外遗世界。远离三有。如鸟出笼。离垢销尘。法眼清净。成阿罗汉。如来亲印。登无学道。佛问圆通。如我所证。还味旋知。斯为第一。</strong></p><p>释：憍梵波提从座位上起立，顶礼佛足，回答佛说：我从前造过恶口业行，在过去一个时劫里讥笑过一个出家人，说他吃饭像牛嚼草似的，从此就受了五百世牛的果报，以后生生世世吃饭就像牛嚼草一样。后来遇见佛的时候，佛教给我一个修行方法，叫作一味清净心地法门，我按照佛的教示修行，就灭了心行，看一切法都是空，不起心念。</p><p>于是入到三摩地中，观察对味尘的知性，即没有自体也不是什么物，是空的，这个念头一起就超越了世间的所有烦恼，心得清净了，在五阴身内身心都得脱落，没有了身心世界，对五阴身外的世界也得心空，没有了世界。这样内心就远离了三界的有法，就像鸟出离了牢笼，烦恼污垢都消除了，一切尘境都消失了，法眼清净，成为四果阿罗汉。如来亲自印证我达到了无学位。佛问我圆通法门，就像我所证得的，接触到味尘，就观察对味尘的知性，然后把知性观空，我以这个法门为第一圆通法门。</p><p>凡是证果之人，无不是在定中深细极深细的思惟观行，证得五蕴空十八界空，从而身心俱空，破除四相。只不过空的程度不同，破除的相层次不同，证果的果位有所不同而已。根本没有不持戒不修定不会观行能证果的，证果的人三十七道品都满足，没有依靠意识的思惟推理分析而证果的，没有证果以后仍然烦恼深重，到处造恶业如凡夫一般的。心空之人不见法，不见有什么法值得去造恶业的，所以心还在着相不空之人就一定没有断我见，初果向也不是，何况初果。</p><p>憍梵波提过去造作的口业，讥笑出家人，感召到那么大的恶业果报，现在很多人烦恼都深重，对出家人造作的恶业远远大于讥笑讽刺很多倍，后世的果报肯定要远远大于憍梵波提很多倍。这些无知的人该怎么办，自己考虑掂量清楚，但是很多人因为无知是不会认真去考量掂量的，只有去受这些恶业果报了，所以三恶道众生前仆后继，永远不会断绝。</p><p>十、毕陵伽颇蹉尊者修行经验</p><p>原文：<strong>我初发心，从佛入道，数闻如来。说诸世间。不可乐事。乞食城中，心思法门，不觉路中。毒刺伤足，举身疼痛。我念有知，知此深痛；虽觉觉痛，觉清净心，无痛痛觉。我又思惟：如是一身宁有双觉？摄念未久，身心忽空。三七日中，诸漏虚尽，成阿罗汉。得亲印记，发明无学。佛问圆通，如我所证，纯觉遗身，斯为第一。</strong></p><p>释：我刚开始发心出家的时候，跟随着佛入道修行，经常听佛讲一些世间不可乐着的事情。有一次在城市中乞食，心里思考着修行的法门，走在路途上，不小心被毒刺刺伤了脚，全身都觉得疼痛。我的心念当时就有一个知，知道这种深深的疼痛。意识虽然知道自己（身识）很痛，可是也知道自性清净心并不痛，祂没有痛觉。</p><p>我又思惟到：我一个身体难道有两个觉知吗？这样疑情生起，摄持住了心念不往外驰散，不久，身心突然都空了。以后在二十一天当中，所有的烦恼都空尽断尽了，成为四果阿罗汉。后来得到佛陀亲自印证，修到了无学位。现在佛问我能够通达佛法的修行方法，像我所修证的那样，内心里只有觉观，思惟一个法义，忘记了色身的存在，这样住在禅定中，智慧出生，证得了无我，得阿罗汉果。</p><p>感觉身体疼痛的知以身识为主，身识知疼痛的触尘。还有一个知，是意识的知，意识一方面知身识的知，知道身识现在深深的疼痛着；一方面知疼痛的细相，主要是心痛不舒服的痛觉苦恼，再知意识自己的心痛，就是意识的证自证分，是反观自己的知。因为尊者一心在修行上，虽然身体很痛，但是他的心念却是清净的，在痛中思惟一个不痛的，疑情生起，于是就住在深深的疑情中，禅定就出现了。在禅定中他经过深细的思惟参究，既然一身中没有两个知觉，那么身体上的知觉就是不痛的真心如来藏的，不是意识和身识的，意识身识以及五阴身都是空的，于是证得了五阴无我。</p><p>之后由于他的专注力觉知力，初禅生起，在二十一天里次第断除了烦恼，成为无漏的大阿罗汉。这就是证果和明心的修行过程，实修实证的过程。戒定慧三学具足，尊者的戒行肯定是圆满的，禅定生起，最后解脱智慧才能出生，得证解脱。</p><p>他的修行经验介绍里，没有一丝理解的成分，都是实际修行的体悟。不像现在的某些人，全靠意识心对接触的法义的理解，把理解的东西当作证悟。连解悟的边都不沾，就认为自己证悟了。这样所谓的证悟，悟后的见解，仍然是理解出来的，没有一丝豪是自己现前观察体悟出来的。</p><p>如今世间人的根器，与过去时代的修行人根器已经相差十万八千里了，没有一点点禅定功夫，却大谈理论，好像都是自己证得的。纠正了多少年，还是原来的老样子，这都是我执的表现。</p><p>十一、原文：<strong>须菩提。即从座起。顶礼佛足。而白佛言。我旷劫来。心得无碍。自忆受生。如恒河沙。初在母胎。即知空寂。如是乃至。十方成空。亦令众生。证得空性。蒙如来发。性觉真空。空性圆明。得阿罗汉。顿入如来。宝明空海。同佛知见。印成无学。解脱性空。我为无上。佛问圆通。如我所证。诸相入非。非所非尽。旋法归无。斯为第一。</strong></p><p>释：须菩提从座位上起立，顶礼佛足，对佛说：我无始劫以来，心都一直无碍地通达一切法，自己回忆无始劫以来投生的次数像恒河里的沙子一样多。这次投胎最初在母胎里时，就知道世间是空寂的，如是乃至于也知道十方世界都是空寂的，无一法存在，我也辗转教导众生证得诸法空性。</p><p>承蒙如来的教导和加持，我悟得了自性觉体的真空，悟得这种空性越来越圆明时，于是就成为了大阿罗汉，顿时就悟入了如来宝明空海之中，与佛的知见相一致，被佛印证为四果无学位。在心地的解脱功德上，和心性所达到的空的程度上，我在佛弟子中第一。佛问我圆通法门，就像我所证得的那样，一切的有相都化为了非有而空掉，并且能化空的心和所化空的法都消尽、都空掉，原来的有法现在反过来都没有了、都空了，我是以这个法门为第一圆通法门。</p><p>须菩提无始劫以来心得无碍，心地没有任何遮障，具足了六神通，包括宿命通，所以在母胎里，就知道一切法都无，是空的。当然这个知一定是意根知，无始劫以前意根就证得空，所以不管在什么情况下，什么身份，须菩提都知道空。那么在母胎里意识出生之后，由于没有遮障，意识也知道万法空，意根先知，意识后知，这样才是真知究竟圆满的知。</p><p>须菩提所悟得的空，大小乘都包括了，所以须菩提既证得了四果阿罗汉，又顿悟如来宝明空海，与佛知见同。从这里看出须菩提至少是八地菩萨，已经证悟了两个无量劫还多。其实据佛经记载，须菩提是佛再来者，佛的十大弟子都是佛身示现阿罗汉相，与佛陀共同度化娑婆世界众生。</p><p>十二、原文：<strong>舍利弗即从座起。顶礼佛足。而白佛言。我旷劫来。心见清净。如是受生。如恒河沙。世出世间。种种变化。一见则通。获无障碍。我于路中。逢迦叶波兄弟相逐。宣说因缘。悟心无际。从佛出家。见觉明圆。得大无畏。成阿罗汉。为佛长子。从佛口生。从法化生。佛问圆通。如我所证。心见发光。光极知见。斯为第一。</strong></p><p>释：舍利弗从座位上起立，顶礼佛足对佛说：我无始劫以来，无论见到什么法，知见都是清净的，没有染污。像这样带着清净的见地受生有恒河沙数那么多次，世间和出世间所发生的种种变化，我一见到，就知其因缘，通达其根源没有任何障碍。今世我在还没有出家时，有一天走在路上，遇见了迦叶波三兄弟在一起谈论佛说的因缘法，我一听就悟到了心是无边无际的。于是我就随同世尊出家，我的见地越来越圆满明妙，对一切法都无所畏惧，成为了四果阿罗汉。</p><p>我作为佛的长子，随从佛的教导而出生，从佛的法中化生出来。佛问我圆通法门，就像我所证得的，心的见地发出大智慧光，大智慧光引导着我的见地越来越圆明。这就是我的第一圆通法门。</p><p>舍利弗被称为佛弟子中智慧第一，处处都能显示出舍利弗的大智慧，其见地纯正圆明，通达没有障碍，见法即知底源，不落到世俗相中，不沾染世俗知见。带着这样的清净大智慧受生已经无量劫了，那说明舍利弗的证量远远超过了八地菩萨，据佛经中记载，舍利弗等佛的大弟子都是古佛再来，配合释迦佛弘化娑婆世界有缘众生，共唱一台大戏。</p><p>十三、原文：<strong>普贤菩萨。即从座起。顶礼佛足。而白佛言。我已曾与。恒沙如来。为法王子。十方如来。教其弟子。菩萨根者。修普贤行。从我立名。世尊。我用心闻。分别众生。所有知见。若于他方。恒沙界外。有一众生。心中发明。普贤行者。我于尔时。乘六牙象。分身百千。皆至其处。纵彼障深。未合见我。我与其人。暗中摩顶。拥护安慰。令其成就。佛问圆通。我说本因。心闻发明。分别自在。斯为第一。</strong></p><p>释：普贤菩萨从座位上起立，顶礼佛足，对佛说：我已经曾经为恒河沙数的如来作过法王子，十方如来都教导自己具有菩萨根性的弟子修行普贤行，这个普贤行是从我开始立名的。世尊，我能用心听，来分别众生都有哪些知见。如果在其它佛国土恒河沙那么远的界外，有一个众生心中生起了想要修学普贤行，我当时就乘着六牙象，化现出百千万个分身，都到那个人所在之处。</p><p>纵使那个人业障很重，怎么也看不见我，我也要在暗中为他摸顶，以此来安慰他保护他，让他所修的普贤行得以成就。现在佛问我修行的圆通法门是什么，我就来说说我能修出圆通的根本原因，就是用心来闻，明了众生内心的想法愿望，能够自在的分别众生的心念，这就是我修行的第一圆通法门。</p><p>十四、原文：<strong>孙陀罗难陀。即从座起。顶礼佛足。而白佛言。我初出家。从佛入道。虽具戒律。于三摩提。心常散动。未获无漏。世尊教我。及俱絺罗。观鼻端白。我初谛观。经三七日。见鼻中气。出入如烟。身心内明。圆洞世界。遍成虚净。犹如琉璃。烟相渐销。鼻息成白。心开漏尽。诸出入息。化为光明。照十方界。得阿罗汉。世尊记我。当得菩提。佛问圆通。我以销息。息久发明。明圆灭漏。斯为第一。</strong></p><p>释：孙陀罗难陀从座位上起立，顶礼佛足回答佛说：我刚出家时，跟随佛陀入道，虽然戒律守持的很好，但是禅定不太具足，心常常有散乱的现象，所以没有断除烦恼，没有达到无漏。世尊教我和俱絺罗观行鼻头出入息时散发出来的白气，我最初开始在定中仔细的观行，经过二十一天，就看见鼻子中吸入呼出的气息像烟雾一样，对于身心心里都明明了了，能圆满洞察大千世界到处都是空虚的清净的，犹如琉璃一样清澈透明。</p><p>这时鼻间的气息变成了白色，心量打开了，智慧涌现，烦恼断尽。所有的出息和入息都化作了光明，照耀十方世界。我就这样证得了阿罗汉果，世尊授记我将来会成就佛道。佛问我圆通法门，我观呼吸，观察深细时把气息熄灭了，气息断灭久了以后，内心的智慧就出生了，认清了鼻端的气息以及五蕴十八界都是空的、虚幻的，智慧圆满了烦恼就断尽，我以此方法为第一圆通法门。</p><p>孙陀罗难陀在最初观气息时，已经证得了初果或者二果，但是禅定并不是很好，心有散乱，没有初禅定，就不能证得三果。观鼻端气息以后，禅定越来越深，定力出现，观察深细入微，就观察到了鼻端的气息像烟雾一样。定力不足就不能发现这个现象，平时看不见的空气和气息，这时就看见了，是非常微细的如烟雾一般，说明气息也是物质色法，由各种四大微粒组成，只是太微细，没有甚深禅定的人心粗不能见到。能见得到微细的法，就是大智慧，因为开启了大智慧，就在内观透了身心，在外洞明了世界，知道了世界身心的虚幻不实。神通出现，烦恼断尽，成为四果大阿罗汉。</p><p>十五、原文：<strong>富楼那弥多罗尼子。即从座起。顶礼佛足。而白佛言。我旷劫来。辩才无碍。宣说苦空。深达实相。如是乃至。恒沙如来。秘密法门。我于众中。微妙开示。得无所畏。世尊知我。有大辩才。以音声轮。教我发扬。我于佛前。助佛转轮。因狮子吼。成阿罗汉。世尊印我。说法无上。佛问圆通。我以法音。降伏魔怨。销灭诸漏。斯为第一。</strong></p><p>释：富楼那弥多罗尼子从座位上起立，顶礼佛足之后，对佛说：我无始劫以来智慧超群，辩才无碍，为众生宣说五蕴世间的苦空无常无我四圣谛，能深深的了达诸法的真实相。因为有这样的大辩才，就连像恒河沙一样多的如来秘密法门，我都能在大众中非常微妙的开示出来，于这样甚深的法无所畏惧。世尊知道我有大辩才，示教我充分发扬我的无碍辩才，用音声来说法教化众生，这样我在佛前就能够帮助佛转法轮度众生。因为我善能狮子吼，就得成了四果大阿罗汉，世尊印证我在佛弟子中说法第一，没有超过于我的。现在佛问我修证的圆通法门，我是以我说法的声音来降伏怨魔，消灭了一切烦恼。这就是我修证的第一圆通法门。</p><p>富楼那不仅智慧甚深，语言表达能力超强，因此无始劫以来一直帮助佛转法轮。他断除烦恼证得四果大阿罗汉，也能宣说如来秘密法门，因此其修证程度相当于八地以上菩萨的证量。佛的这些大弟子都是有来头的，都是诸佛菩萨来倒驾慈航，故意示现声闻众，以助佛弘法。</p><p>这些大弟子都有大神通而不轻易示人，显现与普通人差不多，甚至在饥荒时乞不到饮食，富楼那宁可吃牛粪，也不用神通变现饮食，佛也不允许目犍连他们用神足通飞到到北俱芦洲去乞食。其实这些大阿罗汉们完全可以不吃饭，但为了表法，示现与普通出家人相同，度化这些比丘，所以都不能用神通。这也是为后世的出家众着想，免得后世的出家众没有神通而被众生讥笑，让众生们造恶业。</p><p>十六、原文：<strong>优波离。即从座起。顶礼佛足。而白佛言。我亲随佛。逾城出家。亲观如来。六年勤苦。亲见如来。降伏诸魔。制诸外道。解脱世间。贪欲诸漏。承佛教戒。如是乃至。三千威仪。八万微细。性业遮业。悉皆清净。身心寂灭。成阿罗汉。我是如来。众中纲纪。亲印我心。持戒修身。众推无上。佛问圆通。我以执身。身得自在。次第执心。心得通达。然后身心。一切通利。斯为第一。</strong></p><p>释：优波离从座位上起立，顶礼佛足，回答佛说：我亲自跟随佛陀，半夜里翻越城墙去雪山出家修道。我亲眼所见如来六年的辛苦修行，亲眼见到如来降伏一切魔障，制伏了一切外道，解脱对世间种种贪欲的烦恼漏。我承蒙佛陀的教戒，严守戒律，乃至于出家人应该具足的三千个威严的仪表，八万个微细的梵行，心性上的恶业和过去生造作的恶业种的遮障，全部消除，心得清净，身心得到了寂灭，成为了阿罗汉。</p><p>我在如来比丘众中持戒第一，是比丘戒律的楷模和表率，佛亲自印证我身心清净，在持戒修身方面，大众推崇我为第一。现在佛问我圆通法门，我是因为首先约束身体，于是色身就得到了自在，无论如何都不犯一切比丘威仪戒律。约束身行之后，再次第约束心行，于是心就通达了五蕴世间，最后我的身心对于世间一切法就通达无碍了。我是以持戒修身修心为第一圆通法门。</p><p>在佛陀在世的正法时期，持戒圆满就能证果，直至成为四果阿罗汉，在末法时期，由于众生根器漏劣，以及生存环境的染污，只有持戒一法是不能证果了，必须戒定慧齐修，都圆满了才能证果。如果不遵守戒律，就更不能证果了，心地浑浊不清净，是无法出生禅定和智慧的。</p><p>十七、原文：<strong>大目犍连。即从座起。顶礼佛足。而白佛言。我初于路乞食。逢遇优楼频螺。伽耶那提。三迦叶波。宣说如来。因缘深义。我顿发心。得大通达。如来惠我。袈裟着身。须发自落。心光发宣。如澄浊流。久成清莹。斯为第一。</strong></p><p>释：大目键连从座位上起立，顶礼佛足对佛说：我第一次在路上乞食，遇见优楼频螺、伽耶那提和三迦叶波三兄弟，他们一边走一边讨论世尊讲的因缘法的深义，我一听马上就悟道，通达了因缘法。是如来恩赐我四果大阿罗汉，我顿时就袈裟披身，须发自落，内心大智慧光显现了出来，就像洗刷污浊的水流一样，久久施功，浊水才变得清净了。这就是我成就的第一圆通法门。</p><p>大目犍连自我介绍的修行法门或者叫作体会，是最简单的，为什么这么简单呢？因为前世都修过了，意根都已经证过无数次了，今世的新意识在听闻相关法要的当下，敛念须臾就证得了，不用再熏意根这么麻烦。他的意根生来就与四果大阿罗汉相应，修为极高，没有烦恼，智慧深利，只差意识了。</p><p>初果人再来人间，由于意根在前世已经证过了，新的意识没有证过，再证时，要比凡夫快，但是跟阿罗汉们比，还是很慢的。因为意根证得无我的智慧还是很浅，无明还是很重，对意识的熏染就轻微，意识的无明就重。因此再接触佛法，还需要修习一段时间才能再次证果，但比没有证过果的人要快。事实证明，在修证的过程中，不仅意识的学习很重要，意根的熏修更是重要。后世时意根就能熏染和带动意识，之后意识学习新法深法再熏染和带动意根，二者互相熏染和带动，道业进步就很快。</p><p>十八、原文：<strong>乌刍瑟摩。于如来前。合掌顶礼。佛之双足。而白佛言。我常先忆。久远劫前。性多贪欲。有佛出世。名曰空王。说多淫人。成猛火聚。教我遍观。百骸四肢。诸冷暖气。神光内凝。化多淫心。成智慧火。从是诸佛。皆呼召我。名为火头。我以火光。三昧力故。成阿罗汉。心发大愿。诸佛成道。我为力士。亲伏魔怨。佛问圆通。我以谛观。身心暖触。无碍流通。诸漏既销。生大宝焰。登无上觉。斯为第一。</strong></p><p>释：乌刍瑟摩，来到佛前，合掌顶礼佛之双足，对佛说：我常常回忆自己在久远劫以前，心性多为贪淫。有一尊佛出世，名字叫作空王佛，告诉我说，多于淫欲的人所生之处常常有大猛火聚集，被欲火所烧燃。并且教导我每天在禅定中周遍谛观身体百骸四肢中的气息，是冷是暖全部都要观到。在这观行当中禅定生起，心神凝聚起来，不再外散，淫欲心灭除了，智慧心就出生了。我善于把淫欲心转化为智慧火，从此诸佛都称乎我为火头。</p><p>我以证得的火光三昧力的缘故，成为了大阿罗汉。于是我就发愿：在诸佛成道的时候，我要作为一名大力士，亲自降伏魔怨，护持诸佛。现在佛问我圆通法门，我以深细的观行身心上的暖触，暖触遍触身心，一切烦恼漏尽，心生广大智慧火焰，登上无上的觉悟之道。这就是我修行的第一圆通法门。</p><p>有禅定和三昧，为什么能降伏和断除贪欲烦恼呢？因为禅定能改变身心，让身心有乐触，这种乐触非常清净殊胜，超过于人间的淫欲之乐，尤其是初禅定和三禅定。人有更殊胜的禅定乐，自然是不再喜欢粗陋的淫欲乐了。获得三昧以后，身心之乐更殊胜更清净，淫欲心就变为了智慧火。所以禅定能降伏烦恼，三昧能断除烦恼，要想解脱，二者皆不可少。</p><p>十九、原文：<strong>持地菩萨。即从座起。顶礼佛足。而白佛言。我念往昔。普光如来。出现于世。我为比丘。常于一切。要路津口。田地险隘。有不如法。妨损车马。我皆平填。或作桥梁。或负沙土。如是勤苦。经无量佛。出现于世。或有众生。于阛阓处。要人擎物。我先为擎。至其所诣。放物即行。不取其直。毗舍浮佛。现在世时。世多饥荒。我为负人。无问远近。惟取一钱。或有车牛。被于陷溺。我有神力。为其推轮。拔其苦恼。</strong></p><p>释：持地菩萨从座位上起立，顶礼佛足，对佛说：我回忆在往昔普光如来出现于世的时候，我作为一名比丘，常常在一切比较重要的道路关口，以及田地间比较危险狭隘的地方，有什么沟壑坑坎等等妨碍车马通过的不平之处，我都会默默的填平。在那些地方，或者建一座桥梁，或者是亲自背上一些沙土整平道路，以方便车马通过不受阻碍。像这样勤苦的为众生做事，经过了无量尊佛出现在世上。</p><p>我在这么长劫的时间里，除了整治道路，还为人负重。比如有的众生在非常热闹的地方，想要找人帮助背负重物，我就先来到他身边，帮助他拿东西，到了他指定的地方，我放下东西就走开，不会收取他任何酬劳费用。毗舍浮佛出现在这个世界上的时候，世间多是饥荒的，我作为一个替人负重的劳力，不管要求我背东西的那个人住处有多远多近，我都是只收一文钱。或者是有车牛被陷在泥泞里，我用很大的力气，为他推出车轮，拔除他的苦恼。</p><p>原文：<strong>时国大王。筵佛设斋。我于尔时。平地待佛。毗舍如来。摩顶谓我。当平心地。则世界地。一切皆平。我即心开。见身微尘。与造世界。所有微尘。等无差别。微尘自性。不相触摩。乃至刀兵。亦无所触。我于法性。悟无生忍。成阿罗汉。回心今入。菩萨位中。闻诸如来。宣妙莲花。佛知见地。我先证明。而为上首。佛问圆通。我以谛观。身界二尘。等无差别。本如来藏。虚妄发尘。尘销智圆。成无上道。斯为第一。</strong></p><p>释：当时国内的国王设立了斋饭来宴请毗舍浮佛，我就在那个时候，把佛应该要通过的道路整治平整，以等待毗舍浮佛的到来。毗舍如来抚摸我的头顶告诉我说：你应当把你的心地修理平整，那么世间里的道路就会都平整了。我听到这样的话，当时心里就开明了，明了心地与世间大地的关联，色身与世界的关系。慧眼观见色身上的微尘与造就世界的所有微尘都是相同的，没有任何差别，微尘的自性是互不相触，互不相碰的，乃至于刀兵也碰触不到微尘。我就在微尘的法性上悟得了无生忍，成为了阿罗汉。</p><p>我现在早已经从阿罗汉回心到大乘菩萨位中，听闻诸佛宣演妙法莲花，开示佛的知见，我最先证明，成为众中的上首。现在佛问我圆通法门，我是因为仔细的观察组成色身和世界的二种微尘同等无差别，根本都是如来藏幻化出来的微尘。微尘相在我心中消灭以后，智慧圆明，成就了无上佛道，这就是我修行的第一圆通法门。</p><p>持地菩萨在遇见毗舍浮佛的时候，为什么听到毗舍浮佛的一句话就能心地开明，成为阿罗汉呢？这是因为持地菩萨在无数劫中都发菩提心，广泛的利益众生，积累了大福德，降伏了我性，禅定也甚深，悟道的因缘已经完全具足了，所以在听闻毗舍浮佛说平自己的心地，世界之地就会都平复了，他马上反思，悟到了色身与器世间的微妙关系，证得了四果阿罗汉。所以修行的人应该尽量的多累积见道的福德资粮，只要具足了悟道的资粮，在因缘成熟的时候，就会悟道，没有障碍。</p><p>二十、原文：<strong>月光童子。即从座起。顶礼佛足。而白佛言。我忆往昔。恒河沙劫。有佛出世。名为水天。教诸菩萨。修习水观。入三摩地。观于身中。水性无夺。初从涕唾。如是穷尽。津液精血。大小便利。身中旋复。水性一同。见水身中。与世界外。浮幢王刹。诸香水海。等无差别。我于是时。初成此观。但见其水。未得无身。</strong></p><p>释：月光童子从座位上起立，顶礼佛足，对佛说：我回忆往昔恒河沙劫以前，有佛出世，叫作水天佛，教导诸大菩萨们修习水观，我入到三摩地中观察自己的色身之中，水性湛然，无得无失。最初从鼻涕唾液开始观察，渐渐周遍全身内外丝毫不漏，一直观察到津液精血、大小便利，观察到凡是在身中循环往复的水性都是相同的。我看见水大在身中，与世界外悬浮着的宝幢王刹里的水界，和世界里所有香水海里的水界，全部都一样，没有任何差别。我在那时刚刚修成了这个观行，只修到了能见到身中的大水的程度，还没有修到空去色身的境界，还有身的觉知和挂碍。</p><p>原文：<strong>当为比丘。室中安禅。我有弟子。窥窗观室。惟见清水。遍在屋中。了无所见。童稚无知。取一瓦砾。投于水内。激水作声。顾盼而去。我出定后。顿觉心痛。如舍利弗。遭违害鬼。我自思惟。今我已得。阿罗汉道。久离病缘。云何今日。忽生心痛。将无退失。</strong></p><p>释：我那时出家为比丘，在禅室中坐禅。有个弟子就从窗户外往室内观看，他只能看见室中满满的清水，除此之外什么也看不见。由于他还是一个孩子，对于禅修的境界还不懂，就取来一片瓦扔到室内的水中，发出击水的声音，左右看看没看到人就走了。我从禅定当中出来以后，顿时就觉得心口疼痛，就像舍利弗当初碰到危害鬼一样。我暗自思惟，我现在已经证得了阿罗汉的道果，业障已经消除了，离开得疾病的因缘已经很久了，为什么我现在忽然间就感觉到心痛呢？我这阿罗汉的果位不会有什么退失吧?</p><p>原文：<strong>尔时童子。捷来我前。说如上事。我则告言。汝更见水。可即开门。入此水中。除去瓦砾。童子奉教。后入定时。还复见水。瓦砾宛然。开门除出。我后出定。身质如初。逢无量佛。如是至于。山海自在通王如来。方得亡身。与十方界。诸香水海。性合真空。无二无别。今于如来。得童真名。预菩萨会。佛问圆通。我以水性。一味流通。得无生忍。圆满菩提。斯为第一。</strong></p><p>释：这时童子快速的跑到我跟前，把刚才投瓦片的事情跟我说了，我告诉他说，等你下次再见到室内有大水的时候，就开门进屋，进入水里把那个瓦片拿出去，童子答应了。我后来又进入禅定当中，童子又看见室内大水，那片瓦还在原来的地方，于是童子开门把瓦片拿了出去。我出定以后，感觉身体轻快了，与当初的觉受是一样的。</p><p>后来又遇到了无量尊佛，一直到遇到山海自在通王如来，才把色身忘记，空掉了色身。证得了色身与十方世界的所有香水海的性质都与真空相合，与真空无二无别。现在在世尊您这里得个童真的名字，参与在菩萨的法会中。佛问我圆通法门，我是因为观察水性一味的流通，没有障碍，证得了无生忍，圆满了菩提大道。这就是我修行的第一圆通法门。</p><p>二十一、琉璃光法王子介绍自己修行证悟的体验</p><p>原文：<strong>琉璃光法王子。即从座起。顶礼佛足。而白佛言。我忆往昔。经恒沙劫。有佛出世。名无量声。开示菩萨。本觉妙明。观此世界。及众生身。皆是妄缘。风力所转。我于尔时。观界安立。观世动时。观身动止。观心动念。诸动无二。等无差别。我时觉了。此群动性。来无所从。去无所至。十方微尘。颠倒众生。同一虚妄。</strong></p><p>释：琉璃光法王子马上从座位上起立，顶礼佛的两足，对佛说：我忆念往昔经过恒河沙劫以前，有一尊佛出世，名字叫作无量声佛，为菩萨们开示本来觉悟的妙明真心，告诉菩萨们，观察此世界以及众生身，都是虚妄的因缘风大的力量运转出来的，没有真实性。我在那时候，观察世界的安立，观察世间的动转，观察内心生起的念头，这些动相无二无别，都是妙真如性。我这时就觉察到了这些法的动性，来无所来去无所去，没有真实的来去，都是幻化相，在十方微尘一样多的世界里，所有的颠倒众生都是同样的虚妄。</p><p>原文：<strong>如是乃至。三千大千。一世界内。所有众生，如一器中。貯百蚊蚋。啾啾乱鸣。于分寸中。鼓发狂闹。逢佛未几。得无生忍。尔时心开。乃见东方。不动佛国。为法王子。事十方佛。身心发光。洞彻无碍。佛问圆通。我以观察。风力无依。悟菩提心。入三摩地。合十方佛。传一妙心。斯为第一。</strong></p><p>释：如是观察乃至于三千大千一个世界内的所有众生，就像在一个器皿中装储的一百多只啾啾乱叫的蚊子，在自己心中鼓动着发出狂闹的噪声。 我遇见无量声佛不久，就证得了无生忍，立时心地开明，就看见自己到东方不动佛国土作法王子，侍奉十方诸佛，身心都发出光明，照彻一切世间没有障碍。佛问我修行的圆通法门，我是以观察风力无所依止，证悟了菩提心，进入三摩地中，符合十方诸佛所传的妙心，以此为我修行的第一圆通法门。</p><p>十地以上菩萨为法王子，不久就能成就佛道，承接佛的果位。这里介绍了三千大千世界的形成，是由所有众生本觉妙明心中地水火风四大种子所形成，根据所有众生虚妄的业缘，产生了大千世界。众生的色身也是本觉根据众生个人的业缘，输出四大种子所形成的众生个人的色身。</p><p>大千世界的运转是所有众生本觉中的风力作用，而众生色身的动转施为、身口意行是众生自己的虚妄业缘以及本觉中的风力作用。而大千世界的安立、过去现在未来三世的变化、众生色身的动转施为以及众生识心产生的念想，这些动性都没有两样，没有差别。为什么没有差别呢？因为它们实质都是众生本觉中的风力作用。为什么有风力的作用呢？就是因为众生有虚妄的业缘，有了业，因缘现前，必产生结果，结果就是动转、流转不止。而这个业造作出来以后，存在本觉中。风大也是本觉中的一个种子功能。</p><p>众生没有业，缘就不现前，本觉中的四大不起作用，就没有世界的安立、建立和形成，众生也不会有色身的产生。但是菩萨为了成就佛道，广度众生，也不能灭去一切的缘，还要留一点东西来获取色身成就道业。</p><p>十方世界像微尘一样多的众生都是颠倒的，同是一种虚妄的业缘所产生。众生主要颠倒在对于自身和外界事物的认知不正确，从而产生不正确的身口意行，然后有了业存在本觉中，遇缘而有果报。如是乃至三千大千世界内所有众生，就像在一个容器中所装的百只蚊子似的，嗡嗡乱叫。我们南阎浮提的众生在地球上，也像蛐蛐一样装在一个盒子里，啾啾乱鸣。其实都是在自心中鼓发狂闹，闹得很，乱得很。</p><p>众生由于不肯息心，又对世界和自身产生不正确的作意思惟，内心中产生各种知见、看法、觉知、感想、意见、思想、观念。因为都是不正确的，各有各的不正确法，于是产生分歧、分诤，这个世间就纷乱复杂，争斗吵闹。这些纷争、知见、感想、分别、妄见，都是众生心上的浮尘，都是心上所现的影像，并不真实。</p><p>那么这些影像是怎么现起的呢？尘相是怎么从心中产生出来的呢？琉璃光法王子通过修证，证知了这个理，证得了本觉妙明，获得无生忍。之后经过深修，成为十地等觉菩萨，能够洞彻身心世界无有障碍。他的圆通修法就是观察风力的来源，来无所来，去无所去，都是如来藏性、本觉妙明性。进入了本觉三昧定中，事与理都契合十方諸佛所传的清净妙心，不与本觉相违背。如果违背，就是错悟，悟错了。</p><p>二十二、原文：<strong>弥勒菩萨。即从座起。顶礼佛足。而白佛言。我忆往昔。经微尘劫。有佛出世。名日月灯明。我从彼佛。而得出家。心重世名。好游族姓。尔时世尊。教我修习。惟心识定。入三摩地。历劫已来。以此三昧。事恒沙佛。求世名心。歇灭无有。</strong></p><p>释：弥勒菩萨从座位上起立，顶礼佛足，对佛说：我回忆往昔之前的像微尘一样多的微尘劫里，有一尊佛出世，叫作日月灯明佛。我跟随那尊佛出家修道，可是心里还是注重世俗的名望，喜欢交往有声望的大家族。在那个时候世尊就教导我修习唯心识定，修习以后，就进入了三摩地中。我从此以后，历劫以来就用这种三昧奉事恒河沙一样多的诸佛，追求世间名利的心才消灭没有遗余了。</p><p>原文：<strong>至燃灯佛。出现于世。我乃得成。无上妙圆。识心三昧。乃至尽空。如来国土。净秽有无。皆是我心。变化所现。世尊。我了如是。惟心识故。识性流出。无量如来。今得授记。次补佛处。佛问圆通。我以谛观。十方惟识。识心圆明。入圆成实。远离依他。及遍计执。得无生忍。斯为第一。</strong></p><p>释：到燃灯佛出现在世间的时候，我才修成了无上妙圆识心三昧，证得了尽虚空界所有的佛国土，不管是清净的还是污秽的，都是我的心变化所显现出来的。世尊，我因为明了这样的唯心识的缘故，我的识性能够流出无量的如来，因此今世就得到世尊您的授记，处于后补佛的妙觉位。现在佛问我修行的圆通法门，我是因为仔细的观行十方世界一切法都是唯识的，识心越来越圆满明妙了，完全进入和依止于真心的圆成实性，不再依赖六识的依他起性和第七识的遍计所执性，于是得到了无生忍。这就是我修行的第一圆通法门。</p><p>二十三、虚空藏菩萨的修行法门</p><p>原文：<strong>虚空藏菩萨。即从座起。顶礼佛足。而白佛言。我与如来。定光佛所。得无边身。尔时手执。四大宝珠。照明十方。微尘佛刹。化成虚空。</strong></p><p>释：虚空藏菩萨开始介绍自己修行的法门，他是在定光佛所证得了无边身。无边身的意思是说虚空藏菩萨的身体广大得没有边际，虚空有多广大，虚空藏菩萨的色身就有多广大，所以虚空藏菩萨的色身叫作无边身，既能包含虚空，也能包容十方世界，因此他的名字叫作虚空藏。虽然虚空藏菩萨身体像虚空一样广大无边际，但也是一个色身，既然有色身的存在，就有色身的功能作用；既然叫作色身，就有手，所以说虚空藏菩萨能手持四大宝珠。</p><p>这个四大宝珠，能照明十方微尘佛刹，一个佛刹就是一个佛国土，十方就是十方世界，十方代表着东西南北，东南，西南，东北，西北，还有上下，加起是十个方向，微尘就是说明数量极其极其的多，虚空中有数不清的微尘，一个微尘就代表一个佛刹，代表一个佛国土，那十方世界的微尘，就更数不清了，即使是一立方米之中的微尘，也数不过来，何况十方世界的微尘，这么多的佛刹是数不清数量的了，佛国土也是无量无边无际之多，这表明虚空藏菩萨的神力有多么的广大无碍。虚空藏菩萨手持四大宝珠，这个宝珠能照明十方佛刹，无边之多的佛国土都能够照得到。</p><p>然后化成虚空，什么化成虚空呢？十方微尘佛刹都化成了虚空，这是虚空藏菩萨所用的神力。为什么十方微尘佛刹都能化成了虚空呢？因为十方佛刹也是空幻的、不实的，虽然现象界上是有，实质上是无，也是空的，也是空幻的，所以虚空藏菩萨用四大宝珠照耀十方佛国土，立时十方佛国土都化成了虚空。这里还有特别的含义，虚空藏菩萨的四大宝珠，代表着虚空藏菩萨的大智慧，菩萨用大智慧观察十方诸佛国土，就明了十方諸佛国土都是不真实的，是如来藏依缘所幻化出来的，也是空的。</p><p>原文：<strong>又于自心。现大圆镜。内放十种。微妙宝光。流灌十方。尽虚空际。</strong></p><p>释：十方諸佛国土化成虚空以后，虚空藏菩萨又于自心现大圆镜，这个自心是指什么心呢？不管祂现什么，这个所现的现象都从哪里来呢？都从菩萨的如来藏里来，虚空藏菩萨是十地菩萨，十地菩萨还没有成佛，没有成佛时他的如来藏就不能叫无垢识，这个时候可以叫异熟识，八地菩萨以上的如来藏都叫异熟识，也可以叫作如来藏。</p><p>从虚空藏菩萨的如来藏心当中现出了大圆境，这个大圆境是用神力变化而来的，大圆境内放出十种非常微妙的、非常殊胜的宝光，十种宝光就从十个方向照到十方世界去了，十个方向就代表虚空当中的所有处所，全部是宝光相连，没有一处没有宝光照射，十方世界虚空无边无际，心上所现的大圆境当中所放出的宝光，就同时照到了十方虚空，有虚空的地方，就有宝光流注。</p><p>原文：<strong>诸幢王刹。来入镜内。涉入我身。身同虚空。不相妨碍。身能善入。微尘国土。广作佛事。得大随顺。</strong></p><p>释：此外宝光还照到了诸幢王刹，也就是十方諸佛国土，所有的佛国土也都显现在虚空藏菩萨内心所现的大圆境之中了，这是十地菩萨的广大神力，无边的神力所致。因为大圆境是虚空藏菩萨的心所现出来的，那么十方诸幢王刹也来到了虚空藏菩萨的身体当中。为什么呢？因为虚空藏菩萨的身体无边无际的广大，也是尽虚空际，虚空有多大，虚空藏菩萨的色身就有多大，那诸幢王刹都来到了大圆境内，大圆境是他的心所现出来的，也就在虚空藏菩萨的色身之内，也是在虚空之内，也在十方世界的虚空际之内。</p><p>这时候虚空藏菩萨的身体象虚空一样，虚空是能容纳十方世界，能容纳宇宙器世间，能容纳所有的物质色法，虚空和物质色法不相妨碍，所有的物质色法都可以到虚空当中来，都可以存放到虚空当中，都可以安立在虚空当中。既然虚空藏菩萨的身体象虚空一样，那么十方诸幢王刹也都来到了大圆境内，也就到了虚空藏菩萨的色身之内，虚空藏菩萨的色身就像虚空一样，和十方世界的诸幢王刹不相防碍，没有遮障，因为虚空藏菩萨的色身也如虚空一样。</p><p>虚空藏菩萨介绍自己说：我身能善入微尘国土。既然十方微尘国土都到虚空藏菩萨色身当中了，那么虚空藏菩萨的色身就能够进入到十方微尘国土当中去，就是说十方微尘国土和虚空藏菩萨的色身互相交融，没有障碍，互相融合在一起，没有防碍，菩萨的神力就是这么神妙，这样就能广行佛事，广利众生，大作梦中佛事了。虚空藏菩萨能随顺十方世界众生的因缘，广度无量众生，十地菩萨的神力我们没法想象，他为什么能有这么大的神力，因为他有极深妙的智慧，又有极甚深的禅定境界，无量无边的神通道力就能由此而发起。</p><p>原文：<strong>此大神力。由我谛观。四大无依。妄想生灭。</strong></p><p>释：为什么虚空藏菩萨有这样大的神力呢？虚空藏菩萨自己介绍说：“此大神力，由我谛观，四大无依，妄想生灭。”虚空藏菩萨用深妙的智慧仔细的观察、观行，在定中生起智慧心，定中思惟叫谛观，止观双运，定慧等持，才有谛观。七地以上的菩萨念念都在定中，没有不定时，谛观的结果，证实了四大组成的色身，无依无住，没有实质的色身和色法的存在，由此深妙的智慧发起了无量广大的神通，获得了无边广大的神力。</p><p>这种无边的神力是由定和慧共同成就出来的，所以虚空藏菩萨谛观的内容就是四大无依，四大就是地水火风四大种子所形成的四大，然后如来藏用这个四大来广造色声香味触法，广造宇宙器世间，宇宙器世间由四大所造成，所有众生的色身由四大所构成。楞严经中佛开示四大本如来藏性，实质也是如来藏，所以说四大所构成的一切法都是无依无住的，都是幻化的，没有实质的物质色法的存在。</p><p>物质色法由如来藏的四大所生成，而四大也无所依，因众生的妄想而生，由于众生的妄想，如来藏依之，就随顺变造出四大组成的色法物质世界，这个妄想就是七识心的想，七识心的思，七识心的作意，七识心的作意触受相思，于是如来藏就用四大来生成了十方世界，十方世界是四大所成，如来藏依着妄想心，依着七识心，产生了十方微尘国土。</p><p>原文：<strong>虚空无二。佛国本同。于同发明。得无生忍。佛问圆通。我以观察。虚空无边。入三摩地。妙力圆明。斯为第一。</strong></p><p>释：十方虚空与十方諸佛国土无二无别，都是空的，都是幻化的虚妄相，都是本心如来藏性，都是如来藏本体当中的种子功能作用，与如来藏是无二的。虚空藏菩萨证得了十方世界国土以及虚空，都与如来藏无二，都是空的，于是虚空藏菩萨就生起了甚深的无生法忍，获得了更深妙的智慧。</p><p>由于这种深妙的智慧，虚空藏菩萨就发起了更加甚深的禅定，入到定慧圆融等持的三摩地中，就具有了以上所说的神力。然后能运用神力，身入虚空，等同虚空，融入十方世界，随缘度众。既然十方世界、虚空、四大都无所依，那么虚空就能够容纳四大组成的物质色法和十方微尘世界，同时十方微尘世界也能全部都化成虚空。</p><p>虚空藏菩萨本身的虚空身是由四大组成，四大和虚空无二，都是如来藏性，是如来藏所化现出来的，虚空藏菩萨的色身就可以象虚空一样广大无边。虚空与佛国本同，佛国也是四大组成的物质世界，也与虚空一样，都是如来藏所化现出来的，本质上也都是如来藏，所以佛国土的物质四大，也能化为虚空。虚空也是如来藏性，物质四大也是如来藏性，十方诸佛国土微尘世界也是如来藏性，既然都是如来藏性，它们就可以互相没有妨碍，全部都是空，就没有妨碍了。</p><p>十方世界可以化为虚空，虚空可以容纳十方世界；无边身菩萨的色身也可以化为虚空，也可以容纳十方世界微尘佛国土，这就是定慧圆明的大神力。此大神力由虚空藏菩萨定慧等持共同所成就的，无量无边之多的神通，都是由定慧所共同成就的，由止观所共同成就的，缺少一个，就不能成就了。</p><p>虚空藏菩萨由于于同发明，这个同就代表无二，和谁无二，都和如来藏无二，不管是四大的物质色法，还是虚空，以及十方世界诸佛国土，与如来藏都是无二的，本质是相同的，因为本质是相同的，都是空，虚空菩萨就生出大智慧了。于同发明，所谓的发明，就是证得了、发现了、明了了、获得了这种大智慧，明就是智慧，他悟得了四大无依，都是妄想出来的，都是生灭的。</p><p>虚空无二，佛国本同，悟得了这一点，都是如来藏的本质，都是如来藏的空性，本质都是空，所以它们互相都没有妨碍，虚空藏菩萨就这样获得了甚深的无生法忍，由获得了无生法忍这种大智慧，就有大神力。他的大神力是无比的大，微尘一样多的佛国土能融入到祂的色身当中，十方佛国土都能化成虚空，他的色身与虚空、十方佛国土、宇宙器世间的物质色法，互相没有妨碍，没有障碍，互相圆融。</p><p>原文：<strong>佛问圆通，我以观察虚空无边，入三摩地，妙力圆明，斯为第一。</strong></p><p>释：因为他已观察到虚空是无边无际的广大，在观察中就入了三摩地，这是由慧生定，再起神通。虚空没有边，为什么没有边？如果有边，就是物质色法，虚空的本质也是如来藏性，物质色法和十方世界的本质也是如来藏性，本质是空的，是如来藏性。</p><p>菩萨观此理，就入了三摩地，三摩地是定和智慧圆融之地，表示菩萨是由智慧境界而入到甚深的禅定境界，于是就获得了广大的神力和无边的智慧，妙力圆明，斯为第一。妙力就是虚空藏菩萨微妙的神力，圆满的发明了出来，圆满的获得了奇妙的圆通道力。</p><p>虚空藏菩萨观察虚空无二，佛国本同，斯为第一。他的修行方法，一个是定，一个是慧，止观同体，观察一切法都是如来藏性，与如来藏不二，所以一切法都是空的，既然一切法都是空的，那么互相就没有妨碍，互相没有障碍，能够圆融容色，他的身体能容纳虚空，和虚空一样，又能让虚空能容纳十方世界，他的身体也能容纳十方世界，他还能到十方世界，随顺着众生，随顺着佛国土，广行佛事，这就是虚空藏菩萨的修行法门。</p><p>二十四、虚空藏菩萨的无边身</p><p>虚空藏菩萨因为证得了物质色法、色身与虚空都是不二的，和谁不二呢？都是和如来藏不二的，虚空也是空，物质色法也是空，那么众生的色身与菩萨的色身也都是空。他证得了这一点以后，就生起了无生法忍大智慧，生起了甚深的禅定，发起了广大的神通，他的色身和虚空就无碍了，和十方世界的诸佛国土也无碍了，色法和色法之间也都无碍了。</p><p>为什么色法和色法之间都无碍了呢？因为所有的色法都是空的，都是如来藏所幻化出来的，没有实质的物质色法，在禅定和智慧都生起来的时候，就能在心里上空却了色法，从而大神通就显现出来了。比如有神通的菩萨，他发起神通的时候就能穿墙越壁，非常高大的须弥山，他转眼间就能穿越过去，须弥山那么坚硬的物质，那么坚硬的宝，他的色身很容易就能穿过去。为什么能穿过去呢？因为虚空藏菩萨证得了须弥山等种种物质色法都是空的，菩萨的色身也是空的，空和空之间没有障碍，没有阻碍，所以虚空藏菩萨能融入到虚空当中，十方世界的诸佛国土也能融入到虚空藏菩萨的色身当中，当然这些都要依靠极深的禅定，发起大神通才能做得到，没有禅定一事无成。</p><p>那么十方世界的众生色身，当然也能融入到虚空藏菩萨的色身当中，虽然色身能互相融入，但是一个众生确实有自己的如来藏，各有各的如来藏，祂们是不能混淆，也不能互用的，只是色身之间没有阻碍，没有障碍。这与众生和色身上的细菌的关系不完全一样，细菌是附属在人的身上，和人的色身是有障碍的，不是重叠在一起的；可是虚空藏菩萨的色身和其它众生的色身之间，就没有障碍，是重叠在一起的，互不妨碍，虚空藏菩萨的色身和十方世界的诸佛国土的物质色法，也没有障碍。</p><p>还有一个例子可以说明证得甚深空性的人，一切物质色法对自己都没有阻碍，也可以使用神力让物质色法对其他人也同样没有阻碍。释迦佛在出生到娑婆世界之前，入母胎时，因为佛的神力无比的巨大，佛在摩耶夫人腹部的时候，可以随意到十方世界诸佛国土去，可以随意邀请十方世界的诸佛到摩耶夫人的腹部来聚会，十方世界的菩萨们，还有十方世界的护法神，都到摩耶夫人的腹部来聚会，那么摩耶夫人的腹部和其它诸佛菩萨们的色身，互相都没有障碍，这就是释迦佛和諸佛菩萨的神力。</p><p>如果我们牢牢的执著自己的色身是真实的，是真实的物质色法，那么这个色身就有阻碍有障碍，和其它的物质色法，和十方世界都有阻碍有障碍，那么我们就不能够穿越物质色法，不能透过物质色法，物质色法和我们的色身就不能无碍的融合到一起，这是因为我们的心有障碍。当我们的心生起智慧的时候，认为物质色法是虚妄的，我们自己的色身也是虚妄的，实际上并不存在，没有实质的物质色法，都是空的、幻化的、不真实的，加上禅定的证量，就能改变物质色法，穿透物质色法，与物质色法重叠也没有阻碍。</p><p>当我们把色法空掉的时候，自己的色身和其它的物质色法就没有了隔碍，没有了障碍。当我们把色身空掉，想到另一个空间去的时候，色法的墙壁高山对我们来说，就不会成为阻碍，因为墙壁这种物质色法也是空的。修到心里把自己的色身空却，不知道有色身存在的时候，色身就像不存在一样，就可以穿山越水，毫无阻碍。当四禅八定生起来的时候，就能把色身空却，五神通现前，六神通现前，色身和其它物质色法就没有障碍，就能穿墙越壁。这些事例证明了一切色法并不是真实的，通过修定修慧，就能空却这些色法，自己就能不被自身色法和外界色法所拘碍了，身心都是非常自在的，最后就能像虚空藏菩萨那样，与十方世界融为一体。</p><p>二十五、如何理解虚空藏菩萨像虚空一样的无边身</p><p>（一）问：既然虚空藏菩萨证得了物质色法、色身和虚空都不二，可以任意十方世界遨游，那么他分辨众生的差异，分辨色法的差异，这种能力是如何的呢？是不是神通现起和了别众生色身差异不可能同时存在？</p><p>答：虚空藏菩萨虽然身体像虚空一样广大，与虚空无障碍，可是他证得的毕竟是虚空身，虽然没有形，也属于色身，那他就同时有眼耳鼻舌身意，他就能有眼识见色，既用肉眼，也有天眼，同时也用法眼，他的几种眼都很殊胜，都要超胜于普通人，见的更真实，分辨得更清楚。</p><p>他因为证得了法眼，大智慧要远远超胜于凡夫的智慧，凡夫都能分辨出一般的色法，虚空藏菩萨就更能在色法上有超强的分辨能力。他有大神通，同时也能了别众生的差异，既能见实质，也能见表面现象，不会失去如凡夫一样的肤浅能力。</p><p>（二）问：虚空藏菩萨所证得的色身、色法的“空”，能否作如下理解：其一是指色身色法是如来藏幻化的，与如来藏不一不二，此空可以理解为如来藏；其二色身色法的“空”就是愣严经中所说的“目眚，瞩灯光中所现圆影”，是虚幻的，如梦中物一样？</p><p>答：这里的空，其一是指空性心如来藏，一切法都是如来藏幻化出来的，非常的不实在，就像魔幻师幻化的山河大地一样。其二义是指没有实质，就像虚空一样；就像灯光中的圆影，本不存在。因此物质与物质可以重叠，可以互相包容，色身可以穿墙越壁，与物质色法不相妨碍。</p><p>还可以从另一方面理解，物质色法是由四大微粒构成，四大微粒由四大种子刹那刹那生灭幻化出来的，那么物质色法就是刹那生灭幻化的，哪里有真实的物质色法呢？因为没有真实的物质色法，物质之间才能重叠，互相包涵，互相容纳。</p><p>虚空藏菩萨的无边身，要这样理解，人和畜生的色身，是实质的肉身，因此功能就受到很大的阻碍，没有神通。而鬼神道的众生，他们的色身就不是肉身，色身是微细的物质色法，他们就不太会受到色身的阻碍，有小神通。天人的色身更是微细，因此神通就比鬼神更大一些。</p><p>那么大菩萨的色身由于禅定和智慧以及福德非常广大殊胜的缘故，他们的色身就要比天人的色身更加的微细，神通道力也就更加的强大。色身越微细，越没有实质性，越虚灵，阻碍越小，德能越广大。天人的色身比较虚灵，福德比较大，色身也就更广大一些，那么有甚深禅定和智慧，有大神通的菩萨的色身就要比天人的色身更广大，更虚灵，更能容纳其他物质色法。</p><p>这样就能知道我们的修行方向是什么，是要空心，也要空身，空一切物质色法，不要贪着色身和色法，不要把任何一种色当成实有的，这样心就广大了，色身也就广大了，心能包容一切法，色身也就能包容一切色法。</p><p>二十六、大势至菩萨圆通法门</p><p>原文：<strong>大势至法王子。与其同伦。五十二菩萨。即从座起。顶礼佛足。而白佛言。我忆往昔。恒河沙劫。有佛出世。名无量光。十二如来。相继一劫。其最后佛名。超日月光。彼佛教我。念佛三昧。譬如有人。一专为忆。一人专忘。如是二人。若逢不逢。或见非见。二人相忆。二忆念深。如是乃至。从生至生。同于形影。不相乖异。</strong></p><p>释：大势至法王子和与他相同类的五十二位大菩萨，立即从座位上起立，顶礼佛足，对佛说：我回忆古往昔时恒河沙劫以前，有尊佛出世，名字叫作无量光佛。在无量光佛后面又有十二尊佛在一劫当中相继出世，最后一尊佛名字叫作超日月光佛，那尊佛教我修习念佛三昧。念佛三昧具体的修学原理和方法是这样的，譬如有两个人不在一起，一个人一心想着另一个人，而另一个人心里并不想这个人，只想逃避，这样的话，这两个人也许能相遇，也许不能相遇，也许能见面，也许不能见面。如果两个人都互相想念的话，两个人的忆念力深，一定会见面相聚。因为这样互相想念，从今世一直到后世，两个人就会形影不离，不再分开了。修习念佛三昧就是像这样的念佛，才能成就。</p><p>原文：<strong>十方如来。怜念众生。如母忆子。若子逃逝。虽忆何为。子若忆母。如母忆时。母子历生。不相违远。若众生心。忆佛念佛。现前当来。必定见佛。去佛不远。不假方便。自得心开。如染香人。身有香气。此则名曰。香光庄严。我本因地。以念佛心。入无生忍。今于此界。摄念佛人。归于净土。佛问圆通。我无选择。都摄六根。净念相继。得三摩地。斯为第一。</strong></p><p>释：十方如来悲怜念着众生看护众生，就像母亲想念孩子一样。如果孩子避母而逃，不想见母，那么母亲再如何想念孩子也没有用，还是不能见面。如果众生的心能够想念着佛忆念着佛，在现前以及将来，一定能够见到佛，离佛不远，不用再用其它方便方法，自己就能心开见佛，悟无生忍，成就念佛三昧。就像做染香工作的人，身上常有香气，这叫作香光庄严。</p><p>我原本在成菩萨之前是以念佛的心获得了无生忍，开悟成为了菩萨。我现在在娑婆世界，摄受念佛人来归于清净的国土。佛问我修行的圆通法门，我没有其它的选择，是利用念佛的方法，把全部的六根都统摄收摄起来，心念专注忆念于佛，只一个想佛的清净念不断的萦绕于心，这样就进入了三摩地，成就了念佛三昧。我是以这种修行方法作为第一圆通法门。</p><p>这里所念的佛，寓意为众生自己的自性清净心，众生自己的本来佛，无始劫以来由于无明迷失了，现在为了不再流浪生死，要找回迷失的本心佛，靠自性佛这盏明灯指引渡出生死苦海，因此众生要时时想念本心佛，忆念本心佛，才能见得到祂，从此不再迷茫找不到归家的路。而本心佛从来没有离开过众生，从来都是关照着众生，只是众生自己不知，如果能忆念本心佛，在佛光的指引下，一念回心，就会赫然发现本心佛一直在自己身边陪伴着自己。从此心花开放，心有宝珠，获大饶益。</p><p>二十七、看二十五圣所修的结果，就知道意根完全可以代替前六识，这是圣人修行的事实，他们不一定是菩萨，罗汉就可以做得到。前提条件是要具足禅定，具足三昧力。</p><p>世尊一再在楞严经中强调，六根本一根，因无明妄想，分为六。得道以后六消一也亡，都是本觉的功能作用。佛经当中，还是楞严经讲得最深最透，世尊处处引导我们明心见性，认识一切法的本质，找到归家之路。</p><p>背佛经总比背菩萨的论要好很多很多，毕竟佛经比论更可靠，不会误导人，除非翻译者的证量和水平所限，和辗转流通时误传。而菩萨的智慧远远不如佛的智慧，所说都有差池，没有完全正确的，有百分之八九十正确，都是难能可贵的。</p><p>二十八、从楞严经二十五圣的修行来看，过去的修道人修行都很务实，学习的理论并不是很多，他们稍微熏习了一些理论，马上就去禅定中实际观修，修行都是以禅定和观行为主，修定和参究占据了修行的百分之八十还多，修行非常踏实，所以他们很快就能证理，获得三昧，成就的很快。古时候的修行风气是证理的多，说理的很少。</p><p>如今的人却相反，把百分之九十以上的精力都用来学理论知识，复述背诵能力强，却没有独自修行的能力，不喜欢修定，心思繁乱得也修不出禅定，观行只靠意识的情思意解，认为自己懂得多就有道了，知道一个相似的答案就是证得了，全然不知知解宗徒和说食不饱的后果是什么。然后著书立说，广收徒众，丝毫不考虑会不会误人子弟，把众生引向歧途。这是末世众生思想浮躁，思惟浅薄的结果，放眼望去，都是说理的说客，几乎见不到证理的道者。众生越不具福德，这些现象越严重。这些事说多了惹人恨遭人骂，想要复古遵从古人修行足迹太难太难，没有几个人能意识到佛教存在着很大的危机，不良现象有多严重。</p></div>"
},{
    "title": "第六章 其余几卷段落解释",
    "author": "生如法师",
    "date": "2022年04月27日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  其余几卷段落解释</strong></p><p>一、第五卷原文：<strong>知见立知，即无明本。知见无见，斯即涅槃。</strong></p><p>释：昔日有人把楞严经中这两句话重新标点：知见立，知即无明本；知见无，见斯即涅槃。之后就开悟了，悟个什么呢？第一句话的意思是，有了知六尘的知，立这个知为真，就是无明。这个知是生灭的虚妄法，就是七识心的知，包括知各种定中的境界法尘的知，是意识心的知，知道自己入定了。如果认为这时心空了，与如来藏的空是一样的，是开悟的境界，那么就错会了，这种错误的认取，正是无明。</p><p>第二句话的意思是，有个心没有知见，不知六尘，不见六尘，这个心就是涅槃心，涅槃不生也不灭，祂不对六尘，不起烦恼，没有无明，自性清净。找到这个心，证得这个自性清净涅槃心，就是开悟。于是那个人就悟道了，后人给他取名为破楞严。</p><p>二、第五卷原文：<strong>真性有为空，缘生故如幻。</strong></p><p>释：真性有为空，是指如来藏有为出来的一切法都是空的，因为如来藏不仅有无为性，也有有为性。如来藏的有为性是指祂出生万法的功能作用，一切法都是如来藏依据相应的缘，而变现和有为出来的，因此一切法都是虚妄不实的，都是空的，这就叫真性有为空。</p><p>真性有为出来的一切法都是缘生的，是依据相应的缘而产生出来的，缘生的法就像魔幻师幻化出来的一样虚妄不实。如来藏就是那个魔幻师，如果没有如来藏就没有幻化的一切法，幻化的法是依如来藏而有，有如来藏这个真体才能幻化出一切万法。所以法界中是有实体存在的，只是这个实体不是世俗之类的实体，一般众生没有般若智慧就见不到这样的真实体。</p><p>原文：<strong>无为无起灭，不实如空花。言妄显诸真，妄真同二妄。</strong></p><p>释：无为法就是指如来藏的真如性，也可以代表如来藏的本体。如来藏是本体，依如来藏还有真实性和如如性，真实性和如如性就称为真如性。如来藏的无为法性无起无灭，不生不灭，因为如来藏亘古常存，其无为法性也就亘古常存，不起不灭。真如性是指一种性质，这种性质没有实体，如来藏是实体，依如来藏而有的真如性不是实体。真如性就是一种无为法性，性质不是实体，因此无为法就不实如幻，真如性也是不实如幻。</p><p>真心自性不是有为法，不是后天出生造作的，有为法是各种因缘所产生出来的，既然是后生出来的，就像是幻化的，而真心非缘生，非幻化。真心自性是无为法，在三界世间中无所作为，不是像七识心那样造作了别一切。祂不是被生出来法，未来也不会灭。</p><p>有起有灭之法，虚妄不实，像空中的花朵一样，幻化出来，又会消失。这个真心自性，自己不能显示自己，也无法表达自己，只能用我们的文字语言来描述祂的体性，语言文字本身是虚妄法，用这个虚妄法虽然能够描述出真心自性，但描述出来的体性，仍然是虚妄法，不是真心自性本身。</p><p>祂本体不会出来显示自己，不像五阴身那样能够站出来显示，这就是我，真心不能。所以语言和语言所描述表达的真心体性，都是虚妄法，仍然不是真与妄的关系，不能立一真一妄，因此都是妄。用妄显真证真的法也是妄，加一起就是两个妄。这种能见与所见、所描述的体性，都没有真实性，都是生灭法，就像芭蕉一样没有真实性，是空的不是实体。</p><p>原文：<strong>犹非真非真，云何见所见。中间无实性，是故若交芦。</strong></p><p>释：虚妄的语言和语言显现真实心之法，二者都是妄，还不是真与非真的对立关系，同样都是虚妄法。能见的七识心，和所见的真如相，二者皆依真体如来藏而存在和显现，中间都没有真实性，因此就像芦苇一样，没有实心。</p><p>犹非真非真，意思是说众生的阿赖耶识还不是真正的我，还不完全真实，因为心体里还含藏着七识造作的生灭种子，种子还有生灭性，还不是常乐我净的我，也不是完全的常不变异。直至成佛，无垢识才是真正的我，才是完完全全的真，不再有种子生灭变异时，就转变成了常乐我净。</p><p>《楞严经》以及所有的大乘经典的法义非常深，如果我们只依着文字表面去理解，往往错解经义，与佛意背道而驰。我们依着字面意思来解释，往往都是错会成分多。解释时要依着前后文，依着整个经文的意思来理解每句话、每个段落，不要断章取义和断句取义。如果断章取义或者断句取义，意思往往和佛意相违背。佛的意思是有一个实体如来藏，如果我们断章取义，就说“不实如空花”。你就取这么一句话或者几句话，就认为如来藏是不实如空花，说如来藏如空花不实，就与佛的意思正好完全相反颠倒，那就诽谤了佛与佛法，后果不堪设想。</p><p>我们每一个人学佛法都要踏踏实实，老老实实，认认真真。从前到后，前后联系起来来贯通佛法真实义，不要拿一句话一个段落自己强行来解。错解了还认为自己解的是对的，然后就相信自己的知见和看法；相信了以后，就到处宣扬自己的知见和看法。如果自己的知见是错误的，就将误导很多人，误导人就有罪，这个罪业会遮障我们，后世不得解脱，就会在生死轮回当中不得出离。所以我们解释佛法，一定要谨慎又谨慎，慎重又慎重，不要太自信了，以免造成谤佛谤法的罪业。</p><p>三、楞严经卷六原文：<strong>佛言：云何贼人。假我衣服。裨贩如来。造种种业。皆言佛法。却非出家。具戒比丘。为小乘道。由是疑误。无量众生。堕无间狱。</strong></p><p>释：佛说那些贼人都是怎样做的呢？他们假借我的名义来裨贩我，非如来所说却说是如来说，是如来所说却说非如来所说，法说非法，非法说法，造作种种的恶业。这些贼人都说，佛法不是出家人所修的，出家人不能修成佛，佛法不用出家修行，那些受具足戒的出家人都是小乘根基，只能修小乘道，不能成佛。贼人这样说了以后，就误导了无量众生，让无量众生造作了诽谤出家人的罪业，造作了谤佛的罪业，从而死堕无间地狱。</p><p>四、楞严经第十卷五阴妄想</p><p>原文：<strong>汝体先因。父母想生。汝心非想。则不能来。想中传命。如我先言。心想醋味。口中涎生。心想登高。足心酸起。悬崖不有。醋物未来。汝体必非。虚妄通伦。口水如何。因谈醋出。是故当知。汝现色身。名为坚固。第一妄想。</strong></p><p>释：你的色身是最先因为对父母的想而出生的，如果你的心没有想，就不会感召到父母，不会来到父母的欲想中延传你的生命。在中阴身里，众生因为意根想念投胎、想念有色身，就会遇见父母而投胎。像我先前说的那样，如果心里想着酸醋味，口里就会有唾液生出来；如果心里想着蹬在高山上，脚心就会有酸涩的感觉生起。面前本来没有悬崖，酸物也没有出现在面前，你的身体肯定没有和你幻想出来的物体相接触，口水为什么因为谈论酸醋味而流出来？因此你应当知道，你所出现的色身，叫作坚固的第一种妄想。这是说色阴是坚固的妄想。</p><p>原文：<strong>即此所说。临高想心。能令汝形。真受酸涩。由因受生。能动色体。汝今现前。顺益违损。二现驱驰。名为虚明。第二妄想。</strong></p><p>释：刚才所说的想象自己站在悬崖边上的虚妄想心，能让你的脚心产生真实的酸涩的感觉，由于内心感受的产生，就能促使色身发生变化。比如刚才所说的两种现象的产生，让你的心觉得酸物和悬崖就在面前，从而身体出现变化。你现在遇到增益身体的顺境而出现的舒适感觉，以及遇到违逆损害身体的逆缘出现的痛苦感受，这两种现象叫作虚明第二妄想。</p><p>这是说受阴是虚明妄想，也是妄想的产物，所以并不真实。执著受阴，就有生死轮回苦，不得解脱烦恼。所有的受觉，都是虚明妄想，根本没有实，自己骗自己而已。能知道自己骗自己，就是觉悟的前奏；知道自己如何骗了自己，知道怎样不再自我欺骗，就觉悟了；从此不再自我欺骗，就解脱了。</p><p>所有人都围绕着觉受而活，就是活个感觉。感觉是个什么？多少人明明很苦，可是自我感觉良好？多少人为了觉受不惜造作恶业，再受恶业苦受？都是无明愚痴烦恼所致。愚痴带给自己多少苦受，究竟谁能有所觉悟？什么叫作自我感觉良好？就是内心有个我，满足于那个我，只要能把那个我显摆出来，心里就满足了高兴了顺畅了。遇到逆缘，就会压抑起嗔发怒抱怨。为什么会这样？心里有个我被触逆了，就感觉不痛快郁闷苦恼，这就是众生的我相。</p><p>原文：<strong>由汝念虑。使汝色身。身非念伦。汝身何因。随念所使。种种取像。心生形取。与念相应。寤即想心。寐为诸梦。则汝想念。摇动妄情，名为融通。第三妄想。</strong></p><p>释：由于你的思虑，能驱使你的色身。身体与你的心念不是同类，可是你的身体为什么会被你的念想所驱使呢？内心里对境界的种种取像，心里就出现了影像的形状，与心里想念一致。醒着的时候是心里的念想，睡着的时候就是各种梦境。那么你的念想摇动着自己虚妄的情绪，叫作融通第三妄想。这是说想阴是融通妄想。</p><p>想阴的融通妄想，是谁与谁融通呢？由于妄想出某些境界，身体随着妄想而发生了变化，身体并没有没有接触到真实的境界，只是心里想念身体就出现变化。说明身体是随着心想而动的，是受心念指挥的。这样的身动是多么虚妄不可理喻，是谁在这样指挥控制着身体？是想阴，想阴主要指意识的想，而意识的想一是由意根支配决定，二是能支配影响意根。</p><p>识心想起伤心事，眼睛为什么会流泪呢？想起让自己生气的事，手为什么会握拳、心脏会突突的跳呢？心情郁闷，身体为什么会得病呢？心情愉快，身体为什么病好了呢？身体和识心是相通的，能互相融合在一起，心念决定身体的动转，心念能驱使身体。所以好的心念积极乐观向上的心念，能让色身健康，反之邪恶的心念悲观消极的心念，能让色身出现劳疾。中医大夫看见病人身体的病，就会知道这个人的内心思想和情绪，为了治疗身体上的疾病，就会开导病人的思想，从心理着手治疗身体的疾病。这些都属于融通妄想，非常的虚妄不实，都是胡思乱想，没有什么实事。天下本无事，庸人自扰之。</p><p>原文：<strong>化理不住。运运密移。甲长发生。气销容皱。日夜相代。曾无觉悟。阿难。此若非汝。云何体迁。如必是真。汝何无觉。则汝诸行。念念不停。名为幽隐。第四妄想。</strong></p><p>释：身体的变化从来没有停止过，刹那刹那都在秘密的运动变迁着。比如指甲变长，头发生发，血气销弱，容貌变皱，身体各项机能日夜都在更新换代，自己却从来没有觉知。阿难，这些行阴如果不是你，你的身体为什么发生变化？如果这些行阴就是真实的你，你为什么没有觉悟没有发现呢？所以说你的所有念念不停留的行阴，叫作幽隐第四妄想。</p><p>这是说行阴是幽隐秘密的不容易察觉的妄想。幽是幽暗秘密的意思，隐是隐藏的意思，都是指不易被人觉察的色身生灭变异的现象。这些现象不是主观识心能够控制得了的，是由于业力的关系，身体随时间的流动而出现的种种变化。如果业力消失，就会长生不老，永远年轻，譬如极乐世界的众生和欲界色界天人。</p><p>幽隐妄想也是妄想，不容易感觉到的行阴也是妄想的产物，念念迁流不住，前念生后念灭，犹如微细的波浪，暗暗流动，生老病死曾不间断。若灭妄想，行阴不生，涅槃寂静，常乐我净。</p><p>原文：<strong>又汝精明。湛不摇处。名恒常者。于身不出。见闻觉知。若实精真。不容习妄。何因汝等。曾于昔年。睹一奇物。经历年岁。忆妄俱无。于后忽然。覆睹前异。记忆宛然。曾不遗失。</strong></p><p>释：再说你的识精元明，好像是清净不动摇的，名为恒常不变的识心，在身体当中不过是见闻觉知的功能作用而已。如果这些作用是精明真实的，与虚妄的习气应该是不相容的，可是为什么你们曾经在往昔的时候，看见一个稀奇的东西，经历很多年之后，再也回忆不出来想不起来了呢？却在不知什么时候忽然看见了从前所见的那个东西，于是又想起来是曾经见过的，记忆又出现了，并没有失忆。</p><p>佛说精明好像不动摇的心如果是真正的那个真实不变异的真心的话，那么这个心应该不容受那些妄习，可是这样的心是容受妄习的，因此不是真心。比如说打坐修定，修到一点妄想也没有的时候，心里清清明明的，突然间就想起了一件事，意识心突然间回忆起好多年前的事，回忆起小时候的事情，这之前意识心表面好像是不动了，其实那里面种子还在翻腾着，意识心感觉不到种子在翻腾，等翻腾到一定程度，这个种子现行出来，意识想起一件事，于是就出定了。</p><p>这个时候的清清明明的心并不是精真，因为还容受虚妄法，妄习一直在里面潜藏着、潜伏着，种子一直在运行着，我们感受不到，所以说这个湛不摇处是短暂的意识心的清明境界，不是精真。<span>佛举例说明处于清明状态的意识心不是真心，因为这个心还有对于世俗法的记忆性，有人曾经看见一个稀奇的东西，经历了好多年，都记不起来了，等到偶然间再看见这个东西时，就想起来在某年某月某时某地见过这个东西，对当时的情景还记忆宛然，这个印象一点也没有遗失。</span></p><p>原文：<strong>则此精了。湛不摇中。念念受熏。有何筹算。</strong></p><p>释：那么这个识精了知性，在澄清不动摇中，念念都在受熏，哪有自己的独立、坚固的不动性。在念念受熏当中，识精并没有计划、想念、思惟、筹算什么，表面上并没有什么主观性的活动。</p><p>这个精明心在这么多年内，都没有攀缘这个稀奇的东西，可是为什么见了它又想起来了呢？实际上精明心念念都在受熏着，当年看见这个奇物的种子一直在八识田里翻腾着，一直在熏染着意识心，意识心暂时是不想。可是突然间某年某时某地又看见奇物，就突然想起了它。为什么能想起来这东西呢？是因为八识田里有看见那个东西的种子，一直在熏染着识心，再遇见就想起来了。</p><p>平时意识心表面好像没有念着，可是佛说，其实念念都在受熏，其中并没有筹算什么，没有考虑过这件事情，没有思维，没有惦念，心里并没有念念想这件奇物，可是种子现前，业缘现前了，记忆力就现起了，精明心就想起来这是自己某年看见的那个奇物。</p><p>原文：<strong>阿难当知。此湛非真。如急流水。望如恬静。流急不见。非是无流。</strong></p><p>释：佛说：阿难你应当知道，这种表面的清净和澄清的状态并不是真实的，就像湍急的流水，看起来好像是很恬静，其实是流的极快，所以才看不出是流动的，并不是不流动。</p><p>这个湛不摇动，心里没有念想的意识心，表现平平静静的，没有打妄想，没有回忆，不惦念某事某物某人的这个意识心，并不是不动的那个真心。就像流淌着非常湍急的流水一样，因为流得太快了，视觉跟不上，就看不见它表面的流动，看着就好像非常的平静，其实流得太快才显得平静，如果它流得缓慢一些，就发现流水的动相了。</p><p>佛说这个时候的意识心就是如此，不是没有流动，而是一直在念念受熏，还是有念的，但是这个念流动得太快了，心里昏暗没有觉知，被蒙蔽了，就好像感觉没有动。某一个东西如果它动得太快了，就发现不了它的动相，比如摇一个火把摇得太快了，形成了一个好像静止的火圈，看不见摇动的火把，我们就不知道火圈就是一个一直在动的火把，就一直只看那个火圈，也看不到火把的动，但是这个火把一旦摇慢了，就发现是火把不是火圈。原来一直以为是火圈，火把动得越来越慢，最后才发现火圈是由火把快速摇动形成的假相。</p><p>原文：<strong>若非想元。宁受妄习。非汝六根。互用开合。此之妄想。无时得灭。故汝现在。见闻觉知。中串习几。则湛了内。罔象虚无。第五颠倒。微细精想。</strong></p><p>释：识精如果不是你想蕴的根，怎么能受熏那些虚妄的习气呢？没有修到六根互通互动互用的时候，自心妄想没有一刻能灭掉。除非众生修到六根互通互用的时候，识阴的妄想才能灭掉，否则妄想就一直存在着没有灭时。所以你现在的见闻觉知，都在受着妄习的熏染，中间串入了很多虚妄的习气，那么看似不动的，能了知内尘的，像古代传说中的水怪一样虚无的识蕴，就是第五颠倒的微细识精之想。虽然表面虚灵而清净，没有妄念和妄想，但是仍然属于第五颠倒微细精想，这是说识蕴是颠倒的微细精想。</p><p>五、色阴是坚固妄想的产物</p><p>由于意根坚固的妄想，认为色阴就是我，是真实不可分的，真实不可毁的，于是色阴就会严重的遮障封闭了自己的心，心的功能就严重的受到了拘碍，不能突破拘碍，功能受阻。我们把什么当作自己，当作真实，这个什么就成为我们的累赘，拖累我们不能解脱，不能出现大神通，不能对一切法圆融无碍。</p><p>实际上由于无明，由于烦恼，自己遮障着自己。明明可以是佛，可以有无量的神通道力，没有任何局限，可是却处处不能通达，处处是障缘。那么多人整天烦恼重重，是非不断，我对你错的互相争夺财色名食睡，互相争夺权利地位名利，互相嫉妒嗔恨，真是愚痴极了。都是在处处给自己设置障碍，最终苦恼的还是自己。众生由于烦恼深重，只要到了一起，只要三人以上，必有是非纠纷，必有互相争夺嫉妒的现象，或明里或暗里互相较劲，突显自己压倒对方。</p><p>一个团体中总会有一部分挤压另一部分人，分裂以后，剩下的一部分，再互相争夺嫉妒排挤，又剩下少量一部分，再接着纷争不断，直到剩下一个人才能安静一些。所以我最怕人群，最怕烦恼深重的人，最怕是非多心不清净的人，最怕喜欢挑拨是非的人，最怕嗔恨心重嫉妒心重的人，也最怕愚痴是非不分的人。可是这样的人到处都是，躲都躲不开，这就是娑婆世界的众生相。</p><p>楞严经章章节节处处都指示我们明心见性，去妄见真，消除烦恼无明业障，句句珠玑，段段是黄金珍宝，是得道成佛的无上法宝。为了摆脱无明烦恼，解脱身心，不管楞严经有多难懂，我们都必须要修学，有楞严经在，佛法就不会灭，有楞严咒在，佛法也不会灭。</p><p>六、楞严经里讲想阴虚妄的时候，想象自己站在悬崖边上，足心就会感到酸涩。想酸梅的时候，口里就流口水，这一切都是妄想，被境界所骗了。众生把接触的六尘境界，都当作是自己的，结果被六尘境界所拘碍住了，不得自由。无始劫以来，我们都是自己忽悠自己，自己欺骗自己，结果却很凄惨。众生无始劫以来把色身当作我，结果色身拘碍不得自由，苦恼无边，都是妄想作祟，虚生浪死。</p><p>世尊在楞严经第十卷这一段里全部都在讲五受阴的虚妄性，这些虚妄性有五种：由自己及父母的妄想感应和合所生之身，为坚固第一妄想；由妄想产生的苦乐与顺益违损感受显现，为虚明第二妄想；由妄想着相取形的念虑激荡的心理情绪，为融通第三妄想；由妄想诸行相续导致的持续性生理变化，甲长发生、气销容皱，为幽隐第四妄想；由妄想熏覆构成的隐藏性精明心识串习，见闻觉知等机能，为第五颠倒微细精想。</p><p>第一种妄想，叫作坚固妄想，佛说色受阴，这个色阴是第一坚固妄想所形成的，佛说色受阴是妄想形成的，不是真心，不是精真。第二种妄想，叫作虚明妄想，虚明妄想佛说这个是众生的受受阴，都是妄想，都是虚妄的。第三种妄想，叫作融通妄想，融通妄想是众生的想受阴，也都是虚妄的。第四种妄想，叫作幽隐妄想，这是指众生的行受阴，色阴和识阴非常微细的运行状态，都属于行阴。第五种妄想，叫作颠倒微细精想，识受阴就是第五颠倒微细精想，微细精想就是佛在说的识阴。</p><p>七、楞严经五十阴魔境界</p><p>原文：<strong>阿难当知。汝坐道场。销落诸念。其念若尽，则诸离念。一切精明。动静不移。忆忘如一。当住此处。入三摩提。如明目人。处大幽暗。精性妙净。心未发光。此则名为。色阴区宇。若目明朗。十方洞开。无复幽黯。名色阴尽。是人则能。超越劫浊。观其所由，坚固妄想。以为其本。</strong></p><p>释：佛说：阿难你应当知道，你坐在道场当中，把一切的思想念头都消除了，念头如果灭尽了，没有任何念头的识心，对于周围的一切法却很明了，不管是动还是静都不会动摇，不管是记忆还是遗忘都是一样，没有念头。住在这样的境界就会入到三摩地中，就像眼睛明亮的人能看清一切境界，却处于非常黑暗的环境里，识精非常精明清净，心却见不到如何光明。这叫作色阴区宇，被色阴所遮挡着，不见物色，不能突破色阴，如果能突破，黑暗就不会成为见色的遮障了。</p><p>如果眼目开明，朗照一切，十方世界就会洞然明朗，再也没有幽暗，一切色法都会显现在眼前，这叫作色阴灭尽，没有遮障了，这个人就能超越劫浊。观察处于色阴区宇之内的人，为什么不能突破色阴能被黑暗遮止，就是因为有坚固的妄想，妄想色阴为真实不可坏的法，坚固的执著不舍。</p><p>原文：<strong>阿难。当在此中。精研妙明。四大不织。少选之间。身能出碍。此名精明。流溢前境。斯但功用。暂得如是。非为圣证。不作圣心。名善境界。若作圣解。即受群邪。</strong></p><p>释：阿难，你应当在这种境界当中，再精细的参研，微妙的四大不再互相密切联结不可分，四大松散之后一瞬间，身体就能冲破阻碍，不被四大所局限。这种情况是识精流注到境界上产生出来的，这是暂时的识心功用，并非证得了什么圣人的境界。没有证得圣果，不把生灭的识精当作圣心，这样的情况介绍好境界；如果认为自己证得了圣果成为了圣人，把识精当作不生灭的圣心，就会受到众多的魔扰。</p><p>阅读佛经要前后文对照连贯的看，不能截取某一段落某几行字，就执取其中的意思，这样容易断章取义，误解佛法。这段既然是在讲五十阴魔的内容，就是指修定当中的各种虚妄境界相，非真实境界，不应该把里面的修定境界执为真实而究竟，对这种境界不要生起执著心，免得入于魔境，不能自拔。</p><p>这里描述的都是禅定境界，而禅定境界就是意识心的境界，不是真心的境界，因此也就不是明心开悟的境界。这段都是描述打坐即将冲破色阴区宇的禅定境界，五阴意识心还在色阴里，没有超出色阴和受阴的局限。因此佛说，不能把这种境界，当作圣证的圣境界，所以这不是开悟境界，应该再接续往下修行，不要执著此境界为真实，如果执著就要入魔。这是整个段落的大致意思，并没有涉及到明心开悟，外道也都能修到这种境界，不足为奇。</p><p>修定显现出来的境界是意识心的妄想境界，是暂时而有的禅定境界，不管意识心多么清净，尽管没有念头，没有妄想，仍然是禅定当中的意识心，外道都能修到这种境界。因此佛再三叮咛，不要作圣解，这没有什么了不得的，不要执著为明心开悟的成圣境界，否则就要着魔。</p><p>佛经的语言稍微晦涩一些，比较难懂，因此误会都是难免的，所以大家不要轻易的认为自己所理解的一定是正确的，那都不一定。为什么学佛修行禅定容易着魔呢？因为执著某种境界为圣，取着某种境界为真实，有执念就会容易入魔，心要发狂。佛陀说过，凡所有境界都是虚妄。所有的境界都是意识心的境界，真心没有境界，寂静极寂静，祂不管你打坐不打坐，不管你清静不清静，不管你有念与无念，什么都不管，无论怎样祂都依然故我，这是多么清净的一颗心。</p><p>很多人都把修定的境界当作开悟，还有的人认为开悟必须是把所有的识心都灭掉，连意根也灭掉不起作用，才是真正的开悟境界。我们想想这有什么过失？这样的开悟，是谁开悟？悟了什么？在这个境界里没有人，没有五阴七识，只剩下如来藏，显然是阿罗汉的涅槃境界，与开悟没有关系。况且一个凡夫不可能通过修定直接就能把意根灭掉，证得俱解脱大阿罗汉，马上就入到无余涅槃里，即使灭掉五识也是极其困难的，意识更难灭掉了，更何况要灭掉意根。</p><p>有人总是执著根尘脱落是开悟境界，可是根尘脱落时，没有根，也没有尘，根尘不到一起，那当然也就没有六识心了，如果这就是开悟，那么是谁开悟呢？把虚空粉碎，大地平沉的境界，当作开悟，可是这时到底是悟个什么呢？这种境界与如来藏的关系是什么都不知道，那就没法证明是开悟境界了。大家错解误会佛法，究其原因，根本问题还是虚妄法和真实法没有分清楚，没有搞明白，福德智慧还不足，还有烦恼业障严重的遮止，障碍福德和智慧的增长，所以真妄法还不能真正的领会贯通。</p><p>真心和妄心各有其不同的体性，比如说，觉有真心的觉和妄心的觉；平等有真心的平等和妄心的平等；清净有真心的清净和妄心的清净；离相有真心的离相和妄心的离相；有为有真心的有为和妄心的有为；无为有真心的无为和妄心的无为，等等很多。总而言之，大家学法，都是很难分清真和妄，常常混淆不清，往往误会很多，这是因为菩萨六度条件还不具足，具足以后就有智慧分辨出真妄二者的体性，悟道就快了。</p><p>八、问：万法是如来藏根据各种缘而产生的，也就是说如果没有各种缘，就算如来藏本有万法的种子也不能产生万法了吗？意触法三缘和合而生意识，那么在这里可以改成如来藏借助因缘而生万法了？</p><p>答：一切法都是因缘所生，是如来藏借助于因缘用七大种子和业种出生一切法。如果没有缘，就不会生法，如果没有因，只有造作的业种子，还是不能生法。虽然如来藏里本有七大种子，如果没有意识心出生的缘，就没有意识心，所以意识心在五种情况下能灭，或者是不出生。如果意根对五蕴世间的执著性灭了，六识都会灭去不出生，甚至连意根自己也可以灭掉，阿罗汉就灭了意根入到无余涅槃中。虽然如来藏里还有种子，却什么法也不能出生，因为意根不攀缘三界法了。</p><p><strong>补充说明</strong><br/></p><p>这本讲解楞严经的书，是根据众多弟子祈请回复而汇集起来的段落释义，不是按照全文由前至后系统全面的讲解。因为每个弟子请教的内容不同，因而汇集起来显得不够系统化，只是为了让喜爱楞严经的大众在修行上，能早日有个依止和借鉴，故先以节选形式汇集成书。目前只汇集一本，以后待有时间，修行再增进之后，将系统全面的讲解楞严经，把未尽之处补充修订完善，望大众耐心等待。</p></div>"
}]