[{
    "title": "一、问：独影境是否是变现在胜义根里，有单独的种子吗？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p/><p><span>一、问：独影境是否是变现在胜义根里，有单独的种子吗？</span></p><p>答：独影境是变现在胜义根里，有单独的种子。独影境不属于五尘上的法尘，与五尘无关，它不是胜义根里的法处所摄色，而来源于单独的业种，是独头意识单独了别的法尘，不是与五识共同了别的法尘。但是独影境也受胜义根的影响，胜义根有障碍，显现出来的独影境就是扭曲的。比如小脑萎缩的人，常常出现幻觉，他所了别的独影境都是非量，不符合真实的情况，病人在分别错乱的独影境之后，生出错误的观念，口中就会胡言乱语，与正常人不一样。</p><p>因为意根通常在大脑处与法尘相触，了别大脑处的法尘，意识也同样了别大脑处的法尘，不出大脑之外；意根和意识又都能触独影境，独影境也就不离大脑，所以大脑有病变，独影境就错乱。独影境在大脑胜义根里一个单独区域成像，不与五尘在一起，也不与五尘上的法处所摄色在一起。了别五尘上法尘的意识是五俱意识，了别独影境的是独头意识，虽然名称不同，本质是一个意识，虽然是一个意识，却可同时了别五尘上的法尘和独影境。独影境的种子是单独来自于如来藏，与生成五尘的种子不是同一个。</p><p>我们心静时，可以感知一下，每当自己心动，或者动心时，是不是同时也牵动着大脑神经的跳动，然后是面部神经的跳动，之后才是手脚和浑身的相应反应。如果是，说明心动能带动色身动，心动，也有独头意识和五俱意识的动，也有意根的动，那么识心不离大脑，六尘影像和独影境不离大脑。</p><p>眼冒金星的金星是独影境，是因为物质色法的关系而产生出来的。当一个人血压不正常，出现头晕的现象时，有时就要眼冒金星，实际上这是幻觉，并没有真实的金星存在。可是这种独影境的金星还是与物质色法有关系，与大脑有关系，那么金星在哪里出现呢？也应该在大脑里出现，因为意根意识都不出大脑之外缘所有法尘。当脑子有病有阻碍时，缺少营养时，意识就想不起事情，独影境不现前，这就说明独影境是与大脑物质色法有密切关系的。</p><p>从另一方面说，当我们在回忆妄想的时候，脑电波就有波动，这说明意根和意识对独影境的了别影响到了大脑，那么独影境也就在大脑里成像，是一个虚拟之像。 独影境如果不是在大脑里出现，那就是在身体外出现，那么独影境能不能在身体外，在虚空里出现？六识能不能在身体外，在虚空里了别？意根能不能在身体外，在虚空里运作？如果意根和意识能在虚空里了别，那么虚空中的识，大家都可以共用，不分彼此。你了别了以后，我就知道了；你吃饱了，我就不饿，事实上这是不可能的。你决定修行，我就决定了；你证悟了，我就证悟了，因为是虚空里的识，不分你我。</p><p>我心里在想佛，佛的三十二相是我的独影境，如果独影境在虚空里，那么大家都能见到，大家也都在想佛，都有功德受用，事实上这是不可能的。即使我们所见的虚空，也是胜义根里的虚空，不出心外，眼识和意识了别到的虚空，也在胜义根里，也是一个影像。综上所述，独影境是胜义根里的影像，是一个虚拟之相，并不真实。</p></div>"
},{
    "title": "二、问：眼冒金星的金星是不是独影境？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>二、问：眼冒金星的金星是不是独影境？眼冒金星是因为身体病变或色身四大不调而引起视觉器官功能不正常。这个与不存在前五识的独头意识所了别的“独影境”不同，因为眼冒金星时还有眼识在。</p><p>答：独影境只能自己单独了别到，他人不能了别。五尘境，不仅自己能了别，他人也能了别到。小脑萎缩的人幻视幻听也是独影境，他人不能了别，同样道理。如果他人也能了别自己的独影境，那么就不是独影境，小脑萎缩的人就没有病，不是幻觉。</p><p>精神病人的狂乱意识，也是散乱独头意识，了别的也是独影境，他觉得自己所看所听的一切正常，与别人没有不同。可是别人就了别不了精神病人所看所听所觉的，那就是独影境。精神病人所见的如果他人也能见，就不是独影境，他也不是特殊的精神病人，与正常人一样。众生所见与佛所见不同，众生有病，佛无病。</p></div>"
},{
    "title": "三、问：观想莲花久了，不动念莲花就会出现，是不是独头意识攀缘形成的独影境？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>三、问：观想莲花久了，不动念莲花就会出现，是不是独头意识攀缘形成的独影境？</p><p>答：独影境不是法处所摄色，不是五尘上的法尘，与五尘无关，也是四大微粒形成的色法。莲花能在脑中出现，意根还是动心攀缘了，意识也忆念想象了，否则独影境的莲花是不能出现的。独影境是否出现，决定于意根，受意根的支配，意根想让它出现就能出现，想要熄灭它，就能熄灭它。意识受意根的指挥，也在观想忆念莲花，否则独影境的莲花不能出现，只不过定力深厚，观行功深时，独影境能随心所意的显现出来，意识不用太加功用，意根忆念就能把如来藏里的种子攀缘出来。</p></div>"
},{
    "title": "四、带质境",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>四、带质境</p><p>问：带有二义，即是变带(带似)及挟带。挾帶者即是能緣心挾帶己心或相應心所或見分緣相分、自證分、證自證分互緣等；或根本智能挾帶真如相起，及似境之相亦可名挾帶。這是從識的自體分來說的，所緣相分是識自體分所挾帶出來的名挾帶。</p><p>释：变带者即是似境之相亦名所虑。此有“所缘”的意思。这是从有外本质的角度来说似境之相名变带或名带似。变带，从外相分性境而带过来，依外相分而变现，相似于外相分，是七识所缘所虑的内相分。</p><p>挟带者即是能缘心挟带己心或相应心所或见分缘相分、自证分、证自证分互缘等；或根本智能挟带真如相起，及似境之相亦可名挟带。这是从识的自体分来说的，所缘相分是识自体分所挟带出来的名挟带。</p><p>挟带者，是能缘心七识，主要指六七识，以第六识为主，夹带己相（就是反观自己的意思），或者是自己的心所法（反观自己的心所法），或者指七识的见分（能见性）缘相分（识心见尘境），或者是见分缘自证分，见分缘证自证分等等。或者是已经证得了第八识如来藏的有智慧的意识，能缘第八识的真如行相。意识能观察第八识的真实而如如性，能成佛之性。</p><p>夹带，就是与变带外相分的性境有区别的缘法的方式。七识内心所了别的好像是境界的相，也是七识所夹带出来的。独影境完全是六七识夹带出来的，不依外相分而有。意识在观察自己的心行，你们心行与心所法，就是意识所夹带出来的。意识观察第八识，观察五识，观察第七识，意识观察自己时，所观察的对象，都是意识夹带出来的。我们眼睛看到杯子，意识也思维杯子，这种境相是带质境，依外相分的杯子而有。身在外地，闭眼脑海想到父母的脸相，这是独影境，是意识夹带出来的。</p></div>"
},{
    "title": "五、问：”性境不随心，独影唯随见“中的这个独影唯随见是不是说独影境与见分同种，还是说独影境随见分而转变呢？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>五、问：”性境不随心，独影唯随见“中的这个独影唯随见是不是说独影境与见分同种，还是说独影境随见分而转变呢？</p><p>答：性境是外六尘在后脑胜义根里的如实或者是相似的展现，微细四大种子形成，不可改变；独影境是随意根的攀缘，如来藏配合幻化出来的虚幻境界。见分是识种子形成的。独影境是随意根意识的思心所而显现和改变的，意根不攀缘，意识不妄想，独影境就不存在。而性境，不管意根攀缘与否，必然存在不可改变。</p></div>"
},{
    "title": "六、本质境与带质境的区别",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>六、本质境与带质境的区别</p><p>本质境，是第八识亲自参与变现，所有有缘众生的第八识共同输出四大种子变现出来的。称为本质境，单个众生的第八识缘本质境之后，如镜现像般的变现出影像，叫作带质境，第七识意根缘带质境。</p><p>如本质境的大地，是实种子地水火风构成，是实法，有坚硬性；而意根第七识缘第八识的见分，就能缘到第八识见分现起的带质境，影像大地，是影子，镜子中的影子，并不真实，没有真实的坚硬性。</p><p>如本质境中的水，是实四大种子构成，有湿润性，有淹没性，是第八识所缘。缘之后，第八识的见分就现起带质境的水，是影像，镜子中的影像，没有实质的湿润性，没有实质的淹没性，是第七识意根所缘，称为带质境。</p><p>如本质境中的火，是实四大种子所构成，有燃烧性，第八识所缘。缘之后，第八识依之现起相似的带质境火，是影像，如镜子中的火，没有燃烧性，意根能缘，称为带质境。</p><p>如本质境中的风，是实四大种子所构成，有吹拂性，飘荡性，第八识所缘。缘之后，第八识依之现起带质境的风，是影像，镜子中的影像，没有吹拂性，没有飘荡性，意根能缘，称为带质境。</p><p>意根依第八识的见分，缘这些法，还以为见到的都是真实的，而且是自己亲自见到的，把第八识的见分摄为己有，不知道自己见到的与第八识见到的有本质区别，不知道没有第八识这面镜子，自己什么也见不到，把第八识的功能据为己有，实为窃贼。</p><p>凡所有相，皆是虚妄。——经典所说，真实不虚。第七识缘第八识的见分，第八识是真实存在的，是真正的本质实相法。</p></div>"
},{
    "title": "七、问：饿鬼和人类所见的外相分是否是相同的？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>七、问：饿鬼和人类所见的外相分是否是相同的？比如饿鬼看河流、人看河流和天人看河流，明明是看同一个河流，所见就有所不同，人见是河流，天人见是琉璃，饿鬼见是火焰或者是浓血。</p><p>答：既然是见同一个河流，外相分肯定是一样的，只是內相分各自不同，这是由于业力的关系造成的不同结果。如果饿鬼看到的是饿鬼那个世界里的河流，那跟人看到的人这个世界的河流肯定是不一样的，外相分不同。如果饿鬼看到的是饿鬼世界的事，跟我们人就没有关系，外相分就不同。如果它看的是人的世界这里的山川大地河流，它所见的和人见的结果虽然是有差别，但外相分是一致的，它看的都是人中的河流。</p><p>鬼道虽然有鬼道的生活方式，有鬼的器世间生活环境，跟我们人中还是有差别的。但是它看到的人中的人事物，比如说鬼看见人，是鬼道里的人还是人中的人呢？它看的人和别人看见的人是同一个人，外相分能不能一样？肯定是一样的。</p></div>"
},{
    "title": "八、本质境、带质境、性境、独影境、外六尘和内六尘，分别都指什么相分？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>八、本质境、带质境、性境、独影境、外六尘和内六尘，分别都指什么相分？</p><p>本质境，是所有如来藏各自输出四大种子，形成共同的四大，所有如来藏共同用此四大造就的宇宙器世间和六尘境界，只有如来藏才能见到缘得到。这部分相分是最实在的相分。</p><p>带质境，是单个如来藏缘本质境之后，吸取本质境的四大微粒所变现出来的六尘境界，如镜子中的像，带着本质境中的四大微粒，与本质境区别很大，与本质境相比较是虚幻一些。这部分的相分，包括从如来藏触本质境一刹那变起相似相分开始，一直到进入五根或者是五胜义根之前的相分。</p><p>这些相分在传导过程中，四大微粒要经过中间介质的过滤和吸收，四大微粒不断的被过滤掉，以至于带质境的相分越来越微细，与本质境的差别越来越大，还与本质境的关联还是比较大的，相貌也比较相似。这部分相分，除了如来藏能见能缘之外，意根随着如来藏也能见能缘。</p><p>因为意根能缘能见进入胜义根之前的带质境，对带质境就有一定的了别性，就能相应的知带质境大略的性质和意义，就会有五遍行心所法现前运作，对于涉及到自身安危的带质境，就会有快速的抉择力。这个抉择如来藏能知，就会在带质境进入胜义根形成性境时，六根触六尘时，非常快速的出生六识，作出应对，反应非常迅速，没有意识的分析思惟推论判断的机会，意识五识只要服从意根的调配和命令就好，不需要自己判断就要作出反应应对，过后才有时间起思惟分析推理判断，知道刚才自己做了什么，发生了什么事情。这是意根快速应对突发事件的原因。</p><p>性境，带质境通过五浮尘根进入到胜义根时，在胜义根里显现出来的六尘境界，成为性境，相似于带质境，叫作性境，与带质境又有一定的差别。带质境在被传导的过程中要经过五根的过滤，四大微粒有可能要发生一定的变化，致使性境更加的微细，也更加的不实和虚幻。</p><p>独影境，就与性境有很大差别了，与带质境差别更大，与本质境差别就太大了。是由意根攀缘发起的，无中生有，由意识去处理和完善意根的妄想，去描画和添加细节，运用非量想象去发挥更细腻的妄想功能作用，甚至能妄想境界活灵活现。这部分五识就参与不了了，完全由意识配合意根去完成，这时的意识叫作独头意识，单独做妄想工作，去勾画场景。</p><p>外六入外六尘，就是指胜义根之外的，还没有进入胜义根里的六尘相分，应该是指带质境了，由意根所缘，六识不能缘，更不能见。六识了别不了的，不属于内相分，应该算作胜义根之外的六尘，叫作外六尘。</p><p>内六尘，就是指胜义根里的性境，不仅意根能缘能见，六识也能缘能见。当然第八识更能缘能见了，一切法不管是哪个阶段的法，都是第八识如来藏变现和执持的，如来藏当然就能缘能见了，否则任何一个法都不会出生和存在。</p></div>"
},{
    "title": "九、本质境、外六尘与内六尘三者的区别和联系",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>九、本质境、外六尘与内六尘三者的区别和联系</p><p>在宇宙当中存在着的外六尘，是所有众生如来藏共同出生共同执持的，是所有如来藏用四大种子来维持的，四大种子刹那刹那的生刹那刹那的灭，那么外六尘就是刹那生刹那灭的。外六尘境界是最原始的色法，是实种子组成的比较实在的色法，严格来说叫作本质境，是如来藏了别的，意根不能了别，六识更不能了别。虽然如此，本质境也是刹那刹那在生灭变化着。在四大种子生灭变异的过程中，四大种子是往外发散的，还发散到各个如来藏当中，所以我们能感觉到物质周围有磁场有能量。</p><p>发散出去的四大种子，如来藏就会摄取回来，摄取过来以后，才叫作外六尘。如来藏再通过五根把外六尘上的四大种子传导进胜义根，五根就是指身体的各种神经系统，比如眼根有玻璃体，有神经传导系统，把眼根外边物质散发出来的四大微粒传导过来，一直到传导到后脑眼的胜义根，就形成了内色尘。内色尘落在眼胜义根里，根尘就相触了。其实外色尘和内色尘都是意根先了别的，了别之后意根想具体了知，那么就出生眼识、意识；如果意根不想具体了知，我们就不知道有此种色尘。与五尘在一起的法尘，随同五尘同时传导，色法尘与色尘同时通过眼根传导，声法尘与色尘通过耳根一起传导，香法尘与香尘通过鼻根同时传导，味法尘和触法尘也是这样。</p><p>意思是说在胜义根里的法有很多，意根不想了别的时候，六识就不能了别，从五根所传进来的法，我们就不知道。如果神经系统传导没有遮障和误差的话，形成的内六尘和外六尘有点相像，或者是非常相像，因为内六尘是外六尘的影子；而外六尘是本质境的影子，犹如镜子里的影子一样。我们分别的内六尘就像镜子里的影子，分别不了的外六尘相当于镜子外头的实物，那个实物比内六尘要真实一些，更契合最初的六尘本质境。而本质境是实的四大组成，意根接触不到。在如来藏像镜子一样把那个本质境上的四大摄取过来幻化以后，意根才能缘得到。</p></div>"
},{
    "title": "十、到底有没有外法尘",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十、到底有没有外法尘</p><p>外法尘比如外面的高山，高山的形状高矮巍峨壮观等等都是外法尘，如来藏接触以后传导进入胜义根中，成为内法尘，六识才能了别。</p><p>如果没有外法尘，外面的山只有色彩，其余什么也没有，那如何区别此山和彼山，如何区别山河大地？不会是宇宙器世间都是色彩斑斓一片吧？</p><p>甲是一个人，乙是一个人，甲对于乙来说，就是外尘，包括色声香味触法六尘，甲的高矮胖瘦男女气质年龄相貌等等都是外法尘，乙的如来藏触了以后，传导进入乙的胜义根中，成为内法尘。不能说甲就是一片色彩的色尘，没有高矮胖瘦年龄相貌等等外法尘吧？如果每个人都只有色彩一片，没有法尘，那么每个人又有什么区别？每个人的如来藏都是用别人的如来藏创造内法尘的吗？每个人的如来藏都是自己胡乱变造别人的法尘相貌吗？</p></div>"
},{
    "title": "十一、信息是否能暂时留存在大脑里",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十一、信息是否能暂时留存在大脑里</p><p>信息是无形无相的，不是东西的东西，大脑是物质色法，二者如何能融合在一起？试想一下，房间里能暂时保留一条新闻吗？发生过的事情，能在房间和空间里保存一小会儿吗？根本不能，那么大脑也不能保存任何一点信息。</p><p>如果大脑能保存信息，把活人或者是死人的大脑一片片切开，就能找到这些信息，并且能了解和研究这些信息，那就能把一个人的秘密都揭示出来，那么世间人也就没有了秘密，刑警破案也就太容易了，那就不存在千年疑案和冤假错案，没有解不开的谜底了。如果电脑能存储信息，把电脑拆散，是不是能发现信息？手机如果能存储信息，把手机拆开，是不是能找到信息？</p><p>信息如果属于物质色法，就是四大种子组成的，只有如来藏里有四大种子，大脑里没有四大种子，不能存信息，况且大脑的容量也存不下，所以信息应该存在如来藏里，来自于如来藏。信息如果不属于物质色法，不是四大组成的，就是无形无相的种子态，必存在如来藏里，大脑不能存种子。墙上和地上的脚印，属于四大物质色法，不是信息，眼睛当然能看见。</p></div>"
},{
    "title": "十二、照镜子的时候，镜子里的影子与镜子是什么关系？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十二、照镜子的时候，镜子里的影子与镜子是什么关系？镜子里的像与镜子外面的相是什么关系？</p><p>镜子里的影子，是眼识所见的相貌，耳识所听见的自己的声音，鼻识所嗅的自己的气味，舌识所尝的口腔里的味尘，身识所觉的身体里的触尘，意识所了别的五受阴。包括第七识的作主性，第七识的一切造作。</p><p>第六识所能观察出来五识的能见性，第七识的能见性，以及意识自己的见性，意识所观察出来的五受阴六尘境，都是影子。影子是镜子所出生和显现出来的，是镜子传导出来的影像。镜子真实永远存在不灭，影子生生灭灭，存在时也不是真实有，是空的幻化的。像与相是一—对应的关系，相似相像，像是相所变，来自于相，依相而有，二者不一不异，离相无像。</p></div>"
},{
    "title": "十三、如来藏镜中的像也是色法",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十三、如来藏镜中的像也是色法</p><p>一切法分为色法和心法以及非色非心法。色法一定是由四大种子组成，是心法所见的部分。识心看见的镜子中的像，也是色法，一定由四大种子组成，只是组成机构与镜子外的色法有所不同。心法是能分别的心，镜子中的像不能分别，因此不是心法。</p><p>镜子外面的相，是共业众生如来藏共同变现，镜子上的像，是单独众生如来藏依外面的相变现出来的。镜子外面的相是假，镜子上的像更是假。各种层次的相，其四大种子组成的微粒有差别，导致真实的程度不同。我们自己所见到的自己色身的一切，有如镜子上的像。是有是无，是非有非无，是非非有非非无？</p><p>楞严经中佛说，色身微尘与器世间微尘无二无别，同样的四大种子组成。例如身体每天从血管皮肤排出的垃圾废物，与器世间的沙土一模一样，排出的汗水，与大自然的水一模一样，口鼻皮肤呼出的气息，与器世间的风一模一样，身体散发出来的火气与器世间的火一模一样。因此组成色法的四大种子是相同的，身体与器世间无二无别。外界四大发生变化，身体就会随之发生变化。</p><p>外道的无论，眼见色法，却说无。既然是无，为什么有言说？外道的有论，明明一切色法是无常空，却说是真实不坏。佛所说的法，不有不无，非有非无，既有既无，非非有非非无。取其中之一，而不论其余，就是外道见。佛法永远是圆通，左说右说，都说得通。而外道论总是不能自圆其说，自相矛盾。</p></div>"
},{
    "title": "十四、色声香味触分好多种类",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十四、色声香味触分好多种类，瑜伽师地论第一卷，讲过声音的种类，分好几种。味尘也分好几种，有众生自己身上如来藏出生的，触尘也是这样，香尘也是这样。法尘与五种尘和合在一起，也同时分几种。</p><p>声音有色身和外界和合出生的，有单纯外界的声音，有众生互相交往发出来的。众生自己的声音，是自己的如来藏单独出生的。身体里发出来的声音，也分几种。有识心控制，意识的觉观思惟产生出来的，有食物吸收消化过程中产生出来的，有内脏病变等产生出来的，有意根调控饮食咀嚼吞咽产生出来的，有胃肠蠕动产生出来的，有自主呼吸产生出来的，有内脏运行产生出来的，如心跳声。</p></div>"
},{
    "title": "十五、没有外法尘是否能有外五尘",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十五、没有外法尘是否能有外五尘</p><p>法尘和五尘之一和合在一起，才能组成单独的一个尘境，法尘与五尘是不可分开的，分开了就什么也不存在了，就会没有色没有声没有香没有味没有触没有法尘。法尘与五尘和合组成的尘，法尘占的比例非常大，几乎以法尘为主。比如说色尘，色彩属于五尘境，眼识了别，除此之外都是法尘，意识了别。两个识的了别合在一起才是完整的了别了色尘，缺一不可，尤其是缺少意识了别的法尘，那就什么也不存在了。所以说没有法尘，根本不可能存在五尘境，一体的尘境，不能缺少法尘。</p><p>比如说一个人的色身由色彩和色法尘组成，色彩是眼识了别的，其余都是意识了别的内容，包括高矮胖瘦、体重、气质、形象、年龄、性格、脾气、秉性、健康不健康等等。所以说没有法尘，就没有色身。那么众生的如来藏出生众生色身的时候，一定是同时出生色彩和法尘，出生声尘和法尘，这些就组成了众生色身的本质境。他人看时，也是见众生的幻化境，自己的内六尘。没有外法尘，只有外五尘是不可能的，不存在单独的五尘境，世俗界没有这样的法存在。</p></div>"
},{
    "title": "十六、法尘与五尘同时存在",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十六、法尘与五尘同时存在</p><p>色尘与法尘共同组成了色法，二者是如来藏同时出生变现出来的，不可分离。如果二者不在一起，是分离开的，三千大千世界都是一片色彩，没有形质，没有内容，那么一切物质色法就没有什么区别了，也就没有三千大千世界，没有色法的存在了，眼识也就无法出生了。</p><p>世间外界如果只有显色的色彩，法尘是在胜义根里另外根据色尘和胜义根四大创造出来的，那么外界也不称其为外界了，物质色法就没有什么界限了。因此说法尘与色尘是同时出生同时生灭变异的，是如来藏用四大种子同时创造出来的。</p><p>同理，法尘与声尘、法尘与香尘、法尘与味尘、法尘与触尘都是同时出生，同时生灭变异的，不能分开。</p></div>"
},{
    "title": "十七、问：有人说法尘单独在胜义根出生，意根接触之后出生意识了别法尘。是这样的吗？",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十七、问：有人说法尘单独在胜义根出生，意根接触之后出生意识了别法尘。是这样的吗？</p><p>答：胜义根里的法尘是与外五尘同时通过五根传导到胜义根里，成为了内六尘，供意根触，也供六识同时了别。内法尘不是在胜义根里单独出生的，如果是这样的话，法尘与五尘就没有什么关系了，单独出生的法尘显得很突兀，没有依据，有点胡编乱造的意思，不能显出五尘的性质和内涵，五俱意识与五识也没有什么密切关系了。</p><p>五俱意识对法尘了别作出抉择和判断之后，要向意根传达信息，五识了别的五尘信息也与意识一起传达给意根，因为意根也是五识出生的俱有依，意根决定要了别和处理五尘的时候，五识才能出生，那么五识的行为造作要受意根指挥，为意根负责，供意根参考。</p><p>五尘与法尘和合构成了完整的色声香味触法六尘境界，五识了别和处理的是六尘中比较粗略的部分，意识了别和处理的是比较细微的部分，粗细合起来的信息传达给意根，意根同时接收粗法和细法的信息，经过自己单独的思量，对六尘整体作出自己的判断和抉择。</p><p>比如说到商场买衣服，看见五颜六色的服装，意根就要选择一种比较适合自己颜色的衣服，眼识和意识就要同时了别衣服，眼识只了别色彩，意识了别色彩之外的法尘，包括衣服的款式质料韵味，色尘和法尘的信息传达给意根之后，意根就会考量色彩和款式质料，再让意识单独分析判断一下红色和黑色哪种颜色比较适合，哪种款式比较合适，这是独头意识的工作范围了。于是独头意识想象穿在身上的效果，把想象分析的结果传达给意根，意根再思量判断，作出自己的决定，最后几个识和合运作就买下了意根满意的衣服，六识为意根服务完毕。</p><p>构成整体衣服的有色彩部分的显色，是眼识了别的色尘，除了颜色之外的所有部分，形色表色和无表色，是意识了别的法尘。二者和合构成一件衣服，在衣服生产加工出来的时候，色尘与法尘就同时存在了，每个人了别的时候，就把色尘和法尘同时通过五根传导到自己的胜义根里，形成内色尘和内法尘，供眼识意识分别。不是说衣服生产出来时只有颜色，没有款式质料长短肥瘦尺码韵味等等法尘内容，这样的话就不叫作衣服了，也不用缝纫裁剪设备去处理布料了，也没有布料之说了。所以法尘是与五尘结合在一起的，不是在胜义根里单独产生出来的。</p></div>"
},{
    "title": "十八、什么是三境",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十八、什么是三境</p><p>三境：性境、带质境和独影境，都是七个识所对应的尘境。在这之外还有七个识不对应的本质境。</p><p>性境是五识所对应的显色或者说是显境，带质境是第七识和五俱意识所对应的尘境，独影境是独头意识所对应的尘境。性境和带质境是从本质境传导到胜义根里的尘境。</p><p>质，也可以叫作四大微粒，含有四大微粒的物质，叫作本质境和带质境。本质境从传导一开始就改变了，改变为第七识可见的尘境，进入五根以及胜义根里时，再次被改变，传导过程中不断改变，最后就成了性境和带质境。比如一朵花，是本质境，第一面镜子照见，这朵花就成为镜子中的像，与本质境的花相像，但质又不同。再来一面镜子，照第一面镜子中的花，镜子中又出现了那朵花的像，这个像又与前两个像不同了，也有相同的部分，但更加虚幻不实，改变的更多了。如此，十面镜子重重相照，最后的像是个什么？五蕴世间六尘万法即是如此。</p></div>"
},{
    "title": "十九、六尘中色尘传播的速度快",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>十九、六尘中色尘传播的速度快</p><p>问：昨晚打坐观呼吸中，突然感觉头脑闪过一片白光，紧接着听到楼上有挪动凳子声。头脑中白光闪现是不是根尘触生出来的？</p><p>答：楼上挪凳子的声音传播到大脑胜义根中，根尘相触生识，耳识就听到了声音。在听到声音之前，声尘突然间触到胜义根，胜义根就有异常反应，头脑中的白光闪现就是那个反应。因为五胜义根也是四大组成的物质色法，声尘也是四大物质色法，如果比较大的声尘传播到胜义根，对于身根的胜义根就有触动，受到突然间的触动，身根大脑就有应激反应。</p><p>如果是在比较安静的禅定中，心理没有准备，突然间有尘境出现，意根就会促使身根有异常反应。如果是在平时散乱的状态下，就不会出现突然的刺激反应。再比如非常大的声音如雷声之类的，也会震动耳鼓，甚至让耳根失聪，而耳鼓是属于身根肉体，震动就属于触尘，是身识了别出来的。这就说明声尘有物质属性，也是色法，所以也可以通过眼识了别一部分色法，而头脑中的白光闪现，就是眼识了别出来的。将来六根互通互用的时候，听声音不必用耳识，见色不必用眼识，嗅香不必用鼻识，尝味不必用舌识，觉触不必用身识，思法不必用意识。</p><p>同一个来源地的尘境，是眼识先见，还是耳识先听，还是鼻识先嗅，还是舌识先尝，还是身识先触？六尘境界传播的速度肯定是不一样的，究竟哪个传播速度快，还有待于多多观察。比如天上打雷时，是眼识先见闪电，还是耳识先听到雷声？一般来说色尘的传播速度要比声尘传播的速度快，同一个尘境发源地传过来的尘境，眼识要先见，耳识后见。再比如太阳光传播过来的时候，是眼识先见光，身识后觉温暖。</p></div>"
},{
    "title": "二十、回忆的内容是属于有质独影还是属于无质独影",
    "author": "生如法师",
    "date": "2021年12月26日",
    "html": "<div class=\"B1_text\"><p>二十、回忆的内容是属于有质独影还是属于无质独影</p><p>质，就是指四大种子组成的有质碍的色法，实的四大种子构成五尘，依五尘而有的独影境叫作有质独影境，与五尘无关的独影境属于无质独影境。五俱意识所对应的是有质独影境，独头意识所对应的是无质独影境。回忆当然是意识单独的回想已经过去了的事情，对应的法尘独影境不涉及五尘，那就是无质独影境。</p></div>"
}]