[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>内 容 简 介</strong></p><p>本书所阐述有关解悟与证悟的内容，是从四十万字的意根体性文章里摘录出来的，专门汇集成这本专著。编辑此书宗旨有三：一是为了引起学佛大众足够的关注与重视；二是为了厘清佛法修证的易淆讹处，让大众在佛法修证的路上有个真实的依止；三是为了引导大众本着务实的态度，对个人对佛教高度负责的精神，踏踏实实修行，不落于浮夸的知识和见解中，而生慢障道，自误误他。</p><p>现在的佛教界好像渐趋重视实修，其口号和宗旨也提出要实证，而实质仍然不涉及实修和实证，也不知道何为实修，何为实证。如果所修不涉及到禅定，没有深入熏染到意根，皆为不实之修，犹如浮萍飘忽不定，其结果只有解而没有证，却都以为是证。长此下去，表面繁荣的佛教将会渐趋没落，大众盲目修行，而不知所修为何，也就没有了修和证，以至于连解悟也不见踪影，何况证悟。这样下去，真正的证悟之法则会断灭失传，甚至被浮夸的学佛方式而淹没，不再有实际受益者，佛法的舟筏也就不再能引渡众生。因此有必要在此疾呼实证，倡导实修，以释佛之本怀，救度善根福德因缘具足者快速成就，自度度人。</p></div>"
},{
    "title": "序言",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>序     言</strong></p><p>一、在现今这个时代，由于众生善根轻鲜，福德微少，烦恼性重，修学的次第，必须要先断我见，然后再参禅以求明心。如今的学人都无法在明心参出密意的同时就能断除我见，因为密意很容易就能猜测出来，猜测出来的就不是实证，不是实证就无法断我见。修行当中如果没有否决五阴十八界我的过程，都不能断除我见，因此就不属于真正的明心证悟。</p><p>而否定五阴为我的这个过程非常重要极其重要，如果没有经历过这个过程，就知道密意的，猜测推理推究的成分非常多，结果密意是知道了，我性不除，后续所有的作为还是紧紧围绕着一个所谓的我。在这之前还是小心谨慎造作，在这之后就会堂而皇之的，好像有了底牌和后盾似的，这样更可怕。因此每个人在明心之前，一定要观行五蕴无我性，断除我性，截断造恶业的种子流，之后才能成为一个真正的名副其实的无我性的菩萨。如果有哪位没有这个过程，不断我见而直接弄出密意，都不属于真正的明心菩萨。</p><p>很多人学佛的初衷明明是想要求得无我的解脱功德，学法为了达到无我，可是却不在自己心地上观行无我，其言语、行为、心念的造作还是紧紧围绕着所谓的我，不仅执著自己，还执著他人，不仅要操控自己，还要掌控他人。这样做就是背道而驰，何时能修成无我，何时能得心地解脱？</p><p>一个人的身口意行越无我，内心越解脱，越自在，这是修学佛法的终极目标。学佛修行不是为了获得个人的某些世俗利益，而恰恰是要放舍世俗中所谓的个人利益，才能得到出世间法的最大利益，才能获得世间一切利益。不明此理，所有的作为都是无明，不出烦恼深坑。实际上本没有什么世间利益，都是虚幻不实之法，究竟是无所得的。常常深深的观行世俗界所有法，就会明了这个道理，为什么还要紧紧抓取一个我而不放舍？</p><p>把自己紧紧抓取一切法抓取自我利益的两只手松开，慢慢的放开，你就会发现天地是那样宽阔，心灵是那样的豁达和自在。以往生生世世无量劫是多么的苦恼、苦痛不堪，都是因为一个所谓的我，时时处处为了我，却没有得到任何实在不灭的利益，一直苦恼恼苦不已。如今遇到无我解脱之法，为什么还不借此机会放舍自我，早日得到解脱和自由？</p></div>"
},{
    "title": "第一章　意根亲证的原理",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第一章　意根亲证的原理</strong></p><p>一、实证就是意根亲自证得</p><p>实证不仅仅是指明心见性的实证，很多法都需要实证，无论是佛法还是世俗法，都是如此。意根证得，意根亲自证明、亲自思量出来、亲自检验的，不是意识转述和灌输的，不是意识道听途说来的，不是意识学来的，称为亲证。意根没有证得的法，都不是亲证和实证。因为意根是作主识，能主导一切法，能贯通前后世。</p><p>断我见和明心证如来藏都是意根证得的，是意根亲证的，仅仅意识单独的知是虚证，不是实证。即使明心以后，需要实证的法还有很多很多，但不管什么法，只要意根认可确认，都是实证，包括世俗法。每一个法的运行都有意根作主导，如果实证里没有意根的运行和认证，意根没有实证，那就不是实证。意根无明俱在，智慧没有打开，那仍然是凡夫一个。意根是获得一切法的最关键环节，因此实证都与意根有关。</p><p>二、实证亲证的真正原理</p><p>如何证明意识是学知识学理论层面的，而意根是实证层面的？比如做饭这个法，首先意识得要学习做饭的理论技巧，把理论学会了以后，并不等于会做饭了。对于做饭这个法，还没有实证。这个层次相当于意识的解，不是意根的证。</p><p>那要如何实证呢？懂得做饭的理论以后，就需要亲自下厨，亲自按照意识所学理论动手做饭。而动手做饭，属于实际操作，实际操作就需要意根指挥和督导。如果意根不懂理论，就不能督导六识做饭。这样意根就要反反复复的指挥六识练习做饭，做得不对时，意识就要思惟分析哪里不对，需要如何操作、改正和弥补。这是意识指挥意根练习操作的，相当于意根断除我见的前后作为。</p><p>当意根学会了操作以后，就不太用意识分析和监督了，意根就能非常熟练的指挥六识做饭，以后还会游刃有余，技术非常娴熟，轻车熟路说的就是意根掌握技术的水平。这时就相当于意根除去执著的阶段了，相当于意根自动自觉，不用意识监督管理的阶段。</p><p>因此说，意识与理论相应，意根与实际操作相应。意识知道的理论如果不能让意根也知也证，就没有什么用，意根实际证得以后，才有大用处。亲证，就是指意根亲自证得，不是意识从别处学来的知识和理论。</p><p>三、在六识都灭去不存在以后，这时还是有个我，就是意根，这是根本的那个我。如果意根没有断我见，那就还有我见的存在，仍然是有我见的凡夫，这时候的我见，与清醒时的我见是一样的，没有差别。因为意根有我见的存在，就认为我没有了见闻觉知，不能觉六尘，不能在六尘中有所作为了，于是就会起心想要了别六尘境界，如来藏配合就出生六识，见闻觉知现前，五阴就会出现，意根就可以再执取六尘境界，执取见闻觉知，执取五阴的造作，这样就被系缚在三界世间里，不得解脱。</p><p>因此断除我见，一定要让意根也同时断除，意根没有了我见以后，各种执取性才能减轻，心才能得解放，才能有解脱的智慧。一直到死亡以后的我见，也是与活着时是一样的，因为我见而执取五阴身，中阴身以及后世的五阴身就会不断的出生，而再重新出生时的我见与前世还是一样，与前世一样还是凡夫身，意根还是照样执取和贪着。因此，众生是因为意根的我见而引起生生世世的循环往复，业果不断，生死不断。</p><p>如果六识一灭，我见就消失了，那该有多好！可惜不能，那么仅仅让意识断我见，就没有什么用，不解决根本问题，还是想办法让意根断我见才行。</p><p>四、大乘法也好，小乘法也好，世间的各种道理也好，证得这些法一定是意根认可证得，意根确认；如果不是意根确认，都是意识心所觉的，都是意识心的感受，那就没有真实受用了。因为六识不作主，作主的是意根，但这样也起着熏染、带动意根的作用。意根是“我”，意识是被意根所执取的“我”的用，那么断我见就是要断意根的我见，证悟也是要意根来证得真正的我——第八识如来藏。</p><p>一切法的取证全部在于意根，不在于意识。意识学的理论不起决定作用，只起着薰染意根的作用。如果意识学的理论没有熏染到意根，没有让意根证得，那就没有功德受用。所以解悟和证悟差别在哪里？解悟只有意识的解明眼意根的证，证悟在意根的证得和认可，在意识熏染意根、改变意根、断除意根的无明上，一切法都由意根作主。那么意根一旦证得了，以后就能把心行转变过来，我们就能够成佛了。</p><p>五、一切法的证得，应该都是现观的结果，而不是想象和分析得出的结论。什么叫作现观？现观就是现量观行、现前观行，六根对六尘的当下，现前观察体验各种法的出生、运行和生灭变化。意识是否是现量观察，思考得出的结论是否是事实，意根要不断的作出判断，但是有时判断正确，有时判断错误，因为意根也有自己的习气，再加上智慧不足，就容易判断错误。意根往往是承认意识的现量观察和充分的思考分析，有理有据时，才能启发意根的智慧，意根才能确认其思惟观行的结果，而不太承认意识的非量想象和推论。意识的现量观察就是证据，当证据确凿时，意根才拍板加以赞同。</p><p>我们在很多时候自己说服不了自己，这是为什么？因为意识没有现量观察，没有证据或证据不足，意根就认识不到意识所分析思惟的合理性正确性，不能被意识说服，不能按照意识分析的结果作出决定，这样意识就要不断的再思惟分析推理，直到证据确凿，意根认可为止。</p><p>当然这里包括意识邪恶的、错误的现量观察，实际上是非量，但是也能被意根认可，因为符合意根的无明和烦恼，意根就愿意赞同，这是没有修行的人。当意识对意根进行邪教导时，意根被蒙在鼓里，不知真相，想当然的就把非量当作现量，把想象的当作事实，事实却不是那么回事，可是意根有时也随顺过去，不得不同意。</p><p>六、如何证明一切法是意根的工具，是意根需要一切法解决一切法？</p><p>楞严经中世尊对此问题有讲述，天地未生之时，只有意根和第八识，意根混混沌沌，想要明了法界，遂向外攀缘探求，于是第八识随着出生天地宇宙器世间，随后又出生五阴六识，十八界具足。于是乎，意根就在这些法里玩转着，始终突破不出去，被这些法紧紧的束缚着，不得自在和解脱。最后善根福德因缘具足时，由意识牵引着探索三界世间法的实相，探索生命的意义，找到出离生死路径，破除一切无明，回到实相中来，得大解脱，归家稳坐，又无家可归，天下才开始太平，一切法归于寂静，万事大吉，也无万事。</p><p>意根牵着第八识创造五阴世间一切法，又用五阴六识寻找真谛，破除无明黑暗，实际上还是利用第八识完成的这一切过程。可见第八识被意根玩得服服帖帖，但大人总是大量，陪孩子玩耍又何妨。当意根孩子逐渐长大懂事时，也就不再搞恶作剧，不拖累第八识干坏事，不再贪玩，不再无事生非，也学着第八识的大人大量，心量广大，于是就寂静下来了，三界也就静悄悄。再学第八识的大人大量，帮助其他孩子都成长，都长大，所有世界就都太平了。</p><p>其实一切法都是意根需要和解决的，意识是意根解决问题的工具，五识也是意根解决问题的工具，甚至第八识也是意根解决问题的工具。意根利用这一切工具解决自己所需，达到自己的目的，那当然一切问题都要意根最后亲自解决，亲自首肯才行。证得一切法都得要意根亲自证得，意根才肯放心，才算解决问题。</p><p>这样已经把一切法的修证问题，说到家说到底了，没什么可再商讨的，至于认不认，那是各人的福德智慧问题，与佛法无关。</p><p>七、现量证得和情思意解的差别是，比如说一切有为法如梦幻泡影，这句话如果真正证得了，就是十回向位的菩萨，不久就有资格入初地，成为真佛子了。可是很多没有明心开悟的人，都认为自己也懂了这句话，而到处发表自己的感想和观点，把自己的观点见解看作是现量证得，还到处与人家不断的夸夸其谈和辩论，甚至还能有人著书作论，大道理一套一套的，足以教导他人，自己内心并不与此相应。</p><p>可实际情况是，这些人对于佛陀的这句话仅仅是意识对表面意思的理解，离证得还差很远很远，也许证得这句话时，还需要修行接近一个无量劫的时间，也许还需要修行大半个无量劫的时间。可是为什么这些人都很自信自己懂了这句话呢？一个是无知，一个是慢，没有其它的解释。可见，所谓的懂，所谓的明白，所谓的理解，根本不是证得，不是现量观察，不是现观。意识心的理解，最多定义为解悟，那已经是高抬贵手了，也许离解悟还远得很，何况是证悟，离证悟的距离那就更遥远了。</p><p>八、理解和证得之间的距离</p><p>看恐怖片时，意识明知是假的，可还是要害怕；走玻璃栈道时，意识明知是安全的，但内心还是害怕得不得了，有的人甚至不敢抬腿走。意识就是说服不了自已（意根）不要害怕，为什么如此？因为意识分别和思惟得出的结论，得不到意根的认可。意识劝自已（意根）不要害怕，说这一切恐怖情节都是假的，可还是血压升高、心跳加快、身上出汗，身体都是由意根来控制的，这说明意根还是害怕。</p><p>尤其是看球幕电影时，意识知道一切影像都在屏幕上，根本出不了屏幕外，影像不是现实的，可心里感觉影像还是那样的逼真，害怕里面的车开到自己身上，害怕里面的飞刀砍到自己，子弹打到自己身上，于是身体就不自觉的尽量躲避。身体和心理的行为，都是由意根指挥造作的，是意根按照自己的惯性认知来指挥的，识心就会作出相应的反应。所以不把意根熏成功，就不能解决实际问题。</p><p>知道栈道是安全的，是不是自己的现量认知？这种知道有什么用处？意识明明知道前边的人已经悠闲的走过去了，有了现成的例子，自己为什么还不敢站起来走过去？意识明明知道玻璃的厚度和承载力都很牢靠，自己为什么就不能站起来，身体笔直的走过去？因为意识分析思惟的理，意根还没有接受，内心对于玻璃栈道还有恐惧心理，因此就让身体表现为战战兢兢、脚底酸涩、腿肚子发抖、哆哆嗦嗦，以至于蜷缩在通道上，不能挪动一步。</p><p>有的人站在玻璃桥外时，种种言论，大谈特谈，走上玻璃轨道，试试如何？身根是不是受意根控制指挥的，这里就能看得一清二楚。意识不能指挥身体，不管意识如何认为安全也没有用，意根不知道，那就照样惊恐万状，惶恐不安，都是因为意根严重执身而造成的。</p><p>由此看来，意识知道六尘是自己的内相分，有没有用？不用功观行，五阴虚妄无我就不能真正证得。知道和理解是很容易的，证得就很困难了。小乘四个果位的证得，都涉及到了身心觉受，大乘各个果位的证得，也都涉及到了身心的觉受，包括梦境的证明和提示。尤其是各种禅定的出现，更是涉及到了身心的觉受，禅定越深，觉受越强烈。二禅以上则无觉，五识消失。但是色身也要发生很大变化，出定后还是有身心的觉受。为什么有这些觉受的出现呢？是因为意根现量证得了佛法，知道了事实真相，身心就出现变化，是意根执持和调控的结果。</p><p>意根相信现量境，需要自己亲自证知，他人的证明没有用，必须自己能现量证得，真真切切的知道。佛法的证得也是如此，否则说食不饱，自欺欺人。很多人都知道五阴虚妄，可内心深处的意根还是认为五阴真实，对于意识的分析思惟结果不能赞同和执行，仍然要牢牢的执我不放。因此就需要意识必须认真思索，细致观行再观行，直到把意根说通，意根懂得和确信，才是现量境现前，否则仅仅是个推理罢了。</p><p>如何让自己不胆战心惊的走过玻璃栈道？应该这样做，在走上栈道之前，意识就要想方设法、非常全面的分析思惟栈道的安全性，尽量思惟透彻，比量现量非量都思惟清楚了，有理有据的证明玻璃栈道确实是安全的，没有一丝危险，这样意根就能确认栈道是安全的，心里就能有底气，于是就能鼓足勇气走过栈道。意识分析透彻，看破境界，让意根放心，心理才能得安稳。内心感觉很安全，底气足了，思想准备都做好了，感觉再也不害怕了，这就把意根说服了，然后再抬腿上路。怎么样才能做到内心里底气足足的？靠意识思惟分析透彻，看准看稳，十拿九稳了，再行动。意识思惟分析透彻了，意根才能确认，才能表现为镇静、踏实，才能大胆的走过去。</p><p>这个问题与观行断我见的道理是一样的，断我见也是如此，意识必须思惟分析透彻，一个漏洞都不要有，让意根完完全全认可，没有疑惑，才能断我见。观行断我见，意识要想方设法思惟、观行五蕴十八界的虚妄不真实性，把意根熏染成功，让意根从内心里确认五蕴确实不是我。这时意根的底气才足，任何人说五蕴是真实的，意根都不加以认同。要做到这点，需要意识自己首先要明理，要思惟清楚，还要给意根一段适应和确认的时间，让意根适应五蕴确实不是我，不是真实的。</p><p>意根断尽对五蕴的执著，在小乘是四果罗汉，在大乘是七地满心，进入八地时。八地菩萨的解脱证量相当于四果俱解脱的大阿罗汉，初地满心相当于慧解脱的阿罗汉，但是初地菩萨不取慧解脱阿罗汉的果位，思惑烦恼不可以全部断尽。意根断尽人我执的境界，我们可以比量和想象推理知道一些，虽然没有证得。那么意根断尽法我执，我们可以比量非量的思惟一下，也能知道个大概，虽然更不能证得。这个知道和证得，可能就要相差接近两个无量劫和三个无量数劫。知道和证得之间的距离，简直不可想象。</p><p>有的人总是以知道一些事情，就自傲自满，其实那都没什么，即使真正证得了很高深的佛法，也不值得自傲自满。放眼十方世界和过去未来现在三世来看，即使我们修到了八地菩萨的境界，仍然不算什么，智慧短浅见识少的人，才容易生起自傲自满心，慢心才深重。有头脑有智慧，见多识广的人，不容易生起慢心，因为见过或者知道有无数人比自己优秀无数倍，眼界是非常开阔的。</p><p>九、意根是深细的我，祂把一切法都当作我，当然一切法都归意根末那识所用。祂把五阴当作我，五阴的作用就是祂自己的作用，把第八识的功能作用当作祂自己的功能作用，把六识的功能作用当作祂自己的功能作用，所以一切法都归第七识意根所用。而且祂生生世世不灭，一切果报当然也归祂受用。祂一切时都是我我我的，一个非常伶俐的识心，习气烦恼聚为一身。任何一件事，没有意根末那识的参与，都不能成事，参禅也如此。意根如果不作主决定参禅，意识就不能参，所以参禅这法，也是为意根所用。把意根发动起来，一切事情事半功倍。多跟意根摆事实讲道理，让祂证得一切法都无我，意根明理，一切事情就会从根本上得到解决，直至成佛。</p><p>十、很多人每天都谈实证，什么叫作实？实就是实际，实际就是意根的现量境界，意根到什么境界，修为就到什么境界，意识的境界为虚，转眼即逝，犹如空花不着地。意根是作主识，统领六识身口意行，意识的解，不是实证，因为意识对身口意行不能作主。</p><p>实证需要意根证，而要意根证，一定不能缺少禅定，禅定不足，意根无法深细思量意识所提供的数据资料，不能胜解意识所思所解，因此不能证，只能是意识单独的解。所以离开禅定，不要谈什么实证。而意识解，意根不证，就没有解脱的功德受用，就是德不配位。</p><p>十一、意根证悟才能出生智慧</p><p>关于意根的慧力问题，意识所有的智慧都要落在意根上，才算成功，才存种子，后世才有用，最后意根的慧力起一切作用。意根要证果，从初果到四果，如果要明心，从初明心到成佛，都是意根的慧起作用的。意识慧的结果就是要让意根有智慧，让意根转识成智，具足大智慧，最终成佛。</p><p>意识的慧和意根的慧的区别在于，意识有逻辑思惟分析推理作用，可以比较抽象的思惟。而意根不能抽象思惟，必须要具体，有情节，有图像，越现量越好，越现实越好，意根很难有分析思惟能力，很难进行逻辑推理判断，这方面就靠意识，其他现量的量度可以完全靠自己，当然有意识辅助是最好最快的。所以有图文图像，有现前情节情景的，意根比较相应，意识记忆就牢固，也非常容易理解，就是这个道理。六根互通互用时，意根就代替了意识，也代替了五识。楞严经中讲的大迦叶圆明了知，不因心念，就说明这个道理。</p><p>十二、发现真相，只有意识发现是不行的，必须是意根也同时发现法界真实相，意根证得，然后才能远离假相，只有意根能指挥六识不认假相，远离假相，意识心没有这个权利，不能作主。当意根证得假相，同时就能作主远离假相。只有意识证，还没有用，意根时时刻刻分秒刹那与假相在一起，意识就不能离开假相，身口意行不能改变。</p><p>意根犹如栓马桩，即使允许你意识东奔西跑，但是也要围绕意根柱子跑，不许跑远。意根拴马桩如果到处移动和挪动，六识野马是否能够不随意根动转而定在一处不动？根本不能。所以修学佛法的功夫都做到意根这里，才是真正的功夫，才能改变自己的身心。</p><p>十三、有人说：无间作意，好像是法义深入到意根后，只有意根能作到无间作意，念念不舍。其实功德就是来自于意根的认可或转变的必然产物，只要意根真实认可了、担当了，证果功德自然就有了，智慧也有了，这是一系列自然发生的，证法的根子还在意根。</p><p>这个见解非常好。无间作意，无间就是不间断的意思，只有意根能缘于法义而不间断，二六时中，朝斯暮斯，念念不断。这需要意识熏修佛法，成功的熏染到了意根，意根认为佛法很重要，就要念念牵挂着佛法，心思都不离佛法，有朝一日，必能证得佛法。如果意根不牵挂着佛法，意识对佛法的心念必断，不能无间断的缘于佛法。</p><p>十四、断我见证果是意根对五蕴非我的认可，开悟明心时，意根不仅认可五蕴虚妄，不是真正的自己，同时也证得了如来藏，知道如来藏是真实的自己，意根自己不是真实的。意根这时就找到了主人，但是烦恼习气都还在，但能轻微一些。意根知道了如来藏是真正的我，万法都是如来藏现起的，都是如来藏的功能作用以后，慢慢不再把如来藏的功能作用据为己有，渐渐对自我的执著就轻微了，以后不仅能断我执，也能断法执，二执断尽，圆满成佛。</p><p>十五、供养断我见的初果人得无量倍的果报，如果仅仅是意识断我见，意根没有断我见，那初果人如果昏迷没有意识时、在晚上睡着以后就退回到凡夫位，这时供养他抢救他，只得一百倍的果报。二者之间的差距这么大，这种情况是不可能存在的，一个人不可能是白天是圣人，晚上就变回了凡夫，醒着时是圣人，一旦缺氧昏迷就是凡夫。</p><p>成佛时，如果再是意识成佛，那么换个五蕴，就是凡夫，诸佛无法降生娑婆八相成道而成佛，只能成个凡夫。那我们无量劫追求成佛还有什么意义？断我见证初果就更没有意义了，睡睡觉就变回凡夫了，如果一年也睡不醒，那就当一年的凡夫，如果成为了植物人，岂不一辈子当凡夫？</p><p>明心如果是意识明心开悟，昏迷睡着意识灭了以后，就成为了没有明心的凡夫。即使是地上菩萨，已经具有了宿命通的菩萨，换个五阴身，换了六识，照样变为了凡夫。这样的话，明心开悟还有什么意义？什么时候才能进入初地，成为真佛子？那怎么还能成佛呢？</p><p>十六、如来藏配合意根而现行一切法，只有意根明理证悟，才能断除无明，去除染污，究竟成佛。如来藏不是配合意识的，因为意识是因意根的决定后出生的，无故不出现，如来藏无法配合一个还不存在的识心运作。</p><p>意识不是作主识，如果意识想上东，而意根想上西，最终五阴身是上东还是西？肯定是往西边走。因为如果意根想上西边去，思心所一决定，如来藏了知，就会配合意根出生身识和意识走向西边。一家之主就是有威德、有权利、有主见、有抉择力，谁人能撼动？</p><p>意识想改变习气，只可以想想，却无法作主改变，因为烦恼习气毕竟是意根的，需要意根自己改变，意识不能代替。意根有习气自己不知不觉，怎么办？需要意识多明理，多给意根讲道理，有一天意根听得进去，并且能够反思，认识到自己的烦恼习气，当然就会改正了。在佛法上的证悟也是如此，需要意识明理，再帮助意根明得，二者就都觉悟了，都破除了无明，尤其是意根的无始无明，这样二者就都出生了般若大智慧。</p><p>意识明理是非常重要的，意识有善巧方便也是非常重要的，意识聪明伶俐是非常重要的，意识所做的一切，最终都是要改变意根，意根不改变，意识所做的暂时都是无用功。</p><p>证果和明心也都是让意识带动意根明理，在这过程中，都是意识学法思惟观行，把所有的资料、思惟的内容，传递给意根，让意根自己去衡量思量参究，意根才能真正明理，真正证悟了。</p><p>十七、五阴身的行为是由意根主导作主宰的，意根的烦恼染污没有被熏染和降伏，身口意的一切行为就由意根的烦恼习气作主导。意识想掌控自己的身口意行却做不到，因此看到自己不如理的身口意就会羞愧和自责，实际上还是责怪意根，只是意识不懂这是意根的问题，以为是意识自己的问题。如果是意识自己的问题，意识觉悟到就能马上改正，并不困难。但对于意根的问题，意识有些时候就会感觉束手无策，只能多学法，多明理，多掌握一些善巧方法说服和熏染意根，意根的烦恼习气才会慢慢有所收敛。</p><p>因此觉悟佛法、觉悟无我、觉悟如来藏，不能只有意识觉悟，意根一定要觉悟，之后才能自觉的按照所觉悟之理造作身口意行，慢慢就能除去染污，回归真实法中，心地得到永久的清净。</p><p>十八、不知依他起，怎破遍计执，即知依他起，渐渐不再执。知道真实相，执性渐无力。证得依他起，渐渐深入思惟观察所有依他起性，知是戏论，不再沾染，执性越来越轻，最后消尽无余。断我见以后的观照仍然很重要。意根因为没有证得依他起性，于是就普遍计度执著一切法为真实不生灭的，因为执以为真，才作主造作善与不善的身口意行，留下业种，后世受报，因此生死不断。</p><p>破除意根遍计执性，应该要清楚意根为什么有遍计执性。意根因为不明了法界实相，不明了一切法的实质，因此错执一切法为真实为我为我所有，就普遍计度执著一切法。如果能揭示出一切法实质究竟为何物，意根明了了一切法的实相，那么祂还有什么好执著计较的？遍计执性也就渐渐消除了，这样就把根本问题解决了。</p><p>意根如果不证法，不明了法的实质，如何能破除无明，消尽遍计执性？意识所熏修的一切法，所明了和证得的一切法，根本目的都是为了让意根证得，破除意根的无明，然后才能扭转乾坤，得究竟解脱。</p><p>十九、用催眠的方法，也能让意根认识真相，之后意根就能有一个转变。每个人的意根认可和证得佛法的程度不同，受到的触动就不同，转变就不同，智慧也不同。所以根本智慧还是意根带来的。意根的智慧，叫作慧根，意根对佛法和三宝的信和依赖，叫作善根，意根是根本。</p><p>二十、意根与解脱</p><p>把心结打开才能得解脱，心结就是心的结缚，包括意识心的结缚和意根的结缚，只打开意识的结缚还不能得解脱，还必须打开意根的结缚才能真正得解脱，因为意识是断断续续的，意根是连续不断直至未来世的，解脱不仅现世要解脱，最主要的是未来世的永久解脱，因此必须打开意根的结缚。</p><p>要想打开意根的结缚得解脱，就要断除意根的我见，断除意根对五蕴和三界世间的攀缘和执著，断除意根的我执，对五蕴和三界世间法都不执著不贪爱，爱尽得解脱，四果人才能做得到。</p><p>在无想定里，没有意识，可是外道却执著色身，所以色身不会灭，因为执身，把身体当作我，他就不能出离三界，因为没有断我见的缘故。意根只要对三界世间所有法一点也没有兴趣，断尽了贪爱，对五蕴十八界一点也不执取了，才能断尽我执，命终意根灭了，就入无余涅槃，出离三界得解脱了。</p><p>真解脱，是心解脱，意识和意根不再执著五蕴自己，不贪财色名食睡，不贪色声香味触，这样意根就把绳索从五蕴上解开，身心束缚就没有了，生死结打开了，生死之法再也束缚不了自心，心就是解脱的。五分解脱里，最后一个是解脱知见，正知见建立起来，邪见就消失，没有了邪见的束缚，知见就解脱了，这是智慧解脱境界。依此知见，就能出离生死苦海，而正知见最不容易建立，因为邪染太深了。学佛修行就是不断的打开心结的过程，心结打开，才能得解脱。</p><p>二十一、一切的修行结果都要落实到意根上，意根改变，一切都改变。因为意根（第七识）的妄动，导致六识心的不断起没，产生了六识心的生灭，观察此生灭，就能够发现六入处的六识，总是不断随着意根的作意而改变，这样就能找到断我见的钥匙，并且降伏意根，断除意根的执著性，就能得解脱了。</p><p>在六入处，有六根，有六尘，六根与六尘相触，才有六识的出生，这里五阴十八界俱在，在此处观行，最直接，最关键，最究竟，最彻底，可以截断众流，斩断业识，也能究出万法之本源，跳出万丈深渊。意识常常在此处深思、深观，就能截断自我之生死流注，祂是我们修行的最得力的观行工具。</p><p>意识也是常常被意根所用的了别六尘的工具，因为意根自己没办法清楚的了别六尘，必须通过意识和前五识了别六尘，然后间接得到六尘的信息，再来作出抉择，因此意根是我之主，而六识是我之辅。意根把意识了别的功能作用当作是自己的功能来使用，内心里总是有我和我所，就会不断地支配六识来维护这个我，六识不得不信受奉行。</p><p>意根是指挥官，祂指到哪里，六识就打到哪里，没有违背命令的时候。修行是意识先转变，然后来说服意根，意根完全彻底转变以后，五识和八识就会随着都转变，这样就转八识成四智，圆满成就佛果。所以断除意根的我见和我执是非常重要的，降伏意根是非常重要的，所谓擒贼先擒王是也。</p><p>二十二、意根实证叫作真知灼见</p><p>根据意识与意根的体性，我们应该知道，在参禅时，如果意识不努力用功，总想从他人那里打听出来密意，想轻易得到一个结论，意根没有参与参究，就不与结论相应，意根不了解不认可结论，那就是假明心，假开悟，最多就是解悟。真正参禅时，意根参与，意根明了，意根认可，那才是真正的明心开悟。我们了解了意识和意根体性的区别，这些道理就能懂得了。</p><p>所以有些事情，我们不要心存侥幸心理，想要不经过辛苦努力参究而轻易获得；如果轻易获得，意根不知不证，不可能有智慧出现。意根不参与的，意识单方面得知的道理，都是不踏实的，不真实，不究竟，不彻底的，都是假知，不是真知。</p><p>有个成语，叫作真知灼见，意根真知，才能有真正的智慧性的见解和认知。意根证得，就有真知灼见，意识单方面知，就是乾慧和干慧，智慧贫乏无力。证得，是亲自证得，谁亲自证得？当然是意根亲自证得，意识单方面的知，还不究竟，不是亲自证得。否则，证悟就不叫作亲证，叫证就行了，不用说亲证。整个证得的过程，意根一定要参与，意识思惟参究的内容意根都知，参究的结果也知，也相应和认可，才是亲证。</p><p>学好如来藏和意根的法义，可以走遍十方世界。因为一切法都是由意根和如来藏共同运作出来，共同创造出来的，所有法都含有如来藏和意根。这两个识的体性懂得了、证得了，诸佛讲法，我们就能听得懂。无论佛讲什么法，都涉及到如来藏和意根，没有超出如来藏和意根的法了。我们无论怎样修行，都是在意根上修证，修好意根，一切法都能成就，就能变化无量世界。</p><p>二十三、有一个搞化学的人，为一个化学结构，一直无法解构，天天陷入深思，有一天在梦里，出现了一个化学元素符号，非常清晰。第二天在添加了这个梦里提示的元素后，解构完成了。估计这个化学元素是意根从如来藏里翻腾出来的。这个例子说明，化学结构问题已经熏染了意根，动用了意根，意根也就天天思量这个问题，以至于睡着了也在思量着，不肯罢休。直到意根在梦里把这个问题解决，当然梦里意根也借助了意识的微弱的思惟分析作用。这说明只要意根有心思，想要解决某些问题，祂是不分白天黑夜的，甚至要搞出梦境，逼迫意识不休息共同研究解决问题。</p><p>有一位心理学者说：如果我们总是在意识层面费心思，有些争议不休或存疑的问题就永远得不到解决。他说的观点很精辟，意识的思惟活动确实是太浮浅了，不能解决深层次和根本的问题，不能从根源上解决实质问题。同样的道理，我们在佛法上证果和明心见性这样重大的问题，仅仅依靠意识绝对不能解决根本问题，必须有意根参与，发挥意根深层次的力量，思心所作用充分发挥，才能攻克疑难和深奥的问题。所以很多问题，一旦意根用心思，就能攻克下来，并且能从根本上解决问题。</p><p>这位心理学者还说：对于游泳，如果产生了怕下沉的恐惧，那么潜意识就会进一步加工这些负面信息。这些加工的“原料”越多，潜意识加工后的成品就越“合格”。这句话也同时在说明，意识观行五蕴虚妄，需要反复观行，把需要观行的资料，交给意根的越多，最终经过意根的加工（认可），观行的结果越合格。意根不仅通过意识思惟，还有自己的思量性，祂要自己认知，不仅仅依靠意识，祂认为意识不完全靠谱，还得自己亲自来证得。意识观行的数据量越大，观行的次数越频繁，观行的频率越高，效果越好，意根越容易加工作以判断抉择，最后还是以意根自己的思量为准绳，作出最后的结论，成为定论。意根的思量性非同一般。</p><p>这里涉及到了由量变到质变的问题，量变，是意识心的反反复复的思惟分析，越来越周全和细致，给出的数据和资料越来越多，同时意根就根据这些数据资料，进行自己的思量加工，最后得出一个结论，问题解决，这就是质变。</p><p>单独的意识所证，疑情不能解决，内心里意根还是觉得不够踏实，不敢真正承认其正确无误。因为这不属于意根实证的，所以之后就会出生疑问，怀疑自己所证，就有可能退失自己所证。而亲征的人，现量观察的人，别人怎么说也不会失去信心，因为意根证得了，就毫无疑问，不可动摇，意根就是有力量。</p><p>我们体会体会，如果对一件事心里有疑，仅仅靠意识粗浅的思惟分析，得出一个结论，心里能有底吗？敢担当吗？确实不再疑了吗？肯定不是这样，浮浅的表面的思惟，即使是证据足，意根也不能首肯，心里还是疑，不落底不踏实。意根要想首肯，祂自己要亲自过目，亲自观察，亲自证明，亲自体验，自己必须参与其中，祂相信自己。意识的思惟分析，就是靠头脑想一想了事，属于情思意解，也许自己都觉得不靠谱，更何况意根这个他人。意识单独思惟出来的，没有确凿证据，疑情不能真正彻底解决。</p><p>二十四、意根的无我，一是不认意根为真实；二是不认五阴为真实、为自己；三是不认六识的功能为真实、为意根自己的功能；四是不认第八识的功能是意根自己的功能。</p><p>断人我执时，祂必须知道五阴十八界不是我，慢慢的祂就开始断对五阴十八界的执著，开始观察五阴这个功能也不是我，那个功能也不是我，五阴的所有功能都不是我。这样一点点地就能断除了意根对五阴的执著性，成为四果罗汉。意根在断除五阴的执著性以后，达到初步的无漏，祂的遍计所执性就消除一部分。四果阿罗汉以前，一直在降伏着意根对自我的执著性，从证得初果成为初果人的时候开始慢慢的一点一点的降伏，直到四果阿罗汉断尽我执。</p><p>初地菩萨开始一分分的断除法我执，要想断除法我执，就要获得无生法忍智慧，在一切法上，都证得无我性，证得一切法都没有自主性，都是第八识所幻化出来的。观察出一切法确实都没有一个我存在，都不是我。意根就认可这一切法都不是我，也不是我所拥有的，这样一点点地祂才能断除对一切法的执取性。意根达到彻底无我，一切法都不执著，内心空空净净，才能成佛。</p><p>二十五、所有的财富都存在第八识电脑里，意根不工作，财富不显现。意根要取财富，要三界世间法，要成佛，第八识就把一切财富运输出来，供给意根受用，而意根要通过六识和五阴身来受用，祂把五阴身和六识当作自己、当作自己所用的工具，就像身体上的手脚为身体所用一样。一切法都为意根所用，第八识不用，是意根执著一切法，需要一切法。意根就是最大的一个我，让祂不把自己当作我，不把五阴身和六识当作我和我的，不把一切法当作我和我的，那就万事大吉，我执法执断尽，成佛有余。</p><p>二十六、顿悟，一方面是意根顿时而证悟，然后告知意识，不是意识一点一点思惟出来的；另一方面是意识不断的参究，一点一点思惟，把结果不断的渗入到意根，念念都入到意根心中，有个渐进的过程，也有心理准备，最后意根确认，意识也就决定下来，然后欣喜若狂，喜极而泣。</p><p>如何才能使意根认可意识的想法呢？只有真正静下心来，深入细致的思考，意识才能有效的熏染意根，从而达到说服意根的效果。静下心来，才能让意根发挥功用；禅定现前，意根才能发挥功用，才能与意识一起观行参究。否则没有禅定，意根忙乱，意识也忙乱，不能细致思惟，不能熏染意根，传递给意根详细的情报和数据，意根就不能作以思量考究，不能参究，不能发挥其应有的功用，也就不能明理，不能确认和实证意识思惟的内容。</p><p>实证之后，才能破除无明，改变一切法。现在都是意识心的解。如果意根不证，无论世间事，还是佛法事，任你感慨万千，感慨亿万，过后就不感慨了，该怎样还怎样。如果意根不证，就扭转不了身口意行，也就没有解脱的功德受用。</p><p>二十七、与初果相应的断我见的所有观行，没有证果的人都可以理解，很多人理解了以后就认为自己观行到了，认为是断我见了。所以一些人认为明白无我之理，就是断我见，就确认自己证果了。这样是太盲信自己了，弄个大妄语，后果很严重。每个人都很自信，结果却是盲信，完全是内心的我在作怪，是我心重的表现。</p><p>明白无我，是意识的理解，连解悟也不算，离意根的证悟还有很大的差距。众生就是这样的愚，不好度化，说实话不听，高举着他才高兴。有的人，你说他是八果，就高兴极了，说实话，无论如何都不愿意听。有的人贪嗔痴样样都很严重，比凡夫还重，却说自己是二果了。众生都喜欢自高自大，没有办法。</p><p>其他的任何法也需要意根证得，不是意识理解理解就算的。各种观行的成就，就是证得，里面都有意根的参与，是意根的证。内心深处真正的懂，深有感触，就是某种程度的证得，真正认请了事情的真相，促使身心状态产生变化，就是意根的某种程度的证。既然叫作某种程度的证，就不一定是完全彻底的证，所以证也分程度和层次的不同。灭掉意根就不能成佛，而破除意根的无明，才能转识成智，意根永远不要灭，才有五蕴，保有五蕴才能成佛。</p><p>二十八、唯识的修证，意根是核心。因为如来藏用不着任何人指点，不用改变，只能用心于意根，改变了意根，就改变了一个人，从凡夫到果地佛。也只有改变意根，才能改变一切法。</p><p>所有的无明都在意根里，破除意根的无明，就成佛，改变意根就改变种子，种子改变就成佛。意识的无明都是从意根这里来，依意根才有意识和意识的无明，意识和意识的无明都容易断除，根本不是难事，难就难在了意根。所以意根的心所不能比意识少那么多，应该与意识的心所法差不多。禅定力和观察力都严重不足，就无法证得意根，更无法观察意根的心所法的运行，意根在任何一个法中的运行状态，就不知不证，于是就敢贸然否认意根的各种心行，非要说成是意识的心行。</p><p>意根如果不证法，就不能破除无明，破除意识的无明都没有用，不能改变什么。现在看来，在意识上做什么文章都没有用，一切法的修证必须触及到意根，才能解决根本问题。这个思路搞清楚搞明白了，对于佛法的修证应该没有什么话好说了。</p><p>二十九、在静坐思惟观行佛法，感觉越来越有精力，逐渐摆脱了昏沉，这是好现象，说明止观双运有了成效。下座以后如果还能继续保持思惟观行，观行已经成功熏染了意根，意根开始精进用功。修行能熏染了意根，一定有禅定的功德。</p><p>一切修行只要与禅定和意根有关，就会有结果，就落实在根本上了。如果修行中没有禅定，也就不能与意根挂钩，没有熏到意根，没有落实在意根，就不能精进，七觉分就不能现前，也就不能证得佛法。</p><p>世出世间法的关键点都在意根上，因此除了意根，实在是没有什么好说的。一切法的究竟、实质和根本就是如来藏和意根，讲意识讲别的就讲不到根子上，就像隔靴搔痒一样，不解决根本问题。修行就是要在意根上修，只修到意识很浮浅，不能出离欲界，不能脱离三恶道，就会一直在魔王的掌控之下。</p><p>禅定和意根之法，是魔王最忌讳和害怕之法，他唯恐学佛人有了禅定，出离欲界，唯恐学佛人修到意根，证得佛法，脱离他的掌控。因此他要千方百计的阻止学佛人修定，阻止学佛人证法。我们要想得解脱，不被欲界魔掌控，就要精进修出禅定，努力修行意根，早日证得菩提，走上解脱之道。</p><p>三十、意识灭掉以后，剩下的那个才是众生所认为的我，这个我是生死轮回的真正根源，具足了一切烦恼和无明。由于这个我，才有后世无量劫的生死苦报和苦受，才有后世的一切善恶业行，以及各种因缘果报。</p><p>这个我是什么样子，我就是什么样子，这个我没有无明，我就没有无明；这个我没有烦恼，我就没有烦恼。以无无明的我去投胎，我就是佛；以无烦恼的我去投胎，我就是阿罗汉，就是入地菩萨；以具足一切烦恼的我去投胎，我就是十足的凡夫；以善法居多的这个我去投胎，我就是善人；以恶法居多的我去轮回，我就是恶人。</p><p>这个我的原貌是什么样子，我就是什么样子，但愿这个我是没有各种烦恼的，这样也就省却了许多劫的辛苦修行，但愿这个我善多恶少，我也就善报多恶报少；我不希望这个我没有善法或者与善法不相应，我希望这个我具足一切善法。</p><p>我希望这个我没有我见，我希望这个我没有我执，我希望这个我没有我慢，我希望这个我没有贪嗔痴，我希望这个我不要自以为是，我希望这个我去除所有无明，我希望这个我具足一切善法，我希望这个我具足一切福德，我希望这个我智慧广大，我希望这个我彻底转识成智，我希望这个我具足慈悲喜舍，我希望这个我愿力广大，我希望这个我悲悯一切、不舍一个众生，我希望这个我彻底无我，我希望这个我具足无量德能，我希望这个我成为所有众生的依托。</p><p>总而言之，我愿这个我就是我所希望的那样，断除一切恶，具足一切善。因此学佛修行就是要在这个我上着力，让这个我得证一切法，改变一切法，在意识上着力都没有用。</p><p>三十一、意识思惟的内容属于什么法？是从哪里出生的？意识所思惟的法，从如来藏当中来，正是由意根所攀缘出来的，由意根引生，由意根所推动出来的。因此是意根先缘法，意识后缘法，这样的话，有可能是意根先证法，意识后证法。意识对法进行思惟以后，要刹那刹那传入意根，意根再起自己的思量，思量通达以后，就是证得。</p><p>意识思惟五阴具体如何虚妄，这个内容是如何出现的？意根想了解五阴如何虚妄，第八识随顺意根出生意识，意识思惟找证据，把一个个的证据找到向意根报告，交给意根审核，意识自己不能做最后的确定，必须由意根来确定。意根审核意识给出的证据，经过自己的推敲和思量考证，得出一个结论，认为五阴确实是虚妄无我的，没有疑问，确定无疑了，就是证得。意根把确定的信息再告知意识，意识心里也就落地，从而确信无疑。</p><p>意根得到报告，还需要如何运作？祂必须要起自己的思惟筹量和考证，然后才能拍板定局。也有一些时候，意识得不出一个结论，就把思惟没有通达的内容交给意根，由意根参究参研，得出一个最后结论，然后让意识知道。凡是意根亲自考量以后得出的结论，都是确信不疑，非常坚定的。</p><p>三十二、如来藏从来不做主宰，祂不会想着要去投胎，一定是由意根决定去投胎，如来藏才配合意根进入胎中。意根决定投胎时，完全是顺从意根的习气业力而投胎，或者顺应愿力而投胎，这时要看业力大还是愿力大。如果意根没有断我见，没有断除三缚结，其业力还是非常大的，免不了要去三恶道，多数都去鬼道，因为百分之百的人贪心都不轻，有贪心必去鬼道，鬼道的业了，再投生畜生道，畜生道的业缘结束，再回到人间做人。</p><p>所以断我见和明心见性，乃至于证得任何一种法都是意识与意根共同证得，意根不证，三恶道的生死结缚就会促使意根生到三恶道中，然后有三恶道的五阴身和六识被意根所用，这样的五阴身和六识与人的五阴身和六识区别很大，因为业力不同所致。关于投胎这件事，意识完全使不上力，投胎时意识灭了，不能给意根当参谋了，意根完全自己作主，就等于业力完全作主，那么意根不断我见不明心，怎么能解脱生死业呢？</p><p>三十三、入定怕自己消失，怕回不来，这都是意根害怕，因为意根把五阴身当作自己，执著五阴身的功能作用，才怕五阴自己消失不见了。要改变这种情况，需要意识以理来说服意根不要执著自己的五阴身，五阴身并不真实。所以断我见需要意根断，断烦恼需要意根断，断无明需要意根断，一切烦恼都是意根，解脱就是解决意根的问题。</p><p>多少事例都说明这个问题，禅定力不足，智慧力不足，就认识不到这点。那个意根蠢笨蠢笨的，还宝重意识，是意根起火都不知道，却去救意识的火，家产都烧没了，还在外围转悠，众生就是这样无智慧。</p><p>三十四、现量的知是指什么</p><p>现量的知是直觉的呈现，法一出现立时即知，非常迅速，不由分别而知，也不用语言思惟表达之后才能知。比如心经中说：观自在菩萨，行深般若波罗蜜多时，照见五蕴皆空。这里的照见就是现量的知，如果只是用意识见五蕴皆空，那么就不是马上立时就知五蕴皆空，而是经过意识思惟分析一下，然后再知五蕴皆空，这就不是照见了。照见，这个词语，是当下现量呈现的意思，不用逻辑思惟分析整理，当下是什么就是什么。这就是意根的知，是意根的证。</p><p>《大梵天王问佛决疑经》中说：诸佛密意者，以言辞而不可测度。何以故？是法非思量、非思量分能解，即是唯佛与佛究尽法。意思是说，无上甚深的佛法，不是用意识心的觉观思惟可以测度出来的，因为佛法不是意识思量思量所能解得了的，那是只有佛与佛才能究竟明了的法。凡是真正知现量知的时候，都是没有语言，没有思惟，非常直观非常快速的就知了，没有中间过程。不经过一番寒彻骨，只是用意识肤浅粗糙的解一解，那是不能得到佛法的。所以佛法最后的证，一定是意根明了的证，是现量的知。</p><p>禅宗祖师经常说：要知即知，要会即会，思量个什么，思量即不中。过去禅师拷问弟子的智慧，看是否见道，都是不允许弟子再思量的，不允许弟子琢磨来琢磨去的。比如五祖拷问神秀和尚让做个见道的偈子，神秀和尚一天一夜来来回回的在房间里踱步思考也写不出来，五祖就知道他没有见道，只是修了个人天福报。如果禅师问弟子话，弟子稍微一犹豫，禅师就知道没有悟，于是就会一棒子打过去，一是惩治，二是点拨启发。一个人问问题，想要知道另一个人的态度，如果对方一犹豫再回答，就知道答话里有水分，不纯真了。所有经过意识思考过后再知的，就不是真知了。</p><p>现量的知，比如对面来一辆车开得飞快，向你冲过来，你立时就知道危险而躲避。这个知就是现量的知，没有语言思惟分析，没有觉观，这时意根立刻就知道是危险的，于是作主快速避开，没有拖泥带水，不用意识现思惟分析这是危险的，再传导给意根这个分析结果，这样肯定是来不及躲避的。当然意识只要接触这个现象，也是知道危险的，但比意根晚接触这个现象，晚知道一步，往往是想起来才后怕，才知道危险。</p><p>佛陀知众生无量劫前的事，知众生无量劫后的事，都是现量知，没有比对猜想和想入非非，也没有思惟分析推测推理，这些意识分别作用全都没有。所以任何人和事，骗不了佛陀，佛陀全部是现量知一切法。智慧越高深，现量程度越大，意识用的越少，反应越直接快速。</p><p>那么多人都拿意识为首重，实证佛法以意识分别分析为修证方法，看来确实是违背佛陀和祖师意，也违背现量，违背真理。</p></div>"
},{
    "title": "第二章　意根与佛法修证的关系",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　意根与佛法修证的关系</strong></p><p>一、实证的过程必有意根的参与</p><p>初步修习真如实观，就是修习真如三昧，观察一切法皆真如，这样修行也只能证得相似空的三昧境界，也许能获得各种禅定的境界，但还不能证得真正的空三昧智慧境界。要想证得真正的空三昧境界，在禅定中还要仔细参究真如自性，找到祂的所在，观察祂的具体作用，才是证得真正的真如三昧。</p><p>我们学法要有智慧分辨相似法和真正法，有智慧分辨解悟与证悟方法的差别。不要把解悟的方法当作证悟的方法，不要把修定的方法当作参禅的方法，不要满足于浅层次所解，而要下功夫起心探究究竟义，更不要得少为足，努力做一个大心菩萨。没有实修的功夫，只能玩弄嘴皮子，没有解脱的功德受用。尝过解脱滋味的人，就知道心得解脱有多么潇洒自在，用世间什么珍奇异物也不换。</p><p>二、所谓的实修，如果不包括禅定的修行，不修禅定，所修如何有实？没有禅定的情况下，或者是定非常浅的情况下，可以有慧，这种慧只是一种理解层次的慧，不可能有实证上的智慧。理解层次的慧，只停留在意识心对法的理解上，禅宗叫作情思意解，意识卜度，究竟其义是什么，为什么如此，不知不证，只知道个结果，没有证明过程。</p><p>而实证就是证明过程，得出的结论符合既定的答案。这个答案是佛陀给出的，证明过程是每个人实修观行的过程。没有禅定，如何观行？如何出生智慧？虽然解脱在于智慧，成佛在于智慧，可是没有禅定，如何能出生真正的智慧？有些人修行，只要最后一个慧，定不要，吃饭只对最后一张饼感兴趣，前边的饼不想吃。没有禅定的慧，就如最后一张饼，说食不饱，空腹而高论。</p><p>智慧不足的人，往往只喜欢他人的高论，喜欢他人的高调，辨别不了其腹中是否有真货。这样容易耽误自己的道业，以为把所有的法都理解就是证得了，就有了智慧，就能得解脱了，实际上还差得很远。</p><p>一切法证明的过程，一定是意根亲自参与，意根要想知道确切的结果，一定要知道事实真相，意根要想知道事实真相，一定要证据。这个证据的获得是一个辛苦的过程，不仅意识要辛苦广泛而深细的收集证据，意根也要发起深深的疑情，一起寻找证据，一起证明，并且要对意识收集来的证据进行确认。这个过程是相当不容易的，不是轻而易举的像意识那样随意就能认可了某个法，祂要反反复复的思想斗争，反反复复的深细的思量考量，要改变自己无始劫以来的惯性认知和不正确的观念。</p><p>意根寻找到了，就颠覆了从前的所知，于是意根受到触动和震动，身心觉受非常。没有这个过程，不要谈实修实证。离开禅定，这个过程根本完成不了，也不要谈实修实证，那仅仅是高谈阔论而已。</p><p>一切法的结果，佛陀几乎都给出了答案，比如如梦、如幻、如水中月、如镜中像、如阳炎等等，都是佛陀给出的答案，知道答案有什么稀奇，证明过程才能显示出每个人的真正智慧。一问三不知的解慧，稍微聪明一点的人，都能得到，没什么稀奇的。</p><p>那些未悟的凡夫，因为聪明理解力强，知识广博，文笔口才俊秀，花个时间，就能写出几万字关于一切法如梦如幻的论述。可是这些论述，哪里有观行的痕迹，哪里有实证的痕迹，哪有证明过程。有些人偏偏喜欢这些东西，日以继夜的背诵，即使学富五车有什么用？</p><p>三、真正参禅做功夫的原理</p><p>参禅时，意识无念，意根千万不要无念，没有念，纯属是修定，不能生起智慧，因此不能开悟，也不能见性。</p><p>定力非常好时，意识好像无念，其实还有一个念头悬挂在心头，就是悬挂在意根那里，意根在参究，意识配合，资料够用，数据完整，就以意根为主参究。如果数据不足，意根就向意识要资料和数据，之后再深深的参究。这是真正的参究用功的秘密，如果都知道了，就不是秘密了。意根向意识要资料数据时，意识就要明显的思惟分析了，再把分析思惟的内容结果交给意根，然后意根再依此数据进行参究。</p><p>我们都有过经验，就是自己表面好像没有什么念头和思惟了，其实内心深处并没有沉静，还有一些思想动态深深的隐藏着，就像大海的水，表面静止很平静的样子，实际其流很迅猛。意根就是这样，深密难寻，高深莫测。</p><p>参禅证悟要在一定的因缘条件下才能证悟，要看意识和意根各自的状况而定。因此有经验和高度负责任的禅师，会观察弟子的因缘是否具足，如果不具足，缺少禅定的，就不会下手引导，以免让弟子解悟，一辈子无法充满活力。在不同的禅师手下悟，其智慧大有区别，证量差别很大。所以遇见什么样的禅师，也恰恰说明了自己的福德和因缘问题。</p><p>四、意根参究才是真正参禅</p><p>一名心理学者的研究报告中说：当脑波处于α状态时，人的意识活动明显受抑制，无法进行逻辑思惟，处于无意识状。此时，大脑凭直觉、灵感、惯性、图像、想象等接收或传递信息，此时的潜意识处于活跃状态。</p><p>看了这段内容，再说意根没有心理活动，没有思惟活动，没有思量性，那就说不过去了。这段里的α状态是指定中的状态，定中意识少于现行，或者不现行，意根的思量作用就能充分发挥出来。为什么这样说呢？因为这时意根受到意识的干扰较少，意根比较专注，思量性就增强了。为什么意识能干扰到意根呢？因为意识每时每刻的了别活动，都作为一种信息传递给意根，意根就要作了别和处理，还有五识传递过来的信息，意根都要了别和处理，还有六尘以外的信息，意根也要了别和处理，意根如此的忙碌，那就没有时间来专心思量一些重大的问题，重大的问题就不能解决。</p><p>意识粗浅所思考和理解的结果，根本不能算数，因为证据不足，数据不够，意根不承认；即使是证据足够，数据也充足，意根也要自己把这些证据和数据重新从头思量一遍，才能作个最终的判断。因为祂是审察者和把关者，有责任把意识的抉择再过滤一遍才能放行，然后如来藏具体执行，如来藏只听从意根的指挥和召唤，不听从意识的单独判断和决定。</p><p>在断我见和参禅时，首先意识要给足意根所有的证据和数据，然后意识少于思惟，少于功用，配合意根的心理活动需要，放手让意根自己思量和考量，让祂自己印证一些事实。如果意根觉得事实还不充分，证据还不足，数据还不够，那么意识再思惟观行，再收集数据交给意根，意根再投入的深深的思量和考量，这样意识在旁边不断的补充一些数据资料，意根就能不断的加工，不断的完善思惟，最后得出一个扎扎实实的、证据确凿的结论出来，就证果和明心了。</p><p>如果事情比较多，意识必须出定了别六尘，那么意根也可以暗暗的自己用功，行住坐卧不离参究，乃至于晚上有梦无梦时都可以用功。意根实在感觉事情重大时，可以决定废寝忘食，不眠不食，因为意根要精进了，这些饮食活动影响意根的专心思虑，祂会分神于日常琐碎，就会决定减少五阴其他活动，以保证自己不分神。睡觉时没有意识的从旁佐助，意根就没有充分的数据和材料，无法下手参究。于是意根就决定不睡觉，不让意识灭去。</p><p>没有意识的配合和协助，意根也能参究和思量法义，只是需要的时间要长一些，说不定是什么时候了。有事例为证，比如晚上思考一个问题，没有解决，就睡着了。睡了一夜觉以后，第二天眼睛刚刚睁开，灵感就现前，突然明白了没有解决的这个问题。说明这一夜，意根都在工作着思量着。晚上睡前留了个疑问给意根，早上一醒来就得到答案了，有不少人有此类似的经验。再比如有时候思惟过的问题，当时可能没得到答案，于是就去忙其他的事情，表面上好像把这件事忘了，意识不再考虑了，然后指不定在什么时候，脑子里突然有了答案，这是意根一直在背后默默的思量，最后思量出了结果。修行就是要多用意根，意根的修行才是真修行，才能证得一切法，获得一切智慧。</p><p>五、信解行证，分为意识层次的和意根层次的，究竟彻底起决定主宰作用的，是意根层次的信解行证。只有意识信，意根无法采取行动，不能精进修行，不能证得佛法。意根信，才是真正信，意根不信，无法真正起修。</p><p>信解行证，实际上都是意根的事，意识只能是助手，不能成为主角。意识前行引导，意根真知，就证法。有的意识有经验和智慧会引导，有的意识没有经验和智慧，不会引导。</p><p>信解行证，是修行的四个次第，信不等于解，解不等于行，行不等于证。比如说断我见是证，但是烦恼不一定同时消除，我执没有断，就是行不具足。也可以说，断我见之后，有些法还没有证得，所以烦恼和我执还不能同时断除。</p><p>深信切愿的想往生极乐世界，深，指意根，浅指意识；切，指意根，不切指意识。如意根对极乐世界深信切愿，才能往生极乐世界。只是意识信有极乐世界，意根不信，就不能去，去与不去，由意根作主。所以，信有层次深浅之说，愿有层次力度之说。能作主宰才有力度，不能作主宰的就没有力度。</p><p>再比如说明心，是证得如来藏阿赖耶识，但是烦恼没有断除，习气没有断除，行就不得力，不具足。也说明某些法还没有证得，行就不具足，后续那些法都证得了，行就具足完善了。明心以后，顺次证得如幻观、阳炎观、如梦观、如镜像观、如光影观等等，烦恼消除，习气渐渐消除，无明减少，菩萨心性不断增强，菩萨行不断完善。</p><p>没有前边的证，就没有后边的行。所以说一切法只要证得，行就能同时完成，这就说明证有解脱的功德受用，不同程度的证，都有相应的解脱功德受用。那么初果有初果的功德受用，四果有四果的功德受用，明心有明心的功德受用，各个观行层次的菩萨果位的证得，都有相应的解脱功德受用，成佛有佛地的解脱功德受用，没有功德受用，就没有证。最后一个法也证得时，行就完完全全具足，就成佛。所以修行的次第还是信解行证，证为最后最终，最究竟。只要证得了，其余的事情不用管，肯定都会合乎于理，理事就会圆融，因为到家了，就可以歇息了。</p><p>六、意识要常常熏染意根，以期改变意根固有的认知和观念。意识理解一切法都不难，难在意根的理解和认知上，所以改变意根的观念非常困难。而一旦改变意根的观念，证果就是唾手可得的事情，明心见性和成就各种观行也都是唾手可得的事情。意根一旦证果，其思想观念也就瞬间改变了。</p><p>意识理解再熏习意根是前提，后续的工作，也就是最主要的工作，就是让意根亲自参究思量，之后才能亲证，没有这个程序都是解。</p><p>古语云：三岁孩子说得，八十老翁做不得。有的人说话能到佛地境界，把佛的证量当作自己的证量，可是自己真正证得和做到时，就已经成佛了。意思就是说理解问题非常容易，真正证得难上难。所以圣人稀有甚稀有，不是像有些人那样，看两本书，理解理解一个圣人就横空出世了。</p><p>七、断我见是意根否定了五蕴的真实性；开悟明心是意根认可了如来藏的真实性，两种取证最终都是意根在起用。那么断我见与开悟明心时是意根的慧在起用，还是思量性在起用？</p><p>断我见和明心见性过程中，意根的思量性和慧心所两者都在起用。因为意根有了别性，有识别性，有认知性，有抉择性，有作主性，有攀缘性，有执著性，因此就有慧心所的起用，没有慧，就没有这些功能作用。只是这些慧的功能性比较特殊，是一种广泛性的、泛泛性的，无法专一和深入，了别的不能太具体和深细，因此六尘境界上的法，需要六识配合了别，意根再作独特的了别、判断和抉择，这里也涉及到了慧心所的起用，没有慧心所的了别慧，意根就没有识性，只具有根性，而意根是二者兼具。</p><p>意根的思量性，普遍地伴随意根的运行，意根只要存在，思量性也是刹那刹那都存在运行着。因为意根刹那思量，刹那抉择，刹那作主，一切法才能刹那刹那的现起不灭，否则一切法就有断灭不连续的时候。只要意根有所缘，只要作意和接触了一切法，意根的思量性就要在一切法上现行出来，一切法才能运行和存在。意根的思量性不断运作，才能有意根的慧心所的运作。意根普遍存在一切法中，意根的五遍行心所法就要普遍存在于一切法的运行中，是意根智慧生起的前提条件。其它几个识心的五遍行心所法也复如是。</p><p>所以说在断我见和明心证悟过程中，意根的思量性一直在运行着，思量的过程也体现出意根的智慧性，智慧程度不同，思量的过程、内容和结果就不同，得出的结论就不同，其抉择就不同，六识的造作和功德受用就不同。因为意根在思量五蕴的时候，具有了小乘空的智慧，才能认识到五蕴是空的无我的，才能断除我见。又因为意根在思量第八识的时候，具有大乘法的智慧，才能认识到第八识的真实性，才能有实相智慧的出生。意根的思量性和了别慧是互相辅助协调运行着的，缺一就不能有一切法的正常运转。</p><p>八、外色是众多如来藏共同变现，内色是自己如来藏单独变现，眼根是如来藏变现，眼识是如来藏变现，眼识见色的作用是由如来藏、第七识、第六识、眼识共同作用，把内色显现在眼识意识里。其中四个识各有其作用，也有和合的作用，根尘识三者都是如来藏变现、执持和督导的，离此三者，无众生无五蕴。那么五蕴众生是什么？哪里有我，哪里有五蕴？哪个是我？见色、闻声、嗅香、尝味、觉触、思法，一切的见闻觉知，所有的觉受功能，所有的思想情怀，都是什么？</p><p>把五蕴所依赖的法，找出来，观行这些法都是什么，这些法又依赖着什么？有依赖性，就是非真实的，不自在的，不自主的，苦空无常的，生灭的，幻化的，虚妄的，无我的。顺着这样的思惟，入定观行，捋清思路，让意根去感知，去觉悟，去触证，最后内心里就会有一个声音：这一切法真的没有真实性，都是一场闹剧，哪里有我，哪个是我，都不是。然后大哭一场，身心脱落，了无挂碍。</p><p>这其中有一个过程，当意根渐渐要认清这个事实时，心理会非常的痛苦和难过，执著了那么久远劫的我，眼看着就要不属于我了，心理当然是空落落的，甚至感到有些恐惧，就像站在悬崖边上，非常担心掉落下去，犹豫、失落、害怕，明明知道什么都没有，又担心什么都抓不到了，那个心境烦躁得很，搅闹得很。过一段时间，就能接受下来，太平下来，恢复正常。这是今世第一次即将要断我见的人所要经历的过程，前世已经多生多世断我见的人，则会很轻松，快乐而心喜。</p><p>九、意识在思惟和参究任何一个法时，都不是单独运作的，都有意根的配合作用，当意识观察、思考、参究意根，寻找意根时，意根也随同意识一起寻觅意根自己，那么意根也能参究自己，最后就能观察自己。</p><p>当意识终于证得意根存在的时候，观察出意根的运作的时候，意根也能随同意识，而证得自己的存在，也能随同意识而了别自己。宇宙器世间里没有意识，科学家却能把宇宙的一些事情搞明白，地球几千年几万年的事情，科学家也能探讨出来。未来世也没有现在的意识，科学家就能预测未来。如来藏的运作里没有意识，意识却能观察到如来藏的深细运作。那么意根的运作，意根对一切法的证知作用，意识当然也能观察和了知到。意识转识成智以后，什么事情都能作，否则就不能成佛。</p><p>十、六祖在坛经中对大众说：吾有一物，无头无尾，无名无字，无背无面，诸人还识否？神会小和尚说：是诸佛之本源，神会之佛性也。六祖说：跟你说无名无字，你还说本源佛性，你将来也就是个知解宗徒而已。</p><p>什么叫作知解宗徒？知和解都是意识所为，意根不知不解，就不是证。神会小和尚的意识虽然知道是本源佛性，却没有证得本源佛性，六祖就说他是知解宗徒，而且预测他将来也是个知解宗徒，只能解悟佛法，不能证得佛法，不管他讲多少法和讲什么法。</p><p>六祖以及当时所有的禅师们，都反对知解而不务实的修证，反对情思意解，反对不切实作参禅的功夫，而到处卖弄口舌，这样只能作一个知解宗徒，不能成为真真正正的大乘菩萨。现在众生的根器更是浮躁，更不务实，根本不修禅定，现代信息技术发达，很多人什么都知道，但却什么都不能证得。</p><p>可见，意识知道多少佛法都没有用，仍然被祖师骂，不能于解脱有丝毫的利益。必须下功夫，真修实证，老老实实修禅定，修止观，老老实实的参禅悟道，不要耍小聪明，卖弄佛学知识；即使三藏十二部经都知道了，都会背诵了，即使也能讲三藏十二部经，也不如脚踏实地的实证一个无我来得实际。</p><p>十一、坐禅三昧经</p><p>原文：复次观身空界。常习此观。欲力精进力。一心力慧力。极为广大。便能举身。如大风力。致重达远。此亦如是。初当自试。离地一尺二尺。渐至一丈。还来本处。如鸟子学飞。小儿学行。思惟自审。知心力大。必能至远。学观四大。除却地大。但观三大。心念不散。便得自在。身无挂碍。如鸟飞行。当复学习。远作近想。是故近灭远出。</p><p>释：复次再观察色身的空大，把色身当成空的，常常如此修习观察，欲力更加广大，精进力、专注力和观察慧力变得极为广大，这时就能把身体高举起来，身体就渐渐离开座位，升上虚空。如有很强大的风力作用，把很重的物体吹向很远之处，举起身体也是这样。刚开始时自己应当一点一点的试验，让身体离开地面一尺二尺，渐渐离开一丈，然后再回到原处。就像小鸟学飞行一样，像小孩学走路一样。自己不断的思惟审查考量自己的心力，到一定时候知道自己的心力已经很大了，一定能飞到远处。</p><p>然后再修习观察自身的四大地水火风，除去心中的地大，只观察水火风大，让心念专一不散，之后身体就能得到自在，没有了任何挂碍，如鸟飞行一样。这时应当再学习观察，把远处当作近处想，灭去空间距离想，身体就能瞬间到达远处，如在近处一样。</p><p>为什么把远处当作近处想，灭去空间距离想，身体就能瞬间到达远处，如在近处一样？因为这样想，就让意根相信，意根确实相信了，就如此认为，如此认为，如来藏必随顺意根变造如此的境界，神通即如此，一切法都如此，意根相信什么，就会出现什么，改变意根就能改变一切。所以真正的自信，就是意根的信，只要意根相信，无事不成办，成佛就是如此原理。那么意根证得无我，相信无我，其无我之力该有多大？断除我执和一切烦恼，灭除一切的我，心得解脱，入寂静涅槃。</p><p>十二、技术娴熟，游刃有余，意根在其中起什么作用？在世间法上来说，掌握了一门技术，既要有理论，又要有实践。从佛法上来说，理论是意识的理解，掌握和实践才是意根的实证。技术娴熟，是不断实践熏染意根的结果，是意根对理论的掌握，而且还有智慧的观照作用。不断的总结经验，让意根提升智慧，心所法改变，这样技术才能娴熟。</p><p>比如说，学骑自行车，将骑车理论背得滚瓜烂熟，还是不会骑。必须骑上车反复练习，才能会骑车。身体运作都是意根在如来藏的配合下，直接操控的，练的过程，就是利用意识思惟来熏意根的过程，意根反复受熏了，指挥身体很熟练了，这时不用意识关照得太多，不用意识把注意力都放在骑车这件事上，车骑得照样稳，因为意根已经熟悉操作，得心应手了。</p><p>意根指挥六识操作，指挥熟练，六识操作就熟练。意根凭什么能熟练指挥？从这里看出来，意根没有记性，是绝对不可能的。如果意根没有记性，意识永远不能熏染得了意根，意根转身就忘，意识反反复复的练习也没有用处。如果在后世遇到相应的缘，就会非常快的学会了某种技术，就是意根的记性起作用了。</p><p>学理论的目的是为了能实际操作，如果不能操作起来，理论就无用。意识的解如果不能导致意根的证，所解也没有用。</p><p>十三、有些人有这样的经历，对于某些问题，意识不理解，就暂时先存疑，过了一段时间以后，忽然脑子里冒出个念头，就明白了那个问题，于是疑问消除了。脑子里冒出的念头是意根给出的答案，有可能还不是很究竟，需要意识再依之仔细思惟。所以意识对某些问题，表面好像不思考不去想了，可是意根并没有放下，一直在思量着。因为意识给出的数据不足，意根也就思量不出最终的结果，但最起码也有了方向和眉目。所以修行还是要不断鞭策意识，多思惟观行，多集积数据收集资料，让意根掌握更多的证据，证悟就快了。</p><p>在意识没有思考时，或者在做其它事情时，突然有了答案，意识并没有思惟，那就是意根思考过后得出的暂时结论。为什么突然出现答案？因为意根的思量作用意识根本观察不到，当意根明白时，就警觉了意识，意识就觉得是突然明白的，于是心里就惊讶。如果是意识一直在思考的问题，那是连续不断一点点明白的，并不觉得突然，不会惊讶，不会奇怪，因为有心理准备。</p><p>这些思惟方法和过程都掌握会运用了，佛法修证的钥匙也就掌握了，逻辑思惟能力就会提高，以后佛法的修证就快速了。</p><p>十四、真正的证得一切法，都是六七识同时证得，同时认可的。如果只有意识心认为如何如何，但意根不认可，不知道也不明白六识所认可的道理，那么意根就没有受熏成功，祂就没有证得佛法，身心世界不可能发生转变。因为意识仅浮在表面，思惟也比较浅，意识自己又不能自主，完全依赖于深层次意根的主导，意根没有被熏染成功，祂还是以原来故有的认知来主导意识的一切行为造作，意识自己单独的见解就不能起到应有的作用。</p><p>意根是作主识，也就是我们通常所说的内心深处的潜意识，如果是意根内心深处所认可的事和理，就能促使身口意行按照所认可之理去行事，虽然意根在断我执之前还是有执著和烦恼，不能完全按照所证得的理去作抉择，但是毕竟意根在观念上已经有所转变了，当意根断除烦恼和我执时，内心不再有我，熏习就算非常成功了。</p><p>十五、修行的步骤：闻思修证，闻由意识完成，意根配合；思由意识先思，广罗数据，熏染意根，意根也发起思慧；修，由意识作参谋，意根主导，发起观行参究；证由二者共同证得佛法。其实修是在证法之后的事情，由意识降伏烦恼和断除烦恼，再督导意根降伏烦恼和断除烦恼，意识转变影响带动意根转变，从而改变自我，转识成智，获得更深智慧。</p><p>十六、意根知道就是证得，意根证得就知道如何做。正是意根不知，才叫作无明，破除意根的不知，叫作明，意根明以后，就做明事，不再做糊涂事。</p><p>而意识无论知道什么都没有用，因为不能作主去实践操作。意识知而意根不知，意根无法按照意识的知而行事，就叫作说到做不到。意识知道吸烟有害健康，意根不知道，就决定照吸不误，意识知道造恶业要有恶果，意根不知道，就决定继续造恶业。意识知道有个如来藏，意根不知，就仍然把五阴当作我而执着不舍，生死流转就不灭。因此说，意根的知很重要，意根的明很重要，意根的证更重要，意根证了就知了，知了就明了出生智慧，明了就做明事，身口意改变，烦恼降伏，染污业消除，以至于寂静涅槃，成就一切法。</p><p>十七、接触和懂得意根的法，少走了多少的弯路，让自己省却了多少劫的苦修时间，免去了多少时劫的苦难。修行的理路，完全在于意根，不懂意根，对于成佛之法，成佛之道，心中无法了然。只停留在意识上，总是在意识上弄精魂，意识一灭，自己是个什么？这点大家应该仔细思惟。把意根的本来面目调理好修理好，才能改变自己，才能解脱，业种才能转变清净，最后才能成佛。经常在心里问问自己：意识一灭，我是个什么？实际上意根是什么，自己就是什么。</p><p>一个皇帝要立太子，指望太子兴家卫国，一个儿子身体健康，另一个儿子身体多病，生死未卜。皇帝会立哪个儿子为太子?只有在皇帝昏头的时候，才立生死未卜的儿子为太子，指望他传宗接代，保家卫国。学佛人也是，糊涂人才把一切希望都寄托在意识心上，让意识证果就可以了，让意识明心知道如来藏就可以了。可是意识断灭以后还不是凡夫一个？</p><p>还有一些人说：意根不用断我见，直接可以断我执。不断我见，就能断我执，也是一种发明创造，关键是这种发明创造，是否行得通。还有说：不用意根明心证得如来藏，就能直接转识成智，直接成佛。这更是一种发明创造，关键是这种发明创造有什么用途。如果这些发明创造都能行得通，那么学佛也就太轻松容易了，指日可待，在意识心上弄一弄就行了，会背个三藏十二部经就能成佛。可是事实呢，成佛需要三大无量劫来消除所有无明，直至断尽无明为止，非常不容易。</p><p>十八、五倶意识比独头意识的力量大得多，因为能现量观察事实，所以五俱意识现量观察出来的内容，更加能让意根信服。五俱意识掌握的信息更真实更全面，资料更丰富，证据更确凿，意根就容易采纳这些信息，作为可依靠的依据，以此来作抉择和判定。</p><p>实践不是凭空想象，一定有意根参与，没有意根参与的，都是不踏实的，属于情思意解，犹如空中楼阁。意根参与实践了之后，才能真知，意根知是真知。如果仅仅是意识的知，没有经过检验和验证，很不靠谱，那是学来的知识和理论，不是自己亲证出来的。只有经过了意根的检验和验证，才是实证亲证。</p><p>如果意识能够成功熏染了意根，那么意识的力量就非常巨大。我们学佛到最终成佛，就是靠意识不断深入的熏染意根，断除意根的无明，彻底转识成智，最终就成佛了。</p><p>十九、不能证得无我的原因</p><p>我们知道这个色身不是我，但就是没有办法断我见，为什么？</p><p>一是意识心没有无我的智慧，不懂得观行和思惟，不懂得收集证据资料，不懂得熏染意根；</p><p>二是禅定力不足，无法专心思惟，无法让意根接受意识的观念，意根无法专心考量意识收集的证据和资料，也就无法断除我见；</p><p>三是意根无始劫以来的观念最难扭转过来，虽然有时候意识明明知道色身是生生灭灭不真实的，不可能是我，意根就没办法认可这个理，卡就卡在这里。多数时候，意识提供的证据也不足不确凿，比如一加一等于二这个命题，知道这个命题是正确的，可是为什么一加一等于二是正确的，不知道。如果连意识都不知道，意根就更不可能知道了。</p><p>观行色身无我，要从各个不同的侧面来观行，比如如果砍去了一只手，观行那只手是我吗？不是，因为手没有了，可是我还在，如果手是我，那我就没有了，可见这个手不是我；如果把眼睛挖掉以后，我不是也还在不消失吗？那眼睛就不是我；如果把耳朵割掉了，我仍然还存在，并没有死，耳朵就不是我；如果把头割掉了，我虽然也随之死去，但是我如果确实没有了，就不会再有未来世的我了，可见头和这色身也不是我。昨天的我，是我吗？如果是我，那昨天的我，哪里去了？明天的我是我吗？如果是，我在哪里？把这些问题凝成一个念，悬在心里，有朝一日，意根终究会明白：哦，原来是这样，色身五蕴都不是我。这样我见就断了。</p><p>二十、意根的非量认知</p><p>非量是与事实不符的认知，这个事实也分不同的层次。真正的事实，就是法界实相，一切法都是如来藏性。世俗法里的事实真相，就是六尘的外相分，叫作本质境，是所有如来藏共同合作变现出来的，是第一次成相。依这个本质境，个体如来藏再单独传导变现出性境，在后脑胜义根里成相，是第二次成相。</p><p>其实这个相与第一次成的相细微处有一定的差异，但大体相同。因为这个相要在各种介子中间经过传导，传导过程中，四大微粒要被介子阻碍，通过介子以后，四大微粒数量和结构要发生变化，传导的过程越长，介子越密集，四大微粒发生的变化越大，物质与原来的状态越有差别。所以远处的物体我们眼睛看得就不太清晰了，感觉比较模糊。</p><p>这样的第二次成的相也可以叫作事实真相，但却是相对的实和真。五识六识就是了别这种相貌，如果能了别清楚，符合第二次成的相，也是现量了别。如果把第二次成的相也做错误歪曲的了别，那就是非量，如果必须与其他参照物比较才能了别清楚，就叫作比量了别。</p><p>而第七识就把这些相都当作是自己所有的，都当作真实的而生起执著，更是非量了别。把一切法都当作是我和我所有的，就是非量境界，没有现量智慧，需要通过观行证得这些法不是真实的，不是我和我所有的，都是如来藏变现的，都是无我的，都是生灭幻化虚妄的。这样才能灭除意根的非量认知，获得大智慧，不被这些法所缠缚，从而得到大解脱！</p><p>那么有些人非要认为断除意识的我见就可以了，让意识明心见性就可以了，让意识获得解脱的智慧就可以了，这怎么能可以呢？明明是意根的无明演化出世间一切法，然后系缚意根不出生死轮回，仅仅断除意识的无明有什么用？意根是生死根，不把根挖掘掉，割截意识的枝叶有什么用？</p></div>"
},{
    "title": "第三章　小乘的解悟与证悟",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　小乘的解悟与证悟</strong></p><p>一、在生命的最初期里，只有第八识和意根，一真一妄，真我假我就这样相安无事的存在着，混混沌沌。由于意根的无明妄想，不安于现状，想要向外求索，于是第八识满足意根，三界世间逐渐形成，之后五阴身形成，才有了生死轮回的现象，有了六识来了知和承受生死之苦乐。</p><p>那么最根本的我，最原始的我，能作主的我，就是意根，而不是意识。意识只不过是意根攀缘妄想的产物，是意根探索世界，贪执世间的一个工具罢了，意根想用就用，不想用就弃。从这里可以看出，意根和意识在五阴世间里的地位和关系如何，意根的主导地位，意识望尘莫及。那么我见究竟是谁拥有的，就一目了然了，我见的来源就一目了然了，究竟要断除谁的我见也一目了然了，如何断我见也就一目了然了。</p><p>为什么极大多数众生要不断的在意识上大作文章呢？因为意识浮在五阴的表面，比较浅，容易观察到感知得到。意根埋藏得太深密，主导作用隐秘难见，极不容易观察到感知到。因为祂是主子是主导者，一定要这样深沉一些，一定要在背后垂帘听政，不能轻易让人得见，如来藏更是这样隐秘难见。这与众生只见世俗界，不见真谛如来藏，是一个道理。</p><p>譬如世间里，尊贵如帝王之人，布衣百姓不具一定的福德因缘，如何能轻易得见帝王将相？只能常常见到为帝王将相跑事的兵众衙役。那么官差兵众办的好事坏事，应该算在谁的头上？都是帝王将相的指令，应该算到帝王头上，属于帝王的政绩！同理，五阴身的我见邪见是谁之过？生死轮回是谁之过？全部是意根之过，除此无他。所以修行就应该熏染教导意根，改变意根，断除意根种种的我见和各种无明，这才是根本。</p><p>二、断我见的根本是要断除意根的我见</p><p>众生都把五阴当作我，那众生是指谁？众生主要是指意根，五阴以意根为主，意根统领六识，与色身一起组成了五阴身。维摩诘经里说：了众生心行。是谁了众生心行？是如来藏了众生心行，这个众生就是意根。因为如来藏主要了意根的心行，帮助实现意根的愿望和想法，之后才能有五阴六识的身口意行的造作，才有三界世间法的显现。这个意根就代表众生，意根把五阴当作我，把色阴当作我，把受阴当作我，再把想阴当作我，把行阴当作我，再把识阴六识当作我；还把如来藏的各种功能作用也当作我（意根）的，这一切法都是我弄出来的，都属于我所有，所以这个我主要指意根。</p><p>那么断我见是断谁的我见，现在就很明显了，断我见主要是断意根的我见。意根把这一切法都当作我，断我见就是让意根不要再认为五阴是我（意根）了，把意根的这个知见断除就是断我见。所以断我见一定要触及到意根，一定要让意根认可五阴不是我才是断我见。</p><p>这个我就是指意根，不是指的六识意识心，因为是意根把识阴即六识、受阴、想阴、行阴、色阴都当作我，所以断我见就是让意根不要再认这些法为我了。如果意根不断我见，只是意识断我见，意识认为五阴不是我，这个是不是断我见？现在看来，意识认为不是我，没有用，这不是断我见，必须让意根认可五阴不是我意根，才是最根本和究竟的断我见。</p><p>三、我们学了那么多无我之理，都觉得五阴不是我，都是空的，一切法都是幻化的，可是觉得归觉得，毕竟还不是证得，因此内心里一点都不空。那就说明觉得是意识心觉得，意识心觉得的不太起作用，意识不作主；作主的意根不觉得，就没有实证，心里的我还是照样存在，该抓取什么还是照样的抓取，生死结缚一个都不能断。因为意识心学的这些法还没有熏染到意根，意根还不懂得这些法，还不认可这些法，不知道五阴都是虚妄的，我见没有断时，三縛结就不断。</p><p>所以说觉得五阴六尘是虚妄的，觉得一切法都是幻化的，都是意识通过学习得来的知见，只有知见没有实证，相当于纸上谈兵一样，不能断除结缚，内心深处照样感觉接触的一切都是真实的，为了这些东西仍然要执取、抓取不断。意根没有证得五阴无我，没有证得一切法的虚幻，光是意识心对于理论上的理解不起作用，这个就不叫作实证了。</p><p>四、真正的断我见，不仅是意识明了无我之理，意根也同时证得无我，认可无我之理，意根能亲自证明无我，就会减轻对自我的执取，那么身心内外就会放松下来，顿时得到了不同程度的解脱的功德受用。如果仅仅是理论上的断我见，只是意识理解的，证据不充分，没有说服力，意根不证，一点解脱的功德受用也没有，身心世界不会转变，意根没有亲自证得，没有亲证，就不是现量境界，因为身心世界是由意根统治和执取的，由意根说了算。</p><p>明心证得如来藏，也是意根的现量境界，意根亲自证得，意根就知道五蕴十八界不是我，就把自我放松，身心世界就大转变，得到了解脱的功德受用，无比自在。否则意识的理解，就是理论，最多是一个解悟，与生死了不相干，不得解脱的功德受用，因为意根没有现量观察到，意根没有亲自证得，意根不认可，身心就不转变。</p><p>五、我们在佛法上做观行，越观行越觉得最根本的东西是在意根上。意根是成佛的关键，也是生死轮回的主宰，把意根降伏了，熏修成功了，让祂证得佛法，我们就得解脱，就成就佛道。那断我见一定是断意根的我见，意识通过学理论熏染意根，让意根参究五阴无我，让意根认可这些法都不是我，也不是我所有的。意根一旦证得此理，三縛结断，心就能逐渐清净下来，心行就要逐渐转变，当祂不再执取抓取一切法时，我们就得解脱。</p><p>这是修行的关键和秘密，小乘、大乘都如此。大乘方面，意根一直把如来藏的功德当作自己的，一切法都是我的，都是我所拥有的，我能决定一切法，我是一切法的主宰。意根不知道法界的实相是什么，不知道一切法都是如来藏幻化出来的，也不知道祂自己就是如来藏变现出来的一个幻化法。由于意根不知此理，才把一切法当作真实有而执取不断，才造作身口意的业行，那样生死就不断，也不能成佛。</p><p>学大乘法就是要让意识从理论上明了这些法的无我性，知道如来藏的真实有性，然后再熏染意根，让意根思量参究，最后取证如来藏。法界实相就是如来藏，法界里的一切法都是如来藏所变化出来的，这一切功能作用都不是意根的功能作用，都是如来藏的功能作用，意根知道认可这个理以后，就证得了实相。以后在修证过程中，渐渐的不再执取自我，不再执取一切法，那么法执就能逐渐断尽。这样修行，不仅能断我执，还能断法执，法执一断，最后就究竟成佛了。</p><p>所以修行的关键全在意根上，无明在意根上，断除无明也是要断除意根的无明，断除烦恼也是要断除意根的烦恼。得解脱是让谁得解脱？是让意根得解脱，祂不执取三界世间法就没有生死束缚，当然得解脱了。成佛是谁成佛？六识成不了佛，六识生灭幻化不已，不能去至他世，那要如何成佛？意根能一直存在不灭，能一直延续到成佛时，成佛之后也永远不灭，因此成佛是意根成就的，是意根取佛果和佛位。但究竟理地，意根永远不是佛，也取不到什么果位，成佛也是幻化法，不是实法。如来藏不成佛，究竟理地，意根也不成佛，到成佛那一天就知道了，没有佛可成，哪个识也不成佛，这样才能究竟成佛。</p><p>六、意根断我见才能断除三縛结</p><p>断我见，同时就断三缚结：我见、见取见、疑见。断除三缚结，就保证未来世永远不下三恶道。如果只是意识断我见就行了，那么意识能否把三缚结断除？三缚结是绑缚意识还是绑缚意根的，还是二者都绑缚？断除生死结缚是由意识决定的吗？意识对生死大事能作主吗？无始劫以来的结缚，是意根的还是意识的，意识有能力斩断吗？</p><p>无始劫以来的生死结缚主要是指意根的结，三缚结主要是绑缚意根的。因为意根生生世世不灭，与业力相应，随着业力流转于六道。意识只能存在一世，并不能做主出生下一世的五阴身。意识让五阴身改变一点点都不可能，在六尘上也作不得一点的主，让脚抬一抬都做不到，告诉自己玻璃栈道是安全的，往前走吧，腿就是抬不起来，那意识怎么能够作主断除无始劫以来的生死结缚呢？</p><p>意根在任何一个法上都要作主，不可能在断我见这样无始劫以来的重大问题上就不作主了；如果断我见不是意根作主的，就是假断我见，不是真断我见。凡是只有意识的表面主张，意根不主张而勉强随顺的，都是假，犹如演戏；只有深层次的意根主张的，发自内心的主张，才是真。</p><p>所以世人的言行就分为真假两种，哭就有真哭和假哭的区别，笑就有真笑和假笑的区别，害怕就要真害怕和假害怕的区别，关心人就有真关心和假关心的区别，生气就有真生气和假生气的区别，仇恨就有真恨和假恨的区别等等。因为世人的言行有真有假，所以互相交往都互相猜疑和提防，需要摸清对方的真实想法和用心，不敢轻易相信对方，也因此故，世人都觉得与人打交道很累心，稍微不小心，就被人欺骗和算计了，世人的尔虞我诈就是如此。</p><p>在佛法的修证上，同样分为真有修证和假有修证之别，断我见就分为真断我见和假断我见的区别，明心就分为真明心和假明心的区别。真真假假充满了世俗生活和佛教的修行中，让人不容易辨别。凡是假的，都是意识表面的，也可以说是装的，是做作的。凡是真的，都是与意根深层次相应的，是意根认可的，是从内心深处流露出来的，是发自肺腑的，是不做作的，是让人信任的，诚实无欺的。</p><p>如果断我见仅仅是意识断我见，意根不断我见，那么意根就没有断除三缚结，意根的心行还与三恶道相应，没有解除绳索，那就不能保证不入三恶道。因为是否入三恶道由业种和业力决定，意根与业种和业力相应，是连接三世的识心，意根没有断除三缚结，业种就没有改变，命终由于业力牵引就要入三恶道。观察意根在中阴身里的表现就知道了，意根在中阴身里是完全与自己的烦恼习气相应的，肯定要随着自己的烦恼习气的现行而去投胎。</p><p>意识心一点办法也没有，因为意识不能作主，又是断灭的，断除以后的事情更是不能作主。所以只修意识根本没有用处，只有意识断我见，不能解决生死问题和不入三恶道的问题。退一步来说，意识能决定不下三恶道，那么临终时，意识先灭了，只有意根和如来藏，没有意识存在了，可是还有意根和业力，意根的结缚没有断除，当然就免不了要下三恶道了。意识不能与业种业力相应，去三恶道与不去三恶道，意识就完全决定不了，就连意识自己的存在与否也决定不了，如何能决定不去三恶道。</p><p>七、生死轮回和三恶道的轮回，是因为意根的无明造成的。意根的无明没有破除，就有十二因缘的生死链条，众生就被意根的无明捆绑在六道里，不能出离，被捆绑在三恶道里，也不能出离。无始劫以前，意根因为无明，不知本我和真我，不知法界实相，不知守本真心，起心向外贪求，遂有五阴身虚受生死轮回苦。意根因为无明，内心妄动，于是如来藏随顺意根，就出生了宇宙器世间，出生了众生的五阴身，三界世间法就出现了。众生在三界里生死轮回了无量劫，至今没有结束，就是因为意根的无明，因为意根的结缚。修行就是要断除意根的种种结缚、种种无明，才能不被无明所绑缚，脱离种种生死的系缚，获得解脱。</p><p>那么断我见一定要断除意根的我见，之后才能淡薄意根自己的贪嗔痴烦恼，再之后，才能断除意根的贪嗔痴烦恼，最后才能断除意根的我执。如果初果没有断除意根的我见，就没有二果的薄贪嗔痴，没有三果的贪欲和嗔恚的断除，更没有四果的贪嗔痴慢烦恼断尽，没有我执断尽之说。由此看来，意根的我见是在初果时就断除了，四果时才能断除我执，这个修行思路我们都应该明确下来。</p><p>八、断我见是断知见上的烦恼惑，也就是见惑。见惑，既有意识的知见上的迷惑，最主要的还是意根无始劫以来知见上的迷惑。见惑是见道时所断的知见上的烦恼，也就是断除不正确的知见，主要包括六七识的错误知见和观点；思惑是修道时所断的思想观念上的烦恼，也就是贪嗔痴慢等等烦恼惑。</p><p>见惑在证初果时断，思惑是在三果和四果时断，也就是说在证得初禅以后才能开始断。断除贪爱和嗔恚是三果人，断除一念无明愚痴我执是四果人。那么意根的我见，也是见惑，属于知见上的烦恼惑，应该在初次见道时断；意根的思惑烦恼应该在二果时降伏，在三果时开始断除，断尽是四果人，相当于八地菩萨。</p><p>初果断我见，一定包括意根的我见，如果不包括意根的我见，证初果是非常容易的事。而事实并不容易，很多人学一辈子阿含经，也不能证得初果。其实很多人的意识也都明白一切法都是虚妄的，如梦幻泡影，可就是不能断我见，不能成为初果人。</p><p>意识心的我见容易断除，因为慧强，闻法即能思惟观行，容易破除我见和无明；意根就比较困难，因为意根的我见和无明根深蒂固，意根的智慧又弱，不能很快理解所接触的法义，必须依靠意识的思惟力，需要意识提供一些资料和数据，供祂参考，意根才能思量确认无我之理，从而断除我见。</p><p>九、明白五阴无我不是断我见</p><p>我们有些人心里都明白自己是虚妄的，一个假壳子而已，这算不算断我见呢？明白无我，明白自己是虚妄的，这里有意识心的明白和意根的明白。意识的明白，还分为真明白和假明白，没有真正观行思惟的明白，就不是真正的明白。而且只有意识心的明白还很肤浅，往往不起多大作用，内心深处的意根并不明白，还是在认五阴为我，因此就不能解决实际问题，更不能得解脱，出轮回。因为意根能主宰和决定五阴一切的身口意行，包括意识心的造作，意根还有生死结缚，就会拖着五阴和六识继续生死轮回。</p><p>真正的断我见，是要意根认可和确认五阴确实是虚妄无常的，意根要明了五阴无我之理。而让意根认可确认，必须是意识心进行深细全面的观行，通过观行，把思惟的过程和结果传递给意根，意根才能理解，因此才能通过自己亲自思量确认五阴自我的虚妄性。意识要思惟观行五阴当中的每一阴都是虚妄的，十八界当中的每一界都是虚妄的，思惟透彻，尤其是意识心的虚妄更要思惟彻底，意根才能认可和确认五阴确实是非我的，一切皆是虚妄，从而内心深处的思想，会有相当程度的转变，这样才是断我见了。</p><p>十、单凭意识之力不足以断我见</p><p>有人问文殊师利菩萨：明知生是无生之理，为什么还被生之所缚？文殊菩萨回答：其力未充。</p><p>明知是哪个识？其力未充是哪个识？明知的是意识，意识虽然知道一些道理，但是没有用，还是要被生死所系缚，因为意识不能作主说了算。其力未充的是意根，意识的思想观念还没有达到意根，意根不认可，就无力改变现状。关键是意根是否能认知此真理，是否断惑和断执，只有意根断惑断执，才能出离生死牢笼。</p><p>从这里我们知道，有些佛法道理，比如断我见之理，明心见性之理，仅仅是意识表面的知道了，也不能解决生死问题。必须深入到意根，让意根明理，才能改变自己，解决生死问题。因为一切事情都是意根作主，是意根说了算。意根是有力量的，意识没有多大力量，不能当家作主的缘故。我们要想改变五阴一家的生死轮回问题，必须说服一家之主，仅仅说服一个家庭成员还不行。意根就是一家之主，五阴世间的事都由意根说了算。当意根力量充足的时候，先断我见，再断我执，后世就能不被生死束缚了。</p><p>十一、我，指意根第七识，是意根把五阴当中的色阴当作我，把受阴当作我，把想阴当作我，把行阴当作我，把六识的识阴当作我，也把自己当作我，因此才有我见。六识是依他起性，辗转而生，是被意根第七识所利用的一个工具。意根无始劫以来一直把五阴当中的每个部分都当作我，当然也把第八识的功能作用当作我。</p><p>意识的我性微弱，远远不如意根的我性强大，比较容易断。一般来说，意识通过熏习一下五阴无我之理，稍微作以思惟，就能明理；而意根的思惟观察力弱，再加上无始劫以来的无明深厚，严重遮障其智慧，不容易明理，意根的我见就非常难断。</p><p>从古至今，真正断我见者少之又少，如凤毛麟角，即使是佛陀在世时，其证果人数的比例也不是很大。因此说我见主要指意根的我见，断我见一定要意根亲自与意识一起参究无我之理，能现量观察到五阴确实是无我的，这才是真正断了我见。</p><p>如果仅仅是依靠意识像复读机一样，以读诵背诵文章的形式读诵文字，不在定中深细思惟观行，意根永远不能受熏不能明理，这仅仅是意识在文字表面上肤浅的作为，最多能解悟五阴无我，不能实证五阴无我，因此不能断我见。</p><p>断我见是意根的亲自证得，那么明心证悟是否也是意根亲自证得真心第八识？答案也是如此。因为无始劫以来意根一直把五阴六识的功能作用当作我，也把第八识的功能作用当作我，不知道祂自己什么也不是，一头依赖第八识，一头依赖五阴六识，这样才能有祂自己的所谓的我的功能作用，才能在三界里生存，成就祂的虚妄的我的功能作用。</p><p>那么要让意根断除无明，成就佛道，一方面要砍倒五阴大树，让祂没有依赖；另一方面要让祂证得真实的第八识，知道一切法都是第八识所为，不是自己的功能作用。这样意根就认清了法界实相，无明一点点的破除掉，我执和法执渐渐断尽，彻底无我，最后就成为了佛世尊。</p><p>十二、意根如果没有断我执，就不愿意也不能消失灭亡，阿罗汉就不能入无余涅槃。指挥身体活动的是意根的功能，意识如果想指挥身体，需要意根同意，再由意根下命令，六识才能动，六识一动，身体才能动。六识不出生，不活动，身体就不能动。</p><p>意根由于把身体当作自己，无始劫来就一直抓取不放，如果身体不由自己来控制和掌握，意根就觉得失去了自我，因此感到莫名的恐惧。所以断我见，一定要意根来断我见，意根断我见才是真正的断我见，当然彻底究竟断我见的人是佛世尊，四果俱解脱的大阿罗汉也没有彻底究竟断我见。</p><p>十三、断我见时，意识必须思惟分析透彻，一个漏洞都不要有，让意根完完全全认可，没有疑惑，才能断我见。观行断我见，意识要想方设法思惟、观行五蕴十八界的虚妄不真实性，把意根熏染成功，让意根从内心里确认五蕴确实不是我。这时意根的底气才足，任何人说五蕴是真实的，意根都不随着那样想，不加以认同。要做到这点，需要意识自己首先要明理，要思惟清楚，还要给意根一段适应和确认的时间，让意根适应五蕴确实不是我，不是真实的。</p><p>在刚刚接触这个理论，刚刚开始思惟时，有的人心里确实感到害怕，感到六神无主，感觉没有了依靠，感到内心空虚和恐惧，这是因为意根无始劫以来一直牢牢的认为五蕴就是我，就是真实的，现在意识告诉祂不是这样，意根无论如何也难承受，所以心里会害怕和难受。只有通过意识的不断熏染，时间长了，意根接受了以后，这种感受就慢慢消失了。想要意根心理准备充足，就需要意识反反复复不断的熏染，不断的强化无我的思想观念，终有一天，就能真正而彻底的断我见。</p><p>如果只是意识知道五阴身及一切法是虚妄的，可意根还不知道，不认可，那就没有什么用处，只是一种浮浅的理解，不是真正的断我见。初果至四果之间，意根要不断的认可五蕴生灭无常虚妄无我，完全认可时，意根就断尽对五蕴世间的执著性，就有能力出离生死轮回。意根完全断尽执著，证得四果时，就像看球幕电影时一样，无论球幕上发生什么事情，出现什么境界，内心都若无其事，不躲不迎。意根不再指挥身体躲避什么，内心知道境界都是不真实的，都在屏幕上，不是现实的，也就不再害怕了。</p><p>从这里可以看出，众生的心理，有表面浮浅的作用，也有暗藏隐藏的作用；而起决定作用的，还是那股隐藏着的力量，那是根深蒂固、难于转化、难以说服的，那就是意根的惯性力量。改变这股惯性力量，就显得极其重要，就能解决无量劫来的生死大问题，包括分段生死和变易生死，那也就能断除无始劫以来的无明惑业苦，登上涅槃的彼岸。</p><p>十四、观行五蕴断我见，只在意识心上认为五蕴非我还不行，还需要意根认可才行。要想让意根认可，必须拿出充分的理由和证据来说服祂，不是说意识认为无我，就已经是无我了，意根还不清楚，还认为是我，生死轮回的根源就没有根除，必须断除这个根源，才是真正的断我见。</p><p>而意识在接触佛法之后，知道了无我之理，意根还不能很快就随着也认为无我，因为意根的了别慧比较弱，没有比量和非量的了别，只能承认现实和事实，所以意识必须找出充分的证据来说服引导意根。意根的攀缘范围非常广泛，根本没有定力，因此慧力劣弱，理解和认识问题的能力非常差，意识必须要把各种道理都分析思惟透彻了，道理明明白白的摆在那里，意根才能容易理解。意识要把祂当作是一个幼稚而顽固的孩子，要耐心细致的对祂讲事实摆道理，摆出各种证据，千方百计说服祂，祂才能被说服，从而明了真理，改变自己的知见，那就真正彻底的断除我见了。</p><p>要如何说服意根呢？这就要求意识非常细心的思惟：五蕴究竟是如何虚妄的，究竟是如何生灭的，究竟是如何无常的，究竟是如何变异的。究竟两个字里面就包涵了摆事实讲道理，要拿事实说话，意根只承认事实。要想拿出事实，意识必须深入细致的思惟，一个道理一个道理分析得清楚又明白，意根就能懂得这个道理。意识在思惟分析的整个过程，就是在说服意根的过程。因为意识思惟的整个过程的细节全都传递给了意根，祂都要了解，意识的每个思绪，思惟的任何一个法义，所有的心念都能熏染意根，因此思惟的内容意根都能了知到，所以意识思惟的过程就是说服意根的过程，也是熏习祂的过程。</p><p>十五、意根断我见成为初果之后，为什么到四果时才断除我执？</p><p>意根断我见的智慧深度程度，分为不同层次。就像学会做饭，成为厨师，还需要不断的实际操作，以熟练掌握做法技巧，然后就成为一级厨师、二级厨师，以及特级厨师。意根断我见也就如学生刚刚进入校门，学习几年之后才能毕业。当然不排除优秀者成为跳级生，就是学佛人中特殊善根者证果之时也许是二果三果四果不等。</p><p>意识意根对五阴无我之理认识的程度不同，见地不同，所证果位就不同。证得初果之后，需要再不断深入的观行五阴十八界的苦空无常无我性，认识不断的加深，观念扭转的越来越彻底，无我的智慧越来越深，我执就会越来越轻微，最后对小乘无我之理达到极致，我执就断尽，于是出生各种智慧，有能力超出三界，解脱生死，入无余涅槃。智慧证到什么程度，就断除什么程度的烦恼，我执就减轻到什么程度，就取得什么程度的果位。</p><p>比如世尊在夜半睹明星而顿悟时，是断除最后一分无明，获得最大最究竟的智慧，于是就顿时成佛，无须再等什么，也无须再修什么，因为无明已经断尽，没有什么法可修的。</p><p>而初果人，我见就没有断彻底，一念无明还深重，意根无我的智慧层次还浅。再接续观察修行时，对五阴无我的认知越来越深刻，智慧越来越深透，无明越来越轻微。这都是一步步修行的结果，智慧到底，就不用再修行，无明烦恼同时也就断彻底，四果无学的果位同时就获得了。</p><p>十六、了解五阴苦空无常无我的道理并不是很难，就是观念根深蒂固，很难转变，理解一些佛法并不是很难，难在观念的转变，难在对这些法的真正认知。都知道色身无常，不可能是我，可是没有用，就是不能断身见。这是因为意根的古老观念太深重了，始终转不过这个弯来，解不开这个结，所以需要不断的熏习再熏习，以改变祂的不正的思想观念。</p><p>怎样改变认为五阴就是我的思想观念呢？把色身生灭变异无常的现象观察透彻，清清楚楚了知这件事，然后把这件事凝聚成一个点，深深的置于心中，交给意根，这样行走坐卧心里都挂着这件事，打坐静坐也要挂着这件事，高高的深深的挂着。如果观察不全面不透彻，就再观察思惟。有朝一日，钝根的意根就能开窍，突然间就明白了：色身确实不是我，于是断身见。</p><p>十七、用自我暗示法观行佛法时，意识常常要暗示意根，五蕴虚妄，一切法虚妄，都是如来藏的功能作用，到一定时候，意根就会认可，就能断我见，从而发挥自己的潜能，改变自己。这种暗示，类似于自我催眠，把自己调整到比较安静和沉静的状态，能听到内心声音的状态，这时就可以自我暗示了。</p><p>把以上断我见的内容，慢慢的抑扬顿挫的陈述出来，引导意根接受，并且给意根一定的缓冲时间，让意根接受信息，整理思路，思惟信息里的法义。这需要一定的时间，和特定的环境场景，就是让意根不关注其他问题，只注重被引导的内容，内心要沉静和安稳、祥和，能够充分的接受意识的引导。如果意识能引导到哪里，意根就能思惟到哪里，这时意根是比较听话的，已经初步被熏染了，只是没有最后成功。关键在于意识是否会观察意根的反应，是否有引导的经验，是否真懂无我之理了。这样的引导催眠可以在合适的时间场景中反复多次进行，只要意识理论娴熟，会观察意根，会引导意根，能保持沉稳和沉静状态，到一定时日，必能断我见。</p><p>十八、有些初学佛的人，在思惟断我见时，心里有些害怕和恐惧，实际上是意根怕。因为意根无始劫以来一直认为五阴是我，一直在执取五阴，当有一天接触到四圣谛理，告诉祂五阴不是我而是空的，意根一开始肯定受不了，不愿意接受这个事实真相，所以就感到害怕，于是不想让意识再继续思惟观行，希望能保持现状，可以继续执著抓取五阴身。当意根渐渐能接受无我时，也就不害怕，就会让意识继续观行五阴无我，同时不断的受熏，到一定时候，就会证得五阴无我了。</p><p>十九、我们是真的观察不出无常、不知道无常吗？意识很容易了知无常，也容易了知苦，了知空也不难，意识心也常常说无我。那为什么还不能断我见证果呢？很多认为一切法无常无我的人，即使别人承认他断我见证果了，他自己内心都不敢承认，为什么不敢承认？还是因为心虚，心里感觉自己的观点看法不踏实，没有实证，内心深处没有认可此理，他们自己也知道这点，所以不敢肯定自己，平时只是说说玩而已。</p><p>根本没有多少人意识心认为自己的五阴是恒常不变的，那为什么还不能断我见？因为无常的想法和看法，还没有深入到意根，意根并不知道五阴无常、一切法都无常，那就不能断我见，即使别人说他断我见，他自己也心虚不敢承认，没有证据，没有理由之故。</p><p>而有一些人差只差在意根认定上，法义已经了然于意识心中，这不太难，难在意根认定上。由于缺少禅定，意根没有深思，所有的思想观念都浮于意识表面，没有深入意根，意根无法认定，心中对无我之义没底。这是断我见的瓶颈，应该想办法突破。</p><p>定力不足的原因，一是没时间修定，二是福德不足，三是戒律不完备，还有一些其他小原因，自己找出来，一一都克服，则断我见就会大功告成，还有更大的功德需要去完成。</p><p>二十、初果断我见以后，再深入熏修观行五阴十八界的虚妄，慢慢开始断我执，我执比我见更难断，以至于初果人要七次天上，七次人间的来来回回修行，才能最终成为四果阿罗汉。我们算一算，七次天上和七次人间，加一起是多少时间，算出来以后，我们就知道了断我执是多么的不容易，比断我见困难多了。</p><p>什么叫作我执？就是意根对五阴我的执著不舍，为什么还要执著？对于五阴我的我见没有断彻底，还在某些方面某种程度上把五阴的某些功能作用当作是自己，而执著不舍。无始劫以来执我的习气太深，无明太重，对三界的贪爱太难以拔除，才需要那么久的时间断除我执烦恼。如果意根一次性的把五阴的我见断彻底，其我执就同时断尽，那就是四果的大阿罗汉了。而真正把意根我的执著断尽的人，就直接成佛了，不仅仅是四果俱解脱的大阿罗汉。所以阿罗汉辟支佛的我执都没有彻底究竟的断尽，因此还不能成佛。</p><p>第八识为什么不需要断我见？因为祂没有我见，就不需要断我见，有我见者，才需要断我见。</p><p>二十一、感觉这神通多么容易修得，意识的感觉理解是不是证得了？如果是证得，神通立时就出现，如果神通没有出现，就没有证得神通，那意识的理解就无济于事，使不上力，不能得一丝毫解脱的功德受用。断我见和明心也是如此，意识的理解没有一丝毫功德受用，不是真正的断我见。无论意识如何认为五阴无我，都不是证得无我，不是断我见。因此书读百遍，其义自现，没有用，仍然是意识的解，不是意根的证。此理重要极其重要，望诸位入心细思，莫再以情思意解为尊为大为贵，自误再去误人。</p><p>二十二、隔阴之谜的意思是说，意识是新出生的，与前世的意识不同，因为隔了一个五阴身，因此就迷了，不知道前世五阴之事。而意根生生世世不断，没有隔阴，因此也不迷，能知道前世之人事物理，有时也能知道后世之人事物理。但是众生一般所知都是依靠六识而知，意根所知的必须让六识也知才能有作用。</p><p>意根不与语言文字相应，因此无法表达自己的所知所见，意识与语言文字相应，能思惟分析推理判断，因此意根的很多作为必须依靠意识六识来实现。意根无论知道什么，意识都不一定能知道，意根即使了解了极乐世界，了解了自己前世所有的事情，意识也不一定知道。</p><p>所以遇到重大的事情，意根不得不用各种方式警觉意识，让意识有所了知，以便思惟处理解决。比如鬼神在身体周围，意识不知，而意根知，意根就能促使身根头皮发麻，浑身不自在。于是意识就觉得可能是有什么事了，意识有可能猜测出来是什么事情。</p><p>当今世第一次或者是最初遇见佛菩萨的形象时，由于意根生生世世信佛念佛学佛，与佛菩萨有着特殊的感情，这叫作善根深厚，于是就情不自禁的流泪，甚至痛哭流涕，意识却不明白为什么如此。遇见前世的亲人也是如此，意识都不认识，可是意根认识，于是就觉得很亲近和激动，意识却不知道为什么如此激动，为什么有特殊的感情。</p><p>所以意根今世断了我见，来世表现就与平常人不同，可是意识是新的，有隔阴之谜，不知道前世已经断了我见，不知道五阴是无我的，于是遇见佛法还得思惟五阴无我之理。但是因为意根已经证得了无我，已经被熏了，知道五阴是无我的，就不用意识过于思惟观行，不用再熏修很长时间，很快就证得五阴无我了，比第一次证果的人快速很多。那些三果四果的人，甚至只听一句话就证果了，用不着特意思惟观行，因为不用意识仔细思惟以熏染意根，省了这个特别麻烦的过程，证果就特别快速了。</p><p>二十三、现代社会信息发达，得经书容易，意识理解力强，别人一讲五阴生灭无常无我，百分之五十的人意识就能理解五阴无我，知道色身不是真实的，是幻化的假壳子。甚至有些不学佛的人，口里也经常说色身是假壳子臭皮囊是生灭的无常的，可是说归说，哪个也没有断身见断我见，个个还是很严重的执我。</p><p>如果意识认为五阴无我就是断我见，那么证果也就太容易了，学佛之人一半以上都能断除三缚结，免除三恶道之苦，成为圣贤之人，那么佛教有什么可担忧的，众生也没有什么可担忧的，释迦佛大可放心娑婆世界，不用牵挂佛教会灭亡，可事实不是这样。</p><p>那些仅仅是意识理解了无我，就认为自己断我见了，然后又认为自己烦恼轻微，已经修到二果的人，临命终时就很麻烦，后世就会很苦恼。最好是今世在剩余时间里，想想如何补救，采取一些有效可行的措施，再仔细观行五蕴以真正断我见，消除妄语大业。</p><p>现在佛教界已经说不好到底有多少二果人，好像是圣贤辈出的时代了，实际怎么样呢？乱得很。如果三果没有初禅定卡着，没有断除欲心这个标志，指不定会有多少人说自己证得了三果。现在就有人在宣传，证得三四果不需要初禅定，初地菩萨二地菩萨以前不用修初禅定。这样的宣传预示着什么，可想而知了，再往后，凡夫与圣人就没有界限了，只要理解了一些佛法，就是圣人，这些所谓的圣人其实都是知解宗徒。</p><p>二十四、五取蕴的取是谁取</p><p>五取蕴一定是意根取。因为意根生生世世存在不灭，又是作主识，无始劫以来一直把自己当作万法的主人，所以祂一定要取着万法，执取一切法，一切法才能存在不灭；如果意根不执取了，万法一定不现前，自我一定要消失。因为意根取色蕴、取受蕴、取想蕴、取行蕴、取识蕴，所以五蕴才生了灭，灭了又生，生生不已，永远不断绝，不消失。为什么如此呢？因为如来藏永远随顺配合意根，了知意根的心行和愿望，意根执取，如来藏就会变现，五蕴就不会消失灭去。当然其中还要有业种和业缘，如果意根不执取了，业种就消灭，业缘就不现起，万法就不出现，五蕴就消失。</p><p>意根执取色蕴，执相抓取贪着色身，所以喜欢锦衣玉食的生活，吃穿住用处处贪着享受，对色身百般保养和照顾；意根取着受蕴，贪着感受，执着受觉，比如喝茶时，觉得茶好喝，伸手去拿杯子倒茶，一杯又一杯的，慢慢品尝其滋味，直到心满意足。是谁指使识心这样贪着茶味和感受的？是意根指使主导的。意根执着茶的韵味，执着受觉，才不惜浪费宝贵的时间品茶，甚至有的人还贪着酒味，过酒瘾，不在乎伤害身体。</p><p>再比如打坐身心觉得舒服时，身体就不想动了，心也懒了，不爱考虑问题，这是因为意根不想动，贪着舒服的觉受，就不让身体起来活动；因为入定舒服，意根执取打坐的觉受，就不想动，不想出定。意根不知不觉执取、贪执着很多感受，自己却不知道，因为意根很难反观自己对这些觉受的贪着，只能由意识通过学法觉悟以后，不断的暗示和牵制意根，才能降伏意根，使其不再贪执觉受，不被觉受所系缚，才能得解脱。</p><p>意根执取想蕴，天下大事小事无一不想知道，国内外新闻全部关注，他人的事情无论与自己有关还是无关，全部都感兴趣，不管该不该知道的，全部想知道；两耳尽闻天下事，两眼尽观天下景，心里装满过去未来现在。因为意根执取想蕴，每天都要看电视看报纸，收集各种消息资料，这些都是意根取着想蕴而指使六识造作的。</p><p>意根取着行蕴，一天下来造作不停，不肯闲歇一会儿，不肯静静的安住片刻。东边有事东边到，西边有事西边去，哪里有事哪里现身形，身口意行从不停歇。意根如此取着行蕴，如何有定？</p><p>意根取着识蕴，眼观六路耳听八方，内心思绪翻滚，觉观不断，过去未来浮想联翩，不肯把心静下来闲下来。因为意根执取六识的识性，不肯让六识止息，见闻觉知就不断。若意根清净，不想无益造作，六识就能寂静下来。</p><p>既然意根有这么多的执取性，尘劳烦恼才根深蒂固，无始劫来陷于生死火宅中不得出离，因此我们一定要消灭意根的执取心。要消灭意根的执取心首先就要断除意根的我见，让意根明了五蕴无我，这样才能证得五蕴无我，才能逐渐断尽执取心，得以解脱尘劳烦恼。</p><p>二十五、意根把五蕴六识当作我的证据</p><p>如果意根不执五蕴六识为我，我们何来的我见和断我见？那就不需要断我见，也不需要断我执，也不需要断烦恼无明。这样众生都是无我的，就不用修小乘法，多轻松愉快。可是事实上每个众生都有严重的我见和我执，断除相当的困难。</p><p>如果意根不执六识为我，在昏迷的状态里，意根总是想办法醒过来，为什么？因为意根要用六识了别六尘境界，意根需要了知六尘，六识就是自己，自己不知道六尘就不行。被人捆绑，意根为什么总是想挣脱绑缚？被蒙上眼睛，意根为什么总是想办法除去眼布？因为意根把色身和五根当作自己，自己被束缚是绝对不可以的。被禁言不让说话意根为什么心里就不高兴？因为意根把能觉观能说话的意识当作自己，自己不说话就觉得很难过。</p><p>意根有我就不高兴，无我阿谁不高兴？语言是意识的功能作用，意根把此作用当作是我的功能作用，因此被禁言不让说话，就觉得不自在。意根把五蕴意识当作我，被禁言了，就觉得没有面子。意根把眼识意识的能见性当作我，被蒙住眼睛不能见色时，就觉得不自在，祂一定要见色执色。意根把五蕴六识的功能作用当作我，把六识的行蕴当作我，被捆绑住的时候，不能活动，祂就觉得不自在，没有行蕴是不行的。意根把色身当作我，身体被打坏了，祂就不高兴，一定要报复打自己的人。意根把受蕴当作我，贪图享受，不让祂享受，祂就不高兴。意根把六识的了知性当作我，不让六识见闻觉知，不了知六尘，祂就不高兴。</p><p>久病的病人长期躺在床上，不能活动，我们想想，意根是什么滋味？植物人意识微弱，没有多少痛苦的感觉。感觉痛苦的一定是意根，总是想办法起床，总是想办法了知境界，可是总觉得无能为力。既然意根把五蕴六识当作自己，当作我，那么断我见一定要意根断，只断除意识的我见不解决生死问题，而且也无法断除意根的我执。</p><p>学佛修行不可死在句下，不可一味的背诵名言名句，甚深的理解和观行、如理思惟是最重要的。如果不能如理思惟，在某方面就有欠缺，应该想办法找出来欠缺在哪里，然后加以弥补和圆满。检查一下自己的菩提心，是否有菩萨的愿力和心行，福德是否够用。</p><p>二十六、人出生以后，在生活中逐渐形成各种常识性的认知过程，与断我见的过程是相似的。既然相似，在断我见的时候，可以参照我们形成常识的累集过程，以同样方式观行五阴无我之理，最后让五阴无我成为内心深处所认知的常识，从而断除我见，不退转于解脱之道。</p><p>人生下来，从意识一无所知的状态到知世俗界一切法，知人间的一切游戏规则，就是个形成常识认知的过程。首先意识通过接触生活中的人事物理，了知了法则，然后通过观察和实践，确认了这些法则，从而形成了意根的常识，不用意识思考，就习惯性的遵守这些法则，形成了意根牢不可破的思想观念。直到另一种新的法则打破了旧有的法则，观念就得到了更新，常识就改变，意根的习惯也改变。</p><p>最初的一无所知当然是意识，慢慢意识受日常生活熏习，接触和学习了一些日常知识，在这些知识的学习过程中，就能不断的检验和证明了一些常识，意根就懂得和亲证了，知识成为了常识，然后形成一个习惯性的认知，不用意识思惟，就自然的符合常识。</p><p>比如小孩子不知道火的概念和功用，靠大人不断的告知，多数时候是强迫性的记住，然后又观察大人用火，自己再学着使用火，就知道了火的作用和危险性。在使用过程中，才能证得和检验火的特性。没有实际观察时，只是意识的知，意根不知火的特性危险性，有时候就要玩火，玩出事时，这时候意根就亲证了知了火的特性，心惊肉跳之后，就不敢随便玩火了，身行心行就改变。</p><p>做饭也是如此，一开始不知道刀是如何用，有什么特性，不知道如何淘米下锅，反复观看学习，然后亲证实验，以后就会做饭了，就有了做饭的常识经验，不用意识思惟如何做，意根就会熟练的操作。前边是意识学习熏习，后边是意根受熏实证，实证之后，就形成习惯和常识，不用特意思惟，就能轻车熟路的做饭。</p><p>孩子从走路、说话到认知一切法，都是这个学习过程，然后形成常识，形成习惯，改变了从前自己的无知，身口意行改变。这一切的学习过程，形成常识的过程，意识与意根都要经历，都要改变无知状态。如果意根从前世以来，一直都知的常识，则不用意识再学习，自然而然就会，比如生下来就会吃奶、就会哭、就知道疼痛、就知道饱暖等等。</p><p>从这些世俗法的熏习过程中，我们可以借鉴来熏习五阴无我之理，形成无我的认知，让无我成为常识，那么我执的习气就会慢慢的断尽，就能得解脱了。</p><p>二十七、意根彻底断我见后就能很快断我执了吗？</p><p>断我见的初果离断我执的四果，期间的距离很远很远。之所以断我见之后不能断我执，是因为初果所证得的无我之理程度还浅，范围还窄，致使意根无法顿断我执。需要在初果以后再继续不断的观行五阴无我之理，观行的越来越深入，证得无我的程度越来越深，初禅定生起，断除了烦恼，我执就会越来越淡薄，执著越来越轻微，很快就能断尽我执。</p><p>如果有四禅定的配合，那么在断我见的同时就能顿断我执，因为禅定能够降伏一切烦恼，执身轻微，只差否定五阴为我这个智慧了，一旦具有五阴无我的智慧，就能断尽我执，成为四果阿罗汉，佛世的外道们就是如此。如果是彻底断我见，那就是断我执了。</p><p>二十八、见地不同导致思惑不同</p><p>凡夫如果有如佛一样的见，凡夫就是佛；凡夫的见如果四果阿罗汉一样，凡夫就是四果阿罗汉；凡夫的见如果与三果人一样，凡夫就是三果人；凡夫的见如果与二果人一样，凡夫就是二果人；凡夫的见如果与初果人一样，凡夫就是初果人；凡夫的见如果与初果向一样，凡夫就是初果向，快断我见了。这里的见都是指意根的见地，当然也包括意识的见地，意根见到就做到，意识见到做不到。</p><p>凡夫的见如果与明心的菩萨一样，凡夫就明心开悟；凡夫的见如果与初地菩萨一样，凡夫就成为初地菩萨；如果与二地菩萨的见一样，凡夫就成为二地菩萨；凡夫的见如果与等觉菩萨一样，凡夫就成为等觉菩萨。这里的见仍然是意根的见地，意根的智慧，包括意识的智慧。</p><p>见地到哪里就做到哪里，见不究竟，做就不究竟，这是指意根证得相应佛法的智慧。初果到四果之间，智慧见解完全不同，做就不同，行为造作不同，身口意行就不同。谁能认为初果人的见地与四果人的见地是相同的？谁能认为刚刚明心的菩萨的见地与等觉和佛的见地是相同的？因为见地的不同，其智慧就不同，无明不同，言行不同，身口意行不同，果位就不同。</p><p>初果人由于见地不够通透，所以还需要继续修学四圣谛，需要继续观行五蕴十八界无我性，智慧再增进，就成为二果；再继续修行，增长智慧，见地再通透一些，禅定生起，智慧增进，断除烦恼，就成为三果；再继续观行，见地再进一步通透，烦恼断尽，就成为四果阿罗汉。大乘法也是如此，都是因为见地不同，智慧有差异，烦恼无明有差异，行就有差异。</p><p>思惑，是因为知见不正导致思想上有烦恼惑，如果知见完全正了，如佛一样的正，那就没有任何思惑，没有任何烦恼习气和无明，也就不用再修了。所以思惑不断，是见不通透的结果。同一个果位之间，其见地不同，其行就不同，思惑就不同，修行到下一个果位的时间也不同。如果见地都相同，就没有争论和争议了。</p><p>初地菩萨要证得百法明门，二地菩萨要证得千法名门，三地菩萨要证得万法明门。菩萨每证得一个法，就破除一个无明，颠覆一个邪见，获得一种见地，增长一分智慧，思惑烦恼或者习气就少一分，其行就会清净一分。直到证得所有的法，破除一切无明见惑，获得佛那样的智慧见地，思惑断尽无余，佛道修完。小乘法也是同理，对于五阴无我之理，证得什么程度，就破除什么程度的无明，获得什么程度的见地，增长什么程度的智慧，破除或者是断除什么程度的思惑。</p><p>总结起来说，见地到什么程度，行就到什么程度，实证就是说到做到，虚证就是说到做不到，嘴皮子而已。因此说见地是意根的智慧，是意根证得佛法获得的解脱智慧，不仅仅是意识的智慧。</p><p>二十九、心解脱是以意根为主的解脱，意识意根都不受贪爱和嗔恚的烦恼系缚；意根如果不解脱，六识都不能解脱，由于意根的烦恼必然促使六识造作烦恼业，再受业力的系缚。六识生生灭灭，不能作主，只有六识解脱没有用，还要受意根主人的牵制。烦恼主要是指意根的烦恼，是意根有束缚，六识不得不被束缚。意根从断我见开始有一分解脱，二果有二分解脱，三果有三分解脱，四果完全解脱，佛地究竟彻底解脱。</p></div>"
},{
    "title": "第四章　大乘的解悟与证悟",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　大乘的解悟与证悟</strong></p><p>一、禁止明说密意就是为了让意根证悟</p><p>佛教中需要证悟的一切法都属于秘密法。所谓的秘密法，就是说这些法需要自己亲自去参究，亲自去考证，不要希望从别人那里得到现成的答案，不要用意识心去猜测和想象。因为从别人那里得到现成的答案，以及猜测想象出来的答案，都只与意识心相应，意识可能容易了解掌握，而意根并不能了解和掌握。意根要了解掌握必须经过参究的过程，意根亲自参与意识的思惟取证，了解意识传递过来的每个细节，掌握每个证据，作以考证和思量，当证据充分时，意根才能思量清楚，才能了知究竟。意根不知就不证，意根不证，就有疑，有疑不证真，就没有解脱的功德受用。</p><p>所以佛教中不仅大乘法严格禁止明说密意，即使是小乘法中也要禁止明说过于具体的观行，避免意识知而意根不知。如果明说，意识心很快就能明了，而无法再去参究，如果不经过参究，意根就不能明了，不能证得，意根有疑而不决，那就没有解脱的功德受用。</p><p>二、大小乘中的任何一种法，不仅要意识证得，最主要是要让意根证得。因为意根掌控身心，一旦证得真理，就能随顺于真理，放松身心，从而使身心有解脱的功德受用，意识的解悟没有解脱功德受用，身心不由意识作主，况且意识也不能去至未来世，也不能在任何时候都能存在起用。而意根证悟时，身心世界肯定要发生动转，会有相应的行为表现，会有明显的变化，他人从外表上就能看出此人精神状态改变了，轻松自在，意气风发。过去的禅师们有道眼，看见一直在辛苦参究的弟子走过来要向自己表明参禅的结果，不用弟子开口，禅师就知道此人得道了，因为看见弟子整个人的精神风貌气质都改变了。</p><p>由此可见，意根对于证法的关键性重要性不容忽视。修行人万万不能满足于意识的粗略而浅薄的了知，而抛弃意根深切的体证于不顾，自失佛法的大利和真实利益。</p><p>三、大乘菩萨不退转位，正是意根证得了如来藏，并且坚信不疑，从此以后再也不退转于无上菩提，成为位不退的菩萨，不是仅仅意识发现了如来藏。如果仅仅是意识发现了如来藏，意根没有证得，意根一定有疑，意根有疑不证一定不会坚定不移的信受如来藏，早晚都得退转于无上菩提大道。因为走什么路毕竟是由意根作主决定的，不解决意根的疑惑，不断除意根的无明，见惑不断，意根必造作出无明惑业，甚至谤法傍僧都有可能。</p><p>四、意识单独的知就是解悟</p><p>开悟证得如来藏，意识必然证，但是只有意识证，不算真证，必须意根也同时证，只有意识证，就是解悟。如果只有意识证，那么听别人告诉自己哪个是如来藏，在哪里，起何作用，也就证悟了。这样算证悟，我们就可以告知所有众生如来藏是哪个，起何种作用，那就不用众生修学大乘法，不用参禅，所有众生直接开悟成为菩萨。然后各各关口各个层次的密意也直接告诉众生，所有众生也就直接证得了，这样成佛有多快。世尊为什么不采取这个办法，而且还要禁止明说密义呢？</p><p>一切法都是意识先解先证，然后意根才能解才能证。因为意根智慧不足，必须依靠意识的思惟能力。很多法，意识都知道，可是意根并不知道，意根不容易理解和证得。</p><p>现代人的意识太聪明，很容易就明白什么理，而意根贪嗔痴烦恼遮障太严重，形成了强烈的反差，如果满足于意识的解，就会出问题，佛教也许由此而快速灭亡。六祖坛经出来之前，学佛人都实修，都修定参禅，从来不玩口头禅。坛经出来以后，方向就转变了，大众聚在一起都是口头禅，因为读了坛经里那些东西，就都觉得懂了禅法，无须再辛苦参禅了，没什么可修的了，于是就在一起侃侃而谈，没有实际修为。如今的人更是如此。</p><p>五、理解与现观的差别</p><p>解悟与证悟之间差别很大。证悟是真实的证得了，能够亲自现前观察自心真如，观察到的都是事实，是现量。解悟只是理解了道理，觉得如来藏就是那样的，并没有亲自证得，因此没法现前观察真如，如果不能如实地现前观行，就没办法真正地转依于真如理体。</p><p>为了能更好地理解二者之间的差别何在，用比喻来说明。解悟就比如是在研究苹果的一些知识理论，理论可以研究得相当好，也可能相当详尽，包括苹果的产地、品种、运输、存储、外观形态、色彩光泽等等，可是毕竟没有亲自吃到口里，因此就不知道真实的苹果味道如何，不知道有多甜润适口，身心也就没有得到真实的受用。证悟是已经亲自吃到了苹果，真实的知道了苹果的甜美味道，对于苹果的感受是真实不虚的，身心已经得到利益了。</p><p>但是有可能这个吃到苹果的人还不能很好地表达苹果的味道，更不知道苹果的产地等等各种信息。而解悟的人，关于苹果的所有理论可能都知道了，就是一口苹果也没有品尝到，那么他的所有理论仅仅就是理论罢了，于自身心没有得到实益。就像释迦世尊的最笨的弟子证了四果罗汉之后，却不会讲解脱道的法义，但是他已经得到真实的解脱了，能真正的了生死，出离生死轮回，未来不再有一丝的苦受。而现在的凡夫们，理论却很强盛，不但能夸夸其谈，著作等身，语言表达得就像圣人似的，可是内心里一丝解脱的影子都没有，说话时像个圣人，做事时就是十足的凡夫，内心里的贪嗔痴一样没有得到降伏，慢心炽盛，旁人根本不敢招惹他。</p><p>理解和现观是两个层次，之间的距离也许是非常大的，就像很多人对于苹果的概念、内涵、产地、品种都清楚了，还能写出关于苹果的论文，可就是没有吃到口里，因此具体的真实的味道并不知道。而有人已经吃到苹果了，可关于苹果的很多信息暂时还不知道，却能够亲自地享用苹果，真实地品尝到了苹果的香甜美味，解悟和证悟的差别，也如是。</p><p>佛世时周利盘陀伽是四果罗汉，却不会开示解脱道法义，而现在的凡夫论文书籍无数，可是连初果的影子都没有。现在研究佛法理论的人非常多，还能讲出一大套一大套的道理，可是毕竟没有证得，只在门外打转，就像隔靴搔痒一样，也就像研究苹果的人一样，只有吃到苹果的人才能准确地说出苹果的味道。解脱就是实证境界，不是理解所能够解决的，有实证的人，才能有真实的受益，不管他能不能讲得出来，解脱不在口上，而是在内心。</p><p>理解和现观出来的差别极大，别人看不出来。理解的，表达的却能很好，别人会以为智慧很深，其实不是。证悟明心的人领悟到如来藏，都是根据现观而说，而解悟就有想象的成分了。解悟，也许更糟糕，还不如暂时先不悟，等到因缘成熟了，再证悟比较好。解悟以后的路不好走，相当艰难，那是在摘生果子，摘了不熟的果子，回家再捂，也不如熟果子好吃。</p><p>六、无梦无想时的主人公在哪里，是禅宗第三关的内容，不管是否破了一关二关，这个内容都不能细讲，不能解释，否则就会落在意识心的层面上，只是理解，很难再让意根证得，那学佛参禅就没有什么意义了。过了一关二关之后，修定修出初禅，证得阳炎观以后，才能到达禅宗三关，开始参究第三关，这时更不能求别人解说，过了这关就成为三果人。凡是需要参究的，都是需要意根自己亲自参究，自己亲自证得，听别人说出来，就无法证得了，佛道也无法再修行下去了。</p><p>自己参出第三关内容，再懂得一些唯识的理论知识，就能入初地。但是初禅这关，恐怕会难倒所有人，以前我还抱希望能有人修出初禅，断除烦恼，破除无明遮障，就可以有一定的资格入初地成为真佛子，现在看来是没有什么希望了。如今世间人修定是这样难，因为五欲六尘太吸引人了，其实是人太着五欲六尘了，境界无心粘人，而人有心趣境，谁也不肯息心远离五欲，有什么办法。</p><p>第一关拖死尸的是谁，这个结论如果公开出来，你们知道了是谁拖死尸的也没有什么用，仍然不知道究竟是如何拖死尸的，那就不能证悟。自己不亲自参究，意根不相应，知道所有答案，知道最详细的答案，知道佛的境界，也没有什么用。如果有用，我们都读佛经，把佛地境界都研究出来，我们大家都共同快速成佛，是否好极了？事实上，我们所知并不是所证，知易证难。知道一切法都是梦幻泡影，就已经证得一切法都是梦幻泡影了吗？知道佛地的境界就是佛了吗？都不是。一个凡夫懂得和讲出四果阿罗汉修行的境界，难道就有四果阿罗汉的修为了？一个凡夫能讲出如何成就佛道，就已经成佛了吗？都不是。</p><p>总结起来说，很多法意识轻易知道懂得和理解都没有用，还要依靠意根亲自证得，证得了才能有智慧解脱和成佛，不证得，说的天花乱坠，一点用也没有，不能得解脱。</p><p>七、亲证的重要性</p><p>很多人在没开悟之前，各种想象真如佛性，但是开悟亲证以后就会发现，原来真如佛性是这样的，从前都是错会了。从别处听来的学来的，再加上自己意识的思惟加工，与真实境界的差距可不算小。恰好想象对的，无始劫以来有几人？我认为一个人也不能有。所以还是意根亲自证明的最靠谱，要想亲自证明，就要亲自思量考量，不能把意识思惟的结果直接接受下来，当成自己的现量结论。这点对于学佛修行，是非常重要的。</p><p>八、意根亲证的层次</p><p>意根在亲证大乘法如来藏时，其亲证的程度有很大差别，智慧的层次差别就很大。在七住位，意识和意根只证得了如来藏极少极少部分功能作用，意识只能很粗浅的观察到如来藏的运作，了知一些如来藏简单的性质，其智慧层次很浅。随着修行的不断增进，对如来藏的功能体性不断的进行观察，证得如来藏的功能性越来越多，智慧越来越深，心依止于如来藏的无为无我性，烦恼性障越来越轻微。</p><p>一直到证得如梦观，进入初地二地等等各种智慧境界中，观察到如来藏中所含藏的种子部分，意根对如来藏的亲证程度就很深了，智慧也很深广，但还不是最深最广最细。再继续观行观察如来藏的种子功能作用，亲证的法就会越来越深细，如来藏的种子功能作用全部观察到，全部亲证，了知无余，其智慧也就圆满具足了，一切种子的智慧完全具足，无明断尽，生死了毕，彻底得解脱，佛道的修行也就结束了。以后所作一切事业，全部是为了度化众生，为了众生得解脱。</p><p>九、一念相应慧，是指意根的慧，不是完全指意识的慧。所以禅宗讲顿悟，就是意根突然明白证悟了。意识是通过思惟分析推理慢慢明白的，二者有区别。意识明白很平淡无奇，意根明白就如茅塞顿开一样，祂突然间发现了新大陆，很新奇，很惊讶，透入骨髓似的，所以才出现身心的反应。当然意根的明白和证悟也分层次性的，有实质性的，也有非实质性的。意根顿悟或者明白某个道理时深有感触，但不一定是最终的证得。</p><p>身体无常生灭苦空非我的道理谁都知道，可是断身见证果却是极难。就是因为意根无始劫以来的习惯认知，认为身体就是我，这个观念根深蒂固，没有现量观行，就不能颠覆固有的观念，不能认可身体无我，意根无法接受。这就需要意根依据意识的思惟，起自己的思量，亲自去证，证据充分了，祂才不得不确认此理。</p><p>一念相应慧，表面上是意识找到了第八识，证得了第八识，生起智慧，实际上真正的智慧一定有意根的智慧，意根应该一直在与意识一起参禅，意根不参与参禅，就不是真修行，假修行不能证悟，不能有一念相应慧。智慧是在相应的因缘条件下，自己自动生出来的，机缘到了突然间就明白了，就证得了第八识，知道祂在何处运行，大约是如何运行的。这个知最明显的就是意识的知，意识的观察力，但是如果意根不知不证，意识就不敢肯定所找到的就是第八识，心中疑不断，意根肯定才能断疑。</p><p>意识表面的智慧里，都有意根的智慧和作用，没有一个法能离开意根的作用，只是意根在每个法的运行中，起的作用大小不同，主动和被动不同而已。意识观行断我见和明心时，当然也离不开意根的同时运作。观行时，断我见时，参禅一念慧相应时，意根在干什么，是什么心态和心行，与意识的观行是什么关系，起什么作用，这些问题都非常重要，非常关键，弄明白了，佛法的证量就了不得了。不要动不动就说，都是意识，没有意根的事。这样说话，根本没有智慧，没有观行。</p><p>意识的相应慧是如何出现的，比如一个禅师一直在参禅，没有开悟，在某个因缘条件下，歌女唱歌，歌词中的一句话，就触动了禅师的意识，其实主要是触动了禅师的意根，于是灵感现起，就从歌词中，领悟到了自己的第八识是哪个，在哪里，如何起用的。然后再整理思路，就能观察第八识的简单运作，观察与五阴身的配合，与七识的配合，这样般若智慧就显现出来了。</p><p>再比如，弟子一直在参禅，师父一直利用各种机会启发他，或打或骂，或暗示，弟子就是不能悟，这是因缘不成熟。可是有一天，师父看弟子参禅的状态，觉得差不多了，就突然给弟子一个出其不意的打骂等等之类的机锋，这时弟子开悟的因缘已经到了，心里疑情很重，智慧马上就要开启了，因为师父的某种暗示，突然间就悟入了。而平常时，师父如何启发都没有结果，只是种下了因，现在弟子因缘成熟了，稍微启发就能悟入。这里的疑情不仅有意识的疑，很深的疑一定是意根生起的疑情，只要意根生起疑情，就会非常精进专一的日夜参究，在因缘具足时才能证得第八识。</p><p>十、参禅参到最后，疑情很重的时候，意识有时候好象都不能思惟所疑的问题了，但意根一直在思量着。当一个外缘出现的时候，触动了意根，这时候应该是意识和意根同时证得了如来藏的所在。疑情很重时，正是禅定很深时，意根深深的定在所要解决的问题上而不断的思量。禅定深时，意识浮浅的思惟没有了，思惟很深细，动转很慢，这时意根的攀缘也极少，其主动思量性就启动起来了，二者密切配合。如果这时因缘具足，有一个能促使证悟的缘出现，这个缘虽然是意根先了别，但了别不清楚，需要意识清楚的了别，再把了别的信息传递给意根，意根再作了别和抉择。</p><p>因为意根此时攀缘极少，又深深的思量着所疑的问题，容易明了意识所了别和参究的问题，意识证悟，意根同时也就认可和证悟，因为意根一直在对此问题亲自思量着，才容易认可和证悟。这时，意根就拍板说：就是祂了，没错，这就是一念相应慧。当然这个拍板决定，还是首先来自于意识的认知和决定，是意识引导开路的结果。</p><p>如果意根攀缘多，不重视参禅，不积极主动参与参禅，既没有疑情，也不思量疑情，意识传递给意根的信息，意根就不能清楚了别，就不能认可作抉择，这时就是属于半信半疑的状态，或者完全不信，不相应，就不能证得第八识。所以任何一个法，意根与意识配合得密切，了别才能清晰无疑，才能现量证得，深肯不疑。过去禅宗祖师说的深肯不疑，含义即如此。确定不疑，就是意根认可了，意识不犹豫；如果意根不认可，就犹豫不决，模棱两可。汉语很多词汇包含了意根和意识的合作原理，只是世人不知。直到有一天，世人睁开智慧的双眼以后，才能清楚其中的奥秘。</p><p>十一、思惟如来藏，理解如来藏，都不是证得如来藏，而亲自发现和找到如来藏，才是证得如来藏。因为知道祂在哪里，能现前观察祂具体起什么作用，这是实际证得，不是思惟理解和想象出来的。</p><p>十二、深思的方法，充分发挥意根功用的方法是，意识把需要思惟和参究的法义，分析清楚明白，然后把问题凝聚成一个点，悬在内心里，这就交给意根了，以后的工作由意根处理，意识可以配合。</p><p>案例：我有什么问题，进入定的状态中提出问题后，直接观看问题的解决方案。问题的解决不是思考的结果，而是直接观察的结果。</p><p>案例解析：他这里的思考，指的是意识表面的思惟作用。但只要把问题交给意根，意识表面不思考，意根就有自己独特的思量性和思考力，一般人的意识观察不出来，不能了知。虽然意识没有思惟思考，到一定时候，还是能有答案。这个答案哪里来的？就是意根自己思量出来的，意根的思量作用很了不得。参禅到最后的参究，多数是意根思量的功能起作用。不管多数人承认这个事实与否，这都是事实。智者决不作这样多数人中的一员。</p><p>十三、意根既然有执著性，执著人我和法我，意根有没有我性呢？意根无始劫以来一直是有我性的，叫作俱生我执，执著人我，以五阴身为我，以六识为我，执着六识的了别为自己了别，六识的功能体性也是我和我所有的，还执着第八识的功能体性为我为我所有。祂的遍计所执性决定了祂什么都执著，其中人我执是意根的我执，是意根的我。</p><p>在修到初地菩萨以后，意根灭掉一部分无明，比如一念无明，达到无漏了，祂就一点点地思考在一切法上的无我性。比如说因为知道了一切法都是第八识所现所变的，菩萨就开始思考：这个色尘、那个色尘都是第八识输送四大种子所变出来的，而且第八识还是在刹那刹那地输送四大种子，时刻改变和维持着色法的存在，因此色法不是我。</p><p>同时意根也能知道我了别色尘的功能体性，是第八识输送识种子所生起来的，因此也不是我，都是第八识的功能。色是第八识变起来的，我的五根、六根是第八识变起来的，我对应的六尘是第八识变出来的，我能了别的六识心，乃至于自己这个识心，都是第八识所变起来的，我能接触到的、了知到的一切法，都是第八识输出种子刹那刹那变现出来的，那么一切法当中根本没有我。</p><p>菩萨就会慢慢地在一切法上思考其无我性，这样无生法忍的智慧就会越来越增广，六七识的智慧性越来越广大，意根的大智慧就知道一切法确实是无我的，心于一切法就平等了。转识成智以后，意根就有越来越深的无我智慧，心无漏的时候，智慧性越来越广大。</p><p>菩萨会继续思量，我听声音这一法，能听所听，都是第八识所变的，这一切的功能体性都是第八识的，所有的声音都是第八识在变现和执持着，哪里有个我呢？祂就这么思考了，祂的法我执一点一点断除。在闻味的时候，吃饭的时候，六根对六尘的时候，在日常生活中，在每一法上都会思量，这些法都是第八识所现起来的，这其中并没有我什么事，就连我自己也是第八识变出来的，都不是我。</p><p>那么我能够接触六尘这些功能体性，也都不是我，都是第八识所变出来的，没有一样是真实的，这样就会一点点地断除法我执，智慧越来越增广，法我执断尽的时候就成佛。</p><p>十四、学佛以后，意根明理了，对于一些人事物理，执著性逐渐有所松动，执著的范围逐渐在缩小。其执著性明显的转变，小乘是在四果罗汉的果位，大乘是初地菩萨的果位。虽然在此之前，其心就已经松动了，但是界限不分明，到佛地时就会一法也不计度执著了。</p><p>凡夫的普遍计度执著性表现在，只要是第八识所现起的法，意根都会执著为我，为我所有。把第八识的功能体性据为己有，认为是自己的功能体性；把第八识的见分、相分，都执着为我和我所有的，为我、为我所，不知道这本是第八识的功能作用，所以祂才执著，这是意根无明的体现。</p><p>第八识既然是自己独有的，为什么不能把祂当成我？因为第八识就是第八识，第七识就是第七识，其体性是有差别的，在现象上还是两个识心，两个法。第七识并不具备第八识的功能作用，如果第七识对第八识的功能作用有执著，认为是我的功能作用，就不识法界实相，这是最大最根本的无明，因此无明而不能得到解脱，不能解决生死问题。有执，就有生死和生灭现象的存在。</p><p>意根还执着六识的所有功能体性为自己，把六识的功能作用执为是自己的功能体性，认为六识所了别的法，就是自己所拥有和了别的法，六识的身口意行，就是自己的身口意行，六识的一切行为造作，祂都认为是自己的行为造作。意根普遍计度执着这一切法，叫遍计所执性，以此执性，不断的增加生死系缚。因此有必要断除意根的我见和我执以及法执，才能彻底究竟的得解脱。</p><p>十五、睡着无梦是什么状态，需要意识在清醒时参究，意识必须有智慧，才能参究出来。睡着无梦时，意根有知，知六尘境界，知身根，知自己，这也需要意识非常有智慧时才能观察出来，需要意识转识成智，有唯识上的智慧。</p><p>意根依如来藏见一切法的功能，自己就能见一切法，祂没有智慧时就把如来藏见的法，当作是自己见的法，于是生起执著和攀缘，认为一切法都属于自己的，也思量我我我，不断的维护自我，保护自我，还能权衡各种利弊得失。当身体出现各种状况时，祂会权衡是否需要醒过来处理，能作出判断，作出决定，有自己的观点看法，多数是根据经验。</p><p>意根的我，包括了所有法，很全面，把五识当作我，把意识当作我，把第八识当作我，也把自己的功能当作我，把五根当作我，把六尘境界当作我所有的，甚至把六尘之外的法也当作我所有的，而攀缘执著不断，思量不断。既然意根把一切法都当作我，那么断我见就是意根断我见，明心证悟就是让意根证，之后意根才能明了原来能见一切法的功能作用不是我的，是如来藏的，一切法都不是我的，都是如来藏的，这样意根才能慢慢的断除我执和法执。如果只有意识断我见和明心证悟，那么意根永远都认为五蕴就是我，一切法都是我，永远不可能断除我执和法执，也就永远不能断除烦恼和无明，那么众生永远不能成佛。</p><p>十六、意根对第八识的执取性</p><p>意根执取第八识的见分为我，是因为祂根本不知道一切法都是第八识里的种子变现出来的，一切法种都是第八识所见，一切法都是第八识所变，没有自己什么事。因此意根无量劫一直是颠颠倒倒的执取了第八识的功德，却从不知道。意根太相信自己的执取，一点也不怀疑，完完全全是盲信，因为祂不会分析思惟，不会观察思考，不能学习正确的理，智慧漏劣。</p><p>意根如果知道一切法都是第八识的功能，不是自己所为，不是自己的，祂就不再执取了，关键是祂不知道，这就是愚痴。意根要改变自己的愚痴性，需要意识学佛明理后，转告意根这些真实道理，意根才能知道。问题的关键点在于意根的了别慧不足，而了别慧不足的原因在于意根攀缘太广泛了，祂的遍计所执性决定了意根智慧低劣。有广度就没有深度，所以学佛也要先广后专，广学多闻，之后再一门深入，不能颠倒着学法，如果该深入学习的时候，却还在广学多闻，深的智慧、实证的智慧就不能有。总是广学多闻，不能专一深入思惟的人，就是层次比较浅的初学人。</p><p>十七、瑜伽师地论中说，有一些声闻人在最初的时候，因为他们不是菩萨种性，不相信自身中有涅槃本际阿赖耶识，而爱着阿赖耶识，把阿赖耶识的功能体性，当作是自己的功能体性。因为阿赖耶识遍一切处，能产生一切法，因此，他们就把阿赖耶识在一切法上的功能作用，都当作是自己的。内执阿赖耶识为我，外执阿赖耶识变现的五取蕴为我和我所，因此就在一切法上系缚着自己，不得解脱。无始劫以来他们就附属着阿赖耶识，执取阿赖耶识所变现的一切法都是我的和我所有的，由于执取的时劫长久，非常坚固，难以拔除。无始劫以来，随着这种种执取，相续不断，十方诸佛也难救拔。</p><p>这里是在描述众生意根的我，普遍计着一切法的遍计所执性，祂就是非常坚固的我，执取一切法为我和我所的众生假我，根深蒂固的我，难以自拔，唯除十方诸佛，种种方便，而兴救拔，众生才能渐渐降伏意根的自我，断除意根的我执和一切无明，最终转识成智，圆满佛道。</p><p>十八、菩萨行深般若波罗蜜多，照见五蕴皆空。这里的照，是在甚深的观行功夫基础上，一念相应，諸法无生的大智慧现前，五蕴皆空的事实真相就在心中显发出来，意识意根对此深肯不疑。就如镜子照物一般，物立时就清楚的显现在镜子上，这是现量境界，毋容置疑。要想有照的功用，禅定功夫就要相当好，定力增强时，意识心不再浮浅的思惟，这时思惟得就深和细一些。</p><p>意识深思的同时也动用了意根的思量性，修行深入到意根，从意根下手，才能解决根本问题，因为意根也参与了观行，并且亲自证得，能深深的认可。意识心认可比较容易，意根认可就相当的不容易，祂得在证据确凿的情况下，才能认可，祂承认事实，承认现量，证据充分时，祂才能承认，祂认可时才是证得佛法。</p><p>如果是只有意识心自己肤浅的思惟，就不会有充分的证据，那样的话理论还是理论，事实不能显现出来，真理不能被发现。意识的思惟了别如果不完全是现量境界，还有比量和非量境界，思惟浮浅，运用比量和非量的了别性比较多，那么寻找的证据就不够充分，想象和比较的成分多，事实就不能呈现出来，意根仍然不明就里，祂就不能认可那个结论，也就不能证得真理，那就没有照的功用了。</p><p>照，是呈现出来，影像现出了，是现量境界，事实也就同时显现出来，事实一旦出现，就没有什么话好说的了，只有认可的份儿。照的前提是行要深，通过深入观行，也就是在深细的寻找所有的证据，在证据充分的情况下，事实显现出来，这就是照的功用，这时大智慧就现前，证得五蕴皆空，都是第八识的功用。</p><p>十九、理论知见、解悟和证悟是三个层次</p><p>只知道五阴身是第八识所生，这是基础的大乘理论知见，在大乘法上刚刚起步，离实证还有一段距离，至于有多大的距离，因人而异。实证之时，能观察出第八识具体在哪里起用，起什么用；如果仅仅是理论知见，就无法观察第八识具体在哪里起用起什么用，那对于生死问题还是了无相关。有些人认为这是解悟，其实还不算解悟。知道一切法都是第八识的功用，这个知见还是有点浅，成天这样说，也仅仅是口头禅，于实际证得相差不知道有多远。但这是学佛的基础，由此知见，慢慢就会融入第八识中。</p></div>"
},{
    "title": "第五章　三十七道品成就后才能证悟",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　三十七道品成就后才能证悟</strong></p><p>一、三十七道品的修行次第大略如下：由最初的五根中信根起修，五根增长以后就具足了五力，之后进入八正道中发起思惟修，修习七觉支，在念觉支中修习四念处观，得善法味，起四正勤，最后结果经过勤苦修习得四神足之果乐，心得自在解脱。</p><p>三十七道品中每一品，不仅意识要精进修习，同时也要熏习意根，使得意根与意识共同修习，圆满具足每一道品，最后成就四神足。意识用念力熏修意根，使得意根念力具足，念力成就。每一法最初由意识熏修引导，由意根具足，之后才能实证这一法。</p><p>意根证得身心不是实有的时候，才能得解脱，意识认为身心不是实有，不能得解脱。认为与证得之间距离，可远可近，完全在当人的修持程度，没有修持，其差距可能要很多劫。</p><p>二、小乘证果的关键是七觉分的修持，七觉分已经大略讲过了，修行的过程也是四加行的过程，暖、顶、忍、世第一法四个过程，就是在文字理论的基础上，再进行内心加工的过程。在加工过程中，内心一定会逐渐起相应的变化，这是观行法义逐渐与内心意根相应，意根逐渐领纳领受的过程，当然首先是意识先领纳领受，生起胜解，然后传递给意根，让意根领纳领受。意根领纳领受之后，身心就会逐渐转变，七觉分逐个出现，定觉分出现之后，才能有大智慧舍去五阴身心法相，进而证法，成为世间第一的初果人。身心没有变化，没有转变，七觉分没有成就，不可能断我见证果。</p><p>暖相，是在初步修学阶段透过文字理论，自己亲自思惟观行之后，内心里出现了暖相，就好像擦出火花一样，心里有些认同了所思惟的正确的理论，对所修之法有了初步的认知和兴趣，还想继续深入探讨其中的内涵。</p><p>顶相，这个阶段对于理论的认知达到了一定的程度，有了一定的高度，了解和理解了五阴身心的空和无我性，达到对五阴认知的顶点。这时还是处于意识的认知和胜解阶段，还没有完全让意根认知和胜解，因此内心还有躁动，还不能完全认可和安住在五阴空无我的认知上，处于可进可退阶段。</p><p>在这个阶段，有的人内心就会有激烈的反抗，思想躁动不安，情绪有起落变化。有的人要苦恼万分，也许会莫名其妙的烦躁和情绪低落。过了这个阶段意根有些适应了，情绪就会恢复正常，进入下一个阶段，不但意识安忍于空，意根也安忍下来。就会继续深究探讨，究竟为什么五阴是空的，不实的。</p><p>第三个阶段是忍。忍，也就是安住，安住在空义上，忍可五阴的无常性，但还不是真正的证得。因为证据还不充分，内心的考量还不足，无法真正确认此理，只是内心不躁动，比较安分了。也在努力寻找证据，努力现量观察五阴身心的实质。这时身心的觉受越来越轻安，越来越欢喜，禅定越来越好，智慧越来越深细，越来越灵敏，空的念头越来越坚固，但还不能住于舍，内心里没有舍觉分。</p><p>等到舍觉分成就时，舍去了内心当中的我的观念思想，内心空空，五阴空无常的观念已经牢固确立，证据已经充分，内心完全认同确认五阴空无我，第四个阶段世第一法成就，断除了我见，证得初果。</p><p>在观行过程中，身心要不断的起变化，为什么要起变化呢？因为透过意识的胜解，意根逐步有了一定的了知，与从前的观念相左，逐渐颠覆从前的认知，意根发现了新大陆，就会促使身心出现相应的变化和反应。所以断我见，证得五阴无我，一定是意根证得的。</p><p>断我见以后出现的觉明现象，身心出现的各种轻安喜悦的现象，是意根促成的，是意根在身心上的反应。意识无法使身心有反应，无法让身心出现轻安和喜悦的觉受，所以断我见一定是意根断除了我见，不仅仅是意识断我见，意识的我见当然早已经断除了。</p><p>如果没有轻安喜悦觉明现象的出现，也认为五阴无我，这是意识断我见，还没有深入到意根的内心深处。意根最初认知到这个理时，会出现反抗烦躁的现象，有轻重的不同表现。前世根基比较好的人，观行过五阴的人，就不会有这些烦躁的情绪，不会反抗，直接就有喜悦的心境出现。</p><p>什么叫作实修？这就是实修，没有这些阶段和过程，不能说明真正断我见了。真正断我见之后，身心一定转变，心行一定改变，圣性一定出现，内心一定是空的。怎么还能有那么严重的烦恼，怎么还会有那么多乱相出现呢？不可能的。内心空了，多余的事情就不想造作了，与无为有初步的相应了，哪里会有那么多的乱事发生，况且还能出现那么多的恶行，根本不可能出现。</p><p>如果禅定不足，观行真的很吃力，对法义的吸收和理解就不到位。有些深法和甚深法，那就更不能理解和信受了，因此就会生疑，疑见不断，内心就不安稳。</p><p>三、小乘方面要断我见，三十七道品必须要修完，七觉分要具足，八正道要具足。有喜觉分和倚觉分的现象出现，其次是定觉分要现前，这些都是与禅定不可分离的，都属于禅定的前奏和后续，属于禅定的范围。</p><p>在思惟佛法的过程中，应该产生身心轻安，内心喜悦的现象，这是七觉分的修证内容之一，这表明佛法已经入到意根心中，得到意根一定程度的认可，但还不完全，也可以说为四加行的暖相现前。</p><p>任何法的证得确实是都与意根有关，都与定有关，七觉分的修证就说明了这个事实，这样意根与证悟修证的关系就有了佛经依据。定慧和意根须臾不可分离，意根证得才有真正的智慧，意根有禅定才能产生智慧，意识单独的知解没有大智慧，只是学人言语而已，名为知解宗徒。有关意根在修证中的重要性，七觉分就是个很好的证据。八正道里也讲到了八个正，都是指修意根的，正主要指把意根的思想观念正过来，让其作主决定一切身口意行为都为正行，意根没有改正过来，八正道就没有成就。</p><p>受想行识都是空、无我的，那是谁在受想行识？能受想行识的是七识心，也都是空无我的。能观察受想行识为空的意识，是空无我的，知道观察者是空的意识，是空无我的，了知一切法是空无我的六七识心，是空无我的。只要心中有知有念有思想的，都是空无我的。观世音菩萨耳根圆通章里的修行方法，就是把一切法都空掉，能空所空的法，都空掉，最后剩下一个实在空不掉的那个，就是自心如来藏，也不住于自心如来藏上，修行就到家了。</p><p>四、四圣谛、四正勤、四神足、五根、五力、七觉分、八正道三十七道品这些内容，都是见道前后的修行过程，大小乘大同小异，修行过程相似相像。如果没有这些过程的熏习，而突然出现一个果，成为圣人，这个果很可疑，极其不可靠，果和结论都可以抄袭，所有的知见都可以背诵，只要多读几本书就可以背诵出来想象出来。</p><p>而这些过程任何人都抄袭不了，这是每个见道证果的人必须要经历的过程，每个人的过程因其前世根基不同，可能有一些差别。前世已经证果的人，今世这些过程也许很快就走过经历过了，其他人则不行，都要一一实践实证，各个关口都要过去，大乘果位也如此。这些过程都经历了，其身心就能转变，证果时就有解脱的功德受用。没有经历这些过程的人，其所得果，犹如空中花，只可欣赏，没有实用价值，没有解脱功德受用。</p><p>所谓的实修，就是大小乘的三十七道品的修行内容，离开这些具体又具体的修行内容，就不是实修，只有结论没有过程的修行都不是实修，只学理论不是实修。理论可以学到几地菩萨的理论，即使明白那些理，与实际证得还差一个无量劫两个无量劫的时间，一二个无量劫以后的理论现在就学习，就以为自己掌握了，就是圣人了，前边的路都不需要走，实际的修行过程都不需要经历和实践，那这样的修行就是梦幻泡影，只得空花，结个空果。</p><p>五、四圣谛法，苦集灭道也分为内法尘和外法尘，修道谛中的八正道，也分为内法和外法。八正道修完，小乘三十七道品修完，断我见的条件才能满足，之后才能证果。如果心行不符合八正道，那就心行不足以为圣贤，不能证果。八正道中有正定，分为意识的外定法和意根的内定法。所以意根一定与定相应，定完意根，才能有正智慧生起，才能断我见，证初果。否则全部是假果朔料果，只能观赏，没有实用。</p><p>六、大念住经，就是佛教我们观行方法的经，不会观行的人，顺着佛引领的思路在定中思惟，就是观行，观行到最后就会有一个决定心，有一个最后结论出来。如果这个结论符合佛所指给我们的事实和真理，就是证。</p><p>在正确的观行过程中，心里会产生诸多的变化，七觉分要一一现前，内心里的暖相要出现，四加行前三者要出现，当最后证得无我、空的时候，就是世第一法，初果成就。这些现象，如果都没有出现，就说自己断我见，成为初果了，那简直是自欺欺人。百分之九十九的人，都没有如此观行过，七觉分都没有全部出现，忍位都没有真正完成，不可能成为最后一个世间第一的初果人。</p><p>佛法的修证有一定的严格标准，这些标准佛在经中都讲了，三十七道品、七觉分、四加行，四念住等等，都是佛说的修行标准。只是众生自己不懂，弘法者如果也不懂，那世间就会乱相纷呈，满大街都是圣贤，却乌烟瘴气，世风日下。</p><p>七、佛在大念住经里讲五盖的时候，说有内贪欲和外贪欲，内嗔恚和外嗔恚，内睡眠和外睡眠，内掉悔和外掉悔，内疑惑和外疑惑。内和外都分别指什么？</p><p>心如果分内外，外心就是指众生普遍能够发现和观察出来的心意识，内心是指众生不容易发现和观察出来的心意根。两个识心一显一隐，一明一暗，一深一浅，一容易改变，一坚固难改。修行就是先落实到浅层次的意识，再落实到深层次的意根，先初步转变意识，最后究竟转变意根。所以所有的烦恼无明，最初和明显的是意识层面的，最后和隐秘深邃的是意根层面的。</p><p>从这部经当中，我们可以看出，佛在讲小乘法时，虽然没有明说意根的法，但还是隐藏着讲到了意根，隐藏着而说一切烦恼和无明都是意根的，断烦恼是断意根的烦恼，解脱是意根的解脱，一切法都落实到意根上，解决意根问题，就能解决一切法，最终究竟达到涅槃和解脱 。</p><p>八、佛在大念住经里，讲观受的时候，讲到内受和外受两种受。外受是指容易观察出来的意识心的受，特别是在六尘境界上的意识的受；内受是指隐藏比较深的不容易观察到的意根的受。虽然极大多数人分不清意识和意根，但是内心深处的思想活动还是能够感知观察到的，只要心很细致。</p><p>佛讲观心的时候，观察心要观察内心和外心的贪嗔痴烦恼，观察内心和外心的集中散乱、广大狭小、有上和无上、有定和无定、解脱和不解脱，这说明内心意根有贪嗔痴烦恼，有定和不定，有解脱和不解脱。这是从小乘经典上证明了意根有这些心所法，虽然世尊没有明说。因为意根的法，大乘弟子都无法理解和证得，何况小乘弟子能深入正确理解意根的法，所以世尊不得不隐秘讲意根的心所法。</p><p>疑惑烦恼，有内疑惑和外疑惑，断疑就要究竟断，一定是断意根的疑惑。所以三缚结完全是指意根的结，断除意根的疑惑才是断三缚结。断贪欲，断意根的贪欲，心才能与色界天人相应，才能生到色界天；断嗔恚，一定是断除意根的嗔恚，才是三果人；断愚痴，一定是断意根的愚痴无明，才能出离三界。</p><p>小乘佛经最容易理解，可是又有什么人能真正看懂小乘佛经呢？更何况大乘经典，又有什么人能真正完全看得懂？证阿罗汉果，也不能完全信汝意，智慧不足，意不究竟，完全信之就容易出差错。</p><p>九、大念住经中，世尊讲五取蕴时，也讲到色受想行识的内法和外法。内色是色身，外色是六尘，内受想行识是意根，外受想行识是意识。</p><p>世尊讲七觉分时，也把七觉分分为内七觉分和外七觉分。择法觉分、精进觉分、喜觉分、倚（轻安）觉分、定觉分、舍觉分，都分为意识的外觉分和意根的内觉分。没有修成内七觉分的时候，不可能证得小乘果，不可能断我见，更不要说明心见性了。三十七道品不修成就，大小乘果一个也不要谈，身心轻安不成就，定就不成就，内心舍受不存在，就无法断除我见，无法明心见性。这是佛法修证的硬指标，无论谁也越不过去。如果硬要说某某证果和明心了，那都是朔料果，看看就可以了，不能饱腹，没有实有价值。</p><p>十、七觉分第一个是念觉分，内念觉分是意根的念，外念觉分是意识的念，意根没有念觉分的时候，念觉分不成就，择法觉分就不能现前。所以意根一定有念心所，小乘经典都隐含着讲到意根的念心所了，何况大乘经典。只是众生无明重，看不懂佛经，无法辨别罢了。</p><p>从世尊对七觉分的描述来看，意根有择法觉分，有精进觉分（真精进），有喜觉分（意根不仅仅是舍受），有轻安觉分，有定觉分（与定相应），有舍觉分。之后心行符合八正道，才能具足小乘证果的条件，才能断我见，证初果，否则都是假果朔料果。条件不具足，因缘不具足，强行引导，只能得个假果。</p><p>七觉分当中，有个择法觉分，修到这个地步，就有辨别能力了。但是超越自己目前水平太多时，又没有抉择能力了，那就再接着修。择法觉分是要不断增进的，直到圆满具足，能立即正确拣择一切法而无疑。</p></div>"
},{
    "title": "第六章　意根证悟以后的功德受用",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　意根证悟以后的功德受用</strong></p><p>一、真断我见的状态</p><p>真正断我见的人，在意根确认无我之后，应该能发起更深的禅定，觉明现前，精神愉悦，思惟细密，观法深细。每天睡眠只有三五个小时就够了，身心也不会觉得疲劳，反而精力充沛，精神状态非常好。这是意根亲证无我之后，认识了真理，对于身心的一种调控。睡眠由意根调控，精神状态由意根调控。意根改变旧有的不正确认知，身心状态一定要改变。</p><p>如果只有意识认为无我，意根没有这样的认知，就不会引发身心的一系列反应，不会改变身心状态，那就会一如既往，没有变化。解悟无我，就是如此。所以如果有人认为自己断我见，证初果了，那就要检查一下，到底是意识断我见，还是意根也同时断我见了。只有意根断我见，才能断除三缚结，三缚结主要是绑缚意根的。</p><p>二、功德受用来自于意根</p><p>懂得六识所见都是虚幻的内相分，心里已经认可了，怎样让这种认可生起功德受用？内心真正认可的时候，马上就开始有功德受用了。对于一切法的功德受用来自于意根，如果意根与法相应，认可了某个法，就会作主生起身心特殊的觉受，从而改变身心，也改变身心觉受，出生功德受用，学佛就是这个目的。能作主牵引和改变身心的是作主识意根，意识无法做到这点，所以意识的理解和懂得只能起着熏染意根的作用，不能改变身心世界，意识熏染不了意根，身心世界一如既往，不会有任何变化，因此就没有功德受用。</p><p>很多人学法，只求多闻和情思意解，从来不下功夫修禅定去参究，以求真正证得其中的真实义，学佛犹如蜻蜓点水，点到即止，以为意识懂得和明白就是证得了，通过推理得到的结论就是最终的结论，就是实证，就万事大吉了，其实误会太大了。                                                </p><p>意识通过文字，可以比量非量了别法义，可以通过思惟观察分析，判断某个法是正确的。可是意根并不懂得意识所判断出来的法义，因为需要证据，需要现量观察的东西，缺少这些东西，意根不认可意识的分析思惟判断，那就不是真正的懂得，不是证得，只是意识的理解罢了，不起决定作用，不能改变内心和身口意行。</p><p>懂得某个理，分为不同的层次，哪种程度的懂得，才是真正的懂得，才究竟无疑，内心才踏实，心理才能发生变化，这是很重要的。意根所懂得的理，就是证得，证得以后才有功德受用。意识的理解不是证得，没有功德受用。通过文字的思惟分析理解，没有现量观察，证据不足的懂得，是意识心的作为。意识也可以通过文字，思惟分析佛地的各种境界，这样也能懂得一些佛地的境界是什么，也能懂得等觉菩萨所修的一些内容，那是不是说，一个凡夫就证得了佛地所具足的法，是否就证得了等觉菩萨所修的法？</p><p>凡夫可以通过思惟想象初地满心菩萨才能证得的镜像观，也能懂得一切法犹如如来藏镜子中的像，那是不是说凡夫瞬间就证得了初地满心的境界，成为二地菩萨了？</p><p>一切法的证得，都是意根的认可。意根认可证得以后，才能有功德受用，才能作主改变心行，改变身口意行，身心世界才能发生改变，这就是功德受用。而身心世界的改变，是意根所为，意识做不到。所以说只要是真正的证得，不是理解，就有功德受用，就能分证解脱，身口意行一定发生改变。</p><p>那些靠意识的理解而证果和明心的人，没有一丝功德受用，身口意行不可能发生改变，也许还会增长慢心，而肆无忌惮的造作比从前还多的恶业，因为他们知道自己不会下三恶道了，什么也不怕。实际上理解的证果和明心，没有断除三缚结，不能保证不下三恶道。这种假证果假明心，才更容易下三恶道。众生不知，名为可怜悯者。</p><p>三、意根证悟时身心的触动</p><p>深入骨髓的震动触及到意根，那么当意根现量证得无我后，震动是不是更大？意根现量证得，身心受到的震动很大，出现很多异常现象，禅定加深，睡眠改变，身体轻安，病痛消退，精神愉悦，等等，等等，越是现量，变化越大；而越是解悟，越是没有变化。过去善根深厚，有深禅定的人，现量证得佛法，就会身体涌上虚空，神通现前，这是属于色身上的巨大变化，因为前世就有禅定的关系。看看佛经里记载的那些圣贤人悟道，不管是大乘，还是小乘，都有神异现象发生，为什么如此？因为有禅定，是现量证，身心改变都极大。</p><p>四、证得后才能改变意根</p><p>意根如何改变？只有现量证得大小乘法，才能改变意根，除此都不能改变意根。比如小孩不懂火的危害性，大人告诉不要玩火却不听，直到有一天被火烧出事了，从此才知道火的厉害，不再玩火了。这是意根亲证了火的厉害性，不用再思惟观察，马上就认同，马上就长记性，马上决定从此以后不玩火，意根就改变了玩火的习惯。比如吸烟有害健康，都这样宣传，吸烟的人却抱着侥幸心理，直到有一天得肺病了，才肯戒烟。意根亲证了尼古丁的危害性，就改变了吸烟的习惯。很多事例，说明意根亲自经历，亲证了，才肯信，信了就改，信到什么程度，就改到什么程度。</p><p>证果也是这样，亲证五阴十八界无我时，意根就改变，就得到解脱的功德受用。亲证到什么程度就改变到什么程度，从初果一直证到四果，意根对五阴十八界无我之理不断深入的亲证，认识不断的加深，不断的改变，对于五阴的无我性全部亲证以后，一念无明断尽，我执就断尽，解脱于三界世间，不再有所造作。在前三个果位时，意根亲证的深度还不够，烦恼和一念无明就没有断尽，还会有所造作，不能马上解脱于三界世间。乃至于慧解脱的阿罗汉，由于禅定不足，神通没有亲证，就没有能力来去自如，五阴就有所限制。</p><p>意根如果不在初果时断我见，那在何时断我见？祂总是要断我见的，到底什么时候断？就在初果时断我见，之后通过深入修行，断除烦恼和无明思惑。也就是再深入的对五阴十八界法进行深细的观行思惟，无我的智慧不断加深，意根得到更多的证据，证得更深入，改变更大，以至于断除了烦恼，断除了我执，断除了对三界的贪爱。这是在小乘方面。</p><p>这就说明断我见的不同程度差别，智慧不同，导致意根转变的程度不同。初果到四果，就是意根证得五蕴无我的智慧层次不同，导致果位不同，烦恼的有无层次不同，我执的降伏和断除程度不同。大乘证果也如此，证得如来藏的深度层次不同，智慧不同，无明的断除程度不同，果位不同。</p><p>大乘方面亲证如来藏，证时意根就改变，证到什么程度就改变到什么程度，一直到佛地的亲证，意根就彻底改变，彻底转识成智，再也不用转变了，佛就处于无住处涅槃中。</p><p>五、如果断了身见，意根执身的本能反应是否会减弱，如果是这样，是否会影响到意根保护根身的能力或者效率？真正断我见以后，意根的执身性也许能减轻一些，因为意根知道色身不是我，对自我就要稍稍放松一些，不太在意了，有些事就觉得无所谓。比如在吃穿住用方面，可能不太挑剔，别人对自己的看法和作为也不太在意了，内心知道无我，他人也不能把自己怎么样，不能真正的伤害到自己，因为没有真正的自己，因此就会更加的宽宏大度一些。</p><p>这要看证得的是初果还是二果，禅定情况如何，还要看前世的修为，前世是否证得过无我。三果执身性比较明显的减轻了，四果断尽执著性，执身的本能反应就更加轻微。对于色身的本能反应要完全断尽，得要到八地菩萨以上，我执的习气都要断除才行。初果二果人还有相当程度的执身本能，但比没有断我见时要减轻一些。</p><p>有禅定的人，执著色身就轻微，多生多世断过我见的人，执身更是轻微，往往是不太在意色身的饮食起居，吃穿住用都比较随缘，对一些色身上的反应比较麻木，因为断了身见和识心我见，心中无我了。</p><p>对自我没有执著的人，对色身就比较麻痹麻木，不太把色身当回事，直到色身出现明显障碍，才会想办法对治。但是遇到危险尤其是不必要的危险，还是知道躲避，不做无畏的牺牲。也许因为福报的支撑，心中对危险不是很在意和着急，一般表现为比较胆大。禅定比较深时，色身对外界环境的应对反应比较缓慢一些，不够灵敏，做事的速度也会降低，但是做事和思考问题有深度，也彻底一些。</p><p>六、学理论是为了实证，实证之后才能操作，所学理论才有实用价值，使身心受益，解除烦恼，从而改变自身，得解脱得大自在。</p><p>如果所学理论不能导致实证，就不能得到真实受益，也就不会获得解脱获得自在。理论由意识修学和理解，实证由意根掌握和贯通，解除烦恼改变自身由意根来作主，获得解脱和自在由整个身心五蕴来受用。其中每个环节都由如来藏配合输出种子来实现。</p><p>七、意根的现量证，往往是要身心发生轻重不同程度的变化，因为意根与身心不相分离，紧密联系在一起。为什么意根与身心联系非常紧密呢？因为第八识能变现一切法，也能见一切法，而意根依第八识的见分，也能随着见一切法，并且把这些法当作真实，当作是我见，生起执著，攀缘不已；同时意根就能在一切法上起作用，而能协调和控制身心世界，让身心世界发生各种变化。这就是意根的遍计所执性和时时处处作主性的表现，也是我执和法执的表现。</p><p>意根如果能现量的知道了某种道理，认可了某种道理，就是我们常说的从心里往外的承认，就能让身心发生各种程度的变化，这是因为身口意行是由意根控制和决定造作的，由意根说了算。即使在没有证果，与证果相距很远的情况下，意根一旦接触到某个事理，认可并深肯此理，内心就受触动，于是身心就发生变化。比如心情舒畅、身心轻安、热泪盈眶、浑身战栗、汗毛直竖、情绪激动、头皮发麻、面红耳赤、眼神呆滞、头中嗡嗡作响、热血沸腾、心惊胆战、呼吸急促、青筋暴跳、气急败坏等等诸多情况，这是触动到意根，意根现量知，而后促使身根发生了或大或小的变化。每个人都有此经验，自己回想一下，就知道是否是这么回事。</p><p>这些情况的出现，并不说明意根降伏了烦恼或者是断除烦恼了，更多时候还恰恰说明了意根的烦恼性很重，我执情执很重，才会出现这些身心的巨大反应。真正现量证得无我时也是如此，身心出现很大变化，由于意根从前不知此理，意识无论怎样念叨无我，意根也不知不认可无我，内心无动于衷，做起事情来仍然我我我，这显然是没有断我见之人的表现，意根一旦知道了确实无我，受到了触动，那么祂对身心的执著就放松，身心就出现变化、轻安而愉悦。</p><p>八、三昧是禅定与智慧的结合体，二者缺一就不成其为三昧。各种层次的证道，就会出现各种层次的三昧境界。这些三昧境界包括禅定的特征，智慧的特征，色身觉受的特征，禅定深的还有神通道力的特征。三昧的出现，使得色身觉受轻安舒适无比，睡眠减轻或者是消除，身心愉悦，内心越来越空，无明减少，智慧越来越深，烦恼越来越轻微或者消失。</p><p>证得某种法，必有相应的三昧境界出现，这是证法的标志。意根没有证法，仅仅是意识的理解，没有三昧境界的出现，就平平淡淡，身心不能改变一点点，贪嗔痴烦恼仍然厚重。善根福德加上佛力的加持，一切因缘具足，必能证法，只要证得，意根就能促使身心转变一些。有人说自己证得什么了，可是证得后的结果是什么，难道就是口若悬河，没有三昧境界，没有功德受用吗？绝对不是这样。</p><p>九、只有意识断我见，意根不断我见，意根没有受熏，仍然是凡夫的意根，后世入胎时意识灭去，再生为人时，意识和意根都没有断我见，意根的表现与前世凡夫一模一样，没有差别，那么前世证果的功德从哪里表现出来？</p><p>而事实上，前世真正证果和明心见性之人，因为意根受熏，再生为人时，其心行与凡夫决然有区别，前世修行时间越长，其心行越清净，与凡夫的差别越大。没有学佛前，意识都不知道为什么自己与其他人不一样，当被人骂为傻子的时候，意识心里还感觉苦恼。有时候想跟别人一样，跟上社会的节拍，也同样要搞点贪嗔痴，可意根都不愿意。</p><p>十、意根与法相应，受到触动时，才有身心反应。意根从前所不知道的理，现在知道了，原来所误解的理，现在明白了，就会出现身心反应，以表达自己的情绪和心境。在没有证果之前就能出现这些状态，证果和明心开悟以后，身心反应更明显，这就是实证的功德受用。没有这些现象，说明意根没有受到触动，无论大小乘法，都是解悟，没有什么功德受用，解悟的结果如何，命终就有分晓了。</p><p>所以每个人都应该对自己的生死大事负责任，不要动不动就给自己带高帽子，未证非要说证。如果圣贤人的心行和智慧都不具备，理解一些佛法，那又算得了什么，不少人理解了一些佛法，就以圣贤人自居了，其实没有实证的功德受用，德不配位，早晚会出问题的，尤其是命终时分。</p><p>十一、学佛修行一定要深入到意根</p><p>学佛修行，意根还没有受熏时，身心世界就不会转变，也就没有得到佛法的真实受用。因为身心世界是由意根作主，由意根调控，意根证得无我，就会放松对身心的控制，身心就转变，轻松无碍了。这是学佛修行的一个大秘密，大家多体会。学佛一定不要停留于口头禅，一定要深入到意根的内心世界，要真真正正的改变自己，从根挖出贪嗔痴烦恼，自己才能彻底转变，从而快速成就。</p><p>很多人学的法可能很多，学佛时间也很长，但是是否得到真实受用了？内心世界是不是有所转变，对于自我的觉受和执著是不是有所松动了？自己常常要回光返照，才能不断的进步。如果自己没有能力回光返照，就要找个人监督，时不时的敲打一下自己，让自己觉悟，这样修行就能快一些。</p><p>很多人从来不检查自己的内心，更不希望别人来敲打自己，这是因为意根太执著自我，太护着自我，我执根深蒂固，学佛就不得力。修行就是要不断的与自己较劲，才能改变自己，道业才能不断的增进，如果向外与别人较劲就大错特错了。</p><p>十二、有些人看到某种法义，内心受到了很大震动，色身出现了一些不同寻常的现象，这是震动到了意根，才有这些感触。即使是在世俗法里的实证，也一定有或大或小的身心感触和变动，不是平平淡淡的划过去就算了。已经有不少人在遇见某种法义时，在修证的过程中，都有身心的大小程度不同的变化，真认得某种理时，就是这样。</p><p>平平淡淡的不与意根相应，只是意识心的理解，那不算数。学法时，像读课文一样滑过去，就认为自己理解了，知道了，证得了，于是就放过自己，这是对自己的高度不负责任。如果这样容易，三藏十二部看几遍，理解一部分，就说是证得了一部分，那简直就相当了不得了，八地以上菩萨也许能这样。把佛经拿过来，博士生博士后，也觉得能懂文字，如果懂就能证得，那佛法就太容易了，根本不用修三个无量劫。</p><p>十三、心灵的震撼，为什么足以对抗意根的习气？因为心灵的震撼直接震撼到了意根，意根才不得不改变自己的习气。意根接触到现实现量了，才感到震撼，意识不会有震撼，意识很容易知道一些事，比较肤浅。所说的震动和震撼，都是对意根的，意根知道事实了，才能改变自己。</p><p>意识感到的震撼，也主要是震撼到了意根，意根才作决定，或者改变自己，或者确认某些法。平时别人怎么吓唬也没有用，因为没有震撼到意根，一旦某天意根知道事情的严重性了，就受到了震撼，决定必须改变自己，必须如何如何做。</p><p>多少人每天口里都说无我无我，可是做起事情来，都是我我我，为什么？因为意根并不知道无我，某天一旦确信真的无我，那才叫震撼呢！从此以后，就改变了自己，身心出现变化。</p><p>十四、悟后唯证乃知的境界</p><p>这个知，主要是意识的知，背后也有意根的知。证悟的知，就是智慧性的知，不同于悟前的知。悟前是意识猜测如来藏，意根不知法界实相，认五阴为我，两个识都没有智慧。悟后，意识证得了如来藏，意根知道了法界实相，这个智慧就了不得，烦恼就会渐渐脱落，无明渐渐减少，我执越来越轻，最后就能转识成智。所以证悟一定是意根也证悟了，否则意根就没有证悟的智慧，就不能断除烦恼，不能转识成智。</p><p>悟后的唯证乃知，言语无法表达透彻。就像一个人吃了蜂蜜，其甜度只有自己心里完全清楚，无论怎样对人说，别人也仅仅是理解，不能真切的体会。因为不是亲自品尝，不是亲自感受到的。所以说，意识猜测出来如来藏的那种解悟，和意根亲自证得如来藏的证悟，其智慧差别极大，受用差别也极大，后续的修行就如天壤之别。</p><p>十五、为什么实证要涉及到身心的转变，身心的转变是一个重大而明显明确的标志呢？因为身心世界从无始劫以来，一直到无始劫以后，都是由意根控制和调控的，意根的认知转变，知见转变，智慧转变，就会相应的转变一下身心世界，身心的反应是意根的晴雨表，意根情绪的发泄、思想的表露等等都通过身心反应出来。如果意根的思想受到某种震动，必然要同时带动和影响身心世界，引起身心的连锁反应。</p><p>十六、意根一旦认可某个理，则任何时候一定是斩钉截铁、毫不犹豫的；只要是意识思量来的，一定是狐疑的，犹豫的，反复的。就像骑单车，会骑与认为会骑是完全不同的二种状态，前者毫不犹豫，后者心里不能完全肯定，没有把握。有些人内心有狐疑，不知道自己狐疑，还以为自己没有什么疑问，那是因为心太粗，反观力弱，定力不够。所以不见真相，就会自我蒙蔽。</p></div>"
},{
    "title": "第七章　解悟的特征与弊病",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　解悟的特征与弊病</strong></p><p>一、在断我见和明心的时候，如果身心世界在当时及以后，没有什么变化，那就是理论上的断我见和明心，都是解悟，意根并不认可，就没有证悟。意根不觉悟，就不能破除无始无明，不能出生智慧，智慧就不解脱，不能断除烦恼和习气，不能断除人我执和法我执，更不能转识成智，不能消除染污业种，永远不能清净，也就永远不能成佛。</p><p>明心一方面是意识心的觉悟，这个觉悟不是理解的，而是有理有据，证据确凿，这就是现量境界，这样意根也同时证，意根认同现量境，祂同时证得时，就知道五蕴本来是如来藏的，不是自己的，于是就把五蕴放松下来，不再控制身体了，顿时身体就轻安舒适起来，心里非常清明，当时身心就发生变化，与从前不同。定力越好，变化越大，烦恼越轻微，觉受越好，只是这些身心语言无法完全描述出来。</p><p>如果是单纯的意识心理解，证据不充分，猜测的成分多，想象的成分多，不是现量境，就说服不了意根，祂就不知道五蕴是如来藏的，不知道五蕴不是自己的，那就还会把五蕴当作自己的而执著和控制，身体就没有什么转变，心里也没有什么转变，不会出现心灵的震动，与从前没有什么差别，这就是解悟的状态。解悟时意根还会把持着身体和觉知心，身体就不会发生变化，觉知心也不会发生变化，还会与从前一样，烦恼照样烦恼，心里不能清净，无明不能破除，仍然要迷惑颠倒。</p><p>二、五蕴的变化由意根控制和决定的，真正的断我见和明心时，意根明理，不再控制身体，知道身体不是自己的，身体就有解脱的反应，意根也不再控制觉知心，知道不是自己的，觉知心就如释重负，就会出现各种殊胜境界。睡眠是由意根控制的，以后睡眠也改变了，烦恼由意根发起的，这时烦恼也轻微了，还有很多奇妙的境界，只是不能一一透露。</p><p>现量观察远远比理论更有说服力，能现量观察的人，既有禅定又有智慧，而理论未必正确，即使正确也与自己无关。现量观察，意根证得，意根肯定，就能改变身心世界，才能得到身心解脱的功德受用。意根一旦肯定，就不需要那些无用的理论了。我们学法不仅仅要学理论，还要实际观察，现量观察，亲自证得理论的正确性，那么理论就会成为我们自己的现量境界，内心时刻与理论相应，理事无碍，以后就会事事无碍，就是大解脱。只有理论知识，不能让我们解脱，请诸位记住这一点。</p><p>三、知易行难就是解悟的结果</p><p>知易行难，关键是这个知落实在哪里了，是哪个识的知。如果只是落实在意识那里，那么行就不要谈，只是说说而已，行不了，作不得主。意根不知，就不能破除内心的无明黑暗，就无法采取相应的行动，其行就难上难。</p><p>意识知五阴无我，一点点解脱的功德受用也没有，所以初果人绝对不是意识知五阴无我，意根一定知，这样断我见才有功德受用，才能有初步的解脱，与凡夫就有了一个明显的分界线。如果初果人是分证解脱，有一分解脱的功德受用的话，五阴无我之理一定要意根证得，仅仅是意识证得，不会有功德受用，意根没有分证解脱故。</p><p>四、理解而非证得的状态</p><p>甲的观行经验：刚才突然感觉到，无我相，无有一切相，各种境界都是镜花水月，虚幻不实。只有真如心性，是一座宝山，可以生万法，没有形象，如如不动，心性清净，却是心不贪爱，无得无失，也没有我相。(虽然这些只是理解感觉的，但心还是清净了点)。</p><p>解析：理解有深浅，感觉就有深浅，心清净程度就有深浅。深浅是什么意思？理解的深浅就是看这种认识在意识表面，还是在意根的深层次里。深浅程度涉及到意识和意根，表明意根与意识所认知的理念相应的程度，也涉及到了定的程度。观行思惟的越深入，定越深，意根与认知越相应，心越清净。</p><p>甲的这种观行经验，还是意识浅层次的认知，和暂时性不稳定的感受，很容易也很快就能退失下去，尤其是没有定和定力不足，很难保持多长时间。这种理解和感悟还没有涉及到意根，意根还没有证得这种境界，不与之相应。意根没有觉悟到的事理，感应就不强烈，或者根本就没有感应。</p><p>然而，这已经不错了，很多人学佛很长时间，一点感悟都没有，内心仍然很平淡，对佛法没有太多的领悟，也就很难改变什么。如果能再接续深入修习和观行，就有可能出现可喜的现象。以此为开端，继续观行，到一定时候就能证得五阴身的虚妄，证得无我，证得一切法的虚幻。</p><p>生活当中，处处都是我们观行的对象，只要用心，修行都能有所成就。所有的法，都是现成的，只要我们伸手去取就行了。但是能得到手，还需要一些条件，就是菩萨六度的修行程度。</p><p>五、若见诸相非相，则见如来。如果有人这样理解，对于自己所感知的一切（犹如电视屏上所显现的内容），能够时时处处意识到全部都是如来藏（犹如电视屏幕）里的材质和功能的幻化，那么此人是否就是证得了如来藏了？根本不是，还差得远。听说和想象，离实证的距离还是很大很大的，其中的差距就是菩萨六度行。</p><p>以上内容都是意识心最最粗略的理解，类似于道听途说，只不过这是从佛经那里听来的，或者是从哪本书中听来的，并没有实际证得，并非是现量观察到的，不管谁说都属于是理解，真正实际证得时不知道是几地菩萨了。那些内容经里讲，别人也这么讲，他人都讲出来的东西，就不属于个人实证的，个人实证就会知道的很具体很确切，并不笼统、概略和含糊。要证得如来藏在五阴身上具体起什么作用，要经过参禅，实际下工夫去参究，中间的过程要一点一点的摸索探究。如果不做功夫，凭自己的感觉和猜测，理解了一点点，实际上如来藏具体起何作用，根本不知道，一片茫然，那么所有无明俱在，没有智慧的出生。</p><p>认为一切法都是像电视屏幕里的一样，认为不等于实证和亲证，不叫证得，因为没有证据。认为一切法都是如来藏创造出来的，我们都活在一真法界里，这不叫开悟。佛一句话让众生这么容易就开悟，佛法简直太容易了，三岁孩子听到这句话也能粗略明白一点就算开悟了，那么成佛该有多么轻松容易，无量劫又无量劫的生死业障根本障碍不了什么，那么多的无明也算不了什么，实际上不存在这样容易的事情。</p><p>没有经过参禅，没有经过调查取证，没有收集过资料证据，意根如何能确认这些说法就是真理而加以信受？真正的证悟要知道第八识运作的细节内容，具体如何出生万法、出生众生五阴十八界的，这些都要懂，都要知道，菩萨六度都要修出来。不是说理解某一部分内容，那些部分是从佛或者是其他人讲出来的，再怎么理解发挥也不是自己亲自思惟参究证知的，没有现量观察，心不落地，心虚得很。</p><p>这种理解离证悟，也许需要一年，也许需要三十年，也许需要一百年，也许需要一万年，也许需要一个无量劫，那都说不准。意识理解出来的东西没有用，说消失就消失，细节连意识都不知不证，何况意根怎么能知和证，关键时刻还是意根来作主，意根没有确认，无明还在，意识所有的理解到临终时犹如儿戏一样，化为泡影，不能决定后世的趣向。</p><p>多在心里问自己为什么，把所有的为什么都解答出来，也许与证悟能沾个边，但都不一定是证悟。佛法就是这样神圣不可臆测。</p><p>六、解悟的弊病</p><p>问：为什么说学佛修行都解悟的话，真正的佛法就会渐渐消失灭亡了？我们绝大多数人连解悟也摸不着边，解悟佛法不也是挺好的吗？</p><p>答：举个例子来说，比如大家都买一本书来学习开车技术，或者当面听人讲解开车技术，所有人都把技术知识学会了，都觉得自己能开车了。可是却从来没有亲自开过车，从来没有摸过方向盘。然后这些人再写书著作，再教他人学习开车技术。那这样的话，开车技术传到后来，会变成了什么样子了？这种技术还有实际操作的价值了吗？那么以后还会有人开车吗？还有会开车的人了吗？这样以后，开车的技术是不是要失传，变成一种纸上谈兵的游戏了？</p><p>佛法也是这样，都来解悟，没有实证，一个传一个，到后来，连解悟的人也不存在，连解悟的佛法也变了形，真正的佛法也就失传了。这是佛所不忍看到的情形，作为佛的真正弟子，对此也会很痛心。</p><p>领悟理解和解悟有本质的区别。解悟是类似猜测出来如来藏大致起用的情况，不是现量观察出来的，不是如见眼前物一样的清晰。猜测出来的，意根还是不明，心里不踏实，不落底，容易被扭转。这样就无法观察如来藏的具体运作，不能出生真实的大智慧。一般性的理解领悟，是对知识的学习和掌握比较好，还没有进入实际思惟和观行参究阶段，对如来藏的运行还没有一点了知性，与解悟的程度相差还很远，与证悟的差距就更大了。</p><p>七、什么是现量比量和非量</p><p>现量就是对于法能够现前观察思惟，见的是法的真实相貌，确认的是法的当前状态，不会扭曲真实相。如果不能如实见到法的现前状态，不能如实的观察法的真实相貌，就会采取其它方法，如采取与参照物相比较对比的方法，这是比量，也许能够比较出一个正确的结果，也许不能比较出一个正确结果。比量如果要正确，有个前提条件，就是用来作参照物的法要准确无误，那么比较出来的结果准确率就能高一些，因为有现成的参照物，就不需要过细的思惟，所需要的智慧不多，所需要的定力不深，也可以没有禅定，就能比较出一个结果，准确与否不一定。</p><p>如果现量智慧不足，还可以采取另一个方法，那就是想象、幻想和臆测，可以沿着一定的思路和轨道，也可以完全想入非非，没有章法和逻辑，这是非量。非量是在没有什么证据情况下的思惟，凭空想象成分比较多，没有能力收集和掌握证据才不得不如此，可见非量所需智慧更浅，也不需要什么禅定。由此可见，现量需要相当的定力和智慧，其智慧是非常可贵的，是可值得信赖的，实证佛法就靠现量智慧。</p><p>在非量当中，由于没有证据，全靠意识的想象，就像天空中的风筝，也许有线牵，也许无线牵，在这当中，意根使不上力，意根的智慧无法像意识一样漫天飞舞，无法想象臆测，意识想什么就是什么，意根无法确认，因此不能实证，但不排除巧合和撞大运。这样意根的智慧不会增长，只增长意识的智慧。再遇到不相类似的问题，不能举一反三，意识只好再重新非量一番，说明其智慧增长很有限。</p><p>在比量当中，拿两个事理相比较，主要靠意识的推导排比作用，意根的智慧使不上多大的力，意根也只能旁边看着，其结果意根无法真正确认，虽然不排除比量正确的结果，但也解决不了意根的心疑，意根的智慧不会增长，只增长意识的智慧。</p><p>比如一颗参天大树，想要得到其高度值，有三个渠道，一个是现量观察，一个是比量，一个是非量。采取非量的方法就是没有什么根据的思惟想象猜测，对于树的高度没有什么经验，不知道如何比较，更不知道如实观察，其结果可想而知，恐怕连自己都不能确认，何况他人。采取比量的方法，就是与旁边的电线杆相比较，与高楼相比较，与山体相比较，然后得出一个大约值。其结果就是心里半肯定半不肯定的，表面上可能要自信一些，但如果有人非要较真，或者有更确切的证据来否定，心里就没底气了。当然如果有人也同意这个结果，心里会增加一些底气。</p><p>除此之外还有一个渠道和方法，就是现量观察，但是这非常不容易，需要很多的证据资料，需要丰富的经验，观察力要敏锐要准确，心思要细密，数据要准确。而有丰富的经验，有大量准确无误的数据资料，这需要下一番苦功夫，经历了相当一段时间的探索，其辛苦常人难比，其观察时的定力常人难比，因此最后的智慧也同样常人难比。这样的人是娑婆世界尤其是末法时期是非常少的，万里不能挑一，千万里不能挑一。</p><p>在探索收集数据的过程中，意根一直都在观看，慢慢受着熏染，当意识一旦得出一个结论出来，非常有信服力，意根再经过自己的思量，就会确认下来，因为有理有据。意根由于智慧浅没有分析能力，就相信证据充分的，相信现量境界。其实这个结果也是意根自己得出的，一切数据都摆在那里，非常现实，意根自己就会起思量，就有结论出来，只有自己得出的结论才能确信不疑，当然自己是最信受的，不管别人如何说，自己都能果敢承担，没有商量的余地，也不容易撕毁自己的结论。</p><p>由于现量观察是这样的辛苦和不易，追求短期效应怕吃苦的人不愿意长期辛苦探索，修行时间短的人定慧都不足，都无法累积足够的经验，无法相应于现量观察。因此喜欢比量和非量，喜欢臆测和比对的人非常多，因为这些方法都比较省力，所需时间不用多久，也不用多少定力和慧力，就能有最后的结果出来，这多么轻松，这些人只要结果，中间的过程不需要。</p><p>而恰恰中间的过程非常重要，这是提炼证据的过程，是熏陶意根的过程，是降伏各种烦恼心的过程，是量变到质变的过程，没有这个过程，就没有质变，自心烦恼永远不能降伏不能改变。所以有一些人到处打探结果，企图不经过辛苦参究的过程而轻而易举的得到果实，这个果实就不是自己的，无法享用，自己仍然是穷人一个，再妄称法王，只能遭到诛杀，后果可怕。</p><p>说到这里，有的人会问，你说了半天还是没有说清楚如何是现量观察，可是我告诉你，别人所说的现量观察，自己知道了，就是比量，已经不是现量了。真正的现量就需要自己亲自去观察，去认证，所以打探出来的结果，猜测出来的结果，非常不可靠，即使是从现量观察者那里打探出来的结果，也不属于自己的，如果是从比量者那里打探出来的结果，那就更不属于自己的，更不可靠。再辗转传播结果和打探结果，更加虚无缥缈，其结果就很可怕了。在此郑重警告一些不愿意下苦功的人，只有亲自参究，才能亲自得果，自在用果，否则就是苦果，这个苦果是完全要自己亲自受用单独受用的，果报不虚。</p><p>八、比量再正确也不是现量的实证</p><p>禅定和智慧都不足的人修行才运用比量和研究的方法，定力强的人喜欢参究，不到黄河不死心，大智慧者完全现量证。尤其是具有一切种智的佛世尊，一切法都是现量知，不用比对比较想象和揣测，言语都是肯定表达，没有犹疑。只有禅定不足的人，观行智慧不足的人，无法如实参究，才用比量推理的方法，认为这种方法能证得佛法，实际上不是证得，是类似于猜测。当然猜测是意识的功能作用，接近于解悟。意识的解也很重要，只是还要修好禅定，在禅定中深细思惟观行，之后才可能现量证得。</p><p>如果仅仅停留在比量的解悟上，就没有功德受用，遇见一切人事物理时，都需要意识帮忙再进行比量的分析思惟，这往往是后知后觉，意根突然反应错了还要再纠正过来。即使比量再正确，推理再正确，也不是现量，不是实证。实证当下就能见到，虽然不是眼睛所见，意识的见也是当下之见，不用推理和比较。这就是现量的意思。</p><p>意识聪明的人都能进行逻辑思惟推理，但不能代替实证。五阴十八界苦空无常无我，必须当下就能感知到，不能比对不能推理，比对和推理的反应就慢了一步，靠意识的强行灌输和牵制作用不得不如此，一旦意识功能软弱下来，或者意识消失，牵制作用没有了，就不能知道五阴十八界是苦空无常无我的，这样就没有解脱的功德受用，中阴身就不能借力，后世更不能有功德受用。</p><p>同理在大乘法上，如来藏的运作必须当下就能观察得到，不能比对，不能逻辑推理，要知就知，不能现用意识考虑和分析，这不是现量。只有当下就知的法，才是实证，才能有效应，才能有感应，才能受益，才有解脱的功德受用。当下知的法，意根一定是知的，不用意识点拨。意根不知的，才用意识逻辑推理和分析比对猜测。</p><p>意根的实证，类似于直觉体验。没有禅定就没有直觉体验，即使惊吓之时，也有短暂的禅定。七觉分就是实证佛法必经之路，其中的喜觉分、猗觉分和定觉分，就是在实际修行当中逐渐出现的，都与禅定有关，是次第禅定。没有这个过程，不要谈实证，要信佛陀所说，信佛语没错。而意识的分别思惟能导致意根的直觉体验，功德也很大。在修行过程中，两个觉知性都不能离开，都很重要。</p><p>但是如果没有禅定意识功能过于强大，就会掩盖遮挡意根的思量性，这样解悟很容易，实证就非常困难。所以过去的禅宗祖师都反对意识太活跃，也反对禅定中死坐而不起观行思惟，意识的作用恰到好处很难。比如固定的工作两个人来做，如果甲做多了，乙做的就少，原理即如此。如果意识强大，活着时能依靠意识，一旦意识活动弱了，或者意识灭了，意根无可依靠，那时全靠意根。大家想一想，临终和后世，意根没有强大起来，那是什么样子？意识强大的目的和结果应该是让意根强大起来，如果意根不强大，将来怎么办？意根软弱，我们就软弱。意根一旦非常强大了，不用意识也能运作，比如六根互用，六根互通。</p><p>九、佛法实证一定要现量观察</p><p>佛法实证不是依靠比量，而是依靠现量观察，不是靠推理推测和推论，也不是靠研究，而是依靠禅定中的观行和参究，这样得出的结论才是现量，才是可靠的，才能发现真理，证得真理，从而得到真实的受用，断疑生信。</p><p>所谓比量类似于猜测，猜测正确的时候不会多，猜对的比例不高，即使猜测正确，也不等于现量观察。比如看到山后冒烟，于是就比量猜测推论，认为一定是山那边着火了，实际上不一定是着火，也许是正在熏湿草等等，不一定出现火苗。再比如看见女人怀孕就认为一定是有过了淫欲才怀孕的，实际上有高禅定的人入胎可以不经过淫欲，五祖投胎即是如此，唐朝宋朝有一些禅定高的禅师投胎也是如此。</p><p>还有极多例子说明比量不等于现量，比量完全靠意识的理解，意识的比类，意识的推理，意识的推测，只要意识聪明一点就可以做得到，这并不难，世间有小聪明的人多的很，难在现量观察上，这才导致无数人修行求解脱，真解脱者如凤毛麟角，真正的圣贤人永远永远是极少数人，圣凡不成比例。</p><p>推测推理出来的结论，不等于实证，即使推论正确了，正好符合事实，也不能断疑，没有解脱的功德受用。比如说凡夫众生都认为自己的五阴十八界是真实的我，表面上看每个凡夫众生都没有疑问，都确信了，但是如果众生真真正正确信了这点的话，那为什么佛陀开示五阴无我，有些众生却起疑了，并且去修定观行参究四圣谛理，最后断了疑，证明自己从前的认知是错误的？可见众生所谓的确信不疑也不可靠，否则佛陀要如何度脱众生？同理，很多人的意识推理推论和研究，心里也没有断疑，早晚还要推翻自己推导出的结论，真真正正的实证。</p><p>再比如科学家经过种种科学手段的研究，得出一个结论，这个结论即使所有人都认同，也不一定是事实，不一定是真实的。否则后来的科学家就不会经过更现代化的科技手段推翻前面科学家的结论。如果科学家的推论研究都是正确无误的，都是符合事实的，那么科学家应该完全与佛陀一样有大智慧，能完全探索出宇宙的真相是什么，知道世间法的实质是什么，其结论应该不违背佛陀圣教，都会成为佛法中的圣贤，成为众生的导师。事实却不是这样，他们都有很深重的无明，仍然是十足的凡夫，不知道法界实相为何。</p><p>由此可见，推理推论研究等等的比量方法，不能用于佛法修行当中来，不能当作实证佛法的手段。推理出来的结果，即使自己很信受，也不是真信受，意根有疑不决，自己也不知。命终就会见分晓，那时再回头还来得及否？</p></div>"
},{
    "title": "第八章　禅定在修证过程中的作用",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第八章　禅定在修证过程中的作用</strong></p><p>一、定力不足的悟就是解悟</p><p>在参禅和观行阶段，不仅要用到意识，最主要的是要用到意根。功夫没有用到意根这里，都是情思意解，即使明白，也是意识明白，往往都是理解。凡是没有定力的情况下悟的，意根没有参与参究的过程，没有参与观行，没有念念都在参禅上，可以说百分之百都是解悟，或者仅仅是理解理解而已。</p><p>如果没有定力，或者是定力不足，千万不要参究，更不要企图悟入。在这种情况下悟，就是解悟，真不如不悟。这样子悟了以后，一辈子不死不活，卡在那里，上不去，下不来，道业再也无法进步；而且还会增长慢心，造作恶业，将来就会悔之晚矣。</p><p>诸位切记，宁可不悟，也不要解悟，夹生饭非常难吃，即使回炉，也很难熟透。定力不足，被人引导又引导，启发又启发的，就是因缘不具足，一般来说，悟也是解悟。</p><p>我们遇见任何一种佛法，一定要学会辨别那是解悟的方法，还是证悟的方法。凡是不用特意修定就能悟的方法，就是解悟的方法，因此一定要避开，不要用这种方法，恐怕以后要得不偿失的。</p><p>二、定力不足，看文章就像走马观花一样，定力足时，心里那个认知度就非同小可了，足以震动心脏，震动五脏六腑，感觉非常不寻常。有些人走马观花看一遍文章，不能细致思惟，就贸然否定，结果最后还是自己错了。错在哪里？没有定力，不能思惟观行，心思太浮浅，即使引导，也仍然不能观行，智慧不可能逐渐提升，不能日日增进。前世善根不足的人，看什么法也不会受惊吓，平平淡淡的就过去了，好像真懂了一样。</p><p>有定力时，思惟细致，才能受触动，这叫作深有感触。看看我们古老的华夏文化内涵多么丰富，用词多么准确，把身心状态都能描述得清清楚楚、透透彻彻。都有一定的科学依据，有生理学依据，佛法并不孤立，就看大众是否有智慧如实认知。深有感触的深，就是深入到意根深处了，不是浮浅的表面的意识思惟，才有感触。一般性的思惟，没有感触，不会有感慨，更不会感慨万千。</p><p>三、证得阳炎观的时候，遇到任何境界，根本不用思惟，直接就过去了。真正断我见时，禅定力足时，也不用思惟，直接就把境界空过去了，不会正视这些所谓的境界的。而解悟的人，由于缺少禅定，加上慢心，遇到境界时，也许比凡夫烦恼还重 。</p><p>可见意根的证得和意识的解得，不可同日而语。有禅定与无禅定之间的差距，是相当大的。实修是修什么，我们应该知道。在真正证得任何一种法，有禅定力的情况下，任何问题都不是问题，任何事情都不是事情。一旦失去禅定，那就不好说了，大水也许就会决堤，冲毁烦恼的堤坝。</p><p>有修没修，从事情上看，不是从口中的语言上看。语言可能说得高大上，行事有可能是卑劣下，差距就是这样的大。语言文字与意识相应，这不代表修行，行为直接与意根相应，这才代表修行，所以修行就是修意根，没有修到意根的时候，都不是真正的修行。所有的知见在稍微大一些的烦恼面前，尤其是在生死面前，都无能为力，知见根本抵挡不了烦恼，更抵挡不了生死。</p><p>四、一般人的意识除了在睡着以后断灭间断，没有意识的识种子出生，其余时候都有意识存在，识种子没有断绝过。只不过是识种子分布在各个法上，并不集中罢了，所以了别慧力不好，智慧不好，思惟不细密。修定是让意识的识种子流注在少数或者是一个法上，了别势力大，智慧强，这是一方面。</p><p>另一方面，也能促使意根少于作意攀缘其他法尘，定在少数法尘上，作意集中，心思细密，思量清晰，能出生智慧，从而证法。但是要做到第一方面，必须降伏意根，因为意识的识种子流注的集中与否，在于意根的作意和思心所，意根的作意集中于一处少处，思心所不在更多的法上拣择和造作，意识的识种子就不散乱流注了，意识就能有专注，就能有禅定。</p><p>比如身根慢慢的运转，意识定于身根的活动上，意根也作意于身根的活动上，就把意根拴住了。这样意根专注身根的活动，少于攀缘，如来藏就很少现起其他法尘，不让意根分散注意力。这时意根意识就会发现，身根活动，就像机械化的一样，像木偶似的，这并不是我嘛，这样不由自主的，根本不是我，于是就能断身见。其实意识早就知道身体不是我了，不用修定也知道，就是意根心里不能确定而已。修定就是为了让意根定，能专心思量意识得出的结论到底如何。意根要现量观察，来证明意识的结论如何。在身根活动缓慢的过程中，意根终于观察到了机械化的身根确实不是我，不属于我，于是小乘顿悟，豁然大悟。</p><p>五、为了断我见，平时要多观行五阴的活动，在六根触任何六尘境界的时候，分清五阴，观察清楚五阴的作用，思惟其苦空无常性，努力确认其无我性。带着定力观行，慢慢的，缓缓的，深深的，仔细的，一点一点不急不躁的。这样用功下去，总有突破自心障碍的时候，总有冲破无明的时候，总有扭转顽固的意根知见的时候，那时候，修行就初步成功了。</p><p>在有时间并且环境条件许可的情况下，身根的活动要尽量慢，越慢越好，慢成机器人最好。在这当中，心能很寂静很细致，观察身根的活动，识心的活动，会感觉机械化，不像是自己所为，感觉有些不真实，自我的观念就会淡化，就容易断身见和我见。</p><p>再观察身根活动当中的识心，身识在做什么，意识在做什么，意根在做什么。旁边辅助的眼识在做什么，耳识在做什么，鼻识在做什么，各自如何生起，如何运行，如何紧密配合，最后又是如何转移如何消失的。观察和寻找识心的来处和去处，再观察各种心念的起处和落处，一直追踪下去，一定要见个究竟。其结果，一是能断我见，二是能发现来源地，明心证悟。</p><p>六、识心的思想活动，包括受、想、思，都是识阴。其活动就是行阴，行阴也是识的功能作用。把识阴的受想思的功能作用，都找出来，思惟观行其生灭变异无常性，思惟观行其苦性、空性、无常性。把这些性质凝聚成一个点，深深的悬挂在心里，交给意根，行走坐卧都要悬挂着、深思着。</p><p>禅定要好，心要定要清净，就能与法相应，时节因缘具足，钝根的意根就会开窍：原来识阴觉知心生灭变异无常，根本不是我，我不是这样的，于是就断我见了。离开禅定，缺少禅定，就不会出现这样的认知，不会断我见。</p><p>七、禅定不仅仅属于六识的境界，也属于意根的境界，而且主要是意根的定，离开意根的定六识都没有定。意根如果没有定，五遍行心所法就不能集中于六识应该专注之处，如来藏就不能配合意根的思心所只在意根作意处流注六识的识种子，就不能有六识的专注。意根如果没有定就不能起深细思量，也就不能证法，不能断除烦恼，不能得到解脱。</p><p>如果禅定只是意识境界，那么意根同时攀缘八件事，意识必然要随着意根去分别八件事，意识如何能定？意识想定，意根却不愿意受束缚，意识如何能自主定得下来？况且无想定里没有意识，那么定就不是意识境界吗了，灭尽定里没有意识，定就不是意识境界了。</p><p>了生死是意根了，解脱是意根解脱，所以证法意根一定也要证。意识是前行前导，是引路人，最终还需要意根自己走路。</p><p>八、意识心还不能理解的道理，是因为思惟观行的还不透彻深细，还需要再作具体深细的观行思惟，这就需要禅定的辅助了。还要修集福德，菩萨六度或者五度，都得要修好。因此就要常常检查自己的六度修到什么程度了，还差什么条件，差多少，自己都要清楚。修出定力来，才有力度仔细思惟佛法，那时思惟就会很深细，佛法当中的甚深之理就能明了通透了。</p><p>有定和无定，思考问题，其力度差别很大。没有定，内心就很浮躁，思考都是浮皮和表面的，不能深入到问题的实质和核心，不能认识到问题的根源，不会获得深细的智慧。意识心还不是很全面透彻的明了时，是因为意识还没有全面、系统地思惟观行五阴无我之理，所以意根也不会受熏，更不会明了，等意识思惟观行透彻了，意根才能知道。意根一旦懂得，就会从内心深处断我见，这个力度是相当大的，其心行就能发生很大变化，那么修行就初步成功了。</p><p>九、在一切法的参究上，一开始是意根配合意识的思惟分析，配合意识搜集各种数据和资料；等到意识把资料搜集的比较充分，足够意根利用的时候，意识就要配合意根的深思熟虑，配合意根的加工和整合工作，配合意根的审察过滤工作，让意根多费心思，意识少活跃，参究工作就能很快完成。</p><p>要想让意识少于活跃的思惟，意根多思量，就要修定，在定中才能保证意根的专心参究，虽然祂不能完全定于一处，能定于极少数法上就可以了，除了需要专心参究的法义，其他的只是稍稍了别一下就可以，不影响自己参究。那么参禅就是要在定中，意识不能情思意解，多动用意根的思量性，充分有效的发挥意根的思量，亲自证得如来藏，这就是参禅的奥秘。所以意根不证法，不可能明心证悟，同样也不可能断我见。在定中参禅，动用意识的思惟比较少，动用意根的思量性要很多，所以才容易证悟，这是参禅参究的奥秘。</p><p>十、意根相信事实，只有见到事实真相，证据确凿心里才能确认，这是意根的体性。意识灌输给意根任何一种理论，让意根相信和认可，不能只是一个最后的结论，主要还应该有思惟推理的过程，有证明过程，没有证据，事实不确凿，意根心里无法确认。</p><p>而让意根现前观察，现量证得，相信事实，必须让意根自己亲自在五阴活动当中观察思量。这就要修定，让意根专心思量，不分散注意力。这是修定的奥秘和原理。意识即使没有多少定，也能通过学习认识到所学理论的正确性，而意根不行，祂不轻易相信意识所学的，祂一定要亲自证明才行。</p><p>告诉意识一切法都是如来藏的作用，都是真如，意识很容易就相信了，很快就能明白一切法都是真如，都是如来藏的用。可是意根无法体会，无法现前观察，无法证明，也就无法相信，无法确认。这就必须让意识深入思惟观行，意根借助于意识的观行，而起自己的思量，进而对意识的思惟结果有个认知，就能证悟了。证悟必须在定中观行，减少攀缘，意根作意在意识观行的法上，作意在意识思惟的内容上，意根才能发现事实，发现真理，从而顿悟。而意识是一点点明白的，是通过思惟，慢慢分析出来的。</p></div>"
},{
    "title": "第九章　如何确保意根实证",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第九章　如何确保意根实证</strong></p><p>一、在一切法的参究上，一开始是意根配合意识的思惟分析，配合意识搜集各种数据和资料；等到意识把资料搜集的比较充分，足够意根利用的时候，意识就要配合意根的深思熟虑，配合意根的加工和整合工作，配合意根的审察过滤工作，让意根多费心思，意识少活跃，参究工作就能很快完成。</p><p>要想让意识少于活跃的思惟，意根多思量，就要修定，在定中才能保证意根的专心参究，虽然祂不能完全定于一处，能定于极少数法上就可以了，除了需要专心参究的法义，其他的只是稍稍了别一下就可以，不影响自己参究。那么观行就是要在定中，意识不能情思意解，多动用意根的思量性，充分有效的发挥意根的思量，亲自证得五蕴无我，这就是观行和参禅的奥秘。</p><p>所以意根不证法，不可能明心证悟，同样也不可能断我见。在定中参禅观行，动用意识思惟要少，动用意根的思量性要多，这是参禅观行的奥秘。</p><p>二、西方心理学家说过，让潜意识记住东西的最佳途径，就是进入一种昏睡的朦胧状态，或者一个类似睡眠的状态。在这种状态下，所有意识层面的努力都减少到最低限度。然后，所有想法都能够通过映像，以一种安静的、被动的、易于接受的方式传送到潜意识中。</p><p>这是熏染意根催眠意根的好方法，断我见，降伏烦恼，可以用自我催眠这个方法，也是最快速而有效的方法。自我催眠，能直接让意根了别和接受五阴无我性。</p><p>放松，安静，昏昏欲睡，刚刚醒过来，这些时候都有定，心不散乱；同时还有意识，意识思惟力比较微弱，有了别作用，作用力小，能观察意根，能向意根传递信息；而且意根的作用比平时突出，比平时大。那么这时影响说服熏染意根，改变意根，是最佳的时机。断我见的观行，在这种状态下，也是最好的，有定，有意识，意根作用力大，受影响的力也大，那就能把五阴非我的思想观念，传递灌输给意根，让意根认可接受。</p><p>三、怎样观行能取所取空断我见</p><p>能取的是七识，所取的是六尘万法，观察能所空要在定力比较好的情况下才能观行思惟。前提条件是：第一，禅定要具足，第二，五阴虚妄的道理要粗略的了解，再按照所了解的内容，次第观行思惟，把能取的七识心的空性观行出来，要观察清楚透彻。内心要认可六识的虚妄非我性，把所取的六尘万法观察清楚透彻，包括五阴世间法，都要观行出其虚妄、生灭、变异、不实性。</p><p>六尘的虚妄容易观行，杂阿含经里，世尊教导过如何观行六尘的虚妄，边阅读边思惟六尘是如何的虚妄，一条条逐个思惟观行。随文而观，随文而思惟，思惟通透了，就能认可那些道理。不思惟不观行，意识只粗浅的知道那些道理并没有用，有逻辑思惟能找出依据和证据，来证明理论的正确性。观行出来时，内心就会说：哦，原来如此！意根就认可了。</p><p>观行总有个过程，到最后内心会说：原来是这样啊！这时是真知道了，这是意根的认可，否则就是意识心的肤浅的知，意识的知往往没有多大用处。道理很多人都会说，实际上自己的内心并不认可，因为这些道理意根不懂不明白，不知道究竟为什么。意根要明白要懂，意识心就得思惟观行这些理论的内容，观行的过程就是在潜移默化的影响意根，告诉意根：是这么回事，是这个道理，论据要充分。意识分析的每个内容都传递给了意根，意根就能了知这些内容，就能明理；意识不观行不思惟，意根不知道，就不能断我见。</p><p>四、意识在观行五蕴时，观行的信息同时就传递到意根那里，意根一次不懂，二次不懂，时间长了，就能理解和受熏，同意意识观行的结果，这是意根启动自己特有的思量判断性的结果。如果有禅定时，意根也能根据意识观行思惟的思路，自己作以思量，或者与意识一起思量，或者单独思量，意识把证据找得越多，道理说得越清楚，熏染意根越深刻，意根越能单独进行思量，从而与意识一起共同断除我见，共同证果。</p><p>五、在观行陷于沉思的时候，里面就有意根的深思行为；来回踱步思考时，有意识的思惟，更有意根的思虑考量。其中如果意识的力量大，意根的力量就小；如果意识少用心思，意根的力量就大，解决问题也有力度。</p><p>意识与意根的交流方式一般是用自问自答的方式。不管是谁问谁答，最后都是意根认可赞同，意根作最后的定夺和抉择，问题才算解决。</p><p>观行五蕴、参话头和参禅、参究，都与自问自答是一个原理，都是两个识之间密切配合的关系。意识存在时，两个识刹那都没有分离过，意识所思所想都受意根指挥，从来没有脱离过意根的操控和配合，从来没有出现过意识单独思惟，意根不参与的情况，如果意根不参与，意识就灭去不存在，意识不能脱离意根单独运行。</p><p>而在没有意识存在和思惟的时候，意根仍然可以单独工作，从来没有休息过。遍计所执，时时思量处处作主，即使在睡着和昏迷以及死亡前后，意根也没有清闲过。所以两个识如果没有密切配合关系，不可能破参开悟，不能断我见；如果没有意识的参与，就没有数据资料，不知道详细情节，证据就不足；如果意根不参与思量，其结果就是有问无答，那就没有答案，没有结果，就作为一个不解的问题存留在意根心中，以待意根慢慢解决，这就说不定是什么时候了。</p><p>六、意识的观察和想念，其过程和结果，能影响意根，让意根确信，也有同样的想和念，只要意根想和念成就，诸法必成就，因为有如来藏支持。意识所作的一切，无非是供意根作决策，指挥下一步的身口意行，无非是熏染影响意根和改变意根，除此没有什么实质意义，因为祂不作主，不是老板。意根是能作主的老板，老板后边有总裁，这个最厉害。</p><p>所以我们修学佛法，一定要起思惟，越深细越好，越全面越好，其过程就是让意根了解和确认的过程，没有过程，意根无法确认，一切法就不能成就，所以过程比结果重要。很多人学法只要结果，不要过程，那怎么能实证佛法，从而改变自己改变一切呢？</p><p>过程里有内容，有数据，有资料，内容齐全，数据齐全，资料齐全完整了，证据确凿，意根就相信，这就是实证。要想收集出完整的数据资料，起深细思惟，必须有禅定，心能专一深入，没有散乱。这是实证的必要条件，不可或缺。</p><p>七、意根也受意识的不正思惟影响和熏染，作出错误的抉择。无始劫以来意识一直在有意无意的欺骗意根，告诉意根五阴就是我，一切法都是我的，五阴世间美好而快乐，应该努力追求不舍，意识充当着邪师的角色，于是意根贪染于世俗五欲，执著五阴自己。断我见前后，意识就开始充当意根的良师益友，自己改邪归正以后，再帮助意根改邪归正，共同降伏烦恼、断除无明，共同转识成智，携手并进。</p><p>八、意识如果没有思惟过程，根本就说服不了意根，意根既无知又固执，必须摆事实讲道理，把所有的现量拿给祂，祂才肯承认事实。因为祂自己不能作深细的分析、归纳和整理，必须依靠意识提供证据。如果没有道理给祂，硬要祂承认某个理，从而改变祂自己，那是行不通的，所以必须对祂摆事实讲道理才行。反反复复观察，多方求证，推导出一系列的事实依据，让这些道理成为一种非常明确的事实，意识自己不得不承认，行蕴确实是无常无我，这是口服；再者，意根也不得不认可行蕴苦空无常非我，这是心服。口服心服以后，七识的心行才能发生根本转变，从此就能天下太平。</p><p>九、如何断除意根的执取性</p><p>如果把意根的执取执著性降伏了，往那里一坐，心里空空的，禅定就现前了，行住坐卧犹如在虚空里一样。执著减轻，身心轻安，所以空是先空意根，之后意识才能真正空，内心空空如也。</p><p>要想去除意根对五蕴的执取性，就要让意根在禅定的状态下慢慢的细细的，随着意识观行，让意根慢慢思量意识所观行思惟的内容，等意根真正思量明白，确定五蕴确实是空幻的，就证得五蕴无我了。单意识知道此理，意根不确定不肯定，不属于实证。意根没有定，散乱攀缘时，就没办法专心考虑法义，无法证得。意根有定，不散乱攀缘，心专而集中，才能思量观察，最后再确认，无明就断除了。</p><p>具体观行时，先观色蕴如何生如何灭，观受蕴如何生如何灭，慢慢而仔细的思量观察，慢慢的接受色蕴和受蕴的苦空无常。如果没有定，只有意识的思惟分析，而无法深入到意根，意根就不能接受此理，甚至会抗拒。</p><p>观察想蕴的生起与灭去，如喝茶时，观察对茶味的了知性是如何生又是如何灭的；听声音时，对声音的了知性执取性，是如何生起来又如何灭下去的。给意根一定的时间和精力，慢慢的静静的让意根思惟思量，让祂接受，让祂随意识的现量观察而起自己的思量。有定时，观行可以深入到意根，所有的法都是让意根接受认可，然后由意根决定改变，意根认为眼见才为实。</p><p>观察行蕴的生起和灭去，身口意行的出生和灭去，取茶沏茶喝茶一系列的行为都是行蕴。观察行蕴如何生如何灭，如何是苦空无常的，如何是无我的，然后意根肯定，就断除我见，后续的修行就是要慢慢断除我执。观行需要禅定，在定中让意根有充分的时间和精力思量法，亲自证明五蕴无我性。在意根处处攀缘非常忙碌的情况下，而听从意识所熏习的法义，根本没有精力去思惟确认。</p><p>观察识蕴的生起和灭去，眼见色时，观察眼识如何生起如何灭去；闻声时，观察耳识是如何生起和灭去的。一个识一个识这样观察，观察六个识的生灭、幻化、无常、苦、空、无我，一定要慢慢细致观察，深入到意根，让意根随着一起思考观察和认可；意根一旦认可，就能慢慢的放松对五蕴的执取，我执的断除就有希望了。</p><p>十、证悟类似于几何里的证明题，老师给出一道题，这是结论，需要中间演算推理证明过程，过程正确，推理严密，合乎逻辑，论据充分，自然就会得出与命题一致的结论。中间的演算推理，就是证明过程，这个过程代表学生的智商和知识水平，从过程当中推导出的结果符合命题，这道题就证明结束，成绩合格，或者给与满分。推导过程不严密，粗枝大叶有漏洞，就不能自然而然得出与命题一致的结论，不能证明命题的真实性正确性，强行得出那个结论，成绩就不合格。而结论早已摆在那里，是老师给出的，不属学生自己的智慧证量，只有过程才显示学生的智商和知识水平。</p><p>同理，在佛法中证明某个佛陀给出的结论也是这样。比如佛陀告诉众生五阴苦空无常无我，这是结论，需要弟子们经过自己深细思惟观行，才能得出与佛陀的圣言量一致的结论。思惟观行的过程中，内容是否详细，观行是否符合逻辑，是否能充分说明问题，是否能让意根确认，这是极其重要的。</p><p>而不是说，佛陀给出的结论，我们再重复一遍甚至百遍，就代表自己证悟了。即使重复一亿遍，没有中间思惟证明过程，也只是鹦鹉学舌罢了，没有智慧的显现，没有智慧的证量，因此不是证悟。</p><p>大乘方面也如是，佛的任何一句话都是结论，都是命题，需要我们每个弟子在禅定中细心思惟参究去加以证明。参究思惟的过程代表每个人的智慧证量，没有过程只有结果，那就是抄袭佛陀的圣言量，不是一个证悟者。</p><p>再比如佛陀告诉众生色身是苦的不是我，这是一个结论，也叫作真理。那么弟子们就应该在禅定中观行思惟，色身究竟如何是苦的。如何两个字，里面内容极其广泛，需要弟子们广泛而深细的收集证据，然后综合思惟整理，以证明色身的苦性。然后再思惟为什么苦的就不是我，为什么三个字里面有无数的内容，需要弟子们收集出来，都找出来，再加以思惟整理，以证明苦的色身确实不是我。这样证明以后五阴无我的观行就告一小段落，还有四个阴需要如此观行思惟。</p><p>在观行思惟参究过程中，一定要多问自己为什么，之后再回答出究竟为什么，把所有问题都要解决掉，不能留给其他人，更不能留给佛陀去解答。谁解答得出，谁增长智慧，谁有智慧证量。而能问出为什么，也代表智慧，没有智慧就没有疑问，合理的问题合理的为什么，更代表了一个人的智慧，那么正确如理无误的解答，当然更是一个人的大智慧的体现了。这个智慧一显现出来，得出的结论符合佛陀的结论和教导，那就是证悟了。</p><p>世俗界里有十万个为什么，我们学佛修行人，对于遇到任何法，也都要多问为什么，把一个问题穷究到底，搞得水落石出，必能出生智慧。而每日口里喃喃念叨佛语，并不代表自己的智慧和证量。比如口里念念叨叨一切法都是真如，都在一真法界里，中间没有思惟观行的成分，不知道究竟为什么如此，念叨一万年有什么用？佛法不是这样修的，佛法是需要证明的，需要极多极多的证据，这些证据需要在禅定的思惟观行中获得。多问为什么，就能积极主动的寻找证据了，总有一天会证据确凿，水落石出，意识意根都能开窍，豁然开朗，顿然大悟。</p><p>十一、断我见证果与眼见为实耳听为虚的道理是一样的</p><p>佛处处都在开示给我们一个真理：一切诸法皆悉空寂。意思是说一切法都是空的、寂静的，为什么如此说？因为一切法都是各种因缘聚合而有，本没有自体性，并非是真实存在的法，因此说是空寂的。从另一方面说，所有一切法都是如来藏所幻化出来的，由如来藏所主导，是如来藏的影子，实质是如来藏，没有一切法，因此说一切法皆悉空寂。小乘的空，大乘的空性，都在指示这个真理真相。</p><p>诸根如幻，境界如梦，观行这些法，要有较深的禅定，在各种境界中，在六根对六尘中，体会根与尘的虚幻性、不实性、不作主性、没有自体性，定慧要相结合，完全融合在一起。仔细观行，眼见色中，眼根如何的不自在，色尘如何的虚幻，如何像影子一样；耳听声时，声音这个境界，如何像梦一样，耳根怎么像幻化的一样，如何生又是如何灭的，如何起听觉作用的，观行好了，就能证得五阴空幻，寂静不生。</p><p>对于这些法的观行，初步的理解，不等于是证得。理解比较容易一些，意识心思惟一段时间就觉得理解了，但这不是证得，实证要有禅定，要在定中甚深思惟，要证据确凿，要深入到内心深处的意根，意根认可才叫证果。意识理解的都属于知识，没有证据或者证据不足，那都是想象，不是证，必须经过深细的观行，意根在内心深处真正认可那个理，才算证果。</p><p>那时候由于是真正证得认可五阴无我，六根虚幻，心行就改变，对万事万物的看法就转变。真认为自己是虚妄的时候，心里肯定要发生变化，不可能与从前一样，还是老样子。而意识理解的，没有证得，内心不知道五阴确实是无我，对自我的认知就不改变，对五阴的看法只是停留在理论上，心行还是一如既往，烦恼还是原来那样重，不能断除三缚结，三恶道不能免。</p><p>这与世俗法所说的眼见为实耳听为虚的道理是一样的，听别人所说相当于意识的理解，并没有证实，自己心里还是很虚，不敢肯定是否真实。之后，眼见了，自己才真正的知道了，就会说：啊！原来如此！这时对人对事就知道该怎样处理了。眼见相当于意根的证得，耳听相当于意识的理解，这是两种截然不同的层次。</p><p>意识的理解是从他人那里听来的，意根的证得是亲眼所见，是现量知，是真实看见。理解的相当于道听途说，和实际的亲眼所见，差别很大。比如听说某个人如何如何，心里生起一种看法，有了某种印象，可是等见面一观察，原来是这样，与心里的印象不完全一致，见面时的感觉和印象更真实可信，然后自己才能对此人采取如理的态度。如实了解和观察以后，自己的观点、意见、想法、行为造作和听的时候就不一样了。</p><p>所以我们要用心熏习，熏习到内心深处，真真正正的去观行諸根如幻，五阴无我。观行的时候就是第六识的思惟分析，分析以后交给意根，意根胜解了意识的思惟内容，认可诸根如幻这个理的属实性，就证果。意根如果不认可意识思惟观行的理，那就没有用。要想尽快的让意根证得，就要多收集资料数据，证据确凿，尽量能达到现量观察的程度。观行的中间还有很多的程序，有很多的路要走，有很多的法要去修，要不断的修集各种资粮和道粮，需要不断的修集福德资粮，还有戒律、忍辱、禅定、智慧，不断的圆满这些六度的条件。</p><p>十二、用心养花，花花皆可养活；用心烧菜，菜菜皆可美味；用心交友，友友皆是善友；用心爱人，人人皆是亲人；用心做事，事事皆是好事；用心做人，人人皆是好人；用心念佛，佛佛皆是功德；用心降魔，魔魔皆可消除；用心求法，法法皆可明心；用心参禅，禅禅皆可见性；用心用心，心心皆是无心。</p><p>以上所做的一切活动，都有识心，没有识心的运作，就没有活动，不能养花，不能交友，不能做人做事，不能念佛，不能参禅。为什么在这些活动当中，还要用心呢？这里所说的用心是指什么？</p><p>五阴身一切活动，有意识主动，而意根被动接受的时候，这时候五阴身的活动虽然做出来了，但是意根都是被动的被意识所牵，并不感兴趣，也不明了那样做的原因，因此做人做事并不真诚，不是实心实意，这叫作无心而做。这种无心做事，无论善恶，果报都轻微。</p><p>做事时要想有一个最好的结果，果报殊胜，意识就要让意根明了其中真正的道理，熏染意根，让意根积极主动的决定去做，起主导作用，这样才是真诚的，实心实意的，如来藏配合，造就出最好的成果，存下最好的种子，后世的果报也殊胜。</p><p>有人也参禅，有人也念佛，有人也学法，有人也做事，有人也为人，可是意根在其中所起的作用不同，其结果就不同。意根在其中不真正用心，还稀里糊涂，还不专心，还到处攀缘，效果就大打折扣，果报不殊胜。</p><p>十三、意识思惟分析能力强，了别法尘境界比较深细，容易出生智慧。意识的智慧是通过接触环境，深入学习和细致思惟出现的，以此智慧能牵引意根走出泥泞，趋向光明大道，到达极乐家园。如果没有意识的引领，意根就要长期处于泥潭中，不能自拔，五阴身永久处于生死轮回中，所以意识是非常重要的。</p><p>十四、要想思惟清晰透彻，就要有一定的定力，缺少定力就做不到。在定中思惟又深又细，慢慢地，细细地，就能深入到意根，越深越细越慢，意根就越容易理解，而且祂也参与深细的思量才能有所触动，有真切的认知才能改变自己的知见，心行上就有个较大的转变。</p><p>意根也有比较微弱的了别慧，意识思惟得深细了，祂就能依之真正明了五蕴是无我的，从而知道了无我的真实义。意根原来就不这样认为，因为祂不知道这些道理，这就需要意识心多为祂进行深入细致的分析。</p><p>比如教育孩子时，如果不给孩子讲道理，只管强迫和动粗，他表面上虽然不得不服从，但内心深处不懂，祂就不能从内心深处认可，从而改正其行为，下次还要犯错。因此说服教育讲道理是必须要做的，理讲的越透彻明白，他越能接受和顺从，对待意根也是如此。</p><p>十五、意识思惟的过程，就是让意根明理的过程，这是必须要经历的一个过程。意识必须要思惟，而且要深思，如果不思惟，意根就不能明理。意识心明白的道理，意根还不明白，身口意行就不能发生变化。意根必须依赖于意识思惟的具体信息，起自己的思量，才能知道意识所明了的这些道理是否属实，如果意识心不加以思惟，就没有信息传递给意根，意根就了别不到这些道理，祂就不能明理，不能促使其观念发生变化，身口意行也不能改变。所以我们修学佛法就要善于思惟，好好利用意识心，如理如法的思惟观行，修行佛法不能让意识总是处于无念想无觉知的状态，不能让意识闲着无用，那样我们就不能深明正理，智慧也不能得到增长。</p><p>十六、为什么很多人知道五蕴是空的，而不能断我见</p><p>不能断我见的原因，是因为前期的意识，没有把五蕴虚妄的内涵思惟透彻，交给意根的资料不全，意根对此内容模糊不清，无法参究和认同，意识可能也不知道资料不全，不会思惟和不能收集证据，意根巧妇就难为无米之炊。再加上意根的攀缘心没有降伏，禅定力不足，因此就没有参究成就。很多人也没有开始参究，因为前期的意识没有把工作做好，意根无法接续工作。</p><p>意根是裁判者，是检验者，是把关者，意识所有思惟分析的数据，都要经由意根的检验，即使意识分析得再细致入微，再精确精准，意根也得把关检查才能放行认可。比如下属的工作人员，做好了一项工作，交给领导审批，领导不能不看一遍、检查一遍、审核一遍，就定为合格发薪水，最少要过目一遍，严格的话，要审核一段时间，作以调查，确信无误了，才能盖章。意识与意根的关系就是如此。</p><p>十七、如何成功的熏修意根</p><p>熏修意根，就是让意根认可某个正确真实而如法的道理，这个熏修的过程，就像是在做一道数学证明题，我们把一道题的原理不断剖析化简，这个剖析的过程就是给意根找证据、熏意根、让意根明了的过程，证据确凿，意根就被说服了，最后意根就证得了此理，承认题目的正确性。这类似于从已知条件出发，结合已知的定理，加上严谨的思惟推理，最后得到一个坚定不移的结论，就是证。这个过程就是求证的过程，证也叫作求证，求是推求，求是意识的求，后边有意根的支持和合作，证是证得，是明白，是明了。</p><p>现在的问题是，我们知道了结论，五蕴十八界都是空，非我，但是意根不懂不认可，就得想办法证明给他看。证明出一分，意根就调伏一分、清净一分，就有一分受用，离大道就近了一步。修行就是这个道理，佛陀给了我们结论，也就是真理，我们就要想办法证明其结论和真理的正确性，然后自己就获得了真理，有了大智慧，就能得大解脱。</p><p>如果在修行当中身心不改变，就说明意识没有把证据拿给意根，意根不认可，祂就抓着身心不放，身心就不得解脱。所以自己修行的证明过程有没有效果，证据是否充足，就看身心有没有改变，遇到烦恼境界是否能过关，内心有没有更清净一点，是否有了智慧的认知；如果没有，就是证明不到位，修行没有成功，自己所掌握的就是理论，不是实证。检验是否断我见和明心见性，身心世界的转变是一个标准，是解悟还是证悟，这条也作为一个标准。</p><p>十八、意根和如来藏的存在，没有先后，无始劫前同时都存在，法尔如是，没有道理可讲。无始劫前因为意根的无明，不明实相，就起心向外攀缘，于是五阴世界出生，一切法也就渐渐的都产生出来了，于是是非纷扰不停，苦恼连连不断。修行就是让意根认可一切法都不是我，意识就要观行思惟一切法都不是我，大小乘理都要修学，学通达以后，最后才能证得一切法都不是我，所有的修行，都是为此打基础。所以说我心越重，越不得解脱，离成佛就越遥远，降伏意根的我性，任重而道远。</p><p>十九、意根对第八识的思量，要缘于意识的思惟和引导才能进行，意根不能自己自动觉悟到第八识。因为意根的无明根深蒂固，从无始劫以来就存在着，无始劫以来祂就与第八识在一起，却不识祂，还把第八识的功能据为己有。意识通过学习第八识理论之后，不断地熏意根，让意根也了别第八识的体性。意根了知第八识的体性之后有可能要想寻觅证得第八识，于是就决定参禅。</p><p>证得第八识以后，通过意识心对第八识的观察，意根就会思量第八识出生一切法的功能，思量五阴的无我性，思量六识的无我性，也思量意根自己的无我性，就能发起大智慧，认可五阴六识以及意根自己都不是真实的，这样就能断除对自我的执著性。也不会再把第八识的功能作用当作己有。意根的智慧就会越来越深，无我性越来越增大，无明越来越淡泊，心行越来越清静平等。</p><p>二十、怎样做到意识无念而意根参究？意识要把问题仔细思考一下，把问题的内涵了解清楚，然后把问题的整个意思凝聚成一个点，深深地悬在意根心里，这样就把问题交给意根了。意识这时可以思考，也可以不思考，有时需要思考，有时需要静静的不要思考。最好是能配合意根，不分散自己和意根的注意力，因为如果意识忙于其他事务，必把信息传递给意根，增加意根的负担，使得意根不能专心，无法思量出正确结果。</p><p>是否是意识把一个问题思考以后。就是交给意根思量了？意识把问题的来龙去脉弄清楚以后，暗示意根这个非常重要，一定要弄清楚，然后把问题的重点核心内容深深悬挂于心，就交给意根了。意根就会不断的思量，直到有了结果。很多时候，意识思考的同时就有意根的思量，定力越好越用心，意根参与的越多越深。而当意识没有思考出结果时，意根就不会放弃，就会单独思量，指不定什么时候就有了结果。</p><p>二十一、如何正确修行才能实证无我</p><p>既然要求证无我，获得无我的解脱，那就要知道什么是无我的，为什么是无我的。这个为什么是非常重要极其重要的。不知道为什么，只能是相似的理解，不是证得无我也不能证得无我。因为里面没有观行的过程和观行的内容，就直接接受了那个无我的结论，把那个结论直接当成了自己的结论，而不去用心思考究竟为什么无我，没有思考就得不到有说服力的证据，就得不出有说服力的结论，也就不能证得无我，只能想象无我，叫作情思意解。</p><p> 一般学佛人都是因为不懂得思考问题，不愿意动脑筋思考，不知道如何思考，思路也不通不清晰，于是就把从外学来的法，当成是正确无误的，而毫无疑问的直接接受下来。接受了以后，就觉得真的是那样，于是就幻想着自己也有相同的境界。很多人也就以为自己真的证得了什么，其实都是误会。现在佛教世面上认为自己断我见证果的人一大堆，认为自己已经明心见性的人一大堆，认为自己已经得到初禅以上禅定的人一大堆，好像越末法时期，越是圣人辈出，这真是一个极大的误会。这些圣人连最起码的思维观行都不会，就那样稀里糊涂的成了圣人了。因为这些现象太多了，见怪不怪，习以为常，也就不感叹了。</p><p>直接接受一个无我的结论并且修定，这是修行的基础和前提，还不究竟，应该继续观行思考，多问为什么，不要接受现成的答案和现成的结论。应该自己从头思考，一步一步都要问为什么，不要糊弄自己，不要欺骗自己。只要自己能思考有思考能力，哪管走错路也不白走，增长经验，识得对错。错路是正路的基础，只要不怕错，总有走正路的时候，思考一上路，证果是早晚的事。</p><p>很多人都把修定当成是全部的修行内容，不懂得思惟观行，就没有观行智慧。因为修定可以有些特殊的感应和很舒服和愉悦的身心觉受，很多人就贪着禅定，但不能证果，不能出生大小乘的智慧。真正修行必须在禅定的基础上观行思考再思考，只要思考动脑筋，才能从脑筋那里出生智慧，从而证得无我，有初步的解脱功德受用。很多人都不懂观行，于是就一味的修行禅定，入到定中一无所知，浑浑噩噩，糟糟懂懂，还认为这就是修行。还有的人，以为身心出现各种特殊境界，就是修行。其实这些都是修行的一个侧面，是修行的一部分内容，最主要内容应该是思考观行，然后获得解脱的功德受用。</p><p>而另有一些人，认为修行就是为了获得智慧，懂得越来越多的理才是正道，才能得解脱。于是就把意识理解的那点东西原封不动的倒给其他人，就叫作弘法度众生了，根本就不修禅定，成天手捧书本，不是背诵就是情思意解，看完书，理解了，懂得了，吸收了，就认为自己有智慧了，就已经证得某某果了。现在到处是果，看得人眼花缭乱的，什么果也不稀奇了。</p><p>很多人的学佛目的就不明确也不正确，追求自由自在，什么是自由自在没有搞懂，想要达到什么样的自由自在也不清楚，能否真的自由自在永远自由自在也不清楚。外道也能通过修定而达到所谓的自由自在，那就是各种神通境界啦，殊不知神通依靠禅定而有，禅定依靠色身而存在，依靠心的自律而有。如果不守戒行，或者色身消失，禅定就消失，神通就消失，然后就不自由自在了。追求无忧无虑和觉知安详，就更是虚无缥缈，不可靠的了。那都是依禅定，依觉知心，依意识心而有的一种暂时的心境，可是任何一种心境都是生灭变异法，前提条件消失，心境就消失，业障凡夫，谁也不能保证心境总是如一不变的。</p><p>二十二、初学佛的人都有疑问，有疑问不解决，就会障碍道业的增进。那就应该想办法解决疑问，其一是要从他处请教解开疑问，其二是请教之后要自己通过思考，寻找证据，再亲自解开疑问。明明有太多的疑问，不去解决，而是一味的修定来遮盖疑问，那怎么能解除疑问，获得智慧呢？为了不把身体当作我，就去想象着把无情物当作自己的身体，各种想象，却从来不思考为什么色身不是我。这样还是有个色身的我，还是有束缚不得解脱。然后这个色身我见没有断除，就去想象识心的功能作用不是我，这些想象还是贪爱美好的感受，是换另一种想象的乐的感受来代替目前苦的感受。没有仔细思维观行所有的受为什么都不是我，不是真实的，为什么是生灭变异无常的。不这样如理思惟，而是逃避现实，在想象中享受，也是一种贪爱和束缚。以后的内容都是如此，想象和情思意解，没有观行体验和过程，这不是真正的修行，是逃避现实。</p><p>数理化比较好的人，逻辑思惟力非常好，正好用到佛法的观行上，比较实用。而文人墨客，学佛全靠研究和情思意解，不懂观行，不会如理思考，结果文人墨客因为他的理解力研究力好，文字水平好，虽然什么也没有证得，却一篇篇的理论文章横空出世，搞得人们眼花缭乱，都被迷惑住了。世上有几人是开眼者，有如孙悟空般的火眼金睛，看破一切伪装，还原一切真相？</p><p>学佛修行，不是追求什么果位，去求取什么果子吃，而是要真真实实的获得解脱的智慧，心地要达到解脱，这是修行的根本目标和目的，追求果位和虚名，就是舍本逐末，本来没有解脱，现在又加上一个束缚，给自己再增加一道绳索，何苦呢？追求虚荣，还不是一个我吗？怎么能断除我见呢？末法时期众生福薄，修行都是颠倒着修。明明是要破除我见，却时时在增加我见，明明是要无我，却处处都是我。修行的实质意义都没有弄明白，也不想弄明白。学佛还是为了一个我，我要如何如何，这是背道而驰，追求越多，跑得越快，越多造作，离道越远。</p><p>断个我见真的很难，不是一件容易的事，不是像有些人那样，看几本书，揣摩揣摩，然后就把无我的果揣进兜里了。还早着呢，还远着呢，八万四千里的长征才刚刚开始，急着得果，还是个我，不出我心之外。我要证果，我要证果，有这个我，怎么能证果？我要成为圣人，我要成为圣人，有这个我，怎么能是圣人？</p><p>二十三、当你心里说，这一切都不是我的时候，要问问自己为什么，多问几个为什么。如果说不清楚，再继续观行。一定要多多自问自答，这样才能有证据，证据确凿，才能发现事实，发现真理。真有疑问，就是意根生疑，祂不懂，想要弄懂，这是好事。就怕没有疑问，那离见道就太远了。</p><p>二十四、断我见需要证据，证据确凿才行。意根的习气也不要太重，无明不要太深重才行。如果意根非常愚痴，即使所有的证据都摆出来，证据确凿，意根仍然认原来的死理，那就不能断我见。意识不断的观行思惟过程，就是不断扭转意根的愚痴无明的过程，意根的无明薄一些了，才肯认事实，否则事实明晃晃的摆在面前，也没有用。</p><p>二十五、如何训练意识引导意根观行</p><p>训练快速睡眠的方法，首先意识暗示意根放松，就是让意根不再执身，不再让身识和意识执身，不再让五识和意识多有造作；然后意识暗示意根不要再想，就是让独头意识不再生起。如果意根服从意识的暗示，六识就会渐渐减弱，渐渐灭去。要想达到理想的效果，主要在于意识会引导，意根能听话顺从，就能达到目的。</p><p>断我见也是如此，意识要有足够的智慧引导意根，意根心性得到有效降伏，能顺从意识的思惟和引导，需要意根不要有那么强烈的我见和我执。在平时就应该训练意识和意根少考虑色身，少执著五阴的功能作用，贪执要减轻，才有办法渐渐空去色身的感受。意根太执我的时候，是没办法引导和观行的。意识也应该多了解身见的内容是什么，我见的内容是什么，这样才能有方向有目标的观行和反观；如果身见和我见的内涵和范围不知道，就没法观行断身见和我见了。</p><p>二十六、如何做参究功夫</p><p>有禅定能保证思惟观行参究很专注，不会思惟一会儿心就散乱了；没有禅定思惟就没有头绪，思路也不清晰。做功夫参究的过程非常复杂，意识和意根的识心活动非常深细，如果弄不好，不会做功夫，参究就不出结果。要会用功夫，把参究过程中的识心活动搞清楚，就知道如何用心如何做功夫了。</p><p>意识和意根共同参究时，五识也有一定的作用，否则就处于二禅境界没有五识，意识微弱，这样也就不能思惟观行，不可能开悟。如来藏也在其中起相应的作用，否则就没有七识存在。</p><p>参究时意识要把需要参究的内容理解透，生起疑情，凝聚成一个点，交给意根，让意根也生起疑情，禅定具足时，就能精进，行走坐卧朝思暮思，不破解疑情决不罢休。</p><p>为什么要把参究的内容凝聚成一个点呢？因为意根没有语言文字，也不能分析，如果不把整个意思凝聚成一个点，就有语言文字，意根无法参究，只能由意识单独思惟分析。而意识单独思惟分析程度比较浅，不能出生甚深的智慧，也就是意根不参究就不能有智慧出生，意识的慧不起决定作用，意根也有智慧时，才能把握好五蕴的方向盘，才能决定五蕴今后的命运。</p><p>二十七、不管意识知道多少法，意根不知道就要起疑，心里就不会踏实和落底。为了解决意根的疑，不让意根再疑，所以不要让意识单独学知识，满足于意识单独的知，应该两个识一起参究，触证了以后，两个识都知道，就没有疑了。断疑生信，不仅要断意识的疑，更要断意根的疑。</p><p>所以学法意识尽量不要去猜测，要在禅定中与意根一起参究。意识的疑浅，意根的疑深，疑越深，解决之后越释然 ，智慧越大，身心越能转变。</p><p>二十八、开悟的过程</p><p>学佛开悟的过程，说难极难，说容易也容易。说难是因为扭转和改变意根固有的认知，让祂接受一个真理真相非常不容易。说容易是因为其中的步骤并不复杂，只涉及到意识和意根的认知问题。首先是意识通过学习，知道有个如来藏常住五阴身中出生一切法，反反复复熏修让意根也知道有个如来藏是真我，是真正的主人。但是意根肯定会怀疑这件事，认为自己就是真主人，一切都是我作主说了算的。</p><p>为了去掉意根的疑，就要先让意根证得五蕴十八界都不是我，包括意根自己也是生灭变异的不是真实的，这样意根就会确立一个依托，承认有个如来藏可以依靠。再下一步就是意识和意根共同参禅，参究如来藏。如果是意识自己参究，那叫作推理推测，叫作情思意解，得出的结论就叫作理解或者是解悟，获得一种没有禅定水滋润的乾慧，解行无法相应，无法解脱。要想让意根与意识共同参究，必须有禅定，用疑情和话头拴住意根，截断意根的胡乱攀缘和思虑，让祂朝斯暮斯的缘虑疑情和话头，有朝一日，定能明心见性。</p><p>悟道的方法就是从意识下手深入到意根，把意识所思惟的内容落到意根让意根理解，需要意识这个传令兵传信息的时候要有善巧方便，心细有智慧，思惟周到严密，充分吸引意根的注意力，调动意根的积极性，让意根没有退路，只有认真思量审批认可的份儿。意识把收集到的信息组织好之后交给意根，之后最好是安静等待，随时听候意根的吩咐，不给意根惹事和添乱，这就需要相当好的禅定了，让意根在定中没有干扰的思量参究，这样参究的效率是最高的。</p></div>"
},{
    "title": "第十章　如何发挥意根的功用获得更大的智慧",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第十章　如何发挥意根的功用获得更大的智慧</strong></p><p>有人搞科学研究说我们的大脑每秒种有5次来扫射外面的环境，那他说的这个就是指意根了，但频率不是这样慢，仪器测量不准确。意根时时刻刻、刹那刹那都在攀缘着六尘境界，所谓的攀缘，就是那个研究报告里说的条件反射，就是这个扫描。条件反射属于业力、种子、习惯性反应、神经等等各方面的东西，属于意根作出的反应。意根接触的一切法都是如来藏变现出来的，如来藏变现什么，意根就能缘什么。意根太伶俐了，攀缘性太广，祂所能缘的东西，意识心不一定都知道，意识心有很多内容都不知道。</p><p>意识心知道的东西没有意根知道的范围广，意根缘的范围相当广，你看这个业力方面，如来藏给你弄出来了，神经系统方面，各个方面，身体方面、生理方面的事情，如来藏都给你变出来了，变出来以后，意根先缘，意根缘了以后，有的时侯祂就会直接作出反应。为什么直接就有反应？一个是事情太重大，再一个是祂的惯性使然，尤其是涉及到身体方面的和有关自己的，祂的惯性作用就能很迅速表现出来，根本不容意识发起思惟作用。</p><p>那项研究使得我们对意识心和意根的体性有更深一层的体会，并且对如来藏所变起的一切相分，有更深一层的了知，就会知道这些相分都是意根所缘。意识心了别的范围还是比意根小一些，等到什么时候可以了别的更多呢？等到了意识心有妙观察智时，修到几地菩萨以后，祂了别的范围和意根了别的范围就能够相接近，成了佛以后，可能两者了别的范围内容都差不多了。那意根能缘到的法，第六识也能缘到。如来藏所变起的所有法，意识心妙观察智，也能够了知。</p><p>那项研究表明，当一个人的心静下来，安静下来时，就会有灵感显现，这是什么意思呢？当心安静下来，静下来时，意识心比较深细，比较微细了。就是说意识心不太现起粗燥的思考分析的作用，但是有没有意识心的存在呢？这里还是有意识心，只是比较深沉，不容易发现，反观力稍微弱一些。因为意识心已经澄清下来了，没有粗的分别，传递给意根的信息也就相对少了，传递的内容也比较深细，意根这时也就会清静下来。</p><p>当意根清静下来以后，就要发挥其应有的作用。意根也有了别慧，也有思心所，也会思量，意识心把了别的内容传给意根，意根就会深层次的思量，这时候意根所起的作用就比较大一些，慧力能比平时强一些。意根起的作用大，就能把事情思量明白透彻。意识心的思考主要是在浮层上，如果深细的思惟，这里面还要有意根思量的作用。意根虽然了别慧劣，但是意根还是能作了别，能作思量的。</p><p>所以心静下来了，意根的思量作用发挥的也就大一些。意识深细了别的内容传给意根，意根思量的就能够清楚。于是我们就有了灵感，就会说：“啊，原来是这么回事。”这个时候意根就明了了；否则就是意识心肤浅的思惟认知，意根未必了解和认可。所以，在我们静下心来思考问题的时候，往往意根也会了知这个道理，意根就会确认所思量的法，就好像是有灵感一样了。</p><p>一旦意根思量过后明了了，那么我们就把一件事情彻底弄清楚了。不用再浪费精力，费心思惟考虑，这件事就解决了。那么我们参禅的时候就应该要这样作，观行思惟五阴十八界的时候就应该这样观行。把意识心澄清下来，让意根也更多发挥思量的作用，灵感现前，意根会证得相应的法，那么我们就断我见。参禅也是如此，静下心来，意识深层次的思考，传给意根，意根经过自己反反复复的深细思量，最后确认。祂一确认这个就是第八识，就是明心证悟了。否则意识心在浮层思考分析，这么回事，那么回事，意根不懂，不明了，祂就不能证得第八识。</p><p>这就证明禅定的力量是很大的，禅定又叫作静虑，静虑也叫静心思惟，能够过滤那些浮层的杂思乱想，把浮层的杂思去掉，就能进入深层次的思惟。而深层次的思惟，就是意根的思量，意根发挥的作用相当大，就能把诸法的实相搞清楚，把一件事情的真实义理参究清楚明白，这个时候就是证悟了。如果只是意识心浮层的分析，那个分析就不可靠，往往是猜测想象的成分多，达不到事情的本质和根源。</p><p>如果能够静下心来，意识不是作简单的浮层的分析，而能够深入细致地参究观行，那么两个识互相配合，互相通讯交流，就能把事情彻底弄清楚，搞得水落石出。意根发挥自己本有的那种潜意识、下意识、惯性的力量，那么这两者一配合，智慧生起来，就会解决问题，一切事情都能通达明了。</p><p>那些情绪激动的人，都是在意识心的浮层认知事理，不能深入细致了解参究，意根也不能很好地思量，那就不能认识事情的本质，作出的反应往往就是错误的。所以说意识意根配合越密切，越能充分发挥作用，参究越深入，越细致，就越能认清事物的本质，从而证得佛法的根本。</p><p>把一个问题常常悬挂在心头，并不刻意的去分析思惟，有那么一天，就能把这个问题解决了。这就类似于参话头，就把话头深深地悬在心里，不要刻意分析、思惟、理解，除了睡眠，心里都是话头，意识和意根都在深深地思量，到一定的因缘时节，真相大白，这个问题就参究明白了。深深地悬在心里，虽然表面上看没有动念，没有思惟分析，但是意根却时时和这个话头相应，意识也并没有把这话头撇开，只是思惟得又深又缓慢，动得很深细罢了。</p><p>话头悬在心里，越悬越深，那么意根就越能发挥作用，时时刻刻都起思量性，二识合力，就能证得第八识，这就是参究话头和参禅的方法。参究明白，就具有了无分别智。无分别智就是明得了第八识，证得了第八识时所获得的智慧。第八识是不分别的大智慧心，证得祂，就有了无分别智。</p></div>"
},{
    "title": "第十一章　问答",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章　问答</strong></p><p>一、问：证果和明心时的相应，到底是个物理结果，还是化学结果？断我见，是意根对五蕴虚妄的认可，这个认可如何量度？开悟明心也与意根相关，意根一面是实证自己不是真实的；另一面是实证了如来藏是真实的。五蕴虚妄与意根虚妄，是个层次递进，最终剩下的那个真我是谁都无法否定的。这样思考路线对吗？断我见，会有身心的变化，这个身心的变化就是断我见相应的量度？   </p><p> 答：相应，主要是心的相应，那到底是物理还是化学结果？因为这时是相应到了识心，识心的认知改变，认为五蕴非我，如来藏真实；心又与身相通，二者紧密相连，也就间接的相应到了身；相应到了身，就有物理和化学结果。因为是意根认可五蕴非我之理，意根又能控制身心，身心转变，就涉及到了物理化学成分的转变。色身就出现轻安舒适、睡眠少、内心喜悦、一心、无烦恼、无杂念、觉明现起、禅定增长等等一系列身心改变状态，持续时间比较长一些，几个月、半年、一年，定力好的要超过一年。</p><p>如果不是意根证得无我，意根不相应，只是意识肤浅的知道一些无我之理，不深透，那就没有这些身心上的反应，没有身心的变化，或者只有一点点的些微变化，很快就消失不见了，定力很难生起。这是因为意根不相应无我之理，内心没有震动，不能让身心发生变化，不能改变身心，与从前差不多状态。</p><p>很多人都说自己断我见了，可是身心没有什么觉受，没有变化，禅定没有现起，觉明没有，只是一些理论。可是这些理论在哪里都能找得到，这就很奇怪了。以前我一直苦于无法检验他人是否断我见，后来观行到了意根的运作，又结合自己当时的身心觉受和状态，就逐渐总结出了真正断我见，是什么状态，应该如何检验。</p><p>对于开悟明心，也应该有个量度，不能简单的说智慧增长就可以了，肯定也有身心方面的变化，而且仅仅是意识的智慧增长还不究竟，意根的智慧必须也要增长，直至意识与意根都转识成智。明心见性比较容易检验，因为有个如来藏在哪里、在何处运行、如何运行的标的。但是每个人检验的尺度也不同，在于检验者的证量如何，本身的态度是否严谨，要求标准是否严格。</p><p>如果弄不好，就把解悟当作证悟。如果检验者是解悟，那就糟糕极了，这个被检验者就太不幸了，他的智慧今后很难很难再增长。如果在一个有证量的要求严格的检验者手里，这个被检验者，就能大幅度的提高智慧，提高证量，后续的修行，相当快速；因为能现量观察如来藏的简单而大概的运作，这个智慧是了不得的，接近于别相智了。</p><p>如果没有断我见，而直接明心见性，也得有相当程度的觉明，否则也是解悟，不是证悟，因为没有身心觉受，意根就没有认可，身心都不会改变。如果已经断了我见，再明心，可能就没有太强烈的觉明和身心觉受了，因为几乎也经历了那个阶段，否定了五阴自己。如今解悟的人可不少，禅定不足，观行不细，只能理解，也有一些智慧，可是无法现量观察如来藏的简单运行。</p><p>从越来越多的法义的观察思惟整理中，寻找到了意根更多的运行秘密，意根的运行与禅定关系很大，定越好，意根的作用越突出，越有实证，意识少于浮浅的思惟分析，证量就高。在浮躁的现世社会，主张并强调修定，是一剂修行证果的正途良方，能扭转大众修行的浮躁，更利于实证，减少口头禅的泛滥，否则佛教就要渐渐趋于灭亡，没有实质的修证了。</p><p>二、问：有漏凡夫的意根，应该了别慧很低，主要是自我我欲，我执为主的习气，但是没有很好的分析判断力。所谓的决定，就是对于意识告诉他有利、对自己不利等等的分析，作一个决定性的方向选择，意根的作用主要是方向选择吧？</p><p>答：意根的体性、功能作用很多很重要，祂有五遍行心所法：作意触受想思，所以意根也有自己独特的思量性，独特的了别性，也有祂自己独特的分析判断力，有时其了别和判断是非常敏捷、非常快速而准确的，是不容轻视和忽视的。意识对意根的引导，不完全在是否对自身有无利益这个局限里，其范围相当广泛。</p><p>比如断我见的观行，意识要观行五蕴虚妄，分析思惟五蕴如何是虚妄的，是空的，是无我的，如何是苦的，道理思惟得清楚明白，事实呈现的越多，越能熏染意根，意根越容易认可。还有参禅，各种观行等等，都不涉及对自己利与不利，但是都能熏染意根，改变意根，让意根认可，从而获得智慧。</p><p>三、问：我们每天呼吸的次数，眨眼的次数，心跳的次数，包括行走每一步，每一个动作，都是意根的决定以及意根决定之后的结果，这些加总起来都没有意根作决定的次数多。可见意根在生命中的作用。有几次我利用控制呼吸，看意根的作用，利用控制眼跳，看意根的作用。如果可能，都能找到控制生命的机关，都在于意根。</p><p>所以说意根是修行证果的枢纽机关。如果把这一切秘密揭开了，也就把修行证果的机关揭开了，也就把生死机关揭开了。这些都在于意根，但是如何做，效率最高，路径最短。了解了枢纽，抓住了枢纽，控制了枢纽，最后取证。这就是纲举目张的纲，修行的纲就是意根。</p><p>答：生死自在，在于意根。四禅八定修出来，就能生死自在，说走就走，说留就留，阎王老子管不着。这就是意根在控制生死，同时有禅定配合，否则说食不饱。</p><p>在身根的每个作用上，很容易就能找到意根，在每个心念的转换上也容易找到意根，在每个法识别的转折点上，也能找到意根。总之，意根时时处处在起用，刹那刹那在起用。</p><p>意根的法，意根这个开关，现在已经打开了，源源不断地冒出来，依之修行，真是捷径，不会再走弯路了。定力随之就能上升，心随之就深沉安稳下来，证法是必然的。</p><p>四、问：断我见是意识反复、深入、如理作意的观行，由意识为意根举证五阴如何的虚妄，最后由意根首肯。这是一个举证、说服、再举证、再说服的循环过程。意识将观行的证据都逐渐的呈送给意根，最后由意根首肯认可。这个认可也是相应吗？断我见也是一种与意根相应否？ 首肯的含义和相应有什么区别？</p><p>答：通过意识反复深细的思惟观行，把所有的证据依据全部而逐渐的呈现给意根，意根思量过后认为证据确凿时，就能确认和认可。这个认可就表示意根醒悟了，与五阴无我之理相应了，证据越充分，呈现的现量境越多，意根越认可和相应。因为意根承认现量境，与非量的想象不相应，意根只要证据。当意根与无我之理相应时，就会认为：哦！原来如此。因为意根不知道自己五阴的一切法都是虚幻的，现在证据都摆在面前，不得不承认此理。从前都是意识或多或少的知道一些无我之理，可是意根不知道，因为慧浅，了别境界能力不足，不能深细思惟。</p><p>意识的分析思惟理解的内容属于解悟，这是因为定力不太好，没有深入到意根，意根不明理；如果定力好，意识的思惟就能深入，少于表面肤浅的理解，意识动得慢，就能调动意根的力量，让意根的思量性起用；那么意根自己明白了，意识肯定就明白了。定浅意识分析成分多时，意识虽然容易明白，但是呈现给意根的证据不足，意根自己的思量性也不足，意根就不明理。</p><p>意识少于分析用心，交给意根多用心，多思量，就能证悟五阴无我。意根确认的这个力量是非常大的，能改变自心，改变身口意行，改变业行，改变业种。这样修行是走大捷径。想要意根多用心，现量证得，就要深入禅定，意识少动，这就是参究的原理。古来禅师都是这样教导学人离心意识参禅，不要分析，不要情思意解，可是其中深深的道理他们不一定懂，不知道这是意根的功用，与意根相应。因为意根的运作属于唯识种智的范围，很多禅师并没有生起唯识种智。</p><p>所以断我见的原理也与参禅的原理是一样的，也利用意根，让意根暗自用功思量五阴无我性，意识在定中思惟深细，动得慢和深，这样就能深入意根，然后才能与无我性相应。把意根的所有功能体性作用都挖掘出来，修行就是大捷径，而且是最大的捷径，我们就能跳跃性修行，成佛就非常快速了。</p><p>五、问：前七识中，真正的一家之主是意根。一般人认为是意识作主，认为只要是意识理解认可的事，就是自已的智慧境界了。但断我见证果乃至明心开悟这件事，非同小可。是要意根否认自已的真实性，这与意根无量世来累积的深厚我见、我执烦恼是根本不相应的，不管意识如何思惟佛法，熏习正知见，对意根来说所起的作用是很小的。在这件事情上，最有说服力的是让意根能够现观，就是在禅定中，让意根现观五蕴七识的虚妄生灭性，面对现量境界，意根不得不承认五蕴非我，如此，才算是真正断了我见。明心也是这样，也是要让意根现观如来藏的运作，承认有这个真心的存在。</p><p>打个世俗方面的譬喻，有些人从小受唯物主义的教育，说到宗教信仰，因果轮回等，你怎么说他都不信，还说你走火入魔了。但只要有人示现一下神通，立马就信了，比谁都信，一般人都认为眼见为实。证悟也是如此吧？</p><p>答：眼见为实，就是意根证得，眼不见，只是听说，意根不相信。从眼见为实、耳听为虚这个词语上，我们就能知道，是意识心单独的证得还是意根同时证得，当然是同时证得。眼见为实这个词汇用的太好了，这样就能把意识和意根分清楚了。真正的相信，就是证得以后的事，没有证得时，只是意识听说，没有见到。见到时，意根就相信了，因为是亲自证得了。</p><p>以此类推，断我见，证得无我，也是同理。意根只认现量境界，意根不证得，不见到，就不相信。耳听为虚，就是意识听说，意根不相信，心里不敢承认。越来越明了，只要真实用功，佛法其实是不难证得的，以后不懂的问题，慢慢都能懂得了。</p><p>断我见和明心时，意根在干什么，是什么心态，是什么心行，是什么智慧，把这个弄清楚，就出生大智慧，后续的观行，就如日中天，光明朗照，智慧一发不可收拾。在断我见和明心开悟时，也是意根作主，因为无论哪个法，都是意根作主。意识观行时，其观行内容刹那刹那传递给意根，但是意根不会轻易认同和相信，不认同不相信，就是意根不懂，没有证得。意识一旦呈现出一个事实或者是现量境界，意根马上认同和相信，就作主说：对，是的。意根在任何一个法上，任何时候，都是作主的，不可能在断我见和明心时，祂不作主了，绝对不可能。那么断我见和明心，就是意根现量的证得，意根相信，意根作主决定。这是毫无疑问的了。</p><p>六、问：看话头，是意识在看？还是意根在看？如果是意识在看，传导给意根，使得意根心念趋于专一，不再或很少攀缘，逐渐制心一处。意根也有了别，减少了攀缘，意识专一。此时，如果福德具足，因缘际会，忽而一念相应，识得如来藏才是主人，这是否是参禅明心之路线图？</p><p>答：说得对。看话头是修定方法，修定的目的是让意识专一，不分散精力，专精思惟参究。可是意识了别的内容，思惟参究的内容，都是意根指使的；如果意根不但缘话头，还缘很多法，对很多法都感兴趣，那么意根对很多法作意和思，如来藏就会出生意识了别意根所作意和思的很多法，那么意识了别这么多内容，还能专一吗？那就不能专一，不能有定了。</p><p>参话头，目的就是让意根只缘话头，不再或少攀缘其他法，让意识达到心念专一。修定表面是修意识，实际上还是降伏意根，让意根不要缘太多的法。参话头就是尽量把意根栓在话头上，这样意识就定下来了。意识有定，思惟就深细，意识熏了意根时，这时意根也对应话头，参与思量话头。</p><p>如果参话头深入意根，让意根养成习惯，把参话头当成必做的工作，那么在睡眠状态中，意根也要工作，让意识在梦里也参话头；并且让意识行走坐卧都参话头。意识定深，思惟少时，意根作用突出，暗中缘话头不断，因缘时节具足，就能证得如来藏，明心证悟。如果定浅，意识的作用大，意根少参与或不参与，往往情思意解多，解悟成分多。</p><p>一切皆意根。意识是缘生，意根遍计执，如来藏无知无觉。意根的遍计执，使其慧蒙尘，不得显发，只有让其心念专一，不攀缘或少攀缘，就能成就。所以修定非常重要。</p><p>七、问：我感觉让意根认识到五阴非我，好像让我舍弃色身似的，为什么心底里有种莫名的害怕呢？</p><p>答：那是意根因为无始劫以来一直认为并且执著五阴为自己，这个俱生我执很强烈。所以意根总是害怕失去自我，害怕没有我，害怕一切都不是我，祂会牢牢地抓着五阴自我，不肯放。当我们的意识心稍微认为五阴可能不是我，不属于我所有的时候，意根会产生抵抗心理，或者会产生害怕的心理，祂就害怕落空。如果能够同时告诉祂，五阴无我以后，不是空无，不是断灭，还有个不空的真正的我。那个我永永远远存在，永远不断灭，那是真正的我，那么意根就会愿意断我见，就容易认可五阴不是我了。</p><p>观行五阴无我，要有个过程，这个过程就是要意识长期观察思惟，熏习意根，然后让意根明白懂得这个道理。意根越是无明，越执著我，断我见越难。所以我们平时要多思惟佛法，多思惟五阴无我性，多思惟不生不灭的真正我第八识，到一定时候心里就能认可了，那时候就会断我见，逐渐得解脱。</p><p>八、问：二乘人断我见后，初果好像也有部分妙观察智的生起，至少也有部分无漏智生起，那么是否第七识也发生一些变化了？另外初果后七返人天可以到无学位，如果再发一下大愿，修菩萨行，会不会很快就到真的八地。这样的话，小乘的人从修行到见道，再到八地，比起大乘的三大劫是不是反而更快了？</p><p>答：因为断我见时，是意根断除了我见，意根见到了真实理，祂的知见就扭转了一些，心行就会有所转变，就有最初步的解脱功德受用。</p><p>小乘修到四果，相比菩萨修到八地，要容易很多。但是即使是四果罗汉，转入大乘法当中修行，要具有大乘法的根基和智慧，要有大乘菩萨的心行和心量，这是非常不容易的。因此阿罗汉修学大乘，不一定要比菩萨从明心证悟和入初地以后的修行要快，快慢这是不一定的，要看智慧、心量和福德。</p><p>如果没有一个标准，没有一个定位，凡夫也能出现妙观察智，要看哪种程度的妙，妙到什么程度算作妙。如果每个人都有自己的妙的标准，那就无话可说。就像说一个东西好，一个人有一个标准，互相不服气，都以自己认为的为准，那就无所谓，不作任何评判。 </p></div>"
},{
    "title": "结 语",
    "author": "生如法师",
    "date": "2018年09月09日",
    "html": "<div class=\"B1_text\"><p><strong>结     语</strong></p><p>很多现代学佛人喜欢搞研究，尤其是文人墨客和各类学者，其实研究是意识心的工作范围，类似情思意解。实际上佛法的修证，绝对不是搞研究，也不能情思意解、意下卜度，过去禅宗祖师们也最忌讳意下卜度。可是现在都已经公开意下卜度了，大摇大摆的卜度和情思意解，都不老老实实的真真实实的做功夫，眼看着佛教渐渐变质了，有什么办法？</p><p>俗世间生活节奏变快，快餐很时兴，吃得人们身体都不健康。佛教也随顺潮流，搞快餐，结果思想都变得不健康了，呈现出来的是一种病态，却不自觉知，反倒彰显病态为美。佛教快餐是由大众浮躁的心绪而起，其结果是更加的浮躁，油嘴滑舌、不务实修之人颇多。所以佛教不是研究的宗教，是需要求证和踏踏实实一步一个脚印修行的，因此是需要放舍身心的，是要从内心的骨子里彻底幡然醒悟的，是要身心从头到尾从里到外全部转变的，这样才能真正的转识成智，才能出现一个全新的自我，出现如佛那样的五蕴世间。</p><p>修行路长，慢慢来，有时真是急不得，重要的是，要把佛法的基础打牢固，不能急于求成，不能在沙滩上建高楼大厦，没有地基，无论建多高的高楼，将来都要倒塌。咱们学法，应该踏踏实实，不能追求快速明心见性，否则后果很严重，对佛教对个人都不利。希望大家在因缘不成熟时，在缺少福德时，不要急于参禅，不要急于明心，基础不牢就是在建空中楼阁，恐怕有一天就会坍塌。快速开悟的弊病慢慢都会出现，道业增长得很慢，慢心也极容易生起来，那是最障道的，也许还会造恶业，将来就要受恶报。</p><p>大家在因缘不具足时，不要追求快速开悟，应该多思惟观行无我之理，扎扎实实的把我见断除，对自己对他人和团体，都大有好处。如今世间人烦恼特别重，都是因我而来，我见一彻底断除，烦恼就轻微，造恶业的几率就小了。而明心时没有把我见彻底断除，还会因为我而造作恶业，却不自知，也许还会理直气壮的造作恶业，还以为是善业。可见真正断我见的功德受用很大，这是学佛修行最重要的一个环节。</p></div>"
}]