[{
    "title": "内容简介",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>内 容 简 介</strong></p><p>金刚经是继心经之后又一部家喻户晓的般若经典，讲述众生那个如金刚般的不坏心体。此经对中国震旦的学佛者影响力非常大，读诵背诵此经得到感应和加持力的人也非常多，可见这部经是极其重要的。历来讲解金刚经的著述者很多，层次不一，由于佛的智慧深不可测，讲解者证量又有限，不能贯通金刚经的甚深义，大多都在表层来解佛意，没有证悟的依文解义者又更多，致使大众不能深达佛意，无法依之证悟，也得不到实质的利益。</p><p>本书从唯识种智的深度来阐述金刚经的甚深义，力求以浅显易懂的语言让大众理解和信受，依之参究，能稍微容易证悟，不至于绕很大的圈子还弄不清楚里面的玄机，徒费精力。金刚经中修证之理极深，层层递进，即使证悟以后，要达到金刚经所要求的深度，还需要接近一个无量劫的时间，甚至要两个无量劫之久。因此说菩萨修证任重而道远，需要心空再空再再空，犹如剥芭蕉，一层一层剥尽，直至空无所空。祝愿所有大众心空如金刚般若心！</p></div>"
},{
    "title": "第一章　全篇概述",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  全篇概述</strong></p><p>金刚经是六百卷大般若经的精华，全文讲述众生那颗金刚不坏心的真实体性。金刚是世间最坚硬的一种宝，任谁用何力也毁坏不了；反之，它却能摧毁一切。世尊用金刚之性喻每个众生的真如心体，再恰当不过了。真如心体之不生不灭性，远远超过了金刚的牢固性，金刚是世俗物质色法，世界毁坏时，它也不复存在；而金刚心如来藏不随世界毁灭而毁灭。因为金刚心如来藏不怕水，水淹不着；不怕火，火烧不了；不怕风，风吹不坏；三灾奈何不了祂，最现代化的武器也奈何不了祂。十方世界所有众生的金刚心都是如此，不生不灭，永不毁坏。</p><p>因为有金刚心的存在，才有众生一世又一世的五蕴色身的出生和灭亡，除非众生断了我见，又灭掉我执，对于三界（欲界、色界、无色界）的贪爱和执著都断尽，命终入无余涅槃，把五蕴十八界都灭掉，以后的五蕴才永远不出生了。但金刚心体还是不灭，自己独存，不靠外缘。所以金刚心才叫自在心，不需要依赖他缘祂自己就能单独存在，不需要谁来产生和变现。但是菩萨们证得解脱果，却不入正位，七地菩萨前不取证四果，就不会入无余涅槃，菩萨们还要生生世世利用五蕴色身来修学佛道自利利他，直至成佛，永不停息利他之行。</p><p>为什么众生学佛修行能成佛呢？是因为有这个金刚心的配合，还能够存善业的种子，种子圆满成熟就成佛。小到肉眼看不见的细菌也有此金刚心，此心就是成佛的真体，是出生一切法的法身。一个众生有一个金刚心，一个金刚心就能成就一尊佛，十方世界有无量无边之多的众生，将来就有无量无边之多的佛。有金刚心执持的肉体称作有情众生，有五蕴的生命活动，有身口意行；没有金刚心亲自运作，没有识种子出生的物体叫作无情物，山河大地、花草树木没有五蕴（色受想行识），也没有身口意行，不是众生，因此不能成佛。</p><p>金刚心不同于外道们所说的灵魂之类的东西，外道们也认为众生都有个永远不灭的心体，能去到未来世，但他们所指的心体，按照体性来说就是意识心，是生灭变异的、无常的、空的、苦的、虚幻的、无我的，善恶分别性很强的，因此不是永远长存的金刚心。意识心有灭去之时，睡着就灭，昏迷就灭，入无想定就灭，入灭尽定也灭，死亡更灭了；既然能灭，就不是真实法，不能去至未来世。</p><p>金刚心的体性与意识截然不同，永不灭失，一刹那也没有消失过，否则众生当下就死亡。祂不分别善恶是非，你我他它，总是随顺着众生心行，配合着七识，对众生做大布施，又不求任何回报，尽未来际不住一切法地工作着，无私无我，这就是佛心。祂有无量之多的名字，了义佛经里处处在描述祂，说祂是自性清净心、如来藏、阿赖耶识、异熟识、无垢识、第八识、真如、实相、实际、本际、无边际、一真法界等等，不胜枚举。</p><p>祂遍一切地（三界九地），遍一切处（十二处），遍一切界（十八界），遍一切时，也遍一切法，哪一法上没有祂的运行，哪一法就不存在。十方世界都由衪变现，无一法不包含在祂心体里，祂就是如来佛，万法没有出过于如来佛手掌心的。佛在楞严经中说：虚空在汝心内如片云点泰清里，那么这个心该有多大，有个大，就是小，祂无大无小。</p><p>证得这个心在何处出现，在何处存在，如何运作，就是禅宗的证悟。如果只是依文理解了道理，不知道祂在何处，如何运作，不知如何变生五蕴则不属证悟，只是意识相似的理解罢了。学佛修行要如何证悟金刚心，明得此心之用呢？要用参禅的方法，禅宗一千七百则公案个个都是指向于祂的指头，从佛祖在世至元明清朝的大德们的公案记载，都是指月之指，句句不离此心。</p></div>"
},{
    "title": "第二章　经题：金刚般若波罗蜜经",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　经题——金刚般若波罗蜜经</strong></p><p>般若，乃出世间的大智慧，与世俗间的智慧皆然不同，故而不翻成智慧。世俗智慧是在三界世间当中生存的智慧，欲界中有男有女，因而有男女欲，生儿育女繁殖后代，创造财富，制造生活资具，搞研究发明创造，搞政治、经营事业，天人们一切生活资具皆为心想生，一切时中皆为享乐；色界天人处于殊胜的禅定境界，不分男女不用饮食，但享受禅定乐；无色界天人虽无色身，但有甚深禅定，心在定中享受定福；三恶道众生总是想方设法减少苦痛，得以温饱存活。这一切都是三界世间的智慧境界和范围，皆不出生死轮迴。</p><p>而出世间的智慧——般若不在三界里外，不属三界法所摄，因此般若不直接翻译成智慧，以免世俗人误会说，我们也有智慧，在政治、经济、文化、心理各领域各行业都有高超的智慧，但这些都属世间生灭的无常法，是由般若智慧所出生的，依靠着般若智慧才能存在和发展。般若的智慧无量无边广大，宇宙虚空都在里许，无量个诸佛国土、无量华藏世界，无量个世界海都在虚空中建立，都由无量无际有情众生的如来藏共同变现，称作一真法界，十法界（四圣六凡）都由祂产生。人类的太空船不管能飞多远，再远也飞不出虚空之外，虚空不出般若心外。</p><p>一个佛国土称作一个三千大千世界，包括十亿个南瞻部州、北俱卢州、西牛贺州、东胜神州，四大海、七金山、地狱、须弥山、月宫、日宫也各十亿个，四天王天、忉利天、焰摩天、兜率天、化乐天、他化自在天、色界的初禅天各十亿个，都由般若心体如来藏变现，太空船能飞到哪里？况且众生没有如来藏就不能存在，更何况还能制造太空船之类的东西，连经商政治，生儿育女繁殖后代，所有一切事业都要止息。而般若智慧能产生万法、万亿法、无量法，世间众生意识心的智慧想像不出来，只有佛能全部了知如来藏的智慧、功能、种子、德相，所以称佛为一切种智。</p><p>波罗密，是到彼岸的意思，那一岸没有生死，没有苦受乐受和一切受。我们五阴这一岸是生死的海岸，生生死死无有尽头，有三苦（苦苦、行苦、坏苦）八苦（生老病死苦、怨憎会苦、爱别离苦、求不得苦、五阴炽盛苦）以及无量无边的烦恼惑业苦。五阴在这一岸，生来灭去，灭去生来，众生都不觉厌烦，没有出离心，也不想出离生死苦。</p><p>而般若心体如来藏在那一岸从来没有生死苦厄，无始劫前本来就存在着，从来没有灭过一刹那，未来永远也不灭。祂没有寿命，说个无量寿也是有量，祂是无量又无量，没有寿也没有命。祂不受苦，众生下无间地狱时，色身和地狱一样广大，每一部位都施加刑具，痛苦得只有求死这一念，但他的如来藏一点也感受不到苦痛，祂没有感受的心也没有身，所以祂不会说：我受不了啦赶快出去吧！也不会说：五阴太苦了，我带你离开这死地方吧！祂没有这些心行，祂无所谓。当众生升天享乐时，如来藏却从不享乐，祂连看都不看一眼（因为无眼），祂不了知不分别，又没有色身来享受，当天人耳听天乐时祂不听，鼻嗅天香时祂不嗅，舌尝甘露时个祂不尝，进宝池沐浴时祂不触，当天子回想往事憧憬未来时祂不想。</p><p>这样清净的一个心，一点业行也不造作（但也并非不造作，五阴所需要的一切都由祂提供，一切都由祂变生，祂无私地奉献一切，却从不希求一点回报），祂怎么会有生死呢？谁造作身口意行，谁受生死，祂不受生死苦。五阴身生生世世造作业行，当然要有生死有忧悲苦恼了。了解如来藏，皈依如来藏，学习如来藏的清净性，我们就会出离生死苦，到达涅槃的那一岸，得到寂灭清凉乐。</p></div>"
},{
    "title": "第三章　法会因由分第一",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　法会因由分第一</strong></p><p>原文：<strong>如是我闻。一时。佛在舍卫国祗树给孤独园。与大比丘众千二百五十人俱。</strong></p><p>释：金刚经是由阿难叙述当初闻佛所说，开首先说如是我闻，表明是阿难亲耳听佛宣说的，现在来转述。佛有三十二相，佛的堂弟难陀有三十一相，阿难相貌也酷似世尊。佛涅槃后，阿难结集经典时，如不说如是我闻，众人可能要怀疑是世尊又回来亲自讲法了，或者怀疑是阿难自己说的法，为了避免误会，就用如是我闻，众人知道是阿难在转述佛在世时所宣说的法，就会信受不疑。在世尊涅槃法会上，阿难问佛以后结集经典时以什么为开首，世尊说以如是我闻。</p><p>接着叙述一时，不说具体时间，因为在印度是某时日，在其它国家是另一时日，在各层天界又是另一时日，在其它星体又是另一时日，各不相同，时间就不具体表明。其次地点是在舍卫国祈树给孤独园，听众是佛的常随众一千二百五十五位大比丘。</p><p>所谓大比丘是除阿难外，都是证得四果的阿罗汉，他们修四圣谛苦集灭道的小乘法以及中乘的十二因缘：无明缘（产生）行（业行）、行缘识（六识心）、识缘名色（受精卵及受想行识四个阴）、名色缘六入（眼耳鼻舌身意入）、六入缘触（六根接触六尘）、触缘受（感受苦乐不苦不乐）、受缘爱（贪爱）、爱缘取（执取、见取、我取等）、取缘有（欲界有、色界有、无色界有）、有缘生（生命的出生）、生缘老病死忧悲苦恼。他们修行四大部阿含中的小乘中乘法，证得初果至四果以及缘觉佛辟支佛。</p><p>初果是断我见，认可五阴十八界（六根六尘六识）苦空无常无我，这样绑缚自己的三缚结（我见、见取见、戒禁取见）就断了，灭了三恶道的罪业，不下三恶道受报了，人天七返就入无余涅槃。初果往上修，贪瞋痴烦恼淡薄了，证得二果，人天一返就入无余涅槃。再修出初禅定，断除贪欲心和瞋恚心，就证三果，后世到五不还天证得四果入无余涅槃，或在中阴身证四果入无余涅槃。三果再深入修行，断除了我慢心（感觉有我或我有用，都是慢），断除对三界细微的贪爱结，连禅定境界及天界色身也不贪爱，我执断尽，意根第七识再也不执著五阴十八界三界世间了，命终就会把自己全部灭去，不再出生，只剩如来藏独存，就称为入无余涅槃，这样所有的苦都灭尽了，再也没有苦可依赖的了，叫作灭苦。而阿难为了作佛的侍者，能证四果而不证，因佛不用四果大阿罗汉的侍者。</p><p>原文：<strong>尔时。世尊食时。著衣持钵。入舍卫大城乞食。于其城中。次第乞已。还至本处。饭食讫。收衣钵。洗足已。敷座而坐。</strong></p><p>释：再接着叙述的事情就是密义了，而且是极大的秘密，是所有大乘修行人都想知道的，如果真知道，那就不密了。接下来的事就是：世尊食时着衣持钵入舍卫大城乞食，次第乞已还至本处，饭食讫收衣钵洗足已敷座而坐。看看这是干什么呢？啰里啰嗦地讲这些，这本是世尊的日常琐事，每天都如此，再世俗不过了，既然每天都如此托钵乞食、吃饭、洗脚，为什么写到经里来又写在开头，在讲别的经典时不描述，单单在讲金刚经时描述出来，况且是在宣说大般若的法会上，金刚经又是大般若经的精华，世尊讲法又从不说无意义的琐事，除非特殊因缘，就连微笑也不轻易出现。</p><p>这里有极深的奥秘，揭示出一个真理，昭示着诸法的实相，极上根利智之人只读到这里就可以了悟真理和实相，金刚经以及六百卷大般若经的整个宗旨就贯通下来了，此人也就成了真实义的菩萨。华严经中讲一切法唯心造，是唯如来藏心造，世尊的日常琐事是不是万法中的一部分？那里有没有世尊的真如心的运作？答案是肯定的。万法都是真妄和合而生，只有真心什么也不能成就；只有妄心，妄心也不成立，必须是真妄和合共同变现万法，所以在我们那些无常的生灭的空幻的现象界当中，一定有般若真心在运作着。</p><p>比如我们每日里的吃喝拉撒、言谈语笑、行住坐卧等等，其同时必须有真心如来藏的参与，否则一法不成立。禅宗的一千七百则公案就指示了这个真理，所以禅师们用各种手段，眼色动作嘻笑怒骂举拂放拂，来引导学人悟入，比如德山棒（打来打去的）临济喝（大喝小喝的）无不是慈悲之举，若到我这里来，我就用脚踹，学人在被踹了一脚后，缘熟的就能找到金刚般若心。云门则是被师父用门把脚挤坏了，大叫一声之后就开悟了。这些都不胜枚举，悟了以后就是证得无生忍，实相智慧就开发出来了，了知我人众生的虚妄，没有真实出生，如来藏自己也不生，认可这个理就是无生忍，只是很难忍！</p><p>我们娑婆世界佛教史上第一则禅宗公案，是世尊亲自演示出来的，世尊在灵山会上，天人献完花后，世尊就在人天大众中手拿那朵花微笑不语，向众人明晃晃地昭示着世尊自己的真如心。可是人天大众谁也不知世尊在卖什么药，而大迦叶一就就明白了，以智慧眼观照到了世尊的真如心，也同时明了自己的如来藏心，知道了世尊葫芦里装的是什么药，就破颜微笑。世尊知道大迦叶悟了菩萨法，成为阿罗汉菩萨了，就宣说：我有涅槃妙心，实相无相，不立文字，教外别传，咐嘱摩诃迦叶。迦叶就成为禅宗第一代祖师。</p><p>什么是涅槃妙心呢？涅槃为不生不灭，妙心意为空性心中一法也无，一无所有却能变现出万法来，无一法不现，连灰尘大小都没有，却能变出宇宙虚空，这就太妙了，因此叫作妙心。实相指金刚般若心是真实存在的正真之理体，永不断灭。无相谓这个心没有一切相，没有色相看不见祂，没有声相听不着祂，没有香相嗅不着祂，没有味相尝不着祂，没有触相摸不着祂，没有法相分别不了祂，心经讲祂没有五阴，没有六根六尘六识，没有四圣谛十二因缘（无明至老死），无…，总之，一法也没有，而万法却都依祂而生和存在。</p><p>教外别传指禅宗明心见性这个法在三藏十二部经教之外，离开文字相，可单独另传，不用语言文字就能指示人悟入，世尊没说一个字就让大迦叶悟道，而经教必须用语言文字教化引导。在香积佛国土，佛与菩萨们围坐一起吃饭，佛用鼻子嗅一嗅饭香气，菩萨们一见就悟道了，不用讲法。但是禅宗虽然不立文字，也非不用语言文字，禅宗也用语言文字引导，也有人因看经教而悟入。</p><p>有人说大迦叶看见了佛的真如心在花上就悟道了，但是真如心如果在花上，那朵花就会眉飞色舞欢蹦乱跳，它就是有喜怒哀乐的有情众生，也能成佛，事实上永远不可能；真如心若在花上，就与世尊无关，世尊就不是佛也不是众生，就不能拿花微笑了。那么真心如来藏在哪里呢？这是秘密，如果说出来就有违佛戒亏损如来法事。不过还是可以巧设一些机关，让人悟入，世尊在世时就搞了很多机关把戏，让弟子们悟道并传示后人。有一次世尊领弟子走到一个土堆前站住了，然后对着土堆拜了一拜，这就开始作戏了，阿难不知世尊演哪出戏，也许是故作不知，就问：世尊为什么拜那土堆？世尊用手指着土堆说：三世诸佛都埋在那土堆里了。</p><p>世尊您那葫芦里卖的是啥药啊！我们虽然是未来佛，但还没成佛，怎么埋呀？现世的佛都在各佛国土教化众生并没埋着呀？至于古佛也埋不到这里！但这里是哪里呢？菩萨们快擦亮眼晴，看看这里是哪里，看明白就恭喜悟入了。等到自己菩萨的六度条件具足，因缘成熟了，就能参出来了。</p><p>世尊有一次在法座上刚坐好，文殊菩萨就走过来拿抚尺在讲桌上拍了一下说：世尊讲经竟。说完世尊就下坐了，真的是讲完了，如来藏大法传完了，其实就在世尊一进讲堂，推开门的那一刹那就讲完法了，完全可以回身退出讲堂，让弟子们目瞪口呆去。梁武帝时的傅大士以及唐朝的禅师，都搞过类似的把戏，只是一般人看不透这里的机关，只有善根深厚的菩萨才能领悟。</p><p>禅宗的第二代祖师是阿难，世尊涅槃后，阿难问大迦叶：世尊除了传你金缕袈裟外还传你什么了？他这是在问如来藏，迦叶就喊了一声：阿难！就传这个嘛！可阿难不懂，随口答应了一声：哎！答应完应该懂了，可还是不懂，迦叶无奈就接着说：去把门前的旗竿子放倒。阿难一听，我问密意你让我放倒旗竿？脑筋一转，就明白了，原来如此！也就大悟了，于是成为禅宗第二代祖师。从此西天二十八祖代代相传直至大唐六祖，直至明朝末年，再后来悟入的就极少极个别了，但现在仍有，佛是不会放弃这个世间众生不管的。</p><p>这金刚经第一品，就是一个禅宗公案，世尊不用开口讲话就传了法，只是太难会了，极上根人才能看懂。所有参禅的标的就是如来藏，十方世界不管哪个佛国土都是悟得这个心，祂在哪里，如何运作，如何产生万法，如何出生五阴十八界，除此都是偏离了方向。而只懂点理，不知如来藏的体性，不会观察祂的运作原理，不属证悟，顶多是个解悟，抵不了生死。</p></div>"
},{
    "title": "第四章　善现启请分第二",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　善现启请分第二</strong></p><p>原文：<strong>时。长老须菩提在大众中即从座起。偏袒右肩。右膝着地。合掌恭敬而白佛言。希有世尊。如来善护念诸菩萨。善付嘱诸菩萨。世尊。善男子善女人。发阿耨多罗三藐三菩提心。云何应住。云何降伏其心。佛言。善哉善哉。须菩提。如汝所说。如来善护念诸菩萨。善付嘱诸菩萨。汝今谛听。当为汝说。善男子善女人。发阿耨多罗三藐三菩提心。应如是住。如是降伏其心。唯然世尊。愿乐欲闻。</strong></p><p>释：须菩提即是善现，釋迦佛弟子中解空第一，他在母胎中即知万法空寂，这是由于前世多劫累积的深厚善根，他入胎住胎出胎都不迷不顛倒，刚出生时家中的財宝都空却消失了，表明一切都空，几天后又都自动出现。尊称须菩提为长老，长老是指在大众中有威望的人，是有德之人，与三毒烦恼不相应的人，须菩提由修小乘的空法证得罗汉果，而在世尊讲大般若经时回心大乘，走菩萨道。佛讲经时总是要借助某个因缘作为引子，借题发挥讲出一部经来，很少无人启请就讲经，除非特别重要，这部经就是由须菩提来启请的。</p><p>世尊吃完饭刚刚跏趺而坐，须菩提即在大众中从座位上起立，合掌问佛：希有世尊，如来善护念諸菩萨，善咐嘱諸菩萨。世尊，善男子善女人发阿耨多罗三藐三菩提心，云何应住，云何降伏其心？须菩提一开始先赞叹世尊是世间最希有、少有，很难得见的圣人。世尊确实稀有，一个三千大千世界只有一尊佛，一个日月天从四大海下边的地狱到地球到须弥山，上至欲界六层天称为一个小世界，一千个小世界加上色界初禅天是小千世界，一千个小世界加上色界二禅天是一个中千世界，一千个中千世界加上色界三禅以上的天界是一个大千世界。这么大世界只有一尊佛，而且留形住世时间极其短暂，前后两尊佛相距时间又长，釋迦佛与弥乐佛相隔最短，56亿7千万年。相距时间比较长的，很多时候好几大劫几十大劫都没有一尊佛出世，甚至更久远都没有一尊佛出世。由此可见世尊确实是很稀有难遇。</p><p>如来这一称谓是从众生性体上来讲的，如来从真如中来，真如是真实而如如不动的性体，有真如就有如来，无真如就没有如来。佛的如来藏中，七识的无明都断尽了，再也不受熏染，再也不变易了就称作常乐我净的真如；而众生的如来藏里含藏着恶业种子，含藏着一念无明、无始无明、尘沙无明，有分段生死和变易生死的种子，也称含藏识。通过修行，众生如来藏里恶业种子不断减少，善业种子不断增加，无明一点点减少，明一点点的增加，如来藏整体不断的发生变动，还不是如，与佛的真如有一定的区别。</p><p>但如来藏本体是如如不动的，色来不见，声来不闻，香来不嗅，味来不尝，触尘来不触，法尘来不知，对六尘境界完全无动于衷，从来不生心动念，不被六尘转，有真实和如如性。如来藏有时也称作真如，自体不变叫作真如不变异。如来藏本身就像一只干净的杯子，七转识就像杯子中的水，水有清净和染污的，杯水就分为不垢不净的和无垢的。众生的七转识是染污的，种子存在真心这个杯子里，真心就含藏了污垢，倒出的水就是污水，所以众生的真心就称作如来藏、阿赖耶识、异熟识等等；而佛的真心没有染污称作无垢识。修行就是净化七转识，破除无明，要破除无明就要学习如来藏之理，全部通达就成佛。</p><p>如来是如何善护念诸菩萨的？一个众生从凡夫的十信位开始起修，直到十住位、十行位、十迴向位，又到十地等觉妙觉五十二个阶位，每一阶段都离不开佛的加持和护念，否则就被业障遮住，无法往上熏修，所以说佛恩浩荡，不成佛无以报答。那么这么多众生佛都能护念得到吗？当然能，因为佛又叫一切种智，智慧德能圆满具足，世及出世间无一法不知，无一法不晓，十方世界每个众生的心念佛都知，每个众生无量劫的事情佛都知道，甚至十方世界同时下雨，总共有多少个雨滴佛都知。佛既然能知众生的心，就能护持众生修行，帮助众生跨过每一关，直至成佛。</p><p>菩萨从十信位开始修行对三宝的信心，了解佛的三十二相八十种好，历劫修行菩萨道的因缘，佛的十个名号的功德内容，佛国土的形成范围，以生起向往之心。再了解佛所讲的三藏十二部经的粗浅内容，三皈五戒的内涵，再了解僧宝，什么是凡夫僧住持僧胜义僧以及一体三宝自性三宝，这样从迷信到仰信崇信就到了正信，就是相信十方世界真有佛法僧三宝的住持，相信十方众生都有真如佛性，都能成佛，自己也能成佛，具足成佛的信心了，十信位就修圆满。这当中得修多长时间，依个人善根福德的深浅和精进度而定，这一切的修行都离不开佛陀的护佑。</p><p>这一阶段修行圆满后，佛陀会护念菩萨转入三贤位的修行，初住位开始修布施，修集福德资粮，为明心见性准备道粮；二住位修行持戒，断恶修善，心转清净，不妄攀缘；三住位修忍辱，包括对世俗法人事物理的忍和对如来藏大乘无生法理的忍；四住位修精进，布施持戒忍辱禅定都要精进；五住位修禅定，心能住在一个境界以及大小乘法理上不动摇，达到未到地定，有能力观行小乘的空和大乘的空性心；六住位修般若智慧，相对圆满后就能明心，生起如幻观后，了知万法皆虚妄，了知一切法就像魔幻师幻化出的一样，又像空中的云雾不实。</p><p>十住位修完转入十行位修行，证得阳焰观，感知万法如海市蜃楼一般空幻。海市蜃楼的现象是这样的，当太阳照在沙滩上时，热气返上来形成一种幻化景象，有楼房车马人物，而且人马还在走动，可是近前一看什么也没有。阳炎的现象是这样的，鹿由于太渴，远望沙滩幻觉以为看见了一条河，跑过去一看沙滩上并没有一滴水，众生就像那渴鹿一样虚妄的见一切法。</p><p>这一法修完过禅宗第三关生死牢关，再转入十回向位修如梦观，证得万法如梦。做梦时，梦里的一切人事物都如真的一样，于是在梦里喜怒哀乐，执著抓取梦境，及至醒来一根毛也找不到，腮边还挂着悲喜交集的泪水。众生清醒时也是和做梦时一样，丝毫感觉不到世间的虚假不实，梦里来梦里去，就是不觉醒。这时候再加修一些道种智后就转入初地，成为圣人，成佛的路已经走完三分之一。</p><p>在这整个修行过程中，菩萨生生世世都没有离开过诸佛的加持护念，当菩萨贪图世乐忘记修行时，佛陀就用无常来警示；当菩萨必须出家修行时，就会暗中遮止其世俗法上的道路；当菩萨沉迷于小乘的时侯，就引导其走大乘路；当菩萨有能力度众时，佛陀会安排其到十方有缘世界度众；当菩萨不慎下三恶道时，佛陀自己或派菩萨去救度；当菩萨证了四果罗汉要入涅槃时，佛陀会用善巧的方法劝导菩萨留形住世自利利他直至成佛不入涅槃，这些都是佛陀对菩萨们的咐嘱。等等这一切不胜枚举，佛陀的慈悲胜过父母的千万亿倍不可说，佛陀的恩德道不尽，赞不完。</p><p>这是有形相的报化身佛对众生的护念，最重要的是众生自己的法身佛的护念，那个护念非同小可，不可或缺。菩萨在三大无量数劫的修行当中，自身如来这个法身佛无时无刻不在护念着菩萨，未离须臾，供养菩萨们修道所需的一切种子，储存着菩萨修行所得来的道业种子，丝毫没有缺失和遗漏，这样善业种子具足了，菩萨才能成就佛道。</p><p>须菩提又问：善男子、善女人发阿耨多罗三藐三菩提心，云何应住，云何降伏其心？他这是问一个菩萨发了成佛广利众生的心以后，怎么样安住这个心、降伏这个心，不让它生起不正确的觉观、思惟及不如理作意。世尊回答说：太好了，须菩提，正像是你所说的那样，如来确实是善护念诸菩萨，善咐嘱诸菩萨的，你现在仔细听，我要为你说了，善男子善女人发了成佛的心以后，应该像这样安住下来，这样的降伏自己的心。须菩提就表态说：好的，世尊，我非常愿意听您讲解。</p></div>"
},{
    "title": "第五章　大乘正宗分第三",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　大乘正宗分第三</strong></p><p>原文：<strong>佛告须菩提。诸菩萨摩诃萨应如是降伏其心。所有一切众生之类。若卵生。若胎生。若湿生。若化生。若有色。若无色。若有想、若无想。若非有想非无想。我皆令入无余涅盘而灭度之。如是灭度无量无数无边众生。实无众生得灭度者。何以故。须菩提。若菩萨有我相人相众生相寿者相。即非菩萨。</strong></p><p>释：这一品主要是讲关于菩萨们破四相，断除人我见的问题。菩萨教化灭度三界四生九有二十五类众生，都入无余涅槃，但也不要生起不如理的思维观，认为这些众生是我化度的，我度化了这么多众生。菩萨这样想就不是真菩萨，真菩萨应该依般若实相智慧破除四相，心中无我相人相众生相寿者相。</p><p>佛告须菩提：諸菩萨摩诃萨应如是降伏其心。摩诃，汉语是大的意思，佛经中的大菩萨一般指明心证悟以上的菩萨，具备贤人的品德，严格来说登地以上的菩萨才能称为大菩萨、法身大士，证得佛的一分或多分法身，有一分或多分无生法忍智慧，有一分或多分道种智，具备圣人的品德心性，也称为分证即佛。如果只有菩萨的热心和善心，解悟或者是理解一些佛法，没有出生无生智慧，不能称为大菩萨。菩萨刚开悟获得无生忍，证得人无我，能忍于五阴十八界是虚妄无我的，都没有真实的出生；而如来藏也不生，是无始劫来就一直存在的，这样就生起了大乘无生智慧。</p><p>佛说菩萨摩诃萨们应该这样降伏自己的心，而能被降伏的心一定是妄心，真心从来都不起念想，没有知见和想法，不攀缘三界六尘，不造身口意行，是清净无烦恼的，因此不用降伏祂。而妄心的眼识耳识鼻识舌识身识意识意根总在攀缘六尘万法，起心动念，有无量的知见意见看法，人我见人我执、法我见法我执都很炽盛，身口意行与贪嗔痴相应，所以需要降伏，断除无明，生起智慧的德用。</p><p>要想降伏七识妄心，就要了解七识的功能作用。眼识见色，分别青黄赤白长短方圆大小，意识心同时分别细相，好坏美丑韵味气质等等，在这当中生起喜欢厌恶等苦乐不苦不乐的感受，就有身口意行的出现。耳识闻声，分别声音的高低远近方向，意识同时分别类别意涵等，产生贪爱厌恶等心行，就有苦乐不苦不乐的感受，进而就有身口意行的出现。鼻识嗅香，分别香臭及方位，意识同时分别香臭的种类程度等，生起喜欢厌恶的心行，就有苦乐不苦不乐的感受，就有身口意行的出现。</p><p>舌识尝味，分别酸甜苦辣，意识心分别食物种类好坏味的程度，产生喜欢厌恶的心，就有苦乐不苦不乐的感受，就有身口意行的产生。身识觉触尘，分别冷热饥渴饱软硬等，意识心同时分别疲乏轻安舒适累困等，生起喜欢厌恶等心行，就有苦乐不苦不乐的感受，和其它身口意行。意识心与前五识同时分别，也可以单独了别，回想从前打算未来，分析推理判断，生起苦乐忧喜舍的感受，产生下一步的身口意行。</p><p>意根也是心，是无形状无任何相貌的，也称无色根，从无始劫来就存在着，阿罗汉入无余涅槃时就灭，是我执识，无始劫来就执著自我，把一切都当作我和我的，执著前六识的功能是我的，执著第八识的功能是我的，贪嗔痴慢疑邪见不断现行，是造业的根本，总是主导六识按照自己的习惯去行事，修行主要是改变祂。意根在开悟入初地以后改变一次，八地菩萨时改变一次，成佛时彻底改变成平等性智，意识心成妙观察智，前五识就变为成所作智，第八识就变为大圆镜智。如果能断除意根的我执性，不再执著自己，命终就会灭掉自己五阴十八界，入无余涅槃。</p><p>佛说要降伏的就是这七个妄心，如何降伏呢？世尊说：所有一切众生之类，若卵生，若胎生，若湿生，若化生，若有色，若无色，若有想，若无想，若非有想非无想，我皆令入无余涅槃而灭度之，如是灭度无量无数无边众生，实无众生得灭度者。三界众生分成四生九有二十五种，卵生指有情众生不住母胎，不由父母出生，意根带着阿赖耶识直接入到卵壳中，外缘温度等条件具足，胚胎生长，破壳而出，如鸡鸭蛇鸟。胎生指众生在中阴意根带着阿赖耶识投到母胎中，六根生长成熟了，就出母胎。</p><p>胎生包括全部人类，大部分畜生，一部分鬼类，一部分阿修罗；湿生指在一定的温度湿度条件下（如在水边海边潮湿的土壤和空气中）出生的无福众生，如各种昆虫和细菌，一部分阿修罗等；化生指能够变化而生，如各层天界的天人，其它国土众生，鬼神类非人类众生，地狱众生，一部分阿修罗类及一小部分畜生类，有神通的菩萨罗汉等。有色众生指有色身存在的欲界色界众生，色身也叫色阴，从投胎到受精卵中开始直至出生最后灭亡的形体，由于有阿赖耶识和前七识住持着色身，色身才有各种身口意行的行为造作，这叫色阴，否则就是死尸和无情物，如植物类矿物类。</p><p>欲界包括六层天、人类和三恶道众生，色界有十八层天，初禅天至四禅天有十三层，五个不还天，包括无烦天、无热天、善见天、善现天、无想天。三果罗汉在这里修行，断得最后的烦恼、我慢和三界的贪爱后证得四果罗汉，或入无余涅槃或回心大乘，重新投胎学菩萨道。其他众生在五不还天修行，厌离色身后就舍弃色身升到无色界。色界有形累，无色指无色界没有色身，众生只有意识心、意根和阿赖耶识存在，心处在定中不动。</p><p>色界有四层天：空处天、识处天、无所有处天、非想非非想处天，无色界众生也修空想，目的要入无余涅槃，但这个空理没研究明白，仍处在六道轮回中，就像佛的外道老师郁兰头弗，修得最高禅定非想非非想定，以为在这个定中已经没有想就是涅槃境界了，其实那个定中还有极其微细的想，只要有妄心就不出三界，不得解脱。佛成道以后想度祂的老师，用天眼一看他已经生到非想非非想天，不会再出定了，就感叹说他从天上下来后会下三恶道受苦。</p><p>佛临涅槃时，有个修外道的老者１２０岁，是阿难五百世的父亲，也修得非想非非想定，但还在人间住着，佛让阿难把他叫来后，告诉他那个定中还有微细的想，那个最微细的觉知心也不是我，灭了就能出三界得解脱，了生脱死。老者一听当下就证四果罗汉，对佛说我不忍见佛般涅槃，我先走了，说完就入了无余涅槃。</p><p>无余涅槃指众生断了我见和我执，不再有执著了，愿意舍弃自己的五阴和十八界，这样苦再也没有可依赖的，就离苦舍苦了，灭了所有的苦就得解脱出三界，只留下阿赖耶识独存，没有一个自己了。菩萨们度化了三界中的四生九地二十五类众生，教化他们成四果罗汉，了生脱死，命终都能入无余涅槃，得到解脱。</p><p>世尊又接着说：如是灭度无量无数无边众生，实无众生得灭度者。灭度了那么多众生，却一个也没有灭度，这是什么意思？灭度的意思就是刚才讲的入无余涅槃，就是把五阴和六根六尘六识的十八界自我全部舍弃，都灭掉，就没有众生了。有五阴则是众生，没有五阴则不称为众生，没有十八界也不称为众生，也就是没有众生被度，单独留下的阿赖耶识也不是众生，这样就是，一个众生也没度，并没有一个众生得灭度。即使五蕴十八界没有灭掉的时候，也同样没有众生，因为五蕴十八界这个相是幻化的，有是假有，不是真实有，是暂时的有，没有众生的众生可言，都是如来藏的相貌，都是如来藏的性质，如来藏又不用度，所以灭度无量数的众生，其实并没有灭度一个。菩萨应该这样度众生，也不要有度众生之想。</p><p>下面就是大家都关心的破四相的问题。世尊又接着说：何以故？须菩提，若菩萨有我相、人相、众生相、寿者相则非菩萨。首先看我相，众生以为的我，是把五阴十八界当成我，以为是真实的，其实不是。五阴包括色阴受阴想阴行阴识阴，色阴是形体，从入胎后的受精卵开始，到成长为胎儿、婴儿、儿童、少年、青年、中年、老年的色身，它是不断变化着的，有生有灭，有生住异灭的现象就是无常的、假的、虚妄的、苦的，不是真实的我。</p><p>受阴就是感受，主要指意识心能感受到苦、乐、不苦不乐。眼见色时有受，耳听声时有受，鼻嗅香时有受，舌尝味时有受，身觉触时有受，心思法时有受，这些受是生灭变化不停的。苦受多了，心麻木就不觉得苦了，于是变成了不苦不乐受。苦减少一点，心里就觉得高兴了，比如一天被打三十棒，有一天减少到十五棒就高兴了，乐多了也就不乐，变成不苦不乐了。每月开一万元工资，有一月开了九千五，就觉苦了。受阴在死亡、昏迷、入无想定、入灭尽定、睡着无梦时就消失了，是变化无常的，有生有灭的，是苦的，就不是真实的我。</p><p>想阴是心上取相为想，了别分别计划打算思惟判断，总而言之就是妄想。在五种情况下有想，眼见色时有想，了别青黄赤白、长短方圆和粗细，心里分析思惟判断等。耳听声时有想，了别声音的高低、粗细、远近，男声女声动物声宇宙声山谷河流声等，同时分析推理判断打算等；鼻嗅香时有想，了别香臭的种类、程度、方向、远近，分析思惟判断计划打算等；舌尝味时有想，了别酸甜苦辣等等；身觉触有想，心思法更是有想。这个想阴在死亡、昏迷、入无想定、入灭尽定、睡着无梦时就灭，它是生灭的、无常的、虚妄的、不真实的，就是苦的，苦的不是我。</p><p>行阴指时间的流转、空间的转变、地点的变迁，包括身口意的行为，凡是动的不静止的行为都属于行阴，呼吸、心跳、脉膊、血液的流动、肢体的动转，行来去止，语言思想活动等等造作。眼见色是行，耳听声是行，鼻嗅香、身觉触、心思法时都是行阴，入涅槃时、正死位时就灭，它也是刹那刹那在生灭变化不停的，是无常的、虚妄的、苦的、不真实的，不是我。</p><p>识阴包括六个识：眼识耳识鼻识舌识身识意识，主要起着分别了别的作用，眼识了别色尘的外观，粗的部分，意识同时了别细相；耳识了别声尘，分别大体、粗略的部分，意识同时进行细的分别；鼻识嗅香，了别粗相，意识了别细相；舌识尝味，了别粗相，意识了别细相；身识觉触，了别粗相，意识了别细相。识阴在睡着无梦、昏迷、入无想定、入灭尽定、正死位即灭，它是生灭变化无常的，是虚妄的、苦的、不真实的，就不是我。总之，五阴是生灭的无常的苦的无我的。</p><p>再来看十八界，包括六根六尘六识，六根为眼耳鼻舌身意根，眼根分为浮尘根和胜义根，由地水火风四大元素构成，在身体外面象葡蔔一样的称为浮尘根，也称外眼根。在后脑部由眼的传导神经所连，主管视觉的大脑枕叶皮层，为胜义胜，是眼识所依，在那里生起眼识。胜义根若坏，即使眼根完好，也不能见色，名为睁眼瞎。眼根在受精卵位由如来藏吸收母体中地水火风四大元素（营养）而造，它是生灭之法，无常之法，虚妄之法，是苦的，就是无我的。</p><p>耳根分为浮尘根和胜义根，在身体外面大家能见，象新卷叶一样的称为浮尘根；由传导神经连接在大脑后部主管听觉的大脑皮层，称为胜义根，是耳识所依，在那里生起耳识。耳根在胚胎中由如来藏吸收母体营养而造。是有生有灭之法，是无常法虚妄法，是苦的无我性的。</p><p>鼻根分为浮尘根和胜义根，浮尘根在身体表面，象双嗅球或悬胆一样，是嗅气的受纳器，嗅气后由嗅传导神经传至大脑皮层，在那里生起鼻识，才能分别香臭，后脑部的大脑皮层是胜义根，主管嗅觉，是鼻识所依。鼻根也是在受精卵位由如来藏所造，它是生灭的、无常的、虚妄的、苦的，不是我。</p><p>舌根由地水风火四大元素构成，在受精卵位由如来藏所变生，分为浮尘根和胜义根。在身体外，张开口即能见到，像半月形的是浮尘根，是味觉受纳器，由味觉传导神经传到大脑皮层，在那里如来藏生起舌识，分别各种味尘，后脑部的大脑皮层是胜义根。舌根是生灭的虚妄的无常的，是苦的，就是无我的。</p><p>身根由地水火风四大种所造，三十六物聚积，外相十二物：发、毛、爪、齿、眵、泪、涎、唾、屎、溺、垢、汗；身器十二：皮、肤、血、肉、筋、脉、骨、髓、肪、膏、脑、膜；内类十二：肝、胆、肠、胃、脾、肾、心、肺、生藏、熟藏、赤痰、白痰。各部分的皮肤肌肉乃至脏腑都有感觉，由传导神经传至脊髓又传至大脑皮层，在那里产生身识才能觉触。大脑皮层是胜义根，在后脑部，这部分若损坏，整个身体即瘫痪成植物人。浮尘根象一个肉桶，人眼可见称为浮尘根。身根是生灭性的、无常的、虚妄的、苦的，就是无我的。</p><p>意根是精神体，是心，不是物质，无始劫前就存在着，阿罗汉入涅槃就灭。恒与烦恼相应，所有心思都是我和我的，具有恒常、审察、思量的了别作用，恒执前六识为自外我，恒执第八识为自内我，是染污的末那识。刹那刹那都在思量作主宰，作决定，执著性很强，但分别作用不强，依靠第六识来分别，是起惑造业的根由。只有通过修行，改变它的染污性，变成清净性，断尽对自己的执著性，才能获得解脱，它是生灭性的、无常的、空的、苦的，也不是我。</p><p>其次，六尘就是色声香味触法。色尘有外色尘内色尘，外色尘由地水火风四大种子和合构成，包括宇宙器世间，须弥山、诸天天宫、七金山、四大海、四大洲等，是共业众生的如来藏共同和合造成，是众生的生存环境。有了环境有缘众生才能投生其中受业的果报，缘灭了宇宙器世间就会逐渐毁坏，众生就转生到其它有缘的器世间。所以外色尘是生灭变化无常的，是虚妄法，是空的，无我的。</p><p>内色尘是众生如来藏通过眼根接触外色尘，变生出一模一样的影子讯号，通过视网膜视觉神经传导到大脑皮层，形成了和外色完全相同的假色，为内色尘，它是影子，不是真实的物质，否则四大物质的形体不能和眼根接触，也不能通过视网膜神经传到后脑部。再者眼根若能接触物质的形体，一定会受损，如眼根接触刀尖，眼一定会被刀尖刺伤，眼睛接触火时，眼一定会被火烧，眼睛接触沙子时，沙子就会迷了眼，所以眼根不与物质的形体相触而有见，所接触都是形体放射出的四大微粒，是假相是影子。</p><p>这个道理和摄像机的原理相似，外色通过摄像机变成倒影在机器中，肉眼一见又变成正影，就觉得是见到真实的色尘了，其实那是影子和相片，就像电视中所见色尘一样，众生从无始劫来就没有见过外面真实色尘。所以众生所见的内色尘是虚妄的、空的，也是苦的、无我的。</p><p>声尘分为外声尘和内声尘，外声尘如宇宙山谷河流各种物质发出的，由共业众生的如来藏依据因缘业缘共同变造，众生发出的声尘由众生个人如来藏变生，它也是由地水火风四大种构成，是物质的，有生有灭的，是虚妄的、无常的、空的、苦的，是无我的。内声尘是如来藏通过耳根接触外声尘，变现出一模一样的影子，经过耳的传导神经传到大脑皮层胜义根，根尘相触，如来藏产生耳识，分别声音，其实这个声音是自己的如来藏变现的，是假的、虚妄的、生灭的、无常的、苦的，是无我的。这个原理就与录音机相似，我们听的录音机中的声音都是相似于录前的真声，其实只是影像。</p><p>香尘分为外香尘和内香尘，外香尘是由地水火风四大种构成，由共业有情的如来藏依业依缘共同变造，众生自己身体的香尘是自己的如来藏单独变造的。内香尘是如来藏通过鼻根接触外香尘，变现出类似的影子，经过鼻的神经传导至后脑皮层，与鼻的胜义根接触，如来藏产生鼻识进行分别，其实只是在分别一个假像而已。内外香尘都是生灭的、无常的、空的、苦的，不是我的。众生不知，在其中生起执著心。</p><p>味尘分为外味尘和内味尘，外味尘是物质的，由地水火风四大种构成，是共业有情的如来藏依业依缘共同变造，是生灭变异、无常的、幻化的、苦的，因此是无我的。内味尘是如来藏通过舌根，接触外味尘变现出相似的影子，经过舌的传导神经传至大脑皮层，与舌的胜义根相触，如来藏产生出舌识，就有分别作用，所分别的只是幻化出的假相，内味尘是虚妄的、无常的、苦的、无我的。</p><p>触尘分为内外触尘，外触尘是由地水火风四大种构成，是共业有情的如来藏依业依缘共同变造，它是生住异灭的，是无常的，是虚妄的，是苦的是无我的。内触尘是如来藏通过身体与外触尘接触，变出相似的影子，通过传导神经传至后脑，与身的胜义根相触，如来藏产生身识了别，内触尘是生灭的、幻化的、无常的、苦的、无我的。众生无知，以为所分别的都是真实的，都属于我所有。</p><p>法尘也分为外法尘和内法尘，外法尘是由四大极微组成，是在五尘上所显现出来的形色、表色、无表色等法处所摄色，是由共业有情的如来藏共同变现出来的。外法尘再随同五尘一起传导到胜义根里，由如来藏变为内法尘，与意根相触，再由如来藏产生五俱意识来分别内法尘。因此内外法尘都是虚幻的、生灭的、无常的、苦的，是无我的。</p><p>而六识就是识阴，眼识耳识鼻识舌识身识意识，都是六根触内六尘，由如来藏出生的。如果意根对六尘不感兴趣，如来藏就不出生六识，就有视而不见，听而不闻等等无心的现象。入到无想定、灭尽定中，意识心也不现起，众生就一无所知，无一丝分别了。</p><p>综合以上所述，众生的五阴十八界法全部是生灭幻化的。五阴身就像皮影戏中的一个木偶、一个电动娃娃、一个动画片中的人物，就像天空中云彩所形成的猫狗图像，就像电视中的人物，非常不真实，众生无知，迷执在其中，妄造身口意业，不出六道轮回。如果一个佛子想超出这个轮回的苦海，就常常按照以上讲述，去观行思惟五阴十八界的虚幻，就能证得小乘果，甚至悟入大乘佛法道，证得真实的如来藏。</p></div>"
},{
    "title": "第六章　妙行无住分第四",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第六章　妙行无住分第四</strong></p><p>这一品讲菩萨如何布施，所得福德最多最殊胜。菩萨的根本标志就是布施利乐众生之行，修大乘菩萨行主要以布施为主。菩萨有四摄法：布施爱语利乐同行，用这四个方法来攝受众生，进而度化众生，如果只顾自己了生脱死得解脱，那是自了汉，不是菩萨，做菩萨不能只为自己，同时也为众生离苦得乐，为佛法永续流传。布施这一行，一为个人修集福德，作为往上进修的道粮，二为摄受众生，布施众生就能与众生结缘，众生就愿意听从菩萨的教化，随之受学。</p><p>菩萨六度波罗蜜的第一度也是布施，布施分三种：財布施、无畏布施、法布施。菩萨优婆塞戒经上讲，布施给畜生得一百倍果报，布施给普通人，包括恶人、犯戒的人是一千倍果报，布施给持戒的人是一万倍果报，布施给离欲的人包括外道证初禅的是百万倍果报，因为证初禅就断了欲心，命终会生到色界天，这就是德，有德就值得供养。布施初果向及初果以上的罗汉、菩萨、佛都是无量倍，无量还有区别，佛是无上福田报恩田，父母也是最大的福田报恩田。</p><p>布施的因缘果报由如来藏来实现，布施整个行为过程都有如来藏摄持和记载，因缘成熟时，如来藏输出这个业种，众生就受福德的果报。一般来说，这个果报是后世得，叫异熟业，但这个业如果很大，在现世缘就能熟，那就现世受报。众生所造的业，果报都不会消失，善业恶业无记业都由如来藏收藏和输出，绝不错乱，不会漏失，不会甲造的业记到乙头上，由乙受报。一般来说，善恶业受报完了，业种就消失，造过的恶业也可以通过忏罪来消除，证果或明心见性以后就能消除三恶道的业，后世就不下三恶道了。哪个业强，先受哪个报，修行人应该总是让善业大于恶业，恶业就暂时不受报，时间很久以后，业种就干枯。比如造五逆罪众生，下品下生到极乐世界，十二大劫在莲花中，没有造业的机会，业种慢慢枯萎，心清净了就从莲花中出来。</p><p>无畏布施包括救济众生生命，解决众生困苦危难，解除心理障碍等，可以得到健康长寿、平安快乐、諸事顺利及富贵的果报，有时財布施中有无畏布施，无畏布施中有財布施。而法布施会得到福德和智慧两方面果报，也有无畏布施的果报。讲经说法替佛宣化是直接法布施，印制经书、护持僧宝弘法等是间接法布施，但最好是经过修证有了道眼，开启了大小乘智慧，根本佛法不会讲错，不会误导众生走错修行方向，更不会断众生的法身慧命，之后再亲自讲经说法接引众生，这样是最好的。众生护持法师弘法，也要具备择法眼，择法眼是七觉分之一，有能力分辨法之对错，否则根本佛法宣传或助宣错了，其果报也很重，一定要慎重。</p><p>众生没开道眼时，往往把邪当正，把正当邪，颠倒错乱，或只认名师，不知名师与明师有很大的区别，有道未必有名，有名未必有道，分清名师和明师，才能做到依法不依人。宣传正法的福德很大，但如果传错了，错误的种子种到众生的心中，生生世世发坏芽结坏果，即使善知识来也很难纠正，因为众生都以先入为主。而真正的佛法很难与众生相应，与众生普遍所认知的习惯了的事理不同，众生就会产生排斥现象，心理很难扭转，弘法不可不慎。</p><p>原文：<strong>复次，须菩提，菩萨于法，应无所住行于布施。所谓不住色布施，不住声香味触法布施。须菩提，菩萨应如是布施，不住于相。</strong></p><p>释：这一段是世尊告诫菩萨修行布施时，不应住在色声香味触法等六尘上，一法也不住着。布施不为求得三界世间有为的福报，不为求得財色名食睡等五欲之乐，不求众生感恩和报答，不为升天享福，菩萨心应该像如来藏一样无所住。</p><p>如来藏布施时，没有住着之处，六根六尘是祂提供给我们的，六识是祂变现给我们的，让我们有眼触色，有眼识见色，有耳识听声；是祂产生的身体，又变现出触尘，出生身识来觉触；是祂产生意识心，我们才能妄想分别判断推理，喜怒哀乐七情六欲，又善又恶的心念等等。如果不是祂，我们简直什么也做不了，不能经商、政治、生活事业、造善造恶、布施修学，没有祂就是死人，是祂给我们寿命暖度识心，祂如果离开，我们当下就死亡，寿命没了，身体冰冷僵硬，呼吸心跳脉搏当下停止，血液也不流动了。</p><p>祂就是我们的命根，我们一切的一切，祂真是一个大布施者，而对我们却一无所求，就连一声赞美也不需要，对祂歌功颂德祂也不听，更不要说欢喜了。因为祂无眼耳鼻舌身意，无色声香味触法，无眼识耳识鼻识舌识身识意识，所以祂没有喜怒哀乐，没有知见分别妄想，相反是我们的妄心七个识有我知我见我爱我慢，妄想分别，有见取见戒禁取见，六十二见这些邪见。有见即邪，即是妄心，无见即正，即是真心，所以菩萨布施应向如来藏学习，不住于一切相上。</p><p>原文：<strong>何以故？若菩萨不住相布施，其福德不可思量。</strong></p><p>释：住相布施，心被相所局限，心量就小，其福德就有限量，心不超出六尘相就不能得解脱，也不能成佛。能布施的心是妄心七个识，以六识七识为主，决定布施的是意根第七识，也叫末那识，祂思量着应该布施，布施什么布施多少布施给谁，都由祂作主决定，而布施前的分析推理判断观察都由意识来做，把结果报告给意根，说服意根，意根思量后，有时照做，有时不照做。所以我们有时觉得应该这样，不应该那样，可实际做起来就相反，自己也觉得无奈，见色原文意根不一定听从意识的引导和规劝。</p><p>学佛后觉得吃肉不好，应吃素，可一见肉就要吃，管不住自己，这就是意根总是按照自己的习气做事，不容易改变。明明答应布施一百元钱，可真拿钱时就犹豫了，答应时是意识心经过分析觉得应该这样，拿钱时意根做主，意根我心重，不肯往外施舍，需要经过长期的熏陶，意识长期的开导说服，祂才能转变，所以意根要变，一切皆变，我们的果报就不同了。菩萨不住相布施，福德无量无边。像如来藏的福德多得不可说，宇宙虚空属于祂，三千大千世界属于祂，华藏世界属于祂，世界海属于祂，諸佛的三十二相八十种好属于祂，没有一法不属于祂，但祂什么也不要，祂的福德说不出来。</p><p>原文：<strong>须菩提，于意如何？东方虚空可思量否？不也，世尊。须菩提，南西北方，四维上下虚空可思量否？不也，世尊。须菩提，菩萨不住相布施，福德也复如是不可思量。须菩提，菩萨但应如所教住。</strong></p><p>释：在虚空中以任意一点为中心，向外扩展都有十个方向，每一个方向都无尽止，无边际，无涯岸，不可思量的广阔，任谁也到不了它的边际。如果有边际界线，那么那一边是什么？说无就是虚空，说有都在虚空里。虚空不是真实有的法，是假法，是相对于色来讲，没有物质的处所就是虚空，有物质就不是虚空，物质与虚空是相对立的法，有此就没彼；也可以说是互存的法，虚空能包容物质色法，物质色法里也有空间空隙。</p><p>比如把一只箱子放在一个处所，这个处所原来一无所有，是空的，放上箱子就不空了，那原来的空哪里去了，何处多了个空？人们在地里打井挖土，挖出一尺见方的土，那地方就出现一尺见方的虚空，这个空从哪里来？没有来处，把土又填回原处，空没有了，空到哪里去了？没有去处，实际上虚空从如来藏来，之后又灭回如来藏。</p><p>虚空没有边际，所以十方世界都可以在虚空中建立，每一尊佛成佛，都在虚空中建立佛国土，一个三千大千世界，所有众生都成佛，都在虚空建立一个又一个无量个世界，都能承载得下。这样的虚空可思量的吗？谁能思量呢？为什么菩萨不住相布施福德不可思量呢？因为不住在相上，心无所执，就得解脱，了生脱死出三界。但菩萨不出三界，不入无余涅槃，世世在三界中自利利他，直至成佛。</p><p>成了佛的福德可思量吗？单说八地菩萨的福德，一念之间不用作意加行，就能变出一个三千大千世界，珠宝无数，鱼米肉山无数，救度众生无数。手托着地球上的众生送到其它星球，众生不知，菩萨开口把四大海吞入口中，海中众生不知不觉，菩萨说变一尊佛就变，而且分身无数，广度有缘。更何况是佛的福德，更加的广大无边际，不住相布施的福德就是这样广大无比。我们要把心量放大又放大，千万不要小心小量拘束自己。菩萨们应该这样住着，住在无所住上，不执著一切法，一有所住就不成佛，菩萨们应该这样遵从世尊的教导，如是行于布施。</p></div>"
},{
    "title": "第七章　如理实见分第五",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第七章　如理实见分第五</strong></p><p>这一品继破四相之后，更深一步地破所有相，包括佛的身相，以突显如来法身，突显实相法。</p><p>原文：<strong>须菩提，于意云何？可以身相见如来不？须菩提答：不也，世尊，不可以身相见如来。</strong></p><p>释：佛说：须菩提，你怎么认为？要见如来是见如来的色身吗？有色身的才是真佛吗？是从身相上见如来吗？须菩提说，不是这样，见如来不是从身相上来见。真佛未必有相，因为魔王也可以变出三十二相的佛来，那个不是真佛身。</p><p>佛有三身：法身、报身和化身。法身是真如理体，不可见闻触摸，法身无相，又无一相不是祂，不由祂而显现，不由祂而成就。法身又称为大圆镜智，光照大千十方世界，无一法不在祂的照耀下，无一法能脱出这个圆镜外，都是镜中像。祂具备无量无边广大智慧，无有一法不了知，无有一法不能变现，功德圆满，万法具足，也名为一切种智。报身佛是佛三大阿僧祗劫修行所报得的庄严色身，釋迦佛的报身住在色究竟天宫中，为初地至十地的法身大士说法，宣讲道种智，成佛的智慧，教菩萨们修学如来藏中所含藏的功能种子。但菩萨必须有四禅以上的禅定，才能生到色界最高层天听佛亲自讲法。</p><p>报身佛有自受用身和他受用身，自受用身是佛自己受用，他受用身是世尊为菩萨们显现，菩萨的证量不同，所见报身佛的身量身相也不同，这是菩萨的福德智慧所感召的，不是佛有分别。报身佛的寿命是七百万阿僧祗劫，一个阿僧祗劫有无数大劫，一大劫中有成住坏空四个中劫，一个中劫有二十小劫，一个小劫有一千六百八十万年。佛的报身身量非常广大，地球与佛身比起来，就像佛手中的兵乓球那样大小，佛两眉间的一根白毫伸出去，可以环绕五个须弥山。</p><p>应身佛是应十方众生的根机而显现出的与众生相似的色身，相同的寿命，需经八相成道而成佛，就是降兜率－入母胎-出胎-出家-降魔-成佛-说法-涅槃。出家以后，世尊示现和众生一样托钵、饮食、洗浴、睡眠、起居，佛可以不用这些，故意示现与众生，因为众生根钝，不与众生平等众生就不能随学，以为佛本来如此神奇，我们学不来，佛就没法教化众生。应身佛入涅槃，不像阿罗汉那样灰身泯智，住在一无所有境界中，而是有一个解脱色，总有一个色身来利乐众生，在此世界灭度了，又在其它世界现起一个色身，而那个色身是解脱的，没有烦恼和习气，断尽所有无明，包括一念无明、无始无明、尘沙无明。</p><p>一念无明四果阿罗汉才能断尽出三界；无始无明菩萨们证悟后就断除了，众生从无始劫以来就不知道有个真心如来藏，也没发现祂在哪里，证悟后才了知，无始无明就打破了。尘沙无明是众生心中有像灰尘和沙子一样多的不懂的事理，都存在如来藏里，开悟以后一样一样都弄懂，如来藏里的种子功能作用都了知，无明没有了，也就圆满成就佛道了。很多人所说的所知障就是成佛路上有太多不懂的东西，障碍着众生成佛，弄懂一个事理就减少一个障碍，都懂了，像尘沙无明一样多的障碍就都没有了，万事就大吉。</p><p>化身是佛用神通三昧变化出的无量色身，分布在十方世界广度有缘，应以何身得度就现何身而说法，与諸众生同事同行。报身、应身和化身都由法身而出生，是生灭变化的、无常的，不是真佛，所以要见如来就不能以身相来见。真佛无相，有相就不真，就是幻化出的假佛，如来就是性德，就是真如，就是法身，不可以身相得见，因为法身没有身相。<span> </span></p><p>原文：<strong>（须菩提言：）何以故？如来所说身相，即非身相。</strong></p><p>释：须菩提回心大乘后，修学实相真如理，智慧通利，能深刻理解佛所说的真实义。上一句世尊说的如来身相是什么相呢？须菩提说如来所说的身相是没有色身相的相，是无相的相 。法身佛无相具有八不中道无量中道之理，真实存在，有真实功德作用，具有般若德、解脱德和涅槃德。解脱德是指法身不著一法，不住一法，不被一法所系缚，祂不在三界里，非不在三界里，不在三界外，非不在三界外，对一切法都如如不动；涅槃德是指法身具有不生不灭性、不来不去性、真常性、寂灭性、清净性、不变异性、常乐我净性；般若德是指法身能出生万法的大智慧。</p><p>原文：<strong>（佛告须菩提：）凡所有相，皆是虚妄。若见諸相非相，即见如来。</strong></p><p>释：所有相包括眼所见的色相：宇宙虚空、山河大地、花草树木、鸟兽人物等；耳所听的声：人畜声、宇宙声、河流万物声等；鼻所嗅的各种香味臭味酸味腐烂味；舌所尝的酸甜苦辣味；身所觉的饥渴、冷热、软硬、酸麻、疲乏、轻安、烦闷、饱胀痛等触尘；以及心里所分别的善恶是非等等一切法相。这些相在众生看来都是真实的，有真实的作用。从实际理地来说，这些相都是虚妄的，并不真实，都是由如来藏出生和显现出来的。</p><p>如来藏中有地水火风四大种子，这四大种子按照一定的比例结构和合在一起，变幻出宇宙器世间、须弥山天宫、四大洲、四大海、矿植物等。众生的色身也由如来藏变生，由于意根带着无始劫来的烦恼习气和执著，不肯灭掉自己，总想有个色身可用，死后就有中阴身，看到未来世的父母和合，就投奔过去，参与其中。该生为男子的就对来世的母亲生起贪爱，该生为女子的就对未来的父亲生起贪爱，在父母和合的最后一刹那，生起欢喜心，意根和如来藏就被拘执在父精母血中，形成受精卵，入住母体。如来藏吸收母体中的营养元素不断变化受精卵，七天一变，变出头、四肢、五根、五脏六腑，四五个月以后产生意识、耳识、鼻识和身识，身心都成熟后，如来藏吹业风，胎儿头向下出母体，成为婴儿，又通过吃奶吃饭，如来藏吸收饮食里的营养元素变化色身，所以色身是由如来藏变现的。</p><p>众生眼见色时，以为真能见到色，其实外面的色众生从来见不到，眼根所触到的只是一个假相一个影子，如果外色真的贴到眼根上，也就看不见这个外色了。如果眼真能触色，眼见一把尖刀，刀尖和眼接触，一定会刺伤眼球；眼见火，火和眼睛接触一定烧着眼球，眼见沙子，沙子和眼接触，一定会迷了眼睛。眼根和色是接触不着的，色与眼根有一定距离才能传导色尘的四大微粒，如来藏通过眼根和外色接触，把外色变为一模一样的影子，才能见到；如果色贴在眼根上，没有空间距离，就见不到色。鼻根、舌根和身根与外界的香尘、味尘和触尘能够直接接触到，不需要一定的距离和空间，三个识就能被生出来了别香味触。</p><p>眼识所见的这个影子与外色的物质有差别，不是实物，才能通过视网膜及传导神经传到后脑主管视觉的胜义根，如来藏在那里变出眼识，眼识就分别了色尘，这个色和外色好像是一样的，实际上是相似，众生就认为是真的，实际上都是影子。同理，耳根、鼻根、舌根也一样，都接触不到外声、香、味，都是如来藏接触，然后变现。只要是有生的都是虚妄幻化的，这就是万法唯心造的道理。总之，凡所有相都是虚妄的，若见諸相非相，即见如来。如果能在五阴十八界的各种相上，找到一个没有相，不是相的如来藏，就是见如来，明心证悟见实相了。</p><p>既然各种相都由如来藏出生和显现，那么各种相的运作都离不开如来藏，见相时有智慧的人就能发现与相在一起的实相。是谁发现实相真心呢？是妄心，开悟就是妄心找到了真心，然后获得了般若智慧。在五阴十八界运行的各种虚妄相里都可以找到真心，比如举手投足、迎来送往、念佛拜佛、打人骂人中都有真心一起远行着，六祖说：若见性，轮刀上阵也见，即是此理。</p><p>维摩诘经说：菩萨举足下足都从道场来；唐朝庞居士说：搬柴及运水，神通并妙用；德山用棒子打人来召示学人这个道理；临济用大喝来指示学人；赵州则说：吃茶去；永明禅师告诉弟子：拜佛去。这些禅师无不是在用各种机锋手段指示学人，福德因缘具足了，就悟入实相，发明大事。一个弟子找到师父说：自某甲到此已三年了，从不见师父为我开示佛法，师父说：我什么地方没开示？你递水来我就喝，你送饭来我就吃，你问讯我就和南，什么处没开示佛法？弟子听后沉思，师父说：要见就见，思个什么？弟子马上就悟了。</p><p>一个禅师见到弟子总爱打骂，一天弟子终于忍不住了，对师父说：你为什么不是打就是骂？师父一听，用手指着他说：你敢诽谤我？举手要打，弟子就喊救命，师父用手一下捂住他的口，弟子豁然大悟，这禅师多么会开示啊，百千三昧就在里许。一个徒弟请教师父佛法，师父说：种地去，这傻徒弟听不明白话音，真的去种地，种完地还没明白，又去问佛法，师父说：扫院子去。这傻徒弟就去扫院子，扫来扫去，突然间就扫明白了，原来是这么回事，找到真心了，回去礼谢师父，这院子就没白扫。扫地当中就有奥秘，处处都有奥秘，要在当人会参，用对心思，找对路子。在我们日常生活中，处处都有如来藏的身影，显现出一个不是相的相，若找到了，就是见如来了。那么在这里就恭祝诸位早日在相上见到那个不是相的实相，见到真实的如来，解决生死大事。</p></div>"
},{
    "title": "第八章　正信稀有分第六",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  正信稀有分第六</strong></p><p>原文：<strong>须菩提白佛言。世尊。颇有众生得闻如是言说章句。生实信不。佛告须菩提。莫作是说。如来灭后。后五百岁。有持戒修福者。于此章句能生信心。以此为实。当知是人不于一佛二佛三四五佛而种善根。已于无量千万佛所种诸善根。闻是章句。乃至一念生净信者。须菩提。如来悉知悉见。是诸众生得如是无量福德。</strong></p><p>释：须菩提问：难道真的有众生听闻了这样的说法和义理，能够真实的信受吗？上一品世尊开示：凡所有相皆是虚妄，若见諸相非相，即见如来。须菩提听后就生出疑问来，怀疑众生听闻这样深的章句义理，能否会真实的信受。</p><p>这个问题提得很合时宜。因为众生根基利钝不同，福德智慧不同，对法的信受就不同。薄福钝根的众生很难信受真实的大法，往往生起疑谤。古来就有此事，法华会上不是有五千弟子不信受大乘而退席吗？这也是正常现象，历劫都有不信受实相法而谤法的事情。因为众生未断结缚，恒生我见、见取见、疑见等邪见，不具正知见，谤法不信是必然的。我见是以五藴十八界为主的知见，认为这个我是真实的，五藴的功能作用是真实的。</p><p>见取见是众生以自我知见为主，不管正确与否，他人即使正确也不信受。又因为众生没有证得实相心，对世间及出世间的各种看法知见都是错误的邪的不正确的，如外道的六十二见。疑见是众生对正确的法理和善知识不能作正确的判断和认知，心存疑结。由于这些个结紧紧的束缚着众生，使得众生不能摆脱无明。再加上众生福德因缘不具足，难免谤法谤三宝，更何况末法时期。</p><p>世尊正法一千年，像法一千年，末法一万年。如来灭后的后五百年，有可能指末法临灭前的五百年，在那时很少有持戒修福的了；如果有，一定是善根福德很深厚的人，看到《金刚经》讲破如来身相，破一切法相这样的章句，能深信不疑，赞叹如来说法真实，那个人一定稀有难逢。凡是信受金刚经句及义理之人，就是正信之人。</p><p>达到正信，非常不容易，在菩萨的修学道上已历经十信位修学阶段，进入修福持戒修忍修定修慧的十住位阶段，四加行暖、頂、忍、世第一法修圆满了，菩提资粮也具足了，破除一切假相，证入实相。这得要经过几十劫、几百劫、几千劫，甚至更久远时劫，来熏修佛法，从而具备了正见。期间必然经历、供养过无数諸佛，已在无量千万佛所听经闻法、种諸善根、积諸福德，非是短劫所能办到。无数众生发心修道，只有极少数人到此地步。所以看到大部分人都在初学阶段就不会奇怪了。修学佛道甚不容易，只因无量劫又无量劫地流转生死，无明根深，善根浅薄，非几日阳光就能融化久积的坚冰。</p><p>原文：<strong>闻是章句，乃至一念生净信者，须菩提，如来悉知悉见，是諸众生得如是无量福德。</strong></p><p>释：佛也称为一切种智，就是福德具足圆满，智慧已究竟彻底圆满，世及出世间法全部了知，没什么可修的了。所以佛佛道同，没有谁高谁低，谁尊谁卑，谁大谁小的问题。若说世上还有超过于佛，尊贵于佛的，简直就是狂慢无知之谈。若如此，諸佛还需要修行，若还需要修行，就不是圆满的，也就不能称为一切种智了。如来藏中所含藏的种子、功能全部了知，世及出世间法全部了知，无一法不知称为一切种智。这种智慧微细到十方世界同时下雨，佛都知道具体滴数。</p><p>一个世界就有十亿个四大洲，十亿个四大海，十亿个须弥山，十亿个欲界六层天，十亿个初禅天，以及无数个二禪以上諸天。十个方向该有多少个星体，多大的范围！下的雨滴数佛都了知。若是我们自己，巴掌大的地方下雨也数不出滴数来。佛的智慧再微细到，十方世界所有众生生一个心念，佛都了知。若是我们，连自己的心念常常都不觉知，念佛念经很久了，才发觉自己一直在打妄想，意根攀缘什么就想什么，心猿意马，很难制服。</p><p>十方世界众生有多少呢？我们地球这一个星体上的人类大约有六七十亿，畜生有多少呢？数不过来，一条鱼若产子的话可能有成千上万条，一米见方的土地蚂蚁有无数，各种昆虫和细菌更没法数。到处会生细菌，我们表皮每寸肌肤全部是细菌，九孔以及流出的泪汗等分泌物都是细菌，揭开皮肤，里面的肌肉筋骨骨髓血液脑浆内脏全部是细菌，无一处没有。</p><p>佛经上讲，这些细菌三头六臂，五颜六色，奇形怪状，互相厮杀吞没，如果数量种类不平衡了，我们就生病，皮肤病就是如此。所以用药杀菌时，另一部分有益菌被杀了，又得别的病。鬼神类众生，荒山僻野、河边林边、十字街头到处都是，甚至一颗小草上，也附着无福众生。楞严经中世尊说：清净比丘于歧路行不踏生草，况以手拔。无福众生以一颗小草为家，依附在草上，如果践踏或手拔，那会毁坏众生的家。再加上地狱众生，阿修罗类众生，非人类众生，一个小世界众生就这么多，一个大千世界，十方大千世界该有多少？</p><p>这么多的众生，每个众生起个心念，佛都了知。因此，哪个众生的缘熟了，善根成熟了，佛都知道，就会安排相应的因缘，令其得度。所以如果有人得闻金刚经中的章句，生起一念净信，如来当然会悉知悉见。每个众生无始劫来，受生哪道，造作了什么业行，受了什么果报，又种了多少善根，积了多少福德，何时能入道成道，佛都了知。</p><p>原文：<strong>何以故。是诸众生无复我相人相众生相寿者相。无法相亦无非法相。</strong></p><p>释：世尊说：为什么呢？是因为这些能够不著如来身相、知凡所有相皆虚妄的众生，早已没有我相、人相、众生相、寿者相了。他们先破了四种相，进而又破一切法相，达到无相。因为自性清净心本无一法相，所现一切相即为空和假。</p><p>法分为有为法和无为法、缘生法和非缘生法。五阴是法，十八界是法，三界都是法，真如也是法，是无为法。凡所能被人认知的都是法，不管看得见看不见，存在就是法，有真法和妄法，生灭法和不生灭法，因缘所成的法和先天就有不是因缘所成的法，从各个角度，各个方面，都有区别。</p><p>法有因缘法和非因缘法，因缘法即是空，即是妄；非因缘法是本来就有的法，即是真实法，不坏灭法。凡是直接指向成佛之法，就是究竟法，明心见性之法、真如之法即是究竟之法；而达到究竟法的方法是方便法。法相为有，非法相为空。不知道有真心的存在，不知真空生妙有，这种无见、空见是断灭空见。若没有实相心第八识存在，所有一切相的法相、空相、假相，从哪里来呢？如果说从虚空来，就是虚空外道，虚空什么也不能产生；如果说从大梵天、老母娘、上帝、耶稣来，那么他们又是从哪里来？断灭空者否定一切，也就会否定因果。因为因果律是由第八识来实现，是祂收藏业种，输出业种，平等的实现众生的因缘果报。无一法而有疏漏、混乱。</p><p>所以众生生来性别、相貌、父母、贫富、寿命、生存环境等等各个不同，就是第八识所含的业种不同。这些业种是前世所造。能够对金刚经中章句生起一念清净信的人，不仅破了四相，也没有一切法相，更没有一无所有的断灭空的法相了。而破四相证了大、小乘果位的人，没有不信受生死所依的第八识、阿赖耶识的，否则就不是证道之人。</p><p>原文：<strong>何以故？是諸众生若心取相，即为著我、人、众生、寿者；若取法相即著我、人、众生、寿者；若取非法相，即著我、人、众生、寿者。是故不应取法，不应取非法。</strong></p><p>释：世尊说：为什么是这样呢？因为这样的众生，如果心里取了相，著了相，就是著四相。著四相，必著法相。因为没破我相，站在我的立场和角度，就会见得一切法都真实，五阴身的行来去止、穿衣吃饭，以及知见、看法、感受全部真实，同时就会有其它三相的执著。</p><p>法相是三界的有法，三界依着众生的认知而有，有我才能认知三界的法相。所以若著法相，即著我、人、众生、寿者四相；若取非法相，认为一切法都空，也没有实相心第八识，就否定了我人众生出生的根源，以及寿命所依赖的实体，那么我人众生就不是第八识变现的，是自然存在的，没来由存在的，就不是虚妄的，一切的识心的功用都真实，不是由第八识所供给。这就著了四相，就是生死业障的凡夫众生。因此众生学大乘法，不应取着一法相，也不应取非法断灭法相。</p><p>原文：<strong>以是义故，如来常说，汝等比丘知我说法，如筏喻者，法尚应舍，何况非法。</strong></p><p>释：因为这个缘故，如来常常说：你们这些比丘们，应该知道我说法度人，就像船筏那个比喻一样，过了河就应该丢掉船筏，不用再踩着不放了，佛法也是，成佛以后就没有用了，临成佛时舍弃一切法就能成佛。是法尚且要舍离，何况是没有一法的断灭空法，更要舍离。</p><p>如来说法为什么用船筏来比喻呢？船是用来渡人过河的，到了岸边，需弃船才能上岸，不肯离开船就上不了岸。佛所说的法就是船，众生乘此法船就能登上大涅槃的彼岸。若众生心里还有一法存在不灭，就是不净，就是污垢，就是无明，不能圆成佛道，证得大涅槃。心中要弃舍一切法，空有都不著，要像真如心一样空空净净，一法也无。但是没到岸边时，千万不要弃船，生死海未渡，弃船何为？佛法是药，用来对治众生各种烦恼病、无明病。如来藏法是一味散，治疗众生所有无明病，服者必去无明，度过生死海，成就涅槃道。唯有此药能救脱众生，渡于涅槃彼岸。因此佛子想到涅槃岸，就要弃舍一切有法空法，法与非法。</p></div>"
},{
    "title": "第九章　无得无说分第七",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第九章　无得无说分第七</strong></p><p>原文：<strong>须菩提。于意云何。如来得阿耨多罗三藐三菩提耶。如来有所说法耶。须菩提言。如我解佛所说义。无有定法名阿耨多罗三藐三菩提。亦无有定法。如来可说。何以故。如来所说法。皆不可取。不可说。非法非非法。所以者何。一切圣贤。皆以无为法而有差别。</strong></p><p>释：佛言：须菩提，你如何认为呢，如来得到阿耨多罗三藐三菩提了吗？如来说了什么法吗？须菩提言：如我对于佛所説的法义的理解是，没有一种固定的法，可以称作阿耨多罗三藐三菩提，也没有固定的、决定不变的法，如来可以去宣说。为什么呢？如来所说的法，都不可以执著取着为实有的法，所以不可说。如来所说的法，非本来的那个无为法，也并非不是本来的无为法。为什么呢？一切的贤人圣人，都是以无为法而有差别的。</p><p>阿耨多罗三藐三菩提，就是无上正等正觉，得到无上的正真的觉受觉悟，破尽无明，不含一丝杂染无明，心中都是明都是觉，也就证得了究竟菩提，成就了佛道，圆满了佛果。既然没有什么固定的法叫作阿耨多罗三藐三菩提，那就没有真正固定不变的成佛者，一切法都是因缘所成。佛所说的法也是因缘所成，随顺众生的缘，有众生想成佛的因，就讲出能让众生成佛的法；缘不同，世尊所讲的法就不同。因此佛陀所讲的法，到最后也不要再执取了，因为不是固定永远不灭不转换的法，能说出来的法，都不是本有的固定不变的真如之法，但也离不开真如自性而能生成这些法。</p><p>那么是谁成就了佛道，得了佛果？妙觉菩萨是成佛前的最后身菩萨，为了成佛，来到人间八相成道。在入母胎时，菩萨的色身灭了，意根与异熟识即第八识入胎，出胎时六根具足，六识具足（人类七天之内没有眼识），五蕴具足，外相上与众生无异。这个新的五蕴已经不是妙觉菩萨的五蕴了，色身和六识都换了，只有意根和异熟识还是原来那个，是连续下来的。然后出家修道，在夜睹明星大悟见性时，七个识的无明断尽，第六识转成妙观察智，意根转成平等性智，然后前五识转成成所作智。七个识都转完了，第八识异熟识中所含藏的七个识的染污种子灭尽，就变为大圆镜智，也叫无垢识。八个识都转完了，圆满佛道，得佛果，称作佛。</p><p>那我们就分析这个佛是谁作，佛果是谁得。首先佛的无垢识是个无所得的心，本身不想得什么，即使得，也没有地方放，什么也得不到。祂没有思想，没有心行，从不自认自己是真实的，自己就是佛，自己如何如何。所有的名称都是人加给祂的，是什么不是什么，祂没有这些概念。祂又不执取任何一个法，包括善的恶的，染污的不染污的。因为不执取，祂从来不受熏染，没有无明；因为不执取，祂也就不做什么，不成为什么。所以祂不取佛的果位，不做佛，如果说祂就是佛，那也是人为加封给祂的，不是祂自己自认的自封的。</p><p>其次看佛的五蕴，众生的五蕴称作五阴，阴是遮盖遮挡的意思，遮挡众生认识真实正理，从而产生邪见。而佛的五蕴，不能遮挡佛，佛已经是究竟觉悟了，就称作五蕴。成了佛的五蕴身有三十二相八十种好，非常殊胜，但是涅槃时也要灭去，生灭之法不是佛，不能取佛果，不能做佛。佛的受藴想藴行藴识藴虽然能取，也是生灭法，涅槃时都要灭去，四个蕴不是佛，不能做佛。意根虽然能永远到未来世，永远保留不灭去，但也是生灭性的，是能够灭的，只是故意不灭掉，为了能永远生起佛的色身五蕴，而且单独一个意根平等性智也不能做佛。那么菩提就是无所得的，所以也没有定法可以称作阿耨多罗三藐三菩提。</p><p>为什么如来没有定法可说呢？佛到世间说法，都是根据因缘而说的，佛观察众生的缘，是什么缘，就要对机讲相应的法。佛成道的最初，先在各层天上讲华严经，度历劫跟随自己修行的大菩萨弟子。而娑婆世界的声闻弟子却如聋如哑，佛就回到人间为求解脱的声闻弟子讲小乘阿含经，让他们修行有了成果，再回转到大乘法来修学。因为娑婆世界众生根基浅，都想求解脱，想离苦得乐，所以佛在娑婆世界讲了三乘法。</p><p>而在其它的佛国土，佛只讲一乘法，就是一佛乘法，度菩萨根性众生成就佛道。佛讲法时总是依据一个缘，出现一个事相，于是佛就讲一个法，有时是弟子请问，都是有一个前提，一个缘，才讲一个法，无缘由而讲的法极少，那是特别重要的法，但也是对众生的机。所以佛说法是没有一定的，法是由因缘所形成的，不是固定的。所有的法，不管在哪个佛国土讲的，都是用来对治众生的无明病愚痴病的，有那种无明佛就讲那种法，无明灭尽了，法也没有用，不用法了。</p><p>所以佛法就如过河用的船筏，到岸就弃，用过就抛掉。这就说明法是依据因缘而有的，就是虚妄的空的，修到一定时候是不可以执著的。因为众生无明不同，佛讲的法也就不同，那就没有一个定法来让如来宣说。所以如来所宣说的法是不可以执取的，因为也是空的，因缘形成的，只是用一段时间修行，用完就弃，不可总执取，还有无明存在的时候就得抓着它，把它当作工具来用它。</p><p>比如四圣諦法，证了果得解脱以后，这个法对阿罗汉就没有用了，再修缘觉是十二因缘法，证得了辟支佛果以后，因缘法也没有用了，需要再修菩萨六度，明心见性以后，外门的六度法就没有用了，再修内门的六度，入初地。入地以后，内门的六度没有用了，再修十度波罗蜜，成为十地菩萨后，十度波罗蜜舍弃。修等觉妙觉的法，圆满佛道以后，一切法都用不着了，全部舍弃，心中空空无法。</p><p>因为所有的法都圆满修持过，成佛后才能为众生宣说。所以如来所说的一切法都不是本来而有的固定不变的法，都是空的，不是真实的法。但是也并非不是真实的法，因为众生依据这些法能够证得真实法无为法，而且佛在宣说这些法时也没有离开过真实的真如法，正是真如法在这里起了作用，佛才能宣说。这些法都来自佛的自心真如，从真如当中流露出来的，是真如的一部分，与真如是不一不异的关系。</p><p>为什么一切的贤圣人都证得了真实法，证得了无为法，还有差别呢？贤圣人包括初果到四果的声闻罗汉、证得因缘法各个品位的缘觉人、从明心的第七住位到妙觉的菩萨。声闻初果二果是贤人，三四果以及缘觉是圣人，菩萨初地以前是贤人，初地开始以后都是圣人。他们所证的都是无为法，然而这些无为法的内容和层次大不相同。初果人证得五阴空、无我，断三缚结，从此不入三恶道，对于三恶道行无所为，这是初步五阴无为。</p><p>二果人因为证了人我空，心行减少，烦恼淡薄，心清净了一些，无为了一些；三果人进一步证得五阴虚妄，色界禅定境界现前，证初禅灭掉贪欲，断嗔恚，断烦恼心清净，恶业不再造作，七识开始真正的无为；四果进一步无为，灭我慢，断除对色界无色界的贪爱，烦恼断尽，得慧解脱，对三界无为，能够以解脱的智慧出离三界；而定解脱的阿罗汉能入四禅定，息脉俱断，证不动无为，入无想定，证识阴灭，心得无为；俱解脱阿罗汉能随时随地入灭尽定，灭掉意根的受和想两个心所法，证想受灭无为，随时可以取证涅槃，出三界。声闻人因为证五阴无我，心行越来越无为，越来越清净，他们之间的无为有很大的差别。</p><p>辟支佛人包括独觉和缘觉，独觉人因为生生世世所修的善根，在没有佛也没有法住世的时候，看见世间一个生灭的现象，就引起了深深的思索，一个人到寂静处修道，探讨这些生灭现象的根源，推究十二因缘法和十因缘法，找到众生生死轮回的根是无明，源头是第八识心，证得辟支佛果。而缘觉人是随着佛修行，闻佛说法而悟十二因缘和十因缘法证果。他们无为法的智慧比声闻罗汉要高深，而辟支佛果的果位、智慧、神通也有浅深不同层次的差别，就是说他们心行的无为程度有差别。</p><p>菩萨们是明心证第八识，证真如无为，同时证人我空，知道第八识从无始劫以来从来没有生灭过，在三界世俗法中也不起心行，无为无我，五阴是第八识所生，本质是空。在随后的修行中，心渐转清净，修到第十住位，证得五阴如幻、一切法如幻观；十行位证得阳焰观，一切法都像海市蜃楼一样不实。到十回向位，证得如梦观，生生世世的五阴身活动就像在梦中一样，生生世世的修行、行菩萨道也像在梦中一样；初地菩萨证得万法如镜中的像一样不真实，直至十地等觉妙觉对无为法的证量越来越大，智慧越来越深，神通道行也越来越广大。那么佛地的究竟无为更不用说了，殊胜于一切声闻缘觉菩萨。</p><p>从以上内容来说，修行人因为修行的内容不同，所证的无为法就不同，无为的程度本质就不同，那么他们的心行心量就不同，福德不同，道行也不同，神通三昧境界也不同，智慧更有差别。如果不停止修行，追求佛道，修到佛地，到达终点时，一切都圆满，所有人的神通智慧福德都没有差别，可以称作佛佛道同了。</p></div>"
},{
    "title": "第十章　依法出生分第八",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十章　依法出生分第八</strong></p><p>原文：<strong>须菩提。于意云何。若人满三千大千世界七宝以用布施。是人所得福德。宁为多不。须菩提言。甚多。世尊。何以故。是福德即非福德性。是故如来说福德多。若复有人。于此经中受持乃至四句偈等。为他人说。其福胜彼。何以故。须菩提。一切诸佛及诸佛阿耨多罗三藐三菩提法。皆从此经出。须菩提。所谓佛法者。即非佛法。</strong></p><p>释：佛言：须菩提，你怎么认为呢，如果有人把三千大千世界的七宝拿来布施，这个人所得的福德是不是很多呢？须菩提言：太多了，世尊。为什么这样说呢？因为这种布施得的是福德，而不是福德性，福德性没有多少之分，所以如来才说福德多。佛言：如果有人在这部金刚经中，领受和修持至少一个四句偈，为他人宣说，所得的福德也比布施七宝的福德殊胜。为什么呢？须菩提，一切的諸佛以及諸佛成佛之法都是从这部经中产生出来的。须菩提，所谓佛所说的法并不是真实意义上的佛法，真正意义上的佛法是指真如佛性。</p><p>三千大千世界的七宝包括南瞻部洲地球上的人间七宝，北俱卢洲西牛贺州东胜神州的七宝、四大海龙宫的七宝、七金山的七宝、须弥山的七宝、四天王天的七宝、忉利天的七宝、焰摩天的七宝、兜率陀天的七宝、化乐天的七宝、他化自在天的七宝、色界十八层天的七宝。而一个三千大千世界有十亿个四大洲、十亿个四大海、十亿个七金山、十亿个须弥山、十亿个四天王天、十亿个忉利天、十亿个焰摩天、十亿个兜率陀天、十亿个化乐天、十亿个他化自在天、十亿个初禪天、一百万个二禪天、一千个三禪天、再加四禪天、五不还天、四空天、无色界四天。</p><p>这么多的星体山海的七宝无法计算，如果都布施出去，那个福德也无法计算。然而这种布施财宝的福德，全部是有为法，都是生灭法，也都是有量数的法，那么就可以磨灭、消耗尽、享受完，可以很迅速地消耗掉。在欲界几层天做天主，住在天宫里，与天子天女们游乐几世、几十世，福德就享没有了，之后就是无福的贫穷者，下三恶道的机会还是很大的。而有一种无为福，是永远也消不掉的，永远也不磨灭的，那就是如来藏所具有的福德性。</p><p>如来藏里含藏着地水火风四大种子，这四大种子和合在一起，按照各种比例构成七宝、百宝，无数之多的宝贝，三千大千世界的七宝、七金山、须弥山、四大海、天宫以及整个三千大千世界、十方諸佛国土都来自于众生的如来藏。所有众生的色身、声闻缘觉菩萨的色身、佛的色身都来自于各自的如来藏。</p><p>而且这个如来藏是成佛的真体，众生修行的善法种子都存在各自的如来藏中，多储存一个善法种子就消掉一个恶法种子，恶法的无明灭尽，就成就佛道。那么一尊佛的福德，没有数量无法计算，带给众生的福德也无量无边，不可计数。有为的福德才能计算，才说是多的大的，无为的如来藏的福德性无法计算，不能用多和大来表示和比喻。多多都是少，多大都是小，只要有数量就是小，那个无量的表示不出来的，才是最大最多。所以无为福远远殊胜于有为福。</p><p>那么怎么修这个无为福呢？佛说，如果有人能够修学金刚经，领受了经中的真实义理，证得了金刚心以后，为他人讲说，即使只能够宣说经中的一个四句的偈子，所得的福德也远远超胜于布施七宝的福德。金刚经就是宣讲这个像金刚一样坚实永不坏灭的如来藏的体性，如来藏是无为无住无相无生无灭的真实和清净性，证悟祂就获得根本无分别智。因为如来藏是一切法的起源和根本，祂不分别六尘境界法，具有无量的德能和智慧，所以称作根本无分别智；再观行如来藏的各种功德，就获得差别智或者叫后得智，智慧逐渐深利，福德渐增；再修学如来藏所含藏的种子，具有一分道种智就入初地，成圣人。</p><p>如来藏的种子功能修学了知的越多，智慧越广越深，进入八地时，不用加行作意，就能变出一切所需的物质，山河大地金银珠宝等等，也能变出一个三千大千世界佛国土，以及能够发起无量神通三昧利益众生。越往上修行，智慧越深，德能越大，分身越多，度众越多，成就佛道以后，智慧无边，福德无量。这一切全靠证悟如来藏为基础而发起的，一切的德能和利用、神通三昧都是从如来藏中来，不证悟就没有什么功德和受用，纵然如来藏当中具备这些，也不能有智慧和福德的发起。证悟如来藏就是如此的重要。</p><p>为什么能证悟如来藏呢？就是因为读诵、修学金刚经，贯通了其中的义理，戒定慧福德具足，就证悟如来藏了。然后再为他人宣说，让他人证悟，为他人打下成佛的基础，那个福德更是不可思议，也远远超胜于布施七宝的福德。</p><p>佛告诉须菩提，为什么证悟以后又为人宣说，其福德胜过布施七宝呢？因为一切諸佛以及诸佛所说的佛法，都是从这个金刚经也就是金刚心如来藏而来的。在证悟如来藏的前提和基础上，修学如来藏的种子功能，从此以后就能逐渐成就佛道，圆满菩提。诸佛三大阿僧祇劫所修行的善法种子都存在自己的如来藏里，恶业种子就没有了，无明灭尽就是佛。那么諸佛就是由如来藏而来而成就，成就以后就为众生宣说一切成佛之法，所说的法也都是从诸佛自心如来藏里流露出来。诸佛历劫所修行的善法种子，存在自己如来藏里，把这些种子流注出来，就成了佛法，所以一切佛法都从此经金刚心如来藏中出来。</p><p>佛对须菩提说：所谓佛法者，即非佛法。这句话就紧扣主题，成为这一品的中心句。佛所讲的一切成佛的法，就是所谓的佛法，人为地把佛说的法称作佛法。而佛所说的法，是佛所修持的法种留存在佛的如来藏里，根据因缘，演说出来，这个法种是后天存进去的，后天形成的，非本来的法，佛演说的时候也是根据因缘，说不同的法，这个法也是因缘所生的法，非本来而有的固定的法。既然不是本来而有的固定的法，就不是真正意义上的佛法。</p><p>真正意义上的佛法是本来而有的，永恒不变的，不生不灭的，非因缘而有的，本来如是的，法尔如是的如来藏、无垢识、真如、第一义諦、第八识、异熟识、大圆镜智。其它都是人为的命名称谓，方便说为佛法。总而言之，世出世间法只有真如一法是真实法，是真正意义上的法，是本来法，实相法，其它都是后天生起的，因缘形成的，能够生灭的法，都不是实相法。</p></div>"
},{
    "title": "第十一章　一相无相分第九",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  一相无相分第九</strong></p><p>原文：<strong>须菩提。于意云何。须陀洹能作是念。我得须陀洹果不。须菩提言。不也。世尊。何以故。须陀洹名为入流。而无所入。不入色声香味触法。是名须陀洹。须菩提。于意云何。斯陀含能作是念。我得斯陀含果不。须菩提言。不也。世尊。何以故。斯陀含名一往来。而实无往来。是名斯陀含。</strong></p><p>释：佛言：须菩提，你怎么认为呢，须陀洹能不能这样想，我得了须陀洹果？须菩提言：不能，世尊。为什么呢？须陀洹已经入了圣道流了，虽然如此，也没有所入之处，他不入色声香味触法，这才称作须陀洹。初果人名为须陀洹，证得五阴十八界苦空无常无我，断三缚结，成为贤人，入了圣流。即使懈怠不修行，也能人天七次往返，成四果罗汉，得解脱出生死轮回。</p><p>须陀洹断我见以后，不会再把五阴当作自己，当作我。所以证果以后，不再认为有个我证果了，我能证果，我证果了，是须陀洹果，如果是这样，内心里还是有个我，那就没有断我见，没有证果。须陀洹人虽然入了圣道流，其实是没有一个入处，凡夫认为六尘色声香味触法是真实的，是自己所拥有的，总是取着六尘，攀缘六尘，心入六尘。断我见以后，不再认六根六尘六识是真实的，是自己或者是自己所拥有的，不再取着六根六尘六识，也不入六尘中，这才是须陀洹人。</p><p>佛言：须菩提，你怎么认为呢，斯陀含能不能有这样的念头，我得了斯陀含果？须菩提言：不能，世尊。为什么呢？斯陀含是一往来人，然而确实没有往来，这才称作斯陀含。二果斯陀含，烦恼比凡夫比初果人要轻微，命终升天一次，回人间一次，就取证四果罗汉，得解脱出轮回。他同样不把五阴十八界当作我，心中没有我的概念，所以不认为有个我证了斯陀含果，不认为我能证斯陀含果。斯陀含人不再把欲界境界当作真实有法，这些都属于六尘境界，都是虚妄，所以他往生天上，也就没有所往之处；回来人间，也没有所回来之处，没有一个五阴的斯陀含能够来往人天，所以实没有往来。</p><p>原文：<strong>须菩提。于意云何。阿那含能作是念。我得阿那含果不。须菩提言。不也。世尊。何以故。阿那含名为不来。而实无不来。是名阿那含。须菩提。于意云何。阿罗汉能作是念。我得阿罗汉道不。须菩提言。不也。世尊。何以故。实无有法名阿罗汉。世尊。若阿罗汉作是念。我得阿罗汉道。即著我人众生寿者。</strong></p><p>释：佛言：须菩提，你怎么认为呢？阿那含能不能这样认为，我得了阿那含果？须菩提言：不能，世尊。为什么呢？阿那含称作不来人间，而确实没有不来人间的人，所以名为阿那含。三果阿那含命终以后，再也不回人间，直接在中阴身入涅槃，或者在色界各层天证四果，得解脱入涅槃。阿那含人同样心中没有五阴十八界我，不认五阴为我，没有我证阿那含果的概念。既然没有我，也就没有阿那含人不回人间这回事，所以才称作阿那含。</p><p>佛言：须菩提，你怎么认为呢，阿罗汉能不能这样想，我得了阿罗汉道果？须菩提言：不能，世尊，如果阿罗汉有这样的念头，我得了阿罗汉道果，他就是着了我相、人相、众生相、寿者相。证初果就已经破了我相，不认五阴为我，没有我相了，同时就没有了与自己一样的人的相了，那么六道众生的相也就破了，没有了；在众生身上的寿者相寿命相也是不真实的，没有寿者相了，四果罗汉更是没有四相，不着四相了。</p><p>所以阿罗汉不会认为有个我得阿罗汉果了，也没有什么法称作阿罗汉，色阴不是阿罗汉，受阴不是阿罗汉，想阴不是阿罗汉，行阴不是阿罗汉，识阴不是阿罗汉，六根不是阿罗汉，六尘不是阿罗汉，六识不是阿罗汉，和合起来也不是阿罗汉。既没有阿罗汉，也没有阿罗汉的果位，这些果位都是施设的假名而已，并没有真实的果可得。</p><p>原文：<strong>世尊。佛说我得无诤三昧。人中最为第一。是第一离欲阿罗汉。我不作是念。我是离欲阿罗汉。世尊。我若作是念。我得阿罗汉道。世尊则不说须菩提是乐阿兰那行者。以须菩提实无所行。而名须菩提是乐阿兰那行。</strong></p><p>释：须菩提言：世尊，佛说我得无诤三昧，在所有声闻人当中是第一的，最为超胜的，是离欲最彻底的阿罗汉。世尊，我不作这样的念想：‘我是离欲阿罗汉’，世尊，我如果有这样的念头：‘我得了阿罗汉道果’，世尊就不会说须菩提是喜欢寂静行的人。因为须菩提确实没有什么可得的可作的可行持的，才名为须菩提是喜乐于寂静行的人。四果罗汉不仅断了我见，也断了对自我的执著，意根对自我五阴的贪爱、执著断尽了，我慢断尽，心中彻底无我了，既然没有我，就不会去与人争论高低上下对错，是非长短强弱，心中寂静清凉了，这就是无诤三昧。而须菩提是最无诤、最寂静的，最随顺于人和事的。</p><p>离欲是离开各种欲望、各种欲界所有的希望欲求，以男女欲为主，包括財色名食睡，色声香味触五尘。证初果以后，发起初禅，色界境界现前，身心极乐，因为这种乐触远远殊胜于欲界的各种乐，也超胜于男女欲的乐，于是就对男女欲不喜乐，对欲界的五尘不喜乐了，对财色名食睡不喜乐了，这就断欲了，再断嗔就是五下分结断尽，成为罗汉三果人，那么四果罗汉更是断欲离欲。</p><p>须菩提断欲最彻底，是第一离欲人。然而须菩提没有我是离欲阿罗汉的念头。如果须菩提有这个念头，那么他就有个我，有离欲这个事，心就不寂静，不清净，世尊也就不说须菩提是喜欢寂静行的人。因为须菩提心中无事，无欲无为，又看空十八界中一切法，认为一切行都是空，所以须菩提也就没有什么可行的，在空幻法中虚妄法中没有什么可做的，所做一切都是空，并没有其事。这样须菩提才是一个喜乐于寂静行的人，无所为行的人。</p></div>"
},{
    "title": "第十二章　庄严净土分第十",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十二章  庄严净土分第十</strong></p><p>原文：<strong>佛告须菩提。于意云何。如来昔在然灯佛所。于法有所得不。不也。世尊。如来在然灯佛所。于法实无所得。须菩提。于意云何。菩萨庄严佛土不。不也。世尊。何以故。庄严佛土者。即非庄严。是名庄严。</strong></p><p><strong>是故须菩提。诸菩萨摩诃萨。应如是生清净心。不应住色生心。不应住声香味触法生心。应无所住而生其心。须菩提。譬如有人。身如须弥山王，于意云何。是身为大不。须菩提言。甚大。世尊。何以故。佛说非身。是名大身。</strong></p><p>释：佛告须菩提：你怎么想呢？如来往昔时在燃灯佛所，有法可得吗？得到了什么法吗？须菩提言：没有，世尊。如来在燃灯佛所对于法确实没有得到。佛言：须菩提，你怎么认为呢？菩萨庄严佛土吗？须菩提言：不庄严，世尊。为什么呢？庄严佛土的行为就不是庄严，是假名的庄严。佛言：是这样，须菩提，諸菩萨摩诃萨，应该这样生清净心，不应该住在色上生心，不应该住在声、香、味、触、法上而生心。应该无所住地来生其心。须菩提，譬如有人，身体像须弥山王一样高大，你怎么认为，这个身体是不是很大呢？须菩提言：非常大，世尊。为什么呢？佛说不是真身，才是大身。</p><p>释迦菩萨遇见燃灯古佛时，刚入八地，在此之前，释迦菩萨生生世世值遇佛，做国王、转轮圣王、诸天天主，以饮食衣服卧具医药四事供养于佛，从不间断，甚至以身供佛。但是每尊佛都没有为释迦菩萨授记何时成就佛道，因为菩萨那时对于佛法的修证，还处于有为行，以有所得心而修证，和供养每位世尊，还没有达到无所得无所求的无为。直到遇见燃灯古佛时，释迦菩萨进入八地无为不动地，心里无所为无所得了，燃灯佛才授记释迦菩萨，何时成就佛道，佛国土是怎样的，弟子有多少，寿命多少，佛法住世多久。</p><p>佛给菩萨们授记大多数都在菩萨们已经入八地了，八地菩萨对于佛法的修行已经达到念不退，所有八地菩萨的修行速度都差不多的，祂们的成佛时劫是定下来的，不会再改变了，这时为菩萨授记是不会出差错的。而初地到七地菩萨的修行境界是行不退，就是在修行度众方面的行为是不退的，无论如何都会修行和度众，但有时遇到逆缘还会有心念上的退转，这种退转时间长短不一，有一两天，有几小时，有几分钟，有一刹那不等。</p><p>因为有这种心念的退转，修行的速度就不一定，授记难免有时间上的偏差，而且也会让菩萨生起懈怠心。明心开悟到初地之前，是位不退，修证的果位不退了，但是还有行为和心念的退转。有时会被世俗法所障住，忙些世俗上的事务，或被逆缘所障，或被病魔所障，而没法修行了。但无论修行与不修行，明心的第七住位、十行位、十回向位是不退的。</p><p>为什么释迦菩萨在八地不动地时，于法实无所得呢？八地菩萨不仅断了烦恼，也断了烦恼习气。解脱的功德受用也超过了三明六通的大阿罗汉。人我执早已断尽，法我执也断除很大一部分，无生法忍智慧也很深利，双证人空和法空，心里不会有一个我修行了法，证了法，得了法，同时也不会认为有法可修可证可得，内心是纯无为境界。因为是无为、心空，不用作意加行就能变现出众生所需要的一切，甚至变出三千大千世界一个佛国土。</p><p>一个无所得的心，心量是极大的，就有极多的功用，而有所得的心，心量是狭窄的，心的功能作用就有局限，不能完全发挥出来。菩萨为什么不庄严佛土呢？我们首先看佛国土的形成，是由佛的无垢识大圆镜智所产生变现出来的。与佛有缘的众生要往生到那里去，众生的如来藏也在变现着那个佛国土。佛所现的国土，是佛三个无量数劫修行所感召和化现的。三个无量数劫中，菩萨发大清净愿，修行六度万行、十度万行，难行能行，难忍能忍。所修行的善法种子都存在自心如来藏中，成就佛道以后，佛的无垢识可以把修行的善法种子输送出来，就形成佛的清净国土，一个三千大千世界就建立起来了。</p><p>佛的国土是如何的庄严，要看佛修行过程当中所发的大愿具体是什么，修行过程当中的行为造作是怎么样的，也就是佛的无垢识里的种子都有什么。那么菩萨三个无量数劫的修行，就是在庄严着自己未来的佛国土，这种庄严的方法根本不是世间的庄严方法，所以菩萨不庄严佛土。这种庄严方法，并非真实有，只是给这种方式方法取个假名，叫作庄严而已。</p><p>为什么这种庄严不是真实的呢？因为菩萨所发的清净大愿，是意根和意识心所发，是虚妄法，发过以后又灭去了，因此发愿就是生灭法，不是真实本来而有、永远不灭的法。菩萨在行菩萨道时的所有行为造作，都是生灭法，都已经消失灭去了，生生世世七识妄心的造作也都灭去了，所有的菩萨六度万行、十度万行都是七个识的妄心去做，是生灭法，菩萨行为是生灭法，都灭去了。因为这些六度、十度菩萨行的庄严方式方法不是真实的法，不是永远存在不灭的法，不是本来而有的法，就不是真正的庄严。</p><p>世尊说，因此诸菩萨摩诃萨要生清净心，不应该住在色声香味触法上而生心，应该无所住、什么法也不住地生心。菩萨生活在世间，在世间行菩萨道，与众生往来，七个识妄心不断地生起，产生各种行为造作，不断地分别六尘境界。这些心识的体性就是用来分别六尘、了知六尘的。要了知六尘，一定是在六尘上生起分别性，就要与六尘相对，接触六尘，就住在六尘上了。所以只要有妄心七识的分别活动，就是住六尘的，不是无所住的心。但菩萨通过修行，在接触六尘境界的时候，分别之后而不生起觉受，就能不住六尘，心无所着，心无所想，心无所思，其心渐渐空净，无相、无愿、无所作。</p><p>菩萨还有一个心如来藏，那是真正的无所住心，是不用修行本来就无所住的心，时时生心运行，却什么法也不知，看似呆呆傻傻，实则心量广大，智慧无比。如来藏在菩萨的身口意行中刹那刹那现行不断，时时配合七个识运转，心中却无一法，不分别六尘，不知六尘，不住六尘，所以如来藏是一个无所住的心。当眼根与色接触，眼识分别色，住在色上分别，如来藏不见色的相貌，不分别色的美丑，不住色；耳听声，鼻嗅香，舌尝味，身觉触，意思法时，如来藏不听、不嗅、不尝、不触、不思，不分别，完全不住在这些法上，所以如来藏心就是一个无所住的心。那么妄心七识要得到清净，就应该像如来藏学习，减少住着，减少了知，就能少生心动念。</p><p>六祖悟时，就是听五祖讲金刚经，讲到应无所住而生其心时悟道了，悟得了那个本来无所住的如来藏心，知道了如来藏的功德作用，说出五个何其自性：何其自性本自清净，何其自性本不生灭，何其自性本自具足，何其自性本不动摇，何其自性能生万法。</p><p>佛说，如果有个人的身体像须弥山一样的高大，这个人的身体是不是很大呢？须菩提说，很大，世尊。为什么呢？佛说非身，不是真实的身体，才称作大。有个大，就是有量数的，只要有数量，就不是无限量的，就是小。有数量的身体，不管多么高大，都是生灭的，生生世世生来灭去，灭去生来，不是真实性的，不是永久常存的。而非生灭的如来藏，任何数量也没有，没有时间的长短，没有形体的大小，没有一切相，又能包含一切相，十方世界都在其中，所以是无限量的大，是真正的大，什么也不能跟祂相比。</p></div>"
},{
    "title": "第十三章　无为福胜分第十一",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十三章  无为福胜分第十一</strong></p><p>原文：<strong>须菩提。如恒河中所有沙数。如是沙等恒河。于意云何。是诸恒河沙。宁为多不。须菩提言。甚多。世尊。但诸恒河尚多无数。何况其沙。须菩提。我今实言告汝。若有善男子。善女人。以七宝满尔所恒河沙数三千大千世界。以用布施。得福多不。须菩提言。甚多。世尊。佛告须菩提。若善男子。善女人。于此经中。乃至受持四句偈等。为他人说。而此福德。胜前福德。</strong></p><p>释：佛言：须菩提，如恒河中所有沙子的数量，像这么多沙子数量一样多的恒河，你怎么想呢，这些恒河中的沙子，是不是很多呢？须菩提说，太多了，世尊，光是那些恒河就已经很多了，何况这么多恒河里的沙子。</p><p>佛言：须菩提，我现在实话告诉你，如果有善男子善女人，把遍满所有恒河中沙子数量之多的三千大千世界中的七宝，都用来布施，所得的福德多不多呢？须菩提言：太多了，世尊。佛告诉须菩提，如果善男子善女人，在此金刚经中，受持整部金刚经甚至四句偈子，并且为他人讲说，所得的福德远远胜过布施七宝的福德。</p><p>这一品前面部分都容易理解，后面的受持金刚经为人讲说的福德胜过布施七宝的福德，不容易理解，我们就来看为什么是这样的。布施七宝的福德都是有为福，这种福是能消耗掉的，能享受尽的，而且极大多数是在世俗法中享，没有道心、没有智慧时，福大了还容易造业，就会感受恶业的果报。</p><p>就像魔王波旬，做人时修的福报很大，死后生到欲界最高层天——他化自在天做天主，管辖着欲界众生，总是希望自己掌控的众生越来越多，不愿意众生减少。如果有修道人修到初禅，他就来阻挠，甚至佛在讲法时，他也去障碍，目的是不想让众生出欲界脱离他的掌控。在末法中，他为了破法，常常变成各种模样混入佛教中来破法，正法说邪，邪法说正，众生不能识别，依之修行，谁也不能得解脱，都在魔王的控制中，等波旬的魔福享尽了，就要下地狱受恶报。所以有福无慧无道，也不是好事。</p><p>那么读诵金刚经，证悟了金刚心，那个福是无量无边的广大，可以获得无量的威德和利用。第一，断了我见，断三缚结，永远不下三恶道受苦，能得到解脱的功德受用；第二，智慧会越来越深利，有智慧就会有更多更大的福德；第三，有了定共戒和道共戒，不再造作身口意的恶业，苦受越来越少，修的善法越来越多，乐受就越来越大，天上人中乐受无穷；</p><p>第四，寿命越来越长，如果在天上做菩萨，行菩萨道，寿命是几千年几万年不等，在其它佛国土也是极长的寿命。修到八地菩萨，能断分段生死，寿命就不是一段一段的、一期一期的，寿命可以是无尽的长；第五，能随意改变四大种子的结构，可以随意变现一切物质，众生生活的资具、七宝百宝、山河大地、甚至大千世界；第六，可以获得甚深禅定，发起无量神通三昧，分身无数，度脱无量众；第七，能够变化极为殊胜的物质财富，广利大众，甚至能变化三千大千世界，行菩萨道，利乐众生；第八，最终成就佛道，圆满菩提，成为三界尊，福德智慧无穷无尽。</p><p>受持金刚经证悟以后，智慧越来越大，就有能力为人宣说佛法，让他人也能证悟。法布施本身的福德是很大的，众生受益了，福德就更大。在成就佛道的三个无量数劫中，由于度脱众生的生老病死苦，与无量众生结缘，将来就有众多弟子随学，可以依此建立自己的佛国土。一个国土的建成，必须有各个层次的弟子组成，没有弟子是不能建立国土，更不能成就佛道的。只有带领着弟子们修行，弟子们成就了，自己的修行才能上一个台阶，获得更高的果位。所以受持读诵金刚经，证悟金刚心，这个福德是无量的广大。</p><p>金刚心也是无为的心，没有三界法的心行，无所作为。正因为无所作为，才能做一切，成就一切法。无为心中所含藏的福德是极大的，是永远不能磨灭的，是谁也破坏不了，谁也夺不去的。那么这个无为的福该有多么殊胜，无以言表，要远远殊胜于布施七宝的有为福，不可比拟，不可说。</p></div>"
},{
    "title": "第十四章　尊重正教分第十二",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十四章  尊重正教分第十二</strong></p><p>原文：<strong>复次。须菩提。随说是经。乃至四句偈等。当知此处。一切世间天人阿修罗。皆应供养。如佛塔庙。何况有人。尽能受持读诵。须菩提。当知是人。成就最上第一希有之法。若是经典所在之处。即为有佛。若尊重弟子。</strong></p><p>释：佛言：须菩提，凡有谈说金刚经，乃至金刚经中的四句偈子等，应当知道这些地方，一切的世间天人阿修罗，都应该供养，就像供养佛的塔庙一样，更何况有人完全能够受持的读诵金刚经。须菩提，应当知道，这个人已经成就了最上第一稀有之法。如果是有这部经典所在之处，就是有佛。就像尊重佛的弟子一样，尊重这部经典。</p><p>为什么佛说不管在哪里，有说金刚经以及经中四句偈子的地方，应该供养，而且应该像供养佛塔一样？这句话含着佛法的大秘密，甚深密义，如果如实解答清楚，就会破了这个秘密，那么后果是极为严重的。在这里只能轻描淡写地叙述一下，不能深说。佛法中有言：万法唯心所现，唯识所变。无心不成事，成事的心，不只一个，真妄和合，都参与。其中第一能变识是第八识这个金刚心，祂是产生万法的主体识，法种直接从祂那里输出来，祂有触、作意、受、想、思五个遍行心所法，与种子接触，心专注于种子上，领受种子，了别种子，然后输出种子，变现与种子相应的法。</p><p>第二能变识是意根，祂首先攀缘于种子，起心想造作业行，但自己不能具体做什么，需要让第三能变识意识心按照自己的意图打算具体去执行。第八识知道后就配合意根和意识去完成想要做的事。所以在讲说读诵金刚经以及四句偈子的地方，就有金刚心——这尊佛的出现，那么就应该供养。供养是供养金刚心，而五蕴身就像佛塔一样，里面有金刚心——佛在住持着。因此，供养讲说金刚经的地方，就像供养佛塔一样；如果有人能够完全受持读诵金刚经，更应该供养。</p><p>什么样是完全受持金刚经呢？就是已经证得金刚心的人，这个人对于金刚心的整体全貌都了知了，对于金刚心是怎样产生五阴十八界以及大千世界的已经了知了，对于金刚心中所含藏的各种功能种子也了知了，到这时已经是地上菩萨了，当然更应该供养了。没有证得金刚心的人，是不能够完全受持读诵金刚心的，他对于金刚心的体性是模糊不清的，怎么能完全受持呢！</p><p>佛告诉须菩提，这个证得金刚心的人，并且有了道种智的人，已经成就了最上的第一的稀有之法。修行到达这种程度的人，当然是很稀有的，一个大千世界也没有多少。一个三千大千世界就像一个金字塔，在塔尖的是佛，只有一尊，无第二第三；佛的左膀右臂是等觉菩萨，往下是十地、九地到初地菩萨，一直到刚开悟的第七住位菩萨。越往下越多，越往上越少，刚刚接触佛法的人是极大多数。没有接触过佛法的人更多，三恶道中的众生无法计算。无量学佛人发心修行，修到开悟是极少的，入地的菩萨就极为稀少了。所以能够完全受持读诵金刚经的人更应该去供养，那个福是极大的。</p><p>佛说如果哪个地方有金刚经，哪个地方就有佛在。金刚经就是金刚心，金刚心就是佛。而且这个金刚经的形成和宣说，都离不开金刚心，还是有佛在，都是金刚心所形成和显现出来的。那么就应该像尊重佛的弟子一样，尊重这部金刚经。</p></div>"
},{
    "title": "第十五章　如法受持分第十三",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十五章　如法受持分第十三</strong></p><p>原文：<strong>尔时。须菩提白佛言。世尊。当何名此经。我等云何奉持。佛告须菩提。是经名为金刚般若波罗蜜。以是名字。汝当奉持。所以者何。须菩提。佛说般若波罗蜜。即非般若波罗蜜。是名般若波罗蜜。须菩提。于意云何。如来有所说法不。须菩提白佛言。世尊。如来无所说。</strong></p><p><strong>须菩提。于意云何。三千大千世界所有微尘。是为多不。须菩提言。甚多。世尊。须菩提。诸微尘。如来说非微尘。是名微尘。如来说世界。即非世界。是名世界。须菩提。于意云何。可以三十二相见如来不。不也。世尊。不可以三十二相得见如来。何以故。如来说三十二相。即是非相。是名三十二相。须菩提。若有善男子。善女人。以恒河沙等身命布施。若复有人。于此经中。乃至受持四句偈等。为他人说。其福甚多。</strong></p><p>释：这时须菩提对佛说：世尊，如何命名这部经典呢？我们这些人怎样来奉行受持呢？佛告诉须菩提，这部经叫作《金刚般若波罗蜜》。因为这个名字，概括了整部金刚经，你们应当好好地理解其中的义理，然后贯通受持。为什么要受持这个名字呢？须菩提，佛说般若波罗蜜，并不是真正有般若波罗蜜这个法，这只是一个假名词、一个概念罢了，暗指没有生死的金刚心处于涅槃的状态。</p><p>须菩提，你怎么想呢？如来有所说法吗？须菩提对佛说：世尊，如来无所说，如来并没有说过什么法。佛言：须菩提，你怎么认为，三千大千世界中的所有微尘，是不是很多呢？须菩提言：太多了，世尊。佛言：须菩提，所有这些微尘，如来说都不是微尘，只是一个假名罢了；如来说世界，并非真有个世界，只是一个假名字罢了。</p><p>佛言：须菩提，你怎么认为，可不可以在三十二相上见如来呢？须菩提言：不能，世尊，不可以三十二相见如来。为什么呢？如来说三十二相，不是真正的相，这些相是幻化的，并非实有，只是假名三十二相罢了。佛言：须菩提，如果有善男子善女人，用恒河中沙子一样多的色身布施，如果另有人在这个金刚经中哪怕他受持四句偈子，为别人说，所得的福德也比前者所得的福德多。</p><p>须菩提请世尊命名这部经典，并请问如何奉行受持。世尊说：这部经就叫作金刚般若波罗蜜。这个名字的含义都明白领悟以后，才能奉行受持。经题的含义已经在文章开头讲过了，金刚是世间最坚硬的一种宝，什么也不能摧毁它，反过来它能摧毁一切。用它来比喻我们的真心如来藏，这个心无论什么人用什么力量，永远都没办法摧毁，除此之外的世间一切法，都是祂所变生，都有生住异灭性，都是不可靠法。</p><p>般若的含义是大智慧，主要是指真心如来藏先天而有的智慧。比如祂的能变生一切法的智慧，祂的不入生死又能现生灭相的智慧，祂的能生一切法又不与一切法相混合的智慧，以及祂的种种中道不着两边的智慧。这些智慧与七识心的智慧截然不同，七识心的智慧是对应于世间法的，即使是断我见的智慧，证悟了如来藏的智慧，对如来藏的种子功能了知的智慧，以及佛的一切种智的智慧，都是后天通过修行所生起的，不是本具的本有智慧，与如来藏的本有智慧有很大差别。因此，般若这种智慧还是指真心如来藏的智慧。五阴身有生死，万法万亿法都有生灭都不保靠，只有真心如来藏没有生灭，不在生死的此岸，方便说为彼岸。整部金刚经的经题就包含了这些义理，证得了以后，才能真正贯通，也就能奉行受持了。</p><p>佛说般若波罗蜜即非般若波罗蜜，是名般若波罗蜜。用般若波罗蜜大智慧在彼岸这个名称来概括真心如来藏的体性，如来藏是实有真有，而那个名称不是实有真有，是世尊为祂取的一个假名，祂的假名有无量之多，都是用来体现如来藏的体性的。六祖说过：吾有一物，无头无尾，无名无字，无背无面，諸人还识否？神会说：是諸佛之本源。六祖说：向汝道无名无字，汝还唤作本源佛性。这时候应该用机锋暗示諸佛之本源，不应该说名字，名字不是祂。万法都是一个名字，并非实有，如来藏不属于生灭的万法，因此是实有之法。</p><p>世尊问须菩提，如来说过什么法吗？须菩提说，如来没有说过什么法，世尊听后首肯。可是世尊明明讲了四十九年佛法，为什么又说没有说过法呢？佛有三身：法身、报身、应化身。法身佛就是佛的金刚心，祂无形无相，无眼耳鼻舌身意，无五蕴十八界，既然没有五蕴身，就不能说法；而报身佛和应化身佛有五蕴身，有十八界，就可以用心口来说法；报身佛在色界的第十八层天天宫，为地上的大菩萨讲道种智的修行内容。</p><p>应身佛为了满足众生求法的愿望，应众生的根基现佛身度众生，宣说佛法。化身佛会分身无数到十方世界化度众生，演说佛法。但是报身佛和应化身佛是法身佛所变现的，离开法身佛，也没有报身佛和应化身佛。后两种佛说法时离不开法身佛，所以每尊佛说法时，就有说法的佛和不说法的佛，说法的佛不能离开不说法的佛。所以释迦佛讲了四十九年法，而说我没有说过一个字。这里的如来是指法身佛，法身佛是不说法的。了解了三身佛的概念义涵，就会知道佛有没有说法。因此说佛有所说法是谤佛，说佛没有说法也是谤佛。</p><p>世尊又问须菩提，三千大千世界里的所有微尘是不是很多呢？但是这些微尘，如来说不是微尘，只是给它取名为微尘；如来说世界，也不是世界，也是取个名字叫作世界。三千大千世界里的微尘，是如来藏所含藏的地性所现，非实有，把这种生灭的颗粒物质取名为微尘，所以微尘是个假名词，一个概念。世界也是，共业众生的如来藏根据众生的业缘，输送地水火风四大种子，变现了众生生存的世界，缘尽时，世界即散坏灭去。所以世界非实有真有，只是给众生生存的器世间取个名字叫作世界，因缘所生的法都是非实有，都是空法和假法，都是一个假名词和概念罢了。</p><p>世尊又问须菩提，可以三十二相见如来吗？须菩提说不能，因为须菩提已经明了世尊说法的义趣，不用世尊再往下叙述，自己就又接着说，如来说三十二相即是非相，是名三十二相。如来的三十二相，是佛三大阿僧祇劫修行所修得的相好，无限庄严。在凡夫位时与众生的身相是一样的，越修相貌越好越殊胜，直至后来修出了三十二相八十种好。可是世尊的色身灭时，三十二相八十种好也随之灭去，那么三十二相就是后有的生灭的，不是本来而有的不生灭的实相，不是真实相。只是把佛的相好命名为三十二相，因此是一个名词概念。</p><p>世尊又对须菩提说，如果有善男子善女人，把自己像恒河沙一样多的色身布施出去，如果又有人在这部金刚经中能够理解受持乃至于一个四句偈子，并且为他人说，所得的福德也比布施像恒河沙一样多的身命要多。世尊在前文已经两次说过，受持金刚经乃至四句偈子为人解说，所得的福德远比布施三千大千世界的七宝、布施像恒河沙一样多的七宝所得的福德要多。这里又强调，比布施像恒河沙一样多的身命得福多。布施七宝钱财是外財布施，布施色身是内財布施，布施内財远比布施外财得福多，不可比拟。因为外财依于内財而有，外财失去了，还可以得，内財失去了，就什么也没有了。</p><p>众生无始劫来都牢牢地执著自己的色身生命，不肯让自己的身体寿命受到一点危害，何况布施舍弃出去，如果不是发清净大愿的大菩萨是极难做到的。等觉菩萨因为成佛的福德还不足，为了早日成就佛道，在一百劫当中，专门修福德，布施自己的内財。众生需要身体哪部分就布施哪部分，要什么布施什么。甚至在饥馑世，变成大身，让众生食用，解决众生的饥饿。这样累积够了成佛的福德，才成为候补佛，在兜率内院，等着因缘成熟，下到人间八相成道，圆成佛果。</p><p>虽然布施色身生命是如此重要，福德如此大，世尊说也不如受持金刚经以及四句偈子为众生演说所得的福德大。因为受持金刚经明心见性，是成就佛道的基础，明心见性以后智慧就能越来越深广，最终能够具足佛地的智慧。但是，布施外财和内財的福德都应该具足，没有布施外财得的福，福德不具足就没办法明心见性，没有办法成为地上菩萨一步一步地往上进修。而布施内財，直接把自我这个小我完全弃舍，才能达到彻底的无我，证得究竟的大我，佛地的常乐我净的我。</p><p>世尊反复讲布施的重要性，財布施、无畏布施、法布施都是很重要的，没有前两种布施所修的福德，就没有办法进行法布施，因为没有证得法而行的法布施，往往会误导众生，不但无福，还有罪报。所以修行人要善于修布施行，这是菩萨六度、十度万行最先要修的内容。</p></div>"
},{
    "title": "第十六章　离相寂灭分第十四",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十六章　离相寂灭分第十四</strong></p><p>相，是指三界世间一切万法，一切世俗相。金刚经里这个相，第一是指四相：我相、人相、众生相、寿者相；第二是指佛的三十二相；第三，是指色声香味触法六尘相，以及三界世间一切相。离，是指离开，不对应，不具备，没有的意思。那么是谁能离开这些相、不对应于这些相，没有这些相呢？很显然，只有金刚般若心体了。</p><p>金刚心因为能够离开这些相，不对应于这些相，所以祂才是寂灭的。如果不离这些相，那就有能和所的对待，就有能知和所知，对六尘境界就有受和想，那就和七识心一样，处于喧闹的境界，心不能寂止，就不是一颗寂灭的心了，那也就不称其为涅槃心体了。</p><p>寂灭的意思是说，祂自己本身没有色，也不见色，所以心是寂灭的；祂自己本身不发声音，也不去听声音，所以心是寂灭的；祂自己本身，不散发香味，也不去嗅香，所以祂是寂灭的；祂本身没有味尘，也不去尝味，所以心是寂灭的；祂本身没有触尘，也不去领受触尘，所以心是寂灭的；祂本身没有法尘，也不去分别和领受法尘，所以心是寂灭的。金刚心不管六尘是如何的喧闹，祂本身就处于寂灭状态，和阿罗汉处于无余涅槃境界的寂灭状态是一样的。所以这个题目，就是在标明金刚心的体性。</p><p>原文：<strong>尔时须菩提。闻说是经。深解义趣。涕泪悲泣。而白佛言。希有世尊。佛说如是甚深经典。我从昔来所得慧眼。未曾得闻如是之经。世尊。若复有人得闻是经。信心清净。则生实相。当知是人。成就第一希有功德。</strong></p><p>释：这时候须菩提，听佛讲了这部金刚般若波罗蜜经以后，就已经深深的领悟了这部金刚经所有的法义和理趣。既然说是深解义趣，就说明须菩提对于金刚经的义理不仅仅是理解，而且是深深的证得了。证悟要分好多层次，有浅有深，浅的就是十住位的证悟内容，证得如来藏的总相智。</p><p>稍微比较深一些，是证得如来藏的别相智，菩萨的阶位在十行位和十回向位。悟得再深一些的，就具备了道种智。这里没有表示，须菩提到底是证悟了十行位，还是十回向位的别相智，还是证悟地上菩萨的道种智。但是已经表明，须菩提对于金刚经当中如来藏的宗旨，是深深的证解了，所以不是浅悟。</p><p>因为须菩提对这部经的义理已经深深的证解了，因此他悲喜交集，感激涕零地对世尊说：稀有难得的世尊，您能说出这样理趣甚深的经典，我从古昔以来，所修得的慧眼，从来没有听闻过这样义涵甚深的经典。</p><p>文中的慧眼，就是指有智慧之眼，智慧包括小乘法的智慧和大乘般若、唯识的智慧。小乘从断我见开始，就有了慧眼，大乘从明心的七住位开始，就有了慧眼，一直到第十回向位为止，再以后就有了法眼。须菩提前世就有了慧眼，那说明前世他就已经证得了大小乘的果位，至少是证得了小乘的果位，此世他在母胎中，就知道诸法空寂，没有隔阴之谜，他是佛弟子当中解空第一，那么须菩提在佛道当中修行，至少也有无数劫了，善根非常深厚。以须菩提久劫修行的善根，都没有听闻过金刚经这样的甚深经典，说明金刚经是稀有难遇的甚深法宝。如果善根福德不足，就遇不到这样甚深的般若经典。善根浅，福德薄，更不能在听闻之后，就证得了金刚般若心。</p><p>须菩提继续对世尊说：世尊，如果有人遇到了这部金刚经，并且深信不疑，就能信受自己身中确实有此金刚不坏心常住在世，也深信所有众生都有此金刚不坏心，常住在世。此人以此清静的信心，就能证得这个金刚不坏心，从而就证得了诸法实相。知道了一切法的源头，就是金刚不坏心，知道了真心如来藏就是法界实相，真实不虚，不生不灭，其余一切法都是虚相，都是依实相心而有。</p><p>那么这个人就成就了第一稀有的功德，此人的福德和智慧，都是世上第一稀有难得的。从此以后，这个人的福德就会渐增渐大，智慧就会越来越深广无边，而且能够广利无量众生，最终就能究竟成佛。所以证悟般若实相心，其福德不可思议，其智慧不可思议，世间里任何法都不能及。</p><p>即使拥有世间无量财宝，与此福德也不能相比，即使精通世间一切技艺的巧慧，与此般若实相之智，也不能相比。世间这些世俗的福德和智慧，都是生灭变异之法，并不可靠，享受之时，也具足了烦恼。众生因此烦恼，而流落六道，仍然如乞丐一样，过着乞讨的流浪生活，苦恼不断。只有证悟了不生不灭的般若实相心，才能渐灭诸烦恼，心得清凉，心地越来越清静，越来越富足。</p><p>原文：<strong>（须菩提说）世尊。是实相者。即是非相。是故如来说名实相。世尊。我今得闻如是经典。信解受持。不足为难。若当来世。后五百岁。其有众生。得闻是经。信解受持。是人则为第一希有。何以故。此人无我相。无人相。无众生相。无寿者相。</strong></p><p>释：须菩提又对世尊说：世尊，我们所说的实相，是没有一个法相的，祂不具备任何一个三界世间相。实，是真实，不虚妄，是真实存在义。因为祂是真实存在的，可以证得的，所以无量无边的诸佛菩萨，都已经证得了祂，而且也都具足了无量无边的福德和智慧。如果祂不是实有，只是一个名词概念，只是一个名相，那证得就没有什么用处了，也就不能出生般若大智慧，更不能成就佛道。因为金刚般若心是真实存在的，是真实的有，体性常存，作用真实，因此众生才能参禅寻觅找得到祂，从此就成为了一个佛法当中的大富长者。</p><p>虽然说金刚般若心体是实相，体性真实，但是要想把祂与世间相对号入座，去寻觅祂的世间相，那是了不可得的。因为祂非世俗法，非世俗相，没有色相，没有声相，没有香相，没有味相，没有触相，没有六尘法相，因此，实相也就是非相。要想寻觅证得祂，就要离开这世俗六尘相，离开七识的觉知心相，离开五蕴相，取识得没有这些相的那个心体。</p><p>不要认为实相就是有这些相，因此就把真妄混淆起来，那样就会悟错。但是寻觅证得祂，也要在这些五蕴世俗相里寻觅，实相与世俗相紧密相连，相依相靠，彼此不分离。实相依世俗相而显出自身的德能和利用，世俗相依实相才能存在和运行，才能有表面的虚假作用，二者犹如束芦，彼此相依。</p><p>须菩提说：世尊，我现在能够听闻到如是甚深的经典，不仅能够生起清净的信心，证得实相，深解其中的法理、义趣，深领其中的般若义味，还能够发心去受持和流通这部经典。我现在能够如此做，都不算难，因为有世尊您在世，有您亲自教导和加持，所以相对来说比较容易契入。如果在未来末法世的最后五百年，能有众生得遇到这部经典，听闻到如来藏之实相法门，他就是一个稀有难得的大福德之人。</p><p>这个众生在听闻这部经典之后，能够像我一样的对实相法生起清净的信心，相信自己有金刚不坏心，丝毫不怀疑，也能够证得实相，并且深解义趣，还能够发心受持金刚经，依此实相心去修持，那么这个众生就是世上最最稀有难遇的。</p><p>因为在那个末法世，众生恶业所感，魔强法弱，佛法几乎快要灭绝了，在那时还能有众生遇到金刚经，信解大乘实相法，真是难能可贵，他的善根福德也是世上最稀有的。那时的众生，执著世间法，着世俗相，比现在有佛住世时，将会更加严重，人心将会更加漏劣。却有人能够对没有世俗相的实相心生起清净的信心，信解受持，那是甚奇稀有，第一稀有难遇。</p><p>须菩提说：为什么是这样呢？世尊，因为在那时普遍着相的世道里，这个人却能证得无相的金刚般若心，内心离开了四相，所以此人才是稀有难得。此人证得实相以后，内心就没有了五阴我相，不再认五阴为我，即是断我见之人。同时，他内心里也会泯去相似于我相的人相，不再认人相为真实。</p><p>继而这个人就会知道，类似于我相和人相的众生五阴相，也都是虚妄不真实的，内心也就舍弃了众生相。再进一步，他会观察到，依众生五阴而有的寿者相，也是虚妄不真实的。众生一期一期的寿命，依幻化的五阴而存在，五阴既然是虚妄的，寿命更是虚妄不实的，因此寿者相也就泯灭了。能离此四相之人，在那末法世，实在甚为稀有难得。</p><p>原文：<strong>所以者何。我相即是非相。人相众生相寿者相即是非相。何以故。离一切诸相。则名诸佛。佛告须菩提。如是如是。若复有人。得闻是经。不惊不怖不畏。当知是人甚为希有。</strong></p><p>释：须菩提说，世尊，为什么证得实相般若心以后，内心会没有四相、离开四相了呢？因为我相，不是一个真实的相，表面上看，好像是有，其实并不真实。证得实相之人，就会观察真心如来藏的运作，观察如来藏是如何出生五阴我的。他渐渐地就观察到了自己的五阴，都是如来藏刹那刹那幻化出来的。</p><p>五阴的一切活动，都是如来藏的功能作用，五阴自己并没有真实地做过什么，五阴之法，虚幻不实，实质都是如来藏。比如一个魔幻师，幻化出一个五阴身，这个五阴身就会有一定的功能利用，但是这个五阴身并没有真实性，其功能利用也不是真实有，都是魔幻师所为。又比如一个木偶人，登台演戏，这个木偶人在戏台上，无论怎样表演，都不是它自己所为。</p><p>所以木偶人的一切活动，都是幻化的，没有其事，实质都是后台操纵者所为。我的五阴活动也如此，因此五阴的我相，是非相的，不是真实的相；同理，类似于我的人同分的人相，也是如此，没有真实的人同分的五阴相。人类无论在世间怎样生活和活动，做种种事业，都没有真实的五阴活动，其实质都是如来藏性，因此人相就是非相。</p><p>再同理，类似于人相的众生相，也是虚妄不真实的，表面看好像是有，实质是无，实质都是众生的如来藏性。众生的五阴活动，就像是机器人在做工一样，机器人本身不是自在的，没有自主性，它还得需要人为的组合和操纵，那么机器人就不可能真实地去做什么工作，都是设计、制造、操纵者所为，机器人只是现个假相，恍人眼目罢了。</p><p>所以老板绝对不会为机器人开工资，也不会奖励和惩罚机器人。因为老板清楚地知道，机器人不是人，没有人的智慧和能力，他只是一个被人利用的工具罢了，工作并不是它做的。众生的五阴就是这样的，一切事业并不是五阴做的，五阴只是一个工具罢了。因此众生相就是非相，不真实，也不实有。</p><p>那么依众生的五阴，而显现出来的生命相、寿者相，也是非相，不是真实有。众生在一个时间段之内的生命活动，比如呼吸、新陈代谢、吃喝拉撒等等，表面看好像是真实有，好像有真实意义，实际上也是如来藏所显现出来的假相，是如来藏所赋予的，本质也是如来藏。这一期生命无论时间有多久，其生命的实质，就是如来藏。众生没有真实的生命相，因此寿者相就是非相。</p><p>为什么说我、人、众生、寿者四相就是非相，是不真实的相呢？因为法界实相是离一切相的，有四相就是虚相、假相、生灭相，就不是法界实相，也不是真实相。实相金刚般若不坏心，也就是诸佛法身，法身离一切相，没有四相，也没有一切相。所以说真佛无相，真佛也不说法。离一切相的佛，就是诸佛的法身佛，才是真正意义上的佛。有五蕴相的佛，是报身佛、应身佛和化身佛，是法身佛所幻化出来的佛，不是真佛。</p><p>世尊告诉须菩提：是这样，确实是这样。如果有人能够听闻到这部金刚般若波罗蜜经，听闻之后，内心里能够不惊讶，不恐怖，也不畏惧，应当知道，这个人确实是很难得，很稀有的，他就是一个善根福德非常深厚的人。</p><p>为什么世尊要这样说呢？因为金刚般若波罗蜜经里，全部是讲大乘的空理，教导众生要离四相，离所有相，不执取一切相。而众生从无始劫以来，一直是在执著四相，抓取一切相，不肯舍离。众生的内心里都是我执深重，我见深重，都是见一切相是有，不见一切相是空。</p><p>因为众生无始劫以来一直是深深地依赖着有，这时听闻到金刚经当中讲空、讲无，众生一定会很恐惧、很惊畏。就会害怕自己落空，害怕自己变得空无，一定是不肯把自己无始劫以来一直依赖的拐杖扔掉，不肯变得无依无靠，于是就害怕自己变得空荡荡的，害怕自己不存在了。所以就会心生恐惧和怖畏，这是善根和福德不足的人，前世修行时劫很短，才会如此。相反，听闻此经中讲无四相，离四相，而心不怖畏的人，那是已经修行了很久时劫的人，是所种善根已经很深厚的人。这样的人，听闻金刚经，不仅不驚怖，还能生起清净的信心，并且能够证得离四相的金刚般若心，可见这样的人，确实是稀有难得。</p><p>原文：<strong>何以故。须菩提。如来说第一波罗蜜。即非第一波罗蜜。是名第一波罗蜜。须菩提。忍辱波罗蜜。如来说非忍辱波罗蜜。是名忍辱波罗蜜。</strong></p><p>释：世尊开示说：为什么说离四相的人是第一稀有难得呢？须菩提，如来说第一波罗蜜，也没有真正第一波罗蜜的相，只是给它取个假名，叫作第一波罗蜜。菩萨们修行六度波罗蜜，就能明心见性，达到涅槃的彼岸。但是这六度波罗蜜，也是非相，不是实有之相，都是如来藏幻化出来的生灭假相，依如来藏实相而有。也依菩萨的五蕴幻身，才能修行六度波罗蜜，既然五阴身不实，是假相，那么依五阴身而修行的六度波罗蜜，当然更是假相，更是非相了。所以佛说，第一波罗蜜，即非第一波罗蜜，没有第一波罗蜜的真实自体性，只是名字为第一波罗蜜。</p><p>世尊接着说：须菩提，忍辱波罗蜜，如来说不是真实而有的忍辱波罗蜜，所以忍辱波罗蜜也是非相，不是实有的实相，因此就假名为忍辱波罗蜜。所谓的忍辱波罗蜜，其实只是一个个或者是无数个虚假的事相，都不是实相本身。这些个虚假的事相，是七识心的心行之相，是七识心运行所表现出来的，也都是如来藏所出生和显现出来的相，表面上看是有，实质上却是无，与如来藏是不一不异的关系。</p><p>因为这些忍辱波罗蜜的修行，是生灭变异的法，不是常恒不变异的，一种忍辱行为造就出来，随后会灭去，然后另一种忍辱行为产生出来，又灭去，无数的忍辱行为，构成了菩萨的忍辱波罗蜜，菩萨依此，就能到达生死彼岸。</p><p>忍辱行为是五阴身和七识的行为，五阴本身尚是非相，七识刹那生灭变异，六识每日都断灭一次，都是虚妄不实，何况依五阴七识而有的忍辱行，更是非相，更是虚妄。所以忍辱波罗蜜，没有自体性，不是自在的，只是一个表相，是一个名字罢了，是以名字而命名的虚妄的行为造作，其本质就是如来藏。</p><p>原文：<strong>何以故。须菩提！如我昔为歌利王割截身体。我于尔时。无我相。无人相。无众生相。无寿者相。何以故。我于往昔节节支解时。若有我相人相众生相寿者相。应生嗔恨。须菩提。又念过去于五百世作忍辱仙人。于尔所世。无我相。无人相。无众生相。无寿者相。</strong></p><p>释：世尊说：为什么呢？须菩提，就比如我往昔被歌利王割截身体的时候，我在那时是没有我相，没有人相，没有众生相，没有寿者相的。我如果在往昔被歌利王割截身体时，身体的肢解都被一节一节的分解开的时候，我如果有我相，有人相，有众生相，有寿者相，就会对歌利王生起嗔恨心，而在那时，我确实没有对歌利王生起嗔恨心。</p><p>世尊那时如果有我相，祂就会想，我的身体被毁坏了，我被欺辱了，于是就会感觉身体很疼痛，心里很气愤，很痛苦，就会对歌利王生起嗔恨心。而世尊当时，并没有感觉身体疼痛，心里也并没有感觉不平，也没有被欺辱的感觉。世尊因为智慧和禅定的证量，证得了受阴尽，身体上可以没有受觉，所以被割截身体时没有疼痛感，才能忍受住四肢被肢解了，也没有昏过去。</p><p>世尊那时如果有人相和众生相，就会对歌利王很气愤，认为这个人在欺辱自己，对自己很残忍，很霸道，于是就会对歌利王生起嗔恨，并且会诅咒歌利王，想报复歌利王和手下的人。世尊那时如果有寿者相，就会奋起反抗，阻止歌利王以及杀手来割截破坏自己的身体。因为割截身体就预示着即将死亡，生命将会消失，一期寿命就会结束了。而世尊那时并没有反抗，也没有生起嗔恨，因此证明  世尊那时是无四相的。</p><p>须菩提，我又回忆起过去世中，有五百世都做忍辱仙人，修忍辱行。我在五百世每生每世的修行当中，都没有我相，没有人相，没有众生相，没有寿者。那时世尊就是一个离四相的菩萨，在修行六度波罗蜜的菩萨，祂示现为忍辱仙人而修忍辱行，已经离于四相的修行，已经有五百世了。</p><p>原文：<strong>是故须菩提。菩萨应离一切相。发阿耨多罗三藐三菩提心。不应住色生心。不应住声香味触法生心。应生无所住心。若心有住则为非住。是故佛说菩萨心不应住色布施。</strong></p><p>释：世尊说：因此，须菩提，菩萨应该离开一切相，发起成佛利乐众生之心。真正的菩萨发心修行，应该离开一切相，不应该住在色尘上发心修行，不应该住在声尘上发心修行，不应该住在香尘上发心修行，不应该住在味尘上发心修行，不应该住在触尘上发心修行，不应该住在法尘上发心修行，应该一法也不住地来发心修行菩提。</p><p>如果心有所住，住在六尘相上，着在六尘相上，那就是不如法的住，与无上菩提不相应。因此佛说，菩萨发心修行布施，不应该住在色上布施，不应该为了色法上的利益而行布施。不应该住在声香味触法上，不应该为了声香味触法的利益而行布施度，应该像金刚心一样对一切法都无所住的发心。</p><p>为什么菩萨不应该住在色声香味触法上生心呢？第一，因为金刚般若心，是不住相的菩提心，祂本身一法也不住。识心若与菩提心的体性相一致，才能成佛，识心如果住在六尘相上，就违逆于金刚心之体性，不与金刚般若心相应，那就不能成就佛道；第二，因为六尘相是生灭变异法，是不可久住之法，住相而修行，就会唐捐其功，不得菩提；第三，住相布施，心中有相，就有遮障，就有无明，不能彻见法界实相，心不空净，就不能到达涅槃彼岸，心中有法，就不能成就佛果。因此菩萨修行佛道，就应该无所住地发心修行。   </p><p>原文：<strong>须菩提。菩萨为利益一切众生。应如是布施。如来说一切诸相。即是非相。又说一切众生。即非众生。须菩提。如来是真语者。实语者。如语者。不诳语者。不异语者。须菩提，如来所得法，此法无实无虚。</strong></p><p>释：须菩提，菩萨为利益一切众生故，应该这样的无所住而行于布施。如果菩萨心有所住，行于布施，得利益的众生就少，不能普遍利益一切众生。因为其心有限量，福德有限量，智慧也有限量，就不能普遍广泛地利益所有众生。如来说，三界世间一切相，都不是真正的实有的相，都是如来藏所幻化出的虚妄生灭变异的相。因此世间所有相，都没有自主性和自在性，没有自己的实体性存在，其实质，都是如来藏。</p><p>同理，所有一切的众生相，也都是如来藏所幻化出来的虚妄相，没有自主和自在性，没有真实的自体性，其存在也是一种幻化相。表面看起来，好像有众生属性，有众生的五阴活动，实际上都是如来藏显现和幻化出来的，没有真实意义上的众生相。</p><p>世尊说：须菩提，如来是说真实语者，从来不说虚假语言；如来是说实语者，从来不妄语；如来是不打虚诳语者，从来不欺诳众生；如来也是不说两头语者，从来不说两种语。</p><p>如来一词，明指五蕴身佛，暗指法身佛，法身佛无形无相，就是佛的无垢识和众生的如来藏。成佛以后，佛的七识与法身无垢识，其性德相近，七识完全转依了无垢识，灭尽所有的无明，其心性就与真如非常接近，心所法都是一样的，有五遍行心所、五别境心所、善十一个心所，八个识都是二十一个心所法。</p><p>法身佛的如来，是指真如心体，是指如来藏。真语，是正真之语。是现量语，意思是如来藏能够变现出现量境，没有比量和非量。都是符合实事、符合事实的，也符合众生的业种，总是如实地呈现出众生业行的原貌。</p><p>实语，是如实之语。众生造业，不管是善恶还是无记，如来藏都如实记录、收存、输出，如实实现众生的业果，从来不会更改和疏漏众生的业行、业种，和业果报，该是什么业，就记录什么业，该是什么果报，就实现什么果报。</p><p>如语，一方面指如实语，真实语，一方面指心体的如如不动性，不动心思，没有心行。如来藏在变造一切法时，内心如如不动，不生心动念。没有情绪，没有情感，完全是舍受。</p><p>不诳语者，诳，诳骗，欺骗，欺诈，如来藏从来没有欺诳过众生，从来没有欺骗过众生。而众生的六识却总是口业不善，语言欺诳，不说真实语，不说如实语，妄语、两舌、绮语，恶口不断。经常声东击西、指桑骂槐，还会隐瞒事实真相，编造谎言，习惯于说不如实语、妄语，谎言、护短，嫉贤妒能，什么口业都造。</p><p>不异语者，异，是变异、不同、改变、另一种、别异。异语，是当面一套背后一套，对甲说一样，对乙说另一样，或者是此时说一样，彼时又变成另一样，这是两样语，或者是说完就改变，说了不算。这些心行都是六识心的心行，六识所造口业不善，没有口德，就是如此。又不知忏愧，不知愧悔，无忏无愧，即是烦恼恶习。而如来藏从来不说二语，不说不一样的语言，不会变过来又变过去，也不会颠三倒四。祂不会收存众生的善业种，而输出恶业种，让众生受恶报；反之，也不会收存恶业种，而输出善业种，让众生受善报。祂不会当面一套，背后一套，不会发生任何变异，不会不忠实于业种和因果。</p><p>而有五蕴身的报身佛、应身佛和化身佛，也与法身佛一样，永远是真语者，永远是实语者，永远是如语者，永远是不诳语者，永远是不异语者。因为佛的七识心已灭尽一切无明烦恼及烦恼习气，已究竟转识成智了，其德无比无上，其口业尽善尽美，无有一丝瑕疵，圆融无碍，令十方世界的所有众生，无比仰慕和顶戴。</p><p>那么如来究竟能得什么法呢？为什么无实又无虚呢？如来所成就的法，简单概括地说，有五蕴身的如来，去除了一切染污和无明，最终证成了无上正等正觉，圆满了无上菩提，具足了无比庄严的三十二相，建立了清静庄严的佛国土，以接引有缘众生，共成佛道。而没有五蕴身的法身佛无垢识，最终转识成智，成为光照大千的大圆镜智，由原来只具足五遍行心所法，又增加了五别境心所法和二十一心所法，其功德性能圆满普照一切法，无一法不知，无一法不觉，无一法不照。</p><p>不管是有三十二相的报身佛、应身佛、化身佛，还是无相的法身佛，其所得法无实也无虚，不有也不无。如果说，这些法是虚，可是诸佛毕竟具有了三十二相，毕竟转识成智了，毕竟证成了佛果，毕竟广度了无量众生，毕竟可以分身无数亿，毕竟可以建立无数佛国土，毕竟圆满了一切种智，毕竟无法而不知，无事不圆明，智慧清静无余，也毕竟增加了无穷无尽的智慧功用和德能，达到圆满和极限，成为了无上尊。这些法，如来都真实存在，不是虚构，不是想象。诸佛如来三大无量数劫的辛苦修道，难忍能忍，难行能行，为众生，为佛教，付出了无尽的心血和劳苦，其功德，无数劫也说不尽，赞不完。</p><p>若说如来所得这些法是实，可是这些法毕竟是生灭变异的，由无垢识所幻化而来，由无垢识所显现出来。比如如来的五蕴身，也是因缘所生，缘灭也散，其随五蕴身而有的三十二相，也会随缘散去。缘具，如来又会现起无数又无数的五蕴身和三十二相、八十种好。如来为度众生所化现的佛国土，缘起即现，缘灭即散。缘聚，又会化现出无数诸佛国土，以此接纳和摄受无量又无量之多的众生。只有如来的无垢识、大圆镜智，才是永远永远不会变异的真实法，实有而不虚妄。</p><p>原文：<strong>须菩提。若菩萨心。住于法而行布施。如人入暗，则无所见。若菩萨心不住法而行布施。如人有目。日光明照。见种种色。</strong></p><p>释：世尊说：须菩提，如果一个菩萨，在行布施时，心住在六尘相上而行布施，那就像一个人进入到一个黑暗处所，他什么也不会看见的，只能见到黑暗。如果一个菩萨，行布施时，心能不住六尘相，不住任何法而行布施，那就像一个人眼睛完好，太阳的光明也正好照耀下来，他就能看见种种的色相，不被黑暗所蒙蔽。</p><p>为什么心住相布施，就能被黑暗所蒙蔽，不见色相呢？因为这位菩萨，心目中都是色相，只认色相，就不能见到色相背后的真实法相，心就被色相所蒙蔽，其所见，都是虚妄相，不与实相相应。此菩萨被虚妄相所系缚，终究不得解脱。比如菩萨布施是为了得到外貌的庄严，为了得到富贵的果报，为了升天享乐，为了得到他人的羡慕，为了得到转轮圣王的王位和对众生的统治等等。这些都是世间有为法，缘散必灭。此等心行不与金刚般若实相心相应，心不得空净，就不能得到菩提正果。</p><p>如果菩萨布施，着在六尘相上，就不能见到六尘相的真实相，就不知道六尘都是实相心所变现和执持的，不知道都是实相心如来藏的功用，就不得无生忍和无生法忍。住相布施，以有所得心，求于世俗法，其心量狭小，所见有限，其智慧不广不大，不与无所得的金刚般若心相应，就不能成就佛道。</p><p>如果菩萨心，不住相布施，心无所得故，与菩提心相契、相符、相应，必能证成菩提。因为此菩萨不着六尘相，也就不着我相、人相、众生相和寿者相，内心空净，心无所得，时时能见诸法实相。其心量广大，福德广大，无生智和无生法忍智，也会逐渐广大无边，这样就会迅速成就佛道，圆满菩提。</p><p>原文：<strong>须菩提。当来之世。若有善男子。善女人。能于此经受持读诵。则为如来。以佛智慧。悉知是人。悉见是人。皆得成就无量无边功德。</strong></p><p>释：世尊说：须菩提，在未来末法之世，如果能有善男子、善女人，能够尽心受持读诵这部金刚般若波罗蜜经，那么我以如来所具有的清静广大智慧，就会知道所有这些人，就会见到所有这些人，都能成就无量无边的功德。</p><p>为什么这些受持读诵金刚般若波罗蜜经的善男子和善女人，都能成就无量无边的功德呢？因为能够听闻到金刚经的人，知道自己以及所有众生都具足了金刚不坏心，其福德已经不可思量了。听闻之后，能够如理修行，证得这个金刚般若实相心，其福德更是不可思议。其智慧也会越来越深广，所度人天大众也会不可限量，将来就会快速成就佛道。要想受和持金刚经，必须是已经证悟到金刚般若实相心的人，否则就不能真正的受，也不能真正地行持。</p><p>行持，就是依止于金刚实相心，来修除七识心的染污和无明，增长般若大智慧。读，就是解读、了解如来藏的般若义。诵，就是其般若义已经娴熟于心，深植于心。受，领受领纳，证得如来藏之后，就能领受、观察、观行如来藏的体性和运作。持，依止于如来藏，改变自己的心行。所以不证悟如来藏，就不能真正地读诵受持，不能广泛宣传如来藏法，不能广度无量众生。所以受持读诵金刚般若波罗蜜经的善男子和善女人，都能成就无量无边的功德。</p></div>"
},{
    "title": "第十七章　持经功德分第十五",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十七章　持经功德分第十五</strong></p><p>这个章节的内容论述了持经的功德非常广大，有无量无边之多的功德。为什么有这么多的功德呢？那就要看持经是什么意思。持，以前说过是受持的意思，主要还有依止、行持的意思。行者通过读诵金刚经，依金刚经当中的法义而证悟金刚般若实相心，从而能够真正地领受、观察、体悟实相心如来藏的有为和无为的清静体性。之后才能依止于如来藏的清静体性，发心随学过去，并且能够依止于如来藏的清静体性，来熏修和改变自己的身口意行，以断染还净，去除无明。在此基础之上，再为广大有缘众生广为宣说，度诸有缘，同入菩提大道，同入毗卢性海。从此走上自利利他的菩提大道，当福德和智慧资粮二者圆满具足以后，就会圆满成就无上大菩提，成为人天瞩目的两足尊。</p><p>因此，持经的功德确实是无量无边的广大，那么所持的经是什么，也就很清楚了。经，表面上指金刚经，实际上是金刚经所指的甚深义趣——实相心如来藏，以此如来藏来贯穿整部经，成为整部经的经纬线和主轴，贯穿修行的始终。因为此经如来藏是成佛的真体，因此读诵和证悟此经，就是今后修学佛道的基础和入门，而入门以后，依此经而熏修，才是入门以后的实修。逐渐转依如来藏成功以后，七识妄心与如来藏真体，同具无量功德，功德圆满，大乘修学以及所有佛道的修学即毕，无上菩提已成，自利利他行就圆满。可见，持经的功德，真正是无量无边的广大，不可思议。</p><p>原文：<strong>须菩提。若有善男子。善女人。初日分。以恒河沙等身布施。中日分。复以恒河沙等身布施。后日分。亦以恒河沙等身布施。如是无量百千万亿劫。以身布施。若复有人，闻此经典。信心不逆。其福胜彼。何况书写受持读诵。为人解说。须菩提。以要言之。是经有不可思议。不可称量。无边功德。如来为发大乘者说。为发最上乘者说。</strong></p><p>释：世尊说：须菩提，如果有善男子善女人，在一天当中，太阳刚出生时的上午时间，以自己恒河沙数之多的色身，来布施给众生；在日到中天的中午时间，以自己恒河沙数之多的色身，来布施给众生；在太阳即将落下的午后时间，以自己恒河沙数之多的色身，来布施给众生。像这样，在自己百千万亿劫的生命时光里，每天都是以这样多的色身，来布施给众生。</p><p>这里佛是假设众生能有这么多的色身，其实能有恒河沙数之多色身的人，只能是等觉菩萨、妙觉菩萨和诸佛了。普通众生，没有证悟如来藏，没有修出四禅八定，就不会有意生身，不会有分身。那要布施自己的色身是非常艰难的，即使布施色身之外的所属物，也是舍不得。布施分为外财布施和内财布施，外财布施，就是布施除色身之外，属于色身所有的钱财物等等；内财布施，是专门布施色身，供众生饱饥果腹，免去众生饥饿之苦。</p><p>外财属于依报，依色身内财而有，本是无常变幻的。但是一般众生，就连布施身外之物，都不肯，很是悭吝，更何况要布施内财，更是宁死不舍。因为没有色身，就没有了一切，色身就比身外的一切更宝贵。即使能够做外财布施，已经是难能可贵了，其福德也是很广大，无量无边不可说。如果能够做内财布施，布施色身，意味着舍生忘死，身心不吝，四大皆空，其福德更是无量无边，不可思议。</p><p>须菩提，如果又有人，听闻到这部金刚经，心生清静的信解，深信无四相的金刚般若心，其心不与经义相违背。佛说无四相，破四相，此人就不会说，四相实有，真实不虚，也不会执取四相不放，而内心愿意空却自我，空掉自心。佛说，此人的福德要殊胜、超越于那个在无量百千万亿劫当中，日日布施恒河沙数之多色身的人。更何况此人，不仅信心清静，能够读诵金刚经，证悟金刚心，依止金刚实相心来修持自己，并且又能够广为人解说金刚经，教导众生证悟金刚实相心，护持金刚经的广泛流传，那么此人的福德，就会远远超胜于布施色身内财的人。</p><p>须菩提，总而言之，这部金刚经，有不可思议，不可称量，无量无边之多的功德。如来世尊都是为发大乘菩提心之人而说，为发最上佛乘菩提心之人而说。因为只有发大乘菩提心之人，具有大乘根基之人，心量广大，慈悲众生，智慧深广，才能愿意读诵金刚经，解其义理，证悟实相，之后才有能力受持如来藏法，传播如来藏法，将来才能进入初地，荷担如来家业，广度无量众生。</p><p>原文：<strong>若有人能受持读诵。广为人说。如来悉知是人。悉见是人。皆得成就不可量。不可称。无有边。不可思议功德。如是人等。则为荷担如来阿耨多罗三藐三菩提。何以故。须菩提。若乐小法者。著我见人见众生见寿者见。则于此经。不能听受读诵。为人解说。须菩提。在在处处。若有此经。一切世间天人阿修罗。所应供养。当知此处。则为是塔。皆应恭敬。作礼围绕。以诸华香而散其处。</strong></p><p>释：如果有人，能够受持读诵金刚般若波罗蜜经，广泛为众生开演如来藏实相义理，这个人所有的善根和福德，所有智慧和功德，他为众生所做的一切事业，如来都悉知悉见，不会错漏，不会隐藏。因为如来都悉知悉见，所以此人所做一切，都功不唐捐，一点也不会被埋没。他将来要成就不可量、不可称数、无有边际、不可思议的功德。</p><p>为什么此人受持读诵金刚经的功德，为众生所做的一切功德，如来悉知悉见呢？这个如来一是指色身如来，一是指法身如来。色身如来，因为有无量神通德能，以佛眼观故，悉知悉见此人受持读诵金刚经的所有功德，悉知悉见此人度化无量众生的所有功德和福德，无一遗漏。因为佛有无量智，有一切种智，世出世间无一法不知，无一法不见，圆满光照大千，无一遗漏。</p><p>而法身如来，因为随时随地跟随此人，此人所做一切，必有法身如来的照应和护持。法身如来就是此人的如来藏，因为如来藏了知此人的心行，又会配合此人完成一切事业，又会记录收存众生的业种。因此此人所做的一切，如来藏悉知悉见，业种又会全部收存，将来就会实现此人的所有功德果报，使得此人功不唐捐，最后能圆满成佛。</p><p>世尊说：像这样能够受持读诵金刚般若波罗蜜经，并且能够为众生广泛宣说的人，他们都能够荷担如来的家业，将来也能够毕竟成就阿耨多罗三藐三菩提。为什么这样说呢？为什么此经是为发大乘菩提心者说，为发最上乘的人而说呢？须菩提，如果一个人喜乐于人天小法，那肯定是执取我见、人见、众生见和寿者见，他就会为着虚妄的五阴而修行人天小善法，目的是让五阴升天享乐，享受富贵荣华的果报。他会见有我可享乐，有人会接受布施，有福可获得。</p><p>那么他就不会信受如来所说，不会信受金刚经中所说的无我相、无人相、无众生相、无寿者相的真实法，不会信受有离四相的金刚实相心是真实的我。他就不会读诵金刚经，更不会证悟实相如来藏，更不会去为其他众生演说大乘实相法。而乐着自我解脱的小乘人，因为内心也是着于四相，错见有自我五阴，因而害怕自己的五阴自我再会受苦和轮回，就急急忙忙进入涅槃，出离三界生死，不肯回心于大乘菩萨法的修学。因此他们也不会来听受读诵此经，当然就更不能去为人解说这部经典了。</p><p>世尊说：须菩提，不管在任何之处所，只要有这部金刚经，有金刚不坏心如来藏，一切世间天人以及阿修罗，都应该来供养这部经典，供养大乘如来佛。你们应该知道，有这部经之处，就是一座佛塔，就是一个庄严道场。所有众生都应该恭敬供养，整个身心都要围绕着佛塔而作礼，并且用种种的花香散播此处，以香花来供养佛的塔庙。</p><p>为什么若有此经之处，都应该供养呢？因为此经就是法身佛，就是如来，只有供养这尊佛，才能最终成佛；而且主要以受持读诵来供养，依止修行来供养，才能最终成佛。为什么有此经处，就是道场呢？因为一切修行都是围绕此经而修；一切修行都是在此道场中而修；一切法都从此道场来；一切度众事业，在此道场而实行；最终成佛，也在此道场而成；一切种智，在此道场而圆；一切佛国土，也在此道场而成就。为什么要对此经作礼围绕呢？因为任何众生、任何法，根本也离不开此经，不围绕也是围绕，不得不如此，认谁有无穷的力量，也脱离不开此经此塔。</p></div>"
},{
    "title": "第十八章　能净业障分第十六",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十八章　能净业障分第十六</strong></p><p>首先说标题：能净业障分。业障，大家都清楚，是众生过去世所造作的恶业行，能够障碍自己五阴获得正受，获得福德和善报。对于修学佛道的菩萨来说，业障最大的障碍，就是障碍自己对于佛法的修学，障碍自己获得正知见，障碍自己的禅定。总而言之，业障能够障碍众生一切正报和依报，对于修学佛法的阻碍，就会使后世五阴的正报和依报更加低劣和不如意。因此，菩萨修学佛法，能够清净业障，是非常重要的；业障清除，佛道修学没有阻碍，就会获得圆满的福德和智慧，断除一切无明，成就究竟的无上正等正觉。</p><p>金刚经这一品当中，世尊就讲到了，修学金刚经，证悟金刚实相心，依实相心而修行，就会逐渐净除业障，减少遮障。因为金刚经能直接破除众生的四相，破除了四相，世俗有为相的遮障就拔除了。而且以证悟实相心如来藏的福德，转依实相般若理的功德，就会感得重罪轻报，让恶业果报提前现前，从而拔除此业障。那么一个个的业障都如此拔除清除掉以后，无明灭尽，无业果报，众生就成佛。</p><p>原文：<strong>复次。须菩提。若善男子。善女人。受持读诵此经。若为人轻贱。是人先世罪业。应堕恶道。以今世人轻贱故。先世罪业即为消灭。当得阿耨多罗三藐三菩提。</strong></p><p>释：世尊说：须菩提，如果有善男子、善女人，能够受持读诵这部金刚般若波罗蜜经，他在读诵和受持金刚经，依照经中的甚深义去行持时，如果有人在这时候，对他进行诽谤、欺辱、谩骂和轻蔑，那么他的恶业就会消灭了。这位读诵受持金刚经的人，因为前世曾经造作了恶业，恶缘还没有成熟，因此从前世到现在，还一直没有因此恶业而受恶报。他所造作的那个恶业，如果恶缘成熟的话，本来是应该下堕恶道而受恶报的，现在因为他读诵受持金刚经的缘故，就促使前世造作的那个恶业业缘提前成熟了，应该受恶报了，他会受到什么样的恶报，那就不一定了，但是一定会重罪轻报的。</p><p>为什么今世读诵受持金刚经，前世的恶业缘会提前成熟呢？因为此人读诵受持金刚经，修出了福德和功德，福德功德的表现之一就是恶业的缘提前成熟，提前成熟就会重罪轻报。无论善业还是恶业，都是有高额的利息，也叫作孽息，就像银行里的存款，存的时间越长，利息越高，存款就会增加。这个存款就相当于善恶业的业报一样，善业存的时间越长，应该得到的善果报就越大；相反，恶业存的时间越长，应该得到的恶果报就越大。</p><p>修行得力时就会让恶业的缘成熟，提前受恶报，感得的恶果报就轻微。这样的话，菩萨造作了善业时，不要希望善业的果报尽快现前，让自己尽快享受到，这是没有智慧的心行，善业果报越早受，越享受不到高额的利息，也享受不到利滚利的优厚待遇。真正的大菩萨不应该目光短浅，只考虑自己目前的果报，更应该为后世，为无量劫以后的无上果报而着想和打算。</p><p>因此这个读诵受持金刚经的人，因为修行得力，功德福德现前，不仅使得恶业缘熟，而且能让下堕恶道的恶业，变成为仅仅受到他人的轻贱这样轻微的恶报而已，那个恶业就消灭了。他就这样轻巧地受了恶报，这是善业所感，福德所感。如果一个人不断又不断地精进修行，福德越来越大，功德越来越多，逆境就会一个一个不断地现前，那么前世所有的恶业，就会一个一个地消灭了。当所有的恶业都消灭的时候，这个人也就快成就佛道了，业了，佛道即成。</p><p>原文：<strong>须菩提。我念过去无量阿僧祗劫。于然灯佛前。得值八百四千万亿那由他诸佛。悉皆供养承事。无空过者。若复有人。于后末世。能受持读诵此经。所得功德。于我所供养诸佛功德。百分不及一。千万亿分乃至算数譬喻所不能及。</strong></p><p>释：世尊说：须菩提，我回忆起过去世，在无量阿僧祇劫当中，遇见燃灯佛以前，曾经值遇了无量诸佛世尊，对于这么多的诸佛世尊，我都亲自四事供养，饮食、衣被、卧具、医药从不吝惜，都会尽心尽力供养每尊佛；而且我也亲自在诸佛前，听命于每尊佛的吩咐，侍奉于每尊佛。在这当中，每尊佛出世，我都没有空过，都值遇到，都做了四事供养，都亲自侍奉，听从吩咐。</p><p>这是世尊在叙说自己在遇见燃灯佛之前的事，修证到八地菩萨之前的事。那时世尊的心，还没有达到真正的纯无为，还在着重于行有为有漏行，以世俗法来供养诸佛，都是着相供养，有漏供养。因此，每尊佛都没有为释迦菩萨授记成佛，只有在释迦菩萨的心行达到纯无为，修到八地的不动地果位时，遇见了燃灯佛，燃灯佛才为释迦菩萨授记成佛，这时世尊已经值遇了无量诸佛。</p><p>八百四千万亿，是印度语，汉语应该是四千八百万亿，代表数量非常多，数不清的数目。我们应该知道，在修行佛道的过程当中，都会值遇和供养无量诸佛，不仅四事供养，而且还要亲奉诸佛，最重要、最关键的还是要做法供养，以法供养为最。所谓的法供养，就是亲自随从诸佛修学各种佛法，而且还要普遍教导众生一起修学佛法，替佛宣传佛的法教。如果能够按照佛所教导的去修行，逐渐相应于佛法当中的无为宗旨，心地达到纯无为，这是真正的供养诸佛，必然会得到诸佛的授记。</p><p>世尊说，如果还有人在佛法即将灭掉的后世当中，能够受持读诵这部金刚经，此人所能得到的功德，要比我在无量世供养无量诸佛的功德还要多；我供养无量诸佛的功德，与此人受持读诵金刚经的功德相比，还达不到此人受持读诵金刚经功德的百分之一，达不到千万亿分之一，用所有的数目字来譬喻和形容，都形容不了，也譬喻不到，无法言说，受持读诵金刚经的功德，无有譬喻，功德极大，直至成佛。因为金刚经所指，都是纯无为法，把此无为法修学圆满，就会圆满佛道，快速成佛。那么受持金刚经的功德，当然是无比地广大，任何有为法的功德，都不能与此相比拟。</p><p>原文：<strong>须菩提。若善男子。善女人。于后末世。有受持读诵此经。所得功德。我若具说者。或有人闻。心则狂乱。狐疑不信。须菩提。当知是经义不可思议。果报亦不可思议。</strong></p><p>释：世尊说：须菩提，如果有善男子、善女人，在佛法即将灭亡的末法世中，能够受持读诵这部金刚经，依止如来藏实相法而修行自心，他所得的功德，那是非常多又非常多的。我如果具体来说，这个人所得的功德究竟是怎么样的，到底有多少，具体都有哪些，那么有人听到我这样说，心就会狂乱，就会满腹狐疑，不能相信。那就说明，受持金刚经的功德太殊胜了，一般人是无法想象和相信的。</p><p>须菩提，从这里我们就应当知道了，这部金刚经，其中甚深的法义，是多么地不可思议，多么地深妙难测。那么受持这部金刚经的果报，也是不可思议的。因为按照金刚经当中的义理来修学，证悟了这个般若实相心，从此福德和智慧，就会逐渐增广，智慧越来越深妙无比，当福德和智慧都圆满具足以后，就会成为三界世间里的无上士和无上尊，这个果报确实是不可思议，也无法思议的，这个果报和功德，真是多少劫也说不尽，赞不完。</p></div>"
},{
    "title": "第十九章　究竟无我分第十七",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第十九章　究竟无我分第十七</strong></p><p>这一品世尊讲究竟无我，告诉须菩提菩萨发广大甚深菩提心，广度无量众生之后，要灭除我想和众生想，无我相和众生相，心中要逐渐无我究竟无我。因为实际理地也确实无我，不管是人我还是法我都要灭尽。这样才与甚深的菩提心相应，降伏了自我，心得清净，诸佛才与之授记成佛。即使成佛，心中也是无我的空的，没有成佛这一法相，没有度众生这一法相，没有任何一法相。</p><p>原文：<strong>尔时须菩提白佛言。世尊。善男子。善女人。发阿耨多罗三藐三菩提心。云何应住。云何降伏其心。</strong></p><p>释：这时须菩提就对世尊说：世尊，善男子、善女人，发阿耨多罗三藐三菩提心以后，内心应该怎样住着，怎样把持自己的心，怎样降伏自己的心呢？</p><p>这是须菩提代替众生向世尊请问，菩萨们发了大乘菩提心以后，该如何住持把捉这个心。这个心是哪个心呢？是指能够发菩提心的六七识心，而不是指真正的不发菩提心的真心如来藏。如来藏什么心也不发，祂没有心行，没有愿望，也不想成佛，其心行是无所住的。以须菩提的智慧，是不会问世尊如来藏应该如何住持着，况且世尊也讲了金刚般若心无所住的体性。须菩提是问，能够发菩提心的妄心，既然发了清净的大愿，是否还应该像从前一样，住在世俗法的色声香味触法上，住在五阴上，是否为了这些世俗法而发心。发了大乘菩提心以后，不应该再像从前一样，着一切世俗法相，不应该贪嗔痴烦恼炽盛，应该降伏这个心，那应该如何降伏呢？</p><p>原文：<strong>佛告须菩提。善男子。善女人。发阿耨多罗三藐三菩提心。当生如是心。我应灭度一切众生。灭度一切众生已。而无有一众生实灭度者。</strong></p><p>释：世尊告诉须菩提，善男子、善女人，发了阿耨多罗三藐三菩提心以后，应该这样生心而住：我（五阴）应该灭度一切众生，把这一切众生都度尽，都灭度了以后，内心里知道，实际上我没有灭度一个众生。世尊的意思是说，发大菩提心的菩萨，应该积极度化众生，教导众生证得五阴无我的解脱之法，也教导众生金刚般若波罗蜜到涅槃彼岸之大乘实相法。众生被教导之后，就会实证如来藏实相心，证得五阴无我法。</p><p>这里的灭度，有两个意思，一个是指众生证得五阴无我法以后，慢慢会断尽我执，修到四果得解脱，然后就取无余涅槃。入了无余涅槃以后，五阴全部都灭，七识全部都灭，十八界法全部都消失，三界世间相，一切都消失。只剩下一个不生不灭的金刚不坏心如来藏，处于一无所有的寂灭无所为的境界，这个众生就消失灭亡，这样叫作灭度。</p><p>灭是灭了，为什么说是度了呢？因为这个众生，由原来在六道里轮回，不断造业，受无量无边之多的苦恼，现在他没有五阴了，意根灭尽一念无明了，就不再造作生死轮回业，更不会随业轮回三界世间，受生死苦。从此以后，他不再有生死，不再有苦受，也不再有他，已经没有所谓的他了。真正的他如来藏又不造业，又没有生死，更不会受苦，纯是寂灭无为。所以，度是度越生死苦，度过六道轮回，没有生死轮回苦就是度，度到没有五阴生死苦的涅槃境界了。</p><p>灭度还有一个意思，就是菩萨教导众生证得实相心如来藏以后，这个众生渐渐地转依如来藏的清净体性之后，七识妄心一步步地灭掉了无明烦恼，灭掉了烦恼习气，成佛路上的所知障全部灭掉，八识全部转识成智，成为究竟圆满的无上尊，再也不是众生了。这样，这个众生就被灭度了，完完全全成为一尊果位的佛世尊，再也不仅仅是理上的佛，而实际上却是无明众生了。</p><p>这样众生被灭度，是究竟被灭度，是最好最完美的灭度，尽善尽美，无有一丝遗憾。就这样，灭度了所有的众生，无量无边的众生都被灭度了，然后心里也没有这样的念想，认为自己灭度了所有众生，而是觉得自己并没有度化一个众生，一个众生也没有被度化。这就奇怪了，为什么说一个众生都没有度呢？明明是度了所有的众生。 </p><p>原文：<strong>何以故。须菩提。若菩萨有我相人相众生相寿者相，则非菩萨。所以者何。须菩提。实无有法发阿耨多罗三藐三菩提心者。</strong></p><p>释：于是世尊自问自答：为什么这样说呢？须菩提，如果一个菩萨内心里，还有我相，还有人相，还有众生相，还有寿者相，那么这个菩萨就不是真正的菩萨。他还没有破四相，没有证得实相，还不是真实义的大乘菩萨。为什么著四相的菩萨，不是真正的菩萨呢？须菩提，因为确实没有一个世间法相是真实存在，有实体性，能让菩萨发出大乘菩提心的，也没有能够发大菩提心的这个人。</p><p>证悟了实相心的菩萨，才开始进入到佛门里，才是真正的菩萨，从此以后，这位菩萨就破了四相。知道五阴的我相非实有，五阴的人相非实有，五阴的众生相非实有，依五阴而有的寿者相也非实有。内心不再认各种五阴虚妄相为真实，渐渐不再著世俗五阴的各种有为法相。菩萨这时再去度众生，就知道没有众生可度，没有众生被度，没有我去度，没有我去发心，没有法使得我去发心。</p><p>为什么无有法发阿耨多罗三藐三菩提者呢？这句话可以从三个方面来理解，第一个方面是说，没有能够发大菩提心的菩萨，因为菩萨是以五阴相出现的，菩萨的五阴也虚妄非实有，不是真正的菩萨。第二方面是说，没有什么法，使得菩萨依止而去发大菩提。菩萨发起成佛利乐众生的心，有各种各样的原因和理由，有的是因为看到众生苦而发心，有的是因为自己苦，而想到众生也同样苦而发心，有的是欣羡诸佛的无量功德而发心，这些发心起因众多，不一而足。但是所有发心所依止的内容，都是虚妄，幻化不实。</p><p>第三方面是说，没有发大菩提心这一法存在。发菩提心这一法，是五阴与世俗法相结合起来而有，而显现出来的。五阴虚妄不实，世俗法相虚妄不实，那么依二者而有的发大菩提心这件事，就是虚幻不实，是生灭法。</p><p>原文：<strong>须菩提。于意云何。如来于然灯佛所。有法得阿耨多罗三藐三菩提不。不也。世尊。如我解佛所说义。佛于然灯佛所。无有法得阿耨多罗三藐三菩提。</strong></p><p>释：世尊说，须菩提，你怎么认为呢？如来在燃灯佛那里，获得了什么法而得阿耨多罗三藐三菩提了吗？须菩提说：世尊，就像我对于您所说的法义的理解，您在燃灯佛那里，并没有获得什么法，而能够得佛果位，成就阿耨多罗三藐三菩提。</p><p>世尊在遇见燃灯古佛时，证得了八地不动地的果位，心地清净无为，心中无一法可当情，空空落落，心中无一相可著，空净一切法，舍弃一切法，这时，燃灯佛才给释迦佛授记成佛。可是就连授记成佛这一法相，也是空幻，所证得的八地的果位也是空幻，心地清静无为的这一法相，也是空幻，“不执一切法”这一法相，也是空幻，“内心空空落落”这一法相，也是空幻，如今世尊已成佛，成为三界尊这一法相，也是空幻。世间所有一切，没有一相，不是空幻的，没有一相是真实的，除了那个不在世间里的不生不灭的金刚不坏实相心。所以佛在燃灯佛所，没有法得阿耨多罗三藐三菩提。</p><p>原文：<strong>佛言。如是如是。须菩提。实无有法如来得阿耨多罗三藐三菩提。须菩提。若有法如来得阿耨多罗三藐三菩提者。然灯佛则不与我授记。汝于来世。当得作佛。号释迦牟尼。以实无有法得阿耨多罗三藐三菩提。是故然灯佛与我授记。作是言。汝于来世。当得作佛。号释迦牟尼。</strong></p><p>释：世尊说：是这样，是这样，须菩提，确实没有一法，能让如来得成佛果，如来也不依止一法而得成佛果。如果有一法，或者多法，如来能够依止，而成阿耨多罗三藐三菩提，那么燃灯佛就不会给我授记说：你于未来世某某时劫，就成就佛果了，你的佛名字叫作释迦牟尼佛，还授记了佛国土如何，弟子如何，佛法的流传如何等等情况。世尊又接着说：因为内心确实认为，如来没有什么法可依止，而能够证得阿耨多罗三藐三菩提的。所以  燃灯佛才为我授记说：你在未来世某某时，就会成佛了，佛号是释迦牟尼佛。</p><p>这里的如来，明指有五蕴身的佛世尊，暗指真如心体金刚般若心。佛的金刚不坏心，从无始劫以来，从来不得一法，即使连成佛这一法，祂也不得。因为祂不是有所得心，不是贪得心，祂本身又圆满具足一切法，一法也不欠少，凡是世间所有，都是从此心中而来。对于佛法，真如心体也不得，祂从来不学佛，不学法，而佛与法，都是指祂自己，那就没有必要自己学自己了。</p><p>祂也不修戒定慧，也不熄灭贪嗔痴，也不破无明，因为祂本身具足了戒定慧，本身又没有无明和贪嗔痴。祂也不用除四相八相的，因为祂本身一相也没有，也不贪着任何相，不与相相应，反而能变造出无量无边之多的相。因此如来实无有法得阿耨多罗三藐三菩提。</p><p>而有五蕴身的如来，依止于无相的真正的如来心体，也不得一法，也不得佛法，身心内外，都是净裸裸、赤洒洒，一法也没有，与真如心体相应，舍弃一切法一切相，就连佛法也全部舍弃，最后才能成佛，心中有一法不空净，都不能成就佛道。虽然成就佛道，得佛果位，实际也没有佛果可得，连不得这一法也不得。凡是有所得法，有相之法，全部空幻，只有这样才能成佛，才是佛世尊。</p><p>原文：<strong>何以故。如来者。即诸法如义。若有人言。如来得阿耨多罗三藐三菩提。须菩提。实无有法。佛得阿耨多罗三藐三菩提。</strong></p><p>释：世尊说：为什么说实无有法，如来得阿耨多罗三藐三菩提呢？我所说的如来，就是指一切诸法的真如之义，一切诸法本具的理体。如果有人说，如来得到了阿耨多罗三藐三菩提，如来成佛了。这样说就意味着如来真的是有法可得，如来能够得什么法呢？其实如来是无所得的。须菩提，确实没有一个法，能够让佛得阿耨多罗三藐三菩提。一法也不得，才能得所谓的阿耨多罗三藐三菩提，才假名为得阿耨多罗三藐三菩提。</p><p>佛到底得了什么？得了佛果了吗？以什么法得佛果了呢？得，是表面现象，实际什么也不得，也得不到。表面现象很多人都能看到和感觉到，但是看到和感觉到的，都不是真实的，都是业缘所生，都是幻现。得是表面现象，不得是实质，表面现象与实质结合起来，就是所谓的得佛菩提果。如来于一切法都无所得，因为祂一切万法本自具足，祂又不贪求任何一法，所以一切法祂都不得，也不得佛菩提果。</p><p>原文：<strong>须菩提。如来所得阿耨多罗三藐三菩提。于是中无实无虚。是故如来说一切法皆是佛法。须菩提。所言一切法者。即非一切法。是故名一切法。</strong></p><p>释：世尊说：须菩提，如来所得的阿耨多罗三藐三菩提法，实际上并非实有，也并非虚妄，是虚实二者结合，共成菩提大道。因此，如来说一切法都是佛法，这一切法当中有实有虚，真真假假构成了一切法。须菩提，我所说的一切法，不是真正有什么才叫作一切法，一切法也不是真正实有的一切法，因此也就假名为一切法。</p><p>为什么佛说如来所得的阿耨多罗三藐三菩提法，无实无虚，不能说是实，也不能说是虚呢？因为成佛这一法，是虚实结合，单有虚法，虚法就不能成立，单有实法，实法没有缘和动力，什么也不能作，一无所成。这个实法就是出生五蕴世间万法的根源，法身佛如来藏无垢识。而虚法就是无垢识所变现出来的五蕴世间法。那么我们就知道了，成佛这一法，是由如来藏与五蕴身共同和合而成的。如果说成佛这一法虚妄，却都是如来藏所为，都是如来藏性；如果说成佛这一法是实，可是都有佛的虚妄五蕴的参与和运作，离开五蕴，找不到佛的身影，离开五蕴，也不称其为佛了。因此，如来所得阿耨多罗三藐三菩提法，无实无虚。</p><p>为什么说一切法，即非一切法，是名一切法呢？因为表相上的一切法，都没有自己存在的自体性，都是如来藏依顺各种缘而变现出来的，空幻不实如空花幻影般，因此就不能把一切法当作实有自体性的法。既然一切法，在现象上好像是存在，那就不妨把这些法，都取个假名，以利众生之间语言交流沟通，和世间生存的需要。</p><p>比如：修学戒定慧法，是五阴身心的表面活动，五阴身心没有自体性，都是如来藏在其背后运作出来的功能属性，所以假名为修戒定慧；读诵经典，也是五阴身心的表面活动，没有自体性，也假名为读诵经典；恶口辱骂，是五阴身心的行为造作，是表面现象，恍人眼目而已，也假名为恶口；明心见性，五阴身心的智慧境界，没有自体性，假名为明心见性；思惟观行，是五阴身心的活动，是虚妄生灭法，不实如阳炎，假名为思惟观行；行走坐卧，是五阴身的行为造作，没有自体性，幻化而有，假名为行走坐卧，总之一切法都是个假名而已。</p><p>原文：<strong>须菩提。譬如人身长大。须菩提言。世尊。如来说人身长大。即为非大身。是名大身。</strong></p><p>释：世尊说：须菩提，譬如说人身的长大，就是一切法中的一法。须菩提回答说：世尊，如来所说的人身长大相，并不是真正的大身，只是取个大身的名字罢了。为什么如来所说的大身，即为非大身呢？因为人身体的大小相貌，只是如来藏虚幻出来的假相，没有实质，也没有实质的大小相。是如来藏用四大种子堆积起来的一个幻相，其大小长短，都是相对而说，必须要参照某个物，有个比对，才能定名为大小长短。而其比对物，也非真实，没有可依赖性和可比性。因此人身长大，就是非大身，是名字大身，没有实质大小之说。</p><p>原文：<strong>须菩提。菩萨亦如是。若作是言。我当灭度无量众生。即不名菩萨。何以故。须菩提。实无有法名为菩萨。是故佛说一切法无我无人无众生无寿者。</strong></p><p>释：须菩提，菩萨也是这样，心地当中不著一法相，而行于菩萨行，才是真正的菩萨。如果一个菩萨发愿要度诸众生说：我应当要灭度无量众生，那么这个菩萨还不是一个真正的菩萨，还没有证得实相，进入实相当中。为什么这样说呢？须菩提，因为实际理地当中，没有什么法，可以称作菩萨、称作我的。因此，佛说一切法当中没有我，没有人，没有众生，没有寿者这四相。</p><p>真正的菩萨是已经证得实相的菩萨，证得实相的菩萨，心中就不应该再执取世俗相。所谓世俗相，就是四相。首先菩萨不应该有一个我相，那就不应该再有菩萨相，不应该再有被度的众生相。这些相就是五阴相，都是如来藏幻化出来的假相，不是实有法，就像天上的白云幻化出来的猫狗形象一样，没有真实的猫狗可去把捉，都是白云相。真正的菩萨不应该执取一个菩萨相，不应该执取我相，不应该执取众生相，但是还要有我去度无量众生，要无心行于这些菩萨行才行。</p><p>原文：<strong>须菩提，若菩萨作是言。我当庄严佛土。是不名菩萨。何以故。如来说庄严佛土者。即非庄严。是名庄严。须菩提。若菩萨通达无我法者。如来说名真是菩萨。</strong></p><p>释：须菩提，如果一个菩萨这样说：我应当庄严佛国土。那就不是真正的菩萨。为什么这样说呢？如来说，所谓的庄严佛国土，不是真有佛国土可庄严，不是真有庄严其事，只是假名庄严佛国土罢了。须菩提，如果一个菩萨已经通达了无我法，证得了诸法无生，如来才说这名菩萨是真正的菩萨。</p><p>菩萨三大无量数劫修行菩萨道，究竟是如何庄严佛国土呢？每个菩萨的修行，都是通过身口意行的造作来实行的，菩萨的每一点点善法的修行，善业的累积，都是在庄严着佛国土，那么庄严佛国土就是通过菩萨的身口意行来庄严的。为什么所有的菩萨行都是在庄严佛国土呢？我们应该知道，佛国土是从哪里来的，是如何出现的，佛国土为什么有区别。</p><p>菩萨三大无量数劫的修行，成就了佛道，然后就能现起无数的佛国土。这些佛国土，都是从佛的无垢识当中所变现出来的，是无垢识根据佛的善业种所变现出来的。那么善业种是哪里来的呢？当然是佛从学佛作菩萨开始起修，所修得的种子，点点滴滴地都存在如来藏里，然后如来藏依种子而现起佛国土。</p><p>菩萨的修行，包括发大清净愿，勤修戒定慧，熄灭贪嗔痴；读诵受持一切佛法，修行菩萨六度，去除烦恼，灭除无明，灭除染污种子，存储清净种子，最后转识成智，成就大圆镜智，变现无量佛国土，广利无边众生。而菩萨在修行过程当中，由于愿力的不同，具体行持的不同，其业种也不同，那么成佛时所变现的佛国土也不同。所以菩萨修行的所有善业行，都是在庄严佛国土，也都是五阴身心的行为造作，而五阴身心幻化不实，因此庄严佛国土，即非庄严佛国土，假名为庄严佛国土。</p><p>最后，世尊总结说，如果一个菩萨能够通达无我的法，那才是一个真正的菩萨。为什么这样说呢？因为通达无我法的菩萨，会渐渐通达一切法，一切法都是以五阴我为中心而展开的，五阴我没有了，也就没有一切法了。五阴我不实，一切法都不实，五阴我没有实质，一切法都没有实质。那么当菩萨通达了一切法无我以后，就证得了越来越深的无生法忍智，其菩萨果位就会地地增上，其道种智圆满之后，就成为一切种智，佛道也就圆满了。</p></div>"
},{
    "title": "第二十章　一体同观分第十八",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十章　一体同观分第十八</strong></p><p>因为佛有五眼六通，能彻见一切法，彻见一切众生，所有众生的心，如来悉知悉见。如来既能见众生，也能见众生的如来藏心，就知了众生心。而众生的现在心、过去心、未来心都不可得，因为是生灭幻化的，不能久长。</p><p>原文：<strong>须菩提。于意云何。如来有肉眼不。如是。世尊。如来有肉眼。须菩提。于意云何。如来有天眼不。如是。世尊。如来有天眼。</strong></p><p>释：世尊对须菩提说：须菩提，你怎么认为呢，如来有肉眼吗？须菩提回答说：是这样，世尊，如来有肉眼。世尊又问：须菩提，你怎么认为呢，如来有天眼吗？须菩提回答说：是这样，世尊，如来有天眼。</p><p>肉眼，是四大组成的物质色法，浮在身体表面，能与色尘相对，负责传输色尘微粒进入胜义根，依此，眼识就能出生，然后就会明辨各种色尘境界。众生肉眼形状、颜色、功能各异，在身体头部的处所也各异，依众生的业种而显现不同的形态与功能，其见色功能也各异。依业力的不同，众生所见色的高低、远近、上下、大小、范围、色彩、内涵也各有差异。</p><p>以人眼为例，肉眼受障碍物所限制，障碍物之外的色体就不能见，只能见眼前到障碍物之间的物体。没有障碍物时，普通人的肉眼最远只能见到几千米的距离，离眼一尺之内，越近越看不清楚，贴近肉眼，则完全看不见了。肉眼受光线的限制，光线太强或太暗，则不能见物。色体越精细，越看不清楚。肉眼有病变和障碍的更是如此，比如老花眼、近视眼、远视眼、青光眼等等，所以众生的肉眼会有很多局限性。</p><p>而佛的肉眼则不如是，佛三大无量数劫的修行，业障全部彻底灭尽，肉眼见色则无丝毫障碍。佛的肉眼就像四大海水一样清澈明亮，又深又广，深不可测。佛经里比喻佛眼为清莲花眼，又广又长，是极慈悲相。佛眼没有圆圆的、鼓鼓的，没有杏眼圆睁相，那是嗔恚相；佛心慈柔，因而眼也是广长、细长相，与慈心相应。佛的外貌，三十二相八十种好，完全与佛心一致，是佛心的外现。</p><p>众生的外貌也如是，是众生心的外现，与众生心相一致。貌如其人，众生心贪，相貌则现贪婪相；众生心嗔，相貌则是嗔恚相；众生心痴，相貌则是愚痴相。佛的肉眼见色，要远远殊胜于众生无量倍，佛的肉眼永远不会出现病障，永远不会见色扭曲。佛的肉眼见色，会见到极微细处，甚至如细菌般极微细色，肉眼也没有障碍，都能看得清楚，不会像人类一样，还要用显微镜和放大镜，佛的肉眼完全能够代替显微镜和放大镜，佛的肉眼能看见极远处的极迥色、极略色。佛肉眼的功德，无论何人也赞不完全。</p><p>天眼，也是见色，与色尘相对，但是天眼见色没有障碍，可以透过物质的遮障，见到极远处的色尘，如能见到其它星体其它世界，见到一切遮障物后面的色尘，如地壳里的物质，须弥山后的物质色法。天眼一般是指天人的眼睛，因为天人的色身比较轻微，不是像人类的色身是由粗重的四大物质组成，所以天人有神通，天人的眼睛有神通，能够透视，能够见极远的其它星体的色尘。鬼神阿修罗非人之类的众生，他们的色身也不是粗重的物质色法，而是由微细四大组成的物质色法，因此见色也没有障碍，或者障碍小一些，所以他们都有小神通。其神通大小不一，依业力的不同，而有一些差异。</p><p>人类众生如果有天眼，一个是生来就有的果报通，一个是通过修禅定而获得的。也依果报不同，禅定不同，天眼通就有许多差异。而佛的天眼通，要远远超胜于所有的天人、所有的阿罗汉、所有的辟支佛，也超过所有的诸大菩萨，能见十方世界无量诸佛国土，没有障碍，这是诸佛三大无量数劫修行所得的殊胜果报。</p><p>原文：<strong>须菩提。于意云何。如来有慧眼不。如是。世尊。如来有慧眼。须菩提。于意云何。如来有法眼不。如是。世尊。如来有法眼。须菩提。于意云何。如来有佛眼不。如是。世尊。如来有佛眼。</strong></p><p>释：世尊问：须菩提，你怎么认为呢？如来有慧眼吗？须菩提回答说：是的，  世尊，如来有慧眼。世尊问：须菩提，你怎么认为呢，如来有法眼吗？须菩提回答说：是的，世尊，如来有法眼。世尊又问：须菩提，你怎么认为，　如来有佛眼吗？须菩提回答说：是的，世尊，如来有佛眼。</p><p>慧眼，顾名思义，是智慧之眼，是指意识心所具备的智慧。智慧又分为小乘见道的智慧，和大乘见道的智慧。小乘的慧眼，是在小乘断我见时开始获得的，依此智慧之眼，知小乘五阴空理，看世间一切法，都是苦的、空的、无常的，都是非我的。小乘的慧眼圆满通达，则具备小乘的一切智：包括世俗智、法智、类智、苦谛智、集谛智、灭谛智、道谛智、知他心智、尽智、无生智。这十种智慧是四果罗汉所能具备的，知五阴世间一切法的苦谛真理、集谛真理、灭谛真理和修道真理，知一切法都是空，生而不生，也知如何灭尽自己的五阴，出离三界生死，得到解脱。</p><p>大乘菩萨的慧眼，在初明心开悟时就获得。由于证得了不生不灭的真实心如来藏，知五阴身依真如心而有，是真如心所生，因此五阴虚幻非我。而真心本来而有，也不用出生，现前观察真心如来藏的运作，能够了知更多真心体性，从而获得更多智慧。慧眼圆通之后，通达大小乘之理，见道之后所获得的智慧具足，就进入初地，获得法眼。有法眼的地上菩萨，能够现观世间一切六尘万法，都是由真心如来藏而生，除此如来藏，没有一法能够独立存在，没有一法有其自体性，全部是如来藏性。</p><p>无论眼根所对的一切色法，无论耳根所对的一切声法，无论鼻根所对的一切香法，无论舌根所对的一切味法，无论身根所对的一切触法，无论意根所对的一切六尘法，都是由如来藏所生，没有例外，这是有法眼菩萨的现观智慧境界，知心外无有少法可得，心外无一法存在。</p><p>法眼圆通之后，转识成智，大圆镜智现前，圆满佛道功德，成就一切种智，就具有了佛眼。佛眼能够彻见一切法的实质，了一切法的实相，见一切法都是真如，见一切众生也都是真如。世出世间，无一法不知，无一法不晓，无一法不见，毫无障碍。知十方世界一切众生的所有心行，无一遗漏，无一差池，无一错谬，心得无碍。</p><p>原文：<strong>须菩提。于意云何。如恒河中所有沙。佛说是沙不。如是。世尊。如来说是沙。须菩提。于意云何。如一恒河中所有沙。有如是沙等恒河。是诸恒河所有沙数。佛世界如是。宁为多不。甚多。世尊。</strong></p><p>释：世尊说：须菩提，你怎么认为呢，比如说恒河当中的所有沙子，佛是否也同样称作沙子呢？须菩提回答说：是这样的，世尊，如来也把这些沙子叫作沙子。世尊说：须菩提，你怎么想的呢？就像一条恒河中的所有沙子，又有像这些沙子一样多的恒河，然后这样多的恒河里的所有沙子的数量，佛国土就是这样的多，那么这么多的佛国土，是不是很多呢？须菩提回答说：世尊，那简直是太多了。就像一条恒河里的沙子，就已经数不清了，何况像沙子一样多的所有恒河里的所有沙子，那简直不能数，也不能想象了，佛国土就是这样的多，那么佛国土也是不可想象的。</p><p>原文：<strong>佛告须菩提。尔所国土中。所有众生，若干种心。如来悉知。何以故。如来说诸心皆为非心。是名为心。所以者何。须菩提。过去心不可得。现在心不可得。未来心不可得。</strong></p><p>释：世尊告诉须菩提，在这么多的佛国土中的所有一切众生，他们的种种心，如来全部都知道，毫无遗漏。为什么这样说呢？因为如来说所有这些众生的种种的心，都不是真正的什么心，只是名字，都不是真实存在的心，只不过是给这些心取个假名，叫作心罢了。为什么这样说呢？须菩提，这些所谓的心，都是生灭变异无常的。能够过去的心，那就不可得，因为过去的已经消失了；现在的心，还在念念迁流变化，也把捉不了，也是不可得的；未来的心，还没有出现，更是不可得的。不可得的、把捉不了的心，就不是真实的心，只是一个幻化的假相。</p><p>为什么说众生的种种心，如来都知道呢？这里的如来，一个是指有五蕴身的如来，包括报身佛和应化身佛；另一个是指无五蕴身的法身佛如来。应化身佛，三大无量数劫修行，成就了一切种智，神通道力圆满无碍。其智慧能够彻见十方世界无量无边众生的所有心行，所有众生的心念一时全部了知，哪里众生的因缘成熟，就会应化在哪里，宣传法教，度脱众生。另一个法身佛如来，能够了众生的心行，七识心的现行运作过程当中的心行，如来藏都知道，然后才能配合七识生起现行，继续运作。因此说众生种种心是指妄心七识，不是指金刚心如来藏，因为如来藏只有一种，没有种种。</p><p>如来藏了众生的心行，以了别第七识意根的心行为主。六识在了别六尘万法当中所了别和思维的内容，都要传递给意根，意根依此，生起作意等等心所法，再做自己的思量和抉择，如来藏就会了别意根的作意和思心所，意根的所有抉择和打算，如来藏都能了知到，于是就会随顺意根的抉择，生起六识心的身口意行。所以如来藏了意根的心行，就能让六识的身口意行按照意根的抉择来现行，意根思量的内容也就是六识所了别的内容，所以如来藏了别意根的心行，也就等于了六识的心行。如来藏也了别众生的业种，了别之后，就会输出业种，也就知道众生会现起什么心行出来。</p><p>而这些七识心，其实没有七识心，表面看是有，有是假有，众生妄见、妄知，实际都是如来藏心。如来藏输送出识种子所形成的七识心，实质还是如来藏心，众生妄见有七识心，实质就是如来藏。都是如来藏自己在自己变现的幻化境界当中玩闹着，所以如来说诸心皆为非心。这里的非心，不是指如来藏，是指七识心，意思是说，没有真正的真实的七识妄心，都是第八识如来藏，假名为诸心，假名为七识。</p><p>后边又补充说了三心，前后一致，都是指七识妄心。七识妄心了不可得，因为都不是实法，是幻化的、生灭的，所以才说不可得。过去未来现在的三种心，主要指六识心，以意识为主的心，意根则没有过去未来和现在之分。这些心都抓不住，留不住，刹那生灭，念念不停留，才说这些心是不可得的，也确实得不到。</p></div>"
},{
    "title": "第二十一章　法界通化分第十九",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十一章　法界通化分第十九</strong></p><p>原文：<strong>须菩提。于意云何。若有人满三千大千世界七宝。以用布施。是人以是因缘。得福多不。如是。世尊。此人以是因缘。得福甚多。须菩提。若福德有实。如来不说得福德多。以福德无故。如来说得福德多。</strong></p><p>释：世尊对须菩提说：须菩提，对于这样的事你怎么想呢？如果有人把充满三千大千世界的七宝，都拿出来布施，这个人因为这样布施的因缘，他所能获得的福德是不是很多呢？须菩提回答说：是很多的，世尊，这个人以这样布施为因为缘，将来的果报就是所得的福德，是极多的。世尊对须菩提说，如果众生所获得的福德有其真实性的话，我就不说他所获得的福德非常多了，因为福德并没有真实性，没有实质，没有自体性，所以我才说此人布施三千大千世界七宝所获得的福德非常的多。</p><p>为什么世尊说福德没有真实性呢？套用世尊的语言说：所谓的福德，即非福德，是名福德。福德属于世俗法，没有自性，只是一个名字而已，我们看看福德是以什么形式表现出来的。布施包括财布施、法布施和无畏布施。钱财属于物，是色法，无畏布施属于心法，是意识心的精神世界，不出六尘境界。当众生布施修福的时候，是五阴把属于自己所拥有的色声香味触法六尘布施给对方五阴受用。而色声香味触法六尘属于世俗法，布施世俗法，其果报也是会获得世俗法的回报，就是所说的福德。</p><p>那么世俗法的回报，无非就是三界世间里的财色名食睡、色声香味触而已。具体表现为：名声、权利、地位、眷属、钱财、色身的受用、健康、长寿等等这些世俗法福德。这些世俗法一个是享用完，福德就消失，享受一点，福德就消失一点，最终都享用完，福德就消失殆尽。所以世俗福德有受用了尽的时候，那么众生所拥有、所受用的福德就是生灭性的，那就不真实。真实的永远受用不完，犹如佛的福德永远受用不完，因为那不仅仅是世俗世间里的福德。</p><p>世俗法中福德的非真实性，再从另一方面来说，所有的福德，都是因缘所生法，布施是获福果的因，而且这个所谓的因里，主要还有如来藏的真正的因存在。布施作因时，如来藏现起五阴身具体实行布施的行为造作，同时如来藏收藏布施的业种。之后，如来藏再依赖各种缘，比如此人发财要有发财的缘现前，得权势要有得权势的缘现前，得眷属要有得眷属的缘现前，得长寿要有长寿的缘现前，得名声要有得名声的缘现前。这样缘具足现起时，如来藏输出业种，此人就会获得相应的福德果报。</p><p>这些果报，也是如来藏配合现起的五阴身得，五阴身受用。每一个微细的环节，都有如来藏的协助，都是如来藏所幻化出来的，每一个环节都是虚妄不实。那么总体来说布施的所有行为，得福德的所有过程，这些因与果，都是如来藏所幻化和现起的，因此全部是虚妄的，不真实。也因于此，佛说众生修福布施，所得的福德多，虚妄法才有多与少的数量之说；实相法中，没有数量，没有多少，没有大小，没有长短，没有方圆……这些福德表面看似有，有是假有，恍人眼目罢了，其实质都是如来藏。</p><p>那么法布施，所得的福德，有没有实？是不是福德性？能不能受用完呢？法布施得什么福德呢？法布施所得的福德，包括两方面，一个是会获得世俗法当中的福德，获得殊胜的色声香味触法，另一个是会获得出世间法的福德。而出世间法的福德，会不断地积累起来，直至成佛，福德永远不会消失，也受用不完。法布施，能够获得出世间的智慧，证得出世间的如来藏实相法，从而智慧不断得到增进，地地增上，终究能够圆满菩提果。所以，法布施所得的福德，有很大一部分具有福德性，有真实性，远远要殊胜于三千大千世界的七宝布施。</p></div>"
},{
    "title": "第二十二章　离色离相分第二十",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十二章　离色离相分第二十</strong></p><p>原文：<strong>须菩提。于意云何。佛可以具足色身见不。不也。世尊。如来不应以具足色身见。何以故。如来说。具足色身。即非具足色身。是名具足色身。须菩提。于意云何。如来可以具足诸相见不。不也。世尊。如来不应以具足诸相见。何以故。如来说诸相具足。即非具足。是名诸相具足。</strong></p><p>释：世尊对须菩提说：须菩提，你怎么认为呢？如果众生想要见真正的佛，是不是应该要见完完全全的具足身相的有相佛呢？是否是以身相来见佛呢？须菩提回答说：不是的，世尊，想要见真正的如来，不应该以具足色身相来见如来，应该见真实的如来。为什么这样说呢？因为按照您所说，具足色身，即非具足色身，是假名为具足色身。</p><p>世尊又接着说：须菩提，你怎么认为，如果众生要见如来，是否应该要见具足一切相的如来呢？见具足一切相的如来，能见到真实的如来吗？须菩提回答说：不能，世尊，众生见如来，不应该以具足诸相来见如来。为什么这样说呢？因为按照您所说，具足诸相，即非具足诸相，只是假名为具足诸相。 既然具足诸相只是假名字，没有实体，那就不能见到真正的如来。</p><p>众生由于习惯于着相，总是在各种有为法相上来分别如来，不知真正的如来无相。世尊慈悯于众生，与须菩提对答，开示众生真佛无相，不应该执著有一切相的如来。这样就会只见相，不见真正的如来。真正的如来，离开一切的色法，离开一切的相，无形无相，才是真如来。</p><p>如来分为有色身相的如来，和无色身相的如来，无色身相的如来，是法身佛，是真正的如来，因为祂是万法的起源，永永远远不变异，不生灭，真真实实，长存永在。祂能变化出来无边无量的有色身相的如来，所有有色身相的如来，既然都是由无相的法身如来所幻化出来的，幻生就能幻灭，那就不是真真正正的真实的如来。</p><p>所以世尊问须菩提，想见真正的如来，是否一定要见具足一切色身相的如来，以色身相见如来，是否能见到如来，须菩提即知佛意，马上回答说不是这样。为什么不是这样呢？因为具足了色身的相，不是真实的相，也并不是有个真正的具足了色身的相存在，这些相都是幻化的，只是给这种幻化相取个假名字罢了。</p><p>所有色身的相，身相都具足存在的色身相，是没有一点点色身相的法身如来所幻化出来的，表面看是有，祂也有五蕴的各种活动。可是表面看似有的相和五蕴活动并不真实，都是幻化的假相，是空相。有是假有，五蕴活动也是幻现的假相，虚幻而已，其实质都是法身如来，只是依五蕴身的表相，为这些虚幻的现象取个假名字，方便众生辨别和称呼，方便众生恭敬和供养，方便众生布施和修福。</p><p>世尊又继续问须菩提，众生想要见真实的如来，是否要以具足所有法相而见如来呢。须菩提即知世尊意，马上回答说不是，不应该以具足一切诸相的如来而见，不应该认为具足诸相的如来才是真正的如来，不应该着于一切虚幻的色相。具足诸相的如来，一定是具足佛的三十二相八十种好的如来，那就是有相的如来。</p><p>这些都是世尊三大无量数劫修行所得的果报，而所有的相，都是无相的法身如来，依据各种缘而变幻出来的，有生即有灭，因此有三十二相的就不是真实的如来，而三十二相也不是真实的相。这些三十二相八十种好，表面看好像是有，其实只是个名字。都是法身如来所变现，实质就是法身如来，只是为了众生方便识别、恭敬、供养而取个假名而已。</p><p>那么，在具足色身相、具足三十二相、具足八十种好的如来那里，是否能够见到不具足色身相、不具足三十二相、不具足八十种好的真如来呢？这是一定的，否则如来色身相就不会现起，三十二相就不会现起，更不会具足。大家会问：在具足色身相的五蕴里，哪个是真如来呢？要觅真如来，且听偈言：五蕴身中龙隐身，龙虽隐身常鸣吼。欲在五蕴觅真龙，六个洞口听龙吼。龙常出没六洞口，众生着相不识龙。欲要识龙除色相，除去色相真龙现。</p></div>"
},{
    "title": "第二十三章　非说所说分第二十一",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十三章　非说所说分第二十一</strong></p><p>原文：<strong>须菩提。汝勿谓如来作是念。我当有所说法。莫作是念。何以故。若人言如来有所说法。即为谤佛。不能解我所说故。须菩提。说法者。无法可说。是名说法。</strong></p><p>释：世尊对须菩提说：须菩提，你不要说如来有这样的念头：如来要为众生说法，广利众生。如来没有要为众生说法的念头和想法。须菩提，你一定不要这样认为，不要有这样的想法。为什么告诉你不要有这样的观念、不要认为如来想要说法呢？因为如果有人说，如来有法可说，或者说如来已经说了法，那就是谤佛，此人并没有真正的理解我所说的法教。</p><p>既然如来是大慈大悲，为什么世尊不允许须菩提认为，如来有要说法度众生的念头呢？如来为什么没有说法度众生的念头呢？如来分为三身如来，那我们就要把三身如来分开来讲，正确理解三身如来各自的德能和功用，就会知道如来为什么没有说法度众生的念头。三身如来分别是：法身如来、报身如来、应身和化身如来。其中法身如来，是真如心体和理体无垢识，祂无形无相，没有五蕴身相，没有三十二相，却含藏万法。而报身如来和应化身如来，却都有五蕴身相，有三十二相，这些身相都是由法身如来变化而来。</p><p>那么如来要说法，就得利用五蕴身来说法，没有五蕴身就不能说法。有五蕴身有六识心，才能有说法的念头，没有五蕴身和六识心，就没有想说法的念头。法身如来既然没有五蕴身，祂就不能说法，没有说法的道具之故。如果有人说法身如来也说法了，而且还说了三藏十二部经，那就是谤佛。因为真如心体没有口，没有舌，也不对应法尘，那该如何说法呢？既然真如不能说法，还说如来说了法，那就是错解真如体性，诽谤世尊，他就没有如实理解世尊所说的真如体性，不解佛所说法义。</p><p>世尊对须菩提说：须菩提，即使能说法的人，也是没有法可说的，只是假名说法罢了。为什么如此呢？三身如来当中，法身如来不说法，没有五蕴道具故。只有报身如来在日日不断地说法，度地上菩萨，应化身如来在十方世界常常说法，度化愚凡众生和诸大菩萨。报身佛和应化身佛，虽然能常常说法，可是也无法可说。虽然说了三藏十二部经，说了恒河沙数之多的佛法，但其所说法，也不是真实存在的法，是籍各种因缘而出生的假有法，缘灭即散，缘起即生，幻生幻灭，假名为法。</p><p>而说法者的五蕴，也是幻生幻灭，因缘俱而有，因缘散即灭，都不是真实法。那么有五蕴身而说法这件事，就是虚幻不实的，假名为说法，只是给这种现象取个假名而已。既然无法可说，那么如来也就没有说法的念头，也无众生可度，如来也就没有度众生的念头。况且，如来一直住在常寂光土，心常寂灭，无念无想，不念三界法，也无一法可念，无一法可想。说法度生事业，祂都不念不想，况且其它杂念，那就更不会生起了。但是祂却不妨配合报身佛和应化身佛说法度众，利乐有情。虽然配合，内心仍然无念无想，寂静无为。</p><p>原文：<strong>尔时慧命须菩提白佛言。世尊。颇有众生。于未来世。闻说是法。生信心不。佛言。须菩提。彼非众生。非不众生。何以故。须菩提。众生众生者。如来说非众生。是名众生。</strong></p><p>释：这时候，大德智慧比丘僧须菩提对世尊说：世尊，在未来末法世，是否会有很多众生，听闻到这样甚深的佛法，能够生起信心呢？须菩提这样担心地请问，是因为这样的佛法是如此地深奥难懂，破除了一切法相，很难让众生接受。而众生无始劫以来又习惯于着相，常行于有中，很难于有相的淤泥中拔出来，空却自心。如果是善根福德不够深厚的众生，着于世俗相，着于名字相，听闻这样甚深的大乘实相法，是不会生起信心的，有的人就会惊恐不安，狐疑不信。只有累生累世修集了深厚的善根福德之人，才能欢喜信受。</p><p>世尊说：须菩提，那些众生表面看是众生，实际不是众生，也不能不叫作众生。为什么这样说呢？须菩提，所谓的叫作众生的众生，如来说他们不是真实的，不是实有众生，是假名为众生，只是名字罢了。世尊在此再一次破众生相，众生相是幻化相，非法相，非真实有。依实相心如来藏，依业缘，才能幻化出五阴身。</p><p>五阴十八界和合在一起的幻化相，我们取个假名，叫作众生，没有实质的自性存在，只是一个假相恍人眼目罢了，因此那些五阴身不是众生，但也不能说不是众生，我们就把这种假相，取名为众生，名字已经安立好了。所有的相，都是名字，而且各有各的名字，不相混淆。五阴的虚幻相，就用众生的名字来代表，说个众生，说明就是五阴身这种相。因此，佛说：彼非众生，非不众生，是名众生。一切有相的世俗法，都仅仅是个名字而已。因此这一品，叫作非说所说分。如来并没有说法，所说的法，也非真实有说，都是幻化罢了，没有实义。</p></div>"
},{
    "title": "第二十四章　无法可得分第二十二",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十四章　无法可得分第二十二</strong></p><p>原文：<strong>须菩提白佛言。世尊。佛得阿耨多罗三藐三菩提。为无所得耶。佛言。如是。如是。须菩提。我于阿耨多罗三藐三菩提。乃至无有少法可得。是名阿耨多罗三藐三菩提。</strong></p><p>释：须菩提对佛说：世尊，您得了阿耨多罗三藐三菩提，成为了无上正等正觉，但是即使是这样，也是无所得的，是这样吗？ 世尊说：确实是这样，就像你所说的，须菩提，我虽然已经成就了阿耨多罗三藐三菩提，但我确实没有得到一点点微少的法，一法也没有得到，只是断尽了一切无明。只有无法可得，才能成为无上正等正觉，然也只是在名义上证得了阿耨多罗三藐三菩提，这个果位也只是一个名字而已。</p><p>这样的结论，如果不是佛亲口所说的，众生就会满腹狐疑不信，甚至要毁谤。因为众生都是认为，佛既然是已经成佛了，一定是得到了无量无边无数之多的法，才能成佛，世出世间一切法都得到了，才能成佛，否则就不能成佛。即使成为菩萨，也是得到了很多的法，才能成为菩萨，否则就是凡夫。即使是凡夫，也是不断地在得失之间摇摆，非是一法都不得。</p><p>众生知佛、知菩萨、知自己都是在哪些方面有所得呢？当然众生都是在相上知道佛有所得，知道菩萨们有所得，知道凡夫众生的得与失。那么众生知道成佛了在相上都得到了什么法呢？首先从佛的色身上看，成佛时，佛得到了圆满的报身、应身和无量无数的化身，得到了三十二相、八十种好的庄严妙相身，因而，佛才能应以什么身得度，即现什么身，而为众生说法。</p><p>在国土上，佛得到了无数清净庄严的胜妙佛国土，并且有无量无边之多的弟子随从修学。佛三大无量劫的辛苦修行，修得了无量三昧，获得了无量的神通道力，能降伏所有的天魔外道。最主要的是，佛得到了一切种智，获得了最胜妙的大智慧，世出世间法，无一法而不了知，因此而能随自意随时为众生讲述三藏十二部经典，讲述出全部佛法。</p><p>佛所得到的这些法和功德，都是最粗略而说，细说百大劫也说不尽。然而，这些功德，这些法，佛在当凡夫时，并不具备，都是从凡夫位时开始起修，一点一滴地逐渐获得的。那就是说，佛得的这些法和功德是从无到有，从少到多，由不具足到圆满具足。这说明了什么呢？说明了这些法，从无到有，是生；生则不是本来而有，不是本来而有，就是幻化的，幻化则不实。既然是幻化不实，那么就不能真实得到。就像火炉得冰，了不可得；就像虚空中花，了不可得；就像夏日阳炎，了不可得；就像梦中物，了不可得；就像石女之子，了不可得；就像水中泡沫，了不可得……</p><p>这些法相，在相上都可了知到，都有相貌。但是这些相是从哪里来的呢？都是从佛的实相心无垢识当中而来，都由无垢识所变现和幻化出来的。佛三大无量劫的修行，其功德一点一滴地都存在佛的因地心如来藏当中，毫无遗漏，无量功德都作为种子存下来了。因缘成熟时，其果报就会不断地显现出来，显现出来的都是相，由如来藏变现出来，那么这些相就都是虚妄的、生灭的、幻化的，不是实法。实法只有一个如来藏，不生不灭，或者叫作佛的无垢识，真常、真乐、真我、真净，其余一切，都不真，都由真所幻化和显现。</p><p>再从另一方面来说，这些虚妄的法相，是由谁得呢？我们来看看，佛是由哪几部分组成的。佛也是由身心两部分组成，佛身也为四大合成，虽然有无量相好，也是无觉无知，缘尽，四大散坏，色身即消失。色身自身尚且不自在，况能从外得法，且也不是心，如何能得法？佛心有八：大圆镜智（第八识）、平等性智（第七识）、妙观察智（第六识）、成所作智（前五识）。佛的大圆镜智第八识，是一个无所得的心，一切法都不得，因为自身本自具足一切法，丝毫不欠少什么，一切法都是由自身所生出，都由自身而来，那祂就不会自己再得自己；而且本来也都是属于自己的，还得个什么呢？</p><p>佛的七识心，虽然是有所得的心，然而佛的七识心已经达到纯无为了，内心已经空空净净，不会再贪得任何一个法，也不觉自心有所得什么法。况且，佛的七识心，虽然已转换成智，种子彻底清净，没有一丝无明，但是，也仍然是由佛的无垢识，流注识种子而生成，因此是虚幻的，有生灭性；有生灭，那就是不自在法。那么七识自身尚且不自在不可得，况且还能得其他的法。佛的七识心，如果认为有法可得，心就不空净，心不空净，还不能成佛，因此佛的七识心也不得一切法。</p><p>佛虽然成就了阿耨多罗三藐三菩提，获得了无量殊胜的妙法，于法，也实在是无所得的。对于成就佛道这一法，中间过程以及结果，都是由佛的如来藏无垢识来圆满成就一切法，每一法都是由如来藏无垢识配合七识所幻现出来的，都由如来藏无垢识所成就，都是如来藏性，本非实有。所以就把成就佛道这一法，取名为阿耨多罗三藐三菩提。所以阿耨多罗三藐三菩提只是一个名字，实质是无垢识所幻化的。</p><p>总而言之，佛是因为无所得而成佛，一法也不得才能成佛，如果认为有一法可得就不能成佛。为什么这样说呢？佛是以大智慧无上智慧而成佛的，佛的智慧是如何得到的呢？佛从凡夫起修，经过三大阿僧祇劫，逐渐的破尽了所有的无明，每破除一种无明，就显示出一种明，心地的黑暗消失一部分，就出现一部分光明，这光明就是智慧。所有的无明灭尽，一切种智就出现，所以佛的无上智慧无等等智慧，不是获得的，也不是得到的，是灭尽无明显现出来的，也就是说成佛不是得到了什么法，而是一法也不得，去除了所有的遮障，心地光明就自然的显现出来了。所以我们每个人学佛修行，目的就是要破除无明，而不是非要得到什么，有所得的心，就是无明，就是遮障，智慧不会出现。</p></div>"
},{
    "title": "第二十五章　净心行善分第二十三",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十五章　净心行善分第二十三</strong></p><p>原文：<strong>复次。须菩提。是法平等。无有高下。是名阿耨多罗三藐三菩提。</strong></p><p>释：世尊又接续为须菩提讲解说：复次，须菩提，凡是世间所有一切法，都是平等的，并没有高下之差别，证得如此的境界，就叫作阿耨多罗三藐三菩提，也就是得成了无上佛道。</p><p>是法，就是指三界世间所有一切法，凡是称作法的，凡是存在的所有法相，点滴不漏，都是平等一如，没有高下，没有差别，全体即真如。站在真如之理体上来观察，一切法相，都是平等的真心理体，无有二相。证得如此之大智慧，假名为得成阿耨多罗三藐三菩提。</p><p>世尊为什么如此说呢？因为佛在成道之时，佛的第七识已经彻彻底底的转变成了平等性智，对于世出世间一切法的认知，已经达到究竟彻底的平等，没有一丝一毫的不平等心智。首先以佛的最究竟无上的第六识妙观察智来说，观察三界世间一切万法，都是基于实相心体真如的运作，而产生出来的一切法相，其实质都是本体真如。</p><p>就如黄金打造出的所有黄金制品，包括所有的装饰品，所有的日用器皿，以及各种人物画像，凡是所有黄金打造成的物品，其本质都是黄金，没有他物。不管是黄金装饰品也好，还是黄金塑造的各种人物画像也好，都是黄金，都可以当作黄金来使用和流通。若有人，不见黄金，只见物品的相貌，此人即是着假相不识货之人。不知真金之可贵，弃金而取假相，此人名为无智之人。世间凡夫也如是，只见世间一切虚妄相，不见虚妄相的实质，执著名相，不识本质。因此愚痴着相，而在六道生死轮回不尽，苦痛不已，甚为可悯。</p><p>佛的妙观察智，不仅见一切法都是真如，而且能够现观，真如是如何流注心体当中的种子，成就了三界世间的一切万法之相。因此，佛的第七识平等性智，能够平等对待三界世间所有众生，无有分别其高低贵贱之差别相。佛平等看待一切众生，都具有如来智慧德相，都是因地佛，未来时日，都会圆满成就果地觉。因此佛对众生生起无缘大慈，广利有情，只要众生根熟，不管众生是善是恶，都会平等施与法食，度其得道解脱。</p><p>原文：<strong>以无我无人无众生无寿者。修一切善法。即得阿耨多罗三藐三菩提。</strong></p><p>释：世尊说：众生内心当中不着我相、人相、众生相、寿者相，以无我相、无人相、无众生相、无寿者相之心行，来修行世出世间一切的善法，就会得成阿耨多罗三藐三菩提。</p><p>世尊在金刚经开篇不久，就给众生破了四相，只有破四相之菩萨，才能与金刚般若之理体相应，才能与诸法实相相应，才能与真如相应，最终就会与阿耨多罗三藐三菩提相应。因为众生无始劫以来，一直在执著于四相，不与空性理体相应，因此为了四相，广造无量无边的恶业，积劫沉没于生死业海中，受苦无量，无得出期，根源就在于执著四相之病。世尊大慈，为挖众生着相、执相之病根，巧设种种方便，来破除众生的四相，以无四相，就能出离生死大火坑。</p><p>为什么无四相就能出离生死大火坑呢？从小乘法的角度来讲，众生只要能破除我相，就会出离三恶道，当修到能够断除对自我五阴身以及对三界世间法的执著的时候，就有能力出离六道生死轮回，这样就出离了分段生死的火坑，暂时得到休歇。当众生继续往菩萨道和佛道进修之后，就会逐渐破除种种法执，断除种种变异生死，证得涅槃真净，从此了无生死，生死的大火坑，才真正彻底地出离了。</p><p>而进入菩萨道和佛道的起点，就是要证得本来就无四相的金刚般若真如心体。依此无四相的理体起修，内心转转清净，就会破除世间一切的有为法相，连真如之相也不执，内心空净极空净，无余一丝法相的存在和执著，这样才能与真如心体彻彻底底的相应，最终就会圆满成就佛道，得到阿耨多罗三藐三菩提。所以世尊说，以无我无人无众生无寿者，修一切善法，与真如体性相应，才能成就阿耨多罗三藐三菩提。</p><p>原文：<strong>须菩提。所言善法者。如来说即非善法。是名善法。</strong></p><p>释：世尊又对须菩提说：须菩提，我所说的善法，和众生们所认可的善法，如来说也非善法，没有实际意义上的善和法，都是一种表相罢了，因此就假名为善法。</p><p>善法分为很多种层次和内涵，有世俗间的善法，也有出世间的善法，有小善法，也有大善法，更有究竟意义上的善法。世间善法，就是五戒十善。世尊最初到娑婆世界，首先就讲人天善法，让众生依之修行，得世间福德，这是小善。众生得到世间福德之后，才能接续跟随世尊修学阿含解脱道，出离三界世间苦，这是中善。继而世尊又用二十多年时间，为众生宣示般若之理，让众生依之修行，都能证得般若实相，成为真实义的菩萨，然后发起各种甚深般若智慧，这是上善。之后世尊又宣说方广唯识甚深之义理，度化大乘菩萨们渐具甚深道种智，这是大善。最后世尊再宣讲法华涅槃等一佛乘之究竟义，度化所有众生，都进入成佛之道，修行成佛之法，以达到究竟圆满的佛果，这是究竟的善。</p><p>这些善法，都有相对应的法相，而这些法相，都是依无四相的无相之心体如来藏而显现和幻化出来的。这些法相，都是如来藏依各种缘，流注出种子而成就的。表相是有，众生可见，但是有非实有，相非真相，其本质就是真如如来藏，都是真如一真法界中物，不出真如之外。所有一切的善法相，就如黄金之器，都来自于黄金，本质都是黄金如来藏。因此就都是一个真实的法界——真如之体。那么就把这些所有的善法假相，非是实有的法，取名为善法，名字虽为善法，实质是真如理体。</p></div>"
},{
    "title": "第二十六章　福智无比分第二十四",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十六章　福智无比分第二十四</strong></p><p>原文：<strong>须菩提。若三千大千世界中。所有诸须弥山王。如是等七宝聚。有人持用布施。若人以此般若波罗蜜经。乃至四句偈等。受持读诵。为他人说。于前福德。百分不及一。百千万亿分。乃至算数譬喻所不能及。</strong></p><p>释：世尊对须菩提说：如果有人把三千大千世界里类似所有须弥山一样多的七宝，都聚集起来，然后拿出去布施，这个福德应该是非常多的，相当的多。但是，还有一个人，他能够受持读诵这部金刚般若波罗蜜经，或者仅仅能够受持读诵金刚经当中的一个四句偈子，并且为其他人讲说。那么这两个人所获得的福德，后者要远远超胜于前者，受持经典所获得的福德比布施像须弥山一样多的七宝的人所得福德，多百倍百千万亿倍，乃至于多无量无数倍。其中的差距，用人间的各种计算方式也计算不出来，用人类的语言的各种譬喻，也形容不出来，二者差距是太大了。</p><p>一个三千大千世界会有十亿、百亿个须弥山，一个须弥山比地球大无数倍，而地球上就有无数大小山丘以及广阔无边的土地。如果一个人，仅仅能够布施一座小山丘的七宝，那个福德就已经没法计算了，何况布施整个地球的七宝，何况布施须弥山一样多的七宝，更何况布施十亿百亿个与须弥山一样多的七宝，此人所获得的那个福德，无数台电脑也算不清楚。这么大的福德，佛说都不算大，远远没有受持读诵金刚经的福德大，而且比受持读诵金刚经的福德相差极大，不可比拟，也不可数说。即使受持读诵金刚经中的一个四句偈子，其人所得的福德，也远远比布施如一个三千大千世界里所有须弥山一样多的七宝的福德，要多数不清的倍数，那么受持读诵金刚经的福德该有多大呢？</p><p>以前讲过，真正能够受持读诵金刚经或者是经里面四句偈子的人，都是真正明心证悟般若实相的人，才有能力受和持金刚经，才真正的会读会诵金刚经，才知道如何读金刚经，如何诵金刚经。金刚经全部是讲述般若实相心的智慧功德，其理甚深又甚深。</p><p>找到金刚心，证悟如来藏以后，才能读懂如来藏法，才能诵出如来藏里的内涵，才能接受如来藏所有的法义，才能逐渐按照如来藏之理去行持，从而改变七识妄心的所有心行。从此以后，七识妄心的烦恼会渐渐消除，烦恼习气会渐渐减淡，无明会渐渐薄弱。依如来藏而修行，就会了知更多甚深法义，以及如来藏里的所有种子内涵，这样尘沙无明惑就会越来越少，以至最后全部灭尽。</p><p>受持读诵金刚经的福德之大，确实难以述说和描述，仅举其中一小部分例证来说其中大概，大家就能晓了其福德的广大无边性，不可思议性了。比如说，菩萨证悟般若实相以后，依如来藏而修出了四禅八定，就会有百、千、万、亿个意生身，以此来利乐无数众生，超出生死轮回苦。这个福德，真是无价的，无有比拟的，没办法计算，其福德永永远远也受用不尽，而且会无限量的增多。</p><p>而布施大千世界须弥山的福德，虽然也是极大，不可算数，但是还是有限的，能够被消耗殆尽。这个福德也不能抵消恶业，也许还会因为无明，享福之时就会利用福德造作大恶业，那就会随着恶业，而去受恶报。造作恶业之时，其福德也会损减消耗，最后福德就会以各种方式，享用殆尽。而菩萨读诵受持金刚经的福德，不但不能损减，还会增加，福德集聚的会越来越多、越来越大。</p><p>随着菩萨智慧的不断增长，其福德就会无数倍的增加。当菩萨修到八地菩萨的果位时，菩萨只要心一作意，就能变出一个三千大千世界，里面充满了七宝，比须弥山还要多无数倍，菩萨都会布施给众生，那个福德更是无法计算。菩萨还会变出更多的众生所需要的各种物质生活资具，来布施利乐于众生，这个福德也是无法计算。再加上菩萨分身无数，到十方世界去广度无量无边的众生，那个福德，就不用再计算了，因为根本没办法计算，也不可想象，不可思议。</p><p>这才是八地菩萨所获得的福德，或者是八地以前的菩萨所获得的福德，这些福德都无法计算。那么菩萨再修到等觉菩萨的果位，一百劫当中，菩萨变现无数大身众生，供无量众生食用度过饥饿，所获得的福德，更是不可想象的。再修到佛的果位，广度十方世界无量众生，所获得的那个福德，所有众生共同计算，也算不出来，所有的言辞也表达不出来。所以世尊说，受持读诵金刚经以及经中四句偈子的人，其福德要大于布施七宝的人的福德，无量百千万亿倍，也不止于此，二者真是无法比拟。</p><p>既然受持读诵金刚经，会有这么大的福德，那么我们会不会读诵金刚般若波罗蜜经呢？会不会读诵一个四句偈子呢？如果会读，金刚般若的密意，就都能显现出来；如果不会读，会不会听呢？如果会听，金刚般若的密意，也都能听出来。为什么有人不会读呢？因为众生都是把读经这样的事情，当作很平常的事来对待，以为没有什么呀，就是口里冒出声音就行了，上下嘴皮子一开一合就行了，这有什么呀？人家会读的人，可不是这样认为，会读的人，能把其中的奥秘读出来，这是对佛最大的供养了；会读经的人，也能把经里的奥秘，显露给众生，从而开导众生正确的知见，破除众生的迷茫和黑暗；会读经会诵经的人，个个都是日用处处知，不迷惑，不颠倒。</p><p>如果不会读金刚经的人，我现在就教你们读和诵。要这样读诵：金~刚~般~若~波~罗~蜜~经……，要一字一顿，抑扬顿挫，声音要时高时低，音流要一会儿长，一会儿短，同时，要回光返照自己的能读性，寻觅声音的起落处，结结实实的给它来个大大的问号。如果这样还是不会读，那就要训练自己会听：一……切……有……为……法……如……梦……幻……泡……影……，想象旁边有人就是这样读诵的，再想象他是如何读出来的，他的舌头、牙齿和嘴皮子，是如何配合的，想象他的声音，是如何出来的，从哪里出来的。</p><p>然后自己思维：</p><p><strong>梦……</strong>这一切是不是梦呢？这些声音是不是梦呢？面前读经的人，是不是梦呢？读经听经这件事情，是不是梦呢？</p><p><strong>幻……</strong>这一切事情，是不是幻呢？文字、语言、人物，能听的心，所听的音，都是如何幻的呢？</p><p><strong>泡……</strong>这一切事情，是不是像水泡一样呢？从哪里冒出来的？泡灭，又灭到哪里去了呢？</p><p><strong>影……</strong>这一切事情，是不是影子呢？如何幻化出的影子呢？是谁幻化出来的影子呢？怎样抓住那个幻化影子的主人呢？</p><p>等自己的前行基础工作都做好了，水到渠成时，自然会揭穿谜底，真相大白，找到那个金刚般若实相心，证悟如来藏。从此以后，就真正地会读诵金刚经了，也就会受持金刚经了，那就好极了！</p></div>"
},{
    "title": "第二十七章　化无所化分第二十五",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十七章　化无所化分第二十五</strong></p><p>原文：<strong>须菩提。于意云何。汝等勿谓如来作是念。我当度众生。须菩提。莫作是念。何以故。实无有众生如来度者。若有众生如来度者。如来即有我人众生寿者。</strong></p><p>释：世尊对须菩提说：须菩提，对于如来度众生这件事，你怎么想呢？是否认为如来一心念着、想着我要度众生呢？你们不要有这样的观念，认为如来有度众生的念头。须菩提，你们心里不要这么想，不要说如来念念想着度众生。为什么不让你们这样想呢？因为实际理地，确实没有众生如来可去度化的。如来如果真认为有众生可度的话，如来心里就有我相、人相、众生相、寿者相。有这些相，如来也就不成其为如来了。</p><p>法身如来，无相，无念，无所念，祂从来不会念着众生，也不会度众生，也不知道什么叫作众生，心中也不起念想，因此法身佛不念众生，也不度众生。为什么呢？因为法身佛无道具，无眼耳鼻舌身意，无眼不见众生相；无耳不听众生音；无身不面对众生；无口，不能为众生说法；无意，不缘念众生。因此，度众生这件事，法身佛就无能为力。</p><p>但是报身佛和应化身佛要度众生时，还真得有法身佛来帮助不可。需要法身佛把佛国土现出来，把地点环境现出来，把众生相现出来，把佛法现出来，把度众生的所有道具和资粮都准备好。所有一切法，法身佛都必须要布施出来，报身佛和应身佛、化身佛，才能度众生，缺少一样，都不能度众生。由此看来，度生事业，是因缘所生法，需要真佛和假佛共同合作才能完成，非是一件简单的事情。</p><p>既然应化身佛度众生，法身佛必须把众生相变现出来，才能度化，那么这些众生，是实有的吗？当然不是。世尊说：实无众生如来度者。这句话是有一定道理的。实无众生，就是确实没有众生，因为佛所度的众生，是法身佛变现出来的，法身必须要先显现出来，应化身佛才能度化。</p><p>那么法身佛把众生是显现在应化身面前，还是显现在应化身的心中呢？当然是显现在应化身佛的心中，众生是佛心中的众生，佛也是众生心中的佛，心外无法。因为心外无法，面前即心中，心中即面前，都是幻化出来的假相，依缘而起，缘散即灭。而众生自己原本的五蕴身，也是自己的如来藏，依各种业缘而化现出来的，也非实有，缘灭也散。</p><p>所以在如来的心里，是没有众生可度化的，虽然如来度化了无量又无量多的幻化众生，也确实没有真实的众生可度，心中的众生，都是影像，如来也就没有度化过一个众生。如果如来心中有念，我要度众生，那么如来就把众生当作实有，把众生的幻化五阴相，当作实有，那么如来也就不能称作是真如来，也并非是真菩萨，只能是凡夫的知见罢了。</p><p>而真正的如来，心中是无我相的，不在一切法当中做主宰，也没有五蕴色身相，没有觉知六尘的心相。那也就没有人类的色相，没有众生相，同样也没有寿者相，因为如来无始无终，没有断灭过，没有终止过，祂的寿命是无限绵长的，所以如来没有四相。而在报身佛和应化身佛的心中，也没有四相，内心已经彻底无任何法相，空净极空净，舍弃了一切法，才成就了究竟圆满的佛。</p><p>原文：<strong>须菩提。如来说有我者。即非有我。而凡夫之人以为有我。须菩提。凡夫者。如来说即非凡夫。</strong></p><p>释：世尊接着对须菩提说：如来所说的有我，并不是真的有个我，可是凡夫们却都以为有个我，以为这个我的五阴活动是这样的真实。须菩提，所谓的凡夫众生，如来说，也不是有个真实的凡夫众生，只是假名为凡夫罢了。</p><p>每尊佛在为众生讲法时，有时口里也说我如何如何，来叙述事情，其实这是诸佛的方便说法，如果不说我字，众生就不知道世尊在说什么，也没法正确理解  世尊所讲的内容。所以诸佛口中说我，是为了与众生交流方便，教化方便，让众生能够很好地理解自己所讲的内容。诸佛虽然口中说我，内心却是完完全全的无我，从不把自己的五蕴当作我，也不执著自己的无垢识和佛性，所以诸佛如来，都是彻底无我的。</p><p>凡夫众生心里都认为有个我，认为我是真实的。他们普遍认为，色身我是真实的，身体的五官、骨骼、肌肉、皮肤、内脏，身体的各个组成部分，都有真实的功能利用，这就是我，或者是我所有的，于是就会生起贪恋和执著，不容他人侵犯。凡夫众生认为，在色身上生起的见色、闻声、嗅香、尝味、觉触、知法的六识功能作用，是真实的，就是我，或者是我所有的，于是就会生起贪恋和执著，不容忽视。</p><p>凡夫认为，在色身上生起的六识的各种觉受，是真实的，就是我，或者是我所有的。于是就牢牢地抓取，追求感官的各种觉受刺激，一旦遇到违缘，内心就会非常痛苦和嗔恨。凡夫们认为，在色身上生起的各种了知性，思惟分析判断推理的功能作用，就是我，就是我所有的。于是也就会生起贪恋和执著，时刻不肯休歇自己的心念，时刻都想感知一切法。</p><p>凡夫们认为，在色身上生起的各种触觉，是真实的，就是我，或者是我所有的，于是就会贪执各种触尘，讲究活得舒适自在，讲究享受，不惜付出一切代价。凡夫们认为，在色身上生起的各种行为造作，是真实的，就是我，或者是我所有的。于是就会不断奔波劳碌，营造一切事业，不断地造作身口意行，不肯休歇。</p><p>凡夫众生无始劫以来，就是这样的错会、误会，就是这样的不断执取，辛苦奔波于六道，不知疲惫，真是可怜悯者。如来怜悯众生的愚痴和苦痛，出世为众生宣说，五阴之一切法本不是我，也不是我所有；五阴依缘而起，生灭变异，作用虽有，幻化不实。就比如，沙土与水，合成为泥，用泥捏成五阴色身，咒力作用于泥身，于是泥人就有种种行为造作，愚痴凡夫不知此理，执取泥人假相，不知泥人不是人。智者即知，不取泥人假相，而只认取泥和用泥。</p><p>世尊又说，执取五阴为我的凡夫，也不是真实有的凡夫，而是幻化而有的五阴相，本质为空。只是为了语言交流，取个假名，假名为凡夫，其本质也是其人的如来藏。用金作器，器器皆金；用泥捏人，人人皆泥；如来藏幻化一切法，一切法皆为如来藏，名为一真法界，旁无他物。若人见一切法实有，名为病眼，若人见一切皆真如，名为慧眼、法眼和佛眼，皆是大智慧之眼。</p><p>凡夫众生认为五阴是我，是我所有的。这个我，是指谁呢？这个我是指第七识意根，第七识把什么都当作我和我所有的，贪得无厌。实际上，第七识是错会、误会了，祂不知道这些都不是祂自己，都不是祂自己的功能作用。其中最主要的是第八识的功能作用，其中还有六识的功能作用；而六识的功能作用，实质也就是第八识的功能作用。明心开悟以后，第七识意根就会醒悟过来，知道原来这些都不是我，到入地以后，就会对一些法开始放手了，不再执取和抓取五阴世间了。</p></div>"
},{
    "title": "第二十八章　法身非相分第二十六",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十八章　法身非相分第二十六</strong></p><p>原文：<strong>须菩提。于意云何。可以三十二相观如来不。须菩提言。如是如是。以三十二相观如来。佛言。须菩提。若以三十二相观如来者。转轮圣王即是如来。须菩提白佛言。世尊。如我解佛所说义。不应以三十二相观如来。</strong></p><p>释：世尊对须菩提说：须菩提，你怎么认为，众生观如来，是否要从佛的三十二相上来观如来呢？以三十二相观如来？须菩提回答说：是的，是这样，众生就是以佛的三十二相来观如来。如果有三十二相的就是如来，没有三十二相的，就不是如来。</p><p>世尊慈悲，在这里不仅再一次地为众生破相，而且又举示给众生无相的如来，这样众生参禅，就不会再去觅相错会。前文已经说过，真正的如来，法身如来没有任何一个相，三大无量劫修行，修出的三十二相，是报身佛得，应化身佛得，法身佛还是空无一相，不得一法。因为金刚经全文都是讲无相的金刚心如来藏，讲众生未来的法身，世尊自始至终都在开示众生，如何证得无相的法身，所以世尊也就处处讲解无相的法身如来，指引众生悟入诸法实相。</p><p>世尊从开篇伊始，就一直不断地为众生破相，以便众生都能趣向于无一切相的法身如来，与实相心法身如来相应，通过参禅明得自己一丝不挂的主人翁，从而找到回家的路，得个安歇处。世尊故意问须菩提，见真佛，是否从三十二相上来见，须菩提也故意回答说，众生确实都是在三十二相上见如来，于是引起世尊具体讲解，为什么不能在三十二相上见如来，为什么三十二相不是真实的相，不与法身如来相应。</p><p>世尊说：须菩提，如果以三十二相观如来的话，转轮圣王也有三十二相，他也就是如来了。事实上，他是不是如来呢？在这里世尊具体解释说，有三十二相的不是真如来，三十二妙相是通过修福所获得的，转轮圣王福德极大，也有三十二相，却离佛甚远；乃至魔王波旬也能变出三十二相，冒充释迦佛；八地以上的菩萨，也可以变现出三十二相，也可以以佛身度众生。所以众生要想明得真心而成佛，必须要见真佛法身如来，而真如来却没有三十二相，有三十二相的就不是真佛真如来。</p><p>须菩提对世尊说：正如我对世尊您所说法义的理解，众生不应该以三十二相观如来，因为还没有成佛的人，如果修出大福德，也有三十二相，这样就容易错会，以至于认假为真，不得菩提。这时须菩提听佛解说，假装醒悟过来，知道了不应该以三十二观如来，不应以三十二相寻觅如来，其实须菩提对此理早已明了，只是故意引起世尊进一步破相。佛与弟子默契配合作戏，以此来度众生。  </p><p>原文：<strong>尔时。世尊而说偈言。若以色见我。以音声求我。是人行邪道。不能见如来。</strong></p><p>释：世尊听须菩提如此说，就说了一个偈子：如果以色相来见我如来的话，如果以声音来寻求于我如来的话，这个人就是行在邪道上，没有走在正路上，那就不能见到真实的如来。</p><p>这是金刚经里有名的四句偈子，指示我们要证悟法身如来，就要离色声香味触法六尘相，不要以色声香味触法相而见如来，如来没有色声香味触法。那么见如来就不能用眼见和耳闻，眼见的是色相，不是如来；耳听的是声音相，不是如来。这些相都与如来相违背，必须舍弃这些相，排除这些相，才能见到真实的如来。所谓的舍弃和排除，不是说把这些相都消灭掉，而是说要擦亮心眼，不要认这些相为真，并且要在这些假相当中，识得那颗真实而宝贵的明珠——如来藏。这才是走正路，才能见如来，才能成佛道。</p><p>那到底要如何见如来呢？诸位且看我挥手招呼大家：快到经堂诵经来！大家见我挥手时，切莫着我五指山的虚相，切莫着我五蕴之行相，撇开这些五蕴的幻相，在这些幻相里，寻觅那个不是幻，且也没有相的摩尼宝珠。祂定在五蕴山中上上下下、出出进进、来来回回，虽然如此，祂却是如如又不动，并没有上上下下的相，没有出出进进的相，没有来来回回的相，祂不上不下，不出不进，不来不回。祂在五蕴山中忙里忙外，已经无量劫了，没有停息过，却从来不觉忙和累，如来又如去。祂好像来了，也好像去了，其实祂不来也不去，本自如如。那要如何见到如来呢？再看我挥手：来，来，来，诵经来！</p><p>这里没有五蕴相，没有众生相，没有凡夫相，没有菩萨相，没有三十二相，没有色相，没有声音相，没有六尘相，排除这些相，就是如来相。大家睁大眼睛，在这些幻相当中仔细寻找吧！</p></div>"
},{
    "title": "第二十九章　无断无灭分第二十七",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第二十九章　无断无灭分第二十七</strong></p><p>原文：<strong>须菩提。汝若作是念。如来不以具足相故。得阿耨多罗三藐三菩提。须菩提。莫作是念。如来不以具足相故。得阿耨多罗三藐三菩提。</strong></p><p>释：世尊又对须菩提说：须菩提，你如果心里有这样的念想，认为如来不是以具足了所有相好的缘故，而得成阿耨多罗三藐三菩提，那就赶快把这个念头熄灭。须菩提，不要有这样的念头，认为如来不是以具足了无量的相好庄严，而得成了阿耨多罗三藐三菩提。须菩提，如来正是以具足了无量的相好庄严，才得成了阿耨多罗三藐三菩提。</p><p>众生因为智慧浅薄，不能圆融看待和理解一切法，其知见就会偏狭和有缺漏。因此众生一见世尊破了四相，破了色声香味触法相，又破了如来的三十二相，有些人就会认为，如来成就阿耨多罗三藐三菩提，好像可以不具足所有相而就能得成菩提，成就佛道；那些相可有可无，无关紧要，不具足相好也能成佛；不圆满所有的功德，也能成佛；或者认为成佛不是在相上成就，相不重要，可有可无；成佛不需要一切相，不需要五蕴相，不需要三十二相；佛没有五蕴身，只是一个心。这些思想观点，也是谤佛，类似于断灭空的思想，贻害自己和他人，修行就不会有成就。如来必须针对这些邪见，来给与纠正，这样才能护持思想知见不偏不倚，行于正真。</p><p>为什么认为如来不具足所有的相好，就能成就阿耨多罗三藐三菩提，就是断灭空的思想呢？因为有这样的思想观念，就会忽视或者否定了有实相心如来藏的存在和起用，否定了如来藏的功能作用的实有，就是断灭论。每一位菩萨在因地行菩萨道时，所修行的每一个善业，都作为种子存在如来藏里，因缘具足时，就会次第得到大大小小的善业果报，直至成佛，果报也不尽，而且果报越来越殊胜。这些果报就包括了菩萨的色身五蕴相的庄严和相好；包括了菩萨所生存的环境，所居住的佛国土；包括了菩萨座下所有的弟子和亲眷；包括了菩萨的所有三昧和无量神通；最主要的是包括了菩萨的无边智慧和德能；还有菩萨的如来藏里业种的清静和转变。</p><p>那么菩萨成佛时，业种已经彻底转变清静无余，无明断尽无余，因此八识才能转换成四智，当四智圆明时，一切种智就现前。而佛的四智，就是佛的八个识。佛有八个识，就有五蕴，否则八个识就没有依托之处。而佛的五蕴具足三十二相八十种好，是因为佛三大阿僧祇劫对于善法的修行，其善业种子全部都存在如来藏里，缘熟成佛时，种子现前，就感得了五蕴的相貌是极其庄严相好的，圆满具足了三十二相八十种好，无与伦比，殊胜至极。</p><p>如果说佛成佛时，不是以具足的相好庄严而成就阿耨多罗三藐三菩提的，那就有极大的过患。第一，会让众生误认为，佛没有具足无量劫所修行的善业种子。而事实上，佛却在无量劫的修行过程中，圆满修得了所有的善业，种子都收存在佛的如来藏中，成佛时就会感应到最殊胜的相好庄严。</p><p>第二，会让众生误会说，成佛了还没有感应到相好庄严，可能是佛的如来藏没有收存善业种子。而事实是只要有如来藏存在，就会法尔如是地收存善业种子，没有一丝遗漏。</p><p>第三，第三，会让众生误会说，佛和众生都没有如来藏，如来藏只是方便说，因此没有收存佛修行过程当中的所有善业种子，所以佛成佛时，就没有具足相好庄严。基于以上过失，我们应该说，佛是以具足相好故，而成就阿耨多罗三藐三菩提的。</p><p>如果说佛成佛时，没有感应到善业种子的果报，没有善业种子，那就等于说佛根本就没有如来藏。那这就是最根本的、最严重的邪说邪见，是根本的断灭论思想，害人极大，应该赶快灭除这种邪见。应该确信如来藏真实存在，有真实的功能作用，能够收存佛和菩萨无量劫所修行的善业种子，将来成佛时，这些善业种子都会现前，佛就会得到相好庄严的殊胜果报，而成就阿耨多罗三藐三菩提。如果没有如来藏，善业种子就不能被收存，成佛时善业种子也就不能现前，佛就不能具足相好，那就还不是佛，还没有得成阿耨多罗三藐三菩提。</p><p>至此大家应该明白，如果说佛成就佛道时，不是以具足三十二相故，得成阿耨多罗三藐三菩提，那就是否定如来藏实有的断灭论，会有无量的大过失。所以  世尊以劝导须菩提的方式，来间接劝导所有众生，不要有断灭论的思想，不要认为佛得成阿耨多罗三藐三菩提，不是以具足相故得成的。要这样说，佛是以具足相故，得成了阿耨多罗三藐三菩提，这样才符合佛说，契合佛法的精髓，不违背大乘实相法。</p><p>原文：<strong>须菩提。汝若作是念。发阿耨多罗三藐三菩提心者。说诸法断灭。莫作是念。何以故。发阿耨多罗三藐三菩提心者。于法不说断灭相。</strong></p><p>释：世尊对须菩提说：须菩提，你如果心里有这样的想法，认为已经发了阿耨多罗三藐三菩提心的人，说一切法都是断灭空，本无所有，成佛时也没有一切法，不具足一切法相，那就赶快灭除这样的想法，不要有这样的思想观念。为什么不应该有这样的思想观念呢？因为发了阿耨多罗三藐三菩提心的人，是因信受有不断灭的实相心，才能发起成佛之心的，他就不会再说一切法都是断灭的了。</p><p>真正发心想成佛的人，这时信位菩萨的条件已经满足了，他就会对每个众生都有不生不灭的真实心如来藏，已经确信不疑了；他相信十方诸佛都有真实心如来藏，并且依此如来藏修行，才能成就阿耨多罗三藐三菩提。他相信自己也有真实心如来藏的存在，将来也能证悟如来藏，并且与诸佛一样能够成佛，十方世界的众生也因为有不生不灭的金刚心如来藏，因此也都能成佛。因为他生起这样的信心，十信位就满足了，就进入十住位开始修行六度菩萨行。如果不相信自身有如来藏，不相信如来藏是真实存在的，那么他对佛、对法、对三宝的信心还没有满足，十信位的修行还不具足，他就不能真正地发起成佛的道心。</p><p>十信位没有满足的人，还不能相信如来藏是真实存在的，他们往往认为如来藏只是一个假名词，一个概念而已。他们认为如来藏的空，就等于如来藏不存在，如来藏这个概念是诸佛方便假说。因为他们不能正确理解佛所说义，就把佛所说的究竟了义法，都误解为是佛的方便说、方便法。他们只是没有公开说是佛逗众生玩儿而已，这话一般人也不敢公开说，但实质就是这个意思。这个想法就是谤佛、谤法，把佛的所有了义究竟说法，当作是佛的不了义，不究竟之法，严重曲解了佛之真实义。众生谤佛谤法的恶业普遍存在，并不奇怪，都是因为众生历劫修行时间太短，福德不足所致。</p><p>只要否定了如来藏的真实存在，是真实有，那就是断灭空言论，危害极大。因为没有如来藏，一切法都无从生起，都会断灭，一了百了。持断灭论的人，往往会说，一切法缘起性空，都是因缘所生，都是空的，没有一样是真实的。那么既然都是空，没有真实的如来藏法存在，那么一切法又是从何而有呢？不能说，空的一无所有的法，能够出生另一个空的一无所有的法，没有这样的道理。就像乌龟的毛，是空无之法，它不能生兔子的角这样的空无之法，都没有实体故。只有有实体、有自性的法，才能出生无实体无自性的法。无实体无自性的法，不能出生其它法，这是法尔如是的道理，没有什么好解释的。</p><p>如果说一切法都是缘起性空的，没有如来藏实体法的存在，那么众生的五阴世间就会灭去，不再生起，也就不会有后世的出生，那就更不能修行成佛了。退一万步来说，即使有后世五阴的出生，因为没有如来藏来存储众生的业种，众生所修行的善业就会唐捐其功，种子不能集藏起来。善业种子不能集藏起来，修行就没有用，不会产生后世善业的果报，更不能感得成佛时的更圆满的善业果报，不会有佛的三十二相、八十种好，不会有佛的种种殊胜功德和利用，不会有佛的十方诸佛国土，不会有佛的庄严报身，不会有佛的无量应化身，不会有佛的无量神通道力，也没有转识成智之说，那就更不会有佛的一切种智。</p><p>为什么说没有实体如来藏的存在，就不能转识成智呢？因为七识一世的修行，心行由染污转变清净，清净的业种如果不能收存，来世就仍然是染污的，那就白白修行，没有真实的受用，七识的染污性没有发生转变。那么到佛地时，也仍然是染污的七识，七识业种没有转变，心行没有清净，那就不能成佛。因此没有实体如来藏的真实存在，起其相应的功德作用，众生就不能成就阿耨多罗三藐三菩提。因此，真正发阿耨多罗三藐三菩提的人，于法不说断灭相，不说如来藏只是一个假设的虚相法，没有如来藏心体的真实存在。</p></div>"
},{
    "title": "第三十章　不受不贪分第二十八",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三十章　不受不贪分第二十八</strong></p><p>原文：<strong>须菩提。若菩萨以满恒河沙等世界七宝。持用布施。若复有人知一切法无我。得成于忍。此菩萨胜前菩萨所得功德。何以故。须菩提。以诸菩萨不受福德故。须菩提白佛言。世尊。云何菩萨不受福德。须菩提。菩萨所作福德。不应贪著。是故说不受福德。</strong></p><p>释：这一品，世尊通过讲述菩萨布施七宝所得的福德，来深细描述实相心如来藏的体性。如来藏对于五阴修布施度所得的福德，根本就是舍受，祂并不享受一点点一丝毫，也不在意福不福，祸不祸，也不知道有福与祸。又因为如来藏没有贪心所，不会贪着福德以及其他一切法，祂对一切法都是无欲无求，不喜不厌。菩萨悟后依止于如来藏这种体性，对于福德以及一切法，也都不会生起贪求心行，不喜也不厌，保持中道的舍受，这才是真正的菩萨心行。</p><p>原文：<strong>须菩提。若菩萨以满恒河沙等世界七宝持用布施。若复有人知一切法无我。得成于忍。此菩萨胜前菩萨所得功德。</strong></p><p>释：世尊对须菩提说：如果有一个菩萨，用遍满像恒河沙一样多的世界的七宝来作布施，如果又有一个菩萨，了知到世出世间一切法当中，都没有一个我，因此修成了无生忍和无生法忍，那么得忍智的菩萨所得的功德，要远远地殊胜于布施七宝的菩萨所得的功德。</p><p>菩萨布施七宝所得的福德， 世尊已经说过很多次了，其福德是无量无边，不可胜数。菩萨布施，不仅有福德，其中也能生出功德。因为福德增长了，心地就能得以清净，心性得以调柔，禅定就能得到增进，智慧就能得以增长，道业就会得到增进，自身就会得到真实的功德受用，这是菩萨财布施所得的果报。而另一位菩萨，已经修到了得忍的程度，内心深深地觉知到一切法都是无我的，因此证成了无生法忍智。</p><p>忍一切法当中都是无我，这是哪种程度的忍呢？忍，有小乘断我见所证得的五阴无我的无生忍，有大乘法的无生忍和无生法忍。小乘的无生忍，分为四向四果。其中初果向的忍，虽然不是真正断我见的忍，但是在意识上，也忍可了五阴的虚妄不实，也在努力精进地观行，趣向于真正的断除我见。此时就差意根对于五阴无我之理的认可，这就需要意识不断地思惟观行，把五阴无我的道理传递给意根，让意根明了。意根一旦明了，就是真正的断我见，这时就成为初果人。</p><p>成为初果人以后，对于五阴无我之理，还要进行深细的观行，这个过程是意识获得更深的无生忍智的过程，是逐渐获得定力断除烦恼的过程，更是意根慢慢断除对于自我五阴执著的过程。在这个过程里，意识和意根都需要不断地忍，更深层次的忍，直到意根彻底断除人我执为止，这是小乘人获得的无生忍。</p><p>大乘的无生忍，是菩萨们证得第八识以后所获得的，菩萨不仅要忍于五阴无我之理，更要忍于第八识如来藏的不生不灭之理，要深忍于第八识的无生；忍于第八识的空和有两种体性；忍于第八识的不垢不净体性；忍于第八识的所有中道体性；忍于第八识的所有方方面面的体性。然后菩萨的心就会越来越清净，定力越来越增强，烦恼越来越轻微，智慧就会越来越深细。其自心的功德受用就会越来越广大，菩萨的果位就会由七住位，逐渐增进到十行位、十回向位，由破初关，到重关，再到牢关，定慧都会更加深细。</p><p>然而，这也只是五阴人无我范围内的忍，范围还不够广大，忍度还不够深邃。必须达到初地菩萨以上的无生法忍，其忍的范围才是更广大，其忍智才是更深广。地上菩萨的无生法忍，是忍一切法当中都无我，这不仅是证得了人无我，同时也证得了法无我，其法无我慧、无生法忍智地地增上，越来越深妙。</p><p>因为地上菩萨能够现观如来藏在五蕴中的运作，能够现观如来藏在十八界万法上的运作，因而深知如来藏是如何出生五蕴，如何出生十八界万法的。菩萨会在一切法上，观察如来藏的运作行相，知道每一个法，都是如来藏运用心所法输出种子而生成的。没有一个法能够离开如来藏，而能有自身的生住异灭，都是因为有如来藏，才能生出一切法相，才能使得一切法相暂留一段时间，才能使得一切法相渐渐地变异，才能使得一切法相散坏消失。离开如来藏，就没有一个法相能出生，能停留，能变异，能灭去，因而一切法相本身就是虚妄不实的，如梦幻泡影，如空中花，了不可得，其本质都是如来藏。一切法既然都不真实，没有自体性，都是如来藏性，当然就是无我的。</p><p>其中一切法包括世出世间所有一切法，只要是如来藏变现出来的，后天出生的，三界世间当中存在的，包括过去世的一切法、未来世的一切法以及现在世的一切法，包括十方世界的一切法，这些都是无我的。具体来说，一切法包括色法和心法，色法包括宇宙器世间，包括众生所需要的生存环境，主要包括了众生的五阴色身，也就是五根、五尘和法处所摄色。</p><p>心法包括七识心和七识的心所法。总括起来说，就是众生的六根、六尘、六识这些十八界法、十二处法、五阴法。这些法，都在一真法界如来藏里存在、生灭、变化、起用，都是真心如来藏所出生、所变现、所执持。因为都是如来藏所出生和变现的，那就是有生有灭的法，就是不自在、不自主的法，就是不能自己做主宰的法，就是无我性的法。而有我性的法，是不会生灭变异的，是能够自我做主宰的，是能够自我独立存在的，是不需要他缘，就能永远长存的，是圆满具足一切功德利用的。</p><p>无我的法，就不具备这些性质，无我法不能自己独立存在，需要依赖一些外缘才能存在和起用，也需要如来藏不断地输送种子来维持其存在和运行，否则就会灭去。所以三界世间所有的一切法，都是生灭变异的，都是无我的。而出世间的如来藏法，虽然有一部分的我性，能够自己独立存在，不需要外缘，不用出生和灭亡，能够自在，能够自主。但是里面还含藏着七识的染污业种，这些业种是要生灭变异的，会拖累如来藏也发生转变，使得如来藏的功德利用也受到一些影响。</p><p>因为这时的如来藏里的种子是要受七识的熏染的，既然里面的种子能受熏染，如来藏整体就不是不变异的，那就不是完全有我性的。从另一方面来说，如来藏本身也有自身的识种子流注，这些识种子刹那生灭变异，才能维持如来藏的存在和运转，因此如来藏也不是完全有我性的，还是无我性的。</p><p>只有佛地的法身无垢识，才是完全有我性的，那时七识的业种生灭变异就结束了，无垢识不再受熏染，不再变异，没有生灭的种子了；自心的识种子流注也停止，没有刹那生灭的现象存在。因此佛地的无垢识就是完全彻底的我性，完全是我，其功德利用能够完全得到发挥，不再受到七识染污业种的局碍和限制，心所法由原来的五个变为二十一个，因此是完全彻底究竟的我性。</p><p>菩萨因为证得了一切法无我，能够忍于一切法当中都无我，获得了甚深的无生法忍智慧，其功德受用是极多极大极深的，算数譬喻所不能及。菩萨会以此甚深的唯识种智，渐渐进入佛地，福慧都圆满具足，成为三界世间所尊，人天大众之师，具足十个名号的功德利益。能够在十方世界建立诸国土，示现成佛，广度无量众生。因此菩萨证得一切法无我，其无生法忍智的功德受用，要远远超胜于菩萨布施七宝的功德和福德，其中的差异不可比拟，无以言说。</p><p>原文：<strong>何以故。须菩提。以诸菩萨不受福德故。须菩提白佛言。世尊。云何菩萨不受福德。须菩提。菩萨所作福德。不应贪著。是故说不受福德。</strong></p><p>释：世尊又开示说：为什么是这样呢？须菩提，是因为诸菩萨们都不受福德的缘故。须菩提对世尊说：世尊，为什么菩萨们都不受福德呢？世尊回答说：菩萨们所做的一切福德，都不应该贪著，因此才说菩萨不受福德。</p><p>这里的菩萨，世尊暗指实际理地的真正的菩萨，那个真正的菩萨，不受一切受，对于一切法，都是舍受。这位真正的菩萨圆满具足一切法，对于一切法都不贪求，因为没有贪求，所以才无所得。菩萨的五蕴布施世界七宝的时候，其感得的福德果报是菩萨的五蕴七识得，七识来受用，真正的菩萨——如来藏并不得一分一毫，也不受用一分一毫。而菩萨的五蕴在行布施度的时候，七识也要依止于如来藏，不贪求于福德。</p><p>菩萨在布施时，其心观行布施度三轮体空。所谓三轮体空，就是没有真正布施的人——我，没有接受布施的人——他，中间没有布施的物——七宝。为什么没有布施的人呢？因为布施的人——五蕴，是如来藏所变生的，色身是如来藏四大种子刹那输出形成的，就相当于如来藏这块黄金，有一部分打造成了金戒指色身；七识是如来藏刹那输出的识种子形成的，那就相当于如来藏这块黄金，有一部分打造成了金项链七识，色身和七识合一起组成了五蕴，五蕴整体金制品就是黄金如来藏。</p><p>那么从这里我们就能看出，到底有没有五蕴呢？五蕴是个什么东西呢？五蕴全体当然就是如来藏，无有其余。所以菩萨布施时，没有布施的菩萨五蕴——我，同理，也没有被布施的五蕴——他。那么中间所布施的七宝呢？七宝也是四大构成的物质色法，是如来藏刹那输出四大种子形成，是如来藏这块黄金，有一部分打造成了金耳环等等这些七宝物，那么七宝物到底是什么呢？七宝物就是黄金如来藏，那就没有真实的七宝，都是如来藏。而如来藏之体，也是性空，无有一个实质的相存在，空无一相。所以整个布施度，就是三轮体空，了不可得，菩萨根本就不必执著。</p><p>同理，菩萨所得的福德，也是空。首先菩萨的布施行，会作为业种存在如来藏里，缘熟时，如来藏再输出业种，实现菩萨的福德。其福德实现的形式，会以物质色法和七识心所法的形式来实现。物质色法无非是以金钱、财产、权势、地位、家眷等等形式体现出来；而这些色法，都是如来藏输出四大种子形成的，本质都是如来藏，没有真实的物质色法，物质色法与如来藏不一不异。那就没有真实的福报可得，都是如来藏自心取自心，非幻成幻法。</p><p>在享受这些物质色法的福报时，是七识的觉知心来受用，是七识的受心所来领受、感受、享受，受心所会觉得舒适、快乐、自豪、自傲、自喜。而受心所法是随顺七识而有，是七识的助伴，七识一出现，与六尘对境，就有受心所的运作。七识是如来藏输出识种子形成的，本是如来藏，与如来藏不一不异。七识心体了不可得，那么七识的觉受，也了不可得。所以菩萨的福德实现时，福德以及对福德的享受，都没有实质，本质都是如来藏。</p><p>菩萨们证得此种智慧境界，也就会对福德不再贪求，不会再有心去享受福德。并且把修得的福德都回向于阿耨多罗三藐三菩提，菩萨的修行就是为了早日成就佛道，不会为了世俗法的福德享受，而行布施度。这样菩萨的修行，才能达到内心空净，一法不着，心空及第归，就会证得无上的佛果，圆满菩提大道。</p></div>"
},{
    "title": "第三十一章　威仪寂净分第二十九",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三十一章　威仪寂净分第二十九</strong></p><p>原文：<strong>须菩提。若有人言。如来若来若去。若坐若卧。是人不解我所说义。何以故。如来者。无所从来。亦无所去。故名如来。</strong></p><p>释：所谓的威仪，是指众生在日常生活当中的行来去止，迎来送往等等身口意行，有修行的人，身口意行都要端严而有理法，符合一定的规范。出家人有出家人的威仪，在家人有在家人的威仪，身份不同，威仪也不同，每个众生的威仪都要符合自己的身份。这一品，开示佛的威仪，佛的威仪与众生有同，又有不同，毕竟佛已经修行了三大无量数劫，身口意行都已经清净至极，完美无瑕，无一丝纰漏和瑕疵，堪为人天典范。</p><p>这一品的标题，叫作威仪寂净分，仅仅四五个字，就把金刚经的主题和中心点，全部揭示出来，可谓是画龙点睛之笔。与金刚经开头世尊着衣、吃饭、乞食、洗足的威仪密意，遥相呼应，有理有事，理事双全，指示予众生身中那个金刚不坏之心，从而佛法精髓彰示无遗，度化众生个个进入大乘实相般若第一义谛之中，开启众生无量的智慧宝藏。</p><p>那么威仪寂净到底有何密意呢？佛的八万威仪，三千细行，着衣乞食，吃饭洗足，讲经说法，度化众生，这些身口意行，明明都是动，都是佛的行蕴所摄，本是动荡不止、生灭变异之法，为什么还说是寂净呢？这里就给大家留个悬念，自己去发心探得其中的天机，我在此不能说破。</p><p>这个悬念，就作为参禅的疑情，深深地悬在脑海里，朝也提斯，晚也提斯，吃饭也提斯，洗足也提斯，行走坐卧都要提斯。提斯来，提斯去，有那么一天，噗通那么一下，心里豁然大亮，开了天窗，疑情打破，归家稳坐。从此每日里悠悠然地享受自家宝物，衣来伸手，饭来张口，再不向外征讨，不再掠夺非己之物，太平盛世从此降临，最终登上转轮宝座，天下唯我独尊。善哉！善哉！何乐不为！</p><p>原文：<strong>须菩提。若有人言。如来若来若去。若坐若卧。是人不解我所说义。何以故。如来者。无所从来。亦无所去。故名如来。</strong></p><p>释：世尊说：须菩提，如果有人说，如来这样来，如来这样去，如来这样坐，如来这样卧，在这些表相上见行来去止的如来，这个人就没有真正理解，我这么长时间以来所开示的佛法大义，因而迷于如来表相，不见真如来。我为什么这样说呢？因为真正的如来，是没有任何处所从其而来，没有来处，也没有任何处所至其而去，没有去处。不来不去、不生不灭者，是名真如来。</p><p>世尊是多么地慈悲，为了众生，着弊腻垢衣，屈尊来此浊恶世间，开示众生，佛之知见，讲经说法，不知疲累。世尊在此，一再地画龙点睛，不惜口沫，眉毛已经拖地很长很长了，袈裟角在泥水里都已经侵湿了，就为了把众生拖出邪见泥沼，悟入佛之知见，然后与佛同见同行，再也不行旷野小路，和荒郊野岭，险恶之处。</p><p>众生着相的习气早已彻入骨髓，邪见的毒刺实在难拔，无奈只有劳祂世尊不断地破相又破相，种种譬喻言辞，开示于众生无有一丝相状的实相之心。但还是有极多之人，不见真实的无相如来，只见来来往往、行来去止的有相如来。然而有相的如来，其来去相、坐卧相，会不会消失灭去不见呢？来去相、坐卧相消失以后，又到哪里见如来呢？其来去相、坐卧相，又是从哪里来，灭到哪里去呢？又为什么有来有去、有坐有卧呢？有心之人，在这里要大大地划个问号，深深地疑着，不要放过。</p><p>如来的来相，依五蕴色身而现相，依五蕴七识心而显现，本为五蕴中的行蕴，若无五蕴七识，也没有来相让众生睹见。而这个来相，在来之前，又在何处呢？因什么而来呢？因为这个来相是生灭法，生灭法都是因缘所生，来相有各种缘的聚集，而由因而出生，有因有缘，来相现前。众生睹见，就会只见来相，不知来相从何而来，不知来相之因，此为迷人着相，不识真理。众生因于着相迷理，合尘背觉，故发尘劳，世间相不断，生死不绝。要想出离生死相，该怎么办呢？当然要觅起相之因，识真如之理，剔除惑业，回归本来。</p><p>如来的去相，依五蕴而现相，依七识而显现，本为五蕴中的行蕴，五蕴七识依因什么而显现呢？去之前，有来有住，来、住之前有因，去时也不离因而去，否则就不能去。去之后呢，其相荡然无存，而去的因不灭，因此而能不断地去，再不断地来，生住异灭，因此循环不已，此为生机盎然，生缘处处，恰似一个大好的春天。如来的坐相和卧相呢，也本为五蕴当中的行蕴，依色身和七识而现相，色身和七识也有其现相的因。以此因，相生相灭，众生只见相以及相的生灭，从来不见相生灭之起因，迷于表相，不识真理。因此而生生不已，死死不断，辗转流浪，迷途不返。</p><p>众生积迷难返，无奈，劳世尊祂老人家八千余次，来此娑婆，一手指天，一手指地，开示众生：天上天下，唯我独尊！大显如来智慧德相，为众生解黏去缚，洗去尘劳恼垢。若非大慈之父，孰能若此！我等若是如来孝顺之子，在世尊手指天地之时，就要偏袒右肩，右膝着地，双手合十，口呼我佛，如来至尊，我今得见，真实如来。从此渐能绍继佛业，替佛宣化，接引众生，去迷显智，入佛知见。若能多此，孝顺之子，我佛事业，后继有人，佛法光大，慈航普渡，普天同庆，十方同入，萨婆若海。</p><p>那么众生要如何识得真理呢？世尊又接着开示：如来者，无所从来，也无所去，故名如来。无所从来，就是没有一个处所，是如来可来之处，那么就没有来处。虽然没有一个来处，可是如来却毕竟在时时处处出现，虽无身而不隐。那么没有来处的如来，即为不生，本来就在，不依他缘，自在自主，此如来者，为真如来也。也无所去，所，是处所，没有一个处所可去，就是不灭，不灭即时时处处存在，时时处处显现，时时处处起用，此如来者，即为真如来也。真如来者，没有来去相而来来去去，虽来来去去而湛然不动，威威堂堂，如如而来，如如而去，不来不去，不生不灭。</p><p>为了让众生识得真如来，世尊与文殊共同演戏示现予比丘真实如来义。有一次，比丘们在讲堂中都坐好以后，世尊推开讲堂门，五蕴的三十二相就赫然地显现在大众面前。世尊于是就迈着鹅王脚步，徐徐地走到法座前，慢慢地盘腿坐下。等世尊盘腿坐好之后，文殊菩萨手拿附尺，在讲桌上一拍，宣布说：世尊讲经毕！比丘们正准备聆听世尊布法，忽然听文殊菩萨如此宣布，个个都傻愣愣地，不知是何道理。而世尊也不管比丘们如何发愣，就慢慢地从法座上站立起来，徐徐地径直走向门口，然后推开门，走了出去，五蕴的三十二相就此消失不见。</p><p>诸位，应身佛的如来相，大家已经见到了，三十二相，八十种好，威威堂堂，巍巍煌煌，好不庄严。可是这些相，在娑婆世界，毕竟仅停留了八十年载，就不见了，这肯定不是真如来了。那么真如来在哪里呢？是哪个呢？其实法身如来，从来就没有离开过应身如来，从世尊推门而入的一刹那开始，到世尊推门而出的整个过程里，法身如来就一直以祂无面目的面目而显现着，眼尖之人，直下便见，慧眼识得五蕴背后的那个祂。如此识得，多么地畅快！多么地轻松！各位把世尊的五蕴假相抛开，试试见那个抛不开的，离不掉的，从来不生灭的，不来不去的，那个法身真如来。好马见鞭影而行，智人见五蕴影子，就能识得真人。真人在哪里呢？咄！就在这里。</p></div>"
},{
    "title": "第三十二章　一合理相分第三十",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三十二章　一合理相分第三十</strong></p><p>原文：<strong>须菩提。若善男子。善女人。以三千大千世界碎为微尘。于意云何。是微尘众宁为多不。须菩提言。甚多。世尊。何以故。若是微尘众实有者。佛即不说是微尘众。所以者何。佛说。微尘众。即非微尘众。是名微尘众。世尊。如来所说三千大千世界。即非世界。是名世界。何以故。若世界实有者。即是一合相。如来说。一合相。即非一合相。是名一合相。须菩提。一合相者。即是不可说。但凡夫之人贪著其事。</strong></p><p>释：金刚经这一品主要介绍一合相，佛说一合相是非相，非相就是虚妄相，是一个假名，是一个假相。什么叫一合相呢？这篇主要就是介绍我们所生活的三千大千世界，它就是一合相。这个一合相，非真实存在，是各种相组合起来的假相。一个三千大千世界，是由什么组合起来的呢？一个三千大千世界是由一千个中千世界组合起来的；一个中千世界是由一千个小千世界组合起来的；一个小千世界是由一千个单位的小世界组合起来的。一个小世界是由四大海水，再加上四大洲，再加须弥山，再加日月天，再加欲界六层天，再加色界的初禅天，这就组成了一个小世界。一千个小世界再加二禅天，就组成了一个小千世界；一千个小千世界，再加三禅天，就组成了一中千世界；一个中千世界再加四禅天和四空天，就组成了一个三千大千世界。</p><p>所以说这三千大千世界，就是一合相，一合相就是组合起来的虚妄相。它是由个个分相、零散的相组合到一起，形成一个总体的相，这叫一合相。那一个单位的小世界呢，也是组合起来的，它包括四大海水，四大海水下面有七金山，七金山下边有地狱；四大海水上边，就是四大部洲，分别为东胜神洲、西牛贺洲、南赡部洲、北俱芦洲；四大部洲在四大海水的上边，在须弥山脚下的四方。</p><p>须弥山在四大海水当中，伸到四大海水水底一半，伸出四大海水上边又一半，呈立体圆锥形，须弥山中间是四天王天，四天王所居住的北天王天、南天王天、东天王天、西天王，四天王天就在须弥山半山腰四边。须弥山顶上是忉利天，释提桓因所住的三十三天就在那里面。再往上是欲界其它的四层天，欲界四层天上边还有色界初禅天，这加一起就形成了一个单位的小世界。</p><p>一个单位的小世界，其中每一个组成成份，还是个组合相，比如说我们的地球，地球是由山河大地，以及树木、花草、房屋之类组合起来的；也是由各个国土，每一个国家的国土所组合起来的。其中一个国家，它也是一合相，也是组合起来的，它也是由山川、树木、房屋、土地等这些相组合起来的。再加一个国家由各个省份，各个州县所组合起来的，每个省份，每个州县，也是组合起来的，到具体的每一户人家，每一家住户，它也是组合起来的，以至于每一家里的所有物品，也是组合起来的，物质还能细分，最后就能分成微尘颗粒。</p><p>所以说这三千大千世界，整体来说就是组合起来的，每个组成部分的最微小的部份，也是组合起来的，都是一合相。小世界是一合相，到中世界也是一合相，到大世界更是一合相，这整个的三千大千世界，都是一合相，全部是组合起来的。既然是组合起来的，这个世界就不是真实的，只是一个假名词，一个概念罢了。所有的一切色相都是由如来藏输送四大种子，形成了最微小的微尘颗粒，微尘颗粒再聚集起来，形成各种物质，物质聚集起来，形成更大的物质分部，这些分部再组合起来，就形成一个一个的小世界，一个一个的山河、大地、宫殿等等，这些都是组合相。只要是组合相，就是非相，就是虚妄的，不是真实的相。</p><p>原文：<strong>须菩提。若善男子。善女人。以三千大千世界碎为微尘。于意云何。是微尘众宁为多不。甚多。世尊。何以故。若是微尘众实有者。佛即不说是微尘众。</strong></p><p>释：世尊对须菩提说：如果善男子善女人，把这个三千大千世界粉碎了，粉碎成了微尘，你该怎么认为呢？这些微尘的数量是不是很多呢？须菩提回答说：非常的多，世尊。为什么微尘数是非常多呢？因为如果这些微尘是真实存在的，是实有的，佛就不说这些是微尘了。</p><p>三千大千世界有多大呢？算起来好像包括有十亿百亿个地球，十亿百亿个须弥山，十亿百亿个忉利天，十亿百亿个欲界天，十亿百亿个初禅天，十亿百亿个四大海，十亿百亿个七金山，全都是十亿百亿之多，非常庞大。一个三千大千世界可是无边无际的广大，无量的广大，如果碎为微尘，这些微尘的数量该有多少？那简直没法计算了，因为三千大千世界就很庞大了，庞大的实体再把它分零碎了，中间加上空隙，所形成的这些微尘比三千大千世界所占的面积体积还要大，所以说把三千大千世界碎成微尘了，那些微尘的数量就不用再数了，根本就数不过来。</p><p>佛说一个善男子、善女人，把一个三千大千世界碎为微尘，你的意见如何呢？这些微尘的数量，是不是很多呢？须菩提说简直是太多了，那就不用数了，怎么数也数不过来。即使把我们一个人的身体碎为微尘，这些微尘的数量就没法数了，把一个小动物的身体碎为微尘，这个微尘的数量也是没法数。什么叫作微尘呢，就是把一个物体给它分散开，分成最微细最微细，小到肉眼看不到的程度，最后成为最小单位的颗粒，这就是所谓的微尘了。其时那时候还是四大物体组成的小颗粒，非常微小，非常微小的小颗粒，几乎接近于空无了，但是还是有物质色法的。这些小微粒也是由如来藏所生出来的，地水火风四大种子形成的，非常微小，非常微小，几乎没有，但是还是有，还是有四大组成的微尘物质。</p><p>这么多数量的微尘物质，是不是太多了？须菩提说，太多了，为什么这么多呢？为什么叫作多呢？佛说：若是微尘众实有者，佛则不说是微尘众。须菩提因为听世尊讲这部金刚经，早已了解世尊所讲法义的真实内涵，于是他就说：这些微尘众，如果是真正实有的，是不生不灭的，真实存在的微尘数量的话，那么佛就不会把它叫做微尘众了（众是代表多，数量极多的意思）。</p><p>原文：<strong>所以者何。佛说微尘众。即非微尘众。是名微尘众。世尊。如来所说三千大千世界。即非世界。是名世界。</strong></p><p>释：须菩提说：为什么佛说微尘众，都只是名字叫作微尘众呢？因为佛所说的微尘众，即非微尘众，是名微尘众，这些微尘众都是假名，不是实有的，佛才取一个假名字，叫微尘众。世尊，如来所说的三千大千世界，不是真正实有的三千大千世界，只是给它取个假名字，叫作三千大千世界。</p><p>这些微尘众，都不是一个真实相，每一个微尘也都不是真实相，微尘的组成，微尘的数量，也不是真实的相。所谓的微尘，只是把物质色法细分成一个个的微尘，这些个微尘是不是有真实的相呢？我们知道，物质是由地水火风四大种子组合而成的，如果把这个物质给它细分了，分成最小最小单位的物质，名叫微尘，但是这个微尘还是物质的，仍然是色法，是由地水火风四大种子组合而成。</p><p>只不过大的物质由地水火风四大种子组合而成，四大种子的数量非常多罢了，再把这个大的物质细分，分成小物质，每一个小物质还是由原来那么多比例的地水火风四大组成，只不过是四大种子的数量减少了。种子的数量减少了，物质的体积与面积也就减少了，减少到最微小的程度，它就叫微尘。不管你把物质分得多么的小，肉眼看得见或者是看不见，它都是由地水火风四大种子组合而成的。微小物质，微粒物质，最小最小的微粒，它也还是由地水火风四大种子组合而成。</p><p>而这些地水火风四大种子是由如来藏刹那刹那输送出来的，刹那输送出来，才能维持这些微尘微粒的生、住、异、灭，让这个微粒、微尘停留着，在起着作用。如果如来藏不输送四大种子，那么这些微尘就消灭不存在了。消失了以后，就连一丁点的物质实法都没有了，就变成空无了。既然这个微尘不是空无，就是由地水火风四大种子形成的，如来藏刹那刹那在输出，输出以后，形成了微尘的生、住、异、灭，生灭生灭生灭，组成了这个微尘的这个物质暂时的不生灭现象的存在。</p><p>所以佛说这些微尘众，即非微尘众。非，就不是实相，不是实有的，不是真实的，就给它起个假名，叫微尘众。如果是实有的，佛说，就不名为微尘众了，那么微尘众不仅有名字，还有实体存在，有实体存在，就是不生不灭的，与第八识等同。实际情况是，微尘众确实是生灭的，由四大种子构成的都是生灭法。所以给这些生灭法，起个名字叫微尘众，微尘众就是一个假名词。</p><p>微尘众的相是根据四大种子组成的微粒、颗粒的相，给它取个假名，叫作微尘众。既然这些微尘都是四大假合的物质颗粒，这些物质颗粒再组合成比微尘更大一些的物质，更大一些的物质也仍然是地水火风所形成的，也是如来藏刹那刹那输送四大种子，所维持、所执持而能存在的，所以它也不是真实的相，都是虚妄的，有生灭变异的。</p><p>因缘散去的时候，如来藏不输送四大种子了，这个微尘形成的物质颗粒，组合成的物质，它就灭去，不再存在，就消失了。再由这些物质，组成更大一些的物质，不管多大的物质，都是由地水火风四大种子形成，如来藏输送种子，刹那刹那的在维持着这些物质色法的存在。这些物质色法再组合，就组合成一个星体，多个星体再组合，形成一个小世界，小世界再组合，就形成一个小千世界，小千世界再组合，形成一个中千世界。</p><p>中千世界再组合，就形成一个大千世界，物质颗粒，微尘颗粒都是虚妄的，不是实有的。那么组成的三千大千世界呢，它同样也是虚妄的，不是实有的。都是共业众生，他们的如来藏，共同输送四大种子所组成的物质世界，这些都不是真实的相，实质上都是如来藏所幻化出来的，都是假相，本质就是如来藏性。所以佛说整个三千大千世界，都是虚幻的、空无的，都是如来藏性。</p><p>如来所说三千大千世界，既非世界，是名世界。既然这三千大千世界是由物质颗粒、微尘所组成，是四大假合，刹那刹那生灭变化，生灭变异，那么这个三千大千世界，就不是实有的世界，就是虚妄的世界，不是真实的，这个三千大千世界，就只是一个假相罢了。那么我们根据这个假相，给这个三千大千世界取一个假名，叫作三千大千世界。所以说三千大千世界，也就是一个假名词，它的相是虚妄相，是如来藏所执持、所变现出来的一个虚妄假相，本质上都是如来藏。所以三千大千世界，既非世界，不是真正的世界，那只是一个名字而已。</p><p>原文：<strong>何以故。若世界实有者。即是一合相。如来说一合相。即非一合相。是名一合相。须菩提。一合相者。即是不可说。但凡夫之人贪著其事。</strong></p><p>释：世尊说：为什么这样说呢？因为如果世界确实是真实有的话，那么这个世界也就是一合相，如来所说的一合相，它就不是真实的相，并没有真实的一合相，只是名字叫作一合相罢了。这个世界如果它是真实存在着的话，那也最终是由无数又无数个微尘颗粒所组成的一合相，如来说这个一合相不是真实存在的一合相，也没有真正有一个叫作一合相的东西，都是虚幻的，本质都是如来藏性，所以把一合相，也取一个假名字，也叫一合相。须菩提，一合相者，就是不可说，也没法说的，但是凡夫们都在贪着这些相。</p><p>佛说由物质颗粒、微粒、微尘所形成的一合相，这个一合相就没有什么好说的。因为都是四大假合之体，没有实有相，不是真实的，都是如来藏所幻化出来的。都是如来藏相，其本质也都是如来藏。既然如此，就没有一合相可说，那么一合相也就不可说，也不用去执着。因为它不是真实的，所有的相都是生灭虚幻的。但是对于这些生灭虚幻的假相，凡夫之人，无始劫以来，一直都在贪着这些虚幻的假相，认为都是实有不虚的，凡夫一贯地贪着六尘境界，而六尘境界也是由物质、四大微粒所组合成的假相，并非实有，没有真实的相。只是一个名字，凡夫不知，往往都贪着这些名字假相。</p><p>凡夫们无始劫以来，一直贪着自己所生存的国土世间和生活环境，其实这些也都是由物质微粒所形成的，这些都只是一合相，都是虚幻、生灭、变异的，都是如来藏输送四大种子，刹那刹那的输出而形成、维持、执持着的，没有如来藏，就没有这些一合相。其实都是如来藏相，这些相并非实有，都是一种假合幻化相，就像梦幻和空幻出来的一样，就像梦里的相，空中的花一样，并非真实。但是凡夫不知道此点，不知道这个事实，就把所有接触到的一切相，全部当作真实。然后贪着、执着、计较，因为贪着、执着、计较，就被这些假相所系缚，被系缚在六道生死轮回中，不得解脱。</p><p>所以佛说，凡夫之人（即是愚痴之人），不知诸法实相，只是一味的贪着虚幻的妄相，只有众生学得了真正的大乘实相之法，知道整个一个世界，我们所赖以生存的环境，我们所接触的人事物理，都是如来藏输送种子，所形成的虚幻之相，本质都是如来藏相，并非实有。证得这个事实真相，众生的贪着性，才能减轻，才能灭除，那么生死的因，也就灭除了，众生就可以从生死轮回中出离出来了。</p></div>"
},{
    "title": "第三十三章　知见不生分第三十一",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三十三章　知见不生分第三十一</strong></p><p>原文：<strong>须菩提。若人言。佛说我见人见众生见寿者见。须菩提。于意云何。是人解我所说义不。不也。世尊。是人不解如来所说义。</strong></p><p>释：世尊开示说：须菩提，如果有人说，佛也说有我见、人见、众生见和寿者见，那么我见人见众生见寿者见，就是真实有的。须菩提，你意下如何呢？这个人懂得我所说的法义吗？须菩提回答说：这个人并不真正明了世尊您所说的真实义。</p><p>世尊在讲经说法时，必须随顺众生的心理认知，使用众生所用的名词概念，这样讲法才能与众生沟通，众生才能听得懂，从而佛才能引导众生，过渡到佛法的真实义当中，最后达到与佛相同的境界。因为众生有个五阴我的知见，也有人的概念和知见，有众生的概念和知见，有寿者的概念和知见。而且众生对于这些概念的认知和理念都是错误和颠倒的，那么世尊就必须随顺于众生心里的概念，使用与众生相同的名词概念，来破除众生错误的认知，颠倒众生错误的知见。</p><p>所以世尊在讲法时也要说我见人见众生见和寿者见，并且要具体讲解为何我见是邪见，为何人见是邪见，为何众生见是邪见，为何寿者见是邪见。这样，就能破除众生的四种颠倒邪见，从而让众生断除内心的生死结缚，割断捆绑自己在三恶道中的枷锁，最终得到解脱。若不如此，世尊如何能广度众生，让众生明了真实的佛法，从而能自利利他呢。</p><p>原文：<strong>何以故。世尊说我见人见众生见寿者见。即非我见人见众生见寿者见。是名我见人见众生见寿者见。</strong></p><p>释：为什么这样说呢？因为世尊所说的我见人见众生见寿者见，不是真有个我见人见众生见和寿者见。所谓的我见人见众生见和寿者见，并不是真实存在的法，没有真实的法相，只是假名为我见人见众生见寿者见，都是一个名字而已。</p><p>须菩提说的这几句话，否定了我见人见众生见寿者见这些知见存在的真实性，正好也顺应了经文前边的般若之义。因为这些见不上真实的法，所以通过修行才能除去这些见，才能破除四相，就可以那个公式：所谓……即非……是名……。这个公式的义理，就是否定了世间万法的真实存在性，没有真正意义上的世间万法，都是虚妄。因为都是如来藏所生所变现，都是如来藏的种子功能作用，实质也都是如来藏。因此世间一切万法，都是假名字，没有实义。</p><p>我见人见众生见寿者见，这四种邪见，也是世间万法当中的法，是后天出生又能灭掉的法，是先无后有，有后还无的法。其实存在之时，就是刹那刹那生灭的，因为生灭的速度太快，众生不觉，就误以为是真实存在的，这样就形成了各种错见和邪见。这些邪见都是虚妄的假相，并不真实，如果真实，众生就不能通过修行，来断除这些邪见，从而具足正确的知见和见地。这些邪见都没有其自体性，也没有自主性，都是依赖外缘而有，是由如来藏输送种子而生，本质就是如来藏之性。</p><p>那么我见是什么呢？又是如何出生的呢？我见，就是对于我相的知见，正确的知见是认为我相是空，错误的知见是认为我相是有。首先说我，众生认为的这个我，一是指色身，一是指六识心，一是指第七识意根，或者是三者合起来的五阴我和十八界的我。这些我都是假我，并不真实，都是因缘所生，没有实体，幻化而有，缘灭即散，无可依估。</p><p>色阴由如来藏四大种子生成，生住异灭，变异无常，现象上是有，实质是无，本质是如来藏；受阴是六识的感受，是如来藏输送六识种子而生成，生住异灭，幻化非实，缘灭即散，不可依估；想阴是六识对于六尘相的执取和了知性，由如来藏输送六识种子而生成，幻化而有，缘灭即散，不可依估；行阴是六识身口意行的迁流变化，以及色身的改变和变动，由如来藏输送七大种子而生成，生住异灭，幻化不实，缘灭即散，不可依估；识阴是六识的了别性，由如来藏输送的六识种子而生成，幻化非真，缘灭即散，不可依估。四阴也没有实体性，没有自在性，现象上是有，实质是无，本质是如来藏。</p><p>这就是众生所认为的五阴我，刹那生灭，刹那变异，众生不觉，以为实有，执著不已。众生所认为的我，也包括十八界法，就是六根、六尘、六识，这些法也都是如来藏输送七大种子而生成，生灭变异，现象上有，实质是无，本质都是如来藏。是谁认为五阴十八界为我，而有我见呢？是第六识和第七识。第六识叫作断续我见，第七识叫作俱生我见。因为第六识的存在是一段一段的，不能去到未来世，生命结束就消失，生命出现即出生，因此是断续的。第七识从无始劫以前就一直存在，能去到未来世，证得四果罗汉，断尽执著时才有能力灭掉第七识，因此叫作俱生我见和俱生我执。</p><p>有我见的主要是这两个识，而这两个识，如来藏输送识种子，才能出生和存在，才能起用，因此六识和七识都没有自主性，没有实体性，没有自在性，生灭变异，幻化无常，而且是刹那刹那生灭变异。那么六识的我见和七识的我见，即非我见，就不是真正存在的我见，不是有实体的我见，是幻化的我见，本质就是如来藏。因此把六识的我见和七识的我见，取名为我见，我见就只是一个假名字而已。</p><p>与我见相对应的人见、众生见、寿者见，也是此理，都是如来藏幻化的六七识心所生起的错误的邪见，这些邪知错见，也不是真实存在，犹如阳炎，空幻不实。表面看是有，实质是无，本质都是如来藏，并没有真实的这些邪知错解。就像烦恼即菩提一样，烦恼的本质就是菩提心如来藏，邪知邪见也是菩提心如来藏的功能作用，因此本质也是如来藏，除此无他。</p><p>原文：<strong>须菩提。发阿耨多罗三藐三菩提心者。于一切法。应如是知。如是见。如是信解。不生法相。</strong></p><p>释：世尊说：发阿耨多罗三藐三菩提心者，对于一切法，都应该这样的来了知，都应该如此地看待一切法，都应该如此地生起信解，内心里不要再产生任何法相，也不执取任何法相，空空净净，坦坦荡荡。</p><p>世尊在这里就此劝导发大菩提心的菩萨们，对于一切法，都应该寻根究底，彻见其本源和实质。深知一切法的本质，不着虚幻的假相，不执虚假的名字。把一切法分析了又分析，观行了又观行，思惟了又思惟，犹如剥芭蕉一样，一层一层地剥去外皮，彻见其最中心最根本之处，才知道芭蕉原来是空的，并没有芭蕉实质的相貌。</p><p>以此来观察一切法，就会知道原来都是空，并没有实质的一切法，都是如来藏的空相。于是心息，除却妄想，不再希望求取一切法相，不再向外追寻乞讨，就此回归到心地的本源，回归到自性的家园。这样内心就不会再生起任何法相，把一切法都看成是梦幻和阳炎，都看成是镜像和水月，再也不会当作实有之法，而执著抓取。这样就会免去生死造作的因，灭去生死的业果。这样无明断尽，异熟果空，大圆镜智现前，十方世界坐道场，广利无量无边有缘众。</p><p>原文：<strong>须菩提。所言法相者。如来说即非法相。是名法相。</strong></p><p>释：世尊说：须菩提，众生所说的所谓的法相，如来说都不是真正存在的法相，不是真实有的法相，都只是名字罢了，所以就假名为法相。</p><p>法相，包括三界世间里的色法相和心法相。色法相就是五根，以及六根所对应的色声香味触法。不管是外相分的色声香味触法，还是内相分的色声香味触法，都不是真实存在的法相，表面上看似有，实质是空。这些色法相都是如来藏输出四大种子所构成的，因此就是幻化的，犹如虚空中花，犹如阳炎，犹如光影，犹如水中月。其本质都是如来藏的法相，而如来藏的法相也是空，因此色声香味触法以及五根，都是空相，因此即是非法相，只有名字，没有实质。</p><p>心法相，就是七识心的法相，以及伴随七识的心所法法相。七识的法相，是由如来藏输出七识的识种子形成的，识种子刹那出生，又刹那灭去，生灭变异，虚幻不实。七识运行时的行相，表面上看来是有，实质上是空，犹如阳炎，恍人眼目罢了。所以七识也非真实存在，没有真实的法相，其本质就是如来藏的空相。</p><p>七识运行的行相，是以心所法的形式来运行，包括作意、触、受、想、思，这五遍行心所法，以及其它的所有心所法。七识一运行，这五个心所法就陪伴着七识现行出来了，其它心所法，有时也会伴随着七识而现行，七识生，心所法就随之现行，七识灭，心所法就会随之灭去。七识心生灭虚妄，非是真实，心所法更是生灭虚妄，非真实。其表面的运行行相看似有，实质却是空幻，了不可得，本质都是如来藏的空相，因此心法相也是空，只是一个名字而已。所以佛说法相，即是非法相，不是真实存在的法相，都只是名字而已，不可当真，也不可执取。</p></div>"
},{
    "title": "第三十四章　应化非真分第三十二",
    "author": "生如法师",
    "date": "2019年01月28日",
    "html": "<div class=\"B1_text\"><p><strong>第三十四章　应化非真分第三十二</strong></p><p>原文：<strong>须菩提。若有人以满无量阿僧祗世界七宝持用布施。若有善男子。善女人发菩提心者。持于此经。乃至四句偈等。受持读诵。为人演说。其福胜彼。</strong></p><p>释：世尊开示须菩提说：如果有人用装满无量阿僧祇世界里的七宝，都用来布施，这样所得的福德是相当广大的。再如果有善男子善女人发了大乘菩提心，修持此经，或者是此经中的一个四句偈子，不但自己能够受持读诵，而且还能为众生演说，那么这个善男子善女人所得的福德，要远远殊胜于布施无量阿僧祇世界七宝的人。</p><p>阿僧祇，是印度语，代表非常多、数不清的意思，阿僧祇世界，就是无数个数不清的三千大千世界。如果有人把一个小世界里的七宝布施出去，其福德就不可思量了，何况布施一个三千大千世界的七宝，其福德更是不可思量，那么布施数不清的三千大千世界的七宝，其福德还能想象和思惟吗？简直是不能思议了。可是另外有一个善男子或者是善女人，发了大菩提心，想要圆成佛道，并且广利无边众生。这样的善男子善女人，受持读诵金刚经，修学如来藏成佛之法，自己能够完全受持和证解此经如来藏，还能为其他有缘众生开示演说，其所得的福德，要比布施无量阿僧祇世界七宝的人所得的福德要殊胜得多。</p><p>为什么这样说呢？真正能受持读诵金刚经的善男子善女人，都已经是证悟了般若实相的大菩萨，这是真正有福德有智慧之人。他们自己不仅广有福德和智慧，也会教导其他众生去获得受持读诵金刚经的大福德和大智慧，因此他们自己的福德和智慧又会得以增长。当他们的智慧和福德都增长到极限，达到圆满的时候，就成为福慧两足尊，成为天人师，成为佛世尊。天上天下无如佛，三界世间我尽见，一切无有如佛者。</p><p>既然如此，那么布施阿僧祇世界七宝所获得的福德，又算得了什么呢？这些世界、这些七宝都是有为有相的生灭之法，都是金刚心中物，都是自性摩尼宝珠中的一小部分。而受持读诵金刚经的善男子和善女人，证得了这颗摩尼宝珠，也就拥有了这颗摩尼宝珠，也就等于拥有了阿僧祇世界的七宝，也同时拥有了未来无量的阿僧祇世界。这个福德当然会远远超胜于布施阿僧祇世界七宝的人。</p><p>原文：<strong>云何为人演说。不取于相。如如不动。</strong></p><p>释：世尊开示说：为人演说金刚经以及四句偈子、开演如来藏妙法的善男子和善女人，要如何为人演说呢？应该要依止于如来藏的体性，内心里不取着任何一法相，而且对于一切法相，都要如如不动，不见法相实有，心不随外境法相而动转，像如来藏一样清净无染，不取于相，也不起心念，对境无心，如如不动。</p><p>菩萨们证悟如来藏以后，就会越来越多地观察到如来藏的清净无为性，同时也能越来越多地感知到一切有为法的虚幻无常性，菩萨们的心就会渐渐地不再对有为法生起意乐，而趋向于如来藏的清净无为性。菩萨们渐渐地观察到三界世间的一切有为法相，都是如来藏所出生和幻化的，因此也就渐渐地不再执取世间的一切法相了，对于一切法，心也就渐渐地不随之而转动了，最后就能达到如如不动，类似于如来藏的无为性。</p><p>原文：<strong>何以故。一切有为法。如梦幻泡影。如露亦如电。应作如是观。佛说是经已。长老须菩提。及诸比丘。比丘尼。优婆塞。优婆夷。一切世间天人阿修罗。闻佛所说。皆大欢喜。信受奉行。</strong></p><p>释：为什么为人演说金刚经时，要不取于相，如如不动呢？因为一切有为造作出来的法，都像梦一样；都像幻化的一样；都像水泡一样；都像影子一样；都像露水一样；都像空中的闪电一样。每位菩萨在面对世间的一切有为法时，都要作这样的观照，都要如此的看待一切有为法。世尊开示完这部金刚经以后，当机者长老须菩提，以及所有比丘、比丘尼、优婆塞、优婆夷四众弟子，以及一切世间的天人阿修罗，闻佛所说之法，皆大欢喜，信受奉行。</p><p>世尊在法会要结束时，开示出了有名的四句偈子，来说明一切有为法的虚幻不实性。因为都是虚幻不实的，那么菩萨们就没有必要再牵挂，再执取，再随之动转。就像在梦中，无论我们如何执取梦中的一切人事物理，如何随之动转、动摇，造作业行，可是最终毕竟是一无所有的，执取不到半分毫。谁也没有从梦里得到过什么，那还徒劳其心，有何益哉！</p><p>一切有为法，都是如来藏依缘所幻化出来的。就像是魔幻师，意念所成一切人事物，突然在虚空中显现出来，可是当魔幻师收回意念时，一切人事物终将归于空无，何劳把捉，徒役其心，有何益哉！一切有为法，都是从如来藏这个大海里出生的泡沫，在如来藏大海里沤生又沤灭。三界世间里所有的一切人事物理，就像海水里的泡沫，生了灭，灭了又生，生生灭灭都归于大海，何必徒劳执取泡沫，而不见大海。</p><p>一切有为法，犹如月亮的影子，落在千万个河海之中，似有似无，看似有，却打捞不得。只有凡夫，恰是痴猴，执手去捞，空空无物，菩萨智者，以智慧眼，观照是影，有何可捉；一切有为法，犹如晨露一般，朝阳生起，转瞬即逝，速生速灭，有何可执；一切有为法，也如雨中的电闪雷鸣，刹那间划过虚空，瞬间即无踪影，任你惊魂未定，任你惊恐万状，它已消失，无影无踪。</p><p>世尊教导说，菩萨们悟后应该常作如此观照，则自心清净，无执无取，不染一尘，不执一法。这样就与本心真如相应，随顺于真如，就能得成无上菩提。以此无执无取之心，为众生演说金刚经，度诸众生，同出幻尘，共灭幻影，同入诸佛大智慧海，共圆诸佛一切种智。</p><p>如此受持读诵金刚经，演说如来藏法，其福其智，世间众生，堪谁能比，其谁能胜！如此自利利他，岂不妙哉！岂不快哉！最后世尊演完此经，四众弟子，人天大众，莫不信、莫不受、莫不奉、莫不行，名为信受奉行如来演说的金刚般若波罗蜜经。</p></div>"
}]