[{
    "title": "第一章 黑匣子就是我们生活的广阔天地",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>导     言</strong></p><p>黑匣子喻黑暗狭小的空间或者是处所，我们的大脑就是黑暗而狭小的，如黑匣子一般，虽然大脑让我们感知的空间非常广大。我们的感知活动就在大脑黑匣子里，感知的法也在大脑黑匣子里，能知所知都在黑匣子里，所以我们众生就是生活在黑匣子里。既然如此，我们的感知是多么的不真实不可靠，所感知的法是多么的虚妄不真实，我们所能依赖的大脑也是生灭变异的，那么五蕴世间究竟是个什么？还是什么也不是？这个问题足以颠覆我们生生世世和历劫以来的所有对于生命的认知，所以敬请大家随文深思，以提升对生命的认识，获取真正的解脱智慧！</p><p><strong><span>第一章  黑匣子就是我们生活的广阔天地</span></strong></p><p>一、黑匣子的定义</p><p>黑匣子一般是指记录飞机飞行和性能参数的密封容器，用来分析并得出飞机失事的原因。本书所讲的黑匣子，并不是指上面的飞行记录仪（世俗黑匣子），而是指一个大脑中黑暗狭小、四处密封、不透光亮的黑暗区域。黑匣子在佛学里是指我们大脑部位的胜义根之处，这个部位是由大脑皮层包裹着，里面漆黑一片，因为不在身体表面，光线照不到，所以是漆黑的；我们的肉眼看不见，只有开刀手术后才能看得见，或者有天眼者才能看得见，我们就假称之为黑匣子。</p><p>大脑处的黑匣子就是五个胜义根，包括视觉感知部位、听觉感知部位、嗅觉感知部位、味觉感知部位、触觉感知部位；以及运动和语言中枢神经系统，包括一部分大脑皮层、端脑、脑干和小脑等等。而我们所接触到的所谓的广大世界、广阔天地，以及众多的色声香味触法等等六尘境界，都是在大脑那个地方的黑匣子里，所以我们就生活在黑匣子里。</p><p>二、为什么说我们生活在黑匣子里</p><p>因为我们能了知的一切法、能接触到的所有的六尘境界，都是第八识依据大脑胜义根之外的六尘，像镜子显现镜影一样，把外六尘在大脑胜义根里变现成内相分六尘影像，我们识别了知的就是黑匣子里的这个影像。第八识通过五根把外相分色声香味触法的微粒，传导到大脑胜义根里，于是在这个黑匣子里就产生出内相分六尘影像，根尘相触以后，第八识就在相触处产生六识，六识产生出来以后，就要了别和处理黑匣子里的内相分六尘。</p><p>内六尘就包括我们所看见的所有色尘，包括我们所听见的所有声音，包括我们所嗅到的所有气味，包括我们所尝到的所有味尘，包括我们所觉到的所有触尘，包括我们所思惟了别到的所有法尘。而六识就是在胜义根黑匣子里产生的，了别的就是黑匣子里的内六尘，这就是我们生活的所有的广阔天地了，所以我们是生活在黑匣子里。</p><p>三、如何证明我们确实生活在黑匣子里</p><p>（一）比如把后脑负责视觉那部分的神经掐断，我们马上就看不见色尘，看不见虚空，也看不见光明。为什么看不见了呢？因为视觉传导中枢神经被掐断了，它是传导外相分微粒的通道，这个通道断了，或者是眼的胜义根坏了，色尘上的四大微粒就传导不到胜义根黑匣子里，第八识就不能依之变出内色尘，也就不能产生眼识，没有识也没有色，就是盲人一个。这说明我们见色是见的胜义根黑匣子那里的色尘，不是见外面的原色尘。我们也看不见外面本质的原样的虚空，我们所看见的虚空也是在黑匣子那里的，仅仅是个影子而已；如果我们能见到十方世界，也是见胜义根黑匣子那里的十方世界，见不到外面真正的世界。那么我们生活的天地大不大呢？</p><p> 同理，我们听的声音，嗅的香尘，尝的味尘，觉的触尘，都是在大脑胜义根那里的内相分，不出黑匣子之外。那就是说，黑匣子是根，是内根；六尘在这里变现，是内尘；六识在这里出生，是内识。那么六识所了别的内容，都是黑匣子胜义根里的内容，我们生活的天地都在这里，在黑匣子这里。</p><p>（二）比如瘫痪病人不能坐立，不能走动，就是因为在后脑胜义根那里，负责身体行动的神经坏死了，本应通过传导神经在身体的胜义根处产生的触尘不能出生，触尘不能通过传导神经在身体的胜义根处产生，身识和五俱意识也就不能出生，身体当然就不能行动了。</p><p>行走坐卧由意根在大脑中枢神经系统发布命令，命令通过神经系统传导到后脑负责行走坐卧的神经系统，再往全身神经系统传导，身根得到命令，身识才能与五俱意识正常的行走坐卧。如果身根负责行走坐卧的神经系统受到伤害和毁坏，身识就无法正常完成行走坐卧的指令。如果肌肉无力，气血供应不上，也无法正常行走坐卧。行走坐卧是由大脑胜义根掌控的，引生身识和意识的触尘是在胜义根里，身识和意识所触所觉的都是胜义根黑匣子里的触尘。</p><p>身根神经系统受到破坏，身体就会不知道疼痛了，因为第八识没办法再在胜义根黑匣子处出生痛的触尘，也就没有身识和意识来了别触尘的痛觉。所以身体觉得疼痛，到底是在哪里有疼痛感？就是在黑匣子里产生疼痛感，以及产生身体的各种感觉。身体痒也如是，都是在黑匣子那里了别痒，了别的是黑匣子那里的触尘。</p><p>（三）比如说脚趾头疼，真的就是脚趾头疼吗？手痒，真的是手痒吗？黑匣子如果出问题了，我们就会既不疼，也不痒。可是脚趾头疼、手痒，我们都以为真的是脚疼手痒，不知道都是在胜义根黑匣子那里发生的事情，觉得就是脚趾头疼。我们感觉的饿、渴、疲乏、饥饱等等的觉受，都是在黑匣子里发生，都是在黑匣子里感觉，都是感觉黑匣子里的触尘，不出黑匣子之外。总之我们所有的感觉都是错觉，是生生世世的错误分别所造成的，无始劫以来一直被自己的愚痴所欺骗着。</p><p>（四）当我们听到宇宙天空传来的天籁之声，往往就以为真的听到了外界天空的声音，以为真的听到了空中的风声和雨声，其实都是黑匣子里的声音，都是幻化的影子。当胜义根耳根或者耳根的传导神经出问题的时候，外面再大的声音，自己却听不见，别人都能听得见，所以我们听的就是黑匣子里的声音，不是外面的声音。</p><p>我们生活的世界就在黑匣子那里，就是那么样的大小，我们的识心在黑匣子里分别一切法，还以为自己是在海阔天空里遨游。就像在梦里，以为自己真的飞升到了天空，以为真的回到了过去，飞跃到了未来，结果并没有离开床上一丝毫，我们哪里也去不了，就在黑匣子里生活着。</p><p>（五）举个植物人的例证，说明黑匣子的功用。植物人，顾名思义，就是身体像植物一样僵化不能动，几乎没有知觉反应了，那就是胜义根部位的神经一部分或者是大部分坏死，不能用了。但不是完全都坏死了，如果完全都坏死，彻底不能用，那么意根就会决定离开色身，重新再寻找一个有用的色身来为自己所用，不会死守枯城。意根对于色身的判断，都来源于第八识所变现出来的身根的法尘，所以意根能作一定的了别，这个粗略的了别慧，祂是有的，而且不用教导，天生就能了别。</p><p>至于植物人还能维持生命，没有死亡，意根也就没有离开，祂觉得色身还有用处，可以为自己所用，所以还是要非常地贪恋，不肯离开。那么植物人还有什么用呢？他还有微弱的意识，有时能感觉痛苦和不自在，偶尔也能认识亲人，他能非常简单而粗燥地了别一些六尘内容，只是不全面，不细微了，了别得也不清楚，只是知道个大概的影像。即使是这样，意根也不愿意弃舍，仍然贪执着，抱着一线希望。可见，最可怜的还是意根，由于对生命和色身的顽强执著，什么都贪执，遍计所执，所以才是可怜悯者。</p><p> 植物人还有微弱的意识，就说明后脑胜义根的神经没有完全坏死，还有一些六尘能进入到胜义根黑匣子里，在这个黑匣子里变现出影子。于是孱弱的胜义根，与不正常的六尘当中的一部分，二者和合相触，微弱的识心出生时，就会作劣弱的了别，众生真是可怜悯。如果胜义根全部不能用时，六尘一点也进不来，那么六识就不能出生了，色身也就不能用，意根肯定要决定离开的。生命其实是这么的脆弱，就在呼吸间，说了断就了断，简直不堪一击。</p><p>这样五根、六尘、六识，都不能被意根所用，意根没法再留恋了，不舍也得舍，就会决定离开，重新投生，再寻觅个新的色身为自己所用。如果植物人的六识灭后，不能再现起了，意根就会离开。祂知道六识不能再出现了，自己就没法了别六尘，身体也不能用了，祂肯定要离开色身，那样人就死亡。既然人没有死，就有意根存在，也有意识心的偶尔存在。五识当中也有某个识存在，眼识有时也能看见色尘看见人，耳识也能听见声音，也出现不爱吃饭的现象。</p><p>植物人的例子，就说明我们是生活在黑匣子里，整个世界就在那里。大脑掌管身体活动的那部分神经坏死了，人就不能走路，身体也不能活动。这说明后脑那里就是我们整个的机关和奥秘，我们的世界都在那里。五根的胜义根都在大脑部位，而且区位不同，各有各自主管的神经元负责接收五尘。触觉神经如果坏了，即使身体流血，手脚断了，也不知道冷热疼痛，更不知道身体发痒。</p><p>（六）现在有科学家研究特异功能，已经用仪器检测，锁定这个功能的起源就在后脑勺这个位置，我们每次遇见重大事故，下意识就抱住头部，以保护后脑，这就是意根作出的天然反应，也叫作惯性，潜意识里就知道那个地方重要，是命根子。</p><p>五根的胜义根都在后脑那个部位，第八识把六尘也变现在那里，五胜义根加意根，六根触了这些内六尘以后，第八识又在后脑的胜义根处出生六识，于是六识就分别后脑黑匣子那里的六尘，我们就能见色、听声、嗅香、尝味、觉触、思法。我们生生世世所经历的所有事情，都是在这个小黑匣子里发生的，我们生活在这里，就像生活在广阔的天空里一样。</p><p>（七）识心虽然无形无相，不在色身的里外中间，但还是有出生处所。根尘相触处才能产生识，识要触六尘，就是触黑匣子里的六尘，六尘就是在后脑胜义根部位变现出来的，识当然要触大脑黑匣子里的六尘，分别胜义根黑匣子里的六尘然后再加以处理。所以我们就活在黑匣子里，在里面见听嗅尝触，喜怒哀乐。</p><p>  四、黑匣子就是虚拟世界</p><p>（一）一切法都是黑匣子里的影子 </p><p>仔细思惟一下，我们接触的这一切法是不是非常虚妄呢？无论见的色，听的声，嗅的香，尝的味，觉的触，都是在黑匣子里的影子，可是却感觉好像真看到了外面广阔的天空，好像看到了外面的什么色声香味触法，好像听见了外面什么声音，其实都是在黑匣子里接触影子。如果我们能好好思惟这个理，断我见就不太难了。这需要我们努力修定，修福德，但是这些修行也都是在黑匣子里修，不出黑匣子之外。黑匣子就是大脑胜义根，是第八识给我们构建的一个虚拟的现实世界。</p><p>我们接触的六尘境界都在大脑胜义根那里，即使是能接触到极乐世界及十方世界，也都是在那里，虚空以及阳光也都在那里显现，我们所接触到的，所能了别的，都是大脑胜义根那里的法。这个内容观行好了，就完全可以断我见，不再认五阴为我，不再认十八界为真实；也可能有如幻观的现前，直到如梦观和镜像观。</p><p>而证得哪种程度的观行是因人而异的，前提是一定得证得第八识如来藏。这样观行，就能证得一切法全部都是幻化出来的，心里就会有这样的认知，很坚定地就认可此理了。我们学佛修行，如果福德和定力具足了，从任何一个方面和角度，都可以证得佛法，通达佛法，修行真是不可思议。</p><p>（二）极乐世界也是黑匣子里的影子</p><p>有人要问：如果我临终往生极乐世界，极乐世界是在哪里呢？是真实的还是虚幻的？当然我们能接触到的极乐世界也是第八识如来藏所幻化出来的影像，我们不能接触到外面相对真实的极乐世界，外面相对真实的极乐世界，是阿弥陀佛和所有与阿弥陀佛和极乐世界有缘的众生，祂们的如来藏共同变造出来的，并且共同执持着。</p><p>八个识中只有第八识，能够真正地接触到外面的所谓真实的极乐世界物质色法，我们的六识都接触不到，只能接触到第八识在黑匣子里所幻化出来的影像。那么如果能到极乐世界，是到哪里的极乐世界，极乐世界到底在哪里，心里就应该知道了，第八识在哪里变造出莲花，也就能明白了。其实内外相分的极乐世界都存在着，内外相分的莲花也都存在着，自己所能接触到的却都是心中像。</p><p>如果我们能往生极乐世界，是真往真生了吗？往生之时，真有外面的阿弥陀佛以及菩萨们来迎接吗？真有外面的莲花让我们坐上去吗？谁能坐到真正的莲花上呢？就连自己家的床和椅子，都不能真正地坐在上面。我们不能真正地住在外面相对真实的极乐世界里，要住也是住在自己第八识幻化出的影像里，住在黑匣子里的极乐世界。一切法都是幻化的，没有一法真实，第八识在黑匣子里变造出莲花和极乐世界，六识如果能缘，是缘的这个影像，不会接触到实质的极乐世界。这是非常重要的认知，要好好地切实的观行，就能断我见，也会慢慢断我执，之后就能得解脱了。</p></div>"
},{
    "title": "第二章 内相分影子",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  内相分影子 </strong>          </p><p>一、日常都有哪些法是影子</p><p>我们所接触到的、了别到的一切法都是黑匣子里的内相分影子。所谓内相分，就是第八识依据外六尘相分在胜义根处所变现出的影像。比如我们坐在床上，就是坐在外面床的影子上面，不是真正地坐在实质的外面床上，那个四大组合的相对真实的床，我们的身体根本接触不到，我们的身识触不到外面的真实的床，只有第八识才能触到外面的实物质色法。而外面的实物质色法六尘，那是有缘众生的第八识共同变造出来的，不属于我们单独所有，凡是有缘众生都有一份儿。</p><p>因此外面那张床，别人也可能坐上去，别人也可能搬到自己家里，但是别人坐的床，是他们自己的第八识根据外面的床又变现出来的内相分影子，同样不是外面相对真实的床。我们所有众生的身识，只能接触到床的内相分影子，这个影子是一个假像，是我们自己的第八识依据相对真实的床，又单独变造一次，让我们单独受用，任何其他人无论如何都受用不到，只有这个影子才是私有财产，其他的都是公共财产。</p><p>我们觉得自己坐上去的床，是真真实实的，自己也真的就坐在上面。其实它就是一个影子，一个四大微粒形成的电流信号的组合体，我们的身识就是在接触和感受影子信号而已。众生无始劫以来，就是在把各种影子当作真实，在其中生心动念，种种分别、执著、妄想。其实一切的感觉都是一种错觉，我们觉得床很硬实，或者很柔软，很舒适，其实那种软和硬的感觉是一种错觉，是我们的身识和意识对着影子，产生分别之后，所生起的感受，其实并没有实质的物质色法。就像猴子望着水中月，以为是真月，用手去捞，结果什么也没有捞到。</p><p> 就像一只狗，看见镜子里自己的影子，以为是别只狗，于是就大声吠叫，想要赶跑镜子里的那只狗。我们无始劫以来，就是这样的愚痴，与那只狗和猴子无别。佛陀曾经说个比喻，说众生追逐着六尘境界，就像痴狗逐块，有人扔块石头，牠马上就奔跑过去；当风吹草动的时候，痴狗以为有什么大事，冲着草晃动的地方，就开始狂吠，连个风吹草动都不能辨别。所以，佛陀怜悯我们，降到人间，传授我们大乘实相法，让我们离一切虚妄相，回归到真实的空性心中。</p><p> 同理，我们坐在椅子上也如是，都是接触的影子，然后产生虚妄的觉受。我们感觉到阳光的照射，也是接触的外面阳光的影子，然后产生热和温暖的虚妄感觉，所有的感觉都是这样的虚假不实。其实我们接触不到真正的阳光，也接触不到真正的外面的微风，我们接触到的都是第八识把阳光和微风变出来的影像，都没有触到真实的阳光和微风。那么我们感觉阳光暖融融的，感觉微风吹得很舒适，这些感觉全部都是错觉，都是虚妄的感受。六识所能分别的都是影像，然后再对虚妄的影像生出各种虚妄的感受，这些感受都是幻觉，这些幻觉当然都不是真实的。</p><p>外面的六尘世界好像是真实的，好像有真实的物质存在，但是，那个真实也是相对于内相分而说。外面的物质世界，也是共业众生的第八识，共同输送四大种子所变造出来的。有，也是假有，也是幻有，也并不真实，都是第八识变现的幻影。而且是所有有缘的共业众生，他们的第八识共同变造出来的幻影，单个众生的第八识还不能变造出来。</p><p>外面的六尘世界，外面的物质世界，相对于我们后脑黑匣子里的内相分，好像真实一点，是四大组成的实质的物质世界。但是只有第八识能接触实质的四大组成的相分物质，六识七识都不能接触到，也感觉不到。对于七识心来说，外面世界好像并不存在，而我们所能接触到的，仅仅是个影像而已。</p><p>我们无始劫以来，都把内相分当成了外相分，当成了真实的物质世界。因为我们不知道内相分与外相分是非常的相像，内相分显得非常的真实。所以我们的身识、眼识等六识，在分别这些影子的时候，就把影子当成是真实的，于是就对影子分别计较不停歇。天天觉得，我真实的吃到饮食了，于是就贪着饮食；我真实的坐在床上了，于是就贪着舒适的大床；我真实的喝到水了，于是就贪着可口的饮品；我真实的感觉到衣服的柔软和轻柔了，于是就贪着着装；我真实的看到和拥有珠宝了，于是就贪着金银珠宝，其实都是影子，我们不知道那些都是内相分影子。</p><p>二、形成影子的原理</p><p>为什么我们接触到的都是内相分，都是黑匣子里的影子呢？我们再从另外一个角度作以说明。外色尘与我们的眼根是有距离差异的，从眼前鼻端，一直到很远很远之处的色尘，其距离差距极大，传导到外眼根所需的时间是不同的，虽然都是如来藏所为，传导的也极其快速，比光速还快，但还是有个时间差，那么眼识所见就有先后之别。如果眼识见到的是外色尘，我们就会先见眼前的色尘，后见远处的色尘，不可能远色和近色同时见到。如果我们见到的是后脑胜义根黑匣子里的内色尘，那就会有所不同了，只要是黑匣子里的色尘，眼识只要作意的，就能够同时见到，不分远近和高低。</p><p>因为黑匣子里的色尘是影子，都在胜义根里，与眼睛的胜义根没有距离，眼识只要触，就会同时都触到，不存在先看到近色，后看到远色。因此，我们眼识所见到的都是黑匣子里的影子，不是实质的外色尘。眼识意识触了内色尘以后，就会接纳、领受内色尘，了别内色尘，就会确认是什么色尘，于是我们就知道是什么色尘了，而且是远色近色同时都知道，其实远近都是虚妄法，没有远近，幻觉罢了。</p><p>当我们眼见色尘的时候，仔细注意一下，远色与近色是不是都一起收在眼里，远近高低所有的色是否都一起进入了我们的眼帘，在视觉范围内的色都是同时见到的，有时也要看作意在哪些色尘上。除非我们的注意力只集中到某一点上，或者是作意在很少的色尘上，其他的色尘我们才见不到；注意力如果不是集中到一点上，其它的色尘我们就都能看得到。这就说明了，我们所见的色尘，是第八识已经变现在胜义根黑匣子里的内色尘，我们所见到的，就是这个影子。</p><p>我们听声音也是，远声近声是同时听到的，左边来的声音，右边来的声音，上边来的声音，下边来的声音，东西南北四面八方来的声音，我们都是同时听到的，那就说明听的是内声尘影子。佛在楞严经中说，耳根圆满一千二百功德，四面八方的声音都能入耳，都能听得到，即使有障碍物，声音也能通过障碍物传过来。那就是第八识同时把四面八方的声音，通过耳根都传到大脑胜义根里，就在黑匣子那里，形成了内相分的声音影像。</p><p>然后耳识与意识就在那里变生出来，那么耳识听声音时，四面八方的声音都能同时听到。从这里就应该明白，我们所看见的色尘，听到的声音，都是已经过去了的，我们所了别到的都是已经完成了的过去的内容，所以都是虚拟而不真实的。等我们再采取行动，采取应对措施时，那就更晚了一步，这一切的了别过程，应对的行为造作，都是马后炮，只能改变和影响下一步事情的发生。</p><p>天空当中打雷的声音，离耳根极远，我们头脑中的嗡嗡声，离耳根极近，可是这些声音都是同时听到的，那就是黑匣子里的声音。天空中的闪电，离眼根极远，眼前一寸的手指头，离眼根极近，可是，眼识也是同时看到的，那就是黑匣子里的色尘。遥远的栴檀香，离鼻根极远，脸上的香尘，离鼻根极近，可是鼻识也是同时嗅到，那就是黑匣子里的香尘。天空当中的太阳光，离身根极远，头的痛觉离身根极近，可是身识也是同时感觉到，那就是黑匣子里的触尘。这些境界，都是后脑黑匣子里的内相分影像，识心接触到，就都能同时领受和了别。</p><p>从另一方面来说，一切法都是如来藏里的法，不出如来藏之外，如来藏中没有距离，一切法之间就没有距离，都是如来藏的种子变现出来的，六识接触这些法的影子就是同时接触到的，没有远近之说。如来藏摄取外六尘的四大微粒，不会按照世俗界的距离一点点的传导到胜义根黑匣子里，如来藏不会分别距离，所以现起的世俗法都是假法。既然法不真实，就没有远近高低大小之说，六识所见的远近高低大小是心的妄见，是错见邪见，是不如实之分别。</p><p>所有人了别到了六尘以后，都以为自己了别到的是真实的六尘境界，以为这些六尘都是真实的。于是就对六尘起了贪厌等等觉受，起了觉受以后，就开始思量，思量以后就作抉择，生起决定心，决定要如何造作。这一系列的心所法就都产生出来了，而且还要不断反复地运行下去，因为把境界当真了才如此。其中五遍行心所依次都产生出来以后，它们之间的次第会发生变化，而且还会重复，这些心所法的转换很复杂，要看对于所接触的六尘是否感兴趣，六尘是否容易被了别清楚，六尘是否重要等等。</p><p>三、为什么被感知的六尘都是黑匣子里的影像</p><p>有些人看到内相分的问题，不相信自己所接触到的、了别到的一切法，都是黑匣子里的内相分影子，认为自己所见到的一切法都是那么的真实可靠，不可能是影子。这是因为这些影子太立体、太骨感、太鲜活了，所以每个人就会感觉自己的行走坐卧、吃喝拉撒，都是如此地真实而又现实；感觉自己见色闻声，见的就是外面实在的景色，闻的就是外面实在的声音，感觉的就是外面实在的阳光，不明白这一切怎么就是影子呢？怎么就是假的呢？</p><p>如果读诵金刚经，看到佛说凡所有相皆是虚妄，大家都能信受，还能倒背如流，如果具体分析说，这些六尘都是影子，都在黑匣子里，因此都是虚妄，那就不能理解和信受了。如果讲解的太具体，不得不面对实际问题的时候，那就很难了，当背诵佛语的时候，可以不用具体理解思惟，不用真正地面对这些问题，而且还是佛说的，就会人云亦云地背诵，其实是不解其义。</p><p>因为无始劫以来，我们都着相惯了，颠倒惯了，久已成习，知见很难一时纠正过来，很难再颠倒过来，需要慢慢的改变自己的认知，慢慢回归到正知见中。现在我们就再拿具体实例来作思考和观行，以具体来观行，我们所接触的一切六尘境界都是黑匣子里的影子。</p><p>比如有这样一个问题：有人问：我从甲地到乙地，这一路上所经历的一切，所见、所闻、所觉、所知的，明明都是那么的真实，甲乙两地也是那么的真实，所坐的汽车也好，飞机也好，走路也好，都是那么地真实，如何都是黑匣子里的影子呢？</p><p>（一）我们先说走路吧，走路的时候，六识所接触的一切境界相，都是黑匣子里的六尘境界。首先因为两条腿走路，色身会不断地移动，那么六识所接触的一切境界都在不断地发生变化，即使色身不移动也是如此。在走路这个过程当中，外相分的景色一直在发生着变化，这个变化包括六尘上的所有变化，色尘上景色的变化，声尘上声音的变化，香尘上气味的变化，味尘上酸甜苦辣的变化，以及触尘上冷热触痛的变化，心里还有种种思想念头的变化。</p><p>我们所经历的各种景色，一直在不断地改变着，但是真实的外界景色，我们的眼识根本接触不到。虽然如此，也见到了各种不断变化着的景色，于是就以为是在不断改变的外面实有景色。其实，外面景色确实是在不断地改变着，因为色身在不断地移动，所接触的处所在不断地改变，景色就会不断改换，于是依止于外界景色而有的内景色，也就是影子，就要不断地改变。</p><p>但是身体为什么能从甲地走到乙地，为什么接触的处所能不断地变换，景色为什么要不断地改换，这里就涉及到了如来藏运作的秘密问题，那就恕不奉告了。因为外色尘的景色一直在发生改变，如来藏通过眼根会摄取各种色尘的微粒，传入到黑匣子里，在那里变起内相分影像。于是影像刹那刹那地在改变着，我们眼识看见的却是一点点地在变换着，并不是很快。</p><p>内相分的景色在一直的变换着，眼识意识就了别到了，意识心就会以为这一切景色以及景色的变换，是这样的真实。其实这些影像与外面的相对真实的景色是一致的，几乎是一模一样，我们分不清楚真假和里外。就像一个立体的球幕电影一样，屏幕上的人事物，我们看着也是觉得真实，看着屏幕里的人，拿着刀过来，我们下意识当中，就想躲开，可是冷静比对一想，就想起来这不是真的，于是就坐于原处继续看电影。再看屏幕里面的车开过来时，下意识还是想躲开，这是意根执相的习气使然，意识心的冷静分析比对还是不能起太大的作用。</p><p>而黑匣子里的内相分影像，也都是像球幕电影一样是立体的，我们就感觉很逼真。有时电视里演到情景比较危急的时候，我们也是很当真的，比如看到一个人在被另一个人追杀时，心里也是很着急；在紧急关头，我们会手握拳，身上出冷汗，身体会绷紧，有时明知道是演戏，却还会入戏，何况在日常生活中我们并不知道，接触的一切法都是黑匣子里的影子，那就更要当真了。</p><p>（二）从甲地到乙地的一路上，我们耳识所听的声音，都是黑匣子里的声音。这些声音一直在变换，不断的变换着。为什么变换呢？因为外界的声尘在不断的变换着，因为有生住异灭的现象，外声尘的存在跟内影像比较起来，也是相对的真实，绝对的真实法只有如来藏。外面每一个处所，都会有人畜、车马、风声，以及各种物体所发出来的声音，我们每走到一处，这些声音都会通过耳根，不断的传导到胜义根里，形成影像，外界色尘如果变换了，内界的影像也就会跟着发生变换。</p><p>我们听见以后，就知道了这地方有这种声音，那地方有那种声音，还会觉得这些声音是如此的真实，声音传过来的方向也是如此的真实；知道这是南边传来的风声，那是北边传来的说话声，这是东边传来的汽车声，那是西边传来的狗叫声。在这个地方，所有的声尘会传过来，然后走到另一个地方，所有的声尘也会传过来，接触的声尘在不断的变化着。</p><p>那么外声尘肯定是一个一个的要不断出现的，我们耳根是要一个一个的缘过去，或者同时都能缘到。缘到以后，如来藏就在黑匣子里变现出内相分的声尘，而且方位也要变现出来，粗细的程度也要变现出来，与外界几乎一模一样。意识就以为自己听的声音就是外面的某处实质的声音，以此错知错觉就熏了意根，让意根以为我听到了真实的声音，这些声音都是真实的，于是就指挥意识种种分别计较，不断造作身口意业行。</p><p>其中法尘境界要远远多于声尘境界，意识的了别就要远远多于耳识的了别。可见，没有意识心的了别，耳识就没办法了别声尘，二者相依相靠。我们听到的声音都是在黑匣子里，这一路上各种车马人畜的声音，宇宙的声音，动物的声音，风的声音以及人说话的声音，都是如来藏从外声尘上传导过来的，这样就形成了黑匣子里的内声尘，我们了别的就是黑匣子里的所有声音。</p><p>（三）一路上所嗅闻的香尘气味也是这样，经历的地点不一样，每个地方所散发出来的气味就不一样。那就说明外香尘一直在发生着转换，香尘会通过鼻根传导过来，进入胜义根里，形成内香尘，成为了黑匣子里的影像。这样鼻识和意识就嗅到了内香尘，一个气味一个气味不断的传过来，走过的地点不同，传过来的气味也不同，我们嗅到的气味（香尘）也不同。</p><p>但是我们感觉到的气味和外界的一模一样，非常鲜活和立体，就认为我嗅到的就是外边实质的香尘，它是这样的真实。从某某处传过来的，从饭店传过来的，从花上传过来的，从树上传过来的，从某个人身上传过来的，好像都是真实的物质气味，其实都是黑匣子里的内香尘气味，是虚幻的。</p><p>（四）口腔吃东西时，随着饮食的外味尘变化，我们的舌识与意识所感觉到的内味尘也在不断的变化，于是就认为我吃到了真实的食物，尝到了各种真实的酸甜苦辣味，感觉一切好像都是真实的。其实也都是黑匣子里的内味尘，都是影子。我们觉得影子很真实，是因为它与外味尘是一样的，都是活泼泼的非常立体的，从来都感知不到它的虚假性。</p><p>（五）我们身上所感知的触尘，这一路上微风的吹动，和煦阳光的照射，还有其它方面的触尘，一直都在发生变化，而我们感觉的也都是黑匣子里的内触尘。因为外触尘一直在不断的变化，随着阳光的推移可能越来越温暧，或者温度越来越低，越来越凉爽。这地方是微风，另一个地方的风稍微大一些，再一个地方没有风；手或者触到花上，或者触到树上，或者触到什么物体上，这些外触尘不断地在发生着变化。</p><p>每一种触尘都会通过身根传导过来，进入胜义根里，如来藏再摄取胜义根里的四大，变出一个个的内触尘，就成为了黑匣子里的影子。我们身识和意识对影子的感受，就会不断地发生变化，觉得自己身体的一切感受是这样的真实。热时会脱掉外套，凉时会加一件衣服，累时会休息一下，休息好了，又会接着走路。虽然身识和意识感觉如此真实，但是这些触尘毕竟是黑匣子里的一个个影子，依外触尘的阳光和微风而有，并不真实。</p><p>我们所了别的所有境界相，确实都是在黑匣子里，所接触的一切六尘法，全部在胜义根里。因为外界我们接触不到，外界一切境界，都是粗重的四大组成的物质色法，六识不能接触到，心法不能触粗重的色法，只有如来藏能够触粗重的物质色法，因为这些色法都是如来藏用四大变造的，如来藏摄取物质的四大微粒，来变造更微细的四大色法。</p><p>身识不能真正接触到外界触尘，不能接触到土地，因此也不能真正地从甲地到乙地。身识不能真正的在甲地，也不能真正的在乙地，不能真正的做什么。它所了别和作用的一切法，都是胜义根里的内触尘，所接触的甲地和乙地，所有地方都是胜义根黑匣子里的影像。外界相对真实的土地、阳光、微风、花草和树木，只有如来藏能接触，但是自己却觉得就像真的接触到、真的感知到了一样。</p><p>（六）六识所对的法，左一个境界，右一个境界，都是自己的如来藏二次变现出来的，依外境界如镜现像般地显现出来。而意识心单独了别的内容，是如来藏直接依据业种变现出来的，比如回忆某人某事，幻想某事某物等等，继而生起苦乐舍的感受。所以我们走路，这一路上好像走了很远的路，从甲地到乙地，从南到北，从东到西，其实我们并没有离开如来藏半步，双脚也未踏着一寸外界的土地，都踩在外界土地的影子上，或者说踩在二次虚幻的土地上，身体也未动须臾，都是如来藏自己在玩转自己，没有一丝外法可得。</p><p>我们好像在接触着一切法，好像观看了一个又一个的风景，听见了一种又一种声音；好像嗅到了一种又一种的花香儿，以及空气当中散发的种种气味儿；好像感受到了一缕又一缕的阳光，一丝又一丝微风的吹拂。种种境界一种一种不断地变化，其实不管它如何变，千变万变，都是黑匣子里的影像，不离黑匣子之中。</p><p>外边相对真实存在的境界发生改变了吗？外边的境界也在变化不停。一个色尘接一个色尘不断地出现，一个声音接一个声音不断现起，一种气味又一种气味不断地扑鼻而来。因为外境界不断改变，内境界才会随着发生转变，六识就要不断地接触、了别、感受，六识识别了别的就是这些二次变现出来的境界。所以说黑匣子里的内影像是依据外界之好像真实的相而来的，没有外相分，就没有内相分。</p><p>（七）外相分的场景肯定要发生变化，只是我们的身根五根能不能缘得到。比如在某处确实有外色尘的一座山，但是我们的眼根根本就贴不到那座山，不能与那座山实际接触，那座山也不能到眼根当中来，而我们却能看见那座山，这件事说起来也真是奇妙。同理，声尘在远处某地响起来，比如雷声和鸟叫声，这些声音也没有与耳根相贴近，却清楚地听到了雷声和鸟叫声，这件事也是很奇妙。</p><p>在忉利天顶上悬着的圆圆的太阳，与我们身体的距离是那样的遥远，但是我们的身根却能常常感受到太阳光辉的照触，实是不可思议。遥远的栴檀香，与我们鼻根的距离是那样的远，可是我们的鼻识却照样能够嗅得到栴檀香的香气，也是不可思议。六根并没有与实际的外六尘相接触，六识却能了别到六尘，这些事情都说明了什么呢？说明了我们六识接触到和了别到的，都是如来藏依据外尘变现出来的内尘，是外尘的影像，是黑匣子里的影子，不是真实的境界相，是如来藏二次变现出来的假相。</p><p>（八）六识的现起各有各的条件，其中眼识与耳识的现起，必须是眼根与外色尘有空间、有间隔，耳根与外声尘也必须有空间，如来藏才能传导物质微粒在黑匣子里，变现出内相分的色尘和声尘。而鼻根、舌根、身根没有空间的限制，有没有空间距离都可以，如来藏都可以传导物质四大微粒，变现影像，出生鼻识、舌识和身识，来了别黑匣子里的影像。就是说外眼根不能与色尘贴到一起，外耳根与声尘不能贴到一起。而外鼻根、外舌根和外身根，就可以与外香尘、味尘和触尘贴到一起，触到一起。所以外身根能够接触到外触尘，但是内五根却永远不能接触到外五尘，五识六识也不能接触外六尘。</p><p>身识不能触到外触尘，身识所触、所了别的一定是内相分的触尘，是外触尘的影像，不是相对真实的外触尘。比如手可以摸到花草树木，但是手上身识感觉的一定是花草树木的影子，是黑匣子里的影像，不是真实的外触尘。同理，外身根可以接触到外相分的床和椅子，但是身识感觉到的一定是黑匣子里的内相分的床和椅子，是影像。这个地方非常不容易理解和想明白，身识意识非常容易地错把感觉到的一切触尘当作真实的触尘。</p><p>（九）我们坐在这个地方（甲地），远远的乙地有没有色尘、有没有声尘呢？有啊，远远的乙地有各种色尘，有各种声尘，但是我们的眼根和耳根缘不到。五根缘不到的，如来藏就不能变现出对应的内相分影尘，六识就不能了别，也就是说，有根无尘，就不能出生能了别的识，也就不能了知尘色了，但是不妨碍意根知道。等我们到了乙地，眼根和耳根能够缘到这些色尘和声尘，如来藏就依眼根和耳根，摄取外色尘和外声尘的四大微粒，传导到黑匣子处变现影尘，变现出黑匣子里的内色尘和内声尘，我们就看到了乙地的景色，听到了乙地的声音，六识就了别到了乙地的六尘境界。</p><p>我们从甲地走到乙地，这一路上，身体动没动呢？外身根好像是动了，两只脚接触着一处一处的地面，不断地变化着，带动整个身体在不断地前行。外面的景色动没动呢？表面看好像都移动了，实际上是有动也有没动的。地面好像在不断地向身后移动过去，实际是不动的，只是与身体比对出来的一个假相。楼房树木好像是一个个不断靠近自己，然后又向身后移动，远离自己，实际并没有动，也是与身体比对出来的假相。空中飞鸟是动的，开着的汽车是动的，但是这些动与不动的景象，都是黑匣子里的影像，并不真实。</p><p>这一切法的动，都是一种虚妄相，都是在黑匣子当中的生灭变异的假相，都是四大种子的生灭变异而已，从不出如来藏之外。比如说地面的动，地面本不会动，它是固定的，只是我们意识心有一种错觉，错误的感觉地面在一点点移向自己的身后，错误的感觉楼房树木在一点点地靠近自己，又一点点的移向自己的身后。类似这种错觉极多，众生无始劫以来，就是活在各种各样的错觉当中，从来没有真正觉悟过。</p><p>（十）我们最严重的错觉，就是把一切法都当作真实，把黑匣子里的法，当作外界相对真实的法，把外界的法当作实有的法，于是无始劫以来就贪执不舍。也把自我觉知性，当作真实的，执著不舍，于是业行不断，苦恼不断。我们所能感觉到的一切，都是黑匣子里的法，觉知就是在觉知黑匣子里的法，就是在黑匣子里觉知。我们生活的天地，实质就是这么大，一切法看起来好像是都在动，实质上并没有动，静悄悄地，空无一片，都是如来藏。</p><p>比如我们临终往生极乐世界，色身真往生了吗？真到极乐世界了吗？真有外界的阿弥陀佛让我们见到吗？我们接触到的极乐世界整个景像，整个六尘境界，都在我们胜义根黑匣子里，外法我们接触不到。所以祖师说：“往生，生则是生，去则不去。”这里有很多秘密的法则存在。极乐世界也是我们黑匣子里的内相分，是影尘，我们六识接触不到相对真实的外界极乐世界，外界实质的那个极乐世界，只有我们的如来藏能够接触。</p><p>同理可证，我们坐在汽车上，也是如此。只不过比走路时多了一个汽车，我们身体坐在汽车里，多了一个汽车的运转，其实这一切的运转都是一个大秘密。我们虽然感觉坐在汽车上，其实也是坐在黑匣子里胜义根处的那个汽车影子上，坐在那个影子里面，我们感觉的那个影子是假相。我们看到的汽车，也是黑匣子里的影像，我们感觉汽车一直在开动，一直在移动，那也是看到的黑匣子里的影像的变换，内相分的汽车影子一个一个的在运转，在运动，其实，运动也是一种假相。</p><p>同理，我们坐飞机、坐火箭都是这个道理。无论是看飞机的形、听飞机的声、身触手触飞机的座椅、嗅飞机里的气味，都是黑匣子里的影像，没有真正的飞机让我们接触到。我们都是乘坐在外界相对真实的飞机的影子里，乘坐在胜义根里的飞机里，乘坐在黑匣子里的火箭里，只要能接触到的，全部是黑匣子里的影像。</p><p>那么外界有没有发生改变呢？外界的境界也在一直改变着，我们坐在飞机上，与外五根对应的一切六尘境界一直在不断快速地改变。景色在不断快速地变换，声音不断的传过来，各种色尘、各种声音、各种气味不断地传过来，也不断地消失和变换。因为外六尘在不断地发生着改变，所以我们接触到的内六尘就要随之不断地发生转变，不断地发生变化。这样我们所接触的一切变化的六尘，都是一个虚假相，仅仅是个影子而已。实质上我们动没动？我们并没有动，都在黑匣子里活动，六识一直在与黑匣子里的影子相触，一直在了别黑匣子里的影子，所有的六尘境界，也都在黑匣子里不断变化，识心也就只能接触黑匣子里的各种境界，我们所了知的广阔的世界，都在这里。</p><p>（十一）不但看到的色尘、听到的声音都是内相分影像，都在黑匣子里，我们身体所感受到的一切，也都是内相分影子，身识所觉知到的，以至于意识所能够觉知到的都是内相分影子，都是黑匣子里的六尘境界，都是第八识所变出来的影像，都是虚幻而无实体的。比如身识所觉知到的，坐在床上的时候，知道床是软还是硬，坐在沙发上，知道沙发是软还是硬，身体感觉是否舒适。这些触尘我们觉得是真实的，其实都不是真实的，都是在对影子进行分别，都是在黑匣子里进行的活动；而外相分的床、沙发和软硬的触尘不在黑匣子里，只有第八识能接触到。</p><p>比如脚受伤的时候，如果把后脑勺那里，负责传导身根触尘的那段传导神经掐断，身识就感觉不到疼痛。即使脚完全断掉，身识也感觉不到，也不觉得疼痛，而这时也没有身识的存在。因为后脑勺那里传导神经断了，外触尘不能通过这里的身根传导神经来传导，第八识就不能在胜义根黑匣子里变现出内相分触尘，也就不能产生身识和意识，来了别脚部的任何情况。因为没有身识和意识，就不能了别这里的触尘，因此就没有对于脚部的痛觉感受。</p><p>身根触尘通往胜义根的通道，其中一个就是后脖颈那里的部位，这个部位如果不小心弄断了，整个身体就会瘫痪，脑袋也就会耷拉下来，头部就伸不直了。如果大脑胜义根坏了，外六尘的通道就会掐断，第八识就不能产生相应的内相分影尘，六识就不会现起，也就了别不了六尘，身口的行为也就没法再产生出来，只有独头意识微弱的了知，在维系着生命体的存在，但也许维持不了多久。如果外眼根坏了，就不能接受外色尘，如果内眼根（也就是眼的胜义根）坏了，就不能在那里形成内色尘，这样就不会有眼识生出来来了别色尘，那就不能见色了。同理，其它几根也是这样，所以我们了别的是黑匣子里的内相分影子。</p><p>（十二）人只要能活着，其胜义根黑匣子的毁坏就不能是全部的毁坏，只能是部分毁坏。如果是全部毁坏，内五根就都不能用了，五尘都不能生出来。那样不仅五识不能现起，意识也不能现起，不能了别五尘上的法尘。这样意根就知道身体五阴不能用了，祂肯定要决定离开色身，重新寻找新的色身，来供自己使用。正因为胜义根不是全部毁坏，还留一部分能用，所以人才成为植物人，才能成为瘫痪病人。</p><p>我们如果仔细观察植物人，就会发现，植物人的身体还能出现一些活动，有一些感觉，因为这样，意根就认为这个身体还能将就着用，祂就不会离开色身。意根无始劫以来一直贪爱着色身，因为贪爱色身就不肯舍弃，实在没办法时祂才会舍弃。这些事例说明，我们所了别的六尘就是胜义根黑匣子里的影像，是外界六尘通过传导神经传导过来而形成的内相分，并不真实。但是仅仅知道不真实，其意根的执著惯性却很难改变，需要我们修习相应的定力，通过不断的仔细的观察，慢慢的让意根证得这些法的实质性，这样就会渐渐地降伏意根的我执而得解脱。</p><p>（十三）黑匣子就是戏台</p><p>在一切变幻的境界里，其实我们的心从来都没有动过，哪里也没有去，一直都在黑匣子里观看种种境界的来来去去和莫测的变幻，同时做着不着边际的应对。就像动画片和影视画面中，并没有景色和人物的动止，只是众多图片快速的投影播放而已。同理黑匣子里的心识和境界都没有动和止，只不过是种种图片画面快速的闪现而已，其导演者是意根，制片人是如来藏，六识是演员和观众。所以我们观看的都是动画片，都是戏剧，没有真实可言。其观看的五蕴行为也是被导演出来的，导演让六识如何就如何，然后导演也是不由自主的，顶多是个戏头而已，戏终曲尽也会退出舞台。</p></div>"
},{
    "title": "第三章 我们的生老病死就发生在黑匣子里",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  我们的生老病死就发生在黑匣子里</strong></p><p>一、黑匣子里的生</p><p>首先来谈黑匣子是如何出现的，既然黑匣子处于大脑胜义根处，属于身根的一部分，那就是随着身根出现和出生的。身根是第七识与第八识投胎在母胎中逐渐形成的。当第八识在母胎中变造身根到四个月左右的时候，大脑胜义根的雏形基本上就具足了，于是黑匣子形成了。</p><p>这时候胎儿的外声尘和触尘能够通过胎儿的耳根和身根传导到大脑胜义根的黑匣子里，成为内相分的声尘和触尘，与黑匣子里的耳胜义根和身胜义根相触，耳识、身识和意识就出生了，之后就能了别到母腹中的声音和母腹外的声音，以及母腹里的冷热和自身的触、痛、挤、压、。其实胎儿识别的这些法都是自己胜义根黑匣子里的信息，不是母体里和外的信息，也不是胎儿自己身体的外尘，都是胎儿胜义根里的内声尘和内触尘。</p><p>当胜义根再进一步发育完善之后，香尘、味尘也会通过浮尘根的鼻根和舌根传导到鼻胜义根和舌胜义根，成为内香尘和内味尘，与胜义根中的鼻根和舌根相触，出生鼻识和舌识，以辨别母腹中的香尘和味尘，其实是胎儿自己黑匣子里的内香尘和内味尘。胎儿的黑匣子里有没有内色尘呢？有内色尘，但是根尘相触却不生眼识，看不见内色尘。为什么？因为在母胎里没有光明，眼识的产生需要九缘，光明是其中之一的缘。</p><p>当胎儿的身根发育完整圆满，胜义根也发育圆满，黑匣子功能具足，十月足胎，就从母胎中出生了，成为一个婴儿。婴儿出生以后刚开始还是睁不开眼睛，适应几天才能睁开眼睛，模模糊糊的看见自己黑匣子里的内色尘。这时候婴儿的内六根、内六尘、内六识十八界具足，人相具足。</p><p>二、黑匣子里的老</p><p>黑匣子是随着色身的逐渐成熟而不断成熟的，外五根随着年龄的增长，不断的成熟，进而老化僵硬退化，黑匣子里的五胜义根也随着年龄的增长而逐渐衰老和退化，四大种子不断的更新，五胜义根的功能作用由最初的娇弱，到强大，再到僵硬退化。其中五根的传导神经逐渐不灵敏了，传导的四大微粒逐渐减少和扭曲变形，六识辨别内六尘就会缓慢，了别逐渐模糊不清，反应迟钝。  </p><p>六识了别出来的自己身根的情况，不是自己原本色身的情况，而是原本色身在胜义根黑匣子内形成的影像，是种种电子原子中子等等微粒的组合体，是虚幻的假体，不是原本的真实体立体物。因此根本不必去执色身，这些仅仅是生物电信号组合罢了，没有身体和身根五浮尘根。如果有真实的色身，就不应该有种种神通如穿山入水等等。</p><p>三、黑匣子里的病</p><p>所谓的病，就是四大违和，地水火风不调和，组织机构发生了变化，致使色身基本粒子发生变化，身根等五浮尘根出现病变，包括五胜义根有可能出现病变，也包括黑匣子里的内相分五根出现病变。而众生六识所感知的病变都是黑匣子里的病变，不出黑匣子之外，因此是虚病假病，不是真病。如觉得眼睛疼，不是浮尘根脸部的眼睛疼，而是感觉黑匣子里的眼睛的影像疼，一个影像哪有什么疼不疼的，都是电信号而已。同理感觉肌肉疼骨头疼，都不是浮尘根身体的疼，都是感觉黑匣子里的电信号疼，电信号有什么可疼的，影像有什么可疼的，错觉而已。</p><p>即使感觉头痛，也是黑匣子里的由电流信号组成的假头痛，哪有什么真痛。肩膀上的头并不痛。六识的感觉都不可靠，因为都是对虚相和假相的觉，都是对黑匣子的电流信号的觉，觉的都是变幻莫测的虚拟情境，那觉后的受又有何真实性？受与不受又有何差别？对着幻化的假相无论做什么，做与不做都是空，觉与不觉，受与不受，诸法本然，只是增加个人的生死系缚罢了，除此之外还有什么？</p><p>生病时，五根不痛，六尘不痛，六识痛吗？六识痛个什么，又没有尘性。生死就是大病，众生病得不轻，得治，用苦集灭道四圣谛治最有效。</p><p>四、黑匣子里的死</p><p>（一）老和病之后，四大严重失调，不可再调和起来时，身体就不能用了。如何不能用呢？身体的五浮尘根机能老化，无法正常接收和传递外六尘，神经传导系统老化，不能正常接收和传导五浮尘根过来的电信号，大脑以及胜义根黑匣子老化僵硬，无法正常接收神经系统传导过来的电信号，就无法把电信号整合起来以形成虚拟的与外相分相似的内相分内六尘。</p><p>胜义根里没有内六尘，六识出生的缘就不具足，六识无法出生了别内六尘，众生就会失去觉知的功能作用，意根失去了左膀右臂，对于一切法就无能为力了，就会决定离开身体，于是死亡进入中阴身里。</p><p>一旦黑匣子不中用了，根尘不触，六识就无法现起，身口意就不能出现，五蕴身的活动就会终止，意根觉得无所能为时五蕴身必然会死亡。可见，胜义根黑匣子是非常重要的，即使五浮尘根非常正常，传导神经也非常正常，而黑匣子不正常，意根就无法觉知六尘境界，就会无奈选择死亡，其实是被迫不是选择。</p><p>黑匣子为什么这么重要呢？就是因为黑匣子是一个场所，六根六尘六识交接的场所，是五蕴活动的场所，大千世界的内相分在这里能生成，六识在这里能生成，六识能接触和了别虚拟的大千世界，有认知，能觉受，能受用虚拟的六尘境界，俗语叫作活着，或者叫作生活。一旦不能活着，或者不能生活了，意根必然会再去重新寻找能活着之处所，开启新的生活。</p><p>（二）临命终时的感受</p><p>楞严经中讲，一切世间生死相续，生从顺习，死从变流，临命终时，未舍暖触，一生善恶俱时顿现，死逆生顺，二习相交。这里说临命终时未舍暖触，临是接近还没有过去的意思，就是还没有死亡的意思。既然没有死亡，至少有意识和意根的存在。而佛说未舍暖触，那就是还有暖触，就有暖触的觉受，身识也存在。这时候四大还没有分解，或者是刚刚开始分解，色身的一切觉受都存在，都能感知到，六识都在还没有灭去。这时候是什么感受呢？佛比喻众生四大分解时如生龟剥壳，那有多痛苦和疼痛？</p><p>既然这时候有感知，意识没有灭，独头意识也可以现前，独头意识这时候干什么？专门接收如来藏发出来的信息，如来藏把自己这辈子所造作的一切善恶业行，全部都播报出来，像放电影一样，而且是快速的播放，极快镜头，瞬间就能播放完，如来藏导出的速度极快。对于意识来说就像快速回忆一样，也容不得独头意识想什么，只接收就行了，然后意识马上就明白了，知道自己要随着这些业行去向哪里，但是已经没法告知身边的人了。临命终时意识虽然有些昏昏沉沉，但是对于如来藏硬塞给祂的录像内容，仍然能非常清晰的作以了别，清清楚楚，而且还能判断出来自己要到哪道里去受报，不用谁来给自己讲因果报应之理，完全不用了。</p><p>临命终时意识和意根不得不接受后世的果报，这就是业力，一辈子业行的力量，不容意识反抗，也不容意根反抗，二者都要顺从业力的安排和召唤，没有怨言。即使在中阴身里受到阎王爷爷的审判，也不会申辩和诉苦喊冤叫屈。为什么？因为事实就摆在那里，大家都能清清楚楚的看到，不用阎王爷去调查取证。在事实面前，还能有什么话好说？乖乖服从阎王爷的安排，服从命运的安排。命运如何形成的？命由我造，自己造的业，当然要由自己来承受，不然怎么办？谁替你承受？亲爹亲妈亲儿子也没办法替你承受，各人业各人受，谁也替不了。</p><p>（三）世间什么是最平等的</p><p>如果因果属于这个世间的话，那么因果是最最平等的，善有善报恶有恶报，时候一到，善恶报现前，躲不掉。有人说病毒最平等，不管贫富有权势无权势，不管男女老少，都可以染上病毒，可是有的人就不会感染病毒，也不会生病。死亡却不一样，不管什么人必死无疑，有四禅定的人可以延长寿命，可是终究还是灭去了五阴身。佛陀可以住世几大劫甚至无量劫，可是终究也要退位，离开自己建立的国土。</p><p>人的一生可以拥有一切，可是死亡之后，一切都没有用了，金钱、权利、地位、名誉、知识、学问、眷属、家庭等等，对于死亡这件事来说，都无济于事无可奈何。这时候来观察，除了一辈子所造作的善恶业能随心带走，能受善恶业报，其它的都受用不了了。所以我们应该知道，智者在世俗中生活一辈子最应该追求的是什么，什么最能带给自己福利，什么能带给自己痛苦和贫穷下贱，什么永远也得不到带不走。</p></div>"
},{
    "title": "第四章 黑匣子里的错觉",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  黑匣子里的错觉</strong></p><p>一、时空的错觉</p><p>（一）时间是虚妄不实的法</p><p>时间是心不相应行法，是虚妄的，不是真实存在的法。时间为什么是虚幻法呢？我们这一生半生的时间，是根据什么计算出来的？五蕴身心经过一年时间的运行，叫作一岁。一年三百六十五天，一天的时间是根据太阳的运转而设定，或者说是根据地球围绕太阳运转而设定的。一天的每个时辰，是根据太阳光投射到地面的角度而设定的，或者是根据在太阳光下物体的影子长短而设定的。而地球是假法，太阳以及光是假法，地面物体是假法，影子是假法，这些假法和合起来，能得到真法时间吗？显然不能。  </p><p>这样显示出的时间，比那些物质色法还假，与自己的心不相应，不管心怎么样，这些假法就是要有规律的运行，一天时间都要流转过去。一天一天的时间累积，就累积成了一年时间，一年一年时间的累积，就累积成了十年，再累积就半辈子过去了，再累积就一辈子过去了，生命结束。所以时间也叫作光阴和时光，以太阳和物体为主显示出来的虚假相，其实没有相，什么相也没有。每个人还掰着手指头算，怎么算也没有时间这个法存在，都是错觉、误计、虚妄分别、戏论。  </p><p>时间也代表心识的运行变化过程，一个心念一个心念，一个行为一个行为，往下运行，前后相续就显示出时间。心念不真，行为不真，相续相假，时间也就不真。把时间空去，把空间空去，把物质色法空去，我们的心就轻松多了，没有压迫感，没有紧张感，悠然自得。再把身心空去，自我就解放了。</p><p>（二）空间的划分</p><p>空间是依物质色法来划分的，比如一个房间与另一个房间就是两个空间，以墙壁屋顶和地基来显现出房子的空间，以及房间之间位置的不同。又比如两个国家的空间的划分，是以地面上的地理位置、面积、方圆来划分；一个三千大千世界，一个佛国土，是依三界宇宙器世间来划分。而不管是墙壁、泥土、砖瓦，还是房屋、田宅、山川、大地，以及宇宙星空，三界的器世间，都是如来藏输出的四大种子所形成的物质假相，本质是虚幻的，非为实有，物尚不有，何况还有空间。</p><p>比如甲地和乙地是两个空间，两地之间的距离是以米、公里等等距离单位来测量计算的，米和公里的测量单位，都是依据物质人为规定的，而这些物质都是四大组成，由如来藏变造出来的，非是实有，因此测量单位也不实有，那么甲乙两地的距离、空间也不是实有，乃至于甲乙两地也不是实有，全部虚幻。</p><p>又比如宇宙当中两个星球，是两个空间，之间的距离是以光年来计算的，光年是光一年时间所经过的距离，光的速度是每秒三十万公里。这里涉及到了光、时间和公里，公里已经分析过了，依物质而有的，是虚妄的；时间也是依物质而有，物质不实有，时间也就是虚妄的；再看光，它也是一种物质色法，由如来藏输出四大种子变造出来的，本是虚妄，光经过的时间、距离、光速就是虚妄的，那么星球之间的距离、空间就是虚妄的。</p><p>（三）距离的虚妄不实性</p><p>面前五米开外有一盆花，这个距离是什么境？真实吗？根据什么判断是五米距离？花盆是大脑胜义根里的，自己的身体是胜义根里的，本没有距离之说，都是带质境和性境，中间的空间是胜义根黑匣子里显示出来的。然后意识根据这三者，判断出五米的距离，是根据色法，显示空法，再判断空法。</p><p>可实际上三者都在胜义根里，没有间隔和距离，意识判断得出的结论，犹如龟毛兔角，连影子都抓不到。大脑胜义根里的距离，是如何判断的呢？根本没有距离和空间。判断距离要有参照物，参照物是假、虚幻，距离更是假和虚幻。</p><p>（四）空间是如来藏出生和显现出来的      </p><p>距离是以物质和时间来混合划定的，物质虚妄非实有，时间虚妄非实有，距离就虚妄非实有；空间是色边色，没有色相的地方叫作空间，其实并没有空间，只是一种衬托法，是识心虚妄的感觉而已。如果空间、虚空、距离是真实的，那么大神通者如诸佛菩萨，是不会弹指顷，一念间就能到达无数诸佛国土。佛在楞严经中说：虚空生汝心内，如片云点太清里。意思就是说，虚空虽然无量无边的广大，但是它在我们如来藏心里，就像一片云彩悬在虚空中一样，虚空就是这样的渺小和虚幻不实。</p><p>这说明虚空也是如来藏所出生和显现出来的，并不是实有之法。佛在楞严经中说过，虚空是虚妄的，是假法，是色边色。比如一座山，有山的地方就没有虚空，如果把山挪走了，虚空就出现了，把山再挪回来，虚空又消失了。这说明虚空是相对于物质色法而说的，由色法所显示。因此时空是错觉，纠正了错觉，就是正觉。正觉者就是正常众生，就是佛和菩萨，错觉者就是迷惑颠倒众生，不是正常人，彻彻底底正常的人就是佛陀，而众生不正常的程度各个不同。</p><p>（五）我从甲地走到乙地，用了一个小时的时间，走了八里地。中间经过了山川、河流、田地，经过了一个路标又一个路标。首先时间是依据太阳的光照来划定的，非是真实；其次经过的路标，是物质色法，非是真实的；再其次，我的五阴身本非实有，五阴的活动，非为实有，我的腿脚并没有真正地抬起过，也没有真正地走动过。</p><p>这一切的时空、地点、人物，没有一样真实，就这样构成了虚幻的我，从幻化的甲地，虚幻地走到了幻化的乙地，这件事情就虚幻地完成了。没有时间，没有空间，没有山川、大地、河流、田野、树木、房屋，没有我的五阴身，也没有虚空。只有我的如来藏自己在玩转这一切，就是如此！在出世间那里，根本就没有时空，时空是世俗法，而世俗法没有一样是真实的。</p><p>我在梦里，从一个佛国土飞到另一个佛国土，可是醒来以后，我发现，我这一夜都在床上，没有移动一丝毫。我们众生正在生死大梦当中，广造无量业行。等到我们成佛的那一刹那，从大梦当中醒来，就知道我们什么都没有做，什么事也没有；梦里的一切都不算数，尽管杀死过无数的众生，其实一个众生都没有杀过。当我们成佛，从生死大梦中醒来时，一切事都没有发生过，没有时间，没有空间，没有梦中的一切人事物理。</p><p>只有醒来，我们唯一要做的事情，就是想办法，尽快从生死大梦中醒来！然后就什么事也没有了，这有多好！在佛的眼里什么事也没有，在我们的心里都是事，什么事都有，因此我们就是颠倒众生，与佛是一百八十度的颠倒，佛在南，我们却朝北。颠倒众生，看见什么都当真实，什么战争、什么仇恨、什么民族、什么国家、什么正义、什么邪恶……还是赶快醒醒吧！不要再做梦啦！</p><p>二、火把变火圈的错觉</p><p>看见了燃烧的火柴头，有一种受，如果把燃烧的火柴头快速摇晃，形成了一圈火线，你会有另一种受，见相不同，感受就会不同。看见一只火把是一种受，快速地摇动火把形成一个火圈，此受就会变得更强烈更惊心动魄。不管哪种受，观行它，深刻的剖析它，就会知道，原来是虚惊一场，妄受一气，有何凭据？被镜子里的火搅动得心不平静，被屏幕里的险情吓得惊恐万状，哪里有什么实事？</p><p>外尘燃烧的火柴头，无论怎样快速摇动，永远都是一个点，一个火柴头，绝不会形成小火圈，就像一个人在圆形的跑道上跑步一样，无论跑得有多快，永远是一个人在跑，不会有众多同样人围绕着跑道跑而形成圆圈。但是如果观看者视力出现问题，跟不上人跑的速度，就会出现视觉障碍，先前人影未灭，后来的人影又出现，如此后后人影也不断出现，他就会看到有众多人围绕跑道一圈在跑步。</p><p>外尘火柴头的微粒进入黑匣子里的时候，同样也是单个的火柴头，不管外尘火柴头摇晃的有多快，在黑匣子里一个时间点和位置只有一个内尘的火柴头，不会有众多的火柴头聚集成圆圈。那为什么识心所见却是一个火圈呢？这是视觉暂留现象，过去的影像还在识心中，新的影像又不断出现，按照前后次序，就好像看到了火圈。即使是见到一个火柴头也是不实之见，也是错觉，何况见到众多火柴头形成的小火圈。</p><p>三、球幕电影的错觉</p><p>六识了别黑匣子里的内六尘，认为种种尘境非常立体骨感而显得很真实，丝毫感觉不到尘境的虚幻不实。就像人坐在球幕电影院里观看球幕电影一样，感觉屏幕的景象非常真实，看见屏幕上的飞机好像要从自己头顶飞过去一样，看见尖刀马上要刺向自己的心脏一样，看见子弹眼看就要飞向自己的额头一样，看见棍棒好像马上就要打到自己身上一样。</p><p>总而言之，不管看见什么都感觉特别真实，就像自己身临其境似的，当然也包括听的声音。可是我们理智下来，知道屏幕里没有一样法是现实存在的，而且屏幕里也没有实物，不过都是现代种种技术信息的合成而已，骗取了我们感官的信任，种种生心种种觉受，还感觉刺激和过瘾，还感觉恐惧和惊吓。</p><p>我们所见的六尘境界也是如此，黑匣子就像球幕电影院，六识坐在黑匣子里，观看黑匣子里的六尘境，觉得一切境界都特别真实，境界是那样的骨感、立体、鲜活，简直让人爱不释手，或者恨之入骨，自己确实是身临其境，处在种种境界之中，与境界不可分离。实际上这些境界和球幕电影里的情景是一样的，都是虚拟出来的，信号组合而已，无有其事。</p><p>四、折射原理说明见色时的错觉</p><p>眼见色需要光亮，光亮是见色的条件之一，没有光就不能见色。光起着托显色尘的作用，只要色尘处于光源之中，就能把色尘托显出来，然后如来藏把色尘上的四大微粒摄取下来再传导到眼的浮尘根处，进而再通过神经传导系统传导到黑匣子里，而眼识所识别出来的色尘等六尘境界都是虚妄的影子，与原六尘境界有一定的差别，黑匣子里的六尘不是外边实质的尘境，是幻化出来的镜子中的像。</p><p>用折射原理就可以说明眼识所见的黑匣子里的色尘不是外边真正的原色尘，而是发生变化了的相似于原色尘的色，不是真色。光的传播有一定的速度，在不同的介质中传播的速度不同，因为不同的介质其物质结构不同，阻力就不同。光经过两种介质的时候，在介质的交界处传播方向改变，就会发生折射现象。在介质交界处正好有色尘出现，光在此处就会把色尘托显出来，在两个介质中所托显出来的相就会发生改变。</p><p>比如空气和水两种介质，对于光传播的阻力不同，光从空气中传播到水里，传播方向就改变了，托显出的色尘就要改变，而色尘本身并不发生改变。比如说筷子插在水中一半，光把空气中的筷子和水中的筷子分别托显出来，位置发生变化，眼识就看见筷子是弯折的。这个弯折的现象，是在胜义根黑匣子里出现的，还是在传导到眼根之前的外相分和本质境那里出现的？</p><p>如果外色尘本质境的筷子弯折了，把筷子再从水里拿出来，筷子是不是弯折的？本质境的筷子无论在什么介质里，都不会发生变化，否则从介质里拿出来就会变样了，实际上不会变样，与从前一样。筷子弯折的现象是如来藏依本质境变现出的外相分带质境开始出现的，一直到胜义根里的内相分为止。所以眼识看不到真相，意识也见不到真相。</p><p>黑匣子骗不骗人？眼识骗不骗人？你还相信自己的眼睛吗？相信你所看见的都是真实的吗？相信你六识了别出来的一切法都是真实的吗？还自信吗？还每天说东道西的，这个对那个错，你真看明白了什么吗？亲眼见人偷东西，都未必是偷东西，人赃俱获那都未必是事实，人证物证那都未必是真证据，打你骂你那都未必是恨你，关怀照顾你那都未必是爱你，言语犀利未必是刻薄，雷霆万钧未必是狠毒。眼光不正，见不到真相，心光不正，就感知不到事实。</p><p>筷子弯折，实际上是光带给我们的错觉，筷子并没有弯折，是因为光传播方向改变了，衬托出筷子的相对位置改变了，实际上没有改变。如来藏把光衬托出来的两截筷子的影子传导到胜义根里，眼识意识就看到了弯折的筷子。</p><p>同样，阳光照射到水里，光束方向改变，把水衬托得很浅，实际上水并不浅，浅是眼识意识的错觉。光束也把水里的鱼所在位置衬托得很浅，以至于你按照那个位置抓鱼根本抓不到，鱼不在你的眼识意识所见的位置，而是在那个位置的斜下方，眼识见不到。</p><p>光明能带给我们错觉，黑暗同样能带给我们错觉，在黑暗中，总觉得有什么可怕的东西、不可预知的东西、掌控不了的东西，可能会侵犯自己威胁自己，实际上并没有什么，独头意识胡思乱想而已。</p><p>五、同样的色众生所见不同说明见色就是错觉</p><p>筷子插在水中，色界天人绝对见不到弯折的现象，因为色界天人生活在太阳之上，自有光明不需要阳光，见色就不受阳光的影响，不需要阳光的照明，当然就不会见到筷子弯折的现象。欲界天人也未必能见到弯折的现象，因为欲界天人不依赖大脑胜义根，不是活在黑匣子世界里，又由于其福德广大的缘故，见色用天眼见，天眼远远殊胜于肉眼，所见一切法都与天界以下的众生不同。况且月亮居于四天王天，太阳居于忉利天，忉利天以上的四层天没有日月，四层天的天人见色也同样不需要日月光明，也是用天眼见色，所见与人类根本不同。</p><p>比如说同样是见恒河水，天人见的就是琉璃，人类见的是水，鱼见的是宫殿和家园，恶鬼见的就是火焰，福德不同，业不同，眼不同的缘故。天人见人，狗见人，牛见人，马见人，蟑螂见人，所见都不同，感受和想法也不同，反应就不同。即使是人见人，所见也有差别，从男人的角度看女人，和从女人的角度看女人，所见就不相同，从小孩的角度见和从老人的角度见，所见也有差别。同样是人，由于个人福德不同，业障不同，对于同样一件事，所见也有差别，因此感受不同，想法不同，反应就不同，抉择也就不同。那么众生所见，有什么标准和真实性可言？都是虚幻不实的。</p><p>六、脑萎缩的现象说明黑匣子世界的虚幻</p><p>脑萎缩的临床表现分为脑组织机能衰退和认知障碍两大类，主要与脑萎缩发生的部位及程度相关。弥漫性大脑皮层萎缩意味着大脑皮层的视、听、嗅、味、触觉感知区以及语言、思惟、运动等功能区域发生了不同程度的器质性病变。</p><p>六识主要依靠以上区域对胜义根里的六尘境界进行了别，并产生身口意行。如果大脑皮层弥漫萎缩，在大脑胜义根中所生成的六尘境界就会出现扭曲与失真，导致六识的了别、认知及判断出现种种障碍与颠倒，从而使受蕴、想蕴、行蕴也发生错乱和异常现象，严重的甚至会伴有幻视、幻听、幻嗅、幻味、幻触等症状。明明没有的人事，却说为有；明明有的人事，却模糊不清，认知混乱。小脑萎缩往往会导致与言语、肢体有关的肌肉麻痹、收缩力减弱及运动不协调，从而产生说话语音不清、走路平衡性与震颤现象。</p><p>以上所说的大、小脑萎缩就是胜义根黑匣子发生了病变，黑匣子胜义根一旦出现异常，众生对六尘境界的认知就会产生障碍，致使身口意行进一步扭曲错乱，对生活质量产生严重影响。所以说众生就是生活在黑匣子世界里，了别的就是胜义根黑匣子里的境界，黑匣子就是众生的广阔天地。也就是说黑匣子世界是非常虚幻不真实的，是非常不可靠，也不可依赖的。</p><p>七、胜义根病变导致的障碍</p><p>胜义根处于大脑，是心法和色法相关联之处，胜义根四大不调和，小脑萎缩和大脑退行性病变能导致行动障碍、认知障碍、记忆障碍。因为胜义根老化和病变，心法六识就不能正常活动和出生，众生极容易死亡。大脑缺氧和萎缩，都能毁坏胜义根，障碍六识的出生和种种认知活动。人的生命极其脆弱，一口气上不来，就导致脑缺氧脑死亡，导致生命的终结。为什么练深呼吸容易得定？深呼吸能保证大脑氧的供给，对身体健康有好处，大脑通畅，六识心舒服了，不用去对抗和改变色身，才容易得定。</p><p>从这里可以看出，五阴功能是依他起性，不能自主。不能自立，非常的虚幻不实。依靠外界这么多条件才能有正常的五阴活动，缺少一个都不行，这样的五阴身极其不可靠，太不实在了，因此都不是我。众生所依赖的东西，都是不保靠的，如果能做到什么也不依赖，那就无所畏惧了。我们将来能修到不依靠外界任何环境条件就好了，生灭的东西对我们不能起作用时，五蕴身几乎就是长生不老的了，估计得到八地以上。我们应该追求常不变异、不需要外在条件的可靠的常法而依靠。</p><p>八、近视眼老花眼的错觉   </p><p>近视眼和老花眼，主要是与浮尘根有器质性蜕化有关，通过浮尘根传导进来的四大微粒有些许变形，导致在胜义根成的像变了形，不符合原貌了，眼识和意识了别出来的就是变了形的色尘，所以需要戴眼镜来纠正和弥补浮尘根的病变。楞严经中世尊讲过眼睛视网膜有障碍，有白内障的人，看灯光时，就能看见灯光中有圆影出现，实际上灯光中并没有圆影，别人就看不见，是眼病患者的视网膜上长出多余一点肉，遮障了外界色尘四大微粒的传导，在后脑的胜义根就出现一个黑暗处，那就是圆影，眼识意识看见的内色尘灯光，就有圆影，不是全部都是亮的。</p><p>闭目养神气定神闲，眼睛视物的时候，需要耗用气血，过度用眼就会使气虚血亏，人体脏器如肝肾等气血不足，出现亏虚，就会导致眼球疲劳胀痛，出现近视眼老花眼等等病变，视物不清，看文字等等需要辅助于近视镜老花镜。虽然有眼病的人视物模糊不清，但是其他正常人观看同样的物和文字等却是正常的，看得清清楚楚。所以每个众生所见的色，都是自己胜义根黑匣子里的假色虚色，不是外面的真色实色。</p><p>戴上眼镜之后，再见色就觉得清晰正常了，可是所见的色就更虚幻不实了。如来藏摄取外色尘的粒子通过空气传播到眼镜上，粒子与实际的外色尘有一定的差别，眼镜的玻璃片阻碍掉一部分粒子，再把色尘放大，成为一个假的相似的粒子排列组合成的幻相，再传导到眼的浮尘根上，粒子再被阻拦一部分，经过眼的玻璃体和视觉神经传导到胜义根里，成为比之前更假更幻的内色尘，显得比之前稍微大一些，眼识意识见之容易识别。所以六识识别的哪有真实可言，有什么必要去执著色声的好恶、是与非呢？</p><p>九、各种镜片的原理都是一样的</p><p>放大镜、凹凸镜、哈哈镜、显微镜也与近视镜老花镜是同样的原理，都是起到改变如来藏传导的外相分色尘的作用，再把这些镜子改变的色尘传导到浮尘根和胜义根里，这样的话，黑匣子里的内色尘就是经过了多道介质的作用而辗转变化形成的，那么众生通过这些镜片所见到的色尘，有什么真实性可言？与外界的本质境原始境界相差究竟有多大？有什么实质的相貌可触可用？</p><p>十、思惟问题：第一，近视眼老花眼不戴眼镜的时候，见的色如实吗？第二，各种镜片能带来错觉，戴上眼镜的时候，见的色如实吗？第三，眼睛正常的时候，见的色如实、真实吗？</p><p>结论：只要能随因缘而改变的，因缘变法就变的，这个法一定是假法幻法不实在的法，就要否定掉，不以为真，也不认为是我和我所。那么你还相信你肉眼所见吗？相信六识所知所觉吗？最后：自己所知都对吗？你还自信吗？再最后：你还认假吗？想认真吗？以后能认真吗？如何认真？</p><p>十一、独头意识对狂乱境界的错觉</p><p>参禅时，或者打坐修定时，意识专注在一个境界上，精力比较集中，对其他法尘或者六尘境界，没有作意。如果突然拍打或者大喝，意识意根都没有准备，就是没有作意，突然的声音出现就会受到惊吓，就会容易引起狂乱，意识发狂。</p><p>失心发狂的心是意识，独头意识了别的是狂乱境界，也是独影境，是非量了别和错乱了别。在外表就表现为不正常态，因为了别了不正常的狂乱境界，产生错误认知，行为就怪异。但对他自己来说，却是正常的，他自己认为是正常的反应。</p><p>十二、声音的错觉</p><p>甲说话的声音，乙在旁边听，丙通过电话听，丁通过录音设备听，戊通过金属管道听，己通过真空管道听，庚隔着墙听，辛隔着门听，壬通过扩音器听，这些人听到的声音有什么不同吗？为什么？声音经过真空传导，经过空气传导，经过金属传导，经过空管传导，耳识识别的声音就会有所不同。</p><p>声音属于四大物质色法，其传导要经过介质，没有介质就无法传导出去，介质不同，阻碍不同，其传导速度也不同，声尘的四大微粒改变也不同，导致声音不同。什么叫作阻碍呢？就是四大微粒在传导过程中有一部分不能通过介质，而被介质所阻挡或者吸收，那么通过介质那部分的四大微粒就发生改变了，形成的声音就会有所改变。中间经过的介质越多，距离越长，受到的阻碍越大，被阻挡的微粒越多，声音越变质。</p><p>声音传导的终极目的地是胜义根黑匣子，每个人的耳根传导神经和大脑营养物质都有区别，对进入胜义根的声音影响也不同，所以每个人听到的声音是有一定的差别的。这就说明了我们所听见的声音并不是真实的，其实并没有什么叫作声音的东西，只是一大堆电信号和信息而已，我们都活在一个虚拟的信息世界里。</p><p>十三、声音是如何产生的</p><p>说话的声音是如何发出来的？有的人一天嘴不闲着，总是说说说，不说就难受，有的人一天一句话都不说，也不觉得憋闷。说话发声与一个人的内心觉观有关系，觉观出自思惟，内心经过思惟，产生觉观觉受，鼓噪内心，在丹田处就会产生一股气流，这股气流如果不释放出去就会觉得憋闷。于是风从丹田开始动了，依次向上触肚脐、心脏、胸腔、肺脏、喉管、喉咙、舌头和牙齿，于是一串串的声音就发出来了。</p><p>这个声音是由地水火风四大组成的，具有物质属性，与内脏器官相触，会有一定的能量损耗，多说话就会伤气又伤神，也会使定力消失。四大组成的声音也带有一定的磁场效应，对人有一定的正负影响力。声音里的每个音节生出来就灭去，甚至组成音节的每个最微小的元素也是生出来就灭去，极其快速，那么这样快速生灭的元素组成的声音，前音不是后音，音音不同，有什么真实性可言？如果非要辨别其中的含义，含义也是虚妄不实的。听到赞美声就高兴，听到批评声就不高兴，为什么会有这样的情绪反应？还是把声音及其内涵太当回事了。</p><p>这些法都是黑匣子里的事，没有什么真实性可言。从甲的口里发出来的声音，是甲的如来藏独自变现出生的，是甲的如来藏亲所缘缘。乙听见了，声音是乙如来藏的疏所缘缘，再把这个疏所缘缘变现在乙的胜义根中，四大微粒变化不小，乙的耳识意识所听见的声音就会失真很多，更加的不真实。</p><p>所以我在对面骂你一天，你不用有什么反应。广播喇叭赞美你一天，你也不用心喜，没有什么，无意义的电磁波一连串信号而已。很多人都有虚荣心，图名声图名气，希望别人都认识自己，都知道自己的名字，不知道自己图那个虚名干什么，有什么用，顶多能自我安慰自我陶醉而已。其实被人认识与不认识，都没有什么。这些人都想不开，愿意给自己增加负累，增加负担。</p><p>十四、六识了别的法都是信息，没有真实的六尘境</p><p>六识所接触的六尘境界都是本质境传过来的信号，也叫作信息。不管五尘境是什么样子，到黑匣子这里都是信息，在六识这里所感知的也都是信息和影子，却错会为立体的绚丽多彩的尘境。如何证明呢？从眼耳在手机和电脑上了别的信息就知道了，手机电脑上的信息，虽然有文字图片和视频，还有声音，都是手机电脑上所接收的信息，并没有文字图片视频和声音，</p><p>譬如一个网络群组有一百人，每个人都通过手机和电脑在群里交流，看群空间里的文字图片和视频，听群空间里的语音，可是每个人听和看的内容，都是自己胜义根黑匣子里的内容，只属于自己所有，不与其他人共享。所以在自己的手机电脑端，随意删除任何信息，对别人都没有影响，别人也不知道。而且其他人无论怎样处理这些信息，对于最初的本质境没有任何影响。</p><p>这些信息是如何出现的呢？其中一个人在自己的手机上打字，打出的文字属于本质境，通过手机的介质传导信号，其他人的手机就接收到了信号，传导到胜义根里，六识出生了别，了别的都是信息，不是文字、图片、视频和声音，可是六识硬是把这些信息识别成具体的色和声，可见六识的了别就是错觉。而且黑匣子里的一切法全部是信息和信号，并没有实质具体的六尘境界，都是影子，那么六识了别出来就全部都是假像。</p><p>一大堆信号我们如何看似六尘境界像？就像一连串的信号虚拟成了电视画面，我们实际上是在看电视，但与电视画面不相干。为什么我们把心都投入到虚拟的画面上了呢？如何能把心抽出来，离开画面？做一个旁观者，该有多轻松惬意，一切都与我不相关，该有多解脱？</p><p>对一切境界来说，都是我心上的一个画面，幻生幻灭，幻来幻去。我看着境界生，看着境界灭，看着境界来，看着境界去，任由境界来任由境界去，我心岿然不动。修行就应该是这样，最终就会这样，这才能解脱。</p><p>十五、天眼和定中所见都是错觉</p><p>天眼所见，也是自己的如来藏所变现出来的，如果见法觉得真实，也是错觉。定果色，是在大脑那里产生，在胜义根那里产生，因此定中所见的定果色仍然是错觉。只要有肉体，有大脑，一切法都会在那里产生。法尘，法处所摄色，都在大脑那里变现。</p><p>佛光是什么呢？识心不知道不分别时，仍然有色尘，这些色尘仍然是虚妄、幻化、四大组成、刹那生灭、空。佛光也是物质组成，是四大组成的色法，是虚妄的、幻化的、生灭的、不真实的。那么打坐见佛光，觉得真实就是错觉，因此我们都没有必要执著佛光，魔王也能现出这些光，魔王也能变出佛的外貌。</p><p>十六、监视器里的鱼为什么比实际的鱼多</p><p>朱清时说：我们的世界就像这个大的鱼缸一样，里头有一条金鱼在游，假设最少有两台摄像机，一台从侧面观测这个鱼缸，一台从背后观测鱼缸，另一个房间里头有两台监视器。试想一个人进入到监视器的房间里头，他就能看到鱼缸里头有两条鱼，这两条鱼还不一样，因为一个是从尾巴部分照过去，一个是从侧面照过去的。这两条鱼很怪，无论其中一个做什么动作，另一个马上反应过来，而且都是同时的。</p><p>监视器相当于黑匣子，人相当于六识，六识在黑匣子里见六尘境界，相当于人看见监视器里的影像。监视器是监视另一个房间鱼缸里的一条鱼的，明明鱼缸里有一条鱼，为什么从监视器里就能看到两条不同的鱼呢？因为两个摄像机分别给这条鱼从不同角度摄像，摄取的像就不同，好像是有两条鱼似的，从监视器里就会看到两条鱼。</p><p>监视器相当于黑匣子，黑匣子里的都是与外界相似的虚幻的假相，但并不一定完全相似，也许有很大的误差。六识并不知道，还以为自己见到了真实的相，这个错会可能就大了。如果房间里在不同方位放置十个摄像机，就会摄取出十条鱼，如果放置一百个摄像机，就会照出一百条鱼，从监视器里就会看到十条百条不同的鱼。达到一定数量时，这些不同角度的鱼合在一起，就是一条完整的鱼。楞严经中佛讲安置楞严坛城的时候，在道场中安八棱镜，就是这个原理。</p><p>十七、各道众生胜义根不同触觉就有差别</p><p>人道中的众生都有胜义根，畜生道众生也有胜义根，畜生的色身与人类的色身一样，都是实四大种子构成的肉体，有大脑，有胜义根，胜义根出现病变，畜生也会精神分裂或者疯狂。畜生的胜义根由于业障的关系，比人类的胜义根低劣，视人视物有很大错觉，见法不如实。但各种畜生都有属于自类的特长，例如有的畜生视觉灵敏，能夜视，有的畜生听觉灵敏，有的畜生嗅觉灵敏，有的畜生味觉灵敏，有的畜生触觉灵敏。但是畜生普遍来说，意识的思惟力很差，逻辑分析力更没有，大多靠意根的直觉力，所以显得比较单纯，除了为饱腹为了生存而造的杀业外，几乎不用心思造作其它的恶业，属于纯粹受报的众生。</p><p>无色界四空天众生因为其生存环境是无色的，就没有色法五尘，也没有色身，因此就没有胜义根，也没有内五尘内法尘，也没有五识，但却有意识、意根和第八识。他们的第八识和意根永远存在不灭，意识也永远存在不灭，其意识所了别的是定中独影境，没有外法尘，只有独影境。如果意识灭了，就只剩下第八识和意根，那属于灭尽定境界，所以无色界天人的意识也永远存在不灭，没有白天黑夜之分，不需要睡眠和休息，永远处于定中，面对独影境。</p><p>十八、世界如幻为一真法界</p><p>十方世界就是一真法界，我们现在能否明白一真法界到底是怎么回事？佛法就是用来给我们剖析世俗界假相妄相的，刨析到最后都是空，空不掉的那个就是无形无相的真法界。全息摄影，球幕电影等等，都说明世界是幻化的，我们接触的一切一切，都是幻化的。</p></div>"
},{
    "title": "第五章 黑匣子内外相分问题",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  黑匣子内外相分问题</strong></p><p> 一、内外相分的定义</p><p>所谓内相分就是六根对六尘时，第八识在大脑黑匣子部位变出的相似于外六尘的影像，就是胜义根内的影像。之后如来藏又在胜义根与六尘相对应处出生六识，六识出生就能分别胜义根里的六尘影像了。</p><p>佛在《阿含经》中讲过，十八界分为内外界，有外六尘，有内六尘；有外根五浮尘根和内根五胜义根；有外识和内识。外识是指能够接触外尘的第八识，内识是指能接触内尘的六识。至于意根，既是根也是识，既是外根也是内根，既是外识，也是内识，内外尘都能接触到，但意根这个外识接触的外尘不是第八识所接触的本质境，而是第八识依本质境又变现出来的尘境，是在进入胜义根之前的外尘。不管内和外，所有的相都是第八识所变，我们所分别的六尘都是假相。佛在《金刚经》中说，凡所有相皆是虚妄，就是这个道理。</p><p>我们所能接触到的所有相都是第八识变现出来的内相分，而外相分本质境是所有共业众生的第八识共同变现的，我们接触时，自己的第八识又变现一次，所以是假上加假，虚妄又虚妄。当众生离开生存的世间以后，不仅要灭掉自己第八识依外六尘所变现的内六尘相分，灭掉外六尘的影子，还要灭掉自己的第八识参与变现的那部分外六尘。因为意根想要离开五阴身，第八识也就不再执持五阴身，身根就没有用处了，它已经不是吸收外六尘的接收器了，因此内相分就不再显现出来。</p><p>二、圣人离世以后外相分也要发生改变</p><p>各人有各人的内相分，各人所见的六尘境界都是自己的内相分，是自己的第八识单独变现的，每个人都接触不到外相分本质境，外面的六尘境界六识了别不到。众生死后，心识灭了，六尘就不能显现出来，也就无法觉知六尘了。但是其他人仍然有各自的内相分，别人仍然能看见他们自己的内相分，说明外六尘还是存在着的。</p><p>但是外六尘一定会发生改变，只是改变得微乎其微，一般人发觉不了。阿罗汉们入涅槃以后，也是要灭掉自己的内六尘，因为六根灭了，不能再吸纳六尘，没有七识心，也不能觉知六尘，也没有六识来觉知，但不妨碍别人见六尘，所以各人见的都是自己的内相分。当阿罗汉与这个世间的缘尽时，其第八识参与变现的六尘外相分也就随之消失，那么众生共同的依报环境，外相分一定会发生变化，但是众生愚痴，往往感觉不到外相分有什么变化。</p><p>圣贤人离世以后，外相分发生了什么变化呢？外相分是善人的善恶业种和恶人的善恶业种，所有众生的善恶业种输送出来，共同变现的依报环境，圣贤人的善业种多，他们的第八识参与变现了依报环境，那么依报环境肯定是要稍微殊胜一些。他们离世以后，属于他们自己的外相分，也就随之散灭了，众生的生存环境就要变得比从前恶劣。</p><p>比如说：白色和黑色两种颜料，按照一定比例混合在一起，白色的颜料抽出去一部分或者多部分，那么黑色的颜料比例就增多，调配出的色彩就变得暗淡了。白色颜料就好比是圣贤人的善业种，黑色颜料就好比是众生的恶业种，那么圣贤人离世了，众生的生存环境就会越来越恶劣。虽然每个众生还是照样觉知自己的内相分，照样有内相分来供自己分别使用。但是因为外相分改变了，内相分必然会改变，内相分是依外相分而显现出来的，是外相分的影子，几乎与外相分一模一样。</p><p>众生总是喜欢说：没谁地球都照样转，可是转的一样吗？圣人走了，带走了属于自己的殊胜的外相分。圣人来之前，就参与变现这个世间，圣人一出生，世间就有祥瑞，依报环境就不同了。圣人多，世间大吉；恶人多，世间凋零，五谷不收，灾难频发。佛法住世和不住世，世间的依报环境也大不相同，有福人聚居的国家，和无福人聚居的国家，其生存环境大相径庭。</p><p>一个圣人走了，世界肯定要发生改变，一个大恶人走了，世界也要发生改变，只是改变的方向不同。释迦佛来到这个世界，世界就不一样，离开这个世界，世界也就发生改变了。佛临涅槃时，当时就感得大地六种震动，树木变白，林野一片哀嚎声；六祖走时，也是感得树木变白，凄凉一片。圣人生到这个世界，都有瑞相，叫作瑞应，大修行人临出生时，往往会有吉祥的瑞相，有缘人就有感应，从这里来看，人是可以影响周围物质世界的。大恶人来到这个世间，世间就有所改变，变得更糟糕；恶人走了，世间也要发生改变，环境会变得更好一些。</p><p>所以当一个恶人走了，有人就舒口气说：他可走了！心里早就希望他尽快走开。凡是不给一个团体带来正面影响的人，都有人心里暗暗地盼望他早点离开，让周围的环境气氛变得舒畅一点。因为众生的第八识都参与了外相分的变现，因此山河大地都有每个众生的一份，包括蚂蚁昆虫等等各类畜生。所以众生离开这个世间以后，外相分就要发生改变。但是要看参与变现的善恶业种有多少，影响的力度大不大，如果善恶业种的力量比较大，不管是善业还是恶业，都能影响到外相分，使得外相分有明显的变化。</p><p>反观一下我们自己修行的德行，对世界有什么影响，如果是没有好的影响，反而有坏的影响，那我们学佛就没有学好，恶心没有改变。如果我们学佛学的好了，就能对外相分有个好的影响，虽然绝大多数人觉察不到。对一个家庭，对一个团体，都是这样，好的德行能影响到一个团体，一个团体因为没有你的参与，就显得萧条冷落，多一个你和少一个你，团体就不一样了，那你对团体就起了相当大的作用。</p><p>三、色不迷人人自迷，酒不醉人人自醉          </p><p>外相分包括色声香味触法六尘，是共业众生的阿赖耶识共同变现出来的。凡夫众生却以为都是真实的，于是就生生世世追逐执著不舍，不知所能感知到的六尘都是内相分影像，是阿赖耶识通过六根接触外六尘而变生出来的影子，是一个幻化出来的假相。就像看镜子中的影子一样，就像看电视一样，就像看摄像机的镜头一样，就像听录音带一样，就像听空谷中的回音一样，就像观看水中的月亮一样，就像看阳光下的树影一样，凡夫不知，却以此为实。</p><p>比如外界的鲜花是有，那是外相分，等我们眼睛看见时，看的却是花的影子。物理学上讲过视觉成像的原理，眼见色时，在视网膜上先形成倒影，再通过聚焦变成正影，就被眼识识别了，所以我们所见的都是假像，但是我们却以为看见的是外面的色相，色相又是如此的真实。如果众生所见的是外面的真相，那朵花被一个人看见了，另一个人就看不见。</p><p>事实上，一亿个人、十亿人、百亿人，所有天人都能看见。你看你的影子，我看我的影子，互不妨碍。若不想看了，闭上眼睛就看不见了，但那朵花还在，不管你看不看。比如说，天上的真月只有一个，如果一个人摘取了，其他人就得不到了，可是不仅一个人能看见月亮，所有人间的众生都能看见月亮，看的就是自己心中的月亮。就像月亮映现在千万条江河大海之中，现出千万个月影，众生睹见的就是水中的月影，并非真月。</p><p>世尊在楞严经中讲过，声音不到耳边，耳也不到声音之处，而能听声，这说明听见的不是真实的声音，听声音这件事就是虚妄的。如果四大种子形成的本质的声音到一个人的耳畔，就不能到另一个人的耳畔，一个人能听到，其他人就听不到。如果耳根到声音之处，就不能到其它声音之处，就不能听见别的声音。同理，见色时，如果色到眼根处，而能有见，其他人就不能见，因为色就不能再到其他人那里去了。如果眼根到色处，就不能到其它色处，眼睛也就看不见其它色了。因此说众生所接触到的六尘境界是虚妄的，分别六尘这件事就是虚妄法。</p><p>当我们被打昏迷时，见闻知觉性没有了，我们就看不见、听不见、嗅不见、尝不着、触不到、分别不了，那就不能了知一切法。但那朵花还在，别人都看得到，外界的风吹雨打声还在，别人听得着，外面的花香别人嗅得到，外面的美食别人尝得到，外面暖洋洋的日光别人感觉得到，他人都能感知得到他们自己的内相分，死亡、入定、睡着时都是如此。当我们看花时，美丽的鲜花并没有想让我们迷恋它的心，是我们自己的七个识要去分别它、思惟它、判断它、观赏它，进而产生喜厌之心；同理，天地万法并没有让我们产生喜怒哀乐的心，是我们的妄心自己对万物生起执著；酒并没有醉人之心，是饮者自己不胜酒力，自醉而已。</p><p>外面境界无有心来迷惑我们，境界显现到我们心中也像影子似的，是我们自己的七识心动，非要去分别它，起各种念头和情绪，使得自己心潮澎湃，自生烦恼。而这几个识，如果第八识不为祂们输送识种，也不能存在，输送了识种以后，几个心就活蹦乱跳的，种种分别，种种知见，种种情绪，产生身口意的种种行为造作。就像皮影戏一样，有人一拉那根线，假人就能演戏了。</p><p>几个识心也是这样，非常的不真实。从这里可以看出，我们的识心多么的虚幻，我们的五蕴多么的虚幻不真实，它们只是在第八识心的表面上折腾来折腾去。所以我们见相时，相是虚幻的，见也虚幻的，无有见相这回事，病眼望空花而已。奉劝众同胞认清真假，不再迷执，回归自性，早得大解脱！</p><p>四、内六尘与外六尘的区别</p><p>内外尘之间不可能完全相同一致，不可能不发生改变，因为外尘在传导的过程中要经过中间的介质，最通常的介质就是虚空中的四大气态微粒，虚空本身在不同时间和区域里所含藏的四大微粒子不同，对外尘传导的影响也不同。除了虚空中的气态微粒之外，还有空中的尘埃和风，还有一些透明和不透明的物质，还有光和水气等等。经过的介质不同，传导的阻碍就不同，外尘中的四大微粒被吸收和阻挡的数量和类别也不同，导致内尘的影像与外尘出现一定的差异，相上有一定的改变。</p><p>如果五浮尘根有障碍，也会促使传导过来的六尘发生改变，传导神经出现变故，也会阻碍六尘的正常传导，致使胜义根里的内六尘与外六尘有比较大的差异。六识分别了黑匣子里差异较大的内六尘之后，其受想行识可能都要表现得不太正常，自己觉得很正常，别人却不这样认为。因为别人了别同样的六尘境界，内外六尘差异不大，表现就正常，与自己的认知就不同，受想行识也不同。</p><p>五、如来藏对外相分的摄取和传导作用</p><p>众生所能接触到的一切六尘相，都是内相分，接触不到外相分。外相分的真实相，只有如来藏能接触到，但是如来藏又不分别外相分的具体六尘，所以也不知道外相分具体是什么相状。外相分是所有有缘众生的如来藏共同输出四大种子，所共同变现出来的色法，也是由所有共业众生的如来藏共同执持的。</p><p>这些色法含藏四大，个人的如来藏也含藏四大，与色法相应，就能够接触外相分色法，并且能够摄取外相分当中的四大微粒进行传导。这些微粒也是刹那刹那生灭着，一个微粒生了灭，又一个微粒生了灭，就这样一直把四大组成的微粒传导到胜义根，变成七识所能缘的微细的四大内相分，与外相分相像。七识所分别的就是这个内相分，不是真正的外界本质色法。</p><p>一个众生如果离开这个世间，要把属于自己的那份外相分的四大种子收回如来藏里，那么外界的外相分就与从前不一样了，众生却觉察不出来。恶业众生都离开这个世间，就要灭去一些恶劣的外相分，那我们这个世间就会变得美好一些。如果再增加一些圣人，他们的善业的力量大，参与变现外相分，这个世间就会大变样。</p><p>六、六识的造作能否涉及到外相分</p><p>因为我们接触的六尘都是内相分，那么我们看见的一棵大树，就是内相分，它就在黑匣子里，我们的六识接触不到外相分。那么如果六识五阴身把树砍断，是毁树的内相分，还是外相分？外面的那棵大树是否还存在？如果杀人，是杀人的内相分，还是外相分？如果杀人，是杀人的内相分，那就不叫作杀人，因为那个人还活着。如果是杀人的外相分，六识又接触不到外相分。我们打人的时候，是打的自己的外相分，还是内相分？如果打的是自己的内相分，别人应该不疼。如果打的是自己的外相分，我们六识却接触不到外相分。这到底是怎么回事呢？</p><p>砍断大树，如果只是砍断树的内相分，那么树的外相分还会存在，大树并没有被砍断，砍断大树这一法并不成立，如果是砍断大树的外相分，六识又接触不到树的外相分。偷别人东西，是偷内相分的东西，还是偷外相分的东西？如果是偷的内相分的东西，应该不犯法，如果是偷的外相分的东西，六识却接触不到外相分。</p><p>实际上，真实的道理是，内相分是依外相分而有，先有外相分，后有内相分。如果没有外相分，就没有内相分。那么当一个人毁坏物品时，不仅是毁坏内相分，肯定也毁坏了外相分，而且是外相分先毁坏，内相分随即也跟着毁坏。那个物品的外相分肯定是毁坏了，或者是消失了，别人也没办法受用到，或者没办法再看到，那肯定是外相分没有了。</p><p>所以才说，毁坏东西有罪，偷东西有罪，杀人有罪。正是因为毁坏了外相分，使得他人受损失，不能再受用得到了，而不仅仅涉及到自己的内相分。如果毁坏的仅仅是自己的内相分，那么杀死几亿人，都没有罪，任何人都管不着。所以杀人、砍树、毁坏财物、偷东西，都是涉及到了外相分本质，那就有罪过了。</p><p>既然六识只能接触内相分，不能接触外相分，六识的行为造作，为什么还能涉及到外相分的改变呢？这里就有大秘密了。外相分就是外面四大组成的相对真实的物质世界，这个真实性也是相对于内相分而说的，其实也不真实，也是如来藏幻化出来的，其实质仍然是虚妄的。真实的法，只有第八识如来藏，其余的一切法，都是虚妄。</p><p>七、六识造作以后内外相分哪个先改变</p><p>有个说法是：烦恼即菩提。烦恼一方面指贪嗔痴，杀人放火等等恶法，一方面指吃喝拉撒等等日常琐事。而菩提指的就是如来藏，一切法都是如来藏所变现和执持的，外相分也如是，那么外相分的生住异灭，都是由如来藏实现的， 而内相分当然也是由如来藏所变现和执持的。山河大地的一切变化，都是第八识如来藏所为，一切法的生住异灭都是第八识如来藏所为。</p><p>六识永远不能直接改变外相分，因为六识里没有种子，不与外相分相应，而且六识是后出生的法，必须先有内相分，然后才能有六识，因此六识不可能去直接改变外相分。而如来藏里有四大种子，有六大种子，因此一切法由如来藏说了算，那么参究这些问题的方向就已经很明确了。既然六识只能接触内相分，不能接触外相分，六识的行为造作，为什么还能涉及到外相分的改变呢？这里就有大秘密了。</p><p>当我手从桌子上拿起一本书，手的身识只能接触书的内相分，拿起的是内相分的书，可是外相分的书就不在桌子上了，别人就看不到，也拿不到了。内、外相分到底有什么关联呢？先有内相分，还是先有外相分？当然是先有外相分。是外相分先改变，还是内相分先改变？当然是外相分先改变。内相分从哪里来的？当然是第八识如来藏依据外相分变现出来的。所以一切法的改变，一定是外相分先变化，然后变化了的外相分，通过浮尘根再传导到净色根，就形成了内相分。</p><p>但是我的手又接触不到外相分的书，又怎么能先让外相分的书先变化，而引起内相分的书发生变化呢？又比如说，六识造作杀人的业，六识只能接触人的内相分，不能接触到人的外相分，那么六识是怎样让人的外相分也灭了呢？而且是人的外相分先灭先毁坏，然后人的内相分才能随后灭或者毁坏。因为内相分由外相分而来，依外相分而变现，那肯定是外相分先改变，随即内相分才能跟着改变。这里的大秘密就留与有缘人细心参究了，不能在此多着笔墨。</p><p>八、在假相上修行才能圆满一切功德</p><p>世俗里的一切法都是如来藏幻化出来的假相，但是假相有假相的作用，善用其相，即得正真菩提。我们不能听说凡是假相，一概都排除不要，且不说我们自己有没有灭去假相的本事，单说假相如果都灭去了，那么菩提真相要如何行道。菩萨修行应该善于利用假相，来圆满一切功德，变邪染为美好，变邪恶为清净。有人觉得世俗法很不如己意，生存的环境严重障碍自己，就想脱离灭去一切的世俗法，以得到清净。可是这些世俗法是与自己的业种相应的，只有改变了业，改变了心，自己所周遭的一切才能顺心如意。</p><p>修行到一定程度的时候，世俗法就不会障碍自己，也不会影响到自己，内心慢慢就会脱离这些假相的束缚。我们通过有效的修行，也能够改变这些六尘假相，变恶为善，变丑为美，变不可意为可意。心改变了，内外相分同时都改变，因为心地改变了，业种就改变，相分就能随之而改变。</p><p>六尘的内外相分是完全能够转变的，只要心力够用，指石为金并不是难事，有禅定的大菩萨们都能千变万化，变大地为黄金、琉璃，甚至八地菩萨会变化出三千大千世界来利乐众生。修行到心量广大，心力强大，就能把地水火风四大种子的比例结构改变，四大比例变了，物质的结构就改变，结构变了，物质的属性就改变；那么白雪就可以变白糖，灰尘可以变成金粉，修到一定时候，改变一切法的内外相分都不是难事。</p><p>九、修行是修识心而不是修五根</p><p>所谓六根清净，是指通过六根而产生的六识心是清净的，五根本身不涉及清净与不清净，它只是一个被识心所用的工具而已。没有识心，根就是木头，修之无用，也没法修。需要修的是识心，通过修行让几个识心去除染污，变得更清净一些。六根是接收六尘的受纳器，外界六尘能够通过六根进入胜义根中，根尘相触，如来藏出生识心再去分别六尘，分别后就产生了染污心行，或者是识心带着染污性去分别，之后就产生与贪嗔痴烦恼相应的身口意行为，六识就不清净了。</p><p>外六尘是物质色法，不能进入六识心中，六识是无形的心法，不是物质色法，二者不能互融互摄，这其中都是如来藏在起作用。眼见色时，如来藏通过眼根与色尘接触，如来藏就把色尘微粒如镜子照物一般摄取过来，传导到胜义根，在胜义根里显现出来的色尘就是影子，不是粗重的四大物质，而是微细的四大物质色法。如来藏把摄取的外色尘的四大微粒，通过外眼根传导到眼的胜义根，根尘触了以后，如来藏产生眼识，眼识就会接触胜义根里的影子，然后再分别这个影子，于是我们就看见色尘了。</p><p>耳听声、鼻嗅香、舌尝味、身觉触，也是这个道理，所以金刚经说，凡所有相皆是虚妄。我们所认识、分别、了知的所有相，都是假相，是如来藏给我们变现出来的影子。如来藏就像镜子一样，接触外六尘时，能够变出与外六尘一模一样的影子，这个影子就是内六尘。当我们真正证知了一切相都是影子，都是假相以后，心的执著性才能减轻，烦恼就变淡薄了，就不会太计较一切得失利益，心就能清净下来了。那么六根再触六尘时，识心就不会生起染污烦恼，渐渐就会心得清净。所以清净是心清净，不是根清净，根没有分别性，识有分别性，识分别时就带有清净和不清净的心行。</p><p>十、外相分的味尘是否存在</p><p>问：内相分是由外相分变现而来的，那外相分到底是有还是无呢？比如一道菜很咸，虽然在各人内相分中味道都不一样，那到底这菜是有味还是无味呢？</p><p>答：味尘的外相分是一样的，各人因为业力不同，感觉到的味道就不同。业力不同，舌根传导过来的味尘四大微粒就有变异，内相分就有改变，因此识心分别后的感觉就不同。就比如有眼病的人，能看见灯光中的圆影，他人就看不见，他是因眼病的业障所致。众生的福报和业障不同，感觉的味尘也不同，比如佛有无上福德，任何食品在佛口中都是最上美味，而在凡夫众生口中，却不是这样。</p><p>味尘是色法，四大种子组成，分为外相分和内相分两种。因此就有外相分的咸淡甘辛等等味尘的存在，舌识和意识接触不到，也了别不了，外相分的味尘，只有如来藏能接触到，但是祂没有口，也就没法告诉我们了。</p><p>我们在品尝味尘时，有自己的佛性在运作，因此品尝食物时，就能见佛性的妙用，那时就不把味尘当作真实了，就会证得如幻观。有些人不修福，也不修定，专门在慧力上用心，就不容易实证佛法，往往会吃大亏，而自己不知。不修福德和定力的人，如果专门修慧，会付出更多的代价，付出更多的时间和精力，还不如把福德修得厚厚的，禅定修得牢固了，然后稍微思惟佛法，就能证得。那些不想吃亏的人，到最后反倒吃了亏，这就是没有智慧的抉择。</p><p>十一、六识心永远接触不到外相分</p><p>外相分是有缘众生共同受用的色法，如宇宙器世间。宇宙器世间是每个有缘众生的如来藏共同输出四大种子，形成四大，然后所有如来藏共同用这四大变造宇宙器世间。这部分只能由众生各自的如来藏接触，色法之间能互相接触，七识心无法触得到，因此众生绝对无法知道外相分是何许模样，与自己黑匣子里的影像内相分有多大差别。</p><p>科学仪器用来测试宇宙的时候，无论科学发展与不发展，科学仪器一定是与外相分相接触的，不与内相分相接触。因为科学仪器也是物质色法，与外相分的色尘一样，都是共业众生的如来藏用四大种子造就出来的，都是只有如来藏才能接触的外相分。但是人类要是去观察外相分的时候，仪器连同色尘就都变成了内相分，在后脑勺那里生成外相分的影像，叫作内相分，人类只能观察这里的虚假相分。人如果不去观察和研究，就不会有内相分，只有外相分，一旦观察了，就有变化了的内相分，与外相分相似，但有差别。所以才说，物质色法，人眼观察与不观察结果是不一样的，但是外相分本质境是不会有什么变化的。</p><p>无论科学怎么发达，都不会有人类能无限接近外相分之说，因为只要是使用胜义根的人类，其所见一切法都是胜义根黑匣子里的法，黑匣子之外的法人眼见不到。至于为什么是如此，那是如来藏的规则和法则，佛也干预不了。但是佛有无量神通，胜义根那东西可用可不用，很自在，什么法也不依赖，我们就不行。</p><p>外相分是绝对的存在，是如来藏变现的最原始的色法，也是最根本的色法，众生一接触，色法就不原始，也不根本了，不是最初的本质境了。个人的八个识参与进去，就会改变色法，而且改变的是自心里的色法，所以才有一切法都是自心之说。那么外相分最原始的色法能否改变呢？也能改变，个人的业融合进去了，受用的法就会出现一定的变化，只是这些变化能否被感知到，有明显不明显的差别而已。</p><p>十二、业不同的众生了别的相分就不同</p><p>天人看河水是琉璃，人看河水是水，饿鬼看河水是烈火。同样一条河，不同业道众生看到的相分都不同。三类众生的如来藏都参与变现了那条河流，各自的业种不同，股份就不同，那么按股份抽红，各人所得、所见就不同。因此污秽的娑婆世界，是站在众生的角度来说的；而站在释迦佛的角度，娑婆世界是相当的庄严，与极乐世界无二无别，这是维摩诘经里所讲。这说明佛参与变现的世界，祂输出的业种是极其殊胜的，所感召到的相分与众生有极大的差别，就像合股公司，股份不同，分得的利益就不同。  </p><p>有胜义根的众生，才有内相分，如果没有胜义根，就没有内相分，有肉眼而没有神通的人，才能了别内相分。有天眼有神通的人，就不一定要了别内相分，六根互通互用的人，就不用了别内相分。俱解脱的罗汉以及八地大菩萨们，了别六尘境界，就可以不用六识了别，而直接用意根了别，了别的就不是内相分了。无色界天人没有色身，就没有胜义根，没有内六尘，他们了别法尘，就不是了别内法尘。</p><p>十三、共业众生的外相分一定是相同的</p><p>问：饿鬼和人类所见的外相分是否是相同的？比如饿鬼看河流、人看河流和天人看河流，明明是看同一个河流，所见就有所不同，人见是河流，天人见是琉璃，饿鬼见是火焰或者是浓血。</p><p>答：既然是见同一个河流，外相分肯定是一样的，只是內相分各自不同，这是由于业力的关系造成的不同结果。如果饿鬼看到的是饿鬼那个世界里的河流，那跟人看到的人这个世界的河流肯定是不一样的，因为外相分不同。如果饿鬼看到的是饿鬼世界的事，跟我们人就没有关系，外相分不同。如果它看的是人的世界这里的山川大地河流，它所见的和人见的结果虽然是有差别，但外相分是一致的，它看的都是人中的河流。</p><p>鬼道虽然有鬼道的生活方式，有鬼的器世间生活环境，跟我们人中还是有差别的。但是它看到的人中的人事物，比如说鬼看见人，是鬼道里的人还是人中的人呢？它看的人和别人看见的人是同一个人，外相分能不能一样？肯定是一样的。所以我们人给鬼神供养布施水和饮食，鬼神才能吃得到，也能吃饱，也觉得美味可口。</p><p>十四、佛所受用的殊胜境界</p><p>在佛那里，外相分与内相分完全一致，佛见的娑婆世界，与极乐世界完全一致，那么佛的无垢识变现的娑婆世界的外相分，也如极乐世界般美好庄严；同样生活在娑婆世界，佛的衣服上从来不沾染灰尘，身体皮肤也不沾染灰尘，灰尘代表的是心的无明，而佛没有无明，也就感召不到灰尘了。</p><p>佛有五眼六通，佛了别六尘，完全可以不用六识来了别内相分，可以不用胜义根。佛的单独一个第七识完全可以代替六识了别一切法，即使是佛的前五识，也可以单独了别一切法。因为佛的八个识都有二十一个心所法，五遍行：作意、触、受、想、思；五别境：欲、胜解、念、定、慧；善十一：信、惭、愧、无贪、无嗔、无痴、精进、轻安、不放逸、行捨、不害。那么佛的无垢识与妙观察智一样，有欲、胜解、念、定、慧，能了别观察六尘境界，前五识和第七识也是一样，所以佛的八个识都具足圆满的智慧德能。</p><p>用眼睛瞪人，恶眼视人，眯着眼看人，轻蔑视人，这些都是眼识的不善心所，而到了佛地，佛的前五识也都是善的，而且前五识也有慧，能了别一切法，这些境界，我们都没办法想象。既然佛可以直接了别外相分，那么佛的外相分，一定都是殊胜的完美的，但是也可以依据众生的心，来了别众生的不殊胜不完美的境界，在佛那里，根本就没有不完美的。所以娑婆世界对于释迦佛来说，就是非常殊胜的佛国土，与心有染污的众生所见的世界，那就完全不一样了，所以才有维摩诘经里的那一段内容。</p><p>十五、众生业力不同受用的内相分就不同</p><p>每个众生的如来藏都会摄取外相分，以此变成自己的内相分，这也要根据众生自己的业缘，根据自己的业种来摄取。参与变现外相分时，由于各自的业种不同，输出的四大肯定与其他众生不一样，也就是说，参与变现投入的股份不一样，那么果报就不一样，各自感召的外相分也应该不一样。所以各自的如来藏摄取的相分就不一样，变现的内相分也就不一样，这是其一。   </p><p>其二，众生由于业力不同，即使有相同的外相分，如来藏摄取过来，变现的内相分也会有所不同。这是由于众生业种的缘故，六根有障碍，中间不能正常的传导和接收四大微粒物质。如来藏也就不能正常的变现相应的内相分，那么内相分就是扭曲的。于是六识分别的就是扭曲的内相分，可是却以为是外面真正的外相分，于是六识就对六尘作不正常的扭曲的了别。另外，因为六识有贪嗔痴烦恼，其智慧就狭劣，也不能正常了别内相分，因此就常常作错误了别。</p><p>十六、见物就应该见心</p><p>当我们知道了六尘的时候，六尘就是心上所现的相，那么见物就应该见心。如果没有心就没有物，物是心中物，心外无物。眼见花时，第八识通过眼根接触花，像镜子现像一样，在后脑黑匣子处变现出花的影子；然后内眼根与花的影尘相接触，意根与花上的法尘相接触，第八识依此就生眼识与意识出来，两个识心就分别了花的影子，影子与我们眼根所对的外界的花差不多一样，非常立体，活灵活现，我们就以为自己看见的是外面真实的花，其实不是，都是黑匣子里的影尘。</p><p>那么我们看花看其它物质时，就应该知道，这些物的景象是我们眼识、意识、意根、第八识共同和合变现出来的，这时就应该反观见物当中，哪个是眼识，哪个是意识，哪个是意根，哪个是第八识，这样心能通物，物也与心相通。而外面的真花，是共业众生的第八识和合变现出来的，同样是假，是虚幻，都是依赖共业众生所有第八识中的四大种子来变现，所有的第八识共同执持着花。同理，我们听见的声音，嗅到的香臭味，尝到的酸甜苦辣味等等都是如此。</p><p>十七、众生有无明时才会见到尘境</p><p>六根触六尘时，第八识就产生六识，根尘识三者和合触，六识了别内六尘，众生就知道内六尘的内涵，分别了知就完成了。众生所了知的就是内尘内相分，不是外尘外相分，所以众生所了知的六尘是虚妄的。内尘是虚幻的，外尘相对内尘好像是真，但也是第八识所幻化出来的，也是虚幻不实的。真正的真，是不生不灭的真心如来藏第八识，除此都是假，都是虚幻的，幻化不实。</p><p>众生永远也接触不到外尘，都是在虚相、假相里生存着，病眼望空花而已。内尘和外尘是有还是没有呢？众生眼有病时就能见到空中花朵，众生心眼有病障，就会看见一切相为实为真。众生心无病时，就不见空中有花，只见如来藏性。比如我们的五阴有动转施为，这些假相不排除，是有，但这种有是假有，这些法现在可能体会不出来，等证悟以后，发起各种观行智慧出来，那时就能明白了。这是亲证的现量境界，别人怎么讲解，也体会不出来，因为这不是理解的问题，必须通过实际修行亲自证实才能体会到的，理解的是不可靠的，也不能解决生死问题。</p><p>十八、内外六尘的变现</p><p>外六尘通过外根传导到内根，形成了内六尘，整个过程全部是如来藏加持的，不是外根和内根本身能传导和出生六尘，外根和内根本身由四大组成，没有任何主动性的作用，如果没有识心在里面生发作用，外根和内根就与石头、木头、无情物是一样的。正因为有识心在内根外根和四大上运作，四大就好像有作用了，外根内根就好像能够传导物质色法，就有能接收物质色法的作用了。</p><p>其实这些作用全部都是如来藏幻化出来的，内根和外根的构造是如来藏创造出来的，如来藏接收外边物质六尘，如来藏通过外根把外六尘传导到内根里，形成内六尘，内六尘也是如来藏用四大种子产生出来的，外尘和内尘都是由四大种子组成。</p><p>但是内外尘的质有一定的区别，外尘是实四大种子组成，接近于本质境，带本质境的四大质，内尘是外尘的影子，是依据外尘所幻化出来的假像，带一部分四大种子，因此像是虚假的。外尘就像镜子外边的物叫实物，内尘是镜子里面的影子，是虚物。内尘影子和外尘的形状大约是一样的，但是本质却不一样，有区别。</p><p>十九、猪肉是如何被吃的</p><p>六个识是如何吃猪肉的？是否吃到真正的猪肉了？猪肉的四大是猪的如来藏用四大种子构造的，与人无关，那么猪的四大是如何进入人的身体里，并且消失掉的？猪身体的外相分，真实的肉，本质境，只有如来藏能接触得到，六识只能接触内相分，那么六识是如何接触猪肉并且吃掉的？也就是说吃进肚子里的只能是内相分，那么外相分的猪肉怎么就不见了呢？外相分还真的给吃没有了，是谁这么厉害？</p><p>当你把猪肉吃进口里的时候，嘴唇、牙齿、舌头等等身根是接触不到真正猪肉的，咀嚼也咀嚼不到真正的猪肉，舌识也品尝不到真正的肉味，猪肉的外相分本质境也不能进入胃肠之中。总之六识接触的都是假相，接触不到真相本质境。这样吃肉还吃个什么劲？都是自我欺骗，实际上也没有造恶业。但是猪的肉确实没有了，猪的意根也不会轻易原谅吃自己肉的人，人家猪的如来藏辛辛苦苦的变造出一坨肉，跟你人没关系，你又没出一分力，凭什么吃人家的肉？这与打劫强抢有什么区别？</p><p>二十、自己所见的自己的身体也是黑匣子里的内相分影像</p><p>问：这两天在体会外相分和内相分道理，总觉得收效不大，虽然知道理论正确，但和实际一点对应不起来。后来我突然想到，我不自觉的把自己的身体和外部事物对立起来了，忘记了自己这个肉体也只是个相分的一部份，其实外相分，内相分就纯粹是识所识别的境界，要想真悟入，必须还得在定中下功夫才会真有所得，是不是这个道理？</p><p>答：自己所见的自己的身体也是黑匣子里的内相分影像，不是如来藏出生的本质境身体，本质境的身体只有如来藏才能见到触到。这些法，如果没有禅定，就无法观行，那么一切法都只是一个理论。那样的话理论是理论，自己还是自己，自己的心与解脱一点关系也没有。理论不是自己的，即使谈论得头头是道，口若悬河，也只是个口头禅，抵挡不住生死。禅定是非常重要的，切实的观行，也是非常重要的。观行出来以后才能真真切切的证得，然后那些法，才真正属于自己，就不是从外从他人处得来的。大丈夫不学人言语，说话就要说自己的话，而要说自己的话，就得要实际去证得，这样从此以后才会智慧大开，各种观行智慧才能显现出来，才能真正得解脱受用了。</p></div>"
},{
    "title": "第六章 根尘识三者作用处的秘密",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  根尘识三者作用处的秘密</strong></p><p>一、六根的分类</p><p>六根分为内根和外根，分为有色根和无色根。前五根是有色根，由地水火风四大种子构成的有相貌的物质色根。意根是无色根，不是由四大种子构成，不属于物质色法，祂是心是识，有心的分别、识别作用。</p><p>五根包括浮尘根和胜义根，浮尘根就是外根，浮在身体表面，他人能够看见。胜义根就是内根，在大脑部位，他人不可见，天眼能见。五根如果侧重于表面，就是浮尘根，不包括胜义根；如果说五根的所有功能体性，则包括胜义根；也有专门侧重于胜义根的，要看具体情况而说。大脑那里是胜义根，负责与内尘接触，然后第八识依之产生六识。</p><p>二、五根之间的关系</p><p>身根包括身体上属于器官和部位，只要长在身体上就属于身根的一部分。眼睛耳朵鼻子舌头在身体的头部，属于身根一部分。但是如果眼睛起到了见的功能作用，就是眼根，不是身根；耳朵起到听的作用就是耳根，不属于身根；鼻子起到嗅香的作用，就是鼻根，不属于身根；舌头起到尝味的作用，就是舌根，不属于身根。</p><p>眼睛属于眼根还是身根？耳朵属于耳根还是身根？鼻子属于鼻根还是身根？舌头属于舌根还是身根？眨眼睛是身根的作用还是眼根的作用？是身识的活动还是眼识的活动？眨眼是身根动，是身识的行为，不是眼识，眼识的功能是见色，眨眼睛不是见色，是身体中某部分的活动，虽然是眼睛的活动，但不涉及见色，就不是眼识的作用。当眼耳鼻舌不起见色、闻声、嗅香、尝味的作用时，这四根处于身根上就属于身根，只有起本根作用的时候，才是本根，不起本根作用的时候，就属于身根。</p><p>同理耳朵疼，是身根的作用，是身识的觉受，不是耳根的功能，不是耳识的觉受。因为耳根起听声的作用，耳识听声才有觉受，而疼痛是身根上的受。鼻子痒也是如此，舌头疼痛也是如此，都是身识的觉受。如果割掉鼻子，割掉舌头，割掉耳朵，弄坏眼睛，都是损坏身根的行为，如果本根的功能作用也同时受到了破坏，也等于损坏了眼根、耳根、鼻根和舌根。</p><p>三、眼见色的奥秘</p><p>如来藏变现内相分的问题，法义非常的深奥，涉及到甚深的唯识之理。比如说外边的色尘，我们的眼根并没到色尘那里去，并没有接触到实质的色尘，可是却看见了色尘。色不到眼，眼不到色，而能见色，确实很奇怪。看远处的山，那座山离我们的眼根非常远，我们眼根肯定过不去，山也没有到眼根这里来，但是我们却看到了那座山，确实是很奇怪，这里都是唯识奥秘，涉及到种智的问题，这个奥秘甚深又甚深。</p><p>比如外边远处的那座山，那座山是谁变的呢？是共业众生如来藏共同变现的，变现以后，所有共业众生的如来藏再共同执持那座山。外边的山有没有我们的如来藏参与？当然有！我们也是共业众生之一，我们看到那个山，那个山就跟我们有关联，我们如来藏也参与了变现，参与执持那座山，那是外相分。</p><p>至于内相分呢，那座山由地水火风四大种子构成，我们想看的时候，自己的如来藏就和外边的那座山相接触，就把那座山的地水火风四大微粒摄取过来。微粒摄取过来以后，一直传导到我们的眼根，传导到眼球，传到玻璃体中，传导到视觉神经，传导到我们后脑的胜义根那里，如来藏马上把这些微粒变成内相分的显色。即使我们不想看，如来藏也照样会在我们后脑胜义根处变现出那座山的影像，看与不看，在于意根的决定。</p><p>外相分的那座山是共业众生的如来藏共同执持的，我们内相分里的山呢，是我们自己的如来藏依据外相分变现出来的的影子，外相分变现成内相分，这里面还有极多的奥秘，涉及到甚深唯识种智问题。</p><p>我们所看到的山有这么多的奥秘，看山的全部过程更是有极多的奥秘。如来藏是怎样执持外面的那座山呢？那是所有众生的如来藏共同地刹那刹那地输出四大种子，来共同变造、执持和改变那座山，那座山也是刹那刹那在变化着的，所以那座山，千年万年以后也会改变和消失，所谓沧海变桑田，桑田变沧海，就是这个道理。</p><p>整个大地宇宙器世间都在改变，为什么会改变呢？因为众生的业缘所感召，因此所有共业众生的如来藏都会刹那刹那输出四大种子，共同变造并维持着这些由地水火风组成的山、水、宇宙器世间等外相分，这里的关系特别复杂，很难说清楚。</p><p>当个别众生的如来藏去缘那座山的时候，如来藏就会把相应于众生自己业力的四大微粒摄取过来，众生善业多，变现出来的内相分就稍微圆满一些；恶业多，变现出来的内相分就恶劣有缺陷。每个人的业障都不一样，把那座山的四大微粒摄取过来以后，因摄取的四大微粒不一样，变现的内相分就不一样，内相分也是根据众生的业种业力而显现出来的。每个人眼中所看到的山河大地都不一样，同样的那座山，有的人看就很美，有的人看就不美，这就和福报、业力、心境等等都有关联。</p><p>当一位阿罗汉入了无余涅槃时，他的如来藏参与变现的那部分外相分的山河大地就随之消失了，可是众生感觉不到外相分的变化，只因参与变现外相分的众生太多了，当阿罗汉的如来藏收回自己所有的四大时，外相分变化不明显，我们就感觉不到，只有佛陀及诸大菩萨才能感觉得到。</p><p>四、如来藏传导外相分微粒的奥秘</p><p>如来藏因为有色法种子，又亲自参与变现了物质色法，就能够和外相分的山相接触，直接缘那座山，并且把四大微粒摄取过来，摄取过来以后，能透过一些遮挡物传导到眼的浮尘根和胜义根，那么我们隔着窗户看外面的山，就能看到内相分的山了。中间的遮挡物越多，四大微粒被阻挡的越多，传导到胜义根里改变的越多，内相分影子越失真越不清晰。</p><p>如来藏摄取过来的四大微粒能够穿透一切的境界没有障碍，众生没有天眼通时六识就见不到胜义根之外的带质境，所见就有限量。有神通的人用天眼隔着墙和其它障碍物也能看到很远的宇宙器世间里的色尘，能看到整个宇宙器世间里的物体，包括地狱和天宫。天眼通的人见色没有障碍，他的意识能够见得到意根所见的一切法，意根能见如来藏所缘并且再次幻化出来的法，不受一切时空和物质色法的遮障，因为所有的物体不管有多广大，都是虚幻不实的，有甚深禅定时六识就能不受虚幻物体的遮挡。</p><p>我们的外眼根，眼的浮尘根、眼球玻璃体，和外界的山以及一切四大组成的物体微粒也能接触到，那是如来藏摄取过来的微粒，传导到眼根，眼根才能接触到，否则眼根就接触不到。微粒也可以叫作光子，光子是运动的，为什么运动呢？因为如来藏刹那刹那输出四大种子，形成了微粒或者叫作光子，微粒也是刹那生灭的，这个生那个灭，这个灭那个生，一个光子一个光子的生灭现象，就形成了传导作用。</p><p>微粒就这样传导过来了，传导的势力会逐渐微弱下来，传导能量就会减少，最后停止传导。刹那生灭的四大种子形成的粒子——光子也刹那生灭，一个光子接著一个光子，象接力棒一样传过来，透过眼球玻璃体，传导到眼的胜义根，形成色相，如来藏再出生眼识和意识，我们就能看见了外面的景物。</p><p>五、根尘相触的奥秘</p><p>微粒通过视网膜在后脑的胜义根里形成影像，落在胜义根上，胜义根就比如是一个盘子，传导过来的光子微粒就比如是豆粒，豆粒正好落在盘子中，二者碰到一起，根与尘就相接触了，四大微粒落在胜义根中就形成了内相分的影像，这个影像就是显色。色尘和根相触，没有谁主动触和谁不主动触，这是法尔如是的触的原理。</p><p>根尘一相触，如来藏就会生出相应的识，来了别尘境。意根如果对落下来的色尘不感兴趣，就不会作意于当前的色尘，也不会生起思心所，想要来了别，如来藏就不会配合意根，生出眼识和意识来了别色尘。但是第一二三刹那，色尘还是会落入胜义根里，眼识意识还是能了别到。当意根不感兴趣时，眼识意识就会尽量避开此种色尘，不会再分别色尘了，也可能两个识在此种色尘上灭失，而转向其它色尘之处。</p><p>耳听声也是如此，一二三刹那，声音是要进入耳根的，耳识不自觉地就听到了声音，如果意根觉得不应该听，就会把注意力转移分散，或者灭掉识心，不去听声。当然也有意识不感兴趣，或者耳识想躲避，心思传递给意根，意根就决定不听了，结果好像没有声音了，或者不注意声音了。这都在于意根感不感兴趣，作不作意。意根作意，生起思心所，如来藏了知，就会出生眼识、耳识、鼻识、舌识、身识、意识来了别内相分的六尘。</p><p>如来藏把色尘传导到后脑胜义根处，生出显色、形色、表色、无表色，色尘和色法尘出现了，根尘就相触。若意根对此法尘作意，起思心所，如来藏就会变起意识来了别这个法尘，意识就比眼识稍微晚一刹那出现，在眼识的后边生起。虽说意识心比眼识稍微晚一刹那生起，其实这两个识我们感觉几乎是同时生起的，二识刹那刹那的生灭，就会同时了别色尘了。如果意根不作意，不想了别这个法尘，眼识也就不会现起，意识也不会现起。当色尘来了，我们就不能见色，不知道有色。</p><p>六、内声尘是如何形成的</p><p>声音这种四大微粒能够穿越墙壁，穿越一些障碍物，墙壁等障碍物遮挡不住这些粒子的传播渗透。这些微粒是如来藏从远处的声音上摄取过来的，然后一路传导到耳根、鼓膜，一直传导到大脑耳胜义根那里，形成内声尘，与内耳根相对，出生耳识，意根与法尘相对，出生意识，由耳识分别其粗燥的震动现象，由意识分别声尘上微细的法尘。</p><p>各种声音的内涵、性质、属性、远近、好恶等等微细法叫作法尘，法尘生出来以后，意根作意与否，要看祂对法尘感不感兴趣，祂要感兴趣就决定作了别，如来藏就会变起意识，和耳识一起了别；如果意根不感兴趣，就决定避开不了别，如来藏就不出生耳识意识，不了别此声音，因此虽然有声音，我们也听不到。在入定的状态，或者专注其他事情的状态，在无心的状态等等，就听不到某种声音。</p><p>七、胜义根区域的划分</p><p>大脑胜义根部位分为好几个区域，五尘分别变现在其中五个区域；五尘区域之外，还有五尘上的法尘区域，五种法处所摄色分别变现在其中，一个区域出现障碍，其它区域还能起用，且功能就会有所增加。比如眼根的色尘区域毁坏，不能见色，其功能能量可能会转移到其它几根，也许耳识会变得伶俐，也许嗅觉会变得敏锐，也许触觉会变得敏感一些。</p><p>如来藏在色尘区域内所变现的内相分显色，与眼根相对，是眼识所分别的对象，色尘区域叫眼的胜义根。还有耳的胜义根，鼻的胜义根，舌的胜义根，身的胜义根，分别是形成声尘、香尘、味尘、触尘的粗劣内相分的处所，五胜义根就是这五个区域，包括法尘产生的区域，以及独影境产生的区域。</p><p>在眼根的胜义根处变出显色，在显色的基础上，又在另一个区域法入处，变出显色上所显的微细法尘——形色、表色、无表色，这个区域法入处，是眼俱意识出生的处所。在耳根区域变起粗燥的声尘，然后又在法尘区域变造声音的微细法尘，出生耳俱意识，那么五俱意识就有五个处所。现在医学上也有人讲，与前五识一起生起的五俱意识都有各自的感受区域。</p><p>大脑的位置比较特殊，是五胜义根接收内五尘之处，也是出生法尘和六识之处。大脑某一部分受损，见闻觉知的某一种功能就消失，不能起用了。或者是不能见色，或者是不能闻声，或者是不能嗅香，或者是不能尝味，或者是不能觉触，或者是不能行走。内色尘就在眼的胜义根那里产生，内声尘就在耳的胜义根那里产生出来，五尘各自都在相对应的胜义根当中出生。</p><p>内五尘出生以后，就和胜义根相触。触，没有谁主动触和被动触之说，比如说一盆花，这花盆里有土，从土里长出花来，花和花盆是谁触谁呢？肯定是只要花出生了，就和花盆相接触，没有谁触谁，是互相同时触的，同时碰到一起的。</p><p>而六识生出来时，就会主动触六尘，因为识心有主观能动性，有选择性。六根和六尘一直在触，六识出生之前，识种子就会对相应的尘境生起作意，然后就在根尘相触之处出现，形成六识，六识再参与根尘之触，三者和合触，六识就能接纳和领受六尘，再然后其它心所法就出现和运行了。</p><p>以上的内容清楚了，就会知道黑匣子里的事，我们所分别的六尘都在胜义根黑匣子那里。根尘相触，尘不离根，因为胜义根的位置永远不改变，如来藏二次变现出来的色尘、声尘、香尘、味尘、触尘、法尘等内六尘都是在那个位置出现。所以我们分别的世间万法，宇宙器世间等等内六尘，都在黑匣子那里。</p><p>八、胜义根黑匣子就是六识了别的整个世界</p><p>六识在哪里出现呢？当然也在根尘相触处的胜义根那里。虽然识心无形无相，没有具体处所，不在色身的里外和中间，但是如来藏就是把识种子输送到根尘相触处的胜义根里，那么六识就在这个黑匣子里分别广阔的天空，和浩瀚的宇宙器世间，分别色身当中的一切法。</p><p>黑匣子部位的内相分六尘境界，就是我们心灵遨游的全部世界，虽然除此之外还有很多法尘，那是第七识单独接触和了别的内容。六识因为有无明遮障，在受局限之时，只能了别黑匣子里这些内容，或者是了别这些内容当中极少的一部分，也许也了别不清楚，这就是可怜的众生无明的果报。</p><p>所以我们六识分别了别的一切活动都在黑匣子那里进行，即使是身体上脚趾头的触尘，也会传导到胜义根里成为再次幻化的影像，身识和意识也是了别胜义根那里的脚趾头影像，不能直接了别胜义根之外的脚趾头，胜义根黑匣子就是六识了别的整个世界。</p><p>我们若能观行到这点就知道，根是多么的虚妄，尘是多么的虚妄，识是多么的虚妄，哪个不是刹那生灭的呢？都是刹那生灭的，根由四大组合的，是刹那刹那生灭的，尘是由四大组合的，更是刹那刹那的生灭，识呢，一个识种子一个识种子生了就灭，灭了又生，也是刹那生灭，哪有不生灭的呢？这世间万法全都是生灭的。</p><p>外界的山河大地，色尘、声尘、味尘、香尘、触尘等外相分，是所有众生的如来藏共同出生、变现和维持的，我们的如来藏去缘那个外相分的时候，就会摄取外相分上的四大，摄取过来就形成了微粒，成为了光子，就会一直传导过来，通过五根的浮尘根，以及传导神经，传导到胜义根里，然后根尘相触，如来藏出生六识，就了别到了外界山河大地的影子，于是就把这些影子，当作真实的外法，百般执著，较计不已。</p><p>意根不管是作意不作意，决择不决择，如来藏永远都会通过前五根变外色尘为内色尘，变外五尘为内五尘。只是意根如果不攀缘，不生起思心所，如来藏就不现起六识触内六尘。内相分的现起不是因为意根作意才出现的，不是这样的，内六尘总是存在的，时时刻刻都有，只要有五根，而且五根完好，就有内六尘的存在。</p><p>眼根只要存在着，如来藏不管外边的色尘重大和不重大，祂时时刻刻都在通过眼根，把外色尘传入过来，传到胜义根里。意根起作意，想看时，如来藏就变眼识意识出来，眼识意识分别完内相分以后，就把信息传给意根，意根就对信息作了别，了别以后再作意再决择。决择了以后下一步要干什么，如来藏都知道。　同时眼识、意识、七识，七个识的识种子回到第八识当中，这样就把了别的信息带回到如来藏里了。那么如来藏就把了别的信息存入进来，这叫收存种子，记录业行。外色尘外五尘是由共业众生的如来藏共同变现，内六尘是我们各人的如来藏单独变现，是外五尘的影像，内外六尘是有区别的。</p><p>九、根尘相互作用的原理</p><p>外六尘在宇宙当中一直存在着，是所有众生的如来藏共同出生、共同执持的。执持方式是用四大种子来执持，其中四大种子刹那刹那生，刹那刹那灭。外面的六尘境界同样也是在刹那刹那生、刹那刹那灭。而四大种子在生灭的过程中，会往外散发到各自的如来藏中，所以我们会感觉到物质周围有磁场。</p><p>如来藏把四大种子微粒摄取过来时，我们想看的时候就通过五根的各种神经系统传导进来，比如说眼睛里的玻璃体、神经传导系统，把外边物质散发出来的四大微粒一直传导到眼的胜义根里面，内色尘就落在那里，然后根尘相触。</p><p>这个过程中，意根能先了别大概是什么法，想细微了别的时候，就出生眼识和意识去完成，如果不想细了别，六识就不知道。就是说在胜义根里的法有很多，意根不想了别的时候六识就不知道，那么我们就看不见那些由外六尘转换过来的法。</p><p>耳根传过来的法也是这样，乃至于身根传过来的法也是这样。在传导过程中法尘也同时跟着一起传导过来，生成内六尘。内六尘和外六尘有些相像，或者说是非常相像。我们了别内六尘就像了别镜子里的影子，而看不见的外六尘，就相当于镜子外边的实物，那个实物是由四大组成，只有如来藏本体才能够缘得到，七识心缘不了，等到如来藏像镜子一样把六尘本体幻化过来以后，照出了影子，七识心才能了别这一部份。</p><p>十、根尘识三者的和合触</p><p>心法是七个识，色法是五根六尘，根尘识三者属于三界法，是三种界限的法，界是界限之意。界限不同，按照世俗界的法则来说，就是不搭界，不能融合在一起，不能和合起来运作。其实识界与色界不同界的触，不能从世俗界的角度理解为类似于手与手的触，或者是手触物质色法那种碰触、接触的触。甚深极甚深的唯识种智之法，从世俗法角度无论如何都讲不通，也理解不了，世俗界的思惟模式永远解决不了唯识问题。必须让六七识转识成智，转世俗界识的认知思惟方式为非世俗界的智的认知思惟模式，才能逐渐解决唯识种智的问题。</p><p>如何从唯识种智的模式来思惟根尘识三者的和合触呢？我们应该知道，根尘识三者虽然界限不同，法的种类不同，但是有共同的部分，就是都由如来藏中七大种子所构成和形成的，而七大种子是平等平行并列的关系，属性不同，没有界限，完全可以融合相触，随众生的心而出生一切法，如楞严经中佛说。这样就容易理解不同界的法是否能相触的问题了。</p><p>七大种子都无形无相，都谈不到如世俗界物质色法那种的触，因此也不涉及触不触的问题，那么形成的根尘识三者就不是世俗法的触。这样说很多人还是难于理解，因为世俗法与佛法跨越的层次太大，甚深佛法往往超越于自己的想像，正如佛所说，佛法非测度揣度而得，必实证才能体会。</p><p>无形无相的七大种子，输送出来形成的根尘识，有形相吗？所谓的形相是指俗界肉眼可见的那种相貌，从实际理地，从圣义谛来看一切法都没有世俗界的那种相貌，都是圣义谛之相，肉眼不可见，有见即有眚病，病眼见空花，如楞严经中佛说。</p><p>识心，无形无相，肉眼不可见，只能由意识感知，最后让意根也同知。根尘，是色法，有色，有形有相，肉眼可见。根尘都是同种属性的色法，可以如手脚相触般的触，识心再触根尘触色法，犹如镜子触影像，影像非实色法，镜子可以触可以显现，非实色法的影像可以在镜子中出现，叫作幻现。七识所触的都是非实色法的根尘，都是影像，所以影像可以出现在七识心的镜子中，而无障碍。实色法谁能触呢？只有如来藏能触这类实色法和最原始的色法。</p><p>这些圣义谛的运行法则和规则，我们从世俗谛的角度，根本无法理解和想象，所以佛不让我们想象和情思意解，让我们戒定慧具足之后的实证，只有实证的人，互相之间能够意会，因为道者同谋，道者同见。</p><p>识种子累积成的识心，落在五大种子堆积成的根尘色法上，种子都没有任何世俗界的相貌，形成的根尘识如何能有相貌？最初的原始色法，如果有相貌，如来藏如何能触、能识别、能传导、能变现、能显现？如果最初的原始的色法都没有相貌，如来藏显现出来的影像色法，色法影像如何能有相貌？都是无相貌之法，根尘识三者完全可以互相触，识心完全可以显现根尘了别根尘，从而出现虚妄的喜怒哀乐悲苦受。</p><p>根尘识就是出现在黑匣子世界里的法，虚幻不实，病眼所见。</p><p>十一、声音传播的奥秘</p><p>眼睛看色的功能，佛在楞严经里说，眼根的功德只有八百，不是圆满的一千二百，只有一千二百功德的三分之二，因为眼根有不圆通的地方，身体后面的色尘，眼根就看不到。耳根听声音是圆通的，四面八方都能听得到，隔着墙也能听到，很远处的声音也能听到，身体后边的声音也能听到，什么地方的声音我们都能听到，所以耳根圆满一千二百功德。</p><p>耳根听声音的原理也与眼见色的道理是一样的，声音也是由四大种子组成的物质色法，如来藏缘声音时，也会摄取声音上的四大微粒传导到耳的胜义根，根尘相触，然后如来藏出生耳识意识来了别声音。我们自己身体里发出的声音，只与自己的如来藏有关系，是自己的如来藏单独变现。</p><p>但是我们听外界传过来的声音，或者听他人发出来的声音时，自己的如来藏会摄取其他众生发出的声音的四大微粒，传导到胜义根里，变造成自己听到的内相分的声音，根尘相触，如来藏再出生耳识意识了别声尘。先是耳识第一刹那了别，后是意识第二刹那了别，然后二者和合共同了别，这样就好像是听到了别人的声音。</p><p>我们所听到的各种物体发出的声音，或者是宇宙虚空当中发出来的各种声音，是由共业众生的如来藏一起变造出来的，并且共同执持着。我们的如来藏也是依着自己的业缘，把这些声尘摄取过来形成四大微粒，也是刹那生灭，这个灭那个生，出生四大种子的处所会依次有略微的变动，于是我们就感觉声尘好像是连续运动变化的。其实是刹那生灭的，因为生灭的太快速了，我们就感觉不到生灭的真实现象，只能看到好像不是生灭的假像。</p><p>所有生灭性的四大微粒，好像一直传导着似的，其实后一刹那的四大微粒不是前一刹那的微粒，已经有微略的改变了，传导到耳根时，四大改变得就能明显一些了，这样声音的四大微粒一直传到耳根，从很远的地方传导过来，它的传导能量就会慢慢的减少，距离越远传过来的声音就越小越微弱，就好像是能量不足了，传导的势力越来越微弱了，其实是声音这种物质色法发生了改变，四大不同了。</p><p>没有什么能量之说，所谓的能量，就是四大构成的物质微粒，比如光子、电子、中子、质子之类的粒子，它们在不断地生灭变化，此灭彼生地，一个连着一个，就好像有了能量。而且这些粒子是沿着一定的轨域在刹那生灭变化，就好像物质是沿着轨道在运动似的，在粒子的表面运动当中，四大种子是在不断变化的，我们看到时，就觉得是能量的转变。而如来藏在其中所起的作用，我们却不知不见，只知表面现象，这就是无明。</p></div>"
},{
    "title": "第七章 意根与黑匣子的关系",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  意根与黑匣子的关系</strong></p><p>一、意根是黑匣子里的总指挥总调度</p><p>意根是作主识，对五阴身行使主权，五阴身里的一切法大部分都集中在胜义根黑匣子里，内五根、内六尘加六识，这些都是意根的从属，都归意根所有，听从意根安排和调度。意根若想见色，调度出眼识意识出来见色，意根随之见，但不保证不错见；意根若想听声，调度出耳识意识而听，意根随之听，但不保证不听错；</p><p>意根若想嗅香，调度出鼻识意识而嗅，意根随之嗅，但不保证不嗅错；意根若想尝味，调度出舌识意识而尝，意根随之尝，但不保证不尝错；意根若想觉触，调度身识意识而觉，意根随之觉，但不保证不觉错。意根若想神思遐想，调度出独头意识海阔天空，意根随之遨游，但不保证想的都对，也不保证是现实境像。</p><p>出错的原因有多种：（一）胜义根有问题，导致落到胜义根里的六尘相扭曲变形，六识无法正确识别，意根随之看走眼；（二）六识散乱粗糙，了别不细致不清楚，意根随之看走眼；（三）意根本身烦恼遮障重，六识无法细致无误的了别清楚，容易看走眼；（四）意根精神错乱狂乱，住妄想境不肯出，对一切境界的识别全部出错。（五）五浮尘根有问题，六尘一路通过五浮尘跟传导出来的尘境就会变形不真实，六识了别错误，意根就会看走眼。</p><p>二、特殊情况意根快速灵敏的反应</p><p>    遇到紧急特殊的情况和重大事件，意根为什么能够非常快的作出反应，意识都来不及考虑什么，就应对完了？因为意根不仅能了知落到胜义根里的六尘，也能了知在胜义根之外即将入到胜义根里的六尘，这些六尘在进入五浮尘根之前，意根就随着如来藏了知到，进入五浮尘根以后在传导神经里传导的时候，意根还是能了知，进入大脑皮层的时候还是能了知，最后才进入胜义根里，意根更能了知。意根也掌控胜义根之外的大脑皮层组织，那么意根就能了知到经过大脑皮层的六尘。</p><p>既然意根能了知到传导过程中的六尘境界，就会对一些特殊的重大的六尘境界有所警觉，如果发现有特殊情况，根据经验知道对自己有害，应该会规避和紧急处理，当六尘进入胜义根里的时候，意根马上决定如何处理，于是六识立时出生，按照意根的指示进行处理和应对，不会让意识多加衡量和考虑，六识就处理完了，过后独头意识再回忆和思惟整个事件的发生和结果。</p><p>三、意根与意识各对应什么尘境</p><p>意根既是内识，也是外识，对于胜义根里的内相分和胜义根之外的外相分，全部都能了别，只要是第八识依本质境变现出来的法，意根依着第八识都能缘和了别得到，包括五尘境。而意识只是内识，只能缘胜义根里的法尘，其他的尘境都不能缘，有神通时除外。</p><p>第八识缘本质境的时候，把本质境上的四大微粒摄受过来，并且马上就变现成相似本质境的尘境，然后再一路传导到胜义根里成为内相分。这中间要经过很多介质的传导，一直传到五浮尘根，在传到五浮尘根之前这部分都属于外尘外境外相分，那么外境总共有多少个层次的相分？通过一个介质就形成一种层次的外境相分，然后这个尘境相分就改变一次，再通过一个介质尘境相分又改变一次，通过的介质越多改变的越多。那么外相分有几重相分呢？有几重介质就有几重外相分。</p><p>然后相分传到五浮尘根的时候，再通过五浮尘根的传导神经，往胜义根里面传，没传到胜义根之前的相分还属于外相分，或者是属于半外相分半内相分的时候，传导的介质是五浮尘根，外尘又改变了一次。在这之前意根对于第八识变起的所有相分一直都缘都了别，那就说明了意根能了别这一路不断传导和变化的外相分尘境，而六识并没有出生更不能了别，那么意根了别的外相分离胜义根有多远呢？由根到本质境那么远，离本质境非常近。</p><p>而意识了别的内相分离本质境比较远，离五浮尘根也有一段距离，只能了别胜义根里的相分，胜义根之前的相分尘境，六识都不知道。六识知道的法非常的狭窄，意根知道的法非常多也非常宽广，知道的时间也比意识提前很多。所以遇到特殊事情的时候，我们来不及思惟就有突然的反应和应对，就是意根先了别作出的决定。这时候虽然没有意识，意根自己单独了别也知道个大概情况，也能判断出来事情对自己有什么影响，如果会有比较大的影响，意根就会先作出反应。</p><p>作出反应以后，相分尘境已经传导到胜义根了，六识马上出现，就按照意根的心思处理尘境，之后意识才反应过来刚才发生了什么事情。这就是意根先了别外六尘产生的结果。意根了别外相分时，也许所有外相分全部都了别，外尘境传导的整个过程意根都知道，所以祂的决定早已经下完了，之后六识才出现，就按照意根的决定作出非常迅速的反应和应对。</p><p>四、意根的应急反应</p><p>比如在开车过程中，突然遇到前方有一辆车迎面冲过来，马上就要撞到一起了，司机突然急转弯就避开了对面的那辆车，没有撞到一起。然后意识一回想才明白是怎么回事，于是惊出一身冷汗。刚才就是在意识不知什么情况的时候，意根决定急转弯避开。</p><p>意根为什么能这么快的作了这个决定呢？因为对面冲过来一辆车的尘境，在还没有传入到胜义根里的时候，意根就了别到了，心里就已经有了抉择，对面车的尘境传到胜义根里时，意根立即决定转弯，意识来不及思惟和细了别，不明白什么情况的时候，就被意根调动着与身识一起进行转弯操作。如果意根没有了别到胜义根之外的六尘境界，那么六尘传导到胜义根里时才了别到，然后再思量抉择，就来不及躲避那辆车了，一定会撞到一起。</p><p>比如开水突然烫到自己手上，意识来不及想什么，立时甩手。意根对于开水以及水滴洒落出来情景的了别，在大脑皮层那里就开始了，甚至在刚刚进入五浮尘根的时候就开始了，甚至在还没有进入五浮尘根的时候就开始了。以至于开水的尘境一进入胜义根里，立时就让身识和意识躲开甩开，避免烫伤皮肤。</p><p>还有身根的尘境也要传入到胜义根里，包括烫的触尘，这样手与开水烫的触尘相触，这些相都进入胜义根里，立时就出生身识意识来处理这个事情。这样的事例有很多，大体过程都差不多，原理都一样。都说明意根掌控的范围很大，远远大于意识六识所触及的范围。</p><p>五、意根的总指挥部</p><p>意根是一个特殊的根，既是根，又是识。作为根，与前五个有色根不同，祂是无色根；作为识，祂是作主识，具有恒审思量、事事攀缘、处处作主的体性，无始劫以来就与第八识并存。既然意根能够时时处处作主宰作指挥，那么祂的总指挥部在哪里呢？</p><p>意根牵一发动全身，祂牵一发的总指挥部就在大、小脑之处。而身体内部的各个重要脏器就不是意根的指挥部，是由如来藏单独执持并运转的，意根虽然可以接触到，但是不能直接起到调控和作主的作用，比如：心跳、呼吸、血压、脉搏、体温、胃肠道的蠕动与消化腺的分泌等等都不受意根控制，所以身体内部的脏器不是意根的指挥部。</p><p>但是意根及意识的情志变化，可以间接影响到这些脏器的运转。比如说怒伤肝、喜伤心、忧伤肺、思伤脾、恐伤肾等等现象；还有当意根情绪激动时能导致血压骤升、心率加速；当意根思虑过重时，能抑制消化道的蠕动并拮抗消化液的分泌，导致罹患胃肠道疾病。周围神经系统中与脑神经相关联的人体器官是受意根支配的，比如转眼球，眨眼睛，吸鼻子，吐舌头，抖耳廓，做鬼脸，吧嗒嘴，吹口哨，鼓瘪肚子，扩缩胸部，伸展四肢等等。</p><p>意根主要是控制六识的运转，六识依黑匣子里的六尘产生出来，黑匣子里的五尘分别处在胜义根五个不同区域，五识在各自相应的五个区域产生，五俱意识则分别在五个法处所摄色处出生，意根则在大脑、小脑部位作主调控指挥。意根以大、小脑皮层的各种感知区及功能区作为指挥场所，发挥着视、听、嗅、味、触觉及语言、思惟、运动、平衡等功能调控作用，显而易见，黑匣子就是意根的总指挥部。意根也在大脑皮层、额头位置和前脑位置调控，大脑皮层在最外层，首先接收物质信号和信息，意根先收到信息，先有反应，然后才有意识的反应，所以意根最灵敏，也最微细难察，超过意识。</p><p>胜义根之外的六尘叫作外尘，除了本质境之外，意根都能随着如来藏接触到，外尘进入大脑胜义根成为内尘，意根还能接触，内外尘意根都能接触，并且能作抉择是否需要细致了别，从而调控六识。而意识只能触内法尘，范围非常有限，所知的法就有限量。所以意识的知与意根的知不能比，意根知的很多法意识都不能知，那祂对于意根的了知就非常有限，不知的有很多。偏偏众生都是以意识的知为知，意识不知而意根知的，通通说为不知，这就是意识的愚痴性。所以意根在以黑匣子作为总指挥部的同时，还能统帅前六识为其所用。</p></div>"
},{
    "title": "第八章 如来藏与黑匣子的关系",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  如来藏与黑匣子的关系</strong></p><p>一、如来藏之间的沟通互动</p><p>如来藏既然无形无相，遍五蕴，遍一切处，遍一切界，遍一切时，遍一切地，遍一切法，整个世界宇宙器世间，到处都是如来藏的踪迹，如来藏就没有在哪里和不在哪里之说，没有到哪里去和不到哪里去之说，祂就没有来也没有去。既然没有来没有去，又有五个遍，众生的如来藏之间是不是要重合起来，祂们之间是不是互相影响、互相沟通的呢？</p><p>虽然每个众生的如来藏都有这几个遍，但是如来藏和如来藏不会重合在一起，因为都是无形无相之故，如来藏之间互相有沟通，因为是同一类的识心，所以祂们肯定互相之间都有联系，都能互相沟通。遇缘时，就会把对方心体里所存的种子了知到，那就会了知到对方所执持的五阴身。如来藏了知对方如来藏里的种子，就了知了对方如来藏所变现的那一众生的所有五阴状况，生生世世的事都会知道，所以如来藏和如来藏之间就没有秘密。</p><p>我们的如来藏缘对方的如来藏时，就能把对方如来藏里的一切法都了知到，对方如来藏里的种子我们如来藏也能够了别到，我们如来藏里的种子，对方如来藏也能够了知。所以有缘众生的如来藏之间，就能互相了别对方的业种，就会警觉各自执持的五阴，五阴之间就会有感应，如果有善缘就会融洽祥和，两个众生的五阴就感觉非常和乐；如果有恶缘，如来藏互相都知道恶缘种子，就会警觉所执持的五阴，两个五阴众生的关系就尴尬，如果各自如来藏输出恶缘种子，两个众生的五阴在一起就会违逆不合谐。</p><p>既然如来藏无形无相，互相都能沟通，有信息互动，那么与之有缘的众生不管在哪一道里生存，不管在哪一个世界里，或在极乐世界也好，或者是他的前世、后世也好，或者在宇宙器世间哪一个星体也好，如来藏都知道。这些信息会传递给所执持的众生五阴，敏感的六七识就会了别到或者是感觉到一部分，或者感觉到全部。</p><p>如来藏之间都是互动互通的，祂们没有时间的障碍，也没有地点的阻隔，祂们能够了别对方如来藏里的种子，而且能顿时了别，有时就能警示给自己执持的五阴知道。尤其是有道种智的菩萨，他所了知的其他人的信息，都是自己的如来藏提供出来的，意识心有大智慧，就能从自己的如来藏里挖掘出很多的信息出来，到了佛地，佛的意识心是完全的智识，那是无比的智慧，能把无垢识里的所有信息全部了知无余，所以在佛那里，根本就没有秘密，什么也瞒不了佛的心，佛了知一切法。</p><p>二、一个人对其他人的感知就是如来藏透露的信息</p><p>比如说甲乙两人在南北两地，虽然彼此不见面，两个如来藏之间也会有信息沟通，乙的所有情况甲的如来藏都知道，只是甲的五阴不知道；甲的所有情况乙的如来藏也都知道，只是乙的五阴不知道。但是各自的如来藏了别了对方如来藏里的种子以后，遇缘就会各自把对方的种子信息警示给五阴，甲乙两个五阴的感觉就不一样了，意识越聪明伶俐，感觉越不同，两人就会按照从前的缘分来交往，或善或恶，都是各自的如来藏根据业种在起作用。</p><p>两个众生前世有缘，不管他们各自都在哪里，在畜生道也好，在恶鬼道也好，在极乐世界也好，两个如来藏都会了知到。一个众生在宇宙的一个星体上，另一个众生在其它的星球上，两个如来藏之间会有信息沟通，一旦缘成熟祂们就会起作用，让两个众生遇到一起，实现前世的业种，因缘就起用了。</p><p>如来藏之间都有信息的联系和沟通，因为如来藏没有区域性，没有时间地点的局限性。比如甲众生前世的事，或者那个与他有缘的乙众生前世的事，甲乙两个众生的如来藏都能通过对方全部作意了别到，这是如来藏本来而有的智慧德能。</p><p>修到有唯识种智的时候，一接触对方，就能感知到对方的一部分业种，就会知道此人前世的大概情况，也会判断此人后世的大概情况，往往看人很准。两个如来藏能互相沟通，有唯识种智的人，他的意识心就能从自己的如来藏里感知到对方的大概情况，没有唯识种智的人，就很困难了。</p><p>所以有些时候，众生自己还不知道自己的心行，而别人就已经知道了，比他自己还了解他。一个人一开口说话，他自己觉得没有什么，可是自己的很多信息都泄露出去了，而他自己还不知道。感知对方的信息，从各个方面都能感知到，当然面对面会更准确一些，要看对方的五官，看表情言语，看对方的表色和无表色，形象、气质、韵味等等，了知的会更全面，更准确一些，这些都是如来藏赋予意识心的智慧。</p><p>三、一切法都是如来藏的功能属性</p><p>当我们明心见性以后，再往后观行，就知道七识心的一切作用，到最后全都是如来藏的功能体性，六根的一切作用到最后也都是如来藏的功能体性，六尘的一切的生灭现象也都是如来藏的功能体性。最后就知道了这些法都不是我，我就是如来藏，就可以知道五蕴的所有的功能作用全都是如来藏，哪有什么虚妄的五蕴十八界的功能呢，五蕴十八界的功能全都是如来藏的功能。</p><p>观行到最后就会认可一切法全都是如来藏的功能，没有其他什么法的功能；七个识的分别作用，全都要归结到如来藏，七个识的了知性全是如来藏的作用。这种现观，没办法用语言让他人也同样如实领悟，只有自己有能力现观时，才能有所体会。到初地的时候，就会知道如来藏自己本身就能够见六尘，变六尘，缘六尘，一切的境界祂都知道。但是如来藏这种见和了知，并不了知六尘的具体相貌，祂只是了知种子位的一切情况，然后变身根，缘身根，一切都是如来藏的作用，所有的了知性全部都是如来藏的属性。</p><p>四、意识对一切法的知有大秘密</p><p>我们可以做个试验，来证明一切法都是如来藏所现起的。就拿眼根眼识来作观行，我们知道见色的功能作用，是眼识和意识共同了别，共同作用，才能了知色尘。但是当我们闭上眼睛，眼识在色尘上不现起，却也能够知道色尘。比如说，闭上眼睛时，用手一摸，摸到一张桌子，虽然没有开眼看是什么，却知道是桌子，马上感觉到这是桌子；然后再摸这个桌子的形，四方形还是圆形，就知道这个桌子的形状；我再摸桌上的东西，摸到一本书，一摸书皮什么样的，根据手感，就知道是什么书，根据手感知的形状、大小和厚度，就知道这是哪本书；再摸桌子上有一个圆圆的光滑的东西，马上就知道了是苹果，这当然是意识心的了知，不离意识心的记忆功能，但是背后还有很多的秘密。</p><p>虽然没有眼识的参与，我们也了知了苹果、书和桌子的色法，只是没有看见颜色，但是颜色可以想像和回忆，也能非常准确。那么整个桌子和书本的形象就在我心里显现出来了，我就可以依此进行后续的身口意行。这里的前提条件是，意识必须有过经验和经历，才能不用眼识的参与，而单纯的通过触觉，就能辨别色尘为何物。</p><p>当然这种了别作用当中，是有非常深奥的秘密的。我们对一切色法的了知，不一定只有眼识的知和意识的知，还有意根的知，尤其是还有如来藏的知。最后观行到这些功能作用，全部是如来藏的，哪有什么真正的眼识、意识、意根，前七识全是如来藏的功能作用。最后知道了我是什么，我就是如来藏，我不是五蕴十八界，五蕴十八界不是我，如来藏才是我，观行到最后，就会得出这个结论。</p><p>比如楞严经中佛也讲，我们在黑暗当中手摸自己身体，从头摸到脚，虽然看不见身体，手摸到哪，就知道这是身体的哪一部分，摸到头时，知道这是我的头；摸到头发时，知道这是我的头发，是长的还是短的，多长多短；摸到眼晴，知道这是眼睛，我们看不到眼睛，也能知道这是眼睛，即使睁着眼睛，也是看不见眼睛的，但手一摸，就知道是眼睛了。</p><p>摸到鼻子呢，也知道这尖尖的就是鼻子；再摸到脚，就知道这是我的脚，不用眼睛看，也知道这是我的脚；摸到脚趾头，也知道这是我的脚趾头。这些都不用眼晴看，眼识不现前只辨别黑暗，意识就能辨别出来了。当然这里还涉及到了意识的记忆功能，除此之外，还有身识的知，尤其是有意根的知和如来藏的知，而后两种知是非常关键和重要的，无量神通的奥秘也就在这两个识的知上。</p><p>意根和如来藏能统摄一切法，如来藏变现什么法，意根就能缘什么法，就能领纳什么法，就能了别什么法。所有的色声香味触法六尘境界，身根的境界，五根、五尘、法处所摄色这十一种色，都有一个知来了别，这个知是什么，到最后就会证得了。修到一定程度，就会证得一切法全都是如来藏的功能作用，如来藏才是我。成佛时，如来藏就是真真正正的常乐我净的我，这些虚妄的功能作用都不是五蕴我的功能作用，全都是如来藏所变现出来的，都是如来藏的功能作用。</p><p>五、不用眼识为什么也能见色？</p><p>再比如说盲人，盲人走路时看不见路面，他就拄着一根拐杖，拐杖往前一探时，碰到一块石头，意识心就觉得很硬，虽然他可能不知道是石头；他拿拐杖碰到石头时，也没有看到石头，身体也没接触到石头，他就知道前面的东西有阻碍作用，就会尽量避开走路。他没有眼睛，他能知道是石头，或者知道是硬的，能绊脚的东西。所以知道硬，或者知道是石头，知道色尘和触尘，不一定是用眼睛来见，不一定是用身体来触，还有其它了别的方法，当然其中都涉及到了大秘密。</p><p>比如说导盲犬，盲人用导盲犬，导盲犬一看前面有阻碍，就转了方向，盲人被牵着也转了方向。于是盲人眼睛不用看路面，就能知道往前走，往后走，往左走，往右走。这个知就很奇怪了，这个知，不用眼睛就能知道，或者不用五识之一就能知道尘境，我们把这些功能都开发出来，六根就会互通互用了。</p><p>再比如我们闭上了眼睛，虽然不见外色，但是也能看见黑暗，黑暗也是色的一种，闭眼时间长了就不觉得太黑暗了，眼前会出现一些光色，没有禅定的人会看见五颜六色，有禅定的人一开始看见是红色的，然后是金红的，到最后是淡黄色的。再最后，看见的光色就更淡一些，更明亮一些了。我们的眼识虽然不现前，闭着眼睛也能看见眼前的色，这里的见性，都有谁的见性呢？</p><p>这些功能作用说明了什么？说明在我们表面的虚妄功能的背后，还有一个真实的永不坏灭的德能性用，祂能统摄一切法，我们可以不用五根，就能有见闻觉知性 六根的作用到最后都是谁的作用呢？全都是如来藏的功能作用。当我们不再认六根的功能作用为我为真实，越来越不执著六根的功能作用时，我们本具的智慧德能就会显现出来，光明开敷，这些功能作用全都开发显现出来，一切法就再也没有阻碍，再也不是什么秘密了。</p><p>当我们再也不执着明暗色相的时候，眼根就被降伏了，可以用意根来代替眼根的功能，眼通就能发起来，到最后就有佛眼了。当耳根不再执动静二相，不去分别动静时，耳根就得到降伏了，意根就会来代替耳根的功能，耳通就出现了，六根都可以互通互用。其实六根都是由意根和如来藏统摄在一起的，完全可以用意根和如来藏来代替其功能作用，只是众生迷执六根时，六根的功用就有了局限，各根就只能有各根单独的功用，不能互通互用。</p><p>我们修行把六根降伏下来，无量的神通和智慧德能就都能显发出来。那么见一切色，就不用循着明暗，明暗是眼根所对的，听一切声音，就不用循着动静，嗅一切香，就不用循着通塞，尝一切味，就不用循着恬淡，六根都不用循着这些生灭的虚妄相，那就会恢复了本心本性的作用，最后都是如来藏的圆明了知，那时就成佛了。所以学佛修行多么好，我们把六根六尘六识的功能体性作用全给摸透，最后就在这上修，就能够圆满成就一切种智，无量的智慧就会圆满具足。</p><p>六、黑匣子里的根尘识都由如来藏变现</p><p>黑匣子胜义根这里，最初是在母胎里由如来藏一点一点用四大种子构造出来的，包括眼耳鼻舌身的五个胜义根。构造成熟以后，色身就出母胎，之后随着年龄的增长，如来藏用四大种子不断的成熟完善胜义根，不断的执持着胜义根，也让胜义根成熟之后渐趋老化，最后归于空亡。</p><p>而黑匣子里所装载的内容物是色声香味触法内六尘，由外六尘依次通过传导神经存入黑匣子里，刹那生灭变异，速生速灭不停留。如来藏从本质境上把外六尘摄取过来，一路传导，中间要经过层层介质，每经过一层介质，外六尘上的四大微粒就会被阻挡住一部分，外六尘就要改变一层，尘境就会有些微的变化，经过的介质越多，改变的就会越多。</p><p>传导到五浮尘根的时候，五浮尘根也是一层介质，也会阻挡一部分微粒进入传导神经当中，六尘就又改变了一些。等到进入后脑胜义根成为内六尘的时候，不知道改变了多少次，阻断了多少四大微粒，内六尘与外六尘的差别究竟有多大。那么外六尘与内六尘的关系是什么呢？外六尘犹如镜子外的实物，内六尘犹如镜子里的影像，二者相似，却不完全相同。所以我们所见得到的六尘境界，根本就不是真实的，不是六尘的原貌，是变异了又变异的，我们却傻傻的那么的执著不已，宝贝得不得了，何苦来哉？如果没有如来藏，无论是实物还是影像，我们都无法见得到，何况还能执取。</p></div>"
},{
    "title": "第九章 如何摆脱黑匣子的束缚得解脱",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  如何摆脱黑匣子的束缚得解脱</strong></p><p>一、黑匣子胜义根本身是生灭变异的</p><p>正确认识黑匣子世界的虚幻不实，才能摆脱黑匣子的束缚，从而走出黑匣子，处于大光明之中。黑匣子如何虚幻不实呢？首先黑匣子是大脑胜义根，是在母胎里如来藏用四大种子生成的，是从无到有的法，将来也会从有到无的灭去，且中间还会出现种种变异，逐渐衰老和出现病变，因此是不可靠之法，不能依赖和信赖。</p><p>其中眼胜义根是生灭变异不可靠之法，出现病变之时，或者眼盲不能见色，或者见色出现障碍，见色不真，见色扭曲，眼胜义根四大分解灭去之时，将不再能依之见色；耳胜义根、鼻胜义根、舌胜义根、身胜义根也如是，生灭变异不可靠，出现病变之时，不能正常听声，嗅香、尝味，不能觉触，四大分解时，功能作用全部灭去，无法再依之听声、嗅香、尝味、觉触。因此智者不能不以胜义根为我为我所有，心不依赖黑匣子而生执。</p><p>二、证知胜义根、内六尘和六识的虚妄无我性</p><p>要想摆脱黑匣子的束缚，就要认清胜义根、内六尘和六识的虚幻不实，断除十八界我的我见，才能挣脱黑匣子的束缚，早日得解脱。通过对胜义根黑匣子的观察，对内六尘的观察，对六识功能作用的观察，逐渐证知到五胜义根是生灭变异不实的，是后天在因缘具足的条件下出生的，无因无缘不能出生，因此是虚幻不实的。</p><p>证得内相分六尘是生灭变异不实的，是在一定的因缘条件下由四大种子构成的，因缘不具足时，就没有内相分六尘的产生和显现；证知到六识是生灭变异虚妄不实的，是在一定的因缘条件下出生的，是识种子构成的，其功能作用是虚妄不实的，因缘不具足时，意根不抉择时，六识就不会出生和运行，因此说五胜义根、内六尘和六识都是不实之法，也不是我，这样就会断除了黑匣子以及其中的一切法为我为真实的虚妄见，从而就摆脱了黑匣子的束缚，心得解脱，未来才会有广大的甚深的功德力用。</p><p>三、证知黑匣子里的六尘境界是虚妄不实的</p><p>黑匣子里所有的境界相都是如来藏用四大种子变现出来的，犹如镜子当中的像，没有实际功能作用，只是显现出相貌罢了。镜外的相是如来藏用四大所创造的原始相，如来藏摄取原始相中的四大微粒，一路传导到五浮尘根，中间经过许多介质，四大微粒有所变异，经过五浮尘根再通过传导神经传导到黑匣子里，成为内相分，与外相分的原始相好像一致，其实是有一定差别的。即使内外没有差别，也是虚幻不实的，有差别更说明黑匣子里的境界相是幻化不实不真的。</p><p>四、证知黑匣子里六识的识别性是虚幻的</p><p>通过五浮尘根传导到黑匣子里的内六尘，与五胜义根和意根相触，意根抉择了别，六识就会出生了别和处理六尘境界，否则就不出生。六识所了别的内相分六尘，就像镜子里的影子一样，不是实质的法，那么六识无始劫以来一直是在对着虚幻的影子作不实的妄想，从来没有接触过镜子外边的实法。而当镜子出现影子时，与影子相对应的外边的境界，早已经过去了，发生变化了，六识了别的总是晚了半拍，处理的时候就慢了一拍，那么六识对六尘的处理有多大程度的准确性和真实性呢？就像做游戏一样，还玩得不亦乐乎，认认真真，真是可笑！</p><p>而六识本身的识别性了别性，其实就是一大堆识种子堆积起来，被意根指使东西南北的辨别，哪儿有事就到哪儿，受着胜义根的限制，被虚假的影子所欺骗。一旦胜义根受阻，六尘不能进入黑匣子里，六识则无法出现，如果六尘扭曲，六识分辨出来的就是扭曲的相，还以为是真实的，在虚幻的模拟外境的内六尘境界里玩耍有什么意思呢？</p><p>五、证知六尘影子是虚幻不真实的</p><p>我们看镜子里的影子的时候，无论我们对这个影子有什么感想，有什么想法，想把这个影子如何处理，不管怎么样它终究是影子，不是真实的东西，所以我们看的、听的、想的、触的一切法都是镜子里的影子，分别就是在分别镜子里的那些影子，是在黑匣子里分别。这个影子这么好看，那个影子那么迷人，就开始执取抓取，但是再怎样执取抓取，你也没有真正的享受到什么，都是影子，没有真实的作用。</p><p>就像河里的树影子再美丽，毕竟不是真实存在的，河里的月亮再圆再明亮，猴子想去抓取，一碰到水，月亮就消失了，因为没有真实的月亮。我们接触的一切境界也是，我们好像在其中享受到了，其实都没有享受到，都和影子在打交道。我们身体的感觉触觉，眼睛所看到的、耳朵所听到的、口腔里所尝到的、鼻子所闻到的都是影子，并不真实，可是我们没办法跳出来，没办法了解这些事，把这些影子当真实的来抓取，好像是享受到了，好像是取得了，其实都没有取得，也没有享受到，全部是幻化的。</p><p>六、证得一切法都是无我的就会得解脱</p><p>我们学佛修行从凡夫到成佛这一整个过程，就是要循序渐进的证得一切法都不是真实的，都是如来藏幻化出来的，都是空的假的，都是影子，都是梦，到最后证得全部法都无我，所有的法都不真实，那个时候我们就从梦中彻底醒过来，成佛做祖，究竟彻底解脱，再也不用修行了，所以修行过程是不断的改变自己认知的过程。把一切法当真的这个理念和思想，要慢慢的改变和消除，认识到这一切法都不是真实的，最后就能证得确实不是真实的。然后整个的心行就会改变了，成为没有染污的、没有无明的心，七识心就彻底转识成智。</p><p>修行学习的过程，就是这么一个不断的得解脱，得大自在的过程。凡夫不得解脱、不得自在就是认假为真，把这些假象、把这些影子当真实的，在其中执取，造作各种业行，然后就被这业行所拘系拘碍了，心就不得解脱，也不得自在，就在黑匣子里生生灭灭、生生死死的苦恼着。修行就是破除这些无明，让我们不再认假为真，就解脱自在没有苦恼了。其实理就是这样一个理，很简单，可是修行的过程非常的漫长，因为我们意根的执取心太强烈了，无明也太深重了，需要非常非常长的时间来逐渐破除无明，逐渐得解脱。</p><p>七、种种条件满足了才能断我见得解脱</p><p>断我见这些理论方法，已经很清楚很明了了，六根的虚妄、六识的虚妄、六尘的虚妄，万法虚妄这些道理其实都已经很明了了。为什么有些人现在的心里认知，却还不是很清楚呢？那是因为福德或者是其它条件还不具足的缘故。因为福德不具足，定力就不具足；定力不具足，思惟就不够深细，比较粗糙和浮浅；思惟粗糙浮浅，意根就不明白这些道理；意根如果不明白这些道理，就不认可这些道理，就不能断我见，也不能改变自己的习气和惯性。</p><p>所以学佛不是单单地在理论上用功，还需要广修福德资粮，还要修习禅定，六度当中的忍辱、持戒、精进这些法都要修行。具备这些福德等等六度的前提条件，就是我们应该有一个离俗世的心，一个离尘的心，内心不要与这些世俗法太密切，不要太接近、太贪爱六尘了。</p><p>拥有一个离世俗的心，离欲界世俗的心，本身就具备了福德，因为心不与欲界人间相应，与欲界天界相应时，福德就增长了；心与色界相应时，福德就更大了，色界天人的福德要大于欲界天人福德；如果心也离色界，与无色界相应，其福德就更大了；如果再离无色界，那个福德就无量无边的广大，其禅定就能次第发起，与上界相应，心量也就会逐渐广大，其福德简直不可思量。</p><p>如果能发起成就佛道，广利众生的大菩提心，福德就越加的广大。所以断我见证得果位的前提条件，必须有出离心，心不喜爱这个世间，不贪恋世俗，那么道业就会很快速的进步。</p><p>这些法的道理都已经摆在那里，我们只要修出禅定，深深的思惟和观行就能证得了。思惟越细致、越深入越好，内心就会越认可，意根就会明了了；意识一点点地来思惟，意根就会同步一点点的参究考证确认。如果思惟的不深细，不透彻，比较浮浅和粗糙，意根就无法明了这些道理，祂还是会按照自己的惯性来思量一切法，抉择一切法，六识也就还是按照意根的惯性，来造作身口意行。所以深细思惟观行正确的佛法道理，才能真正地断我见，真正地断我执，这样才能得到解脱。</p></div>"
},{
    "title": "第十章 胜义根黑匣子的相关问题",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  胜义根黑匣子的相关问题</strong></p><p>一、胜义根的功能是此消彼长的</p><p>问：一个孩子六个月大的时候受到过惊吓，从此以后就变得像傻子一样，语言、行为和与人交流能力都受到严重影响，但长大以后却出现了令人称奇的现象，他的数学速算能力惊人，几乎超过世上所有的人，甚至能与电脑媲美。如何解释这种现象？</p><p>答：六个月大孩子大脑胜义根还没有发育完全，现代医学发现孩子刚出生时，其脑颅的大小相当于成人的四分之一，六个月大的孩子脑容量还不及成人的一半，其意识心及身体的脏器都很脆弱。当他受到很大的惊吓时，意根反应异常，就促使大脑神经系统出现异常反应，气血不能正常运行，大脑部位的活动受阻，结果造成胜义根的某个部分的功能受到损坏。</p><p>心脏血液流动出现异常，不能顺利的向全身输送血液，导致后来大脑的发育出现问题，最终形成脑部残疾，也就是通常所说的脑残。但所谓脑残也不是完全残缺，因为当人的胜义根局部受到损坏造成功能障碍时，其他部分的功能反而会增强，这就是现代医学所说的“代偿机能”，脑的这种代偿机能，年龄越小发展就越大。</p><p>我们大脑后部胜义根这个地方，结构非常复杂，它分很多区域，一个区域负责人体的某一部分功能。整个大脑都是由四大种子所形成的，这四大构成的大脑皮质、神经纤维之类的固体物质，以及脑液、血液之类的液态物质等，都是物质色法。人体的血液流经大脑，带来四大营养成分，为后脑胜义根的发育及运作提供营养物质，这些营养物质能够影响意识心的思惟，影响六个识的了别活动。当他受到惊吓的时候，血液流动不正常了，局部地区血流停滞了，血液不通的那部份脑组织就会停止发育甚至萎缩。</p><p>正常情况下，四大组成的营养物质在整个脑部是均衡分配的。因为物质色法分配得不平均，使得胜义根的某一部份营养充裕，这个区域大脑的机能就会强盛，这个地方对应的意识功就能增强。而其它得不到营养或营养不充分的区域，其对应的功能就要减退、萎缩。这个小孩在数学思维方面特别敏捷发达，没有受到不好的影响，而是在语言等方面受到了影响，还有他走路不正常，说明小脑某个地方的功能也受到影响了，因为小脑是负责身体平衡、负责走路的地方。受到了影响的地方，对应的功能也就减弱了，减弱的功能到哪里去了？用到弥补功能比较发达的那部份地方去了。</p><p>弥补，一个是在色法方面，另一个是在心法方面，用“弥补”这个词其实也不太确切，应该是说他在某个地方思惟的功能，受到补偿而变得超常发达。因为与这部份功能相应的胜义根，摄取物质四大不仅没有受到影响，而且摄取了本来应当输送给其他脑部区域的四大营养物质，这是在色法方面的解释。</p><p>从心法方面来解说，胜义根正常生长发育的人，其六识的功能应该是均衡发展的，这个孩子因为惊吓受到的影响，六识功能的发展就失衡了。六识在语言、行为和与人交流能力等方面与常人相比明显不足，而在数学思维、运算、记忆能力方面意外地得到补偿。如果现代医学科技足够发达，能将胜义根各种功能进行详细分类，并能找到解剖学上对应的脑组织区域，就会发现负责数学思惟的那部分脑组织及神经元特别发达。六识以根、尘为缘，胜义根的强弱自然会对意识思惟产生影响。</p><p>因为缺少医学生理学方面的相关知识，我无法在这个方面进行详细的说明，就从唯识方面举个例子来说吧。比如一个盲人，因为眼根受损而无法看清色境，前五识只有耳、鼻、舌、身四个识能正常运作，第六识意识的注意力，就集中在声尘、香尘、味尘、触尘的法尘上了。为了弥补眼识缺陷而导致对外感知的不足，这个盲人的耳根就变得特别伶俐，有一点点的动静，别人可能听不见，但他可能就听见了。因为他时常作意于耳根部位，如来藏就配合意根使耳根变得发达灵敏，并将能量转移到听觉上了。</p><p>为什么能转移到听觉这部份来呢？那就是意识心的分流，识种子的分流，用河水的分流来比喻，在总量不变的情况下，别的地方流量少了，流经这个地方的水自然就多了。我们识心的注意力是有限的，识种子是有限的，把有限的识种子用来平均分配，哪个功能都不强。如果把一部份功能关闭，把所有的能量，全部的识种子集中在某一方面，那这一方面的功能就特别发达。这个小孩也是这样，语言、行为以及身体行动平衡方面功能减弱了，意识心的注意力，识种子全部集中到数学思惟上了。这个小孩的精力就不外放，全部用来进行数学思惟，数学思惟的能力就非常的发达，就有了超常的数学运算能力。</p><p>从某种程度上来说，这也算是修定的一个法门。所谓的定就是心不外缘，使识种子集中流注在某处，识别的势力就变得特别强大，分别起来就非常清楚，用来观行、参禅效果就特别好。这个小孩意识的一部分功能被关闭或减弱了，他的精力全部集中到与算术相关的思惟上，这个就叫作定。</p><p>因为这种定，他就在这方面获得了一种大智慧，能够很快速和准确地算出非常复杂的题目，当然这也和前世的业种有关系，他的前世在这方面可能也非常突出，有这方面的特长，今世就会因为这次意外，把这方面的功能开发出来了。这次意外也是果报，他这个功能特长也是一种果报，正好两种果报加在一起，导致了他现在这种状况。</p><p>一个正常的孩子，他后脑胜义根的发育成长一定比较均衡，这时候胜义根运作没有阻碍，他的意识心会平均分配在后脑的各个功能区域上，这样意识心的注意力就比较分散。这样的小孩可能哪个方面的功能都可以，但是哪个方面也不突出。因为他没有定力，意识心不集中，他就没有特殊的功能出现，就不能成就特殊的事业。因为各个方面功能均衡发展，力量分散了，这个道理和修定的道理是一样的。</p><p>再看视频上的残疾小孩，从他的表情上来看，他是有禅定的，心不外散，注意力全部放在脑部思惟上，脑部思惟的法属于独影境，他全部放在独影境上了。独头意识非常强，五俱意识就减弱了，外面的世界没有让他分散很多的精力来攀缘，他的精力几乎全部集中在独头意识上，独头意识特别发达，他的算术思惟能力就非常强，这方面潜力就开发出来了。</p><p>对一个胜义根发育比较均衡的人，也可以通过后天的训练，来增强某个方面的才能。比如一些有成就的科学家，他们专注于自已的研究项目，心不外缘，精力全部集中在某个项目上，集中在一个点上，他在这个项目上研究的成就就非常突出。比如数学家陈景润，他在生活中丢三拉四，在普通人眼里就像一个傻子，那是因为他不在平时生活细节上用心，他把所有的精力都投入到专业数学研究上，才取得重大成果。</p><p>还有一些艺术家，在从事创作或演奏的时候，进入了一种全身心投入的忘我状态，这也是一种定境。因为一个人的能量、精力和识种子是有限的，平均使用或到处攀缘的话，哪部分也不会突出；如果能使识种子集中流注，所有的能量全部集中使用，就会形成非常强大的功能。</p><p>在世俗法上如此，在佛法的修证上也不例外。要想断我见，要想参禅明心，要想思惟甚深的法义，意识心就不能到处攀缘，不能过多地分散精力去关注不相干的俗世事务，不能这也放不下、那也放不下的全部装在心里。要想有成就，一定要有定力，有定力意识心才能专注，功能才能强大。因此，要想在佛法上有成就，就要有舍有得，精力不能到处散发。当然定力的修持也要适当，不能过于专注在定境上，否则就会进入深定，无法再思考了。</p><p>二、胜义根四大的消耗和补充问题</p><p>问：色身是由四大组成的，色身上的四大也是不停流转的，人通过饮食、呼吸等吸取身外四大，转化为身体所需的四大组成的营养物质。同时人身上的四大也在不停的损耗，通过各种排泄物排出。而这一切运转，只有如来藏有这个功能。人在思考时，如来藏不断摄取胜义根处的四大变现六尘，以供意识、意根了别，所以思考过甚，胜义根四大营养消耗过多，大脑就会感觉疲劳。胜义根供给四大营养不足，思惟能力就下降。人过于疲劳的时候，就要通过睡眠，由如来藏来运转四大以补充胜义根的四大营养。是否是这样？</p><p>答：独影境法尘不需要消耗胜义根的四大物质，法处所摄色需要消耗胜义根里的四大营养物质。但是意根和意识运行的时候，就要触动胜义根和神经元，就要释放生物电，就要消耗四大营养物质，因此思惟太多时，就会感觉大脑疲乏，需要休息一会，以待大脑中的能量再聚集起来。</p><p>当识心一动，大脑神经就跳动，释放生物电，释放能量消耗能量。即使入定六识不动，意根也在微细了别，暗暗的活动着，也要消耗一点点四大营养。意根活动的越轻微，消耗的越少，入定越深，意根活动越轻微，消耗的越少。入到无想定中，可以定个几劫时间或者更长时间，不需要饮食，但是身体会瘦弱下来。</p><p>三、安眠药与麻醉药是否有同样的作用</p><p>安眠药和麻醉药，都是对大脑和各神经组织起抑制作用的，能够阻止神经系统传导身体中的各种信号到胜义根，如果胜义根里没有信息，没有内尘，就不会出生六识来了别，那么身体上的痛觉不能传导到胜义根，就没有意识来感觉痛觉，身体就没有疼痛感；或者没有意识来思惟法尘，就会处于休眠状态。</p><p>既然能抑制脑神经的活动，就有毒副作用，能损伤破坏神经系统，大脑活动受到抑制，意识的思惟活动受到阻碍，能引起智力衰退、早亡早衰和痴呆症。所有的药物，都对神经系统有一定的破坏作用，药吃多了，骨头就变色，一般会变成绿色或者是黑色的，这代表毒的颜色。既然大脑和大脑的活动能受到诸多因素的影响和控制，就没有自主性，而没有自主性的法就是生灭的不真实的法，非我非我所有。</p><p>四、七识的活动都消耗胜义根的能量</p><p>关于脑电波，每一个脑神经元，有一个神经核，每个神经核，都会随时随地向外释放脑电波，这就是我们平时心理活动消耗自身能量的根源。并且在六根接触六尘时，意识在念力、分析、推理、判断时就会放出大量脑电波，意识在思惟时，脑电波向外消耗的最多，故修定人向内专注，不攀缘外境时，消耗的能量就少。</p><p>全身所有的神经组织最终都集中到大脑那里，集中在胜义根处，内六尘变现在胜义根那里，七识又在大脑胜义根那里活动，七识一活动，一动转就要影响到大脑的神经组织系统，然后神经系统再传遍全身。所以说各种识心活动，识心反应，就能引发色身的变化，影响色身的呼吸、心跳、脉搏、血液循环、内脏乃至于皮肤，最后得出一个结论：修心就是修身。再有一个结论就留给大家来推断，证明其中的道理所在，这个结论就是：修身也能养心。</p><p>佛法就是最严密的科学，就是最尖端的科学，但是缺少福德，缺少禅定，缺少智慧，那就不能证得了。定力不足，逻辑思惟能力就跟不上，思惟不够细密，智慧就开发不出来。不少人总是喜欢到处学理论，从来不肯花时间修定观行佛法，结果学来的都是理论知识，于自身心无有丝毫用处，烦恼照样烦恼，无智还照样无智，慢心还照样慢，我心还照样我，得不到一点身心解脱的受用。</p><p>五、失忆的人是如何恢复记忆的</p><p>问：我在十二年前大脑严重缺氧，功能损伤，过去的记忆消失了，医生说可能永远记不起来了，只能吃些药让记忆力增强一些。这十二年里记忆力一直很差，记不住人的脸，想不起刚刚发生的事。今年疫情期间我一个人在武汉，那几十天特别安静，突然有一天过去的人事在我大脑里闪现，一幕幕特别清晰。</p><p>我当时赶紧给我妈妈打电话，我妈妈问了我很多，发现是真的记起来了。但这十二年里的记忆却很模糊，我很想知道一个答案，失忆又恢复记忆究竟是怎么回事？还有我的性格，我观察我恢复记忆之后，更像小时候的自己，内心没什么杂念，注意力集中，自律性好，即使睡得很少，一天精神也很好，完全不像这十二年的自己，大脑变得很活跃。这究竟是怎么回事？</p><p>答：如果大脑缺氧，气血无法正常运行，不能合成血液里的营养元素，血液供养就不足，血液供应不足，大脑胜义根就缺少相应的四大种子，造成大脑功能受损。而大脑功能受损，就不能正常接受和变生内六尘，包括法尘和独影境。根、尘无法正常相触，也就不能产生意识去回忆过往，这就是失忆症的原理。</p><p>而这疫情期间，空闲下来，意根攀缘少，无所事事，意识就攀缘少，妄想少，意识意根都有禅定。心一点点安静下来，意根不太执身，气血运行通畅，四大供给平衡，大脑补充了营养，功能恢复，就会继续正常接收法尘和独影境，然后出生意识了别独影境，就有了回忆的功能属性，恢复了记忆。</p><p>但是在有病的十二年里，大脑胜义根受损，意识的了别微弱模模糊糊，就不能回忆的清晰明了；在如来藏里没有存下清晰了别的种子，记忆恢复正常以后，如来藏当中没有能现行出来的清晰的独影境法尘，故意识回忆这十二年的情况就比较模糊，回忆记忆的功能与意识了别的内容有关，与意根接收的内容有关，与业种有关。</p><p>在这十二年当中，意识微弱，对意根熏染和控制就没有力度，意根表现出来的是自己从前的性格属性。而十二年前，意识强大，能有效的控制和熏染意根，意识的性格脾气秉性占主导。现在意识恢复记忆了，功能又强大了，牵引意根熏染意根还会延续十二年前的性格脾气秉性。</p><p>失忆的问题医学教授和科学家都说不明白，说明这不是简单的事，对于其他学佛人也不是简单的事，但对于我们学唯识者应该不难。这个问题的思惟顺序应该是这样的：既然大脑缺氧导致失忆，氧在大脑中是起什么作用的？氧的构成、化学成分、作用都是什么？记忆恢复了，氧在其中起了什么作用？</p><p>医学生理学中认为氧气是脑组织产生ATP能量的助燃剂，没有氧气就产生不了能量，无法保证脑组织的新陈代谢，脑组织就会丧失功能性，长时间缺氧还会导致脑组织不可逆的损伤甚至死亡。氧是合成血液的成分，血液里的血红蛋白可以和氧气结合，通过血管输送到全身组织，包括脑组织。推动血液循环靠风大作用，氧里也含风大。血液是四大营养物质，没有氧，气血就不流动，组织代谢受到阻碍和影响，胜义根功能得不到充分有效的发挥，不能起到应有的作用，意识活动就会受到阻碍，以至于回忆不出过去的人事。</p><p>意识不能正常活动，以意根为主运行这十二年期间，意识的记忆不多，几乎是空白的，所以恢复记忆后意识回忆不出来，只能回忆能够正常活动的那个时间段，就是十二年前，其日常表现就是十二年前小时候的性格脾气秉性。</p><p>她是心静下来有禅定之后恢复记忆的，有禅定时心静意根不执身，没有阻碍，气血通畅，身体只要气血通畅，就健康无病无恼。气血运行通畅，能打通全身的气血，大脑的脑组织就得到了修复。这说明禅定就是探病仪，禅定就是治疗仪。禅定能减少意根的攀缘和妄想，只要意根不妄想，就不会有执身的愿望，感受自然就不一样了。</p><p>生病时，五根不痛，六尘不痛，六识痛吗？六识痛个什么，又没有尘性？修到一定时候，就会发现法法都好，法法都能断我见，法法都能明心见性，法法都是唯识种智。</p><p>六、胜义根的变异能导致六识出现变异性的了别</p><p>胜义根变异，内六尘的相貌就会出现变异，不能忠实于外六尘的原貌。譬如狗类众生业障比人类重，牠们所了别出来的六尘境与人类的了别有一定的差别，如牠们对于色彩的了别就与人类不同，对色彩的了别度非常低，没有辨识力。可是夜视力却非常好，在漆黑的夜晚，照样能够辨别出周围的人事物，这是狗类众生的眼胜义根结构决定的。</p><p>通常来说眼识见色，需要有光明，适度的光明能把色尘如实的照显出来，才能传导到胜义根黑匣子里，然后出生眼识意识了别色尘，夜晚没有光明就无法照色显色，也就无法了别色。光明亮度不同，色尘显现出来的就不同，眼识识别出来的色尘就不同。可是不妨外色尘的存在和显现，而且不受光明和其它条件限制的存在和显现，虽然也是刹那生灭变异的。</p><p>狗的胜义根结构与人不同，见色不受光明的影响，因为是见的自己黑匣子里的内色尘，不是外色尘。狗类众生的鼻胜义根与人类也不同，所以嗅觉非常灵敏，各种不同的香尘都能辨识出来，包括种种毒药的香尘。而人类就不行，嗅觉不够发达，原因就是胜义根黑匣子的问题。每种众生的后脑黑匣子的构造都不同，七个识了别的六尘境界的功能作用就不同，虽然众生可以面对相同的外六尘，可是黑匣子里的内六尘不一样，识心识别出来的就不一样。</p><p>从这里就可以看出，众生所见的法都是自己黑匣子里的法，黑匣子构造特殊，所见的法就特殊。黑匣子的构造是由什么决定的呢？是由各自的业力决定的，前世造业的业种决定的。</p><p>七、大脑神经活动是六七识心理活动促成的</p><p>眼识见色时，要有个定睛一看的微细动作后，意识才会生起，而细观这个定睛一看的过程，必然伴随大脑胜义根处的神经跳动。意识和意根只要有心思活动，大脑那里就有神经跳动，因为根尘识，三者和合触了，胜义根就能受到触动，然后才有识心的了别活动，所以胜义根先动，识心后动。定力好的人，能观察感受到自己大脑先动，然后心思活动就出现了，这个现象用科学精密仪器就能够观察出来。</p><p>见色时，至少有四个识的参与，其它识也有其它活动。八个识共同和合运作，一切法才出生，但都是第八识输出种子和业种变造出来的。七识只是出生一切法的一个缘，还有其他的缘促使眼识见色；因，根本因是第八识，业因是前世的业，或者是业种。</p><p>根尘相触，如果没有意根攀援这个缘，就不会有前六识的生起，因此胜义根处的每一次神经跳动，都是意根从作意到思心所运行过程中的一种生理表现。尘境的出现犹如一个开关，启动了意根的受想思心所的运行，从而就有了六识五蕴的运行，也有了八个识心的合和运作。</p><p>八、胜义根的退化能导致老年痴呆</p><p>问：一个老年痴呆的人为什么记不住身边最熟悉的人呢？</p><p>答：熟悉的人未必是他最感兴趣的人最重要的人，所以患老年痴呆症的人会想不起来记不住。</p><p>大脑胜义根出现问题以后，老年人对过去旧事记忆还是很清楚，总喜欢回忆小时候较早时候的人事。而对最近近几年的人事没有什么印象，对自己最在意最喜欢的人有记忆感兴趣，对其他人就没有什么印象了。因为随着年龄增长，大脑胜义根越来越变异，导致记忆功能越来越差，好多人事都记不住了。而年轻时候和小时候的事已经存进如来藏里了，六七识没有疾病就能回忆得出来，晚年的事记忆不好，就不会想起来。</p><p>有些刻骨铭心的事情，越到晚年，越记忆犹新，想忘也忘不掉。记忆的深浅完全由意根决定，意根不感兴趣的，意识想记也记不住。一个老年痴呆的人，他不认识你，记不住你，说明你对他来说并不重要，他口里心里念念不忘的人，对他来说是最重要的人，最感兴趣的人。还有就是老年痴呆的人，有选择性的记忆和失忆，这和缘分有关系，与当时大脑的状态有关系。回忆是独头意识的功能作用，老年人对近期的人事记不住，回忆不出来，是因为大脑功能退化，先是记不住，导致后来想不起来回忆不出来。</p><p>一个人是意识口里有你，还是意根心里有你，学到现在，我们都不难判断了。</p></div>"
},{
    "title": "第十一章 黑匣子里的色法",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  黑匣子里的色法</strong></p><p>一、所有种类的色法都是空的无我的</p><p>色声香味触各自分为好多种类，瑜伽师地论第一卷讲过，声音的种类分好几种，味尘也分好几种，触尘也是这样，香尘也是这样。法尘与五种尘和合在一起，也同时分几种。</p><p>声音有众生自己身上如来藏出生的，有色身和外界和合触出生的，有单纯外界的声音，有众生互相交往发出来的声音。众生自己的声音，是自己的如来藏单独出生的。身体里发出来的声音也分几种，有意识的觉观思惟产生出来的，有食物吸收消化过程中产生出来的，有内脏病变等产生出来的，有意根调控饮食咀嚼吞咽产生出来的，有胃肠蠕动产生出来的，有自主呼吸产生出来的，有内脏运行产生出来的，如心跳声。这些声音不管是因为什么而出生的，落到自己的耳根里，由耳识意识了别出来，都是黑匣子里的声音，不出黑匣子之外，都是生灭变异不久常的，都是空的，也都是无我的。</p><p>我们所能接触到的六尘都是如此，心能不被这些尘境所转，也不落这些尘境之中，才是自在和解脱的。心能不落六尘境界之中，就能够跳出境界之外，超脱于境界，不局在境界中，才能看清境界，心才能清明而不迷。</p><p>心空的境界，有一种叫作有人无境，这是空境，并没有空心空人，需要在此基础上，进一步观行心、观行人，才能断我见，只空境界，并不是断我见，还有主观的识心我没有空。很多人观行五蕴都有不周全之处，观行不全面，只能断除一部分的我，不能断除全部的我。而这一部分的我，也会逐渐再认为我，最后功德尽失。</p><p>二、镜像与镜子和镜子外面的相的关系</p><p>照镜子的时候，镜子里的影子与镜子是什么关系？ 镜子里的影子与镜子不叠加，不在镜子的里外和中间，与镜子了不相触。影子是幻化的，没有真实的色相，所以才与镜子了不相触，不叠加，也不互相妨碍。六识所见的都是不真实的幻化出来的相貌，就像是魔幻师凭借法术变幻出来的一样。镜子里的影子，是眼识所见的自己的相貌，耳识所听见的自己的声音，鼻识所嗅的自己的气味，舌识所尝的口腔里的味尘，身识所觉的身体里的触尘，意识所了别的五受阴。包括第七识的作主性，第七识的一切造作，都是幻化不实的法。</p><p>第六识所能观察出来的五识的能见性，第七识的能见性，以及意识自己的见性，意识所观察出来的五受阴六尘境，都是影子。影子是镜子所出生和显现出来的，是镜子传导出来的影像。镜子真实永远存在不灭，影子生生灭灭，存在时也不是真实有，是空的幻化的。</p><p>镜子里的像与镜子外面的相是什么关系？像与相是一—对应的关系，相似相像，像是相所变，来自于相，依相而有，二者不一不异，既有相同的部分也有不相同的部分，里面的像离不开外面的相而有，离相无像，相似于外面的相。但是外面的相是实四大种子组成，有四大真实的用，里面的像无实四大种子，没有真实的用，对于觉悟的人有禅定力的人，镜子里的像就如龟毛兔角，了无作用。</p><p>三、如来藏镜中的像也是色法</p><p>一切法分为色法和心法以及非色非心法。色法是由四大种子组成，是心法所见的色相。识心看见的镜子中的像，也是色法，由一部分四大种子组成，只是组成结构与镜子外的色法有所不同。心法是能分别的心，镜子中的像不能分别，因此不是心法。</p><p>镜子外面的相，是共业众生如来藏共同变现的，镜子上的像，是单独众生如来藏依外面的相变现出来的。镜子外面的相是假，镜子上的像更是假。各种层次的相，其四大种子组成的微粒有差别，导致真实的程度不同。我们自己所见到的自己色身的一切，有如镜子上的像。是有是无，是非有非无，还是非非有非非无？</p><p>四、色身与器世间的四大都是相同的</p><p>楞严经中佛说，色身微尘与器世间微尘无二无别，是同样的四大种子组成的。例如身体每天从血管皮肤排出的垃圾废物，与器世间的沙土一模一样，排出的汗水，与大自然的水一模一样，口鼻皮肤呼出的气息，与器世间的风一模一样，身体散发出来的火气与器世间的火一模一样。因此组成色法的四大种子是相同的，身体与器世间无二无别，外界四大发生变化，身体就会随之发生变化。</p><p>五、信息是否能暂时留存在大脑里</p><p>一切物质色法都是刹那生灭变异的，不会留住不变，大脑本身也是生灭变异的，不是一动不动永远是一种状态。与大脑相触的物质色法同样是生灭变异的，不会留存在大脑里，否则大脑的容量有限，物质色法就会挤破大脑，人就会成为废人和死人。</p><p>信息属于法尘，由意识分别和处理，包括似带质境和独影境，刹那生灭变异，不可久住，因此不能留存在大脑里。所有信息只能作为种子留存在如来藏里，缘熟时再释放出来。如果大脑能保存信息，把活人或者是死人的大脑一片片切开，就能找到这些信息，并且能了解和研究这些信息，就能把一个人的秘密都揭示出来，那么世间人也就没有了秘密，刑警破案也就太容易了，没有解不开的谜底，不存在千年疑案和冤假错案。如果电脑能存储信息，把电脑拆散，是不是能发现信息？手机如果能存储信息，把手机拆开，是不是能找到信息？</p><p>信息属于法尘，由意识来分别和处理，包括法处所摄色和独影境，由种子组成，只有如来藏里有种子，大脑里没有种子，因此就不能存信息；况且大脑的容量也存不下，所以信息应该存在如来藏里，来自于如来藏。信息如果不属于物质色法，不是四大组成的，就是无形无相的种子态，必存在如来藏里，大脑不能存种子。</p><p>墙上和地上的脚印，属于四大物质色法，是有形的五尘境，眼睛当然能看见，脚印上所显示出来的无形的信息，是意识所分别的法尘，也属于信息，人了别以后，就会存种子在如来藏里，不会存在大脑里，尽管大脑以后会思来想去，但那是意识想，不是大脑想。</p><p>六、独影境是胜义根里的影像</p><p>心静时可以感知一下，每当自己心动，或者动心时，是不是同时也牵动着大脑神经的跳动，然后是面部神经的跳动，之后才是手脚和全身的相应反应。如果是，说明心动能带动色身动，心动也有独头意识和五俱意识的动，也有意根的动，那么识心活动就不离大脑，六尘影像和独影境也不离大脑。</p><p>当我们在回忆妄想的时候，脑电波就有波动，这说明意根和意识对独影境的了别影响到了大脑，独影境也就在大脑里成像，是一个虚拟之像。独影境如果不是在大脑里出现，那就是在身体外出现，那么独影境能不能在身体外，在虚空里出现？六识能不能在身体外，在虚空里了别？意根能不能在身体外，在虚空里运作？如果意根和意识能在虚空里了别，意根和意识就是虚空中的识，大家都可以共用，不分彼此。你了别了以后，我就知道了；你吃饱了，我就不饿；你决定修行，我就决定了；你证悟了，我就证悟了，因为是虚空里的识，不分你我，事实上这是不可能的。</p><p>我心里在想佛，佛的三十二相是我的独影境，如果独影境在虚空里，那么大家都能见到，所有人也都在想佛，都有功德受用，事实上这是不可能的。即使我们所见的虚空，也是胜义根里的虚空，不出心外，眼识和意识了别到的虚空，也在胜义根里，也是一个影像。综上所述，独影境是胜义根里的影像，是一个虚拟之相，并不真实。</p><p>七、独影境是否是在胜义根里</p><p>独影境是在胜义根里出现的，不属于五尘上的法尘，不是法处所摄色，是独头意识单独了别的法尘，不是与五识共同了别的法尘，来源于单独的种子。独影境受胜义根的影响，胜义根有障碍，显现出来的独影境就扭曲变形，不真实了。比如小脑萎缩的人，常常出现幻觉，他所了别的独影境都是非量，不符合真实的情况，病人在分别错乱的独影境之后，生出错误的观念，口中就会胡言乱语，与正常人不一样。</p><p>因为意根通常在大脑处与法尘相触，了别大脑处的法尘，意识也同样了别大脑处的法尘，不出大脑之外；意根和意识又都能触独影境，独影境也就不离大脑，所以大脑有病变，独影境就会出现错乱。独影境在大脑胜义根里一个单独区域成像，不与五尘在一起，也不与五尘上的法处所摄色在一起。了别五尘上法尘的意识是五俱意识，了别独影境的是独头意识，虽然名称不同，本质是一个意识，虽然是一个意识，却可同时了别五尘上的法尘和独影境。</p><p>八、眼冒金星的金星是否是独影境</p><p>眼冒金星的金星，别人看不见，自己五识也见不到，因此是独头意识所对应的独影境。眼冒金星是气血问题引起的现象，因为物质色法的关系而产生出来的。当一个人血压低于正常值，血液不能充分供应大脑细胞，就会出现头晕的现象，这时就有可能眼冒金星，实际上这是幻觉，并没有真实的金星存在。但是这种独影境的金星还是与大脑有关系，与物质色法有关系。</p><p>那么金星是在哪里出现呢？在大脑里出现，因为意根意识都不出大脑之外缘所有法尘。当脑子有病有阻碍时，缺少营养时，意识就容易健忘，想不起事情，独影境不现前，这就说明独影境是与大脑物质色法有密切关系的。独影境只能自己单独了别，他人了别不到。而外六尘境，不仅自己能了别，他人也能了别到。</p><p>九、独影境是如何出现的</p><p>问：观想莲花久了，不用动念莲花就会出现，是不是独头意识攀缘形成的独影境？</p><p>答：独影境不是法处所摄色，不是五尘上的法尘，是单独另外变现出来的法尘。莲花能在脑中出现，说明意根动心攀缘了，意识的忆念和想像成功熏染了意根，最后就不用意识特意想，意根意念就把莲花自动的观想出来了，否则独影境的莲花是不能出现的。</p><p>独影境是否出现，决定于意根，受意根的支配，意根想让它出现就能出现，想要熄灭它，就能熄灭它。意识受意根的指挥，也在观想忆念莲花，否则独影境的莲花就不能出现在意识心中。当定力深厚，观行功深时，独影境能随心所欲的显现出来，意识不用太加功用，意根忆念，如来藏就能幻化出来。</p><p>十、本质境与带质境的区别</p><p>本质境，是第八识亲自参与变现，所有有缘众生的第八识共同输出四大种子变现出来的，是最原始的境界色法，称为本质境。单个众生的第八识缘本质境之后，如镜现像般的变现出影像，叫作带质境，第七识意根缘带质境。</p><p>如本质境的大地，是实种子地水火风构成，是实法，有坚硬性；而意根第七识缘第八识的见分，就能缘到第八识见分现起的带质境，带有本质境上的四大种子的影像大地，与本质境相似相像，却不那么真实了，没有真实的坚硬性。</p><p>如本质境中的水，是实四大种子构成，有湿润性，有淹没性，是第八识所缘。缘之后，第八识的见分就现起带质境的水，带有本质境上四大种子的影像水，与本质境相似相像，却没有实质的湿润性，没有实质的淹没性，是第七识意根所缘，称为带质境。</p><p>如本质境中的火，是实四大种子所构成，有燃烧性，第八识所缘。缘之后，第八识依之现起相似的带质境火，带有本质境四大种子的影像火，与本质境的火相似相像，却没有真实的燃烧性，意根所缘，称为带质境。</p><p>如本质境中的风，是实四大种子所构成，有吹拂性、飘荡性，第八识所缘。缘之后，第八识依之现起带质境的风，带有本质境四大种子的影像风，与本质境相似相像，却没有实质的吹拂性，没有实质的飘荡性，意根所缘，称为带质境。</p><p>意根依第八识的见分缘这些法，还以为见到的都是真实的，而且是自己亲自见到的，把第八识的见分摄为己有，不知道自己见到的与第八识见到的有本质区别，不知道没有第八识这面镜子，自己什么也见不到，把第八识的功能据为己有，实为窃贼。</p><p>凡所有相，皆是虚妄。所有经典所说，真实不虚。第七识缘第八识的见分，第八识是真实存在的，是真正的本质实相法，第八识所见，第七识却见不到，第七识只能见到第八识见法后所现起的带质境，不是原始法和实质的法，不是本质境。</p><p>带质境不同于本质境，不同于原始境。所以只能带一部分的质，带不了全部的质，为什么呢？因为中间传导过程中有些四大微粒被介质阻挡或者吸收了，四大微粒改变了，色法就有所改变。</p><p>十一、本质境、带质境、性境、独影境、外六尘和内六尘，分别都指什么相分？</p><p>（一）本质境，是所有如来藏各自输出四大种子，形成共同的四大，所有如来藏共同用此四大造就的宇宙器世间和六尘境界，只有如来藏才能见到缘得到。这部分相分是最实在的相分，也是最根本的外相分。凡是本质境，都是第八识亲自所缘的法。凡是第八识亲自变现出来的法，都是第八识亲自所缘的法。他人第八识所变现出生的法，自己的第八识去缘时就不是亲缘，而是疏缘，隔了一层，有点远了。</p><p>（二）带质境，是单个如来藏缘本质境之后，吸取本质境的四大微粒一直传导到胜义根的这段路程中所变现出来的一层一层的六尘境界，如镜子中的像，带着本质境中的四大微粒，与本质境有一定区别，比本质境更虚幻。这部分的相分，包括从如来藏触本质境一刹那变起相似相分开始，一直到进入五根或者是五胜义根之前的相分，至于六识所了别的内相分，也是相对的外相分，是意根所缘，所以意根早于六识了知尘境。</p><p>这些相分在传导过程中，四大微粒要经过中间介质的过滤和吸收，四大微粒不断的被过滤掉，以至于带质境的相分越来越微细，与本质境的差别逐渐加大，但与本质境的关联还是比较大的，相貌也比较相似。这部分相分，除了如来藏能见能缘之外，意根随着如来藏也能见能缘。</p><p>因为意根能缘能见进入胜义根之前的带质境，对带质境就有一定的了别性，就能相应的知带质境大略的性质和意义，就会有五遍行心所法现前运作，对于涉及到自身安危的带质境，就会有快速的抉择力。这个抉择如来藏能知，就会在带质境进入胜义根形成性境，在六根触六尘时，能非常快速的出生六识，作出应对，反应非常迅速，没有意识的分析思惟推论判断的机会，意识五识只要服从意根的调配和命令就好，不需要自己判断就要作出反应应对，过后才有时间思惟分析推理判断，知道刚才自己做了什么，发生了什么事情。这是意根快速应对突发事件的原因。</p><p>（三）性境，带质境通过五浮尘根进入到胜义根里时，在胜义根里显现出来的六尘境界，成为性境，相似于带质境，叫作性境，与带质境又有一定的差别。带质境在被传导的过程中要经过五根的过滤，四大微粒有可能要发生一定的变化，致使性境更加的微细，也更加的不实和虚幻。</p><p>（四）独影境，与性境有很大差别，与带质境差别更大，与本质境差别就太大了，也许与本质境没有关联。是由意根攀缘发起的，无中生有，由意识去处理和完善意根的妄想，去描画和添加细节，运用非量想象去发挥更细腻的妄想功能作用，甚至能让妄想境界活灵活现。这部分五识参与不了，完全由意识配合意根去完成，这时的意识叫作独头意识，单独做妄想工作，去勾画场景。</p><p>外六入外六尘，就是指胜义根之外的，还没有进入胜义根里的六尘相分，应该是指带质境和本质境，由意根所缘，六识不能缘，更不能见。六识了别不了的，不属于内相分，应该算作胜义根之外的六尘，叫作外六尘。</p><p>内六尘，就是指胜义根里的性境，不仅意根能缘能见，六识也能缘能见。当然第八识更能缘能见了，一切法不管是哪个阶段的法，都是第八识如来藏变现和执持的，如来藏当然就能缘能见了，否则任何一个法都不会出生和存在。</p><p>十二、本质境、外六尘与内六尘三者的区别和联系</p><p>在宇宙当中存在着的外六尘，是所有众生如来藏共同出生共同执持的，是所有如来藏用四大种子来维持的，四大种子刹那刹那的生，刹那刹那的灭，那么外六尘就是刹那生刹那灭的。外六尘境界是最原始的色法，是实种子组成的比较实在的色法，严格来说叫作本质境，是如来藏了别的，意根不能了别，六识更不能了别。虽然如此，本质境也是刹那刹那在生灭变化着。在四大种子生灭变异的过程中，四大种子是往外发散的，还发散到各个如来藏当中，所以我们能感觉到物质周围有磁场有能量。</p><p>发散出去的四大种子，如来藏就会摄取回来，摄取过来以后，才叫作外六尘。如来藏再通过五根把外六尘上的四大种子传导进胜义根，五根就是指身体的各种神经系统，比如眼根有玻璃体，有神经传导系统，把眼根外边物质散发出来的四大微粒传导过来，一直到传导到后脑眼的胜义根里，就形成了内色尘。内色尘落在眼胜义根里，根尘就相触了。</p><p>其实外色尘和内色尘都是意根先了别的，了别内色尘之后意根想具体了知，就出生眼识、意识；如果意根不想具体了知，我们就不知道有此种色尘。与五尘在一起的法尘随同五尘同时传导，色法尘与色尘同时通过眼根传导，声法尘与色尘通过耳根一起传导，香法尘与香尘通过鼻根同时传导，味法尘和触法尘也是这样。</p><p>意思是说在胜义根里的法有很多，意根不想了别的时候，六识就不能了别，从五根所传进来的法我们就不知道。如果神经系统传导没有遮障和误差的话，形成的内六尘和外六尘有些相像，或者是非常相像，因为内六尘是外六尘的影子；而外六尘是本质境的影子，犹如镜子里的影子一样。我们分别的内六尘就像镜子里的影子，分别不了的外六尘相当于镜子外头的实物，那个实物比内六尘要真实一些，更契合最初的六尘本质境。而本质境是实的四大组成，意根接触不到。当如来藏像镜子一样把那个本质境上的四大摄取过来幻化以后，意根才能缘得到。</p><p>十三、独影境的类别和实质</p><p>独头意识所对应的独影境，分为无质独影和有质独影。无质独影，是意识妄想出来的境界，根本没有其实，在现实和眼前根本不存在，犹如空花兔角，不带一点点实质，所以有些人非常喜欢凭空妄想，想入非非，好让精神有所寄托，以缓解精神疲劳，也不至于无聊和浑噩。如回忆过去和幻想未来，海马天空，不着边际。这样幻想出来的独影境因为不需要消耗多少能量，也可以不需要定力，对大脑的影响比较小，所以现起的时候比较多，也没有什么约束力。</p><p>有质独影，是意识单独分别的与五尘有一些关联的境界，稍带有一些五尘上的四大之质，意识在五尘境的基础上发挥想象，或者是错解。比如见绳为蛇，绳是色尘性境，意识本应该在性境基础上了别出绳子的形状，并且流露出绳子的名言，可是意识却错解，把绳子判断为蛇，流露出蛇的形象和名字，甚至吓出声音。蛇就是独影境，五识不参与了别辨别，蛇形又不与色尘境分开而现，因此是有质独影。</p><p>再比如看见一朵花，意识就对花进行加工想象，想象未开之前的样貌，想象开敷之后的样子，或者想象变大变小，变幻色彩和品种，或者想象多出枝叶，或者想象出同样更多的花朵，凑成花束。再比如看见一本书，由这本书同时就联想到另一本书，或者联想到另一种书面，联想到书的另一个名字等等。</p><p>所以我们遇到的境界，头脑中出现的境界，心中所思所想，哪里有什么实法，哪里有什么真实不变之性。纯属是心的无明无聊，弄出种种事多余事，增添烦乱，让自心不得寂止和寂静。众生由于无明，不知寂静之乐，无事找事，无事生非，习气深重，严重障碍禅定的发起。</p><p>十四、独影境是否有种子</p><p>（一）脑萎缩的人，出现的幻视幻听，属于无质独影境，他人不能了别。如果他人也能了别自己的独影境，那么自己所了别的就不是独影境，脑萎缩的人就没有病，不是幻觉。根本不存在的人，他能看得见，别人却看不见，根本不存在的声音，他能听得到，别人却听不到。他所接触到的色声，都是无中生有，空穴来风。如小脑萎缩的人明明是看见甲，却当成了乙，乙就是有质独影境，带有一定的甲的质，不离甲而有乙，离甲无乙。</p><p>这样的独影境有种子吗？脑萎缩是业报，有业种，业种成熟，就会出现脑萎缩的果报，也是苦恼，不仅精神受折磨，身体也受折磨，幻想时间久了，会非常疲劳，就会使用镇静之类的药物控制。那么独影境就消耗脑细胞脑能量。独影境法尘不用如来藏从心体中输出四大种子形成，但需要一定的脑神经细胞中的四大微粒。没有胜义根的众生，就不会出现脑萎缩的现象，不需要消耗脑细胞脑能量。</p><p>（二）精神病人的狂乱意识，也是散乱独头意识，了别的也是独影境，他觉得自己所看所听的一切都是正常的，与别人没有不同。可是别人就了别不了精神病人所看所听所觉的，那就是独影境。精神病人所见的如果他人也能见，就不是独影境，他也不是特殊的精神病人，与正常人一样。众生所见与佛所见不同，说明众生有病，佛无病。</p><p>意根与业种相应，与业报相应，业报出现的时候，意根是病态，意识胡思乱想，如来藏跟随随缘现业，幻化出意根意识乱想出来的境界，于是在别人看来精神病人就颠颠狂狂，不正常。而有质独影境，是如来藏根据现有的尘境，取一部分四大幻化出另外的独影境，好像与现有境界不相干。意识认取以后，当以为真，他人看这个人就是颠颠狂狂的。病根在意根，在前世的业行上，今世感得的果报，虚幻虚假。</p><p>（三）凡夫正常人，与脑萎缩和精神病人相差也不大，所见一切法也都不真不实，业力所感，无中生有，犹如空穴来风。真法不见，却在真法之上，妄见虚妄的带质境独影境和性境。这些境界都带着如来藏的质、如来藏的真、如来藏的本，却不知，独见假见幻，实为颠倒痴狂。</p><p>病根在意根，无明业力招感，业消病退时，还原所见，就会见真见实，假相消失幻相退去，心无病自然清凉，在这其中谁不是病者？</p><p>十五、七识所对的境界和磁场</p><p>本质境是第八识所触的，带质境中真带质境是第七识所触的，似带质和假带质是第六识所触的，性境是五识所触的，独影境是独头意识所触的。</p><p>磁场是物质色法，能感知物质色法的是七个识，以第七识的感知为主，第六识一般来说会莫名其妙，不知其中的蹊跷，第七识知而不能说。磁场效应最大的是带质境，带的本质境上的四大微粒比较多，所以影响比较大。</p><p>十六、由见绳为蛇观察众生心识问题</p><p>当一个人看见绳子的时候，眼识所见应该是绳子的色彩，是色尘，其余绳子的长短、粗细、质料、纹理等等是法处所摄色，是五俱意识所见的法尘，都含有四大种子。落在眼识里的是性境，落在五俱意识里的是似带质境。二者和合把绳子分别完了，得出一个正常的世俗人应该得出的结论，这才算是一个正常的世俗人。其后对于绳子的处理也应该属于一个正常人的处理方式。</p><p>如果这个人由于某些原因导致心识错乱，就可能见绳为蛇，眼识看见绳子，可能还是绳子的色彩，色尘不变，可是意识看见绳子的法尘，却硬是分别出蛇的形象样貌，把法尘改变了。这个改变的法尘叫作独影境，意识单独了别，眼识不与意识共同了别。法尘改变的越多越大，意识错乱的就越严重，带的绳子的质越少，越不符合事实，其心就会越狂乱。相反带的绳子的质越多越大，越接近于事实，其心越接近于正常。</p><p>在见绳子的过程中，绳子的法尘与独影境可能会共同存在，但此消彼长。如果完全都是独影境，绳子就完全被认为是蛇，这个人完全错乱，会吓得掉头就跑。如果只是把一部分法尘改变为蛇的独影境，这个人虽然害怕，战战兢兢的，但是心里会有疑问，不完全相信，就会一边害怕，一边再去仔细分别观察，看明白真是绳子的时候，独影境完全变回法尘，害怕的心理消失，能正常面对绳子；如果由于心理暗示的影响比较大，仔细观察之后，确认是蛇，法尘就会完全变成独影境，这个人可能会吓得撒腿就跑。</p><p>作为娑婆世界的凡夫，心识错乱者比比皆是，都有不同程度的精神错乱，几乎没有完全正常的，为什么？贪嗔痴烦恼业障，致使心神繁乱不定，认知错误比比皆是，不能正常而正确的判断所接触到的人事物理，不认事实真相，只认邪见引生出来的独影境，有质或无质，有据或无据。</p><p>心理素质越好，精神状态越正常的人，内心越淡薄，越平静平和，反应越小，越没有波澜。反之，内心就会越波浪汹涌，对于周围环境的影响力或者叫作破坏力越大，越能引发周围人事的紊乱，导致团体不太平。整个团体精神错乱的现象，并不少见，以后会越来越多，主要是由团体主导者的错乱，熏染影响整个团体，使得团体中人人心识错乱，心理紊乱。当团体问题越来越多越来越大的时候，问题层出不穷，就会导致纸里包不住火，这个团体离毁灭不远了。</p><p>只要你不是八地菩萨，也不是初地菩萨，那么人人都可能受熏被熏，自己应该受到什么样的熏染，应该熏染成什么样子，每个人都有选择权，这个权利属于自己的，别人夺不去。因此说，选择涉及到了智慧，也涉及到了业力和福德问题。如果有了正确无误的选择，说明自己有智慧，业障轻微，有福德。有些熏染，其影响力不是一生一世的，有可能很多世甚至是生生世世，都会呈现被熏染后的习性。选择环境选择所接触的人事物理是非常重要的，也是极其重要的。</p><p>十七、六识所显现的是似带质境</p><p>以心缘色似带质，中间相分一头生，指的就是六识见色的功能作用，见的是相似于带质境的尘境，不是带质境，所见尘境非常虚假，就像是镜子的像一样。这些虚假的相分只在六识心中现，不再往下传送，到此为止了。因为已经是假的，没有质了，没有实法如何再传送？其实世间哪有什么实事实法，看破之后，一念顿超，一切都归于虚无和寂静，从此天下太平。</p><p>十八、性境不随心，独影唯从见，带质通情本。</p><p>问：性境不随心独影唯随见，这个独影唯随见是不是说独影境与见分同种，还是说独影境随见分而转变呢？</p><p>答：性境是外六尘在后脑胜义根里的如实或者是相似的展现，微细四大种子形成，不可改变；独影境是随意根的攀缘，如来藏配合幻化出来的虚幻境界。见分是识种子形成的。独影境是随意根意识的思心所而显现和改变的，意根不攀缘，意识不妄想，独影境就不存在。而性境，不管意根攀缘与否，必然存在不可改变。</p><p>性境是五识所缘所见的相分，意识在其中不去思惟分别，五识缘之后，是什么便见什么，不因意识的胜解而受影响和改变。比如触阳光时，是热身识便觉热，没什么啰嗦和是非，是亮眼识便见亮，没有什么啰嗦和是非，很直接，也不用意识分别个半天，琢磨名相，起什么心行。</p><p>独影境是独头意识单独所缘境，没有五识什么事。意识起心，独影境现起，意识正则独影境正，意识邪则独影境邪，境界随意识转变和显影，没有自主性，没有自体性。</p><p>带质境一定是从众生的根本第八识那里传送出来的，第八识缘最最根本的四大种子组成的实法，第七识再缘时，第八识就把实法再幻化一次所出现的幻化境，这时的尘境是带有一定的实质的法，第七识才能缘，叫作真带质，与第八识所缘和六识所缘都有所不同。</p><p>十九、以心缘心真带质，中间相分两头生。</p><p>第七识缘第八识的见分，第八识见本质境之后摄取四大微粒，形成最初的影像，带着本质境的质四大种子，第七识见之，就以为是自己所见，以为这些都是我，生起取着之心，借助第八识把带有四大之质的法传送到胜义根，借助于六识了别和执取。而传送到胜义根的法已经不是原本第七识最初所见的法了，只是相似，六识不知此理，俱以为真。第七识与第八识中间的相分，一是生第七识心中，二是生在六识的心中。然六七识所缘的相分有一定的差别，六七识不知，就忽略不计了。这也是无明。</p><p>相分传到胜义根黑匣子里的，为六识所缘，缘之后，就会呈现于六识心中，那么六识心中的相分，犹如镜子中的像，发生了质的改变，已经不带本质境的质——实四大种子了，叫作似带质，也叫作假带质。相似于外相分，相似于本质境，相似于真带质境。</p><p>假如是一个有神通的人，把六识都训练好了，对于一切六尘境界如如不动，知其幻化，没有实用，那么胜义根黑匣子里的六尘相分对于六识身就没有任何作用，高山大海阻碍不了六识身，因为山水都是假境，假相分，是镜子里的像，没有实质的作用。大火烧于六识身，六识不为所动，火烧刀砍于身无碍，因为火与刀都是假境界假法，犹如镜子里的相分，有何实质作用力？</p><p>众生不懂此理，又没有禅定，那么境界来了，心动入心，身心就有所伤，被假境界所伤，冤枉不？沮丧不？委屈不？</p><p>二十、真带质境和无质独影境</p><p>出门晒太阳，自己接收到的阳光就是真带质境，因为给身体增加了热量和能量，补充了钙质，有实际功能作用。吃到胃里的饮食属于真带质境，因为补充了身体能量，把胃吃饱了，人有了精神和体力。而梦中吃的饮食，却没有饱腹作用，醒来胃还是感觉饥饿，梦中的饮食是无质独影境，不带质，所以没有实际的功能作用。同样脑子里幻想出来的饮食也没有饱腹的作用，不能给身体增加能量，同样是无质的独影境。</p><p>有些人供佛，从来不用实物，而是靠意念想象出来的无实质的独影境食物来供佛，没有实物，自己不用付出实质的物质和钱财，没有付出，当然就没有回报了。如果想象出来的食物不能让自己饱腹，也吃不到口里，难道就有办法进到佛陀的口中和胃里？用想象出来的饮食给鬼神施食也是非常没有诚心的，不用付出实际的物质，因为想象出来的饮食一点实物也不含，拿去送人就等于欺骗人一样，未来世自己也会受到如此欺骗，欺人等于自欺一样。</p><p>二十一、山谷里的回音属于什么境</p><p>你在山谷里大喊一声，这个声音本身是本质境，本质境被第八识变现成第七识了别的带质境，在传播途中，遇到空气或者是石壁，受到阻碍，传播的声音就变质了，因为四大微粒发生了变化。我们再听到回音，感觉声音比较虚幻不真实，好像在遥远的天际，与人的喊声有很大的差别。人的喊声是真实的，回音是根据喊声而后变起的，就像第二个月亮一样。</p><p>回音类似于声音遇阻的反弹音，就像兵乓球遇到球拍的反弹似的，反弹回来的兵乓球其速度决定于遇到阻力的大小。空谷里的回音大小和音质在于与空气对流的力度和石壁的阻力大小。山谷越空旷，回音越假越虚幻越不真实。山谷里的回音，不能说是真，也不能说是假，含有真真假假的性质，因为带有本质境的质。</p><p>第二月，直接来自于天上的真月第一月，没有第一月就没有第二月，你不能说第二月是真，或者说第二月是假。第二月含有真真假假的性质，因为它带有第一月的本质境中的质，带的还比较多，所以显得比较真。虽然如此，有智慧的人，捏出第二月，都不会把它当成真月第一月。同理，也不能认空谷里的回音是人的真实声音，只能循着回音去找人的真实声音，从而找到人。这也是参禅的秘诀。</p><p>二十二、六识所见的相分他人不可见</p><p>问：带质境是单个如来藏缘本质境之后，吸取本质境的四大微粒所变现出来的六尘境界，这部分的相分，包括从如来藏触本质境一刹那变起相似相分开始，一直到进入五根或者是五胜义根之前的相分。而性境是指带质境通过五浮尘根进入到胜义根时，在胜义根里显现出来的六尘境界。那捏目所成的第二月应该是到胜义根里显现出来的六尘境界了，这个归到性境上是不是更合理呢？</p><p>答：性境是五识所见的相分，那么第二月眼识能看见吗？其他人能看见吗？各个识所见相分和境界不同，同样的形象，到各个识里，属性要发生改变。比如说一个人照镜子，镜子的对面还有一个镜子，东西左右各有一个镜子，这个人在各个镜子里显现出来的影子大概相同，可是在各个镜子里的属性和真实性却有很大差异。</p><p>二十三、本质境和带质境的区别</p><p>第八识最开始输出四大种形成的原始境，和经过六七识了别后的带质境是否都属于境界的范畴呢？二者都属于境界范畴，一个是胜义根里的境界，一个是胜义根外的境界，也就是佛说的内界和外界。</p><p>第八识最开始输出四大种子形成的是本质境和原始境，是第八识接触的，不是性境。性境是个人的第八识依据本质境如镜现像，变现在五胜义根里的幻化境界，众生所能接触的境界，都是个人的第八识二次幻化出来的性境和带质境，另外还有独影境。独影境如果不能在大脑里正常变现，独头意识就无法正常读取独影境，就好像是失忆了，其实是了别不到应该了别的独影境。</p><p>二十四、双缝实验原理</p><p>一旦六识，或者说是七识，或者说是自己的八个识加入到对物质的感知当中，三个能变识，就能显现和改变物质的状态。也就是说，一个本质境，有其固定的四大微粒所组成，一旦进入人眼胜义根中，四大微粒必定要发生改变，数量乃至于比例结构都要发生变化，落入五识意识心中，被六识所托显出来的境界，如何能不发生变化？境界如何能不改变？但是改变也只是改变六识托显出来的境界，本质境会依然故我。所以双缝实验中光波一被观察，就会成为粒子态；也所以一种植物和动物被不同的人饲养，其生命状态和活力就会不一样。</p><p>然而本质境的不变只是暂时的现象，早晚都会改变。因为本质境也是因缘生因缘灭之法，生灭变异之法，因缘改变，本质境必然会改变。在因缘不改变的情况下，众生对本质境有所关注和希冀，意根的愿求加入其中，本质境必然会发生变化。众心诚诚，万众一心，必然会促使本质境随众人心而转，甚至会随一有道人心而转。</p><p>譬如说地球，在人类降生之前，虽然是生住异灭的存在，但那时的存在，变异很缓慢，地表面的美味地肥，多劫都浮在地球表面，甘美肥沃，不减少不变薄。当二禅光音天的天人降生地球成为人类时，由于贪求地肥，使得地肥越来越薄越来越少，最后不再增长，以至于灭绝，这是众生业力干扰的结果。灭绝之后人类开始耕种美味粳米，最后由于众生贪求不舍，粳米消失，甚至连名字也查找不到。众生的业力就是如此之大。</p><p>二十五、带质境中变带和狭带的含义</p><p>带质境中的带字，有两个含义，一个是变带的意思，带出来的是色尘和色法尘；另一个是挟带的意思，带出来的是八个识、或者是八个识的心所法、或者是八个识的相分、自证分和证自证分，是心法尘。</p><p>变带质境，是六尘境界，而且是分为内外六尘境，由本质境原始境而来，所带的四大种子微粒与本质境有一定的差异，种子数量少于本质境的种子数量，种子结构也会有一些改变，是带有本质境之质的六尘境，是识心的相分。变带，从外相分性境而带过来，依外相分而变现，相似于外相分，是七识所缘所虑的内相分。</p><p>挟带质境是心法尘境，是第六识以及第七识挟带出的心法，是被六七识了别的心法尘相分，包括自心对自心体的所缘境。挟带者，是能缘心七识，主要指六七识，以第六识为主，夹带己相（就是反观自己的思想），或者是自己的心所法（反观自己的心所法），或者指七识的见分（能见性）缘相分（识心见尘境），或者是见分缘自证分，见分缘证自证分等等。或者是已经证得了第八识如来藏的有智慧的意识，能缘第八识的真如行相。意识能观察第八识的真实而如如性，能成佛之性。</p><p>挟带，就是与变带外相分的性境有区别的缘法的方式。七识心内所了别的好像是境界的相，也是七识所挟带出来的。独影境完全是六七识挟带出来的，不依外相分而有。意识在观察自己的心行，心行与心所法就是意识所挟带出来的；意识观察第八识，观察五识，观察第七识，意识观察自己时，所观察的对象，都是意识挟带出来的相分。我们眼睛看到杯子，意识也了别辨别杯子，这种境相是带质境，依外相分的杯子而有；身在外地，闭眼脑海想到父母的脸相，这是独影境，是意识挟带出来的。</p><p>二十六、什么色才能触眼的浮尘根</p><p>色分为本质境的色、带质境的色和性境的色，其中本质境的外色尘，只有第八识能接触到，眼识意识和眼的浮尘根都接触不到，意根也不能接触。第八识触本质境以后，又依本质境的四大微粒变现出带质境，这部分色意根能接触得到，也能传导到眼的浮尘根那里。眼浮尘根所接触的是第八识再次变现的带质境四大微粒，不是本质境上的四大微粒，所以眼浮尘根不能触本质境的色尘，与本质境有一定的距离，才能传导色尘到胜义根里，根尘相触，再生眼识见色。</p><p>如果眼的浮尘根与本质境的色尘直接接触，中间没有一定的距离，如来藏无法把依本质境变现出的带质境通过浮尘根传导到胜义根里，也就不能出生眼识见色。因为眼根传导色尘比较特殊，有个眼根成像原理，色尘与眼根有距离，才能在眼根视网膜上倒立成影，其它几根没有这种现象，与相对的色法不用有一定的距离。所以眼见色与其它几根见法就多了一个空间距离这个条件。</p><p>二十七、到底有没有外法尘</p><p>外法尘比如外面的高山，高山的形状、高矮、巍峨、壮观等等都是外法尘，如来藏接触以后传导进入胜义根中，成为内法尘，六识才能了别。如果没有外法尘，外面的山只有色彩，其余什么也没有，那如何区别此山和彼山，如何区别山河大地？不会是宇宙器世间都是色彩斑斓一片吧？</p><p>甲是一个人，乙是一个人，甲对于乙来说，就是外尘，包括色声香味触法六尘，甲的高矮、胖瘦、男女、气质、年龄、相貌等等都是外法尘，乙的如来藏触了以后，传导进入乙的胜义根中，成为内法尘。不能说甲就是一片色彩的色尘，没有高矮、胖瘦、年龄、相貌等等外法尘吧？如果每个人都只有色彩一片，没有法尘，那么人与人之间又有什么区别？难道说每个人的如来藏都是用别人的如来藏创造内法尘的吗？每个人的如来藏都是自己胡乱变造别人的法尘相貌吗？</p><p>二十八、法尘与五尘是同时变现在胜义根里的</p><p>问：有人说法尘单独在胜义根出生，意根接触之后出生意识了别法尘。是这样的吗？</p><p>答：胜义根里的法尘是与外五尘同时通过五根传导到胜义根里，成为了内六尘，供意根触对，也供六识同时了别。内法尘不是在胜义根里单独出生的，如果是这样的话，法尘与五尘就没有什么关系了，单独出生的法尘显得很突兀，没有依据，有点胡编乱造的意思，不能显出五尘的性质和内涵，五俱意识与五识也没有什么密切关系了。</p><p>五俱意识对法尘了别作出抉择和判断之后，要向意根传达信息，五识了别的五尘信息也与意识一起传达给意根，因为意根也是五识出生的俱有依，意根决定要了别和处理五尘的时候，五识才能出生，那么五识的行为造作要受意根指挥，为意根负责，供意根参考。</p><p>五尘与法尘和合构成了完整的色声香味触法六尘境界，五识了别和处理的是六尘中比较粗略的部分，意识了别和处理的是比较细微的部分，粗细合起来的信息传达给意根，意根同时接收粗法和细法的信息，经过自己单独的思量，对六尘整体作出自己的判断和抉择。</p><p>比如说到商场买衣服，看见五颜六色的服装，意根就要选择一种比较适合自己颜色的衣服，眼识和意识就要同时了别衣服，眼识只了别色彩，意识了别色彩之外的法尘，包括衣服的款式质料韵味，色尘和法尘的信息传达给意根之后，意根就会考量色彩和款式质料，再让意识单独分析判断一下红色和黑色哪种颜色比较适合，哪种款式比较合适，这是独头意识的工作范围了。于是独头意识想象穿在身上的效果，把想象分析的结果传达给意根，意根再思量判断，作出自己的决定，最后几个识和合运作就买下了意根满意的衣服，六识为意根服务完毕。</p><p>构成整体衣服的有色彩部分的显色，是眼识了别的色尘，除了颜色之外的所有部分，形色、表色和无表色，是意识了别的法尘。二者和合构成一件衣服，在衣服生产加工出来的时候，色尘与法尘就同时存在了，每个人了别的时候，就把色尘和法尘同时通过五根传导到自己的胜义根里，形成内色尘和内法尘，供眼识意识分别。不是说衣服生产出来时只有颜色，没有款式质料长短肥瘦尺码韵味等等法尘内容，这样的话就不叫作衣服了，也不用缝纫裁剪设备去处理布料了，也没有布料之说了。所以法尘是与五尘结合在一起的，不是在胜义根里单独产生出来的。</p></div>"
}]