[{
    "title": "俱舍论疏第二十三卷（闻慧和思慧）",
    "author": "生如法师",
    "date": "2022年09月27日",
    "html": "<div class=\"B1_text\"><p><strong>俱舍论疏第二十三卷（闻慧和思慧）  </strong></p><p>唐 法宝撰</p><p><span>闻所得慧和思所得慧，是在四加行——暖顶忍世第一法四种善根之前出生的智慧，这两种智慧不够坚固，遇逆缘则会退失。修到思所成慧后边的修所成慧的时候，观行智慧才不会退失。四种善根中忍善根出现的时候，善根才不退，观行智慧也不退。在四加行修完之后，才会出现证慧，证得四圣谛所出生的智慧，也叫作现量智、法智类智等等。</span></p><p><span>原文：<strong>杂缘法念住总有四种。二三四五蕴为境别故。唯总缘五名此所修。彼居此中修四行相。总观一切身受心法。所谓非常苦空非我。然于修习此念住时。有余善根能为方便。彼应次第修令现前。谓彼已熟修。杂缘法念住。</strong></span></p><p><span>释：在修习四念住中的法念住时，还要间杂观修身念住、受念住和心念住，不仅要缘法念住，还要间杂着缘其余三念住。因为修习法念住所对应的受想行识蕴四种境界各个不同，所以要总缘色受想行识五蕴来观修法念住。行者心缘法念住中要修习四种行相：苦、空、无常、无我，从总体上观行身、受、心、法的苦空无常无我。而在修习法念住时，还有其他善根如暖、顶、忍、世第一法，能方便验证所修结果，行者应该次第修习，使令四种善根一一现前。当这四种善根现前的时候，就说明行者已经很熟练地修习了杂缘法念住。</span></p><p>原文：<strong>将欲修习。此念住时。先应总缘。修无我行。次观生灭。次观缘起。以观行者。先观诸行。从因生灭。便于因果。相属观门。易趣入故。或有欲令。先观缘起。此后引起。缘三义观。此观无间。修七处善。</strong></p><p>释：行者在即将要修习此法念住时，首先应该从总体上缘于五蕴观行无我的行相，再次第观察五蕴的生灭，这是观行五蕴的无常行相，再次观行五蕴的缘起，这是观行五蕴空的行相。因为观行者是先观行身受心法诸行，是随顺于因缘而有生灭的，这样就方便从因果的相属角度来观行无我无常，容易趣入四圣谛理。有的人是想要先观察五蕴的缘起，后续再引发缘于蕴处界三法义的观行。这种观行方法就是无间断地修习七处善根，即于色受想行识五蕴分别观察其苦、集、灭、道、味、患和出离。</p><p>原文：<strong>于七处善。得善巧故。能于先来。诸所见境。立因果谛。次第观察。如是熟修。智及定已。便能安立。顺现观谛。谓欲上界。苦等各别。于如是八。随次第观。修未曾修。十六行相。彼由闻慧。于八谛中。初起如斯。十六行观。如隔薄绢。睹见众色。齐此名为。闻慧圆满。</strong></p><p>释：由于在修七处善时修得了善巧的缘故，就能于先前所观行的所有境界，建立因果谛理，即明了五蕴的苦集灭道，次第观察五蕴的七善处。像这样熟练地修习观行智慧和禅定以后，就能出生顺于四圣谛的现观谛智。顺现观谛就是随顺于欲界和色界无色界各自的苦谛、集谛、灭谛、道谛等的智慧，虽然这时候还没有现量观行智慧，但是却能生起暖法善根，不违背四圣谛理。</p><p>这样对于四念住和四圣谛八种义理，随其次第观行，修习从前所没有修出来的十六种行相。行者由于闻法所获得的智慧，在这八种谛理的观行中，最初生起了这样的十六种行相的观行。这时候的智慧犹如隔着一层薄薄的布绢来观看一切色相，到此闻慧就修圆满了。</p><p>闻慧修圆满的时候，观四念住和五蕴，就像隔着一层薄绢见色，虽能见色的轮廓，犹不清晰，朦朦胧胧，在闻慧出现之前，见一切法就更加朦胧不明了，无明很重。修到闻慧时，无明变薄一些了，修到思慧和修慧时，无明变得更薄了，及至证慧出现了，无明断除一部分，三缚结断除。</p><p>对照以上论文中所描述的闻慧特征和修行过程，检查自己的闻慧修到了什么程度，是否修习圆满了。即使已经修习圆满了，这才仅仅处于闻慧阶段，离证慧还有很远的距离。如果修了若干年，连闻慧都没有修圆满，应该检查自己差在哪里，如何弥补差距，应该采取哪些措施，快马加鞭，精进修道。</p><p>原文：<strong>思所成慧。准此应说。次于生死。深生厌患。欣乐涅槃。寂静功德。此后多引。厌观现前。方便勤修。渐增渐胜。引起如是。能顺决择。思所成摄。最胜善根。即所修总缘。共相法念住。</strong></p><p>释：思所成慧依照闻所成慧的准则也应该说一说，在闻所成慧圆满之后，就会对于生死轮回深生厌患，厌倦世俗，欣乐于涅槃的寂静功德。在此之后就会更多地引生出厌离世间的观行，现观世间之可厌，这样对于修道和观行就会更加地精进，观行越来越深入，智慧越来越殊胜。乃至于引发出了能随顺于五蕴苦空无常无我谛理的顺抉择分，由思所成慧所摄属的最胜善根就出现了，这就是所修的从五蕴总体上缘着四圣谛共相的法念住。</p><p>共相是指一切众生的五蕴都是同样的苦空无常无我，所有众生的五蕴都具有这样的共同属性，与此相对的是别相，是单体众生五蕴的苦空无常无我属性。法念住要从别相和共相两个角度来次第观察，才能修行圆满。</p><p>这里描述出了思所成慧所具有的相貌和特征，最主要的就是有对五蕴世间的厌患心，厌倦于三界世间，向往于清净的涅槃功德，内心顺从于五蕴的苦空无常无我性，不违逆四圣谛理，对四念住有如理如实的抉择，发起顺决择分。顺就是顺从、不背离四圣谛的意思，如果内心抗拒无我无常苦空之理，那就没有顺决择分，闻慧也不圆满具足。</p><p>如果学人还没有出现对五蕴世间的厌离心，还是对世间抱有欲求和希冀，赞叹世间法，贪着于三界世间法，不肯舍离，执着于世间眷属，情执深重，那就没有思所成慧，没有随顺于四圣谛理。这样的话修所成慧就更不具足了，离证道就太远了。通过观察众多所谓证果明心之人的言行，发现极少有人厌患世间，极大多数都是对世间充满了贪欲和希冀，所以这些所谓的果，都与真果相差太大了，联想其后世果报，就令人唏嘘不已。</p><p>有些人就会说，我们修学大乘法想成佛道的人，就是要保有五蕴，在五蕴世间里修行，自利利他，不应该厌离五蕴世间，如果厌离世间就是非菩萨种姓。此言差矣，菩萨应与声闻缘觉一样对世间生厌，只不过虽厌而不离，绝对不与凡夫一样喜乐于世间，贪着于世间，明知世间是幻化的，菩萨的智慧怎么能对幻化的世间抱有什么希冀和欲望呢？有欲有贪有喜乐，就说明其智慧有亏有差池，不明空幻之理。菩萨知世间空幻，其心寡淡，无欲无求，但为道业和众生，随其愿力，不得不行走于世间。而凡夫心却不是不得不，而是欣乐于世间，味着于世间，不忍舍离。所以无论是小乘学人还是大乘学人，只要修出思所成慧，必然会对世间生厌离欲，菩萨不离欲就是非真菩萨。</p><p>在闻所成慧和思所成慧中都有禅定，只是禅定的深浅不同而已，如果连基本的粗浅的禅定也没有，闻所成慧就不可能圆满具足，更别说思所成慧和修所成慧了。每一种智慧，都与禅定不相分离，无定心乱，心神不集中，则闻思不具足，定浅慧浅，定深慧深。在之后的修所成慧的集聚过程中，禅定一定要具足未到地定才能参证成就，从而见道。未到地定不具足的时候，可以有闻慧和思慧，也可以有修慧，但是修慧却不能圆满，也就不能见道。</p><p>原文：<strong>准上论文。即是三义七处等后。起总相念住。入暖法也。三义观者。即蕴处界。三科义也。七处善者。如实知色苦。色集。色灭趣。色灭行。色味。色患。及色出离。如实知受想行识七亦尔。如实知色。是四智知。谓法类智。世智苦智。</strong></p><p>释：对照上述论文中所说，应该知道，在观察蕴处界三科义以及七处善之后，就会生起缘于五蕴总相的法念住，入到暖法善根中。三义观就是对蕴处界三法的观察；七处善就是如实知色蕴的苦、色蕴的集、色蕴的灭道、色蕴灭所修的道、色蕴的味、色蕴的过患，以及色蕴的可出离性；并且如实知受蕴这七处善、想蕴这七处善、行蕴这七处善和识蕴这七处善，也都是与色蕴七处善同理。并且如实知色蕴，会生出四种智：法智、类智、世俗智和苦智。</p><p>解脱的人具十种智：法智、类智、世俗智、他心智、苦智、集智、灭智、道智、尽智和无生智。由于如实观察了五蕴中各蕴的七处善，就会以智慧如实知色蕴，知色蕴的智慧有四种，就是法智、类智、世智和苦智。法智是对一切法从总体上，以智慧观知其无我无常苦空；类智是对总体法中的相同类法的智慧观知；世智是对世俗界中法的智慧应对，随着世俗众生的根基利钝随宜度化；苦智是对五蕴世间的如实观察，一智慧知世间一切法皆为苦，不可取。</p></div>"
}]