[{
    "title": "前言",
    "author": "生如法师",
    "date": "2022年09月26日",
    "html": "<div class=\"B1_text\"><p>本卷讲述瑜伽行者在修习声闻四念住的过程中，所出生的四种善根：暖法善根、顶法善根、忍法善根和世第一法善根，这四善根也是声闻见道之前的四加行位。在作以如此四加行之后，就会获得法眼净，证得初果乃至四果。如果不修四念住，修习其它四圣谛法如白骨观等等，也都会出生此四善根，处四加行位，最后才能见道证果。   </p><p>在四种善根中，得暖法善根者，虽然还能退转，断掉善根，或者能造无间地狱业，以至于死入恶道，但在六道轮回中不至于流转很久就能达到涅槃。得顶法善根者，虽然也有退转，但善根不失，毕竟不断，还会增加善根。得忍法善根者，善根有增无退，命终不再住在异生位，不再造无间地狱业，不堕入恶道中，不会有卵生和湿生，也不会出生在无想天和北俱芦洲以及大梵天处，不会生为黄门和阴阳人，也不会第八次出生在三界中，见道所断惑终究不会再出现。得世第一法善根者，虽然暂时还住在异生位，但却能趣入正性离生，必得见道离开生死苦。</p></div>"
},{
    "title": "第一节 暖善根和顶善根",
    "author": "生如法师",
    "date": "2022年09月26日",
    "html": "<div class=\"B1_text\"><p><strong><span>第一节  暖善根和顶善根</span></strong><br/></p><p>原文：<strong>颂曰。彼居法念住。总观四所缘。修非常及苦空。非我行相。论曰。彼观行者。居缘总杂。法念住中。总观所缘。身等四境。修四行相。所谓非常。苦空非我。修此观已。生何善根。</strong></p><p>释：有颂曰：正处于修习四念住中法念住的行者，应该从总体上来观行身受心法四个所缘境，来观行身受心法的苦空无常无我的行相。有论说：观行四念住的行者，所触对的缘有总有杂，在观行法念住时，要从总体上来观行所缘的身受心法四个所缘境界，修习苦谛的四种行相：苦空无常无我。这样修习了法念住的观行之后，能生出什么善根呢？</p><p>这里的意思是说，在修习法念住阶段，从总体上观行身受心法所缘境，就会生出四善根，名为四加行，在见道之前才开始修四加行，在修习法念住之前四善根还不能出现，因为机缘还不到，善根不成熟的缘故。</p><p>原文：<strong>颂曰：从此生暖法。具观四圣谛。修十六行相。次生顶亦然。如是二善根。皆初法后四。次忍唯法念。下中品同顶。上唯观欲苦。一行一刹那。世第一亦然。皆慧五除得。</strong></p><p>释：有偈颂说：修习四念住的苦空无常无我之后，会生出暖法，有暖法善根能具足观行四圣谛，修习十六种行相：苦谛四行相、集谛四行相、灭谛四行相、道谛四行相。继续修习法念住之后也是这样再生出顶法，也具足观行四圣谛，修习十六种行相。暖法和顶法两个善根，都是最初修习法念住，从总体上观行身、受、心、法四个所缘境，后又修习四圣谛修习出来的。</p><p>再之后的忍法善根，只修习法念住就能生出来。忍法的下品和中品善根与顶法善根观行的所缘是一样的，忍法的上品善根，只观行欲界的苦，五行阴中的每一行每一刹那都要观行其苦谛。世间第一法这个善根也是这样，都是只修习法念住的时候出生的，下品和中品观行的所缘与顶法也是一样的，上品只观欲界苦。四种善根都是以慧为体，是智慧的体性，除了第五种得法得道者的善根。</p><p>十六种行相就是修习四圣谛之后出现的行相，其中苦圣谛要观察四念住的苦、空、无常、无我性，具这四种行相；集圣谛要观察集谛的因、集、起、缘四行相；灭圣谛要观察灭谛的灭、静、妙、离四行相；道圣谛要观察道谛的道、如、行、出四行相。暖法和顶法善根的修习中，都要修十六种行相，其中的观行智慧是逐渐深细的，禅定也是逐渐深入的，定慧的层次是逐渐深入的，直到修到第四善根世间第一法圆满以后，定慧具足，才能见道。</p><p>原文：<strong>论曰。修习总缘共相法念住。渐次成熟。乃至上上品。从此念住后。有顺决择分。初善根生。名为暖法。此法如暖。立暖法名。是能烧惑薪。圣道火前相。如火前相故。名为暖。</strong></p><p>释：有论说：总缘一切众生的共相修习法念住，其智慧能够渐次地成熟，直至达到上上品。修习完法念住之后，就会生出顺决择分，顺从于四圣谛理，有最初的善根出生，这种善根叫作暖法。这种智慧如温暖相，心被四圣谛所熏，趣向于四圣谛，所以取名为暖法。暖法譬如能够烧坏烦恼惑的薪材，是圣道火出现之前的相貌，就像火燃烧之前的状态一样，叫作暖。</p><p>把见道比喻为火相现前，材薪燃烧义，在火出现之前，最初要发生温度的变化，温度升高，暖度出现，这时候相当于暖法善根。随着温度不断地升高，热量达到一定程度，材薪燃烧，火就出现了。这中间次第经过顶法善根、忍法善根和世间第一法善根，之后就能见道了。暖法的出现，说明行者通过修习四念住和四圣谛，心已经发生了变化，能够随顺于四圣谛理生起了顺决择分，不再抗拒和违背四圣谛理，也相当于初步接受了四圣谛理，并且受熏了。</p><p>原文：<strong>此暖善根分位长故。能具观察四圣谛境。及能具修十六行相。观苦圣谛。修四行相。一非常二苦。三空四非我。观集圣谛。修四行相。一因二集。三生四缘。观灭圣谛。修四行相。一灭二静。三妙四离。观道圣谛。修四行相。一道二如。三行四出。此相差别。如后当辩。</strong></p><p>释：这个暖法善根所经历的修习阶段比较长的缘故，就是所处的分位长的缘故，在暖法善根现前阶段，能具足观察四圣谛的全部真实境界，以及能够具足修行十六行相。意思就是说，只观察了苦谛，还不能出现暖法善根，只观察了苦谛和集谛也是不能出现暖善根，再观察灭谛还是不能出现暖法善根，只有把四圣谛全部作以观察之后，才能出现暖法善根。</p><p>观察五蕴的苦圣谛，修行四种行相：无常、苦、空、无我；观察五蕴的集圣谛，修行四种行相：苦集起的因、苦是如何招集起来的、苦集是如何出生的、苦是以什么为缘而出生的；观察灭圣谛，修行四种行相：苦是如何息灭的、苦灭了以后是寂静的、寂静是最微妙的境界、寂静以后就离苦；观察道圣谛，修行四种行相：观察灭苦所修的道、所修之道契合真实之理、身口意行契合四圣谛理趣向涅槃、出离三界永远得解脱。这里所涉及到的所有修习内容都有差别，这些差别相以后再辩论。</p><p>原文：<strong>此暖善根。下中上品。渐次增长。至成满时。有善根生。名为顶法。此转胜故。更立异名。动善根中。此法最胜。如人顶故。名为顶法。或由此是。进退两际。如山顶故。说名为顶。此亦如暖。具观四谛。及能具修。十六行相。</strong></p><p>释：当这种暖法善根由下品至中品，再由中品至上品，渐渐增长到圆满的时候，就有另外的善根生发出来，叫作顶法善根。当顶法善根越来越殊胜的时候，就更换成别的名字。在这不断增长的善根中，顶法是最超胜的，就像人的头顶一样，就取名为顶法。取名为顶法，也是因为顶法处于进退两者之间，前是进，后是退，顶法犹如山顶，所以就名为顶法。在顶法善根阶段也如暖法一样，能具足观察四圣谛，以及能具足修行十六行相。</p><p>原文：<strong>如是暖顶二种善根。初安足时。唯法念住。以何义故。名初安足。谓随何善根。以十六行相。最初游践四圣谛迹。后增进时。具四念住。诸先所得。后不现前。于彼不生钦重心故。</strong></p><p>释：这样的暖法和顶法两个善根，在最初出生的时候，只有在修习法念住的时候才会出现。因为什么缘故说是初安足呢？这意思是说伴随着什么样的善根，以十六种行相最开始进入四圣谛的观行。在暖、顶法善根增进之后，就具足了四念住的修习。在这之前所修得的法，以后就不再现前了，因为对于先前修的那些法，心里不会生起特别看重的心思，因为那些法都比较粗浅，已经越过去不用修了。</p></div>"
},{
    "title": "第二节 忍善根和世第一善根",
    "author": "生如法师",
    "date": "2022年09月26日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  忍善根和世第一善根</strong><br/></p><p>原文：<strong>此顶善根。下中上品。渐次增长。至成满时。有善根生。名为忍法。于四谛理。能忍可中。此最胜故。又此位忍。无退堕故。名为忍法。此忍善根。安足增进。皆法念住。与前有别。然此忍法。有下中上。下中二品。与顶法同。谓具观察。四圣谛境。及能具修。十六行相。</strong></p><p>释：当顶法善根由下品至中品，再由中品至上品，渐渐增长到成熟圆满时，就会有其它善根生出来，名为忍法。对于苦集灭道四圣谛理能忍可的善根中，此忍法是最胜的缘故，所以就叫作忍法。又因为此忍位不再退堕回去的缘故，名为忍法。在四圣谛理的修习过程中，能容忍、安忍、忍可、认可四圣谛理的，属忍法善根最胜品，在此忍位，心对四圣谛理没有退堕，所以名为忍法。</p><p>此忍法善根最初出生和逐渐增进，都是在修法念住的时候出现的，修前边三个念住，还不能出生忍法善根，忍法善根不是杂修出来的，这就与前边的暖和顶善根有所区别了。此忍法善根也分为下中上三品，下、中二品与顶法相同，都具足观察四圣谛理，以及能具足修习十六行相。</p><p>由上文可知，忍法善根不会退回去不认四圣谛理，暖法和顶法善根有可能会退回去，就是说已经出生的顺决择分可能会失去，内心里不再有顺决择分，不再随顺四圣谛理，不接受苦集灭道之理。智慧有所退堕，其中原因有很多，任何因缘都可能致使智慧退堕，业障大的也有可能不再信佛学佛。但等业障关过去以后，也许还会重新燃起学佛修行的勇气和信心，也有可能再次修出暖法和顶法善根，但修到忍法善根的时候是不会退回去了。</p><p>因为四种善根都属于修慧，是修行所获得的智慧，所以闻慧和思慧是能够退堕的，是不坚固的，修慧的前部分也是能够退堕的，是不坚固的。到修慧的后期，智慧才坚固，不会退堕了，那么一旦见道实证以后，就更不会退堕了。见道以后，禅定有可能会退，但见道的智慧永远不退，果位就不会退。修到三果的时候，初禅定也许会退，不能永远保持下去，但是三果的解脱智慧和功德永远不会退，果位就不退。在见道之前，禅定也许不退，但智慧有可能退，只要智慧退，善根就退了，不管禅定如何。</p><p>原文：<strong>上品有异。唯观欲苦。与世第一。相邻接故。由此义准。暖等善根。皆能具缘三界苦等。义已成立。无简别故。谓瑜伽师于色无色。对治道等。一一圣谛。行相所缘。渐减渐略。乃至但有二念作意。思惟欲界苦圣谛境。齐此以前。名中忍位。从此位无间。起胜善根。一行一刹那。名上品忍。此善根起。不相续故。上品忍无间。生世第一法。</strong></p><p>释：忍法善根的上品与顶法有差别，上品只观察欲界的苦，与世间第一法紧紧相邻，由这个义理就能确定，在出现暖顶忍等善根时，都能具足缘三界的苦等四圣谛，这个义理在心中已经建立起来，就不用再加以拣别了。于是瑜伽行者对于色界和无色界修道的四圣谛对治方法，每个圣谛的行相所缘就逐渐地减少和简略，乃至于最后只有两个念的作意，来思惟欲界的苦圣谛境界。</p><p>在这以前名为中忍位，从中忍位开始无间断地生起更殊胜的善根，每一行每一刹那都称作上品忍。在忍法最初生起的时候，善根是不相续的，修到上品忍时，善根就无间断了，这时候就出生了世间第一法。</p><p>原文：<strong>如上品忍。缘欲苦谛。修一行相。唯一刹那。此有漏故。名为世间。是最胜故。名为第一。此有漏法。世间中胜。是故名为。世第一法。有士用力。离同类因。引圣道生。故名最胜。</strong></p><p>释：世第一法和上品忍一样，都缘于欲界的苦圣谛，修完十六种行相中的每一个行相，只要一刹那的时间就完成了，但因为这个善根是有漏的，所以就名为世间，因为是在世间中最殊胜的，就名为第一。这个有漏法是世间中最殊胜的，因此就说为是世间第一法。此世第一法有大的利用，是离开凡夫同类的因，能引生圣道，所以名为最胜。</p><p>世第一法虽然还是属于世间里的法，但却是世间法里最殊胜的，再以后就是出世间法的证圣预流果了，出世间就是走向解脱，渐离三界，渐趣涅槃。所以四加行是见道前的冲刺阶段，也是准备阶段。</p><p>原文：<strong>如是暖等。四种善根。念住性故。皆慧为体。若并助伴。皆五蕴性。然除彼得。勿诸圣者。暖等善根。重现前故。此中暖法。初安足时。缘三谛法。念住现在。修未来四。随一行相。修未来四。缘灭谛法。念住现在。修未来一。随一行相现在。修未来四。</strong></p><p>释：如是暖顶忍世间第一四种善根，因为都有念住的缘故，因此都以智慧为体，具有智慧性。四善根如果和助伴合一起，都属于五蕴性，是识蕴所具有的善根和智慧。但除去得法得道者，其余还不属于诸圣贤者，因为暖等四善根又重新现前，处于加行位的缘故，四善根之后的见道者才属于圣者。其中的暖法最初出现的时候，是缘着苦集灭三圣谛法，念住在现在的身受心法，修未来世的身受心法，随着四圣谛每一谛中的每一个行相，修未来世的身受心法；又缘着灭谛一法，念住在现在的身受心法，修未来世的法念住，随着四圣谛中任何一个现在的行相，修未来世的身受心法。</p><p>原文：<strong>由此种性。先未曾得。要同分者。方能修故。后增进时缘三谛。随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法。念住现在。修未来四。随一行相现在。修未来十六。由此种性。先已曾得。不同分者。亦能修故。</strong></p><p>释：因为此声闻种姓的人，先前并没有得过暖法，要具有同样善根者才能修习暖法。在后时善根增进时缘于苦集灭三谛，随着现前的一念住，修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。缘于灭谛法，在现前念住修习未来的四念住，随着灭谛的每一行相，修习未来的十六行相。由于此种姓先前已经得到暖法的缘故，处于不同分位的人，也能修习。</p><p>原文：<strong>顶初安足。缘四谛法。念住现在。修未来四。随一行相现在。修未来十六。后增进时。缘三谛。随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法。念住现在。修未来四。随一行相现在。修未来十六。</strong></p><p>释：顶法善根刚刚生起的时候，是缘于四圣谛法，念住现前的法修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。在后来增进时，缘于苦集灭三谛法，随着现前的一念住，修习未来的四念住，随着现前的每一行相，修习未来的十六行相。缘于灭谛，在现前的念住中，修习未来的四念住，随着灭谛现前的每一行相，修习未来的十六行相。</p><p>原文：<strong>忍初安足。及后增进。缘四谛法。念住现在。修未来四。随一行相现在。修未来十六。然于增进。略所缘时。随略彼所缘。不修彼行相。世第一法。缘欲苦谛法。念住现在。修未来四。随一行相现在。修未来四。无异分故。似见道故。</strong></p><p>释：忍法最初生起的时候，以及后来增进的时候，缘于四圣谛法，在现前的念住中，修习未来的四念住，随着四圣谛现前的每一行相，修习未来的十六行相。但是忍法增进以后，略过一些所缘法的时候，随着所略过的所缘法，就不再修此法的行相。世第一法缘于欲界的苦圣谛，在现前的念住中，修习未来的四念住，随着苦谛现前的每一行相，修习未来的四行相。因为再也没有其它分位的缘故，在此位就与见道位比较相似，但毕竟还不是见道。</p><p>原文：<strong>论曰。此暖顶忍。世第一法。四殊胜善根。名顺决择分。依何义建立顺决择分名。决谓决断。择谓简择。决断简择，谓诸圣道。以诸圣道。能断疑故。及能分别。四谛相故。分谓分段。此言意显。所顺唯是见道一分。决择之分。故得决择分名。此四为缘。引决择分。顺益彼故。得顺彼名故。此名为顺决择分。如是四种。皆修所成。非闻思所成。唯等引地故。</strong></p><p>释：有论说：此暖顶忍世第一法四种殊胜善根，名为顺决择分。这是依何义理建立的顺决择分名字？决就是决断的意思；择是拣择分别的意思。决断拣择诸圣道法，因为诸圣道能断除疑惘，以及能分别四圣谛的相貌的缘故。分是分段的意思，言语已经显示出了意趣。所顺的只是见道的一分，抉择之分位，所以立为抉择分名字。</p><p>以暖顶忍世第一法四善根为缘，引发抉择分，顺从增益圣道的缘故，就得了顺从抉择分之名，所以才叫作顺决择分。如是四种善根都是修所成慧，不是闻所成慧和思所成慧，唯独是等引地所摄。</p></div>"
}]