[{
    "title": "成唯识论第三卷讲解（1）",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>成唯识论第三卷讲解<span> </span></strong></p><p>原文：<strong>阿赖耶识为断为常。非断非常。以恒转故。恒。谓此识无始时来。一类相续常无间断。是界趣生施设本故。</strong></p><p>释：阿赖耶识是断还是常的？答：非断非常。为什么说阿赖耶识非断非常呢？因为阿赖耶识，祂有自身的识种子，祂自身的识种子，输出来以后，形成了阿赖耶识心体的不断运转。阿赖耶识本身的识种子，刹那刹那的输出，刹那刹那的生灭变化，才有阿赖耶识心体的存在和运转，才能形成阿赖耶识的各种功用。即使是在阿罗汉的无余涅槃境界里，阿赖耶识的自身识种子也是在不断地输出和生灭变化着，形成了不断灭的阿赖耶识，心体才能运转，才能不断灭。</p><p>阿赖耶识因为有自身的识种子在刹那生灭，所以说阿赖耶识是不常的。虽然识种子刹那生灭，但是形成的阿赖耶识却从来没有断灭过一刹那，这就说明了祂又是不断的。阿赖耶识的功能作用常恒存在，永远会运转下去，永远会现起世间万法，所以祂是非断的。阿赖耶识自身种子永远会刹那输出，刹那生灭，储藏的业种也会不断地生灭变异，所以阿赖耶识也是非常的。</p><p>以恒转故，因为这个阿赖耶识，永远在运行着，永远在运转着，从来没有停止过，没有停止过一刹那。因为祂是永远在运转着的缘故，所以说祂是非断非常的。阿赖耶识从无始劫没有头的时候开始，一直都在运行运转着，一直存在着，一直在起着利用。所以说祂一直是相续的。阿赖耶识常无间断，祂永远在运转着，所以叫常，因为没有灭过，所以说祂常无间断，一刹那都没有断灭过。</p><p>因此这个阿赖耶识，祂是我们欲界、色界、无色界，这三界六道众生以及四生胎卵湿化这四生的根本依。祂是所有众生的根本，因为有阿赖耶识，才有三界世间，才有六道众生，才有胎卵湿化四生，才有四圣六凡。一切众生、一切法都是以阿赖耶识为施设的根本。没有阿赖耶识就没有三界世间，就没有众生五阴世间，也没有四圣六凡。<span> </span></p><p>原文：<strong>性坚持种令不失故。转。谓此识无始时来。念念生灭前后变异。因灭果生。非常一故。可为转识熏成种故。</strong></p><p>释：阿赖耶识体性坚住，能持种子，让所有的种子都不失坏。什么叫体性坚住呢？阿赖耶识就是金刚经里所说的金刚心，这个金刚心永远不坏灭，任你任何人，任何力量都不能毁坏阿赖耶识，无法摧毁祂。为什么不能摧毁祂呢？因为祂不与世俗任何法相对应，因此世俗法的众生的觉知心，毁灭不了祂，众生的身口意行毁灭不了祂，世间的色法毁灭不了祂，色法和心法合起来的所有法，都毁灭不了祂，所以说祂体性坚住。又因为祂是本来就不生不灭的心体，无始劫以来祂就没有灭过一刹那，恒转相续，无始无终，所以说祂不能够被摧毁。又因为祂无形无相，所以无法毁灭。祂的体性是非常的坚固、坚硬，永远不失坏，这些就是说祂的金刚不坏性。</p><p>持诸种子，既然阿赖耶识是金刚不坏心，体性坚住，所以祂才能保持和存储众生的所有业种，永远不会消失和坏灭。这个种子不只是自身含有的七大种子，主要还有众生造业的业种子：包括善业种子和恶业种子，还有不善不恶的无记业的种子。众生的业种全部存在阿赖耶识心体里面，存在里面以后，除非是众生受到了相应的果报，实现了相应的因果律则，这个种子才消灭，否则就不灭。</p><p>如果不实现这个因缘果报，种子就不会消除，那会仍然存在阿赖耶识里。但是这个种子可以通过忏悔来消去一部分。比如可以通过证得空性，证得无生忍和无生法忍，才能消除一部分，但不是全部都能消除。这样阿赖耶识就必须是极其坚固，不会散坏和灭亡的，才能保持所存的业种不失去，不散坏，不灭亡。</p><p>转，谓此识无始时来，念念生灭，前后变异。就是此识一直在运行着，没有停止过。阿赖耶识无始时来念念生灭。什么叫念念生灭呢？意思是说，阿赖耶识祂本身也有识种子在刹那刹那地生灭着，就形成了这个不生不灭的阿赖耶识，才能保证阿赖耶识的永远不断灭，永远运行。说念念生灭，也是说阿赖耶识储藏的众生的业种子，念念都在生灭变化，消失一部分，又存进来一部分。阿赖耶识一边在实现众生的业果，一边在继续存储众生新的业种，使得业种不断地生灭变异。</p><p>所以说众生的业种子也是念念生灭，前后变异的。阿赖耶识在念念生灭变化，为什么生灭变化呢？一个是自身识种子，一个是七识造业的种子在里面生灭变化。阿赖耶识实现了众生的一个业果，就少了一个业果，又造了新业呢，就又增加一些业果，那么业种子就会不断地生灭变化。众生心清净的程度不一样，染污的程度也不一样。那么种子就会由染污变清净，由清净变染污，念念生灭变化，众生就是这样在生死轮回着。一世造善升天，一世造恶下恶道，不断地轮回在生死当中。</p><p>因灭果生，非常一故。因为种子在阿赖耶识里总是在生灭变化，那么实现了因果以后，种子就没有了。再造业呢，又增加了种子，阿赖耶识里的种子总在生灭变化着，使得阿赖耶识念念生灭，前后变异，不是始终都是原来的状态。那么众生今世的阿赖耶识和来世的阿赖耶识，开悟以后的阿赖耶识，还有入了初地以后的阿赖耶识，以及不同果位的阿赖耶识，其内涵都是不同的。因为祂里面种子在生灭变异着，这个生灭变异的现象，就是种子的因灭果生，这个业种子是因，刚刚造作完业行，就作为种子存进阿赖耶识里，种子就是因位的种子，将来缘熟，就会生果。</p><p>某个种子输送出来，实现了众生的业果，就是果生。果报一产生出来，实现了业果，这个种子的因就灭了，叫因灭果生。 阿赖耶识就不是永远常恒如一的，总是在生灭变化的。那么我们学佛的修行人，明心见性以后的菩萨们，其阿赖耶识总是在发生着变化，总是在越来越清净，所以阿赖耶识就是非常、非一故。不会是永远保持原来的那个状态，不会是染污总是染污，清静总是清静，有业障总是有业障，不会是永远染污不变清静的，不会是永远不变化的。</p><p>阿赖耶识可被七转识所熏，前七转识造业以后，把种子存在阿赖耶识里面，使得阿赖耶识就有了生灭性。那么阿赖耶识也就能被七转识所熏染，七转识就影响了阿赖耶识，本来阿赖耶识本身是清净的如来藏，这样把七转识染污种子存放进去了，就使得阿赖耶识，具有了种子生灭变异、因灭果生的这种生灭性。祂被七转识所熏，熏完以后就成了业种，存在心体当中。<span> </span></p><p>原文：<strong>恒言遮断。转表非常。犹如暴流。因果法尔。如暴流水。非断非常。相续长时。有所漂溺。此识亦尔。从无始来。生灭相续。非常非断。漂溺有情。令不出离。</strong></p><p>释：恒言遮断，这个恒就是不断灭的意思，永远如此的意思，从来没有断开过，就是恒。转表示非常，这个转就是流转的意思，随着七转识而一直在生死轮回当中流转着，随着七转识而一直在实现着众生的因缘果报。因灭果生，内里含藏的种子不断地在生灭变化，所以阿赖耶识也是非常的。阿赖耶识本身的识种子生灭变化不停，产生出来的七识的识种子也是生灭变化不停，业种子也在生灭变化不停，使得阿赖耶识整体就是生灭变化不停的。祂自身的体性虽然清净无染，但是祂含藏的种子在生灭变化，所以整体来说就是非常的。</p><p>犹如暴流，因果法尔，阿赖耶识就像一种暴流水一样，刹那刹那带着种子，一直在相续流转着，后浪推前浪，汹涌澎湃，一直不断地在实现着众生的各种因缘果报。众生七识造作业行之后，种子存入阿赖耶识里，然后缘熟再输出出来，实现业种。实现业种的同时，众生七识又造业，造业以后又存入业种，存进去以后，缘熟了再输出来，又实现了因果。这样众生因果相续，使得阿赖耶识像暴流水一样，一直不断地在流转运行、运作着，没有停歇之时，不断地生灭变幻，就像暴流水一直没有停息过一刹那。</p><p>阿赖耶识就像暴流水，既不断也不常。如果说祂是断的，无始劫以来祂一直都在随着七识而流转运行着，从来没有断灭过一刹那，即使在无余涅槃里，祂自身也在运行着，没有歇息过一刹那；如果说祂是常的，可是祂自身的识种子却在刹那刹那地生灭变换不止，祂内含的业种子在心体里面也在不断地生灭变异。有些业种消失，有些业种增加，由染污到清静，由清静到染污，一直在变化不停，因灭果生，不断地实现着众生的因缘果报，没有停止过。</p><p>相续长时，有所飘溺。众生无始劫以来，由于阿赖耶识一直都在随着七识流转在六道生死轮回里，其流转时劫，难以计算，只有佛智，才能知其劫数。众生在如此久远时劫里，一直受着各种生死业报，因因果果，果果因因，在生死海洋中，相续长时的流转漂流，到未来不知道何时为止。众生就是这样沉溺在自己所造就的生死业海里，不能自拔。因为阿赖耶识总是在随顺七识的无明，配合七识造作业行，不断地实现着因缘果报。存种子，输出种子，实现因果，让众生飘溺在六道轮回里，忍受着无量痛苦却无有出期。直到有一天，痛苦不堪时，反思自己，才开始觉悟，学佛修道，降伏烦恼，转染为净，慢慢地自救，才有希望拔出生死业海，得到解脱。</p><p>世间的大海水，深不可测，前浪后浪，汹涌澎湃，入者都会被海浪所飘溺，生死可怖。阿赖耶识也是如此，从无始劫以来，种子生灭，自身却相续不断，永不停息地流转着。内里储存着众生无量无边之多的生死业种，致使众生业海茫茫，不断地掀起一个又一个的生死大浪，前浪后浪，波涛滚滚，吞没着众生，头出头没，难以出离。</p><p><strong> <strong>原文：</strong></strong><strong>意显此识无始因果。非断常义。谓此识性无始时来。刹那刹那果生因灭。果生故非断。因灭故非常。</strong></p><p>释：意显此识无始因果，非断常义。以上内容的阐述，就已经表明了阿赖耶识，从无始劫以来，不断地实现众生的因因果果，因灭果生，果生因就灭，不断地生灭变异着。因此就说明了，阿赖耶识既不是断灭的，也不是常恒如一的。因为阿赖耶识从无始劫以来，一直在实现着众生的因缘果报，那么众生造业的因，作为业种存储起来，将来遇缘再输送出来，就实现了众生的业果，业果生出来时，造业的因就灭，种子就消失。同时众生的五阴再造新业，存新业种，将来再实现新业的业果报。这样，阿赖耶识就一直在实现业行的因灭果生，果生因灭的因果律则，永不停息。</p><p>祂能不断地实现众生的果报，就说明阿赖耶识是非断非常义。阿赖耶识不是断，也不是常。为什么不是断呢？因为祂自身体性坚住，从来不断绝地在出生众生三界世间的一切万法，从来没有断绝地出生众生一世又一世的五阴色身。祂一直在生起自身的利用，从来没有灭失过，没有断绝过。那为什么祂不是常呢？因为祂生出的七转识是生灭又生灭的，祂内里的业种是生灭又生灭的，祂实现的因缘果报是生灭又生灭的，祂所生出的一切法都是生灭又生灭的。而自身的识种子，也是刹那刹那生灭的，所以说阿赖耶识也不是常恒不变异的。</p><p>谓此识性，无始时来，刹那刹那，果生因灭。果生故非断，因灭故非常。阿赖耶识的体性从无始劫以来，都在刹那刹那地实现着因缘果报。众生的业果产生出来以后，那个造业的因就消灭，造业的种子就消失。造业种子形成以后，存在阿赖耶识里面，遇到缘熟时，再输出种子，来实现众生的因果。果，极大多数是在未来世缘熟时才能出生，那么未来世果出生了，就说明阿赖耶识仍然存在着，没有断灭，才能有后来的果报。</p><p>阿赖耶识是实现众生果报的主体识，是存储和输出种子的主体识，是产生三界世间一切万法的因，是一切万法缘起之理体和根源。当阿赖耶识实现众生的果报时，造业的种子就灭。种子灭了，就说明阿赖耶识是非常的，里面含藏的种子是不断生灭变异的，不能保持其恒常性，所以说这个阿赖耶识是非断非常的。说祂不断，是因为祂能延续到未来世不断，一直在实现众生的业果报。说祂非常呢，是因为祂含藏的种子生灭变异。<span> </span></p><p>原文：<strong>非断非常。是缘起理。故说此识恒转如流。过去未来既非实有。非常可尔。非断如何。断岂得成缘起正理。过去未来若是实有。可许非断。如何非常。常亦不成缘起正理。</strong></p><p>释：阿赖耶识非断非常，祂是世间一切万法的起因，是万法的源头，万法生起所依的理体。世间万法的生起，就是在实现着众生的业因果报，于是众生世间生死相续不断。阿赖耶识所实现的因缘果报，祂所出生的三界世间，十方诸佛国土，宇宙器世间，祂所产生的众生五阴十八界，都是因缘而生，都是缘起法。因为有阿赖耶识才能缘起，因为有阿赖耶识当中所存的业种，才能缘起，遇缘而生起，所以说缘起理，就是缘起所依的阿赖耶识理体。</p><p>因为有缘起理，所以才说阿赖耶识恒转如暴流。祂必须实现众生的所有因缘法则，就必须要不断地现行运作，祂不可能断灭一刹那。否则，万法就不能缘起，所有的业种都会断灭不现，众生世间就再也不会出现，永远静悄悄，空旷、空无。因为过去未来的所有世间一切法，都不是真实有，必须依赖阿赖耶识而现起，所以阿赖耶识必然是真实存在的，是可以依赖的，过去未来的世间一切法，依之才能不断地生起。如果阿赖耶识是断灭的，那就不能有世间一切法的缘起。</p><p>过去未来的一切法，如果是实有的，是真实的，是不生不灭的，那么就能允许阿赖耶识断灭，因为一切法都不需要阿赖耶识而变现出来，自身就能保证自身永远存在不灭。那么阿赖耶识就是无用的，可以废弃的。因为过去未来的一切法都没有自性，都是生灭虚幻不实的，而这一切却还在不断地出生现起，所以就必须依赖阿赖耶识而生起，阿赖耶识就不是断灭的。如果阿赖耶识是恒常不变异的，那么其内所存的业种，就要永远保持如一，不能出现变异。</p><p>如果阿赖耶识里的业种没有生灭变异，众生的五阴世间就没有生灭变化，永远恒常如一，原来是什么状态，就会永远保持什么状态。是畜生身的，永远是畜生身，永远在畜生道，种子不变异故。是地狱身的，永远是地狱身，种子不变异故。是天人的色身，永远是天人的色身，种子不变异故，那么就不会有六道轮回了。如果阿赖耶识是恒常不变异的，那就永远不用再生成世间任何一个法。众生世间就没有生灭，没有六道生死轮回，众生也就不是众生，全部成为无生死业缘的果地佛。现见此理不通，所以阿赖耶识也是非常的。</p><p>阿赖耶识如果是常不变异的，那么众生造善业，阿赖耶识就不会记录收藏业种，造恶业，也不会记录收藏业种，造不善不恶业，同样不会收藏业种，众生就不会有因缘果报，也没有来世的种子现行，那样众生就会断灭，或者涅槃，不会再出生了。那样的话，世间就没有缘起法，就不会产生任何法出来，众生世间就灭。所以阿赖耶识不是常的，一定有种子在生灭变异，才有五阴世间的不断生起。当众生修到佛地时，种子也不变异了，阿赖耶识就是常恒不变异的，其名改为无垢识，无垢识里唯有善业种，没有恶业种，佛只有善报，没有恶报。而众生的阿赖耶识一定是非断非常，不能是常恒不变异的，那就不能有缘起法的出生，不能有三界世间的现起了。</p><p> 原文：<strong>此识与几心所相应。常与触作意受想思相应。阿赖耶识无始时来。乃至未转。于一切位。恒与此五心所相应。以是遍行心所摄故。</strong></p><p>释：此识，是指阿赖耶识，祂与几个心所法相应呢，祂常常与触、作意、受、想、思五个心所法相应。阿赖耶识从无始劫以来，在一切位中，都是恒久、永远地与这五个心所法相应。一切位是指：凡夫位、外道位、二乘的四向四果位、辟支佛位、地前菩萨位、地后菩萨位、等觉位、妙觉位，以及佛位，这五个心所就一直存在运行着，从来没有断绝过。</p><p>乃至于在阿赖耶识不运转位，这五个心所法也在运行着。这里不运转位，是指阿罗汉辟支佛们的涅槃境界。在涅槃境界里，没有五阴，没有十八界，没有七识，因此阿赖耶识就不会配合五阴七识的运转，阿赖耶识也就一个法也不出生，祂就不作世间任何一件事，因此叫做不运转。虽然如此，阿赖耶识的五个心所仍然在运行着，没有断绝。</p><p>为什么这样呢？因为在涅槃境界里，阿赖耶识自身仍然存在，仍然在运作着，自身的识种子仍然在刹那输出，来维持阿赖耶识的存在不灭。而只要有阿赖耶识的存在，心所法就必然要运行。而且阿赖耶识里还有二乘人的业种存在，二乘人还有变异生死没有了。因此阿赖耶识还要触业种，还要与业种相对应，五个心所必然要运行。有阿赖耶识就有五个心所法的伴随运行。因为这五个心所法属于遍行心所法，要普遍地运行。遍，就是遍一切时，遍一切位，遍一切地，遍一切处，遍一切界，遍一切法，五遍行心所法就这样普遍地运行着，永不断灭。</p><p> 原文：<strong>触谓三和分别变异。令心心所触境为性。受想思等所依为业。谓根境识更相随顺。故名三和。触依彼生。令彼和合。故说为彼。三和合位。皆有顺生心所功能。说名变异。触似彼起。故名分别。</strong></p><p>释：三和，就是根、尘、识，三者和合在一起。和合在一起以后，识就触尘。触是识的触心所，触尘以后，识就领受领纳了尘，领纳就是受心所。领纳了以后，就了别了尘，了别是识的想心所。了别了以后，就开始思量，最后生起决定心，要如何造作了，这就是识的思心所。</p><p>当然，这里还有很多复杂的事情，不是一下子就能决定造作的，中间还会有触、作意、受、想等等心所法的不断现起，才能作最后的决定，要如何造作，这里面是很复杂的。六识决定的事情，要交给意根审批，意根同意了，才能由意根决定如何造作。于是第八识就配合，让六识造作，身口意行就表现出来了。</p><p>触，是受想思的所依，没有触，就没有受，没有想，没有思。因为识不接触尘，就不能领受尘境，进一步也就不能了别尘境，那就不能思量尘境，就不能对尘境生起抉择心和造作心。但是，最初还得有识的作意心所。</p><p>作意心所，在种子位，就生起来了。就是说，识种子在第八识里，就作意于尘境，就是对准尘境的目标，或者叫做尘的处所，识种子就要出现在目标那个地方了。然后识种子，才能在作意的尘境那里生出来，生出来以后，就会触尘境。</p><p>作意，是引心于境，把注意力对准尘境处所。然后识种子在相应的尘境那里生出来。这是指六识的作意，不是指第八识的作意。第八识有自己的作意，与七识不同，第八识有自己需要了别的目标和内容。如果意根对尘境不感兴趣，就不生起抉择，就不会决定去分别和了别自己不感兴趣的尘境。意根决定之后，第八识才能生出识种子，来了别意根所决定要了别的尘境。所以一切法，都不离意根，都不离第八识。</p><p>当识种子还没有被第八识生出来之前，识种子就在第八识里。如果识种子要生出来，它得有个目标或处所，如果意根对某些尘不感兴趣，第八识不会使识种子生于意根不感兴趣的处所。第八识肯定是往意根感兴趣的地方生起识种子。所以说这个识种子在生之前，得有一个处所，作意于一个处所，识种子才能生出来，这个地方就是意根感兴趣的地方。</p><p>比如意根对花感兴趣，识种子就作意于这个花，对准这个花，然后识种子在后脑有花的内相分处生出来。如果识种子对声音感兴趣，那么识种子就会作意于声音，然后第八识把识种子在后脑有声音的内相分处生出来。这样识和尘就相触了，相触之前必须先作意，作意就是对准那个尘境的目标，然后让识种子生出来，生出来肯定是在那个尘处，生出来就马上触了，遇到一起了。这两个东西一见面肯定就触了，作意肯定是在没见面之前。</p><p>比如说我想找一个人，我就知道这个人在东边，我就作意于东边，然后我就冲着东边，奔着东边去了。我到东边了，那么就和东边这个地方相接触了，就与东边的人见面了。到东边之前呢，我要作意于东边，准备往东边去了。这个作意是在识种子没生出之前，就是我还没有开步走的时候，一但到了目标所在之处，两个就见面接触就接触了。</p><p>根境识，更相随顺，是三和。识生出来的前提是，内相分的境，先在胜义根处生出来，根与境再相触，然后第八识再出生识，于是三者和合在一起，互相触。识如果能够一直触境，必须是根与境一直在相触，这是前提条件。如果有一刹那，根不能触境，识就不能触境，就不能了别境。</p><p>触依彼生，触依根境识而生。首先，有根境，才能有根境的触，其次，才有识，有了识，才能有三和合触。触，能让三者和合在一起，这是触的功能。三和合位，皆有顺生心所的功能，就是说，三者若是一和合起来，其他心所法就会一个一个地生出来了。其他心所生出来，就产生了变异，就是说，触的心所法转换了，识的功能作用在不断地发生变化，识的了别功能就不断地在进行着。触似彼起，故名分别。有了触，才有后边的心所法生起，于是，才能有识的了别功能作用，识才能了别境。</p><p> 原文：<strong>根变异力。引触起时。胜彼识境。故集论等。但说分别根之变异。和合一切心及心所。令同触境。是触自性。既似顺起心所功能。故以受等所依为业。起尽经说。受想行蕴。一切皆以触为缘故。由斯故说识触受等。因二三四和合而生。瑜伽但说与受想思为所依者。思于行蕴为主胜故。</strong></p><p>释：什么叫做根变异力呢？这里的根，是指后脑部位的胜义根，因为阿赖耶识要把内相分六尘变现在这里，阿赖耶识要吸取胜义根这里的四大营养物质，才能变现出比外界物质色法更微细的内相分。所以后脑这部分营养要够用，如果营养不足，阿赖耶识摄取的四大就不调和，变出的六尘相就会稍微扭曲，与外相分不太一致，六识了别的就不如实。那么这个人与他人相比，就不太正常，小脑萎缩的人就是如此。</p><p>因为胜义根这里，生出了六尘，就产生了变化，就是根变异了。由于这个变异力，就引起了六根与六尘相触。为什么相触呢？因为六尘出生在胜义根里，二者必然是在一起的，那就接触了。这个触，是相当重要和关键的，会引起后续的识心出生，以及会引起识心所有心所法的生起，会引起以后的一系列的分别了别活动。所以这个根变异力引起的触，要超胜于六识与六尘境界的触。没有前边根尘的触，就没有后边识境的触，所以前边的触，要超胜于后边的触。</p><p>所以阿毗达摩集论等论著当中，特别强调根的变异，六根发生变化，触了六尘以后，就会和合一切心及心所法。意思是说会引生出六识，六识出生以后，心所法就会开始运行，六识及心所法一起触六尘境界，这就是触的自性。触，就是和合义，碰触、接触的意思。既然触，能够引起顺次生出心所的功能作用，所以触，就是后续的受心所的所依。受心所依赖着触心所，才能出生，才能有作用。</p><p>起尽经里说，五蕴当中的受蕴、想蕴、行蕴、识蕴，这四蕴，都是以触心所为缘，所产生出来的。因为六根触六尘，阿赖耶识就会变现出六识的识蕴，于是六识就有受蕴，之后六识会有想蕴，于是六识的行蕴就随即运行起来了。这个触，就是这样的关键。由于这个触，六识触六尘境界以后，就有了受蕴、想蕴和行蕴这三蕴的出生和运行。众生的五蕴就运行起来了，就能在世间分别一切六尘境界，业行也就产生出来了。</p><p>瑜伽师地论里，只说触是受想思心所的所依，受想思心所依止于触，才能出生运行。这个说法与上述说法是一致的，因为思心所，就相当于行蕴，思的心所法以行蕴为主，行蕴在思心所里比较超胜，比较突出。行蕴就是身口意行的造作，思心所的最突出内涵就是造作，当然还有抉择之意。而受心所就与受蕴相对应，想心所与想蕴相对应，思心所就与行蕴相对应。这些是六识受蕴的心所法，所以触，是五蕴当中四蕴的所依，是出生四蕴的前提条件，那么根变异引起的触，就是相当重要和超胜的。</p><p> 原文：<strong>举此摄余。集论等说为受依者。以触生受近而胜故。谓触所取可意等相。与受所取顺益等相。极相邻近。引发胜故。然触自性是实非假。六六法中心所性故。是食摄故。能为缘故。如受等性。非即三和。</strong></p><p>释：思于行蕴为主胜故，举了这个例子，也包括了其它方面。同理，受于受蕴为主胜故，想于想蕴为主胜故。意思是说，受心所以受蕴为主，受蕴的作用比较突出。受心所包括两方面，一个是领受领纳，一个是三种感受，苦受、乐受和舍受。受心所的功能作用以后一种受为主，所以受蕴也就是受心所。再同理，想心所以想蕴为主。想心所一方面包括六识的了别性、了知性，一方面包括六识的思想感情色彩，所有的心里认知功能，所有的心里活动。所以想蕴也通想心所。</p><p>阿毗达摩集论当中说，触是受心所的所依，受心所依触心所而生而运行。因为有触，顺次才能有受，二者紧密相连，所以触对于受来说，是很超胜的。又因为触，能够取意根第七识的可意的六尘境界相，不可意的六尘境界相，就不会去作意，也不会去触。而受也是取能够顺己意的境界相，接受领纳顺己意的境界相。这二者取相极其临近，引发受心所的功能作用，是很超胜的。</p><p>然而，触心所自性是实有的，真有其功能作用，并不是一个假名词，不是只有一个名词概念，没有其实际功能作用。触在六识法当中，确实是起了心所法的功能作用，是四食当中的触食所摄。众生以六识触六尘而为食，六识触六尘，众生才能在三界世间中生存，这是众生生存的前提条件。如果六识不触六尘，六识就会灭去。这样众生就没有五蕴的活动，也就不能正常生存了，这是众生所最不愿意的。</p><p>触，能作为受、想、思心所出生的一个缘，一个前提条件。触，需要根尘识三者和合，而受想思心所，就不需要根尘识三者和合。只是单纯的六识活动，只涉及到了六尘，是对六尘的一系列的了别活动，不像触心所涉及到了根和尘。</p><p> 原文：<strong>作意谓能警心为性。于所缘境引心为业。谓此警觉应起心种。引令趣境。故名作意。虽此亦能引起心所。心是主故。但说引心。有说令心回趣异境。或于一境持心令住。故名作意。彼俱非理。应非遍行。不异定故。</strong></p><p>释：作意，就是能够把心，警觉起来。就像赛跑运动员，要准备起跑了，心在警觉着，等着听枪声，一旦听到枪声，马上就会冲出起跑线。作意心所也如是，在准备着在出生到相应的尘境上。这就是说，识心还没有被生出来，正准备着生出来，但是得有个出生方向和处所，识种子才能输送出来，识才能出生，不能随便漫无目的地就生到一个处所。</p><p>识心要出生的处所，就是所缘境，也就是作意的尘境。所以，作意是在种子位，是在阿赖耶识里，识种子还没有出生，就准备着要出生到相应的处所，或者是感兴趣的处所，或者叫做关心在意的处所，与识心有关的处所。所以才会去作意，否则就不会作意了。</p><p>如果识心明明不想看一件花衣服，就不会作意于花衣服。作意，就比如是，我要出门，在房间里，还没有出去，但是我得知道，到哪里去，往哪个方向目标走去。心里在想着目标方向，就是作意。人还没有出门，就比如识是在阿赖耶识里的种子位。作意了以后，就有了目标，阿赖耶识了知以后，就把识种子出生在作意的目标处所上，祂不能随意胡乱地生出识种子。不会说识心对沙发感兴趣，阿赖耶识却把识种子出生在桌子上，或者出生在汽车的声音上。</p><p>作意，叫做引心趣境。就是把心引到趣向于相应的尘境上。虽然说，作意也能引起触心所的生起，但是作意还是以引心为主，不是引心所，心所是心的伴侣，是助伴，协助于心的运行，心是主体，所以作意就是引心，趣境。</p><p>有人说，作意是让识心回转到另一个境界上，还有人说，作意是识心对于一个境界保持不变。这两种说法都不对，如果是这样，识心对一个境界保持不变，识心就不能普遍运行了，见一个色时，就不能见另一个色或者是其它色。这样就与识心的定是相同的，就不是心所法的运行了。</p><p>而作意心所法，是对所有相关的、感兴趣的尘境，有所警觉和注意，不是只对一个境界保持不变。如果识心的作意是只对一个境界保持不变的话，这是识心的定，是定心所，不是作意心所了。只有修定时是如此，也需要如此，不修定时，识心的作意就不是这样。修定就是不让识心分流，识种子尽量都生到一个处所，这样识的势力才大，识别的就清楚彻底，识心就有智慧。比如一条汹涌澎湃、气势汹汹的大河，分成好多水流，就没有大河的势力了。识心也如是，所以才需要修定。</p><p>如果作意是识心回转到另一个境界上，叫做作意，那么在当前的境界上，就没有识心的了别作用，识心就不是普遍运行的。实际上是，识心可以同时在不同处所出生和了别，可以同时作意多个目标，同时触多个境界。所以作意是识心回转到另一个境界上，这个说法是错误的。</p><p> 原文：<strong>受谓领纳顺违俱非境相为性。起爱为业。能起合离非二欲故。</strong></p><p>释：受的内涵：接受、领受、领纳、感受。而情绪化的受，是受蕴当中的三种受。受，所有的内涵就这些，触之后的最初受，一定是接受领纳领受，不是情绪上的三种受，过后才会有情绪化的三种受的出生，那就是受蕴了。</p><p>受，是领纳、领受、接受、接纳，就比如别人送过来一样东西，我们首先是要接受过来，拿过来，容纳以后，才能有下一步的了别，才能知道是什么物。识心与境界相接触以后，识心就会先要接纳境界，然后再谈下一步想心所的了别，以及思心所的思量和抉择。</p><p>受心所，就是领纳顺境、领纳逆境以及领纳不顺不逆的境界相，为受的自体性。领纳之后就会生起爱乐心、厌弃心和不爱不厌的舍心，然后造作贪、厌以及不贪不厌的业行。能引起合境的欲望，就是贪求境界的心行，能引起离境的欲望，就是躲离、背离、逃避境界的厌离心，能引起既不贪求，也不厌离的舍念心行。</p><p> 原文：<strong>有作是说。受有二种。一境界受。谓领所缘。二自性受。谓领俱触。唯自性受。是受自相。以境界受。共余相故。</strong></p><p>释：有人这样说，说受有两种，一种是境界受，就是对于心所缘的境界进行领纳领受。这个说法是正确的。第二种是自性受。自性受这个意思是说，受心所有自体性，有自己的行相，有自主性。</p><p>而此人说，受心所就是指第二种自性受，不是指第一种。他说受是领纳、领受识心自己与境界相的俱生触，是要感受触，不是要感受境界。此人说自性受，就是对于俱生触的领纳领受，是对触心所的感受，受不是领纳领受境界，不是对于境界的领纳领受和感受，是识心自己在感受识心自己的触。只有这种自性受，是受心所的自体相。他的理由是，因为对于境界的感受，还要和其它的相分和合在一起，又加进了一个境界相，这样就不是受的自体性了。此说非理，名为错解。</p><p>什么叫做俱触呢？就是说触心所是受心所的俱生依，因为有触心所，才有受心所的出生，所以受心所生来就有触心所的伴随。俱生的意思是，受的生起，是触所引起的，触心所是受心所的俱生依，没有触，就没有受。所以叫做俱生。</p><p> 原文：<strong>彼说非理。受定不缘俱生触故。若似触生名领触者。似因之果应皆受性。又既受因。应名因受。何名自性。</strong></p><p>释：自性受这个说法是错误不如理的，为什么是错误的呢？因为受心所一定不会去缘俱生触，不会去领受触心所，不会感受触心所，一定是要领受六尘境界相的。</p><p>受心所肯定是不缘触心所，不会去领纳自己与境界相的触相。就像人触摸到一个物体上，接着会产生受，这个受一定是会接受领纳物体，而不会是领纳手本身对于物体的摸触。所以第二种自性受的说法是错误的。</p><p>如果相似于触心所的受心所的生起和作用，就是领受触心所的，那么和生起的因（触心所）相似的果（受心所），就都是受的自体性了。这里就不对了。如果说因为触，而有受的出生，受就得领受感受触，那么因为作意，才有触的出生，触就应该触作意，不应该触根和尘。又者，因为有受，才有想的出生，想就应该了别受，不应该了别境界，那么识就不会知道境界相，就会对六尘境界一无所知。</p><p> 原文：<strong>若谓如王食诸国邑。受能领触。所生受体。名自性受。理亦不然。违自所执。不自证故。若不舍自性。名自性受。应一切法皆是受自性。故彼所说但诱婴儿。</strong></p><p>释：如果有人说，就像国王在自己的国度里出生，就要生活在自己的国度里。以此来比喻，受心所是由触心所而有，受心所就要接纳感受触，不能去感受境界；领受触心所的受的体性，才是自性受，才有受的自体性。那么这个说法就是错误的，违背了受心所的自体性，受的自体性就是对于境界的感受。如果受不对境界，不感受境界，那就没有识的自证分了，识就不能领受和识别境界。</p><p>如果一个法，是由另一个法引导而出生，然后就要去领受另一个法，才有自性的话，那么一切法都是由另一个法所引导而出生，一切都要去领受感受另一个引导它出生的法，那么一切法就都是受性了。这样的说法显然是不对的，比如因为有作意，才有触的出生，如果触出生以后，就要去领受作意，那样怎么还会有触的自性呢？</p><p>想是由受所引导而出生的，如果想心所出生以后，就要去领受受心所，那么想心所怎么还能有自体性呢？那也就没有想自性了，那样的话，什么叫做想呢？思心所是由想心所引导而出生的，出生以后如果是领受想，那样怎么能有思心所的功用呢？思心所就不会有自体性了，思心所的自性也就不存在了。所以说，受自性是领纳俱生触不领受境界，这个说法是错误的，只是用来哄骗诱导婴儿罢了。</p><p> 原文：<strong>然境界受。非共余相。领顺等相。定属己者。名境界受。不共余故。</strong></p><p>释：有人说，境界受，共余相故，与其它心所共用相分，因此受心所就不是境界受，他这个说法是错误的。可是受心所就是对于境界的领受，不是与其它心所共用。领受顺心境界相，领受违逆的境界相，领受不顺不违的境界相，一定是属于受心所的功用，不与其它法、其它心所共同混合使用故。</p><p> 原文：<strong>想谓于境取像为性。施设种种名言为业。谓要安立境分齐相。方能随起种种名言。</strong></p><p>释：想心所的体性是对于境界，能够取着境界像。取着，就是摄取境界，和了别境界。了别了境界以后，就会为所了别的境界设立了种种的名言。比如，眼识意识同时触了树木以后，首先会接受下来，领纳这个树木像。领纳了以后，就会取着树木相，知道树木的显色、形色、表色和无表色。然后心里就会有了树木的颜色，树木的形状，树木的年轮，树木的高大或者弱小，等等这些名词和概念。</p><p>然后内心里会有声音和念想，或者会用语言，表达描述出来。这就安立了一个树木的境界相，确切知道了它属于哪种色尘，给它定了位。安立定位之后，才能随即生起种种的名言，就会形成各种语言文字。所以想心所的作用，就是先摄取境界像，安立境界像，给境界像定位以后，再生起种种的名言，来表达显示出来，从而让他人来共同领受了知。</p><p> 原文：<strong>思谓令心造作为性。于善品等役心为业。谓能取境正因等相。驱役自心令造善等。</strong></p><p>释：思心所的体性，是能够驱使识心去造作。比如眼识的思，是眼识了别了色尘以后，生起贪厌或者是舍心。于是思心所现行，决定是继续了别，还是移开躲避去，还是随缘。决定之后，就造作了，或者继续看，或者移开，看其它色尘。耳识的思，是耳识了别声尘以后，决定是继续了别，还是躲避，还是随缘，于是，就按照决定造作。</p><p>鼻识、舌识、身识都是如此。意识也是如此，分两种情况的思，与五识在一起的思，和单独了别法尘的思。而意根的思，就显得很重要了，祂不仅自己直接决定，而且还会主导六个识的行为造作，还能驱使第八识的造作，祂是联系六识与第八识的桥梁和纽带。</p><p>那第八识的思，就是第一重要，极其关键了。因为一切法都来自于第八识，第八识生起思心所，当然第八识就开始造作，第八识一造作，相应的法，就产生出来了。没有第八识的思，就没有一切法的出生，所以第八识的思，就是极其重要的。而第八识的思，一部分是由七个识的思所引起的，尤其是意根的思，会令第八识的思心所现行，从而进行真正意义上的造作，这是真造作，真有法产生出来了。</p><p>第八识的另一部分思心所，是自己本身运行的，不与七识有关。比如了别众生的业种，如果是恶业种成熟，祂就会让众生的恶报现行出来，出现各种疾病，或者祸事和灾难。众生的善业种成熟，会让众生受善报，突然发财和升官等等。这些都是七识所想象不到的，而且恶业果报，也不是七识心所希望的，七识不会去决定受恶报，让自己受苦恼。第八识法尔如是地，就要这样的运行，这是祂的律则，谁也没办法。第八识对于身根和器世间的思，也不受意根所左右，与七识心的思没关系。六七八，三个识的思，都很复杂，不能尽述。</p><p>思心所的作用，能够驱使自心去造作善业、恶业和不善不恶的无记业。思心所首先会思量执取各种境界相，或者思量执取各种相分，思量之后，再决定造作。于是六识的身口意行就出现了，或善，或恶，或无记。而第八识的思，造作，纯是无记业，不属于善和恶。但是，佛地的第八识就与十一个善心所相应，第八识的思心所，就造善业。转识成智以后，七识大多也是以造善业为主，渐渐与善品法都相应，远离恶品法，远离染污。染污真正远离时，可能就到八地菩萨的果位了。</p><p> 原文：<strong>此五既是遍行所摄。故与藏识决定相应。其遍行相。后当广释。此触等五。与异熟识行相虽异。而时依同。所缘事等。故名相应。</strong></p><p>释：这五心所法，就是遍行心所所摄，只要有识心的运行，五遍行心所法就会同时现行，与识心同时同处运行。所以五遍行心所法，与含藏识也就是第八识是绝对相应的，因此第八识异熟识就有五遍行心所法。而五遍行心所法，到底是如何遍如何运行的，其运行的行相是什么，以后会广泛地来加以诠释。</p><p>此触、作意、受、想、思，五个心所法，其运行的行相，与异熟识的运行行相，有些差异，不是完全相同。但是二者现行的时间是同时的，所依的事相是同一个。那么异熟识是什么行相呢？行，是运行，相，是运行的相貌和相状。五遍行心所法，与异熟识的运行行相，不同有差异。第八识异熟识现行的时候，完全是无形无相的，也完全是如如而无为的。</p><p>而心所法的运行却有一定的相貌和形相，是有为的，有造作性。造作就是有为，造作行为包括作意、触、受、想、思，都是有为性。因为心所法的有为性，所以，第八识才能出生一切法，产生三界一切有为法，包括器世间，众生的五蕴十八界，实现众生的因缘果报。第八识是无为性与有为性的和合，有为无为合在一起，就构成了完整的第八识体性，二者缺一不可。</p><p>第八识与心所法的行相虽然有差异，而时依同。时，就是时间、时候，依，是所依的各种相分。就是说第八识异熟识和五遍行心所，是同时同处运行，第八识只要运行，心所必然也同时运行，而且都是依于相同的事相，所依的相分，是一样的，相分是同一个。</p><p>所缘事等，故名相应。等，是同等、同样，异熟识和五遍行心所法，所缘的事相是相同的，是一样的，是同一个，所以是相应的。如果不是同一个，那就是不相应的。相应，就是心所法与异熟识是相应的，心所法是五十一相应心所法中的五个，必与识心相应，是识心的助伴，伴随、辅助识心的运行。除了五十一心所法，还有不相应的二十四个不相应心所法，与识心不相应，与识心运行的时、处、相，都不相应，故名不相应行法。</p></div>"
},{
    "title": "成唯识论第三卷讲解（2）",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>成唯识论第三卷讲解（2）</strong></p><p>原文：<strong>此识行相极不明了。不能分别违顺境相。微细一类相续而转。是故唯与舍受相应。又此相应受。唯是异熟。随先引业转。不待现缘。任善恶业势力转故。唯是舍受。苦乐二受是异熟生。非真异熟。待现缘故非此相应。</strong></p><p>释：此识，是指第八识异熟识。祂的运行行相，极其微细，不分明，不明了。不像六识心那样，容易让人名了，容易让人认知到。六识心的运行比较粗，意识容易观察到，而第八识的运行非常微细，极不容易让人发现，需要福德具足到一定程度才行。第八识不与六尘相对应，不能分别六尘。六尘境界是顺境还是违境，祂不知道，就是说祂不知道六尘的好坏，不知道是非和善恶，因为不与六尘相对应，不知不见六尘故。</p><p>第八异熟识的行相，是那样的微细，以至于极大多数人，很难证得祂，也很难观察到祂的存在和运行。但是祂却永永远远地相续运作着，从来就没有停止过，未来也永远不会停止运转。因为祂是不生不灭的心体，永远不会有断绝时。因此，第八识只有与舍受相应，没有苦受和乐受。但是第八识的舍受与前七识的舍受，有些不同。</p><p>前七识的舍受，是分别六尘境界以后，对六尘境界的感受是随缘，可有可无的觉受，是一种无所谓和不在意的感受。而第八识的舍受，是根本就不了别六尘，不知道六尘，当然不会对六尘生起任何感受了。就像一个盲人，看不见鲜花，对于面前的鲜花，当然没有任何感觉了。也就像一个聋人，根本就听不见声音，音乐传过来，他当然不会有任何感受了，第八识就是如此。</p><p>这种不分别六尘顺境和逆境的相应舍受，只有异熟识有。随先引业转。不待现缘。任善恶业势力转故。唯是舍受。异熟识随着众生前世所造作的业行，而随七识流转到此世。而异熟识对于众生的业行和果报，也是舍受，祂不会因为众生造善业，升天享乐而欢喜，也不会因为众生造恶业，下三恶道而受苦，从而生起苦受。异熟识无有任何的觉受，不管众生造作什么样的业行，受到什么样的果报，祂都无喜无忧，完全是舍受。</p><p>众生造善，异熟识随善缘，众生造恶，异熟识随恶缘，祂都无所谓。善与恶与祂全然无关，祂全部随顺，因此完全是舍受。但是众生的苦乐二种感受，都是异熟果报，由异熟识而出生。虽然苦乐二受，由异熟识而生，但不是真正的异熟识的觉受。</p><p>因为这二种受，要有相应的业缘，要有现时的正报和依报——六尘境界，才能有苦乐二受的产生，这是六识所具有的觉受。异熟识没有，异熟识与此二种觉受不相应，因为异熟识不对应六尘境界，与众生的正报和依报环境都没有关系。祂不受任何果报，也不感受任何境界，因此没有任何心境，没有任何觉受。</p><p> 原文：<strong>又由此识常无转变。有情恒执为自内我。若与苦乐二受相应。便有转变。宁执为我。故此但与舍受相应。若尔。如何此识亦是恶业异熟。既许善业能招舍受。此亦应然舍受不违苦乐品故。如无记法。善恶俱招。</strong></p><p>释：又因为这个异熟识体性常恒不变，有情众生无始劫以来，一直都在执著第八识为自己，把第八识所有的功能体性，都据为己有，认为是意根自己做得了那些所有的事业，都是自己所为。</p><p>异熟识如果与苦受相应，祂就不会让众生去三恶道受苦，祂也不会随着众生的七识去三恶道。异熟识如果与乐受相应，祂就会众生永远活在天上，不要死去。众生造恶业时，异熟识就不会记录收存，然后又输出恶业种，祂就不作这件事，就会有所选择了。那这样，异熟识的体性就会转变了，不是原来的那个清静的心体了。</p><p>众生造恶业时，异熟识也不会随顺过去，不会输出种子，这样众生的恶业也就不能造作了。因此，变来变去的异熟识，就不是恒常不变的了，意根也就没必要再执著祂为自己了。就像意根一旦知道五阴是生灭变异的，是无常的，是虚妄无我的，那么意根就不会再执著五阴为自己，二者是一样的道理。因此异熟识，只与舍受相应。</p><p>如果是这样，异熟识只与舍受相应，为什么这个异熟识也能让恶业异时异地异类而成熟呢？答：既然允许众生受善业果报时，异熟识也是舍受，那么众生受恶业的恶报时，异熟识也应该是舍受。异熟识的舍受，永远不会违背和影响众生七识的苦乐受，二者不互相违逆，不互相冲突。比如，众生受不善不恶的无记果报时，异熟识是舍受，那么众生受善报和恶报时，异熟识仍然是舍受。</p><p> 原文：<strong>如何此识。非别境等。心所相应。互相违故。谓欲希望。所乐事转。此识任运。无所希望。胜解印持。决定事转。此识瞢昧。无所印持。念唯明记。曾习事转。此识昧劣。不能明记。定能令心。专注一境。此识任运。刹那别缘。慧唯简择。德等事转。此识微昧。不能简择。故此不与。别境相应。此识唯是。异熟性故。善染污等。亦不相应。恶作等四。无记性者。有间断故。定非异熟。</strong></p><p>释：这个部份还是讲阿赖耶识的心所法。“如何此识。非别境等。心所相应。”这句话是讲，为什么第八识不是与五别境等心所法相应，就是说祂为什么不与五别境心所法相应，祂为什么没有五别境心所法。什么叫五别境心所法呢？五别境心所法就是：欲、胜解、念、定、慧五个心所法。</p><p>别境的意思是说，这五个心所法不是时时处处都能现行出来，是在个别情况下才能现行运作的，有很多时候是不现行出来的，所以才叫做别境。不像五遍行心所法必须是伴随着八个识从始至终在运行不断的，五别境很多时候是断而不能现行出来的，是不能普遍存在于一切时一切法的。</p><p>为什么第八识不是与五别境等心所法相应呢？《成唯识论》里讲是：“互相违故。”什么叫互相违故呢？意思就是说第八识的行相与五别境心所法的行相互相违背，二者的行相具体分述如下。</p><p>欲心所，就是希望所乐事转。这包括两方面含义，一方面的意思是说，现在心里所没有的，还没有达到的那个境界，没有拥有的境界，心里是想要拥有，希望能够实现心愿，达到那个目标和心愿。欲就是想、要、希望、计划、打算，这就是欲。有所希望、有所希乐、有所要求、有所乞盼，这叫欲。希望现前还没有的、不存在的人、事、物、理能够得到，希望能够拥有，希望能够实现，这是欲的一个方面的内容。</p><p>欲的另一个方面的意思就是说，现在有的人、事、物、理，希望能够消失，不再存在，希望能够远离，希望能够舍弃，目前所拥有的境界，与我们的心相违背，不希望再继续存在，可是却存在着，与己不相舍离。欲就是想把这个境界给舍弃掉、丢弃掉、抛弃掉、离开、转离，这是欲的两方面内涵。</p><p>欲是谁拥有的呢，谁有这个欲心所呢？欲是六识心所拥有的，当六识现行出来的时候，有时就有欲心所的伴随。六识心打算拥有一些境界，希望拥有一些境界，想要离开一些境界，这些都是属于欲的方面，叫欲心所。有所希望、有所希乐、有所稀求、有所盼望，有所愿望，这都是六识心所具有的欲心所。但是欲心所，不是常常出现的，是偶尔出现的，否则众生的心里欲望就太炽盛了，苦恼就太多了，尤其是众生福薄，欲望根本就不容易得以实现。</p><p>那么第八识有没有欲心所呢？我们知道第八识的体性，没有欲望，祂不做主宰，没有希望、没有欲求、没有期盼。祂对一切法都是任运而行的，任运而行也叫做法尔如是，祂只是这样的一个运行程序，祂的运作就是如此的。而祂也不对应于六尘境界，不了知六尘境界，因此祂也不会对六尘境界有欲求和贪求。</p><p>第八识对于一切法都没有欲求、没有要求、没有所求、没有希望、没有打算、没有愿望，这是第八识的行相。尤其是对于六尘境界，第八识是不对应六尘境界的，因此祂肯定是不希望六尘境界如何又如何的，所以说祂没有希求、没有欲望、没有期盼，也没有打算，没有任何一点点的愿望。</p><p>那六识心想要成佛，第八识有没有这个愿望呢？这件事跟第八识没有关系，祂与此法不相应，祂没有这方面的心行和愿望，对成佛之事，祂就没有希求和愿望，祂也不会去学佛，祂也不会去受戒、持戒、守戒，祂也不学任何一种法。相反六识心就想要出离生死苦，想要尽快成佛，而六识学这些佛法，都得依靠着第八识才能修学。第八识在一切法上的运作，都是任运而行，随着业种，随着因缘，随着意根，法尔如是地就运行出来了，祂的行相就是如此，祂的体性功能就是如此，祂的运行程序也就是如此。</p><p>阿赖耶识从来都是按照一定的程序来运行着，祂没有自已的希望、打算，欲求，都没有，对于一切法祂都无所希求，祂不会说：“我要变生出一个身体，属于我拥有；我不变生这样的身体，而要变生那样的身体；我要变生这样的宇宙器世间，不变生那样的宇宙器世间。”祂都没有这样的心行，没有这些打算，没有这样的意愿，祂什么心行都没有。</p><p>祂只是法尔如是的如此运作，作意于种子，输出种子，实现业果，把种子输送出去以后，就产生了万法，按照某一个缘，某个业缘，来变生某一法，配合七识的一切活动。所以第八识阿赖耶识没有欲心所，没有欲望和希求。</p><p>五别境心所法的第二个是胜解，什么叫胜解呢？《成唯识论》里说：“胜解印持。决定事转。”印持就是把某一件事情某一法，印下来，有了烙印，并且受持了，就是说对这件事已经得到一定程度的理解了，并且能够受持和运行运用。决定事转，就是理解知道了到某件事情某一法就是如何的，心里已经很坚定，不再怀疑了。</p><p>比如说看见一朵花，眼识和意识两个识心都了知清楚了，于是就取了花儿的相，心里印持下来了花儿的相，并且心得决定，这就是某某花儿。了解了花儿的相貌特征，根据花的外表，花的显色，花的颜色，花的形状，花的表色，花的无表色，就知道了这是花，并且知道了具体是什么花，花的品种等等内涵就都知道了。这样就把整朵花印持于心，内心决定了，这就是某某花儿。</p><p>那么看见一个人呢，六识心也印持下来了，这个是人，多大年纪，是男人还是女人，形态是怎么样，气质如何，学问修养如何，外貌是如何，品行是如何，对他的言行举止，就能够胜解了，那么就了解了、明白了，看清楚了，心得决定，内心没有疑惑了，这就叫作胜解。决定了、肯定了就是这么回事，就是某种法，就是这个样子，这叫作胜解。</p><p>阿赖耶识有没有这种胜解心所呢？《成唯识论》说：“此识瞢昧。无所印持。”什么叫瞢昧呢？意思是其心昧劣无知，不能作于了别，这是指阿赖耶识不了别六尘境界，不知六尘境界的体性。所谓的瞢昧就是不懂，禅宗里叫作不会，不会六入故，祂对于六尘境界不会，不明白。因为祂不对应于六尘境界，六尘境界是六识所对应的，六识所了别的。阿赖耶识，不对六尘，不识六尘，不会六尘，不会六入。</p><p>“此识瞢昧。无所印持。”对这一切法，阿赖耶识都没有胜解。当我们遇见一个人，六识对这个人进行评判，进行胜解，进行印持的时候，内心就有一个决定性的概念，这个人是什么样的人。但是阿赖耶识看不见这个人，也听不到这个人的声音，和这个人有关的所有信息，第八识都不了别，都不相应，因此对这个人，阿赖耶识祂就没有胜解，不知道这是个人，是什么人当然祂就更不知道了，什么年龄、气质、相貌、品行，祂都不了解，都不知道，这叫瞢昧。</p><p>无所印持，因此阿赖耶识就不能印持，不能决定，不能胜解，当然也没有名言和思维了。对于一切境界，外边的山河大地，花草树木、宇宙器间，所有的风声鸟声，香尘气味，祂都没有胜解力，祂都不对应。既使祂能够变造出众生的五阴身，对于五阴身祂也没有胜解，祂不会说这是人的身体，该给祂造什么样子的，祂没有这样的概念。</p><p>虽然祂能变造出万法来，万法都是祂变造的，但是变造出来以后，祂也不了别，正在变的时候，祂也不知道变的究竟是什么，祂只是根据业种输出种子，任运而行，其结果是什么，祂就管不了了。祂只是按照一定的程序，一定的流程来运行，就像公式一样，完全是公式化的。祂就那样在每个刹那每个刹那地，每日、每月、每年都是这样，按照公式、按照程序地运转着，同时变造出一切法出来。但是祂也不知道变造的究竟是什么，祂没有一切法的概念，祂没有胜解心所。</p><p>五别境的第三个心所法是念心所，念在《成唯识论》里的定义是：“念唯明记。曾习事转。”什么叫明记呢？就是很清楚、很明白的把这件事记下来了，心里记住了；“曾习事转”曾是曾经，已经过去了，比如我现在正说话，下一秒钟，话说完了以后就过去了，这句话现在不存在了，就叫作曾，只要是过去了，就叫作曾；习，就是行和作，心里对于所作过的事情，所经历的一切人事物理，都能够明明白白的记住和收存，还能想起和忆念，这就叫作念。</p><p>这个念心所是谁拥有的呢？谁有念心所法呢？那是意识所具有的，意识心的念心所相当的强，祂接触什么法，就能记住什么法，过后就能回忆出来，而且能时常念着、想着、忆持着，这就叫记忆。意识有记忆的功能，为什么有记忆的功能呢？因为有胜解，意识能明了一切法，了别一切法，分别一切法，然后就忆持不忘。</p><p>意识有了胜解之后，祂才能记住，接触了一个人，祂就能记住这个人；了别了一种花，祂就能记住这种花，能记得自己看过什么花，在什么时间，什么地点，是什么样的一个情景，花的状态是什么。意识胜解了之后，祂就能记住了。越胜解，胜解力越强，记忆就越牢。胜解力弱的时候，比如接触到一种花，他心里没有概念，过后就可能怎么想也想不明白，祂记忆的就弱，或者没有记忆。</p><p>比如一个畜生，对于人类的事情，没有胜解，牠就不会对人类的事情有记忆。比如一只狗就喜欢大粪，可是主人告诉牠，那东西很脏不可以吃，牠对于脏的概念内涵不懂，没有胜解，就可能还会想方设法地去吃大粪，牠对此事没有记性。比如小孩子，他的胜解力差，记忆力就弱，做过的事情，经历过的人事物，就记不太清楚，记忆力就弱。长大以后，再回忆小时候一岁、两岁、三岁那时候的事情，很多事情就回忆不出来了。</p><p>为什么呢？因为小孩那个时候，对一切事物都不熟悉，他没有接触过多少人事物，不知道那么多的名词概念，他的胜解力就弱，胜解力弱，记忆就不牢固。他就回忆不了太小时候的事情，想不起来那时候的事情了。小孩很少回忆，老年人越老越爱回忆，这一辈子的事，每年每月经历的事他都要回忆。所以说有了胜解的心所法，就有念心所法。他能够很明白很清楚的把所经历的人事物，都记住了。所以看一篇文章，越理解越容易记住，越容易背诵出来，不能理解就会死记硬背，很是苦恼。</p><p>阿赖耶识有没有念心所呢？刚才讲了，阿赖耶识因为祂没有胜解力，一切的六尘境界祂都不相应，祂都不对应，那就没有胜解，祂不明了六尘，不明白六尘，因此祂也不能记忆发生的事情。六识所经历的一切人事物理，祂都不知道，不明了，因此祂就没有记忆，不会回忆，不会回想，虽然祂能把六识经历过的事情，作为业种收存起来，但不是祂本身直接记忆和想念的，所以阿赖耶识没有念心所。</p><p>“此识昧劣。不能明记。”因为祂对于六尘境界的智慧力非常低劣，分别不了六尘，也就不明了六尘，因此就没有记忆，不会记住六尘，那就不能回忆六尘了。阿赖耶识根本就不能了别六尘，祂就没有记忆了，就像一朵花儿在目前，祂根本看不见，不知道有花儿的存在，祂当然就不能记得住花儿了，也就不能念着花儿了。</p><p>一个人在面前，祂看不见，祂怎么能记住这个人呢？怎么能心里念着这个人呢？外面的风声、鸟声祂听不见，就不知道有风声和鸟声，祂怎么能记得住风声鸟声并且心里念着呢？祂内心里连这些风声、鸟声的概念都没有，虽然这些风声鸟声都是由祂所产生出来的，变现出来的，但是祂没有这些概念，因此祂也不能明了风声和鸟声，祂也不会记住这些声音，也就不能忆念这些声音了，因此阿赖耶识就没有念心所。</p><p>第四个心所法是定心所，什么叫作定呢？《成唯识论》里说：“定能令心专注一境。”意思就是说能把心念专注在一个境界上，叫作定，心定在一个境界上不动摇，一直是缘在一个境界上，没有第二、第三、第四个境界，也许住在第二个境界比较轻微，没有多少感知，但还是以一个境界为主。心定在一个境界上，专注于一个境界上，专是专门，注是倾注，把整个心识专门倾注在一个境界上，就叫作定。</p><p>是谁有定呢？六识心都可以有定，能把心念力、注意力、精力，全部集中在一个境界上，来作分别和了别。这得要通过训练注意力才能集中，有的人不用通过特殊专门的训练就能有定，那是前世修行的善根。有时候有的人觉得某件事非常重要，这个人要想考虑别的事情就考虑不了了，因为这件事太重要了，他不得不把心思定在这一个境界上，来专注地了别和思虑，根本不能放舍。</p><p>比如有些神经方面有疾病的人，对于某些事特别执拗，心心念念都是这一件事，根本就分散不了注意力，那么为了对治他这种病症，就要想办法分散他的注意力，把他的注意力引导到其它方面去，让他对其它的事情感兴趣，把他的注意力分散，他的精神状态就能正常一些了。</p><p>所以定心所就是心的专注力，是六识所具有的功能体性。定主要是以意识心为主的定，五识也有定，也能专注不散乱，六识都能够专注在一个境界上不散乱。禅定如果是修好了，心就越来越细致，能引发智慧的生起，而同时色身的觉受就很舒适，身心就会顺畅愉悦。</p><p>第七识有没有定心所呢？没有得到甚深禅定的人，没有转识成智的人，第七识没有定心所，因为第七识肯定要缘于所有的六尘境界，除了六尘之外的法尘，祂也能缘到，第八识变什么，第七识就缘什么，祂攀缘的范围比较多，祂就定不下来，不可能专注于一境。但是通过修定，也可以训练第七识减少攀缘，减少执著，让祂不到处攀缘。祂如果不到处攀缘，只缘很少的法尘上，六识心就能定在一处，不散乱了。菩萨们修到一定程度，到地上菩萨的时候，第七识意根可能就会有定心所，佛地的第七识是完全与定相应，有定心所，有五别境心所。</p><p>阿赖耶识没有定心所，《成唯识论》说：“此识任运，刹那别缘。”此识就是阿赖耶识，任运就是自然而然的随着因缘而运行着，祂没有自己任何一个心念、心行、打算、意见和想法，祂不做主宰，只是按照某种机制，按照固定的律则自然而然的运行着，法尔如是的这么运行着。此识任运，刹那别缘，祂刹那刹那地随缘到处缘于其他法，不能定在一处。如果祂定在一处，那么其他的法，就不能现起，不能执持了。</p><p>阿赖耶识有几个遍：祂遍一切处，遍一切时，遍一切法，遍一切界，遍一切地。如果让阿赖耶识定在一个境界上，那么其他境界，祂就不能去执持和变现，其它境界怎么办呢？那就会消失了。如果哪个境界阿赖耶识不缘过去、不去维持的话，祂不去出生的话，那个境界就会消失。所以说，六尘境界任何一个法，都有阿赖耶识在执持着，那些法才能存在和运行，一旦阿赖耶识不管了，离弃了，那些境界全部都会消失，所以阿赖耶识没有定心所，不能定于一处。</p><p>比如说阿赖耶识在给我们变色相，缘于色尘上，阿赖耶识如果只集中在一个色相上，不缘其他法，那么声音怎么办呢？祂就不能变现声音，那么我们就听不见声音了。祂不给变现的法就不能出生，即使出生了，也会消失不存在了，那我们六识该如何存在和运行呢？六识就没有办法运行，就不能了别六尘境界了。所以阿赖耶识不可能只专注于一个境界上，祂必须是同时缘于十八界，每一个界都有祂的存在，十二处上每一处都有祂的存在。而且世间任何一个法上都有祂的存在，祂都得缘过去。</p><p>比如说我们眼看色，能看十种色，面前十种色，二十种色，一百种色，这一百种色都得有阿赖耶识的运作维护，否则那些色就不能存在，我们就看不见了。阿赖耶识既然遍一切法，每一个法上都应该有阿赖耶识的运行。色有十种、二十种、三十种、一百种，我们听的声音，周围一切的声音不知道多少种了，周围的气味也不知道有多少种了，我们身上的触尘更多，也不知道有多少种的触尘。</p><p>这些法每一个法上都有阿赖耶识，祂都在维持着，执持着，这样每一个法才能正常的存在，才能够运行，我们才能够了别到，才能过正常的生活。所以不可能让阿赖耶识专注于一个境界上，否则祂就不是遍一切处，遍一切时，遍一切界，遍五蕴，遍一切法上了，因此第八识没有定心所。</p><p>五别境心所法最后一个是慧心所，这个慧心所我们理解为有智慧性，因为有智慧，所以就能够作一切的拣择、权衡与取舍。所谓的拣择，就是能够分别、辨别、挑选，知道和明白此人事物理是好还是不好，彼人事物理是对还是错，如何做才有利无弊，都能够分别得出来，也能够判断得出来。有智慧才能作这样的分别判断，没有智慧就不能够分别、判断、抉择和拣择。</p><p>比如说看色时，能作拣择，那种色比较好，比较可心，就分别出来了，然后就对色进行取舍。慧再深些，还能把这些色再作微细分别，分析判断色的来源，色的本质，色的组成材料，色的组合，色的加工制造，这些都能知道，这就是慧，因此才能有拣择取舍性，认为这个事物好，那个事物不好；这个人好，那个人不好；这个理对，那个理不对；对一切法都有一定的思维、分析、判断和拣择性，这就叫作慧。</p><p>德，就是德能和功用，有慧就有德；没有慧，心比较劣弱，就没有德。智慧劣就愚痴，愚痴就不叫慧，那就没有拣择性了。愚痴人他就什么也不能分辩出来，好坏，大小，高低，上下，都分别不清楚，那么他就没法作正确的拣择，也没法正常的生存。有慧心所法，就具有一定的拣择性，能够分别判断出是非、善恶、对错、高低、大小等等一切法。</p><p>六识肯定有慧心所了，因为六识能够分别、辨别，能够拣择，意识心还能够作分析、判断、想象、思维、观行等种种心理活动。六识知道六尘的善恶、是非、对错、好坏，那么慧心所就以第六识为主。第六识的智慧，会不断地发生增减变化，有时慧强，有时慧劣，这也与业缘有关系。尤其是我们学大乘佛法的人，懂得和证得如来藏法以后，第六识的智慧就能越来越广大，越来越深细，直到转识成智，再具有唯识种智，最终就能具足究竟无上的甚深智慧，天上天下无与伦比。</p><p>当然学小乘解脱法也有小乘解脱法的智慧，会生出苦集灭道智，生出无生智和尽智，对解脱之法就有一定的抉择力，会知道这个法能修到什么程度，那个法能修到什么程度，这个法是正确的，那个法是不正确的。有智慧产生以后，就能够有一定的抉择力了。那么修学大乘法，意识心就更有智慧了，涉及到的佛法的范围更广泛和更甚深。</p><p>明心见性以后，对于阿赖耶识就有进一步的理解力和胜解力，对于一切法有很强的拣择力。知道此法能让人明心见性，彼法不能让人明心见性，知道此法是讲第八识体性的，彼法是讲世俗法的虚妄性的。意识都能够有一定的分别力、辨别力与拣择力，对于善恶、是非以及各种义理认知程度、深广度的拣择、判断力，就是慧心所法的德用。</p><p>六识有慧心所法，第七识也有慧心所法，只是第七识的慧比较劣弱，分别力不强，因为祂所缘太广泛了，没有定，心就不能定在一处，因此祂的分别慧就微弱，不能具体分别出六尘境界是什么，第八识所出生的法尘究竟是什么。</p><p>那么阿赖耶识有没有慧心所呢？《成唯识论》说：“此识微昧，不能简择。”这里的昧，就是瞢昧、昧劣、昧略，阿赖耶识也有很重的瞢昧性，对六尘境界不清楚，不明白，分别不了，也拣择不了，就是因为祂心的昧劣性。微昧，是说在对六尘的分别性上，阿赖耶识就没有智慧、没有抉择力了，祂不能作六尘上的拣择，不知道六尘境界的好坏、是非和善恶，对这些法不具备抉择性，因此祂就不能只助七识作善而不助七识造恶。</p><p>虽然阿赖耶识没有慧心所，祂不能分别六尘的是非、善恶、好丑、大小等等，但是阿赖耶识真正是有大智慧的，祂的智慧太广大了，三界世间、十方世界祂都能够运作变现出来，其智慧无与匹敌。但是为什么祂却没有慧心所呢？前面已经说了，第一，祂不对应六尘，第二，祂对六尘既没有胜解，没有欲，也没有念，也没有定，当然祂就没有慧了。因为祂不对六尘境界，祂怎么能拣择六尘呢？祂就拣择不了，也就不能分别是非、善恶、大小了，这些都属于六尘境界里的法，对此祂就没有拣择力。</p><p>比如说阿赖耶识能够缘业种，缘业种以后，就能依据业种变造宇宙、根身、器界，这是祂的大智慧性的体现，但是在这些方面祂也没有什么拣择，不会说我要变造这样的宇宙器世间和众生的身根，不造那样的宇宙器世间和众生的身根；祂不会说这是好的，那是不好的，祂都没有拣择性。祂只是根据种业任运的来创造一切法，创造五阴身，祂都不会做任何的选择。但对于六尘境界，什么色声香味触法，是非好坏美丑善恶，祂都没有拣择力，祂不能了别，不能分析，也就判断不了，因此阿赖耶识就没有慧心所。</p><p>五别境心所法就讲解到此，以上解释了阿赖耶识不与五别境心所法相应的原因，表明祂不与欲心所法相应，祂没有欲；不与胜解心所法相应，对六尘境界祂不能胜解不能了解；祂不与念心所法相应，祂没有记忆，不能忆念；祂没有定心所，不能专注在一个境界上；祂没有慧心所，没有拣择性，不能作选择。我们的六识心常常要作拣择，这个法是什么样的，那个法是什么样的，这个法是对还是错的，是深的还是浅的，是广还是狭，第六识常常就作这些拣择。然后还作这样的抉择，我要学这个，不学那个，我要修这个法，不修那个法，因为祂有拣择力嘛。</p><p>所以说学佛人修到一定的程度，他就有拣择慧，有了择法眼，知道这个法对，那个法不对，我应该修这个法，不应该修那个法，这时就说明他已经有了择法眼，有了一定的抉择力了。没有修到一定程度时，就没有择法眼，也就没有佛法修学上的智慧，他就辨别不了什么法是正，什么法是不正；他就选择不了究竟应该学什么，不应该学什么，他就只能随缘了，遇到什么法就学什么法，不管是对还是错，他就会随着学过去了。所以众生还没有修到有智慧有抉择力的时候，也就没法作拣择，只能随顺着因缘和业力而修学佛法。</p><p>八识心王的五十一个心所法当中，除了五遍行和五别境心所法，还有十一个善心所法，就是信、精进、惭、愧、无贪、无瞋、无痴、轻安、不放逸、行舍、不害，这是十一个善心所法。还有二十六个烦恼心所法，这就多了，包括根本烦恼六：贪、瞋、痴、慢、疑、恶见；随烦恼二十：忿、恨、覆、恼、嫉、悭、诳、谄、害、憍、无惭、无愧、掉举、惛沉、不信、懈怠、放逸、失念、散乱、不正知。还有四个不一定是善，也不一定是恶，有时属于善，有时属于恶的心所法，就是悔、眠、寻、伺。</p><p>阿赖耶识都不与这些心所法相应，意思就是说，阿赖耶识没有善心所，祂不造善，阿赖耶识也没有染污心所，祂不造恶，因此祂就没有十一个善心所，没有二十六个烦恼心所，祂不会现起烦恼，也不受的染污。阿赖耶识也没有善恶不定的四个心所法，祂没有悔、没有睡眠、没有寻、没有伺。这些心所法都与阿赖耶识不相应，阿赖耶识没有这些心所法，只有五个遍行心所法。刚才已经说了没有五别境，现在再补充说明祂也没有善十一心所法，没有烦恼心所法，没有不定心所法，只有五遍行心所法。</p><p>阿赖耶识没有善恶性，祂既不造善，也不造恶，祂就没有善染等这些心所法。为什么没有呢？《成唯识论》说：“此识唯是异熟性故。”第八识只是异熟性，成熟善恶业种，实现善恶业报，让众生相续不断，果报不坏失。那么祂本身就不能有其他心所法，就不能有善恶性，否则就不能受善染法所熏习，不能实现善恶业报。</p><p>阿赖耶识的体性，唯是异熟性故。什么叫异熟性呢？就是说第八识祂能够让众生的业种，异时、异地、异类而现行，异时、异地、异类而成熟。意思就是说，众生的七识造作业行，阿赖耶识就刹那刹那收存种子，记录业行，因缘成熟时，就要输出业种，实现众生业因果报。所以说阿赖耶识不间断，如果祂一间断，那么六识造作的业行，祂就不能作记录，不能收存业种了；祂不收存业种，将来这个果报就要成问题，众生造业就没有果报了。再者说，祂如果间断了，众生也就不能存在了，一切法也都会消失不见了。</p><p>因为阿赖耶识是不间断的，祂就能把众生一切的身口意行，都能够记录下来，收存种子。收存种子以后，祂能让这些种子异时而熟，异类而熟，异地而熟，让这些种子在另一个时间，另一个地点，另一类果报身上，来实现业因果报，这叫异熟性。祂能够让众生所造的业种，异时而熟，异时而生，让众生的果报异时、异类、异地而实现，这就是异熟性。</p><p>所以阿赖耶识的心所法，只有五遍行心所法，没有五别境心所法，也没有善的心所法，没有恶的心所法。就是说阿赖耶识既不造善，也不造恶，但是祂也不造作世俗法里的无记业，比如吃饭、穿衣、走路、开车等等这些无记业行。总之，五十一个心所法都与第六识相应，有一部分与前五识相应，而不与阿赖耶识相应，阿赖耶识只有五遍行心所法。</p><p>六七识和前五识的心所法，在修行的过程当中，修到一定程度就能转变了。修到声闻三果时，心所法当中的贪爱和嗔恚等烦恼心所法就消失不见了，修到四果时我慢等烦恼心所法也消失不见了；修到初地菩萨时，六七识初步转识成智，心所法就会有明显的变化，其中意根的我见、我痴、我慢、我贪，这四种心所法就没有了，意根由原来的十八个心所法，减少好多个，善心所法会增加，当然意根虽然与善心所法相应了，但是还不够究竟，还有待于进一步增强善性。</p><p>而意根的慧心所法也要增强增大，因为祂也在逐渐与定心所法相应；又因为意根初步达到无漏，初步转识成智了，祂对一些法就有了一定的胜解力，也有了念力，只是还不够完善，不够究竟彻底而已，包括祂也会有一定的欲心所，只是没有意识心的欲心所明显和强烈而已。这些内容很深细，地前菩萨很难观察到，因为心中还有漏，无明还重，意识和意根还没有转识成智之故。</p><p>意识以及五识的烦恼心所法也减少了好多，其中六根本烦恼中贪、嗔、慢、疑、恶见断了，没有了，只剩下一丝无明烦恼故意保留着，没有断，为了留惑润生之故。当然意识对于如来藏法还有法爱法贪没有断，对如来藏法的疑没有断尽，还有无始无明的上烦恼没有断；而意识心的二十个随烦恼都断了，没有了；意识心的不定心所法就转变成善的心所法，没有恶性的了，当然转变还不究竟不彻底。</p><p>成唯识论第五卷中说，已转依位，意根心所法与二十一心所法相应。初地菩萨转识成智以后，意根的心所法就与五别境心所法有些相应了，也与善十一心所法相应，只是相应的程度还不够彻底不够圆满，但是心所法肯定是改变了。所以如果要讲心所法，就要说明是众生什么修行阶位的心所法，是凡夫众生的心所法，还是三果以上圣人的心所法，还是地上菩萨的心所法，还是佛的心所法，还是第八识的心所法，还是无垢识的心所法，这些都要标明，那么学人心里就能清楚了知了。</p><p>不是所有众生的心所法都是相同的，因为众生的烦恼大不相同，智慧性也大不相同，心所法就会有差别。地上菩萨已经断了烦恼的现行，烦恼心所法也就不再现行出来了，而且六七识已经初步转识成智，心所法肯定是要发生转变的。</p><p>心所是识的助伴，是伴随于识而现行运作的，就比如是识的拄杖一样，识必须依靠着心所才能运行起作用，也就像是腿瘸的人，必须要依靠着拐杖才能行走。而心所法根本没有种子，只要某个识一现前，这个识就以心所法的形式来运行，识都是以心所法的形式来运行的。弥勒菩萨瑜伽师地论里说，心所法是伴随着识而运行的，是识的助伴。心所是没有种子的，只是伴随识出现的现行法，第八识里不存心所法的种子，其祂几个识也不存着心所法的种子。</p><p>意根和第八识所对应的不一定是六尘境界，但是这两个识只要现行运行，就有心所法的运行。意根有烦恼心所法的时候，意根的五遍行心所法在现行的同时，烦恼心所法有时也会同时现行运作，好几个心所法都会同时现行运作。</p><p> 原文：<strong>法有四种。谓善不善。有覆无记。无覆无记。阿赖耶识。何法摄耶。此识唯是。无覆无记。异熟性故。</strong></p><p>释：法有四种，这个法是指什么法呢？这个法是指八个识所造作出来的法，八个识所共同运行出来的法。这些法可以分为四种，第一种是善法，第二种是不善法，第三种是有覆无记的法，第四种是无覆无记的法。</p><p>覆就是染污、覆盖、遮障的意思，因为有染污，就能覆障真性，覆障真心，那么这种法就有覆障、有染污、有遮障，能遮蔽真性、遮蔽善法，这就叫覆。第三种法叫作有覆无记的法，记是指善恶性，无记就是不善不恶性的法。第四种法是无覆无记性的，就是说造作出来的法，没有染污，既没有善性，也没有恶性，是不善不恶、没有染污的无记性。</p><p>八个识所造作出来的四种法，就包括善、不善、有覆无记、无覆无记这四种。谁造作善法呢？善法和六识心相应，不善法也与六识相应，善不善法都和六识心相应，六识心有时候善，有时候就不善。有覆无记和第七识意根相应，凡夫的第七识意根有我贪、我慢、我爱、我痴，因为这些无明烦恼，祂就把阿赖耶识的功德性都执为自己的功德，这样能覆弊、障碍了阿赖耶识的真相，也障碍了自己得解脱，让自己长期处于生死轮回中，苦恼不断，所以叫作有覆。</p><p>那意根的无记性，是因为了别慧昧略，不能思索六识业行以及自己心行的善恶性，也不知道六尘境界是善是恶，以及结果是善是恶，第七识意根就不会说我要造善或者要造恶，因此意根不属于善，也不属于恶，祂的运行就是无关善恶的无记性。</p><p>但是在初地菩萨以上，意根的心所发生了改变，烦恼去除了，有覆性就会消除一部分；而且智慧力也比其他众生的意根增强了，尤其是知道了很多法都是第八识的功能体性，并不是自己的功能体性，其对法的执著性就减少了很多，因此就与善法相应一些，无记性就减少。到了佛地，意根就完全具有二十一心所法，与五别境和善完全相应。初地就相应一小部分，因为意根达到初步的无漏了，智慧力就增强，这时候就叫做智识。</p><p>无覆无记性，是指阿赖耶识心体所具有的体性。阿赖耶识是本来就解脱的心，因为祂没有无明和烦恼，也就不会去执著任何一种法，没有人我执，也没有法我执，那就不能遮障自体的真实性，不能遮障其他心体获得解脱，自身也不会迷惑颠倒，因此，祂是无有覆藏的心体。</p><p>祂从来不会起心动念去造作善恶业行，也不在六尘境界里造作业行，不分别和拣择六识所造作的是善业还是恶业，祂自身没有染污的心行，没有贪嗔痴烦恼，没有我见、我慢、我爱、我痴，祂也没有善心所，因此祂的心行是无记性的，无关乎善恶性，也就是无覆无记性的。阿赖耶识属于异熟性，能让众生的业行，异时、异地、异类而成熟，成熟以后众生就受果报。</p><p> 原文：<strong>异熟若是。善染污者。流转还灭。应不得成。</strong></p><p>释：异熟若是善性的，或者是染污性的，众生的生死流转或者是要灭除生死流转，证得解脱，就不可能了。异熟识的异熟性如果是善法，或者是染污法，那么众生就不可能出现流转六道的现象，也就不可能有六道的生死轮回了，同样众生也不可能通过修行灭除六道生死轮回苦。</p><p>为什么这样说呢？比如说异熟识的异熟性是善性的，第八识就只能配合七识造作善业，并且只记录和收存七识造作的善业，未来也只能输出善业业种，使得众生只受善业果报，那么众生就不能在三恶道里生死流转了，六道轮回的生死果报就不能具足现行了。</p><p>如果异熟识是善性的，前七识造作恶业的时候，祂就不能配合七识去造作恶业，比如杀人放火、诽谤三宝这些恶业，祂就不会配合去造作；另外即使配合造作了，七识造作了这些染污的恶业行，因为异熟识是善性的，祂就不可能记录和收存恶业种，不可能把恶业种子收存下来，让恶业熏染自己，那么将来就不能实现恶业果报。</p><p>但是实际情况是，前七识不管是造作善业也好，造作恶业也好，还是造作不善不恶的业也好，阿赖耶识都不管这些，祂都要配合着造作，并且收存种子。收存种子以后，等到种子成熟的时候，祂就会输出业种，让七识受到应有的果报。</p><p>如果异熟识是善的，那祂就不可能输送众生恶业的种子让众生受恶报，多数的因缘果报就不可能实现了。即然众生有六道轮回的生死现象存在，有生死轮回苦，都是依据所造的善恶业来受果报，那么阿赖耶识就不应该是善性的，祂所配合造作的就不能都是善法。</p><p>再比如说阿赖耶识的异熟性如果是染污性的，祂就有染污心行，有贪嗔痴烦恼，祂就只能配合七识造作染污的恶业行，不能配合七识造作善业行。如果祂是染污性的，就不是善性的，那众生的七识想要造作善业的时候，祂就不会配合去造作，善业就不能成就了。</p><p>另外退一步说，即使祂配合七识造作善业了，祂也不会给收存这些善业种子，祂也不会输出这些善业的种子，那众生造作善业就不能得到善报，而且最主要是七识没有祂的配合，是不可能造善业的，那么众生就永远也不能去除染污烦恼，永远不能得解脱，生死流转就永远不能灭除了。</p><p>这样的话，异熟识如果不是属于善，就是属于恶的话，那么众生要造作善业或者是造作恶业，祂就不能配合造作，善恶业也就不能成就，也就不能收存善业或者是恶业的业种，善业或者是恶业就不能熏染阿赖耶识，那么众生的生死流转，或者是要灭除生死流转苦，就不可能了。</p><p>现见众生六道生死轮回的果报不断，生死流转不断，而且也有众生通过修善，在不断的去除染污烦恼，灭除了生死流转苦，那就说明阿赖耶识的异熟性不属于善的，也不属于染污的。祂本身没有染污性，也没有善性，而是随缘配合七识造作任何一种业行，那祂就是不善不恶的无记性。祂不属于善的，也不属于恶的，就能配合众生造作善、恶和不善不恶的业行，把众生的善业、恶业、不善不恶业，都能够记录、收存，将来输出就实现了众生的因缘果报。</p></div>"
},{
    "title": "成唯识论第三卷讲解（3）",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>成唯识论第三卷讲解（3）</strong></p><p>原文：<strong>又此识是。善染依故。若善染者。互相违故。应不与二。俱作所依。</strong></p><p>释：又因为阿赖耶识是善法所依止之识，也是染污法所依之识的缘故，才说阿赖耶识是无覆无记性的，祂不是善性也不是染污性。如果阿赖耶识是善性，那么善性与染污性相违背，就不能与染污业作为依止；如果阿赖耶识是染污性的，染污性与善性相违背，阿赖耶识就不能与善业作为依止，因此只要阿赖耶识是善和染污性的其中一种，就不能同时与善和染污作为依止，只能是让善和染污两种业之一来依止，两种业行不能同时依止于阿赖耶识而现行运作。</p><p>而事实上，阿赖耶识是善和染污两种业同时所依之识，这两种业都能依靠着阿赖耶识而运转，才能够造就业行出来，善恶之法才能产生出来。如果没有阿赖耶识作为所依，那么善法不能成就，恶法也不能成就，所以阿赖耶识是善恶法所依止的识，阿赖耶识就是无记性的。</p><p>若善染者，如果阿赖耶识是善的，或者是恶的，善和恶互相违背，那么阿赖耶识就不能与善法作依止，或者也不能与恶法作依止，祂就不是善法和染法同时所依止的识，不能为这两种法同时作依止，那么众生的善恶业就不能同时造作出来了，可是众生却不是造善业就是造恶业，根本不会只造其中一种业，那就说明阿赖耶识不是善性和恶性的，而是无记性的，才允许众生有时造善业，有时造恶业，阿赖耶识都会配合着造作出来。</p><p>如果说阿赖耶识是善性的，那么众生造作恶业的时候，祂就不能随顺众生，配合众生去造作恶业，恶业行就不能依止阿赖耶识而产生出来，那么阿赖耶识就不是恶法所依止的识体。可是恶业众生确实在造作恶法，恶法是怎么造作出来的呢？就是阿赖耶识配合着输送种子，并且自身的心所法也一起运行着造作出来的，那事实真相就是，阿赖耶识也是恶法恶业所依止的识体。所以说阿赖耶识不属于善法，不是善性的，而是无记性的，否则恶业行就造不出来了。</p><p>如果阿赖耶识是染污性的，那么众生造作善业的时候，祂就不会随顺着众生去造作善业了，众生的善业就不能够成就，可是众生却能够造作善业出来，那说明什么呢？说明阿赖耶识还是随顺着众生，输送种子，运用心所来配合造作善业，那么阿赖耶识就不是恶法染污性，不是染污性的，而是无记性的。</p><p>如果阿赖耶识是属于善法，或者说祂属于恶法，属于两者之一性质的，那么祂就不能够与善法或者恶法，都给作为依止，那就说明阿赖耶识属于不善不恶性的，祂是无记性。这样祂才能为众生的善恶业都作为依止，善恶业依止于这个识，众生才能够造作出来善和恶的业行。</p><p> 原文：<strong>又此识是。所熏性故。若善染者。如极香臭。应不受熏。无熏习故。染净因果。俱不成立。故此唯是。无覆无记。</strong></p><p>释：又因为阿赖耶识是能被善染业所熏习的缘故，所以祂是无记性的。此识是所熏性故，意思是说阿赖耶识能被七识业种所熏染，存善业，就被善业所熏染，就会输出善业种子，实现善的身口意行和果报；存恶业，就被恶业所熏染，就会输出恶业种子，实现染污的身口意行和恶业的果报。</p><p>而阿赖耶识的本体是清静无垢、常恒不变异的，可是祂要收存七识造作的业种，以实现众生的生死相续，那么收存了业种之后，业种就能熏染阿赖耶识，使得阿赖耶识具有了不垢不净的体性，就不是本体的清静无垢了，更有种子的无常变异性，就不是本体的常恒不变异了。</p><p>因为业种在其内要不断的生灭变异，那就使得阿赖耶识里所藏的善恶业不断地转变。什么叫所熏染呢？因为众生造作的业行不管是善的、恶的，还是无记性的，都会存到阿赖耶识里，存到阿赖耶识里以后，就使得阿赖耶识里的种子有善染性了，也就是本来清静的第八识含藏了染污生灭的业种，就使得阿赖耶识连同种子整体就成为不垢不净的心体了。</p><p>种子存进心体里去了，祂将来要再把种子输送出来，以配合众生造作善染业，这叫熏染。如果不存善种子，祂就不熏善法，那么将来也不会形成众生善业的身口意行和果报，众生的善业也不能成立；如果祂不收存恶业种子，祂就不熏习染法，未来也不会输出众生的恶业种子，来配合众生造作染污业，实现众生恶业果报。如果祂不受染污法所熏，那祂就不会收存和输出染污业种。那众生的染污业种就熏不到祂，将来祂就不会输送出众生的染污种子，不会配合众生造作染污业了。</p><p>可是祂确实是在随顺着众生，或者造善业，或者造恶业，两种业祂都随顺着造作。两种业的业种都存到祂的心体当中了。祂确实在受着两种业的熏染，将来就输送出善业或者恶业的业种，就配合着众生造作善业，也配合着众生造作恶业，所以祂不属于善性的，也不属于恶性的，只能说明祂属于不善不恶的无记这种性质。</p><p>如果阿赖耶识属于善法或者染污法的话，就好象祂是极香或者是极臭的，那性质就是固定不变的了，不会再受香臭所熏而发生改变。如果祂是善性，类似于极香之法，那么臭气来了，祂就不受臭气的熏染，祂永远是极香的，那么臭气就不能存到祂的心体里，将来祂也不会释放臭气的染污种子，众生不会受到臭的恶报，同理香气也熏染不到祂，祂就不会变得更香。</p><p>如果祂是染污性的，类似于极臭之法，那么香气来了，祂就不会存香气的种子，也不会受香气所熏，将来祂就不会输送出香气的种子，来受香的善报，同理臭气也熏染不到祂，不会使祂变得更臭，因为祂已经不能够再受熏染，已经达到极致了。</p><p>这就说明阿赖耶识不属于极香臭性质，同理，也就不属于善性的，也不属于染污性的，只能属于不善不恶的无记性。如果祂属于善性，或者是属于恶性，那么众生所造作的善行，或者是恶行，将来都不会有因缘果报，因缘果报都不成立，因为祂不受熏故。所以根据以上的这些立论，阿赖耶识唯是无覆无记性。阿赖耶识只能是无覆无记的，祂没有善性和染污性，不属于善性的，祂也不属于恶性的。</p><p> 原文：<strong>覆谓染法。障圣道故。又能蔽心。令不净故。此识非染。故名无覆。</strong></p><p>释：覆谓染法，染就是染污之法，所谓的染污，就是不清静，能遮蔽自心，不识真性，不见实相，因此能障碍圣道，不能取得圣果，那会永远处于轮回之中。</p><p>此识非染故名无覆。这个阿赖耶识没有染污，没有无明遮障，所以阿赖耶识是无覆的，祂不能覆障自己，不能覆蔽真性和真理，不能障碍自己显现出真性和实相，也不障碍祂的圣性，因此是无覆的。</p><p> 原文：<strong>记谓善恶。有爱非爱果。及殊胜自体。可记别故。此非善恶。故名无记。</strong></p><p>释：记谓善恶，有爱非爱果。记就是善恶性质的，不是善性，就是恶性的，属于两头，性质是特别的，不一般的，因此可以记别，明记下来，别是识别分别的意思，只有特殊而不一般的性质才容易辨别分别。如果识心是善性的，造了善业，就有可爱的异熟果报，善的果报是非常令人喜爱的，众生都喜欢善的殊胜果报，这叫可爱果。如果识心是恶性的，造作恶业，将来就有恶业的果报，是不可爱的异熟果报。记就是指两头，不是善就是恶，但会得到可爱和不可爱的果报。</p><p>这两种果报都是比较殊胜，能够明记的，善恶心所的性质也比较特殊，不一般，有殊胜的自体可以明记，不是中性的中庸之性，所以叫作有记性。所谓的一般，就是既不是善，也不是恶，很平常普通，不特殊。而阿赖耶识，不属于有记性，祂属于无记性。非善非恶性，因此祂没有可爱的异熟果报，也没有可令人生厌的异熟果报，因为祂没有殊胜的自体可记别。</p><p>比如说，阿赖耶识不是善性的，祂就不会造作善业，不会有善的可爱的异熟果报。阿赖耶识也不属于恶性的，祂不造作恶业，就没有恶的不可爱的异熟果报。但是众生造作善业的时候，祂会配合众生造作善业，那众生得到善的殊胜果报的时候，阿赖耶识也不受善的果报。</p><p>众生布施了恒河沙世界里的七宝，获得了无边殊胜极殊胜的善业的果报，那样大福德的果报，阿赖耶识都不会享受到一丝毫。因为祂没有造善之心，虽然祂配合着造善，却没有造善业的心行，祂只是随缘的、法尔如是的在配合运行着，并且按照因果律来输出业种，实现因果，所以祂不享受善的殊胜果报，只是众生的五蕴七识来享受这个大福德果报。</p><p>众生造恶业的时候，比如杀人放火，诽谤三宝，阿赖耶识因为没有恶心，祂不会主动有意地去造作这些恶行。但是众生造作这些恶行的时候，阿赖耶识就配合一起造作，虽然配合造作，祂也没有恶心，因此祂也不受恶的异熟果报，众生恶心造业，才有不可爱的异熟果报。祂配合造业，只是随缘，法尔如是地运作，只是按照某种运行机制来运行罢了，因此是无记的，没有异熟果报。</p><p>比如一个机器人，人为地给它设计了一个程序，它就按照程序或者造善业，或者造恶业。但是造了什么善恶业，跟这机器人没有关系，因为机器人没有心行，所以它没有善业和罪业，不受奖赏和惩罚，奖赏它，它也享受不到；惩罚它，比如司法机关要定罪，也不能定它罪，要定指挥机器人造善恶业的这个人的罪，或者是定为机器人设计程序的这个人的罪。指挥和设计的人会受到善的果报，或者会受到恶的果报，机器人本身不受果报。这个阿赖耶识就象机器人一样，按照固定的机制在运行，祂只是配合众生造作业行，本身并没有什么心行，都是众生有善恶心行的造作，那么果报就由众生来受。</p><p>综合以上的分析论证，说明阿赖耶识不属于善的，也不属于是恶的，祂属于非善非恶性的，所以叫作无记性的。前面又说祂是无覆，祂没有染污，祂又没有善性，又没有恶性，在这个四法当中，祂属于无覆，又无记性的。善法和不善法属于六识心所具有的心行，而有覆无记性的法，是意根第七识的心行，那么八个识所造作出来的法，就分为这四种，阿赖耶识属于无覆又无记性的。</p><p> 原文：<strong>触等亦如是者。谓如阿赖耶识。唯是无覆无记性摄。触作意受想思亦尔。诸相应法。必同性故。</strong></p><p>释：上一段是讲阿赖耶识的无覆无记性，这一段开始讲阿赖耶识的五遍行心所法，主要是破斥一种对于五遍行心所法认知的邪见。有人说，既然阿赖耶识是无覆无记性的，那么阿赖耶识的五遍行心所法，比如触、作意、受、想、思，也应该随着阿赖耶识是无覆无记性，这一段内容都是破斥这种邪见的。</p><p>这种邪见认为，诸相应法必同性故。什么叫相应法呢？就是说这些心所法，是与八个识是相应的，与识心相应的法叫相应行法，与识心不相应的，叫作心不相应行法。与八个识相应的法总共有五十一种，叫做五十一心所法；还有与八个识不相应的法，是二十四种不相应行法，有些法与八个识相应，有些法与八个识不相应。</p><p>与阿赖耶识相应的心所法有五种，叫五遍行心所法，那就是说，只要阿赖耶识存在，那么五遍行心所法就会帮助伴随着阿赖耶识运行，这样阿赖耶识才能产生出一切法，这就是五遍行心所法所起的作用。</p><p>只要阿赖耶识存在，五遍行心所法就会伴随着运行，五遍行心所法依赖着阿赖耶识才能存在，它们都没有其自体性，是识心运作的辅助工具，有识心的存在，心所法才能存在和起用，没有识，心所法就不能存在，也不能起用了。心所法是没有自体性的，不是无始劫以来就一直存在的，必须要依赖阿赖耶识才能存在运行。而阿赖耶识不需要依赖任何法，祂就能够独自存在和运行。心所法就不行了，八个识的所有心所法都必须要依赖于相对应的识，才能够存在和运行，没有识，就不能存在和运行。</p><p>比如说六识的心所法，如果六识灭了，那么心所法也就随之而灭，不可能单独存在。因为心所法没有自体性，没有能动性，虽然六个识同样没有自体性，但是六识有能动性，有趋动性，心所法没有，必须依赖着有趋动性的六识才能存在，那就更加的没有自体性了。六识毕竟还有自己的特性和功能利用，是阿赖耶识亲自产生出来的识体。</p><p>而心所法完完全全依赖于识才能存在和运行，它没有自己独自存在的体。因为心所法是识的助伴，是辅助识心运行的助手，属于拐杖之类的性质，就叫助伴。既然五遍行心所法没有自体性，那就是完完全全的虚妄法，没有实体性。那就不能与识相等，二者不是同一类性质的法。</p><p> 原文：<strong>又触等五。如阿赖耶。亦是异熟。所缘行相。俱不可知。缘三种境。五法相应。无覆无记。故说触等。亦如是言。</strong></p><p>释：阿赖耶识的体性是无覆无记性，然而有人认为，阿赖耶识五遍行心所法，触、作意、受、想、思，应该是随同于阿赖耶识，也是无覆无记性，因为二者必须要有同样的体性。他们还认为，触等五法，与阿赖耶识一样，也应该是异熟性。</p><p>阿赖耶识的异熟性，是能够记录、收存众生的业种，并且受业种所熏，被熏了以后，祂将来就能输出业种，输出来的就是被熏染的。比如说众生造了杀人的恶业，这个业种就存在阿赖耶识里了，阿赖耶识领受了这个业种，收存起来以后就受熏了，就成为了不垢不净的体性。受熏了以后，将来才能把这个恶业种子输送出来，输送出来以后，众生就受了恶业的果报，祂输送出来的就是染污性的种子，以及众生与恶相应的心行，这是受熏染的结果。</p><p>又比如众生有贪心，生起了染污的心行以后，就造作了贪的业行，染污种子就存到阿赖耶识里了，阿赖耶识收存起来以后，就受了熏染，祂就含藏了这个恶业种子。等到将来缘熟了，祂把这种子输送出来，众生就现起了染污的业行，他还是贪，还是惯于偷盗。</p><p>阿赖耶识产生了众生贪染偷盗的行为，这就叫受熏了，不是阿赖耶识本身有这种行为，是祂把这贪染的种子又给输送出去现行了。众生存进来什么，祂就输送出去什么，这个叫作受熏，所以说阿赖耶识有异熟性。而这种邪见认为五遍行心所法，也有这种异熟性，也能记录收存、输出众生的业种，实现众生的因缘果报，这是不如理之说，不懂得心所的体性和作用，也混淆了识心的体性和作用。心所法没有自体性，不是实体，只是一个被识心所利用的辅助工具，没有识别性，不能起到识的功能作用。</p><p>这种错误知见认为，与阿赖耶识相应的心所法，一定是与阿赖耶识的体性相同，阿赖耶识是无覆无记性，心所法也应是无覆无记性的；阿赖耶识有异熟性，五遍行心所法也应该如阿赖耶识一样，有异熟性。</p><p>心所法有没有异熟性呢？没有异熟性，因为五遍行心所法没有自体性，不能单独存在，那就不可能受熏持种，不可能实现众生的异熟果报，因此心所法没有异熟性，它不能记录、收存、输送众生的业种，不能实现众生的因缘果报，心所法不可能作这些事，因为它不是实体，不是自在的。阿赖耶识是实体，有能藏、所藏、执藏的作用，祂象一个无形的大库房一样，能够含藏无尽的业种，收存无量的业种，因此才有异熟性。</p><p>而五遍行心所法不是实体，就没有能藏所藏性，没有执藏性，所以心所法不能受熏，不能记录收存业种，也不能输送业种，更不能实现众生的因缘果报。心所法没有实体，它要依赖着阿赖耶识才能够现行和运转，如果没有阿赖耶识，心所法也就不存在了。心所法是要依赖着阿赖耶识才能现行的，所以就没有异熟性。</p><p>阿赖耶识所缘境界，以及阿赖耶识运行的行相，都不容易被意识心所了知，心所法也是，所缘的境界和运行的行相，都不容易被意识心了知到。所缘的意思是说阿赖耶识缘的是什么样的法，祂缘业种，缘根身器界，缘七识心，因此就能了别业种，了别七识的心行，了别根身器界。阿赖耶识对这些法都能作意、能触、能受、能想、能思，能记录七转识造作的业行，能收存业种，能受前七转识所造作的业种的熏染，然后实现众生的善恶无记的因缘果报，这是异熟性。</p><p>而有人认为五遍行心所法也有异熟性，也有与阿赖耶识一样的所缘，一样的运行的行相，也能了别七识的心行，了别根身器界，了别业种，也能作意，也能触，也能受，也能想，也能思，也能记录业行，收存业种，实现因缘果报，心所法的所缘和运行行相，不同于阿赖耶识本体的所缘和行相。他们认为阿赖耶识的所缘以及运行的行相，意识心都不能触及到，因此不能具体了知，五遍行心所法的所缘与行相，也是同样的，意识心也触及不到，也不能具体了知。而我们应该知道，主体识和被其利用的工具，其所缘和行相，不可能相同，一个有能动性，一个没有能动性之故。</p><p>他们还认为五遍行心所法，能够缘三种境，三种境是什么境呢？第一个就是性境，第二个是带质境，第三个是独影境，这三种境是阿赖耶识所能缘的，他们就说因为阿赖耶识能缘，所以五遍行心所法也能缘。这个观点不如理，只有主体识才能缘这些法，有分别之性的法才能缘其他法，而心所法仅仅是一个识心所运用的工具罢了，工具不是识，不能有识的作用，就像人拿扫帚扫地，不是扫帚能扫地，而是人能扫地人有能动性，无情物的扫帚没有能动性，它仅仅是个工具罢了，心所法也如此。总之，他们认为五遍行心所法与阿赖耶识相应，也是无覆无记性，此说当然是非理的。</p><p> 原文：<strong>有义，触等如阿赖耶。亦是异熟。及一切种。广说乃至。无覆无记。亦如是言。无简别故。彼说非理。</strong></p><p>释：这种邪见认为阿赖耶识是无覆无记性的，五遍行心所法和祂相应，也应该属于无覆无记性的。他们知见不正，就说触等也如是，也应该有无覆无记性，这种说法没有任何道理。因为他们对这些法义没有相应的智慧来鉴别，没有智慧来仔细思维真实义究竟怎样，就生出这些错误的知见。五遍行心所法没有自体性，不是实体，而是辅助工具，就不能和阿赖耶识划等号，不能有阿赖耶识的那些体性。</p><p>阿赖耶识所具有的体性，五遍行心所法就没有。阿赖耶识是八识之王，就象一个皇帝一个国王一样，皇帝国王是富贵的，他要什么有什么，他可以做一切，而皇帝身边的大臣呢，或者是身边的辅臣之类的人，他们是帮助辅佐国王做事的，他们自己并没有这么多的财富，也没有这么多的权力，只是依赖于国王而帮助治理国家事务，他们所有的权势地位不可能和国王相提并论。</p><p>他们只是替国王办事，帮助国王治理国家，不能和国王平起平坐，国库里的金银财宝也属于国王所有，大臣只是帮助管理，没有实有权。五遍行心所法和阿赖耶识的关系，与这个道理是一样的。阿赖耶识有自体性，祂是一个实体，祂能够受熏，能够持种，能够变现一切法。五遍行心所法就不能了，心所不是自在的，没有自体性，就不能做这些事，不能有这些体性，只能帮助阿赖耶识运行，因此没有异熟性，也不是无覆无记性。</p><p> 原文：<strong>所以者何。触等依识。不自在故。如贪信等。不能受熏。如何同识。能持种子。</strong></p><p>释：为什么这种知见没有道理，心所法没有异熟性，不是无覆无记的呢？触等依识，不自在故。五遍行心所法依着阿赖耶识才能够存在和运行，它们都没有其自体性，没有自在性，不能自己单独存在，因此不能与阿赖耶识一样，受熏持诸业种。</p><p>比如根本烦恼中的贪心所，和善法当中的信心所，都是不自在的，随时随地会消失不见，不能时时现行出来，众生修到三果时，贪心所就会断灭，永不现起；众生原来没有信的善法，修到一定程度，才有了对三宝的信，如果业障现前，信心所法还会消失不见。因此心所法就不能受熏，熏之也无用，不能成熟众生的业缘，更不能实现众生的业果报。</p><p>五遍行心所法也如是，不能受熏。当众生心起贪爱，或者生起信仰，对三宝生清静信的时候，贪和信的心行，都不能熏染到五遍行心所法。心所法不能记录收存业种，那就不能受熏，更不能实现众生贪和信的果报，只能由阿赖耶识受熏染，收存贪和信的业种，实现果报。</p><p>当众生有贪心所，造作贪业之时，这个贪业，阿赖耶识就要记录收存，收存了以后，贪的业种就熏染了阿赖耶识，就使得阿赖耶识整体成为不垢不净的。那么阿赖耶识将来就能够释放这种贪的业种，还能让众生受到贪染而再造作贪业，这是阿赖耶识受熏染的结果。</p><p>但是五遍行心所法就不行，它们不能存种子，不能受熏染，也不能持种，更不能够输送业种来产生众生的业行，不能变现众生，不能变现万法。所以贪和信，以及众生所有的心行，都不能熏染五遍行心所法，因为心所法不是实体。既然不能受熏，那么五遍行心所法就不能和阿赖耶识一样受熏持种子。</p><p> 原文：<strong>又若触等。亦能受熏。应一有情。有六种体。若尔。果起从何种生。理不应言。从六种起。未见多种。生一芽故。</strong></p><p>释：如果这个五遍行心所法能够持种子的话，那就坏了，那么一个众生持种子的体就有六个了。本来阿赖耶识能够持众生造业的种子，众生的业种不管是善业、恶业还是无记业，造作的同时，阿赖耶识就记录，就收存起来了。</p><p>如果说五遍行也能记录和收存，那么众生造的一个业，不管是善业和恶业、无记业，造作的同时，那五遍行心所法也同时收存，也同时记录，阿赖耶识也收存，也记录，那就有六个体同时来收存众生的业行业种，那将来这个业种怎么算呢？将来业种成熟的时候，众生该受果报的时候，是不是六个体同时输送出业种，同时形成众生的业果呢？</p><p>比如说，众生造了恶业，应该当畜生，是不是阿赖耶识把众生变成畜生，然后作意心所法把这众生又变成畜生，触的心所法也把这众生又变成畜生，那不是出来六个畜生了吗？这个是决不可能的事。或者是阿赖耶识和五个心所法分别输出五个业种，然后共同形成一个畜生身，这也是不可能的，六个业种，不可能出生一个果报体。所以说五遍行心所法跟阿赖耶识不一样，不能受熏，不能执持种子，不能储存种子，也不能输送种子。</p><p>假如说作意、触、受、想、思五遍行心所法也能够受熏，能受熏的话就能持种，持种才受熏，那么每一个有情，就应该有六种体，不仅有阿赖耶识，还有五遍行心所法，这些都是体，那么众生造业时，这六体同时给记录收存，将来六个体同时产生众生的果报。当产生众生的眼识的时候，这六体同时产生眼识，那就能产生六个眼识，产生六个眼根，产生出六个眼耳鼻舌身意、色声香味触法，那就出来六个众生了，这绝对是不可能的。</p><p>比如说现在众生就有一个实体，那么出生出来的这个众生，他就有一个色身，只有一个五阴；不可能是有六个种子，从阿赖耶识也输送种子和业种，从触心所法也输送种子，从受心所法或者作意心所法都能输送种子，六个种子同时来变现同一个众生，这也是不可能的。</p><p>六个种子应该生六个芽，不应该生一个芽，现在众生都是一个芽，一个五阴，可见这个五阴只是阿赖耶识自己单独产生变现出来的，与五遍行心所法没有关系。所以五遍行心所法不能持种、受熏，与阿赖耶识是有差别的，不应该同体对待。阿赖耶识的心所就是心所，实体本身就是实体本身，功能作用不能平等相同。</p><p> 原文：<strong>若说果生。唯从一种。则余五种。便为无用。亦不可说。次第生果。熏习同时。势力等故。又不可说。六果顿生。勿一有情。一刹那顷。六眼识等。俱时生故。</strong></p><p>释：如果说众生的业果出生，产生众生的五阴十八界出来了，这只是从一种含藏种子的体生出来的果，那么其祂五个含藏有种子的体就没有用了。比如说产生众生五阴身的种子是从触心所法产生出来的，那么阿赖耶识就没有用了，作意的心所法也没有用了，受、想、思这些心所法也没有用了，祂们收存的这些种子都没有用了。</p><p>如果只用一个触心所法就能出生众生，那么阿赖耶识存在就没有必要了，其它四个心所法也都没有必要存在了。同理可证，如果众生的五阴身是从想心所法出生的，那么阿赖耶识和其他心所法就没有用了，这显然不合理。从以上分析来看，认为五遍行心所法能够受熏持种，就是一种邪见，是不正确的说法，没有任何道理。</p><p>也不能够说，这个六体（五遍行心所法加上阿赖耶识）是按照次第来出生众生的五阴十八界，一个体出生五阴身的一部分，六个体按照次序出生完整的五阴身，这个也不可能。因为众生造业时，祂们是同时熏习，同时存种的，这六体应该同时出生众生的果报身，同时产生众生，不可能次第的只产生一个众生，得同时产生六个众生。</p><p>产生六个众生的话，那就更不合理了，也不可能是一个众生，同时出生六个眼识等等都是六套的根尘识，六体产生一个众生也不合理。所以说五遍行心所法，不可能和阿赖耶识一样，能受熏持种。就是说五遍行心所法，没有受熏产生众生因缘果报的功能体性，和阿赖耶识有本质不同的体性，有本质不同的作用。</p><p> 原文：<strong>谁言触等。亦能受熏。持诸种子。不尔。如何触等如识。名一切种。谓触等五。有似种相。名一切种。</strong></p><p>释：有谁能说，触等心所法，也能受到七识业行的熏染，也能执持七识造业的种子。根本不是这样的，触等五遍行心所法，怎么能够如阿赖耶识一样，叫作一切种子识，含藏一切种子呢？他们错误地认为五心所法，有相似的执持种子的行相，心所随着阿赖耶识现行运作，就能如阿赖耶识一样，收存业种，受业种熏染，执持业种，就叫作一切种了，这是不对的。</p><p> 原文：<strong>触等与识。所缘等故。无色触等。有所缘故。亲所缘缘。定应有故。此似种相。不为因缘。生现识等。</strong></p><p>释：他们的错误观点认为，触等心所法，与阿赖耶识所缘的法相是相同的的，因此触等心所就有相似的种子行相。这样说是不对的。比如说人拿扫帚扫地，实际上是人在扫地，业行是人造作的，功劳归人所有，不能说功劳也有扫帚一份，扫帚仅仅是人使用的工具而已，它没有主观能动性，那也就没有功过了。阿赖耶识与五心所法的关系也是如此，心所法虽然能依赖着阿赖耶识而运行，但所作的一切事业都是阿赖耶识作的，心所仅仅是个工具罢了，因此心所就不能受熏持种，它也不是一切种子识。</p><p>他们认为，不是色法的心所法触等，因为也有所缘的法相，因此也就一定能有自体亲自所缘的法，而亲自所缘的法，就是自己亲自所变现出来的法，然后自己再缘。那这个说法显然也是不对的，心所法不可能出生任何一个法，它不是种子识，不含藏种子。这种相似于种子识的影相，不能作为出生现行七识等的因缘。</p><p> 原文：<strong>如触等上。似眼根等。非识所依。亦如似火。无能烧用。彼救非理。</strong></p><p>释：比如在触等心所上，对应有相似的眼根相分，这个眼根相分不是本质的眼根，所以并不是眼识所能依止之根，那么触心所就不能出生眼识，它也就不是种子所依。触等心所所缘的法相，都不是实质的相，就如镜子里的火，不能起燃烧的作用，那么看见镜子中的火，想要扑救，则是无智之举，因此心所不能出生一切法。</p><p> 原文：<strong>触等所缘。似种等相。后执受处。方应与识。而相例故。由此前说。一切种言。定目受熏。能持种义。</strong></p><p>释：他们说，触等心所有所缘的法相，有相似的种子识等法相，这在以后心所法起执受作用时，才能与阿赖耶识相例比，相一致，那时才能显示出来，触等心所法也能了别根身器界，也能受熏持种。基于此，才有前面所说的，触等心所有一切种子的说法，触等心所一定有能受熏、也能执持种子之义。此种言论也是没有道理的，下文会说到。</p><p> 原文：<strong>不尔。本颂有重言失。又彼所说。亦如是言。无简别故。咸相例者。定不成证。勿触等五。亦能了别。触等亦与。触等相应。由此故知。亦如是者。随所应说。非谓一切。</strong></p><p>释：真实义却不是这样，这段文字有严重的过失。他们所说的也如是这样的话，是因为自己没有智慧简择和辨别之故，所说的触等心所与阿赖耶识一样有受熏持种义，一定没有什么依据来证明；触等五心所法不可能有了别性，不可能了别业种和根身器界；触等心所法也不可能与作意触受想思相应。</p><p>比如作意心所，只是起引心趣境的作用，本身不能再生起作意触受想思心所的功能；触心所只是起接触的作用，本身不能再生起作意触受想思心所法的功能作用；受心所 只是起领纳领受的作用，本身不能再生起作意触受想思心所的功能作用；想心所，只是起了别取相的作用，本身不能再生起作意触受想思心所的功能作用；思心所，只是起思量抉择的作用，本身不能再生起作意触受想思心所法的功能作用，因为它们本身都不是识，因此不能再有助伴心所了。</p><p>所以我们应该知道，他们所说的心所与阿赖耶识也是一样的，只是随意而说，并没有理论依据，触等心所并不是一切种子识，不含藏种子，也不能受熏持种。</p></div>"
},{
    "title": "成唯识论第五卷讲解关于意根的心所法",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>成唯识论第五卷讲解关于意根的心所法<span> </span></strong></p><p>原文：<strong>未转依位。与前所说心所相应。已转依位。唯二十一心所俱起。谓遍行别境各五。善十一。如第八识已转依位。唯舍受俱。任运转故。恒于所缘平等转故。</strong></p><p><strong>末那心所何性所摄。有覆无记所摄非余。此意相应四烦恼等。是染法故。障碍圣道。隐蔽自心。说名有覆。非善不善。故名无记。如上二界诸烦恼等。定力摄藏。是无记摄。此俱染法。所依细故。任运转故。亦无记摄。若已转依。唯是善性。</strong></p><p>释：未转依位，是指地前菩萨与凡夫，他们的意根，有十八个心所法，有染污。已转依位，是指从初地菩萨开始，意根的心所法有二十一个，五遍行、五别境、善十一。意根的心行已经与善心所相应。没有我见、我爱、我慢、我痴四烦恼。</p><p>未转依位，意根是无记性，已转依已，意根是善性。因为初地开始，意根已经转变成平等性智了，不是原来的染污识性，所以意根的心所染污性就转变了，由我性转变成无我性。而无我性，其智慧就广，心所就有五别境心所法：欲、胜解、念、定、慧。这个慧心所就比地前菩萨和凡夫的慧心所有所不同，智慧广大，能缘就宽广。有了五别境心所，意根的本事就增大了。</p><p>所以地上菩萨要根据自己的观行，观行自己的意根的心所法，来讲法，地前菩萨和凡夫，就不好理解，心行不同的缘故。</p><p>就比如天人依据他们自己的心来讲心的境界，我们人类就不好理解，心行不同的缘故。就好比人类说话，动物们不懂，因为心行不同的缘故。各有各的内心世界，不容易越界。所以佛法是唯信乃入、唯信乃知，信为道源功德母。无缘不能信，别人就没办法了。修行是一步一步地来，凡夫先断我见，再明心见性。</p><p>意识心在凡夫位有五十一个心所法，贪嗔痴烦恼具足。在三果罗汉位，意识的心所法就减少，烦恼心所法消灭了。在入地以后的转依位，意识的烦恼心所法会更少，逐渐转变成全部是善性的。到了佛地，意识的心所法就会只有二十一个，五遍行、五别镜、善十一。</p><p>所以修行，就是在逐渐改变六七识的心行，六七识的心行和体性不是一成不变的。所以讲心，要说明这个是讲凡夫的心行，还是讲贤人的心行，还是讲圣人的心行，还是讲佛的心行。 如果不说明，凡夫或者观行不到的人就会说：不对，我的心不是这样的，经典里也没有这样说。因为心心不同的缘故，都是依据自己的心所心行而说，不会超越于自己的心行来说话。</p><p> 成唯识论第四卷原文：<strong>（意根）未转依位。恒审思量所执我相。已转依位。亦审思量无我相故。</strong></p><p>释：地前菩萨和凡夫，属于未转依位，他们的意根是执我、思量我。已转依位，就开始思量无我，在一切法上会思量其无我性，无生法忍慧越来越深利。所以众生之间是有很大区别的 。</p></div>"
}]