[{
    "title": "第一章 如何明了苦谛相",
    "author": "生如法师",
    "date": "2022年09月22日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  如何明了苦谛相</strong></p><p>原文：<strong>若乐往趣。出世间道。应当依止。四圣谛境。渐次生起。七种作意。所谓最初。了相作意。最后加行。究竟果作意。乃至证得。阿罗汉果。修瑜伽师。于四圣谛。略摽广辩。增上教法。听闻受持。或于作意。已善修习。或得根本。静虑无色。</strong></p><p>释：如果修行人乐于趣向出世间道，应当依止四圣谛境界，渐次生起七种作意，这七种作意分别是最初的了相作意，后边的胜解作意、远离作意、摄乐作意、观察作意、加行究竟作意，以及最后的加行究竟果作意，直至证得阿罗汉果。修习瑜伽的行者于四圣谛理，大略涉猎，广泛地辩证增上教法，听闻受持，他们或者对于如理作意已经善于修习，或者证得了根本静虑四禅八定，甚至达到无色界定。</p><p>这段文大略地显示了从凡夫到四果阿罗汉的修学内容和次第或者是过程，众生要想解脱世间苦，证得涅槃乐，就要修学四圣谛。在修行四圣谛的过程中，要生起七种作意，所谓的作意，是指注意、关注和用心，心所趣向，也是指观行、观察，作意不同，趣向不同，果就不同，最后生起加行究竟果作意，才获得了究竟果，证得阿罗汉果，得解脱，出世间。</p><p>原文：<strong>由四种行。了苦谛相。谓无常行。苦行空行。无我行。由四种行。了集谛相。谓因行集行。起行缘行。由四种行。了灭谛相。谓灭行静行。妙行离行。由四种行。了道谛相。谓道行如行。行行出行。如是名为。了相作意。</strong></p><p>释：修习四圣谛，从四种行上明了苦谛相：无常行、苦行、空行和无我行；从四种行上明了集谛相：因行、集行、起行和缘行；从四种行上明了灭谛相：灭行、静行、妙行和离行；从四种行上明了道谛相：道行、如行、行行和出行。这些法合起来就名为了相作意。</p><p>这段介绍四圣谛大略的修行内容，每一谛的修学都包括四种行，合起来就是十六行，叫作四谛十六行。</p><p>原文：<strong>由十种行观察苦谛。能随悟入苦谛四行。何等为十。一变异行。二灭坏行。三别离行。四法性行。五合会行。六结缚行。七不可爱行。八不安隐行。九无所得行。十不自在行。如是十行依证成道理。能正观察。</strong></p><p>释：从十种行上来观察苦谛，能随顺悟入苦谛四行。是哪十种行？一是变异行，二是灭坏行、三是别离行、四是法性行、五是合会行、六是结缚行、七是不可爱行、八是不安稳行、九是无所得行、十是不自在行。这样的十种行依靠证成道理能够正确地观察到。</p><p>这段介绍十种行，以十种行来观察苦谛，才能悟入苦谛的四行，最后才能由四行证得苦谛。</p><p>原文：<strong>此中且依。至教量理。如世尊说。诸行无常。又此诸行。略有二种。一有情世间。二器世间。世尊依彼有情世间。说如是言。苾刍当知。我以过人。清净天眼。观诸有情。死时生时。广说乃至。身坏已后。。当生善趣。天世界中。由此法门。显示世尊。以净天眼。现见一切有情世间。是无常性。</strong></p><p>释：观察苦谛要依世尊所讲的至教量之理，比如世尊所说的诸行无常之理。诸行无常即是苦，观行诸行无常即是观行苦谛和苦集谛。佛说诸行无常的行大略有两种：一种是有情世间，二种是器（无情）世间。佛说：我以超过人类的清净天眼。观诸有情死时生时。广说乃至身坏已后。当生善趣天世界中。此法门显示世尊以净天眼现见一切有情世间是无常性。</p><p>从这段开始，世尊具体开示诸行无常。行，是指有生住异灭的法，凡是能生住异灭的都是行，一切行名为诸行，诸行都是无常的，因为有生住异灭的现象。这些现象世尊以清净的天眼悉皆得见。佛无论见任何法，世间和出世间一切法全部是现见，没有非现见的比度思量和非量臆想，智慧究竟圆满之故。众生见法则分为现量、比量和非量三种，佛完全是现量，众生则不如此。器世间的无常可以参看长阿含经中的起世因缘经所讲述的器世间的生住异灭。</p><p>原文：<strong>又世尊言。苾刍当知。此器世间。长时安住。过是已后。渐次乃至。七日轮现。如七日经广说。乃至所有大地。诸山大海。及苏迷卢大宝山王。乃至梵世诸器世界。皆被焚烧。灾火灭后。灰烬不现。乃至余影。亦不可得。由此法门。世尊显示。诸器世间。是无常性。如是且依。至教量理。修观行者。净信增上。作意力故。于一切行。无常之性。获得决定。得决定已。即由如是。净信增上。作意力故。数数寻思观察。一切现见不背。不由他缘。</strong></p><p>释：世尊在起世因缘经中说：比丘们，你们应当知道，娑婆世界这个器世间现在还能长时间安稳地住着，过了这段时间以后，渐渐地就会出现两个太阳、三个太阳，乃至于最后会出现七个太阳，如七日经中所说的那样，这时候器世间里所有的大地、诸山和大海，以及欲界天上的须弥山，乃至于色界所有的器世间全部都被烧毁。火灾过去之后灰尘也消失不见了，甚至连任何影像都找不到了。</p><p>世尊讲的这些事情正显示出一切器世间的无常性。听闻世尊开示，依止世尊所说的至教量理，修习观行者对于诸行无常的净信得到增上，作意于诸行无常的能力增强，于是就对一切行无常之性获得决定。心得决定以后，再由此种净信增上作意力，不断地寻思和观察诸行无常性，就现见一切行的无常性，与至教量理不相违背，这样的现见不是由于其他的因缘提示出来的，而是因为如实观察，自心现见。</p><p>观察诸行无常，需要依靠净信力，相信世尊所言诸行无常，心清净不作他想。由于净信，才能作意观察寻伺诸行无常性，如果不净信，不相信诸行无常，就不会作意观察。观察是自心现见，如果不是现见，就不叫作现前观察了。自心现见也叫作现量观察、现量所证，现是现前存在、真实存在的意思，不是思惟想象脑补出来的。修行者通过熏习世尊的诸行无常至教量理，在禅定中观察诸行的无常性，缘熟时就会现见诸行确实无常，进而实证苦谛。因为现见诸行是苦，于是不愿再受苦，灭苦之愿望就生出来了。</p><p>原文：<strong>无常之性。云何数数。寻思观察。谓先安立。内外二事。言内事者。谓六处等。言外事者。有十六种。一者地事。谓城邑聚落。舍市廛等。二者园事。谓药草丛林等。三者山事。谓种种山。安布差别。四者水事。谓江河陂湖。众流池沼。五者作业事。六者库藏事。七者食事。八者饮事。九者乘事。十者衣事。十一者庄严具事。十二者舞歌乐事。十三者香鬘涂饰事。十四者资生具事。十五者诸光明事。十六者男女承奉事。如是名为十六种事。</strong></p><p>释：诸行无常之性，如何不断地寻思观察？先安立五阴身内外二事，内事即眼耳鼻舌身意六处等。外事是吃穿住用行等十六种：第一种是地事，包括城邑、部落、舍宅、交易场所等等；第二种是园事，包括种植药、花草树木之处；第三种是山事，包括高山、丘陵等等大小不同的山；第四种是水事，包括江河、大海、湖泊、池塘等等有水聚集之处；第五种是作业事；第六种是库藏事；第七种是饮食之事；第八种是饮水之事；第九种是车乘之事；第十种是穿衣之事；第十一种是庄严具事；第十二种是歌舞音乐之事；第十三种是香花涂鬘装饰之事；第十五种是光明照耀之事；第十六种是男女承奉事。</p><p>这些事都是世俗界的无常之事，这些法之所以是无常的，是因为都是有为造作出来的生住异灭的法，生之后念念不停留，不断地变异，直至毁灭。众生从小到大一直都在做这些无常事，却不觉得无常，修习了至教量理之后，意识很容易理解这些事的无常性，可是意根愚钝不容易接受，所以才需要修习戒定慧，在禅定中观行，最后证得无常性。证得就是现见，现见是现前观察到了法的无常性，不是凭意识思惟和理解的，无常性清晰地呈现出来，不得不信服，立即接受了就是证得，并且出现三昧，内心处于对法无常的感知当中而不动摇。</p><p>原文：<strong>安立如是。内外事已。复于彼事。现见增上。作意力故。以变异行。寻思观察。无常之性。此中内事。有十五种。所作变异。及有八种。变异因缘。云何内事。有十五种。所作变异。一分位所作变异。二显色所作变异。三形色所作变异。四兴衰所作变异。五支节具不具。所作变异。六劬劳所作变异。七他所损害。所作变异。八寒热所作变异。九威仪所作变异。十触对所作变异。十一杂染所作变异。</strong></p><p>释：安立了这些内外事之后，又为了能够现见这些事，加强了见法的作意力，从诸法变异这个角度来寻思、观察内外事的无常性，其中内事有十五种变异，有八种变异的因缘。内事都有哪十五种变异？一种是色身处于不同时期的分位变异；二种是在显色上出现的变异，如肤色的黑白赤黄等；三种是在形色上出现的变异，如高矮胖瘦等等；四种是在色身的兴衰上出现的变异，如有力气和无力气等等；五种是在身根肢节上出现的变异，如断胳膊断腿等残缺；</p><p>六种是在劳作上出现的变异，如劳累和不劳累等等；七种是在被人所损害上出现的变异，如被人欺凌、诬陷、诽谤、损害名声等等；八种是在冷热上出现的变异，如发烧、畏寒等等；九种是在威仪进止上出现的变异，如色身懒散、弯腰驼背、行动不便等等；十种是在接触的对象上出现的变异，如接触的人事物的变动和改变；十一种是在有杂染心所作的事情上出现的变异，如善恶业的转变；十二种是在身体疾病上出现的变异，原来健康，现在出现病苦等等；十三种是在死亡上出现的变异，生命终了了；十四种是死后身体出现了青淤肿胀的变异；十五种是死后出现尸体消失不见，骨灰也无影无踪的变异。</p><p>原文：<strong>云何八种。变异因缘。一积时贮畜。二他所损害。三受用亏损。四时节变异。五火所焚烧。六水所漂烂。七风所鼓燥。八异缘会遇。</strong></p><p><strong>积时贮畜者。谓有色诸法。虽于好处。安置守护。而经久时。自然败坏。其色衰损。变异可得。他所损害者。谓种种色法。若为于他。种种捶打。种种损害。即便种种。形色变异。受用亏损者。谓各别属主。种种色物。受者受用。增上力故。损减变异。</strong></p><p>释：什么是八种变异因缘？一种是积时贮畜；二种是他所损害；三种是受用亏损；四种是时节变异；五种是火所焚烧；六种是水所漂烂；七种是风所鼓燥；八种是异缘会遇。</p><p>积时贮畜的意思是，对于有色相的诸法，虽然能放置在妥当之处保存着，但是经过长久之时，还是会自然败坏，其色相会出现衰损变异的现象。他所损害的意思是，种种色法或者是被他人用种种的方式捶打，用种种的方式损害，于是便有种种产生变异的形色。受用亏损的意思是，各个不同的属于使用者的种种有色物质，由于受用者不断地使用，而出现磨损变异的现象。</p><p>原文：<strong>时节变异者。谓秋冬时。丛林药草。华叶果等。萎黄零落。于春夏时。枝叶华果。青翠繁茂。火所焚烧者。谓大火纵逸。焚烧村邑。国城王都。悉为灰烬。水所漂烂者。谓大水洪漫。漂荡村邑。国城王都。悉皆沦没。风所鼓燥者。谓大风飘扇。湿衣湿地。稼穑丛林。干韅革日枯槁。</strong></p><p>释：时节变异的意思是，在秋冬时节，丛林里、药草、花、叶和果实等等都萎黄零落了，在春夏之时，丛林、药草、枝叶、花果又开始生长出来，青翠繁茂。火所焚烧的意思是，大火燃烧起来，焚烧了村庄和聚落，国城和王宫都被烧成了灰烬。水所漂烂的意思是，大水漫布，淹没了村庄和聚落，国城和王宫都被洪水淹没了。风所鼓燥的意思是，大风刮起的时候，潮湿的衣服和土地、庄稼和丛林，都被吹干燥了，越来越枯槁。</p><p>原文：<strong>异缘会遇者。谓缘乐受触。受乐受时。遇苦受触。缘苦受触。受苦受时遇乐受触。缘不苦不乐受触。受不苦不乐受时。遇乐受触。或苦受触。又有贪者会遇瞋。缘贪缠止息。发起瞋缠。如是有瞋痴者。会遇异分。烦恼生缘。当知亦尔。如是眼识。正现在前。会遇声香味触境等。是名八种。变异因缘。一切有色。及无色法。所有变异。皆由如是。八种因缘。除此更无。若过若增。</strong></p><p>释：异缘会遇的意思是，缘于乐受的触对，应该受乐受的时候，却遇到了苦受的触；缘于苦受的触，应该受到苦受的时候，却遇到了乐受的触；缘于不苦不乐受的触，应该受到不苦不乐受时，却遇到了乐受的触或者是苦受的触。另外还有，贪心的人却遇到了嗔的缘，这边止息了贪的烦恼缠缚，那边嗔的烦恼缠缚却生起来了，如是有嗔和痴的人，会遇到非嗔非痴的烦恼出生的缘，也是这样。同样地，当眼识正现前的时候，就会遇到声香味触的境界缘，这就是八种变异因缘。一切有色的法和无色的法的所有变异，都是由这八种因缘造成的，除此之外再也没有其他什么因缘了。</p><p>这里的异，是改变的意思，所遇的缘改变了，因改变，果也就改变了。因缘变异大体分为这八种，细分可能会很多。因为缘会改变，所以是无常，因为果会改变，所以也是无常，由因缘变异能完全充分地显示无常。</p><p>原文：<strong>云何寻思。内事分位所作。变坏无常之性。谓由观见。或自或他。从少年位。乃至老位。诸行相续。前后差别。互不相似。见是事已。便作是念。如是诸行。其性无常。何以故。此内分位。前后变异。现可得故。</strong></p><p>释：如何观察色身分位出现的变坏无常之性？从观察自己或者是他人从少年位开始到年老位这段时间里，诸行相续变异，前后的差别现象，没有相似之处。观察到这些现象以后，心里应该有这样的观念：这些诸行其性真是无常的。为什么会得出这个结论？因为在色身上的内分位中，从小到老，前后的变化和差异，确实是现前可以观察到的。</p><p>原文：<strong>云何寻思。内事显色所作。变异无常之性。谓由观见。或自或他。先有妙色。肌肤鲜泽。后见恶色。肌肤枯槁。复于后时。还见妙色。肌肤鲜泽。见是事已。便作是念。如是诸行。其性无常。何以故。此内显色。前后变异。现可得故。</strong></p><p>释：如何观察内身事眼识所见的显色上，所出现的变异无常之性？观察自己和他人原先有美妙的肤色，肌肤鲜嫩润泽，后来却发现肤色变坏了，枯槁了，不再鲜嫩润泽了，过了一段时间又看见色泽美妙肌肤润泽了。观察到这些现象以后，心里便想，像这样的诸行，其性确实是无常的。为什么这样说呢？因为这些身内的显色前后不同，变异无常，现前就可以观察得到。</p><p>原文：<strong>云何寻思。内事形色。所作变异。无常之性。谓如说显色。如是形色。由肥瘦故。应知亦尔。云何寻思。内事兴衰。所作变异。无常之性。谓由观见。或自或他。先时眷属财位。或见悉皆兴盛。后见一切。皆悉衰损。复于后时。还见兴盛。见是事已。便作是念。如是诸行。其性无常。何以故。兴衰变异。现可得故。</strong></p><p>释：如何观察内身事在形色上出现的变异无常之性？就像所观察到的显色那样，形色在胖瘦方面也是同样的道理。如何观察内身事在兴衰上出现的变异无常之性？观察自己和他人从前的眷属和财产、地位，有时看见都是兴盛的，后来却都衰损了，再以后又看见兴盛了。观察到这些现象以后，心里就有这样的感想：像这样的诸行，其性确实是无常的。为什么呢？因为家财眷属的兴衰变异，现前可以观察得到。</p><p>原文：<strong>云何寻思。内事支节。所作变异。无常之性。谓由观见。或自或他。先时支节。无有缺减。后时观见。支节缺减。或王所作。或贼所作。或人所作。或非人作。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事在肢节上所出现的变异无常之性？看见自己或者是他人的肢节，先前时并没有缺减，后来就看见肢节有缺减了，这个事情或者是国王惩罚造成的，或者是贼寇抢劫时造成的，或者是他人造成的，或者是非人造成的，观察到这些现象以后，心里就有这样的观念出现：如是诸行，其性确实是无常的。</p><p>原文：<strong>云何寻思。内事劬劳。所作变异。无常之性。谓由观见。或自或他。身疲劳性。身疲极性。或驰走所作。或跳踊所作。或趒踯所作。或骗骑所作。或作种种。迅疾身业。复于余时。见彼远离。疲劳疲极。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事身体劳累，所出现的变异无常之性？观察自己或者是他人身体的疲劳性，身体的极度疲乏性，或者是由于快速地行走所造成的，或者是由于跳跃所造成的，或者是反复蹬跳所造成的，或者是骑马所造成的，或者是作种种快速的身行所造成的，然后又在后来这种极度的疲劳没有了、消失了。观察到这些现象时，心里就有这样的观念：如是诸行，其性真是无常。</p><p>原文：<strong>云何寻思。内事他所损害。所作变异。无常之性。谓由观见。或自或他。他所损害。其身变异。或由刀杖鞭革。皮绳矛槊等坏。或由种种。蚊虻蛇蝎。诸恶毒触。之所损害。复于余时。见不变异。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事被人所损害，身体出现的变异无常之性？由于观察到了自己或者是他人，被人所损害，身体发生了变异，或者是由于刀杖鞭打、结实的绳子和长矛、箭等所毁坏，或者是由于种种蚊虻、蛇蝎等等的恶毒所毒害，可是后来又看见身体好了，没有了变异现象。观察到这些现象之后，心里便有这样的观念：如是诸行真是无常。</p><p>原文：<strong>云何寻思。内事寒热。所作变异。无常之性。谓由观见。或自或他。于正寒时。身不舒泰。踡局战栗。寒冻缠逼。希遇温阳。于正热时。身体舒泰。奋身干语。霡霂流汗。热渴缠逼。希遇清凉。复至寒时。还见如前。所说相状。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事由于寒热，所出现的变异无常之性？由于观察到了自己或者是他人，在特别寒冷的时候，身体很不舒服，蜷曲着身体浑身战栗，寒冷逼身，希望得到温暖的阳光。或者观察到在特别炎热时，身体都舒展开，全身燥热，口干舌燥。满身流汗如下雨一样，又热又渴，希望能遇到清凉。过后到寒冷时节，又看到前边所说的现象和状态。观察到这些现象，心里便有这样的观念：如是诸行，其性真是无常。</p><p>原文：<strong>云何寻思。内事威仪。所作变异。无常之性。谓由观见。或自或他。行住坐卧。随一威仪。或时为损。或时为益。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察内身事在四威仪上，所出现的变异无常之性？由于观察到自己或者他人在行住坐卧时，随着一个威仪，有时候减损，有时候增益，观察到这些现象以后，心里就出现这样的观念：如是诸行，其性真是无常的。</p><p>原文：<strong>云何寻思。内事触对。所作变异。无常之性。谓由触对。顺乐受触。领乐触缘。所生乐时。自能了别。乐受分位。如能了别。乐受分位。如是了别。苦受分位。不苦不乐受分位。应知亦尔。彼由了别。如是诸受。前后变异。是新新性。非故故性。或增或减。暂时而有。率尔现前。寻即变坏。知是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事在触对的时候，所出现的变异无常的之性？由于触到了顺心的乐受触，领受由乐触的缘所出生的乐受时，自然地就能了别到乐受的分位。就像能了别乐受分位一样，了别苦受分位也是这样，了别不苦不乐受的分位同样是这样。由于了别了这三种受的前后变异，受不断地更新变化，不是如最初那样的一成不变，三种受有时增加有时减少，各种受只是暂时而有，突然现前，不久就变灭了。观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事杂染。所作变异。无常之性。谓能了知。先所生起。或有贪心。或离贪心。或有瞋心。或离瞋心。或有痴心。或离痴心。又能了知。随一一种。诸随烦恼。所染污心。又能了知。随一一种。诸随烦恼。不染污心。又能了知。彼心相续。由诸烦恼。及随烦恼。于前后位。趣入变坏。不变坏性。见是事已。便作是念。如是诸行。其性无常。何以故。心由杂染。所作变异。现可得故。</strong></p><p>释：如何观察内身事由于杂染，所造成的变异无常之性？能了知先前所生起的杂染心，或者是有贪心，或者是离贪心；或者是有嗔心，或者是离嗔心；或者是有痴心，或者是离痴心。又能了知随着每一种随烦恼所生出的染污心，也能了知随每一种随烦恼所生出的不染污心。又能了知杂染心相续地，由诸烦恼及随烦恼，前后顺次进入变坏和不变坏之性。观察到这些现象以后，心里就出生这样的念想：如是诸行，其性真是无常。为什么呢？心由于杂染所生出的变异，现前可以观察得到。</p><p>原文：<strong>云何观察。内事疾病。所作变异。无常之性。谓由观见。或自或他。先无疾病。安乐强盛。后时观见。或自或他。遭重病苦。触对猛利。身诸苦受。如前广说。复于余时。还见无病。安乐强盛。见是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事由于疾病所出现的变异无常之性？由于观察到自己或者是他人先前并无疾病，身心安乐强健，后来又看见自己或者是他人遭受了严重的病苦，病的很厉害，感受非常痛苦，再过后却观察到自己或者是他人又没病了，身心安乐强健。观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事终殁。所作变异。无常之性。谓由观见。今时存活。安住支持。复于余时。观见死没。唯有尸骸。空无心识。见是事已。便作是念。如是诸行。其性无常。云何观察。内事青瘀等。所作变异。无常之性。谓由观见。死已尸骸。或于一时。至青瘀位。或于一时。至脓烂位。如是乃至。骨锁之位。见是事已。便作是念。如是诸行。其性无常。</strong></p><p>释：如何观察内身事在死亡上，所出现的变异无常之性？观察到他人当时还存活着，安稳住世，又在后来发现他死亡了，只剩下了尸体，却没有了心识。观察到这个现象以后，心里便有这样的念想：如是诸行，其性真是无常。如何观察内身事在尸体青淤等等位，所出现的变异无常之性？观察已经死去的尸体，在一时间出现青淤肿胀的现象，一时间尸体出现脓肿溃烂的现象，最后只剩下了一堆骨头。观察到这些现象以后，心里就生起这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。内事一切。不现尽灭。所作变坏。无常之性。谓由观见。彼于余时。此骨锁位。亦复不现。皆悉败坏。离散磨灭。遍一切种。眼不复见。见是事已。便作是念。如是诸行。其性无常。何以故。如是色相。数数改转。前后变异。现可得故。</strong></p><p>释：如何观察内身事一切法都不出现，全部都灭尽了，所显现出来的变坏无常之性？观察身体在后时剩下的一堆骨头也都没有了，全部都败坏了，消散了，磨灭了，每一种色物，眼睛都看不见了。观察到这些现象以后，心里便有这样的念想：如是诸行，其性真是无常。为什么这样说呢？死后尸体的色相不断地发生转换，前后变异的现象都可以现前观察得到。</p><p>原文：<strong>如是且由。现见增上。作意力故。十五种行观。察内事。种种变异。无常之性。观察是已。复更观察。十六外事。种种变异。无常之性。云何观察。地事变异。无常之性。谓由观见。此地方所。先未造立道场。天寺宅舍。市廛城墙等事。后见新造。善作善饰。复于余时。见彼朽故圮坼。零落颓毁穿缺。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。何以故。如是色相。前后转变。现可得故。</strong></p><p>释：如是，由现量所见的增上作意力，观察了十五种内事的种种变异无常之性，之后再接续观察十六种外事的种种变异无常之性。如何观察地事的变异无常之性？观察此地所处之方所，先前并未建造道场、寺庙、舍宅、市场、城墙等等，后来在此地新建了这些建筑物，又在后来，看见这些建筑物破旧拆毁了，或者零落衰败坍塌了，或者被火烧毁了，或者被水冲倒了。观察到这些事情以后，心里便有这样的念想：如是诸行，其性真是无常。为什么这样说呢？因为其色相的前后转变，现前是可以观察得到的。</p><p>原文：<strong>云何观察。园事变异。无常之性。谓先观见。诸园苑中。药草丛林。华果枝叶。悉皆茂盛。青翠丹晖。甚可爱乐。复于后时。见彼枯槁。无诸华果。柯叶零落。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察园林变异无常之性？先前看见所有园林中药草、丛林、花果枝叶，全都是茂盛的，红花绿叶很是可爱，又在后来之时，却看见这些植物都枯槁了，再也没有花果了，叶子都零落下来，或者被火焚烧了，或者被水冲倒了。观察到这些现象以后，心里便想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。山事变异。无常之性。谓于一时。观见其山。丛林蓊郁。耸石巉岩。复于一时。见彼丛林。巉岩耸石。雕残颓毁。高下参差。火所焚烧。水所漂荡。见是事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察山川山脉变异无常之性？在某一时间里看见山脉林木茂盛，山岩林立高耸入云，又在后一时间看见那个丛林林立的山岩凋零残毁，颓然欲倒，参差不齐，或者是被火焚烧，或者是被水冲倒，观察到这些事以后，心里便想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。水事变异。无常之性。谓先一时。见诸河渎。池泉井等。涛波涌溢。醴水盈满。后于一时。见彼一切。枯涸干竭。见是事已。便作是念。如是诸行。其性无常。余如前说。云何观察。业事变异。无常之性。谓先一时。见彼种种。殉利牧农。工巧正论。行船等业。皆悉兴盛。复于一时。见彼事业。皆悉衰损。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察河水等等变异无常之性？先前某一时间看见诸河流、泉池、井等水流波涛汹涌，甘美的水盈满其中，在后来某一时间里，却见一切河流泉池全都枯竭干尽了。观察到这些现象以后心里便想：如是诸行，其性真是无常。如何观察所作业用的变异无常之性？在先前某一时间看见用来谋取世俗之利的农牧业、建筑科学各种技术以及世间里正当的演说辩论，还有船舶运输之业，都很兴盛，又在后来的某一时间，看见这些事业全部都衰落了，观察到这些现象以后，心里就有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。库藏变异。无常之性。谓由观见。种种库藏。一时盈满。一时灭尽。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。饮食变异。无常之性。谓由观见。种种饮食。一时未办。一时已办。一时入口。牙齿咀嚼。和杂涎唾。细细吞咽。一时入腹。渐渐消化。一时变为。屎尿流出。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察库藏变异无常之性？观察到种种库藏此时盈满，又在彼时消失灭尽，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。如何观察饮食变异无常之性？观察到种种饮食，此一时还没有做好，彼一时就做好了，此一时入口咀嚼，和着唾液慢慢地吞咽，彼一时饮食入腹消化了，然后就变为屎尿排泄出去，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。乘事变异。无常之性。谓于一时。见种种乘。新妙庄严。甚可爱乐。复于一时。见彼朽故。离诸严饰。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。衣事变异。无常之性。谓由观见。种种衣服。一时新成。一时故坏。一时鲜洁。一时垢腻。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察车乘之事变异无常之性？在某一时间看见种种车乘还很新、很美妙庄严，令人爱乐，又在另一时间看见这些车乘腐朽衰败了，不美妙也不庄严了。观察到这些现象，便有这样的念想：如是诸行，其性真是无常。如何观察衣服之事变异无常之性？看见种种衣服，此时是新制成的，彼时变旧了、毁坏了，此时新鲜干净，彼时就充满污垢。观察到这些现象，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。严具变异。无常之性。谓由观见。诸庄严具。一时未成。一时已成。一时坚固。一时破坏。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。舞歌乐事。所有变异。无常之性。谓由观见。舞歌伎乐。现在种种。音曲差别。异起异谢。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察庄严之具变异无常之性？看见种种庄严之具，此时还没有制成，彼时就完工了，此时坚固，彼时就散坏了。观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。如何观察歌舞伎乐之事变异无常之性？观察正在演奏的歌舞伎乐，有种种的音声和曲调差别，此时起彼时灭，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。香鬘涂饰。所有变异。无常之性。谓先观见。种种香鬘。鲜荣芬馥。后时见彼。萎悴臭烂。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。资具变异。无常之性。谓观见彼。未造已造。成满破坏。前后变异。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察香鬘涂饰所有变异无常之性？现前看见种种香鬘，荣华艳丽，香气四溢，后来又见香鬘萎黄，碎烂臭秽，看见这些现象，便有这样的念想：如是诸行，其性真是无常。如何观察资生之具变异无常之性？观察资生之具先前还未造就出来，后来打造出来了，用过之后又被破坏掉了，前后不断地变异，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>云何观察。光明变异。无常之性。谓由观见。种种明闇。生灭变异。见此事已。便作是念。如是诸行。其性无常。余如前说。云何观察。男女承奉。所有变异。无常之性。谓观见彼。或衰或盛。不久坚住。见此事已。便作是念。如是诸行。其性无常。余如前说。</strong></p><p>释：如何观察光明变异无常之性？看见了种种明暗相的生灭变异，观察到这些现象之后，便有这样的念想：如是诸行，其性真是无常。如何观察男女互相恩爱的变异无常之性？观察到男女恩爱由盛到衰，由衰到盛，不能长久，观察到这些现象以后，便有这样的念想：如是诸行，其性真是无常。</p><p>原文：<strong>如是一切。外事诸行。前之六种。是所摄受事。后之十种。是身资具事。以要言之。当知其性。皆是无常。何以故。形相转变。现可得故。由如是等。如前所说。</strong></p><p>释：如是这一切的外事诸行，前边六种是五阴身所摄受的事，后边十种是身体所需要的资具之事。总而言之，这些法其性都是无常的。为什么这样说呢？因为这些法的形和相的转变，是现前可以观察得到的，如前边具体所说的那样。</p><p>原文：<strong>诸变异行。现见增上。作意力故。于内外事。如其所应。以变异行。观察一切。是无常性。由是因缘。于诸变异。无常之性。现见不背。不由他缘。非他所引。随念观察。审谛决定。即由如是。所说因缘。说名现见。增上作意。即由如是。现见增上。作意力故。观察变异。无常性已。彼诸色行。虽复现有。刹那生灭。灭坏无常。而微细故。非现所得。</strong></p><p>释：由于有能够现前观察这些不断变异诸行的增上作意力的缘故，观察内事和外事就与变异无常之性相应，从诸行变异的角度来观察一切法都是无常的。由于这个因缘，对于诸行的变异无常之性，能够现前观察，不违背其变异无常性。现见的意思是现量所见，内外事一切法与无常性不相违背，一切法的变异不由他缘所起，不是外在因缘所引起的。</p><p>对于内外一切法无常性的观察和确认，能够随着自己的增上作意力来仔细审查，最后心得决定，由于有这样的因缘，就说现前观察是现见增上作意。也就是说由于有这样的现见增上作意力的缘故，观察诸行变异无常之性以后，那些色行虽然还在，但是却知道都是刹那生灭，灭坏无常的法。因为这些法非常微细的缘故，不是现前所观察得到的。</p><p>原文：<strong>故依现见。增上作意。应正比度。云何比度。谓彼诸行。要有刹那。生灭灭坏。方可得有。前后变异。非如是住。得有变异。是故诸行。必定应有。刹那生灭。彼彼众缘。和合有故。如是如是。诸行得生。生已不待。灭坏因缘。自然灭坏。如是所有。变异因缘。能令诸行。转变生起。</strong></p><p>释：所以依着现见增上作意，应该正确地比度，而知色行的刹那生灭变异。如何比度呢？应该这样认知：诸行一定要有刹那的生灭，色行灭坏了，才能观察得到前后的变异，不是一直那样住着保持不变才能知道变异，因此说诸行一定应该有刹那的生灭。因为是众多的因缘和合才能出现的缘故，所以这些诸行才能出生，出生以后不用等诸行灭坏，其和合的因缘灭了，诸行自然就灭坏了。因此说所有的令诸行变异的因缘，能令诸行发生转变。</p><p>比度也就是比量，依现量见的正比度才能有真实的结果，即比度的依据是现量见，是事实，比度的结果才有可能是事实，否则就是不正比度，比度的结果就不真实，不可信赖。</p><p>色行是色法色蕴的运行，色行虽然是现前、现量可见，但是色法的刹那刹那生灭变异，由于禅定力和慧力不足，却不能现前而见，需要依现前如实所见的色行进行正比度。色法不断地生灭灭坏，色法才能存在和显现才有色行，前后变异才能有色行。如果色法不变异，就没有行，则法不存在。所以色行的刹那生灭变异，需要在现量见色的基础上正比度，才能证知正知。</p><p>原文：<strong>此是变异。生起因缘。非是诸行。灭坏因缘。所以者何。由彼诸行。与世现见。灭坏因缘。俱灭坏已。后不相似。生起可得。非彼一切。全不生起。或有诸行。既灭坏已。一切生起。全不可得。如煎水等。最后一切。皆悉消尽。灾火焚烧。器世间已。都无灰烬。乃至余影。亦不可得。彼亦因缘。后后展转。渐减尽故。最后一切。都无所有。不由其火。作如是事。是故变异。由前所说。八种因缘。令变生起。自然灭坏。</strong></p><p>释：这是诸行变异的现象生起的因缘，不是诸行灭坏的因缘。为什么这样说呢？这从诸行与世间可以现见的灭坏因缘都灭坏以后，再也不会有相似法生起这个现象上看得出来，但不是所有的法都不生起。有的诸行灭坏以后，一切法就都不会生起了，比如烧水，越烧越少，直至最后所有的水都消失不见了。</p><p>再比如三灾中的火灾，把器世间都焚烧了以后，连灰烬都不存在了，甚至连影子也看不见了。这也是由于因缘不断变异，使得诸行渐渐减少，直至都灭尽了，最后一切法都不存在了。器世间都灭尽，不是由于火灾的缘故而灭尽的。因此说诸行变异是由于前边说的八种因缘，使得变异现象生起，诸行自然灭坏。</p><p>诸行生起的因缘是法的变异，不是法的灭坏，灭坏以后就没有法，没有诸行了。诸行灭坏也代表无常和苦。</p><p>原文：<strong>如是比度。作意力故。由灭坏行。于彼诸行。刹那生灭。灭坏无常。而得决定。于如是事。得决定已。复于他世。非所现见。诸行生起。应正比度。云何比度。谓诸有情。现有种种。差别可得。或好形色。或恶形色。或上族姓。或下族姓。或富族姓。或贫族姓。或大宗叶。或小宗叶。或长寿命。或短寿命。言或威肃。或不威肃。或性利根。或性钝根。如是一切。有情差别。定由作业。有其差别。方可成立。非无作业。如是有情。色类差别。定由先世。善不善业。造作增长。种种品类。</strong></p><p>释：由于有这样的比度作意力的缘故，从诸灭坏行上，观察诸行刹那生灭，灭坏无常，而得出结论：诸行变异无常。对这些事作出决定以后，又对于前世和后世的诸行不能现见诸行的生起，所以应该正比度。如何比度呢？诸有情现前有种种差别是可以观察得到的，或者有好的相貌，或者有恶的相貌；有的是高贵的家族种姓，有的是低贱的家族种姓；有的是来自于大家族，有的是来自于小家族；有的长寿，有的短寿；有的说话威严冷肃，有的说话不威严冷肃；有的根性比较利，有的根性比较钝。</p><p>如是一切有情差别，一定是由其所作的业行有差别才可以成立，不是没有所作业行。如是有情的色相种类差别，一定是由先世所造作的善业和不善业的缘故，增长互相之间的种种品类差别。</p><p>正比度是根据已心得决定的现见，进行对比思量，如果不是根据现见，其所比对思量为不正比度，不正比度非智慧所摄，正比度获智慧。</p><p>原文：<strong>由彼因缘。于今自体。差别生起。不应自在。变化为因。何以故。若说自在。变化为因。能生诸行。此所生行。为唯用彼。自在为缘。为待余缘。如是自在。方能变化。若唯用彼。自在为缘。是则诸行。与彼自在。俱应本有。何须更生。</strong></p><p>释：由于种种因缘，如今种种诸行的自体差别显现出来了，诸行自体差别的出现，其原因不应该是在于自在变化。为什么这样说？因为如果说自在变化是出生诸行的因，以此因所生的诸行，是只以自体的自在为缘，还是还需要其他的缘，这样的自在才能发生变化？如果是只以自体的自在为缘，那么诸行和其自在都应该是本来而有，既然是本来而有，还需要再出生吗？</p><p>原文：<strong>若言先有。自在体性。然后行生。是则诸行。不唯自在。为缘生起。若言自在。随其所欲。功用祈愿。方能造化。是故亦用。欲为因缘。非唯自在。若尔此欲。为有因耶。为无因耶。若言有因。即用自在。以为因者。此则同前。所说过失。不应道理。若言此欲。更有余因。是则如欲。功用祈愿。离自在外。余法为因。如是亦应。一切诸行。皆用余法。以为其因。何须妄计。无用自在。</strong></p><p>释：如果说原来就有自在体性，然后诸行得生，那么这样的诸行，不是只有以自在为缘生起的。如果说自在能随其所欲，其功能作用需要通过乞求和发愿才能造化诸行，那么诸行也是以欲为因缘出生的，不是只有自在为缘。如果是这样的话，这个欲是有因还是无因出现起用的？如果说是有因，是以自在为因的，这就有与从前所说的有同样的过失，这个理说不通。如果说这个欲的出现还有别的因，那就像欲的功用一样，是通过祈愿而实现的，离开自在还有别的法作为生起的因。如果是这样的话，一切诸行都是以其他的法作为生起的因，如何还会虚妄地计着自在是因？</p><p>原文：<strong>由如是等。比度增上。作意力故。于有他世。诸行生起。获得决定。如是略由。三种增上。作意力故。寻思观察。内外诸行。是无常性。谓净信增上。作意力故。现见增上。作意力故。比度增上。作意力故。于前所举。能随顺修。无常五行。已辩变异。灭坏二行。</strong></p><p>释：由以上这些比度增上作意力的缘故，对于有前世和后世诸行的生起这件事，就会生起决定心和确定心。大略地由三种增上作意力，能寻思观察出内外诸行是无常性的，三种增上作意力分别是：净信增上作意力、现见增上作意力和比度增上作意力。对于前边所列举出的内外诸行，能够随顺修习五种无常行。以上就对变异和灭坏两种行辨别完毕。</p><p>当需要观行前世和后世的五蕴无常的时候，需要以现世对五蕴如实现量观行的基础上，正比度观行前世和后世的五蕴，以获得证知，所比度的二法应该是同类，非同类法则不能比度。以对当前的五蕴如实现量观行的基础上，可以正比度观行已经过去的五蕴，以及以后将会出现的五蕴，这样可以获得证知，对诸行无常能够心得决定，得以确认。</p><p>原文：<strong>云何复由。别离行故。观无常性。谓依内外。二种别离。应知诸行。是无常性。依内别离。无常性者。谓如有一。先为他主。非奴非使。能自受用。能驱役他。作诸事业。彼于后时。退失主性。非奴使性。转得他奴。及所使性。于主性等。名为别离。无常之性。</strong></p><p>释：如何又由别离行来观察无常性？依着内外二种别离，应该知道诸行是无常性的。依着内别离无常性的意思是说，如果有一个人先前是别人的主人，他自己不是别人的奴隶和走使，自己能完全作主，也能驱使别人作诸事业。这个人后来不再当主人了，退失了主人之性，和非奴隶走使之性，转而变为别人的奴隶和走使之性，那么这个人对于主人之性等等，名为别离无常之性。</p><p>原文：<strong>依外别离。无常性者。谓现前有。资生财宝。先未变异。未为别离。无常灭坏。后时为王。盗贼非爱。及共财等。之所劫夺。或由恶作。加行失坏。或方便求。而不能得。如是等类。应知是名。由别离行。知无常性。</strong></p><p>释：依着外别离无常性的意思是说，现前有可以资生的财宝，先前并没有发生变异，财宝还没有别离，没有无常变坏，后来就被国王没收了，被盗贼盗走了，被不是亲爱的人所劫夺了，成为别人的共同财产而流失了，或者是由于强力蛮力而弄坏了，或者是再想方便地求取而不能得到了。从这些现象上就应该知道，这叫作由别离行知无常性。</p><p>原文：<strong>云何复由。法性行故。观无常性。谓即所有。变异无常。灭坏无常。别离无常。于现在世。犹未合会。于未来世。当有法性。如实通达。如是诸行。于未来世。当有法性。如是等类。名为通达。法性无常。</strong></p><p><strong>云何复由。合会行故。观无常性。谓即如是。变异无常。灭坏无常。别离无常。于现在世。合会现前。如实通达。如是诸行。于现在世。现前合会。如是等类。名为通达。合会无常。彼于如是。内外诸行。五无常性。由五种行。如其所应。作意修习。多修习故。获得决定。</strong></p><p>释：如何再由法性之行来观察无常性？对于所有变异无常、灭坏无常、别离无常在现在世还没有合会，在未来世应当出现的法性，能够如实通达。这些诸行，在未来世应当出现的法性，像这些等类，就名为通达法性无常。</p><p>如何再由和会行来观察无常性？如是变异无常、灭坏无常、别离无常，在现在世和会现前如实通达。如是诸行在现在世现前和会，像这样等类，名为通达和会无常。对于如是内外诸行的五种无常性，由五种行，如其所应该作的那样作意修习。由于多多修习的缘故，于无常性心就获得决定。</p><p>原文：<strong>如是由证成道理。及修增上故。于无常行。得决定已。从此无间。趣入苦行。作是思惟。如是诸行。皆是无常。是无常故。决定应是。有生法性。如是诸行。既是生法。即有生苦。既有生苦。当知亦有。老病死苦。怨憎会苦。爱别离苦。求不得苦。如是且由。不可爱行。趣入苦行。如是复于。有漏有取。能顺乐受。一切蕴中。由结缚行。趣入苦行。</strong></p><p>释：如是由实证之理，以及修行增上的缘故，心中对于无常性已经心得决定，从此以后就会无间断地趣入苦行的修行过程中。在修习苦行时，这样思惟：这些诸行都是无常，因为是无常的缘故，决定应该是有出生的法性，这些诸行既然是生法，就有生苦，既然有生苦，当知也有老病死苦、怨憎会苦、爱别离苦、求不得苦。这样暂且由不可爱行，进入到苦行的修习阶段，再在有漏的有所取着的，能够随顺乐受的一切蕴中，由观察结缚行，进入苦行的修习阶段。</p><p>通过观行证得诸行无常以后，心就会无间断地思惟三苦、八苦，趣入苦行。无间断地趣入苦行，就是意根与意识同时对于无常法心得决定，确认诸行无常，再共同证得诸行是苦。</p><p>原文：<strong>所以者何。以于爱等结处。生爱等结。于贪等缚处。生贪等缚。便能招集。生老病死。愁悲忧苦。一切扰恼。纯大苦蕴。如是复于。有漏有取。顺非苦乐。一切蕴中。由不安隐行。趣入苦行。所以者何。有漏有取。顺非苦乐。一切诸蕴。粗重俱行。苦乐种子。之所随逐。苦苦坏苦。不解脱故。一切皆是。无常灭法。</strong></p><p>释：为什么这样说？因为在爱等结缚处生出爱等结缚，在贪等结缚处生出贪等结缚，就会招集生老病死忧悲愁苦，一切忧恼纯大苦就聚集起来了。如是再在有漏的，有所取着的，随顺非苦非乐受的一切蕴中，由不安稳行，进入苦行的修习中。为什么这样说？因为有漏有取的，随顺非苦非乐受的一切诸蕴，与粗重烦恼共同运行，是苦乐种子所随逐之处，因为苦苦和坏苦是不解脱的缘故，一切法都是无常的生灭法。</p><p>原文：<strong>如是行者。于能随顺。乐受诸行。及乐受中。由结缚行。趣入坏苦。于能随顺。苦受诸行。及苦受中。由不可爱行。趣入苦苦。于能随顺。不苦不乐受诸行。及不苦不乐受中。由不安隐行。趣入行苦。如是由结缚行。不可爱行。不安隐行。增上力故。于三受中。作如是说。诸所有受。皆悉是苦。如是名为。由无常行。作意为先。趣入苦行。</strong></p><p>释：如是瑜伽行者，在能随顺乐受的诸行，及乐受中，由观察结缚行，进入观察坏苦行；在能随顺苦受诸行，以及苦受中，由观察不可爱行，进入观察苦苦行；在能随顺不苦不乐受诸行，以及不苦不乐受中，由观察不安稳行，进入观察行苦。如是由观察结缚行、不可爱行、不安稳行增上作意力的缘故，在三种受中得出这样的结论：诸所有受悉皆是苦。这叫作由无常行开始作意，是为了先进入苦行的观察中。</p><p>原文：<strong>复作是念。我于今者。唯有诸根。唯有境界。唯有从彼。所生诸受。唯有其心。唯有假名。我我所法。唯有其见。唯有假立。此中可得。除此更无。若过若增。如是唯有。诸蕴可得。于诸蕴中。无有常恒。坚住主宰。或说为我。或说有情。或复于此。说为生者。老者病者。及以死者。或复说彼。能造诸业。能受种种。果及异熟。由是诸行。皆悉是空。无有我故。如是名为。由无所得行。趣入空行。</strong></p><p>释：瑜伽行者又有这样的念想：我现在只有诸根，只有境界，只有从根境相触中所出生的诸受，只有能感受的心，只有假名的我和我所有的法，只有知见，只有假立之法可得，除此再也没有超过于此的更多的法了。同样地，我只有诸蕴可得，在诸蕴中没有常恒、坚住的主宰，或者说我是我，或者说为是有情，或者再把这些法说为是生者、老者、病者以及死者，或者说诸蕴能造诸业，能受种种果以及异熟生。由此道理显示出，诸行皆悉是空，其中没有我。如是名为，由无所得行趣入空行。</p><p>原文：<strong>复作是念。所有诸行。与其自相。及无常相。苦相相应。彼亦一切。从缘生故。不得自在。不自在故。皆非是我。如是名为。由不自在行。入无我行。如是行者。以其十行。摄于四行。复以四行。了苦谛相。谓无常行。五行所摄。一变异行。二灭坏行。三别离行。四法性行。五合会行。苦行三行所摄。一结缚行。二不可爱行。三不安隐行。空行一行所摄。谓无所得行。无我行一行所摄。谓不自在行。彼由十行。悟入四行。</strong></p><p>释：行者又有这样的念想：所有诸行与其自体相，以及无常相、苦相相应，诸行也都是从缘而生，所以不得自在，不自在的缘故都不是我，如是名为由不自在行进入无我行。如是行者以其十种行，摄受四种行，又以四种行明了苦谛相：无常行由五种行所摄：一是变异行，二是灭坏行，三是别离行，四是法性行，五是和会行。苦行是由三种行所摄：一是结缚行，二是不可爱行，三是不安稳行。空行是由一种行所摄受，就是无所得行。无我行是由一种行所摄受，就是不自在行。行者们由这十种行悟入四种行。</p></div>"
},{
    "title": "第二章 如何明了集、灭、道谛相",
    "author": "生如法师",
    "date": "2022年09月22日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  如何明了集、灭、道谛相</strong></p><p>修习四圣谛十六行，能明了四圣谛相。由无常、苦、空、无我四种行明了苦谛相；由因、集、起、缘四种行明了集谛相；由灭、静、妙、离四种行明了灭谛相；由道、如、行、出四种行明了道谛相。其中由十种行观察苦谛，悟入苦谛四种行已经讲过了，下面讲如何修习集谛四种行明了集谛相。</p><p>原文：<strong>复由四行。于苦谛相。正觉了已。次复观察。如是苦谛。何因何集。何起何缘。由断彼故。苦亦随断。如是即以。集谛四行。了集谛相。谓了知爱。能引苦故。说名为因。既引苦已。复能招集。令其生故。说名为集。既生苦已。令彼起故。说名为起。复于当来。诸苦种子。能摄受故。次第招引。诸苦集故。说名为缘。</strong></p><p>释：由苦空无常无我四种行，对于苦谛相如实无缪地觉悟以后，再次观察这些苦谛出现的因是什么，苦是如何集聚起来的，苦是如何生起的，苦是依什么缘出现的。只有断除这因、集、起、缘四种行，苦就会随之断除。因此就要观察集谛四种行来断除集谛相。了知爱能引生苦，就说爱是苦因。把苦引出来以后，又能招集起来，令苦出生，就说为苦集。苦生出来以后，令苦受现起，说名为起。又能摄受未来世的诸苦种子，次第招引诸苦集，就说名为缘。</p><p>原文：<strong>复有差别。谓了知爱。是取因故。复能招集。即以其取。为因有故。复能生起。有为上首。当来生故。又能引发。以生为缘。老病死等。诸苦法故。随其所应。当知说名。因集起缘。</strong></p><p>释：四种行之间又有差别，次第不同，了知爱是取的因，爱又能继续招集，取又成为后世有的因，从而能生起后世的有，以有为缘后世五阴出生，又能引发以生为缘的老病死等等诸大苦聚。根据四种行的次第，就分别说为：因、集、起、缘。</p><p>集谛的因是爱，因为有爱，就会产生取，不管取得还是没有取得，都有苦相，后世的有产生出来以后，生相出现，苦相就出现了。只有断除了苦的根源贪爱，才能断除苦。爱的因是受，受的因是触，可以有触和受，但在触和受的时候，没有贪爱，无心于所触所受，就不会有后世的苦出现，集谛就灭。既然现在的爱是引发苦的因，爱的集起能令苦出生，爱集就是苦集。苦生以后，苦受现起，这叫作苦起。由于爱能摄受未来的苦种子，爱所招集的都是苦种子，能生未来的苦，爱、取、有、生、老次第招引诸苦的集起，所以爱是苦的缘。</p><p>集谛属于十二因缘中的一个环节，解脱之道，声闻法与缘觉法互相含摄，都有共通之处，没有独立的缘觉法，也没有独立的声闻法，只不过二种法涉及到的层次深浅有差别而已，而解脱无别。</p><p>原文：<strong>复有差别。谓正了知。烦恼随眠。附属所依。爱随眠等。是当来世。后有生因。又正了知。彼所生缠。随其所应。是集起缘。谓后有爱。能招引故。即是其集。此后有爱。复能发起。喜贪俱行爱。此喜贪俱行爱。复与多种。彼彼喜爱为缘。如是依止。爱随眠等。及三种缠。能生后有。及能发起。诸爱差别。是故说名。因集起缘。如是行者。由四种行。了集谛相。</strong></p><p>释：四种行还有差别，正确如实了知烦恼随眠是附属于爱随眠的，依止于爱随眠才有烦恼随眠，没有爱就没有烦恼，爱也是烦恼的因，断爱即断烦恼，而爱随眠是未来世三有出生之因；正确了知爱随眠所生出的烦恼缠缚，与其一一相应的是集、起和缘三行，烦恼缠缚能集起苦种子，能让苦现行出来，是产生苦受的缘。</p><p>因为烦恼随眠能招引后有之爱的缘故，所以烦恼随眠能集聚后有之爱，又能发起与喜和贪共同运行的爱，此喜贪俱行爱又能成为种种喜爱的缘。像这样依止爱随眠等等，以及三种缠缚，能出生后世的有，以及能发起种种爱的差别相，因此就说为因、集、起、缘四种行。因为有爱随眠，就会有烦恼缠缚，喜缠缚和贪缠缚，有这三种缠缚，后世的有肯定会出生，有出生，苦就会出生，这样行者就由四种行明了了集谛相。</p><p>原文：<strong>于集谛相。正觉了已。复正觉了。如是集谛。无余息灭。故名为灭。一切苦谛。无余寂静。故名为静。即此灭静。是第一故。是最胜故。是无上故。说名为妙。是常住故。永出离故。说名为离。如是行者。由四种行。了灭谛相。</strong></p><p>释：对于集谛相正确如实明了觉悟以后，还要再正确如实觉悟灭谛四种行。当集谛完全灭尽息灭时，就名为灭，集谛不再集起了，苦就灭。一切苦谛灭了再也没有余苦了，这时就寂静了，没有五蕴造作也没有五蕴受苦了，名为静。这样苦谛息灭寂静了，在世间是第一的，是最胜的，是无上的，就说为妙。苦谛息灭以后无余苦，苦不会再生出来了，这样的状态是永远存在的，永远出离了苦，就说为离。这样瑜伽行者就由灭、静、妙、离四种行明了了灭谛相。</p><p>由灭、静、妙、离四种行明了灭谛相。苦灭是因为集灭了，不再集起苦行，五蕴身的身口意行都是苦行，尤其是恶和不善的身口意行，心不攀缘五蕴世间法，就不再集苦，就得寂静了。心得寂静以后，就自在解脱了，这在世间里就是奇妙美妙的，因为世间里普遍都是攀缘和苦，不寂静不自在不解脱，所以生命不妙。解脱自在的生命在世间里是第一殊胜最殊胜的，所以美妙。灭了苦解脱以后，不会再有苦受了，解脱是永远解脱，不会再退回无明烦恼境界中，永远离苦，所以叫作离。这样灭谛相就由灭、静、妙、离四种行，很清晰地显示出来了。</p><p>原文：<strong>于灭谛相，正觉了已。复正觉了，真对治道。于所知境。能通寻求义故。能实寻求义故。由于四门，随转义故。一向能趣。涅槃义故。所以说名。道如行出。如是行者。由四种行。了道谛相。如是名为。于四圣谛。自内现观。了相作意。</strong></p><p>释：行者对于灭谛相如实正确觉悟以后，最后还要如实正确地觉悟真正地为对治苦所修的道，才能灭苦得解脱。对于所知境，能够普遍地寻求其真实义，能够如实寻求其真实义故，名为如。在修道过程中，其身口意诸行能够随顺于四圣谛理，不断转变清净，名为行。修道之后，心行渐寂渐灭，趣向涅槃，出离生死，名为出。这样瑜伽行者就由道、如、行、出四种行，明了了道谛相。这才叫作于四圣谛从内心里现观的了相作意。</p><p>真对治道是指什么？道是指方式、方法、路径，对治是指对治心中贪嗔痴无明烦恼，无明是不知苦，不知苦集，因此就要对治此不知，变成知，若无无明则不需对治。为了灭苦、断集而修的道，名为道，灭苦的过程就是修道，修戒定慧、三十七道品，思惟观行四圣谛。这是道行。</p><p>如行，是令心与苦空无常无我的真理、法理相应，对于所知境四圣谛法，能通达地深深地思惟其真实理，能如实地思惟观行其法理，了达所知境的内涵正理，从而证得四圣谛真理。行行，在如行断无明的基础上，心行转变，其所有心行随顺于所认知的真理，不与苦空无常无我真实理相违背。出行，通过修道，断除烦恼，身口意行清净，不再攀缘五蕴世间，寂静无为，身心解脱，趣向于涅槃，与涅槃相应，出离三界，解脱生死轮回苦。</p><p>由道、如、行、出四种行明了道谛。由以上四种行可知，在修道的过程中，戒定慧增长，对五蕴世间的认知契合真实理，无明转薄，烦恼转轻，心行不与圣道相违，身心世界逐渐转变，清净到一定程度，与道相应，与圣贤相应，就证得圣道。非是在证果之后才开始慢慢转变身心，若不转变身心到与圣贤相应，就不能成为圣贤。就如学生考试，若不合格，就不能入学，其理相同。</p></div>"
},{
    "title": "第三章 法智、类智和现观智",
    "author": "生如法师",
    "date": "2022年09月22日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  法智、类智和现观智</strong></p><p>原文：<strong>彼既如是。于其自内。现见诸蕴。依诸谛理。无倒寻思。正观察已。复于所余。不同分界。不现见蕴。比度观察。谓彼所有。有为有漏。遍一切处。遍一切种。于一切时。皆有如是法。皆堕如是理。皆有如是性。彼所有灭。皆永寂静。常住安乐。彼所有道。皆能永断。究竟出离。</strong></p><p>释：瑜伽行者既然能像这样对于自己的内身现前观见五蕴，依据四圣谛理没有颠倒地寻思，正确地观察以后，再对于其他不同的分界不能现前观察的五蕴，进行比度观察。五蕴中所有的有为法有漏法，遍一切处遍一切种子，在一切时都与现前所观察到的法一样，都摄属于四圣谛理之中，都是苦空无常无我的性质。这些法都是生灭的，灭掉之后都是永远寂静的，寂静以后都是永远常住的、安乐的，世间所有的道都能永远断灭，究竟出离世间苦。</p><p>原文：<strong>当知此中。若于现见。诸蕴谛智。若于所余。不同分界。不现见境。比度谛智。即是能生。法智类智。种子依处。</strong></p><p>释：在这些法的观察当中，如果对于现前存在的五蕴能够如实观察，现量见证四圣谛真实理，就会出生法智，是法智种子的所依之处。如果在除了现前所存在的法之外的所余的不是现前所存在的五蕴法，进行比度观察出生了见证智慧，就是类智，是类智种子的所依处。</p><p>这里讲了证法的两种方式，一是对当前存在的五蕴的如实观察，二是对非当前存在的五蕴的比度观察，两种观察都能获得谛智。非当前存在的五蕴是指什么呢？这是指当下此刻之前和之后的五蕴，如果今天的五蕴是现前的，那么昨天以前的五蕴和明天以后的五蕴就是非当下的五蕴，与当下的五蕴有个分界，时间点不同，但五蕴的性质和特征是相同的，是同类，有共同性，有可比性。</p><p>如果今年的五蕴是当下的五蕴，去年以前的五蕴和明年以后的五蕴就是非当下的五蕴；如果今世的五蕴是现前的五蕴，前世和后世的五蕴就是非现前可见的五蕴。以此类推，三大阿僧祇劫的五蕴都与当前的五蕴有相同的属性，或者说从无始劫以前直至无始劫以后的五蕴都有共同的属性和性质、特征，都是同类，都有可比性。</p><p>正比度能出生法智和类智，在对现前存在的五蕴正确如实观察的基础上，再比度观察非现前存在的其余五蕴，就能出生法智和类智，获得见道的无生智。分界是指过去和未来不同时期的法与当下的法的界限和分割。法与法有了界限，观察法的方式就不同，获得智慧的种类也不同。能现见的法是现量观察，不能现见的法就比度观察，观察正确如实了，就会获得谛智和无生忍。</p><p>原文：<strong>又即如是。了相作意。当知犹为。闻思间杂。若观行者。于诸谛中。如是数数。正观察故。由十六行。于四圣谛。证成道理。已得决定。复于诸谛。尽所有性。如所有性。超过闻思。间杂作意。一向发起。修行胜解。此则名为。胜解作意。如是作意。唯缘谛境。一向在定。于此修习多修习故。于苦集二谛境中。得无边际智。</strong></p><p>释：以上讲的这些了相作意，仍然属于间杂的闻思智慧，如果观行者在四圣谛中，像这样不断地正观察，就会由十六行对于四圣谛的证成道理，已经心得决定。又对于四圣谛的尽所有性和如所有性，超过了间杂的闻思作意，一直在发起修行胜解，名为胜解作意。这样的作意，只缘真实境界，一直在定中，对于胜解作意修习并且勤于修习的缘故，在苦谛和集谛两种境界中，就获得无边际智。</p><p>在对四圣谛心得决定之前的了相作意，参杂着闻思，并不纯是正观察，也不是无间断地观察。如果能够无间断地正观察，才能对四圣谛心得决定。心得决定之后，才能胜解，胜解之后才能证。四圣谛的尽所有性，是指四圣谛所覆盖的范围，如所有性是指符合四圣谛理的所有性。如果观察是无间断地正观察，就能超过间杂的闻思阶段，这时候能发起对四圣谛的胜解，叫作胜解作意。如果能一直保持禅定，禅定不失，心只缘四圣谛，没有他缘，这样的作意观察就能获得无边际智。</p><p>原文：<strong>由此智故。了知无常。发起无常无边际胜解。如是了知苦等。发起苦无边际胜解。空无我无边际胜解。恶行无边际胜解。往恶趣无边际胜解。兴衰无边际胜解。及老病死愁悲忧苦。一切扰恼无边际胜解。</strong></p><p>释：由于有无边际智的缘故，了知诸行无常，发起对于无常法的无边际胜解。像这样了知了苦空无常无我等等，就发起了苦无边际胜解、空和无我无边际胜解、恶行无边际胜解、往恶趣无边际胜解、兴衰无边际胜解、以及老病死忧悲苦恼一切忧恼无边际胜解。</p><p>原文：<strong>此中无边际者。谓生死流转。如是诸法。无边无际。乃至生死。流转不绝。常有如是。所说诸法。唯有生死。无余息灭。此可息灭。更无有余。息灭方便。即于如是。诸有诸趣。死生法中。以无愿行。无所依行。深厌逆行。发起胜解。精勤修习。胜解作意。</strong></p><p>释：无边际的意思是，生死流转这样的诸法无边无际，以至于生死流转不断绝。以上所说的诸法虽然是常有的，但是只有生死是可以息灭，再也没有遗余的。这个可以息灭之法，再也没有其余的息灭方便法。在如是这些三有六道的生死法中，以无愿行、无所依行、深深地厌逆行，发起胜解，精勤地修习胜解作意。</p><p>原文：<strong>复于如是。诸有诸生。增上意乐。深心厌怖。及于涅槃。随起一行。深心愿乐。彼于长夜。其心爱乐。世间色声香味触等。为诸色声香味触等。滋长积集。由是因缘。虽于涅槃。。深心愿乐。而复于彼。不能趣入。不能证净。不能安住。不能胜解。其心退转。于寂静界。未能深心。生希仰故。有疑虑故。其心数数。厌离惊怖。虽于一切。苦集二谛。数数深心。厌离惊怖。及于涅槃。数数发起。深心愿乐。然犹未能。深心趣入。</strong></p><p>释：又对于以上所说的这些诸有诸生死法的增上意乐，从内心深处生厌和怖畏，对于涅槃所生起的任意一种行，都从内心深处有乐愿。行者曾于生死长夜中，内心爱乐世间里的色声香味触等法，为了这些色声香味触等法滋长和积集苦谛。</p><p>由于这个因缘，虽然现在能深心愿乐涅槃，而不能趣入涅槃，不能证得清净法眼，不能安住四圣谛中，也不能胜解四圣谛。其心就从寂静界中退转了，因为没有能够从深心里生出对涅槃的希冀和景仰的缘故，因为心中有疑虑的缘故，就会一次次地厌离和恐怖生死。这样的人虽然在一切的苦谛和集谛的修习中，多次地深心厌离和惊怖生死，对于涅槃多次地发起深心的愿乐，然而还是不能深心地趣入涅槃。</p><p>原文：<strong>何以故。以彼犹有。能障现观。粗品我慢。随入作意。间无间转。作是思惟。我于生死。曾久流转。我于生死。当复流转。我于涅槃。当能趣入。我为涅槃。修诸善法。我能观苦。真实是苦。我能观集。真实是集。我能观灭。真实是灭。我能观道。真实是道。我能观空。真实是空。我观无愿。真是无愿。我观无相。。真是无相。如是诸法。是我所有。</strong></p><p>释：为什么深心厌怖生死愿乐涅槃，却不能趣入涅槃，甚至都不能胜解和安住涅槃之法？因为行者还有能障碍现量观行的粗的我慢，随着观行的深入生起有间断或者是无间断的作意，心中这样思惟：我曾经长久地流转于生死之中；我在生死中还要继续流转；我将来会趣入涅槃；我为了涅槃修习诸善法；我能观察苦谛真实是苦的；我能观察集谛真实是集起的；我能观察灭谛真实会灭；我能观察道谛真实是道；我能观察空真实是空；我能观察无愿真是无愿，我观察无相真是无相；如是诸法是我所具有的。</p><p>原文：<strong>由是因缘。虽于涅槃。深心愿乐。然心于彼。不能趣入。彼既了知。如是我慢。。是障碍已。便能速疾。以慧通达。弃舍任运。随转作意。制伏一切。外所知境。趣入作意。随作意行。专精无间。观察圣谛。随所生起。心谢灭时。无间生心。作意观察。方便流注。无有间断。彼既如是。以心缘心。专精无替。便能令彼。随入作意。障碍现观。粗品我慢。无容得生。</strong></p><p>释：由于行者心中有这些观念，虽然他对于涅槃能深心爱乐，但是心却不能趣入涅槃，因为粗重的我慢有遮障作用。行者了知以上这些我慢是趣入涅槃的障碍以后，就能迅速地以智慧通达，从而去除我慢遮障，便舍弃了从前的任心随意出生的我慢，随后运转作意，制伏住了心所触的一切外境，转入观行作意，随作意而转，一心精勤无间断地观察四圣谛。随着所生起的我慢心的灭去，心生起在无间断地作意观察上，心识无间断地流注在观察四圣谛中。行者如是以智慧心缘于无间作意，专心精进旁无他顾，浸染于四圣谛作意中，这样障碍现量观行的粗重我慢就没有机会生出来了。</p><p>原文：<strong>如是勤修。瑜伽行者。观心相续。展转别异。新新而生。或增或减。暂时而有。率尔现前。前后变易。是无常性。观心相续。入取蕴摄。是为苦性。观心相续。离第二法。是为空性。观心相续。从众缘生。不得自在。是无我性。如是名为。悟入苦谛。</strong></p><p>释：像这样精勤地修习瑜伽的行者，观察自心相续不断地流转变异，心里新出生一种法，下一秒又新出生另一种法，不断地改变，其心意有时增加有时减少，都是暂时而有，刹那现前，过后就变，这样前后变易的心是无常性的。再观自心相续不断，有所取着，是被取蕴所摄受着，这是苦性的。再观自心相续不断，心却不属于任何一种法，因为其心是空的，是为空性。再观察自心相续不断，是从众多因缘和合而生，不得自在，因此是无我性。这样就叫作悟入苦谛，无常、苦、空、无我，名为苦谛。</p><p>原文：<strong>次复观察。此心相续。以爱为因。以爱为集。以爱为起。以爱为缘。如是名为。悟入集谛。次复观察。此心相续。所有择灭。是永灭性。是永静性。是永妙性。是永离性。如是名为。悟入灭谛。次复观察。此心相续。究竟对治。趣灭之道。是真道性。是真如性。是真行性。是真出性。如是名为。悟入道谛。</strong></p><p>释：再次观察此心相续不断，是以爱为因，以爱为集，以爱为起，以爱为缘，观察到这个理就名为悟入集谛。再次观察此心相续不断，所有拣择出的生灭法都是具有永远灭尽性，永远寂静性，永远微妙性，永远离性，如是名为悟入灭谛。再次观察此心相续不断，能够彻底地对治一切烦恼。趣向寂灭之道是真的道性，是真的如性，是真的行性，是真的出离性，如是名为悟入道谛。</p><p>原文：<strong>如是先来。未善观察。今善作意。方便观察。以微妙慧。于四圣谛。能正悟入。即于此慧。亲近修习。多修习故。能缘所缘。平等平等。正智得生。由此生故。能断障碍。爱乐涅槃。所有粗品。现行我慢。</strong></p><p>释：从前还没有好好地观察四圣谛，现在就要善于作意作以方便观察，以微妙的智慧，于四圣谛理能正确如实地悟入。由于能够亲近和修习，多多地修习此种微妙的观察智慧的缘故，能缘智和所缘的法平等平等，正智才得以出生。由于出生了正智，就断除了障碍爱乐涅槃的所有的粗重的现行我慢。</p><p>原文：<strong>又于涅槃。深心愿乐。速能趣入。心无退转。离诸怖畏。摄受增上。意乐适悦。如是行者。于诸圣谛。下忍所摄。能缘所缘平等。平等智生。是名为暖。中忍所摄。能缘所缘平等。平等智生。是名为顶。上忍所摄。能缘所缘平等。平等智生。名谛顺忍。</strong></p><p>释：又对于涅槃深心爱乐，能迅速地趣入，心不退转，离开一切怖畏，内心生起增上意乐，舒适愉悦。这样修行的行者在四圣谛的修习过程中，属于下忍位所摄。能缘的心和所缘的法平等，平等智出生了，名为暖位，属于中忍位所摄。能缘的心和所缘的法平等，平等智出生，名为顶，属于上忍所摄。能缘的心和所缘的法平等，平等智出生，名为谛顺忍。</p><p>这里把对涅槃的安忍分为上中下三品，下品忍处于四加行中的暖位，中品忍处于四加行中的顶位，上忍也叫作谛顺忍，处于四加行中的忍位。处于暖位的行者，心就能趣向于涅槃，对于涅槃法的修习心无退转了，因为对涅槃法生起了增上意乐，离开了怖畏，有了功德受用，那么在后边的一切修习过程中都不会退转了，乃至于断我见得初果之后，更不会退转于涅槃之道。在四加行位的功德受用，与初果的功德受用差别很大，初果与二果，乃至于二果与三果四果的功德受用，差别都很大，所以不要误会功德受用，不要把四加行的功德受用，误会为是初果二果的功德受用，从而出现未证言证的大妄语。</p><p>原文：<strong>彼既如是。断能障碍。粗品我慢。及于涅槃。摄受增上。意乐适悦。便能舍离。后后观心。所有加行。住无加行。无分别心。彼于尔时。其心似灭。而非实灭。似无所缘。而非无缘。又于尔时。其心寂静。虽似远离。而非远离。又于尔时，非美睡眠。之所覆盖。唯有分明。无高无下。奢摩他行。</strong></p><p>释：行者修习至此，能断除障碍观行的粗重我慢，对于涅槃更进一步产生出增上意乐和愉悦快乐，这样就能舍离后续观心的所有加行，住在没有加行的无分别心中。这时候，行者的心好像是灭了而其实还没有灭，好像是没有什么攀缘了而并非没有攀缘。行者又在某时其心寂静，虽然好像是远离了六尘境界而实未曾远离。行者在这时候心还有睡眠盖障，睡眠还没有不为轻而香美无梦，只有非常分明的没有高下的奢摩他行。</p><p>修习瑜伽的行者，在断除了障碍现观的粗重我慢，对涅槃生起增上意乐之后，不用再努力地作加行功夫了，这时候感觉心好像没有分别了，好像是灭了，其实还没有灭，心里好像什么也不想了，其实是有想，感觉心里好像远离了尘境，其实还没有远离，并且这时候睡眠盖障并没有消除，睡眠还很沉重，未得清明，只有分明的无相心，不取法之高下，住于禅定中，不观四念处四圣谛。</p><p>原文：<strong>复有一类。闇昧愚痴。于美睡眠。之所覆盖。其心似灭。非实灭中。起增上慢。谓为现观。此不如是。既得如是。趣现观心。不久当入。正性离生。即于如是。寂静心位。最后一念。无分别心。从此无间。于前所观。诸圣谛理。起内作意。此即名为。世第一法。从此已后。出世心生。非世间心。此是世间。诸行最后。界畔边际。是故名为。世第一法。</strong></p><p>释：又有一类人昏昧愚痴，被香美的睡眠所覆盖，其心好像是灭了，其实并不是真灭了，于是就生起了增上慢，认为这就是现量观察，实则不是。此人既然已经获得了这样的趣向现量观察的心，不久以后就应当能入到正性离生中。在这样其心似灭非灭的寂静心位中，有最后一念无分别心，再以后就会无间断地对于前边所观的四圣谛理，生起内在作意，这叫作世第一法。从此以后出世间的心就生起来了，再也没有世间心了，这是世间诸行中最后的界限边际，因此名为世第一法。</p><p>这一段文很重要，讲述的是证道之前的最后阶段的心理状态，以及证道之前的最后修习方法，也揭示了世第一法与证道之间的差别相。在证道之前，处于四加行位的最后一位世第一法位，在此位中，睡眠盖障变得轻微了，以至于睡眠很轻微，也很清明，处于半睡半醒之间，睡眠中心很清明，不昏昧，身体很舒适，因此对于修道遮障很小。心好像是灭了，没有分别了，但还是有分别性，并没有灭，只是了别轻微，似有似无。于是愚痴蒙昧的人就生起了增上慢，觉得自己是无心了，有了现观了，实际不是。</p><p>但是却离现观不远了，如果继续精进，不久就会证入离开生死的正位，也就是在这样的寂静心位中，还有最后一念无分别心，以此一念无分别心，从此以后就会无间断地对从前所观行的四圣谛理，生起内在的作意，这就名为世间第一法。从此以后，就生起了出世间的心，世间心就断了灭了，这是世间里诸行最后的与出世间的界限和边畔，以此叫作世间第一。</p><p>原文：<strong>从此无间。于前所观。诸圣谛理。起内作意。作意无间。随前次第。所观诸谛。若是现见。若非现见。诸圣谛中。如其次第。有无分别。决定智现见智生。由此生故。三界所系。见道所断。附属所依。诸烦恼品。一切粗重。皆悉永断。</strong></p><p>释：从此无间断地对于从前所观行的四圣谛理，生起内在作意，作意不间断，随同从前次第所观行的四圣谛，或者是现量所见，或者是非现量所见的四圣谛中，随同其次第，是有是无加以分别之后，决定智和现见智就出生了。决定智和现见智出生之后，三界所系缚的，见道所断除的，附属于心所依止的，所有的烦恼品类中一切粗重部分，全部都永远断除了。</p><p>这段讲见道部分了，四加行之后，再无间断地作意观察，就会有智慧出生，作出决定，确认四圣谛苦集灭道之理，同时现量见法智出生，就断我见证初果了。见道证初果的同时，一切粗重的烦恼就全部都永远断除，不再生起了。所以如果有人粗重烦恼还存在着，烦恼看似还比较重，那就说明还没有见道证初果，由此可见，一个人的身口意行的表现足以说明他是否见道。外表看身口意行比较清净的，不一定是见道了，但见道的人身口意行一定是清净的，没有粗重烦恼的。</p><p>原文：<strong>此永断故。若先已离。欲界贪者。彼于今时。既入如是。谛现观已。得不还果。彼与前说。离欲者相。当知无异。然于此中。少有差别。谓当受化生。即于彼处。当般涅槃。不复还来。生此世间。若先倍离。欲界贪者。彼于今时。既入如是。谛现观已。得一来果。若先未离。欲界贪者。彼于今时。既入如是。谛现观已。粗重永息。得预流果。</strong></p><p>释：由于粗重烦恼永远断除的缘故，如果先前已经离开了欲界贪爱的人，在如今之时，既然已经悟入了如是四圣谛现量观行以后，就获得了三果不还果。此人与前边所说的离欲者的相貌，应该知道是没有差异的。但是二者之间还是稍微有一些差别，那就是后世要在五不还天受化生的三果人，就在即将受生处直接入涅槃，不再来此世间受生了。</p><p>如果是先前接近于离开欲界贪爱的人，已经断除部分欲界贪爱的人，在这时候，既然已经获得了如是四圣谛现量观行以后，就获得二果一来果。如果先前还没有离开欲界贪爱的人，在如今之时，既然已经获得四圣谛现量观行以后，粗重的烦恼就永远息灭了，获得初果。</p><p>根据以上弥勒菩萨的讲述，证得初果虽然还没有离欲界贪，但是粗重的烦恼是要永远断除息灭的，细微的烦恼仍然存在，待以后的修行再逐渐断除息灭，直至四果断尽一切现行烦恼。虽然初果到四果都能够对四圣谛进行现量观行，但因其在福德、烦恼、禅定和观行智慧等方面有差别，获得的智慧就有差别，果位就有差别。</p><p>三果人断除了欲界贪爱烦恼，有能力在受生处或者是在中阴身直接取得无余涅槃，那就是断除烦恼的心解脱圣者。初果和二果还有不同的欲界贪，心不解脱欲界，所以就不是心解脱的圣者，而是属于贤人。</p><p>原文：<strong>由能知智。与所知境。和合无乖。现前观察。故名现观。如刹帝利与刹帝利。和合无乖。现前观察。名为现观。婆罗门等。当知亦尔。此亦成就。众多相状。谓证如是。谛现观故。获得四智。谓于一切若行。若住诸作意中。善推求故。得唯法智。得非断智。得非常智。得缘生行。如幻事智。</strong></p><p>释：由能知真谛法的智慧，与所知的四圣谛理和合一起，二者没有乖离，这样的现前观察，就叫作现观。比如刹帝利与刹帝利和合无乖，不相违逆，这样来现前观察，就是现观，现前观察婆罗门也是这样。现观也能成就众多种相状，证得如是谛现观就会获得四智，对于一切苦行，如果住于所有作意当中善于推求观行，就会获得唯法智、非断智、非常智、缘生行如幻事智。</p><p>能知智，是指能见法知法证法的六七识，具有如实的观察智慧，所知境是指六七识所观察的理法，比如四圣谛理和般若之法等等，智与境和合一起，没有违逆，这样的现前观察叫作现观。如果观察不到真实的理法，或者是所观察的不善真实理法，那么智和境不相匹配，就不是现前观察，不叫作现观。</p><p>和合无乖，不相违逆，主要在于六七识的智慧境界，或者是智慧层次，智慧足够正确观察和认知于法，就与理法不相乖离，并且是现前观察，不是揣摩和推理想象分析的，现前存在的法，事实是什么就是什么，现量观察现量认知，这叫作现观。现观的时候，就证得了法，获得了法智和类智。不是现观的，就没有法智和类智，没有果证。</p><p>如何区分对于法是现前观察还是非现前观察呢？比如说观察苦谛，感觉五蕴是苦，现前观察到了五蕴是苦以后，内心对苦的认知很深刻，时时处处心心念念都会感知到五蕴的苦，并且心心念念想要逃脱苦灭掉苦，这种心态形成了无间作意，不间断。无间作意，就是意根生起来的作意，是意根感知到了苦，不仅仅停留在意识表面，这是现前观察的结果。</p><p>非现前观察的苦，并没有形成无间作意，断断续续，时有时无，时常忘记了苦，还是追求乐，出离心不强，觉悟性不高，行动力更差。当乐境现前的时候，就会迷失了自己，深陷乐境中不知苦了，对将来的希冀还是很大，妄想能得到乐保持乐。这样一边觉得苦，一边追求乐，心与行为相违背的状态，就是非现前观察苦。非现观的人由于辨别的智慧力不足，往往会误会自己这种情况是现量观察，是实证了法，其实与实证还有相当长的距离。</p><p>非现前观察的人普遍特征是，烦恼不除，无明不断，言行不一，表里不一，说一套做一套，指东向西，口里说着空，行为上处处着于有，没有一处是空；口里说无我，时时处处都是我，想掩饰都掩饰不住。因为没有实证，不知道实证之后的身心境界，也不知道自己所思所为都与实证境界相反，所以根本掩盖不了自己的凡夫特征。</p><p>原文：<strong>若行境界。由失念故。虽起猛利。诸烦恼缠。暂作意时。速疾除遣。又能毕竟。不堕恶趣。终不故思。违越所学。乃至傍生。亦不害命。终不退转。弃舍所学。不复能造。五无间业。定知苦乐。非自所作。非他所作。非自他作。非自非他。无因而生。</strong></p><p>释：有现观四智的行者，在证初果之前，如果身处境界之中，由于暂时失念的缘故，虽然生起了猛烈的诸烦恼缠缚，只要暂时作意就能迅速地除遣缠缚，并且还能毕竟不堕入恶道，永远不会故意思考与所修学相违背的法，乃至于连畜生的性命也不违害，永远不会退转和弃舍所修学的法，不再能造作五无间恶业，确定知道苦乐不是苦乐自性所作，不是大自在天等所作，不是苦乐自性和大自在天等共同所作，也不是苦乐自性作不是大自在天等作的无因而生。</p><p>这是行者处于四加行的世第一法阶段的功德受用，在证得初果之前，就有能力迅速除遣猛力的诸烦恼缠缚，就能不堕恶道，于四圣谛解脱道不退转，不弃舍。可见见道前的四加行其功德也是很大的，见道后的功德受用就更大了，解脱智慧确实是很殊胜的。</p><p>原文：<strong>终不求请。外道为师。亦不于彼。起福田想。于他沙门。婆罗门等。终不观瞻。口及颜面。唯自见法得法。知法得法。证法源底。越度疑惑。不由他缘。于大师教。非他所引。于诸法中。得无所畏。终不妄计。世瑞吉祥。以为清净。终不更受。第八有生。具足成就。四种证净。如是行者。乃至世第一法已前。名胜解作意。</strong></p><p>释：终究不会皈依外道为师，也不对外道生起福田之想，对于其他的沙门和婆罗门等等，永远不会仰望他们的颜面，看他们的脸色，看重他们所说，从他们的口里得法，只有自己独自见法得法。独自见法得法，证得法的底源（根本），解除所有的疑惑，并不是由于外在的因缘所为。能够证法底源，是由于世尊善知识教导的缘故，不是从世尊之外的他处所引过来的。行者在诸法中无所畏惧，终究不会虚妄地计着世间的种种瑞象和吉祥是清净的，永远不会再有第八次受生于三界世间，具足成就四种所证的清净智。如是行者，在修到世第一法以前，都名为胜解作意。</p><p>行者在获得四智现观之后，修习四加行，在第四加行的世第一法之前的观行都叫作胜解作意。意思是没有现量实证之前的思考参究，都应该叫作对法的胜解和领悟，只有胜解之后，才能现量观察得到，名为实证。实证是在初果位以上，胜解则在初果向或者是四加行的世第一法位中，四加行之后才能实证见道。所以要如实地观察自己的智慧，是现量观察智，还是胜解，还是臆测推理分析等等，了解了自己的智慧层次，才好规划下一步的修行。</p><p>具有现观四智的行者，从来不从他处得法和知法，不以他人所说为究竟皈依处，都是依靠自己现量观察去实证，见法得法之事只有靠自力参究观行，别人帮不上忙，别人指引的指教的，代替不了自己的现量观行。疑惑需要自己通过观行解决，别人说的不能解除自己内心的疑惑，因为不是亲自所见所证。有些人想方设法地套取修行成果，佛法是谁修谁得，套取来的，不能变成自己的，也不能获得见道智慧。现在有瑜伽师地论作指引，法理越来越明，对于证果明心之事，谁不服也没办法，要不然就去找弥勒菩萨说道说道。</p><p>原文：<strong>于诸圣谛。现观已后。乃至永断。见道所断。一切烦恼。名远离作意。复从此后。为欲进断。修所断惑。如所得道。更数修习。永断欲界。上品中品。诸烦恼已。得一来果。如预流果。所有诸相。今于此中。当知亦尔。然少差别。</strong></p><p>释：对四圣谛现观以后，直至永远断除见道所断的一切烦恼，名为远离作意，这是初果境界，断除欲界下品烦恼。又从此以后，为了要进一步断除修道所应该断除的烦恼惑，在所证得的初果断我见的基础上，更加努力地精勤修习，永远断除欲界上品和中品烦恼以后，就证得二果一来果。就像证得初果所具有的功德一样，二果人具有的功德也是如此，但其中还是有一些差别。</p><p>原文：<strong>谓若行境界。于能随顺。上品猛利。烦恼缠处。由失念故。暂起微劣。诸烦恼缠。寻能作意。速疾除遣。唯一度来。生此世间。便能究竟。作苦边际。得不还果。及不还相。如前已说。</strong></p><p>释：二果人在面对境界时，在能随顺欲界上品很猛烈的烦恼缠缚之处，由于失念的缘故，在刚一生起轻微劣弱的诸烦恼缠缚时，马上就能作意，迅速地除遣烦恼缠缚。之后再来此世间投生，只能来一次，就能到达究竟的苦的边际了，证得三果不还果，以及具有不还欲界的功德相，前边已经说过了。</p><p>初果见道所断的烦恼是欲界的下品烦恼，是欲界众生的烦恼中最粗重的部分，是人类和三恶道众生所具有的烦恼，天界众生没有粗重烦恼，有中品和上品烦恼，人类也有中品和上品烦恼。如果不喜和不随顺欲界众生的烦恼，就能断除欲界的中品和上品烦恼，证得二果。断除欲界上中下三品烦恼，能远离欲界贪，出生初禅定，证得三果。</p><p>所以初果是证道，二果和三果开始修道，修道所断的烦恼比初果要微细难断，一旦断除，智慧就会增进。初果至三果修道就是要断除烦恼，以禅定和烦恼的程度，来划定果位和智慧层次，所以修习理论的最终和根本目的是断除烦恼，身口意行清净，若不为此，只看重理论，就不叫作修道了。</p></div>"
},{
    "title": "第四章 修道之功德",
    "author": "生如法师",
    "date": "2022年09月22日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  修道之功德</strong></p><p>原文：<strong>当知此中。由观察作意。于一切修道。数数观察。已断未断。如所得道。而正修习。又于此中。云何名修自性。云何名修业。云何名修。品类差别。谓由定地作意。于世出世。善有为法。修习增长。无间所作。殷重所作。令心相续。会彼体性。如是名为。修之自性。</strong></p><p>释：在修道的过程中，由于有观察作意，在一切修道过程中，多次反复地，观察自己已经断除的烦恼和没有断除的烦恼，按照所应该修的道，正确如理地修习。在修习四圣谛过程中，什么叫作修自性？什么叫作修业？什么叫作修品类差别？在禅定里作意修习，对世出世间善的有为法，不断地修习，精进地修习，无间断地行善，精勤地修善，让心相续不断地住于善法中，心与善的体性相合，这就叫作修之自性。</p><p>原文：<strong>当知修业。略有八种。一有一类法。由修故得。二有一类法。由修故习。三有一类法。由修故净。四有一类法。由修故遣。五有一类法。由修故知。六有一类法。由修故断。七有一类法。由修故证。八有一类法。由修故远。</strong></p><p>释：而修业大略有八种：一，有一类法是由于修才会得到的；二，有一类法是由于修才能现前出现的；三，有一类法是由于修才清净的；四，有一类法是由于修才能遣除的；五，有一类法是由于修才能证知的；六，有一类法是由于修才能断除的；七，有一类法是由于修才能证得的；八，有一类法是由于修才能远离的。</p><p>原文：<strong>若先未得。殊胜善法。修习令得。名修故得。若先已得。令转现前。名修故习。若先已得。未令现前。但由修习。彼种类法。当令现前。令转清净。鲜白生起。名修故净。若有失念。染法现行。修善法力。令不忍受。断除变吐。名修故遣。</strong></p><p>释：如果先前没有得到殊胜的善法，通过修习得到了，名为由修故得。如果先前已经得到了善法，通过修习，令善法现前出现，名为由修故习。如果先前已经得到善法，而没有让善法现前出现，但由于修习那个种类的善法，令其现前，令其更加清净，鲜明白净地出现，名为由修故净。如果由于失念，染污法生起了，因为修善法的力，心不能忍受染污之法，就把染污法断除吐出，这名为由修故遣。</p><p>原文：<strong>若未生起。所应断法。修善法力。了知如病。深心厌坏。了知如痈如箭。障碍无常苦空。及以无我。深心厌坏。名修故知。如是知已。数修习故。无间道生。断诸烦恼。名修故断。烦恼断已。证得解脱。名修故证。如如进趣。上地善法。如是如是。令其下地已断。诸法转成远分。乃至究竟。名修故远。当知是名。八种修业。</strong></p><p>释：如果还没有生起所应该断除的法，由修习善法的力量，了知所应该断除的法如病一样，深心厌恶，了知所应该断除的法如痈疽一样，如毒箭一样，障碍无常、苦、空和无我的智慧，于是深心生厌，这名为由修故知。如是了知所应该断除的法体性以后，由于多次反复修习的缘故，就出生了不间断的道，断除了诸烦恼，这名为由修故断。断除烦恼以后，证得解脱，名为由修故证。像这样不断地趣向上地善法，像这样令下地烦恼断除，诸下地法变得离自己更远，乃至于究竟远离，名为由修故远。以上就是八种修业。</p><p>原文：<strong>应知此修。品类差别有十一种。一奢摩他修。二毗钵舍那修。三世间道修。四出世道修。五下品道修。六中品道修。七上品道修。八加行道修。九无间道修。十解脱道修。十一胜进道修。</strong></p><p>释：行者应该知道这种修习的品类和差别，有十一种：一，止和禅定的修法；二，观和智慧的修法；三，世间道的修习；四，出世间道的修习；五，下品道的修习；六，中品道的修习；七，上品道的修习；八，四加行道的修习；九，无间道的修习；十，解脱道的修习；十一，胜进道的修习。</p><p>原文：<strong>奢摩他修者。谓九种行。令心安住。如前已说。毗钵舍那修。亦如前说。世间道修者。谓于诸下地。见粗相故。于诸上地。见静相故。乃至能趣。无所有处。一切离欲。出世道修者。谓正思惟。苦真是苦。集真是集。灭真是灭。道真是道。由正见等。无漏圣道。乃至能趣。非想非非想处。一切离欲。</strong></p><p>释：止的修习，是用九种方法令心安住，就像前边说的那样。毗鉢舍那的修习也像前边说的那样。世间道修的意思是，在诸下地（欲界）见到粗相，在诸上地（色界和无色界）见静相，乃至于能趣向无所有处，在一切地都能离欲不着欲，在世间无碍。出世间道修的意思是，能正思惟苦谛真是苦，集谛真是集，灭谛真是灭，道谛真有道。由于有正见等无漏的圣贤之道，乃至能趣向非想非非想处，在一切地都能离欲不着欲，出世间道无碍。</p><p>原文：<strong>下品道修者。谓由此故。能断最粗。上品烦恼。中品道修者。谓由此故。能断所有。中品烦恼。上品道修者。谓由此故。能断所有。最后所断。下品烦恼。</strong></p><p>释：下品道修的意思是，由此种修的缘故，能断除最粗重的上品烦恼。中品道修的意思是，由于此种修的缘故，能断除所有的中品烦恼。上品道修的意思是，由于此种修的缘故，能断除所有最后所应该断除的下品烦恼。</p><p>原文：<strong>加行道修者。谓由此故。为断烦恼。发起加行。无间道修者。谓由此故。正断烦恼。解脱道修者。谓由此故。或断无间。证得解脱。胜进道修者。谓由此故。从是已后。修胜善法。乃至未起。余地烦恼。能治加行。或复未起。趣究竟位。当知是名。十一种修。品类差别。</strong></p><p>释：加行道修的意思是，由于此种修的缘故，为了断除烦恼发起了加行。无间道修的意思是，由于此种修的缘故，真正地断除了烦恼，而且是永远地断除了烦恼，叫作无间道。解脱道修的意思是，由于此种修的缘故，能够无间地断除烦恼，证得解脱。胜进道修的意思是，由于此种修的缘故，从此以后要修行更胜的善法，乃至于其余诸地的烦恼也不生起，能对治和加行之法，或许也不生起，能趣向究竟的四正性离生之位，再也不出生在三界世间。这就是十一种修的品类差别。</p><p>原文：<strong>如是于修。勤修习者。于时时间。应正观察。所有烦恼。已断未断。于时时间。于可厌法。深心厌离。于时时间。于可欣法。深心欣慕。如是名为。摄乐作意。彼即于此。摄乐作意。亲近修习。多修习故。有能无余永断。修道所断烦恼。最后学位。喻如金刚。三摩地生。由此生故。便能永断。修道所断。一切烦恼。</strong></p><p>释：像这样对于修，能够精勤的修习者，在一切时间里应该正确地观察，所有的烦恼是已经断除了，还是没有断除；在一切时间里对可厌恶的法，能深心厌离；在一切时间里对可欢喜之法深心欣喜和仰慕，如是名为摄乐作意。行者对于这个摄乐作意亲近修习，多修习的缘故，能够全部永远断除修道所断的烦恼，最后学位就出生了，此位被比喻为金刚三摩地。由于最后学位出生的缘故，就能永远断除修道所断的一切烦恼。</p><p>这个最后学位是三果之位，初果二果三果是有学位，在三果有学位断尽一切烦恼，证得四果无学位，从此无法可修，无烦恼可断，名为无学。</p><p>原文：<strong>问。何因缘故。此三摩地。名金刚喻。答。譬如金刚。望余一切。末尼真珠。琉璃螺贝璧玉。珊瑚等诸珍宝。最为坚固。能穿能坏。所余宝物。非余宝物。所能穿坏。如是此三摩地。于诸有学。三摩地中。最上最胜。最为坚固。能坏一切。所有烦恼。非上烦恼。所能蔽伏。是故此三摩地。名金刚喻。</strong></p><p>释：问：是什么原因此三摩地用金刚喻名？答：譬如金刚，与一切摩尼、珍珠、琉璃、螺贝、壁玉、珊瑚等等珠宝相比，是最坚固的，能穿坏其它一切宝物，却不能被其它宝物穿坏。这样的三摩地，在所有有学的三摩地中是最上最殊胜最坚固的，能破坏掉一切烦恼，不是上烦恼所能遮蔽和降伏的，因此这个三摩地就用金刚来喻名。</p><p>初果到三果都是有学位，因为还有烦恼漏没有断除，还有可修之法，因其烦恼未断尽，或者未断烦恼，还有所修学，以便断尽烦恼。烦恼断尽是四果阿罗汉，因为再也没有漏没有烦恼可断了，没有法可修了，再也不需要修学解脱道的谛理了，已经达到最后清净了，已经解脱于三界世间诸有了，所以称为无学，而三果之前却非如此。三果所证得的三摩地比初果二果都殊胜，是最坚固的，名为金刚三摩地。</p></div>"
},{
    "title": "第五章 阿罗汉的功德",
    "author": "生如法师",
    "date": "2022年09月22日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  阿罗汉的功德</strong></p><p>原文：<strong>从此金刚喻三摩地。无间永害。一切烦恼品。粗重种子。其心于彼。究竟解脱。证得毕竟。种姓清净。于诸烦恼。究竟尽中。发起尽智。由因尽故。当来苦果。毕竟不生。即于此中。起无生智。彼于尔时。成阿罗汉。诸漏已尽。所作已办。无复所作。证得自义。尽诸有结。已正奉行。如来圣教。心善解脱。</strong></p><p>释：从这个金刚三摩地以后，就会无间断地永远断除了一切烦恼品类的粗重种子，其心于诸烦恼究竟解脱，证得毕竟种姓清净。在一切烦恼究竟断尽的同时，发起了世间尽智，由烦恼因断尽的缘故，后世的苦果毕竟不再生起。在断尽烦恼的同时，生起了五蕴世间的无生智。这时候三果人就成为了四果阿罗汉，诸漏已尽，所作已作，无复后有，三界结尽，已经完好地奉行了如来圣教，心善解脱了。</p><p>四果阿罗汉有无间尽智和无生智，无间尽智是指能够无间断地断尽世间一切烦恼，灭尽三界世间一切苦，知道如何出离三界世间得解脱，这样的智慧名为无间尽智。无生智是指证得五蕴世间苦空无常无我，了知五蕴世间是虚妄的，因此也是无生的，不真实的，这样的智慧名为无生智。</p><p>原文：<strong>已具成就。十无学法。谓无学正见正思惟。乃至无学。正解脱正智。于诸住中。及作意中。能随己心。自在而转。随所乐住。或圣或天。或梵住中。即能安住。随乐思惟。所有正法。能引世间。或出世间。诸善义利。即能思惟。</strong></p><p>释：已经具足成就了十种无学法：对于正见、正思惟、正语、正业、正念、正定、正命、正精进无学，乃至于对正解脱、正智都无学，这十种法都已具足，不用再修学了。在一切所住之中以及作意中，都能够随着自己的心，自在地运转，随着自己所乐于住着之处，或者是圣住，或者是天住，或者是清净住中，立即就能安住下来。随着自己乐于思惟的所有正法，都能引出世间或者出世间的诸善法的义利，而能立即思惟。</p><p>原文：<strong>言圣住者。谓空住无愿住。无相住。灭尽定住。言天住者。谓诸静虑。诸无色住。言梵住者。谓慈住悲住喜住舍住。又于尔时。至极究竟。毕竟无垢。毕竟证得。梵行边际。离诸关键。已出深坑。已度深堑。已能摧伏。彼伊师迦。是为真圣。摧灭高幢。已断五支。成就六支。</strong></p><p>释：所说的圣住，是指空住、无愿住、无相住、灭尽定住。所说的天住，是指种种禅定境界，所有的无色界住。所说的梵住，是指慈住、悲住、喜住、舍住。又在断尽一切烦恼时，达到了究竟，再无污垢，毕竟证得清净梵行的边际，离开一切要害，已经跳出深坑，已经越过深堑，已经能够催伏我慢高山，是真正的圣人，催灭了高慢幢，已经断除了贪、嗔、痴、慢、疑五支烦恼漏，成就了戒、定、慧、解脱、解脱知见等六支功德。</p><p>原文：<strong>一向守护。四所依止。最极远离。独一谛实。弃舍希求。无浊思惟。身行猗息。心善解脱。慧善解脱。独一无侣。正行已立。名已亲近。无上丈夫。具足成就。六恒住法。谓眼见色已。无喜无忧。安住上舍。正念正知。如是耳闻声已。鼻嗅香已。舌尝味已。身觉触已。意了法已。无喜无忧。安住上舍。正念正知。</strong></p><p>释：一向守护佛法僧戒四个所依止处，远离一切世间法，解脱无碍，心中独有一个真理，对五蕴世间无所希求，思惟清净，没有染污，行来去止自在轻安，无有系挂，心善解脱，智慧善解脱，在世间心不与一法为伴侣，不系属于任何一法，不具任何一法的特性。正行已经建立起来了，叫作已经亲近了无上丈夫佛世尊，具足成就六个恒常住法，就是眼见色以后，无喜无忧，安住上舍，正念正知。耳闻声、鼻嗅香、舌尝味、身觉触、意了法以后，都同样是无喜无忧，安住上舍，正念正知。</p><p>原文：<strong>彼于尔时。领受贪欲。无余永尽。领受瞋恚。无余永尽。领受愚痴。无余永尽。彼贪瞋痴。皆永尽故。不造诸恶。习近诸善。其心犹如。虚空净水。如妙香檀。普为一切。天帝天王。恭敬供养。住有余依。般涅槃界。度生死海。已到彼岸。亦名任持。最后有身。</strong></p><p>释：阿罗汉在这时候，领受六尘境界时出现的贪欲，永远断尽无余了，领受六尘境界时出现的嗔恚，永远断尽无余了；领受六尘境界时出现的愚痴，永远断尽无余了。因为贪嗔痴都永远断尽的缘故，不再造作诸恶业，修习诸善法，其心犹如虚空和清净的水一样，也如奇妙的栴檀香，普遍为天帝、天王们恭敬供养。住在有余依涅槃界，渡越了生死海，已经到达了彼岸，这也名为住持最后有身。</p><p>原文：<strong>先业烦恼。所引诸蕴。自然灭故。余取无故。不相续故。于无余依。般涅槃界。而般涅槃。此中都无。般涅槃者。如于生死。无流转者。唯有众苦永灭。寂静清凉灭没。唯有此处。最为寂静。所谓弃舍。一切所依。爱尽离欲。永灭涅槃。</strong></p><p>释：由于从前的烦恼业，所引出的五蕴自然灭去的缘故，对三界世间就再没有取着了，后世的生命再也不会相续了。在无余依般涅槃界而得到涅槃，却都没有般涅槃者，同样的在生死中也无有流转者了。只有众苦永远灭尽，寂静清凉，灭没一切法，只有此涅槃处是最寂静的，弃舍了一切所依止的，贪爱永尽离一切欲，永远灭尽五蕴，入无余涅槃。</p><p>原文：<strong>当知此中。有如是相。阿罗汉苾刍。诸漏永尽。不能习近。五种处所。一者不能故思。杀害诸众生命。二者不能。不与而取。三者不能。行非梵行。习淫欲法。四者不能知而妄语。五者不能贮畜受用。诸欲资具。如是不能。妄计苦乐。自作他作。自他俱作。非自他作。无因而生。又亦不能。怖畏一切。不应记事。又亦不能。于云雷电。霹雳灾雹。及见种种。怖畏事已。深生惊怖。</strong></p><p>释：你们应当知道，取得阿罗汉果就会有这样的相貌，阿罗汉比丘诸烦恼漏永远灭尽，不再造作如下五种事：一者，不能故意想要杀害众生的性命；二者，不能不经过对方允许而自行拿取对方之物；三者，不能造作不清净的淫欲行；四者，不能明知而妄语；五者，不能储藏和受用所有用来满足资生需求的资具。阿罗汉也不能虚妄地计着，苦乐是苦乐自性所作，或是大自在天所作，或是苦乐自性和大自在天共同所作，或是非苦乐自性也非大自在天作的无因而生，而且也不能对乌云、雷电、霹雳、冰雹，以及种种的恐怖事，而深生惊恐怖畏。</p><p>原文：<strong>当知此中。金刚喻定。所摄作意。名加行究竟作意。最上阿罗汉果。所摄作意。名加行究竟果作意。由如是等。多种作意。依出世道。证得究竟。如是一切。名声闻地。此是一切。正等觉者所说。一切声闻。相应教法根本。犹如一切。名句文身。是所制造。文章咒术。异论根本。</strong></p><p>释：应当知道在修道中，金刚喻定所摄受的作意，名为加行究竟作意，最上阿罗汉果所摄受的作意，名为加行究竟果作意。由这样的多种作意，依出世间道才能证得究竟，如是一切种种名为声闻地。此是一切正等觉者诸佛所说，一切与声闻相应的根本教法，犹如一切名身、句身和文身，是制造文章、咒术和异论的根本。</p></div>"
}]