[{
    "title": "第一章 瑜伽师地论第九卷十二因缘 第一节 三世流转因缘",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  瑜伽师地论第九卷十二因缘</strong></p><p><strong>第一节  三世流转因缘</strong></p><p>原文：<strong>云何缘起体。若略说由三种相。建立缘起。谓从前际中际生。从中际后际生。中际生已。若趣流转。若趣清净究竟。</strong></p><p>释：什么是缘起体？如果是简略来说，缘起体是由前世的五蕴身、今世的五蕴身和后世的五蕴身三种相建立的自体。三种相分别是：由于前世的缘，在现世中出生的五蕴身缘起体；由于现世的缘在后世出生的五蕴身缘起体；在现世出生的五蕴身缘起体有两种不同的结果，一是继续趣向于六道生死流转，二是趣向于究竟清净。</p><p>缘起体是指由于种种因缘而生起的五蕴身，五蕴身生生世世的流转，每世流转都与前世的业力和因缘有关，也与现世的业力和因缘有关，而后世的流转主要与现世的业和因缘有关。如果现世破除了无明和结缚，后世则趣向于清净，灭除生死轮回，否则就仍然流转于六道轮回中。缘起体有三种相：前世相、现世相和后世相，五蕴身分为前世、今世和后世，三相依因缘和业力而有同有异。</p><p>原文：<strong>云何从前际中际生。中际生已。复趣流转。谓如有一。不了前际无明所摄。无明为缘。于福非福及与不动身语意业。若作若增长。由此随业识。乃至命终流转不绝。能为后有相续识因。</strong></p><p>释：由于前世的因缘而在现世出生的缘起体，在现世出生以后，再次趣向于生死流转，这是因为什么？这是因为如果有一个缘起体众生，由于不知前世自心无明的缘故而有现世的生死流转，现世仍然因为无明的缘故，造作了有福的身口意业行，或无福的身口意业行，或非有福也非无福的清净不动的身口意业行，或者是更进一步地增加有福业、无福业和非有福非无福的清净不动的身口意业行造作。由于这些业行的造作，跟随业力而运转的六七识，就会让五蕴身直至命终继续流转不断绝，能成为后世三有中六识出生的因。</p><p>随业识是指六七识，以第七识为主，具体造作业行的是六识，作主和指挥造作业行的是第七识意根，五蕴身造作的一切业种都随时随地存入阿赖耶识中，阿赖耶识就会随着这些业种，而不断地出生和变换出与业种相应的五蕴身。有业力之处必有意根和六识的运转，当然也必有阿赖耶识的运转，以执持与业力相应的五蕴身，不管是染污业还是清净业，而阿赖耶识自身并不在生死流中流转。意根第七识生生世世随着自身业力流转，意根与业力须臾不分地捆绑在一起。六识则是断续的，不是时时刻刻与业力在一起，六识的出生流转也是因为意根和业力不灭的缘故，也是因为意根无明的缘故。</p><p>原文：<strong>此识将生果时。由内外贪爱。正现在前。以为助伴。从彼前际。既舍命已。于现在世。自体得生。在母腹中。以因识为缘。相续果识。前后次第而生。乃至羯罗蓝等位差别。而转于母胎中。相续果识。与名色俱。乃至衰老。渐渐增长。尔时感生。受业名已。与异熟果。</strong></p><p>释：随业识在即将呈现业果身的时候，由于对内外境界的贪爱现前，以贪爱为助缘和陪伴，舍弃了前世的命根以后，现世的五蕴身自体得以出生。五蕴缘起体在母腹中，以自体出生的前世的六识因识为缘，承受业果相续的今世的果报识六识就会前后次第的出生，乃至于在母胎中，各个阶段不同的胎体就相续运转出来。承受相续业果的六识与五蕴名色俱在一起流转，五蕴身渐渐增长，直至衰老。这时候就因为业力的缘故，感生了承受业果的六识名和异熟果报。</p><p>在意根与阿赖耶识即将投生之时，随业识意根和意识对未来世色身的贪爱，以及对未来世父母的男女欲爱出现了，以这种贪爱为助伴就投入母胎当中。如果没有贪爱，就会出现两种情况，一是不再去投胎，二是以清净心投胎。没有贪爱的人是舍弃了欲界贪的圣人，圣人如果不投胎，有可能是以化生的形式出生，有可能是入无余涅槃。圣人如果投胎，是因为有清净大愿，以愿力去投胎。</p><p>这里有因识和相续果报识两个概念需要解释一下，因是指今世名色出生的前世因，前世由于六识造作的身口意行，留下了业种，业种成熟，才有今世的名色，名色出生以后，才有今世的六识出生，以承受前世造业的业果，所以今世的六识是名色受报连接前世继续运转的果报识，而前世的六识是导致今世果报的因，叫作因识。</p><p>原文：<strong>又此异熟识。即依名色而转。由必依托六依转故。是故经言。名色缘识。俱有依根曰色。等无间灭依根曰名。随其所应。为六识所依。依止彼故。乃至命终。诸识流转。</strong></p><p>释：阿赖耶识也叫作异熟识，异熟识是依靠着名色而运转的，由于异熟识一定要依托于六根才能运转的缘故，因此经中说，名色是缘于阿赖耶识或者是异熟识而出生的。与阿赖耶识一起共同运转的根叫作色，也就是受精卵，伴随着阿赖耶识同时运转的所依根叫作名，也就是意根，意根是六识的识种子相等无间生灭相续所依的根，这样阿赖耶识与名色一起运转，六识依之就出生了。六识依止阿赖耶识和名色不停地运转，直至命终。</p><p>因为五蕴七识在流转过程中会造作业行，留下业种，因此就会有后世的业果，业行依止于阿赖耶识而有，业果需要阿赖耶识来呈现，所以阿赖耶识也叫作异熟识，能让五蕴七识在业种成熟时以不同的形态承受业果。而阿赖耶识不能独自运转，需配合意根和业力，只有在意根和业果所需的时候才能运转，才能有心的行相，才能被发现。如果意根和业果没有所需，阿赖耶识则不再运转，也就没有运行的行相，就不会被发觉。</p><p>因此阿赖耶识必依受精卵和意根在母胎中运作，继而再出生六识，所以名色也是六识出生所依根，六识出生以后，也摄于名之中。既然阿赖耶识必依意根才能运转，所以意根也称为阿赖耶识运转的俱有依，但并不是阿赖耶识依于意根才能存在，没有意根阿赖耶识也仍然存在，只不过不能运作五蕴世间一切法了。在母胎中，最初只有受精卵的色，和意根的名，所以等无间灭的六识所依止的根是意根，六识依止意根和受精卵才能出生和运行，也依靠阿赖耶识才能出生和运行，也依靠业种。</p><p>原文：<strong>又五色根。若根所依大种。若根处所。若彼能生大种曰色。所余曰名。由识执受。诸根堕相续法。方得流转。故此二种依止于识。相续不断。</strong></p><p>释：再说五个有色的根眼耳鼻舌身，这五根所依的是阿赖耶识里的地水火风空五大种子，能生出有色五根的大种称为色，五大种之外的识种子称为名，由七识来执受识种子。这样诸大种子出生名色之后，六根就堕入了前世至今世乃至于到未来世的相续法之中，五阴身才能生生世世流转不止。因此说有色根和七识依止于阿赖耶识，生生世世相续不断绝。</p><p>这段话足以证明了名色缘识之理，名色的出生和相续运行完全是因为有阿赖耶识的缘故，因为色身的色是五大种子构成的，七识的名是识种子形成的，而这六大种子是归属于阿赖耶识，因此说是阿赖耶识出生了名色五阴身，并让五阴身流转运行不止。名色与阿赖耶识的关系在此阐述得一清二楚。</p><p>原文：<strong>由此道理。于现在世。识缘名色。名色缘识。犹如束芦。乃至命终。相依而转。如是名为。从前际中际诸行缘起生。中际生已。流转不绝。当知此中。依胎生者。说流转次第。若卵生湿生者。除处母胎。余如前说。</strong></p><p>释：由这个道理而知，在现在世中，阿赖耶识缘于名色才能运行，名色缘于阿赖耶识才能出生和相续，二者犹如捆在一起的芦苇，互相依靠才能运转，直至命终。这就叫作由于前世的因缘，现在世的诸行就生起来了，现在世出生以后，五阴身就流转不断绝。还应该知道的是，在这样的生死流转中，依靠母胎而出生的有情，是这样的流转次第，如果是卵生和湿生的有情，以及除了母胎而生之外的有情，都是与前边所说的流转次第是一样的。</p><p>这段话又着重阐述识缘名色的道理，阿赖耶识缘于名色才有依托，才能运转，如果没有名色，就无法运转五蕴世间，但阿赖耶识本体是不需要依托名色而有。至此，名色缘识，识缘名色，阿赖耶识与名色的关系已经阐述清楚了。</p><p>原文：<strong>若于有色。有情聚中。谓欲色界。受化生者。诸根决定。圆满而生。与前差别。若于无色界。以名为依。及色种子为依。识得生起。以识为依。名及色种子转。从此种子。色虽断绝。后更得生。与前差别。</strong></p><p>释：如果在有色身的欲界和色界有情聚落中，如果其种类是化生的有情，他们在受生过程中，五色根一定是刹时圆满出生的，不是次第生五根，再渐渐圆满五根，这个与前边所说的胎生的情况有所不同。如果在无色界，有情依止于名六七识而流转，若要化现在欲界和色界，就要再依止于五大色种子，出生五识，再依止于七个识，识的名种子和五大的色种子就流转出来了。因为有色种子可依，在无色界虽然断绝了色身，后世却可以再出生色身，这样的流转方式与前边说的两种次第有些差别。</p><p>原文：<strong>又由福业。生欲界人天。由非福业。生诸恶趣。由不动业。生色无色界。云何不生。由不生故。趣清净究竟。</strong></p><p>释：又由于有情所修得的福业关系，命终就会生在欲界的人和天人当中；由于有情所作的非福业，命终就会生到三恶道中；由于有情所作的清净的不动业，命终就会生到色界和无色界中。不生到三界中是什么情况？由于后世不再出生的缘故，就出离三界，趣向于究竟清净的解脱。</p><p>不出生在三界中的清净相对于佛地的清净，还是不究竟的，因为异熟识中还有业种需要清净，业种都清净就到佛地了，这只是半路风景，最美的风景佛地才有。</p><p>原文：<strong>云何从中际。后际诸行缘起生。谓中际已生补特伽罗。受二种先业果。谓受内异熟果。及境界所生受增上果。此补特伽罗或闻非正法故。或先串习故。于二果愚。</strong></p><p><strong>由愚内异熟果故。于后有生苦。不如实知。由迷后有。后际无明增上力故。如前于诸行。若作若增长。由此新所作业故。说此识。名随业识。</strong></p><p>释：为什么由于现在世的因缘，出生了后世的诸行？这是说在现世已经出生的有情众生，要承受两种前世的业果，一个是要承受自身前世业行所带来的业果，另一个是要承受由于受现今周遭环境的熏染所带来的更进一步的果报。这个有情或者听闻了不是正见的法，或者是从前所熏习的缘故，对于内异熟果和现今增上果都愚痴不明。</p><p>因为对于前世所带来的异熟果愚痴的缘故，就不如实了知，后世的五阴身就会因此生出苦难。由于迷于后世的三有，后世的无明又会辗转增加，还会像前世一样身口意诸行继续造作，或者更增进地造作，由于这些新近所造作的业行，就说能跟随业力的识是随业识。</p><p>六七识都有无明愚痴，都能造作诸行，都能跟随业力，因此都叫作随业识。但第七识意根是刹那不离地跟随业力，随顺无明业力，第六识是断续地跟随业力，随顺业力，造作诸行。入胎投生时是第七识跟随业力因缘而入胎，之后才由于业力的缘故，第六识才出生去承受业果和随顺业力。</p><p>原文：<strong>即于现法中。说无明为缘故行生。行为缘故识生。此识于现法中名为因识。能摄受后生果识故。又总依一切识。说名六识身。又即此识。是后有名色种子之所随逐。此名色种子。是后有六处种子之所随逐。</strong></p><p>释：在一切现实存在的法中，说以无明为缘所以才有行的出生，以行为缘才有识的出生。这个识在现前所存在的法中叫作因识，意思是说这个识是起因，造作业行之后能引生后世的果报识。依前世的六识和今世的六识合起来说，这个识又叫作六识身。</p><p>这个六识身是被能出生后世名色的种子所追逐着，意思是说后世名色的种子就是此世六识身造作业行留下的，六识身造作业行以后就有了后世名色的种子，依此种子就会有后世的名色。这个名色种子又被后世六入处的种子所追逐，意思是说后世名色上的六入处的种子是依名色种子而有的。</p><p>这段话把前后世的六识关系都捋清楚了，前世六识造业留下名色种子，名色种子能出生后世的名色和六识，名色种子也是后世六入处的种子所依。因为名色种子能出生名色，有名色就会有名色上的六入处。</p><p>原文：<strong>此六处种子是后有触种子之所随逐。此种子触是后有受种子之所随逐。如是总名于中际中后有引因。应知由此能引识。乃至受一期身。</strong></p><p>释：而六入处的种子又被后世触的种子所追逐着，意思是说后世名色上触的种子是依这个六入处的种子而有的。触种子又是后世名色上受的种子所依，受种子依触的种子而有。这样总体来说六识在今世的时候，就成为了后世名色出生的引因，所以就应该知道由于这个能引后世名色出生的六识，就能有受生一期生命的色身。</p><p>原文：<strong>故由先异熟果愚。引后有已。又由第二境界。所生受果愚故。起缘境界受爱。由此爱故。或发欲求。或发有求。或执欲取。或执见戒及我语取。</strong></p><p>释：所以由于对前世的异熟果愚痴不知的缘故，就引生了后世的三有，果是造业的业果五阴身，异熟是后世成熟的。后世三有出生以后，又由于对与境界触之后所产生的受的果报也是愚痴的，缘于对境界的受就生起了爱。由于对境界有了爱的缘故，五阴身或者发起了对境界的欲求，或者发起对三界有法的贪求，或者执著境界的贪欲取着，或者执著我见取着，或者执著戒禁取着，或者执著我语的取着。</p><p>原文：由此爱取。和合资润。令前引因。转名为有。即是后有。生因所摄。从此无间。命既终已。随先引因。所引识等。受最为后。此诸行生。或渐或顿。</p><p>释：由于有这样的爱和取和合资生和润泽，使得前世六识身的引因之名变成了后世的有，爱和取就成为了后世三有生起之因。从此永远不间断的生命体命终以后，随着前世的引因，就生起了所牵引的今世的六识，最后就有了受。这些业行的出生，或者是逐渐出生的，或者是顿时出生的。</p><p> 原文：<strong>如是于现法中。无明触所生受为缘故爱。爱为缘故取。取为缘故有。有为缘故生。生为缘故老病死等。诸苦差别。或于生处。次第现前。或复种子随逐。应知如是。于中际中。无明缘行等。受缘爱等。为因缘故。后际诸行生。</strong></p><p>释：后世诸行出生以后，如是在现前存在的法中，以无明的触所出生的受为缘才有了爱，以爱为缘才有了取，以取为缘才有了三有，以三有为缘才有了生，以生为缘才有了老病死等等种种苦难的差别相。这些苦难有的在出生之处依次出现，出生之处就是六道轮回之处，就是三界的任何处所；有的苦难集起以后又以种子的形式一直追逐着名色，埋藏在阿赖耶识中，因缘具足种子现行，苦难又出生在名色所在之处。你们应该知道像这样在现世中，因为有无明的缘故产生行，有受的缘故产生爱等等，这些法又作为因缘，就会有后世的一切行产生。</p><p>此世的色受想行识落谢为种子，出生后世的色受想行识，这些法生生不已，都属于行的范围，心不寂止就有诸行，有行就有种子，有种子就会生生不已。</p><p>原文：<strong>复有先集资粮。于现法中从他闻音。及于二果诸行。若于彼因彼灭。彼趣灭行。如理作意。由此如理作意为缘。正见得生。从此次第。得学无学清净智见。由此智见。无明及爱。永断无余。由此断故。于彼所缘。不如实知。无明触所生受。亦复永断。由此断故。永离无明。于现法中。证慧解脱。</strong></p><p>释：还有的人前世就已经集积了修道的资粮，在现世之法中就有因缘听闻他人讲法的音声，以及修习声闻及缘觉两个果德的一切行。这些人如果对于十二因缘法中的引因和灭尽之理，以及趣向灭尽的修道之行，能够加以如理作意，以这样的如理作意为缘，就会生起正见，从此就会得到有学和无学的清净智见。</p><p>由于有了对因缘法的智慧见地，十二因缘中的无明一直到爱就会全部断尽无余了。由于断尽这些因缘法的缘故，对于因缘法的不如实知，以及由无明触所生的受也就永远断尽了。由于断尽了这些法的缘故，永远离开了无明，在现世之法中就证得了慧解脱。</p><p>原文：<strong>若于无明触所生受。相应心中所有贪爱。即于此心得离系故。贪爱永灭。于现法中。证心解脱。设彼无明不永断者。依于识等。受最为后。所有诸行。后际应生。由无明灭故。更不复起。得无生法。</strong></p><p>释：如果对于无明触之后所生的受，在与受相应的心中所生起的所有贪爱，在这个相应心中离开对于贪爱的系缚，贪爱就会永远断灭了，在现世之法中证得心解脱。如果无明没有永远断灭，依于识而有的受在最后，受以及之前的触、六入、名色等等诸行在后世都应该再生出来。因为无明灭了的缘故，这些诸行都不再生起了，就证得了无生法。</p><p>原文：<strong>是故说言。无明灭故行灭。次第乃至。异熟生触灭故。异熟生受灭。于现法中。无明灭故。无明触灭。无明触灭故。无明触所生受灭。无明触所生受灭故爱灭。爱灭故。如前得无生法。由此故说。取等烦恼最为后。诸行永灭。</strong></p><p>释：因此说无明灭了行就灭，行灭故识灭，识灭故异熟生的名色灭，异熟生名色灭故异熟生的六入灭，异熟生的六入灭故异熟生的触灭，异熟生的触灭故异熟生的受灭。在现世之法中无明灭的缘故无明的触就灭了，无明触灭了的缘故无明触所出生的受就灭了，无明触所生的受灭了的缘故爱就灭了，爱灭了的缘故，就像前边那样证得无生法，因此才说取等烦恼在一切烦恼的最后出现，起决定作用，不取着诸法时，五蕴一切行就永远灭了。</p><p>原文：<strong>如是于现法中。诸行不转。由不转故。于现法中。于有余依界。证得现法涅槃。彼于尔时。唯余清净识缘名色。名色缘识。乃至有识身在。恒受离系受。非有系受。此有识身。乃至先业所引寿量。恒相续住。</strong></p><p>释：这样在现世之法中诸行不运转了，由于诸行不运转的缘故，在现世之法还有余苦可依的世界中，证得现世法的涅槃寂静，就是有余依涅槃。这个人这时候只有清净的阿赖耶识缘于名色，名色缘着清净的阿赖耶识，乃至于还有六识身存在着，永远领纳着离开系缚的觉受，不受有系缚法的受。这个六识身也有前世的业所引生的寿命，长时间的相续的住世不灭。</p><p>原文：<strong>若寿量尽。便舍识所持身。此命根后。所有命根。无余永灭。更不重熟。又复此识与一切受。任运灭故。所余因缘先已灭故。不复相续。永灭无余。是名无余依涅槃界。究竟寂静处。亦名趣求涅槃者。于世尊所。梵行已立。究竟涅槃。</strong></p><p>释：如果寿命尽了，就会舍弃六识、七识和阿赖耶识所持着的色身。在此色身之后的后世所有的色身，永远灭尽再也不会出现，更不会重新生长出来。此六识与一切受随着因缘灭而任运灭了的缘故，剩下的所有因缘爱、取、有等等先前都已经灭了，不再相续出现，永远灭尽没有遗余，这叫作无余依涅槃界的最究竟寂静之处，也叫作趣求涅槃的圣人在佛法中，建立了清净的梵行，究竟涅槃了。</p><p>原文：<strong>如是已说。由三种相建立缘起。谓从前际中际生。从中际后际生。又于中际。若流转若清净。是名缘起体性。</strong></p><p>释：以上已经讲完了什么是由三种相建立的缘起体，就是由于前世因缘而有现世五蕴身的产生，由于现世的因缘而有后世五蕴身的出生，又在现世当中或者是继续流转生死，或者是趣向于究竟清净，这就是缘起体的体性。</p></div>"
},{
    "title": "第二节 缘起门与缘起义",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  缘起门与缘起义</strong></p><p>原文：<strong>缘起门云何。谓依八门缘起流转。一内识生门。二外稼成熟门。三有情世间死生门。四器世间成坏门。五食任持门。六自所作业。增上势力受用。随业所得。爱非爱果门。七威势门。八清净门。</strong></p><p>释：什么是缘起门？依八个门为缘现起了生命流转的现象就是缘起门。八个门分别是：一、五阴身内的识出生的门；二、受报的外在因缘成熟门；三、有情的五蕴世间死和生门；四、宇宙器世间成住坏空门；五、饮食资助维持门；六、由于受用自身所造作的业行的增上势力，随着业报所得到的可爱和不可爱果报门；七、自身所具有的威德和势力门；八、心得清净门。</p><p>原文：<strong>缘起义云何。谓离有情义。是缘起义。于离有情。复无常义。是缘起义。于无常。复暂住义。是缘起义。于暂住复依他义。是缘起义。于依他离作用义。是缘起义。于离作用。复因果相续不断义。是缘起义。于因果相续不断。复因果相似转义。是缘起义。于因果相似转。复自业所作义。是缘起义。</strong></p><p>释：什么是缘起之义？离有情自性，有情无自性义，是缘起义；有情无自性又加无常义，是缘起义；有情不仅是无常的，而且是暂住之义，是缘起义；有情不仅是暂住的，而且还是依他起之义，是缘起义；有情不仅是依他起的，也是无实作用之义，是缘起义；有情虽然无实作用，但是因果却相续不断地运转之义，是缘起义；有情随于因果在相上看似在不断地运转，实际上无因无果，无实因果之义，是缘起义；因果虽然是相似流转无实因果，但却是有情自身业行所感召之义，是缘起义。</p><p>总起来说，缘起义，就是无实法之义，是由因缘聚合而显现出来的假法和虚幻之法，看似有，实质无。所以有情是缘起法，没有真实的有情，有情是无常的、暂住的，是依他起性的，是没有真实五蕴作用的，是因因果果相续不断的，但又没有实质的因因果果，因为因果也是缘起法、不实之法。</p><p>原文：<strong>问。为显何义建立缘起耶。答。为显因缘所摄。染污清净义故。缘起差别云何。谓于前际无知等。如经广说。</strong></p><p>于前际无知云何。谓于过去诸行。起不如理分别。谓我于过去为曾有耶。为曾无耶。曾何体性。曾何种类。所有无知。于后际无知云何。谓于未来诸行。起不如理分别。谓我于未来。为当有耶。为当无耶。当何体性。当何种类。所有无知。</p><p>释：问：建立缘起法是为了显示什么法义？答：为了显示由于因缘差别所摄受的有情染污和清净义。什么是缘起差别？对于前世、现世和后世无知，就是缘起差别，就像佛经中广泛阐述的那样。</p><p>对于前世的无知是怎样的？对于过去世的诸行生起不如理的分别，疑惑地说我真的有过去世吗？我真的无过去世吗？我过去世有什么相貌，是什么种类的众生？这些所有的无知都是于前际无知。对于后世的无知是怎样的？对于未来世的诸行生起不如理的分别，疑惑地说我将来会有未来世吗？我将来没有未来世吗？我未来世将会是什么相貌？将会是什么种类的众生？这些所有的无知，都是于后际无知。</p><p>原文：<strong>于前后际无知云何。谓于内起不如理犹豫。谓何等是我。我为何等。今此有情。从何所来。于此没已。当往何所。所有无知。</strong></p><p>释：于前后际无知是怎样的？对于自身生起不如理的犹豫，疑惑地说什么叫作我？我是什么？现在的有情是从什么处来的？在此世间灭亡以后，将会到什么处去？等等这些所有的无知，就是于前后际无知。于三世无知，就是于因果和轮回无知，于生死无知，这是众生最大的无知，也叫作根本无明和无始无明。</p><p>原文：<strong>于内无知云何。谓于各别诸行。起不如理作意。谓之为我。所有无知。于外无知云何。谓于外非有情数诸行。起不如理作意。谓为我所。所有无知。于内外无知云何。谓于他相续诸行。起不如理分别。谓怨亲中所有无知。</strong></p><p>释：什么是于自身内的无知？对于自身中的所有诸行，生起不如理作意，把这些行当作是我，有关五蕴我类似的所有无知，就是于内无知。什么是于外无知？对于非有情的无情物色声香味触法六尘境界等，生起不如理作意，认为这些法是属于我所有的，所有类似于这样的作意就是于外无知。什么是于内外无知？对于其他有情的相续不断的诸行，生起不如理分别，认为这些有情是自己的怨亲等等，类似于这些所有的无知就是于内外无知。</p><p>于内无知，内是指自身五蕴身，于外无知，外是指六尘境界，于内外无知，内外是指其他众生的五阴身和六尘境界。把内外法都当作我和我所，当作实法来执取就是无知。</p><p>原文：<strong>于业无知云何。谓于诸业。起不如理分别。谓有作者。所有无知。于异熟无知云何。谓于异熟果所摄诸行。起不如理分别。谓有受者。所有无知。于业异熟无知云何。谓于业及果。起不如理分别。所有无知。</strong></p><p>释：什么是于业行无知？对于一切业行生起不如理的分别，认为这些业行是有造作者的，类似于这些所有的无知，就是于业行无知。什么是于异熟果无知？对于由异熟果所摄的诸行，生起不如理的分别，说这些异熟果是有承受者的，类似于这些所有的无知，就是于异熟果无知。什么是于业行异熟的无知？对于业行及其业果，生起不如理的分别，所有这些无知就是于业行和异熟果的无知。</p><p>为什么认为一切业行有造作者就是无知？因为业行是缘起法，是因缘聚合之法，是虚幻的假法，没有实义，造作者也是如此，是因缘所聚合起来的假法，虚幻之法，没有实体，能作所作二俱虚妄。什么是异熟果？前世造业所感召的后世的果报，就是异熟果，异熟果是因缘聚合之法，是不实之法。既然有果报，就有受果报的有情众生，但是有情众生是缘起体，是因缘聚合之法，不是实法，异熟果与受者二俱虚妄，所以认为异熟果有受者就是无知。同理，对于业行认为有造作者，对于异熟的果报认为有承受者，都属于无知。</p><p>原文：<strong>于佛无知云何。谓于佛菩提。或不思惟。或邪思惟。或由放逸。或由疑惑。或由毁谤。所有无知。于法无知云何。谓于正法善说性。或不思惟。或邪思惟。或由放逸。或由疑惑。或由毁谤。所有无知。于僧无知云何。谓于僧正行。或不思惟。或邪思惟。或由放逸。或由疑惑。或由毁谤。所有无知。</strong></p><p>释：于佛无知是怎样的？对于成佛的菩提道或者是不思惟，或者是邪思惟，或者是心放逸不精进修习，或者是怀着疑惑的心，或者是加以诽谤，所有这些无知就是于佛无知。什么是于法无知？对于正确真实的法善巧演说，或者是不去思惟，或者是邪思惟，或者是放逸不精进修习，或者是怀着疑惑的心，或者是无端诽谤，所有这些无知就是于法无知。什么是于僧无知？对于出家僧的正行，或者是不思惟，或者是邪思惟，或者是心思放逸，或者是怀着疑惑心理，或者是无端诽谤，所有这些无知就是于僧无知。</p><p>这是对于佛法僧三宝的无知，对三宝的功德不用心思惟，不正思惟，或者怀着疑惑，或者心生诽谤，种种身口意行都是无知。于三宝无知的后果就是沉沦生死苦海，不得超脱。</p><p>原文：<strong>于苦无知云何。谓于苦是苦性。或不思惟。或邪思惟。或由放逸。或由疑惑。或由毁谤。所有无知。如于苦。当知于集灭道无知亦尔。</strong></p><p>释：于苦无知是怎样的？对于苦有苦性之理，或者是不思惟，或者是邪思惟，或者是放逸不精进思惟，或者是怀着疑惑的心理，或者是加以诽谤，所有这些无知都是于苦无知。对于苦的无知是这样，对于苦集、苦灭和苦灭道迹也是这样的无知，这叫作于苦集无知，于苦灭无知，于苦灭道迹无知。</p><p>原文：<strong>于因无知云何。谓起不如理分别。或计无因。或计自在。世性士夫中间等不平等因。所有无知。如于因无知。于从因所生诸行亦尔。</strong></p><p>释：于因无知是怎样的？对于五蕴世间生起之因生起不如理分别，或者是计着有情众生无因而有，或者计着是大自在天所作，或者计着是某种神灵所作，或者计着是神我所作，以及计着是种种神明造物主所作等等，计着这些造物主创造众生，就是众生不平等的起因。对于五蕴世间生起之因的所有不知就是于因无知。就像对于业因无知一样，对于从因而生起的诸行也是一样的无知。</p><p>既然不知五蕴世间的生起和由来，也就不知五蕴诸行的生起和由来。五蕴世间的生起从两个角度去观察，一是从小乘的空的角度来观察，二是从大乘如来藏阿赖耶识异熟识的角度来观察。当然从异熟识的角度观察是最究竟的观察，观察得最真实，能灭除一切生因无知和了因无知，灭除一切无明。</p><p>原文：<strong>又彼无罪故名善。有罪故名不善。有利益故名应修习。无利益故名不应修习。黑故名有罪。白故名无罪。杂故名有分。于六触处如实通达无知云何。谓增上慢者。于所证中。颠倒思惟。所有无知。如是略说十九种无知。</strong></p><p>释：诸行无罪的就是善法，有罪的就是恶法，对于自身有利益的应该修习，无利益的就不应该修习。所作业行是染污的所以是有罪的，所作业行是清净的就是无罪的，因为有情的业行染污与清净交杂在一起，所以应该有所区分。</p><p>于六触处如实通达无知是怎样的？这里说的是未得谓得、未证谓证的增上慢人，在他们的修证过程中颠倒思惟，不能如实知六触处，不能通达六触处的真实之理，所有一切有关六触处的无知，就是于六触处如实通达无知。以上这些无知简略的说总共有十九种。</p><p>增上慢的意思是，对于增上果生起慢心，增上果一般是指小乘初果至四果，闻思修到一定程度，智慧得到增上，就会证法，心就会相应到对应的果位上。而没有证得，却认为自己证得了，就是对于增上果起慢，叫作增上慢。增上慢人因为没有实证，对于六触处没有通达，不如实知六触处。六触处是眼触处、耳触处、鼻触处、舌触处、身触处、意触处。在六触处有六根六尘之触，之后会生起六受。于六入、触和受不通达，不如理思惟观行，就是无知。</p><p>原文：<strong>复有七种无知。一世愚。二事愚。三移转愚。四最胜愚。五真实愚。六染净愚。七增上慢愚。前十九无知。今七无知。相摄云何。谓初三无知摄初一。次三无知摄第二。次三无知摄第三。次三无知摄第四。次四无知摄第五。次二无知摄第六。后一无知摄第七。</strong></p><p>释：另外又有七种无知：一是对于前世、今世和后世的三世无知；二是对于五蕴世间的内外诸行事业无知；三是对于五蕴世间的相续运行、生灭变异无知；四是对于世间最殊胜的佛法僧三宝无知；五是对于五蕴世间苦集灭道的真实之理无知；六是对于五阴身心的染污和清净无知；七是自心对于缘起法的实证和通达无知，未得谓得。</p><p>前边的十九个无知和现在的七个无知，二者互相的摄属关系如何？在十九个无知里的前三个无知于前际无知、于后际无知、于前后际无知，摄属于七个无知里的第一个无知对三世愚；其次的三个无知于内无知、于外无知、于内外无知，摄属于七个无知里的第二个无知对内外事愚；再其次的三个无知于业无知、于异熟无知、于异熟业无知，摄属于第三无知移转愚；再其次的三个无知于佛、法、僧无知，摄属于第四个无知最胜愚；再其次的四个无知于苦、集、灭、道无知，摄属于第五个无知真实愚；再其次的两个无知于因无知、于因所生诸行无知，摄属于第六个无知染净愚；最后一个无知于六触处如实通达无知，摄属于第七个无知增上慢愚。</p><p>原文：<strong>复有五种愚。一义愚。二见愚。三放逸愚。四真实义愚。五增上慢愚。前十九愚。今五种愚。相摄云何。谓见愚摄前六。及于因所生法无知。放逸愚摄。于业异熟俱无知。真实义愚。摄于佛等。乃至道谛无知。增上慢愚。摄最后无知。当知义愚通摄一切。</strong></p><p>释：另外又有五种愚：一是对于一切法都愚痴无知，二是没有正知见的愚痴，三是于生死流转的懈怠放逸愚痴，四是对三宝和苦集灭道真实义的愚痴，五是未得谓得的增上慢愚痴。前边所说的十九个愚与现在的五种愚，二者互相之间的摄属关系如何？见愚摄受十九个愚中的前六愚：于前际、后际、前后际无知、于内、于外、于内外无知，以及于因所生法无知；放逸愚摄受十九愚中的于业和异熟俱无知；真实义愚摄受十九愚中的于佛法僧无知，乃至于四圣谛无知；增上慢愚摄受十九愚中最后的于六触处无知；义愚摄受所有十九愚。</p><p>原文：<strong>复次。无知无见。无有现观。黑闇愚痴。及无明闇。如是六种无明差别。随前所说七无知事。次第应知。于后二无知事。总合为一。起此最后无明黑闇。复有差别。谓闻思修所成三慧。所治差别。如其次第。说前三种。即此所治软中上品差别。说后三种。如是所治差别故。自性差别故。建立六种差别应知。</strong></p><p>释：另外，无知、无正见、不能现前观察、心中黑暗、愚痴，以及无明暗黑，这六种无明差别，随同前边所说的七种无知事的次第也应该知道，六种无明与七种无知的后边两种无知，染净愚和增上慢愚合为一起，生起六种无明中最后的无明暗黑。另外还有差别，就是通过闻思修所修成的三种智慧闻慧、思慧和修慧，能对治两种无明的差别，按照次第是了知无明中的前三种：无知、无见和无有现观。这三种智慧对治的初、中、上品差别，是六种无明中的后三种：黑暗、愚痴和无明闇黑。还要应该知道的是：根据三种慧对治的差别，以及这几种法的自性差别，就建立了这六种无明差别。</p><p>在闻思修的时候，会生起闻慧、思慧和修慧，这三种慧是有差别的，是逐渐深入的，慧力最大的当然是通过修行获得的智慧，最浅的慧是通过闻法获得的智慧，通过思惟获得的智慧比闻慧深，比修慧浅。所以这三种慧所对治的愚痴也不相同，闻慧对治无知，获得知，仅仅是知而已；思慧对治无正见，获得正见，仅仅是有了正见而已；修慧对治没有现量观行，获得现观的智慧，从而能够现量观察诸法，这个智慧是最深的，能破除心中最根本的无明。</p><p>无明大体分为六种差别，由浅入深，当然浅的无明容易破除，深的无明难于破除。无知这种最浅的无明，只要闻法就能破除了，闻法之后就知了。无见这种无明，在闻法之后，需要再思惟，思惟过后就有正见了。而不能现前观察这种无明，修习过程中，生起禅定和观行智慧之后，就能破除这种无明。但是即使有了现前观察智慧，心中还是有更深的无明没有破除，需要在之后的修行过程中，实证诸法才能逐渐的破除，最后的一品无明暗黑破除了，也就成佛了。所以闻思修后边还有一个证，只有实证了才能破尽一切无明，实证才是佛道。</p><p>修行有四个阶段，除了前边的闻思修，还有最后最关键一步证，若闻思修而不证，则不能获得根本智，不能断烦恼，不能断尽无明，不能得解脱。闻思修所获得的智慧，与证法所获得的智慧，有根本区别，差别很大。若不证法，虽然能对治无知无见和无有现观前三个无明，却不能对治暗黑愚痴和无明闇三个深重无明，后三个无明随眠于众生心中，难知难除，若不实证，则大小乘的解脱都无望。</p><p>闻所获得的慧，在意识多闻的基础上只能解决无知的问题，知法只是最初阶段，有不少人只因为知法了就生起了慢，开始傲视群生，有的人甚至把闻慧当作证慧，造作了大妄语业。思慧是在知法的基础上，对所闻法起心思惟，有了进一步的认知，生起了智慧。但这也只是意识的比量和非量的认知，不解决根本问题，有一些人却把这种浅薄的思慧当作是证慧，造作了大妄语业，生起了我慢，傲视群生，成为增上慢人。</p><p>修慧比闻慧和思慧增进很多，修是修什么？修习助道之法，三十七道品和六度，修习戒定慧，在修习过程中断恶修善，降伏烦恼，增长智慧。修习助道之法为什么能增长智慧？因为守戒心清净，禅定增长，在禅定中能够一心观行思惟，能够现前观行诸法，在观行中增强了对诸法的知解，离见道就近了一分或者几分，但还达不到证的程度。</p><p>比如观呼吸，禅定比较好有未到地定的定力，观行比较得力和清晰，能够现前如实地观呼吸，对呼吸法有了一定的体会，对色身的认识增进了一步，有了一定的智慧认知，在从前就没办法现前观呼吸。但这时候也没有断身见，需要继续增进禅定和观行智慧，才能断我见，从而证法，出生证慧。又有一些人把修慧当作是证慧，造作了大妄语业。众生就是这样自觉和不自觉地误会自身的修证，因为经验不足，无力作以如实判断和辨别，再加之慢心我心作祟，大妄语就难免了。</p><p>闻思修证四种智慧，只有第四种证慧不能退失，前三种慧都有可能退失，也极容易退失，不但后世会退失，即使在现世遇到退失的因缘，也会退失。所以佛法只有自己证得了，才会永远是自己的，不会退失。而听闻来的，即使经过了自己的思惟和修习，作以加工了，也仍然不完全是自己的，不是自己的就容易失掉。当智慧退失以后，禅定也退失时，烦恼复现，所以学佛努力实证才是根本。</p><p>原文：<strong>身行云何。谓身业。若欲界若色界。在下名福非福。在上名不动。语行云何。谓语业。余如前应知。意行云何。谓意业。若在欲界。名福非福。在上二界。唯名不动。</strong></p><p>释：什么是身行？身行就是在身体上所造作的业行，或者造作欲界的业行，或者造作色界的业行，在无色界中不造作身行，因为无色界天人无身。是谁在身体上造作的业行？是意根让六识在色身上造作的业行。在下界的欲界中能造作福业和非福业，在上界的色界中造作的是清净不动行，因为色界中的众生具有甚深的禅定，心于境界不动，身受指挥也不动，就不造作身行。在无色界无身，也就没有身行，心也是清净不动的。身受谁指挥？身受意根指挥，意根不动心，意识就不动，身识也不动，身就不动。</p><p>什么是语行？语行就是在口上造作的业行，也就是口行。在下界欲界造作的语行是福行和非福行，在上界色界里，天人心清净，具足梵行，于境界心不动，口受心指挥，口就清净不动，没有语行。在无色界里，天人因为无口，就没有语行。</p><p>什么是意行？意行这里是指意识造作的业行，意识在欲界里造作的是福行和非福行，在上界色界和无色界里造作的是不动行，因为意根心清净不动，意识就清净不动，意识受意根主导。</p><p>原文：<strong>眼识云何。谓于当来依止眼根。了别色境识。所有福非福不动行。所熏发种子识。及彼种子。所生果识。如眼识如是。乃至意识。应知亦尔。由所依及境界所。起了别差别。应知此于欲界。具足六种。色界唯四。无色界唯一。</strong></p><p>释：什么是眼识？眼识是能依止于眼根了别色境的识，是所有的福行、非福行和不动行所熏染落下来的种子识，以及落下来的种子所出生的果报识。眼识如此，耳识、鼻识、舌识、身识乃至于意识也是这样，由所依的五根和五尘境界所生起的了别差别。应当了知，种子识和果识在欲界具有六种，就是六识，在色界里只有四种眼识、耳识、身识和意识，无色界只有一种意识，无前五识。</p><p>原文：<strong>受蕴云何。谓一切领纳种类。想蕴云何。谓一切了像种类。行蕴云何。谓一切心。所造作意业种类。识蕴云何。谓一切了别种类。如是诸蕴。皆通三界。</strong></p><p>释：什么是受蕴？受蕴是对于一切法所有的领纳种类：苦受、乐受和不苦不乐受。什么是想蕴？想蕴是对于一切境界显发出境界像的种类，即六识的显像作用，当然第七识也有显像作用。什么是行蕴？行蕴是一切识心所造作的思想、心意业行的种类，即六识的思心所，当然第七识也有思心所，也有行。什么是识蕴？识蕴是对于一切境界法的了别种类，即六识的了别，第七识也有了别。这些受蕴想蕴行蕴识蕴都通于三界，在三界中都存在，因为欲界色界无色界中都有意识，也有第七识，两个识都有受想行识的功能作用。</p><p>原文：<strong>四大种云何。谓地水火风界。此皆通二界。四大种所造色云何。谓十色处。及法处所摄色。欲界具十及法处所摄假色。色界有八及法处所摄色。然非一切。此亦二种。谓识种子所摄受。种子名色。及于彼所生果名色。</strong></p><p>释：什么是四大种子？地水火风界就是四大种子，都通于欲界和色界，这两个界都有色法，无色界没有色法，所以四大种子不通于无色界。四大种子和合起来都能造就出什么色法？能造就出十种色法及法处所摄色，欲界里具足十个色法：色、声、香、味、触、眼根、耳根、鼻根、舌根、身根，以及法处所摄色（法尘）这种假法；色界里有八种色法：色、声、触、眼根、耳根、鼻根、舌根、身根，和法处所摄色假法，没有香尘和味尘。</p><p>然而四大种子并非通所有法，还有其他法四大种子不能通，必须是有识种子才能通。四大种子与识种子共同通的法有两种，第一种法是识种子所摄受的在种子位的名色，种子没有现行出来，名色还没有出生，这是指中阴身阶段；第二种法是四大种子和识种子所共同出生的果报身名色。</p><p>四大种子和识种子都是阿赖耶识中的大种子，二者是并列平等的关系，共同组成了五阴名色。有形的色由四大种子形成，无形的名由识种子形成。</p><p>原文：<strong>眼处云何。谓眼识所依净色。由此于色已见现见当见。如眼处如是。乃至意处。随其所应尽当知。于一切处。应说三时业用差别。此亦二种。谓名色种子所摄受种子六处。及彼所生果六处。五在欲色界。第六通三界。</strong></p><p>释：什么是眼处？眼处就是眼识出生和运行所依的清净的胜义眼根，依清净的眼根，就能见到过去的色、现在的色和将来的色。眼处是这样，耳处、鼻处、舌处、身处乃至于意处也是这样，意识依意根能见到过去的法、现在的法和未来的法，随着所到之处都能有所了知。六识能到各个尘境，都是由意根抉择的，意根抉择之后六识才能生起，之后才能有所了别。</p><p>在眼处、耳处、鼻处、舌处、身处、意处的所有处，都有过、现、未三种业用差别。业用有两种，第一种是由名色种子所摄受的六入处种子，名色在种子位没有出生，六入处更是在种子位不能出生；第二种是在名色上出生的果报体六入处，前五入处在欲界和色界有，在无色界里没有，第六入处通于欲界色界和无色界。</p><p>原文：<strong>眼触云何。谓三和所生。能取境界净妙等义。如是余触。各随别境说相应知。此复二种。谓六处种子。所摄受种子触。及彼所生果触。欲界具六。色界四。无色界一。</strong></p><p>释：什么是眼触？眼触是眼根、色尘和眼识三者和合而出生的，能摄取清净微妙的色尘境界之义。耳触、鼻触、舌触、身触、意触也是这样，也是根尘识三者和合所出生的，都能取清净微妙的境界相之义。这包括两种，第一种是由六处种子所摄受的种子触，六入中的前五入在种子位没有出生，触就不会出生，由于意根不灭，意入处就不灭，只是不能在名色上有所触；第二种是由六入处所引生出来的果报身触。在欲界有六种触，在色界有四种触，没有鼻触和舌触，在无色界只有意触，没有前五种触。</p><p>原文：<strong>乐受云何。谓顺乐诸根。境界为缘。所生适悦受。受所摄。苦受云何。谓顺苦二为缘所生。非适悦受。受所摄。不苦不乐受云何。谓顺不苦不乐二为缘所生。非适悦非不适悦受。受所摄。欲界三。色界二。第四静虑以上。乃至非想非非想处。唯有第三不苦不乐。此亦二种。谓触种子所摄受种子受。及彼所生果受。</strong></p><p>释：什么是乐受？乐受是随顺于喜乐的六根和境界为缘，而出生的舒适喜悦的受，属于受所摄受的法。什么是苦受？苦受是随顺于苦的违心的六根和境界为缘，所出生的非舒适非喜悦的受，属于受所摄受的法。什么是不苦不乐受？不苦不乐受是随顺于不苦不乐的六根和境界为缘，所出生的非舒适非不舒适的受，属于受所摄受的法。在欲界有三种受，在色界只有乐受和不苦不乐受，没有苦受，在第四禅以上一直到非想非非想处只有不苦不乐受。不苦不乐受也有两种，第一种是触的种子所摄受的种子受，还没有出生的受；第二种是以触种子为缘所出生的果报受。</p></div>"
},{
    "title": "第二章 瑜伽师地论第十卷十二因缘 第一节 三界的欲爱有",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  瑜伽师地论第十卷十二因缘</strong></p><p><strong>第一节  三界的欲爱有</strong></p><p>原文：<strong>欲爱云何。谓欲界诸行为缘所生。于欲界行染污希求。由此能生欲界苦果。色爱云何。谓色界诸行为缘所生。于色界行染污希求。由此能生色界苦果。无色爱云何。谓无色界诸行为缘所生。于无色界行染污希求。由此能生无色界苦果。</strong></p><p>释：什么是欲爱？欲爱就是以欲界的所有行色受想行识为缘所出生的爱乐，在欲界里所行的染污的希求、追求、想法和愿望，由这些希求和爱乐能出生欲界的苦果。什么是色界爱？色界爱就是以色界的所有行色受想行识为缘所出生的爱乐，在色界里所行的染污的希求和愿望，由此染污的希求能出生色界的苦果。什么是无色界爱？无色界爱就是以无色界的一切行受想行识为缘所出生的爱乐，在无色界所行的染污的希求和愿望，由此能出生无色界的苦果。</p><p>欲界诸行包括欲界中一切的生命活动，五蕴的一切造作，根尘识三者和合触以及受、想、思，六识见一切法所起的贪嗔痴慢疑邪见等等染污心行。染污就是指心不清净、不寂静、不舍、有所求取、有我我所等等。由于众生心常处染污坑中，染污得太严重了，也习以为常了，很难反观到自心的染污，也不知染污和清净的界限和标准，认为自己的一切心行都很正常，天经地义，本来就如此，所以众生的修行很难走上正轨。修证之路确实很漫长和艰难，要想脱胎换骨，证得初果和初果向并不是一件容易的事。</p><p>色界和无色界有四禅八定，为什么还有希求，还有染污，有染污行？初果二果人没有四禅八定，有四禅八定了就是三果和四果人。而凡夫众生的四禅八定只能压伏和降伏烦恼，不能断除烦恼，他们没有断我见，由于无明和我见而有各种不如理作意，有染污希求。比如以色身为我，希求永不灭失，以受为我，贪求禅定之乐，以识为我，处于想阴境界等等。色界诸行包括眼触生受，耳触生受，身触生受，意触生受，之后色爱出生，而有染污希求。无色界诸行只有意触生受，爱着禅定境界而有染污希求。</p><p>同理，色界和无色界的天人也有染污希求和染污行，除了三果阿那含和四果阿罗汉，其余天人都有不同程度的染污。而初果须陀洹和二果斯陀含没有初禅定，命终如果生天只能去欲界天，不能到色界无色界天。三果人有初禅以上的禅定，命终会生到五不还天，有的会在中阴身成为四果入无余涅槃，四果不回心大乘者直接入无余涅槃。</p><p>所以色界和无色界天的天人几乎都是有四禅八定的凡夫，凡夫未断我见，也就未断烦恼，依靠禅定只能降伏比较粗重的贪嗔痴烦恼。凡夫天人因为未断我见，把五蕴十八界当中的某一法或者多个法或全部法当作我，加以执取，几乎都有染污的心行和趣向，几乎都有染污的希求和愿望。比如希求长生不老，希求永生不死，希求禅定乐和定福，这些希求就是欲望和染污，就是生死轮回业，能感召生死苦，不出轮回。色界和无色界有什么苦？生灭变异就是苦，死就是苦，知道死后还有轮回就是苦，知道死后取三恶道受报就是苦，生命不能永存就是苦，身体不能长生不老就是苦。</p><p>原文：<strong>欲取云何。谓于诸欲所有欲贪。见取云何。谓除萨迦耶见。于所余见所有欲贪。戒禁取云何。谓于邪愿所起戒禁所有欲贪。我语取云何。谓于萨迦耶见所有欲贪。初唯能生欲界苦果。余三通生三界苦果。</strong></p><p>释：什么是欲取？欲取是对于欲界所有的法所生起的贪欲和取着。什么是见取？见取是除了我见之外，对其余知见的所有贪欲和取着。什么是戒禁取？戒禁取是对于依不如理的邪愿产生的禁戒所生起的所有贪欲和取着，如外道以为受苦行就能灭去所有罪业，于是就发愿每天都自受难忍之苦，徒劳地折磨自己，对此禁戒坚持不懈的执取。什么是我语取？我语取就是由于我见而生起的所有贪欲和取着。第一种欲取能出生欲界的苦果，见取、戒禁取和我语取能出生三界苦果。</p><p>取欲界法就不离欲界生死轮回，不能去色界和无色界以及其他诸佛国土，更不会涅槃。欲界中众生才会取欲界法，色界和无色界众生取色界和无色界法，以及取涅槃和其他佛国土。我见之外的其余的知见都是邪见比较多，比如认五阴身为大梵天所造，或是神力所造等等，执取这个邪见，就没有正见，不得解脱。由于我见而生起的欲贪，范围很广，没有断我见的众生都有这种欲贪。</p><p>原文：<strong>欲有云何。谓欲界前时有。业有死有。中有生有。及那落迦傍生饿鬼人天有。总说名欲有。此复由先所作。诸行烦恼摄受。之所熏发。色有云何。谓除那落迦。傍生饿鬼人有。所余是色有应知。无色有云何。谓复除中有。所余是无色有应知。</strong></p><p>释：什么是欲有？欲有就是生于欲界之时的有，包括造作业行的有，死亡时的有，中阴身的有，出生时候的有，以及地狱、畜生、饿鬼、人、欲界天人的有，总和起来说就是欲有，这是由于先前所造作的欲界诸行烦恼业的摄受，所熏发和感召出来的。</p><p>什么是色有？除了地狱、畜生、饿鬼、人之外，剩下的有就是色界的有，包括业行的有、死亡时候的有、中阴身的有、出生时候的有。什么是无色有？在色有之上再除去中阴身的有，剩下的就是无色有，包括业有、死有、生有。</p><p>欲界有就是欲界诸行，身口意行、受想行识、以及境界，包括五蕴所行的戒定慧，以及贪嗔痴无明烦恼。色界有是色界诸行，包括身行意行、受想行识、境界和定慧。无色界有就是无色界诸行，意行、受想行识和禅定境界。</p><p>原文：<strong>问。依何义故建立七有。所谓那落迦傍生。饿鬼人天有。业有中有。答。依三种所作故。一能引有谓一。二趣有有谓一。三受用果有谓五。生云何。谓于胎卵二生。初托生时。等生云何。谓即于彼身分圆满。仍未出时。趣云何。谓从彼出。起云何。谓出已增长。出现云何。谓于湿化二生。身分顿起。</strong></p><p>释：问：依于什么理建立了七种有地狱、畜生、饿鬼、人、天人、业有和中有？答：依于三种所作业分成了七有：第一种是能引生三界有的，就是业有；第二种是能趣向于三界有的中有；第三种是受用着果报的三界有，就是五道众生的有。</p><p>什么是生？生就是胎生和卵生两种众生刚刚出生的时候。什么是等生？等生就是在胎卵中色身支分已经成熟圆满了，还没有出生的时候，俗话说就是等待出生。什么是趣？趣就是从胎卵中生出来。什么是起？起就是众生出生以后的增长阶段。什么是出现？出现就是湿生和化生两种众生，身体支分顿时现出来。</p><p>原文：<strong>蕴得云何。谓即于彼诸生位中。五取蕴转。界得云何。谓即彼诸蕴因缘所摄性。处得云何。谓即彼诸蕴。余缘所摄性。诸蕴生起云何。谓即彼诸蕴。日日饮食之所资长命根。出现云何。谓即彼诸蕴。余寿力故。得相续住。</strong></p><p>释：蕴得是什么意思？蕴得就是在一切有的生位中，色受想行识五取蕴运转出来了，是五蕴生出来显现出来的意思。界得是什么意思？界得就是由五取蕴的种种因缘所摄受的属性。处得是什么意思？处得就是五取蕴其余的因缘所摄受的属性，如内六入处、外六入处，合在一起的根尘相触处。五取蕴的生起是什么意思？就是五取蕴每日以饮食维持生命，资益长养命根不灭。出现是什么意思？生命体出生以后，以五取蕴剩下的寿命力因缘使得生命体相续住世。</p><p>界得可以说为得界，有了法界，包括根界、尘界和识界。比如在五蕴中，各根有各根的属性，各尘有各尘的属性，各识有各识的属性，因为属性不同，所以法与法之间就有界限，法出生了，就是界得了。</p><p>原文：<strong>此生支略义者。谓若生自性。若生处位。若所生。若因缘所摄。若任持所引。若俱生依持。是名略义。衰云何。谓依止劣故。令彼掉动。老云何。谓发色衰变。摄云何。谓皮肤缓皱。熟云何。谓火力衰减。无复势力受用欲尘。</strong></p><p>释：这个十二因缘中的生支大略含义是这样的，生的大略含义或者指生的自体性，或者指生所处的段位，或者指所生被生，或者是指由因缘所摄持，或者任运执持所引出来的法，或者是与生俱来所依持的法。什么是衰？衰是指所依止的法劣弱的缘故，使得自身衰退羸弱。什么是老？老是指肤发相貌的衰变。什么是摄？摄就是指皮肤渐渐的出现了皱纹。什么是熟？熟就是指色身中的火力衰减，不再有旺盛的精力受用五欲六尘。</p><p>生的自性是从无到有，新出现名为生。生所处分为几个段位，比如在母胎中的几个段位，从母胎出生，再渐成长。若甲生乙，乙是所生。生这件事是由因缘和合出现的法，无因无缘就不会有生，有生必定有因缘所摄，因此生是空法。生也是任运执持所引出来的法，比如名色任运生长，就会有六入生出来，六入成长，就会有触生出来，根尘相触有识生出来等等。</p><p>原文：<strong>气力损坏云何。谓性多疾病故。无有势力能作事业。黑黡间身云何。谓黯黑出现。损其容色。身脊伛曲。喘息奔急云何。谓行步威仪。身形所显。由此发起极重喘嗽。形貌偻前云何。谓坐威仪位。身首低曲。凭据杖策云何。谓住威仪位。依杖力而住。</strong></p><p>释：气力损坏是什么意思？就是指性体有多种疾病，没有力气和势力能作什么事业。黑黡间身是什么意思？这是说身体出现了暗黑，容色受损。身体脊背弯曲，喘气急促是怎么回事？这是弯腰驼背，气息不调的现象，从身形上显示出来行住坐卧没有威仪了，因此就出现了严重的喘息和咳嗽。形体外貌弯腰向前是什么状态？这表示身体坐得威仪端正，但身体和头却是低下弯曲的。凭据拄杖伫立行走是什么意思？意思是身体虽然威仪端正，但是必须手持拄杖才能站得稳走得稳。</p><p>原文：<strong>昏昧云何。谓卧威仪位。数重睡眠。羸劣云何。谓即于此位。无力速觉。损减云何。谓念慧衰退。衰退云何。谓念慧劣故。至于善法不能现行。诸根耄熟云何。谓身体尪羸。功用破坏云何。谓彼于境不复明利。诸行朽故云何。谓彼于后将欲终时。</strong></p><p>释：昏昧是什么意思？昏昧是指身体处于躺着的状态，心很昏沉，睡眠很重。赢劣是什么意思？赢劣是没有力量快速的觉察，心力不足，行动力不足。什么是损减？损减是心念力和慧力都衰退了。什么是衰退？衰退的意思是由于念力和慧力都劣的缘故，致使善法不能现行出来。诸根耄熟是什么意思？这是指身体瘦弱了。功用破坏是什么意思？意思是对于境界不再聪明伶俐，反应迟钝了。诸行朽故是什么意思？意思是一切身口意行都衰败，不久就会命终了。</p><p>原文：<strong>其形腐败云何。谓寿量将尽。身形临坏。于诸事业。无复功能。此老略义者。谓依止变坏。须发变坏。充悦变坏。火力变坏。无病变坏。色相变坏。威仪变坏。无色诸根变坏。有色诸根变坏。时分已过。寿量将尽。略义应知。彼彼有情云何。谓那落迦等。有情种类云何。谓即彼一切。</strong></p><p>释：形体腐败是什么意思？意思是寿命即将到头了，身体的形态面临着毁坏，对于所要作的事业，不再有能力去作了。老的大略意思是，所依止的身根变坏，须发灰白变坏，精神状态变坏，身体的火力变差，身体健康变坏，色身相貌变坏，行住坐卧的威仪变差了，无色相的意根变坏了，有色相的五根变坏了，活着的时光快没有了，寿命即将到尽头了。意根如何变坏呢？比如出现的种种癔病、精神疾病、心理障碍等等。什么是彼彼有情？这是指地狱等六道众生。有情的种类是什么意思？意思是指所有一切众生。</p><p>原文：<strong>终云何。谓诸有情。离解支节而死。尽云何。谓诸有情。由解支节而死。坏云何。谓识离身。没云何。谓诸色根灭。舍寿云何。谓气将尽位。舍暖云何。谓不动位。弃舍诸蕴。命根谢灭云何。谓时死。</strong></p><p>释：什么是终？终就是一切有情众生的生命到头了，离四大分解，色身肢解离析而死不远了。尽是什么意思？意思是所有有情众生身根肢解，四大都分离而死了。坏是什么意思？意思是八个识都离身了。没是什么意思？意思是所有有色的五根都灭了。舍寿是什么意思？意思是气息快消尽了。舍暖是什么意思？意思是五蕴处于停滞不动了，都舍弃了。命根谢灭是什么意思？意思是死亡了。</p><p>原文：<strong>死云何。谓遇横缘。非时而死。时运尽云何。谓初死未久位。又死魔业名时运尽。此死略义者。谓若死若死法。若死差别。若死后位。是名略义。如是名为。缘起差别应知。</strong></p><p>释：死是什么意思？意思是遇到非常强硬的逆缘，不到寿命就死了，也就是横死的意思。时运尽了是什么意思？意思是刚刚死了没有多长时间，死亡的魔业也叫作时运尽。这个死的大略意思，包括了死亡，包括是如何死的，包括了死的种种差别相，包括了死后的去向，这是死的大略含义，也叫作死的缘起差别。</p></div>"
},{
    "title": "第二节 缘起次第",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第二节  缘起次第</strong></p><p>原文：<strong>问。何因缘故。无明等诸有支。作如是次第说。答。诸愚痴者。要先愚于。所应知事。次即于彼。发起邪行。由邪行故。令心颠倒。心颠倒故。结生相续。生相续故。诸根圆满。根圆满故。二受用境。</strong></p><p>释：问：是什么因缘使得无明等十二因缘的十二有支作这样的排序，按照这样的次第讲说？答：所有愚痴的人首先要对于所应该了知的事情愚痴不懂，再次即于所不懂的事情发起邪恶不正之行，由于造作了邪行的缘故，令心颠倒，由于心颠倒的缘故，烦恼结缚使得生命相续不断。因为生命相续不断的缘故，六根圆满具足，六根圆满的缘故，有五阴身正报受用和生存环境的依报受用。</p><p>原文：<strong>受用境故。若耽着若希求。由希求故。于方觅时。烦恼滋长。烦恼滋长故。发起后有。爱非爱业。由所起业。滋长力故。于五趣生死中。苦果生。苦果生已。有老死等苦。谓内身变异。所引老死苦。及境界变异。所引忧叹苦。热恼之苦。是故。世尊如是次第。说十二支。</strong></p><p>释：由于有了受用境界的缘故，就会沉湎于受用境界中不能自拔，或者是生起更多的希求。因为有希求的缘故，在四处寻觅所求的过程中，烦恼就会滋长起来。由于烦恼滋长的缘故，就生起了后世三界有的可爱和不可爱的业行。由于所造的业行滋长的缘故，在五道生死轮回中苦果就生起来了。苦果生起来以后，就有生老病死等等苦恼。这些苦恼就是色身变异所引起的老死苦，以及境界变异所引起的忧悲叹息苦和热恼之苦。因此，世尊按照这样的次第宣说十二支分。</p><p>原文：<strong>复有次第差别。谓依二种缘。建立缘起次第。一内身缘。二受用境界缘。内身缘。前六支所摄。受用境界缘。后六支所摄。先于内身。起我执等愚。由此不了。诸业所引。苦果异熟故。发起诸业。</strong></p><p>释：又有其他的次第差别，是指依着两种缘建立起来的缘起次第，一个缘是内身缘，也就是五阴身，一个缘是受用境界的缘，也就是生存环境。内身缘由无明、行、识、名色、六入、触前六支所摄受，受用境界缘由受、爱、取、有、生、老病死后六支所摄受。众生先是对于内身生起我执等愚痴，因为有这样的愚痴，不明了五阴身所造作的一切业行，能引生出苦的异熟果的缘故，就发起了一切业行。</p><p>这里说前六支摄受内身五阴身，由于无明造作业行生起名色，在名色上生出六入，有六入以后就有了后六支，后六支都是五阴身所受用的境界，也是六入触的后果。所以十二因缘就依于内身和受用境而建立起来的。</p><p>原文：<strong>既发起已。即随彼业。多起寻思。由业与识。为助伴故。能感当来三种苦果。谓根初起。所摄苦果。根圆满所摄苦果。受用境界所摄苦果。即名色为先。触为最后。</strong></p><p>释：业行发起来以后，就随着那些业行不断的生起寻思求取，业行和心识为助缘，能招感未来世的三种苦果：一是五根初生起在母胎里的苦果，二是五根圆满出生以后所受的苦果，三是在受用境界时所受的苦果。这三种苦果出现的条件是先有名色，最后再有触，苦果才能出现。</p><p>原文：<strong>又于现法中。依触缘受。发起于爱。由受用境界缘。广起追求。或由事业门。或由利养门。或由戒禁门。或由解脱门。发起欲求。内身求。邪解脱求。如是求时。令先所起烦恼。及业所引。五趣生死果生。既得生已。老死随逐。 </strong></p><p>释：又在现前存在的法中，依赖着由于触的因缘产生的受，而生起了爱，由于有受用境界的缘，就广泛的生起了追求和求取，或者在生存事业方面，或者在名闻利养方面，或者在戒禁取方面，或者在解脱生死方面，生起了贪欲的求索、五阴身的求索，和邪解脱非正解脱的求取。像这样贪求的时候，就使得由从前所生起的烦恼以及烦恼业行所引发的五道生死轮回果出生了。生出现以后，老死就随逐其后。</p><p>原文：<strong>复有次第差别。谓由三种有情聚。一乐出世清净。二乐世间清净。三乐着境界。由初聚故。灭诸缘起。增白净品。由第二有情聚故。不如实知。诸谛道理。若住正念。或作福业。或作有漏修。所引不动业。若不住正念。便发非福业。或起追悔所引。或不追悔。欢喜所引。心相续住。</strong></p><p>释：另外还有次第差别，有三种有情聚落，第一种是乐于出世间清净法的有情，第二种是乐于世间清净法的有情，第三种是欣乐着境界法的有情。因为有第一种有情聚落的缘故，就会灭除一切缘起法，增加清净无染的业种。</p><p>因为有第二种有情聚落的缘故，不如实了知四圣谛之理，如果他们能住在清净的正念上就会造作一些福业，或者是造作一些有漏的修行所引出来的不动业行，比如说纯粹的禅定，达到四禅定身心不动；如果有情心不住在正念上，就会造作一些非福业，有些人造作了非福业会心生追悔，有些人造作非福业之后，心不但不追悔，还很欢喜，这样就引发了心相续不断地住着，不能灭除。</p><p>原文：<strong>彼又如前。于下中上。生处次第。能感当来。三种苦果。谓名色为先。触为最后。由第三有情聚故。依现受用境所生受。于现法中。如前次第。起后六支。谓受为先。老死为后。</strong></p><p>释：这些人又像从前一样，由此非福业能感召下中上三种次第出生之处。由三种出生之处，就会有三种相应的苦果相伴随。在这个前六支因缘中，最先有名色，最后才有触，由此苦果就出现了。因为有第三种有情聚落的缘故，依靠现前受用境界所出生的受，在现前存在的法中，像先前的次第一样，生起后边的六支受、爱、取、有、生、老死，受在最先，老死在最后。（以上讲的是顺十二因缘观）</p><p>原文：<strong>问。何因缘故。逆次第中。老死为先。说诸缘起。答。依止宣说。谛道理故。以生及老死。能显苦谛。如世尊言。新名色灭。为上首法。</strong></p><p>释：问：是什么因缘致使在逆推因缘法的次第中，以老死为先来说十二缘起法？答：这是依止于世尊所宣说的四圣谛道理的缘故，因为生和老死能显示出苦谛，就如世尊所说的新的名色灭了是最上第一之法。新的名色灭而不生，老死问题就解决了，无老死就解脱涅槃。</p><p>原文：<strong>问。何故不言。诸无明灭为上首耶。答。依心解脱者。而施设故。由彼于现法中。种子苦及当来苦果。不生而灭。故说名色为先。受为最后。得究竟灭。又于现法中。受诸受时。爱及随眠。永拔不起。说名为灭。由彼灭故。以彼为先。余支亦灭。如是等类。宣说缘起次第应知。</strong></p><p>释：问：为什么不说所有无明灭了才是最上的法呢？答：以后世的新名色灭为第一法，这是依照心解脱的人而施设的，心解脱了老死就灭了。由于老死在现世的法中，种子中的苦以及未来应受的苦果，这些苦果不用出生就灭了。所以说逆因缘法的次第以名色为先，受在最后，名色才能究竟灭了。又在现存之法中，受用诸受的时候，爱以及爱的随眠能够永远拔出，不再生起，就说是爱灭。由于爱灭的缘故，就以爱为先，其它几支随后也就会灭了。修因缘法应该了知，类似于这样讲法就是宣说缘起法的次第。</p><p>原文：<strong>问。何故缘起。说为缘起。答。由烦恼系缚。往诸趣中。数数生起。故名缘起。此依字释名。复次依托众缘。速谢灭已。续和合生。故名缘起。此依刹那义释。复次众缘过去。而不舍离。依自相续。而得生起。故名缘起。如说此有故彼有。此生故彼生非余。依此义故。释名应知。</strong></p><p>释：问：为什么把缘起法说为是缘起？答：由于烦恼的系缚往生到六道里，无数次的生起五阴身，所以把五阴身叫作缘起，这是依着字义来解释缘起名。另外五阴身又依托着众多的因缘，快速的谢灭以后，又相续不断的因缘和合而出生，所以叫作缘起，这是依着刹那生灭的含义来释名的。另外，众多因缘虽然灭去了，但是五阴身却没有舍离，依着自身的相续缘而再次生起，所以叫作缘起。这就是所说的此有故彼有，此生故彼生，不是由于其他原因出生的，依着这个含义的缘故来解释缘起。</p><p>原文：<strong>复次。数数谢灭。复相续起。故名缘起。此依数坏数灭义释。复次。于过去世觉缘性已。等相续起。故名缘起。如世尊言。我已觉悟。正起宣说。即由此名。展转传说。故名缘起。</strong></p><p>释：另外又说五阴身无数次的谢灭，又无数次地相续生起，叫作缘起，这是依照五阴身无数次的毁坏、无数次的谢灭的含义来释名的。另外，在过去世的时候，由于觉悟了五蕴世间缘起之性以后，与过去世相同类的五蕴身又相续生起，所以叫作缘起。就如世尊所说：我已经觉悟了，就堂堂正正的出到世间，来宣说因缘法。即是由于这个缘起的名字，辗转传说，所以才说为缘起。</p><p>原文：<strong>问。无明望行。为几种缘。答。望诸色行。为增上缘。望无色行。为三缘。谓等无间缘。所缘缘。增上缘。如是余支。为缘多少。应如此知。谓有色支。望有色支。为一增上缘。望无色支为二缘。谓所缘缘。及增上缘。若无色支。望有色支。唯为一缘。望无色支为三缘。谓等无间缘。所缘缘。增上缘。</strong></p><p>释：问：无明缘行这支有几种缘？答：无明缘（引生）一切色法的行（身行、口行）只有一种缘，是增上缘；缘（引生）无色法的行（意行）有三种缘：等无间缘、所缘缘和增上缘。其它几支各有什么缘应该依如下而知：有色法的支分缘（引生）有色法的支分，只有一个增上缘；有色法支分缘（引生）无色法的支分有两种缘：所缘缘和增上缘。如果是无色法的支分缘（引生）有色法的支分，只有一个增上缘；无色法支分缘（引生）无色法支分有三种缘：等无间缘、所缘缘和增上缘。</p><p>有色法的支分与身口有关，是身口的造作，无色法的支分与识心有关，是识心的造作。有色法的支分，可以引生有色法和无色法两种支分，无色法支分也可以引生出有色法和无色法两种支分，有色法与无色法支分可以互相摄受。</p><p>只有无色法与无色法支分之间有三种缘，因为都是识心及心所法部分，种类相同，能互相缘和互相增进。有色法与有色法支分之间只有增上缘，一种色法促进另一种色法的生起，但有色法支分对于无色法支分却是两种缘：所缘缘和增上缘，因为有色法是无色法的所缘相分，所以是所缘缘，有色法又能促进无色法的生起，所以是增上缘，而无色法对于有色法只能是增上缘一种。</p><p>等无间缘的意思是，种类相等，并且无间断的缘。识心与识心之间是相等的，识心与心所法是相等的，并且是同类识心。如意识与意识之间是等无间缘，意根与意根之间是等无间缘，眼识与眼识之间是等无间缘等等，另外心所法与其相应的识心是等无间缘，或者说识心与其相应的心所法是等无间缘。</p><p>但不是所有的心所法都是与其相应的识心是等无间缘，因为心所法不是时时处处都存在，都伴随于识心，只有时时处处伴随于识心的心所法，与识心之间才是等无间缘，比如说无明，比如说触和作意。等无间缘也不是永远都是等无间缘，是阶段性的一段时间内的等无间缘，当无明灭去，当识心不再受和想，心所法就不是识心的等无间缘了。无明是识心所缘的法，是识心所具有的法，与识心相应，无始劫以来一直伴随着识心运转，不相分离，所以无明是识心的等无间缘，也是识心的所缘缘和增上缘。</p><p>所缘缘的意思是，一切法都是识心所缘的相分，相分也是一种缘，就是识心的所缘缘。所缘缘也叫作所缘境，分为亲所缘缘和疏所缘缘。亲所缘缘是识心亲自所缘的法，是直接所对应的法，与法不能分离。疏所缘缘是识心间接所缘的法，与识心是分离的，不是直接能缘的法。比如甲的色身和识心，是乙的识心的疏所缘缘，乙的识心能够脱离甲的五阴身单独存在，甲存在与否并不影响乙的识心运转。再比如第八识所现起的本质境，就是识心的疏所缘缘，识心并不能直接缘本质境，只能缘本质境转变过来的性境、带质境和独影境。识心也不能直接缘种子，所以种子也是识心的疏所缘缘。除此，都是识心的亲所缘缘。</p><p>增上缘的意思是，这种法能够成为另一种法生起的所依和助缘，对另一种法的产生起着协助、辅助和助推的作用，而不是直接和主要的作用，不是法生起的主要因素。</p><p>由无明到行这支，无明是意根的无明，是无色支，只有无色的识心才有无明，有色的法不涉及明和无明。意根有无明才有行，其中行分为色法的行，如身体的行和口上的行，还有无色法的心行，无明只是有色行的增上缘，能够促进有色行的产生和发展变异，色法不是心法，没有等无间缘和所缘缘，只有心法才有等无间缘和所缘缘，所以身行和口行没有等无间缘和所缘缘，心行有等无间缘和所缘缘，以及增上缘。无明与意根同时存在，没有间断过，有意根就有无明，意根缘于无明才有行，所以无明是意根所缘的缘，意根的无明又能促进六识不断的行，成为行的增上缘。</p><p>行缘识这支，由行促使六识不断地运行和业种的出生，有色行是六识的所缘缘和增上缘，无色行是意识的等无间缘、所缘缘和增上缘。识缘名色这支，六识相续不断的运行是后世色身的增上缘，是后世名（受想行识）的等无间缘、所缘缘和增上缘。</p><p>名色缘六入这支很复杂，名是前五入的增上缘，是后一个意根入的等无间缘、所缘缘和增上缘，色是前五根入的增上缘，是意入的所缘缘和增上缘，因为五根入是色法不是识心，所以没有等无间缘和所缘缘。</p><p>六入缘触这支，意根入是意根触的等无间缘、所缘缘和增上缘，前五根入是五根触的增上缘，没有所缘缘和等无间缘。触缘受这支，意根的触是意识受的等无间缘、所缘缘和增上缘，有受一定有触，触一旦断开了，受就消失；五根的触是五识受的所缘缘和增上缘，五识受的等无间缘是阿赖耶识和意根以及五识。</p><p>受缘爱这支也是如此，受是爱的等无间缘、所缘缘和增上缘，相等无间的缘于受才能有爱，爱所缘的缘是受，没有受就没有爱，受能增长爱，引生爱。五识的受和意识的受都统一在意根这里，五识的爱、取和意识的爱、取也统一在意根这里，受意根操控，所以总归起来就是意根的受、爱、取。</p><p>爱缘取这支也是同样，爱是取的等无间缘、所缘缘和增上缘，取相等无间的缘于爱，没有爱就没有取，取所缘的缘就是爱，爱能增长取。取缘有这支，取只是有的增上缘，不是等无间缘，也不是所缘缘。有缘生这支，有是色生的增上缘，是名生的所缘缘和增上缘，不是等无间缘，生的等无间缘是阿赖耶识和意根以及六识业种。生缘老死这支，色生是老死的增上缘，不是等无间缘和所缘缘，名生是老死的等无间缘、所缘缘和增上缘。</p><p>原文：<strong>问。何故诸支相望。无因缘耶。答。因缘者。自体种子缘所显故。问。若诸支相望。无因缘者。何故说言。依因果体性。建立缘起耶。答。依增上缘所摄。引发因。牵引因。生起因故。说名为因。</strong></p><p>释：问：为什么这些支分相缘中没有因缘呢？答：所谓的因缘是诸支分自体种子的缘所显现出来的。问：这些支分相互缘和牵引，如果没有因缘，为什么说依着因果的体性建立了缘起呢？（因果体性是前因能生后果，后果就是缘起的法。）答：这些支分是依靠增上缘所摄受的，前支分是后支分的引发因、牵引因和生起因，方便说为因，后支分就是果，所以说依因果体性建立缘起法。</p><p>因缘是四缘中最重要的缘，是出生诸法的直接之因，种子属于因缘法，种子在因位，（除无明之外的）十一支分在果位，有因必有果，缘也就是因的意思，是种子引生了十一支分的出现，种子是指六识身口意行留下的业种。这个含义非常深奥，能产生诸支分的自体种子都来自于阿赖耶识，都存在阿赖耶识中，换句话说这些支分都是阿赖耶识所出生的，阿赖耶识和自体种子是这些支分的因缘。</p><p>在十二因缘中，只有识缘名色一支中名色的出生是有种子的，前世六识的身口意行种子是此世名色出生的因缘。而名色后边支分的出生都没有种子，每个支分都是由前边支分引生出来的，就是说前边支分是后边支分的增上缘，或者是等无间缘，或者是所缘缘，但都没有种子因缘。无明缘行和行缘识也是如此，没有种子因缘，只有等无间缘、所缘缘和增上缘。但广义地说，十二因缘中的后十一支分的出生和运行，也不是没有种子的，都有一定的业种摄受着，受业种的局限，也有七大种子的摄受。</p><p>原文：<strong>问。几支是引因所摄。答。从无明乃至受。问。几支是生因所摄。答。从爱乃至有。问。几支是生引二因果所摄耶。答。于现法后法中。识等乃至受。于生老死位。所摄诸支。</strong></p><p>释：问：十二支分中有几支是引因所摄受的？答：无明缘行、行缘识、识缘名色、名色缘六入、六入缘触、触缘受，这七支是引因所摄受的，能引生后一支分。问：有几支是生起因所摄受的？答：受缘爱、爱缘取、取缘有，这三支是生起因所摄受的，能生起生支和老死支。问：有几支是生起因和引发因两个因果所摄受的？答：在现前存在的法和后世生起的法中，识缘名色、名色缘六入、六入缘触、触缘受这四支，对于生和老死位支分，是生起因和引发因两个因果所摄受的。</p><p>无明能引生行，但不能出生行，引是引导，是助缘增上缘，出生是直接生，无明无体无心无种子，不能生行，只能作为阿赖耶识出生行的引子，没有这个引子，阿赖耶识就无法出生行。行是六识（业种）的引因，不是直接出生六识（业种）的因，行没有自体性，也没有种子，所以无法出生六识（业种），是阿赖耶识借助于行出生了六识（业种）。六识业种是名色因缘，不能直接出生名色，是阿赖耶识借助于六识业种的缘出生了名色，六识的造作所落谢的种子能引生后世的名色。</p><p>名色是六入的引因，不能直接出生六入，是阿赖耶识借助于名色出生了六入，其中意入是原本就有的，不是阿赖耶识新出生的。六入是触的引因，能引生出触，但不能直接出生触，因为六入无自体性，没有种子，就无法出生触，是阿赖耶识借助于六入这个引因出生了触。触是受的引因，能引生出受，但不能直接出生受，因为触无自体性，又不是识心，没有种子，是阿赖耶识借助于触出生了受。</p><p>爱、取、有三支是后世的生和老死支的生起因，如果没有爱取有，就会灭去五蕴身，入无余涅槃，没有了生和老死，所以爱取有三支是后世支分的生起因。</p><p>原文：<strong>问。若说无明。以不如理作意为因。何因缘故。于缘起教中不先说耶。答。彼唯是不断因故。非杂染因故。所以者何。非不愚者。起此作意。依杂染因。说缘起教。无明自性是染污。不如理作意自性非染污。故彼不能染污无明。然由无明力所染污。又生杂染业。烦恼力之所熏。发业之初因。谓初缘起。是故不说不如理作意。</strong></p><p>释：问：如果说无明是以不如理作意为因，是什么缘故在缘起法教中不先说不如理作意，而直接说无明呢？答：不如理作意只是缘起法不能断灭的因，不是善恶无记三性杂染的烦恼因，为什么这样说呢？因为正是那些愚痴无明者才会起不如理作意，如果没有无明就不会生起不如理作意，所以无明为先，依据杂染的烦恼因才说缘起的教法。</p><p>无明的自体性是染污的有烦恼的，不如理作意的自体性不是染污的有烦恼的，所以不如理作意不能染污无明，却能被无明所染污。又因为生起的杂染业，是烦恼力所熏染的，烦恼力就是无明力，杂染业生起的最初因就是最初的缘起法，因此在最先就不说不如理作意。</p><p>原文：<strong>问。何故不说自体。为自体缘耶。答。由彼自体。若不得余缘。于自体杂染。不能增长。亦不损减。是故不说。问。何因缘故。福行不动行。由正简择功力而起。仍说用无明为缘耶。答。由不了达。世俗苦因为缘。起非福行。由不了达。胜义苦因为缘。生福及不动行。是故亦说。彼以无明为缘。</strong></p><p>释：问：为什么不说自体是自体的缘呢？答：如果只有自体，没有其他的什么缘，其自体的杂染既不增长，也不损减，因此不说自体是自体的缘。譬如无明，如果没有其他缘，无明自身就不会增长或者减少。需要五阴遇到善恶因缘，受到熏染才能增加或者减少无明。</p><p>问：是什么因缘，造作福业之行与不造作福业和非福业的清净不动行，是由于正确的拣择诸法的功德力生起来的，却仍然说都是以无明为缘而生起来的？答：因为由于内心不能通达的了解世俗苦生起的因是贪嗔痴缘，而造作了非福之行业，由于不能通达的了知胜义上所说的苦因是无明缘，而造作了福行和不动行，因此说这三种行都是以无明为缘而生起的。</p><p>以上这段是说众生由于不能充分地了解世间苦，而造作损减福德的恶业行，由于不能充分地了解胜义谛所显示的空理，而造作了增益世间福德的善行和不善不恶的清净不动行。众生修福的善行是为了世间有为的受用，不是为了出世间的清净道业，这就是无明。众生也因为不能了达胜义谛所显示的空义，修了不善不恶的不动行，比如外道所修的纯粹的禅定，一心入定，在世间里既不行善不行恶，世间福既不增益也不损减，这同样是因为不知何为解脱的无明的缘故，也是执世间禅定的有为业行，同样是系缚生死的苦业，不能得解脱。</p><p>了达胜义空的圣者，无明破除，心地无为，无相、无作、无愿，不为世间利益而造作增幅、损福和不动业行，即使造作福行，也为出世间佛道，为众生利益。所以圣者不会追求世间的名闻利养、财色名食睡，不会为广大名声而造势，不会追求权势和地位，不会与众生争利益，不会希冀被人尊崇。而是看空五蕴世间，内心荡然无所求无所得。如果与此相反，则说明心地不空，没有了达胜义空理，则非圣贤。</p><p>原文：<strong>问。如经中说。诸业以贪嗔痴为缘。何故此中。唯说痴为缘耶。答。此中通说。福非福不动业缘。贪嗔痴缘。唯生非福业故。</strong></p><p>释：问：如经中所说的，众生所有的业行都是以贪嗔痴为缘造作出来的，为什么在这里只说以愚痴为缘呢？答：这里把福行、非福行和不动行的三种业缘全部都概括说为以无明愚痴为缘，而以贪嗔痴为缘只能生起非福业行。</p><p>以贪嗔痴烦恼为缘，必定会造作非福的恶业，不会造作有福业和清净的不动业，而以无明为缘，三种业行都会造作，不止限定于非福的恶业，因为无明而行善的人很多，因为他们不了达世间苦和空，心执于有而行善，虽善也是无明。</p><p>原文：<strong>问。身业语业。思所发起。是则行亦缘行。何故但说。无明缘行。答。依发起一切行缘而说故。及依生善染污思缘而说故。</strong></p><p>释：问：身业和语业，是意根的思心所引发出来的，因此说行也是产生身行语行的缘，身行语行也缘于行而生，为什么只说无明缘行呢？答：这是根据发起一切行包括意根的行（思心所）的缘而说的缘故，一切行都是由无明而起，意根的思因为有无明才运作，才导致了身行和语行的产生；以及根据生起善的和染污的思心所的缘而说的缘故，生起善的缘和生起染污的缘都是无明，所以就说无明缘行，而不说思心所的行缘身行和语行。</p><p>原文：<strong>问。识亦以名色为缘。何故此中。但说行为缘耶。答。行为识杂染缘。能引能生后有果故。非如名色。但为所依所缘。生起缘故。</strong></p><p>释：问：六识也是以名色为缘而生，为什么在这里只说六识是以身口意行为缘而生呢？答：身口意行是六识善恶无记种子的杂染缘，杂染的种子或者说杂染的六识能引发和生起后世名色业果的缘故，所以说身口意行是六识的缘，能引生业种的出现。不像名色只是六识出生所依赖的增上缘，行却是六识的所缘缘，能直接引起六识业种的出生。</p><p>行缘识，身口意行杂染，六识就杂染，就有杂染种子，以及后世的杂染果报。但身口意行是六识的身口意行，没有六识就没有身口意行，所以身口意行不是引生了六识，而是引生了六识造作的业种，也就是引生了六识的杂染缘。为什么身口意行是杂染的呢？因为意根的心行是杂染的，所以意根引生的身口意行就是杂染的，六识就是杂染的，种子以及果即是杂染的。名色的杂染果出生以后，六识就会依止于杂染的名色出生，名色是出生六识的增上缘，不是引生缘。</p><p>原文：<strong>问。名色亦由。大种所造。及由触生。何故但说。识为缘耶。答。识能为彼。新生因故。彼既生已。或正生时。大种及触。唯能与彼。为建立因。</strong></p><p>释：问：名色也是由七大种子创造出来的，也是由于触的因缘而出生的，在入胎时有意触，在出胎时有六入处触，为什么这里只说名色以六识为缘而生呢？答：六识能作为名色新出生的因缘，名色出生以后，或者正在出生时，地水火风空识六大种子以及触，只能作为名色成为五蕴的建立因缘、延续因缘、变异因缘。两种因缘分别在名色出生的前后起用，其作用有差别，从引生因缘的重要角度而说识缘名色，所以不说大种和触是名色出生的缘。</p><p>原文：<strong>问。如经中说。六界为缘。得入母胎。何故此中。唯说识界。答。若有识界。决定于母胎中。精血大种。腹穴无阙故。又识界胜故。又依一切生。一切有生时而说故。</strong></p><p>释：问：如经中所说，以地水火风空识六界为缘，才能入到母胎当中，为什么这里只说以识界为缘入胎呢？答：如果在母胎里有阿赖耶识界，就一定会有母胎中胎儿所需要的五大种子构成的精血，遍布于身根五脏六腑和七窍，没有空缺，所以就说名色是以阿赖耶识界为缘。又因为阿赖耶识界是心法，是一切法中最殊胜的缘故，所以说以阿赖耶识为缘得入母胎。又因为依据一切法的出生，以及一切有的出生而说阿赖耶识是最胜的，是入胎和名色出生的直接因缘。</p><p>能入胎的识界一定是阿赖耶识，不是六识，因为一入胎六识就要灭去，胎里刚开始没有六识，而有阿赖耶识，而且胎中的受精卵的色由阿赖耶识出生地水火风空大种子来出生变化和执持，胎里的第七识需要阿赖耶识提供识种子来维持，所以能入胎的是识界阿赖耶识，不说地水火风空界，有阿赖耶识就会有地水火风空大种子。</p><p>原文：<strong>问。六处亦以饮食为缘。何故此中。但说名色为缘耶。答。此中说名色。是彼生因故。彼既生已。亦以饮食。为任持因。</strong></p><p>释：问：眼入处、耳入处、鼻入处、舌入处、身入处、意入处，也以饮食为缘而生，有了饮食，名色增长，六入中的五入也随之增长，为什么这里只说六入是以名色为缘出生的呢？答：这里说名色是六入出生的因缘，六入是直接在名色上出生的，没有名色就不可能有六入，在胎中最初的名就是意入处，在受精卵的色上渐次出生五入，所以名色是六入出生的因缘。六入出生以后，也要以饮食作为六入任运维持的因缘，所以不说饮食是六入出生的因缘。</p><p>原文：<strong>问。触以三和为缘。何故此中。但说六处为缘。答。若有六处。定有余二无阙故。又六处胜故。由六处摄二种故。</strong></p><p>释：问：触是以根尘识三者和合为缘出现的，为什么这里只说触是以六处为缘出生的？答：如果有六处，一定会有其余的六尘和六识出现，不会缺少六尘和六识的，所以就以六处为代表。又因为在三者中，六处胜于六尘和六识的缘故，在三者和合中起决定作用，就由六处摄受六尘和六识，所以就说触是以六处为缘出现的。</p><p>原文：<strong>问。若自所逼迫。若他所逼迫。若时候变异。若先业所引。皆得生受。何故此中。但显触为彼缘。答。触是彼近因故。由触所引故。余缘所生受。亦从触生故。必不离触。是故偏说。</strong></p><p>释：问：如果是由自身因缘所逼迫，或者是由其他外力因缘所逼迫，或者是因为时间因缘变异，或者是由于前世造的业行所牵引，这些因缘都会出生受觉，为什么这里只显示以触为缘才能出生觉受？答：因为触是出生觉受最近的因缘（其他都是远因），受是由于触所引发出来的缘故。而由于其他的缘所生出的受觉，也是从触的因缘而生的，如果没有触，即使有其他因缘也不会出生受，受觉的出生一定不能离开触，因此就偏说触是受的因缘。</p><p>原文：<strong>问。经中亦说。无明为缘生爱。顺爱境界。亦得为缘。何故此中。但说受为缘耶。答。以受力故。于相似境。或求和合。或求乖离。由愚痴力。但于诸受。起尽等相。不如实知。由此不能。制御其心。</strong></p><p>释：问：经中也说，以无明为缘才能生出爱，无明是爱的因缘，随顺于令人贪爱的六尘境界也是爱的因缘，也能生出爱，为什么这里只说受是产生爱的因缘？答：因为受的因缘力的缘故，在面对相似真实的境界时，或者希求合于境界（因为有乐受），或者是希求乖离逃避境界（因为有苦受），由于愚痴因缘力的缘故，对于受的生起和灭去等等相不如实了知，因此就不能调伏其心，于是产生了爱，所以才说受是爱的因缘。</p><p>原文：<strong>问。由随眠未断。顺彼诸法。取皆得生。何故此中。但说爱为取缘。答。由希望生故。于追求时。能发随眠。及能引彼。随顺法故。</strong></p><p>释：问：由于随眠烦恼没有断除，就会随顺于随眠烦恼，这样对于诸法的取就都出生了，但是为什么这里只说爱是生起取的因缘呢？答：由于内心对所贪爱的尘境有所希望的缘故，在追求贪爱的境界时，就能引发出内心的随眠烦恼，也能牵引着自心去随顺于随眠烦恼，所以取出生的因缘是贪爱，不是随眠烦恼。</p><p>随眠的意思是烦恼没有断除的时候，一直作为种子隐藏在阿赖耶识中，或者是眠藏在阿赖耶识中，等到因缘成熟的时候烦恼就会现行出来。但是烦恼也跟随着意根，伴随着意根，因缘成熟时，意根就会随顺于烦恼，表现出烦恼，业行就会随之出现。贪爱也是烦恼的一种，由于贪爱才会产生取着的心行，而嗔恚这种烦恼是背离，不是随顺不是取着，所以才说爱缘取，不是烦恼缘取。</p><p>原文：<strong>问。前已说无明为缘。发起业有。何故今者。说取缘有。答。由取力故。即令彼业。于彼彼生处。能引识名色等果。问。生亦以精血等为缘。何故此中。唯说有缘生耶。答。由有有故。定有余缘无阙。又有胜故。唯说彼为缘。</strong></p><p>释：问：前边已经说过以无明为因缘，能发起业果的三有，为什么现在却说是由取的因缘出生了三有？答：因为由于取的因缘力的缘故，就会使得造作的业果在各个界地出生，之后能引发出六识和名色等等业果，所以说取缘有。</p><p>问：生命体也是以父精母血等为缘才能出生，为什么这里却只说是由三有的缘产生了生命体？答：由于有三有的缘故，一定会有其他的缘满足生命体出生的因缘条件，所以说有缘生。又因为三有在所有缘中是最殊胜的缘故，所以只说三有是生的缘。</p><p>原文：<strong>问。亦由远行。不避不平等。他所逼迫为缘。老死可得。何故此中。但说生缘老死耶。答。虽由彼诸缘。必以生为根本故。纵阙彼缘。但生为缘。定有老死故。</strong></p><p>释：问：老死的现象也是由于生命体在久远时间的运行当中，寿命并没有到结束时，因为不能避开外力突发因缘，受外力因缘逼迫而导致寿命不得不终止，为什么在这里只说是由于生的缘故导致老死现象的发生呢？答：虽然有很多因缘导致了老死的出现，但是老死一定是以生为根本因缘，即使没有其他的因缘，但只要出生了，就一定会有老死，没有生的时候，不管有多少因缘，也不会有老死的现象发生，所以才说生是老死的缘。</p></div>"
},{
    "title": "第三节 十二支细分",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第三节  十二支细分</strong></p><p>原文：<strong>问。此十二支。几是烦恼道。几是业道。几是苦道。答。三是烦恼道。二是业道。余是苦道。</strong></p><p>释：问：这十二支因缘法中有几支属于烦恼道？几支属于业道？几支属于苦道？答：有三支是烦恼道，有二支是业道，其余支分都是苦道。</p><p>烦恼道支分中含有无明烦恼，能引生烦恼业，无明、爱和取三个支分属于烦恼道，无明支是烦恼，能产生杂染的身口意行和业种；爱支是烦恼，能产生执取，致使后世业果不断；取支是烦恼，能导致后世杂染业果出生，使得生死相续。业道是指能造作业行的支分，行和识二支分就是业道，行支造作身口意业，识支留下生死业苦种。苦道是指有苦受的支分，名色、六入、触、受、有、生、老死七个支分都是苦道，都有苦果和苦受。</p><p>原文：<strong>问。几唯是因。几唯是果。几通因果。答。初一唯因。后一唯果。余通因果。又即于此问。更作余答。三唯是因。二唯是果。当知所余。亦因亦果。</strong></p><p>释：问：十二支中有几支只是因？几支只是果？几支既通因又通果？答：最初无明一支只通因，最后一支老死只通果，其余中间的支分既通因又通果。这个问题还有另外的答案，有三支只是因，是无明、行和识三支，有二支只是果，是生和老死二支，其余的支分既通因又通果，是名色、六入、触、受、爱、取、有七个支分。</p><p>对于第一种答案，只有无明是生死轮回生起之因，是后十一支生起之因，没有出生无明之因，所以无明不是果。最后的老死支只能是果，前十一支都是生起老死支的因，老死之后就没有后支了，也就不会再有什么果了。对于第二种答案，有三支只是因，不是果，这三支是无明、行和识支，这三支的运作直接导致后世的名色果报的出生，所以这三支是前世的因，名色至取支是今世的果，前生今世因果相连。而名色至取支的运作以及后世的有是因，后世的生和老死支是果，这样今世后世的因果就连接起来了，因果通三世，今世是前世的果，是后世的因，既通因又通果，后世只是果，不是因。</p><p>原文：<strong>问。几是独相。几是杂相。答。三是独相。行等是杂相。问。何故行有是杂相。答。由一种说故。谓能引爱非爱果故。及能生趣差别故。</strong></p><p>释：问：十二支中有几支是单独的相，有几支是善恶杂染的相？答：有三支是单独的相，无明、爱、取三支只有烦恼染污相，没有清净相和杂染相，行、识、名色、六入、触、受、取、有、生、老死等等支分是杂染的相。所谓的杂染是说此支分含有善恶无记性，能引发善恶无记报。问：是什么原因行等等支分有这样的杂染相？答：有一种说法就是说，行等支分有引生可爱和不可爱的果报的缘故，以及行等支分能引生六道差别的缘故，所以说行等支分是杂染相。</p><p>独相是指只有染污相，不与清净相相混杂，杂相就是染污与清净相混杂。十二支分中只有染污相的是无明烦恼支，不清净，就是独相。烦恼支分有无明、爱和取支。其余的都是染污与清净相杂的杂相支分，这些支分能引生可爱的清净异熟果和不可爱的染污异熟果，能引生出不同的六道差别果报。</p><p>比如说行支、识支和名色支，有清净的善的身口意行和染污的恶的身口意行，以及不善不恶的身口意行，能把六识分别熏染成善恶和不善不恶三种，生成三种种子，后世就会有三种异熟果三种名色果报体。既然名色是杂染相，在名色上出生的六入就是杂染的，触和受就是杂染的。在爱和取烦恼支之后的后世的有、生和老死就是杂染的，都会分为善恶和不善不恶三种相。</p><p>原文：<strong>问。何故识与名色六处。一分有杂相。答。由三种说故。谓依杂染时故。依润时故。依转时故。</strong></p><p>释：问：为什么说六识与名色、六入处有一部分杂相？答：这有三种说法：一种说法是依据名色和六入处有杂染的身口意行时，六识就是杂染的，所以说名色和六入处与识有一分杂相；一种说法是依据六识种子被贪爱执取所滋润的时候，就出生了后世的名色和六入处，并且在名色和六入处相上包含了识相，所以说名色和六处与识有一分杂相；一种说法是依据名色在被出生的时候，名色和六入处中就有识相，所以说名色和六处与识有一分杂相。</p><p>原文：<strong>问。何故识乃至受与老死有杂相。答。由二种说故。谓别显苦相故。及显引生差别故。</strong></p><p>释：问：为什么说六识、名色、六入、触、受支分与老死支分有杂染相？答：这有两种说法，一种说法是识、名色、、六入、触、受等支分能分别显示出老死的苦相的缘故，一种说法是识乃至受与老死支分能显示出所引生老死支分有差别的缘故，所以说识等支分有杂染相。</p><p>识乃至受等支分中都有苦相，因为是受报体，而且杂染业多，这些支分中难免都有苦相，而老死支分更是苦相，所以识等支分与老死支分有杂相。另外，前世的识杂染不同，引生的现世的名色至受支分就不同，现世的名色至受等支分不同，所引生的后世的老死支分就不同，所以识乃至受支分与老死支分有杂相。</p><p>原文：<strong>复次于缘起中。云何数往义。谓生已不住义。云何和合义。谓诸缘聚集义。</strong></p><p>释：在十二缘起法中，什么叫作数数不断地往复义？这意思是说名色在六道轮回里出生以后，不会永远停留在一种色身中不变，而是生了灭灭了生，不断地轮回。什么是和合义？和合就是法生起所依靠的缘都聚集在一起了，因缘具足时法就出生。</p><p>数是多次不断的意思，众生在六道中的某一道出生以后，并不会永远在这道里，因为前世所造的业，以及今世所造的业，业改变了，死后就会脱离此道，趣向其它道里投生。无量劫都是这样在六道里轮转，由于恶业远远大于善业的缘故，众生极大多数时间都是投生在三恶道里的时候多。众生在每次投胎出生以后，因为无明不断的缘故，都是随顺着十二因缘法，不断地造作杂染业，导致后世不断，不出六道轮回。众生的名色在每次出生的时候，都是要所有因缘都具足聚集在一起，才能投生和出生，缺少一缘，名色不生。名色出生所需要具足的缘总体上有四种，就是因缘、等无间缘、所缘缘和增上缘。</p><p>原文：<strong>云何起义。谓诸缘和合。之所引摄。新新生义。云何缘起。云何缘生。谓诸行生起法性。是名缘起。即彼生已。说名缘生。</strong></p><p>释：什么是起义？起就是所有的缘和合在一起之后，所引发和摄受的新出生的法，新生起的法，从无到有就是起。什么是缘起？什么是缘生？缘起就是一切法运行之后能生起法性，能够显示出法的特征和性质。等到法生起来以后，就叫作缘生。</p><p>法生起的缘有四种：因缘、等无间缘、增上缘和所缘缘，比如四缘具足时，受精卵这种名色在母胎中出现叫作缘起，受精卵圆满，胎儿出生，叫作缘生，诸法还不具足的时候叫作起，具足以后叫作生，先起后生，前后次第联系为因果。诸法不断地相续次第地现前，名为起，前后相续不断形成的法名为缘生法。</p><p>原文：<strong>问。几支苦谛摄。及现法为苦。答。二。谓生及老死。问。几支苦谛摄。当来为苦。答。识乃至受种子性。问。几支集谛摄。答。所余支。</strong></p><p>释：问：十二支分中有几支是属于苦谛所摄受，在当前状态是苦的？答：有二支，生支和老死支。问：有几支是苦谛所摄受，能感生未来的苦？答：有识、名色、六入、触和受五支的种子性，后世种子成熟以后现行出法就有苦了。问：有几支属于集谛所摄受？答：剩下的都是集谛所摄受的，有无明、行、爱、取、有五支。</p><p>在现世当中的苦法是生和老死二支，众生生时都是苦，老时苦，死时更是苦。而能感后世苦的支分，是识支，在识支中留存了身口意行的业种，会出生后世苦的名色。名色的种子、六入的种子、触的种子和受的种子，能出生后世的名色以及受的苦。无明、行、爱、取、有这五支属于集谛，因为无明的集起，能感生苦，身口意行的集能感生苦，爱的集起能感生苦，取的集起更能感生苦，有的集为苦生创造了必要条件。若无无明，就不会有后续一切法的种子，没有种子就不会有后续的苦；若没有身口意行就没有业种，没有业种就没有后世的苦；若没有爱，就不会取，若不取就没有后世的三有，若没有三有，就没有生老病死之苦。</p><p>原文：<strong>问。无明与行。为作俱有缘。为作无间灭缘。为作久远灭缘。答。当知具作三缘。谓由无知。于随顺诸行法中。为俱有覆障缘。为彼彼事。发起诸行。又由恶见放逸。俱行无知。为无间灭生起缘。发起诸行。又由无知。为久远灭引发缘故。建立顺彼。当生相续。</strong></p><p>释：问：无明对于行支来说，是作为行支的俱有缘，还是作为行支的无间灭缘，还是作为行支未来久远灭的缘？答：无明都作行支的这三种缘，第一，由于心中无知的缘故，在随顺一切法运行的过程中，作为一切法的俱有缘，起着覆障的作用，为了种种事业，发起种种法的运行，所以无明是行支的俱有缘。第二，又由于心中有无明恶见，其行却又放逸，不积极灭除恶见，无知一直伴随着诸行，就作为一切法无间断的灭去又生起的缘，引发出一切法不断地运行，所以无明是行支的无间灭缘。第三，又由于心中无知，作为一切法久远以后灭去引发的缘故，顺着无知，就导致一切法在现世相续不断，所以无明是行支的久远灭缘。</p><p>原文：<strong>问。云何应知诸行望识。为三种缘。答。由能熏发。彼种子故。为俱有缘。次后由彼势力转故。为无间灭生起缘。由彼当来果得生故。为久远灭引发缘。如行望识。如是识望名色。名色望六处。六处望触。触望受亦尔。</strong></p><p>释：问：如何才能知道意根的一切行是出生六识的三种缘？答：第一，由于意根的行能熏发六识种子的缘故，就说行是识的俱有缘，六识的出生不能离开意根的行；第二，由于意根行的势力运转的缘故，就成为了六识不间断灭又生起的缘；第三，由于六识未来世的果报得以出生的缘故，意根的行就成为了六识久远以后灭去的引发缘。行缘识是如此，识缘名色、名色缘六入、六入缘触、触缘受也是这样。</p><p>原文：<strong>问。云何应知。受望爱为三种缘。答。当知由彼。起乐着故。为俱有缘。从此无间。由彼势力。起追求等。作用转故。为无间灭生起缘。建立当来。难可解脱。彼相续故。为久远灭引发缘。</strong></p><p>释：问：如何才能知道受缘爱有三种缘？答：应当知道由于受的时候心起了乐着的缘故，受就成为爱生起的俱有缘，从此就不间断的贪爱下去。由于贪爱的势力生起追求等等心行，受的作用运作的缘故，就成为了爱的无间灭的生起缘。后世的受不断生起，难以解脱，因为受相续不断的缘故，就成为了爱在未来久远灭的引发缘。</p><p>原文：<strong>问。云何爱望取。为三种缘。答。由欲贪俱行。于随顺取法中。欲乐安立故。为俱有缘。由无间灭势力转故。为生起缘。建立当来。难可解脱。彼相续故。为久远灭引发缘。</strong></p><p>释：问：为什么说爱缘取有三种缘？答：由于欲贪与取一直相伴共同运行，在随顺取诸法的过程中，有贪欲乐着的心行，所以说爱是取的俱有缘。由于爱的无间断灭的势力运转的缘故，就成为了取的生起缘。在未来世爱仍然会不断的出生和运行，难以得到解脱，因为爱相续不断的缘故，就成为了取在未来久远劫的引发缘。</p><p>原文：<strong>问。云何取望有。为三种缘。答。由与彼俱。令业能招诸趣果故。为俱有缘。又由彼力。于此生处。能引识等故。为无间灭生起缘。又能引发。彼界功能故。为久远灭引发缘。</strong></p><p>释：问：为什么说取缘有有三种缘？答：由于心行一直与取相伴随，使得所作业行能感召到六道轮回果报，所以取是有的俱有缘。又由于取的势力的缘故，在出生之地能引发六识等支分的缘故，取就成为了六识等支分无间断灭的生起缘。又由于取能引发三界有各支分的功能的缘故，取是识等支分未来久远劫灭去的引发缘。</p><p>原文：<strong>问。云何有望生。为三种缘。答。熏发彼种子故。为俱有缘。由彼势力。无间随转故。为生起缘。虽久远灭。而果转故。为引发缘。如有望生。当知生望老死。为缘亦尔。</strong></p><p>释：问：为什么说有缘生有三种缘？答：因为有能熏发生的业种的缘故，就说有是生的俱有缘，在三界有中所有业行都是后世生的缘。由于三界有的势力无间断运转的缘故，有就成为了后世生的生起缘。虽然三界有在未来久远劫以后会灭去，但是在三界有中的果报会不断的运转下去，所以三界有是生的引发缘。有缘生是这样的道理，生缘老死也是这样，其缘也有这三种。</p><p>原文：<strong>复次建立有支有二种。一就胜分建立。谓取所摄受业。如前已说。二全分建立。谓业及识。乃至受所有种子。取所摄受。建立为有应知。</strong></p><p>释：建立有这个支分有两种，一种是从胜出支分这个角度建立三界有，属于取所摄受的业用，如前面已说过的取是有的三种缘；二种是全方位的来建立三界有，包括业行、六识、名色、六入、触以及受的所有种子，这些有都是取所摄受的，然后就有了后世的这些有。</p><p>六道轮回就是取的果，就是三界有的最胜支分体现，这就是从胜分建立有的意思。一切的业行业用都会留下种子，六识的造作有种子，名色的生住异灭有种子，六入处的运行有种子，触有种子，受也有种子，这些种子就导致了后世有的出现，这些种子也属于有的范畴之内，由于有，就有了这些支分，这些支分也属于有的范畴，这就是全方位建立有的意思。</p><p>原文：<strong>问。是诸有支。唯有次第。与行为缘。乃至老死。更有余业用耶。答。即此业用。及于各别所行境中。如其所应。所有业用当知。是名第二业用。</strong></p><p>释：问：这些有的支分，只有次第的作为行支的缘，乃至于作为老死支的缘，还有没有其他的业用呢？答：这个与行乃至于老死为缘的业用，以及在各个别的所运行的环境中，都会有其相应的业用。所有业用都叫作第二业用，第一业用是生，生之后在三界有中才能有行、识、名色直至老死等等业用。</p><p>原文：<strong>问。无明唯与行为缘。亦与余支为缘耶。答。无明乃至亦与老死为缘。前言唯与行为缘者。但说近缘义。如是所余。尽应当知。</strong></p><p>释：问：无明是仅仅作为行支的缘，还是也与其它支分为缘？答：无明不仅与行支为缘，也与识、名色、六入、触、受、爱、取、有、生，乃至于老死为缘，十一支都因为无明而运转。前面说无明与行为缘，只是说的是与无明比较相近的缘，后边所说的这些缘也应当知道。</p><p>比如六识的运行以无明为缘，造作杂染业行，名色以无明为缘有杂染果，六入以无明为缘会生出杂染的触，触以无明为缘会生出杂染的受，受以无明为缘会生出杂染的爱，爱以无明为缘会生出杂染的执取，执取以无明为缘会生出不可爱的有，有以无明为缘会生出杂染的生，生以无明为缘会生出不可爱的老死。</p><p>原文：<strong>复次后支非前支缘。何以故。如为断后支故。勤作功用。断于前支。由前断故。后亦随断。非为断前故。勤作功用。断于后支。是故当知。唯此为彼缘。</strong></p><p>释：十二支中后一支不是前一支的缘，为什么这样说呢？因为如果为了要断除后一支，就要断除前一支，就要精勤的加以功用，这样就断除了前一支，由于前支断除的缘故，后支也就随之断除了。而不是说为了断除前支，才精勤的加以功用去断除后支。所以你应当知道，只有前支是后支的缘，而不是后支是前支的缘。</p><p>原文：<strong>问。云何说言。此有故彼有。答。由未断缘。余得生义故。问。云何此生故彼生。答。由无常缘。余得生义故。</strong></p><p>释：问：为什么说此有故彼有？答：由于还没有了断三有的缘，导致其他的法得以出生的缘故，就说此有故彼有。问：为什么说此生故彼生？答：由于无常生的缘，导致其他法得以出生的缘故，所以说此生故彼生。</p><p>原文：<strong>问。何故说言。有生故有老死。要由生缘。而有老死。如是乃至。无明望行。答。由此言教道理。显从无实作用缘。余得生义故。</strong></p><p>释：问：为什么说由于有生的缘故就会有老死，必须要有生的缘，然后才能有老死？其它十一支分为什么也是这样，必须有无明的缘故，才能有行？有行的缘故才能有识，有识的缘故才能有名色，有名色的缘故才能有六入，有六入的缘故才能有触，有触的缘故才能有受，有受的缘故才能有爱，有爱的缘故才能有取，有取的缘故才能有有，有有的缘故才能有生？</p><p>答：由生缘老死这个道理能显示出，从没有真实作用的缘，其他的法就能得以出生。生支不是真实的法，没有真实的作用，但却能成为老死现象出生的缘，其它十一支分也是这样，无明虽然不是实法，没有实际作用，但却是行支出生的缘，同理，行支也是识支出生的缘。</p><p>原文：<strong>问。何故说言。有生故有老死。非离生缘。而有老死。如是乃至。无明望行。答。由此言教道理。显从自相续缘。即自相续。余得生义故。</strong></p><p>释：问：为什么说有生的缘故就会有老死，不离生的缘而有老死？为什么说有无明的缘就会有行，不离无明而有行？为什么说有行的缘就会有识，不离行而有识？如是乃至，有缘生，不离有而有生？答：因为生缘老死这个言教道理能显示出，由于生自身相续的缘，也就是生自身的相续，其他的支分就能得以出生，所以说生缘老死。无明缘行、行缘识等等也是如此。</p><p>原文：<strong>问。若法无明为缘。彼法是行耶。设是行者。彼无明为缘耶。答。应作四句。或有行非无明为缘。谓无漏及无覆无记。身语意行。或无明为缘。而非是行。谓除行所摄有支。所余有支。或有亦无明为缘亦是行。谓福非福。不动身语意行。除如是相。是第四句。</strong></p><p>释：问：如果法是以无明为缘出生的，这个法就是行吗？如果是行的话，行的产生就是以无明为缘吗？答：这个问题应该分作四句来说，一、有的行不是以无明为缘出生的，比如无漏行和没有覆障没有记别的身口意行；二、有的法是以无明为缘出生的，但这个法却不是行，比如除了行支所摄的有支之外，其它的有支，比如识、名色、六入、触、受、爱、取、有、生和老死支；三、有的法也是以无明为缘出生的，这个法也属于行支所摄，如有福的身口意行、无福的身口意行和不动身口意行（无福非无福的清净行）；四、除了这些法相，其余都是第四句所摄。</p><p>无漏业行已经不属于十二因缘所摄了，超出了十二因缘范围，不是由无明所引生出的行，无覆无记的身口意行也不是由无明所摄，超出了十二因缘范围，因此没有生死业和果。十二因缘中十一支分都属于无明所摄，都含有无明，但无明引生行支是最直接的，对于其它支分就显得比较间接，所以说无明缘行。由无明所摄的行支里，造作福业的行也是无明所摄，由于不明四圣谛理和实相之理，为求有漏福业的行，就是无明的行；造作恶业的非福行更是无明所摄的行，外道所修的四禅不动心的行，也是因为不明解脱之理而修，所以也是由无明所摄的行。</p><p>原文：<strong>问。若行为缘。彼亦识耶。设是识者。行为缘耶。答。应作四句。或行为缘非识。谓除识所余有支。或识非行为缘。谓无漏识。及无覆无记识。除异熟生。或亦识亦行为缘。谓后有种子识及果识。除如是相。是第四句。</strong></p><p>释：问：如果法是以行为缘而出生的，这样的法也是识吗？如果这个法是识的话，识就是以行为缘的吗？答：这个问题应该分为四句来说：一、有的法是以行为缘的，可是这个法却不是识，是除了识之外的其它支分，比如名色、六入、触、受、爱、取、有、生和老死等支也是以行为缘的；二、有的识不是以行为缘的，比如已经没有烦恼漏的识，以及没有覆障没有记别的识，除掉异熟生性的识；三、也有识也是以行为缘的，如能导致未来世有的种子识和果报识；四、除了这些法相，其余的都是第四句所摄。</p><p>原文：<strong>由此道理。乃至触缘受。随其所应。四句应知。</strong></p><p>释：由此同样的道理可知，以识为缘的名色、以名色为缘的六入、以六入为缘的触、以触为缘的受等等，都与这四句相对应。</p><p>名色、六入、触、受、爱、取、有、生和老死，这几支分也都是以行为缘的，是意根的行运行以后所出生的法，任何法的运行都是意根行的结果，行不运行，后边一切法都不会出现。但是行的直接有支是六识，六识出生的直接缘是行，而名色至老死的直接缘是前一支，行是间接缘。还有问题就是一旦六识没有烦恼染污漏了，六识出生的直接缘就不是意根的无明行了，而是意根的明行，这些都不属于十二因缘中的法，其果报已经跳出了十二因缘的生死轮回了。众生也除掉了种子的异生性，不再有六道轮回，异时异地异界异身而生的现象就没有了，这是八地菩萨以上的境界。</p><p>种子识和果报识都是指六识，种子识是今世以行为缘造作业行，留下业种，滋润未来世的名色，后世名色出生以后，在名色上生出果报六识受报，这两种识都是以行为缘出生的。以无明的行为缘只能出生无明的六识，以明行无漏行才能出生无漏的六识，包括无漏的种子识和无漏的果报识。这也说明了意根是六识的染净依，意识无法单方面的清净，无法单方面的断我见和断烦恼，必依意根才能断我见断烦恼，从而达到无漏。</p><p>原文：<strong>问。若受为缘。皆是爱耶。设是爱者。皆受为缘耶。答。应作四句。或有是爱。非受为缘。谓希求胜解脱。及依善爱而舍余爱。或受为缘。而非是爱。谓除无明触。所生受为缘。所余有支法生。或有受为缘亦是爱。谓无明触所生受为缘。染污爱生。除如是相是第四句。</strong></p><p>释：如果法是以受为缘而出生的，这些法都是爱吗？如果都是爱的话，都是以受为缘才能出生吗？答：这个问题应该分成四句来说：一、有的爱出生并不是以受为缘，比如希求殊胜的解脱，以及依靠着对善法的爱而舍掉了其它的爱；</p><p>二、有的法是以受为缘出生的，但这个法却不属于爱所摄受的，比如除了以无明的触所生的受为缘的法之外，剩下的其它的有支法的出生，比如以无明的触为缘所生的受，以无漏的触为缘所生的受，以这样的受为缘出生的法，就不是爱所摄受的法；三、有的法是以受为缘出生的，是属于爱的支分，比如以无明触所生的受为缘，出生的染污的爱；除了以上所说的法相之外，都属于第四句所摄。</p><p>原文：<strong>问。若爱为缘。皆是取耶。设是取者。皆爱为缘耶。答。当知此中。是顺后句。谓所有取。皆爱为缘。或爱为缘。而非是取。谓除取所余有支。及缘善爱勤精进等。诸善法生。</strong></p><p>释：问：如果法是以爱为缘而出生的，这些法都属于取支吗？这些法如果都是取的话，是不是都是以爱为缘出生的？答：这个问题是顺后句，依顺后边的句子（设是取者。皆爱为缘耶。）来回答。就是说所有的取都是以爱为缘才出现的，或者是以爱为缘出现的法，并不都是取，还有除了取之外的剩下的那些有支，以及缘于善的爱而出现的勤苦精进等等诸善法。</p><p>所有的取，都是以爱为缘出现的，但是以爱为缘出生的法，并不都是取，还有取之外的法也是以爱为缘出生的，比如有、生、老死等等支分，如果没有爱，把爱断尽了，这些支分就不会再出现了，都灭了。爱是取的直接缘，是其他支分的间接缘，都是因为爱而出现的。</p><p>原文：<strong>问。若取为缘。皆是有耶。设是有者。皆取为缘耶。答。亦应作顺后句。谓所有有。皆取为缘。或取为缘。而非是有。谓除有所余有支。</strong></p><p>释：问：如果法是以取为缘出生的，这些法都是三有吗？如果这些法都是有的话，都是以取为缘出生的吗？答：这里也是顺后句，顺着后边这句来回答。所有的有都是以取为缘出生的，但是以取为缘出生的法，并不都属于有，还有除了有之外的法，比如十二支中除了有之外的支分，生、老死、行、识、名色、六入、触、受、爱等等支分。取是有支的直接缘，是其他支分的间接缘，都是因为取而出现的。</p><p>原文：<strong>问。若有为缘。皆是生耶。设是生者。皆有为缘耶。答。诸所有生。皆有为缘。或有为缘。而非是生。谓除生所余老死。最后有支。</strong></p><p>释：问：如果有些法是以有为缘出现的，这些法都是属于生支吗?如果这些法都属于生支的话，都是以有为缘出现的吗？答：所有的生，都是以有为缘出现的，但是有些以有为缘出现的法，并不都是属于生支，比如除了生支之外的最后的老死支，也是以有为缘才能出现的，没有五阴世间的有，就没有老死的现象。</p><p>原文：<strong>问。若生为缘。皆老死耶。设是老死。皆生为缘耶。答。所有老死。皆生为缘。或生为缘。而非老死。所谓疾病。怨憎合会。亲爱别离。所求不遂。及彼所起愁叹忧苦。种种热恼。</strong></p><p>释：问：如果法是以生为缘出现的，这些法都属于老死支吗？如果这些法都是老死支所摄的话，都是以生为缘出现的吗？答：所有的老死现象都是以生为缘出现的，但是有些法的出现以生为缘，却不属于老死现象，比如疾病、怨憎相会、亲爱别离、所求不得，以及由于这些而引起的烦恼忧愁叹息，种种的热恼等等。</p><p>原文：<strong>问。是诸有支。几与道支所摄正见。为胜障碍。答。无明及彼所起意行。若有一分。能为胜障。如于正见。如是于正思惟。及正精进亦尔。若正语正业正命。以身行语行。及有一分。为胜障碍。若正命正定。以余有支。为胜障碍应知。</strong></p><p>释：问：十二有支当中，几支与八正道支所摄的正见胜法上的障碍？答：无明和无明所引发的心行支，如果有一分都能成为正见胜法上的障碍，何况是多分，更是障碍。无明和行不仅对于正见有障碍，同样对于正思惟和正精进也有障碍。行支的身行和语行只要有一分，就成为正语、正业和正命胜法上的障碍，其余的有支如识、触、受、想、取，如果有一分就会成为正命和正定胜法上的障碍。</p><p>十二有支对八正道的正修行是一种障碍，对于其它道品的修行都是一种障碍，对于苦集灭道四圣谛的修行同样是一种障碍。所以不管修习什么法，无明都是障碍，一切法的修习的共同目标就是破除无明障碍。</p><p>原文：<strong>问。是诸有支。几唯杂染品。几通杂染清净品。答。四唯杂染品。余通杂染清净品。问。云何生支通二品耶。答。若生恶趣及有难处。唯是杂染品。若生人天诸无难处。此通染净品。当知余支。随其所应。皆通二品。</strong></p><p>释：问：这些有支，有几支只通杂染品类？几支既通杂染也通清净的有支？答：有四支只通杂染品类，其余的都是既通杂染也通清净的品类。问：为什么生支通杂染和清净两个品类？答：如果生到三恶道及有灾难之处，生支只通杂染品类，如果生到人天没有灾难之处，生支就通杂染和清净品类。依此可知，其余的支分随着所对应的法，都通杂染和清净两个品类。</p><p>原文：<strong>问。何等无明不有。故行不有。何等无明灭。故行灭耶。答。有三种发起缠随眠无明。由此无明灭故。彼无明灭。由彼灭故。行亦随灭。</strong></p><p>释：问：是什么样的无明不存在了的缘故，行就不存在了？是什么样的无明灭了的缘故，行就灭了？答：有三种能发起烦恼缠缚、烦恼随眠和无明的无明，这三种无明灭了，十二支中的无明就灭了，无明灭了的缘故，行就随之而灭了。十二支外还有微细无明，需要在菩萨道的修行过程中逐渐灭除。</p><p>原文：<strong>问。何等行不有。故识不有。何等行灭。故识灭耶。答。诸行于自相续中。已作已灭。及未起对治。又由意行有故。起身语行。由此有故彼有。彼无故彼缘识亦无。此若全灭。当知识亦随灭。</strong></p><p>释：问：是什么样的行没有了的缘故，识就没有了？是什么样的行灭了的缘故，识就灭了？答：意根的所有行在自体相续不断的运行中，随着运行随着就灭了，以及在还没有什么法能对治意根的行的时候，由于意根的行存在的缘故，就生起了六识的身口意行。由于意根有行的缘故，六识就有了，意根的行没有了的缘故，六识也就没有了，如果意根的行全部都灭了，就应当知道六识也就随之都灭了。</p><p>原文：<strong>问。何等识不有。故名色不有。何等识灭。故名色灭耶。答。种子识不有故。果识不有。此俱灭故。俱名色灭。如识望名色道理。如是余支乃至受。随其所应。当知亦尔。</strong></p><p>释：问：什么样的识没有的缘故，名色就没有？什么样的识灭了的缘故，名色就灭了？答：能造业留下种子的识没有的缘故，果报识就没有，两种识都一起灭了的缘故，名色也就都灭了。就如识缘名色的道理一样，余下的其它支分，一直到受缘爱，随其所对应的法，也是这样。</p><p>名色的出生需要有业种，业种是由意根行的抉择，出生六识造作业种产生的，六识造作业行就会有业种留下，后世业种成熟名色就会出生，也会有新的六识接受果报，如果六识不造作业行了，果报识就不会出生，名色也必然不会再出生了。而根源在于意根不再有行，意根不再有行，前提是要灭了意根的无明，才不会再行了。</p><p>原文：<strong>如无明缘行道理。如是爱缘取。取缘有道理。当知亦尔。如行缘识道理。如是有缘生。当知亦尔。如识缘名色道理。生缘老死。当知亦尔。</strong></p><p>释：与无明缘行的道理一样，爱缘取、取缘有的道理也是如此。与行缘识的道理一样，有缘生也是如此；与识缘名色的道理一样，生缘老死也是如此。</p><p>相同的道理要这样思惟如下的支分：什么样的名色不有，六入就没有了？什么样的名色灭了，六入就灭了？什么样的六入不有，触就没有了？什么样的六入灭了，触就灭了？什么样的触不有，受就没有了？什么样触灭了，受就灭了？什么样的爱不有，取就没有了？什么样的爱灭了，取就灭了？什么样的取不有，有就没有了？什么样的取灭了，有就灭了？什么样的有不有，生就没有了？什么样的有灭了，生就灭了？什么样生不有，老死就没有了？什么样的生灭了，老死就灭了？这些问题都要在定中一一细心思惟观行。</p><p>原文：<strong>问。何等受不有。故爱不有。何等受灭。故爱灭耶。答。如行缘识道理。当知亦尔。</strong></p><p>释：问：什么样的受不有的缘故，爱就没有了？什么样的受灭了的缘故，爱就灭了？答：就像行缘识的道理一样。由于三种受在运行中，运行完了就灭了，如果对于受没有任何对治方法，受就会不断运行下去。由于受的存在的缘故，爱就随之出现了。如果受灭了，不再感受什么法，对于法的爱也就不会再出生了，如果全部的受都灭了，爱就全部都灭了。</p><p>原文：<strong>如前所说。八缘起门。几门是十二支缘起所显。几门非耶。答。三门是彼所显。谓二一分所显。一全分所显。余门非。何等为二一分所显。谓内识生门。自业所作门。何等为一全分所显。谓有情世间转门。</strong></p><p>释：就像前边所说的那样，八种缘起门中有几门是十二支缘起所显发出来的，有几门不是十二缘起支所显发的？答：有三门是十二支缘起所显发的，其余都不是十二支缘起所显发的。其中有二门是十二支缘起一分所显发，有一门是十二支缘起全分所显发的。有哪二门是十二支缘起所显发的？内识生门和自业所作门是十二支缘起一分所显发的。哪一门是十二支缘起全分所显发的？有情世间流转门是十二支缘起所显发的。</p><p>原文：<strong>问。不如实知缘起道理者。有几种过患耶。答。有五。谓起我见。及能发起前际俱行见。如前际俱行见。如是后际俱行见。前后际俱行见亦尔。又于彼见猛利坚执。有取有怖。于现法中。不般涅槃。是名第五过患。问。如实知者。有几种胜利耶。答。翻前五过应知。胜利亦有五种。</strong></p><p>释：问：不能够如实了知缘起之理的人，有几种过患？答：有五种过患：一、能生起我见；二、能发起前际所有行的知见；三、如前际所有行知见一样，后际所有行的知见，和前后际所有行的知见也能发起；四、又会对这些知见生起猛力的坚执而不舍；五、在现前法中，不能取般涅槃。问：能如实了知缘起之理的人有几种殊胜的利益？答：根据前面五种过患，应该知道殊胜利益也有相对应的五种。 </p><p>原文：<strong>复次。是十二支缘起。几支是实有。谓九。几支非实有。谓余。几一事为自性。谓五。几非一事为自性。谓余。</strong></p><p>释：复次，十二缘起支中有几支是实有的？有九支是实有的，分别是：行支、识支、名色支、六入支、触支、受支、爱支、取支和有支。几支不是实有的？其余三支不是实有的，分别是：无明支、生支和老死支。实有的意思是指有实际的功能作用，非实有的意思是没有实际的功能作用，仅仅是个名字。</p><p>原文：<strong>几是所知障因。谓一。几能生苦。谓五。几苦胎藏。谓五。几唯是苦。谓二。</strong></p><p>释：几支是所知障因？一支，是无明支。几支能出生苦？五支能生出苦，分别是行、识、名色、受、生和老死支。几支是苦的胎藏？有五支是苦的胎藏，分别是识、名色、受、爱和取支，胎藏的意思是含藏、覆护、培育、执持和出生。几支只有苦？有二支只有苦，生和老死二支。</p><p>原文：<strong>几说为因分。谓前六。无明乃至触。及爱取有三说为因分。几说为果分。谓后二说为果分。</strong></p><p>释：几支说为是其它支的因分？前六支是引生其它支的因分，无明、行、识、名色、六入和触。爱、取和有三支也说为是因分，是生和老死的因。几支说为是果分？后二支说为是果分，生和老死。</p><p>因分是指能引生后续其它法出生的支分，有引生义，也能存种子，若无此因后续其它法就不能出生。其中最大因和根本因就是无明支，其次是行支，再其次是识支，然后果报体出现，之后在果报体上还要不断的造作，也再作为出生后世果的因。果分是指由前支作为引生的因和缘，结成最后果实的支分。生死是最大的果实和果报，五阴身不过如此。</p><p>原文：<strong>几说为杂因果分。谓所余支说为杂分。所以者何。有二种受。名为杂分。一谓后法。以触为缘因受。二谓现法。与爱为缘果受。此二杂说。为触缘受。</strong></p><p>释：几支说为是混杂了因分和果分？除了前六支、中间三支和后二支，其余都是混杂了因和果的支分，就是受支。为什么这样说呢？因为受有两种，叫作杂染分，一种是后来出现的法，以触为缘为因而后出现的受，第二种是现前存在的法，作为引生爱的缘和爱果的受，这两种合起来就说为触缘受。受既是后续的爱出生的因，又是以触为缘出生的果，既因又果叫作杂分。</p><p>原文：<strong>复次。几支能生。爱非爱境界果。几支能生自体果。谓前六支能生前果。后三支能生后边的自体果。一支俱生二果。</strong></p><p>释：复次，几支能引生出可爱和不可爱境界的果报？几支能引生出自体的果报？前六支无明、行、识、名色、六入、触六支，能引生出可爱和不可爱的境界果；后三支有、生和老死能引生五阴身自体的果报；一支既能引生可爱和不可爱的境界果报，也能引生自体果报，就是取支。</p><p>前五支无明、行、识、名色、六入能引生出触支，触支能引生出可爱和不可爱的境界果三种受，受可爱和不可爱的境界果，如果不触就不会出现三种受。如果没有六入也就没有触了，如果没有名色也就没有六入了，如果没有前世的六识也就没有名色了，如果没有意根的行，也就没有六识了，如果没有无明，也就没有意根的行了。</p><p>后三支有、生和老死能引生出自体的果报，因为三界的有存在，就会有生的果报，因为有生就会有老死的果报。而取支，因为对诸法的取着，就能引生可爱和不可爱的境界果，更能使得五阴在世间不断出现，引生出五阴的自体果报。无取，则无境界出现，也无后世的有出现，一切果报皆无。</p><p>原文：<strong>复次。几支乐受俱行。谓除二所余支。几支苦受俱行。谓即彼及所除中一。几支不苦不乐受俱行。谓如乐受道理应知。几支不与受俱行。谓所除中一。</strong></p><p>释：复次，有几支是与乐受一起运行的？除去刚才那两种，剩下的受和爱支就是与乐受一起运行的支分。因为有乐受，所以才爱，因为爱，所以才决定去取着，如果是苦受就不爱，不爱就不取，所以受和爱是与乐受相伴随的。</p><p>有几支是与苦受一起运行的？就是受自身，以及以上除去的支分中之一老死，老死支也与苦受俱行。有几支是与不苦不乐受一起运行的？就像与乐受一起运行的道理一样，受和爱也与不苦不乐受相伴随，一起运行。有几支不与受一起运行？就是以上除去的支分中之一有支，有支不与受俱行。</p><p>原文：<strong>复次。几支坏苦摄。谓乐受俱行支。及非受俱行支一分。几支苦苦摄。谓苦受俱行支。及非受俱行支一分。</strong></p><p>释：有几支是属于坏苦所摄受的？坏苦所摄的支分是与乐受俱行的受和爱支，以及不与受俱行的有支一分。有几支是属于苦苦所摄受的？与苦受一起运行的支分，以及不与受一起运行的支分中一分。</p><p>坏苦的意思是已有的法破坏掉失去了所产生的苦受，乐受保持不住消失了，心里不高兴就有苦受，爱保持不住消失了就有苦受，三界中的有抓不住消失了就有苦受，这些都叫作坏苦。受和老死支与苦受俱行，属于苦苦所摄，因为受中的苦受本来就是苦，老死也本来就是苦，本身就是苦的苦叫作苦苦。不与受俱行的有支，其中一分有苦，所以属于苦苦所摄。</p><p>原文：<strong>几支行苦摄。谓所有坏苦苦苦支。亦是行苦支。或有行苦所摄。非余二苦。谓不苦不乐受俱行支。及非受俱行支一分。</strong></p><p>释：有几支是属于行苦所摄受的？所有的坏苦和苦苦支分也都是行苦支，还有的是行苦所摄受的，不属于坏苦和苦苦的支分，是与不苦不乐受相伴随一起运行的支分，以及不与受一起共同运行的支分中的一分。</p><p>行苦范围非常广，凡是念念迁流不住的法都是苦，都是行苦所摄。因为流动不住，不停留，也就抓取不了，保持不住，生灭变异无常，所以是苦。</p><p>原文：<strong>问。于一切生处。及三摩钵底中。皆有一切支现行可得耶。答。不可得。谓无想天中。及灭尽定。无想定中。有色支可得。非无色支。若生无色界。无色支可得。非有色支。</strong></p><p>释：问：在三界中的一切可出生之处，以及在三摩钵底的禅定中，十二支是否都能现行出来，现前可以得到吗？答：十二支不是都可以现前，都能得到的。比如在无想天中，以及在灭尽定中，没有识支可得，没有触、受、想、爱、取可得。在无想定中，无识支，但有色身支分可得，并不是没有色支。如果生到无色界中就没有色支可得，但非色支的识支还在，只有意根与法尘的触，没有色根的触。</p><p>原文：<strong>问。颇有依支。得离支耶。答。有。谓依上地支。离下地支。此但一分非全。唯暂时非究竟。</strong></p><p>释：问：难道真的有依靠着一个支分，就能离开另一个支分吗？答：有，就是依靠着上地支分，而离开下地支分，如依靠着无色界的支分离开色界的支分，依靠着色界支分，离开欲界支分；或者是依靠着色界更高的支分，而离开色界低的支分，依靠着欲界天更高的支分，离开欲界低一些的支分。这仅仅是指一方面，并非都是以如此方式离开支分。</p><p>原文：<strong>问。几支染污。几支不染污。答。三染。余通二种。若不染污。善及无覆无记别故。分为二种应知。问。几支欲界系。答。一切支。和合等起故。问。几支色界系。答。一切一分。</strong></p><p>释：问：十二支中有几支是染污的，有几支是不染污的？答：有三支无明、爱、取是染污的，其余都是既通染污也通不染污两种的支分。如果是通不染污的支分，就属于是善性和不善不恶性没有覆障的，不染污支分属于这两种性质。问：有几支是属于欲界所系缚的？答：所有十二支都是欲界所系缚的，都是和合起来在欲界出现的。问：有几支是属于色界所系缚的？答：十二支中各有一分是属于色界所系缚的。</p><p>原文：<strong>问。云何应知。彼有老耶。答。彼诸行有朽坏腐败性故。如色界系。当知无色界系亦尔。问。几支是学。答。无。问。几支是无学。答。亦无。问。几支是非学非无学。答。一切。</strong></p><p>释：如何才能知道十二支分中有老这支呢？答：这一切法的行都有腐朽、败坏、毁坏性质的缘故，所以才说有老支的存在。如色界所系着的法是这样，无色界所系着的法也是这样，有败坏、毁破的属性。问：有几支是属于有学处？答：没有属于有学处支分。问：有几支属于无学处支分？答：没有属于无学处的支分。问：有几支属于非有学处也非无学处支分？答：十二支都是属于非有学处非无学处支分。</p><p>原文：<strong>问。所有善有漏支。彼何故非学耶。答。堕流转故。若学所有善有漏法。彼与流转相违故。及用明为缘故非支。</strong></p><p>释：问：十二支中所有的有漏善法支，为什么不是学处呢？答：因为有漏的善法也能让人堕落和生死流转，如果所有的有漏善法是学处的话，就与生死流转相违背了，也会破除无明出现明，如果有了明，就不属于十二因缘中的支分了。因此说十二支中没有学处。</p><p>原文：<strong>问。预流果当言几支已断耶。答。一切一分。无全断者。如预流果。如是一来果亦尔。问。不还果当言几支已断耶。答。欲界一切。色无色界不定。问。阿罗汉当言几支已断耶。答。三界一切。</strong></p><p>释：问：初果预流果十二支中断了几支？答：预流果十二支当中每一支都断除了一分，没有全部都断的。和预流果一样，二果一来果也是这样，十二支中每一支都断一部分，没有全部都断的。问：三果不还果十二支中断除了几支？答：不还果十二支中断除了属于欲界的一切支分，属于色界和无色界支分有的断有的没有断。问：阿罗汉十二支中断除了几支？答：阿罗汉断除了三界所有的支分。</p><p>十二支分都在三界中运行，都属于三界中支分，阿罗汉断除了三界中一切法，才能入无余涅槃，那么十二支分也就全部都断除无余了。而三果有初禅以上的禅定，就是有色界定和无色界定，其心不与欲界相应，断除了欲界的贪欲，也断除了嗔恚，不再行欲界法，但还有色界和无色界的法没有完全断除，还残留一部分，至于这部分有多少，那是因人而异的，所以说色界和无色界支分的断除多少是不一定的。</p></div>"
},{
    "title": "第四节 缘起法的六种阐述",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第四节  缘起法的六种阐述</strong></p><p>原文：<strong>复次。于彼彼经中。由几种言说道理。说缘起耶。谓略说由六种言说道理。一由顺次第说。二由逆次第说。三由一分支说。四由具分支说。五由黑品说。六由白品说。</strong></p><p>释：复次，在各个经中，都从哪几个方面讲述缘起之理的？大略来说有六种方式来讲述缘起法。第一种是顺着十二因缘的次第而说缘起法；第二种是逆着十二因缘的次第来来说缘起法；第三种是其中一支开始讲述，逐渐扩展到其他支分；第四种是从整体十二支来讲述缘起法；第五种是从恶不善法方面来讲述缘起法；第六种是从善法方面来讲述缘起法。</p><p>原文：<strong>问。如世尊说缘起甚深。此甚深义。云何应知。答。由十种相。应知缘起甚深义。谓依无常义。苦义空义。无我义说。</strong></p><p>释：问：如世尊您说的缘起法甚深，如何才能知道这个甚深的含义？答：从十种相上就能知道缘起法的甚深义了，就是依着缘起法的无常义、苦义、空义、无我义而说的十种相，来显示缘起法的甚深含义。</p><p>原文：<strong>依无常义者。谓从自种子生。亦待他缘。又从他缘生。亦待自种子。又从自种子。又从他缘生。而种及缘于此生事。无作无用。亦无运转。又复此二因性功能。非不是有。</strong></p><p>释：依无常义的意思就是指缘起法是从自体的种子出生的，同时也要依赖其他的缘成熟，才能共同作为缘起法出生的缘。再者，缘起法依赖其他的缘出生时，也要有自体种子的缘，两种不可缺一，必须共同出现，才能有缘起法的产生。再者，缘起法不仅依从自体种子，又依从别的缘而出生，然而自体种子以及其他的缘对于缘起法出生这件事，却没有什么实质作用，也不随缘起法运转和动转，但这两种缘的功能作用又不是没有，是有功能作用的，只是不能直接出生缘起法罢了。</p><p>比如眼识是缘起法，眼识的自体种子是眼识的识种子，生起眼识的其他缘除了识种子，还有八种缘，色尘是其中一种缘，这些缘聚集起来，眼识才能出生，缺少一个缘，眼识就不能出生。但是眼识却不是由这些缘生出来的，而是第八识借助这些缘生出了眼识，就是说出生眼识的功能是第八识的，不是眼识的自体种子缘和其他八种缘，九种缘对于出生眼识这就是没有实质的作用，仅仅是助缘、增上缘而已。</p><p>原文：<strong>又诸有支。虽无始来。其相成就。然刹那刹那。新新相转。又缘起支。虽刹那速灭。然似停住运动相现。依苦义者。谓缘起支。一味苦相。而似三种相现。</strong></p><p>释：再次说，十二有支，虽然是无始劫以来，其相不断的建立，然而这些相却是刹那刹那的生灭，新的运转出来灭去，下一个新的相就又出现了，作用不断的运转，维持着十二有支的生住异灭。另外，这些缘起支虽然是刹那刹那快速的生灭，然而却显示着好像是有停滞和运动的相不断的出现。</p><p>依赖缘起法的苦义来说，缘起法就是纯粹的一个苦味相，没有别的相，然而却好像有苦、乐和不苦不乐的三种相出现。</p><p>原文：<strong>依空义者。谓缘起支。虽离有情作者受者。然似不离。显现而说。依无我义者。谓缘起支。虽不自在。实无有我相。然似我相显现。依胜义谛。诸法自性虽不可说。而言诸法自性可说。</strong></p><p>释：依照缘起法的空义来说，缘起支虽然是离开了有情众生的作者和受者，然而好像是没有离，能显现出缘起支的作者和受者，因此说为空。依赖无我的含义来说，缘起支虽然是不自在的，但确实是没有我相，然而却好像有我相的显现。依赖胜义諦而说，这些缘起法的自体性虽然是不可说的，但还要说诸法有自性可说。</p><p>原文：<strong>问。应以几智知缘起耶。答。二。谓以法住智。及真实智。云何以法住智。谓如佛施设开示。无倒而知。云何以真实智。谓如学见迹。观甚深义。</strong></p><p>释：问：应该以几种智慧了知缘起法？答：应该以两种智慧了知缘起法，就是以法住智和真实智二种智慧。如何是以法住智了知缘起法？比如说佛陀所施设和开示的那样，应该不颠倒的全部都知悉，具有如实证知因缘法的智慧。如何是以真实智了知缘起法？比如说修学十二因缘法之后，见到了圣道之迹，证得了因缘观，得了法眼净，就能观察到甚深的缘起法之义理。</p><p>原文：<strong>问。如世尊言。是诸缘起。非我所作。亦非余作。所以者何。若佛出世。若不出世。安住法性。法住法界。云何法性。云何法住。云何法界。答。是诸缘起。无始时来。理成就性。是名法性。如成就性。以无颠倒。文句安立。是名法住。由此法住。以彼法性为因。是故说彼名为法界。</strong></p><p>释：问：就像世尊所说的那样，这些所有的缘起法，并不是我所作的，也不是其他人所作的。为什么这样说呢？因为如果佛出世或者不出世，缘起法都会安住在法性上，住在法界里，是长存之理。什么是法性？什么是法界？答：法性就是所有的缘起法，从无始劫以来，缘起之理的成就之性，理形成之性。和理的成就之性一样，以无颠倒的文句把理安立起来，就叫作法住。以各种理的法性为因，因此就称为法界。</p><p>原文：<strong>问。如经言。生若无者。无处无位。生可是有。若一切种生非有者。生缘老死。应不可得。何故此中说。彼自性缘自性耶。答。依自种子果生说故。谓识乃至受支。是生种子故。义说为生。由此有故。后时即此果支。名有缘生。如是余支。如经所说。随其所应。尽当知。</strong></p><p>释：问：如经中说，生支如果没有了，五阴就没有了处所，也没有生死流转的任何果位了。可是生却是存在着的，如果一切种子的生没有了，生缘老死应该就没有了。生处是指生命出生所在的环境，三界九地。生位是指生命成长的几个阶段，如胎儿位、婴儿位、幼年位、少年位、青年位、中年位、老年位、死位等等。</p><p>为什么这里却说生的自性缘于自性呢？答：依着生命自体的种子所变现成的果而说有生，就是自性缘于自性，六识支、名色支、六入支、触支乃至于受支，就是生的种子，为阐明这个义理就说为生。由于有这些支分的缘故，后世就会有这些支分的果支，就是有缘生。与此相同，其余的支分有、取、爱、受、触、六入、名色、六识、行、无明等等，与经文中所说的一样，随其所相应的法，也应当如此理解。</p><p>原文：<strong>问。已说一切支。非更互为缘。何故建立。名色与识互为缘耶。答。识于现法中。用名色为缘故。名色复于后法中。用识为缘故。所以者何。以于母腹中。有相续时。说互为缘故。由识为缘。于母腹中。诸精血色。名所摄受。和合共成羯罗蓝性。即此名色为缘。复令彼识于此得住。</strong></p><p>释：问：现在已经把十二支都讲了，各个支分并不是都互相为缘的，为什么说名色与识是互相为缘的？答：六识在现存的法中，以名色为缘才能出生和运转，名色又在后世出现的法中，以六识为缘才能出生和存在。为什么这样说呢？因为名色在母腹中再继续生长以后，就会有六识出生在名色上，名色和六识互相为缘，以前世的六识为缘，名色在母腹中由精血构成的受精卵色以及第七识的名所摄受，共同组成羯罗蓝性质的受精卵。再以这个名色为缘，名色生长以后六识就会在名色上安住下来。</p><p>在逆因缘法中，阿赖耶识与名色也是互相为缘的，名色以阿赖耶识为缘得以在母腹中安住，阿赖耶识以名色为缘得以显现其在世间法上的功能作用，二者缺一，世间法就不存在了。</p><p>原文：<strong>问。何故菩萨观黑品时。唯至识支。其意转还。非至余支耶。答。由此二支。更互为缘故。如识缘名色。如是名色亦缘识。是故观心至识转还。于余支中。无有如是转还道理。</strong></p><p>释：问：为什么菩萨们在观行染污流转生死门的时候，只能观行到识支，再也不能往前观行，心就回来了，不能接续观行到其他支呢？答：这是因为识支（这里是指阿赖耶识）和名色支是互相为缘的缘故，如阿赖耶识缘于名色才能有世俗作用显现出来，同样的名色也是缘于阿赖耶识才能出生，因此观行心的流转到阿赖耶识这里就退回去，不能再往前观行了，原文阿赖耶识的前边再也没有任何法了，阿赖耶识就是一切法的源头。而在观行其余支分的时候，就没有这种退回去的现象。因为其余支分的前面还有法，是自体出生的缘。</p><p>原文：<strong>于此一处。显示更互为缘道理。故名转还。于还灭品中。名色非是后有识还灭因。由此因缘复过观察。</strong></p><p>释：在观行识支这里，显示出阿赖耶识与名色互相为缘的道理，所以就叫作转还，退回到名色这里，不能再往前观行行支了，阿赖耶识就是名色的源头，已经到头了。从这里可以看出，是阿赖耶识出生了名色，名色来源于阿赖耶识。在缘起法的还灭品当中，名色不是后世再出生的六识灭去的因，由于这个原因就越过名色再去观察。六识灭去的因是意根的行灭，意根行灭的因是意根的无明灭。</p><p>在逆观十二因缘法中，观察到名色这里出现个分支，分为两条道来观察，一是从名色观察六识，二是从名色观察到名色的源头阿赖耶识。首先观察老死支，发现老死的出现是因为有生，再观察生，发现生的出现是因为有三界有，再观察有，发现有的出现是因为取，再观察取，发现取的出现是因为有爱，再观察爱，发现爱的出现是因为受，再观察受，发现受的出现是因为触，再观察触，发现触的出现是因为六入，再观察六入，发现六入的出现是因为有名色。</p><p>到名色这里就很关键了，名色的前面一个是六识，一个是阿赖耶识，六识是后世名色出生的缘，因为六识的身口意造作，存下了业种，导致后世不得不出来受报，实现业种。但是具体名色的出生却不是六识生出来的，因为六识灭去以后，名色才能在母腹中受生出现，所以出生名色的不是六识，而是阿赖耶识。这就涉及到名色出现的另外一个缘阿赖耶识，观察名色出现根本因的时候，就发现是阿赖耶识出生了名色，再往前观察就观察不下去了，阿赖耶识之前再也没有法了，没有导致阿赖耶识出生的缘，这就说明阿赖耶识不是因缘法，不是由于什么因缘出生的，那就是不生不灭的本有的识心。</p><p>原文：<strong>问。何因缘故说。缘起支非自作。非他作。非俱作。亦非无因生耶。答。生者非有故。缘无作用故。缘力所生故。</strong></p><p>释：问：是因为什么因缘才说缘起支不是缘起法本体所作出来的，不是缘起法之外的他缘所作出来的，也不是缘起法本身和他缘共同作出来的，也不是没有任何因缘就能生出来的？答：缘起法的生是无的法，是空的法，实际上并不存在，而引起缘起法出生的缘也没有真实的作用，都是一种因缘力所引生出来的。</p><p>原文：<strong>问。于缘起中。何等是苦芽。谁守养苦芽。何等为苦树。答。无明行缘所引识。乃至受是苦芽。受缘所引爱。乃至有是守养苦芽。生与老死当知是苦树。</strong></p><p>释：问：在缘起法中哪个支分是苦芽？是哪个支分守护了苦芽？哪个支分是苦树？答：无明和行的因缘所引生出的识支，以及名色、六入、触和受支是苦芽，而受所引生的爱以及取和有支守护和养育着苦芽，那么就应当知道生和老死就是苦树。</p><p>原文：<strong>问。几缘起支当知如炷。答。识乃至受。问。几支如膏。答。无明行。爱取有。问。几支如焰。答。生老死应知。</strong></p><p>释：问：有几个缘起支好像如灯柱一样？答：识、名色、六入、触和受支好像如灯柱一样，加了灯油就能燃烧，生死煎熬就出现了。问：有几个缘起支好像如灯的膏油一样？答：无明、行、爱、取和有支，好像如膏油一样，与识、名色、六入、触、受和合在一起，就会点燃灯柱，燃烧起生死的大火。问：有几支如火焰一样？答：生和老死支就像火焰一样的燃烧，苦恼无量。</p><p>原文：<strong>问。何因缘故。于缘起黑品教中。说名增益。答。一切有支。纯大苦聚。为后果故。又诸有支。前前为缘。后后所随故。</strong></p><p>释：问：是因为什么的缘故，在缘起法的黑品教门中，说缘起法有增益苦聚的作用？答：因为一切有支中，纯大苦聚是十二支分最后的结果，所以说十二支缘起法就是染污业，是黑品类，能增益苦聚。又因为十二有支中，前边的有支作为因缘，后边的有支紧紧跟随，才产生了纯大苦聚。所以说十二有支能增益染污和黑品业。</p><p>原文：<strong>问。何因缘故。于白品教中。说名损减。答。由一切支。前前永断。后后减故。又是纯大苦聚损减因故。</strong></p><p>释：问：是什么因缘的缘故，在善法品类的教门中，说缘起法有损减苦聚的作用？答：因为在十二缘起支中，如果前边的支分永远断灭了，后边的支分就会得到损减，所以说缘起支对于苦聚有损减的作用。</p><p>原文：<strong>问。几缘起支。名有因法。答。谓前七。问。几缘起支。名有因苦。答。余五。问。几支灭是漏尽所显。答。三。</strong></p><p>释：问：有几个缘起支名为是有因之法，能引生其他法的产生？答：前七支无明、行、识、名色、六入、触、受是三界有的因，能引生后边支分的生起。问：有几个缘起支叫作有因的苦支？答：后五支爱、取、有、生和老死支，是三界有因的苦支。问：有几个缘起支灭去了，是无明漏尽所显示出来的？答：有三支，有、生和老死支是无明烦恼漏尽所显示出来的。漏尽以后，就会取无余涅槃，那么有、生和老死就不会再出现了，生死轮回三界苦就消失了。</p><p>原文：<strong>问。几支灭是缘尽所显。答。即此三是。余支缘故。</strong></p><p>释：有几支是缘尽了所显示出来的？答：有、生和老死三支灭了是缘尽所显示出来的，与三界的缘尽了，三界的有就不会再出现，生就没有了，也就没有了老死。除了这三支，其余的支分虽然灭尽了，但是与三界还有缘没有了断，还有缘存在着。</p><p>比如说通过观察十二因缘法，灭尽了无明，但是与三界还有缘，意根就还有行存在，只不过是灭去了无明的明行；还有六识存在，只不过是灭去了无明的六识，造作的是明的身口意业行，没有染污了。</p><p>还有名色存在，只不过是没有无明的名色，还有六入存在，只不过是没有染污了；还有触存在，只不过是灭去了无明的明触；还有受存在，只不过是灭去了无明的受；也许还有爱存在，只不过是灭去了无明的爱，爱佛法爱大乘修道而已；还有取存在，只不过是灭去了无明的取，取着大乘佛法和善法而已；还有三界法存在，只不过是不贪着三界法而已；还有老死存在，只不过是还有一点点余苦，没有那么多苦痛而已。大乘菩萨辟支佛后世还会有生，现世还有十二明支，没有十二无明支了。</p><p>原文：<strong>问。几支灭是受尽所显。答。一。谓由烦恼已断故。所依灭时。此一切受。皆永息灭故。</strong></p><p>释：问：几支灭了是受尽所显示的支分？答：只有受一支灭了是受尽所显示的法，由于烦恼已经断尽了，受所依止的法都灭尽了，那么这一切的受就都会永远的熄灭了。</p><p>原文：<strong>问。何因缘故。依止缘起。建立七十七智耶。答。为显有因杂染智故。又复为显。于自相续。自已所作。杂染智故。又复为显。前际诸支。无始时故。又复为显。后际诸支。容有杂染。还灭义故。又复为显。支所不摄。诸有漏慧。遍知义故。于一一支。皆作七智。当知总有。七十七智。</strong></p><p>释：问：是什么因缘之故，依止缘起支建立了七十七智？答：是为了显示三界的有是因为有杂染智慧的缘故；也为了显示自己的五阴身相续运行过程中，自己所作出的杂染智慧的缘故；又是为了显示十二支中前边的一些支分没有开始的时候，无明支是无始劫以前就有的，不是后天出生的，因此没有开始，叫作无始无明；又为了显示后边的各支分容纳的杂染，有往还灭去之义；又为了显示各支分所摄受的所有有漏的智慧，有遍知一切法之义。除了无明支，其余十一支对于七种智慧，合起来就有七十七种智慧。</p><p>原文：<strong>问。何因缘故。于缘起中。建立四十四智耶。答。为显于一一支。依四圣谛。观察道理。是故总有。四十四智。</strong></p><p>释：问：是什么因缘的缘故，在缘起法中建立了四十四种智慧？答：为了显示十一个支分依据四圣谛来观察修道之理，因此总共就建立了四十四种观察智慧，每一个支分都用智慧观察四圣谛理。比如用如理如实的智慧观察行的苦、集、灭、道，观察六识的苦集灭道，观察名色的苦集灭道，观察六入的苦集灭道，观察触、受、爱、取、有、生和老死的苦集灭道，这样合起来就是四十四种观察智。</p><p>原文：<strong>复次。若生欲界。依欲界身。引发上地若眼若耳。由此见闻。下地自地所有色声。又依此身。起三界意。及不系意。而现在前。若生色无色界。除其下地。一切现前。如在欲界。</strong></p><p>释：复次，如果出生在欲界，依靠着欲界的色身，引发出上地的眼耳等根的功能，由上界的眼根耳根就见闻到了下地和现前地的色声尘境。又依此欲界身，生起三界的心意，以及不系缚于三界的心意就现前出现了。如果是生在色界和无色界，除了下地，其他地的所有境界都会现前，就像在欲界地一样。</p></div>"
},{
    "title": "第五节 第五十五卷三种现观",
    "author": "生如法师",
    "date": "2022年08月10日",
    "html": "<div class=\"B1_text\"><p><strong>第五节 第五十五卷——三种现观 </strong></p><p>原文：<strong>复次。此三种杂染。谓烦恼杂染。业杂染。生杂染。为欲断故。修六种现观。应知何等为六。谓思现观。信现观。戒现观。现观智谛现观。现观边智谛现观。究竟现观。</strong></p><p>释：复次，有烦恼杂染、业杂染和生杂染，为了要断除这三种杂染的缘故，就要修行六种现量观行。这六种现量观行分别都是指什么？是指思的现量观行、信的现量观行、戒的现量观行、现观智谛的现量观行、现观边智谛的现量观行和究竟的现量观行。</p><p>烦恼杂染是贪嗔痴的心行，由于有贪嗔痴烦恼杂染，就会造作出贪嗔痴烦恼杂染业行，有了贪嗔痴烦恼杂染业行，就会导致后世有杂染的生身。要想断除这些杂染法，就要修习六种现量观行。下面分别介绍这几种现观。</p><p>思现观就是对于四圣谛理有如实、审慎和决定的思，能决定明了和证悟诸法苦空无常无我之理，外道不能影响其决定思，对于四圣谛理不复退转。思现观成就，就有正行，心地清净，心生欢喜，断诸疑惑，永住善道，不趣恶道。这就是意识和意根的思，单独意识的思做不到改变心行，断除疑惑，心地清净，恶道永绝。当然思现观也包括对大乘法的思，既然叫作现观，就会符合实际，符合真理，就有实证的智慧在其中。</p><p>信现观是指对于三宝有决定的信和清净的信，没有犹疑和三心二意，当然就不会再造诽谤业。决定信就代表智慧，有智慧才有现观，否则就不能现观，只能妄分别。有信现观的人，就不再造作诽谤佛、法、僧三宝的业行，诽谤佛包括说佛只是阿罗汉。辟支佛的果位，只有四圣谛和十二因缘的证量，再没有其他证量了；诽谤佛没有大神通和无量神通，诽谤佛与世间人差不多，也很平凡；诽谤佛是在家人，也行在家人事，诽谤佛的肉暨是世间人的头发等等，不一而足，这些言论都不是清净信和决定信，因此命终都会趣向三恶道受报。有信现观的人，对三世诸佛都能如实了知其无量的功德、福德和智慧神通，不生误解，对三宝有胜解，不迷信，有正行，有善业。</p><p>诽谤法在末法时期是普遍的现象，见多就不奇怪了，最严重的就是大乘非佛说，这些人丝毫看不懂大乘法义是否正真，是否如理，是否殊胜，以严重的愚痴心盲目无根据的断定为非佛说；还有把法说为非法，非法说为法，种种颠倒，都是很严重的谤法行为，命终必感召地狱果报。</p><p>谤僧的现象也很普遍，僧说为非僧，非僧说为是僧，就是谤僧；指责和宣传出家人的种种身口意行过失，不管有其事还是无其事都属于谤僧，破坏僧人在众生心中的形象，造成不良影响，导致众生对僧宝失去信心，不再信受三宝，摧毁众生的信根，这些罪业都是极大的，多数是地狱罪，报在地狱。</p><p>戒现观，就是对于佛所制定的种种戒律已经能够坚守不犯，不再能造作三恶道的业行。成就戒现观的人，绝对不会再故意杀生、不与取、邪淫、妄语、饮酒，身口意业清净无漏，已经解脱了三恶道的苦，远离了十不善业道，生身已为预流果直至阿罗汉果，以及辟支佛果、菩萨果和佛果，就是说只有圣果成就的人才能有戒现观。</p><p>以上瑜伽师地论第五十五卷中所说，具足戒现观的初果以上的圣贤人不会再违犯五戒以及种种所受持的戒律，心不与三恶道相应，就不会造作趣向三恶道的十不善道业，不会违犯五戒、比丘戒、比丘尼戒和菩萨戒。如果连五戒都不能守持的人，就可以依据瑜伽师地论和显扬圣教论断定为此人没有初果以上的证量，所说的证果是误判，是假证，不可信。</p><p>断我见证得初果以后的人，不会再下三恶道，为什么如此？因为其心改变了，心与三恶道业不相应，不会再造三恶道业行，也就不会再下三恶道受苦。心证得无我，就空了，心空的人不可能再造三恶道的业行。什么是三恶道的业行？就是违犯五戒的业行，违犯十善业的业行。受持五戒才能得人身，不得三恶道众生身，受持十善才能得人和天人身，不得三恶道众生身。断我见证果的人心行一定与五戒十善相应，才能免除三恶道业和身。</p><p>那么这个断我见的心，与五戒十善相应的心，不与三恶道业相应的心，是哪个心呢？意识当然是这样的心，最主要的意根绝对应该是这样的心，而且意根是无间断的心，断我见之后，意根才会无间断的有毗钵舍那和奢摩他的双运道功德，不管是睡觉、昏迷、死亡和中阴身的任何时候，都有断我见的功德在身，就会以此功德受生、投胎和入胎，那么意根是什么心行，有什么业，就会有相应的胎身。想要不入三恶道，就需要意根断我见，具诸功德，只有意识的闻法智慧、推理智慧、臆测智慧和情思意解的智慧，绝对保证不了断除粗重的烦恼现行，保证不了不造作三恶道的业行，保证不了不违犯五戒十善，也就保证不了命终不入三恶道。</p><p>现观智谛现观，根据瑜伽师地论第五十五卷中说，在加行修道过程中，首先要把见道的福德资粮积累得极其圆满以后，心又得到有效的调伏和调柔了，依从随顺于世间抉择分的边际，生起无间断的善根，意思是说通过修行加行道，意根已经充分的得到了善法的熏染，心地柔软和调伏，善根显发出来了。在佛法修道中的无间一般都是指意根，意识是间断的，不断灭去的，是不可靠的，只有修到意根，善法才算修到一个阶段，才有质的飞跃，道业才能上一层楼。</p><p>意根生发出善根以后，心就会初步的遣除有情众生的假法，意思是说初步证道，证得五蕴是空是假是虚妄的了，这时候就能除去初次见道所断除的粗重烦恼。这个意思已经说的很明白了，初果见道是会断除粗重烦恼现行的，能除去一些粗重的烦恼。只有意根也见道之后，才能断除粗重烦恼，意识是没办法断除烦恼的。</p><p>证得初果以后，就会无间断的显现和延续初果的见道智慧证量，然后第二次生起见道的功德智慧，心中进一步遣除五蕴众生的种种假法，我见再进一步深入地断除，证得二果，能除去中品见道所断的粗重烦恼。这个意思就是说，初果见道不究竟，我见只是初分软品断，还有二次的中品断和三品的究竟断，粗重烦恼也断的不究竟，二果见道、三四果见道还要继续断除粗重烦恼。二果当然也是意根证得的，才能达到无间断的智慧生起，进一步的断除粗重烦恼。</p><p>证得二果以后，就会无间断的显现和延续二果的见道智慧证量，然后第三次生起见道的功德智慧，更深入的生起普遍遣除一切有情众生的五蕴假法，我见进一步更深入究竟的断除了，以此功德就断除了一切见道所断的粗重烦恼现行。瑜伽师地论第五十五卷中说，这种见道是初禅定和观行智慧的双运道，不仅有甚深的断我见的观行智慧，还要有初禅禅定，才能断除一切粗重烦恼，这就是三果和四果圣人的断我见，名为三果四果见道。</p><p>之前的初果和二果，不必有初禅禅定，但一定要有未到地定，而且未到地定要具足，否则不会有断我见的观行智慧生起，不能断我见证得初果和二果。在证得三果的时候，具足了三次断我见的三品毘鉢舍那观行智慧，同时也具足了禅定奢摩他的三品见道禅定心，再加上禅定与智慧的双运，合起来立为三心，这样就会在一刹那中三果四果的止观全部具足。</p><p>所有修学四圣谛的仁者，一定要依法不依人，都应该依从瑜伽师地论中弥勒菩萨所讲的断我见见道标准，来衡量自他是否为真正定慧等持的见道，还是自我标榜的假见道，厘清见道标准，就不会混淆视听，犯大妄语罪业，破坏佛教的教法。</p><p>现观智谛现观，具有现观智谛现观的人，能获得一切出家果位，能引发一切清净功德，能引生出其余的现观智慧，能在善道中帮助感召清净果和业。如果成就了现观智谛现观的有学无学者，永远不再依着虚妄的我见而有所造作，所作都是无我的，对于自己所证得的法永远不会有疑惑，永远不会在有杂染染污的处所出生，在所出生之处也不会再有贪染了。在现世生活和修行中，所有的世间事相都清净了，没有染污不净，不会再诽谤声闻、独觉和大乘法，不再造作恶业，更不能造五逆罪和七逆罪，再也不会第八次在三界中出生了，这是初果极尽七有的意思。</p><p>现观边智谛现观，这种智慧在见道以后才能获得，在哪种见道才能获得？是在第三品见道，在初禅定和智慧双运的三果和四果见道以后获得的现观智，是缘于先前的世间智慧，观察下地（欲界）和上地（色界初禅天）以及欲界和色界初禅天的两种安立的真实理所获得的境界，属于法智和类智的世俗智慧所摄，通于世间智慧和出世间智慧。在四圣谛的每一谛的观行中，都会出现忍可欲乐智和现观决定智。这样依靠前一个谛的现观，就会在上一个谛和下一个谛的观行中，生起两个两种现观智，这就是现观边智谛现观。成就了现观边智谛现观的三四果人，永远不会害怕他人的诘难发问，因为现观智深利，通达解脱道的法义，没有人能够难倒于他，所有难问都能善巧解答。</p><p>究竟现观，这是四果阿罗汉所证得的现量观行智慧，由于四果阿罗汉以及断尽了修道所断的一切烦恼现行，就获得了灭尽三界有的智慧，获得后世可以永不再出生的智慧，或者是因为其怜悯众生发起救度众生之心，后世仍然会出生于世，但无一切烦恼现行，也仍然依其世间永灭的智慧而立世，这就是究竟现观。证得世间永灭的智慧最究竟，证得世间究竟是空的智慧最究竟，就是究竟现观，以前的现观还有漏没有尽，所以还不是究竟现观。   </p><p>成就究竟现观的大阿罗汉，永远不会再犯五戒，不再故意杀生、不与取、淫欲、妄语和积蓄财宝而受用。这里的淫欲是指任何一种的淫欲，不管轻重，不管世俗法是否允许，不管道德和不道德，因为只要证得阿罗汉果，必都是出家僧，没有一个是在家人，不会有任何家属，所以也不会有正淫之说。这里的妄语是指任何一种妄语，包括在世俗法中故意错说的世间妄语。阿罗汉永远不会害怕以后会发生的不可知之事，也不会把世间所有的苦乐虚妄的计为是自作、他作、自他作，也不会妄记为非自非他的无因生。成就了究竟现观的大阿罗汉解脱了世间一切生死大苦，此身是最后身，不再受后有，留形住世者除外。</p></div>"
}]