[{
    "title": "第一卷　本地分中五识身相应地",
    "author": "生如法师",
    "date": "2022年08月14日",
    "html": "<div class=\"B1_text\"><p><strong>第一卷　本地分中五识身相应地<span> </span></strong></p><p>原文：<strong>云何五识身相应地。谓五识身自性。彼所依。彼所缘。彼助伴。彼作业。何等为五识身耶。所谓眼识。耳识。鼻识。舌识。身识。</strong></p><p>释：什么是与五识身相应的地呢？包括五个方面：就是五识身的自体性；五识所依；五识所缘；五识助伴；五识作业。五识是指眼识、耳识、鼻识、舌识、身识，与五识相应的地是欲界地。地就是三界中的九地，三界是欲界、色界、无色界，九地就是欲界一地、色界的初禅天是第二地、二禅天是第三地，三禅天是第四地，四禅天就是第五地，再加无色界的四空天的四地就是九地。</p><p>和五识身的相应的地是指什么呢？是指欲界地，只有在欲界的众生有眼识、耳识、鼻识、舌识、身识，这五识是俱全的。色界的初禅天天人，没有鼻识和舌识，只有眼识、耳识和身识这三个识，再加意识，第七识和第八识。二禅天以上的天人也都没有鼻识和舌识，所以与五识身相应的就是欲界地，不包括色界和无色界。</p><p>五识身相应地的内涵包括：五识身的自性；五识身所依；五识身所缘；五识身助伴；五识身作业这五个方面。五识身的自性就是五识身自体性是什么，能做些什么事业，有什么功用，五识身的自性是有了别性，有分别的功能作用，叫做五识自性。五识身所依，是说五识依赖什么法才能出生，五识要依赖于五根，而且是净色根也就是胜义根，五识才能出生。五识身所缘，是指五识攀缘什么法，缘于什么法，五识缘于五尘色法，而且是内色尘。</p><p>五识的助伴是指能协助五识运行的法，能帮助五识运行显现，帮助五识起分别了别作用的法叫做助伴，五识的助伴就是五识的心所法：作意、触、受、想、思。五识的作业是指五识能做些什么，能起什么作用，五识的作业就是了别分别性，能了别五尘。以上这五个方面，总名为五识身相应地，那就是欲界地，因为只有欲界里有具足的五尘。五识身是什么呢，就是眼识、耳识、鼻识、舌识、身识，这五识身和欲界地相应。</p><p>原文：<strong>云何眼识自性。谓依眼了别色。彼所依者。俱有依。谓眼。等无间依。谓意。种子依。谓即此一切种子。执受所依。异熟所摄。阿赖耶识。</strong></p><p>释：具体讲眼识，眼识的自性是依靠着眼根来了别色尘。眼识所依止的是眼根，眼识的出生必须先有眼根，这个根是指净色根，就是后脑那个位置的胜义根，阿赖耶识在胜义根变出色尘的影像，叫做内色尘，胜义根触内色尘，眼识才能被阿赖耶识生出来，所以眼根的胜义根，是眼识的俱有依。眼识的等无间依就是指眼识的开导依，是眼识自体种子。</p><p>什么叫等无间依呢？等就是同类种子，不是他类种子，无间就是没有间断没有间隔地运行，依就是依靠依赖，同类种子相等无间断地依赖依止着运行。眼识的运行是无数个眼识种子刹那生灭所形成的，就是第一个识种子出生，刹那就在出生的那地方灭去，后边第二个眼识种子又在同一个处所生出来，刹那间在那个地方又灭去了，第三个种子在同一个处所生出来又在同一个地方灭去，这样无数个眼识种子在同一个地方刹那生灭，就形成了眼识，眼识才能有分别性。</p><p>前一个眼识种子在前边开导其位，后一个眼识种子才能在那个位置出生，那么前一个眼识种子就作为后一个眼识种子的开导依，也叫做等无间依。所有的眼识种子都叫做开导依或者是等无间依，除非最后一个种子。第一个眼识生出来不能了别色尘，第二个种子生出来，了别一点点，第三个种子生出来，决定了别，这时就知道色了。</p><p>眼识的种子依，是说眼识的种子依靠着什么法才能出生，是什么法能出生种子，种子来自于哪里。什么叫种子？种子是产生色法和心法的最基本组成成分。眼识有眼识的种子，耳识有耳识的种子，鼻识有鼻识的种子，每个识都有自体种子。所以眼识一定要有眼识种子，眼识才能产生出来。</p><p>眼识所需的一切种子，都来自于阿赖耶识，或者叫做异熟识。阿赖耶识里有识种子，七大种子之一，输送出来，就形成七识，众生才能有了别的功能作用。眼识自性要依靠种子才能有眼识的产生，种子生成眼识，让眼识运行，是要有一个依止处的，就是眼识的所有种子执受所依，那就是阿赖耶识异熟识。种子必需依止于不生不灭的阿赖耶识才能存在、输出和运作，才能形成眼识的自体，就是说阿赖耶识和异熟识是眼识种子的所依。</p><p>阿赖耶识的名称是八地菩萨前使用的，里面含有七识的贪嗔痴烦恼或者有贪嗔痴烦恼的习气，八地以前我们叫阿赖耶识。八地以后叫做异熟识，异熟识也有眼识种子，能产生眼识，八地以上的菩萨们一直到佛地都有眼识种子，能够产生眼识，起到见色的功能作用。到佛地就不叫异熟识，叫做无垢识。</p><p>异熟识里有变异生死的种子，生死还没有了尽。异熟的意思是说，我们现在造的业，作为业种存在异熟识里，在将来因缘成熟时，才受报。受报的时间是在另外的时间，叫做异时，就是在未来才能受报，或者是晚年或者是来世，业缘才能成熟，果报才能实现。或者是异地而报，我们在娑婆世界造业或者人间造业，来世到地狱受恶的果报，或者到天界受善的果报，或者还是在同类身受报，只是地点发生变化了。异类而报，是造业和受报的色身种类改变了，不是同类众生身。这样含藏异时异地异类而成熟的业种的心体，就叫做异熟识。</p><p>原文：<strong>如是略说两种所依。谓色。非色。眼是色。余非色。眼。谓四大种所造眼识所依净色。无见有对。</strong></p><p>释：眼识产生所依赖的对象，一个是色法，一个是非色法。色法就是眼根，眼根指眼睛的胜义根，而不是指眼睛的浮尘根，当然也离不开眼睛的浮尘根。如果浮尘根完好，胜义根损坏了，眼识也不能产生，产生眼识必须要有完好的胜义根。</p><p>因为眼识是在后脑那个部位的胜义根产生出来的，胜义根完好时，阿赖耶识才能摄取外色尘，在那个位置变成内色尘。内色尘和眼根的胜义根相触，阿赖耶识才产生眼识。阿赖耶识产生出眼识之处的胜义根，也是由四大种子地水火风所构成，后脑勺那个地方是属于物质色法，物质色法都是由地水火风四大种子构成的。这个胜义根是净色根，是清净之色，它是无见有对的，无见，就是肉眼看不到，因为在后脑勺里面，大夫通过开刀手术能够看得见，或者有神通的人能看到，普通人的眼睛看不到。有对是与色尘相对应。</p><p>原文：<strong>意。谓眼识无间过去识。一切种子识。谓无始时来乐著戏论熏习为因。所生一切种子异熟识。</strong></p><p>释：眼识所依的非色法，就是眼识的等无间依自种子，和种子依阿赖耶识异熟识。等无间依就是说一个眼识种子一个眼识种子连续不断地生成灭去，相等无间地运行，后种子要依赖前种子开导其位，形成眼识种子的流注，出生眼识的分别性。一切种子依，是指眼识要依阿赖耶识异熟识来生出其眼识种子。含藏一切种子的阿赖耶识，无始劫以来，因为七识心乐着五阴三界世间的戏论熏习，以假为真，而造作了业行。</p><p>以此为因，阿赖耶识就存储了七识的业种，受了熏染，成为含藏生灭业种的阿赖耶识，成为了能够出生众生业果报的异熟识。所生一切种子异熟识，这是指第八识，也就是阿赖耶识。因为众生乐着戏论，把虚妄法当作真实，在三界世间里游戏，无始劫以来一直搞戏论法，把五阴当成真实的法，把世间当作真实，然后造作身语意业，业种就存入到第八识，依这个戏论为因，就形成了含藏生灭种子的阿赖耶识，这个阿赖耶识也就是眼识所依的非色法。</p><p>原文：<strong>彼所缘者。谓色。有见有对。此复多种。略说有三。谓显色。形色。表色。表色者。谓青黄赤白。光影明暗。云烟尘雾。及空一显色。形色者。谓长短方圆。粗细正不正高下色。表色者。谓取舍屈伸。行走坐卧。如是等色。</strong></p><p>释：眼识所缘，是色，缘于色法，和内色尘相对，与内色尘相接触。这个色尘是有见有对的，色尘与眼识相对，眼识能看得见，能够分别出来。色大略说包括三种，实际上是四种，这里简略的讲三种，一种是显色，一种是形色，一种是表色。其中还有一种是无表色，这里没有讲。显色是什么呢?显是能够显示得出来，能够看得见的，包括青、黄、赤、白的色彩，光、影、明、暗，都属于显色，云、烟、尘、雾也属于色尘，和眼识相对。</p><p>空一显色，就是虚空、空无，因为虚空是色边色，这种色边色也和眼识相对，是眼识所了别的对象。虚空不是真实有，但是眼识能看到什么也没有，是空无的，眼识能分别出来对面有没有色尘，有物之处是色，无物之处是空，所以眼识能分别出空无，这个空也就是一种显色。显色就是青、黄、赤、白，光、影、明、暗，云、烟、尘、雾以及空等等。</p><p>形色，形就是形状的形，这个形状就包括了大小、长短、方圆、粗细、高下、正和不正这些色法。譬如：一盆花的样貌和枝体的形态，花枝的形状；人体的高矮、胖瘦以及身体的各种姿态；物体的长短、方圆这些形状等等。这些形色就不是眼识所能分别的，眼识只能分别现量境，而形色是要通过分析比较思维才能判断出来的。没有绝对的高矮胖瘦长短，是通过比对而得出的结论。</p><p>比如一只铅笔，与一根木棍相比是短的，与一根火柴相比就是长的，没有比较，就不能定义铅笔是长还是短。那么这种能够做比较思维的就是意识心的体性，是意识心来进行分别推理判断的。因此了别形色的是意识心。形色是带质境的内色尘上所显现出来的法处所摄色，依带质境而有，属于法尘，因此是意识心所了别的对象。</p><p>表色，是集聚起来的色相，由于其生灭相续形成的一种假相，前一个色相生了又灭去，后一个色相在紧接着不同位置生了又灭去，无数个生灭的色相连续不断地集聚起来，就形成了色体的运转和活动。表面看是真实而连续的，实际上是断续而虚妄的。由于色相的因缘转换，所有的色相都不在同一个处所出生，而是在不同的相互连接的处所出生，就形成了色相的连续变化，众生见了就觉得色体是运动活动着的，其实不是。</p><p>这些色相连续地生灭运转，有时是没有间断性地运转，有时是间断性地运转，中间有停止的时候。这些色相运转的距离有近有远，色体的活动范围就有大有小。或者这些色相就在同一个处所不停地生灭相续运转，比如众生的坐卧、站立、睡眠，以及愤怒、高兴、忏愧、害羞等等这些面目表情。也包括各种物体在原处的生灭变化活动，如灯光的闪烁、阳光的照耀、植物的生长等等。</p><p>总之，表色就是有情众生肢体色身的各种动作，如取舍、屈伸、行住、坐卧。取着或者舍弃某些物品曰取舍，弯腰伸展四肢叫做屈伸，行来去止、起居坐卧叫做行走坐卧。无情物上也有表色，容后再讲。这些色都表达了有情显现于外的各种行为造作，他人能见，自己也能知，故称为表色。表色是假色，是依物质色法而显现出来的法处所摄色，在带质境的内色尘上所显现出来的法尘，眼识不能分别，是意识所分别的对象。</p><p>原文：<strong>又显色者。谓若色显了。眼识所行。形色者。谓若色积集。长短等分别相。表色者。谓即此积集色生灭相续。由变异因于先生处不复重生。转于异处或无间或有间或近或远差别生。或即于此处变异生。是名表色。</strong></p><p>释：下边进一步讲显色、形色和表色。什么叫显色？显色就是光明等所显现出来的差别色。一个是物体本身的明暗度不同，所显现出来的色彩就不同，就有了青黄赤白等色彩的差别相。一个是外面光明的明亮程度不同，就出现了光明和阴影、明和暗等等差别色相。青红赤白由于在不同光明度的照耀下，也会显示出不同的色彩差别。</p><p>由于地球等星体的自转和公转，星球上的各种物体以及虚空被太阳光线照射的范围程度就不同，其明亮度就不同，物体和虚空就会产生各种不同的亮度，或者非常明亮，或者比较暗淡，或者是漆黑一片。所以光明也是有差别的。黑暗也有差别，有特别漆黑，有微黑等不同暗色，这些差别也是由于投射过来的光线不同的缘故而产生的。暗相有许多差别，光明本身也有许多色彩的差别，物体色彩有差别，我们所见的这些显色都有差别，所以显色就是一种明亮的差别性，是眼识所了别的尘相。</p><p>形色，就是长短等积集差别，色体上显现出来它有多长、多短、多方、多圆，这些长短方圆的差别相就叫作形色，属于法处所摄色，是意识心所了别。</p><p>表色，是业用为依转动差别。就是由于某种业缘，众生色身为适应生存的需要而产生的各种运转和活动，这些运动和活动由于各种色相的生灭相续而产生了色相的变化，或者是空间位置的相续变化，这些运动的，能够运转的，依靠着各种业缘所产生的各种差别色相就叫表色。比如手、手指头、胳膊、腿、头、眼睛的运转性、变化性就叫作表色。</p><p>原文：<strong>如是一切显色形色表色是眼所行眼境界。眼识所行眼识境界眼识所缘。意识所行意识境界意识所缘。名之差别。</strong></p><p>释：如是一切显色、形色、表色，是眼识所行的眼识境界，也是意识所行的意识境界。我们在分别色尘的时候，是眼识和意识两个识心同时来分别，眼识不能单独分别色法，意识也不能单独分别色法，必须是二者和合共同分别色法。眼识分别粗略的显色，意识分别细微的法处所摄色，就是形色、表色和无表色。两个识必须相依共存，眼识不能单独运行，不能单独分别色尘，必须依靠着意识心。意识心依靠着眼识才能分别色尘上所显现的法尘。意识心不能单独分别色尘上显示的法尘，必须依靠着眼识才能完成分别。</p><p>意识能够单独分别的，不是色尘上的法尘，不是五尘上的法尘，分别的是独影境。祂能单独分别梦、定中的法尘，不依赖五尘而有的法尘，包括散乱心所缘的法尘。这时的意识心叫做散位独头意识、梦中独头意识和定中独头意识，所了别的法尘与五尘上显现的法尘有所不同。眼识要想分别色尘，一定有意识，共同的来分别、运转，眼识不能单独的自己来分别色尘，不能单独的看一本书，不能单独的看阳光、看黑暗、看虚空，不能单独运作。眼识要运作，一定有意识来配合，二者和合运作来完成见色的功能作用。</p><p>原文：<strong>又即此色。复有三种。谓若好显色。若恶显色。若俱异显色。似色显现。</strong></p><p>释：显色分为三种，好的显色、不好的显色、不好不坏的显色。还有具有与显色不同性质的，依显色而存在的类似于色的法处所摄色，如形色、表色、无表色，这些色也分为好、恶和不好不恶。眼识所对应的色尘也分好、坏和不好不坏三种，好、坏、不好不坏的色尘是以意识心为主所分别出来，所能感受到的。眼识也能分别和感受到显色的好坏和不好不坏，比如说太阳光突然照射过来，非常刺眼，眼识马上就感知到，并且会迅速地躲避，这是眼识分别的。具体到光线有多么刺眼，多么明亮，多么幽暗，多么柔和，那就是意识心通过比较和想象或者是现量所分别和感受的。</p><p>意识会知道色尘好和不好，眼识也知道，眼识分别的比较粗劣，比较浅显，比较直接，只分别现量境。意识得通过思唯分析比对想象来进行了别，有比量和非量，有时候也是现量了别。了别光色，外面的色尘到底是好还是不好，通过比较、通过思唯来得出的结论，那是意识心所做的事，眼识当下就知道，马上就躲避，或者马上就接受，并且会多看一会，生起贪心所。</p><p>原文：<strong>彼助伴者。谓彼具有相应诸心所有法。所谓作意。触。受。想。思。及余眼识俱有相应诸心所法。</strong></p><p>释：下面讲眼识的助伴，什么叫助伴呢？就是与眼识同时生起，助于和伴随眼识运行的心所法，帮助眼识生起和产生分别功能作用的心所法，叫作助伴。这些助伴是什么呢？就是五遍行心所法，眼识有自己的心所法，叫做作意、触、受、想、思。眼识只要现起运行，就要用这些心所法，依赖这些心所法，才能够运行。比如说作意，眼识得把识心注意力引到色尘境界上来，特别注意这个色尘，专注于这个色尘，这个叫作意。作意了以后，眼识一定会和这色尘相接触，眼识要触色尘。色尘是在后脑部位生起的内色尘，不是外界实质的物质色尘，眼识只能触内色尘。</p><p>触了以后，眼识本身会生起各种感受，苦、乐、不苦不乐三受。比如触了太阳光，眼识马上觉得刺眼，就会躲避开，或者遮住眼睛或者闭上眼睛，这就是苦受。受了以后，会产生想心所，眼识的想心所就是了别、取善恶相或者不善不恶相。眼识知道这是光色，而且是刺眼的太阳光色，它就了别了这个色尘相。然后生起思心所，思是决定和造作，决定是什么？决定是要躲开这强烈的太阳光，行为造作就是会马上闭眼或者马上躲避遮挡。如果是喜欢的色尘，眼识的五遍行心所法，会连续不断地出生运作，直到了别完成，对于色尘很清楚很满足为止。所以眼识心生起来时，必须依靠着这些个心所法来运作，就是作意、触、受、想、思。</p><p>眼识的心所法，除了五遍行作意、触、受、想、思之外，还有其它与眼识相应的心所法，比如五别境，善十一，贪嗔痴烦恼以及随烦恼等等这些心所法。</p><p>原文：<strong>又彼诸法同一所缘。非一行相。俱有相应一一而转。</strong></p><p>释：这些心所法，同一所缘，都同样缘于一种色尘相，缘于同样的色尘而运转。比如眼识要缘太阳光，五遍行心所都缘于太阳光，作意于太阳光、触于太阳光、于太阳光生受生想，缘于太阳光起思心所，生起业行。眼识要缘桌椅板凳，五遍行心所都</p><p>会缘于桌椅板凳，不会各缘各的色相。同一所缘，缘同一色相，非一行相。虽然五心所法所缘一色，但是各有各的运行行相，互不相同，比如作意是一种运行行相，触是一种运行行相，受是一种运行行相，想是一种运行行相，思是一种运行行相。它们运行的行相不一样，但是所缘的都是同样的一种色尘。俱有相应一一而转，五心所法共同聚在一起，一一运行，互相照应。所以眼识的心所法，所缘的色尘肯定是同样的，它们的运行行相却是不同的，这样心所法共同和合运转，眼识才能产生一连串的分别的功能作用。</p><p>原文：<strong>又彼一切。各各从自种子而生。</strong></p><p>释：又彼一切各各从自种子而生。这一切的心所法都从眼识的识种子而生，从自种子生。自种子就是眼识的种子，都是从眼识的种子而产生这些心所法，随着眼识而生，随着眼识而有。当阿赖耶识输出眼识种子，产生出眼识的时候，五遍行心所法也就随着出生了。作意心所首先现行运作，在种子位对于色尘就警觉起来了，之后就会触色尘，再以后就有受、想、思的心所一个接着一个地运行起来，都是对于眼前的同一个色尘来运作，就是对后脑部分的内色尘的运作。</p><p>眼识的运作，对于色尘的了别，一定要依靠着这些心所法才能运作。那我们就能知道，阿赖耶识的运作是依靠着什么来运行的，祂也是依靠着第八识的五遍行心所法：作意、触、受、想、思，这样阿赖耶识才能运作，就会产生一切法，变现一切法出来。其它几个识都是这样依靠着心所法来运行，来了别。</p><p>原文：<strong>彼作业者。当知有六种。谓唯了别自境所缘是名初业。唯了别自相。唯了别现在。唯一刹那了别。</strong></p><p>释：那么眼识的五遍行心所法的作业是什么，都能作些什么事业呢？眼识的心所法其业用有六种，能作六种事业。第一种，唯了别自境所缘是名初业，眼识心所法只能了别与自己相对应的境界，就是色尘境界，不能去了别声音，不能了别香尘，不能了别触尘，只能了别色尘，而且只能分别胜义根处的内色尘。这是对没有修到六根互通的众生而言，已经修出六根互用互通的众生除外。了别自境所缘，是名初业，这是第一种。</p><p>第二种唯了别自相，意思是说，作意有作意的业用，只起警心的作用，只起引心向境的作用，不能去触，不能生受和想，不能去思造作业行，总之就是各个心所不能超越自身的界限。第三种唯了别现在，就是说眼识是现量，能了别当前现量境界，不了别过去了的色尘，也不了别将来的还没有出现的色尘。五遍行心所只缘当下色境，唯了别现在，现在当下看到什么就是什么，眼识不用作分析，不用作推理判断，不用去比量比较，也不会生起想象思维。</p><p>第四种，唯一刹那了别，因为识种是刹那生灭的，在同一位置，一个识种生了，又灭去，就了别了这一刹那，回到阿赖耶识里。下一个识种生了又灭去，了别了第二刹那的色尘，又回到阿赖耶识里，后来的识种子依序都是如此，刹那了别，了别当下的刹那，所有的刹那了别都连续起来，形成了连续不断的眼识的分别识别性，众生就会觉得自己是一直在见色，觉得这个功能非常真实可靠，这就是我和我所拥有的功能作用，属于我所有，于是就执著这个见色的功能作用，不能舍弃，这样就会生死不断，苦恼不断，所以众生实为愚痴可悯。</p><p>原文：<strong>复有二业。谓随意识转。随善染转。随发业转。又复能取爱非爱果。是第六业。</strong></p><p>释：这其中随意识转又分为二种，一是随善染转，二是随发业转。随意识转，就是随着意识一起了别色尘境界，生起各种心行，眼识不能单独了别和起心行。眼识依止于意识，随于善染业缘而流转，随着善缘，就作善分别，造善业。祂有善心所，就有相对的不善心所。随着恶缘染缘，就作染污的不善的分别，也能作不善不恶的无记性分别，因为祂有善恶无记三性。眼识有喜欢看的色，有不喜欢看的色，有时也表现为对于色尘没有喜厌的舍性。对于喜欢的色，会生起贪心所，造作贪业，对于不喜欢的色，会生起厌恶，造作恶业，也会造作不善不恶的业行。</p><p>当太阳光太明亮刺眼时，眼识不喜欢看，就会躲避开。对于柔和的色彩比较喜欢，就会多看几眼，有时就随缘看也行，不看也行，所以眼识有心行，有善恶心行，还有不善不恶的心行。随善染转，就是随着善业和恶业的种子缘来运转，善缘种子现前，就做善分别，心行就清静；恶缘种子现前，就做恶分别，心行就染污。</p><p>再一个眼识随发业转，什么叫做发业呢？就是说眼识的缘已经具足现起来了，由意根作意于色尘，思量决定要了别于色尘，那么阿赖耶识了知意根的心行，依据业种业缘就变现出色尘和色尘上的法尘出来，眼识现起的九缘具足了，于是阿赖耶识就会出生眼识，眼识就会依意根的指令，作意于色尘，触色尘，领纳领受色尘，就了别了色尘，继而生起思心所，决定取舍。这样眼识不断地作意，不断地触，不断地受，不断地了别，直到确定了色尘无误、看够为止。当眼识具足了业缘，眼识就必须去触色，继而眼识的行阴就产生出来了。贪嗔痴业种现前时，眼识一定要去作意于色，触于色，不断地觉受和了别于色，生起各种心行，以满足自己的贪嗔痴心行。</p><p>外面的很多色尘，本来不看也可以，不知道也可以，因为业障的关系，意根没有被降伏，攀缘就不断。眼识本身的攀缘作意也就会不断现起，不断地对各种有用和无用的色尘生起作意和触，行阴就会不断地运行不灭。眼识见色以后，意识心再生出各种心行，生出那些善恶无记的心行，导致意识思维分别不断，心就不得寂止，这一切都会作为业种又存入阿赖耶识里，将来生死业缘就不断。</p><p>眼识的产生就这样随业而转，业种现起，业缘现起，眼识就必须产生。所以有时候，明明这个东西不应该去看，可是因为业缘的原故，就是要想看，明知道不该看，还是要去看的，这叫随发业转。眼识现起的业缘成熟，九个条件都具足时，眼识必然会生起，五遍行心所就开始运行，眼识就了别了色尘。有时我们一睁眼，不管喜欢不喜欢见色，眼前的一切色都会看到，不管远近，尽收眼底。</p><p>第六种，眼识能取爱非爱果。取就是执取，爱就是喜欢，果就是色尘，就是识别的对象。贪求和厌离弃舍，这两个对立的方面都是取的意思，误以为色尘为实有的，才会作取舍分别。喜欢的色尘就贪取、多看，有时还看不够，不知止足。不喜欢的色尘，就想躲避、舍弃、马上离开，不想再生起作意趣向于这个色尘了，于是思心所决定不再看了。取和舍都划归于取，隔离、躲避或者主动的想要，这都叫执取。这样就执取了喜爱和不喜爱的色尘，喜欢的色尘，眼识了别的时间长一些，心所不断重复轮流现起；不喜欢的色尘就想躲避，这叫取着爱非爱果，所以眼识心所法有这六种性质。</p></div>"
},{
    "title": "关于四种色的补充论述",
    "author": "生如法师",
    "date": "2022年08月14日",
    "html": "<div class=\"B1_text\"><p><strong>关于四种色的补充论述</strong></p><p> <span>一、无表色是五尘上所能显现出来的一种法处所摄色，有别于显色、形色、表色，是意识心了别的对象。意识心需要根据显色、形色、表色来进一步地进行分析、比较、思维、判断，经过现量、比量、非量的了别，然后得出一个总体性的结论。比如一枝花，它的无表色，就是花的美丽性、富贵性、淡雅性、芬芳性、优雅性、繁茂、凋零、枯萎等等，花的这些性质叫无表色。显色是花的色彩，形色是花朵的形状大小，枝叶的形状，枝干的粗细，表色是花朵枝叶的摇动形态或者静止状态。</span></p><p>比如说人的无表色，对面一个人，通过看他的着装打扮、行走坐卧、言谈语笑，就能感觉到这个人的年龄、性别、气质、风度、学识、修养、性格、脾气、秉性，这些都叫无表色。这些色不是表面能直接出来，不是眼识当下就能现量了别的。是意识心通过思惟、分析、想象、判断才能了别出来的，多数用比量、非量来进行了别，这个法处所摄色就叫作无表色。</p><p>比如一匹布上它所显现的柔软性、棉性、保暖性，这些性质叫作无表色。每一种物品的性质都叫作无表色，比如说我们听一个人的声音，从声音上就有无表色，意识心会分别，会思惟，这声音听起来挺柔和，那个声音听起来挺粗暴，听这个声音，觉得这个人有学识，有修养，通过分析比较想象思维判别出来的这些性质就叫作无表色。比如树的无表色是树木的年轮、品种、古老、幼小、繁茂、枯萎、挺拔等等，都是意识通过分析推断出来的。</p><p>二、四种色的区别和生成次第</p><p>除了青黄赤白，光影、明暗、云烟尘雾，以及虚空这些显色是眼识所识别的，其它的都是意识心所识别的。显色是阿赖耶识直接把外色尘的四大种子形成的微粒摄受过来，通过眼根的浮尘根，摄受过来后传导到后脑的胜义根，变现出相似的内色尘。然后在形成的内色尘上，会显现内色尘的长短方圆的形状。</p><p>这个长短方圆的形状，必须是意识心通过比较、分析，才能了别判断出来的，这叫作形色。形色不是实质的物质，而是依于在胜义根形成的显色上，在这个四大组成的带质境的影像基础上，阿赖耶识经过重新组合，就形成了法处所摄色，那是意识心所分别的。这个分别要迟于眼识对于显色的分别，因为内色尘的显色会先被变现出来，眼识就要先出生，然后才是形色的显现，于是才有意识的出生。所以见色的第一刹那一定是眼识先见色尘的青黄赤白，第二刹那才能了别长短方圆以及运动或者是静止状态的各种形态姿态，最后才能了别出色相的内涵和实质意义。</p><p>表色就是物体的运动和静止的状态，比如众生身体的行走住卧，迎来送往，屈伸俯仰。这个色是在后脑胜义根上所形成的内色尘上所显现出来的法尘，是四大组成的显色经过再次组合形成的，次于显色而显现出来，是意识心了别的内容。所以见色了别时，一定是眼识先出生了别，次意识出生了别，再二者同时了别。因为显色和表色出现的次序有先后，根触尘就有先后，对应的识出现就有先后，了别就有先后。</p><p>总结起来说，必须先有实质的四大种子形成的实质的色体存在，就是显色先存在，虽然这个显色就是外界色尘的影像，也是阿赖耶识直接摄取四大所变。之后在所变的影像上再次重组，就形成了法尘，其中长短、方圆、高矮、粗细、邪正，就叫作形色。表色就是运动状态、静止状态、肢体形态，比如色身的行走住卧、弯腰、坐着、站立、躺卧，这个叫表色。无情的物体上也有表色，比如一枝花或者一盆花的千姿百态，或者是树的树干枝叶的姿态，风吹过来，树枝摇动，就属于表色。都是意识心通过比较、分析、思惟、推测，才能知道的，眼识不能了别。</p><p>这个色尘和色尘上显现出来的法尘，两者是有本质区别的。色尘是阿赖耶识直接摄取外界的色尘上的地、水、火、风在胜义根直接变现形成的内相分影像，法尘是在这内相分的影像基础上再变现组合一次，形成了法处所摄色，叫做法尘，是二次变现。法尘依着色尘地水火风而有而生出来的，是意识心所分别的，眼识就没有办法了别。</p><p>既然色尘和法尘紧密相连，那么眼见色时，眼识和意识就会互相依赖，都不能单独了别色尘。一定是眼识先了别到色体的颜色，或者叫作光明黑暗，尘烟雾绕，以及色边色的空，这是眼识分别的。然后意识随着马上了别。先看到本质的色，后看到在本质的色上显现出的法尘，所以意识心在眼识后边了别，二者互相依赖而共同来分别色尘。</p><p>同样的道理，前五识都是和意识同时分别，一定是五识先分别色声香味触，然后意识再分别色声香味触上面的法尘，再以后就同时分别了。意识是后分别的，与先分别的五识只间隔一个刹那，就非常快速地连接起来了。我们心不细致根本就感觉不出来，觉得好象是眼识意识同时分别，耳识意识同时分别，其实是有个前后顺序的。三个刹那以后就没有间隔了，第一个眼识种子生出来了别，第二个是意识种子生出来了别，第三个眼识意识种子都同时生出来了别，再以后都是眼识意识种子同时生出来。</p><p>第一个肯定是眼识先出来，耳识先出来的，鼻识、舌识，身识先出来的，都是意识在后边。都出来以后，五识和意识种子再同时生出来，同时分别。那么前五识就了别实质的四大组成的物质，了别显色，意识了别在实质的四大物质上所显现出来的法尘——法处所摄色，就是形色、表色、无表色，与前面的色声香味触那些色尘，有本质上的差别。</p></div>"
},{
    "title": "瑜伽师地论第十四卷",
    "author": "生如法师",
    "date": "2022年08月14日",
    "html": "<div class=\"B1_text\"><p><strong>瑜伽师地论第十四卷</strong></p><p> 原文：<strong>又有三种诸烦恼趣。令诸有情流转生死。谓于胜欲。发意悕求。名初烦恼趣。于色无色界胜自体中。发意悕求。名第二烦恼趣。于邪解脱。发意悕求。名第三烦恼趣。</strong></p><p>释：又有三种趣向于烦恼的修行方式，让有请众生流转生死。第一种是众生因为有善法欲，被善法欲所系缚，也不能出离三界，必在三界中生生世世追求佛法，直至成佛，这是发大心的菩萨的善法欲。因为不出三界，就有三界当中的苦恼，有些微苦受，这就是第一烦恼趣。</p><p>第二种是众生对于色界和无色界的殊胜果报，起心希求，就被系缚在生死中，不得解脱。色界和无色界的众生，自身超胜于欲界众生，有殊胜的果报。但是众生因为希求色界和无色界的殊胜果报，希求色界和无色界的禅定，希求色界和无色界的福德享受，就被色界和无色界的果报所系缚，不能出离三界，就有三界生死苦。这就是众生第二烦恼趣求。</p><p>第三种是众生于邪解脱起心趣求，而由于知见和修行方法错误和不如理，不但得不到解脱，而且在生死的深渊里越陷越深。有解脱欲望，但是没有遇到真正的解脱法，遇见了外道法，修行了外道，想要以不如理的外道法求得解脱，结果就被外道的邪见所系缚，不得解脱。这是第三种烦恼趣向。</p><p>无论对于正法的希求，还是对于邪法的希求，最终的希求就是由意根发起的，最初是由意识通过接触这两种法而发起，逐渐影响到意根，就开始精进修学正法和邪法，才能最终得解脱和陷入更深的生死系缚当中。</p><p>原文：<strong>又有三种诸有情类。欲为根本作业方便。一为得胜欲。二为得胜自体。三为证胜解脱道。</strong></p><p>释：又有三种众生，以欲求为根本出发点，而采取各种方法来修行，想要达到解脱的目的。第一种欲望是，众生修行是为了得到最殊胜的果报，为了证得大乘菩萨果和成就佛道，这是最极殊胜，无有可比的，叫作无上法，果报是无上果。</p><p>第二种欲望是，众生修行是为了得到更殊胜的五欲乐和更大的福报，结果可能就会生天享福，福尽还堕。色身果报，获得天人的色身和生存境界，结果也是生死系缚。</p><p>第三种欲望是，众生通过修行，最终想要获得出离三界的殊胜解脱果报，结果就能出离三界，得到暂时的解脱，不能成就佛的究竟解脱。</p><p>欲为生死因，而对大乘成佛法的追求，能导致不入无余涅槃，永远在三界中广利有情。六识有欲，意根更有欲，主要因为意根的欲，生死才不断，轮回才不息。如果仅仅六识有欲，意根没有欲，六识的欲也不起作用，刚刚生起就会灭去，生死也必了。如果仅仅是六识断欲，意根不断欲，意根必作主有欲求，六识必造贪欲业，生死必不能了，轮回必不息。意根对三界有欲求，必不能断除对三界的贪爱，必不能出离三界。</p><p>阿罗汉因为断除意根的我执，就断除了对三界的贪爱，也就是断除了对三界的欲求，才能出离三界，入无余涅槃。如果回心于大乘的阿罗汉，因为对大乘法生起爱乐心，对大乘法有欲求，意根被此欲求所系缚，命终必不入无余涅槃，必有欲界色身五蕴而继续修学大乘法，以求明心见性和成佛，这就是通教菩萨的善法欲。如果仅仅是意识有善法欲，意根没有，那么意根不被善法欲所系缚，对三界法无欲无求，命终必取无余涅槃。</p><p>意根如果已断饮食欲，意识即使对欲界美食，多作意多看两眼，意根也不会生起贪欲，也不会想要贪吃美食，只是随缘。意根如果已断除男女欲，意识即使对异性多看两眼，也不会有后续的心行，因为意根作主不攀缘，不贪欲，意识就不能有多余的心思和欲求。</p><p>意根如果已断贪欲，对吃穿住用都不贪求，意识即使遇见豪华奢侈的生活环境，也不生贪，其吃穿住用也仍然要沿袭从前的习性，这是意根的习性，吃穿住用的身口意行由意根作主，必符合意根的习性。</p><p>想要成佛，就是胜欲；想要明心见性，就是胜欲；想要断我见，证解脱果，就是胜欲。如果仅仅是意识有此胜欲，意根没有，那么意根不会作主精进修行，不会主动修行三无漏学，不会主动持戒，不会主动修定，不会主动读经思惟，更不会起心观行和参究法义，同样不会朝斯暮斯，念念在修行上。意根有胜欲，才能主动促使六识修行，让意识念念都在学佛修行上，能让意识想办法排除一切干扰和障碍，精进修行。</p><p>学佛以后，意识降伏了对肉食的贪欲，知道吃肉与众生结恶缘，有因果，但是意根没有降伏对肉食的贪欲，当遇到肉食时，意识就知道不能吃，意根有点想吃，意识就劝导意根说，不能吃肉，应该吃素，意根就暂时忍着。可是一会意识不劝导时，一不注意，意根就决定吃一口以解馋，于是就吃了一口肉。意识随顺了意根，放松了警惕，意根就决定再吃一口。如果意识不谴责意根，意根就会放纵自己，不断的吃起来，最后意识就控制不住意根，索性就吃吧，反正已经吃了。戒烟失败，也是此理，戒赌、戒毒失败，都是此理，意识实在管不住意根了，意根的习惯远远大于意识的理智，于是意识只好随从了意根。</p><p>所以只有意识修行，意识断烦恼，意根不断烦恼，就不是真正的断烦恼。意识断我见，意根不断我见，也不是真正的断我见，意识明理，意根不明理，不是真正的明理。没有一条腿能走路的，意识意根两条腿必须同步，或者一前一后跟着，才能走好路。心向善的人，几乎每个人都有意识引导劝导意根的经历，因为意根不能思惟，不知好恶，就要多麻烦意识做工作，多开导意根向善，然后身口意行才能善。意根的作主性决定权，只此一点，就表明了意根的强大功能作用。</p><p>从种种事例来看，意根没有希求，没有欲，一切法都不成立，都要消失，必在无余涅槃中。</p><p>原文：<strong>复有三种从因所生有漏法因。若于此中。不如正理修方便者。能生诸苦。若能如理修方便者。于苦于因。能知能断。谓于欲界系法。染污希求。于色无色界系法亦尔。</strong></p><p>释：还有三种从因而产生了有漏法的因，以至于不能修成无漏。这三种因就是：一、对于欲界能系缚自心不得解脱的法，而有染污意，起心希求，贪着欲界法，不能脱离。二、对于色界能系缚自心不得解脱的法，而有染污意，起心希求，贪着色界，不能脱离。三、对于无色界能系缚自心不得解脱的法，心起希求，贪着不舍，不得解脱。</p><p>这三种能生有漏法的因，如果在修行中不能如理的观察其过患，没有相应的方法去对治，最后就能产生苦恼和生死过患；如果在修行过程中，能如理观察其过患，有相应的方便方法去对治，远离对三界的希求和欲求，了知三界的苦因，就能断除苦恼和生死过患。</p><p>三界世俗法表面看都是系缚六识的，实际上最主要是系缚意根的，是意根执著于三界法，五阴才能在三界中出生和生存，在三界中生死轮回。如果意根不贪着三界法，六识的贪就不起作用，况且六识是断灭法，在投生之时已经灭掉。</p><p>由于意根的贪执，业种存入如来藏中，来世必依意根的贪执和业种的缘故而投生到三界中，意根贪执欲界，就被欲界所系缚；意根贪执色界，就被色界所系缚；意根贪执无色界，就被无色界所系缚。 如果意根既贪执欲界，也贪执色界和无色界，那么不可能出生到色界和无色界中去，必被最低层次的贪执所系缚。</p><p>那么在欲界中，要想断欲，就不能仅仅是意识表面的断欲，必须是内心深处的意根也要断欲，否则必不能有初禅定，也不能脱离欲界而生到色界和无色界。对色界和无色界的贪执，也是同理。</p></div>"
},{
    "title": "瑜伽师地论第十八卷",
    "author": "生如法师",
    "date": "2022年08月14日",
    "html": "<div class=\"B1_text\"><p><strong>瑜伽师地论第十八卷</strong></p><p> 原文：<strong>云何无攀无住。所谓诸爱永尽离欲。寂灭涅槃。及灭尽定。所以者何。所言攀者。诸烦恼缠。所言住者。烦恼随眠。于彼处所二种俱无。是故说言无攀无住。此谓涅槃无攀无住。又想名攀，受名为住，若于是处二种俱无。即说彼处无攀无住。如是显示灭想受定无攀无住。今此义中意取灭定。</strong></p><p>释：什么叫作不攀缘也不住着？那就是一切贪爱永远断尽，离开对三界世间的任何欲望，心得寂灭，进入涅槃境界，或者是证得灭尽定。为什么这样说呢？因为攀缘的意思就是心被诸烦恼所缠缚，不被烦恼所缠缚的人，心就不攀缘诸法；住着的意思就是心里有烦恼随眠，所以心才住法。如果断尽了烦恼和烦恼随眠，就说是不攀缘也不住着了。这就是涅槃不攀缘不住着的意思。像这样显示灭受想定里的不攀缘不住着的境界相，就说明了此人取证了灭尽定。</p><p>意根灭除受和想两个心所，就是灭尽定。受是住法之义，接受法境，即名为住。想是攀缘之义，了知、执取，即为攀缘。攀，烦恼缠缚之义，意根断除烦恼，即不攀；断除烦恼，叫作诸爱永尽，诸爱永尽，即是离欲。意根离欲，即诸爱永尽，不再攀缘。意根离欲，无攀缘无住着，即入无余涅槃。众生不在无余涅槃里，说明意根有攀缘，有爱有欲有住，受法想法，烦恼缠缚，心不寂静。</p><p>这里的思惟逻辑多么严谨，无懈可击。弥勒菩萨明确表明：众生意根有欲有爱，即有攀缘和住着，就不能证得灭尽定，也不能进入涅槃境界，得解脱；如果众生的意根离欲离爱，即能取证灭尽定，也能取证涅槃，即名得解脱。</p><p>离欲，离开对三界世间法的所有贪爱，就能离开三界；离嗔，断除嗔恚的现行烦恼，不仅要断除意识的嗔，更应该断除意根的嗔。由于意根有嗔，才指挥六识造作恶业行。比如意识无缘无故莫名其妙的生气，就是由意根的嗔所引起。意识遇事告诉自己不要生气，不能生气，可就是控制不住的生气，说明意根不听意识指挥，非要生气不可。当意根断除嗔恚心所，不再指挥六识造作恶业行，不再与众生冤冤相报，根深蒂固的嗔结就断了。</p><p>弥勒菩萨说贪嗔痴是众生坚固的烦恼，坚固的意思就是难于断除拔出，烦恼非常深。这就不仅仅指意识的贪嗔痴了，而主要是指意根的贪嗔痴，意识的贪嗔痴容易降伏和断除，意识聪明智慧，学佛就能转；意根不聪明，不容易懂法理解法，不能思惟，所以难以转变，贪嗔痴烦恼根深蒂固，比较坚固。</p><p>意根不降伏，只降伏意识，那么意根指挥意识，意根指哪里，意识就得打哪里，还是要受意根的贪嗔痴无明所系缚。意识断嗔，意根没有断，意根的嗔一起，让杀人，意识就得莫名其妙的无可奈何的去杀人，心里战战兢兢的，一边杀，一边想，不应该这样做，可是又能有什么办法呢？</p><p>所谓冲动型的犯罪，就是意根完全主导的，意识甚至来不及思惟，就被意根牵引了，过后意识再思惟，才开始后悔闯下大祸了。</p><p>意根知道自己与某人过去世有过结，所以仇恨某人，可是意识知道此人对自己有用有好处，就劝告意根，遇见某人时，一定要忍耐巴结讨好于他，可是见到某人时，一边巴结讨好，一边心生厌恶，恨不得打死他。这是意根勉强听从了意识的劝告，意识稍一放松警惕，意根就得发作，指挥六识造作嗔恚行，以报复某人。</p></div>"
},{
    "title": "第六十三卷　摄决择分中三摩呬多地之二",
    "author": "生如法师",
    "date": "2022年08月14日",
    "html": "<div class=\"B1_text\"><p><strong>第六十三卷　摄决择分中三摩呬多地之二</strong></p><p>原文：<strong>复</strong><strong>有五种定相违法。一毁犯禁戒。二无无间加行。三无殷重加行。四有沉没。五他所扰恼。</strong></p><p>释：弥勒菩萨在这里讲了五种与禅定相违的障缘。第一种就是不遵守戒律，违犯了戒律，使得内心浑浊不清静，禅定不得现前。</p><p>第二种就是所作的修定的功夫，不能连续下来，不能持久，修修停停，犹如烧水，烧一段时间就停火，水永远烧不开一样，禅定无法成就。</p><p>第三种修定时，心不猛力，没有坚定的信念和强大的决心，随顺自己内心的散乱，随着妄念流散，而不猛烈呵责自心，以至于禅定无法成就。</p><p>第四种就是心总是处于昏沉状态，不清明，没有念性，无法集中精力，因此禅定无法成就。</p><p>第五种就是有外缘相绕恼，外缘侵心，使得内心无法平静，心水浑浊，禅定无法成就。</p><p>原文：<strong>复有三种远离。一住处远离。二见远离。三闻远离。</strong></p><p>释：修行要想清静得定得止，就要选择清静之处而住，远离溃闹，心不被外缘所牵，能渐止息下来。修定要想心得寂静，就要少接触外缘，少见六尘，少闻六尘，减少见闻觉知，才能得到寂静。</p><p>复次心清净行苾刍。略有五种等持相违厚重过失。能为定障。</p><p>原文：<strong>复有五种定相违法。一毁犯禁戒。二无无间加行。三无殷重加行。四有沉没。五他所扰恼。</strong></p><p>释：弥勒菩萨在这里讲了五种与禅定相违的障缘，出现这五种情况就不能生起禅定，或者是要失去禅定。</p><p>第一种，不遵守戒律，违犯了戒律，使得内心浑浊不清静，禅定不得现前。戒律包括五戒、八戒、比丘戒、比丘尼戒、沙弥戒、沙弥尼戒、六重二十八轻戒和十重四十八轻戒。</p><p>第二种，所作的修定功夫不能连续下来，不能持久，修修停停，不能形成无间断的加行。犹如烧水，烧一段时间就停火，水永远烧不开一样，断断续续修行，禅定无法成就。</p><p>第三种，修定到一定程度时，应该加大力度，促使禅定迅速成就。而这时却心不猛力，没有坚定的信念和强大的决心，随顺自己内心的散乱，随着妄念流散，而不猛烈呵责自心，以至于禅定无法成就。</p><p>第四种，心总是处于昏沉状态，内心不清明，没有念性，无法集中精力，因此禅定无法成就。</p><p>第五种，有外缘相扰恼，外缘侵心，而不能排除干扰，使得内心无法平静，心水浑浊，禅定无法成就。</p><p>原文：<strong>复有三种远离。一住处远离。二见远离。三闻远离。</strong></p><p>释：修行要想清静得定得止，就要选择清静之处而住，远离溃闹，心不被外缘所牵，能渐止息下来。修定要想心得寂静，就要少接触外缘，远离喧嚣之地，少见六尘，少闻六尘，减少见闻觉知，才能得到寂静。</p><p>原文：<strong>复次心清净行苾刍。略有五种等持相违厚重过失。能为定障。一忿。二慢。三欲贪。四萨迦耶见。五不能堪忍。</strong></p><p>释：想要修行清静心行的比丘，大略有五种与禅定相违背的严重过失，能成为获得禅定的障碍。厚重的意思就是很严重，对于禅定的遮障很重。</p><p>第一种是忿。忿是愤怒忿恨，情绪严重不平静，心水扰动，心不平稳不清静，因此不能发起禅定。</p><p>第二种是慢，慢是自心高举凌下于他，是一种深层次的情绪化，也是心不平的表现。只要心有所不平，就是纷扰，就是散乱，因此能障碍禅定的生起。</p><p>第三种是欲贪，也就是贪欲。广泛来说是指对世间一切法的贪爱，对六尘境界的贪爱，对色声香味触的贪爱，因贪爱而被境界所系缚，心粘着于境界，就是散乱，无法专一，因此障碍禅定。欲贪侠义来说，是指欲界众生的男女欲心，包括身行上的贪欲，和心行心念上的贪欲。不管是身行还是心行，心都是不清静的，被欲念所系缚，心散乱，不能专一于道业，不能专一一心。因此欲贪能障碍禅定。</p><p>第四种是萨迦耶见，也就是我见。因有我见，必执五受阴，必执十八界，必执身心，不能放舍一切法，心不清静，因此而障碍禅定。</p><p>第五种是不能堪忍，堪是承受，忍是忍耐。对于逆于己心的六尘境界心里有抗拒的情绪，不能承受，于是心不平静，内心有所躁动，无法获得禅定；对于顺己的六尘境界，不能忍耐，欢喜躁动，心不平静，障碍禅定。</p><p>原文：<strong>有五厚重三摩地相。由彼于此障碍而住。是故说名厚重过失。云何五相。一者获得随宜资具便生喜足。二者好乐求诸善法。三于身财无所顾恋。四于生死及与涅槃见大过失最胜功德。五于加行堪忍勤苦。</strong></p><p>释：有五种比较厚重深沉的三摩地禅定相，一，比丘获得简单的生活资具心里就感到喜乐满足，不贪求过多更好，因此心清净，有禅定。二，乐于寻求善法，此心容易获得三摩地。三，对于自身财产没有贪恋，心能放舍，就容易入三摩地。四，对于生死能见到极大的过失，对于涅槃能见到最殊胜的功德，因此容易获得三摩地。五，对于修道的加行过程中，能堪于忍受精勤之苦。</p><p>但是如果比丘于此五种禅定相生起障碍心，就不能获得三摩地，因此说这些障碍心有厚重的过失。</p><p>原文：<strong>此中忿者。谓怀忿故。若往他家不得利养或得而少。或弊或迟或不恭敬。由此便生颦戚愤憾。从此因缘。发恚寻思及害寻思多随寻伺。彼由此故先所未生胜三摩地不能得生。设彼已生还复退失。</strong></p><p>释：这里说比丘乞食时，由于心不清静，在得到不如意的饮食时，心里便不高兴，眉头紧锁，面色不佳，心怀气愤。因此缘故，心境不平静，生起气愤之思想念头，生起为害的思想念头。这些念头就缠绕于内心，于是内心不能清静，那么原来所没有修出来的殊胜的禅定境界，就不能修出来了。即使已经修出来的禅定，也会退失掉。</p><p>嗔恚心重的人，爱生气的人，爱搞是非的人，禅定就很难修出来。心有所住，有所执著，不清静的缘故，导致心水不平。如果有这样的嗔恚心，应该先调伏自己的嗔恚心，使心尽量无所住，不挑剔环境及一切法，尽量随缘随和处事待人。把心调到无所住或少有所住时，禅定就容易出现了。</p><p>在打坐修定前，应该先检查自己的内心，发现心里有事情，有不清静之处，就要想办法调伏自己，把心放平，把事情从心里排出去，把问题解决掉。这叫作降伏性障烦恼，烦恼降伏，禅定自然就容易出现。</p><p>原文：<strong>所言慢者。谓怀慢故。慢所制伏。为性于法不生恭敬。于诸师范尊重福田。不能时时身心卑屈敬问咨请。云何为善云何不善。亦不勤求所有善法。由此不能解了引发三摩地义。从此因缘发起轻慢相应寻思多随寻伺。彼由此故先所未生。如前广说。</strong></p><p>释：这种对于禅定的遮障是慢心，慢心是由于心中有我有物，高举自己，轻视于人，心不清静，心不平等，心水不清，致使无法定下心来，无法修出禅定。</p><p>所说的慢，就是心理怀着慢心，被慢所制伏着。由于心被慢所制伏压伏着，其心性对于法就不能生恭敬心，对于诸多善知识福田僧，也不能时时屈下身心咨请法教，不能请教什么是善法什么是不善法，也不知道应该勤求所有善法。由于不知不求善法，就不能知道如何能引发出殊胜的三摩地。因心中的轻慢，生起诸多心绪，诸多念头，心不清静，内心有所躁动，有寻有伺，心念不止。那么原来没有生起的殊胜禅定就不能生起，已经生起的禅定就会退失。</p><p>由此可见，烦恼确实障道。慢心烦恼由何而来？由无明而来，愚痴故有慢。由于不知烦恼相貌如何，心不精勤，不能时时反观自心，于是随顺自心烦恼而流转，不得善法种子。</p><p>自己觉悟性差，就要虚心求助于他人检查自己的烦恼，多多指教自己，不要顾及面子，为了道业增进故。对于他人之批评，有则改之无则加勉。当心平伏下来，没有动荡时，禅定自然出现。</p><p>原文：<strong>言欲贪者。谓怀贪故。多诸爱染。于身财等深生顾恋。由此于外五妙欲中多生散乱。从此因缘生欲寻思。眷属寻思。国土寻思族望家势相应寻思。多随寻伺。彼由此故先所未生如前广说。</strong></p><p>释：第三种障碍禅定的因素，是欲贪贪欲。因为心中有贪爱贪欲，就有染有粘着，心不清静，念头不断，心不能定，心不能止。对于色身和财产资生工具，心里深深的顾恋眷恋，被物侵扰，不得安宁，也就不得止，不得定。</p><p>因贪欲故，于色声香味触五尘境界，攀缘心重，不能对境无心，散乱心重，内心躁动不安，不清静，不能得止，不能得定。因此对于五欲境界总有寻求心，贪求心，如贪求眷属，内心思想波动不止，贪求国土，贪求家族势力，贪求富贵，思想烦乱，心念不断追逐五欲六尘，有寻有伺，心不寂静。因此之故，原来所没有生起的殊胜禅定就不能生起了，已经生起的禅定，就会消失。</p><p>各自检讨内心的贪求贪欲，检讨出来，努力克服降伏，使得心念清静，无欲无求，心得寂止，禅定自然出现。有道是：功夫在诗外，禅定在腿外。把心降伏时，即使不能盘腿，行住坐卧禅定也能现前。</p><p>内心善知止足的人，心清静，禅定容易出现。不知足的人，总有所求，心念不停，散乱攀缘，何能有定。每天即使什么也不做，只检查心念，就是修行。什么都不想是不是心静呢？我们看畜生道众生，心念非常少，它们心静吗？容易入定吗？即使有定，有什么用？非常愚痴的人，心念也少，不知道念些什么，即使有定，也没有什么用。</p><p>能出生智慧的定，心里一定要有个知，有个念，要清明，要专一，这是正念。</p><p>原文：<strong>彼复不净能为对治。应知不净略有三相。谓粪秽相。彼等流相。能依所依差别相。</strong></p><p>释：这里说的欲贪，主要指对淫欲的贪爱。其对治方法，就用不净观来对治。观色身的种种不净相，以熄灭淫欲心念，达到心清静。在观行不净相之前，要知道不净有三种相。</p><p>第一种相，是色身的污秽相，从里到外，从上到下，全部要观行清楚其臭秽肮脏性，四念处观第一观讲到这种观行，现在不细讲了。</p><p>第二种相，是种子相等不断流注出来形成的相，因此是幻化出来的虚妄相，不是真实存在的相貌。第八识用六大种子形成了众生的色身，每种种子都要相等不间断的刹那刹那流注出来，才能维持色身的存在。比如地大种子要不断的流注出来，地水火风空大种子都要相等不断的流注，才能维持色身的存在和不断的新陈代谢。</p><p>五识种子也要相等不断的流注出来，才能形成五识连续不断的了别性，六识和七识都是如此，同类种子都要不断的刹那刹那流注出来，形成六七识连续不断的运行，众生才能有了别性，才能有色身的活动。没有这六大种子的流注，就不能构成色身，没有色身的活动。</p><p>第八识还要依业种，不断的变造色身，改变色身，执持色身的存在。因此说色身就是四大种子流注形成的相，根本没有一丝真实性，不应该贪着。</p><p>虽然我们的意识心非常容易理解这些内容，可是没有用，没有一丝解脱的功德受用，该怎样贪爱，还是要怎样的贪爱。要想降伏欲贪，就要通过意识的观行，深入到意根内心，让意根明了此理，证得色身确实如是，才能降伏欲贪心理。</p><p>很多时候，意识明知自己所说所想所做不对，甚至总是骂自己，恨自己，可是也没用，意识不能做主，有什么办法？意识骂的当然是意根，只是不知道骂谁罢了。有的人甚至对着镜子，指着自己的鼻子骂自己，也没有用，恶习还是难改。意根多么顽固，不可教化。意根明理容易吗？非常不容易，但只要意根明理，一切事都好办。做了坏事，都不指责自己，不骂自己的人，意根更是难于教化，死顽固，老顽固，不开化。</p><p>第三种相，色身是五识六七识的能依相，也是所依相。没有七个识，色身与木头、石头无别，也不能像木石那样长期存在，必然要消失散灭。七个识能够依着色身而运行，造作一切五阴事业，色身就是七个识运行所依的对相。因此说色身没有自在性，没有自在性，是依缘才能存在的假相。因此不值得贪恋，不值得造作贪染邪行。</p><p>心中贪念重的人，不可能出现禅定，念头不断，内心躁动不止，根本定不下心来，心不能清静。其中不当的饮食，也能促使欲念不断，如楞严经中世尊曾经告诫过，五辛荤腥食品，最容易引生欲念和嗔恚心，应该断除荤腥，吃素食，以保持内心的清静。</p><p>修定的环境也很重要，磁场也很重要。居民区比较喧闹，磁场不够好，心不容易静下来。家里房间杂乱无章，不整齐不整洁，也影响心的清静。房间太拥挤，空间狭小，也影响禅定。空间太空旷，不聚气，不拢音，心也容易散乱，不容易定。出家禅定容易成就，在家居士有时间时，就到寺院清修一段时间，巩固一下禅定，再回家修行。定力不足时，再到寺院清修一段时间，这样就能把定力修持出来了。</p><p>原文：<strong>萨迦耶见者。谓由身见制伏因缘会遇世法。便为高欣下戚涂染。设欲弃舍便为身见相违而住。</strong></p><p>释：萨迦耶见就是认五阴为我的我见。由于不断身见，把色身当作自己，被色身所拘碍，心着世俗法，心中便有我慢，在色身上在五阴上与他人进行高低上下的比较，心生染着世欲。有时想弃舍这些心理状态，可是由于身见没有断除，身行心行仍然住于我见当中，致使心念不能清静，禅定不能生起。</p><p>着我见，着身见，便是着于世俗，有所着，必难于修定，心里不能空寂，身口意行必然围绕于所谓的我而展开。只要内心的我不能降伏消除，心念就不能寂止。</p><p>很多时候知道这些心念心境，扰乱自心，每当想舍去时，内心当中的我就出来作祟，很难舍去杂思乱想。</p><p>原文：<strong>又即于彼世法众相。亲爱恒流之所漂溺。设欲弃舍便为身见相违而住。</strong></p><p>释：要想出离生死，必须把不应该执著的世俗法弄清楚，什么属于世俗，都有哪些，对自身的解脱有什么阻碍作用，就像抓贼一样，通过思惟观行把这些贼人当场抓住，使贼人无所能为，我们的心就不会被劫持，就得自在。</p><p>这些世俗法无非是眼根所对的人事物境，人有家亲眷属，有冤亲债主，有喜欢的有憎恶的各类人等，事有好事坏事，喜事恶事，物有好物恶物，境有顺境逆境。当眼根与这些法相对时要识得破，都是生死冤家来纠缠自己的，让自己不得解脱的，执取这些，就上当了。</p><p>要分析这些法的生灭性，幻化性，不实性，虚幻性，空性，苦性，认清其本质都不是个什么，然后心里尽量放舍，随缘度春秋，随缘应对人与事，同时多福德，多忏悔业障烦恼，减少逆缘。顺境不喜，逆境不憎，心里坦坦荡荡，平平安安，禅定自然容易成就。</p><p>同时还要有智慧，要分清善恶，不是不要善，善还要做，恶还要惩，而心不着不住。做到这样是很难，但最起码要有个修行的目标和方向，才能千里之遥始于足下。</p><p>耳根与声音所对时，也要这样识得破，一切声音本是幻化，好声恶声，赞美声，诽谤声，全部为空，不为声音所动。但该做事还要做事，该扬善还要扬善，该惩恶还要惩恶，内心不住不着。虽然做到这些很难，分寸难于把握，但也要有个目标以奔。</p><p>鼻根对香尘时，了知香尘的虚幻，不实，空性，不贪着好香，不厌恶香，对香尘气味无所执著，香臭都无所谓，心里自然清静，将来对生起初禅定也没有障碍。</p><p>舌根对味尘时，不贪饮食，不挑剔饮食，不着味尘，吃饱为好，不再千方百计寻找购买可口美食，要随己因缘而饱腹，这样心地自然清静，将来初禅定也就容易发起，没有遮障。</p><p>身根对触尘时，看清各种触尘的生灭幻化性，不贪着美衣舒适卧具生活环境等等，心不着时，心里自然清静，禅定容易发起。认清六尘境界的虚幻，内心自然不再杂思乱想，染污性减少减轻，除对佛法的思虑之外，少有世俗法的忧虑和挂碍，心地单纯而清明，禅定容易出现，遮障少。</p><p>如果着于身见，就不能认清这些世俗法的幻化性，心必着于冤亲和顺逆相，纠结不断，不得解脱。禅定很难生起，就是由于我见身见障道的缘故。所以思惟观行五阴无我，就能去除障道的因缘，心得空寂。</p><p>原文：<strong>又即世法众相所生不正寻思之所烧恼。设欲弃舍便为身见相违而住。又即于彼世法众相追求之时。种种扰乱散动所逼。设欲弃舍便为身见相违而住。</strong></p><p>释：况且说世间法是由众多行相相貌组成的，非常复杂，众生不容易观察出这些法空幻不实性，于是就把这些世俗的法相全部当作很实在的实有的法，由此生起不如理不如实不正确的思想想法，对境就要生心动念，怎能不烧恼自心，苦恼万端。有的众生感觉到苦了以后，想要弃舍这些苦恼，不想再理会这些世相，可是由于身见我见没有破除的缘故，没法真正舍离这些世相，还是要被这些世相所缠绕。</p><p>又有很多众生在被这些世俗法众多相貌所缠绕时，被种种的世事纷扰相所逼迫，内心散乱苦恼时，假使生起觉悟之心想弃舍这些纷扰杂乱之相，但由于身见我见没有破除，被身见所障碍，无法弃舍远离这些世俗纷扰，还是要住于这些杂乱世相当中，受于苦恼。</p><p>那么断除身见我见是多么的重要！能消除无量劫的生死苦恼，心清静得解脱，是世间任何事任何财物任何人也代替不了的。明明是苦得不能再苦了，为什么还不能看透世间相，不能脱离世间相，求得身心解脱呢？</p><p>原文：<strong>又即由彼身见因缘。恒常执着世法所依无常诸取。由是因缘为忧悲等之所逼恼。设欲弃舍便为身见相违而住。</strong></p><p>释：又由于有身见的缘故，恒恒时常常时执著于世间法所依赖的无常的五取蕴，执著于色取蕴、受取蕴、想取蕴、行取蕴、识取蕴，因此才被世事所逼迫，忧悲苦恼不断。假使有所觉悟想弃舍这些苦恼，由于身见的遮障，无法舍弃，还是要住于世相当中，忧悲苦恼不已。</p><p>自己在遇到苦恼烦恼，不能解脱时，就观察根尘识三者的虚妄幻化性，让心能从境界上脱离出来一点点，就能得一点点的清凉自在。不能把心陷入事相当中，被事相所迷惑。</p><p>把这些障碍修定的因素排除一些，心里没有障碍就轻松自在一些，修定就容易，各种观行一用就能上手，证得佛法断除我见，还是不很难的。</p><p>原文：<strong>又复即彼为欲除遣下地垢秽。勤修善时。于彼加行不生喜乐。于此所治设欲弃舍。便为身见相违而住。如为除遣下地垢秽。为遣上地所有垢秽当知亦尔。</strong></p><p>释：有些人修行，为了除去下地下位心的污垢，而精勤努力的修行善法时，对于这种努力修行始终不能生出喜乐心。就是喜觉分始终不能现前，想要弃舍内心中的染污烦恼，也无法消除和降伏。原因是由于身见的遮障，执身之过，只能住在烦恼染污之中，不能自拔。</p><p>想办法作加行除遣层次较低的烦恼是这样，除遣更深层次的烦恼染污也是这样，都很难。因为什么？因为身见我见的遮障。无始劫来太执身执我，没办法拨开所谓的我的云雾。</p><p>因为身见我见的遮障，加行修不上去，功夫不能进阶，喜乐心不能生出来，七觉分修不出来，烦恼无法降伏，道业不能增进。喜觉分修不出来，修行就会觉得枯燥乏味，三天打鱼两天晒网，进进退退，懈懈怠怠。</p><p>对于所修之法，没有喜乐心贪爱心，就不能精进，七觉分都不能满足，证果就遥遥无期。凡是没有修出七觉分，而说自己断我见，都是大妄语者，果报可畏。修出七觉分者，内心有喜乐，烦恼减轻，不可能还有心去造恶业，满脑子坏心眼子。有轻安觉分倚觉分定觉分者，内心安详自在，更不可能有弯弯肠子，动坏心眼子，而去损恼他人，造诸恶业。可见有些人的断我见，只断在口上，满心满肺还是我，我见更重。</p><p>七觉分之一是定觉分，定觉分不成就，没有禅定，就不能断我见证果，也不能明心见性。有些人修行就是仇恨禅定，非要把禅定挖出去不要，与禅定作冤家，与佛之教导相违背，可见其所谓的证果和明心其证量如何，全部是意识心的理解，情思意解，靠头脑聪明，理解力强而解。如今这样的人越来越多，佛教界可叹！</p><p>原文：<strong>由此因故虽作是心。我当于彼生死涅槃观大过失观胜功德。便复颠倒。由此因缘先虽获得诸三摩地。然于未生圣谛现观胜三摩地。不能得生。不堪忍者。谓怀不忍故。虽已获得圣谛现观胜三摩地。不能堪忍蚊虻等苦。舍离加行多生懈怠。</strong></p><p>释：由于无法除去下地和上地心污垢烦恼遮障之故，因此虽然发心要观行思惟生死的过患以舍离，观行思惟涅槃的殊胜功德而趣向，现在不得不颠倒，随顺逆缘，住于烦恼染污之中不能自拔。</p><p>由于这些观行不成就，原来所获得的禅定，也不能成就四圣谛的观行智慧，不能断除我见。原因是在修行过程当中，心不堪忍，对于生活修行环境不能忍耐，不能忍苦，而生退屈，有的人虽然能观行四圣谛理而获得殊胜的禅定境界，因为不能忍于蚊虫叮咬之苦，就放弃了四加行的修行，心生懈怠，不得成就不能断除我见。</p><p>原文：<strong>由此因缘于所未生之根本定不能生起。设复已生还即退失。前三过失能为最初三摩地障。次一过失为谛现观三摩地障。后一过失为入根本三摩地障。</strong></p><p>释：由以上因缘，对于所未能出生的禅定，就不能出生了，假使已经出生的禅定，还要退失掉。前三个过失，忿、慢、欲贪是生起禅定的最初障缘。其次有我见这种过失能够障碍深细观行，成为禅定的障碍。最后一个不能堪忍，是进入禅定的最根本障碍。</p><p>原文：<strong>复有差别。谓有八种弃舍近住弟子因缘。于彼杂染之所染污。由染污故彼便弃舍近住弟子。非无烦恼诸阿罗汉常善住念有如斯事。</strong></p><p><strong>云何为八。谓性于彼近住弟子有憎恶心。唯欲自身受于恭敬。如欲恭敬。欲受利养亦复如是。近住弟子多所毁犯行不正行。</strong></p><p><strong>又于近住诸弟子众饶益损减。便有所须及与不须。于增上戒教授折伏不能堪忍。于增上心增上慧住教授折伏不能堪忍。于营众务所有扰恼。不能堪忍。</strong></p><p>释：还有一些差别相，是有八种弃舍身边近住弟子的因缘，因为能被这些弟子杂染因缘而染污自心，于是便决定弃舍弟子，心有烦恼之人不得不如此。而没有烦恼的阿罗汉就不会被弟子的杂染所染污，阿罗汉也不会弃舍弟子而独住。</p><p>有哪八种？其心性对于身边的近住弟子怀有憎恶心，只想自身能受到他人的恭敬。如想受到恭敬，想受到利养也是这样。自己近住的弟子多行犯戒事宜，行不正当身口意行，于是便弃舍近住弟子。对于近住弟子的诸多利益之事逐渐减少，于是弟子对于修道利益上的事，就有所须和不须，弟子们对于增上戒的教授和折伏自心不能忍受，于增上定和增上慧的教授和折伏不能忍受，对于随众做些大众事务心有忧恼不情愿，不能忍受。由于自心的染污和懈怠而出现这八种弃舍弟子的因缘出现。</p></div>"
}]