[{
    "title": "第二十九卷（四正勤的修行）",
    "author": "生如法师",
    "date": "2022年08月16日",
    "html": "<div class=\"B1_text\"><p/><p><strong>瑜伽师地论 第二十九卷（四正勤的修行）</strong></p><p><strong>本地分中声闻地第十三第二瑜伽处之四</strong></p><p>原文：<strong>如是于四念住。串习行故。已能除遣。粗粗颠倒。已能了达。善不善法。从此无间。于诸未生。恶不善法。为不生故。于诸已生。恶不善法。为令断故。于其未生。一切善法。为令生故。于其已生。一切善法。为欲令住。令不忘失。广说如前。乃至摄心持心。</strong></p><p>释：由于熏习观行了四念住的缘故，就消除了心中最粗浅的颠倒。从前以身为我计净贪着，现在知身不净无我；从前以苦为乐，贪享觉受，现在知受皆苦；从前认为心是相续是常，现在知心无常；从前计五蕴世间法为我，现在知无我。把颠倒知见搬正回来，心不再颠倒。</p><p>修习四念住之后，就能了达什么是善法，什么是不善法，从此无间断地进入四正勤的修习中。能令那些还没有生起的恶的不善法不再生起；能令那些已经生起的恶的不善法断除掉；对于还没有生起的善法能令其出生；对于那些已经生起的善法保持下去，令其永远不忘失掉。展开来说就像前边所说的那样。在四正勤的修习过程中，能够摄持住心、保持住心。</p><p>原文：<strong>云何名为。恶不善法。谓欲缠染污。身语意业。是身语意。恶行所摄。及能起彼。所有烦恼。若未和合。未现在前。说名未生。若已和合。已现在前。说名已生。</strong></p><p>释：什么叫作恶的不善法？恶不善法是由贪欲所缠缚的身业、口业和意业，摄属于身恶行、语恶行和意恶行，以及能生起五阴七识所有的烦恼。如果身口意恶不善业还没有造作出来，恶不善行还没有出现，就是还未生起的恶不善行；如果身口意恶不善业已经和合生起了，恶不善行已经出现了，就叫作恶不善行已生。</p><p>和合是指烦恼与缘合，烦恼遇缘恶不善业行出现，烦恼不遇缘，烦恼只是眠藏着，恶不善业行不出现。恶业和不善业二者稍微有区别，在烦恼轻重程度上有差别，恶行显示烦恼比较重比较粗，不善行显示烦恼轻一些，介于恶和善之间。不善行包含的范围广，恶行是不容易让人忍受的行为。恶这种烦恼比较粗重，表现的比较明显，是不应该出现的，所以才是让人让己不好容忍。不善的烦恼稍微轻一些，每个人经常出现，人们对此有一定的容忍度。</p><p>众生恶不善法多善法少，所以都觉得不善属于正常现象。而众生却不知，大家都认为的一切正常现象，都是不正常的，都不应该出现。人们拿不善当作正常现象，说明众生都有不善法，心地都不清净。越能容忍恶不善法，人心的善法越少。众生的容忍与诸佛菩萨的容忍截然不同，诸佛菩萨的容忍是智慧和慈悲的体现，众生的容忍很多时候是烦恼的体现。很多人身口意行不善的时候，你给指出来，都会不高兴，心无惭愧，说明他对自己的恶不善行为很能容忍，这就离修行还有一段距离。</p><p>原文：<strong>云何名为一切善法。谓若彼对治。若盖对治。若结对治。未生已生。应知如前。恶不善法。若时未生。恶不善法。先未和合。为令不生。发起希愿。我当令彼。一切一切。皆不复生。是名于诸未生恶不善法。为不生故生欲。</strong></p><p>释：什么叫作一切善法？善法是对恶法的对治，与恶法相反，是降伏恶法的法，名为善法。比如对于烦恼盖障的对治，对于烦恼结缚的对治，对治之后生起了善法，恶法就灭，就像太阳生起驱逐了黑暗，黑暗就消失一样。如果恶法消失，就不再用善法对治了，心清净以后，就是不善不恶的，作善也是有为法，也是生死业，心清净就无业，得大寂静，得大涅槃。</p><p>用善法对治恶法，就是四正勤的修习，未生恶使其不生，已生恶使其断灭。当恶不善法生起的因缘条件还没有具足时，为了使恶不善法不生，心中就会发起希求和愿望，希望恶不善法不要再生起来。比如发愿以后再也不要嫉妒了，再也不要偷盗了，再也不要妄语了，再也不杀生了，再也不陷害人了等等。这就叫作对于还没有出生的恶不善法，为了使其不生，而发起了希冀和欲望。</p><p>原文：<strong>若时已生。恶不善法。先已和合。为令断故。发起希愿。我当于彼。一切一切。皆不忍受。断灭除遣。是名于诸已生。恶不善法。为令断故生欲。</strong></p><p>释：如果这时候生起恶不善法的因缘和合起来了，已经生起了恶不善法，为了使恶不善法断灭而发起了希求和愿望，希望自己再也不要容忍一切恶不善法了，下决心要断灭和遣除一切恶不善法，使心变善。这就叫作对于已生的恶不善法，为了使其断灭而生起了希冀和欲望。</p><p>以上所发的愿都是善愿，只有觉悟的人才能如此发愿，觉悟自心有恶和烦恼，知恶不善法的恶果恶报，对于解脱有障碍，并且也分得清楚什么是善，什么是恶和不善，如果分不清楚，就不能觉悟自心，即使有愿，也不能如愿和满愿。这些愿，是在修行过程中自动自觉发起来的，是修行如法有成效的体现，是精进的结果。精进是心精进，不是只在身口等表面做文章，身口如车，心如驾车人，如果想要车走得快和稳，方向正确，当然是要督促和鞭策驾车人了。初学佛的人大多在身口上精进用功，如拜佛念佛，还不会在心上用功，老修行人就知道观察自心，监管自心，对治自心，使心断恶增善。</p><p>原文：<strong>又彼一切。恶不善法。或缘过去事生。或缘未来事生。或缘现在事生。如是彼法。或缘不现见境。或缘现见境。若缘过去未来事境。是名缘不现见境。若缘现在事境。是名缘现见境。</strong></p><p>释：所有一切恶不善法，或者是缘于过去的事情出生，或者是缘于未来的事情出生，或者是缘于现在的事情出生。所以恶不善法或者是缘非现前所见的境界，或者是缘现前所见的境界。如果是缘过去和未来的境界，叫作缘非现前所见的境界，如果是缘当前出现的境界，叫作缘现前所见的境界。</p><p>原文：<strong>当知此中。于缘不现见境。恶不善法。其未生者。欲令不生。其已生者。欲令永断。自策自励。是名策励。于缘现见境。恶不善法。其未生者。欲令不生。其已生者。欲令永断。勇猛正勤。是名发勤精进。所以者何。要当坚固。自策自励。勇猛正勤。方能令彼。或不复生。或永断灭。</strong></p><p>释：而对于缘非现前所见境界，如果恶不善法还没有生起来的时候，就一定要让恶不善法不出生，如果恶不善法已经出生的时候，就一定要使得恶不善法永远断灭，以此自己鞭策自己，自己鼓励自己，这就叫作策励。对于缘现前所见的境界，如果恶不善法还没有出生的时候，一定要令其不生，如果恶不善法已经出生的时候，就一定要令其永远断灭，这样勇猛精进地修行，就叫作奋发、勤奋精进。为什么要这样精进呢？这是因为，只有心坚固地自策自励，勇猛精进，才能使得恶不善法或者不再出生，或者永远断灭不现。</p><p>原文：<strong>又于下品中品诸缠。其未生者。欲令不生。其已生者。欲令永断。故自策励。于上品缠。其未生者。欲令不生。其已生者。欲令永断。发勤精进。又若行于过去境界。如是行时。不令烦恼缘彼生起。设复失念。暂时生起。而不忍受。速能断灭。除遣变吐。如缘过去。若行未来。当知亦尔。如是未生恶不善法。能令不生。生已能断。是名策励。</strong></p><p>释：对于下品和中品所有烦恼缠缚，如果还没有出生的，一定要令其不生，对于已经生出来的，一定要令其永远断灭，所以自己策励自己。对于上品烦恼缠缚，如果还没有出生的，就一定要令其不生，已经出生的，就一定要永远灭除，因而勤奋精进。</p><p>如果心缘过去境界，当正缘想过去境界时，不要让烦恼因为过去的境界而生起，假使心中失去了正念，没有觉察到烦恼出现了，一旦发现了烦恼生起，也不再容忍烦恼继续，能快速地灭除掉，除遣和剔除烦恼。如果心缘未来境界，也要像缘过去境界一样对待。像这样还没有生起的恶不善法，能令其不生，已经生起的能令速断，就叫作策励。</p><p>原文：<strong>若行现在所缘境界。如是行时。不令烦恼缘彼生起。设复失念。暂时生起。而不忍受。速能断灭。除遣变吐。如是未生。恶不善法。令其不生。已经生起，生已能断。是名发勤精进。</strong></p><p>释：如果心缘现在现前所见的境界，在现前境界中运行时，不让烦恼缘于现在境界而生起。假如一不小心，丢失了正念，烦恼暂时生起，一旦发现，就不容忍其继续，迅速地断灭，除遣剔除其烦恼。像这样还没有生起的恶不善法，能令其不生，已经生起的恶不善法，生起之后即令其烦恼断灭，就叫作勤奋精进。</p><p>能如以上勇猛精进地修行四正勤，自策自励，烦恼不久就会除遣，烦恼除遣之后心清净才能见道，获得智慧解脱。如果对于烦恼缠缚还不能觉悟其害，任由烦恼泛滥，轮回苦恼之灾就不除，无由见道证圣。由此可知，不断烦恼证菩提，无有其事。</p><p>原文：<strong>又或有恶不善法。唯由分别力生。非境界力。或有恶不善法。由分别力生。亦境界力。唯由分别力生。非境界力者。谓于住时。思惟过去未来境界。而生于彼。由思惟力生。亦境界力者。谓于行时。缘现在境界。而生于彼。当于尔时。决定亦有。非理分别。当知此中。恶不善法。唯由分别力生。非境界力者。彼若未生。能令不生。生已能断。是名策励。若由分别力生。亦境界力者。彼若未生。能令不生。生已能断。是名发勤精进。</strong></p><p>释：有的恶不善法，只由分别力出生，不由境界力出生。分别力就是意识的分别性，也是随顺意根习气的结果，不受现前六尘境界的熏染，境界无力推动恶不善法已经出生，因为意根固有的习气力量大。有的恶不善法不仅是由意识的分别力产生出来的，也是由六尘境界熏染的力量产生出来的。</p><p>只由分别力产生，不由境界熏染产生的恶不善法，是指住于现前法中，而思惟过去和未来境界，于是恶不善法就出生了。这样的恶不善法，主要是意根的烦恼习气产生出来的。不仅是由分别力产生，也由境界熏染产生的恶不善法，是指在身口意运行时，缘现在境界而产生了恶不善法。身口意运行时不仅有六识的分别力，也受现前境界熏染。因为这时候，不仅境界起推动作用，决定也有非如理分别。这是意根烦恼习气，和现前境界熏染共同产生的恶不善法。</p><p>由此可知，恶不善法只由分别力产生，不受境界力熏染的，如果还没有出生，能令其不生，出生以后能令其断灭。这叫作策励。如果是由分别力出生，同时也由境界熏染力产生出来的恶不善法，这些法如果还没有出生时，能令其不生，即使出生以后，也能断除，这叫作发勤精进。</p><p>原文：<strong>于其未生。一切善法。为令生故生欲者。谓于未得。未现在前。所有善法。为欲令得。令现在前。发心希愿。发起猛利。求获得欲。求现前欲。而现在前。是名于其未生一切善法。为令生故生欲。</strong></p><p>释：对于还没有出生的一切善法，为了令其出生的缘故而生起希冀和愿望，意思是说对于还没有得到、还没有出现的所有善法，为了能够得到，令其现在面前，发心希望得到，并且发起猛力的愿望，期求获得善法的欲望，期求善法现在前的欲望，最终令善法出现在面前，这叫作于未出生的一切善法，为了令其出生的缘故而生起了欲望。</p><p>原文：<strong>于其已生。一切善法。为欲令住。令不忘失。令修圆满生欲者。谓已获得。已现在前。所有善法。是名已生善法。于此善法。已得不失。已得不退。依是说言。为欲令住。于此善法。明了现前。无闇钝性。依是说言。令不忘失。于此善法。已得现前。数数修习。成满究竟。依是说言。令修圆满。于此善法。发心希愿。发起猛利求。坚住欲求。不忘欲求。修满欲而现在前。是名于其已生一切善法。为欲令住。令不忘失。令修圆满生欲。</strong></p><p>释：对于已经出生的善法，为了令善法坚住，为了不忘失善法，为了令其善法得到圆满，而生起希冀和愿望。已经获得的所有善法，已经在现前出现的所有善法，叫作已生善法。对于已经得到的善法不再失去，也不再退去，这叫作希冀善法常住。对于已有善法心中明了自持，清清楚楚，没有暗钝性，这叫作令其善法不忘失。对于已经获得的善法，不断地修习，令善法圆满究竟无间，这叫作令修圆满。</p><p>对于善法发起希冀心，发起猛力的求取心，发愿获得和持有，并且想要坚固地住在善法中而不退失不忘却，希望把善法修习圆满，这些欲望和心愿，就叫作于其已生一切善法生起欲望，为了想要令其住着永存，为了不忘失善法，为了把善法修习圆满，而生起的欲望。</p><p>原文：<strong>策励者。为于已得。令现前故。发勤精进者。为于未得。令其得故。又策励者。于已生善。为欲令住。令不忘故。发勤精进者。令修满故。又于下品中品善法。未生令生。生已令住。令不忘失。是名策励。于上品善法。未生令生。生已乃至。令修圆满。是名发勤精进。</strong></p><p>释：所谓的策励，是为了对于已经获得的善法，令其现前，在身口意行中显现出来，所以才要勇猛地鞭策激励自己。所谓的发勤精进，是为了对还没有获得的善法，令其尽快得到，所以才勤勉精进。策励也指对于已经生起的善法，为了令其坚住持久，令其不被忘却。发勤精进又指对于已经生起的善法，令其尽快修习圆满，所以才生发出勤奋精进心。</p><p>另外，对于下品和中品善法，还没有出生的，要令其出生，已经出生的，要令其坚住，不再忘却，这叫作策励。对于上品善法，还没有出生的，要令其出生，已经出生的，令其坚住，并且令其修习圆满，这叫作发勤精进。</p><p>原文：<strong>言策心者。谓若心于修奢摩他一境性中。正勤方便。于诸未生。恶不善法。为令不生。广说乃至。于其已生。一切善法。为欲令住。令不忘失。令修圆满。由是因缘。其心于内。极略下劣。或恐下劣。观见是已。尔时随取一种。净妙举相。殷勤策励。庆悦其心。是名策心。云何持心。谓修举时。其心掉动。或恐掉动。观见是已。尔时还复于内。略摄其心。修奢摩他。是名持心。</strong></p><p>释：所说的策心，是说如果心在修习止的时候，在专住于一个境界的奢靡他中，正当精勤地以方便力，对于还没有出生的恶不善法，为了令其不出生，对于已经出生的恶不善法，令其灭除，广泛地说，乃至于对于已经出生的一切善法，为了令其坚住，不令忘失，令其修习圆满。由于这个修止的因缘，当发现自己内心极其昏昧，或者害怕昏昧，这时候就要随机选择一种清净胜妙的殊胜之相，来激发鼓励自己，让心欢喜心向往之，这叫作策励其心。什么叫作持心？在修习举相时，当发现自心掉动不停，或者害怕掉动时，在心里悄悄地收摄自心，让心止下来，这叫作持心。</p><p>这里说的策心，是指在修定的时候，发现心里昏沉不清明，就要修观以对治，让心提起，集中在所观之法上，这样心就不昏沉掉举了。所观之法有很多，可选一种与自己目前所修习的法相同或者相似的内容，把注意力集中在此法上，所观之法越清晰明确，越胜妙越殊胜，就越能感兴趣，吸引自己的注意力，精力就会旺盛，驱走昏沉暗钝。在修观的时候，如果发现自己的心注意力不够集中，心散乱了，就要停止修观，让心止于一境中不动，等心静下来以后，再继续修观。</p><p>在修习定慧止观的时候，不是一味地修定和止，也不是一味地修慧和观，要根据自心的情况来抉择。修行要定慧等持，止观双运，如果发现定多心沉没就要提起正念，多修观，如果发现自心不能专一深入，就要多修止，要保证止中有观，观在定中，二者缺一，不得善果。</p><p>原文：<strong>如是四种。亦名正胜。谓于黑品诸法。其未生者。为令不生。其已生者。为令断灭。生欲策励。发勤精进。策心持心。是二正胜。于白品诸法。其未生者。为欲令生。如前黑品广说。应知是二正胜。</strong></p><p>释：以上四种修习方法，也叫作四正胜。对于黑品烦恼之法，如果还没有出生的，为了令其不生，对于已经出生的，为了令其断灭，而生起欲望和策励，发起勤勉精进心，策励其心、加持其心，这是二种正胜。对于白品诸善法，还没有出生的，为了令其出生故，其已经出生的，为了令其坚住圆满故，生起愿望和策励，发心精进修行，策励其心、坚持其心，这也是二种正胜。</p><p>勤是勤勉精进的意思，胜是心胜，也是精进的意思，正是指方向和方法正确无误，在正确的方向上努力精进，是正精进，是不断地趣向目标；反之，在不正确的方向上努力精进，就是邪精进，越精进离目标越远。不少人学佛修行就是邪精进，不明修行目标，也不明修行原理，只一味地用功，勇猛是勇猛，智慧太欠缺了。</p><p>原文：<strong>如是四种。亦名正断。一名律仪断。谓于已生。恶不善法。为令断故。生欲策励。乃至广说。二名断断。谓于未生。恶不善法。为不生故。生欲策励。乃至广说。由于已生。恶不善事。应修律仪。令其断灭。不应忍受。由是因缘。名律仪断。于其未生。恶不善事。为欲令彼。不现行断。为欲令彼。不现前断。为断故断。故名断断。</strong></p><p>释：如是四种正胜，也叫作四正断。其一是身口意造作的律仪断，是对于已经生起的恶不善法，为了令其断故，生起欲望和策励。其二是断断，是对于还没有生起的恶不善法，为了令其不生故，而生起欲望和策励。由于已经生起的恶不善法，应该修习身口意律仪，令其恶不善法断除，不应该忍受这些恶不善法，任其出生和增长，这叫作律仪断。对于还没有生起的恶不善法，为了令其不再现行出来而断，为了令其不再现前而断，为了断除恶不善法而断，叫作断断。</p><p>原文：<strong>三名修断。谓于未生一切善法。为令生故。广说乃至。策心持心。由于善法。数修数习。先所未得。能令现前。能有所断。故名修断。四名防护断。谓于已生。一切善法。为欲令住。广说乃至。策心持心。由于已得。已现在前。诸善法中。远离放逸。修不放逸。能令善法。住不忘失。修习圆满。防护已生。所有善法。能有所断故。名防护断。</strong></p><p>释：其三是修断，是对于还没有出生的善法，为了令其出生故，而策励其心，加持其心。由于善法多次反复地修习，先前所没有获得的善法，现在能令其现前出现，能让恶不善法有所断除，叫作修断。其四是防护断，是对于已经出生的一切善法，为了令其坚住，而不断地策励其心，加持其心。由于在已经获得、已经现前出现的所有善法中，其心能够远离放逸，修习不放逸行，能令善法坚住而不忘失，善法修习圆满了，防护就生起来了。所有的善法，对于恶不善法能有所断除的缘故，名为防护断（恶不善法）。</p><p>防护是防护恶不善法的出现，心中有善法，恶不善法才能断除不出现，由于善恶不能同时出现，所以善法起着防护的作用。善法坚固以后，就不会造作恶不善业了，这是长时间修习善法的结果。四正勤是属于最初修习的助道之法，是见道的必要条件，所以见道的人是要断除相应的粗重的烦恼的，心中善法应该是坚固的，恶不善法是不会轻易现前的。</p><p>如果修完四正勤，在命终之前还没有见道，因为心改变的缘故，后世所受的恶报也会很轻微，但不保证善法不会退去，恶不善法不会重新出现。因为业缘的缘故，难免会被恶的环境熏染，又因为有善法的基础，再遇善缘，善法还是会容易生起，修习善法是很快的。见道以后，善法才能保持住，并且会不断地坚固和增长，不断地圆满。</p><p>原文：<strong>如是广辨。四正断已。复云何知。此中略义。谓为显示。于黑白品。舍取事中。增上意乐圆满。及加行圆满。是故宣说。四种正断。当知此中。由生欲故。增上意乐圆满。由自策励。发勤精进。策心持心故。加行圆满。</strong></p><p>释：如是广泛地论辩四正断以后，如何才能知道四正断的大略要义？四正断的大略要义，是显示在黑白善恶诸品的取舍过程中，其增上意乐圆满了，去恶增善的加行也圆满了，因此就应该说四正断。你们应当知道，在四正断的修习过程中，由于心里已经生起了想要断恶增善的欲望的缘故，增上意乐就圆满了，由于自心能够策励自己，进而生发勤勉精进心，不断地策励其心，加持自心，因此加行就圆满了。</p><p>在达到四正断之前，对四正勤的修习，还没有生起很强的欲望，所以增上意乐还不圆满，四种正断就不出现，对自身的策励激励还不够强，鞭策和驱策其心的力度还不够大，所以四种正断就不会出现。直到意乐和策励都圆满具足了，四正断才出现，这时候四正勤就修完了。</p><p>原文：<strong>修瑜伽师。唯有尔所。正应作事。谓为断灭。所应断事。及为获得。所应得事。先当生起。希愿乐欲。为断诸缠。复应时时。正勤修习。止举舍相。为断诸缠。及随眠故。更应修集。对治善法。为现如是。一切所作。说四正胜。及四正断。是名略义。</strong></p><p>释：修行瑜伽的行者，只有这些法才是他所应该修的，为了断灭那些所应该断除的事，以及要获得所应该获得的事，首先应当生起希冀、意愿和乐欲。为了断除诸烦恼缠缚，还应该时时正精勤地修习止相（禅定）、举相（激励自心）和舍相（舍弃恶不善法）。为了断除诸烦恼缠缚以及随眠的缘故，更应该修集用来对治恶的善法。为了显现出这些所有所应该作的事，才宣说四正胜以及四正断，这些内容就叫作四正断的大略之义。</p><p>以上四正勤这些法，有一些人不愿意修习，轻贱这些法，认为这些法很基础，是小乘法，没有必要花时间去修，所有精力都用来熏习大乘法就好了。但是四正勤不修，心不转善，德不具足，德不相配，就证不得大乘法，所有的熏习最终也只是理论而已，理论在一定的因缘条件下是可以忘却丢失的，即使不忘却，理论终究是一个理论，没有多少实用价值，命终却因恶不善法而堕落，徒有理论不能救命。</p></div>"
}]