[{
    "title": "大般若波罗蜜多经般若理趣分述赞 第1695部",
    "author": "窥基大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>大<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜多经般若理趣分述赞 第一卷</p><p>大慈恩寺<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a> 基撰</p><p>稽首离性相心言本空寂</p><p><a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>真<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>及我亲教尊</p><p>理趣甚深法非我所能赞</p><p>今依尊智悲加持力故说</p><p>瑜伽论第八十二云。诸<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>师将欲开阐先当赞佛。或略或广。略赞佛者由五种相。一者妙色具三十二大丈夫相<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a><a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。八十随好间饰支体。光明照耀如大金山。二者寂静端严殊妙诸根闲寂。其心晏然。已能善得最上调顺寂止究竟。已能善到第一调顺寂止<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。善能密护降伏诸根。为丈夫龙无误失故。丈夫牛王御大众故。丈夫良马心调善故。清净无挠如澄泉池。已能永拔<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>习气。三者胜智。谓于三世及非世法无碍无著。四者正行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>四摄自他利行皆悉圆满。五者威德谓诸如来<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>游戏威德炽盛。复有六赞。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>圆满故。离垢染故。无浊秽故。无与等故。唯利有情以为业故。于此业用有堪能故。广赞无边皆如彼说。既赞佛已要成十法名说法师。言十法者一者善于法义谓六法十义善能解故。二者能广宣说。谓多闻闻持其闻积集。三者具足<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。胜大众中宣说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>无所怯惧。声不嘶掉腋不流汗念无忘失。四者言词善巧语工圆满。八支成就言词具足处众说法。五者善方便说。谓二十种善巧方便宣说正法。如以时殷重等。六者具足成就法随法行。不唯听闻以为究竟。如其所说即如是行。七者威仪具足。谓说法时手足不乱头不动摇。面无变易鼻不改异。进止往来威仪庠序。八者勇猛<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>常乐听闻所未闻法。于已闻法转令明净。不舍瑜伽不舍作意。心不舍离内奢摩他。九者无有厌倦。谓为<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>广宣妙法身心无倦。十者具足忍力。谓骂弄诃责终不返报若被轻蔑不生忿憾乃至广说。其听法者。是说法师说正法时应安处他令住恭敬无倒听闻。谓由一因或乃至十。一者恭敬听法。现前能证利益安乐。此有四句如菩萨地法处中说。二者一善建立一切法。离诸过失具大义故。二说者听者所设劬劳有胜果故。三者。一能令<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>舍恶趣故。二得善趣故。三速能引摄<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>因故。如是三事要由恭敬听闻方得。四者。一能善了达契经等故。二如是正法能令众生舍诸不善摄受诸善。若善听者能受舍故。三由此舍受舍离恶因所招后苦故。四速证涅槃故五者。一谓我今当闻所未闻。二闻已研究。三当断疑网。四弃背诸见。五我当以慧通达一切甚深句义。此显三慧。初二显闻。次二显思。后一显修。六者。一为欲敬报大师恩德。谓佛为我行于无量难行苦行。求得此法云何今者而不听闻。二观自义利。三究竟能离一切热恼。四善顺正仪。五易可见了。六诸聪慧者内证所知。七者。谓我当集七种正法知法知义乃至广说尊卑差别。八者。一<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>易得乃至亦为旃荼罗等而开示故。二易学行住坐卧皆得修故。三能引发增上生果决定胜果。四初善五中善六后善七感现乐果。八引后乐故。九者。谓能<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>九种<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>逼迫事故。一能出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>大牢狱故。二永断贪等坚牢缚故。三弃舍七财贫。建立七<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>故。四<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>善行闻正法俭。建立善行闻正法丰故。五灭无明闇起智明故。六度四暴流升涅槃岸故。七究竟能疗烦恼病故。八解脱一切贪爱罥故。九能度无始生死旷野稠林行故。十者。一恭敬听法得思择力。由此能受闻法胜利。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>求财不以非法。深见过患而受用之乃至第十能引一切世间出世间静虑解脱等持等至。广如彼说。说者听者先住上法方可说听。若不住此徒设劬劳终无大果</p><p>将赞经文略以四门解释。一叙经宗旨。二显经体性。三彰经胜德。四释经本文</p><p>叙经宗旨者佛灭度后九百年间有应真大士。厥名清辨。身同数论之仪。示无朋党之执。心处释迦之理宗无偏滞之情。时人号为妙吉祥菩萨。神异圣德广如别记。彼造掌珍论云。凡所知境略有二种。一者有为二者无为。以诸愚夫不正觉了胜义谛理有为无为无颠倒性。妄执诸法<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>差别。增益种种邪见罥网。如世有一无智画师画作可畏药刃鬼像或女人像。眩目乱意谓为实有。执实有故自起惊怖。或生贪染于彼境界众多计度。增长分别诸见罥网。若正觉知胜义谛理有为无为无颠倒性。尔时如世有智画师不执彼为真实自性。非如前说有为无为境界差别以自缠裹如蚕处茧。彼非有故无分别慧趣入行成然证出世无分别智。要须积集能坏一切邪见眼膜。无倒观空安缮那药。如是积集无倒观空。要藉能遣一切所缘自性闻慧故。应听此般若深经。依此所说以为宗者真性有为空如幻。缘生故。无为无有实不起似空花。此中世俗许少分有。若依胜义一切皆空。此中画师有智无智怖染譬喻。喻佛菩萨一切异生。自业所招返生憎爱。智者知画俱于平等不生怖染。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>中边颂曰虚妄分别有于此。二都无。此中唯有空于彼亦有此。故说一切法非空非不空。有无及有故是即契中道。此以无所执有有无为。以为宗广如常说</p><p>二显经体性者。般若有五。一者实相。二者观照。三者文字。四者境界。谓真俗二谛。五者眷属谓一切福智如开题中已略显示。经体有二。一者文二者义。文字是文。四种是义。实相是般若性。观照是般若相。文字是般若因。境界是般若境。眷属是般若伴。故此五种皆名般若。龙猛释言。就胜义谛一切皆空。教既无教无不教。体亦无体无不体。于俗谛中亦可说有。句言章论声为教体广如清辨般若灯说。<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>释言。教体有四。一摄相归性体。般若论说。应化非真佛亦非说法者。说法不二取无说离言相。此经下言。一切有情及法皆即真如故。甚深般若波罗蜜多亦即真如。无垢称言。文字性离。无有文字。是即解脱。解脱相者即诸法也。又一切法亦如也。故知教体性即真如。二摄余归识体故。十地言。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a><a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。二十<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>言。谓余相续识差别故令余相续差别识生展转互为增上缘。故说者听者心为教体。三摄假随实体。对法论说。成所引声者谓诸圣所说。故知但取声为教体。摄名等假法随实声说故。四相用别论体。能说法者识上所现声名句文以为教体。以假及实为教体故。十地论云。说者听者俱以二事而得究竟。一者声二善字。由熏习力唯识变力于说法者<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>之上聚集现故。如别章说不能烦引</p><p>三彰经胜德者。此经总名般若理趣。准义名别有十四种。一此一切法甚深微妙清净法门。若闻已信受得八胜果。一乃至当坐妙<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>座一切障盖皆不能染。谓烦恼障<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>法障虽多积集而不能染。二虽造种种极重恶业而易消灭。三不堕恶趣。四若能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>日日读诵精勤无间。如理思惟彼于此生定得一切法平等性金刚等持。五于一切法皆得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。六恒受一切胜妙喜乐。七当经十六大菩萨生定得如来执金刚性。八疾证无上正等菩提。二者寂静法性现等觉门。若有闻已信解受持读诵修习得二胜果。一乃至当坐妙菩提座虽造一切极重恶业。而能超越一切恶趣。二疾证无上正等菩提。三者调伏众恶普胜法门。若有闻已信解受持读诵修习得四胜果。一假使杀害三界所有一切有情。而不由斯堕于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>傍生鬼界。以能调伏一切烦恼及随烦恼恶业等故。二常生善趣受胜妙乐。三修诸菩萨摩诃萨行。四疾证无上正等菩提。四者平等智印清净法门。若有闻已信解受持读诵修习得三胜果。一虽住一切贪嗔痴等客尘烦恼垢秽聚中。而犹莲花不为一切客尘垢秽过失所染。二常能修习菩萨胜行。三疾证无上正等菩提。五者灌顶法门得二胜果。六者如来智印金刚法门得五胜果。七者离诸戏论轮字法门得二胜果。八者入广大轮平等性法门得二胜果。九者真净<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>无上法门得二胜果。十者能善调伏智藏法门得六种果。十一者性平等性最胜法门得三胜果。十二者一切有情住持遍满胜藏法门得二胜果。十三者无边无际究竟理趣金刚法门得三胜果。十四者甚深理趣最胜法门。能受持者有十八胜德。一一切障灭。二随心所欲无不成辨。三是诸佛母。四能诵持者一切罪灭。五常见诸佛。六得宿住智。七若有情类未多佛所植众善根。久发大愿。于此般若波罗蜜多甚深理趣最胜法门不能听闻书写读诵供养恭敬思惟修习。要多佛所植众善根。久发大愿。乃能于此甚深理趣最胜法门。下至听闻一句一字。况能具足读诵受持。八若诸有情供养恭敬尊重赞叹八十殑伽沙等俱胝那庾多佛。乃能具足闻此般若波罗蜜多甚深理趣。乃至十三诸天常随拥护。十四终不横死。十五不枉遭衰患。十六诸佛菩萨常共护持令一切时善增恶减。十七于诸佛土随愿<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。十八乃至菩提不堕恶趣。诸有情类受持此经定获无边胜利功德。我今略说如是少分</p><p>四释经本文者</p><p>经曰。如是我闻</p><p>述曰。于此经中略有三分。初从如是乃至圆满清白梵行。是序分也。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>为诸菩萨说一切法甚深微妙乃至略说如是少分。是正宗分也。时薄伽梵乃至奉行。是<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分也。佛地三名科。与古来别如彼论说。今解三别。一文前由致述分。二应机广说分。三感悟<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>分。此之三科今古名字随义应悉。就初分中依天亲菩萨灯论偈中分之为六。彼云。前三明<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>后三证师说。第一如是弟子之信。如是之言今说不虚。第二我闻显非传受。第三一时闻法有时也。智度论云。说时方人令生信故。四主五处六机。今依佛地论初分有五。一总显已闻。如是我闻。二时三主四处五机。今依此经开之为六。前五如佛地。第六叹法有十胜德。宣说正法初中后善等。然此序述<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>安置亦是佛说。集法经云。阿难问四事。以何为师依何法住。如何治恶性经首置何言。佛言戒能训诲可以为师。念处破倒依之而住。梵法默伏彼恶人。一切经初皆标六事。初是正行次是正解后辨治障修解行之缘。然此三门必依圣教故。但四问不减不增。智度论云。阿[少/兔]楼驮教阿难请四事。大悲经说优波离教。今谓二人同教。又广明结集<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。如别抄记。<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>云。微细律明。阿难升座出法藏时。身如诸佛具诸相好。今勘集藏传亦作此说。下座之时复本之形。众疑有三。一疑佛慈悲从涅槃起更说妙法。二疑有佛从他方来住此说法。三疑阿难转身<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>为众说法。故经初言如是我闻。为令生信。言如是者法花注云。如是<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>之瑞。如以顺机受名。是以无非立称。众生以无非为感。如来以顺机为应。传经者以名教出于感应故云如是。此应肇公解也。又注无量义经言。至人说法但为显如。唯如为是故言如是。瑶公云。以离五谤名为如是。前四句离增益等谤。第五如是此经<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>非非有非非无名戏论谤。第四句名愚痴谤。光宅云。如是将传所闻。前题举一部也。如是一部经义我亲从佛闻。即为我闻作呼彻也。梁武帝云。如是如斯之言是佛所说故言如是。上来五解并是吉藏法师之所引也。真谛及长耳皆云。如是有三。一就佛。三世诸佛共说不异名如。以同说故称是。由斯可信以同说故。二就理明。诸法实相古今不异故名为如。如如而说故称为是。既称理言不增不减决定可信故称如是。三就人。以阿难望佛教所传不异故名为如。无非曰是。此上三解净法师等之所引也。又解。如是之言标一部之玄宗即真俗二谛。真为如俗为是。欲显所诠不异二故。又所言顺理曰如。遮其虚妄为是。又显诠于二智教为二智之因。如所有性为如尽所有性为是。故下云一切智道相智一切相智是也。又标福智显是二严之因福为如智为是也。又教顺于理曰如依教修行为是。又境为如智为是。所乘能乘实相观照以标首也。又如是者吉祥词也。欲显经首皆致此言。异外道等一切经初置阿忧二字。又如是者指斥词也。指下一部之所明也。上来八解皆此方先德之所传释。又如是言依四义转。一依譬喻。如有说言如是富贵如毗沙门。如是所传所闻之法如佛所说。定为利乐方便之因。或当所说如是文句如我昔闻。二依教诲。如有说言汝当如是读诵经论。此中如是远即佛之教诲。近即传法者之教诲也或告时众如是当听我昔所闻。三依问答。如是我闻如是演说。谓有问言。汝当所说昔定闻耶。故此答言如是我闻。四依许可如有说言我当为汝如是而思如是而作如是而说。谓结集时诸菩萨众咸共请言。如汝所闻当如是说。传法菩萨便许可言。如是当说如我所闻。或信可言。是事如是。谓如是法我昔曾闻。此事如是齐此当说定无有异。上来四解并佛地论亲光菩萨等解。又如是者信顺之辞。故智度论云。如是我闻生信也信受奉行生智也。信为能入智为能度。信为入法之初基智为究竟之玄术。信即所言之理顺。顺即师资之道成。由信故所说之法皆可顺从。由顺故说听。二徒师资建立。于此信中略为十释所。以须初令生信。一成唯识云。信如水清珠能清浊水。能治不信自性浑浊。所以兵食信三信不可弃。二瑜伽云。信为欲依欲为精进依。故入一切法欲为根本。作意所生触所集起受所引摄。定为增上慧为最胜解脱为坚固。出离为后边信既为欲依。所以初说。三<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>法者如大龙象以信为手。以舍为牙以念为颈以慧为头。于其两肩担集善法。此乃大毗婆沙说也。四法为诸佛手信为众生手。故俱舍言拔众生出生死泥也。正宗既为佛手。序分生信则为众生手。两手相接故登彼岸出生死泥。次下两解最胜军王经意。五泛大溟海假手以行舟渡生死河须信以发慧。六游大旷野以手持杖捍御群贼游生死原以其信手持<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>刀御烦恼贼。七见珍财宝手以采拾。闻法宝假信而方得。八信为圣财之初故初令起。显扬云。七圣财者谓信戒闻舍慧惭愧。故初令生信也。九信者趣圣位之梯橙故四十心以信为初有信根信力。有信根故万善因此而生。有信力故四魔不能屈伏。十诸论云。信者能越恶道离贫贱因。故有四不坏信。由斯义故一切经初置如是言为令生信。言我闻者传法菩萨自指己身。言如是法亲从佛闻故名我闻。我谓于诸蕴世俗之假者。然我有三。一妄所执我。谓诸外道及诸异生所横计我。或同<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>或如芥子。二假施设我谓常乐我净随引二乘于<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>中施设为我。令舍无我小乘之果。谓如经言诸佛或说我或时说无我。诸法实相中无我无非我。谓为声闻说<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>等除凡夫时所计四倒。说无有情我但法有因。故后为菩萨说常乐等。除二乘时所起四失。由此诸法本性皆离我无我等说为常我。故假设也。三世流布我。谓世共传张王等姓天授等名世流之我。今传法者随顺世间自指之言称之为我。不同前二。非妄执故非假施设。然体即是无我之我也。问诸佛说法本除<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>何故阿难不称名字乃称于我。答以理而言亦应称字。略有三义但总称我。一示不乖俗。宗虽显<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>不乖俗。虽无有我仍立我名欲显真谛不离俗故。二我者主宰自在之义。阿难多闻闻持其闻积集。三慧齐备文义并持。于圣教中总持自在。若称阿难闻如是法虽指己体无于法中得自在义。欲显于法自在义成故称我闻不称庆喜。三我者亲义。世间共言我见闻此将为亲证。若但总称言阿难闻或非亲闻从他传受。今显亲闻世尊所说非他传闻故称我也。由此三义不称庆喜但总曰我闻。闻者谓即耳根发识听受所说。今废耳别就我总称故名我闻。诸部计闻说各不等。今依大乘根识心所境至和合方名为闻。然根五义胜于识等故名为闻。对法及龙树皆作此说。若但闻声即唯在耳。通缘名等亦在意中。由此唯意独应名闻。故瑜伽言。闻谓比量。耳名闻者亲闻于声与意为门。而闻教者由耳闻。故因闻所成总名为闻。因耳而得故耳名闻。然耳不能亲取诸法差别名等。如闻所成地从方便说。因闻成法并名耳闻。如观第二月见旋火轮等。如毗留离王为杀诸释种语皆唯<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。自耳不缘故。问阿难于时亲见佛说亦亲觉知佛说。何故不言如是我见我觉我知。但言我闻。答有三义。一欲证深理欲悟所诠要依闻教。见觉知等非初达理。虽亦实见等但得言我闻。二<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>以音声为佛事。欲显异于诸佛国土故但言闻。诸余佛土或以光明妙香味等为佛事者。经首亦得言我见觉知等。今显异彼故但言闻。三欲显智觉菩提要因熏习方得。若不听闻正法三慧无由得生。故经首言闻。令熏习增长有漏无漏。递相增长能生出世世间果等。故但言闻。问大般若等佛自说言。我从成道终至涅槃于其中间不说一字。何故庆喜谤佛说法自称我闻。又升摄波叶喻经言。已所说法如手中叶。未所说法如林中叶。明佛说法今言我闻复言不说一何乖返。答曰。佛地论说。有义如来慈悲本愿增上缘力闻者识上文义相生。此文义相虽亲依自善根力起而就强缘名为佛说。由耳根力自心变现故名我闻。此师意说。佛有三法谓定智悲。三法为体实不说法。由本因中愿利生故大悲恒起。众生久修遇佛善业。今时成熟。自识心上闻佛说法变似教生。而实不说。如曾参之母啮指曾参心痛知母唤而还。母实无言但有念子之意。风云相感其子心疼变似母唤之相。急归果如所说。今佛如母众生喻参。有言无言其类相似。亦如女人请<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>说法。比丘私去。实不为说。女人得道。言由比丘之恩。以比丘为增上缘。心厌生死遂得<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。众生以佛为增上缘。自心变似三乘教起。从强缘论名为佛说。佛实无言。此言我闻其义亦尔。有义闻者善根本愿增上缘力如来识上文义相生。此文义相是佛利他善根所起名为佛说。闻者识心虽不亲得然似彼相分明显说。故名我闻。此师意说。佛有<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>十八界等。实有说法利他事业。虽无分利不起攀缘任运恒时随机说法作大利乐。如末尼珠及天帝鼓虽无有心为雨众宝。及为天帝有说不说。天帝善业感彼力故鼓任运鸣。天帝闻之而自严警。今佛亦尔。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>分别说与不说。众生善业闻法因熟如来任运现说<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。此中说法譬如幻人为幻人说法。名字性离无有文字。是即解脱。非如妄执名定属法实有能说能听所说故佛说言不说一字。夫说法者无说无示等。若如幻士为幻人说即是非无。故经说言说法非有亦非无。待因缘故诸法立也。佛既说法庆喜亲闻。故名我闻。此中二解。初是龙军无性等一类师解。后是护法亲光一师之义。应知说此如是我闻意避增减异分过失。谓如是法我从佛闻。非他展转。显示闻者有所堪能。诸有所闻皆离增减异分过失。非如愚夫无所堪能。诸有所闻或不能离增减异分。结集法时传佛教者依如来教初说此言。为令众生恭敬信受言。如是法我从佛闻。文义决定无所增减。是故闻者应正闻已如理思惟常勤修学</p><p>经曰。一时</p><p>述曰。第二明说教时分。即化辰也。法王启化之日大众嘉会之时。此就<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>相续无断说听究竟。随其分位总名一时。不尔字等说听时异。云何名一。此中不定约刹那。亦不定约相续。亦不定约四时八时及十二时并成道竟若干时节名为一时。但是说听二徒共相会遇。说听究竟总名一时。由能说者得陀罗尼说一字。时于余一切悉已演说。或能听者得净耳根解一字。时于余一切悉能解了。或能说者经多刹那或复多劫。其能听者亦或乃至多劫听闻。故不可定一念多劫之时节也。由于一会听者之机有利有钝。如来神力延短念为长劫。促长劫为短劫。时分别故论有二解。一者此时有为法上分位假立。谓道理时。说听之人五蕴诸行刹那生灭无定时体。有酬前引后现在假法。即说所酬所引之法假名过去及现在世。听说二徒五蕴假法事绪究竟假说为时。故总名一时。如算师等以一算子经历诸位名为一十百千万等。其实一物横竖不同得名有异。此说听者现五蕴法曾有名过去。当有名未来。现有名现在。即名为时说为三世。今此三世事绪究竟总名一时。二者此时说听二徒识心之上变作行相。三时体起。即是世识。谓是一念或复多劫事绪究竟假名一时。如人梦中梦见多生生死谓三世迁流。觉竟但有一虚妄心知无三世。今以理说时体亦尔。但有妄心变似三世。事绪究竟总名一时。由义说故唯意所缘行蕴.法处.法界所摄。何不别说十二时等。如净秽处昼夜时分诸方不定。处则方定故于时中但总言一。问。处中有净秽不定但说一。诸方时不同何妨亦定说。凡夫见秽处知圣居<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。何不别论。此时说准余知别时。答或一刹那或复多劫不可定说。准不解故。由是总相但言一时。其延促劫量或唯识。以促延或所执。以双泯或依他。以妄法或实性。以平等或圣力。以加持故有延促。无劳疑惑。义准应释</p><p>经曰。薄伽梵</p><p>述曰。自下第三别说教主。欲叹法出胜人其法必胜。显教主中有二。初标名后叹德。此标名也。古名婆伽婆义当世尊之号。然义犹阙所以不翻。汉无此言也。瑜伽第八十三卷云。坦然安坐妙菩提座任运摧灭一切魔军。大势力故名薄伽梵。佛地论言谓。薄伽声依六义转。自在炽盛与端严名称吉祥及尊贵。如是六种义差别应知总名为薄伽。此中意说若有为此薄伽声目必具此德。如是一切如来具有于一切种皆不能离。是故如来名薄伽梵。谓诸如来永不系属诸烦恼故具自在义。炎猛智火所烧练故具炽盛义。妙三十二大丈夫相所庄饰故具端严义。一切殊胜功德圆满无不知故具名称义。一切世间亲近供养咸称赞故具吉祥义。具一切德常起方便。利益安乐一切有情无懈疲故具尊贵义。或能破坏四魔怨故名薄伽梵。四魔怨者谓。烦恼.蕴.死.自在天魔。破诸有情所修善等名之为魔。入第三劫破烦恼死魔。将至金刚心取破其天魔。解脱道起破其蕴魔。若论其相金刚心时破烦恼魔。菩提树下破自在天魔。舍第五分寿入无余灭破其蕴魔。更留三月破其死魔。若其实义恼乱菩萨皆名烦恼。<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>俱是。金刚心起永破烦恼魔。二障种有故解脱道起永破蕴死二魔。此依二死作论。其伏天魔不见文说。今依一义。十信菩萨八相成道已应伏天魔。或十住第六心始伏天魔。是中永离生死出三界故可伏天魔。或入初地即伏天魔。佛地论初地已上离粗四魔。随情取舍。故破四魔名薄伽梵。问佛具十号。何故经首佛教庆喜说此名也。答由此一名世咸尊重故诸外道皆称本师名薄伽梵。又此一名总摄众德余名不尔。是故经首皆置此名。然诸经首虽标教主然各不同。且如新译称赞大乘功德经。住法界藏诸佛所行众宝庄严大功德殿法性土中即法身说。其佛地经处最胜光耀七宝庄严。乃至广说大宝花王之所建立大宫殿中。十八圆满净土之中报身所说。其此经首虽彰佛实德然稍异余经。所居即在他化自在天王宫中末尼殿内。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>所说。然法性土虽唯佛居标德严花菩萨亦在彼会。其净土中虽但菩萨经中亦说有诸天龙。此经虽但说他化宫列众但标十地圆满诸大菩萨。此等总明一质异见。金刚论说。应化非真佛亦非说法者。说法不二取无说离言相。推功归本以法身为身。余身非身。法身为说二说非说。体依聚义总名为身。法身总为身说之依身说之本。二身方起非是常身及非常说般若但以法性为宗。意在亡相。二身二说皆有相故名非身说。实此二身亦有身说。欲显大乘名义深远证二空理方能知说。故假妙土以显经深。法性土中言说称赞大乘功德经。理实严花但居净土不居法性土。法性土中无身无说。菩萨何由有听闻等。又为显正智内证真空名居法性土。后智起悲化名居净土等。亦无过失。天龙八部见居化土。其佛地经欲显十八圆满净土之相。所说五法如来实德。寄净土说以显经深。其实菩萨正智契真亦居法性。天龙闻法亦居化土。其此般若观照证实相。一切菩萨及与如来亡相为本。实皆居法性身现居净土。然显悲深慈厚叹报身之德。言居化土而说。其听法者亦但标胜人与佛实德相称。寄化土以彰。别意如下当说。今言薄伽梵随应当说。即显三身皆能说法徒众皆有住三土义。唯标报身之德。然则不见经文居自报土说。由此应准佛德及处以知佛土。今此薄伽梵准下别德。即报身实德所居之处。即是化土彰胜身以显法胜。举化处以显经深。欲显悲智皆是事法修生。不言法性之身土也</p><p>经曰。(一)妙善成就一切如来金刚住持平等性智种种希有殊胜功德。(二)已能善获一切如来灌顶宝冠超过三界。(三)已能善得一切如来遍金刚智大观自在。(四)已得圆满一切如来决定诸法大妙智印。(五)已善圆证一切如来毕竟空寂平等性印。(六)于诸能作所作事业皆得善巧成辨无余。(七)一切有情种种希愿随其无罪皆能满足。(八)已善安住三世平等常无断尽广大遍照。(九)身语心性犹若金刚等诸如来无动无坏</p><p>述曰。此中九句叹如来德。依诸经论略为三释。第一且依此经文解。其第一句总叹如来兼以下德。余之八句别叹如来列诸德异。然下正宗有十四段以显世尊十四实德。今此初句总标众德余句别属功德法门。金刚住持平等性智者举次第二灌顶宝冠超过三界德。即是十四段中第三段。调伏众恶普胜法门。亦是第五法王灌顶智藏法门之所显也。举下一德二种法门。其种种希有殊胜功德者。总指余七句所有胜德。余十二段所有法门。不可一一具足烈故。此总解已。别解释者妙者功德微细故。善者非佛不恻故。又内道不了名妙外道不知名善。又智深难测名妙福细叵识为善。言成就者自在任运能现前义。又克获圆满名为成就。一切如来者欲显佛德诸佛共故。由此共故佛德可尊。是真实德梵云达他揭多。古云多陀阿伽度。此云如来。菩萨地说言。无虚妄故名如来。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。如过去佛说契经等不变改故名之为如。从波罗蜜三十七品十一空来至涅槃故名为来。此意说言。如诸佛等而说妙法。从修万行来至涅槃故言不虚。是如来义。又言不虚常行谛语来至佛位故名如来。瑜伽论云。十号之中初是总序。若住生死由行妙行去至佛位名苏揭多。号为善逝。古云修伽陀也。若住彼岸因如成<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>曰如来。一揭多言义通来去。如言蜜多通离到义。此亦如是。金刚者喻也。平等性智能调众恶降伏烦恼普胜一切名曰金刚。如于金刚能摧坏故。言住持者至法王位能为一切三界胜主。世间所有胜法皆是此智之所住持。令其不坏名住。助其生长名持。又此平等智是诸智藏。一切福智以此为因。此能住持一切佛德能灭诸惑名金刚住持。此是平等性智之作用也。内能住持外能摧坏。平等性智者非是四智中第二平等性智也。毕竟空寂平等法性能证之智名平等性智。即无分别智正能断惑为无间道。犹若金刚即妙观智中之正智也。若为住持众德之本。为能摧坏之根本。智即圆镜中平等性智。若能摧坏着生死涅槃住无所住。即第七识所成平等性智。若能摧坏二乘异生一切烦恼住于慈悲利他功德。即成所作平等性智。今以正义即诸智中随其所应证性平等。皆能坏分别及二障等。诸德之本名为金刚住持平等性智。一切菩萨根本所求如灌顶位之宝冠也。性是无漏。离三界系永无分别。此牒次下第一德已。余德非一名为种种。无始未得名为希有。唯佛乃成故名殊胜。积力道成名为功德。此总含下。下自当知。第二句云。已能善获一切如来灌顶宝冠超过三界者。即下十四段中第三调伏众恶普胜法门。及第五灌顶智藏法门所显。下经解言。若以世间灌顶位施当得出世灌顶位果。西域世间刹帝利种太子。将受帝王之位先请有德<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>等以为师傅。乘千里象取四大海水。以吉祥茅沾彼海水。洒太子顶令其净洁。作大吉祥四方归伏方受王位。古翻经云刹利水浇头王。今新翻云刹帝利种灌顶大王。王身必是刹帝利种。请婆罗门以为师傅灌其头顶。以婆罗门性修梵行净戒之族故。刹帝利请灌其顶。此乃效习受法王位之仪式也。谓第十地究竟菩萨生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>上大自在宫。莲华台中将起金刚定受佛之位。胜诸菩萨菩萨中尊。佛之长子名为太子。十方诸佛是其师傅。各舒慧手及右臂手以三世佛清净法水灌洒其顶。顶谓心首及其头首。除无始来二障垢秽有漏染污遍满清净无漏洁白殊胜法王位。如世太子既灌顶已将受王位。戴王之冠着王之服处王之殿。佛法太子亦复如是。将受法王法主之位戴佛之冠。谓一切智一切种智。是<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>首所戴持故。即是观照波罗蜜多。此功德法真实珍宝。七圣财中名为慧财。故此冠冤名为宝冠。服二际佛功德法衣即是惭愧柔和忍辱之上衣也。此智慧冠是大智藏。一切善法因此生故处十方佛空寂宝殿。由戴如是冠衣等故。无始恶友以烦恼水浇其心顶。生死心首所戴愚痴丑恶冠冤。生死所著无惭无愧刚强佷戾嗔恚恶服。悉得消灭永为弃舍。永更不入三界牢狱。故名降伏众恶普胜法门。亦名灌顶智藏法门。由如是故为三界主出诸有漏生死系缚超三界也。自体无漏名为遍也。故下经云。若以世间灌顶位施当得出世法王位果。第三句云遍金刚智大观自在者。即下十四段中第十二一切有情住持遍满胜藏法门。谓佛具证一切有情皆如来藏。普贤菩萨自体遍故。能证如来藏遍诸有情。此能证智名遍金刚智。摧灭生死一切障故。然由悲故观诸有情身语心行。可济拔者应时为现。故诸有情皆金刚藏。以金刚藏所灌洒故皆正法藏。一切皆随正语转故皆妙业藏。一切事业加行依故。由观有情而起三业故曰观自在。于求念者如应利乐无失时处<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>等。故大观自在。如龟兹国圣苾刍尼所现事也。第四句云决定诸法大妙智印者。即下十四段中第二寂静法性般若理趣现等觉门。总一切法不过有二。一智二境。智谓金刚智。境谓一切法。又有二种一能诠二所诠。能诠谓法。所诠谓义。今显世尊于二二种诸法之中决定悟解无有疑惑。能知此智名大妙智印。此智印定二二种法。离诸疑网非凡愚所测名之为妙。神用难思复名为大。即观有智印定诸法无疑惑也。第五句云一切如来毕竟空寂平等性印者。即下十四段中五法门也。第一一切诸法甚深微妙清净法门。第四平等智印清净法门。第七离诸戏论轮字法门。第八入广大轮平等性法门。第十一性平等性最胜法门。谓昔<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>计诸法有。今离妄想计执永除。所执既无所证亦满。诸妄永弃名为清净。此诸妄想毕竟体空。世出世间染净等法无不空寂。空寂之体性即真如。即一切法平等之性。此理决定遍诸法中名之为印。佛得此如一切圆满故名善证。然中边论解二十空中毕竟空云。为于有情常作<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>而观空故名毕竟空。此意说言。为有情故别观于空或观所为有情为空。此观有情等毕竟不可得毕竟即空名毕竟空。此毕竟空寂一切有情一切法中皆悉平等。是诸人法平等之性印定诸法定毕竟空。若计所执若二空理皆毕竟空故。此解即是第一一切法甚深微妙清净法门之大义也。自余四门准下应悉。恐文繁广故不并释。第六句云于诸能作所作事业皆得善巧成办无余者。当下十四段中第十能善调伏智藏法门之所显德。所调伏者谓诸缠垢忿恚等过。谓佛世尊自能调伏忿恚等过。亦能调伏一切有情缠垢等失。随其大小<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>事缘起缠垢等。如来善巧皆能调伏。成辨此智一切皆尽更无遗余。故佛世尊自智圆满伏众恶患。亦能调伏诸有情等缠垢等患。亦令乃至得佛菩提。是名善巧成辨无余。但是能伏诸缠垢等。所有方便皆悉成辨故言善巧成辨无余。智慧善巧名能作事业。所伏忿等名所作事业。又智慧方便名能作事。其所调伏身语意业令离缠垢名所作事。此叹世尊具智方便善能调伏自他忿等一切无余。第七句云一切有情种种希愿随其无罪皆能满足者。显下十四段中第十四甚深理趣最胜法门。谓佛世尊由具般若波罗蜜多方便善巧成立胜智。善辨一切清净事业能令诸有皆得清净。又以贪等调伏世间。普遍恒时乃至诸有皆令清净。自然调伏。又大贪等能得清净大乐大财。三界自在常能坚固。饶益有情由斯陀罗尼。以隐密言词说其神咒。能受持者一切障灭。随心所欲无不成辨。乃至广说若离烦恼恶业。诸愿世出世间若今若后。由无罪故悉能满足。若起烦恼恶业根本由有罪故。如是诸愿皆不与之。故说世尊不夺有情一切诸愿。然不皆与。要除无罪若起烦恼及起恶愿虽有至诚亦定不与。如如意珠所发善愿一切皆得。第八句云已善安住三世平等。常无断尽广大遍照者。显下十四段中第十三段无边无际究竟理趣金刚法门。此意总显般若波罗蜜多。若体若用弘广深远不异最胜 是故如来无边无际一味究竟。能观般若体用广大所以无边。能遍照故所以无际。由无断故所以一味。由无尽故所以最胜。故能观智妙知三世。知过未世犹如现在名为平等。又观照智无边无际一味究竟。能观三世若理若事。事事分明皆善了达故名平等。其理一相亦名平等。若理若事皆能了达。故平等言通其理事。常无断尽。广大遍照智之用也。善安住者能观之智妙达三际名善安住。理事之中皆无谬乱名善安住。于一切时智用遍了是此意也。第九句云身语心性犹若金刚。等诸如来无动无坏者。显下十四段中第六段如来智印金刚法门。显第九段真净供养无上法门。佛具摄受一切如来金刚身印能证一切佛之法身具摄诸佛金刚语印于一切法得自在转。具摄诸佛金刚心印于一切定当得自在。具摄诸佛金刚智印能得无上妙身语心。犹如金刚。无动无坏不为烦恼之所鼓动。不为外道魔王破坏。令其三业有所动坏。以佛三业智为前导。离诸过失。不可破坏令起过失。故无动坏。无动坏者与一切佛功德无差。故名为等。等诸如来即上诸门所说一切如来之妙义也。此如金刚不可动坏。殊胜三业。由昔因中如法三业供养诸佛为法供养故至佛位。得是果也。真净供养所得报故不可动坏。或此三业非外道恶友所动。非天魔邪朋所坏故。犹若金刚。破灭生死所有三业。三业性者即三业体。更无他义。此中九句显佛世尊下十四段经所显功德。今叹佛德欲令众生知佛具德起殷重心。敬受所说或闻此已当发胜心。欣求<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。或显世尊具此诸德超过一切。是故所说甚深理趣最为殊胜可依修学。第二又解。依诸经中说佛具有二十一德。别配此等九句。经文金刚住持平等性智者。谓佛不二现行一向无障殊胜功德。及显逮得一切佛平等性。得一切佛相似事业殊胜功德。如是一句总显二德。谓佛世尊离诸凡夫现行生死起诸杂染住着生死。离二乘者现行涅槃一向弃背利乐他事。住着涅槃。世尊无彼现行二障。是故说名不二现行。悲智遍故生死涅槃二俱不住故名平等。能破此二障故假喻金刚。住无所住无住涅槃故名住持。住持悲智故又逮得一切佛平等性。谓所证理等能证智等所成身等。意业悲行悉皆平等。由此平等能坏生死故名金刚。平等为依能持众德故名住持。今但举一。此等甚多故名种种殊胜功德。经第二句云灌顶宝冠超过三界即佛<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。一者一切菩萨正所求智。二者极于法界。三者所行无碍。此中初句成就佛种不断方便殊胜功德。谓诸菩萨为令佛种无断绝故勤修加行非二乘等。是故佛智唯诸菩萨正所应求。由此灌顶法王子位唯第十地。着佛宝冠绍佛之位。非二乘等。谓令众生求听般若甚深经典拟成种觉。亦是绍继法王之位。是故若障破灭众生不令修学般若经典。即为断绝诸佛种子。此第二句证得果相殊胜功德。谓得穷极清净法界。此净法界<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之果。观照心中常现前。故喻于头上所戴宝冠。宝冠即是身之上饰。法界亦是功德根本。故喻宝冠。此第三句降伏魔怨殊胜功德。谓所<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>即色等境。此所行境扰乱心故障碍善。故说名魔怨。诸佛世尊心善安住极悦意境。亦不能乱。所有功德极善成满。一切恶境不能为碍。以能摧伏一切境界。一切所行不能拘碍离系缚法。故至佛位超过三界。此第二句世尊之德。无始不成今时始得名之为获。第三句云遍金刚智大观自在即佛三德。一不可转法。二住于佛住。三于一切行成就大觉。此中初句降伏外道殊胜功德。谓佛正法一切外道不能退转。降伏彼已显自正道。以由成就遍金刚智说甚深法降伏外道。又由成就遍诸法智。能说深法降诸外道。故说此智喻若金刚。言遍智者遍解诸法一切智也。此第二句观所化生殊胜功德。谓住大悲昼夜六时观世间故。此第三句于一切乘所化有情。能随所应示现自身殊胜功德。谓遍了知一切有情性行差别。如其所应现自身。故大观自在。若观有情心行差别不自在者。不能随类即现其身。由此既能随应现者。故知佛具遍智大观自在故也。又初句言遍金刚智是二十一功德之智总句最清净觉。谓于一切有为无为所应觉境正开觉故。净妙圆满正开觉故。又于如所有性尽所有性正开觉故名遍金刚智。此中二德今显创圆名之为得。第四句云决定诸法大妙智印者。此智十地分已得之。今显满也。显二种德。一于一切法智无疑滞。二于诸法智无有疑惑。此中初句断一切疑殊胜功德。谓于诸法已得能除一切疑惑决定智。故此第二句妙善了达一切法智。能随所应恒正教诲殊胜功德。谓于诸法怀疑惑者。无有力能随应教诲。唯佛世尊证见诸法。智善决定。能随所应无倒教诲无休废。故若于诸法不决定者理即不然。又得三法印诸行无常有为别印。涅槃寂静无为别印。诸法无我二法遍印。此三妙理印定诸法。称之为印。佛得此智名为智印。第五句云毕竟空寂平等性印者显二种德。一得佛无二住胜彼岸。二证无中边佛地平等。此中初句自性身分殊胜功德。佛无二住即是法身真如为体无差别相。于中一切二相分别皆不现行。缘彼胜定常住其中。故名为住。即无二住名胜彼岸。佛已穷到故名为得。此之法身诸佛共有平等之性。要除二我。观二我空寂方始圆证。此第二句证真如相殊胜功德。谓真如相远离一切有为无为中边相故。远离方处中边相故。即是佛地平等法性。由证此故遍知诸法。于中不染。此真如理印于诸法。契毕竟空。方能证会佛皆圆证。第六句云于诸能作所作事业皆得善巧成辨无余者。此显世尊二种功德。一其身流布一切世界。二其所成立不可思议。此中第一句现从睹史多天宫来下殊胜功德。谓现化身普于一切世界洲渚同时流下入母胎故。谓即八相示现成道。此即世尊能作事业皆得善巧 化身既尔他报身等随应化现理亦如是。此第二句安立法教殊胜功德。谓佛安立一切法教超过一切寻思境故。是则名为所作事业皆得善巧。三劫修因本为有情。现身说法作大利乐。今既圆满故名善巧成辨无余。第七句云一切有情种种希愿随其无罪皆能满足。此显世尊二种功德。一趣<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>法。二不相间杂。如来解脱妙智究竟。此中初句调伏方便殊胜功德。无相法者即是涅槃。佛善了知三乘有情随彼堪能调伏方便。如实为说令彼趣证无相法故。此意说言一切有情求出生死皆得涅槃。三乘妙愿由无罪故佛皆能满。此第二句受用身分殊胜功德。谓受用身不相间杂。一切如来受用身体各各别故。如来妙智能令一切有情解脱故。言如来解脱妙智。佛于此智已得究竟。如来此智不相间杂。于净佛土现受用身。亦不相杂。大集会中现种种身。与诸菩萨受用法乐。亦不相杂。如来于此智所现身亦到究竟。此意即显如来之智及所现身已得究竟。随诸有情一切无罪所乐所愿。皆能为现方便拔济令离生死。故名满足。第八句云已善安住三世平等常无断尽广大遍照。此显世尊三种功德。一游于三世平等法性。二尽虚空性。三穷未来际。此中初句记别三世殊胜功德。谓如现在记别过去未来世事皆无碍。故谓记般若于东北方最后兴盛最初灭之。乃至正法灭尽时事。于瞻波国记法当灭。如正法灭经当广说相。又记菩提树边二石菩萨身若灭尽正法当灭。今没至胸事可验矣。记阿输迦为轮王事即其证也。此后二句自利利他二德无尽殊胜功德。谓如虚空经成坏劫性常无尽。如来一切真实功德亦复如是常无断尽如未来际无有尽期。利他功德亦复如是。穷未来际常作一切有情利益安乐事。故广大遍照。即无断尽真实功德之照用也。第九句云身语心性犹若金刚等诸如来无动无坏者。此显世尊二种功德。一到无障处。二凡所现身不可分别。此中初句已修一切障结对治殊胜功德。谓已修习一切二障对治圣道。已到解脱一切障处。所依所趣故名为处。由此如来所有三业皆善无漏。犹如金刚以一切佛非余动坏。此第二句能正摄受无染自身殊胜功德。谓佛自身非是虚妄分别所起。无烦恼业生杂染故。以如来身非 杂染分别起故。不可分别故。佛三业由离过失犹若金刚不可动坏。等一切佛。此中九句文义开合总叹二十一德。此中且依佛地初释。恐文繁广不录后师。摄大乘等随应广说。不能一一。第三又解。此九句经初四句叹报身。第一句总叹四智微圆报身实德不论法界。第二句叹道胜位尊。第三句叹悲深智遍二果齐圆。第四句叹慧广智德。总印一切有空事理。证不谬故。第五句叹照寂断德。此叹法身。下四句叹化身。第六句叹成巧恩德。第七句总叹神通轮能满胜愿。第八句叹记心轮能为说法。第九句叹漏尽轮能现离染教诫教授。第一句总叹四智微圆报身实德中。言金刚者总喻四智所依真如。性能摧坏并名金刚。非皆正有摧坏事用。言住持者圆镜智也。即是证于金刚真如之住持者。此为世出世间众善之本。又为余智之根本。故名为住持。依佛地经有九圆镜喻。一如依圆镜众像影现。喻如来智镜诸处.境.识.众像影现故由此名为一切智者。故<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>诸德此能住持。又由镜智自余相续出世世善诸处.境.识皆依镜智而得生。故名为住持。二又如圆镜无动无摇。众生观察自身得失。为欲存德舍诸失。喻如来镜智悬法界幢无间断故无所动摇。无数众生观于染净为欲存净舍诸染故。三如镜善鉴鉴净无垢光明遍照。喻如来镜智离二障垢。极善磨莹为定摄持。鉴净无垢作大利乐事名光明遍照。四如镜依缘本质种种影相生起。喻如来镜智恒依缘故智影相生。五如镜周莹其面于一切处为诸影像遍起依缘。喻如来镜智不断。无量众善行莹为诸三乘智影依缘。六如镜大地大山宫舍大影可得。而镜不等大影之量。喻如来镜智十地影现。世出世善一切影现而智不同彼之分量。七又如圆镜非处障质影像起缘。喻如来镜智非恶友摄闻不正法障碍众生智影起缘彼非器故。八又如圆镜非处闇质影像起缘。喻如来镜智非处乐恶愚昧众生智影起缘。彼非器故。愚昧重故虽有三宝良田生长一切善法。不欲听受不乐归依返信外道。岂非愚痴尤重覆蔽。故云非器。九又如圆镜非处远质影像起缘。喻如来智镜非处不净感匮法业。不信众生智影起缘。彼非器故。由前身中诽谤正法经<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>不闻正法自业障故。或由无性不信因缘非圣法器故非彼缘。由此九喻随其所应与自他身.有性无性.世出世善为因缘故名为住持。平等性者谓十平等。一诸相增上喜爱平等法性。谓于相好生喜爱故今证法性悉皆平等。二一切领受缘起平等法性谓内外缘起。三远离异相非相平等法性。色等诸法变坏等相不相似故名为异相。远离各别异相即是共相。如是共相以非相为相即法平等性。故经说言。一切诸法皆同一相。所谓非相。四弘济大慈平等法性。慈有三种一有情缘。缘有情为境初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>菩萨修。二法缘。缘正法为境。修正行菩萨多分修。缘教生故。三<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。缘真如为境。无生忍菩萨多修。此慈虽有所缘缘法界故亦名无缘。无分别故。佛皆具有平等福业。长时无间殷重无余。故名弘济。五无待大悲平等法性。二乘之悲不拔一切唯拔欲界暂时而转。如来普拔遍缘三界恒时而转无所观待。恒救不舍能拔三苦所苦有情。等如一子不生分别。此子非子及拔不拔。如来证得大菩提已恒作是念。我常安立一切有情诸善根本。若未悟者我当开悟。此亦三种准慈应说。六随诸众生所乐示现平等法性。如来虽居无戏论位由平等智增上力故大圆镜智相应净识现琉璃等微妙色身。令诸有情善根成就自心变似如是身相。谓自心外见如来身。七一切有情敬受所说平等法性。随众生乐如是语业发生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。如来即现由悲愿故说必称机不虚捐也。虽有众生不顺佛语此是化作或当有益后必信受。八世间寂静皆同一味平等法性。有漏五蕴名为世间即彼息灭名为寂静。生死涅槃二俱平等故名一味。又所执世间本性无故名为寂静。此即显如无差别故名为一味。九世间诸法苦乐一味平等法性。世间有八谓利.衰.毁.誉.称.讥.苦.乐。得可意事名利。失可意事名衰。不现诽拨名毁。不现赞美名誉。现前赞美名称。现前诽拨名讥。逼恼身心名苦。适悦身心名乐。圣者居中恒常一味得利不高遇衰不下。乃至遇苦无患得乐无爱。应如虚空平等一味。十修植无量功德究竟平等法性。功德即是菩提分等熏种长养成熟解脱名为修植。具此十德名平等性智。又有二平等。谓一切有情平等。诸佛平等。如摄大乘等解。转第七得。因昔有我此彼不等。今离我故名等平等。种种希有殊胜功德者即妙观智及成事智。各有十因。妙观察智十种因者。一建立因。此智住持一切陀罗尼门三摩地门无碍辨说诸佛妙法。谓十力等。二生起因。此智能为顿起一切所知无碍妙智种种无量相识因缘。谓一切智能顿了知一切境相。一切境相顿起生因也。三欢喜因。此智可玩。波罗蜜多.菩提分法.十力.无畏.不共佛法之所庄严甚可爱乐。四分别因。此智之上世及出世衰盛因果三乘圆证无余。观察妙饰间烈。世间恶趣善趣以为衰盛因果。出世以二乘大乘为衰盛因果也。又有异解如佛地第五。五受用因。此智助平等智为增上缘。击发镜智相应净识现受用身。种种众会威德炽盛雨大法雨。为令十地诸大菩萨受大法乐。亦助成智现变化身。乃至为令地前所化受用法乐。六趣差别因。此智之上无边因果五趣差别具足显现。七界差别因。此智之上无边因果三界差别具足显现。八雨大法雨因。此智之上诸佛菩萨威神所引广大甚深教法可得。九降伏怨敌因。此智之上一切天魔外道异论所不倾动。甚深法界教法可得。十断一切疑因。妙观察智不愚一切自相共相之所围绕故。此中广辨自共相体。此等十因广说其相如佛地论。成所作智十种因者谓三业化。一身业化。此有三种。一现神通化。由是如来示现种种工巧等处摧伏诸伎傲慢众生。以是善巧方便力故引诸众生令入圣教成熟解脱。二现受生化。由是如来往诸众生种种生处示同类生而居尊位。由其示现同类生故摄伏一切异类众生。三现业果化由。是如来示现领受本事本生难修诸行。如契经说。如来先世<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛时作是骂言。何处沙门剃除鬓发有大菩提。无上菩提极难得。故由彼恶业今受如是难行苦果。此言亦是为止恶行现化所作。若不尔者何有系属一生。菩萨已曾亲事无量如来植诸善本。性忆<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。更起如是动语恶行。当知此言为欲化度宜闻此言而得度者。令于佛所离此言故。二语业化。此亦三种。一庆慰语化。由是如来宣畅种种随所乐法。文义巧妙小智。众生初闻尚信。谓佛言音具六十德。诸凡愚慧暂时得闻尚生信解。何况其余聪慜者慧。二方便语化。由是如来立正学处毁诸放逸赞不放逸。又复建立随信行人随法行等。由大悲故。为诸有情安立学处令伏诸恶修世间善。安立圣道分位差别。令入正道出离三界。三辨扬语化。由是如来断诸众生无量疑惑。谓成事智随诸众生意乐差别现化语业。说种种义断诸疑惑。谓发一音表一切义令诸有情随类获益。佛以一音演说诸法众生随类各得解。等此由如来本愿所引不思议力。若作化身一质异见利乐事成。三意业化。此有四种。一决择意化。由是如来决择众生八万四千心行差别。谓诸有情八万四千诸垢尘劳心行差别。此能障碍八万四千波罗蜜多陀罗尼门三摩地等。如贤劫经广说其相。所谓最初修习行法波罗蜜多。乃至最后分布佛体波罗蜜多三百五十。一一皆具六到彼岸。如是总有二千一百。对治贪嗔痴及等分有情心行差别八千四百。除四大种及六无义所生过失。十转合数八万四千。修习此故后得成就八万四千陀罗尼门三摩地等。此犹略说。广则无量。二造作意化。由是如来观诸众生所行之行行与不行若德若失。为令取舍造作对治。谓随观察一切有情所行之行。若诸恶行不行有<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>即有失。若诸善行行即有德不行有失。如是观察为欲令彼取德舍失。于德造作住持对治于失造作远离对治。三发起意化。由是如来为欲宣说彼对治故显彼所乐名句字身。谓随众生所乐说法令起爱乐发生对治。四受领意化。由是如来于定不定返问置记为记别。故随其所应受领去来现在等义。此四即是一向分别返问置记四种论说。谓三宝性良<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>等此三业化即三神变。谓神通记说教戒三种。由此义故说佛世尊名大圣智药。能除一切烦恼病故。妙观察智成所作智各有十因故名种种希有功德。此句总显报身实德故以四智初门赞述。余色非色诸有为德皆是四智品类摄故。第二句云灌顶宝冠超过三界此叹道胜位尊。出第十地灌顶位已戴佛宝冠殊胜妙智身净无漏。离诸系缚非界所摄故。名超过由此二乘异生外道位皆卑下故。十地云有此净土出过三界。第十地菩萨当生其中。彼土处所不离三界以离系缚故名超也非彼摄故。如来之身亦复如是。非有漏故名为超过非离三界别处生也。第三句云遍金刚智大观自在者叹悲深智广二果齐圆。因中修行自利利他悲智为因果道成满。果既了知诸法名遍金刚智。能证遍智能摧二障故喻金刚。或所破二障坚窂难坏亦喻金刚。能证遍破犹如金刚烦恼所知。真实妙智名遍金刚智。得此智觉能悲拔济一切有情。自利智圆利他悲满名观自在。随其众生三业求愿即能悲拔无有遗漏名大观自在。显佛诸德莫过此二。摄法周尽随应广摄 第四句云决定诸法大妙智印者叹慧广智德。总印一切有空事理证不谬故。智有二种二种无智皆已断尽故得二智。有为智能知有为定无常。无为智能知无为定寂静。此二无我印法定然必无犹预故。用广大名大妙智印。若无此智于法不能决定智起。第五句云毕竟空寂平等性印者叹照寂断德。此叹法身要断二障方证二空。二空之理印定诸法。诸法平等皆由二空。由二空门证此法性名平等性。然毕竟空但能入门非平等性。平等性者真如之体非空非有。今从方便名毕竟空。由观有情为毕竟空所证得故。佛已圆得故名为证。第六句云于诸能作所作事业皆得善巧成辨无余者。下四句叹化身。此叹成巧恩德。谓佛世尊大悲熏煮六时驱逼。为利有情为现方便报身化身。如应说法利乐菩萨及二乘等。其平等智击发镜智。为诸菩萨现他报身。妙观察智于中说法断众疑网。成所作智击发镜智起变化身。为二乘等现化身语。妙观察智于中说法断诸疑网。成所作智现三业化。总有十种。如此中解释初句总德中解。此成事智及平等性智名为能作事业。其十种化平等智等之所作事名为所作事业。世尊于此能作所作皆得善巧成辨无余。一切皆得善巧满故。第七句云一切有情种种希愿随其无罪皆能满足者。叹神通轮能满胜愿。由佛具有神通威力。一切有情世及出世诸无罪愿皆能满足。然不皆与故说为能。恐诸有情增恶业故。谓见贫者常求其财应亦施与。然得财已增长恶业所以不与。摄大乘云宁使贫乏于财位远离恶趣诸恶行。勿彼起过乱诸根能感当来众苦器诸根缺等。类此应知。若求智门无罪<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>然必皆与。如末利夫人愿为王妃后获圣果。五百圣种愿见佛身说本生事。迦叶夫妇愿为道心<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>眷属后得圣果。阿育王女愿得钱施后为王女。此等皆是无罪之愿皆能满足。不同父母亦与其子有罪之愿无罪希愿则不能与。又现神通随其宜现佛则为现满足所求。如为优楼频螺迦叶三人等现神通事。如为调伏劫比拏等现大神通令其入道。皆满胜愿也。第八句已善安住三世平等常无断尽广大遍照者。叹佛世尊记心轮能为说法。天眼通知现在世如知人间牛产犊事。生死智知未来知未来婆罗门等旃遮谤已后自败事。亦知郁头蓝子生天已为着翅狸后入地狱事。以宿住智知下乞儿久发善根。为其说法拔济饶益记别三世而为说法。行利乐事无有差别名为平等。能观此智相续现前常无断尽无所不知广大遍照。第九句云身语心性犹若金刚等诸如来无动无坏者。叹漏尽轮能现离染教诫教授。三身之中惑业皆尽故似金刚等于诸佛。不为一切外道天魔生死恶友之所动乱破坏。令起恶业等也。由三业中一切漏尽故能教诫教授众生故名漏尽。如对法论第一疏解。又第四解。此中九句初之一句总叹四智法身报身。次有二句叹位尊德广。次三句别叹三德。后三句别叹三神变。欲令众生闻佛功德生胜欢喜殷重闻法起趣求故。佛具此德以叹经初令知所说最胜妙故</p><p>般若理趣分疏卷第一终</p><p>大般若波罗蜜多经般若理趣分述赞 第二卷</p><p>大慈恩寺沙门 基撰</p><p>经曰。是薄伽梵住欲界顶他化自在天王宫中</p><p>赞曰。自下第四明说教处。于化土中略彰<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>以显经胜举化胜。处以表报身及法身土亦含实德。第一处尊胜在欲极天他化宫故。第二同居胜诸佛曾游大宝殿故。第三严丽胜无价末尼蓥众宝故。第四爱重胜贤圣天仙所欣乐故。此文第一处尊胜也。是薄伽梵者指说教主即能住人。住者依止居处之义。欲者贪爱即是淫触段食之贪。界者族类疆畔之义。界由欲生能生于欲名为欲界。如胡椒饮如金刚环。顶者头顶高极之义。此于欲界六欲天中最高胜处名欲界顶。虽言胜处仍未显名为显天名故。经次言他化自在诸天福力随欲所须如应即现。然第五天业既殊胜。则不如是随欲化物。但以生得变化之力变作种种所须之具而受用之。今第六天业更殊胜。虽有众具随欲即现亦能自变化作众具而不受用。要待他天变为乐具。自方受用业力胜故。由如是义名他化天。就此天中非无贵贱臣主等别。今处彼天贵主所居非住臣贱下恶天处。故经复言天王宫中。欲显法尊说必依于上极胜处非于余下也。如证菩提要金刚座。说此胜法必他化宫。如十地经依胜处也。此表报身住无漏净土之中。亦表法身住离贪欲究竟极处清净法界。证此法者能作利他之胜事。故亦为利他处于净土及法性。无分别智及后得智神用无方名为自在。此乃诸天法王曾居之宫室也。故余经言毕竟空寂以为舍。故三身利物各各别。故所居之土亦各别也。寄在天宫彰处尊而法胜。标居界顶显妙理以幽深也</p><p>经曰。一切如来尝所游处咸共称美大宝藏殿</p><p>赞曰。此即第二同居胜也。尝者曾也。游谓游陟。处谓安处。唯一佛住诸佛不居则非好处。今显十方过现诸佛皆曾于此他化天宫游陟安处。诸圣共履故知胜处。设后诸佛现虽不住皆共称扬赞美其宫。称者称扬美者叹美。天王宫中舍有无量。今佛居彼大宝藏殿。众珍所成名之为宝。以宝为藏名为宝藏。宝藏即殿名宝藏殿。殿既高广复以贵宝之所庄严名为大宝。佛居天宫内大宝藏殿中住也。此意总表报法二身无分别智及后得智居过现佛曾所游处。并共称美大宝藏殿。亦显诸佛共居同赞故知处胜。佛受用身住报土及后得智分别法性义名为游。无分别智住法性土游戏如理号为处。由受用土具十八德法性之土具含万善。所以诸佛常共赞叹此二土故名共称美。称者称扬显名言之所不及。美者叹美假言诠以谈实德。广同法界名大。万德所成名宝。含容众善名藏。空寂之室名殿。报法二身初后二智常居此处。说法利他诸佛同居彰共游而处丽。三明并赞示具德以号藏</p><p>经曰。其殿无价末尼所成种种珍奇间杂严饰</p><p>赞曰。自下第三庄严胜也。于中有三。一明总严二列别严三列余严。此总严也。梵云末尼此云如意。其殿既以无价如意神珠所成。加以帝青大青石藏杵藏四宝四色七珍七光间错庄严朱紫交映。此意总表法性之殿如如意珠。无为万德之所严蓥。受用土殿般若为体同彼末尼。有为众善之所庄饰义同间杂严饰其殿。二大殿二身所居。如如意珠随欲所求一切皆得。末尼无价更饰之以七珍境。智莫方加严之以万德。此其总严也</p><p>经曰。众色交映放大光明</p><p>赞曰。自下第二列别严也。于中总有十四别严。此有二严也。七珍间错所以众色交映。四辉[(起-走+光)-巳+光]耀故能放大光明。又朱紫相杂举事而论交映。素黄飞彩离质而放光明。此意总表法性无著约缘。涅槃分四譬犹交映任物以成众色。又智分真俗似众色而交映。此二齐垂教彩。若色以放光明。既有照耀之功兼资破闇之力故。此二句即是二严</p><p>经曰。宝铎金铃处处悬列微风吹动出和雅音</p><p>赞曰。此有四严。一悬宝铎。二列金铃。三吹动以微风。四发音而和雅。既铿锵以振响足观听以明心。此意运以六通同宝铎。而振骇飞乎四辩若金铃。而惊济随机往利处处之义显然愍物宣扬。悬列之言攸显。若不大悲之风飘扇七辩之音无发。故知感应道成智悲之德被也。言七辩者所谓捷辩。迅辩。应辩。无疏谬辩。无断尽辩。凡所演说丰义味辩。一切世间最胜妙辩。六通等义并如下释</p><p>经曰。绮盖缯旛华幢彩拂宝珠缨络半满月等</p><p>赞曰。此有八严。罗盖扶疎飞圆华而孕绮。霞旛飘扬曳曲[彰-章+(廿/果)]以疑虹。华幢肃以干云。彩拂严而曳地。明珠磊磊映明银星。珍缨络络洁逾金镜。轮低翠岭同浮半月之晖。璧挂青岩如含满月之彩。即其化土所居天宫赞丽饰也。此意总显报法二土。四无量如绮盖以荫群生。四总持若缯旛而转众恶。三三摩地喻彼华幢。百千功德所庄饰故。四种摄事譬斯彩拂。垂遍含生拂尘垢故。四总持三<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>皆如下释。四无量摄事等不异常谈。三念住为宝珠恒时平等故。四弘愿为缨络助严众行故。无畏为半月能破外道消除邪恶故。十力为满月能破天魔令除诸恶故。或以六度为宝珠通摄万行故。三念住者谓一分赞不生爱。一分毁不生嗔。于一会中半赞半毁不爱不恚。于此三中但住大舍名为念住。四弘愿者一未离苦愿离。二未得乐愿得。三未发心修断愿发心修断。四未成佛者愿早成佛。无畏十力至下当知。此上第二列别严也</p><p>经曰。种种杂饰而用庄严</p><p>赞曰。此即第三列余严也。末尼六殿大严如是。子细别严今总彰举。所谓户牖轩窓甍栋兰楯皆随具有。即显解脱。胜处。遍处。无诤。愿智。永断习气。一切种妙智百千功德。所严二土有为无为理应尔故</p><p>经曰。贤圣天仙之所爱乐</p><p>赞曰。此即第四宝重胜也。五乘凡夫曰贤。三乘证果曰圣。五趣之极曰天。人有神德曰仙。宝而重之为爱。欣求倾渴为乐。此化土也。今显三乘之中若凡若圣俱生爱重欣求趣证。名为爱乐。此显法报二身随应土也</p><p>经曰。与八十亿大菩萨俱</p><p>赞曰。自下第五教所被机。然此经中实通凡圣如下经云。金刚手等诸大菩萨及余天众闻佛所说信受奉行。金刚手等<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>众也。余天等者凡夫众也。故知此会凡圣两集。又准化处在他化宫。显居化土理然。天宫非是净土。若准十地诸大菩萨者即应化处不说天宫。由此人处影显。可知处说天宫彰凡夫皆居秽土。众标菩萨明大士咸处净方。然则教迹幽深非愚所测故。乃但题菩萨。应此通机。化处举胜而说天宫。听众标尊但言菩萨。理兼通也。又法门仲邃但被一乘之人。玄宗寥廓遂隔二乘之众也。此被机中文势有四。一举数二陈德三列名四彰轨。此举数也。与者兼并及会之义。十万为亿八十亿者八百万也。所言大者略有四义。一数大八百万菩萨会集听法故。二德大皆具总持等诸大功德故。三业大并具妙辩才说法利生故。四名大如金刚手等十地满名故。菩萨俱者显教深妙唯被上机。欲令有情得希有法精勤渴仰信受奉行故</p><p>经曰。一切皆具陀罗尼门三摩地门无碍妙辩</p><p>赞曰。下陈德也于中有二。初列名后例指。此列名也。陀罗尼者此云总持以念慧为性。此有四种。法义及明咒能得菩萨忍。法谓能诠于一名等中持诸名等故。义谓所诠于一义中持诸义故。咒如下说。能得菩萨忍者谓有一咒速得菩萨无生法忍。弥勒菩萨说壹胝密胝吉胝思羼底(丁履反)钵陀腻莎诃。三摩地者此云等持旧云三昧。谓诸有漏无漏等定皆能平等持心于境名曰等持。谓大空等三三昧等。无碍妙辩谓法义词辩说无碍。初之二德举自利行。第三之德举利他行。此三体性。依处。修法。得位。一切义门如别处说</p><p>经曰。如是等类无量功德设经多劫说不能尽</p><p>述曰。此指例也。劫者时分。菩萨修因时行并大故赞功德经劫不穷。谓转法轮无生忍等恐文繁广故例指也。何故须赞菩萨功德。为舍众生轻慢心故。有作是言。诸声闻众久修梵行诸菩萨众应当敬礼。又令众生起净心故。菩萨尚有如是功德何况如来。故诸有情至心归礼并愿速证</p><p>经曰。其名曰金刚手菩萨摩诃萨‘观自在菩萨摩诃萨虚空藏菩萨摩诃萨金刚拳菩萨摩诃萨妙吉祥菩萨摩诃萨大空藏菩萨摩诃萨发心即转法轮菩萨摩诃萨’摧伏一切魔怨菩萨摩诃萨</p><p>述曰。下列名也。此有八人举其胜者。言菩萨摩诃萨者菩提言觉即一切智。萨埵言有情即求菩提之有情也。此通三乘。摩诃言大萨埵如前为简取大故言摩诃萨。又菩提者所求之果智境也。言萨埵者所为拔济之有情悲境也。即是自利利他二德。又萨埵者是勇健义。精进勇猛求大菩提故言菩萨。此后二解许通凡圣。今取第十金刚心者故复说言摩诃萨也。言金刚手手者取义执义。常起信手取诸功德故。起智慧手执受金刚本法性故。又信智二手犹如金刚坚固难坏非邪恶友所能坏故。观自在者即观世音。观谓观察观诸有情身语心性。受苦恶时或祈念时应时为拔往诣救护名观自在。神用无方得自在故。虚空藏者以空为藏藏诸珍宝。见诸有情贫无财宝从虚空中雨种种宝施贫乏故。金刚拳者拳者破坏击碎之能。发起坚固智慧之拳击破生死烦恼业等。如以金刚拳击碎诸物因以名也。妙吉祥者即文殊师利先云妙德。妙者善义。由善能作胜福利事饶益有情名妙吉祥也。大空藏者。大空即是遍满法界。真如空理以此为藏。为诸有情说大空法。以此法施令诸有情皆获种种圣法财宝名大空藏。发心即转法轮者。轮谓摧伏移转之义。法谓教法如法轮章说法轮义。此大菩萨从初发心终至十地凡所举措身语意业皆为有情说深妙理转大法轮行饶益故。摧伏一切魔怨者。魔谓四魔如前已说。此四能破有情善事为众生怨。此大菩萨住金刚心离分段死及诸烦恼故能摧伏一切魔怨。此八名中金刚手智取善为名。观自在悲拔苦为号虚空藏济贫为字。金刚拳破恶为能妙吉祥作善为目。大空藏显真为称。转法轮说法为利。摧伏魔怨害贼为益。或智慧慈悲一对或显真显妄一对。拳如妄法故或显有为无为善法一对。或进善破恶一对。随其所应准名知义</p><p>经曰。如是上首有八百万大菩萨众前后围绕</p><p>赞曰。此第四彰轨也。八百万者八十亿也。言前后者以方为首故有前后。各见世尊在其前坐为其说法。既无背面宁有前后。如珠星而拱朗月。譬金山而辅妙高。若众梵之绕梵王。似诸天之围天帝。尊人重道渴法希益。翘注一心冀闻深致</p><p>经曰。宣说正法初中后善文义巧妙纯一圆满清白梵行</p><p>赞曰。此即第六叹法胜德。宣说正法是总句也。刊定可轨离邪分别名为正法。宣显未闻为初开智说彰旧理为久悟人。初中等者总有十德以彰教胜。瑜伽师论八十三云。一初善二中善三后善四文巧五义妙六纯一七圆满八清净九鲜白十梵行。彼自释言。初善者谓听闻时生欢喜故。由法殊胜初有听闻即令生喜。中善者谓修行时无有艰苦远离二边。依中行故既听闻已正修行时远离苦乐邪怠二边。依处中行以求出世故中善也。后善者谓极究竟离诸垢故。及一切究竟离欲为后边故。谓佛言教理极究竟性离诸垢能现涅槃。依修行者能离欲故。文巧者谓善缉缀名身等故。及八语具得圆满故。八十一云。先首美妙显了易解乐闻无依不逆无边名八语具。如彼广说。其能诠文善能缉缀。义妙者。谓能引发胜利乐故。其所诠义能引利乐。纯一者。谓不与一切外道共故。其所说法唯佛能说诸外道等不能说故。所说法中非杂外道邪恶法故。圆满者。谓无限量故最尊胜故教广无限义深无量其修学者功德无量故最尊胜。清净者。谓自性解脱故其所说法一刹那中亦无过失。离三毒根离诸系缚故性解脱非有三毒而起说故。鲜白者。谓相缚解脱故。非唯一念无其过失相续论之亦离诸过。又前清净法体离过此中鲜白能令觉者身亦鲜白。梵行者。谓八支圣道此出梵行之体当知此道由纯一等四种妙相之所显说故。八圣道名为梵行。若依此解与古不同。此上十德总显经胜</p><p>经曰。尔时世尊‘为诸菩萨说一切法甚深微妙般若理趣清净法门此门’即是菩萨句义</p><p>赞曰。自下明第二应机广说分。于中总有十四段经。合之为三。初六段明菩萨境。次六段明菩萨行。后二段明菩萨果。一切佛教所诠义理不离此三。说境先令知法染净因果善恶此可欣厌此可修断。说行次令知依境起行修断之法。说果后令知行行得果殊胜之相。初六段明境复分为三。初二段明体境。第一甚深微妙清净法门。即是对妄显真实相真如境体。第二寂静法性现等觉门。即是除闇显于观照正智境体。真如是性正智是相。说有前后下皆准知。次二段明行境。第三调伏众恶普胜法门。由观实相能伏众恶。第四平等智印清净法门。由观观照智慧照明。后二段明果境。第五法王灌顶智藏法门。显由二行得位财果。第六如来智印金刚法门。显由二行得自体果。次六段明行复分为三。初二段明依实相断修之相。第七离诸戏论轮字法门。由观无相断分别故。第八入广大轮平等法门。由观平等<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>真故。次二段明依观照修断之相。第九真净供养无上法门。由依观照修真供养故。第十能善调伏智藏法门。由依观照能除忿等故。后二段明依二法遍修之相。第十一性平等性最胜法门。修观实相一切人法平等遍满故。第十二有情住持胜藏法门。修观观照遍诸人法皆善缘故。由观前六境而起六行。已后二段明得果。第十三无边无际究竟法门。得二果时广深一味极殊胜故自利果德。第十四甚深理趣无上法门。得二果已自利利他为三界主随诸有情所愿皆证利他果德。就第一段甚深微妙清净法门。即是对妄显真实相真如境体。中文分为三。初叙世尊所说法门之名。次叙世尊所说理趣之义。后叙世尊所说法门之德。此即第一叙法门之号。尔时者发端义。处天宫众云集所化机感法王应现说听悬会故言尔时。世尊者能说教主。为诸菩萨所被深机。说一切法。有为无为诸法体事。甚深微妙法性真如非凡所测名曰甚深。二乘莫知复称微妙。般若理趣即深妙法理。谓法性道理义理。趣谓意况所趣旨趣。此意即说般若之文所诠深趣观照般若所取意趣。自性洁白名清离诸垢染名净。门者虚通趣入之道。即显照理会证之由。欲证二空要闻此教理。依之修学方可会真。不知何名强名门也。此门是何。此门即是菩萨句义。菩萨三义已释如前。言句义者句谓能诠声之差别。不说文名但说句者。句诠义周非文名故。义谓所诠法之差别。不说自体但说义者。法义圆被非自体故。句既能诠所诠唯义欲显此教能诠一一皆圆满。故所诠一一亦周被故。举宽能诠及宽所诠。文名体法皆已摄故。欲求菩提于有情之类起大悲智而起修学及求菩提。发勇猛者名为菩萨。今此理趣能诠之教即是能诠菩萨之句。所诠之理即是所诠菩萨之义。若依此教而行此义证此理者名为菩萨。后道满时名之为佛遂舍因名。此言菩萨略有三位。一初发心二修正行三证法性。三位皆须依此修学。方可得证故名为门</p><p>经曰。云何名为菩萨句义</p><p>赞曰。自下第二叙佛所说理趣之义。于中有三。初佛自问。次述其义。后劝修学此初问也</p><p>经曰。谓极妙乐清净句义是菩萨句义</p><p>赞曰。自下述其义。于中有二。初释其义后释所由。若依清辨世俗可有胜义皆空今说正义空寂。若依护法应依下释。就释义中合有四十一句义。释菩萨句义。复分为二。初有十门明菩萨修果清净句义以显菩萨所有句义。后色蕴空寂下三十一门依诸法本性及所由空寂清净句义以显菩萨所有句义。就初十门明菩萨修果清净句义以显菩萨句义之中复分为五。然菩萨修略有五种。所谓集总修。无相修。无功用修。炽盛修。无喜足修。谓集一切总为一聚简要修习初修行者诸恶皆断诸善皆修诸生皆度。或观一切为骨琐等或观此身从头至足唯脓血等名集总修。于离十相真法界中遣事差别而修习故名无相修。渐修行者应观无相。为令此修纯熟自在不假功力任运现前。名无功用修。虽无功用修有胜劣为令增胜说炽盛修。或虽炽盛恐有少所得便生喜足。谓且修此余何用为为令勿厌乃至菩提名无喜足修。今显菩萨得转依时地前名为益力损能转。由习惭愧及胜解故益圣道力损二障能。亦可分得五修之果。十地正证正行五修。今此十句显五修果至文当知。此即第一顺清净分无所分别。无相现行当来<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>名清净分。此能引彼故名顺。如佛轮王鲜白盖等无所分别无相现行。由得于此顺清净分。无分别故。悟极妙乐即无漏智。地上正证地前分得。若有分别不顺清净得苦恶果。今无分别顺清净分故极妙乐苦果永无。触无相乐故。此极妙乐非分别引生故名清净。能诠此句。此句所诠即是菩萨句义。诠辨闻行即此。是故下文所说菩萨句义并准此知。更不重释</p><p>经曰。诸见永寂‘清净句义是菩萨句义微妙适悦清净句义’是菩萨句义</p><p>赞曰。此中二句义。即五果中离种种想得法苑乐。由见永寂故离诸相。诸相多由诸见生故。由得法苑乐故微妙适悦。诸见者五见等。地前地上伏断无余故言永寂。以法界为苑于中游玩故。于此喜悦名法苑乐。证会名得。如王宫外上妙园苑游戏其中受胜喜乐。法界亦尔。求证正证皆生乐故</p><p>经曰。渴爱永息‘清净句义是菩萨句义胎藏超越清净句义是菩萨句义众德庄严清净句义是菩萨句义</p><p>赞曰。此中三句。渴爱者谓贪欲由渴爱生故名渴爱。谓如鹿渴遥见阳烟将以为水。而起贪求奔走往趣。有情亦尔。由烦恼渴见不净物谓以为净。广起贪求故名渴爱。此润生惑以爱为先或通发业。诸烦恼等贪为首故。此但举之。地前渐伏地上能除故名永息。由因灭故苦果不生。是故胎藏亦能超越。举一胎生意离分段处变易故。此之生死因果既亡遂得殊胜变易异熟。故于地前种相好因化成八相。十地之位得诸相好清净功德庄严其身。恶法既亡胜果斯起即是念念消融一切粗重依止有漏身器。依止本识鞕强不安名为粗重。如痈疮等。三苦迫逼不安稳故。若在地前由闻般若修行无相。令闻熏增销融本识依上粗重如大良药销众病块。若在十地正能断之名销融也。粗重既灭故渴爱息。胎藏超越得无粗重。众德庄严爱能润发。下缘生中自当广说。胎藏身者。瑜伽论说胎藏有八位。已结凝箭内稀名羯剌滥位。表里如酪未至肉位名頞部昙位。若已成肉仍极柔软名闭尸位。若已坚厚稍堪摩触名健南位。肉转增长支分相现名钵罗赊佉位。此后发毛爪生位眼等根生位依处分明愿名形位。然由先业或母恶缘令此胎藏或发或色或皮或支变异而生。由业及母多习灰盐等味令发毛稀鲜。由业及母多习燸热令色黑黯。近寒室等令色白生。多啖热食色极赤生。由业及母多习淫欲皮或癣疥或癞等。由业及母多习驰走跳踯威仪或倒或屈支分缺减。女居左胁倚背向腹。男居右胁倚腹向背。胎成满时其母不堪持此重胎。内风便起发生苦痛。又此业报生分风起令头向下足便向上。胎衣缠裹而趣产门。其正出时胎衣遂裂分之两腋。生产门时名正生位。时令其母苦痛无量胎身亦尔。此大般若第五百八十九卷说。此胎藏身三十六物不净所成。一发毛二爪三齿四皮革五血六肉七筋八脉九骨十髓十一心十二肝十三肺十四肾十五脾十六胆十七胞十八胃十九大肠二十小肠二十一屎二十二尿二十三洟二十四唾二十五涎二十六泪二十七垢二十八汗二十九淡三十脓三十一肪三十二[月*册]三十三脑三十四膜三十五[强-弓+目]三十六聍。既生长已次起六触。次随世学次耽家室。次造生业次受色等苦乐境界。次随其业流随五趣复受此身。菩萨不尔。随愿受生设入母胎。即至钵罗赊佉位自无恶业。亦不令母习近恶缘自损发等。亦不令母受诸苦恼。既生长已亦无如前所说恶过。唯以悲智受生为业故名超越。变易之身无是事也。具三十二相八十随好故名众德庄严。悲智熏修得是身故</p><p>经曰。意极猗适‘清净句义是菩萨句义得大光明清净句义’是菩萨句义</p><p>赞曰。此中二句义即是能正了知无量无分限相大法光明。得达法界等十方无边无分量相故极猗适。显照行故名法光明。既能广达契会法性证真妙理意极猗适。能了此智分明显照名法光明。此二离垢故名清净</p><p>经曰。身善安乐‘清净句义是菩萨句义语善安乐清净句义是菩萨句义意善安乐清净句义是菩萨句义</p><p>赞曰。此中三句即是第五为令法身圆满成辨能正摄受后后胜因。第十地名圆满在佛地名成辨感此之因最是殊胜说为胜因。即是此中三业安乐清净之义。正由前位意善安乐语身二业助安乐故。后后法身圆满成辨。三业不净逼迫现前便无安乐。后后法身无由成辨。此上十句义明菩萨修果清净句义。以显菩萨所有句义。此中清净若是染者离过清净。若善者修习清净。菩萨句义不离此。故地前分得地上正证。故益力转在地前位</p><p>经曰。色蕴空寂‘清净句义是菩萨句义受想行识蕴空寂清净句义是菩萨句义眼处空寂清净句义是菩萨句义耳鼻舌身意处空寂清净句义是菩萨句义色处空寂清净句义是菩萨句义声香味触法处空寂清净句义是菩萨句义眼界空寂清净句义是菩萨句义耳鼻舌身意界空寂清净句义是菩萨句义色界空寂清净句义是菩萨句义声香味触法界空寂清净句义是菩萨句义眼识界空寂清净句义是菩萨句义耳鼻舌身意识界空寂清净句义’是菩萨句义</p><p>赞曰。自下第二三十一门依诸法本性及所由空寂清净句义以显菩萨所有句义。于中分二。初有二十六门明世俗胜义法所依所从本性空寂清净句义。以显菩萨所有句义。第二善非善下五对通染净法差别本性空寂清净句义。以显菩萨所有句义。初中分三。初有九门唯明世俗法所依本性空寂清净句义。以显菩萨所有句义。次有十六门唯明胜义法所从本性空寂句义。以显菩萨所有句义。后有一门总明世俗及胜义法所依本性空寂清净句义以显菩萨所有句义。初中九门即分为九。此所牒中有三句义。即三科法。且如凡夫遍计所执色蕴等法。本来空寂空寂即清净。但有妄心境都无故。依他门有本性亦空。经自说言。色如聚沫受喻浮泡想同阳焰行类芭蕉识犹幻事。色如聚沫者。速增减故水界生故。思饮食味水所生故。不可捼接故。非如泥团可令转变造作余物故。又实非聚似聚显现乃能发起有情解故。受喻浮泡者。三和合生不久坚住相似法故。谓下有水上有天雨傍风所击有浮泡生。三和合为缘生受亦尔。触等心所法略不说为缘又速疾谢起不坚住故。想同阳焰者。飙动性故。无量种相变异生故。令于所缘发颠倒故。令其境界极显了故。由此分别男女等相成差别故。行类芭蕉者。不坚实故。枝叶广大速即坏故。如明眼人持利刃入于林。取端直芭蕉柱截其根披枝叶。彼于其中都无所获。何况有实。谓圣弟子以妙慧刃于五趣林。取作受我见名之为柱截其根。断我见故。委细简择名披枝叶。唯有种种思等诸行差别法故。何况有余常恒之我故如芭蕉。识犹幻事者。譬如幻士住四衢道造作四种诸幻化事。言幻士者喻随福非福不动行识。住四衢道者住四识住。四幻事者谓象马等此虽可见而无真实象马等事。如是应知随福等识住四识住虽有作受我等之相然无真实我性</p></div>"
}]