[{
    "title": "无量寿经连义述文赞 第1748部",
    "author": "璟兴",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p><a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>连义述文赞 卷上</p><p>释璟兴撰</p><p>经曰佛说无量寿经上者。述云将讲此经略作三门。一者来意二者释名三解本文。初来意者略有三义。一者欲显<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之所因故。谓前经中虽言华座由法藏<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>愿力所成而犹未说极乐依正二报<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>皆依法积本誓力成故。今更须广说宿世四十八愿以显彼土今现之因。二者欲辨本誓之不虚故。谓一切佛虽发本愿本愿亦有不能果遂。如<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>中所有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>令得灭度。法积愿力即不如此故。今广说依正<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>严净以显宿愿必有所辨使增<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a><a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>之意。三者欲示秽土之苦恼故。谓观经中虽言未来一切众生为<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>贼之所苦害而众生不闻痛恼之相即不能起欣厌之意往生之业亦不得成故。今广宣五恶痛烧以于苦害。令<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者厌此苦域欣彼乐方修福观行速出娑婆而生净土。如其次第即所成所化之二也。以是三义故次观经后说此经也。第二释名者观乎历代传来经本。经本题名虽复多途今且申三代经之首名也。魏时帛延显无量清净平等觉经之号。吴时支谦立诸佛阿弥陀三耶三佛萨楼佛檀过度人道经之称亦名大阿弥陀。今西晋法护名无量寿经。故经之名虽复广略其义大同。欲释法护经本之名即有四对。一总别相对。即佛说及经名总无量寿名别故。二人<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>对。即佛者人余名法故。三诠旨相对。即无量寿名旨经者诠也说兼二故。四首尾相对。即上者对下之言下亦对上之词如次首尾故。委细之义如前释</p><p>经曰我闻如是者。述云第三解本文。又有第二直申弥陀宿<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>刹本愿乐果以例众生生之<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。此中有说此经大开十分。一从初至于一时来会已来名序说分。二时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>诸根悦豫下是现相分。三尊者阿难承佛圣旨下是启请分。四于是世尊告阿难曰下是叙兴分。五阿难谛听今为汝说下是正说分。六<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨白佛言下是生生分。七佛语弥勒其有得闻下是劝信分。八尔时世尊说此经法下是说益分。九尔时三千大千下是劝请分。十佛说经已尽靡不<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>下是毕喜分。逐申有此十分之意。然未尽理故不采录。有何未尽者。如来现相将显圣教。所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>门应名目。如何乃言现相分耶。若发所说非发起序者阿难证谁。证信序。若非证信必不可言序说分故。又自世尊诸根悦豫前都未有说序。何所说故作序说分之名也。不可以他兼发起名。序说分目单证信故。又阿难申问于前如来送答于后即显所说之旨。有何所少谛听已去乃名正说。正说与序既不能别。后诸分意亦成乖角。若如所言每章段尽应作别分。分非唯十故。有说此经文别有三。从初我闻至愿乐欲闻是其由序。佛告阿难乃往过去下是正宗分。佛语弥勒若有得闻下是<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分。初由序有二。初我闻如是即证信序。后一时佛下义既两兼。故对准证信为发起序。于中有三。一辨化主二辨徒众三如来现相阿难申请。此亦不然。阿难申请若发起者佛答阿难应非正宗。若答正宗问必非序故。捡诸经论答名正说必兼其问。言问虽发起答是正宗无此例故。又时处等准证信我问如是讵不然。发起若闻若佛皆说前有故。又时佛处辨其化主亦违佛地论总显已闻等五义故。今观此一部之经宜作三分。初从我闻至光颜巍巍已来名说经因起分。次自尊者阿难迨于略说之耳已来名问答广说分。后始佛语弥勒尽于靡不欢喜已来名问说喜行分。将释有此三品之意还同佛地论。初又有二。初传法劝信分后发起圣说序。初又有五。我闻如是此初传法也。帛延支谦皆无此言。法护经存言顺印度</p><p>经曰一时者。述云此第二传时也</p><p>经曰佛者。述云此第三传主也</p><p>经曰王舍城耆阇崛山中者。述云此第四传处也。若释此四文。即同前经故不劳再解</p><p>经曰与大比丘者。述云第五传机。经本不同。帛延备叙三众。一声闻众即与大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>众千二百五十人<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>五百人清信士七千人清信女五百人也。二菩萨众即菩萨七十那衍也。三诸天众即欲天子八十万色天子七十万遍净天子六十那衍梵天一亿也。支谦唯标声闻之众。即摩诃比丘僧万二千人也。今法护经略举比丘菩萨二众余皆无也。所以有此备阙者盖翻家意乐互存广略。异由此也。将释传机有二。初声闻众后菩萨众。众有此次第亦如前解。初又有五。此初标行也。即法华论中云论声闻修小乘行依乞等自活故。威仪一定不同菩萨。故以比丘为名也</p><p>经曰万二千人俱者。述云此第二唱数也。彼论亦云数成就者谓大众无数故总别虽异其义一焉。而帛延唱千二百五十人者略举常众。不尽之言故亦不违</p><p>经曰一切大圣<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>已达者。述云此第三叹德也。一切者即普及尽际之言。大圣者即会理之德名闻凡圣故。论云心得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>即其大也。神通者即该六通之名无壅叵测之义也。已者竟也。达者即作证义。皆于六通究竟作证故。有说阿难既在学地位。虽未得通而有胜德亦名已达非也。阿难为人非凡所知。其实即经言迹虽初果初果亦伏欲障获根本定。纵无漏尽既发五通。故从多言已达都无致怪</p><p>经曰其名曰尊者了本际至尊者阿难者。述云此第四列名也。诸经列众无定次第故。或有行德大小为次第。如<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a><a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>在第二鹙子列在迦旃延上等。或有以<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>前后为次第。如报恩经初度五人次度耶舍门徒五十次度优楼频螺门徒五百次度伽耶门徒三百次度那提门徒二百次度鹙子门徒一百次度目连门人一百。或有以德辨为次第。如无垢称以命问疾要假智辨方对扬故。今此经中即同报恩入圣次第。帛延列其三十六名。支谦法护皆标三十一。憍陈如为其初故。帛谦并曰贤者而法护云尊者。皆叹德之言。即前大圣之义。了本际者即支谦云[牛*句]邻也。梵云阿若多憍陈那。憍陈是<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>姓。那是男声。阿若多是解义。初解净居。亦言已解。因以为初解。憍陈之姓乃亦众多。以解标号以男简女故复云那。今言本际者即<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>真性。了者即解故言虽不同其义一也。正愿者即谦云拔智致盖是拔提之名也。有说马师。因驱摈法发更不往他家之愿遂得罗汉故。即恐非也。准婆沙论马师满宿身显龙相遂生其中。得罗汉果受畜生身无是处故。有说正语即毕陵伽婆差非也。其人即恶性粗言。虽得罗汉余习亦在。必不可言正语故。今即论云摩诃那弥此云正语盖是摩男之名矣。即帛延云贤者能赞也。大号者即论云贤者含尸。盖为离婆多也。其人持不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。因证鬼诤以尸代身遂居王位德名令闻诸方故。仁贤者即谦云须满曰内怀贤善外申慈仁故因名之。离垢者即谦云维末坻盖净除是也。说本起云轮提陀。扫净寺舍愿令心无尘垢如寺故名净除。净除离垢言异义同故。名闻者有说长爪梵志。博达之名闻于十方故云名闻此恐非也。违说本起故。无有除此而可准故。今依彼经。夜耶尊者名为名闻。梵行净洁众所见敬故。善实者即说本起长者凡耆名为取善。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>维卫佛塔已来九十一劫常生人天遂得阿罗汉故。具足者即应说本起树提。尊者愿得受大戒具足成<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>故。牛王者即笈房钵底此言牛相而言王者兼美而已。梵云邬卢频螺此云木苽。当其胸前有一[病-丙+可]起如木苽故。今云优楼频螺者讹也。伽耶者即象头山。逐处之名故。梵云捺地庄严经云难提即江名也。此三迦叶皆饮光种兄弟三人。帛延经中更有贤者氏聚迦叶。盖说本起云承禅迦叶应云此中尊者具足。觉经除氏聚后即云牛饲故。既无诚说且开二途取舍任意学者应知。梵云迦叶波此云饮光即婆罗门姓。上古有仙身有光明饮蔽日月之光。迦叶是种。自亦有光能饮日月故袭性之名。摩诃言大。既大富长者之子亦为大人所识故表大名以简余三。梵云奢利弗怛罗。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>云鹙即百舌鸟亦曰春鸎。弗怛罗云子。以母才辩犹如鹙鸟。此是彼子因以名之故云鹙子。言舍利弗者讹也。梵云摩诃没特伽罗此云大采菽氏。上古有仙居山寂处常采菉豆以充所食因为其姓。尊者之母是彼之族仍以名之。得大神通简余此姓故亦云大。言目连者音讹也。劫宾那者此云房宿。佛与同房宿化作老比丘为之说法而悟道故。梵云摩诃迦多衍那此云大剪剔种男即婆罗门姓。上古多仙山中静处。年既掩久须发稍长垂人为剔。婆罗门法行剔发故。一仙有子兄弟二人俱来觐父。小者乃为诸仙剔发诸仙愿护。后成仙贵。尔来此种皆称剪剔。剔者身是男子威德特尊。简余此种故云大剪剔种男。古迦旃延此云绳扇讹也。今云大住者亦袭昔之名。母恋此子不肯改嫁如绳系扇可谓住故。大净志者即说本起中赖吒和罗。更无所乐志于清白法乐闲居第一故名大静志。摩诃周那者即周那般特。此云路生。路生有大小故摩诃以简其小。梵云补赖拏梅怛利曳尼弗怛罗此云满慈子。言富楼那弥多罗尼子者讹也。满是其名慈是母姓。母姓是慈。满尊者是慈女之子故因名之。今言满愿子者讹也。梵云阿泥律陀此云无灭。佛之堂弟即天眼第一。今言离障意亦此谓也。言阿[少/兔]楼驮讹也。流灌者有说即离婆多此云假和合故云流离此恐非也。既非离字。谦亦云难提故。今即说本起中名难提也。梵云孙达罗难陀此云艳喜。喜即自名艳是妻号。欲简牧牛难陀故因妻以表其名。即佛亲弟大圣王之所生也。维卫佛世施暖浴室故端正大势。见之无厌。今言流灌者亦袭彼之名也。坚伏者即应说本起中树提。故彼经云坚<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>定意无为无动故。帛延亦云贤者了深定故。面王者即支谦云贤者波鸠螺也。梵云薄矩罗此云善容。善容虽多以面为先故义名面王。异乘者即帛延云贤者氏戒聚。戒行颖萃故云异乘。仁性者即应本起中尸利罗。故彼经云施与钱财救诸贫穷济众下劣故。嘉乐者即本起中难陀名为欣乐。支谦亦云难持。正音即难陀此云嘉本。乃是牧牛之人。因问佛牧牛十一事知佛具一切智获阿罗汉。甚极聪明音声绝妙故。今嘉乐者亦非正翻之名也。善来者即支谦云贤者蔡揭。本起亦云货竭。传云<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>莎揭哆译为善来。来者归也。来归<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>有莫大利故云善来。善来虽通千二百五十人名即总以立别号故无如来常众。皆善来得戒善如大庄严经。梵云罗怙罗此云执月今云罗云。延帛云王宫生皆讹之也。梵云阿难陀此云庆喜今云阿难帛延云博闻皆略列也</p><p>经曰皆如斯等上首者也者。述云第五略结也</p><p>经曰又与大乘众菩萨俱者。述云第二菩萨众有四。此初标行也。即法华论中菩萨修大行求觉利有情以萨埵为目。又以神通力随时示现能修行大乘。如拔陀婆罗等十六人具足菩萨不可思议事示优婆塞等<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>之形说为菩萨。准帛延菩萨七十那衍。而今不说者略故使然</p><p>经曰普贤菩萨至一切菩萨者。述云第二列名有二。此初贤劫菩萨也。普者普遍即证真之智。贤者贤善即涉事之行。内德普遍外化贤善故名普贤。妙德者应云妙吉祥。吉祥者即功德之义义名妙德。慈氏者即于慈氏佛所初发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>亦生慈姓故云慈氏。梵云吠陀此云善故亦名善劫义如智论。而言贤者即从今名也。劫之延促佛之多少广如弥勒经述赞中解</p><p>经曰又贤护等至<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>菩萨者。述云此后余劫菩萨也。有说贤等十六正士者举初括后以总标。善思议等者逐其所等以别列。此恐不然。若善思议等即十六正士者应言十五正士。不尔标列有相违故。设许此者亦违法华论云跋陀波罗等十六菩萨故。善思议等与无尽意经中十六菩萨名异必不可言善思议等即十六正士。有说贤护等即二菩萨故遍十六士。内有贤仁之德故云贤士。外怀护物之意故云护意。此亦不然。跋陀婆罗此云贤护而分为二必相违故。又普贤等各标一名。贤护应非二菩萨名故。有说虽标十六数而列十五名缺落。如教法经云。有二菩萨一名贤护二名一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>乐见。此亦不然。彼既唯二此有十六不可一列故。不可诸经中菩萨若在贤护后者皆入十六数故。今即余劫菩萨自有二类故贤护等十六正士即其一类也。有说十六大国各有其一故有十六非也。一国多菩萨理必应有。故国别唯有一无别所以故。今即此十六愿行相类。故圣教中处处皆标其十六数。备不思议事逐物现化故。广如弥勒经述赞中解也。善思议等十四菩萨即其二类也。虽复十四略作七对。一思法信解对。即善思议观察教法。信顺教授名信慧故。二证空涉有对。即内证空理名为空无。游化诸有名神通化故。三大慈大智对。即慈光炬英名为光英。慧根无加名慧上故。四自利利他对。修<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>道名为智幢。防护根门名寂根故。五法名喻名对。即愿慧者法香象者喻故。六福资智资对。即备福资粮名为宝英具智资粮名中住故。七修行除缚对。即修圣行名为制行灭除二缚名解脱故</p><p>经曰皆遵普贤至功德之法者。述云此第三叹德有二。初备权实之德后利自他之行。初又有三。初略叹次广叹后结叹。初又有二。此初叹实德也。遵普贤之德者即修上位之行。具菩萨<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>者即备下位之愿。住功德之法者即辨自住之法。遵者循也顺也。普贤者即依如如备诸<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>居等觉之名也。故贤护等皆遵普贤大士之德。即知位阶法云地也。行者即瑜伽论中菩提分法诸波罗蜜成就有情神通之行。愿者即弘慧。经中知一切法得般若舟值<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>风得善方便度一切人超大<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>得具足道登<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>山入无为舍得法性身十种之愿。无愿行沉没苦海无行之愿亦无所熟故备行愿可谓菩提之道也。功谓功能。诸行皆有利国之功故即善行家之德故名功德。有德斯成故云一切。成圆备故云安住</p><p>经曰游步十方行权方便者。述云此后叹权德也。步者行也。身化无碍无感不应故云游步十方。化<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>巧无形不现故云行权方便</p><p>经曰入佛法藏究竟彼岸者。述云第二广叹有二。此初叹实德也。有说入佛法藏者申因上升。究竟彼岸者彰果毕竟。如来藏中恒沙之法名佛法藏。证会名入。到涅槃岸名究竟故。此恐不然。如来藏即<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>义。而言证会恒沙德法名因上升者即违经云见佛性时得无上觉故。若证佛性非菩提果至涅槃岸应非圆寂果故。今即入者达解究竟证解。知如实自利及事利他故云入佛法藏。即法华中善入佛慧通达大智也。彼岸者真理。证此实性故云究竟。即彼经中到于彼岸也。恒照二谛以利自他可谓实德故</p><p>经曰于无量世界现成等觉者。述云此后广叹权德有二。此初总叹也。有说诸菩萨各于一界成佛化生故云无量世界。此心不然。初地菩萨神通境界尚百佛世界。况亦法云菩萨化物世界可得称数。而言各于一界必非正理故。今即一一菩萨各于无量世界现化故于无量世界现成等觉</p><p>经曰处兜率天弘宣<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>者。述云此后别叹有九。一舍此升天二降神入胎三出胎异常四伎备解宽五效艺纳妻六出俗从邪七伏魔成觉八法化普洽九归真利物。此初也。处兜率天者即升天也。弘宣正法者化备天众。梵天睹史多提婆此云喜足天。诸佛常行中道故诸菩萨皆生此天。即庄严经云曾于百亿那由他[牛*句]胝佛随佛出家。曾于五十百亿那由他[牛*句]胝佛所而行大施。已曾亲近三百五十[牛*句]胝诸辟支佛。已曾<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>无量阿僧祇诸声闻众。皆令住正方便中。为欲证无上觉乃趣一生补处。从此命终生兜率天为彼天子名曰净幢。诸天子等百千[牛*句]胝那由他数。大集法堂围绕菩萨听受所说无上大法断诸烦恼生广大心</p><p>经曰舍彼天宫降神母胎者。述云此第二降神入胎也。欲使众生生尊重心易受所说故舍天宫以下入胎。彼经云菩萨将欲降生十二年前有净居天。下阎浮地作婆罗门说韦陀论。十二年后有一胜人。现白象形入于母胎具大人相。若出家者当得成佛。复有天子下阎浮提告辟支佛。应舍此土当有菩萨降神入胎。时王舍城尾盘山中有辟支佛名曰摩灯。闻是语已起踊在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>高七多罗树。化火焚身入于涅槃唯余舍利。从空而下。波罗奈国五百辟支皆亦如是。菩萨处于天宫观时方国族。升一大殿名曰高幢。纵广正等六十四由旬。为诸天众说百八法门。谓从信法门终灌顶法门。从彼天宫下生入胎。有一天子名曰胜光。作如此说。围陀论所说菩萨下生当作象形而入母胎。菩萨冬节过已于春分中毗舍佉月不寒不热之氐宿合时白月圆净弗沙星正与月合。其母<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>清净斋戒安稳睡眠时。为白象形六牙具足。其牙金色首有红光。形相诸根悉皆<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>了知于母右胁降神而入。不应难言叹诸菩萨德如何将释此九相文者。释迦八相即诸菩萨胜进行故。又现八相时诸菩萨一一现相相似众生谓一。故引彼经释尊庄严释此菩萨九相之文有何乖角。但经文烦广恐费言论。故今推义而约言称经而备理。菩萨处胎庄严虽多略申三种。一者宫殿。即欲界诸天各持妙宫至输檀王。王亦为菩萨造殿绮丽人间所无。菩萨威力故令诸宫中悉现摩耶圣后之身皆有菩萨右胁结坐。诸天自谓菩萨之母唯住我宫。菩萨宝殿纵广正等三百由旬。三重匝饰皆以牛头栴檀天香所成。其香一分价直三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。欲界诸天宫皆现菩萨宫殿之中。一切将入胎时于母右胁。先有此殿然后从天降神入胎。于此殿中结跏趺坐。二者饮食。即菩萨入胎之夜下从水际涌出莲华。穿过地轮上至梵世纵广正等六十八洛叉由旬。唯除佛菩萨及大梵王无能见者。三千世界所有美味犹如<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>现此华中。大梵天王以毗琉璃器盛此净妙甘露之味奉上菩萨。菩萨受食。唯除究竟后身菩萨无能食者。斯由长夜医药救病妙华侍圣<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>所招。三者化物。即菩萨处胎身相光明普遍世界。四大天王夜叉大将与其眷属释提桓因与三十三天<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>主大梵天王与无量梵众。如其次第晨朝中时申时为听法故皆见菩萨。菩萨慰问为其说法礼退而去。十方无量诸菩萨于日入时为听法故来互相问答。唯同行所见。摩耶不能见。又准彼经。十方无量一生补处十方世界欲色天子皆至兜率供养菩萨。菩萨即于兜率最胜天宫而便降生。时放身光照三千界六种震动有十八相。而今无者盖略而已</p><p>经曰从右胁生者。述云第三出胎异常有三。此初生处异常也。有说摩耶十月已满。乘云母车往于林微尼园。攀无忧树从右腋下而生者非也。捡庄严经都无此言故。今即菩萨处胎十月既满将出胎时圣后即知于初夜分请王欲诣彼龙毗园。王敕臣佐驾二万象。色类白云其形似仙。备诸车兵执持器杖以诸妙宝莹龙毗园如欢喜苑。圣后升宝乘世界六种动。帝释净路四王御车梵天前道除诸恶相。到园游观至彼宝树。过去无量诸佛之母皆来坐此宝树下。时百千净居天亦至此树下围绕圣后喜礼而叹。后身放光仰观于树。即以右手攀树东枝频呻欠呿端严而立。从母右胁安详而生。时帝释梵王曲躬而前。即以两手覆憍奢耶衣承捧菩萨。将菩萨殿还于梵宫</p><p>经曰现行七步至为无上尊者。述云此次示非常相也。菩萨生已不假扶持。即于十方各行七步。下足之处皆生莲华无有怖畏。欲示丈夫超于<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>奋迅之力故行之七步。光照十方者即身光利物故。彼经中菩萨放光无量异色满三千界。众生遇者心安乐远贪恚痴离诸罪障。六种震动者欲使魔怯伏也。震者动也。准长阿含六动有三。一六时动。谓入胎出胎出家成道转法轮入涅槃。今动者即出胎时。二六方动。谓东涌西没西涌东没南涌北没北涌南没中涌边没边涌中没。三六相动。谓动涌震击吼爆。摇扬不安为动。鳞陇凹凸为涌。隐隐有声为震。有所扣打为击。碎磕发响为吼。出声惊异为爆。此各有三名十八相。谓动等极动。余五皆尔。此中六动即六相动。故庄严经云六动有十八相。称无上尊者即自唱尊号令物归趣也。若具言之。东方行言我得一切善法。当为众生说之。于南方言我于<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>应受供养。于西方言我于世间最尊最胜。于北方言我当于一切众生中为无有上。于下方言我当降伏一切魔军。于上方言我当为一切众生之所瞻仰。菩萨说是语时其声普闻一切三千世界。虽有此异莫非世尊之所为故总云无上尊。如彼经云。菩萨于阿僧祇百千[牛*句]胝那由他劫修精进力故初生之时即能十方各行七步。一切诸佛威加此地化为金刚菩萨游践得无陷裂</p><p>经曰释梵奉侍天人归仰者。述云此明天人侍归也。菩萨生已于龙毗尼园七日七夜人天击奏种种微妙音乐以供尊颜。三万二千名闻胜智诸婆罗门。随其所须皆令满足。梵王帝释化作端正摩那婆身。于众会中坐第一座而演吉祥微妙赞叹。摩醯首罗与净居天设大供养宣说。此菩萨定得作佛。还归本处。生满七日已摩那圣后即使命终生三十三天。过七日已还迦毗罗。仪式庄严殊胜倍过圣后往龙毗尼园。五百释种各造宫殿请王而言善哉一切成利愿天中天幸我宫殿。以是成利<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故名菩萨为萨婆悉达多。王哀诸释。即将菩萨入诸释宫。经于四月方得周遍。乃将菩萨归于自宫。自宫之中有一大殿名宝庄严。菩萨居已。王召诸亲族长德耆年请摩诃婆阇波提为养育主。王躬抱付于姨母。姨母遂命三十二养育母养育菩萨。譬如白月从初一日至十五日清净圆满也</p><p>经曰示现算计至贯练群籍者。述云此第四伎备解宽也。算计者数文者即诗书艺者礼乐射者射术御者即御车。是谓六艺。六艺久达遂且示学故云示现。综子送反习也。陆法言切韵云机缕也。音并同也。非此中义。道术者即神仙之方。世俗异典名为群籍。仙道秘术无不温习故云广综。贯者通也练者委也。世俗异教亦皆通委故云贯练。即彼经中菩萨年始七岁备吉祥之仪。诸天人八部一切释种随输檀王而将菩萨诣于学堂。时有博士毗奢蜜多。见菩萨来威生大惭惧迷闷躃地。知足天子名曰妙身。扶之令起。王还本宫。菩萨手执天书栴檀之简涂以天香摩尼明玑以为严饰以问师云有六十五书欲以何书而相教乎。时毗奢蜜多闻所未闻喜去高心以叹菩萨世间无二。十千童子与菩萨俱居学堂时日唱字母演出无量法门之声。令三万二千童男三万二千童女皆发无上正等觉心故示现入于学堂也</p><p>经曰游于后园至色味之间者。述云此第五效艺纳妻也。讲武试艺者即嫂妻之前事。处色味间者即纳妻之后事。有人引本起云掷象角力名为讲武。共射金鼓说为试艺。犹有未尽故。今即菩萨年既长大。王问堪为太子之妃。执杖之女名耶输陀罗。端严第一。王敕国师往陈执杖。执杖报云自我家法积代相承技能过人以女妻之。王闻此言忧愁不乐。菩萨白王召有异术现我技艺。王于城外为一试场遍告天下集善技术。至第七日五百释子菩萨为首当共出往试场所。王遣白象以迎菩萨。提婆先至生嫉妒心。前执象鼻以手搏而死。难陀续至欲出城门见彼白象当路而毙。以手倒曳到于路侧。菩萨寻至。坐于宝辂以左足指持彼白象徐掷虚空。越七重城过一拘卢舍其象堕处便为大抗。尔后众人号为象抗。五百释种皆至此场。请毗奢蜜多为试艺师语言应观诸释种中谁最工书。毗奢蜜多微笑而言天上人间所有文字太子究之。王亦语頞顺那观诸童子谁优算数。时菩萨自唱数令诸童子次第下筹无能及者。诸童子等次第举数菩萨运筹唱不能及。五百童子一时俱唱亦不杂乱。頞顺那心生希有叹心智奇敏捷释种无及。诸释人天皆叹第一。五百释子角力相扑分为三十二朋。难陀就前骋其刚勇。菩萨举手才触其身威力所加应时而倒。提婆出众欲挫菩萨。菩萨安祥待右手徐投飘然擎举摧其我慢三掷空中。以慈悲故使无伤损。诸释种子俱生嗔忿锐意齐奔。菩萨指之无不颠仆。执杖大臣今可试射。阿难陀曰可置铁鼓二拘虑舍。提婆达多曰可置铁鼓四拘卢舍。孙陀罗难陀曰可置铁鼓六拘卢舍。执杖大臣曰可置铁鼓八拘卢舍。菩萨言可将铁鼓置十拘卢舍。菩萨七铁楯及七铁多罗树置十拘卢舍外。阿难提婆难陀执杖唯及自限皆不能越。菩萨引弓。弓及以弦一时俱断。更求良弓取先王弓与释子。释子皆不能张授与菩萨。菩萨安稳而坐。左手执弓右指上弦忽然而张。似不加力。弹弓之响遍迦毗罗城人皆惊怖。然后控弦射诸铁鼓悉皆穿过。铁楯铁树无不贯达。箭没于地因而成井。尔后众人号为箭井。人天唱言太子生年未曾习学备此技艺。于是执杖以女为妃。故今言讲武者即角力射鼓也。试艺者即试书运筹也。后园者即城外之苑也。现处者难陀爱欲遂宜示处。故即彼经云尔时菩萨随顺世法现处宫中八万四千婇女娱乐而住。耶输陀罗为第一妃。处王宫时能令八万四千诸婇等发无上觉心。无量诸天皆于无上正等菩提得不退转。说微妙偈劝请菩萨速疾出家</p><p>经曰见老病死入山学道者。述云第六出俗从邪。有三此初出俗尘也。弃国财位者即所弃也。诸天劝发菩萨已将诸官属出城东门。见净居天所化老人愁忧还宫。出城南门亦见病人不乐还宫。从西门出复见死人回驾还入。故今言见老病死者即净居天所化可厌之相也。凡有生者不问贵贱皆有老病必归于死。而生可欣故示令见。悟世非常者如经云<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>烦恼犹如猛火迷惑不离恒为所烧。犹如浮云须臾而灭。合已还散如聚戏场。故云非常。弃国财位者如颂云有为诸法悉<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。五欲财位皆不定。为苦所逼。诸众生愿速出家救济之。弃财者如经云染着五欲如被网禽。欲如怨贼甚可怖畏。处五欲者犹如履刃。着五欲者如抱毒树。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>舍之如弃涕涶也。入山学道者即所学也。太子出北门见出家人即下车问。夫出家者何所利益。比丘答言处于空间修习圣道。调伏诸根护念众生。不染世间永得解脱。菩萨喜叹天人之中唯此为上我定修学。如经云如昔诸佛处山林门得一切智广雨法雨今宜出家也</p><p>经曰服乘白马至剃除须发者。述云此次入道类也。宝冠璎珞遣之令还舍珍妙衣即所舍也。有说服乘即乘之别目非也。不应乘宝冠及璎珞故。今即服者着也乘者骑也。白马者即干涉也。宝冠璎珞者即诸庄严具也。菩萨思惟私自出家即违法教不顺俗理诣王所言今愿出家唯垂哀许。王敕释种于城四面各有五百警无暂休。菩萨语车匿我欲须干涉。匿闻天敕即取最上金勒宝鞍诸庄严具用被马王持以奉进。时静慧天令城人民皆悉昏睡。严慧天子于虚空中化为宝路。菩萨乘已初举步时升虚而行。四王捧承马足梵释示开宝路。去迦毗罗城至弥尼园。其夜已晓所行道路过六由旬。诸天八部事毕不现。菩萨遂行至往仙人苦行林中。下马叹匿我既至间处汝将干涉还。即自解髻取摩尼宝以付车匿还奉大王。脱身璎珞奉大圣主。余严具与耶输陀言。<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>世间爱必别离。今为断此苦故出家学道。匿闻菩萨语举声大哭。马前屈双脚甜菩萨足泪下悲鸣。菩萨即从车匿取摩尼剑即自剃髻掷致空中。释天承取还礼供养。菩萨自观身着宝衣即念不当。时净居天化作猎师身着<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>于菩萨前默然而住。菩萨语言汝所著者乃是往古诸佛之服。汝若与我我当与汝憍奢耶衣。猎师即应忽复本形上至梵天。于是菩萨剃须发身着袈裟言真出家。发遣车匿将干涉还。徐步往彼跋乐仙人苦行林中。大王教五人入山求侍。而不能及遂遁山林。菩萨行诣鞞留苦行女人所受彼请已。往波头摩苦行女人所亦受请已。往利婆陀梵行仙人所既受请已。后往光明调伏二仙人所受明日斋。遂至毗舍离城。城傍有仙名阿罗逻。将三百弟子常为其说无所有所定。闻仙所说勤修不倦住于小时。皆已得证更无所修非能尽苦。即出彼城往王舍城入灵鹫山独住一处。诸天守护。旦着衣持钵从温泉门入王舍城次第乞食。王传闻叹自涉高楼观菩萨身。因敕左右奉上饮食令发所住。诣菩萨所愿大慈悲于此国境证佛菩提使不我远。礼已还宫。而智论云去城十二由旬至跋伽仙人所者盖说剃发之所故亦不违过六由旬。今言珍妙衣者即与持举严身之具。着法服者即求猎师毁形之衣。若着此衣必离尘垢故云法服</p><p>经曰端坐树下至行如所应者。述云此后行从邪也。菩萨受王请欲往尼连河。王舍城边有一仙人摩罗罗子名乌特迦。与七百弟子常说无想定。至仙人所受彼说已于一静处专精修学。即得世间百千<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。随彼诸定种种行相皆现在前。起定问仙更无余法亦非沙门之法。五跋陀罗便舍仙人还从菩萨。菩萨出王舍城与五跋陀罗向尼连河至伽耶山思惟离贪。身心寂静勤修苦行即能<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>出世胜智。出彼山已行至优楼频螺池侧东西而视见尼连河。其水清冷涯岸平正。河边村邑栋宇相接人民殷盛。渐至一处寂静间旷。即作是念。往古已来修圣行者之所多住。见诸外道着我见者修习苦行。为欲摧伏故极苦行。经于六年曾不失坏。入第四禅名为阿婆婆定。常为天龙鬼神之所供养。能令十二洛叉天人住三乘路。波旬常随伺求其过而不能得生厌倦心怡然而退。行如所应者有说反邪学正道。即其所应修学慎而行故。若尔此文应属成道如何自许是出家相。有说行应前圣之所行故云如所应。此亦不然。前圣未必修苦行故。今即行如所应者简虚设劬劳减劣漂溺非方便行。即瑜伽论引颂而言。如如我劬劳如是如是劣如如我劣如如也如如是是住我住已如是漂。此中修苦行时非方便摄。勇猛精进名曰劬劳。行邪方便善法退失名为减劣。既知退失诸善法已息邪方便说名正住。舍诸苦行更求余师。遂于嗢达洛迦阿荼等邪所执处随顺观察故名漂溺。由此言之。菩萨虽复修诸苦行即趣正行之方便故云如所应。而修苦行已于余师随顺观察者却观前已所修二定故不违经义</p><p>经曰现五浊刹至得攀出池者。述云第七伏魔成道。有五。此初沐荡形垢也。刹者土也。菩萨既知苦行非菩提因亦念。于昔父王园中阎浮树下修得四禅是菩提因。应受美食令身有力方能往诣菩提之场。五[跳-兆+(乏-之+(犮-、))]陀罗便舍菩萨诣波罗奈仙人堕处。菩萨苦行已来优楼频螺聚落。主名斯那钵底。有十童女。昔与五[跳-兆+(乏-之+(犮-、))]陀罗常以麻麦供养菩萨。知舍苦行即作种种饮食奉上。未经多日色相光悦。于尸林下见有故破粪扫之衣。自手取持欲代苦行弊坏衣服言何处有水。时有一天。于菩萨前以手指地便成一池。后更思惟何处有石。释提桓因即以方石安处池中。菩萨见石持用浣衣。浣衣已讫入池澡浴。时魔波旬变其池岸极令高峻。池边有树名阿斯那。树神按枝令低。菩萨攀枝得上池岸。于彼树下自纳故衣。净居天子名无垢光。将沙门应量袈裟供养菩萨。菩萨受已于晨朝时着僧伽梨入村乞食。有善生女。闻树神劝即聚千[牛*孛]牛而揲其乳七度煎煮。唯取其上极精纯者置新器内。用香粳米煮以为糜。当煮之时于乳糜上现千辐轮波头摩等吉祥之相。有仙人语若有食者得菩提。善生煮已告优多必往请梵志。向四方行唯见菩萨。归白善生不见梵志唯有沙门瞿昙。善生速令延请。菩萨至寻受乳糜已擎乳糜钵。出优楼频螺聚落往尼连河。置钵岸上剃除须发入河而浴。浴竟坐河龙妃所奉之宝座食彼乳糜。体相如本。以钵掷河龙王收取宫中供养。释天变形为金翅鸟夺取金钵将还本宫起塔供养。由菩萨<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>力故食乳糜已相好圆光转增赫奕。总而言之。佛现化相处浊恶土。随顺众生示有尘垢。沐浴令净故云现示。而沐浴金河天按树枝者金河即尼连河。按枝即池岸树。前后互举故不相违。神亦名天故</p><p>经曰灵禽翼从往诣道场者。述云第二行诣道场也。菩萨澡浴身体后食乳糜气力平全。正念向彼菩提之树。从尼连河至菩提树扫洒令净。三千世界诸树诸山若大若小无不低枝低峰同菩提树。欲界诸天各化七宝多罗之树。二间有七宝池。池之四边七宝阶道。即有迦陵频伽凫雁鸳鸯命命诸鸟出和雅音。诣菩提树时其身普放无量光明。又有无量鹦鹉舍利拘只罗鸟迦陵频伽凫雁鸳鸯孔雀翡翠共命诸鸟。翻翔围绕出和雅音。菩萨欲坐菩提座夜。大梵天王以神通力令三千界除诸砂卤瓦砾荆棘地平如掌无有丘墟。皆以七宝而严饰之。有十六天子所谓转进无胜施与受欲等。守护菩提场皆证无生忍。复有四神护菩提树。毗留薄瞿苏摩那等。各以神力变菩提树。高广庄严姝好各长八十多罗之树。菩萨为欲降伏魔怨故以大人相西面而行诣菩提场也。有说如经云。五百青雀随从佛后故名禽翼从。皆神鸟故亦云灵。此必不尽。非唯青雀如前引故。今即翼亦从。从者随也。寄表而言天按树者即表众生感既发也。攀出池者即表佛应赴于机也。灵禽者即表同行眷属。不尔便违无垢称云所有进止施为皆是佛事故</p><p>经曰吉祥感微至跏趺而坐者。述云此第三瑞草应圣也。菩萨即知过去诸佛皆坐净草而成正觉。时释天变其身为刈草人在菩萨右持草而立。其草青绀如孔雀尾。渐问名答曰吉祥。便作是念。欲求利自他吉祥立我前定证菩提。故说颂曰吉祥汝今时宜速施净草。我当坐是草降伏魔军。若证寂灭时即问无上道。吉祥闻此言手持净妙草住于菩萨前。幸先授菩提然后受净草。菩萨报吉祥。非唯坐净草即护大菩提。应修无量德方蒙诸佛记。吉祥汝应知。我证菩提已分布诸世间。汝当于我所听受甘露法。菩萨取草周遍敷设。将证菩提而面向东。于净草上结跏趺坐。发大誓言我今若不得无上大菩提宁可碎是身终不起座。总而言之。佛将成道感此吉祥而为瑞。知必成觉而普利故云吉祥感征。征瑞也。即以此瑞示当所成功果福祚故云表章功祚。祚之阿反福也助也。章亦显也。受草之意证大菩提而利众生故云哀受施草。寄树成觉故云佛树。即三千界之中心也。众生宜见既有万品故佛应示座亦不定。圣教而同意在此也。结跏趺者即伏魔之坐。坐有二相。一降伏坐以左押右。二吉祥坐以右押左。我今虽伏魔意想成佛故作吉祥坐。加者重也。即交置足而坐。有为跏者不知所从</p><p>经曰奋大光明至皆令降伏者。述云第四智力降魔也。有说此魔义通八种。无为四倒近坏正解远障真德。虽非声闻之患亦是菩萨之怨名为魔故。此必不然。诸有往来即应天魔故。又示作相必非常等故。今即魔虽多种而此所伏正是天魔。故菩萨坐菩提座已今当成正觉。魔王波旬应召降伏令发菩提心。即放白毫相光遍照三千世界傍耀波旬之宫。魔王闻光中偈。世有最胜清净人经历多时修行满。是彼释种舍王位今现坐于菩提场。汝自称有大勇猛。当往树下共相校。波旬闻此偈已梦见其宫殿。皆黑闇震动不安。寤已遍体战栗心怀惧恐。魔有千子。五百在魔王右归依菩萨。五百在魔王左赞助魔王。魔王语诸子以何方计能摧伏彼。右面魔子名曰有信。白波旬言假使力碎三千界。如是大力满恒沙不动菩萨之一毛。何足能伤智慧者。左面魔子名曰百臂。复白波旬言我今身有百臂。一一皆能放百箭。大王但去不假忧。如此沙罗何足害。诸子慰谏不可备引。魔王又命诸女。汝等往彼菩提树下诱此释子坏其净行。放诸魔女诣菩萨前。绮言妖姿三十二种媚惑菩萨。复说颂曰初春和暖好时节。众草林木尽敷荣。大夫为乐宜及时。一弃盛年难可再。仁虽端正美颜色。世间五欲亦难求。对斯胜境可欢娱。何为乐彼菩提法。菩萨闻已心生哀愍。即以妙偈云我观五欲多过患。由是烦恼失神通。譬如火坑及毒奁。众生赴之而不觉。是身虚妄从业生。四大<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>假合成。筋骨相缠而暂有。智者谁应耽着此。凡夫迷故生欲心。我已解脱于世间。如空中风难可系。革囊盛粪非净物。我今不喜应疾去。诸女不能得。即以华散菩萨上右绕三匝作礼去。白魔王言我等昔来未曾见有如是之士于欲界中睹我姿容而心不动。唯愿大王勿与此人共为嫌障。时波旬诣菩提树告菩萨言。汝应速必起得轮王。菩提难得勿自劳形。菩萨报云我不乐五欲如既吐食。既坐金刚座勿得菩提。汝不应作此说而宜疾去。波旬嗔恨。即发兵众无量无边百千万亿。侧塞填呾菩提树边。皆不能害。波旬欲近菩萨亦不能进。菩萨语言汝以微善今获天报。我<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>修习圣行当得菩提。手指大地。地神即于菩萨前出自我为证。作此语时大千震动出大音声。魔众皆散魔亦还宫。总而言之。大明者即眉间白毫之光遍大千界故复云大。使魔知者即梦所见不吉祥之相。来逼试者即将诸兵众欲近菩萨之时。魔者魔罗。此云弊恶亦名杀者。有说智力者即十力智令魔降伏。若尔如何亦云降魔。是慈<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>故。今即智者菩萨之道。力者威神之力。欲坏自利即智能伏。若破利他即神力伏。随善一种义即阙焉故兼之也。神力必由慈定发故云智力皆令降伏。即智论云由得<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。余经亦云由慈三昧是也</p><p>经曰得微妙法成寂正觉者。述云此第五觉果斯成也。有说妙法是理。有说涅槃灭皆非也。不可唯言得理得灭成正觉故。今即菩萨降伏魔怨建立法幢游入四禅无有动摇。至初夜分得智得明摄持一心发天眼通。于中夜分得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>通皆忆自他过去之事。便观一切众生老死因生故有。乃至行亦因无明有。复更思惟因何灭故老死灭。即无明灭故行灭。乃至生灭故老死灭。复更思惟此色无明。此无明因。此无明灭。此灭无明道。乃至老死忧悲苦恼皆亦如是。于后夜分明星出时调御圣智所应知所应悟所应见所应证。彼一切一念相应慧证无上觉。备足三明为诸天子现成佛瑞。上升虚空高七多罗。以颂而言烦恼悉已断诸漏皆空渴更不复受生是名尽苦际。诸天生喜天华散佛积至于膝故。微妙法者即摄所<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>德悉尽之言。即瑜伽论云复于后时坐菩提座弃舍一切非方便摄勇猛精进所有善法遂得增长。于所修断转求胜妙遂不更求余外道师。无师自然修三十七菩提分法证得无上正等菩提名大觉者是也</p><p>经曰释梵祈劝请转法轮者。述云第八法化普洽有二。初加威祈请后因请起说。此初也。初成正觉。诸天叹已住喜悦定。观菩提树目不暂舍。禅悦为食不起于座。经于七日为居此处除诸苦故。第二七日周匝经行大千为限。第三七日观菩提场。亦为居此得大觉故。第四七日随近经行大海为边。时魔王请旷劫苦行方得成佛。唯愿善逝入于涅槃。佛报波旬求大菩提欲利众生。而我法中未获义利<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>未备未说妙法云何涅槃。波旬闻已心生忧恼。时彼三女见父愁苦更变其形。一为少妇之形一为中妇之形来至佛所。以神通力皆成老母。还至父所言我复为变化惑乱彼沙门。仍以大神通化我为老母。愿王以威力令得如本形。魔报诸女汝可自往<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>前罪。彼摄神力方得复本。诸女至佛言我今极生悔冀得罪销灭。唯愿慈悲力令复于本形。佛以慈悲故摄神通令复如本。第五七日住目真邻陀龙王所居龙神守护。第六七日往尼俱陀树下近尼连河。有多外道皆来慰问。第七七日至多演林<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>诸众生为生老病死所逼迫。时北<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>兄弟二人。为众商之主。一名帝履富婆一名婆履。以五百乘车载其珍宝还归本国。有二调牛。一名善生二号名称。巧识前路止不能进。心怀恐惧。林神忽语勿怀恐汝得大利。有佛出世初成正觉住此林中。不食已来四十九日。汝等应将种种饮食而以上之。时二调牛便向佛行。故诸商人随调牛而往。遥睹如来相好光如日出。生希有心以为天神。佛举袈裟即知如来。辨诸美味苏蜜甘蔗乳糜豆属乃时奉施。右绕三匝却住一面白佛。哀愍受我微供。佛作是思。以何器受。时四天王各上金钵。佛言出家不合汝钵。北方天王语余天言昔青身天将白石钵来与我等欲施石钵。今正是时。各还自宫持彼石钵以上如来。佛各受四天王之钵次第相重安置右手按之合成一器四际分明。时商众于晨朝时牧人揲乳。凡所揲者化为醍醐。心生希有选上粳米煮以为糜。和好合密盛栴檀钵以上如来。如来受已钵掷空中。梵王接还自宫起塔供养。佛自咒愿而授记莂。入深<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>观诸世间便作思惟。所证之法非心言境恐无利应。默然住而说偈言我得甘露<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。甚深寂静离尘垢。梵王若来劝请我。或当为转微妙法。螺髻梵王以佛威神即知如来默然之旨。与六十八拘胝梵众来白佛言。世尊多有众生堪能悟入甚深之法。唯愿说之。而佛默然。梵王亦知默然之旨。即与释天乃至阿迦尼吒天于夜分中至多演林礼已右绕。释天白佛请转法轮。佛犹默然。大梵重请佛说二偈。我证逆流道甚深难可见。盲者莫能睹故默而不说。世间诸众生着彼五尘境不能解我法。是故今默然。梵释诸天闻已忧恼忽然不现。复于一时大梵天王叹摩伽陀国诸外道等封着邪见诣佛偈请。摩伽陀国多诸异道。因邪见故种种筹量。唯愿牟尼为开甘露最清净法令其得闻。世尊以佛眼观诸众生上中下根及以三聚告梵王言。我今为汝请当雨于甘露。一切诸世间天人龙神等若有净信者听受如是法。梵王闻已喜叹不现。神唱言如来今受梵王劝请。于一念顷虚空神闻展转传至阿迦吒天。而今言梵释祈请者略举。不尽之言也。祈巨衣反作蕲求福也。转者即通自他转。自即如来三道转满。他即转所得法。至他相续法。转者即不定义。以移转故。佛虽既自转而未有他转故次请转</p><p>经曰以佛游步佛吼而吼者。述云第二因请起说有二。初身口略化后身口广利。初又有三。初文请警物也。佛游者即身业化。现佛威仪游化物故。如来所作已办无德不备。五眼清净观诸世间堪受法者。即念罗摩子三垢微薄闻法得证。以佛眼观命终七日。有天亦曰死经七日。后观外道阿罗逻仙死经三日。空中天言死亦三日。后作是念五跋陀罗根性已熟若闻开悟。以佛眼观。在鹿野苑中从菩提树向迦毗罗国波罗奈城振动大千。伽耶城傍有一外道名阿字婆。问佛所师及以所往。如来备答。即北游经伽耶城。城中有龙名曰善见。明日设斋。如来受讫往卢醯多婆苏都村。次至多罗聚落次经婆罗村。如是游历皆受长者<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>饮食。次第而行至恒河边。河水瀑集平流弥岸。飞腾虚空达于彼岸至波罗奈城。于晨朝时着衣持钵入城乞食请鹿园中。五跋陀罗遥见世尊共相谓言不须承事。唯憍陈如不同众心。佛近五人皆违本要无不起迎。皆言善来长老请坐。世尊坐已语五人言我备种智不得称呼为长老也。五跋陀罗请为沙门。佛言善来便成沙门。须发长短如剃。经七日威仪整肃如百腊比丘。世尊入池澡浴已讫思过去佛坐于何座而转法轮。忽有千宝座从池涌出。即起恭绕初三高座。至第四座结跏趺座。时五[跳-兆+(乏-之+(犮-、))]陀罗坐于佛前。佛放大光照大千界召人天众。地神神力令此道场纵广正等七百由旬。欲色诸天将八万四千宝师子座置道场中各请。世尊哀坐我座转正法轮。十方无量拘胝菩萨十方三千世界释梵护世诸天皆至佛所请转法轮。愍众生故雨大法雨建大法幢吹大法螺击大法鼓。时有菩萨名曰转法。持众宝轮备有千轮庄严绮丽。放千光明过去诸佛皆有此轮。然后转法奉上如来。如来于初夜默然而过。于中夜分安慰大众唤五[跳-兆+(乏-之+(犮-、))]陀罗言出家之人有二种障。一心着欲境而不能离。二不正思惟自苦其身。而求出离当舍此二边。今圣教是佛吼故云佛吼。吼即违彼经先称德号略说中道故。今即略申<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>。总说中道故云佛吼。吼亦转也</p><p>经曰扣法鼓至演法施者。述云此别申法化也。有说欲使有缘普得闻故扣法鼓。法鼓者令远闻故。吹法螺即欲改号令。改邪从正也。欲断障故执法剑。表胜出故建法幢。欲动执故振法雷。欲亡暗故曜法电。欲润众生故澍法雨。欲布药故演法施。此有虚言皆无可采。违世亲论亦违正理故。有说扣法鼓者说闻慧法。吹法螺者说思慧法。执法剑者说<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>法。建法幢者宣证慧法。振法雷者法无碍化。曜法电者义无碍利。澍法雨者词无碍说。演法施者乐说无碍利众生也。此亦不然。三慧皆觉证慧法故。三慧所学亦无异故。四辨所说亦即三慧法故。今即如来说中道已。为陈如等说四谛法及十二缘<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>还灭二门修行。三转十二行法轮已。陈如皆达诸法因缘成阿罗汉。即三宝出。婆伽婆为佛三转十二行法轮为法五[跳-兆+(乏-之+(犮-、))]陀罗为僧。转法轮声遍十方佛土。土别诸佛默不说法。化五人竟至优楼频螺迦叶所。寄止石室降伏毒龙。迦叶见佛神力难当。与五百资请为沙门。佛言善来皆成沙门。迦叶二弟难提伽耶各有二百五十弟子。见事火物遂水下流。即与五百人溯流而上。闻迦叶叹佛道神化求为沙门。佛言善来皆成沙门。佛与千比丘往波罗奈。于林下种种教化尽成应供。即从波罗奈与兄弟三人及千罗汉至摩诃陀国。频婆娑王大臣百官前后道从千乘万骑出城迎佛。佛近王舍在遮越林。王下车<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。佛即慰问以说云五蕴无常苦空。三界不实一切无常。问王有此国来几时。王答七百余代。而王领者唯知五文。佛言世间须臾唯道可恃。应修来福无为空过。遂说缘起转还之义。王得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净受<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。有长者迦兰陀。以好竹园奉上如来。如来咒愿而受。恒与圣众游处其内。佛有弟子名舍婆耆。入城乞食。时舍利弗问沙门师。以闻佛德将诸弟子至如来所请为沙门。佛言善来便成沙门。亦为说法成阿罗汉。入王舍城访目连。目连见舍利弗形状变改问所得法。共诣佛所愿为沙门。佛言善来便成沙门。亦为说法得阿罗汉。时输头檀王闻子得道已经六年饮渴弥积。语优陀夷言可往请佛。离别已来十有二载夙夜悲感不能自已。得一相见还如更生。受王教已诣佛具述愿为沙门。佛言善来便成沙门得阿罗汉。即遣优陀夷。七日当至。至七日已佛将诸弟子向迦毗罗城。父王出城四十里外以迎如来。便敕国内豪种端正选五百人度为沙门侍佛左右。佛弟难陀亦为沙门。难陀所使名优婆离请佛救度。佛言善来便成沙门。为王说法即时得道。总而言之即八句中执法剑澍法雨。故依法华论以义推之。应言执法剑澍法雨扣法鼓震法雷建法幢耀法电吹法螺演法施。故彼论云疑者断疑法欲说大法。即今执法剑。欲断外凡疑令进修故。已断疑者增长淳熟智身故雨大法雨。即今澍法雨。既入内凡而无疑者滋善萌牙令入圣位故。已根熟者为说二种密境界。谓声闻菩萨密境界。二句示现即击大法鼓不断大法鼓。以远闻故。即今扣法鼓振法雷。法雷与鼓义相涉故开往声闻乘为权密境。显今所说菩萨乘为实密境名二密境。今根熟者舍权取实故。入密境界者令进取上上清净义故。即建大法幢。菩提妙智极高显然犹如大幢。由知权实有舍有取。行大乘行得菩提智离清净故。进取上上清净义者进取一切智现故。燃大法炬即今耀法电也。既得真智建立菩提照于真境证涅槃故。取一切智现者为一切法建立名字章句义故。即吹大法螺。既得真境必须说教义诠一切法故名为一切法建立名字等。如俗作乐曲洛满位吹大螺吼。今既得果事圆满位为他证法亦复如是。即涅槃云吹贝知时。建立名字章句义者令入不可说证故转法义令演法施也。说于教者令所应度入于证故。求转法轮摧于烦恼故。散粮已说应于四对。一破恶进善对即初二也。二开权显实对即次二也。三得智证真对即次二也。四说法利生对即后二也。八句之义有此循环名为法轮。自既得果欲令众生证圣真智破灭烦恼故亦云转。然此释八相之义聊依牟尼既往之化以例诸菩萨当现之相。未必皆有。智者察矣</p><p>经曰常以法音觉诸世间者。述云此后略结口化也</p><p>经曰光明普照至六种振动者。述云第二身语广利有四。一伏魔令离邪。二破邪以弘正。三受供以生福。四说法令<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。初又有二。此初总标伏魔也</p><p>经曰总摄魔界至莫不归伏者。述云此后别释伏魔也。由放光故总摄魔界莫不归伏。由动震故动魔宫殿无非慑怖。慑(倚叶反)畏也摄身之貌也</p><p>经曰掴裂邪网消灭诸见者。述云第二破邪弘正有四。此初序破邪又有二。初除见品之邪也。邪网者即邪法也。诸见者即邪执也。邪见必依邪法起故皆破之。掴(古恶反)亦裂也。足踰口裂也。亦折也。裂(吕檗反)陆法言切韵云破也</p><p>经曰散诸尘劳坏诸欲堑者。述云此后除爱品之邪也。尘劳者即五欲境坌乱众生故云尘劳。说空以进故云散。欲堑者即爱欲之心。依境爱起境垢众生故云尘劳。贪深而难越可谓堑故。既观境空爱欲斯息故亦云坏</p><p>经曰严<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>城开阐法门者。述云此第二弘正也。有说法能遮防故名城。法有通入趣入义故名门非也。法法若一必有重言过故。今即法城者即智断之果。法门者即定慧之因。果必杀贼故名城。因能纳德故云门。叹善故严止谤故护。为演故开令进故阐</p><p>经曰洗濯垢污者。述云此第三结破邪也。垢污者即该见爱之通言。从教以除故云洗濯。濯亦浴也</p><p>经曰显明清白至宣流正化者。述云此第四结弘正也。除邪显正故云显明。超诸毁傍故云清白。即严护法城也。光广也融通也。广通圣行故云光融佛法。导化不绝故云宣流。法化即开阐法门也。总而言之。严法城故显明护法城故清白。开法门故光融阐法门故宣流</p><p>经曰入国分卫至示<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>者述云此第三受供生福也。梵云宾荼波陀此云乞食。今言分卫讹也。分卫丰饍者即受供也。贮德示田者即生福也。贮(竹与反)盛受曰贮。贮亦积也。积德既广。现受世供以生福利可譬田故。欲宣法现欣笑者。述云第四说法令修道有二。此初标将说之相。义同下文也</p><p>经曰以诸法药救疗三苦者。述云此后正申道教有二。初救苦之教后入道之教此初也。三苦者即苦苦坏苦行苦。如其次第三受之也。教有除苦之用故云法药。如教而行必度二死故云救疗</p><p>无量寿经连义述文赞卷上</p><p>无量寿经连义述文赞 卷中</p><p>释璟兴撰</p><p>经曰显现道意无量功德者。述云第二申入道之教有二。此初修因之教也。显菩萨发菩提心之意令得<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。难无量德使修行故</p><p>经曰授菩萨记成等正觉者。述云此后获果之教也。授菩萨记者即论云令得决定心故。记者识也别也。授者与也。圣说当果令识因利故云授记。成等觉者即所记之果也</p><p>经曰示现灭度至殖众德本者。述云此第九归真利物也。如摄论<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>灭度有六意。一事究竟故二为除乐倒故三令舍轻慢故四为生渴仰故五为身精进故六欲速成就故。今示灭度意亦在此。拯济无极者即益广也。极已也。除漏殖本者即利备也。漏谓三漏注泄为义。即<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>之因。德谓福智润益为功。即涅槃之因。本亦因也。因佛现灭众生厌有除生死因忻寂以修涅槃之因。可谓利备故</p><p>经曰具足功德至普现道教者。述云此第三双结也。具德难量者结其实德。游国显教者结权德故</p><p>经曰其所修行清净无秽者。述云第二就实以叹二利有二。初略叹后广赞。初又有二。此初别叹又有四。初叹自行净也</p><p>经曰譬如幻师至在意所为者。述云此第二叹化善巧有二。此初喻也。菩萨显化巧顺物宜可云幻师。所起化相如显众像起化之德如本学明。化法即以习学为本故云本。学之委善故云学明了。学成起化任意所为故云在意所为。远法师云学成起用成在于心故云在意。任意化故云所为。此恐非也。学未成亦在心故今不存也</p><p>经曰此诸菩萨至皆悉普现者。述云此后合也。诸菩萨者即合幻师也。修学一切化物之法故云学一切法。即合本学也。贯通也综集也缕诠也练陶也。即通穿群典集括事理诠表玄旨陶委众疑故云贯综缕练。即合明了也。智悲之境是权术所游故云所住。解心安境无错忘故云安谛。即合在意也。靡无也致运也。于诸感处无不运化故言靡不致化。又致即感致。令一切众无不<a href=\"/remen/ganhua.html\" class=\"keylink\" target=\"_blank\">感化</a>故。有经本云靡不感化其义无违。即合所为也。物宜既万品<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>不现。故无数佛土皆悉普现。即却合现众异像也</p><p>经曰未曾慢恣者。述云此第三结自行净也。于所修行生恭敬故无慢。亦无间故无恣</p><p>经曰愍伤众生者。述云此第四结化善巧也。愍谓慈愍伤谓悲伤。伤愍众生故无相不现</p><p>经曰如是之法一切具足者述云此后总结也</p><p>经曰菩萨经典至导御十方者。述云第二广叹有四。一依菩萨法修自分行。二依如来法修胜分行。三自分成德。四胜进成德。此初也。典常也究尽也畅申也通也要要道妙妙法也。于自分法究尽要道通申妙旨故云究畅要妙。即自利也。殊德在怀嘉响外流无物不叹故云名称普至。导御即利他也</p><p>经曰无量诸佛至而皆已立者。述云第二修胜分行有二。此初修内德也。行入佛境故共护念。念善令生长护恶使殄灭故。有说所住即真法界。摄论所说十法界也。所立即神通力。涅槃云能建大义也。此恐不然。能建大义既大涅槃利物之义必非自利故。有说所住即空无相理所立即十二分教。此亦不然。世俗之事应如胜义亦佛所住故。有说所住即证行所立即教行。法界诸度是佛所立故。此亦不然。违法华佛自住大乘义故。大乘必通教理行果。诸度既行应非所立故。今即佛所住者即二谛之旨。菩萨逐佛而既悟故云已得住。大圣立者即<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>之诠。大士亦达诠之意趣故云皆已立。佛与大圣即言异体同故互称而已</p><p>经曰如来道化至开导众人者。述云此后叹外化有二。此初化相也。菩萨普为影响助扬佛事故。道化能宣即说法同佛也。示行佛化故为菩萨师。即化物同佛也。深禅慧者即化行同佛。禅止慧观行虽众多要在此二故。开导众人者即利物同佛。开者令始学导者令终熟故</p><p>经曰通诸法性至明了诸国者。述云此后化德也。有说通诸法性者通法空理。达众生相者达人空生真。明了诸国者达器界空非也。离人法空更无别空故。若有别者亦离二智。应有别智故。有说通诸法性是智正觉自在行。通达二谛法性故。达众生相是众生世间自在行。众生种种体状皆了达故。明了诸国是器世间自在行。初云通次言达后言明。言之左右。此亦不然。众生外器应非世俗故。若世俗者通二谛已更无所知故。今即通法性者即法界无量行。达众生相者即众生界无量行。明了诸国者即世界无量行。所调伏界无量不摄无种姓故。略不说调伏。方便无量即前善巧故不亦说</p><p>经曰供养诸佛至幻化之法者。述云第三自分成德有四。一修之方便二修之成德三重辨起修四重申成德。初又有四。此初自利修也。供养诸佛化如电光者即福行也。善学<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>晓幻化者即智行也。有说欲供诸佛化现其身。一念遍至疾如电光。简邪取正故云善学。达正过邪故云无畏。统摄诸法故云网。即智方便也。亦见诸法非定有无其性如幻故云晓幻化。即智成就也。又于人不怯故学无畏。于法能知故晓幻化。有说诸法虽非无而非有故不见一法可畏。摄物不舍故云学无畏网。虽复非有而非无离有离无故云幻化。有说如观世音以无畏施网摄众生故云无畏网。三俱不然。善学若方便未达邪正。应非无畏故。诸法非有不见可畏。既亦非无。可畏故。如其次第。今即现化供佛虽忽遍至而不住故如其电光。学无畏网者即达诠之智。晓幻化法者即悟旨之智。网者教也。即佛备四无畏故云无畏。若理若事无不如幻故云幻化。菩萨称<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>之意以达诸法言说<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>不可得故云善学晓了</p><p>经曰坏裂魔网解诸缠缚者。述云此第二利他修也。魔网者即天魔之教。缠缚者即八缠三缚。有说十缠四缚。于小乘宗虽有此义非大乘故。即坏魔网令虽恶业。解缠缚而使绝烦恼故</p><p>经曰超越声闻至无愿三昧者。述云此第三重辨自利也。超二乘地者即对余乘以显胜。得空无相无愿者即直申行胜。初发大心尚过二乘况亦久行。故云超越。欲入大涅槃必三三昧为门故偏说此三。如瑜伽论云。我法无故空。空故无相。无相故不可愿求。而有处云空无愿无相者即共二乘行故不相违。有说前教行此证行故有不同非也。学无畏网虽可教行而晓幻化应言证故。今即前是菩提之道后是涅槃之门。故须再解</p><p>经曰善立方便至而现灭度者。述云此第四复辨利他也。方便虽多此中方便即巧权之名。有说善方便即意方便。示现三乘而灭度者即口方便。善立三乘随便度物名善方便。说三乘因及灭度果名显示现灭故。此必不然。于下中乘而现灭度既应化相。必不可言说二乘果。不尔如何言现灭度。而不言说故。有说善立方便是口方便。示中下乘而现中下灭皆身方便。此亦不然。示现三乘义已具足。亦言现灭度应无用故。不尔三乘有何不摄亦说中下耶。故今即善立方便即意方便。随顺诸佛寻三乘化故。显示三乘即口方便。分别一乘而说三乘。三乘亦即佛方便故。中下灭度即身方便。缘觉名中声闻名下。即同法华中无二三之义。菩萨欲引不定二乘令趣佛乘故于彼涅槃而现灭度。即同摄论变化故云意。佛地经曰成所作智起三乘化作四记论即其事也</p><p>经曰亦无所作至得平等法者。述云第二修之成德有二。初自利之德后利他之德。初又有四。此初所得平等也。有说三乘性空故无所作。不见别证三乘之果故无所有。达无性真以解诸法不生灭故不起不灭。非也。决定二乘既入无余。不可定言即无别证故。又显三乘故非无所作。现灭度故非无所有故。有说无因可作故无所作。无果可有故无所有。无净可起无染可灭故云平等。此亦不然。因有功能故非无所作。果藉缘有故非无所有故。今即无作无有者即事平等也。不起不灭者理平等也。无实作用故无所作。不能自生故无所有。净法虽增真不随增故云无起。染法虽灭如不随灭故云不灭。诸法一相所谓无相故云平等。于是证会故亦云得</p><p>经曰具足成就至诸根智慧者。述云第二所成众多也。有说初习名三昧成就名总持非也。佛地应无三昧。即违诸教故。今即总持虽通定慧正是慧性故。百千三昧即总持所依。广如地经。有说诸根通即一切善法别即信精进念定非也。泛言善法皆通有为诸法。有为善中虽有名根无为必非故。又信精进等名诸根者不应别说智慧故。既说三昧即定别目。而有何因亦说定根。故今即诸根者六根清净。此诸菩萨位阶十地已。得自在六根互用故。总持虽慧慧未必持故。引导众行故须别说</p><p>经曰广普寂定至菩萨法藏者述云此第三所证广也。法藏者即十万法蕴。简二乘藏故云菩萨。即所证深也。有说普定能证广。一切法中不起<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>故。藏所证深。于真法藏能深入故。若尔即违自许所证深广名义也</p><p>经曰得佛华严三昧者。述云此第四所成奇胜也。佛地功德能严<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>故云佛华严。入此三昧现见诸方佛及佛土故亦言得。即华严云彼一三昧该摄法界一切佛法悉入其中也</p><p>经曰宣扬演说一切经典者。述云此第二利他之德也。助佛扬化故云宣扬。即简如来。如来目演说故</p><p>经曰住深定门至无不周遍者。述云第三重辨起修有二。此初起自利修也。有说深定者起通所依理定。有说一念周遍者入定观众生。二俱不然。通既事德。所依之定必非理定故。睹无量佛应非一念故。如其次第今即通所依定无境不观故云深定。睹诸佛者即天眼通。一念遍者即神境通。依此深定以发天眼能见诸佛故摄行广。亦起神通一念遍至所睹佛土摄福生智故起行疾</p><p>经曰济诸剧难至开化一切者。述云此后起利他修也。有说二乘于救生即闲菩萨即不闲。凡夫于修即闲菩萨不闲。二乘凡夫于无上道即闲菩萨即不闲。此皆不然。若如所言应说<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>精进故。闲即闲处必非懒惰故。有说剧难有八。恶趣有三即三恶趣也。人间有四。一盲聋喑痖二世智辩聪三佛前佛后四北俱卢洲。天上有一谓无想天。故八难中三涂为剧菩萨济之。人天苦微故云诸闲。菩萨勤化故云不闲。此亦不然。天上有一。即违余经说非想天为第八难故。又人天难言诸闲者有诸人天非难所摄。应非菩萨之所化故。有说剧难者即八难也。此中阿鼻受苦无间故言不闲。余七名闲菩萨以能救名济。此亦不然。应说余七。说何名七。若说后七难名闲者即七<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>应非不闲。闲所摄故。若说七地狱名闲者即八寒狱亦非二摄。菩萨救济应非遍故。今即八难名为剧难兼非想天。更有业惑二种障者名为不闲。若非八难及无二障皆曰闲。菩萨大悲皆能拔除故亦云济。真实际者即所证也。二空真如更无过者故云实际。菩萨大慈分别其诠开示其旨令证入故云分别显示。辩才智者即发说之解。以得如来四无碍智解诸义故。入众言音者即起说之言。以得解语言三昧起诸说故。入者解也。辩才充内巧言外发无物不化故云开化一切</p><p>经曰超过世间至度世之道者。述云第四重申所成有二。此初成自德也。过世间者申断德成过二死故。即对法云过世间者总显烦恼解脱义也。住度世道者标智德成并二智故。即<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>云法驶流中任运转故。谛者安也度者出也。即出世道之别名故</p><p>经曰于一切万物至为重担者。述云此后成化德也。由成智断遍于万物。若变若化皆任意故名为自在。庶者凡庶类者品类即众生之总名。故有经本云众生类也。宿无道根现无信乐不知感圣故云不请。于是尚接引况亦有请者故云不请友。即经云不待时义也。群生者即胜鬘中四种众生。所谓无闻非法及求三乘者。有说于四群中初非法人无感圣善故云不请非也。后三乘种未必皆有感佛善故。初无闻人亦应有感圣世善故。华严瑜伽皆有此四。而后三种通定不定。初之一种无性有情。故人天善根应成就。菩萨荷此四群生为自重担而成就故云荷负。作不请友皆该四群也</p><p>经曰受持如来至常使不绝者。述云第四重辨胜分修成德有二。初辨所修行后申所成德。初又有二。此初自利修也。有说甚深法藏即如来藏。暗障既除显在己心故云受持。法界诸度即佛种性。护使离障起善无间名常不绝。此恐不然。如来藏性既是真体。必不可言受持法藏故。既言法藏亦云受持。即知教法非佛性也。今既受持佛教令久住世有性之属依之殖善故常使不绝。即同上生云汝善受持莫断佛种也</p><p>经曰兴大悲至施诸黎庶者。述云此后利他修有三。此初法也。大悲愍众生者即拔苦行。演慈辩授法眼者即与乐行。辩者即乐说之辩。以慈定心而说法故云演慈辩。如说而行必入圣地得法眼净故云授法眼。法眼者即慧眼遂体之名也。悲定说法以拔三涂之苦故云杜三趣。杜者塞也。演慈辩而令修人天业故云开善门施诸黎庶事父唯敬于母亦爱。故慈若敬父乐可尊故。悲如爱母苦可爱故。于诸众生视若自己者此后合也。若己者意在如自一子。即涅槃云视诸众生犹如一子是也。慈悲怜伤皆如己子故</p><p>经曰一切善本至不可思议者。述云此第二所成之德也。善本者即福智之因。度者至也。福智之行皆至菩提涅槃彼岸故即因成也。获佛功德者即福德庄严。智慧圣明不可思议者即智慧庄严果成是也</p><p>经曰如是之等至一时来会者。述云此第四总结也</p><p>经曰尔时世尊至光颜巍巍。述云此第二说经因起序也。诸根悦豫者是喜悦相。有色五根皆显喜悦以表净土快乐无间故。豫亦作悆也。姿色清净者是无忧恼。色无惨戚以表佛土无众苦故。巍巍者即高大之称。光颜者即该根色之总言。故重表彼土有乐无苦。姿者妙也。即帛谦皆云面有九色光数千百变。光色甚大明也。有说佛无有不定心。备诸根相好身相复有。何时不悦。但欲加来问故因此表所说非也。佛虽无忧喜而显欣笑。讵备诸相好无显喜悦。故今世尊显喜悦者彼佛所成行德可庆故众生获利时将至故</p><p>经曰尊者阿难至长跪合掌者。述云第二问答广说分有六。一问佛显相二审问所以三彰问自请四叹问敕许五阿难欲闻六如来广说。初又有二。此初申请问之仪也。圣旨者即如来显相之旨。以密加威故云承旨。长跪者即双膝着地之号也</p><p>经曰而白佛言至殊妙如今者。述云此后正问显相意有三。初申所见次唱所念后征所为此初也。镜光外照名为影表。即同佛身光明外舒。外照之光显影畅在镜内名为影裹。亦同所放之光还曜佛颜故云表裹。即举己所见也。未曾瞻者怪今异昔。瞻亦见也</p><p>经曰唯然大圣至奇特之法者。述云此第二彰己所念也。远法师云虽有五念初即总表后四别申。故唯有四意。即后四所念在世所无故云奇特。此恐不然。佛所住法非此五念之所尽念况亦四念。故不可总五而言四。若言奇特故知总句者如来之德亦无别指故应非别念故。即今阿难略申五念各有所标。此初念也。有说唯者即专义唱己专念故非也。违诸世典应对之仪故。今即唯然者应上之言也。泛言今日者即简往来之言。依神通轮所现之相非唯异常亦无等者故云奇特。即立世尊名之所以也</p><p>经曰今日世雄住诸佛所住者。述云此第二念也。有说所住者即大涅槃诸佛同住故。佛于世间最为雄猛故云世雄非也。佛<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>涅槃非今日住故。今即如来住诸佛平等三昧能制众魔雄健之天故住佛住。为世雄名之因也</p><p>经曰今日世眼住导师之行者。述云此第三念也。有说四摄法是佛导师摄化之行。佛住此行能开世人令见正路故名世眼此亦非也。四摄之行虽复化物而非眼义故。今即五眼名导师行。佛住五眼引导众生更无过者故。以导师行以释世眼之义也</p><p>经曰今日世英住最胜道者。此第四念也。最胜道者即大菩提四智心品。佛住四智独秀无匹故从最胜道立世英之名也</p><p>经曰今日天尊行如来德者。述云此第五念也。天尊者即第一义天以解佛性不空义故。即唯佛所有不共佛法名如来德。余圣所无故以如来德释天尊之名。虽远法师名德别解今即以德释名者观此经文顺标释义故。名者世尊世雄等。德者即奇特所住等</p><p>经曰去来现佛至念诸佛耶者。述云第三征所为有二。此初念所为也。有说去来现佛者三世佛相念。佛佛相念者十方佛相念非也。离于三世更无十方佛亦不然故。今即举三世佛相念类此得无今如来念诸佛耶。耶者即不定之言。测此佛念诸佛未听敢专决故</p><p>经曰何故威神光光乃尔者述云此后征所为也。光光者即显曜之状也</p><p>经曰于是世尊至问威颜乎者。述云第二佛审问所以也</p><p>经曰阿难白佛至问斯义耳者。述云此第三阿难唱问所以也。理实虽承如来加力而对诸天故云自问</p><p>经曰佛言善哉至所问甚快者。述云第四叹问敕许有二。初叹其所问后举德敕许。初又有三。此初总叹也。阿难所问称机及法而合时宜故云甚快</p><p>经曰发深智慧至问斯慧义者。述云此次别叹其问也。发深智慧者叹问之智。真妙辩才者叹问之言。愍念众生者叹问之意。有说<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>五德故发深智慧。叹佛住于五德故云真妙辩才。此恐不然。念佛五德叹佛五住义无别故。念若不叹叹若不念皆非正理故。今即称佛之五号故发深智慧。将五住之德叹五号之义故真妙辩才。虽问五德五德皆以智为主故云问慧义</p><p>经曰如来以无盖大悲矜哀三界者。述云此后别叹问利有四。此初彰佛悲怜也。有经本云无尽大悲。有人释此依内无尽法而生故。今即佛之大悲更无覆盖故名无盖。无盖是正不可须治。矜亦怜也</p><p>经曰所以出兴至真实之利者。述云此第二彰佛利物也。光阐道教欲拯群萌者辨教利物。光者广也阐者申也。慧以真实之利者即理利物。慧者施也。有别本云普令群萌获真法利义亦无违。如来所以出于世者欲以教理利众生故</p><p>经曰无量亿劫至时时乃出者。述云此第三辨佛难值也。帛谦皆云如世间有优昙树但有实无有华也。天下有佛乃有华出耳。今言灵瑞华者即存震旦之名。时时者即希出之义。以善时出故</p><p>经曰今所问者至诸天人民者。述云此第四正申问益也。即帛谦云若问佛者胜于供养一天阿罗汉辟支佛<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>诸天人民及蜎飞蠕动之类累劫百千万亿倍矣</p><p>经曰阿难当知至无能遏绝者。述云第二举德敕许有二。初举佛德以述成后敕许以答所问。初又有二。初直述果胜后将因显胜。初又有二。此初述阿难所念也。如来正觉者即奇特之法。其智难量者即平等三昧。发胜妙智故以智难量述住佛住。多所导御者即述导师行。有说慧见无碍即如来德非也。越述天尊之德却成最胜道无别所以故。今即慧见无碍者述最胜之道。无能遏绝者即如来德。遏(阿达反)壅也绝也。佛德既胜妙不为余圣之抑遏故云无遏绝</p><p>经曰以一飡之力至光颜无异者。述云此后述阿难所见也。一飡之力者即施食之因。能住<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>乃至复过于此者乘叹寿命。诸根悦豫乃至光颜无异者正述所见。诸根悦豫者即前所见。不以毁损者辨其悦豫义。姿色不变者即前姿色清净。清净即不变义故。光颜无异者即前光颜巍巍。巍巍即无异义故。施食虽有五果而唯述命色者色是所现故命是所依故。有说不以毁损不变无异皆辨常然非也。若常然者阿难不应言未曾睹妙如今故</p><p>经曰所以者何至而得自在者。述云此第二以因显胜也。定止也慧观也。究畅者即究竟通畅之义。无极者即广远无边之名。所以如来得慧五德身三相者即慧究竟故得所念五德。定究竟故得所现三相。因虽众多<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>二行是净土路故。万行所依导众行故。说此二行余者兼也。二因既满无德不圆故于诸果法而得自在。即安慧云证得一切法自在也。有说定慧究竟无极即心自在行。得诸法自在即法自在行。善入一切法界门无所不现故非也。于一切法而得自在。若非果者必非自在故。前解为善</p><p>经曰阿难谛听今为汝说者。述云此第二敕许以答所问也。谛听者即敕其后心。为说者即许其前请</p><p>经曰对曰唯然愿乐欲闻者。述云此第五阿难欲闻也</p><p page margintb15></p></div>"
}]