[{
    "title": "维摩经略疏 第一卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第一卷</p><p>维摩经略疏序</p><p>今兹<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>即隋炀帝。请天台大师出之。用为心要敕文具在国清百录。因令侍者随录奏闻。但至佛道品后分。章安私述续成。初文既笔在侍人。不无繁广。每有缁素诸深见者。咸欣慕之。但云弊其文多。故辄于其录而去取之。带义必存。言繁则剪。使旧体宛然。不易先师之本故也。然自省闇短虑失元规。尝于坟堂然香求征。傥少坏大道愿示以留碍。二旬未竟佛道斯终既免幽诃。宁非冥护傥裨其宗旨则光光后昆。冀诸达人恕以专辄</p><p>天台<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>湛然略</p><p>释佛国品之初</p><p>次明入文大为五意。一明经度不尽。二略分文。三辨佛国义。四释品。五正入文。初意者前后五译不同。今释什本寻经文义。西土犹多。何以知之。如命十<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。如是五百乃至八千各辞不堪。不堪之言并不来此。推此而论经卷不少。又文殊入室传如来旨。殷勤无量兼八千菩萨各说入门。此诸言谈何止半卷。爰至出室诣庵罗园对扬如来辨佛国义。当时敷演高论往复。岂容止有数纸经文意谓。振旦生民神根狭劣。不堪具足读诵<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。删彼富文采其纲格流传兹土。略存义焉。问此经西土文言浩大。将不是大论明佛所说不思议经有十万偈耶。答有云即是今谓不尔。大论所明不思议经是华严别名。故论云<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>有二种一共二乘说。二不共二乘说。不共说者如不思议经。故华严云此经不入二乘人手。共说者即是摩诃般若及诸方等。问华严岂得名不思议。此经一名不可思议<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。何故反谓非耶。答此经既有两名岂独华严更无别称。然细寻大论前后所引不思议经。悉是华严如说。讴舍那优婆夷。为须达那菩萨说度<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>数量。乃是华严明善才入法界所闻之事。若引此经即云毗摩罗诘所说。二分文为二。先出古今次明一家。先明诸师者什生及古诸师悉不开科段。直帖文解释。而肇师云始于<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>终法<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。其间所明虽殊不思议一也。是则宝积发问已前为序。嘱累一品以为<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。其间并是正说也。次灵味小亮云此经题既云净名所说。从方便品皆是正说。次开善师分为四。一序讫菩萨品。二正即室内六品。三证成即菩萨行阿閦佛两品。四流通即法供养嘱累两品。若<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>光宅同用初四品为序。入室六品为正。后四品为流通。晚三论师亦同此释。北地论师用佛国一品为序。方便品讫见阿閦佛品十一品为正。后两品为流通。但古今不同互有分别。承习之者各有宗门。诸禅师见此分别多延纷诤。不开科节但约观门直明入道。次明今家者。若不开科段则不识起尽<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>承蹑。若开科段执诤纷然。于解脱之法横生系累。今寻经意趣傍经开科而非固执。夫佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>虽复殊源而初中后善文必备矣。今约此三对序等三。仍为三意。一正开经。二约观心。三异众家。一正分经者经无大小例有三段。谓序正流通。序者大圣将欲说法必先现瑞表发以为由藉。如欲说大品即放支节杂色之光。表欲说般若以导诸行。欲说法华放眉间光。表欲说中道实相。今经合盖现土。表欲说佛国<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。既由藉不同。正表教门。赴机有异。发起物情使咸信慕归宗有在。故曰序也。二正说者<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>睹瑞悉皆忻仰堪闻圣旨。大圣知时赴机设教。时众闻经咸沾法利。故名正说也。三流通者流譬水之下霔。通则无滞无壅。如来大慈平等说法。非止但为现在亦欲远被正像末代有缘。使咸沾法润。是则法水流霔无穷。并沾斯泽故名流通也。今开为三。一从如是我闻讫七言偈。具通别二序。此于正说由藉义足名为序分。二从宝积请问佛国因果已去讫阿閦佛。有十一品半。皆明不思议解脱佛国因果。皆是赴机之教。现在沾益。并为正说。三从法供养讫嘱累。明天帝发誓弘经。如来印可劝发嘱累宣通未来。使流传不绝。此并嘱流通也。问此经题称维摩诘所说。今何得从佛国为正。答净名承佛威神助佛扬化。化道有功故从其受称。譬如国王敕臣布政。布政有功而臣受赏。正命之主归于国王。受功之名而臣受称。不可谓臣受赏而臣为正。君垂正命而翻为傍。净名得佛印定方乃为正。故名维摩诘所说经。二约观心者即约<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>以为三分。二观方便即是序义。得入中道即是正义。双照二谛心心寂灭。自然流入即流通义。三简异者。问何不依什师及诸禅师不分科段。答若论观行实不繁开。今欲令学者知文起尽。识圣善巧言不孤。致必有承蹑。若于文无壅帖释。观行转觉分明。问何不全用肇师注意。答法供养属正义不然也。问何不依灵味。答佛国为序义不应然。何者佛为法王道王。三千有所宣说。岂非正也。但宝积所请佛所酬答。赴此机缘明佛国因果。时众闻经获大小益。岂折为序。又且净名助佛阐扬。正是奖<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>教。岂可弟子助说为正大师说者翻为序乎。问何不同开善。答经无大小例有三段。何得此经独开为四。问何以不同庄严光宅及三论师。答佛国为序其妨同前。又用菩萨行阿閦佛以属流通。恐此不然。何者净名掌擎大众。还庵罗园对佛印定。室内所说方得成经。又佛还对净名。辨佛国因果撮经终始。宗旨分明大众蒙益。过乎室内。此是正说。岂谓流通。问何不依北地大乘师。答佛国为序其妨同前。三释佛国义者。此明长者子宝积问佛国因果。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>具答。身子生疑佛以神力现净土相。时诸大众得大乘益。还复秽土求声闻。众得小乘道。约此标名故云佛国。此经既以佛国为宗。必须明识佛国之义。今略为八重。一总明佛国二别明佛国三明修佛国因四明见佛国不同五明<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>六明说教七约观心八用佛国义通释此经。一总明佛国者。前说普集及诸方等多明正报。今因宝积厌盖如来合盖现土即表欲说依报。何者正报既显须广明依。如说王民必须知土治正事业。言佛国者佛所居域故名佛国。譬如王国虽臣民共住。而从王受称名某王国。今佛虽与有缘共居而从佛受名名某佛国。<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>所依名为佛土。佛住界分名佛世界。佛所居止万境不同亦名为刹。然国有事理。事即应身之域。理则极智所照之境。而至理虚寂本无境智之殊。岂有能所之别。但以随机应物说有真应故明理事也。然非本无以垂迹故有应形应土非迹无以显本。故引物同归法身真国。故文云虽知诸佛土永寂如空。而现种种清净佛土则应同凡圣。现有封疆。凡圣<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>高下殊别。所现净秽亦复如是。故璎珞云起一切众生应一切国土应。或有释言应国者是众生集业所感。故文云众生之类是菩萨净土。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>慈悲来此现生。故法华云而生三果朽故火宅。为度众生生老病死。有云诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>身。犹如明镜一切色像悉现其中。是则一切国土皆从法身本国应现。国由佛身故云佛国。故法华云。今此<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>皆是我有。其中众生悉是吾子。今详斯语若云应国从法身现。即是自生。若从众生即是他生。众生对佛即是共生。若离生离佛即是无因而有土也。皆堕性义。此即须破。当知国土若净若秽皆不可说。有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故而可说者。悉檀赴机皆得说也。二别明佛国者。诸佛利物差别之相无量无边。今略为四。一染净国凡圣共居。二有余方便人住。三果报纯法身居。即因陀罗网无障碍土也。四常寂光即妙觉所居也。前二是应即应佛所居。第三亦应亦报即报佛所居。后一但是真净非应非报。即法身所居。言染净者九道杂共。何者<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>鄙秽故名为染。三乘见真故名为净。三六共居故名染净。亦名凡圣同居国也。就染净土凡圣各二。凡居二者一恶众生。即四恶趣也。二善众生即人天也。圣居二者一实二权。实圣者四果及支佛。通教六地别十住圆十信后心。通惑虽断报身犹在。二权圣者方便有余三乘人。受偏真法性身。为利有缘愿生同居。若实报及寂光法身大士及妙觉佛。为利有缘应生同居。皆是权也。是等圣人与凡共住故云凡圣同居。四恶趣共住故云秽土。二明同居净土者。无量寿国虽果报殊胜难可比喻。然亦染净凡圣同居。何者虽无四趣而有人天。何以知之。生彼土者未必悉是得道之人。故经云犯重罪者<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>之时<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a><a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>便转即得往生。若但圣生凡夫何得愿生彼土。故知虽具惑染愿力持心亦得居也。圣生权实类前可知。但以无四恶趣故名为净。举此往类。同居之国优劣非一。虽复秽净多种。如<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>授弟子记所住国土。束而明之并属凡圣同居土也。问染净国名出何经论。答思益论云。日月光佛命梵天来此土云。汝当用十法游彼世界。娑婆之土名染净世界。染即是凡净即是圣。问秽土十恶所感四趣依正。皆秽可然。但十善果净土因同何得依正顿殊别耶。答二处修因善名虽同。净土修善精微胜故。故彼凡圣所得依正不同秽土。二明有余土者。二乘三种菩萨证方便道之所居也。何者若修二观断通惑尽。恒沙别惑无明未断舍分段身。而生界外受法性身。即有变易所居之土名为有余。亦名方便方便行人之所居也。故摄大乘七种<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。此即第四方便生死。问有余国名出何经论。答法华云。我于余国作佛更有异名。是人虽生灭度之想而于彼土求佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。即其义也。大论云二乘入灭虽不生三界界外有净土。于彼受法性之身。三明果报土者。即因陀罗网是<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>世界纯诸法身菩萨所居。以其观一实谛破无明显法性。得真实果报。而无明未尽润无漏业受法性报身。报身所居依报净国名果报国也。以观实相发真无漏所得果报。故名为实。修因无定色心无碍亦名实报无障碍土。言无障碍者谓一世界摄一切世界。一切世界亦如是。此名世界海。亦名世界无尽藏。别教初地入此世界有七种净义。一同体净。如一即一切一切即一。二<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>净。一切国土平等清净。三庄严净。一切佛土<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>庄严。四受用净。离一切惑成清净道。五住处净。大智众生悉满其处。六因净。入佛土妙平等境界。七果净。随物所宜而为示现。前五是体满。有体相用。六是因圆。七是果满。初住生彼悉成就此七净义。问出何经论。答仁王云。三贤十圣住果报。当知即是果报为土也。法华云<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>坦然平正。其诸菩萨咸处其中。大论云法性身佛为法身菩萨说法。其国无声闻支佛之名。华严明因陀罗网世界。摄大乘明华王世界。皆明果报土无障碍相。四明寂光土者。妙觉极智所照如<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界之理名之为国。但大乘法性即是真寂智性。不同二乘偏真之理。故<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>云。第一义空名为智慧。此经云若知无明性即是明。如此皆是常寂光义。不思议极智所居故云寂光。亦名法性土。但真如<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>非身非土。而说身土。离身无土离土无身。其名土者一法二义。故金刚般若论云。智集<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>通。如是取净土。非形第一体非庄严庄严。问出何经论。答仁王云。唯佛一人居净土。此经云心净则佛土净。心净之极极于佛也。普贤观云。释迦牟尼名毗卢遮那遍一切处。其佛住处名常寂光。问经论散明可如向说。不见四土一处出之。答经论度此本自不多。寻读之者又不备悉。四土共出何必无文。正如此经答长者子。即是其意。文云随所化众生而取佛土。随所调伏众生而取佛土。随诸众生应以何国入佛智慧。随诸众生应以何国起菩萨根。若对四土宛然相似。名目既异。佛意难量。在下对文别当解释。问此经未明开权显实。何得明二乘生有余土。答经云佛以一音演说法。众生随类各得解。何妨二乘通教菩萨并得横解。别圆两教横竖无碍。问华严明十种佛土。此四摄尽以不。答何但摄十。乃至有人言经明二十七品佛土。无量寿土止是第六。见文对四摄无不尽。问若尔何不依十及二十七。答一往有文欲对四教。厝意难见。三明修佛国因者。此经非但约正报果明依报国。亦约正因明于依因。依因者即佛国因。故佛答宝积横约十七正因以明依因。竖约十三正因以明依因。国既有四须明四因。一往明四教菩萨愿行之因感四<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>依因感于四土。子细穷核非无小妨今还约四义分别一者菩萨修三权一实愿行之因。成就众生。若四种众生未断界内缘集。若断未尽菩萨界内成佛之时。四种众生来生同居之土。修于四种愿行之因。二者菩萨修于权实四行成四众生。四种众生方便观成界内结尽。菩萨于有余土成佛之时。四种众生同生其国。修于别圆两教之因。三者菩萨修于别圆教愿行之因。成就二种众生。二种众生能断无明。菩萨报国成佛之时别圆众生成于实相无漏之因。来生其国同修圆因。四者修于圆断愿行之因。因极果满成妙觉位居常寂光。禀圆众生若修圆因愿行圆极。亦栖寂光。十方诸佛湛。若<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无有增减。为成众生起四土因。引四众生同栖佛国。修愿行因成<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>果同居寂光。尽未来际如法华寿量品之所明也。四明见佛国不同者。此经云譬如诸天共宝器食。随其福德饭色有异。至论佛土皆如虚空。岂有不同之见耶。若不见相而可见者。具有十番下释饭色。当分别也。问经言诸天同宝器食。随其福德饭色有异。此为是一质异见。异质一见。答应作四句。一异质异见。如娑婆极乐。此土见秽彼土见净。二异质一见。如娑婆极乐。垢净质异。别圆菩萨用天眼见但一有余。三一质异见。如身子螺髻所见。于一有余见同居土净秽之异。四一质一见。谓罗汉支佛三种意生。此五种人界内结尽同生有余。所见无异。问那约有余明一质耶。答三乘同以无言说道发真无漏。所感国土一<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>同。故言一也。问此经譬如诸天同宝器食见饭色异。为是无障碍色有障碍见。有障碍色有障碍见而有异耶。答应作四句。一有障碍色有障碍见。即染净有余两土不同。二有障碍色无障碍见。即法身菩萨无碍天眼见染净有余。悉无障碍。三无障碍色有障碍见。即因陀罗网染净有余二种众生见有障碍。四无障碍色无障碍见。即三贤十圣住果报土见无障碍也。问此经言。同宝器食见饭色异。为有质见异无质见异。答亦应四句。一染净有余实报悉是有质见异。二有质碍色见无质碍。即是菩萨依佛慧见三土皆寂光也。三无质碍色见有质碍。即三土众生于常寂光见有异质。四无质碍色见无质碍。即是诸<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>净土净。见于如如平等法界常寂光土。无形无质略出十二不同。委推无量。虽有无量皆如虚空。故净名空室表十方佛土悉皆空也。五明往生者为二。一总二别。一总约四土明往来者。亦云来生。具如大品。从此至彼名为往生。从彼来此名为来生。二土亦然。但横竖异耳。常寂光土绝于生名无往来也。应来三土无应往也。二别约四土明往生者为四。一染净土明往生者有秽有净。若秽土受生以见思惑惑润恶业生四恶趣惑润善业则生人天。若明三乘圣人往生。初果断见未断欲思九品润生人天七反。二果三品润生欲一往来。三果二界思推惑润往生二界。通六地来及别十住。并圆五品乃至入信通惑未尽并类三界。可知皆是实来生同居土。若权来生者三乘圣人界内惑尽或从方便土愿来。或从果报寂光应来。次明净土凡夫实生者无四恶趣。但以见思润善来生人天。圣权实生类前可知。二有余土往生者。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>二乘通教三乘。别教十行圆信后心长别三界皆实往生。故胜鬘云。变易生死者二乘及大力菩萨三种意生所不能断。故生有余受法性身。问何等是三种意生身。答一<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>正受。此恐是通教同入真空寂定之乐。故涅槃云。声闻<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>多故不见佛性。二觉法<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。此恐是别教菩萨。虽证偏真而觉知有中道法性。三无作。此恐是圆教菩萨。观于中道无作<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。圆伏无明。皆言意者未发真修。犹是作意。无明为缘无漏业为因。即此彼土受法性身。问如楞伽明三种意生。悉是十地应生报土。那云有余。答约别十地判三意生。即生报土。约通十地判。正与向解三教菩萨界内惑尽。则同生有余意同。若实报寂光破无明显法身。则应生有余。三果报土明来生者。若于同居有余侵除无明。别圆地住皆得往生。四常寂光土。若究竟寂光即是不生。不生岂为往来生也。若分明寂光下寂灭忍十地二生。中寂灭忍等觉一生。或云圆教初住分破无明。见佛性理亦得分生。乃至等觉皆有此义。但有无明变易生死果报所拘。故云住果报也。妙觉永尽故言一人居净土。前四十一地若约果报名生果报。若分见真理名常寂光。问分段同居要见思尽。舍身方生有余。有余亦应别见思尽舍变易身方生报土耶。答不然分段质碍<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>虽尽必须舍报。若有余土随破别惑因移果易即名实报。问实报受生寂光生不。答既云常寂岂得受生。生即流动何名常寂。问上何得云生常寂光。答若果报土有边论生发慧见真真即不生。即是不生生也。问若不生生亦应云不常常。答亦如所并。何者究竟常寂不生不生。四十一地分居常寂即不生生。不常常也。六明四土说教不同即为四。一染净土说教不同者凡圣同居。既有净秽。秽者五浊障重而根有利钝。利感顿教。譬如日出前照高山。钝根障重即开三藏。方等大品方便调伏。于法华涅槃始闻圆教。见于佛性开秘密藏。净者如华光土。虽非恶世愿说三乘。此亦得有顿渐之教。问净土亦得开渐教者香积菩萨何故惊怪。答本愿说故。二有余土说教不同者。断通结尽皆得往生。不无利钝藏通二乘皆钝。故大论明罗汉法性身钝。以于佛道而纡回故。通别圆教迭判利钝可知。如来于彼但说一乘。虽无开三而于一乘不无权别赴两机缘。若明开显虽无藏通而开别权显圆之实。故法华明罗汉生彼求佛智慧。得闻是经唯以佛乘而得灭度。三明果报土说教不同者既皆破无明。其往生者同一根性。行大直道无复纡回。佛于彼土但说一圆也。四常寂光国说教不同者。若究竟寂光无说无示而言说者。法身<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>冥资一切。无说而说即是法身说法。若约果报明常寂光。分别二种说法不同者。说无作四谛即果报土。说一实谛即常寂光。下两土类此可知。七约观心明四国者心性本来毕竟空寂。而众生多颠倒少不颠倒。无明因缘而起<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。即所生法即空即假即中。中是因缘善恶之境。即凡圣同居。何者所观善恶即净秽土。了因缘虚假折体入空。空境即是有余土也。知空非空不以为证。知中非因非果而因而果。若了因果无障碍者。即是果报无障碍土。虽复空假入出之殊。而无明心源即是佛性。若知无明性即是明。即常寂光。故文云随其心净即佛土净。大集云欲净佛国当净汝心。华严云无量诸世界悉从心缘起。一切诸法界皆入一毛道。八用佛国义释此经者为三。一通序分。二通正说。三释流通。一通序分者合盖现土。此瑞正表欲说佛国。故宝积述叹云今奉世尊此微盖。于中现我三千界。宝积深知欲说净土。故称叹竟即问佛国因果。叙述现瑞正意。表于欲说佛国。二通正说者为三。一室外二室内三出室。一通室外者有三品半文。宝积请说佛国因果。如来具答。故足指案地现于净土。令诸众生得大乘益。复土如故。求声闻人得小乘益。若迷佛国依报之义。岂识此品之玄旨也。次通方便品者。为国王长者说折体两观。劝求佛果正因。若成依因则具界内结业未断。生同居净。结业若断即生有余。若成佛时则二种众生来生其国。次通弟子品诃诸声闻。意在令断界外缘集。若至法华进断别惑生果报土。后成佛时三种众生来生其国。次通菩萨品。呵诸菩萨令断无明则生寂光。后成妙觉之时一种众生来生其国。二通室内六品者。文殊问疾入毗耶离。净名即现空室。云十方诸佛国土皆空。故现室空也。此岂非正表显佛国义。扶成如来说佛国也。次通不思议品。现须弥入芥等不思议事皆显佛国依报自在。次通观众生品。天女住室十有二年。即同净名在常寂国。正是助显佛国之义。故云十方佛土常现此室。次通佛道品。行于非道通达佛道。即是于不净国显现净国。故偈云。虽知诸佛国及与众生空而常修净土<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>诸群生。次通入<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>品。诸大菩萨各说入门。欲破前二土无明入果报土住常寂光。次通香积品。此室现众香之净国对娑婆之秽土。即是证成室内五品扶成佛说净秽两国。三通出室两品者。菩萨行品净名掌擎大众还庵罗园。佛对阿难说种种土复宗明义。若不精解此品经文何由可别。次通阿閦佛品。即是室外现土证成如来说种种土。其义分明。闻经得道倍于前也。三用佛国释流通两品者。法供养品天帝发誓弘经。如来印可。正为流通不思议解脱之体佛国因果之宗。嘱累品付嘱<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>及阿难等。流通不思议解脱法门及上所明佛国因果。使不断绝。四释品者品以品类为义。义类同者聚为一段故称品也。但此品题应云序品。言佛国者从正当名。问既有序正何得用正以标初品。答此问非也。设用序当名复应问云何不用正。今解不无其例如摩诃般若。初半品是序。从告<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗后半品是正。而用序标品复有何妨。若不许此经序受正名者。亦应不许彼经正用序标品也。问若尔定应用序标题。答金光明序正同品亦应为妨。此既晚人安品厝意不同。非佛所制亦非阿难。不足定执。此经虽不标序品为初而序义宛然。事须玄释。序义众多略用三意。一略释序。二明通别。三约观心。一略释者有三义。一以次序为义。二以由藉为义。三以序述为义。一次序者夫著文初文之为序。今如是六义是经之首故名为序。二由藉者大圣说教必须由藉。是以现瑞表发生物喜心。故云道从<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>生也。如此为由故得说教。三序述者既生忻慕而圣意难量。时众归心莫知所趣。所以须假高位弟子或化佛菩萨预先称述。众疑既息归心有在。方可致教故云序述。今经初六义即是次序。合盖现土即是由藉。宝积述叹即是序述。问诸经悉具三序以不。答有具不具。或二或一皆为序分也。问序训不同何得俱用次序会通众义。答字书虽尔经意含三共。用次序之字亦应无妨。依义不依语也。二明通别者还束前三以为通别。如是六义即是通序。现瑞序述合为别序。诸经通以六义为首。故名通序。众经之初现瑞不同序述各异。有所表发故云别序。今因别名则有别序有别言教。若因通名则有通序。行理通别因此而有两序。问若以两序从两名立者。立名则前别后通为序。何得前通后别。答立名之便应前别后通。为序之便应前通后别。复次一途亦前别后通。何者如现瑞由藉。是说经之前如是等六乃是如来将入涅槃方说此语。故知在后。经前序正为发起现在弟子<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。经后序为令未来弟子生信。若尔佛在世时经初无序不名经耶。答别序之前虽无六义。佛说法时已有其事故得名经。三约观心者心即是通观。即是别因此观心成就一切佛法。即是入道之门。即由藉也。问若以观心为两序者岂不颠倒。答立名之便故言观心。<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>之便即是心观。类前事义其理显然。问玄义处处多明观心。已恐不可入文复尔。将不坏乱经教耶。答说经本为入道。若怀道之贤触处观行。岂有寻求圣典而不观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>乎。但巧说得宜非止不损文义兼得观慧分明分别法门。非观何逮岂有坏乱之咎也</p></div>"
},{
    "title": "维摩经略疏 第二卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第二卷</p><p>五入经文就序为二。一通。二别。先释通序六义通为众经之序。须为两义一总二别。一总释者是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>阿难等诸大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>说入<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之相。大论云佛将<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>阿难亲属爱结未除心没忧海。阿泥楼驮语阿难言。于未来事若有疑者及时语决。何为没在忧海如世凡夫。阿难得念道力闷心得醒。即以四事请问。一问佛涅槃后云何<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。二问谁当作师。三问恶口车匿云何共住。四问<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>初首作何等语。佛告阿难若今现在若去世后依<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>修道。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>戒经是汝大师。恶口车匿依梵法治。若其心渜伏教那陀迦旃延经即得入道。我三僧祇所集法藏初应作如是说。如是我闻一时佛在其方其国土与其大众。非独我法如是三世诸佛经初亦然。故知六义即是通序。亦名遗嘱序。如来遗言令标经首故。亦名经前序。三世诸佛经前皆然。问何故经初安如是等。乃至但令修四念处。答经初安如是等者为断疑劝信故。亦为印定佛说非弟子及九十六种所说故。亦为破外人经初以阿沤二字标其教首故。阿沤者是谓吉相邪僻之事具如百论。恶口车匿梵法治者。其自恃王种轻诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。僧<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>时即轻笑言。如似落叶旋风所吹聚在一处何所互论。佛去世后犹自不改佛令作梵坛。谓默摈也。亦云彼梵天治罪法别立一坛。其犯法者令入此坛诸梵不得共语。若心调伏为说那陀迦旃延经者。令离有无即入初果。一家明<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>教。立非有非无门异于三门意在此也。教诸比丘依波罗提木叉住者。波罗提木叉此云保得解脱。亦云报解脱亦云处处解脱。问毗尼明时食时衣等多非正义。那云保得解脱。答大论云佛说毗尼为令佛法久住。不应求实求实即生邪见。今时僧众不以<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>在心者恐灭佛法。令依念处修道者。若离念处施但得富戒生人天。<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>得定随禅受生。多闻<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>但是世智。若修念处能破四倒。问声闻经说须依念处。摩诃衍教无生入道。岂须念处有所观耶。答大乘有无生无量无作念处。若离此三则无正观。但佛教虽多不出半满。生灭念处即是半字。三种念处即是满字。半枯满荣。枯荣中间得见<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。住大涅槃名诸佛法界。出念处外无入道法。故佛遗嘱令依念处。次别释者旧多用五义。今依六义。一如是者劝信之端。二我闻者亲承音旨。三一时者感教之时。四佛住者约出化主。五方所者闻经之处。六同闻者证非谬传。此六义者正为奖<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>去世后见闻之徒息疑增信。自利利人功成道熟。是谓劝信之端者。如是等六皆为劝信</p><p>如是居初故云端也。初如是为三。一总明。二约教。<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>心。一总明者意在劝信。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>相解如<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>说。所说诚谛必可信从。大论云佛法大海信为能入。又如是者善信之辞。不信者言是事不如是。其信者言是事如是。又大论云如是者示人无诤法。佛以无倚心说。弟子以无著心受。能得解脱故言如是。不如外道说者听者皆以着心。现世斗诤死入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>岂名如是。又古来多云。如是者文如理是。文以巧诠为如理以无非曰是。二约教者四不可说赴机而说则有四种。一生灭二即空三假名四即中。一<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生灭如是者。佛昔于波罗奈说<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>生灭。俱邻等闻如是说即得悟道。此经复土。求声闻人知有为法<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>得罗汉果及<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。二明即空如是者。如大品三乘同见无言说道而断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。此经破迦旃延明五义。二百比丘闻如是说心得解脱。即是示人无诤法。三假名如是者如无量义云。摩诃<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>华严海空宣说菩萨历劫<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。此经亦云以无所受而受诸受。若闻如是说得道种智。入菩萨位知<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>根。四中道如是者。如大品说。佛以诸法实相故出现于世。化佛亦以诸法实相故出现于世。法华云诸法实相义已为汝等说。此经诸菩萨各说入<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。若菩萨闻如是说即见佛性。开佛知见住不思议解脱。佛法有此四种如是。故众经之初皆安如是。华严顿教有因缘假名中道二种如是。三藏但因缘生灭如是。若诸方等具有四种。摩诃般若则有三种。法华但有中道实相。若大涅槃明诸佛法界亦具四种。此经犹是方等大乘生苏不定之说。具有四种如上所引。此经既具四如是义故于经初标如是也。问理无二是何得有四。答诸法毕竟无说非权非实。尚无一种何况有四。而权而实者权故说三实故说一。权实备明则有四种。三观心明者即是三观明四如是。华严云欲知如来心但观众生心。若见如来心即见众生心。如破一微尘出大千经卷。众生一念无明因缘所生之心即具四理。若观心因缘生灭入空即生灭如是即空。即假即中例说可知。问若观心具四应即是佛。答六即分别。进不叨滥生增上慢。退免贫人数宝之失</p><p>我闻者即阿难等亲所闻法故云我闻亦为三释。一总释者亲承音旨故。若传从他闻多致伪谬。今既亲闻是则可信。群情承受无所致疑。大论云随俗说我和合称闻。随俗说我者学人传法。利生顺俗说我。外不乖宜内不乖实。如用金钱以买铜钱卖买法尔人无怪也。和合称闻者。耳根不坏作意欲闻情尘和合耳识即生。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>分别种种所闻。因缘和合故称闻也。阿难等内则耳根聪利。外则对佛八音领纳无遗。故称我闻。问大论云阿难是佛得道夜生。涅槃明佛成道后过二十年方为给侍。自尔之前说经阿难不闻。佛将涅槃为魔所蔽亦不得闻。云何皆称如是我闻。答大论云阿难将欲结集法藏。合掌向涅槃处而说偈言。佛初说法时。尔时我不见。如是展转闻乃至波罗奈。展转闻者<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗问经云阿难修不忘禅。得佛觉<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>以三昧力自能闻也。又报恩云阿难从佛求乞四愿。三如涅槃。第四愿者佛所说经未闻之者更请为说。佛可其愿。有所不闻重为说也。复次大论明结集法藏。优婆离等各登高座皆称如是我闻。未必并是阿难也。问阿难但结集小乘亦大乘耶。答解者不同。有言但结集小乘。诸大乘经是文殊<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>等所共结集。又言阿难亦结集共二乘说大乘经。故大品付属阿难。此经亦尔。其不共者大菩萨集也。又云阿难亦结集不共二乘人说。如<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>念云。阿难有三种一阿难贤二阿难持三阿难海。今谓阿难贤持三藏教。阿难持持共大乘。阿难海持不共大乘。故法华云。阿难闻佛授记即时忆念过去无量千万亿诸佛法藏。如今所闻。亦识本愿岂不备持一佛之教。次别释为二。一我二闻我亦有四。一约三藏明我者。依萨婆多我但有名。依昙无德说有假我。犊子明我在第五藏。是等虽殊悉破外人计神我性说假名我。二通教者如大品云。色性如我性我性如色性。我之与色但有名字皆如幻化。三别教者以<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>为我。善于知见得无挂碍即我义也。又摄大乘明自他差别识亦名似我识皆是别义也。四圆教者中道佛性即我义也。中论云。佛或时说我或时说<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。于佛正法中无我无非我。此经云于我无我而不二是真无我义。大经云无我法中有真我。又云我与无我其性不二。不二之性即是实性。实性者是二十五有真我也。前三是权我圆教是实我。问若尔何得大论云随俗说我。答三教随情岂非随俗。若圆教明我即是佛性非随俗也。三教我闻并约耳根圆教明我。我即是闻。以点色性说真我故离法性外无别能闻耳也。用教约诸经明我多少如前可知。二明闻者大经有四种。一闻闻二不闻闻三闻不闻四不闻不闻。今恐此是四教辨闻。藏教即闻闻以小生生大生故名生生。今亦得云少闻成大闻故名闻闻。问大经生生是<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>相续不断。何以类解闻闻义耶。答彼经释生具有两义。今不取约行但取约理。若约十二因缘相续以明生生。即于<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>闻经不便。何者藏教诸得道<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>生已坏。但有报身。根尘和合故称闻也。二通教即是不闻闻。如梦如幻点空说闻。三别教即闻不闻。所闻自在。何者世谛死时即闻。闻死而生闻持随有所闻。自在能持故。摄大乘说有尘者应受识。即是别教大乘明闻也。四圆教即是不闻不闻。大般涅槃闻相尽也。问若无闻相云何说闻。答若闻相尽都不闻者。佛住涅槃应都不闻法界音声。如法华明耳根<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>相似闻相尽。十方无数佛百福<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>相为众生说法。悉闻能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。况分证闻相尽。闻十方佛法如云持雨耶。妙觉闻相究竟尽。一切法界所有音声一时闻也。故大经云若知如来常不说法是名具足多闻。此经亦云其听法者无闻无得用四教约众经闻义多少亦类如是可知。问大论明佛法无我何分四。若尔便是有我。答若定有我何得四教之别。若定无我何得经教有此异说。若其不许作此分别非但坏佛方便教门。亦顺诸不信者义宗。三约观心类如是可知</p><p>一时者<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>感教得道之时。此亦助成如是可信。故大论云说时方皆为生信。亦为三。一总解者大论云数时等实无阴入持所不摄。但随世俗说一时无咎也。言四众感教得道之时名一时者。若通论四众感一期之教。始终久近皆名一时。即是多时少时共明一时。如戒序云。春分四月日为时。春分实有多时但总束为一时也。若约得道明一时者。赴机说教即入如苦忍一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。此约少时明一时也。今约此多少总明一时。谓一期说法通是一时之事也。就此为五。一约机发者。世善机发即是多时出世机发即是少时。总此多少皆名一时。二约佛说教者。三悉起教即是多时用第一义即是少时。总此多少皆名一时。三约机教合明一时者。亦以世出世善合为多少。机教合故不在二时故名一时。四约四众得道明一时者。世与出世多少准上。总此多少皆名一时。五约阿难闻经明一时者。约佛说经多时少时。阿难闻非异时故名一时。又阿难得佛觉三昧如前说。又解佛为阿难重说即是闻经之时名一时也。二约教者。三藏生灭一时。通教如梦幻一时。别教破时颠倒。能分别数无滞碍也。摄大乘明数识摄阿僧祇。明世识摄三世即是别教明一时也。圆教约不思议法性明一时。一时入一切时一切时入一时。如此经明。住不思议解脱菩萨七日为一劫一劫为七日。法华明六十小劫谓如食顷。华严明十一切等。一一教皆具五种一时。约诸经多少类如是可知。三观心者。观因缘生灭者心在定时能知<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>生灭法相。则一念慧眼开发见生灭之理。故名一时。若非定心见理即前思后觉忆想颠倒。虽解生灭不能见理。非一时也。若体空慧眼入假法眼中道佛眼皆是定心。一念少时豁然开发各见谛理名一时也</p><p>佛在。佛是能说显其化主。亦为助成传闻可信。何者九十六种不足归心。三乘圣人独居不极说非究竟。今明无师大觉朗然顿悟所言。诚谛从是闻经。称物机缘众情忻惬。亦为三。一总明者旧称<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>此言觉者。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>觉他名之为佛。智论云佛陀秦言知者。知何等法。谓知三世众生数非众生数及常无常等一切诸法。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树下了了觉知故名为佛。十号具足。亦名一切智人。佛德无量称名亦尔。今不具释。所言在者住之异名。大论云四种威仪住故名为住。住有四种。一天住者谓<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>三事故。二梵住者住四禅四无量心四无色定。三圣住者住三空<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>十二因缘理也。四佛住者住首楞严等无量三昧力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>等一切佛法。佛所得法佛于中住。怜愍众生示住毗耶离。别约教者四教明佛已略在玄。但为化四种根性现相亦四。如初成道乃至涅槃皆现四相。初成道者如胜天王明。初坐道树得成正觉。或现坐草或坐天衣或处宝座或在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。即表四教佛相不同。次明转法轮现相不同者。华严圆顿则现大小相。若鹿野<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>灭四谛即脱璎珞现老比丘。若说方等即现门内尊特之身。或现门外尘坌之像。若说般若亦现门内尊特之身及现种种<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>之相。以众生疑故现常身放常光明。若说法华但现尊特。若说涅槃备现四种事同方等。如是<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>现种种身。一往大略言四种耳。次明身相不同者。如像法决疑云。如来将入涅槃。是时大众或见如<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>像。或见威德相好端严。或见坐宝莲华说心地法门。或见身如虚空无有边表。此岂非表说四教。其功已讫将入涅槃现此相也。此经既方等教摄。亦应随机感见四种。故长者子说偈叹云。各见<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在其前。斯则神力不共法。问四教所见定如前不。答且一往相对理在随缘。若就障边亦可劣身而说胜法。如观世音以种种形游诸国土说大乘法。岂况如来。次用四教明住义者随教所辨法门不同佛于中住怜愍众生故示住毗耶。三约观心者。华严云欲见如来心但观众生心。何者一心三观圆观三谛开佛知见。虽有肉眼名为佛眼亦名种智。若用三智以不住法住三谛三昧。亦是佛所得法。佛于中住。怜愍众生不舍道法。现凡夫事住世间法也。此须善用六即分别。入大乘之要门也</p><p>毗耶离庵罗树园此明方所。即是显示说经之处。助成劝信也。今为二。一通方所即毗耶离。二别方所即庵罗园。通方所复为三。一约事者此云广博严净。其国宽平名为广博。城邑华丽故名严净。有师翻为好稻。出好粳粮胜于余国故也。有言好道国有好路。平正砥直。又言好平道。其国人民好乐正道自敦仁义。不须君主。五百长者共行道法。率土人民莫不归德故云好道。次对法门释者随前所翻即以对之。广博严净者即是释迦法身。本居寂光其性广博犹若虚空。功德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>无诸秽恶故云严净。迹居人间诧广博严净之土。是知非本无以垂迹。故居人间严净之国。非迹无以显本。寄毗耶离说诸佛国永寂如空。以显遮那常寂本国。言好稻者释迦本住大般涅槃百句解脱。故法华云百谷苗稼普皆增长。因其增长谷实得成。即是百句解脱之妙果为好稻也。垂迹显本类前可解。言好道路者此表智度大道佛从来也。故大经云譬如隘路不容二人并行。解脱不尔。多所容受即真解脱。今释迦居不思议法界大道即是多所含容故名好道。垂迹显本类前可知。言好平道者思议之道作意而修不名好道。不思议道自行真修任运理显化他。如礠石吸铁<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>无念此是性好之道也。由本垂迹故名好道。因迹显本故居人间好道之国。说于心净佛土净也。三约观心者。一心三观能观心性即知心性。犹如虚空即具<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>二种庄严无染无著。毕竟清净。是则心净。故佛土净。约好稻者若观心性即是百句解脱之本。名为好稻。约好道路者若观因缘中道即是行大直道无留难。故无有众魔群盗得入此道。最胜故名好道。约好平道者若观偏真尽苦涅槃则于一切道法无好乐心。今观圆真之道则好乐一切。心无厌足尽未来际故名好道。二别方所者。上通方所助证犹漫。今的举所住则助信转明亦为三。一约事者肇师注云庵罗是果树之名。以菓目树故云庵罗树。其菓似桃而非桃也。又云似[木*奈]定非[木*奈]也。又翻云难分别树。其菓似桃非桃似[木*奈]非[木*奈]故名难分别也。此与大经意同。经云如庵罗菓生熟难分。具有四句释难分别。有师云此树开华华生一女。国人叹异以园封之。园既属女女人守护故云庵罗树园。宿善冥薰见佛<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>以园奉佛。佛即受之而为住所。次对法门者。佛住道品总持之法故云住庵罗树园。何者道品为树念处为种子。正勤为生长如意为芽生。五根如根茎五力如枝叶七觉为华八正为菓。从七觉华起慈悲心。为诸众生兴大誓愿。因愿勤行得发总持。故说总持以为园也。大集云三十七品是名菩萨宝炬陀罗尼。陀罗尼者此翻为总持。园持树菓不致侵犯故表总持。华中生女者即七觉华生慈悲女。女用奉佛者表因中总持<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a><a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。佛受住者由因成果。如佛所得佛于中住也。由本垂迹故居庵园。用迹显本住庵罗园。说不思议总持之园苑也。难分别者如来住园表居中道。三十七品虽非有无而似有无。如来住此难分别理成于道品佛菩提果。如此妙果所依之土七种方便之所莫测。表难分别之树也。三约观心者三观观心心性不动。而修道品因起悲誓。善根牢固成诸总持。即住园也。故华严说菩萨有十种园即是道品园也。若约观心解难分别者。如大经明具有四句。若修三观观不思议难分别理。亦有四种一自有观心都无所以威仪粗穬。如庵罗菓内外俱生。二自有威仪齐整似如柔和。<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>之心不证定慧。如庵罗菓外熟内生。三自有威仪不足可观而观行淳熟入诸法门。如庵罗菓外生内熟。四自有修一心三观调熟身口。柔和似得道相。三观开发入诸法门。或成观行或成相似。如庵罗菓内外俱熟。是故行人难可分别如庵罗菓也。问那得处处对法门以约观心。佛意岂然。答<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>如海众流皆入。如如意珠随念雨宝。亦如净镜随对像生。亦如大地随种生长。大经摸象各不能知。执见之徒自谓己解诤论是非。宁会佛旨。若言经中无对法门者。如普现色身问净名言。父母妻子亲戚眷属悉为是谁。大士答言智度菩萨母方便以为父等。净名既是在家菩萨何容无有父母家属。而不依事答悉约法门。当知不起道法现凡夫事。虽现凡夫事皆内表道法。亦如佛涅槃处在枯荣间。岂可直作树木之解。且佛诚说皆表半满。今欲说不思议解脱法门不舍道法。现迹同凡住于毗耶。岂不表于极地所住法门。华严明十城十园岂止直是世间城园。此经下文菩萨行品云。诸佛威仪有所进止无非佛事。何得但作事解而已不思诸圣善权秘密表发之事。又法华云欲说是经应入如来室着如来衣坐如来座。然后于四众中以无所畏心说。若彼经不对法门者。欲讲说时将不入佛殿升佛座披佛衣处众说法得佛意耶。问法华中佛自解说其义可然。今此城园佛不解释何得师心对法门耶。答若佛不释不得厝意者。一切经文何曾并是佛自解释。若各师心岂皆有失。问华严顿教可得约行明诸法门。此方等经及小乘教何得亦约观行明义。答此经既云诸佛解脱当于众生心行中求。若不约观行岂称斯文。若不以毗耶庵园对诸法门则不得约观心解释。何得于众生心行中求诸佛解脱。若不于心求解脱者云何得住不思议解脱。若不住不思议解脱云何于一毛吼见诸佛土变现自在。广如不思议品。又岂得如华严无量诸世界悉从心缘起。无量诸佛土皆于毛吼现。若言小乘不得约观心解者。何故声闻经中佛为牧牛人说十一法。一一内合比丘观心。如是等例岂非方等及三藏经对诸法门观心义也。问三观四教悬释此经。观前教后入文何得教前观后。答论其玄旨教从观出。如破微尘出大千经卷。入文帖释从事入理。故先须四教消释经文。寻文入理必须观行。故次点出三观章门。一品一偈一句无不皆入不二法门住不思议解脱也</p></div>"
},{
    "title": "维摩经略疏 第三卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第三卷</p><p>与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众八千人俱此下第六辨同闻众。此证阿难与诸声闻菩萨天龙八部<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>共闻岂谬传也。就此为三。一声闻众。二菩萨众。三杂众。问从小为初应先天龙。从大为初应先菩萨。答小乘<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>得道荷佛恩深故常在佛侧给侍陪奉。戒行自守物所归信证经义亲。故须先辨。菩萨化他不恒佛侧。和光利物难可测量。世人但睹其迹莫知其本。证信义疎故次辨也。天龙四众结惑未尽犹居凡地。内无得道之功外阙化他之利。证经为劣故后辨也。复次此有所表。二乘滞空凡夫滞有。菩萨不滞常行不二故处其间。故大经云凡夫者有二乘者空菩萨之人不空不有。问何以不叹声闻德耶。答诸师解言既被弹呵无德可叹。今谓不尔。菩萨亦弹何故即叹。又金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>亦不叹德非为被呵。今恐是出经存略。又云大之一字即略叹德。心大论云。若说小乘但明比丘众。说摩诃衍非但比丘必须菩萨。如金刚般若但辨比丘不列菩萨。岂可金刚是小乘经。但是出经者略。此经不叹意亦可知。一明声闻众者初明比丘。即是通语人类多种。如胡越不同。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>出家皆名比丘。释此为五。一与.二大.三比丘.四众.五数。一释与者此经云与。大品云共。与即是共。大论辨七一明共。所谓一处一时一戒一心一见一道一<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。若释法华须约本迹。今经既未发迹。但<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>事解观行而已。一处者同在庵园。一时者一会之时。一戒者同得无作。一心者俱得九定。一见者俱见<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。一道者悉得无学。一解脱者俱证有余。二释大者。若依梵本应云摩诃。大论云摩诃或云大或云胜或云多。大王所敬故名为大。胜九十六种故名为胜。数至八千故名为多。今明外道有三种。一一切智二<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>三韦陀。具此三种名大外道。佛对破此故于<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>说三念处。谓性共缘。能修此三非但止破三种外道。得入性地<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>之时成三解脱。谓慧得好解脱心得好解脱及得无碍解脱。名大比丘名大罗汉。若别对者得慧名大得心名胜得无碍名多。三种具足名波罗蜜。声闻成就一切罗汉<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故名为大。问得慧解脱即名大者。何须具三。答如<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>具故名大<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。而摩诃般若亦受大名。三藏通教各有四门合有八种。皆名波罗蜜声闻。故名为大。若约观心即就折体从假入空而明观也。此八种比丘毗昙成论各有一种大比丘义。余六不明。三释比丘者或言有翻或言无翻。言有翻者翻云除馑。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>薄福在因无法自资得报多所馑乏。出家戒行是良<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。能生物善除<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>之馑乏也。言无翻者名含三义。智论云一破恶二怖魔三乞士。一破恶者如初得戒即言比丘。以三羯磨发善<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>破恶律仪故言破恶。若通就行解修<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>。戒防形非定除心乱慧悟想虚。能破见思之恶故言破恶。二怖魔者既能破恶。魔罗念言此人非但出我界域。或有传灯化我眷属空我宫殿。故生惊怖。通而言之三魔亦怖。三明乞士者。乞是求之名士是清雅之称。出家之人内修清雅之德必须远离四种邪。净命自居福利众生。破憍慢心谦下。自卑乞求资身以成清雅之德故名乞士。又解。破恶是正义。下两助成。何者<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>破身口恶业。怖魔即破爱恶。乞士破慢恶。约观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>次第从于阴界入求法喜禅悦。资无漏慧命成尽无生智断之德。故名乞士。下文呵身子云。佛说八解脱仁者受行岂离欲食而闻法乎。此具三义一杀贼从破恶得名。二不生从怖魔以受称。三应供因乞士以成德。直言比丘则大小未定。或在外凡性地学人之位。今言大者即大罗汉。当知大之一字无所不含。即略叹德也。四释众者。梵言僧伽此翻为众。直一比丘不名为众。众多共集名为众也。律明四人已上皆名为众。如众树共聚乃名为林。智论云僧有四种。一愚痴僧谓<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>放逸僧也。二哑羊僧虽持禁戒不能分别三学开遮通塞之相。有疑请决默然无对犹如哑羊。三有羞僧者。若出家人修戒定慧。亦能分别为人开决。但未发真居内外凡。自愧未能成就圣法谬堕僧数。四事敬侍常愧自责。亦名事和僧。四真实僧者。从苦忍去四果<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>皆名真实理和僧也。前之二种虽有僧名既非事和不堪僧事。后之二种堪行僧事。五明数者数有八千事义可知。对行明数意则难见。菩萨者此下第二辨菩萨众证成同闻。何但声闻。亦有大菩萨及三万二千。亲承演说非谬传也。文为五。一明类.二辨数.三叹德.四累名.五总结。初明人类者夫大乘行人通名菩萨。是大乘行人之气类也。具存西音应云<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>萨埵。什师恐繁略提埵字但云菩萨。翻译不同。阿毗昙云。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>觉他名为菩萨有云菩提云无上道萨埵名大心。谓无上道大心此人发大心为众生求无上道故名菩萨。安师云开士始士。又翻云大道心众生。古本翻为高士。既异翻不定。须留<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。今依大论释菩提名佛道萨埵名成众生。用诸佛道成就众生故名菩提萨埵。又菩提是自行萨埵是化他。自修佛道又用化他故名菩萨。若不如是己所修持为无慧利。但三乘同名菩提二乘不名萨埵者。无悲利物故不受斯称。是则虽略二字异乎二乘。其义宛然。藏通见真通名为道不名萨埵。别圆见真如磁石吸铁。非但止名菩提亦即得名萨埵。故大经云一实谛者即是大乘。若非大乘非一实谛。问前两菩萨不名萨埵何异二乘。答少有慈悲愿行异二乘也。四教菩萨具如玄义。此经多由衍三教意释叹德也。不用三藏者非衍正意。有时引出正为比决大小不同。观心明菩萨者约<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>分别。折体入空起大悲心亦名菩萨。修后两观任运即是菩萨义也</p><p>三万二千二辨数者依事可知。表法难见未可定对</p><p>众所知识下三叹德为三。一总二别三结。初总叹者即是初标叹德章门。若无自行化他之德岂为众所知识。此诸大士<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>利物荷泽无边。十方众生莫不知识。闻名钦德为知。睹形敬奉为识。但众生有四根性菩萨即以四种化之。即有四种知识。三藏三祇行满百劫种相。大人相现物所归崇名众所知识。通教八地。道观双流神通利物名众所知识。别教登地圆教初住得如来一身无量身现十界像。随缘利物名众所知识。未横遍十方竖高三土。为一切有缘之所知识。今诸菩萨皆是补处。横遍竖高一切有缘之所知识。故云众所知识。若约观心三观心明即德高名称。是则闻名钦德睹形敬奉亦为众所知识也</p><p>大智本行下二别叹德为三。一略叹自他德。二广叹自他德。三邻果叹德。一叹德为二。一略叹自行二略叹化他。自行又二。一正叹二释叹。初二句言正叹者即是大智本行。解此或约一法或约二法。约一法者大智即是本行也。依本起智智即是行。故言大智本行。故法华云诸法从本来常自寂灭相。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>行道已来世得作佛。此经云从无住本立一切法。若南土旧解多从八地约位帖释。北方诸师从初地约位帖释。什师从下至上渐胜称叹。解既不同未敢偏用。何者南方引威神建立文证。故知初叹八地。北方引七波罗蜜证叹初地乃至七地。一往引证经文各便。若欲和通则硕乖违。但经文对地处处有之。未足定执谓为得称集经者意。今谓一往多是叹上地之德。若叹上地自摄于下。何者通论诸位行类是同。但上得胜品下得劣品。今以胜摄劣不可以上下各叹。如叹大智本行皆悉成就。金刚智满始名成就。岂可叹下。如叹能师子吼乃如雷震。下地亦能有此演说何独叹上。故知分别互有所失。问近无等等岂非叹上。答今明诸德皆叹上地须约邻果。故下结云如是一切功德皆悉具足。若通下地无等之言约相待说互有远近。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华明行处近处。下地亦名近也。华严明十地<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>如爪上土。诸佛智慧犹如大地。此则悬殊。今三教菩萨行类是同。而教有所主各有浅深。通八地去但约二谛而品有优劣。若约补处自摄下位。别登地去即是三谛入佛智地。行类是同。但约品浅深分地优劣。若叹补处即摄下地。圆教初住三谛圆显具于一切诸佛功德。但品位不同不无优劣。若叹等觉即下位皆摄。但诸菩萨外随所感见闻不同。内则本迹高下难测。岂可定执非但约教分别菩萨功德法门。或时内合观心欲令行者知胜妙功德皆从心出。是则诸佛解脱皆于众生心行中求。若约二法叹者。大智叹解本行叹行。若解行互阙如目足互失皆无所到。若解行具者如有目足即能到池。故须双叹所以叹解。云大智者只是观解。若入空出假。二智方便不名为大。中道观解一切种智名为大智。故大论云我今知力欲演说大智<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>实相义。当知大智即是观诸法实相之观也。言本行者即是叹行。从大智本一心具足诸波罗蜜。故大品云诸法虽空而能一心具足万行。金光明云一切种智而为根本。无量功德之所<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。当知自行虽有多门。但略叹解行横竖诸德磬无不取。问菩萨未证极果。何得言皆悉成就。答果行未满因行已圆。故云成就。但约教成就其义不同。三藏初缘生灭四谛发誓名大智。行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>行名为本行。种相业成名悉成就。通教初缘无生起誓名为大智。檀三事空乃至般若名为本行。十地如佛名悉成就。别教初缘无量生解名为大智。行无量波罗蜜名本行。十地等觉名悉成就。圆教初缘无作<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>名为大智。一心万行名为本行。十地等觉边际智满众事究竟名悉成就。权实可知。若观心解约三观明。初观观生灭四谛。大悲弘誓名大智。用观行六度即是本行。此三藏教折假入空观。体假通教入假别教一心圆教。寻之可知</p><p>诸佛威神二句二释叹也。亦傍得成化他。此正明佛加。金刚论云。于菩萨身佛与功德智慧之力。故名加也。今明解行因圆正由诸佛威神建立。智慧加解大智得成。功德加行本行得成。内因虽是菩萨自修外缘必假诸佛冥护。譬如种子。内虽自有虽生之因外无地土日光风雨等缘岂得成实。菩萨亦尔。虽有慈悲智慧<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a><a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>自行化他之因。若不假诸佛慈悲地智慧光神通风<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>雨。自行化他之因岂得圆也。如大鹏影覆子得生长。故华严云。八地欲沈空佛加奖观方得发起。若约观心修三观时必须<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>请十方佛。若心志者佛即加护自然行成。世有邪见学禅之人但信有心佛不信诸佛威神所加。此正释前傍成后化他者。若加化他如华严明。法慧菩萨说十住。诸佛放光加方乃得说。乃至金刚藏说十地亦如是。此即成后为<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>城。若约观心三观既成。若欲利物必须忏悔请十方佛威神建立。有感蒙加随所利生如风靡草为护法城下二略叹化他德为三。一叹化他心二叹功成三释叹。初二句叹化他心者。佛法如城能为行人防非拟敌故名为城。若护佛法即是护城。又解阴入界法。此法即空。即空之理名涅槃城。众生是王而种性具足恒沙佛法。如城中人物。故文云一切众生即大涅槃即菩提相。但此妙理外为天魔外道之所破坏内为通别见思所侵。菩萨为护众生本有涅槃之城不令妄起诸爱见也。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a><a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>者即是四教之正法也。菩萨从十方佛闻此教法得陀罗尼。总持无忘名为受持。将用此法降魔制外。及破众生内外爱见诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>贼护涅槃城。令诸众生法王种性皆得安稳。恒沙佛法不致散失。名护法城受持正法。约观心者假空空假护小涅槃。假中中假护大涅槃</p><p>能师子吼二句二正叹化他功成。大经云<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>者名师子吼<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。菩萨住此三昧能师子吼。师子吼者名<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>说(云云)。若约观心三观若成所行如所说。说于四教心无怯弱。如师子子若满三年即能吼也。名闻十方者此亦化他功成。化功既着十方蒙益咸共传扬。声闻驰远如大将破敌功名盖世</p><p>众人不请下三释叹化他。众人不请初二句此释化他之心为护法城也。菩萨悲誓岂待祈请。如寇贼围逼连官大将救其危急。何待城内来祈请也。问若菩萨是不请之友者。佛何故待梵王天帝请转法轮。答菩萨尚不须请岂况于佛。但是说法之仪生物殷重故须待请。问菩萨不待请者凡是有心必应救不。答有缘即赴非请有无支而安之。此释受持正法。世人以同志为友。菩萨善巧同物根缘。共修四种四谛各得无漏<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。故法华云我等二人亦共汝作。若开权显实则同乘佛乘直至道场。此即法亲之友也。而安之者未安道谛令其得安。如是四种众生令安四种道谛。若开权显实皆令安住无上涅槃。故言友而安之。若约观心折体入空假名中道。此四种心不请三观。三观自观即不请友义。观折成心令此四心住四道谛。即是友而安之也</p><p>绍隆<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>二句此正释。化他功成能师子吼名闻十方。菩萨用无畏心说于四教即是绍隆四种三宝。若顿赴圆机即入佛慧。初心成就一体三宝增进不断。乃至妙觉湛然安住。此即大乘一体三宝<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>不断故言使不断绝。若渐教赴机次第明不断者。初三藏乃至圆教一体三宝不断绝展转兴谢教权实。故菩萨用此四教三宝引接众生使佛种不断。皆令安住大般涅槃常住三宝皆是菩萨说法之功即是能师子吼。化功归己即名闻十方故言绍隆不断也。若约观心绍隆不绝者若佛在世绍隆三宝事如前说。佛去世后佛法付属二众<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。所以优田造像阇王结集育王度人。若此相从三宝不绝。则<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>出世真正三宝绍隆不绝。若弥勒灭后亦复如是。若行人能于今末世造立尊容书写大乘度人出家。即是相从三宝绍隆不绝。若住三观之心观此相从三宝不滞空有人。第一义一体三宝绍隆不绝故经云敬像如真佛得福亦复然。故文云无离文字说解脱相。文字性离即是解脱。解脱者即诸法也。贤愚经云未来多有破戒比丘。犹应<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>恭敬如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗目犍连。所得功德亦复无量。绍隆三宝功德最大。譬如大臣治正国家功勋重大。菩萨绍三宝种使不断绝。功德无量十方诸佛说不能尽</p><p>降伏魔怨二句此即传释绍隆不断。只由众生内有爱结外有鬼神六天魔王。内有诸见外有十八六师及九十六种外道。能坏法城使三宝断绝今明菩萨化物内修禅定伏爱外用神力降伏魔怨。内以智慧断结外则说法制诸外道。内外魔怨既伏内外外道咸归则涅槃城存。三宝不绝故得绍隆也。若约四教界内爱见用生无生道谛禅定伏爱。智慧制见界外爱见则用无量无作道谛定庄严伏爱。慧庄严制见。故文云众魔者乐<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。外道者乐诸见。菩萨于中不舍不动故云众魔外道皆吾侍也。若降界内爱见魔外即护化城涅槃。藏通三宝使不断绝。若降界外爱见魔外即护大涅槃城使。别圆三宝不断绝也。故知并是释前化他。问界内可有魔外界外何得有耶。答大经说八魔四内四外也。华严十魔通界内外。分别可知。涅槃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>自叹云。自此之前皆名邪见。则藏通三乘圣人皆名界外魔外。故呵善吉云入于邪见不到彼岸。汝与魔外一手作之。岂非界外有魔外耶。问声闻可尔菩萨云何。答华严明<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>魔三昧魔善知识魔。皆菩萨魔也。鸯掘魔罗诃文殊云。外道亦修空。尼干但默然即是界外外道。若不尔者何故八千被呵不能加报。若约观心者假空空假观成降伏界内魔外。假中中假观成降伏界外魔外</p><p>悉已清净下二广叹自他为二。一从此下讫不起法忍是广叹自行。二从已能随顺讫及心所行是广叹化他。叹自行为二。一断德二智德。一叹断德为三。一总二别三释。一总叹者明此菩萨结惑生死皆断。故言悉已清净。结惑生死有二种。一界内二界外。若三藏补处止伏见思未断结惑。通教补处虽除习气界外见思未断。别教补处虽断十一品无明余三十一品在。此三并非悉已清净。圆教补处四十一品并尽。虽余一品有若微烟乃可得名悉已清净。如地持明。第九清净净禅至离一切见清净净禅<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>斯断。菩萨依此禅故得大菩提果。故约圆教补处说悉已清净。若约观心。假空空假假中中假二处观成界内惑尽。非悉已清净界外烦恼障尽名悉已清净</p><p>永离盖缠二别叹断德。盖谓五盖缠即十缠。有言盖缠所障既近岂足以叹大菩萨德。今谓不尔。只约此五盖十缠开出一切界内外惑。离此更无别能生惑。界内为枝界外为本。若离界内五盖具出八万四千。何者贪欲嗔恚睡疑属痴。掉散是戒取即是等分。此四各出二万一千合八万四千界。外根本类作宛然。问界外何得有五盖亦对八万四千。答既有三毒何得无五盖耶。取涅槃即贪舍生死是嗔迷实谛是痴。既有根本三毒则有根本五盖。得具八万四千。今约教明离盖不同。数人明盖障于初禅上界无盖若成论明贪嗔二盖并通上界二论俱是三藏尚明盖不同。若三藏菩萨离盖发禅与凡夫同。未足以叹补处之德。若通别圆离盖类悉已清净。可知十缠开五百缠。分别永离类盖可知。若约观心假空空假假中中假。一处观成离二盖缠准上可知心常安住无碍解脱三释叹断德。无碍解脱即不思议解脱之异名也。故大论云于诸解脱中无碍解脱最大。藏通皆云无碍断解脱证。有师言。无碍伏解脱断此但界内思议无碍解脱。别教十地亦言无碍道断解脱道证。虽离界外见思犹约定断。非不思议无碍解脱。圆教明义解惑相。即智不断惑而究竟永离二种盖缠。故名无碍解脱。故文云不断痴爱起于明脱。心常安住者。若思议照寂非究竟安住。若不思议寂照不二。住大涅槃名究竟心常安住也。无碍解脱即大般涅槃之异名耳。次约观心。若别相三观非究竟安住。一心三观即是心常安住无碍解脱也</p></div>"
},{
    "title": "维摩经略疏 第四卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第四卷</p><p>念定总持辨才不断下二叹智德为三。一总二别三释成。一总叹者即是念定总持。若类余经悉叹<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>陀罗尼德。今叹念定总持即是叹三昧陀罗尼也。以此双标叹章者。念即<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>三昧等诸三昧。菩萨得此三昧十方诸佛常现在前。若得一心即名王三昧。何者若根本观练薰修并俗谛三昧。观谛缘三空是<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>三昧。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>等力及般舟一行首楞严等百八三昧。皆中道一心三昧。名王三昧。故知叹念定是叹三昧德也。约教者若折俗体俗入真。但约二谛名王三昧。若从根本俗谛及真谛。次第入中。即别教三谛名王三昧。若一心圆入三谛即圆教三谛。三昧名王三昧。大论出异家解三昧王三昧不同。意在此也。若约观心即<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>观三谛成王三昧。任运可知。总持者即叹陀罗尼德。此言能持能遮。持善不失遮恶不起故名遮持。亦名总持。持诸善法不漏失也。法华明三陀罗尼。一旋陀罗尼。二百千万亿旋陀罗尼。三法音方便陀罗尼。旋者旋转也。转假入空得入真谛。但破界内即属通教。一心圆破即属圆教。百千万亿者即是从空入假。旋转分别破尘沙惑显出恒沙<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。若别破界外无知则是别教。一心圆破即圆教也。法音方便者即是二观为方便。得入中道。次第断入中是别教意。不断无明一心圆入中道即圆教也。又法音方便者得此陀罗尼即解一切言音。亦能一音<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>随类得解。得此三陀罗尼即入无碍陀罗尼。具足一切陀罗尼也。问此经叹补处。何得约初心而释。答<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>毕竟二不别。故但后心入三谛无碍。横广细极竖深穷源。即是补处无碍陀罗尼也。问<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>菩萨有陀罗尼不。答如尸毗王。得归命救护陀罗尼。当知亦有诸小陀罗尼也。轮王尚得况于菩萨。问声闻得不。答其既入灭故不须也。约观心陀罗尼三观类作易见。辨才者即四辨也。大品七辨大集二十四辨华严四十辨。约教明四辨者。初约三藏。生灭<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>名字之法无滞。即法无碍辨。于四谛义无有滞碍即义无碍辨。达<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>言辞亦同其语。说生灭四谛言辞无滞即辞无碍辨。若称根缘于生生不可说四悉赴机。说无穷尽即乐说无碍辨也。辨是辨了才即才能。以蜜助药服之者易才助。又言。化道无壅。通约无生。别约无量。圆约无作。类解可知。言不断者不尽也。法义缘苦集知病无尽。又法义缘道灭识药无尽。辞及乐说即授药无尽。复次从生灭辨起无生辨乃至无作。无作四辨如风于空中。说法无障碍。故言不断。约观心修四辨义类解可知</p><p><a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>至具足二别叹智德。还从定慧开出七度。从定开四慧开方便故言别也。若作十度对十地者。开禅出力愿开<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>出方便及智。若约教者德约四四谛。修布施等即四教明七度也。言无不具足者皆波罗蜜。波罗蜜者翻事究竟亦云到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。布施乃至方便皆事理究竟。见檀等法界即究竟彼岸。故云无不具足。观心七度者一心三观不见悭施。乃至不见巧拙。而能善巧分别悭施。乃至巧拙冷然自晓。即无不具足也</p><p>逮无所得二句三叹位释成。逮之言及不起者。不起内外<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>无境可观。故名不起法忍。即是大无生忍。亦名寂灭忍。无所得者。大品云无所得以为得即是得无所得。仁王五忍璎珞四忍。两经虽殊俱明寂灭忍。寂灭忍有上下。若金刚心名下忍佛地名上忍。若开十地别出等觉亦得作三品谓下中上。今叹邻果复言逮者。当逮下忍也。约教各明四忍者。三藏无文义作亦有四忍。初只为伏二三祇为顺。百劫为无生三十四心名为寂灭。通教干慧名伏性地名顺。从须陀洹乃至九地名为无生。十地如佛名为寂灭。别教铁轮名伏三十心名顺。初地至九地名无生。十地金刚心名寂灭。圆教五品名伏铁轮名顺。初住乃至九地名无生。十地金刚心名寂灭。通论圆教初心已上并具四名。故仁王云。从初发心至金刚顶皆名伏忍。普贤贤首意在此也。问下文叹净名但言无生。当知不起法忍只是无生。何以用寂灭释不起法忍耶。答在因让果说名无生。若通论无生只是寂灭之异名也。故大经云。涅言不生槃言不灭。不生不灭名大<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。故文云法本不生今则无灭。是寂灭义。若然者寂灭即是无生何所疑也。约观心者一心三观三谛。惑不起者即是修不起法忍。故法华云着如来衣。如来衣者柔和忍辱心是</p><p>已能下二广叹化他为二。一内具化他之法二正明化他。初为三。一明内具。二明外具。三总释内外。如大论云。内具<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>名为力外用无怯名<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。若内智不明外仪不具。处众有畏何能伏物。若内外备足所化皆从。初明内具化他法者。即是已能随顺。随顺有三。一顺佛。二顺理。三顺根缘。佛为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>转四法轮。菩萨随转即顺佛也。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生灭即空假中。顺理而解。顺解而说名顺理。根性虽多不出四种。赴机无谬名顺根缘。复次顺解而说是顺实智。顺众生说是顺权智。顺佛方便是顺权实二智也。今言随顺具此三义也。转不退法轮者。四种四谛是轮体。用四悉檀为转也。有四种不退。一事不退法轮<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>灭四谛。二位不退转无生。三行不退转无量。四念不退转无作。若三藏但事者。以三藏教明不退位不取断结。但言不生四恶道。不受女人身。不生边地。诸根具足。得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智。具此五事名为跋致。通教初果已去齐罗汉位不退。七地行不退八地念不退别教以住行向对三不退。地证念不退向但修耳。圆教者一心具三不退。初住法身不堕前位名位不退。具一切行名行不退。念念流入即念不退。约别相三观者以空假中对三不退。约三别判此义犹疎。今约一心正观中道名位不退。双照二谛名行不退。自然流入名念不退。善解<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>知众生根者。善解法相是<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>相解。知众生根性名识病。善解四种四谛之药善知四种众生之病。以此化他无差机之失。十力中有是处非处力。即是如法相解。有知根力。即是知众生根。皆是内力具足也</p><p>盖诸大众二句二明外具化他法。以<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>慈覆十法界故言盖诸大众。又盖之言过深达四种四谛。出过不达之上故也。得无所畏者。慈悲<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>能盖一切故无所畏。即是释外用无怯无畏法也</p><p><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>智慧下三总释内外化他法为三。一释内心无畏二释外用无畏三结成无畏。初二句释内心者。具二<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>能师子吼释成内心无畏也。心即是自性清净心亦名法身。福慧能显出自性清净心。故言以修其心。还用庄严自性清净心。即具二严庄严法身。四教福慧三权一实。总此权实以修其心。故心无所畏也</p><p>相好至饰好二释外用无畏法者。种性色身物所尊重。如迦旃延子所明种三十二相业。小福所致。何足为奇。故非第一。通教约真修相。谛理未极相非第一。别教以缘修。缘修是智障故相亦非第一。圆教相好者。法身若显相好具足。故法华云。深达罪福相遍照于十方。微妙净法身具相三十二。法身具此妙相众生无由能识。为显此相故于应身示白毫相。表中道理。示绀眼相表无缘悲。余各有表。故知此相即是法身三十二相。色像第一者法性色也。大经云妙色湛然常安住。不为生老病死迁。此之妙色于诸色中最为第一。现十界像如如意珠。应色表真真色第一。应<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>色于所<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>色亦第一也。舍诸<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>二句传释前真相好也。非舍世间严饰之具。若舍此者外道亦能。何足可叹。今言舍者三藏菩萨舍人天饰好。百劫种相为<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>器。通菩萨舍有所得心世间严饰。故大论破百劫相。金刚般若云。若以色见我是人行邪道。别教菩萨舍界内空心饰好。用界外缘修修相好也。圆教菩萨界内外修皆世饰好悉皆并舍。法身若显即是真相。故云相好严身色像第一。岂同虚妄修因世间饰好</p><p>名称高远逾于须弥三结成为二。一结外二结内。初二句结外无畏者。菩萨外化遍十方十界名为高远。又解。通别教佛如须弥山。今圆教金刚心高两教佛。故言逾于须弥。又须弥盘固高远如法性不动理高。无上智有显理之功。故言逾于须弥也</p><p>深信坚固二句二结内无畏法也。信有二种。一闻二证。四教分别各有依次。今但约圆。若五品<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>一向闻信。信不思议<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>之理。六根清净亦闻亦得似证。初住已上亦闻分证。佛地但证。今诸菩萨既居高位二信圆深。故云深信。言坚固者二信不为内外之所坏也。犹若金刚譬显深信。金刚二义。一利彻本际。内合二信定慧利用穷实际也。二体坚万物所不能坏。譬二信烦恼生死所不能损</p><p>法宝普照下二正明化他为三。一放光说法明化他二正说法明化他。三明进修化他门。初为二。一正明放光说法二明释成。初又为三。一放光。二说法。三释叹。一放光者明菩萨悲智缘三谛理。生善法宝用化一切有缘。言普照者入放光三昧普光三昧故能普照。若诸凡夫应以世善光照。若出世善及出世上上善而得度者。菩萨随其所应用何三昧放善法光各令得度。故华严思益大品悉云。佛有光明名无悭。若放此光照悭众生即能行施等。如是种种利益令其得道。若一光除悭一光除嗔是别教意。不名普照。若放二谛光亦不名普。今诸菩萨只放一光具一切光照一切处。十界众生各得利益。随机入道故名普照。问光照云何能破恶生善。答譬如薰药烟触病苦即除身得安乐。光触亦尔。以此光从诸善法而出随触苦除。故文云有以光明而作佛事</p><p>而雨<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>二明说法。甘露是诸天妙药服之不死。中论云实相名天甘露。能令三乘同得圣道。实相甘露即有二种。一真二中。众生应以何实得度雨何甘露各令得益。此诸菩萨但说中道实相甘露。随其偏圆所得不同。故法华云佛平等说如一味雨。随众生性所受不同</p><p>于众言音微妙第一三明释叹。雨甘露雨何故能说甘露法雨。以有微妙之言音也。如法华欲以一妙音遍满三千界。随意即能至。铁轮尚尔何况补处。而不能以一音遍满随类各解普获其利。降佛已还莫能过者故言微妙第一。又解。法性言音故微妙第一</p><p>深入缘起下二明释成放光说法为二。一明入缘起叹智慧以释成。二断诸邪见下叹断德以释成。初文者所以放光说法利益深普。良由智能深入缘起。缘起有二。一生死。即是无明<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>一切生死。二<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>缘起。是观因缘智起一切佛法。今明深入者。深入生死缘起即<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>法缘起。故大经云十二因缘有四种观。若深入者得上上智了了见性。何者若观因缘生灭即三藏意。即空通教意。入假破界内外尘沙进入中道。破十一品无明是别教意。并非深入。圆教菩萨一心圆观。从初住至补处破四十一品。乃名深入。是诸菩萨并入十二因缘正报缘起。亦入依报成坏缘起。以深入故。是以能说因缘实相。甘露深信之义意亦显也断诸至余习二叹断德。释成放光说法者。只以自无惑闇能普放光照众生闇。只以自无系缚能雨甘露解众生缚。令断有无二边邪见。邪见有二。界内界外。界内六十二等皆属有无。界外种种诸见亦属有无。今总界内属有边界外属无边。故大经云凡夫者有二乘者无。菩萨之人不有不无。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>中道则破二边一切邪见。故言断诸邪见等。又解。正观中道破真俗二边。至金刚顶边际智满。中道体显三惑方尽。无复余习者。圆教始从初住终至法云。圆断诸见犹有习在。等觉入重玄门千万亿劫重修凡事。见理分明习气微薄。事等微烟故名无复余习。如以少盐投于大河无复醎味。故大论云。有无二见灭无余。诸法实相佛所说。常从但云断界内二见。用地论别义。登地离凡夫我相障断有无二见。岂得消此经文。问此有何过。答藏通见道即断诸见。别教登地断界外见。并不可叹补处之德。优婆塞经云九地断见习十地断爱习。地持云离一切见清净净禅。此据等觉。故今约之以消此文。一家圆断义转分明</p><p>演法至过量二正明说法叹化他。初双举两譬叹化他成就。后一总叹化他功德。初譬云师子吼者名决定说。说诸众生皆有<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。演法无畏者。演之言广心无怯弱故名无畏。能于四不可说以四悉赴缘广起四教。犹师子吼譬演实相甘露法门得无所畏也。如师子吼时非但不畏禽兽。亦能令香象失粪飞者堕落。此诸菩萨演甘露法非但于诸魔外及诸众生心无怯弱。亦能令魔外失爱见粪高心堕落。亦令一切爱见皆灭</p><p>其所讲说乃如雷震。次譬雨甘露法雨能令生善。大论具出四种法师。雷喻多闻雨喻美行具在论文。今明雷以惊蛰雨以润生。说甘露法雨震八音雷。用惊二边邪见之蛰。使一切善根萌芽开发。谓三草二木一地所生。使一切行人宿善开发故也</p><p>无有量已过量二句次总叹化他功德。无有量者。此诸菩萨<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>智慧放光说法十方所化无有限量。七种方便所不能量。已过量者过圆十地所化之量也</p><p>集众法宝下三进修化他法。明诸菩萨化功虽大。未证极果。犹须进修化他之法。即是等觉。千万亿劫入重玄门修化他行。重玄门者地持云。入住起力禅舍复入力禅。入者从凡心入一切法门乃至上地。起力者从等觉地起入一切法门。住者随住一法门即住一切法门。舍复入力者百千万亿劫重修也。故法华<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>叹下方菩萨云。善入出住无量百千三昧等。如海导师者。将导众人入海采宝众人得宝。亦已自获。菩萨入生死海非但能令众生得佛法宝。化功归己入重玄门法利亦多。故此经云不入大海不得无价宝珠。菩萨不入烦恼巨海则不能得一切智宝。了达诸法者。入重玄门内慧增进了达。是智之异名。诸法即十界之法也。深妙之义者十法界法二谛三谛之理甚深。故名为深。见三德不纵不横故名妙也。善知至所行二句正明菩萨住重玄门。增进外见所化众生根缘。此诸菩萨得真天眼常在三昧。不以二相见诸众生。死此生彼名往。死彼生此名来。言所趣者知<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业缘之因趣受报好丑之果。及心所<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>用种智之力知其宿世习因所行。三草二木一地所生根性不同。三草二木即七方便。一地所生即圆根缘。前明用药今明知病。既识药知病即能随病授药。故知住重玄门化他之德转深大也</p><p>近无等等下三约邻果叹德为三。一叹自行。二叹化他。三总释成。自行为二。一叹智德二叹断德。初为二。一总二别。一总叹自行智德者。即近无等等佛<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>慧。言无等等者十方诸佛无与等者。今等诸佛故言无等等也。约理者实相之理无能与等</p><p>佛种智圆极能等实相。故言无等等。又若圆教初住虽发真见理得无等法。犹有四十一品无明去妙宝尚远。不名邻果。约佛约理犹非近无等。岂得与无等等。金刚心菩萨约佛约理皆近故言近无等。见理已圆故云无等等也。若约教传作可知</p><p>十力无畏十八不共别叹自行智德。如大论解。此有二。一云菩萨自有无畏不共。二云菩萨分得<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>无畏不共。补处如十四日月。佛如十五日月。相邻近也。若约教者如三藏。明十力无畏名同大乘。毗昙释不共法别立名教。故大论弹云。力无畏名既同大乘。不共何得别立。今但约断伏分别同异。名义非妨。通教约照二谛。八地分得十力无畏等。故云近无等。十地如佛故云无等等。别教初地分得十力等法名近无等。十地所得十力等法名无等等。圆教初住已上分得力无畏不共等法名近无等。华严明初住。云得如来是处非处等十力智也。今取至等觉位乃至近无等。近佛十力无畏等法也。因用已圆即无等等也。前教并非云。佛自在慧者佛慧中无无明。故究竟自在。菩萨虽有无明犹如微烟。将得佛慧故以此为叹也</p><p>关闭一切诸恶趣门此叹自行断德。恶趣门者恶趣虽多不出二种缘集。藏通见空关闭有为恶趣之门。别圆见不空关闭无为恶趣之门。此诸菩萨见中道之源能闭有无一切诸恶趣门。或属叹化他关闭众生诸恶趣门也</p><p>而生至服行二叹化他。若开修罗即是六道。若三藏带结愿生。或用神通示五道身。于染<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。通教七地界内结尽。愿扶余习五道示身。亦神通生也。别地已上圆住已上得一身无量身。清净妙法身湛然应一切。即是二十五三昧力薰生二十五有也。今是补处慈善冥薰随机应现五道利生。义论亦现界外诸土之身。化彼众生。为大医王善疗众病者。既生五道意在利物治众生病。对小明大。三教菩萨及圆下地皆是小。医今诸菩萨力用邻佛名大医王。治界内外不善业病。应病与乐者用四悉檀说四法药。令得服行者众生闻法断界内外结。得大小乘圣道解脱</p><p>无量功德至不唐捐三总释成邻果叹得。无量功德皆成就者释自行满。无量佛土皆严净释化他满。其见闻者无不蒙益者。法身非色非声随感见闻。必获其益。令得世间出世间乐。诸有所依亦不唐捐者。唐虚捐弃亦失也。释自行者随心所行任运契理必成胜因。感果不失故不虚弃也。释化他者众生虽不入第一义不失三悉檀。归向生善破恶获利。及化功归己并不虚弃</p><p>如是一切功德皆悉具足三结成叹德。如上所叹皆悉成就。若依南北摘句配地岂得一切皆悉具足。一家解释理自冥会。又解菩萨功德无量无边。如上所叹数十句耳。岂可具述</p><p>其名曰下说法王子四累名证成同闻。虽叹胜德不的显名莫知其人。故略出五十二人以证同闻也。若约四教事转繁多。今略就三观释名足知大况。等者以二观入中。即是平等故云等观。不等者但照二谛无量殊别不等观。等不等者正观中道双照二谛。入中名等照二不等。体用合论名等不等。须用六即则不混滥。一切众生即是实相名理等观。闻实相名深知其理是名字等观。若观中道通达无碍即观行等观。发相似解。即相似等观。若发真明名分证等观穷实相源名究竟等观。今此乃是分证位邻究竟故名等观也。不得闻观心即是。而便混滥生增上慢作菩萨旃陀罗。若不受此语即是不信诸大乘经了义之说。下去一一名下皆先加一心三观。然后依文。如言一心三观即能观心性等。定自在王者能观心性名为上定。得此上定于一切法即得自在。如世国王。法自在者正观三谛心无滞碍。于十法界法而得自在。法相者观十法界三谛法相。光明者此之慧光能显实相故也。光严者心智光明庄严法身也。大严者观于心性。其性广博犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。境大智大以严法身。宝积者。观心虽空而具足万行。万行众宝积之于理。故名宝积。辨积者与法性相应即具四辨蕴积也。宝手者观心成就即具权实二智之宝手也。宝印手者观实相印印观智手也。常举手者正观心手上求<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。常下手者观智之手即无缘大慈下化众生也。常惨者住正观心悲愍众生。喜根者得如来藏大喜遍心。喜王者得中法喜所愿自在如世王也。辨音者分别十界殊方异音通达无碍。虚空藏者观于心性。犹如虚空无所积聚乃名为藏。执宝炬者观道品宝炬照显心源也。宝勇者见诸法宝能于生死意而有勇。宝见者观实相宝了了见性。帝网者譬如帝释网目无量。正观三谛具足无量诸法之网。网诸烦恼及诸众生。明网者正观心性。智网光明网诸烦恼及诸众生。无缘观者观于心性。真修体显无缘无念寂而常观。慧积者观于实相。具智慧聚。宝胜者正观之宝。胜方便之宝。天王者得第一义天自在如王。坏魔者观于心性能坏二边八魔。电德者见中道迅速即成三德。如夜见电光即得见道。自在王者得真我性。于一切法自在如王。功德相严者正观心性具一切法庄严法身。师子吼者得见佛性成师子吼三昧也。雷音者正观心性中道。多闻美行如雷震吼。惊一切二边冰执蛰也。山相击音者如二山相击音遍四方。境智相应出四辨之音也。香象者无烦恼毒臭。能以慈力荷负一切。白香象者法性之本本无黑恶。理净智净五分身香起诸慈悲荷负一切。如白香象。常<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>者见法性<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>成无作正勤。不休息者观空不空不住偏空化城而休息也。妙生者观于心性不生。则一切法不生而般若妙生。华严者福慧因华庄严法身。观世音者如请观音云。观于心脉使想一处即见观世音也。得大势者正观心性降制界内外魔怨外道。梵网者正观清净法网。网诸烦恼及一切众生。宝杖者具福慧二种为宝杖。策发进趣菩提果所。又云众生凭杖求入中道也。无胜者得实相法世出世智莫之能胜。严土者心净则佛土净也。金髻者实相慧明如金。髻者即权智也。以严心首故云金髻。珠髻者即实相智慧。如法华王。解髻中明珠与之与之者权智也。弥勒者得无缘慈慈摄一切也。文殊师利者若见佛性即具三德。不纵不横故云妙德。如是等菩萨随观标名引物归心。一人各具一切观门。名字互通。即字等语等身等法等。如是解者于心观中见诸佛菩萨。故法华云。若人有能信汝所说则为见我。亦见于汝及<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>僧并诸菩萨。华严云十方诸如来同共一法身一见一智慧。力无畏亦然。故诸佛菩萨皆约观心明也。问凡夫观心何得用释佛菩萨义。答此经云。诸佛解脱当于众生心行中求。若执文字离心而求佛菩萨解脱者。可谓抱石投渊夜游去烛</p><p>如是等三万二千人第五大段结众数。问此诸菩萨定皆是十地等觉位不。答北方诸师从初地至十地。南土诸师云是八地九地十地也。复有师例如大品云。皆补处也。今谓不尔。前明本迹高下莫测何须定判</p></div>"
},{
    "title": "维摩经略疏 第五卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第五卷</p><p>天台<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>湛然略</p><p><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>品之五</p><p>佛告富楼那五命富楼那文亦二。一命问疾二辞不堪。所以次命者以弟子中<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>第一。富楼那是姓从姓立名此云善知识。弥多罗尼即是母名。此云满愿。满愿所生故言子也。所以加母名者恐表异同名也。但法华至下根方得授记。而今先命者或是随近或是机便故先命也。何者既有辨才<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>文辞利用。有所言说悦可物心。若遣传旨众情弥仰。故先命也。如佛说大品唯命身子善吉及富楼那转说<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。大论具有料简深求其致。乃至成前五种利益可知</p><p>富楼那下二奉辞不堪文为四。一辞不堪.二述不堪之由.三正述不堪之事.四结成不堪。初奉辞者。良以往昔说法乖机致被呵折。故不堪传至圣之旨</p><p>所以至说法二明不堪之由。由于往昔树下为新学<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>说法。树下是标其说法处。或有所表类身子可知。新学者是三乘初心。然诸比丘机在于大。不审谛观妄为说小。虽不云说法之语寻经可知。文云欲行大道勿示小迳。小迳即是小乘所行之处。此乖大机致被弹斥。不堪之由由乖机也。时维摩诘下三正述被弹之事。文为七。一呵说法失机.二结过.三净名入定如诸比丘.四诸比丘心志开发.五净名为说法.六诸比丘得不退转.七富楼那敬摄。初文为四。一呵不观本心.二呵不知心念.三呵不观根源.四呵不观乐欲。此四呵者义推即是用大乘四悉。一不知本心即<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净心。即第一义。大经云正因<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心是。二不知心念即为人也。人有种种念修不同。故法华云念何事修何事。三不知根源即对治也。根利有遮现不开发。若对治破遮利用即发。四不知欲即世界。若乐闻大即便为说一切法。皆以<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>名字而分别之。但四悉次第第一义在后。今反在前者讨本故也。满愿不以四悉故有差机之失。初呵不知本心者。夫欲说法必须审谛。若不入定则不见根缘致有差机之过。所以呵不先入定观比丘心故不见其久已发大妄说小乘第一义也。问入何等定能知根缘。答定有八种。前六不知后二能知。一者外道根本闇证本非照机。若入此定则不能知。二者凡夫外道若断障通无知。虽得他心入定止能知他心念。亦不知根。三者<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>慧<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>人得有作<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>中八种之定。此本缘理亦不能照机。四者此教俱解脱人得根本禅观练熏修。发他心智亦止知他心而不能照机。五者通教慧解脱修无生四谛中八定。此亦缘理不能照机。六者此教俱解脱人得根本禅观练熏修。发他心智亦但知他心。不见根缘。菩萨亦尔。七别教菩萨修无量四谛中八定。若入此定知他心见物机也。八圆教菩萨修无作八定。寂而常照知心所念及诸根缘。今约后二并知念知根呵其不入此二定也。问心之与根有何等异。答知心只是他心智。凡小共有知他根缘即道种智。别教始有通教尚无况复凡小。问若尔净名何得呵不知心。答种智知根必因他心。故下次第约不知欲呵。问无量无作知根何殊。答无量八定从空入假发道种智能知物根。此是缘修为显真修。非是任运普照之定。无作真修寂而常照。不以二相普见诸土。即不二相照诸根缘。若尔何得劝满愿入定。答此语似将别教八定对破二乘不观人根。故言先当入定。圆教无入出相。或为破为助方便说入。复次心心自然流入始是真入。无以秽食置于宝器者。此诸比丘久发大心。大心即是法性真心。出法性外无别真心。宝器者<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>如宝容<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>如器此即大乘器世间也。秽食置者小乘法喜禅悦。带尘沙无明之秽。满愿以不入定观诸比丘大心宝器。为说小乘法喜禅悦食。此不可也</p><p>当知至水精。二呵不入定不知心念。念即念数。是诸比丘曾发大心<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。今生虽忘犹有习因。应用大乘为人发其宿行。云何以小乘为人说其小法。如身子教二弟子之失也。大乘真实以喻琉璃。小乘不实取喻水精非真宝也</p><p>汝不至之也三呵不先入定观其根源。是诸比丘久种大乘善法名之为根。本所值佛初因<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>即是源也。满愿既无无量无作八定。是故不见比丘根源。有障应说大乘对治。云何妄为说小治之。令其厌苦而求于灭。彼自无疮勿伤之也。即是譬显。此诸比丘发大心来。所有善根未有意着小乘法疮。忽为说小令生念着。即伤大乘善法根也</p><p>欲行至萤火四呵不知欲。此诸比丘欲慕于大。应说大乘世界成其乐欲。那忽以小乘世界起其小欲坏于大欲。此根欲性开十力中三力也。根是过去欲是现在性是未来。此中但明根欲。不辨性者以善根未成欲乐犹有可改之义未成性也。故大论云欲名<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>而起。性名深心为事。若过去善根牢固成就今生对缘则起。此是因性成欲。若过去善根未牢今生遇缘起欲数习成性。故云性以不改为义。欲性相关呵不知欲即兼得性。此有三譬。即大乘三种欲乐之心。一欲行大道莫示小迳。此譬欲观法身实相无上大道。即智度大道佛善来也。何者此诸比丘已有欲求实相之心。满愿为说半字之法即是示小迳也。二无以大海内于牛迹。此譬欲修大乘万行<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。何者此诸比丘欲修大慈万行。大心即是大海。满愿为说小乘道品。即是牛迹。令本大心修小<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。即是大海内于牛迹。三无以日光等彼萤火。此譬用大乘无作四谛一切种智。比于小乘有作一切智也。何者此诸比丘欲求大乘一切种智。满愿为说小乘一切<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。若言见真是同理须比并。然以日光不可比萤略有五义。一是虫光非宝光.二[日*焱]烁不停.三破闇少.四夜自照.五无所利益。岂得等彼日光。日光者一是宝光.二常照停住.三破闇遍.四自照照他.五一切皆蒙日光恩被。合萤光五譬寻之可知。此诸比丘具此三欲必成<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>秘藏。何者大道即法身。日光即般若。万行即解脱。岂可以小乘三欲而比并焉。复次满愿不知此四心者。不能深知往昔值佛已来有此心数根欲。中间废忘四心虽在犹未决定。若闻大乘大心即发。藉前相资至不退转。既是不定。若闻说小便随二地。故不可也富楼那下二结过文为二。一正结过弹呵。二譬显。初文者。过去值佛发前四心中忘此意者。自尔已来经生历死。虽报障所障犹为可发。何得以小乘四悉而教导之令乖昔志。问往昔善根定失不失。答虽忘不失。故法华云不觉。内衣里有无价宝珠。又经言一句染神弥劫不朽</p><p>我观至利纯二譬显结过。小智微浅观生灭见真名一切智。此智不断尘沙无明。又不能知物根缘。不能圆照法界故名微。如兔渡河不穷实相之底名浅。犹如盲人不能分别者。二乘但有肉天慧三无<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。故不见根缘。无佛眼故不见佛性。无菩萨根对三谛尘不发三智。心无所了故如盲。又如生盲者。二乘虽有肉眼不<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华明六根净。一时见三千界十法界色故如盲也。二乘虽有天眼作意能见千界乃至大千。诸佛菩萨有真天眼。不以二相见诸佛土。小乘无此故如盲也。若菩萨慧眼少见佛性而不了了。二乘慧眼都不能见。但见于空即是盲也。诸佛慧眼者如十六王子所叹。愿得如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>慧眼第一净。当知二乘全无五眼故说如盲。若无五眼不能分别众生于三谛理根之利钝时维摩诘至三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。三净名入定加诸比丘。所以加者令识<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>自忆。曾于五百佛所发心修行<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>大道</p><p>即时下。四诸比丘还得本心文为二。一明得本心二致敬。初文者以<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>力加诸比丘。令悟昔修四心。故言还得本心。二诸比丘敬礼者。满愿差机回遑无益。今蒙所加即知宿命。善根开发荷恩不轻感愧<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>。问<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>何以礼俗。答入道恩深碎身莫报。此诸比丘方行大道岂存小仪</p><p>时维摩诘因为说法。五净名为说法。正用大乘四悉赴其四心而为说也</p><p>于阿耨至退转。六诸比丘得不退转。圆教似解不退即铁轮位。若真不退即铜轮初住。往昔发心应是五品不定位耳。或是通别不退未可定判</p><p>我念至说法也。七满愿自愧。无种智法眼不见根缘。致有差机之失。岂得称为说法第一。而谬有所说于物无益甚可愧惧。是故不任诣彼问疾。四结辞不堪。自惟往昔说法差机致被呵折。今岂堪传佛旨往问疾也</p><p>佛告摩诃迦旃延。六命大迦栴延文为二。一命问疾二辞不堪。所以次命者诸弟子中论义第一。摩诃言大旃延姓也从姓立名。又此翻不定。有云肩[利-禾+垂]有云文饰未知孰正。如须陀耶<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。八岁论义而得<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。又如十仙梵志皆因论义发心入道。故大经云乐论义者生五净居。即于彼天而般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>深求其致。乃至成前五种利益。具如身子</p><p>迦旃延下二辞不堪文为四。一正奉辞不堪。二述不堪之由。三正述不堪。四结成不堪。初文者良以往昔解释五义被弹无答故。不堪传如来旨也</p><p>所以下二述不堪之由。由佛为诸比丘略说法要。我即于后敷演其义致被弹呵。文为二。一佛略说法要二迦旃延于后广说。初文者此有四句。一名略义广名教少解义多。二名广义略名教多解义少。三名义俱广名教多解义亦多。四名义俱略名教少解义亦少。如总相说苦谛不多解释即是名义略。若别相分别苦有四行种种譬喻解释即是名广义广。若但总说五行而种种解释即是名略义广。若具说十六行不分别解释即是名广义略。佛为诸比丘或当总相略说苦谛不别解释。或是略以十六行总相为说五行。不为别相广分别说即是名略义略。故言略说。问旃延广解佛五义。何得约五行解。答约理名五义约智名五行约定名五禅。转侧相关义无乖异。言法要者。以五行撮要众行旨归入道最胜故云法要。何者此十六行摄一切行。今取此四者。苦下四行总缘念处能生暖法。即是似道。至上忍世第一法随用一行得入苦忍。即是真道入道事足。故言法要。又此五行即三法印。印声闻经。何者苦合<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>空合<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。及以寂灭即三法印。故言法要。又此五行即三脱门。空无我即空。寂灭涅槃即<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无常苦即无作。此三脱门摄一切法故云法要</p><p>我即于后敷演其义。二旃延广说者谓无常等五。言于后敷演者。佛为诸比丘总相说苦。或总相说五。正为得意令其进道。故不别相广分别说。恐以乖机失正道意。旃延谓比丘不解。故于说后广敷演之。敷者言开。演之言广重为开广说五义也。又广说有二种。一横广二竖广。一横明者历于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>一一别说苦谛五义。二竖明者约身边二见四见六十二见一一分别说五行也。若常徒数师虽细分别说于五义。只是横广不得入道。今一家置横用竖以为入道。但旃延见有无入道。造昆勒论。论所明义。若说念处即知四倒说三毒。即知三圣行说有即知无。今为诸比丘必依其论约有无门。纵容二边广说五义。但佛在世说无违诤。入门虽异得道是一。有所造论各述其门不说余法。故大经明五百比丘各说身因。即其事也。旃延造论若不善通三藏四门分别无滞。其论焉得传南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>。毗昙有门乃至非空非有门各明五义。四门明义具在玄文。细推于经四种五义宛然可见。具出事繁。问何等是有无纵容五义之相。答如有空二门二师各判一往硕乖。今昆勒论纵容有无因之入道。而还用此为诸比丘广说五义。青目注中论云。少有少无入道者钝根人也。恐此纵容不决判属钝根。或是旃延因此纵容广说五义。不能决判令其入道致为所弹。即是不堪之由。问佛说即略比丘未解。旃延广说此有何过。若佛用三藏教不逗机者。此过由佛非关旃延。答佛意难测出没多端。虽初以三藏接引入道必由衍门通教。是以如来权用三藏五义。旃延不达更广说之。既不能令比丘进道。致令被呵故云由也</p><p>时维摩诘下三正述不堪之事。文为三。一呵能说心非.二呵所说法非.三诸比丘心得解脱。初文者小乘入真无言无说。从真出俗则有心有说。是则以生灭心说实相法。既是生灭不称实相。岂以此心而说实相。又四义是生寂灭是灭。如此分别非说实相。又出观心起是生。入观心忘是灭。实相不尔何以此心说实相法。又旃延因有无入道。还约有无以说五义。生即是有灭即是无。所说既是生灭有无。能说必尔。故云无以生灭心行说实相法。又声闻四门五义皆是折法生灭之观。故中论云。为钝根声闻说<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生灭。是则四门虽异皆是生灭心行说实相法。何者一往通教八地已上二谛双照。即真而说。别教初地道观双流。即寂而说。并恐是有教无人。唯圆初心即寂而说。如修罗琴名非生灭说实相法。又旃延非但说法心非亦不知根。此诸比丘必因通教巧度得道不藉三藏。故大士呵其生灭无定慧力不见他机谬说迂拙之五义也</p><p>迦旃延至寂灭义。二呵所说法非。所以呵者旃延所说既是拙度。故诸比丘心不开悟。今净名为说体法五义。非但止通入真亦通中道。诸法毕竟不生不灭。是无常义者。三藏明粗细生灭无常。只是无常非无常义。若了诸法非生非灭。横计生灭故以四句捡生回得即无有灭。是则不生不灭。是无常义。五受阴洞达空无所起。是苦义者。三藏明粗细<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>此只是苦非苦义也。衍明体达本无粗细。妄计有故体有即空。不见苦相名无所起。即是苦义。诸法究竟无所有。是空义者。三藏所明生法二空此只是空非是空义。衍明体此诸法即是实相本来空寂。妄计人法故。既言究竟无所有即不须破折。若无有之可折何有空之可存。即是毕竟无所有是真空义也。于我无我而不二。是无我义者。三藏明人无我只是无我非无我义。衍明实相真空本来无有我与无我。妄计有故说于无我。若不得我亦无无我。我与无我本来无二。无二即无性。无性之性即真无我义也。法本不然今则无灭。是寂灭义者。三藏所明以有还无名寂灭涅槃只是寂灭非寂灭义。衍明诸法从本来常自寂灭相。即大涅槃不可复灭。即真寂灭义也。而凡夫妄见流动二乘对治灭之。菩萨体达法本不然即是<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>寂灭之理。本来无有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。今则无因灭果灭之灭谛涅槃。若见生灭真空不二之理。即是真灭义。三藏明五法名义皆异。衍明五法。假名虽殊名字即空。其义一也。此是通途释衍五义。亦得即是圆五义也。若破旃延有无纵容明五义者。应云诸法毕竟不生不灭是无常义。何得有无纵容是无常义。破下四义类之可知。问上说旃延为显四荣示受呵折。今衍明五义前四结枯岂是显荣。答若破真入中结真成枯中自成荣。如涅槃明二鸟双游。常无常俱。真无常义不得离常。故此经明于我无我而不二。即真无我义。若大经明我与无我其性不二。不二之性即真我义。即是无我法中有真我也。净名结真明四枯者。意为显荣。正是方等生苏教意。出没未显岂得顿同法华涅槃</p><p>说是至解脱三明诸比丘悟道。此诸比丘必因生灭调心得入无生正道。是以佛初略说生灭调心。后因大士呵于旃延方废生灭。用无生五义称机而说。即便入道。心得解脱者因闻体法入空得罗汉果。故大品叹罗汉德云心得好解脱。慧得好解脱者即是脱三界思惟。心得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>具八解脱</p><p>故我不任诣彼问疾。四结成不堪。旃延自惟往昔为诸比丘广说五义。为净名所呵默然无答。岂堪传旨故辞不堪</p><p>佛告阿那律七命那律文为二。一命问疾二辞不堪。所以次命者以其弟子中天眼第一。是刹利种白饭王子。或云阿泥卢豆或阿[少/兔]楼驮如楚夏不同耳。此云如意或云无贫。过去一食施辟支佛。九十一劫天上人中受如意乐故名如意。尔来无所乏短故名无贫。佛之从弟。初入道时多睡为人所呵。因是不寝遂致失眼。白佛具说。佛云眠是眼食。如人七日不食则便失命。七日不寝眼命则断难可治之。当修天眼用见世事。因是修禅得四大净色。半头而见观大千界犹如掌菓。若三藏佛全头天眼彻见无碍。虽不及佛于声闻中最为第一。即是作意数以入道具如上说。深求其致乃至成前五种利益。具如身子章初</p><p>阿那律下二奉辞不堪。文为四。一奉辞不堪.二述不堪之由.三正述被弹之事.四结成不堪。初文者良以往昔梵问天眼即答所得致被弹呵。莫知所酬。岂堪传旨往问疾也</p><p>所以下二述不堪之由。文为二。一梵王来问.二那律答。初文者但世界之主统御大千。报得天眼。亦见大千。报得天眼无如梵王。王及眷属闻其那律于声闻中天眼第一。欲知优劣故来请问。我即至摩勒菓。二那律答。余诸声闻所得天眼无有能见大千界者。故大论云大罗汉天眼唯见小千。大辟支佛见百佛世界。诸佛如来见一切佛土。那律独见大千者。以其偏修作意数。故于诸声闻天眼第一。一往与梵王所见似同。既无过彼之用则不生其敬仰。岂能令彼发心。致被大士所弹。即是不堪之由。问若尔何异。答梵王报得于自住处。则见大千余方不见。那律以修根本等五种四禅八色清净。发真天眼随所至处皆见大千。如观掌菓。诸罗汉虽不见大千随其所见如影随形。又梵王总相见见不分明。那律别相见见则分明。乃至诸罗汉因净禅得者皆别相见见则分明。又梵王天眼是通非明。罗汉天眼是通是明。有如是异也。问梵王天眼见大千与法华肉眼何异。答大论明。报生天眼在肉眼上。天眼开辟肉眼见色故见大千。大品明菩萨肉眼见百由旬乃至大千。过此则用天眼。以肉眼与风相违故不说见他土。若<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>力肉眼能见大千一切法者。三藏二乘天眼慧眼所见事理尚不能及。何况梵王而可并耶。故大经云。学大乘者虽有肉眼名为佛眼。二乘之人虽有慧眼名为肉眼。以其慧眼见真断惑。与圆教肉眼有齐有劣。圆教肉眼名为佛眼者。以其虽具烦恼性能知如来秘密之藏</p><p>时维摩诘下三正述被弹之事。文为五。一核难.二那律受屈.三梵王请问.四净名答.五梵王及眷属发心。初文为二。一双核二双难。初文者罗汉功德有二。一有为二无为。有为即是十智三三昧三明六通。无为即是三界见思断处无生无灭。天眼若属有为是作相见。若属无为即无相见。定依何等而见大千</p><p>假使至有见二双结难。净禅天眼皆生灭作相。虽与根本力用有殊并是有为。一往无别故言与外道五通等也。若无作相即是无为。不应有见者。此约无为功德结难。无为正是证数缘尽。无所缘见岂见大千。若无为有见何异外道。既不得有见则不应言见于大千。若还取有为见大千者。此则孱同梵王。凡圣何别。既无胜力岂能发起梵心。那律之失正在于此。何者三藏折空不见中道。入观即同无为无见。出观还同有为有见。有如是过故被难致屈</p><p>世尊我时默然二明那律受屈所以然者对此核难莫知所通</p><p>彼诸梵下三梵王请问。文为三。一叹未曾有。二作礼致敬。三正请问。初文者闻那律答未觉有异。今闻大士致斯核难。那律既坏则梵王非真。必更有真天眼。故生未曾有心也</p><p>即为作礼二明王及眷属敬心内发申其敬怀。亦是致请之仪。而问曰世孰有真眼者。三梵王请问那律及己既皆此非真。必应有得真天眼者。故言世孰有也</p><p>维摩诘下四大士答。文为二。一答有真天眼人。二辨真天眼相。初文者真天眼人以见中道无二边伪名真天眼。问无二边伪是真慧眼何名天眼。答即中见色名真天眼。常在至二相二辨真天眼相。谓常在首楞严等诸大三昧。亦名常在大般涅槃深<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>窟。亦是一切众生皆灭定相。见诸佛国者寂而常见。如明镜净水万像皆现。不以二相者不同梵王外道有为作相。不同二乘无为偏真冥然无见。又不以二相者。中道真天眼非二谛之相。而能遍照四土二种生死。死此生彼依正并现王三昧中。即是真天眼也。问此真天眼何教所摄。答非偏非圆。偏圆双见即圆教真天眼也。问若佛见中道名天眼者。何名佛眼。答今取证理见十方土及十法界粗细之色名佛天眼。圆见三谛无二名为佛眼。随义分别五眼宛然。若深得天眼之意何妨四眼。如金刚般若所明。若具分别废论余事</p><p>于是下五梵王发心。文为二。一正明诸梵发心。二明致敬而去。初发心者前闻那律所说不辨实相之理。又无遍见国土之事故不能令诸梵发心。今闻大士所明理真事广过前所见。称会根缘皆发心也。圆教似发即是铁轮。真发即铜轮也。礼维摩诘足已忽然不现。二致敬也</p><p>故我不任诣彼问疾。四结成不堪。那律自惟往昔为于梵王而说天眼。致被大士弹呵莫所对。岂堪奉旨往问疾也</p></div>"
},{
    "title": "维摩经略疏 第六卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第六卷</p><p>长者子宝积下二叙述序者。大圣现相难测。自非宝积神智高明孰知所表。为欲起发时众令知现瑞表说佛国信解分明。故说偈以叹述也。就三十六行偈为二。初十七行述叹表发之由。次十九行正述叹现相表发。发由为二。初九行述叹胜应法身以为近由。后八行述叹劣应以为远由。言胜应者若为菩萨说大所现相好威德殊胜。寻此胜应即得法身。言劣应者若为声闻说小身相则劣。寻此劣应不见法身。故法华云。即脱璎珞着弊垢衣尘土坌身状有所畏。问何故胜应为近由劣应为远由。答胜应是即座说普集经。由此现瑞故是近由。劣应是昔说小教之身远为由籍故是远也。问<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>劣应自是昔事。何得为此作远由也。答法华云于二十年中常令除粪。过是已后心相体信入出无难。是故今时共诸声闻说大乘经现胜应身。合盖现瑞表说佛国。当知由昔劣应显今胜应故为远由。就近为二。初两行略叹形声两益。次七行广叹形声两益此之略广皆是叹。前说普集经正报<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。何以得知。下叹<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不有亦不无以<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故诸法生。就前两行为二。初一行叹形益。次一行叹声益。初又二。初上句叹色<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。次下句叹心功德。大经云。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>者亦色非色。云何名色金刚身故。云何非色十力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>非色法故。今初叹色。约眼叹者即金刚身三十二相之一也。但身分虽多所尊者首。首分又多其要者目。叹胜摄劣故也。力无畏等<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>虽多叹心皆摄。是故举要以叹色心。目者眼之异名。眼主肝肝悲则眼泪。叹眼即是叹大悲也。大论云。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>是佛母大悲是般若。母故约此相叹色功德。问法身亦有相耶。答此是胜应表于法身。寻此眼相得法身佛眼。故叹应身即是叹法身佛眼。余相类此。故法华云微妙净法身具相三十二。但眼是总名。从用分别则有五种。一肉眼见粗事色。二天眼见因果细色。三慧眼见粗细色心偏真之理。四<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>见色粗心细因缘假名俗谛诸法。五佛眼见中道圆真佛性之理。又能双照粗细因缘事理。约教则有四佛五眼不同。金刚般若佛问善吉。如来有肉眼乃至有佛眼不。善吉言如来有肉眼至乃有佛眼。今宝积叹者五眼皆离垢障故言目净。修广者修之言长。广之言阔。五眼见境竖深穷源故名修。横遍法界故言广。如青莲者西土青莲华叶形相修。广相似佛眼故用譬也。又复非但形似佛眼。处在淤泥不为所染。五眼亦尔。非但照境竖深横广。虽照世境不为所染。故叹目净如青莲也。今略以五眼帖释。肉眼者功德果薰无恶<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>故名目净。竖从<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>上至有顶诸色悉见故名修。横遍百亿无色不见故言广。虽见诸色不染不着如青莲也。天眼者因禅离盖发净眼根。以眼根净故名目净。竖见界外名修。横见十界名广。虽见不染如青莲也。慧眼者无界内外见思名目净。竖照内外真理究竟名修。横见内外真理名广。见真不染如青莲也。法眼者无尘沙惑名目净。竖见界内外四种<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>之法名修。横见十方十界四种四谛之法名广。不着诸法如青莲也。佛眼者无法界无明名目净。竖见界内外中道法界穷源尽性名修。横见十界中道一时圆照名广。不为法界无明<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>所染如青莲也。此但略出别圆五眼。藏通皆约界内二谛以明五眼。但约随情色心分别即三藏五眼。约幻化色心分别即通教五眼。问今长者子定叹何眼。答经属方等具说四教随四根缘。何所闻知叹无乖隔。下云一音演说随类各解。若观心者一心<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>照心因缘粗细及即空假中。对修五眼可以意知</p><p>心净已度诸<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。次句叹心。言心净者佛智穷源无法界惑故言心净。已度诸禅定者通论禅定俱通因果。故大经云大般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>名深禅定窟。岂得叹言心净已度大涅槃也。今约别义禅定据因<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>据果。果出因外故言已度。问何以得知禅是因名。答大论云禅此言思惟修。佛心智鉴圆明岂发思惟。究竟无学岂得言修。又翻弃恶。如来纯净之智何恶可弃。故大经云有所断者名有上士。无所断者名无上士。故思惟等义皆是因也。约教者三藏佛心无习故故名心净。四禅四空观练薰修永离法爱故名已度。但力无畏不能等照。通教佛心照极<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>之源。界内习尽于诸禅定无碍<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。十力无畏一时照境故名已度。别教缘修智显<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净之心。十二品无明究竟永灭。地持明九种大禅。菩萨依第九清净禅得大<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>果。出过清净故言已度。此约地前修自性禅。登地得一切禅。乃至等觉住清净禅。断十一品无明入重玄门名清净禅。<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>出过故言已度。圆教六根清净即自性禅。初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>住即一切禅。已究竟离虚妄显自性清净之心。如是乃至清净禅破四十一品无明住无垢地。如来心净度此禅定登妙觉果故言已度。故金光明云。是时如来游于无量甚深法性。过诸菩萨所行清净。璎珞明昔在华严明集八禅众。即前八禅为说华严。得入清净禅住无垢地。常徒旧解但取四禅四空。说华严时声闻尚如聋哑。八禅外道何足可集。若约观心一心三观。一一<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>心即如来心。本性清净故言心净。能度事禅故言已度</p><p>久积下次一行叹化他声益。所以然者。久远修禅内成相好。外具<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>称会物情。又<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来常修智慧。内能离结称<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>理。故得心净度诸禅定。外称无量众生根缘。能于四不可说用四悉檀而起四<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>导一切。证四灭理故云导众已寂。形声之益荷利恩。深是可敬重故须稽首。又解般若导行至果便息故言已寂。上句释成目净修广。下句释成心净已度</p><p>既见下次七行广叹形声为二。初五行广叹形益次二行广叹声益。既见大圣者即是见佛色用神变。是法身清净无碍之色如如意珠亦如明镜。故放光动地十方佛土皆悉现也。是则一切法趣色。色为不思议藏色为法界海。是以广大犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无有涯际。故约色叹功德用也</p><p>其中诸佛下一行释成色用。若非佛神力加被此会岂见他方诸佛闻佛说法。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华中以佛神力令众得见百千万亿国土虚空菩萨。问此即是现相表发何得是表近由。答有师谬谓是合盖现土。今寻文不尔。此叹说普集现相非合盖现瑞。合盖现瑞如下偈云。今奉<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>此微盖于中现我三千界。方是正叹表发也</p><p>法王法力下一行叹佛心用。言法王者得<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>王三昧故名法王。法力者于二谛三谛四四谛一切诸法自在故也。超群生者佛心清净超过二死之外。逈出十界之表</p><p>常以法财施一切者。四种道谛七圣法财常施十界恣其所用。问法财为嘱色心用耶。答财通色心如无尽意及净名施者皆名法施。但约能施之心色声皆是法财摄也</p><p>能善分别下一行约二智。以释心用成法施之义。权智分别世谛法相。实智于第一义而不动也。问上多约三谛今何得用二谛叹也。答合真入中合真入俗。通别二谛玄文料简。又解若随情辨真即是权智分别法相。若随智之真即是实智寂而常照。是故叹言于第一义而不动也</p><p>已于诸法下一行结叹色心用。已于色法得自在故。故能转变普现佛土。已于心法得自在故二谛开合随机利物。色心功用既备。是可归依故致敬稽首</p><p>说法不有下两行二广叹声益。述叹上<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>围绕而为说法。上现尊胜表说大乘。今犹现说法表当说依土。验非异席所以为序致有此叹。不有不无者中道法也。不有故非俗不无故非真。然说法本约二谛。既非二边说何等法。当知正说大乘中道。何者凡夫者有二乘者无。菩萨正观中道佛性。是故方等为诸菩萨多说中道<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。故言不有亦不无也。问上用二谛以叹佛智。今明说法那约三谛。答有无为俗中道是真。即二谛也。问外道亦说神及<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>非常非<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。即是非有非无。小乘亦为车匿说离有无。今何得言但是大乘。答凡夫外道尚不见真谛之无况见非无。声闻经中虽说非有非无。只见真谛之无。何曾见中非无之理。约教明双非不同者。若外人计单复具足双非之句及不可说。皆是妄情不见空理不出生死。尚无非有何况非无。悉为三藏有门所破。三藏破见凡有四门。为车匿说离有无经。但是非有非无门耳。若得方便从门入理。但名非有不名非无。不得方便即堕有无与外道等。纵令入理亦非大乘不有不无。通教观色等皆如幻化不言有无。若从门入理此即非有非无门也。若向通人闻说见理。若执为戏论邪见火烧。纵令入理亦非中道不有不无。别观中道约破二边。明非有非无者此就藏性四门明非有非无。异前两教。若得入理则不须破。若未悟者是愚痴论。非真中道不有不无。圆虽四门一门即四门。四门即一门。不定有无无所依倚。将此虚心豁见中道。于此生着犹尚须破。何况于余。今简伪显真得圆之意。不有不无以叹胜应不有不无也。复次前三双非是权圆教是实。权实皆说故言说法不有亦不无也。以因缘故诸法生者。叹说法缘起之用也。缘起有二已如前说。今之叹意备含此二。然体非有无岂得有生。有因缘故。亦得说者。顺界内无明因缘则二苦集生。因灭无明即二道灭生。界外准说。故言有因缘故诸法生也</p><p><a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无造无受者。此一句结非有非无。历四教明四种无我无受(云云)</p><p><a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>不亡一句结以因缘故诸法生。通别无明为界内外恶。即二处苦集不败亡。通别无明灭二处道灭不败亡。因缘生灭比说可知</p><p>始在佛树下次八行叹劣应为远由为二。初两行叹形益。次六行叹声益。叹形为二。初叹应色次叹应心。佛树者坐此<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>故也。有言元吉亦云菩提。初成道时诣此树坐。魔恐成道化我眷属空我宫殿。先遣三女。菩萨心安不能惑乱。魔王增忿遂将欲界八十亿鬼神兵众在菩萨所。魔自败散。具在瑞应。<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>灭者。魔王去后菩萨中夜入于四禅。三十四心见四谛理名得甘露。正习俱尽故名灭也。觉道成者。因四谛发真见第一义。时朗然大悟知常无常知众生数非数等。具力无畏等一切诸法名觉道成也。神力降魔。神通即是色法功德之用</p><p>已<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>意下一行次叹应心已。无心意等者。得甘露故见爱颠倒四阴皆灭名无心意。何者若有心意即有心倒。倒即三受。受即三苦是苦谛也。行即行阴思数作业。业招生死即集谛也。无心则无受无受则无行。无行则无业无业故无集。无集则无苦。苦集若灭即是得甘露灭觉道成也。大品明五受五行。行是集谛集谛断故佛无心意。无心意故无五见受行。故能破外道五见受行。虽无受行为调外道说三藏五门。如佛破长爪云。汝见受不。汝有不受之见还成于受。受即是苦与他何异。而倚不受憍慢轻他。起身口意行行成名集。集招生死何名实相。长爪信伏得法眼净。伏诸外道例皆如此。问长爪是后时事。此叹明未转法轮前已伏外道。是何等外道。答旧云佛昔为凡夫时从阿罗逻仙受八禅定。菩萨无心从其学但为化之。今谓乖偈叹。偈明佛未成道前降魔成道后伏外道。何得以凡夫时受八禅为伏外道。又恐是如来初成道竟未转法轮。乃为提谓长者说于<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>扶其本习。辨五行六甲阴阳历数。其既信伏令归依<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。有当来僧汝当归依。长者得初果。佛实无心受行五行六甲。但为摧伏是故说也。案结集法藏明从波罗柰至涅槃夜结为修多罗藏。故知伏提谓在转法轮前。从是已后皆以不受之法破诸外道。如向所引长爪之类</p><p>三转法轮下六行二叹声益为三。初两行叹转法轮。次两行叹法妙<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>受益。后两行结叹。初言三转法轮者即是趣波罗奈说生灭四谛也。轮者佛证四谛法有可转之义故名为轮。又解能坏<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>名之为轮。如轮王宝能坏怨敌。佛法轮宝能坏烦恼故名法轮。如来成道经三七日方趣波罗[木*奈]。生生虽不可说。以悉檀方便起天人小机而说四谛。转入彼心坏彼烦恼故名转法轮也。三转者。一示转谓是苦是集是灭是道。二劝转谓苦应知集应断灭应证道应修。三证转谓苦我已知集我已断灭我已证道我已修。初转示见道劝转示<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>证转示无学道。是三转十二行法轮。初转则生眼智明觉。昙无德解三转不同事如别明。言大千者即<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>释迦之土。即转法轮所化之处</p><p>其轮本来常清净者。如三种药中无三种病。四谛法轮无见思垢故名本净。又解生生不可说而说四谛。不可说即真谛。无其苦集说名本净。如大集云。陈如获得真实知见。问陈如见真如成论不。答陈如依有门成论是空门。教门虽异见真是一。空门得道是须菩提</p><p>天人得道者。天是八万诸天人即[牛*句]邻五人。五人闻法初得见谛。八万诸天得法眼净。有人云[牛*句]邻初得道四人至夏初方得。恐是经论异出不同。此经亲云天人得道<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>现世。若四人不得见道即非见谛得戒。但[牛*句]邻一人不名僧宝。此为证者。佛所说法契理契缘。非如六师妄有所说不能令人得道</p><p>三实于是现世间者。不约一体三宝。何者初觉道成始有佛宝。三转法轮即是法宝。[牛*句]邻如等见谛得戒即是僧宝。自<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>佛灭后三宝隐没但有旧医。今佛出兴三宝始具</p><p>以斯妙法下次二行叹法妙天人受益。生灭四谛为妙法也。能令众生毕故不造新谓之妙法</p><p>一受不退常寂然者即是初见圣谛永不退失。若世智断结遇缘便起。今无漏智断诸戏论毕竟不起故言常寂。大经云世医疗治瘥已还生。如来所治毕竟不发故言常寂。案婆娑见有得道尽智犹退退至初果。昙无德见空得道一向无退。虽教不同见道不退。其义无别。今之偈意正叹见道不退为凡夫也</p><p>度老病死大医王者。此通叹医王法因佛说故也。佛自度<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>思惟老病死已亦能说法。令诸众生度三界死。一受不退名大医王。言常礼者众生病无量。佛之法药亦复无量犹如大海。是可归敬</p><p>毁誉不动下三两行总结叹者。生身之佛八风不动。以大悲三念之德<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>女谤而不戚。诸天大梵赞而不忻。八风不动如须弥也。是叹断德。于善不善等以慈者叹智德也。睺罗三摩调达三呵。呵令改恶摩令进善。慈心一也心行平等者约三念处以明平等。一香涂左二刀割右三不涂不割视之平等无有异想。此据色法为三念处。顺我法不喜违我法不嗔。不违不顺常行舍心此约心法明三念处。佛心于此慈念平等。孰谁也。人宝者智人为宝。能别真伪故闻者敬承</p><p>今奉世尊下十九行二正述叹表发之事文为二。初四行总述叹现三瑞表发。次十五行别述叹佛三密。初为三初半行述叹奉盖。次二行半正述叹合盖现瑞表发。三一行正述叹大众<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。初奉微盖者微之言小因小果。大表不思议大果。<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>无方莫测。现三千界下二行半。次述上盖内现土现佛说法。表说应土应身之事。哀现者慈念众生。欲为说此佛国因果故先现瑞以作由渐。方得开阐故称哀现</p><p>众睹下一行三述上大众叹未曾有</p><p>大圣下次十五行别述叹佛三密文为三。初两行叹身密。次六行叹口密。次七行叹意密。三密即是三轮不思议化。三无失三不护也。大圣法王众所归者是叹法身胜应。若法身三昧王三昧三谛自在。为四十一心菩萨圣众及余四部所归。即是上来所明。佛安处众宝师子之座蔽于一切诸来大众故为众所归也。净心者即四众大乘机发。心无疑浊欲闻净道。亦是诸大菩萨净心入观佛三昧故言净心。各见世尊在其前者。此明应身对十法界各见同已。譬如一月影现众水。或见如老<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>像。或见光明相好。或见尊特之身。或见现大小相坐宝莲华。或见身如虚空。此是身密之德。故前释佛在耶离。各见不同意在此也。不共者如此。身密不与二乘及下地共</p><p>佛以一音下六行次叹口密文为三。初两行是辞法二辨。同其语即辞辨。各得解即法辨。辞者一切众生殊方异类言音各异。同其类音故名辞辨。法者一切诸法名字差别种种非一。各有所召。得法辨者皆识语法。即同其音故名法辨。佛以一音而辞法异趣。二辨应物是口密也。佛尚非是梵况同众生令异音解即非辞法。而现辞法者口密力也</p><p>佛以一音下二行次叹义辨。一音说法受行获利即是寻言求旨得言所以所以即是义也。如来本无句义岂有义辨。而能分别一切句义者即口密也</p><p>佛以一音下二行三叹乐说辨。旋转无穷众皆乐闻。四谛逗机我当为说怖畏之事。三界皆苦苦故生怖即苦谛也。求涅槃乐乐故欢喜即灭谛也。厌离者诸苦所因贪欲为木。即集谛也。断疑即道也。又约悉檀者三界苦可畏即世界也。欢喜即为人令生善根故欢喜也。厌离是厌离烦恼。即对治药病相对也。断疑即见谛道。是第一义一音所演。其力如是。如来本非四谛四悉。能以此法善巧利益即口密也</p><p>稽首下七行三叹心密。佛心非权非实能现权实即心密也。文为二。初四行约三种权实二智以叹心密。次三行约三种二谛结叹心密。初文为四。初一行约内外叹。自行十力据内智<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。无畏据外用不怯。此为一双。即约自行权实叹心密也</p><p>稽首不共下次一行叹自行化他。不共是自证之法。导师即是化他</p><p>稽首能断下次一行此有两用。若叹自行即叹佛智断。能断是断德到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>是智德也。若作叹化他能断众结缚者。即是化他权实明智断也。众是众人故属化他。问何得一偈两用。答佛自无缚能解他缚故得两用</p><p>稽首能度下次一行总结上三种权实之智断也</p><p>悉知众生下次三行举三种二谛结叹三密文为三。初一行是随情二谛。何者俗谛无量心亦无量。或是求真或欲乐俗。情有去取故言去来。去取无量佛亦随起说无量二谛。即是随情</p><p>不着世间下次一行是约随情智二谛。随情无染随智空寂达诸法相下次一行是叹随智二谛。智心所照皆入一相而无所碍。如空无依故名随智也</p></div>"
},{
    "title": "维摩经略疏 第七卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第七卷</p><p>尔时长者子下讫阿閦佛十一品半第二正说分文为三。初佛国半品是大圣对机命宗说佛国<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。二从方便讫香积九品是大士助佛阐扬说不思议<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>佛国因果。三从菩萨行讫阿閦两品是净名接诸大众还庵罗园。如来对大众复宗明佛国因果。所以如来赴机酬宝积请说依报者。或前普集说正报因果。所以净名助佛宣扬。扶<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>说不思议解脱佛国因果启悟有缘。譬如<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>奉旨化民。所以还庵罗园。佛对大众具明佛国。譬如大臣为国开境事毕。还朝至尊悦可而印定也。问净名已前弹呵岂得助成此教。答佛未说佛国因果。净名预弹冥会佛意助成今教。云何不可。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>国政阃外之事将军裁之。但合天心何必待诏。但<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>述昔如来默印悬会<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。岂非助成今教。故昔日弹呵通助正报。今日重述成今依报。问此半品及出室两品悉佛自说皆明佛国。其间九品明佛国义盖不足言。何得扶成佛国之教。答佛既始终皆明佛国。净名其间岂乖佛意。如佛答宝积。种种诸行皆净佛土因。净名所说种种诸行何得非也。问始终佛国乃是佛说。其间九品都无佛国之言。岂是扶成佛国之教。答如佛国品明<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>义云。随其方便则成就<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。随成就众生即佛土净。净名有大方便故室外弹呵折伏。室内慰喻摄受。弹呵折伏心无垢染慰喻摄受众善<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。是则调伏众生岂过于此。若众生正报清净庄严则依报国土皆严净也。是故文云随成就众生即佛土净。如此推之净名所说虽不彰言净土因果随其所说摄伏众生。即是扶成佛说净土。其义宛然。问若尔为是净名扶成佛国。为是净名自净佛国。为是成弟子等净佛国耶。答深求其理皆有此义。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华寿量释迦成道甚大久远。今分身佛在于十方净土<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。未来亦然。此类净名扶成释迦净土之义。净名既能折伏摄受有缘之类。若净名成佛皆来生其国。即是净名能调众生则佛土净。弟子菩萨亦受折伏为调众生。众生既因弟子菩萨断恶生善。弟子等后成佛时所调众生皆生其国。故言随所调伏众生则佛土净。问菩萨可尔声闻取灭岂有此义。答所以言深求其理方有此义。如法华发声闻迹。叹言少欲厌<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>实自净佛土。又问疾品文殊方至净名空室表佛国空。因此往复论佛国义。次不思议品灯王国。香积品现众香国。此不扶成佛说佛国因果为此经宗。若不许佛国因果以当宗者。古来何得多云室内六品因空室生。六品既因此而生岂非从佛国生也。净名扶成佛国为宗其义明矣。问此经明不思议解脱何关佛国之义。答不思议品芥纳须弥。海内毛吼等多约依报显不思议也。就半品为二。一宝积请说二如来答。初文为二。一述同类堪闻二正请说。初云先已<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>是故堪闻</p><p>言阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>者此云无上正遍知道心。但发心有三。一名字二相似三分证。今之五百是相似发位。何以知然。下文佛现净土方得无生乃是分证。言相似者通别圆位皆约内凡。问何以但据相似发耶。答声闻干慧菩萨伏忍并未有发义。若声闻性地菩萨柔顺方有发义。故多约此明发心位。愿闻得佛下二正请。宝积同类既有堪闻之机。腾机请说佛国因果文为二。一愿闻得佛土清净即是请果。二愿说菩萨净土之行即是请因。若论次第应因先果后。今为时众慕果行因故先请果后请因也。初所以作此请者。上观佛合盖现瑞知佛欲说佛国之果而现此相。故请说果。次请因者净国之果必籍胜因。大众若闻净国之果则慕果行因。故请因也。佛言善哉下二佛答文为四。一赞许.二诫听.三受教.四佛正答。善哉者初明赞许。所以佛赞许者宝积发问深得现瑞所表之意。又能为同辈致请咨决得宜故赞许也</p><p>谛听至汝说二诫听诫念听者生三慧善故。谛听生闻慧善思生思慧念之生<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。若虽闻不听无受润。因听而不思无染旨趣。思而不修终无证理。三慧若备入道不疑</p><p>于是至而听三受教而听即是奉受三慧之诫也。佛言下四佛正答文为五。一佛正答。二身子生疑。三佛为释。四梵王自述显佛诚言。五佛现净土时众得益。初正答为二。一答果二答因。答果又二。一正答二譬显。正答为三。一标章总答。二别释。三结成。初文言众生之类是菩萨佛土者。菩萨虚通至寂境智俱忘无土不土。但为化生而取佛土。故举众生之类是菩萨佛土。然土不在菩萨众生。亦非共离永寂如空不可说示。以悉檀方便随意赴缘<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>无失。已如前说。今约所化故言众生之类是菩萨佛土。众生义如前辨十界中说。所言类者即气类也气类无边无其正要不出二种。一有为缘集二无为缘集。言有为者即是界内染净国土。迷真滞有而起结业禀分段生死皆其类也。二无为者即是界外有余<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>及开中下寂光。此三土众生迷中道<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>滞无为缘集。赴诸结业受变易生死皆是此类。约教辨者。藏通有为缘集谓生灭无生之类。别圆无为即无量无作之类。故约四教开两缘集四种众生。问所明三土禀报不同所居各异。云何悉同无为缘集。答所迷理同。皆是无明变易生死故通为一类。问若尔云何分别三土不同。答有余五人虽同见真界内惑尽都。未见中断有为集。同生有余受变易生亦名方便生死。别圆两教断通惑者。见空不空。以见空故断有为集。及见不空侵无为集。若从初地初住讫于九地。断无为集同受果报变易生死。亦名<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生死。若十地下寂灭忍。余二生在。等觉中忍。余一生在。分住寂光。即开变易出于有后无有后生死。虽复报殊所居各异并是界外同迷中道。悉是无为缘集气类同也。问何不以四种缘集对四土明四种众生类耶。答一往似便于理有妨。无别自体法界异无为也。得失之事至问疾品当更分别。若还约无为分出二种是则无失。必应须开。但约四教开<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>生此即便也。若约观心者因缘所生即有为之类。从假入空破有为集成无为之类也。若入假名中道破无为未尽皆名无为之类</p><p>所以者何下二别释。但圣心难测今作五意通此经文。一横约染净土通明四番经文。二竖对四土。三类通四土。四约观心。五约教。初横约同居者依经有四。初云随所化众生而取佛土。今先明土阔狭不同由所化多少故尔。如释迦用百亿以为同居满愿成佛。用恒沙大千以为同居。如世造宅量其所居。所化众生取土亦尔。又菩萨所化众生修善多少异。故国土庄严优劣亦异。故云众生之类是菩萨佛土。二随所调伏众生而取佛土者。明诸菩萨为众生取土。净秽不同皆为调伏得宜。非关菩萨<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>优劣。如亲育子爱荣虽殊皆为成就。取土亦尔。自有逼迫妨道则净国安之。或憍奢妨道则秽土调伏。非为以秽令生苦恼。非以净纵乐不修。何者菩萨不为众生作<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>因缘。岂作净秽令其<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。正由众生恶尽多少取土不同。三随诸众生应以何国入佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>而取佛土者。法华云诸佛为一大事因缘故出现于世。为令众生开佛知见。故今明菩萨调伏众生赴净秽土。皆为令得入佛智慧。应以净国入者则事理俱急。令入佛慧。应以秽国入者则事宽理急令入佛慧。根性异故取土不同。故云众生之类是菩萨佛土。四随诸众生应以何国起菩萨根而取佛土者。众生入道由根受法而入佛慧。菩萨观众生眼等六根。何根偏利。若耳根偏利即声为佛事。一切法趣声。声诠三谛及宣四教。用起耳根为菩萨根聚置一国。菩萨后成佛时声为佛事。眼等余根例此可知。具如下文菩萨行品。正由六根偏利故使佛事不同。皆为起众生根类故也。如娑婆以音声为佛事。乃至香积香为佛事。皆由众生根类异故。同居之土佛事不同。故云众生之类是菩萨佛土。二竖对四土者。一随所化对同居土。二随所调伏对有余土。三入佛慧对果报土。四起菩萨根对寂光土。初文者界内具缚未见真理。心神动散<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无定。菩萨方便观其生熟。生则用秽熟则用净。生熟无量净秽亦尔。二调伏者即有余也。何者诸阿罗汉能调难调是名调伏。下文云若住调伏心是声闻法。当知二乘及后三教菩萨界内惑尽皆名调伏。即出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>即应有土。谓有余也。当知菩萨为此众生取有余土。三入佛慧者。初住已上见中道理破无明一品。乃至三十九品皆生果报。当知菩萨为此入佛智慧。四起菩萨根者。对寂光土前入佛慧总相见中。今明起根是别相见中之类。如声闻总相慧为劣缘觉别相慧为胜。故华严云佛眼乃至佛意。鸯掘云所谓彼眼于诸如来常具足无减。修了了分明见。即是于一根尘了达三谛。一切诸法寂而常照无不通达。余根尘亦尔。毗卢遮那遍一切处。是则以常寂土起菩萨根。当知众生之类是菩萨佛土。以法界海六尘起后身菩萨之类皆入寂光。问仁王云三贤十圣住果报唯佛一人居净土。今何以十地亦居寂光。答因果与夺无生寂灭一切种智。三类通四土者。一通同居如前四义。次通有余者随所化众生住方便观断界内结。众生不无福慧优劣。譬如诸天同宝器食饭色有异。为化此众生以有余土净秽调伏入于佛慧。以十界六尘起其诸根。令于诸尘通达无滞见寂光理。此即为有余土众生之类。并得通用四句。三通果报土者。菩萨取于此土正为<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>别圆。诸地<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>既有优劣。即是净秽调伏进诸法门。进诸法门即是法身入佛慧也。令诸根明了得佛诸法界海六根即起根也。四通寂光者。元品无明未尽故须化也。果报既有高下即是调伏进观实相。即入佛慧入重玄门<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>法界海。自行化他横竖转明即是起根。四约<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>观四种境者。谓因缘空假中境。境是心之所依即土义也。众生者。佛告诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>汝等日夜常生无量百千众生。今因缘心多境多心少境少。由照境多少名大小国。如是观境名化心众生。缘善缘恶即净秽国。调能缘之心令住正道即调伏。如是调心悟解不定。随观善恶取悟不同名净秽土。善恶殊入佛慧不异。起菩萨根者随观善恶了知此尘即是法界毕竟常寂。常寂之境发于真智。智所依境即是寂光。复次行人观是四境非为着境。但伏烦恼心数众生。随一一境观其阔狭与不调入与不入起与不起。深识此意在因缘境中。用此四心而起誓愿。愿诸众生皆得如我。化此心数悉令清净即是净土。安立有为缘集众生以四种观于空心多少调伏入慧起根即发誓愿。愿诸众生如我调伏令心明即是净有余土。安立无为缘集众生。若但有行无愿不能净佛国土。如有牛无御。有愿无行如有御有牛。皆无所到。行人住三观心。愿行具足成就众生。净佛国土意在此也。大集云欲净佛土当净尔心即四种心也。故佛答宝积云。随其心净即佛土净。行人当知一切菩萨净佛国土从此而起。五约教即为四别。一所化众生取同居土。四教所化未断有为。即是凡夫。惑断不尽即是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。为此所化取于同居净秽诸土。若四教所化断有为尽为此所化取有余土。若别圆二教所化断有为尽见真中道。无为未尽为此所化取果报土。若圆教所化无为将尽。为此所化取寂光土。二为调伏取佛土者。四教调伏众生。断有为无为尽不尽若凡若圣。以教对土例前可知。但调伏之言异耳。三因国入佛慧。若为禀四教众生禀何教断何惑。若尽未尽。于何国土得开权显实。随其相应之土得入佛慧者。而取四土。例前所化可知。四起根取佛土者。若为禀声四教起耳根。本断有为未尽。为取声为佛事同居之国。余五尘为佛事起五根亦如是。若为禀声四教众生断有为尽。取有余音声佛事之国。余五根尘亦如是。若为禀别圆声教见中道断无为。取果报国声为佛事。起耳根乃至意根。但此中众生六根互用。随一尘起一根即起六根。若为禀圆教断无为将尽取寂光国。以六尘起六根者。皆是寂照之六根令成妙觉六根。此释别为众生取土。傍下文菩萨行品之所明也。下文多倒释故难见。至文当别出也</p><p>所以者何至众生故三总明结成。明此四种取土皆为<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有为无为缘集众生。即是总答众生之类是菩萨佛土</p><p>譬如下二譬文为二。一开譬二合譬。初为二。一开成譬二开不成譬。初开成譬。欲于空地造立宫室者。譬能于空中见不空佛土即成义也。四不可说故名为空。有因缘故说四因果名为不空。菩萨约四种苦集众生用四道灭成四净土。二开不成譬者。若于虚空终不成也。譬于四不可说不见四种<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。四种佛土终不成也</p><p>菩萨下二合譬为二。初合成譬者。但地无空终不得成。有地有空可立宫室。欲净佛土须二法合成。若纯用有凡夫<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>菩萨何能净土。若纯用空二乘通教菩萨亦何能净土。若空地具足而立宫室乃得成就。以不可得空心缘于四种苦集众生。而修四种道灭愿行乃成净土因也。如<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>四不可说。即是空也。以因缘故起慈悲誓愿。修四土说四土也。不可说而说不可立而立。空有不相失不相妨。约不思议论四土也。如妙德问此室何以空。净名答云十方佛土亦复皆空。又云虽知诸佛国土永寂如空而常修净土教化于群生。故知四不可说永寂如空。有因缘故亦可说者。谓起种种殊胜国土。愿取佛国者非于空也。二合不成譬。若但于空则净土不成。此斥二乘及通教菩萨修但空因不成净佛国土</p><p>宝积当知下二正答宝积问佛土因文为二。一横历诸行修因二竖穷心源修因。横广竖深互相涉入不得相离。但言不叠书故前后说耳。法华云如来知见广大深远合盖现土广长之相正表此也。横竖经文须更帖释令高广义成。今先横明修净土因有十七法门。文为三。初三科约三心次六科约自行后八科约化他。初三心即为四意。一别明二通明三观心四释经。一别明净土<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。即三种<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心。一观四谛名为直心。二观因缘名为深心。三发四弘名大乘心。初直心者观四谛理。即三<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>离邪见曲名直心也。故大论云是心无始常曲不端。若得三昧心即端直。今明声闻修三三昧缘四<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。能发无漏断诸邪见名调直定。深心者即观<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。缘觉智慧深于声闻。以观因缘之智能侵除习气。问净土是菩萨行何得约二乘心。答大品明三乘。十地皆行皆学而不取证。佛亦学亦证。法华云少欲厌生死实自净佛土。若二乘心非净佛土者。何得菩萨成佛之时有二乘众生来生其国。问此中但云直心深心。何须强对二乘观心。答此经犹带方便故有此释。准望大品法华恐是约二乘心修净土行。为引二乘来生其国。故大论释<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>劝学中明自有佛土纯是声闻为僧。自有佛土纯支佛为僧。自有佛土纯菩萨为僧。谛缘观心非净佛土者。岂纯声闻来生其国。缘觉菩萨类可知也。问此经云随诸众生应以何国入佛智慧。又法华明十方三世佛于同居土悉开三显一。若有佛土纯是声闻。何得入佛慧而开显耶。答从多为论。同居土多开三显一。大品有此明者示十方不无此事。但诸佛所作常为一事。虽于同居不得显一。是诸声闻于有余土得入佛慧。大乘心是菩萨净土。缘四谛起悲誓名大乘心。二乘自为而声闻但直。缘觉兼深菩萨普济能直能深。故加以大乘心也。二通明者三心只是一心。但名异耳。何者三心只是一。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净非二边曲名之为真。难究源底名之为深。其性广博目之为大。菩萨虽观四谛不与声闻而共。观无作四谛修八直道。如大经明。菩萨修八正道即是佛性。故文云。直心是道场无虚假。故若观无作修八正道。即离邪小纡回曲见名真直心。当知直心正在此也。次菩萨虽观因缘不与缘觉而共。大品云十二因缘独菩萨法。大论云十二因缘名深法忍。故知深心正在菩萨。大乘心者不共二乘及藏通菩萨。如大经云。一实谛者名为大乘。今此三心无三差别。不纵不横<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>异名。欲令易解以三分别。虽复说三如世伊字。菩萨修此三心为众心本。即是初心住于三德。若昔论三心因感于三身四教<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>之果。今明依因三心即感三土四种佛国之果。三约观心明三心者。初体假入空。空假二观方便三心为别。若修中道三心。三即一一即三。四释经文为三。初释直心。今言直心是净土者。前约教明直心。是正因。能感正果。即是下文光严所述。直心是道场无虚假。故今约直心明是依因能感依报国土果也。问何故偏约四谛明直心。答余皆并得约四谛。便亦何离四谛别有余门。直心有五。一世间及以四教。一世间直心者如人实录无有欺诳。此乃凡夫外道之直。虽世情亡云其直犹有谄曲。亦言痴直即其义也。二四教则有四种八直之道无四种邪曲。三藏约生灭离六十二见之曲。通教无生离生灭之曲。别教离恒沙之曲。圆教离二边之曲。各就当教四谛修八直之道皆名直心。此五直心四权一实。今圆菩萨知一切法非权非实。而双修双用悲誓教他修五直行。叹五直法见修五直深生<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。菩萨如是虽复未能八相成道。而能<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。在在处处用五直法成就众生净佛国土。若入初住即具真应。随机利物即现净秽同居。八相成道。非但往昔所化世间直心众生来生。若往昔所化修生灭等四谛四八直。众生断有为无为未尽者。此诸无谄众生皆来生其国。若此众生过去有顿渐不定秘密等根性不同。菩萨成佛则现四身不同。法轮亦有顿等之异。初则赴缘以权方便。若至法华方便则舍但说无上道。废昔三权同归一实。所化众生皆无住权教之谄。故言直心是菩萨净土乃至来生其国。复次菩萨于有余得成佛。时十善直心不得来生。何以故。界内结业犹未断。故若昔所化修四八直界内结尽。方生其国。即是三藏二乘通教三乘别圆一乘。凡七直心。无有为缘集妄谄。众生来生有余之国故言直心是菩萨净土。七种不谄众生来生其国。复次菩萨报土成佛。藏通二直皆不得生。何者别惑未断故。但昔所化别圆二种直心无二边之谄来。生其国故云不谄众生来生其国。复次菩萨于寂光土成佛之时。但昔所化圆教八直无谄众生来生其国。其义如是。岂可一种世间痴直之心来生其国</p><p>深心至其国二释因缘辨深心义。约余法门非为不得。亦何离十二因缘也。深心亦五。一事中深心即修世间福也。四种约观十二因缘以明深心。下智观生灭<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>无生上观无量上上观无作。三权一实。菩萨了知非权非实而权而实。双修深心成就众生净佛国土。慈悲誓愿一切普熏赞叹随喜。上上成就具足。真应二身八相成道。随四众生应以佛身得度。四土成佛之时。是诸深心有缘之类皆来生其国。随其所修若事若理而为说法。分别诸义。类直心可解。言具足功德者缘觉深心修福德故。法华云若人有福曾<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛。志求胜法为说缘觉即是此义。但具有二种。一横具深心净同居土。名具功德来生其国。二竖具深心穷因缘之源。所有功德于三土具足。即是竖具余类直心</p><p>菩提心至其国三明大乘心者。即四教大乘发菩提心。上求下化故名为大。各缘四谛起四弘誓名之为乘。三权一实。圆教菩萨修权实大乘成就众生净佛国土。自行化他赞叹随喜。后成佛时同居四种有余三种实报二种寂光但一。余类直心</p></div>"
},{
    "title": "维摩经略疏 第八卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第八卷</p><p><a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>下二明<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>即<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>因。前三种心是就解明。今约行辨。犹如目足岂得相离。若无三心行不真实。亦非高广故以三心入一切行也。布施有五<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>事施及四菩萨施。世间施者即<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>施。若造恶<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>邪心。及坏<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>施者。亦如调达化阿阇世施诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。或为谋逆财宝赏施。如是等施死入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。檀名地狱檀。若造恶破戒多嗔行施后堕于龙。七宝宫殿依报似天。正报同蛇。或破戒憍慢恐怖得财以用布施后受金翅鸟身。如是等施并畜生檀。行十不善破戒谄毒非法财施受夜叉报。或破戒谄诳耽嗜酒肉多怀嗔忿非法财施堕摩睺罗伽。如是等施名鬼神檀。若少持戒嫉妒怀忿。多修福德堕阿修罗。依报势力与天拒抗。但感正报多诸恐怖。如是乃至乾闼婆紧那罗等皆是谄佞好着音乐。而行施者皆鬼道摄。若持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>十善自荣而施。若轻心局心限碍心施。是毗舍首陀檀。若持戒心殷重心<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>财施是<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>檀。若持戒乐道恭敬博学布施是<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>檀。若持戒恭敬慈心大施能自舍财。亦教他修福是刹利檀。如是等施皆人檀也。若胜品十善持戒精细恭敬听法。慈善<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>华香续明。所重之物如法净施皆是天檀。如<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>明。有一小儿佣力得财供设众僧愿生忉利。佛记得生。若持戒转细乃至修禅厌离心施得生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。名修天檀。上来皆是世间事施<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>不同。若<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>二乘檀者观谛缘<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>用择觉舍觉二分。舍身命财得二乘道。若菩萨檀者舍身命财观察无常。大悲誓愿如尸毗王以身代鸽。是名舍身檀满。舍命者如大论明。释迦调达因地各为鹿王。释迦鹿王代彼而死送身往赴终无悔心。财施者如须太拏太子以好惠施。乃至二子施婆罗门具如彼经。是名三藏菩萨檀满。通教檀者体三事空皆如幻化。起大慈悲愍<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>故舍身命财。别教檀者虽三事即空而不住空。入假化物行种种施。舍身命财如华严说十种布施地持九种之施。圆教檀者胜鬘云。舍身者<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>后际等离老病死得不坏<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。命财亦尔。又华严明如来檀。大经明檀波罗蜜即是<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。大品云一切法趣檀。此经云布施是道场。不望报。故自行化他赞叹<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。权实施者后<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>时五种一切能舍众生来生其国。分别四教所断缘集有为无为尽未尽等四教根缘。来生四土类前直心</p><p>持戒至其国亦五。一事相持戒是凡夫也。四种持戒即是四教所明。四种正语及业命等皆名持戒。具释事繁。言满愿众生来生其国者。齐教明满愿。以尸罗净故诸善得生。所求皆果故云满愿。余类直心</p><p>忍辱至其国亦五。一世间事忍如凡夫。余四忍还约四教而辨。例前可知。后成佛时皆来生其国。如轮王帝释上界诸天界。有三十二相。声闻缘觉亦有相者。四教四种相业不同。并忍为本。四种修相前叹德中明舍饰好。已略辨竟余类直心</p><p><a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>至其国有师云。精进无别体但约众行。或言自有别体。亦五。一事精进即凡夫也。余四种道品各八精进。谓四正勤进根力进觉道是为八。后成佛时五种勤修一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>众生来生其国。余类直心</p><p><a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>至其国亦五。一世间禅定如凡夫得四禅四空。后四约四教四种道品中各有八定。谓四如意定根力定觉道。乃至背舍九次第等皆是禅定。后成佛时四教五种摄心不乱众生来生其国。余类直心</p><p><a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>至其国亦五。世智是凡夫智也。余四智慧即四教。明四种道品中各八智慧。谓<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>慧根力择觉<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。后成佛时五种正定众生来生其国。上来诸句权实及以诸义并类直心。问凡夫等智何得入正定聚。答凡夫世间正见亦入出世正定聚。亦得合说也</p><p>四无量心下三约化他修净土因。此是一往耳。何者菩萨从初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>常兴大悲俱生。岂行六度而无化他。四无量心亦五种。一事四无量心。是凡夫修得生色界而为梵王。四教各有四无量心。三藏生灭法缘四无量心。通教无生法缘。别教界外藏识。恒沙<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>法缘。圆教中道佛性<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>之法缘。如礠石吸铁即无作也。后成佛时五种慈悲喜舍众生来生其国。权实及诸义并类直心</p><p>四摄至其国。此四摄法。至于<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>并非凡小所行。但有四教菩萨明四摄权实不同。后成佛时四种<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>众生来生其国。菩萨四摄摄取众生为令入第一义。是以所摄众生皆有解脱之因。来生四土。及以诸义并类直心</p><p>方便至其国四教各有三种方便。一自行。二化他。三自行化他。复次各有三种方便。一破法。二立法。三<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。后成佛时四种一切方便无碍众生来生其国。权实诸义并类直心</p><p>三十七品至其国。此法二乘有分具如玄义。四教所明三十七品不同。后成佛时如是众生皆来生其国。权实等义并类直心</p><p>回向心至国土如大论云。回向如声入角。四教菩萨回向不同。后成佛时四种具足功德。众生来生其国。回己功德与众生共。善无不满故。今来生之者功德具足也。亦应云欲修回向众生来生其国。恐文略耳。权实等义并类直心</p><p>说除至八难。言八难者三恶道为三。四北郁单越.五长寿天.六盲聋喑痖.七世智辨聪.八佛前佛后。此有二种。一界内为前两教之难。二界外即后两教之难。菩萨约四教说除两种八难。至善吉章更当分别。菩萨自除教他赞叹随喜。后成佛时国土无有三恶八难。约四土料简有难无难。义相繁多难可具辨。余如直心</p><p>自守至之名约四教亦有四种。自守不讥应作四句。一不自守而讥他。二自守不讥他。三自守而讥他四不自守不讥他。大经云假使三子由杖而死。余有一子要当苦治。何容全不讥他。但内无恶心必于他有益。非都不讥也。但见四讥不谬故也。权实及诸义类于直心</p><p>十善至其国十善有二种。一止二行。此是止十善也。亦有五种。一事十善即凡夫所行。后四约于四教菩萨自行教他。赞叹随喜。后成佛时五种十善来生其国。命不中夭是不杀大富是不盗。梵行是不淫。所言诚谛是不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。常以软语是不恶口。眷属不离善和诤讼是不两舌。言必<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>是不绮语。不嫉是无贪。嫉是嗔恚之垢。今约贪者由贪故则有嫉也。不恚是不嗔正见是不痴。权实及诸义并类直心</p><p>如是宝积下二竖明修净土行。有十三番相资成净土因也。上从直心横约十七行。今还从直心竖明从浅至深。将竖约横无有一法而不竖修。将横约竖亦如是。具说如前。一一诸行至金刚心。心净则佛土净也。此为三。一约教二观心三帖文。一约教者。三藏不明净佛国土。何者声闻经中无十方佛岂论诸国修净土行。若言有者成身子疑。既无此教则无行无人何须论也。通别两教须泛论之。今为三意。一约通十地直心对<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>。前未发真名为邪曲。登地见理离诸曲见故名直心。因此直心进入二地。二地能遍行此十七句故名发行。由发行入三地。三地解行俱进故名深心。以深心故得入四地。四地能事理俱行。则自调调他名为调伏。以调伏故得入五地。五地既事理调伏能如说行。得入六地。六地能于一切善法。回向<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。用施众生。以回向故即入七地。七地即有方便能修自行化他得入八地。八地能道观双流亦能处处教化调伏众生。众生既调佛土即净佛土既净得入九地。九地能<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>净说法净即智慧净。九地具四十辨才名智慧地。因智慧净得入十地。十地即心净故一切功德净。始自直心讫于结句言欲得净土当净其心。心净则佛土净。借此十地对成通教竖明相资净土行也。二约别教对十地者。仍有两意。一从初地能见佛性。即破无明离二边曲名为真心。从二地至十地类通可知。但见偏圆以为异耳。次依仁王十四<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。以消相资竖义。彼经取三十心共来对三般若。若尔直心即对十住。何者入理般若名为住。虽未见圆生相似解名为直心。发行对十行。十行正是<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>之义。深心对十回向能回事入理令解行俱深。调伏对初地初地发真。道观双流得名调伏。从二地乃至十地次第对句。等觉对后句心净则佛土净也。故含地前后取等觉。依十四般若竖对诸句。其数整足。虽语有不称诸地名者。若欲解释无往不通。三约圆教者依前历别。义犹有余何容初地止是调伏无余功德。若具足有则不但受调伏一名。若是分有何得调伏独当其称。当知犹是未圆之教。今以十句皆对圆位以辨竖深。用明横广则皆在初住已自具足。何以故。铜轮见理已破无明岂非直心。具足万行岂非发行。念念流入岂非深心。五住圆除岂非调伏。解行相扶岂非如说行。万行流入岂非回向。权实具足岂非方便。得普现色身岂非成就众生。若染净土成道。四教众生来生其国。岂非净佛国土。一音演说四辨赴机。岂非说法之净。寂照之智不谋而说岂非智慧净。实相真心犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>岂非心净。一心万行具足<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>非功德净。正报既净依报亦尔。同于诸佛见法性理。居因陀罗网分入寂光岂非佛土净也。当知初住心中竖深穷于心源。此十四句及无量句磬无不尽。故初阿字门具四十一字。四十一字亦具初门。当知竖论则穷彻后际。横说并备众门。发心正行。傍化二土成就众生悉备初心中也。故大品云初发心时便成正觉。华严云得如来一身无量身。初位既横竖诸句净佛国土。余位亦然。如前引大经十五日月喻也。次约观心。竖释十三番相资修净土因者。一心<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>观于法性即是直心。此一念心具前十七之行。即是随其直心则能发行。事理相资即能进入甚深法界。以深心故事理不善意得调伏。以意调故有所说法。能如说行。回己所行遍施一切。既能回施即令众生断恶修善。以修善故即净佛土。佛土净故即境界净。境界净故即说法净。说法净故内心智慧转得明净。智慧净故则一切功德皆悉清净。此等皆是。观心清净则佛土净也。故云欲净佛土当净其心。随其心净则佛土净。是则竖修一十三句。宛然具在观心之内名观行即也。故法华云。当知是人已趣道场近三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>坐道树下。若功行纯熟诸佛冥加即入相似从相似。进入铜轮分证真实。即于二土自行化他与物结缘。应以<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>而得度者。即现佛身为说渐顿不定秘密法门。教化调伏入慧起根而取佛土。若不如此初住何缘八相成道。一往虽云观心实是真净佛土义也。此是了义。若离此者多是执文随语生见。复次非别无以表竖非圆无以表横。譬如非日无以成月非月无以数日。日月相须能成一岁乃至成多。今横竖相须高广义显。非竖非横而竖而横。如世伊字首罗三目。当知净土之义依<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>秘密藏而有。若三身三德此就正报。三土四土即就依报。依正相成其义可解</p><p>三帖文释者。随其直心则能发<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。直心即是圆教观中修无作八直。得此直心能具万行。故名发行。亦云得此直心即能行前十七横法。随其发行则得深心。直心是解发行是行。解导于行行资于解。解行相成如目足备到清凉池名深广心也</p><p>随其深心则意调伏者。解行既深即能调于事理诸惑。理惑者迷于中道之无明也。事惑者迷于二谛<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>惑也。若初发心即入中道双照二谛。心心寂灭自然流入。即能调伏事理之惑。仁王云。菩萨从初发心至金刚顶皆名伏忍。即调伏意也</p><p>随其调伏则如说行者。有所言说非但赴机利物。内心清净能如说行。言行相扶善根成就</p><p>随如说行则能回向者。内既成就诸善功德。回所修因向于佛果。及施众生随其回向则有方便者。既回自行内向佛果外施众生。即能善巧能破能立。巧度众生故言方便</p><p>随其方便则成就众生者。方便既能巧破巧立。破故折伏立故摄受。若众生四教止行二善成者。四教智断则立。即正报<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>成也</p><p>随成就众生则佛土净者。若众生之类是菩萨净土。众生正报止善无恶依报国土则便清净。正报<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>因成则佛土<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。若国土清净庄严名佛土净也</p><p>随佛土净则说法净者。若秽土说法则如长者执除粪器。此则赴缘说苦切之法。如净名为香积土诸来菩萨说此土折伏之法。不说诸法实相清净之教。若净土说法但说诸法实相清净法门名说法净</p><p>随说法净则智慧净者。说法本赴物机。机缘若净则感菩萨智慧亦净所说亦净。譬如猛风铃声则大。亦如世人说法脱有利智福人来听。说者非意智慧开解</p><p>随智慧净则其心净者。说法之人解慧既进则惑垢渐消。其心转显即是心净</p><p>随其心净则一切功德净者。真心清净修诸功德皆无染着。是则一切皆清净也</p><p>是故宝积至佛土净。最后结撮正要。明净土之因</p><p>欲净佛土当净其心者。从直心来有十三句。名义虽异皆为净心。随其心净则佛土净者。随四教明四种心净。即四种佛土悉清净也。又四种心只是一<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净之心。此心若显即一切佛土皆悉净也。菩萨从初用四道谛净心。前三是权后一是实。事理惑除正报即得佛果清净。依报即常寂光毕竟净也。四教众生垢净之心。来感寂光各见净秽。譬如诸天同宝器食随其福德饭色有异。譬意在此</p><p>尔时下二身子生疑文为二。一生疑之由。二正疑念。初明由者。由承佛威神故生疑也。如来神力加被身子者。此经虽对小明大。身子既小乘中智慧第一。为诸声闻之所揖敬。忽怀疑念即诸声闻咸共生疑。大乘方等有不思议秘密之事。即是秽国有净土也。身子未能称机疑问必假<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>方会物心。故云承佛威神也。依法华意发本显迹。明诸声闻内秘外现。何容不能称物之机而生疑也作是至若此二正明疑念者。疑佛答宝积心净土净。执昔三藏故生疑也。菩萨三祇修行成佛是同。何得今说菩萨心净即佛土净。释迦独无净土应是为菩萨时心不清净。若不清净何得成佛。若心净成佛者亦应心净佛土净也。何得佛土秽恶。若斯翻覆生疑未敢问者。或可自鄙或恐失仪或知如来悬鉴自当知时。故未问也</p><p>佛知其意下三佛释疑文为三。一佛以日月问。二身子事答。三佛合譬解释。初文者日月譬于真应净土。如日月宫众宝所成照四天下。彼中有诸天子。譬真应二土为万德所成。常照四土。一切众生真应法身之所依也。又譬真缘二修。如日月相须则成就万物。照显一切。真缘亦尔。互相成显。以真缘合故常自显照四种净土。而于盲者所不能见。为二缘集罪障障于五眼故也。是故举日月为喻以问身子</p><p>对曰至非日月咎二身子依事奉答</p><p><a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗至而汝不见三合日月譬释身子疑。众生罪故不见佛国严净者。先合盲者众生界内缘集浊恶障重。是故不见同居净土。以界内罪与无为合及界内尘沙罪故不见有余净土。以界外尘沙无明罪故不见果报净土。以法界微细无明罪故不见寂光净土。我此土净而汝不见者。此合日月之譬。明四土常净。身子有前四种罪障故不见也</p><p>尔时下四螺髻自引所见释身子疑。所以梵王引所见者。诸小乘人疑佛。虽说净土谁所见之。是以梵王冥知佛意引所见者证佛不虚。普生时众闻信之善。文为二。一先折身子疑念。二正举所见释疑。初文可解</p><p>所以者何下二正举所见释疑。文为三。一梵王见净。二身子见秽。三释见净秽之由。一梵王自述所见以<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天为类者。有二处天同名自在。或六欲顶或色界顶。今欲界也。类同居净土庄严殊妙。西方净土亦同居净也。彼经亦举第六天为类。故云其宝犹如第六天宝。但六天正报比西方身。如彼乞人在帝释侧。此是举近以况远耳</p><p>舍利至充满二身子述所见秽。如文</p><p>螺髻至清净三述不见及见之由。由于仁者心有高下。不依佛慧故不见净。菩萨心无高下。能依佛慧即能见净。佛慧即是见净之由也。生死为下<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>为高。又云净为高垢为下。由此见故见秽。佛慧反此名为平等。不垢说垢无净说净。垢净之相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>隔碍。故螺髻所睹秽国即净。身子于生死涅槃垢净有隔。不依佛慧故但见垢</p><p>于是下五佛现净土释疑。文为四。一案地现净。二问身子。三答。四正释疑。初文者亦如上举日月譬意。地喻真修指表缘修。真缘若合则真应土现。如指地合故庄严土现。问四土之中为是何土。答有二意。一云现同居净土。二云随机显现。一切大众叹未曾有者。非但说声闻经时之所未见。前说诸方等多显正报。显依报净土未如今也。而皆自见坐宝莲华者。表此大众悉有生净土之理。或复当生佛告至严净二佛问身子如文舍利至悉现三身子答。前说小乘及诸方等所未见闻</p><p>佛语下四佛正释疑文为三。一法。二譬。三时众得益。初法说如文</p><p>譬如下二譬说文为二。开譬合譬。初开譬者宝器譬寂光。饭异譬三土。三土之报不出寂光。依于寂光见不同也</p><p>如是至庄严次合譬。今以十种合饭色异。一约同居者。浊重为垢浊轻为净。此垢净相隔垢不见净也。二约同居有余。同居净中虽无重浊见思牵生故亦是垢。有余土中久断此垢故名为净。垢净未融垢不见净。三自约有余。二乘生彼其土则劣故名为垢。菩萨生彼以具福业感报亦净亦垢。故不见净。四约有余果报。有余之土未破无明其土悉垢。生实报者已破无明其见则净亦垢故不见净。五自约果报者。上下相望报有优劣。自成垢净亦垢故不见净。六约果报望下寂光。七下品寂光望中寂光。八约中寂光望上寂光。九诸土总对寂光。十诸土非垢寂光非净。毕竟无说非垢非净。而说诸土为垢寂光为净。故下文云。虽知诸佛国土永寂如空而现种种清净佛土。今此十番垢净以对饭色</p><p>当佛下三时众得益文为二。一现净得益二复土得益。现净为二。一五百闻说得无生忍。即通七地。别初地。圆初住。次八万四千发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。菩提心位如前分别</p><p>佛摄至意解次明复秽已悟无常得小乘道。初见秽为净。秽是无常复净还秽。谓净无常无常迅速。故得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净见生灭<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>之法分明。小乘法眼在见道位。非大乘法眼也。八千不受者证无学道不受三界虚妄生死法也。故知此经犹带拙度之说。意在此也</p></div>"
},{
    "title": "维摩经略疏 第九卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第九卷</p><p>天台<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>湛然述</p><p>佛道品</p><p>今明此品略用三意通释。一明此品来意。二释此品名。三入文解释。初明此品次观<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>品来者。前品正明通相入空。正成问疾品通教从假入空。调伏界内有疾菩萨。兼成室外为国王长者<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。已如前说。今此品次明通相从空入假观。明非道之道非种之种非眷属之眷属。此即不有而有。正成问疾品明别教通相从空入假观。调伏恒沙实疾菩萨。上文云以无所受而受诸受。未具<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>不应灭受取证也。亦兼为室外呵诸大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。不能于诸见不动而修三十七品。以五逆相而得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>等。故有此品来也。次释此品名。言佛道者佛以觉为义。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>觉他名之为佛。道以通达为义。所觉之理能通观智从因达果名之为道。此以智理标名故云佛道品。正如此品用非道之理即是佛道。是以净名答文殊云。菩萨行于非道通达佛道名为佛道。言非道者大论云<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>有三种道。一<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>道。二业道。三苦道。烦恼即无明爱取三支。业即行有二支。苦即识名色六入触受生老死七支。此之三道皆非佛道故言非道。非道之理即是诸佛实相<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>之理。理即是道故说非道即是佛道。问此品不约<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>明义。何得约因缘三道为非道也。答一切非道不出此三。何者十界摄一切九皆非道。唯佛法界名为佛道。此经明不思议佛道故九界非道皆是佛道。是九界道中<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>是有为十二缘。三乘是无为十二缘。即世出世二边之道各有三道。不能通相从空入假顺入不思议解脱之道。故皆非佛道。但此品不别明菩萨是非道者。以有四教<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>故。别圆入中即是佛道。复次方便菩萨皆有悲愿快顺佛道。故不简出。实非佛道。若是佛道净名何故呵四菩萨八千之徒。复次此品明遍入诸道断其因缘。岂不入方便教菩萨断其有为无为缘集。问若佛是能觉智。道是所觉理者。此非道之理即<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>理不。答如所问也。问若即是者佛性有三。谓正缘了。非道亦得是三因不。答亦如是具如玄义。何者苦即正因烦恼即了因业即缘因。故大经云十二因缘名为佛性。佛性不出三种。因名三种佛性果名<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。何者苦即法性<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。属正因佛性。故大经云无明有爱是二中间则有<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>名为中道。中道者即是正因。若转无明为明是则由惑有解。即是了因。若转恶为善则由恶有善。即是缘因。故知三种非道之理即是三种佛性之理。故净名言行于非道通达佛道。问诸师多云此经未明佛性。何得引涅槃明十二因缘是佛性义以释此品。答大经云若言十一部经不明佛性非谤佛法僧。若说十二部经不明佛性即谤佛法僧。今此方等具十二部。何得言不明佛性。问此经始终无佛性名。何得说言明佛性也。答此品净名说非道为道。文殊说非种为种。种性即是眼目异名。如天帝释岂异憍尸。若谓不作佛性名说。不开佛性义者。有经不以二谛名说亦应不开二谛。何得言诸佛常依二谛说法</p><p>问若佛性有三种亦三不。答如所问。故此品文殊言有身为种六入为种。即苦道正因种性之异名也。无明贪恚等为种。即烦恼道了因种性之异名。十不善为种。即业道缘因种性之异名也。种性之与性义实相映。故法华云唯有如来知此众生种相体性。即其义也。问种以能生为义义映<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。性以不改为义。义映于常。此二义别何得言映。答缘了映种不足致疑。但正因映种义似有乖。深求其致亦相映也。如真非<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>说为正因。是则非因性为正因性。何以不得非因种说为正因种子。问若此经明如来种与涅槃佛性同者。何故言若见无为入正位者。不能复发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>也。犹如根败。种义可断佛性之义则不可断。何以得同。答此带方便明种性义。于利根菩萨即是究竟。二乘不了故须呵折。呵折其声闻密有发理。故法华云。而昔于菩萨前毁呰声闻乐小法者。然佛实以大乘<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。即其义也。问十二因缘法性皆是正因。观因缘智通是了因。助修之善并是缘因。何以偏判各有所属。答义有通别。若如所问乃是通义。别对不尔。法性五阴有无明恶业即成生死五阴。如阴气起水结成冰。无明转为明不善成善。即显五阴成五种涅槃。如阳气起则冰还成水。问无明烦恼岂是智性。答文云不入烦恼大海不得无上智宝。十地论师说。七识是智识。摄大乘说七识但是执见识。诤论云云。皆由不达了因种性义也。六识不达起诤亦尔。问若尔<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>法华明佛性不。答此方等经尚有此义况般若耶。故大经云言佛性者有五种名。所谓佛性.般若.首楞严.金刚<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>.师子孔三昧。又大经明成大果实见如来性。引法华八千声闻得受记别成大果实。如秋收冬藏更无所作即其义也。观心者若知一念十二因缘具十界三道之理。即三如来种三种佛性。是则三道非道不障三德。如世伊字诸法亦然。是不思议智理即是非道。通达佛道故名佛道品也</p><p>尔时下三入文文为三。初明佛道。二明如来种。三明眷属。此三辞异意同。皆是通相入假观也。若就觉知非道之理通达无壅名为佛道。此理显理能生如来名如来种。所生<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>自行二严。能生法身及诸功德。即以此为眷属。若是化他皆假名无壅。三文虽殊同是通相从空入假。故大品云。菩萨能以一切道起一切道种名道种智。即是从空入假智也。初文为四。一文殊略问。二净名略答。三文殊重问。四净名广答。初文所以住此问者。假名分别佛道无量蕴在非道。初心菩萨闻问疾品明不思议通相入假莫之能知。故问菩萨云何通达佛道</p><p>维摩至佛道二净名略答者。菩萨以无所受而受非道诸受。即行于世出世二边非道。通达佛道者。达此二边即是佛道。复次<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>非道即是爱见。爱即魔非道见即外道非道。出世非道者。即二乘四门等种种诸门。具如上释从空入假明诸受也。此世出世皆名非道。菩萨以无所受为欲通达非道之受而受诸受。自行化他。入假分别药病。未具佛法终不灭受取证。即能通达一切佛道。故上问病品云诸魔外道皆吾侍也</p><p>又问至非道三文殊重问。所以重问者以向答意玄时众未解故重请广说</p><p>答曰下四净名历别广答文为八重以明非道。一约无间因果.二约色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>.三约三毒.四约十弊。五约二乘.六约人间诸恶<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>.七约入无余.八总结。初约五无间因果明非道者。菩萨入假为利众生示五逆因受三途果。虽为此事而无恼恚。即是通达佛道。何者观此五逆因缘生心从假入空尚不见逆心。况有逆果。以无所受为物而受逆心逆果。此五逆心即是无生。即阿字门。谓诸法初不生故亦是无垢三昧。若知诸法不生即具一切佛法。如一微尘中有大千经卷。逆心亦尔。具足世出世法。顿渐道品一切佛法十心数十弟子起十法门。<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>双树枯荣之教具在一念五逆生死心中。故言行于非道通达佛道。此即三道五逆之因即是烦恼道业道之非道。三途之果即是苦道之非道。今取最恶因果尚通达佛道。其余理然。故言菩萨行五无间而无恼恚。即是通达佛道。本无逆业而行逆者。即是以无所受而受诸受。通达佛道即是未具佛法。自行化他未满不应灭受而取证也。菩萨于逆如是。通达具一切法即是自行。示行此事即是化他。示有二种。一者示忏。如阇王未受恶果。而求忏法令无数人发<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心。二者不忏。如调达乃至入大<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。阿难随目连往看劝令<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>调达。答言我受此苦如第三禅乐。是为行于非道为利一切。又非恶无以显善。是故调达无数劫来常共释迦行菩萨道。一行佛道一行非道更相启发。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华所明。至于地狱而无罪垢即约果也。此是无垢三昧破地狱有。入此三昧一切三昧悉入其中。如调达在地狱语目连言。若汝更为凡夫我当出此地狱。又如婆薮虽在地狱教无数人。得出地狱听方等经。若自有罪何能如是。良由虽处地狱无有罪垢而能利他。出于地狱即是行于非道而无罪垢。即是入无垢三昧通达佛道。本无地狱之业而至地狱者。即是以无所受而受不取证也。自此已去皆须取问疾品以无所受而受诸受文。来对行于非道之语。历一一句皆类此也。至于畜生无有无明憍慢等过者。如大象猕猴鵽鸟相敬因以化人。即是入不退三昧通达一切佛道。至于饿鬼而具足功德。如请观音云。现身作饿鬼手出香色乳。即是入心乐三昧通达一切佛道</p><p>行色至为胜二明行上界非道通达佛道。所以约上界者。此二界是世间善。若因中生着是菩萨缚。若受果报即长寿天难。即非佛道。菩萨从假入空以无所受而受此因果。不以为胜。以非出世观练薰修之胜法也。而于此非道修白色三昧乃至我三昧等十一三昧。未是自行化他一切佛法。终不灭受取证即能通达佛道也</p><p>示行至其心三明示行三毒。即是烦恼非道而通达佛道。以无所受而示行贪欲非道。离诸染着即是无漏<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>之佛道。示行嗔恚非道。无有恚即是修法缘<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>之佛道。示行愚痴非道而以智慧调伏。即是三智之佛道。若未具佛法不灭三毒之受而取证。是为通达佛道。故诸法无行经云。贪欲即是道恚痴亦复然。如是三法中具一切佛法</p><p>示行至他教四约十弊非道通达佛道。此十亦多是烦恼亦有是业。义推可知。若以无所受而受十弊。入假修十波罗蜜未具佛法。终不灭十弊受而取证。即能通达一切佛道。问八蔽八度如文可解。憍慢对愿诸烦恼对力其义如何。答憍慢轻他。若不发愿岂能作桥梁令他履践。若不转烦恼岂能和光不染常清净也</p><p>示入至众生五明行二乘非道通达佛道。二乘沈空故有无为缘集十二因缘三道非道。菩萨以无所受受二乘沈空之受。而能从非道通达佛道示作声闻。为众生说未闻法。如身子善吉若作支佛。大悲教化如大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。未具佛法终不灭二乘受。而通达佛道。故法华云知众乐小法而畏于大智。是故诸菩萨作声闻缘觉少欲厌生死实自净佛土</p><p>示入至因缘六明示受人间果报苦道非道通达佛道。此有八句初七示受人间报。后一总明现入诸道。前七是受四天下诸受。此诸果报皆是非道。而从空入假修如幻等四种三昧。未具佛法终不灭此诸受而取证也。后一句现遍入诸道而断其因缘者。世间诸道不出其六。此文未明修罗六欲。若受此道亦是苦道非道。而修<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>三昧及不动等六种三昧。未具佛法终不灭此果报受而取证。即能通达佛道。言断其因缘者得二十五三昧。能破二十五有即是断其因缘。复次现遍入诸道即是遍入十法界道。断其因缘者断四教菩萨因缘三道</p><p>现于至生死七明现二种涅槃非道通达佛道。上明二乘有为功德。今明二乘无为功德。皆是非道。又上但说二乘今兼三乘入二涅槃皆非佛道。除圆妙觉示现其余皆有无为缘集三道非道若应以三乘灭度而得度者。即现三乘而不断生死者。菩萨大悲处于生死。通达生死非道即是佛道岂可断也</p><p>文殊至佛道八结<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道义。菩萨若能行前七种明于非道之理具一切佛法者。即是通达佛道也</p><p>于是下二明如来种。所以净名问文殊者。上文殊问净名答非道为佛道。今净名问文殊答非种为如来种。此二大士互为宾主之仪。为欲显上所明行于非空入假。其理幽玄诸未悟者多生疑怪。今净名问如来种。欲显非道佛道令义分明。若知三道是如来种者即能通达非道是佛道也。文为五。一净名问。二文殊答。三净名重问。四文殊解释。五大迦叶称叹领解述成。初问何等为如来种者。正为成非道为道</p><p>文殊师利下二文殊答。即是以非种为种。何者上净名以非道为道。恐时众未解故问种义。今文殊答以非种为种。理趣快同显成向说之玄旨也。言如来种者大论云如<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>解。如法相说名如来种。若如十二因缘三道法相解者。即是如来种。何者离三道之外更无如来种。三种种者一正因即苦道。二了因即烦恼道。三缘因即业道。前文具明言如来者。如此因缘三道法相。而解而说故名如来。今文殊答还依如来所解而说。故说三种非种为如来种。以成净名所答三种非道为佛道也。言如来种者种既有三。如来亦三。一法佛如来.二报佛如来.三应佛如来。如法华明皆是一相一种即正因种。如智论明。诸智慧门为种即了因种。又法华明弹指散华佛种从缘起。即缘因种。种以能生为义亦种类义亦种性义。能生义者若不能生不名为种。以此三种能生三佛。从微至着终于大果。即能生义。种类义者若此三种非佛种类。此外更无同类之法。种性义者性名无改。此之三法从初至后不断不灭。必致三佛三德之果故名不改。今约众生明种不出此三。由烦恼润业受身有苦。三无前后亦非一时。不纵不横。若附性明义。以真性为正因种智慧为了因种。万善为缘因种。此多约断惑得解离生死得涅槃除恶有善。此约思议明种非今经意。若除惑得解则无了因种。如此火从薪起薪尽火灭。故二乘断结尽便无佛慧之因。故不能成一切种智失了因种。若除恶有<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>尽则不能生善岂有缘因种。故二乘无恶失缘因种。若离生死入无余灭不受生者岂有正因种。故大经云。或有佛性。阐提人有善根人无。阐提具有烦恼诸恶受生死身。即是以恶为缘因性。善人无此恶中之性故云无也。善人有者已有善法缘因也。阐提无此故云无也。二人俱有者有正因性。二人俱无者无了因性。若约识为义六识是缘因种善恶并是六识所起。离六识外则无恶无善。无缘因种七识是了因种。惑之与解皆是七识。离七识外则无惑无解。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>是正因种。无八识则无生死涅槃。<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>云。有第九识是真识。八识犹是虚妄生死种子所依。若地论师用七识断六识。智障灭八识真修方显。此须中论四句捡破。今经明不思议种以非种为种。故以身等烦恼不善皆如来种。如蜂作蜜虽采众华不以便利蜜终不成。故知便利皆是蜜种。今不思议亦尔。非但法性智慧善法是三佛如来种。只此三道是三如来蜜种。对之可知。若菩萨研修此三种理分得相应名习种性。此心增长名性种性。虚通无滞名道种性。深见分明名圣种性。三种等修名等觉性。三至妙极名妙觉性。此三种性非前非后亦非一时。不纵不横如世伊字首罗三目。就文殊答文有六段明如来种。一略约苦道。二广约烦恼道。三重广约苦道。四重略约烦恼道。五约业道。六约烦恼总结。今就前五文三义分别。初有身.六入.七识处。此三是正因如来种。次无明有爱.三毒.四倒.五盖.八邪.九恼。此六是了因如来种。后十不善是恶业即缘因如来种。若就通论一一皆是三佛如来种。然众生受身虽以业为因。若无烦恼则不得生。三种亦尔。虽有正因若无了因导缘因助显正性三佛不得生长。由慧达烦恼以导缘因。三因成就法身显现。故文殊云。烦恼泥中有佛法耳。有身为种者。身即五阴阴即法性。法性色法性受想行识即正因种也。又身为种者。能生福慧故说为种。若断五阴即断佛种。此即非种为种。菩萨以无所受而受此身。若未成就自行化他一切佛法终不灭身而取证也。即是从空入假明不思议种义。何者迷身则有六道生死种。解身则有四<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>种。故有十法界种也。若灭身者无一切种。菩萨如是观身见一切种即如来种。如人眼翳苦痛失明。若诸拙师针灸药涂虽得痛止。而眼根毁坏永不见色。无如来种。若人患眼不坏眼根若遇幻师禁咒痛愈眼根清净。此喻凡夫虽具烦恼犹有反复种义不坏。是故身为如来种也</p><p>无明至为种此四是二广约烦恼道为如来种。过去烦恼为无明现在烦恼名爱。观此二世烦恼如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>不可尽即是了因如来种。亦是三佛如来种也。贪恚痴为种者。三毒犹是过去无明现在有受。亦各出三毒。若离取我即具等分出生八万四千尘劳。若如是知故名为种。四颠倒者别门明义。迷色起净倒迷受起乐倒。迷心起常倒迷想行起我倒。能生念处正勤如意根力觉道故为种也。五盖者贪欲嗔恚睡眠掉悔疑。能生根本观练薰修诸禅三昧故为种义。既知别义于通无滞</p><p>六入为种七识处为种。三重约苦道广明正因种。六入即是约报身苦道。如鸯掘云。此之六根于诸如来常具足无减修了了分明见。亦如法华明。父母所生清净常眼等得六根清净即是六根相似相现。故华严明十种六根。因是得入如来六根。故知净是如来种义。七识处者。什师云欲界人天为一。三禅三空为六。合七识住。所以然者。三恶苦多识不乐住。第四禅识色微故。又以有<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>天故识不乐住。第四无色以非相法微故识不乐住。随识乐住即是法性</p><p>八邪至为种四重约烦恼道为种。八邪如前迦叶章明。不舍八邪而入八正即是种义。九恼者约三世违情是生嗔之缘。谓此人现世恼我恼我亲叹我怨。过未亦尔。是为九恼。若有方便是生慈缘。故得是如来种</p><p>十不善道为种五约业道明如来种。十不善则摄得五逆。因恶生善即有十善。若能生十善即生三不护三密示现三业随智慧行等如来功德。故即是种也</p><p>以要至佛种六总结成如来种。烦恼不善不出见爱。以此往收故一切不善皆在其中。皆是如来种也</p><p>曰何谓也三净名重问</p><p>答曰下四文殊答文为二。一正答二譬显。初正答言。若见无为入正位者即是断如来种。不能行于非道。以灭受取证故不能发三菩提心。所言若见无为入正位者。苦忍初心即是见谛名之为见。见谛惑尽终不更起。即是一分数缘无为即是正位。若见惑断即见烦恼如来种断。是人远至七生毕竟不受后身。则界内三道非种之种究竟永断。故不能发三菩提心入假行道。自利利人学一切法。行于非道通达佛道成三佛种</p><p>譬如下二譬说文为四。亦可通譬上明种义。亦可别譬。别譬为二。初三别譬三种后一总譬。就别譬为三。一淤泥出华譬烦恼道为了因种。次粪壤生芽譬不善业道为缘因种。次起身见譬苦道为正因种。达五阴即正因性。后入海总譬烦恼等三种能生三种法身。如下巨海则得智宝。譬如高原者。高原本合水有泥。以决去水是故无泥华不得生。明二乘人本有烦恼种。以即断故如高原无泥不得生华。此约入正位无烦恼不得发菩提心</p><p>又如至佛法二譬入正位者得道共戒。断三恶道不善业无恶业种不生佛法。问此中言粪壤之地乃能滋茂。大品云空中种树。二意明入假云何。答一往似异大意则同。此明菩萨达不善理能生佛法。恶法为种资成法身。故约粪壤以明入假。大品即是不断而断。断惑入空能从空入假。学一切佛法化度众生。如世术力能空中种树。故约空明入假。若作此解二乘已有入假之义。但其未悟不能改观。至法华中方得会入。大品会法不会其人</p><p>起于至法矣三譬入正位者若无身见则身因灭。无三恶种。不得发菩提心行菩萨道</p><p>是故至智宝四总譬二乘无烦恼等三道可入。即无一切智等佛法宝也</p><p>尔时下五明大迦叶称叹领解文为三。一正称叹领解二譬显三自鄙。所以迦叶称叹者。以文殊善说非种显不思议如来种其理幽玄故也。领解二意一领尘劳之畴为如来种。二领见无为入正位者不任发菩提心</p><p>譬如至志愿二譬显此譬。但显领入正位者不任<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。有开譬合譬如文</p><p>是故至道意三迦叶自鄙文为二。一正自鄙二所以下释自鄙意。如文</p><p>尔时下品之大段第三明法门眷属。亦是成前道及种义。何者法门无量随其义便则有亲善。即是眷属。此皆是无名相中假名分别以成假名佛道及种。复次前观众生品明观众生入空彻源。而有无缘慈悲喜舍。为显此义故天女忽。现对身子阐扬不思议真空解脱妙理。次此品明行于非道通达佛道入假自行化他。虽受诸受而无所受。能于尘劳达如来种。是故普现色身。因问眷属显成入假通达佛道种种法门皆是眷属。文为二。一问二答。初问言普现色身者即有三义。一普现内色.二普现外色.三普现内外色。一内色者若如法华明身根清净。十界依正于身中现。犹如净镜现诸色像。二外现者亦如法华普门示现随机不同现十界色。三内外现者如大集明。观己身众生身<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>悉现己身。亦见己身众生身现佛身中。众生身中亦如是皆如影现。即是色入法界海也。菩萨住此普现之身。表成上文入假之义无所不现。前后相成令义易了。故普现色身。因致问眷属。大士若是生身应有生身眷属资生。若是法身即有诸法以为眷属。何故室空不见生身眷属。亦未闻说法身眷属法门。致有斯问。眷属资生为在何所。就问为二。一问眷属二问资生。如文于是下二净名答有四十二行偈为四。初十二行正答法身眷属资生。即是自行。二从虽知无起灭去二十七行明菩萨入假权智无方大用。成前非道及种并为化他入假权用。三两行结叹自行化他。四一行斥破二乘。初文为三。初四行明眷属.次七行明资生具.三一行结自行德满。初答者。若是法身实相则无分别。何有亲疎正为入假。故约法门以明眷属。关河旧解。外国无父母宗亲眷属非为贵人。今约此解仍为理释。言无眷属是贱人者。即是二乘偏真灰断。无智度母善权父万行功德眷属。故法华以穷子为譬。若是大乘法身眷属臣佐吏民仓库众多。净名即是佛法贵人。故以偈答言有眷属也</p><p>智度即是实智。实智有能显出法身之力。如母能生。方便是权智。权智外用能有成辨如父能成。若就此经辨父母者。如观众生品彻照三谛契当真如名实智母。此品明行于非道通达佛道。遍入尘劳成就佛法即是权智父。故金刚般若云。如来善护念诸菩萨即实智母。善付属诸菩萨即权智父。菩萨从初修此二观得入中道。双照二谛是权自然流入是实。将此权实无受而受具足佛法。不证妙觉终不灭受息此权实而取证也。又行非道是权达佛道是实。因此二智遍入尘劳为如来种。譬如初生常为母护。至年长大父付家业。菩萨安住世谛。初出胎时用权实智入空入假。乃至妙觉未曾舍离权实父母。一切众导师无不由是生者。如世天地二气交合万物得生。又如和合则有托胎。借此以况。权实二智若不合者则菩萨法身智慧不生。权实若融法身则显。故言一切众导师无不由是生。约观心者观心即空为实智即假为权智非空非假即入圣胎。观道分明豁尔相应见于中道即是出胎。如是乃至未入妙觉皆名<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。故云普贤真佛子。若登妙觉即没子名但称为佛。大论云稽首智度无子佛。法喜以为妻者。如世之妻策使称怀。若菩萨通达非道之理境智相称。能生法喜称悦情怀。故有种种出假之用心慈悲。为女者指上三十二种慈为女也。慈与悲相扶故同女也。<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>诚实男者指上观三谛理。顺入实相一心能具万善。权假化物如男干事。毕竟空寂舍。舍有遮弊安身之能。毕竟空理遮二爱见。法身栖处故为舍也。弟子众尘劳即是上来三毒等分。八万四千尘劳转为八万四千三昧陀罗尼波罗蜜。若似若真皆为佛事。如转弟子以成贤圣。道品善知识。若修中道品即知中正。识二边邪得成正觉。诸度法等侣。五度及八万四千<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>法门。是福智度。是慧二种庄严两轮等故名为等侣。四摄为妓女。妓女本娱情悦虑引诸观者。四摄能顺物情引受学者故为妓女。歌咏诵法言。真乐自乐乐他。诵经说法亦自乐乐他</p><p>总持之园苑至戒品为涂香二明资生之具。总持之园苑。园持华菓遮他盗窃令不失落。陀罗尼亦尔。持善因果遮诸恶法。林树是覆荫清凉。诸无漏法无烦恼契。即清凉义。觉意即七觉。七觉调停生真智因华。故大论云无学实觉此七能到。故以为华。解脱果者即是不思议解脱妙觉果满。八解浴池八背舍八解脱如前分别。入九定证真成八解脱八背舍。修成在九定。定满如水满。八解如池。七净华者一戒二心三见四断疑五分别六行七涅槃。戒净是正语业命。心净是<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>念定。见净是<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>正思惟。断疑净是见道。分别净行净是<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。涅槃净是无学道。别圆见思例皆得称七净华也。菩萨在因皆名为华。浴此无垢人此约别圆。若藏通界内事惑垢尽名无垢人。犹有恒沙界外理垢是故须浴。界内解者。慧解脱罗汉已断分段之垢亦是无垢。更修八解除无知垢故须浴也。象马五通驰菩萨习未尽无漏尽通。又云界外正使未尽犹名五通。如意通荷负众生力大如象。余通如马。周遍十方一念即到故言驰也。大乘以为车实相为车体。二智为能乘。至萨婆若中住。调御以一心法界一相常在一行三昧。游于八正路无作八直道也。相具以严容众好饰其姿。不同<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>所明相好。法身自有实报大相小相。光显法身为严饰也。惭愧之上服佛性中道。是第一义天。菩萨见佛性未了了故。惭第一义天。诸佛是无上行人。愧此胜人名为愧人。覆不惭心名之为服。又服者忍二边恶不辱中理。是忍辱衣也。深心为华鬘。进入万行圆因即最上因。如鬘严首。七财者。一闻二信三戒四定五进六舍七惭愧。闻者十地听法。如云持雨十方佛说法一时能持故名闻也。信者深信坚固犹若金刚即圆因也。戒者十地所得真戒。经言唯佛一人具净戒。余人皆名污戒者。定者即首楞严等定也。进者念念流入萨婆若海。舍者常行舍行。惭愧者如前说。如所说<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者。言行相应所行如所说能到彼岸。教授以滋息。说法利人普润一切。化功归己即是滋息。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>为大利。回因善向果。得<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a><a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>故云大利。四禅为床座。如床离于下湿避诸虫螫。世间四禅离欲爱法觉观毒虫。从净命心修则有支林功德。邪命心修则堕鬼道。菩萨出世四禅一切皆摄。功德<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>无不悉备。休息诸行能离二死烦恼毒虫。若邪命修则堕二地。净命修之则契中道。寂灭安乐故言四禅为床座也。多闻增智慧以为自觉音。外国用音乐<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>于王。今多闻智慧觉悟心王。自觉觉他也。<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>法之食。用真修之智契实相甘露名为法食。大经云汝诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>未得大乘法食。解脱味为浆。脱是定名。定即是水水即浆也。净心以澡浴观理忏悔。即心水澄清浴除罪垢之烦恼也。戒品为涂香作无作善资薰法身</p><p>摧灭烦恼贼一行三结。自行因成则摧灭烦恼。见真界内贼灭。见中界外贼灭。勇健无能逾。住首楞严健相三昧。降伏四种魔者。具如前叹菩萨已明。胜幡建道场。若众生翻邪归正道机纯熟。菩萨即坐道场因圆果满。若观心者举足下足无非道场来具足一切佛法</p><p>虽知无起灭下次二十七行明通相入假权智无方。亦是住平等法界赴缘利物。文为三。初两行入假<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诸佛。二一行入假净佛国土。三二十四行明入假成就众生。初两<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>虽知无起灭。入但空无生不可得空无生。而能权巧出假。普示界内外生死众生供养诸佛</p><p>虽知诸佛国一行二明通相入假净佛国土。如前佛国品释也</p><p>此下二十四行明通相入假权智成就众生。文为五。一入假觉悟众生。二入假教用世法。三入假拔物灾难。四入假济恶道苦。五入假同事利物</p><p>初诸有众生类下五行正明成就众生入假权巧觉悟群生。如文可解。经书禁咒术下二行二明入假以智法教示众生而不堕邪见</p><p>或现日月天下五行三明入假拔众生灾难。或现诸天及作地水者。以假权变作胜正报及以依报。<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>能救三灾之难。三灾如文</p><p>一切国土中下二行四明入假拔地狱畜生之苦。亦应拔饿鬼苦。文略义兼。示受于五欲下十五行五明入假同事利物。皆为引入佛道善权方便。称机无爽</p><p>如是道无量下二行三叹结。入假权巧缘起之用。自行利物非可具说</p><p>谁闻如是法下一行四结斥二乘凡夫。肖似也类也善也。菩萨是佛子似佛。是佛种类善顺<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。若闻此说能即发心。二乘无大根性则不似。非佛非佛种类不顺佛心。闻此不思议解脱入假权巧。不能发无上道心故云除彼不肖人也。痴冥无智者是底下凡夫无大乘善根人也</p></div>"
},{
    "title": "维摩经略疏 第十卷",
    "author": "智顗",
    "html": "<div class=\"B1_text\"><p>维摩经略疏 第十卷</p><p>方便品二</p><p>其以方便下至入室竟有八品半文。大段第二净名方便托疾兴教助佛扬化。令入不思议<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。除物罪垢引入四土成净佛国之行。托疾有四意。一为化国王及臣民等。二为发起<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>品。三为发起菩萨品。四为发起问疾品。初意者以托疾故国王长者皆来慰问。因以身疾寄言斥彼。诫劝为便。若厌乐心生能断缘集<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>万行。是为入不思议解脱之哢胤。生同居有余<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之因成也。二为发起弟子品者。若不现疾无由顾命弟子参问。若其不命岂敢辄述昔日所呵。普令二乘同闻往昔滞小被呵。有乐小执小之徒。闻此心折慕仰大乘。近为入室闻不思议成生苏之由籍。远为大品法华成熟苏醍醐哢胤。亦是生<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>土之良缘。三为发起菩萨品者。若不托疾菩萨为由被命。岂得各述往昔被呵。普令三教菩萨折其方便之滞。同折圆顿之道成入不思议解脱净佛土之胜因。四为发起问疾品者。若不托疾何由得命文殊入室论道开发物心。令诸弟子声振大千进诸菩萨<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>之行。入不思议解脱之道成净佛土之因。此之四意皆由托疾。疾非实有故言方便。方便之力寄在<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。此正属声益</p><p>今明净名诧疾兴教意乃有四经文。大判总为二段。一从此下说菩萨品有两品半。是室外说法明弹呵折伏。二从问疾品去有六品。是室内说法明引接摄受以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>令<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>久住。即是住不思议解脱也折中具摄。摄中亦尔。但义有傍正。今就室外折伏文为三。一此半品明折伏界内有为缘集。二弟子品即是折伏无为缘集。三菩萨品即是折伏自体法界缘集。问无为与自体为同为异。答诸说不同今言名别体同。二乘迷自体起无为着。着已无为故受无为之名。菩萨亦迷自体起无为集而菩萨观破无为。但无为未尽此惑附体故别受自体之名。如凡夫迷真起有为缘集。学人断见思惟未尽。犹于真理有色无色染之名。问学人有为未尽虽得见真犹有其惑。不约真名自体。菩萨无为未尽亦得见真。何以别受自体之名。答二乘见真但是空理空非法身故不得立自体之名菩萨见真真是法身。法身常在故得别立自体之名。菩萨缘惑未尽故须折伏。此半品为四。一方便现疾.二诸人参问.三因为说法.四时众得益。初文者以无疾现疾此表法身无二缘集<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>患累。为欲引物方便现有凡夫二乘二种缘集及菩萨自体因果之患。问何得知然。答下文云菩萨疾者从大悲起。以<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>疾故我亦有疾。若众生得无疾者则我无疾。问净名迹居人道可同凡夫而有事疾。内同菩萨有自体疾。既非二乘何得同其有无为疾。答净名住不思议应以二乘身而得度者。即皆现之而同其疾。复次现通教菩萨之疾与二乘同现疾义(云云)。至问疾品当具分别</p><p>以其至问疾二明问疾。净名为物所尊具如前叹。斯之大众莫不蒙恩。今既有疾岂容不问。故诸王臣民皆来问疾。而但诸来者皆是净名现世知识。过去曾结四教之缘机动致感藉问疾为缘故来问疾</p><p>其往者下三因为说法。若不现疾无由弹诸豪族。设来亦<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>呵斥。然约他身说过为难。我既有疾彼岂得无。故因己疾广为说之令生厌离劝求<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>。文为三。一总标说法.二正说观门.三劝求佛身。初文可知。次二种说法者是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>大意。即是诫令断恶劝令生善。因此得成净土之业。又若但劝厌离断恶而不劝求佛身。即怖畏<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>堕于二地。若堕二地此经及大品并成根败之士。若依法华<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>即于佛道纡回。今此观门多在藏通。何者芭蕉等譬在藏幻梦等譬是通</p><p>诸仁者下二正说观门。有师作五门解。有师用五非常释。今用二门明义略出五种。一约见思两道。何以得知。初明苦下四行是约见道。次明不净观是约<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。故大论释十想云。前三见道中四修道后三无学。今劝求<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>不须后三。二约二种念处。苦下四行即性念处。说不净观即共念处。三约二行。苦下四行即慧行。若云不净即是行行。四约二观。苦下四行即是实观。若说不净即得解观。五约正助。苦下四行即是正道。说不净等即是助道。如是等种种二门广为诸人示教利喜。今约此等二门说法者意乃多途。略出五修。一为令闻法之徒厌离修观求无上道。若缘集未断生染净土。二界内若断即生有余。三若依佛慧如螺髻所见。故普贤观明<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>力。故罪障渐除即于此身见净妙国。四若证真无生即生果报。五若住不思议解脱即能成就众生净佛国土。众生缘熟坐道场时随所化生而取佛土。托疾说此二种观门等行利益众生。略知大意。今就见道苦下四行。初说<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>即有三事。是身无常者。揽三事有身。身但假名。三事无常故说是身无常。无别身也。如大集云。歌罗逻时即有三事。一命二暖三识。出入息者名为<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。不臭不烂目之为暖。此中心意谓之为识。揽此三事名歌罗逻。三事生灭相续不断乃至衰老皆是业持。凡夫不了起诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>造种种业。不觉息断三事分离。一生空过悔无所及。今净名说为无常破彼常倒。何者三事成身息出不反。身如瓦砾命宁可保。暖气持身为常存者。火从缘生缘散火灭身便臭烂。岂得常存。业系妄识谓我常存。业绳忽断心即托生。当知三事皆悉无常。若能如是悟粗无常即能舍粗缘事。观细无常。若心在定见无常理即入见道名须陀洹。若毗昙有门见细无常理即是见道。若成实空门因细无常入空方是见道。今约有门善修无常能破身边即入见道。谓有无等六十二见及一切见知皆无常。即能见理断见惑也。深观无常何止断见亦能断思。故佛言善修无常想能断色无色染也。无强者为成无常。故假名之身依于三事。三事若强生灭莫之能迁。若有为生灭迁变。当知三法体羸无强。无力者亦助成无常。若假名身三法有力即能拒抗。由有为生灭转变不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故当知无力。无坚者三法之体皆无定性。若是有者即如金刚。岂为生灭之所破坏。以假名三法不自在故为生灭所破。当知无坚。如诸罗汉欲结集法藏前说偈云。无常金刚来破圣主山王。速朽之法者假名三法转变体羸。生灭迅急。当知此身是速朽之法。不可信也结句破执。此身三事若有常有强有力坚固不朽则可计常。若其业尽不与人期。是则出息不保入息前念不保后念。现见世人俄顷便往无<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>者。云何计常。信此妄情自宽造恶而不修道</p><p>为苦至不怙此约苦门说法。为苦者无常故苦。何者三事成身无常所切。又为三苦四苦八苦所苦。苦之甚也。为恼者三事假身常为九恼及诸苦境之所逼恼。是则内苦为苦外苦为恼。复次初苦为苦重逼为恼。众病所集者三事假身息暖是色。色法四大四百四病聚在此身。心有四分烦恼之病生八万四千。此色心病聚在假身。故言众病所集。复次为苦者行苦也。无常行苦无奢促无轻重。故言为苦。为恼者坏苦也。违缘坏乐故言为恼。众病者苦苦也。身是四苦重加众病故云苦苦。问通苦有四别苦亦四。别苦苦于通苦。是则四种皆是苦苦。何故别说病为苦苦。答生苦已过死苦未至老苦微薄。故约病苦说为苦苦。又解净名托疾故但约病为苦苦也。明智者所不怙。结成苦义审谛观察。了了见苦无暂乐时是名智者。若三事假身常为三苦所苦。无一乐者何可恃怙。故瑞应云<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>常以身为患。而愚者保之至死无厌</p><p>是身至不住此十为空行作譬。今有二释。初总别解二通相释总。别解者初五别譬<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。次五总譬五阴。何以知然。经论诚文云。观色如聚沫观受如泡观想如炎观行如芭蕉观识如幻。下五既无文别对。当知总以譬于身空。问别譬五阴定属何教。若<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>不应炎幻为譬。若通教不应沫泡芭蕉为譬。答方等四教杂譬非疑。大论云。声闻经中或为利人说如幻等譬。从多为论各有宗徒。大品有时牒前二教说五阴。六譬十譬通譬五阴乃至一切种智。问十譬总别皆譬五阴空者。前后何以不对五阴成假名身俱约三事。答此亦何在。佛或时说二法成身所谓名色。或说三法如今所用。或说五法即是五阴。或说六法即是六入。并出经论。离合<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>赴机得宜于理无失。今用三事者于观门为便。次通相释此十譬皆譬身空。余经虽以前五譬譬于五阴。此经十譬皆云是身。不别以五而譬五阴故不同前。今通明此十多譬身空亦譬法空。就此十譬五是三藏五是通教。此品是约藏通观门故也。三藏五者谓沫泡芭蕉云电。通教五者即炎幻梦影响也。问何以知然。答大论有文。前已具明。问沫等与炎等何别。答沫等有此色质。但是虚假分折易空。以人不知色身空故用此为譬。炎等似有实无体质。以此无质譬于粗细有质之色。知诸法皆空。问诸法皆空何得以空譬空。答大论云以易解空譬难解空。故约六喻十喻譬法空也。问沫等通为三乘作譬何以非大。炎等亦为三乘何以独称通教譬也。答炎等非但为通三乘亦为别圆。故是衍经之所用也。摄大乘云。依阿梨耶说如幻等八譬。聚沫不尔岂得为类。今释十譬譬生法两空。若三藏教多譬人空少譬法空。但两教杂说不分部者。正是随机故也</p><p>是身如聚沫不可撮磨者。水流冲击因成聚沫。一往似有撮之即无。此身亦尔。无明行识流托他阴。迷者谓有智者观之不见定实。如撮沫无沫但有水也。此譬人空意显。法空未明。如泡者上水渧下水。上水为因下水为缘得有泡起。斯须即无或因触灭。一往异水。如实知之离水无也。身亦如是。往业为因父母为缘即有身泡。渐渐增长缘尽便终或他害死。无智谓有。若审观之三事身空无别身也。如炎者日光风动旷野起炎。起炎相续愚者水想审谛求之炎水俱无。此身亦尔。心智光业风动揽他三事。相续不断染爱不了计以为身。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>了达非但身空三事叵得故言如炎。是则可譬生法二空。不同三藏聚沫等譬。如芭蕉至坚者。芭蕉从生皮叶相裹竟无真实。此身亦尔。歌罗逻来三事假身。皮肉骨髓各有九十九重。一一捡之虚假叵得。如出入息相续百千。一一息中身不可得。<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a><a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>次第生灭。一一刹那身不可得。离此三事无别有身。故知身相内外俱空犹如芭蕉。是身如幻从颠倒起。犹如幻作兔马外人见之皆谓是实。无明幻师诸行幻法幻作三事。见身取相谓为定实。若知无明不起诸行幻法及以三事如幻空也。是身如梦为虚妄见者。眠法覆心身卧于此。见身游彼言彼有实。觉方知梦。无明覆心为卧妄起诸行。托胎三事乃至老死如梦见身无所不至。观心<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>即知虚妄身及三事空无所有故如梦也。是身如影从业缘现者。有物遮光则有影现。物异影异物动影动。无明行业遮理智光则有三事报身影现。业异报异从生至死流动非一。若知无明行业本无所有报身三事皆毕竟空。犹如影也。是身如响属诸因缘者。响因两物相击出声空谷响应。身亦如是。无明内动如物相击。业行如声母腹三事如空谷应。三事和合成假名身。属诸因缘者无明行为因母腹空谷为缘。因缘所生无自他等故说无生。生即如响。复次如唇舌齿齶咽喉。报风触身七处故有声出。声属众缘亦不可得。身亦如是故如响也。问摄大乘明八譬各有所譬今经五譬那并譬身。答今明通别同异意正在此。若通圆二教五譬六譬八譬十譬皆可通譬。如大品所明色乃至一切种智皆如幻化。此经亦通八譬别者即别教意。如以<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>对四<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>破四种人。圆义往核皆不可解。是身如浮云须臾变灭者。云从龙出亦阴阳气变为异色。远望谓有近者则无。无明行龙父母气合起假名身。从生至老种种所作。愚者远望则有身相智者近观身不可得。须臾变灭者即三藏折无常入空。是身如电念念不住者。电义未详。但无明行三事身光念念无常如电疾灭。此譬无常意转明矣。是身至所转八番明<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。约六种法捡破我等十六知见。前五番四大种。次一番约空种。二番约识种。问无我与空何殊。答四句不定。一众生名空阴名无我。即是内离人故空。法不自在故无我。二阴名空众生名无我。阴但是法故名为空。众生是人故名无我。三俱名空犹如二空。四俱名无我如三无我。今经前明空门多是二空。今明无我约法无我。问上明空行就二教入空。今无我行亦为二不。答文虽是一亦得两释。何者如言无主为如地。若分别破地得无主。三藏无我。若体法性我性皆如。我及诸法毕竟无有即通教无我。初五番为二。一别捡。二总捡。别捡为四</p><p>是身无主为如地。今例作两释。一破外人。二约<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>。破外人者外云。若无神我何能担负。内曰地能负山可有神我。次内观者毗昙明众生是假名。地是实法。成论明地是假名四微是实。今明虽假实之异同是苦下无我观摄。如地四微。一微是主三亦是主。若一非主三亦皆非。当知无主。外地既无。内地四微所成皆亦无主。若内外无主三事之身何得有我。故云是身无主为如地。又请观音云。地无坚性地。若有者为自他性共无因性。四中随计即是有见。若谓是事实余<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>者实即坚义是性是主。若捡不得当知是无乃至非有非无。若于此四句有所计执即是性实。<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>云。若心取相若取非相皆着我人。不取四句即是观也。无主无我故云是身无主为如地。是身无我为如火者。外云有神我云何知耶。身能驰走及出音声。故知有我。内曰约火一法破其两计。何者火烧野草亦能东西。烧竹木时亦能出声。亦有我耶。内观者火二微成无有定性。名色成身亦无定性。若无定性即是无我。复次身中暖即是火。若外火无我内火亦无。请观音云火从缘。生缘无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>即是无我。破性四句类地可知。是身无寿为如风者。外云有寿云何知耶。若无寿者岂息相续。内曰出入息者但是风相。外风无寿内风亦无。次内观者风相触击故轻虚自在游中无碍。有何寿命。大集云出入息者名为寿命。观此出入入无积聚出无分散。来无迳游去无履涉。如空中风求不可得。风既非寿其息亦非。请观音云风性无碍。四句观风例前可知。是身无人为如水者。外云有神故有人。云何知耶。若身无神何能润下曲随物情。内曰水能下润。但随器方圆。若水无人无神者汝亦如是。次内观者水三微成无有定性。无性即无水。三事成身无有定性。无性即无人。故云是身无人为如水。如水中见影谓言有人。入水求人终不可得。三事身见谓身是人。深观三事不见身相即无人也。请观音云水性不住但池沼方圆碍之。即住非性住也。人亦如是。随法得名。人无定性。四句捡水例地可知。是身不实四大为家者。此总约四大说无我行。外云若无我者现见六情依身而住。故知有我。内曰现见六情依四大住。无我可依。若内观者身名是一一身不应在四处住。若一大我住三应无身。若各有者即有四身。若即若离四句捡身皆不可得。故知无实。若不得身即身见破。身见破即我见十六知见皆破。是身为空离我我所者。二约空种破我。外云若无神我何得实有国土人物。所若是实当知我实。内曰若尔所既是空我亦应空。如身中空种及以外空。外空是所。所空故我空。约内观者正约空种破见。四大造色围<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>故假名为身。离空无身。若内外空。空不可得即身见破。身见破即离我我所。是身无知如草木瓦砾者。三约识种破我。外云若身中无我焉知四时。内曰如草木瓦砾亦由阴阳逐时转变。似有所知而非神知。今身虽有知知无自性。如草木瓦砾。又计身内有神神使知知。内曰若神使知知复谁使。神遂无使。何须神使。若无神使即无知者。若无知者如草木瓦砾。约内观者约观识种。何者三事成身命暖无知。知只是识。若谓识知过去识灭。灭故不知。现识不住亦不能知。未来未有岂得有知。三世求识知不可得。若离三世无别有知。故云是身无知如草木瓦砾。是身无作风力所转者。此约风动助成破识。外云身内有我故执作动转。内曰此非神作风力转也。约内观者。<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>心动身内依风得有所作。故大集云。有风能上有风能下。心若念上随心牵起。心若念下随心牵下。运转所作皆风随心作一切事。若风道不通手脚不遂。心虽有念举动无从。譬如机关种种所作。其绳若断更无所为。当知皆是依风所作。今观依风非自他等生即是空也。今观三事成身终不可得。谁是作也</p><p>是身不净下二说不净观破欲界思惟。若接前说即是修道共念处得解观行行助道。故此不定更向前明即是见道方便。今既见道后说故约修道。菩萨若入见道欲进修不净破爱。对治诸禅先用此四破欲界结。若断六品即斯陀含。若智若断是菩萨无生。若九品尽即阿那含智断。是菩萨无生。今不净观约对四想者。一往经文有此意也。言四想者一身不净想.二食不净想.三世间不可乐想.四死想。初是身不净即身不净想。次虽假以衣食即食不净想。次是身为灾即世间不可乐想。次是身无定即死想。次毒蛇等譬总譬四想。想次约此作四苦者。是身不净乃至假以衣食即是生苦。次云百一病恼即是病苦。次云丘井即是老苦。次云为要当死即是死苦。次毒蛇等亦是总譬四苦。但四苦有二。若言即生即老即病即死。是为约理此属慧行。具如前解。约事四苦即是行行今是事四苦是身不净秽恶充满者即五种不净若因随息见此不净即是特胜。因观息见即是通明。因假想见即九想背舍等。言生苦者五种不净。除于究竟余皆生苦。是身至磨灭是食不净想。以食入腹便成粪秽及诸毛孔恒流不净。虽复澡浴垢秽续生。虽好食严饰须臾臭弊。身及衣服必归磨灭。食体不净唾合如吐。乃至三十六物皆从食起。此想破贪食也。言生苦者生则有之</p><p>是身至所逼即老病二苦。是众生五阴世间有此苦法。故属世间不可乐想。只以正报不可乐故依报国土皆不可乐。种种病苦从身而起。当知身是灾祸处。百一病恼者。一大不调百一病动。四大不调四百四病因身而发。是诸病苦皆恼于身。即是灾患。四苦分文即事病苦。是身如丘井为老所逼。四想犹属众生五阴为老所逼故不可乐。若依四苦正是老苦也。什师云丘井者朽井也。不任受用</p><p>是身无定为要当死。即是死想四苦即死苦也。三事成身业力所持。因缘假合缘散身灭。或他害死山海空市无得免者。故言为要当死。如佛问<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。汝云何修于死想。有比丘言不保七日。有云六日乃至一日半日。佛言皆是<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>修死想者。有言出息不保入息佛言善哉善哉是真修死想者。若能如是不久当得解脱涅槃</p><p>是身至合成次总譬四想。身如毒蛇空聚怨贼之可畏也。即四想转明。若约四苦即总譬。此身有此四苦如毒蛇贼等无有乐想。大经具出今经略标。云毒蛇者如四大毒蛇盛之一箧各相违反。四大亦尔。又如毒蛇人虽养育嗔即螯人。不识恩养。身之四大亦复如是。<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>养育宜应报恩。一大若违侵伤人善使堕<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>难可出期。如怨贼者以取人财物伤人身命。五阴亦尔。在于身内劫人善财断人慧命。如空聚者空聚无物不生人爱。观六根空无神我味不应生染。又如空聚无有居民。但有鬼魅聚集其中。观六根聚落非但无我而有烦恼鬼魅聚集其中。阴者五阴界者十八界入者十二入。阴界诸入体本无实。何得有我。观阴等理即是慧行。广观其事起种种行</p><p>诸仁者下三劝求佛身文为三。一标章二正劝三结劝。初标章者凡夫爱身沉沦<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。上既广说观门呵责。厌离则求二乘断灭佛种。故劝云当乐佛身。问今此劝求何教佛身。答难可定判。或是方便两教或是<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>佛身。何故知尔。果本酬因。既说方便还劝求住有余佛果。或是劝求常住果者。诸人既厌身是无常苦聚。应劝求于常乐涅槃。岂可劝求树王灰断。故下文云。如来身者从真实生。问劝求常果何以说方便门。答如大经佛答梵志问云。汝法因常果是无常。何以我法不得因是无常果是常耶。但豪族士庶等既是具缚。若不先因方便观门断惑入空何能入假。游戏<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。亦不能空假一心开佛知见。故法华云是诸众生未免生老病死。何由能解佛之智慧。问定用何判。答方等大乘一音演说何妨通劝。随机所感不可定判。又约诸味所感不同。今方等四因。得二种果比说可知。故今所劝或是酬前两观举两佛之果。或一音异解随其根性望果修因。问何以佛有四种涅槃但二。答佛约用智不同。涅槃但约断德。如云巧拙两度病瘥是一。更开涅槃。非是不得教无的文</p><p>所以者何下二正劝。但法身有四。三藏以五分为法身。有时亦指偏空真理。如杂阿含禅经云。若障重障禅当<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>法身。法身者空也。如佛从忉利下。<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>折折欲前见佛。善吉端坐石室见空。佛告莲华色。须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>见空是见我法身。通教正以真智与法性理合为法身也。有时但指偏真空理。如大品云汝当观空空法是佛。空无来去故也。别教正以中道为佛法身。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>智慧为报身。法报合故即有应身。圆教但以不断显法身为异</p><p>从无量功德智慧生者。此正劝慕果行因。藏通福智之因感福智之果。果中福智即是法身。故言从无量功德智慧生。别圆福智显出<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。即以所显为生。但功德智慧皆是慧行及以行行。菩萨<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>为求法身从此二法修于二行。二行<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>法身显现</p><p>从<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>解脱解脱知见生者。三藏作无作戒为戒身。根本净禅观练薰修为定身。观生灭<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>乃至道场见四谛尽名为慧身。正习俱尽名解脱身。了了知见正习已尽戒定慧满。不受后有名解脱知见身。通教五分戒如前说。罪不罪不可得故名为戒身。定如前说。不乱不昧名为定身。观无生四谛从八人见真。乃至佛地见真。圆极名慧身。从初<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>解脱见惑转入上地。乃至坐道场时一念相应慧习气都尽。住有余涅槃名解脱身。了了不见缚之与脱。而能种智佛眼自见住有余无子缚。入无余无果缚。亦见众生本无缚脱。而见解脱名解脱知见身。别教以九种戒为戒身。九种禅为定身。九种智为慧身。此出地持。界外习尽为解脱身。种智佛眼了了知见法身显现。亦知见他法身隐显。次位不乱名解脱知见身。圆教一往与别无殊。欲分别者不断凡夫阴身而能成就法身。即是不思议。五分法身事等须弥不碍芥子。欲知修因者闻前二行。厌离世间恶心不起善任运生名修戒身。专修行行<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>名为定身。专<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>行缘理名为慧身。正助既合随分伏断名解脱身。分别六即而不叨滥名解脱知见身。用此五身生佛身也</p><p>从慈悲喜舍生。藏通用生无生四谛修法缘四无量心。生佛果法身大慈悲也。别教用无量四谛修法缘无缘四无量心。圆教用无作四谛唯修无缘四无量心。并<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>果法法身无缘大慈悲也。若初心修学还从慧行。慧行入空缘众生令得乐离苦。庆喜忘怀即是。修四无量心能生法身大慈悲也</p><p>从<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>至波罗蜜生。四教<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>如前说。故四教六度生四佛果满足之身。义显冷然。所言诸者或开六为七为十为百或开八万四千乃至不可说不可说。故言诸波罗蜜生。欲知初心修六度者。行行事善是修五度。慧行即修<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a></p><p>从方便至三明生。四教各有三种方便如前说。从因方便生果地法身方便。故言从方便生。从六通生者。三藏五通从行行根本净禅观练薰修修得。无漏通从生灭四谛慧行修得。菩萨因中成就五通。约生灭四谛慧修无漏通。三十四心满足即具果地法身六通。故言从六通生。通教五通六通。五通一往同三藏。修无漏通约无生四谛。在菩萨心中或五或六。断正使故六。习未尽故五。今用因六得果地六故言从六通生别圆者。别约界外三土修六通成果。初地分得法身六通但以断不断分别别圆之殊耳。三明者藏通皆约三通见三世事分明以为三明。通明异者一往见远事名通见根本为明。菩萨因中用行行修两明。慧行修无漏明<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>得佛地法身三明。故言从三明生。别圆者并通达界外三世之法为三明也。下文云三明与无明等。即是不思议圆教之三明也</p><p>从三十七道品生从<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>生。四教道品如前说。四教各<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>菩提果名为法身故也。道品悉属当教慧行。止观生者止观即是定慧因也。缘理是慧行缘事是行行。四教各修事理止观之因。证佛法身定慧之果。故言从止观生</p><p>从十力至不共法生。三法是果上功德。内智所照名之为力。外用无怯名为<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。佛地所有十八之法不与下地法而共故名不共。此三皆据佛地功德。今言从此三法生者。当是四教因中用此二行修此三法。故云从生。别圆约界外可知</p><p>从断一切不善法集一切善法生。四教菩萨各用慧行断见思。行行断无知名断不善。慧行集缘理善法。行行集缘事善性。感四法身诸恶永断众善普会。但别圆两教界外若断若集。分别不同</p><p>从真实生从不放逸生。藏通观生无生。入偏真理名为真实。别圆观无量无作。入中道佛性名为真实。四教菩萨观真若极。证四佛果故言从真实生。不放逸生者若四菩萨慧行观真缘事即退。名为放逸。若用慧行缘理心心相续不舍大悲名大放逸。不放逸者跋致相也。心心寂灭自然流入故言从不放逸生</p><p>从如是无量清净法生如来身。此是举广类劝。但净名以此而为劝端。法门无量悉须约前而修集之。故云从如是无量清净法生。此诸功德皆生如来身也。一音演说随类各解。则四教所明。因果行类用四悉檀。赴机利物普得受行获其利也。其寻学者。若能谛取前之五番二种说法。劝慕果行因则此经不空来也。诸仁者至三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>三结劝。既知佛身功德如此由诸胜因。若欲慕果行因何止自利。大士托疾助佛兴教正为利物。诸仁若能慕果行因。亦应同佛及以净名。为断一切众生病也。众生病者如前所明。凡夫及六度菩萨二乘通教菩萨皆有有为无为因果之病。别圆菩萨自体因果之病。故今四教各随所解。应为断除求无上道。则结成化他之意也</p><p>如是至菩提心四明时众得益。净名随机约诫劝二门。用四悉檀赴四根缘。所说无差故言如应说法。令无数人皆发心者。即发四种菩提心也。随其四缘各有道心开发。即是普得受行获其利。斯则神力不共法。四教发菩提心具如四教玄义</p></div>"
}]