[{
    "title": "金刚三昧经论 第1730部",
    "author": "元晓大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>金刚<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>经论 卷上</p><p>新罗国<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>元晓述</p><p>此经略开四门分别。初述大意。次辨经宗。三释题名。四消文义</p><p>第一述大意者。夫一心之源离有无而独净。三空之海融真俗而湛然。湛然融二而不一。独净离边而非中。非中而离边。故不有之法不即住无。不无之相不即住有。不一而融二。故非真之事未始为俗。非俗之理未始为真也。融二而不一。故真俗之性无所不立。染净之相莫不备焉。离边而非中。故有无之法无所不作。是非之义莫不周焉。尔乃无破而无不破。无立而无不立。可谓无理之至理。不然之大然矣。是谓斯经之大意也。良由不然之大然。故能说之语妙契环中。无理之至理。故所诠之宗超出方外。无所不破故名金刚三昧。无所不立故名摄大乘经。一切义宗无出是二。是故亦名无量义宗。且举一目以题其首。故言金刚三昧经也</p><p>第二辨经宗者。此经宗要有开有合。合而言之。一味观行为要。开而说之。十重法门为宗。言观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。观是横论。通于境智。行是竖望亘其<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。果谓五法<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。因谓六行备足。智即本始两觉。境即真俗双泯。双泯而不灭两觉而无生。无生之行冥会<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。无相之法顺成本利。利既是本利而无得故不动实际。际既是实际而离性故真际亦空。诸佛如来于焉而藏。一切菩萨于中随入。如是名为入如来藏。是为六品之大意也。于此观门。从初信解乃至等觉。立为六行。六行满时。九识转显显无垢识为净法界。转余<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>而成四智。五法既圆三身斯备。如是因果不离境智。境智无二。唯是一味。如是一味观行以为此经宗也。所以大乘<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>无所不摄。无量义宗莫不入之。名不虚称斯之谓欤。合论一观略述如之。开说十门为其宗者。谓从一门增至十门。一门云何。一心中一念动。顺一实。修一行。入一乘。住一道。用一觉。觉一味。二门云何。不住二岸以遣二众。不着二我以离二边。通达二空不堕二乘。俱融二谛不违二入。三门者。自归三佛而受三戒。顺三大谛得三<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。等觉三地。妙觉三身。入三空聚。灭三有心。四门者。修四正勤。入四神足。四大缘力。四仪常利。超出四禅。远离四谤。四弘地中四智流出。五门者。于<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>生具五十恶故植五根而养五力。涉五空海跋五等位。得五净法。度五道生。如是等也。云何六七八九等门。具修<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>永除六入。行七觉分灭七义科。八识海澄。九识流净。始从十信乃至十地。百行备足。万德圆满。如是诸门为是经宗。皆在经文。文处当说。然此后九门皆入一门。一门有九。不出一观。所以开不增一。合不减十。不增不减为其宗要也</p><p>第三释题目者。此经之目有其三种。一名摄大乘经。二名金刚三昧。三名无量义宗。初后二名次门当释。今且先释中间一目。唯此一名在首题故。于中有二。先释金刚。后释三昧。初中亦二。先释后简。言金刚者。寄喻之称坚实为体穿破为功。金刚三昧当知亦尔。实际为体破穿为能。实际为体者证理穷源故。如下文言证法真实定故。破穿为能者有其二义。一破诸疑二穿诸定。破诸疑者起说断疑故。如下文言决定断疑悔故。穿诸定者。此定能令诸余三昧皆得有用。如穿宝珠。得有用故。如大品经言。云何名金刚三昧。住此三昧能破诸三昧。彼论释云。金刚三昧者譬如金刚无物不陷。此三昧亦如是。于诸法中无不通达。令诸三昧皆得有用。如砗磲码瑙琉璃唯金刚能穿入。案云。经言破诸三昧者破之言穿。论中穿入释经破故达诸三昧皆无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。令彼三昧皆离自着。由是无碍得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。释名如是。次简别者。于中有二。先简定慧。问金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>金刚三昧皆名金刚。有何差别。解云。彼慧此定是为差别。又金刚般若通于因果。金刚三昧位在果地。又般若金刚具有三义。体坚用利形状宽狭。三昧金刚但取坚利。如是差别。次别余定。此有三类。一金刚三昧。二金刚轮三昧。三如金刚三昧。大品经言。云何金刚轮三昧。住是三昧能持诸三昧分。云何如金刚三昧。住是三昧能贯达诸法亦不见达。彼论释言。问曰。三种三昧何以皆言金刚。答曰。初言金刚。中言金刚轮。后言如金刚。如金刚三昧。佛言。能贯穿诸法亦不见是穿。金刚三昧能通达诸三昧。金刚轮三昧能持诸三昧轮。是皆佛自说义。论者言。如金刚三昧者。能破一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>结使无有遗余。譬如释提桓因手执金刚破阿修罗军。即是学人末后之心。从是心次第得三种<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。声闻辟支佛佛无上菩提。金刚三昧者能破一切诸法入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>更不受有。譬如真金刚能破诸山令灭尽无余。金刚轮者。能破一切诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>无遮无碍。案云。此中破诸佛法者。犹如转轮圣王轮宝能破诸王无不伏故。是故与前二金刚别。前二金刚云何别者。有五差别。一者喻别。谓如金刚破军金刚破山故。二者法别。前破烦恼后破诸法故。三者位别。前在学位后在无学故。四者名别。前名如金刚三昧。余处名金刚喻定。后者直名金刚三昧。除如及喻。所以然者为显因果二定异故。因有功用果无功用。损之又损之以至无为故。又如金刚取其少分相似之义。但破烦恼不破余法故。言金刚者。显其全同金刚之利。一切色物无不贯破。三昧之用当知亦尔。一切诸法亦无不破故。五者教别。谓有学位金刚三昧。则金刚三昧本性清净不增不减。经中所说其无学位金刚三昧。今此经中所说是也。今此经中佛所入定破一切法皆无所得。是故名为金刚三昧。六种释中是持业释。取譬名者是邻近释。即以是名目此经者是依主释。定为主故。次第二释三昧名者于中有二。先释后简。古师说言。彼名三昧此云正思。今述此说当文义故。谓在定时于所缘境审正思察故名正思。如瑜伽言三摩地者。谓于所缘审正观察心一境性故</p><p>问。定应是静静住一境。云何乃言审正思察。思察之用应是寻伺。云何说定为思察耶</p><p>答。若守一境即为定者。惛沉住境应即是定。若正思察是寻伺者。邪慧推求应非寻伺。当知思察有其二种。若通邪正意言分别名思察者。即是寻伺直是分别。若唯审正明了缘境名正思察。正是定用而非寻伺。定通分别及无分别故。以审正简彼寻伺。又住一境亦有二种。若住一境。惛迷闇昧不能审察即是惛沈。若住一境不沈不浮审正思察是名为定。故以思察别彼惛沈。是故当知不以住移简别定散差别之相。何以故。捷疾之辩虽速移转而有定故。迟钝之念虽久住境而是散故。今此金刚三昧名为正思察者。无正不正。亡思非思。但为别于分别邪念。又不同于<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无思。所以强号为正思耳。三昧之名。略释如是。次简别者于中有二。先别诸名后简通局。定名不同略有八种。一名三摩呬多此云等引。远离惛沉掉举之偏故名为等。引发<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>等诸<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故名为引。又此等引无悔<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>安乐所引故名等引。由此不同欲界定故。二名三摩地此云等持。等义同前。能制持心令不驰散故名等持。又定慧平等令不相离故名等持。旧云三摩提亦即等持。三名三摩钵提此云等至。等持之中能至胜位故名等至。四名驮演那此云静虑。寂静思虑故。又能静散虑故。旧云禅那。或云持阿那。方俗异语同谓静虑也。五名奢摩他此译云止。令心止境故名为止。六名心一境性。令心专一于境之性故名心一境性。旧云一心是略故也。七名为定。审定所缘故名为定。八名正思。义如前说。有师说言。三昧之名及三摩提只是等持非是异名。是说不然。所以者何。如金鼓经十种定中。前三地中名三摩提。后七地中名为三昧。如是二名若同等持。何由改名前后异说。又此二名何由不同。若由方俗异故不同者。不应一处俱说二名。若由传者前后故异者。不应一本有此二名。如三摩提及三摩地。此由前后传者不同。故其是同灼然可见。三昧之名与三摩提同在一本何由不异。是故当知如前说也。第二明通局者略作四例。一者定与等持。二名最宽。通漏无漏。亦通<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。及通欲界散乱心中。以六位心所别境五中有三摩地亦名定故。二者心一境性及三昧名此二次宽。虽通欲界。不通一向散乱心中。以般舟三昧或欲界系九种心住。心一境性亦通欲界方便心故。三者三摩呬多。及静虑名。此二是狭。全不通于欲界心故。唯取轻安所含润故。四者三摩跋提及奢摩他此二最狭。于定地内有简别故。以奢摩他不通四种慧行之中心一境性。三摩跋提不通于空无相无愿三三摩地故。八名宽狭粗述如是。第三释题名讫</p><p>自下第四科文解释。文有三分。一者序分。二者第二品下六品余文是正说分。三者入总持品尔时如来而告众言已下二纸许文是<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分。序分之内有二种序。谓通与别通序之中即有六事。前三明亲承之传。后三证大师之说。言前三者。一如是。二我闻。三一时。后三是何。一教主。二住处。三徒众。徒众之内序四类众。一声闻众。二菩萨众。三长者众。四杂类众。于中委悉如常所说</p><p>经曰。尔时尊者大众围绕为诸大众说大乘经名一味真实无相无生决定实际本觉利行若闻是经乃至<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>一四句偈是人即为入佛智地能以方便<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a><a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>为一切生作大知识</p><p>论曰。此下第二别序即有四分。一威仪分。二说经分。三入定分。四重颂分。威仪分者。如经尔时尊者大众围绕故。说经分者。如经为诸大众说大乘经等故。此经文势似法华序。如彼文言尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a><a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>围绕说大乘经名无量义。如彼论中判此经名。即为<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>之异目。彼意以为在前说故名为序分。今看此经文势皆是经家序辞。以是准之应是别经。在前广说。说已入定。从定起已。方说金刚三昧经也。说经宗后乃说经名。当知一味真实等名。是前所说广经之目。如是二经大意虽同。文相即异。前所说者广<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>门为益当时。后所说者略摄法门为利末世。是故在前广说。以为略经缘由。此说经分文相有二。先序经名。后叹经德。若闻已下是第二分</p><p>经曰。佛说此经已结跏趺坐即入金刚三昧身心不动</p><p>论曰。是第三入定分。所以欲说经前。先须入定者。为显唯寂静者。于法能觉能说故。又复为显贤圣默然。贤圣说法。随时而用。不相离故</p><p>经曰。尔时众中有一<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>名阿伽陀从座而起合掌胡跪欲宣此义而说偈言</p><p>论曰。是第四重颂分。为显前说一味之经与后所说大意不殊。故以略偈颂前广经。因此发起后略说经故文即有二。先序后颂。是经家序以发后颂。阿伽陀者此云无去。或言灭去。此是药名。能令诸病皆悉灭尽故名无去。此菩萨亦如是。能治众生诸烦恼病故以药名为其目也。八行颂中即有二分。前七颂颂说经。后一颂颂入定。初中亦二。三颂总明。四颂别显</p><p>经曰。大慈满足尊<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>通无碍广度众生故说于一谛义皆以一味道终不以小乘所说义味处皆悉离不实入诸佛智地决定真实际闻者皆出世无有不解脱</p><p>论曰。总明三颂即有四意。一者二句叹能说德。二者一颂叹能诠教。三者一颂叹所诠义。四者二句叹教胜利。第二中言一谛义者。所谓一心。依一心法有二种门。二门所依唯是一实故名一谛。一味道者唯一乘故。余文可知</p><p>经曰。无量诸菩萨皆悉度众生为众广深问知法寂灭相入于决定处</p><p>论曰。此下四颂别叹问答。此五句者叹问广深令知寂灭入实际故</p><p>经曰。如来智方便当为入实说随顺皆一乘无有诸杂味犹如一雨润众草皆悉荣随其性各异一味之法润普充于一切如彼一雨润皆长菩提芽</p><p>论曰。是第二叹佛答胜利。于中有三。谓法喻合。如其次第。四句二句五句应知</p><p>经曰。入于金刚味证法真实定决定断疑悔一法之印成</p><p>论曰。此第二颂入定。上半正颂在前入定。下半逆颂后起说法。后所说教有二胜能。一决断疑悔。如金刚能破。二印成一乘。如金刚不坏。下半二句显此二义。序分文竟。正说之中大分为二。谓前六品别显观行。总持一品总遣疑情。别显之中即为六分。一无相法品明无相观。二无生行品显无生行。三本觉刹品依本利物。四入实际品从虚入实。五真性空品辨一切行出真性空。六如来藏品显无量门入如来藏。如是六门观行周尽。所以然者。凡诸<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>无始<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>只由取相分别之患。今欲反流归源。先须破遣诸相。所以初明观无相法。虽遣诸相。若存观心观心犹生不会本觉。故泯生心。所以第二显无生行。行既无生方会本觉。依此化物令得本利。故第三明本觉利门。若依本觉以利众生。众生即能从虚入实。所以第四明入实际。内行即无相无生。外化即本利入实。如是二利以具万行。同出真性。皆顺真空。是故第五明真性空。依此真性万行斯备。入如来藏一味之源。所以第六显如来藏。既归心源即无所为。无所为故无所不为。故说六门以摄大乘。又此六品亦有异意。谓初品示所观之法。法谓一心如来藏体。第二品明能观之行。行谓六行无分别观。第三本觉利品显一心中之生灭门。第四入实际品显一心中之真如门。第五真性空品双遣真俗不坏二谛。第六如来藏品遍收诸门同示一味。以此二重六门摄大乘义周尽。又此六品合为三门。前二品摄观行始终。次二品者教化本末。其后二门摄因成果。又前二品遣相归本。中间二品从本起行。后二品者双显归起。以此二三摄大乘尽。又此六品只是二门。相生都泯是本觉利实际真空。是如来藏。又前门者遣妄显因。其后门者显真成果。如是二二之门亦摄大乘周尽。又此六品唯是一味。所以然者。相生无性。本觉无本。实际离际。真性亦空。何由得有如来藏性。如下如来藏品中言。是识常寂灭。寂灭亦寂灭。总持品言。七五不生。八六寂灭。九相空无。如是无所得之一味正为此经之宗之要。但以无所得故无所不得。所以诸门无所不开故作无量义之宗也。虽是一味而开六门故。依六分科文而释。先释品名。言无相者谓无相观。破诸相故。次言法者谓所观法。一心法故。无相观者先六分中第一分义。所观法者后六门内第一门法。今此初品显是二义。以之故言无相法品</p><p>经曰尔时尊者从三昧起而说是言</p><p>论曰。此一品文科分为三分。初出定分。次起说分。后得益分。初后二分是经家序。其第二分正是佛言。初分中显三种成就。一说法时成就。如经尔时故。二说法主成就。如经尊者故。具五通达为世所尊。于甚深法如义说故。三自在成就。如经从三昧起说是言故。如来入定无能惊寤。于定住出得自在故</p><p>经曰。诸佛智地入实法相决定性故</p><p>论曰。此下第二正发言说。此中有二。一者长行。二者重颂。初长行中亦有二分。一略标分。二广说分。略标分中标二种义。初标无相观。后标所观法。无相观中有其二句。先标如来自入无相观。后标令他入无相观。言自入者。如经诸佛智地入实法相决定性故。诸佛智地者。谓如前所入金刚三昧相应之智。住持一切功德法故。入实法相者。谓此佛智破一切相通达诸法之实相故。决定性者。是实法相。非佛所作。有佛无<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>自尔故。次言故者。以决定性释成上句。若不决定即非实相故。又摄上句而成下句。如来自入实法相故。故能令他得无相利也</p><p>经曰。方便神通皆无相利</p><p>论曰。此第二句令他得入。言方便者八相方便。谓从兜率天退乃至入涅槃故。神通者六神通。即为三轮化众生故。皆无相利者。如是八六方便神通皆从自入实相而起。能令他得无相利故标无相观竟在于前</p><p>经曰。一觉了义难解难入非诸二乘之所知见唯佛菩萨乃能知之</p><p>论曰。此下第二标所观法亦有二句。一者直标所观法深。二者为他说是深法。一觉了义者。一心本觉如来藏义。过是永无余深法故。难解者义甚深非诸二乘所知见故。难入者体甚深唯佛菩萨乃能入故。即以后句而释前句。欲明初门所标。佛智所入实法相者。直是一心本觉如来藏法。如<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>言。寂灭者名为一心。一心者名如来藏。今此文言实法相者是寂灭义。一觉了义者即是一心如来藏义。法华论云。诸佛如来能知彼法究竟实相。言实相者。谓如来藏法身之体不变义故。今此经言一觉者。一切诸法唯是一心。一切众生是一本觉。由是义故名为一觉。至下演中当更分别</p><p>经曰。可度众生皆说一味</p><p>论曰。此明为他皆说深法。可度众生者。如来所化一切众生莫非一心之流转故。皆说一味者。如来所说一切教法无不令入一觉味故。欲明一切众生本来一觉。但由无明随梦流转。皆从如来一味之说无不终归一心之源。归心源时皆无所得。故言一味。即是一乘。初略标文竟在于前</p><p>经曰。尔时解脱菩萨即从座起合掌胡跪而白佛言</p><p>论曰。此下第二广说。于中有二。先请后说。请中有二。先序人仪。后明发言。序有二句。一依时表人。解脱菩萨者。令诸众生同一解脱故。寄能问人表所说法故。二序礼仪。如经即从座起等故</p><p>经曰。尊者若佛灭后<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>去世像法住世于末劫中五浊众生多诸恶业<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>三界无有出时</p><p>论曰。此下第二发言而请。于中有二。先举所为时节。后请为彼宣说。初中像法住世。末劫中者先广说经为益正法之时。今此经者为化像法之节。随时厚薄设教异故</p><p>经曰。愿佛慈悲为后众生宣说一味决定真实令彼众生等同解脱</p><p>论曰。此是第二正请宣说。宣说一味者。请说一觉了义之味。决定真实者请说入实法相之观。令彼众生等同解脱者。令彼像法末世众生等同一味究竟解脱。由是言之。教有四句。一正化正法兼利后时。谓前经等。二正化像法兼利前时。谓此经等。三通化前后。谓诸余经等。四不利前后。除上尔所教</p><p>经曰。佛言善男子汝能问我出世之因欲化众生令彼众生获得出世之果是一大事不可思议以大慈故以大悲故我若不说即堕悭贪汝等一心谛听为汝宣说</p><p>论曰。此下第二如来为说。于中有二。一者赞问许说。二者对请宣说。赞问中言出世之因者。入实相观故。出世之果者。一味解脱故。是一大事者。无上同义故。不可思议者。离言绝虑故。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华经言。诸佛世尊唯以一大事<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故出现于世。论者释言。一大事者依四种义。何者为四。一者无上义。唯除如来一切智智。更无余事。如经欲开佛知见。令众生知得清净故。出现于世故。佛知见者。如来能证以如实智。知彼义故。二者同义。以诸声闻辟支佛佛法身平等。如经欲示众生佛知见故。出现于世故。法身平等者。佛性法身无差别故。三者不知义。以诸声闻辟支佛等不能知彼真实处故。不知真实处者。不知究竟唯一佛乘故。如经欲令众生悟佛知见故出现于世故。四者令证不退转地。示现欲与无量智业故。如经欲令众生入佛知见故。出现于世故。今此文中一大事者亦有四义。一无上义。如上文言。诸佛智地入实法相故。二者同义。如经一觉了义难解难入故。三不知义。非诸二乘所知见故。四令证义。可度众生皆说一味故。赞问已竟。次许说中亦有二句。初句反显不说有过。后句顺明诫听许说</p><p>经曰。善男子若化众生无生于化不生无化其化大焉</p><p>论曰。自此已下正为宣说。于中有二。先明无相观广明无相利。后显一觉心广前一觉义。无相观中亦有二分。一者直说观行之相。二者往复决诸疑难。初中亦二。先方便观。后明正观。方便观中。有其四句。初一句牒能化。后一句叹化大。中间二句正明观相。无生于化者。初修观时破诸有相。于幻化相灭其生心故。不生无化者。既破化相次遣空相。于无化空亦不生心故。所以然者。众生本来迷心离相。遍取诸相动念生心故。先破诸相灭取相心。虽复已破幻化有相。而犹取其无化空性。取空性故于空生心。所以亦遣无化空性。于时不生取空之心不得已会无二中道。同佛所入诸法实相。如是化故其化大焉</p><p>问。此方便观为在何位</p><p>答。若仰信修在于十信。其相似观在三十心。论其纯修在四善根。将入初地近方便故</p><p>问。余处说有三无性观。何故此中但说二无</p><p>答。无相无生合为一边。所遣相生同是有故。又此二观皆有寻思。遣无性时无寻思故。或开或合皆有道理故。已说方便次显正观</p><p>经曰。令彼众生皆离心我一切心我本来空寂若得空心心不幻化无幻无化即得无生无生之心在于无化</p><p>论曰。是明正观无二之相。以离所取能取二故。离所取者。以离一切人法相故。此有二种。一者遣离。二者泯离。遣离者先所取相今灭除故。如经令彼众生皆离心我故。泯离者先所取相本来空故。如经一切心我本来空寂故。言心我者。人名为我法名为心。心是诸法所依主故。达诸人法本来空时。先所取相此时不起。所以二离一时成就。已说离所取。云何离能取。谓离一切能取分别此亦二种。一者本离。二者始离。言本离者。通达心我本来空时正得本觉空寂之心。此空寂心本离能取。离能取故本不幻化。如经若得空心心不幻化故。不幻化者非虚妄故。言始离者。得此本觉空寂心时能取分别不复得生。随所得心无幻化故。如经无幻无化。即得无生故。如是始得无生之心会本空寂无化之理故。言无生之心在于无化。假说心境故寄言在然。始离能取是始觉义。本离空心是本觉义。义虽有二混成一觉。同离能所离新旧故。如论说言。以始觉者即同本觉。当知此觉永离生灭始终等相。始从初地乃至佛地。但有分满不同而已。如十地论本分中说。自体本来空有不二不尽。乃至广说。又此一觉有本始义。以有本觉显成义故。真修之说亦有道理。以有始觉修成义故。新修之谈亦有道理。如其偏执即有未尽。且止乘论还释本文广无相观竟在于前</p><p>经曰。解脱菩萨而白佛言尊者众生之心性本空寂空寂之心体无色相云何修习得本空心愿佛慈悲为我宣说</p><p>论曰。此下第二往复决疑有四问答次第决疑。第一问中问意有二。一者众生心性本来空寂而犹动念无始流转。云何方修而得本心。二者空寂心体无色无相。众生本来恒取有相。云何习无而得空心。故言云何修习得本空心</p><p>问。此中所说众生之心应是六识等生灭心。何以得知一心本觉</p><p>答。起信论云有法能起大乘信根。谓众生心依一心法有二种门。乃至广说。又如经言。寂灭者名为一心。今此文言。空寂之心体无色相。言有左右意致还同。言无色者无显形等色故。无相者无生灭等相故。此文即显心真如门。上言众生之心且举心生灭门。举生灭心显真如门。以之故言。性本空寂。然此二门其体无二。所以皆是一心法耳</p><p>经曰。佛言菩萨一切心相本来无本本无本处空寂无生若心无生即入空寂空寂心地即得心空善男子无相之心<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a><a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>一切法相亦复如是</p><p>论曰。此答有二。正答决答。言菩萨者。是呼解脱菩萨之辞。下文呼辞皆亦同也。一切心相者。一切八识动念之心心所相应行相差别。若行若相皆有四相故。本来无本本无本处者。一切心相种子为本。求此本种永无所得。所以然者。为在现时为已过去。若在现时即与果俱无本末异。如牛两角。若已过去即无作因无体性故。犹如兔角。如是道理本来法尔。以之故言。本来无本。又生灭心生必依本处。本处既无即不得生。言本处者。谓俱有根。其五色根既是色法。有方无方皆不可得。余三所依皆无色法。有时无时并不可得。是故亦言本无本处。谓从本来无其本处。既无本种亦无本处。当知心相本来无生。以之故言空寂无生。如是观察不得生时。其能观心亦无所生。是时即入本来空寂。所入空寂即是一心。一切所依名之为地。故言即入空寂。空寂心地虽诸众生本来流转。恒取有相。然依此门推求观察。即能得本空心。故言即得心空。心空空心语有左右。只是一心本觉之义。正答所问竟在于前。此下结答。无相之心者举一心体。无心无我者结前所说。空寂无生无相心中。离心我相。一切法相亦如是者。重结空寂。非直离此心我二相。其余一切有为无为乃至有上无上等相无相心中无不离故</p><p>经曰。解脱菩萨而白佛言尊者一切众生若有我者若有心者以何法觉令彼众生出离斯缚</p><p>论曰。自此已下第二问答。前一问答总明破有相门。今此问答别显离二缚门。别举二病以问其药。言有我者人执之病。若有心者法执之病。言斯缚者。别而言之。人执是粗重缚。法执是相缚。通而说之。二执皆有粗重相缚。又此二执皆有二缚。谓相应缚及能缘缚。<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>章中其义已具。答中有二。先治人执。后治法执。治人执中先总后别</p><p>经曰。佛言善男子若有我者令观<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a></p><p>论曰。此是总治。观十二支略有二门。一观无作缘生。治作者执。如说是事有故是事有。二观<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>缘生。治<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>执。如说是事生故是事生。存我之来此二为本。本既除故诸末随灭也</p><p>经曰。十二因缘本从因果因果所起兴于心行心尚不有何况有身若有我者令灭有见若无我者令灭无见</p><p>论曰。此是别治。别治有二。一者况治。二者逐治。况治中言本从因果者。从总出别。总而言之。唯因与果。从因出二三。从果出五二。又从因出十支。从果说二支。故所从本但是因果。因果所起兴于心行者。因果之起心行为本。心能作因心受果故。心尚不有何况有身者。依上所说观察道理心不可得。况心所作色身是有乎。身心尚无况有我耶。又心不有故因果亦空。因果尚空况有我乎。又因果空故十二支空。况有作者受者等耶。如经言。菩萨观十二因缘如虚空不可尽。此之谓也。已说况破。云何逐治。谓若有我者令灭有见者。牒前况破灭存<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。若无我者令灭无见者。此正逐破无我之病。所以然者。先破我执离外道病。而取无我堕二乘病故。今逐破着无之见。我本非有况有我无。故总别二观破我执竟</p><p>经曰。若心生者令灭灭性若心灭者令灭生性灭是见性即入实际</p><p>论曰。此下第二治存心见。于中有二。正治重释。二乘人等法执存心。计有生灭无常之心。故破生灭灭存心见。若存心生而成病者破前灭性。要依彼灭存今生故。若见后灭执有现心。心设不灭如兔角故。破如是见令灭生性。无生有灭不应理故。灭是见性即入实际者。破见灭性必不取生。破见生性必不取灭。不取生灭必不存心故</p><p>经曰。何以故本生不灭不灭不生不灭不生不生不灭一切法相亦复如是</p><p>论曰。此是重释。何以见心生者令灭灭性。见心灭者令灭生性。故言何以故。次释此问。本生不灭者。求前生心永不可得。不可得有何法而灭。如是不存前心灭性即不得取今心之生。故言不灭不生。是释令灭灭性之由。次言不灭不生。牒前不灭今不得生。如是不得今心生性。则不得取此心之灭。故言不生不灭。是释令灭生性之由。如于心法无灭无生。其余诸法亦同是观。故言一切法亦如是</p><p>问。若计心生真破此生。何须破彼前心之灭</p><p>答。今生是现破有不易。前心己过解空不难。故先破易而遣其难。依此次第破今生性。由是即遣后灭之执。是谓医王善巧之术耶</p><p>经曰。解脱菩萨而白佛言尊者若有众生见法生时令灭何见</p><p>论曰。此下第三问答。次前问答明所灭之见之病。今此问答显能灭之见之药。又前破生灭二际之见。今破有无二边之见。今问意言若观行者。顺<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>意观法生时令灭何见。灭何见者问佛教意。且举一边兼显观灭</p><p>经曰。佛言菩萨若有众生见法生时令灭无见见法灭时令灭有见若灭是见得法真无入决定性决定无生</p><p>论曰。见法生时者。正观俗法因缘生时。此时能离取空之见。故言令灭无见。见法灭时者。正观俗法本来灭时。此时能离取有之见。故言令灭有见。此中何故言令灭者。佛教能令观者灭故。此意正明修观行者观法生时只离无见而不存生。观寂灭时唯离有见而不取灭。所以然者。若存生耶生本寂灭。若取灭耶灭即生起。如下颂曰。因缘所生义是义灭非生。灭诸生灭义是义生非灭。所以能离二边而不着中。如其离无取有破有取空。此为妄空而非真无。今虽离有而不存空。如是乃得诸法真无故。言得法真无。决定性义如前已说。得真空时观心不生远离一切有无心故。故言决定无生</p><p>经曰。解脱菩萨而白佛言尊者令彼众生住于无生是无生耶</p><p>论曰。此下第四问答。前明真观离二边相。今显妄解不离生住。谓有寡学修观行者意言分别。观法无生能摄散乱住无生境。作如是念谓是无生。后出定时起增上慢。意谓已得无生法忍。为破是病举病问言。住于无生是无生耶</p><p>经曰。佛言住于无生即是生何以故无住无生乃是无生</p><p>论曰。答中有二。略答重详。此即略答。有其二句。上句顺明是生。住无生境即是分别之心生故。下句反释无生。若心无住于无生境离诸分别。是无生忍。故知有住非无生忍。如是反释。略答文竟</p><p>经曰。菩萨若生无生以生灭生生灭俱灭本生不生心常空寂空寂无住心无有住乃是无生</p><p>论曰。此是重详。于中有二。先详是生。后详无生。若有住心生于无生之境。即是以生灭其境界之生。故言若生无生以生灭生。虽灭境界之生而取其灭之无。于灭无境能取心生生灭俱存。岂曰无生耶。如是二句详前是生。真无生忍即不如是。外不存于所取之灭。内不生其能取之生。以之故言生灭俱灭。然此俱灭非谓还无。推求本生不得其生。既不得生何得还灭。于时证会本来空寂故言本生不生心常空寂。如是空寂能所平等。无能住心住于空境。故言空寂无住。如是乃名无生法忍。故言乃是无生。演无生观竟在于前</p><p>经曰。解脱菩萨而白佛言尊者心无有住有何修学为有学也为无学也</p><p>论曰。此下广一觉义。于中有八问答。科为二分。前二问答正广一觉如来藏义。后六问答因论生论遣诸疑难。今此初问。问心无住。若有学者即非无住。若无学者即非观行。又若有学者应有心生。若无学者只是空理</p><p>经曰。佛言菩萨无生之心心无出入本如来藏性寂不动</p><p>论曰。此中先显道理后正对问。显道理者。得无住时无生之心心常寂灭。无有出观达本无起亦非始入。以之故言心无出入。如是观心既无出入。即是本觉如来藏心。是明始觉即同本觉。此无生心既是本藏本来性寂不复起动。云何得有入出起息。此言重成无出入义</p><p>经曰。亦非有学亦非无学无有学不学是即无学非无有学是为所学</p><p>论曰。此是正对问意。于中有二。先遮后许。既非始入故非有学。亦无终出故非无学。又无能住之心故非有学。不无无住之心故非无学。此是俱遮遮止句也。无有学不学是即无学者。以无别所学即不是能学。由是义故许是无学。此依非有学义许是无学也。非无有学是为所学者。虽非有住之观非无无住之行。以是义故许是有学。既有学故下地所学。此依非无学义许是有学也。此是俱许自在答也</p><p>经曰。解脱菩萨而白佛言尊者云何如来藏性寂不动</p><p>论曰。此下第二问答。前明始觉不异本觉如来藏性。今者正显如来藏性隐藏不动。此中略明如来藏义。如来藏门有二有三。所言三者。如不增不减经言。众生界中示三种法。皆真实如不异不差。何谓三法。一者如来藏本际相应体及清净法。此法如实不虚妄。不离不脱智不思议法。无始本际来有此清净相应法体。二者如来藏本际不相应体及烦恼缠不清净法。此本际离脱不相应烦恼缠不清净法。唯有如来菩提智之所能断。三者如来藏未来际平等恒及有法。即是一切诸法根本。备一切法具一切法。于世法中不离不脱。案云。是显三种如来藏门。何等为三。一者能摄如来藏。住自性时能摄果地如来功德。能摄如来名如来藏故。二者所摄如来藏。谓烦恼缠不清净法一切皆在如来智内。皆为如来之所摄持。如来所摄名如来藏。三者隐覆如来藏。谓法身如来烦恼所覆。如来自隐名如来藏。<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>作如是说。消其文者。言未来际平等恒及有者一心之体遍于三际。然前二门中。已显本际故。此门中明后际等。又欲显其如来之义。谓未来际平等恒者即是如义。言及有者是其来义。如佛性论云。此真如者非如中有如。无非如亦如。二乘如者是非如中如。无非如中非如。云何如是。二乘之人约虚妄观无常等相以为真如。此虚妄观唯因中有果地则无。是故此如或成或坏。菩萨如者离虚妄。约真性以观如故于因果二处无异唯成无坏。乃至广说。故知后际平等恒者正显大乘之如义也。所言及有明来义者。对凡法去显一心来。如凡去时五取蕴法不至果地去而不来。此一心如果地犹有永无过去。故言及有即显来义。如论说言从住自性来至至得。正谓此也。如是一心通为一切染净诸法之所依止故。即是诸法根本本来静门。恒沙功德无所不备。故言备一切法。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>动门恒沙染法无所不具。故言具一切法。然举染法以望心体不能遍通。所以离脱。若举心体望诸染法。遍诸染法无所不通。故言于世法中不离不脱。不离脱义是隐藏义。此第三门总明一心。通于动静为染净依。第二门者别显动门。染法所依。第一门者别显静门。净法所依。第二中言本际不相应体者。诸烦恼法违反心体名不相应。一心之体随缘动门为彼所依故。是不相应法之体。言及烦恼缠不清净法者。彼能依法依心体转。缠自心体令随染故。合取能依所依之法以为第二如来藏体。唯有如来菩提智之所能断者。唯解脱道能正断故。此义具如二障章说。第一中言本际相应体者。本来静门备恒沙德与心相应故。是相应功德之体。言及清净法者。能依功德性离染故。合取能依所依之法以为第一如来藏体。此法如实不虚妄。不离不脱智不思议法者释相应义。是法身义与诸功德法相应故。如上文言。不离不脱不断不异不思议佛法相应名为法身。是义云何。此一心体略有五相。何等为五。一者远离所取差别之相。二者解脱能取分别之执。三者遍三世际无所不等。四者等虚空界无所不遍。五者不堕有无一异等边。超心行处。过言语道。过恒沙等本有功德亦有五义与体相应。一者一一功德离所取相故非法身所离。与第一相相应。如经言不离故。二者一一功德脱能取执故非法身所脱。与第二相相应。如经不脱故。三者此一一德遍三世际纵无前后际断。与第三相相应故言不断。四者此一一德等虚空界。横无彼此处异。与第四相相应故言不异。五者一一功德皆离诸边非思量境绝言语路。与第五相相应。如经言不思议故。诸功德法有此五义。与体无别融通一味。由是道理名为相应。非如王数别体相应。今此中言不离不脱智不思议法者。诸功德中略举觉义。五相应中略说三义。此是第一能摄藏也。三种藏义略述如之。言二门者如夫人经言。空如来藏者若离若脱若异一切烦恼藏。不空如来藏者不离不脱不异不思议佛法。案云。诸烦恼法皆是虚妄由境不实故虚。由体散乱故妄。妄故无真。虚故无实。无真实故说名为空。能覆如来名如来藏。即是空义。隐覆真也。诸烦恼境不实之相法身所离故曰若离。诸烦恼体妄执之缚法身所脱故言若脱。言若异者。即前虚妄差别分别乖于法身平等性故。以此三义不相应故。是无真实即是空义也。言不空者。一切功德与体相应。体非妄故真。境非虚故实。由真实故说名不空。如来被覆名如来藏。不离不脱等句是释不空之义。义如三种藏门已说。然此中不空如来藏体即前三中第一之法。此中空义是彼第二。而彼三种如来藏中隐覆之义合在第三。故前二中别显能摄所摄二义。今此二种如来藏门欲显空义隐覆真实。故别能覆所覆二义。又此二经互显别义。所以二三两门异释。且止乘论还释本文</p><p>经曰。佛言如来藏者生灭虑知相隐理不显是如来藏性寂不动</p><p>论曰。生灭虑知相者即是空如来藏。但此文中显能隐义而不名此为如来藏。言隐理不显是如来藏者。是不空如来藏。约所隐义名如来藏。言性寂不动者。显此藏性。虽隐不改。此性有五义。如无相论说。一种类义是性义。如瓶衣等一切色法不离四大种类皆以四大为性。如是众生不出一界。皆用一界为种类故。摄大乘论名体类义。佛性论中名自性义。言有左右意无异也。二者因义是性义。如木中有火性。与火作因故名为性。如是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>诸无漏法以此为因而得成故。彼二论中同名因义也。三者生义是性义。如炼真金生<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>具。庄严具生以金为性。此界亦尔。能生果地五分法身。法身之生此界为性。摄大乘中亦名生义。佛性论中名至得义。为别因义是在果前故。就已生名至得义。四者不改义是性义。犹如金刚宝性一劫等住无增无减。如是此界三世等住。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>不坏出世不尽。彼二论中名真实义。真实义者是不坏义。所以言异而意同也。五者密藏义是性义。如黄石中有真金性。若不破矿无所利益。随顺炼治即有宝用。是故彼性是隐藏义。如来藏性当知亦尔。不破其缠为外为染。破缠相应成内成净。故知此性是密藏义。佛性论中名秘密义。摄大乘论名为藏义。义同言异。灼然可见。今此文中所言性者含此五义。寂不动者略显后二。寂是密藏义。不动是不改义。故上来正广一觉义竟</p><p>经曰。解脱菩萨而白佛言尊者云何生灭虑知相</p><p>论曰。自此已下有六问答。因论生论决诸疑难。此一问答明其能隐虑知之相</p><p>经曰。佛言菩萨理无可不若有可不即生诸念千思万虑是生灭相</p><p>论曰。此答中有二重。先略答后广演。略中二句先举所迷。所迷之理心行处灭。故言理无可不。可者是也。不者非也。理绝四句离诸是非。非分别心之所行处也。次显能迷。若有可不即生诸念者。以有无明不觉平等。即有分别可不之心。由是具起六种染心故。千思万虑是生灭相者。六种染心虽有粗细皆违平等。是生灭相故。如起信论云</p><p>复次分别生灭相者略有二种。云何为二。一者粗。与心相应故。二者细。与心不相应故。又粗中之粗凡夫境界。粗中之细细中之粗菩萨境界。细中之细。是佛境界。此二种生灭依于无明熏习而有。所谓依因依缘。依因者不觉义故。依缘者妄作境界义故。若因灭即缘灭。因灭故不相应心灭。缘灭故相应心灭。案云。此中粗与心相应者谓三种相应染。细与心不相应者三种不相应染。粗中之粗者谓执相应染不断相应染皆在六识故凡夫境界也。粗中之细者谓分别智相应染在第七识。细中之粗者谓现色不相应染能见心不相应染。细中之细者谓根本业不相应染。此三皆在第八识位。此中三种细生灭者无明风所动。故言因灭故不相应心灭。于中三种粗生灭者境界风所动。故言缘灭故相应心灭。于中委悉。如彼论疏中说也。今此经言千思者总摄一切不相应染细分别故。万虑者总摄一切相应染心粗分别故。此二皆是动念之相。以之故言是生灭相也</p><p>经曰。菩萨观本性相理自满足千思万虑不益道理徒为动乱失本心王</p><p>论曰。此下广演。于中有三。一者对生灭相显理满足。二者对理满足明染阙失。三辨顺理灭染去动趣寂之利。初中言菩萨者是呼解脱菩萨之辞。观本性相者佛观本觉如来藏性故。理自满足者所观本觉如来藏理具足无量性功德故。如起信论云</p><p>复次真如自体相者从本已来性自满足一切功德。所谓自体有大智慧光明义故。遍照法界义故。真实识知义故。自性清净心义故。常乐我净义故。清凉不变自在义故。具足如是过于恒沙不离不断不异不思议佛法乃至满足无有所少义故名为如来藏。亦名如来法身故。今此经言理自满足。总显如是功德满足也。初段文竟。次明生灭动念之过。于中总明无益有损。如彼论中广释此义云</p><p>问曰。上说真如其体平等。离一切相。云何复说体有如是种种功德</p><p>答曰。虽实有此诸功德义。而无差别之相。等同一味唯一真如。此义云何。以无分别离分别相。是故无二。复以何义得说差别。以依业识生灭相示。此云何示。以一切法本来<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>实无相念。而有妄心不觉起念。见诸境界故说无明。心性不起即是大智慧光明义故。若心起见即有不见之相。心性离见即是遍照法界义故。若心有动非真识知。无有自性非常非乐非我非净。乃至具足过恒沙等妄染之义。对此义故心性无动即有过恒沙等诸净功德相义示现。若心有起更见前法可念者。即有所少。如是净法无量功德即是一心更无所念。是故满足名为法身如来之藏。今此经言徒为动乱者。以心有动非真识知。无有自性。非常乐我净等故言动也。以心起见即有不见之相等。故言乱也。失本心王者。无量功德即是一心。一心为主故名心王。生灭动乱违此心王不得还归故言失也</p><p>经曰。若无思虑即无生灭如实不起诸识安寂流注不生得五法净是谓大乘</p><p>论曰。此下第三顺理灭染去动就寂。于中有二。正显重成。此即正显去动就寂。若无思虑者。始从初地乃至佛地。渐顺一心平等法界。永无一切思虑分别故。即无生灭者。由前思虑有生灭相。今无思虑永无分别。二种生灭究竟离故。从此已去顺理不动。穷未来际不复还动。故言如实不起。二种生灭究竟息时。八种识动皆得归静。六染流注永灭不起。故言诸识安寂流注不生。流注不生故法界圆显。诸识安寂故四智满成。故言得五法净。运载之功莫过于此故。总结言是谓大乘。正明去动就寂文竟</p><p>经曰。菩萨入五法净心即无妄若无有妄即入如来<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>圣智之地入智地者善知一切从本不生知本不生即无妄想</p><p>论曰。此是重显。即有三句。初言入五法净心即无妄者。归心源时即无<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>之不觉故。第二言若无有妄即入如来自觉圣智之地者。不觉尽时即入始觉圆智之地故。是对不觉显始觉满也。第三入智地者善知一切从本不生知本不生即无妄想者。始觉满时能知不觉四相动念本来不生。即知本来无妄想故。是显始觉不异本觉也。如起信论云。一切众生不名为觉。以从本来念念相续未曾离念故说无始无明。若得无念者。即知心相生住异灭。以无念等故。而实无有始觉之异。以四相俱时而有皆无自立。本来平等同一觉故。案云。此中言若得无念即知心相生住异灭者。即显经中善知一切也。而实无有始觉之异者。即显经中善知从本不生也。以四相俱时而有皆无自立本来平等同一觉故者。即显经中知本不生即无妄想也。梦中渡河之喻此中应广说也</p><p>经曰。解脱菩萨而白佛言尊者无妄想者应无止息</p><p>论曰。此下第二问答明无止息。问意言。本无妄想即无所止。所止无故能止亦无。无能止故应无始觉。如是难也</p><p>经曰。佛言菩萨妄本不生无妄可息知心无心无心可止无分无别现识不生无生可止是即无止亦非无止何以故止无止故</p><p>论曰。答意有二。先许无止。后遮无止。许者始觉不异本觉故。遮者始觉非唯是本觉故。许中息与止何异者。妄起动故可息。心驰散故可止。而本无起无驰故无可息可止耳。无分者无相分于见故。无别者无见别于相故。相见既无分别。现识本来不生。去来不生。愚智共知故。约现在明本不生。既无所止不觉之生。即无能止始觉之异。依不异门如是许也。亦非无止者。非无不异之始觉故。止无止故者。能止无生之妄心故。虽生不可得而非徒无生故。非徒无生故不无所止。所以非无能止之觉。如是答也</p><p>经曰。解脱菩萨而白佛言尊者若止无止止即是生何谓无生</p><p>论曰。此下第三问答显无生观。难意云。若有能止之觉。则生能止之观。虽遣不觉之起。还存始觉之生。何谓能证无生观耶</p><p>经曰。佛言菩萨当止是生止已无止亦不住于无止亦不住于无住云何是生</p><p>论曰。答意有二。先与后夺。与者许生在方便观。能止心生故。且如世第一法之时虽止识生不取于识。而能止心取无而生。当此止时即许是生。以之故言当止是生。过此一念即不取无。不取无故取心不生。以之故言止已无止。此时远离一切分别故。不住于无止之无。亦不取其自无住心。能所永绝。平等平等。云何是时可得是生。如是答也</p><p>经曰。解脱菩萨而白佛言尊者无生之心有何取舍住何法相佛言无生之心不取不舍住于不心住于不法</p><p>论曰。此是第四问答遣增减见。谓诸学者犹作是念。入观之心取无相理舍诸相事。为遣此增益见故言不取不舍。或作是念。入观之时都无所住法。亦无能住心。如是不异于毕竟无为。除此损减见故言住于不心住于不法。虽非有住而非无住。非无住故得言住也</p><p>经曰。解脱菩萨而白佛言尊者云何住于不心住于不法佛言不生于心是住不心不生于法是住不法</p><p>论曰。此下第五问答重遣疑情。疑情之言。既言住者即应是心是法。若不心法即应言是不住。此言甚深。云何信解。如是疑也。佛答意言。不存能证观心不存所证理法。故言不生于心。不生于法生犹存也。既恒不存心法。非或失念而存。故言是住不心。是住不法住犹恒也。恒不退失故名为住。住义如是。弥顺不心。何容相违于其间哉。如是正答。下即重显</p><p>经曰。善男子不生心法即无依止不住诸行心常空寂无有异相譬彼虚空无有动住无起无作无彼无此得空心眼得法空身五阴六入悉皆空寂</p><p>论曰。此下第二重显。于中有二。先显远离诸相周遍三世。后显随顺法界具修六度。初中三句谓法喻合。不生心法者。牒前正答句。即无依止者。横无能依所依之异。不住诸行者。纵无曾当今现之行。无曾当故心常空寂。无能所故无有异相。譬彼已下第二引喻。无有动住者。如世虚空无为常住无有前灭后生之动。喻于不住诸行。亦无能依所依之住。比于即无依止。无起无作。即同心常空寂。无彼无此。不异无有异相。故举虚空。喻不生观也。合中言得空心眼者。由不生能观心得无所不观故。得法空身者。由不生所观法得平等法身故。五阴皆空者。以得空心眼达于三世五阴空故。合前虚空无起作也。六入悉空者。以得法空身。遍于内外六入空故。合前虚空无彼此也</p><p>经曰。善男子修空法者不依三界不住戒相清净无念无摄无放性等金刚不坏<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>空心不动具六波罗密</p><p>论曰。是第二显具修六度。修空法者者。牒前空寂之心。下别显具六度。不依三界故具施度。不住戒相故具戒度。清净无念故具忍度。无摄无放故具<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。性等金刚故具<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。不坏三宝故具般若。何以故。唯一观心遍照可轨。绝诸诤论故备三宝。三宝义成故言不坏。唯一空心无别动作而具六度。故言空心不动具六波罗密</p><p>经曰。解脱菩萨而白佛言尊者六波罗密者皆是有相有相之法能出世耶佛言善男子我所说六波罗密者无相无为</p><p>论曰。此下第六问答重显出世六度之义。问者乘疑而为决之故。举世间六度事相以疑出世心中具六。答中有二。一者略标。二者广释。此即略标。言无相者。离施受等三轮相故。言无为者。离生住等三有为故。我前所说一心具六者。一一皆是无相无为故。此六度是出世间。不同世间有相有为</p><p>经曰。何以故善入离欲心常清净实语方便本利利人是檀波罗密</p><p>论曰。此下广释。于中有二。先别释后总明。何以故者。因问发起。既有六数。何故无相也。转依真如名为离欲。离三有欲之所显故。观心体解故言善入。更无出入故曰心常。离三轮垢故曰清净。即是上言不依三界。如理而说故言实语。巧便引导故曰方便。虽无功用应机发语犹如天鼓。此之谓也。一切众生唯一本觉。令诸众生同归一觉。以之故言本利利人。是名出世檀波罗密</p><p>经曰。至念坚固心常无住清净无染不着三界是尸波罗密</p><p>论曰。愍念众生如视一子。故曰至念坚固。恒在世间不住涅槃。故曰心常无住。是防二乘之非。观心明彻。不杂诸漏。故言清净无染。遍涉<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>达皆空寂。故言不着三界。是止凡夫之恶。是明不住凡圣戒相。即是上言不住戒相。是名出世尸波罗密</p><p>经曰。修空断结不依诸有寂静三业不住身心是羼提波罗密</p><p>论曰。上二句者安空理离有结。下二句者静三业泯身心。皆是无生法忍之义。即是上言清净无念</p><p>经曰。远离名数断空有见深入阴空是毗梨耶波罗密</p><p>论曰。上二句者离粗精义。入空者是进义。即是上言无摄无放。此是出世精进度也</p><p>经曰。具离空寂不住诸空心处无在大空是禅波罗密</p><p>论曰。具离空寂者。应化受生遍三有故。不住诸空者。不滞五空恒化十方故。此明教化众生禅也。心处无者。虽身涉于三有心常处于理无。理无者。理绝三有之相也。在大空者。虽恒化于十方而心在于大空。大空者。十方大相之空也。此显成就佛法禅也。身虽起作心寂不动。即是上言性等金刚。然大空义略有五种。一者人法二空名为大空。如杂阿含大空经说。瑜伽论中亦同是说。二者般若波罗密空名为大空。如大<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>说。楞伽经中亦同是说。三者器世界空名为大空。如<a href=\"/fojing/jieshenmijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">解深密经</a>说。中边论中亦同是说。四者阿梨耶识空名为大空。如十地论说。五者十方相空名为大空。如智度论说。今此经文在于第五。且随意便作是说耳</p><p>经曰。心无心相不取虚空诸行不生不证寂灭心无出入性常平等诸法实际皆决定性不依诸地不住智慧是般若波罗密</p><p>论曰。心无心相者。不存自<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>心相故。不取虚空者。不取心虚之空性故。此是证道慧也。诸行不生者。达一切行本来不生故。不证寂灭者。不着无生而恒外化故。此是教道慧也。心无出入性常平等者。前之二道恒不相离。动而常寂寂而恒动。故无出入。动寂恒并不滞一边。故性常平等。诸法实际皆决定性者。演证道之常寂之相。相同真际等法性故。不依诸地不住智慧者。演教道之恒动之由不依着于十重法界。不住滞于寂照慧故。此中即具觉照。可轨。绝诤之义。即是上言不坏三宝。是名出世般若波罗密也。上来别释六度文竟</p><p>经曰。善男子是六波罗密者皆获本利入决定性超然出世无碍解脱</p><p>论曰。此下第二总明。于中有二。先明六度同一解脱。后显解脱即是涅槃。初中言皆获本利入决定性者。六度始修皆同本觉。本觉显成本利行故。入如来藏性本寂静无始无终无改转故。如是六度得本利故远离妄念流转之相。故曰超然出世入法性故。周遍法界无相无为无缚无脱。故曰无碍解脱</p><p>经曰。善男子如是解脱法相皆无相行亦无解不解是名解脱何以故解脱之相无相无行无动无乱寂静涅槃亦不取涅槃相</p><p>论曰。是第二明解脱即是涅槃。于中有二。先明解脱。后即涅槃。初中言皆无相行者。六度之行皆同本觉。本觉之相离相离性。故曰无相。六度之行离修离行。故曰无行。行相俱绝故言皆无相行。解脱法相既其如是。何有离缚之解。何有不解之缚。故言亦无解不解。何以故者。何故六度之行而言无相行耶。答此意言。如是六度非但即是解脱。亦乃即是涅槃。是故说言无相行也。解脱之相无相无行者。牒前解脱。无动无乱寂静涅槃者。明即涅槃。欲明如前所说六度之行皆无起动亦无散乱即是本来寂静涅槃。既即是涅槃。何有相行耶。离动乱相故曰寂静。亦离寂静性故亦不取涅槃相也。此中六度解脱涅槃。始从初地乃至佛地。言涅槃者。四种之中即是本来清净涅槃。正是不可思议解脱。依其自在无障碍义。是故说名无碍解脱</p><p>问。解脱之义乃有众多。有双道中解脱。有三点中解脱。五分法身之中解脱。十种解脱门中解脱。是诸门内为在何门</p><p>答。是三事中解脱。解脱即是涅槃故。欲显六度之行三事之德克实而言。初地已得乃至妙觉位究竟圆满。如经中说。若有菩萨住大涅槃能建大义。乃至广说故</p><p>经曰。解脱菩萨闻是语已心大欣怿得未曾有欲宣义意而说偈言大觉满足尊为众敷演法皆说于一乘无有二乘道一味无相利犹如大虚空无有不容受随其性各异皆得于本处</p><p>论曰。此下第二重颂。于中在先经家序发。正颂之中有七行颂。于中有二。前六别颂。后一总颂。初中亦二。一者二颂一句颂前略标。二者三颂三句颂后广释。略标中言。诸佛智地入实法相决定性故。方便神通皆无相利。今此颂中初一颂颂。又言一觉了义难解难入。乃至可度众生皆说一味。今此颂中以三义颂。谓前一句是法说颂。次二句引喻颂。后二句合喻颂</p><p>经曰。如彼离心我一法之所成诸有同异行皆获于本利灭绝二相见</p><p>论曰。此下颂广释文。于中有二。先五句颂广无相观。后二颂半颂广一觉义。广无相中正广重显。今初二句颂正广文。前正广中亦有二分。先方便观。后明正观。今此颂中颂正观文。彼言令彼众生皆离心我。乃至广说远离能所。今此二句正颂此文。言一法者。离有无边。一中道观。以此能离心我执故。重显文中有四问答。今此二句颂前二番问答。所言诸有同异行者。彼初番答中言。一切心相本来无本。如是等文即是同行总相观故。第二番答中言。若有我者令观十二因缘。又言若有我者令灭有见。若无我者令灭无见。若心生者令灭灭性。若心灭者令灭生性。如是等文即是异行别相观故。此同异行所入无异。故言皆获于本利。如前末言。灭是见性即入实际故。又此颂言灭绝二相见者。颂后二番问答。彼第三答中言。见法生时令灭无见。见法灭时令灭有见。今正颂此故言灭二见也。第四答言。生灭俱灭。本生不生。心常空寂。空寂无住。今正颂此故言绝二相也</p><p>经曰。寂静之涅槃亦不住取证入于决定处无相无有行</p><p>论曰。此下二颂半颂广一觉。广一觉中正广重显。今此颂中唯颂重显。重显文中。有六问答。此中有二。前之一颂颂第六答。次一颂半颂第五答。前四问答略而不颂。第六答中言。入决定性超然出世无碍解脱解脱之相无相无行无动无乱寂静涅槃亦不取涅槃相。今此颂中逆次颂也</p><p>经曰。空心寂灭地寂灭心无生同彼金刚性不坏于三宝具<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>度诸一切生</p><p>论曰。此是颂第五答。彼文言。不生心法即无依止不住诸行心常空寂无有异相乃至性等金刚不坏三宝空心不动具六波罗蜜。今此颂中顺次颂也</p><p>经曰。超然出三界皆不以小乘一味之法印一乘之所成</p><p>论曰。此一颂者总颂前来一品大意。消文大意已如前说</p><p>经曰。尔时大众闻说是义心大欣怿得离心我入空无相恢廓旷荡皆得决定断结尽漏</p><p>论曰。一品之内有三分中。前之二分竟在于前。此是大文第三时众得益。得离心我者。证二空真如故。断结尽漏者。断见修二惑故。欲显得入初地见道正断见惑兼断修惑。义如<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>所问论说。于中委悉在二障章也</p><p>金刚三昧经论卷上</p><p>金刚三昧经论 卷中</p><p>新罗国沙门元晓述</p><p>无生行品</p><p>论曰。菩萨观行成就之时。知自观心顺理<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。非有生心非无生心。亦非有行亦非无行。但为离增益边故假说为无生。不于有生生心。不于无生生心故。为离损减边。亦假说为行。虽非有有行之行。而非无无行之行故。是故立名无生行品</p><p>经曰。尔时心王菩萨闻佛说法出三界外不可思议从座而起叉手合掌以偈问曰</p><p>论曰。别显观行有六分中。第一遣诸境相显无相观竟在于前。此下第二泯其生心明无生行。就文有三。一者正说。二者赞说。其第三明闻说得益。初正说中有其四分。一者往复问答。二者反征问答。三者菩萨领解。四者如来述成。初中有六。一问二答三难四拒五请六释。初中有二。先经家序。心王菩萨者。从体立名。然心王之义略有二种。一者八识之心御诸心数故名心王。二者一心之法总御众德故名心王。今此菩萨入无生行证一心王故。从所体以立名也。今此品中明无生行。所以心王菩萨发问出三界外不可思议者。是出所闻之法以为发问之本。其所闻者谓前品说。今且举后以摄其前。谓最后颂言。超然出三界乃至所成故</p><p>经曰。如来所说义出世无有相可有一切生皆得尽有漏断结空心我是即无有生云何无有生而有无生忍</p><p>论曰。此二颂是问辞。于中初颂领前所说。上半领前一味法印。下半领次一乘所成。后一颂正发问。于中上半牒无生义。下半问无生忍。既无有生。应无忍心故</p><p>经曰。尔时佛告心王菩萨言善男子无生法忍法本无生诸行无生非无生行得无生忍即为虚妄</p><p>论曰。是第二答。答意有二。先示无生忍相。后显有得过失。无生法忍者。达法本无生。是则定慧诸行亦无有生。非于无生。有能忍行。故言非无生行。于中有得能忍之行则乖真忍无住无行。故言即为虚妄</p><p>经曰。心王菩萨言尊者得无生忍即为虚妄无得无忍应非虚妄</p><p>论曰。是第三难。难意而言。若谓有得有忍是虚妄者。则谓无得无忍应非虚妄。反虚妄故。诸学大乘无所得者。作如是计。自谓非妄。为显彼妄故作是难</p><p>经曰。佛言不何以故无得无忍是则有得有得有住是则有生有生于得有所得法并为虚妄</p><p>论曰。是第四拒。于中有二。不者直拒。何以故下第二释拒。拒意而言。若彼意谓无得无忍则虽不得有得有忍之有而犹得其无得无忍之无。既得于无者则心住于无。心既有住即是有生。谓有心生于有所得故。亦违于无生无得。是故说言并为虚妄</p><p>经曰。心王菩萨言尊者云何无忍无生心而非虚妄</p><p page margintb15></p></div>"
}]