[{
    "title": "金刚般若经赞述 第1700部",
    "author": "窥基大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经赞述 卷上</p><p>刊行金刚般若经赞述序</p><p>般若六百卷。以金刚为精髓所谓深妙玄约。群圣犹迷。非虚言也。在昔无著禀偈于<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>。天亲受旨乎贤兄。二论之出世。譬之犹双悬日月烛照幽冥也。及法之东渐也。翻译注疏。其类寔繁。传说我<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师是常啼菩萨之后身。信乎其执破骨出髓之夙志。忘躯殉法。委运祈通。其译诸经。托终于此法。以大呈嘉瑞及其上迁也。亦诵真文以逝。其有大<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>于般若。而独得其宗旨者。可以见已。而于本经。最注意焉。是以疏主受旨。特述三注。曰玄记。曰赞述。曰会释。而其直就经文为释者。独赞述为然。然人徒知有此书。而莫之或目也。况能研索之乎。越前艺公尝有叹于此。欲上梓行世。搜索四方。得五本焉。既已参互校订之矣。念我兴福更有善本。癸酉之夏。来谋之余。余嘉其志。出一本相示。盖学头所历传。艺公大喜持去。至于季秋。再来告其仇对卒业。乞余题语。余深惧以鄙言冠祖典。不逊之罪。不可逃也。固辞不敢。乙亥之夏刻竣。复持至求予必一言。以证考订无私。予感其笃志。且喜法之弘传也。乃忘僣越。略叙来由。以塞其责云</p><p>文化十二年岁在乙亥夏五日</p><p>兴福别室大僧都训映谨识</p><p>刻金刚般若经赞述序</p><p>我曹<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。从无始际。汨溺于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>海中。头出头没。靡有出期。大圣<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。悯之宣畅摩诃衍法。于中演说破有之教者。摩诃般若经。四处十六会说。而此金刚般若者。其第二处第九会说。实是觉海之要津。入道之宝户也。是以支那日本诸大德。疏此经者。僧肇净影等无虑数十家。本朝镂梓行世者亦颇多矣。唯大唐慈恩窥基法师。有疏二卷。东域录中称赞述者。传本邦以来。盖千有余年。而未梓行于世学者憾之。岂非缺乎。余同国社友丹山子法讳顺艺者。天资聪敏。好学菩笃。游学本黉。有年于兹。慨此典未现流于世。探其善本。刻苦校雠。颇延岁月。旁加邦读。付诸剞劂氏。将上木令余作序。余虽不敏。曷不喜此典流后代布海内乎。且兹经。<a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>祖智者大师。有疏一卷<a href=\"/remen/huayanzong.html\" class=\"keylink\" target=\"_blank\">华严宗</a>祖至相大师。有疏二卷。三论宗祖吉藏法师。有疏四卷。今此书。即<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>宗祖基法师之所撰。则四家大乘师之疏。得此而恰完矣。窃思。我社诸子。依此经疏研寻。则一乘三乘教义。性相二宗法门。坐而得之。是余深所冀也。丹山子此举。亦兹意耳。因不耻鄙拙。聊述开刻之事缘。以辩其简端云尔</p><p>维岁文化十年癸酉仲冬闰月越州香月院释深厉志于京兆高仓学寮</p><p>校订例言六则</p><p>─斯书。余所索得凡六本。其三是南都古本。而兴福寺学头历传本。又其最可据者。故今以此为主。以参订余本。其涉两可者。则并存之。又虽可疑。而诸本皆同者。则姑从原文。不敢臆断。且揭注之上方。更[立*矣]善本</p><p>─本经新翻未容润饰。故此疏就什译以解之。盖以其译在初流传最广耳。然有什本所阙一二以余本补之者。今圈其右方而注之于格上</p><p>─此疏所牒经文。每举其首尾略去中间。今就现藏补填全文。以便捡阅</p><p>─本经诸家所刊行有数本。今直就大藏。抽出本经仇之。于疏所牒。挍其同异。大藏。又参订宋本明本丽本焉。并揭注之上方。如疏中所引二论。文又有不同前三本者。非其所正释。故不烦加挍注。观者当自捡知之</p><p>─余所得六本。皆略有国训。而莫全备者。今请典寿律匠捡阅之。参订合议。悉附邦读。以便初学。更见古点本可依者。当是正之</p><p>─凡上梓者。必借书手。而往往不免脱谬。今余不自揣书之拙。亲写缮完。以授剞劂。虽缺于观美。庶不致误人</p><p>文化十年癸酉冬十月</p><p>丹山野衲顺艺(志道)谨识</p><p>大乘 基撰</p><p>一彰因起二明年主三释本文。初中有二。一明经因起即谓空有二因。乃有阿僧伽佛去世后九百年。上请慈尊为开中道说。瑜伽十七地中边分别论等并弥勒所谈。并如广章说。有少差异如别纸。二明论因起者。摄大乘云有二种藏。一声闻藏二菩萨藏。于中有三谓素怛览阿毗达磨毗奈耶。谓华严般若等名菩萨藏中素怛览。解深密阿毗达磨经名阿毗达磨藏。毗奈耶瞿沙经名第三藏。然上诸经唯依梵本各有多颂。以渐隐没卷轴便小。或此方翻者偏略。所以渐约也。即阿毗达磨经中有摄大乘品佛当加持菩萨所说佛去世后九百余年。无著菩萨撮集诸经统摄其义。为二万七千颂名对法论。后有其资名浮陀僧诃此名觉师子。造六万三千颂释。与前师造两本别行。后有菩萨名安慧糅为一部。故称为杂集。即瑜伽十支中之一支也。谓三十<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>等各为一支。故如迦旃延三百年后造发智论。而后有六足诸论等</p><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a></p><p>姚秦三藏法师鸠摩罗什译</p><p>二明年主者。一明经二明论。经者然此般若上代已来总有五译。出其年代具如玄记。然三藏贞观十九年初从西至。最初翻译其论也。对法为先。至贞观二十三年三藏随驾玉华。先帝乖和频崇<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。共藏译论遍度五人。更问良因藏令弘赞。遂制般若之序名三藏圣教序。其时太子亦制显扬论序当许杂翻经论并赞幽灵。既有违和不暇广制也。于时帝问藏云。更有何善而可修耶。藏报云。可执笔以缀般若。帝既许之。藏便译出其夜五更三点翻译即了。帝索读之即遣所司写一万本。既不重缀词句遂疎。后欲重译无由改采前布也。当尔积代梵本文并付三藏。藏讨诸本龟资梵文即罗什译同昆仑之本与<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>翻等。然经文舛异随文乃知真谬。题名不同。三藏独名能断。即先所译。无著论本亦名能断。何意然也。彼意说金刚有三义。一所破义。无著论本云。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>行邪见行。解云正邪虽异还作是同。故行该两种见。即喻金刚虽一能所有殊。虽曰金刚亦有物能破之。故如白羊角即破金刚也。二能摧义。无著云一者细是智因故二牢者不可坏故。解云闻思两慧能伏染故。渐生<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>故名能摧称为智因也。二牢者即谓修慧。既是定心正能破障故名牢也。或修慧中有有漏无漏二别。以分细牢。或就无漏中有折伏道断惑道。二分亦行。然<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障通理事两观伏以欣上厌下伏故。所知障唯理观伏可知也。又约无间<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>亦分细牢者。至<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>位解脱道中名断者三种断中断性断类名断。而非断用及断体。以非所断不名为断体。已断非正断故不名为能断也。三者阔狭义。无著论云如彩画金刚形两头宽而腰狭。解云地前佛果喻宽十地喻狭以地地之中各修一行为首故。或七地已前分是宽皆随义准之。应知今若所破名金刚。金刚之般若能破摧名金刚。金刚即般若也。然经云般剌若者因中慧言萨筏若者此云一切智是果中智也。言般剌慎若者断惑慧。即此中所标故云能断也。论者然今唐国有三本流行于世。一谓世亲所制翻或两卷或三卷成。二无著所造或一卷或两卷成。三金刚仙所造。即谓南地吴人非真圣教也。此或十一卷或十三卷成也。若唯学有以非空<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>之心更长。唯学空而非有。真智无因而不生起。灭妄想于空门起真心于有府。有空双镜说教有二种。一谓随机如<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>二空等理。二谓显理而如说<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>实相等。佛以一音等。华严云如来一语中演出无边契经海等。法华唯明摄入以彰一乘。胜鬘通据出生及摄入也。然法华云若人行五波罗蜜。不及<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>听闻法华者。约<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>总名一乘。故牛车喻于菩提。经云吾为汝等造作此车。故应当等心各各与之。故胜鬘云行<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>不及手捉经者。彼据真如为乘也。如彼经文具显其相也</p><p>如是我闻一时佛在舍卫国祇树给孤独园</p><p>第三判本文者。此经始终有其三分。初文前由致分。次尔时须菩提即从座起下发请广说分。后佛说是经已下喜悟<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>分。前中有二。初明通由致。次尔时世尊下别由致。前中有五。一为令生信总显已闻。说如是我闻。二说者听者共相会遇时分无别总说一时。三化必有主。主若胜法可尊故标于佛。四化必有处要托胜处说妙法。故言舍卫国祇树给孤独园。五明教所被机。谓千二百五十人俱据实亦有菩萨众如婆伽婆说。亦有八部众如下<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分说。今此略故但举声闻也。余文可知。言说处者谓筏苏显轻呼度旧云五<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>者讹也。今释显度者此云月氏。此五国中多有贤哲。如月照暝能除炎热故以为名也。旧云月支等者并非也。其舍卫国者讹也。应云室罗筏悉底布罗。此云丰德城谓丰多闻丰欲境丰解脱故。此城之主即是钵剌摩那侍特王此云胜军。即谓中印土之都城之名也。国名憍萨罗为别恒河南憍萨罗故以城名标别也。其南憍萨罗国城无有别名号。即以国为名故。祇树者即谓誓多太子之林。誓多者此云战胜也。给孤独园者谓须达多。于太子处所买得也。今合标彼故双举之。广说缘起如余疏陈</p><p>与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱</p><p>述曰。此第五彰教所被机也。谓佛共兼会名之为与。龙树释云。一者同处丰德城。二者同时同此说听究竟一时故。三者同心共取一味法故。四者同见同证一解脱理故五者同戒各具别解脱戒故。六者同解脱三乘同坐解脱床故。具如是义总名为与。大者有五义一名称大。大众大人所知识故。二位次大。皆住圣果非凡位故。三功德大。或诸漏尽证智断故。四修行大。求大菩提修广业故。五徒众大千二百五十人故。龙树释云。如有七宝处金为最大。乃至无好物处铁锄为最大。如是有<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>时佛为最大。乃至于末后时<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>僧为最大。故经云瞻博迦华虽萎萃犹胜诸华鲜洁时。破戒恶行诸比丘犹胜外道持戒者故。今言大者且对有学也。比丘者此有五义。一怖魔。创心<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>四魔怖故。二乞士。以乞自活齐自他故。三净命。离五邪命正三业故。五邪命者一为利养故而现希奇。如坐行人念数珠等。二为利养故自说己德。三为利养故占相吉凶。四为利养故高声现威。五为得利养故说先所得以动人心。四持戒性。威仪曾不缺故。五破恶。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>获果断烦恼故。僧伽名众。证理<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>二俱和故。千二百五十人者佛初成道初一时中度五人俱邻等第二时度耶舍等五十人。第三时度<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>等一百人。第四时度目犍连等一百人。第五时度优楼频螺<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>等五百人。第六时度迦耶迦叶等二百九十五人。第七时度那提迦叶等二百人。如是总有千二百五十人。此举常随徒众也。准下亦有<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>众等今此略故也。然阿含经唯为发趣求声闻乘说。般若空教唯为发趣求大乘者说。故下云为大乘者说为最上乘者说也。涅槃法华解深密等通为发趣一切乘者说谓说有为无为名之为有。我及我所说为空。故今列声闻众者即是为令发趣求大乘故。菩萨已发趣故此略不标也。上来明通由致竟</p><p>尔时世尊‘食时着衣持钵入舍卫大城乞食于其城中次第乞已还至本处饭食讫收衣钵洗足已’敷座而坐</p><p>述曰。第二明别由致也。此文有十。一明化主谓世尊。二辨化时谓食时。三彰衣服谓着衣。四显执器谓持钵。五陈化壤谓入舍卫大城。六明求膳谓乞食也。七辨均普谓于其城中次第乞已。八彰摄化谓还至本处。九显濯足谓饭食讫收衣钵洗足已。十陈安住谓敷座而坐。言世尊者谓具六德破四魔四魔者可知。六德者佛地论说。一<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>义永不系属诸烦恼故。二炽盛义炎猛智火所烧练故。三端严义具诸相好所<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>故。四名称义一切殊胜功德<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无不知故。五吉祥义一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>亲近<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>咸称赞故。六尊重义具一切德常起方便。利益安乐一切有情无懈废故言食时者谓斋时也。此下一一皆有所表。故无垢称经云。佛告阿难陀。诸佛凡所有威仪进止无非佛事也。何故今云食时也。此显食讫说经日即正中。表其所说大乘无相理舍离空有二边执。故食时者谓即说经差别时分也。此表欲说无相之教。先观无相之理。如欲说无量义经。先入无量义处<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>观无量义处之理。佛以慧为命无相为食。欲说无相之教先以慧观无相妙理。后方说之故言食时也。着衣者事衣有三。僧伽梨郁多罗僧安陀惠。此中初衣着入王城聚落。次衣处众<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。次衣可知。今欲入城即显著初衣也。法中亦有三衣。一者<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>亦名甲铠。谓能策励宣说利乐等事。不避寒热等事犹如着衣也。二柔和忍辱衣。谓由忍辱。故拒外怨害。不能侵犹如着衣寒热不触也。三惭愧之上服。由崇重贤善轻拒暴恶。羞耻为相故如衣也。今此表佛策励宣说无相妙法故言着衣也。持钵者应量器。一者应自所食量。二者应外所施量故。不大不小名应量也。为表佛无分别智内证于理如钵受食。心起于智故复名持。入舍卫大城者表欲入<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>大城飡无相食也。或正法如城。故无垢称云为(去呼)<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>城也。菩萨如守城故。或正法如城中人。菩萨如城即为(平呼)护法城也。或入法界大城饮无相味。为表此故言入舍卫大城也。乞食者正表以无分别智内证无相理也。次第乞者谓从一巷至一巷。从一家至一家等。为显于一一法皆遍证至无相理也。还至本处者为表将说无相之教还须起后得智为他广演也。洗足者为显外有垢洗足即除。内心有染闻法自灭也。敷座而坐者谓欲显所说法最胜。故世尊自敷其座如睹尊位不令余人敷座具也。而坐者无著论释云。显示唯寂静者于法能觉能说。故此显世尊端身<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>者。为表内能觉了真理外能说无相法故也。能断金刚云住背面念者。背谓疎远义面谓观向义。谓以智观理如镜鉴面也。所言背者背生死。面者向涅槃。背者舍烦恼。面者证真理。背者离有空。面者处中道。如是应知。或云对面念者是视瞩义。谓以智达理如视瞩其面故也</p><p>时长老‘须菩提在大众中即从座起偏袒右肩右膝着地合掌恭敬’而白佛言</p><p>述曰。此大文第二发请。正说分中依世亲科文有其二。谓从此唱至<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>亦不可思议是初周说。次尔时须菩提乃至云何应住已下讫至应作如是观是第二周说也。谓初周中三问未<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>者如何成发心乃至已修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>如何断障。第二周中说者若菩萨于自身三种修行生如是心。云我能发心。乃至云我能断障为除如是增上慢故第二周说也。谓即初周说法明未发心者教发。第二周说法者谓已发心者言我能发故为说也。或修行断障二周别释。旧释云。初周为生是善。第二周为断障障即所知也。故下论云于内心修行存我为菩萨即障于不住道也。谓菩萨不住道中无分别智内冥真理。方<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>故非起我能心也。又解为利钝两机初后二众故作两周说也。就初周中有二。谓始从应如是降伏下乃至如所教住是正宗。可以身相见如来不下明断疑。谓能断道般若所断者谓<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>也。前中有四。初善现虔恭赞请。次如来叹印许陈。三敬诺希闻。四随问别答。前中复三。初明虔恭。次明赞叹。后正陈请。此初文也。然无著菩萨说成立七种义句已此般若波罗蜜即得成立。谓种姓不断等。此七之初三科判此经总有三段。后四彰此经中所有之义非别判文也。三段文者。一善现赞叹名为种姓不断。二善现发请名为发起行相。发问修行之相故。三者如来印答讫至应作如是观名行所住处。谓依佛所说此一部义以行其行。即是行所住处也。四对治者非别有文。即于行所住处中。有能所对治也。故论云彼如是相应行。相行诸住处时有二种对治。应知谓邪行及共见正行。此中见者谓分别也。于初住处中若说菩萨应生如是心所有众生等。此是邪行对治。生如是心是菩萨是邪行。若复说言若菩萨有众生想等。此为共见正行对治。此分别执菩萨亦应断。谓我应度众生故。于第二住处中若说应行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。此为邪行对治。非无布施是菩萨邪行。若复说言住于事等此为共见正行对治。此分别执菩萨亦应断。谓应行布施故。就此之中有能对治所对治。应准释之。五不失者谓不失正道此遮增减执也。谓于行所住处之中执有人法。故名为增执。拨无真如妙法故名为减执。若作此者便失正道。今遮二执故云不失。故论云于中若说言如来说福德性即非福德性者。此遮增益边。以无彼福聚分别<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。若复说言是故如来说如来福德聚。此遮损减边。以彼虽不如言词有自性而有可说事。以如来说福德聚故。乃至云所谓<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者即非佛法。如是等皆应准释名为不失也。六地者此有三种。一信行地。谓凡夫修位始从唱乃至是名一切法也。二净心地。谓十地始从譬如人身长大下。三佛地。从若菩萨作是言我当庄严佛土乃至经末也。七立名者谓释能断之名可知也。然南地有金刚仙释。科此论总为十二分者。但是此方凡情浪作图度。不可依据也。尔时长老者西方以耆尊为长老也。若少而有德故有大德之名。非此有方周须菩提者讹也。应云苏补底。此云善现。即世尊<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>之中解空第一也。谓应佛之世即能现生。或善能现前了达空义。或初生现时其室空寂。相师占之名为善现。现者出也。生时室中一切空寂表其长大善解空义故名善现。新翻能断名具寿善现者。命有二种。一出世命谓慧。二者世间命谓连持色心相续。若单标慧命不摄世间。若独言寿不通出世。显双具二故云具寿也。即善现有二。一者得出世慧命。二者为得世间长命故亦云长老也。即从座起者为表舍二乘之非实。趣一乘之究竟也。偏袒右肩者显示敬相。彼以右为吉祥故也。为表般若能与众作吉庆也。右膝着地者显降伏生死过失也。谓无始来以右手脚造众罪故。为表此法能伏生死苦也。合掌者为表听者之心与法冥合也。恭敬者表法可尊也。无著论云有六因缘故须菩提问。一者断疑。谓诸众生无始已来无明在身。烦恼迷覆而生疑惑。谓于四谛或于三宝等而生疑惑不能生信。若发问时所有是诸疑惑者皆悉断故。二为起信解故者。谓若虽有信于诸经法不知于何而起信解。故为发问令于般若起信解故。三为入甚深者。谓若虽于般若生于信解。然于甚深之义未能进解。故为发问令解甚深义也。四为不退转故者。谓虽于甚深而得解悟。然逢蚊虻斗诤疲懈等缘。或时退转。一为发问永无退故。五为生喜故者。谓众生久殖生死恒怀无量种种忧苦。一为发问忧苦永除故生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>也。六为正法久住故者。谓若不说如是般若。或诸正法速即隐灭无人住持。一为发问当令正法永得久住也</p><p>希有世尊如来善护念诸菩萨善付嘱诸菩萨</p><p>述曰。依世亲科。初周之中有二。一当宗请说分。二可以身相下广破众疑分。初中有四。一虔恭赞请。二叹印许陈。三敬诺希闻。四随问别答。初中有四。一彰所在。谓大众中二显虔恭三明赞叹四正发请上来二文竟。此为第三赞叹也。言希有世尊者谓住劫之中咸时方有佛出世也。只如贤劫千佛之中已有四佛出世。谓此住劫之中初之五劫无佛世现。第六劫中人寿四万岁时拘留孙佛出世第七劫中人寿三万岁时拘那含牟尼佛出世第八劫中人寿二万岁时迦叶佛出世。第九劫中人寿百岁时释迦牟尼佛出。第十劫中人寿八万岁初减劫时<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>出至第十五劫九百九十四佛共出一劫。至后住劫中有楼至佛独出一住劫。从此已后更经十二大劫方有星宿劫中第一日光佛出从此已后更经三百劫方有余佛出世故法华云诸佛出于世悬远值遇难等也。善护念者世亲云加彼身同行。一加其身二加其同梵行者。谓有菩萨曾已发心逢遇诸佛。机根已熟者如来即护念之一切加其身。令得自利增长善法。二加同行。谓即菩萨有同共梵行者。令转教授之。加其利他也。善付嘱者谓根未熟菩萨即是。虽已发心机根未熟。此有二种。一者曾未有功德。二者曾来虽有功德已唯退失。以此二人付授根熟菩萨。令其教导。于未得已退者令得于曾得已退者令其进修。故名付嘱。又得不退者令不舍大乘者。前将根未熟付授根已熟者今即世尊以法付授根未熟者令不舍大乘。于大乘中欲令胜进名为付嘱世义云准论付嘱有二。一者菩萨之中有得退未得退者。但令其不舍大乘令其胜进名为付嘱也。然无著释意与此稍殊。彼意说云。如来初成道时有菩萨。曾于过去已积善根根已成熟者。佛即为说彼行所住处。于住处中说圣道为能对治。分别为所对治。又说断除增减二执不失正道。凡夫修菩萨修及佛地。又说成立般若名故。如是名为善护念也。善付嘱者即根未熟菩萨未能发心修行。故如来临涅槃付嘱已摄受菩萨。令其以此五种义为说。亦令成熟佛法也。已摄受者即谓根熟菩萨故也。然护念有六。一者时。谓如来能为现在及未来二时护念也。谓于现在令其安乐之时。即不令作恶招未来恶果名为利益。非如慈母令儿子现在得乐故反令造恶也。二者差别。谓善能知机差别为说故名善护念也。三者高大。谓以般若摄益有情更无过上故也。四牢固者。谓世间物可有破坏唯其般若毕竟坚牢也。五普遍者。谓遍能摄益于自他。故非如二乘但自利也。六异相者。谓信行地中凡夫修位有种种别。随其差别以别异法而为说故也。善付嘱者亦有六种。一入处者谓所归投处名为入处。处谓安处也。谓佛付嘱根未熟者言。我涅槃后归余菩萨诸佛等。故以诸善友为所归投也。二法尔得者。谓已根熟者于他之所法尔能为摄益。如母于子也。三转教者。谓令传说般若深法使传灯绍继不绝故也。四不失者。即是入处由有所归投故不失正法正道也。五悲者。即是法尔由有悲故能法尔摄益他。六尊重者即转授也。由尊重般若故而能展转传教也</p><p>世尊善男子‘善女人发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>云何应住云何’降伏其心</p><p>述曰。此第三正发请也。善男子等者即谓乌波索迦等也。若不受别解脱戒不能亲近承事。故不名为善也。发者生也起也。阿耨多罗者此云无上也。三者正也藐者等也。三又名正菩提称觉应云无上正等正觉及等正觉谓初是总名次简外道邪觉。次简二乘偏觉次简菩萨缺觉。举圆满故如是名为无上正等正觉也。谓此体者即是法身。故胜鬘云如来者即是法身。法身即涅槃界也。言发心者谓趣向于波若。故名为发。云何住者问住何心而成发也。谓于何处安住其心而成发也。世云何修行既发心已如何修行耶。云何降伏其心者既修行已烦恼所知如何除断耶。云何住者即谓深念众生心也。云何修行者谓求菩提心也。云何降伏者谓厌离有为心也。又断一切恶者即是云何降伏其心也。修一切善者即云何修行也。度一切众生者即云何住也。又<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒摄善法戒<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情戒亦此配之也。此上并依世亲意释。依无著者与上不同也。彼云应住者谓欲愿故。欲者正求也。谓即正求佛故。愿者为所求故作心思念也。谓发正愿断一切恶等故。应修行者谓相应三摩钵帝故。三摩钵帝者无分别三摩提也。谓为对治分别故。而起无分别三摩提引无分别智也。此意云由有分别故是非遂生。是非生故烦恼起。烦恼起故造恶业。造恶业故生死转。今为断彼故起无分别行也。分别者即所知障故。应降伏者谓折伏散时。折伏散时者若彼三摩钵帝心散制令还住也。此意云若折伏分别心不令散乱故名为降伏。正起无分别三摩钵帝故名为修行也。问何故不得言若善男子等于三乘菩提应云何住等。而独言于大乘耶。如胜鬘云荷四重担者。即有姓无姓皆摄益。故答论释云不可得义。谓善现既是声闻。若问大乘住行为不可得。若问二乘住行者非为难事。世尊不叹善哉也。又为三种菩提差别故善问。故唯问发行菩萨乘也</p><p>佛言善哉‘善哉须菩提如汝所说如来善护念诸菩萨善付嘱诸菩萨汝今谛听当为汝说善男子善女人发阿耨多罗三藐三菩提心应如是住如是’降伏其心</p><p>述曰。此第二叹印许陈于中有三。一者叹二者印三者许陈。叹者谓善哉也。谓若善现少有合理佛但印可未必重叹。为问既极深广故佛重赞善哉也。印谓印述其言。许陈者为拟宣说。谛者审也。令其谛审听受故曰谛听。故经说言听者端视如饥渴。一心入于语义中踊跃。闻法心悲喜如是之人乃为说也</p><p>唯然世尊愿乐欲闻</p><p>述曰。此第三敬诺希闻也。唯者敬词然者可然其事也</p><p>佛告须菩提‘诸菩萨摩诃萨应如是降伏其心所有一切众生之类若卵生若胎生若湿生若化生若有色若无色若有想若无想若非有想非无想</p><p>述曰。此第四随问别答。于中初答云何住次复次下答云何修行。后须菩提菩萨应如是下答降伏。就初之中有四。初明广大心。次明第一心。次明常心。次明不颠倒心。此初也上依世亲科。依无著者就第三彼修行所住处中差别言之有十八。约地言之有三。谓初十六是地前资粮加行二位凡夫。修行即信行地。第十七证道是十地。菩萨行即净心地。第十八上求地即佛地也。谓我庄严佛土已下文若约住处言之有六。谓一摄住处二波罗蜜净住处等于中初二住处即是十八中初二。第三欲住处者即十八中二。谓欲得色身法身故第四离障碍住处者即余十二住。第五净心住处者即第十七证道。第六究竟住处者即第十八上求佛地。总虽有八住处后二不离前六。故通一切住处故但言住处言之有六种也。谓且如初二住处中即有广大及甚深二种住处。如论具显余例应然。就六住处之中初四是信行地。于中初二资粮位。次二加行位也。然无著之意不同世亲论。十八差别一一皆有答前三问也。故论云经言菩萨应生如是心者。显菩萨应如是住中欲愿也。若菩萨众生相转。即非菩萨者。显示应如是修行中相应三摩钵帝时也。若菩萨起众生相人相寿者相。则不名菩萨者。显示应如是降伏其心中摄散时也。其世亲以十八差别中初二差别合答三问。不同无著一一皆答三问。捡论应知。此答云何住者谓如何安处其心而成发也。谓诸修行者欲证菩提作大利乐。要先发起大菩提心方兴正行。故经说言如竹破初节余节速能破。见道初除障余障速能除。若发菩提心一切功德自应圆满故发菩提心。经说譬如大海初有一滴。能为诸宝作所依处。最初发心亦复如是。五乘善法皆因此生。又如世界初始渐起即为荷负诸众生因。此心亦尔。能为五趣无量种类荷负依止。又如空界无不含容大菩提心亦复如是。遍空有为皆厌离故如空。菩提皆求证故尽空。众生皆深念故。此初发心虽为下劣一念福聚尚说难尽。况经多劫发心修行利乐功德。因何发心。一者见闻佛等功德神力。二者闻说菩萨藏教。三者见闻佛法将灭。念言法住能灭大苦。四者末劫多见众生痴无惭愧。悭嫉忧苦恶行放逸<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>不信念。言浊世多起如是恶烦恼。时我当发心令余学我起菩提愿。由此便发大菩提心将欲发心先具十德起三妙观。十胜德者一亲近善友。谓情同道合虽远名近。若非同合者虽近不名善友也。故涅槃云。善知识者<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>而说如说而行。谓自不<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>教他不杀生。乃至自不邪见教他不邪见等名如说而行也。又善知识者犹如初月至十五日渐圆胜故也。二供养诸佛。谓行十种供养。谓现前不现前等三修集善根。谓凡所为作共集善故。四者志求胜法。谓好作胜善好闻胜法。如是等五心常柔和。谓性不穬戾犹如良马。六遭苦能忍。谓为菩提不惮寒热等苦故。七慈悲淳厚谓济拔一切。八深心平等。谓怨亲无二好恶齐故。九信乐大乘。十求佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。法华有五故彼云。又<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>心净柔软亦利根无量诸佛所而行深妙道。三妙观者一厌离有为。谓观生死恶趣无暇等众苦逼迫。自身之中<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>四大能生恶业。九孔常流臭秽不净。三十六物之所集起。无量烦恼烧煮身心。如沫如泡念念迁谢。痴覆造业六趣<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。谛审思惟深心厌舍。二求菩提。谓观佛果相好功德庄严。法身本净具戒等蕴力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>无量胜法。成二妙智慈愍众生。开导愚迷令行正路。诸有情类遇皆除恼见是功德修集名希求。三念众生。谓观众生痴爱所惑受大剧苦。不信<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>造恶业因。厌舍正道信受邪道。四流所流七漏所漏。虽畏众苦还为恶业。而常自行忧悲苦恼。爱别离苦见已还爱。怨憎会苦觉已弥怨。为欲起业生苦无厌求乐犯戒。怀忧纵逸作无间业。顽弊无惭谤毁大乘。痴执生慢。虽怀聪敏具断善根妄自贡高常无改悔。生八无暇匮法无修虽闻不持。翻习邪业得世妙果谓证涅槃。受彼乐终还生恶趣。见是等辈深心悲愍。次应发心如是发愿。愿我决定当证无上正等菩提能作有情一切义利。或随意乐诸佛之名。如释迦佛初发希愿。如俱舍颂于三无数劫逆次逢胜观燃灯宝髻佛。初释迦牟尼佛。无著菩萨由此说言。清净增上力坚固心胜进。名菩萨初修无数三大劫。先起信精进念定慧根降伏障染。次发大愿常逢善友以为胜缘。虽遇恶友方便沮坏。终不弃舍大菩提心。所修善法运运增长。以不退屈而为策发。齐是名为最初修行。依如上说初发心已即名趣入无上菩提。预在大乘诸菩萨数。于生死海作出限量。勇猛定当速登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。今此一唱名广大心者。谓十方无边世界无边众生无边。如是无边众生我无始来于彼起于十恶。今发心已于此众生皆拟济拔摄受。故名广大心也。并欲度脱故。无著论云。有想无想等境界所摄别故者。谓观此三为境界故。有想者谓七有想。无想者谓五无想。非想非无想者除前二。此依有宗释。大乘解者谓。识处名有想。无所有处名无想。无少所有第三非想者非前识处。故非非想者非前无少所有处故也。余如论易详。又论问云。彼卵生等四如何得入无余涅槃。答有三因缘故。谓难处生者待时故者。谓彼答意云。卵生等难处众生待出难处时即令入。无妨也</p><p>我皆令入无余涅槃‘而灭度之’</p><p>述曰。此第一心也。涅槃有四。一自性清净。谓在缠名如来藏。二有余依。谓生死因尽。三无余依。谓生死果尽。四无住处。谓大悲般若二行亲证。或加方便净涅槃为五。谓菩萨作是意乐无边众生皆欲具得无余涅槃故名第一心也。无著论云。何故不直说涅槃耶。若如是便与世尊所说初禅等方便涅槃不别故者。谓初禅等涅槃是世间道。离欲但是士夫果。今言离系果故也。何故不说有余涅槃界。彼共果故者。无余涅槃惑苦依尽所显故。是不共果。又非一向者谓非一向苦依尽故子云何故不说无住涅槃耶。为显三乘共通故</p><p>如是灭度‘无量无数无边众生实无众生得灭度’者</p><p>述曰。此显常心也。谓菩萨摄他同己他度。即我己外无他故能常度</p><p>何以故。须菩提若菩萨有我相人相众生相寿者相即非菩萨</p><p>述曰。此第四不颠倒心也。若起我等四执即分别之障未除。妄想以之更长故。是颠倒既无有四执故名不颠倒心。服药本除其病。无实反增。故世亲云我者总观三世五蕴差别执。见过去我相续至现在不断名众生相。见现在命根不断住故名命者相。见命根断灭过去后生<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>名寿者相。然婆伽婆说。命者即是此名人相。无著稍不同也</p><p>复次须菩提‘菩萨于法应无所住行于布施所谓不住色布施不住声香味触’法布施</p><p>述曰此依世亲答第二问也。然标布施者有二义。一者顺在家三福业事。出家六波罗蜜之中施为先故。二者体宽通摄六故也。在家三福业者谓。施戒修也。此三能于今世后世可爱乐故。贤良君子所称赞故名为福业。非福翻此。初行施者谓诸众生无始已来生死系缚都为悭贪。创令行施使于未得财色等不生贪着。于已得财色等不起悭吝。名之为施。戒者谓教持五八等戒。修者谓修行诸善习<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>等。出家六波罗蜜者谓出家修行。先行施度。谓从浅至深从粗至细从难至易。故经据胜者谓众圣之府据最胜。故各依一义亦不相违。第二体宽通摄六故者。世亲云檀度摄于六。资生无畏法。此中一二三是名修行住。无著意亦同。谓檀度有三一者资生。此有二种谓内财外财施。二者无畏。谓令离苦得乐等不令怖畏故。三法施。谓随机应病为说法。故于中资生摄一谓檀度。无畏摄二谓忍戒。于已作恶未作恶令不生怖畏。故法施摄三谓进定慧。正说法时不疲倦。故观知机明简择故也。无性论亦作是说。施性中现有六波罗蜜多。财施无畏施法施所摄故。解云有释此与波若次同。有释此说。三种施中一一皆摄于六。由如是义故唯檀施也。不住于事应行布施者。谓不着自身也。谓行施时不求自身端妙等。故但为菩提也。应无所住者不着报恩也不住色香等者不着外增上果钱财奴婢等行施也。故论云自身及报恩果报斯不着。护存已不施防求于异事。此中初两句配之文。次两句释前意。于中初一句释不着自身。次一句释不着报恩及果报。如论易详</p><p>须菩提‘菩萨应如是布施’不住于相</p><p>述曰。此答第三问也。于中有二。初正答前征。次释疑难。此初也。应云不住相想。想者分别心相者所著境。言不住者除内分别心。于外不着外相也。谓不见受者施者及所施物故而炽然施也。若见空而不施即是空执。若但施而不见空便有病。要见空而且施方贯中道得成波罗蜜多。故唯识云要七最胜之所摄受方可建立波罗蜜多。谓安住与依止意乐及事业巧便<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>并清净由七度复成。此言无相者即是彼第五巧便最胜。下释疑中有四。一者标二举喻三者合四者劝。上来依世亲意释竟。依无著者自不住于事已下明十八住处中第二波罗蜜相应行六种住处中第二净心住处也。于中文有二。初乃至不于前正明净心住处。次不住于相已下明于此不堪为令堪故显示不住行施也。又论云从此已下有五种。随所相应而解释应知者。谓从第二住处已去也。五种者谓一者依义。依谓所依即以所对治为所依也。二者说相。相谓状也。三者摄持。谓依处所得当来菩提果名为摄持也。四者安立。谓安立处真如妙理也。五者显示。谓显示相应三摩钵帝及折伏散时也。然就此正明净心住处中云不住于事者。是依义依所对治住有能对治不住故。行布施者是说相亦是摄持。欲愿当来菩提果故。不住行施者是第四安立。谓不着自体等三事。即是安立第一义故。以第一义为无住也。故无垢称云无住即无本也。谓行施时安立于心住于无住。故云不住行施也。不住相想者此是显示也。谓相应三摩钵提及摄散心于此二时不住相想。故判文如此。释者论说六波罗蜜有二种果。一者未来二者现在。如论具显。云不住于事此说不着檀波罗蜜未来果。应无所住者此不着余五度未来果也。若求现在果故行施名为住色声等行施也。若求现法涅槃故行施者名为住法行施也。子云准此故知应无所住者脱一法字也。理应云无所住法行于布施。故余见论文自当决了</p><p>何以故‘若菩萨不住相布施其福德’不可思量</p><p>述曰。依世亲释答第三问中上来正答前征竟。自下释疑文有其四。初法说次喻说次合说后劝信。此初也。谓有疑曰若三事体空故而行施者如何能成施福。如来为释此疑故答云。若无住相施其福最多也。何以故者佛语须菩提云。我何以教令无住相施故。谓有相施者是顺世间施可破坏故可毁责故。得世间果不坚住故。是可思议是可计量。无相施者顺出世间不可破坏。当得出世菩提果故。坚牢久住情不能思。算数所不能量也。又有相我者有其分限是有拘碍。无相施者无其分限宽广无边无有拘碍。是故得福最多。故不可以情思算数计量多少也</p><p>须菩提‘于意云何东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可思量不不也世尊须菩提南西北方四维上下虚空可思量’不不也世尊</p><p>述曰。此第二举喻。于中初举东方虚空。次举余九方。一一中皆初佛问次善现顺佛而答也。此意若山河大地星月等诸事物皆有大小分限。如有相布施。唯有虚空无其大小分量限碍。故喻无相布施也。故有经说唯有虚空可喻法身也。谓十方虚空皆无边限。不可算量。同无相施福多无限不可计量也。然世亲之意于其事物有种种不同。谓若男若女若好若恶若此若彼等皆由有相行施等。故所有差别众多分限。若以心契无相无差别理而行施者。福无限碍。当来<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。其福遍满无此彼自他差别也。无差别理者谓空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>理也普遍一切如虚空故</p><p>须菩提‘菩萨无住相布施福德亦复如是’不可思量</p><p>述曰。此第三合也</p><p>须菩提‘菩萨但应’如所教住</p><p>述曰。此第四劝信也。谓劝令如佛所教行无相施。福定无边不久当成广大果也。此意云汝等虽复未解但应如佛所教。后证之时方自了达也。上来依世亲释竟。依无著者就此一段明净住处。中初正明净住处。次不住相。已下为令堪故世尊显示不住行施福德最多也。谓或有菩萨闻说无相施故不生堪忍欲乐修习。而作是说本所行施求自体殊胜及以得恩并诸果报。既无相施何所得耶。谓但贪有相施福德而求自体等。于无相施不能堪乐。故俗有言曰。少不学长无能。有不施思所穷老不教死无名。所以有菩萨贪其福德也。世尊为令堪故而以虚空为喻也。谓说犹如虚空有三因缘。一者遍一切处。谓于住不住相中福生故。解云此说虚空遍一切处无间。有色无色之处。皆能遍故。不同于色不遍一切亦不长久。行无相施其若虚空。成佛已去周遍一切福量圆满长久不绝也。于住不住相中福生故者。谓行无相施时近即感得十王果报。远能获悟菩提法身。其十王果为住福也。菩提法身是不住福。若有相行施尚不得十王报。宁得佛菩提二者宽广高大殊胜故者。谓虚空能广能高又复殊胜。风所不飘水所不溺火所不烧物所不坏。但由高广殊胜故。行无相施。亦复如是。三者无尽究竟不穷故者。谓如虚空毕竟<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>永无穷尽。无相施福亦复如是无限无尽不穷竭故</p><p>须菩提‘于意云何可以身相见’如来不</p><p>述曰。依世亲上来当宗正明竟。自下广破众疑分。于中论有十三分。今科为十二。谓初周说中于此已下有四重校量第一校量者谓以三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝布施。不如受持一四句偈。第二校量者谓如一恒河沙。一一沙数复是一恒河。如是恒河一一沙数是一世界。于尔所世界中皆置七宝满。而以布施。不如受持四句偈等也。此二以财施校量也。第三校量者谓以一恒河沙等身命布施。不如受持一四句偈。第四校量者一日三时于一一时皆以恒河沙等身命布施。不如闻此经典<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>不逆。此二以法施校量也。谓以内身行法供养故。或初二外财施以校量。次二内财施以校量也。于四之中第二第三合为一文故总为三段一一段中皆有四文。谓初三破疑第四正校量。故合之为十二段也。就初校量之中文有四。一者谓可以相成就得见如来不。二者须菩提白佛颇众生得闻如是。三者如来得阿耨多罗三藐三菩提耶。四者正校量。就四之中初三破疑后一正校量不破疑也。前三之中初于无相因以生疑。次于无相因果以生疑。后于无相果以生疑。就此之中初世尊却问次善现顺答后如来印成。此初也。此有疑曰若不住于相行布施者。所行之因既是无相。何故所得之果是有相耶。谓睹佛<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>有三相故而生疑也。三相者谓佛未成道已前名为生相。成道已后说法度人名住异。入涅槃时名为灭相。住异合说者如常释之。谓现形权应随机接物以示三相之身。众生睹之谓得有相之果。便与无相之因不顺。今为解此疑故言不可以相见如来也。谓法身无相是如来故离彼三相。即是法身如来故也</p><p>不也世尊‘不可以身相得见如来何以故如来所说身相即’非身相</p><p>述曰。此第二善现顺答也。于中初正答次释意。但为善现俊爽孤标佛兼加卫聪敏情得意答顺<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>故言不也。所说身相即非身相者。谓所说三相之身相者即非是法身之无相也。所说身者谓三相身即是有相也。即非身相者非无相身也。以无相为相故</p><p>佛告须菩提‘凡所有相皆是虚妄若见诸相非相’即见如来</p><p>述曰。此第三佛重印成也。凡所有相皆是虚妄者。谓虚妄有三。一者真如法身无生灭故名为真实。诸余事法皆名虚妄即此所说也。二者诸无漏法皆名真实。诸有漏法皆名为虚妄。故中边分别论云<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>虚妄心心所也。三者依他圆成名为真实。遍计所执名为虚妄。故此下文我相即是非相。乃至云离一切诸相即名诸佛也。今言虚妄者即有为无漏皆名虚妄也。若见诸相者谓三相。非相者谓法身无相也。上来依世亲释竟。自下依无著释者。此一段文即十八住处中第三为欲得色身住处也。于六种住处中第三欲住处。欲住处中有二。谓欲得色身及法身此初也。于中文有其三。如前科判。言欲得色身者谓有菩萨既发心已次修行时。见佛三相之身相好具足便欲求得。故佛意曰三相身者不是如来。却问须菩提成显此义。为遮欲得色身菩萨故也。依义说相摄持安立显现等五义并如论自配。谓所说相即非相者是摄持也。谓由欲愿摄持当来菩萨果故名摄持余思可知</p><p>须菩提白佛‘言世尊颇有众生得闻如是言说章句生’实信不</p><p>述曰。依世亲意就初校量中此破第二疑也。上来既说行无相因得无相果。义既甚深不同有相。佛灭度后一切众生及佛在世诸恶众生不生信心。如来是不成空说耶。设生信来世恶人如何能信。为破此疑故佛答云。未来有菩萨备<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>者。曾已积集善根故能生实想亦不空说也。偈言不空以有实者谓以有能生实想故佛不空说也。言三德者谓<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>学。又说一者修行谓具三学。二者逢善友谓值诸佛。三者离空有执谓证二无我理。今此文中初问次答。此初也。言说章句谓能诠教也。生实想者谓能起智。顺其无相因果也。谓有恶众生于其无相不生智顺。于其有相返生顺智。故善现作此问也。无著论意者上来三差别竟。此为第四欲得法身住处也。六种住处中第三欲住处有二。上来欲得法身也。于中有二。一者欲得言说法身。二者欲得证得法身。言说法身者谓能诠教。证得法身者谓所诠理。此意云上为修行求证色身。佛言有相虚妄法身是实。因此便求法身无相。将欲证其无相先起四亲近行。谓近善知识从彼求闻。思惟修习故先欲得言说法身也</p><p>佛告须菩提‘莫作是说如来灭后后五百岁有持戒修福者于此章句能生信心’以此为实</p><p>述曰。此第二答中无著世亲皆有三段。且世亲者初明修行。次当知是人下明逢善友。如来悉知已下明具福德。达二空理不着空有也。无著科者初显示修行。次显示集因后显示善友摄受。两科虽复有异。皆是答须菩提生疑问已莫作是说者佛语善现。汝莫言不生实相。亦有生实相者故。若依无著释者须菩提问佛云。颇有众生能得闻言说法身不。佛答云有得也。后五百岁者谓释迦灭后正法五百年像法一千年末法一万年。未度比丘尼已前时正法一千年也。然法有三种。谓教行证法。于中正法住时三种有。像法住时而无证法更不得果。故但有教行像似于正法时故名像也。于末法时唯教法而无行证。设有持戒修行者多为名闻利养故。今言后者即是第三五百年。后正法灭时也。故能断云正行灭时也。又月藏经说佛灭度后第一五百年解脱坚固。谓修行者多分并得解脱出离故。第二五百年禅定坚固。谓修行者多分得禅不得圣故。第三五百年多闻坚固。谓多因经论博达多智故。第四五百年福德坚固。谓多福德造塔寺等故。第五五百年斗诤坚固。今言后五百年者谓于五时中皆有持戒修福等也。谓于后五百年有具戒定慧者。于无相因果经教中能生净信心。起随顺智以为实相也</p><p>当知是人‘不于一佛二佛三四五佛而种善根已于无量千万佛所种诸善根闻是章句乃至一念生’净信者</p><p>述曰。此第二文也。无著天亲随义如前科判。谓说若有于此经句生一念信尚曾供养无量诸佛。况起多念。乃至受持听闻等者曾集善根更多也。若生实想者曾善又多也。何故尔耶。谓虽于此生一念信熏习在身。当来成熟能破无量广大生死故也</p><p>须菩提‘如来悉知悉见是诸众生得如是’无量福德</p><p>述曰。此第三明达二空理离空有边也。无著云此下明善友摄受也。于中初标次释。此初也。世亲云如来悉知者简肉眼见。谓以智知故。悉见者简比量智。皆<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>见故。谓诸众生。达二无我所有持戒等福德如来悉以佛智现量知彼也。余经中说菩萨生福德者谓初起。取福德者谓久熏修。今此但总故云得如是无量福德也。无著释云悉知者知名身。四蕴为名故。悉见者见色身。谓于一切行住所作中知其心。见其依止故。即是显示善友所摄也。生取无量福者生谓福正起时。取者即是彼灭时摄持种子也</p><p>何以故‘是诸众生无复我相人相众生相’寿者相</p><p>述曰。此第二释中初明无我。次明无法相四种。此意云后五百岁时有菩萨。了达身之生起衰灭成无本非有我。又了怨亲是非之类本由自心都无定实。既闻人法二空之理复积持戒等福。所以如来以佛智知眼见也。谓总缘三世五蕴差别一一阴是我。如是妄取是名为我相。见身相续不断谓从过去我而至现在名为众生相。见现在一报命根不断名为命者。见命根断灭后未来复生余六道中者名为寿者。今人替于命者也。无著释稍不同。谓取我自体相续名为我。我所取为众生想。此二我即及我所也。谓我乃至寿住取为<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>。展转趣余趣取为人想。解云彼说寿者此说为人也。上来四执妄情谓有。总了为空故云无我相等也</p><p>无法相亦无非‘法相’</p><p>述曰。此第二明法相之中初明四法相。次结成如筏喻。前中有二。初明空有相次明依言离言相。初中有二。初总标次别释之。此初也。此文阙略故科有参差若观余本不尔也。谓初标四法相次别释。释中有二。初云有法相即着我人。有非法相亦着我人者。即释前不着空有相。次云不应取法不应取非法者。释前依言离言相也。今此标中但标空有相。略无标依言离言相。释中具有也。无法相者谓凡情妄执执法我。为有名为法相。既达为空知法体而非实故云无法相。无其所执实有法相故。亦无非法相者。谓愚者妄情拨圆成而是无名非法相。空无有体故。智者了此圆成是有故无非法相。无其所执为空相故。二无我理是实有。故此中更应云无相亦非无相。言无相者谓无我理不可以言宣说为有为无。诸小菩萨乍谓可说名之为相。圣者了之为不可说故云无相也。亦非无相者以于无言处依言相说也。谓愚者既闻不可说故即谓有言皆非。智人达之故依言辞而说。然不执着故言亦非无想也</p><p>何以故‘是诸众生若心取相则为着我人’众生寿者</p><p>述曰。释前不着空有相中有二。初总次别释此初也</p><p>若取法相‘即着我人众生寿者何以故若取非法相即着我人’众生寿者</p><p>述曰。此别释也。谓若执法我为有。即亦着我人。执圆成为无。亦着人我。取是执义。双无二执故即契中道。故云无法相亦无非法相者。离二执也。故偈云一切空无物者人法二我无也。实有者二无我理体非无也。不可说者不可以言说为有为无也。法性离言故依言辞而说者易知也。又云若取法相则为着我人等者。此义云何。但有无明使无现行粗烦恼亦无我见故者。解云但有无明使者谓无明住地。即是分别法执也。无现行粗烦恼者谓无现行烦恼障也。但有种子随逐故。此意云由有法执现行故烦恼障随起也。无著论亦云。然于我想中随眠不断故则为有我取。是故经言是诸众生若取法相则为着我等。意亦同世亲也。由法执取法相故我等便生故</p><p>是故不应取法不应取非法</p><p>述曰。此释第二依言离言相也。不应取法者不应如声取法谓。不如言而取故。不应取非法者随顺第一义智正说。如是取者谓必因言而悟真故</p><p>是故如来‘常说汝等比丘知我说法如筏喻者法尚应舍’何况非法</p><p>述曰。此结成筏喻也。谓将欲证真必因言说。及其正证即不假言。如筏至岸即无所用也。上来依世亲释竟。依无著者论云此取显示实相对治五种邪取故。何者五取。一者外道。二者内法凡夫及声闻。三者增上慢菩萨。四者世间共想定。五者无想定。第一者我等想转第二者法相转。第三者无法相转。此犹有法取。有法取者谓取无法故。第四者有想转谓执有想定。第五者无想转执无想定故。是诸菩萨于彼皆不转也。于中言生实想者此为依义显示对治不实想。故言于此修多罗章句中者此为说相。显示言说法身故。即彼当生实想中。言当生者是欲愿摄持。是诸菩萨。无复我想转等者是安立第一义。不应取法非法者显了也</p><p>须菩提‘于意云何如来得阿耨多罗三藐三菩提耶如来’有所说法耶</p><p>述曰。依世亲此破第三疑也。谓有疑曰上言无想因还得无相果。何故释迦佛于道场成觉。说法度人双林入灭等耶。真谛引经偈言。七年作婴儿八年作童子。四年学五明十年受欲乐。二十九出家三十五成道。四十五年中广度诸众生。此等即是有相之果。岂彼不行无相因耶。为破此疑故有此文也。于中初佛问次善现答。此初也。然佛有三种。一者法身谓离妄之真理。二者报身会真之妙智。三者化身应物之权迹。谓法身妙理菩萨所不测。报身实智二乘所不知故。应物现形随方化接。有睹斯质便谓实证菩提真能说法。便是有想。今破此疑故约真如法身以问善现也</p><p>须菩提‘言如我解佛所说义无有定法名阿耨多罗三藐三菩提亦无有定法’如来可说</p><p>述曰。第二答中有二。初答次释此初也。善现意云。若据世谛报化二身可有得菩提。可有说法。若约第一义谛者真如法身内自堪寂。本无得菩提。亦无能说法。无有定法者谓法身无相中无有定法得菩提。亦无定法而可说也。但欲无定可得可说。不遮世谛报化之身亦有不定得不定说也</p><p>何以故‘如来所说法皆不可取不可说非法非非法</p><p>述曰。此释也。于中两重展转释前。此初也。谓何以故无定法可说。内既不可说于外亦不可取。故于外若有可取是应于内亦有可说。既无可取明无可说也。不可说非法非非法者。谓愚夫执人法为有名之为法。拨圆成是无名非法。圣者达人法为无名为非法。了圆成为有名非非法。法身寂净不可说非法。亦不可说非非法也。故论云应化非真佛。亦非说法者。说法不二取无说离言相。应化既非真佛真说。即明亦是假佛假说也。于内既无二说于圣者亦不二取。谓取法及非法也。真理离言无其说相故。何故释中但言说不言证。论云若不证者即不能说。故谓要先证方能说也</p><p>所以者‘何一切贤圣皆以<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>’而有差别</p><p>述曰。此又释前也。谓诸圣者皆以无分别智契证真理。方能断惑而立差别故<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>说彼无为法。彼圣人所证法既不如是说。何况如是取。何以故。彼法远离言说相非可说故。上来世亲释竟。无著意者此段经文即是第四欲得法身。于中上来明得言说法身竟。此第二明欲得证得法身。于中有二。谓一者智相至得法身住处。谓无分别智能契得真如法身。即以智相为住处也。二者福相至得法身住处。此明初也。谓前欲得色身佛言色身虚妄。教求法身。欲求法身先修诸真之智。即是菩提法身故名智相。由求智相法身故佛以真如法身。为问谓外事中而有执他可得菩提。随众生机有可说法。于内无相法身之中本无智身菩提可得。亦无法而可说故以为问也。善现答言义亦同。然解佛意故约真如理彼二俱无也。谓于内真如理不可说非法非非法。故即无说无取也。于外听者依真如理不可取故无闻无得也。此即说听皆依真如也。世亲释意说证真如故不说法非法。听离妄执故不取法非法。谓法者所执人法为有故。非法者所拨圆成为空故也。依等五义配文者如论自显也</p><p>须菩提‘于意云何若人满三千大千世界七宝以用布施是人所得福德’宁为多不</p><p>述曰。依世亲释初校量之中上来三段。释疑自下正校量也。外意云真理之中既无说无取。无菩萨而可得者所行无相之福。岂不空施耶。世尊挟此意故问善现也。于中初佛问次善现答后如来成此初也</p><p>须菩提‘言甚多世尊何以故是福德即非福德性是故如来说’福德多</p><p>述曰。此第二答中初标次释。言是福者谓举财施福德。即非福德性者谓非是感出世之福德性也。谓要听闻发生无分别智方得出世无相果故。是故如来说福德多者。谓是故如来说此财施福能感世间福德多</p><p>佛言若复有人‘于此经中受持乃至四句偈等为他人说’其福胜彼</p><p>述曰。此第三佛为校量之中初正校量次释所以。此初也。乃至四句偈者谓下至受持四句也。谓领纳在心名受。记令不忘称持。四句偈者谓明此宗义之处。义圆足者即为一句。如说广大第一常心不颠倒。此四心各为一句也。又如不住于事应行布施即为一句。如是准知。此经宗者谓无分别。破于分别为宗也。如言色声香味触等者是集名。虽有多句义非足故终不成句也。如说不生亦不灭不常亦不断等亦非句义也。谓由受持为他说故能生智慧。证无相果。此福不空。唯此二种能趣菩提故</p><p>何以‘故须菩提一切诸佛及诸佛阿耨多罗三藐三菩提法皆从’此经出</p><p>述曰。此释也。谓由因听闻此经故依教思惟修习引无分别智。契会真。智圆满故。从此生理先妄覆故名之为出今此总合说故但言出也。谓一切诸佛者报化二佛从此经生也。及诸佛阿耨菩提者诸法身佛从此经出也。论云于实名了因者谓于无为实相了因所得也</p><p>‘须菩提所’谓佛法者即非佛法</p><p>述曰。更释受持福胜之意也。谓以无分别智契证真理。理智圆明名为佛法。此唯十方诸佛同得名为佛法。余人不得故即非佛法。又初一法唯佛自解余人不解名非佛法。此第一法即以受持此经及为他说为因。故说此二福德胜也。上来世亲释。竟依无著者彼说欲得证得法身中有二。上来明智相法身竟。此明为得福相至得法身住处也。谓外有疑曰。上说于真如理中无智相法身可得。又无法可说者。欲受持此经为欲得福耶。故如来为校量也。谓于如来言说法身若有诸受之者。能生福相至得法身。故若受持一四句者生福甚多。依等五义如论应详</p><p>须菩提‘于意云何须陀洹能作是念我得’须陀洹果不</p><p>述曰。依世亲说此下有二校量。合二为一文。于中二。初释疑次校量。释疑有三。一者约二乘以生疑。谓前说一切圣人以无为法得名。无为法中无说无取者。何故预流等云我能取自果。复云我得我证耶。第二疑云。若言无说无取者何故如来昔于燃灯佛所闻法。故从七地入八地耶。是即有说有取故。第三若无说无取者何故菩萨取庄严净国土等耶。此三种疑皆于前说一切圣人以无为法。而有差别故生疑也。不同前段校量中所生疑者皆于应不住相想以生也。就此破初疑之中有四。一一文中皆佛问次善现答。此为初问也。流有二种一者生死流。二者出世流类。若望生死即是逆流。若望出世便是预流也</p><p>须菩提言‘不也世尊何以故须陀洹名为入流而无所入不入色声香味触法’是名须陀洹</p><p>述曰。此第二善现答。初标答次释答也。此答意云。若正在观中证理之时。而无趣入不作趣入之解。故但为其立名称曰预流也。又若入色声香等是有分别。正证真理之时但冥契理。而不入色声等法。故名预流也。余皆据观中而答也。谓在观时不作能得能证解。故名与前无违也。上来世亲意。无著者上来四差别竟。此第五为修道胜得中无慢也。若八种住处之中第四离障碍住处中有十二。此初离慢障也。谓诸圣者云我能得果我是预流等。故名之为慢。今答若在观中之时而无我得之慢也。然前三果出观容起。第四果者烦恼定无所知容起也</p><p>须菩提‘于意云何斯陀含能作是念我得斯陀含果不须菩提言不也世尊何以故斯陀含名一往来而实无往来是名斯陀含须菩提于意云何阿那含能作是念我得阿那含果不须菩提言不也世尊何以故阿那含名为不来而实无不来是故名阿那含须菩提于意云何阿罗汉能作是念我得阿罗汉道不须菩提言不也世尊何以故实无有法名阿罗汉世尊若阿罗汉作是念我得阿罗汉道即为着我人’众生寿者</p><p>述曰。此后之三果皆应准前通释。然前三果之中皆应有即为着我人等译家略故无也就第四果中初佛问次善现答。中初正答阿罗汉。次善现引己为证令他信故</p><p>世尊佛说‘我得无诤三昧人中最为第一是第一离欲阿罗汉我不作是念我是离欲阿罗汉世尊我若作是念我得阿罗汉道世尊则不说须菩提是乐阿兰那行者以须菩提实无所行而名须菩提是乐阿’兰那行</p><p>述曰。此第二引证也。言我是第一离欲者谓能离烦恼障及定障故也。以是俱解脱故不同慧解脱但离烦恼障也。就引己为证之中有三。初明佛与胜名。次彰不念。后释成前义。若作是念我得阿罗汉等者。是则有我人等执还有烦恼不能无诤。世尊即不说我为无诤行也。以有诤故世尊说。即知我无不念得无诤行也</p><p>佛告须菩提‘于意云何如来昔在然灯佛所于法’有所得不</p><p>述曰。依世亲释此破第二疑也。于中初问次答。言然灯者即谓定光。谓释迦佛昔为菩萨之时。七地将满当尔摩纳仙人。闻定光佛欲来入城。遂从一女人买华将以散佛又表己之深敬。布发掩泥当。尔佛为说法即入八地。第三僧祇初也。其卖华女人闻言供佛遂不取钱。便共同愿。因此而来恒为夫妇作善知识即耶输也。谓外有疑曰。上言圣人以无为差别故无说无取。何故释迦于燃灯所而取法。定光复为说耶。今为破此疑故以为问也。言有所得者谓分别心妄所执法也。无所得者谓智证真时无彼分别之心所得法也。但言无彼分别心之所得名无所得。不遮智内冥真亦为所得也。此意云。佛于定光所闻法时无于分别所执有所得法。但智内冥真如于所执中都无所得。证智不可说不可取故亦无说无取也。故今问言佛于燃灯佛所智证于法时为有所得不</p><p>世尊如来‘在然灯佛所于法实’无所得</p><p>述曰。此第二答可知也。论云不取理实智者。谓不取者不分别之心执取也。理实智者谓以智证实理时。分别取执者都无所得也。世亲释竟。无著者此第五为不离佛出时。故离障住处十二中此第二离少闻障也。谓若行无所得名为多闻。若作有所得是少闻。然佛于定光佛不作分别取执有所得。故是离少闻障也</p><p>须菩提‘于意云何菩萨庄严’佛土不</p><p>述曰。依世亲此破第三疑也。谓有疑。曰无为法中既不可取不可说者。何故菩萨取庄严净佛国土。复云何受乐报佛取自法王身。复云何余世间复取是法王身耶。此中有二初破彼疑菩萨取庄严<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。次破疑佛取自法王身。初中有三。初佛问次善现答。后世尊示劝。此初问也。菩萨取庄严佛国土者。谓初地已上菩萨生报净土。随其分量于一一地见佛不同。自身有异既处净土之中。即是取自庄严净佛土。何故前言圣人以无为有其差别无说无取耶。今破此疑者。谓诸菩萨以无分别智内证真理庄严。故于外事形相之中即得七宝庄严。于内证庄严之时无说无取也。若于外事形相之中而言我庄严佛土者。此可为取。菩萨便是住色等境中。既证无相之庄严。何名取净土。故偈云智习唯识通。智习谓修习无分别智。唯识谓智相应净识。通者谓达真理。即真庄严也。故摄大乘解十八圆满净土中云。出世善根之所集起者。此说净因也。谓要发菩提心修行出世善根。积集长时即能证会。故名为因。又广大自在净识为相者。谓以净识为净土体也。心净即佛土净故也。又云大念慧行以为游路。大止妙观而为所乘。广大法味喜乐所持。空无相愿为所入门也。菩萨庄严佛土者。佛问善现云于外形相菩萨庄严佛土不</p><p>不也世尊‘何以故庄严佛土者即非庄严’是名庄严</p><p>述曰。第二答中初总答次别释。但诸菩萨要内证庄严。方住外七宝。非如观西方池水等名庄严也。有形相庄严即是住于色等境界中。故言庄严佛土者。谓内庄严也。即非庄严者非外形相庄严也。是名庄严者是无相无取真庄严也</p><p>是故须‘菩提诸菩萨摩诃萨应如是生清净心不应住色生心不应住声香味触法生心应无所住’而生其心</p><p>述曰。此第三示劝也。应如是生清净心者。谓应修习净智净识清净心。不应住色等生心者。谓不于外形相起庄严心。应无所住而生其心者。谓要以智证于无住。无住即无因也。无著释者。十八差别之中此为第七愿净佛土。离障住处十二之中第三为离小攀缘作念修道。故小攀缘者谓作有形相庄严净土。如求西方观日水等也</p><p>须菩提‘譬如有人身如须弥山王于意云何是身为’大不</p><p>述曰。此破第二取自法王身疑也。于中初问次答。谓有疑曰。前说圣人无为而有差别。无说无取。何故报身自受用法乐取自法王身。谓身无限遍周法界。故一切世间复取彼。云是法王身。为除此疑也。偈云如山王无取者。谓如须弥山居众山而彼<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>我是山王。众生有分别心自取彼为山王。报佛亦尔。已无分别心故自不言我是法王身。众生有分别故起分别云彼是法王。佛无分别心故不自取为法王身也</p><p>须菩提言‘甚大世尊何以故佛说非身’是名大身</p><p>述曰。此第二答也。佛说非身者谓非有分别身。是名大身者是无分别身也。无著释云。此为第八成就众生。又是离障住处中第四离舍众生障。故此意云。如来虽知不取形相名离小攀缘。然其报身广大无量。罗睺阿修罗王如须弥山。大众生尚不见其自体。何况欲界小众生。是则如来舍离众生不度也。为此故有此文</p><p>须菩提‘如恒河中所有沙数如是沙等恒河于意云何是诸恒河沙’宁为多不</p><p>述曰。依世亲释就大文第二重校量之中上来破疑竟。自下第二正校量中复二。初以财施校。次命施校。初中复二。初正校量次随说。是经已下释所以。前中有三。初世尊寄喻以问。次善现顺佛以答。第三如来正为校量。此初也。阿耨达池出四大河所以偏将恒河为喻者。阿含经说有四义。一者有多沙故。二者世间以为福故。谓将为净于彼求福故。三者经劫名不改故。四者佛近彼说法故也。如恒河中所有沙数者。谓取一恒河中沙也。谓方广深浅四十里为一恒河沙也。如是沙等恒河者谓以一恒河中沙。一一沙复作一恒河也。取此无量恒河中沙。一一沙是一佛世界。以此尔数恒河数三千大千世界以用布施。尚不如受持此经乃至一四句偈也。何以故。此少分受持功德与菩提为因。一切外缘所不能坏故。其财施者为生死因易可破坏王贼等所侵故</p><p>须菩提‘言甚多世尊但诸恒河尚多无数’何况其沙</p><p>述曰。此第二善现答也</p><p>须菩提我今实言‘告汝若有善男子善女人以七宝满尔所恒河沙数三千大千世界以用布施得福多不须菩提言甚多世尊佛告须菩提若善男子善女人于此经中乃至受持四句偈等为他人说而此福德’胜前福德</p><p>述曰。此第三佛正校量中有三。一佛问二须菩提答三佛校量也</p><p>复次须菩提‘随说是经乃至四句偈等当知此处一切世间<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗皆应供养如佛塔庙何况有人尽能受持读诵须菩提当知是人成就最上第一希有之法若是经典所在之处即为有佛若’尊重弟子</p><p>述曰。自下第二释所以也。于中有三复次。何以多财布施不如少受持耶。由释此意故有三复次也。谓一者在处处胜在人人尊故。二当何名此经下能摧二障故胜。三者三千大千已下明财施为染因法施为净因故胜。此即初也。于中复二。初明在处处胜。次明在人人尊。如佛塔庙者此是十方诸佛真法身故。谓碎身<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>但一化佛之体。此般若经一切诸佛真法身故也。依无著释者。此一段文即是十八差别中第九远离随顺外论散乱。故第四离障住处十二中第五离乐外论散乱也。谓令依此般若修学。不令习读外典籍故。文中有二。初以四种因缘显示此法胜异。次当何名此经下为对治如言而执义。就前四因缘中即为四。一者摄取福德如经得福多彼。二者天等供养如经随所有处等。三难作如经成就最上希有。四者起如来念如经则为有佛等</p><p>尔时须菩提‘白佛言世尊当何名此经我等云何奉持</p><p>述曰。依世亲此第二。复次释所以也。谓诸烦恼如山如石。而有金刚能破。或烦恼如金刚般若能除断故。或如彩画之金刚。广如无著释。谓由有此种种堪能故受持般若功德胜多财施也。于中初善现问次如来答。此初也</p><p>佛告须菩提‘是经名为金刚般若波罗蜜以是名字’汝当奉持</p><p>述曰。第。二如来答中初示名劝持次释所以</p><p>所以者何‘须菩提佛说般若波罗蜜即非般若’波罗蜜</p><p>述曰。此释中初明诸佛同说同赞。次显己不独有说。此初也。佛说般若波罗蜜者十方佛同说也。谓虽无分别而说亦有因巡。而谈如说但无分别取自法王非无因巡而有自体也。则非般若波罗蜜者非一佛独陈也。此意云。由般若是诸佛本母能出生诸佛。故诸佛同赞故。若有受持乃至四句者胜以多供养也</p><p>须菩提于意云何‘如来有所说法不须菩提白佛言世尊如’来无所说</p><p>述曰。此第二显己不独说。于中初佛问次善现答。问意云颇有一法如来独说耶。善现答云无</p><p>须菩提‘于意云何三千大千世界所有微尘是为多不</p><p>述曰。此第三复次释所以也。于中初释前受持福多所以。次转释疑。前中有二。初问次答。此初也。谓碎世界以作尘者。有其二喻。一者胜喻。谓因少受持便生多功德。世界者喻少持碎为尘者喻生多福。二者劣喻。如以财施故多烦恼因。谓由所受施人因此而起种种斗诤故。谓世界者喻财施。碎为尘者喻生长烦恼。世界既为尘因财施亦作染因也。今此意云。持法虽少生福甚多。财施虽多但增烦恼。故说虽多财施不及受持一四句也。故寄此意以为问也</p><p>须菩提言‘甚多世尊须菩提诸微尘如来说非微尘是名微尘如来说世界非世界’是名世界</p><p>述曰。此答中初顺佛称多。次释非如实。是微尘者谓碎世界以作尘。说非微尘者非如卫世等所执有实微尘也。谓但寄微尘以喻贪等。非即如言而有微尘故也。又释但借微尘以喻贪等。非即微尘是贪体也。是名微尘者谓是寄喻之微尘也。说世界者谓以世界喻财物施。非世界是贪等因。财施为贪因但借世界为喻故</p><p>须菩提‘于意云何可以三十二相见如来不不也世尊不可以三十二相得见如来何以故如来说三十二相即是非相是名’三十二相</p><p>述曰。此第二转释疑也。谓前所说受持经者。生福甚多。即谓其福德有相果故今破之。谓法身是如来非三十二相化身也。于中初问次答。说三十二相者谓化身。相即是非相者非法身相。是名三十二相者是化身三十二相也。上来依世亲释竟。依无著者经言大千世界已下此一段文十八差别中第十为色身及众生身抟取<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>破相应行即是离障住处中第六为离于影像相自在中无巧便。故此意云。众生于色身及名身抟取中无巧便故作一合相。今起方便破一合相故有此文也。然破中有二。一者破色身。二者破名身。色身有二。一者细谓微尘。如经所有微尘宁为多不。二者破粗色身。如经诸微尘如来说非微尘。破名身者如经说世界非世界。以名无形段。不可有其粗细。故以世界为喻也。如经可以三十二相等者。第十一为供养给侍如来故。又是第七为离不具足福资粮故。此意云。若欲供养如来求福资粮者。不应以相见第一义法身故也</p><p>须菩提‘若有善男子善女人以恒河沙等身命布施若复有人于此经中乃至受持四句偈等为他人说其福’甚多</p><p>述曰。依世亲释。上来以财校量竟。自下以身命校量。于中初正校量。次释福德多所以。此初也。无著释云。此第十二为远离利养及疲乏热恼故于精进若退若不发故。又离障碍住中此第八为离懈怠利养等乐味故。解云此说若有众生。乐欲味着懈怠。或味着利养不发精进。或曾起功德而复退失。为令远离此等故而以身命校量。意令进趣故也</p><p>尔时须菩提‘闻说是经深解义趣涕泪悲泣而白佛言希有世尊佛说如是甚深经典我从昔来所得慧眼未曾得闻’如是之经</p><p>述曰。世亲云自下释所以。于中有四一悲舍苦身闻法悲泪。二世尊若复下。明于此生信则生实相。三世尊是实相者下拂疑除病。四世尊我今得闻下进发信心。此为初也。谓须菩提闻说舍身忍苦。又闻此经深义能得菩提。喜叹自扬故怀悲泣也。无著释云。自此下有其三文。初悲苦舍身闻法伤感与世亲同。次若复有人下明发起精进生如义想。三我今得闻下为令在坐味着懈怠诸菩萨生惭愧故。此为初也</p><p>世尊若复‘有人得闻是经信心清净则生实相当知是人成就第一’希有功德</p><p>述曰。此第二文也。谓有闻经生信心者。当来定得无分别智。除妄分别证达二空名生实相。由如是故。虽复舍多身命不如受持也。以欲舍身恒轮生死非求慧行不趣菩提故也</p><p>世尊是实相者则是非相‘是故如来’说名实相</p><p>述曰。此第三拂疑除病也。是实相者谓无相为相也。即是非相者。谓则非是虚妄分别所执差别之相。说名实相者。谓无虚妄之相说名实相也。谓有闻说实相言故。谓是虚妄分别所执之相。今言不是故有此文也</p><p>世尊我今‘得闻如是经典信解受持不足为难若当来世后五百岁其有众生得闻是经信解受持是人则为’第一希有</p><p>述曰。此为第四进发信心。即是无著第三为令菩萨生惭愧也。谓说未恶世尚有众生能生实相。况今现在菩萨闻说般若而不进修。谓恶人信解乃可希奇。菩萨受持盖不足叹。故有此文也。就此文中。初善现问次如来答。问中有三。初标问次释后结。此初也</p><p>何以故‘此人无我相人相众生相’寿者相</p><p>述曰。此第二释中有二。世亲云。初明所取空次明能取空。子云此唯说法空也。无著云初明人空次明法空。离人家执故。此初也</p><p>所以者何‘我相即是非相人相众生相寿者相’即是非相</p><p>述曰。此第二明法空也</p><p>何以故离一切诸相则名诸佛</p><p>述曰。此第三结也。谓若有分别即有业生死起。既除分别之相妄想生死都无则名诸佛也。此意云。纵舍多身命非证理之因。若暂听经便是离相之福。谓因受持听闻故当证二无我理。既是胜因故多舍命之福也</p><p>金刚般若经赞述卷上</p><p>金刚般若经赞述 卷下</p><p>大乘 基撰</p><p>佛告须菩提‘如是如是若复有人得闻是经不惊不怖不畏当知是人’甚为希有</p><p>述曰。此第二佛答。初标次释。此初也。世亲意云。惊谓惊恐。谓有众生恐此经典非正道行故。怖者谓怖惧。依般若修学不能断疑故。畏者谓由惊怖故毕竟不肯修学也。若有远离彼处者名为不惊不怖不畏也。无著云。谓声闻乘中世尊说有法及有空。于听闻此经时闻法无有故惊。闻空无有故怖。思量时于二不有理中不能相应故畏。更有别释。为三种无自性故应知。谓相生第一义等无自性故。解云谓于遍计所执无体相故名不惊。于依他起无自然生性故名不怖。于圆成实中无彼所执人法故不畏也</p><p>何以故须菩提如来说第一波罗蜜即非第一波罗蜜是名第一波罗蜜</p><p>述曰。此第二赞释胜也。世亲云。如来说第一波罗蜜者。谓十方诸佛同说赞能为大因故名为第一。显此经胜余经也。非第一波罗蜜者。谓非余人所得也。无分别智证无我理。唯十方佛得余人不得。故是名第一波罗蜜者唯佛所得也。无著释云。第一波罗蜜者。谓般若于余五中最胜故也</p><p>须菩提忍辱波罗蜜如来说非忍辱波罗蜜</p><p>述曰。世亲云。上来大文第二段竟。自下第三段文第四校量。于中初释疑。次正校量。释疑中有三。一者于前舍身命以生疑。谓有疑曰。向说彼身苦以彼舍身苦身而果报福是劣。若尔依此法门受持演说诸菩萨行苦行。彼苦行亦是苦果。云何此法门不成苦果。此意云。前说舍身命苦还得苦果身得福即劣。若尔者菩萨为此法门故行诸苦行亦感苦身果。何福即胜。谓如萨陀波仑菩萨。于昙无竭菩萨所。求般若波罗蜜故打骨出髓而行供养。是苦得福应少。今答意。若为慧行而舍身得福即多。若虽舍身不行慧行求菩提者。生死因故其福下劣也。就此文中大文有四。一者正破前疑。二者指事以显。三者菩萨应离一切已下引初地菩萨为示无住理。四者菩萨为利益下劝益众生住二空理。此初也。忍辱波罗蜜者。谓十方佛同得故或求慧行之忍辱也。如来说非者。非是余人所得故或非求慧行故不名波罗蜜也。谓前说舍身命者非慧行故不名波</p></div>"
}]