[
    {
        "title": "金刚般若波罗蜜经全文 【鸠摩罗什译】",
        "date": "2014-02-11",
        "author": "鸠摩罗什",
        "html": "<div class=\"B1_text\"><h2>炉香赞</h2><p>炉香乍热  法界蒙熏  诸佛海会悉遥闻</p><p>随处结祥云  诚意方殷  诸佛现全身</p><p>南无香云盖菩萨摩诃萨（三称）</p><p>南无本师释迦牟尼佛（三称）</p><h2>奉请八金刚</h2><p>奉请青除灾金刚  奉请辟毒金刚</p><p>奉请黄随求金刚  奉请白净水金刚</p><p>奉请赤声火金刚  奉请定持灾金刚</p><p>奉请紫贤金刚  奉请大神金刚</p><h2>奉请四菩萨</h2><p>奉请金刚眷菩萨  奉请金刚索菩萨</p><p>奉请金刚爱菩萨  奉请金刚语菩萨</p><h2>发愿文</h2><p>稽首<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>尊  归依十方佛</p><p>我今发宏愿  持此<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a></p><p>上报四重恩  下济三涂苦</p><p>若有见闻者  悉发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a></p><p>尽此一报身  同生极乐国</p><h2>云何梵</h2><p>云何得长寿  金刚不坏身</p><p>复以何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>  得大坚固力</p><p>云何于此经  究竟到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a></p><p>愿佛开微密  广为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>说</p><h2>开经偈</h2><p>无上甚深微妙法，百千万劫难遭遇</p><p>我今见闻得<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，愿解如来真实义</p><h2><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a></h2><p><strong>姚秦·<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师·鸠摩罗什 译</strong></p><p>如是我闻。一时，佛在舍卫国祇树给孤独园，与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱。尔时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>食时，著衣持钵，入舍卫大城乞食。于其城中，次第乞已，还至本处。饭食讫，收衣钵，洗足已，敷座而坐。</p><p>时，长老须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>在大众中即从座起，偏袒右肩，右膝著地，合掌恭敬而白佛言：「希有！世尊！如来善护念诸菩萨，善付嘱诸菩萨。世尊！善男子、善女人，发阿耨多罗三藐三菩提心，<font>云</font>何应住？云何降伏其心？」</p><p>佛言：「善哉，善哉。须菩提！如汝所说：如来善护念诸菩萨，善付嘱诸菩萨，汝今谛听！当为汝说：善男子、善女人，发阿耨多罗三藐三菩提心，应如是住，如是降伏其心。」</p><p>「唯<font>然</font>。世尊！愿乐欲闻。」</p><p>佛告须菩提：「诸菩萨摩诃萨应如是降伏其心！所有一切众生之类：若卵生、若胎生、若湿生、若化生；若有色、若无色；若有想、若无想、若非有想非无想，我皆令入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>而灭度之。如是灭度无量无数无边众生，实无众生得灭度者。何以故？须菩提！若菩萨有我相、人相、众生相、寿者相，即非菩萨。</p><p>「复次，须菩提！菩萨于法，应无所住，行于<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，所谓不住色布施，不住声香味触法布施。须菩提！菩萨<font>应如是布施</font>，不住于相。何以故？若菩萨不住相布施，其福德不可思量。</p><p>「须菩提！于意云何？东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可思量不？」</p><p>「不也，世尊！」</p><p>「须菩提！南西北方四维上下虚空可思量不？」</p><p>「不也，世尊！」</p><p>「须菩提！菩萨无住相布施，福德亦复如是不可思量。须菩提！菩萨但应如所教住。</p><p>「须菩提！于意云何？可以身相见如来不？」</p><p>「不也，世尊！不可以身相得见如来。何以故？如来所说身相，即非身相。」</p><p>佛告须菩提：「凡所有相，皆是虚妄。若见诸相非相，则见如来。」</p><p>须菩提白佛言：「世尊！颇有众生，得闻如是言说章句，生实信不？」</p><p>佛告须菩提：「莫作是说。如来灭后，后五百岁，有持戒修福者，于此章句能生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，以此为实，当知是人不于一佛二佛三四五佛而种善根，已于无量千万佛所种诸善根，闻是章句，乃至一念生净信者，须菩提！如来悉知悉见，是诸众生得如是无量福德。何以故？是诸众生无复我相、人相、众生相、寿者相。</p><p>「无<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>，亦无非法相。何以故？是诸众生若心取相，即为著我人众生寿者。</p><p>「若取法相，即著我人众生寿者。何以故？若取非法相，即著我人众生寿者，是故不应取法，不应取非法。以是义故，如来常说：汝等比丘，知我<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，如筏喻者，法尚应舍，何况非法。</p><p>「须菩提！于意云何？如来得阿耨多罗三藐三菩提耶？如来有所说法耶？」</p><p>须菩提言：「如我解佛所说义，无有定法名阿耨多罗三藐三菩提，亦无有定法，如来可说。何以故？如来所说法，皆不可取、不可说、非法、非非法。所以者何？一切贤圣，皆以<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>而有差别。」</p><p>「须菩提！于意云何？若人满三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝以用布施，是人所得福德，宁为多不？」</p><p>须菩提言：「甚多，世尊！何以故？是福德即非福德性，是故如来说福德多。」</p><p>「若复有人，于此经中受持，乃至四句偈等，为他人说，其福胜彼。何以故？须菩提！一切诸佛，及诸佛阿耨多罗三藐三菩提法，皆从此经出。须菩提！所谓佛、法者，即非佛、法。</p><p>「须菩提！于意云何？须陀洹能作是念：『我得须陀洹果』不？」</p><p>须菩提言：「不也，世尊！何以故？须陀洹名为入流，而无所入，不入色声香味触法，是名须陀洹。」</p><p>「须菩提！于意云何？斯陀含能作是念：『我得斯陀含果』不？」</p><p>须菩提言：「不也，世尊！何以故？斯陀含名一往来，而实无往来，是名斯陀含。」</p><p>「须菩提！于意云何？阿那含能作是念：『我得阿那含果』不？」</p><p>须菩提言：「不也，世尊！何以故？阿那含名为不来，而实无不来，<font>是故名阿那含</font>。」</p><p>「须菩提！于意云何？阿罗汉能作是念：『我得阿罗汉道』不？」</p><p>须菩提言：「不也，世尊！何以故？<font>实无有法</font>名阿罗汉。世尊！若阿罗汉作是念：『我得阿罗汉道』，即为著我人众生寿者。世尊！佛说我得无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，人中最为第一，是第一<font>离欲阿罗汉</font>。世尊！我不作是念：『我是<font>离欲阿罗汉</font>』。世尊！我若作是念：『我得阿罗汉道』，世尊则不说须菩提是乐阿兰那<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>！以须菩提实无所行，而名须菩提是乐阿兰那行。」</p><p>佛告须菩提：「于意云何？如来昔在<font>燃</font>灯佛所，于法有<font>所得不</font>？」</p><p>「不也，世尊！如来在<font>燃</font>灯佛所，于法实无所得。」</p><p>「须菩提！于意云何？菩萨<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛土不？」</p><p>「不也，世尊！何以故？庄严佛土者，则非庄严，是名庄严。」</p><p>「是故须菩提，诸菩萨摩诃萨应如是生清净心，不应住色生心，不应住声香味触法生心，应无所住而生其心。</p><p>「须菩提！譬如有人，身如须弥山王，于意云何？是身为大不？」</p><p>须菩提言：「甚大，世尊！何以故？佛说非身，是名大身。」</p><p>「须菩提！如恒河中所有沙数，如是沙等恒河，于意云何？是诸恒河沙宁为多不？」</p><p>须菩提言：「甚多，世尊！但诸恒河尚多无数，何况其沙！」</p><p>「须菩提！我今实言告汝：若有善男子、善女人，以七宝满尔所恒河沙数三千大千世界，以用布施，得福多不？」</p><p>须菩提言：「甚多，世尊！」</p><p>佛告须菩提：「若善男子、善女人，于此经中，乃至受持四句偈等，为他人说，而此福德胜前福德。复次，须菩提！随说是经，乃至四句偈等，当知此处，一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>、天、人、阿修罗，皆应<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，如佛塔庙，何况有人尽能受持读诵。须菩提！当知是人成就最上第一希有之法，若是经典所在之处，则为有佛，若尊重<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。」</p><p>尔时，须菩提白佛言：「世尊！当何名此经？我等云何奉持？」</p><p>佛告须菩提：「是经名为《金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜》，以是名字，汝当奉持。所以者何？须菩提！佛说般若波罗蜜，<font>即非般若</font>波罗蜜，是名般若波罗蜜。须菩提！于意云何？如来有所说法不？」</p><p>须菩提白佛言：「世尊！如来无所说。」</p><p>「须菩提！于意云何？三千大千世界所有微尘是为多不？」</p><p>须菩提言：「甚多，世尊！」</p><p>「须菩提！诸微尘，如来说非微尘，是名微尘。如来说：世界，非世界，是名世界。</p><p>「须菩提！于意云何？可以三十二相见如来不？」</p><p>「不也，世尊！不可以三十二相得见如来。何以故？如来说：三十二相，即是非相，<font>是名三十二相</font>。」</p><p>「须菩提！若有善男子、善女人，以恒河沙等身命布施；若复有人，于此经中，乃至受持四句偈等，为他人说，其福甚多！」</p><p>尔时，须菩提闻说是经，深解义趣，涕泪悲泣，而白佛言：「希有，世尊！佛说如是甚深经典，我从昔来所得慧眼，未曾得闻如是之经。世尊！若复有人得闻是经，信心清净，则生实相，当知是人，成就第一希有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。世尊！是实相者，即是非相，是故如来说名实相。世尊！我今得闻如是经典，信解受持不足为难，若当来世，后五百岁，其有众生，得闻是经，信解受持，是人则为第一希有。何以故？<font>此人<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>相</font>、无人相、无众生相、无寿者相。所以者何？我相即是非相，人相、众生相、寿者相即是非相。何以故？离一切诸相，即名诸佛。」</p><p>佛告须菩提：「如是！如是！若复有人，得闻是经，不惊、不怖、不畏，当知是人甚为希有。何以故？须菩提！如来说：<font>第一波罗蜜</font>，即非<font>第一波罗蜜</font>，是名<font>第一波罗蜜</font>。须菩提！忍辱波罗蜜，如来说非忍辱波罗蜜，是名忍辱波罗蜜。何以故？须菩提！如我昔为歌利王割截身体，我于尔时，无我相、无人相、无众生相、无寿者相。何以故？我于往昔节节支解时，若有我相、人相、众生相、寿者相，应生嗔恨。须菩提！又念过去于五百世作忍辱仙人，于尔所世，无我相、无人相、无众生相、无寿者相。是故须菩提！菩萨应离一切相，发阿耨多罗三藐三菩提心，不应住色生心，不应住声香味触法生心，应生无所住心。若心有住，即为非住。</p><p>「是故佛说：菩萨心不应住色布施。须菩提！菩萨为利益一切众生故，<font>应如是布施</font>。如来说：一切诸相，即是非相。又说：一切众生，即非众生。须菩提！如来是真语者、实语者、如语者、不诳语者、不异语者。</p><p>「须菩提！如来所得法，此法无实无虚。须菩提！若菩萨心住于法而行布施，如人入暗，则无所见；若菩萨心不住法而行布施，如人有目，日光明照，见种种色。</p><p>「须菩提！当来之世，若有善男子、善女人，能于此经受持读诵，则为如来以佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>，悉知是人，悉见是人，皆得成就无量无边功德。</p><p>「须菩提！若有善男子、善女人，初日分以恒河沙等身布施，中日分复以恒河沙等身布施，后日分亦以恒河沙等身布施，如是无量百千万亿劫以身布施；若复有人，闻此经典，信心不逆，其福胜彼，何况书写、受持、读诵、为人解说。</p><p>「须菩提！以要言之，是经有不可思议、不可称量、无边功德。如来为发大乘者说，为发最上乘者说。若有人能受持读诵，广为人说，如来悉知是人，悉见是人，皆成就不可量、不可称、无有边、不可思议功德，如是人等，则为荷担如来阿耨多罗三藐三菩提。何以故？须菩提！若乐小法者，著我见、人见、众生见、寿者见，即于此经，不能听受读诵、为人解说。</p><p>「须菩提！在在处处，若有此经，一切世间、天、人、阿修罗，所应供养；当知此处，即为是塔，皆应恭敬，作礼围绕，以诸华香而散其处。</p><p>「复次，须菩提！若善男子、善女人，受持读诵此经，若为人轻贱，是人先世罪业，应堕恶道，以今世人轻贱故，先世罪业即为消灭，当得阿耨多罗三藐三菩提。</p><p>「须菩提！我念过去无量阿僧祇劫，于<font>燃</font>灯佛前，得值八百四千万亿那由他诸佛，悉皆供养承事，无空过者；若复有人，于后末世，能受持读诵此经，所得功德，于我所供养诸佛功德，百分不及一，千万亿分、乃至算数譬喻所不能及。</p><p>「须菩提！若善男子、善女人，于后末世，有受持读诵此经，所得功德，我若具说者，或有人闻，心即狂乱，狐疑不信。须菩提！当知是经义不可思议，<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>亦不可思议。」</p><p>尔时，须菩提白佛言：「世尊！善男子、善女人，发阿耨多罗三藐三菩提心，云何应住？云何降伏其心？」</p><p>佛告须菩提：「善男子、善女人，发阿耨多罗三藐三菩提心者，<font>当生如是心</font>，我应灭度一切众生。灭度一切众生已，而无有一众生实灭度者。何以故？须菩提，若菩萨有我相、人相、众生相、寿者相，则非菩萨。所以者何？须菩提！<font>实无有法</font>发阿耨多罗三藐三菩提心者。</p><p>「须菩提！于意云何？如来于<font>燃</font>灯佛所，有法得阿耨多罗三藐三菩提不？」</p><p>「不也，世尊！如我解佛所说义，佛于<font>燃</font>灯佛所，无有法得阿耨多罗三藐三菩提。」</p><p>佛言：「如是，如是。须菩提！<font>实无有法</font>如来得阿耨多罗三藐三菩提。须菩提！若有法如来得阿耨多罗三藐三菩提者，<font>燃灯佛即不与我授记</font>：『汝于来世，当得作佛，号释迦牟尼。』以<font>实无有法</font>得阿耨多罗三藐三菩提，是故<font>燃</font>灯佛与我授记，作是言：『汝于来世，当得作佛，号释迦牟尼。』何以故？如来者，即诸法如义。</p><p>「若有人言：如来得阿耨多罗三藐三菩提。须菩提！<font>实无有法</font>，佛得阿耨多罗三藐三菩提。须菩提！如来所得阿耨多罗三藐三菩提，于是中无实无虚。是故如来说：一切法皆是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。须菩提！所言一切法者，即非一切法，是故名一切法。</p><p>「须菩提！譬如人身长大。」</p><p>须菩提言：「世尊！如来说：人身长大，即为非大身，是名大身。」</p><p>「须菩提！菩萨亦如是。若作是言：『我当灭度无量众生』，则不名菩萨。何以故？须菩提！<font>实无有法</font>名为菩萨。是故佛说：一切法无我、无人、无众生、无寿者。须菩提！若菩萨作是言：『我当庄严佛土』，是不名菩萨。何以故？如来说：庄严佛土者，即非庄严，是名庄严。须菩提！若菩萨通达无我、法者，如来说名真是菩萨。</p><p>「须菩提！于意云何？如来有肉眼不？」</p><p>「如是，世尊！如来有肉眼。」</p><p>「须菩提！于意云何？如来有天眼不？」</p><p>「如是，世尊！如来有天眼。」</p><p>「须菩提！于意云何？如来有慧眼不？」</p><p>「如是，世尊！如来有慧眼。」</p><p>「须菩提！于意云何？如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不？」</p><p>「如是，世尊！如来有法眼。」</p><p>「须菩提！于意云何？如来有佛眼不？」</p><p>「如是，世尊！如来有佛眼。」</p><p>「须菩提！于意云何？如恒河中所有沙，佛说是沙不？」</p><p>「如是，世尊！如来说是沙。」</p><p>「须菩提！于意云何？如一恒河中所有沙，有如是沙等恒河，是诸恒河所有沙数，佛世界如是，宁为多不？」</p><p>「甚多，世尊！」</p><p>佛告须菩提：「尔所国土中，所有众生，若干种心，如来悉知。何以故？如来说：诸心皆为非心，是名为心。所以者何？须菩提！过去心不可得，现在心不可得，未来心不可得。</p><p>「须菩提！于意云何？若有人满三千大千世界七宝以用布施，是人以是因缘，得福多不？」</p><p>「如是，世尊！此人以是因缘，得福甚多。」</p><p>「须菩提！若福德有实，如来不说得福德多；以福德无故，如来说得福德多。</p><p>「须菩提！于意云何？佛可以具足色身见不？」</p><p>「不也，世尊！如来不应以具足色身见。何以故？如来说：具足色身，即非具足色身，是名具足色身。」</p><p>「须菩提！于意云何？如来可以具足诸相见不？」</p><p>「不也，世尊！如来不应以具足诸相见。何以故？如来说：诸相具足，即非具足，是名诸相具足。」</p><p>「须菩提！汝勿谓如来作是念：『我当有所说法。』莫作是念，何以故？若人言：如来有所说法，即为谤佛，不能解我所说故。须菩提！说法者，无法可说，是名说法。」</p><p>尔时，慧命须菩提白佛言：「世尊！颇有众生，于未来世，闻说是法，生信心不？」</p><p>佛言：「须菩提！彼非众生，非不众生。何以故？须菩提！众生众生者，如来说非众生，是名众生。」</p><p>须菩提白佛言：「世尊！佛得阿耨多罗三藐三菩提，为<font>无所得耶</font>？」</p><p>佛言：「如是，如是。须菩提！我于阿耨多罗三藐三菩提乃至无有少法可得，是名阿耨多罗三藐三菩提。</p><p>「复次，须菩提！是法平等，无有高下，是名阿耨多罗三藐三菩提；以无我、无人、无众生、无寿者，修一切善法，即得阿耨多罗三藐三菩提。须菩提！所言善法者，如来说非善法，是名善法。</p><p>「须菩提！若三千大千世界中所有诸须弥山王，如是等七宝聚，有人持用布施；若人以此《般若波罗蜜经》，乃至四句偈等，<font>受持读诵、为</font>他人说，于前福德百分不及一，百千万亿分，乃至算数譬喻所不能及。</p><p>「须菩提！于意云何？汝等勿谓如来作是念：『我当度众生。』须菩提！莫作是念。何以故？实无有众生如来度者，若有众生如来度者，如来即有我人众生寿者。须菩提！如来说：『有我者，即非有我，而凡夫之人以为有我。』须菩提！凡夫者，如来说<font>即非凡夫，是名凡夫</font>。</p><p>「须菩提！于意云何？可以三十二相观如来不？」</p><p>须菩提言：「如是！如是！以三十二相观如来。」</p><p>佛言：「须菩提！若以三十二相观如来者，转轮圣王即是如来。」</p><p>须菩提白佛言：「世尊！如我解佛所说义，不应以三十二相观如来。」</p><p>尔时，世尊而说偈言：</p><p>「若以色见我　以音声求我</p><p>是人行邪道　不能见如来</p><p>「须菩提！<font>汝若作是念</font>：『如来不以具足相故，得阿耨多罗三藐三菩提。』须菩提！莫作是念：『如来不以具足相故，得阿耨多罗三藐三菩提。』</p><p>「须菩提！<font>汝若作是念</font>，发阿耨多罗三藐三菩提心者，说诸法断灭。莫作是念！何以故？发阿耨多罗三藐三菩提心者，于法不说断灭相。</p><p>「须菩提！若菩萨以满恒河沙等世界七宝，持用布施；若复有人知一切法无我，得成于忍，此菩萨胜前<font>菩萨所得功德</font>。何以故？须菩提！以诸菩萨不受福德故。」</p><p>须菩提白佛言：「世尊！云何菩萨不受福德？」</p><p>「须菩提！菩萨所作福德，不应贪著，是故说不受福德。</p><p>「须菩提！若有人言：如来若来若去、若坐若卧，是人不解我所说义。何以故？如来者，无所从来，亦无所去，故名如来。</p><p>「须菩提！若善男子、善女人，以三千大千世界碎为微尘，于意云何？是微尘众宁为多不？」</p><p>「须菩提言：甚多，世尊！何以故？若是微尘众实有者，佛即不说是微尘众，所以者何？佛说：微尘众，即非微尘众，是名微尘众。世尊！如来所说三千大千世界，即非世界，是名世界。何以故？若世界实有者，即是一合相。如来说：一合相，即非一合相，是名一合相。」</p><p>「须菩提！一合相者，即是不可说，但凡夫之人贪著其事。</p><p>「须菩提！若人言：佛说我见、人见、众生见、寿者见。须菩提！于意云何？是人解我所说义不？」</p><p>「不也！世尊！<font>是人不解如来</font>所说义。何以故？世尊说：我见、人见、众生见、寿者见，即非我见、人见、众生见、寿者见，是名我见、人见、众生见、寿者见。」</p><p>「须菩提！发阿耨多罗三藐三菩提心者，于一切法，应如是知，如是见，如是信解，不生法相。须菩提！所言法相者，如来说即非法相，是名法相。</p><p>「须菩提！若有人以满无量阿僧祇世界七宝持用布施，若有善男子、善女人，发菩提心者，持于此经，乃至四句偈等，受持读诵，为人演说，其福胜彼。云何为人演说，不取于相，如如不动。何以故？</p><p>「一切有为法　如梦幻泡影</p><p>如露亦如电　应作如是观」</p><p>佛说是经已，长老须菩提及诸比丘、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞、优婆夷、一切世间、天、人、阿修罗，闻佛所说，皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，信受奉行。</p></div>"
    },
    {
        "title": "能断金刚般若波罗蜜经 【玄奘大师译】",
        "date": "2014-02-11",
        "author": "玄奘大师",
        "html": "<div class=\"B1_text\"><p><img alt=\"\"src=\"https:style=\"width:363px;height:225px\"title=\"&#x80FD;&#x65AD;&#x91D1;&#x521A;&#x822C;&#x82E5;&#x6CE2;&#x7F57;&#x871C;&#x7ECF;\"/></p><h2>能断<a href=\"/fojing/jingangjing/\"class=\"keylink\"target=\"_blank\">能断金刚般若波罗蜜经</a></h2><p>唐<a href=\"/remen/sanzang.html\"class=\"keylink\"target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>如是我闻：一时，薄伽梵在室罗筏住誓多林给孤独园，与大苾刍众千二百五十人俱。</p><p>尔时，<a href=\"/remen/shizun.html\"class=\"keylink\"target=\"_blank\">世尊</a>于日初分，整理常服，执持衣钵，入室罗筏大城乞食。</p><p>时，薄伽梵于其城中，行乞食已，出还本处。饭食讫，收衣钵，洗足已，于食后时敷如常座，结跏趺坐，端身正愿，住对面念。</p><p>时，诸苾刍来诣佛所，到已<a href=\"/remen/dl.html\"class=\"keylink\"target=\"_blank\">顶礼</a>世尊双足，右绕三匝，退坐一面。具寿善现亦于如是众会中坐。</p><p>尔时，众中具寿善现从座而起，偏袒一肩，右膝著地，合掌恭敬而白佛言：“希有，世尊！乃至如来、应、正等觉，能以最胜摄受，摄受诸菩萨摩诃萨；乃至如来、应、正等觉，能以最胜付嘱，付嘱诸菩萨摩诃萨。世尊，诸有发趣菩萨乘者，应云何住？云何<a href=\"/remen/xiuxing.html\"class=\"keylink\"target=\"_blank\">修行</a>？云何摄伏其心？”</p><p>作是语已，尔时，世尊告具寿善现曰：“善哉！善哉！善现，如是，如是，如汝所说：乃至如来、应、正等觉，能以最胜摄受，摄受诸菩萨摩诃萨；乃至如来、应、正等觉，能以最胜付嘱，付嘱诸菩萨摩诃萨。是故，善现，汝应谛听极善作意，吾当为汝分别解说，诸有发趣菩萨乘者，应如是住，如是修行，如是摄伏其心。”</p><p>具寿善现白佛言：“如是，如是，世尊，愿乐欲闻！”</p><p>佛言：“善现，诸有发趣菩萨乘者，应当发趣如是之心：‘所有诸有情，有情摄所摄——若卵生、若胎生、若湿生、若化生、若有色、若无色、若有想、若无想、若非有想非无想，乃至有情界施设所施设，如是一切，我当皆令于无余依妙<a href=\"/remen/niepan.html\"class=\"keylink\"target=\"_blank\">涅槃</a>界而般涅槃。虽度如是无量有情令灭度已，而无有情得灭度者。’何以故？善现，若诸菩萨摩诃萨有情想转，不应说名菩萨摩诃萨。所以者何？善现，若诸菩萨摩诃萨，不应说言有情想转，如是命者想、士夫想、补特伽罗想、意生想、摩纳婆想、作者想、受者想转，当知亦尔。何以故？善现，无有少法名为发趣菩萨乘者。</p><p>“复次，善现，若菩萨摩诃萨不住于事应行<a href=\"/remen/bushi.html\"class=\"keylink\"target=\"_blank\">布施</a>，都无所住应行布施，不住于色应行布施，不住声、香、味、触、法应行布施。善现，如是菩萨摩诃萨如不住相想应行布施。何以故？善现，若菩萨摩诃萨都无所住而行布施，其福德聚不可取量。”</p><p>佛告善现：“于汝意云何？东方<a href=\"/remen/xukong.html\"class=\"keylink\"target=\"_blank\">虚空</a>可取量不？”</p><p>善现答言：“不也，世尊。”</p><p>“善现，如是南西北方、四维、上下，周遍十方，一切世界虚空可取量不？”</p><p>善现答言：“不也，世尊。”</p><p>佛言：“善现，如是，如是，若菩萨摩诃萨都无所住而行布施，其福德聚不可取量亦复如是。善现，菩萨如是如不住相想应行布施。”</p><p>佛告善现：“于汝意云何？可以诸相具足观如来不？”</p><p>善现答言：“不也，世尊。不应以诸相具足观于如来。何以故？如来说诸相具足即非诸相具足。”</p><p>说是语已，佛复告具寿善现言：“善现，乃至诸相具足皆是虚妄，乃至非相具足皆非虚妄，如是以相非相应观如来。”</p><p>说是语已，具寿善现复白佛言：“世尊，颇有有情于当来世，后时、后分、后五百岁、<a href=\"/remen/zhengfa.html\"class=\"keylink\"target=\"_blank\">正法</a>将灭时、分转时，闻说如是色经典句生实想不？”</p><p>佛告善现：“勿作是说：‘颇有有情，于当来世后时、后分、后五百岁、正法将灭时、分转时，闻说如是色经典句，生实想不？’然复，善现，有菩萨摩诃萨于当来世，后时、后分、后五百岁、正法将灭时、分转时，具足尸罗，具德具慧。</p><p>“复次，善现，彼菩萨摩诃萨非于一佛所承事<a href=\"/remen/gongyang.html\"class=\"keylink\"target=\"_blank\">供养</a>，非于一佛所种诸善根。然复，善现，彼菩萨摩诃萨于其非一、百、千佛所承事供养，于其非一、百、千佛所种诸善根，乃能闻说如是色经典句，当得一净<a href=\"/remen/xinxing1.html\"class=\"keylink\"target=\"_blank\">信心</a>。善现，如来以其佛智悉已知彼，如来以其佛眼悉已见彼。善现，如来悉已觉彼一切有情，当生无量无数福聚，当摄无量无数福聚。何以故？善现，彼菩萨摩诃萨<a href=\"/remen/wuwo.html\"class=\"keylink\"target=\"_blank\">无我</a>想转、无有情想、无命者想、无士夫想、无补特伽罗想、无意生想、无摩纳婆想、无作者想、无受者想转。善现，彼菩萨摩诃萨无法想转，无非法想转，无想转亦无非想转。所以者何？善现，若菩萨摩诃萨有法想转，彼即应有<a href=\"/remen/wozhi.html\"class=\"keylink\"target=\"_blank\">我执</a>、有情执、命者执、补特伽罗等执；若有非法想转，彼亦应有我执、有情执、命者执、补特伽罗等执。何以故？善现，不应取法，不应取非法，是故如来密意而说筏喻法门。诸有智者，法尚应断，何况非法！”</p><p>佛复告具寿善现言：“善现，于汝意云何？颇有少法，如来、应、正等觉<a href=\"/remen/zhengde.html\"class=\"keylink\"target=\"_blank\">证得</a>阿耨多罗三藐三<a href=\"/remen/puti.html\"class=\"keylink\"target=\"_blank\">菩提</a>耶？颇有少法，如来、应、正等觉是所说耶？”</p><p>善现答言：“世尊，如我解佛所说义者，无有少法，如来、应、正等觉证得阿耨多罗三藐三菩提，亦无有少法，是如来、应、正等觉所说。何以故？世尊，如来、应、正等觉所证、所说、所思惟法，皆不可取，不可宣说，非法，非非法。何以故？以诸贤圣补特伽罗皆是无为之所显故。”</p><p>佛告善现：“于汝意云何？若善男子或善女人，以此三千<a href=\"/remen/daqianshijie.html\"class=\"keylink\"target=\"_blank\">大千世界</a>盛满七宝持用布施，是善男子或善女人，由此<a href=\"/remen/yinyuan1.html\"class=\"keylink\"target=\"_blank\">因缘</a>所生福聚宁为多不？”</p><p>善现答言：“甚多，世尊！甚多，善逝！是善男子或善女人，由此因缘所生福聚其量甚多。何以故？世尊，福德聚福德聚者，如来说为非福德聚，是故如来说名福德聚福德聚。”</p><p>佛复告善现言：“善现，若善男子或善女人，以此三千大千世界盛满七宝持用布施；若善男子或善女人，于此法门乃至四句伽陀，<a href=\"/remen/shouchi.html\"class=\"keylink\"target=\"_blank\">受持</a>、读诵、究竟通利，及广为他宣说开示、如理作意，由是因缘所生福聚，甚多于前无量无数。何以故？一切如来、应、正等觉阿耨多罗三藐三菩提皆从此经出，诸佛世尊皆从此经生。所以者何？善现，诸<a href=\"/remen/fofa.html\"class=\"keylink\"target=\"_blank\">佛法</a>诸佛法者，如来说为非诸佛法，是故如来说名诸佛法诸佛法。”</p><p>佛告善现：“于汝意云何？诸预流者颇作是念‘我能证得预流果’不？”</p><p>善现答言：“不也，世尊。诸预流者不作是念‘我能证得预流之果’。何以故？世尊，诸预流者无少所预，故名预流；不预色、声、香、味、触、法，故名预流。世尊，若预流者作如是念‘我能证得预流之果’，即为执我、有情、命者、士夫、补特伽罗等。”</p><p>佛告善现：“于汝意云何？诸一来者颇作是念‘我能证得一来果’不？”</p><p>善现答言：“不也，世尊。诸一来者不作是念‘我能证得一来之果’。何以故？世尊，以无少法证一来性，故名一来。”</p><p>佛告善现：“于汝意云何？诸不还者颇作是念‘我能证得不还果’不？”</p><p>善现答言：“不也，世尊。诸不还者不作是念‘我能证得不还之果’。何以故？世尊，以无少法证不还性，故名不还。”</p><p>佛告善现：“于汝意云何？诸阿罗汉颇作是念‘我能证得阿罗汉’不？”</p><p>善现答言：“不也，世尊。诸阿罗汉不作是念‘我能证得阿罗汉性’。何以故？世尊，以无少法名阿罗汉，由是因缘名阿罗汉。世尊，若阿罗汉作如是念‘我能证得阿罗汉性’，即为执我、有情、命者、士夫、补特伽罗等。所以者何？世尊，如来、应、正等觉说我得无诤住最为第一。世尊，我虽是阿罗汉永离贪欲，而我未曾作如是念‘我得阿罗汉永离贪欲’。世尊，我若作如是念‘我得阿罗汉永离贪欲者’，如来不应记说我言：‘善现，善男子得无诤住最为第一’。以都无所住，是故如来说名无诤住无诤住。”</p><p>佛告善现：“于汝意云何？如来昔在燃灯如来、应、正等觉所，颇于少法有所取不？”</p><p>善现答言：“不也，世尊。如来昔在燃灯如来、应、正等觉所，都无少法而有所取。”</p><p>佛告善现：“若有菩萨作如是言：‘我当成办佛土<a href=\"/remen/gongde.html\"class=\"keylink\"target=\"_blank\">功德</a><a href=\"/remen/zhuangyan.html\"class=\"keylink\"target=\"_blank\">庄严</a>。’如是菩萨非真实语。何以故？善现，佛土功德庄严佛土功德庄严者，如来说非庄严，是故如来说名佛土功德庄严佛土功德庄严。是故，善现，菩萨如是都无所住应生其心，不住于色应生其心，不住非色应生其心，不住声、香、味、触、法应生其心，不住非声、香、味、触、法应生其心，都无所住应生其心。”</p><p>佛告善现：“如有士夫具身大身，其色自体假使譬如妙高山王。善现，于汝意云何？彼之自体为广大不？”</p><p>善现答言：“彼之自体广大，世尊！广大，善逝！何以故？世尊，彼之自体，如来说非彼体故名自体，非以彼体故名自体。”</p><p>佛告善现：“于汝意云何？乃至殑伽河中所有沙数，假使有如是沙等殑伽河，是诸殑伽河沙宁为多不？”</p><p>善现答言：“甚多，世尊！甚多，善逝！诸殑伽河尚多无数，何况其沙！”</p><p>佛言：“善现，吾今告汝，开觉于汝：假使若善男子或善女人，以妙七宝盛满尔所殑伽河沙等世界，奉施如来、应、正等觉。善现，于汝意云何？是善男子或善女人，由此因缘所生福聚宁为多不？”</p><p>善现答言：“甚多，世尊！甚多，善逝！是善男子或善女人，由此因缘所生福聚其量甚多。”</p><p>佛复告善现：“若以七宝盛满尔所沙等世界，奉施如来、应、正等觉；若善男子或善女人，于此法门乃至四句伽陀，受持、读诵、究竟通利，及广为他宣说开示、如理作意，由此因缘所生福聚，甚多于前无量无数。</p><p>“复次，善现，若地方所，于此法门乃至为他宣说开示四句伽陀，此地方所尚为<a href=\"/remen/shijian.html\"class=\"keylink\"target=\"_blank\">世间</a>诸天及人、阿素洛等之所供养如佛灵庙，何况有能于此法门具足究竟、书写、受持、读诵、究竟通利，及广为他宣说开示、如理作意！如是有情成就最胜希有功德。此地方所大师所住，或随一一尊重处所若诸有智、同梵<a href=\"/remen/xingzhe.html\"class=\"keylink\"target=\"_blank\">行者</a>。”</p><p>说是语已，具寿善现复白佛言：“世尊，当何名此法门？我当云何奉持？”</p><p>作是语已，佛告善现言：“具寿，今此法门，名为《能断金刚<a href=\"/remen/banruo.html\"class=\"keylink\"target=\"_blank\">般若</a>波罗蜜多》，如是名字汝当奉持。何以故？善现，如是般若波罗蜜多，如来说为非般若波罗蜜多，是故如来说名般若波罗蜜多。”</p><p>佛告善现：“于汝意云何？颇有少法如来可说不？”</p><p>善现答言：“不也，世尊。无有少法如来可说。”</p><p>佛告善现：“乃至三千大千世界大地微尘宁为多不？”</p><p>善现答言：“此地微尘甚多，世尊！甚多，善逝！”</p><p>佛言：“善现，大地微尘，如来说非微尘，是故如来说名大地微尘。诸世界，如来说非世界，是故如来说名世界。”</p><p>佛告善现：“于汝意云何？应以三十二大士夫相观于如来、应、正等觉不？”</p><p>善现答言：“不也，世尊。不应以三十二大士夫相观于如来、应、正等觉。何以故？世尊，三十二大士夫相，如来说为非相，是故如来说名三十二大士夫相。”</p><p>佛复告善现言：“假使若有善男子或善女人，于日日分舍施殑伽河沙等自体，如是经殑伽河沙等劫数舍施自体；复有善男子或善女人，于此法门乃至四句伽陀，受持、读诵、究竟通利，及广为他宣说开示、如理作意，由是因缘所生福聚，甚多于前无量无数。”</p><p>尔时，具寿善现闻法威力，悲泣堕泪，俯仰扪泪而白佛言：“甚奇希有，世尊！最极希有，善逝！如来今者所<a href=\"/remen/shuofa.html\"class=\"keylink\"target=\"_blank\">说法</a>门，普为发趣最上乘者作诸义利，普为发趣最胜乘者作诸义利！世尊，我昔生智以来，未曾得闻如是法门。世尊，若诸有情闻说如是甚深经典生真实想，当知成就最胜希有。何以故？世尊，诸真实想真实想者，如来说为非想，是故如来说名真实想真实想。</p><p>“世尊，我今闻说如是法门，领悟信解未为希有。若诸有情于当来世，后时、后分、后五百岁、正法将灭时、分转时，当于如是甚深法门领悟信解、受持、读诵、究竟通利，及广为他宣说开示、如理作意，当知成就最胜希有。何以故？世尊，彼诸有情无我想转、无有情想、无命者想、无士夫想、无补特伽罗想、无意生想、无摩纳婆想、无作者想、无受者想转。所以者何？世尊，诸我想即是非想，诸有情想、命者想、士夫想、补特伽罗想、意生想、摩纳婆想、作者想、受者想即是非想。何以故？诸佛世尊离一切想。”</p><p>作是语已，尔时，世尊告具寿善现言：“如是，如是，善现。若诸有情闻说如是甚深经典，不惊不惧，无有怖畏，当知成就最胜希有。何以故？善现，如来说最胜波罗蜜多，谓般若波罗蜜多。善现，如来所说最胜波罗蜜多，无量诸佛世尊所共宣说故，名最胜波罗蜜多。如来说最胜波罗蜜多，即非波罗蜜多，是故如来说名最胜波罗蜜多。</p><p>“复次，善现，如来说忍辱波罗蜜多，即非波罗蜜多，是故如来说名忍辱波罗蜜多。何以故？善现，我昔过去世曾为羯利王断支节肉，我于尔时都无我想、或有情想、或命者想、或士夫想、或补特伽罗想、或意生想、或摩纳婆想、或作者想、或受者想，我于尔时都无有想，亦非无想。何以故？善现，我于尔时若有我想，即于尔时应有恚想；我于尔时若有有情想、命者想、士夫想、补特伽罗想、意生想、摩纳婆想、作者想、受者想，即于尔时应有恚想。何以故？善现，我忆过去五百生中，曾为自号忍辱仙人，我于尔时都无我想、无有情想、无命者想、无士夫想、无补特伽罗想、无意生想、无摩纳婆想、无作者想、无受者想，我于尔时都无有想，亦非无想。是故，善现，菩萨摩诃萨远离一切想，应发阿耨多罗三藐三<a href=\"/remen/putixin.html\"class=\"keylink\"target=\"_blank\">菩提心</a>，不住于色应生其心，不住非色应生其心，不住声、香、味、触、法应生其心，不住非声、香、味、触、法应生其心，都无所住应生其心。何以故？善现，诸有所住则为非住。是故，如来说诸菩萨，应无所住而行布施，不应住色、声、香、味、触、法而行布施。</p><p>“复次，善现，菩萨摩诃萨为诸有情作义利故，应当如是弃舍布施。何以故？善现，诸有情想即是非想，一切有情，如来即说为非有情。善现，如来是实语者、谛语者、如语者、不异语者。</p><p>“复次，善现，如来现前等所证法、或所说法、或所思法，即于其中非谛非妄。善现，譬如士夫入于闇室都无所见，当知菩萨若堕于事，谓堕于事而行布施，亦复如是。善现，譬如明眼士夫过夜晓已，日光出时，见种种色，当知菩萨不堕于事，谓不堕事而行布施，亦复如是。</p><p>“复次，善现，若善男子或善女人，于此法门受持、读诵、究竟通利，及广为他宣说开示、如理作意，则为如来以其佛智悉知是人，则为如来以其佛眼悉见是人，则为如来悉觉是人，如是有情一切当生无量福聚。</p><p>“复次，善现，假使善男子或善女人，日初时分以殑伽河沙等自体布施，日中时分复以殑伽河沙等自体布施，日后时分亦以殑伽河沙等自体布施，由此异门经于俱胝那庾多百千劫以自体布施；若有闻说如是法门不生诽谤，由此因缘所生福聚，尚多于前无量无数，何况能于如是法门具足毕竟书写、受持、读诵、究竟通利，及广为他宣说开示、如理作意！</p><p>“复次，善现，如是法门不可思议、不可称量，应当希冀不可思议所感异熟。善现，如来宣说如是法门，为欲<a href=\"/remen/154932.html\"class=\"keylink\"target=\"_blank\">饶益</a>趣最上乘诸有情故，为欲饶益趣最胜乘诸有情故。善现，若有于此法门受持、读诵、究竟通利，及广为他宣说开示、如理作意，即为如来以其佛智悉知是人，即为如来以其佛眼悉见是人，则为如来悉觉是人。如是有情一切成就无量福聚，皆当成就不可思议、不可称量无边福聚。善现，如是一切有情其肩荷担如来无上正等菩提。何以故？善现，如是法门，非诸下劣信解有情所能听闻，非诸我见、非诸有情见、非诸命者见、非诸士夫见、非诸补特伽罗见、非诸意生见、非诸摩纳婆见、非诸作者见、非诸受者见所能听闻。此等若能受持、读诵、究竟通利，及广为他宣说开示、如理作意，无有是处。</p><p>“复次，善现，若地方所开此经典，此地方所当为世间诸天及人、阿素洛等之所供养、礼敬、右绕如佛灵庙。</p><p>“复次，善现，若善男子或善女人，于此经典受持、读诵、究竟通利，及广为他宣说开示、如理作意，若遭轻毁、极遭轻毁。所以者何？善现，是诸有情宿生所造诸不净业应感恶趣，以现法中遭轻毁故，宿生所造诸不净业皆悉消尽，当得无上正等菩提。何以故？善现，我忆过去于无数劫复过无数，于燃灯如来、应、正等觉先复过去曾值八十四俱胝那庾多百千诸佛，我皆承事，既承事已皆无违犯。善现，我于如是诸佛世尊皆得承事，既承事已皆无违犯。若诸有情，后时、后分、后五百岁、正法将灭时、分转时，于此经典受持、读诵、究竟通利，及广为他宣说开示、如理作意。善现，我先福聚于此福聚，百分计之所不能及，如是千分、若百千分、若俱胝百千分、若俱胝那庾多百千分、若数分、若计分、若算分、若喻分、若邬波尼杀昙分亦不能及。善现，我若具说当于尔时是善男子或善女人所生福聚，乃至是善男子、是善女人所摄福聚，有诸有情则便迷闷心惑狂乱。是故，善现，如来宣说如是法门不可思议、不可称量，应当希冀不可思议所感异熟。”</p><p>尔时，具寿善现复白佛言：“世尊，诸有发趣菩萨乘者，应云何住？云何修行？云何摄伏其心？”</p><p>佛告善现：“诸有发趣菩萨乘者，应当发起如是之心：‘我当皆令一切有情于无余依妙涅槃界而般涅槃，虽度如是一切有情令灭度已，而无有情得灭度者。’何以故？善现，若诸菩萨摩诃萨有情想转，不应说名菩萨摩诃萨。所以者何？若诸菩萨摩诃萨不应说言有情想转，如是命者想、士夫想、补特伽罗想、意生想、摩纳婆想、作者想、受者想转，当知亦尔。何以故？善现，无有少法名为发趣菩萨乘者。”</p><p>佛告善现：“于汝意云何？如来昔于燃灯如来、应、正等觉所，颇有少法能证阿耨多罗三藐三菩提不？”</p><p>作是语已，具寿善现白佛言：“世尊，如我解佛所说义者，如来昔于燃灯如来、应、正等觉所，无有少法能证阿耨多罗三藐三菩提。”</p><p>说是语已，佛告具寿善现言：“如是，如是，善现，如来昔于燃灯如来、应、正等觉所，无有少法能证阿耨多罗三藐三菩提。何以故？善现，如来昔于燃灯如来、应、正等觉所，若有少法能证阿耨多罗三藐三菩提者，燃灯如来、应、正等觉不应授我记言：‘汝摩纳婆于当来世名释迦牟尼如来、应、正等觉。’善现，以如来无有少法能证阿耨多罗三藐三菩提，是故燃灯如来、应、正等觉授我记言：‘汝摩纳婆于当来世名释迦牟尼如来、应、正等觉。’所以者何？善现，言如来者，即是真实真如增语；言如来者，即是无生法性增语；言如来者，即是永断道路增语；言如来者，即是毕竟不生增语。何以故？善现，若实无生，即最胜义。</p><p>“善现，若如是说‘如来、应、正等觉能证阿耨多罗三藐三菩提’者，当知此言为不真实。所以者何？善现，由彼谤我起不实执。何以故？善现，无有少法，如来、应、正等觉能证阿耨多罗三藐三菩提。善现，如来现前等所证法，或所说法、或所思法，即于其中非谛非妄，是故，如来说一切法皆是佛法。善现，一切法一切法者，如来说非一切法，是故如来说名一切法一切法。”</p><p>佛告善现：“譬如士夫具身大身。”</p><p>具寿善现即白佛言：“世尊，如来所说士夫具身大身，如来说为非身，是故说名具身大身。”</p><p>佛言：“善现，如是，如是。若诸菩萨作如是言：‘我当灭度无量有情。’是则不应说名菩萨。何以故？善现，颇有少法名菩萨不？”</p><p>善现答言：“不也，世尊。无有少法名为菩萨。”</p><p>佛告善现：“有情有情者，如来说非有情，故名有情。是故如来说一切法无有有情、无有命者、无有士夫、无有补特伽罗等。善现，若诸菩萨作如是言：‘我当成办佛土功德庄严。’亦如是说。何以故？善现，佛土功德庄严佛土功德庄严者，如来说非庄严，是故如来说名佛土功德庄严佛土功德庄严。善现，若诸菩萨于无我法无我法深信解者，如来、应、正等觉说为菩萨。”</p><p>佛告善现：“于汝意云何？如来等现有肉眼不？”</p><p>善现答言：“如是，世尊，如来等现有肉眼。”</p><p>佛言：“善现，于汝意云何？如来等现有天眼不？”</p><p>善现答言：“如是，世尊，如来等现有天眼。”</p><p>佛言：“善现，于汝意云何？如来等现有慧眼不？”</p><p>善现答言：“如是，世尊，如来等现有慧眼。”</p><p>佛言：“善现，于汝意云何？如来等现有<a href=\"/remen/fayan.html\"class=\"keylink\"target=\"_blank\">法眼</a>不？”</p><p>善现答言：“如是，世尊，如来等现有法眼。”</p><p>佛言：“善现，于汝意云何？如来等现有佛眼不？”</p><p>善现答言：“如是，世尊，如来等现有佛眼。”</p><p>佛告善现：“于汝意云何？乃至殑伽河中所有诸沙，如来说是沙不？”</p><p>善现答言：“如是，世尊。如是，善逝。如来说是沙。”</p><p>佛言：“善现，于汝意云何？乃至殑伽河中所有沙数，假使有如是等殑伽河，乃至是诸殑伽河中所有沙数，假使有如是等世界，是诸世界宁为多不？”</p><p>善现答言：“如是，世尊。如是，善逝。是诸世界其数甚多。”</p><p>佛言：“善现，乃至尔所诸世界中所有有情，彼诸有情各有种种，其心流注，我悉能知。何以故？善现，心流注心流注者，如来说非流注，是故如来说名心流注心流注。所以者何？善现，过去心不可得，未来心不可得，现在心不可得。”</p><p>佛告善现：“于汝意云何？若善男子或善女人，以此三千大千世界盛满七宝，奉施如来、应、正等觉，是善男子或善女人，由是因缘所生福聚，宁为多不？”</p><p>善现答言：“甚多，世尊！甚多，善逝！”</p><p>佛言：“善现，如是，如是。彼善男子或善女人，由此因缘所生福聚其量甚多。何以故？善现，若有福聚，如来不说福聚福聚。”</p><p>佛告善现：“于汝意云何？可以色身圆实观如来不？”</p><p>善现答言：“不也，世尊。不可以色身圆实观于如来。何以故？世尊，色身圆实色身圆实者，如来说非圆实，是故如来说名色身圆实色身圆实。”</p><p>佛告善现：“于汝意云何？可以诸相具足观如来不？”</p><p>善现答言：“不也，世尊。不可以诸相具足观于如来。何以故？世尊，诸相具足诸相具足者，如来说为非相具足，是故如来说名诸相具足诸相具足。”</p><p>佛告善现：“于汝意云何？如来颇作是念‘我当有所说法’耶？善现，汝今勿当作如是观。何以故？善现，若言如来有所说法，即为谤我，为非善取。何以故？善现，说法说法者，无法可得，故名说法。”</p><p>尔时，具寿善现白佛言：“世尊，于当来世后时、后分、后五百岁、正法将灭时、分转时，颇有有情闻说如是色类法已，能深信不？”</p><p>佛言：“善现，彼非有情，非不有情。何以故？善现，一切有情者，如来说非有情，故名一切有情。”</p><p>佛告善现：“于汝意云何？颇有少法，如来、应、正等觉现证无上正等菩提耶？”</p><p>具寿善现白佛言：“世尊，如我解佛所说义者，无有少法，如来、应、正等觉现证无上正等菩提。”</p><p>佛言：“善现，如是，如是，于中少法无有无得，故名无上正等菩提。</p><p>“复次，善现，是法平等，于其中间无不平等，故名无上正等菩提。以无我性、无有情性、无命者性、无士夫性、无补特伽罗等性，平等故名无上正等菩提。一切善法无不现证，一切善法无不妙觉。善现，善法善法者，如来一切说为非法，是故如来说名善法善法。</p><p>“复次，善现，若善男子或善女人集七宝聚，量等三千大千世界其中所有妙高山王，持用布施。若善男子或善女人，于此般若波罗蜜多经中乃至四句伽陀，受持、读诵、究竟通利，及广为他宣说开示、如理作意。善现，前说福聚于此福聚，百分计之所不能及，如是千分、若百千分、若俱胝百千分、若俱胝那庾多百千分、若数分、若计分、若算分、若喻分、若乌波尼杀昙分亦不能及。”</p><p>佛告善现：“于汝意云何？如来颇作是念‘我当度脱诸有情’耶？善现，汝今勿当作如是观。何以故？善现，无少有情如来度者。善现，若有有情如来度者，如来即应有其我执，有有情执，有命者执，有士夫执，有补特伽罗等执。善现，我等执者，如来说为非执，故名我等执，而诸愚夫异生强有此执。善现，愚夫异生者，如来说为非生，故名愚夫异生。”</p><p>佛告善现：“于汝意云何？可以诸相具足观如来不？”</p><p>善现答言：“如我解佛所说义者，不应以诸相具足观于如来。”</p><p>佛言：“善现，善哉！善哉！如是，如是，如汝所说，不应以诸相具足观于如来。善现，若以诸相具足观如来者，转轮圣王应是如来。是故不应以诸相具足观于如来，如是应以诸相非相观于如来。”</p><p>尔时，世尊而说颂曰：</p><p>“诸以色观我，以音声寻我，</p><p>彼生履邪断，不能当见我。</p><p>应观佛法性，即导师法身，</p><p>法性非所识，故彼不能了。”</p><p>佛告善现：“于汝意云何？如来、应、正等觉以诸相具足现证无上正等觉耶？善现，汝今勿当作如是观。何以故？善现，如来、应、正等觉不以诸相具足现证无上正等菩提。</p><p>“复次，善现，如是发趣菩萨乘者，颇施设少法若坏若断耶？善现，汝今勿当作如是观，诸有发趣菩萨乘者，终不施设少法若坏若断。</p><p>“复次，善现，若善男子或善女人，以殑伽河沙等世界盛满七宝，奉施如来、应、正等觉；若有菩萨于诸无我、无生法中获得堪忍，由是因缘所生福聚甚多于彼。</p><p>“复次，善现，菩萨不应摄受福聚。”</p><p>具寿善现即白佛言：“世尊，云何菩萨不应摄受福聚？”</p><p>佛言：“善现，所应摄受不应摄受，是故说名所应摄受。</p><p>“复次，善现，若有说言：‘如来若去、若来、若住、若坐、若卧。’是人不解我所说义。何以故？善现，言如来者，即是真实真如增语，都无所去、无所从来，故名如来、应、正等觉。</p><p>“复次，善现，若善男子或善女人，乃至三千大千世界大地极微尘量等世界，即以如是无数世界色像为墨如极微聚。善现，于汝意云何？是极微聚宁为多不？”</p><p>善现答言：“是极微聚甚多，世尊！甚多，善逝！何以故？世尊，若极微聚是实有者，佛不应说为极微聚。所以者何？如来说极微聚，即为非聚，故名极微聚。如来说三千大千世界，即非世界，故名三千大千世界。何以故？世尊，若世界是实有者，即为一合执。如来说一合执，即为非执，故名一合执。”</p><p>佛言：“善现，此一合执不可言说、不可戏论，然彼一切愚夫异生强执是法。</p><p>“何以故？善现，若作是言：‘如来宣说我见、有情见、命者见、士夫见、补特伽罗见、意生见、摩纳婆见、作者见、受者见。’于汝意云何？如是所说为正语不？”</p><p>善现答言：“不也，世尊。不也，善逝。如是所说非为正语。所以者何？如来所说我见、有情见、命者见、士夫见、补特伽罗见、意生见、摩纳婆见、作者见、受者见，即为非见，故名我见乃至受者见。”</p><p>佛告善现：“诸有发趣菩萨乘者，于一切法应如是知、应如是见、应如是信解，如是不住法想。何以故？善现，法想法想者，如来说为非想，是故如来说名法想法想。</p><p>“复次，善现，若菩萨摩诃萨以无量无数世界盛满七宝奉施如来、应、正等觉；若善男子或善女人，于此般若波罗蜜多经中乃至四句伽陀，受持读诵，究竟通利，如理作意，及广为他宣说开示，由此因缘所生福聚，甚多于前无量无数。云何为他宣说开示？如不为他宣说开示，故名为他宣说开示。”</p><p>尔时，世尊而说颂曰：</p><p>“诸和合所为，如星翳灯幻，</p><p>露泡梦电云，应作如是观。”</p><p>时，薄伽梵说是经已，尊者善现及诸苾刍、苾刍尼、邬波索迦、邬波斯迦，并诸世间天、人、阿素洛、健达缚等，闻薄伽梵所说经已，皆大<a href=\"/remen/huanxi.html\"class=\"keylink\"target=\"_blank\">欢喜</a>，信受奉行。</p></div>"
    },
    {
        "title": "佛说能断金刚般若波罗蜜多经 【唐三藏沙门义净译】",
        "date": "2014-02-11",
        "author": "义净法师",
        "html": "<div class=\"B1_text\"><p>佛说能断金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜多经 唐　<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师义净　奉制　译</p><p>如是我闻。一时薄伽梵，在名称大城，战胜林施孤独园，与大苾刍众千二百五十人俱，及大菩萨众。尔时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>于日初分时，著衣持皱，入城乞食。次第乞已，还至本处。饭食讫，收衣皱，洗足已，于先设座，跏趺端坐，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>而住。时诸苾刍来诣佛所，<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>双足，右绕三匝，退坐一面。</p><p>尔时，具寿妙生，在大众中，承佛神力，即从座起，偏袒右肩，右膝著地，合掌恭敬白佛言：「希有！世尊！希有！善逝。如来应正等觉，能以最胜利益，益诸菩萨；能以最胜付嘱，嘱诸菩萨。世尊！若有发趣菩萨乘者，云何应住？云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>？云何摄伏其心？」</p><p>佛告妙生：「善哉善哉！如是如是！如汝所说：如来以胜利益，益诸菩萨；以胜付嘱，嘱诸菩萨。妙生！汝应谛听，极善作意，吾当为汝分别解说。若有发趣菩萨乘者，应如是住，如是修行，如是摄伏其心。」</p><p>妙生言：「唯然，世尊！愿乐欲闻。」</p><p>佛告妙生：「若有发趣菩萨乘者，当生如是心：所有一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>之类，若卵生、胎生、湿生、化生，若有色、无色，有想、无想，非有想、非无想，尽诸世界所有众生，如是一切，我皆令入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>而灭度之。虽令如是无量众生证圆寂已，而无有一众生入圆寂者。何以故？妙生！若菩萨有众生想者，则不名菩萨。所以者何？由有我想、众生想、寿者想、更求趣想故。</p><p>「复次，妙生！菩萨不住于事，应行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。不住随处，应行布施。不住色声香味触法，应行布施。妙生！菩萨如是布施，乃至相想，亦不应住。何以故？由不住施，福聚难量。妙生！于汝意云何？东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可知量不？」</p><p>妙生言：「不尔，世尊！」</p><p>「南西北方，四维上下，十方虚空，可知量不？」</p><p>妙生言：「不尔，世尊！」</p><p>「妙生！菩萨行不住施，所得福聚不可知量，亦复如是。</p><p>「妙生！于汝意云何？可以具足胜相观如来不？」</p><p>妙生言：「不尔，世尊！不应以胜相观于如来。何以故？如来说胜相，即非胜相。」</p><p>「妙生！所有胜相，皆是虚妄。若无胜相，即非虚妄。是故应以胜相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>观于如来。」</p><p>妙生言：「世尊！颇有众生，于当来世，后五百岁，<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>灭时，闻说是经，生实信不？」</p><p>佛告妙生：「莫作是说：『颇有众生，于当来世，后五百岁，正法灭时，闻说是经，生实信不？』妙生！当来之世，有诸菩萨，具戒具德具慧，而彼菩萨，非于一佛承事<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，植诸善根；已于无量百千佛所，而行奉事，植诸善根。是人乃能于此经典生一<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。妙生！如来悉知是人，悉见是人，彼诸菩萨当生当摄，无量福聚。何以故？由彼菩萨，<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>想众生想寿者想更求趣想。</p><p>「彼诸菩萨，非法想，非非法想，非想，非无想。何以故？若彼菩萨有法想，即有<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>、有情执、寿者执、更求趣执。若有非法想，彼亦有我执有情执寿者执更求趣执。妙生！是故菩萨，不应取法，不应取非法。以是义故，如来密意宣说筏喻法门，诸有智者，法尚应舍，何况非法。</p><p>「妙生！于汝意云何？如来于无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>有所证不？复有少法是所说不？」</p><p>妙生言：「如我解佛所说义，如来于无上菩提实无所证，亦无所说。何以故？佛所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，不可取，不可说，彼非法，非非法。何以故？以诸圣者，皆是无为所显现故。」</p><p>「妙生！于汝意云何？若善男子善女人，以满三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝持用布施，得福多不？」</p><p>妙生言：「甚多，世尊！何以故？此福聚者，则非是聚，是故如来说为福聚福聚。」</p><p>「妙生！若有善男子善女人，以满三千大千世界七宝，持用布施；若复有人，能于此经乃至一四句颂，若自<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，为他演说，以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所生福聚，极多于彼无量无数。何以故？妙生！由诸如来无上等觉，从此经出；诸佛世尊，从此经生。是故妙生！佛、法者，如来说非佛、法，是名佛、法。</p><p>「妙生！于汝意云何？诸预流者颇作是念：『我得预流果』不？」</p><p>妙生言：「不尔，世尊！何以故？诸预流者，无法可预，故名预流。不预色声香味触法，故名预流。世尊！若预流者作是念：『我得预流果』者，则有我执，有情寿者更求趣执。」</p><p>「妙生！于汝意云何？诸一来者颇作是念：『我得一来果』不？」</p><p>妙生言：「不尔，世尊！何以故？由彼无有少法证一来性，故名一来。」</p><p>「妙生！于汝意云何？诸不还者颇作是念：『我得不还果』不？」</p><p>妙生言：「不尔，世尊！何以故？由彼无有少法证不还性，故名不还。」</p><p>「妙生！于汝意云何？诸阿罗汉颇作是念：『我得阿罗汉果』不？」</p><p>妙生言：「不尔，世尊！由彼无有少法名阿罗汉。世尊！若阿罗汉作是念：『我得阿罗汉果』者，则有我执，有情寿者更求趣执。世尊！如来说我得无诤住中最为第一。世尊！我是阿罗汉离于欲染，而实未曾作如是念：『我是阿罗汉。』世尊！若作是念，我得阿罗汉者，如来即不说我妙生得无诤住，最为第一。以都无所住，是故说我得无诤住。」</p><p>「妙生！于汝意云何？如来昔在然灯佛所，颇有少法是可取不？」</p><p>妙生言：「不尔，世尊！如来于然灯佛所，实无可取。」</p><p>「妙生！若有菩萨作如是语：『我当成就<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>国土者。』此为<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。何以故？庄严佛土者，如来说非庄严，由此说为国土庄严。是故，妙生！菩萨不住于事，不住随处，不住色声香味触法，应生其心；应生不住事心，应生不住随处心，应生不住色声香味触法心。</p><p>「妙生！譬如有人，身如妙高山王，于意云何？是身为大不？」</p><p>妙生言：「甚大，世尊！何以故？彼之大身，如来说为非身。以彼非有，说名为身。」</p><p>「妙生！于汝意云何？如殑伽河中所有沙数，复有如是沙等殑伽河，此诸河沙，宁为多不？」</p><p>妙生言：「甚多，世尊！河尚无数，况复其沙。」</p><p>「妙生！我今实言告汝，若复有人，以宝满此河沙数量世界，奉施如来，得福多不？」妙生言：「甚多，世尊！」</p><p>「妙生！若复有人，于此经中受持一颂，并为他说，而此福聚，胜前福聚无量无边。</p><p>「妙生！若国土中有此法门，为他解说，乃至四句伽陀，当知此地，即是制底，一切<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿苏罗等，皆应右绕而为敬礼；何况尽能受持读诵，当知是人，则为最上第一希有。又此方所，即为有佛，及尊重<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。</p><p>「妙生！于汝意云何？颇有少法是如来所说不？」妙生言：「不尔，世尊！无有少法是如来所说。」</p><p>「妙生！三千大千世界所有地尘，是为多不？」妙生言：「甚多，世尊！何以故？诸地尘，佛说非尘，故名地尘。此诸世界，佛说非世界，故名世界。」</p><p>「妙生！于汝意云何？可以三十二大丈夫相观如来不？」妙生言：「不尔，世尊！不应以三十二相观于如来。何以故？三十二相，佛说非相，是故说为大丈夫相。」</p><p>「妙生！若有男<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>人，以殑伽河沙等身命布施；若复有人，于此经中受持一颂，并为他说，其福胜彼无量无数。」</p><p>尔时，妙生闻说是经，深解义趣，涕泪悲泣而白佛言：「希有！世尊！我从生智已来，未曾得闻如是深经。世尊！当何名此经？我等云何奉持？」</p><p>佛告妙生：「此经名为般若波罗蜜多，如是应持。何以故？佛说般若波罗蜜多，则非般若波罗蜜多。」</p><p>「世尊！若复有人，闻说是经生实想者，当知是人最上希有。世尊！此实想者，即非实想，是故如来说名实想实想。世尊！我闻是经，心生信解，未为希有。若当来世，有闻是经，能受持者，是人则为第一希有。何以故？彼人无我想众生想寿者想更求趣想。所以者何？世尊！我想众生想寿者想更求趣想，即是非想。所以者何？诸佛世尊离诸想故。」</p><p>「妙生！如是如是！若复有人，得闻是经，不惊不怖不畏，当知是人第一希有。何以故？妙生！此最胜波罗蜜多，是如来所说诸波罗蜜多。如来说者，即是无边佛所宣说，是故名为最胜波罗蜜多。</p><p>「妙生！如来说忍辱波罗蜜多，即非忍辱波罗蜜多。何以故？如我昔为羯陵伽王割截支体时，无我想众生想寿者想更求趣想。我无是想，亦非无想。所以者何？我有是想者，应生嗔恨。妙生！又念过去于五百世，作忍辱仙人，我于尔时，无如是等想。是故应离诸想，发趣无上菩提之心，不应住色声香味触法，都无所住而生其心；不应住法，不应住非法，应生其心。何以故？若有所住，即为非住。是故佛说菩萨应无所住而行布施。妙生！菩萨为利益一切众生，应如是布施。</p><p>「此众生想，即为非想；彼诸众生，即非众生。何以故？诸佛如来离诸想故。妙生！如来是实语者，如语者，不诳语者，不异语者。妙生！如来所证法及所说法，此即非实非妄。妙生！若菩萨心，住于事而行布施，如人入闇，则无所见。若不住事而行布施，如人有目，日光明照，见种种色，是故菩萨不住于事应行其施。妙生！若有善男子善女人。能于此经受持读诵，为他演说，如是之人，佛以智眼悉知悉见，当生当摄无量福聚。</p><p>「妙生！若有善男子善女人，初日分以殑伽河沙等身布施，中日分复以殑伽河沙等身布施，后日分亦以殑伽河沙等身布施，如是无量百千万亿劫，以身布施。若复有人，闻此经典，不生毁谤，其福胜彼，何况书写受持读诵，为人解说。</p><p>「妙生！是经有不可思议不可称量无边<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，如来为发大乘者说，为发最上乘者说。若有人能受持读诵，广为他说，如来悉知悉见是人，皆得成就不可量不可称不可思议福业之聚。当知是人，则为以肩荷负如来无上菩提。何以故？妙生！若乐小法者，则著我见众生见寿者见更求趣见，是人若能读诵受持此经，无有是处。</p><p>「妙生！所在之处，若有此经，当知此处，则是制底，一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>天人阿苏罗，所应恭敬，作礼围绕，以诸香华供养其处。</p><p>「妙生！若有善男子善女人，于此经典受持读诵演说之时，或为人轻辱。何以故？妙生！当知是人，于前世中造诸恶业，应堕恶道，由于现在得遭轻辱，此为善事，能尽恶业，速至菩提故。</p><p>「妙生！我忆过去过无数劫，在然灯佛先，得值八十四亿那庾多佛，悉皆供养承事，无违背者。若复有人，于后五百岁正法灭时，能于此经受持读诵，解其义趣，广为他说，所得功德，以前功德比此功德，百分不及一，千万亿分算分势分比数分因分，乃至譬喻亦不能及。妙生！我若具说受持读诵此经功德，或有人闻，心则狂乱，疑惑不信。妙生！当知是经不可思议，其受持者，应当希望不可思议所生福聚。」</p><p>复次，妙生白佛言：「世尊！若有发趣菩萨乘者。应云何住？云何修行？云何摄伏其心？」</p><p>佛告妙生：「若有发趣菩萨乘者，当生如是心：我当度脱一切众生，悉皆令入无余涅槃。虽有如是无量众生证于圆寂，而无有一众生证圆寂者。何以故？妙生！若菩萨有众生想者，则不名菩萨。所以者何？妙生！实无有法，可名发趣菩萨乘者。</p><p>「妙生！于汝意云何？如来于然灯佛所，颇有少法是所证不？」</p><p>妙生言：「如来于然灯佛所，无法可证，而得菩提。」</p><p>佛言：「如是，如是。妙生！实无有法，如来于然灯佛所，有所证悟，得大菩提。若证法者，然灯佛则不与我授记：『摩纳婆！汝于来世，当得作佛，号释迦牟尼。』以无所得故，然灯佛与我授记，当得作佛，号释迦牟尼。何以故？妙生！言如来者，即是实性真如之异名也。</p><p>「妙生！若言如来<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无上正等觉者，是为妄语。何以故？实无有法如来证得无上正觉。妙生！如来所得正觉之法，此即非实非虚。是故佛说，一切法者，即是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。妙生！一切法、一切法者，如来说为非法，是故如来说一切法者，即是佛法。妙生！譬如丈夫，其身长大。」</p><p>妙生言：「世尊！如来说为大身者，即说为非身，是名大身。」</p><p>佛告妙生：「如是，如是。若菩萨作是语：『我当度众生令寂灭者。』则不名菩萨。妙生！颇有少法名菩萨不？」答言：「不尔，世尊！」「妙生！是故如来说一切法，无我无众生无寿者无更求趣。</p><p>「妙生！若有菩萨言：『我当成就佛土严胜、佛土严胜者，如来说为非是严胜，是故如来说为严胜。妙生！若有信解一切法无性、一切法无性者，如来说名真是菩萨菩萨。</p><p>「妙生！于汝意云何？如来有肉眼不？」</p><p>妙生言：「如是，世尊！如来有肉眼。」</p><p>「如来有天眼不？」</p><p>「如是，世尊！如来有天眼。」</p><p>「如来有慧眼不？」</p><p>「如是，世尊！如来有慧眼。」</p><p>「如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不？」</p><p>「如是，世尊！如来有法眼。」</p><p>「如来有佛眼不？」</p><p>「如是，世尊！如来有佛眼。」</p><p>「妙生！于汝意云何？如殑伽河中所有沙数，复有如是沙等殑伽河，随诸河沙，有尔所世界，是为多不？」</p><p>妙生言：「甚多，世尊！」</p><p>「妙生！此世界中所有众生，种种性行，其心<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>，我悉了知。何以故？妙生！心陀罗尼者，如来说为无持，由无持故，心遂流转。何以故？妙生！过去心不可得，未来心不可得，现在心不可得。</p><p>「妙生。于汝意云何？若人以满三千大千世界七宝布施，是人得福多不？」</p><p>妙生言：「甚多，世尊！」</p><p>「妙生！若此福聚是福聚者，如来则不说为福聚福聚。</p><p>「妙生！于汝意云何？可以色身<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>观如来不？」</p><p>「不尔，世尊！不应以色身圆满观于如来。何以故？色身圆满色身圆满者，如来说非圆满，是故名为色身圆满。」</p><p>「妙生！可以具相观如来不？」</p><p>「不尔，世尊！不应以具相观于如来。何以故？诸具相者，如来说非具相，是故如来说名具相。」</p><p>「妙生！于汝意云何？如来作是念：我说法耶？汝勿作是见。若言如来有所说法者，则为谤我。何以故？言说法说法者，无法可说，是名说法。」</p><p>妙生白佛言：「世尊！于当来世，颇有众生，闻说是经，生信心不？」</p><p>佛告妙生：「有生信者。彼非众生，非非众生。何以故？众生众生者，如来说非众生，是名众生。</p><p>「妙生！于汝意云何？佛得无上正等觉时，颇有少法所证不？」</p><p>妙生言：「实无有法是佛所证。」</p><p>佛告妙生：「如是，如是！此中无有少法可得，故名无上正等菩提。妙生！是法平等，无有高下，故名无上正等菩提。以无我无众生无寿者无更求趣性，其性平等，故名无上正等菩提。一切善法皆正觉了，故名无上正等正觉。妙生！善法者，如来说为非法，故名善法。</p><p>「妙生！若三千大千世界中，所有诸妙高山王，如是等七宝聚，有人持用布施。若复有人，于此经中，乃至一四句颂，若自受持，及为他说。以前福聚比此福聚，假令分此以为百分，彼亦不能及一分，或千分亿分算分势分数分因分，乃至譬喻亦不能及一。</p><p>「妙生！于汝意云何？如来度众生不？汝莫作是见：『如来度众生。』何以故？曾无有一众生是如来度者。若有众生是如来度者，如来则有我见众生见寿者见更求趣见。妙生！我等执者，如来说为非执，而诸愚夫妄为此执。妙生！愚夫众生，如来说为非生，故名愚夫众生。</p><p>「妙生！于汝意云何？应以具相观如来不？」</p><p>「不尔，世尊！不应以具相观于如来。」</p><p>「妙生！若以具相观如来者，转轮圣王应是如来，是故不应以具相观于如来，应以诸相非相观于如来。」尔时，世尊而说颂曰：</p><p>「若以色见我以音声求我是人起邪观不能当见我</p><p>应观佛法性即导师法身法性非所识故彼不能了</p><p>「妙生！诸有发趣菩萨乘者，其所有法是断灭不？汝莫作是见。何以故？趣菩萨乘者，其法不失。</p><p>「妙生！若有男子女人，以满殑伽河沙世界七宝布施。若复有人，于无我理、不生法中，得忍解者，所生福聚，极多于彼无量无数。妙生！菩萨不应取其福聚。」</p><p>妙生言：「菩萨岂不取福聚耶？」</p><p>佛告妙生：「是应正取，不应越取，是故说取。</p><p>「妙生！如有说言，如来若来若去若坐若卧者，是人不解我所说义。何以故？妙生！都无去来，故名如来。</p><p>「妙生！若有男子女人，以三千大千世界土地碎为墨尘。妙生！于汝意云何？是极微聚，宁为多不？」</p><p>妙生言：「甚多，世尊！何以故？若聚性是实者，如来不说为极微聚极微聚。何以故？极微聚者，世尊说为非极微聚，故名极微聚。世尊！如来所说三千大千世界，说为非世界，故名三千大千世界。何以故？若世界实有，如来则有聚执。佛说聚执者，说为非聚执，是故说为聚执。」</p><p>「妙生！此聚执者，是世言论，然其体性，实无可说，但是愚夫异生之所妄执。</p><p>「妙生！如有说云：佛说我见众生见寿者见求趣见者，是为正说为不正耶？」</p><p>妙生言：「不尔，世尊！何以故？若有我见如来说者，即是非见，故名我见。」</p><p>「妙生！诸有发趣菩萨乘者，于一切法，应如是知，如是见，如是解。如是解者，乃至法想亦无所住。何以故？妙生！法想法想者，如来说为非想，故名法想法想。</p><p>「妙生！若有人以满无量无数世界七宝，持用布施。若复有人，能于此经，乃至受持读诵四句伽陀，令其通利，广为他人正说其义，以是因缘所生福聚，极多于彼无量无数。云何正说？无法可说，是名正说。」尔时，世尊说伽陀曰：</p><p>「一切有为法如星翳灯幻露泡梦电云应作如是观」</p><p>尔时，薄伽梵说是经已，具寿妙生，及诸菩萨摩诃萨、苾刍、苾刍尼、邬波索迦、邬波斯迦、一切世间天人阿苏罗等，皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，信受奉行。</p></div>"
    },
    {
        "title": "金刚般若波罗蜜经【元魏 菩提流支译】",
        "date": "2014-02-11",
        "author": "菩提流支",
        "html": "<div class=\"B1_text\"><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>　元魏　<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>　<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>流支　译</p><p>如是我闻。一时婆伽婆，在舍婆提城，祇树给孤独园。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱。尔时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>食时，著衣持皱，入舍婆提大城乞食。于其城中，次第乞食已，还至本处。饭食讫，收衣皱，洗足已，如常敷座，结加趺坐，端身而住，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>不动。</p><p>尔时，诸比丘来诣佛所，到已，<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>佛足，右绕三启，退坐一面。尔时，慧命须菩提，在大众中，即从座起，偏袒右肩，右膝著地，向佛合掌，恭敬而立，白佛言：「希有！世尊！如来应供正椟知，善护念诸菩萨，善付嘱诸菩萨。世尊！云何菩萨大乘中，发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>？应云何住？云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>？云何降伏其心？」</p><p>尔时，佛告须菩提：「善哉！善哉！须菩提！如汝所说。如来善护念诸菩萨，善付嘱诸菩萨。汝今谛听，当为汝说。如菩萨大乘中，发阿耨多罗三藐三菩提心，应如是住，如是修行，如是降伏其心。」</p><p>须菩提白佛言：「世尊！如是。愿乐欲闻。」</p><p>佛告须菩提：「诸菩萨生如是心：所有一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>众生所摄，若卵生、若胎生、若湿生、若化生，若有色、若无色，若有想、若无想、若非有想非无想，所有众生界众生所摄，我皆令入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>而灭度之。如是灭度无量无边众生，实无众生得灭度者。何以故？须菩提！若菩萨有众生相，即非菩萨。何以故非？须菩提！若菩萨起众生相、人相、寿者相，则不名菩萨。</p><p>「复次，须菩提！菩萨不住于事行于<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，无所住行于布施，不住色布施，不住声香味触法布施。须菩提！菩萨应如是布施，不住于相想。何以故？若菩萨不住相布施，其福德聚不可思量。须菩提！于汝意云何？东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，可思量不？」</p><p>须菩提言：「不也！世尊！」</p><p>佛言：「如是，须菩提！南西北方，四维上下虚空，可思量不？」</p><p>须菩提言：「不也！世尊！」</p><p>佛言：「如是如是，须菩提！菩萨无住相布施，福德聚亦复如是不可思量。」</p><p>佛复告须菩提：「菩萨但应如是行于布施。</p><p>「须菩提！于意云何？可以相成就见如来不？」</p><p>须菩提言：「不也！世尊！不可以相成就得见如来。何以故？如来所说相，即非相。」</p><p>佛告须菩提：「凡所有相，皆是<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。若见诸相非相，则非妄语。如是诸相非相，则见如来。」</p><p>须菩提白佛言：「世尊！颇有众生，于未来世末世，得闻如是修多罗章句，生实相不？」</p><p>佛告须菩提：「莫作是说：颇有众生，于未来世末世，得闻如是修多罗章句，生实相不？」佛复告须菩提：「有未来世末世，有菩萨摩诃萨，法欲灭时，有持戒修福德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>者，于此修多罗章句，能生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，以此为实。」</p><p>佛复告须菩提：「当知彼菩萨摩诃萨，非于一佛二佛三四五佛所修行<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，非于一佛二佛三四五佛所而种善根。」佛复告须菩提：「已于无量百千万诸佛所修行供养，无量百千万诸佛所种诸善根。闻是修多罗，乃至一念能生净信。须菩提！如来悉知是诸众生，如来悉见是诸众生。须菩提！是诸菩萨，生如是无量福德聚，取如是无量福德。何以故？须菩提！是诸菩萨，无复我相、众生相、人相、寿者相。</p><p>「须菩提！是诸菩萨，无<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>，亦非无法相。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>，亦非无相。何以故？须菩提！是诸菩萨，若取法相，则为著我人众生寿者。须菩提！若是菩萨有法相，即著我相人相众生相寿者相。何以故？须菩提！不应取法，非不取法。以是义故，如来常说筏喻法门，是法应舍，非舍法故。」</p><p>复次，佛告慧命须菩提：「须菩提！于意云何？如来得阿耨多罗三藐三菩提耶？如来有所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>耶？」</p><p>须菩提言：「如我解佛所说义，无有定法如来得阿耨多罗三藐三菩提，亦无有定法如来可说。何以故？如来所说法，皆不可取不可说，非法非非法。何以故？一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，皆以<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>得名。」</p><p>「须菩提！于意云何？若满三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝，以用布施。须菩提！于意云何？是善男子善女人，所得福德，宁为多不？」</p><p>须菩提言：「甚多！婆伽婆！甚多！修伽陀！彼善男子善女人，得福甚多。何以故？世尊！是福德聚，即非福德聚，是故如来说福德聚福德聚。」</p><p>佛言：「须菩提！若善男子善女人，以满三千大千世界七宝，持用布施。若复于此经中，<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>乃至四句偈等，为他人说，其福胜彼无量不可数。何以故？须菩提！一切诸佛阿耨多罗三藐三菩提法，皆从此经出。一切诸佛如来，皆从此经生。须菩提！所谓佛、法佛、法者，即非佛、法，是名佛、法。</p><p>「须菩提！于意云何？须陀洹能作是念：『我得须陀洹果』不？」。须菩提言：「不也！世尊！何以故？实无有法名须陀洹。不入色声香味触法，是名须陀洹。」</p><p>佛言：「须菩提！于意云何？斯陀含能作是念：『我得斯陀含果』不？」须菩提言：「不也！世尊！何以故？实无有法名斯陀含。是名斯陀含。」</p><p>「须菩提！于意云何？阿那含能作是念：『我得阿那含果』不？」须菩提言：「不也！世尊！何以故？实无有法名阿那含。是名阿那含。」</p><p>「须菩提！于意云何？阿罗汉能作是念：『我得阿罗汉果』不？」须菩提言：「不也！世尊！何以故？实无有法名阿罗汉。世尊！若阿罗汉作是念，我得阿罗汉，即为著我人众生寿者。世尊！佛说我得无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，最为第一，世尊说我是离欲阿罗汉。世尊！我不作是念：我是离欲阿罗汉。世尊！我若作是念：『我得阿罗汉』。世尊则不说我无诤行第一。以须菩提实无所行，而名须菩提无诤无诤行。」</p><p>佛告须菩提：「于意云何？如来昔在然灯佛所，得阿耨多罗三藐三菩提法不？」须菩提言：「不也！世尊！如来在然灯佛所，于法实无所得阿耨多罗三藐三菩提。」</p><p>佛告须菩提：「若菩萨作是言：『我<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛国土』，彼菩萨不实语。何以故？须菩提！如来所说庄严佛土者，则非庄严，是名庄严佛土。是故须菩提！诸菩萨摩诃萨，应如是生清净心，而无所住，不住色生心，不住声香味触法生心，应无所住而生其心。</p><p>「须菩提！譬如有人，身如须弥山王。须菩提！于意云何？是身为大不？」须菩提言：「甚大！世尊！何以故？佛说非身，是名大身。彼身非身，是名大身。」</p><p>佛言：「须菩提！如恒河中所有沙数，如是沙等恒河，于意云何？是诸恒河沙，宁为多不？」须菩提言：「甚多！世尊！但诸恒河，尚多无数，何况其沙。」</p><p>佛言：「须菩提！我今实言告汝：若有善男子善女人，以七宝满尔所恒河沙数世界，以施诸佛如来。须菩提！于意云何？彼善男子善女人，得福多不？」须菩提言：「甚多！世尊！彼善男子善女人，得福甚多。」</p><p>佛告须菩提：「以七宝满尔所恒河沙世界，持用布施。若善男子善女人，于此法门，乃至受持四句偈等，为他人说，而此福德，胜前福德无量阿僧祇。复次，须菩提！随所有处，说是法门，乃至四句偈等，当知此处，一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗，皆应供养，如佛塔庙。何况有人，尽能受持读诵此经。须菩提！当知是人，成就最上第一希有之法。若是经典所在之处，则为有佛，若尊重似佛。」</p><p>尔时，须菩提白佛言：「世尊！当何名此法门？我等云何奉持？」</p><p>佛告须菩提：「是法门名为金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。以是名字，汝当奉持。何以故？须菩提！佛说般若波罗蜜，则非般若般罗蜜。</p><p>「须菩提！于意云何？如来有所说法不？」须菩提言：「世尊！如来无所说法。」</p><p>「须菩提！于意云何？三千大千世界所有微尘，是为多不？」须菩提言：「彼微尘甚多，世尊！」「须菩提！是诸微尘，如来说非微尘，是名微尘。如来说世界，非世界，是名世界。」</p><p>佛言：「须菩提！于意云何？可以三十二大人相见如来不？」须菩提言：「不也！世尊！何以故？如来说三十二大人相，即是非相，是名三十二大人相。」</p><p>佛言：「须菩提！若有善男子善女人，以恒河沙等身命布施，若复有人，于此法门中，乃至受持四句偈等，为他人说，其福甚多无量阿僧祇。」</p><p>尔时，须菩提闻说是经，深解义趣，涕泪悲泣，扪泪而白佛言：「希有！婆伽婆！希有！修伽陀！佛说如是甚深法门，我从昔来所得慧眼，未曾得闻如是法门。」</p><p>「何以故？须菩提！佛说般若波罗蜜，即非般若波罗蜜。」</p><p>「世尊！若复有人得闻是经，信心清净，则生实相，当知是人成就第一希有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。世尊！是实相者，则是非相，是故如来说名实相实相。世尊！我今得闻如是法门，信解受持，不足为难。若当来世，其有众生得闻是法门，信解受持，是人则为第一希有。何以故？此人<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>相、人相、众生相、寿者相。何以故？我相，即是非相；人相、众生相、寿者相，即是非相。何以故？离一切诸相，则名诸佛。」</p><p>佛告须菩提：「如是，如是。若复有人得闻是经，不惊不怖不畏，当知是人甚为希有。何以故？须菩提！如来说第一波罗蜜，非第一波罗蜜。如来说第一波罗蜜者，彼无量诸佛亦说波罗蜜，是名第一波罗蜜。</p><p>「须菩提！如来说忍辱波罗蜜，即非忍辱波罗蜜。何以故？须菩提！如我昔为歌利王割截身体。我于尔时，无我相，无众生相，无人相，无寿者相，无相，亦非无相。何以故？须菩提！我于往昔节节支解时，若有我相、众生相、人相、寿者相，应生嗔恨。须菩提！又念过去于五百世，作忍辱仙人，于尔所世，无我相，无众生相，无人相，无寿者相。</p><p>「是故须菩提！菩萨应离一切相，发阿耨多罗三藐三菩提心。何以故？若心有住，则为非住。不应住色生心，不应住声香味触法生心，应生无所住心。是故佛说菩萨心不住色布施。须菩提！菩萨为利益一切众生，应如是布施。」</p><p>须菩提言：「世尊！一切众生相，即是非相。何以故？如来说一切众生，即非众生。」</p><p>「须菩提！如来是真语者、实语者、如语者、不异语者。须菩提！如来所得法，所说法，无实无妄语。</p><p>「须菩提！譬如有人入闇，则无所见。若菩萨心住于事而行布施，亦复如是。须菩提！譬如人有目，夜分已尽，日光明照，见种种色。若菩萨不住于事行于布施，亦复如是。</p><p>「复次，须菩提！若有善男子善女人，能于此法门，受持读诵修行，则为如来以佛智慧，悉知是人，悉见是人，悉觉是人，皆得成就无量无边功德聚。</p><p>「须菩提！若有善男子善女人，初日分以恒河沙等身布施，中日分复以恒河沙等身布施，后日分复以恒河沙等身布施，如是舍恒河沙等无量身，如是百千万亿那由他劫以身布施。若复有人，闻此法门，信心不谤，其福胜彼无量阿僧祇，何况书写受持读诵修行，为人广说。</p><p>「须菩提！以要言之，是经有不可思议不可称量无边功德。此法门，如来为发大乘者说，为发最上乘者说。若有人能受持读诵修行此经，广为人说，如来悉知是人，悉见是人，皆成就不可思议不可称无有边无量功德聚。如是人等，则为荷担如来阿耨多罗三藐三菩提。何以故？须菩提！若乐小法者，则于此经，不能受持读诵修行，为人解说。若有我见众生见人见寿者见，于此法门，能受持读诵修行为人解说者，无有是处。</p><p>「须菩提！在在处处，若有此经，一切世间天人阿修罗所应供养。当知此处，则为是塔，皆应恭敬，作礼围绕，以诸华香而散其处。</p><p>「复次，须菩提！若善男子善女人，受持读诵此经，为人轻贱。何以故？是人先世罪业，应堕恶道。以今世人轻贱故，先世罪业则为消灭。当得阿耨多罗三藐三菩提。</p><p>「须菩提！我念过去无量阿僧祇阿僧祇劫，于然灯佛前，得值八十四亿那由他百千万诸佛，我皆亲承供养，无空过者。须菩提！如是无量诸佛，我皆亲承供养，无空过者。若复有人，于后世末世，能受持读诵修行此经，所得功德，我所供养诸佛功德，于彼百分不及一，千万亿分，乃至算数譬喻所不能及。</p><p>「须菩提！若有善男子善女人，于后世末世，有受持读诵修行此经，所得功德，若我具说者，或有人闻，心则狂乱，疑惑不信。须菩提！当知是法门不可思议，<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>亦不可思议。」</p><p>尔时，须菩提白佛言：「世尊！云何菩萨发阿耨多罗三藐三菩提心？云何住？云何修行？云何降伏其心？」</p><p>佛告须菩提：「菩萨发阿耨多罗三藐三菩提心者，当生如是心：我应灭度一切众生，令入无余涅槃界。如是灭度一切众生已，而无一众生实灭度者。何以故？须菩提！若菩萨有众生相、人相、寿者相，则非菩萨。何以故？须菩提！实无有法，名为菩萨发阿耨多罗三藐三菩提心者。</p><p>「须菩提！于意云何？如来于然灯佛所，有法得阿耨多罗三藐三菩提不？」</p><p>须菩提白佛言：「不也！世尊！如我解佛所说义，佛于然灯佛所，无有法得阿耨多罗三藐三菩提。」</p><p>佛言：「如是，如是。须菩提！实无有法，如来于然灯佛所得阿耨多罗三藐三菩提。须菩提！若有法如来得阿耨多罗三藐三菩提者，然灯佛则不与我受记：『汝于来世，当得作佛，号释迦牟尼。』以实无有法，得阿耨多罗三藐三菩提，是故然灯佛与我受记，作如是言：『摩那婆！汝于来世，当得作佛，号释迦牟尼。』何以故？须菩提！言如来者，即实真如。须菩提！若有人言如来得阿耨多罗三藐三菩提者，是人不实语。须菩提！实无有法，佛得阿耨多罗三藐三菩提。须菩提！如来所得阿耨多罗三藐三菩提，于是中不实不妄语。是故如来说一切法皆是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。须菩提！所言一切法一切法者，即非一切法，是故名一切法。</p><p>「须菩提！譬如有人，其身妙大。」须菩提言：「世尊！如来说人身妙大，则非大身，是故如来说名大身。」</p><p>佛言：「须菩提！菩萨亦如是。若作是言：『我当灭度无量众生。』则非菩萨。」</p><p>佛言：「须菩提！于意云何？颇有实法名为菩萨不？」须菩提言：「不也！世尊！实无有法名为菩萨。」</p><p>「是故佛说一切法，无我无众生无人无寿者。须菩提！若菩萨作是言：『我庄严佛国土。』是不名菩萨。何以故？如来说庄严佛土庄严佛土者，即非庄严，是名庄严佛国土。须菩提！若菩萨通达无我、无我法者，如来说名真是菩萨菩萨。</p><p>「须菩提！于意云何？如来有肉眼不？」须菩提言：「如是，世尊！如来有肉眼。」</p><p>佛言：「须菩提！于意云何？如来有天眼不？」须菩提言：「如是，世尊！如来有天眼。」</p><p>佛言：「须菩提！于意云何？如来有慧眼不？」须菩提言：「如是，世尊！如来有慧眼。」</p><p>佛言：「须菩提！于意云何？如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不？」须菩提言：「如是，世尊！如来有法眼。」</p><p>佛言：「须菩提！于意云何？如来有佛眼不？」须菩提言：「如是，世尊！如来有佛眼。」</p><p>佛言：「须菩提！于意云何？如恒河中所有沙，佛说是沙不？」须菩提言：「如是，世尊！如来说是沙。」</p><p>佛言：「须菩提！于意云何？如一恒河中所有沙，有如是等恒河，是诸恒河所有沙数佛世界，如是世界，宁为多不？」须菩提言：「彼世界甚多，世尊！」</p><p>佛言：「须菩提！尔所世界中，所有众生，若干种心住，如来悉知。何以故？如来说诸心住，皆为非心住，是名为心住。何以故？须菩提！过去心不可得，现在心不可得，未来心不可得。</p><p>「须菩提！于意云何？若有人以满三千大千世界七宝持用布施，是善男子善女人，以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，得福多不？」须菩提言：「如是！世尊！此人以是因缘，得福甚多。」</p><p>佛言：「如是如是，须菩提！彼善男子善女人，以是因缘，得福德聚多。须菩提！若福德聚有实，如来则不说福德聚福德聚。</p><p>「须菩提！于意云何？佛可以具足色身见不？」须菩提言：「不也！世尊！如来不应以色身见。何以故？如来说具足色身，即非具足色身，是故如来说名具足色身。」</p><p>佛言：「须菩提！于意云何？如来可以具足诸相见不？」须菩提言：「不也！世尊！如来不应以具足诸相见。何以故？如来说诸相具足，即非具足，是故如来说名诸相具足。」</p><p>佛言：「须菩提！于意云何？汝谓如来作是念：我当有所说法耶？须菩提！莫作是念。何以故？若人言如来有所说法，即为谤佛，不能解我所说故。何以故？须菩提！如来说法说法者，无法可说，是名说法。」</p><p>尔时，慧命须菩提白佛言：「世尊！颇有众生，于未来世，闻说是法，生信心不？」</p><p>佛言：「须菩提！彼非众生，非不众生。何以故？须菩提！众生众生者，如来说非众生，是名众生。」</p><p>佛言：「须菩提！于意云何？如来得阿耨多罗三藐三菩提耶？」须菩提言：「不也！世尊！世尊，无有少法如来得阿耨多罗三藐三菩提。」</p><p>佛言：「如是如是，须菩提！我于阿耨多罗三藐三菩提，乃至无有少法可得，是名阿耨多罗三藐三菩提。复次，须菩提！是法平等，无有高下，是名阿耨多罗三藐三菩提。以无众生无人无寿者，得平等阿耨多罗三藐三菩提，一切善法得阿耨多罗三藐三菩提。须菩提！所言善法善法者，如来说非善法，是名善法。</p><p>「须菩提！三千大千世界中，所有诸须弥山王，如是等七宝聚，有人持用布施，若人以此般若波罗蜜经，乃至四句偈等，受持读诵，为他人说，于前福德，百分不及一，千分不及一，百千万分不及一，歌罗分不及一，数分不及一，优波尼沙陀分不及一，乃至算数譬喻所不能及。</p><p>「须菩提！于意云何？汝谓如来作是念，我度众生耶？须菩提！莫作是念。何以故？实无有众生如来度者。」</p><p>佛言：「须菩提！若有实众生如来度者，如来则有我人众生寿者相。须菩提！如来说有我者，则非有我，而毛道凡夫生者以为有我。须菩提！毛道凡夫生者，如来说名非生，是故言毛道凡夫生。</p><p>「须菩提！于意云何？可以相成就得见如来不？」须菩提言：「如我解如来所说义，不以相成就得见如来。」佛言：「如是如是！须菩提！不以相成就得见如来。」佛言：「须菩提！若以相成就观如来者，转轮圣王应是如来，是故非以相成就得见如来。」尔时，世尊而说偈言：</p><p>「若以色见我　以音声求我　是人行邪道　不能见如来</p><p>彼如来妙体　即法身诸佛　法体不可见　彼识不能知</p><p>「须菩提！于意云何？如来可以相成就得阿耨多罗三藐三菩提耶？须菩提！莫作是念：如来以相成就得阿耨多罗三藐三菩提。须菩提！汝若作是念，菩萨发阿耨多罗三藐三菩提心者，说诸法断灭相。须菩提！莫作是念。何以故？菩萨摩诃萨发阿耨多罗三藐三菩提心者，于法不说断灭相故。</p><p>「须菩提！若善男子善女人，以满恒河沙等世界七宝，持用布施。若有菩萨，知一切法无我，得无生法忍。此功德胜前所得福德。须菩提！以诸菩萨不取福德故。」</p><p>须菩提白佛言：「世尊！菩萨不取福德？」佛言：「须菩提！菩萨受福德，不取福德，是故菩萨取福德。</p><p>「须菩提！若有人言：如来若去若来若住若坐若卧，是人不解我所说义。何以故？如来者，无所至去，无所从来，故名如来。</p><p>「须菩提！若善男子善女人，以三千大千世界微尘。复以尔许微尘世界，碎为微尘阿僧祇。须菩提！于意云何？是微尘众，宁为多不？」须菩提言：「彼微尘众甚多！世尊！何以故？若是微尘众实有者，佛则不说是微尘众。何以故？佛说微尘众，则非微尘众，是故佛说微尘众。世尊！如来所说三千大千世界，则非世界，是故佛说三千大千世界。何以故？若世界实有者，则是一合相。如来说一合相，则非一合相，是故佛说一合相。」</p><p>佛言：「须菩提！一合相者，则是不可说，但凡夫之人，贪著其事。何以故？须菩提！若人如是言：佛说我见人见众生见寿者见。须菩提！于意云何？是人所说，为正语不？」须菩提言：「不也！世尊！何以故？世尊！如来说我见人见众生见寿者见，即非我见人见众生见寿者见，是名我见人见众生见寿者见。」</p><p>「须菩提！菩萨发阿耨多罗三藐三菩提心者，于一切法，应如是知，如是见，如是信，如是不住法相。何以故？须菩提！所言法相法相者，如来说即非法相，是名法相。须菩提！若有菩萨摩诃萨以满无量阿僧祇世界七宝，持用布施。若有善男子善女人，发菩萨心者，于此般若波罗蜜经，乃至四句偈等，受持读诵，为他人说，其福胜彼无量阿僧祇。云何为人演说而不名说，是名为说。」尔时，世尊而说偈言：</p><p>「一切有为法　如星翳灯幻　露泡梦电云　应作如是观」</p><p>佛说是经已，长老须菩提，及诸比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞优婆夷、菩萨摩诃萨、一切世间天人阿修罗乾闼婆等，闻佛所说，皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，信受奉行。</p></div>"
    },
    {
        "title": "金刚能断般若波罗蜜经 【隋 三藏笈多译】",
        "date": "2014-02-11",
        "author": "三藏笈多",
        "html": "<div class=\"B1_text\"><p><strong>金刚能断<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经</strong><br />&#13;隋　<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>　笈多　译</p><p>如是我闻。一时，<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>闻者游行胜林中，无亲搏施与园中。大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众，共半三十比丘百。尔时，世尊前分时。上裙著已，器上络，衣持。闻者大城搏为入。尔时，世尊闻者大城搏为行已。作已食，作已后食，搏堕过器上络，衣收摄，两足洗，坐具世尊施设，如是座中跏趺结直身。作现前念近住。尔时，多比丘若世尊彼诣到已，世尊两足<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>，世尊边三右绕，作已，一边坐彼。</p><p>复时，命者善实，彼所如是众聚集会坐。尔时，命者善实起坐。一肩上著作已，右膝轮地著已，若世尊彼合掌向世尊边，如是言：「希有！世尊！乃至所有如来应正椟知！菩萨摩诃萨顺摄，最胜顺摄；乃至所有如来应正椟知！菩萨摩诃萨付嘱，最胜付嘱。彼云何，世尊！菩萨乘发行住应？云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>应？云何心降伏应？」</p><p>如是语已。世尊命者善实边如是言：「善！善！善实，如是。善实，如是如是！顺摄，如来，菩萨摩诃萨最胜顺摄；付嘱，如来，菩萨摩诃萨最胜付嘱。彼，善实！听善，善意念作，说当如菩萨乘发行住应，如修行应，如心降伏应。」「如是！世尊！」命者善实世尊边：「愿欲闻。」</p><p>世尊于此言：「此，善实！菩萨乘发行，如是心发生应：所有，善实！<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>摄摄已，卵生、若胎生、若湿生、若化生，若色、若无色，若想、若无想、若非想非无想。所有众生界施设已，彼我一切无受余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>界灭度应。如是无量虽众生灭度，无有一众生灭度有。彼何所因？若，善实！菩萨摩诃萨众生想转，不，彼菩萨摩诃萨名说应。彼何所因？不，彼，善实！菩萨名说应，若众生想转，寿想若，人想若转。</p><p>「虽然复次时，善实！不菩萨摩诃萨事住施与应，无所住施与应，不色住施与应，不声香味触法中住施与应。如是此，善实！菩萨摩诃萨施与应。如不相想亦住。彼何所因？若，善实！菩萨摩诃萨不住施与，彼所，善实！福聚不可量受取！</p><p>「彼何意念？善实！可前方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>量受取？」善实言：「不如此。世尊！」</p><p>世尊言：「如是右（南）后（西）高（北）下上方顺不正方，普十方可虚空量受取？」善实言：「不如此。世尊！」</p><p>世尊言：「如是！如是！善实！如是，如是。若菩萨摩诃萨不住施与，彼所，善实！福聚不可量受取。虽然复次时，善实！如是菩萨乘发行施与应，如不相想亦住。</p><p>「彼何意念？善实！相具足如来见应？」善实言：「不，世尊！相具足如来见应。彼何所因？若彼如来相具足说，彼如是非相具足！」</p><p>如是语已。世尊，命者善实边如是言：「所有，善实！相具足所有妄，所有不相具足所有不妄，名此相不相如来见应。」</p><p>如是语已。命者善实世尊边如是言：「虽然，世尊！颇有众生，当有未来世，后时、后长时、后分五百，<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>破坏时中，转时中，若此中，如是色类经中说中，实想发生当有？」</p><p>世尊言：「莫，善实！汝如是语。『虽然，世尊！颇有众生，当有未来世，后时，后长时，后分五百，正法破坏时中，转时中，若此中，如是色类经中说中，实想发生当有？』虽然复次时，善实！当有未来世，菩萨摩诃萨，后分五百，正法破坏时中，转时中，戒究竟、<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>究竟、<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>究竟，不复次时彼，善实！菩萨摩诃萨一佛亲近<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>当有，不一佛种植善根。虽然复次时，善实！不一佛百千亲近供养，不一佛百千种植善根，彼菩萨摩诃萨当有，若此中，如是色类中，经句中说中，一心净信亦得当。知彼，善实！如来佛智；见彼，善实！如来佛眼，一切彼，善实！无量福聚生当取当！彼何所因？不，善实！彼等菩萨摩诃萨我想转，不众生想，不寿想，不人想转。不亦彼等，善实！菩萨摩诃萨，法想转，无法想转；不亦彼等，想、无想转不。彼何所因？若善实！彼等菩萨摩诃萨法想转，彼如是彼等我取有，众生取、寿取、人取有；若无法想转，彼如是彼等我取有，众生取、寿取、人取有。彼何所因？不，复次时，善实！菩萨摩诃萨法取应，不非法取应。彼故此义意，如来说筏喻法本解，法如是舍应，何况非法！」</p><p>复次，世尊命者善实边如是言：「彼何意念？善实！有如来应正椟知，无上正椟知证觉？有复法如来说？」善实言：「如我，世尊！世尊说义解我，无有一法若如来无上正椟知证觉；无有一法若如来说。彼何所因？若彼如来法说，不可取，彼不可说，不彼法，非不法。彼何因？<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>显明<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。」</p><p>世尊言：「彼何意念？善实！若有善家子若，善家女若，此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝满作已，如来等应等正椟知等施与。彼何意念？善实！虽然，彼善家子若，善家女若，彼缘多福聚生？」善实言：「多！世尊！多！善逝！彼善家子若，善家女若，彼缘多福聚生！彼何所因？若彼，世尊！福聚，如来说非福聚，彼世尊如来说福聚福聚者。」世尊言：「若复善实！善家子若，善家女若，此三千大千世界七宝满作已，如来等应等正椟知等施与。若此法本，乃至四句等偈受已，为他等分别广说，此彼缘多过，福聚生无量，不可数。彼何所因？此出，善实！如来应正椟知无上正椟知；此生佛世尊。彼何所因？佛、法佛、法者，善实！非佛、法，如是彼，彼故说名佛、法者。」</p><p>世尊言：「彼何意念？善实！虽然，流入如是念：『我流入果得到』？」善实言：「不如此！世尊！彼何所因？不彼，世尊！一人彼故，说名流入。不色入，不声不香不味不触不法入，彼故说名流入者。彼若，世尊！流入如是念：『我流入果得到』，彼如是，彼所我取有，众生取、寿取、人取有。」</p><p>世尊言：「彼何意念？善实！虽然，一来如是念。『我一来果得到』？」善实言：「不如此，世尊！彼何所因？不一来如是念：『我一来果得到』。彼何所因？不彼有法，若一来人，彼故说名一来者。」</p><p>世尊言：「彼何意念？善实！虽然，不来如是念：『我不来果得到』？」善实言：「不如此，世尊！彼何所因？不彼有法，若不来人，彼故说名不来者。」</p><p>世尊言：「彼何意念？善实！虽然，应如是念：『我应得到』？」善实言：「不如此，世尊！彼何所因？不彼，世尊！有法若应名，彼故说名应者。彼若，世尊！应如是念：『我应得到』，如是彼所我取有，众生取、寿取、人取有。彼何所因？我此，世尊！如来应正椟知，无诤行最胜说我，此，世尊！应离欲，不，我，世尊！如是念我此应者，若我，世尊！如是念：『我应得到』，不我，如来记说无诤行最胜，善实！善家子无所行，彼故说名无诤行无诤<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。」</p><p>世尊言：「彼何意念？善实！有一法，若如来灯作如来应正椟知受取？」善实言：「不如此，世尊！无一法，若如来灯作如来应正椟知受取。」</p><p>世尊言：「若有，善实！菩萨摩诃萨如是语：我国土<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>成就我者，彼不如语。彼何所因？国土庄严者，善实！不庄严彼如来说，彼故说名国土庄严者。彼故此，善实！菩萨摩诃萨如是不住心发生应，不色住心发生应，不声香味触法住心发生应，无所住心发生应！</p><p>「譬如，善实！丈夫有此如是色我身有，譬如善高山王。彼何意念？善实！虽然彼大我身有？」善实言：「大！世尊！大！善逝！彼我身有。彼何所因？我身我身者，世尊！不有彼如来说，彼故说名我身者。不彼，世尊！有彼故说名我身者。」</p><p>世尊言：「彼何意念？善实！所有恒伽大河，沙彼所有，如是恒伽大河有，彼中若沙，虽然彼多沙有？」善实言：「彼如是所有，世尊！多恒伽大河有，何况若彼中沙！」世尊言：「欲我汝，善实！知我汝所有彼中恒伽大河中沙有，彼所有世界有，如是妇女若，丈夫若，七宝满作已，如来等应等正椟知等施与。彼何意念？善实！虽然彼妇女若，丈夫若，彼缘多福聚生？」善实言：「多！世尊！多！善逝！彼妇女若，丈夫若，彼缘多福聚生无量不可数。」世尊言：「若复时，善实！善家子若，善家女若，彼所有世界七宝满作已，如来等应等正椟知等施与。若此法本，乃至四句等偈受已，为他等分别广说，此如是彼缘多过福聚生，无量不可数！虽然复次时，善实！此中地分，此法本乃至四句等偈，为他等说若，分别若，广说若，彼地分支帝，有<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗世。何复言，善实！若此法本，持当、读当、诵当，他等及分别广说当，最胜彼希有具足当。有此中，善实！地分，教师游行，别异尊重处，相似共梵行。」</p><p>如是语已。命者善实世尊边如是言：「何名此，世尊！法本？云何及如此持我？」如是语已，世尊命者善实边如是言：「智慧<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>到，名此，善实！法本。如是此持。彼何所因？若如是，善实！智慧彼岸到，如来说彼如是，非彼岸到，彼故说名智慧彼岸到者。彼何意念？善实！虽然，有法若如来说？」善实言：「不如此，世尊！不有，世尊！法若如来说。」</p><p>世尊言：「所有，善实！三千大千世界地尘有多有？」善实言：「多！世尊！多！善逝！彼地尘。彼何所因？若彼，世尊！地尘如来说，非尘彼如来说，彼故说名地尘者。若彼世界如来说，非界如来说，彼故说名世界者。」</p><p>世尊言：「彼何意念？善实！三十二大丈夫相，如来应正椟知见应？」善实言：「不如此，世尊！不三十二大丈夫相，如来应正椟知见应。彼何所因？所有，世尊！三十二大丈夫相如来说，非相所有如来说，彼故说名三十二大丈夫相者。」</p><p>世尊言：「若复时，善实！妇女若，丈夫若，日日恒伽河沙等我身舍，如是舍恒伽河沙等劫所有我身舍若，此法本乃至四句等偈，受已，为他等分别，此如是彼缘多过福聚生，无量不可数。」</p><p>尔时，命者善实，法疾转力泪出，彼泪拭已，世尊边如是言：「希有！世尊！最胜希有！善逝！所有此法本如来说，此我，世尊！智生，不我曾生来，如是色类法本闻，先最胜彼，世尊！希有！具足众生有当，若此经中说中，实想发生当。彼何所因？若此，世尊！实想，彼如是非想，彼故如来说实想实想者。不，我，世尊！希有！若我此法本说中，信我、解我。若彼，世尊！众生有当，未来世，此法本，受当、持当、读当、诵当，他等及分别广说当，彼最胜希有具足有当。虽然复次时，世尊！不彼等菩萨摩诃萨我想转当，不众生想、不寿想、不人想转当。彼何所因？若彼，世尊！我想，彼如是非想；若及如是众生想、寿想、人想，彼如是非想。彼何所因？一切想远离，此佛世尊。」</p><p>如是语已，世尊命者善实边如是言：「如是！如是！善实！如是如是！如言汝，最胜希有具足彼众生有当，若此经中说中，不惊当，不怖当，不畏当。彼何所因？最胜彼岸到。此，善实！如来说。若及，善实！如来最胜彼岸到说，彼无量亦佛世尊说，彼故说名最胜彼岸到者。虽然复次时，善实！若如来忍彼岸到，彼如是非彼岸到。彼何所因？此时我，善实！恶王分别分肉割断，不时我彼中时，我想若，众生想若，寿想若，人想若，不我有想非想有。彼何所因？若我，善实！彼中实我想有，嗔恨想亦我彼中时有；众生想、寿想、人想有，嗔恨想亦我彼中时有。念知我，善实！过去世五百生，若我忍语仙人，有彼中亦我不想有，不众生想、不寿者想、不人想。不亦我有想非想有。</p><p>「彼故此，善实！菩萨摩诃萨一切想舍离，无上正椟知心发生应，不色住心发生应，不声香味触住心发生应，不法住、非无法住心发生应，无所住心发生应。彼何所因？若无所住彼，如是住彼故。如是，如来说，不色住，菩萨摩诃萨施与应；不声香味触法住施与应。虽然复次时，善实！菩萨摩诃萨如是舍施应，一切众生为故，彼何所因？若如是，善实！众生想，彼如是非想，若如是彼一切众生如来说，彼如是非众生。彼何所因？真语，善实！如来，实语如来，不异语如来，如语如来，非不如语如来。虽然复次时，善实！若如来法证觉说若，思惟若，不彼中实不妄。譬如，善实！丈夫闇舍入，不一亦见。如是事堕菩萨见应，若事堕施与。譬如，善实！眼者丈夫，显明夜月出，种种色见。如是菩萨摩诃萨见应，若事不堕施与。虽然复次时，善实！若善家子、善家女若，此法本，受当、持当、读当、诵当，为他等及分别广说当，知彼，善实！如来佛智；见彼，善实！如来佛眼。一切彼，善实！众生无量福聚，生当、取当。</p><p>「若复时，善实！妇女若、丈夫若，前分时，恒伽河沙等我身舍，如是，中分时；如是，晚分时，恒伽河沙等我身舍。以此<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，劫俱致那由多百千我身舍。若此法本，闻已不谤，此如是彼缘多过福聚生，无量不可数。何复言若写已<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵，为他等及分别广说。虽然复次时，善实！不可思、不可称，此法本彼不可思，如是<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>观察应。此，善实！法本如来说，胜乘发行众生为故，最胜乘发行众生为故。若此法本，受当、持当、读当、诵当，为他等及分别广说当。知彼，善实！如来佛智；见彼，善实！如来佛眼。一切彼，善实！众生无量福聚具足有当，不可思、不可称、亦不可量福聚具足有当。一切彼，善实！众生我肩<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>持当有！彼何所因？不能，善实！此法本小信解者众生闻，不我见者，不众生见者，不寿见者，不人见者，不菩萨誓众生能闻，受若、持若、读若、诵若，无是处有。虽然复次时，善实！此中地分，此经广说，供养彼地分有当，天人阿修罗世礼右绕作，及彼地分有当，支帝彼地分有当。</p><p>「若彼，善实！善家子若，善家女若，此如是色类经，受当、持当、读当、诵当，为他等及分别广说当，彼轻贱有当极轻贱。彼何所因？所有彼众生前生不善业作已，恶趣转堕。所有现如是法中，轻贱尽当，佛菩提得当。彼何所因？念知我，善实！过去世不可数劫不可数，过灯作如来应正椟知他。他过四八十佛俱致那由多百千有，若我亲承供养，亲承供养已不远离。若我，善实！彼佛世尊亲承供养已不远离，若后时长时后分五百，正法破坏时中转时中，此经受当、持当、读当、诵当，为他等及分别广说当。此复时，善实！福聚边，此前福聚，百上亦数不及，千上亦，百千上亦，俱致百千上亦，俱致那由多百千上亦，僧企耶亦，迦罗亦，算亦，譬喻亦，忧波泥奢亦，乃至譬喻亦不及。若复，善实！彼等善家子、善家女，我福聚说，此所有彼善家子、善家女若，彼中时中福聚取当，狂众生顺到，心乱到。虽然复次时，善实！不可思、不可称，法本如来说，彼不可思，如是果报观察应。」</p><p>尔时，命者善实世尊边如是言：「云何，世尊！菩萨乘发行住应？云何修行应？云何心降伏？」世尊言：「此，善实！菩萨乘发行，如是心发生应：一切众生，我无受余涅槃界灭度应。如是一切众生灭度，无有一众生灭度有。彼何所因？若善实！菩萨众生想转，不彼菩萨摩诃萨名说应。乃至人想转，不彼菩萨摩诃萨名说应。彼何所由！无有，善实！一法菩萨乘发行名。彼何意念？善实！有一法若如来灯作如来应正椟知边，无上正椟知证觉？」如是语已。命者善实世尊边如是言：「无有彼，世尊！一法若如来灯作如来应正椟知边，无上正椟知证觉。」如是语已。世尊命者善实边如是言：「如是！如是！善实！如是如是！无有彼一法若如来灯作如来应正椟知边，无上正椟知证觉。若复，善实！一法如来证觉有，不我灯作如来应正椟知记说有当：『汝行者，未来世，释迦牟尼名如来应正椟知者。』是故，此，善实！如来应正椟知，无有一法，若无上正椟知证觉，彼故灯作如来应正椟知记说有当：『汝行者，未来世，释迦牟尼名如来应正椟知。』彼何所因？如来者，善实！真如故此即是；如来者，善实！不生法故此即是；世尊者，善实！道断此即是；如来者，善实！毕竟不生故此即是。彼何所因？如是彼实不生若最胜义。</p><p>「若有，善实！如是语：『如来应正椟知无上正椟知证觉。』彼不如语，诽谤我，彼，善实！不实取。彼何所因？无有彼，善实！一法若如来应正椟知无上正椟知证觉，若，善实！如来法证觉说，若不彼中实不妄，彼故如来说，一切法<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者。彼何所因？一切法、一切法者，善实！一切彼非法，如来说彼故说名一切法者。譬如，善实！丈夫有具足身大身。」命者善实言：「若彼，世尊！如来丈夫说具足身大身，非身彼，世尊！如来说，彼故说具足身大身者。」世尊言：「如是！如是！善实！如是如是！若菩萨如是言：『我众生般涅槃灭度。』我不彼菩萨名说应。彼何所因？有，善实！有一法若菩萨名？」善实言：「不如此！世尊！」世尊言：「众生众生者，善实！非众生彼如来说，彼故说名众生者。彼故如来说<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>一切法，无众生、无寿者、无长养者、无人，一切法者。若，善实！菩萨如是语：『我佛土庄严成就』。彼亦如是不名说应。彼何所因？国土庄严国土庄严者，善实！非庄严彼如来说，彼故说名国土庄严者。若，善实！菩萨摩诃萨无我法、无我法者信解，彼如来应正椟知菩萨摩诃萨名说。</p><p>「彼何意念？善实！有如来肉眼？」善实言：「如是如是！世尊！有如来肉眼。」</p><p>世尊言：「彼何意念？善实！有如来天眼？」善实言：「如是如是！世尊！有如来天眼。」</p><p>世尊言：「彼何意念？善实！有如来慧眼？」善实言：「如是如是！世尊！有如来慧眼。」</p><p>世尊言：「彼何意念？善实！有如来<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>？」善实言：「如是如是！世尊！有如来法眼。」</p><p>世尊言：「彼何意念？善实！有如来佛眼？」善实言：「如是如是！世尊！有如来佛眼。」</p><p>世尊言：「善！善！善实！彼何意念？善实！所有恒伽大河沙，虽然彼沙彼如来说？」善实言：「如是！如是！世尊！如是！如是！善逝！说彼如来彼沙。」</p><p>世尊言：「彼何意念？善实！所有恒伽大河沙，彼所有恒伽大河有，所有彼中沙，彼所有及世界有，多彼世界有？」善实言：「多！世尊！多！善逝！彼世界有。」</p><p>世尊言：「所有，善实！彼中世界中众生，彼等我种种有心流注知。彼何所因？心流注、心流注者，善实！非流注，此如来说彼故，说名心流注者。彼何所因？过去，善实！心不可得，未来心不可得，现有心不可得。</p><p>「彼何意念？善实！若有善家子若，善家女若，三千大千世界七宝满作已施与，虽然，彼善家子、善家女若，彼缘多福聚生？」善实言：「多！世尊！多！善逝！」世尊言：「如是，如是，善实！如是如是多。彼善家子若，善家女若，彼缘多福聚生无量不可数。福聚福聚者，善实！非聚彼如来说，彼故说名福聚者。若复，善实！福聚有，不如来说福聚福聚者。</p><p>「彼何意念？善实！色身成就如来见应？」善实言：「不如此！世尊！非色身成就如来见应。彼何所因？色身成就、色身成就者，世尊！非成就此如来说，彼故说名色身成就者。」</p><p>世尊言：「彼何意念？善实！相具足如来见应？」善实言：「不如此！世尊！非相具足如来见应。彼何所因？此世尊相具足如来说，非相具足如来说，彼故说名相具足者。」</p><p>世尊言：「彼何意念？善实！虽然，如来如是念我法说？」善实言：「不如此！世尊！不如来如是念我法说。」世尊言：「若我，善实！如是语：『如来法说』，诽谤我！彼，善实！不实取。彼何所因？法说、法说者。善实！无有法，若法说名可得。</p><p>尔时，命者善实世尊边如是言：「虽然，世尊！当有未来，颇有众生，后时、后长时、后分五百，正法破坏时中，转时中，若此如是色类法说，闻已信当有？」世尊言：「不，彼，善实！众生，非不众生。彼何所因？众生、众生者，善实！一切彼非众生，彼如来说，彼故说名众生者。</p><p>「彼何意念？善实！虽然，有法若如来无上正椟知证觉？」命者善实言：「无有彼，世尊！有法若如来无上正椟知。」世尊言：「如是！如是！善实！如是！如是！微小彼中法无有不可得，彼故说名无上正椟知者。虽然复次时，善实！平等正法，彼不中有不平等，彼故说名无上正椟知者。无我故、无寿故、无众生故、无人故，平等无上正椟知，一切善法证觉。善法、善法者，善实！非法，如是，彼如来说，彼故说名善法者。</p><p>「若复，善实！所有三千大千世界须弥山王，彼所有聚七宝，普散如来应等正椟知施与。若此智慧彼岸到，乃至四句等偈，受已，为他等分别，此，善实！福聚，彼前者福聚，百上亦数不及，千上亦，百千上亦，俱致百千上亦，俱致那由他百千上亦，僧企耶亦，迦罗亦，算亦，譬喻亦，忧波泥奢亦，乃至譬喻亦不及。彼何意念？善实！虽然，如来如是念：『我众生度脱』不？复彼，善实！如是见应。彼何所因？有无，善实！无有一众生若如来度脱。若复，善实！有如是众生有若彼如来度脱，彼如是如来我取有，众生取、寿取、人取有。我取、我取者，善实！非取，此如来说，彼小儿凡夫生取。小儿凡夫生、小儿凡夫生者，善实！非生彼，如来说，彼故说名小儿凡夫生者。</p><p>「彼何意念？善实！相具足如来见应？」善实言：「不如此，世尊！如我，世尊说义解，我不相具足如来见应。」世尊言：「善！善！善实！如是！如是！善实！如如语汝，不相具足如来见应。彼何所因？彼复，善实！相具足如来见应。有彼王转轮，如来有彼故，不相具足如来见应。此相非相故，如来见应。」尔时，命者善实世尊边如是言：「如我，世尊！世尊说义解，我不相具足如来见应。」尔时，世尊彼时此伽陀说：</p><p>「若我色见　若我声求　邪<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>行　我不见彼</p><p>法体佛见应法身彼如来法体及不识故彼不能知</p><p>「彼何意念？善实！相具足如来无上正椟知证觉不？复彼，善实！如是见应。彼何所因？不，善实！相具足如来无上正椟知证觉。复时，彼，善实！有如是语，菩萨乘发行有法破灭施设断，不复，善实！如是见应。彼何所因不？菩萨乘发行有法破灭施设不断。</p><p>「若复，善实！善家子若、善家女若，恒伽河沙等世界七宝满作已施与若，菩萨摩诃萨无生中、法中忍得，此如是，彼缘多过福聚生。不复，善实！菩萨福聚取应？」命者善实言：「不，世尊！菩萨福聚取应，彼故说名取应。」</p><p>虽然复次时，善实！若有如是语：如来去若，不去若，住若，坐若，卧若，<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>不我，善实！说义解。彼何所因？如来者，善实！说名无所去，无所来。彼故说名如来应正椟知者。</p><p>「若复，善实！善家子若、善家女若，所有三千大千世界地尘，彼如是色类墨作已，乃至如是不可数，譬如最小聚。彼何意念？善实！虽然，彼多最小聚有？」善实言：「如是！如是！世尊！多彼最小聚有。彼何所因？彼？世尊！聚有，不世尊说最小聚者。彼何所因？若彼世尊最小聚说，非聚彼如来说，彼故说名最小聚者。若及如来说三千大千世界者，非界如来说，彼故说名三千大千世界者。彼何所因？彼，世尊！界有，彼如是抟取有，若如是如来抟取说，非取，彼如来说，彼故说名抟取者。」世尊言：「抟取如是，善实！不世俗语，不可说，非法，非非法，彼小儿凡夫生取。彼何所因？若此有，善实！如是说：『我见，如来说，众生见、寿见、人见，如来说。』虽然彼，善实！正说语？」善实言：「不如此！世尊！不如此！善逝！彼何所因？若彼，世尊！我见如来说，非见彼如来说，彼故说名我见者。」世尊言：「如是！此，善实！菩萨乘发行一切法知应，见应，信解应。如信解，如无法想亦住。彼何所因？法想、法想者，善实！非想此如来说，彼故说名法想者。若复时，善实！菩萨摩诃萨无量无数世界七宝满中作已，如来等应等正椟知等施与，若善家子若，善家女若，如是智慧彼岸到，乃至四句等偈，受持分别读诵，为他等及分别广说，此如是彼缘多过福聚生，无量不可数。云何及广说，如不广说，彼故说名广说：</p><p>「星翳灯幻　露泡梦电　云见如是　此有为者」</p><p>此语，世尊，<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>上座善实，彼及比丘、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞、优婆夷，彼天、人、阿修罗、乾闼婆等。闻世尊说，大欢喜。</p><p>归命一切佛菩萨海等金刚能断般若波罗蜜经。</p></div>"
    },
    {
        "title": "金刚般若波罗蜜经【陈 真谛译】",
        "date": "2014-02-11",
        "author": "真谛",
        "html": "<div class=\"B1_text\"><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>陈　<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师　<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>　译</p><p>如是我闻。一时佛婆伽婆，住舍卫国，祇陀树林给孤独园。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，于日前分，著衣持皱，入舍卫大国而行乞食。于其国中次第行已，还至本处。饭食事讫，于中后时，收衣皱，洗足已。如常敷座，加趺安坐，端身而住，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>现前。时诸比丘俱往佛所，至佛所已，<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>佛足，右绕三匝，却坐一面。</p><p>尔时净命须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>，于大众中共坐聚集。时净命须菩提，即从座起，偏袒右肩，顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足，右膝著地，向佛合掌而白佛言：「希有世尊！如来应供正椟觉知，善护念诸菩萨摩诃萨，由无上利益故；善付嘱诸菩萨摩诃萨，由无上教故。世尊！若善男子善女人，发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>，行菩萨乘，云何应住？云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>？云何发起菩萨心？」</p><p>净命须菩提作是问已。尔时世尊告须菩提：「须菩提！善哉善哉！如是。善男子，如来善护念诸菩萨摩诃萨，无上利益故；善付嘱诸菩萨摩诃萨，无上教故。须菩提！是故汝今一心谛听，恭敬，善思念之。我今当为汝说。如菩萨发菩提心，行菩萨乘，如是应住，如是修行，如是<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。」</p><p>须菩提言：「唯然，世尊！」</p><p>佛告须菩提：「须菩提！若善男子善女人，发菩提心，行菩萨乘，应如是发心：所有一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>类摄，若卵生、若胎生、若湿生、若化生，若有色、若无色，若有想、若无想，若非有想、若非无想，乃至众生界，及假名说。如是众生，我皆安置于无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。如是般涅槃无量众生已，无一众生被涅槃者。何以故？须菩提！若菩萨有众生想，即不应说名为菩萨。何以故？须菩提！一切菩萨，<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>想、众生想、寿者想、受者想。</p><p>复次，须菩提，菩萨不著己类而行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，不著所余行于布施，不著色声香味触法应行布施。须菩提！菩萨应如是行施，不著相想。何以故？须菩提！若菩萨无执著心行于布施，是福德聚不可数量。须菩提！汝意云何？东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可数量不？」</p><p>须菩提言：「不可，世尊！」</p><p>佛言：「如是。须菩提！南西北方，四维上下，十方虚空，可数量不？」</p><p>须菩提言：「不可，世尊！」</p><p>佛言：「如是。须菩提！若菩萨无执著心行于布施，是福德聚亦复如是不可数量。</p><p>「须菩提！汝意云何？可以身相胜德见如来不？」</p><p>「不也。世尊！何以故？如来所说身相胜德，非相胜德。」</p><p>「何以故？须菩提！凡所有相，皆是虚妄。无所有相，即是真实。由相<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>，应见如来。」</p><p>如是说已，净命须菩提白佛言：「世尊！于今现时及未来世，颇有菩萨听闻正说如是等相此经章句，生实想不？」</p><p>佛告须菩提：「莫作是说：『于今现时及未来世，颇有菩萨听闻正说如是等相此经章句，生实想不？』何以故？须菩提！于未来世，实有众生，得闻此经，能生实想。复次，须菩提！于未来世，后五百岁，<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>灭时，有诸菩萨摩诃萨，持戒修福，及有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。须菩提！是诸菩萨摩诃萨，非事一佛，非于一佛种诸善根，已事无量百千诸佛，已于无量百千佛所而种善根。若有善男子善女人，听闻正说如是等相此经章句，乃至一念生实信者。须菩提！如来悉知是人，悉见是人。须菩提！是善男子善女人，生长无量福德之聚！何以故？须菩提！是诸菩萨无复我想、众生想、寿者想、受者想。</p><p>「是诸菩萨无法想，无非法想，无想，无非想。何以故？须菩提！是诸菩萨若有法想，即是<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>，及众生寿者受者执。须菩提！是故菩萨不应取法，不应取非法。为如是义故，如来说：若观行人，解筏喻经，法尚应舍，何况非法。」</p><p>佛复告净命须菩提：「须菩提！汝意云何？如来得阿耨多罗三藐三菩提耶？如来有所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>耶？」</p><p>须菩提言：「如我解佛所说义，无所有法如来所得，名阿耨多罗三藐三菩提；亦无有法，如来所说。何以故？是法如来所说，不可取，不可言；非法，非非法。何以故？一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，皆以无为真如所显现故。」</p><p>「须菩提！汝意云何？以三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>椟满七宝，若人持用布施，是善男子善女人，因此布施，生福多不？」</p><p>须菩提言：「甚多，世尊！甚多，修伽陀！是善男子善女人，因此布施，得福甚多。何以故？世尊！此福德聚，即非福德聚，是故如来说福德聚。」</p><p>佛言：「须菩提！若善男子善女人，以三千大千世界椟满七宝，持用布施。若复有人，从此经中受四句偈，为他正说，显示其义，此人以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>，所生福德，最多于彼无量无数。何以故？须菩提！如来无上菩提，从此福成。诸佛世尊，从此福生。何以故？须菩提！所言佛、法者，即非佛、法，是名佛、法。</p><p>「须菩提！汝意云何？须陀洹能作是念：『我得须陀洹果』不？」</p><p>须菩提言：「不也，世尊！何以故？世尊！实无所有能至于流，故说须陀洹。乃至色声香味触法亦复如是，故名须陀洹。</p><p>「斯陀含名一往来，实无所有能至往来，是名斯陀含。</p><p>「阿那含名为不来，实无所有能至不来，是名阿那含。」</p><p>佛言：「须菩提！汝意云何？阿罗汉能作是念：『我得阿罗汉果』不？」</p><p>须菩提言：「不也，世尊！何以故！实无所有名阿罗汉。世尊！若阿罗汉作是念：『我得阿罗汉果。』此念即是我执、众生执、寿者执、受者执。世尊！如来阿罗诃三藐三<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>，赞我住无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，人中最为第一。世尊！我今已成阿罗汉，离三有欲。世尊！我亦不作是念：『我是阿罗汉。』世尊！我若有是念：『我已得阿罗汉果。』如来则应不授我记：『住无诤三昧，人中须菩提善男子最为第一。』实无所住，住于无诤，住于无诤。」</p><p>佛告须菩提：「汝意云何？昔从然灯如来阿罗诃三藐三佛陀所，颇有一法，如来所取不？」</p><p>须菩提言：「不也，世尊！实无有法，昔从然灯如来阿罗诃三藐三佛陀所，如来所取。」</p><p>佛告须菩提：「若有菩萨作如是言：『我当<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>清净佛土。』而此菩萨说虚妄言。何以故？须菩提！庄严佛土者，如来说非庄严，是故庄严清净佛土。须菩提！是故菩萨应生如是无住著心，不住色声香味触法生心，应无所住而生其心。</p><p>「须菩提！譬如有人体相胜大，如须弥山王。须菩提！汝意云何？如是体相为胜大不？」</p><p>须菩提言：「甚大，世尊！何以故？如来说非有，名为有身，此非是有，故说有身。」</p><p>佛告须菩提：「汝意云何？于恒伽江所有诸沙，如其沙数所有恒伽，诸恒伽沙宁为多不？」</p><p>须菩提言：「甚多！世尊！但诸恒伽，尚多无数，何况其沙。」</p><p>佛言：「须菩提！我今觉汝，我今示汝：诸恒伽中所有沙数，如是沙等世界，若有善男子善女人，以七宝椟满，持施如来应供正椟觉知。须菩提！汝意云何？此人以是因缘，得福多不？」</p><p>须菩提言：「甚多，世尊！甚多，修伽陀！此人以是因缘，生福甚多！」「须菩提！若善男子善女人，以七宝椟满尔所恒伽沙世界，持用布施。若善男子善女人，从此经典乃至四句偈等，恭敬<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，为他正说。是人所生福德，最胜于彼无量无数！</p><p>「复次，须菩提！随所在处，若有人能从是经典，乃至四句偈等，读诵讲说。当知此处，于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>中即成支提，一切人天阿修罗等，皆应恭敬。何况有人，尽能受持读诵如此经典。当知是人，则与无上希有之法而共相应。是土地处，大师在中，或随有一可尊重人。」</p><p>佛说是已。净命须菩提白佛言：「世尊！如是经典，名号云何？我等云何奉持？」</p><p>佛告须菩提：「此经名为金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜。以是名字，汝当奉持。何以故？须菩提！是般若波罗蜜，如来说非般若波罗蜜。须菩提！汝意云何？颇有一法一佛说不？」</p><p>须菩提言：「世尊！无有一法一如来说。」</p><p>佛告须菩提：「三千大千世界所有微尘，是为多不？」</p><p>须菩提言：「此世界微尘，甚多，世尊！甚多，修伽陀！何以故？世尊！此诸微尘，如来说非微尘，故名微尘。此诸世界，如来说非世界，故说世界。」。</p><p>佛告须菩提：「汝意云何？可以三十二大人相见如来不？」</p><p>须菩提言：「不也，世尊！何以故？此三十二大人相，如来说非相，故说三十二大人相。」</p><p>佛告须菩提：「若有善男子善女人，如诸恒河所有沙数，如是沙等身命舍以布施。若有善男子善女人，从此经典，乃至四句偈等，恭敬受持，为他正说。此人以是因缘，生福多彼无量无数。」</p><p>尔时净命须菩提，由法利疾，即便悲泣。抆泪而言：「希有！世尊！希有！修伽陀！如此经典如来所说，我从昔来至得圣慧，未曾闻说如是经典。何以故？世尊说般若波罗蜜，即非般若波罗蜜，故说般若波罗蜜。世尊！当知是人，则与无上希有之法而共相应，闻说经时，能生实想。世尊！是实想者，实非有想，是故如来说名实想，说名实想。世尊！此事于我非为希有。正说经时，我生信解。世尊！于未来世，若有众生恭敬受持，为他正说，当知是人，则与无上希有之法而共相应。世尊！此人无复我想众生想寿者想受者想。何以故？我想众生想寿者想受者想，即是非想。何以故？诸佛世尊，<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>诸想尽无余故。」</p><p>说是言已。佛告须菩提：「如是，须菩提！如是。当知是人，则与无上希有之法而共相应。是人闻说此经，不惊不怖不畏。何以故？须菩提！此法如来所说，是第一波罗蜜。此波罗蜜，如来所说，无量诸佛亦如是说，是故说名第一波罗蜜。复次，须菩提！如来忍辱波罗蜜，即非波罗蜜。何以故？须菩提！昔时我为迦陵伽王斩斫身体，骨肉离碎。我于尔时，无有我想众生想寿者想受者想，无想，非无想。何以故？须菩提！我于尔时，若有我想众生想寿者想受者想，是时则应生嗔恨想。</p><p>「须菩提！我忆过去五百生中，作大仙人，名曰说忍。于尔生中，心无我想众生想寿者想受者想。是故须菩提！菩萨摩诃萨舍离一切想，于无上菩提应发起心，不应生住色心，不应生住声香味触心，不应生住法心，不应生住非法心，不应生有所住心。何以故？若心有住，则为非住。故如来说：菩萨无所住心应行布施。复次，须菩提！菩萨应如是行施，为利益一切众生。此众生想，即是非想。如是一切众生，如来说即非众生。何以故？诸佛世尊远离一切想故。须菩提！如来说实、说谛、说如、说非虚妄。复次，须菩提！是法如来所觉，是法如来所说，是法非实非虚。</p><p>「须菩提！譬如有人，在于盲暗，如是当知菩萨堕相，行堕相施。须菩提！如人有目，夜已晓时，昼日光照，见种种色，如是当知菩萨不堕于相，行无相施。复次，须菩提！于未来世，若有善男子善女人，受持读诵，教他修行，为他正说如是经典，如来悉知是人，悉见是人，生长无量福德之聚。</p><p>「复次，须菩提！若有善男子善女人，于日前分布施身命，如上所说诸恒沙数；于日中分布施身命，于日后分布施身命，皆如上说诸恒沙数。如是无量百千万亿劫，以身命布施。若复有人，闻此经典，不起诽谤，以是因缘，生福多彼无量无数。何况有人书写受持读诵，教他修行，为人广说。复次，须菩提！如是经典不可思量，无能与等。如来但为怜愍利益能行无上乘人，及行无等乘人说。若复有人，于未来世，受持读诵，教他修行，正说是经，如来悉知是人，悉见是人，与无数无量不可思议无等福聚而共相应。如是等人，由我身分，则能荷负无上菩提。何以故？须菩提！如是经典，若下愿乐人，及我见众生见寿者见受者见如此等人，能听能修读诵教他正说，无有是处。复次，须菩提！随所在处，显说此经，一切世间<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗等，皆应<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>，作礼右绕。当知此处，于世间中即成支提。</p><p>「须菩提！若有善男子善女人，受持读诵教他修行，正说如是等经。此人现身受轻贱等苦。过去世中所造恶业，应感生后恶道<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。以于现身受轻苦故，先世罪业及苦果报，则为消灭。当得阿耨多罗三藐三菩提。</p><p>「须菩提！我忆往昔，从然灯如来阿罗诃三藐三佛陀后，无数无量不可算计，过去大劫，得值八万四千百千俱胝诸佛如来已<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>竟，我皆承事供养恭敬，无空过者。若复有人，于后末世五百岁时，受持读诵，教他修行，正说此经。须菩提！此人所生福德之聚，以我往昔承事供养诸佛如来所得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，比此功德，百分不及一，千万亿分不及一，穷于算数不及其一，乃至威力品类相应譬喻所不能及。</p><p>「须菩提！若善男子善女人，于后末世，受持读诵如此等经，所得功德，我若具说，若有善男子善女人，谛听忆持尔所福聚，或心迷乱及以颠狂。复次，须菩提！如是经典不可思议，若人修行及得果报，亦不可思议。」</p><p>尔时须菩提白佛言：「世尊！善男子善女人，发阿耨多罗三藐三菩提心，行菩萨乘，云何应住？云何修行？云何发起菩萨心？」</p><p>佛告须菩提：「善男子善女人，发阿耨多罗三藐三菩提心者，当生如是心：我应安置一切众生，令入无余涅槃。如是般涅槃无量众生已，无一众生被涅槃者。何以故？须菩提！若菩萨有众生相想，则不应说名为菩萨。何以故？须菩提！实无有法，名为能行菩萨上乘。</p><p>「须菩提！汝意云何？于然灯佛所，颇有一法如来所得，名阿耨多罗三藐三菩提不？」</p><p>须菩提言：「不也，世尊！于然灯佛所，无有一法如来所得，名阿耨多罗三藐三菩提。」</p><p>佛言：「如是，须菩提！如是。于然灯佛所，无有一法如来所得，名阿耨多罗三藐三菩提。须菩提！于然灯佛所，若有一法如来所得，名阿耨多罗三藐三菩提，然灯佛则不授我记：『<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>！汝于来世，当得作佛，号释迦牟尼，多陀阿伽度，阿罗诃，三藐三佛陀。』须菩提！由实无有法如来所得，名阿耨多罗三藐三菩提，是故然灯佛与我授记，作如是言：『婆罗门！汝于来世，当得作佛，号释迦牟尼，多陀阿伽度，阿罗诃，三藐三佛陀。』何以故？须菩提！如来者，真如别名。</p><p>「须菩提！若有人说如来得阿耨多罗三藐三菩提，是人不实语。何以故？须菩提！实无有法如来所得，名阿耨多罗三藐三菩提。须菩提！此法如来所得，无实无虚。是故如来说一切法皆是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。须菩提！一切法者，非一切法故，如来说名一切法。须菩提！譬如有人椟身大身。」</p><p>须菩提言：「世尊！如来所说椟身大身，则为非身，是故说名椟身大身。」</p><p>佛言：「如是，须菩提！如是，须菩提！若有菩萨说如是言：我当般涅槃一切众生。则不应说名为菩萨。须菩提！汝意云何？颇有一法名菩萨不？」须菩提言：「不也，世尊！」</p><p>佛言：「须菩提！是故如来说，一切法无我无众生无寿者无受者。须菩提！若有菩萨说如是言：我当庄严清净佛土。如此菩萨说虚妄言。何以故？须菩提！庄严佛土者，如来说则非庄严，是故庄严清净佛土。须菩提！若菩萨信见诸法无我，诸法无我，如来应供正椟觉说：是名菩萨，是名菩萨。」</p><p>佛言：「须菩提！汝意云何？如来有肉眼不？」须菩提言：「如是，世尊！如来有肉眼。」</p><p>佛言：「须菩提！汝意云何？如来有天眼不？」须菩提言：「如是，世尊！如来有天眼。」</p><p>佛言：「须菩提！汝意云何？如来有慧眼不？」须菩提言：「如是，世尊！如来有慧眼。」</p><p>佛言：「须菩提！汝意云何？如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不？」须菩提言：「如是，世尊！如来有法眼。」</p><p>佛言：「须菩提！汝意云何？如来有佛眼不？」须菩提言：「如是，世尊！如来有佛眼。」</p><p>「须菩提！汝意云何？于恒伽江所有诸沙，如其沙数所有恒伽，如诸恒伽所有沙数，世界如是，宁为多不？」</p><p>须菩提言：「如是，世尊！此等世界，其数甚多。」</p><p>佛言：「须菩提！尔所世界中，所有众生，我悉见知心相续住，有种种类。何以故？须菩提！心相续住，如来说非续住，故说续住。何以故？须菩提！过去心不可得，未来心不可得，现在心不可得。</p><p>「须菩提！汝意云何？若有人以满三千大千世界七宝，而用布施，是善男子善女人，以是因缘，得福多不？」须菩提言：「甚多！世尊！甚多！修伽陀！」</p><p>佛言：「如是，须菩提！如是。彼善男子善女人，以是因缘，得福聚多。」</p><p>佛言：「须菩提！若福德聚，但名为聚，如来则不应说是福德聚，是福德聚。须菩提！汝意云何？可以具足色身观如来不？」</p><p>须菩提言：「不也，世尊！不可以具足色身观于如来。何以故？此具足色身，如来说非具足色身，是故如来说名具足色身。」</p><p>佛言：「须菩提！汝意云何？可以具足诸相观如来不？」须菩提言：「不也，世尊！不可以具足诸相观于如来。何以故？此具足相，如来说非具足相，是故如来说具足相。」</p><p>佛言：「须菩提！汝意云何？如来有如是意，我今实说法耶？须菩提！若有人言，如来实能说法，汝应当知，是人由非实有，及以邪执，起诽谤我。何以故？须菩提！说法说法，实无有法名为说法。」</p><p>尔时须菩提白佛言：「世尊！颇有众生，于未来世，听闻正说如是等相，此经章句，生实信不？」</p><p>佛告须菩提：「彼非众生，非非众生。何以故？须菩提！彼众生者，如来说非众生，非非众生，故说众生。须菩提！汝意云何？颇有一法如来所得，名阿耨多罗三藐三菩提不？」</p><p>须菩提言：「不也，世尊！无有一法如来所得，名阿耨多罗三藐三菩提。」</p><p>佛言：「如是，须菩提！如是。乃至无有如微尘法，如来所舍，如来所得，是故说名阿耨多罗三藐三菩提平等平等。复次，须菩提！诸佛觉知，无有差别，是故说名阿耨多罗三藐三菩提。复次，须菩提！此法平等，无有高下，是名阿耨多罗三藐三菩提。复次，须菩提！由无我无众生无寿者无受者等，此法平等，故名阿耨多罗三藐三菩提。复次，须菩提！由实善法具足<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>，得阿耨多罗三藐三菩提。须菩提！所言善法善法者，如来说非善法，故名善法。</p><p>「须菩提！三千大千世界中，所有诸须弥山王，如是等七宝聚，满此世界，有人持用布施。若人从此般若波罗蜜经，乃至四句偈等，受持读诵为他正说，所得功德，比此功德，百分不及一，千万亿分不及一，穷于算数不及其一，乃至威力品类相应譬喻所不能及。</p><p>「须菩提！汝意云何？如来作是念：我度众生耶？须菩提！汝今不应作如是念。何以故？实无众生如来所度。须菩提！若有众生如来所度，即是我执众生执寿者执受者执。须菩提！此我等执，如来说非执，婴儿凡夫众生之所执故。须菩提！婴儿凡夫众生者，如来说非众生，故说婴儿凡夫众生。须菩提！汝意云何？可以具足相观如来不？」</p><p>须菩提言：「如我解佛所说义，不以具足相应观如来。」</p><p>佛言：「如是，须菩提！如是。不以具足相应观如来。何以故？若以具足相观如来者，转轮圣王应是如来，是故不以具足相应观如来。」是时世尊而说偈言：</p><p>「若以色见我　以音声求我　是人行邪道　不应得见我</p><p>由法应见佛　调御法为身　此法非识境　法如深难见</p><p>「须菩提！汝意云何？如来可以具足相得阿耨多罗三藐三菩提不？须菩提！汝今不应作如是见：如来以具足相得阿耨多罗三藐三菩提。何以故？须菩提！如来不以具足相得阿耨多罗三藐三菩提。须菩提！若汝作是念：如来有是说：『行菩萨乘人，有法可灭。』须菩提！汝莫作此见。何以故？如来不说行菩萨乘人有法可灭，及以永断。</p><p>「须菩提！若有善男子善女人，以满恒伽沙等世界七宝，持用布施。若有菩萨，于一切法无我、无生，得无生忍，以是因缘，所得福德最多于彼。须菩提！行大乘人，不应执取福德之聚。」</p><p>须菩提言：「此福德聚，可摄持不？」</p><p>佛言：「须菩提！此福德聚，可得摄持，不可执取。是故说此福德之聚，应可摄持。</p><p>「须菩提！若有人言：如来行住坐卧，是人不解我所说义。何以故？须菩提！如来者，无所行去，亦无所从来，是故说名如来应供正椟觉知。</p><p>「须菩提！若善男子善女人，以三千大千世界地大微尘，烧成灰末，合为墨丸，如微尘聚。须菩提！汝意云何？是邻虚聚，宁为多不？」</p><p>须菩提言：「彼邻虚聚，甚多，世尊！何以故？世尊！若邻虚聚是实有者，世尊则不应说名邻虚聚。何以故？世尊！所说此邻虚聚，如来说非邻虚聚，是故说名为邻虚聚。如来所说三千大千世界，则非世界，故说三千大千世界，何以故？世尊！若执世界为实有者，是聚一执。此聚一执，如来说非执，故说聚一执。」佛世尊言：「须菩提！此聚一执，但世言说。须菩提！是法非可言法，婴儿凡夫偏言所取。</p><p>「须菩提！若有人言：如来说我见众生见寿者见受者见。须菩提！汝意云何？是人言说，为正语不？」</p><p>须菩提言：「不也，世尊！不也，修伽陀！何以故？如来所说我见众生见寿者见受者见，即是非见，是故说我见众生见寿者见受者见。」</p><p>「须菩提！若人行菩萨乘，如是应知应见应信，一切诸法；如是应修，为令法想不得生起。何以故？须菩提！是法想法想者，如来说即非想，故说法想。</p><p>「须菩提！若有菩萨摩诃萨，以满无数无量世界七宝持用布施，若有善男子善女人，从此般若波罗蜜经，乃至四句偈等，受持读诵，教他修行，为他广说，是善男子善女人，以是因缘，所生福德，最多于彼无量无数。云何显说此经，如无所显说，故言显说。如如不动，恒有正说。应观有为法，如暗翳灯幻，露泡梦电云。」</p><p>尔时世尊说是经已，大德须菩提，心进<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>，及诸比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>、优婆塞优婆夷众，人天阿修罗等，一切世间，踊跃欢喜，信受奉行。</p></div>"
    }
]