[{
    "title": "第1043部 金刚恐怖集会方广轨仪观自在菩萨三世最胜心明王大威力",
    "author": "阿质达霰 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>金刚恐怖集会方广轨仪观<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨三世最胜心明王大威力乌枢瑟摩明王经 卷上</p><p>敬礼一切佛复次诸菩萨。尔时会中无量俱胝明仙之所围绕。摩醯首罗天王大部多主。从座而起头面着地。前礼金刚手菩萨摩诃萨足。作是言菩萨唯愿演说大威力者。不空无碍教令诸。无比力勇健者。金刚菩萨所爱乐者。诸天阿修罗梵王帝释所归仰者。夜叉罗刹毗多拏布单那所怖畏者。降怨敌者。办诸事者。曼荼罗法所秘密者。时彼众会同赞摩醯首罗言。善哉善哉作意善哉善哉大部多主。为我等类决定劝请。</p><p>尔时金刚手菩萨。逶迤抽掷金刚杵已。便下金刚<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>莲华之座。顾彼众会。即入怖畏金刚大忿怒遍喜三摩地。然后无量百千俱胝所为报障有。皆大振慑悉见其身。为乌枢瑟摩所押伏。命将欲尽。如遇劫烧其意迷闷。俱发声言唯愿哀怜施之<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。</p><p>尔时金刚手菩萨摩诃萨。从三摩地安详而起。告徒众言。大威德者大光明者大忿怒者如汝所言。如是薄伽梵大威德者大忿怒者大光明者。</p><p>尔时薄伽梵金刚手菩萨摩诃萨。如师子顾作此瞻视唱如是言。大部多主我今说乌枢瑟摩秘密曼荼罗法。若暂闻者一切事业皆悉成就。不有非时夭横。但诸恶事皆不及身。毗那夜迦伺不得便。一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>之所爱敬。一切怨敌常皆远离。一切密言皆得成验。诸金刚法任运当成。一切不祥即得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。一切吉庆常当加护。若持此明满十千遍。即同登坛具足灌顶。如遇明师之所传授。次复当陈乌枢瑟摩曼荼罗相。先应具受三归八戒。发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>慈慧悲愍。其立坛地应当择处。若于山间或在庄居。或于旷野或在寒林。或在净室或河岸侧。或独树下或闲宅祠宇。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>治地建曼荼罗。三肘四肘或复八肘亦十六肘。若降伏法三肘三角。作若寂灾法四肘或八肘。若增益法及为国王十六肘作。用黑月八日。或黑月十四日。以心密言加持清水用洒其地。又以紫檀摩一圆坛。布以祥草上散赤迦啰尼啰花。以涂香众花散于坛上。加持佉驮啰橛一百八遍。钉入大坛四角及中成结地界。乃作根本遍掷印诵密言七遍。取紫檀遍涂地。以五色线拼为界道。四角四门运以黄赤绿黑。乃于坛心画佛。佛左傍画金刚手菩萨。持杵。有诸使者及金刚钩明蛇。捧杵瞻仰菩萨。次右乌枢瑟摩明王。持青难拏(唐言棒)以夜叉及阿修罗众。并诃利帝母及其爱子等为侍从。皆瞻仰明王。于东北角大自在天王执三股叉。并妃。东方天帝释执金刚杵。东南隅火天执了戾棒。南方阎罗王执那拏。西南方宁帝执剑。西方水天执赤索。西北方风天执绯幡。北方毗<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>执伽那。三面画毗舍蛇众。东门内画三股叉守护。以新瓶皆满盛净水及宝物五谷等。以彩色缠项。取一口瓶置佛前。安紫檀杵于口上。余瓶皆以赤花或果木枝塞口。四角四门各置一瓶。佛前置两段衣服充<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。金刚圣众乃至天等亦用衣服。每尊皆置饮食香花。坛外道梵行界道(坛外正方遗灰)其瓶先加持一千八遍乃置之。请诸尊依法。引<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>诵金刚<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>耶密言。才令弟子耳闻。散花所至彼尊有缘如法灌顶。若登此坛即同入一切曼荼罗讫。一切天魔毗那夜迦皆悉顺伏。命终生阿拏迦嚩典宫(毗沙门天王宫)</p><p>复次重说无上秘密曼茶罗。以黑月八日或十四日。可称赞地而建立之。四肘四门布以五色。或塼灰末于中画佛。次右观自在菩萨。次右马头明王大忿怒形。佛左金刚手菩萨。次左大威力乌枢瑟么明王大忿怒形。佛前摩么鸡金刚部母。四角置一瓶佛前一瓶。以不截彩覆之名胜瓶。外坛东北隅。大自在天王执三股叉并妃。于余隅画半杵或杵印。以香花饮食供养。如法引弟子灌顶。所用物充以心密言加持。</p><p>复次契相。根本遍掷印。先正立极力引左足顿地。向左亚身。右手握大指成拳。申臂令竖。左手为拳约着心。舒头指如针。眉间嚬蹙目当专注。此遍掷印乃能怖畏诸障难者。阿修罗门所有关键亦能摧破。</p><p>大忿怒印。并双手。中名小指等互以面相着。其大指捻其三指甲。便相握成拳。舒头指合如针。此契能作一切事业。缚扑请召辟除卒忤。又令远离能杀枯瘁护身。</p><p>普焰印。手背相着指头垂下。名下合掌。乃深交诸指。二小指如针大开掌。二大指互捻头指甲侧。此契能成一切事业。</p><p>杵印双手内相叉为拳。舒左中及头指。右中头指亦然。二中指相合。微屈头指各近中指傍。大指相并押无名侧。</p><p>打车捧印右手握大指成拳。</p><p>剪刀印结次前印。舒头中指如剪刀股。徐动之。</p><p>大墙院印结前棒印。极开二头指。</p><p>顶印结次前大墙院。屈右头入掌如余指。</p><p>头印如大墙院屈左头指入之。</p><p>甲印准墙院。屈二头指相拄如环。此印有大威力能作一切事业。</p><p>复次画像法。用氎径方两肘。依口酬价。乃以牛粪摩坛。竖绁于内。以赤花饮食供养。因食食良工图如来像。坐师子座手作<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>相(以左手大指头指头相捻。并舒中名小三指右手亦然。及以左手仰掌。横约着心。以右手腕着左手名小指等头。以掌向外散其三指也)</p><p>如来左画金刚手菩萨。右手执杵左作问<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>(并其五指微屈之如仰[金*敖]形。引手向前掌向如来也)</p><p>次左画大威力乌刍瑟么明王。大忿怒形。目赤色通身靘黑色。举体焰起而有四臂。右上手执剑。次下罥索。左上打车棒。下三股叉。器仗上并焰起。如来右金刚部母么么鸡。多发美貌通身靘色。胡跪合掌恭敬白佛。部母右<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。胡跪两手执香炉供养。其绁勿经打污。无毛发者。勿用臭色及有命之色。其画匠每日受三归八戒。长斋具大<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>新衣清洁(行者亦尔勿离其傍。速成为上。后有画像亦准此也)</p><p>复次于此像前。面东诵根本密言。乞食禁语兀如枯木。当印制底。如是相续满六十万。遂即登山建立前秘密曼茶罗。持剑作大坛。用阿伽嚧(沉香也)充柴。郁金华和白檀香烧之昼夜。成持明仙之首得一切悉地。有大威力寿齐日月。命终生阿拏迦啰典宫。</p><p>若置诃哩多攞(雌黄)或安善那(眼药)或么曩始攞(雄黄)或捧。准前作火坛。功力同剑。若乞食于一月内无间念诵。取白月十五日毕。其日。布像敷阿说他叶(广府有之)于像前加持三金(金银赤铜)娜拏七遍。置上加持持之。焰起劫寿有大威力。一切阿修罗一切夜叉罗刹鬼神诸天皆大顺伏。若三金娜拏一月内加持之日满。准前加持焰起持之。劫寿身等大威力明王。</p><p>若人以三金杵。代娜拏焰起。身同金刚手菩萨。若以三金轮代杵焰起。身如日辉成明仙中轮王。</p><p>若又绝食三日。黑月八日布羊踯躅叶。葛塔叶是。于像前补沙铁钩长八指。于叶上右手而加持。焰起执之洞视土地。位同帝释游戏三十三天。天龙鬼神钦伏。</p><p>若绝食一日。黑月八日或十四日。布阿说他树七叶。于像前置雄黄于上加持。焰起涂之持明仙。烟隐。暖热善行。</p><p>若于山顶诵十万遍。天大威力乌刍瑟么明王现。甚可怖畏执心勿惧。云须何作白言。薄伽梵成就一切事。但乞一愿持明仙。或降阿修罗或召诸天皆悉随意。</p><p>若于吉祥门首布像。诵三十万遍讫。阿修罗女自出迎之。可将五百人同入。彼辈作障身便干枯。</p><p>复次画像法。取两肘绁彩画大威力乌刍瑟么明王。身赤色怒形狗牙露出。密目(如狸眼即是)发黄色上冲。左持杵右娜拏。行者食不食净与否。像前诵三十万遍所作皆办。</p><p>若于吉祥门首。面北布像。行者面南。苦练薪作火坛。进毒药末芥子己血。满一千八修罗女子身如火烧。献长生及点化药。不受药者。诸女携手同入其宫。先有明者我当王彼。不畏娜罗延业。轮寿多劫。尊贵快乐身有光明。种种神变命终生天。</p><p>若于吉祥门首布像。作火坛烧绁华子。一千八满三日。乃结根本遍掷印。彼门即开无障而入。</p><p>若有龙水岸布像。作火坛烧盐满一千八。龙出受命随意驱使。</p><p>若先绝食三日。置像审铭柴(唐言苟杞)作火坛。芥子油和芥子烧满一千八。能召一切人天。</p><p>若以盐成悉底哩置像。作火坛片片割进火中。日三时令尽满七日。称名百由旬内至。</p><p>若以诸天空祠庙中布像。阿说他薪作火坛。苦练叶和芥子油。进其中一千八遍日三时。经七日即有天神来现。云作何事随意驱使。若先绝食三日。以黑月八日或十四日。于大自在天王前石陵伽南。以右手掩上加持。须臾有大声者。三天王现受驱使。不现彼身干枯。若准前先三日绝食。黑月八日或十四日。布像作火坛。进羊踯躅花一千八遍。又执其花加持一遍。掷打夜叉女膝。即相敬。</p><p>若要长生药眼药金银宝玉等。悉皆从命。若以佉驮罗木作三股叉。绝食三日以日月蚀时。寒林中布像。以香花饮食广以供养。右手持叉加持之。叉焰起止。后于夜分竖叉于地。七宝堂宇现是人前。天女缤纷充满其处。云欲何所作。歌舞音乐种种驱使。将晓去叉如故。若取一尸无[病-丙+盤]痕者。洗浴之置大河侧。首东仰卧。日正午四面各令一丈夫执刀而立。行者尸心上坐。取雄黄内尸口中加持之。药若变热。一切贵敬。烟隐。光升空。</p><p>若绝食三日。黑月八日或十四日。布像广陈供养。以阿枢迦木合。盛素噜(二合)但(引)战曩药(此是药名带赤黑色。重比金出<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>。末涂目中仰视日能夺其光。见日中有者为真耳)置像前加持之。热贵敬。烟生遁形。焰起持明仙。身光如日<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>可爱寿七千岁。</p><p>若绝食三日。黑月十四日。寒林中取无[病-丙+盤]痕尸。以香汤洗浴之。以头向东卧着。香花供养。行者裸形被发。尸心上坐。取白净髑髅。满盛白色芥子。置尸口上加持之。芥子尽隐。执髑髅腾隐自在。为一切腾空隐者之首。</p><p>复次不择净秽食与不食。先诵三十万遍。又以应肘量绁(一肘或二肘或三肘或四五等肘后言应肘量准此)画大威力乌刍瑟么明王。作大怒形。左持杵。右娜拏。左视。龙为璎珞(龙作蛇形)明王左画大寒林及行者。于明王右画山座。以赤花饮食供养。黑月八日于制帝布像。广设供养。作大坛。以乌昙波罗充薪。进赤色未开花。满一千八其日三时。即成验。能作一切事法人天贵敬。</p><p>若眼药法。取尾避多迦木(毗梨勒木)合子。盛素噜(二合)但(引)战曩。月蚀置像前加持之。得热烟焰生三种验功力同前。若取犬舌以三金鍱裹。月蚀时加持。烟生口含藏形。</p><p>若口含嚩极(菖蒲根也)持密言。取三种成验。热得一切总持不忘。烟生藏形。焰起作持明仙。若于山顶诵九十万遍。为持明王。</p><p>若乞食禁语诵四十万遍。绝食一日。黑月十四日于制帝前布像。广设此供养。并作火坛进安悉香丸一千八。其日三时作小持明王。若食乞食安悉香伴紫矿汁进火中满十万遍。见用。</p><p>若取么户保怛哩迦(唐云天门冬根)进火中一千八遍。迦那至。</p><p>若水中立至脐诵十万遍。一切伏藏尽现。能开枷锁止业轮。起死人胜冤敌。</p><p>若月蚀牛粪作坛布像。以赤铜碗盛赤[牛*因]牛苏置中加持。执食之总持不忘。烟生长生。焰起藏形。</p><p>若以乌昙跛啰薪作火坛。芥子黄芥子么沙(天竺云毒药)以血和之。进火中一千八伏藏自现。结根本遍掷印。又执佉罗木杵向前降之。宝物涌出。</p><p>若绝食于恒河侧诵三十万。阿修罗门开。若称吽字降山山碎。禁诸江海能令枯竭。</p><p>若绝食于寒林中诵四十万遍。梵罗刹及诸鬼神作美貌而现受命。若驱使迟违称吽字打地一下。彼当殒绝。称莎嚩贺再生。大自在天王庙中。绝食诵十万遍。大自在天王现以香华供养问讯。从天王乞其一切道术如意成验。若于大自在天王妃前。绝食诵十万遍妃现。随心乞愿。不现彼死或干枯。</p><p>若依前法诵密言。欲令梵天夜摩兜率及天帝释等一切天王现。并得如意。</p><p>若取一尸称吽字。以足加尸首。令声足齐下。尸当起大叫。持剑断其首成黄金。不者尸叫。告之有舍睹噜某甲持始罗来如意。</p><p>若以补沙铁作剑。月蚀时加持。焰起持之身同大自在天王。</p><p>若补沙铁作斧。月蚀时加持。焰起持之为毗舍者王。</p><p>若补沙铁作刀子。月蚀加持。焰起持之为明仙王。功用最胜<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>尤多。</p><p>若以蚁坟土塑成形。行者以足加心上。作坛。白芥子毒药及血置于左手中。以右手捻烧。经七日日一千八。王贵敬族亦尔。</p><p>若食乞食诵四十万遍。一制帝前布像供养。以密栗嚩薪作火坛。并取其果进一万颗。为持明王。天龙顺伏。</p><p>若加持华或果七遍赠人贵敬。</p><p>若一日不食。黑月八日布像。阿说他薪作火坛。进黑油麻一千八。王臣贵敬。</p><p>若三日绝食。进酥蜜酪白芥子于火中。一日三时二千八满七日。为持明王。</p><p>若烧酥满一千八。经三日王贵敬。</p><p>若取舍多华(唐云回香花)酪蜜酥相和。进火中一千八。满七日即得金钱一百若烧粳米乳粥一千八。日三满月。五谷盈溢用之不竭。</p><p>若紫檀末加酥。内华于中。进火一百八遍。日三满七日迦那至。</p><p>若从黑月一日起布像。遏迦薪作火坛。乌麻油和酥。迦瞻摩树华。一内一烧一千八。满七日得金钱八文。</p><p>若乳和蜜相和以青莲叶。一内一烧满三十万。伏藏尽现。</p><p>若召人。大寒林中布像。香华供养。紫檀末成彼形。佉驮啰木作火坛。男从右女从左足起。一割一烧令尽。百由旬外一月而至。若大寒林中布像。紫檀摩坛。水和王踪下土一把。塑成形。从右足割进火中令尽。敬重。</p><p>若寒林中布像。香华饮食供养。进虞么娑于火中。满一千八贵敬。</p><p>若进阿底目迦多华于火中十万遍贵敬。</p><p>若大寒林中。尾避多迦木作火坛。进么诃么娑昼夜。一切毗舍遮众梵罗刹等敬重。若舍睹噜。今梵罗刹为病。</p><p>若悉驮薪作火坛。初生犊子粪和紫檀末。作丸进之日三时。时一千八。满二十七日得牛千头。若截白檀香内杉木脂。进火中日三时。时一千八。满二十一日得大庄五所。</p><p>若截杉木进摩咄啰火中一千八。满七日得金钱一千文。</p><p>若食麨及水。布像供养坐吉祥草。十五日念诵勿间。绝食三日。黑月十四日布像供养以白芥子油然灯。乃截黑阿迦嚧(唐云沉香)进钵啰奢薪火中一千八。像形动或目动或作吽声。若形动为持明轮王。若名香和牛酥。进火中一千八。得群羊。牛不走失疫病若酥蜜相和。又内炒稻谷华于中。进遏迦火中满十万。五谷盈溢。</p><p>若取红莲叶进河中流入海者。满六个月。次绝食三日。白月八日布像供养。乌麻油和名香。截紫檀木杪进火中昼夜。大吉祥天现。以白檀阏伽供养。天云须何愿。白言持明轮王。天从行者口入无碍。即得如意无有天龙鬼神为怨敌者。</p><p>若酥蜜酪相和。一内名华。进遏迦火中一千八。妻妾贞洁。</p><p>若黑月八日酥蜜相和。内炒稻华于中。进火中一千八。日三时满七日得千户大庄。</p><p>若供养像。黄芥子和郁金。进嚩吒薪火中。一日三时时一千八。满七日国王贵敬。</p><p>若供养像。阿底目迦多薪作火坛。进其华于中满十万。大臣贵敬。</p><p>若供养像。进夜合华于火中一千八。妃贵敬。</p><p>若取众名香蜜和。作迦那形。充七日割进火中。日一千八贵敬。</p><p>若海盐和芥子油。烧日三时时一千八。经一月族姓人贵敬。</p><p>若寒林中坐髑髅上。寒林薪作火坛。进血于中昼夜。茶吉现。以血充阏伽供养之。云有何事。随意乞大愿天神贵仰。</p><p>若大寒林中。黑月十四日取裸形尸。肉进火中。从日入至夜半。梵罗刹作忿怒形而为奉教。后日得衣两事金钱一百文。若取寒林华鬘。进火中一千八首陀贵敬。</p><p>若以蜡作毗舍遮形。割进火中。毗舍遮众现为奉教。后日得衣服。</p><p>若截阿枢迦(无忧也)抄愔愚多油。进火中经一月为持明王。</p><p>若进薰陆香于阿枢迦火中。日三时时一千八。经一月得大庄。</p><p>若以饮食华供养像。以其华一诵一散像前。满一百万遍。为持明王。</p><p>若取摩勒迦华饮食供养。散其华十万见用。</p><p>若常持念此密言者无众诸衰难。</p><p>若酥乌麻油。一日三时时一千八。进火中满七日得大庄。</p><p>若加持佉驮罗木橛一百八钉。入怨人家内彼善心相向。</p><p>若龙华须进佉驮火中。日一千八经一月迦那至。</p><p>若酥蜜相和。一内回香华。进阿波末哩迦(唐言牛膝)火中。满十万家内七宝自涌。</p><p>若酥蜜酪和阿波末迦子。进屈嚩迦薪火中。满十万王贵敬。</p><p>若黑月一日。阿枢迦树下。庾体迦木敷华。一内酥蜜酪中进火中。满十万得金钱一千文。</p><p>若制底前布像供养。进俱罗吒迦华于佉驮罗火中。满七日大威力乌刍瑟么现满愿。</p><p>若进阿杜华于佉驮啰炭火中一千八。七日伏藏现。</p><p>若进阿伽悉地华于苦练火中一千八。经七日得金钱一文。</p><p>若以内摩勒地华酥蜜酪中。进瞻卜迦火中。经一年共诵一十万。得金钱十万文。</p><p>若以泥塑嚩啰呬。紫檀供养持密言尽夜。彼当长喘与行者黄金千斤。</p><p>若流入海河立。其水至骻用阿迦罗充<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>。以名华一熏进水中满十万。为大持明王人天归命。若截阿说他树枝。一内酥蜜酪中。烧之十万遍为小持明王。</p><p>若油麻酥蜜酪相和。进火中满十万见用。若截松木进火中十万遍见用。若酥蜜相和。截蜜栗嚩树根。一内一进火中满十万大富。</p><p>若黑月八日供养像华。和郁金华。进火中一日三时。时一千八满七日大富。</p><p>若有龙水边。白月五日布像。供养龙脑香龙华须。和进火中满十万。其龙贵敬得宝珠十万颗。</p><p>若黑月八日大自在天王庙中。一内阿底目迦多华于酥蜜酪中。进火中日三时时一千八。满七日得大庄五所。若进讷嚩草(骨路也)若进火中。满十万长寿。</p><p>若进屈野迦欲敷华于审铭火中满十万王女敬重。</p><p>若粳米和乌油麻柤。进脂俱吒火中一千八饶奴婢。</p><p>金刚恐怖集会方广轨仪观自在菩萨三世最胜心明王大威力乌枢瑟摩明王经 卷中</p><p>若粳米和牛苏。进火中十万遍生有相之子。若杉木脂和酥。进火中十万遍增七宝财。若以饮食香华供养像。像前地上画人或王。行者形心上坐诵十万遍彼并族贵敬。</p><p>若白芥子郁金华和。进迦赦若火中。日三时时一千八满七日王族贵敬。</p><p>若么沙末芥子油和。塑为啰形。从初夜割进钵啰奢薪火中令尽。彼贵敬。</p><p>若乌油麻粳米和煮。又以乌麻油和。进火中日三时时一千八满七日首陀贵敬。</p><p>若乌麻柤进火中一千八迦那贵敬。</p><p>若粳米粉成舍睹噜。取脂俱吒枝为橛。加持一千八遍钉口不能语。</p><p>若寒林炭尽梵罗刹。诵一万令舍睹噜么罗宁。若解彼咒法者。以香华饮食供养像。像面向北人对之。芥子毒药血和。进味达迦多薪火中一千八。彼当失验。</p><p>复次羯磨坛。先对像面东念诵毕。便作此坛。于大河海侧或大寒林中或高山上。如法摩地讫。准前画院。开一门正方八肘。当中画大威力乌刍瑟么明王。于右画若棱多者哩咛明王。怒形斜目。右于左画阿吒吒僧伽明王。入门门右角。内画大自在天王并妃。又于门左角内。画那罗延天王。四臂皆执器杖。又于北方画伽那。一角内金刚杵。西方赤索。一角阿跛逻攞龙王印(画一小阶。阶上画一蛇头。蒙出项以来)南方一口黑色剑。坛内诸尊并坐。以心密言加持灰。于坛外正方作梵界道。以饮食香华供养。凡入坛物皆以心密言加持之。取雄黄以石研成粉。牛乳和为丸。五布阿说他叶于坛中。以药丸置上。行者以忿怒形加持之。焰起取一丸施与诸天。以一丸施与先成持明者。以一丸施给侍者。余丸研涂额上喉及心。成天明仙身生璎珞。其发右旋婉转绀色。异常貌同诸天寿一千岁。若烟生王诸隐形仙。若热能令一切众生喜见柔伏。供给财宝寿年百岁。若三相不现涂额众人贵敬。</p><p>若以雌黄或牛黄。代雄黄亦得验。</p><p>若黄丹和己身血。置净髑髅中安前坛上加持。焰起取少涂额。王一切天仙余相准前。</p><p>若沐浴衣。逻结差啰细曩绁熏香。坛中坐持明。身上焰或起烟生热等功力准前。</p><p>若取红莲须龙华须末之。酥蜜和之。金碗盛置坛中加持焰起药成<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。服之成自在天。身寿远劫不复饥渴。烟生藏形。热总持不忘。寿千岁无病一切众生贵敬。</p><p>若月蚀时立坛。赤铜碗盛羖羊乳加持之。焰起服之王一切天仙寿如日月。焰不起寿一百岁得大胜。</p><p>若补沙铁作三股叉。或佉驮啰木长十二指作。行者澡浴遍体涂灰禁语。加持叉三十万。候月蚀以置坛中加持。焰起持叉身成大自在天王。面有三目威力亦等。烟生之王诸隐形仙热有大威力。</p><p>若补沙铁作杵长十六指。以紫檀遍涂之。黑月八日或十四日。月蚀时。立前坛。于道路取少净草布中。置杵于草上。取黄牛酥一加持一浇杵上。满一千八诸鬼神及毗那夜迦。并阿吒吒诃僧见。勿畏。结那拏印持明彼皆退散。然执之加持。焰起持之得帝释位。具足千目王三十三天。阿修罗众皆来<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>。纳其女子力伏魔王。烟生王隐形仙。热寿百年天龙顺伏。若作三金轮。大寒林中立前坛。准前置轮。浇酥一千八。坛中右手执轮加持。焰起成诸仙轮王。威力倍胜首罗及帝释。神仙归仰命终生阿拏迦嚩典宫。若佉驮啰木作剑。以三金鍱裹三处。山顶布前坛。以右手持之加持之。加持令剑作青色。便住立其地。先布少净灰。以剑头当灰中拄之。一切隐身诸仙并现作礼旋绕而去。取其灰少少分布与人。彼得灰者皆成天仙。</p><p>若佉驮罗木作伽那。以赤色华鬘挂于伽那上。准前置执加持。焰起成毗沙门天王大力夜叉之主。无量鬼神而为给侍。便往阿拏嚩典宫寿一大劫。若素噜(二合)但(引)战曩末。以么啰(二合)颔铭(二合花及叶掌中和末候乾和捣津又泮满一千遍)和之(又捣为末)以金碗盛之。又以金碗盖之。准前浇酥满千。乃置碗于掌中加持。焰起末涂目中。飞腾自在诸天围绕给侍寿远劫。</p><p>复次阿毗遮噜迦法。大寒林中立坛。以心密言加持己血。一遍洒其地。候干又洒清水。又以寒林灰涂之。寒林灰界坛院。三角三肘开北门。门外画罗刹发上竖怒形。以人骨庄严之。右手掌一髑髅盛血。作向口饮势。坛心昼娜拏印。焰起。三角各画佉吒望伽及毗舍遮众。以犬肉祀罗刹毗舍遮。前置酒。行者裸形被发以头中无名三指。涂己血于额两肩心喉。大怒心左绕坛行一匝立。称乌刍瑟么名。更洒己血于坛。以华鬘绕坛院一匝。粳米饭和血。置髑髅中安坛中。人骨和发为焚香。又一髑髅满盛血。赤华鬘缠之。又以三髑髅坛前支缠华者煎之。行者蹲踞坐。持人胫骨搅血。仍咬牙啮齿大怒形持密言。血中焰起有无量声喧空。必不损人慎勿怖。其阿吒吒诃僧及诸鬼神。身皆焰起以种种恶形来现。云须何愿随意乞之。若国家有大阵敌。或恶人毁除<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。令系之皆大丧败。</p><p>若不择时日。依前作三角坛。唯除华鬘缠髑髅并支者。以建吒迦(唐言棘也)薪作火坛。髑髅末毒药末和血。进火中一千八舍睹噜摩啰宁。</p><p>复次寒林衣应肘量者。寒林中或路上作坛。以血洒之坛北布之。以己血画之。发上竖怒形四臂。一手掌髑髅。第二手娜拏。第三手人头。第四手杵衣虎皮裈。黑月八日大寒林中布像。以黑饮食赤花供养。行者蹲踞坐。以灰画舍睹噜。血和芥子置一髑髅中。行者于舍睹噜上蹲踞坐。以建吒迦薪棘也作火坛。进血芥子于中昼夜。非支么啰宁。三夜作一家。七夜作七族。一月夜尾晒也。</p><p>若墓田或殡宫布之。蹲踞坐。进盐和血于建吒迦火中。一千八摩啰宁。</p><p>若布像。像前以灰或炭或稻糠灰。画彼形。心上坐。进血和灰于寒林残薪火中。昼夜。家摩啰宁惹七夜。</p><p>若寒林中布像。取其炭末和水。作舍睹噜。佉驮罗木橛长两握涂血。于钉花仡哩娜。乃坐橛上持明一千八。日三时满三日摩罗宁。</p><p>若行者内衣于血中披之。水立至脐。持明血干。披亦然。</p><p>若寒林中布像。犬肉芥子油和。进火中一千八经十五日摩啰宁。</p><p>复次扇底迦坛。于净室或河岸作方四肘。准前坛样图之。当中画金刚部母。右画金刚拳明妃。左画金刚锁明妃。部母前一角内。大威力乌刍瑟么明王。一角内金刚手菩萨。四角内及坛心。皆布阿枢迦葉。叶上各安一水瓶。以香花饮食供养。用钵罗奢薪作火坛进酥。称么鸡明满一千八。又进牛乳。每遍称乌刍瑟么莎嚩诃一千八。官事散病愈矣。</p><p>若准前七日作。国内疫差。若坛前油麻油酪蜜酥和进前火中。日一千八七日病差事散。</p><p>若依前立坛布像。取像内牛乳中。出之又布。进牛酥于前薪火中一千八。瓶盛少香水加持七遍。将瓶就彼病人处以洒彼面。云愿汝即差。其瓶满盛清水置坛中。持一千八令浴之差矣。若乌昙跛罗木作匙。先三诵三策酥。乃进阿说他薪火中。次一诵一进称彼病者名一千八差矣。</p><p>若加持粳米饭和乳。与食经七日差矣。</p><p>若依前布坛像。截乌昙跛罗枝一内乳。进审铭薪火中一千八经七日彼差。</p><p>若布像。取油麻油酥蜜酪和。进审铭薪火中。一日一千八经七日摩啰宁。</p><p>若进乳于审铭薪火中满万摩啰宁。</p><p>若内像于乳或酥布之。进乳审铭火中。又加持香水洒彼面差。</p><p>若酥煎美饼及酪蜜酥乳等供养像。以粳米饭和酪。或酥乳蜜和。进阿说他火中。日三时时一千八满七日致富。</p><p>若佛殿或神庙中。依前供养像。进龙脑香于谷木火中。日三时时一百八。满七日七宝六畜增长。</p><p>复次以白檀香木。刻本尊长六指。行者顶戴水中立至项。尽日持密言。家内行疫鬼死。三日作。城内疫差鬼去。七日作。境内差鬼去。若以阿说他木。与前坛像作座。以牛粪于路上作坛安像供养。然牛酥灯。像面向西行者面东。坐草团上捧白檀香水以奉请。密言加持七遍。迎本尊降入像中。惹底华(一名苏末那)一内乳中。进火中昼夜。当庄内疫差。七夜作。国内差。</p><p>复次以郁金画本尊。行者受八戒持斋。顶戴像设幡花烧香供养。引之右绕庄一匝疫差。</p><p>复次按俱咤木或阿说他木刻本尊。于四衢路以香花饮食供养。人发并骨末之。进按俱咤火中。日三时时一百八遍当庄疫差。</p><p>复次补沙宿直日(唐云鬼宿)饮食香花供养。阿说他树用取其北引根。牛五净和少清水。持茎草揩洗之。或鬼宿直日市紫檀木依前洗之。日日初摩一方坛。置木及所刻像刀斧等。于中以根本密言加持紫坛木。香水七遍洗之。行者八戒十善。坛西进酥于火中七遍。结根本及娜拏印。令匠于坛中速刻本尊。左手持杵右执娜拏。怒形右视如立势。如立根本印行者在侧持明勿绝。令白月毕。以檀香水浴之。以饮食香花供养。以彩色严之。像额间点赤或黄至来月一日开目立坛。以饮食安悉香花供养三宝。其日于坛像前起首持明十万。乃候月蚀立坛布像。像面西。饮食紫檀香花供养之。烧安悉香结娜拏印加持之。印焰起入行者顶。持明王有声见用。若或河侧供养本像。作佛手一磔量(佛手一磔今人之三磔以二尺四寸准也)制帝十万。诵密言三十万遍。乃以黑月八日或十四日供养加持。焰起为明王。</p><p>复次黑月八日。依仪供养按俱咤树。取其根本尊。右手舒五指以掌拓心。左手持杵。左足踏毗那夜迦。右足踏娜拏。令娜拏一头押毗那夜迦。取按俱咤花和芥子油。进按俱咤火中。昼夜令满一万遍。夜半作大声现。候至午。佉驮罗木和芥子油中。进按俱咤火中一千八。满七日毗那夜迦死。若进乳于火中一千八寂灾。</p><p>若以蚁坟土作毗那夜迦形。应肘量。大寒林中立坛。置形于佉驮罗木长十指。和毒药及血。进佉驮罗木火中。满万遍。夜半形作大声得其悉地。后作毗那夜迦法皆成就不被恼乱。</p><p>复次于应肘量绁上。画大威力明王。左上手掌髑髅。下手竖头指拟势。右上手持那拏。下手执杵。像前画一毗那夜迦胡跪合掌。左足下踏一毗那夜迦。立坛布像。以赤花饮食紫檀香供养。取一内进苦练火。当乃诸恶鬼神以种种形。见作吒诃吒诃声。慎勿惧。毗那夜迦启言。有何事唤我。勿与语。得毗那夜迦悉地。后无畏难。若被毗那夜迦作障难者。像前诵一千八。难止。若水立至项。结娜拏印诵一千八彼众退散。</p><p>若取五谷及新果并名香。置一瓶中。满盛清水以庵罗叶塞口。牛粪摩坛。置瓶于中加持一百八遍。若毗那夜迦为病。或遭鬼魅。或年十六已下人。诸鬼神所中者。浴差。妇人过月不生。浴之即产。薄福之人浴之罪灭致富。</p><p>若加持菖蒲根一千八。口含诉讼得理。</p><p>若进阿钵罗指多花火中。满一万辟兵。若诵密言七遍。以顶上少发作一结辟兵若童女合绁花作七结。系臂不为诸毒所中。</p><p>若鬼魅所中加持水洒其面。结娜拏印持明差矣。</p><p>若治毒加持清水洒彼面差。或加持苦练叶七遍扫彼身差。</p><p>若为诸龙所伤者。加持清水一百八令服之差。</p><p>若恶疮丁疮加持土七遍。和水涂之差。</p><p>若遇怨敌结娜拏印明一百八。彼发善心相向。若止恶官亦尔。</p><p>若为人抵犯者。结娜拏印彼不能语。</p><p>若恒忆念此密言者。本尊随逐众魔不近。止盗贼水火辟五兵延年。</p><p>若欲食先加持之七遍服之辟众毒。</p><p>若人患心狂或为人厌令尔者。结娜拏印彼耳边诵七遍。</p><p>若疗前狂病。以二瓦碗相合结娜拏印。彼耳边诵七遍扑破其碗差。</p><p>若疗痃癖。加持乌麻油七遍涂腹差。</p><p>若加持净水散于十方。一诵一结练线满七系臂自护护他。</p><p>若自经秽但诵之解矣。</p><p>若加持右大母指七遍。以其印额诵一遍次右肩次左肩次心次喉成护身。辟师子虎狼及诸怖畏。</p><p>若晨朝沐浴以华供养本尊。诵一百八辟兵灾横见<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。</p><p>若有官事或怖畏。依前供养持明止矣。</p><p>若国家大兵敌者。布像内阿波末哩迦(牛膝)子。酥蜜酪中进阿波末哩迦薪火中。满万敌退。</p><p>若疗药毒牛粪作坛布像。截佉驮罗木二十一枚加持七遍点芥子油进火中。</p><p>若中鬼魅。加持一瓶清水一百八。令浴差。</p><p>若被禁系。持密言枷锁解脱。</p><p>若疗癞。加持紫檀香一千八涂之差。</p><p>若菖蒲根末和蜜。加持一千八服之疗冷症。</p><p>若患疟。加持恒山花一千八令顶戴差。</p><p>若患癞痫或及恶风者。进萎花于佉驮罗木火中一千八差。</p><p>若令童子沐浴涂紫檀香。衣以新衣璎珞。牛粪涂坛。遍散赤花令头戴赤花鬘。加持赤花七遍令捧而掩目。焚安悉香结娜拏印加持。本尊降问事。</p><p>若步多鬼中者。素啰娑药和香烧。结娜拏印加持彼。被缚赦之差。</p><p>若芥子末塑彼形。割进火中。令形支七日摩啰宁。</p><p>若寒林灰于髑髅上画彼人。寒林柴火炙之。持明如火七日内摩罗宁诸术不解。</p><p>若寒林炭和水塑彼形。或以其炭画之。以钉钉口加持二十一遍或一百八不能语。</p><p>若依前塑画。口上烧苦练火。心上坐。毒药血盐芥子和进火中一百八同前。</p><p>若准前塑画。头上坐心上烧火摩罗宁。</p><p>若依前塑画。钉心脚上坐。浇水于钉上满一百八。水病摩罗宁。若去钉加持乳一百八与之浴复。</p><p>若加持素尾烂战(此药青色似铁生)末一百八涂目见者贵敬。</p><p>若加持清水一百八洗面。谒王贵敬。</p><p>若加持清水一百八洗面。诉讼得理。</p><p>若蛇皮进苦练根火中。或佉驮啰木火中。日三时亦一千八满七日摩啰宁。</p><p>若于净室或四衢路中或寒林中。日午截鸦翅进摩诃迦罗火中一千八如鸦飞。</p><p>若进乳于火中一千八复。</p><p>若离合三日绝食。午时进蛇肋骨于迦赦惹火中。一千八满七日。</p><p>若已血毒药。夜半进寒林薪火中一千八。经七夜摩啰宁。</p><p>若诵部母密言。进酥火中一千八。又诵根本密言。进牛乳于火中一千八。</p><p>若先三日不食。大自在天王庙中(有名相处)布像。先广设供养。便眠梦本尊告诸。某处有伏藏可取之。</p><p>若黑月八日夜半。净室或寒林中。血和毒药。一内摩咄啰子。进摩咄啰火中一千八满七夜。乌嗟娜曩若进酥于火中一千八复。</p><p>复次像前先诵十万遍三日勿食。第四日二时入水中立至喉。结娜拏印或打车棒印。或杵印或罥索印或剑印。持明王至夜半出于岸侧。以莽度迦薪(唐云甘草)充火坛先以莽度迦木刻其印。一内木印于酥蜜中烧之。至止后以印。印山山碎印海海竭。</p><p>若蛇咬印之彼求哀赦之瘥。</p><p>若印人彼被缚。</p><p>若印枷锁即得解脱。</p><p>若印毒药服之无苦。</p><p>若欲作一切法以印助之速验。</p><p>若恶人相向。作嗔心印之。彼吐血或失心。</p><p>若患鬼魅及风痫。加持黄芥子七遍打面差。</p><p>若进虎爪火中七遍不被虎伤。</p><p>若加持苦练根一千八系臂无一切畏。</p><p>若加持摩诃迦罗根一千八。置门颊上一切鬼病不入。</p><p>若加持顶上少发作一结。一切处无怖畏。</p><p>若绝食一日。黑月八日或十四日。制底立坛安像供养。于金刚部母前烧安悉香诵一千八。便敷草根吉凶具告。</p><p>复次止雨。以紫檀作坛。布像香花饮食供养。持明止矣。</p><p>若恶雨雪雷雹。结杵或娜拏印。持明止矣。</p><p>若祈雨黑月十四日。大河侧以蚁坟土塑龙。笼叶芥子油和遍傅之。以足加龙首。结娜拏印加持之。尽日止雨足。</p><p>若以牛皮白月五日。寒林炭末和水傅皮。白土作龙笼前一日三时时一千八。进苦练叶于火中。经七日雨足。</p><p>若前法不验者。寒林中以其炭画作四肘方坛。开南门。于中画大威力明王。前画三五头龙。龙皆首北。次南画一池。池中青莲华。次池南又三五个龙。龙亦首北。四角内各画一池。池内青莲华并三两个。龙门内画一龙。七首首北。以毒药末和血。内绁花子于中。进火中满一千八。诸龙以蛇形而现宛转于地。语令急下雨。加持水七遍洒龙赦去雨足。</p><p>若诵金刚部母密言一千八。白月七日于制帝布根本像。以饮食香花供养。芥子和酥进火中一千八。罪障清净。</p><p>若以秽处土和水成彼形。行者每小遗。其上一遗。加持一百八满七日。彼贫贱。若勃哩孕迦花摩勒迦末及清水置瓶中。勃哩孕迦葉塞口。加持一千八今浴复。</p><p>若加持花或果一千八赠人贵敬。</p><p>复次应肘量绁。画夜叉女勿用胶美白净色璎珞铛钏天衣严饰。右手施愿左手执阿枢迦葉。布此像于阿枢迦树下。面北立坛。以惹底花或勃哩孕迦花并饮食供养。心密言加持香烧之。行者面南。草团或花叶上坐加持。阿枢迦花一遍。掷像上。满七日。以第七日夜半。于像前一内阿枢迦花酥蜜酪中。进阿枢火中一千八。现献紫檀阏伽如愿(母打额姊妹打喉娄打心)</p><p>若一日不食。黑月八日或十四日午时。寒林中芥子末成彼咒师所尊形。遍涂毒药于刀子刃。加持一千八遍。称彼尊名。因截形为两段彼失验。</p><p>若准前成形。加持乳一千八俗之如故。</p><p>若寒林中以生酥成彼尊形。加持五钉各一百八。称彼尊名。于额及两肩喉心各钉一钉。彼失验。去钉如故。</p><p>若瓦碗中以寒林炭画彼形尊形。又以一瓦碗盖之。取黑羊毛线缠碗。加持一千八遍。彼咒师身如被缚失验。</p><p>若有诸咒师能为大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>者。寒林中寒林炭和毒药末之。进其薪火中一千八遍。称彼名失验。</p><p>若诵金刚部母密言。进酥于火中一百八。称彼名如故。</p><p>若先三日不食。寒林中或净室或四衢中。紫檀香青木香末和水。塑迦那。以寒林炭和毒药。充火炙形加持一百八。相亲彼。障患癞。依前加持水瓶令浴差。</p><p>若旗旛上写密言持之入阵辟兵。</p><p>若以桦皮写密言置髻中入阵。刀箭及身犹如散花有何患也。</p><p>若紫矿末和水。一内勃罗得迦子于中。进竹火中一千八诸咒师钦伏。</p><p>若以人骨代勃罗得迦绁准前行者身安宁。</p><p>若纸或树皮写密言头戴辟兵。</p><p>若加持土块一百八。掷于水中然涉之。水性之属不能伤人。</p><p>若加持绁花线一百八。次诵一结满七系臂。路行辟劫盗。</p><p>若以木刻金刚杵一千八。先一日不食进火中令尽。一切金刚部法成验。</p><p>若霹雳木刻作三股杵。有大雪雷雹降。右手持杵降山或他境雪等移往其处。</p><p>若以摩咄罗茎刻杵。立坛置中。人发供养之。取一树果一千八颗。以其树充薪进果令尽。炬瑟吒。</p><p>若以猫粪。代进摩咄罗花于草麻火中。一千八去白佃风。</p><p>若卤土酪和置枪。用摩娜那薪火煮之。去枪进粥于枪下火中一千八。留残粥后取少分和食。与之同前。</p><p>金刚恐怖集会方广轨仪观自在菩萨三世最胜心明王大威力乌枢瑟摩明王经 卷下</p><p>大威力乌枢瑟摩明王经心密言事法</p><p>复次求心密言成验法。行者不拘净秽。食与不食持满十万当得悉地。</p><p>若取线一加持一结一千八遍。戴之自护护他。若加持黄芥子或灰或水。散十方辟魔。若加持顶上发作髻。所至之处皆获胜利。若加持衣角。七遍作一结诉讼得理。</p><p>若遭囚闭枷锁。心诵<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>即得解脱。若良田土及灰。以蜜和之加持。涂一切疮生肌。</p><p>若梵罗刹中人至困者。结心印持明差。</p><p>若旃陀罗家灰满盛钵中。毒药末和水加持。洒灰上置地加持之旋转捕盗。</p><p>若黑月八日鱼肉及血。祀摩醯首罗右边夜叉面。执人骨橛加持一千八遍称彼名。捣红蓝花汁涂橛。用钉入地乌蹉娜曩。</p><p>若加持鸦胫骨一百八遍。钉彼门下如鸦飞。</p><p>若绝食三日。黑月八日或十四日。寒林中以其灰布彼形。佉驮罗木橛五枚。各加持一百八遍。钉额喉心及两肩摩啰宁。不者以一橛钉支节。少沙。</p><p>若离合黑月八日日方午或夜半。进寒林灰于苦练树皮火中一千八遍。若夜半蛇脱皮鼠狼肉。一内芥子油中。进摩阿迦罗火中。经七夜尾娜末沙曩。</p><p>若离合进俱奢得鸡果于勃罗得迦火中。一日三时时一千八遍至满七日。</p><p>若寒林中或净室中。进勃罗得迦果于冰拏迦火中。一千八遍辟大力鬼神。</p><p>若勃罗得迦子青木香和油麻油。进勃罗得迦火中一千八遍。至满七日矩瑟吒加持紫檀香一千八遍涂之复。若灰盐毒药末和。进火中一千八遍痃辟。</p><p>若一日不食。黑月八日寒林灰和鱼胆作人形。割进佉驮罗火中。夜半起贵敬。</p><p>若三日不食。黑月十四日寒林立坛以香赤华赤饮食供养。以己血于髑髅上画迦那。寒林炭火炙之仍加持一千八遍自至。</p><p>若夜半进稻谷末于火中。一千八遍乌柘吒曩。</p><p>若寒林中花鬘蛇皮和。进火中一千八遍入嚩啰。</p><p>若进胡椒于火中一千八遍悉多哩贵敬。</p><p>若微赦迦及摩那果。内芥子油中。黑月八日寒林中进其火中。日以三时时一千八遍。至满七日彼即贵敬。</p><p>若夜半被发。苦练叶并子和牛尿。进火中一千八遍三遍乌柘吒曩。</p><p>若黑月八日。寒林灰塑人形。本尊前割。进佉驮啰火中即至。加持果七遍赠之转贵敬矣。</p><p>若么沙己血和盐。进经用齿木火中一千八遍啰拏贵敬。</p><p>若每晨诵一千八遍常得安宁。</p><p>若芥子盐血和。进经用齿木火中一千八遍啰拏贵敬。</p><p>若午时薰胡翅和芥子油。进苦练木火中一千八遍乌柘吒曩。</p><p>若寒林中禁语。诵十万遍讫。三日不食白月八日或九日。以人左肋骨。用红蓝花汁画彼形。寒林火炙之加持彼自空而来。</p><p>若净室或寒林。已指甲蛇皮薰胡毛和作香。烧供养跛吒写。诵经七日乌柘吒曩。</p><p>若水中立至膝或腰。一内薰胡毛于人脂中。日时三千八遍。经一七日乌柘吒曩。</p><p fx data-zshare></p><div class=\"bdsharebuttonbox bdshare-button-style0-16\"><a href=\"#\" class=\"bds_more\" data-cmd=\"more\">分享到:</a><a href=\"#\" class=\"bds_weixin\" data-cmd=\"weixin\" title=\"分享到微信\"></a><a href=\"#\" class=\"bds_tqf\" data-cmd=\"tqf\" title=\"分享到腾讯朋友\"></a><a href=\"#\" class=\"bds_tsina\" data-cmd=\"tsina\" title=\"分享到新浪微博\"></a><a href=\"#\" class=\"bds_sqq\" data-cmd=\"sqq\" title=\"分享到QQ好友\"></a><a href=\"#\" class=\"bds_qzone\" data-cmd=\"qzone\" title=\"分享到QQ空间\"></a></div><script src=\"https://www.hrfjw.com/statics/m_liaotuo/js/zshare.min.js\"></script></div>"
}]