[{
    "title": "第305部 佛说大孔雀王神咒经",
    "author": "帛尸梨蜜多罗 译",
    "html": "<div class=\"B1_text\"><p>佛说大孔雀王神咒经</p><p>佛告阿难。往昔于雪山王南。有一金色孔雀王。佛住其中。彼以此大孔雀王咒经。朝说自护昼则平安。暮说自护夜则安隐。即说咒曰。</p><p>吼吼吼吼吼吼吼吼吼吼梨梨梨梨昙婆梨梨梨毗摩梨梨晖夜晖夜毗阇毗阇瑜薮求漏伊罗弥罗伊利弥罗知梨弥罗伊梨弥帝梨醯利知利弥帝黎昙德修昙德妒修妒衢罗支罗遮娑罗毗罗遮伊知梨毗知梨知梨。</p><p>阿难我今为汝。说大孔雀王咒王心。即说咒曰。</p><p>伊致知利毕利弥利弥利知弭薮昙柄耽柄脂利吉脂利吉赐夜毗罗那弥稚南无一切诸佛指吉赐波多牟黎伊致诃罗卢醯带牟罗带牟罗兜娑庵婆鸠致鸠那致鸠鸠那知罗鸠阇那致阿茶婆多夜那婆魔娑陀赊魔赐帝伊利弥利吉利弥利翅罗罗弥离翅斗牟隶头头摩萨头弥致他离弥萨斗婆帝牟萨帝浮萨罗浮萨罗浮萨罗浮萨罗伊那婆悉哆婆翅那迦罗那罗摩林弥蝎罗佉罗摩诘隶伊帝萨阇隶耽亿阿那帝波那帝阿那那那帝。</p><p>天速降雨周匝结界七遍读诵。即说咒曰。</p><p>那罗延波那延阿梨多利鸠多利伊利弥悉帝吉帝利弥悉帝弥悉伊利弥咒曰成就吉。</p><p>阿难此大孔雀咒王。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨随顺所说。即说咒曰。</p><p>尸利尸利尸利尸利婆陀树树知婆帝隶诃隶诃隶诃利腻檀帝赊婆隶尸德收罗婆腻收罗婆腻<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>菩提菩提菩提菩提萨斗婆菩提婆利遮罗尼裔悉波诃。</p><p>阿难此大孔雀咒王。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>主梵天王随顺所说。即说咒曰。</p><p>醯隶醯隶诃隶弥利摩利腻波居利吉利吉利吉利吉利底梵魔裔鸠兰茶翅毗图诃浮赐浮数浮数浮数浮数浮数悉波诃。</p><p>阿难是大孔雀咒王。天帝释随顺所说。即说咒曰。</p><p>陀罗禅头隶摩罗禅兜隶遮[惃-日+(向-口+人)]致禅头兜隶摩他腻迦多腻伽婆腻醯利尸利稠底尸利多柳那肆诃诃诃诃诃诃私醯脂底毗絺帝鸠柳婆罗誓兜吒兜吒肆波吒波吒肆私利私利劫卑隶劫卑罗至隶诃醯吼。</p><p>令一切凶恶皆悉降伏摄其手足支节莫令得动乃至三十三天。</p><p>忧致者利修罗波帝波帝波视罗波视罗波视罗波视罗波视罗波视罗波帝悉婆诃。</p><p>阿难汝受是先出神仙名号。终吉成就志念成就咒术成就常修苦行住止山林。势力<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>感变速疾。五通如意游步<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。吾今说其名号。所谓名八脱大仙名左大仙。左天大仙波梨大仙。日施大仙善及大仙。覆住大仙迦葉大仙。老迦葉大仙皱眉大仙。支山大仙分乐大仙。名是大仙名前大仙。鹿头大仙阇罗大仙。二熟大仙黑二熟大仙。采清大仙乎山大仙。忍辱大仙名称大仙。名师子大仙名舡大仙。名鸽大仙名马大仙。名雪大仙赤目大仙。难事大仙毗若波耶大仙名铠大仙。名秋大仙。太白大仙名岁大仙。无诤大仙诤夜步大仙。名觉大仙缚指火大仙。持香大仙一角大仙。仙角大仙揭瞿大仙。单茶耶那大仙名头大仙。分界大仙劫毕罗大仙。瞿昙大仙赤马大仙毛聚大仙无乐大仙。吉腻卢大仙。阿难斯等是先出大仙。造四围陀所为如意。苦行严迅有大威势。所作悉办。斯等亦以此大孔雀王咒经。拥护某甲令受百岁得见百秋。即说咒曰。</p><p>诃利诃利诃利絺利弥利修利修利醯利醯利弥利弥利陀覆陀茶覆伽婆腻摩他腻他诃腻陀诃腻簸遮腻簸遮腻簸多腻阿那腻他罗遮罗遮罗腻簸吒腻摸诃腻担婆腻阎婆腻悉波诃。</p><p>四天王及诸大鬼神王。亦以孔雀咒王。拥护某甲令寿百岁得见百耿。即说咒曰。</p><p>何迦帝(都界反)毗迦帝龂罗腻龂罗腻阿罗尼吼翅吼翅负翅负翅诃奈诃奈诃奈诃奈诃奈诃奈诃奈诃奈诃奈。</p><p>除其怨家。</p><p>陀诃([口*蔑]留反)陀诃陀诃陀诃陀诃陀诃陀诃陀诃陀诃陀诃。</p><p>其有向某生恶念者皆悉治之。</p><p>钵柘钵柘钵柘钵柘钵柘钵柘钵柘钵柘钵柘钵柘。</p><p>若有向某伺求便者皆治之。</p><p>豆豆豆豆豆豆豆灭某怨恶。</p><p>诃诃诃诃诃诃诃诃阇帝(都界反)阇帝阇帝阇帝阇帝阇帝阇帝阇帝阇帝灭其怨恶。</p><p>周娄周娄周娄周娄周娄周娄周娄周娄周娄周娄醯利醯利醯利醯利醯利醯利醯利醯利醯利醯利弥利弥利弥利弥利弥利弥利弥利弥利弥利弥利睺漏睺漏睺漏睺漏睺漏睺漏睺漏睺漏睺漏睺漏脂致脂致脂致脂致脂致脂致脂致脂致脂致脂致醯翅醯翅支翅魔翅。</p><p>得贤吉祥普贤成一切事无垢净妙月贤日爱昙德杜昙德毗蝇(姚登反)加隶拥护某甲令得寿百岁得见百秋摩尼罗亶经摩诃乾陀<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>救病苦厄孔雀王咒除其怨家。</p></div>"
}]