[
    {
        "title": "佛陀的称谓有哪些呢？",
        "key": "200896",
        "describe": "释迦牟尼佛有“佛陀十号”：如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛，具备这十种德行，就称为“世尊”，也就是世间和出世间最尊...[阅读全文]"
    },
    {
        "title": "菩萨是怎么诞生的？四个条件",
        "key": "199104",
        "describe": "作为一位菩萨，要不断地自觉追寻更高的智慧，开拓自己心识之中潜藏的佛性，使自己能够得到更大的力量与解脱。并把自己开悟所得的利益，宣告给一切众生，使所有众生...[阅读全文]"
    },
    {
        "title": "文殊菩萨是谁的老师？",
        "key": "200911",
        "describe": "在《放钵经》中，佛说：今我得佛，有三十二相，八十种好，威神尊贵度脱十方一切众生者，皆文殊师利之恩，本是我师。前过去无央数诸佛，皆是文殊师利弟子，当来者亦...[阅读全文]"
    },
    {
        "title": "打坐时出现幻境该怎么办？",
        "key": "200785",
        "describe": "打坐时如果有任何善恶境界现前，都不要执着。告诉自己，这是识心幻现，要坚住正念。即使是好的境界现前，也不要理它，《楞严经》讲：“虽有圣境，莫作圣解，若作圣...[阅读全文]"
    },
    {
        "title": "绕佛怎么绕？从左走或从右走有区别吗？",
        "key": "200778",
        "describe": "进入寺院，站在佛前许多善信不清楚应该如何绕佛，从左走、从右走有区别吗？《佛说无量寿经》中，法藏比丘到佛所后，“稽首佛足，右绕三匝。”佛陀住世时，听法众一...[阅读全文]"
    },
    {
        "title": "什么是涅槃寂静？",
        "key": "200786",
        "describe": "我们修行无常无我以后，最后的结果很重要——涅槃寂静，这是解脱道的一个很重要的相貌——寂静相。“涅槃”者，寂灭、离系、无生义。谓行者明“无常”、“无我”之...[阅读全文]"
    },
    {
        "title": "神秀禅师的禅偈是什么意思？",
        "key": "199108",
        "describe": "身是菩提树，心如明镜台。时时勤拂拭，勿使惹尘埃。这是一首极为著名的禅偈，出自唐朝的神秀禅师，常被人拿来与六祖惠能另一首禅偈做对比。《六祖坛经》中记载，为...[阅读全文]"
    },
    {
        "title": "出家人跟出家人之间怎么称呼呢？",
        "key": "200763",
        "describe": "出家人和出家人之间可以互称师父、师兄、师弟，与一般世俗人一样，称呼长辈就说：「这是我的师叔」、「我的师伯」、「我的师祖」……如果是称呼其他寺庙的出家人，...[阅读全文]"
    },
    {
        "title": "为什么佛教中的智慧重要？文殊菩萨的智慧有多深？",
        "key": "199106",
        "describe": "为什么佛教这么重视智慧呢？因为从根本上来说，世间的一切恶，都是源于无明愚痴。而一切苦果，一方面因为有恶不善法为业因，另一方面也要有无明相应，才会呈现为苦...[阅读全文]"
    },
    {
        "title": "“冤亲债主”包括哪些？",
        "key": "200869",
        "describe": "居士问：请问法师，“冤亲债主”包括哪些？感恩法师。容通法师答：我们大家在做法会、做佛事的时候经常说要超度冤亲债主。这个债主实际上就包括什么呢？冤和亲这两...[阅读全文]"
    },
    {
        "title": "佛教的般若是什么意思？",
        "key": "200770",
        "describe": "般若的基本含义是“智慧”。在佛教看来，般若不同于世间的智慧。世间的智慧是夹杂着烦恼的，是有缺陷的；而般若智慧则是清净的，是圆满的，能洞察宇宙人生真相，彻...[阅读全文]"
    },
    {
        "title": "如何实修普贤十大愿？",
        "key": "200862",
        "describe": "四者忏悔业障。“忏”就是忏除以往，“悔”就是对于现在的罪恶有所追悔。忏悔了就不要再造罪，不能一边忏一边造，那就不行。什么业障呢？这里面讲的三障：业障、烦恼障...[阅读全文]"
    },
    {
        "title": "三皈依是什么意思？",
        "key": "200860",
        "describe": "居士问：阿弥陀佛！感恩师父！因为我们佛教里提到法法平等，法法圆满，八万四千法门，门门都是我们佛弟子的每一个境界和缘分，那么请法师给我们所有的居士通俗的解...[阅读全文]"
    },
    {
        "title": "做功夫时会常出现哪五种念头？",
        "key": "200855",
        "describe": "做功夫时要掌握用心的要领，使功夫做得恰到好处。在这个过程中，心念的把握非常重要。总的来说，在用心的过程中，有五种念头经常交替出现，这五种念头就是：故起念、串...[阅读全文]"
    },
    {
        "title": "什么是忍辱，修行为什么要修忍辱？",
        "key": "200769",
        "describe": "忍辱，梵语ksanti，音译“羼提”，意即“忍辱”，指忍受各种侮辱而不起嗔恚恼恨。修忍辱的人，能够忍受外来的一切侮辱和恼害而不生嗔恚之心，能做到像《大集经》中...[阅读全文]"
    },
    {
        "title": "修行法门众多，该如何去选择？",
        "key": "200847",
        "describe": "佛教修行法门有八万四千种之多，每一个法门，只要我们认真去修习，最终都能到达最后的彼岸，也即是开悟证道，了脱生死轮回，获得根本解脱。在这么多法门的情况下，我们...[阅读全文]"
    },
    {
        "title": "什么障碍往生？四种过患",
        "key": "200844",
        "describe": "为什么念佛这么长时间了，自己还没有把握往生？为什么到了临终还不确定阿弥陀佛到底能不能来接我？我到底能不能往生？这是最可悲的事情。关于往生的障碍我们自己一...[阅读全文]"
    },
    {
        "title": "为什么持名是妙行者？",
        "key": "200843",
        "describe": "为什么持名是妙行者？下面讲：第一、但持一句佛号，而得三界横超，此简捷妙。只要念一句佛号，就能够横超三界，又简单又快捷，这是其他法门比不了的。第二、但要十...[阅读全文]"
    },
    {
        "title": "六道轮回是什么意思，六道是指哪六道？",
        "key": "200794",
        "describe": "六道是天道、人道、阿修罗道、畜生道、饿鬼道、地狱道。这六道中的众生无法脱离生死，这一世生在这一道，下一世又生在那一道，在六道像车轮一样地旋转，永远转不出...[阅读全文]"
    },
    {
        "title": "坏苦是什么意思？",
        "key": "200828",
        "describe": "坏苦即是因变化而至的苦。因贪欲而生的快乐是短暂的，是凡夫之乐。当短暂的快乐满足感消逝后，所带来的空虚，就是坏苦。佛陀也把坏苦称之为变苦，或变异苦，亦指人...[阅读全文]"
    },
    {
        "title": "涅槃、解脱是什么意思？",
        "key": "200827",
        "describe": "“涅槃”是梵文的音译，意译“圆寂”、“灭度”等。佛教对涅槃的解释很多，且每个派别的理解也有差异。如小乘佛教把涅槃解释为“虚无绝灭”，意谓身心俱无、一无所...[阅读全文]"
    },
    {
        "title": "鸠摩罗什是谁，翻译了哪些佛经？鸠摩罗什简介",
        "key": "200813",
        "describe": "鸠摩罗什是玄奘之前、中国最伟大的佛学义理大师和翻译大师。他的很多译经流传至今。他的父亲叫鸠摩罗炎。按照《高僧传》的记载，鸠摩罗炎原来也是一代高僧。他来到...[阅读全文]"
    },
    {
        "title": "佛的寿命有多长，为什么有长有短？",
        "key": "200803",
        "describe": "《止观辅行七》云：“一期为寿，连续日命。一期连持，息风不断，名为寿命。”关于“佛寿”，可以分为三种：法身、报身与化身的寿命。法身、报身佛佛相同，故寿命皆...[阅读全文]"
    },
    {
        "title": "为什么要持戒？戒是保护，戒是清凉",
        "key": "200792",
        "describe": "戒，大家都称之为「约束」。例如，受了五戒之后，这也不能干，那也不能干。而优婆塞菩萨戒，又有六重四十八轻戒。因此，大家把戒当成了一种制约和束缚。但是，从佛...[阅读全文]"
    },
    {
        "title": "菩萨戒的内容有哪些？佛教三聚净戒内容",
        "key": "200790",
        "describe": "菩萨戒又称作「三聚净戒」，包括：摄律仪戒、摄善法戒和摄众生戒。第一，摄律仪戒，包含五戒十善、八关斋戒，也包括比丘戒、比丘尼戒。「戒」要告诉我们什么？是告...[阅读全文]"
    },
    {
        "title": "什么是表业和无表业？",
        "key": "200789",
        "describe": "业的表相有“表业”和“无表业”。身、口、意三业中，意业没有“表业”和“无表业”的分别，因为意业本就看不到。只有身口业有“表业”和“无表业”的区分。“表业...[阅读全文]"
    },
    {
        "title": "佛教的菩萨怎么解释？菩萨的意思",
        "key": "200780",
        "describe": "菩萨是印度古梵语菩提萨埵（bodhisattva）的简称。译为中文，意为“觉有情”（追求觉悟并帮助有情众生觉悟者），也可译作道众生、道心众生。他上求菩提（自利，自度...[阅读全文]"
    },
    {
        "title": "怎么判断自己能不能往生？",
        "key": "200681",
        "describe": "到晚年的时候，有两个指标可以看得出你会不会往生：第一个叫都摄六根，另一个叫净念相继。你对往生的愿力有多强，这个还不是重点；你对娑婆世界的心，你那个心是不...[阅读全文]"
    },
    {
        "title": "“当处出生，随处灭尽”是什么意思？",
        "key": "200688",
        "describe": "整部《楞严经》的修学重点，就在“破妄显真”。那么在整个过程当中，就是修学“不迷、不取、不动”这六个字。而“不迷”是修行的一个重要关键，它是一种理观，属于...[阅读全文]"
    },
    {
        "title": "许愿和发愿有什么区别？行愿是什么意思？",
        "key": "199109",
        "describe": "我们对“许愿”和“发愿”的概念进行了辨析：在佛前发起一个心愿，并且祈请诸佛菩萨加持护佑，这和吹灭生日蜡烛许个愿，或是在一般民间信仰的神明面前许个愿不一样...[阅读全文]"
    },
    {
        "title": "为什么念佛诵经能消除恐惧与不安？",
        "key": "200740",
        "describe": "从浅显的方面来说，恐惧、不安、忧虑、烦乱，根源无非是内心的“贪嗔痴慢疑”。就像一杯掺了泥沙的水，越是去想，内心搅动越厉害，杯中的水浑浊不堪。双眼透过这杯水，...[阅读全文]"
    },
    {
        "title": "佛教的八风指的是什么？",
        "key": "200737",
        "describe": "人生在世，有八种东西能引起我们强烈的情感反应，它们分别是：利、衰、毁、誉、称、讥、苦、乐。符合自己意愿的叫“利”，不符合自己意愿的叫“衰”；暗中的毁谤叫...[阅读全文]"
    },
    {
        "title": "什么是发愿？什么是切愿？",
        "key": "200217",
        "describe": "弟子问：顶礼法师！南无阿弥陀佛！恭请法师慈悲开示，什么是发愿？什么是切愿？南无阿弥陀佛！一如法师答：这是愿的问题，我们在讲愿的时候讲过，信愿行是往生极乐...[阅读全文]"
    },
    {
        "title": "七宝莲花具足了三种功德与含义",
        "key": "200403",
        "describe": "莲花在极乐世界是很重要的，我们到极乐世界就是在莲花中化生的。莲花有什么寓意？它为什么在极乐世界如此重要？极乐世界的莲花具有哪些功德？让我们跟随西行法师，...[阅读全文]"
    },
    {
        "title": "什么是一佛五十菩萨像？龙门石窟有多少？",
        "key": "200480",
        "describe": "所谓“一佛五十菩萨像”即阿弥陀佛五十菩萨像，是信仰西方净土的僧人们在观想、禅定时所感悟到的一种极乐世界瑞像。其图像特征是：从主尊佛的佛座下蔓生出莲茎（或...[阅读全文]"
    },
    {
        "title": "怎样才能得到智慧呢？有三种途径",
        "key": "200705",
        "describe": "我先解释一下智慧的含义：明白一切事相叫做智；了解一切事理叫做慧。简单来讲就是，明了一切事相、事理为智慧。而智慧也多和慈悲连在一起，我们常说悲智双运，即是...[阅读全文]"
    },
    {
        "title": "十八罗汉的出处",
        "key": "200421",
        "describe": "善士问：师父，竹林寺文殊殿两边供奉的十八罗汉，请问十八罗汉的出处？妙江法师答：关于我们这个文殊殿的罗汉，《法住记》里头讲的是十六尊者，是佛的十六大弟子，...[阅读全文]"
    },
    {
        "title": "佛教中放焰口法事的由来",
        "key": "200676",
        "describe": "饿鬼又称焰口、面燃等，属于三恶道众生之一， 其体枯瘦，咽细如针，口吐火焰，以生前悭吝之故，遂有此一果报。曾有饿鬼在阿难入定中显现，并由此而成为佛教“放焰...[阅读全文]"
    },
    {
        "title": "忏悔有什么涵义？惭愧是一种财宝",
        "key": "200661",
        "describe": "每个人都作过很多错事，只是过去不知道错了，现在知道了，尤其是学佛之后，心有不安，虽然以后不再作，可是以前作错的怎么办呢？像有些道友在没有学佛之前，轻法慢...[阅读全文]"
    },
    {
        "title": "怎么念佛才能和佛感应道交？",
        "key": "199114",
        "describe": "我们在平常念佛或者打完佛七以后，会有很明显的体会。有些人业障消除，法喜充满，这个佛号在他身心当中产生强大的加持力；有些人没什么感觉，好像没念一样，依然烦...[阅读全文]"
    },
    {
        "title": "什么是罗汉，佛教罗汉有多少个？",
        "key": "200685",
        "describe": "小乘佛教修解脱道，通过修行达到自我解脱。小乘所证得的果位分为“声闻”和“缘觉”两种。声闻是通过听闻佛说苦、集、灭、道四谛法而得解脱道。声闻中的最高果位就...[阅读全文]"
    },
    {
        "title": "佛教的解脱是什么意思，修持解脱道的方法有哪些？",
        "key": "200672",
        "describe": "“解脱”的梵文原词是moksa，意思是解开烦恼的束缚，脱离三界苦海，是指众生不为尘世所累的一种精神自由的宗教境界。从广义上说，凡是在精神上不受束缚，脱离障碍自...[阅读全文]"
    },
    {
        "title": "为什么要出家？",
        "key": "200645",
        "describe": "每到观音菩萨的殊胜日，都会促使我们思考一个很重要的课题——为什么要出家？佛陀出家、观音菩萨出家，是因为看到了所谓的“家”的虚伪性。在轮回的波涛里没有一样...[阅读全文]"
    },
    {
        "title": "临时抱佛脚真能解决问题吗？",
        "key": "199136",
        "describe": "谚语“平时不烧香，临时抱佛脚”，比喻的是平时没准备，临时慌忙应付才设法求助。不过发生急事后，再去 “抱佛脚”真能解决问题吗？宋朝张世南《宦游纪闻》有这么...[阅读全文]"
    },
    {
        "title": "正见是什么意思？",
        "key": "200647",
        "describe": "所谓“正见”是正确的见解，是从推论而来的坚定主张，也就是：“择善而固执之”。正确的认识不一定是正见。比如说，我们听说地球绕着太阳转，这是知识；但伽利略为...[阅读全文]"
    },
    {
        "title": "佛教的授记是什么意思？",
        "key": "200646",
        "describe": "“授记”是梵语ryakarana的意译，佛教特有的词汇，是诸佛世尊为发菩提心、立菩提愿、受菩萨戒、行菩萨道者，预示未来证道成佛的预记。只有佛能为众生授记作佛。授记...[阅读全文]"
    },
    {
        "title": "“菩萨畏因，众生畏果”是什么意思？",
        "key": "200641",
        "describe": "“菩萨畏因，众生畏果。”这是一句智慧的语句。“菩萨畏因”，菩萨就是有智慧的人，他会三思而后行，在做事情之前，他会思考后果能不能承受，如果后果不能承受，他...[阅读全文]"
    },
    {
        "title": "西方极乐世界的七宝是什么？",
        "key": "200640",
        "describe": "“七宝”，“宝 \"是稀有难得之意。在我们这个世间也有无数珍宝，但是需要开采、挖掘、冶炼才能显现，因此非常稀有难得。极乐世界的七宝是自然形成，所谓的“七宝”...[阅读全文]"
    },
    {
        "title": "佛教的器世间是什么意思？器世间的形成",
        "key": "200637",
        "describe": "器世间是指有形的物质世界，佛教认为它是由有情的业力增上而形成的。世界形成之初，因有情共业成熟形成风轮，之后大云雨灌注于上而成水轮，水上凝结而成金轮，金轮...[阅读全文]"
    },
    {
        "title": "什么是“界分别观”？",
        "key": "200633",
        "describe": "界分别观它也是无我观。它就是观没有主宰。观想十八界诸法，是由地、水、火、风、空、识所和合组成的。所谓十八界是六根、六尘、六识。这也就是每个人认识事物的整...[阅读全文]"
    },
    {
        "title": "沙弥是指什么，沙弥是僧人吗？沙弥的分类",
        "key": "200628",
        "describe": "在佛教的律制中，出家不久的僧人称作沙弥。沙弥有三类：一、七岁至十三岁，称作“乌沙弥”，意思是只能驱逐乌鸟。二、十四岁至十九岁，称作“应法沙弥”，意思是正...[阅读全文]"
    },
    {
        "title": "什么是“三乘四果”？",
        "key": "200625",
        "describe": "“三乘四果”，这个三乘四果的路走不走？其实这个修行路不走，只是用于分别表示的。如果不用这个分别表示，这个无为法的差别性无法表述这个问题。怎么讲这个问题？...[阅读全文]"
    },
    {
        "title": "四无碍智指的是什么？法藏比丘的四无碍辩才",
        "key": "200499",
        "describe": "所谓的“四无碍智”，又名“四无碍辩才”：一、义无碍辩才。法藏比丘对世出世间一切诸法的义理明了通达，故名“义无碍辩才”。二、法无碍辩才。法藏比丘对世出世间...[阅读全文]"
    },
    {
        "title": "四法界是什么意思？简略说明四法界",
        "key": "200543",
        "describe": "法界，指的是每一个法都有它的界限，界限代表的是各自的特色、功能、特性与因缘果报等，佛教将这些万事万法的分别界限，统归于「法界」。懂得了法界，可以说就懂得...[阅读全文]"
    },
    {
        "title": "「食存五观」分别是哪五观？",
        "key": "200603",
        "describe": "活了40多年，吃了40多年的饭，出家为僧后才想过吃饭的问题。中国汉传佛教寺院过堂用餐前，我们要供养、要施食，不能只想自己有吃，而忘了供佛、供僧、布施六道众生，而...[阅读全文]"
    },
    {
        "title": "什么是正法？摄受正法的四点意义",
        "key": "200531",
        "describe": "什么是正法？不偏不邪的究竟法即是正法。正法是每个人具备的真如佛性，只要我们能开采内心的能源宝藏，则信仰是正法，道德是正法，因果是正法，慈悲是正法。将正法...[阅读全文]"
    },
    {
        "title": "佛教三藏指的是什么，是哪三藏？",
        "key": "200554",
        "describe": "佛陀住世说法四十九年，当时皆以口传记忆方式传诵，并没有任何文字记录佛陀的教说。佛陀入灭后，弟子们深恐佛陀的言教散逸，同时也为了确立教法的流传，于是由大迦...[阅读全文]"
    },
    {
        "title": "佛教僧人取名也排辈分吗？宗派是如何排的？",
        "key": "200564",
        "describe": "一般的家族用以撰修家谱来确定辈分的划定，以达到“辨尊卑、序长幼”的目的，同时，防止冒宗。在佛教里僧人取名也排辈分，字辈同样具有这样的功能，你知道吗？　僧...[阅读全文]"
    },
    {
        "title": "佛教八风是什么意思？有什么作用？",
        "key": "200566",
        "describe": "瑜伽焰口是佛教中比较常见的一种佛事活动，里面有一个非常重要的偈颂：“稽首天中天，毫光照大千，八风吹不动，端坐紫金莲。”“八风”是什么意思呢？所谓的“八风...[阅读全文]"
    },
    {
        "title": "社会人称出家人为和尚、尼姑这种称谓正确吗？",
        "key": "200547",
        "describe": "其实“和尚”、“尼姑”的称呼是很正确的。男众称“和尚”，是“以和为尚”的意思。女众称“尼姑”，是因为“尼”在印度话里是指女性，“姑”则是指女性的长辈，那...[阅读全文]"
    },
    {
        "title": "和尚、老和尚跟退居和尚有什么区别？",
        "key": "200546",
        "describe": "“和尚”就是住持，等到住持卸职了、退位了，就叫“退居和尚”。如果接任的人，是退居和尚的徒弟、晚辈，因为辈分的关系，他就可以称“老和尚”；如果不是交给徒弟...[阅读全文]"
    },
    {
        "title": "什么是一实相印？",
        "key": "200541",
        "describe": "《大智度论》云：“三世诸佛，皆以诸法实相为师。”《法华经》云：“无量众所尊，为说实相印。”实相具说即诸法实相，真实不虚。诸经论所说的空性、无我、真如、法...[阅读全文]"
    },
    {
        "title": "佛教徒可以化妆吗？",
        "key": "200565",
        "describe": "任如果化妆的目的不是为了取悦他人、博人眼球，而是为了庄严自身形象，以示对他人尊重，这种情况下，适当地化妆是佛教所允许的。佛教讲究中道，并不排斥美，当我们...[阅读全文]"
    },
    {
        "title": "怎样理解慈悲出祸害，方便出下流？",
        "key": "200510",
        "describe": "方便是佛菩萨度化众生的必要条件之一，没有方便就度化不了众生。当然，这种方便法不能滥用，否则就是慈悲出祸害，方便出下流。所谓的慈悲出祸害，是指没有智慧的慈...[阅读全文]"
    },
    {
        "title": "什么是三转法轮？佛陀三转法轮的内容及过程",
        "key": "200553",
        "describe": "佛陀成道后，三度演说四圣谛妙义，称之为“三转法轮”。第一次为“示相转”，指示“此是苦，逼迫性；此是集，招感性；此是灭，可证性；此是道，可修性”；第二次为...[阅读全文]"
    },
    {
        "title": "孝道有哪几种？世间孝和出世间孝",
        "key": "200561",
        "describe": "佛教认为，孝道有两种：一种是“世间”的孝，包括“一者承欢侍彩，而甘旨以养其亲。二者登科入仕，而禄以荣其亲。三者修德励行，而成圣成贤，以显其亲，是则世间之...[阅读全文]"
    },
    {
        "title": "般若波罗蜜是什么意思？",
        "key": "200533",
        "describe": "“般若波罗蜜”第一次读这五个字的人会觉得拗口。“般若波罗蜜”刚开始接触佛法的人会觉得发懵。究竟什么是“般若”？虽然不明白，感觉应该很厉害。是的！般若不是...[阅读全文]"
    },
    {
        "title": "念佛应该怎么念？要不急不缓",
        "key": "198447",
        "describe": "念佛这桩事，总得不缓不急，否则易出毛病。当初释尊有一弟子，擅弹七弦琴，此人学佛后很是用功，不肯休息。在一般人见之自然甚好，但释尊视之则不对。因凡事得取中...[阅读全文]"
    },
    {
        "title": "一心称念观世音菩萨圣号即得护持离苦得乐",
        "key": "198183",
        "describe": "农历九月十九是观世音菩萨出家日。千百年来，无数人因念观世音菩萨的名号而化解灾难、解脱困境。九法界众生凡有所求，但能一心称念菩萨圣号，菩萨即以千眼照见，千...[阅读全文]"
    },
    {
        "title": "什么是佛缘？什么样的人和佛有缘？",
        "key": "198459",
        "describe": "我们常常听到这样一句话：“佛度有缘人”。意思就是说：佛菩萨在度众生的时候，其对众生的加持、护佑还有教化是否有效，取决于众生与佛菩萨的缘分和对佛菩萨的信心...[阅读全文]"
    },
    {
        "title": "佛教的粗言是什么意思？",
        "key": "200550",
        "describe": "“粗言”是指口业，代表了十恶业，分别是杀生、偷盗、邪淫、妄语、两舌、恶口、绮语、贪、嗔、痴。“杀生”即是杀害有生命的众生；“偷盗”即是盗窃他人财物；“邪...[阅读全文]"
    },
    {
        "title": "为什么要念佛？关于念佛的七个问题",
        "key": "200444",
        "describe": "佛是觉者的意思，念佛就是让心保持觉醒。散乱时，念佛收摄身心；生气时，念佛调柔自我；得意时，念佛消融自我；生病时，念佛安定身心……从念心外的佛到念自性光明...[阅读全文]"
    },
    {
        "title": "在唐朝出家是怎样一种体验？要遵守怎样的戒律？",
        "key": "200312",
        "describe": "唐朝是我国佛教繁荣的时期，宏伟的佛教寺院，精湛的佛学著作，规模空前的译经事业，还有谆谆善诱的高僧。在当时，一个人发心想要出家，要经历怎样的程序？出家后又...[阅读全文]"
    },
    {
        "title": "遇到难以驾驭的违缘时该如何消灾免难？",
        "key": "200446",
        "describe": "祈福消灾、趋吉避凶是人类的本能。佛法讲因缘，有善缘有恶缘，有顺缘有逆缘，当不好不如意的因缘果报显现，就有了“违缘”一说。所谓违缘，小到种种不如意之事，大...[阅读全文]"
    },
    {
        "title": "佛教中鬼子母是什么？母夜叉的来历",
        "key": "198729",
        "describe": "佛教中有一位母亲神，造像、画作中的她身体丰腴，面容圆润，怀抱小儿作哺乳状，是公认的孕产妇女与孩童守护神。然而，这样一位慈悲的母亲神，却有凶神恶煞般的名字...[阅读全文]"
    },
    {
        "title": "为什么做同样的事果报却不相同？",
        "key": "200449",
        "describe": "做一样功德，它产生的功德也是不一样。我们十个人同样布施10元钱到三宝道场，但是他们十个人得到的功德也不一样，这个根本在哪里呢？就是意乐，就是你心态的问题。...[阅读全文]"
    },
    {
        "title": "拜忏可以消业障，让所求能更快满愿是吗？",
        "key": "199263",
        "describe": "有道友问：“诵经、念佛总是很难摄心，所以收获不是很大，是不是拜忏就可以消业障，让自己的所求能更快满愿？”诸位道友，以前有很多人来旃檀林求忏，生意不好的，...[阅读全文]"
    },
    {
        "title": "佛教的庄严指什么？庄严在佛教中的两种意义",
        "key": "200527",
        "describe": "“庄严”从词性来说，有名词和动词两种性质，即在句中有两种用法，意义也略有不同。作为名词使用，指装饰得十分壮丽的状态，称之为“庄严”。如《阿弥陀经》云：“...[阅读全文]"
    },
    {
        "title": "一心不乱是什么意思？",
        "key": "200517",
        "describe": "弟子问：阿弥陀佛！顶礼师父！师父，能解释一下一心不乱吗？一如法师解答：阿弥陀经里面讲的念佛一日到七日，念佛达到一心不乱，这是鸠摩罗什大师他的一种意译，这...[阅读全文]"
    },
    {
        "title": "什么是化相三宝、住持三宝、自性三宝？",
        "key": "200520",
        "describe": "三宝分为化相三宝、住持三宝、自性三宝。何谓“化相三宝”？两千多年前，释迦牟尼佛出家修道，在菩提树下开悟，证得无上佛道，到鹿野苑为惰陈如等五比丘说四圣谛法...[阅读全文]"
    },
    {
        "title": "佛教善恶观的根本精神：诸恶莫作，众善奉行",
        "key": "200507",
        "describe": "善恶是相对的，相互依存的。有善就有恶，无恶就无善，失去了一方，另一方就不能单独存在。而且，善恶也是可以互相转化的。先前的善人，变坏了，可以变为后来的恶人...[阅读全文]"
    },
    {
        "title": "贪嗔痴指的是什么，为什么是三毒，哪个最严重？",
        "key": "200485",
        "describe": "贪嗔痴三毒是一切烦恼的根源，它残害身心，使人沉沦于生死苦海，为众恶之根源，故又称“三不善根”。“贪”是指众生生活在世间，以眼耳鼻舌身等诸根，接触色声香味...[阅读全文]"
    },
    {
        "title": "十二缘起的爱是什么？",
        "key": "200482",
        "describe": "「爱」是一种烦恼，是从情感的染著上来表述烦恼，爱著自我爱著境界。无明虽是一切烦恼的总称，但当无明和「爱染」一起并用时，无明就是指知见上的错谬，而「爱染」...[阅读全文]"
    },
    {
        "title": "佛教的十八界指的是什么？",
        "key": "200478",
        "describe": "佛教以人的认识为中心，对世界一切现象分为根、尘、识三大类根，合称十八界，包括能发生认识功能的六根（眼根界、耳根界、鼻根界、舌根界、身根界、意根界），作为...[阅读全文]"
    },
    {
        "title": "什么是幽冥菩萨戒？",
        "key": "200477",
        "describe": "什么是幽冥菩萨戒？“幽冥菩萨戒”是在世人给过世亲人、祖先、冤亲债主等一切亡者，及孤魂所受持的菩萨戒律。由于他们生前曾造作恶业，现在堕落在恶道中受苦无尽，...[阅读全文]"
    },
    {
        "title": "第七识是什么？和阿弥陀佛名号绑在一起是什么意思？",
        "key": "200468",
        "describe": "弟子问：顶礼法师！请问法师第七识是什么？把阿弥陀佛名号和第七识绑在一起，是什么意思？一如法师解答：这个问题第七识是末那识，是什么识呢？他是一种我执的根本...[阅读全文]"
    },
    {
        "title": "念佛浅说之阿弥陀佛",
        "key": "200435",
        "describe": "结七念佛，是称念阿弥陀佛，愿求往生极乐世界。所以阿弥陀佛与极乐世界，应先作一简要的解说。佛是觉者，凡圆满自觉，觉他功德，断尽一切烦恼习气的，皆名为佛。阿...[阅读全文]"
    },
    {
        "title": "怎么理解万法皆空？",
        "key": "200434",
        "describe": "在我们的概念中，总以为空和有是对立的，意味着没有。但佛法所说的空并不是没有，而是指事物没有固定不变的本质，其存在是由条件决定的。比如我们现在这场活动，是...[阅读全文]"
    },
    {
        "title": "如何消除业障？三种方法",
        "key": "200436",
        "describe": "人之初，性本善，人心本善良，因为受环境等影响，人生在世，总会有在迷失中做过一些过失的行为，这就增加了自己的恶业，有了业障，也就会有心结，特别对责任心强的...[阅读全文]"
    },
    {
        "title": "什么是随喜赞叹？可以用在什么地方？",
        "key": "200433",
        "describe": "“随喜赞叹”，是见他人行善，随之心生欢喜的赞扬之心。见人做善事或离苦得乐而心生欢喜，随着他人之欢喜而欢喜，这些都是随喜。赞叹或是对人的善举而产生的，或是...[阅读全文]"
    },
    {
        "title": "佛教六度是什么意思？",
        "key": "200357",
        "describe": "生命从出生到结束，犹如从一粒种子回归到另一粒种子的过程一样。你从来到这个世间，到离开这个世间的过程，就叫做人生，人的一生会经历很多，如何耕耘经营决定了最...[阅读全文]"
    },
    {
        "title": "什么是四依法？四依法是佛陀留的一把尺",
        "key": "200438",
        "describe": "佛陀灭度后，我们应依何法修学？如何判断老师的观点是否合理？四依法是佛陀留给我们的一把尺。不论我们在世间拜谁为师，都应遵循这四条准则，精进修学，不舍佛教。...[阅读全文]"
    },
    {
        "title": "什么是善根，有几种？",
        "key": "200450",
        "describe": "“善根”，又作善本、德本，即产生诸善法的根本。“善”是指身口意三业的善法而言。“根”，有能生的义。《十住毗婆沙论》云：“善根者，不贪、不恚、不痴，一切善...[阅读全文]"
    },
    {
        "title": "龙门石窟最大的释迦牟尼佛立像在哪里？",
        "key": "200412",
        "describe": "龙门石窟大型释迦牟尼立佛像仅一尊，位于西山莲花洞。莲花洞因其窟顶莲花藻井为龙门石窟雕刻最为精美的一例而得名，开凿于北魏孝明帝孝昌年间（525~527），是在原天...[阅读全文]"
    },
    {
        "title": "除了因果外还有什么深一点的法可以学？",
        "key": "200342",
        "describe": "因果绝对不是浅显的法哦！整个佛法都可以用“因缘因果”四个字概括，“有因有缘世间集，有因有缘世间灭”。因果的法则，其实不仅仅是人们常说的“善有善报，恶有恶...[阅读全文]"
    },
    {
        "title": "僧人、僧侣和僧伽是什么意思？",
        "key": "200369",
        "describe": "出家人是佛教教团里的三宝——佛、法、僧之一。“僧伽”就是僧团，是有组织、有系统、有纪律的修行团体；“僧侣”就是“出家人的同伴”，以僧为侣，以僧为朋友、道...[阅读全文]"
    },
    {
        "title": "佛前供香、供花、供灯、供果的含义",
        "key": "200432",
        "describe": "在佛教里，为了表达对佛的恭敬感恩心，我们常常会做一些佛事，其中包括请香花灯果来供佛，但在这些形式的背后，都有它深刻的内涵。香在佛法中常用来譬喻持戒清净。...[阅读全文]"
    },
    {
        "title": "出家人为什么也叫做缁衣？",
        "key": "200370",
        "describe": "「缁」就是黑色。过去中国的出家人都穿黑色的僧服，因此以「缁衣」代称出家人。「缁衣宰相」，是指做过宰相的和尚，而做过皇帝的和尚，就称为「缁衣帝王」；「缁衣...[阅读全文]"
    },
    {
        "title": "三观法门中的三观是哪三观？",
        "key": "200427",
        "describe": "三观法门中的“三观“，即是指“空假中”三观。“空观”即认识到我们所感知到的一切法皆是空相，空不可得。“假观”，即虽知一切法的真实相是空相，但不执著空相，...[阅读全文]"
    },
    {
        "title": "佛教的触是什么意思？十二缘起之触的含义",
        "key": "200418",
        "describe": "触是指出胎后，根境相触而起的一般的认识，即六根对六尘的认识。这时的「触」已不仅仅是认识外境，而是其中带有与「无明」相应的染著，所以又称为「无明相应触」。...[阅读全文]"
    },
    {
        "title": "学佛是学什么呢？信佛和学佛的区别",
        "key": "200414",
        "describe": "学佛是学什么呢？学佛，不仅仅是诵经、持咒、念佛，最主要的是学习佛陀的慈悲与智慧的精神！学佛不是要你远离生活，而是让你学会生活，因为佛法并不在生活以外，而是在...[阅读全文]"
    },
    {
        "title": "法师、律师、论师、禅师的区别",
        "key": "200404",
        "describe": "一般能够精通经典的一两部，我们都称为法师；能够精通一两部戒律，我们就称为律师；然后精通一两部论典，我们就称为论师。有些人对经律论都不是很精通，他都懂那么...[阅读全文]"
    },
    {
        "title": "回向菩提和回向实际有什么实质性区别吗？",
        "key": "200395",
        "describe": "弟子请问：请问师父，回向菩提和回向实际有什么实质性区别吗？一如法师解答：回向菩提与回向实际是有区别的。因为菩提分为世俗菩提，胜义菩提。世俗菩提又分愿菩提...[阅读全文]"
    },
    {
        "title": "修什么样的法可以生起出离心和菩提心呢？",
        "key": "200393",
        "describe": "师父说：人生很短暂，想要修行过程中进步快、证悟高，那么基础一定要牢固！这个基础就是出离心、菩提心！但是为什么一定要有这两个心呢？因为没有出离心和菩提心，...[阅读全文]"
    },
    {
        "title": "什么是四邪命食？下口食、仰口食，方口食，维口食",
        "key": "200394",
        "describe": "假如来的钱财来的不正，那叫作邪命。所以佛在经典上列出了四种邪命，也就是为了养家糊口来的钱财来源不正，称为四邪命。这些四邪命都是对自己不利的造恶业的，对别...[阅读全文]"
    },
    {
        "title": "三途八难是指哪三途与八难？",
        "key": "200392",
        "describe": "三途：一、火途（地狱道），地狱道中火光充满，所以叫“火途“。二、血途（畜生道），畜生不是被人杀：就是互相残杀弱肉强食，被杀时都要流血，所以叫 血途”。...[阅读全文]"
    },
    {
        "title": "三垢指的是什么意思？",
        "key": "200390",
        "describe": "“三垢”指的是贪嗔痴三毒，贪嗔痴三毒是缺乏佛法智慧的体现也是一切烦恼的根源。“贪”，指对顺的境界起贪爱，非得到不可，否则心不甘情不愿；“嗔”，指对逆的境...[阅读全文]"
    },
    {
        "title": "三藏十二分教是指什么？",
        "key": "200388",
        "describe": "三藏十二部教典，也称为“三藏十二分教”，含摄了佛陀所说的一切教法。三藏，指经藏、律藏和论藏。“藏”是蕴积、包含义。《毗婆沙论》云：“藏者，器也。何谓为器...[阅读全文]"
    },
    {
        "title": "何谓四念处？四念处是修学佛法的基础",
        "key": "200377",
        "describe": "小乘讲有“四念处”，就是指四个安顿心念的处所，又称为“四念处观 \"。之所以称为“四念处观”，是因为它并不纯粹在于修定，而是以四种智慧的法观察念处，来破除四...[阅读全文]"
    },
    {
        "title": "极乐世界的花有哪些特质和功德？",
        "key": "200376",
        "describe": "花是我们身边不可缺少的一道风景，它让这个世界变得多姿多彩芳香四溢。极乐世界也有一道美丽的风景，阿弥陀佛和释迦牟尼佛也一定不会忽略，那就是花的庄严。跟娑婆...[阅读全文]"
    },
    {
        "title": "什么是缘起？缘起是世界多样性的必然",
        "key": "200211",
        "describe": "所谓缘起，就是一切事情之所以发生或消亡，都有一定的因缘条件。从因到果，中间一定要仗各种的缘，否则因很难成果。好比一朵盛开的花，种子是“因”，从种子的成长...[阅读全文]"
    },
    {
        "title": "月光菩萨是谁？代表什么意思？",
        "key": "200375",
        "describe": "月光菩萨又称月净菩萨、月光遍照菩萨，与日光菩萨并为药师琉璃光如来的两大辅佐，合称“东方三圣”。《药师如来本愿经》云：“于其国中，有二菩萨摩诃萨：一名日光...[阅读全文]"
    },
    {
        "title": "什么是音响忍、柔顺忍、无生法忍？",
        "key": "200360",
        "describe": "音响忍”、“柔顺忍“和“无生法忍”，这三种忍都是指对无生空性获得法忍。“忍”是体悟、认识事理而心安之意。所谓的“音响忍”，是指听闻到真实之法，不惊、不怖...[阅读全文]"
    },
    {
        "title": "什么是般若？为什么般若能度愚痴？",
        "key": "200359",
        "describe": "般若，是梵语。译为汉语，称作智慧。但这不是一般的生活日用中所说的智慧。而是含义深广，有了知、分别、简择、决断、觉悟等多重意义，是通达宇宙人生一切真理的高...[阅读全文]"
    },
    {
        "title": "什么是三不退？三种不退转的菩萨是哪三种？",
        "key": "200351",
        "describe": "“不退转”梵语叫“阿鞞跋致”，翻成中文即“不退转菩萨”，具体来说“不退”有三：一、位不退：即修得之位，而不退失。一旦入菩萨位，就不退于二乘位；一旦认识到...[阅读全文]"
    },
    {
        "title": "智慧布施是怎样的？常修布施有什么样的功德？",
        "key": "200061",
        "describe": "迷悟只在一念之间，但这一念的背后，往往是水滴石穿的修行。如何从烦恼的此岸，度到觉悟的彼岸。诸佛菩萨总结出了六种好方法，也被称为“六度”，布施、持戒、忍辱...[阅读全文]"
    },
    {
        "title": "如何念佛？具足三种资粮信愿行",
        "key": "200319",
        "describe": "《阿弥陀经》中对于“如何念佛”这问题说得非常详细，简而言之，就是要具足三种资粮——信、愿、行。信要深信，愿要切愿，行要力行，唯有踏实努力地去修行，念佛才...[阅读全文]"
    },
    {
        "title": "朝山拜佛的意义与功德是什么？",
        "key": "200334",
        "describe": "寒来暑往，每年都能在佛教四大名山上看到朝山者的身影。大家或三两结伴，或由师父带领着，即便汗流浃背，即便灰头土脸，仍旧法喜充满，一路上总是可以听到大家唱诵...[阅读全文]"
    },
    {
        "title": "修行是为了改变自己而不是改变别人",
        "key": "198864",
        "describe": "一位师兄携妻拜访一位法师。这是一对在修行上很精进的夫妇。妻子说：一次跟老公发了脾气，之后马上认错了，可是随后的生理期，肚子还是疼的不行，就打电话给他的老...[阅读全文]"
    },
    {
        "title": "在净土中还有身体的显示吗？",
        "key": "200337",
        "describe": "这是个知识性的问题，不是法义，在净土的根本三经里面，这个问题讲得清清楚楚，四十八愿里面也说得明明白白。《无量寿经》说，往生后，是“无极之体、虚无之身”，...[阅读全文]"
    },
    {
        "title": "什么是回向？回向的误区、种类、方法",
        "key": "200331",
        "describe": "回向是佛教早晚功课、法会等法务活动中，最后一个环节。通常，人们往往只是把回向当成仪轨的一部分，但实际上，回向还是佛法修学过程中非常重要的一个内容，甚至也...[阅读全文]"
    },
    {
        "title": "什么是三皈依？",
        "key": "199722",
        "describe": "在一个师父的主持下，在佛像前表达你皈依佛、皈依法、皈依僧的心愿，这就是三皈依。这是一个什么样的情形呢？首先我要解释，参加三皈依的仪式，不是加入一个组织，...[阅读全文]"
    },
    {
        "title": "如何对治贪欲？对治贪欲的方法",
        "key": "200069",
        "describe": "若诸比丘，衣钵之余，分寸不畜，乞食余分，施饿众生。这是舍贪。所以，你要能够修学三昧，最好对世间的衣服、钵具，你该用的，当然生活上有需要你就拿去用，多余的...[阅读全文]"
    },
    {
        "title": "六和敬是指什么？是哪六和？",
        "key": "200318",
        "describe": "六和敬是指在僧团生活中，僧众由内而外共同恪守的六项原则。（一）身和共住：指身业和合无违。大众和乐共处，共行上殿、诵经、礼佛、坐禅等法事，令善业功德不断增...[阅读全文]"
    },
    {
        "title": "十二缘起的识是什么意思？识的理解",
        "key": "200317",
        "describe": "识，这里是指投胎识。强而有力的业力成熟后就会产生投胎识，引导我们去投胎。投胎识也可说是「无明」和「行业」的异熟果报。经上说：「父精母血识入胎」，依现代医...[阅读全文]"
    },
    {
        "title": "怎样念佛有功德？念佛需要注意什么？",
        "key": "198543",
        "describe": "经云：“念佛一声，功德无量；礼佛一拜，罪灭河沙。”对于我们佛弟子来说，念佛是一个重要的修行法门，可以消业灭罪，增长福报。那么，在念佛时有哪些注意事项呢？...[阅读全文]"
    },
    {
        "title": "地藏菩萨为什么右手执锡杖、左手持摩尼宝珠？",
        "key": "200076",
        "describe": "一般常见的中国佛教地藏菩萨造像，大多右手执锡杖，左手持摩尼宝珠。如《赞地藏菩萨偈》所言：慈因积善，誓救众生。手中金锡，振开地狱之门。掌上明珠，光摄大千世...[阅读全文]"
    },
    {
        "title": "出家的年龄最好在什么时候？",
        "key": "199961",
        "describe": "有的人小时候出家，也就是「童贞入道」，则一生一世都是快乐幸福的。有的人犹豫不决、不敢出家，等到三十、四十岁才出家为僧，也就是「半路出家」；这个年纪，往往...[阅读全文]"
    },
    {
        "title": "忍辱是什么意思？怎么修？",
        "key": "200072",
        "describe": "工作或者生活中难免遇到不顺心的事，大多时候我们应该把嘴巴闭上，带着耳朵听就好，只需要做好自己！这看起来就像是在敷衍，实则不然，而是一种豁达的人生价值观。...[阅读全文]"
    },
    {
        "title": "少吃一块肉会发生什么？吃素有什么好处？",
        "key": "200289",
        "describe": "汉传佛教有着素食的良好传统。从历史来看，汉传佛教吃素的习俗，是由梁武帝提倡才普及开来的。作为一代开国君王，同时又是一名佛教徒，他于公元502年的农历四月初八...[阅读全文]"
    },
    {
        "title": "忏悔是什么意思？",
        "key": "200067",
        "describe": "我们每个人都需要忏悔，忏悔对于一个人心灵的净化和命运的改变都是有作用的，哪怕做梦忏悔都是有用的。忏悔法，这是一种知识，通过对这种知识的学习，我们才能意识...[阅读全文]"
    },
    {
        "title": "三生有幸是哪三生？",
        "key": "200298",
        "describe": "我们在世俗当中经常会讲到一个词“三生有幸”，哪三生？过去生、现在生、未来生。三生即是指，无尽的生命长河，在这无尽的生命长河之中，我们搞懂三件事，即是三生...[阅读全文]"
    },
    {
        "title": "什么是小法与大法？",
        "key": "200293",
        "describe": "大和小是相比较而言的，打个比方说，就像芝麻和西瓜相比，西瓜是大，芝麻是小。具体到修行，如果你只想这辈子过得好一点，这就叫小。相比较而言，想生生世世富贵荣...[阅读全文]"
    },
    {
        "title": "佛教中的行是什么意思？十二缘起之行的意义",
        "key": "200283",
        "describe": "行是与无明烦恼相应的思心所所发动的行为，包括身、口、意三业，所以又称作行业。造业之后会留下业力，未来机缘成熟就会受报。所以「行支」包括了无明相应的行业和...[阅读全文]"
    },
    {
        "title": "什么是“精进行道”？",
        "key": "200272",
        "describe": "诸佛菩萨之所觉悟，就是因为精进行道。那么，“精”是什么意思呢？“精”者，不杂。“进”者，不退。是为“精进”。修持《八大人觉经》，也要不杂精进。念经的时候...[阅读全文]"
    },
    {
        "title": "结缘和攀缘有什么区别？攀缘与结缘的区别",
        "key": "200270",
        "describe": "攀缘与结缘有何区别？攀缘的“攀”是指攀附，好比葛藤，攀附在竹竿上面得以生存。同样的道理，人之所以要攀缘，目的是为了满足自己的贪欲，而刻意的去攀附某种关系...[阅读全文]"
    },
    {
        "title": "众生是什么意思？众生的含义",
        "key": "200260",
        "describe": "众生梵语“萨埵”，传到中国之后，有两种翻译的方式。在玄奘大师以前，一般翻译为“众生”；在玄奘大师之后，称为新译，很多时候都翻译为“有情”。玄奘大师也有用...[阅读全文]"
    },
    {
        "title": "应该怎么处理佛号本？",
        "key": "200257",
        "describe": "居士问：发心书写阿弥陀佛佛号，已写好多本。考虑到自己百年后，不给他人添麻烦，应该怎么处理这些佛号本为妥？一如法师解答：这些老菩萨，他们念佛，有些抄写阿弥...[阅读全文]"
    },
    {
        "title": "什么是昏沉和掉举？如何对治？",
        "key": "200256",
        "describe": "我们在念佛的过程中难免会遇到一些障碍，一个是昏沉，就是打瞌睡，不光是念佛，修行过程当中都会出现；一个是掉举，就是打妄想，妄念特别多。我们应该怎样克服这两...[阅读全文]"
    },
    {
        "title": "什么是无明？为什么说无明是生死的根本？",
        "key": "200243",
        "describe": "无明是指知见上的谬误错乱，就是无我认为有我，是以我、我所见为摄导的烦恼，也是一切烦恼的总称。由无明会引生出各种大、小烦恼。我们生命无始的轮回只是缘起的推...[阅读全文]"
    },
    {
        "title": "布施的意思与种类",
        "key": "200201",
        "describe": "布施，梵语音译檀波罗蜜。檀字保留了梵语的发音，华言的意思是施舍的施。波罗蜜就是到达彼岸的意思，因此檀波罗蜜就是说，通过布施可以从生死的此岸达到涅槃的彼岸...[阅读全文]"
    },
    {
        "title": "“一念无明”什么意思？有哪些住地烦恼？",
        "key": "200212",
        "describe": "「一念」是来源于佛家的 \"一念代万念”的说法；「无明」是指看不见或看不清楚的意思。主要就是说一切的起因都是来源于“念”，错误的念头最终也会遮蔽内心的光明和本性...[阅读全文]"
    },
    {
        "title": "恭迎地藏王菩萨圣诞！消无边业障，获无量福德",
        "key": "200210",
        "describe": "地藏菩萨赞偈 地藏菩萨妙难伦，化现金容处处分。三途六道闻妙法，四生十类蒙慈恩。明珠照彻天堂路，金锡振开地狱门。累劫亲姻蒙接引，九莲台畔礼慈尊。2021年9月6...[阅读全文]"
    },
    {
        "title": "事忏和理忏的区别是什么？",
        "key": "200198",
        "describe": "忏悔有事忏和理忏两种。事忏是基础，理忏是更高层次的忏悔。念经，拜佛、忏求、忏拜，从仪轨到内心，真诚忏悔，“往昔所造诸恶业，皆由无始贪嗔痴，从身语意之所生...[阅读全文]"
    },
    {
        "title": "佛教挂单的意思与程序",
        "key": "200135",
        "describe": "古代的禅师们，为了云游参访、寻师访道，经常会到一些禅寺挂单食宿。挂单又称挂锡、挂钵，取意于将随身携带的三衣钵具、锡杖等衣“单”悬“挂”于僧堂内之钩，含有...[阅读全文]"
    },
    {
        "title": "佛法和佛教是两个概念吗？区别在哪里？",
        "key": "200179",
        "describe": "“佛法”和“佛教”确实是两个概念。什么是“佛法”呢？《金刚经》里讲一切法皆是佛法，这是说世出世间，有为无为，一切法都是佛法。这是从第一义谛、究竟了义来讲...[阅读全文]"
    },
    {
        "title": "什么是慈悲，如何慈悲？常修慈悲喜舍",
        "key": "200178",
        "describe": "我们做佛弟子的，常常说慈悲。我们怎么慈悲？什么是慈悲？慈悲不是你有多两块面包分一块给别人吃那就是一种慈悲。“慈悲喜舍”四无量心是心的一种练习的方法。慈就...[阅读全文]"
    },
    {
        "title": "打坐初学者的四个注意事项",
        "key": "200162",
        "describe": "初学者须注意以下事项：1 要名师指导：参禅打坐，如果没有名师指导，盲修瞎练，容易出差错。2 要自我察觉：禅，完全要靠自己洞察心机，靠自己当下承当。因此参禅...[阅读全文]"
    },
    {
        "title": "法师的十德是哪十德？法师十德介绍",
        "key": "200095",
        "describe": "法师的十德，指对于一个说法的人有一些什么样的要求。在《华严经》第四十三卷澄观法师提出来的一个观点。第一、善知法义：首先来说，一个法师的讲法要对法义要吃透...[阅读全文]"
    },
    {
        "title": "中国佛教的十小名山是哪十座？",
        "key": "200146",
        "describe": "中国佛教的十小名山分别是：北京的香山。北京香山金、元、明、清时建有皇家寺院多座，现存香山寺，也就是大永安寺、碧云寺、卧佛寺等多座著名寺院。第二是南京的栖...[阅读全文]"
    },
    {
        "title": "什么叫恒顺众生？真正的恒顺众生",
        "key": "200145",
        "describe": "恒，就是恒常的意思；顺，就是随顺的意思。顺随着众生的根性而不断地利益他，这才是真正的恒顺众生。我们很多时候一讲到恒顺众生，觉得什么事情都依你，那个不叫恒...[阅读全文]"
    },
    {
        "title": "龙树菩萨圣诞是哪一天？农历七月二十四恭迎菩萨圣诞",
        "key": "200150",
        "describe": "农历七月二十四日，龙树菩萨圣诞。龙树菩萨出生于南印度，从小天资聪慧，青年时便以学识超群而闻名全国。然而，聪明与博学未能让这位稀世天才走上正途，相反，在傲...[阅读全文]"
    },
    {
        "title": "佛教的乘是什么意思？大乘与小乘的区别是什么？",
        "key": "200132",
        "describe": "佛陀所说的法非常多，从对众生根机来讲，有大乘教法跟小乘教法。“乘”就是交通工具，交通工具有运载的作用，能把人从此地运载到彼地，所以叫做乘。这个用来比喻佛...[阅读全文]"
    },
    {
        "title": "什么叫精进？精进的重要性与对治懈怠",
        "key": "200126",
        "describe": "精是不杂不乱，进是不退不停。精是专一专注，进是向前向上。简言之，毫不动摇，毫不松懈，一往无前。我的恩师茗山上人常说，六度中的五度，都要靠精进才能成就。做...[阅读全文]"
    },
    {
        "title": "佛的三德是哪三德？",
        "key": "200089",
        "describe": "智德，智就是智慧的智。我们无始以来都生活在迷惑之中，我们每一个人都是有烦恼的，那么佛，从他的德行上来说，他可以破除一切的迷惑，破除一切的无知，而证得无上...[阅读全文]"
    },
    {
        "title": "食存五观指的是什么？",
        "key": "200101",
        "describe": "食存五观，指出家人在用斋的时候，要作五种观想。简单来说就是：一、要想到这一钵饭菜来之不易，施主省吃俭用为求福来供养，所以应该珍惜。二、思惟自己的德行是全...[阅读全文]"
    },
    {
        "title": "佛教的四生是什么意思？是哪四生？",
        "key": "200056",
        "describe": "「四生」是指有情出生的方式，可分为胎、卵、湿、化等四类。胎生即是由怀胎而生育的。经典上记载人类虽以胎生为主，但是也有其他出生的方式。其他四只脚的高等畜生...[阅读全文]"
    },
    {
        "title": "如何亲近善知识？弟子相和善知识相是什么？",
        "key": "200084",
        "describe": "弟子问：请问师父：如何亲近善知识？弟子相是什么？善知识相又是什么？感恩顶礼师父！一如法师解答：这是个大问题啊，这个问题如果要详细的回答可能都要二个多小时...[阅读全文]"
    },
    {
        "title": "盂兰盆节是什么节日？是中元节吗？",
        "key": "200075",
        "describe": "中元节在中国已有上千年的历史了，最早是为了在秋天庆祝丰收，后来则以祭祀为主。每年农历七月十五的中元节，又被民间称作“鬼节”，家家户户都要祭祀祖灵以表敬诚...[阅读全文]"
    },
    {
        "title": "农历七月十三，走近大势至菩萨，恭迎菩萨圣诞",
        "key": "200066",
        "describe": "大势至菩萨与观世音菩萨、阿弥陀佛合称“西方三圣”。据《悲华经》记载，往昔阿弥陀佛做转轮王时，观世音菩萨为第一王子，大势至菩萨为第二王子，二人相继发愿成就...[阅读全文]"
    },
    {
        "title": "阿弥陀佛的誓愿与众生的执着有何区别？",
        "key": "200065",
        "describe": "“愿”也有目标的意思，但是当我们对于一种目标过于坚持，甚至忘记了成就目标过程中的底线与责任，就成了执著。“愿力”，其实就是因为目标就会产生一种力量，这种...[阅读全文]"
    },
    {
        "title": "什么情况不能礼佛？礼佛有什么功德？",
        "key": "199965",
        "describe": "律制有染不能礼佛。染有两种：一是不净染，就是上厕所后未净手；二是饮食染，就是吃饭后没有漱口。《业报差别经》上谈到礼佛有十种功德，兼顾今生后世，最极殊胜。...[阅读全文]"
    },
    {
        "title": "受戒居士怎么处理蚊虫侵扰？误杀昆虫是否犯杀戒？",
        "key": "199751",
        "describe": "三伏天来临，蚊虫也变得愈发气势汹汹，不少人早已开启蚊虫大作战模式，和蚊虫斗智斗勇。不知道佛弟子们对此有无困惑：受了五戒或者受持了杀戒的居士，误杀昆虫是否...[阅读全文]"
    },
    {
        "title": "出家有年龄限制吗？儿童可以出家吗？",
        "key": "199960",
        "describe": "佛教里，有七岁到二十岁做沙弥的，不出家也可以回去，这是允许的。沙弥必须受「沙弥十戒」，得守持不杀生戒、不偷盗戒、不淫戒、不妄语戒、不饮酒戒、不涂饰香鬘戒...[阅读全文]"
    },
    {
        "title": "三点习以为常的认识可能对佛教存在着误解",
        "key": "200049",
        "describe": "在日常生活中，相信许多人都会对佛教有或多或少的认识，其中有从影视剧中了解到的，也有在人们口口相传的言语中得到的，还有从礼佛拜佛的仪式中增加到的……但这些...[阅读全文]"
    },
    {
        "title": "佛教中“送单”是什么意思？",
        "key": "199810",
        "describe": "送单，也称「进单」，就是挂单后，安排住进上客堂、云水寮之意，即安排僧众住宿。因为，寮区的位置还不认识，不能乱跑，必须有专人送单。依照丛林挂单程序，必须先...[阅读全文]"
    },
    {
        "title": "佛教的四缘是哪四缘？是什么意思？",
        "key": "200059",
        "describe": "四缘是因缘、等无间缘、所缘缘和增上缘。因和缘的差别，大体上说，因是形成结果的主要原因（不可或缺的），缘是促成结果的辅助条件或次要原因（不具决定性）。很多...[阅读全文]"
    },
    {
        "title": "关于“上座、中座、下座”这些称呼的由来！",
        "key": "200058",
        "describe": "不过从修学的要求来讲，我觉得以二十九年以上，受戒二十九年称为上座，这个说法要求比较高，要求比较到位，如果二十岁受戒到五十岁的时候就是上座了，或者到四十一岁以...[阅读全文]"
    },
    {
        "title": "什么叫器世间和有情世间？",
        "key": "200055",
        "describe": "「世间」的梵文loka，英文有world和ordinarylife等双重意思。从loka的字义可以看出，佛教所说的「世间」含义包括了物质世界和生命。生命所居住的物质世界，佛教称为...[阅读全文]"
    },
    {
        "title": "什么是三十二相、八十随形好、千福庄严？",
        "key": "200053",
        "describe": "“三十二相”是古印度统一四大部洲的转轮圣王所具足的庄严之相，是此世间最圆满的相貌，故称“第一福德之相”。从足底平安相、千辐轮相，到眉间白毫相、无见顶相，...[阅读全文]"
    },
    {
        "title": "地藏菩萨为什么不成佛？",
        "key": "200045",
        "describe": "地藏菩萨发愿誓不成佛并不是他不能成佛。我们学习地藏菩萨精神，除了关注他誓不成佛之愿以外，还要注意他的愿前提有「地狱未空」这一条。一般修行人，发愿出三界离...[阅读全文]"
    },
    {
        "title": "三宝是什么？为什么要皈依？有什么好处？",
        "key": "199948",
        "describe": "佛、法、僧，为佛教三宝。十方三世一切诸佛，是佛宝。佛所说的教法，是法宝。弘扬佛法的出家人，是僧宝。为什么称为宝？一者难遇。二者无价。所以非常珍贵。为什么...[阅读全文]"
    },
    {
        "title": "佛教反对哪五种邪命及哪三种供养？",
        "key": "199957",
        "describe": "第一种乍现奇特，第二种自赞功德，第三种占相吉凶，第四种高声示威，第五种称得供养。邪命，将来就会堕落。这五种邪命是什么意思呢？（一）乍现奇特。乍现奇特不就...[阅读全文]"
    },
    {
        "title": "八戒是什么？跟五戒有什么区别？",
        "key": "199969",
        "describe": "八戒是五戒的扩充，也是为在家信徒制定的基本行为准则。在五戒基础上，再加上不眠坐高广华丽大床、不装饰打扮和歌舞观听，不非时而食三项，即构成了八戒。八戒中后...[阅读全文]"
    },
    {
        "title": "可以带宠物去寺庙挂单吗？",
        "key": "199970",
        "describe": "一般来说，是没有人带宠物到寺院挂单的，除非是大菩萨，有神通行化。比方，文殊菩萨坐狮子，普贤菩萨坐大象，观音菩萨骑鳌鱼，地藏菩萨带著坐骑──四不像，又叫善...[阅读全文]"
    },
    {
        "title": "药王菩萨以良药救治众生身心两种病苦",
        "key": "199940",
        "describe": "《圆觉经》云：“四大各离，今者妄身当在何处？即知此身毕竟无体，和合为相，实同幻化。四缘假合，妄有六根。”众生由于造作种种恶业，感得四大假合生死之身，枉受...[阅读全文]"
    },
    {
        "title": "沉香与佛教的渊源",
        "key": "199868",
        "describe": "在我国，沉香与宗教有着紧密的联系，在佛教中，沉香的地位很高，佛教用其供奉礼佛。沉香是“浴佛”的主要香料之一，沉香木雕刻的念珠、佛像等是珍贵的佛具，沉香制...[阅读全文]"
    },
    {
        "title": "三聚净戒指的是哪三戒？",
        "key": "200020",
        "describe": "戒有五戒、八戒、十戒、具足戒、菩萨戒等多种。归纳起来，又可分为三种类型，总称为三聚净戒。①摄律仪戒：遵守佛制一切戒律，行、住、坐、卧，严守律仪，从身体、...[阅读全文]"
    },
    {
        "title": "什么是五逆重罪？是指哪五个？",
        "key": "200023",
        "describe": "五逆罪是佛教所有恶业中最重的。“逆”就是罪大恶极，极逆于常理的意思。造作五逆罪为堕无间地狱的业因，命终将堕无间地狱，因此又称“五无间业”或“五不救罪”。...[阅读全文]"
    },
    {
        "title": "什么是义工？真正的义工",
        "key": "200008",
        "describe": "义工，就是义务工作者。他具有两大特点：第一，不拿报酬。第二，服务社会。在社会上，许多慈善机构都有招募义工团队。平时大部份义工都在自己家里，当遇到有需要的...[阅读全文]"
    }
]