[{
    "title": "第一章 贤护童真请法因缘 第一节 贤护童真到佛讲堂",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  贤护童真请法因缘</strong></p><p><strong>第一节  贤护童真到佛讲堂</strong></p><p>原文：<strong>如是我闻。一时薄伽梵。在王舍城。迦兰陀竹林，与大比丘众。千二百五十人俱。皆阿罗汉。</strong></p><p>释：如是我闻四个字，表明了这部经是阿难复述佛当时讲法的内容，不是阿难自己讲的。薄伽梵是指释迦牟尼佛，王舍城迦兰陀竹林是佛常住的用来讲法的一个精舍。大比丘都是佛的常随众，有一千二百五十人，另外还有五个人，这一千二百五十五人经常随佛各处闻法，护持佛的法藏。为首的几个大比丘，各自带领着自己的弟子众，跟随世尊闻法修行。大迦叶带领五百弟子，舍利弗等人也各自带领着一部分弟子，他们合起来共有一千二百五十五人，都是大比丘、大阿罗汉，已经证得四果，心得解脱，智慧也得解脱了。</p><p>但不包括阿难，阿难还是初果，其余所有人都是四果。阿难为了作佛的侍者，他只能当初果人，不能证四果罗汉，因为佛不用四果罗汉作侍者，所以阿难故意不证四果，只保持初果人的身份。佛涅槃后，在大迦叶带领比丘们集结经典的时候，大迦叶为了迫使阿难证四果，把他赶出结集经典的石窟，说初果人不能参加结集经典。</p><p>阿难出去后就开始精进用功，有一天在准备睡觉时，头刚好要碰到枕头还没有碰到的时候，他就证了四果，并且还有了神通。然后他就去敲石窟门，大迦叶问他是否证果，阿难说证得四果了，大迦叶说那你从钥匙孔里进来吧，于是阿难就从钥匙孔里进来了，之后就以阿难为首，开始集结经典，复述当时佛讲过的所有大小乘经典。</p><p>阿难还没有出家之前世尊所讲的经，阿难要如何复述呢？这部分内容，在阿难当了世尊的侍者后，世尊就单独讲给他听，世尊讲一遍阿难就能记住，阿难没有在场时所讲的经，世尊都要再给阿难单独复述一遍，目的是阿难记住，以后好集结经典。阿难有这样惊人的记忆力，能过耳不忘，就像录音机一样，这是他无量劫前与佛一起修行所获得的殊胜功德。</p><p>原文：<strong>诸漏已尽。无复烦恼。逮得自在。心善解脱。慧善解脱。</strong></p><p>释：这些大阿罗汉们所有的烦恼都断尽了，再也没有任何烦恼了，已经得自在了，心善得解脱了，智慧也善得解脱了。</p><p>漏指的是贪嗔痴烦恼，尽是断尽，贪嗔痴烦恼都断尽了，叫作漏尽。初果向断除欲界五品烦恼，二果向断除欲界六七品烦恼，修出初禅定以后，开始断除根本烦恼贪欲和嗔恚，证得三果，烦恼断尽证得四果。初禅定发起以后先断贪欲烦恼，后断嗔恚烦恼，再加初果的三缚结的断除，这就断除了五下分结，到四果的时候再断除五上分结，这时凡夫异生的我慢、对三界的贪爱、愚痴等等烦恼漏都断尽了，即意根对自我的执著性断尽了。</p><p>所有的贪嗔痴慢疑恶见这些见思惑都已经断尽，对三界法一点贪爱也没有了就是漏尽。如果还有烦恼就是漏，有漏就不能出三界，仍然要在三界里受苦。比如说三果人还有我慢、我执烦恼没有断尽，他就不能直接出三界，可能要在中阴身里再作观行，断尽烦恼以后才能出三界。有的三果人命终升天以后，在天上再断除剩余的烦恼，之后才能出三界。</p><p>烦恼就像绳索一样，能把自己束缚在三界六道里不能出离生死，因此每个众生必须在了断烦恼以后才能出三界。只有证了四果阿罗汉，具有世间了尽的智慧，才能断尽三界世间一切法。也就是说阿罗汉们都知道，命终如何把自己的五阴灭尽，才能出离世间，这是阿罗汉的解脱智慧，具足出离生死得解脱的智慧，叫作慧解脱。</p><p>七识心断除了烦恼才能获得自在，没有了烦恼的束缚，对于世间一切法，心无挂碍，心得解脱，不受三界世间的拘碍，来去自由。当然，阿罗汉对于大乘法还是不自在的，因为他没有证得大乘法，不能随心所欲的住于大乘法中得解脱。但在五阴世间的世俗生活当中，心是自在无挂碍的，对三界的贪爱结缚全部都断尽，不被任何六尘境界所束缚，心已经得到了解脱，智慧也已经得到了解脱，具足了出离世间的智慧。</p><p>阿罗汉分为慧解脱和俱解脱两种，慧解脱的阿罗汉只修出了初禅定，还没有修出四禅八定，没有五神通，不能随时随地以禅定力脱离三界世间入无余涅槃，但命终时能以智慧脱离生死，入无余涅槃。在命终时，由于烦恼断尽，不执于三界，无欲无求，意根灭尽，五阴身灭尽，就得解脱了。有解脱生死的智慧，五蕴身心不被世俗法所系缚，这叫心善解脱、慧善解脱。</p><p>原文：<strong>于去来今。照了无碍。是大那伽。如佛之教。所作已办。</strong></p><p>释：这些阿罗汉们对于过去、现在、未来的三世法，都明了通达无碍，这是俱解脱阿罗汉所具有的神通道力。对于四圣谛的观行，佛在《杂阿含经》中讲过，观行五阴的虚妄，还要观行过去世的色身和识心的虚妄无我，观行未来世的色身和识心的虚妄无我，观行现在世的色身和识心也都是虚妄无我的。观行过去、未来、现在的五阴，无论好的五阴、不好的五阴、粗的五阴、细的五阴，全都不是我，这就是于去来今照了无碍的意思。</p><p>慧解脱的阿罗汉也能如此观行，也证得了过去、现在、未来世的色身和识心都不是我，于去来今照了无碍。阿罗汉不仅证得了现在的我是虚妄无我的，也证得了未来世的我是虚妄无我的，因此他们不欣乐于未来世的色身五蕴，才能够灭了意根对自我的贪爱执著，命终才能灭尽五蕴，出离三界。如果对未来有一念的喜心，就是生死系缚，不能出离三界。要想出离三界，连这一念的喜乐心都不能有，对未来世一点希求都没有，才能照了无碍，从而达到心善解脱、慧善解脱。</p><p>那伽梵指龙族，这些阿罗汉就像大龙一样有力量，如实奉行佛之教导，一生求解脱就得解脱，弃舍了生死的沉重担子，从此得解脱休息身心了。四果阿罗汉常常说：我生已尽，梵行已立，所作已作，自知不受后有。阿罗汉所要作的就是断尽贪嗔痴烦恼，能够出离三界得解脱，这是他们一生所要作的事情。所作已办就是该作的事全部都作完了，三果人还不能这么说，只有四果罗汉才可以这么说。因为三果人还有烦恼没有断尽，我执我慢还存在一些，这就是生死系缚，四果阿罗汉所有的贪嗔痴烦恼都断尽，诸漏已尽，才能说所作已作，不受后有。</p><p>原文：<strong>弃大重担。获于己利。已断流转。生死有苦。</strong></p><p>释：放弃了五蕴身心这个重大的负担，获得了个人得解脱的功德利益，已经断除了三界六道生死流转之苦。</p><p>众生五阴十八界就是生死轮回中最大的重担，五欲六尘、生死有苦就是最大的重担。阿罗汉能够弃大重担，心无烦恼，三界的负担都卸下了，也不用管众生苦不苦，卸下所有的包袱和担子冲出三界。获于己利，自己终于得到利益，能了生死苦，得解脱了。阿罗汉们只要自己能出离三界，不再受生死轮回之苦，其他的就不管了，这就是自了汉的心行。学佛的人如果都是这样的心态，佛法就不能延续下去，终将会灭去，无人宣传佛法，无人教导，后世的众生也就不能获得佛法中的什么利益，常处黑暗深渊中，生死苦恼不能解脱。</p><p>所以说小乘声闻法不是究竟的法，只能修学一段时间，修学大乘佛法的菩萨，小乘佛法虽然不可避免一定要修证，但不能走涅槃这条路，自己成就以后还要利他，这就是菩萨的发心。菩萨心量广大，不但要度自己，还要度和自己一样受轮回之苦的所有众生，使他们同样都获得究竟的解脱，那就是大心菩萨的所为，所以菩萨也叫大心众生。</p><p>阿罗汉们已经截断了流转在三界的生死有之苦，有包括欲界有、色界有、无色界有的五蕴四蕴世间，即欲界有欲界的世间法，色界有色界的世间法，无色界有无色界的世间法，这三界的世间法都是苦。不但三恶道是苦，人道也是苦，天人和阿修罗也同样有苦，在乐受当中也有苦，而且这个所谓的乐本身就是一种苦，乐过后还是苦。佛说的苦，有苦苦、行苦、坏苦三种。天人虽没有苦苦，但是还有行苦和坏苦，因为他们的那种乐不是永久的，是留不住的，早晚会消失，这种苦叫行苦。乐的感受消失了，就叫坏苦。</p><p>尤其是临命终时，天人会有五衰相现，身体臭秽、花冠萎谢、衣落尘埃、两腋出汗、不喜宝座。天人的身体变得臭秽难闻时，没有哪个天人愿意去接近他，都躲避远离他。这个快要死的天人就坐不住宝座了，头上的花冠也枯萎了，原来衣服都是干干净净，永远不落灰尘，现在衣服就有灰尘了，两个腋窝也出现汗臭了，有这些现象出现时就表明天人的生命快要结束了，他要受苦去了，这叫天人的五衰相现。这三界当中的生死有苦，阿罗汉都已经断尽了，未来不再来三界受生死有苦。</p><p>原文：<strong>以正智力。善知众生。心之所趣。如是大声闻众。长老舍利弗。而为上首。复有无量。菩萨摩诃萨众。俱在会集。</strong></p><p>释：阿罗汉以正真的智慧力量，善于了知众生心之趣向。像这样的大声闻众，以长老舍利弗作为上首，还有无量的菩萨摩诃萨众，都在法会当中聚集在一起。</p><p>阿罗汉修行苦、集、灭、道四圣谛，获得解脱智慧，具足一切智，以此智慧，能善于观察众生的心到底趣向于哪里，见众生所贪所喜乐的法，就能知道众生命终会趣向于六道哪一道，也能知道众生是否能获得解脱，入无余涅槃。大多数众生的心都在贪着三界世间法，未来不可能摆脱世间法，都要受于五欲六尘的束缚，趣于六道轮回，趣于色声香味触法六尘，趣于三界世间，不出生死轮回。</p><p>长老是对阿罗汉的尊称，已经证了四果阿罗汉的人叫作大声闻众，长老舍利弗在他们当中是智慧第一，所以舍利弗居于声闻众的首位。在这大会之中，声闻众以舍利弗为首，无数菩萨摩诃萨在大会中列在大声闻众的后边，表示菩萨摩诃萨有很多是在家众。佛在世的时候以出家众为首，所以先表出家众，再表在家众。声闻众弟子和菩萨众弟子都聚集在世尊讲法的法会上，听从世尊教诲。</p><p>原文：<strong>尔时。诸比丘。在世尊所。多有疲睡。失容阿委。不能自持。于是世尊。面门晖发。如莲花开。时诸比丘。咸悉醒悟。各自严正。作如是念。今佛世尊。颜容晖焕。面光照朗。欲开何法眼。作大饶益。</strong></p><p>释：这时，比丘弟子们在世尊讲堂中，大多数都有些疲倦，有些睡意朦胧，颜容萎靡，即将把持不住，快要睡着了。佛在上面讲法，下面的比丘有些已经疲倦，要睡了，形态不端庄，有打哈欠的，有打瞌睡的，身体就不能保持端正了。世尊看到这种情况，为了让这些比丘们清醒清醒，于是就显现神通。</p><p>面门晖发的意思是说面部就像莲花开放一样光辉灿烂。这时比丘们一看佛显神通放光彩，全都没有了睡意，精神充足，各自端正身体坐姿，心想：佛现在开始显现神通，面色光丽，光明朗照，将要开讲什么样的大法，对众生作大饶益呢？</p><p>原文：<strong>尔时。贤护胜上童真。修容丰美。柔和光泽。色相具足。六万商主。前后围绕。侍从轰郁。声如地震。来诣佛所。</strong></p><p>释：这时候，有一个在家人名字叫贤护胜上童真，（童真的意思是说他还是一个童子身，胜上表示这个人比较殊特，或者在福德方面，或者在智慧方面超越其他的人。）他的外表修容丰美, 柔和光泽, 色相具足美好，这里是在暗示贤护菩萨前世修的福德很大，才感得如此庄严的色相。有六万商主们前后围绕着他，伺候他的侍从人数众多，众人走在一起发出的声音像地震一样，说明贤护菩萨的福德是多么的广大深厚，这时众人一起簇拥着贤护菩萨来到佛讲法的讲堂。</p><p>原文：<strong>见佛世尊。寂静安隐。众德之藏。巍巍赫朗。如大金树。深心信重。合掌思惟。作如是念。众共称赞。佛一切智。普见一切。是如来阿罗诃。正等觉。诚实不虚。顶礼佛足。谛视而住。</strong></p><p>释：贤护菩萨看见世尊端坐在本座上，显得寂静而安稳，在佛的五蕴身上，在言谈举止和神态祥和的面容里，都隐藏着佛陀的大威德行，处处都显示着佛是众德之藏。佛的三十二相，巍巍堂堂，威严慈蔼，赫奕明朗，如一棵高大的金树。贤护胜上童真见佛如此相好庄严，对佛发起了深深的敬仰信服之心，于是合掌思惟，生出这样的念想：所有众生都共同称赞佛的大功德，佛陀的一切种智普遍能见一切法，世尊确实是如来阿罗诃正等觉，真实不虚。于是就顶礼佛足，在旁边一心观瞻世尊的尊容。</p><p>贤护菩萨赞叹世尊具足了佛的十个名号功德，佛的十个名号是：如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、世尊。一切智按小乘来说，代表佛能解脱三界世间生死轮回的智慧，而佛的大乘法的一切种智，代表着佛陀证得了世出世间一切法，无一法不知无一法不晓。佛的无垢识里面含藏的所有种子的功能作用，佛陀全部证得无余，叫作一切种智。</p></div>"
},{
    "title": "第二节 贤护童真受佛加持请法",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第一章  贤护童真请法因缘</strong></p><p><strong>第二节  贤护童真受佛加持请法</strong></p><p>原文：<strong>佛见贤护。举身放光。流照贤护。贤护尔时。便获无畏。绕佛三匝。顶礼佛足。而白佛言。</strong></p><p>释：佛看到贤护菩萨后，全身放光，照耀在贤护身上。在佛举身放光流照贤护以后，贤护菩萨就对佛法生起了净信，他心里面非常希望听佛宣讲妙法。贤护得到佛的加持以后右绕佛三匝, 表示对佛的恭敬尊重，然后顶礼佛足，就开始向世尊提问请法。</p><p>佛放光是有目的的，这是鼓励贤护向佛请法，让贤护心无畏惧，就能在佛前提问请法。因为他提出问题以后，佛以此因缘，就可以开示演讲一场殊胜的大法。佛有时候想讲某种法，又没有人请法，无因无缘的时候佛一般无法主动讲法，于是世尊就故意提示某个人，让他心生疑问，进而请法提出问题，佛就根据他所提出的问题，来宣讲一部佛法。</p><p>众生对佛的信心，有的是不清净的，有的是清净的。初学佛法的人，对佛的信是不清净的，是怎么样的不清净呢？他是迷信佛，有求于佛，对于佛的功德还不了解，对于佛的神力大智慧，所有的德行，都不了解，所以不能够生起清净信心，心里面还有很多的疑问，所以不叫作净信。</p><p>原文：<strong>唯愿世尊。悲愍教授。我今始于佛所。得净信心。心悕妙法。欲有所问。而我久处生死。溺烦恼苦。乱念纷杂。于戒等业。无作冥资。虽心奇重。我今不知。于此愚惑。疑网之中。如何超出。得度生死。</strong></p><p>释：贤护对世尊说：希望世尊能够悲悯我、教授我，我现在刚刚在世尊您这里获得了清净的信心，心里非常希望听闻胜妙之法，正有问题要请问于世尊。我无量劫以来久处生死，沉溺在贪嗔痴烦恼苦中，心里杂念妄想纷呈，无心修持戒律，没有储备资粮和道粮。虽然内心非常想出离生死，但我现在并不知道，自己处于这样愚痴疑惑之网中，如何才能超脱出去，度越生死苦海。</p><p>贤护菩萨忏悔了自己于修行心生放逸，于戒定慧等没有修持的懈怠之心行，可是却得到了佛菩萨的暗暗加持。他对自己的业行和贪嗔痴烦恼了解一部分，但是还没有完全了解，现在他的心还处于愚痴当中，没有获得真正的智慧解脱，还有很多的疑虑。他想把自己的疑问都解除，让自己断除愚痴，解除疑惑。他问佛如何才能超出烦恼的深渊和生死轮转，出离生死的苦海。其实他的疑问代表了所有初学佛法的众生的疑问：如何能够得度生死，超出生死轮回的苦海，得到解脱。如果把这个问题解决了，学佛才能得到真正的大利益。</p><p>原文：<strong>世尊是一切智。普见一切。佛出甚难。希有逢遇。如如意珠。施众生乐。佛是大如意宝。一切众生。咸由依佛。得大安乐。是大父母。众生善本。因佛父母。得见正路。唯愿悲愍。开晓疑闇。</strong></p><p>释：贤护菩萨接着赞佛说：世尊是一切智人，能够普见一切法，也能了知每个众生的根器和烦恼根源，无量劫以来，众生造作了什么样的业行，将来获得什么样的果报，这一切世尊都能了知。佛出现在这个世间真是太稀有难得，太难值遇了。佛就像如意宝珠一样，施予众生一切快乐，佛是大如意宝，所有众生都能依赖着佛而得到大安乐，佛是众生的最亲最敬爱的父母，能带给众生最根本的利益，是众生善法之本，众生依靠佛这样的父母而得见正路，走上正道，最终得解脱，惟愿世尊您悲悯我们，解开我们心中的疑惑和暗冥。</p><p>佛出世确实是非常稀有难遇的，佛在经中告诉过我们，在娑婆世界多长时间才有一尊佛出世，在贤劫中有一千尊佛出世，释迦佛是第四尊，第五尊佛是弥勒佛，释迦佛出世和弥勒佛出世之间相差多少时间，佛经记载是56亿7千万年，这两尊佛出现的时间差算是最短的，很多时候是多少个大劫之内都没有一尊佛出世，甚至有时候在几十大劫内都没有一尊佛出世。</p><p>几十大劫是多长时间呢？地球成住坏空一个周期，等于是一个大劫，一个大劫里有四个中劫，一个中劫里有二十个小劫，一千六百八十万年（一个小劫）再乘以四再乘以二十，才是一个大劫。几十大劫内都没有一尊佛出世，那么在这个世间上生存的众生应该有多么苦恼，生死无人解救，轮回无有出期。这么长的时间都没有佛出世，那么佛出现在这个世间真是太稀有，太难值遇了。</p><p>众生依佛得大安乐, 佛是大父母，从实际理地来说，一切众生依着五蕴身内的如来佛，才能得到大安乐，如来藏是出生五蕴的父母，是带给众生一切法的父母。五蕴身内的佛能把三藏十二部，把成佛之法、把解脱之法带给众生，众生依照着修学，就能得到大安乐。一切众生，咸依自己的如来藏，才能得到大乐。如来藏也是众生的父母，带给众生所需的一切法。如来藏是众生的善本，有如来藏众生才能修行善法，众生因佛这个父母，得见修行的正路，上了正路就有希望得解脱。只愿世尊能够悲愍我们，开演成佛之法，灭除我们内心的黑暗，去除无明疑惑。</p><p>原文：<strong>佛告贤护。汝有所疑。恣汝意问。我当为汝。分别解说。尔时贤护。蒙佛听许。心专请问。在一面住。</strong></p><p>释：佛告诉贤护：你有什么疑问允许你随意问，你问什么我都一一回答。其实佛已经知道贤护要问什么，所以才这样说。贤护知道佛允许他提问，就站在佛的侧边，一心想要提问题了。</p></div>"
},{
    "title": "第三节 贤护童真现世福果",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第一章  贤护童真请法因缘</strong></p><p><strong>第三节  贤护童真现世福果</strong></p><p>原文：<strong>时长老阿难。见贤护童真。姿容晖泽。色相具足。白佛言。世尊。未曾有也。此贤护童真。有大福德。光色丰盛。诸王威相。咸蔽不现。</strong></p><p>释：这时长老阿难看见贤护童真，他的外貌庄严、端庄和美妙，容光焕发，就对佛说：世尊，从来没有遇到过这样一个人，这位贤护童真有大福德，全身上下都放着光芒，庄严无比，所有国王的威德相，在他面前都隐蔽显现不出来了。</p><p>从他的待从和他的六万商主上来看，能看得出他的福德相当的广大。他一出现，所有的国王都显得没有威严了，那些国王虽然也具备大福德，但是跟贤护童真一比，他们的威德相就都被隐蔽不现，显现不出来了，只看见贤护外貌光色丰盛。这一段回过头来介绍贤护菩萨，前世的时候是如何修行福德的，以至于这一世获得了如此大的福德果报。</p><p>原文：<strong>佛告阿难。此贤护胜上童真。福业所致。虽处人间。受天胜果。安宁适乐。欢娱嬉戏。畅悦恣心。犹如帝释。阎浮提中。唯除月实童真。更无比者。阿难白佛言。贤护童真。果报资用。宿植善根。唯愿为说。</strong></p><p>释：佛对阿难说：这是贤护童真过去所修的大福德所感召的，他虽然在人间，得为人身，但是他所享受的果报，全部是天人应该享受的果报，安宁、舒适、快乐、安逸、欢逸、嬉戏、畅悦恣心，犹如欲界第二层天的天主帝释（玉皇大帝）一样，他的果报足以与释提桓因相媲美。在阎浮提（南瞻部洲）之中, 具有大福德的人中，月实童真排在第一, 他排在第二，除了月实童真再也没有超过他的了。阿难对佛说：贤护童真多生多世培植善根福德的事，果报资用丰盛的事，请世尊为我们解说解说吧。</p><p>原文：<strong>佛告阿难。贤护现受乐报。资用广大。及宿胜因。汝今当听。阿难。此贤护童真。六万商主。资产丰饶。金宝盈积。恭敬受教。随逐奉事。六万床座。敷设卧具。毡褥缯绮。并倚枕等。杂色晖发。妙丽庄严。俱罗帷幕。及憍奢耶。火浣币帛。支那安输。周匝施布。众宝雕间。相宣焕烂。交错如画。</strong></p><p>释：佛告阿难说：贤护现在所受的乐报，一切资生用具广大丰厚，他的待从众多广大，走起路来像地震一样，他生生世世所修得的福德，获得果报的因缘，以及他宿世以来所培植的善根因缘，你们现在聆听，我这就对你们说。</p><p>阿难，这位贤护童真，有六万商主围绕，这些商主们的资产丰饶，金银珠宝盈积库房，却对贤护童真非常恭敬，愿意受他指教，并且追随于他奉事于他。贤护童真的家宅中，有六万张床座，都铺设了卧具，毛毡被褥及倚枕等等，色彩鲜艳，美妙庄严，窗户用的是俱罗帷幕，穿的衣服是蝉衣绢衣，还有用于馈赠的不怕火烧的石棉织物，以及印度的安输，这些贵重物品层层叠叠非常多，有众多的宝物雕饰在其间，互相渲染灿烂，交织在一起美如画。</p><p>这一段都是介绍他的房间卧具，描述卧房里的装饰品，房间的富丽堂皇，装饰非常豪华富贵，衬托出贤护童真的福德非常广大。</p><p>原文：<strong>六万妓女。被服安输。众色间杂。金宝璎饰。鲜华炫丽。光彩耀目。其触细软。如天迦遮。轻重随心。适称情意。戏容笑语。歌唱相娱。闲婉严洁。柔敬事主。于他人所。心绝爱欲。惭耻低首。或覆头为容。肌肤平满。柔软细滑。手足支节。踝等骨脉。咸悉不现。齿白齐密。发绀右旋。如削蜡成。如工画作。氏族华望。名誉流远。如是妇人。而为侍从。</strong></p><p>释：还有六万个待女，穿着非常鲜艳华丽的衣服，色彩间杂，用金色的宝物装饰着，光彩耀眼。衣服用手摸触，感觉非常细软，就像天衣一样，或轻或重随心而变，称心如意。她们在一起欢声笑语，载歌载舞互相娱，外貌又都亮丽端庄，闲静婉约严谨洁净，举手投足庄重而适人意，心意柔软，专心侍奉主人。</p><p>而对于其他人则没有任何爱欲之心，经常是低头惭愧知耻，或者遮盖头部，遮挡容颜。她们肌肉丰满平滑，手足支节等骨脉不露，牙齿洁白齐密，头发绀青色向右旋绕，像用腊削成的一样，又像画师的画作一样。她们的家族名声都很广大，名声显赫。像这样外表美丽的女人，都是贤护的待从。</p><p>原文：<strong>又有六万。供食妇人。饭饼诸物。种种异色。香味调美。如天肴膳。饮具八德。见令心悦。宁身适意。不劳而熟。是福之食。应心而至。涤净拥秽。去诸病恶。</strong></p><p>释：又有六万供养贤护饮食的妇女，米饭面饼所有饮食色香味俱全，就像天人的饮食一样，吃饭的用具也都很殊胜，具有八种功德，让人一见，心生欢喜，身体安宁。饮食放入这些餐具里，不用人动手劳作，都是自然而熟。这是福德之食，随心而现。还能自动洗净饮食里的污秽，祛除疾病，这是欲界的化乐天和他化自在天的享受。</p><p>这些天人每天的饮食，都是心里一想，百味饮食自动就到面前来，这是天人修来的福德，贤护童真在人间就享受着这些福报。他是作为一个人，而享受着天人的福报，享受着释提桓因天主的殊胜果报。</p><p>原文：<strong>庭宇台楼。具足六万。摩尼真珠。琉璃诸珍。罗布垂饰。众宝间钿。行列端美。绮彩蒙悬。缀以铃铎。随风飖飏。铿锵和发。</strong></p><p>释：他的楼台庭院，用了六万种珍贵的珠宝装饰而成，如摩尼、珍珠、琉璃等。庭院台阁众宝间杂，装饰精美，配上宝铃，和风悦耳。地如琉璃托显影像，庭院里各种花瓣散布在琉璃地上，让人感觉非常清凉快乐，心情舒适愉快。又有种种乐器，发出种种的音声，总共有六万种美妙的音声，声音柔润响亮，能传播到很远很远的地方，声震家族所辖区域。</p><p>声调优美柔润响亮，能传播到很远很远的地方，这些声音起伏、间杂、喧嚣，震撼周围十方的区域。这都是因为贤护童真前世所修的深厚的福业所感召的，以至今世欢乐、富贵绵延不绝。</p><p>原文：<strong>地若琉璃。现众影像。杂花散布。清凉快乐。遨游栖息。畅心适志。又有细腰。般拏箜篌。长笛铜钹清歌。种种音声。数凡六万。美声调润。响亮闻远。喧嚣杂作。震警方域。福业所致。欢乐不绝。</strong></p><p>释：地如琉璃般清润明亮，映现出众多影像，庭院里散布着各种宝花，在其间行走，使人感到身心清凉，心境舒畅而愉快。又有数不清的身材曼妙、姿色秀丽端庄的女子弹奏演绎着箜篌、长笛等种种乐器，并以歌声和之，种种美妙的音声和在一起总共有六万余种。</p><p>原文：<strong>鸽等诸鸟。飞翔游集。异声间和。畅心悦耳。藤蔓众花。萦缘台阁。鲜葩标秀。蓊郁晖焕。铃铎乐器。响若天宫。</strong></p><p>释：鸽子等诸多鸟类飞翔遨游云集其中，各种不同音声间杂和雅，让人感觉心境舒畅、妙音悦耳。各种花草藤蔓环绕着台阁，争芳斗艳，蓊郁茂盛，焕发清辉，宝玲乐器的音声不绝于耳，犹如天宫里的妙音一样。</p><p>整个家族都是因为修了深厚的福业所感召的，以至于欢乐不绝。大福德之人，鸟类众生都围绕着他们飞翔遨游，各种鸟叫声和畅悦耳，各种花草藤蔓环绕着台阁，争芳斗艳，蓊郁晖焕，乐器的音声犹如天宫里的美音一样。</p><p>原文：<strong>房廊昭晰。如须弥窟。神药流照。有六万城。高墙峻峙。楼橹备设。街街布列。四衢三达。美丽填溢。诸方凑集。</strong></p><p>释：贤护童真所居住的宫殿内外，房屋檐廊都以七宝玉石用作装饰点缀，看起来光彩夺目，金碧辉煌，还有六万个城市，各种各样的宝物置于其中，犹如转轮圣王的宝窟一样，其中不乏装有各种神药的宝瓶，流光溢彩，充盈其间。城墙高俊耸立，配备设立着瞭望和攻守的高台，每条街都如此布列守卫着，四通八达，洋溢着美丽的样貌，各个方位的楼宇都像这样华贵，各方宝物凑集在一起。</p><p>原文：<strong>种种服饰。种种言语。法制万差。殊容异状。奇货列肆。商侣百千。交易嚣喧。声震城域。</strong></p><p>释：四衢街道上的人穿着种种华美的服饰，交谈时操持着种种各地的方言，商铺中的商品种类千差万别，包装精美，款式各不相同，商铺奇货陈列，成百上千的商人往来交易，喧闹的音声响振整个城市领域。</p><p>原文：<strong>园林郁茂。大树小树。藤蔓卉药。众花竞发。清波环映。间错光鲜。粲如舒锦。象马车乘。其众百千。往还不绝。充遍城邑。</strong></p><p>释：这里的园林葱郁而茂盛，有不同大小的树木花草遍布其中、藤蔓缠绕，花卉盛开，草药遍地。众多美艳的花朵都竞相开放着，清净的水波环绕辉映，错落有致的穿行其间，远远望去璀璨炫丽，就像用众宝装饰的锦缎一般。象马车乘更是有百千之多，往还其间络绎不绝，充满遍及整个城市。</p><p>整个段落都是佛在描绘他们因为修了大福报，过着的非常奢华生活的情景。城墙高大、街道宽广、服饰众多、货品丰富、象马车乘成百上千，往返穿梭，遍及城市。商侣交易声震整个城市，居住环境优雅，整个城郭都归他们家族所有。</p><p>原文：<strong>阿难。六万城中。名德高人。及诸豪富。并诸商主。日日称赞。贤护童真。播扬声德。虔恭合掌。礼拜修敬。娇萨罗国。波斯匿王。福力富盛。比之贤护。状类贫下。</strong></p><p>释：佛对阿难说：六万个城市中的名高望重之人，以及所有豪富贵族及其商主，天天都来称赞贤护童真的富贵与福德，宣扬贤护童真的德行，对贤护童真都是虔诚、恭敬、礼拜、敬仰。娇萨罗国波斯匿国王的福力，已经是很盛大无比的了，但跟贤护童真相比，就像穷人一样。</p><p>原文：<strong>月实童真。无量百千。妓从侍绕。恭敬奉事。爱悦欢戏。众乐所依。虽天帝释。百千万倍。不及月实。贤护童真。容色丰美。富有自在。安宁适乐。亦百千万倍。不及月实。斯皆宿福所感。非力致也。</strong></p><p>释：另一个大福德之人月实童真，也是有无量百千侍女侍从围绕于他，对他恭敬奉事，敬爱欢悦嬉戏，是众生快乐之所依。虽然欲界天的帝释天主有无量福报，但即使再有百千万倍的福德也不如在人间的月实童真，月实比帝释的福德超胜百千万倍。贤护童真虽然容色丰美富贵自在，安宁舒适娱乐，但即使福德再增加百千万倍，也不及月实童真的福德。这都是他们生生世世种植的福德所召感的，不是这一生经过努力就能达到的。</p><p>我们现在的人总要追求升官发财，富贵发达，如果你前世没修福积福，今生也不可能有这么大的福德，满自己的心愿。尤其是现在的贪官通过贪污等等手段就想享受荣华富贵，这是想强行获得不该获得的福报，结果还是要散去，其实有福报的不必去贪，福报自然而来。</p><p>原文：<strong>阿难。贤护童真。又有如意宝辂。天宝雕严。光晖赫烂。天金金刚。光玉日受。种种诸宝。钿厕间错。丽若观星。运速如风。如金翅飞。乘此宝辂。宝洲等所。应念而至。身不疲劳。戏乐而返。</strong></p><p>释：佛又接着说：阿难，贤护童真，又有如意宝辂，能乘着飞行各地，是用天上的珠宝所雕刻和装饰的，非常光晖绚烂。上面镶嵌有天上的金子和金刚，光玉日受，种种诸宝镶嵌而成，钿厕间错，美丽得像点缀的星星，飞行速度就像风一样，像金翅鸟的飞翔一样。贤护童真乘此宝辂，所有的宝洲等处所，就能应念而到。不管飞到多远的地方，身体都不疲劳，总是欢欢乐乐地返回来。</p></div>"
},{
    "title": "第四节 贤护童真往世所修的福业",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第一章  贤护童真请法因缘</strong></p><p><strong>第四节  贤护童真往世所修的福业</strong></p><p>原文：<strong>是时阿难。顶礼佛足。而白佛言。贤护童真。种何善根。修何福业。过去有佛。名曰乐光如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛世尊。贤护尔时。于彼佛法之中。出家作比丘。名曰法髻。</strong></p><p>释：这时阿难顶礼佛足对佛说：贤护童真是种了什么善根，修集了什么样的福业，使得他的资产是这样的广大，能受到这样大的乐报，宫殿房屋美妙而华丽，还有奇特的宝辂随身而行？</p><p>佛告诉阿难：贤护童真，由于从前在佛法中修过福业，所以现在才能获得这么大的乐报。（如果一个人在世俗法中修福，也获得乐报，但可能就没有这么大。）过去有佛, 名曰乐光如来、应供、正遍知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛世尊（这是每尊佛的十个名号），贤护在遇到这尊佛时，当时出家作比丘，名字叫作法髻。</p><p>原文：<strong>多亏戒行。然善讲说。修多罗、阿毗达摩、毗奈耶等。三藏深教。咸悉明达。常为众生。宣畅敷演。法施不绝。美音深重。正直高亮。剖析明辩。听者欢喜。闻所说法。思惟修行。脱恶趣者。其数无量。</strong></p><p>释：他对于戒律有亏，却能讲说经、律、论三藏，对三藏甚深法都能很明了通达，常常为众生宣传和讲说，不断地为众生法布施。其讲法的音声美妙而深沉凝重，其语正直而高昂，对佛法的深义能够剖析明了，辩才无碍。他讲法的音声很沉稳，很深重，能把佛法讲得很透彻，听他说法的人，内心都很欢喜，出离三恶道的人非常多，其数无量，并且听了他所说的法之后，都能思惟修行。</p><p>我们听了法之后，也一定要思惟，思惟之后，就要去努力实修。贤护菩萨当时虽然出家于戒律有亏，但是他善于为众生讲法，经律论都很通达，果位应该很高，他是守心戒，而不注重小乘戒的表相。</p><p>原文：<strong>阿难。法髻比丘。以法施功德。于九十劫。受天人报。又见清净。持戒比丘。身羸瘦瘠。恒施饮食。及屣履等。殷重诚彻。净心布施。故今获此。大富乐报。胜妙宫室。奇特宝辂。</strong></p><p>释：阿难，法髻比丘因为为众生说法这种法布施功德，上天界受九十劫的天人乐报。（受天人的乐报，福德消的很快；在人中受报，福德就消耗得少，福德还可以积攒下来，在成佛的路上多在道业上用。如果在世间法上用的多了，道业上用的就少，修行的成就就少。）法髻比丘也很有善心，看见清净持戒的比丘，身体赢瘦虚弱，他就长期坚持布施饮食和衣服鞋履等等，并且对他们以殷切真诚的心给与清净的法布施和财布施，他的布施不求回报，就希望对方过得安稳快乐，他以这种心态来布施，心地非常清净，所以今世获得这样大的富贵且快乐的果报，有胜妙的宫宅，还有奇特的能飞行的宝车。</p><p>原文：<strong>又遇迦叶如来。示教指诲。而告之曰。汝于未来。释迦牟尼佛所。当得授记。故今见我。我为说法。而成熟之。阿难白佛言。世尊。贤护胜上童真。如是财富。金宝盈积。豪盛自在。谦柔卑下。无憍慠心。甚为奇特。</strong></p><p>释：贤护又遇到第二尊佛迦叶如来，迦叶如来为教导他，并且为他授记说：你未来世将会在释迦牟尼佛处，得到释迦牟尼佛的授记。（这个授记不一定是修到几地菩萨，佛才给授记。）所以你现在见到我，我就为你说法，让你未来得到授记的因缘早日成熟，如果我不为你说法，得授记的因缘就不容易成熟，遇到释迦佛时，也许不能给你授记。阿难对佛说：世尊，贤护胜上童真，像这样的财富堆积，金宝盈积下来，豪富又自在，但内心谦虚柔软，甘于卑下，没有一丝骄慢心，也是非常奇特的。</p><p>尽管法髻比丘修了这么多的福德，又修了大智慧，可是自身心性柔软，谦微卑下，没有高慢心和骄傲心，人要做到这一点，很难很难。现在有的众生稍微有一点突出于人的，慢心马上就生起来，很难管教他，反而是他来管教你。福德越薄的人，慢心越重。大福德的人，一般都没有慢心，因为福德能致烦恼轻微。</p><p>原文：<strong>佛言阿难。大智不于。财宝欲乐。而生矜慠。贤护久修善行。善法所资。常食福果。</strong></p><p>释：佛对阿难说：有大智慧的人，不会因为金银财宝和五欲之乐而心生骄慢，有智慧的人，绝不会在自己的财富上生起骄慢，这个不值得骄慢。因为贤护久修善行，善法的福德在滋润着他，让他常常享用着福德的果报。</p><p>原文：<strong>贤护蒙佛阿难。共称叹已。恭敬合掌。顶礼佛足。白佛言。世尊怜愍摄护一切众生。欲少请问。愿垂听许。佛告贤护。我先听汝。汝有所疑。今恣汝问。我当为汝。分别解说。</strong></p><p>释：贤护得到佛和阿难的共同称赞以后，就恭敬合掌，顶礼佛足，对佛说：世尊怜悯救护一切众生，我有一点问题要请问世尊，希望您垂心听允。这是贤护正式的提问，也是让佛借机正式讲法，前面的这一些都是序言和铺陈。佛告诉贤护菩萨说：我允许你提问，你有疑问的话就赶快提问，我可以为你解说。</p></div>"
},{
    "title": "第二章 阿赖耶识云何迁身受身 第一节 贤护问阿赖耶识迁身的问题",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  阿赖耶识云何迁身受身</strong></p><p><strong>第一节  贤护问阿赖耶识迁身的问题</strong></p><p>原文：<strong>贤护白佛言。世尊。众生虽知有识。如宝闭在箧中。不显不知。世尊。不知此识。作何形状。何故名识。众生死时。手足乱动。眼色变异。制不自由。诸根丧灭。诸大乖离。识迁于身。去至何所。</strong></p><p>释：贤护对佛说：世尊，众生虽然知道自己身中有阿赖耶识，就像珠宝被藏匿在小盒子中不能显露出来一样，自己也不知道这件事。世尊，不知道这个识心是什么形状的，因为什么而取名为识。众生死的时候，手脚因为痛苦而乱动，眼神黯然失态，渐渐的就不由自主了。这时候五根渐渐地灭去，四大互相分离。阿赖耶识也就离开了色身，祂到哪里去了呢？</p><p>识一般是指六识，还有第七识，除此还有一个不生不灭的阿赖耶识。意识和阿赖耶识这两个识，哪个是这里所形容的宝呢？因为意识不能变现一切法，所以意识不是摩尼宝珠，这个能被称为摩尼宝珠的宝，是指含有万法种子能生万法的阿赖耶识。</p><p>阿赖耶识如宝闭在箧中，这个箧是指如盒子一类的五阴身，因为隐藏在五阴身中，这个宝就不容易被众生发觉，其实这个宝时时刻刻都在大放光明，只是众生自己看不见。不是宝不显，而是众生的心被五阴烦恼遮蔽住了，是众生的心有无明产生了遮障，看不见自身中的这个宝贝，不是宝把自己闭藏了起来。贤护菩萨问阿赖耶识是什么形相，这个识有没有形状，有没有长短、方圆、大小和颜色，是否与世俗法当中的六尘一样，有声音、有色彩、有色相、有香尘、有味尘、有触尘、有法尘，祂是什么相状的，为什么叫作阿赖耶识？</p><p>众生死亡时，阿赖耶识必须随业离开身体，然后形成后世的业报身。有的众生在死亡时, 痛苦得手足乱动，这是造了恶业的众生，他们的死相比较难看，死亡时比较痛苦，因为痛苦，手足就乱动挣扎不已。眼睛上的四大分解了，眼珠变混浊了，这时候阿赖耶识和意根也都要陆续离开了，死亡的人再想看自己的家亲眷属，就看不见了，眼识不由自己作主地消失了，但这时候他的意识心还没有消失，还有知。然后视觉开始变得模模糊糊，到最后一点也看不见了，耳朵也听不见声音了，这些功能作用渐渐地都灭掉了，他知道自己要死了，却根本作不了主。</p><p>他的意根原来是能作一点主的，这个时候为什么却作不了主？意根原来一直是我想这样，我不想那样，要执取这个控制那个，但在这时候却没有办法控制什么了。因为业力实在太大了，不得不随业流转，死的业缘出现，意根也无可奈何。能作主的是什么？其实还是阿赖耶识，阿赖耶识随业现出什么，就随什么而去，业力如山大。这个业又是从哪里来的？是阿赖耶识集藏五阴造业的业种现行出来的，阿赖耶识依据业力种子产生什么样的五阴，众生就有什么样的五阴，意根不得不接受，所以阿赖耶识才是主人公。</p><p>意根只是一个假的表面作主的主人公，祂只能随缘对某些小事作主，真正生死大事需要作主的时候，却作不了主了。在临终的时候，意根并不想死，可是照样得死，受恶报的时候也不想受，但照样还是要受恶报，对于这些祂一点办法都没有。但是五阴身造业是由意根作主决定的，是由意根的无明使然，那么果报最终还是由意根决定的。</p><p>色身死亡之后，眼根不再起作用，阿赖耶识不能通过眼根变色尘，这时候内色尘也没有了，眼识就无法继续出生，根尘相触生识，前面的浮尘根不行了，后脑勺的胜义根也不行了，外边的色尘还能进来吗？进不来了，因为根不能起传导作用。没有内色尘，就没有眼识，所以他就看不见人。</p><p>耳根也是同样要坏灭，虽然耳朵的形状摆在那里，但是传导神经已经不能起作用了，声音就传不进来。耳根坏了，声尘也就消失，声音不能再传导到胜义根变现出来内声尘，耳识就渐渐消失，他听的声音就越来越微弱，越来越微弱，最后就听不见了。鼻根也不能起传导作用，香尘不能传导过来，鼻识就渐渐地消失了。舌识也是同样的道理，渐渐的身根也不起作用，阿赖耶识不再传导触尘，没有了触尘，身识也就渐渐地不起作用了，整个身体慢慢就没有了知觉。</p><p>意根这时候也没有办法了，心里明明白白这个身体不能用了，但还会支撑着，因为意识心还没有灭。等到意识心也灭的时候，意根感到一点希望也没有了，就会从身体上撤离，阿赖耶识也就跟随着离开，二者都不能单独执持色身，阿赖耶识是最后离开的，其实不是最后离开，是与意根同时离去。如果意根不在，阿赖耶识立时不能持身，不能留在色身中；如果阿赖耶识先走，那意根也就不能存在，必须灭去，阿赖耶识不能先走，也不能最后走，必须与意根同时走。</p><p>那么阿赖耶识是不是第一个来到色身中呢？也不是，阿赖耶识不能单独执持色身，祂也没有心思要执持色身，是受意根思心所的影响，随顺意根刹那进入受精卵中执持受精卵，与意根同时入住母胎中。因为意根与阿赖耶识形影不离，阿赖耶识与意根形影不离，刹那都不能离，所以二者入住母胎和离开色身时，没有先后。如果有先后，就说明二者能互相分离，那意根就能单独存在，阿赖耶识也能单独运行，这样就违背阿赖耶识和意根的体性了。</p><p>四大种子是从阿赖耶识中出来的，阿赖耶识要离开色身，肯定要把四大种子全部收回，这样阿赖耶识里的种子，才能不增不减，遇缘继续输送出去出生万法。众生临死之前，甚至很长时间之前，阿赖耶识就知道，因为祂能了别业种，知道死亡的时间，具体时间也知道，祂要慢慢地改变四大种子，让身体发臭，让身体机能衰弱，快咽气的时候才开始真正地四大分解，收回四大种子，全部收回时，色身就成为僵尸，没有了灵动性。</p><p>前五识不再现起，五俱意识和独头意识随后也就消失了，由于胜义根四大分解，独头意识也渐消失，这时就处于正死位。死亡的过程，做善业的人可能相对较短，也没有痛苦，造恶业的人可能死亡的时间较长，承受的死苦比较多。这个过程的时间可能是几个小时，六七个小时八个小时，有的人就得十多个小时。</p><p>六识陆续消失的过程，也是四大逐渐分离的过程，这时会感觉到特别的痛苦。四大种子一一分离，分离后的四大种子又回到阿赖耶识中，而阿赖耶识不再输出四大种子，身体就渐渐没有暖度了，因为四大种子中的火大分离出去了，身体慢慢变得冰冷冰冷的，地大、水大、风大也都陆续分离出去了，回归到阿赖耶识当中。</p><p>但是做善业的人这个时候不感觉痛苦，这是做善业所感得的果报，可能弹指之间，他就已生往天界。但是在没断我见时，他照样留恋三界，只是因为他做了善业，有善的果报，要去天界享福，这时候天乐可能会响起，天界的父母在盼望着他。得善果报的人，八个识离开色身没有这么长时间，弹指之间就升天了，所以他不会经历痛苦。生往人道的人，他死亡咽气的时间要相对长一些，没有这么短，但没有多少痛苦。</p><p>越造恶业的人临终四大分解时就越感痛苦，在临命终时就会手足乱动，表明他在痛苦地挣扎。但是对于这些痛苦，已经无法表达了，口不能动，舌、口、牙都属于身根，身根不行，他就无法说话。这时候如果有人碰他一下，他会感觉特别痛苦特别疼，有可能会起嗔恚心，嗔恚心一起来，也许就会随着嗔心而下地狱。所以人刚死的那段时间不能碰，那时候不能给他洗澡或者换衣服，要等他死透了再处理这些事情。多长时间能够死透呢？或许八个小时，或许十多个小时，时间不一定，一般去往三恶道的，死后身体都是僵冷僵冷的，脸色都不好看，地狱众生的脸色是发黑的，鬼道是发青的。</p><p>最后六识全部灭尽，就没有了五蕴，意根不能再利用五蕴身，指挥控制不了六识的时候，对色身就觉得没有希望了，只好离弃色身，重新再去投胎，再去给自己找个身体，于是就有了中阴身。这是诸根丧灭的过程。诸大乖离，是指地水火风四大分解（其实还有一个空大），四大种子各个离散的过程。原来地水火风是和合在一起组成了色身，现在都分解开了，色身的生命功能就消失了，虽然还有肉身存在，但无法再活动，色身就如木头一般。</p></div>"
},{
    "title": "第二节 阿赖耶识如何受另外的身",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第二章  阿赖耶识云何迁身受身</strong></p><p><strong>第二节  阿赖耶识如何受另外的身</strong></p><p>原文：<strong>自性如何。作何色相。云何舍离此身。更受余身。</strong></p><p>释：阿赖耶识的自体性是什么？是什么样的色相？祂为什么能离开这个色身再接受另外的色身？</p><p>这里说的自性就是指阿赖耶识，祂是独立的不生不灭的，所以有自体性，其他的法都是被出生的生灭法，不自在法，所以就没有自体性。阿赖耶识的自性如何，是什么样的色相，命终阿赖耶识是怎样弃舍现在的色身，再去受其他色身的？怎样再去变生其他身体？贤护菩萨问世尊的是众生轮回的关键问题。这里的受身是指阿赖耶识要去执持下一个身体，把将死亡的这个身体弃掉，去变现、执持、接受后世的色身。</p><p>阿赖耶识在众生色身四大分解以后，就与意根一起离开色身，再去投胎到下一个色身中。祂还会变现另一个色身出来，至于要变现出什么样的色身由业种决定，由业力说了算。多数情况下是先有中阴身，然后再去其它各道里出生，如果生往天道就没有中阴身，如果是下地狱也没有中阴身。</p><p>阿赖耶识要去至何所，要看此人临终时是什么业缘成熟，比如说前世造了恶业，今世没有学善法，恶业的力量大，命终就会随着所造的恶业下三恶道。但是今世造的善业缘成熟了，善业又大于恶业，命终就会随着善业的缘生到善道中去。阿赖耶识是随着众生的业缘而迁，临终的时候要看是哪种业缘先成熟，如果我们今世造的善业小，抵不住那个恶业的缘，虽然学佛了，恶业缘现前，也照样去三恶道受报。</p><p>学佛的人虽然很多，但是真正善业大的人却非常少，百分之八十甚至更多的人会下三恶道，尽管这一辈子学佛，仍然免不了下三恶道，因为他此生所做的善业小，而他过去世和今世的恶业却很多很重。比如心中有贪，贪吝心重必生饿鬼道，还有嗔恚和愚痴业重，一个下地狱受报，一个做畜生受报。学佛人中，这些恶业烦恼几乎都没消除和降伏，贪嗔痴烦恼要到证了三果时才能断尽，证到初果时都只是断除最粗重的烦恼，烦恼的根还在。</p><p>可能有人要说，佛经里讲守持五戒就能得人身，自己是守五戒的，肯定能得人身。但这可不见得，一是因为自己不能正确判断是否确实守护好五戒了；二是假如说自己真的守持好五戒了，但是前世的恶缘正好成熟了，那他必须随恶缘去三恶道而生死流转，没有选择，至于守持五戒的功德，等善缘成熟时，才能受善报。天人也守五戒，欲界天、色界天、无色界天人他们都不犯五戒，什么恶业都不造，但是他们死后却有直接下地狱的，这说明地狱的恶缘成熟了，那就躲不过去了。</p><p>天人的福报享尽了，地狱的业种成熟，就会随业到地狱去受恶报，因为他无始劫以来的恶业种子还没有消除，善业的缘还没成熟、势力不够大，他仍然会堕恶道。众生临终生往哪里去是要看哪个引业的势力大，哪个业缘先成熟。有些人虽然造作了恶业，但是他能诚心诚意地发清净大愿，临终时善的愿力大于恶的业力，凭借这种大愿力也可以生往善道。所以学佛人，证初果是刻不容缓的事情，如果此生证了初果，下辈子又能证初果，或者能证二果，生生世世不下三恶道受苦，以后再继续证得三果四果，断除烦恼，就能心得解脱，慧得解脱了。</p><p>有不少人都说自己断贪欲了，感觉自己好像不贪人世间的法，对人间的一切事情都不感兴趣，可实际上并没有断除一丝毫，那是一种压伏状态，不是断除状态。因为没有断我见，也没有证得初禅，五盖也没有修除，因此就不可能断除贪欲烦恼。还有一些人表面上没有淫欲事了，就说自己已经断除淫欲烦恼了，其实那仅仅是由于身体等等一些客观原因，淫欲在表面上得到压伏和抑制罢了，心理上并没有断，在中阴身里还是要因为贪欲而去投胎。</p><p>只要还有男女欲，就会投生到欲界，不会投生到色界和无色界，真能断掉贪欲的人是有色界以上禅定的人，不会再在欲界人间出生，证得色界初禅以后的菩萨们主动流在人间，那是例外。障碍初禅发起的原因主要是贪欲、嗔恚、睡眠、掉悔、疑这五盖，尤其是五盖中的贪欲盖，如果对于欲界人间的欲望重，就不能生起色界初禅定，人间和欲界天上的欲求如男女欲和饮食欲等都降伏了，才能发起色界初禅定。如果一个人讲究吃穿住用行，喜欢色声香味触，初禅定就修不出来，对于生活环境太在意了，也不会有禅定。</p><p>如果心里真能做到什么生活环境都无所谓，好坏都行，好的不贪，坏的不逆厌，对于生存环境都不起心行，才能有禅定。欲求的心念一生起来就没有定，真做到无所谓不在意不挑剔才是不起心，平时生活中对于什么都无所谓不在意，环境的好坏都无所谓，真做到这样才能发起禅定，如果还讲究吃穿住用等色香味触，就不会有初禅发起，修不出色界定。</p><p>在刚刚证果和明心的时候，如果禅定不能发起，过了这个时机，再往后就不容易发起初禅了，应当趁着断我见这时候有觉明出现，内心有喜悦出现，抓紧修习禅定，如果没有觉明，定力浅，再往后初禅定也不容易出现。尤其是在家人，与日常生活联系太密切了，更不容易发起初禅，出家人世俗的东西离得远一些，相对还稍微容易一点，在家人修习佛法很不容易，生活中到处都有容易起心动念的事情发生，不容易修好禅定。</p><p>过去的外道出家以后，不要说初禅，证得四禅、四空定的人都有，甚至连禅定中最高的非想非非想天定都能证出来。他们到深山中专门修禅定，真能做到对于世间的一切都无所求。可我们现在修个欲界未到地定都这么难，从这点来讲，我们现在甚至连外道都不如。现在学佛人的根基，怎么能跟人家外道相比，还瞧不起人家外道，人家外道修四禅八定，从不喊口号说放下放下的，但五欲六尘确实都放下了，是实修实证禅定的人，我们学佛人却成天喊口号，对世间的东西一辈子都没能放弃掉一点点。</p><p>他们修外道法只是前世的业缘不好，比如前世他可能也修禅定，只不过修的是外道法，即没皈依三宝也没有受戒，今世才没有得遇佛法。所以皈依三宝很重要，今世皈依了三宝，来世还会皈依三宝，依止于三宝学佛，就不会到外道法中去修行了。学佛如果不提倡受五戒、不皈依三宝，是绝对不行的，这样没有依止，心无所归，根基不稳，后世容易流落到外道中。</p><p>今世如果不修禅定，来世对修证禅定仍是疏远，还是进不了修定的门槛，佛法就无法证得。所以佛让我们修什么法，我们就要依佛修什么法，不要自己搞发明创造，佛要我们如何修，我们就要如何修。佛所讲的都是圣言至教量，都是如实语，只有百分之百的依止，才能获得佛法上的利益。      </p><p>原文：<strong>云何身分。弃之于此。而牵诸入。获当来报。受种种身。差别不同。</strong></p><p>释：贤护菩萨继续问佛：为什么阿赖耶识把身体丢弃不管，而带着六入去获得未来世的果报身？阿赖耶识所接受的未来世种种色身，有很多差别，并不是同样的色身。</p><p>色身如果没有识的参与，就没有了蕴集的作用，就不叫蕴了，色身加上八个识，就有五蕴的功能作用，其中不能没有阿赖耶识、第七识和第六识，五识中可以缺少一至三个，六七八识是不能缺少必须有的。色身死在哪里，就被阿赖耶识舍弃在哪里，生在人中，就弃在人中，生在地狱就舍弃在地狱，生在畜生中，就舍弃在畜生中。阿赖耶识再把六根六入带入新的色身上，众生就受当来世的果报。</p><p>诸入就是指眼入、耳入、鼻入、舌入、身入、意入，即六根所对应的六种趣入功能，又迁这六根获当来报。比如说众生现在是人身，死了之后，来世做畜生，在畜生身上阿赖耶识出生了六入，就把六入迁到那里了，六根就是畜生的六根。畜生身上就有六入，眼入、耳入、鼻入、舌入、身入、意入，内六入具足，外六入色声香味触法就能传导到色身中，六识依之就能出生，之后就出现了别活动。</p><p>当来报就是现在还没有出现，但是以后要出现的果报。中阴身生起又灭去之后，才会有下一世的色身，所以叫当来，是以后应当来的意思。要迁诸入到色身中，五蕴完全出现，才能有当来报。迁诸入的意思，不是说把原来的眼根等五根直接带到未来世色身里，而是说阿赖耶识投胎以后，在母胎中依据业种，又生出了六根的功能，六根具足才是正常的众生。</p><p>阿赖耶识受种种身差别不同，众生今世受畜生身，畜生业了了以后，下一世也许会得个人身，再下一世也许会得个鬼身，再下一世也许要受地狱身，也许要受天人身，有时还要受阿修罗身，众生就是这样生生世世在六道里受种种不同的色身，不出生死轮回苦，这就是众生六道身的差别不同。至于要受哪种身，还是要根据众生的业种，业不仅是今世所造，连同过去世所作之业都加一起，看哪种业缘先成熟，就受哪种业报身。</p></div>"
},{
    "title": "第三节 贤护问众生为什么在未来世受福业",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第二章  阿赖耶识云何迁身受身</strong></p><p><strong>第三节  贤护问众生为什么在未来世受福业</strong></p><p>原文：<strong>世尊。云何众生。身谢灭已。更生诸入。云何今生。积聚福业。来生得之。今身为福。当来身食。</strong></p><p>释：世尊，为什么众生色身死亡了，还要出生六入，有新的生命？众生为什么今世集聚了福德之业，来世才能得福，现在的色身种福，未来世的色身享福？</p><p>众生的这个色身灭失以后不起作用了，在另一个胎里又生出了眼、耳、鼻、舌、身五根，这是如何生出来的呢？众生今生积聚的福业，来生会得福报。但若是积聚了很大的福业，业缘现在就成熟了，现世就受福报，不一定要等来生再得福报，当然未来世得的福报会比现在得的福报大很多。只要现世的业缘出现，现世的福报就会现前，来生的福报将会更大。现世得的果报叫花报，后世得的果报叫果报，花要远远小于果，果是最重的，后世的果报最大，那时候受报的缘才彻底的成熟。</p><p>来世的五阴身与今世的五阴身是不是同一个众生？众生是一个，意根和阿赖耶识不变，六识五阴却有差别。比如说今世以鲜花供佛，来世的色身相貌可能很庄严，来世庄严的色身与今世的色身是不是同一个众生？还是同一个众生。在新的色身上，意根和阿赖耶识还是原来的那个，没有改变，改变的是六识和色身，意根同时把习气带着，那时在众生身上显现出的习气与今世相同。比如前世好抽烟，这一世还是好抽烟；前世喜爱吟诗作画，后世还是喜爱吟诗作画；前世爱读书，后世仍然喜爱读书，前提条件是在同类色身上，现行习气的缘要具足，如果不具足，某些习气就无法现前，意根带着习气和业种流转在任何一世里。</p><p>从这里可以看出，众生前生今世会有相同的部份，比如说一个人前世当你父亲当习惯了，今世遇见你说话时可能仍然是以父亲的口气跟你说话。从一只狗身上也能看出来它前世做人时的习气，一只狗表现如果挺厚道的话，它前世当人的时候也是厚道的。仔细看每一个人的今生，大概就能知道他前世是什么习气，也能判断出他后世的性格脾气秉性。知道了业种是连续的，意根是连续的，看人的时候一眼就能看穿他的前后世的大概情形。</p><p>即使一个人修行成为了阿罗汉，其习气也仍然存在，身口意行同样要沿袭前世的习气惯性，不能轻易改掉。每个众生的习气，都会生生世世带着，一直带到未来世，并且不自觉的就表现出来。众生投胎都带着前世的意根，意根的表现就与前世相同，一般来说变化都不太大。阿罗汉如果不入无余涅槃，也带着第七识投胎，也仍然现出前世的清净习气。所以我们学佛修行，在现有的条件下，能去除一点恶习就去除一点恶习，尽量不要带往后世。</p><p>众生生死流转，意根带着的习气，还包括情执。无始劫来，众生之间什么关系都出现过，流转到下一世，就要把各种情执都带着，继续执著情感，以至于生死不断。众生的生死流转依赖着情执和贪欲，贪欲没有断除的人，在中阴境界时，一看见男女和合时，马上就会生起欲念参与过去，然后就被拘执，被动的被业牵着就投胎了。</p><p>如果贪欲不断除，意根就会带着这种习气去投胎，生死轮转就不能停息。尤其是在中阴身的时候，意根特别秉直，本来是什么习气就表现为什么习气，意根不具备这种分析思考判断的功能，烦恼习性完全现行，意识控制不了。因为中阴身的胜义根不发达，意识的思惟力比较弱，不能通过有力度的思惟分析而牵引意根，意根就完全按照自己的习气现行。在五阴身上胜义根发达，意识依之就能有较强的思惟分析能力，能有效的提供给意根所需的信息和资料，意根就可以受到引导，不至于让习气完全现行出来。</p><p>要想控制和改变意根，不再投胎进入生死轮回中，就要断除意根的贪欲；而要断除意根的贪欲，须要先断我见，之后修出初禅定，在禅定的力量下，就能断贪欲。否则在中阴身里意根一定要因为贪欲而投胎。意根的贪嗔痴烦恼，是在断除我见之后才能断除，这是修行的次第。如果没有断我见，只有初禅定，那贪欲只是被压伏着，不能断除。世尊在世时，有些外道们禅定功夫修的很高，看起来都没有欲贪，那只是靠定力暂时压伏着，等到来世投胎后，禅定消失了，欲贪还是会出现。所以只靠定功压住烦恼还不行，必须要有断我见的智慧，可见断我见有多么重要。断除我见再修出初禅定，定慧结合，就可以断除所有烦恼。</p><p>走大乘路线修菩萨道，断我见之后，是否也要把所有烦恼都断除？如果把所有烦恼都断除，临终那就要舍弃三界世间一切法，入无余涅槃，没有了未来世，也就不能修学佛法。因此菩萨们需要留一点对三界法的贪爱，比如对禅定的贪爱，或者是对佛法的贪爱，只要能保留一点点贪爱，因此贪爱就能投胎受生，继续修学佛法和帮助有缘人修行。但是贪爱不能留太多，如果留个男女欲贪，那么初禅就消失，就不是三果四果的证量了，果位就退失了。</p><p>如果想要不断出生在三界善道中修行，可以发个清净大愿，让愿力起作用，就能保证投胎，保证有三界的种子，又能在三界出生做人。如果对三界的法一点都不喜欢了，临终意根就能灭掉，一切法就会随之都消失殆尽，这样就不可能再有五阴身学法行菩萨道了，所以到证得三四果的时候要留那么一点贪爱，不要全部断除，不要取四果的果位，但我们现在离那个境界还很远，暂时不必考虑这个问题。</p><p>修到初地菩萨后，就要开始留一点贪爱，不能厌弃一切，地上菩萨再出生来到这个世间，与其他众生有很大区别，就是不喜欢世间法，喜欢修行，在世间里生存也觉得相当无聊。世间法什么都不喜欢，却还要在这个世界上混，是不是很苦恼？所以做菩萨也很不容易，不是做菩萨就很快乐，感受都好，他无法合众，跟众生没有多少共同点。而众生活在这个世界有他喜欢的，有他追求的，还有所谓的乐趣，可是菩萨对世间法没有追求，常常是不愿意随顺也得随顺，那就常常心生苦恼，直到遇见佛法为止。</p><p>原文：<strong>云何识能。滋长于身。</strong></p><p>释：为什么阿赖耶识能滋养和生长色身？阿赖耶识再次投胎，就会进入到另一个受精卵里，阿赖耶识是如何把色身一点点滋长起来的？滋就代表着滋养、维持、执持、变生的意思。用什么滋养色身呢？用四大种子滋养着，四大种子输送出来以后，胚胎开始一点一点长大，如果阿赖耶识不输送四大种子，胚胎就不能生长，阿赖耶识是用六大种子执持众生的五阴十八界。</p><p>原文：<strong>云何识入。随身转变。</strong></p><p>释：为什么阿赖耶识能入住色身、随逐色身而运转？阿赖耶识入了色身当中，是如何随逐着色身、转变色身的？色身一点点变大，然后身根具足，识心出生，色身上有了行蕴和识藴，五蕴开始运行。阿赖耶识是怎样追随着色身和动转色身的？识潜于身中作事业故，阿赖耶识潜在众生身中，作一切事业。作什么事业呢？这涉及到别相智和道种智，这些智慧非常深，阿赖耶识究竟作了什么事业，如何作事业的？</p><p>贤护菩萨提出了这么多的疑问，说明他有智慧，毕竟前世当过法师，教导众生经律论三藏，为众生开导经律论三藏积了那么大的福德，今生又遇到了佛，当然就会问大乘如来藏的深法，问题很深，涉及到了道种智。他的智慧能到什么程度？前世讲经律论三藏集聚了那么大的福德，如果他没有开悟，没有修出甚深的智慧，讲的法肯定有错误，这样就有损他的福德，福德就没有现在这么大，而且讲法当中有根本错误，还要有恶报。从贤护菩萨现世的福德来看，并不涉及恶报的问题，那么贤护菩萨讲法就没有问题，符合佛意。</p><p>道种智是地上菩萨证得的唯识智慧，是关于如来藏里种子的智慧。如来藏里含藏的种子，菩萨懂得了一分两分三分或者更多，就有道种智。一切法都是属于如来藏里种子的一部分，如来藏里的种子功能作用全部证知了，就叫一切种智，证知一部分就叫道种智，所以唯识是佛法当中最深奥难懂的。唯识都学完就是大乘的无学果位，就没有什么可学的了，那就是佛。禅宗的法都学完后能入初地，唯识学完后就成佛。万法都体现在识上，有识就有万法，没有识就什么都没有，所以学唯识，就能懂得最究竟的佛法。</p><p>贤护菩萨曾经遇到两尊佛，这两尊佛相隔的时间有很多个大劫，八十乘以一千六百八十万年为一大劫。这部经里讲述了两尊佛是如何教导他的，贤护菩萨如何遇到释迦佛，释迦佛又如何为他授记的。如果前世那尊佛不教导他，他就不能修这么快，今世遇到释迦佛也不能被授记。贤护菩萨应该有道种智，最起码是初地菩萨，所以他问的法都挺深奥和关键。</p><p>如来藏在身根当中的运作属于唯识种智的部份，普通人讲不出来，那要有非常深细的唯识智慧，如果没有证得如来藏，是讲不了这些法的，事实上就算是证得如来藏，普通证悟的菩萨也讲不出来这样甚深的法，这需要有唯识种智。具有初地以上菩萨的证量，能观察如来藏的运作，才能把如来藏具体的运作表述出来，这叫观行。在成佛之前一直都用得到这种观行，所以我们现在修好禅定，学会思惟和观行方法，是非常重要的，生生世世都能得到受用。自己没有禅定，不会观行，生生世世都要依赖别人学知识，而不能证得。如果懂得观行，就不是在学知识，而是在求证参究，表述的永远都是自己的心得。学法时，边学边观行思惟就能逐步证得，智慧发展得就很快，所以学会观行相当的重要。</p></div>"
},{
    "title": "第四节 阿赖耶识的运作犹如风大",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第二章  阿赖耶识云何迁身受身</strong></p><p><strong>第四节  阿赖耶识的运作犹如风大</strong></p><p>原文：<strong>佛言。善哉善哉。贤护。善哉善问。谛听谛听。善思念之。当为汝说。贤护白佛言。世尊。唯然奉教。</strong></p><p>释：佛说：贤护，你问得很好啊！你要仔细地听，仔细地思惟，我现在就为你说。贤护回答佛说：好的，世尊，我一定奉行您的教导。</p><p>如果不仔细听，有些法就听不懂，听闻以后还要善于思惟，按照正理如理地思惟。有些人听了法也思惟，但他是邪思惟，中间用的都是思惟推理，而且还是全部错乱的，那样就不能得出正确的结论，所以佛告诉贤护菩萨要善于思惟，好好思惟。</p><p>原文：<strong>佛告贤护。识之运转。迁灭往来。犹如风大。无色无形。不可显现。而能发动万物。示众殊状。或摇振林木。摧折破裂。出大音声。或为冷为热。触众生身。作苦作乐。风无手足。面目形容。亦无黑白。黄赤诸色。</strong></p><p>释：佛告诉贤护菩萨说，阿赖耶识在色身中运转、迁入、离去，不断地往来于色身，祂不在色身上，色身就灭，祂在色身上，色身就存在。阿赖耶识就这样在色身之间来来往往，就像风大一样，无形无色，不能显现出来，却能够动摇万物，示现出众多不同的状态。风大或者摇晃和震动森林树木，吹断树枝，吹落树叶，摧折树干，发出大的怒吼声；或者以热风的相状触众生的身，或者以冷风的相状触众生身，让众生生出或苦或乐的诸多感受。风大没有手足、面目和形态，也没有黑白赤黄等等诸多色彩。</p><p>风大无形无色，显现不出相貌，我们不能看见风，但是却可以知道风来了，通过风大的作用，就能看见风，是通过风的作用知道风出现了。风能吹拂万物，通过万物各种各样的姿态显现出风的作用，从这些作用上就知道风出现了。风吹过树林的时候，大风一摇，树就被吹折了、吹倒了，树一倒，就发出了轰隆隆的声音。或者大风吹落了树枝树叶，就会发出撞击的声音，这个声音是谁发出来的？风本身没有声音，但触到树上就出现了声音，这里面有很多都是如来藏的秘密，这些声音其实都是诸法和合运作所生出来的，包括风所起的作用，树木的摇动，全部都是如来藏的作用，这些法都非常深细。</p><p>天气热时，热风吹到身上，使人感觉热；天气凉时，凉风吹到身上，使人感觉冷；通过这一热一冷就能知道，吹过来的是什么风。有的众生觉得热风吹到身上感觉苦，有的众生觉得热风吹到身上很舒服感觉乐，同样是热风，却让众生有苦有乐。冬天吹热风，当然感觉乐了，夏天吹热风，就感觉苦受了；冬天吹冷风就感觉苦受，夏天吹冷风就感觉乐受。</p><p>风无手足，也没有什么面貌、容貌，没有形态，也没有黑白赤黄等种种色彩，什么可见的形相都没有，阿赖耶识也是这样。祂也没有颜色、没有手脚、没有面貌、没有形状。但是祂和风一样，运转的时候，众生五阴七识的作用就会显现出来，受蕴、想蕴、行蕴、识蕴就会显现出来，用风来比喻阿赖耶识非常恰当。</p><p>阿赖耶识无形无相，单独显现不出来，怎么能证得祂呢？是要在祂的作用上面证得。这需要参禅，在五阴的活动上参，就能证得阿赖耶识如来藏的作用。不是用眼睛看见祂，因为祂没有形象；也听不见祂，因为祂没有声音，而是要通过思惟观行祂配合五阴所起的作用上去发现祂。最后知道了这个作用是祂生起的，那个作用是祂生起的，证得了祂是怎么样运作的，这叫证悟。</p><p>原文：<strong>贤护。识界亦尔。无色无形。无光明显现。以因缘故。显示种种。功用殊异。当知受觉法界。亦复如是。无形无相。以因缘故。显发功用。</strong></p><p>释：佛说，贤护，阿赖耶识法界也是这样，没有色彩和形相，也没有光明显现出来让众生眼见，所以肉眼看不见阿赖耶识，也摸不着祂。只有通过种种的因缘，显示出祂有种种的功能作用，相当殊胜特别，这才知道有阿赖耶识，没有因缘祂就不能显现。同理可知，能受能觉的识心法界亦复如是，无形无相，要通过各种因缘才能显发出识心的各种功用。</p><p>阿赖耶识无形无相，因缘现前的时候五阴就能起用了，就能显现出阿赖耶识的各种功能作用，我们就知道阿赖耶识存在和运行着，就能证得阿赖耶识。而在无余涅槃里，什么因缘都没有，阿赖耶识的功能作用显现不出来，即使佛也找不到无余涅槃中的阿赖耶识。没有无余涅槃的时候，各种因缘层出不穷，所谓生缘处处，阿赖耶识随种种缘配合运行，其功用不断的显现，证得祂就很容易了。</p><p>一切法的现行作用全部都是阿赖耶识的功用，但是明心证悟之前很难分清哪些是五蕴的作用，哪些是阿赖耶识的作用。这些真假作用混在一起搅在一起，般若智慧不具时，就不知哪是真哪是妄，因为阿赖耶识以因缘故显现众生的五蕴，当六根触六尘时，六识的受觉就出现，虽然出现，意识无形无相，不可眼见，只能领会和感受；当六根不具时，功能受阻，六尘不能现前，六识的受觉就不能现前。</p></div>"
},{
    "title": "第五节 阿赖耶识受后世身犹如风大吹花",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p><strong>第二章  阿赖耶识云何迁身受身</strong></p><p><strong>第五节  阿赖耶识受后世身犹如风大吹花</strong></p><p>原文：<strong>贤护。众生死此。受觉法界识界。皆舍离身。识运受觉法界。受余身者。譬如风大。吹众妙花。花住于此。香流至远。风体不取。妙花之香。香体风体。及与身根。俱无形色。而非风力。香不远至。</strong></p><p>释：贤护，众生于此世界死亡以后，六识的受法界、觉法界以及阿赖耶识法界，全部都离开色身，阿赖耶识又运载着受觉法界，去承受另一个色身。这种情况就像风大吹拂着众多美妙的鲜花一样，鲜花在此地，花香却因风的吹拂而飘散至远方，风体并没有取着鲜花的香气，香体和风体都没有形色，但是如果不是因为风大的力量，花香也不会飘散到远方。</p><p>众生死亡后，七识和阿赖耶识全部舍离这个身体，六识都灭去的时候，意根就想离身了，阿赖耶识就会离开身体。而没有了六识就没有受蕴，没有了受也没有了觉，身体无觉无知就是尸体一具。阿赖耶识再把受觉法界迁移到另一个（后世的）色身上，祂是如何迁移的呢？受觉法界灭了以后，阿赖耶识又去投胎，形成另一个色身，到一定时候，在另一个色身上又变生出六识，受觉法界就出现了，新的色身就有了受和觉，就能觉知和感受色声香味触法。阿赖耶识以出生六根六尘和六识的方式，把受觉法界迁移到下一世的色身上，让下一世的色身产生受觉法界，色身就有了五蕴的功能作用。</p><p>这种现象如同风大吹过美妙的香花，风吹花的时候，没有把花吹跑，但是祂能把花的香味带到远处。风比喻是阿赖耶识，香比喻为五蕴的受藴，花比喻为众生的色身，阿赖耶识虽没有把色身带走，但把受觉法界带走了。这只是个比喻，其实是阿赖耶识又在另一个色身上显现出了六识的功能作用，色身就有受、有觉知，也就有了见闻觉知性，能觉察六尘了。</p><p>花香随风可以飘到很远的地方，五蕴身能迁到哪去呢？有可能很远，远到其它世界的佛国土，也可能会迁到天上或地狱，离我们人身很远。风体自身没有想要获取香味，但香味还是被它带走了，阿赖耶识自身并没有五蕴，他只是把五蕴的种子带到了其他色身上，又生出了五蕴，于是就有了受觉法界。</p><p>花香自身和风大自身都无形无色，同样的，众生的身根种子也是无形无色的。阿赖耶识含藏着身根的种子，在因缘具足的时候，身根种子就会生成另外一个色身，这是阿赖耶识携带的身根种子与种种因缘配合的结果，也许生起的是中阴身，也许会是投胎以后的色身。中阴身也是身，只要是由种子形成的身根，就是有形有色的。阿赖耶识好像风一样，如果不是因为阿赖耶识的力，五蕴以及受觉法界就不能够迁流到其它世界的下一世色身上去。</p><p>原文：<strong>贤护。众生身死。识持受觉法界。以至他生。因父母缘。而识托之。受觉法界。皆随于识。亦复如是。如从花胜力。而鼻有嗅。从嗅胜力。而得香境。又如从风身胜力。得风色触。因风胜力。香得至远。如是从识有受。从受有觉。从觉有法。遂能了知。善与不善。</strong></p><p>释：贤护，众生的色身死亡了，阿赖耶识带着受觉法界的种子，又到下一生去了。在中阴身里因父母的缘，阿赖耶识就托入到受精卵当中，名色产生。受觉法界都随着阿赖耶识而迁入到下一生的色身中，也是这样。就像因为鲜花的殊胜力，鼻子才能有嗅闻性，因为鼻子殊胜的嗅闻力，才能嗅到花香尘境。又比如因为风体上的殊胜力，就得到风和花色体的相触；再因风的强大的传送力量，花香漂流到远方。同样的道理，因为阿赖耶识才能产生受，因为受才能有觉，因为觉才能有法的显现，众生就能了知到法的善性与不善性。</p><p>阿赖耶识中含藏有受觉法界的种子，因缘成熟，输出受觉的业种和六识种子，受觉就出现，众生就有受和觉的功能作用。身根种子最先依着父母的因缘生出身根，然后识种子也陆续出生起用。眼耳鼻舌四根种子依着身根出生，六识的种子依着六根六尘的因缘，也开始发起功用，如此种种，受觉法界又生起了。</p><p>因为花有香味，鼻根具有嗅觉功能，依着鼻根的闻性及鼻识的力量，使我们能够嗅得到花的香境。鼻根摄取到了花香的味尘，根尘相触，鼻识了别到香尘，即摄取了香尘的相，也就觉到了花的香，由鼻识和意识心的作用，取了香尘的相而得香境。有识才能得，没有识不能得，得是取相、执取的意思。</p><p>因为风大本身有传送的力量，使得风色相触，风和花一相触，花香就飘到了别的地方。同样的道理，阿赖耶识也有输送种子的功能作用，人死后阿赖耶识与业种相触，就把五蕴带到了其他世界的下一个色身上。因为有风的推送，花香才能飘到很远的地方。同理，因为有阿赖耶识，才能把受觉法界的种子迁移到另一个色身上。风大比喻阿赖耶识，花朵比喻身根，花香代表受觉法界和五蕴的种子。鼻根有嗅闻性，是因为有鼻识的作用，我们才能闻到香，才有觉知，说明受觉是六识的作用，六识能取色声香味触法六尘，六尘能在心识上显现出来。</p><p>为什么六识能取色声香味触法六尘？因为有色身，有六根，又因为有阿赖耶识，阿赖耶识能把六尘传送过来，六识依之出生，受觉就出现，尘境就显现出来。说明阿赖耶识可以变生六尘，又可以变生六识，六识才能取得六尘。从阿赖耶识上能产生受，从感受上就会有觉知，有觉知就能现相。比如阿赖耶识把声音传送过来，根尘相触生耳识，耳识闻声有受，有受就要感觉，声音就在耳识上显现出来。因为有鼻识，香尘才能被了别到，才能显现出来。从觉有法，因为有觉知，才有六尘法的出现，法代表六尘，觉就代表六识。</p><p>六识的觉知，就是眼识能看、耳识能听，鼻识能嗅、舌识能尝，身识能觉，意识能知，这叫觉。从眼识上有什么法显现出来？有色尘显现出来，没有眼识你能知道有色尘吗？眼识取了色尘，色尘就显示出来了。比如说有眼识才能取桌面上的杯子相，没有眼识能不能取到这个杯子相？那就不知道有杯子了，只有眼识的出现才能了别杯子，眼识就取了杯子的相，这就是眼识取色尘。</p><p>再比如，因为有耳识能听到声音，耳识就把声尘取过来了，没有识能取得了吗？这个取的过程就是想的过程，一个是了知的作用，再一个是取相的作用。想就是想心所，也可以叫作想蕴。想蕴先了别，了别以后，知道这个是什么，就是取了，分别后就是取相了，然后安上个名字，这是想的全部过程。有鼻识才能取得香尘，有身识就能取得阳光的温暖、饿、渴、乏等这些触尘，因为有意识取了法尘，就能了知一切法，就知道了善恶、是非、好坏。</p><p>原文：<strong>贤护。又如画工。料理壁板。诸所画处。如法端洁。随意所为。图绘众像。则工之识智。俱无形色。而为种种。奇容异状。</strong></p><p>释：贤护，又如画工在画画之前需要整理壁板，先把应该绘画的地方整理干净，壁板上面应该去除杂物和灰尘，摆放端正，以便于画画。画布整理干净以后，就可以随意绘画了，想怎么画就怎么画。画工绘画凭借的是想画画的意识心来创意和构思，有智慧的意识心是无形无色的，却能造作出来种种有形有色的秀丽山水、人物景观的奇容异状，画的意境全部都能画出来。但画工画画时能创意、构思的心，都是无形的。</p><p>原文：<strong>如是。识智无形。而生六色。谓因眼见色。眼识无形。因耳闻声。声无形色。因鼻知香。香无形色。因舌知味。味无形色。因身知触。触无形色。法入诸境。皆悉无形。识无形色。亦复如是。</strong></p><p>释：同理，阿赖耶识的智慧也是无形无色的，却能生出六种尘境：色声香味触法，就是因眼根而见色，眼识是无形的；因耳根而闻声，耳识是无形的；因鼻根而知香味，鼻识是无形的；因舌根而尝味，舌识是无形的；因身根而觉触，身识是无形的；因意根而觉知法尘，意识是无形的。阿赖耶识无形无色，也是这样。</p><p>没有阿赖耶识，六识就不能出现和了别。佛在这里也把实相的内容揭示出来了，画工的六识和阿赖耶识都无形无色，但是却创造出了种种的画境和意境。</p><p> 原文：<strong>贤护。识弃此身。受他生者。众生死时。识为业障所缠。报尽命终。犹如灭定。阿罗汉识。如阿罗汉。入灭尽定。其阿罗汉识。从身灭转。</strong></p><p>释：贤护，阿赖耶识把此世的色身弃舍了以后，又会到下一世的色身上去，接受下一世的色身（他生就是另一生）。众生死亡的时候，阿赖耶识被七识所造的业行业障所缠裹着，这一期的果报尽了，到临命终时，阿赖耶识就舍弃了众生身，与灭尽定里阿罗汉的六识一样，当阿罗汉入到灭尽定里时，六识就从色身上消失了，众生死时阿赖耶识也是从色身上不见了。</p><p>原文：<strong>如是死者之识。弃身及界。乘于念力而作。是知彼如是。我某乙生平。所作事业。临终咸现。忆念明了。身之与心。二受逼切。</strong></p><p>释：众生死亡时也是这样，阿赖耶识舍弃了众生的色身和十八界，阿赖耶识舍身是随着意根的念力而为，配合意根的思心所的功能作用而为。这时亡者就知道自己这一生结束了，这一生所做的事业在临终前的一刹那，全部都出现在脑海里，一一都能回忆得出来，尘境清晰明了，同时身心都会感受到痛苦逼切。</p><p>在意识还没有消失的时候，身之与心二受逼切，身和心都非常的痛苦。身体的痛苦是因为四大分解，心的痛苦一是因为对生命的绝望，二是因为与亲人的别离，三是因为不能再贪爱世间了，因此身心受到痛苦的煎熬。</p><p>因为死者一生造的业行，业种留存，临终时阿赖耶识就会随着业种，而转到下一世。如果他造了畜生业，就会被畜生业所缠缚，阿赖耶识就会接受畜生色身；如果他造了饿鬼业，就会被饿鬼业所缠缚，阿赖耶识就会到饿鬼色身上去，他这一生所受的果报就结束了。命终时，阿赖耶识就会像灭尽定里四果阿罗汉的六识一样，舍弃色身而离开了。</p><p>阿罗汉修完四禅八定，入灭尽定时，前六识都灭，剩一个第七识和阿赖耶识，第七识的五遍行心所法，灭掉了受心所和想心所，第七识意根就没有受的心所和想的心所，没有了知的功能，还有作意、触和思三个心所，还能对阿赖耶识现起的根身器界作意，色身上的状况祂还是能作意、能触，然后生起思心所，能作决定，比如说生起决定心，祂要想把六识现起来出定，或者祂想把色身都灭了入涅槃，这些都由意根的思心所决定。众生死亡时阿赖耶识离身，与灭尽定里阿罗汉六识离开的情况是一样的。</p><p>临死的人前六识灭去的时候，意根了知到，同时观察色身的情况，知道是不能再用了，没有指望了，思心所就决定离开色身，重新寻找色身，阿赖耶识也随顺意根慢慢离开色身，二者一起离开。如是死者之识把色身和十八界都弃舍了，是乘于意根的念力作用，因为这一切作为都是意根驱使的，受意根的思心所指挥。</p><p>之后意根还想投胎拥有一个色身，阿赖耶识随顺意根此念力，或者出生中阴身供其使用，或者是直接上天受生。意根不想灭去自己，因为祂没有断除对自我的执着性，总想让自己继续存在，有另一个五阴身可以再次使用，阿赖耶识就随顺祂，现起中阴身，这是乘于意根的念力而作。临命终时，意根的一切念力都消失，阿赖耶识就没办法再输出五蕴十八界的种子，五蕴十八界就逐渐灭去了，意根也灭去了，就无余涅槃了。一般凡夫众生临死的时候，意根也决定离开色身，念着还要投胎到下一世五阴身中，阿赖耶识也随顺现起中阴身，这是乘于意根念力而作。</p><p>众生临死亡时，知道自己的一生就这样结束了，一辈子所做的善恶所有事业，全部都显现出来，忆念得清清楚楚，丝毫不错乱，这是意识心中所现起的回忆。这个时候众生还没有咽气，人在要走之前，这一辈子的全部过程，像放电影一样，快速闪过，意识心就知道自己这一辈子都做了些什么，要到哪里去，是要生到善道，还是要生到恶道，他都知道，之后意识心就灭了。意根知道没有什么指望，就离开色身了，带着对自我的执著和贪爱，于是就出现一个中阴身。</p></div>"
},{
    "title": "第三章 阿赖耶识之事用云何而显 第一节 阿赖耶识迁身如面现于镜子上",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  阿赖耶识之事用云何而显</strong></p><p><strong>第一节  阿赖耶识迁身如面现于镜子上</strong></p><p>原文：<strong>贤护。识是何义。识名为种。能生众类。杂报身牙。知觉想念。同苞于识。知苦知乐。知恶知善。及善恶境。故名为识。 </strong></p><p>释：贤护，识是何义？识名为种，是种子识，是含藏种子的心体，含有众生业行的种子和出生五阴世间的本有种子，阿赖耶识依种子而能出生众生种种杂染业报身。知性、觉性、念性和想性也同时含苞在阿赖耶识识体中，六识出生后才能知苦知乐、知恶知善，以及知各种善恶境界。因为包含这些杂染种子，所以此识才叫作阿赖耶识。</p><p>因为阿赖耶识里含藏有五阴身的种子，祂才能出生五阴身芽，种子就是出生义，能出生所有一切种类的业报身，什么果报都有，因为什么业都造过。身芽是指身根的芽，一般是指在胚胎中的身根，同时众生的知性、想性、觉性、念性的种子也含苞于阿赖耶识当中，心体当中的识种子输送出来，众生就有知性、想性、觉性、念性，这些心识的作用出现，就知苦、知乐、知好知坏、知善恶境。知性都是六识的知，不是指阿赖耶识的知，阿赖耶识不知苦、不知乐、不知善、不知恶、不知善恶境界。这两种识性容易混淆，我们读经的时候，要分清经里所说的识是指六识还是指阿赖耶识，才能正确理解经义。</p><p>原文：<strong>如汝所问。云何识离此身。而受余报。</strong></p><p>释：就像你所问的那样，阿赖耶识是如何离开色身，而去受下一世果报身的？</p><p>六道众生的色身都是果报身，四种圣人的色身也是果报身，只不过是善报身。而阿赖耶识本身不受果报，是祂所变起的六识身受果报，阿赖耶识只是去变现和承载众生的果报，实际上还是意根受果报，但是意根不感觉身体触觉的那种苦和乐，只有精神方面的苦乐受。如果是六识心受报，六识心在临终时灭了，下一世的六识心是新的，原来的六识受不到果报，阿赖耶识更不受果报，祂没有苦乐受，也完全是舍受，祂也不会去当畜生、恶鬼、人和天人等等，祂什么都不当，所以不受报。</p><p>天人等六道众生是谁做的？是意根做的，但是意根不知身的苦，不知身的乐，六识才有身心两方面的苦乐受，才有恶报，因此受报的还是六识。但六识临终就灭了，下一世又是新的六识，原来的六识造业以后不受报。那有没有真正受果报的报主呢？其实是没有真正受报的人，一切法都是虚妄的，万法都是这样的虚妄，没有真实性。当我们感觉到得失的时候，应该分析思惟，到底有没有得和失的这个人，有没有真正的得和失，都没有，没有得失的主体，一切法都是这么虚妄。</p><p>就如我们平常说的赚钱，赚钱是谁赚，是谁得钱？如果说是色身得钱，色身如木头，本身不能动，又不能享受，怎么能得钱？如果说是六识得钱，六识无形无相，又刹那生灭，怎么赚钱得钱？如果说意根赚钱和得钱，意根却什么事也不能做，都靠六识做，意根也不享受，都是六识享受，第八识更不会赚钱和得钱了。如有人每月得几万元，是怎么得的呢？什么才叫得？身体得吗？经过反反复复观察，也找不到赚钱和得钱者。</p><p>反过来说，当我们失去东西的时候，仔细思惟一下，到底是谁失去，其实并没有失去者，没有得失者。诸法都是因缘生，各种因缘和合在一起，一个虚妄相就生起。万法也是由于因缘而灭，各种因缘逐渐散去，一个虚妄相就消失不见了。没有一样是真实的法，但是我们却把这一切都当成了真实的，然后在这些法里痛苦、欢乐、造业、受报，那受报有真实的受报人吗？其实也没有真实的受报人。</p><p>原文：<strong>识之迁身。如面之像。现之于镜。如印之文。显之于泥。譬如日出。光之所及。众闇咸除。日没光谢。闇便如故。闇无形质。非常无常。能得其处。识亦如是。无质无形。因受想显。</strong></p><p>释：阿赖耶识舍弃现在这个色身，而迁到下一世的色身上去，就像一张面孔从镜子里显现出来一样。阿赖耶识犹如镜子，面相比喻另一个色身，下一世的色身被阿赖耶识显现出来，就像印文在印泥上显现出来一样，阿赖耶识犹如印泥，色身犹如印文。譬如太阳出现，光明所照之处，所有黑暗全部消除，太阳落下，黑暗便如前现起。黑暗并无形色和质碍，既不是常也不是无常，没有一个真正的处所所在。阿赖耶识也像黑暗一样，没有质碍，没有形色，因众生的受想心所出现，就能显现出阿赖耶识的作用。</p><p>佛把阿赖耶识比喻为镜子、印泥和黑暗，阿赖耶识无形无相，犹如黑暗一样没有形象；阿赖耶识犹如能显示出面相的镜子，色身五阴就如面相，显现于阿赖耶识心中；阿赖耶识如印泥，印泥就相当于阿赖耶识，色身五阴就像印文显现于阿赖耶识印泥上，印文全部是印泥，印泥却不全部是印文，色身五阴全部都源自于阿赖耶识，但阿赖耶识却不是五阴身。</p><p>阿赖耶识犹如太阳光，色身犹如黑暗，黑暗因于太阳光或隐或现，色身因于阿赖耶识或灭或生。太阳光一出来，凡是太阳光所照到的地方，所有的黑暗都没有了，黑暗跑到哪里去了？没有来处，也没有去处。比如房间里本来是黑暗的，一开灯，灯光所照之处黑暗就没有了，黑暗跑到哪里去了？没有真正的黑暗，只是一种假相罢了，太阳光下去以后，黑暗又像原来一样现出来了。黑暗没有形，也没有质碍，是空的，手摸不到它，身触不到它，它不是常也不是无常，没有一个真正的处所所在。同样的，阿赖耶识也无形无相，无有质碍，不能眼见，不能手摸，众生受觉和念想出现时，就把阿赖耶识烘托出来了。</p><p>想就是了别性和取相性，众生受想出现之后，在受想上，就显出阿赖耶识的功用，也就是在五阴上能显出阿赖耶识的作用。阿赖耶识虽然无形无相，但在有形有相的五阴身上运行，就能显现出阿赖耶识运行的行相。</p></div>"
},{
    "title": "第二节 阿赖耶识的行相",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p/><p><strong>第三章  阿赖耶识之事用云何而显</strong></p><p><strong>第二节  阿赖耶识的行相</strong></p><p>原文：<strong>识在于身, 如闇之体。视不可见, 不可执持。如母怀子, 不能自知。是男是女。黑白黄色。根具不具。手足耳目。类与不类。饮食热刺。其子便动。觉知苦痛。</strong></p><p>释：阿赖耶识在五阴身上就像黑暗一样，无形无色，用眼睛看是看不见的，要想把捉祂，也把捉不住，要想碰触祂，也碰触不到，根本执持不了祂。这是形容祂的无形无相，却能在万法当中显现出来的特性。就好比母亲怀孕时，自己却不知道怀的孩子是男还是女，肤色是黑色、白色还是黄色，也不知道六根具足还是不具足，手脚眼耳相貌是否像自己。</p><p>因为过去那个时代没有检测设备，怀孕时没法检测出胎儿是男是女，色身相貌也都不知道，有没有手足、眼睛与耳朵，长得像不像自己等等都不知道。然而母亲在吃饭时，如果吃热饭，孩子受到热的刺激，便在母胎里乱动，胎儿怕热，而孩子一动，母亲就觉得非常疼痛。母亲如果要吃凉的东西，孩子也受不了，也会乱动，母亲也能感觉到痛苦，这时母亲就知道孩子活动了。</p><p>原文：<strong>众生来去。屈伸视瞬。语笑谈说。担运负重。作诸事业。识相具显。而不能知。识之所在。止于身中。不知其状。</strong></p><p>释：当众生的五阴身来来去去，弯腰伸腰，眼目顾盼，语笑谈说，担水运柴，身体负重，作一切事业的时候，阿赖耶识的相貌就全部显现出来了，可是众生却不知道阿赖耶识在何处运作，阿赖耶识居止于身中，众生也不知道是何状态，犹如怀孕的母亲不知其子一样。</p><p>胎中子比喻为阿赖耶识，母亲比喻为众生五阴。阿赖耶识无形无相，众生不知道祂是什么样貌，但是五阴运作的时候，就知道阿赖耶识现前了，这样一个禅宗公案就出来了，阿赖耶识很容易证得，明心相当快，猜想推测出来的不算，必须是定中参究，不要有意识的思惟活动。阿赖耶识在众生身中，但不知道是什么样的一种状态，一般知见不具足的时候，只知道阿赖耶识在各处都起作用，但祂究竟在何处起什么作用却都不知道，这时离证悟还有一段距离，还需要继续努力。</p><p>这部经几乎都把阿赖耶识很明白的表露出来了，再参禅参公案时，那就很容易参出来，参禅其实不难，就是定力不足，福德各方面的因缘条件不足，证悟就显得难一些，解悟是相当容易的。参禅的方向以前抓不到，现在学大乘显识经这段内容，就能很清楚，阿赖耶识从来不离五阴，真法不离假法，当然假法也不离真法，在假法的运作上就有真法的显现。这个参禅的方向是很明确的。而有些学佛人参禅一参就是三十年，到死时还是不知道往哪个方向参，不懂得如何取证阿赖耶识。</p><p>这几句如果要细致讲解出来，那一般的禅宗公案就能看懂了，但是虽然能看懂，里面阿赖耶识实际的运作还是不知道的话，也仅仅是解悟，不是真正证得。还需要不动意识心的去仔细参究，把阿赖耶识具体的运作情况参究出来，这才是证悟，意识猜测和臆想出来的不算。参禅参出个大概情况，具体运作不知道，不知道细节，最多是解悟。证悟之后，智慧马上就提升，解悟的智慧永远是原地踏步。</p><p>原文：<strong>贤护。识之自性。遍入诸处。不为诸处。之所染污。 </strong></p><p>释：贤护，阿赖耶识的自性，遍入一切处，遍入六根与六尘之十二处之中，并且不被十二处的法所染污。</p><p>六根触六尘处就是：眼见色处、耳听声处、鼻嗅香处、舌尝味处、身觉触处、意思法处。阿赖耶识在六根触六尘处，赫然显现，这里就不详细说了，留点秘密自己参究，以增智慧。阿赖耶识入十二处中，却不被十二处所染污，那就是说众生眼见色时，阿赖耶识不为色尘所染污，看见美色的时候不起喜念，不生贪爱，看见丑色，不生厌恶心行，心不被这些色尘所染污；众生闻声时，听见赞美的声音，阿赖耶识也不高兴，听见咒骂声，阿赖耶识也不起嗔恚，心不被声尘所染污；众生鼻嗅香的时候，遇见香味阿赖耶识也不喜欢，遇见臭味，祂也不厌恶，不被香臭所染污。</p><p>在六根触六尘的时候，阿赖耶识永远都不受染污。为什么这样呢？因为阿赖耶识所接触的并不是世俗界的六尘，祂听不见世俗界的声音，所以骂声对祂不起什么作用，赞美对祂也不起什么作用；祂不见世俗界的色，你拜祂，祂也不高兴，对祂瞪眼，祂也不生气，所有一切法对祂来说，都无所谓，所以祂不被染污。如果阿赖耶识像六识一样，能接触到世俗界的六尘，肯定也会被六尘染污了，因为六识能分别善恶美丑，是非好坏，喜厌心很容易生出来，阿赖耶识不能分别善恶是非美丑大小长短，所以祂不会生起喜乐心和厌恶心，不被六尘染污就是因为不分别六尘的具体内涵。</p><p>原文：<strong>六根六境。五烦恼阴。识遍止之。不为其染。由此而显。识之事用。</strong></p><p>释：阿赖耶识还居止在哪里呢？在眼根、耳根、鼻根、舌根、身根、意根六根处都有阿赖耶识隐藏执持着，如果没有阿赖耶识的摄持，这几根就灭了。色声香味触法六境上都有阿赖耶识隐藏执持着，如果阿赖耶识不摄持六尘境，色声香味触法就消失不存在。</p><p>五烦恼阴就是五受阴：色受阴、受受阴、想受阴、行受阴、识受阴，阿赖耶识更是普遍地居止于五受阴之中，否则五受阴就不能存在，也就没有众生了。阿赖耶识普遍的居止于六根六尘和五阴身中，却不被这些法所染污。由五阴、六根、六尘处的作用，就显示出了阿赖耶识的事用，这叫日用。日用而凡夫不知，知了就不是凡夫。阿赖耶识刹那刹那都在六根六尘六识上运作，在五阴身上运作，众生却不知道，这就是无始无明。</p><p>原文：<strong>贤护。如木机关。系执一所。作种种业。或行走腾跃。或跳掷戏舞。</strong></p><p>释：贤护，阿赖耶识就像是木头做的一个机关，给它放在一个处所，让它做种种事业，或飞行走动、腾空跳跃，或上下跳跃、唱戏舞蹈。</p><p>这本来都是五受阴所做的事情，木头制作的机关做种种事，就与五阴身做事是一样的，五阴身就如木头机关一样，所做的事都是按照程序设计的，木头机关不是自在的，五阴身就是不自在的。比如说机器人，或者冼衣机之类的，让它作一些力所能及的事情，给它设置好程序，通上电，木人机关、机器人等等就开始运转了。其实不是木人和机器人能运转，是背后人为操控的结果。同理，阿赖耶识也在不断地运转着，祂一运转，众生五阴就随之运转起来了，五阴是怎么运转的，佛在这里都说明白了。</p><p>原文：<strong>于意云何。机关所作。是谁之力。贤护白佛言。智慧狭浅。非能决了。</strong></p><p>释：贤护，你怎么想呢？木人机关所作的事业，是什么力量推动的？谁是那个机关的按钮？贤护菩萨说我的智慧狭隘浅薄，对于这件事无法决断。</p><p>如果佛在这里再说明白一点，我们就不用参禅了。比如冼衣机，一按按钮，它就开始动转了，电灯一按开关，电灯就亮了，机器人一按按钮开关，机器人就开始工作了，电动娃娃一按这个按钮，它就开始唱歌跳舞了。</p><p>原文：<strong>佛告贤护。当知皆是。作业之力。作业无形。但智运耳。如是身之机关。以识之力。作诸事业。仙通乾闼婆。龙神人天。阿修罗等。种种趣业。咸悉依之。识能生身。如工作机关。</strong></p><p>释：佛告诉贤护菩萨说：木人机关所做的一切事业，都是一种作业的力量操作出来的，而这种造作的力量是无形无相的，只是以智慧的形式让木人运转起来，成就了木人的事业。众生的色身也像木人一样，身体的机关运转，也与木人机关运转的原理一样，是用一种识心的智慧之力让机关运转，作种种事业的。色身机关运转是以阿赖耶识的力量，使得色身作诸一切事业。有神通的仙人、乾闼婆、龙、神、人、天、阿修罗等等，种种六道众生所作的事业，全部依阿赖耶识而有。</p><p>阿赖耶识能产生色身，就像能做工作业的机关一样，，就像机器人与冼衣机的工作原理一样，一按按钮就运转了。这一切的事业，就是五阴的事业，包括所有的身口意行。业，代表业行，不是指世间法的创业与事业。凡是五阴的运作，就叫事业。</p><p>原文：<strong>识无形质。普持法界。智力具足。譬如日光。恶业众生。及诸不净。死尸臭秽。无偏等照。不为诸恶。之所污染。识亦如是。虽处猪狗。食不净类。诸恶趣身。而不为彼。之所染污。</strong></p><p>释：阿赖耶识无形无质，无色无相，但能普遍地执持一切法界，智慧力具足。譬如日光，遍照一切法，恶业众生以及所有不净者，死尸臭秽之处，全都普遍而平等的照耀着，日光从来不被恶秽之法所染污，不被恶秽所熏染。阿赖耶识也像日光一样，普遍执持一切法，虽然处于猪狗身中，帮助猪狗食肮脏不净的食物，投身于三恶道恶业众生身中，却不被恶业众生以及恶业果报所染污。</p><p>所说的法界是十法界，是四圣六凡法界，再加上六根六尘六识十八界，一切法都由阿赖耶识执持。阿赖耶识智力具足，善能运用一切种子，造就一切法。譬如日光，不管是恶业众生，还是所有不干净的东西，死尸臭秽的东西，日光都普遍照耀着，一点不偏护，普照一切。阿赖耶识也像日光一样，没有选择，遇到什么缘，就出生和执持什么法，不偏不倚，不管什么业种的众生祂都能出生，不管什么果报，祂都能实现，不管什么恶劣的环境，祂都能制造出来，甚至是大粪与死尸，祂都能出生和执持。</p><p>而且阿赖耶识不为一切恶法之所染污。出生恶人和恶行，却不被众生的恶心恶行所染污，出污泥而不染，处幽兰之室而不沾香。阿赖耶识虽然处在猪狗身上，又与猪狗同吃肮脏的饮食，处三恶道恶趣身，不被恶业所染污。祂不会像猪狗一样的愚痴，不会像饿鬼一样的贪吝，不会像地狱众生一样的嗔恚，虽然这些众生都是祂所变现出来的。</p></div>"
},{
    "title": "第三节 阿赖耶识迁身犹如风大",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong/></p><p>第三章  阿赖耶识之事用云何而显</p><p><strong>第三节  阿赖耶识迁身犹如风大</strong></p><p>原文：<strong>贤护。识舍此身。随善恶业。迁受余报。譬如风大。出深山邃谷。入于薝卜。众香之林。其风便香。经于粪秽。死尸臭恶。秽污之所。其风便臭。</strong></p><p>释：贤护，阿赖耶识在众生临终的时候，舍下此色身，随着众生所造的善恶业，迁转于下一世色身中，让五阴再受剩余的果报。譬如风大出过于深山邃谷而飘入到薝卜树香树林中，风中就带有薝卜树的香味。风大经过粪秽、死尸、臭恶的污秽之处，风中就带有肮脏的臭秽之味。</p><p>众生的身口意造作出来，刹那刹那的身口意行就作为业种，被阿赖耶识收存下来。等到临命终的时候，这一生所造的善恶业，全部显现出来，意识心在很短的时间内，就把这一辈子所造的善恶业全部都了别了，内心就清楚自己即将要到哪里去了。然后阿赖耶识依据业种，变生下一世的色身，阿赖耶识就随着善恶业种，迁受余报到另一个色身上，让众生受报去了，善业强就受善报，恶业强就受恶报。</p><p>阿赖耶识比喻为风大，香味比喻为善业。风大从深山邃谷中出来，入到一个薝卜香林中。薝卜树是香树，有香味，风吹进林中来，就挟带着香味又出去了。这是比喻阿赖耶识在众生身中，把众生所造的善业带走了，带到下一世的色身上去了。那下一世的色身就随着善业受善报，果报身就生出来了。</p><p>当风大经过粪秽、死尸、臭恶、秽污之所时，风大就挟带着那些臭味，飘到其他处所。臭味比喻众生造的恶业，众生造恶业，阿赖耶识在众生临命终时，把恶业种子带到另一个色身上，迁转恶业种子到下一世五阴中，众生的恶报就现前。但是善恶业不是阿赖耶识造作的，是众生自己的七识心造作的，阿赖耶识只不过是随顺着而已，然后把业种带走，实现善恶业报。佛说的风大的比喻非常适当，风大本身没有香臭味，所裹挟的都是各处的物质上的味尘，同理，阿赖耶识没有业也不造业，所带的都是众生五阴身造业的种子。</p><p>原文：<strong>若风香臭俱至。风则香臭并兼。盛者先显。风无形质。香臭无形。然风持香臭。迁之于远。</strong></p><p>释：如果不管是从香处还是从臭处，风大都经过了，那么风大就既带着香气也带着臭味。要看哪个味浓，哪个势力大，就显现出哪种味尘，或者是混杂的味尘，或者有的时候是香味，有的时候是臭味，那就不一定了。</p><p>佛把阿赖耶识比喻为风，确实很恰当，善恶业比喻为香臭味也很恰当。有香味或者臭味的地方风大都经过，然后就带着香和臭两种气味。并兼就是一起全部挟带着，盛者先显，就是哪个势力大，就显哪种味尘。</p><p>原文：<strong>识弃此身。持善恶业。迁受余报。亦复如是。犹彼风大。持物香臭。至于他所。</strong></p><p>释：阿赖耶识也如风大一样，随顺着意根，善业和恶业都配合着去造作，种子都收留下来，临终带着善恶业种到下一世的五阴身中，临终看善恶业哪个业重，就随重业去受报。</p><p>为了避免到三恶道受苦，那我们在平时以及到晚年时，就应该修大善业，赶快忏悔恶业。忏悔过后，临终之前，内心里都要意念自己这一辈子所做的善业。如果善业不足，就要再做善业弥补，再发清净大愿，让这个愿力大于恶业业力，自己就能暂时逃脱恶业的果报。如果总是善业大于恶业，善业的缘总是先成熟，恶业的缘总是先隐藏着，那未来恶业业种就不一定是什么结果了，也许就能消失，有些小恶业埋藏时间长了，业种就慢慢的枯萎不显现出来了。</p><p>风大无形无色，裹带的香臭味也没有形质，但是风却能裹挟着香臭味飘到远方。吹得越远，气味就越淡，在漂移的过程中气味要一点点地散发掉，因此风飘得越远气味越淡。阿赖耶识本身也无形无相，善恶业种本身也无形无相。业种如果有形有相，就不能存在于无形无相的阿赖耶识里，那会把阿赖耶识弄成有相的了，事实上这是不可能的。</p><p>阿赖耶识弃舍要灭亡的色身，带着善恶业种，迁移到另一个色身上，受余下的果报。迁就是改变，流转到另一个色身上，让另一个色身来受报，也像风一样。阿赖耶识带着善恶业让另一个色身受报，也像风大裹携着物体上的香臭味飘到远方一样。</p><p>原文：<strong>又如人梦。见众色像。种种事业。而不自知。安眠而卧。福德之人。命尽识迁。亦复如是。安隐不觉。如梦迁化。无所恐惧。</strong></p><p>释：又比如说一个人在做梦时，梦见种种的色相，还梦见自己做了种种的事业，事业就是身口意造作的业行，这个人却不知道自己躺在床上在睡觉。有福德的人，在临命终阿赖耶识迁走时也是这样，就像做梦一样，忽悠一下就到另一个色身里去了，严格来说，是阿赖耶识在意识不知不觉的情况下变现出了另一个色身。作善业福德大的人，在命终阿赖耶识离开时，意识没有痛苦的感觉，安详而逝，直接升天享福，没有经过中阴身，就像做梦一样，一点恐惧也没有，到了天上就知道自己当天人了。</p><p>临死之前，这一辈子所造的善业恶业也都能显现出来，一闪而过，他就知道自己要升天享福去了。福德大的人，临终的时候没有痛苦，没有挣扎，阿赖耶识离开色身的时间比较短，如梦迁化，无所恐惧，安祥自在地就升天了。前面说造恶业的人，临终有恶相出现，手脚乱动，眼睛翻动，那是恶相，眼睛、色身都不自由，与大福德造善业的人往生截然不同。</p><p>原文：<strong>识之迁出。不由喉口。及诸窍穴。莫测所从。莫知径户。</strong></p><p>释：大福德之人，阿赖耶识离开色身时，不从喉咙口及身上任何一个窍穴离开。大福德的人，阿赖耶识离体，不知道从哪里出去的，也没有具体的处所。</p><p>窍穴是指眼耳鼻口大小便处，这些都是窍穴。众生临命终时，阿赖耶识从色身出去的处所不一样，表明往生之处不同，从喉咙这里出去有可能是要投生人中，因为喉咙口和心脏离得比较接近；从膝盖出去是去畜生道，从脚心出去是投生地狱，从肚脐出去是投生恶鬼，从胸口出去是投生人道，从额头出去是投生天道，从头顶出去是到其它的佛国土，阿修罗道从哪出去没有表示。这里说升天的人，阿赖耶识不知道从何处离体，说明善业的人，是不知不觉死亡的，没有痛苦。</p></div>"
},{
    "title": "第四章 识入胎中入香入油",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  识入胎中如香入油</strong></p><p>原文：<strong>尔时贤护胜上童真。顶礼佛足。白佛言。世尊。鸡鹅等子。其卵未熟。周匝细密。识从何入。子死卵中。卵壳不破。无隙无窍。识从何出。</strong></p><p>释：这时贤护菩萨顶礼佛足，对佛说：世尊，阿赖耶识能入到色身里，那么鸡蛋与鹅蛋要孵化出小鸡仔、小鹅仔，当还没有孵化出来的时候，鸡蛋和鹅蛋严严实实的，蛋壳周围细密，一点缝隙也没有，阿赖耶识是如何进入到蛋里去的呢？</p><p>其实在蛋形成之前，阿赖耶识就已经进入受精卵里了，没有阿赖耶识就没有蛋。阿赖耶识是如何进入蛋里的，是通过孔隙进入的吗？不是那样的，即使阿赖耶识进入到鸡蛋里了，孵化到一半，孵化不出来了，胎儿死了，蛋壳没有破，那么阿赖耶识是如何出来的？阿赖耶识的无形无相与风的无形无相还是有区别的，风是色法，尽管看不见摸不着它，也仍然是色法，色法就有阻碍，进入不了无缝的蛋里。</p><p>而阿赖耶识不是色法，不受任何法的制约，不在色法里，不在色法外，也不在色法的中间，对于色法来说那就没有出没有入，不出不入、不来不去的那种出入形式，我们一般人想象不出来。虽然风也是无形无相的，但风有来有去，有出有入，风是四大组成的。实际上风还是有形有相的，风吹到身上会有感触，有觉受，但是阿赖耶识进入到身体里是没有感觉的，而且是阿赖耶识形成的身体，阿赖耶识在身体之先。</p><p>我们看到的每一种物质都是由四大组成的，没有单独的一大。比如水，水也不是由水大种子单独组成的，水有杂质是地大成分，水有温度是火大成分，水有缝隙是空大成分，水有流动性是风大成分。土地也是由四大组成，土地有温度是火大，土地有缝隙是空大，土地有湿度是水大，土地坚硬的部分是地大。燃烧的火，也是由地水火风四大组成的。</p><p>原文：<strong>佛言贤护。譬如乌麻。薝卜花熏。其油香美。名薝卜油。与凡麻油。好恶殊隔。油先无香。以花熏种。油遂成香。</strong></p><p>释：佛对贤护说，譬如乌麻，用薝卜花来熏它，然后再榨取出油，其油就香美，给这种油取名为薝卜香油，它与一般普通的麻油，好坏差别非常大。油原来是没有香味的，用花熏过以后，这个油就变成有香味的了。</p><p>如果用薝卜花熏，普通的油就变得非常香而贵重，如果不用花熏就是普通的麻油。乌麻能压榨出油，薝卜花有香气，用薝卜花来熏乌麻，榨出的油就有香气了。本来叫乌麻，给这种油一熏，就变成薝卜油了，那个香味是怎么进入到油里面的？</p><p>原文：<strong>香不破麻而入。亦不破麻而出。复无形质。留止油内。但以因缘力故。香迁油内。油成香泽。鸡鹅子识。入出于卵。亦复如是。如薝卜香。迁于油内。</strong></p><p>释：花香并没有把乌麻破开，就钻到乌麻里面了，花香也没有把乌麻打破钻破，就从乌麻里钻出来了。香味没有进也没有出，也没有破坏乌麻，香味也没有把形和色留在油里，但是压榨出的油就有香味了。</p><p>这就好比阿赖耶识没有把蛋壳打开，既没有进入蛋壳里也没有从蛋壳里出来，就这样执持了鸡蛋和鹅蛋，这和用香味熏乌麻是一个道理。都是因为各种因缘聚合之力，才有如此殊变，香迁入了油内，油就有了香泽。以这种因缘性，它俩和合在一起互相熏，所以乌麻油就变成有香味的油了，香迁往油内，油就变成香油。阿赖耶识入出鸡蛋鹅蛋也都是有因缘的，因缘具足，阿赖耶识就入到鸡蛋鹅蛋里，因缘灭后，阿赖耶识就从鸡蛋鹅蛋里出来了。</p><p>众生出生的因缘具足了，阿赖耶识就可以变现出众生的五阴身。有因有缘，世间法里的鸡蛋与鹅蛋就破壳，鸡鹅就孵化出来了，因缘灭了，世间法里的鸡蛋与鹅蛋就毁坏，里面就没有生命力，阿赖耶识就不亲自执持鸡蛋与鹅蛋了。那么鸡蛋与鹅蛋也就不能独立于阿赖耶识而存在，而没有生命的鸡蛋是由共业众生的阿赖耶识所共同执持的。鸡蛋里有生命的时候，是这个蛋里的单个的阿赖耶识单独执持着这个鸡蛋，所以这个蛋才有生命。当阿赖耶识从鸡蛋里出来以后，鸡蛋就变成了共业众生阿赖耶识所共同执持的，还是唯识所变，唯心所现。</p><p>原文：<strong>识之迁运。如日流光。如摩尼照。如木生火。</strong></p><p>释：阿赖耶识的迁运与入出，就像太阳光照耀万物一样，太阳光无形无相，而能让万物有光泽和温度，太阳光如果灭去，万物马上就失去光泽和温暖。阿赖耶识也同样能让众生有生命活动和失去生命活动。阿赖耶识的迁运，就像摩尼珠照物一样，摩尼宝光无形无相，却能让物有宝光之色，阿赖耶识迁到色身上，就能显现出色身。阿赖耶识的迁运犹如木头生火一样，木头点燃，火就出来了。木头里没有火，由于因缘，火就出现了。阿赖耶识亦复如是，由于业的因缘，迁运到另一个色身中，色身就出生了。</p><p>原文：<strong>又如种子。种之于地。体化地中。芽苗茎叶。备显于外。生白不白。赤等杂色。种种之花。种种力味。成熟所为。种种差别。同一大地。等资四大。各随其种。所生便异。</strong></p><p>释：阿赖耶识的迁运，又好比种子种在地里，种子全部化在大地里，植物的芽、苗、茎、叶就生出来，完全显现于土地之外，生出各种色彩的杂色之花。然后结出果实，种子不同，果实不同，其味各异，都是种子成熟以后所生长出来的。同样的大地，提供同样的四大物质养分，随其种子的不同，所生果实就有种种的差异。</p><p>种子进入土壤里化入地中以后，就找不到了，种子去哪里了？芽苗茎叶又从哪里出来的？当芽苗茎叶全部长出来以后，种子更消失得无影无踪了，种子去哪里了？这一切现象的出生和消失，都有一定的因缘性。阿赖耶识入到鸡蛋与鹅蛋里，也是这样有因有缘，于是鸡蛋鹅蛋形成，又孵化出鸡和鹅。阿赖耶识迁运到一个众生的身体当中，不管是鸡蛋也好，鹅蛋也好，胎生的生命也好，化生的生命也好，就像太阳把光明照下来一样，就像摩尼珠以其光辉照万物一样，又像木头能生火一样。</p><p>又如种子种在地中，因缘具足之后，种子消失以后，根芽苗茎叶就都生长出来了，然后又出生了种种杂色的花，花长出来以后就有了果实，果实的味道就散发出来了。因为种子不同，结出的果实也有差别。如果要找种子到底去了哪里，它是没有去处的。本来是同样的大地，大地上同样的具备地水火风四大物质，依靠四大种子的滋润，就长出了根芽苗茎叶花果实等，但是种子不一样，长出的果实也不一样。都是随着各自的种子而生成各类果实。</p><p>原文：<strong>如是一识法界。生于一切。生死之身。或黑或白。或黄赤等。淳和嗔暴。种种殊品。</strong></p><p>释：如是一识法界。生于一切生死之身。所有的色身都是有生有灭的生死色身，阿赖耶识入到其中，色身就生，阿赖耶识离开，色身就灭。众生各有各的阿赖耶识，体性相同，而出生的色身各类各样，果报却不一样。即使是同一个阿赖耶识，在不同时期出生不同的色身，果报也不相同，或者是黑色皮肤，或者是白色和黄色皮肤，其性情或者是醇和温厚，或者是嗔恚暴戾等等，有不同的品类差别。</p><p>原文：<strong>贤护。识无手足。支节言语。由法界中。念力强大。众生死时。识弃此身。</strong></p><p>释：贤护，阿赖耶识没有手，没有足，没有四肢骨节，没有言语造作，但是由于十八界中意根的念力强大，众生死时，阿赖耶识就把此色身舍弃了。</p><p>众生的五阴身是众生心念坚固的妄想所形成的，众生的念力是指意根心念的力量。意根的念有力，是因为意根能作主，有抉择力，能驱动如来藏实现意根的念想。在众生的五阴身没有形成之前，只有意根和如来藏，如来藏不会有念想，想要有五阴身，而意根因为无明不愿意灭去，必有念想，想要投胎有色身，想要享受三界的法，因此名色五阴是由于意根的念力而出现的。念力在凡夫来说，也就是业力，说明意根与业种相应，能驱使如来藏变现出五阴身，实现业报。</p><p>原文：<strong>识与念力。为来生种。即离于识。不得法界。离于法界。亦不得识。识与风大。微妙念界受界法界。和合而迁。</strong></p><p>释：阿赖耶识与意根的念力一起作为来世出生五阴身的种子，就是说，离开阿赖耶识就没有下一世的五阴十八界，离开意根的念力作用，就没有下一世的五阴十八界，而离开五阴十八界也就显现不出阿赖耶识的神秘作用。阿赖耶识与风大、微妙的意根之念界，还有受界，一起和合地迁到下一世的色身中。</p><p>众生在死亡的时候，阿赖耶识依于意根的念力，就弃舍了此身，识与念力共同出生了众生的中阴身或者是下一世的色身。因为阿赖耶识含藏着众生的业种，能出生五阴身，因此阿赖耶识也叫作种子识，意根又与业种相应，那么众生的心念力就作为业种，二者和合到一起，产生了下一世的五阴身。那就说明，没有阿赖耶识就不会有众生法界，就像没有土地就没有花果一样；离开众生的五蕴，离开众生的十八界，也不会显现出阿赖耶识的作用。</p><p>因为阿赖耶识本身无形无色，就连佛也看不见祂，佛要找阿赖耶识，也是在众生的五蕴身上发现阿赖耶识的踪迹。那我们明心见性，要如何证得阿赖耶识？也要在五蕴的活动当中寻找阿赖耶识的踪迹。如果没有五蕴，没有五蕴活动，阿赖耶识就显现不出来，要证得祂只能从五阴的作用上入手。比如我们要证得风，只能从风的作用上找到风，在风大所现起的现象上，就知道了这是什么风，那是什么风。阿赖耶识也是与风大一样不可见，只能从作用上寻觅和发现。</p><p>阿赖耶识和风大，以及意根的心念力，再加上受觉法界，和合迁移到另一个色身上。阿赖耶识迁移到下一世的色身上去以后，又出生众生的六识，受觉法界也就产生出来了，众生五阴具足。</p><p>原文：<strong>贤护白佛言。若如是者。云何世尊。说识无色。佛言贤护。色有二种。一内二外。内谓眼识。眼则为外。如是耳识为内。耳则为外。鼻识为内。鼻则为外。舌识为内。舌则为外。身识为内。身则为外。</strong></p><p>释：贤护白佛言：如果是这样的话，为什么世尊说阿赖耶识是无色没有色相的呢？佛对贤护说，色有两种，一种是内，一种是外。内是眼识，能在内部显现出色法，是智慧识别，外是眼根，在外面摄取色尘。同样的，耳识为内，在内部显现色，以智慧识别色法，耳根为外，在外面摄取色。鼻识为内，在内部显现色，以智慧识别色法，鼻根为外，在外面摄取色。舌识为内，在内部显现色，以智慧识别色法，舌根为外，在外面摄取色。身识为内，在内部显现色，以智慧识别色法，身根为外，在外面摄取色。</p><p>原文：<strong>贤护。如生盲人。梦见美色。手足面目。形容姝丽。便于梦中。生大爱悦。及睡觉已。冥无所见。夜尽昼明。人众聚会。盲者遂说。梦中乐事。我见丽人。姿容殊绝。园观华茂。人众百千。严饰嬉戏。肌肤光泽。肩髆紧满。臂长而圆。犹如象鼻。我于梦中。获大快乐。适心喜叹。</strong></p><p>释：贤护，譬如一个活着的盲人，晚上做梦梦见了美女，美女的手脚和面目长相非常的漂亮和端庄。盲人就在梦里生起了爱乐之心，醒过来以后，周围还是黑黑暗暗的一片，盲人什么也看不见。当黑夜过去，白天到来，很多人聚集在一起时，盲人就讲起了自己梦中的快乐事，他说：我梦见一个美丽的妇人，姿色容貌真是绝艳，还有一个漂亮华丽的花园，里面有百千人那么多，美女装饰华丽，在旁嘻戏游玩，肌肤很光泽，臂长而圆，就像象鼻一样。我在梦里看见美女，感觉非常快乐、舒心，而不断地惊叹。</p><p>原文：<strong>贤护。此生盲人。未曾见物。云何梦中。而能见色。贤护白佛言。唯愿开示。佛告贤护。梦中见者。名内眼所。是慧分别。非肉眼见。其内眼所。以念力故。盲者梦中。须臾而现。复以念力。觉而忆之。识之内色。亦复如是。</strong></p><p>释：佛对贤护说，这个生来就盲的人，从来没有看见过人物和景物，为什么能在梦中看见色，看见花园与美女，看见百千人众呢？贤护回答佛说：唯愿世尊开示。佛告诉贤护菩萨说：梦中所见的色，是内在的眼识所见，是智慧分别，不是肉眼所见。盲人的意识心因为意根的念力故，美女和大众能在梦中马上出现，生来就盲的人就看见了梦中的一切人和景物，然后又以意根的念力作用，从梦中醒过来，回忆梦中的一切境界。六识见内色也是这样。</p><p>佛说梦中见色，不是肉眼所见，是内眼智慧眼所见，这是指梦中的独头意识所见，不是眼识所见，所以梦中没有五识，只有独头意识单独见法尘。内眼是指意识心，是意识心的智慧性看见的，而不是眼识看见，梦里看见的色也不是眼识看见的，是独头意识所见，没有前五识一起分别色。</p><p>做梦是因为意根的攀缘和念力作用，就把梦境呈现出来了，是意根的作意受想思心所法所推动出来的。醒了之后，意根让意识回忆梦境，因为众生都是以意识的知为知，由意识处理问题，所以意识知了，才说是知，意根知而有所不知的时候，就说是不知，再者意根自己不能回忆，只能由意识回忆。阿赖耶识所呈现出的内色也是这样，是意根的攀缘性和念力呈现出来的。阿赖耶识本身无色，却能显现出一切色，包括五蕴色。</p></div>"
},{
    "title": "第五章 识生五阴如种出芽",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  识生五阴如种出芽 </strong></p><p>原文：<strong>复次贤护。身死识迁。犹如种子。弃在地中。四大摄持。苗茎枝叶。渐次迁化。识为念受。善不善等。四法摄持。弃身迁化。亦复如是。</strong></p><p>释：再次说，贤护，众生的五阴身死了以后，阿赖耶识迁走了，迁到另一个色身上，相当于把种子埋在地里一样。地水火风四大摄持种子，种子就生根发芽，生根发芽以后，苗茎枝叶就慢慢地长出来了。同理，阿赖耶识为意根的念力、受觉法界、善业和不善业等四法所摄持，舍弃色身，迁运到另一个色身上，也是如此。</p><p>原文：<strong>贤护白佛言。世尊。云何善不善法。摄持于识。佛言贤护。譬如妙颇梨宝。随所处物。若黑若白。宝色随物。成白成黑。善不善法。摄持于识。亦复如是。随所摄持。成善不善。迁化受报。</strong></p><p>释：贤护对佛说：世尊，什么叫作善法和不善法摄持着阿赖耶识？佛说：贤护，譬如妙颇梨宝，随其所接触的物品而改变自己的颜色，如果接触的是黑色的物品，妙颇梨宝就变成黑色的了；如果接触的是白色的物品，妙颇梨宝就变成白色的了。妙颇梨宝的颜色随着接触的物体不同，而显现不同的色彩。</p><p>同理，五阴身造作的善法和不善法能够摄持阿赖耶识也是这样，五阴造善业，阿赖耶识就持善业种子，显现众生善业的果报；五阴造作恶业，阿赖耶识就持恶业的种子，显现众生恶业的果报。阿赖耶识随着众生的善恶业而流转六道中，让五阴身受报。       </p><p>原文：<strong>贤护复白佛。此身云何。禀受于识。佛言贤护。此识无积无聚。亦无生长。譬如芽生。非种不变而生。亦非种坏而生。然芽生时。种则变毁。贤护。于意云何。其芽所在。止于何处。子耶枝耶。茎柯叶耶。止树头耶。贤护白佛言。不也。世尊。芽无所止。</strong></p><p>释：贤护又对佛说：这个色身是如何接受阿赖耶识摄持的？佛说：贤护，阿赖耶识自己不会造作业行，祂不积累业行，也不集聚一切法，本身也不生长不变异。譬如种子种到地里，长出了芽，植物芽的出生不是种子不发生变化而出生的，而是种子发生变化了，并且慢慢消失，芽就长出来了。植物芽的出生，也不是种子烂坏而出生的，然而芽出生时，种子就出现变化，最后毁灭消失。</p><p>贤护，你怎么认为呢？植物芽出生时，依止在何处？依止在种子上，依止在枝头，依止在茎叶上，还是依止在树头上？贤护菩萨回答佛说：不是这样，世尊，芽并不止于种子、枝叶和树头上。</p><p>原文：<strong>佛言。如是贤护。识之在身。止无处所。非眼非耳。鼻舌身等。种生芽时。如识微觉。乃至花结合时。如识有受。含开花发。时至结果。</strong></p><p>释：佛说：如是，贤护，阿赖耶识进入到众生身中也是这样，没有处所，不在色身的上下中间和里外，也不在眼耳鼻舌身处。种子出生了芽时，就像阿赖耶识觉到了众生的业种，等到树苗上有花蕾时，就像阿赖耶识入胎，接受了下一世的色身，等到鲜花开放，及至于结出果实的时候，就相当于阿赖耶识造就出了完整的色身。地水火风组成的下一世色身上，又长出了眼根、鼻根、耳根、舌根、身根。</p><p>种子改变消失，就有芽生长出来，好比一颗树，从树芽长出树干、树枝、树叶，树籽，种子早已经消失没有了，树芽不可能止于原来的树枝树干树头上。种子在生出树芽的时候，就比如阿赖耶识在色身上渐渐的长出觉性来，乃至芽生长成为大树，要开花结果的时候，比喻阿赖耶识含藏着众生的受觉，然后就生出众生的受觉。</p><p>原文：<strong>如识有身。识之生身。遍身肢体。求识所止。莫得其所。若除于识。身则不生。</strong></p><p>释：阿赖耶识入胎以后，五根长成，就生出眼识、耳识、鼻识、舌识、身识、意识，众生就有感受，这相当于种子开花结果。树开花一直到结果的时候，比喻阿赖耶识把整个色身变造完了。阿赖耶识出生色身以后，在现在的色身上也没有处所，不会住在色身的头部和四肢，也不会住在眼、耳、鼻、舌、身上。阿赖耶识从头到脚遍于色身的每一处，却找不到阿赖耶识究竟在色身的哪一处，祂在色身上没有具体处所，但是遍身肢体都有阿赖耶识的执持作用，从头到脚都是祂变造和受持的。如果离开阿赖耶识，身体马上就停止生长，并且立时毁灭，没有阿赖耶识，就没有色身的出生和存在。</p><p>原文：<strong>如树果熟。堪为将来。树之种子。非不熟者。如是报熟身死。识种便现。因识有受。因受有爱。</strong></p><p>释：就像大树上的果实成熟时，就能作为将来大树的种子，种子成熟了，将来又能长成另外一棵大树，如果果实不成熟，就不会有将来大树的种子。同样的道理，众生的业报熟了，此世色身就会灭去，阿赖耶识里的业种就现行出来，然后就会出生下一世的色身。阿赖耶识里面含藏的业种，因缘成熟时现行出来，下一世的色身就出现。因为阿赖耶识里有六识的种子，在色身上出生六识，就有六识的受。众生有感受以后，就会产生贪爱。</p><p>这就是十二因缘里的生死链条，无明缘行，行缘识，识缘名色，名色缘六入，六入缘触，触缘受，受缘爱，爱缘取，取缘有，有缘生，生缘老死忧悲苦恼。众生的善业报熟了，就应该升天，人身就会灭去，恶业报熟了，众生应该下三恶道，人身也会灭去。业报成熟的时候，不一定到老才死，也许很年轻的时候就可能死亡了。</p><p>原文：<strong>系著于爱。便生于念。识摄取念。随善恶业。与风大并。知念父母。因缘合对。识便托之。</strong></p><p>释：众生被爱所系缚，产生了种种的思想念头，于是就有了念想。阿赖耶识随顺意根的念想，随顺着善恶业种出生中阴身。在中阴身里，意根想要投胎，念于父母，阿赖耶识又在善恶业风的吹拂下，飘到父母和合处，父母业缘具足，阿赖耶识就随着意根的念投胎于母胎中，阿赖耶识便受持了胚胎。</p><p>意根在中阴身想投胎时，就随着善恶业的业种，再加上业风业缘，六识心遇到未来世的父母，看见父母在和合的时候就投奔过去。因缘具足了，阿赖耶识在这个时候投入母胎，这是中阴身阿赖耶识投胎的过程。因为众生有贪爱的种子存在阿赖耶识里，在中阴身里贪爱种子现行出来，意根被贪爱所系着，随着自己的贪爱出生了欲念，参与欲境，意根就被拘执在母胎中，不得自由。</p><p>原文：<strong>如人面影。现之于镜。非净非明。面像不现。镜明面对。影像乃现。镜中之像。无受无念。而随人身。屈伸俯仰。开口谈谑。行来进止。种种运动。贤护。影像现谁之力也。贤护白佛言。是人之力。由有面故。而有面影。影像之色。如面之色。根具不具。咸悉如面。</strong></p><p>释：就像人的面孔出现在镜子当中一样，如果镜子不干净，或者镜子不明亮，脸面部不能在镜子上显现出来。镜子干净而明亮，脸面对着镜子，面像就能显现出来。镜子之中的像，没有感受，也没有念想，却能随着镜子外边人的身体做各种动作，如弯腰伸腰、低头抬头、开口谈笑、行来进止，种种运动。镜子外边的人，无论是开口说话，举止运动，镜子里都会随着出现同样的动作和形态。佛问贤护，镜子里的影像显现出来，是谁的力量？</p><p>贤护对佛说，是人的力量。因为有人的面目，镜子上才会出现人脸的影子，影子才会出现在镜子里。镜子里脸面的色相与镜子外脸面的色相是一模一样的，镜子里的人像六根具足与不具足，和镜子外边的人的六根具足与不具足是一致的。</p><p>原文：<strong>佛言。面为影因。镜为影缘。因缘和合。故有影现。由识因故。有受想行。及诸心所。父母为缘。因缘和合。而有身现。如彼身镜。镜中之影。身去影灭。身持影像。或别现于。水等之中。识弃此身。持善恶业。迁受余报。亦复如是。</strong></p><p>释：佛说：外边人的面貌，就是镜子里面影子出现的因，而镜子就是产生影子的缘，因缘具足因缘和合的时候，影子才能显现出来。阿赖耶识是出生众生下一世受想行识五阴身的因，是显现出各识心心所的因，父母是五阴身出生的缘，这样因缘和合，就有下一世五阴身的出现。就像身体照镜子，镜子中就显现出身影一样，身体出现在镜子的前面，影子就显现在镜子上，身体离去，镜子上的身影就消失，外边的色身决定镜子当中的影像。身体从镜子前离开，停留在河水湖水前，身影再次显现于河水湖水之中，身体就是因，水和镜子就是缘，因缘具足，身影显现。</p><p>同理，阿赖耶识是因，众生的善恶业种是缘，因缘和合就产生了下一世的五阴。阿赖耶识离弃此世的五阴身，带着善恶业种，迁移到下一世的五阴身上，接受下一世五阴的果报，也像身体离开镜子到河水前一样。</p><p>原文：<strong>又如尼瞿陀乌昙婆等。种子虽小。能生大树。树复生子。子弃故树。更生新树。故树经久。质力衰微。味液销竭。干枯腐朽。</strong></p><p>释：又比如尼瞿陀、乌昙婆等印度的树，这种树种子虽然很小，可能没有指甲大，种到地里，却能长成参天大树。树长成后，又结果实，果实里又有种子，种子离开原来的大树，再埋于地下，还能生出新的大树。到最后，原来的老树，年轮太大，树质老化，生命干涸，无法再长出树种了，树的味液汁液都消尽，树干里的水分与树液也渐渐干枯了，老树就干枯腐朽了。</p><p>原文：<strong>如是诸小生类。其识弃身。乘己之业。或受种种。诸类大身。又如大麦小麦。乌麻菉豆。及摩沙等。种种子实。皆以种故。牙茎花实。生长成熟。如是由有识故。随迁生类。即便有觉。</strong></p><p>释：就如树子离树，又生新树一样，小如蚂蚁细菌等等的小生灵众生类，它们的阿赖耶识，舍弃自己的色身，带着所造过的业种，也许要接受种种大身类众生的色身，这样小畜生可能就要变成大畜生，福报可能要增加一些。越微小的畜生，福报越小，识心功能越低劣，比如蚯蚓、苍蝇、蚊子、蚂蚁，都是福报很低劣的众生，功能受限颇多。</p><p>又比如每种植物都有它们的果实，因为它们的种子的缘故，才能长出芽茎叶花和果实，最后生长成熟，比如大麦小麦，乌麻、菉豆和摩沙等等。如是，众生身上由于有阿赖耶识的缘故，随着众生的业，迁往下一世的色身当中，众生就有了新的五阴身，然后又有觉知。</p><p>原文：<strong>又如蜂止花。爱乐恋著。唼吮花味。以自资养。蜂弃此花。更处余花。或弃香入臭。或弃臭入香。随其所在。莫不自爱。恋结贪着。</strong></p><p>释：又如蜜蜂停落在花上，爱乐着花、恋着花，是为了唼吮花味，来滋养自身。蜜蜂舍弃此花，又飞到其它花上；或者舍弃香味，停落在臭味上；或者舍弃臭味，飞落在香味上。随着它们所在之处，自娱自乐，留恋贪爱种种花香。阿赖耶识也是这样，因为所持的众生的福业，获得了天人的色身，天人就享受着殊胜的乐果。</p><p>蜜蜂比喻为阿赖耶识，花比喻为五阴身，阿赖耶识从一个色身到另一个色身，但是阿赖耶识并不贪恋五阴。蜜蜂从一种花到另一种花，有香味的花，有臭味的花，唼吮花蜜来滋养自身，而有贪恋。</p><p>阿赖耶识没有果报，祂不受任何善恶业的果报，受善恶业果报的其实是第七识，第七识是连续到未来世的，果都是由第七识受。但是祂本身没有受，只有舍受，没有苦乐受，苦报还是由六识受。这一世的六识灭了，在新的五阴身上出生新的六识，由新的六识受新的果报。</p><p>原文：<strong>识亦如是。以福业故。获诸天身。受胜乐果。或弃天身。以恶业故。获地狱报。受众苦果。轮回迁转。为种种身。</strong></p><p>释：阿赖耶识也是这样，因为众生福德具足的缘故，生出天人身，众生以天人身享受胜乐的果报。福业享受完了，阿赖耶识就离开天人身，随着前世所造作的恶业，去受地狱恶报，受地狱里众多的苦果。众生就这样在六道里轮回迁流不息，出生种种的色身受种种的果报。众生轮回是依阿赖耶识里所存的业种，哪个业种先熟，众生就随着哪个业种迁流受报。</p><p>蜜蜂所留恋的花比喻为五阴身，花有香臭，五阴身有善恶业，不仅受三恶道的五阴身，也受三善道的五阴身。虽然蜜蜂爱恋着花，但是阿赖耶识并不爱恋五阴身，反倒是众生爱恋着阿赖耶识，尤其是意根喜欢阿赖耶识，意根并不知道有阿赖耶识，但是祂把阿赖耶识的功能都当成自己所有，所以才有小乘佛法讲的爱阿赖耶、喜阿赖耶、欣阿赖耶、乐阿赖耶四种阿赖耶。因为各种贪结和爱结，众生轮回千转，然后变现出种种的色身，受种种果报。</p><p>原文：<strong>识如郁金。红蓝芬陀利等。其子皆白。破其子中。不见牙花。不见异色。</strong></p><p>释：阿赖耶识就像郁金、红蓝芬陀利等各类不同的花，这些花的种子都是白色的，把它们的种子打破、剖开，既看不见花的芽，也看不见其花的色彩。但是把种子种到地去，用水灌溉，就会长出花芽；芽顺应时节因缘生长，就会开出花朵，繁荣茂盛，或红色或白色，色彩斑斓艳丽。花色与花芽都不在种子中，可是离开种子，就不会有花芽和未来的花色。</p><p>原文：<strong>种之于地。以水润液。便有牙等。顺时滋长。花果敷荣。或赤或白。种种之色。色与牙等。不在子中。然离于子。皆不得生。</strong></p><p>释：种子种到地里浇水以后，就会生根发芽，这样种子就顺着时令生长起来了，长茎、发枝、开花、结果，花果或红或白，种种色彩具足。种子里并没有花的颜色与花芽，但是通过种植种子，让种子成长，却有了花芽与花色。如果花芽与花色离开种子就不能生长了，有种子才有花的生长，如果种子变异、毁坏，就不能开花结果了。新的种子形成，种子又可以种植、结果，这样不断地轮转循回。种子不同，所开的花也不同，结的果也不同。</p><p>种子比喻为阿赖耶识，芽花比喻为从受精卵开始的五阴身。在阿赖耶识里找不到五阴身和果报，但是阿赖耶识在因缘具足时，就能出生五阴身和果报。阿赖耶识里含藏着地、水、火、风、空、识这六大种子，就能生成众生的五阴身，但是六大种子离不开如来藏里的见大种子，如来藏里的见大种子配合六大种子，这七大种子和合，就能出生众生的五阴身，还要有众生造业的业种子。地、水、火、风再加上空大，形成器世间的生存环境，形成色身，识大形成七识，众生五阴具足，果报就现前，因此众生的五阴离开阿赖耶识都不能出生。</p><p>原文：<strong>识弃身已。肉身容貌。诸根诸入。识中不见。因缘和合。识以妙视妙闻。声触味法。及以念入。知已所造。善恶等业。以取身报。如蚕作茧。自作自缠。于中迁化。</strong></p><p>释：阿赖耶识舍弃了色身以后，色身与容貌面相，眼根、耳根、鼻根、舌根、身根，以及色声香味触法，在阿赖耶识中都不存在，阿赖耶识中没有六根六尘，没有色身和容貌。可是因缘具足时，阿赖耶识就依众生所造的善恶业种，以及意根对五阴身的念想，又变现出众生的五阴身，肉身容貌现起，六根六尘六识具足，众生又有了见闻觉知性，果报就现前了。就像春蚕作茧，自己缠缚自己，在缠缚当中生死流转不已。</p><p>五阴身就是果报身、业报身，众生有业果报，一定要来六道受报。佛也有三身，其中报身就是果报身，是佛三大阿僧祇劫修的善法所感得的果报，都是非常殊胜的善报。菩萨的身也是果报身，以善报为主，比凡夫的果报身要殊胜很多。凡夫的报身是无始劫以来造业所感得的果报身，一直是恶业多善业少，因此就是恶报多善报少。这果报身一出生，就如蚕作茧，自作自缠，众生的果报都是自作自受，自己把自己缠缚在六道里不得出离。迁化识是指阿赖耶识，不断地从当前的色身迁化到下一世的果报身上，含藏识也是指阿赖耶识，含藏着众生的善恶业种，含藏着所有的果报种子。</p><p>原文：<strong>识亦如是。识自生身。还自缠裹。自弃舍身。更受余报。</strong></p><p>释：阿赖耶识也是这样，出生众生种种的色身以后，自己被包裹在众生的业报之中，然后又把色身舍弃，去接受下一世的果报身。</p><p>识自生身，还自缠裹，其实阿赖耶识是不会自己缠绕自己的，是众生五阴自己造业，自己缠绕自己，造业的是七识造业，妄心造业，然后阿赖耶识又生出妄心受报，七识就以善恶业缠绕着自己。但同时阿赖耶识就被系缚在众生的一个又一个的果报身上，不得受更殊胜的报身。</p><p>阿赖耶识从当前的色身中离开，又生出另一个果报身，让五阴身去受报。阿赖耶识本身受不受缠绕呢？也受缠绕，祂本来是一尊大好的佛，因为众生造业，被这些种子所染污，就要受这些业种的缠绕，就得变造和受持三恶道众生身，不能受持佛身，这也是一种缠绕，但是祂不是自己缠绕自己，是被众生造作的业所缠绕，祂本身还是自在的。</p><p>虽然阿赖耶识本身非常自在，不受果报，不被业障所缠绕，但是从外表的形式上看祂还是受着缠绕，受众生业种影响，就得现地狱的果报身，或者畜生道身，不能自在作佛，不能现佛身，也不能现天道众生身。虽然阿赖耶识自身是解脱的，但是其他更好的色身就不能去受持，从这方面说，就是被缠绕。</p><p>佛地的第八识是无垢识，不含有七识的染污种子，而众生的阿赖耶识是有垢识，含藏着七识的污垢种子。众生如果造善业，阿赖耶识也被善业所缠绕，就得生出天人的色身，被天报善报所缠绕，如果菩萨造善业升天享福了，也是被善业所缠绕。有时候不想要那个果报也不行，当人的时候，受善业的果报，有时候被缠缚得也不行，比如想图个清静，却不得不被很多人包围着，不得自在。善业也是一种受，有受皆苦，但是佛的果报里没有苦，没有苦恼，因为佛的果报是无漏的。</p><p>原文：<strong>由有种故。有色香味。识弃舍身。随其所迁。诸根境界。受及法界。皆悉随之。</strong></p><p>释：由于有种子的缘故，才有色声香味触法六尘境界。阿赖耶识弃舍了当前这个色身以后，六尘境界的种子就随阿赖耶识迁到另一个色身上。在另一个色身上眼根境界色法出现了，耳根境界声法出现了，鼻根境界香法出现了，舌根境界味法出现了，身根境界触法出现了，意根境界法尘出现了，这样六识就随之出生，受觉法界也随之出生。六根六尘六识十八法界都出现了，这就是一个完整的众生。</p><p>原文：<strong>如如意珠。随其所在。乐具皆随。如日所在。光明皆随。识亦如是。随其所迁。受觉与想。及法界等。皆悉随之。</strong></p><p>释：就像如意珠，随所在处，欢乐之具就会出现，它能随人意而随意变现。阿赖耶识就好比是如意珠，祂在哪里出现，众生的法界就随着祂而出现，受觉法界，六根法界，六尘法界，受想行识法界，全部随祂而出现，之后众生五阴具足，十八界具足。就如太阳所在的地方都有光明，阿赖耶识所在的地方，都有五阴十八界，五阴身的种种功能作用，全部随着阿赖耶识而显现出来。只要有阿赖耶识运行，受觉法界与想界，以及其他法界就会全部随之而出现，因为阿赖耶识有种子，可以随种子变现法界。</p><p>不管阿赖耶识到哪里，五阴十八界的种子都会跟随到哪里，只是阿赖耶识到无色界天，就不能变现出五阴十八界的全部功能作用，祂是依业种而变现法界。无色界众生没有色蕴，没有眼耳鼻舌身根五根，那就没有色声香味触五尘，只有意根，有法尘，有意识心。阿赖耶识到色界天，众生没有鼻根，没有舌根，没有香尘和味尘，缺少了四法界，但是五蕴功能还是具足的。</p><p>色界天人的乐受多，苦受极少，天人有行苦，有坏苦，但没有苦苦，除欲界天人死亡时有苦苦，五衰相现时，内心非常苦恼。只要有识心的运行，就有行苦和坏苦，苦苦不一定有。但在人道和三恶道，众生都有苦苦，生老病死本身就是苦，身体出现残障，六根不具也是苦，苦的本身就是苦，叫作苦苦。色身在一点点衰老是行苦，识心一点点微弱，一点点运转是行苦，乐受消失是坏苦。畜生的苦是要解决温饱的问题，地狱众生每一刹那都在受苦，总在想办法躲避这些苦受。</p><p>原文：<strong>识弃舍身。摄一切性。色因为身。无骨肉身。有诸根故。有受妙念。知取善恶。</strong></p><p>释：阿赖耶识弃舍色身，摄持法性，祂到哪里就把法界种子带到哪里，把一切法性都显现出来。色法种子的因能形成色身，由最初的无骨无肉的受精卵，最后形成有五根的色身。因为有眼耳鼻舌身意六根，就有六识出生，有六识就有受有念，并且能知善恶，分别善恶，执取善恶。</p><p>这里的知是指六识的知，包括眼识的见、耳识的听、鼻识的嗅、舌识的尝和身识的触、还意识的觉知。摄一切性是指阿赖耶识含藏着一切法的法性，这些法性包括受、觉、想、行、识性，以及六根六尘法、五阴之法，阿赖耶识全部都含藏着、摄受着。</p><p>原文：<strong>如枣石榴。庵罗庵勒。鼻螺渴竖。劫必他等。种种之果。或辛或苦。或酸或甜。或醎或涩。味力各别。消熟所资。其功不一。及果坏已。味力随种。迁化而生。</strong></p><p>释：如枣石榴、庵罗庵勒、鼻螺渴竖、劫必他等种种果物，味力各个不同，或辣或苦，或酸或甜，或咸或涩，其味各有差别。吃到胃里消化之后，资身受用不同，功德各各不同。当这些果实坏掉以后，果味随着种子迁移，当因缘具足的时候，还会再出生。</p><p>阿赖耶识就像这些果物的种子一样不坏，色身好比是果物，知觉受念就比如是果子的味，阿赖耶识携带着受觉知念的种子，迁化到另一个色身上，又生出受觉知念，生出受想行识五阴，只要有阿赖耶识，五阴就会再显现出来。味力也比喻为五阴身，果实坏比喻为色身坏五阴坏，但是那个种子不会坏，就是说阿赖耶识不会坏，虽然当前的色身坏了，阿赖耶识里有五阴身的种子，来世还会生出五阴。</p><p>原文：<strong>如是识种。随其所迁。受念善恶。咸悉随之。识弃此身。受余报身。故名为识。知善恶业。知业随我。知我持业。迁化受报。故名为识。身之所为。咸悉知之。故名为识。</strong></p><p>释：如是六识的种子，随着阿赖耶识迁化到下一世的色身上，受觉法界、念界也随六识种子而迁化，六识的善恶性也随六识种子而迁化。阿赖耶识舍弃当前色身，受持下一世的果报色身，所以叫作识。阿赖耶识能了别众生的根身器界，了别业种，所以在众生临终的时候，阿赖耶识知道众生的善恶业，就会出生下一世善恶业的果报身。阿赖耶识也知业种随着自己，自己带着业种而出生下一世的五阴身，因为阿赖耶识有这个知性，所以也叫作识。色身所为之事，阿赖耶识也全部都知，所以阿赖耶识也叫作识。</p><p>知善恶业的知，知业随我的知，一个是意识的知，另一个是阿赖耶识的知。如果知道善恶业种子的知，一定是阿赖耶识的知，因为意识没有转识成智，没有神通道力，不能了别种子。阿赖耶识了别众生的善恶业种，但是不了别具体的善恶业行和属性，祂不知道这个业种是善还是恶，不知道众生应该受善报还是受恶报，这不是阿赖耶识的知性，是意识的知性。能够分别众生善恶业报的是意识心，意根都分别不了。临命终的时候，意识知道自己的善恶业会跟随着到下一世，随着五阴业种会显现出来，受其果报。</p><p>阿赖耶识的知，与六七识的知截然不同，阿赖耶识是无心的知，不知法的世俗性质，只知法的内涵，而六七识只知法的世俗性质，不知法的内涵。</p><p>原文：<strong>譬如风大。无形可取。无质可持。以因缘故。作诸事业。表有风大。持冷持热。运香运臭。摇振林木。或鼓扇摧击。如是识无形质。非视听所取。以因缘故。识相具显。由识持身。身知苦乐。光色充盛。行来进止。言笑欢忧。事业照着。当知有识。</strong></p><p>释：譬如风大，没有形状和形态可以抓取，手抓不到，无质碍可执持。在因缘具足时，无形质的风却可以作很多事业，这时就知道有风大出现了。如风能带来冷气和热气，能运载香味和臭味，能吹倒树木房屋，能鼓扇击倒物体等等。通过这些现象，就知道有风大了，风吹过时，有热风有冷风，还会带着香味与臭味，风吹过时，树干摇晃，或者鼓扇子撞击物体。</p><p>阿赖耶识也像风一样，无形无色，无有质碍，看不到，听不见，抓不到，当因缘具足时，五阴的身口意行运作出来，阿赖耶识的形相就显现出来了。有阿赖耶识执持五阴色身，五阴身就能知道苦乐。五阴身活动时，神采奕奕、颜貌光泽、欢歌笑语、行来去止，种种事业都能成就，都是因为有阿赖耶识的执持作用。因此可知，阿赖耶识能在众生身中作一切事业。</p></div>"
},{
    "title": "第六章 识之迁报如服良药如壮士骑马",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  识之迁报如服良药如壮士骑马</strong></p><p>原文：<strong>尔时会中。有月实胜上童真从座而起。合掌白佛言。世尊。云何见色因。云何见欲因。云何见见因。云何见戒取因。</strong></p><p><strong>佛告月实。智见智境。愚见愚境。智者见诸。姝丽美色。了知秽恶。唯是肉段。筋骨脓血。大脉小脉。大肠小肠。液脑膜肾。心脏脾胆。肝肺肚胃。生藏熟藏。黄痰涕唾。发须毛爪。大小便利。薄皮裹之。不净污露。可畏可恶。凡所有色。皆四大生。是为</strong>色因。</p><p>释：这时会中的月实童真就从座位上站起来，合掌对佛说：世尊，如何才能见到形成色的因？如何才能见到淫欲的因？如何才能见到见的因？如何才能见到戒取的因？</p><p>佛告诉月实菩萨，有智慧的人所见的是智慧境界，愚痴人所见的是愚痴境界。有智慧的人看见一切美色，都能了知到，色身外表再美也是污秽和肮脏的，仅仅是肉段而已，里面含藏着筋骨和脓血，大小血脉和肠肚，各种体液和脑膜，还有心肝脾胃肾等等生藏和熟藏，还有黄痰鼻涕和唾液，发毛爪齿、大小便。外面只有一层薄皮裹着，非常肮脏不净，甚可厌恶。所有这一切的色法，都是由四大种子生成的，这就是组成色的因。</p><p>在见色时，有智慧的人与没有智慧的人，所见的境界是不相同的。同样在色法上，见佛性的人与没有见佛性的人，所见的也不同。悟道的人和没有悟道的人所见也有差别，修了善法的人和没有修善法的人，他们的所见也不一样。</p><p>有智慧的人见一切法，都知道是虚妄法，那就不用躲避，不动心就行了。比如遇到一些难闻的气味，有些人要掩住鼻子，有些人却无所谓，躲避就是取相，喜欢也是取相，不取相就无所谓，内心无动于衷。只要取相了，就有行为造作，内心就不空净。学佛人对饮食也应该是这样超然，不取相的人，美味与否无所谓，只要能饱腹就行，取相的人，就分别好吃与不好吃，心生喜厌，结果贪心不断。</p><p>有智慧的人看见美色，知道是秽恶的，就像活动厕所，知道美色其实就是一堆血肉，皮毛也是不干净的，不会生起贪欲，没智慧的人看见美丽的外表，就起贪欲心，而求取之。色身实质上就是一堆脏东西，没有什么可爱的，四大组成的一个物件而已。凡是我们接触到的色法，都是由地水火风四大组成，所有的花草树木房屋，周遭的环境，都是由地水火风四大组成，宇宙器世间都是一样的材料做成，都是平等的。这就是形成色的因。</p><p>原文：<strong>月实。如父母生身。身之坚硬为地大。流润为水大。暖熟为火大。飘动为风大。有所觉知。念及声香味触等界。斯皆为识。</strong></p><p>释：佛说，月实，父母生的肉身，有坚硬性质的是地大成分，不但在筋骨和肌肉里有地大，血液里也有地大，整个色身上都有地大，水也有坚硬性，风吹到身上也感觉痛，风里也有地大。流动润湿的为水大，身体上每一处都有水大，以血液唾液尿液汗液为主。有温度的为火大，飘动的为风大，飘代表轻，动代表流动，轻飘飘的流动，身体里气脉的动，这都代表风大，呼吸与血液的流动性都属于风大。凡是有觉有知，能念色声香味触法六尘界的，都是六识。</p><p>原文：<strong>月实童真复白佛言。世尊。将死之时。云何识舍于身。云何识迁于身。云何识知。今舍此身。</strong></p><p>释：月实童真对佛说，世尊，众生在临死之时，阿赖耶识是如何舍弃色身的，阿赖耶识是如何离开色身的，阿赖耶识是如何知道现在应该舍弃色身的？</p><p>阿赖耶识根据什么知道现在应该舍离色身的，一定是了知了业种和业缘，依据业种业缘而决定离身。阿赖耶识依业种变现和执持色身，业种和业缘上显示到某时刻不应该再输送四大种子维持色身的存在，业缘也不允许阿赖耶识再持身了，阿赖耶识就知道那个时候色身应该消失，应该收回四大不再输出，到那时刻，色身就四大分解，六尘无法正常变现，六识就不能再正常出生和了别六尘，于是六识慢慢消失，意根与如来藏就离身了。</p><p>原文：<strong>佛告月实。众生随业获报。识流相续。持身不绝。期毕报终。识弃舍身。随业迁受。譬如水乳和煎。以火热力。乳水及腻。各各分散。如是月实。众生命尽。以业力散。形骸与识。及诸入界。各各分散。</strong></p><p>释：佛告诉月实菩萨说，众生是随着他的善恶业受果报的。阿赖耶识在色身上的种子流注相续不断，才能继续维持色身的存在和运行不断。到了寿命终了的时候，阿赖耶识才决定舍弃色身，随着众生的善恶业而迁流到下一世的色身上。譬如水乳和合在一起，用火加热，牛奶就会漂上来，水在下面，水乳各自分散。众生的生命也是这样，因为业缘之故，众生命尽时，五阴散坏，色身和识心分开，十二处和十八界各各都分散开了。</p><p>原文：<strong>识为所依。以取法界。及法界念。并善恶业。迁受他报。</strong></p><p>释：阿赖耶识是众生生命的所依，五阴赖以阿赖耶识而摄取十八法界。阿赖耶识舍离原有的色身以后，五阴的种子又回到阿赖耶识里，四大种子、识种子都回到阿赖耶识里，因缘具足时，阿赖耶识随着意根的念力，以及善恶业种，迁到下一世的五阴身上，又输出种子，形成下一世的五阴身，六根六尘六识就会再次出现。</p><p>这里的识流，一是指阿赖耶识本身的识种子刹那刹那流注出来，使得阿赖耶识不断不灭地一直在运作着；二是指阿赖耶识流注七识的识种子，让七识不断地运行，以保证五阴身的生命活动。阿赖耶识一直在不断地执持我们的色身，让色身的生命活动相续不绝，这一期的生命结束了，一期的果报也就结束了，阿赖耶识就舍弃了当前这个色身。</p><p>原文：<strong>月实。譬如大吉善苏。以众良药味力。熟功和合。为之大吉善苏。弃凡苏性。持良药力。辛苦酸醎。涩甘六味。以资人身。便与人身。作色香味。识弃此身。持善恶业。及法界等。迁受余报。亦复如是。</strong></p><p>释：月实，譬如大吉善苏这种药，是把众多的良药混合到一起以后，加工成熟做成了大吉善苏这一种良药。加工成的这种良药就没有了原来普通的苏药味，具有了良药的味力。良药有辛苦酸醎涩甘等六种味道，这六种味良药，是用来滋补人身的，是方便给与人身色香味的，人吃了以后，能得到滋养，治疗身体疾苦。阿赖耶识舍弃此身，持着善恶业和法界，迁受到另一个色身上，受着下一世的业报，也是这个道理。</p><p>大吉善苏比喻为阿赖耶识，众良药味和合比喻众生的善恶业以及法界种子和合在阿赖耶识里，阿赖耶识持着色声香味触的种子，持着各种法界种子，持着善恶业种，再利益滋养下一世众生的色身。</p><p>原文：<strong>月实。苏质如身。诸药和合。为大吉善。如诸法诸根。和合为业。众药味触。资成于苏。如业资识。服大吉善。悦泽充盛。光色美好。安隐无患。如善资识。获诸乐报。</strong></p><p>释：月实，苏药的质地好比是色身，很多种药和合起来就是大吉善苏，就像色声香味触法和眼耳鼻舌身意和合起来才能造作业行。多种药味合在一起，就形成了大吉善苏的苏药味，就像身口意业种滋养着阿赖耶识一样。众生病时服用大吉善苏，就能让身体强健，精神饱满，面色红润，身心都安稳，没有疾病，就像善业种子滋养阿赖耶识一样，能让众生获得快乐的果报。</p><p>滋养就是把善业种子存到阿赖耶识里，阿赖耶识生出的五阴身就受乐报。善业资助着阿赖耶识，种子含藏在阿赖耶识里，阿赖耶识就让众生获得快乐的果报，变现出众生的五蕴都受乐报。</p><p>原文：<strong>服苏违法。颜容变恶。惨无血气。色死士白。如恶资识。获诸苦报。月实。吉善宝苏。无手足眼。能取良药。色香味力。识亦如是。取法界及诸受善业。弃此身界。受于中阴。得天妙念。</strong></p><p>释：如果有人服用大吉善苏药不如法，脸色就变得土白，凄惨而没有血色。本来药是用来治病的，但是服用不对，就会被药所毒。用此来比喻众生如果造恶业，恶业种子存在阿赖耶识里，资助着阿赖耶识，那么阿赖耶识就输出恶业种子，众生的五阴就获得苦报。</p><p>月实，大吉善苏药没有眼睛也没有手脚，但是所有的药混合在一起，它都能摄取所有药的优良的药性，摄取良药的色香味力。阿赖耶识也像大吉善苏良药一样，取着法界，取着六识的受，以及众生的善业。阿赖耶识舍弃现世的色身，现起了一个中阴身，在中阴身里，五阴身获得了天眼，生出了天人的神通和念想。</p><p>原文：<strong>见六欲天。十六地狱。见己之身。手足端严。诸根丽美。见所弃尸。云此是我。前生之身。复见高胜。妙相天宫。种种庄严。花果卉木。藤蔓蒙覆。光明赫丽。如新炼金。众宝钿饰。彼见此已。心大欢喜。因大喜爱。识便托之。</strong></p><p>释：天眼看见了欲界六层天和十六层地狱，同时看见自己的天人色身，手脚都很端严美好，五根面貌丽美，看见自己所抛弃的尸体，就知道这是自己前生当人时的身体。之后他又看见了高大、殊胜而庄严的天宫，七宝装饰，华丽无比，还有种种庄严的花果林木，藤蔓覆盖着，光彩夺目，一片绚丽的景色，就像新出炉的黄金一样耀眼，由众多的珠宝装饰着。他看见花园宫殿以后，心大欢喜，因为喜爱，阿赖耶识就把五阴身托生到天上，有了天人的色身，受到了天人的果报。</p><p>天人都有花园，一个天子一个花园，花园里有各种果物，花果茂盛藤蔓蒙覆。花园里用很多的宝贝装饰着，非常的华丽，富丽堂煌。这前后的描述都是在中阴身里见到的，在中阴身里众生的果报，报有天眼，能看到天上的美景和天宫殿，心一喜欢，就被系缚，而托生到天宫里，成为天人了。</p><p>原文：<strong>此善业人。舍身受身。安乐无苦。如乘马者。弃一乘一。譬如壮士。武略备具。见敌兵至。着坚甲胄。乘策骥骏。所去无畏。舍界入身。迁受胜乐。亦复如是。</strong></p><p>释：这个有善业的人，舍身和受身的时候，身心都是安乐没有痛苦的。死前四大分解的时候没有痛苦，在受天人色身的时候，心一欢喜就入天宫成为天人了，一点痛苦也没有，不用投胎，不用胎中受苦。善业人托生就好比骑马的人一样，放弃一匹马，立刻就乘上另一匹马，换色身就如换马一样，弃了人身，得了天身，阿赖耶识就如骑马的人。又好像一个壮士，盔甲武器齐备，看见敌兵来了，马上穿上坚硬的防护甲胄，带上最好的武器，骑上最好的骏马出去迎战，再加上自身武艺高强，所以他不害怕，根本没有一毫的畏惧之色。造善业的人去投生，舍弃此身，迁入彼身，也是如此。</p><p>造善业的人死前内心没有恐惧，中阴身里也没有恐惧，投生的时候也没有恐惧。因为这一世造善业，有善业善根滋养着阿赖耶识，阿赖耶识抛弃此色身，受持彼色身，五阴就得乐报，快乐的果报出现了，于是就感受善报带来的美妙的享受。而造了恶业的众生，恶业一现前，痛苦备至，手足乱动，就知道自己要去三恶道了。</p><p>原文：<strong>自梵身天。爰至有顶。生于其中。</strong></p><p>释：造善业的人生天，不仅能生到欲界六层天，也可以生到色界初禅天，一直到无色界最顶层天，只要禅定具足，就可以出生到相对应的天中。</p><p>梵身天就是色界天，梵代表清净，所谓清净就是没有欲念，没有男女欲。色界初禅到四禅都属于梵，因为那里的天人都是中性人，不分男也不分女，心清净没有欲念。如果没有初禅以上的禅定，就升不到色界天上去。而欲界六层天只要修福、造善业有欲界定就可以托生了。除了修福造善业，还要修出初禅到四禅定，才能生到色界天，只有福而没有禅定，还去不了色界诸天。</p><p>魔王波旬，因为他做人的时候修过大福德，但没有修出色界禅定，只有未到地定，命终后就生到了欲界最高层天他化自在天。他化自在天的福报也相当大，也有欲界禅定未到地定。禅定本身就有福，是定福，再加他本身所修的善业，所得的福在欲界里是最大的。因此魔王波旬能掌管欲界六层天，统领欲界一切众生，众生只要在欲界天，就属于他的子民，被他管辖。修出初禅定以后的人，他就管不着了。</p><p>所以众生修出初禅定前，魔王就来障碍，不让你修成，因为修成后不属于他管辖了。即使修成以后，他也会来障碍，让初禅定退失，因为他有非常强的眷属欲，总是希望自己管辖的众生越来越多才好。遇到这种情况，还得要继续修福，还要多忏悔，消除业障，福德增大了，就会摆脱波旬的控制。一个人的福德如果很大，魔王也没办法，如果没有福德，普通的鬼神都能来障碍，甚至一只蚂蚁在中阴身里就能来报复你。因此学佛人就要多忏悔，多回向，就会消除业障，增长福德。</p></div>"
},{
    "title": "第七章 识之无形不可眼见",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  识之无形不可眼见</strong></p><p>原文：<strong>尔时会中。大药王子。从座而起。合掌白佛言。世尊。识舍于身。作何色像。佛言。善哉善哉。大药。汝今所问。是大甚深。佛之境界。唯除如来。更无能了。于是贤护胜上童真白佛言。大药王子。所问甚深。其智微妙。敏利明决。</strong></p><p>释：这时候会中有另一个菩萨大药王子，从座位上起立，合掌问佛说：世尊，阿赖耶识既然能舍弃色身，祂的相貌是什么样的？佛说：大药，你问得太好了，你现在问的问题是极其甚深的，这是佛的境界，只有佛才能明了，其他人都不知道，谁也不能把这个问题解答出来。于是贤护菩萨就对佛说，大药王子问的这个问题特别深奥，他的智慧非常微妙敏睿，根性很利。</p><p>原文：<strong>佛告贤护。此大药王子。已于毗婆尸佛所。植诸善根。曾于五百生中。生外道家。为外道时。常思识义。识者云何。云何为识。于五百生。不能决了。识之去来。莫知由绪。我于今日。为破疑网。令得开解。</strong></p><p>释：佛告诉贤护，大药王子曾经于毗婆尸佛所种植了善根，曾经在五百生中出生在外道家，大药王子当外道时，常常思惟佛法里的阿赖耶识之义，善根非常深厚，他常常思惟什么是阿赖耶识，阿赖耶识是什么体性，其功能作用是什么。他思惟这些法在五百生中都没有得出答案，不知阿赖耶识的来去相，也不知阿赖耶识的由来。大药王子能思惟这些法义，善根深厚，能让他五百世不下三恶道，生生世世做人，以继续思惟这些法义。我现在就要破除大药王子的疑惑，为了让他心开意解。</p><p>原文：<strong>于是贤护胜上童真。谓大药王子言。善哉善哉。仁今所问。微妙甚深。月实之问。其义浅狭。犹如孾儿。心游外境。而不知内。正法希闻。诸佛难遇。佛圆广智。无测深慧。至妙之理。应专启请。</strong></p><p>释：于是贤护菩萨对大药王子说：仁者问的太好了，你现在所问的问题，既微妙又甚深，月实菩萨所问的问题，其含义浅白而低下，犹如婴儿，心向外贪求，而不知向内寻觅自心。正法稀有难闻，诸佛也难值难遇，佛的智慧圆满、广大、甚深，无人能测量其深妙智慧以及微妙之理，我们确实应该专心的请问。</p><p>原文：<strong>时大药王子。见佛熙怡。颜容舒悦。如秋莲开。踊跃欢喜。一心合掌。而白佛言。世尊。我爱深法。渴仰深法。常恐如来。入般涅槃。不闻正法。而于五浊。众生之中。愚无所知。不识善恶。于善不善。熟与不熟。不能觉了。迷惑轮转。生死苦趣。</strong></p><p>释：这时大药王子，看见佛的颜容和霭慈祥，面色舒张愉悦，犹如秋莲盛开，就想请佛宣讲深妙之法，欢喜踊跃地一心合掌对世尊说：世尊，我喜欢深妙的法，敬仰深妙的法，常常害怕佛入涅槃，而听不到深妙的佛法，在五浊恶世之中内心愚痴黑暗，茫无所知，不识善法与恶法，对于善法和不善法，善根熟与不熟，都不能分辨，迷惑轮转于生死苦海之中，不得出离。</p><p>善根深厚的人都如大药王子这样，渴求深妙之法，以求得智慧和解脱。善根不深厚的人，如果遇见佛长久住世，就会心生懈怠；或者不再认为佛很神奇难遇，不生深重的敬仰之心，也不会信乐于佛法。佛为了救度这一部分众生，不选择在世久住，以免众生修行懈怠。结果佛一宣布要涅槃，众生就赶快来请问佛法，赶紧修行，就怕自己再也得不到佛的指导和教诲了。那些容易懈怠的人不常见佛也有好处，能发起见佛、敬佛和常随佛学的清净信心，道业才能增进。</p><p>原文：<strong>佛告大药王子。如来正法。难遇难得。我于往昔。为半伽他。登山自坠。弃舍身命。为求正法。经历无量。百千万亿。种种苦难。大药。汝所悕望。皆恣汝问。我当为汝。分别解说。</strong></p><p>释：佛告大药王子，如来正法难遇难得，我曾经为了半句偈子，登到山顶自跳堕坠，弃舍身命，就是为了求得正法。我经历了无量百千万亿种种苦难，为了求法，获得解脱。大药，你所希望获得的微妙的深法，随意你问，我都会为你分别解说。</p><p>世尊在过去世修道求法时，为了获得半句偈以身相舍，是因为欲界天上的释提桓因，要考验佛求法的道心是否坚固，就对佛说：我有半句偈子，如果你想听的话，就要把身体给我充饥。佛就发愿答应了，拿生命来换佛法的半句偈子，可见世尊当时求法之心是多么真诚和赤诚。世尊是有大智慧的，知道半句偈子的价值不可估量，生命并不算得什么，众生无量劫生生世世，都是徒劳无益的白白丧失了那么多的生命，如今能有佛法可闻，能有解脱的机缘，舍弃生命也就非常值得了。</p><p>原文：<strong>大药王子白佛言。唯然奉教。世尊。识相云何。愿垂开示。佛告大药。如人影像。现之于水。此像不可执持。非有无辨。如刍洛迦形。如渴爱像。</strong></p><p>释：大药王子对佛说：世尊，我愿意奉持您的教导，希望您能开示我，阿赖耶识是什么相貌。佛告诉大药王子说，比如一个人的影像映在水中，此影像不可执持，手摸不着，也打捞不上来。不能说这个影像是真实有，也不能说这个影像根本没有，说有却把持不了，没有功用，说无却看得见，所以不能用有和无来辨别祂，因为有无是世间相，阿赖耶识却没有世间相，因此不可说有说无。犹如神灵之形，和渴爱的像，神灵无形，却有功用，渴爱无像，却能执相。阿赖耶识也是如此，无形无相，没有相貌，却能显现万法的影像。</p><p>五阴身就是阿赖耶识变现出来的影像，万法就是阿赖耶识变化出来的影子，五阴十八界全部都是影子。这些影子不可执持，也把持不住，稍纵即逝，说它有，却是生灭幻化的，犹如水中月和地上的影子，说它无，却有五阴的功用。万法都是影子，你不可能说万法没有，可是虽然有，却不是真实的，犹如海市蜃楼。</p><p>渴爱就是心怀着极大的希望，这种心是没有形象的，但却有心的功用，能出生虚妄的相貌，阿赖耶识也是如此，有功用却没有相貌可见。一切法都是水里的影像，镜子中的影像，阿赖耶识犹如水，犹如镜，能映现出一切法的影子，却一法也抓不住。</p><p>原文：<strong>大药王子白佛言。世尊。云何渴爱。佛言。如人对可意色。眼根趣之。名为渴爱。犹持明镜。视己面像。若去于镜。面像不见。识之迁运。亦复如是。善恶业形。与识色像。皆不可见。</strong></p><p>释：大药王子对佛说：世尊，什么是渴爱？佛说，就像一个人对着可心的色境，眼根就奔过去了，这就是渴爱。犹如一个人拿着一面明亮的镜子，看着镜子里自己的面像。如果把镜子拿开，面像就没有了，看不见了，阿赖耶识在色身上的迁运也是这样。阿赖耶识犹如镜子，显现出五阴身，离开阿赖耶识就没有五阴身的显现。众生的善恶业种没有形相，阿赖耶识也没有色相，眼根都看不见。</p><p>原文：<strong>如生盲人。日出日没。昼夜明闇。皆悉不知。识莫能见。亦复如是。身中渴爱。受想不可见。</strong></p><p>释：就像一个生来就眼盲的人，太阳出生和落下，白天晚上和明暗，盲人全都不知，众生看不见阿赖耶识也是这个道理，阿赖耶识有自己真实的功用，却没有形相让众生目睹。自己身中有渴爱，有受和想，众生也不能目睹。</p><p>渴望得到、希望得到就是渴爱，众生有渴爱的心、希望的心、求取的心，这种渴爱心无形无相，以此比喻阿赖耶识亦是如此无形无相。就像人面对喜欢的色，眼根就奔过去了，如果喜欢经历过的人事，意根就奔过去了，意识就开始回忆、追忆、回想、展望、希望，这就是渴爱相，眼根无法看见这样的渴爱相。阿赖耶识也是无形无相，却能迁一切法入心，一切法相都是阿赖耶识迁运出来的。众生造的善恶业虽然是无形无相的，但却作为种子存下来了，种子是无形无相的，阿赖耶识的色相也同样是不可见的，没有什么相貌。</p><p>原文：<strong>身之诸大。诸入诸阴。彼皆是识。诸有色体。眼耳鼻舌及身。色声香味触等。并无色体。受苦乐心。皆亦是识。</strong></p><p>释：色身上的地水火风四大，还有空大、识大，是阿赖耶识迁过来的，阿赖耶识输送出来的，见到诸大就等于见到阿赖耶识了，只是不可眼见。诸入如眼入、耳入、鼻入、舌入、身入、意入，是阿赖耶识迁过来的；色阴、受阴、想阴、行阴、识阴五阴是阿赖耶识迁过来的，实质上都是阿赖耶识，一切作用全部是阿赖耶识的功能。眼根、耳根、鼻根、舌根、身根都是阿赖耶识迁过来的；色声香味触是阿赖耶识迁过来的；无色的识心，能感受苦乐的六识心，都是阿赖耶识迁过来的，这一切法都是阿赖耶识的功用。</p><p>眼根是阿赖耶识输出地水火风四大种子变现的，眼根所见的色是阿赖耶识输出四大种子变现的，二者相触产生的眼识，是阿赖耶识输出识种子形成的，那么一切法当然都是阿赖耶识了。色阴是地水火风四大组成的，是阿赖耶识的功用，受阴，是六识的受，想阴是六识的想，行阴是六识的行，识阴是六识的识性，都是阿赖耶识输出识种子生成的，都是阿赖耶识的功用。</p><p>诸有色体都是地水火风四大组成的色法，比如说眼耳鼻舌身五根，还有五根和意根所对的色尘、声尘、香尘、味尘、触尘、法尘都是四大种子组成的色法，都是阿赖耶识输出四大种子变现出来的，都是阿赖耶识的功用。除了色之外还有无色体六识心法，是阿赖耶识输出识大种子形成的，都是阿赖耶识的功用，包括六识心的一切功能作用，都是阿赖耶识的功用。</p><p>任何一种法都离不开阿赖耶识，那么谁是主人翁？阿赖耶识是主人翁，十方世界诸佛国土，谁是王？阿赖耶识是王。色法心法，全都是阿赖耶识。所以佛称赞大药王子所问甚深。没有修出地上菩萨的种智，无法观行出一切法都是阿赖耶识。明心之后观行万法，色法是色法，心法是心法，阿赖耶识是阿赖耶识，各有各的作用，不会把万法的作用全部都归结到阿赖耶识上来。其实都是阿赖耶识一个本体，是祂自己在玩转自己。凡所接触到的一切法都是自己，都是阿赖耶识，自己是阿赖耶识，自己所接触的一切法也是阿赖耶识，全体都是阿赖耶识，这就是一真法界。</p><p>六识所见都是阿赖耶识所变，看见的色是阿赖耶识变现的，眼根是阿赖耶识变现的，见色的眼识是阿赖耶识变现的，那有自己吗？没有，全体都是阿赖耶识。我们的身体是阿赖耶识变现的，我们接触的一切法都是阿赖耶识变现的，我们的识心是阿赖耶识变现的，有我们自己什么呢？有五蕴吗？五蕴是什么？就是阿赖耶识，十八界是什么？全部是阿赖耶识。哪有自己？而意根还执著这是我做的，那是我的，哪有意根啊？意根就是阿赖耶识变现的，本质上还是阿赖耶识。</p><p>这样观行到最后，就能证得无我，无我的程度越来越深，彻底无我就是佛了。般若智慧要往这上面发展和推进，这个智慧就越来越深了以后就变成了唯识种智。但是还有前提，禅定福德这些做菩萨的条件要具足，菩萨六度要修足。这个结论提供出来了，但中间没有求证过程，还不是属于自己所有的，有了求证过程，结果是通过求证都证得了，佛法才是属于自己的，然后身心全部颠倒过来。身心都改变了以后，转识成智，最后就成佛了。</p><p>原文：<strong>大药。如人舌得食物。知甜苦辛。酸醎涩等。六味皆辨。舌与食物。俱有形色。而味无形。又因身骨髓肉血。觉知诸受。骨等有形。受无形色。知识福非福果。亦复如是。</strong></p><p>释：大药，如人的舌根与食物相触，就知道了食物的甜苦辛酸醎涩等六味，这些味尘舌识都能辨别出来，舌识的作用就是分辨、分别味尘的，只要有识，就有分别了别性。舌根与食物都有形色，都是由地水火风四大组成的色法，但是品尝出的甜苦辛酸醎涩味尘是无形的。</p><p>又因为有色身，有骨头肌肉有血液，识心就能感觉到色身上的一切觉受，比如说疼痛、舒适、轻安，或者是冷了、饿了、渴了这些感受，没有色身能感受吗？不能，身根不与触尘相触，不会出生识心，就没有感受的作用。骨头肉血等是有形色的，是四大组成的物质色法，而能感受的那个识心是没有形色的，识心的受也是无形色的。所以应当知道，阿赖耶识的福果和无福的果，也同样是无形无色的。</p><p>原文：<strong>时。贤护胜上童真。礼佛双足。白佛言。世尊。此识可知。福非福耶。佛言善听。非未见谛。而能见识。识不可视。非如掌中。阿摩勒果。识不在于。眼等之中。若识在于。眼等之中。剖破眼等。应当见识。</strong></p><p>释：这时候贤护菩萨礼佛双足，又问佛说：世尊，这个阿赖耶识是含藏着福果，还是不含藏着福果？佛说：你仔细听，贤护，没有证得真实道理的人，就不能证得阿赖耶识，不能知见阿赖耶识，阿赖耶识不可用眼见，眼识见不到。阿赖耶识不是像手中的阿摩勒果那样，用眼识能见，阿赖耶识不在眼根之中，也不在耳根之中，不在鼻根之中，不在舌根之中，也不在身根之中。如果阿赖耶识在眼根等五根当中，剖开眼根等五根，应当能见到阿赖耶识，可事实是见不到阿赖耶识。</p><p>非未见谛而能见识，这个谛指的是真理、真实，小乘的谛，指的是四圣谛真理，大乘的谛是指阿赖耶识、第八识、如来藏、实相心。没有证得如来藏的人，是无法见得到这个识的，这个见也不是指眼见，是指证得的意思。非未见谛而能见识，当你见得真理，证得实相了，才能见得这个识，但也不是肉眼所见。</p><p>证得阿赖耶识是指在作用上，知道这是阿赖耶识所起之用，明了阿赖耶识的功用就是证得，不是指眼睛看见。比如证得风，知道有风出现了，也不是看到风了，而是在风所起的作用上认识了风，了知了风的到来。风一刮过来，看见树叶在动，就知道有风，但是却看不见风。同理，我们证得阿赖耶识在五蕴身上的运行，知道祂是如何运行起作用的，就是证得阿赖耶识。但是能看见阿赖耶识吗？看不见，识不可视，只能在作用上证得祂，知道祂起的什么作用，背后的运作是怎样的。</p><p>证得阿赖耶识时，要知道祂是如何起作用的，起的是什么作用，在八个识的和合运作中，知道哪个作用是祂现起的，八个识要一一分别出来。比如我们眼睛见色的时候有眼识、有意识、有意根、有第八识，如果说这里有阿赖耶识的作用，那要指出来，祂到底起的是什么作用，具体是如何运作的。证得阿赖耶识还要知道祂具体在何处，如何运作，如何配合七识和五阴的，能知道阿赖耶识粗浅的运作，但是细的运作还要在后续的修行中，再仔细观察思惟，才能观察到阿赖耶识更微细的运作。像六祖大师悟道时就悟出了五个何期自性，里面的细节就知道一些了，才能说出五个何期自性。</p><p>在六尘的分别性上，七识妄心要起用，真心也要起作用，我们必须在有能力分开八个识各自的作用之后，才能证得阿赖耶识，在五阴真妄和合运作中，现量观察阿赖耶识的功用，就是证得。证得各个识的功用，都是意识意根证得的。</p><p>五识不能证得，因为五识不能见阿赖耶识，所以佛说识不可视，并不是像在掌中放一个阿摩勒果一样看得见。阿摩勒果是有形有色的，阿赖耶识是无形无色的，眼识只能看见有形有色的果物，不能见无形无色的识心。眼睛里没有阿赖耶识，如果眼睛里有阿赖耶识，把眼睛剖开，就应该能找到阿赖耶识，如果阿赖耶识在身体里，把身体一片一片切开，也应该能找到阿赖耶识，可事实上却找不到。即使是世尊自己也看不见识的色相，只能感知其所起的功能作用。</p><p>原文：<strong>贤护。恒沙诸佛。见识无色。我亦如是。见识无色。识非凡愚。之所能见。但以譬喻。而开显耳。贤护。欲知识之罪福。汝今当听。</strong></p><p>释：贤护，像恒河沙一样多的诸佛都证得了阿赖耶识，都知道阿赖耶识是无色相的，我也是这样，证得了阿赖耶识，知道阿赖耶识是无色相的。阿赖耶识不是凡夫愚人们能够见得的，我也只能用各种譬喻来开示和显示出阿赖耶识。贤护，如果你要知道阿赖耶识里所含藏的罪福业，你现在应当仔细听。</p><p>原文：<strong>譬如有人。为诸天神。或乾闼婆等。及塞建陀等。鬼神所著。贤护。于意云何。其为天等。鬼神所著。其着之体。求于身中。可得见不。贤护白佛言。不也。世尊。天等鬼神所著。其着之体。无色无形。身内外求。皆不可见。</strong></p><p>释：佛说：譬如有人被一些天神，或者是乾闼婆非人，或者是塞建陀等鬼神附体控制了，贤护，你怎么想呢？这个人被天人或者鬼神附体了，你在这个人的身体上能看见鬼神和非人的色身吗？贤护菩萨回答佛说：看不见，世尊，非人和鬼神附着在人的身体上，他们是无形无色的，不管在人身内还是在人身外，都看不见。</p><p>佛说法常常用比喻，因为比喻比较形象，众生能容易听懂。鬼神附体的时候，心里明明是知道是有鬼神的，可是谁也看不见鬼神，同理，阿赖耶识也在五蕴当中运行，同样也是看不见的，但祂却实实在在的存在运行着。与鬼神附体五蕴一样，附体以后，鬼神指挥五阴，让干什么五阴就干什么，五阴必须听从鬼神使唤。我们众生都是听谁使唤？是听阿赖耶识使唤，而阿赖耶识是随顺于意根的。</p><p>我们应该明白，五阴身行走坐卧是谁在起作用呢？是八个识和合起作用，没有八个识身体就不能行走坐卧，没有八个识就坐不住，躺下也是一堆死肉，所以色身上有八个识，才能行走坐卧，迎来送往，穿衣吃饭。</p><p>原文：<strong>贤护。其为福胜。诸大天神。之所著者。即须好香花。烧众名香。香美饮食。清净安置。祭解供具。咸须华洁。如是此识。为福资者。便获尊贵。安乐之果。或为人王。或为辅相。或豪望贵重。或财富自在。或为诸长。或作大商主。或得天身。受天胜果。由识为福资。身获乐报。</strong></p><p>释：贤护，如果这个人色身上是一些天神来附体，天神就要布置香美的鲜花，燃烧诸多名贵的香，准备一些香美的饮食，周围环境都要布置的干干净净，安置一些干净的祭祀天神的供具，一律都是华丽而清净的，因为天神就是喜欢干净和清净美丽。阿赖耶识也是这样，有福业滋养，含藏着善业福果，阿赖耶识就让五阴身获得尊贵、安稳而快乐的果报。或者作为国王皇帝，或者作为丞相和宰官，或者出生在豪望贵族之家，或者是大富长者，财富自在，或者作为大商主，富贵发达，或者升天享福，作天人。这些都是因为阿赖耶识里收藏着福德业种所致，有福德滋养，阿赖耶识就变现福报身，享受乐报。</p><p>天人们喜欢香，喜欢清净，喜欢华丽，被附着的这个人就要经常烧香，为了好闻，饮食都是香美，而且特别干净的。天人命终托生到人中的那些人，几乎都有洁癖，那是把天人的习气也带来了，他的手一天不知道要洗多少遍，生活环境都是非常讲究的。其实那些细菌是洗不掉的，他不知道，只是习惯性的洗，衣服经常的洗，桌子经常的擦，一点灰尘都不许有。这是在天上养成的洁癖，喜欢清洁的天人习气。</p><p>如果是猪狗托生过来的人，看看猪狗的生活环境是什么样，他的家里就差不多是什么样，从这里就能判断出此人前世当过什么众生，从哪道里托生过来的。再从一个人的习气上就能判断出他的前世是哪类众生，如果他的相貌，非常非常的瘦，脸是长长的，就能大约判断出此人前世做过什么众生。在临终的时候，观察他的相貌和他这一生的习气秉性，也大约能判断出他要托生到哪一道里。</p><p>如果一个人到老了，还一直是又贪又悭吝，一点东西都不肯施舍与人，就知道此人必去饿鬼道无疑。大多数人死后一般都要去鬼道，因为大多数众生都是悭贪吝啬的，与鬼道众生相应，就去做鬼。人道中的大部分众生也都是从三恶道中托生过来的，因为大多数众生的习性都与三恶道相应。</p><p>原文：<strong>如彼福胜。天神所著。得胜妙花香。香美饮食。便即欢喜。病者安隐。今得尊贵。豪富自在。当知皆是。由福资识。身获乐果。</strong></p><p>释：如果是那些福德比较殊胜的天神来附其体，其人与天神的果报相应，这个人就享受胜妙的花香，还有香美的饮食，内心欢喜异常，被天神附体的人如果从前有病，这时病就没有了，因为天人天神从来没有病，所以是不会让这个人再生病的。被附体的人，现在获得了富贵自在之果报，当知都是因为自己过去所造作的福德之业滋养阿赖耶识的结果，让现在的五阴身获得了快乐的果报。</p><p>原文：<strong>贤护。其为富丹那等。下恶鬼神。之所著者。便爱粪垢。腐败涕唾。诸不净物。以此祭解。欢喜病愈。</strong></p><p>释：贤护，如果一个人被富丹那等下劣的恶鬼神附体了，这个众生就喜欢肮脏粪秽、腐朽发臭的鼻涕和唾液，喜欢一切不净物。如果用这些不净之物祭祀鬼神，此人病苦就会消失不见，因为鬼神能报答此人，用神通治好他的病。那些福薄的恶鬼，人吐一口痰，都得去抢，唾液对于鬼神来说就是美食，鼻涕对于鬼神来说也是美食，粪垢之处也有没有福德的鬼来啖食。这些福薄的鬼神，都是因为活着为人的时候不肯布施，悭吝成性，就得这个果报。</p><p>原文：<strong>其人以鬼神力。随鬼神欲。爱乐不净。臭朽粪秽。识以罪资。亦复如是。或生贫穷。或生饿鬼。及诸食秽。畜生之中。种种恶趣。由罪资识。身获苦果。</strong></p><p>释：如果一个人被鬼神所控制了，鬼神在他身上想干什么他就干什么，鬼神喜欢什么他就喜欢什么，完全听从鬼神的指使。喜欢不干净的臭秽腐败的粪秽之类的物品。众生造了罪业，罪业种子存在阿赖耶识里，阿赖耶识变现的众生也是这样，喜欢低劣下贱肮脏粪垢之处。因为这个人不修福，阿赖耶识里没有福业，都是罪业，就会让这个众生或者生到贫穷家，或者生到恶鬼道，啖食臭秽物，或者生到畜生道，畜生也是全部都吃肮脏的饮食。生在这三恶道当中，都是因为由罪业来滋养着阿赖耶识的结果，阿赖耶识就让他的五阴身获得这样的罪苦果报。</p><p>原文：<strong>贤护。胜上天神。其着之体。无质无形。而受种种。香洁供养。识福无形。受胜乐报。亦复如是。富丹那等。下恶鬼神。为彼著者。便受不净。秽恶饮食。识资罪业。获诸苦报。亦复如是。</strong></p><p>释：贤护，众生被果报殊胜的天神附体时，天神在人身上是无形无相的，却能受到鲜花和洁净的饮食供养，同样的，含藏着福德种子的阿赖耶识也是无形无相的，却能让众生受着殊胜的乐报。众生被富丹那等下劣的恶鬼附体了，就喜欢不净的臭秽的饮食。众生造了罪业，罪业种子滋养阿赖耶识也是这样，让众生获得苦报，就像那些下劣恶鬼附在人身上一样，这个人就和下劣恶鬼相应，受那些恶劣的果报，受用肮脏不净的饮食的果报。</p><p>原文：<strong>贤护。当知识无形质。如天等鬼神所著之体。供具饮食。所获好恶。如资罪福。得苦乐报。</strong></p><p>释：贤护，你应当知道阿赖耶识无形无色，就像天神著身和鬼神著身不可见一样，所获得的饮食供养具，所得的罪业和福果差别，都是因为众生的罪福业滋养阿赖耶识的结果，众生就得到苦报和乐报。众生造罪恶业，造善福业，所受的果报就不同。</p></div>"
},{
    "title": "第八章 爱欲因和戒取因",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第八章  爱欲因和戒取因</strong></p><p>原文：<strong>大药王子白佛言。世尊。云何见欲因。佛言。大药。互因生欲。犹如钻燧。两木互因。加之人功。而有火生。如是因识。及因男女。色声香味触等。而有欲生。</strong></p><p>释：大药王子对佛说：世尊，如何才能见到产生淫欲的因？佛说：大药，生起欲望的原因有男女两方面因素，由于二者互相吸引，而起欲心。犹如钻燧取火，两根木头是生火的因，加上人力的摩擦，火就在两根木头中生出来了。欲望也是这样，因为有阿赖耶识，有六识，以及有男女二人和色声香味触法六尘境界，男女之间就产生了欲望。</p><p>这里的欲主要是欲界众生的男女欲望，以及对五欲六尘的追求欲。欲界众生有各种各样的欲求，男女欲最重，其它的欲比如金钱欲、饮食欲、权力欲、名声欲等等在其次。互因就是双方面互相为因为缘，因对方而起爱欲，就如两个木材互相摩擦就会生火一样，一根木头不会起火，男女两方面的原因才产生了爱欲。阿赖耶识是产生一切法之因，因着阿赖耶识，还有男女二人，色声香味触等，然后众生之间就有爱欲生起。</p><p>原文：<strong>譬如因花生果。花中无果。果生花灭。如是因身显识。循身求识。识不可见。</strong></p><p>释：又譬如因为有花，才能结果，花中没有果子，当果子出生时，花就谢灭了。同理，因为五阴身而显现出阿赖耶识的功能作用，可是在五阴身上上下下周遍寻找阿赖耶识，却找不到，阿赖耶识不是用眼识看见的，不是用耳识听见的，不是用鼻识嗅到的，不是用舌识尝到的，不是用身识触到的，因此色身上找不到阿赖耶识。</p><p>就好比有花才会生果，花中却没有果，果生出来了，花就灭了。因着众生的五阴色身来显现阿赖耶识，但是在这个色身上去找阿赖耶识，却是找不到的，因为祂无形无色，无形无色却能有无穷多的作用。</p><p>原文：<strong>业果生。身便谢灭。身骨髓等。不净诸物。咸悉销散。又如种子。持将来果。味色香触。迁植而生。识弃此身。持善恶业。受想作意。受来生报。亦复如是。</strong></p><p>释：这一期的业果结束，下一期的业果成熟，业缘出现了，此世的色身就谢灭，身体骨髓内脏等等不净物，全部都消散了。又像种子一样，带着将来果子的味色香触等，迁移到土地里，就生根发芽、开花结果。阿赖耶识也是如此，舍弃此身，带着善恶业，和受想作意的种子，接受来世的五阴果报，下一世的生命就出生了。</p><p>众生这一辈子造的业，业果成熟了，就要去下一世受因缘果报，这一期的生命就得结束，于是色身就谢灭了，这些内脏、骨髓等不净诸物也都随着消散了。下一世的业果显现出来，就好比种子执持着将来还没有出生的花果的色香味触，这个种子比喻为阿赖耶识，下一世还没有出生的花果比喻为下一世的果报，下一世的果报就含藏在种子里，而众生下一世的果报就含藏在阿赖耶识里了。</p><p>阿赖耶识迁到下一世，众生就有下一生的果报。阿赖耶识持着众生的善恶业，持着受觉、想觉、作意种子、六识种子，然后就受来生的果报，来生的果报身里也有受想作意，但是果报有乐有苦，都是根据善恶业而显现出来的业果报。</p><p>原文：<strong>又如男女爱欲。欢会分离而去。识业和合。恋结爱着。味玩贪吝。报尽分离。随业受报。父母因缘。中阴对之。以业力生。识获身果。爱情及业。俱无形质。欲色相因。而生于欲。是为欲因。</strong></p><p>释：佛说，又比如男女之间有了爱欲，欢会过后各自离开而散去，阿赖耶识也是这样，与业种和合在一起，五阴就生出种种贪爱结缚，对于所贪着的法味着玩着贪取着吝惜着，贪嗔痴烦恼不断现行。业报结束，五阴就消失，进入中阴身里，父母因缘现前，因为众生的业力之故，新的五阴出生，阿赖耶识就使得下一世色身五阴的果报出现了。众生的爱恨情仇和业种业力，都没有形色，也没有质碍，欲爱心加上色身因，就出生了欲望，这就是众生的欲因。</p><p>众生的烦恼和习气都作为种子存在阿赖耶识里，这一世报尽了，阿赖耶识就和业种分离，和色身分离，随着其他的业，又产生下一世的色身。在下一次色身出生之前还有中阴身，在中阴身里遇见父母这个缘，然后就投胎，受下一世的果报身。众生的爱恋心和善恶业，都是无形无色的，因为贪爱，有外色、男女色等作为因，就产生出了爱欲心。众生产生爱欲心的原因是内心的贪爱没有断除，然后又有男女色等这些缘，爱欲心就现出来了。原来的贪爱是作为种子存在阿赖耶识里，因缘具足时，种子现行，爱欲心生起，这就是欲因。</p><p>原文：<strong>大药。云何见戒取因。戒谓师所制戒。不杀不盗。不邪淫。不妄语。不饮酒等行。取谓执取。是戒作如是见。因是持戒。当得须陀洹果。斯陀含果。阿那含果。</strong></p><p>释：大药，如何知道守持戒律是证果的因？戒，就是天人师佛世尊所制定的戒律，如：不杀戒、不偷盗戒、不邪淫戒、不妄语戒、不饮酒戒等五戒。取，就是执取、执行的意思。受持五戒的原因应该是这样的，因为能遵守五戒、比丘戒、比丘尼戒不犯，将来就能证得初果须陀洹、二果斯陀含、三果阿那含。</p><p>这里没有说在家人持五戒能证得四果阿罗汉，一般来说，要证得四果阿罗汉必须要出家修行才能证得，这不包括前世已经证得了四果阿罗汉的情况，但即使在家修出了四果阿罗汉，因为他已经心空无欲，一定会出家的，在家居里肯定住不下去，适应不了家居生活。</p><p>原文：<strong>以是因故。获于胜有。谓受人天等身。斯皆是有漏善。非无漏善。无漏之善。无阴熟果。</strong></p><p>释：因为守持戒律，而得一二三果，就能获得殊胜的三界世间果报，来世能得人身和天人身，不下三恶道。但是因为没有断除烦恼，或者是烦恼没有断尽，其心还有漏，有漏就能漏掉善法，所以这些都是有漏的善业，不是无漏的善业。无漏的善业，是四果阿罗汉才具有的，灭去所有的贪嗔痴烦恼以后，一切善法都不再漏掉，最后有能力灭去五阴身，入于无余涅槃中，寂静清凉，没有一丝烦恼和苦患，不在三界中，解脱三界苦。</p><p>原文：<strong>今此戒取。是有漏种植之。于识执善恶业。识不淳净。烦恼因故。受热恼苦。是为见戒取因。</strong></p><p>释：现在因为这种持戒获得的是有漏的业种，种植在阿赖耶识里，阿赖耶识里有善恶业种，还是不够清净，还有苦恼和苦患，将来还要受烦恼之苦，这就是众生持戒的原因，是为了获得有漏善，得人天果报。</p><p>见戒取因在前面的段落里，佛没有回答，就在这里回答。五戒是佛所制的戒，佛所制定的戒是不杀不盗不邪淫不妄语不饮酒等，取是执取，执取不杀、不盗、不邪淫、不妄语、不饮酒的业叫执取，也叫作守戒。因为有善恶的心，才要守戒，如果心纯净了无善恶，就不必刻意守戒，也不会犯戒。</p><p>持这有漏的五戒、八戒、十戒能获得什么果报？能获得须陀洹果（初果），斯陀含果（二果），阿那含果（三果），获得初果二果三果，将来还会有色身生出来，一定是人身和天人身，不会再有三恶道身。证得初果命终以后，七次往返人间和天上，一次人间，一次天上，就是一个来回，最多七个来回，就证得四果，能入无余涅槃，脱离三界生死苦了。证得二果命终以后上天一回，回人间一回，在人间就可以证得四果，解脱三界有苦。三果就是生到天上，然后取证四果，入无余涅槃，有的在中阴身里，就取证四果，入无余涅槃得解脱。这都叫殊胜的有，证得这三果，受人天等身，证得四果，才能出三界，入无余涅槃，再也没有烦恼漏了。</p><p>三果人虽然断了烦恼，但没有断尽，还属于部分有漏，无漏是四果，烦恼全部断尽。无漏的善是四果人证得的，六神通当中有个漏尽通，只有阿罗汉才能证得，三果以下都不能证得漏尽通。在大乘中是初地以上的菩萨能证得部分无漏善，八地以上的菩萨是完全无漏的善，地前菩萨都有漏，所以初地菩萨因为心得无漏，就能转识成智。明心之后的菩萨还有漏时，就不能转识成智，因为有漏，智慧就不圆满。</p><p>无漏之善无阴熟果。就像四果阿罗汉，是无漏的善，因为没有后世五阴成熟的果，就不会有下一世的五阴生命，命终没有五阴就入涅槃了。我们持的五戒八戒十戒都是有漏，四果阿罗汉就不用持五戒，因为他已达到无漏了，没有贪嗔痴烦恼，永远不会再犯戒这些有漏的戒了。</p><p>三果以下都是有善有恶业，还有烦恼漏，比如三果人还有慢心，慢心就是恶，还有散乱心，还有对禅定对色身的贪爱，还有我执没有断尽，这都叫作恶。因为有这些烦恼漏，就有阴熟果，还有下一世的五阴果报。即使有中阴身的出现，也是果，上天了还有五阴果，四果阿罗汉就没有五阴果了。因为众生有烦恼故，所以才会有热恼苦，生在人中有热恼苦，生在天上也有苦，比如五衰相现，欲界天人色身要灭之前，都有热恼苦。总之，能取得小乘的一二三果位，就是戒取的因。</p></div>"
},{
    "title": "第九章 微细之识云何能持大小身",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第九章  微细之识云何能持大小身 </strong></p><p>原文：<strong>大药白佛言。云何识取天身。乃至取地狱身。佛言大药。识与法界。持微妙视。非肉眼所依。以为见因。此微妙视。与福境合。</strong></p><p>释：大药菩萨对佛说：阿赖耶识如何执取天人的色身，乃至于地狱的色身？佛说：大药，阿赖耶识赋予法界众生一种很微妙的视觉，就是小神通，不用肉眼就能见到天宫境界，以心眼所见，不依眼根。这种特殊的心眼见色功能，是由自己的福业所支撑的，是福业所感，才出现了天福境界，心眼就看见了自己福德所感的天宫。</p><p>原文：<strong>见于天宫。欲乐嬉戏。见已欢喜。识便系着。作如是念。我当往彼。染爱恋念。而为有因。见已故身。卧弃尸所。作如是念。此尸是我。大善知识。由其积集。诸善业故。令我今者。获于天报。</strong></p><p>释：他看见天宫里，天子天女们正在娱乐嘻戏游玩，见已心生欢喜，这一生起欢喜，心就被拘执在天宫的美妙境界里了，于是心里就想：我应该投生到天宫去。这个人是因为贪爱天宫胜境，心生爱恋，而成为三界有的生因，出生了三界中的天人色身。到了天宫里的时候，看见了自己已经死亡的色身，躺在丢弃尸体之处，心里就想：这个尸体就是我的大善知识，因为他造作的一切善业，才让我获得了天人的善报。</p><p>从这里我们应该看出，只要我们喜欢什么境界，就被什么境界所拘碍和系缚，厌恶什么境界，也会被什么境界所拘碍和系缚。所以我们对一切境界就不要生出喜乐心和厌恶心，只要有心，就会被系缚，不得自在，不能脱出生死轮回。要想解脱，不被系缚，就要对一切境界都无心，无心就不会被境界系缚，不执著就得解脱了。</p><p>原文：<strong>大药白佛言。世尊。此识于尸。既有爱重。何不托止。佛言大药。譬如剪弃须发。虽见乌光香泽。宁不更植于身。令重生不。大药白佛言。不也世尊。已弃须发。不可重植于身。令其更生。</strong></p><p>释：大药菩萨对佛说：世尊，这个人对他的尸体，既然是那样的爱重和喜欢，他为什么不重新托生到尸体上呢？佛说：大药，好比剪掉自己的头发，虽然掉下来的头发仍然是乌光亮泽的，能不能再把头发接上去，让头发重新回到身体继续生长？大药回答佛说：不能了，世尊，已经剪掉的头发不能再接回去，不能再安植到头上，让头发再接着生长了。</p><p>大药菩萨知道只要心生贪爱就被贪爱物所系缚，此人喜爱自己尸体，也要被自己的尸体所系缚，但不能再回到自己的尸体上活过来。</p><p>原文：<strong>佛言。如是大药。已弃之尸。识亦不可。重托受报。</strong></p><p>释：佛说：确实是这样，大药，法界的规则就是这样，只要已经完全舍弃了尸体，七、八识二识都离开了色身，六识都灭了，八个识就不可能再重新回到色身上，让色身重新活过来。</p><p>舍弃色身必须是七个识都离开色身了，如果还有意根没有离开，那就不叫完全舍弃，意根如果还在，这个人就可以活过来。因为有意根，就有第八识，那就不是死人，六识还可以再出生，人就能活过来了。</p><p>原文：<strong>大药复白佛言。世尊。此识冥寞玄微。无质可取。无状可寻。云何能持象等。大身众生。纵身坚固。犹若金刚。而能贯入。壮夫之身。力敌九象。而能持之。</strong></p><p>释：大药菩萨又对佛说：世尊，阿赖耶识是这么微细，这么玄妙，这么幽隐，难以得见，没有质可取，也没有形状可寻，那么阿赖耶识怎么能执持着大象等这样大的众生身呢？祂怎么能到大象的色身上，去维持像大象等这样大身众生的生命呢？纵然阿赖耶识坚固犹若金刚，怎么可能进入能力敌九象的非常有力的壮夫身上，而加以执持呢？</p><p>原文：<strong>佛言大药。譬如风大。无质无形。止于幽谷。或窍隙中。其出暴猛。或摧倒须弥。碎为尘粉。大药。须弥风大。色相云何。大药白佛言。风大微妙。无质无形。</strong></p><p>释：佛说：大药，譬如风大无形无质，从深山幽谷或者石头缝隙中刮出来以后，其势迅猛，此大风暴或者龙卷风，能将须弥山摧倒，并且粉碎成灰尘。佛说：大药，能吹倒须弥山的大风，有什么色相吗？大药答佛说：风大是很微妙的, 没有形质, 没有形状。</p><p>须弥山比地球大无数倍，由最坚硬的七宝组成，地球还有土有水，须弥山上没有这些，全都是金刚宝物构成的，非常坚硬。大风能将须弥山摧倒，碎为尘粉，这该有多大的势力，这已经不是一般性的大风和暴风了。阿赖耶识也像大风一样无形无相，祂的势力也相当大，能进入非常强壮的大象身体当中，执持着大象的身体，让大象的生命不断地运转。</p><p>原文：<strong>佛言大药。风大微妙。无质无形。识亦如是。妙无形质。大身小身。咸悉能持。或受蚊身。或受象身。譬如明灯。其焰微妙。置之于室。随室大小。众闇咸除。识亦如是。随诸业因。任持大小。</strong></p><p>释：佛对大药说：风大很微妙, 无质无形, 阿赖耶识也是同样微妙没有形质, 没有形状，不可见、不可听、不可触，不管多大的色身和多小的色身，阿赖耶识都能执持和运转，或者受蚊蝇身，或者受大象身。譬如明亮的灯光，其火焰非常的微妙，放在屋室里，灯光就随着房间的大小，把房间里的黑暗全部除去。阿赖耶识也是这样，随着众生的业缘业因，而能执持大小色身。</p><p>报身佛的色身极其高大，地球就像报身佛手里的乒乓球那么小，但是无垢识也能执持着报身佛的身躯，最小的身比如蚊子、苍蝇、蚂蚁和细菌，阿赖耶识都能任持。为什么阿赖耶识不管什么样的色身同样都能执持？因为祂本身无形无质，无相无色，又遍一切处，多大的身体都能遍满，多小的身体也能遍满。</p><p>但是阿赖耶识在大身和小身上的功能作用是一样的，细菌身上的阿赖耶识，和大象身上的、龙身上的、大鹏金翅鸟身上的阿赖耶识，功能作用都是一样的，没有差别。阿赖耶识也不会报怨说，你看你造的业让我持你这样小的色身，祂不报怨，没有感觉，没有感受，祂也不报怨说，你这样大的大身让我持起来有多累。大小身对祂来说都是一样的，都能不费吹灰之力，让众生的色身存活下来，而且是正常的生活。</p><p>原文：<strong>大药白佛言。世尊。诸业相性。彼复云何。以何因缘。而得显现。佛言大药。生诸天宫。食天妙膳。安宁快乐。斯皆业果。之所致也。</strong></p><p>释：大药对佛说：世尊，众生造业的业相是怎么样的，以什么因缘能显现出众生的业相？佛对大药说：造善业的人升到天宫，吃的是天上美妙的饮食，生活安宁快乐，这都是造善业的业果所感召的。天上美妙的饮食，心一想就出现，变化而来，百味具足，不用手做，不用劳作，也不用耕地，这就是善业的福果。</p><p>原文：<strong>如人渴乏。巡游旷野。一得清凉美水。一无所得。受渴乏苦。得冷水者。无人持与。受渴乏者。亦无遮障。不许与水。各以业因。受苦乐报。</strong></p><p>释：比如两个人巡游在旷野上，都感觉非常渴，又渴又乏又累，可是其中一个人得到了清凉美味的饮水，但是另一个人却一滴水都没有得到，只能忍受着又渴又乏的苦恼。得清凉水的那个人，没有人施与水，但是他却得到了水，受渴乏的那个人，也没有人遮障他，不让他得到水喝，可是却喝不到水。两个人都是业因所感召的，各以自己的善恶业因，而受苦报和乐报。</p><p>原文：<strong>大药。应当以是。见善恶业。如空中月。白黑二分。</strong></p><p>释：大药，从他们所受的果报上看，就知道他们所受的是善报还是恶报。看每个众生的享用资具就知道，众生所造的是善业还是恶业，造的是福业还是无福业。善恶业报就像天空中的月亮，分成白月和黑月两种，非常分明。白月的时候，月亮是越来越亮，黑月的时候，月亮是越来越黑。黑月的时候在空中看不见月亮，非常的黑暗，白月的时候，空中月亮非常的光明，黑白比较，非常分明。众生的善恶业也是非常分明的，有的人依靠乞讨生活，有的人生活富丽堂皇，我们就知道他们所造的业是善是恶了。</p><p>原文：<strong>又如生果。由火大增。熟便色异。如是此身。由福增故。生胜族家。资产丰盈。金宝溢满。胜相显盛。或生诸天宫。快乐自在。斯皆善业。福相显现。</strong></p><p>释：又比如生的果子，用大火蒸，蒸熟了以后颜色就变化了，生果和熟果的颜色是不一样的，生果变熟果，果色就变。色身也是这样，众生福业增加的缘故，就出生在上等族性人家，自己获得丰盈的资产, 有数不清的金宝, 富贵相就完全显现出来，非常殊胜的果报就出现了，或者生到天宫，快乐自在。善业福相就会显现出这样的果报。</p><p>原文：<strong>譬如种子。植之于地。果现树首。然其种子。不从枝入枝。而至树首。割析树身。亦不见子。无人持子。置于枝上。树成根固。求种不见。如是诸善恶业。咸依于身。求之于身。亦不见业。</strong></p><p>释：譬如把种子种植到地里，在树头上就长出了果子，可是树种子却没有从一个树枝到另一个树枝，再进而到树头上，割断大树也找不到种子，没有人把树种子放在树枝上，大树出生以后，树根非常坚固，却在其中找不到种子了。种子就比喻为众生的善恶业，都依于色身存在，而在众生色身上却找不到善恶业。但是从色身所享用的现象上来看，就显现出善恶业果报了。</p><p>原文：<strong>如因种有花。种中无花。因花有果。花中无果。花果增进。增进不见。因身有业。因业有身。身中无业。业中无身。亦复如是。</strong></p><p>释：因为有花的种子才有鲜花，但是花种子里却没有鲜花，因为有鲜花才有果实，但是花中却没有果实，花和果互相为因为缘，花生长以后就出果，果出了以后，花就消失，果作为种子生长以后，就有花的出生，花出现以后果就不见了。同理，因为五阴身才有善恶业，因为善恶业，又生成了新的五阴身。在五阴身上找不到善恶业，在善恶业上也找不到五阴身，但是身体确实造了善恶业，善恶业中却含藏着未来世的果报身，果报身的种子犹如花和果。</p><p>原文：<strong>如花熟落。其果乃现。身熟谢殒。业果方出。如有种子。花果之因具有。如是有身。善恶业因备在。彼业无形。亦无熟相。</strong></p><p>释：比如花成熟以后落谢了，果实就显现出来。众生的五阴身老了灭去的时候，一生的善恶果报就出现了。比如先有种子，花果才因为种子而出现，如是因为有五阴身，善恶业的因就具足存在了。善恶业没有形相，也没有成熟的相。</p><p>有了种子，就出生花和果，种子就是花和果的因，种子里含着花和果。善恶业的因是色身五阴，因五阴而造了善恶业，所造的善恶业本身并没有生熟相。</p><p>原文：<strong>如人身影。无质无碍。不可执持。不系着人。进止往来。随人运动。亦不见影。从身而出。业身亦尔。有身有业。而不见业。系着于身。亦不离身。而能有业。</strong></p><p>释：就如人落到地上的身影无形无相，没有质碍，就没法碰触，人们把捉不了。影子也不系缚于人，影子前进后退、行来去止，都是随着人而移动着，可是却看不见影子是从身体里出去的。业报身也是这样，有色身就有业报，可是却见不到业报系缚着色身，同时也不能离开色身，而有业报的出现。</p><p>影子比喻善恶业，善恶业随着人的五阴身而运转。业报是无形的，影子也是无形的，业报随着身体而有，也随着业而有，但是我们却见不到业，只能见得到色身。从色身上就知道果报是善报还是恶报，就知道五阴身前世造了什么样的业行，是善业还是恶业。</p><p>原文：<strong>如辛苦涩。殊味诸药。能涤净除。一切病患。身体充悦。颜色光泽。人见之者。知服良药。药味可取。熟功无形。视不可见。执不可得。而能资人。肤容色泽。</strong></p><p>释：如辛、苦、涩这些各个不同味道的药材，能治疗净除一切的病患，让身体颜貌润泽，色身健康，别人一看就知道他服了良药。药味可以闻得到，但是药所起的功效却是无形无相的，眼睛看不见，手抓不到，而药却能够滋养人，让皮肤有光泽，颜色光亮。</p><p>原文：<strong>业无形质。能资于身。亦复如是。善业资者。饮食衣服。内外诸资。丰饶羡丽。手足端正。形容姝好。屋室华侈。摩尼金银。众宝盈积。安宁快乐。欢娱适意。当知此为。善业之相。</strong></p><p>释：同样的道理，众生所造的善业和恶业，都是无形无质无相的，却能资佐于色身，让色身或者受善福报，或者受无福报，也像药对色身的资养一样。众生造了善业，善业就滋养五阴身，饮食、衣服、卧具，身内身外都被资养得富贵华丽，手足端正，面容端庄，色身外貌庄严端正，所居住的环境，所住的房屋华丽侈奢，有摩尼宝有金银, 众宝装满了房间，过着安宁快乐, 欢娱舒适的生活。见到众生享受这样的生活，就应当知道这是善业的相貌，此人造了善业，得了善报。业本身无相，但从色身上却能够显现出业的相貌。</p><p>原文：<strong>生于下贱。边地贫穷。资用阙乏。悕羡他乐。饮食粗恶。或不得食。形容弊陋。所止卑下。当知此为。恶业之相。</strong></p><p>释：那些生于下贱、边地、贫穷人家的人，他们的果报是什么样的呢？他们所用的资具匮乏，不是缺东就是少西，饮食粗糙难吃，或者什么饮食也没有，常常挨饿受冻，常常羡慕他人的快乐生活，却不知道这是自己曾经造恶业所得的果报。面貌丑陋，脸上没有肌肉，骨头显露，说明他是贫穷相，不是福相，又瘦又枯萎，没有光泽，所住之处都是卑下的部落，山沟野地。从众生这些生活环境来看，就知道这些都是恶业之相，是造恶业的果报。</p><p>原文：<strong>犹如明镜。鉴面好丑。镜像无质。取不可得。如是识资。善不善业。生人天中。或生地狱。畜生等中。大药。应当如是。见业与识。和合迁化。</strong></p><p>释：犹如一面明亮的镜子，能够鉴别出面貌的好丑。镜子里的像是没有质碍的，只是一个影子，镜子里的影子我们却取不出来。看见众生的果报，就知道了众生造了什么业行，就像看见镜子里的影相就知道了镜子外边人的面相，用镜子成像原理，比喻阿赖耶识里含藏着众生所造的善业和不善业，这些业能让众生或者生到人天中，或者生到地狱、畜生、恶鬼等三恶道众生中。大药，应当这样来看待，众生的业种和阿赖耶识就是这样一起和合，迁化到下一世的五阴身当中的。</p><p>原文：<strong>大药言。世尊。云何微识。能持诸根。能取大身。佛言大药。譬如猎者。入于山林。持弓毒箭。而射香象。箭毒沾血。毒运象身。支体既废。根境同丧。毒流要害。身色青赤。犹如淤血。毒杀象已。便即迁化。</strong></p><p>释：大药菩萨问佛说：世尊，为什么这样微细微妙的阿赖耶识，能够执持众生的六根（眼耳鼻舌身意根），还能执取大象、大鹏金翅鸟和龙这样的大身众生？</p><p>佛对大药说：譬如猎人拿着弓箭入于山林中，弓箭上涂了毒药，他拿去射杀大香象，剑上的毒药，渗入到大象的血液里，毒药就随着血液传送到大象的全身。于是大象的身体四肢无力不能动，五根不能用了，六尘境界消失，六识就灭去，大象死亡了。毒液流到心脏等要害部位，全身都青紫青紫的，就像血凝固了一样。用毒药杀大象以后，大象就会死去。</p><p>如果剑上不涂毒药，射中香象以后，香象只伤个皮毛，伤口过一阵子也就愈合了，大象不会倒下来。当弓箭上涂了毒药射破皮肤，毒药渗透到血液里，就随着血液运转到全身，运转到心脏的地方，大象就倒下了。毒药一运转到心脏上，就流遍全身，身体五根就不能运作了，意根见此就决定舍弃大象色身，大象就死亡。中毒而死的，身体就发青发暗，因为血液不流通，不运转了。色身血不流通的地方，都是黑紫黑紫的，流通的地方，皮肤是白净本色。</p><p>原文：<strong>于意云何。毒与象身。多少大小。可得比不。大药白佛言。世尊。毒与象身。多少大小。其量悬殊。不可为对。犹如须弥。比之芥子。</strong></p><p>释：佛对大药说：对于这件事你怎么想呢？毒药和大象的身体比较，其分量和体积大小，有相比性吗？大药菩萨回答说：世尊，毒药与大象的身体相比较，相差很悬殊，无法进行比较，就像须弥山和芥子相比一样，相差太悬殊，没法比较。</p><p>大象的色身有多大，色身有多重，那点毒才多少，为什么那么一点毒，却把大象给杀死了？芥子这么大小的毒，却把须弥山般大的大象给毒倒了，可见毒药虽少，作用极大。而阿赖耶识还没有芥子大，祂起的作用却同样是无穷大，众生无法想象出来，不可思议。</p><p>原文：<strong>佛言大药。如是识弃此身。以取诸根。弃此诸界。随业迁化。亦复如是。</strong></p><p>释：佛对大药说：阿赖耶识抛弃色身，再去执持另一个色身上的诸根，让另一个色身生长出的诸根也是这样，把这个色身的十八界都抛弃掉，随着善恶业迁化到另一个色身上，也是这样。别看阿赖耶识连芥子般的大小都没有，祂的功能作用可真是大，大得无法想象。</p><p>原文：<strong>大药复白佛言。世尊。云何微细之识。任持大身。而不疲倦。佛言大药。须弥山王。高八万四千由旬。难陀乌波难陀。二大龙王。各绕三匝。二龙大息。摇振须弥。内海中水。咸变成毒。此二龙王。长大力壮。和修吉龙德叉迦龙二大龙王。亦与之等。</strong></p><p>释：大药又对佛说: 世尊，为什么这样微细的阿赖耶识，却能够执持着大象的色身而不疲倦也不累呢？佛说：大药，须弥山王高八万四千由寻，难陀乌波难陀二大龙王的身躯，各个环绕须弥山三圈，两条龙大怒的时候，就摇动着须弥山，让四大海水都变成毒性的。这两个龙王，身长力大，和修吉龙德叉迦龙二大龙王的身量力气也和这两条龙王差不多。</p><p>原文：<strong>于意云何。 四龙王识。与蚊蚋识。宁有异不。大药言。世尊。四龙蚊蚋。其识无异。</strong></p><p>释：大药，你怎么认为呢？四个龙王的阿赖耶识与蚊子的阿赖耶识，有什么差异吗？大药菩萨说：四个龙王和蚊子的阿赖耶识没有差异，它们的功能是一样的。只不过蚊子的阿赖耶识的功能被限制住了，本来可以翻天动地的，结果只能执持这么小的身体。</p><p>阿赖耶识执持大象和龙身，却从来没有感到疲倦过，我们做一些事情，意识心就觉得累了，意根就决定休息，或者睡觉。意根了别疲累的状况，也了别整个色身的状况，然后就会起思量作抉择，阿赖耶识就随顺意根，想干什么就尽量干什么。整个色身的刹那刹那状况，阿赖耶识都能显现出来，第七识都能缘到，全部了解，然后随时随地作决定，不断地调节色身，让色身感觉舒适，不致疲劳。</p><p>渴了意根决定喝水，坐得腰疼了，决定换个姿势，或者决定站起来活动活动，这都是意根作主决定的。而意根自己从来不疲倦，从来没有休息过。阿赖耶识无始劫以来，也没有休息过，也是从来不知道疲倦和疲劳。如果我们知道阿赖耶识每天都做些什么，大智慧就出现了。无论什么法，都是阿赖耶识变造出来的，至于是如何变造的，那就要悟后慢慢观行了。</p><p>由旬是印度语，小由旬就是四十里，中由旬是六十里地，大由旬是八十里地，须弥山高八万四千由旬算一算有多高大，难陀乌波难陀二大龙王身长能绕须弥山三圈，这龙身够大了吧，但是大鹏金翅鸟专门吃这些龙，大鹏金翅鸟该有多大，不可想象，它张开两个翅膀，就能把太阳给遮住了，地球上就黑暗无光。</p><p>四大海水里就有四大龙王，每个大海水各有一个龙王，四个龙王的阿赖耶识和蚊子的阿赖耶识是一样的，但是蚊子的阿赖耶识却执持着那么小的身体，那是由蚊子的业种决定的。阿赖耶识是随着业种而变现色身的，佛的无垢识能变现佛身，众生的阿赖耶识让众生做凡夫。阿赖耶识的功用相同，但是变造出来的色身却不一样，都是因为业力的不同。佛的无垢识能变现出大千世界，而且能变现出无数个三千大千世界，那蚊子的阿赖耶识呢，只能让蚊子吸一点血，有时吃一点饮食都做不到，所以这个业力也很厉害，能局限阿赖耶识殊胜的功用。</p><p>原文：<strong>佛言大药。如一小渧。跋错那婆。入四龙口。四龙便死。于意云何。小渧药毒。龙口中毒。何毒为大。大药白佛言。龙口毒大。小渧药毒。甚为微少。</strong></p><p>释：佛说：大药，如果有一点点的跋错那婆毒药（这是自制的一种毒药），只需要像一滴水那么大的一点，入到四个龙王的口里，四个龙王马上就会死亡。别看四条龙能让四大海水全部充满毒药，但是只需要一小点渧跋错那婆毒药，龙王们都受不了，必中毒而死。大药，你怎么认为？一滴水量的药性毒，和龙口中的药性毒，哪个毒性大？大药菩萨说，龙口的药性更毒，小水滴大的毒药性太微小了。</p><p>这一点点水滴似的毒性非常微不足道，跟龙的身体不成比例，跟龙口喷出来的毒药性也不成比例，却能够起这么大的作用，能毒死龙王。阿赖耶识没有水滴大，也没有微尘大，没有质量没有形状，所起的作用却是无边广大，十方世界都能变现出来，这个厉害不厉害？真是厉害而神奇！</p><p>原文：<strong>佛言大药。大身众生。力敌九象。微妙之识。无色无形。非分别量。随业任持。亦复如是。</strong></p><p>释：佛说：大药，那些大身众生，其力能敌得过九头大象。这个大象还要看是什么大象，天上的大象叫作香象，还有比这个香象更厉害的，它的力量比得上九头大象。微妙的阿赖耶识，无色无形，本身不分别一切法，不知法的善恶美丑大小和方圆，但却能随着众生的善恶业，来执持众生的色身，也像毒药这样的有威力。</p><p>原文：<strong>如尼瞿陀子。极微细。种之生树。婆娑广大。枝条百千。于意云何。其子与树。大小类不。大药言。世尊。其子与树。大小相悬。如藕丝孔。比虚空界。</strong></p><p>释：比如极其细小的尼瞿陀子，是一棵非常高大的树的种子，把这颗树种子种到地里以后，就会长出一棵参天大树，这棵树婆娑广大, 枝条百千，伸到虚空中，很高很大。大药，你怎么认为，这颗细小的种子和大树能相类比吗？大药说：世尊，这颗种子和大树相差也太悬殊了，就像莲藕上的那些孔，和虚空法界相比，根本不能比。</p><p>原文：<strong>佛言。如是大药。树于子中。求不可得。若不因子。树则不生。微细尼瞿陀子。能生大树。微细之识。能生大身。识中求身。身不可得。若除于识。身则无有。</strong></p><p>释：佛说：确实是这样，大药，在大树的种子里去找大树，是找不到大树的。但是如果不是因为树的种子，大树则不能出生。那么微细的阿赖耶识, 能出生众生的大身，但是要在阿赖耶识当中找大身，却了不可得，是找不到的。如果没有阿赖耶识，也就没有色身。</p><p>原文：<strong>大药复白佛言。云何金刚坚固。不可坏识。止于危脆。速朽身内。佛言大药。譬如贫人。得如意宝。以宝力故。高宇雕镂。妙丽宫室。园林郁茂。花果敷荣。象马妓侍。资用乐具。自然而至。其人于后。失如意宝。众资乐具。咸悉销灭。</strong></p><p>释：大药又问佛说：为什么像金刚那样坚固不可毁坏的阿赖耶识，能住在脆弱迅速腐朽的色身内？阿赖耶识在《金刚经》里又叫金刚不坏体，色身可以腐朽坏掉，阿赖耶识却像金刚一样坚固不坏。佛说大药，就像贫穷的人得到了如意宝珠一样，因为如意宝的神力作用，就能随意出现资生用具。如高楼大厦、美丽而富丽堂皇的宫殿、郁郁葱葱的园林、盛开的鲜花和成熟的果实、象马车乘、奴婢侍者，这些生活用具自然而然，就出现在自己面前。如果这个人后来丢失了如意宝，那些生活所用的用具，就会全部消失殆尽。</p><p>如意宝神奇而坚固，非常牢靠，纵然有一千个金刚，也不能毁坏它。可是它所变化出来的资生用具，却是能迅速散坏的。阿赖耶识就像如意宝一样，永远不可毁坏，可是祂所出生和执持的色身却是能迅速消失和灭亡的。我们现在的这个色身资具，就是阿赖耶识变现的，但祂为什么不给我们提供更好的资具呢？因为阿赖耶识受我们的业力局限，随自己的善恶业而变现生存资具。</p><p>原文：<strong>如意神宝。坚固真牢。纵千金刚。不能毁坏。所生资用。虚假无常。速散速灭。识亦如是。坚固不坏。所生之身。速朽速灭。</strong></p><p>释：世间的如意神奇的宝贝是坚固和牢固的，即使有一千个金刚也不能把它毁坏，但是它所变现的资用工具，却是虚假无常, 速散速灭的，说毁坏就毁坏，说消失就消失，说散去就散去。阿赖耶识也同样是坚固不可坏的，但是祂所生出来之五蕴身，却速朽速灭。</p><p>别说有千个金刚，即使有千万亿个金刚、无量个金刚，也不能毁坏阿赖耶识，没有任何人和物能毁坏阿赖耶识。为什么毁坏不了阿赖耶识？因为祂是无形无相、不生不灭的，阿赖耶识如果是有形相的，再坚固也都能被摧毁，都能灭失。当世间都消亡了之后，没有了世间，也就没有了一切法，什么坚固的宝也不能存在了，金刚和如意宝也同样都能消失不见，因为一切相必须依托着世间才能存在，没有世间，一切相就没有依止了。</p><p>色身不坚固，速生速灭，人身百八十年就灭了，很多人觉得这一辈子的时间很长，其实在天人眼里就那么几分钟，有些蚊虫之类的众生也是活了一辈子，它那一辈子在我们的眼里，也就是几分钟几个小时，有的细菌生出来几分钟就没有了，即使我们不杀死它们，也很快就消失了。即使天人有几千年的寿命，他们那几千年比我们人间的几千年还要长几百倍甚至几千倍，但是在其他的佛国土的菩萨眼中，那也是很短的寿命。</p><p>有些人觉得自己到了极乐世界，转个身就能回来，但是那一个转身，一弹指的时间，在我们的娑婆世界，多长时间就过去了？说不定地球都没有了。时间是一个虚假相，随着我们的福德可长可短，福报越大，所感时间越长，福报越小所感时间越短。相反，在三恶道里，福德越小，受罪时间越长，饿鬼道的一年，相当于我们世间的几百年几千年。</p><p>地狱一年，在我们人间也有几千年了，越苦的众生就越感觉时间慢长，越快乐的众生感觉时间就越短。无想天的八万大劫，等于人类地球多长时间，没有办法计算，对于那里的天人来说，弹指之间就过去了。我们如果打坐入定一小时，对别人来说可能很长时间过去了，对我们自己来说却很快就出定了，快乐的时间就感觉很短，痛苦的时间感觉就长。</p><p>无明业力遮蔽着众生的心，见不到最极坚固的阿赖耶识，有业就有妄想执着，有无明就有妄想执着，有妄想执着就有遮障，只见假不见真，不能证得法界实相。如果多忏悔就能消业去除遮障，修行才能上道。如果临终的时候业没有消，就有遮障，不能往生善道，还会下三恶道受苦。业障让众生在临终时心不清明，不能念佛，障碍往生人道、善道和净土。只有忏悔、回向，修善法，多积福，让愿力大于业力，福德大于业力，强者先迁，才能刹那往生善道。</p><p>修行就是总让善业的力量大于恶业的力量，总受善报，恶业不断的往后推延，在未来世道力增强了以后，受果报就是小事一桩，不成问题了，比如从前杀过人，但是现在却成了几地菩萨，这个杀人的恶业就是小问题了，不至于遮障修学佛道，已经修成就时福德增加了，还一条命不要紧，还能变化出很多色身来自利和利人。再比如自己现在成为大富翁了，遇见债主讨债还一点小债，根本不算问题，举手之劳，而在贫穷下贱的时候，一点小债都还不起。等修习善法，福德力量大了，还什么债务都还得起，不成问题，直到最后修学成佛。</p><p>原文：<strong>大药言。世尊。柔妙之识。云何穿入。粗鞕色中。</strong></p><p>释：大药菩萨说: 世尊，阿赖耶识无形无相，那么微妙柔顺，祂是如何穿进又粗又硬的色身当中的？</p><p>比如大象的皮是非常的粗硬和厚重的，阿赖耶识是如何进去的？阿赖耶识不是从皮肤穿进去的，在大象出生之前，阿赖耶识就已经进去了，然后一直在维持着大象的身体，不管大象长出多厚的皮肤，祂不从皮肤当中出入，也不从大象的任何部位往来，因为阿赖耶识没有形质，就没有出入。大象死了之后，阿赖耶识确实又从大象的身体中出来了，也仍然没有出来的相貌，谁也见不到阿赖耶识出入大象的身体，所以说阿赖耶识不来不去。</p><p>原文：<strong>佛言大药。水体至柔。激流悬泉。能穿山石。于意云何。水石之质。鞕软如何。大药言。世尊。石质坚鞕。犹若金刚。水质柔软。为诸乐触。</strong></p><p>释：佛说：大药，水体是那么轻柔，但是水流非常湍急的时候，从悬崖上飞流而下，却能穿破山石。水和岩石的质地相比较，其软硬度如何？大药说：世尊，石头的质地非常坚硬，就像金刚一样；而水的质地却是柔软的，水触身体上的时候，就是一种乐触。</p><p>水和石头二者的质地比较起来，软硬程度确实相差太大。但是柔软的水却能够起到那么大的作用，把石头击穿。所以坚硬的东西未必是真的坚硬，柔软的东西未必就脆弱。</p><p>原文：<strong>佛言大药。识亦如是。至妙至柔。能穿刚鞕。大身之色。迁入受报。</strong></p><p>释：佛说：大药，阿赖耶识也是这样，又微妙又柔软，却能穿透最坚硬的色身，能迁入到大身众生的身上，让众生受报。</p><p>说阿赖耶识柔软，仅仅是一个比喻，无形无相没有质碍的识心，不能说柔软和坚硬，而能住在所有刚硬的大身中，确实是微妙难思议的。鬼神的识心附着在大象和龙的身上，是不是一种穿透和进入？不是。是住在大象的身体里了吗？也没有，只是一种执持的方式罢了。</p><p>阿赖耶识也没有穿透或者不穿透之说，凡是识都能执持色法而起应有的作用。如果有鬼神附着在木头上，附着在石头上，也能让石头或者木头移动，而没有进入石头和木头里面；鬼神附着在一个房子上，也能让房子移动，却不在房子的里外和中间。过去有个灶神，附着在炉灶上，把炉灶当自己的身体，可是在炉灶上根本就找不到灶神。阿赖耶识也是如此，没有色体，没有形状，却有执持作用。</p></div>"
},{
    "title": "第十章 众生云何生天和入地狱",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十章  众生云何生天和入地狱</strong></p><p>原文：<strong>大药复白佛言。世尊。众生舍身。云何生诸天中。乃至云何。生于地狱等中。佛言大药。众生临终之时。福业资者。弃本之视。得天妙视。以天妙视。见六欲天。爰及六趣。见身摇动。见天宫殿。及欢喜园。杂花园等。又见诸天。处莲花殿。丽妓侍绕。笑谑嬉戏。众花饰耳。服憍奢耶。臂印环钏。种种庄严。花常开敷。众具备设。</strong></p><p>释：大药又对佛说：世尊，众生舍弃了色身之后，他是如何升到各层天上，又是如何下到地狱的？佛对大药说：众生临终之时，有福业资养的人，就会舍弃做人时的视觉作用，获得一种神通妙觉，有天眼通，能见到六欲诸天，以及六道众生，见到天人的色身动转，以及天上的宫殿和欢喜园林、杂花园林等等。又看见诸天天子，坐在莲花宫殿中，有天生丽质的妓女和侍从围绕着，互相嬉戏谈笑，耳朵上带着很多花朵，穿着最珍贵的服装，手臂上带着装饰物。所用之具，种种庄严，鲜花常常开放，摆设齐备。</p><p>舍弃了人身上的见闻觉知，得到了天人的见闻觉知，其实人的见闻觉知性也很微妙，色不到眼，眼不到色，却能有见，六根不到六尘，却能见六尘，甚是奇怪。天人的见闻觉知性当然更微妙，无事不知无事不晓，能看到地狱，能看到天界，六道众生都能看到，能看到其它世界，确实很微妙。</p><p>原文：<strong>见天天女。心便染恋。欢喜适意。姿颜舒悦。面若莲花。视不错乱。鼻不亏曲。口气不臭。目色明鲜。如青莲叶。身诸节际。无有苦痛。眼耳鼻口。又无血出。不失大小便利。不毛惊孔现。掌不死黄。甲不青黑。手足不乱。亦不卷缩。好相显现。</strong></p><p>释：有福德之人命终看见天子天女，心里就生起了欲染贪恋之意，内心欢喜，心意舒畅，容颜舒展，神情愉悦，面像桃花，目光不乱，鼻子也不塌陷，口气也不臭秽，眼睛明亮不浑浊，就像青莲叶似的。身体任何骨节都没有苦痛，眼耳鼻口都不会流血，也没有排大小便的事情，绝对不会惊吓得汗毛竖起、毛孔大开。手掌也没有像死人一样的发黄，手指甲也不青黑，手脚都不乱动，也不蜷缩着，所有的好相都出现了。</p><p>原文：<strong>见虚空中。有高大殿。彩柱百千。雕丽列布。垂诸铃网。和风吹拂。清音悦美。种种香花。庄严宝殿。诸天童子。众宝严身。游戏殿内。见已欢喜。微笑齿现。如君图花。目不张开。亦不合闭。语音和润。身不极冷。亦不极热。亲属围绕。亦不忧苦。日初出时。当舍其寿。所见明白。无诸黑闇。异香芬馥。四方而至。</strong></p><p>释：此人看见虚空中有高大的宫殿，宫殿里面有百千根彩色的梁柱，雕刻得华丽庄严，柱子上悬挂着铃网，和风吹拂时，铃网就发出清扬悦耳的美妙音乐，又有种种香花庄严着宝殿。各层天上的童子们，都用许多种宝贝庄严其身，在宫殿中玩耍嘻戏。</p><p>此临终人看见这些景象，非常欢喜，微笑时牙齿就显露出来了，就像君图花一样。眼睛不开不合，半睁半闭，语音柔和圆润，身体既不特别冷，也不特别热。周围有亲属围绕着，心不觉忧悲苦恼。在太阳刚出现时就该舍寿了，这时所见一切都是光亮的，没有黑暗，周围天香浓郁，从四面八方涌来。</p><p>原文：<strong>见佛尊仪。欢喜敬重。见已亲爱。欢喜离辞。犹如暂行。便即旋返。安慰亲知。不令忧恼。有流法尔。生必当死。勿以分别。而生苦恼。</strong></p><p>释：这时这个临终人会看见佛的威仪相好庄严，于是心生欢喜和敬重。然后又看到这一世的家亲眷属和所亲爱的人，就高高兴兴地跟他们辞别，就好像是暂时外出很快就会回来的样子。他告诉自己的六亲眷属和亲戚邻里说：你们不要难过，在世间里生死流转就是这样，都是缘聚缘散的，有生就有死，本来就是这样，不要因为我们的别离而生苦恼了。</p><p>原文：<strong>大药。善业之人。命终时好乐布施。种种伽他。种种颂叹。种种明白。种种称说。正法之教。如睡不睡。安隐舍寿。将舍寿时。天父天母。同止一座。天母手中。自然花出。天母见花。顾谓天父。甚为福吉。希奇胜果。天今当知。子庆之欢。时将不久。天母遂以两手。摇弄其花。弄花之时。命便终尽。</strong></p><p>释：佛对大药说：有善业的人，临命终时, 喜乐于布施。用种种偈子和赞颂，以种种明了的语言，用种种的言词宣传佛陀所教的正法，然后似睡非睡地安稳舍寿了。在他即将舍寿时，他的天父和天母坐在一起，天母手中，自然地就出现了一朵花，天母看见手中的花，回头对天父说：我们现在是太幸福和吉祥了，非常稀奇而殊胜的果报出现了，天子当知，我们不久就要庆祝儿子的诞生了。天母说完，就以两只手摇晃手里的花，这边摇晃时，命终之人就死亡了。</p><p>原文：<strong>无相之识。弃舍诸根。持诸境业。弃舍诸界。持诸界事。迁受异报。犹如乘马。弃一乘一。如日爱引光。如木生火。又如月影。现澄清水。</strong></p><p>释：无形无相的阿赖耶识，舍弃了诸根以后，带着众生在六尘境界里所造作的诸业种，舍弃了十八界，带着众生在十八界中所造作的诸事业种子，迁入其他的果报色身当中。就像骑马一样，跳下一匹马，再乘上另一匹，如太阳牵引着光辉，如木头生出火苗，如月影出现在澄清的水中。</p><p>原文：<strong>识资善业。迁受天报。如脉风移。速托花内。天父天母。同座视之。甘露欲风。吹花七日。宝珰严身。曜动炫焕。天童朗洁。现天母手。</strong></p><p>释：阿赖耶识含藏着善业，就转到天人的业报当中，就像身体气脉当中的风大移动那样，阿赖耶识把天人的色身迅速地托载在天母手中的花朵上，天父和天母坐在一个座位上一起看着自己的孩子。天上的甘露和微风，吹拂花朵七天之后，天上的宝垱就庄严了天童的色身，显得光彩夺目，天童俊朗洁净，就出现在天母的手上了。</p><p>原文：<strong>大药白佛言。世尊。无形之识。云何假因缘力。而生有形。云何有形。止因缘内。</strong></p><p>释：大药菩萨问佛说：世尊，无形无色的阿赖耶识，是如何假借着这些因缘的力量，而出生了有形的色身？为什么有形的色身依止于因缘当中呢？</p><p>色身出生的因缘，包括天父天母的缘，善恶业的缘，阿赖耶识借着这些因缘而生出了天子那个有形有相的色身。有形的五蕴如何住在这些因缘之内呢？大药菩萨就问佛这个问题。</p><p>原文：<strong>佛言大药。如木和合。相触生火。此火木中。求不可得。若除于木。亦不得火。因缘和合。而生于火。因缘不具。火即不生。木等之中。寻火色相。竟不可见。然咸见火。从木中出。</strong></p><p>释：佛对大药说：就像两根木头和合在一起，互相摩擦，摩擦之后就生出火来了，木头里并没有火，但是除去木头，火也就没有了，是木头和磨擦的因缘和合生出了火，借着木头和人工摩擦的因缘，就可以生出火来，如果因缘不具足的时候，火就不能生出。但是在木头里寻找火的色相，竟然了不可得，可是所有人都能看见火是从木头当中出来的。</p><p>木头里为什么能生出火来？因为木头里面有火大，火大要现前，要借助一定的因缘，没有因缘是不会生出火来的。比如天然气里有火性，但是我们不点燃它，就不会生出火，一切法都要借助一定的因缘，才能够显现出来，没有这些因缘，这一切法都不能出现。有木头，还得有人为的摩擦才能生出火，因缘和合, 火就出现了。</p><p>原文：<strong>如是大药。识假父母。因缘和合。生有形身。有形身中。求识不得。离有形身。亦无有识。大药。如火未出。火相不现。亦无暖触。诸相皆无。如是大药。若未有身。识受想行。皆悉不现。</strong></p><p>释：佛说：大药，阿赖耶识也是这样，要假借父母和合的因缘，才能够生出五蕴色身，在五蕴身这个有形的色身中去找阿赖耶识，却是找不到的。因为阿赖耶识不住在色身上，无形无相的没有住相，但是离开这个有形相的色身，也就没有阿赖耶识可找了，离开色身找不到阿赖耶识。所以阿赖耶识不离五蕴身，又不在五蕴身而作诸事业，起诸作用。</p><p>大药，火还没有出来的时候还没有火的形相，火的暖触相也没有，什么相都没有。同理，色身在没有生出来之前，五蕴的受想行识都不会现前。当五蕴身具足的时候，受想行识才会出现，其功能作用也就都显现出来了。</p><p>原文：<strong>大药。如见日轮。光明照曜。而诸凡夫。不见日体。是黑是白。黄白黄赤。皆不能知。但以照热光明。出没环运。诸作用事。而知有日。识亦如是。以诸作用。而知有识。</strong></p><p>释：大药，比如说看见那轮太阳，其光明照耀着大地，而凡夫众生们只能看见光明，看不见太阳本体，太阳是黑是白, 是黄白色的还是红黄色的，都不知道。众生虽然看不见太阳本体，但是从光明的照耀、天气的炎热和亮光上，从太阳的出生和落下的循环运转上，所做的种种事业上，就能知道有太阳。阿赖耶识也是这样，以祂所做的种种事业，就能知道有阿赖耶识的存在。</p><p>要证得太阳的作用，可以拿着放大镜，在干草堆上聚焦，一会干草就会燃烧，从太阳在干草上所显现的作用上就知道有太阳，虽然我们看不见太阳。阿赖耶识也是这样，众生看不见阿赖耶识，但是以祂所起的作用，我们就知道有阿赖耶识。那阿赖耶识都起到什么作用呢？这就需要我们参禅去求证。</p><p>原文：<strong>大药白佛言。云何为识作用。佛言大药。受觉想行。思忧苦恼。此为识之作用。复有善不善业。熏习为种。作用显识。大药白佛言。云何识离于身。便速受身。识舍故身。新身未受。当尔之时。识作何相。</strong></p><p> 释：大药菩萨问佛说：阿赖耶识的作用到底是什么？佛对大药说：受想行识、忧悲苦恼, 这些都是阿赖耶识的作用，还有善业与不善业，熏染成了种子，种子起用就显现出阿赖耶识了。真识和妄识和合运作的作用，有阿赖耶识的作用，也有六七识的作用。</p><p>大药对佛说：阿赖耶识是如何离开原来的色身，然后就能迅速地出生下一个色身的？阿赖耶识舍弃原来的色身，在新的色身还没有生起的时候，这个时候阿赖耶识是什么相貌？舍身受身还有一个中间的状态，在中间的这个状态里，阿赖耶识是什么样的一个相貌呢？</p><p>原文：<strong>佛言大药。如有丈夫。长臂勇健。着坚甲胄。马疾如风。乘以入阵。干戈既交。心乱坠马。武艺捷习。还即跳上。识弃于身。速即受身。亦复如是。又如怯人。见敌怖惧。乘马退走。识资善业。见天父母。同座而坐。速托生彼。亦复如是。</strong></p><p>释：佛说：大药，譬如有个勇士非常的勇敢，两条胳膊又长又健壮有力，穿着坚硬的盔甲，骑着一匹疾跑如风的战马冲入敌阵，然后兵戈相交, 这个勇士由于心乱坠落到马下，但因为他训练有素，武艺高强，又迅速地跳到马身上去。阿赖耶识舍弃原来的色身，迅速地纳受新的色身也是这样，从这个身体里出来，又迅速的受持另一个色身。又像非常胆小的人，看见敌人内心恐惧，乘着马就退回去了。阿赖耶识滋养着善业，此人即见到天父天母同坐在一起，就迅速地托生到天母手中的花上，二者道理是同样的。</p><p>原文：<strong>大药。如汝所问。识弃故身。新身未受。当尔之时。识作何相。大药。譬如人影。现于水中。无质可取。手足面目。及诸形状。与人不异。体质事业。影中皆无。</strong></p><p>释：佛说：大药，就如你所问的那样，阿赖耶识舍弃原来的色身，新的色身还没有出现的这个时候，阿赖耶识是什么相貌，现在的色身和下一世的色身中间，阿赖耶识是什么状态。大药，譬如人的影子，显现于水中，没有质碍色，你向水中去捞，是捞不到影子的。水里面的手足面目和形状，跟本人是一模一样的，但是却没有人的实体和本质，不能做人所做的事业。</p><p>原文：<strong>无冷无热。及与诸触。亦无疲乏。肉段诸大。无言声身声。苦乐之声。识弃故身。新身未受。相亦如是。大药。是资善业。生诸天者。</strong></p><p>释：那个影子上没有热度也没有冷度，也没有各种触觉，也不会感觉疲乏、口渴、饥饿、寒冷，这些它都感觉不到。它也没有肉体和地水火风四大，又不会发出任何一种声音，口不会说话，身体的动静也没有，既没有痛苦的声音，也没有快乐的声音。影子没有色声香味触法，没有眼耳鼻舌身意，无眼识，乃至无意识，没有五蕴，五阴十八界都没有，它只是一个影子。阿赖耶识本体也如影子一样，是空性心，无形无相，没有十八界，没有五蕴，没有一切法。在舍弃旧身，未受新身的中间状态里，阿赖耶识的相貌就是这样，这是善业资助着阿赖耶识，出生了天人的色身。</p><p>原文：<strong>大药白佛言。云何识生地狱。佛言大药。行恶业者。入于地狱。汝当谛听。大药。此中众生。积不善根。命终之时。作如是念。我今于此身死。弃舍父母。亲知所爱。甚大忧苦。</strong></p><p>释：大药对佛说：阿赖耶识是如何出生地狱身的？佛说：大药，造作恶业的人，如杀人、严重的杀生就要下地狱，还有的造破和合僧业、破三宝业，都会下地狱。大药，你仔细听，这些造恶业的众生，集积了不善业、不善根，命终之时, 心里就会有这样的念头出现：我现在死在这里，舍弃了父母、亲属朋友和所有我所爱恋的人，心里感到特别的忧悲苦恼。</p><p>原文：<strong>见诸地狱。及见己身。应合入者。见足在上。头倒向下。又见一处。地纯是血。见此血已。心有味着。缘味着心。便生地狱。</strong></p><p>释：有此心念之后，此命终人就看见了地狱的景象，也看见了自己即将入地狱的色身。如果其业应该堕入地狱中，他就能看见自己脚在上，头倒向下。同时又看见地狱某处的地上都是鲜血，看见鲜血以后，业力所使，心里就贪恋这些血色，由于这种贪味之心，就被地狱境界所系缚，于是就生在地狱中，不得出离了。</p><p>原文：<strong>腐败恶水。臭秽因力。识托其中。譬如粪秽臭处。臭酪臭酒。诸臭因力。虫生其中。入地狱者。托臭物生。亦复如是。</strong></p><p>释：此人因为恶业之业力使然，临命终时心里突然贪爱腐败臭秽的血水和肮脏的恶水，阿赖耶识就被拘执在这些臭秽物中，地狱身就诞生了。譬如粪秽的恶臭之处，恶臭的酒酪之处，因为有臭秽之力，业力与此相应的虫子就托生在其中，出到粪秽之外便将死亡。同样，即将入地狱的众生，由于业力的缘故，也要托生在这些臭秽之处，不得出离，出到地狱之外即得死亡，即便解脱地狱身。</p><p>临命终时的念头很重要， 一辈子做善业的人，命终的念头都是善的，心里念叨的都是所做的善事；造恶业的人，命终的念头都是恶的，心里想的都是所做的恶事。于是就会顺着自己的念头，出现善恶境，由于贪爱善恶境，就被善恶境所拘执，而生死流转不休。</p><p>众生入地狱，主要是由于意根的贪爱所致。众生在临命终时，意根有选择性，可以避开地狱等三恶道，可是由于平时意根没有修行，完全与业力相应，这时就要贪爱恶处肮脏之处，被恶处所拘禁，不得不托生于三恶道。实际上到三恶道中轮回，还是意根抉择的结果。这时的意根完全受控于业力，听从业力指挥，本来不应该贪爱血水、臭秽等物，这时偏偏要贪爱这些，没有一点警觉性，意识在旁边也没有起到应有的把控作用，意根就选择了三恶道之处，被拘执到三恶道里。</p><p>原文：<strong>贤护胜上童真。合掌白佛言。地狱众生。作何色相。身复云何。佛言贤护。其爱血地。生地狱者。遍身血光。身如血色。生汤隍者。身如黑云。生乳汤河者。身点斑杂。作种种色。体极软脆。犹如贵乐婴孩之身。</strong></p><p>释：贤护胜上童真合掌对佛说：世尊，地狱众生的长相是什么样的？身体是什么样的？佛说：贤护，喜欢血的那些众生，生到地狱里，色身是什么样的呢？他们遍身血光, 浑身是血色，他们的业力与污秽的血液相应，就生到血光地狱里，遍身都是血光，身体是血液色的。地狱有好多种，要看众生所造的是什么业。生到恶臭、乌黑地狱的众生，身体像黑云一样，漆黑漆黑的。生到乳汤河的众生，身上有斑点杂染，各种色彩混在一起，什么颜色都有，身体极其柔软而脆弱，像没有筋骨的小孩子的身体似的，又软又脆。</p><p>原文：<strong>其身长大。过八肘量。须发身毛。并长垂曳。手足面目。亏曲不全。阎浮提人。遥见便死。</strong></p><p>释：他们的身体又高又大，身高大约超过四米，头发和身上的汗毛是同样的长度，一直垂下来。他们不是缺手就是缺脚，不是缺鼻子就是缺眼睛，面目不全，整个面目都不饱满圆润，都是瘪曲而瘦弱的。这样的相貌，都是因为造了恶业的缘故，才生得这样的恶相和薄福相。南瞻部洲临终的人，远远地看见这些地狱的景象现前，他就咽气死亡了。</p><p>原文：<strong>大药白佛言。地狱众生。以何为食。佛言大药。地狱众生。食无少乐。惶惧驰走。遥见镕铜赤汁。意谓是血。众奔趣之。又有声呼。诸有饥者。可速来食。便走向彼。至已而住。以手承口。狱卒以热铜汁。写手掬中。逼之令饮。铜汁入腹。骨节爆裂。举身火起。</strong></p><p>释：大药菩萨问佛说：世尊，地狱众生吃些什么饮食？佛对大药说：地狱众生饮食时，一丁点的乐趣都没有，他们饥饿时惶恐地到处乱走，走得非常快，就为了去寻找饮食。这些喝血的、以血为食的地狱众生，远远地看见铜溶化出来的红色的汁液，以为是血液，大家都奔跑过去，边跑边大声地呼喊说：肚子饿了的人都赶快来吃啊。</p><p>这时候这些众生还有一点善心，呼喊同伴也来吃饮食，他们叫喊着：谁饿了这里有血，快来吃吧。然后就走到熔化的铜汁那里，停住以后，用手托着铜汁往口里送。地狱的狱卒是专门惩罚地狱众生的，看到这些众生真的过来找饮食吃，就把这些热铜汁倒在他们的手中，逼迫他们喝到肚子里。铜汁入到他们的肚子里以后，骨头关节都被烧得爆裂开了, 整个身体都着火了。</p><p>原文：<strong>大药。地狱众生。所食之物。唯增苦痛。无少安乐。地狱众生。苦痛如是。识不舍之。亦不毁坏。身如骨聚。识止不离。非业报尽。苦身不舍。</strong></p><p>释：大药，地狱众生所吃的食物，只能增加他们的痛苦，没有一点安乐之处，他们就是这样的痛苦。虽然如此，阿赖耶识也不离开色身而让他们死亡，也不让他们的色身毁坏，身体都被烧焦了以后，马上又变得完好如初，再接着到处找食物，再次遭受痛苦。这些痛苦总是在重复着，身体瘦得就像一堆骨头聚集起来的一样，可是阿赖耶识也止住其中，不肯舍离其身。如果众生的业报还没有报尽，阿赖耶识就会始终陪伴着，不会舍离苦报身。</p><p>原文：<strong>饥渴苦逼。便见园林。花果敷荣。广博翠茂。见已喜笑。互相谓言。此园翠茂。清风凉美。众急入园。须臾暂乐。树叶花果。咸成刀剑。斩截罪者。或中破身。分为两段。或大叫呼。四面驰走。狱卒群起。执金刚棒。或执铁棒。铁斧铁杖。啮唇嗔怒。身出火焰。斫棒罪者。遮不令出。</strong></p><p>释：这些地狱众生们又饥又渴，苦恼逼迫着便看见一处园林，花果敷荣茂盛，园林广大青翠茂密，他们见到以后，就高兴得笑了，互相告慰说：这个园林可真青翠茂盛啊，清风也很凉爽可意，于是大家都急急忙忙地进入园林中，享受暂时的快乐。可是须臾间，树叶和花果全都变成了刀剑，斩杀着这些罪人，他们有的身体从中间被砍成两段，有的痛苦得大呼小叫，四面八方地奔逃。成群的狱卒们一起拿着金刚棒、铁棍子、铁斧头、铁刀杖，张着嘴唇现出嗔怒相，身体里冒出火焰，拼命地打杀这些罪人，遮挡阻止他们逃出园林。</p><p>原文：<strong>斯皆己业。见如是事。狱卒随罪者后。语罪者云。汝何处去。汝可住此。勿复东西。欲何逃窜。今此园者。汝业庄严。可得离不。</strong></p><p>释：这些景象都是地狱众生自己的业力所感，有恶业才能见到这样残酷之事。狱卒紧随着罪人身后，对罪人们说：你们到哪里去？就在这园林中止住吧，不要再东奔西跑的了，你们想要逃到什么地方去呀？现在这个园林，是你们造的罪业所感招出来的，能逃脱得了吗？</p><p>地狱众生都是这样的受着刑罚，遭受着痛苦。比如无间地狱，众生的色身非常广大，地狱有多大，色身就有多大，所有的刑具都加在色身上，然后狱卒用这些刑具惩罚这些罪业众生，地狱众生就痛苦得昏死过去。可是业风一吹，却又活过来了，再接着痛苦受罪，不管怎么样他们就是不死，想死也死不成。不管他们昏迷到什么程度，阿赖耶识也不舍色身，还在他们的色身上不离开，众生只能痛苦不断，这就是地狱众生的果报。如果他们的业报受尽了，阿赖耶识就会离开地狱色身，在其他道里出生另外的五阴身，去受其他的业果报。</p><p>地狱里到处都是惩罚罪人的刑具，那狱卒是怎么出现的？是罪人的阿赖耶识所变现的，并没有真正的狱卒。没有罪业的人到地狱里走一遭，可能就看不见狱卒，或者看见狱卒，也不会受到他们的惩罚。狱卒和刑具都是罪业所感变现起来的一种幻相和假相，恶鬼道里的阎王也都是众生的阿赖耶识所变现的假相，包括判官，一切都是自心所变现出来的，都是一种幻相和幻境。</p><p>明心见性以后就知道，一切境界都是阿赖耶识变现出来的，哪有什么罪业和苦业，都是虚妄的。如果证得了此理，就消了三恶道业，重罪轻报了。以前杀过人，本来要下地狱的，这回不用去地狱受报，将来在人中遇见自己所杀的那个人，被他杀一回还了债，就把业消了。</p><p>世尊在《金刚经》中说，若为人轻贱，是人先世罪业应堕恶道，以今世人轻贱故，先世罪业即为消灭。所以如果有人加辱于自己，诽谤自己，是在给自己消业障，你学佛越精进，越有人来给你消业，如果都能忍忍不发，不知道能被消了多少的业。本来应该是要下三恶道的，有人来污辱你，轻视你，说了几句诽谤的话，罪业就消了，很值的，所以被他人轻贱，还是好事。如果有人总是奉承、恭敬、抬举、赞扬自己，是在给自己消福。一般人都愿意被人赞扬，不愿意被人轻视，一天到晚总是扬着头、挺着胸，口里总是我我我的，我慢非常重。</p><p>众生总是觉得自己很重要，自己的家庭很重要，自己的小团体大团体都很重要，和自己有关的一切都重要，都是最好的，其实就是我心重。都是把五阴身当作我，与其他人相争相比，什么智慧、才华、面貌、金钱、权势、家族，都是以这些为自豪，在虚妄法上做比较，还是把虚妄法当作真实不灭的法，这就是无明，因为无明而不断地增长我慢。这些法都依着五阴身而有，五阴灭，这些法就会随之而灭。五阴身是这么的虚妄不实，依着五阴身而有的权势、地位、财产、相貌、家族，更是虚妄不实。</p><p>所有众生其实都是平等的，众生的本质就是阿赖耶识如来藏，所有的如来藏在任何一个方面都是平等的，只是所现起的假相是不平等的，尊贵与卑微是五阴的假相，这个假相是生灭的不久常的，到最后，众生更平等，都是一尊佛。所以学佛人不应该再执著假相了，要看众生的实质，实质都是如来藏和一尊未来佛。</p><p>如果地狱众生知道五阴世间是虚妄的，就从地狱中出来了，因为不知道，还执为实有，地狱业就不能消。所以学佛人虽然下地狱，总比地狱里不信佛的人明理，出地狱就容易。心里生出一念，想到地狱是虚妄的，就出地狱了，明了罪业是虚妄的，罪业也消了。断了我见的人，就没有了地狱的业，虽然从前造了很多的地狱业，但是证得五蕴无我，十八界无我，灭除了三缚结，地狱业就绑缚不了自己。菩萨和罗汉们在这个世界有苦受，是因为他们以前都造过很多的恶业，却不用去三恶道受苦，在人中受一些微苦，这也是非常值得的。</p><p>所以学佛人要尽快断我见，才能免除三恶道苦。因为在我们的阿赖耶识里藏着的三恶道业行的种子，数都数不过来，无始劫以来所造的恶业，极大多数都还没有受报，因缘具足时，都免不了要受恶报，受恶报以后才能把恶业种子消除。如果能证果，三恶道的业种就枯萎了，三恶道就免去了，只在人间受点小苦，重罪轻报，就了结了。</p><p>原文：<strong>如是贤护。地狱众生。受种种苦。七日而死。还生地狱。以业力故。</strong></p><p>释：就是这样，贤护，这些地狱众生,受尽了苦痛，七天一死亡，死了以后又生到地狱中，然后再死再生，都是因为业力的缘故。</p><p>就像无间地狱的众生痛苦得死了，被业风一吹，又活过来了一样，狱卒一喊活过来，他马上就活过来，不会让他昏迷很长时间，能昏迷过去就享福了。人类众生都不愿意昏迷，地狱众生都是希望昏迷和死亡，因为昏迷时没有六识，感觉不到痛苦。人类众生如果昏迷了，同样不知道六尘境界，意根却不情愿这样，于是就想办法醒过来。而在地狱里，是狱卒想办法让罪人清醒过来，也是业力使然，清醒过来以后，就能继续忍受痛苦的折磨了。地狱众生受尽各种苦痛，就想尽快死亡，可是因为业力必须要继续忍受痛苦，不能死，死后还要再活过来。</p><p>原文：<strong>如游蜂采花。还归本处。罪业众生。应入地狱。初死之时。见死使来。系项驱逼。身心大苦。入大黑闇。如被劫贼。执捉将去。</strong></p><p>释：那些罪业众生就像蜜蜂一样，蜜蜂到处游动，各处采花，采完花又回到本处酿造蜂蜜，罪业众生死后又会回到本处。命终以后应该下地狱的罪业众生，刚刚死亡时看见死神出现在自己的面前，给他们的脖子拴上了绳子和枷锁，然后驱使逼迫着他们，身心非常痛苦地入到黑暗的地狱当中，就像被贼抢劫了一样，身体被强行着驱逼入到地狱中。那个死亡的使者就像鬼道的黑白无常鬼一样，抓住这个临终的罪人，驱逼到大黑暗地狱当中。</p><p>原文：<strong>作如是言。诃诃。祸哉苦哉。我今弃阎浮提。种种爱好。亲属知友。入于地狱。我今不见天路。但见苦事。如蚕作丝。自缠取死。我自作罪。为业缠缚。罥索系项。牵曳驱逼。将入地狱。贤护。罪业众生, 生地狱者, 苦相如是。</strong></p><p>释：于是罪人就说：哎！真是苦啊，灾祸来了，我现在弃舍了阎浮提的种种所爱，所有的亲人和朋友，入到地狱里。我现在看不见上天的路，只能见到痛苦的景象，就像蚕茧吐丝，自己缠绕自己，自取灭亡。我自己造作罪业，被罪业所缠，枷锁系在脖颈上，被死神牵拽着马上就要入到地狱里了。佛说：贤护，罪业众生生到地狱中，就是这样的苦相。</p><p>这一段又回到了临终人要咽气死亡之前的场景，刚才是叙述地狱里的情景。人要咽气的时候，就看见死亡的使者来了，像地狱狱卒之类的，把他弄到大黑暗当中，就像被贼捉去一样。那个时候他还没有咽气，就说自己这一辈子所造的罪业，已经感到罪业苦了。</p></div>"
},{
    "title": "第十一章 贤护最后请法利益大众",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十一章  贤护最后请法利益大众</strong></p><p>原文：<strong>尔时贤护。与大药王子。闻说是已。身惊毛竖。俱起合掌。作如是言。我等今者。俱归依佛。请垂救护。愿今以此。闻法功德。未脱有流。处生死轮。不落三涂。不入地狱。贤护复白佛言。欲有所请。唯愿听许。佛言。如汝悕望。恣汝所问。</strong></p><p>释：这时贤护菩萨和大药王子听到地狱众生的罪苦之事，身体惊颤，毛孔直竖，一起站起来合掌对佛说：世尊，我们现在都皈依于您，请佛哀怜救护我们这些众生，我们希望以今天闻法的功德，回向给没有脱离三界生死苦海，处于生死轮回中的众生，希望他们不要落入三恶道中，也不要入地狱中。贤护又对佛说：我有一些问题想请问世尊，希望世尊能听许我问。佛说：我满你的愿，允许你发问。</p><p>佛给众生展现了地狱的情景，让众生赶快皈依佛，皈依了佛，就有三宝来救护自己出离地狱，不受地狱苦。大药王子和贤护菩萨就发愿皈依佛，请佛来救护，并且回向说，我们现在愿以此闻法的功德，使得未脱欲界色界无色界三有生死流的众生，不落于三涂，也不入于地狱。</p><p>他们发愿不是为了自己，而是为了众生不入三恶道，这就是菩萨的心性，他们希望所有的众生，都能脱离苦海，不再入三恶道，尤其是不再入地狱。因为他们感到众生真是苦，看到众生这么苦，就身惊毛竖。这不是害怕自己入三恶道，而是害怕众生入三恶道，因为大药王子和贤护已经是菩萨了，菩萨心中想着众生，不会只想着自己。</p><p>原文：<strong>贤护白佛言。世尊。云何为积。云何为聚。云何为阴。云何为身不迁。</strong></p><p>释：贤护对佛说：世尊，什么是积? 什么是聚? 什么是阴? 什么是身不迁?积就是集积起来，聚就是聚到一起，阴是指遮盖，遮盖了真相，遮盖了真心本性，身体不再迁化，就是指不再有色身在三界中。</p><p>原文：<strong>佛言贤护。智界见界。意界明界。以此四界。和合成身。四界境识。名之为积。聚谓六界六入。六入境三界因。二入因即须发毛爪。皮肉脓血。涕唾黄痰。脂[月*册]髓液。手足面目。大小支节。和合崇聚。名之为聚。犹如谷豆麻麦。积集聚贮。而成高大。谓之为聚。</strong></p><p>释：佛对贤护菩萨说：阿赖耶识的本体智慧境界，加上阿赖耶识能见法界的见性境界，与意根的见性境界和六识的明了境界，四个境界合在一起，组成了众生的识身，四个境界的识心，就叫作积集。聚就是地水火风空识六大，眼耳鼻舌身意内六入，色声香味触法外六入的境界，贪嗔痴是三界产生的因。外六入和内六入二入的因是头发、体毛、爪齿、皮肉、脓血、鼻涕、唾液、黄痰、骨髓脑液、手足、面目、身体大大小小的肢节，二入和合聚集起来叫作聚，聚集起了五阴身。就像谷、豆、麻、麦聚集在一起堆积起来，而形成了高大的堆垛，这就叫作聚。</p><p>什么是聚落？聚就是聚落、部落的意思，六界六入六入境界组成五阴身聚落。六界就是地水火风空识，六入就是眼耳鼻舌身意，六入境就是色声香味触法。三界就是色界欲界无色界，六界内外六入是产生三界的因, 二入就是外六入内六入。</p><p>原文：<strong>其地水火风空识。名为六界。眼耳鼻舌身意。名为六入。色声香味触法。名六入境。即贪嗔痴。名三界因。又风黄痰。亦名三因。二入因者。谓戒与信。又有二因。谓舍与施。又有二因。谓进与定。又有二因。谓善不善。其受想行识。此四名无色阴。</strong></p><p>释：其中地水火风空识，就是所说的六界，六大是组成众生的基本元素。眼耳鼻舌身意，是众生的六根。有六根才有境界的入，色声香味触法是从六根入进来的六尘境界，众生的贪嗔痴烦恼是三界法出现和存在的因。持戒和信是二入的因，众生因为持戒和对三宝的信，才能入到佛法中来。还有两个因，就是众生的舍心和布施之心，是众生进入佛法中的因，还有精进与禅定是众生入佛门的因。再有就是众生的善与不善，是进入佛法中修行的因。其中众生的受阴、想阴、行阴和识阴，是无色阴。</p><p>地水火风空识, 名为六界。由地水火风空五界组成众生的色身，识界生成了七识，六界和合在一起组成了五阴。眼耳鼻舌身意, 名为六入，色声香味触法, 名六入境，和合一起就聚集成了众生的五阴身。贪嗔痴,是三界因，因为有贪嗔痴，生死不断，轮回不息；如果没有贪嗔痴就涅槃了，三界法消失，不再出生。众生都在三界里，出了三界，就是四果阿罗汉的涅槃境界。</p><p>还有一些三界的因，也能够聚集起众生的色受想行识。又风黄痰, 亦名三因，这是现起病态五阴的原因。还有受想行识，此四名无色阴，五阴就是由一个色阴，四个无色阴组成的色受想行识。什么叫作无色阴呢？没有色尘相，不是由四大组成的，是由六界当中的识大组成的受阴、想阴、行阴、识阴，没有色相，都是心相。</p><p>原文：<strong>受谓领受。苦乐等相。及不苦不乐之相。想谓知苦乐相。行谓现念。作意及触。识者是身之主。遍行诸体。身有所为。莫不由识。不迁者谓。身语意净。证获道果。此人死已。识弃有阴。不重受有。不流诸趣。极乐而迁。不复重迁。是名不迁。</strong></p><p>释：受是领受苦乐境界相和不苦不乐境界相的意思；想是知苦乐境界相的意思；行是运行、动的意思，包括心念的出生和流转，包括对境界有作意和触；识是色身的主体，普遍运行在色身中，促使身根有所运转，都是识的作用。</p><p>不迁流的意思是，众生的身口意行都已经清净了，证得了阿罗汉果，死后不再入三界中迁受生死苦，识心抛弃了三界的五阴，不再重新受五阴之躯，不再入六道中轮回，临终非常快乐地迁灭了，不再迁转到另一个五阴身上，这就是不迁的含义。</p><p>六识的受，受谓领受苦乐等相，以及不苦不乐之相，受有三种，苦受、乐受、不苦不乐受。想阴的想就是知性、了别性、执取性，知苦乐相，了别苦相、乐相以及不苦不乐相，知色声香味触法，不仅知苦乐，还知善知恶，知一切法，知佛法，知三千大千世界，这些知都属于想。</p><p>行就是现行和运作，各种念头、思想、作意及触心所法。识者, 是身之主，遍行诸体, 身有所为, 莫不由识。这个识是指六识还是阿赖耶识？这里讲的这个识应该是指六识，因为有六识就有身口意行，没有六识身口意行就不能造作了。六识不在色身的里、外和中间，但是遍布全身，到处都有六识，行走坐卧就是六识的功能。</p><p>这里的识是指直接造作众生身语意行的六识，有六识就有身语意行，与时时处处作主的意根的识性有区别。身体的所有造作都是六识造作的结果，没有六识就不能行走坐卧，比如坐在某一处，如果没有六识身体就坐不直、坐不住了，就像一滩泥一样倒下来，就像睡着了一样。睡着了就不能坐得很直了，因为没有六识持身。因为有六识才能够言谈语笑、行走坐卧、吃喝拉撒，此外还因为有第七识和第八识，我们才能有这些行为造作，八个识和合着出生了五阴身的一切法。</p><p>六识的身语意行都清净了以后，就证得了道果。身语意都清净，没有贪嗔痴烦恼，就是四果阿罗汉。证了道果的人死了以后，阿赖耶识就弃舍了三界有的五阴身，不再受三界之有，阿罗汉命终就入无余涅槃，不再出生在三界六道里，出离了六道生死轮回，这就是定性的阿罗汉。</p><p>原文：<strong>于是贤护与大药王子。礼佛双足白言。世尊。佛一切智。说此法聚。当于未来。作大利益。安乐众生。佛言。如来法聚。常住非断。一切智者。知而不为。我经无量勤苦。积集智光。今说此经。此正法日。为诸众生。作大明照。</strong></p><p>释：佛讲到这里，贤护菩萨与大药王子一起礼佛双足，对佛说：世尊，您是一切智者, 今于此处宣演大乘法聚，对于现今和未来的众生都能作大利益, 安稳饶益众生，得大解脱。</p><p>佛说：如来法聚, 是常住不断灭的，佛的无垢识没有染污种子可灭可断，因此是常不变异、住于世间的，所有有智慧的人全都知道此理，而心地达到无为了。我经过三大阿僧祇劫的辛苦修行，积累了无量的智慧光明，才把这部经讲解出来，作为正法住世的明灯，引导众生走出黑暗走向解脱，引导众生出离三恶道，出离一切生死火坑。</p><p>原文：<strong>德誉普流。一切智海。为能调心。流注者说。此经所在之处。请诵解说。诸天鬼神。阿修罗摩睺罗伽。咸悉拥护。皆来拜礼。水火王贼等怖。皆不能害。</strong></p><p>释：如来之智德和胜誉普遍流入一切智慧之海中，为那些能够自觉调伏自心生死流注的人，开示甚深的大乘法义。这部经所在之处，以及修行者为大众请法、读诵、解说之处，诸天、鬼神、阿修罗、摩睺罗伽等护法神都来拥护、礼拜供养，所有的水灾、火灾、王难（有些国王有惩罚众生的权力，这时候他不敢惩罚），还有那些盗贼难，全部都远离，不敢加害。只要是讲诵这部经、解说这部经的修行人，所有的灾害都不能加害于他。</p><p>原文：<strong>诸比丘。从今已往。于不信前。勿说此经。求经过者。慎勿示之。于尼乾子。尼干部众。诸外道中。亦勿说之。不恭敬渴请。亦勿为说。若违我教。亏损法事。此人则为。亏损如来。诸比丘。若有礼拜。供养此经典者。应当恭敬。供养是人。斯人则为。持如来藏。</strong></p><p>释：诸比丘们, 从现在开始到未来世, 你们在不信大乘法的人面前, 不要讲说这部经，挑剔经文中过错的人，也不要让他们看到这部经，在尼乾子、尼干等外道部落当中，也不要讲诵这部经，那些不恭敬渴仰这部经的人，也不要给他们讲这部经。如果你们违背我的教导，亏损了如来大法，就是在亏损如来。诸比丘们，如果有礼拜、供养、读诵这部经典的人，就应当恭敬供养他，因为这个人是在守持如来的法藏。</p><p>原文：<strong>尔时世尊。而说偈言。当勇超尘累。勤修佛正教。除灭死军众。如象践苇芦。持法奉禁戒。专精勿亏怠。以弃生流转。尽诸苦有边。佛说此经已。贤护胜上童真。大药王子。并诸比丘。菩萨摩诃萨。天人阿修罗。乾闼婆等。普会大众。闻佛所说。欢喜奉行。</strong></p><p>释：这时，世尊就说偈，劝告弟子们精进修行，早出尘劳：你们大众应当勇猛地超越尘世的拖累和牵绊，精勤地修行佛陀所教导的正法之教；除灭让自己陷入生死轮回苦的烦恼众贼，就像大象践踏芦苇一样；你们应当严格遵守禁戒，多修持正法，专心精进不要懈怠放逸，这样才能弃舍生死流转苦，灭尽所有的生死尘劳，出离三界，不受后有。世尊把这部经都讲完了之后，贤护胜上童真和大药王子，以及诸比丘们、菩萨摩诃萨、天、人、阿修罗、乾闼婆等众，闻佛所说，都欢喜奉行。</p></div>"
}]