[{
    "title": "第一章 经题略释",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章 经题略释</strong></p><p>这部《大方等如来藏经》是大乘经典中最基础的一部经，是世尊在成佛之后十年左右这个时间，在耆阇崛山大讲堂为大众所讲的一部大乘经典。世尊刚成佛不久，最开始为自己在十方世界所度化的大菩萨弟子们，讲最殊胜的<strong>《华严经》</strong>，之后就开始为小乘比丘比丘尼众，讲最基础的解脱道法义四大部阿含经。世尊用十多年左右的时间讲完四大部阿含，随即转入大乘经典的讲解。这部<strong>《大方等如来藏经》</strong>是世尊讲完小乘法以后，转入大乘法时最初所讲的一部经，说明这部经是大乘法的基础，起着一个启信的作用，启发大众对大乘佛法的信心，让大众信受如来藏法，让众生信受己身当中都有微妙甚深的如来藏。当众生对自己有如来藏这一法深信不疑时，信位菩萨就修行圆满了，以后就进入住位阶段修行，开始修菩萨六度，准备明心见性。</p><p><strong>《大方等如来藏经》</strong>经名的前面三个字<strong>大方等</strong>，都是用来形容和描述如来藏体性的，充分显示出如来藏法无比的殊胜性。第一个字是<strong>大</strong>，什么叫作大呢？大的意思就是说，如来藏是三界至尊，统率三界世间一切法，无所不包，一切法都由如来藏所出生和主宰，没有超出如来藏之外的法。如来藏能够依缘变现出一切法，一切法都归如来藏所统摄，一切法都摄归于如来藏，所以如来藏就是世间法中最大且第一的法。</p><p>第二个<strong>方</strong>字的意思是说，如来藏是方正的、正直的、真正的，自在的法，是世出世间法当中最正的法，是能引生一切法出生的正因和直接之因，祂不是旁出的法，是真实的不生灭不变异的法，而由祂所出生的其他一切法，都是不正的旁出的法，都是生灭、变异、无常的，不是真实的法。</p><p><strong>等</strong>就是相等、平等的意思。三界世间一切法都是如来藏所生，依如来藏这个本体来说，一切法都是平等的。一切众生与佛平等，都是依于如来藏这个本体自性来说的。虽然如来藏现起的三界世间的一切相是不平等的，但是相的实质是平等的，实质都是如来藏的七大种子生成的，都是如来藏的性质，因此如来藏能显现出一切法的平等性，如来藏与如来藏之间其功能体性也是平等无二的。</p><p>经名<strong>大方等</strong>三个字标明了如来藏的特征属性，祂是世出世间最大的法，是最正的法，是永远不生灭的法，是最具平等性的法。每一个众生的如来藏功能、体性、作用也都是平等相同的，没有区别，所以从这一点来说，心、佛、众生三者没有差别。为什么没有差别？三者都是如来藏相，三者都是如来藏性，所以没有差别。经名大略解释如此。</p><p><span>翻译者是佛那跋陀罗（意译功德贤），古中天竺人，婆罗门出身，因读《杂阿毗昙心论》有了体会，改信佛法。出家学小乘，后又深通大乘，当时的人都尊称他为大乘（摩诃衍）人。刘宋元嘉十二年(435)他经过狮子国（今斯里兰卡）等地泛海到达广州，住在云峰山的云峰寺。广州刺史车朗报告于宋文帝，文帝就派人接他到南京，安顿在祇垣寺。当时的博学名士颜延之对他很敬仰，宋室的彭城王义康和谯王义宣也尊他为师，在这样的优越环境中，他很快就开始了佛经的翻译工作。我们今天能够有缘修学这部经典，应该由衷感恩这位佛门大德。</span></p></div>"
},{
    "title": "第二章 法会序曲",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章 法会序曲 </strong></p><p>原文：<strong>如是我闻。一时佛在王舍城耆阇崛山中。宝月讲堂。栴檀重阁。成佛十年，与大比丘众百千人俱，菩萨摩诃萨六十恒河沙，皆悉成就大精进力，已曾供养百千亿那由他诸佛，皆悉能转不退法轮。</strong></p><p>释：正文第一句话依着惯例当然是<strong>如是我闻</strong>，如是我闻的意思就是在佛灭度以后，阿难在大众面前结集经典的时候，复述佛当时在法会上所讲的法，在每部经首都说：我当初是听世尊这样讲的。然后他就开始叙述世尊具体是如何讲这部经的，从头到尾他都能复述出来，阿难在世尊十大弟子之中号称多闻第一，他记忆惊人，过耳不忘。</p><p><strong>一时佛在王舍城耆阇崛山中。宝月讲堂。栴檀重阁。</strong>这是讲世尊在王舍城耆阇崛山这个处所为大众讲如来藏经，这叫处所成就。耆阇崛山位于中印度摩揭陀国首都王舍城之东北侧，王舍城是印度最大的一座城市，是佛常住经常讲法之处。在耆阇崛山中有个宝月讲堂，这个讲堂是用栴檀木做成的楼阁，栴檀木是印度比较好的上等檀木，重阁就是用檀木做成的二、三层的楼阁，就是说这个楼阁不是一层的，是有二层也有三层的建筑。在古代的时候房屋建筑技术不太发达，房屋都是用木板做成的，所以楼阁不能太高，最多只有三层，一般来说是二层，最普遍的就是只有一层的平房，不像我们现在能建筑高楼大厦，现代的建房技术特别发达。世尊正是在王舍城耆阇崛山宝月讲堂栴檀重阁这个地方，为大众讲《大方广如来藏经》。</p><p>这是世尊在成佛大约十年，讲完《阿含经》，转入大乘法后，最初所讲的一部经。那么这部经肯定不能太深细，否则众生无法理解，因此，它一定是为大乘法的修行打基础的最基础的一部大乘经典，目的是让众生都能够听得懂，对大乘如来藏法有所了解，并且生起信心，种下善根福德，种下成佛的种子。</p><p>后边的大比丘，就是佛的常随众，在佛身边围绕着的一千二百五十五位比丘，这是出家声闻众，后边还有菩萨摩诃萨六十恒河沙，菩萨摩诃萨就是大菩萨，大菩萨一般是指明心见性以上的菩萨，也有更严格的说法，登地的菩萨才叫作大菩萨或者是菩萨摩诃萨。这些菩萨们的数量有六十恒河沙这么多，恒河沙就是印度恒河里的沙子，数量根本数不清，代表菩萨数量太多了，都是释迦佛无量劫所度化出来的佛子。大比丘众才有一千二百五十五人，而菩萨却有六十恒河沙，无量无边之多。</p><p>世尊成佛才十年，为什么有这么多的菩萨呢？原来是释迦佛到娑婆世界之前就已经在十方世界弘法度众，而且不知弘法度众有多少个无量劫了，同时也说明佛早已经修行满三大阿僧祇劫了。据佛经记载，世尊成佛以后，以佛的身份到我们的娑婆世界就来了八千次，到其它佛国土有多少次，那就不可计数了。佛在这么长的时间里弘法利众，度出了数不清的菩萨摩诃萨。</p><p>现在到这个法会来听法作为影响众的菩萨，只有六十恒河沙，虽然数不清，但是这个数量还不是全部的，这只是其中的一部分，还有更多的菩萨弟子没有参与法会。这么多的菩萨摩诃萨并不是都在娑婆世界里弘法，而是分布在十方世界各个佛国土里自利和利他。十方世界无量无边的广大，这些菩萨都已经修出了神通，听说佛要讲如来藏经，都发心来护持佛的法藏，护持佛讲这部大乘经，所以菩萨们就从十方世界来到娑婆世界的耆阇崛山中，听世尊宣讲这部经，他们的神通无比广大，才能从遥远的国土飞到娑婆世界来护持世尊讲法。</p><p>这些菩萨不仅能够精进修学菩萨六度，成就了自己，而且在利他方面，也具大精进力，对众生慈悲喜舍，并以种种方便善巧摄受众生。成就无量三昧，成就无漏的戒定慧行，这叫皆悉成就大精进力。后边介绍这些六十恒河沙的菩萨摩诃萨们，都已经供养了百千亿那由他诸佛，意思是说菩萨们已经供养的佛的数量无量无边之多，所种的善根福德相当的深厚。那由他是古印度语言，表示数目极多数不清，菩萨们已供养了这么多诸佛，说明祂们的善根福德非常非常的深厚。祂们供养了这么多佛，目前还没有成佛，说明成佛需要久远时劫，需要三大无量劫的修行，不是说一生就能够成就如此之多的功德和利益，也不是一生就能成佛的。</p><p>我们出生在娑婆世界，在释迦佛的法教之下学佛，就是在供养释迦佛。在前世时，我们可能都供养过贤劫的其祂三尊佛，也许在这个贤劫之前还供养过其它劫里的所有诸佛，那都不一定。但是我们所供养的佛还是非常非常的少，数量非常有限。贤劫第五尊佛是弥勒佛，我们还没有供养，因为现在弥勒菩萨还没有成佛，还没有到娑婆世界来传法，我们还没有机缘来供养，现在供养的是释迦佛。我们前世的善根福德因缘如何，就看每个人前世供养过多少尊佛，经历过多少尊佛的法教。善根福德不深厚的人，他只供养过极少量的佛，因此目前还不能信受大乘佛法，不能信受如来藏法，这就说明学佛和成佛不是一生一世、几生几世的事。</p><p>世尊在无量劫的修行当中，度了无量之多的众生，有无量多的弟子拥护和跟随学法，世尊才能成就佛道，化现出自己的佛国土带领弟子们修行。如果世尊前世没有度过众生，就没有弟子随学和共同成就佛国土，单独一个人不能成佛，佛菩萨必须有自己的弟子，和弟子们共同组成一个佛国土，共同弘扬如来的法教。所以没有度过众生、没有弟子的菩萨，道业无法增进。如果菩萨一个弟子也没有，或者只有很少数的弟子，功德和福德都不圆满，想要即生成佛，是不可能的。一个佛国土必须有无量无边之多的众生，那些众生都是由佛所度化的弟子组成的，不可能只有佛一人，也不可能只有少数的菩萨弟子就能成就一个佛国土。</p><p>所以菩萨要想成佛，必须要经过三大无量劫的时间，供养过无量无边的诸佛，度过无量无边之多的弟子，具足了无量的善根福德和智慧，才能成佛，这些事情一生肯定是办不到的。有很多人既没有说法教化过众生，也没有得度的弟子，大福德也不具备，无量三味也没成就，一生就能成佛，即生就成佛，那是不可能的。</p><p>这些菩萨摩诃萨们都能够协助佛转法轮，说法度众生。转不退法轮，为众生讲经说法，让众生明心见性，永远不退转于大乘成佛之如来藏法，于无上菩提永不退转。这些菩萨能依众生的根性，为众生讲深浅程度不同的如来藏法，众生听闻了以后明心见性，从而也不退转于无上菩提，这就是菩萨们转的不退法轮。说明这些大菩萨们不仅能够自利，而且能够利人。</p><p>原文：<strong>若有众生闻其名者。于无上道终不退转 。其名曰法慧菩萨、师子慧菩萨、金刚慧菩萨、调慧菩萨、妙慧菩萨、月光菩萨、宝月菩萨、满月菩萨、勇猛菩萨、无量勇菩萨、无边勇菩萨、超三界菩萨、观世音菩萨、大势至菩萨、香象菩萨、香上菩萨、香上首菩萨、首藏菩萨、日藏菩萨、幢相菩萨、大幢相菩萨、离垢幢菩萨、无边光菩萨、放光菩萨、离垢光菩萨、喜王菩萨、常喜菩萨、宝手菩萨、虚空藏菩萨、离憍慢菩萨、须弥山菩萨、光德王菩萨、总持自在王菩萨、总持菩萨、灭众病菩萨、疗一切众生病菩萨、欢喜念菩萨、餍意菩萨、常餍菩萨、普照菩萨、月明菩萨、宝慧菩萨、转女身菩萨、大雷音菩萨、导师菩萨、不虚见菩萨、一切法自在菩萨、弥勒菩萨、文殊师利菩萨，如是等六十恒河沙菩萨摩诃萨。从无量佛刹。与无央数天龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽俱。悉皆来集尊重供养。</strong></p><p>释：如果有众生听闻到这些大菩萨的名字，那么众生们对于无上的佛道就再也不会退转了。这说明这些大菩萨们的神通道力非常的广大，众生闻名，就能于无上道终不退转。那么既然如此，就请大家以恭敬心来念诵一遍这些菩萨的名字，让大家听闻之后，于无上佛道终不退转。</p><p>参加法会的菩萨有：法慧菩萨、师子慧菩萨、金刚慧菩萨、调慧菩萨、妙慧菩萨、月光菩萨、宝月菩萨、满月菩萨、勇猛菩萨、无量勇菩萨、无边勇菩萨、超三界菩萨、观世音菩萨、大势至菩萨、香象菩萨、香上菩萨、香上首菩萨、首藏菩萨、日藏菩萨、幢相菩萨、大幢相菩萨、离垢幢菩萨、无边光菩萨、放光菩萨、离垢光菩萨、喜王菩萨、常喜菩萨、宝手菩萨、虚空藏菩萨、离憍慢菩萨、须弥山菩萨、光德王菩萨、总持自在王菩萨、总持菩萨、灭众病菩萨、疗一切众生病菩萨、欢喜念菩萨、餍意菩萨、常餍菩萨、普照菩萨、月明菩萨、宝慧菩萨、转女身菩萨、大雷音菩萨、导师菩萨、不虚见菩萨、一切法自在菩萨、弥勒菩萨、文殊师利菩萨。</p><p>菩萨们的名字，已经念诵了一遍，不知大家听闻之后，是否明心见性，从此再也不退转于无上菩提。这些六十恒河沙数菩萨从无量佛剎，从十方世界諸佛宝刹，与无央数天龙、夜叉、干闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽等等护法神一起，来到娑婆世界，供养释迦牟尼佛，护持释迦牟尼佛的法教。</p></div>"
},{
    "title": "第三章 佛现神变",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  佛现神变</strong></p><p>原文：<strong>尔时世尊于栴檀重阁。正坐三昧而现神变。有千叶莲华大如车轮。其数无量。色香具足而未开敷。一切花内皆有化佛。上升虚空弥覆世界犹如宝帐。一一莲花放无量光。一切莲花同时舒荣。佛神力故须臾之间皆悉萎变。其诸花内一切化佛结跏趺坐。各放无数百千光明。</strong></p><p>释：这是讲述世尊在栴檀重阁讲堂上端身正坐，示现入三昧定以后而现出了大神变，由此神变力显示出世尊的三昧神通道力。所谓的神变，是指从无到有的神奇变化，这样的变化确实很神奇。本来虚空当中一无所有，可是世尊用神力，就能变出来千叶莲花，这确实是神变，都是世尊三昧力所致。神变出的千叶莲华大如车轮，其数无量，虽色香具足而未开敷。有一千个莲花叶的莲花，象车轮一样大，这样的千叶莲花有无数之多，不仅颜色各异而且还带有微妙的香味，色彩和香味都圆满具足，绚丽宜人。</p><p>虽然有千叶莲花，莲花都还没有开敷，正在含苞待放。每一个千叶莲花中都有一尊化佛，莲花和化佛一起上升到虚空当中，就像宝帐一样把整个世界虚空都给盖覆住了。一切花内皆有化佛，莲花上升虚空弥覆世界犹如宝帐，这是第二个神变。一开始是含苞待放的莲花，然后莲花中出现化佛，和这朵莲花一起上升到虚空，弥漫整个虚空世界。</p><p>第三个神变，一一莲花放无量光，一切莲花同时舒荣。莲花涌上虚空以后，先放光，放完光以后，莲花就开敷化现出来了。佛又以神力在须臾之间让所有开敷的莲花全部萎缩，这些莲花全部枯萎变异，叫作萎变。一开始含苞待放，现在全部萎缩下来，变异改变了，没有那些色彩和香味了。其诸花内一切化佛结跏趺坐，虽然这个花萎变枯萎了，但是每朵莲花的化佛都还在枯萎的莲花内结跏趺坐，各放无数百千光明，虽然莲花枯萎了，可是光明还在。</p><p>这一段落，含义相当的深，是什么含义呢？千叶莲花一开始是含苞待放的，还没有开敷，这就比喻众生的五阴色身正处母胎中，还没有出生，正含苞待放。一朵千叶莲花就如一个众生，这些众生有无量无数之多，色香具足说明在母胎里，五阴已经具足，就等着出生了。一切莲花皆有化佛，就是说一朵莲花里坐着一个化佛，比喻每一个五阴众生都有一个如来藏，化佛是指如来藏，这是秘密之义。</p><p>莲花弥覆世界，十方三千大千世界诸佛国土，满世界都充满了众生，这些众生还处在母胎中，还没有出生。然后一一莲花放无量光，这些莲花先放光，放光是怎么回事呢？这是化佛放光，说明处在母胎中的五阴身里有如来藏。如来藏先放光起用，起用以后众生就出生，众生出生就比喻莲花舒荣，莲花开放暗喻众生从母胎里出生，实际上是从如来藏出生的，众生出生以后，色受想行识五阴起用，莲花就开放了。</p><p>莲花开放是谁之功？莲花放无量光，那是化佛放的光，化佛代表着如来藏，一个众生有一个如来藏，如来藏放光众生才出生；众生出生，五阴起用。莲花开放说明如来藏变现出五阴身，让五阴出生、起用，莲花就开放了，然后释迦佛用神力再让这些莲花枯萎。莲花枯萎是什么意思？众生入胎，入胎以后出胎，出胎起用以后，慢慢老、死，莲花枯萎就代表众生老死。这就说明众生的生住异灭中都有佛的神力，都是如来藏的神力所为。</p><p>虽然众生老了、死了，这些千叶莲花枯萎了，但是其诸花内的一切化佛却结跏趺坐着。这是暗指众生五阴之内的如来藏，在五阴身灭时自己却不灭，而且各放无数百千光明。就是说众生的五阴虽然有生住异灭，但众生的如来藏却是不生不灭，而且常放光明。常放光明就是如来藏常起功德利用，从来没有灭过，不管你的众生世界如何生住异灭，化佛如来藏却永远常放光明，永远在起利用，没有一刹那灭过，祂的光明永远照耀着世间。祂常放自性光，照耀一切法，光明可以代表如来藏性，也可以叫作佛性。佛性常放光明，让众生的五阴起用，不断的生住异灭。</p><p>无数化佛各放无数百千光明，一朵莲花有一尊化佛，说明无数众生有无数如来藏，一个众生就有一个如来藏维持五阴身的存在，众生不共用一个如来藏。莲花枯萎还有一个意思，代表众生有贪嗔痴烦恼，虽然众生有贪嗔痴烦恼，但是在众生五阴身中的如来藏，却永远是清净的，常放光明，永远起着祂独特的功德妙用。这一小段的含义就在暗说如来藏的不生不灭性，常放光明，常起利用，使得众生的五阴能够生住异灭，住胎、出胎，一直到老死，整个阶段，众生的如来藏从来没有灭过，常在放光明，照耀着世间一切法。</p><p>原文：<strong>于时此刹。庄严殊特。一切大众。欢喜踊跃。怪未曾有。咸有疑念。今何因缘。无数妙花。忽然毁变。萎黑臭秽。甚可恶餍。尔时世尊。知诸菩萨。大众所疑。告金刚慧。善男子。于佛法中。诸有所疑。恣汝所问。</strong></p><p>释：佛现完神变以后，先现千叶莲花，花未开敷，然后莲花上升虚空，上升虚空以后，化佛（如来藏）放光，放光以后莲花开敷（众生出生），开敷以后枯萎，众生的五阴老死灭去，但是花内的如来藏仍然放着无量光明。佛现这种种神变以后，这个时候娑婆世界非常的庄严、殊特。大众们见到这些神变，都欢喜踊跃，很奇怪以前从来没有看见过这样的神变、这样的神力，现在娑婆世界变得如此的庄严殊特，都是释迦佛的神力所变，让众生心生欢喜而对佛法起信。</p><p>这时大家心里都出现疑问，释迦佛变现的这么多千叶莲花，非常的殊丽、美妙，为什么瞬间就毁坏了呢？毁就是一点点消亡，变就是变异、变化，与从前不一样了，说明众生的五阴是在不断的生住异灭、刹那变化的。一切法只要出生，就有灭亡，世尊在示现这个真理。再一个就是示现生灭背后的因是什么，背后的主人是什么，世尊为众生示现这两个相。一个是世俗的相，世俗的相就是众生五阴生住异灭的相，还有一个非世俗的相，就是实相、常住不灭的相，就是如来藏起用之相。说明如来藏不管世俗法如何的生住异灭，而本体永远不生不灭，常住在世间，且常放光明，也说明如来藏常起功德利用而永远不灭。</p><p>众生生出疑问，为什么要显现出这些现象呢？下面佛就开始解说了。原来色彩斑澜、炫丽馨香的千叶莲花，色香具足，现在色彩变成黑色的，而且还臭秽、枯萎了。莲花叶枯萎，颜色气味都变了，这叫无常。大众看到这枯萎的莲花，变成黑色的了，还散发臭味令人生厌，都很疑惑，本来这么殊丽美妙的莲花，却变成了这个样子，究竟是为什么呢？世尊特意现这个影像，是为了让大众心里生疑，生起疑问以后，有人请问，世尊借此就开始讲如来藏大法了。</p><p>世尊知道诸菩萨心里要生疑，其实这些诸菩萨们都是八地以上的菩萨，甚至有等觉妙觉菩萨，肯定都不会起疑。这是为了众生而示现起疑，佛为解答此疑，就讲出了一部佛经。起疑是因，启问是缘，讲法是果，结果就诞生出一部《大方等如来藏经》。其实诸大菩萨们在久劫以前早就没有这个疑情了，他们已经断了大部份的无明尘沙惑，这是为了引出世尊讲法的因缘，为了配合世尊讲法才代替众生请法的。所以世尊就告诉他们，有疑可以发问，这样世尊与诸大菩萨们共同和合演说出这部《大方等如来藏经》，以此度无量众生对大乘法生起信心，入到大乘法中修学。</p><p>原文：<strong>时金刚慧菩萨。知诸大众。咸有疑念。而白佛言。世尊。以何因缘。无数莲花中。皆有化佛。上升虚空。弥覆世界。须臾之间。皆悉萎变。一切化佛。各放无数。百千光明。众会悉见。合掌恭敬。</strong></p><p>释：这时候金刚慧菩萨知道大众心里都有疑问，就出来为诸大众请问世尊：世尊，是什么因缘，这么多莲花里全都有化佛，而且莲花上升虚空弥覆整个世界？为什么莲花须臾之间皆悉萎变？为什么每一朵花中的化佛还在放着无数光明，在会大众全部都睹见，对世尊合掌恭敬？</p><p>化佛代表如来藏，莲花代表众生的五阴身。当然这些莲花自己不能上升虚空，是莲花里的化佛神力，使得莲花上升虚空。这就说明如来藏起用时，五阴身才能起用，才能有五阴的变化。须臾之间，莲花就枯萎变异、萎缩消失了，为什么这么快啊？这个问题就是在说明众生的五阴身稍瞬即逝，众生一世又一世的生命，非常快速地生住异灭。虽然每个众生自己觉得百八十年几百年上千年挺漫长，可是在大菩萨眼里，就是弹指之间的生灭变化，五阴身生了灭，灭了生，实际上非常快速，只相当于天界几分钟几小时而已，同理，畜生道众生活一辈子，在人类看来也就几小时几分钟。须臾之间出生、灭亡，出生、灭亡，就这么快，生命如此无常，众生却不知不觉。</p><p>这些莲花上升虚空后就枯萎了，而化佛仍然在大放光明，这代表着如来藏永远不灭，不随五阴的生灭而生灭。一个众生的五阴，就有一个如来藏，一朵千叶莲花就有一个化佛，这是个比喻，表明一个众生有一个如来藏，各自起各自的功能利用。虽然这个功能利用相同，但是只负责各自相对应的五阴世间，别的五阴世间有其相应的如来藏在起功德作用。一切化佛各放无数百千光明，百千光明说明如来藏有本觉之明，祂在放光起用，在造作五阴世间的一切法，出生一切法执持一切法。众会悉见合掌恭敬，在法会上的大众们合掌恭敬，敬仰世尊有这样的神变。现出的千叶莲花是那样的殊丽美好，一会儿就萎变了，这个奇特的神变到底是什么意思呢？金刚慧菩萨就替大众来启问，由此就产生了《大方等如来藏经》。</p><p>原文：<strong>尔时金刚慧菩萨。以偈颂曰。</strong></p><p><strong>我昔未曾睹。神变若今日。见佛百千亿。坐彼莲花藏。</strong></p><p><strong>各放无数光。弥覆一切刹。离垢诸导师。庄严诸世界。</strong></p><p><strong>莲花忽萎变。莫不生恶餍。今以何因缘。而现此神化。</strong></p><p><strong>我睹恒沙佛。及无量神变。未曾见如今。愿为分别说。</strong></p><p>释：金刚慧菩萨用偈颂的形式说：</p><p><strong>我昔未曾睹。神变若今日。</strong>我从来没有看见过，像今天这样的一个神变，短短的时间，无数个千叶莲花含苞待放，然后涌上虚空，各个莲花里都坐着一尊化佛，化佛放光，莲花开敷，马上又萎缩，但是化佛照样大放光明。说明五阴世间无论怎样生住异灭，如来藏还是常放光明，恒起功德利用，不生不灭。</p><p><strong>见佛百千亿。坐彼莲花藏。</strong>我看见有百千亿的佛，坐在各自的莲花胎藏中。为什么有这么多佛呢？因为众生有百千亿，一个众生有一个如来藏。一个莲花上就有一尊佛，有百千亿朵莲花，就有百千亿尊佛。其实不止百千亿，众生有无量无边之多，那就有无量无边之多的如来藏，处在各自所属的莲花当中，起其应有的功德利用，放光动地，照耀一切法。</p><p><strong>各放无数光。弥覆一切刹。离垢诸导师。庄严诸世界。</strong>每一朵莲花当中的每一尊化佛，各都放着无数光，说明化佛所起的功德利用，无量无边，从来没有止息过。这些光盖满了一切的佛刹，说明如来藏遍一切处、遍一切时、遍一切界、遍一切法，遍自己的一切五阴世间。离垢诸导师，心地已经洁净无垢的释迦摩尼佛等等诸佛，用种种佛法、种种神异教化众生，庄严诸佛国土。</p><p><strong>莲花忽萎变。莫不生恶餍。</strong>释迦佛用神力变现出百千亿莲花，又枯萎而去，让大众心生厌离，不知道是什么原因，而显现出如此的神力。离垢的意思是指诸佛的七识心断尽了一切无明染污，清清净净，究竟彻底地转识成智；如来藏里再也没有生死业种，没有无明业种，因此就不再变异了，没有了污垢种子，没有了贪嗔痴烦恼以及习气种子，没有了无明种子，成为了无垢识，以此就庄严了佛国土。</p><p>而众生的如来藏也在用祂特有的方式，庄严自己的五阴世界，能让五阴世间生住异灭，引领着众生的五阴在世间生存。众生自己的五阴世间是众生自己庄严点缀的，实际也是如来藏庄严和变现出来的。这里每句话都有所指，都有深义。忽然间这朵莲花枯萎变异了，变得又黑又臭，让人生厌，众生全都嫌恶厌弃，不再喜欢了，说明众生都是贪生厌死的，喜欢香艳炫丽，不喜欢臭秽萎败。</p><p>莲花先是含苞待放，后来花开了，之后又枯萎变异，灭去了，这个过程代表着众生五阴的生住异灭，从住胎、出生，到萎缩、灭亡的整个过程。众生喜欢莲花待放和开放，喜欢莲花殊丽，却不喜欢莲花萎缩。每个众生都不喜欢五阴世间消失灭亡，不喜欢变异，但是五阴世间必然都在变异当中，为什么呢？一个是因为众生的业力使然，一个是因为五阴世间没有自性。</p><p><strong>今以何因缘。而现此神化。</strong>金刚慧菩萨问世尊，您这是以什么因缘而现出这样的神化世界呢？为什么有这样的神力，变出这样神奇的现象呢？</p><p><strong>我睹恒沙佛。及无量神变。未曾见如今。愿为分别说。</strong>我已见过如恒河沙一样多的诸佛，也见过诸佛所变出的无量神变的境界，从来没有见过如今天这样的神变，希望世尊能为我们分别的演说一下神变的因缘是什么。</p></div>"
},{
    "title": "第四章 佛示众生烦恼身中如来之藏",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  佛示众生烦恼身中如来之藏</strong></p><p>原文：<strong>尔时世尊。告金刚慧。及诸菩萨言。善男子。有大方等经。名如来藏。将欲演说。故现斯瑞。汝等谛听。善思念之。咸言善哉。愿乐欲闻。</strong></p><p>释：这时候世尊对金刚慧菩萨及诸大菩萨说：善男子，有大方等经名如来藏，我为了要演说这部大乘经典，现出了以上这些瑞相，在空中变现出莲花，含苞待放，之后敷妍开放，最后萎缩枯萎。虽然如此，始终有无量的化佛在一一莲花内，相好庄严，放大光明。你们仔细的聆听，我要讲这部《大方广如来藏经》，谛听之后，善思念之，好好的思惟这部如来藏经典。</p><p>世尊现这些瑞相是为了使众生生起信心作铺垫，并且也为了使众生生起疑问，为了解决众生的疑问，世尊就会讲这部如来藏经，让众生断疑生信，信受如来藏法。众生对如来藏法生起信心，信心圆满，就会进入下一步的修行实证当中。大众闻佛这样讲，都说善哉，愿乐欲闻，我们都很愿意听。</p><p>原文：<strong>佛言。善男子。如佛所化。无数莲花。忽然萎变。无量化佛。在莲花内。相好庄严。结跏趺坐。放大光明。众睹希有，靡不恭敬。</strong></p><p>释：佛就接着往下讲：善男子，你们看我刚才所化现的无数的千叶莲花，忽然之间就萎缩、变异、灭去了，但是无量的化佛却仍然在一一的莲花之内，相好庄严，结跏趺而坐。放大光明，众生睹见，都觉稀有难遇，大众合掌恭敬赞叹。</p><p>无数化佛是比喻每个众生身当中都有各自的如来藏，虽然那朵千叶莲花能够含苞待放，开敷又落谢萎缩，莲花有生住异灭，但是如来藏在众生的五阴身当中，仍然在放大光明，并不随着众生的五阴身而生灭，不管众生的五阴身如何生住异灭，如何演变着，众生身中的如来藏，始终在大放光明，不生不灭，起着祂所应有的功德作用。大家看见刚才所变现出来的稀有瑞相，都以为很稀奇，生起了无限的敬仰之心，趁着众生生起敬仰之心的时候，世尊开始讲如来藏法。</p><p>原文：<strong>如是善男子。我以佛眼。观一切众生。贪欲恚痴。诸烦恼中。有如来智。如来眼如来身。结跏趺坐。俨然不动。善男子。一切众生。虽在诸趣。烦恼身中。有如来藏。常无染污。德相备足。如我无异。</strong></p><p>释：如是善男子，我以佛眼观一切众生，贪欲恚痴诸烦恼中，有如来智、如来眼、如来身，结跏趺而坐，俨然不动。善男子，一切众生，虽然在六道诸趣，五蕴烦恼身中却有如来藏恒常存在，而没有染污，德相具足，如我一样，没有差别。</p><p>佛有五眼，佛的五眼是肉眼、天眼、慧眼、法眼、佛眼。肉眼就是在佛的色身上，以四大组成的肉体所显现的眼；天眼是加修四禅八定获得的神通境界，能见肉眼所不能见的广大而微细的物质世界，从天宫到地狱，中间一切色法无不睹见，有的天眼还能见到诸佛国土；慧眼是证得如来藏所获得的大智慧之心眼，指地前菩萨的诸法无生的般若智慧；法眼是地上菩萨所获得的无生法忍的清净广大智慧，明了如来藏种子功能的智慧；佛眼是佛世尊所独有的智慧之眼。</p><p>佛以佛眼观一切众生，尤其是凡夫众生，都没有断除烦恼，在五阴身中都有贪欲、嗔恚、愚痴、贡高我慢、种种疑念、邪见等等诸多烦恼。虽然众生身中有种种的烦恼，但在这些烦恼当中，有如来的智慧德相，这句话很关键含义很深。</p><p>如来智就是我们本有的如来藏本体的智慧，如来藏所具有的那种出世间的本来智。本来智是指如来藏能够以祂本自具足的智慧德能，出生三界世间的一切万法的智慧，出生众生的五阴身的智慧，记录、收存、输送众生无量业种的智慧，和变现众生的三界世俗法的智慧。</p><p>祂这个智慧不属于三界世间里的智慧，而是属于祂本有的智慧德用。如来藏不在三界里外，却能不离三界而出生和变现三界一切法，以祂所独有的运行规则显现出世间一切法，这就是祂的如来智，是如来藏本有之智。这个本有之智不是外来的，而是如来藏法尔如是的就具备这样的德能、功能和利用。如来藏这个大智慧，不属于三界世间法里的智慧，这种智慧不用出生，也不会灭亡，永远都能真真实实的存在和运作，显现出祂所独有的德能和功用。这就是如来藏的如来智。</p><p>下一个是如来眼，如来眼很有意思，是干什么用的呢？眼是用来见法的，如来眼说明如来藏有见性，因为如来藏里有个见大，见大种子现行出来，如来藏本体就有见性。见什么呢？见三界世间一切法，只要有法出现，如来藏都能见，这个见和世俗的七识心所见的内容截然不同。如来藏这个见，能见得一切法，能在一切法上大放光明，这是佛性，也叫作如来藏性。佛性有见，如来藏就有见性，因为如来藏有见性，第七识依之，就能有自己的见性，然后就要在一切法上运作，这样生灭与不生灭和合运作，就显现出三界世间一切法。</p><p>还有一个如来身，如来身的意思是说如来藏的本体虽然无形无相，但祂却真实存在着，有真实的功能作用，祂是一个实有之体，称作实相心，是无色法的身，也叫作法身，能化现应身和化身以及报身。这里说的如来智、如来眼、如来身，都是指如来藏。</p><p>世尊说，虽然众生的贪欲嗔恚诸烦恼非常的炽盛，但是如来藏却如如不动，不随五阴身的生灭而生灭，不随五阴的烦恼而烦恼。三界世间法出现时，祂不从某处来；三界世间法灭掉时，祂也不去至某处，虽现一切法，而自身却如如不动，不随一切法而起落。尽管众生有贪欲嗔恚等种种的烦恼、种种的无明、种种的染污，但是这个烦恼身中的如来藏却真实而如如，既不贪、也不嗔、也不愚痴（代表没有无明）。如来藏没有无明，祂对一切法都是明的，因为祂有如来眼，能够见得一切法，能明了一切法。虽然能见得一切法，明了一切，却如如不动，没有心念、没有无明、没有贪欲和嗔恚。</p><p>佛说一切众生虽在诸趣，烦恼身中有如来藏常无染污，德相备足如我无异，这句话非常关键。一切众生，不管是五阴还是四阴众生，只要有识心的功能作用，都有如来藏，都叫作众生。众生虽在诸趣六道里轮回，烦恼身中却有如来藏，常无染污。如来藏常存而无染污，不随众生的贪欲而贪，不随众生的嗔恚而嗔，不随众生的愚痴而痴，虽然众生造了无量无边的恶业、染污业，但是如来藏从来没有染污业、没有无明业。在众生的烦恼身中，如来藏德相备足，真实而如如的显现出一切法，与佛无异。</p><p>这一段内容甚深且相当重要，说明了心、佛、众生三者无差别。心是如来藏，佛就是世尊，众生就是凡夫众生以及圣贤众生。每一个众生如来藏的体性，与佛真如的体性，没有差别，德能利用，都是充分具足的，那就说明众生的如来藏本来具足一切法，只是受限于众生的业障和业种业缘，不得不随缘现起众生的染污业，不能如佛那样随时随地现起殊胜境界。这一段含义既甚深也相当重要，要好好一心品味。</p><p>原文：<strong>又善男子。譬如天眼之人。观未敷花。见诸花内。有如来身。结跏趺坐。除去萎花。便得显现。如是。善男子。佛见众生。如来藏已。欲令开敷。为说经法。除灭烦恼。显现佛性。</strong></p><p>释：佛说：善男子，譬如有天眼之人，看见没有开敷的花，能见花内有如来身，正在跏趺而坐，于是就除去枯萎的花叶，如来身就显现出来了。如是，善男子，佛见众生的如来藏以后，想把如来藏显露给众生，让众生悟得自己的如来藏，于是就为众生说法，先除去众生的烦恼枯叶，以便显现出自身的佛性。</p><p>有天眼之人能看得很远很远，很深很深，很细很细，能见到众生肉眼所见不到的色尘。天眼之人比喻为佛世尊，能见众生所见不到的如来藏。没有开敷的花比喻众生在母胎当中，还没有出生，虽然没有出生，但是这朵花内却有如来身结跏趺坐，就是说有如来藏在住持着众生的五阴身。因为有如来藏才有众生的五阴身，才有众生五阴身的出生、显现和运作，如来藏就在众生五阴身当中起用。</p><p>萎花用来比喻烦恼、贪欲、嗔恚等等种种无明，除去无明，如来藏便得显现。所谓的显现，就是让众生能够识得祂，见得祂，这个见还不是肉眼见，而是以智慧眼来发现和证得。为什么除去萎花如来藏就能够显现呢？因为这些萎花——贪欲、嗔恚等种种烦恼无明，遮障了众生的心识，让众生陷于无明当中，不能见得诸法实相。虽然众生有无明，但是如来藏也在身中住持着、运行着，只是这些烦恼遮障了众生的眼，让众生愚痴，只见三界世俗法，不见实相心如来藏，而认这些生灭变异的法为真实，见不到后边真实而如如的如来相，见不到本体之智。</p><p>众生把烦恼降伏，心清净下来以后，因缘成熟，就能证得自己身中有如来藏，认识到自己的五阴原来不是真实的，是祂在变现着一切，显现着一切。除去萎花就是降伏烦恼，心清净了，智慧生起了；有了智慧，就能证得如来藏，这个见是智慧之见，是以智慧心来识得实相心，认得了自己五阴当中的如来藏。虽然有贪嗔痴烦恼时看不见如来藏的显现，但是如来藏仍然存在着、运作着，不管众生是否能见得到。</p><p>这一段话与佛刚成道时说的“奇哉。大地众生皆有如来智慧德相。只因妄想执着不能证得。”这句话，意思是一样的。佛说：我见每一个众生身中都有自己的如来藏，只是众生没有证得，见不到自己的如来藏，佛说法的目的就是想让众生见得自己的如来藏。每个众生的如来藏都本然存在着，不管你去指示祂还是不指示祂，祂都一样存在。不指示时，众生因为烦恼不能得见，那么指示出来呢，众生拔开烦恼，拔开眼前的遮障，就能见得到自己的如来藏本体之智在显现着。</p><p>佛为了使众生能证得如来藏，而为众生说法除灭烦恼，去除众生心中的遮障。遮障去除了，光明显现，众生有智慧时就能证得自己本具的如来藏，显现出佛性。显现，就是让你去证得去发现，佛性不是在烦恼存在时就没有，在烦恼降伏时就出生，不管你有没有烦恼，佛性都在如实的显现着，大放着光明，照触着一切法。因为众生不能见到如来藏，佛就来说法，帮助众生灭除烦恼，灭除无明，让众生心得清净，见得自己的如来藏。这个意思叫作显现佛性，就是把遮障给拔除了，去除眼前的障碍物，就能够见得自己本有的如来藏。</p><p>原文：<strong>善男子。诸佛法尔。若佛出世。若不出世。一切众生。如来之藏。常住不变。但彼众生。烦恼覆故。如来出世。广为说法。除灭尘劳。净一切智。善男子。若有菩萨。信乐此法。专心修学。便得解脱。成等正觉。普为世间。施作佛事。</strong></p><p>释：善男子，诸佛之法本来如此，如来藏法本来就是这样，不管有佛出世，还是没有佛出世，一切众生的本体如来藏都常住而不变异。但是所有众生因为烦恼遮蔽自心之故，如来才出世间广为众生说法，除灭众生的尘劳烦恼，清净众生的一切智慧。善男子，如果有菩萨，信乐于如来藏法，专心致志地修学，就能得到解脱，将来证成阿耨多罗三藐三菩提，普遍为诸世间布施佛法，大作佛事。</p><p>这段话非常关键，这部经能让众生断疑起信，信自己身中有本来之智，有本来之如来藏，常住不变。佛在这里强调说，一切众生如来之藏常住不变。常住的意思就是不随众生生而生，不随众生灭而灭，而是常住在众生当中，与众生在一起，但如来藏的本体不变异，没有生灭变异之现象。众生的五阴、七识、业种有生灭变异现象，使得如来藏整体有变化，不是如来藏本体有变异。但彼众生烦恼覆故，如来出世广为说法。如来出世不出世，说不说法，众生的如来藏都是常住不变的，都与众生在一起，只要有众生，就有如来藏住持着。</p><p>因为众生有种种的烦恼和无明遮障，遮蔽了自己的心，不见自己身中常住不变异的如来之藏。如来出世就是为了让众生得见自己的本体——如来之藏，所以佛才在娑婆世界，四十九年为大众讲说三藏十二部，让众生明得自己身中的如来之藏。广为众生说法，除灭众生自己身中的贪欲、嗔恚、我慢、无明、邪见等种种的尘劳烦恼，才能够净一切智，让自己的心得以清净，显现出大智慧。智慧显现出来之后，就能够见到自己身中的如来之藏常住不变，见到自己的佛性，常常放光动地，照触着世间一切法。</p><p>善男子，如果有菩萨能够信乐，有如来之藏在众生五阴身中常住不变异，而且能够专心地修学如来藏法，最终得到什么结果呢？便得解脱之果，这个解脱已经不是小乘阿罗汉的出离三界的解脱，而是在三界世间彻底究竟的大解脱。这个彻底究竟的大解脱就是断除一切的无明，无明烦恼及习气全部断尽，生死业障全部断尽；断尽了以后，就成为究竟的、无上的正等正觉。成等正觉以后，能够为世间所有的众生大作佛事，演说一切佛法，广度无量无边之多的众生。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如萎变花　其花未开敷  天眼者观见　如来身无染</strong></p><p><strong>除去萎花已　见无碍导师  为断烦恼故　最胜出世间</strong></p><p><strong>佛观众生类　悉有如来藏  无量烦恼覆　犹如秽花缠</strong></p><p><strong>我为诸众生　除灭烦恼故  普为说正法　令速成佛道</strong></p><p><strong>我以佛眼见　一切众生身  佛藏安隐住　说法令开现</strong></p><p>释：佛就说一段偈颂，总结刚才所说的一段法：</p><p><strong>譬如萎变花。其花未开敷。天眼者观见。如来身无染。</strong>譬如枯萎变异的鲜花，在花还没有开敷的时候，有天眼的人就能观见到有如来身坐于其中，清净无染。</p><p>萎变花就是佛刚刚用神力变现出来的一朵朵千叶莲花，莲花开敷以后，由含苞待放，到开敷，瞬间萎缩变异，生灭变化如此迅速，如此无常。在千叶莲花含苞待放，还没有开敷的时候，有天眼的人，已经证得如来藏有智慧眼的人，能观照到众生身中都有如来藏，没有染污，没有无明，没有贪欲，没有嗔恚，没有愚痴，没有贡高我慢，也没有疑见恶见等种种烦恼；有智慧的人才能证得这一点，没有智慧的人只见含苞待放的莲花。</p><p><strong>除去萎花已。见无碍导师。为断烦恼故。最胜出世间。</strong>把这些枯萎的莲花除掉以后，就能见到于一切法无碍的导师——如来藏。萎花代表了众生的贪嗔痴烦恼和无明恶见，把这些烦恼降伏一下，除去这些烦恼遮障以后，眼眚消失，放出清净光明，智慧显现出来，就能见到无碍导师——众生身中的如来藏。如来藏是无碍的，不管众生有没有贪嗔痴烦恼，如来藏都能如实的显现世间一切法，自己本身没有任何贪欲嗔恚和种种的无明，世出世间无所不见，无所不知，无所不晓，无所不造，什么也遮障不了如来藏的本体之智，什么也遮障不了祂如实显现三界世间万法的功能利用，所以祂是无碍的。</p><p>而众生的五阴身和七识心却障碍重重，有种种的遮障，因为无明，遮障了自己的心，遮障了自己的眼，不见自己身中本有的如来之智、如来之眼、如来之身。导师即指如来藏，如来藏能够引领着众生，在三界世间出生、显现，生住异灭，祂能够统领三界世间的一切法，统领着众生的五阴，直至引领众生走上成佛之路，最终成佛。所以如来藏是无碍的导师，众生的心都是有障碍的。因为无明遮障自己的心，不能见得诸法实相，让自己认假为真，流浪六道生死，苦恼不已。</p><p>为了断除众生的烦恼，三界最尊胜的佛世尊，来此世间指引众生，最胜是指三界世间最殊胜的最尊贵的，就是指佛世尊。因为众生有烦恼，不能见得自己的如来之相，德用具足，佛来到世间就是为了断众生的种种烦恼，清净众生的种种智慧，让众生能够了知、证得自己的无碍导师，自己身中的本有之智，证得实相心如来藏。佛最胜出此世间，就是为了这个目的。所以释迦佛八千次来我们娑婆世界示现，就是为了断除众生的无明烦恼，去除无明，去除心地的染污，最后见得诸法实相，成就无上正等正觉。</p><p><strong>佛观众生类。悉有如来藏。无量烦恼覆。犹如秽花缠。</strong>佛观见所有众生之类都有如来藏，各有各的如来藏。讲经初期，世尊示现的千叶莲花，有无量尊化佛，一个千叶莲花有一个化佛，在千叶莲花中结跏趺端坐，放光动地，照触一切，这就说明一个众生就是一朵千叶莲花，一朵千叶莲花有一尊化佛，喻示着一个众生有一个如来藏，在众生五阴当中显现着自己的功能、德能和功用。</p><p>众生因为有无量无边的烦恼，覆障、遮障着自己的心，使得自己无法证得自己本有的如来藏。无量烦恼比如秽花的污秽，秽花被污秽所缠，众生被这些贪嗔痴烦恼所缠，而不能证得自己的智慧德相。佛就是来此世间把众生的贪嗔痴烦恼给剥离开，去除遮障，去除无明，众生因为剥开了那些烦恼的缠缚，才能见到自己的本有之德智——如来藏。</p><p><strong>我为诸众生。除灭烦恼故。普为说正法。令速成佛道。</strong>我为了所有的众生，能够去除烦恼的遮障，断除无明染污，而普为诸众生演说正法。这个正，就是大方广、方正、正真的如来藏法，只有这个是最正的。其他的法都是如来藏所出生和显现出来的法，因此都是旁出不正的。正法如来藏不生不灭，常在世间；被如来藏正法所出生的不正法刹那生灭，无常变异。佛普为所有的大众演说如来藏正法，让所有的众生都能快速地成就无上的佛道，回归自己的觉性家园。</p><p><strong>我以佛眼见。一切众生身。佛藏安隐住。说法令开现。</strong>我以佛眼看到一切众生的五阴身当中，佛之宝藏——如来藏安稳住着，众生自己却不知不见，佛来说法，令如来藏显现在众生心中，为众生开示悟入如来藏法。佛了知所有众生的五阴身中都有如来藏安稳住着。佛藏就是如来藏，是自己的本有之心，在众生的五阴身中虽然住，但住而无住。安稳，就是如如不动，不随众生的恶见而有恶见，不随众生的无明而有无明，不随众生的烦恼而有烦恼，不随众生的染污而有染污；众生五阴来，现出众生，如来不随其出生；众生五阴灭去，如来藏不随五阴而灭亡。不来不去，如如不动，就叫安稳而住。</p><p>佛看见众生的如来藏安稳而住，说法令其开现，众生得见，开启智慧。佛来娑婆世界开演三藏十二部经典，目的是让众生除去烦恼的遮障，令自己的心智打开，证得自己五阴身中的本有之智，明心见性，最后成就佛道。世尊以及无量的诸佛，为十方世界所有众生，演说妙法，目的也在于此。释迦佛到我们娑婆世界八千次示现成就佛道，演说三藏十二部，目的就是为了开显众生的如来之智，示现悟入如来之智，让众生见性成佛，成为究竟的无上正等正觉。所以说佛有无量的慈悲，无量的大智，来为众生显现真实的如来藏之法，让众生悟入，断除众生所有的无明烦恼。</p></div>"
},{
    "title": "第五章 如来藏的八种譬喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  如来藏的八种譬喻</strong></p><p>原文：<strong>复次。善男子。譬如淳蜜。在岩树中。无数群蜂。围绕守护。时有一人。巧智方便。先除彼蜂。乃取其蜜。随意食用。惠及远近。　</strong></p><p>释：世尊很善于使用种种的比喻，暗示众生身中都有如来藏，让众生信受自己身中有如来智慧德相，然后世尊给众生说法，开示如来的智慧德相，让众生证得以后，将来慢慢地就能成就无上的佛道。</p><p>佛说：善男子，譬如纯净的蜂蜜在树上或者岩石的某个处所，有无数的蜜蜂守护着这些蜂蜜。这些蜂蜜就是蜜蜂全部的饮食，所以无数的蜜蜂把蜂蜜当作性命一样的守护着。因为蜜蜂有毒，能够蛰人伤害人，一般人就不敢近前采取纯蜜。但是有人用很巧妙的办法能够得到这些蜂蜜，他想一些办法先把蜜蜂除去，然后再取得纯蜜，自己吃不完，就送给远近的亲属朋友。</p><p>原文：<strong>如是。善男子。一切众生。有如来藏。如彼淳蜜。在于岩树。为诸烦恼。之所覆蔽。亦如彼蜜。群蜂守护。我以佛眼。如实观之。以善方便。随应说法。灭除烦恼。开佛知见。普为世间。施作佛事。</strong></p><p>释：善男子，如来藏也是如此。一切众生都有如来藏，在五蕴烦恼当中，犹如在岩树中一样。如来藏好比淳蜜，烦恼好比蜜蜂，烦恼覆蔽着如来藏，犹如蜜蜂守护淳蜜一样，众生没有善巧方便，不能证得如来藏。我以佛眼观察，众生身中确实都有如来藏，我以种种善巧方便为众生讲经说法，目的就是要降伏众生的烦恼，去除遮障，为众生开示佛之知见，让众生悟入，普遍布施诸众生广作佛事。</p><p>因为佛心清净，没有遮障，不仅能见得自己的如来藏，也能见得所有众生的如来藏。佛说法开示众生，降伏众生的烦恼之后，如来藏就显露出来了。不是如来藏自己显现出来，而是烦恼降伏以后，心清净下来，沉淀下来，如同清水现前的时候，如来藏之月就在清水上面浮现出来。水浊不清的时候有没有如来藏之月呢？也有如来藏之月，只是水浊，映现不出来，烦恼犹如浊水覆蔽心田，众生就发现不了自己身中的如来藏。</p><p>觉知心烦恼重重时，没有善巧方便，不能发现身中宝藏，等觉知心之水沉净下来，烦恼降伏了以后，就能够照见如来藏之月，就发现了如来藏，悟得了如来藏，这样就开了佛的知见，悟了佛的知见。佛在世间说法就是这个目的，灭除众生的烦恼，让众生开佛知见，示佛知见，悟佛知见，入佛知见，成就佛道。所以，佛普为世间施作佛事，这个佛事就是指为众生讲经说法，灭除烦恼，开示如来藏之法。不是指现在的佛事（开光、送吉、超度等），其实真正的佛事就是讲经说法，显示众生如来之藏。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如岩树蜜　无量蜂围绕  巧方便取者　先除彼群蜂</strong></p><p><strong>众生如来藏　犹如岩树蜜  结使尘劳缠　如群蜂守护</strong></p><p><strong>我为诸众生　方便说正法  灭除烦恼蜂　开发如来藏</strong></p><p><strong>具足无碍辩　演说甘露法  普令成正觉　大悲济群生</strong></p><p>释：这个比喻说完了之后，世尊就说了一个偈子作总结：</p><p><strong>譬如岩树蜜。无量蜂围绕。巧方便取者。先除彼群蜂。</strong>譬如岩树上的蜂蜜，无量的蜜蜂围绕着它，守护着它。为了得到蜂蜜，具有善巧方便的人，先要除去那些守护的蜜蜂，因为蜜蜂的守护，把蜂蜜给遮障了起来，他人无法靠近取得蜂蜜食用。蜜蜂比喻众生的烦恼，蜂蜜比喻为如来藏，众生原有烦恼遮蔽自心，不能证得如来藏，依之得解脱。</p><p>如果有人用善巧方便的方法，他就能把蜂蜜取出来享用；众生有善巧方便的方法，降伏了烦恼，就能寻觅得到自己身中的如来藏。取蜂蜜的人，先除彼群蜂，比喻说众生想明心见性，就要先把烦恼降伏下来，降伏烦恼，心得清净，智慧显现出来，就能明心见性，证得自己的如来藏。</p><p><strong>众生如来藏。犹如岩树蜜。结使尘劳缠。如群蜂守护。</strong>众生身中的如来藏，犹如岩树里的蜂蜜，贪嗔痴烦恼结使，尘劳烦恼缠缚，犹如群蜂守护蜂蜜一样。结就是众生的烦恼结，如贪欲、嗔恚、愚痴、我慢等种种的烦恼结，使就是使者。烦恼使者，常常缠绕自心，遮蔽自心不见如来藏。每日里的尘劳烦恼也在缠缚着自己身中的如来藏，把如来藏隐蔽起来，不令自己发觉。必须把这些结使尘劳烦恼除去，如来藏才能显露出来，众生才能证得，受用得解脱。如果不除去烦恼，贪欲、嗔恚和无明就会使心不清净，那就不能得见如来藏。</p><p><strong>我为诸众生。方便说正法。灭除烦恼蜂。开发如来藏。</strong>我为诸众生，用种种善巧方便，演说如来藏正法，灭除烦恼的蜜蜂，开发、显示出如来藏。如来藏之法，叫作正法，正就是方正、正真的意思。开发如来藏，不是指原来没有如来藏，现在给开出来了，不是这个意思，而是指开示显发，原来就有如来藏，但是因为有烦恼遮障着，不能见得，现在如来把如来藏揭示出来，指出来，众生顺指就能够证得如来藏了。</p><p><strong>具足无碍辩。演说甘露法。普令成正觉。大悲济群生。</strong>佛具足无碍的辩才，种种妙语演畅，种种妙法敷扬，演说甘露法雨，普遍令诸众生灭除烦恼，证得如来藏，得清净智，究竟成佛，并且以大悲心济度诸群生。佛通过演说无量的甘露法，普令所有的众生，都成正觉，也以无量的大悲心，普遍地济度、救拨一切群生，让他们都能离苦得乐，得大解脱，成就佛道。</p><p>原文：<strong>复次。善男子。譬如粳粮。未离皮糩。贫愚轻贱。谓为可弃。除荡既精。常为御用。</strong></p><p>释：佛说：复次善男子，譬如刚收割的稻粮没有去皮，也没有去糠，外面的皮壳还包裹着，贫贱而愚痴的众生，不识真货，就轻贱这个稻粮，认为它是没有用的，不把它当作可食用的高贵食品，就给丢弃了。如果把粳粮的皮壳都剥开，除去糠皮，剩下的精贵的东西，就是精米，这些精米是国王和大臣们食用的。</p><p>外表包的皮糠虽然不能食用，可是里面却有精米。贫贱而愚痴的众生，不认识带皮壳的粳米的价值，把它当作无用的废物给抛弃了。如果用方便的方法加工粳粮，除去皮和糠，剩下的就是精品精米了，这是一个比喻。</p><p>原文：<strong>如是。善男子。我以佛眼。观诸众生。烦恼糠糩。覆蔽如来。无量知见。故以方便。如应说法。令除烦恼。净一切智。于诸世间。为最正觉。</strong></p><p>释：善男子，我以佛眼观见所有的众生，烦恼的皮糠覆蔽着自己如来的无量知见，覆蔽着自己的如来藏。因为这种覆蔽，隐藏了如来的知见，显现的全部是众生的邪知邪见，没有开显出如来的智慧。所以我用各种方便善巧方法，广为众生方便说法，让众生除去这些烦恼皮糠的遮障，心得清净，显发如来清净的智慧，证得如来藏。烦恼除去，众生就显现出来清净的智慧了，智慧圆满，成就佛道，究竟成佛。</p><p>所以成佛是靠什么呢？是靠智慧，想要智慧应该怎么作呢？那就用种种方便方法如持戒、禅定、布施、忍辱、精进、般若六波罗蜜，降伏烦恼，去除无明，显现清净的智慧，最后以清净的智慧，成就无上的正觉。　</p><p>原文：<strong>尔时世尊。以偈颂曰。</strong></p><p><strong>譬一切粳粮　皮糩未除荡  贫者犹贱之　谓为可弃物</strong></p><p><strong>外虽似无用　内实不毁坏  除去皮糩已　乃为王者膳</strong></p><p><strong>我见众生类　烦恼隐佛藏  为说除灭法　令得一切智</strong></p><p><strong>如我如来性　众生亦复然  开化令清净　速成无上道</strong></p><p>释：这时世尊以偈颂作总结说：</p><p>譬一切粳粮。皮糩未除荡。贫者犹贱之。谓为可弃物。譬如所有的粮食没有加工，带着皮和壳，糠没有除去，皮没有剥去。贫穷的人却轻贱它，认为这些粗糙的东西是不能食用的，应该丢弃不要。</p><p>外虽似无用。内实不毁坏。除去皮糩已。乃为王者膳。外边的皮和糠虽然好象没有什么用处，但是里面的果实（精白米）却没有毁坏，不能丢弃不要。这个譬喻是用来比喻我们的如来藏，清净不可毁坏，如来藏的外边虽然缠缚着众生的烦恼，看着外表好像是没有什么用，但是剥去烦恼，就显露出如来藏了。</p><p>除去外面的皮和糠，就是国王大臣所享用的美食，老百姓不识得这内在的宝贝，给扔弃了。为什么扔弃了，因为他们没有福德，没有方便善巧的方法，无法享用到精白米。所以众生没有福德、没有智慧的时候，就不能除去烦恼，证得如来藏。要除烦恼之前还要修福德，福德先修好，然后想办法降伏烦恼，证得如来藏，智慧清净，清净至极，福慧圆满，成就佛道。</p><p>我见众生类。烦恼隐佛藏。为说除灭法。令得一切智。我见所有六道轮回的众生，他们的烦恼都把如来之宝藏隐覆住了，因为这些烦恼遮障，如来之藏无法显现。我为众生宣说除灭烦恼法，令诸众生证得一切智。</p><p>烦恼遮障时，如来藏真的没法显现吗？不是，如来藏常在显现着，从来不躲藏，智者时时见，只是众生烦恼如乌云遮蔽阳光，使得心不清净，不能得见如来之藏。所以佛为说除灭烦恼的方法，令众生获得清净的智慧。一切智是指大乘与小乘修证所共同得到的智慧，包括解脱智、尽智、无生智、苦集灭道智等等。苦集灭道智，就是断除烦恼的智慧，断除烦恼清净智慧，证得如来藏，般若大智慧就显发出来了。</p><p>如我如来性。众生亦复然。开化令清净。速成无上道。就像我的如来佛性那样，众生的如来性也是如此。我只是开化教导众生，令心得清净，发现和证得自己的如来性，然后让众生迅速成就无上菩提。佛的如来性是如此的，众生的佛性也如此，与佛无异，都是清净无比的。</p><p>佛说法开化众生，让众生心得清净，获得一切智，最后一切种智全部具足，就能快速地成就无上之道。所以成佛的方法是什么？修福德，降伏烦恼，获得清净智慧，清净智慧圆满了，就成就佛道。那么一切法的修行，以证悟如来藏为标的，为关键，为中心，所以明心见性之法，是最重要的，是修行的最初方便。</p><p>原文：<strong>复次。善男子。譬如真金。堕不净处。隐没不现。经历年载。真金不坏。而莫能知。</strong></p><p>释：复次，善男子，譬如真金堕在肮脏之处，隐没看不见了，经过了很多年，真金也没有毁坏，但是也没有人记得了。</p><p>世尊又说了第三个比喻，用真金来比喻如来藏，真金堕在肮脏污秽之处，隐没不现，谁也看不见，没法取出来了，经历了很多很多的年月，真金也没有坏。因为时间很长了，大家都忘记了这件事，谁也不知道在这肮脏污秽之处还有真金。这个肮脏污秽之处是指什么地方？指众生的烦恼之处，众生烦恼身中有如来藏，而众生自己却不知道。</p><p>原文：<strong>有天眼者。语众人言。此不净中。有真金宝。汝等出之。随意受用。如是。善男子。不净处者。无量烦恼是。真金宝者。如来藏是。有天眼者。谓如来是。是故如来。广为说法。令诸众生。除灭烦恼。悉成正觉。施作佛事。</strong></p><p>释：有天眼者告诉众人说，此肮脏不净处有真金宝埋藏其中，你们大家应该想办法取出来，然后就能随意享用了。确实是这样，善男子，肮脏不净处就是无量烦恼聚集处，真金宝就是如来藏，有天眼者就是如来世尊。因此如来广为众生说法，令诸众生除灭烦恼，全都证成阿耨多罗三藐三菩提，再普度众生，都成正等正觉。</p><p>有天眼的人什么都能看得见，地球底下最底层的宝物都能看得见，没有任何遮障，天眼无障。天眼者比喻为佛世尊，佛的大智慧，能见众生身中的如来藏宝藏，为了让众生识得，佛就说法为众生指出宝藏所在之处，让众生得见。佛对众生说，在烦恼聚集的五蕴身中，埋藏着如来藏，你们赶快降伏烦恼，从中找到祂，获得智慧财宝，从此就能享用祂，得大自在，智慧财宝具足了，就成佛了。佛到这个世界来广为众生说法，就是为了令诸众生除灭烦恼，悉成正觉，然后施做佛事。佛所做的佛事就是讲法、度众，开示众生如来之见，开示众生如来藏之法。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>如金在不净　隐没莫能见  天眼者乃见　即以告众人</strong></p><p><strong>汝等若出之　洗涤令清净  随意而受用　亲属悉蒙庆</strong></p><p><strong>善逝眼如是　观诸众生类  烦恼淤泥中　如来性不坏</strong></p><p><strong>随应而说法　令办一切事  佛性烦恼覆　速除令清净</strong></p><p>释：这一段佛就以偈颂来做一下总结：</p><p><strong>如金在不净。隐没莫能见。天眼者乃见。即以告众人。</strong>就像真金在肮脏污秽之处隐没了一样，没有人能够发现它，但是有天眼的人却能看得见，看见了以后，就告诉众生应该想办法取出真金。所以佛在菩提树下刚一成道就知道了一切众生皆有如来藏的智慧德相，说道：“奇哉!一切众生皆具如来智慧德相，然以妄想执著不能证得。”然后佛陀就为众生讲经说法，伸出指月之指，告诉众生顺指望月，指引众生明心见性的方便方法，证得如来智慧德相。</p><p><strong>汝等若出之。洗涤令清净。随意而受用。亲属悉蒙庆。</strong>你们大家如果能把真金取出来，洗涤令其清净，然后就能随意受用，家亲眷属们都能跟着欢喜受乐。</p><p>这里世尊指示众生，如果能从烦恼身中证得如来藏，然后汰除染污业种，就能随意得大受用。众生的如来藏被烦恼污垢的无明所缠裹着，通过修行去除染污种子，断除无明，转变成无垢识，就是原本的那颗真金，干干净净的真金，如来藏的本来清净的面目。</p><p>其实如来藏本来是清净的，为什么现在不清净了呢？是七识污染造成的。堕在烦恼不净处，就成为了不垢不净、又垢又净的和合体，不是祂本身不清净，而是缠裹物不清净。所以众生的如来藏也叫作在缠如来藏，是被众生的贪嗔痴烦恼缠裹着的如来藏，把烦恼洗净了的如来藏叫作出缠如来藏。出了缠缚的如来藏就是佛地的无垢识，也叫作真如。</p><p><strong>善逝眼如是。观诸众生类。烦恼淤泥中。如来性不坏。</strong>佛眼就是这样，观诸众生类，在烦恼的淤泥中，有如来的智慧德相，俨然不坏，佛性常清净不坏灭。</p><p>善逝是佛的一个名号，寓意是离世走得很好，去往大解脱之处，没有业障的牵累，自由自在。佛眼看众生虽然陷入贪嗔痴慢疑恶见种种的烦恼中，但是在这烦恼当中的佛性如来藏，本来就是清净无染的，永远也不坏灭。</p><p><strong>随应而说法。令办一切事。佛性烦恼覆。速除令清净。</strong>如来随着众生的种种根基，随应而说种种法，令众生证得本体之心如来藏，成就一切的事业。佛性被烦恼覆盖着，众生无法得见佛性，应当把烦恼去除，遮障打开，心得清净，佛性就能在心中显现出来。佛性本来就是清净的，本来就在显现着，只因烦恼覆心，故不得见，所以应该速速除去这些烦恼，令得清净智慧。所以修行就是要去除妄心七识的染污，然后开大智慧而成佛。</p><p>原文：<strong>复次。善男子。譬如贫家。有珍宝藏。宝不能言。我在于此。既不自知。又无语者。不能开发。此珍宝藏。一切众生。亦复如是。如来知见。力无所畏。大法宝藏。在其身内。不闻不知。耽惑五欲。轮转生死。受苦无量。</strong></p><p>释：佛又作了第四个比喻。复次，善男子，譬如有个贫穷的人家，家中有珍宝隐藏不见，找不到了。珍宝本身不能说话，不能告诉人们说我在这里，不能把自己显示出来，让众人了知。一切众生也都是这样，具足如来的智慧德相，具足十力、四无所谓，有大宝法藏在五阴身内，却不闻不知，而沉湎于烦恼惑业和五欲六尘之中，轮转生死受无量苦，因此诸佛才出兴于世，说法教化无知无闻的刚愎众生，令其证实相，得解脱。</p><p>如来藏这个珍宝亦复如是，祂不自知，又不会说话，不能表达自己，不能主动显示给大众了知，因此如来藏不能证得自己，不能把自己找出来，所以如来藏无法开悟，祂不能悟得自己。即使如来藏能悟得自己，六识七识还是没有悟得如来藏，六识七识还是无明具在，迷惑颠倒，不曾开悟，那就仍然是凡夫一个。</p><p>那意思是说如来藏在五阴身中，自己不知道自己，自己不能证明自己，即使如来藏能证明自己，六七识也不知不证，还是不悟。同理，我们参禅寻觅如来藏的时候，如来藏也不能告诉我们祂在哪里，祂也不能证明自己的存在，而认为自己开悟了。这说明参禅是用能觉知的意识意根去寻觅如来藏，不是如来藏自己找自己。所以说明心开悟，是意识意根证得了如来藏，见到了如来藏，不是如来藏自己证得了自己；也不是如来藏明心见性，而是意识意根明心，明的目标是如来藏，见得如来藏的性用，明心见性是这个意思。</p><p>我们在参禅的时候，如来藏不会站出来说我在这里；如来藏没有我性，祂不能证明自己，说我就是如来藏，祂也不知道自己，如来藏是无语的，不与语言文字相应。就像佛说的珍宝不能证得自己，不能自己找自己一样，是众生去找珍宝，就是说是我们的五阴七识去寻觅如来藏，证得如来藏，从而明心见性。</p><p>这段文字，世尊非常肯定众生身中有如来藏，如来藏是真实有，是实体，不是虚无的，也不仅仅是个名字和名言，也不是方便说。任何人都不能再愚痴地说，如来藏仅仅是个假名词，是个概念，并没有实体，并不存在，因此愚痴地说开悟就是见得一无所有。再作此说者，千佛出世，不能救度，永劫沉沦。</p><p>如来藏能出生和执持一切法，主宰一切法，祂犹如金刚常住不坏，什么也不能毁灭祂，反而祂能让一切法生、住、异、灭，祂的功德力量无比强大，具足十力、四无所畏，无所匹敌。如来藏在众生的五阴身之内，众生自己不闻不知，生生世世沉溺在财色名食睡的五欲当中，沉湎在色声香味触之中，轮转生死受苦无量。</p><p>原文：<strong>是故诸佛。出兴于世。为开身内。如来法藏。彼即信受。净一切智。普为众生。开如来藏。无碍辩才。为大施主。如是。善男子。我以佛眼。观诸众生。有如来藏。故为诸菩萨。而说此法。</strong></p><p>释：佛说：因此之故，诸佛出兴于世，为了开示众生身内的如来之藏，众生信受后，能清净一切智慧。佛世尊有无碍的辩才，是众生的大施主，广泛为众生开示如来藏正法。众生信受不疑，智慧清净时，就证得了如来藏。如是，善男子，我以佛眼观见所有众生身中都有智慧德相，都有如来藏常住身中，不灭不坏，清净无余，故此种种说法，言词譬喻，开示给众生，显示给众生，让众生开示悟入佛之知见。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如贫人家  内有珍宝藏  主既不知见  宝又不能言</strong></p><p><strong>穷年抱愚冥  无有示语者  有宝而不知  故常致贫苦</strong></p><p><strong>佛眼观众生  虽流转五道  大宝在身内　常在不变易</strong></p><p><strong>如是观察已　而为众生说  令得智宝藏  大富兼广利</strong></p><p><strong>若信我所说　一切有宝藏  信勤方便行　疾成无上道</strong></p><p>释：这个譬喻说完了，最后佛以一个偈子来总结这一段：</p><p><strong>譬如贫人家。内有珍宝藏。主既不知见。宝又不能言。</strong>譬如一个贫穷人家，家里藏着珍宝藏，主人不知道，也看不见找不到，珍宝自己又不能说我在这里。</p><p>穷年抱愚冥。无有示语者。有宝而不知。故常致贫苦。于是这个贫穷的人，很多很多年，带着这种愚痴，不知家中藏有宝藏，多年过着贫穷乞讨的生活。又没有人告诉他家宅里埋藏着珍宝，更没有人能告诉他宝藏藏在哪里，因为他那时候没有福德，还享用不了宝藏。这样的话，明明自己家中有宝藏，但主人却不知道，珍宝自己也不会开口说出来，所以这个人就常常贫穷困苦，过着下贱贫民的生活。</p><p><strong>佛眼观众生。虽流转五道。大宝在身内。常在不变易。</strong>佛眼观察众生， 众生虽然流转在五道里，却有大宝藏在其身内，永远存在五阴身中而不能改变和毁损，大宝藏能利乐众生无有穷尽。五道是指天、人、地狱、鬼、畜生这五道，阿修罗道分布在五道里面。</p><p><strong>如是观察已。而为众生说。令得智宝藏。大富兼广利。</strong>佛如是观察以后，知道众生身中有大宝藏，就为众生演说经法，开示给众生自己身中的宝藏，让众生证得身中的大智宝藏，成为大富长者，并且广泛利益无量众生。众生获得智慧的宝藏，是从外面得来的吗？不是的，是众生自己身中的宝藏，非从外得，家中本有之宝，只是找到而已。</p><p><strong>若信我所说。一切有宝藏。信勤方便行。疾成无上道。</strong>如果众生相信我（佛）所说的，一切众生身中都有宝藏，那么众生只要能相信，并且精进勤行各种方便方法，勤修菩萨六度，就能迅速地成就无上佛道。首先要相信佛所说自己身中有如来藏，信位圆满，然后精勤地修行菩萨六度，圆满自己作菩萨的条件，用种种方便，广行菩萨六度，最后就能证得如来藏，明心见性，获得清净的大智慧，获得一切种智，最后就迅速地成就无上的正等正觉。</p><p>下面是第五个譬喻，用庵摩罗果来比喻如来藏。</p><p>原文：<strong>复次。善男子。譬如庵罗果。内实不坏。种之于地。成大树王。如是。善男子。我以佛眼。观诸众生。如来宝藏。在无明壳。犹如果种。在于核内。</strong></p><p>释：复次善男子，譬如庵摩罗果，内里的果实确实没有坏，把果核里的种子种在大地里，之后种子发芽、生根、开花、结果，最后成为一颗大树王。如是，善男子，我以佛眼观诸众生，如来宝藏在众生心中的无明壳里，犹如果实的种子在果核内一样。</p><p>非常非常高大的一颗树，就是树王，那么这个树籽有多大呢？非常非常的小，但是把树种子种到地里，却能长出参天大树。庵摩罗果的果实比喻为如来藏，庵罗果外面的果肉果核比喻为无明壳，也就是众生的烦恼壳里裹着如来藏。众生心里有着这么厚的无明，能见到如来藏吗？当然见不到，佛就来教导众生见到如来藏的方法，那就是把无明壳剥开，露出果实，然后这果实就有大的利用了，果核里有种子，这个种子将来种在地里就会发芽、生根、开花、结果，长成参天大树。</p><p>原文：<strong>善男子。彼如来藏。清凉无热。大智慧聚。妙寂泥洹。名为如来。应供等正觉。</strong></p><p>释：善男子，那个如来藏清凉没有热恼，心地清净，没有贪嗔痴无明烦恼，祂集聚了世出世间无比的大智慧，处于绝妙的寂静的不生不灭的涅槃境界，是如来法身，也叫作如来、应供、正等、正觉。</p><p>如来藏清凉没有热恼，热恼是贪嗔痴烦恼无明，清凉是清净无比，没有贪嗔痴烦恼，内心是寂静的。如来藏是大智慧的宝藏，所有的智慧聚集于如来藏里。祂也是摩尼宝珠，能现一切法，变生一切法。妙寂泥洹妙用无穷，这都是在说如来藏，寂净无比，泥洹就是指具有涅槃性的不生不灭、不垢不净、不来不去性，名为如来应供等正觉，这个清净藏也方便称为佛，发现祂以后，智慧究竟清净了，就圆满成佛。自已有如来藏，将来才能成为如来应供等正觉。</p><p>原文：<strong>善男子。如来如是。观众生已。为菩萨摩诃萨。净佛智故。显现此义。</strong></p><p>释：善男子，如来如是观察众生以后，为了让菩萨摩诃萨智慧清净，早日具足清净的如来智慧的缘故，就要为众生为菩萨们显现此如来藏真义。</p><p>如来如是的观察了众生以后，知道众生身中有清净的如来之藏，无热无恼，在众生的无明壳内，在众生的贪嗔痴烦恼的五阴身之内，被裹着，众生不能得见，佛为了让菩萨摩诃萨们能够获得清净的如来智慧，证得如来的智慧德相，最后具足佛的无上的智慧，转识成智，成佛度众生，显现给众生，就显现给菩萨们众生身中清净的如来藏，然后让菩萨摩诃萨悟入佛的知见，证得如来清净之藏。佛把自己到各个佛刹广度众生的大愿说了出来，为了给众生开示悟入佛之知见，开示如来智慧的宝藏，让菩萨们证得如来智慧德相，获得大智慧，最后成为清净、圆满、觉悟的无上佛。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如庵罗果　内实不毁坏。种之于大地　必成大树王</strong></p><p><strong>如来无漏眼　观一切众生。身内如来藏　如花果中实</strong></p><p><strong>无明覆佛藏　汝等应信知。三昧智具足　一切无能坏</strong></p><p><strong>是故我说法　开彼如来藏。疾成无上道　如果成树王</strong></p><p>释：最后世尊还是以一个偈子来概括全部的比喻：</p><p><strong>譬如庵罗果。内实不毁坏。种之于大地。必成大树王。</strong>譬如庵摩罗果，里边有果实叫作种子，果实没有毁坏，把这个果实种在大地中，将来就能够长成参天大树，成为大树王。说明这树种子虽小，但它的作用力却非常大，只是被众生的无明壳裹住了，不能显现出来大的德能。佛以善巧方便，破除众生的无明壳，使如来藏显现出来，众生证得就能成就佛那样的参天大树。</p><p><strong>如来无漏眼。观一切众生。身内如来藏。如花果中实。</strong>佛的无漏的智慧眼，观察到了一切众生的五阴身中、烦恼身内、无明壳中，有如来藏，有如来智慧德相，就像花果之中没有毁坏的那个果实一样。佛的种种无明全部都断尽了，一丝烦恼习气都没有了，这叫作无漏，善法和善根再也不能漏出去了，达到了彻底的无漏，究竟成了佛。</p><p><strong>无明覆佛藏。汝等应信知。三昧智具足。一切无能坏。</strong>众生心中的无明，裹覆遮盖了佛的清净之藏、如来之藏，使得众生自己不能得见如来藏。你们这些大众应该相信，也应该证知如来藏三昧力和智慧力都具足，一切法都不能毁坏众生身中的如来藏。</p><p>当菩萨摩诃萨的定慧具足了以后，就能够证得这个清净的如来之藏，在烦恼身中永远不能毁坏。什么能被毁坏呢？烦恼能够被毁坏，无明壳能够被毁坏，众生的五阴身能够被毁坏，但是这个如来之藏，永远不生不灭，任你什么力量，都不能够毁坏祂一丝毫。为什么不能够被毁坏呢？因为祂无形无相，不生不灭，祂的体性本来就如此，没有生灭性，法尔如是，所以任凭什么力量也不能改变祂，不能消灭祂，不能毁坏祂。</p><p><strong>是故我说法。开彼如来藏。疾成无上道。如果成树王。</strong>因此之故，我说法开示众生身中自己的如来藏，把祂显示出来，让众生证得祂，得见祂，最后迅速得成无上佛道，就像果实变成参天大树的树王一样。这个果实就比喻为如来藏，如来藏能成就世出世间一切法，能让众生成就佛道，就是成就了大树王，树中之王。这是大树王的比喻，比喻如来藏就像一个真实不坏的果实，能长成参天大树，让众生究竟成就佛道。</p><p>下面佛又讲了如来藏的第六个关于真金像的譬喻，把如来藏比喻成一个真金像。</p><p><strong>原文：复次。善男子。譬如有人。持真金像。行诣他国。经由险路。惧遭劫夺。裹以弊物。令无识者。</strong></p><p>释：复次，善男子，譬如有一个人携带着真金像，要走远路到他方国家。这两个国家之间，路途遥远而且比较危险。这个人害怕遭遇劫匪，担心真金像被强盗发现遭受抢劫，他就想了一个办法，把真金像的外围裹上了肮脏污秽的衣物，如破衣服、脏布、草泥之类的东西，裹在真金像的外边，目的是先把真金像掩藏起来，不让别人发现它，让人以为这是肮脏破弊的东西，谁也不会想要它。</p><p>原文：<strong>此人于道。忽便命终。于是金像。弃捐旷野。行人践蹈。咸谓不净。得天眼者。见弊物中。有真金像。即为出之。一切礼敬。</strong></p><p>释：裹完之后，这个人在路上忽然遭受了不测，突然间死了。于是真金像就被遗弃旷野之中，路过的行人践踏过去，都说这个包裹不干净。而得到天眼的人，看见破布裹着的包裹中有真金像，就吧真金像拿出来，对金像用各种礼仪顶礼。</p><p>人死了这说明什么呢？说明人命无常，五阴随时都能灭去。但是他人虽然死了，真金像并不跟着他的死亡而灭亡，说明五阴灭了，如来藏却不灭。这个人命终以后，真金像就被遗弃在旷野之中，被扔在荒郊野岭了。期间来往的行人，遇到这个裹着破烂肮脏衣物的金像，谁也不把它当回事。行人用脚贱踏过去，都认为是不清净的肮脏之物，不知道里边裹着什么，谁也没有打开过。就像我们这个破弊的五阴，谁也不往里寻觅真金宝如来藏，我们五阴身里有摩尼宝珠，谁也不识不知祂，反而不知不觉地用它来造作恶业。</p><p>但是得天眼者却看见弊物中有真金像，就像佛刚成道的时候说的：“大地众生皆有如来智慧德相”，佛就发现了如来藏这个真金宝像，把外围的破烂肮脏的五阴包裹物给去除了，取出了真金像如来藏。取出来以后，所有人都看见了，大家都来礼拜。所以说佛能发现众生身中的如来宝藏，发现了以后，指示给他人来证得，证得以后，所有人依之而修行，都富贵发达了，最后成为究竟的佛。</p><p>天眼什么都能看见，不管外围裹着什么东西，天眼有透视性，就算你裹着地球这么厚的东西，天眼照样能透过地球，看到里面的东西。这个天眼者就比喻为佛世尊，佛能见得诸法实相，在肮脏破弊的五阴当中，祂能够见得烦恼当中的如来藏和佛性。</p><p>原文：<strong>如是。善男子。我见众生。种种烦恼。长夜流转。生死无量。如来妙藏。在其身内。俨然清净。如我无异。是故佛为。众生说法。断除烦恼。净如来智。转复化导。一切世间。</strong></p><p>释：就像真金像的譬喻一样，善男子，我看见众生因为有种种烦恼，在生死长夜中流转不息，生死时劫过于无量世无量劫，如来的妙宝藏却在其身内，俨然清净，与我的无垢识一样，没有差别。因此之故，佛就为众生说法，让众生断除烦恼，清净智慧，圆满具足如来智慧德相，然后再转转化导一切世间无量众生。</p><p>如来的妙藏就是如来宝藏，妙就是如摩尼宝珠般的奇妙，能现出一切妙有的三界世间法，所以叫如来妙藏。如来妙藏在众生的烦恼身内还是那么的清净，众生的贪嗔痴烦恼并没有染污到祂，其清净性和智慧性与佛的无垢识是一样的，没有什么差别，都是那样的清净，那样的珍贵，那样的美妙。</p><p>包裹真金的破弊物比喻为众生种种的烦恼，众生因为有种种的烦恼，在生死长夜里不断的流转，只要没有回归正道，没有明心见性，生死都是无始无终的，无有出期。直到你证得如来宝藏断尽烦恼和无明的那一天，生死长夜就结束，不再有生死了，心地里都是光明，没有无明，也没有黑暗。佛为了开发出众生烦恼身中的如来妙藏，让众生得大富贵和自在，才出兴于世间，为众生演说佛法。目的是断除众生的烦恼，证得如来的智慧德相，找到如来宝藏。转复化导世间一切众生，就像无尽灯一样，灯灯相燃，让佛法永续流传，度尽所有的众生，出离生死的暗夜。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬人持金像　行诣于他国  裹以弊秽物　弃之在旷野</strong></p><p><strong>天眼者见之　即以告众人  去秽现真像　一切大欢喜</strong></p><p><strong>我天眼亦然　观彼众生类  恶业烦恼缠　生死备众苦</strong></p><p><strong>又见彼众生　无明尘垢中  如来性不动　无能毁坏者</strong></p><p><strong>佛既见如是　为诸菩萨说  烦恼众恶业　覆弊最胜身</strong></p><p><strong>当勤净除断　显出如来智  天人龙鬼神　一切所归仰</strong></p><p>释：世尊又以偈颂作总结：</p><p><strong>譬人持金像。行诣于他国。裹以弊秽物。弃之在旷野。</strong>譬如一个人随身带着金像，行走在去他国的路上，由于害怕劫匪，把真金像裹上肮脏弊秽的衣物，最后人突然间死去了，真金像被抛弃在荒郊野岭。这就说明，如来妙藏不随人的死而死，不随五阴的灭亡而灭亡。</p><p><strong>天眼者见之。即以告众人。去秽现真像。一切大欢喜。</strong>具足天眼的人发现了真金像，立即告诉众人，众人就把肮脏的衣物除去，露出真金像，一切大众皆大欢喜。天眼人喻为佛世尊，佛见众生烦恼身中有如来宝藏，常住不变，就开示与众生，想办法降伏烦恼，取出宝藏。佛告诉众生，烦恼身中有如来妙藏，需要用降伏自心的方法才能够挖掘出来，证得自己的如来妙藏，明心见性，究竟成佛。</p><p><strong>我天眼亦然。观彼众生类。恶业烦恼缠。生死备众苦。</strong>我的天眼也是这样，能够看见所有的众生之类，他们造作的恶业和自心的烦恼都在缠缚着如来妙藏，因不见宝藏，贫穷受苦，生死流连。</p><p><strong>又见彼众生。无明尘垢中。如来性不动。无能毁坏者。</strong>我又看见那些众生，他们的无明烦恼和尘劳污垢当中，有如来成佛之性俨然不动，谁也不能摧毁祂。因为祂犹如金刚一样坚固，不可毁坏。</p><p><strong>佛既见如是。为诸菩萨说。烦恼众恶业。覆弊最胜身。</strong>诸佛既然见到了这样一个真金妙宝藏，一定要为诸菩萨来宣说如来藏之妙法；告诉诸菩萨，众生的烦恼诸恶业，覆弊着如来妙宝藏，遮障着自己最殊胜的法身如来藏，让众生不能得大自在，得大解脱。</p><p><strong>当勤净除断。显出如来智。天人龙鬼神。一切所归仰。</strong>佛嘱咐众菩萨说，你们应该精勤地断除所有的烦恼，断除所有的无明，清净自己的智慧，之后才能够显示出如来的大智慧，转识成智，具有如来之智。八识转成四智，四智圆明，就是具足十个名号的佛世尊。众生成佛以后，都具有十个名号，所有的天龙鬼神，一切大众都来敬仰，都来归敬天人师和三界至尊。</p><p>下面是第七个譬喻，是贫女怀贵子的譬喻。</p><p>原文：<strong>复次。善男子。譬如女人。贫贱丑陋。众人所恶。而怀贵子。当为圣王。王四天下。此人不知。经历时节。常作下劣。生贱子想。</strong></p><p>释：佛说：复次，善男子，譬如有个女人贫贱又丑陋，常被众人所嫌恶，可是她却怀着高贵的子嗣，这个胎中之子，将来要成为转轮圣王，统治四天下。这个女人不知道自己所经历的事情真相和时节因缘是什么，心里常常想自己有可能会生出一个下贱孩子。</p><p>一个女人本来长得很丑陋，又贫穷下贱，众人看见她都很厌恶讨厌，没有人喜欢她，她心里很自卑。虽然她是这样子，却怀着一个贵子，种性高贵的孩子。孩子的父亲是高贵种性的上等人家，那她怀的孩子就是一个贵子，孩子出生以后，将来长大就要继承父业，成为转轮圣王。</p><p>所谓的转轮圣王，分为四种，有金轮王、银轮王、铜轮王、铁轮王。金轮王统治四大洲，四大洲包括娑婆世界的地球南赡部洲，东边东胜神洲，西边西牛贺洲，北边北俱芦洲，这是四大洲。我们地球属于南赡部洲，金轮王统治四大洲，银轮王统治三大洲，铜轮王统治两大洲，铁轮王统治一大洲，总共就有这四种转轮圣王。这个贫贱女人怀的贵子，将来要统治四天下，但是这个女人自己不知道，她常常有一种想法，以为自己将来要生一个贫贱的、低级下贱的孩子，为什么呢？因为她认为自己就是低级下贱的，孩子也不能高贵。她不知道这个孩子的父亲是高贵种性，孩子将来要继承父亲的事业，成为统治四天下的金转轮王。</p><p>原文：<strong>如是。善男子。如来观察。一切众生。轮转生死。受诸苦毒。其身皆有。如来宝藏。如彼女人。而不觉知。是故如来。普为说法。言善男子。莫自轻鄙。汝等自身。皆有佛性。若勤精进。灭众过恶。则受菩萨。及世尊号。化导济度。无量众生。</strong></p><p>释：就像这个丑女怀贵子的譬喻一样，善男子，如来观察一切众生，轮转生死，受诸多痛苦的折磨，不知道自己身中都有如来宝藏，能变现三界世间一切万法，统领三界世间。众生犹如那个女人一般不知不觉，是故如来普遍为众生说法，告诉那些自认低贱的众生说：善男子，你们不要自己轻鄙自己，不要自轻自贱，汝等自身当中皆有成佛之性，都能成佛。你们如果能勤苦精进，精勤的修学，除灭众多生死过恶，灭掉所有的烦恼过患，就能得到菩萨及世尊的名号，圆满就成佛，然后化导济度无量众生，全部都出离生死苦海，究竟圆满，成就佛道。</p><p>众生由于无明，不知道自己身中有如来藏，对自己生下劣想，因此造作恶业，轮转六道生死轮回，受诸苦毒。就像那个怀着贵子的女人一样，自己都不觉知，无始劫以来都一直不觉知，叫作无始无明。打破和断尽无始无明，成就佛果，之后化导利乐无穷众生，这比金轮王还要尊贵无量倍。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如贫女人　色貌甚庸陋  而怀贵相子　当为转轮王</strong></p><p><strong>七宝备众德　王有四天下  而彼不能知　常作下劣想</strong></p><p><strong>我观诸众生　婴苦亦如是  身怀如来藏　而不自觉知</strong></p><p><strong>是故告菩萨　慎勿自轻鄙  汝身如来藏　常有济世明</strong></p><p><strong>若勤修精进　不久坐道场  成最正觉道　度脱无量众</strong></p><p>释：这时世尊以偈颂作总结：</p><p><strong>譬如贫女人。色貌甚庸陋。而怀贵相子。当为转轮王。</strong>譬如一个贫贱的女人，外貌长相非常难看丑陋，可是却怀着贵族种姓的孩子，这个孩子出生长大以后，就能作转轮圣王。</p><p><strong>七宝备众德。王有四天下。而彼不能知。常作下劣想。</strong>转轮王都有七宝：轮宝、象宝、马宝、珠宝、玉女宝、主藏宝、典兵宝这七种宝，金转轮王具备人类所有的德能，世间各种技艺超群，能够统治四天下。而这个贫贱的女人却不知道，自己常常有下劣人的想法，以为是要生一个低贱的孩子。</p><p>我观诸众生。婴苦亦如是。身怀如来藏。而不自觉知。佛看到所有的众生，所受的痛苦，也都是这样。不知道自己身中有如来宝藏，而在生死中长劫流转，受无量无边之多的苦难。众生就是这样身中一直怀着如来藏，却从来不自觉知。可见众生的无明有多么的重，轮回当中所集聚的烦恼有多么的重，苦痛该有多么的深。</p><p><strong>是故告菩萨。慎勿自轻鄙。汝身如来藏。常有济世明。</strong>所以佛告诉诸菩萨说，你们千万不要自己轻视自己，自己鄙视自己，你们身中有如来宝藏，常放光明，照济世间，因此你们将来都要成佛，成为三界尊，十号具足，分身无量世界，广度无量众生。</p><p>如来藏是不是有济世明灯呢？救度世间，济度世间，十八界世间法是不是都是如来藏给济度出来的呢？全都是如来藏给化现出来的，三界世间法都是如来藏的功德，万法的出现都是祂的功德，将来还会化现出无数的菩萨身和佛身，以及无量无边的佛国土，摄受无量无边的众生得解脱。明，就是智慧、大智慧，变现三界世间一切法的大智慧；如来藏是摩尼宝珠，说变现什么就能变现什么出来，一切法都是祂所变现的。</p><p><strong>若勤修精进。不久坐道场。成最正觉道。度脱无量众。</strong>你们这些菩萨如果能精勤地修学佛法，用不了多长时间，就会坐在成佛的道场上，示现成最正确的觉悟之道，最后成为最究竟圆满的正等正觉。成为正觉以后，度脱无量无边的众生，出离生死苦海。让所有众生都共同的成就佛道，圆满一切种智。</p><p>下面是佛讲的第八个譬喻，是铸造师铸造真金像的譬喻。</p><p>原文：<strong>复次。善男子。譬如铸师。铸真金像。既铸成已。倒置于地。外虽焦黑。内像不变。开模出像。金色晃曜。　</strong> </p><p>释：佛说：复次善男子，譬如铸造师铸造真金像，等到把金像铸成以后，从模子中倒出金像放在地上，金像外边的模子虽然是焦黑的，里面的金像却不变色，仍然是金色的，因此把模子打开，倒出金像时，金像金光灿烂，耀人眼目。</p><p>佛喻如铸造师，如来藏好比金像，五阴烦恼身犹如模子。一个搞冶炼铸像的人，用一个模具铸造一座真金像，把真金溶化以后，倒注在模具之中，注入以后，用大火烧陶冶炼，这叫铸造。冷却以后出模，打开模具，取出真金像，这是全部铸造的过程。冶炼的师傅铸成了以后，把模具倒置着放在地上，外边都是焦黑色的，因为用大火烧陶冶炼过。焦黑的是模具，但是里面的真金像，却是金色的，不管如何冶炼，外边的模具是多么焦黑，当把模具打开以后，里面的真金都是金色的，放着金色光芒。</p><p>原文：<strong>如是。善男子。如来观察。一切众生。佛藏在身。众相具足。如是观已。广为显说。彼诸众生。得息清凉。以金刚慧。捶破烦恼。开净佛身。如出金像。</strong></p><p>释：与铸真金像的譬喻一样，善男子，如来观察一切众生，佛藏在众生的五阴身中，具足一切相，一切相都是如来藏显现出来的，其实就是如来藏相。如来如是观察以后，广为众生宣说，那些众生听后，烦恼之心就止息下来，得到清凉了。然后再用闻法所获得的金刚慧打破烦恼，开显出清净的佛身，犹如模具中的金像一样。</p><p>如来藏犹如真金像，五阴身就如铸造金像的模具，模具是焦黑的，五阴身具足贪嗔痴烦恼，也是染污的。众生的五阴虽然是烦恼身，但是里面却有如来宝藏，就像是真金像一样放光动地，金光闪闪，价值无量。佛观察一切众生，如来藏在身中，众相具足，要什么种子有什么种子，所有法都能变现出来。虽然祂一个相也没有，但是祂却能变出一切相，一切相的种子都在如来藏里存藏着。</p><p>如来如是观察以后，为广大众生宣说甚深如来藏法，告诉众生，人人身中都有如来智慧德相，都有如来宝藏，都有摩尼宝珠，能变现三界世间所有的一切法，这个摩尼宝珠，珍贵无比。为众生宣说以后，众生先止息烦恼，心得清凉，证得如来藏以后就灭除了烦恼，从此不再向外追求，没有了热恼。什么是热恼？贪嗔痴烦恼，众恶聚集一身，像火焰烧身一样的烦恼，就是热恼。心有热恼，向外贪求，就不清凉，烦恼熄灭以后，不再向外求，心止息下来了，就是清凉、寂净。</p><p>然后众生以金刚慧破除烦恼，开净佛身，如出金像。什么叫金刚慧？证得了金刚不坏心，获得了大智慧。以这种般若大智慧，断除贪嗔痴烦恼和无明恶见，把无明烦恼都剥落，显露出如来藏法身，叫开净佛身，就等于把如来藏这个金像显现出来了，圆满地显现就是果地佛。</p><p>原文：<strong>尔时世尊以偈颂曰。</strong></p><p><strong>譬如大冶铸　无量真金像  愚者自外观　但见焦黑土</strong></p><p><strong>铸师量已冷　开模令质现  众秽既已除　相好画然显</strong></p><p><strong>我以佛眼观　众生类如是  烦恼淤泥中　皆有如来性</strong></p><p><strong>授以金刚慧　捶破烦恼模  开发如来藏　如真金显现</strong></p><p><strong>如我所观察　示语诸菩萨  汝等善受持　转化诸群生</strong></p><p>释：这时世尊以偈颂作总结说：</p><p><strong>譬如大冶铸。无量真金像。愚者自外观。但见焦黑土。</strong>譬如一个很大的冶炼铸像炉里，能铸造出无量无边之多的真金像，愚痴的人只从外表观看铸像的模具，只能看见熏染得像黑焦土一样的外观，不知道里边是真金像。冶就是冶炼，铸是铸像、陶铸，一个真金像代表一个如来藏。</p><p>铸师量已冷。开模令质现。众秽既已除。相好画然显。但是铸师知道里面东西的宝贵，估量模具冷却下来以后，打开模具，里面真正的金像就显现出来了。把焦黑的外模具除去，真金像的相好就俨然出现在眼前。比喻众生只要剥开烦恼的乌云，就能证得清净的如来藏。看见如来藏是什么样的呢？自性清净，无一丝染污，金光闪闪，放光动地，照耀显现一切法，本体却如如不动。</p><p><strong>我以佛眼观。众生类如是。烦恼淤泥中。皆有如来性。</strong>我以佛眼来观察，众生也与此中的譬喻一样，在烦恼的淤泥中的都有都有如来的智慧德性，都有佛性，金光闪闪，照亮一切，化导一切。</p><p><strong>授以金刚慧。搥破烦恼模。开发如来藏。如真金显现。</strong>佛世尊授与众生的金刚宝慧，让众生证得了如金刚不坏的如来藏，就像真金一样显现着，众生就有了金刚慧。这个智慧是世尊传导出来的，众生学了之后，就开启了金刚慧，有了这个金刚慧，就能破除烦恼的铸模，显露佛性。</p><p>为什么说有智慧就能破除烦恼呢？烦恼主要就是以我为主的贪嗔痴烦恼和习气，证得了如来藏，心就有了智慧，心地明了五阴根本无我，一切法都无我，于是就断除了我的烦恼和法的烦恼。证得了原来自己的五阴身就是如来藏变现出来的，五阴身是虚妄的，如来藏是真实的，不生不灭的，因此将来就能成佛。这样众生就不再不向外追求，就熄灭贪嗔痴烦恼，心得清凉。</p><p><strong>如我所观察。示语诸菩萨。汝等善受持。转化诸群生。</strong>就像我所观察的这样，众生烦恼身中都有如来宝藏，我就将这些如来藏法开示给诸位菩萨，你们这些菩萨应该好好地受持如来藏法门，然后再转转化导诸众生。就像传灯一样，一个传一个，这叫无尽灯，一直到最后所有的众生，都成就佛道。</p><p>世尊讲完以上八个譬喻，再做总结归纳，然后咐嘱大众，讲受持这个经的因缘。</p></div>"
},{
    "title": "第六章 受持读诵如来藏经的功德利益",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第六章  受持读诵如来藏经的功德利益</strong></p><p>原文：<strong>尔时世尊。告金刚慧菩萨摩诃萨。若出家若在家。善男子善女人。受持读诵。书写供养。广为人说。如来藏经。所获功德。不可计量。金刚慧，若有菩萨。为佛道故。勤行精进。修习神通。入诸三昧。</strong></p><p>释：这部经以金刚慧菩萨为首，由金刚慧菩萨来请问，世尊因启请的因缘就讲了这部《大方广如来藏经》，金刚慧菩萨是这部经的请问主，是启请人。</p><p>尔时世尊告金刚慧菩萨摩诃萨说，如果有出家在家善男子善女人等四部众，能够受持、读诵、书写、供养、广为众生宣说如来藏经，所获得的功德不可计量。金刚慧，如果有菩萨为了修行佛道，应该勤行精进、勇猛的修习如来藏法，修习四禅八定、神通道行，入到一切三昧中。</p><p>原文：<strong>欲殖德本。供养过恒河沙。现在诸佛。造过恒河沙。七宝台阁。高十由旬。纵广正等。各一由旬。设七宝床。敷以天缯。为一一佛。日日造立。过恒河沙。七宝台阁。以用奉献。一一如来。及诸菩萨。声闻大众。以如是事。普为供养。一切过恒河沙。现在诸佛。</strong></p><p>释：如果想要种植德本，广种福田，就应该供养超过恒河沙一样多的正在住世的诸佛，为诸佛建造超过恒河沙数的七宝楼台和亭榭。七宝台阁高十由旬，一由旬是四十至八十里地，高就相当于四百到八百里地；纵广正等各一由旬，长和宽都是一由旬，也就是四十至八十里地，又应该为诸佛设置七宝床，铺上天上的彩带，应该为每尊佛日日修建超过恒河沙数之多的七宝台阁，奉献给每尊如来，以及诸大菩萨和阿罗汉声闻大众，菩萨以这样的神通道力，普遍供养过于恒河沙数正在住世的诸佛世尊。</p><p>什么叫神通呢？修出四禅八定，虽然能获得超常的神异，但这是事修，是生灭法。真正的神通是如来藏所具有的神奇功德，如来藏本身非常神，能通一切法，无所不知，无所不能，其神奇功能能无中生有，真空生妙有；其通能通于一切法，变现一切法，与一切法不二。祂心体当中，却一法都无，但是却变现了所有的法。其体连芥子大小都没有，却能变现十方诸佛国土，和无量分身。菩萨修出了四禅八定以后，就有无量百千三昧，有禅定的三昧，还有定慧等持的智慧三昧，明心见性以后会获得金刚三昧，般若三昧，真如三昧，所有的三昧都包括智慧境界与禅定境界。</p><p>菩萨供养过恒河沙数现在住世的诸佛，想要植种功德本，德本就是通过修行所获得的福德、智慧、资粮、道粮、德行，以及心行转变清净，以至于将来转识成智。为了种植德本，菩萨要供养超过恒河沙那么多的、在世上正在弘法利生的十方诸佛，那要如何供养呢？造就超过恒河沙那么多的七宝台阁，用这些来供佛，还不是供养一尊佛，要供养超过恒河沙数那么多的佛，他就要造就超过恒河沙数那么多的七宝台阁。</p><p>原文：<strong>如是次第。乃至过五十恒沙。众宝台阁。以用供养。过五十恒沙。现在诸佛。及诸菩萨声闻大众。乃至无量百千万劫。</strong></p><p>释：菩萨为正在住世的每一尊佛，每天都建造超过恒河沙数那么多的七宝台阁，用来供养每一尊佛、每位菩萨和声闻大众。菩萨以这样的供养，乃至于供养现在的超过五十恒河沙数的诸佛菩萨与声闻大众，一直持续到无量百千万劫，每天都作这样的供养。这样的供奉真是不能思议了，持续地以饮食和众宝台阁来布施，这样的菩萨是不是特别精进，所得的福无量无边呢？</p><p>原文：<strong>金刚慧。不如有人。喜乐菩提。于如来藏经。受持读诵。书写供养。乃至一譬喻者。金刚慧。此善男子。于诸佛所。种诸善根。福虽无量。比善男子善女人。所得功德。百分不及一。千分不及一。乃至算数譬喻。所不能及。</strong></p><p>释：金刚慧，即使是这样的供养都不如一个人喜乐于菩提大道，修行于菩提大道，不如受持读诵《大方广如来藏经》，甚至受持、读诵、书写供养如来藏经中的一个譬喻。金刚慧，那个天天建造七宝塔的善男子，供养诸佛的福德虽然是无量的，却不及受持读诵如来藏经的善男子善女人所得到的功德，甚至连他们功德的百分之一、千分之一都达不到，即使用算数来譬喻，都所不能及，无法比较。</p><p>或者说无量财布施的福德不如读诵受持《如来藏经》福德的百分之一、千分之一，而且远远无法比较。真是不可思议，其功德差别根本算不出来。那说明众生学习修行如来藏法，这个功德福德该有多么广大，简直是无量无边的广大！</p><p>原文：<strong>尔时世尊重说偈曰。</strong></p><p><strong>若人求菩提　闻持此经者  书写而供养　乃至于一偈</strong></p><p><strong>如来微妙藏　须臾发随喜  当听此正教　功德无有量</strong></p><p><strong>若人求菩提　住大神通力  欲供十方佛　菩萨声闻众</strong></p><p><strong>其数过恒沙　亿载不思议  为一一诸佛　造立妙宝台</strong></p><p>释：这时候世尊又以偈颂作总结说：</p><p><strong>若人求菩提。闻持此经者。书写而供养。</strong>乃至于一偈。如果有人想要求证菩提，修行菩提大道，求于如来藏法，想要明心见性，成就佛道，听闻受持这部如来藏经，书写如来藏经，能以种种方式供养如来藏经，乃至于受持读诵如来藏经当中的一个偈子。</p><p><strong>如来微妙藏。须臾发随喜。当听此正教。功德无有量。</strong>他于读诵受持书写如来微妙藏的时候，如果能在一刹那间生起随喜心、赞叹心，说这部经太好了，这一声赞叹，将来就能够成佛。这样的人都应该来听闻如来的正法教，听闻如来所说的如来藏经，所能获得的功德有无量无边。</p><p><strong>若人求菩提。住大神通力。欲供十方佛。菩萨声闻众。</strong><strong>其数过恒沙。亿载不思议。为一一诸佛。造立妙宝台。</strong>如果有人想要求证无上的菩提，本身又有大神通力，希望能供养十方诸佛，供养十方菩萨和声闻大众。想要供养的这些佛、菩萨和声闻大众的数量，超过了恒河沙数那么多，供养的时间超过了一亿年，这样的供养确实是不可思议了，又特别为一一诸佛，建造了微妙的七宝台阁。</p><p>原文：<strong>台高十由旬　纵广四十里  中施七宝座　严饰备众妙</strong></p><p><strong>敷以天缯褥　随座各殊异  无量过恒沙　献佛及大众</strong></p><p><strong>悉以此奉献　日夜不休息  满百千万劫　所获福如是</strong></p><p><strong>慧者闻此经　能持一譬喻  而为人解说　其福过于彼</strong></p><p><strong>乃至于算数　譬喻所不及  众生之所依　速成无上道</strong></p><p><strong>菩萨谛思惟　甚深如来藏  知众生悉有　疾成无上道</strong></p><p>释：<strong>台高十由旬。纵广四十。中施七宝座。严饰备众妙。</strong>所造就的每个七宝台阁高十由旬，纵广四十里。四十里即是一由旬，高十由旬就是四百里地，在宝台的中间铺上了七宝的宝座、宝床，装饰得很庄严，种种微妙具足。</p><p><strong>敷以天缯褥。随座各殊异。无量过恒沙。献佛及大众。</strong>又铺上天上的缯彩和床褥，随着各个宝座，各有各的殊胜和神异之处，质地、色彩、宝物都不一样，变化多端。供养的物品与宝物的数量无量，超过了恒河沙数，然后全部都献给诸佛和菩萨以及声闻大众。</p><p><strong>悉以此奉献。日夜不休息。满百千万劫。所获福如是。</strong>每一天日夜都不休息地在供养诸佛和菩萨大众，满百千万劫，所获得的福德也同样是超过了恒河沙数。单是一个小劫，等于人间的1680万年，中劫再乘以20，大劫再乘以80，这是一劫的时间，这么长时间每天都是如此供养，这个人所获得的福德能有多少？根本算不出来，这叫作不可思议。</p><p><strong>慧者闻此经。能持一譬。而为人解说。其福过于彼。</strong>聪明有智慧的人听到这部如来藏经，就算能够受持一个譬喻，而为人解说，所得的福德远远超过百千万亿劫供养诸佛菩萨和声闻人的福德。乃至于算数，譬喻所不及，众生之所依，速成无上道。一个譬喻，比如说蜂蜜的譬喻，真金像的譬喻，摩尼宝的譬喻等等，能受持其中一个譬喻，并且能为他人解说，这个福德已经超过了供养诸佛七宝台阁的福德。超过的数量，是连算数都算不出来的无数倍。这个人是众生之所依，他能成为菩萨，能尽快地成就无上道，圆满成佛，广度无量众生。</p><p><strong>菩萨谛思惟。甚深如来藏。知众生悉有。疾成无上道。</strong>修学的菩萨们仔细地思惟之后，知道甚深的如来藏，每个众生都有，众生自己证得了以后，就能迅速地成就无上的佛道。因为能够知得如来藏，才能够证得如来藏，最后就能依如来藏而成佛。所以学习如来藏法，读诵受持如来藏经，是非常殊胜无比的。</p><p>最后这一段是世尊告诉菩萨们，自己在过去世的时候，久远劫前，开始修如来藏经的那些事迹，告诉菩萨们自己修学如来藏经的经历。</p></div>"
},{
    "title": "第七章 闻如来藏经的诸菩萨皆成佛",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第七章  闻如来藏经的诸菩萨皆成佛</strong></p><p>原文：<strong>尔时世尊。复告金刚慧菩萨言。过去久远。无量无边。不可思议。阿僧祇劫。复过是数。尔时有佛。号常放光明王如来。应供等正觉。明行足。善逝世间解。无上士。调御丈夫。天人师。佛世尊。</strong></p><p>释：这时，世尊又告诉金刚慧菩萨说，过去久远无量无边，不可思议阿僧祇劫，阿僧祇劫就是非常非常多的无量多的劫数，又超过阿僧祇劫的数量，一个再一个阿僧祇劫的时候，尔时有佛号常放光明王如来、应供、等正觉、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊，每尊佛成佛时，都具足这十个名号。</p><p>原文：<strong>金刚慧。何故名曰。常放光明王。彼佛本行菩萨道时。降神母胎。常放光明。彻照十方。千佛世界。微尘等刹。</strong></p><p>释：金刚慧，为什么那尊佛的名字叫常放光明王如来呢？那尊佛在祂当菩萨行菩萨道的时候，入到母胎当中受胎，在胎中常放光明，其光明能够彻照十方千佛世界微尘等刹土。十方世界的千佛世界，有像微尘一样多的佛刹，这么多的佛国土实在是算不出来，那就不用算了，最后身菩萨的神力有多大，不可言喻。</p><p>最后身菩萨要成佛的时候，祂的光明就能照彻无量无边的微尘数那么多的佛国土，十地以前的菩萨都做不到。菩萨在母胎中放大光明，能够彻照这么多的微尘刹的佛国土，这么多佛国土里众生究竟有多少，就不用说了。</p><p>原文：<strong>若有众生。见斯光者。一切欢喜。烦恼悉灭。色力具足。念智成就。得无碍辩。</strong></p><p>释：众生遇见这尊菩萨所放的光明，全部生欢喜心，光明照到谁身上，谁生欢喜，这是最后身菩萨的神力。众生生欢喜心以后，禅定出现，就把烦恼断除了。就像我们修行证得初禅，出现离生喜乐的境界，加上明心和断我见的功德，就能把贪嗔烦恼断除了，后边的愚痴和慢也都能逐渐断掉。烦恼悉灭以后，色力具足，身色相好庄严。</p><p>念智成就，学什么法就能记得什么法，就能理解什么法，然后就能证得什么法，获得智慧，这叫念智成就。学法以后心心念念都是所学之法，不仅能解，还能证，因此对所学法，生起决定心，永不动摇。念智成就以后，得无碍辩才，说法辩论口才相当好，无有障碍。从这里看出，这尊佛的光明德用相当的广大，这就是佛的神力，菩萨的神力，也是如来藏的神力，众生遇之，无不受益。</p><p>原文：<strong>若地狱饿鬼。畜生阎罗王。阿修罗等。见光明者。皆离恶道。生天人中。</strong></p><p>释：如果地狱、饿鬼、畜生、阎罗王、阿修罗等见到菩萨的光明者，全部都能离开恶道，生到天人中，这也是佛的神力、菩萨的神力、如来藏的神力。如来藏一放光，众生都出离了地狱三恶道。那我们身中的如来藏起作用的时候，是不是我们也能离地狱呢？还在不在地狱呢？地狱色身都是如来藏变现的，全体即真如，这样就没有地狱了，全都是如来藏。虽然在现象上是三恶道身，实质是用如来藏里的材料制造出来的，本质还是如来藏。</p><p>原文：<strong>若诸天人。见光明者。于无上道。得不退转。具五神通。若不退转者。皆得无生法忍。五十功德。旋陀罗尼。</strong></p><p>释：若诸天人见到光明者，于无上佛道就不会再退转了，成为明心证悟的不退转菩萨，具足五神通。因为天人本来就有五神通，这时五神通更殊胜了。如果是已经不退转的菩萨，再见到菩萨的光明，全部都能证得无生法忍，具有唯识种智，成为入地菩萨，具有五十功德旋陀罗尼。如果明心见性以后的菩萨，再遇到这种金色的光明，就入地成为圣人，入了如来家。</p><p>原文：<strong>金刚慧。彼光明所照国土。皆悉严净。如天琉璃。黄金为绳。以界八道。种种宝树。花果茂盛。香气芬馨。微风吹动。出微妙音。演畅三宝。菩萨功德。根力觉道。禅定解脱。众生闻者。皆得法喜。信乐坚固。永离恶道。　</strong>　</p><p>释：金刚慧，那些光明所能照耀到的佛国土，全部都庄严清净起来，犹如天上的琉璃。这些佛国土与极乐世界一样，在地上用黄金作为界绳，以界限八条通道。所有佛国土都有种种宝树，花和果都很茂盛，香气芬芳温馨，微风吹动时，这些宝树和花果树都发出微妙音，就像阿弥陀佛极乐世界的宝树出微妙音一样，演畅三宝、佛菩萨的诸多功德，演畅五根、五力、七觉分、八正道分，演畅禅定和解脱的功德，与极乐世界的宝树演畅同样的法，众生听闻到的人内心都是法喜充满，信乐佛法，内心坚固，永离恶道。</p><p>原文：<strong>金刚慧。彼十方刹。一切众生。蒙光明故。昼夜六时。合掌恭敬。金刚慧。彼菩萨处胎出生。乃至成佛。无余泥洹。常放光明。般泥洹后。舍利塔庙。亦常放光。以是因缘。诸天世人。号曰常放光明王。</strong></p><p>释：金刚慧，十方的诸佛国土中所有的众生，承蒙得到这尊菩萨所放的光明照耀，昼夜六时合掌恭敬。金刚慧，这尊菩萨在母胎当中住胎和出生，直到最后成就了佛道，成佛以后又入无住处涅槃，示现这八相成道时，身常放射光明。佛的涅槃叫无住处涅槃，这是最后身菩萨在示现成佛，从入胎到成佛和涅槃，佛身上常放光明。这尊佛涅槃以后，弟子们为佛造立了舍利塔庙，那舍利以及舍利塔庙也都常放光明。因为这个缘故，诸天世人就称这尊佛为常放光明王如来。</p><p>原文：<strong>金刚慧。常放光明王如来。应供等正觉。初成佛时。于其法中。有一菩萨。名无边光。与二十亿菩萨。以为眷属。无边光菩萨摩诃萨。于彼佛所。问如来藏经。佛为演说。在于一坐。经五十大劫。</strong></p><p>释：金刚慧，常放光明王如来、应供、等正觉初成佛时，在这尊佛的教法下，有一个菩萨弟子名为无边光菩萨，与二十亿菩萨为眷属。无边光菩萨摩诃萨在常放光明王身边听法的时候，请问这部《如来藏经》，然后常放光明王就给无边光菩萨讲了这部如来藏经。佛演说的时候，盘腿一坐就开始讲，共讲了五十大劫。像我们讲解这部佛经几个小时就讲完了，那尊常放光明如来足足讲了五十大劫，这一坐下来就没有停止过。</p><p>原文：<strong>护念一切。诸菩萨故。其音普告。十佛世界微尘等。百千佛刹。为诸菩萨。无数因缘。百千譬喻。说如来藏。大乘经典。诸菩萨等。闻说此经。受持读诵。如说修行。除四菩萨。皆已成佛。</strong></p><p>释：常放光明王佛为了护念诸菩萨众，用讲法的音声普告十方佛世界微尘数等百千佛刹里的菩萨们。被常放光明王佛所摄受的诸佛国土简直太多了，而祂的音声都能传达这些佛国土里。这说明佛的神力相当的广大。常放光明王佛为护念诸菩萨众，用无数的因缘百千个譬喻，演说如来藏大乘经典。在这部经中的譬喻仅仅有八个，在那尊菩萨那里有百千譬喻，用百千个譬喻、种种因缘来演说这部如来藏经。这一坐就坐了五十大劫，听法的菩萨也是一坐就听了这么长的时间，没有动过。诸菩萨等听闻了这部经典以后，都能像经典所教导的那样去修行，并且能够受持下来，都证得了如来藏，而且还广为众生讲说如来藏经。</p><p>除四菩萨以外，其他菩萨皆已成佛，当时听法的有无边光菩萨再加二十亿菩萨，除了四个菩萨没有成佛以外，其祂的菩萨都成佛了。这四个菩萨为什么没有成佛呢？祂们有清净大愿要实现，像文殊菩萨，是七佛之师，早应该成佛了，但是祂却不取佛位，等文殊菩萨大愿都成就之后，成佛了以后，无数个佛国土都在祂的佛国土之内，被祂所摄受，文殊菩萨的愿力相当的广大。</p><p>原文：<strong>金刚慧。汝莫异观。彼无边光菩萨。岂异人乎。即我身是。彼四菩萨。未成佛者。文殊师利。观世音。大势至。汝金刚慧是。金刚慧。如来藏经。能大饶益。若有闻者。皆成佛道。</strong></p><p>释：金刚慧，你不要有其他的想法，那个无边光菩萨不是别人，就是我，我的前世就是无边光菩萨。无边光菩萨请常放光明王佛讲的这部如来藏经，度了二十亿的菩萨，最后祂们都成佛了。只有四个菩萨没有成佛，那四个没有成佛的菩萨是文殊菩萨、观音菩萨、大势至菩萨，还有你金刚慧菩萨。</p><p>你们四位菩萨还有清净的大愿，不想尽早地取得佛的果位，还想要圆满自己清净的大愿，度无量无边的众生，最后才愿意成佛。金刚慧，如来藏经能大饶益众生，二十亿菩萨听闻此经都已经成佛了，如果再有其他人听闻，同样都能证得如来藏，证得以后将来慢慢就成佛了，所有众生都能成佛。</p><p>原文：<strong>尔时世尊重说偈曰。</strong></p><p><strong>过去无数劫　佛号光明王  常放大光明　普照无量土</strong></p><p><strong>无边光菩萨　于佛初成道  而启问此经　佛即为演说</strong></p><p><strong>其有遇最胜　而闻此经者  皆已得成佛　唯除四菩萨</strong></p><p><strong>文殊观世音　大势金刚慧  此四菩萨等　皆曾闻此法</strong></p><p>释：最后世尊又以偈颂作总结说：</p><p><strong>过去无数劫。佛号光明王。常放大光明。普照无量土。</strong></p><p>无边光菩萨。于佛初成道。而启问此经。佛即为演说。过去无数劫以前，有尊佛叫作光明王，常常大放光明，普照无量无边之多的佛国土。这尊佛的弟子中有一个叫无边光菩萨，在常放光明王佛刚刚成道时，启请佛讲这部如来藏经，常放光明王佛就为祂演说了这部如来藏经。经于五十大劫，广度无量众。</p><p><strong>其有遇最胜。而闻此经者。皆已得成佛。唯除四菩萨。</strong></p><p>文殊观世音。大势金刚慧。此四菩萨等。皆曾闻此法。如果有人能遇到最殊胜的三界尊，遇到这三界尊正在讲如来藏经，而同时听闻了这部经，那么现在都已经成佛了。只有文殊菩萨、观音菩萨、大势至菩萨、金刚慧菩萨没有成佛。这四位菩萨也都听闻了这部如来藏经。</p><p>原文：<strong>金刚慧为彼　第一神通子  时号无边光　已曾闻此经</strong></p><p><strong>我本求道时　师子幢佛所  亦曾受斯经　如闻说修行</strong></p><p><strong>我因此善根　疾得成佛道  是故诸菩萨　应持说此经</strong></p><p><strong>闻已如说行　得佛如我今  若持此经者　当礼如世尊</strong></p><p><strong>若得此经者　是名佛法主  则为世间护　诸佛之所叹</strong></p><p><strong>若有持是经　是人名法王  是为世间眼　应赞如世尊</strong></p><p>释：<strong>金刚慧为彼。第一神通子。时号无边光。已曾闻此经。</strong>金刚慧菩萨是常放光明如来的第一个获得大神通的佛子，神通广大第一。那时有个叫无边光的菩萨，也曾听闻了这部如来藏经，无边光菩萨就是我释迦牟尼佛。</p><p><strong>我本求道时。师子幢佛所。亦曾受斯经。如闻说修行。</strong>我最初求无上佛道，最初发菩提心，想成佛的时候，是在师子幢佛所，刚遇到师子幢佛的时候。我在那个时候，也曾受持、听闻、读诵这部如来藏经，并且能够如经中所说，如实的修行。</p><p><strong>我因此善根。疾得成佛道。是故诸菩萨。应持说此经。</strong>我因为受持、听闻、读诵这部如来藏经的善根福德因缘力故，快速的成就了佛道。所以诸位菩萨，应该受持、演说这部如来藏经。</p><p><strong>闻已如说行。得佛如我今。若持此经者。当礼如世尊。</strong>菩萨听闻了这部经以后，按照经中佛所要求的，如理如法的行持、修行，你们将来就能像我今天一样成佛。如果你们要受持这部如来藏经，就应该礼敬这部经，把这部经当作佛一样礼敬。为什么呢？因为这部经典能出生无量的诸佛。</p><p><strong>若得此经者。是名佛法主。则为世间护。诸佛之所叹。</strong>如果能证得了此经，就是证得了如来藏，那么这个人就是佛法的主人。祂就能够随意演说如来藏经，能够度脱所有的众生，让众生未来都能成就佛道。那么这个人就能得到世间所有人的护持，十方诸佛都来赞叹他，护持他，这个人将来也是一尊佛。</p><p><strong>若有持是经。是人名法王。是为世间眼。应赞如世尊。</strong>如果有人真的能够受持这部如来藏经，这个人就是法王。这里讲的受持不是指一般的受持，而是指证得了如来藏，而且能完完全全的依顺于、皈依于如来藏，与如来藏这个心完完全全的接近相等，圆满的皈依于如来藏，与如来藏相应。此人的心已经全部灭除了无明，彻底转识成智，那么祂就是法王。彻底转依如来藏了叫作持，是真正的持如来藏经，真正的完完全全的转依就成为法王了。</p><p>这个人就是世间眼，三界世间人的眼目，祂能够教导三界世间所有人出离生死苦海，究竟成佛。所以，应该像赞叹世尊一样，赞叹此人，归顺于祂，将来就能成为三界至尊。</p><p>原文：<strong>尔时世尊。说此经已。金刚慧。及诸菩萨。四众眷属。天人乾闼婆。阿修罗等。闻佛所说。欢喜奉行。</strong></p><p>释：这时候世尊说了这部经之后，金刚慧及诸菩萨四众眷属，出家在家的男女二众，天人、乾闼婆、阿修罗等，听闻了世尊所说的这部如来藏经，都非常欢喜，并且都能够如理如法地去实行实证，这叫欢喜奉行。</p><p>整部经大概就讲完了，这部经就是世尊引领众生深信，众生个个都有如来清净宝藏，在自己身中常住不灭，常放光明，只要众生破除无明黑暗，就能显出如来的智慧德相。然后证得此如来藏，再往上依之而修，次地增进，最后圆满成就佛道。这部经能够起信于众生，让众生深信不疑自己身中有如来智慧德相。这样信位菩萨就修行圆满了。这部经略讲到这里就结束了。希望有缘听闻或接触到«大方等如来藏经»的有情都能深信自己五阴身中有如来藏，愿意在诸佛菩萨的指导下去实证如来藏，再发大愿生生世世依之而行菩萨道，直至未来成就佛菩提道。</p></div>"
}]