[{
    "title": "简略介绍",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>心经真义简略介绍</strong></p><p>心经是般若波罗蜜多心经的简称，是唐代玄奘法师翻译的经典，仅二百六十八个字，短小精悍，在古代几乎家喻户晓人人熟知，是般若经的精华，深受广大学佛者的喜爱。鉴于这部经义理的深奥性和流传的广泛性，以及对广大学佛修行者的重要性，有必要对此经在通达般若的基础上作以全面而深入的讲解和剖析，以引领广大佛子对五蕴自身和法界真实相貌的全面了解，尽快证悟般若真实义，开发佛子的般若大智慧，心得解脱和自在。能依此经而修行的人在了解了五蕴的实相，证得五蕴皆空以后，身心越来越解脱，智慧越来越深利，就像观自在菩萨一样心无挂碍，越来越自在，有能力渡越一切生死苦厄。愿越来越多的人远离颠倒梦想，到达究竟涅槃的彼岸！</p></div>"
},{
    "title": "般若波罗蜜多心经全文",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>般若波罗蜜多心经</strong></p><p><strong>观自在菩萨。行深般若波罗蜜多时。照见五蕴皆空。度一切苦厄。舍利子。色不异空。空不异色。色即是空。空即是色。受想行识。亦复如是。舍利子。是诸法空相。不生不灭。不垢不净。不增不减。是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。以无所得故。菩提萨埵。依般若波罗蜜多故。心无挂碍。无挂碍故。无有恐怖。远离颠倒梦想。究竟涅盘。三世诸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。故知般若波罗蜜多。是大神咒。是大明咒。是无上咒。是无等等咒。能除一切苦。真实不虚。故说般若波罗蜜多咒。即说咒曰：揭谛揭谛。波罗揭谛。波罗僧揭谛。菩提萨婆诃。</strong></p></div>"
},{
    "title": "第一章 经题略释",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  经题略释</strong></p><p><strong>经题：【般若波罗蜜多心经】</strong></p><p>心经的全名叫作《般若波罗蜜多心经》，经名可以分成三个部分来解释。</p><p>第一部分，<strong>“般若”</strong>梵语Prajna的音译，中文意为大智慧。这个大智慧是指出世间的智慧，是真如自性本具的智慧，这种智慧不是修出来的，先天本具。因为这种智慧不属于三界世间的世俗智慧，不是后得的智慧，因此这种智慧不生也不灭，永远不会退失。七识心没有这种先天本具的智慧，七识心如果能获得大智慧，一定要通过修学佛法才能获得，所获得的智慧是从无到有的，因此是生灭性的。为了区别众生本有的如来智慧与七识心的世俗智慧，因此般若就不采用意译的方式，而直接音译般若。  </p><p>第二部分，<strong>“波罗蜜多”</strong>意为“到彼岸”。佛法中的“彼岸”与有生死烦恼的“此岸”是相对的，“彼岸”是真如自性——如来藏的寂灭境界，那里没有世俗法当中的见闻觉知，因此没有喧闹，没有生死、没有烦恼，寂静无为。而我们的五藴生生灭灭生死不断，在“此岸”生了死、死了生，生生死死如旋火轮，转个不停，除非证得五蕴空以后才能得解脱，才能出离生死的轮转，否则永无停息之日。  </p><p>第三部分，“<strong>心”</strong>指的是什么心？《华严经》中有一首偈子：“若人欲了知，三世一切佛，应观法界性，一切唯心造。”说的就是这个心，也就是“三界唯心”的心，是指第八识如来藏这个般若心体。心经就是围绕这个“心”而讲的，祂是我们成佛的真体，是六百卷大般若经的精华和总纲。</p><p>释迦世尊八相成道以后，说法四十九年，先讲四大部阿含经，让众生依之修学断除我见、证解脱果，有能力入无余涅槃得解脱。讲完四大部阿含以后，接着讲六百卷大般若经，六百卷大般若经全部围绕这个般若心来讲。六百卷大般若经，浓缩起来就是一部金刚经，金刚经也是讲这个成佛的真体——金刚不坏心；金刚经再浓缩起来，就是这部二百六十八个字的心经。心经是六百卷大般若经的浓缩和精华，心经的源头就是般若心体——如来藏，因此，如来藏是般若经典的总持，也是三藏十二部的总持。</p><p>世尊四十九年说法，结集成了三藏十二部，三藏十二部从哪里来的？是从世尊的本来自性清净心中流露出来的。众生是如何成佛的？成佛的究竟原理就是因为有这个如来藏心可依止，能存修证的种子，并且以如来藏作为榜样去除无明，七识心如果像如来藏一样无为和清净，就成就佛道。菩萨通过修行证悟如来藏，然后明了这个心体中所包含的所有种子的功能作用，证得祂的全部功能体性，依止于祂的清净无为性，断除全部的无明遮障，究竟转识成智，最后才能成就究竟圆满的佛。</p><p>十方世界的一切有情众生都有如来藏，有如来藏在身中运行的才叫众生，没有如来藏在其中运行的是无情物。有这个心的才是有情，有情才能成佛，无情物不能成佛。能成佛的原因就是因为有如来藏，因为祂是成佛的真体，有了这个心体存储成佛的种子，才能出生十方三世的佛宝；有了这个心体，十方三世诸佛才能说出成佛的法宝——三藏十二部；有了这个心体，才有真妄和合的五蕴僧宝，所以一切三宝皆由此出。</p><p>《华严经》说这个心就是一真法界，一真法界有多大？所有众生都在这个心中生灭不断，诸佛国土都在这个心中示现，一切法都不出这个心体之外。一个佛国土叫作一个三千大千世界，无量个三千大千世界形成一个华藏世界，无量个华藏世界形成世界海，所有的世界海形成一真法界，一真法界就是指这个心，十方世界都在这个心中。无论是十方三世诸佛，还是无量无数的有情众生，永远都不出这个心之外，就像孙悟空永远跳不出如来佛的手掌心一样，因为一切法本来是这个心所生，本来就在这个心当中生、住、异、灭。</p><p>这个如来藏心是我们修行的根本依止，离开祂无一切法，也不会有学佛修行这件事。即使能够修行，也没有结果，因为我们修行所形成的清净种子和善业种子要靠祂来收藏，后世种子才能生根发芽开花结果，通过修行成就佛果。没有这个心，众生无法成佛，也不会有六道轮转的现象存在。因此，所有学佛修行的有情众生，都必须要相信这个心的存在，并逐步了解这个心的体性，证得这个心，观察这个心，以获得越来越深广的智慧。整个佛法大厦都是以如来藏为基础建立起来的，如果否认如来藏的真实存在，或认为这个心只是佛的方便说，就等于否认全部佛法，就成为断善根、断佛种子的一阐提人。</p></div>"
},{
    "title": "第二章 观自在菩萨的真实含义",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  观自在菩萨的真实含义</strong></p><p>经文：<strong>【观自在菩萨】</strong></p><p>心经第一句是<strong>“观自在菩萨”</strong>，什么是观自在菩萨？有人说观自在菩萨是观世音菩萨的别名，观世音菩萨这个尊称是从大慈大悲心这个角度来说的，代表菩萨专门观世间众生的音声来寻声救苦，让众生离苦得乐的。从这个慈、悲、喜、舍四无量心的角度，尊称为观世音菩萨，但心经中的观自在菩萨并不是专指观世音菩萨寻声救苦的慈悲心性。</p><p>什么是菩萨？佛法上讲的菩萨从某种角度可以分为两种：一种是指没有生灭的如来藏心体，因为祂无微不至地关照着众生的五蕴身，从来不知辛苦而有刹那停息过，所以称祂为菩萨；另一种是指有生灭的五蕴身的菩萨，这样的菩萨在三界六道依靠本体如来藏与众生共同修行，用佛陀教导的佛法智慧和方便善巧，度化广大众生同时成就佛道。</p><p>总括起来说：<strong>“观自在菩萨”</strong>是指明心后，能现观本来自在的第八识如来藏自性的菩萨。下面作具体讲解。</p><p>第一节 自在与不自在</p><p>什么叫<strong>“自在”</strong>？自在的第一层意思，是指不依赖任何法、任何缘，自己就能单独存在的法。那什么法才能自己单独存在？只有自性清净心如来藏才能不依赖他缘而单独存在，因而祂是自在的，本来自己就能在的。自在的第二层意思，是指五蕴七识心能够不受业障业缘的束缚，心得无碍地做一切事业。那是心得解脱的圣人境界，普通人的五蕴都要受业缘的束缚，受六尘境界的束缚，具足贪嗔痴烦恼而不得自在。我们学佛修行，从初基的信位菩萨到成佛需经历的五十二个位阶当中，位阶越高七识心越得自在，到即将成佛时前七识全部转识成智，就与如来藏一样完全彻底自在了。</p><p>一、凡夫众生的不自在</p><p>佛法中的“自在”不同于世俗法中的“自在”，世俗法上讲自在，一般是指一个人没有外缘的束缚而自由自在，想要做什么就能做什么，想得到什么就能得到什么，随心所欲没有障碍。但在世俗法中，根本没有真正的自在，因为在很多方面都有种种约束和制约，不可能完全自在，最起码还必须每刹那都得依赖如来藏才能存在和运行。</p><p>众生的不自在，一是于生不自在。我们想出生到清净的佛国土做不到，我们想出生在天道享乐做不到，我们想出生在有权势的、有福报的父母家做不到，以至于我们想得到人身来修佛法，也没有保证。我们生作不了主，想不生也不能作主，完全被业风吹动，飘落在三界六道里轮回受苦。</p><p>二是于死不自在。舍报的时间到了，想多活一秒钟都作不了主；想提前舍报做不到，想延迟舍报也做不到；无常来了，再怎么留恋世间眷属财产万般不舍，也不得不撒手人寰。</p><p>三是于福不自在。我们在世间追求物质生活的享受，但不劳作，就没有衣服饮食；不修福，就没有任何物质的享用。只有遵循因果如法而求，才能保证饮食、衣服、卧具等资财受用不缺。</p><p>四是于身不自在。世间有很多有财有势的人，在一般人看来，他们高高在上，应该是自在快乐的。但实际上，他们比一般人活得要辛苦，因为权势和财富是无常的，没有的时候拼命追逐，拥有的时候又要想方设法保住，时刻担心会被他人夺去，，明争暗斗争权夺势；即使是最有权势的国王，也不能随心所欲而不被拘束。普通人更是不自在，在团体有规章制度和国家法律的约束，在家有家庭约束，出门还有交通管制，如果犯了罪行，就被关押起来失去人身自由。</p><p>五是于三恶道不自在。畜生大都为了饮食和繁衍后代终身奔波忙碌，或相互争斗厮杀，或被人类奴役、杀害为食；饿鬼道众生饮食衣服卧具严重缺乏，终日困苦不堪；地狱众生纯苦无乐，唯一的希望就是快点死掉免受痛苦，但只要罪业未消，受报就不会停止。三恶道众生想解脱痛苦，超出三恶道，可是受业报所拘，不能出离三恶道，除非苦报受尽；三善道众生喜乐于善道和天界的生活，可是临终受业报所拘，也免不了去三恶道受苦。所以六道众生于三恶道是不自在的，不能自己作主作抉择。</p><p>六是于天不自在。天道是六道众生最渴求之处，最觉快乐之处，但即便尊贵如忉利天主释提桓因他也不自在。天人的天福尽了或天寿尽了，仍然要轮回，也许就会随着业力流落到三恶道中受苦，这是天人们最不情愿的，他们都想要脱离六道轮回，或者想一直在天界享乐，但却不能作主，即使知道自己即将生到三恶道，也仍然留不住天命。释提桓因如果不是菩萨化现的，他就是凡夫身，还没有人间的阿罗汉自在，没有菩萨自在，与佛比就更不自在了。因此，只要不证解脱，无论做人、做天人都不自在。</p><p>二、自性清净心的根本自在</p><p>为什么说我们的自性清净心如来藏是本来就自在永远自在的？因为祂不用出生，永远也不会灭去，自身能不依任何法而存在。祂没有六根，不对六尘，没有六识的了别性，不分别六尘万法，因此就不会对六尘境界生起任何的烦恼心行；祂没有贪嗔痴烦恼，不造作恶业，也不造作善业，因此就不随业行而生死流转。祂没有眼根，不对应色尘，不了别色尘，就不被色所迷、所转、所缚，于色自在；祂没有耳根，不对声尘，无论是赞祂还是辱骂祂，祂都听不见，因此祂不在声尘中起各种烦恼，于声是自在的；对香尘、味尘、触尘亦复如是。因此，如来藏在六尘境界中，永远是如如不动，永远是自在的。</p><p>众生的七识心对六尘必起见闻觉知，在六尘中是不自在的，眼见色被色所迷，耳听声被声所转，鼻嗅香、舌尝味、身觉触全都被缚。七识心离不开六尘境界，见色住色，听声住声，嗅香住香，尝味住味，觉触住触，知法住法；而如来藏对六尘不起任何见闻觉知，不沾、不染、不粘、不缚于六尘法，所以祂在六尘中是自在的。</p><p>一切法都无自性，不自在，不可能离开如来藏单独存在；而如来藏具有真实性、如如性、不依他性，不用他生，永远不灭，因此是自在的。五蕴我不可能离开六尘而独存，只要一根不具，就是残疾之人，就要少分别一尘，内心就要痛苦一分；当六根再也不能触六尘时，五蕴必然舍报而成为死尸。所以众生如果不依如来藏而求解脱，永远都要被五蕴所束缚，在三界六道里不能出离生死苦。</p><p>如来藏因为不对六尘起见闻觉知，不分别六尘，就没有苦受和乐受，六识心受苦乐的时候，祂不受苦乐，因此是自在的。然而如来藏既然是识，就有识别了别的功能作用，实际上祂也有受有想，这受与想与前七识的受和想有很大的差别，未悟的学人很容易误解，容易混淆不清。即使是有般若总相智、别相智的菩萨，也只能遵从圣教而从理上推断，真正能现观的，是具有道种智的地上菩萨。菩萨悟后修学百法明门、千法明门、万法明门，学唯识经典，就能逐步体验如来藏更深、更细的体性，就会发现，祂与我们觉知心的体性完完全全不一样，这是唯证乃知的事情。</p><p>三、贤圣人的解脱自在</p><p>凡夫众生可以通过大小乘法的修行，而使五蕴身心逐渐趋向自在，甚至达到完全的自在。声闻、缘觉、菩萨和佛的五蕴是自在的，但自在的层次不同，差别也很大。</p><p>首先讲声闻人的自在性，声闻人断我见证了初果，与凡夫比，心能自在一些。他知道五阴十八界是虚妄的，对六尘的贪着性就会减轻，渐渐修成了二果人，在六尘境界里就自在了一分。接下来证得了三果至四果阿罗汉，对三界的贪爱都灭了，完全不被三界世俗法所系缚，心得解脱，内心更是自在。阿罗汉未入无余涅槃时，虽然还有五蕴身的存在，但他可以见色不着色、闻声不着声，心不粘着六尘，六尘对他的束缚非常的轻微，因此他在六尘里是相对自在的。有神通的阿罗汉就更自在了，修出天眼通，天上的境界、地狱的境界、其他世界众生的境界，他都能看得到，俱解脱的阿罗汉不仅有天眼通，还有天耳通、他心通、宿命通、神足通、漏尽通，有这六神通，无事不知，无事不晓，上天入地，无所不能，五蕴身心非常自在。他对于生死，相对凡夫来说也是很自在的，阿罗汉命终想把意根灭掉就能灭掉，想灭掉五蕴就能灭掉五蕴，想长寿就能长寿，想涅槃就能涅槃，可以永远不在三界世间里生死轮回。</p><p>缘觉圣人（出生在无佛之世的为独觉）通过观行、思惟十二因缘法，而断我见、我执和三界贪爱，最终能出离三界生死，入无余涅槃。因此，对于六尘万法，对于五蕴十八界法，缘觉圣人是自在的，对于生死也是相对自在的。缘觉圣人与声闻圣人相比，虽然智慧要深广一些，但与菩萨相比，其心还是不够自在，还是惧怕三界生死系缚。无论是缘觉圣人还是声闻圣人都有一个共同的特点，就是不能证得本来自在的自性清净心——如来藏，需要在未来因缘具足时，回心修学大乘，再来明心，证得本心如来藏，成为大乘菩萨，才能更自在一些。</p><p>菩萨的心要比声闻和缘觉自在很多了，因为证得了万法都是如来藏所幻化出来的，并不是真实存在的，所以对于万法无所畏惧。心经所讲的就是观自在菩萨的智慧境界，甚深又甚深。这样的菩萨早已经明悟了真心，定与慧都非常深细，能够任心自在地观察思惟甚深的佛法义理，能够随时随地现观自己的真心是如何运作的，如何与五蕴七识和合而产生万法，也能够观察出其他六道众生如来藏的功能体性。</p><p>菩萨明心后，发现自已和所有众生都有真如心体在时时运作着，这个心是本来就存在的，不依赖任何外缘就能单独存在。菩萨认可依止这个真心理体以后，妄心七识能够渐渐的不着相、不执著、不被万法所染，内心也就有几分自在了。证悟的菩萨摩诃萨修出四禅八定以后，十方諸佛国土能够随意来去，能随缘变现不同种类色身以利益众生，这种自在是远非声闻缘觉所能比的。</p><p>菩萨登地以后修四禅八定，三地满心修学神通，他的神通境界比阿罗汉殊胜极多，用意念就可以变出成千上万个意生身。修到八地菩萨，可以随意变现一个三千大千世界，还可以有无量分身；八地菩萨如果想把地球移到别的星系，马上就可以移过去，众生都无法感知到；菩萨看到众生生活艰苦，悲心运化，就能变化出无量多的饮食衣具来资助贫穷的众生。菩萨如果想以佛身度众，就可以变出佛的色身，示现八相成道以度化众生。众生以什么身得度，菩萨就可以随缘现什么身，这个自在的层次不知又高了多少，声闻缘觉们无法与之相比。修到等觉、妙觉菩萨就更自在了，最自在的自然是十方世界的诸佛，对佛来说，无有一法不自在。</p><p>作为末法时代的修行者，要以菩萨为榜样，时常观察我们的不自在处，要生起出离心，生起厌离生死烦恼的心。有了这个厌离心，才能发起修道心，修行才能成就。已经有初步成就的菩萨，要不断检视自己的自在处与不自在处，要有智慧了知自己与佛地境界的巨大差距；要以佛究竟解脱的大自在为终极目标，勇猛精进的修行；要悲悯众生轮回生死受种种苦不得自在，发大愿尽未来际救济众生同成佛道。</p><p>第二节 如何观行得大智慧</p><p>下面再讲讲“观”的含义。什么叫作观？观就是观行、观察，也包括思考、思惟的意思。观自在菩萨，是能观察众生的如来藏自在不自在、觉知心自在不自在的菩萨，菩萨从开悟明心的第七住位开始，就能做这种观行。我们学佛修行首先经过十信位，十信位修行圆满再进入十住位、十行位、十回向位，然后进入十地位，最后是等觉位、妙觉位共五十二个阶位。明心见性以后，菩萨就开始观察、思惟如来藏的各种体性，入地以后，菩萨对佛法越来越通达，就能进行更深入的观行，越往后观行的内容就越深细，智慧就越来越深广。</p><p>一、观行的种类差别</p><p>观行大致分为三种：小乘的观行、中乘的观行和大乘的观行，成佛以后就不用再观行了，成佛之前的各个修行阶段都要观行，因此观行是修行过程中非常重要的修行方式，不可或缺，是获得智慧的必由之路。</p><p>小乘的观行对象和范围是五蕴十八界，通过观行五蕴十八界，证知了这个假我的虚妄性，就能断我见、我执，证声闻初果至四果阿罗汉，最后心得解脱。中乘的观行对象和范围是十二因缘法，通过对十二因缘每个环节的思惟、推理、论证，最后证得辟支佛果，从而断除一念无明得解脱。</p><p>大乘菩萨悟道之前，要在外门广修菩萨六度，修完菩萨六度，再静虑观行——参禅，依次过禅宗初关、二关和三关。菩萨在明心证悟本来自在的如来藏之后，要观行如来藏运作的总体相貌和具体运作的细相，获得总相智和别相智，观行证得如幻观成为十住位菩萨后，再观行证得阳焰观和如梦观，成为十行位、十回向位菩萨，然后具足一分道种智就可以进入如来家，成为初地菩萨。进入初地再观行如来藏的种子功能，证得如镜像观；初地满心进入二地，然后地地观行越来越深细，直到种智具足，圆满成佛，就不用再观行了。   </p><p>二、菩萨如何修观行</p><p>观行也叫禅修或思惟修，就是在心止于一境的前提下，在定中深细地观察思惟佛法的真实义、究竟义，从而开启智慧，定越深获得的智慧就越深。菩萨若不修观行，学佛就成了纯粹的佛学理论研究，永远不能证果，不能破除无明而得到解脱的功德受用，也就不能出离生死轮回，到达涅槃的彼岸。所以修持观行的功夫很重要，止观双运就能破除一切无明，否则就无法“行甚深般若波罗蜜多”，只有浅层次的情思义解和乾慧狂慧，没有真正的解脱智慧。</p><p>初学菩萨修观行应由浅入深，首先要修外门的观行，观行思惟世俗谛五蕴十八界的虚妄而断我见；接着熏习般若正知见，先从理论上明白如来藏的体性，明白五蕴活动不离如来藏的运行，明白有如来藏潜转身中作諸事业；然后在善知识的指导下，进入看话头、参话头等禅修观行，也就是参禅阶段，等到时节因缘都具足时，就能发起般若实相智慧，证得实相心如来藏，从而获得般若总相智，从此以后就可以进入内门修观行了。</p><p>所谓内门观行，是指菩萨开悟明心，真正进入佛法殿堂以后所要修的观行，主要是观行如来藏运行的细相和含藏的种子功能，观行如来藏是如何与前七识和合运作，而变现六尘万法和成就世间法和出世间法的。菩萨的观行越深越细，智慧就越来越猛利，直至一切种智全部成就。</p><p>菩萨修观行要以定力为助缘，初学菩萨要想断我见，要想参禅明心，要想思惟甚深的法义，意识心不能散乱到处攀缘，不能过多地分散精力去关注不相干的俗世事务，心里不能有过多的挂碍。一定要具足相应的定力——未到地定至初禅定，这样意识心定在一处，止于一处，专注力强，观行的力度才深透，才能出生大智慧。要断我见乃至明心证悟，至少要有欲界未到地定的定力；想要入地修学道种智，至少要有初禅的定力。在定中观行的时候，要注意定慧等持，不能过于专注在定境上，否则就容易进入深定，无法再思惟参究了。</p></div>"
},{
    "title": "第三章 五蕴空的具体内涵",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  五蕴空的具体内涵</strong></p><p>经文：<strong>【观自在菩萨。行深般若波罗蜜多时。照见五蕴皆空。度一切苦厄。】</strong></p><p>能够观行甚深般若波罗蜜多的菩萨，至少是明心见性的菩萨，这样的菩萨具有甚深观行智慧，是具备般若总相智、别相智和唯识种智的菩萨。菩萨修到初地以后，通达大小乘法，其观行智慧就更深细了，八地以后菩萨的观行智慧，我们根本无法想象。</p><p>经中说菩萨照见五蕴皆空以后，就能度过一切苦厄，既然能度过一切苦厄了，生命中再也不会有苦受了，彻底的解脱和自在了，这就不是一般明心见性的菩萨所能做得到的。真正能度过生死苦厄的菩萨，必须要断除烦恼和习气、断尽人我执，法我执也要断除，这是八地以上菩萨甚至是诸佛的解脱境界。七地以下的菩萨还没有彻底度过苦厄，因为有分段生死和业障的负累，心还没有完全解脱，还会有苦受。因此，这里讲的观自在菩萨，其观行是极其深细的，所修证的果位已经超越了七地菩萨，只有这样的菩萨，才能在观行照见五蕴皆空时，度过苦厄，得大解脱，得大自在。</p><p>所谓“行深般若波罗蜜多”，是指菩萨在观行甚深的般若义理，观行如来藏的所有体性和种子功能。这里说的“般若”，并不是指意识明心以后所出生的般若智慧，而是指本具解脱智慧的如来藏，“波罗蜜多”是到彼岸的意思，这个真体如来藏本来就在没有生死的彼岸，要观行祂具足什么样的大智慧，如何的解脱和自在，因为什么没有生死束缚。菩萨通过参禅证得如来藏，找到如来藏并能现观祂的存在和运作的时候，就明心开悟，之后能观察和证得如来藏的真实性和如如性，观察和证得自已及众生的五蕴十八界如何由祂变现出生，如何由祂配合运作的，证知自己以及众生的五蕴十八界并没有真实不灭的体性。</p><p>地后菩萨能现量观察如来藏里种子的功能作用，真切了知一切法都是如来藏运作的结果，全体即如来藏，这种现量境界的观行就是深观，才是“行深般若波罗蜜多”。深观以后就能照见五蕴如梦幻泡影、如阳炎、如镜像、如水月，就能证知五蕴原来就是如来藏的妙真如性，全部是如来藏的功能作用，与如来藏非一非异，这就是“照见五蕴皆空”的内涵。这时菩萨就有了般若解脱的大智慧，就能断人我执和一部分法我执，不再认五蕴的功能作用为我为真实，不再执著五蕴的功能性和一切法有真实性，这样才能度过种种生死苦厄，心得大解脱。菩萨虽证五蕴皆空，却也不求灭掉五蕴之身，一定会留一点点思惑来润泽生命以自利利他。</p><p>无生死的是如来藏，有生死的是五蕴身，五蕴本空，生灭无常。如来藏就像一个辽阔无垠的大海，五蕴不过是大海泛起的一个个泡沫。众生五蕴造作的业种存在如来藏大海里，因缘成熟时，如来藏把业种输送出来，变现出下一世的五蕴十八界；这个五蕴十八界就像泡沫和波浪，在藏海中飘了若干年后又灭了，灭了以后又有一个泡沫冒出来，就这样无穷无尽地流转于如来藏海中生灭不已。</p><p>如来藏就像大海一样真实存在，无有生灭，五蕴就像是如来藏海里幻化出来的泡沫，我们不能说泡沫就是大海，但也不能说不是大海，大海和泡沫只是形相不同，本质是相同的，泡沫属于大海的一点一滴，本质也是大海水，五蕴的生生灭灭本来就是如来藏功能体性的显现。大乘法中的“五蕴皆空”并不是说五蕴是空无的，没有功能作用；也不是小乘所说的无常空或缘起性空，而是从实相法界的角度，来说五蕴无真实不灭的自体性，是空性心如来藏无量功德所显现出来的部分德用，本质无异于空性心如来藏。</p><p>菩萨在深入细致地观行般若波罗蜜多时，回过头来观照五蕴，就明白了五蕴的实质是什么。这种观行智慧好比黑夜里的探照灯，灯光一照，眼前的景物马上就明了了。菩萨的般若智慧就如这只光芒四射的灯，将我们的五蕴照得内外通透。从此，我们就明白通向究竟解脱的路径在哪个方向，往日发起的成佛大愿，现在就更坚固了。虽然我们的五蕴身暂时还不能远离生死之苦，但依止本来离苦、寂灭的实相心如来藏，终将到达“常、乐、我、净”的究竟涅槃境界。</p><p>五蕴包括色蕴、受蕴、想蕴、行蕴、识蕴，藴是藴集、集起的意思。五蕴也叫五阴，因为阴有遮盖如来藏的性质，使得众生不识真心而执妄为真。为方便学者修学观行，下面逐一进行简述。</p><p>第一节 简述色蕴</p><p>色蕴是如何形成的？色藴是如来藏依业种变现出来的，是由如来藏输送四大种子逐渐形成的，色藴全部来自于如来藏。众生在中阴身阶段，因为意根不灭，没有断掉对自我五蕴的执著，也没有断除贪欲，因此就要投胎以重新拥有一个五蕴身，于是在中阴身里看见未来世的父母和合时，就起欲心参与过去，然后意根被拘束住，和如来藏一起入住母胎，意根就这样投胎了。投胎之后形成五蕴身时，意根就把五蕴身当作我，对其百般执著贪爱，只有断除意根对五蕴的我见和我执，才能不再投胎，解除三界生死系缚，得到暂时的解脱。要想永久解脱，还要继续修学大乘如来藏，断除意根对一切法的执著，无明灭尽，就能永久究竟的解脱自在了。</p><p>意根是心法，无形无相称为“名”，受精卵是色法，意根和受精卵结合一起就有了最初的“名色”五蕴身。接下来，如来藏依业力，以母体为缘吸取地水火风四大元素，受精卵就不断生长发育。如来藏不断执持这个名色，变生出血液、肌肉、骨胳、内脏等组织器官，慢慢地胎儿的头颅、躯干和四肢就长出来了，五官也成形了，六根逐渐完备起来。</p><p>胎儿发育到四、五个月大的时候，胜义根基本具备，如来藏依六根就能变现出意识、耳识和身识，这时就具有了别的功能，能了知一部分外面的环境和子宫里的环境，了知以后，就有了觉受。有了觉受胎儿就不老实不安分了，这时会随着自己的觉受而产生各种活动，就有了胎动。由于这时胎儿有识心的分别，能够了知母亲体内和体外的一些声尘，子宫里面的冷热、挤压、软硬等触，也能少分了知，就可以对胎儿进行胎教了。</p><p>胎儿有了身识和意识的了别功能，就会有苦受和乐受，如：母亲吃凉一点的东西，他就感觉像在寒冰地狱一样难受；母亲喝一口热汤他就觉得烫得难受；吃辣的东西时也感觉不舒服；母亲弯腰时，就感觉身体受到挤压；但如果听到舒缓的音乐，就感觉到舒服和愉悦，因此胎儿能起贪爱之心。等到九个月、十个月胎儿的六根圆满具足，六识心也具足，五蕴十八界都具足了，如来藏了知这种状况，就会促使胎体动转，让胎儿出生了。</p><p>婴儿出生以后通过吃奶、吃饭，如来藏从饮食里摄取地水火风四大元素，将外部的营养元素转化为身体所需要的营养元素，继续执持婴儿的色身，随着器官不断发育，婴儿的身体一天天长大、成熟。这个婴儿的身体就是如来藏变现的，有人不信，说是母亲变的，如果说在母胎里是母亲变生的，那出了母胎怎么办呢？婴幼儿童身体一天天长大，是谁之功？除了如来藏没有任何法能产生色藴物质的色法，因为色身由四大种子组成，只有如来藏有四大种子，所以众生的色藴身根是由如来藏变生出来的，色藴来自于如来藏，本质就是如来藏。</p><p>虽然色藴是如来藏变生的，但是如来藏不在色藴里，也不在色藴外，不在色藴中间。因为如来藏是无形无色的，无形无色之法不能说有处所，只有物质的色法才有方所，才可以说住在某处。如来藏不住色蕴，也不离色蕴，不住在身体内，也不住在身体外。祂里外都不在，又里外都不离，祂从不隐藏自已，也没有隐藏的想法，可我们就是找不到祂。没有证悟的时候，确实很难理解祂的这些体性，因为祂不是世俗法，用世俗的智慧确实无法理解祂。只有般若智慧开启以后，以菩萨的慧眼、法眼才能观察祂的运作，了知祂的体性，那时才会感叹，原来如来藏如浩月当空，万丈光芒普照大地，而众生完全被无明烦恼遮障，如盲人一般视而不见。</p><p>每个众生的色藴都是自己的如来藏一点点变生出来的，是如来藏制造形成的，如来藏本有的独特的大智慧，什么时候造哪部分，造成什么样子的，祂都能知道。如来藏能了别业种，并根据业种输送不同比例的四大种子，众生的业报身就一点点的长大。如来藏能了知色身的生长情况，色身长大成熟后就要衰老，祂就会改变四大种子的组成比例，于是色身就一点点的衰老。如来藏知道什么时候脸上应该长出皱纹和斑点，知道什么时候身体功能下降、内脏器官代谢开始减退、行动变得迟缓。当众生的业障现前时，如来藏就输送出不调和的四大种子，众生就会出现各种疾病。</p><p>当色身严重衰老时，身体的各种机能接近衰竭，如来藏也知道众生什么时候应该舍寿，临终前就会发出死亡的信号让人警觉，比如身体出现臭味、高烧等等身体上的四大变化。意根了知到死亡的业缘现前，也会警觉意识，就会非常贪恋亲人，说一些依依不舍的语言，举止行为怪异；有的人临死前意识会预感到，心里就作准备，提前给自己安排后事。如来藏常常显示给我们很多信息，有时候我们的意识心能了别，有时候不能了别，有时相应了也不知道是怎么回事。比如两人前世结了很深的缘，而且是善的缘，今世见面了，彼此感觉就很亲切，相互帮助关怀备至，双方都不知道为什么。这是各自的如来藏输送出来的往世的业种，觉知心不自觉地与之相应并随业流转，众生不知道这些信号是谁给的，其实都是如来藏了知业种而输送出来的，意根离如来藏最近，首先能感知到，再传递给意识，意识有智慧也会感知到，没有智慧就会无觉无知。众生往世结的缘不一样，今世相遇在一起时感觉就不一样，有的人让你觉得很亲近，有的人则让你觉得很厌恶。菩萨要广度众生，就要每一世都与众生多结善缘，因为一旦与某个人结了恶缘，即使将来你成佛了，想度也度不动他。</p><p>这都是如来藏了别众生的业种而呈现出来的现象，而我们却不知道究竟为什么，没修出神通，过去世的事情就不知道。所以一切事情的发生，对一切人、事、物的感受，都是如来藏先知先觉给我们显示出来的，只是我们不懂。为什么不懂呢？因为无明，众生的无明遮障太重了。怎样才能不愚痴？学习如来藏法，然后证悟如来藏，悟后再起修，无明就能一点点地破除，智慧就渐渐生起了。无明断尽，智慧究竟圆满，即成佛道。</p><p>第二节 简述受蕴</p><p>什么是受蕴？受藴是各种感受的藴集。受可分为苦、乐、忧、喜、舍五种，或者分为苦、乐、舍三种。受藴的“受”，它的主体主要是指前六个识心，不包括第七识和第八识的受。众生的识心共有八个，前七个识心是眼识、耳识、鼻识、舌识、身识、意识和第七识意根——末那识，第八识就是如来藏。前七识是如来藏输送识种子变现出来的，都是虚幻的妄心，凡被如来藏变生出来的都是生灭的、虚幻的、无常的、空的、苦的、无我的。要说“受”，八个识都有，但受藴只指前六识心的受，不包括第七识和第八识的受。百法明门里讲八个识的五遍行心所法，才讲到第七识、第八识的受。</p><p>前六识的受以第六识为主，前五识虽然也有受，但比较直观和粗糙。第六识的感受比较细腻、丰富，有感情色彩和情绪化，内涵比较深细，范围比较广。佛在阿含经中说：六根触六尘，生六识，三者和合触，生受。六识心什么时候有感受呢？眼看色的时候，出生眼识和意识，眼识和意识触色尘就有感受。看到自已喜欢的、感兴趣的人、事、物就心花怒放，乐受就生出来了；看到不喜欢的、讨厌的就生起厌恶心，苦受就生出来了；看到自己不关心的东西，感觉不喜也不厌，舍受就生出来了。</p><p>见色的时候有感受，听声音的时候也有感受，耳识和意识同时感受，喜欢听这个声音，不喜欢听那个声音，这个声音听起来很不舒服，那个声音听起来很悦耳，或者是听这个声音无所谓，不感觉好坏，听与不听都可以，这就是苦、乐、舍这三种感受。鼻嗅香、舌尝味的时候，同样都有这三种感受。</p><p>身觉触的时候当然也有感受，风吹到身体上感觉有时苦、有时乐、有时不苦不乐；太阳照在身上时，就会出现这三种受，吃饭、喝水、睡觉、穿衣乃至打坐修定也不离这三种受。第六识在五识现起时，随同俱起，多数时候是和前五识一起感受，眼看色的时候，和眼识同时分别和感受；耳听声、鼻嗅香、舌尝味、身觉触都有第六识同时分别和感受，它是受蕴产生的主体识。</p><p>意识在没有前五尘的情况下，单独分别法尘时也有受，有时内心里突然想起某人某事，就会生起感慨，受觉就出现了，苦乐舍受都有。一想起昨天某个人说的话，心里就气起来了；一想起曾经中过奖、晋级升迁，心里就高兴起来了。这是意根和独影境法尘相触的时候，第六识自己单独对法尘的感受，是散乱独头意识。还有一种情况是做梦，意识在梦境里也是单独感受法尘，有喜怒哀乐的情绪，有苦乐忧喜舍的觉受，都没有前五识的参与，这是梦境独头意识单独受。所有前五识以及第六识的感受，都属于受蕴。</p><p>第三节 简述想蕴</p><p>什么是想蕴？所谓“想蕴”就是所有了知性的积聚。从字的结构上就可以看出，“想”就是心上有个相。心上有相，就是取了相，就是有了分别，所以想就是知，就是了别和执取的意思。什么叫心上有相？当我们看到色的时候，就知道：哦，是这个东西呀，这时心里分别完成，就有了相，因此了知并认取某个事物就叫想。眼看色的时候，知道这个是花，那个是人，这就是取相分别，就是想。了别以后，接下来进行思惟、分析、判断、推理、研究等，这是进一步的“想”。乃至我们经常做的计划、打算甚至梦想、妄想等，这些都是“想”。</p><p>“想”是我们识心的功能作用，只要六识现起，心就有所住，有住就有想，心中有语言文字时是想，没有语言文字时还是想，意根的想就没有语言文字，乃至于如来藏的想更没有语言文字。眼见色时有想，耳听声时有想，鼻嗅香时有想，舌尝味时有想，身觉触时有想。六识只要对六尘有受，一定会产生想。意识最初的想可能没有语言文字，当反复思惟分析时，语言文字就在心中产生了。</p><p>六识在一切法上都会有想，前五识有想，第六识有想，但以第六识的想为主，第六识的想也最为复杂。意识除了与五识一起分别一起想，也可以单独对应法尘有想，比如做梦时就是意识心单独有想，还有平时的散乱思惟、胡思乱想、定中的思惟观想，还有狂乱妄想，都是意识单独的想。前五识不能离开当前的五尘境界而有想，但第六识可以，凡不在当前五尘境界上分别思惟的想，都是意识心单独的想。想藴就是六根触六尘时，六个识的思想分别活动。</p><p>第四节 简述行蕴</p><p>什么是行蕴？什么是行？行就是事物处于运动、变化、迁移等非静止的状态，无论是色法还是心法，只要有变化都是“行”，包括时间的变化和空间、地点、方位的迁移，也包括几个识心的运行造作。现相界的一切法，没有一个是止息不动的，无论是看得见还是看不见的，无论是六尘万法，还是我们的身心，都在不停地迁流变化，这就是行蕴。</p><p>首先我们来看看山河大地，祝愿别人长寿时往往会用“寿比南山”这个词汇，因为我们祖祖辈辈都过去了，南山还在那里，似乎没有变化，其实南山也是生灭变化的，众生因为寿命不够长，无法现前观察到这个事实，就认为南山不会长存不会灭去。经常有人在山石中找到贝壳和鱼类的化石，有智慧的人就知道，这里原来是大海，南山是从大海中长出来的，而原来的大海早就消失不见了。其实南山也一直在刹那变化，亿万年以后也会消失，只是人类的寿命太短，无法感到山河大地明显的变化。再看看时间，时间在不停地流逝，从没有停止过，一分一秒一刹那，就在我们看这段话的时候，又有几秒过去了。</p><p>我们的色身就像从未停止运转的机器，即使我们什么也不做，乃至让意识入定。色身也不会有瞬间的停息，血液流动、呼吸心跳、胃肠蠕动、消化吸收、细胞新陈代谢等等，这些都在动，都在如来藏执持下生、住、异、灭着。我们天天和家人在一起，似乎感觉不到家人的变化，但如果你离家几年再回来，就会看到父母明显变老了，孩子明显的长大了。其实我们一转眼哪怕间隔不到一秒钟，你所看到色身已不是一秒钟前的那个色身了。</p><p>我们的识心也是刹那变化的，比如眼识对色尘进行了别，是如来藏将眼识种子一个一个地生出来，前一个种子生出来落谢后回到如来藏，后一个种子又在前一个种子落谢处生出，种子一直这样不停地生灭着，一弹指就有八万一千次种子生灭变化过去了，这才能保证眼识正常发挥其功能作用。我们如果对某个物体一直在看、一直在分别，识种子的运转就不会停止，这就是动，属于行蕴。其他五个识的运作亦复如是，只要有识心存在，就有行蕴。总而言之，身、口、意的一切行为造作都是行藴，都属于行藴的范畴。</p><p>第五节 简述识蕴</p><p>最后讲一下识蕴，“识”就是具有了知、分别功能的心。识蕴的范围包括眼识、耳识、鼻识、舌识、身识、意识这六个识，识蕴就是指六识功能的积聚。</p><p>六个识的功能是有差别的，比如，眼识负责分别色尘，眼根的扶尘根与外相分色尘相触，如来藏就在胜义根处生成内相分色尘，根尘相触处，如来藏产生眼识；同时意根与色尘上的法尘相触，如来藏就产生了意识，眼识和意识产生出来共同了别色尘，就知道这是什么东西了，这是眼识意识共同的分别结果。眼识与意识对色尘的了别范围是不同的，眼识了别青黄赤白、光影、明暗、云烟尘雾以及虚空等显色；意识则了别色尘境上所显现出来的法尘——法处所摄色，就是形色、表色、无表色。眼识与意识共同合作，我们就看清了色尘。同理，耳识、鼻识、舌识和身识，也是根尘相触时，由如来藏出生的，五识与意识永远都是共同和合运作的，所以意识被称为五俱意识。五识只能了别五尘的粗相，细相则由第六识来了别。</p><p>实际上六识对六尘的了别，是八个识共同配合运作的结果，八个识和合运作极其快速又非常复杂。无量数的识种子都是刹那生灭的。这个过程，比世界上功能最强大的电脑都要复杂无数倍。我们五蕴身有时好象是在做一件简单的事，但背后都是八识心王无间的配合，等到明心以后再来观行、思惟，就会发现真的非常不简单。</p><p>第六节 度一切苦厄</p><p>一、众生的苦是从哪里来的</p><p>众生为什么会有忧悲苦恼？因为有烦恼和无明，贪爱五阴身和三界世间法，因此而广造众业，导致生生世世五蕴身不断以受无尽的苦报。如果五蕴灭了，就没有人来受这个苦报了，所以说有身即有苦。无色界天人虽然没有色身，但是他有识心在，还有行苦和坏苦。在无色界的四空定里根本没有时间长短的概念，一入定几万大劫过去了，出定后就感觉好像只过了一会儿似的，若天福享尽，有可能直接下堕三恶道去受苦报。</p><p>无明烦恼是一切苦的来源，五蕴身心的存在是一切苦的受报器，四果阿罗汉虽然已断尽我见、我执，心中不再有烦恼现行，但未舍寿就有色身和识心的存在，在人间生活就有微苦、余苦要承受。当被蚊虫叮咬的时候，身体就会觉得痛痒；夏天太阳太晒了，身体会感到热；冬天冷风太冷了，身体会感到冷；生病的时候身体也会有苦受；还有一些因果业报需要了结；但心里是没有多大的苦受，因为心已经得解脱，不在意任何色身的苦受。所以阿罗汉涅槃的时节因缘一到，与此世间的缘尽了，就不愿意再接着受五蕴苦，要灭掉五蕴身心，出离世间，入无余涅槃，离苦得解脱了。</p><p>二、声闻人度苦厄</p><p>声闻人是如何度过一切苦厄的？声闻人只能度一部分苦厄，不能度一切苦厄，只能了分段生死苦，不能了变易生死苦。他们依圣教观行自已的五蕴身心，发现它是生灭无常的；无常故空，空故是苦，苦故无我；要度过苦厄，就要彻底灭掉苦厄的承载器——五蕴身心，入无余涅槃，让苦厄找不到主，从而不苦不乐，也没有舍受。</p><p>定性声闻人不证实相，只能在蕴处界观行，通过对五蕴、六入、十二处、十八界一一观行，发现没有一法是恒常不变的，都是迁流不止、生灭变异的。于是断了我见，断了三缚结，证了须陀洹果。证了初果以后，继续观行思惟，贪嗔痴烦恼越来越淡薄时，就成了二果人——斯陀含。接着降伏五盖，修出了初禅，断了贪欲心和嗔恚心，就证了三果阿那含。三果人再断掉我慢，去掉内心当中对“我”的最后无明，意根对于自我的执著性就断尽了，彻底灭掉了对三界的贪爱，就证了四果阿罗汉。阿罗汉等到寿命终了，就将意根灭掉，不再投胎，不再有后世的五蕴名色出生，只剩下第八识如来藏独自存在，这就是无余涅槃的境界。</p><p>阿罗汉没有证得本来解脱、本来无苦的自性清净心——如来藏，因此就不能行深般若波罗蜜多，来照见五蕴皆空。阿罗汉是灭掉五蕴我而离苦，没有人继续受苦，方便说已度一切苦厄了，其实还有苦种没有断除，生死苦并没有彻底了断。套用《金刚经》的话来说，所谓得度，即非得度，是名得度，因为实无有众生得度。</p><p>三、菩萨度一切苦厄</p><p>菩萨是如何度过一切苦厄的？回到经文第一句话：“观自在菩萨，行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。”从这句话来看，菩萨度一切苦厄看起来非常简单容易，实际是非常不容易的，所修的法甚深又甚深。其真实之理是什么呢？能够观自在的菩萨，至少是已明心开悟的菩萨，但仅仅是开悟的菩萨，其智慧和禅定不足以度一切苦厄。当菩萨修到断除烦恼，能了分段生死时，才能度大部分苦厄，还有一丝变易生死苦没有了尽，了尽之后，才能到达涅槃的彼岸。菩萨有了实相般若智慧，就能从实相法的角度来观行现象界的一切法，并不真实存在，生死皆如空花，证得此理，再也不惧怕生死系缚自己。菩萨了知只有自性清净心如来藏才是真实不灭的法，没有生死，不在此岸，也不在涅槃寂静的彼岸，五蕴十八界一切法都是如来藏幻化的、假有的，五蕴的所有苦受、乐受、不苦不乐受也是虚妄不实的。</p><p>菩萨证得了真心如来藏，就不会再认五蕴这个假我了，真我如来藏自性清净常住涅槃，从不与苦乐相应。菩萨内心深处舍妄归真，在理上就度一切生死苦厄了，菩萨不灭五蕴而离苦，不离世间而得度一切苦厄，因为所皈依的自性如来藏根本没有苦，由祂护持的五蕴苦也不苦。菩萨开悟后，不妨色身在世间还有苦，凭着广大的誓愿和悲心，陪着众生一起在生死苦海中，不断救拔有缘众生脱离生死苦海。</p><p>证悟的菩萨虽然从理上说，已度一切苦厄了，但是在事上还做不到，因为还有对三界贪爱的烦恼未断尽，还有无量烦恼习气存在，还有无始劫的尘沙无明没有断除，还有分段生死和变异生死存在，因此就要不断修集禅定、福德和智慧。初地以上的菩萨有能力断掉对三界世间的贪爱，可以不来三界，但因为想成就佛道利乐众生的缘故，不愿出离三界。八地菩萨断尽了烦恼习气，没有了分段生死，寿命极长，表面上看好像没有生死了，但是还有生死的业种和无明存在着没有灭尽，识心还会有动转和变化，还不是真正的无生无死。只有修到究竟佛地，所有的无明全部断尽，无垢识心中含藏的种子永远不会发生转变，前七识转识成智，如来藏就是真正的常、乐、我、净了。因此，修到佛地才能真正了生脱死，究竟的度一切苦厄。</p></div>"
},{
    "title": "第四章 “色空不二”的真实义",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第四章“色空不二”的真实义</strong></p><p>经文：<strong>【舍利子。色不异空，空不异色。色即是空。空即是色。受想行识。亦复如是。】 </strong></p><p>第一节 色蕴与如来藏非一非异</p><p>为什么说“色不异空。空不异色”？因为色藴不可能离开如来藏单独而有，不能离开如来藏独立存在和运作。它是如来藏输出的四大种所变现，依靠如来藏才能现起，依靠如来藏才能有自己的功能作用，它是如来藏的全体种子功能当中的一部分。而如来藏通过变现和运作色藴，才能显示自体的存在，显现自体的种子功能作用。空性心如来藏与色藴的关系，如同水滴与海洋、尘埃与高山、树木与森林，既非一又非异。</p><p>这个“空”字，代表空性心如来藏，如来藏为什么是空的？因为祂没有三界法当中的任何一个相，没有色相、声相、香相、味相、触相，也没有法相。祂没有六尘相，我们看不到、听不到、嗅不到、尝不到、触不到、感觉不到，祂就是这样子无形无相的存在着，这就是如来藏的空相。祂虽然无相，但也不是空无，因为祂是真实有的法，所以叫祂空性心、实相心。祂以不属于三界有的法相而存在着，祂有自己特有的行相。因此，菩萨才能以参禅方式找到祂，悟后才能观行祂。没有熏习如来藏法正知见的人，不容易相信祂；没有证悟如来藏的人，不容易理解祂。</p><p>金刚经云：凡所有相，皆是虚妄。如来藏虽然无相，看不着摸不着，却能变现出一切法相，一切法只有祂是真实的。如来藏虽然是空性的，却含藏一切法的种子，能出生一切法，除了祂，任何法都没有这个真实的功德。祂无相而空、空而有性、相空性不空，一切有相的人和事物都由无相的祂来成就。</p><p>一切色法，除了我们的五蕴色身，还有我们生存的宇宙、山河、大地、树木、花草等器世间，这些器世间同样是共业众生的如来藏所变现的。如来藏含藏地、水、火、风四大种子，缘熟输送出来，就能形成众生生存的物质器世间。四大种子中，地大是坚硬性承载性，水大是湿润性润滑性，火大是温热性，风大是流动性。万物的形成和生长需要的四大种子，都是由如来藏来供给的，如来藏依缘、依业，把种子一一输送出来，众生生存所需要的一切就都形成了。至于如何形成的，有道种智的菩萨能少分了知，到了佛地才能究竟了知。</p><p>我们这个世界，是所有有缘众生的如来藏，共同变现所成的，变造的过程需要很长很长的时间。地球生、住、异、灭一个周期是一个大劫，包含四个中劫共八十小劫，一小劫是1680万年。地球的形成需要一个中劫（成劫）共二十小劫，所有共业众生的如来藏用这么长时间，才生成了适合众生居住的生存环境。组成宇宙器世间和组成我们色身的地、水、火、风四大种子是一样的，都是如来藏输送出来的，所以《楞严经》上讲众生色身内的地水火风和色身外的地水火风是不二的，都是如来藏自身的功能属性。众生的如来藏含藏四大种，能变造色身、创造宇宙万物，这就是《华严经》所说的“一切唯心造”，这个心就是如来藏。</p><p>法不孤起，必仗缘生。如来藏虽是万法形成的根本因，但万法也不可能唯因无缘而生。如来藏没有想变生万法的主观心行，因此，尽管祂有能造万法的七大种子，也不会无缘无故去造。三界唯心，万法唯识，能造万法的识分三个，第一个能造的识心是如来藏（第一能变识）；第二个是第七识意根（第二能变识），意根想做什么、攀缘什么，如来藏就会去随顺配合；第三个是第六识（第三能变识）。十方三世一切有漏无漏法，皆因八识心王而有而显，独有一个如来藏，是不能直接造就众生的藴处界和器世间所有法的，虽然如此，一切法究竟还是如来藏单独变造出来的，六七识只不过是缘，能促成一切法的生起。</p><p>众生的一切行为造作，都是真心妄心合作运行的结果，有真无妄，诸法不起。只有妄心，这是不可能的，只有妄心没有真心这种情况不存在，因为妄心不自在，必须要由真心来出生，并与之一起运作，妄心才能存在和运转，离真无妄。众生行、住、坐、卧，作一切事业，都是真心妄心和合一起运行出来的。究竟是如何和合的，证得如来藏明心以后就逐渐能现前观察了，五蕴、十八界一切法的运行，及其功能作用的体现，背后都有一个真心如来藏。</p><p>所谓“色不异空”，意思是说色蕴与空性心如来藏是不二的，此为不二法门。色蕴是如来藏出生的，它就是如来藏的一部分，因此不异于空性心如来藏。这是从色蕴的角度来看色蕴与如来藏的关系，从如来藏的角度来看如来藏与色蕴的关系，就是“空不异色”。空性心如来藏随缘、随业流注出一部分种子功能成了色藴，二者不是完全的二体，本质上有密切的关联，是不二法。如同电视机放出影像，电视机与屏幕上的影像是不二的，是有关联的；也如黄金打造成金指环，黄金与金指环是不二的；也如一堆泥巴捏成了泥人，泥巴与泥人是不二的。</p><p>“色即是空。空即是色。”也是从色藴的本质属性上来说的，色藴的本质就是空性心如来藏，因为色藴全体都来自于如来藏，如来藏用四大种子出生了全部的色藴，因此色蕴自身没有真实的体性，都是如来藏的妙真如性。色藴全体即如来藏，所以说色即是空。从另一方面说，如来藏的一部分功能成就了色藴，成就了色藴的如来藏就是色藴，所以说空不异色。就像黄豆经过浸泡变成了豆芽，那么这些变成豆芽的黄豆就是豆芽；水经过冷冻结成了冰，这时候的水就是冰。</p><p>我们说色空不二，可不可以说色空是一呢？不可以这样说，因为色藴和空性心不完全相同，各有各的属性，一个生灭，一个不生灭，二者的功能作用并不一样，不能互相代替。总括起来就是：色不异空，空不异色；色即是空，空即是色。空和色的究竟关系是不一不异，二者既有相同的性质，也有不同的内涵属性，本质都是如来藏，又不能互相代替，二者就是这种关系。如果说如来藏与色藴是一，那么色藴灭了，如来藏也就灭了，而如来藏是永远也灭不了的；如果是一，那么色藴就能代替如来藏产生一切法，实际上却不能；如果是一，如来藏就有色蕴的相貌，真实眼睛就能看见，事实却看不见，因此二者还不是一。如果说如来藏与色藴是异，那么色藴就能够脱离如来藏，自己就能单独存在，而实际上色藴不能单独存在，不能离开如来藏，离开如来藏就没有色藴了，如来藏离开色藴也不能显现其作用了。因此二者是不异的关系。不一不异，既不是同一，也不是完全的异体。</p><p><span>第二节 五蕴与如来藏非一非异 </span><br/></p><p>同理可知，受不异空，空不异受；受即是空，空即是受。受蕴不异于空性心如来藏，离开空性心没有受蕴；空性心如来藏也不异于受蕴，受蕴是空性心显现出来的法相。受藴是如来藏产生出来的，是如来藏的一部分种子功能，也不异于如来藏，众生的各种觉受就是如来藏流注出的种子所产生的功能作用，本质上就是如来藏。感受就是如来藏流注出识种子形成的识，在分别六尘时所形成的受觉作用，如果没有如来藏的功能作用，受蕴就不会出现，人就与一块木头没有区别了，任人宰割，也不会感觉疼痛。</p><p>所以说受蕴和如来藏不是二法，这个受蕴就不异于如来藏，如来藏变生出了受藴，那么如来藏也不异于受藴，受藴就是如来藏。如来藏的一部分种子功能转化成受藴，如来藏就是受藴，受藴与如来藏的关系就是不一也不异的，二者互相依存不能离开，又不能互相代替。为什么真妄不异又不能互相代替呢？比如说黄金是本有之物，打造成金盆以后，二者就是不一不异的关系，但是不是互相代替，如果想要装水，就要用金盆，不能用黄金块；如果要打造一个金屋，金盆就不行了，就要用黄金。大意如此，比喻不能完全恰当。</p><p>真妄互依才能把如来藏的各种功能显现出来，如来藏动起来才能有妄法色受想行识，如来藏的运行行相也就出现了，真妄和合才能现起一切法。所以当我们有感受的时候，背后一定有真法在配合着，不是只有虚妄的感受作用，找到这个真法是至关重要的。当我们五阴现起的时候，是真妄和合的结果，不是只有表面的五阴相。五阴相是不自在的，不能自己出生自己，一定有现起五阴的真法如来藏存在和运行。真法如来藏是如何起作用和运行的呢？自己独自去参究，明白内里的运行机制才能开悟。</p><p>所谓的开悟就是证得了如来藏在万法中运行的事实真相，不是用眼睛看到了什么，而是心眼打开了，慧眼打开了，观察到了五阴的运行秘密和如来藏的运行机制。同时就知道哪个是自己的如来藏，哪个是真实的我，那么就不再认五蕴为我，知道五蕴确实是假的了，都是如来藏在起作用。找到如来藏的同时，小乘的我见肯定已经断除了，大小乘的果位都能证得。</p><p>证果，说快也快，但如果学佛的路走的偏斜一点，或者是绕圈子，那就会非常的慢，也许越走离正道越远。福报大的人，就走这个直道，修行非常快。福报不足再绕，绕弯的过程是在积累福德资粮的过程，也是修菩萨六度的过程。六度的条件缺少哪个都不行，布施不足不行，戒律、忍辱力和精进度不足也不行，定力、慧力不足，都没办法参禅，没办法明心证悟，所以菩萨六度都要修好。</p><p>同理，想蕴和如来藏的关系也是不一不异的，行蕴和如来藏的关系也是不一不异的，识蕴六个识和如来藏的关系也都是不一也不异的。识蕴六个识是如来藏出生的，六根和六尘一接触，如来藏就产生六个识。所以整个五蕴都是如来藏变现出来的，因为都是变现出来的缘故，所以才说五蕴是空的，并且是空性。空，是空幻、空无、不真实义，空性的意思就是如来藏的性质。</p><p>五蕴自己不能单独存在，不能自己从无到有，从有又到无，即使有的时候，也不是真有，是假有，幻化的有，不是真实的。就像一个魔术师在空中变现出一个宝石一样，这个宝石虽然看似有，但不能单独存在，它没有真实的体性，是虚妄的，是空的，说没有就没有，根本执著不了，也抓不住，因此就是空幻的。从另一方面说，宝石是魔幻师变幻出来的，属于魔幻师所有，变幻与收回宝石由魔幻师掌握。</p><p>五蕴中，识蕴是心法，受蕴、想蕴是心所有法。根尘相触，如来藏就流注出六识心的种子形成了识，六识在分别六尘时就有了觉受、有了取相分别。因此，识蕴、受蕴、想蕴都是如来藏产生出来的，是如来藏的一部分种子功能，所以也不异于如来藏，本质上都是如来藏，与如来藏是非一非异的关系。</p><p>再看行蕴，我们的身、口、意的一切行为造作都是行藴。众生的身心为什么会刹那生灭，皆是因为背后有个如来藏不断输出业种而产生的。从世间现象来看，一切法迁流不止，没有刹那停止过。而从空性心如来藏的角度看，一切法的变化，是如来藏不断变现执持的结果。如来藏输出业种，现行后再落谢回到如来藏心体中，再输出业种，再回到如来藏心中，这样不停地快速的生灭。一切法的生住异灭，本质上就是如来藏输出种子的生住异灭的过程。因此，行蕴与如来藏是非一非异的关系。</p><p>大乘行者的开悟就是明白一个事实真相，懂得了五蕴的运行机制以及与如来藏的关系，证得了如来藏，知道了祂就是真实的我，从此不再认五蕴这个假我。因为当下就能现观，五蕴身如同木偶人，如来藏就是背后的操纵者。</p><p/><p>第三节　如来藏对众生的随顺性</p><p>整个五蕴都是如来藏幻化出来的，所以五蕴才是空的，不实在的。五蕴不能独自存在，有如来藏亲自所缘和执持，它在如来藏法界当中从无到有、从有到无，生生灭灭永无止歇。如来藏离见闻觉知，是相对于意识觉知心了别的范围来说的。如来藏有自已独有的了别性，能随顺我们成就世间法。祂有时像一个最忠实的仆人，对我们言听计从、百般随顺：我若向东，祂不向西；我若坐卧，祂不站立；我若吃饭，祂不饮茶；我若看物，祂不听声；我若为人，祂不做鬼；我若上天，祂不入地。</p><p>如来藏也有不随顺的时候，祂有独断专行不讲情面的一面。这是什么情况呢？这是在众生业缘已经成熟，如来藏不得不按照业力来实现众生的因缘果报。五蕴身心造作的所有业行的种子都存在如来藏心体里，如来藏随时都能了别这些业种，根据业种来执持众生的六道色身和改变生存环境。未来世如果该得人身，就在第七识的配合下，入母胎投生人道；如果该得畜生身，就与意根一起投入畜生胎，在畜生母胎中变出畜生身。</p><p>应该为众生变现什么样的色身，如来藏都清楚，是男身还是女身，色身是庄严还丑陋，健康还是残疾，如来藏都能依业、依缘准确无误地变现出来。如来藏执持我们的色身，祂不会有自我意识说，畜生身体那么丑陋，我不想执持，我还是变现一个人身或者天身。祂没有我见、我执，五阴造的是什么业，该得什么的果报，都瞒不了祂。祂不听从意识的建议，也不与意识商量，如来藏有自已的本觉智，这种智慧是如来藏本有的，不是修学来的，与意识觉知心了别六尘万法的智慧有本质的区别。</p><p>有些人日日都想发财，就是发不了财；有些人希图长寿，中年未到就已离世；有些人想追求健康，却整日药不离身；有些人想升天享福，寿终时却下坠恶道。不要抱怨如来藏不随顺，如来藏既了别众生的心，也了别众生的业，众生想做什么，祂都会随顺配合，祂自已却没有选择的余地和念想。众生想成就的事，如来藏中如果没有收藏这样的业种和业缘，祂也没有办法，祂也做不了无米之炊。缘熟时，不管众生有没有这样的想法，也不管是恶、是善，不管众生要不要，祂一律把业种现行出来，如实实现果报。如来藏的运作有自已特有的规律，不以我们的意愿所转移，祂忠实地记录我们所造作的身口意行、造作的所有善恶业，无一丝一毫的差错。业种成熟时祂知道业的果报是什么，该升天享福的，就给你造天人的色身，该下地狱受苦的，就造地狱的色身和地狱的生存环境，正报依报都是由祂来成就，所以地狱、天堂都是唯心所造。</p><p>如来藏自性清净，没有自我，绝对随缘，不分善恶，随缘的同时又不改变其自体清净性，不变当中又完全随缘，随缘不变，不变随缘。而我们的妄心七识，自我性非常强，总是想让他人或者外界一切境界顺从于自己的意志，总是想摆布一切，非常的主观，我执很重。如果七识心通过修行能像如来藏一样清净，我们就能圆满成就佛道。因此，我们应该要知道如何真正修行，应该通过修行菩萨六度，明心找到如来藏，依止于祂断除我见和我执法执，灭除烦恼习气，灭尽无明，从而究竟解脱。</p><p>学佛之人要认识五蕴的虚妄性，知道祂不能长久住世，人生百年不过刹那之间，要有解脱生死的急迫之心，力求早证菩提。一旦证得如来藏以后，十方世界可以随意往生，因为这时心与十方諸佛国土相应，明心悟道的菩萨是諸佛国最基本的组成成员，只要有愿力想往生，諸佛都会接引，这是由愿力和善业作主的。如果不修行、不证真，就不得自在，当恶业的缘熟时，自己根本没有办法抗拒业力，瞥尔就随恶緣而去受生死流转的果报去了。</p></div>"
},{
    "title": "第五章 如来藏的中道性",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第五章 如来藏的中道性</strong></p><p>经文：<strong>【舍利子。是诸法空相。不生不灭。不垢不净。不增不减。】</strong></p><p/><p>第一节 五蕴十八界的空相</p><p>什么是诸法呢？心经所说的诸法总分为两大类：一个是色法，一个是心法，合起来就是三界世间五蕴十八界当中的所有法。五蕴是色藴、受藴、想藴、行藴、识藴；十八界包括六根：眼根、耳根、鼻根、舌根、身根、意根；六尘：色尘、声尘、香尘、味尘、触尘、法尘；六识：眼识、耳识、鼻识、舌识、身识、意识。</p><p>五蕴包括色法和心法，十八界中，六识加上意根第七识是心法，其余都是色法，前五识所了别的五尘和意识所了别的法尘，都属于色法。众生都活在六尘万法之中，自身所受用、所接触的法，都没有超过这六尘，生存环境、宇宙器世间，所有的三千大千世界，都不出色、声、香、味、触、法六尘境界之中。</p><p>五蕴十八界，无论是色法还是心法，都是有相的，都有三界世间里的法相。色有色相，心有心相，但是这些相都是幻有，都是空的，所以叫作空相。五蕴十八界法为什么有相而空？《金刚经》云：凡所有相，皆是虚妄。因为所有的相都是如来藏幻化出来的，是不自在的，说消失就消失，有也是空幻，如梦中物一样；也好比阳炎和海市蜃楼，虚幻不实，似有实无。</p><p>菩萨明心以后，用般若智慧和定力来观行，就会发现：五色根是如来藏执持的，如来藏输出四大种子维持其存在，生住异灭从未停息；六尘是如来藏变现的内相分，似色非色，如镜中之物；七转识也是如来藏输出的识种子，刹那生刹那灭。五蕴十八界一切法，没有一法是真实不灭的，只是众生无量世以来，无明烦恼执空为有，如在梦里追逐幻影，导致轮转生死不得解脱。</p><p>什么是海市蜃楼呢？太阳光照在海滩上，海滩上的热气返上来，就出现了楼房、人物、车马，而且车马还在走动，虚幻的景象就显现出来，那个现象就叫海市蜃楼，是热气形成的一种假象。远远看，那个楼房像宫殿一样真实，有马在奔跑，人物还在走动，就像真的一样，远看看不出那些现象都是假的，走近一看，却什么也没有。什么是阳炎呢？当太阳光照在沙滩上的时候，热气返上来，雾蒙蒙的，那些鹿因为口渴的缘故，就以为那是一条大河，赶快奔过去想喝个饱，等跑到近边一看，沙滩上什么也没有。那些野鹿的心，被幻化出来的河水的假象迷惑住了，牠们认为河水是真实有的，可实际上是空的，什么也没有。阳炎就像那幻化出的河水一样，表面看好像是有，实际上是空的，渴鹿被自己的识心欺骗了，不识真相。</p><p>众生的心就像渴鹿一样愚痴，不辨真假虚实。我们现在心还被迷惑着，还处于颠倒状态，没有清醒过来，与在梦里是一样的。七识心就像那渴鹿一样，以为万法真实有，每日里追逐着万法，追求了一辈子甚至无量劫，到最后还是空空如也。众生生活在人间，七识心生生世世执着五欲六尘，为了金钱、房产、地位、名声，还有子女、家庭，为了財色名食睡，谋划攫取，广造恶业。有些人觉得成功了，志得意满，殊不知所见所得都是幻相，等到无常到来，眼睛一闭，臭皮囊不得不丢下了，哪有一法可得。所谓：一日无常到，方知梦中人；万般将不去，唯有业随身。而无常不是专指死亡，才叫作无常，刹那生灭、了不可得，这是真正的无常，就在一切法表面存在的当下，就是生灭无常而幻化的，就像阳炎一样。</p><p/><p>第二节 如来藏的空相</p><p>为什么说如来藏是空相？祂与五蕴十八界的空相有什么不同？说如来藏是空相，是因为祂没有三界世间的六根相、六尘相、六识相，也没有五蕴相，没有一切世间相，但却是真实的存在。五蕴万法和如来藏两种相，不管是假法也好，实法也好，所有的相都是空的，实质都是空性心如来藏。凡所有相，皆是虚妄，有相之相是空的，无相之相也是空的，两种空含义不同，有相的空是了不可得，无相的空是没有相貌，没有色相。</p><p>五蕴十八界是有相而空，如来藏是无相而空。五蕴十八界是有相无性，所以说空；如来藏有性无相，也说是空。同样说空，但这两种空却有很大的区别，一个是虚妄法，一个是真实法；一个是虚相，一个是实相；一个是用，一个是体；一个是权，一个是实；一个是依祂起性，一个是圆成实性。但二者又是一体两面不可分割的，相依性而有，性以相而显。如来藏虽空却是真实法，五蕴十八界虽有却是虚妄法。五蕴十八界并不是灭了以后才说空，而是存在的当下就空，因为它无自体性，非真实存在。正如金刚经所说的如梦幻泡影，是我们的妄想分别而显现出来的。其实五蕴十八界就是如来藏空性心，全体都是如来藏的种子功能作用，如果非要说有相，就是如来藏相。</p><p/><p>第三节 诸法空相为什么不生不灭</p><p>一切法都是如来藏幻化的，所以说诸法都是空相。如来藏这个能生万法的真如心体虽然是真实有，但祂不是三界有，看不见、摸不着、闻不到、触不着；凡是三界有的东西都是要生灭的，如来藏不是三界有，因此不生不灭。“是诸法空相。不生不灭。”意思是说空性心如来藏不是有生之法，祂无始劫以来就一直存在，凡是有生之法都会有灭，但如来藏不是有生之法，所以永远也不会灭。</p><p>五蕴世间万法为什么是不生不灭的？这是从法的理体上来讲的。五蕴世间万法没有自体性，它的体性都是如来藏性，是空性心如来藏的功能作用。五蕴的法相有生，法性未生，所以不是真生；五蕴的法相有灭，法性本来未生，又何曾灭，所以灭也是幻灭。一切法在如来藏心体的表面虚妄的生灭，但从如来藏的立场来说，一切法只是如来藏功能体性的一部分，这种功能体性是本有的，从未生过，也不会灭。</p><p>举个例子来说，梦里的景象是如来藏变现的独影境，我们做梦梦见自已发财了，有很多房产田地、金银珠宝、汽车飞机等等，突然一觉醒来，这一切财富都消失不见了。有智慧的人自然不会说梦里的财富真实出现过，既然梦里的事没有生过，就谈不上有灭。同理可证，人生本来就是一场大梦，一切五蕴世间万法都是如来藏幻化给我们的，包括这个所谓的我们，也同样是幻化的，如果执着五蕴说它有生有灭，岂不是愚痴。</p><p>菩萨修到十回向位证得如梦观，就能现观一切有情所受用的一切境界法，以及造作的身口意行，皆是无得无失。犹如迷人眠梦，于梦中悲欢离合，喜乐无常，而不知是梦，又于梦中造作诸多善行恶行。菩萨再来观行自身所行菩萨道，亦如在梦中广修六度一般，悉依世界六尘幻相，及自心所现七识妄心诸心所法，而行菩萨道，皆是梦境所现，无有一法真实可得，故云菩萨道如梦。</p><p/><p>第四节 无量的中道性</p><p>前面讲了诸法空相不生不灭的中道性，如来藏除了这个中道性，还有无量的中道性。</p><p>一、不垢不净</p><p>接下来心经中说到了“諸法空相的不垢不净”。前面我们已经讲到了，诸法空相指的就是如来藏，如来藏为什么是不垢不净的？</p><p>如来藏也叫作自性清净心，所谓自性清净包含两层含义：一是说如来藏有自体真实存在之性，不需要什么法来变生祂，除了祂，一切法都没有真实不灭的自体性。二是说如来藏对于六尘境界没有见闻觉知，祂变生六尘万法而对六尘万法不起心、不动念，不起貪嗔痴烦恼，也没有我性，没有我执和法执，所以说祂是清净的。</p><p>七识心造业，五蕴造业，造业的种子存在如来藏那里，如来藏就收存了七转识染污和清净的业种。如来藏好比是一只杯子，业种就如杯中的污水，杯子本身是干净的、清净的，杯中水却不干净，那么整杯水就是不垢不净的。说如来藏“不垢”，是说杯中水可以被染污，也可以转为清净，但杯体却永远不会被水染污，如来藏本体没有污垢，没有无明烦恼；说如来藏“不净”，是因为里面装的水是肮脏的、不清净的，如来藏里含藏着染污的业种。如来藏中含藏七转识染污的种子，生出的七识心就有烦恼和无明，是不清净的，但如来藏无始劫以来，从不与烦恼无明相应，总是在一切法的运行中显示出自体的清净性。</p><p>如来藏心体一直是清净的，而且永远清净不变质，自性本来清净而常处涅槃。清净的是如来藏，不清净的是前七识和种子。修行是修前七识，转染污为清净，如来藏本来清净，不用修如来藏。只有到佛地，如来藏中所有的染污种子才全部转变为清净种子，这时如来藏不再是不垢不净，而是究竟清净的无垢识了，又叫作真如，是名符其实的“真”和“如”了。</p><p>二、不增不减</p><p>“不增不减”的含义，一是指如来藏的心体中含藏着七大种子，这些种子输送出来，能产生三界世间万法，这些种子的数量永远不增不减，产生万法的功能作用也不增不减、不变化；二是指法界当中如来藏的数量既不增加也不减少，众生界不变；三是指如来藏心体永远不发生变异，祂不持戒、不修行、不学世俗法，也不学佛法，祂的本觉智慧既不增加也不减少。</p><p>众生的前七识心是有增有减的，无明减少，智慧就增加；定力增加，散乱心行就减少；戒行增益，作恶就减少。如来藏心没有得失、没有增减。通过修行，染污的心行转变为清净的心行，七识种子的数量并未发生变化，七大种子的数量不会发生任何增减变化，那么七大种子所变现出来的一切法就不增不减，因此说諸法空相不增不减。</p><p>三、不门无量中道性 </p><p>如来藏除了心经中讲的“不生不灭、不垢不净、不增不减”的中道性以外，还有其他的中道性。龙树菩萨作的《中论》讲了八不中道，所谓八不中道是：不生不灭、不断不常、不一不异、不来不去。 此外还有：不空不有、不长不短、不上不下、不前不后、不说非不说、不行非不行、不吃非不吃、不作非不作、不修非不修、不看非不看、不听非不听等等无量的中道性。这些中道性需要悟后一一实证和体验，未悟实相而去思惟，只能落得个“情思意解”，没有丝毫受用。</p></div>"
},{
    "title": "第六章 真心涅槃毕竟空寂（1）",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第六章 真心涅槃毕竟空寂</strong></p><p>经文：<strong>【是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。】</strong></p><p/><p>第一节 真心空寂无五蕴</p><p>《杂阿含经》中佛多次讲“五阴非我、不异我、不相在”，有时候也说十二处、十八界都“非我、不异我、不相在”。意思是说，五蕴、十二处、十八界都不是真实的我，不是真心如来藏，但也不能说五蕴十二处十八界与如来藏是二法，在五蕴中没有如来藏相，在如来藏心体中也没有五蕴相。</p><p>经文“是故空中无色。无受想行识。”所谓“空中无色”，是说空性心如来藏心体中没有色藴。如来藏本身无形无相，没有长短大小、青黄赤白，连虚空都没有；如果如来藏有色蕴，我们就可以眼见如来藏、手摸如来藏，那证得如来藏就太容易了；如果如来藏有色蕴，就有长短方圆大小和方位，五蕴身在如来藏何处安放？与如来藏是否要重叠？如来藏色蕴之外又是什么？是在虚空里还是在虚空外？肯定是在虚空里，那么虚空大于如来藏，包围如来藏，不是如来藏所生，与楞严经佛说虚空在如来藏里如太虚中一片云相违背，因此说如来藏有色蕴是错误的，如来藏没有色蕴。</p><p>“空中无受想行识”也是此理，如来藏心体中除了没有色蕴，也没有受藴、想蕴、行蕴和识蕴。如来藏离见闻觉知，对六尘万法不见、不听、不尝、不触，而见闻觉知性都是六识的功能。如来藏对一切法都是舍受，祂的舍受与意识心的舍受有所不同，意识的舍受是意识对应法尘时不感受苦和乐，而如来藏的舍受是如来藏根本就不明了六尘为何物，不知道是非好恶美丑，自身也没有烦恼，没有我性，因而不对六尘境界生起苦受和乐受，祂的舍受要比意识的舍受深细的多，很难真正理解，二者区别很大，与意根的舍受区别也很大；如来藏也不分别六尘境界，不知色声香味触法，不知东南西北，没有对六尘的分析、计划、打算，没有意识的那种思想念头。</p><p>妄心有分别，前七个识都有分别，只是意根第七识分别的不能具体和细致，但也有大略总体上的分别和了别性。妄心就是用来分别六尘境界的，真心不分别六尘。但是妄心在分别六尘的时候，就有真心不分别的配合，所以我们分别的时候，同时就有一个不分别的真心同时存在，二者和合运作，并行不悖。</p><p>如来藏没有行蕴，因为祂没有色蕴和识蕴，就没有身口意行的造作，没有动转施为，也没有变化和迁流，也不会念念生灭代谢。如来藏中没有识蕴，识蕴是对六尘境界的见闻觉知，如来藏对六尘不见闻觉知。既然如来藏没有六识那种识蕴，也就没有如六识那样的受蕴、想蕴和行蕴。虽然如来藏也有五遍行心所法受想思心所法，但与六识和七识的受想思心所法有很大的区别，六七识的心所法带有无明和烦恼性，有我性和执著性，有主观性，有喜厌的心理，不平和；如来藏的心所法如木石般的运行，不受境界影响，没有我性和执著性，也没有主观性和喜厌的心理。</p><p>阿罗汉灭掉五蕴入无余涅槃，而无余涅槃里灭掉七识，只有如来藏独处，如果如来藏有五蕴，这个涅槃中就有色有心的动转，不但是否诸佛可以找得到阿罗汉的如来藏，开悟的菩萨都可以找得到阿罗汉的如来藏，乃至于凡夫也能找得到阿罗汉的如来藏，那也就等于找到阿罗汉了。可实际上阿罗汉涅槃以后，即使十方诸佛的神力也找不到，因为如来藏无形无相，眼见不到、耳听不到、鼻嗅不到、舌尝不到、身触不到、情思意想不到。所以总结起来说如来藏无五蕴（的功能作用）。</p><p/><p>第二节 真心空寂无十八界</p><p>经文：<strong>【（是故，空中）无眼耳鼻舌身意。无色声香味触法。无眼识界乃至无意识界。】</strong></p><p>这是从总体上来讲如来藏空性心中没有十八界法。如来藏心中没有眼耳鼻舌身意这六根，没有色声香味触法这六尘，没有眼识界乃至意识界这六识，六根六尘六识合起来叫作十八界，五藴十八界组成了一个众生。</p><p>一、如来藏心中无六根界</p><p>（一）六根简介</p><p>六根是指：眼根、耳根、鼻根、舌根、身根、意根。</p><p>1、什么是眼根？</p><p>眼根包括浮尘根和胜义根（又称净色根）。眼的浮尘根就是浮在身体表面，像葡萄形状的东西，里面有水晶体、视网膜，还有传导神经。眼的胜义根是四大种所造的清净色，有传导神经与浮尘根相连，在后脑的下丘脑那个位置，属视觉中枢，是大脑皮质中与形成视觉有关的神经元。</p><p>眼胜义根很重要，它是出生眼识的重要因素，比如说，眼的浮尘根即使完好无损，如果胜义根毁坏，也不能见色，因为根尘不能相处，如来藏不能出生眼识，不能见色，那就是个盲人。眼耳鼻舌身这五根的胜义根都在后脑那个位置，这个部位的胜义根如果出现病变，人的身体就失控了。如果仅仅是浮尘根毁坏了，色身还有一部分功能。如果胜义根毁坏了，浮尘根再完好也发挥不了作用，那就是植物人了。</p><p>眼的浮尘根是由如来藏变造出来的，如来藏在母胎当中，吸收母体子宫里的地水火风四大元素，变造身根，到一定时候就变造出眼根的浮尘根。眼根是由地水火风四大种子所组成的，眼睛有肌肉和玻璃体，坚硬的部分就属于地性；眼睛的湿润性，就是水性；眼球里面有温度，那就是火性；眼睛里面还有风性，眼球就能动转，视觉神经就有传导功能。</p><p>如来藏有很大的智慧，能制造这种高精密度感光的眼根，从受精卵开始变造，在出生前就要全部造好，出生后，就能用它来了别色尘。众生的色身及三界世间的一切法，都是如来藏制造的，祂才是真正的“上帝”。</p><p>2、什么是耳根？</p><p>耳根也分为浮尘根和胜义根，在头部一边一个，长得像新卷叶，再加耳蜗，这就是外耳根也叫浮尘根，大家都能看得见。外耳根是由地水火风四大种子构成的，那是在受精卵当中，如来藏把地水火风四大种子输送出来变造出的外耳根，造出了人这样的耳根，或者是畜生那样的耳根，或者是某种众生的耳根。</p><p>耳朵的肉和脆骨那类的都属于地性，以地大为主；耳朵里的血液，属于水性，以水大为主；耳朵的温度属于火性，以火大为主；耳根的神经传导作用属于风性，传导神经在风力的作用下，才能把外声尘传导到后脑的胜义根，在那里变现内声尘，然后如来藏在那里产生耳识，那地方损坏了，耳根即使完好也听不见声音，那就是耳聋、耳背了。后脑勺那个部分是耳的胜义根，也叫内耳根，由地水火风四大组成，耳的外根与内根组成了整个耳根。</p><p>3、什么是鼻根？   </p><p>鼻根的浮尘根位于面部中央，由外鼻、鼻腔、鼻旁窦三部分构成。胜义根嗅觉中枢位于大脑半球内的梨状叶，浮尘根中的嗅觉神经分布在鼻腔中，一直通往位于大脑半球的胜义根。鼻根也是由四大种子构成，如来藏通过鼻根摄取外相分香尘，然后在胜义根处变现为内相分香尘。一旦鼻根受到损坏，不管是外鼻根和内鼻根，如来藏都无法出生内相分香尘，鼻识就不能生起，无法了别香尘。</p><p>4、什么是舌根？</p><p>舌根在口腔里像半月形的，一张口大家都能看得见，这叫浮尘根，也是由地水火风四大种子所构成。在母胎里成为受精卵的时候，如来藏把地水火风四大种子输送出来就形成了这个舌根，至于如来藏如何形成的舌根，需要在以后修道种智的时候，一点点了解，这些细节全部了知了，就可能到了佛地。舌根有传导神经，一直通到后脑勺那里，也叫味觉神经，后脑勺那个部位是舌根的胜义根，也是由四大种子组成的，是出生舌识生起味觉的地方，那个部位如果出现障碍，我们就不能品尝味道，吃什么东西都没有味觉，就不喜欢吃东西了。</p><p>5、什么是身根?</p><p>身根就是指我们的身体从头到脚，分为浮尘根和胜义根，都是由地水火风四大种子组成。身根的浮尘根比较复杂，其中：皮肤、肌肉、骨骼、内脏等属于地性，以地大为主；血液、汗液、尿液、眼泪、唾液等等属于水性，以水大为主；身体里的热量、温度，属于火性，以火大为主；身体的动转、呼吸、血液循环、胃肠蠕动，以及饮食的消化吸收排泄等功能属于风大。</p><p>地水火风四大种子和合在一起组成了身体，单独一类种子不能构成色身某部分物质。比如肌肉是坚硬性的，有地的成分；但是肌肉也是湿润的，就有水性，没有水性的肌肉就象木头似的干硬，没有相应的功能；肌肉里也有温度，就是火性，没有火性，肌肉就冰冷僵硬的，不能活动；肌肉里也有风性，如果没有风性，细胞就不能新陈代谢，我们也不能呼吸，皮肤上的毛孔也就没有用，饮食也不能被消化吸收和排泄，气血也不能流动了。</p><p>身体的每个组织或器官，都是由地水火风四大和合组成的，只是各个部分四大组成的比例不同罢了。有的部分是地性占多数，有的部分是水性占多数，有的部分是风性占多数，火性在身体各部分的分配也有所差别。四大比例不同，组成的物质也不同。地大占的比例多就形成了骨头、肌肉、筋络、血管，水大占的比例多就形成了身体的各种体液。但不管什么成分、什么比例，都全部包含地水火风四大元素。</p><p>身根的胜义根，就是躯体感觉中枢，主要位于大脑皮质的中央后区，与身体表面遍布的触觉神经相连。如果胜义根受损，我们对身体就失去觉知能力，整个身体就瘫痪不能动了。所以胜义根是最重要的，有意外发生时，我们会习惯性地先保护头部后脑，这也是意根无量世来的执身习性。</p><p>6、什么是意根？</p><p>意根是心法，祂无形无相，是无色根，既有根的功能，也有识的作用。六根中，意根是一个特殊的根，祂是第六根，也叫第七识、末那识，既是根又是识。与前五根不同，五根是有色根，有形有相、有方所。意根从无始劫以来就存在着，没有一个开始，虽然无生，但是可灭。什么时候能灭呢？四果阿罗汉入灭尽定时，就能灭掉意根的一部分功能，就是心所法中的受和想两个心所法，入无余涅槃时意根就全部灭去了。</p><p>意根也是不自在的，依如来藏不断输送识种子才能存在和运行。既然祂是能灭的法，就是虚妄法，不是真实法。凡是有生有灭的，都不是真实的法，都是幻化的、空的、非我的。意根也是如来藏所出生和执持的法，如来藏输送出识种子，祂才能有心所法伴随着运行，才能有各种识的功能作用。如来藏如果不输出意根的识种子，意根就灭掉消失，所以意根是虚妄不真实的。</p><p>意根的体性是时时思量，事事作主，处处攀援，具有贪嗔痴慢疑恶见等等烦恼。正因为祂的散乱攀援性，导致意识心识散乱，很难集中。我们打坐需要制心一处时，祂却到处攀缘，牵动意识浮想联翩。有时好不容易稍微有些入定了，突然心中又冒出一件事来，心念立刻就散乱了，这就是意根不甘寂寞到处攀缘造成的结果。</p><p>我们生生世世的所有行为造作，全部作为种子存在如来藏里。意根历缘对境运作的时候，就要按照自己所熏修的习气去作主作决定。尤其在中阴阶段，意识所起的作用微弱了，一切行为造作、所思所想都是以意根的习气为主，是什么习气，就按什么习气投胎。意根无始劫以来一直运行着，从来没有中断过，无明烦恼非常深重，熏染了什么业习，中阴身就表现出什么样的习气惯性，非常强烈，第六识没有理智的分析思惟能力，无法对意根进行约束和督导，于是意根就按自己的习气去投胎。贪习去鬼道，嗔习下地狱，愚痴做畜生。</p><p>意识在五蕴身中活动时，意根有贪嗔痴烦恼，思量做什么事情的时候，第六识还能通过思惟制约一下意根，能够严密深入思考分析事情的利弊得失，给意根出谋划策，对意根有约束劝导作用。中阴身阶段的意识觉知性差，因为所依止的胜义根不发达，意识分析思惟性就弱，对意根的约束力不强，意根就完全按照自己的习性惯性去行事。过去生熏习收藏了什么种子，就表现出什么习性，然后就按照习性去投胎。</p><p>修学佛法最重要和根本的问题就是要降伏意根，因为意根是五阴身的主宰，能够主导身口意行。意根知见观念改变，无明烦恼就降伏消除，身口意行就清净。修学四圣谛义理，明白五蕴十八界无我、虚妄不实，但如果仅仅是意识接受这个道理，意根不接受不认可，就不能说已断我见证初果，因为内心深处的意根不知道五阴无我，心里还有我。有些人谈论佛法口若悬河，但内心深处的这个意根并不认可，那就没有真实的解脱受用。所以说学术研究不能代替实际修行，修行最重要的不是在口头上的理论知见如何，而是在于真正改变内心，真正认知那个理、受持那个理、转依那个理，才能起到真正的作用，才可以消除无明烦恼。</p><p>改变意根是修行当中最重要最关键的环节，修学佛法只是浅层次的理解还不行，还要深细的思惟观行，这过程能充分熏修意根，让意根参与观行的过程。意识经过反复分析、考量，真正弄清了法义，不再有疑虑了，意根把这个过程和结果充分深细的考量，就会思量清楚，没有疑虑了参究观行就结束，意根成功受熏证法，身口意行就出现变化。如果意根未被熏染，常常是嘴上说一套，实际上做一套，口是心非。比如说：学佛的人都明白布施能得大福报，贪心和吝啬心重，来世可能要落入恶鬼道，很多人都明白这个道理，但在真正布施的时候，却又因为意根的吝啬而迟疑不决，不肯布施，这就是因为意根还没有懂得布施对修行的助益，意识没有思惟过此理，意根不知，就不能决定布施。</p><p>意根为什么难于认知真理、难于证法、难于改变呢？一个是因为祂的了别智慧不足，处处攀缘，识心分流多，了别势力不强；一个是因为祂无始劫以来，熏习的邪见太多，含藏的无明太深厚，深重的习气很难扭转。有时候意识把大道理讲得头头是道，都能说服别人，可是自己做事还是老样子，习气毛病很重。所以很多事不能光听别人言，还要观其行，只有言行一致，才能说明意根受熏明理了。很多学佛修行的人，都存在这个误区，以为将法义弄明白了就行，没有深入到意根这个层面，没有说服意根、降伏意根，话说起来像圣人，一做事就是凡夫。还有些人，读他写的文章，有情有理，感觉思想情操很高尚，可实际为人行事却完全两样。世俗上说这种人是虚伪，佛法上讲这种人只有意识理解了一些道理，意根内心深处还没有相应，身行意行不与口行一致，只会教育别人，不能改变自已。</p><p>（二）为什么说如来藏心中无六根界</p><p>六根各有各的功能作用，相互不能替代，所以叫六根界，有六种功能界限。六根的主要功能是在如来藏的运作下，摄取六尘万法，然后如来藏才能出生六识来了别六尘，众生才有见闻觉知性。六根中有色法五色根，有心法意根末那识，如来藏是心，是能藏识，含藏着六根的种子，能籍缘出生六根。但如来藏心中没有六根，如果如来藏心中有五色根和意根末那识，就有六根的功能作用，自己单独就能触色声香味触法，不需要眼耳鼻舌身意触六尘了，也不需要输送四大种子出生五根输送识种子出生意根，也就没有色身五阴了，如来藏自己就可以代替六根的功能作用。实际上如来藏没有六根，我们见不到摸不到触不到如来藏的五根，也不见如来藏有意根那样的作主性，更没有我见和我执。所以如来藏没有六根界。</p><p>二、如来藏心中无六尘界</p><p>六尘就是色尘、声尘、香尘、味尘、触尘、法尘，如来藏心中没有六尘。</p><p>（一）如来藏没有色尘，因为祂是无形无相的。色尘是由地水火风四大组成的有质碍的东西，和眼根相对，眼识能了别。如来藏不是由四大组成的，不是物质色法，不与眼根相对，眼识不能识别。色尘分为显色、形色、表色、无表色，显色是大家能看到的青黄赤白、光影明暗、云烟尘雾等信息；形色是物体的形状、大小、长短、方圆等信息；表色是色尘形体所处的状态和众生色身的行走坐卧、屈伸俯仰等肢体运行；无表色就是色尘上所显现出的内涵、神韵、风采、美丑、年龄、新旧等信息，比如高山的巍峨、瀑布的壮观、树木的繁茂，人的文化、气质、涵养、风度、柔软、跋扈、粗鲁等。</p><p>如来藏不具备这些色，这些色法，都不在如来藏心中，所以眼睛看不见如来藏，眼识无法证得如来藏。如果如来藏有色尘相，那就可以不用参禅来找祂，只要眼睛没问题，可以直接看见所有众生的如来藏，在眼根上就能证得如来藏了。事实却不是这样，如来藏是无相无形的，眼睛看不见，因此如来藏无色尘相，不是四大组成的。寻找如来藏不能用眼去见，眼睛是看不见如来藏的，必须用智慧之心眼发现和证得如来藏，才是明心证悟。进入定中参禅，意识心就能非常细腻和专注，参到某个环节，内心灵光一闪，就能观察到如来藏在五阴上的运作，意根也同时确认如来藏的运行行相，然后可以两个识一起现观，如来藏是如何与五阴和合在一起运行的，就会明白什么是无所住而生其心的心。</p><p>比如娑婆世界的第一则禅宗公案：灵山会上天人献花，释迦世尊拈花示众，不说而说，默然开示真如心法无上法门。是时众皆默然，唯迦叶尊者破颜微笑。因为迦叶尊者就是在佛拈花示众的当下，一念慧相应，证得了正法眼藏、涅槃妙心、实相无相、微妙法门。真如心既是无形无相，眼识便不能见，大迦叶凭智慧识得了佛的真如心，发现了真如运作的秘密。发现了这个秘密的同时，也就知道自己的如来藏也是那样运行的，知道了所有众生的如来藏都是那样运行的，那样起作用的。然后就能进一步观察到，如来藏是如此与五蕴七识配合运作，显现世间一切法，这些秘密和内涵慢慢就都明白了。继续观察修行，会明白如来藏更多的体、相、性、用，般若智慧就会越来越深利，悟后的别相智就会具足，道种智也就渐渐生起了。</p><p>（二）如来藏没有声尘，祂既不会说话，也不会发出任何声音，我们想用耳识来听如来藏肯定听不见。但祂会变现出宇宙天籁之声，还有各种风声、雨声、鸟声、人畜之声，在声音这一法上有如来藏所显现的功用。香严智闲禅师就是听声开悟的，有一天他在割草整理禅院的时候，捡起草丛里的瓦石抛了出去，恰好打在竹子上，发出清脆一响，瓦石裂开，他忽然大悟。听声而悟的祖师，就是在参禅参得疑情正浓的时候，听到某种声音，灵感一闪，智慧出现，就悟到如来藏了。</p><p>（三）如来藏也没有香尘，我们闻不到祂，但香尘的出现有如来藏的功能德用，因此就有人通过闻香而证得如来藏，证悟实相。在香积佛国土，佛与菩萨们围在一起吃饭，佛用鼻子嗅一下饭香味，菩萨们马上就开悟了，佛只是用鼻子嗅一嗅，菩萨们就明了真心，就这么简单。那个世界众生鼻根利，闻闻味就能开悟，神奇不神奇？</p><p>我们这个世界众生的耳根比较利，可以通过说法听法在音声上接引。其他世界的众生，都各有其伶俐之根，因此，善知识接引不同根性的众生其接引的方式都不相同。在伶俐的根上引导开悟，能很快得悟。佛有无量智慧有很多善巧方便，让众生得悟自己的如来藏，因为如来藏遍一切时、遍一切处、遍一切界，无所不遍，无处不显。虽然如来藏没有香尘，闻不到如来藏，但可以闻香为缘找到祂。我们只要把菩萨六度修好了，再去参究，等到有一天真的开悟了，就知道所言不虚了。</p><p>无论是参话头还是参公案，如果福德因缘具足，都能很快证悟。禅宗祖师经常说悟道因缘是，生缘处处，山色溪声、举拳竖拂乃至街市从闹，都能明心。若是福德因缘不具足，想明心比登天不知还要难多少倍。如来藏时时处处在显现着，从来没有藏着躲着，只是我们没有慧眼，就像太阳的光芒普照大地，但盲人就是看不见。唐朝时有个庞蕴居士，一家四口都是开悟的菩萨，一日，庞蕴在茅舍里打坐，想起明心这件事，忽然有所体会，自言自语道：“难难难，十石麻油树上摊！”妻子听后，觉得好笑，随口应道：“易易易，如下眠床脚踏地！”女儿灵照正在舍外编竹篱，父母的对话一并听在她的耳朵里，她觉得有意思，在外边高声地说：“也不难也不易，百草头上祖师意。”</p><p>所以说开悟这法，说难是真难，说易也容易。只是那么多参禅的人没有正确的方法，佛法的知见也不具足，参一辈子，自然没有什么结果。因为没有善知识引导，不知道往哪个方向参，用什么方法，怎么入手，在那里苦思冥想，一辈子几十年就那么过去了。</p><p>（四）如来藏没有味尘，祂不属于酸性的、甜性的、苦性的、辣性的、咸性的、淡性的，任何人没有办法尝出如来藏是什么味。但是我们在尝味的时候，如果心很细致，灵感智慧生出来时，就能识得祂，那就能解决生死大事了。如来藏没有味尘，但是在我们分别味尘的时候，品尝饮食的时候，舌识和意识就知道了这是酸味，这是甜味，这是苦味，这是辣味。我们如果精进地参禅，因缘时节到时，就要反观是谁在品尝酸味、甜味、苦味、辣味呢？知味是是谁？味尘是如何出现的？这样就生起了疑情，因缘具足时就能发现了其中的奥秘，明心证悟了。</p><p>（五）如来藏没有触尘，不是软的也不是硬的，不是薄的也不是厚的，不是光滑的也不是粗糙的，不是冷的也不是热的，没有渴的触尘也没有饿的触尘，没有痒的触尘也没有痛的触尘，没有累的触尘也没有轻安的触尘，我们不能触到祂。但如来藏无量劫以来都不离我们的身体，从入胎开始就一直执持着色身一秒一刹那没有间断过，直至一期生命结束，在众生生命的历史长河中祂从没有休息过，无论是触尘还是身识都不可能离开祂而能显现和运作。</p><p>如来藏时时刻刻都在不停地运作，时时刻刻都在布施给我们需要的法，祂从来不觉得累，不觉得厌烦。谁有厌烦的心行？觉知心这个假我有厌烦的情绪，能感觉厚薄、软硬、冷热、触痛，真我如来藏没有这些觉受，祂没有触尘，也不了别触尘。但是在我们触尘的时候，就能证得这个无触尘的如来藏，比如禅师们举手打人的时候，用脚踹弟子的时候，虽然这些触尘不让人感觉舒服，却能开启众生的智能，如佛法大门的钥匙，所以开悟的弟子被打被踹的很欢喜，认为捡到了大便宜，有智慧的人谁不希望被禅师多踹几脚呢？</p><p>（六）如来藏里没有法尘，法尘是与意根相对应的，意识所了别的对象。在色尘上能显现出法尘相，意根和法尘相触时，如来藏产生意识，意识就能了别是什么法了。在声尘、香尘、味尘、触尘上都能显出法尘来，五尘上显现出来的法尘，都是和意根相对应的。这样，色尘和眼根相对应，声尘和耳根相对应，香尘和鼻根相对应，味尘和舌根相对应，触尘和身根相对应，法尘就和意根相对应，六根就能触六尘，如来藏在根尘相触处产生六识来了别六尘，我们就能了知六尘的境界了。</p><p>如来藏中没有法尘，因为法尘也是法处所摄的色，是四大所组成的微细色法，如来藏无形无相，空空如也，不可能有色法，也不可能有属于色法的法尘相。但法尘也不可能离开如来藏而出现，因为只有如来藏含藏四大种子，能出生法尘。</p><p>我们打坐的时候，意根到处攀缘法尘，就牵动意识去了别，心中的妄念不断出现。如来藏从来不打妄想，也不考虑什么事情，但祂时刻配合着意根。意根一攀缘，如来藏就变生出法尘相，意根作意就引导意识去分别思惟，结果弄出很多法来。前世甚至无量世之前发生的事情，意根也能攀缘，但意识心没有神通不能相应，也不能了别。今世小时候发生的事情，比如说谁欠我一角钱，和谁吵过嘴，在打坐时突然就能想起来，平常既想不出来也不会去想这种事，因为打坐时心稍微静下来，意根对现量境界作意少了，就将过去的事给攀缘出来了。意根的攀缘性很厉害，打坐时到处攀缘，睡觉时也到处攀缘，死亡以后在中阴身里也照样攀缘执着，从不停歇。</p><p>如来藏、意根和意识，这三个识和合起来能变生万法，产生万法，第一能变识是如来藏，第二能变识是意根，第三能变识是六识，其中如来藏是出生万法的第一因，直接出生一切法，意根和意识辅助如来藏把一切法显现出来，或者是促成如来藏出生一切法。八个识当中，前五识就是雇员，负责在门前搜集情报，意根分配做什么就做什么，各负其责，只管与自己相对应的一项，不能越界。</p><p>第六识这个会计师除了与五识在一起工作，自己还有单独的工作，包括计划、打算、回忆、推理、分析、判断等等，算计来算计去，不断地给意根这个总经理出谋划策。而如来藏这个董事长不管五蕴的具体家务事，祂从总体上分配协调七个职员，意根这个总经理却到处指手画脚，具体事却一样也不能做。八个识就这样和合着形成一个集团，各负其责，往来于三界六道和十法界。</p><p>如来藏这个董事长，虽然不管五蕴的家务事，但是实质却是大小一切事情都是亲力亲为，柴米油盐都祂包办，家中所需一切祂全负责。表面上看好像祂什么也不管，像个甩手掌柜。但实际上祂却像个跑堂，随七识的缘，随得就像个跑龙套的小伙计。意根要干什么如来藏都去照办，如来藏从来没想过要做什么，祂只是随顺。虽然如来藏是随顺七识的，但一切事又是祂在掌控着。一切法都是祂弄出来的，都是祂成就的，没有祂就没有一切，祂就是一个大家长。祂的作用是非常复杂的，每分每秒每刹那都在布施供养我们，从不觉得累、不觉得烦，也不要求任何回报。祂配合五阴修福，是五阴上天享乐，祂不知什么是乐。五阴造五逆大恶，祂也配合随顺，五阴下地狱受极重的苦，祂也不了别什么是苦，但是五阴去哪里，祂就跟随到哪里，实际还是祂先去的，是祂造就的六道。</p><p>以上讲的，就是如来藏没有色声香味触法，不具六尘的内涵。</p><p>三、如来藏心中无六识界</p><p>经文：【无眼识界乃至无意识界。】如来藏没有眼识界、没有耳识界、没有鼻识界、没有舌识界、没有身识界、没有意识界，如来藏心中没有这六个识心，不能直接感知六尘境界。六识也叫作识藴，是识心的藴集和集藏作用，其功能就是分别和了别。</p><p>（一）如来藏没有眼识界，眼识是分别色尘的，如来藏从来不了别色尘。金银珠宝都摆在面前，如来藏不知道是金银珠宝，因此不会生起贪爱心，想占为己有，也就不会造作业行，没有业种也没有果报；面对肮脏之物，也不知道是污秽的，不会心生厌恶，而去躲避或者是想办法处理掉，因此如来藏对任何一种色尘相都一律平等，没有喜厌等等烦恼，不造业行。眼识所见的色尘境界，都是祂变现的内相分色法，眼识本身也是如来藏出生的识心，用来见色；而如来藏虽有见性，却不分别色法的具体相貌，不知高矮胖瘦、大小方圆和美丽与丑陋　。</p><p>（二）如来藏没有耳识界，祂从不分别声音，不管什么声音来了，如来藏也听不见，面对优美动听的音乐，如来藏不会去欣赏，也分别不出是什么音乐，不知道好听与不好听，因此也就没有喜乐和厌恶。声音是耳识和意识去分别的，音乐是意识去欣赏的，如来藏没有耳识的功能作用，因此祂不分别声尘，你骂祂，祂不会有任何反应，不会起嗔怒；如果有人赞扬祂，祂也不会欢喜，因为祂听不见就没有苦乐的觉受。祂不对六尘，不知六尘，所以对六尘境界没有任何反应。但是我们可以在听声音的时候，在分别、了知和感受的时候，能够在耳识运作的当下找到如来藏，这时般若智慧就会生出来了。</p><p>如果如来藏有耳识的功能作用，就能分清音乐的优美旋律，心就不清净，就会造作贪爱的业行，遇见恶劣的声音就会厌恶，心也不清净，就会造作业行，真心和妄心如果都造作业行，一个结果众生会发狂，果报惨重；另一个结果如来藏就会无法再正常的公平公正的运作，因果律则就要发生改变了。正因为如来藏没有耳识，即使佛来讲殊胜的妙法，如来藏也听不见，因此祂也不学佛法，祂没有眼睛不能看书，没有耳朵不能听法，没有身体不能拜佛，没有意识不能思惟，也不能依照佛法去做任何修行。但是祂却把所有的事情都圆融地做到了，祂本来就是一尊佛，具足一切法，那就不用再修行。</p><p>（三）如来藏没有鼻识界。臭味来了，祂不知道臭，香味来了，不知道香，祂是真正的香臭不分者，因此就不会在嗅香的时候造作业行，自心永远清净无染。这些香尘是谁来分别的？是鼻识和第六识一起分别的。前五识分别的时候，第六识就要同时一起分别，第六识如果不参加，五识就不能单独起作用。意识心在五尘境上分别深细的内涵——法尘，前五识只能分别粗浅的概况。比如眼看色的时候，我们眼识分别明暗和青黄赤白等显色，第六识分别长短、方圆、大小、质量、新旧等信息。</p><p>我们看人的时候，眼识识别对方的肤色和衣服的色彩等，第六识分别高矮胖瘦、男女、年龄、容貌、气质、学问、修养等等，然后再去分别对方是否学佛修行，修什么法门，修到什么程度，心性如何，烦恼如何等等。第六识分别得很细，眼识只是分别色彩，比较粗浅；我们听声音的时候，耳识只分别是动还是静，声音是刺耳的还是不刺耳的，第六识分别的就多了，声音的粗细、远近、类别、内涵、来源等等。这个声音从哪里来，什么物体发出来的，都是第六识负责分别的，第六识如果不一起分别，耳识就不能单独起作用，就是说前五识如果起作用，一定是和第六识同时一起作用。</p><p>眼识和意识同时起作用，耳识和意识同时起作用，鼻识和意识同时起作用，舌识和意识同时起作用，身识和意识同时起作用。前六识只有意识可以单独起作用，分别法尘，心里的所思所想所回忆的，是散位独头意识，还有梦中和定中的独头意识。不管前六识如何运作，都离不开第七识意根和第八识如来藏的配合。</p><p>（四）如来藏没有舌识界，祂不尝味，不分别味尘。我们吃东西的时候，如来藏没有舌识无法分别，从来不知道酸甜苦辣，因此就没有贪爱和憎厌，不会造作业行，也没有果报。谁分别这些味尘呢？是舌识和意识分别这些味尘。如来藏虽然不分别味尘，并不是说如来藏在舌识了别味尘过程中不起任何作用，如来藏有独特的了别性，否则就不会现起饮食和味尘相，也不会生出舌识和意识。所以在舌识、意识分别酸甜苦辣味的过程当中，还是有如来藏的身影显现的。如果机缘到了，那么在吃饭的时候，就能找得到如来藏，证得祂。</p><p>五阴十八界属于世间法，如来藏没有五阴十八界法，不属于世间法，我们用找世俗法的方法，找不到祂。祂虽然不在十八界里，但也从未离开过十八界，如果离开十八界，十八界世间就都灭失了。哪个界当中都有祂身影的显现，哪个界都不能离开祂。在我们吃饭的过程中，十八界都显现出各自应有的作用，每一界背后都有如来藏的执持作用，缘熟的人就容易找到如来藏，能够明心开悟。发现祂、找到祂需要十分细致的意识心行，参禅明心就是用妄心找真心，用第六识去寻觅发现这个如来藏。如果没有第六识心的现起，没有在五阴十八界上细致的观行，就不能找出如来藏。</p><p>既然妄心六七识迷惑颠倒有无明，不知自心当中有不生不灭的智慧德相如来藏，那就要六七识通过参禅去发现和证得如来藏，所以开悟就是用妄心寻找真心，开悟就是六七识开悟，是意识找到了如来藏，明白了如来藏的功能作用，意根也同时证得了如来藏，开悟的就是意识和意根。六七识心无始劫来一直迷惑颠倒，不识真理，现在找到如来藏，知道如来藏的功德和功用，就明理开悟了。</p><p>真心如来藏不用开悟，祂本来不颠倒不糊涂，没有无明，就不用破除无始无明，也不会自己再找自己，头上安头。如来藏不用修行，因为祂既不受戒、也不持戒、也不犯戒，祂不修福也不造罪，别看祂帮五阴布施了很多的钱財，这福报祂不得。虽然祂帮五阴杀人放火，那个业也不是祂造的，祂也不受那个果报。以上这些道理，如果没有修学接触过如来藏法的人，听了以后是没法接受的，真听不懂。所以学佛不修到一定程度，就不能真正信受和理解大乘法。</p><p>（五）如来藏没有身识界，祂感觉不到冷热、触痛和饥渴、温饱，不觉疲乏、轻安、舒适，不觉涩滑、顺畅、堵塞，所以如来藏不管遇到什么触尘，遇到什么舒适和恶劣的环境，心里都是如如不动的，不会被境界所转，也不会造作什么业行，自心清净。身识和意识在感受触尘的时候，如来藏只是在背后默默地配合。</p><p>（六）如来藏没有意识界，不能了别各种法尘境界，也不能回忆和展望未来，不能分析、打算、筹谋，不能调查、不能观察、不能参究、不能考量，这些都是意识的功能作用，如来藏无可奈何；如果如来藏有这些功能作用，心就不清净了，也不是自性清净心了，无法正常有序的配合五阴运行。意识心只要出现就有分别了别法尘的功能，即使在大多数定中和做梦的时候也都能了别，都有个知，知六尘境界相。如来藏没有意识性，不知五尘上的法尘，不知定中的法尘，也不知梦中的法尘。</p><p>以上所说的十八界法，如来藏都没有，祂没有这十八界的功能，但是这十八界要起相应的作用，都是如来藏配合的结果。五阴十八界本身是做不了什么事的，因为五阴十八界没有自体性，全靠如来藏维持和运营。如来藏心中虽然无十八界法，没有六根，不是六根；没有六尘，不是六尘；没有六识，不是六识。但祂又什么都有，什么都是，因为一切法都是祂出生的，都是祂的功能。</p><p>五阴虽然具足世间法，但五阴什么也不是，没有一法是真实的自己、有真实的自性存在。虽然能造作很多业行，其实五阴什么也做不了，就像是一个机器人，所做的一切，都不是自己做的，它需要人为地设计许多程序，并且有电流通过，才能被动完成一些设计好的工作，五阴也如此。</p><p>如来藏里没有五阴十八界，祂不是众生；虽然不是众生，可是众生却是祂做，离祂无众生；如来藏也不是佛，离祂也无别佛，祂什么都不是，又什么都是，什么都是祂。祂对于一切都无所谓，说祂是什么、不是什么，全然不在意。祂不会说，我就是一切，一切都是我的，祂没有这个心行，没有这个观念。如来藏没有无明烦恼，因此不用修行；五阴十八界有种种无明烦恼，因此就要修行，以离苦得乐，远离颠倒梦想，脱离众生身，成就佛道。</p><p>如来藏不学佛，也不成佛；五阴学佛成佛，但是成佛的时候不是现在的五阴十八界，早已改换无数次了，只有意根和如来藏没有改换，还是原来的那个，其余的都是新出生的。如来藏自己不成佛，祂对成佛这件事不感兴趣，对修行这件事不感兴趣。意识和意根对这事感兴趣，想要修行，想要转变染污性，知道自己流转的时间太长了，感觉太苦，不想再当众生，不想再生死流转，于是决定修行。意识感觉苦了，意根就决定修行；如来藏无所谓，修不修行跟祂没有什么关系，但离开祂的配合众生也无法修行。</p><p>明心见性时，六七识明白了一个真理，就是五阴虚妄、无生、非我，如来藏真实永恒、本来而有，不是后天出生的，意识从此不再迷惑颠倒，以妄为真了。而如来藏没有意识心的心行，又不对法尘，祂就不明白这个事实和道理，明不明心这件事跟祂没关系，祂不用找自己，不想明白自己，是意识心一直在参禅找祂，如来藏对此无所谓，但是参禅明心的这些事祂都参与了，事事无关，却又事事都参与，无为又有为，有为又无为，无为无不为。</p><p>证果断我见的时候，是第六、七识断了五阴为我的邪见，不再认为五阴十八界是我和我所有的，观念颠倒过来以后就有了正知正见，知道了五阴十八界不是我，也不异我，不相在。果位是五阴得，如来藏不证果，也不得果，如来藏从来没有我见，也不认为有个我是真实的，祂没有这个想法和观念，就不需要断除我见。祂没有觉知心的心行，没有类似五阴十八界的任何心行，没有世俗法的心行。其实如来藏还是有自己独特的心行的，只是不同于五阴世间七个识的心行。这些法证得越多，修行就会越增上，最后究竟成佛。总之，如来藏没有五蕴十八界的任何一界，如来藏不属于五阴十八界的范围，祂没有五阴十八界的功能和作用。但是离开如来藏，五藴十八界就不存在了，什么功能作用都没有了。</p></div>"
},{
    "title": "第六章 真心涅槃毕竟空寂（2）",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第六章 真心涅槃毕竟空寂（2）</strong></p><p>第三节 真心空寂无无明</p><p>经文：<strong>【（如来藏）无无明。亦无无明尽。】</strong>意思就是说如来藏本身没有无明，也不用灭尽无明。</p><p>什么叫无明？无明的意思就是不懂，不懂五蕴、不懂十八界、不懂生死轮回、不懂四圣谛理、不懂解脱、不懂涅槃、不懂如来藏、不懂成佛之理等等无数的无知，无明就是内心里的愚痴昏暗和无知。无明大略分为三种：一念无明、无始无明、尘沙无明（尘沙无明也叫无始无明上烦恼）。无明也可以分为两类：一念无明和无始无明。</p><p>二乘人所断的无明叫作一念无明，也叫作四住地无明，包括：见一处住地无明、欲界爱无明、色界爱无明、无色界爱无明。证得初果断我见，就断了见一处住地无明，再修得初禅定，断欲界爱，欲界的无明就断了。四果阿罗汉断我执以后就把色界爱和无色界爱的无明断尽，就有能力出离三界、解脱生死了。众生修学四圣谛理和四念处的观行，就能证得五阴十八界是空的、非我的，逐渐地就断了四住地无明烦恼，成为四果阿罗汉和缘觉辟支佛。若没有断我见，一种无明也不能断，对三界的贪爱全部具足，贪嗔痴烦恼全部具足，内心里都是无明，常处愚痴黑暗当中。四果阿罗汉四住地烦恼全部断尽，初果人只能断见一处住地烦恼。</p><p>无始无明，是指从无始劫以前到现在，我们都不知道有一个自性清净心如来藏是真实的自己，祂不生也不灭，出生了无量世的假我——五蕴十八界。我们从来没有证得这个心的存在，即使听圣教知道有个祂，也不知道如何修证如何成就佛道，这就是无始无明。无始无明，明心开悟的时候就打破了，但是关于如来藏的体性以及应该修证的法还是所知甚少，那么这个无始无明仍然还存在着，没有断尽，直到成佛时才能全部断尽。</p><p>打破无始无明，后面还有尘沙无明，也叫作无始无明上烦恼，就是说我们成佛路上，还有如尘沙一样多不懂的法理需要修证。即使我们明心开悟了，所知所学都还少得很，用禅宗的话说，开悟以后才打开无门之门登堂入室，内门修行才刚刚开始，还有无量多的烦恼惑需要断，还有无量多的无明需要破除，四禅八定无量神通需要修行，八个识需要转识成智，后得智道种智一切种智需要逐渐具足。还有修行路上出现的烦恼尘沙无明未修未断，修行的障碍还有很多，障碍着我们成佛，要把那些尘沙无明、无始无明上烦恼全部断尽，才能成为究竟圆满的佛。对绝大多数众生来说，这三大类无明，或者是两大类的无明都具足着，既没有证果也没有开悟，这些无明都会存在着，说明我们还是生死业障的凡夫，心还处在大黑暗当中。</p><p>与无明、黑暗相对的就是明，明就是智慧和光明。我们的七识心最初全是无明，没有智慧和光明使得我们看清事理，使我们不愚痴于一切法。而如来藏是最明的，内心全都是明，一点无明也没有，一点愚痴也没有，祂有大智慧、无量智慧、无上智慧、无等等智慧，这些智慧都不是世间的智慧，是世间七识的智慧所不能比的。整部心经就是讲般若波罗蜜多，就是讲这个没有生死的如来藏的大智慧，讲这个在彼岸的大智慧。</p><p>这个真正的大智慧，只有如来藏才具有，因此祂心里都是光明，不处于黑暗当中，因为没有无明。无明是七识的专利，其中第七识的无明是从无始劫以来一直存在的，从来就没有明过，这个无明不是后天生出来的。如果是后天所生出来的，那么生出来之前没有无明，没有无明就是佛。倘若之后无明又出现，就说明佛又变回凡夫众生了，这不符合圆觉经所说的，諸佛成佛以后永远不会变回众生之理。众生有无明时，除了做恶，还会修善，都是有所贪求，为己之利，贪求享乐。如来藏清净明慧，无欲无求，不做这些世俗有为事，但七识所做的这些俗事，实际上都是如来藏做的。</p><p>如来藏清明的智慧非常广大，五阴十八界及三界世间万法都能产生出来，祂能了知众生的七识心行，了别所有的业种和宇宙器世间。祂知道在中阴身让众生遇到什么样的父母缘，知道什么时候投胎，知道投的是什么众生的胎，什么时候变造头和四肢，变成人的还是畜生的，或者是其他众生的，祂都知道。祂知道眼睛在哪里变出来，耳朵在哪里变出来。眼睛变什么形，耳朵变什么形，鼻子变什么形，祂都知道。头发什么时候变出来，变成什么颜色和样式的，祂都知道。</p><p>如来藏的智慧无量无边，众生什么时候出生，什么时候死亡，变现众生什么样的生活环境，什么样的色身，六根具足还是不具足的，什么样的肤色，祂都知道都能变。祂知道众生的业种，畜生怀胎多少个月出生，人怀胎多少个月出生，祂都知道。这个人该得什么业报，就给他变现出相应的业报环境和业报的五蕴身出来。</p><p>祂知道该变男身还是变女身，是变天人的色身、人的色身、畜生的色身还是鬼的色身。如来藏太有智慧了，纯粹是大明，是真正的明。我们七识心能明了这一切吗？七识心处在愚痴无明当中，自己生生世世从哪里来到哪里去都不知道，就连自己的五蕴十八界的概念内涵都不知道，生生世世受苦却不知道自己苦，愚痴得无话可说。</p><p>上述说的是如来藏没有无明，都是明和智，既然如来藏没有无明，那就不存在把无明消灭这一法，不用像七识心一样，通过修行把无明灭尽，灭尽无明的法对如来藏来说就不存在了。众生无论怎样修行，也不涉及灭除如来藏的无明，只能是让七识心的无明越来越淡薄。既然如来藏没有无明，就没有分段生死和变异生死，没有生灭变异。五阴七识有无明，是不断要生灭变异的，需要灭除无明，甚至灭尽无明，才能了一切的生死，最终究竟成佛。总之，如来藏没有无明，祂也不想成佛，不需要灭无明，也就没有灭尽无明这一法。</p><p/><p>第四节 真心空寂无老死</p><p>经文：<strong>【（如来藏）乃至无老死。亦无老死尽。】</strong>意思是说如来藏永远不老，祂没有时间和寿命，也没有过去、现在和未来，祂亘古而又弥新，是个真正的无量寿佛。</p><p>一、如来藏本无生死</p><p>五阴十八界念念都在生住异灭着，色身不断变化衰老，那是如来藏在刹那刹那地输送地水火风四大种子，让组织细胞刹那刹那地新陈代谢的结果，于是我们就一点点地长大、衰老。如来藏知道众生的业种，在相应的时间段就会变现出与业种相应的色身，与业种相一致，是如来藏一点点让我们变老。五阴色身就是如来藏根据业种和各种随时变化的缘，输出相应的四大种子而产生变化的。色身变来变去，都是如来藏地水火风四大种子的功能。身体不健康了，是因为如来藏了知业种，给我们输送出不调和的四大种子。四大不调和的原因，是因为我们过去造的业，应该受的果报。如果是善业，就会感得善报，那么如来藏输出的地水火风四大种就调和，身体就是健康的，造恶业所得的果报就是身体不健康。有的人得各种重病，都是前世杀业重，跟众生结恶缘的结果。所有的业种都存在如来藏里，缘熟时业果报就现前了。</p><p>所以生死是从哪里来的？是如来藏显现出来幻现出来的，没有如来藏就没有生死，但如来藏是随顺众生的生死业种来变现一切法，完全随缘，不做主宰。但有些小病不一定是前世的业造成的，也许是由于外界的因缘转变，如来藏因应这种转变，四大暂时不调和，就出现了疾病。这个不调和，是如来藏输送的种子比例结构改变，色身的某部分状况就改变，也是自己感召的。健康与疾病也是唯识所变，唯如来藏、意根、六识，三个能变识和合变造，就会出现五阴色身的各种病症。</p><p>一切法都离不开能造一切法的识心，这就是万法唯识。比如：发怒生气、上火生病等种种法，都是自己的识心造的。遇到同样的事情，别人不上火你上火，心态不同，显现的相就不同，感受就不同。五阴色身在念念之间变老，是如来藏随顺业缘而现出的相。祂知道什么时候长白头发，什么时候长皱纹，什么时候身体功能衰退，什么时候死亡，祂都知道，意识觉知心却无法了知。</p><p>如来藏不老，也不年轻，因为没有寿者相。祂既不是小孩，也不是成人或老人。说祂100岁不对，一万岁不对，无量岁也不对，因为祂一直存在着，永远也不死。我们修行成佛需要三大无量数劫，这个无量劫还是有量的，因为最终能够成就佛道。一旦成佛，无量数劫就结束了。而如来藏真的没有量，祂没有结束的时候，永远也不会断灭，所以就不能用个量来比对祂。</p><p>西方极乐世界阿弥陀佛也叫无量寿佛，阿弥陀佛虽然是无量寿的，祂的寿命也是有量。当阿弥陀佛在极乐世界的缘了时就退位，然后由观音菩萨接任其位做佛。所以阿弥陀佛的寿命还是有量的。祂退位之后，会到其祂的有缘佛国土继续做佛，并且可以同时在无量的世界里做佛度众生。释迦佛就有无量个佛国土，祂有无量个应化身、无数分身，在无数的国土度脱众生。成佛以后，佛是不会灭亡的，也不会再变回众生，这是绝对不可能的，祂只是换个佛国土来利乐众生。</p><p>释迦佛的庄严报身，现正在色究竟天为那些初地至十地菩萨说法，那个报身佛的寿命700万阿僧祇劫，我们成佛才需要三大阿僧祇劫，佛的报身有700万阿僧祇劫那么长的寿命。虽然这个时间很长久，但还是有尽的，尽了以后怎么办呢？还有更多的佛国土要去住持。为什么有那么多国土呢？因为如来藏无形无相、没有界限，佛国土和佛的分身就无量无边。</p><p>既然如来藏没有老死，就不存在灭掉老死的这个法了，也就是无老死尽了。五阴的老死是因为有如来藏，祂能够显现五阴所造作的生死业的果报。生死的出现，是因为凡夫众生有生死的业缘。没有生死业的菩萨们，发出永远不入无余涅槃的清净大愿，如来藏就会随顺于这些业缘和愿力，为众生显现出这些生死的假相。既然如来藏没有老死，就没有老死尽这一法，就不需要把老死的现象给消灭掉。五阴七识修行的目的是想让五阴永远不老不死，不受老死的系缚，而如来藏没有长生不老的想法，祂本来就长生不老，没有念念变迁的时间流逝相，没有生灭代谢，永远不老不死、不会灭去。</p><p>二、依十二因缘灭老死入涅槃</p><p>无明和老死的相关内容就是十二因缘法，是辟支佛所修的中乘法。辟支佛又分为缘觉和独觉，他们有什么区别？独觉辟支佛因为生生世世修道，善根非常深厚，在没有三宝住世的时候，他能够发起修道心，看见世间的一个生灭现象，他就警觉起来，认识到世间这些生灭现象肯定都是有因缘的，于是就去山中探究这些生灭现象的来龙去脉，于是就解决了生死的大问题。</p><p>（一）顺推十二因缘法</p><p>独觉辟支佛一个人在深山里修道时，他观察发现，每一个法都是因缘所生，推究十二因缘的每一支，他就悟得了缘起性空，因缘所生法即是空。他断尽了一念无明，断了意根的我执，就把自己灭掉涅槃了。缘觉辟支佛生在有佛之世，他随佛听从教导来修行，参究了十二因缘的每一个生起支和还灭支，证得缘起性空。</p><p>十二因缘法的十二个生死链条：无明缘行——行缘识——识缘名色——名色缘六入——六入缘触——触缘受——受缘爱——爱缘取——取缘有——有缘生——生缘老死忧悲苦恼。</p><p>1、无明：就是不明，就是愚痴。前面已经讲过，这里不再重复。</p><p>2、无明缘行：十二因缘法就是十二个生死链条，因为所有众生都有无明，有无明就要造作各种身口意行，所以整个链条是由无明引发的。无明缘行，这个“缘”指的是产生、生出、牵引、引发的意思。身行就是身体的行为造作，口行就是各种语言造作，意行就是各种心行，心里的各种思想念头。无明不断，身口意行造作就不会停止。</p><p>3、行缘识：身口意业不断造作的同时，必然要牵涉六识不停地了别、不断地运作。因为六识不肯寂止，意根也就攀缘执着不断，意根断不掉执着性，就不能灭掉自己。</p><p>4、识缘名色：七转识要能正常运作，必须依赖色身。这样死后就会有中阴身出现，在中阴身里，意根不肯灭掉自己，还执著色身，于是就拖着第八识去投胎。投胎以后，就有了受精卵，名色五阴就逐渐产生出来了。因为无明而有了下一世的名色，这就是无明缘行、行缘识、识缘名色的道理。</p><p>5、名色缘六入：在投胎到受精卵里的一刹那，前六识都灭了。意根和第八识入胎，意根是名，受精卵是色，这就是最初的名色。如来藏吸收母体中的地水火风四大元素来变生受精卵，于是受精卵逐渐发育长大，就会生出头、四肢和五脏六腑，身根慢慢成形以后，眼根、耳根、鼻根、舌根也都变生出来了。六根具足以后，如来藏就能通过六根把外六尘传入内六根，变现出内六尘相分，这样六入就产生了，这就是名色缘六入的原理。</p><p>6、六入缘触：如来藏在胎儿四五个月的时候，就能产生意识，当六根和六尘相触的时候，如来藏就会产生出六识，六识能触六尘相分，这就是六入缘触。</p><p>7、触缘受：六识触六尘就会生出感受，眼见色有受（胎儿发育到一定的阶段，能对光的明暗有感知），耳听声有受，鼻嗅香、舌尝味、身觉触、意思法都有受。这就是触缘受。</p><p>8、受缘爱：受分为苦受、乐受和不苦不乐受，六识有受就会产生贪爱的思想情绪，这就是受缘爱。有时候众生对苦受也会生起贪爱，为什么呢？因为意根的体性就是执著一切法。比如说我们这个娑婆世界五浊恶世是这样的苦，世尊劝众生求生西方极乐世界，很多人还不愿意去，年龄大的人，告诉他赶快发愿求往生，他就会说我还有事没完成，等我把事情做完了我再求往生，一直等到临终也没有做完事情，仍然是牵挂不舍。</p><p>我们这个世界这么苦，极乐世界那么乐，众生都没有真心求生极乐的愿望。众生这个心理状态就是无明，因为无明而贪爱，乐的时候贪爱，苦的时候也贪爱，就是因为意根的无明执著，才贪爱眼前的生死尘劳。我们娑婆世界是这样的苦，无数众生还是贪恋不舍，不想出离，就是因为无明深重，这就是受缘爱。</p><p>9、爱缘取：有感受就会产生贪爱，贪爱产生出来以后，众生就会执取抓取所贪爱的一切境界，总想拥有、占有一切人事物理。只要没有修得三果四果的境界，众生都会有贪爱，只是贪爱的对象、范围和程度不同而已。而那些修出禅定或者是已经证了果的人，命终没有能力入涅盘，也都是因为有贪爱和意根的执著，贪爱没有断尽，或者贪着色界、或者贪着无色界的各种禅定境界，就不能出离轮回，解脱生死。众生有贪爱以后一定是想得到、占有、执取、抓取，这样的话，三界世俗法就会源源不断地产生出来，众生就会在这里生生死死如旋火轮，轮转不息，这就是爱缘取。</p><p>10、取缘有：有取就会产生三界有的法，这就是取缘有。我们生活的三界世间因为意根的执取不断，就这么产生出来了。如果我们不再贪爱和执取，这些世间法就不会再出现。</p><p>11、有缘生：我们贪爱执取了以后，就有欲界、色界、无色界的三界世间，有了生存的环境和空间，我们的生命才会出现，才能在这里生存下去，这就是有缘生。</p><p>12、生缘老死忧悲苦恼：生命出现了以后，就有老病死忧悲苦恼，无量无边的苦恼就都出现了，这就是生缘老病死。</p><p>众生有五阴的出生，有这些三界生活环境的产生，其根本原因就是我们内心有无明。如果无明都灭了，对三界的贪爱就会灭尽，就会像阿罗汉和辟支佛一样，有能力入涅盘，灭掉全部的五阴十八界不再出生，就没有三界当中的任何一个法的显现，三界里的一切事情就结束了。</p><p>（二）反推十因缘法</p><p>上述是辟支佛所修证的顺推十二因缘法，还有一个反过来逆推的十因缘法，就是从生老病死往回推，一直推到生命的源头如来藏。</p><p>我们的生老病死从哪里来的？为什么有生老病死忧悲苦恼呢？辟支佛就思惟，因为有这个生命体——五阴的出生和存在，就有老病死忧悲苦恼。这就是“老死缘生”；</p><p>他们又思惟，生命体是从哪里来？是因为有这个三界的生存环境，生命体才能出生，这就是“生缘有”；</p><p>三界的生存环境从哪来？是从执取三界法，抓取占有三界法的心行上来，这就是“有缘取”；</p><p>因为什么产生了执取呢？因为贪爱三界法才有执取，这就是“取缘爱”；</p><p>因为什么会产生贪爱呢？是因为对触的法有感受就有贪爱，这就是“爱缘受”；</p><p>因为什么有感受呢？是因为六根触了六尘，知了六尘，这就是“受缘触”；</p><p>因为什么有触，触是从哪里来的？是因为有六入，这就是“触缘六入”；</p><p>因为什么有六入，六入从哪里来？是因为有受精卵名色才有六入，这就是“六入缘名色”；</p><p>受精卵名色从哪里来？辟支佛推测一定有一个本际——入胎识来出生名色。于是得出一个结论：识缘名色，名色缘识。</p><p>顺观十二有的生死链条为流转门，有此即有彼；逆推十个有支，寻找老死的根源，灭此先灭彼，就是还灭门，推到入胎识阿赖耶识（如来藏）以后再也推不动了，因为如来藏是一切法的本际和源头，一切法都不能过彼，所以只能齐识而还，到阿赖耶识如来藏这里为止，没有再能产生阿赖耶识的法了，如来藏先天地之先。如来藏产生名色，名色和如来藏有一种互相依赖的关系，名色离开如来藏就不能出生和存在了，如来藏离开名色也无法显现，因为离开名色就找不到如来藏了。</p><p>十二因缘里行缘识、识缘名色的这个识，是生灭的六识。逆推的十因缘，识缘名色、名色缘识的识，是指入胎识——如来藏。名色从如来藏来，没有如来藏不会有受精卵，没有受精卵就没有名色，没有名色就没有六入，没有六入就没有触，没有触就没有受，没有受就没有爱，没有爱就没有取，没有取就没有三界的有，没有有就没有生，没有生就没有老死忧悲苦恼。</p><p>这个顺推和逆推的因缘法，是独觉佛在深山里修了很多年才证得的，他们都有出离心，都想灭苦，心很清净，禅定非常好，所以观行思惟都很深细。如果我们来修十二因缘法，就要比过去世的辟支佛付出更大的代价，花费更多的时间和精力。因为我们的根基太差，出离心很弱，求取解脱的心不坚固，禅定不太好。如果菩萨明心以后再从大乘法的角度，把十二因缘法细细的思惟，细细的推证，那时候所获得的智慧是要超胜于辟支佛的。同理，地上菩萨再来观行四圣谛法，所获得的大乘四圣谛的智慧，也是阿罗汉无法比拟的。因为二乘人不证实相，只能在蕴处界观行，所获的智慧只能算是世俗谛，而大乘的四圣谛法和因缘法是甚深极甚深的。</p><p>独觉佛善根深厚，在没有佛、没有法、没有圣僧出世的情况下，自己到深山修行，思惟推证，就证得独觉佛的道果。然后六种神通显现，在空中飞行，自由来往。他们度众生，主要是以神通为主，众生看到辟支佛的神通是这样的广大，就很羡慕，发心跟随修道，辟支佛就是这样度人的。因为在深山里修了很多年，他的禅定是相当高的，证了果以后，神通马上出现，就能感化其他有缘众生进入佛法里修行。</p><p>辟支佛证得了识缘名色、名色缘识之理，了知是如来藏借助于各种缘而产生了名色五阴，之后就有了生老病死各种现象，证得了一切法都是因缘所生，没有自性，缘起性空。于是就断尽了我见我执的烦恼，证得辟支佛果位，世间缘尽时，就取证了涅槃，离开这个三界世间。阿罗汉、辟支佛寿命终了都会去入无余涅槃，因此阿罗汉和辟支佛不会留在人间传解脱道的法门，他们都不想留在世间传法度群迷，除非七返人天的初果人从天上回到人间的时候，根据自己所修证的四圣谛，随缘传法度众生，或者是一往来的二果人回到人间时，只能在一生中传授四圣谛法，然后就涅槃，声闻三果人后世去五不还天受生，然后再入涅槃，也不能弘法度众，只有开悟的菩萨才能生生世世弘法度众生。</p><p>如果众生都只学小乘、中乘法，没有慈悲心，只想个人得解脱，不怜悯众生，到最后这个世间就没有传法的人了，没有圣人来传法弘道，所有众生都会处在无明大黑暗当中，不得解脱。菩萨有悲心，发誓永远不取涅盘，不取灭度，生生世世在这个三界世间自利利他，传法度人，自己也勇猛精进修行。最后不但自己成就佛道，也带领众生一起迈向成佛之路，这就是菩萨的品格！阿罗汉和辟支佛的心量远远不如菩萨的心量，他们只管自己离苦就好，众生出不出这生死苦海就不管了，只要自己能出离三界就行。但是他们入了无余涅槃以后，将来缘熟时，还是要从涅槃境界里出来，回到娑婆，回心于大乘，修学大乘，再广度无量众生。</p><p/><p>第五节 真心空寂无苦集灭道</p><p>经文：<strong>【（如来藏）无苦集灭道。】</strong>苦集灭道就是“四圣谛”解脱道的义理，它包括：苦的真理、苦集的真理、苦灭的真理、苦灭道的真理，谛就是真实义理。这是众生的五阴七识应该修行的法，如来藏不用修行，因为如来藏无苦集灭道。</p><p>苦諦就是关于世间苦的真理，包括三苦、八苦、无量的苦。三苦有行苦、坏苦、苦苦。八苦有生、老、病、死忧悲苦恼、求不得苦、爱别离苦、怨憎会苦、五阴炽盛苦，然后从这八苦当中，又衍生出无量无边之苦。我们的苦太多了，如果是有智慧之人，仔细分析世间法里没有一处是不苦的，处处不自在，处处是苦恼，可是众生还是贪恋着这些苦，不想学佛修行求取解脱。</p><p>苦是如何出现的呢？这些苦是我们收集、积集造作的身口意业所感召的。身口意业造作的当下，如来藏就把业种收藏，收藏以后，业缘成熟时如来藏输出业种，苦果就现前。苦是众生无量劫累积的身口意业行所感召的，众生生生世世造恶业，生生世世受苦报。学佛修行就是要让大恶业的缘不具足，让恶业种子渐渐萎缩，将来受点小的果报，就把大的恶业消灭了；或者是修到有能力承受时再受，那就轻松了。比如证小乘初果，断了三缚结，就把无量劫的三恶道业消灭了，只在人中受点小苦就代替了。众生无量劫造作的那些业，如果一一都要受报，到成佛时无论如何也受报不完，只能是在我们修行得力时消除一部分恶业，证果时消一部分，开悟时消一部分，入初地时消一部分，念佛得三昧时再消一部分，念经念咒时又消一部分，但还是有无量的业种子存留在如来藏里，将来缘熟就要受果报。</p><p>众生生生世世都在受业报，即使行菩萨道的时候也要受一些业报苦，受过之后业缘就了，成佛之前要将所有的业障都消尽。我们修行就是要灭去大的恶业种子，让善业大于恶业，让苦报的因缘始终不具足，让善业的因缘不断增上，就能总受善报，长此以往有些恶业种子就萎缩了。修行越精进得力，恶业就消得越多越快，所有的恶业都消尽就成佛。</p><p>有些造了阿鼻地狱业的人，下品下生到了西方极乐世界，在莲花里要住极乐世界的十二个大劫，住那么长时间，就是在消那些地狱业种，让那些贪嗔痴烦恼永不现前。长时间没有恶业现前的缘，恶业的种子就萎缩了。也由于长期没有造恶业的缘，贪嗔痴烦恼就渐渐地压伏下来了，心渐渐清净时，就从莲花里出来，面见化菩萨闻法。在极乐世界十二大劫的时间等于娑婆世界多长时间呢，真没法算，因为极乐世界的一天，就相当于我们这个世界一个大劫。由于深重的恶业，这种人花开不能见佛，只能看见菩萨的化身为其说法。</p><p>众生所受的种种苦，都是如来藏收集造业业种，缘熟让业种现行所感召出来的。要想灭掉这些苦，就要修学八正道，八正道就是：正语、正业、正命、正行、正思惟、正精进、正定、正念。大小乘法都要修八正道，但在内涵和层次上有一些差别。凡夫众生在没有修学正理之前，大多数的身口意行都是不正的，所以才需要修行八正道，修好证果以后才能灭苦。我们应该对照佛的教导，对照八正道经常反思检查自己。众生在还没有证果、没有明心开悟的时候，身口意行有极多的不正，所以才有苦受，都是因为我见重、我执重，因我造作恶业感召的。</p><p>如来藏为什么没有苦呢？因为如来藏从来不造作善恶业，就不领受善恶果报，因此就没有苦报，不受苦；如果有苦，如来藏就不是清净的了。如来藏既然不造作烦恼业，也就不会集聚自己后世的苦，不会招感后世的苦受。因为如来藏没有苦和苦集，祂就不用通过修道去灭苦，祂就没有苦灭谛和修道谛，不需要修苦集灭道四圣谛法。如来藏所收集的是众生五阴业行的种子，祂自己本身没有业行，就没有业行的种子，就没有集。八正道是五阴身要修的，如来藏从来不走邪路，因此不需要修行八正道，祂一切法都圆满具足。</p><p/><p>第六节 真心空寂无智无得</p><p>经文：<strong>【（如来藏）无智亦无得。】</strong>这个智是指世间的智慧和修学出世间法的智慧，是七识心所具有的，是七识心对于世出世间法的认知和理念，是对于六尘境界的了别智慧，是七识心所修所学得到的智慧，不是指如来藏的本觉智慧。</p><p>如来藏没有这种世间智慧，因为祂不对六尘，不识六尘，祂本来不在世间里，本来就在彼岸。七识的智慧有生灭，与如来藏本具的不生灭的智慧大不相同。我们在世俗法当中搞发明、搞创造、搞研究，如来藏不懂这些，祂从来都不屑一顾。我们的五阴色心学手艺技艺，如来藏不懂也不学。我们的意识觉知心学一些大学课程、研究生的课程，如来藏不学也不懂，世间法的智慧祂一样都没有。</p><p>意识觉知心有这样的智慧，读书学习，可以学到博士后，搞研究发明创造，能制造飞机、火箭，这个心有时候的确是聪明多智。意识心还能学佛法，明心见性，证得无我的大智慧，这些智慧如来藏不感兴趣，也不具足，但是意识心的这些世俗智慧都来自于如来藏的支持。如来藏所具有的大智慧，不是世俗法方面的智慧，祂的智慧境界是本有的，不是修学来的。比如输送地水火风四大种子，创造色身、创造山河大地、花草树木、创造宇宙星空。祂有这些智慧，祂知道什么时候，在什么地方，变生什么样的东西，是山川河流，还是金银铁矿，祂的智慧在于此。祂还能知道你的心思，知道以后就会配合你，无论是打妄想还是修禅定，祂都能配合你，祂的智慧与意识觉知心不同，是不可思议的。正因为如来藏的本觉智，与我们五阴识心的智慧存在根本不同，如果按照世俗方面的智慧标准去找如来藏，就无法找到。</p><p>我们的五阴身心因为有生死轮回之苦，就要修小乘解脱道和大乘成佛之道，通过修学，我们的意识心有了四圣谛八正道的解脱智慧，乃至有了般若的总相智、别相智甚至道种智的大乘解脱的智慧。但这一切智慧，如来藏都不修、不学，祂与一切世间、出世间、世出世间的智慧都不相应，祂不需要修学解脱的智慧，祂本身就解脱，一切解脱的智慧依祂而有，祂本身没有任何系缚。</p><p>如来藏也无得，对于一切法祂都不得，因为祂圆满具足一切法，并不缺少什么。五阴身心因为贪求世俗法，才会得到各种名闻利养；追求解脱才会得到二乘菩提的智慧；修学大乘佛法，才会得到菩萨位乃至究竟佛位的果报。有所得是五阴七识，但实际上五阴什么也没有得到，所谓有所得，只不过是一个虚妄的假相而已，就像一个幻化的游戏，没有实质。得，只是一个名相，没有真实性。</p><p>如来藏对世间法和出世间法的一切，都不取不得，众生成佛了，祂还是祂。祂其实是真正的佛，这个佛不是修出来的，如果是修来的，就是有所得法，就是生灭法。比如说学佛修行，获得智慧和解脱，是五阴身心得智慧和解脱，与如来藏没有关系，祂本身没有系缚，既有智慧又是解脱的，佛的果位祂也不喜欢，世间法和出世间法的一切，祂都不取不得。如来藏也不得佛的果位，如果祂得佛的果位，那么祂就不是本来的佛，是后天修出来的佛，这就有违佛意。</p><p>五阴可以拥有一切世俗法，可是无论五阴自身还是五阴所拥有的法，都没有自体性，全部是空幻虚妄的，如镜花水月。五阴的有和如来藏的有完全不同，如来藏本身是空还是有呢？祂既空又有、非空非有、空有不二。说祂空，祂无此无彼，三界世间的一法都没有；说祂有，祂含藏一切法种，能变生万法，功能德用无量无边、不可思议。</p><p>一切法如来藏都没有得，但祂能依据各种缘，变现或显现出这些法。如果缘不具足，或者相应的缘消失了，如来藏就不会出生和显现任何法。比如阿罗汉入了无余涅槃，出了三界，与三界世间的缘都断尽了，那么阿罗汉的如来藏就不再变现任何法了，自己就处于完全寂灭的境界。</p><p>以上所说，就是如来藏无智亦无得的体性。</p></div>"
},{
    "title": "第七章 大乘贤圣所证涅槃",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第七章 大乘贤圣所证涅槃</strong></p><p>经文：<strong>【以无所得故。菩提萨埵。依般若波罗蜜多故。心无挂碍。无挂碍故。无有恐怖。远离颠倒梦想。究竟涅盘。三世诸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。】</strong></p><p/><p>第一节 如何证得无所得的如来藏心体</p><p>经文：【以无所得故。菩提萨埵。】前面已经讲过，“无所得”是指如来藏这个实相心一法也不得，无论世间法还是出世间法一律都不得，祂是真正无所得也无所着的心。菩萨们证得这个无所得的心，明心见性以后，就叫作菩提萨埵，就是已经觉悟的有情。如果没有证得这个无所得的如来藏心，仍然是凡夫菩萨，因为没有觉悟大乘菩提，就不是菩提萨埵。菩萨随着修行的深入，其觉悟的程度就会越来越高，觉悟的内容越来越深、越广、越细，究竟圆满的觉悟，就是佛了。佛具足一切种智，世出世间法没有一样不了知，全部都证得，却全部都不得而得。</p><p>如来藏为什么是无所得的心呢？上一章讲了祂无所得的体性，祂确实是无得的，一法也不得。这世间五蕴六尘万法，三界中的法，如来藏从来不得。为什么不得？第一、祂对六尘没有七识那样的见闻觉知性，没有七识那样的分别、了知性，因而对一切都没有觉受，没有受就不能得；第二、祂心中不念任何法，因此也就不得任何法；第三、祂没有贪求之心，心中不执取、不希求、不追求任何法，祂本身又是圆满具足一切法，并不缺少什么，因此就不需要从外得；第四，一切法对于如来藏来说都没有用，祂用不着任何一个法，不用就不得；第五，因为如来藏是空相的心，一切法都无处安置，无处可放，因此如来藏不得一切法；第六，如来藏心是清净的，如果有所得，心就不清净了。如来藏不得三界世间任何一法，也从来都没有得过什么，是一个真正清净的无所得心。</p><p>有所得都是有觉知的妄心体性，因为觉知心对一切法有欲求、有需求、有念想、有执取，可以用各种策略手段去抓取，才会有所得；一切法对于有觉知的心有用处，妄心能用一切法来满足自己的需求，用得着一切法，所以妄心七识才是有所得的心。比如说钱财、家亲眷属、名声、权势、地位、田宅、房屋等等六尘境界，这些都是觉知心得，觉知心受用的，但对于如来藏来说就没有用处。即使是人间极富极贵的国王或王子，也是五蕴身做，如来藏不做国王太子，祂也不做官、不发财、不要名声、不搞财色名食睡。世出世间法一样祂也不得，就连佛的果位祂也不得，即使我们给祂起了名字叫作真如，祂也不得真如名，祂从不希求任何名声、权势、地位和果位。</p><p>如来藏不图名闻利养和财色名食睡，不图一切法，证得这个无所得的心，就是一个觉悟的菩萨摩诃萨。菩萨分为五十二个阶位，凡夫菩萨的十信位，主要修行对佛法僧三宝的信心，对三宝生起清净信，信自己也有真如佛性、也能成佛，具足清净信，十信位修完，进入十住位修行。</p><p>十住位刚开始主要修六度波罗蜜。初住位主修布施波罗蜜，为未来明心见性积累福德资粮。六度以布施波罗蜜为首要，为初住位的正修，布施波罗蜜能积累大乘证悟的福德，福德是修行的基石，以此就能踏上菩萨道的所有阶梯。二住位主修持戒波罗蜜，严持五戒八戒菩萨戒，无有毁犯，这样心就能逐渐清净下来，禅定就会出现，渐具菩萨的心性。三住位主修忍辱，不仅忍于人事的纷扰，更要忍于甚深的法义。四住位主修精进，对于布施精进修持，持戒精进修持，忍辱精进修持，禅定、般若也都要精进修持。</p><p>五住位主修禅定，这个禅定就是指四禅八定，也通外道的禅定，修到无论静坐及行走时，都能摄心一境，心不外缘，有此定力才有能力参禅、思考法义、观行取证。明心见性需要具备一定的定力，至少要修到未到地定具足，以此定力来做相应的观行、思惟和参禅，才能断我见和明心见性。一般学佛参禅人都把禅定当作禅来修，误以为打坐就是参禅，靠打坐修定就能开悟。实际上打坐修定，只能深入定境，定而不参，有定无慧。单纯修定只能让意识心静止下来，减少思虑，从而让身心得以休歇。真正的禅是指佛心——真如、般若、如来藏，祂是成佛的主体识，禅宗宗门就是参禅证悟这个禅心，通过参禅明了这个心，证得这个心，离开这个心就没有禅，也不是禅了。打坐静坐修的是禅定，外道也修四禅八定，却没有般若这个禅，所以禅定是指四禅八定。五住位修禅定，具足了最基础的未到地定，就可以观行五蕴十八界的虚妄，观行成功就能断我见，证得了初果须陀洹，这样离明心见性就不远了。</p><p>六住位主修般若智慧，修学如来藏的般若之理，包括六百卷大般若经，以心经和金刚经为主，熏习般若正知见，六七八识的体性都要学习了解，明了真妄心的差别，为开悟明心做好准备，不至于悟错，把妄心当作真心来悟就误会了。六度都具足了，因缘时节一到，就能证得无所得的如来藏心，成为觉悟的有情，或者是能够觉悟有情的菩提萨埵。当我们断我见或者明心证悟如来藏的时候，就知道五阴本来虚幻，造作的业行也虚幻不真，三缚结一断，三恶道的业就消了，未来可以永远不下三恶道。但是菩萨因为慈悯众生，可以示现在三恶道里受生，以度堕落在三恶道的有缘众生，释迦牟尼佛在因地里修菩萨道时，就曾做过鹿王，所以菩萨都是以慈悲心而入三恶道的。</p><p>有个禅宗公案，讲的是沩山灵祐禅师开悟了以后，对弟子们这么说：百年以后，我要到山下做一头水牯牛。菩萨明心见性以后，本来不下三恶道了，沩山禅师为什么要去做头水牯牛呢？他说：我做这头水牯牛时，在这头牛左胁下写“沩山僧某甲”。沩山禅师接着就问了：你们看看这头水牯牛，你们管牠叫水牯牛，还是叫沩山灵祐啊？如果叫作水牯牛，左胁下却写着沩山僧，如果叫作沩山僧，却是一头水牯牛，到底叫作什么为好呢？</p><p>那我们就想一想，沩山灵祐禅师是谁做的，水牯牛又是谁做的呢？到底叫什么？把这个问题真正弄懂了就开悟。水牯牛的左胁写着沩山灵祐禅师的名字，如果额头上再写一个沩山禅师前世的名字，每一世的名字都写在牛身上，就是把身上都写满了也写不完，因为过去有无量世的五蕴身，五蕴身不断变换，但如来藏却只有一个，从未生灭。</p><p>这是讲明心证悟以后，因为断了捆绑在自己身上的三恶道结缚，就不去三恶道受报了。三恶道的业如何消才快呢？只有证果开悟，获得无生忍或者是无生法忍以后消业才快。我们无始劫以来的恶业太多了，要是把那些恶业都用受报的方式消灭，永远也消不完，因为恶业太多了，造业的时劫也太久远了。一句诽谤三宝的语言一出口，就会在地狱受多劫的恶报，何况每个众生在一生里不知道要造多少身口意恶业。</p><p>我们修行得力证了果时，就会消去三恶道业。虽然不去三恶道受苦，但还是会重罪轻报，要在人中受一些余苦。再有其它的恶业，证得初地无生法忍时又消一部分，二地、三地、四地都在逐渐地消业，到最后所有的业都消尽，无明也断尽才成佛，有不善业就不成佛，无明就是业，等觉菩萨的无明断尽就成佛了。</p><p>菩萨明心开悟证个无所得的心，就叫作菩提萨埵，从明心开始一直到等觉妙觉都叫作菩提萨埵。这样十住位修行圆满了，证得如幻观；还要修行十行位，证得阳焰观；十行位修圆满了，再修十回向位，十回向位修完，证得如梦观，生起一分道种智，就进入初地。修完初地内容，又证得镜像观；之后进入二地，修完又证得光影观；之后进入三地证得如谷响观，然后，其无生法忍的智慧地地增上，最后成为等觉菩萨；等觉百劫修相好，圆满了以后就成为妙觉菩萨，这就是五十二个阶位。妙觉菩萨就在兜率内院等着因缘成熟，到人间八相成道，就成为究竟圆满的佛，菩萨道佛道修行就是这个次第。</p><p>菩萨要成为圆满究竟的佛，必须经过三大阿僧祇劫的修行，如果不精进，那么三大阿僧祇劫就是实实在在的三大阿僧祇劫，如果我们精进的话，就用不着那么长时间。你一天时间的精进，也许就跨越了一劫甚至更长时间，有人用一天时间就明心见性了，有人修了很短的时间就证得初地、二地、三地、四地，还有更快的，比如善财童子一生成为等觉菩萨，龙女八岁就成佛，真是大精进。</p><p>精进的内容就包括菩萨的六度波罗蜜，以及戒定慧三无漏学的修行。每一个层次的内容不修圆满，修行就停滞不前，果位也不会提升，就像十信位，有的人一劫就修完，有的人就得修一万劫甚至更长久。每个人的善根福德、因缘条件不一样，修行的时间长短就不一样，所以这五十二个阶位，有人用了很短的时间就过去了，有人就得足足用三大阿僧祇劫。</p><p>每个人的福德不同、智慧不同、禅定不同、修行的精进度不同，那么修行所用的时间长短就不同。比如说这个人内心非常的贪吝，他就不肯布施修福，一提布施，他就感到头疼不耐烦，甚至起嗔恚心，那么他就总处于信位阶段。即使到了初住位，这个初住位的内容也总是修不完，布施的精进度不够，这个阶段就不容易越过去，修行时间就会非常漫长。别看他好像懂一些佛法道理，其实是皮毛，很浮浅，福报不具足，他就理解不透彻，更不能证得，他的修行就卡在这个弱点上，攻不破这一关。</p><p>众生无始劫以来都是很贪吝的，因为贪吝，每一世都会贫穷困顿，苦不堪言，却不知道为什么是这样；每个人都希望自己荣华富贵，生活舒适自在安乐，因为自己的这个贪吝心，却不能如己所愿，众生没有智慧，认识不到这一点，就是因为无明太重了，有些有权有势的人，一辈子都在贪，贪得无厌，一亿不够要百亿，结果活着的时候进监狱，死了以后下地狱，世世无明，世世痛苦，所以精进修行的第一度就是布施去悭贪心。</p><p>明心以后，菩萨要转依于所证得的无所得的真心如来藏，进入内门广修菩萨六度万行，要发广大心自利利他，依照诸佛的教导精进修集智慧福德，力求快速修完菩萨的五十二个阶位。</p><p/><p>第二节 菩萨依无生死的如来藏才能渐渐无挂碍</p><p>经文：<strong>【依般若波罗蜜多故。心无挂碍。】</strong>菩萨证悟后，依靠如来藏这个大智慧心的缘故，就能到达无生死的涅槃彼岸，从此心中再也没有挂碍了。每个众生的如来藏本来没有生死，不在有生死的此岸，所以叫作波罗蜜多。菩萨修行六度波罗蜜，为的就是渡过生死苦海，到达涅槃彼岸。但戒经中说：有人修行六度有波罗蜜多，能到彼岸；有人修行六度没有波罗蜜多，不能到彼岸。为什么这样讲？因为能不能到彼岸，关键在于以什么心来修六度。</p><p>证悟后的菩萨，有了般若波罗蜜多为依靠，心中慢慢就没有挂碍了。因为自己的如来藏本来没有生死，生生世世的五蕴身虽然有生死，但五蕴不是真实有，包括生死也是虚妄的。五蕴十八界的生住异灭是幻化的假相，但也是如来藏的涅槃相，五蕴虽有生死，但菩萨能依止于如来藏，逐渐汰除染污种子，最终能够灭掉五蕴的分段生死。菩萨不仅能灭除分段生死，还能灭除变异生死，从而达到无生无死的究竟涅槃。菩萨知之证之，不会再考虑死后怎么办，受苦怎么办，对这个生死问题就没有挂碍了，不再害怕有生死苦，也不会想如何活得更舒适自在，依广大愿力勇猛无畏地来往奔波于六道之中，救度有缘众生。</p><p>菩萨证悟以后，七识心转依于如来藏时，就不再挂念五蕴将来要如何离苦得乐，要如何获得一切世俗法方面的利益。因为如来藏是真正的自己，祂本具足一切法，也不需要任何世间、出世间法的利益。如来藏自性清净常住涅槃，五蕴本是祂所幻化的，就像大海里的泡沫，沤生沤灭，而大海从来没有生灭过，其水也不增不减，泡沫灭了又会生，有海水总会有泡沫存在。大海就是众生的如来藏，泡沫就是众生的五蕴。所以真正依靠如来藏的时候，五蕴也就没有生死了，因此菩萨也就不会挂碍生死。</p><p>既然真我如来藏没有生死，不在六道里轮回，祂就没有苦了，依止这个真正的我，菩萨还有什么可挂碍呢？所以成为大乘菩萨以后，就不会畏惧五蕴的生死，发愿生生世世都取一个色身来广利众生、自度度他。菩萨要这样想，反正我本来是没有生死的，也不会落在三恶道中，更没有苦受，不如就幻化无数个色身来普度众生吧！</p><p>通过修行菩萨道，菩萨五蕴身虚妄的苦受越来越少，最后都能灭去。菩萨因为广行菩萨道的缘故，福德越来越广大，色身受用越来越自在，在大众中越来越有威德，不害怕在六道里现身度众，不会为了个人的享乐而不顾众生，就能没有后顾之忧的广行菩萨道。没有明心见性，没有证得如来藏的人，不懂如来藏的无苦之理，就会有非常多的挂碍，顾虑自己死后下三恶道怎么办，在六道里受苦怎么办，轮回怎么办。而外道们是挂碍死后断灭，再也没有我了，害怕整个我会彻底消失灭亡，所以就执灵知的意识心为我，希望永远不灭，执意识的各种定境为涅槃境界。</p><p>一般学佛人如若不信有如来藏不生不灭，虽然有时口里说死了好，一了百了更好，可实际上心里还是怕死的。他不知道死后是什么状态，也怕一了百了，害怕断灭，不知道从无始劫来，真正的自己从来没有死过，死的都是祂现起的种种假相，因此就有极多的挂碍。六道轮回是假相，生死是假相，业也是假相，真相就是实相，永远不能消灭，只有幻化的虚相才能消失灭亡，比如五阴是虚幻的，能毁坏和灭亡，业行是虚幻的，生了又灭。</p><p>凡是能够生灭变化的都是假有幻有暂有，不是真实实有的，这是真理。只要有生就有灭，不生就不灭，五蕴器世间有生有灭，实相心如来藏不生不灭、永远不变。色身的生灭变化，从未有过刹那停止，从一无所有到针尖大小的受精卵，再变成一百多斤的色身，然后一点点地衰老、病变直到死亡消失；身体状况不断的改变，就说明这个色身是不实的；识心也是念念在变，更是虚幻，刚想了一个计划，不久就改变，刚才还发个誓，一会儿就退转，识心就是这样变化无常。依止如来藏以后，识心有了一定的智慧和定力才可靠一些，有修有证的人识心才可靠稳妥一些。</p><p>总是在不停变动的就是妄心，以六七识为主，真心如来藏永远不改变，也没有这些思想和念头。有人会说，入定时我的心就不变动了，也没有念头了，这就是真心，证得这个不动的心就是开悟。打坐入定，这个没有了念想的心是不是真心？肯定不是，因为入定之前还有妄想，等一会儿出定，妄念又出来了，说明这个心是能变的，能变的心就是虚幻的，是妄心；那个从来没有念头、没有妄想的心，以后永远也不会有妄想念头的心才是真心。辨认真心和妄心要按照不生不灭的原则：凡是变化无常、有生有灭的就是妄心，任何情况下都永远恒一、如如不动的才是真心。</p><p/><p>第三节 菩萨正知正觉而证涅槃</p><p>经文：<strong>【无挂碍故。无有恐怖。远离颠倒梦想。究竟涅槃。】</strong></p><p>一、菩萨不畏生死救拔众生</p><p>菩萨证悟实相以后，渐渐就能具有了脱生死的智慧，渐渐解除对五蕴生死的恐怖，不再害怕在六道里陪着众生漂浮。菩萨知道，要成就自己未来的佛净土，就要广度众生、利乐有情，因此菩萨就敢发愿，用未来世无数个五蕴身来自利利他，不会像阿罗汉辟支佛那样，因为害怕六道生死轮回之苦，早早地就取了灭度，入无余涅槃。而菩萨不取无余涅槃，为了成佛，为了众生得度，依止于涅槃真心如来藏，不挂碍五蕴生死的烦恼，永远不灭掉五蕴身，不会出离三界躲避苦受。</p><p>菩萨也不害怕下三恶道度众生，知道三恶道是一个幻相，不妨就利用这个幻相来大作梦幻佛事。释迦世尊当菩萨的时候，由于大慈悲于众生苦的缘故，也经常下地狱去度众生，释迦菩萨是依愿力去地狱救度众生，没有造地狱业，也就没有地狱的业报，地狱的苦报不能加到菩萨的色身上；如果菩萨怜悯众生，发心替他们受地狱的苦报，他刚一发心，狱卒一棒过来就打死了，菩萨就从地狱里出来。</p><p>我们将来如果能遇缘，发心当一匹马，去度那些马类的同修道友，因为他们过去生造恶业，导致今世投生为马，可是得度的因缘成熟了，我们敢不敢去呢？很多人说不敢，不敢是正常的，因为自已还没有那个能力和魄力，心中还有很多后顾之忧。等到证悟以后，再修到一定程度有了那个能力，就有了那个胆量，那时，你即使投了马胎成了畜牲，也不会有其他马那样的苦报。就像释迦牟尼佛，为了去度堕在马中的五百位菩萨，应供到一个斋主家，结果斋主疏忽了供养，佛就吃了三个月的马麦；但同样是马麦，佛吃来其味胜过天馔妙食，因为佛的果报无比殊胜，无论什么饮食，吃到口里都是最美味的。菩萨不断精进修行，地地增上，果报也会越来越殊胜，为了救拔众生，就不会再畏惧生死了。</p><p>二、众生颠倒执妄为真</p><p>菩萨依着没有生死的如来藏，就没有恐怖了，慢慢地就会远离各种颠倒梦想，心得明慧。众生的颠倒总共有八种：（一）以苦为乐，以乐为苦；（二）把空当有，说有为空；（三）无常说常，常说无常；（四）无我说我，我说无我。这四条展开就是八种颠倒邪见。</p><p>佛最初开始说法时先讲世俗諦，告诉众生五阴苦、空、无常、无我，到佛临涅槃时讲大涅槃经，就讲真正的胜义諦——佛地的常、乐、我、净，表面看前后颠倒，实际都是真理，只是层次不同，都是用来对治众生的颠倒想的。众生把五阴苦当作乐，把无我的五阴当作我，把无常的识心当作常，把不净的色身当作净，对五阴贪爱不舍，这是四颠倒。</p><p>另外四颠倒就是，把佛地常乐我净的涅槃心，当作无常、无我、苦和不净。</p><p>（一）众生把无常当作常，执著不能去至后世的意识心为长久存在的真我。意识灵知心本为断续、生灭的，不可把捉，众生却当作永生不灭的真我，认为灵魂不灭，能去至未来世，执此为真实，成为常见外道，不出生死轮回。外道们不知有不生灭的如来藏实相之法，就执取断常见，认为死后断灭，一切皆无，或者认取灵知意识为永恒的常法，因此邪见而不得解脱。他们认为轮回的主体是灵魂，而灵魂就是生灭的意识心，佛说众生轮回的主体，却是不生不灭的如来藏。他们所说的灵魂意识在五种情况下就灭了：睡着无梦时、昏迷时、无想定、灭尽定、死亡时，阿罗汉入涅槃时意识也灭掉了。既然灵魂是能灭的心，就不是轮回的主体，所以认为灵魂不灭，是外道的常见；认为众生死后一无所有，没有延续到未来世的不生灭心，这是外道的断见。这些都是颠倒的邪见。</p><p>（二）众生以无我为我，把非我的五蕴十八界，当作是我和我所，不知其刹那生灭变异，不是真实的我；真实的我永远不生灭不变异，永远长存而无苦。因为众生内心有无明，就把这个五阴假我当成真实永远不变的我，于是为此造作了无量的身口意恶业，起心动念皆为五阴假我，起各种颠倒想，不断的维护自身的利益，都是把无我当作我，因此生死流转无穷。</p><p>（三）众生以苦为乐，生生世世流转在六道里，苦恼无量。因为无明，不知六道是苦，反以为乐，贪执、贪爱苦海不肯舍离，就像粪缸里的蛆虫不知臭秽。即使得到人身，忙忙碌碌活一辈子，也是苦多乐少。但奇怪的是，绝大多数人不觉为苦，反执苦受不肯舍离。众生习惯于苦，以苦为乐，不知苦諦，不知出离，都是因为无始劫以来的无明遮障所致，这是受六道轮回苦的根源。要救拔他们，断除这些无明，只有宣讲佛说的解脱之理，有缘众生才能发起修道之心，才能远离颠倒得证解脱。</p><p>有一些学佛修行的人，虽然明白五阴虚妄的道理，但对自我五阴的执著一点没有减轻，临终舍报时，怎么也不肯舍离色身，一个星期甚至半个月咽不下最后一口气，即使身心非常痛苦，也愿意保住濒死的色身，不愿意求生极乐世界。有人为了获得钱財无恶不作，感招了那么多苦报，却仍然不愿舍离恶习。这些人皆因不知五阴本是苦、空、无常、无我，不知除此六道还有更自在的四圣法界，不知追求佛菩萨的殊胜境界。</p><p>（四）众生把不净当净，五阴世间，到处都是污秽肮脏，色身九孔常流不净。从头到脚、从皮肤到内脏都是细菌，眼泪眼屎、鼻涕鼻屎、口腔唾液都是细菌，皮肤以及皮肤里面的肉、筋、骨头、骨髓、血液、脑浆，都是细菌。佛说众生的身体就是一个活动的大粪桶，非常肮脏，五脏六腑，屎尿臭味，腥臊恶露。色身如此肮脏，众生不觉知，贪恋不已，迷执其中。七识心也肮脏不净，无量劫来的染污，贪嗔痴慢疑，无数的邪见烦恼，染污其心，久熏成种，众生却迷执其心，不知返照，就是因为无明。我们的无明太深厚了，要经过无量劫对佛法的熏修，一点一点地破除这些无明，无明破尽，就是一尊本来清净的无垢佛。</p><p>三、世尊为什么先说无我后说有我</p><p>释迦牟尼佛示现涅槃前，在大涅槃经里讲常、乐、我、净，刚成道时却讲苦、空、无常、无我，并不是前后说法不一。因为众生都有认五阴为我的邪见，因此邪见而不得解脱，佛就要先讲无我法，让众生断除有我的邪见，先解决生死问题。外道认为五阴中有我，或者认为灵魂不灭，能相续到后世，或者把定境中的各种意识心当作真实的我，佛为了破外道邪见，就要宣讲四圣谛法，让众生证得五阴无我。外道们说沙门瞿昙讲无我时，我们还能忍受。等到佛临涅槃时，讲常、乐、我、净，说无我这个法是世俗諦，胜义諦是有我的，佛地的真如心就是最真实的我，常不变异。外道们听后都迷闷了，说沙门瞿昙是颠倒说。</p><p>其实佛一开始讲无我，是为了破除外道五阴为我的邪见，然后佛才能讲真实法——佛地的大涅槃，就是常、乐、我、净的我。佛为什么讲有我呢？因为佛的如来藏无垢识，就是完完全全究竟的我，有真实永恒的我性。无垢识里已经没有了生灭变异染污的种子，分段生死没有了，变异生死也没有了，这就是真常的我。佛的无垢识有二十一个心所法，能够单独成就一切事业，那个才是真真实实的我。外道们听说佛法里有个真我可求，不是修到最后成为一无所有的断灭，于是就纷纷都跑到佛那里来出家，随佛修学大乘法。</p><p>常乐我净的“常”，是说佛地的如来藏无垢识，祂没有变异生死和分段生死，没有生灭变异的无常种子，永远不再受熏和改变了，所以叫作常。众生的如来藏，还含藏着生灭变异的种子，分段生死没有了尽，变异生死更是潜伏着，还有极多的无明种子，所以不是常恒不变异的。众生的如来藏时时都在受熏，学了邪法受熏成种，学了善法也受熏成种，善恶种子不断的发生改变，根本不是常。</p><p>常乐我净的“乐”，是指佛地的无垢识，祂没有苦受，不对一切境界，舍离一切受，寂静无喧，那是真正的乐，是究竟的寂灭乐。世俗法的乐受总是伴随着苦受，只要如来藏含藏着有七识心染污和烦恼的种子，就不是无垢的，因为变生的七识心不清净、不寂静，就不是真乐。而无垢识的乐，离开一切相，处于清净寂灭当中，没有苦苦、行苦和坏苦。</p><p>常乐我净的“净”，是指佛地的无垢识究竟清净，断除了所有的染污种子，全部转变为清净的业种，断除了烦恼以及烦恼习气，断除了所有的无明，已经是究竟清净了。而众生的如来藏里，因为七识造的业种都存在着埋藏着，使得如来藏具有生灭的阿赖耶识性，八地菩萨以前的如来藏就是具有阿赖耶识性，表明里面含藏烦恼和烦恼习气种子。菩萨通过修行，清除阿赖耶识里的染污业种，存入清净业种，最后阿赖耶识才能转变成清净的、没有染污的无垢识。</p><p>佛讲了常、乐、我、净的真实法以后，外道头目就忍不住了，说瞿昙你讲苦空、无常、无我，我们还能忍受，因为与我们的法差不多；现在你说常、乐、我、净，有我了，结果我们的弟子都到你那边出家，这我们就不能忍受，然后纷纷找佛去辩法，结果佛三言两语就让他们证果。佛一生说法，度了无数的外道，六师外道与佛较量的时候，有几亿个外道弟子，都被佛度过来了。</p><p>佛临涅槃的时候还在度那些外道，那些外道里有很多是佛前世的弟子，事先在外道众中摄受弟子，最后都回归到佛法当中来，证了罗汉果和菩萨果。他们有的人证罗汉果非常快，佛说几句话就解决问题了。可是末法时代的今天，我们要想证个初果不知有多难，很多人修行一辈子也不见踪影。为什么差距这么大呢？因为佛世的外道们多数是厌苦、有出离心的，禅定证量也很高，三十七道品已经修完，烦恼已经得到降伏，他们只要信受佛语，稍微思惟一下四圣谛理，就能证果。</p><p>但是外道们无论如何修行，如果没有佛的点化，不可能断我见，永远在六道中轮回。只要佛为他们开示，在禅定当中的是生灭的意识心，不是涅槃心，他们思惟一下认可，就断我见得法眼净，有的当时就成为三明六通的大阿罗汉。如果没有佛那关键的一句话开示，他们永远在六道里轮回，即使生到最高的非想非非想天，八万大劫入定享乐，福报一享尽，恶业现前，就到三恶道里流转受苦去了。因此，要想脱离生死轮回之苦，一定要修学佛法，学阿含解脱道的四圣谛，学般若之理、明心见性之法。真正的佛法就是如来藏法，是究竟解脱的成佛之法。</p><p>以上是讲颠倒，众生还有梦想，都在生死大梦之中，开悟时就从生死梦中醒过来一点，但还没有彻底，只有佛从生死大梦中彻底觉醒了，得到究竟的解脱，证得无上的大涅槃。凡夫众生生生世世都是在生死大梦里，迷惑颠倒，妄想执著，諸大菩萨们也都是跟佛一样大做梦中佛事。</p><p>四、三乘贤圣四种涅槃</p><p>众生无始劫以来长处生死大梦之中，浑浑噩噩，不知觉醒，菩萨明心证悟以后，才有了始觉智，从生死梦中开始慢慢觉醒，但还没有彻底；只有成佛才算从生死大梦中彻底觉醒了，所以佛被称为究竟觉。菩萨知道这个世间如梦幻泡影，已经有所觉悟，虽然觉悟还不圆满、不彻底，但是再也不像凡夫众生那样完全迷惑颠倒，妄执五阴世间为真实有。所以菩萨证悟以后，渐渐地就对五蕴世间没有挂碍了。依靠这个无所得的般若波罗蜜多心，也就没有恐怖，就会远离各种颠倒梦想，最终证得佛地的究竟涅槃。</p><p>涅槃总共有四种：</p><p>（一）自性清净心涅槃，这是如来藏本身所具备的涅槃性。涅槃，涅者不生，槃者不灭，不生不灭就是涅槃。如来藏就是不生不灭的涅槃心体，祂不依其他法而出生，本来就在，永远也不灭，本身就是中道涅槃性。所以第一种涅槃就叫作自性清净涅槃，七住位菩萨明心开悟就证得了。</p><p>（二）有余依涅槃，是三果人和四果人所证得的涅槃。四果阿罗汉断除我执，断除对三界的贪爱，心得解脱，可是有色身在世间活动，仍难免有微小的苦受，这些苦受是依赖着阿罗汉的五蕴身而存在的，只要有五蕴身就有苦受。比如天热时，他们仍然会感觉闷热，仍然会躲避阳光的照射；天冷时仍然会感觉寒冷；蚊子叮在身上仍然会感觉痛痒；石头砸在身上仍然会觉得疼痛。色身所领受的这些苦都属于微苦，也叫作余苦，所以四果人所证得的境界叫作有余依涅槃。虽然如此，他们的心已经得解脱了，没有三界世间的贪爱，命终就有能力灭掉自己不再出生。心得解脱。未入无余涅槃，有寿命存在时，就是有余依涅槃。</p><p>（三）无余依涅槃，四果阿罗汉断除我执，四住地无明都断尽，其中慧解脱阿罗汉必须等到寿命终了，才能灭掉自己的五蕴十八界，只留如来藏独在，这是不留而留；俱解脱阿罗汉可以随时灭掉五蕴十八界，只留如来藏独在。阿罗汉灭掉五蕴，苦受就没有了，因为没有五蕴，就不会感到苦受。剩下的如来藏，无受无苦，这种只有如来藏独存的状态，就是无余依涅槃。</p><p>辟支佛虽然是中乘圣人，智慧胜于阿罗汉，但舍寿后仍然要入无余涅槃，其五蕴存在时，就处于有余依涅槃境界。</p><p>（四）无住处涅槃。无住处涅槃是诸佛所证的处处解脱、处处无系的究竟圆满解脱境界。佛是究竟大解脱者，祂既不住生死，也不住涅槃，不住在一无所有的寂灭境界。佛虽然证得无住处涅槃，得到了究竟的解脱，但是佛不会像阿罗汉那样灰身泯智，无所作为。佛不会把自己的五蕴灭掉，独自住在寂灭境界，一无所用；佛仍然要用色身五蕴度化无量众生，而且还会用无量的五蕴身分身度化。</p><p>佛没有生死，不住生死，却可以随缘方便现出无量的生灭化身，只为利乐众生，解脱众生之苦。佛所现出的色身叫作解脱色，祂不被任何无明烦恼所系缚。阿罗汉所证的解脱里就没有色，没有五蕴色身，如果再现色身出来，仍然要有变易生死，所以阿罗汉的解脱是不究竟的。佛在无住处涅槃中，能普现一切众生前，随缘赴感度群迷，在一个世界弘法的缘尽了，就到其他的世界现身，虽然在无量佛国土现色身，却一法也不住，所以佛证的是无住处涅槃。</p><p>佛四种涅槃都证得了，证得这四种涅槃，就彻底远离了颠倒梦想，成为一尊究竟圆满的佛世尊。阿罗汉的涅槃还不究竟，还有颠倒梦想，还没有从生死大梦中彻底醒来，还认为真有生死，因此就害怕生死，一心要入涅槃。阿罗汉虽然将五蕴身灭了，但他并没有真正解脱生死，只是把如来藏里的分段生死业消灭了，还有变易生死没有灭，生灭的种子还存在如来藏里。所以说他们的解脱不究竟，他们的涅槃不究竟，只有佛的大涅槃是究竟常乐我净的。</p><p/><p>第四节 三世诸佛依真如心体成无上正觉</p><p>经文：<strong>【三世諸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。】</strong>三世诸佛包括：过去世已经成佛的佛世尊，现在正在住世的佛世尊，以及将要在未来世成佛的佛世尊。三世诸佛都要依靠这个般若波罗蜜多，才能成就无上正等正觉。都是通过证悟如来藏这个真如心，依靠如来藏这个真如心，最后才能究竟成佛。佛在这里表明了如来藏是成佛的真体和主体，是成佛的关键和根本所依。</p><p>证悟如来藏的众生叫作大菩萨——菩萨摩诃萨，在诸佛国土中，他们是未来佛的主要成员。凡夫众生因为都有真心如来藏，从理上也可以说是未来佛，但因根性迥异，成佛毕竟过于久远而无法预期。未来诸佛要成就佛道，必须要证得如来藏，然后转依于如来藏的清净性，学习如来藏本有的无量无边的般若智慧，才能最终转识心成大智，成为究竟圆满的佛。</p></div>"
},{
    "title": "第八章 佛法修证的总持",
    "author": "生如法师",
    "date": "2018年12月22日",
    "html": "<div class=\"B1_text\"><p><strong>第八章 佛法修证的总持</strong></p><p>经文：<strong>【故知般若波罗蜜多。是大神咒。是大明咒。是无上咒。是无等等咒。能除一切苦。真实不虚。故说般若波罗蜜多咒。即说咒曰：揭谛揭谛。波罗揭谛。波罗僧揭谛。菩提萨婆诃。】</strong></p><p/><p>第一节 如来藏是佛法修证的总持咒</p><p>经文：<strong>【故知般若波罗蜜多。是大神咒。是大明咒。是无上咒。是无等等咒。】</strong></p><p>世尊在这里赞叹了如来藏的无量功德，揭示出如来藏是整个佛法修证的总纲和总持，因为以如来藏为主体，才能衍生出三藏十二部经，衍生出十方三世无量諸佛国土，以及众生的五阴世间。如来藏这个大智慧无有能比，祂就是一个大神咒，有无量的神通道用和德能。</p><p>祂无形无相，是真正的空，一无所有，却能运用其大种性自性，变现出无量个世界海。祂没有六根界、六尘界、六识界，没有五蕴，没有四圣谛解脱道，没有十二因缘法，也没有菩萨六度，没有一切世间、出世间、世出世间智慧，没有一法可说，没有一法可得。尽管祂什么也没有，但祂却能变现无量的法来，没有一法不依祂而有，没有一法能出得了祂的心体之外。</p><p>祂本身无形无相，摸不着，看不到，但是有形有相的法都是祂变现出来的，什么法都是祂为我们提供的，祂太神奇、太奇特。祂提供给我们山河大地，提供给我们宇宙星空，供养给我们诸佛国土，提供给我们三界世间的生存环境，支持我们五阴的生活、工作、学习，一切法都是祂提供的。我们有所需求，祂都知道，每个心行祂都知道，不用我们呼叫，祂都会配合努力去实现。这个不是东西的东西真神，连一个微尘大小的物质都没有，却能变出一个三千大千世界，变出无量个三千大千世界，整个虚空都包含在祂心中，无论哪个佛国土、哪尊佛都是从祂哪儿出生的，简直神奇无比，所以说如来藏是一个大神咒。</p><p>如来藏是大明咒，这个明与无明相对，如来藏没有无明，全都是般若的大智慧，世间万法中，祂不愚于一法。祂收存众生所造的所有业种，然后依据业种，变现正报的五蕴十八界，变现依报的生活环境。祂知道是应该造人身还是造畜牲身、恶鬼身，祂知道是应该造天人身还是地狱身。知道头长在哪里，鼻子长在哪里，四肢长在哪里；色身是什么形状，多长、多短、多粗，什么颜色的，祂都知道，全都给安排好好的，不会有一丝一毫的错乱。</p><p>祂肯定会把众生的业完全呈现出来，没有差错，不会说众生造了畜生的业，却变现出天人色身和生存环境；不会说众生修十善业、行善积德，本来应该升天享福的，却造一个地狱身给他。祂绝对不会让因果错乱，也从来没有错乱过。如来藏实现业报时永远不会出错，变造众生的五蕴十八界不会出错，变造众生依报的生活环境不会出错。众生应该受哪种果报，一定会创造相应的环境和五阴身，祂完完全全根据众生的业缘来变现这一切。</p><p>与娑婆世界有缘，就让五阴出生在娑婆世界，在娑婆世界的环境中生存。该升天享福，就让五阴在天界出生。极乐世界的业缘成熟，就让五阴在极乐世界出生，同时也参与变现极乐世界的生存环境。众生临终往生的时候，观世音菩萨手拿的那朵大莲花，就是如来藏根据众生所修的净业而变造的。</p><p>如来藏有大智慧，祂没有一法是不明的，真是大明咒，总持众生的五阴世间，总持着三界万法。众生生时祂知道，众生死时祂也知道，众生五阴的样貌祂知道，众生的依报祂知道。众生的心行祂知道，众生的业缘祂还是知道。如来藏明了众生的心行，众生想要往东，祂知道。众生想要往西，祂也知道，众生想升天，祂知道，众生要入地，祂也知道。众生要吃穿住用祂都知，祂没有一法不知道，知道以后就会随顺配合。</p><p>祂也有不知道的，祂不知六尘境界，不了别色声香味触法，色来不知什么色，声来不知什么声，味来不知什么味。触来不知道是什么样的触。因此对于任何境界，祂都不贪染，如如不动。但是祂也不是完全不知道，不然祂就没办法变现了，祂虽然没有六尘的概念，却了知六尘的种子，依种子依业缘而变现众生所需要的六尘。眼看花时，祂依外界的花，如镜现像般的变现出花的影像，供我们所需，六识所识别的内六尘都是祂如此变现出来的。但如来藏不是完全的不知，祂有祂所知的法，有祂所了知的那一部分内容，所以说如来藏是大明咒。</p><p>如来藏是无上咒，是无等等咒。世出世间没有比如来藏更高上、更尊贵的法，没有更超胜于如来藏的法。如来藏是一切有情生命的根本，是万法的源头。如来藏就是法身佛，法身佛是最尊最贵的，是无等等的，依法身而有的圆满报身佛和清净化身佛，同样是最尊贵和无等等的。若有人要说自己的修行比佛还高，众生学佛要先皈依他，后皈依佛，这种想法就是无明颠倒妄想。</p><p>如来藏唯我独尊于三界，不与万法为侣，与如来藏相等的都没有，更别说上之于祂了。世间任何法没有一个能跟如来藏相比拟，所以要形容如来藏心体，还真的找不到什么类似事物来相类比，因为即使能找出来的，也都属于三界世间里的虚妄法，如来藏不属于三界里的法，没有和祂相等相似的。实在没办法，有时候就用虚空来比喻，也只能比喻如来藏像虚空一样清净无为，像虚空一样对六尘境界如如不动。但虚空是顽空是假法，里面一无所有，而如来藏有真实的体性和作用。</p><p>如来藏虽然没有相，但祂是真实有的法，是实相法。虚空不同于如来藏，如果说虚空就是如来藏，那就是虚空外道论，非佛所说。很多人学佛法，把佛说的法义理解错了，而自认为懂，然后按照自己的错解讲出来，就把佛法变成了外道法，福德智慧不足，就会错解经义，以己所解当作佛义，就是谤佛谤法。佛法的义理甚深又甚深，不是浅智薄福人能够通达的。</p><p/><p>第二节 依如来藏能灭除一切苦</p><p>经文：<strong>【（故知般若波罗蜜多）能除一切苦。真实不虚。】</strong>为什么般若波罗蜜多能除一切的苦呢？因为这个般若波罗蜜多不在生死的此岸，祂没有生，就没有老病死苦。又因为如来藏没有五受阴，也不对六尘境界，根本没有受，又哪里来的苦。三界世间对于祂来说，根本不存在，因此就不会感知到世间的任何苦受。证悟如来藏以后，五蕴身心依止于如来藏，也就渐渐灭了苦，直到最后成佛，就会灭除一切苦，证得常、乐、我、净。</p><p>如来藏无有苦受，真实不虚，佛地的寂灭乐，真实不虚。虚妄的五阴有三苦，苦的就不是我，因为不真实，真实的我——如来藏没有苦。五阴假我生灭变易无常，无常即是苦，苦即非我。如来藏本体常住不变，因此无苦，无苦即是我，我是不苦的。所以能够感觉苦受的心，就是生灭的妄心，不是真心。妄心七识依止于如来藏真心，逐渐达到无为，灭除如来藏里旧有的苦种，不再集积新的恶业种子，五蕴苦报就越来越少，最后就能灭除一切苦。所以如来藏能除一切苦，真实不虚。</p><p/><p>第三节 心经中的心咒</p><p>心经中的心咒：<strong>【揭谛。揭谛。般罗揭谛。般罗僧揭谛。菩提莎婆诃！】</strong></p><p>最后世尊做总结，宣说般若波罗蜜多咒，这个咒就是心经的总持咒。心经是讲述如来藏总体相貌的经典，如来藏就是三藏十二部的总纲领和核心，没有如来藏就没有三藏十二部。释迦世尊大慈悯于众生，从自心真如当中，流露出三藏十二部，以此三藏十二部来摄受和化导无量众生归于佛法，证得解脱，达到究竟涅槃。而心经就是三藏十二部的总持，把从凡夫开始起修，到成佛的整个修证之理，全部都概括地描述出来了。</p><p>世尊也把心经总结成一个咒语，来概括和归纳整部心经的内涵，这个咒就是心经总持咒。所有的经和咒都依如来藏而有，每尊佛都依靠着这个大圆觉海，演说出无量佛法，度脱无量众生。佛在某些经典里要宣说一个咒，这个咒就代表整部经的总持，概括了这部经的全部内涵，也叫作陀罗尼。</p><p>心经的总持咒内容：“揭谛。揭谛。般罗揭谛。般罗僧揭谛。菩提莎婆诃！”此咒语是古印度梵语的音译，对应于现代汉语的意思有两种，一种就是：“来吧，来吧！快到彼岸来吧！快到涅槃的彼岸来吧！赶快成就圆满究竟的菩提大道吧！”另一种意思就是：“来吧，来吧！皈依波罗蜜多吧！转依波罗蜜多吧！最终就能成就究竟圆满的菩提大道！”这两个意思、两种翻译都符合咒语之义。</p><p>学佛修行，从开始迷信三宝，到仰信、崇信再到正信三宝，然后就开始修学般若波罗蜜多，之后就会证悟如来藏。在我们越来越多地观行和了知如来藏的各种有为和无为体性之后，妄心七识就会转依过去，就会具备菩萨的悲心、愿心和无为心性，心地的种子清净了以后，就会成就佛果，证得究竟的大涅槃。</p><p>如来藏的无为性表现在，祂没有见闻觉知性，对于六尘境界，祂不分别、不动念、不贪染、不执取，不造任何贪嗔痴业。如来藏的有为性，表现在祂能圆满成就一切法，变现众生的五阴十八界器世间，却不执我能如此，不求取回报，是完全的无我性。如来藏在成就六识分别六尘法时，自心却是清净无为的。</p><p>如来藏不仅布施我们六根，也布施我们六尘，再布施我们六识，我们才能有五阴的一切活动，才是个完整的正常人。如来藏用五遍行心所法成就这一切，当祂触色时，先作意，引心到色尘上来，然后触色尘，领纳色尘，了别色尘（非六识之了别），最后决定变现。整个过程极其快速的完成，非常精细准确。我们接触树木祂变树影，接触花祂变花影，接触人祂变人影，可是祂都是忠实于业果而变，不存私心，不存己意，公正无私。</p><p>如来藏就像摄像头，把外面的色境变成影像，供我们分别。如来藏有四大种子，能够与外色尘直接接触，通过眼根和视觉神经传导到胜义根，生成内相分色尘。胜义根与内相分接触，如来藏就会产生眼识，同时意识也产生出来，眼识、意识再触内相分，就开始了别，知道了这是树、这是花、那是人，分别以后就生起了觉受。我们所见的一切人、物、事的色尘，都是如来藏变现的影像，所以万法是虚妄的，如梦幻泡影。当我们看见一个人时，所见的实际上是那个人的影子，但我们从来都误以为真，生起各种错误的知见和感受，不知道是对着虚空中的幻影而做种种分别和思惟，所以众生才有种种的颠倒，不断地受生死轮回之苦。</p><p>我们听声的时候也是一样，如来藏通过耳根和声尘直接接触，把外界的声尘变成虚假的内相分声尘，然后经耳识、意识分别，就听到声音了。同理，鼻识、舌识、身识乃至意识所了别的香尘、味尘、触尘以及法尘，都不是真实的外境，都是如来藏变现的内六尘影子。无始劫以来，我们从未接触到外面真实的境界，接触到的一切法都是如来藏所变现。这就是万法唯心造的真正内涵，凡所有相皆虚妄，说的也是这个理。</p><p>如来藏就是这样成就众生的五阴十八界，祂虽成就一切法，心中却究竟无我，既有为又无为，我们学佛修行，就是要转依祂的无我性，永远无怨无悔地利乐众生。如来藏虽然能有为地变造一切法，自性却是无比清净的，对一切法不贪、不厌、不执、不弃。我们转依了祂的这种有为法当中无为的清净体性，七识心就会渐渐汰除一切的染污性。眼见色时，知道了是什么色尘就好，不要再起贪嗔等心行；耳听声，知道是什么声就行，也不要生起憎厌喜乐的心行，这就转依了如来藏的清净性。只要有六根对着六尘，就会生起六识来分别六尘，知道六尘的虚妄，不要再起心动念，不要妄起种种思惟，不要计较个人利益得失，心无染污地面对和处理一切人事物理，这就是修行。</p><p>假如转依成功了，七识妄心的分别性还是存在的，否则就不能修行、工作和生活。即使成佛也要分别六尘境界，因为应身佛和化身佛也要应对六尘境界，不能对六尘一无所知，那就没办法度众生。但佛的七识心已经没有无明和染污，完全和如来藏本体一样清净。我们转依如来藏的清净性、平等性，还要转依如来藏无我无私的奉献精神。祂给我们布施了一切法，要五阴给五阴，要六根给六根，要六尘给六尘，要六识给六识，但是祂不求任何一点回报，对我们一无所求。我们要向祂学习，度众生不求回报，这样修积福德的速度反而会越来越快。</p><p>如来藏的功德无量无边，开悟以后一点一点的观行修学，七识心就会慢慢地转依过去，染污减少了，心性就改变，完全转依以后就成佛。学佛修行就要每天历缘对境，对照如来藏的体性，熏习转变自心的种子，直至所有的无明全部去除，种子彻底清净了，那三大无量数劫的修行才算完成。</p><p>菩萨十信位圆满，进入初住位开始修外门六度波罗蜜，七住位明心开悟，进入内门修六度波罗蜜，十住、十行、十回向三贤位圆满后，般若总相智、别相智具足，进入初地修道种智。十地圆满后成为等觉位菩萨，等觉位菩萨百劫修福，福德圆满成为最后身妙觉位菩萨，在兜率天等待时节因缘下生成佛。菩萨五十二位阶，三大无量数劫，所依、所靠、所证、所修、所学都是自性清净心——第八识如来藏。在三大无量数劫里，菩萨要遍历无量诸佛国土，亲近供养无量无数佛菩萨，但这一切都是在自已的真如法身中所作的幻化事业，菩萨修学的所有智慧，都是自已的如来藏本自具足的，如来藏才是最究竟圆满的真佛。修学心经就要总持这个咒：“修学如来藏吧，证悟如来藏吧，转依如来藏吧，才能成为究竟圆满的佛，才能圆成一切种智，究竟涅槃！”<span>　</span></p><p><strong>附录：《华严经》觉林菩萨所说颂</strong></p><p>《华严经》夜摩宫中偈赞品，觉林菩萨承佛威力说了一首颂，其中有四句：<strong>“心如工画师，能画诸世间，五蕴悉从生，无法而不造。”</strong>这四句颂被印在每部《地藏经》的篇首。意思是说如来藏就像一个善于绘画的画师，能画出三界的宇宙器世间，也能画出众生五蕴色身，一切法都是祂变造绘画出来的。</p><p>我们首先看工画师是怎么画画的，他先把颜料调好，准备好画笔、画布，然后根据头脑里的构思，或者眼前的景物，用画笔描画临摹出来。脑子里想山，就用画笔沾取颜料，画出山；脑子里想河，就画出河；脑子里想佛像，就画出佛像来。而如来藏也像工画师一样，能够画出我们的五蕴十八界，画出三界世间。可是如来藏却没有构思，没有想象，不按己意来画，完全根据所存的业种来画。</p><p>是人的业种，就用七大种子画一个人；是男人的业种，就画一个男人；是女人的业种，就画一个女人；是畜生的业种，就画一个畜生；是恶鬼的业种，就画一个恶鬼。画山河大地，如来藏就输送地水火风四大种子，变出山河大地，变出地球、宇宙星空，变出须弥山，变出各层天的天宫。地球下面的四大海水祂能变出来，七金山也能变出来，下面地狱也都能变出来。这些变来变去的五阴器世间，都是根据众生的业种子而变来的，祂不是无缘无故、没有依凭、随意就变出来的。</p><p>如来藏就像工画师，业种就像画师头脑中的构思，七大种子就像画师用的颜料，如来藏的心所法就像画师的画笔。祂那里存着什么业种，就用七大种子画出与此业种相应的五阴世间，祂是有理有据画的。如来藏究竟怎样变造出山河大地，如何输送七大种子，如何变造我们的色身五蕴，如何出生我们的七识心，这些细节需要在修出道种智以后，一点一点的去观察观行，就能生出越来越广大的智慧，道业就会不断的增进，福德不断的增长。学佛修行真是优哉游哉的最快乐自在的事！</p><p><span>般若波罗蜜多心经到此全部讲完，祝愿大家学法无碍，道业精进，早证菩提！</span></p><p>修法总回向：</p><p>愿消三障諸烦恼，愿得智慧真明了；</p><p>普愿罪障悉消除，世世常行菩萨道！</p><p> </p><p>　　　　　　　　　　　　　　　完稿　　二〇一六年三月十五日</p><p>　　　　　　　　　　　　　　再次校对　二〇一八年十二月二十日</p></div>"
}]