[{
    "title": "第十六卷 六界差别品 第二十六之第一章 净饭王初次见佛",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十六卷  六界差别品第二十六之一</strong></p><p>六界就是地水火风空识六大，差别就是指六界各有各的界限，其功能作用不同，有一定的差别。《父子合集经》主要讲释迦佛如何度化祂的父亲净饭王的事迹。释迦佛初成道的时候想要度他的父亲净饭王，就派人劝说净饭王来见释迦佛，净饭王见到释迦佛时，看到世尊正在为无数人天大众授记成佛，于是深受感动，世尊就借机劝说净饭王要精进修行佛法，不要贪着王位和世间的五欲六尘。</p><p>世尊用种种梦境作比喻，开示万法的虚妄性和空性，以此来劝化净饭王，让净饭王明了五欲六尘如梦境般幻化不实，不应该再迷恋不舍，应该早日修道以求得解脱。净饭王明了这些道理以后，不再贪着五欲六尘，潜心修学佛法，命终就往生极乐世界了。净饭王身居王位而能做到不贪五欲六尘，极为难得，都是佛的善巧方便度化的结果。<span> </span></p><p><strong>第一章  净饭王初次见佛</strong></p><p>原文：<strong>尔时净饭王。并诸营从眷属等。见诸阿修罗王。乃至外道婆罗门。蒙佛授记。发希有心。叹未曾有。世尊言音。美妙清澈。一切世间。闻者忻悦。时净饭王。始见如来。以爱恋故。情意殷勤。</strong></p><p>释：净饭王以及他的亲信侍卫、随从大臣等，在这个法会上，看到世尊给阿修罗王甚至一些外道婆罗门都授记成佛了，于是就发起了希有之心，赞叹说自己从来没有遇见过这样殊胜的大会，赞叹世尊讲法时的音声是那样的美妙清澈，一切世间人听后都会感觉很快乐和喜悦。因为净饭王从世尊离家去雪山修道成佛以后，第一次见到世尊，心中还爱恋着自己曾经的儿子，还有着很浓厚的情意。</p><p>原文：<strong>尔时世尊。知彼父王。心之所念。而告之曰。大王。我所说法。初中后善。其义巧妙。清净一相。梵行圆满。今正说者。所谓分别。六界差别。分位法门。王当谛听。善思念之。时净饭王。即白佛言。善哉世尊。愿乐欲闻。为我宣说。忆持信受。</strong></p><p>释：这时世尊知道曾经的父王心里对自己还有着想念之情，就对净饭王说：大王，我所说的法，从一开始到中间，再到最后，其中之义理全部都是善的，并且也很巧妙，使用了种种的譬喻让众生方便得以理解和信受。这些法义都是清净之相，净行圆满，我正在讲说的，就是所谓的分别六界的差别分位法门。大王你应当仔细听，并且要善于思考这些法义。这时净饭王就对世尊说：好啊！世尊，我非常愿意听闻世尊为我宣说，我要记忆在心，并且信受奉行。</p><p>在此大会上，欲界六层天，色界十八层天，无色界四层天总共二十八天，这些天的天主以及非人都得到了佛陀的授记。净饭王看到佛陀给那么多人和非人甚至外道们都授记成佛了，自己从来没有耳闻目睹过这样的场面，于是就非常赞叹稀有难遇。</p><p>每个众生成佛后都具备三十二相八十种随形好，其中一相就是“梵音”相——佛的音声非常美妙清澈，几百上千亿人天来听法都不用扩音器，所有人都能听得到，而且不但人能听懂佛所说的语言，甚至鬼神、畜生以及六道众生都能听懂；中国人能听懂，其他国家的人也能听懂；不同语言不同种族的人都能听懂，其他佛国土的菩萨更能听懂了，并且都能听清楚佛所说的音声。这就是佛德之一。</p><p>所有世间人，包括三界（欲界、色界、无色界）的所有众生，一听到佛陀的法音都非常欢喜快乐。自从世尊离家去雪山修道以来，净饭王是头一次得见世尊，他还有父子之情，还把佛当作是自己的儿子看待。他刚一见佛时，心里的想法还是认为他自己是父王，佛是他的儿子，佛应该给他行见面礼，净饭王就站在那里等世尊给他行礼，世尊也站在对面等着净饭王给自己行礼，因为世尊知道自己是三界至尊，净饭王虽然是自己的父亲，但也是一介凡夫。这时，世尊的弟子就对净饭王说：世尊现在是三界至尊，你应该给世尊顶礼。净饭王一听就明白了，马上给世尊顶礼。</p><p>梵行就是清净行，身口意达到清净，没有欲染即为梵行。清净行圆满即为梵行圆满，内心没有贪嗔痴染污心行，心得清净。世尊现在正在阐说的是六界差别分位法门，即地、水、火、风、空、识六大，这六个法门的分位、定义、差别、界限、功能等等。</p><p>净饭王表示听闻世尊讲法后，要忆持在心，念念在法。忆持的前提是闻法，听懂了为胜解，胜解之后才可以忆持。如果不懂的话就容易忘记，回想时就想不起来，懂了以后把内容记住了，不用去背，提起来就知道是什么意思，此即是忆持不忘。忆持不忘的前提是听懂，听懂的前提是仔细听、谛听，而谛听就是专心听，心有禅定。所以佛陀说法前都会告诉弟子们“谛听谛听。善思念之。”仔细地听，认真地听，之后再仔细地思惟，不是听完就算了，而是听完以后还要思惟思考，思考以后才能明白，明白了即是胜解，胜解了以后自然就能记住了。</p><p>听法记不住不仅仅是记忆力不好的问题，也在于当时有没有理解，听完之后是否还进行了思惟，思惟得是否深入细致。如果做不到这些，就会记不住，不知所听为何。忆持的下一步就是信受，相信并领受，领受的下一步就是依教奉行，依教奉行做到了，学到的法就变成自己的了，这就是修行的次第。首先谛听，然后思惟、忆持、信受、奉行。</p></div>"
},{
    "title": "第二章 总说六界六触处",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  总说六界六触处</strong></p><p>原文：<strong>佛言大王。如是六界。六触处十八意所伺察。是补噜沙。为缘得生。云何六界。所谓地界水界。火界风界。空界识界。</strong></p><p>释：佛对净饭王说：大王，刚才所说的六界，是在六触处和十八界所能观察思惟到的，是人以此六界为缘依靠着这六界才能出生。什么是六界？就是地界、水界、火界、风界、空界、识界。</p><p>如果都如阿罗汉一般在无余涅槃中，就没有五蕴身在三界世间出生和流转，也就没有六界的现行了。六触处，即眼触处、耳触处、鼻触处、舌触处、身触处和意触处，十八界就是六根六尘六识，在六触处和十八界上就能观察得到六界的现行存在。补噜沙即为梵语人的意思，是五蕴假我之意，五蕴以六界为缘才能出生，出生五蕴众生要以六大种子为缘，其中地水火风空五界出生众生的五阴身，识界出生众生的识心，合起来六界出生了众生的五阴身色阴、受阴、想阴、行阴、识阴。</p><p>有五蕴十八界的就是一个众生，有五蕴就有触，眼触色尘，耳触声尘，鼻触香尘，舌触味尘，身触触尘，意根触法尘，此为六触处，其中眼耳鼻舌身五根是由六界中的前五界组成，色声香味触法也是由前五界组成，最后一个意根是识心，由识大种子识界生成。六根触了六尘以后，六识出生，才能有分别性，之后产生感受、思想、判断、思惟，最后才能作决定。</p><p>十八界中，六根触六尘产生六识，六识一旦产生出来，识心的分别性就随之出现，五蕴就活动运转起来了。其中五根和六尘是由地水火风空五界组成，意根和六识是由识界形成。六触处和十八界都离不开六界，也就是说众生的五蕴不能离开六界，以六界为缘才能出生和运行。</p><p>原文：<strong>云何六触处。谓眼触处。而见于色。若耳触处。得闻其声。若鼻触处。能嗅于香。若舌触处。悉尝于味。若身触处。亲觉其触。若意触处。则知于法。</strong></p><p>释：什么是六触处？就是眼触处而能见色，眼根和色尘相触之处，眼识得生就能见色；在耳根这个处所接触到声尘，就能出生耳识，听到声音；在鼻根这个处所接触到香尘，就能出生鼻识，闻到香臭味以及杂味；在舌根处触到味尘，就能出生舌识，尝到酸甜苦辣咸各种味尘。</p><p>在身根处接触到触尘，出生身识能感受到触尘，比如接触到太阳光，就能感觉到温暖，有风吹的时候，身识就能感觉到凉意或暖意，身体感觉的轻安、舒适、饥渴、疲累、酸乏、疲惫，也都是触尘。在意根处意根和法尘相触，出生意识，就能了别一切法尘境界。</p><p>原文：<strong>云何十八意所伺察。谓眼见色已。若生适悦。若生忧恼。若住于舍。如是六根。各各缘彼。适悦等三。是名十八意所伺察。</strong></p><p>释：什么是十八界的伺察？伺察就是观察、了别、了知、觉受，如眼根触色尘以后，眼识和意识了别了色尘，如果产生了喜悦或者忧恼的心境，或者住于无喜无忧的中间觉受状态，就有三种感受出现。这根尘识三者是三界，也是一对，耳鼻舌身意其余五根，也同于眼根一样，组成五对，根触尘生识，识心就会出现觉受，会产生或者喜悦，或者忧恼，或者无喜无嗔（舍）的三类觉受。分别是五对十五界，合起来就是六对十八界。每个根触尘之后都会有根尘识三界，六根触六尘，与六识合起来就是十八界，分别产生苦乐舍三种受，是为十八意所伺察。</p></div>"
},{
    "title": "第三章 分说内外六界",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第三章  分说内外六界</strong></p><p>原文：<strong>大王。云何为内地界。谓于内身。所生硬涩。发毛爪齿。皮肉筋骨。若内地界不生。亦无有灭。则无集行。</strong></p><p>释：大王，什么是内地界？内地界就是众生色身之内的地大成分，色身中所具有的坚硬性的部分，如头发、指甲、牙齿、皮肤、肌肉、筋、骨骼等这些坚硬的地性组织部分。如果内地界没有出生，也就没有灭，诸法就没有集积和现行的现象。</p><p>地界是阿赖耶识中的地大种子，阿赖耶识有地大种子就能出生物质色法的坚硬性，能变现出器世间的生存环境和众生的身根。内地界在入住母胎时就开始一点点地产生出来，意根投生到受精卵当中，阿赖耶识就输出地大种子变生胎儿的色身，否则色身没有地大成分，身体疲软如水，就无法行住坐卧。地界既然有生，必然就有灭，有生有灭才能集积五阴身，才能有身行。如果地大种子不出生，也就不能有灭，也不能集积五阴身。有生灭的法就是假法而非真法，是虚妄法、空法，因此我们不可贪着执取，否则就有生死苦。</p><p>原文：<strong>大王。若时女人。而于内心。如所思维。彼补噜沙。彼补噜沙。亦生爱乐。由二和合。羯逻蓝生。又复思维。相似和合。而得生者。无有是处。若二女人。无有是处。二补噜沙。亦无是处。若彼彼思惟。而得生者。亦无是处。自体无实。非相应故。</strong></p><p>释：大王，如果一个女人，在心里想着另外一个人（男人），而另一个男人也爱乐着这个女人，则这两个人和合在一起，就会有一个七日之内的羯逻蓝（受精卵）产生。如果两个人不在一起，分别在不同处所，而内心里想象着两个人能够和合在一起，身体并不相接触，能出生受精卵，这是不可能的。因为没有实体相触，阿赖耶识就不能凭空输出地大和五大种子，执持一个并不存在的受精卵，因此就没有生命体的出生。</p><p>如果两个女人和合在一起能出生羯逻蓝，这也是不可能的；如果是两个男人和合在一起，能出生羯逻蓝，同样是不可能的。如果任何两个人之间互相想念，不能实际和合在一起，而能出生羯逻蓝，更是不可能的。因为没有实际的色体，没有四大，羯逻蓝就不得出生，缘不具故。</p><p>原文：<strong>云何说此。为坚硬性。大王。此坚硬性。相似而立。毕竟此身。溃烂散灭。唯冢圹中。是所归趣。彼坚硬性。从何所来。亦非四方。上下而去。大王。此内地界。应如是知。</strong></p><p>释：为什么说地界具有坚硬性，大王，这种坚硬性也是相似的假安立名言，并不是真正坚硬永远不坏灭的，因为这个色身毕竟是要溃烂和散灭的，最后就会被抛弃到荒郊和坟地中，四大散灭，无影无踪。色身中的坚硬性是从哪里而来的？没有一个来处，也没有一个去处，不是从色身的东西南北四维上下而来，也不到四维上下而去。此色身内的地界就是这样，没有来处，也没有去处。（此为小乘讲法，世尊不明说有阿赖耶识输出四大种子形成色身，最后色身中的四大种子又回到阿赖耶识当中。）</p><p>这个羯逻蓝（受精卵）中的地性是从哪里来的？是从无所来处而来，灭了以后也没有一个去处。色身死亡时，地性消灭了，地性去哪里了？也没有一个去处，因此说地性就是空的、幻化的、非真实的，因此身体的坚硬性并不是真实的。坚硬性从羯逻蓝一开始出现的时候就存在了，然后变成色身上的毛发、牙齿、皮肤、肌肉、筋骨，死亡以后地性消散了，毛发、牙齿、皮肤、肌肉、筋骨都毁灭了，坚硬性也没有一个地方可去，也不到虚空里去，来的时候没有来处，就这么来了。</p><p>但是实际上都是从阿赖耶识里输送出来的，佛在这里还没有讲到这点。内地界就是这么来的，因为男女和合，意根投胎到受精卵里，出生羯逻蓝就产生了地界。地界是如此的生灭虚妄，所以不应该执着地界，不要把毛发、牙齿、皮肤、肌肉、筋骨和色身当成我，当成真实不灭的我。</p><p>原文：<strong>大王。云何外地界。坚硬性者。如彼世间。初建梵王所居宫殿。大宝所成。复生他化自在诸天。所居宫殿。皆七宝成。大王。若无地界。彼坚硬性。从何所生。</strong></p><p>释：大王，什么叫作外地界的坚硬性？比如说三界器世间刚刚形成的时候，初禅天的天主大梵天王，他所住的宫殿是由众宝所建成的，包括释提桓因的天宫殿，都是由七宝组成，还有欲界第六层天的他化自在天天主所居住的宫殿，都是由七宝建成的。大王，如果没有地界，那些宫殿的坚硬性是从哪里出生的？</p><p>内地界讲完后，佛接着讲外地界。只要是地界就是坚硬性的，色身外边也有坚硬性的物质，外六界不是指十八界内六尘，而是外六尘，尤其是指外色尘，是由共业众生的阿赖耶识共同变造出来的本质境，只能由共业众生的阿赖耶识去接触。</p><p>一切物质色法上的坚硬性，都是由地大种子形成的，都是地大的性质。初禅天梵天王的宫殿也是由七宝组成，二禅天天主的宫殿也是由七宝组成，须弥山也是由七宝组成，凡是七宝、百宝都有其坚硬性，主要都是由地界形成的。地球由土、沙、和各种矿物质组成，其中里面也包含着各种宝，都有其坚硬性，是由地界所形成的。世界刚开始形成的时候，宫殿也是一点点形成的，所有共业众生的阿赖耶识共同输出四大种子、五大种子，形成大种共同变现出宇宙器世间，变现出各层天宫的宫殿，变现出四大洲、四大海、七金山。这些物质当中都含有地界，都有坚硬性。</p><p>如果阿赖耶识当中，没有地大的坚硬性，那么外界器世间的坚硬性是从哪里产生出来的呢？这句话就说明了外界一切宇宙器世间，都是阿赖耶识中含藏的种子变现出来的，是所有有缘众生的阿赖耶识共同输出了相同的业种以及五大种子，所变现出来的。这句话就是在告诉我们宇宙器世间是从哪里来的，是从阿赖耶识里来的，所以还是心造万法，万法都由心变，都由心生。这个地界就是阿赖耶识当中的一个种子，一个功能变现出来的，到这里应该初步地懂一点万法唯心的原理了。</p><p>原文：<strong>复成大地。厚八万四千踰缮那。纵广六万踰缮那。复生轮围。大轮围山。坚固安住。同一金刚。复生苏弥卢山。庾健陀山。[寧*頁]泯陀山。伊舍陀山乃至黑山。如是三千大千世界。次第成已。坚固安住。若无地界。彼坚硬性。从何所来。</strong></p><p>释：把天宫都变成以后，再变造地球，地球的厚度是八万四千踰缮那，踰缮那是印度的语言。代表非常的多，多到不能数的时候，印度的语言就用八万四千来代表了，说明整个地球的厚度是那么的厚。地球的长宽都有六万踰缮那，厚度比广度大，表明地球不是正圆，而是椭圆的。地球造出来以后，地球下面的铁围山就接着变造出来了，还有苏弥卢山、庾健陀山、泯陀山、伊舍陀山乃至黑山都变造出来了。</p><p>须弥山沉在大海里一半，伸出在大海上边一半。大海上的须弥山的半中央就是四天王天，东南西北四大天王四大护法住持着须弥山的半中央，须弥山是以地界为主造成的，四大海下边的七金山也都建成了，以地界为主。这样三千大千世界就渐渐地次第形成了，非常坚固，像金刚一样，都有坚硬性，都是由地界形成的。如果没有地大种子，没有地界，那些物质的坚硬性是从哪里来的？</p><p>佛这一段讲的是世界的形成，以坚硬性为主，坚硬性从地界中来，地界是阿赖耶识里含藏的种子的功能。这句话就是说明三千大千世界都是阿赖耶识中含藏的种子变造出来的，也就是阿赖耶识变现的。一个人的阿赖耶识是变不出来的，所有有缘的众生的阿赖耶识和合在一起才能变现出来，世界就是这么出现的，一点一点由阿赖耶识形成的。</p><p>以上讲了众生色身的内地界是如何形成的，宇宙虚空的外地界是如何形成的，说明了万法唯阿赖耶识所造，没有阿赖耶识就没有一切法。要真正懂得这个义理有多深，你就明白世界的真实相了，就断了愚痴无明，再也不执著我，不执著身外的金银珠宝、山河大地了。</p><p>所有的一切都不是自己所拥有的，只能是为我所用，而且只能用一段时间，但是却抓不住，所以根本不用执取任何法。外界的一切法都会灭亡，自我五阴身也会灭亡，谁能抓住什么呢？五阴身会死亡，世界也会消失，一切都不可靠。就算众生永远不死，世间也会毁灭，地球毁灭了，宇宙虚空都毁灭了，色身就没有居住的空间了。所以一切法包括自己的五阴身都执著不了，什么都抓不住。</p><p>金银珠宝也是由地水火风组成，也是阿赖耶识变现出来的，缘灭了就消失，连三千大千世界都会消灭。如果没有阿赖耶识也就没有地界，没有地界也就没有三千大千世界，也就没有众生的五阴身，所以一切法都是阿赖耶识所变现的，万法的根源就是阿赖耶识如来藏，由此可知万法都是虚妄的，这就叫万法唯识。</p><p>原文：<strong>大王。又此地界。欲坏灭时。或为火焚。或为水漂。或为风吹。譬然酥油。其焰炽盛。乃至灰烬。不复可见。若为水漂。犹如以盐。投于水中。须臾消散。若为毗岚。猛风所吹。彼时三千大千世界。悉皆散坏。净尽无余。</strong></p><p>释：大王，当地界要毁坏的时候，或者是被大火所焚烧，或者是被大水所淹没，或者是被大风所吹散。地界被大火焚烧的时候，譬如点燃酥油灯时，火焰炽盛，直到把酥油烧尽，连灰都看不见了；地界被大水所漂没时，犹如把盐投入水中，一会儿盐就消融不见了；地界如果被毗岚猛风所吹毁时，三千大千世界当下就全部散坏，一干二净，什么都不存在了。</p><p>地界要毁坏的时候，是怎么毁坏的呢？第一个就是大火烧毁的，火灾来的时候，一直烧到色界的初禅天，初禅天以下什么都没有了。欲界六层天以及天宫都没有了，须弥山也没有了，四大洲也没有了，地球全部都没有了。世间要灭的时候，大火一烧起来，地球就烧没了，然后火烧上须弥山以及欲界各层天，须弥山以及天宫都烧成灰烬，乃至于色界初禅天也被烧成灰烬。</p><p>地球是如何被烧灭的？先是出来两个太阳，然后是三个、四个、五个、六个太阳，最后是七个太阳出来，初禅天以下都烧毁了。两个太阳出来，地球上的生命就消失得无影无踪了，不用说七个太阳。一个太阳的时候，夏天到来众生就受不了了，两个太阳出来，生命还能存在吗？七个太阳出来，四大海水都干枯了，地球直接就着火，烧没有了。火烧到天上，须弥山也烧没有了，整个欲界六层天都烧没有了，初禅天也没有了，什么金银珠宝早就烧没有了，七宝比金银珠宝更坚硬，也一样烧光了。</p><p>第二个灾难是水灾，初禅天以下已经烧没了以后，天上就开始下大雨，一个雨点就像一头大象那么大，一直下了七天七夜，水一直涨到色界二禅天，欲界六层天就淹没了，初禅天也淹没了，大水又上升到二禅天，二禅天全部都淹没了，水灾就是这么厉害，二禅以下的天人都躲不过去。</p><p>第三灾是风灾，大风一刮，一直刮到色界的三禅天，把三禅天都刮没了。即使地球没有被大火烧灭，地球瞬间也能被大风所吹散。欲界六层天也都会被吹散，连踪迹都找不到，什么七宝组成百宝组成，全都能吹散了，再坚硬的东西也都不能存在，不能长存，这风力该有多大。只有一样东西火烧不着，水淹没不了，风刮不到，那就是阿赖耶识如来藏。</p><p>三灾过去，就剩下了四禅天以上的天界。四禅天有四层，再加四空天，还有无色界天，这些天界灾难都降临不到。因为四禅以上是舍念清净，没有念头，心清净，也就感应不到灾难了。三禅的禅定境界里还有呼吸，呼吸就是风，所以能感召到风灾，风灾能上升到三禅天，把三禅天都能毁灭。三千大千世界到最后全部都散坏了以后，寂静无余，毁坏得连灰尘都找不到，一点也没有了，因此说世界确实是虚妄的。</p><p>原文：<strong>佛说大王。此外地界。生时本空。灭时亦空。无有男相。也无女相。但唯言说。之所显示。如是地界。与地界性。皆不可得。唯佛正慧。而能了知。</strong></p><p>释：佛对净饭王说：大王，除此之外，地界生的时候本来是空的，灭的时候也是空的。此地界中，没有男相也没有女相，只是以语言的形式来显示地界以及地界性罢了。如是地界以及地界的坚硬性，都是了不可得的，只有佛的大智慧才能了知无余。</p><p>地性是地水火风四大种性之一，这四大种子都存在于阿赖耶识里，种子输送出来就能够变现出五阴身，变现出山河大地宇宙器世间，四大种子能变现出一切物质色法。外地界一点点形成的时候，经过了二十小劫33600万年，是从一无所有的空中建立起来的，三千大千世界宇宙器世间开始一点点地形成。三千大千世界毁灭了以后，还是一无所有，凡是生灭性的都是空的，一法也无。地大种子存在阿赖耶识里，也是无形无相的空的，形成的外界山河大地，自己不能决定自己的存在，没有自体性，其自性也是空的，因为都是被阿赖耶识变造出来的。物体的坚硬性也是空的，无形无相，随物体而生而灭。</p><p>地界能形成众生的色身，在欲界众生中色身就分为男相和女相，但是地界本身没有男相和女相，什么相也没有。阿赖耶识依据业种，把地大种子输送出来以后以后，就造就出了男相或者是女相，没有相的地界能形成有相的物体和生命体。在众生的色身上，骨骼、肌肉、皮肤、头发、指甲都以坚硬性为主，叫作地性。地性本身没有男女相，形成色身时就分成了男相和女相，男相和女相其实也都是虚妄的。</p><p>地大本来没有相，没有差别，偏偏变出的相就有了差别，这是为什么？因为相是由所造业的业种决定的，造的是男人的业，阿赖耶识就变现出男人的色相来；如果造的是女人的业，业种存在阿赖耶识里，阿赖耶识把地大输送出来，就造出女人的色相来。从无相到有相，一切相都是虚妄的，业种如果消除了，相就转化了。当禅定修到了初禅、二禅、三禅、四禅，命终生到色界天的时候，色身就不分男相和女相，而是中性相了。男女相是能够随业不断转化的，所以男女相是不实的、幻化的、虚妄的，能够变化的就是假的，真的东西永远不变。</p><p>哪个东西永远不变？就是阿赖耶识。三灾能毁坏大千世界，那什么东西不能被毁坏？就是阿赖耶识。为什么毁坏不了？因为祂的本性是空的，相也是空的，因此就没有什么可毁坏的。五阴世间都有相，有相就能毁坏，而且五阴世间都有生，那就有灭，阿赖耶识不生也不灭。如果房屋是空的，有人来偷东西，或者抢东西，或者要毁坏东西，他就不能得逞。空的没有什么可毁坏的，谁能把虚空给毁坏？阿赖耶识本性是空，因此也就毁坏不了。而阿赖耶识所变幻的一切法，都是有相的，有相的东西才能毁坏。当口袋里没钱时，谁能把钱抢走？只要有就能坏，只要有生就能有灭。</p><p>地界与地界性都是虚妄的、空的，了不可得，这样的事实真相，只有佛的智慧才能全部了别得到，全部都能证得，众生只能是相似的理解或者证得一部分，甚至是一小部分，等觉菩萨也不能够完全证知这些道理，只有佛的智慧才能把这些种子问题全部证知无余，如来藏里的功能种子全部证知，没有一点遗漏，所以佛是一切种智。初地以上的菩萨有道种智，对如来藏里面的功能种子只能了知一部分。一点都不了解的，就是初地以下的菩萨，或者是没有开悟的凡夫菩萨。了知的越多，智慧越高，菩萨的果位也就越高。</p><p>原文：<strong>大王。云何内水界。谓此身内。所有执受。湿润等性。涎唾脂髓。脓血便利。为内水界。</strong></p><p>释：大王，什么是内水界？内水界就是色身之内所执受的湿润、润滑、柔软等性，如口水、泪水、汗液、鼻涕、脂肪、脓血、大小便利等等，都属于内水界。</p><p>地界分为外地界和内地界，内地界就是色身里面的坚硬性。水界也分内水界和外水界，在身体内的湿润性就是内水界，水的特性就是湿润性，比如说人们激动的时候眼睛里含着的泪水，虽然眼泪没有流下来，却含有湿润性，那就是水性。身体热了出汗，有时没有汗珠，但还是有潮湿气，那就是水性，流出汗就更是水性了，皮肤里也有水，如果没有水，皮肤就会干巴巴地皱起来，不滋润了。</p><p>其实头发里也有水界，指甲里、骨头里、肉里也都有水界，内脏器官里都有水性，全身上下里外都有水界。如果没有水界，生命就无法维持了。每一个器官都有地水火风四大种性，它们合在一起组成了各个不同的器官，只是不同的器官四大比例不同。其中如果地性占的比例大，物质就表现出坚硬性；如果水性占的比例大，物质就显现出湿润性、柔软性，四大种性所占的比例不同，形成的物质就不同。</p><p>原文：<strong>大王。若时忽见。亲爱人等。眼中流泪。或为苦恼。所逼流泪。或闻深法。信重流泪。或为寒风。所吹流泪。如是水界。从何所来。水相干时。复何所去。</strong></p><p>释：大王，如果有人忽然遇见了自己亲爱的人，就会眼中流泪，或者被苦恼所逼迫就会流泪，或者闻到深法，信心踊跃欢喜就会流泪，或者是被冷风吹也会流泪，这些水界都是从哪里来的？当水干了以后，水界到哪里去了？</p><p>为什么见到亲爱的人、喜欢的人要流泪？眼泪属于水性，往下沉，与识心的贪爱情感有关系，爱重下堕，所以泪水要下沉。苦恼时流的是痛苦的泪，欢喜时流出的是激动的泪，都是因为情才流泪。而闻到深法的那种流泪，是心受到感化和得到感应而不自觉流的泪水。有的人因为善根非常的深，今世学佛以后，见到佛一拜佛，心里有很多很多的感触，眼泪就不自觉地流出来了，或者读了佛经，深受感化，也要流泪。当外边的风刮起来，吹到眼睛时，泪水就流出来了。这些泪水都属于内水界，内水界来自于哪里？眼睛里本来没有泪，外界条件一刺激，眼泪就出来了，泪水从哪里来？水干的时候，泪水又到哪里去了？</p><p>原文：<strong>乃至此界坏时。兴大黑云。三十二重。遍覆三千大千世界。降霔洪雨。点大如象。昼夜倾注。相续不绝。如是时分。经五十劫。其水积满。上至梵世。大王。此外水界。从何所来。</strong></p><p>释：乃至于三千大千世界毁坏时，天上降下了三十二重的黑云，遍覆了三千大千世界，然后降下的雨点就像大象那样大，昼夜倾盆大雨下个不停，整整经过了五十劫的时间，水都积满了欲界天，一直上升到色界天。大王，这外水界是从哪里来的？</p><p>外水界是在身体之外的水界，如宇宙虚空、山河大地所含的水份和湿润性。比如三千大千世界要毁灭的时候，水灾出现了，天空就兴起了大黑云，有三十二重，非常浓非常重，一层一层裹在一起，马上就要下大雨了，三十二重的黑云遍布了三千大千世界。三千大千世界有十亿个地球，十亿个须弥山，欲界六层天、初禅天都是十亿个，无数个星体，都被黑云给遮盖住了，然后像大象那么大的雨点就降下来了，遍布虚空中的整个三千大千世界，天界都淹没了。</p><p>那时地球上的人类早就灭绝了，地球也已经毁灭了，火灾已经把南瞻部洲和欲界天都毁灭了，欲界里已经没有了人类和天人，没有了生命体的存在。从地球到欲界六层天全部都是虚空，虚空却在下雨，雨下了五十劫。一劫按小劫算，就是一千六百八十万年，五十劫就是八亿四千万年，雨水把虚空都给淹没了，一直淹到初禅天二禅天，世界毁坏时就是这样的。这么多的水，都属于外水界，水来的时候没有处所，当水退去了以后，水又退到哪里去了？这么多的水退到哪里都成问题，到哪里就淹没了哪里。</p><p>众生刚入胎的时候，受精卵里并没有水，阿赖耶识把受精卵一点点变大的时候，里面就含有了水，那个水是从哪里来的？当众生死亡的时候，身体里的水界没有了，水又到哪里去了？水界来无所来，去无所去，这是小乘的讲法。从大乘的角度讲水界从哪里来？其实是从阿赖耶识里来，大乘讲一切万法都从阿赖耶识里来，小乘讲一切法都空，来无所来，去无所去，这是大小乘两种不同层次的讲法。</p><p>万法都是从一无所有中形成的，毁灭后也一无所有了，连灰尘都没有，连最微小的夸克粒子也没有了，世界就是这么虚妄。世界这样的大都能被毁灭了，众生想执著都执著不了，何况众生小小的身体就更容易毁灭了，所以一切法都非常的虚妄不实。众生生命形成的整个过程，从一无所有到一个受精卵，到出生，从小孩长大到成人，再到生命结束时色身躯壳再分散，还有什么？什么也没有，仅一点骨灰，时间一长，骨灰都没有了，谁能找到前世的骨灰呢？找不到，所以整个五蕴生命体，整个宇宙虚空都是空旷的，不可执著。</p><p>原文：<strong>又此世界。将欲坏时。有二日出。二日出已。小河泉流。悉皆枯涸。三日出时。无热恼池。所出四河。亦皆干竭。四日出时。大海水减。一踰缮那。或二或三。渐次减至。十踰缮那。或二十踰缮那。次第枯竭。至八十踰缮那。有余水在。或深至一多罗树。或深至胸臆。或深至牛迹。乃至少水。如指面量。当尔之时。大海水中。悉皆干燥。净尽无余。</strong></p><p>释：当娑婆世界将要毁坏的时候，就有两个太阳出来，夏天的时候，一个太阳众生都受不了了，何况两个太阳。两个太阳出来的时候，那些小河流，小泉池都晒干了；三个太阳出来的时候，从无热恼池流出来的四大河也都干了。四个太阳出来的时候，四大海的水就减了一个踰缮那（一踰缮那是印度的一个度量单位，代表由寻，一由旬是四十里地。）大海水是指我们地球下方的四大海，不在地球上，无热恼池也不在地球上，都比地球大无量倍。</p><p>地球上的海水早就没有了，四大海水又一直在减少，减去二由旬、三由旬。十由旬、二十由旬、八十由旬的量，最后就剩下一点水了，水深只有一棵树高，又往下减，水深只达到人体的胸部，又往下减到水如牛蹄的印子里那一点，最后就剩下只能覆盖手掌平放的手指面那么浅。比我们地球大无量倍的四大海水，就给太阳晒到只如牛蹄的印子那一点的水，及至水少到仅仅能把手指头盖住的一点水，最后就全部干枯了，大地就变得干燥了，一点水分也没有了。</p><p>四大海水刚刚形成的时候，水是从哪里来的？没有一个来处，最后四大海大都灭了蒸发了，水蒸发到哪里去了？到虚空里去了吗？虚空中如果有那么多水也装不下，虚空中如果有水也就不叫作虚空，就叫作大海了，所以大海水消失了也没有地方可去。水界就是这么虚妄，来无所来，去无所去，从空到空。整个三千大千世界就是这么虚妄，十方世界的佛国土也就这么虚妄，生来灭去，灭去生来，都是不可执著的。水界性，生的时候本来就是空的，灭的时候也是空的，从空到空，一无所有。</p><p>原文：<strong>大王。此水界相。生无所来。灭无所去。生时本空。灭时亦空。自性空故。无有男相。亦无女相。但唯言说。之所显示。如是水界。与水界性。皆不可得。唯佛正智。而能了知。</strong></p><p>释：大王，此水界相本身就是空的，它的自性也是空的。如果自性不空，那么水生出来的时候就有来处，水干的时候肯定也有去处。而水界生时，没有来处，灭时也没有去处；生的时候，水界是空的，灭的时候，水界也是空的。因为水界的本性是空的，所以水界性本身没有一个男相，也没有一个女相，但是水界形成色身的时候，就有了男相和女相，那么男女相也是虚妄的、空的。人类只不过是用一些语言表达显示出男女相罢了，并没有实际的男女相。因此说水界以及水界的性质都是了不可得的，这些道理只有佛的甚深大智慧才能全部了知。</p><p>水界本来没有男女相，什么相也没有，却从空无变出一个相，这就证明一切相都是虚妄的。为什么能现出这些相？因为有业种，有相的种子，阿赖耶识根据业种变现出男女相和世间一切相。是男人的业种，阿赖耶识就输送出地水火风种子形成男相，是女人的业种，阿赖耶识把地水火风种子的四大种性输送出来，造就出女人的色相。本来地水火风都没有相，阿赖耶识也没有相，而造就出的色身却有不同的相貌，这些相貌就是虚妄不实的。因为相是被幻化出来的，本来不存在，之后又能消失，从一无所有到形成一个相，又变回到一无所有，所以相就是虚妄的。</p><p>阿赖耶识没有相，地水火风四大种性也没有相，既没有人相，也没有天人的色身相，没有男相也没有女相，也没有畜生相，也没有饿鬼相，没有地狱色身相，也没有阿修罗的色身相。但是四大种子在形成色身的时候，就慢慢的造出一个相来了，人相、畜生相、男相女相、六道众生相就变造出来了。阿赖耶识不是随意没有规律地胡乱变相，祂是根据心体里所含的业种来变现的。</p><p>那么我们就不要埋怨自己的色身是如何如何的不圆满不如意了，要多问问自己为什么是女儿身病苦身，为什么相貌不端庄，要埋怨就埋怨自己过去世所造的业行，今世有什么样的相貌，由自己所过去所造的业决定，所以我们要想有一个好的色相，就要造善业。哪一个相最好呢？是佛的三十二相八十种好，这是最好最清净庄严的相貌。但是要想相好可真是不容易的，要不断地造善业，不断地消灭恶业、染污业，最后还要广造不善不恶的清净业，最后才能成佛，才能有佛那样的相好庄严。只造善业生天也不行，最后要造不善不恶的清净业，心得清净无为才能成佛，那时就具足最圆满的相貌了。</p><p>水界性了不可得，如果想把色身里的水界留下，能留下吗？不能留下，色身里的一切法都是了不可得的，都是空的。众生想抓也抓不住，想执著也执著不了，因此命终四大分解时，水界也同样分解了，众生想执著它留在色身之内，是留不住的。这种水界与水界性都了不可得，只有佛的智慧才能了知，众生的智慧都不具足，只能理解其中一小部分，然后再把这一小部分为众生宣说。佛说的三藏十二部经众生还不能完全理解，何况都证得，更何况佛还没有说出来的法，所以众生的智慧离佛的智慧，相差得还是很遥远的。</p><p>原文：<strong>大王。云何身内火界。若此身中。所有执受。温暖蒸热。咀嚼饮食。成熟变坏。便令安和。入热数者。名为火界。</strong></p><p>释：大王，什么是身内的火界？如果身体中所有能感受到的温暖、热度，能让咀嚼吞咽到身体里的饮食成熟、变坏、消化的，就是火界。消化以后，身体就能得到滋养，变得安详舒适，这些属于热能热量方面的物质就是火界。</p><p>火界有热性、暧性，如果身体里没有火性和温度性，胃里的食物就无法腐烂被身体吸收。所以众生吃的饮食再美味，色香味再具足，进入到胃里时，身体里的火性就把食物变熟变腐烂了，细菌也在胃里分解食物，使得食物糜烂容易吸收。所以众生所吃的饮食以及营养，是非常肮脏不净的，因此不可贪着饮食，常常作这种不净观，就能减少对饮食的贪欲心。</p><p>其实细想起来，色身从上到下、从里到外都是非常肮脏不净的，到处都是细菌，食物烂坏全靠细菌对饮食的分解作用，没有细菌的帮助，就吸收不了食物，是细菌在帮助肠胃消化吸收排泄，众生就靠这些有益的细菌才能正常生活。所以没有必要贪着迷恋自己肮脏的色身，以及其他众生肮脏的色身。</p><p>佛说众生的色身就像是一个活动厕所、一个大粪桶，由一层光滑的外皮裹着，把这层外皮揭开，浑身都会露出血肉、筋和骨头，血肉模糊，处处都是细菌，外皮也一样都充满了细菌，这时候外貌还美丽漂亮吗？如果修出了天眼通的时候，眼睛像显微镜一样，这时就会发现色身的内外充满了细菌，肉眼是看不到的，用天眼和借助于显微镜才能见到。那些细菌也在争斗，当细菌数量不平衡时，就患皮肤病和其它疾病，哪地方细菌数量不平衡，哪地方就有病患。众生饿了也是因为细菌饿了，细菌要吃食物的时候，众生就贪吃和嘴馋。</p><p>原文：<strong>云何外火界。谓不执受。温热相生。若复有人。于旷野中。寻求火缘。或以蒿艾。或牛粪屑。或兜罗绵。引火生已。或烧草木。山林聚落。及余方处。皆为所烧。</strong></p><p>释：什么是外火界？不是自己本身的阿赖耶识单独执受的温度、热度相，而是共业众生的所有阿赖耶识共同执持的温度和暖度相，就是外火界。如果有人在旷野中寻找生火的外缘，或者用艾蒿，或者用牛粪，或者用兜罗绵，用凸透镜等生火之器，把火引生出来以后，火就能燃烧草木、山林、村庄聚落，以及周围一切可触及之处，都能被大火所烧。</p><p>外火界，是由共业众生的阿赖耶识共同执持的，单独一个人的阿赖耶识无法执持外火界，只能执持自己身体之内的火界。过去不像现在有火柴有打火机，是用其它的非常原始的生火方法来生火，如拿凸透镜在太阳光底下照射聚焦，引燃蒿草、牛粪屑或兜罗绵，点燃以后，再拿这些来引燃其它的东西，这样才能生火做饭，或者烧烤其它的物质。</p><p>火燃烧起来以后，有可能会把草木山林聚落都烧毁了。本来山林中一点火也没有，万物生长得好好的，然而火一生出来，就会漫山遍野地燃烧起来，把整座山都烧没有了，多高的树木、多大的森林都被毁坏了，火势如果再蔓延，就能把整个世界都给毁坏。这火是从哪里来的？先不说是从阿赖耶识那里来的，先说火的空，如果火是从太阳来的，那么手里不拿凸透镜，任凭太阳照耀，也照不出火，引燃不了木块用来做饭。太阳如果有火能把森林烧燃了，也就能把众生身体都给烧熟了，那众生随时随地就会死亡，或者是出生即死亡，或者都不能出生了，那么世间就不可能有众生存在了，所以火不从太阳来。</p><p>火是从虚空来的吗？也不从虚空里来，如果虚空里有火，一切物体都将被烧毁，世间就会空无一物。火不从太阳来，不从虚空来，不从人手来，不从镜子来，不从草里来，火界没有来处，来无所来，这是小乘的说法。最后火灭了，火到哪里去了？没有一个去处，去无所去。如果有去处的话，哪里有火哪里就会被燃烧。火界就是燃烧性与热性，来无所来，去无所去，来时找不到来处，去时找不到去处，实质都是如来藏性，是如来藏的功能。所以万法归结到最后，全部归结到万法的根源如来藏上，除此之外，没有一法是真。</p><p>《楞严经》里佛说火从如来藏来，是如来藏性。但是如来藏什么相都没有，没有形、没有相、没有坚硬性、没有热度、没有水性、没有飘动性，祂连灰尘那么大点的色相都没有，但是祂却能变现出十方三千大千世界，这就太不可思议了。所以佛法学到最后，就会证得一切的法界实相，再也不迷惑颠倒了，圆满成就佛道。</p><p>原文：<strong>大王。此火界性。生无所来。灭无所去。生时本空。灭时亦空。自性空故。但唯言说。之所显示。如是火界。与火界性。皆不可得。唯佛正智。而能了知。</strong></p><p>释：大王，此火界性生无所来，灭又无所去。火界在出生之前没有一个来处，灭的时候没有一个去处。火界性本来是空的，从空当中产生的这么一点有，这点有再一点点发展壮大，然后灭了，灭的时候也空，没有一个去处。火界的自体性是空的、幻化的，不是实有的，只是语言所显示出来的一个假相罢了。因此说，火界与火界性，都是了不可得的，只有佛的正智才能完全明了。</p><p>火界的种子无形无相，阿赖耶识本身也无形无相，如果是有形有相的东西存在无形无相的阿赖耶识里，能存得了吗？一是不能存，二是如果能存，阿赖耶识也就成为了有形有相的东西了，那就能眼见和手触，证得阿赖耶识就极其容易了，人人都可成为一个证悟的菩萨。阿赖耶识不是一个什么袋子和器皿，祂无形无相，存不了有相的色身，但是祂却能变现出色身来，真是不可思议。不可思议的时候，是因为众生没有智慧，等智慧具足的时候一切法都可以思议了。佛有智慧，佛能思议，众生学佛显现出大智慧时，对于一切法都是能够思议的，思议一切法都不成问题，对于法就不再迷惑不解了。</p><p>不知道法界实相就会迷惑颠倒，认为万法都是实有的，都值得贪爱，都要抓取，结果就执取了生死苦，在生死苦海中漂泊，不得出离。知道了万法的真实相，就不再迷惑颠倒，有智慧的时候，就要认识真相，不在假相上颠倒执著。</p><p>原文：<strong>大王。云何身内风界。轻动等相。谓此内风。或时上行。或时下行。或住腹间。或胁或背。或发瘾胗。或聚成块。或如刀裂。或如针刺。出入息等。遍满身支。</strong></p><p>释：大王，什么是身体内的风界轻飘、轻动等相？动相就是身体里的由下而上的风；或者是由上而下的风；或者是由左到右、由右到左的风；或者是住在腹部、腰胁、后背的风；或者是引发湿疹、鼓起成块的风；或者是让身体感觉如刀割和针刺一样疼痛的风；还有呼吸的出入身体的风，这些种类的风遍满了身体四肢。</p><p>风的特性是轻飘的，有风的推动时，走路和骑车就很快，风一刮，有些轻的东西就被风吹得往上飘。风还有一个特性是动，风能让物体不稳定，产生动转。身体里面的风，或者从下往上走，或者从上往下走，或者是从左往右走，从右往左走，这些流动性就是风的动性，打坐的时候气脉一动，就能感觉出来。气脉就是风，气脉到哪里，身体的感受就在哪里出现。本来坐着时身体是弯弯的，气脉一运行到身体背后，后背马上就挺直了，不用故意坐直，身体自然而然就挺直了，这就是风的动性对身体的支配作用。</p><p>身体能运转，那是因为身体内有风性，没有风性肢体都不能动，口也不能说话。言语是如何产生出来的呢？内心里有觉观、有感受了，就想用语言表达出来。然后身体里就生起一股风，风触着脐，再往上触，触心脏和肺，再往上触气管、喉胧，再触舌头、牙齿、嘴唇，之后语言就产生出来了。</p><p>没有风界语言就生不出来，风性就是动的，语言也是动的，没有风性，肚脐就不能鼓动，不能形成语言声音。任凭内心有多少想法，没有风的作用，语言就不能产生，思想观念就表达不出来。众生之所以能说话，能用语言表达，说明身体内部一定有风性，风一动，触着内脏器官，就把语言表达出来了。风的动能不足时，人就少气懒言，说话费力。因此说语言也是虚妄的，语言的一个声音一个声音都藏在哪里呢？没有地方可以藏；说完话，言语灭了，灭到哪里去了？也没有灭处。</p><p>世间一切的事理都是这样的虚妄不实，从一无所有又到一无所有，一切都了不可得。像这样多作观行，就能证得人空和一切法空，慢慢的就没有什么法是放不下的了，放不下是因为理不通，或者明白一点，但是因为没有实证。理通透了以后，就会知道从色身到整个宇宙、山河大地、三千大千世界、十方佛国土，都是从一无所有再到一无所有，没有一个法是真实的。</p><p>实证需要深入禅定，深细观行，如果没有真正的观行的过程，修行都会不得力，就没有力量降伏烦恼，一遇到具体人事的时候，还是把接触到的一切法当作是真实的，而去执著和烦恼，定力不够，福报不足，观行智慧也不足时，就不能获得无我之果。</p><p>原文：<strong>云何外风界。谓若此风。从四方来。或狂暴起。摧折树木。堕裂山峰。若微细起。飘举身衣。动多罗树。名外风界。</strong></p><p>释：什么是外风界？外风界就是指色身之外的器世间中的风界，从虚空中四面八方刮起的风，或者是狂风大作，摧折了树木，或者是吹堕了山峰的暴风；如果是微风，就要飘起身上的衣服，摇动着多罗树，这些都属于外风界。</p><p>外风界是在身体之外发起的，器世间里四面八方都有风。最大的风是暴风、龙卷风、狂风，能把树木吹折，山峰吹裂，这还不算是最大的风，宇宙最大的风能把三千大千世界吹毁，龙卷风和暴风都不算什么。世界要毁灭的时候，那个风灾一来，器世间全部吹毁，这是外界大风的作用。如果是细风吹来，轻薄物就被飘举起来，小草树叶摇摆，让人深感惬意，这是外界微风的作用。</p><p>外界空中的风刮起的时候，风起之前风在哪里？风没有处所，没有地方可以藏。如果风能藏在哪里，所藏之处就会不停摇动。大暴风通常都是无缘无故就刮起来了，把物体吹折以后，暴风消失了，风到哪里去了？没有地方可以去。如果有地方可藏暴风，这个处所也会被吹毁，不复存在了。</p><p>原文：<strong>大王。此风界相。生无所来。灭无所去。生时本空。灭时亦空。自性空故。无有男相。亦无女相。但唯言说。之所显示。如是风界。与风界性。皆不可得。唯佛正智。而能了知。</strong></p><p>释：大王，此风界相，生的时候无所从来，灭的时候也无处可去。说明风生的时候是空的，灭的时候也是空的，风的自性就是空的。风界没有一个男相，也没有一个女相，没有男相女相，但是风界形成色身时，就有了男女相之别，所以男女相也是空的、虚妄的。风界自性是空的，只是用言说来显示一下风界，并没有实质的风界。因此说风界与风界性都了不可得，这个道理只有佛的智慧，佛的正智才能了知。</p><p>风界本身虽然没有男女相，但是一个人如果能造男人业，就会出生男人色身，如果造女人业，就会出生女人的色身。女人如果能造出男子大丈夫的业，来世就会转变为男子的色身，男子如果做女人的事，有女人的心性，业种存在阿赖耶识里，来世就会转变为女人的色身。果报身是随着业行业种而转变的，能变的就是虚妄的，不是真实的，就是无我的。真实的法永远不改变，只有阿赖耶识是永远不变的，是实相心体。</p><p>原文：<strong>大王。云何内空界。若此身内。皮肉血等。显现增长。离质碍性。谓若眼窍。耳穴面门咽喉。咽啖饮食。所引滋味。于肠胃间。通彻而出。</strong></p><p>释：大王，什么是内空界？如果这个身体内的皮、肉、血等等，能显现出其增长没有质碍性，就是内空界。有质碍性就被限制住了，皮肉和筋骨都不能生长。眼眶、耳孔、面门的鼻孔、咽喉等等有空隙无物之处为空界。品尝吞咽饮食以后，饮食能顺着食道进入肠胃里，消化以后又排出去，从口腔到食管到胃里到大小肠，这条通路就是空界，没有质碍。如果不空就有质碍，饮食就不能进入身体中，更不能排出体外。</p><p>什么叫空界？这里的空就是指虚空，一无所有的空，空旷的意思。内身里没有皮、没有血、没有肉，没有阻碍就是空。血管里有空间，血液才能流动；气管是空的才能呼吸；肠胃里有空界，食物才能在里面流动；身体里有空间，气体、液体、饮食、大小便利等等才能在里面流动，细胞才能分裂，肌肉筋骨等等才能生长。</p><p>身体细胞里有空隙和空间，细胞里的各个微粒才能在空隙里沿着各自的轨道而运动。细胞里的电子、质子、离子、质子、核子等等粒子之间都有空隙，微粒之间才能发生各种物理和化学反应，细胞才能发生分裂和增长，色身才能发生变化。细胞和细胞之间也都有空隙，呼吸的氧气才能进到身体细胞里产生血液，在身体里面流动。身体里的各种空隙就叫作内空界。</p><p>原文：<strong>若时业缘。引生六处。诸处生已。围绕空界。此说名入。内空界数。然彼空界。从何所来。又若方处。外所显现。离质碍性。名外空界。</strong></p><p>释：如果业缘成熟，阿赖耶识就会出生色声香味触法六尘处。六尘处出生以后就围绕在空界里，名为六入，属于内空界数里。可是这些空界是从哪里来的？另外，如果在色身之外各处，所显现出来的没有质碍性、没有物质色法之处，就是外空界。</p><p>六处就是色声香味触法，每一种色法都由地水火风四大组成，而且还有一个空大，也一起组成色法，那么色法就由五大组成，色法里就有空间和空隙，色法里的四大物质就包裹着空间，由于物质色法里的空间大小不同，空大所占的比例不同，物质色法的密度就不同，物质的物理属性就不同。而且这六处色法都是在六识心中所显现出来的，是在后脑胜义根处成像的，因此属于内六尘，其中胜义根处的空就属于内空界。内空界是从什么地方来的？来时没有来处，去时也没有去处。</p><p>身体外边没有物质的地方就是虚空，叫作外空界，外空界无边无际的广大，十方世界都在虚空中建立，想建立多少个佛国土，都能建立起来。为什么如此？因为虚空无边际广大，不是真实存在的法。如果虚空是真实有的，就有固定的界限和边际，就不是无边无际的了，佛国土的建立就不能超出这个范围，那么佛国土就有限量了。而虚空没有界限，所以能随意建立三千大千世界，所有众生都成佛时，每尊佛都有自己的三千大千世界，世界也不重叠，也不拥挤。因为虚空没有边界，不是物质的色法，是无物的，因此可以容纳一切物，外空界就是这样。</p><p>原文：<strong>大王。若色变坏。一切皆空。所以者何。是虚空界。本无尽故。安静不动。犹如涅槃。遍一切处。无有障碍。</strong></p><p>释：大王，如果物质色法变坏了以后成为了空无，就是空界了。为什么物质消失了，一切都空了呢？因为虚空界是没有尽头、没有边际的，一切处都可以成为空。而虚空本来就安静不动，不生不灭，不增不减，如涅槃性一样。虚空遍一切处，没有能障碍它的法。</p><p>物坏则成虚空，如房子毁坏了，此处就全部变成虚空了；地球毁坏了，地球这个地方就全部变成虚空了；三千大千世界毁坏了，三千大千世界都成为虚空了，虚空中一无所有。虚空是安静不动的，为什么不动？因为它是无物假，物体也是假的，但是物体可以移动，却没有人能把虚空移动一下。在虚空中建筑一座很高的楼房，能把虚空挪动吗？不能，只是有物之处就不空，无物就空。虚空是不动的，谁也不能移动虚空，因为虚空无物，又无边际，怎么能动呢？虚空里无物质色法，是一无所有和空无的。众生时刻都需要虚空和空无，为的是能够活动身体和摆放物体，因为虚空没有障碍，众生就需要这种没有障碍的作用，为了活动和存放东西。</p><p>有人说空气也是空的，也应该是与虚空一样无边无际，不能移动。可实际上空气与虚空是有很大差别的，空气是四大组成的物质色法，虽然表面看起来也是无物的，看不见摸不着，但是仪器能检测出空气的有无，空气是物质的，里面有众生所需要的各种气体，因此空气才能流动。众生需要空气，最主要是需要空气里的氧气用来呼吸。</p><p>原文：<strong>大王。譬如有人。于彼高原。穿凿池井。于意云何。是池井中。所有空相。从何所来。王曰。无所从来。</strong></p><p>释：大王，譬如有人在高原的土地上开凿一口井以取水，把土挖出来，就有一块空处，有一个虚空出现。你怎么认为？这个池井中所有的空相是从何处过来的？净饭王说：这个空相没有来处。</p><p>每挖一口井，就出一块井那样大的虚空，井当中所有的空相是从哪里来的？没有来处。因为没有物质之处就是空，空不是物质之法，如果再把土填回去，空就消失了，空到哪里去了？没有去处，哪里也不能多出一块虚空；挖土出一块虚空，其它地方的虚空也没有减少。阿赖耶识就类似于虚空这样不增不减，因为祂无形无相，遍一切处，无处不在。</p><p>原文：<strong>佛言大王。设使彼人。复填以土。于意云何。空何所去。王曰。空无所去。所以者何。是虚空界。无去来故。不住男相。亦非女相。大王。外虚空界。本来无动。自性离故。但唯言说。之所显示。除佛正慧。而能了知。</strong></p><p>释：佛说：大王，假使那个人再把土添满池井，你怎么认为，空相哪里去了？净饭王说：空相也没有去处。为什么是这样呢？因为虚空界本来就没有来去的缘故。虚空界没有男相，也没有女相。大王，外虚空界本来就没有变动过，其自体性离一切相，虚空没有什么实质，只是言说能显示虚空罢了。只有佛的无上大智慧才能完全了知其中的内涵。</p><p>虚空界没有来，也没有去，阿赖耶识也同样像虚空一样不来也不去，祂无形无相。你从家到这里来了，你的阿赖耶识有来吗？阿赖耶识没有脚没有翅膀，不能来；当你回去的时候，阿赖耶识回去了吗？也没有去，同样是无形的缘故。所以过去的禅师就问徒弟：“你从哪里来？”弟子说：“我从上海来。”师父又问：“你是坐船来还是走路来的？”弟子回答说：“我是坐船来的。”师父一听，就说：“在你没有坐船来之前，我就应该给你一棒了。”是应该打，你能坐船吗？曾经坐过船吗？拿什么坐船？自性就像虚空一样不来不去，无相故，禅师问话都不离自性。</p><p>原文：<strong>大王。云何识界。谓若眼根为主。缘彼形色。及彼表色。名眼识界。若余五根。缘于自境。各别建立。名五识界。又此识界。不着于根。不住于境。非内非外。及二中间。</strong></p><p>释：大王，什么是识界？识界的意思就是说，如果以眼根为主，攀缘色尘的形色和表色，就叫眼识界。如果其他五根都缘各自对应的尘境，各别建立所对应的尘境，就叫作五识界。另外，这个识界，不附着在根上，也不住在尘境上，不在根和境的内外和中间。</p><p>识界是指眼耳鼻舌身意六个识，以眼根为主，缘就是依靠依赖的意思，眼根等作为出生识心的助缘，以眼根为主攀缘依赖色尘的形色（有形状的色），比如长短、方圆、高矮、胖瘦，这叫形色，有形状的色。以及表色，表色就是色所表现出来的行住坐卧、屈伸各种动作等等。这里说以眼根为主，同时还有意根在缘色尘上的法尘无表色，这时就有眼识和意识的出生，共同了别色尘的形色和表色，还有显色和无表色。根尘相触，阿赖耶识产生的眼识和意识就叫识界。</p><p>其它的五根也是这样，以耳根为主攀缘于声尘，意根也攀缘声音上的法尘，阿赖耶识出生耳识和意识，共同了别声尘；以鼻根为主攀缘于外界的香尘，产生鼻识和意识，共同了别香尘；以舌根为主攀缘于味尘，产生舌识和意识，共同了别味尘；以身根为主攀缘触尘，意根同时攀缘触尘上的法尘，产生身识和意识，共同了别触尘。这几个识就叫识界。</p><p>识界都不住在根上，也不住在境上，也不在根和境的里外和中间，因为识界无形，与色法既不混在一起，也不融合在一起。</p><p>原文：<strong>然此识界。各各了别。彼彼境已。即便灭谢。生无所来。灭无所去。大王。识生时空。灭时亦空。自性离故。不住男相。亦非女相。但唯言说。之所显示。如是识界。与识界性。皆不可得。唯佛正慧。而能了知。</strong></p><p>释：然而这个识界各各了别了各自所对应的尘境之后，就灭去了。识界生没有来处，灭也没有去处。大王，识界生的时候是空的，灭的时候也是空的。其识界的自体性离一切相，也是空的，不住在男相上，也不住在女相上，识界只是言说所显示出的虚相罢了。因此说识界以及识界性，都是了不可得的，只有佛的无上圆满的大智慧，才能圆满无碍的了知其内涵。</p><p>眼识了别色尘以后，眼识就消失了；耳识了别了声尘以后，耳识就消失了；鼻识了别香尘以后，鼻识就消失了；身识了别触尘以后就消失了；意识了别法尘以后就消失了，这六个识来无所来，去无所去，来时是空，灭时是空。眼识产生时，没有处所，不从眼根和色尘中来，不从虚空来，不从大脑来，来无所来。灭时也没有灭处，不到眼根中去，不到色尘中去，不到虚空中去，不到大脑中去。这只是讲小乘的说法，在大乘上来说，都从阿赖耶识中来。</p><p>识界的自性就是离一切法，不着一切法，自体性本是空的，识性不住在男相上，也不住在女相上，没有男相，也没有女相，但是识性却能了别出男相和女相。识界本没有形和自体相，只是以言说来显示罢了。因此说，识界与识界性都是了不可得的，执著不了也抓不住的，只有佛的正智正慧才能彻底的了知这件事。</p><p>这几个识也不住在眼耳鼻舌身意六根上，也不住在外界的色尘、声尘、香尘、味尘、触尘和法尘上，不住在根和尘上，也不住在一切法上。识界本身没有男相和女相，只是言说的一种假相、一个名词而已，所以六识界以及识界的性质是了不可得的。识的性质是分别，眼识分别色，耳识分别声、鼻识分别香臭，舌识分别酸甜苦辣，身识分别触尘，意识分别法处所摄色，其自性都是了不可得的。只有佛的正慧才能够把这件事情完完全全地了知，众生只能了知一部分或者是极小一部分，或者是不了知。</p></div>"
},{
    "title": "第四章 分说六触处",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第四章  分说六触处</strong></p><p>原文：<strong>大王。云何眼处。谓四大种。地界水界。火界风界。所造净色。若地界清净。则眼处清净。若水火风界清净。则眼处清净。</strong></p><p>释：佛说：大王，什么是眼根处？眼根处就是四大种子地界、水界、火界、风界所构造出来的清净色根。如果地界清净，那么它所构造出来的眼根处就清净；如果水界、火界、风界清净，和合所构造出来的眼根处就清净。</p><p>眼根是由地水火风四大种子和合在一起所组成的物质色法，含有地的坚硬性、水的湿润性、火的温暖性、风的流动性。眼根包括面部上的眼浮尘根和后脑部位的眼胜义根，都是由四大种子形成的。</p><p>四大种子是如来藏里本有的种子，当出生眼根的因缘成熟时，如来藏把四大种子输送出来，就形成了眼根，内外眼根都是在母胎里逐渐形成的。《楞严经》中世尊形容人的眼根像葡萄朵那个形状的，就是眼处。</p><p>如来藏中地水火风四大种子本来是清净的，没有染污，没有贪嗔痴烦恼。这四大种子按照一定的比例和合起来，形成眼根，种子和合的比例不同，形成的物质色法也不同。由于四大种子清净，形成的眼根就是清净的，没有贪嗔痴烦恼，没有染污。但是依眼根为缘而出生的眼耳鼻舌身意六个识却有染污，有烦恼，眼根本身没有染污，也没有喜怒哀乐，因为眼根没有心行。</p><p>原文：<strong>何以故。由地界清净。眼处得生。是中无有。少法可得。如是乃至。风界清净。眼处得生。是中无有。少法可得。何以故。无主宰故。无造作故。犹如涅盘。自性清净。</strong></p><p>释：为什么四大清净眼处就清净？因为由于地界清净故，眼根才能依赖之得以出生，虽然眼根出生了，但也是了不可得。如是由于水界清净故，眼根就能依赖之得以出生，但也是了不可得的；由于火界清净故，眼根才能依赖其得以出生，但也是了不可得的；由于风界清净故，眼根依之得以出生，但也是了不可得的。为什么眼根是了不可得的？因为眼根的出生是没有主宰，没有任何造作的，犹如不生不灭的涅槃心一样，自性是清净的。</p><p>地界清净，构成的眼处就清净，因为原材料清净，组成的色法就是清净的。如果水火风界都清净，所构成的眼根就清净，因为原材料清净，组成的色法就清净。外表看是有眼根色法出现，有色法的相貌，但是色法是如此的虚幻不实，四大种子一点点的流转出来，眼根一点点的形成，从一无所有中建立起来；而其原材料是无形无相空性的种子，种子是从如来藏中流转出来的，那么眼根的实质就是如来藏，完全归属于如来藏，因此眼根自性了不可得。</p><p>因为如来藏自性清净，不生不灭，不增不减，不来不去，输出的四大种子清净，构成的眼根自性也清净，不生不灭，不增不减，不来不去，没有自我主宰性，没有造作性，全部是如来藏的属性，无有眼根的少法可得。</p><p>地水火风没输送之前，我们有没有眼根的存在？没有，原来是一无所有的，如来藏输送出地水火风四大种子，就开始形成眼根，眼框、眼睛玻璃体、视网膜、视觉传导神经，从一无所有渐渐形成了物质色法，最后又散坏，眼处就没有少法可得。</p><p>地水火风四大种子也是无形无相的，不是物质色法，如来藏是无形无相的，把无形无相的种子输送出来就形成了有形有相的色法，从一无所有形成了一个有形有相的物质。是中没有少法可得，什么也得不到，地性不可得，水性不可得，风性不可得，火性不可得，那么眼根、眼球、玻璃体、视网膜等就是不可得的，虚妄的，说毁灭就毁灭的，是不可依赖，不可执取的。</p><p>地水火风四大种子都是不可得的，形成的物质世界也是不可得的，是中无有少法可得，为什么？因为物质色法没有自主性、没有主宰性、没有自在性，是幻化出来的不实的。这当中没有一个做主宰的人，没有人去造作它。谁去造作？如果说我们造作，谁叫我们？眼根未出生之前，没有五阴，没有所谓的我们，如来藏不做主宰，也不造作，因此没有造作眼根的人和法。</p><p>原文：<strong>大王。如是眼处。各各寻求。皆不可得。所以者何。地界空故。则地界清净。乃至风界空故。则风界清净。若诸法自性本空。则彼界何有清净。亦无忿诤。若净若诤。皆不可得。复有何色。而可见耶。</strong></p><p>释：佛说：大王，这样的眼根，从各各方面推寻，都是找不到的，了不可得。为什么了不可得？因为地界是空的，地界清净；乃至于水界、火界、风界是空的，水界火界风界清净，没有一法存在。如果諸法都是自性空的，那么各个法界也就没有清净之说，也没有染污、忿恨和争论之说，諸法的清净与染污都是不可得的。那还有什么色可得，一切色法都不可得。</p><p>眼根无论我们怎样推求，都是不可得的，其性是如来藏性，其相是如来藏赋予的，是幻化的，相不可得；组成眼根的地水火风四界，其相是空，其性是如来藏性，也是空。因为空故，则四大清净，四大清净故，则眼根清净。眼根自性空故，也无有清净与不清净相，其相了不可得，其清净性与染污性也了不可得。眼根自性是如来藏性，没有自体性，也是空的。</p><p>在眼处寻求地性，是不可得的。地性本身是空的，无形无相，一个无形的种子，了不可得；形成的眼根，也是了不可得的。那么水界、火界、风界性质都是空的，无形无相，四大种性了不可得，是空的，形成的眼根，也是空的，了不可得；那么寻求眼根的自性，是找不到的，因为眼根没有自性。</p><p>佛说诸法自性本空，因此眼根这一法，自性本来就是空的，空来空去一无所有。眼根出生之后，还会灭去，变成一无所有，既没有来处，也没有去处，本身就是空的。地界、水界、火界、风界都是本性空的，形成的眼根自性就是空的，眼根界也没有一个清静或者是不清净之说，不存在清静和染污，不存在是好是坏，因为本身是空的，不能说它清净与否、纷诤与否。</p><p>原文：<strong>当知眼处。毕竟空故。自性亦空。前际后际。皆不可得。未来所造。亦不可得。何以故。自性离故。若自性无有。则无男相。亦无女相。何有爱乐。若生爱乐。是魔境界。若无爱乐。是佛境界。何以故。若无爱乐。则能远离。一切诸法。</strong></p><p>释：我们应该知道眼根处毕竟空故，所以眼根自性也是空的，眼根的前际和后际都不可得。为什么这样说呢？因为眼根的自性离一切法。如果说眼根没有自性，那么眼根就没有男相，也没有女相，那男女相就没有什么可爱乐的。如果对男女相生爱乐心，就是一种魔的境界。如果对男女相没有爱乐心，就是佛的境界。为什么这样说呢？因为如果没有爱乐心就能远离一切法，心得清净。</p><p>色法本身是空的，由地水火风四大种子所形成，地水火风本身是空的，形成的物质世界就是空的，了不可得。眼根同样是空的，了不可得，不可执着。本来没有一个眼处，没有眼根，四大种子输送出来，从一无所有处出生了眼根，最后又到一无所有，形成的过程和结果都是空，有生有灭之法，一无所有之法，就是空的。什么法不空？我们那个如来藏心不空，别看祂无形无相，但是祂时时刻刻在生心，时时刻刻在起作用，时时刻刻在给我们变万法，除此之外一切法都是空。</p><p>如果眼根不空的话，就会一直存在着，没有生同样也没有灭，它能自我主宰，而没有能够主宰它生灭的法，但是眼根于此正好相反。如果眼根能被出生，也能不由自主的灭去，只要不被摄持就要灭去，那就是空的，幻化的。眼根是如何形成的？地的成分加进去，水的成分、火的成分、风的成分加进去混合起来，四大种子按照一定的比例，排列组合在一起，和合起来形成了眼根的肉体。业缘消失了，四大种子分散，眼根就消失了，空来空去，没自体性，了不可得。</p><p>我们不应该对眼根生起贪爱和欢喜，说好说坏，实际上没有好和坏，都是虚妄的空的，所以眼处毕竟空，前际后际皆不可得。前一世的眼根，后一世的眼根，现在的眼根和以前的眼根，今天的眼根和昨天的眼根，都是不可得的。昨天对于今天来说就是前际，明天对于今天来说就是后际，我说话的当下是本际，说话之前叫前际，说完话以后就后际。这样连接起来的前际后际，前际后际了不可得，都是空。</p><p>前世的眼根也是不可得的，毕竟拿不出来，到处找也找不到；未来再造出一个眼根来，那个眼根仍然是不可得的，现在毕竟也是拿不出来，还没有出现的法，更是虚妄。现在的眼根念念在生灭，刹那都在变化，也是不可得的。近视眼、老花眼、青光眼等等眼疾的出现，说明眼根是变化的不可靠的，让它保持一个健康正常状态都保持不了，其自性确实是了不可得的。</p><p>眼的自性离一切法，不着一切法，既没有一个男相也没有一个女相，我们就不必对眼根升起爱乐心贪爱心。眼根本身没有什么相，无男相也无女相，如果对眼根升起爱乐，就是魔的境界，着境就着魔；对任何事物产生喜怒哀乐的感情就是魔的境界，有这种感情，永远在魔的掌控之下。魔王叫波旬，他在欲界最高层第六层天，他因为福大，掌控了整个欲界六天，包括人间。一个众生如果没有欲界法的贪欲，就脱离了魔的手掌，那魔王就会想方设法让其对欲界重新生起贪欲心。只要有贪欲心，就在欲界里不得出离，就是魔王的弟子，就是魔子。</p><p>每个人在未到地定具足，即将要发起初禅的时候，魔王就用各种手段来障碍，在每个人内心里最薄弱之处下手，攻破薄弱部分，让其贪欲心生起，禅定消失，就脱离不了魔掌。如果定力坚固，没被魔王破坏，命终会升到色界天，比魔王境界高，就不受魔王管辖和控制。</p><p>欲界里有什么？欲界里有各种贪欲，有财色名食睡，以男女欲为主，如果超越了这个欲，断除了这个欲，魔宫就震动。如果修行人道心不坚固，福报不足，很容易就能被干扰，禅定就消失。魔是最希望这样的，所以他会想方设法让众生喜欢贪爱这个欲界世间，那么他的子民就不会减少。魔王都是希望自己的子民越来越多，所以才要想办法控制自己的子民，让众生都有贪欲心，不脱离自己的掌控。</p><p>所以佛说若生起爱乐心，就是魔的境界，我们世间的人全在魔王的掌控之下，也受着住在欲界忉利天的释提桓因的管辖。欲界人类如果修善，释提桓因是最高兴的，因为修善的人命终会升到欲界天，释提桓因的子民就增加了。所以初一、十五他会派天人护法到人间巡视，看看行善法的人多还是行恶法的人多，如果修善法的人多，释提桓因就高兴，如果行恶法的人多，释提桓因就不高兴。人间知道了此事，就在每月的初一、十五供佛、吃斋、吃素、行善，为了多行善业，死后升天享乐，有些时候世间人做事是有一定道理的。</p><p>没有爱乐心就是佛的境界，在佛的境界里没有爱乐心，不对五欲六尘有任何喜乐和贪爱。佛就是如来，如来就是如来藏，祂没有喜怒哀乐，既不喜欢，也不厌恶，祂是无为性的。前七识心有喜怒哀乐，真心没有喜怒哀乐。当七识心喜怒哀乐的时候，其中有真心的随顺配合，否则七识妄心也不会有喜怒哀乐的现象出现。在一切法上都是真妄二者共同运作，在七识喜怒哀乐时，有个不喜怒哀乐的如来藏在不断的输送各类种子，以保持七识现行其喜怒哀乐的心行，找到这个背后默默无闻无偿奉献者，就明心开悟，获得般若智慧了。</p><p>为什么说没有爱乐心就是佛境界？佛说，若无爱乐，则能远离一切诸法。因为諸佛已经寂静无为，世出世间一切法都不执著，不着境，心中无有法的存在，究竟远离了一切法。佛虽然在五蕴的虚妄相上要不断的造作，以广度无量众生，但并不妨碍佛心无所住，对一切法都不生起爱乐心。法身佛更是对世出世间法心无所住，远离一切法和相，对一切法都没有爱乐心。</p><p>我们不能远离诸法的原因是什么？因为贪爱和执著，有爱乐心，所以心住于一切法，不能分离。对世间一切法我们都希望拥有占有，这就是爱乐心；如果没有爱乐心，就会心无所住，不希望拥有和占有。这样心就不被一切法束缚，有了解脱的力量，就能得到解脱。对欲界不生起爱乐的人，初禅定就生起了；对初禅的境界不爱乐的人，禅定境界又提高了；对更高的禅定境界也不爱乐的人，就能达到三界最高的境界；对三界世间的法都不爱乐的人，就会入到灭尽定，那是四果罗汉的境界。命终就能把自己的前七识都灭了，色身灭了，七识灭了，五阴灭了，就入到无余涅槃里，解脱于三界生死，不再轮回。</p><p>阿罗汉能入无余涅槃，了生脱死出三界，就是因为他对三界世间法没有爱乐的心行了。我们在三界里受苦，尤其在欲界里受苦，生在欲界的人间，不是生在欲界天上，就是因为我们对欲界法的爱乐心比天人要深厚，比色界天人更深，比无色界天人那就深得不能比较了。爱乐心越淡，命终生到的天界越高，生命越快乐越寂静，苦受越少，爱乐的心越重，苦越重；如果没有爱乐心，能远离一切诸法，心得清净和寂止。</p><p>我们真心里本来就没有一切法，《心经》里说：无眼耳鼻舌身意，无色声香味触法，无眼界乃至无意识界；无五蕴、无十八界、无四圣谛、无十二因缘、无菩萨六度、无智也无得，真正的远离一切法，没有一切法，寂灭无为。我们心里却都是五欲六尘，追求的都是三界世间法，因此喜怒哀乐不断，苦受不尽。</p><p>世间法拥有的越多就越苦，越不能得解脱，我们就被生死苦所系缚着。喜乐于色，被色所系缚，被色身所系缚，不能得解脱；喜乐于声尘，就被声尘所系缚，不得解脱；喜乐于味尘、触尘和法尘，就被系缚着，不得解脱。对于六尘境界不管是喜欢还是厌恶，都是烦恼，都是系缚，不得解脱，就会留在欲界中苦恼忧悲。</p><p>真心对一切法都无爱乐也无憎厌，因此就不被任何法所系缚，永远是解脱的，没有生死忧悲苦恼。有爱乐就要流落六道里受苦，真心不爱乐，不在六道里，不住在六尘境界里受苦。有境界可住，就被束缚，解脱不了，不住在一切境界上，就离开了，解脱了。所以我们修学的目标，就要向真心一样，慢慢能远离一切诸法，空净自心，趣向涅槃。</p><p>原文：<strong>大王。云何耳处。谓四大种。所造净色。分别行相。如前所说。大王。诸法解脱。决定现前。如法界空。不可施设。</strong></p><p>释：佛说：大王，什么是耳处？耳处就是四大种子所创造出来的清净色相，其耳处的相貌与眼处类似，由四大种子和合出生。四大种子清净，则耳处清净，其中无有少法可得。四大空故，耳处自性空；四大解脱故，耳处本自解脱，无有一法可以系缚于人。大王，諸法本自解脱，其解脱相处处都在昭示和显现着，如一真法界的空一样，本来如此，不是人为施设出来的。</p><p>耳处是指耳根，包括外耳根和内耳根，都是清净四大所成，因此本身也是清净色，没有烦恼，没有染污。所谓的清净，指没有喜怒哀乐，没有贪爱、爱乐和厌恶。耳根与声尘接触时，从来不说我喜欢这个声不喜欢那个声，它没有心行，善恶心行都不存在。染污是心有染污，耳根不染污。构成耳根的地水火风四大是空的，耳处也是空的，其自体性了不可得。地水火风四大种性了不可得，耳处也不可得。</p><p>解脱就是不被系缚，一切法本身既然是了不可得的，因此不能系缚于人，是众生自心认一切法为真为我，攀附不断，于是自愿粘着一切法，自不得解脱，与法无关。如果能证得一切法都是不可得的，再也不想抓取了，就得解脱，不再被諸法所捆绑。众生都是被六尘境界捆住了，被自己的五阴身捆住了，绳索一环套一环，锁得很坚实，犹如在三界的监牢里一样，没法挣脱束缚，冲出牢狱。根结就在于众生自心对诸法没有认识清楚，不知诸法是空的幻化的不实的，诸法根本不系缚人，所以也没有必要去攀附。众生如果能认识到这个道理，内心自然就从虚妄的境界当中解脱出来。诸法解脱决定现前，众生也本来就解脱，只因迷失了真相，徒自束缚。没有一个众生是不能解脱的，除了仍然在痴迷的人。</p><p>世间一切法本来都是空幻的，不用我们去空它，一切法本来就是解脱的，不用我们去解脱，只要我们认识到了真相和真理，没有一法不空，没有一法不解脱。我们不能施设诸法为有，十法界、十八界也都是如此空幻，因此没有众生，没有圣贤，没有六根，没有六尘境界，也没有六识，那就没有任何系缚，也没有被系缚者，系缚与被系缚皆为幻相，了不可得。</p><p>原文：<strong>大王。诸根各各。乐着境界。眼缘色时。而生爱乐。是故说色。为眼境界。又此眼根。缘于色境。有三种相。见可爱色。起于贪想。不可爱色。起于嗔想。非爱非恶。而起舍想。</strong></p><p>释：佛说：大王，六根都各各爱乐着各自所对应的境界，眼根缘色尘时，心就生起爱乐，因此说色尘是眼根所缘的境界。另外眼根缘色尘境界时，有三种相貌产生：第一种相是，眼根触可爱的色尘境界，心就生起贪爱之想；第二种相是，眼根触不可爱的色尘境界时，心就生起嗔恚想；第三种相是，眼根触不可爱也不可恶的色尘境界时，心就生起舍想，非爱非厌。</p><p>眼根乐着色境，耳根乐着声境，鼻根乐着香境，舌根乐着味境，身根乐着触境，意根乐着法境。诸根各各贪着所对应的境界，眼根所对的只能是色，不能缘声，耳根只能缘声，不能缘触尘，凡夫六根不能通用。圣人修到一定程度的时候，六根可以互通，眼根可以缘声、闻味，耳根缘色、触味，意根可见色、思惟，六根相通，可以互相代替。六根本来相通，只因为众生对尘境的迷执和贪执，就在一种功用中分成了六种功用，各根就有了分界。当修行破除了六根的迷执，心通以后，六根就互通互用了。那时没有色身，照样能感觉触尘，感觉微风和暖阳，一根可以做六根用，把六根功能统一起来。</p><p>六根缘六尘的时候，心的感受有三种状态，一个是喜欢、一个是厌恶，再一个是不喜欢也不厌恶，就是舍的状态。对我们修道人来说，心应该保持哪种状态为好？修道的人，心要平和，对一切境界，既不喜欢也不厌恶，保持一个中道无所住的状态，就是舍的状态。</p><p>原文：<strong>如是乃至。意着法处。为意境界。若彼意处。缘可爱色。极生爱乐。为彼所牵。引生贪行。不可爱色。生于嗔行。爱非爱色。起于痴行。如是声等。三种攀缘。领纳等相。准前应说。</strong></p><p>释：佛说，就像这样根尘相触，就有三种心行出生，意根与法尘相触，出生意识分别法尘境界。如果意根缘可爱色，意识就生起非常爱乐的心行，就被色所牵引，生起贪爱的心行；如果意根缘不可爱色，意识就生起嗔恚的心行；如果意根缘非可爱也非不可爱色，意识就生起愚痴心行。像这样，意根缘声尘处，意识也有三种心行，与意根缘色时的心行是一样的，意根缘香处、味处、触处，意识都是如此。</p><p>六根分别缘六尘，眼根对色尘、耳根对声尘、鼻根对香尘、舌根对味尘、身根对触尘，意根就对法尘。法尘是前五尘上所显现出的一种法处所摄色，比如说我看着书，书这种色尘上就显出一种书的法尘，指书的形状大小、长短方圆、纸张的质量厚度、字体的大小和字形，里面内容信息等等，都属于法尘，是意识了别的相。意根和法尘相对，眼根和书的色彩相对，就出生意识和眼识同时分别书，了别的内容范围粗细程度都不一样。</p><p>意着法处为意的境界，意识喜欢贪爱法尘境界，为境界所牵引，会生起贪心。比如拿一块蛋糕，蛋糕有色彩，眼识所见；蛋糕上显现出的形状、内含的成分、营养等等信息是法尘，意根所对，意识了别。意识了别后，觉得蛋糕香甜美味，就生起了贪爱，因有贪爱就有贪行，就想占为己有，赶快吃到口里，同时还可能想办法保证以后还能吃到，这就是贪行。贪行是身口的行为，贪心是心的妄想打算、感受，能被境界所牵引，而决定造作业行；业行造作出来以后，种子存在如来藏里，种子缘熟就有果报。如果意根被熏成功，此人生生世世都贪吃。</p><p>如果吃的蛋糕是别人的，吃的时候，别人并不知道，或者是不想给与的，就属于偷蛋糕吃，偷盗的业存在如来藏里，业缘成熟时，果报现前，就要还给别人一千倍或者更多倍。偷了一个蛋糕，最少是一千倍的果报，将来就要还回去至少一千个蛋糕；如果是偷了三宝的物品，偷了有道行的人的东西，一万十万百万无量倍的偿还，而且这当中还有贪的心性罪，性罪严重就得下地狱受恶报。</p><p>贪嗔痴的行为只要造作出来，不管是大是小，都作为业种存在如来藏里。如来藏不作选择，祂不因为是自己造的色身五蕴，因为杀人就不记这个杀人的业，如来藏没有分别心，同样记录保存。如来藏不会袒护自己出生的五阴，只存善业，而不存恶业；如来藏没有这个心行，祂是不分别的，只要有业行，不管是大小、善恶、不善不恶，祂全部平等收存。</p><p>比如说做饭是不善不恶的行为，做饭的技术学会了，作为种子存下来，来世遇缘很快就会做饭了。开车的技术和其它的技术都是如此，学来的东西祂都给存着，善的也存，恶的也存，不善不恶的也存。有人天生就有某种本事，因为有业种，前世就内行；有的人怎么学也不会，前世没有存业种。所以每个人的特长都不一样，有的小孩生来就懂音乐，会排乐谱；有的生来就会跳舞，有的狗也会跳舞跳得很好，它前世的本事都存在如来藏里了，这叫习气、习惯、业、种子。有的人前世喜欢骂人，他这一世生来，不用教就会骂人，管都管不住，这是业种现行，习惯就是如此。</p><p>凡是贪行和嗔行都属于愚痴行，不懂好歹，不识善恶是非也是愚痴，愚痴就有愚痴的业果。对治愚痴怎么对治法，用佛法的道理来去破除无明愚痴。</p><p>意根缘色声香味触法六尘境界，意识都会出现三种心行，爱乐嗔恚和愚痴。六根对六尘，都会出现三种感受：喜乐、嗔恚和舍受，这些感受都是生灭虚妄的，不可执著的。</p></div>"
},{
    "title": "第五章 三个梦喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第五章  三个梦喻</strong></p><p>原文：<strong>大王。诸根如幻。境界如梦。譬如有人。于梦寐中。与诸婇女。共相娱乐。大王。于意云何。彼梦觉已。忆所受乐。为实有不。王曰不也。</strong></p><p>释：大王，六根如幻化出来的一般，六尘境界就如梦中境一样。譬如有人在梦中，与诸多婇女在一起嘻戏游玩娱乐，大王，你的看法如何，那个人从梦境中醒过来以后，还回忆着梦中所感受的快乐，梦中境界是实有的吗？净饭王说：不是实有的。</p><p>眼耳鼻舌身意六根就像幻化的一样，从一无所有的空中，幻化出六根，其功用同样是幻化不实的，幻化主就是像魔术师一样的阿赖耶识。佛说诸根所对的境界色声香味触法如梦，等于梦中物一样，根本把捉不了。在梦中意识还能了别梦境，接触到梦中人和物，生起喜乐哀怒的觉受，梦醒后一无所有，什么都了不可得。众生在所谓的现实中生活，也像在梦中一样迷惑颠倒，好像能接触到六尘境界，好像有六识的感受，其实都是虚幻的，梦醒之后了不可得。众生因为无明还没有从梦中醒过来，菩萨处于半梦半醒状态，诸佛则已经彻底清醒过来，不在梦中了，能完全回忆梦中事，凡夫众生却都在说梦话。</p><p>原文：<strong>佛言大王。是人所梦。执以为实。为智者不。不也世尊。何以故。梦中婇女。毕竟非有。何况与之。共相娱乐。当知是人。忆梦中境。徒自疲劳。不复可得。</strong></p><p>释：佛对净饭王说：大王，这个人把自己所做的梦境当作是实有的，他是否有智慧？净饭王说：此人没有智慧。为什么这样说？因为梦中的婇女毕竟不是真实存在的，更何况还有与婇女一起娱乐这件事，那就更没有了。你应当知道这个人回忆做梦时的梦境，只是白白地劳累识心，梦境是不可能再回来了，不能再接续做梦了。</p><p>明明在梦里什么都有，梦醒了更是什么也没有，醒来以后还把梦里的人和事当真而不断的执著，这个人并不是有智慧的人。佛用这种方法来警觉净饭王不要贪着五欲乐，五欲乐就如梦中事一样，不可贪着，以此贪着，就要妄受生死轮回苦。</p><p>原文：<strong>佛言大王。如是如是。愚痴众生。眼见色已。心生爱乐。复起贪着。为彼所牵。造贪业行。身业三种。语业四种。意业三种。最初造作。刹那灭谢。是业不依。东西南北。四维上下。中间而住。于死边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，如是如是，确实是这样。愚痴的众生眼见色以后，心生爱乐，然后就贪着色境，心被色境所牵引，造作贪爱的业行。身业是杀盗淫三种，语业是妄语、绮语、两舌、恶口四种，意业则是贪嗔痴三种。身口意行造作出来之后，业行随造随灭，最后业行都灭去不再造作了，但业行并不依着东西南北、四维上下以及中间而住，不到东西南北去，不到四面八方去。但是到临终六根要谢灭的时候，自己所造作的业报就会全部现前了，就像梦醒时，仍然在念着梦中的事一样。</p><p>愚痴的众生眼见色，贪爱现前，马上生起了爱乐心，心就被色所牵住、黏住了。外界六尘如果能捆绑，捆绑的就是心，心被一种无形的贪爱绳索所捆绑住，就开始造作贪的业行。业行分为身行、口行和意行，身体上造作杀、盗、淫三种身行，口业造作妄语、绮语、两舌、恶口四种口业行，意业是贪嗔痴，这样十种业就造作出来了，身口意这三种行为造作出来以后，作为种子存在阿赖耶识里，缘熟时种子现行出来，众生就受业报。</p><p>受业报时其实是自己报复自己，众生造业时最怕谁知道？鬼神、护法神知道都没关系，佛菩萨知道都没关系，就怕阿赖耶识知道，但是你想阿赖耶识能不知道吗？五阴七识造作业行时，全靠阿赖耶识配合，没有祂根本造作不了，所以五阴所有的行为造作祂都知道，同时收存业种。懂得这个道理，就要小心自己的身口意行，不要再造恶业，要多造善业，尽量断恶修善。</p><p>身口意行最初造作的时候，刹那灭谢了。比如拿刀杀人，拿起刀之后，拿刀的行为没有了；下一步手伸出去，之后伸手的行为又没有了；再下一步，拿刀捅进对方的身体，这种行为又消失了；再下一步，拔出刀，行为消失；再下一步把刀扔了或者是洗了，行为又消失。杀人的这个行为一连串的造作出来，后一个动作出来，前一个动作消失。所有行为都消失以后，实际杀人这个行为消失了没有？这个行为如果不消失，就要一直杀，这是不可能的，任何行为总有结束的时候。行为本身造完就灭，因此任何善恶行为都是生灭、了不可得的。可是种子并不消失，刹那刹那都要存在阿赖耶识里，以待将来缘熟受报。</p><p>行为造作刹那灭谢，非常快，每一刹那有八万一千个种子生灭、生灭、生灭过去了，才形成了整个杀人的行为，所以杀人的行为全部是生灭性的，可是这整个行为就作为业种收存在自己的阿赖耶识里了。一弹指一刹那，有八万一千个种子生灭过去了，无数的生灭现象形成了这一弹指，所以弹指这个法就是虚妄的。而杀人这一法，是由无量个弹指的时间连接起来的，是由无量个类似于弹指的行为构成的，那么杀人的行为也就是虚妄的、生灭的、无我性的。如此观行下去就可以证得小乘的身空。</p><p>也可以同样观行识心的种子刹那生灭，无数个刹那生灭构成了识心的连续的分别造作行为，识心就是生灭、虚妄、无我的。这样就可以证得心空，身空加心空，五阴空、无我，就证得了法眼净。在观行断我见以后，再接续观行，杀人这一系列的行为是如何造作出来的？一弹指之间，怎么就能有八万一千个种子出来呢？阿赖耶识又是如何记录业行的？这样观行，禅定好的人，证悟非常快，前提是不要有意识的思惟，如果有就不能证悟。要证果，因缘成熟的时候，就是一刹那间，因缘不成熟，百千万劫在六道里迷惑颠倒。</p><p>业行虽然刹那灭谢，但是这些业行却不依东西南北四维上下中间而住，就这样消失了。比如举起手又放下，观察举手的业行，消失时到哪里去了？业行消失了，也没有住到什么地方，如果有地方住，此处就总在举手，如果是杀人，杀人的业行就总在某处，那就很糟糕了。</p><p>佛说于死边际命根灭时，就是众生寿命终了时，要死还没死的时候，这叫命根灭时，有一件事出现了，佛说了自分业报皆悉现前。什么是自分业报？就是自己造作业行的果报显现出来了，犹如从梦中醒来以后，知道了自己在梦里做的事。众生在临终死亡之前，这一辈子做的事情，不管是善还是恶，像放电影一样非常迅速地显现在心里，那时就知道自己这一辈子都做了些什么事情，知道这一辈子是善多还是恶多，该受什么样的果报，该去哪道里轮回。心里就明明白白了，但是已经说不出话来了。</p><p>造业时好像是神不知鬼不觉的，业行都已经消失了，在命终的时候果报却能显现出来。为什么都能显现出来？是因为在造作业行时，其行为作为种子刹那刹那都存在阿赖耶识里，业行虽然消失了，业种子却存下了。行为有形有相能消失，种子无形无相，直到受报以后才能消散，因果业行不可思议。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识作为众生的主人，是出生下一世色身的主因，业行是下一世色身出生的缘，因缘会合，下一世最初的识心出现，下一世的色身就出生了。出生时，这个人或者是堕落于地狱身，或者是堕落于畜生身，或者是堕落于鬼身，或者是堕落于阿修罗身，或者是堕落于人身，或者是堕落于天身。当下一世最初的识心出生的时候，众生就开始接受各自的果报，之后在此色身上的识心就要不断地一直运转下去，直到最后识心灭去了，成为了尸体，就叫作死蕴；而当最初识心生起的时候，众生就出生了，就叫作生蕴。</p><p>阿赖耶识为什么是造业的主人？因为没有阿赖耶识就没有五阴，也就不能造业。意根想造业，阿赖耶识了知，就配合意根，输出各种种子，完成五阴身的身口意行，五阴的身口意行都是阿赖耶识输出种子实现的，所以五阴就是阿赖耶识，就是阿赖耶识性。五阴身造的业是一种助缘，由阿赖耶识和业缘两种作为出生下一世五阴的因和缘，下一世的眼耳鼻舌身意六个识产生出来，就开始受业报。</p><p>比如说该托生为人的，又产生了眼耳鼻舌身意六个识，五蕴具足以后，就有感受，人的喜怒哀乐的果报就出现了，没有识的时候感受不到苦乐受，就好像没有得到果报一样。其实生为人胎，十月处胎就是一种果报，这果报要由意根来受，阿赖耶识不受果报，也不在胎中被拘禁。人在母胎里四五个月之前没有识心，感觉不到苦受和乐受，严格来说，那时候不算真正受报，说不算受报其实也算受报，因为那个色身就是果报身，因为没有心就不知苦乐受，而意根的感受，意识心却不容易知。</p><p>如果投身到地狱中，地狱的身相现出来，识心随即出现，马上能感受到地狱的苦受，苦报就出现了，如果托生到傍生中，傍生的觉知心一现起来，就会感觉到苦乐受，苦报出现了。或者托生到琰摩罗界鬼界，托生到阿修罗界，或者生到人中，或者生到天上，识心出生才开始正式受报，就开始善有善报，恶有恶报了，天人一出生，他就感觉快乐，在畜生道和地狱道、鬼道里一出生，就感觉到痛苦。但没有六识来感觉的时候，也属于是果报。</p><p>识心出生之后，就相续不断地在色身上运行，直到死亡为止。这一期生命结束的时候，眼识、耳识、鼻识、舌识、身识、意识这六个识心都灭了以后，身体就像一块木头一样，这叫作死蕴，最初眼、耳、鼻、舌、身、意识出生的时候叫生蕴，一生一灭，就是一期生命。每一期生命出生和消失时，什么也没有带来，什么也没有带去，除了把业行带来带去受报，其他全部都消失得无影无踪了。</p><p>所以说一切万法本身就是生灭法，是空的，空的东西带不走，真实的东西才能带走，是什么能带走？阿赖耶识一直跟随着自己生生世世，把业种带到生生世世，实现生生世世的业报。至于说五阴要到哪里受报，阿赖耶识无所谓，反正祂不受报，祂从来都不舍众生，只是随着业而不断地变现五阴身。那么谁是众生最亲的人？是阿赖耶识，须臾不肯舍离五阴身。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：大王，根本没有一个法，能从此世带到另一世。为什么是这样？因为一切法都是生灭的。大王，身识出生时没有来处，灭时没有去处。识心造作的业行，生也没有来处，去也没有去处。色身上最初的识心生起时，也是没有来处，灭时也没有去处。为什么这些法都是没有来处和去处？因为这些法的自性是离一切法的，没有真实的一切法。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样就能了知了身识，了知了身识的空；了知自身所造的业行以及业行的空；了知初识和初识的空。如果这些法灭了，其灭也是空，如果这些法生，其生也是空。了知业力的流转，没有造作者，也没有受报者，都只是各种名相的分别显示罢了。</p><p>身识生出来，没有一个来处，不从东南西北来，也不从虚空中来，识心没有来处，识心灭了以后也没有去处，所以识心就是虚妄的，就是空的，造的业行生出来的时候，没有来处没有去处，也是空的、幻化的，这样就能证小乘空果。比如杀人这个业生出来之前，这杀人业在哪里？杀人的行为在哪里？没有地方存在，业没有一个来处，造完这个业，业消失了，业到哪里去了，杀人的行为到哪里去了？没有地方可去，没到东南西北和虚空上下而去，没有去处。</p><p>又如手拿一本书，这个行为没有了，消失到哪里去了？没地方可去，是虚妄的。想拿书这个行为还没产生之前，在哪里存在呢？没有地方可存。说话之前语言藏在哪里？没有地方可藏，话说完了，语言消失了，消失到哪里去了？没地方可去，如果有储存这些东西的地方存在，那虚空也装不下。一切行为造作都是虚妄的、幻化的、空的，分析来分析去，没有一法是真实的。如果一个人完完全全是个小乘人，只考虑自己解脱，就会觉得自己活着是没有什么意义，很无聊的。</p><p>要想活下去，就要发大乘菩萨心，要成佛度苦众生，活着就这一件事，再也没有第二件事了。世间一切都是空的，一无所有，以这种心在世间活着是什么心境，轻飘飘地在空中住着，一切都跟我没有关系，无牵无挂，无烦无恼，任运自在。而凡夫众生活得太沉重了，肩膀背着，心里装着，什么都要，死了还带不走，都是空的，如何能带走？</p><p>识心的自性离一切法，不具一切法，是空的、没有自体性的，这叫自性离。应该如是了知身识，了知身识的空，如是了知自己的业行以及业行的空，了知色身上初生起的识以及识的空。眼耳鼻舌身意六个识，生起来之前没有处所，灭了之后也没有地方可去，所以是空的。如果把识心灭了，灭了的这个法，也是空的，是谁灭啊？没有一个让识心灭的造作主人，识心自己就灭了，没有人去灭祂。</p><p>世出世间没有一法不空，除了阿赖耶识。从头到尾，从里到外，把三界世间法都空净了，就证四果，不仅三恶道永远不去了，三界也要出离。把自己各种各样的心行，各种各样的心，贪心、嗔恚心、愚痴心、慢心，了知一切法的心，全都空净，就能入无余涅槃。色身容易证得是假的空幻的，否定识心各种各样的知觉、感受、想法、打算、了别，证得识心空幻稍微困难一些。利根的人只要圆满这些条件，修行和证果并不是很难。</p><p>证得无我的时候，不但人空，业行也空。比如我杀人的时候，有个我在杀人吗？什么叫作我？我的识心，想杀人的识心，是虚妄的空的；我的色身是虚妄的空的，那有我这个人吗？没有我这个人。手拿的刀是真实的吗？不是真实的，那么杀人这个业行存在吗？是空的，人空物也空，行为造作就空，我拿刀杀人这个业行就是虚妄的。有人在造作杀人这件事吗？没有。被我杀的那个人，有那个人吗？没有，他的色身同样是空的假的，他的识心同样是空的虚幻的，他的感受是空的虚幻的，苦受是空的虚幻的，那么有我、有他、有业行吗？都没有。只要这样用功观行下去，不证果也难，还能明心开悟，还能修到初地菩萨的果位。</p><p>佛说了知业转无有作者亦无受者。业行的出生、运作和消失了，全部是空的，没有造业之人，也没有受业之人，也无受报者。一路空下去，心的圣性就发起了，不再是凡夫心，没有凡夫的心行了，贪嗔痴烦恼就像沸汤消雪一样融化了。这样就不用费很多心血和精力，去对治种种的烦恼，用对治法去对治烦恼，心是很累的，对治多生多劫，也不解决根本问题，因为把一切法都当作了真实的东西，都认为是有，那怎么能对治彻底，解决根本问题？当下认识到什么都是空幻的，还用得着到对治吗？根本用不着对治。</p><p>所以跟着贪嗔痴烦恼，来对治贪嗔痴烦恼的那种作法，修行真是太迂回、太曲折、太慢了，不是最根本的方法，也不是最快的捷径。我们要从根上来着手，比如要除去一棵大树，就要从根部下手，砍断树根，整个树就倒，不复再生。修行不能去摘枝叶，一片树叶一片树叶地慢慢摘，摘完了又生，摘完了又生，这是永远摘不完的。对治的修行方法就是在摘树叶子，而以上那些观行方法都是截树根的方法，完全彻底，从根上给截断，树叶树枝树干就再也不会生长了，于是就会灭绝了。断除烦恼也是这样，直截万法的根源，证得万法的空，面对万法时，就不会再生起烦恼。</p><p>原文：<strong>大王。譬若有人。于睡梦中。与诸冤对。共相斗战。于意云何。是人觉已。忆念梦中。斗战等事。为实有不。王曰不也。佛言大王。是人所梦。执以为实。为智者不。王曰不也。世尊。何以故。梦中毕竟。无有冤对。何况与之。共相斗战。当知是人。徒自忧恼。都无有实。</strong></p><p>释：佛说：大王，譬如有人在睡梦中与诸多怨敌互相争斗，你怎么认为？这个人醒过来之后，还在回忆着梦中打斗的事情，梦中那些事是否是实有的？净饭王说：不是实有的。佛说：大王，此人把梦境当作实有而执著不舍，他是有智慧的人吗？净饭王说：此人不是有智慧的人，世尊，为什么呢？因为梦中并不存在怨敌，何况还有与那些怨敌作战之事，这个人也就是自己自生忧恼罢了，梦中没有真实的人和事。</p><p>原文：<strong>佛言大王。如是如是。愚痴异生。眼见恶色。即生于恼。厌离破坏。毁呰过失。造嗔业行。身业三种。语业四种。意业三种。最初造作。刹那灭谢。是业不依。东西南北。四维上下。中间而住。于死边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，你说得对。愚痴的凡夫众生眼见恶色时，心中马上就生起气恼，生起厌恶心和离弃心，想要破坏掉恶色，指责恶色的种种过失，而造作嗔恚的业行。其业行分为身业三种、语业四种、意业三种，最初造作的业行，刹那刹那灭失了，这些业行不依东西南北和四维上下、中间而住。到临命终色身快灭去时，自己造业的果报就现前了，就像从梦中醒过来，还在念着梦中的事一样。</p><p>异生即异时而生，异地而生，异类而生，就是死后在另外不同的时间出生，在不同的地点出生，在不同的种类中出生，受不同的果报。不同的时间，就是中阴身结束以后再投胎；不同的处所，也许是天上，也许是地狱，也许是色界，也许是其它星体，这都不一定了；不同种类，在六道里不同的身份，也许是人，或者是天人，或者是鬼类，或者是畜生类，或者是阿修罗类，这也是不一定的。</p><p>愚痴异生凡夫眼见到不好的色相时，就生起了嗔恼心、厌恶心，想破坏毁坏的心，然后造作嗔业行，或者是打，或者是骂，或者是毁坏。身业就是杀盗淫，语业就是妄语、两舌、恶口、绮语，意业就是贪嗔痴，这是十恶业。这些业行怎么造作出来的？造作业行时，最初造作刹那灭谢，行为造作出来后，马上就灭了，打人和骂人的行为随出随灭，生时没有处所，灭时也没有灭的地方，全部是空。</p><p>十恶业不依东南西北、四维上下和中间而住，恶业没有住的处所，但是造作完了以后，在命根马上要灭的时候，业报却显现出来了，种子成熟了，一辈子的业行像闪电一样出现又灭去了，感觉这一辈子就像梦中一样，其实就是一场梦。临死时的感觉就跟梦醒的感觉是一样的，自己知道这辈子就要结束了，也知道死后的果报是什么了。可是活着的时候都不感觉是一场梦，反而感觉很真实。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识作为众生的主人，是出生下一世色身的因，业行是下一世色身出生的缘，因缘会合，最初的识心出现，下一世的色身就出生了。这个人或者是堕落于地狱身，或者是堕落于畜生身，或者是堕落于鬼界，或者是堕落于阿修罗身、人身和天身。当下一世最初的识心出生的时候，众生就开始接受各自的果报了。之后在此色身上的识心不断地运转下去，直到最后识心灭去了，成为了尸体和死者，这叫作死蕴。而当最初识心生起的时候，就是生者，这叫作生蕴。</p><p>阿赖耶识是众生的主人，眼耳鼻舌身意六个识造作的身口意业行是出生的助缘，因缘合在一起，就有下一世的眼耳鼻舌身意六个识，下一世果报就开始了。初识生出来以后，马上就知道自己生到地狱里了，生到天上了，生到畜生里了，生到鬼界了，生到阿修罗界了。比如说该托生为人的，当最初的识出生的时候感受就出现，人的果报就现前了；没有识的时候，就没有受者，感觉不到苦乐受，就没有得到真正的果报。人在母胎里四五个月之前的果报身上没有识心，就感觉不到苦受和乐受。严格来说那时候还不算真正受报，说不算受报其实也算受报，因为那个色身就是果报身，只是没有心而不知苦乐受。</p><p>在同一个色身上的识心，一直在流转在起作用，一期生命中，眼识等六识在同一个色身上都在不断地起作用，这叫作同分心品。最后识灭，色身就成为木头一样的尸体，叫作死蕴。最初识生起来名为生蕴，六识叫作识蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：大王，根本没有一个法，能从此世带到另一世。为什么是这样？因为一切法都是生灭的。大王，身识出生时没有来处，灭时没有去处。识心造作的业行，生也没有来处，去也没有去处。色身上最初的识心生起时，也没有来处，灭时也没有去处。为什么这些法都是没有来处和去处？因为这些法的自性是离一切法的，是没有一切法的真实性的。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样就能了知身识，了知身识的空，了知自身所造的业行以及业行的空，了知初识和初识的空。如果这些法灭了，其灭也是空，如果这些法生，其生也是空。了知业力的流转，没有造作者，也没有受报者，都只是各种名相的分别显示罢了。</p><p>无有少法从于此世带至他世，什么也没带走，为什么呢？因为这些法的本性都是生灭的空的幻化的，所以什么也带不走。身识生时无所从来，灭无所去，善恶业行，不善不恶的业行，生出之前没有来处，灭了也没有去处。因为一切法没有自体性，本身就不具备一切法性，离一切法，没有一切法的真实性。</p><p>色身上的识都是空的，造作的业行也是空的。但是也不要认为业行是空的，就可以随意造作恶业，果报却还是幻有的。真正知道空证得空的人，根本不会造作恶业了，知道是空的，为什么还要为一个空的不可得的而造作恶业呢？根本没有必要造作恶业，知道是空的就不造作了。下一世的识产生出来，下一世的识也是空的，灭空之法也是空的。生死本身就是空的，没有一法不空，一路空下去，就到涅槃城。</p><p>业行的造作流转，没有一个造作的人，也没有一个受报的人，我虚妄、你虚妄、他虚妄，一切法都虚妄，没有人。身是假的空的，识心是假的空的，五蕴是假的空的，没有我，没有你，没有他，没有众生，也就没有业行。造作的业行、身口意行也是假的空的，这个结解开就证果了。</p><p>原文：<strong>大王。譬若有人。于睡梦中。为毕舍遮。之所娆害。心生怖畏。痴迷闷绝。大王。于意云何。是人觉已。忆念梦中。为鬼所娆。为实尔不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无鬼所恼。何更说有。痴迷闷绝。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，譬如有人在睡梦中被毗舍遮鬼所侵害，心里非常害怕，迷闷昏厥。大王，你怎么想呢？这个人醒过来以后，还在回忆着梦中被鬼所恼害的事，这件事是实有的吗？净饭王回答说：不是实有的，世尊。佛说：大王，这个人把梦境当作实有的，他是一个有智慧的人吗？净饭王回答说：他不是一个有智慧的人，世尊。为什么这样说呢？因为梦中根本没有被鬼所恼害这件事，更何况还有吓昏和闷绝这件事。应当知道这个人只是白白地徒劳其心罢了，并没有实事。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。眼见是色。迷惑不了。造痴业行。身业三种。语业四种。意业三种。最初造作。刹那灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，你说得对。愚痴的凡夫众生眼见色时，心中迷惑，不能了知色的实质，造作愚痴业行，身业三种、语业四种、意业三种。最初造作的业行，刹那刹那灭失了，这些业行不依东西南北和四维上下中间而住。到临命终色身即将灭去时，自己造业的果报都现前了，就像从梦中醒过来，还在念着梦中的事一样。</p><p>最初造作的业行，刹那刹那灭了。这个业灭了以后，不依东西南北、四维上下和中间而住，没有一个住的处所。比如说话的语业，生之前没有住的地方，消失了没有一个消失的处所可去，但是最终命根灭谢了以后，这个语业的种子成熟了，就随着业种而受报去了。命终的时候，自他业报现前，就像梦醒了以后再回想梦中的事一样，临终要死时一辈子的事业在脑中闪现，就像回忆梦中的事一样，之后只有随业受报，妄受六道轮回苦。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识作为众生的主人，是出生下一世色身的因，今世的业行是下一世色身出生的缘，因缘会合，下一世最初的识心出现，下一世的色身就出生了。这个人或者是堕落于地狱身、畜生身、鬼界，或者是落于阿修罗身、人身和天身。当下一世最初的识心出生的时候，众生就开始接受各自的果报了。之后在此色身上的识心就一直不断的运转下去，直到最后识心灭去了，成为了尸体和死者，这叫作死藴。而当最初识心生起的时候，众生就出生了，这叫作生藴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：大王，根本没有一个法，能从此世带到另一世。为什么是这样？因为一切法都是生灭的。大王，身识出生时没有来处，灭时没有去处。识心造作的业行，生也没有来处，去也没有去处。色身上最初的识心生起时没有来处，灭时也没有去处。为什么这些法都是没有来处和去处？因为这些法的自性是离一切法的，是没有一切法的真实性的。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样就能了知身识，了知身识的空，了知自身所造的业行以及业行的空，了知初识和初识的空。如果这些法灭了，其灭也是空，如果这些法生，其生也是空。了知业力的流转，没有造作者，也没有受报者，都只是各种名相的分别显示罢了。</p><p>无有少法从于此世流转到他世，什么也带不走，因为一切法的本性是生灭的空的幻化的，色身空、心空、业空，一切都空，万法全空，自性空。初识生的时候没有一个来处，灭的时候也没有一个去处，这些法的自性离一切法，本身并不真实存在，是空的幻化的。业灭了也是空的，业生了也是空的，没有一个造业的人，也没有一个受果报的人，也无受者，都只是名相分别显示而已。</p><p>原文：<strong>大王当知。诸根如幻。境界如梦。一切诸法。皆悉空寂。此名空解脱门。空无空相。名无相解脱门。若无有相。即无愿求。名无愿解脱门。如是三法。与空共行。涅槃先道。当如是学。</strong></p><p>释：大王应当知道，六根就像是幻化的一样，种种境界犹如梦境一样。一切法全部都是空的寂静的，这就是空解脱门；诸法空也没有空相，叫作无相解脱门；如果一切法连相也没有，就应该不生任何愿求，无原求叫作无愿解脱门。如是空、无相、无愿三解脱门与空共同存在，走向涅槃之路就应当这样修学。</p><p>眼耳鼻舌身意六根都是幻化出来的，眼睛见的各种境界，耳朵听的各种境界，六根所对的种种境界，像梦里的事一样，并不真实。我们还要追求什么，一切诸法皆悉空寂，没有一样不是空的，没有一样不是寂灭的，什么也没有，这就是空解脱门。证得一切法空，知道是空的，心就解脱了。</p><p>空无空相名无相解脱门，空的法，没有一个相貌可见可说可指示出来，连空也空，这就是无相解脱门。知道空什么相也没有，连空也没有，心就更解脱了。如果连空的相都不有，连空都没有，还着什么空呢？若无有相即无愿求，如果连相都没有，还求什么？还有什么愿求？什么都不用再求了，这就是无愿解脱门。没有愿求，心就更加解脱了，空、无相、无愿三解脱门成就了，就是圣人。</p><p>空、无相、无愿三法与空共行，既不离空，也没有空相，三者又不相分离，层层递进，究竟解脱。众生要想入涅槃，求得不生不灭，就应该这样修行，不断地产生空的心行，越来越空，连空也空，才空得干净利落。如果心里还有一个空，那就没有真正空，还应该灭去空的心。涅槃路上应该这样去修学，才能证得涅槃，涅槃就是解脱，涅槃就是不生不灭，涅槃就是寂静无为，涅槃就是大自在。</p></div>"
},{
    "title": "第十七卷 六界差别品 第二十六之 第一章 四个梦喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十七卷  六界差别品第二十六之二<span>   </span></strong></p><p><strong>第一章  四个梦喻</strong></p><p>原文：<strong>佛言大王。譬如有人。于睡梦中。闻妙乐声。心生适悦。是人觉已。忆念梦中。美妙音乐。是实有不。王曰不也。佛言大王。于意云何。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无有乐声。何况复有。生适悦耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛对净饭王说：大王，譬如有人在睡梦中，听见美妙的音乐声，心里就产生了舒适愉悦的乐感，这个人醒来以后，还在不断地回忆着梦中美妙的音乐，梦中所闻是实有的吗？净饭王说：不是，世尊。佛说：大王，你认为如何？这个人把所梦见的事情当作了真实存在的，他是有智慧的人吗？净饭王说：此人没有智慧，世尊。为什么这样说呢？因为梦中毕竟没有音乐声，更何况此人心里还生出愉悦舒适的乐感，因此应该知道这个人仅仅是白白地疲劳消耗自己的心神罢了，并没有实际存在的事情。</p><p>听见美妙的声音，心里就感觉很舒畅很快乐，这件事其实和做梦是一样的，都是幻化无实的，梦中听见美妙的音乐，心里很高兴，这事更是幻化不实的。梦境是独影境，是意根遍计所执性攀缘出来的境界，阿赖耶识依意根的贪爱和执著，直接从业种中变幻出法尘境界，供意根了别，意根不能作详细了别，就让意识出现共同了别，于是意识对音乐声作意触受想思，生起了感受，觉得美妙悦耳，内心就愉悦快乐。这其中，意根是阿赖耶识幻化出来的，梦境音乐是阿赖耶识幻化出来的，意识是阿赖耶识幻化出来的，没有一个法是实有不灭的，全部是虚幻不实，不可依赖的，都不是我和我所拥有的。</p><p>醒了以后，梦境音乐更是消失得无影无踪，独头意识也灭了，其乐感更不存在，没有一法可当真。梦中听到美妙的音乐声、赞美声，以及喜欢的人和事，这是令人愉悦的梦，醒来以后一无所有，梦里虽然有这些现象，但都是幻化的，虚妄的，不实的。如果有一个人把他所梦到的人和事当作是真实的，认为晚上做的梦是真实的，还不时的幻想着，回忆着，不断生起执著和贪爱，还沉浸在梦里的境界当中不肯出来，这个人实在是愚痴无智。做梦的时候把梦境当真，已经是迷惑颠倒了，醒来还当真，更是颠倒。</p><p>有些有修行的人，做梦的时候就知道梦境是假的，在做梦的时候业缘现前，马上要造恶业了，心里就知道这件事不能做，心不随境界而流转，这样的人，意识心是觉悟的，意根也有一定程度的觉悟，能作主不造恶业，那么在命终以后也差不多能作主不造恶业。在梦里造作恶业的，这个人的心识修行力度还不得力。所以梦能检验众生是否有修行，修行到什么程度，意根是否受熏，有没有力度，对于生死是否有把握。</p><p>梦里并没有音乐的声音，自己不但不能警觉是在做梦，心里还生起喜悦、舒适、贪爱，那更是颠倒，事都没有，心境更是不存在，都是虚妄的。把梦境当实，不断地回忆幻想，那是徒自疲劳，没有实事，白白地驱使自己的心意想和幻想，那简直就是疲劳其心，没有实际利益可得。众生的心在六道里，也同样是疲劳的，不断地抓取六尘境界，结果一无所获，空来空去，妄想、希望、愿望、渴望，这都让心徒自疲劳。实际上是没有用的，在临终的时候，还是竹篮打水一场空。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。闻可意声。起于爱乐。而生染着。造作恶行。身三语四。意业三种。作是业已。刹那灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生，听见自己喜爱的声音，心就生起爱乐，生起贪爱的染污心，造作恶业，色身上造作杀盗淫，口业上造作两舌、恶口、绮语、妄语，意业贪嗔痴，身口意十种恶业行造作以后，刹那灭去了，灭去以后，业行不依东南西北、四维上下和中间而住，消失得无影无踪。但是在最后命根谢灭之时，自己这一生所造作的业报全部都现前了，犹如从梦中醒过来，心里还在念着梦中的事情一样。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识为出生后世五阴身的主人，业种业力为所缘，以此两种因和缘和合起来，下一世的最初识就出生了。众生或者趣于地狱道，或者堕在鬼道，或者投生到畜生道等三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴；而在色身上最初生起的识心，叫作初识，色身五阴名为生蕴。</p><p>业行造作出来以后，刹那灭谢，比如说话的时候一个声音一个声音不断地出现，这一个字出来灭了，下一个字出来又灭了，这就是行为造作，这种行为造作的当下就灭了，灭了又生，刹那间随生随灭。业虽然是灭了，但是业行却作为种子存在阿赖耶识里了。当一个字说出来的时候，就有无量个识种子随生随灭，完成了这一刹那的语言行为造作。有一个识种子断流，语言就说不出来，因此语言一法就是假法，不是真法。</p><p>业行灭了以后，到哪里去了？没有一个可以住的处所，阿赖耶识里也不存这些业行，因为阿赖耶识无形无相，不存有形有相的身口意行，只存无形无相的种子。一切的业行都没有一个去的地方，也没有一个来的地方，说话时第一个声音出来了，从哪里出来？有存着说话声音的地方吗？肯定没有。如果有，众生一辈子或者是无始劫以来说话的声音都存在哪里了？去找找看，根本找不到。</p><p>有人说把声音用录音机录下来，把业行用录像机录下来，行为造作就有存在的处所了。如果是这样，那我们就把录音机和录像机拆开来寻找，声音和行为造作在哪里，恐怕找来找去，也找不到声音和影像。但是整个的行为造作的过程包括意业，都有个东西像录音机和录影机一样给拍录下来了，这个东西就是阿赖耶识。录下来以后，就作为种子存在着，有宿命通的人随时可以调出来观看，就像打开电视机观看一样。阿赖耶识这个电视机里存多少录音和录像节目都可以，无始劫以来的节目都存着不丢失，有宿命通的人都可以播放出来，不管业种是否实现，是否受报完了。</p><p>身口意的业行本身消灭了，然后等到命终时，将要咽气的那一刹那，在众生的色身上所应该受的业报，所造的业，像过电影一样，快速地过一遍，一辈子做的事就闪过去了，自己就明白自己造作的业，哪些是善，哪些是恶，应该受什么报，全都清楚了。但是那个时候却说不出话来了，无法表达，无法告诉亲人给自己消业、超度、弥补罪过，无法告诉亲人自己要到哪里去受报，能说话的时候业行不现前。当临终业报现前时就会感觉这一辈子都是一场梦，过去了，结束了，平日里活着时体会不到那时候的心情。</p><p>学佛修行修到十回向位的时候，就会觉得，不仅这一辈子像一场梦，前世也是一场梦，下一世同样是一场梦，未来世直到成佛之前都在梦里，生生世世都在梦里梦生梦死。菩萨做佛事，度自己度众生，都是在梦里，都像做梦一样不真实，都是在做梦中佛事。</p><p>没有证得的人也就没有真切的感受，现在对此只能理解，体会不到，因此不知道无始劫以来就是在做一场又一场的生死大梦，连接起来就是一连串的梦，成佛之前都在生死大梦之中。有分段生死的众生就是在做一段一段的梦，分段生死过去以后，还有变易生死，就做特别微细的长长的梦，也同样没有完全从生死大梦中清醒过来，直到成佛，生死大梦才彻底结束。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候，没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时，也没有去处。下一世最初的识心出生时，没有来处，灭时也没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得，空的不可得的法，不可能有来有去。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空，像这样来了知自身识心所造作的业行，了知业行自性为空，像这样来了知初识，了知初识自性为空，像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭也空，同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别显示罢了。</p><p>五阴世间的一切法都是生灭的，识心是生灭的，色身是生灭的，识心与色身造作的一切业行同样是生灭的。这些法都是空的，种子刹那生，又刹那灭，色身和识心就刹那生刹那灭，幻化不实，尤其是到临命终全部要消失灭亡，连刹那生和灭的现象也要消失不见了，这更说明了五阴的虚幻，没有一法能带到后世。</p><p>一切业行的造作，没有一个造作者，因为识心是没有自主性的，是幻化的；色身是幻化的，没有自主性的，身心都如幻，因此如幻的身心不能造作业行。一切业行的流转，也没有一个受报者，因为识心是幻化的，是空的，没有自性的，因此识心不是受报主，色身是幻化的，是空的，没有自性，也不是受报主。一切色法是相，一切识心是名，都没有实质，都只是被识心所分别和显示出来的假相罢了。</p><p>世间的财色名食睡，同样都是空无自性，幻化不可得的。这一世出生时，并没有把上一世的名声带过来，即使前世做过国王、大臣，在这一世里，地位和权势一样都没能带过来。前世的家亲、眷属、财富，什么都没有带过来，这一世还要从头奋斗，从头做起，重新获取财色名食睡。这一世灭时，一辈子集聚起来的财色名食睡，家亲眷属等等一切都将消失，一样也不能带到下一世，甚至五阴和识心也不能流转到未来世，除了作主识意根除外，全部都消失殆尽。</p><p>晚上睡着了没有梦，眼耳鼻舌身意六个识都灭了，灭了以后到哪里去了？等醒来时这几个识心又都出现了，出现时又从哪里来？《楞严经》上世尊说一切法都是如来藏性，这部父子合集经里没有讲到如来藏，如果要讲如来藏性，有些人听后就能开悟，不讲如来藏性也能让众生证得罗汉空果，让众生都能受益。佛讲的有些经典既能让人证果，又能让人开悟，这要看众生是什么根器，小乘根性的人只能悟得小乘的空，大乘根性的人在悟到大乘的空性如来藏的同时，也能悟到小乘的空。根器不一样，悟道的程度就不同，在于闻法当人的智慧程度。</p><p>佛说法时，八万四千人听法，智慧不同，理解程度就不一样，证的果位不同，得的果报也不同。佛说法没有分别心，为所有众生讲同样的法，众生的根基不一样，得果就不一样。造了大恶业的人，有恶业遮挡，得的果只能是一种无根信；没有恶业遮障的人，能证小乘罗汉果，那根性利的，就能证得大乘菩萨果；根性再好的，能证得无生法忍，得几地菩萨的果。所以说佛以一音而说法，众生随类各得解，同样的听法，理解和证得什么程度，是每个众生各人的事，佛没有偏心。</p><p>身识本身是空的，空来空去，抓不住，留不住，生灭幻化不已。造作的业行是空的，初识也是空的。如果识灭了，灭这种现象本身也是空的，没有真正的一个灭法，谁能灭它？没有灭者。如果识心生起来，出生这一法也是空的，随着业种而出生的法都是空的。只有阿赖耶识不空，祂含藏万法的种子，能产生万法，祂真实有，剩下的全都是空的、假的、幻化的、不真实的。</p><p>了知业转无有作者亦无受者。业转就是众生身心的行为造作，身口意行的运转运行，没有一个造作的人。比如我现在正在讲法、说话，其实没有一个人在做这件事，是谁在做在说话？你说是我，什么叫我？我的身体叫作我，还是我的识心叫作我？这些都是假相，色身和识心组合起来形成的五阴，更是假相，没有一个真正的我。五阴是假相，五阴说话这个现象更为不真实，说话这个人就不是我，是一个组合体。既然是组合体就是因缘聚合起来的，缘灭时，组合体就分散，没有了，当下的组合也不是实有的。</p><p>比如说一个军队由步兵、骑兵、多种兵种组成，假名为部队，组成部队以后出去战争胜利了，国王就说：我们的部队是多么的勇敢，多么的英勇无敌，多么威武。但是有我们的部队这一法吗？部队是由多个兵种组成的，单个兵种不叫作部队，组合起来以后，更不能叫作部队，根本没有真实的部队这个法的存在，部队是幻化出来的一个假合体，不是真实的，缘聚而成的法，不是真实的法，缘散时聚合体就会分散，能聚能散的聚合体就是虚假不真实的。两个以上聚在一起叫作一体，离开单个都不叫一体。甲是甲，乙是乙，其实不是一体，是假合体，假合体不是真实的。</p><p>众生这个五阴也是组合起来的，由色身和几种见闻觉知心组合起来，组合起来以后才有感受，有想法，有了别，有分别，有行蕴，有行来去往的身口意行；识心灭了就组合不了五阴，身体灭了也组合不了五阴，那么组合而成的假的现象就不是真实的。实际上是没有真实的五阴我这个人，人是几种因缘凑合起来的东西，是假相，因缘一灭就散了。比如这张椅子，由钉子、木头、人工组合起来的，缘份一到，这张椅子就散，变成了木头，木头也没有了的时候就变成灰，最后灰也没有了。因缘组合而来的东西，都是这样不真实，因此没必要执著。</p><p>小乘法里讲，世俗法一切都是因缘所生，全部都是假法，不是真实的，只要是因缘组合的就是假法，是生灭虚妄的。从大乘法角度讲，为什么有因缘组合？都是因为有阿赖耶识这一法。离开阿赖耶识，这张椅子也组合不了，我用人工钉这张椅子的时候，阿赖耶识的功能不作用，就钉不成这张椅子。没有阿赖耶识，连木头也没有，因为树木不能单独生长，全靠共业众生的阿赖耶识的功能作用，万物生长离不开阿赖耶识。</p><p>业行的造作没有作者，那所受的业报有受者吗？没有造作者就没有受者，因为五阴者是假合体，没有主体，有谁受报呢？没有一个我在受苦乐，身体不受苦，识心也不受苦，身心都是虚妄的，苦报本身也是虚幻的，因此一切法没有一个真实的作者和受者。单独哪个法都不能说是一个人，多个法组合到一起的更不是一个人，都是假体，因此一切法的造作没有作者，也没有受者。真要证得这一点，不仅仅是开悟了，可能就到初地菩萨的境界了。</p><p>既然一切法都没有真实的相貌，都是幻化出来的，那就可以说一切法都只是名和相的虚妄分别罢了。例如为某一物取一个名词，来代表和显示它，要不然没法称呼和表达。为这个四条腿的东西取名叫椅子，听到椅子之后心里就会出现椅子的相貌，名和相出现了，才能分别显示出椅子，便于众生之间的交流和使用。</p><p>为四大假合的肉体取名为色身，人们之间才能用语言表达色身的状态，便于识别和交流，为色身上的几个识取名为眼识、耳识、鼻识、舌识、身识、意识，给作主识取名为末那识，然后才能阐述和描述这些识心的功能作用和状态，众生才可以表达、显示和沟通。如果没有名字和相貌，众生之间无法交流，无法生活，取个假名就好办了。比如当初如果是给毛巾取名叫被单，众生要拿毛巾擦脸的时候，就告诉孩子说把被单拿来擦擦脸，只要形成习惯固定下来，当初叫什么名字就无所谓了，都是一种名词、名相，没有太大的实际意义。</p><p>原文：<strong>佛言大王。耳闻恶声。则生忧恼。如人梦中。亲爱别离。悲号啼哭。生大苦恼。于意云何。是人觉已。忆梦中事。是实有不。王曰不也。</strong></p><p>释：佛说：大王，有的人听见恶声心里就生起忧悲苦恼，犹如有人在梦中梦见至亲生死别离，而悲痛啼哭，内心非常苦恼。你对此有什么看法，这个人醒过来以后，还要不断地回想梦中的事，梦中的事是真实存在的吗？净饭王回答说：不是真实存在的。</p><p>原文：<strong>佛言大王。是人所梦。执以为实。为智者不。王曰。不也世尊。何以故。梦中亲爱。毕竟无有。何况复有。别离事耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，这个人把自己所梦见的事当作实有，他是有智慧的人吗？净饭王回答说：那个人不是有智慧的人，世尊。为什么如此说呢？因为梦中的亲人毕竟是不存在的，如果还有亲人别离的事，那就更不能是真实的了，所以说这个人是白白地对并非实有的人和事费尽心力，徒劳其心，毫无益处。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。闻其恶声。则生忧恼。起于嗔心。造作嗔业。所谓身三语四。意业三种。造彼业已。刹那灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚夫异生闻见恶声心里就生起忧恼，嗔心生起以后就造作了嗔业行。这些业行反应在身口意上就是身业三种，语业四种，意业三种，这些业行造作完之后，刹那之间就灭去了。业行灭去以后，并不依东南西北、四维上下和中间而住着。等到最后寿命即将结束时，自己所造作的业果报全部都现前，犹如从梦里醒来以后，还在念着梦中的事情。</p><p>众生造业时，都觉得神不知鬼不觉，好象谁也不知道似的，其实是瞒不了人的，否则就没有果报了。首先是自己的心知道，并且作了记录；然后周围的鬼神都知道，阎王那里都有记录；佛菩萨和护法神都知道，当时有神通的众生都知道，以后再遇见有神通的众生，还会知道。只要造了业行，就是一份档案，这份档案一直保存到成佛以后，永远不会消失，甚至受报完了，业种消失，档案也不消失，所有有神通的众生，都能查阅得到。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：佛说：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，以此因和缘和合起来，下一世的最初识就出生了，那么众生就趣于地狱道，或者堕在鬼道，或者投生到畜生道三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就连续不断的运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心，叫作初识，色身五阴名为生蕴。</p><p>下一世的眼耳鼻舌身意六个识生起来的时候，是因为这一世的眼耳鼻舌身意六个识造作业行，种子不灭的缘故，就决定了必须有下一世的五阴要受业果报。当五阴身上初识生起来以后，这个人或者到了地狱，或者到了畜生道，或者到了阿修罗界，或者又托生为人，或者又升到了天上，根据众生造的善恶业而流转在六道里。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世去，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时没有来处，灭时也没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别和显示罢了。</p><p>一切法生的时候没有来处，灭的时候没有去处，为什么呢？因为本性是离一切法的。初识生时没有来处，灭了没有去处，造的业行没有来处，也没有去处。造业和受果报的法也都是虚妄的，虽然是虚妄的，但是也能感觉苦；虽然感觉苦恼也是假的虚幻的感觉。</p><p>在这一切法的生与灭的时候，阿赖耶识一直跟着五阴身，在背后起着主导作用。因为祂是不生不灭的，是真实存在的法，如果没有祂，一切法一切虚相都将不复存在，祂是实相心体，虚相法依实相而存在。万法当中除了阿赖耶识这一法是实相法，是真实的，其他的一切法都是虚妄的。到地狱里去受报也是虚妄的，如果在地狱里真的知道地狱是空的幻化的，地狱业就消灭，就从地狱里出来了。如果不知道地狱是虚妄的，认为地狱是真实有的，无明不灭，那就在地狱里继续受苦。当众生真证得业行是虚妄的，一切法都是虚妄的时候，三恶道业就消灭了。没有证得的时候，三恶道在心里还都是真实有，那就还得去三恶道受报。</p><p>开悟的时候是证得五阴身是空的或者是证得一切法都是空的，都是阿赖耶识变幻出来的，只有阿赖耶识不空，这样三恶道业也消灭，也不下三恶道受恶报。如果认为三恶道业不空，是真实有，那就不能证果，也不能开悟。知道三恶道的业行是假的，三恶道就没有了，业行就不起作用，只是把三恶道业转为人间的果报，在人间受苦。</p><p>原文：<strong>佛言大王。耳闻舍声。起于舍想。如人梦中。闻他宣说。不了义句。于意云何。是人觉已。忆念梦中。所闻之声。为实有不。王曰不也。</strong></p><p>释：佛说：大王，众生耳闻不善不恶的舍的声音，执以为实，犹如有人在梦中听见他人说一些没有什么意义的不成章句的语言，就从梦中醒过来，然后就不断的回想自己在梦中所听见的语言。你怎么认为，这件事是实有的吗？净饭王说：不是实有的，世尊。</p><p>原文：<strong>佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无有音声。何况更有。不了义句。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，这个人把自己做的梦当作是真实存在的，他是有智慧的人吗？净饭王回答说：他不是有智慧的人，世尊。为什么呢？因为梦中毕竟没有任何声音，更何况还有不成章句的语言。这个人确实是白白地驱使自己的心，使之疲劳不已，根本没有其实。</p><p>舍心是既不快乐也不忧恼，处于中间离两边的状态，既不贪爱也不厌恶，既不好也不坏，既不苦也不乐，心在这个时候是平静不起波澜的，没有高低起伏。比如看一个人，觉得没有什么感觉，既不喜欢也不厌恶，这就是舍心。如果生起喜欢的心了，那就感受乐有乐受了，如果觉得这个人比较讨厌，那就是一种苦受，嗔恨心出来了，所以感受分三种，苦受、乐受和不苦不乐的舍受。</p><p>而舍的声音，是指这种声音既不属于善性的，也不属于恶性的，处于中间的不好不坏的状态。此人梦中闻他人说一些不成章句的语言，没有意义的话，虽然心里不觉得怎么样，却当作了实有的事情，而不断地回忆。即使是执著这种舍的境界为实有，贪着这种舍念，不知道舍的六尘境界同样是虚妄的，也不离生死。</p><p>这里的不了义句，与佛经中的不了义经是有区别的，不是一个意思。佛经分成了义经和不了义经，了义经是真实的，宣说的是实法，不了义经宣说的不是实法，了义经说大乘经典第一义谛如来藏法，这叫了义，是根本法实相法，其它的经典，没有讲到如来藏法的经典，就不是了义的经。没有讲到真实心如来藏这一法就是不了义的，不是根本的经典。当然了义经里也有不了义的句子，不了义经里更是有不了义的句子。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。耳闻舍声。不达义趣。轻慢毁呰。造作痴业。身三语四。意三种业。最初造作。即便灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。忆梦中闻不了义句。</strong></p><p>释：佛说：大王，确实是这样，愚痴的异生凡夫，耳根听到不喜不厌的声音，并不了达其中的真正含义，就生起轻慢、诋毁的言行，造作愚痴业，在身体上造作杀盗淫恶业，在口上造作恶口、两舌、绮语、妄语恶业，在心上造作贪嗔痴意业。恶业造作以后，刹那灭去了，灭去以后，业行不依东南西北、四维上下和中间而住，消失得无影无踪。但是在最后命根谢灭之时，自己这一生所造作的业报全部都现前了，犹如从梦中醒过来以后，心里还在念着梦中听见的不知意趣的章句。</p><p>什么是愚痴？不懂就是愚痴，愚痴就是无明，无明就是不懂，对一切法的来龙去脉不懂，对一切法的真相不懂，对什么叫五阴及五阴的实质不懂，对十八界及其实质不懂，对如何证得小乘的五蕴无我不懂，对于声闻缘觉的十二因缘法不懂，对于大乘的如来藏法不懂，对于如何开悟不懂，对于如何了知如来藏的种子功德不懂，对于如何修行自身广利众生不懂，对于如何修行成佛这些法都不懂，这就是无明，属于愚痴，包括对无明和愚痴本身也不懂，同样也是愚痴和无明。</p><p>众生存在阿赖耶识里的无明有无量无边之多，这些无明全部破尽，就成佛。无明分三种，第一种是一念无明，对三界世间的贪爱，对五阴身的执著，断尽就证四果入无余涅槃。第二种是无始无明，从无始劫来，众生都不知道有一个真实心如来藏，能出生生生世世的五阴身和三界世间法，是众生真正的不生不灭的我。第三种是尘沙无明，也可以归于无始无明里，意思是成佛路上不明之理像尘沙一样多，成佛之前都要断除，也叫修行上的烦恼，此种烦恼断除一点，无明就减少一点，离成佛就近一点。</p><p>一个人无明越少越知道自己有无明，也就越谦虚，无明越多的人越不知道自己有无明，越不谦虚越骄慢。众生因为什么有慢心？因为无明，因为愚痴。在断除烦恼的次第上，贪心和嗔恚心都比愚痴无明容易断。贪心最容易断，嗔恚心其次，断我见以后证得初禅的时候先断贪心，再熏修一段时间才断嗔恚，之后是断一念无明。修到大乘初地菩萨，开始断贪、嗔和慢的烦恼习气，以及尘沙无明，尘沙无明断尽就成佛。</p><p>在修行的各个阶段，无明程度和种类也不同，明心之前的菩萨、明心之后的菩萨和入地之后的菩萨，每一果位都对应着各种不同的愚痴和无明，乃至于九地菩萨和十地菩萨都有微薄的愚痴惑，直至成佛，成就一切种智之时，才能消除了心里全部的无明惑。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：佛说：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，以此两种因和缘和合起来，下一世的最初识就出生了，众生或者是趣于地狱道，或者堕在鬼道，或者投生到畜生道这三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心，叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别及显示罢了。</p><p>一切法都是离一切法性的，没有一法有真实的自体性，能独自存在，如是就知道身识是空的，业行也是空的，下一世产生的初识也是空的。如果识灭了，灭法也是空的，如果识生了，生法也是空的。业行的流转和造作也是空的，没有一个造作的人，受果报时也没有受果报的人，都是一种假相，一种不真实的幻化相，都只是用名相所分别和显示的虚妄相而已。</p><p>原文：<strong>大王当知。诸根如幻。境界如梦。一切诸法。皆悉空寂。此名空解脱门。空无空相。名无相解脱门。若无有相。则无愿求。名无愿解脱门。如是三法。与空共行。涅槃先道。决定如法界。周遍虚空际。于此譬喻。当如是知。</strong></p><p>释：大王你应当知道，六根就像是幻化的一样，各种境界就像梦境一样。一切法全部都是空的寂静的，这就是空解脱门；诸法空也没有空相，叫作无相解脱门；如果一切法连相也没有，就应该不生任何愿求，叫作无愿解脱门。如是空、无相、无愿三解脱门与空共同存在，走向涅槃之路就应当这样修学。要求涅槃，首先就要知道，一切法都是实相法界，都是阿赖耶识一真法界，遍布于十方虚空际。对于这些譬喻，应该这样了知。</p><p>眼耳鼻舌身意六根都是幻化出来的，眼睛见的各种境界，耳朵听的各种境界，六根所对的境界像梦里的事一样，并不真实。还要追求什么？一切诸法皆悉空寂，没有一样不是空的，没有一样不是寂灭的，什么也没有，这就是空解脱门。证得一切法空，知道是空的，心就解脱了。</p><p>空无空相名无相解脱门，空的法，没有一个相貌可见可说可指示出来，连空也空，这就是无相解脱门。知道空什么相也没有，连空也没有，心更解脱了。如果连空的相都不有，连空都没有，还着什么空呢？若无有相即无愿求，如果连相都没有，还求什么？还有什么愿求？什么都不用再求了，这就是无愿解脱门。没有愿求心更加解脱了，空、无相、无愿，三解脱门成就了就是圣人。</p><p>空、无相、无愿三法与空共行，既不离空，也没有空相，三者又不相分离，层层递进，究竟解脱。众生要想入涅槃，求得不生不灭，就应该这样修行，不断的产生空的心行，越来越空，连空也空，才空得干净利落。如果心里还有一个空，那就没有真正空，还应该灭去空的心。涅槃路上应该这样去修学，就能证得涅槃。涅槃就是解脱，涅槃就是不生不灭，涅槃就是寂静无为，涅槃就是大自在。</p><p>诸根包括眼耳鼻舌身意六根，这六根就像幻化的一样，是阿赖耶识幻化出来的，叫如幻。境界如梦，境界是眼看的色境界，耳听的声境界，鼻闻的香臭境界，舌尝的酸甜苦辣境界，身所觉的疲劳、轻安、柔软、舒适、饥饿、饱等等境界，意根所对的法尘境界。这些境界看是好像有，但是有是假有、幻有，并不真实，就像梦里的境界一样。</p><p>佛处处都在开示给众生一个真理：一切诸法皆悉空寂。意思是说一切法都是空的、寂静的。为什么如此说？因为一切法都是各种因缘聚合而有，本没有其自体性，并非是真实存在的法，因此说是空寂的。从另一方面说，所有一切法都是阿赖耶识所幻化出来的，由阿赖耶识所主导，是阿赖耶识的影子，实质是阿赖耶识，并没有一切法的实质，因此说一切法皆悉空寂。小乘的空，大乘的空性，都在指示这个真理和真相。</p><p>诸根如幻，境界如梦，观行这些法，要有较深的禅定，在各种境界中，在六根对六尘中，体会根与尘的虚幻性、不实性、不做主性、没有自体性，定慧要相结合，完全融合在一起。仔细观行，眼见色时眼根是如何的不自在，色尘是如何的虚幻，如何像影子一样；耳听声时，声音这个境界如何像梦一样，耳根如何像幻化的一样，如何生又是如何灭的，如何起听觉作用的，观行成就了，就能证得五阴空幻，寂静不生。</p><p>对于这些法的观行，初步的理解乃至于最后的理解，都不等于是证得。理解比较容易一些，意识心思惟一段时间就觉得理解了，但这不是证得，证得要有禅定，要有甚深思惟，要证据确凿，要深入到内心深处的意根，意根认可才叫证果。第六意识理解的都属于知识，没有证据或者证据不足，那都不是证，必须经过深细的观行，意根在内心深处真正认可那个理，才算证果。</p><p>那时候由于是真正证得认可五阴无我，六根虚幻，心行就改变，对万事万物的看法就转变。真认为自己是虚妄的时候，心里肯定要发生变化，不可能与从前一样，还是那个老样子。而意识理解的，没有证得时，内心不知道五阴确实是无我，对自我的认知不会改变，对五阴的看法只是停留在理论上，心行还是一如既往，烦恼还是原来那样重，如果不能断除三缚结，三恶道就不能免除。</p><p>这与世俗法所说的眼见为实、耳听为虚的道理是一样的。听别人所说相当于意识的理解，并没有证实，自己心里还是很虚，不敢较真。之后，眼见了，自己才真正地知道了，就会说：啊！原来如此！这时对人对事，就知道该怎样处理了。眼见相当于意根的证得，耳听相当于意识的理解，这是两种截然不同的层次。意识的理解是从他人那里听来的，意根的证得是亲眼所见，是现量知，是真实看见。</p><p>理解的相当于道听途说，和实际的亲眼所见，差别很大。比如听说某个人如何如何，心里生起一种看法，有了某种印象，可是等见面一观察，原来是这样，与心里的印象不完全一致，见面时的感觉和印象更真实可信，然后自己才能对此人采取相应的态度。如实了解和观察以后，自己的观点、意见、想法、行为造作和听的时候就不一样了。</p><p>所以学法修行要用心熏习，熏习到内心深处，真真正正地去观行诸根如幻，五阴无我。观行的时候就是第六识的初步思惟，思惟以后落到意根里，让意根自己思量，让意根去证实认可这个理，这就是证果。意根如果不认可意识思惟观行的理，那就没有用。要想尽快地让意根证得，就要证据确凿，尽量能达到现量观察的程度。观行的中间还有很多的程序，有很多的路要走，有很多的法要去修，要不断地修集种种资粮和道粮，需要不断地修集福德资粮，还有戒律、忍辱、禅定、智慧，不断地圆满这些六度的条件。</p><p>一切诸法皆悉空寂，这叫空解脱门。空也没有一个空相，空法本身没有空相，只是一个名词概念，没有相。空没有空的相貌，一个相都没有，空相也没有，这叫无相解脱门。如果是一切相都没有了，还有什么希求，还有什么愿望和愿求？一切法都是空的，你还希望怎么样？没有愿求了，就名无愿解脱门。如是三法与空共行，心就解脱了，这叫三解脱门。空、无相、无愿，这个愿就是希求、愿果，希发的誓愿，因为一切都没有，无论抓取什么都是空，即使成就佛果也是空。</p><p>《金刚经》里讲，成佛的果位也不可得。如果连成佛的果位都不可得，你还想得到什么？不管你觉得得了什么，经过仔细的分析论证，就知道什么也没有得到，根本就没有得的人，何况还有得的法。有人就要问了，如果都不可得，那我们还修什么？修行就是先知道一切法是不可得的这个道理，然后再证得一切法都是不可得的，最后内心空空，就能得大解脱，不再被有所得所系缚，就解脱一切生死苦。即使是真没有所得，我们也要得这个不得法，否则生死轮回就不止。</p><p>一切法都是虚妄的不可得的，受苦报是假的，但谁也不希望受苦报，造作恶行是假的，但是也不要造作恶业行；杀人这件事是假的，但是也不要去杀人；地狱是假，谁也不愿意去；成佛是假，却都愿意成佛。修行就是这样，假法有假法的作用，真法有真法的作用，既然不能都灭除，就要把假法变得更好，更清净。七识心是假的，但是却有很大的作用，那就一定让祂起最好的作用，不能把假都放弃不要了，那样不能成佛。这个辩证看似矛盾，证果明心以后就知道并不矛盾。</p><p>原文：<strong>大王。譬如有人。于睡梦中。以旃檀香。或多摩罗叶香。及余香等。而以涂身。于意云何。是人觉已。忆念梦中。所涂之香。是实有不。王曰不也。佛言大王。是人所梦。执以为实。为智者不。王曰。不也世尊。何以故。梦中毕竟。无有诸香。何况复有。以涂身耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，譬如有人在睡梦中，用旃檀香、多摩罗叶香或者是其它香，来涂抹自身，你对这件事怎么想呢？这个人醒来以后，还在回忆梦中自己所涂抹的香味，涂香这件事是实有的吗？净饭王说：不是实有的。佛说：大王，这个人把自己所做的梦执著为实有的，他是否是智者？净饭王说：这个人不是智者，世尊。为什么这样说？因为梦中毕竟没有香，何况涂香这件事就更不能有了，这个人真是白白地妄想，劳逸其心，根本没有真实的事。</p><p>梦里涂香这件事是虚妄的，做梦这件事也是虚妄的，那么这个人是否做梦了？确实做梦了。虽然做梦是一种假相，但是假相的存在是不可否认的，我们只要能想办法认识到这是做梦，就清醒了，认识到这些法都是假相，想办法证明这些法都是虚幻的，那就觉悟了，将来就能远离生死。</p><p>除了阿赖耶识，一切法都是幻化出来的，都是假的，但是假法有假法的作用，假法起作用的时候也是假，五阴本身也是假的，但是五阴身的作用还需要有，四果以前的众生都没有能力灭除五阴假相，那么就要把假法假相变得更清净更自在，以断除一切苦受。众生成佛也不会灭除五蕴色身这个假法，只不过把五蕴变得非常殊胜非常清净，没有一丝染污和无明，具有了三十二相八十种随形好。</p><p>修行就是要认识和探究这些假相是如何出现的，如何是虚妄的，梦里涂香这件事是否存在，不可否认有这种幻化的假相，假相非常的不实在，但是这种不实在法是如何出现的，如何幻化出来的？探究出来以后，才有大智慧。梦醒以后，五阴所做的一切事也同样都是虚妄的幻化的，与做梦无别，那么五阴以及五阴的活动，是如何幻化出来的？这样不断地观行探究，才是实际修行，需要多修禅定，深入禅定中去参禅去证得这些深奥之理。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。初闻妙香。便生爱乐。心起染着。造如是业。身三语四。意三种业。造彼业已。即便灭谢。是业灭已。不依四方。四维上下。中间而住。乃至最后识灭。自业现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生在刚刚嗅到微妙的香气时，就生起爱乐，心被香气所染着，造作了贪嗔痴烦恼业。恶业造作以后刹那灭去了，灭去以后，业行不依东南西北四维上下和中间而住，消失得无影无踪。但是在最后命根谢灭之时，自己这一生所造作的业报全部都现前了，犹如从梦中醒过来以后，还在念着梦中的事情。</p><p>闻香感到心情非常喜悦和舒畅，生起爱乐心，心就染着了，心不贪爱香味就不会感到喜悦，只能是觉得无所谓。心一起了爱乐，就被染着被粘住了，心就不自在不自由，被六道里的境界锁住，就轮转于生死，不得解脱了，染污心、粘染心、爱乐心就是绳锁，能把五阴身牢牢地锁在三界大狱中。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生起。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：佛说：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，以此两种因和缘和合起来，下一世的最初识就出生了，众生或者趣于地狱道，或者堕在鬼道，或者投生到畜生道等三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心，叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世去，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候，没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时，也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么说一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，其自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别和显示罢了。</p></div>"
},{
    "title": "第二章 五个梦喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  五个梦喻</strong></p><p>原文：<strong>大王。如人梦中。见以死蛇。死狗人尸。系己颈上。心生怖畏。于意云何。是人觉已。忆念所见。为实有不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无死蛇等。何更复有。系之颈耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：大王，就像有人在梦中看见死蛇、死狗、死人尸体系在自己的脖子上，心里就生起了恐惧情绪。你怎么认为呢？这个人醒来以后，还在想着梦里所见到的恐怖事情，梦里所见是实有的吗？净饭王说：不是实有的。佛说：大王，这个人把所梦见的事情执著为实有的，他是有智慧的人吗？净饭王说：他不是有智慧的人，世尊。为什么这样说呢？因为梦中并没有什么死蛇死狗之类的东西，怎么还能有把死蛇死狗系在脖子上这件事呢？这个人只是白白劳役其心，都没有实事。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。见是臭恶。嗔恚毁呰。造作是业。身三语四。意三种业。造是业已。刹那灭谢。是业不依。东西南北。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚夫异生对这样臭恶的死尸生起了嗔恚心、毁灭心，造作了恶业，色身上造作三种，语言上造作四种，意业上造作三种。造作出十恶业以后，业行刹那灭去，并且是边造边灭，灭了以后，业行也没有地方可去，不依东南西北四维上下而住。最后命根灭去时，此世色身上应该受的业报全部都现前了，犹如梦醒以后还在念着梦中的事一样。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗果。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。 名为生蕴。</strong></p><p>释：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，以此因和缘和合起来，下一世的最初识就出生了，众生或者趣于地狱道，或者堕在鬼道，或者投生到畜生道三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时，没有来处，灭时也没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别显示罢了。</p><p>原文：<strong>大王。譬如有人。于睡梦中。为彼非人。断其鼻根。于意云何。是人觉已。忆念梦中。鼻根断坏。是实有不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无有鼻根。何更说有。被断坏耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：大王，譬如有人在睡梦中梦见被一个非人割断了鼻根，你觉得如何？这个人醒来以后，不断地回想梦中鼻根被毁坏的事情，这个事情是实有的吗？净饭王说：不是实有的，世尊。佛说：大王，这个人把自己所梦见的事情执著为实有的，他是有智慧的人吗？净饭王说：他不是有智慧的人，世尊。为什么这样说呢？因为梦中毕竟没有鼻根这个东西，更何况还有鼻根被割断这样的事，应该知道这个人只是白白地劳役其心罢了，根本没有实事。</p><p>非人不属于人类，包括了阿修罗、琰摩罗、大鹏金翅鸟、鬼神那类，他们都不是人，很多非人也作我们人类的护法神，他们既造恶业也做善业。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。见鼻根坏。起恐怖想。造作痴业。身三语四。意三种业。最初造作。刹那灭谢。是业灭已。不依四方。四维上下。中间而住。最后边际。命根灭尽。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生，看见自己的鼻根毁坏了，就生起恐怖心，造作愚痴业，身体三种语言四种意业三种。从最初开始造作起，业行就边造作边刹那灭去，这些业行灭去以后，不依东西南北四维上下而住。但是当最后生命快结束时，自己这辈子造的业报就全部现前了，犹如梦醒以后，还在念着梦中的事一样。</p><p>原文：<strong>大王。识为其主业为攀缘。二种相因初识生起。或趣地狱。或堕傍生琰摩罗界及阿修罗若人若天。初识生已各受其报。同分心品相续随转。最后识灭名为死蕴。最初识起名为生蕴。</strong></p><p>释：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，以此因和缘和合起来，下一世的最初识就出生了。初识出生以后，众生或者趣于地狱，或者堕在鬼道，或者投生到畜生道等三恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世去，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候没有来处，灭时也没有去处，造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样来了知身识，了知身识的自性空；像这样来了知自身识所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别和显示罢了。</p><p>原文：<strong>大王当知。诸根如幻。境界如梦。一切诸法。皆悉空寂。此名空解脱门。空无空相。名无相解脱门。若无有相。则无愿求。名无愿解脱门。如是三法。与空共行。涅槃先道。决定如法界。周遍虚空际。于此譬喻。当如是知。</strong></p><p>释：大王你应当知道，六根就像是幻化的一样，各种境界就像梦境一样。一切法全部都是空的寂静的，这就是空解脱门；诸法空也没有空相，这叫作无相解脱门；如果一切法连相也没有，就应该不生任何愿求，这叫作无愿解脱门。如是空、无相、无愿三解脱门与空共同存在，走向涅槃之路就应当这样修学。要想求得涅槃，首先就要知道，一切法都是实相法界，都是阿赖耶识一真法界，遍布于十方虚空际，然后才能证得涅槃。对于这些譬喻，应该这样了知。</p><p>眼耳鼻舌身意六根都是幻化出来的，眼睛见的种种境界，耳朵听的种种境界，六根所对的种种境界，犹如梦里的事一样，并不真实。还要追求什么，一切诸法皆悉空寂，没有一法不是空的，没有一法不是寂灭的，什么也没有，这就是空解脱门。证得一切法空，知道是空的，就解脱了。</p><p>空无空相，名无相解脱门，空的法，没有一个相貌可见、可说、可指示出来，连空也空，这就是无相解脱门。知道空什么相也没有，连空也没有，心更解脱了。如果连空的相都没有，连空都没有，还着什么空呢？如果连相都没有，还要求什么？什么都不用再求了，这就是无愿解脱门。没有愿求心更加解脱了，空、无相、无愿，三解脱门修成就了，就是圣人进入圣位。</p><p>空、无相、无愿三法与空共行，既不离空，也没有空相，三者又不相分离，层层递进，究竟解脱。众生要想入涅槃，求得不生不灭，就应该这样修行，不断地产生空的心行，越来越空，连空也空，直至空得干净利落。如果心里还有一个空，那就没有真正空，还应该灭去空的心，涅槃路上这样去修学，才能证得涅槃。涅槃就是解脱，涅槃就是不生不灭，涅槃就是寂静无为，涅槃就是大自在。</p><p>涅槃的道路，应该这样走。而涅槃最初所依止的是一真法界，阿赖耶识这一法，没有阿赖耶识就没有四种涅槃可说，依阿赖耶识如来藏法界来说，一切法才是空寂无相的，因此才没有愿求。这些法理周遍虚空际，无论在虚空的哪个世界里都是这样的一个真理，一切法都是空的，这个理在一切的虚空边际都适用，都是如此。</p><p>涅槃分四种：有余依涅槃、无余依涅槃、自性清净心涅槃和无住处涅槃。小乘的涅槃就是要把一切法都灭了，涅槃是一个假的名词，是指达到一种不生不灭的状态，它只是一种性质状态，不是真实有的法。真实有的法就是如来藏，在如来藏体上显示一种不生不灭的性质、不动的性质，这就是涅槃。阿罗汉入无余涅槃里没有阿罗汉，只剩下他的如来藏心，处于一种不生不灭的状态，那个状态就是涅槃，所以涅槃也是一个假名词。只有实相心，如来藏心，才是真法，是实法，其他的都是假法。</p><p>佛在《大般涅槃经》里也是这么说的，就像真如也是一种性质状态，真如是阿赖耶识如来藏所显现的一种真实和如如的性质，它是一个名词。实相就是如来藏真实有的相，在真实有的相上所显现出的一种真实的性，和如如不动的性质，就是真如。所以说涅槃与空共行，空尽了，就入无余涅槃。</p><p>原文：<strong>大王。譬若有人。于睡梦中。为彼饥渴。之所逼切。遇诸美馔。随意而食。于意云何。是人觉已。忆念美馔。为实有不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无彼美膳。况得食耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，譬如有人在睡梦中被饥渴所苦恼逼迫，遇见了美味的佳肴，就肆意大吃。你的看法如何？这个人睡醒以后，不断的回想着梦中的美味佳肴，这件事是实有的吗？净饭王说：不是实有的。佛说：大王，这个人把自己的梦境执著为实有的，他是有智慧的人吗？净饭王说：他不是有智慧的人，世尊。为什么如此说呢？因为梦中毕竟没有那些美味佳肴，更何况还有享受饮食之事，应该知道这个人只是白白地劳役其心罢了。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。见美食已。心生爱着。起于贪行。身三语四。意三种业。最初造作。刹那灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业报。皆悉现前。犹如梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生遇见美食以后，心里生起贪爱，造作贪业行，身业三种语业四种意业三种。从最初开始造作起，业行就边造作边刹那灭去，这些业行灭去以后，不依东西南北四维上下而住。但是当最后生命快结束时，自己这辈子造的业报就全部现前了，犹如梦醒以后，还在念着梦中的事一样。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：阿赖耶识为出生后世五阴身的主人，业种为所缘，因和缘二者和合起来，下一世的最初识就出生了，众生或者趣于地狱，或者堕在鬼道，或者投生到畜生道三个恶道中；或者投生到阿修罗道、人道和天道三个善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候，没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别显示罢了。</p><p>原文：<strong>大王。如人梦中。为饥所逼。得其苦瓠。并拘赊怛计子。毕租摩哩捺子。而便食之。心生恚恨。于意云何。是人觉已。忆其梦中。食苦瓠等。为实有不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无苦瓠等。况复食耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：大王，譬如有人在梦中为饥饿所逼迫，得到了苦瓜和拘赊怛计子、毕租摩哩捺子等等苦口而难吃的东西，于是就吃了，吃完以后心里就感到痛苦，生起了忿恨。你怎么想呢？这个人醒过来以后，回忆自己在梦中吃苦瓜的事，这件事是实有的吗？净饭王说：不是实有的。</p><p>佛说：大王，这个人把自己所梦见的事情执著为实有的，他是有智慧的人吗？净饭王说：他不是有智慧的人，世尊。为什么这样说呢？因为梦中毕竟没有苦瓜这个东西，更何况还有吃苦瓜这样的事，应该知道这个人只是白白的劳役其心罢了，根本没有实事。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。梦为饥逼。啖其苦味。心生恚恼。造是业行。身三语四。意三种行。造彼业已。即便灭谢。是业灭已。不依东方。南西北方。四维上下。中间而住。最后边际。命根灭时。自分业。报皆悉现前。犹如梦。觉念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生，在梦中被饥饿所逼迫，吃了苦味的饮食，心就生起了恚恼，造作了恶业行，身业三种、语业四种、意业三种。从最初开始造作起，业行就边造作边刹那灭去，这些业行灭去以后，不依东西南北四维上下而住。但是当最后生命快结束时，自己这辈子造的业报就全部现前了，犹如梦醒以后，还在念着梦中的事一样。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，因和缘二者和合起来，下一世的最初识就出生了，众生或者趣于地狱，或者堕在鬼道，或者投生到畜生道等三恶道中；或者投生到阿修罗道、人道和天道三善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世去，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候，没有来处，灭时也没有去处。造作业行时，业行没有来处，业行灭去时也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别显示罢了。</p><p>原文：<strong>大王。如人梦中。舌根断坏。于意云何。是人觉已。忆念梦中。是为实不。王曰不也。佛言大王。是人所梦。执以为实。是智者不。王曰。不也世尊。何以故。梦中毕竟。无有舌根。况复断坏。当知是人。徒自疲劳。都无有实。</strong></p><p>释：大王，犹如有人在梦中梦见舌根断坏了，你怎么想？这个人醒过来以后，不断地回忆自己梦中的事，梦中的事是实有的吗？净饭王说：不是实有的，世尊。佛说：大王，这个人执著自己的梦是实有的，他是否有智慧？净饭王回答说：他没有智慧，世尊。为什么如此说？因为梦中毕竟没有舌根，何况还有舌根断坏之事，应该知道这个人只是白白地劳役其心，没有一点实事。</p><p>原文：<strong>佛言大王。如是如是。愚夫异生。见舌坏已。心生恚恼。造是业行。身三语四。意三种业。造彼业已。刹那灭谢。是业不依。四方四维。上下而住。最后边际命根灭谢。自分业报。皆悉现前。如梦觉已。念梦中事。</strong></p><p>释：佛说：大王，确实是这样，愚痴的凡夫异生，在梦中见自己的舌根坏了以后，心就生起了恚恼，造作了恶业行，身业三种、语业四种、意业三种。从最初开始造作起，业行就边造作边刹那灭去。这些业行灭去以后，不依东西南北四维上下而住。但是当最后生命快结束时，自己这辈子造的业报就全部现前了，犹如梦醒以后，还在念着梦中的事一样。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。初识生已。各受其报。同分心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：大王，阿赖耶识为出生后世五阴身的主人，业种为所缘，因和缘二者和合起来，下一世的最初识就出生了，众生或者趣于地狱，或者堕在鬼道，或者投生到畜生道等三恶道中；或者投生到阿修罗道、人道和天道三善道中。当最初的识心出生以后，众生就开始各受其业报，然后在同一色身上的识心就不断地连续地运行下去。到命终识心灭去时，色身就是死尸，名为死蕴，在色身上最初生起的识心叫作初识，色身五阴名为生蕴。</p><p>原文：<strong>大王。无有少法。从于此世。得至他世。所以者何。性生灭故。大王。身识生时。无所从来。灭无所去。彼业生时。无所从来。灭无所去。初识生时。无所从来。灭无所去。何以故。自性离故。</strong></p><p>释：佛说：大王，没有任何一个法能从此世流转到下一世去，为什么如此说？因为一切法的自性都是生灭不已的，不是常存常在的，到临终五阴灭去时，一切法都会灭去。大王，身识出生的时候，没有来处，灭时也没有去处，造作业行时，业行没有来处，业行灭去时，也没有去处。下一世最初的识心出生时，没有来处，灭时没有去处。为什么一切法都没有来处也没有去处？因为一切法离一切性，一切法的自性没有一切相，自体性为空，了不可得。</p><p>原文：<strong>如是了知。身识身识空。自业自业空。初识初识空。若灭灭空。若生生空。了知业转。无有作者。亦无受者。但唯名相。分别显示。</strong></p><p>释：像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别和显示罢了。</p><p> 众生所接触的一切法都是虚妄的法，把这些法反反复复地与梦境相比对，对世俗法就能有切实的体会，内心的执著就会松懈下来，很多事就不愿意再做了，现实生活中的身口意行就能逐渐清净。世尊在这部经里反反复复地用梦作比喻引导净饭王看破五欲六尘的虚幻，认清这个世界的本质就是一种梦幻，没有真实性。</p><p>原文：<strong>大王当知。诸根如幻。境界如梦。一切诸法。皆悉空寂。此名空解脱门。空无空相。名无相解脱门。若无有相。则无愿求。名无愿解脱门。如是三法。与空共行。涅槃先道。决定如法界。周遍虚空际。于此譬喻。当如是知。</strong></p><p>释：大王你应当知道，六根就像是幻化的一样，种种境界就像梦境一样。一切法全部都是空的寂静的，这就是空解脱门；诸法空也没有空相，叫作无相解脱门；如果一切法连相也没有，就应该不生任何愿求，叫作无愿解脱门。如是空、无相、无愿三解脱门与空共同存在，走向涅槃之路，就应当这样修学。要想求得涅槃，首先就要知道，一切法都是实相法界，都是阿赖耶识、一真法界，遍布于十方虚空际，然后才能证得涅槃。对于这些譬喻，应该这样了知。</p><p>眼耳鼻舌身意六根都是幻化出来的，眼睛所见的种种境界，耳朵所听的种种境界，六根所对的种种境界，就像梦中的事一样，并不真实。那还要追求什么？一切诸法皆悉空寂，没有一法不是空的，没有一法不是寂灭的，什么也没有，这就是空解脱门。证得一切法空，知道一切法是空的，心就解脱了。</p><p>空无空相，名无相解脱门，空的法，没有一个相貌可见、可说、可指示出来，连空也空，这就是无相解脱门。知道空什么相也没有，连空也没有，心更解脱了。如果连空的相都不有，连空都没有，还着什么空呢？若无有相即无愿求，如果连相都没有，还有什么愿求？什么都不用再求了，这就是无愿解脱门。没有愿求心更加解脱了，空、无相、无愿，三解脱门如果修成就了就成为圣人，进入圣位。</p><p>空、无相、无愿三法与空共行，既不离空，也没有空相，三者又不相分离，层层递进，究竟解脱。要想入涅槃，求得不生不灭，就应该这样修行，不断的产生空的心行，越来越空，连空也空，才空得干净利落。如果心里还有一个空，那就没有真正空，还应该灭去空的心。涅槃路上应该这样去修学，才能证得涅槃，涅槃就是解脱，涅槃就是不生不灭，涅槃就是寂静无为，涅槃就是大自在。</p></div>"
},{
    "title": "第十八卷 六界差别品第二十六之三",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十八卷  六界差别品第二十六之三</strong></p><p>在此卷里，世尊仍然用了几个譬喻，来说明现实生活中所接触的境界和梦中所现的情景，其性质是相同的，全部都是虚妄的。世尊反反复复讲梦，用梦来警醒佛的父亲净饭王应该早些觉悟，因为净饭王当国王已经很久了，一直在享受五欲之乐，很难自拔，佛就用梦来劝告祂的父亲，赶快修道求取解脱，不要再沉溺于五欲之乐中。同时也是借此警醒所有弟子们，应该充分认识到万法的虚妄性，当意根真正认可这些法的虚妄性时，就能证道，获得小乘的解脱果，甚至是大乘解脱果，从而走上解脱成佛之路。</p><p>小乘修行到一定程度，就能证得五蕴世间是空的，十八界一切法都是空的，这样就能断除内心三种结缚：我见、见取见、疑见，以后就能趣向解脱，解脱生死轮回苦。而修行就是要认识到所谓的我是空的，色身是空、心是空、感受是空、念想是空、思惟觉观是空、行为造作是空，色受想行识五蕴都是空；十八界都是空，眼耳鼻舌身意六根是空，六根所对的六尘是空：色尘是空，声尘是空，香尘是空，味尘是空，触尘是空，法尘是空，六识心都是空：眼识是空，耳识是空，鼻识是空，舌识是空，身识是空，意识是空，最后意根也是空。五蕴全部都证得空，这样就断我见，得证法眼净。</p></div>"
},{
    "title": "第十八卷 六界差别品 第二十六之三 第一章 第十三个梦喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  第十三个梦喻</strong></p><p>原文：<strong>佛言大王。譬若有人。于睡梦中。与诸宝媛。共相执持。是人觉已。忆念梦中。所受妙触。为实尔不。王言不也。</strong></p><p>释：佛说：大王，譬如有人在睡梦中与诸多美女共相娱乐，这个人醒过来以后，还在不断地回忆梦中所感受到的美妙的触受，这件事真实存在吗？净饭王说：这件事不是真实存在的。</p><p>这个人做完梦以后醒了，还把梦中的事当作真实的，一直沉浸在梦境当中，不断地回忆，贪恋不舍。这个人是没有智慧的，不知道梦境是虚妄不真实的，他不应该痴迷于不实在的假相当中，追求虚幻的觉受与感觉，不应该这样的迷惑颠倒，以假当真。在梦中的觉受都是虚妄的，何况醒过来以后再回想梦中的事，其感受更是虚妄。</p><p>心里回想的事是否存在？已经不存在了，否则就不叫作回忆了。比如说回想刚才吃的东西很香，东西已经吃过了，香味现在已经没有了，不存在了，无论怎样回味，都没有实际的作用，甚至毫无益处，消失的东西不再回来了。而梦境比过去了的现实境界更虚幻，回想只能说明心的贪着不舍，无益地沉浸在虚幻的想象当中，徒耗宝贵的时间和精力。</p><p>再比如回想某人说过的话，回忆时那些话现在还在耳畔吗？耳边并没有声音，过去了的声音，说过的话，对于现在来说是不存在的，没有什么作用了。如果再对那些声音抓着不放，计较执著不断，那就是幻上加幻。声音存在的当下就是虚幻的，何况已经消失了的，更是虚幻不实。过去了的六尘境界，如果说还有作用，那其实是心里所产生的虚妄分别和思惟想象，心里再产生虚妄的感受和执著而已，实际上不再有作用了，过去了就是过去了，执著不舍只是徒增烦恼罢了。众生在日常生活中，对六尘万法都感觉很真实，而实际却都不真实，如空花幻影一般。</p><p>众生无始劫以来就是这样，一直都在追求着并不实在的虚无缥缈的东西，把虚幻的五阴世界当作真实，妄想不断，徒增其苦。诸佛见众生的愚钝和苦恼，心生慈悯，出于世间，宣说真相，化导群蒙，令离愚暗朽宅，趣向解脱大道。既然五欲六尘境界如梦一样的不真实，就应该把心用在修道上，在六尘上再怎么用心，也是徒劳无益的，只是为满足虚妄的欲求而已。实质上这种欲求，是没有必要的，因为这种欲求，要做很多无意义的事情，还要造作许多恶业。如果没有那些世俗法上的欲求，众生就是一个正常的人、一个觉醒的人、一个清净的人、一个没有业障、没有烦恼的人。</p><p>修道就是修心，要想把心修好，首先要认识到自心的虚幻不实，所贪着的六尘境界虚幻不实，然后再修定观行，才能灭除虚妄的贪求、欲求、想念、感受，断除心的烦恼愚暗，这样才能不受生死轮回苦，这是小乘的修法。大乘的修法就是要明心证悟，证得阿赖耶识，知道祂在何处运行，起什么作用，如何起作用的，如何出生五阴的，如何与妄心和合，如何产生万法，如何变现识心的。</p><p>证得阿赖耶识以后，就证得了祂的不生不灭性，同时就知道了是祂产生了五阴身这个我，所以被祂出生的五蕴是空的、虚妄的、幻化的，祂出生的十八界是空的、幻化的，是不真实的，这也同时证得了小乘空果。开悟的时候不仅证得大乘的果位，也证得了小乘的果位，而证小乘空的果位，不一定能同时证大乘菩萨的果位，但是证大乘的菩萨果位的同时，一定证得小乘初果的果位，三恶道业种也同样消灭了。</p><p>众生生生世世造作的恶业很多，开悟和证果以后就不用再去三恶道受报，在人中受些微苦就可以了，来世或者生天修行，或者在人中修行，不会再下三恶道。除非菩萨们有能力有愿力，去三恶道度那些因缘成熟的众生。比如某个弟子善根非常深厚，偶尔不慎，造了一个三恶道业，下了三恶道，菩萨如果有能力，就可以跟他到三恶道里继续去度他，这是菩萨的发心。但是菩萨们下三恶道不是因为恶业，而是因为愿力，其苦受要比那些因为业力去的众生轻微极多，因为菩萨有善愿故。</p><p>原文：<strong>佛言大王。于意云何。是人所梦。执以为实。是智者不。王言。不也世尊。何以故。梦中毕竟。无有宝媛。况复有彼。美妙触耶。当知是人。徒自疲劳。都无所得。</strong></p><p>释：佛说：大王，你怎么想，这个人把自己所梦见的事情当作实有的，而生执著，他是否有智慧？净饭王说：这个人没有智慧，世尊。为什么这样说呢？因为梦中毕竟没有美女，何况还有那些美妙的触受，更是不可能了。从这个事情上就应该知道这个人只是白白劳累其心，都没有实益，什么也得不到。</p><p>净饭王很有觉悟，知道梦里确实没有可爱的女人，连人都没有，何况还有那些美妙的触受，根本没有。实际上在众生日常生活中，一切人事物理也与梦中的境界是一样的，梦中好像一切法都存在，可是毕竟没有实质，全部是幻化的，不是真实的，没有实际功用。诸佛从三界生死大梦中早已清醒过来，了知一切法毕竟无所有，其相都是幻化不实的，因此断除了一切的贪欲和执著，心中一法也无。</p><p>怎样认识和理解五阴如梦一样的虚妄不实呢？这要从色身和识心两部分来认识和观行。色身是一个不断在生灭变化的像木头一样的肉体，如果没有识心在色身上运作，色身就没有任何活动和功能作用。在色身上起用的前七识不断地生了灭、灭了生，生生灭灭如旋火轮。七识并不真实，阿赖耶识不断地输送识心种子，七识才能起作用，阿赖耶识如果不输送种子，七识就不起作用，也就没有五阴的功能作用了。作为一个整体的五阴身是组合而来的，由色受想行识组合而成，并不真实，缺少一个，五阴身就不完整了，由各种因缘所聚合起来的生命体，就是一个虚妄的法，而且当下就是虚妄的，用不着特意去把他想成虚妄的。</p><p>在任何一个刹那的五阴活动中，阿赖耶识如果不输送识种子，五阴活动立即停止，就没有生命的征兆了，色身就是这样的虚妄。五阴身就像是机器人，是不自主的，被控制着的，种子库房里如果没有原材料源源不断的供应，机器就会停止运转。如果意根这个电源开关不启动，原材料也不能运送到色身上，五阴身还是不能运转。这样虚幻的色身，是没有一点真实性的，现象上的存在，只是恍人眼目、迷惑人心罢了。</p><p>这些生生灭灭的幻化相，凡夫和菩萨们虽然舍不得，同样也取不得，犹如梦中的幻境一样，我相、人相、众生相、寿者相，这四相同样没有真实的相貌，犹如梦中物。现实生活和梦境是一样的，没有真实的我这个人，也没有你这个人，没有他，没有众生，没有寿命，这些全部是一种虚妄的假相，从内心当中真正认可证得了，就证果。而证得现实生活和梦境是一样，就修到了十回向位的菩萨果位了。</p><p>五阴当中用的最多的是六识和七识，第六识就是各种各样的思想、见解、感受、觉受、分别。比如能听法的心是第六识意识，台上正在讲的法是法尘，意根和法尘一接触，阿赖耶识出生意识，祂会思惟分析所听到的是什么内容，然后生起觉观和对法的明了和不明了的感受。众生活着都是以六、七识为主，前五识是次要的，五识没有那么多而复杂的识心活动，只是简单粗略的看、听、嗅、尝、触，而细微的分别、感受、想法以第六识为主。意根是作主的识，没有意根就没有第六识。众生五阴活动都是以这两个识为主，修行主要是修这两个识。这两个识彻底改变了，前五识就变，第八识的功能才能完全得到发挥，那么众生就成佛了。</p><p>所以修行是修真心还是修妄心？真心不用修，把妄心的无明断尽了，烦恼断尽了，那么真心就恢复到祂的本来面目，把恶业的种子从真心里清理出去，真心就恢复祂自己的本来面目，众生就是一尊佛。众生现在之所以还不是佛，是因为阿赖耶识里还含有七识的无明和染污业。成佛需要破除无数的无明，证得了一个理，就破一个无明，无明破尽就圆成佛道，修行的路就是这样走。</p><p>梦醒了，还在不断地回忆梦境，沉浸在梦境中，当知是人徒自疲劳都无所得，只是让心在徒劳地消耗精力而已，没有什么用处，意识贪图虚幻的受用，只能暂时得到一种心理安慰，实际没有任何益处。迷恋于并不存在的人和事，这样的识心觉受太虚妄了。众生无始劫来都是这样执著于并不真实存在的人事物理，自己苦恼自己，外边本来什么事也没有，只是意识在那里幻想和妄想。天下本无事，庸人自扰之，众生都是庸人，把外边的事当真，然后心就不断地翻动，不断地涌动，都无有其事，自找苦恼罢了。</p><p>等到真正证得万法都是空、无相，心就不动了，不动时心就清净自在了，不动时心就获得了寂灭乐，这是最快乐的，那种快乐里没有任何烦恼。乐里都有烦恼，亲人聚会很高兴，是烦恼，结婚生子很快乐，是烦恼，还会产生苦恼，都不清净自在。修到寂灭乐的时候，一颗不动的心一点烦恼烦躁都没有，众生现在想象不到没有烦恼和情绪的涌动到底是什么心境，真尝到了那种乐境，恐怕再也不愿意贪着一点世俗境界了。</p><p>阿赖耶识根本没有一丝烦恼，总处于寂灭乐当中。为什么？因为祂无眼不见，无耳不听，无鼻不嗅，无舌不尝，无身不觉触，无意不思法，什么心境也没有，但祂不是傻子。没有证得阿赖耶识的人很难体会证得三昧时的那种乐，与世间亲人聚会那种乐、升官发财的那种乐是截然不同的性质。寂灭乐里无一切乐，世间的一切法都不见，不贪着，没有混乱、没有动乱，而世间的乐都在动乱当中，是不寂静的，是烦恼和苦恼的。</p><p>仔细思惟识心的虚妄性，细心观察世间一切法的生灭虚幻性，内心就会减少攀缘，少一些幻想和乱想，世人精神方面的疾病就减少了，神经衰弱和失眠就减轻了，各种各样的病症就减少了。疾病是从哪里来的？一个是过去世业行的果报，一个是现世烦恼妄想出来的。众生都是自己给自己找苦受，理通了以后心就没有烦恼了，理不通的时候就烦恼重重，苦受无量，都是自找的，没有人给予。所有疾病都是虚妄、幻化的，没有来处，疾病灭去了也没有灭处，因为是虚幻的。把这些理想通了，就能治百病，什么生理医生、心理医生，全都不用，一切病障幻生幻灭，佛法一通，万法皆通，学好佛法，一切世间法就全通了。</p><p>世间人身体的疾病，心理的疾病，家庭里的一切烦恼，工作事业的烦恼，如此种种，都是被自己的无明业障缠裹的结果，没有学佛的人，不通这些理，学了佛的人还没有学明白，没有进行深细的思惟和观行，就被自己的无明遮障了。真正要弄懂世间真理，首先要把自己弄明白，以后万法就能都通了。</p><p>所以世间法不通，是心有结缚，需要解开的是自己的心结，而不是解决外边的境界。不要抱怨外界的色尘那么诱惑人，非要来扰动自己的心，要反思自己的心为什么被外色所吸引，被外色所抓住了，为什么非要去粘染外境，是外境要束缚、粘住自己吗？不是，是自己的心非要去抓取，结果就被境界粘住了。本来是想要去抓境界，结果却被境界给抓住了，五欲六尘把自己束缚得死死的，生生世世受贫苦轮回苦，被绑缚在六道轮回的生死大海中。</p><p>观行世间万法都是从哪里来的，识心从哪里来的，如何现起五蕴和世间万法的，就能证大乘菩萨果位，然后再像净饭王那样成就无生法忍，成为初地菩萨，那就更好了。证得初地菩萨以后再往生极乐世界是什么果位？听阿弥陀佛亲自讲甚深唯识法，就能很快证得二地到八地菩萨果位。八地菩萨能于一念间变造三千大千世界，无量个星球马上就能变造出来，一手托着地球，另一手托着众生，把众生移到别的星系，众生毫无察觉；八地菩萨一张口，四大海水倒入菩萨的口中，鱼、虾、龙等等众生都不知道自己被吸到菩萨肚子里，无法察觉出来。</p><p>这个星球要毁灭时，八地菩萨把这个星球的众生都挪到另一个星球上去，众生都不知道。十亿个地球，十亿个须弥山，十个六层欲界天，所有的天界都是十亿，十亿个地狱，十亿个阎摩罗界，十亿个四大海，组成了一个三千大千世界，相当的广大，八地菩萨都能全部变现出来。</p><p>大菩萨们的境界，众生很难想象得出来，无法想象时是很难相信有那么多不可思议的事。其实当众生的善根福德因缘真正都具足的时候，这些法的证得是不难的，更别说相信了。我们要对佛和法有信心，对菩萨有信心，也要对自己有信心。勤修戒定慧，福德是基础，要不断地完善、圆满行菩萨道作菩萨的资粮和条件，让证悟的因缘早日现前，就会实现做菩萨的愿望。</p><p>原文：<strong>佛言大王。如是如是。愚痴异生。寡闻无智。于可意触。而生爱乐。心生染着。造如是业。身业三种。语业四种。意业三种。造作彼业。刹那迁谢。是业灭已。不依东方。南西北方。四维上下。中间而住。至命终时。见先所作。心想中现。如彼睡觉。忆梦中事。最后识灭。自业现前。</strong></p><p>释：佛说：大王，确实是这样，愚痴的异生凡夫们，寡闻没有智慧，对于自己所喜乐的触境心生爱乐，心里贪染欲触，就造作了愚痴业，身三语四意三，恶业就出现了。造作了这些恶业以后，业行刹那刹那迁灭了，业行灭了以后，也不依着东南西北、四维上下以及中间而住。但是到命终的时候，就看见自己曾经所做过的事在心中呈现了出来，就像这个人从睡眠中清醒过来，却在回忆着梦中的事情，最后六识灭了，业报就现前。</p><p>愚痴就是无明，什么都不懂，五阴是什么不懂，五阴虚妄也不懂，万法虚妄也不懂，这个假我是组合而来的也不懂，如何破除它也不懂，如何脱离六道轮回也不懂，如何证菩萨的果位也不懂，如何能证到自己的本来面目自性清净心也不懂，乃至于如何成佛全都不懂，这就是愚痴和无明的众生。</p><p>在当下活着的生命体，此段寿命结束时，下一段时间会在另一个地方，又出生在与习气业力相应的那一道。时间地点和色身都改变了称为异，众生死后往往是身体、时间、身份、地点、生活的空间全都改变了。饿鬼有饿鬼的空间，阿修罗有阿修罗的空间，地狱有地狱的空间，天人有天人的空间，畜生是和人类在一起，也在这地球表面上，但是生存环境还是有所不同。生存环境改变了，换了另一种生命形式，成为另一种生命体，这叫异生。</p><p>众生寡闻无智是因为不听经闻法，见闻少，不懂佛法真义，不懂世间真理，所以没有智慧。如果想要有智慧，就要多多听经闻法，深入经藏，才能产生如海洋一样深广的智慧。多学佛法，多信受佛语，证得一个道理，破除一个无明，少一种愚痴，身口意清净，没有烦恼，内心就会快乐。</p><p>寡闻无智的凡夫对于可意的触而生爱乐，可意的触就是让意识心悦乐的身体的触受，叫妙触。比如身体触柔软的衣服，温暖的阳光，舒适的床，其中最主要是男女之间的触，欲界主要是以这个触所建立起来的世界。身根身识接触到的就叫触尘，比如说温暖舒适的阳光触到身上了，冷风热风触到身上了，软的硬的衣服触到身上了，身识有感觉就叫触，所触的法叫触尘；还有饿了渴了，胃的感觉也是触，这都是触尘；再比如说坐的时候长了，感觉疲乏了，疲乏也是触尘，打坐时身体觉得轻安了，身体感觉太舒服了，这些都是触尘。</p><p>凡夫众生最贪着愉悦的触受，以男女触为主。男女互相接触时，心里就产生了爱乐心、贪爱心，于是心就被染了，这是以意识心为主的贪爱，也包括眼识、身识，但主要是以第六意识的感受为主。意识心生起染着以后就造业，心生爱乐的下一步肯定是要造业，业行就会出现。没有修行的人就会出现身口意的愚痴业行，有些修行人有时候内心虽有染着，但不造作身、口业行，最有修行的人连心都不染着。造作的业行，身业能造三种：杀盗淫；口业有妄语、绮语、两舌、恶口四种；意业是三种：贪嗔痴。</p><p>身三、语四、意三合为十业，身口意相顺相随。十恶业造作了之后，这些业行刹那刹那地灭去，业行种子输送出来起作用就灭了，这一刹那的业行就没有了，最后整个行为造作消失了，可是业种却记录下来留下来了。是谁记录的？是给与众生无量恩德的阿赖耶识记录的，因为祂输出种子，再收回种子，种子造作的业行也就同时存到阿赖耶识里了。</p><p>阿赖耶识是公正无私的，祂不会说五蕴是我造的，属于我的，我一定要隐匿其恶行，五蕴做什么恶业都不记录业种，也不输出业种，不让五阴有恶果，阿赖耶识没有这个心行，祂像摄影机一样诚实无欺，五蕴造作的一切业行都像机械化一样自动地摄录下来，不作任何选择，把一切行为造作事无巨细地都如实记录下来。记录下来以后，做为种子存在心体里，因缘条件具足了以后，输出业种，种子就会生根发芽，就会有结果，果报就出现了。</p><p>阿赖耶识如实实现众生业果的事，有极多的实例可以说明。比如如果甲前世跟乙有恶缘，乙今世投生到甲家，算是因缘成熟种子生芽了，孩子长大了算是开花了，时节一到时，乙就会坑害报复甲，甲的果报就出现了。前面过程都是芽、花、枝叶，果报到来的时候，甲有可能明白这个孩子是干什么来的，原来是讨债来了，报复来了。极大多数人受报之后也不懂这个道理，在此之前都没有觉察，根本不知道有这样特殊的缘分，因为前世的恶缘让两个人相聚一处，了结业种，两人都不知道。</p><p>从前有一个男子故意把老鼠打死了，恰巧这个老鼠是一只母老鼠。母老鼠死后不甘心，发了一个恶愿要报复，后世就托生成一个女子，女子长大后和这个男子相遇了，两个人一见钟情，恋爱结婚了。两人换了身世，因为有隔阴之迷，谁也不认识对方，不知道前世的事，是业缘让两个人聚在一起。结婚后这个女子就折磨了男子一辈子，但没要他的命，男子一辈子被折磨得很痛苦，业种没有灭，业报没有受完的时候，两人就不能分开。</p><p>为什么会这样？他俩的业种都存在各自的阿赖耶识里，因缘具足时，业种各自都现行出来，生根、发芽、开花、结果，男子就被女子折磨了一辈子，两个人相遇时谁也没想到是这样的结果。这些事谁说了算？是业缘说了算，存在阿赖耶识里的种子说了算，阿赖耶识也说了不算，祂不管这个，祂只是把业种如实的现行出来而已。</p><p>众生之间如果前世缘份很深的话，此生相遇，阿赖耶识把种子现行出来时，互相之间就有特殊的感觉。即使不见面，仅仅听见声音、见到文字和相片就可以感受到前世之间的某种缘份，或者是善缘，或者是恶缘，不用见面，不用说话，就会有种异样的感觉。有的仅仅听到名字，都会感觉特别。</p><p>前世与佛结下很深厚的缘分的人，今世一听到佛的名字，内心的情绪就波动起来，身上的汗毛直竖，表明前世学佛很久，与佛的缘份很深。佛缘深厚的人一听到佛的名字就感应强烈，自发地学佛念佛拜佛赞叹佛，前世学佛时间短的人，就没有什么反应，很平淡。比如佛世时印度祇园精舍的给孤独长者就是这样，他一听到佛的名字，走在路上身上一直都起着鸡皮疙瘩，汗毛直立，他是善根非常深厚的佛弟子，刚刚听见佛的名字，就想设宴供养世尊，并且把自己的祇园捐给佛作为佛的精舍。</p><p>有的人刚开始接触佛法，前世学佛的种子就完全显现出来了，很快就一头扎进佛法里，世间事就不在意了，这就是种子的力量。是阿赖耶识把成熟的业种呈现出来的。这里面的奥秘太多了，学法能知道很多真相，不学佛法，愚痴得只知道造恶业，吃亏受报了也不知道是怎么回事，后世的苦业也没办法了尽。</p><p>恶业造完灭，业种留下了，最可怕的就是业种，我们可以尝试祈求自己的阿赖耶识不要记录自己的恶业行，不要存恶业种子，看看是否有用？根本没有用，因为阿赖耶识不懂众生的语言，不知道心念的内容，没有六七识的那种了别的功能作用，因此阿赖耶识才是清净无染、铁面无私的，所以求祂无用，只有回过头来求自己的心，别让自己的心充满贪嗔痴，不再因贪嗔痴而造作染污业。</p><p>众生造业的业行灭了以后到哪里去了？不依东方南西北方、四维上下和中间而住。找不到业消失和存在的地方，如果有地方存放业行，那就糟糕了，什么地方存了这些业，早晚有一天会爆发出来，业跟到谁身上谁倒霉，业是没有地方存放的，来无踪去无影。业行虽然没有地方存放，但是寿命终了的时候，这一辈子所造的业，全部都在心里快速地闪过，意识心都能感觉得到，都能分别得清楚，心里全都了知，一样也不错过。那个时候就知道自己要到哪里去了，因此心里非常希望亲属能够帮助自己从业障中解脱出来，但是那时已经说不出话，表达不出来了。等到了中阴身再想告诉亲人，可是阴阳两隔，无法沟通，两个世界的众生，语言不通。</p><p>识灭了以后，这一世就结束了，人生的这一场梦就划上了句号，现在想想，现实生活也真好像是在梦里一样。六识灭了以后，就随着业流转，由于意根想要有五阴身，于是阿赖耶识就配合现起中阴身，极善极恶的人没有中阴身，极恶人下地狱，没有中阴身，这边一咽气，地狱身就现起；极善的人死后，天人的色身就现起了，直接生天享福。</p><p>当地狱身一出来，即使后悔造了恶业，想忏悔补救却没有机会了，在中阴身里还能忏悔，亲属们也许还能补救一下，没有中阴身就没办法，业种就定下来了。除非有的人很有觉悟，在地狱里以地狱身而忏悔，力量够大，心力很强的话，也能从地狱里出来。如果福报大一些，死亡后，地藏王菩萨也许就在地狱门口等着他，教导他忏悔或者佛法中的偈颂，能随着一起念诵，就能消除地狱业，从而从地狱里出来了。受了菩萨戒，如果下了地狱以后，知道自己犯了哪条戒律，心中一忏悔，也能消业出地狱。所以我们平时修行，要多积福，多修智慧，受恶报时，获得解脱的机会就会有很多，就怕缺少福德，不会用法，不懂得忏悔自己的业行。多听经闻法，就能多一些解脱的智慧。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。作业受报。皆不失坏。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。同分种类。相续不绝。</strong></p><p>释：佛说：大王，阿赖耶识是造业的主人，造作的业行作为业缘，阿赖耶识缘业行，就是后世色身出生的因缘。当色身最初的识心出生时，前世造业，今世就开始受报了，造业和受报，二者都不散坏。这个人必然趣向地狱、鬼道、畜生道、阿修罗道、以及人道和天道，与业行相应的五阴身就相续不断地运行下去。</p><p>阿赖耶识和业缘结合起来，下一世的初识就生起来了，识一产生出来，就有苦受，业报现前，有感受才正式地受报。那么受报是报在身体上还是报在心上呢？主要是心受报，因为心有感受，才叫受报，如果色身上没有识心，再怎么加种种苦受，色身也不觉得苦，没有苦受。所以受报主要是报心，有心才能感觉苦乐，没有心感觉不到苦乐。</p><p>就如一张木头做的桌子，它是没有业报的，无论对桌子如何作业，桌子也没有任何感受，它就不受报。因为有心才有感受，所以果报是心来受的，心造业，心受报，谁造谁受。身体能造业吗？身体如果能造业，桌子也能造业，泥捏成的人也能造业，但泥人身上没有心，它不能造业，也不能受报，死人不造业也不受报。但是造业的这个心是生灭变化的，无常的，能消灭的，因此不是真实的。识心要依靠外缘，阿赖耶识输送种子，识心才有作用；阿赖耶识不输送种子，就没有识心，那就什么也做不了。这段话如果会听的人，因缘福报具足，那就不仅仅是证小乘果，完全能证大乘果。</p><p>识心生出来以后，造业受报都不失坏，不会无缘无故消失，造完业肯定会有果报现前，不是造完业就没事了。如果是受地狱色身，色身就在地狱里相续不绝，地狱的寿命有多长，识心就起了多长时间的作用，感受多长时间的苦受。眼识在同一色身上起作用，耳识在同一色身起作用，意识在同一色身上起作用，换了色身，这几个识就换了，前世的事情就不知道，想不起来了，这就是失忆。因为心换了，对前世的事就没有认知性。</p><p>原文：<strong>大王。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：佛说：大王，到生命最后，识心都灭了，五蕴就叫作死蕴，在最初识心出生的时候，五蕴叫作生蕴。</p><p>众生这一生结束，最后到命终咽气时，眼耳鼻舌身意六个识灭了，识灭以后就是死蕴，身体像木头一样没有觉知，没有生命，那就不是生蕴了，成为一个类似于木雕泥塑的尸体，就是死蕴。在下一世的色身上又产生了眼耳鼻舌身意六个识，完整的生命体就出现了，就有五蕴的各种功能活动。如果在母胎里六识不现起时，也不是完整的人，四个月以后六七个月时，眼耳鼻舌身意六个识都具备了，那个时候才是完整的人，识心没有产生出来之前不是活人，因为没有识心不是完整的人，但也不是死人，因为有第七识和阿赖耶识存在。</p><p>所以堕胎属于半杀生，这要看是几个月堕胎，杀生的罪业程度是不同的。前六个月堕的胎，胎儿还不是一个完整的生命体，但是仍然有罪，只是罪的大小是不同的，六个月以上的堕胎属于完全杀人，因为胎儿已经是完整的生命体了。在没有识心出生的时候，堕胎还不算杀人，但肯定也有罪业。</p><p>譬如吃鸡蛋，这个鸡蛋也不属于完整的生命体，但是鸡蛋里包含着受精卵，将来会变成鸡，也有果报，吃鸡蛋与吃鸡，是两种不同的果报，是罪大罪小的问题。鸡蛋里虽然有受精卵，但还不是完全的生命体，它没有五蕴的活动，等到它孵出小鸡的时候，那个时候才算一个完整的生命，或者即将出壳之前，就已经是完整的生命体了，那也算杀生。</p><p>所以没办法非要堕胎时，尽量早做，越早胎儿越没有痛苦，因为没有识心活动，他不知道痛苦，只是死了以后识心回到中阴身，他知道自己白白投生了，心里肯定有恨意。胎儿的意识心还没有生出来的时候，被堕胎时就不会有痛苦。回到中阴身境界，识心再生出来时，才有痛苦有恨意。杀业有很多程度的不同，依五蕴具足与否，就可以判断自己的业，到底是什么程度的罪业。</p><p>罪业的大小也在于心行，在于嗔的程度，和是否有嗔心，是否有杀心。比如说一个麻袋里有一个完整的活人，一个人无意中杀了他，不知道麻袋里面是个人，还以为是一个没有生命的物体，结果不小心把人杀死了，这不算故意杀人，因为是无心，死后不会下地狱受恶报。虽然如此，将来再遇见那人时，也会被那人无意的杀一回。杀人的时候，要看是有心还是无心的杀，有心杀是恶心，心性恶，就是杀罪，属于杀人的业，无心杀就没有心性上的恶，也就没有罪，但还是有因果。</p><p>从另一方面说，如果这个麻袋里是块木头或者是什么物体，而不是人，如果是出于嗔恨，当成另外一个人去杀了，本来木头不是生命，杀之就等于砍劈材一样，但是由于内心怀着恨意和杀意，当成人来杀了，就属于杀人罪，这个业就大了，罪大罪小在于用心。如果用极大的恶心踩死一只蚂蚁，这个罪也很大，因为嗔心太重了，和普通的杀不一样，普通的杀有时候是无心的，有时候稍微带一点嗔心，那果报全都不一样。所以在法律上的量刑也分为有意杀和无意杀的两种情况，判决结果都不同。</p><p>总结起来说，修行是修七识妄心，妄心修好了，心变清净了，阿赖耶识里没有恶业种子的时候就成佛，就完全恢复自己的本来面目了。众生现在阿赖耶识里含着的业种还有染污，有无明，七识心有贪嗔痴烦恼，而佛的七识心都是清净的，都已经转识成智，彻底无我了。</p><p>原文：<strong>大王。彼识起时。无所从来。灭无所至。其缘生时。无所从来。灭无所至。彼业生时。无所从来。灭无所至。大王。无有少法。从于此世。得至他世。何以故。自性空故。</strong></p><p>释：佛说：大王，最初的识心生起时，没有来处，灭时也没有去处。出生识心的缘出生时，没有来处，灭去时也没有去处。造作的业行出生时，没有来处，业行灭时，也没有灭处。大王，没有一个法能从此世过度到下一世，为什么如此？因为一切法的自性都是空的。</p><p>当众生在母胎里，几个识心出生的时候，是从哪里来到身上的？有来处吗？没有来处，也找不到来处；当众生的识心灭的时候，灭到哪里去了？也没有地方可去，找不到灭的去处。</p><p>识心的缘产生出来以后，识心就出来了，这个缘也是无所从来，灭无所去。识心的出生需要有一些助缘，没有助缘识心不能出生。比如产生眼识要有九缘：明、空、根、境、作意、分别依、染净依、根本依、种子; 所以眼识不是无缘无故产生出来的，这九个条件都具足了，才会产生眼识，不具足就产生不了。所以在母胎里，胎儿就没有眼识，因为母胎里没有光明和空间，在母胎里最先出生的识是意识，因为意识出生所需的缘比较少，意识出生就比较容易。</p><p>如果没有空间，手紧贴在眼前，眼识就看不见手，如果没有太阳光、没有灯光，眼识就看不见物体，条件不具足，眼识就不在当前的色尘上出生。所以需要因缘条件具足才能产生眼识，眼识依缘而生就是虚妄的、不自主的，眼识自己不能决定自己的存在，因为没有自主性。</p><p>其他几个识也是如此，比如耳识的出生需要八个因缘条件具足，除了光明之外，其他几个缘与眼识出生的缘一样都要具足，才能出生耳识。鼻识、舌识和身识的出生，需要具足七个缘，除了光明和空间，其他的缘都要具足，才能出生。意识的出生需要具足：作意、意根、法尘、阿赖耶识、意识种子五个条件，比五识需要的缘要少，所以容易起现行。而意根出生所需要的缘只有作意和第七识的识种子，缘更少，所以意根一直在现行着，非常不容易灭去，需要意根不再对三界的法生起作意了，断除了对三界的贪爱，意根才会灭去。因此说，各种因缘条件聚集起来才能产生的法，就是生灭的法、虚妄的法、非我的法。</p><p>再比如由几个人组成了一个团体，这个团体也是虚妄的，几个人各自都离开，就没有团体了。这个团体说有就有，说散就散，是不由自主的，因缘具足时聚合起来的，就是虚妄的，说有就有，说无就无，没有真实性。这个团体就是一个假名词，是一个概念，只是用一种名词来表达这种状态而已。这个团体是虚妄的一个假名词，只是给这个团体聚集的状态，取名叫一个团体，不是真实的。是甲叫作团体，还是乙叫作团体？单个都不能叫作团体，聚集起来也不能叫作团体，只是给聚合而有的一个假象取个名词，以便于语言交流罢了。万法都是如此，强取个名词表达而已。</p><p>同理，五阴也是一样，五阴是由各种因缘条件聚合起来的，是假有的一种状态，这种状态能出生，能消失，能分散，由此就不是实有的，不是不灭的。五阴的各个功能和作用，能看、能听、能尝、能触的功能分散以后，五阴也就不存在了，所以众生五阴也是不真实的。分析五阴的组成与分析一个团体的组成是一个道理，其实给五阴取什么名字都行，给这种五阴形态取名叫人，给另一种五阴形态取名叫蚂蚁、蚊子，以利于分别，实质上都是五阴聚合体。五个阴的功能作用分散消失了，众生就不存在了，所谓的众生都是幻化假合的五阴身。</p><p>佛说无有少法，从于此世来到他世，应该信佛语，知道此世什么也带不走，唯有业随身。既然如此，我们就要好好想想，这一辈子究竟应该怎么做，才能多带善业，少带或不带恶业。既然此生能有幸遇见佛法学佛修行了，那就要珍惜学佛的机缘，多做福业，多修善法，一心用在佛法上，世间法过得去就好，把更多的善业种子带到未来世，用来修学佛法，将来尽早尽快值遇佛法，成就佛道。</p><p>但是无论是善业还是恶业，其本性都是空的，是不能作主宰的，是生生灭灭的，生无来处，灭也没有去处，幻化不实。比如拿刀杀人，在杀人之前，这个杀业是不存在的，也没有来处；杀人这件事也没有造作的人，表面的现象就像魔幻师幻化出来的，没有造业者。杀人的行为是色身与识心和合运作出来的，而色身是虚妄的，识心是虚妄的，都不是实有的，五阴的行为就不是真实的。而且杀人的行为出来以后，刹那就消失得无影无踪。因此行为造作的本身就是空的，但却留下了业种。</p><p>而业种本身也是空的，来无所来，灭无所去，从一无所有到一无所有，受报以后，业种也会消灭得无影无踪。业种也是空的、虚妄的，如果业种不虚妄，受报以后，或者忏悔以后业种应该不能消失，如果业种不能消失，那么众生应该永远受报，无穷无尽，杀人的人应该永远在地狱受报，应该永远被人宰杀，没有尽期。</p><p>因此可以说，一切的罪福业都是虚妄的，来无所来，去无所去。虽然如此，一切的福业，终将使得众生渐渐趋向成佛，以至于最终成就了佛果，一切的罪业，终将使得众生苦受不尽，哀叹不止。思来想去，只有阿赖耶识是真实不变的，是不生灭的，是永远存在的，其余一切法都是空的、幻化的，刹那刹那生，刹那刹那灭，生灭得比闪电还要快无数倍。</p><p>原文：<strong>如是了知。初识初识空。自业自业空。身识身识空。若灭灭空。若生生空。轮回轮回空。涅槃涅槃。皆自性空。无有作者。亦无受者。但随世俗。之所显示。非第一义。作是说也。</strong></p><p>释：应该像这样来了知最初的识和初识的空，了知自己造作的业行和业行的空，了知身识和身识的空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭也空；同时也要了知轮回和轮回的空，了知涅槃和涅槃的空。业行的造作和流转，没有作者也没有受者，一切法都只是随着世俗的分别而显示罢了，在第一义谛上，就不会作这样的说法了。</p><p>在下一世的色身上生起的初识也是空的，造作的业行也是空的。身识也是空的。如果把这个法也灭了，这个灭法本身也是空的，哪有真实的灭法，有这个法灭的原则吗？没有，都是空的。下一世的识的出生，出生的生法也是空的，哪有固定不变的生的法则与原则？没有，是空的，一切法就是这样生出来了。众生在六道里轮回，做人做天人做畜生做恶鬼，其轮回也是空的，轮回如果不空，就应该永远轮回，不能得解脱，不能成佛，修行就没有用处。</p><p>众生能断轮回，能出离轮回，就说明轮回就是空的，不是真实有个不灭的轮回法。自己都不是真实的，还有真实的轮回法吗？没有，全都是空的，全都是虚幻的。如果获得了涅槃，灭了三界世间法，五阴灭了、十八界灭了、身灭了、心灭了、感受灭了、想法灭了、身口意行为造作灭了，全都灭了，只剩下一个阿赖耶识，不生也不灭，清净寂灭，这种状态就叫涅槃。五阴十八界都灭了这种状态，本身也是空的，也是生灭变异的，非是永远不改变的。涅槃境界也是来无所来，去无所去，没有入涅槃者，也没有出涅槃人，无作无受者。</p><p>所以涅槃不是真实的有，涅槃是一种寂静状态的显现，就像世间的喧闹现象一样不实，是幻化的。这种状态也是空的，只有阿赖耶识不空，其余都是空的。涅槃没有相，就连空的境界也空，不离阿赖耶识而有这种空。</p><p>一切法都没有一个作者，也没有一个受者。证了四果阿罗汉入了涅槃，没有一个证四果的人，也没有入涅槃的阿罗汉，没有一个享受寂灭乐的阿罗汉，谁受涅槃的寂灭乐？能找到这个人吗？涅槃里没有人，没有阿罗汉，如果有，就不是涅槃。阿罗汉的色身灭了，识心灭了，五阴作用灭了，十八界的现象灭了，因此涅槃里，没有阿罗汉，没有受寂灭乐的人。</p><p>原文：<strong>大王当知。诸根如幻。境界如梦。一切诸法。皆悉空寂。此名空解脱门。空无空相。名无相解脱门。若无相者。则无希求。名无愿解脱门。若能了此。三解脱门。与空共行。菩提先道。广大如法性。究竟如虚空。于此譬喻。当如是知。</strong></p><p>释：大王你应当知道，六根就像是幻化的一样，各种境界就像梦境一样。一切法全部都是空的、寂静的，这就是空解脱门；诸法空也没有空相，叫作无相解脱门；如果一切法连相也没有，就应该不生起任何愿求，这叫作无愿解脱门。如是空、无相、无愿三解脱门与空共同存在，走向涅槃之路，就应当这样修学。要想求涅槃，首先就要知道，一切法都是实相法界，都是阿赖耶识一真法界，遍布于十方虚空际。对于这些譬喻，应该这样了知。</p></div>"
},{
    "title": "第二章 第十四个梦喻",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第</strong><strong>二章  第十四个梦喻</strong></p><p>原文：<strong>复次大王。譬如有人。于睡梦中。自见其身。饮酒惛醉。不识善法。及诸恶行。功德过失。都不觉知。是人觉已。念梦中事。为实尔不。王言不也。佛言大王。于意云何。是人所梦。执为真实。是智者不。王言。不也世尊。何以故。梦中毕竟。无饮酒者。况惛醉耶。当知是人。徒自疲劳。都无有实。</strong></p><p>释：佛说：大王，再说一个梦。譬如有一个人在睡梦中，看见自己喝完酒以后酩酊大醉，既不辨别善法也不辨别恶法，做事有什么功德和过失都不知道。这个人醒过来以后，心里就不断地忆念着梦中的事情，梦中的事情是真实的吗？净饭王说：不是真实的。</p><p>佛说：大王，你怎么认为？这个人把自己所做的梦执为实有的真实的，这个人是有智慧的人吗？净饭王说：这个人没有智慧，世尊。为什么这样说呢？因为梦中毕竟没有饮酒者，况且还有喝醉这件事，应当知道这个人不断的忆念只是无辜地疲劳自心，都没有实际的事。</p><p>原文：<strong>佛言大王。如是如是。愚痴寡闻。凡夫异生。意着诸法。起爱染心。造是痴业。身业三种。语业四种。意业三种。造作彼业。剎那迁谢。是业灭已。不依东方。南西北方。四维上下。中间而住。至命终时。见先所作。自分业报。心想中现。如人梦觉。念梦中事。</strong></p><p>释：佛说：大王，确实是这样。愚痴又孤陋寡闻的异生异灭的凡夫众生，心意着于一切法，常起贪爱染污心，造作类似这种愚痴的业行，身业上能造作三种，语业上能造作四种，意业上会造作三种。造作种种业行时，这些业行都是刹那刹那消失灭去了，业行灭去以后，并不依着东南西北四维上下，以及中间而住着。等到临命终时，就会看见自己先前造作的业行所引发的果报，在心中显现出来了，就像人从梦境中醒悟过来以后，还要念着梦中的事。</p><p>原文：<strong>大王。识为其主。业为攀缘。二种相因。初识生起。作业受报。皆不失坏。或趣地狱。或堕傍生。琰摩罗界。及阿修罗。若人若天。各受其报。同类心品。相续随转。最后识灭。名为死蕴。最初识起。名为生蕴。</strong></p><p>释：佛说：大王，识心是造业和受报的主人，业缘是识心所攀缘出来的，以这二者为因，下一世最初的识心就出现了，那么前世造业的果报都不会无缘无故消失，都要受其业报。业报现前时，这些人或者是趣入地狱，或者是堕入畜生中，或者是生到鬼神道中，或者是托生为阿修罗、人和天人中，各受其报。这样与业行相应的识心就出现了，在新的五阴身中相续不断地流转运行起来。生命到最后识心灭去，就叫作死蕴，生命中最初的识心生起，叫作生蕴。</p><p>原文：<strong>大王。身识生时。无所从来。灭无所至。彼缘生时。无所从来。灭无所至。彼业生时。无所从来。灭无所至。大王。无有少法。从于此世。得至他世。何以故。自性空故。</strong></p><p>释：佛说：大王，身识出生的时候没有来处，来无所来，灭时没有灭处，灭无所灭。业缘出生时，也是来无所来，去无所去，业行出生时同样是来无所来去无所去。大王，没有一点法能从此世去到他世，为什么呢？一切法的自体性是空的缘故。</p><p>原文：<strong>如是了知。初识初识空。自业自业空。身识身识空。若灭灭空。若生生空。轮回轮回空。涅槃涅槃。皆自性空。无有作者。亦无受者。若业若报。皆不可得。但唯名相。分别显示。</strong></p><p>释：应该像这样来了知身识，了知身识的自性空；像这样来了知自身识心所造作的业行，了知业行自性为空；像这样来了知初识，了知初识自性为空；像这样来了知，一切法如果出生，其生为空，一切法若灭，其灭为空；同时也要了知业行的造作和流转，没有作者也没有受者，一切法都只是假相和名字上的分别显示罢了。</p><p>原文：<strong>大王。诸根如幻。境界如梦。一切诸法。自性空寂。此名空解脱门。空无空相。名无相解脱门。若无相者。则无希求。名无愿解脱门。若能了知。三解脱门。与空共行。菩提先道。广大如法界。究竟如虚空。于此譬喻。当如是知。</strong></p><p>   释：佛说：大王，六根都是幻化出来的，所有的境界就如做梦一样，一切诸法的自性全部是空寂的，这就是空的解脱门；空解脱门也没有空的相貌，叫作无相解脱门；如果一切法都没有相，那就不再有什么愿求，这叫作无愿解脱门。如果能够究竟了知这三种解脱门，都是与空共行，都是空的，那么涅槃的菩提大道就广大得如如来藏法界一样，其究竟性如虚空一样。对于这样的譬喻，就应当这样来认知。</p></div>"
},{
    "title": "第十九卷 净饭王信解品 第二十七",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第十九卷 净饭王信解品第二十七 </strong></p><p>通过前面对种种梦境的熏习，我们知道了万法皆如梦幻一般，皆为虚妄，没有一法真实，除自性外，如果真能认可万法皆空的道理就能渐渐得解脱。解脱之理在小乘阿含经里讲的比较多，心不粘万法，不被万法束缚，即是解脱。众生现在是不是都被万法束缚着？观察自己是否被色阴、受阴、想阴、行阴、识阴此五阴所束缚，被眼耳鼻舌身意六根所束缚，被色声香味触法六尘所束缚，肯定都被束缚着，那就要想办法去解开束缚，求取解脱。</p><p>万法都包含在十八界中，生活中林林总总，色声香味触法全部包含在万法中，任何一件事理都离不开五阴十八界，众生的心确实都被万法束缚着，那么具体哪个心被万法束缚着呢？前七识心都被束缚着，第七识意根普遍执著一切法，执著五阴，执著十八界一切法，被十八界束缚着，同时还不断的熏染六识，使得六识也同样贪着六尘境界，这样于六尘就不得解脱，不得出离六道生死苦海，以至于流浪于生死中忧悲苦恼。</p><p>众生被万法系缚的原因是什么？并不是万法非要系缚于众生，而是众生非要执取和贪爱，因此心就不得与万法分离。比如心里贪爱金钱，结果一生被金钱财物所捆系，无法逃离其中，生生世世就在六尘境界里流转。那么要如何解脱？正确认识万法的生灭变异无我性，不求、不贪、不追、不执着，心不执取，即得解脱。</p><p>佛之前对净饭王所讲的法都是解脱法门，用各种各样的妄相梦境来警醒净饭王应该从五欲六尘中解脱出来。我们已知万法如梦如幻，人亦如在梦中，并非实有，知身是幻，但还没有真正证得。要想证得，就要修习禅定，深入观行，证得以后，慢慢即可得解脱。世尊讲法的目的是要让众生入解脱门，佛所讲的八万四千法门都是解脱法门，从一法门入进去，所有法门都能通达，法法都能解脱。佛下生世间就是为了度脱众生，解脱生死苦，为众生开示悟入佛之知见，究竟成佛。小解脱是断除人我执成阿罗汉，大解脱是断除法我执成就大自在的佛果，这才是最究竟的解脱。</p></div>"
},{
    "title": "第十九卷 净饭王信解品 第二十七之 第一章 世尊咐嘱修证解脱法门",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第一章  世尊咐嘱修证解脱法门</strong></p><p>原文：<strong>尔时世尊。告净饭王言。大王。如上所说。解脱法门。当自系心。正念观察。勇猛精进。决定修作。过去未来。现在诸佛。依此得证。无上菩提。能招世间。一切富乐。能消世间。一切渴爱。能伏世间。一切我慢。能破世间。一切邪见。能灭有情。一切罪恶。未登初地。凡夫异生。皆令证得。平等法性。如是法要。非诸声闻。及辟支佛。所行境界。唯诸菩萨。之所修作。</strong></p><p>释：佛对净饭王说：如上所说的解脱法门，你应当自己摄心用正念观察，并且要勇猛精进地决定修行。过去、未来以及现在的诸佛，都是依此解脱门而得无上菩提。依此解脱法门能获得世间法中的大自在和一切富贵快乐的果报，能灭除世间的一切渴求和贪爱，能降伏世间的一切我慢，能破除世间的一切邪见，能灭除众生的一切罪恶。依此解脱法门修行，能让那些还没有进入初地的凡夫异生，全部都能证得平等法性。像这样的修行法门，不是声闻和辟支佛所修行的境界，只有诸大菩萨们才能修行证得。</p><p>世尊劝导净饭王要把心置于解脱法门上，舍离万法，舍离五欲享乐，舍离五阴十八界的虚妄法，勇猛精进，用正念、正思惟来观察思量万法，这一切法确实如梦如幻，是虚妄的、无常的、苦的，如实思惟观察以后，就会自发主动的勇猛精进，决定修作，内心真正认可后，就能证得解脱了。</p><p>所以学佛是先听闻正法，再正思惟、如理思惟，按照正理去勇猛精进的修行。修行一定要勇猛精进才能成功，因为学佛和烧水的道理是一样的，要想烧开一锅水，必须要一直加火，让火持续燃烧，水才能烧开。如果烧了一半火熄灭了，水就又凉了，然后再烧又停火，那么这锅水什么时候能烧开？勇猛精进就是这个原理，一鼓作气很快就能把这锅水烧开。修行松松懈懈，就会进进退退，在这中间会浪费很多的时间和精力。勇猛精进决定修作，决定属于定力，心决定在解脱法中，不断修解脱法，结果必然得到解脱。</p><p>十方三世诸佛，依何得无上正等正觉，成就佛道？都是依靠诸法如梦观，证得空、无相、无愿三解脱门成就的。先听闻如梦观正法，然后正思惟，依照着思惟的正理去修行，要经过闻、思、修、证四个步骤。如果不听经闻法，就不会有正念来思惟，不能如理思惟观照诸法实相，就不会有正精进的修行，不能证得诸法实相，不能证得如梦观，也不能入初地，不能得后续的所有解脱。</p><p>如果要证得万法的虚妄性，证得自性清净心，证得无上正等正觉，一定要先从听经闻法开始，闻法以后要摄心按真实义理来思惟。要根据佛的圣言量，通过身心的验证来获得信心，信根坚固，知依此法必然得到解脱成就佛道，则决定会勇猛精进地修行，永不退转菩提大道，因此一定能证得菩提道果。首先证得小乘菩提果，证得五阴十八界虚妄，从而证得人无我；然后明阿赖耶识心，证得阿赖耶识不生不灭，明了万法皆由阿赖耶识所出生，自我为虚妄，诸法皆为虚妄，全部是阿赖耶识性，除此无他，因此万法皆空，就能至初地果位；依次再证得二地、三地、四地，最后得证佛地果位，入究竟圆满的大涅槃，修行就是这样的次序。</p><p>如果不听经闻法，不深入经藏，就不知道如何精进修行。深入经藏，用正念如理思惟，不是只深入经藏就可以了，用正念思惟很重要，能使信根、精进根不断增长，佛说依此能得证无上菩提。尤其是佛在此经中所讲的诸法如梦如幻的法门，定中深入观行，能证得如梦观，进而就能入初地。</p><p>得证无上菩提的果报非常殊胜，首先世俗法上的果报能得一切富足安乐，修学佛法证得道果的人不堕恶道，其次所生之处享受富贵荣华的果报。过去的禅师们证得大乘果以后，再次投生人间都可以做国王大臣，证得的果位越高，来世在天上、人间的地位越高权势越大，这叫世俗法的富乐。</p><p>学佛的人要懂得多修福、修慧，修出来福报以后就会得到世间法上的富贵。佛是福德与智慧两足尊，如果只有智慧，没有福德，也不能成佛，如果没有福德也不能感召世间所有人的礼敬、恭敬和供养。所以我们念诵经典的时候，既是修福也是修慧，打坐也是在修福，礼拜佛陀也是在修福。何况财布施和法布施，利乐众生，更是在修福。福慧两足尊，两方面都要具足圆满，才是无上士。</p><p>精进修学佛法，能得证无上的菩提，能消除世间一切的渴爱。渴爱就是饥渴、贪爱，就是对于三界世间法的极度渴望，渴望拥有而心生贪爱，贪恋不舍，就不能出三界，导致在三界中轮回受苦不断。</p><p>此无上菩提能消除世间一切的我慢，凡夫众生都有深重的我慢，何为我慢？首先众生认为有一个我存在，认取五阴是我：色身是我，感受是我，见闻觉知是我，想阴是我，身口意行是我，六识的识别性和了别性是我。凡夫以此为我，然后严重执我，依我见、我执心故，生我慢心，认为自己的五阴十八界优越于其他众生的五阴十八界，自己在世俗法的某些方面要殊胜于其他众生，因此内心高举自己，欺凌其他众生。</p><p>慢分为七种：慢、过慢、慢过慢、我慢、增上慢、卑劣慢和邪慢，都是因为所谓的我而有的慢，所以我慢是根本，以此而有其它的慢，那么其它的慢通过修行先要断除，我慢最后断除，小乘在四果阿罗汉位断除我慢，但还有我慢的习气；大乘在初地菩萨位断除我慢，但还有习气，这个我慢习气修到八地菩萨位才能断尽，可见习气的根深蒂固。</p><p>何为我慢习气？比如树上有一只令人厌恶的虫子掉到身体上，一般人都是下意识地马上抖开，不用想，不用思考，下意识地就能快速地作出反应，这是意根对自我的保护习惯，不假思索的规避危险和拒绝自己厌恶的东西，这就是我慢的习气。为什么众生都有这种习气呢？因为众生的意根无始劫以来，一直执著五阴身为我，这种习气根深蒂固，即使断了我见，除去了我慢，意根的内心深处还是有五阴我的概念和念头，习惯性地还有个五阴的影子没有清除掉，七、八地菩萨才能断除这种我慢的习气。阿罗汉能让我慢不起现行，到初地以上的菩萨才开始一点点地断除我慢的习气和贪嗔痴烦恼的习气。阿罗汉断烦恼也是断烦恼的现行，所有的习气都是到初地以上的菩萨位才开始渐渐断除。</p><p>众生心中的烦恼非常深重，数量也极多，很难断除。其实要说难也不难，只要勇猛精进地修行，烦恼也会如日出光照雪般消融，所以难易全在乎自心。如悟道的人形容禅宗开悟的难易，庞蕴曰：难难难，十担麻油树上摊（参禅开悟就像把十担芝麻摊放在树上一样难）！然后庞婆说：易易易，百草头上西来意！女儿灵照说：也不难，也不易，饥来吃饭倦来眠。三个人对开悟有三种感觉，三个看法。所以说一切法难易在人，在人的根基利钝；难易是相对法，是假相，不是真有个难易存在。</p><p>无上菩提能够破除世间的一切邪见，邪见从哪里来？也是从我见中来。凡夫未证得果位前，都认为有一个我在，色身是我，五阴是我，凡是以我为基点出发的各种各样的知见，都属于邪见。而修证佛法能破除一切的邪见，能灭除有情众生的一切罪恶。当证得了初果，就破除了关于我的邪见等三个结缚，无始劫以来所造的三恶道业就消除了，未来永不堕三恶道。剩余的业报只是报在人中，在人中受苦。在人中受苦再甚，也比在三恶道快乐，比在三恶道受苦轻微。</p><p>未证入初地的人叫作凡夫异生，证得初地的为圣人，灭除了异生性，不再造作生死恶业。未断生死染污业种的众生都属于异生，这一段寿命结束后又会有下一段生命，不过是在另一个时间，另一个地点出生，或者是天上，或者是人间、地狱、恶鬼，这叫作异时异地而生。</p><p>初地菩萨和凡夫异生都有分段生死，比如人活一世百八十年，或者是千八百年，寿命结束后，就有下一世，生死是分成一个阶段一个阶段的，就叫分段生死。初地菩萨如果投生天界，寿命极长；如果投生人间，寿命和凡夫众生一样，也有分段生死；如果靠愿力投生到畜生道，寿命也如同畜生般短促，也有分段生死。除分段生死外还有变易生死，所谓变易生死就是寿命极长，但是如来藏心中还有生死的染污种子没有都灭除，仍然能感得生死业，不能永远灭除生死的假相，心中的生灭种子未至佛地前都不能断除，因此就有变易生死。</p><p>无上菩提能让凡夫异生同样像初地菩萨那样证得平等法性。什么叫平等法性，是你我他三个平等的意思吗？非也。众生在相上是不平等的，有男相女相、人相畜生相，有富贵相和贫穷相，有好人相和坏人相，但是有一样是平等的，就是真如心体是平等的。心如何平等？比如阿赖耶识心体平等地和前七识妄心配合，平等地变现万法，没有一丝差别，体性是平等的。虽相上千差万别，阿赖耶识心的体性却一定是平等的，具备同样的功能，同样的作用，同样的含有地水火风空识六大种子，含有前七识心的种子和变现万法的功能，众生的阿赖耶识都是一样的，这就是众生的平等性。</p><p>佛的第七识也具有平等性，观待众生一律平等，知道众生虽然其相不同不平等，但是其性是平等的，都是如来藏性。佛观众生皆有佛性，佛性是平等无差别的，佛不看外相。所以佛不分别好人恶人，不会只救度好人而不救度恶人，佛没有这种不平等心，只要缘熟，佛一律平等救度。凡夫的心是不平等的，只能观察到他人的外表，不能看到内在平等的佛性，无始劫以来习惯于执相，成为了习性，不知差别相处也有无差别性。而初地菩萨由于六七识已经初步转识成智，第七识就转变成了一分平等性智，在看待世俗一切法上，知其实质都是如来藏，因此其心也初具平等性。</p><p>懂得了真如佛性的道理后，就要向真如阿赖耶识学习，学习祂平等对待众生的心行，不管众生的第七识要做什么，祂都配合，无私地给予奉献，要什么奉献什么，要声音变声音，要色尘变色尘，不管其心是好是坏，随众生心布施一切，平等地随顺众生。不平等的心是虚妄心，平等的心是佛心。佛观众生都是佛，众生观佛就看佛的三十二相，如果佛不现三十二相，众生就把佛当成凡夫对待。因为众生没有开眼，只能看到外相，看不到实质。我们应该要精进修行佛法，早日证得平等法性，证得真如佛性，早具平等性智。</p><p>大乘法不是声闻和辟支佛的境界，而是大乘菩萨的法要，是菩萨修证的如来藏法。声闻和辟支佛只能修学二乘法，证得世俗界的五阴十八界虚妄，证得人无我，断除对五蕴十八界的贪执，得到解脱，不能证得阿赖耶识和佛性，不证平等法性，因此也不具备平等性智。</p><p>原文：<strong>大王。应作是念。我当云何。于人天中。得为眼目。于长夜中。得为照明。于爱河中。得为船筏。于险难处。得为导师。无依怙者。为作主宰。自得度已。复能度他。自解脱已。令他解脱。自得安隐。令他安隐。自证涅槃。复令他证。大王。不应观彼。现在世间。所受富乐。五欲自在。诸根如幻。境界如梦。谓于色境。声香味触。心生贪着。无满足时。</strong></p><p>释：佛说：大王，你心中应该常常怀有这样的心念：我应当如何在人天当中，作众生的眼目，在生死长夜中为诸众生作大照明，指引众生航向；我应当如何在三界生死爱河中作为众生的船筏，牵引众生渡过爱河；我应当如何在生死险难处作为众生的导师，导领众生走出危险之地；我应当如何为那些无有依止者作主宰，让众生心有所托；我应当如何先求自己得度，然后再来度化他人，自己先解脱，之后再去解脱他人，自己先得安稳，然后再来安稳他人，自己先证涅槃，然后再让他人也证得涅槃。大王，你不应该只看现在在世间里所受的富贵、快乐和财色名食睡的自在，其实六根都如幻化，所有境界都如梦一般，不要在色声香味触上心生贪着而不知足了。</p><p>这段话是世尊对净饭王语重心长的开导规劝，让净饭王发大菩提心，发大誓愿，得度生死，早证大涅槃。发愿作人天的眼目，自利利人，指引众生走向解脱。众生都没有开眼，在生死轮回当中迷惑颠倒。如果能得到指引，就再也不会迷惑颠倒，从此走出邪见迷途，走向光明。菩萨发这个愿，什么时候能作到这一点呢？有能力作人天眼目者，最少是初地菩萨，初地菩萨可以作人天师，人中的导师，天人中的导师，导引众生走向成佛之道。人天师就是众生的眼目，菩萨证得初地的无生法忍智慧入如来家，对于佛法已经初步地通达了，只有通达了佛法，才能够带领众生修行，才能够作众生的眼目。</p><p>菩萨发愿于长夜中得为照明。众生生死的黑暗长夜，谁去照明？菩萨应发心去照明，作一个火把，点亮众生心，照着众生走向解脱，走向成佛之道。菩萨发愿于爱河中得为船筏，凡夫众生都在生死爱河中沉沦，欲界众生贪爱自己家亲眷属、五欲六尘；色界众生贪着天界的美妙境界和天人色身；无色界众生虽然没有色身，却贪爱着舒适的禅定境界。这些都是贪爱，因为有这些贪爱，众生才无法出离三界，就在三界生死爱河中飘荡流转。菩萨就要发愿，不仅要自己脱离爱河，还要在爱河当中作一个船筏，渡众生出离爱河。</p><p>菩萨发愿于险难处得为导师。什么地方险难？三界无安，犹如火宅，三界没有一个地方是安全太平的，都像火宅一样。《法华经》里比喻，三界如宅，已燃大火，而宅中众生还在屋内玩耍，不知苦难即将来临，不知出离火宅。佛慈悲众生于苦难中不能出离，于火宅外又回三界火宅中救度众生。众生却还在三界里游戏，不知马上即将烈火丛生，断诸归路，而四周恶鬼，猛兽遍布，房子也即将倒塌，已经身临险境，而众生却茫然无知。</p><p>《法华经》里的比喻都在说众生愚痴，处生死险难之处而不知，从这里可以看到佛的大慈大悲，本来可以舍弃人的色身皮囊，却又穿着人类的甲壳投生人中回来救度众生，真是无缘大慈，同体大悲。我们应该像佛一样，将来也要不畏险难，誓救众生。能做导师的前提条件是什么？是已经度过了生死险难处，有能力作引导者，如果不知道哪里是险难的，哪里有危险，就不能导引众生脱离危险。所以我们必须先懂得如何出离三界，有能力出离三界，才能回头来导引众生，躲避险难，归往安乐处。</p><p>菩萨应该发愿为无依怙者为作主宰。众生其实都是无依无靠的，又苦又孤独，活在这个人世间，似乎都有家庭眷属可依，但是所有家亲眷属都靠不住，家亲眷属也都是孤苦无依的，都需要有个依止处。每个人都无所依赖，寿命终了，孤独上路。三恶道中，至亲眷属更不能陪伴，只能独自走上陌生、孤独、凄凉、痛苦的路。那么菩萨就要发愿，为这些无依无靠的众生做依靠和依止，带领众生，走向光明走向解脱。</p><p>菩萨应当发愿自得度已复能度他。自己得度以后，才能度别人，如果菩萨只有救度之心，而自己尚在轮回苦海中，那就无力救度众生。比如一个从来没去过远方有优美风景之地的人，就无法带领别人一起去欣赏风景，有可能半道就迷路了，自然到不了目的地。所以首先要曾经去过风景地，亲眼领略过美景，把中间的道路摸清楚后，才能带领他人同往，这就是自度才能度人的道理。</p><p>菩萨应当发愿自已解脱也令他解脱。自己解脱才能令他人得解脱，自己有能力脱离三界，不被三界所束缚，才能带领他人一起走向解脱正路，自己没有得解脱就不知道解脱的正路，无法带领众生走上解脱之路。</p><p>菩萨应当发愿自得安隐令他安隐。佛已经到达涅槃的彼岸，获得究竟的涅槃寂灭乐，身心都得到了安稳，为了救度众生、安稳众生又返回三界，身心仍然安稳自在，不被娑婆世界的五欲六尘境界所迷惑和束缚，这样才能引领众生也逐渐获得安稳。释迦牟尼佛到娑婆世界八相成道，投生为悉达多太子，五欲围绕，而太子的心早已脱离这些世间境界，不被任何境界所熏染，心得安稳，在任何境界上都不迷惑颠倒，并且能舍弃世间一切欲望和亲情，毅然出家修道，成道之后，就开始广度无量众生。</p><p>菩萨们也应该效仿诸佛所行，精进修行以获得身心安稳，然后再安稳无量众生。如果自心还没有获得安稳，不断贪爱和执著，在五欲六尘里就容易被迷惑，进而造作恶业，受苦不断，这样自身尚且不得安稳，如何能安稳众生。菩萨应当自证涅槃复令他证。自己证得涅槃以后，再导引众生证得涅槃。涅槃是修证到的一种清净寂静的状态，不生不灭。涅槃分为四种。</p><p>一、如来藏的自性清净涅槃。如来藏本身就是涅槃性质，不生不灭，不增不减，清净无染，不着一法。菩萨明心开悟时就证得这种本来就有的涅槃性，证得自性清净心。</p><p>二、有余依涅槃。有余就是还有色身存在或者还有心存在，有身心存在就有苦受，阿罗汉在世时有色身五蕴存在世间，色身有觉受，因此就有一定的苦受，有余苦能依色身出现，风吹也觉得凉，太阳晒也觉得热，蚊子咬也觉得痒，这个有微苦要受的境界叫有余依涅槃。有余依涅槃是小乘三四果人所证得的涅槃境界，初地以后的菩萨同样也证得了。</p><p>三、无余依涅槃。阿罗汉在寿命终了时，灭除五阴，就入到了无余涅槃境界。在这种境界里，没有色身，没有心也没有五蕴，因此任何苦受都不能出现，无身受苦，无心受苦，没有身心可觉苦，也无感受，也无思想分别，也无阿罗汉了，就处于涅槃寂静状态中，只剩下不灭的自性清净心存在，处在一无所有的境界，这叫无余依涅槃。这种涅槃四果罗汉入灭后就证得了，解脱功德很深的三果人命终后也能证得，初地满心菩萨有能力证得而不证，为了留惑润生，自利利他。</p><p>四、无住处涅槃。这是佛所证得的涅槃境界，其他菩萨和声闻缘觉都没有能力证得。佛究竟成就一切种智以后，以其甚深的大智慧，心不住任何一个境界，不住任何一法，既不住空，也不住有，也不住无余涅槃，也不住三界；但佛以其无量大悲心，又不离三界，不离世俗法，不离五蕴身，不离三十二相身，以解脱之色身五蕴而教导众生证涅槃得解脱。佛可以根据因缘在一个世间八相成道，示现成佛，当在这个世界的因缘灭了，还会在其它有缘的佛国土，现起了另一个五蕴身，示现成佛度众生，这样就能利乐无数世界的众生都能证涅槃得解脱，这就是佛的不舍众生的无住处涅槃境界。</p><p>阿罗汉所证的涅槃，是灭了色身五蕴以后再也不现起色身，灰身泯智，既不继续修学佛法，也不利乐众生，慈悲心薄，自己不想成佛，也不能带领着众生共同成佛。因此阿罗汉的无余涅槃是不究竟的，最究竟的涅槃是佛所证得的无住处涅槃，永远不舍弃一切众生。菩萨们的心行和阿罗汉有所不同，虽然能入无余涅槃而不入，生生世世在三界中修证佛法，不断地自利，同时也利导众生。所以菩萨比阿罗汉伟大，比阿罗汉慈悲，比阿罗汉有大智慧，比阿罗汉神通广大。</p><p>佛苦口婆心地劝祂的父亲，不应观彼现在世间所受富乐和五欲自在，而于色声香味触，心生贪着无满足时，不要再贪着色声香味触法那些境界。心贪着五欲六尘时，是不容易满足的，世尊的父亲当了几十年国王，一直享受着世俗的五欲乐，却仍然不知其苦，不知出离。佛就劝导说，你不应该再贪着这个世间的富贵与快乐，因为诸根如幻境界如梦，六根都是幻化的，眼根不要贪着色，耳根不要贪着声，不要迷于五欲乐当中，过着纸醉金迷的生活，这些都是幻化的，六尘境界都如梦，并不真实，随时都会灭去。</p><p>佛为什么反反复复的劝导祂的父王？因为有权有势的富人很难度，他们长久地沉醉于五欲乐中，不容易自拔。而穷人过着贫苦的生活，深觉世间苦，遇见佛法就会自发地勇猛精进地学佛修行，除非福太薄者，为了生活所计，而奔波于世俗生活中，无法学佛修行。</p><p>我们居住的地球属于须弥山南边的南赡部洲，须弥山北边还有一个北俱芦洲，东边为东胜神洲，西边为西牛贺洲，这是一个小千世界的四大洲。北俱芦洲的人，人寿是一千岁，长相都很庄严，生活富足，不用劳作，所需要的一切生活资具都会自然而然地变现而来，金银财宝具足，七宝具足，生活非常享受，众生都追求五欲乐，不学佛法，不求解脱，所以在北俱芦洲没有佛法存在，也没有修行的人。只有南赡部洲人，苦乐参半，有苦有乐，不堪受苦的时候，就会寻求离苦之道。当遇佛法时，就会为了离苦断苦而修行，在纯乐的世界里佛法无法存在。众生如果生到北俱芦洲，或者生到天界，学佛就很难了，正所谓是富贵修道难。</p><p>如忉利天很快乐，天子们天天游乐嘻戏，除了玩乐便无他事。天帝释就苦口婆心地来劝告那些天子们赶快来学佛，有时候就敲响天鼓，强迫天子们来善法堂听经闻法，不让他们再耽于五欲乐。因为天界的福享尽时，又要下到三恶道去受苦了。在天上也是一样无法再学佛修行，所以富贵修道难，顺境学佛难。</p></div>"
},{
    "title": "第二章 无边称王的故事",
    "author": "生如法师",
    "date": "2021年11月13日",
    "html": "<div class=\"B1_text\"><p><strong>第二章  无边称王的故事</strong></p><p>原文：<strong>大王。乃往过去。无量俱胝。那由他劫。有转轮王。名无边称。富贵自在。有大威德。象马车乘。众宝辇舆。最胜轮宝。无能坏者。已曾亲近。无量诸佛。于彼佛所。种多善根。随意所念。皆得成就。</strong></p><p>释：佛说：大王，在过去无量无边劫数以前，有一个转轮圣王名字叫作无边称，他非常的富贵自在而且有很大的威德力，有象马车乘以及众宝装饰的辇舆，七宝具足，还有最殊胜的没有人能毁坏的轮宝。此无边称王过去已经亲近供养过无量诸佛，在如此多的诸佛所种下了极多的善根，因此善根福德所感召，他心中随意所念，都能成就，所有的想法都能实现。</p><p>世尊讲此故事，目的是为了教导净饭王不要再贪着富贵享乐，让净饭王警觉心不知足的人必有后患。故事里讲的是人心贪着世间没有满足会有什么果报，这个故事证明了人心确实是没有满足的时候，没有断除贪心的人都不容易对五欲六尘善知止足，即使在无量诸佛所种诸善根的无边称王也是如此。</p><p>印度语言俱胝那由他劫，就是很久远很久远的那么长时间，地球成住坏空一次是一大劫，等于是80乘1680万年的时间。在无量个大劫那么长的时间以前，有一个转轮王叫作无边称。转轮王分成四种：金轮王、银轮王、铜轮王、铁轮王，王位最低的铁轮王只能掌管一大洲，如专门掌管着地球南赡部洲，或者专门掌管着东胜神洲，只掌管一个洲；铜轮王统治两个洲，银轮王统治三个洲，金轮王统治四个洲。</p><p>须弥山脚下四周总共有四大洲。所有小世界中的须弥山周围都有这四大洲，娑婆世界总共有十亿个须弥山，那就是说，释伽佛的娑婆世界一个三千大千世界，有十亿个地球，十亿个南赡部洲，十亿个东胜神州，十亿个西牛贺洲和十亿个北俱芦洲，就会有十亿个金轮王，而铜轮王、铁轮王就不止十亿个了。这些转轮圣王所得的福报都是因为供养了无量千万亿诸佛而得来的，这是三界世间里的福报。</p><p>转轮王非常的富裕自在，有权势，有大威德，有象宝、马宝、车乘宝、金银珠宝、辇舆等七宝。转轮王脚下登着七宝辇舆，可以从地球的南赡部洲，瞬间飞到其它各洲，还能瞬间飞到忉利天天帝释那里，这是金轮王的福报所感，他想得到什么就能得到什么，当然这是在欲界的物质范围之内。</p><p>转轮王已经亲近了无量诸佛才修得这个福，如果没有修出福德，即使大学生博士生，在这个世间奋斗一辈子，仍然不会成功，虽然能力具足，但是没有福报，就得不到自己的所需所想，而修出福的人，即使不识字，也能大富大贵。过去很多诗人在诗句里抱怨自己怀才不遇是因为什么？因为只有才华没有用，还必须要有福报。众生今生所得到的一切福德是前世修来的，要想有大福德为自己所用，就要不断地修福，所有的福德都不会从天上掉下来，都是从利益他人的修福中而来，众生要想得最大的福德，就要在大乘佛法中多修福，多供养三宝。</p><p>金轮王已经供养了无量尊佛，种了那么多善根，才当了个金轮王，学佛人如果不勤修戒定慧，只念一句佛号，指望命终能往生极乐世界，在那里等着一生成佛，能成佛吗？很多人只供养了释迦佛，还没有供养好，到极乐世界只遇到了一尊阿弥陀佛，以及少量的诸佛，所获得的福德是远远不够成佛的。当个金轮王还要供养无量尊佛，更何况是成就佛道这样的更殊胜的果报。佛在经上说众生要成佛，都需要供养无量无边之多的诸佛，在每尊佛的身边都要听经闻法，世世供养诸佛，福德才能具足，成为福慧两足尊的世尊。</p><p>所以不可能说念个佛号到极乐世界就成佛了，成佛之理都不完全知不完全证，度众生的经验也不具足，没有无量的三昧，是不可能轻易成佛的。如果真有这样轻而易举的事，念佛号成佛了，如果弟子们要听法，可是自己却连小乘法都讲不出来，大乘法更不会讲，那要如何度众生？再说这些众生弟子从哪里来？自己又没有度过弟子，没有跟众生结过缘，怎么可能有弟子？没有度过众生，就没有弟子，没有弟子的协助，就不能建立佛国土，更不能成佛了。</p><p>比如当个国王，如果没有大臣，没有百姓，就无法作国王。只到过极乐世界，没有度过众生，福报不具足，不会讲经说法，智慧不具足，那要如何成佛？成佛时要有无量无边的弟子辅佐一起弘法，首先一左一右的两大弟子是等觉菩萨在佛身侧护持，还有初地到九地的众多菩萨，以及刚开悟的菩萨，凡夫菩萨，声闻缘觉等等，这些弟子都应该有无量无边之多，才能够建立一个佛国土。因此想成佛就要供养无量诸佛，常随无量诸佛学法，以使自己的福德早日圆满具足。</p><p>成佛之前要学很多的佛法，不是在一尊佛身边就能学得完的。南瞻部洲所存留下来的三藏十二部，是佛所讲的法中极少一部分，佛在娑婆讲出来的法就像手指甲里的泥土一样少，在娑婆没有讲过的法像大地上的土那样多。即使是这样，南瞻部洲的三藏十二部在众生看来已经浩如烟海，很多人只能读到十分之一，二十分之一，更何况还有极多的佛没有讲出来的法。佛法真的是浩瀚无边，所以我们需要供养无量诸佛，常随诸佛修学，常修福德，才能最终成就佛道。</p><p>原文：<strong>大王。彼无边称王。忽于一时。作是思惟。我当自试。福德之力。以我福故。令四天下。所有一切。树木花果。皆得茂盛。受用无尽。作是念已。彼四天下。所有花果。而得敷荣。</strong></p><p>释：佛说：大王，那个无边称转轮王，在某个时间，忽然想到一件事：我应该试试我的福德有多大，力量有多么强，用我的福力，让南赡部洲、东胜神州、西牛贺洲和北俱芦洲四天下所有一切花果树木，全都茂盛生长，而且生长以后受用不尽，永远采摘不完。无边称转轮王起了这个念头后，四天下所有树木花果果然都如愿繁盛起来，果实累累。</p><p>没有福德的话，让一棵树苗茁壮成长都做不到，何况四大洲四个天下的花果树木。转轮王能让四天下的花果树木都长得非常茂盛，长出的瓜果都非常富饶丰盛，四天下的众生都享用不尽。转轮王一个心念就能如此，他的心力该有多强，是心力的作用吗？其实是福德之力。</p><p>原文：<strong>大王。彼无边称王。如是思惟。我今更试。自善根力。令四天下。一切人民。若有所愿。随意无违。作是念已。彼四天下。所有人民。一切希求。皆得如意。</strong></p><p>释：大王，那个无边称转轮王又起念想，作这样的思惟：我现在想看看我的善根之力究竟有多大，让四天下的所有人民，如果他们有愿求，随意所需，想要什么就得到什么，不违逆他们的心意。无边称王生出这样的念想以后，四天下的所有人民，一切的希求全部如愿实现。</p><p>四天下能数得过来吗？数不过来，现在仅仅南瞻部洲人就有几十亿人口，其他三个大洲的人数就更多了。每一个人一个愿望，如果都能使得他们称心如意，这个心念力该有多大，这是算利乐众生了。无边称王作了这个念头后，四天下的人民，想得到什么就真的得到了。我们现在这个世界上，因为众生福薄，感召不到转轮圣王的出世，所以就没有转轮圣王了。</p><p>原文：<strong>大王。彼无边称王。复更思惟。以我所有。善根力故。令四天下。普雨妙花。作是念已。于四天下。降雨种种。上妙天花。</strong></p><p>释：佛说：大王，那个无边称王又起心念，作这样的思惟：以我所有的善根之力，让四天下都普降美妙的花雨。生出这样的心念以后，在四天下就降下了种种的非常美妙的天花，像下雨一样的多。</p><p>地球上的花不够美丽，与天上的天花比较起来显得比较粗糙，而天上的花非常的美妙殊胜，花香和色彩都要比人间的瑰丽。虽然如此，无边称王这样也是要消耗自己极多的福德，他把自己在无量诸佛所修的福德都要兑现出来，不留存款，一旦如来藏里没有存款，其福德就消失，所做一切皆不成就。所以我们学佛人不可随意消耗自己的福德，尽量少享福，留待成佛之用。</p><p>原文：<strong>大王。彼无边称王。复更思惟。以我所有。善根力故。令四天下。雨妙宝衣。作是念已。于四天下。悉雨宝衣。</strong></p><p>释：大王，那个无边称王又作如是念想：以我所有的善根之力，让四天下都降下美妙的宝衣，像下雨一样。生出这样的念头以后，果然在四天下就全部降下了宝衣雨。</p><p>原文：<strong>大王。彼无边称王。复更思惟。以我所有。善根力故。令四天下。悉皆雨银。作是念已。于四天下。皆得雨银。</strong></p><p>释：大王，那个无边称王又作如下的思惟：以我所有的善根之力，让四天下都降白银雨。他生出这样的念头以后，果然四天下就全部都降下了白银，像下雨一样。他的贪心不断地增长，这个下白银的念生起以后，天上真就下银子雨了。</p><p>原文：<strong>大王。彼无边称王。复更思惟。以我所有。善根力故。令四天下。降雨黄金。作是念已。于四天下。皆雨黄金。所以者何。皆由无边称王。于往昔时。与诸众生。共修善业。之所获得。</strong></p><p>释：大王，那个无边称王又作如下的思惟：以我所有的善根之力，让四天下都降下黄金雨。他生出这样的念头以后，果然四天下都降下了黄金雨。为什么能这样，要雨黄金就能雨黄金，要雨银子就能雨银子？这都是因为这个转轮圣王在往昔时和那些所有得到利益的众生，都共同修过善业，所以才能获得这样的果报。</p><p>转轮王这次想下黄金雨，贪心越来越大，不再贪小。如果他那个贪念能够成为现实，说明什么？说明他的福德是很大的，才能实现这些贪念。如果有一个人，他打一个念，让天下降黄金，真就降黄金了，那要在什么情况下，要在天下人都有这么大的福德的情况下；不但作念的人要有福德，其他相关的要受益的人也要有福德受用这些利益。如果一起受用的人没有福德享受，那个黄金雨就降不下来，即使能降下来，没有福德的人也得不到。如果没有福德的业种，福德的花果就不能出现，众生福德一定要具足，这是个前提条件。转轮圣王生活的那个时代，他的老百姓都很有福报，命中有那个福，才能感得天下黄金雨。</p><p>这是转轮圣王和四天下人的共业所感，共业就是共同积累过同样的福德，才能共同地享用共同的果报。比如夫妻就有共业，没有共业聚不到一起，夫妻都有同样的善业或者恶业，能共同感召富贵或者贫穷，不可能一个是富贵一个是贫穷的，那样就聚不到一起了。如果夫妻俩人的共业没有了，一个该受富贵的果报，一个该受贫穷的果报，俩人就不能在一起生活。父母和孩子也有共业，父母和孩子如果没有共业，比如父母应该受贫穷的果报，孩子应该享受富贵的果报，等孩子长大离开家后，到别处就发达富贵了，父母享受不到，说明了他们没有共业。众生共同生活在地球上，地球上的人类都有共业，或者生活在一个小城市里，这一个小城市里的人也有共业。</p><p>所以要想得到富贵的果报，不用去求，只要真正布施修福就行了，谁修谁得，不修不得。善业是没有边际没有限量的，不是说这个富贵的业你要修了我就没有了，谁修谁得，所有人修了，所有人都得。所以共业能让众生聚会一处，不共业就让众生各自分离。在极乐国土众生的共业感得天衣天食自然而有，遍地七宝，黄金铺地，那是极乐国土众生的共业，而地球人则把黄金当作宝贝戴在身上。等到地球人福报享得所剩不多了，地球上最好的东西是铁，那时候的人类，得到一块破铁就当宝戴在身上，因为众生没有福了，无福的共业就感召恶物，没有宝物。</p><p>地球刚形成的时候，遍布甜美的甘泉，自然生长地肥，那时人是从二禅天上下来的，福德很大。后来众生生出贪心，福德减少，甘泉和地肥就消失不现，才开始生长天然梗米，后来福报再减少，天然梗米都不生了，人类就要种植五谷，一直到现在，都是人力种植庄稼。现在地球上非常有营养的五谷和植物，连名字都听不到，这就是消耗福德的结果。现在时代的众生都属于薄福的众生，再往后的众生比现在的众生还要薄福，好吃的谷米也全都消失了，他们既吃不到也看不到，甚至都听不到，所以我们生活中的一切所需，都是从我们的福报中来。</p><p>这些福报存在哪里？都存在如来藏里。如来藏就是我们的福德银行，如果我们把银行里的存款都消耗没有了，就会成为贫穷下贱的人；如果存在银行里的福德不取或者少取出来享用，我们就是富贵大长者。修行人就是要多存少用，取出来以后再用来利乐众生，这样又把福存进去了，那银行里的存款就会越来越多，利再滚利，福德修圆满了，就能成佛。</p><p>如果要相互比，不要比谁享用的财富多，要比如来藏银行里的存款谁最多。谁的如来藏银行存款最多，谁最富贵，谁就先成佛。即使我们现在没有多少财富可享受，但是我们的如来藏里的存款非常多，那我们就是大富贵者，富贵不富贵，要看存款，不完全看现金。所以应该尽量少享受，让如来藏里的存款越来越丰厚，或者把这些存款拿出来利乐众生，再修福存福。</p><p>从如来藏存款里拿一元钱出来利乐众生，那回报率是一千倍以上，或者无量倍。拿出一元钱布施给一个没有修行的人，回报是一千元，回报率是一千倍；如果布施给一个有修行的人，回报会变成十万倍、百万倍、无量倍，都回报到如来藏的银行里。懂得这个道理，我们就会修福了，一元钱如果花在自己身上，银行里就少了一元钱的存款；如果花在别人身上，银行里就又存了一千、两千、十万、百万、无量万。懂得修福的人，要尽量少享受，越享受福越少，要让别人享受，多利乐他人，你的回报是千万倍无量倍，福报够了，银行存款够了，因缘具足，才能证悟，或者成为初地、二地、十地菩萨摩诃萨，直至成佛。</p><p>修福本来就不容易，福报如果都用在自己身上，就越来越少。如果再占用他人的财物或者是偷盗他人的财物，福德就会用一千倍或者用无量倍的代价偿还，福德就要消耗这么多倍，想想真是不值得。如果投生天界做一次天主，积累多生多世的福很可能就清零了，投生在人中做宰官大臣，福德也消耗的差不多了，享福时福消得非常快，接受一次磕头礼拜，存款又少了许多，用人伺候洗衣做饭，福报就减少了，或者被人喊一声万岁，积累的那点福就没有了。福报都是这样一点一滴消耗没有的，学佛修行人一定要懂得集福修福的道理，多为道业和成佛考虑而广积道粮。</p><p>原文：<strong>大王。此阎浮提。大地纵广。一万八千。踰缮那量。复有六十俱胝。诸大城郭。中有一城。名宝庄严。纵广正等。十二踰缮那。四面平正。妙巧成就。于其城外。有多罗树。七重行列。四宝所成。金银琉璃。玻胝迦宝。装校严饰。甚可爱乐。</strong></p><p>释：大王，这个阎浮提大地纵广一万八千由旬，又有六十千万（六亿）之多的大城市，其中有一个城市名字叫作宝庄严，大地纵广方圆十二由旬，四面都很平整，造就得很巧妙。在这座城市外面，有用七宝成就的七重行列的多罗树，有金、银、琉璃、玻胝迦宝等等，装饰得很严丽很可爱。</p><p>原文：<strong>彼金树者。其叶花果。悉皆是银。彼银树者。其叶花果。皆是黄金。吠琉璃树。其叶花果。皆玻胝迦。彼玻璃树。其叶花果。悉是琉璃。其城七重。宝网宝铃。诸妙珍琦。弥覆其上。</strong></p><p>释：那些金树的叶子和花果全部是白银做的；那些银树的叶子和花果全部是黄金做的；那些吠琉璃树的叶子和花果全部是玻胝迦做的；那些玻璃树的叶子和花果全部是琉璃做的。这座城市有七重宝网、宝铃和很多美妙的珍奇宝物弥覆着。</p><p>上述那些美妙的境界我们通过读诵阿弥陀经应该很熟悉，极乐世界就是这样的，转轮王时代的南阎浮就是这样的美妙，说明那时候的人类有大福德，现在的众生没有多少福德了，感召不来这些殊胜的生存环境。</p><p>原文：<strong>城外复有。七重宝堑。皆以七宝。所共合成。一一宝堑。深半由旬。广一由旬。金沙布底。八功德水。澄湛盈满。诸妙音鸟。翔集其中。优钵罗花。拘没那花。钵讷摩花。分陀利花。普遍开发。周匝阶陛。四宝合成。黄金为阶。白银成陛。白银为阶。黄金成陛。琉璃为阶。玻璃成陛。玻璃为阶。琉璃成陛。一一阶道。七宝所成。其傍皆植。金色芭蕉。复于道首。置诸宝座。巧妙装校。甚可爱乐。</strong></p><p>释：城外又有七重宝堑，都是用七宝共同合成的，每个宝堑深有半由旬，就是二十里地深，广一由旬，四十里地宽，用金沙铺地，里面的八功德水澄湛清澈，盈满宝堑。有美妙歌喉的诸多鸟类在其中飞翔聚集，演唱和雅优美悦耳的音声。还有优钵罗花、拘没那花、钵讷摩花、分陀利花到处开放。周围的台阶是用四宝合成的，黄金为台阶白银为阶陛；白银为台阶，黄金为阶陛；琉璃为台阶，玻璃为阶陛；玻璃为台阶，琉璃为阶陛。每个阶道都是七宝所成，在阶道的旁边都种植了金色的芭蕉。又在阶道的首端设置了一个宝座，装饰布置得很巧妙，惹人欢喜爱乐。</p><p>印度的一大由旬等于中国的四十里地，小由旬等于中国的二十里地。极乐世界的七宝池也是金沙铺地，宝池里的水，具有八种功德，《无量寿经》中描述：八功德水随众生心念，欲至膝则至膝，欲至腰则至腰，澄湛柔软，盈满宝池。十方世界很多佛国土都是有福的众生居住，没有福报的众生，感召的佛国土是肮脏污秽和贫穷的。众生生存环境如何，是由众生的善根和福德决定的。</p><p>原文：<strong>如是富乐。种种严饰。皆是无边称王。积集广大。善根福力。之所获得。又彼宝庄严城。周匝复有。八万四千清净园林。一一园中。有八大池。其池各广。半踰缮那。</strong></p><p>释：如是富贵妙乐的种种严饰，都是无边称王过去世积集广大善根福德力所获得的。那个宝庄严城周围还有八万四千个清净园林；一一园中都有八大水池；每个水池都有半由旬宽广。</p><p>原文：<strong>一一池岸。有四阶陛。四宝所成。巧妙严饰。八功德水。充满其中。众色莲华。开敷弥布。于其池岸。复有诸花。阿提目葛多花。詹博迦花。嚩始计花。苏曼那花。阿输迦花。婆师迦花。如是种种。诸妙香花。无边称王。与诸臣民。止住园中。共为游乐。</strong></p><p>释：每个水池的岸边，都有四宝所成的阶陛，用四种宝巧妙严饰，八功德水充满其中，色彩斑斓的莲华开敷弥漫在水池边，在那些水池的岸边还有更多的鲜花，如阿提目葛多花、詹博迦花、嚩始计花、苏曼那花、阿输迦花、婆师迦花等等如是种种诸多的美妙香花。无边称王和他的臣民们，住止在花园中一起游戏戏乐。</p><p>原文：<strong>大王。彼王宫城，高广严好。宝多罗树行植于上。宝网周遍，宝铃和鸣，出妙音响。如五乐声。时彼人民，赖王德化。富乐自在，安隐而住。</strong></p><p>释：大王，无边称王的王宫城又高又广，庄严华丽，有宝多罗树一行行地种植于上，宝网周遍覆盖宫城，宝铃和鸣演出微妙的音声，就像五种乐器合奏出来的音声。当时的人民依赖无边称王的福德化育，过着富乐而又自在安隐的生活。</p><p>原文：<strong>大王。彼无边称王。复于异时。如是思惟。我今应往。东胜身洲。作是念已。王领四兵。俱乘虚空。即至其处。彼诸小王。皆来奉迎。各以国土。虔诚致献。王于彼住。百千万岁。</strong></p><p>释：大王，那个无边称王又在某个时候，生出这样的念想：我今应往东胜神洲。生出这样的念头以后，无边称王就领着四种兵一起乘空飞到了东胜神州。东胜神州的小王们都出来迎接，各个都把自己的国土虔诚地奉献给无边称王，无边称王就在那里住了百千万年。</p><p>这个转轮圣王那么富贵自在，还是不知足，想去东胜神洲逍遥娱乐。那边的小王全部都来奉迎他，因为他的福德大，他们就马上伏首称臣。如果当地小王福德大，肯定要把他给赶走，福德差不多的时候，就互相战争。很多家庭也都是这样，谁福德大听谁的。那些小王都把自己的国土奉献给他，让他来统领。他的寿命远远超过了百千万岁，他那时候的寿命是非常长的，按劫算。到弥勒佛的时候，南瞻部洲人的寿命是八万四千岁，还有比这个寿命更长久的。据佛经记载，有佛给弟子们授记作佛的时候，他的臣民寿命是二十劫、四十劫，或者是无量劫，一劫是一千六百八十万年，他们的寿命是太长了。</p><p>原文：<strong>大王。彼无边称王。复自思惟。我今当往。西牛贺洲。作是念已。领四兵众。俱乘虚空。即至其所。彼诸小王。皆来奉迎。各以国土。虔诚致献。王于彼住。百千万岁。</strong></p><p><strong>大王。彼无边称王。复自思惟。我今当往。北俱卢洲。作是念已。领四兵众。俱乘虚空。即至其所。彼诸人民。欢喜归化。王于彼住。百千万岁。</strong></p><p>释：佛说：大王，那个无边称王又生出这样的念想：我现在应该到西牛贺州那里去。生出这样的念头以后，就领着四种兵乘坐宝马宝象宝车等等飞行工具，乘空飞到了西牛贺州，西牛贺州的那些小王都来迎接，各个都把自己的国土虔诚地奉献给他，无边称王就在那里住了百千万年。然后那个无边称王又生出这样的念想：我应当到北俱芦洲那里去。生出这样的念头以后，就领着四种兵一起乘空飞到北俱芦洲，那里的人民都欢喜的归附于无边称王，无边称王在那里住了百千万年。</p><p>原文：<strong>大王。彼无边称王。复自思惟。我昔闻有三十三天。住须弥顶。我今当往。作是念已。即乘龙象。与四兵众。飞腾空中。上须弥顶。时无边称王。问御臣曰。汝见须弥。及以大海。并四天下。其事云何。御臣答言。我见其相。旋转不定。如陶家轮。王语御臣。汝所见者。此龙象王。大行未止。</strong></p><p>释：大王，无边称王又生出这样的念想：我从前曾经听说过有个三十三天住在须弥山顶，我现在应当过去。生出这样的念头以后，就乘坐龙象与四种兵一起飞腾到空中往须弥山的方向去。这时无边称王问旁边的辅臣说：你看须弥山、四大海和四天下是怎么样的？辅臣回答说：我看见那些相都是旋转不定的，就像制作陶器所用的轮盘一样。无边称王说：你之所以能见到那样的相，是因为乘坐的龙象快速飞走造成的。</p><p>原文：<strong>王复前进。问御臣曰。见须弥等。其相云何。御臣答言。我今见彼。须弥大海。皆悉震动。王语臣曰。今将至于。须弥山顶。此龙象王。小行未止。王复前进。问御臣曰。见须弥等。其相云何。御臣答言。我今见彼。须弥大海。不动不转。王语臣曰。此龙象王。今已到彼。须弥山顶。</strong></p><p>释：无边称王又继续往前飞行，问辅臣说：现在你看见须弥山等等相貌如何？辅臣回答说：我现在看见须弥山和大海全部都是震动的。无边称王说：那是因为快到须弥山顶了。无边称王乘坐龙象继续缓慢飞行，并没有停止下来，无边称王又问辅臣说：你现在看见须弥山是什么相貌？辅臣回答说：我现在看见须弥山和大海都不动也不转了。无边称王说：现在龙象王已经到达须弥山顶了。</p><p>原文：<strong>时无边称王。及四兵众。到须弥已。彼帝释天主。即时遥见。无边称王。欢喜来迎。而作是言。善来大王。即分半座。命王而坐。时无边称王。即就其座。住于天上。经无量岁。与彼天主。分半同治。</strong></p><p>释：无边称王和四种兵到达须弥山顶以后，三十三天的帝释天主立刻远远地看见无边称王，就欢喜地上前迎接说：善来，大王，欢迎您！于是就把自己的宝座分一半给无边称王坐。这时无边称王立时就坐上去了，并且在那里住了无量岁，与帝释天主分半共同治理三十三天。</p><p>原文：<strong>在彼时久。作是思惟。可退彼天。我独为主。作是念已。王及兵众。即时退堕。宝庄严城。宝箧园中。时守园者。见是事已。告城中人。作是唱言。今有天人。退没于此。</strong></p><p>释：无边称王在三十三天住的时间长了，就这样想：应该把帝释天主驱赶走，我自己一个人作为此天主，治理此天界。生出这样的念头以后，无边称王及他的四种兵就掉到了人间的宝庄严城的宝箧园中，这时守护园林的人看见他们掉下来以后，就告诉城中人说：刚刚有天人从天上掉下来了。</p><p>原文：<strong>时彼国王。名曰作爱。闻是说已。速严驾驭。诣彼园中。见如上事。怪未曾有。即敕排备。种种香花。末香涂香。诣彼王所。偏袒右肩。右膝着地。长跪合掌。安慰问讯。白彼王言。圣天至此。为当是谁。</strong></p><p><strong>彼即答曰。汝昔曾闻。有转轮王。名无边称不。作爱王言。我闻耆旧说。昔有王名无边称。威德自在。领四天下。与四兵众。乘空而上。三十三天。汝所闻者。岂异人乎。则我身是。</strong></p><p>释：这时的庄严城的国王名字叫作爱，听说这件事后，马上就准备了车乘赶到园林中，看见这样的事觉得很奇怪，以前从来没有发生过。国王就叫人准备种种的香花、末香和涂香，到了无边称王身边，偏袒右肩右膝着地，长跪合掌问讯和安慰无边称王，对无边称王说：圣天到此，你是谁呢？无边称王说：你是否曾经听说过昔日有个无边称王吗？作爱国王说：我听老者说过，昔日曾经有个无边称王，威德自在，统领天下，与四种兵众乘空飞到三十三天去了。无边称王说：你所听说的人不是别人，正是我。</p><p>原文：<strong>时无边称王。从天退已。初闻人间。饮食气味。不能堪任。犹如酥油。沃热沙中。时作爱王。见其顿弊。不能止住。有何善说。我于来世。作何宣传。时无边称王。语作爱王曰。我从昔来。富贵自在。王四天下。一切所须。皆得如意。升忉利天。帝释分座。贪无厌故。从天退下。如上众事。当如是说。</strong></p><p><strong>作是语已。即便命终。佛言大王。往昔无边称王者。岂异人乎。今我身是。是故当知。诸根如幻。境界如梦。系心正观。勿生疑惑。</strong></p><p>释：这时无边称王刚刚从天上退堕下来，初闻人间的饮食气味心里不能忍受，就像酥油热流淌到热的沙子中一样。国王看见无边称王的身体赢劣，就知道活不多久了，就问他：你有什么遗言要留下吗？我将来要如何宣传你？无边称王说：我从往昔以来富贵自在，统治四天下，一切所需都如我意，升到忉利天以后，帝释分给我一半宝座，因为我贪得无厌就从天上退堕下来了，以上这些事应当如实这样说。无边称王说完以后就命终了。</p><p>最后，释迦牟尼佛说，大王，这个无边称转轮王，不是别人，就是我释迦佛的前身。所以你们应当知道，诸根如幻境界如梦，当摄心一处，正念观照，不生疑惑。</p></div>"
}]