[{
    "title": "第一章　七佛传法偈",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第一章　七佛传法偈</strong></p><p><strong>一、毗婆尸佛传法偈</strong></p><p>原文：<strong>身从无相中受生，犹如幻出諸形象；</strong></p><p><strong>　　　幻人心识本来无，罪福皆空无所住。</strong></p><p>释：（一）身从无相中受生。色身就是色阴，能遮挡众生心识，让众生认妄为真，众生一直以为这个色身就是我，是真实的。无相指阿赖耶识、第八识、如来藏，这是真心，无形无相，没有色声香味触法相，没有三界中任何一相，犹如虚空又不是虚空。虚空是无法，是假相，这个心是真实有，是实相，有真实的体性和作用。</p><p>真心能产生万法，包括色身，色身从这个心中受生。众生由于我执不断，意根执著自己，死后就有个中阴身，遇到有缘的父母，意根就与第八识一起投胎，形成名色，也就是受精卵。因第八识有地水火风四大种子，与母体中四大元素接触，变生受精卵，七天一变，长出头四肢眼耳鼻舌身，五个月左右变出识心，就能分别生存环境。六根圆满了，第八识就吹业风，头向下出母胎。第八识又吸收四大元素把婴儿变为儿童少年青年老年，最后死亡。所以色身是从第八识中变生的，第八识又无相，无相却能变出一切相。</p><p>（二）犹如幻出諸形象。第八识变出的色身就像幻化出的一样，从一无所有到受精卵又到成年那样大的色身，甚至变出大象那样大、龙那样大、大鹏金翅鸟那样大的色身，从无到有，用种子变现出肉体色身，就是幻化出来的。就像一个魔幻师突然在虚空变化出一个城郭一样；就像一个画师在空白的画布上，随意描绘出山水人物一样；就像空中的白云，聚合离散形成了一只猫、一只狗、一朵花一样。这些幻化物，空来空去，根本把捉不住，任人如何执著最终仍然要消失而去。</p><p>（三）幻人心识本来无。众生在受精卵中本没有六个识心，没有分别性，五个月左右才有意识心出生，继而有耳识鼻识舌识身识，出生七天后眼识才能分别。这些分别的识心是刹那刹那在生灭着的，并不真实，一刹那中有八万一千次的种子生灭，众生才能分别六尘。而每一个种子都由阿赖耶识输送，若是中间有一个几个种子不输送出来，识心的分别性就不存在了。比如灯要发光必须有电流，电流由电子形成，一个电子在前产生又灭了，后一个电子马上产生又灭了，无数个电子接续起来，形成电流，通过电灯，灯泡就发光了。心识的种子就像那电子一样。</p><p>一股水流的形成，也是一滴水一滴水接连不断所形成的，心识种子就像那水滴一样。水流由水泵导出，电子由发电机输出。阿赖耶识就像发电机和水泵一样，一个识种一个识种地输送出来，一刹那八万一千个识种前后接连不断，前仆后继的形成了识心，才有识心的活动，有分别的功能。若阿赖耶识离开不工作了，识心就不出生了，分别性也无，身体就如一块木头。</p><p>（四）罪福皆空无所住。罪业和福业都由妄心而造，妄心造作了身行、口行、意行的同时，不管是善是恶是不善不恶，阿赖耶识都记载收存。等到来生业种成熟了业缘出现，阿赖耶识输出业种，众生就受报，而受报时的五藴已经不是前一世的了。造业者和受报者都是生灭的虚幻的不实的，而罪业福业也是生灭的虚幻的，福报一享就没有，罪业受完或忏悔就消失，都是生灭法无常法。</p><p>比如妄语业，造作出来之前，它并没有藏在哪里，造作之后，语言没有了，业行消失，消失后，也没有到什么地方去。但是整个行为过程阿赖耶识全部记载。妄语这一法是虚妄的，是谁打妄语呢？身体不会打妄语，口不会打妄语，舌不会打妄语，否则死人也会打妄语。舌识心意识心不会打妄语，两个识又是念念生灭的，意根也不会说话，不能打妄语。而阿赖耶识又无口无舌，更不会打妄语。根本没有打妄语的人，妄语业就是虚妄的。</p><p>众生是阿赖耶识幻化出来的，而一个幻化的假人，犹如一个机器人木偶人一样，虽然造作了业行，本身也是虚妄的，谁也不能给它们定罪，定了罪它们也不受，幻化的众生也如是。罪福的虚妄性有很多事实可证，以阿闍世王的事例来说，阿闍世王杀了父亲，业报现前，就去见世尊。世尊给阿闍世王分析父亲这一法的虚妄不实性，没有真实的父亲，也没有真实的自己，那么杀父这一法就是虚妄不实的，阿闍世听懂了以后，地狱罪业就消失了，命终不但没下无间地狱，而且还往生了极乐世界，可见罪业福业的虚妄性。</p><p>又比如，证罗汉初果，或明心的人，无始劫的三恶道罪业就消灭了，未来永不下三恶道受报，只是在人中受苦。万法包括罪福业都是生灭的、无常的、空幻的，深刻剖析这个道理，就会悟得大乘无生理，成为实义菩萨。</p><p><strong>二、毗舍浮佛传法偈</strong></p><p>原文：<strong>假借四大以为身，心本无生因境有；</strong></p><p><strong>　　　前境若无心也无，罪福如幻起也灭。</strong></p><p>释：众生的色身是由地水火风四大种子所构成，第八识依众生的业缘输出四大种子，按照四大的不同比例变现出了众生色身的不同部位，众生就以四大组成的色身为我。而变现众生的第八识是本来就有的，不是后天出生的，因此是无生法。祂无形无相，自己单独无法显现出来，与五阴和合在一起时，在五阴身上才能显现出来。祂总是与自己所变现的五阴十八界在一起，有境界出现，就有祂的存在。所以众生要想识得祂、找到祂，就要在各种境界妄缘上去寻觅祂。</p><p>如果五阴的各种境界消失了，众生眼不见色，耳不闻声，鼻不嗅香，意不思法，识心都灭，那么第八识就无法在色声香味触法上显现出来，六识灭去的时候没有识心来识别第八识，第八识就暂时隐居着。既然色身是四大所造，识心虚幻，那么五阴所造作的罪福业也是虚幻，从现象上看好像是有，其实也是无生，并没有真实的罪福业存在，因此罪福皆空无我无我所。</p><p><strong>三、迦叶佛传法偈</strong></p><p>原文：<strong>一切众生性清净，从本无生无可灭；</strong></p><p><strong>　　　即此身心是幻生，幻化之中无罪福。</strong></p><p>释：众生者即是五阴，五阴者即是第八识所幻化的，与第八识为不二的关系，其本质都是真如第八识。而真如第八识为自性清净心，从本以来自性清净，无有染污。那么依于真如自体而说，祂所出生的五阴众生即是清净性的，即是真如如来藏性。</p><p>若离开真如第八识，单独看每个众生五阴的单个个体，却是染污性的、生灭性的、变异性的、无常性的、无我性的。因为真如第八识从无始劫以来就法尔如是地存在着，不是生出来的，从来没有灭过，而且永远也不会灭。那么依于第八识而说，五阴众生也是无生无灭的，因为本质都是第八识的属性。</p><p>因为第八识中存着五阴的种子，遇缘就会产生众生的五阴，第八识又长存不灭，那祂就会永远能生出五阴身不断绝，那么五阴从整体和长远时劫来看，就是常存不灭的，直至成佛也不断绝，成佛之后更不会灭去，诸佛以此五蕴身心来利乐众生永无穷尽。如果单独看每个五阴个体，那才是生灭性的。</p><p>由五阴组成的众生，其色阴之身和受想行识四阴之心识，都是真如第八识依各种缘而幻化出来的，就像魔幻师在虚空中所变化出来的幻人一样。而幻人无论做什么罪业和福业，其罪福业也是虚幻不实的，无有真实的罪报和福报。五阴众生也如是，幻化出来的众生，无论做什么罪福业，其业虚幻不实。若是身做，身是虚幻，若是识心做，识也幻化无实体。既然是幻化无实体，其所做的罪福业也是虚幻无实，无有真实的罪报和福报，无有主人，就无业行。</p><p><strong>四、拘那含牟尼佛传法偈</strong></p><p>原文：<strong>佛不见佛知是佛，若实有知别无佛；</strong></p><p><strong>　　　智者能知罪性空，坦然不怖于生死。</strong></p><p>释：真如无见无闻、无觉无知，真如自心不见自心，自心不知自心，真如自心不觉知自己，那么我们就知道了这个不见真如自己的心就是佛。如果有人说真如有知有见，能够见色闻声，能知有无妄想，能入定与不入定，这个知就是意识的知，不是真如，认这个知为真如，就再也没有佛了，无知无见的真如才是真正的佛，是成佛的真体。</p><p>有智慧的人能够知道，一切法都是真如自心所现起的，所显现出来的，没有真实不灭性，众生造恶修善，其行本身也是真如所显所变，没有实法可得，其罪福性也空。一切生死现象也是真如所变现出来的虚妄相，没有真实的生死法可得，生死犹如幻梦和空花，了不可得。因此得道的智者，证得一切法如幻如梦的菩萨，不会再害怕生死，不会像阿罗汉一样去求取涅槃，灭度生死。菩萨们在幻生幻灭的生死当中，不断地穿梭往来，在各个佛国土自度然后得以度人。</p><p><strong>五、释迦佛传法偈</strong></p><p>原文：<strong>法本法无法，无法法亦法； </strong></p><p><strong>　　　今付无法时，法法何曾法。</strong></p><p>释：第一句法本法无法，真正的佛法就是本来而有、本来就有的法，那就是真如如来藏法。这个法不是后天由于各种因缘而出生的法，也不是未来在缘散去时就会灭掉的法，祂是不生也不灭的法。这个不生不灭的如来藏法中，本来没有一法存在，就像《心经》中所说的“无眼耳鼻舌身意，无色声香味触法，无眼识界乃至无意识界，无无明亦无无明尽，无苦集灭道，无……”，他没有三界任何一种世俗法。</p><p>第二句无法法亦法，这个无法的如来藏法亦是一种法，是一种不属于三界之内的法，是一种真实存在的能够被众生认知，被众生证得，被众生观察的法，是一种有自己本身运行规律不同于七转识的法，是一种具有无量功德的法，是一种具有五蕴十八界三界种子而能产生三界世间的法，是一种既能使众生轮回，又能使众生圆满成佛的法，是一种如实实现三界世间因果规律的法。</p><p>第三、四句，今付无法时，法法何曾法。我现在正在为众生传付着这个无法的如来藏法，讲说三藏十二部法，以度脱众生出离生死苦海，究竟得解脱。我所传授的每一种法中，哪一种法都不是如来藏法本身，都是指向如来藏法的方便法和暂时而有的法，如过河的船筏一样。又如指月之指，指不是月本身，众生以指望月，就能证见真实之月亮，从而获得大智慧，最后究竟成就佛道，圆成佛果。</p><p><strong>六、尸弃佛传法偈</strong></p><p>原文：<strong>起诸善法本是幻，造诸恶业亦是幻；</strong></p><p><strong>　　　身如聚沫心如风，幻出无根无实性。</strong></p><p>释：众生无论是造作善业还是恶业，都是五阴七识所作。而五阴身没有自性，不能单独存在和运行，必须依靠第八识依据众生的业缘输送七大种子和业种，才能有五阴的各种身心活动。因此第八识就是五阴七识的种子依，也是根本依。没有第八识就没有五阴七识，有第八识才能有一切法的存在和运转。五阴身的整体都是第八识所幻化出来的，那么五阴身所造作的一切善恶业行，本就不实，如空花水月。</p><p>就像一堆铁皮制作成一个机器人，设置一些程序，人工控制一下，机器人就可以运转工作了。那么机器人所作的一切，都是虚幻的，因为机器人本身不会作任何事，本身没有自体性，它是组合起来的一种假相，没有真实的作用。如果机器人会杀人，法庭也不会判机器人有罪，即使投入监狱，机器人也没有真实的苦报。因此五阴众生所造作的一切业行，全部虚幻，非实有。</p><p>五阴色身就像大海当中所集聚成的泡沫，本质虚幻，都是海水。七识心也是第八识所变生出来的，也是虚幻的，没有实质的七识心，其本质就是第八识。因此七识心就像一阵风，来无影去无踪，来来去去都是第八识的性质。</p><p>第八识依众生的业缘输出七大种子所幻化出的色身五阴七识，没有根本性，也没有实体性，没有自在性。只是依世俗的假相而起世俗的一些利用罢了，晃耀众生的眼目，迷惑众生的心灵，遮障众生的自性光明，让众生在虚幻的生死业海里徒受疲劳，不得解脱。因此有必要剔除虚幻，认清本质，识得真相，返璞归真，成佛作祖。</p><p><strong>七、拘留孙佛传法偈：</strong></p><p>原文：<strong>见身无实是佛见，了心如幻是佛了；</strong></p><p><strong>　　　了得身心本性空，斯人与佛何殊别。</strong></p><p>释：众生的别名就是五阴十八界，五阴包括色阴、受阴、想阴、行阴、识阴；十八界包括六根、六尘、六识。五阴十八界是由色身和七识和合而成，色身包括内身和外身，内身就是具有一期生命、具有五根的身体，由四大种子组成；外身就是六尘境界，包括色尘、声尘、香尘、味尘、触尘、法尘，而六尘又分为内六尘和外六尘。众生所能了别和认知的是内六尘，内六尘是由第八识依据外六尘通过六根而在胜义根形成的影像。</p><p>五阴十八界的虚幻不实性，小乘初果人就能证得了，初果须陀洹断我见，就明了色身虚妄非我，识心虚妄非我。小乘人对五阴虚幻非我的认知是极其粗浅的，都是从世俗諦虚妄相来看待五阴，视野非常狭窄，智慧也很低劣，与佛的无上甚深的究竟智相比，就如井底与苍天。</p><p>证得身心不实如幻的智慧境界，要分很多层次，小乘初果到四果俱解脱大阿罗汉，都是证得五阴无实无我，他们只是证得人无我，对于五阴无我无实之理，还不是究竟了知，还只是停留在五阴的虚妄相上的认知。</p><p>大乘菩萨从明心见性的住位菩萨开始，一直到初地之前的菩萨，都是证得人无我。这种人无我的认知，要比小乘罗汉们究竟一些，增加了观察的角度，又立足于如来藏的角度来观察五阴的虚妄不实性，知道五阴并不是真正的主人，不是自在法，所以知道五阴不实如空花，但是还不究竟彻底。</p><p>直至修到佛地，以佛眼来观察众生的色身，和佛的无量千百亿应化身，都是如来藏刹那刹那所化现，佛眼没有一丝无明遮障，所见最为究竟彻底。佛眼也同时能观察到众生的心识，都是众生的如来藏刹那刹那输出识种子变化而成，没有真实的心识的功能作用，本质都是如来藏性。</p><p>当众生明心见性以后，智慧不断得到增长和圆融，就会越来越能深细地观察到五蕴身心的如幻不实，各种观行智越来越深细，越来越深知众生及自我身心的本性，皆是如来藏空性心，没有一丝五蕴身心的自我存在性。当菩萨的智慧达到如此境界的时候，就接近于佛的智慧境界，而离成佛就不太遥远了。</p></div>"
},{
    "title": "第二章　西天二十八祖传法偈",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第二章　西天二十八祖传法偈</strong></p><p><strong>一、迦叶付阿难传法偈</strong></p><p>原文：<strong>法法本来法，无法无非法；</strong></p><p><strong>　　　　何于一法中，有法有非法。</strong></p><p>释：世间法以及出世间法，其实都是指向真如之法，而真如法就是本来就有的法，不是后天出生的法。真如法中无有一法相，无任何一相，虽然如此，真如所现的所有法相当中，没有一法不是真如法，法法皆真如。为什么要在这无二相的真如法中，强分出空和有，是和非呢？非要说哪一法是真如，哪一法不是真如呢？</p><p><strong>二、阿难付法偈</strong></p><p>原文：<strong>本来付有法，付了言无法；</strong></p><p><strong>　　　各个需自悟，悟了无无法。</strong></p><p>释：历代诸佛、祖师传授弟子们的都是真如这个法，而真如这个法虽然无相，但是实有，相空体实。弟子们虽然都得法悟了道，其实是无所得，不得任何法，真如本是自家珠宝，非从外得，只是发现而已。发现了以后，就知道世间五蕴并没有一法存在，都是真如所变现。内心也会渐渐不再执真如法。祂既是一切法，又什么法都不是，既珍贵又不值一钱。大心众生需要各个努力，自修自悟，悟了以后，就知道了世出世间并不是一个法也没有，并不是全部虚妄的，还有一个法不虚妄，是真实有，这样就可以放心，不会是断灭空了。</p><p><strong>三、三祖商那和修付法偈</strong></p><p>原文：<strong>非法也非心，无心也无法；</strong></p><p><strong>　　　说是心法时，是法非心法。</strong></p><p>释：诸佛诸祖所传的真如法，不是世间法，没有世间法相，不是世间七识心，没有七识心的法相。真如无心于世间六尘，不分别六尘，不住六尘，不在六尘相上分别，而自心又空无一相，不具五蕴法，不具十八界法，不具四圣谛法，不具十二因缘法，不具六度法，空无一法。诸祖们谈论真如法、传付真如法时所用的心，正是世间七识妄心，有七识心的法相，不是所传付的真如法本身，而所传付的真如法，没有七识心的分别体性，不是七识心法，二者有截然不同的体性，差别极大。</p><p><strong>四、四祖优波鞠多传法偈</strong></p><p>原文：<strong>心自本来心，本心非有法；</strong></p><p><strong>　　　有法有本心，非心非本法。</strong></p><p>释：众生的自性清净心是本来就有的，不是后天出生的，不是因缘所生的法，世间没有能够产生祂的因和缘。这个本来就有的心，不是像三界其他法那样，具足形色，众生可以六根接触，可以六识来触知，这个心空无一相，一法也无有，祂本不属于三界中法。但是在三界的任何一种有法中，都有祂在执持、在显现、在作用着。而有别于本心的识阴六识，是由本心结合众缘所生出来的，不是本来而有的法。</p><p><strong>五、五祖提多迦尊者</strong></p><p>原文：<strong>通达本心法，无法无非法；</strong></p><p><strong>　　　悟了同未悟，无心也无法。</strong></p><p>释：如果通过修行，入了初地，通达了真如自性这个本心法，一切法就没有是和非，也就知道三界世间所有一切法，没有一法不是本心如来藏，都是如来藏所生所显所执持的，并没有真实的一切法存在。悟了本心如来藏法之后，知道本心非从外得，五阴自己并没有增加什么，还是悟前的五阴自己，只是心行发生了转变，渐转清净而已。心地转依本心如来藏以后，就渐渐地对于世间万法清净无为了，无心于一切人事物，心中无有一法可当情，不见一法为真实有。</p><p><strong>六、六祖弥遮迦传法偈</strong></p><p>原文：<strong>无心无可得，说得不名法；</strong></p><p><strong>　　　若了心非心，始解心心法。</strong></p><p>释：悟得本心以后，逐渐发现，这个本心非同前七识妄心的体性，不是三界当中的心行。这个心不可得，不是从外得来的，是五阴自己本有的家珍，只是通过他人指示，发现了祂而已。如果说开悟是得到了某个心，先无今有，后天出生的，那一定是悟错了，是悟了能生能灭的意识心境界。意识心通过修定，偶尔见空，识取空的境界为本心，这个本心就是从外得来的，是通过修定得来的，定散，空就灭，本心消失，于是再修定保任，让空常存，这种悟道方法为非道，是错乱修行。如果明了本心非是世间七识的心行，有别于前七识，八个识都了知，众生就开始了解了本心的各种法相，各种功能作用，逐渐具备别相智和道种智了。</p><p><strong>七、七祖婆须蜜传法偈</strong></p><p>原文：<strong>心同虚空界，示等虚空法；</strong></p><p><strong>　　　证得虚空时，无是无非法。</strong></p><p>释：众生第八识犹如虚空一样，无形无相，无为无作，无愿无求，无说无示。诸佛以此一大事因缘，出兴于世，开示众生似等虚空一般的如来藏心法，众生闻佛示教，精进修行，证得犹如虚空一般广大心量的如来藏时，慢慢就会发现，世间一切法，都没有自己单独存在的体性，都是如来藏依缘而生住异灭，全部是如来藏的功能、体性、作用的结果，那么每一法当体即空，当体即是空性心如来藏，与如来藏的关系就是非一又非异，即有相同的部分，又有不同的体性作用，没有是与不是的分成两端之说。</p><p><strong>八、八祖佛陀难提传法偈</strong></p><p>原文：<strong>虚空无内外，心法也如此；</strong></p><p><strong>　　　若了虚空故，是达真如理。</strong></p><p>释：虚空非真实有，它是心所显现出来的一种虚幻的假相，因此虚空无内无外，无有边界、长短、大小和方圆。如来藏心也是这样，无内无外，无形无相，没有边际。如果能够体认如来藏犹如虚空一样的体性，不来不去，不增不减，如如不动，无愿无求，无为无作，这样也就通达了如来藏真如之理。</p><p><strong>九、九祖伏驮蜜多传法偈</strong></p><p>原文：<strong>真理本无名，因名显真理；</strong></p><p><strong>　　　受得真实法，非真也非伪。</strong></p><p>释：真心如来藏历劫无名，无说无示，寂然而存。诸圣出世，为方便示教众生，安真心于各种假名，无量之多，只为表显真心的体相用，方便众生分别识知。众生就会根据真心的各种名字，分别了知了真心的各种体性作用。众生依据真心的各种体性，就寻找到了真如心体，这样证到了真理之后，就知道了真心非是像五阴世间法一样，有形有相，可让众生看听嗅尝触，让众生感到真实有世间法的功能利用。虽然如此，真心也并非是虚妄，而是有真实的理体存在，有真实的功能作用，并不是名言假说，和仅仅是名字而已。</p><p><strong>十、十祖胁尊者传法偈</strong></p><p>原文：<strong>真体自然真，因真说有理；</strong></p><p><strong>　　　领得真真法，无行也无止。</strong></p><p>释：如来藏这个真实理体是本来就是真而不虚妄的，不是通过修行而变成的真实法。因为有这个真实的理体，才说有三界世间万法的存在，才说五阴世间的运行法则。当我们悟了如来藏并领会掌握了如来藏这个真实法之后，就会知道并没有三界世间万法的运行和静止，并没有万法的生和灭，所有的生灭法，所有诸法的动和止，都是诳惑人心的虚妄不实法，并不真实有，都是依如来藏这个实存的理体而显现的众多假相而已。</p><p><strong>十一、十一祖富那耶舍传法偈</strong></p><p>原文：<strong>迷悟如隐显，明暗不相离；</strong></p><p><strong>　　　今付隐显法，非一亦非二。</strong></p><p>释：众生迷惑颠倒时，不识如来藏，就好像如来藏隐藏起来不现前了；众生破了无明，悟得如来藏时，在自身以及所有众生身上都可以发现各自如来藏在运行不断，在分秒刹那地显现着，就好像如来藏再也不会隐藏了。其实不管众生迷也好，悟也好，心中黑暗也好，心中有光明也好，如来藏都没有离开过众生，都和众生在一起，都存在显现着，没有故意隐藏过，只是众生无明闭心，不识如来藏。现在我传付这个如来藏法，众生得法之后，就知道迷悟、明暗与如来藏的关系是非一也非二的，迷悟明暗依如来藏而生，是如来藏的一部分，但也不完全是如来藏，与如来藏既有相同又有差别，所以是非一非二。</p><p><strong>十二、 十二祖马鸣大士传法偈</strong></p><p>原文：<strong>隐显即本法，明暗无不二；</strong></p><p><strong>　　　今付悟了法，非取也非弃。</strong></p><p>释：如来藏对于众生，不管是隐藏还是显现，都有其本体功能作用，都是本有之法，从不消失灭亡。众生心中的明与暗，与如来藏不是完全的二法，明暗、迷悟因如来藏而有，依如来藏而生，本如来藏性。我现在传付证悟如来藏之法，如来藏自心对于世间一切法从不取着，也不弃舍，不即不离，祂没有三界的心行，清净无比。</p><p><strong>十三、十三祖迦毗摩罗传法偈</strong></p><p>原文：<strong>非隐非显法，说是真实际；</strong></p><p><strong>　　　悟此隐显法，非愚也非智。</strong></p><p>释：如来藏本身不会刻意隐藏起来，不让众生了知，也不会刻意显现出来，让众生觉悟，祂没有这些心行。而是众生有愚有智，愚者不识，智者明见。不管众生见与不见，识与不识，如来藏都是真实存在的，从不生灭，从不变异，是世出世间唯一真实法。证悟了如来藏这个既隐又显法，就知道如来藏既不愚痴，也不属于世间的智慧范畴。祂没有无明，没有贪嗔痴，不愚于万法。可是也没有三界世间的智慧，不知一切法，不分别一切法，不会筹算、分析、思惟、推理，又不作主宰，只是随缘现法而不得法。</p><p><strong>十四、十四祖龙树菩萨传法偈</strong></p><p>原文：<strong>为明隐显法，方说解脱理；</strong></p><p><strong>　　　于法心不证，无嗔也无喜。</strong></p><p>释：诸佛为了让众生明了既隐又显的如来藏法，出生宣示众生四种涅槃解脱之理。从三法印的诸行无常、诸法无我、涅槃寂静，到依自心如来藏而有的十二因缘法，最后是菩萨所修的真实如来藏法，无不在在显示众生无我解脱之理。然自心如来藏本自无缚，对于三界法无住无行，无贪无厌，如如不动，因此就不会被三界法所系缚，没有生死轮回，也就不用求解脱，证解脱，出生死。</p><p>自身就在无生死之彼岸，无烦无恼，无生无灭，常处涅槃寂静境界，何用再断除烦恼和无明，求取解脱，心不住法，何用离法证涅槃。是五阴这个我有生死，有系缚，需要修证解脱，断除烦恼，去除无明，从生死的这岸到涅槃的那岸，其实五阴也在涅槃中，依着自心如来藏，生死即是非生死，众生不知，才要修证。</p><p><strong>十五、十五祖迦那提婆传法偈</strong></p><p>原文：<strong>本对传法人，为说解脱理；</strong></p><p><strong>　　　于法实无证，无终也无始。</strong></p><p>释：诸佛所说的解脱之理，是对众生的五阴身而说，非是让众生的如来藏求取解脱，因此是修五阴七识，非修真心如来藏。众生的五阴依佛说的解脱理，证得解脱以后，以自身所证传示与其他众生，代代相传，以致所有众生都能得解脱。然无论是传法人还是受法人，都是他们的五阴来修证解脱理，自心如来藏对于解脱理不用修证，因为本来就是解脱的，从来不在生死中，没有出生过，也永远不会死，那就是说如来藏没有开始，也永远不会灭亡，永无尽期地存在，无寿也无命，不被一切法所系缚。</p><p><strong>十六、十六祖罗矦睺罗多传法偈</strong></p><p>原文：<strong>于法实无证，不取也不离；</strong></p><p><strong>　　　法非有无相，内外云何起。</strong></p><p>释：自心真如对于一切佛法都不修不证，因为祂没有无明，就不用修行再去得解脱。对于三界一切法以及自身，从来不取着，也无有离之心。真如之相，非有非无，说祂有，无形无相，看不见摸不着，说祂无，却有真实的功能利用，真实地出生一切法，含藏无量法种，因此不可说祂无。祂是实相，实相就是真实有，只有祂是真实有，其余都是空和幻化。因为真如无形无相，就没有内和外，内里虚无，外在无形，却藏万法，如果不证得祂，任你穷尽思惟度量，也是莫名其妙。</p><p><strong>十七、十七祖僧伽难提传法偈</strong></p><p>原文：<strong>心地本无生，因地从缘起；</strong></p><p><strong>　　　缘种不相妨，花果亦复尔。</strong></p><p>释：第八识这个心体本来就有，不是后天出生的，三界世间法却是第八识依赖种种业缘而出生现起的。第八识中所含藏的业种与外界的业缘，二者不互相妨碍，当外界的业缘成熟时，第八识就输出众生的业种，产生众生的业报。如果业种不遇缘，或者缘不成熟，众生的业种也不结果，不得业报。就比如花和果之间也不互相妨碍，花生长以后结出果实，作为种子存起来，种子种到地里，遇缘又开花结果，生生不已。众生身口意的业行好比是花，造作之后，作为种子存在第八识里，业缘成熟时，第八识输出种子，众生就受业行的果报，结出业果实。</p><p><strong>十八、十八祖伽耶舍多传法偈</strong></p><p>原文：<strong>有种生心地，因缘能发蒙；</strong></p><p><strong>　　　于缘不相碍，当生生不生。</strong></p><p>释：心地当中只要有种子存在，以第八识为出生的因，加上种种的外缘，种子就萌发，发芽结果。种子与外缘不互相妨碍，它们相互依存，第八识才能结出果实，才有众生的业报。当众生受报的缘具足，应该出生时，第八识就生出众生的五阴世间，虽然生了，也是没有真实地出生，都是虚假相罢了。</p><p><strong>十九、十九祖鸠摩罗多传法偈</strong></p><p>原文：<strong>性上本无生，为对求人说；</strong></p><p><strong>　　　于法既无碍，何怀决不决。</strong></p><p>释：自心本性，本来无生，这些道理只对求法人说，七识妄心有所求，闻法后能够信解受持，真如无求，说也无用。因为真如对于一切法都无所得，所以祂不修行，祂的心中，不会对法生起决定心与不决定心，不会信解又受持。有所求、要修行的是七识妄心，有所得的是七识妄心，能成佛的是七识妄心，真如与这些都毫不相干。</p><p><strong>二十、二十祖闍夜多传法偈</strong></p><p>原文：<strong>言下含无生，同于法界性；</strong></p><p><strong>　　　若能如是解，通达事理竟。</strong></p><p>释：众生的语言是生灭法，未说之前，无住处，说了之后即灭去，因此是虚妄不可执的。但是在语言当中却有大乘无生理在，没有这个理体，也就没有语言的产生。这个不生不灭的真如心体，就是一真法界，那么语言依止于这个真如心，即是不生不灭的法界性。如果能够这样理解一切法与真如之间的关系，那么对于世间一切事与真如理就都已经通达了。</p><p><strong>二十一、二十一祖婆修盘头传法偈</strong></p><p>原文：<strong>泡幻同无碍，云何不悟了；</strong></p><p><strong>　　　达法在其中，非今也非古。</strong></p><p>释：三界世间如同梦幻泡影，了不可得，虽然如此，并不障碍一实真体的永远长存和显现运行。云何还不明悟，这些虚妄法都是由于真如心体的作用而有，本质也是真如的一部分。如果能通达虚幻的世间法，其实质都是真如，都是一真法界，那么也就明了，真如不分古今，没有新旧，没有年龄，从来不生，永远不灭，亘古而又弥新。</p><p><strong>二十二、二十二祖摩拏罗传法偈</strong></p><p>原文：<strong>心随万境转，转处实能幽；</strong></p><p><strong>　　　随流认得性，无喜复无忧。</strong></p><p>释：自心真如随于众生的心境和世间各种境界而运行着，从来没有间断过。真如在随万法流转的过程当中，确实是幽隐难觅的，因缘不成熟的众生只能认各种妄法为真，不知当中有真实的自心本性存在，更不知祂是如何运转一切法的，不知道一切法都是自心真如所出生和执持的。众生因缘成熟时，就能随着各种业流识得那个没有业缘和生死的自心本性。</p><p>自心虽然随于生死业流，却清净无为，永远不变异，永无染污，那就是真实的自己，也是成佛的真体。祂虽然随于生死业流和无明流，却是无喜也无忧，没有心境的变化，没有感触和感慨，随缘自在。那么五阴的我，随顺于真如的体性之后，慢慢也会对于出现的一切境界，也无喜又无忧，无烦又无恼，随缘自在。</p><p><strong>二十三、二十三祖鹤勒那大士传法偈</strong></p><p>原文：<strong>认得心性时，可说不思议；</strong></p><p><strong>　　　了了无可得，得时不说知。</strong></p><p>释：当我们通过修行，明心证悟，认得自己的本有心性时，才知道这个心性确实是不可思议的，众生无论怎样用识心意识，情解思量，也思量不了祂，祂的体性是那样微细难知。虽然认得了自己的心性，这个心性也了不可得，祂是自己本有的家珍，一个老古董，因缘具足时，才能从自身中挖掘出来，非从外得，非是他人给与。当我们认得祂时，也不能说把祂的全部体性都了知了，也只是知道个总相而已，其余的更多更深细的体性，要待今后的修道过程中，再一点点地探索挖掘出来，最后才能获得一切种智，圆满佛道。</p><p><strong>二十四、二十四祖师子尊者传法偈</strong></p><p>原文：<strong>正说知见时，知见俱是心；</strong></p><p><strong>　　　当心即知见，知见即是心。</strong></p><p>释：当我们发表言说、知见、看法时，这些语言知见，全部都是从自心当中流露出来的，都是自心所显现的功德利用，全体都是自心，不一不异于自心。正当我们的知与见形成时，自心当中的一部分种子功能形成了知与见的分别作用，就像一块黄金打造成了戒子，而不失黄金的自体性，又有戒子的功用。自心也如是，流转为知见，不失其本具体性。戒子由黄金而造，知见由自心生出，戒子全体就是黄金，黄金不都是戒子；知见全体都是自心本性，自心不都流转为知见。</p><p><strong>二十五、二十五祖婆舍斯多传法偈</strong></p><p>原文：<strong>圣人说知见，当境无是非；</strong></p><p><strong>　　　我今悟其性，无道也无理。</strong></p><p>释：所谓的圣人，没有一点凡夫性。真如这个圣人与七识这个凡夫和合产生一切法，当祂们一起产生各种知见，用语言描述出来时，这些语言境界、言行、知见无对无错，无是也无非。说它是，却是七识的造作活动，说它非，却是真如之所显现，全体都是真如。我如今悟得真如的体性时，知道真如中本没有任何道和理。就像心经中所描述的真如：无色受想行识五蕴、无六根、无六尘、无六识、无十二因缘、无四圣谛、无菩萨六度、无智也无得。真如这个空相中真的就没有这些道和理，但不妨又把这些道理全部都不费吹灰之力的显现出来。</p><p><strong>二十六、二十六祖不如蜜多传法偈</strong></p><p>原文：<strong>真性心地藏，无头也无尾；</strong></p><p><strong>　　　应缘而化物，方便呼为智。</strong></p><p>释：如来藏是众生心地宝藏，自性为空，却含藏无量功德性能，能圆满成就一切法，圆融一切法，无有障碍。自体无形也无相，无头也无尾，无长短方圆大小青黄赤白，应万缘而能变化出生万事万物。具足无量的智慧，却不是七识心的那种世俗智慧，为了区别于世俗智慧，区别于识心聪明伶俐的分别性，诸佛只能为如来藏自性清净心起个别名，叫作智。那么众生就能分清七识的识心分别慧，和如来藏的无分别的智，二者体性迥然不同，一个是世俗识心，一个是脱俗超然于世外之真如心。</p><p><strong>二十七、二十七祖般若多罗传法偈</strong></p><p>原文：<strong>心地生诸种，因事复生理；</strong></p><p><strong>　　　果满菩提圆，花开世界起。</strong></p><p>释：自心清净宝地含藏地水火风空识六大种子，也含藏众生的善、恶、无记三业的业种。这些业种缘熟，自心如来藏就依据业种分别输出地水火风空识大种，产生诸法，一切事相就出现了。这些事相的运行及结果，又作为种子存入自心宝地中，将来再生出新的事相。众生都是在自心田地中播种、发芽、开花、结果，事事不同，果果不同。修行之人，生生世世修行之果，越来越殊胜，越来越接近佛果。当这些修行之果达到圆满，菩提大道的修行也就圆满究竟了，菩提种子就会从心地里出生、发芽、开花、结果，三千大千世界佛国土就能真正建立起来了。</p><p><strong>二十八、二十八祖菩提达摩传法偈</strong></p><p>原文：<strong>吾本来兹土，传法救迷情；</strong></p><p><strong>　　　一花开五叶，结果自然成。</strong></p><p>释：我本来到东土震旦，来传佛祖一实相心法印，以此救度那些还在迷惑颠倒中，不识本心的有情众生。等到禅宗传到第六代祖时，禅法自然就会形成五个法脉。</p><p>达摩祖师偈一花开五叶，是指禅宗这一法脉，传到六祖这里以后，分成五个流派，分别是：临济宗、云门宗、伪仰宗、法眼宗、曹洞宗。结果自然成，意思是由于禅宗一直传下去，后世自然会有无数人得道。这五宗法脉，自然会把禅法一直流传到后世，永不断绝，使大乘实相法广泛流传，得度者无数，能够潜通心法，秘密证得实相心的人，千万有余。</p></div>"
},{
    "title": "第三章　东土六祖传法偈",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第三章　东土六祖传法偈</strong></p><p>初祖为达摩祖师，其传法偈在上章已释义完毕，这里不重复讲。</p><p><strong>一、二祖慧可禅师传法偈</strong></p><p>原文：<strong>本来缘有地，因地种华生；</strong></p><p><strong>　　　本来无有种，华亦不曾生。</strong></p><p>释：本来一切法都是缘于真实存在的那个心地才能有，因为有自性心地，业种才能转化为花报。但是自性心地中本来没有业种，是空空的自性清净心，因此一切花报都不曾出生过。</p><p><strong>二、三祖僧璨禅师传法偈</strong></p><p>原文：<strong>华种虽因地，従地种华生；</strong></p><p><strong>　　　若无人下种，华地尽无生。</strong></p><p>释：花的种子虽然是因为心地才能有，从心地的种子当中花报才能出生；但是如果没有人造业种下种子，尽大地也不会生长出一枝花。无业则无种，无种则无花。</p><p><strong>三、四祖道信禅师传法偈</strong></p><p>原文：<strong>华种有生性，因地华生生；</strong></p><p><strong>　　　大缘与性合，当生生不生。</strong></p><p>释：花的种子有生发性，但要借助于自性心地才能生生不已。七大种子的缘，与自性结合在一起，就能出生一切法，一切法虽然出生了，实质却是无生，生而不生。</p><p><strong>四、五祖弘忍禅师传法偈</strong></p><p>原文：<strong>有情来下种，因地果还生；</strong></p><p><strong>　　　无情既无种，无性亦无生。</strong></p><p>释：有心的有情众生造作业行就种下了种子，这些种子种在心地里，将来因为心地，借助于心地生出果实。没有心的无情物就不会造作出种子，无情物没有自体性，因此也是无生的。</p><p>有情，是指众生，众生有第八识，有五蕴或者四蕴，有识心的活动，有寿命，是生命体。无情，就是无第八识，无七个识，无五阴，没有识心的分别活动，不是众生。因地，是因为有第八识这个心地，才能收获果实。在有情众生身上播下法种，这些种子因有第八识来存储，将来缘熟时，第八识输出种子，果报就形成。在无情物身上播种，就没有用，因为无情物没有识心接纳领受，也没有第八识来存储法种，就永远不能开花结果。一切法，不管是有情还是无情，因为本身没有自体性，因此不会自己出生自己，都要因为第八识依各种缘来出生和显现。</p><p><strong>五、六祖慧能禅师传法偈</strong></p><p>原文：<strong>心地含诸种，普雨悉皆生；</strong></p><p><strong>　　　顿悟华情已，菩提果自成。 </strong></p><p>释：众生心地中含藏着一切法的种子，这些种子遇缘才能出生一切法。学佛修行的人只要顿悟了有情众生的五阴世间花报是如何出生的，菩提果就自然而然成就了。</p></div>"
},{
    "title": "第四章　六祖的五个何期自性略解",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第四章　六祖的五个何期自性略解</strong></p><p>六祖大悟时悟明真心，观察真心的运作，深有感触，说了真如自性的五个特征，内容如下：</p><p><strong>何期自性本自清净；何期自性本不生灭；</strong></p><p><strong>何期自性本自具足；何期自性本无动摇；</strong></p><p><strong>何期自性能生万法。</strong></p><p>以上所说的五个何期自性，是六祖在听闻五祖为他讲解金刚经悟道时而说的悟道偈，表明六祖悟的很深很透。其中自性本自清净，这是悟的如来藏的本体清净体性；自性本不生灭，这是悟的如来藏本体的不生不灭体性；自性本自具足，是悟的如来藏含藏一切法种子、具足一切法种子的体性；自性本无动摇，悟的如来藏不随万法而改变自己，随缘不变、不变随缘的体性；自性能生万法，这是悟的如来藏能出生一切法的体性。</p><p>六祖这几句话，证明六祖悟时就有了别相智，当时就能观察到如来藏出生五阴世间，如来藏在五蕴的运作中不随五蕴而动转，这个智慧是很深的，有前世多生多劫证悟的基础，今世证悟才能如此之快，如此之深。具体解释如下：</p><p><strong>一、何期自性本自清净</strong></p><p>原来这个自性心本来就是这样的清净，不是后天人为给祂修清净的。自性如来藏为什么本来是清净的？因为祂不对六尘境界的具体相貌，不了知六尘境界为何物，不别六尘的好恶是非长短方圆，因此在运行六尘境界时，永远不起贪嗔痴烦恼，也不起念想，不自作主张。祂了别业种时，也不知道这个业种善，那个业种恶，虽然了别了，还是不知道好恶，因此祂对业种不做选择，才能平等的实现业因果报。祂了别业种以后，随顺业种，输出四大种子七大种子，造佛身、造人身、造地狱身、造天宫，也造污秽物，善恶美丑祂一视同仁都不分别，全部都造就和执持。</p><p>祂的心是如此的清净，法尔如是的不分别是非好丑的运行着一切法。祂知道往何处输送四大种子，以什么样的比例，输送多少，输送多长时间，祂都知道。也知道在什么时候造什么物质色法，比如众生在母胎里，什么时候应该造头、造耳朵、造鼻子等等，在哪里造，安放在哪个位置上，什么形状的，什么颜色的，祂都知道，然而对这一切法祂又不起分别。</p><p>我们想想祂有多奇怪，又是多么的神秘，无量劫以来一直就是这样运行着。祂知道造就众生的身体时手安放在哪里，内脏器官是什么样子的、多大的，皮肤是什么样的，祂都顺其自然的一一造就出来。五阴色身，无论是造人、造畜生、造恶鬼，祂都能根据业种，就那么制造出来了，丝毫不错乱，祂就是这么神奇。</p><p>如来藏的神奇性简直不可思议，祂能顿现三千大千世界和无数分身意生身，祂要顿时输出无量数心体里的四大种子，才能顿时成就无数的意生身，造就一个三千大千世界。祂心体里七大种子的数量是不可计数的，也是不可想象的。比如八地菩萨生一念要分身无数，如来藏马上就变现出无数的色身出来，如果八地菩萨生一个念要变现一个三千大千世界，如来藏也能马上变现出一个三千大千世界来，一弹指顷的时间里，三千大千世界就变现出来了，无量数的分身也可以同时变造出来。如来藏到底是如何输送的地水火风四大种子呢？如此的快速，如此的神速，我们根本思议不了这件事。但是无论造就多少大千世界和多少物质色法，如来藏从来都不贪着，无比的清净。</p><p><strong>二、何期自性本不生灭</strong></p><p>原来自性清净心本来就是不生不灭的，不是后天人为让祂出生的，后天人为也不能毁灭祂。自性如来藏的本体是不生不灭的，为什么祂是不生的呢？因为如来藏不用出生，本来就存在着，世出世间没有出生祂的那个法，祂不依赖任何法而存在，而所有法却都依赖于祂才能存在，不管其他法有与无，祂本自存在，不受影响。如来藏永远不灭，祂自己不能自动消失，也没有能消灭祂的法，祂就是一个金刚不坏体。</p><p>如果如来藏能灭，那么一切法也就随着一起都消失殆尽，无有遗余，那么众生的五阴十八界马上就灭绝，连个影子也不存在了；十方世界马上就消失，一切世界就都不存在了，连个静悄悄也不存在。一切法都灭绝之后如来藏要如何出生呢？有什么法能生如来藏吗？没有任何法能出生如来藏，因为世界没有了，没有任何一个法存在，如来藏就不能被出生，如来藏不出生，一切法也永远不会再出生了，从此以后，真的就连静悄悄也没有，连个死寂、空寂也没有，连个虚空也没有，因此如来藏是不生也不灭的。</p><p><strong>三、何期自性本自具足</strong></p><p>原来自性清净心本来具足了一切法，一法也不缺，因此随缘能出生一切法。为什么如此呢？一切法的种子都在如来藏里，全部具足，一法也不少。如来藏里含藏着一切法的种子，要什么法有什么法，善法、恶法、不善不恶的法、佛法、外道法、五阴的法、六道众生的法、十方世界的法、三界里的一切法，这些法的种子祂都能输送出来，然后依种子出生一切法。</p><p>意识心如何才能观照出如来藏本自具足一切法、含藏一切法、变现一切法呢？首先要证得如来藏，证得以后有了般若大智慧，就能在禅定中一点点观察如来藏在五蕴身中的运作，这样就能把五阴世间法的出生观照出来。明心证得如来藏时，知道如来藏是如何起用的，慢慢观察祂的运作，就能知道祂有这样的法，祂有那样的法，祂有这方面的智慧，祂有那方面的智慧，祂在此处是这样运作的，祂在彼处是那样运作的，祂是这样产生这个法的，祂是那样产生那个法的。</p><p>悟后慢慢地就知道了如来藏的功能、德能、性用都是什么，后得智慧就生起来了。后得智圆满具足，就出生道种智，如来藏所具有的功能作用证得的越来越多了；祂含藏的所有法的种子，都有什么功能作用证得的越来越多，最后全部都证得了；这些种子是如何变起三千大千世界的，如何创造众生的，也都知道了；世间里的法，一接触到，就知道来龙去脉，里面运作的细节都是什么，也都知道了，这时就具有了一切种智，就圆满成佛了。</p><p>成佛时，世出世间法没有一法愚昧不懂，全部都了知，因为一切法的种子佛都证得，都知道了。佛见到某个人，这个人的来龙去脉，无始劫来的情况，无始劫以后的情况，全部了知无余，每一个非常微小的细节都不会错过，此人为什么有现在的果报，以后还有什么果报，从前有什么果报，经历过什么人和事，家族、眷属都有哪些，无始劫以来造过什么业行，佛全部了知，没有一法是佛所不知的。</p><p>一棵非常庞大的树有多少片叶子，树的历史年龄、年轮、生长的种种情况，佛全部都知道。三千大千世界里下雨，总共有多少滴雨，佛都知道；十方世界每个众生的善根福德时节因缘，所起的心念，佛都知道。每个众生什么时候善根成熟，佛都知道；对某些人什么时候应该讲什么法，如何度化，佛都知道。</p><p>众生有什么要求，为什么会在六道里生死轮转，什么时候轮转到哪里，佛都知道，世间里所有的法，佛都知道。即使佛没有做人，不到世间做人，人中的一切事情，佛也全部都知道，人间的一切科技，什么汽车飞机火箭的制造运转的原理，那都是小事，不值得一提。人类搞科学、搞研究、搞创造发明，佛都不用，也不用思惟，一切事情全部了知，因为佛有现量智慧。</p><p>人间制造个飞机火箭宇宙飞船，就已经是高科技了，可是佛一念间就能变现大千世界，包括大千世界里所有的物质色法，更不用说人间的飞机火箭之类的东西，佛的一念，全都能变现出来。所以只要能学佛修行，福德具足，如来藏里所具有的一切法的种子，全部都能转变成一切法，一切法都会现前。但是这样的修行需要断除一切的贪爱，三界世间法都不贪爱和执著，就具有了大福德，一切法都会圆满现前，随心所欲。越贪爱，心量越狭小，福报越不具足，越贫穷，越舍越得，不舍不得，只有舍下一切，大智慧大福德才能出现，五蕴才能具足一切法，最后如来藏里一切法的种子，都能随意而用。</p><p><strong>四、何期自性本不动摇</strong></p><p>何曾想，原来自性是不随万法而动转的，因为不随万法而动摇的，在一切境界面前永远是如如不动的。如来藏在三界万法中运行，从来不随境界转换而转易其心，当喜事出现时，祂不喜；当可厌事出现时，祂不厌；当五阴生气的时候，祂不生气；当五阴发财升官，或者失财、受苦难、下地狱时，祂没有什么看法，这一切跟祂都没有关系，一切法来临时，祂都不动摇。为什么呢？因为祂不知六尘境界为何物，祂不具体分别六尘境界的善恶美丑和是非，祂不知道六尘境界如何，好坏都不知道，祂是一颗不知好歹的心，所以才不随境界的好歹而动摇。</p><p>祂如果知道好歹，就会跟着好歹左摇右摆而动摇了，如果知道好歹，祂肯定要起心动念，比如七识想杀人，祂就不能让七识杀人了，也许还要把七识灭掉；七识想造恶业，祂知道了，就说这不好，祂就不能让七识造恶业；好听的声音来了，难听的声音来了，祂就要随之而动摇，随着六尘境界动转起来；可是祂不分别六尘，就不随六尘动转。七识渴了，祂不渴，七识喝完水解渴了，祂也没感觉，这些跟祂完全没有关系。</p><p>如来藏虽然能在一切法上运作，可是从来都不随着一切法动转，不起心动念，心不随着境界转，那我们七识随不随境界转呢？当然转了，色身好时七识是一个状态，色身不好时七识又是一个状态。喜欢的东西现前了七识是一个状态，不喜欢的东西现前时七识又是一个状态，我们的六七识心都是这样随着六尘境界飘摇飘动，如来藏却从来都没有动摇过，祂是永远不会动摇的。</p><p>七识学佛时，觉得学佛法能得解脱，有真实受用，佛法真好，可是如来藏对此根本没有什么感觉，学佛得解脱这件事与祂无关，所以祂不随着一起学佛，七识造恶业时，祂也不随着造恶业。七识下地狱受苦时，祂不受苦。七识生天享福，祂无所谓，也不随着享福，祂永远对一切法都不动摇，既不欢喜，也不嗔恨厌离。</p><p>众生下地狱时，祂也不会说，赶快从地狱这个鬼地方出来吧，祂没有这样的想法，祂如果有想法，赶快脱离色身就完事了。但是祂从不舍众生，因为祂不知道好歹，永远随逐着众生不舍离，祂也不知道众生的色身是地狱身，心里没有任何概念，也不知道地狱的苦，完全是舍受。</p><p><strong>五、何期自性能生万法</strong></p><p>何曾想原来自性清净心能出生万法，一切法都由祂出生。如来藏生万法生五蕴，只有证得如来藏以后，才能现观到，没有证得之前，都是学语、猜测和臆想。明心以后，现观如来藏在五蕴身中运作的时候，就能观察出如来藏是如何出生五藴的，如何出生所见的色，如何出生所听的声，色声香味触法都是如何出生的，这时也就知道了如来藏是如何出生万法的。如来藏出生三千大千世界，悟后相当长一段时间都观察不到，地后菩萨有甚深极甚深的道种智，才能慢慢观察出来，这时不知道已经修到几地菩萨了。</p><p>悟后只能一点点的观察出如来藏能出生五藴，出生十八界，出生色身的大致情况，再具体一些的就观察不出来了。很多深法不是短时间能观察出来的，需要修行到有更深的智慧的时候，才能观察到一些，修到入地以后，初地、二地、三地、四地以后，观察出来的法越来越多，越来越深细，越来越广大，最后全部都观察到，就成佛了。</p><p>刚开悟时能观察出的法都是很粗浅的，随着智慧和禅定的增加，观察出来的法就会越来越深细，智慧越深的时候，领悟和观察出来的法越深细，越具体；没有智慧的时候，只能懂个大概，一点也深细不了，深法细法代表着深细的大智慧。</p><p>内心没有智慧，修行没有入门的时候，说法就是空喊口号，没有具体的修行入手处，因为没有修持出来，对于具体修行没有经验，没有智慧，只能空喊口号，说些不切实际的语言。真正修持出来以后，走过那段路，就能有一个很清晰的路线，能引领他人随后走过来，具体一步步的修行都能指导别人，根本就没有必要再喊口号了。</p><p>以上是对六祖五个何期自性的简略解释，如果有人觉得自己悟了，那就可以对照一下六祖的悟道偈，检查一下自己所悟是否与六祖悟的一致，这样才能不生误会，不会自误误人。</p></div>"
},{
    "title": "第五章　六祖坛经部分段落诠释",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第五章　六祖坛经部分段落诠释</strong></p><p><strong>一、六祖曰：善知识！所谓无，无的是甚么事呢？所谓念，念的是甚么东西呢？所谓无，就是无差别相，无一切妄见尘劳的心；所谓念，就是念真如自性。真如就是念的体，念就是真如的用。真如自性能起念，不是眼耳鼻舌等器官能念。</strong></p><p>释：六祖说：善知识，我们通常所说的无，应该无什么呢？我们通常所说的念，应该念什么呢？修行人心中应该无那些诸法差别相，不要去分辨此法高彼法低，应该无有高低善恶是非美丑相，应该无有一切虚妄的分辨尘劳烦恼的心行；修行人心中应该时刻念着真如自性，而不要念着尘劳烦恼相。真如就是能念的本体，而念就是真如的用，有体就能起用，有用就有体。真如自性也能起念，祂所念的，与六识用六根所念的不同，六识念色声香味触法，而真如不念这些法，真如所念的法，六识念不了。</p><p>真如本有自性，所以能随缘起念，真如起念，万法必现。真如如果没有自性，眼色耳声当下就会消失散坏。无差别相就是指万法皆真如所变，与真如不一不异，也都是真如相，无世间诸法相。妄见尘劳的心就是七个识的妄心，既然是妄，就不是真实的，虚幻的、假的、非真有。妄心能念真如，念就是有真如的体在起用，没有真如妄心就不能念，真如就是念的体，体是本体，实有之体。真如起用，妄心就能念，所以念是真如的用。</p><p>真如自己起念时，和六识念的不同，六识念六根六尘，而真如念一切法，又不落入一切法的相貌中。真如也念七识，继而配合七识来运行一切法。真如有真实的自体性，真实存在，祂若不存在，六根和六尘当下灭亡，也不存在。更不用说产生六识了。</p><p><strong>二、大通和尚问智常：如何是本心本性？大通和尚说：汝见虚空有相貌否？汝之本性犹如虚空。返观自性了无一物可见，是名正见，了无一物可知，是名真知。无有青黄长短，但见本源清净觉观圆明，即名见性成佛。也名如来知见。六祖批驳他说：不见一法存无见，大似浮云遮日面。不知一法守空知，还如太虚生闪电。此之知见撇然兴，错认何曾解方便。</strong></p><p>释：大通和尚问智常说：什么是本心本性？大通和尚说：你看见虚空有相貌吗？你的本性就如虚空一样无有相貌。你反观自己的自性，根本没有一物可见，见无所见叫作正见，没有一物可知的才是真知。不见有青黄长短，只见本源清净，觉观圆明，就是见性成佛了，这也叫如来知见。</p><p>六祖批驳他说：如果说不见一法才是见，心里存着一个无的见，恰恰是天空中的浮云遮挡住了太阳。心里一法不知，守着一个空的知见，也就像太虚当中划出一道闪电。这样的知见撇然出现，就是一种错见，还不知道诸佛诸祖的教法。</p><p>大通和尚说自性犹如虚空一样一无所有，这是落在一无所有的无上，否定自性的真实体性。自性不是像虚空一样一无所有，祂是实相，是真实的相，虽然是无相，但是体有，有体才能有一切法的用，没有比祂更真的了。祂那里有多少的种子功能作用，不可能像虚空一无所有。了无一物可见就是见真如本性，这个知见是邪见，不是正见，正见能见到真如运行的行相。了无一物可知，是邪知，真知能知真如的一切功能作用。</p><p><strong>三、六祖云：自性具三身，发明成四智。不离见闻缘，超然登佛地。</strong></p><p>释：在这一段里，六祖把法身、报身、应化身也讲得很清楚了，既然有法身，就能产生报身和应化身，也能产生众生的六根、六尘、六识，即能产生我们所接触的一切事法和理法，也就是万法、千万法、无量法。既然能产生这些法，说明真性不是一无所有的空，祂是真实存在的，有真实作用。依佛的三身而有佛的四智圆明，大圆镜智就是法身真如，平等性智就是意根第七识，妙观察智就是第六识，成所作智就是前五识。</p><p>佛也有八个识，一样不少，前七个识就是被真如所生，有生就是生灭性的，就是虚妄的。佛用这些妄心分别所有的法，以此利乐众生，广度有缘。佛不是只有一个真如，也不是不分别一切法，有七识心就是要分别一切法，而且佛是善用这些分别，众生是恶用。</p><p>自性就是法身佛，佛有三身，并不是空，不是一法也没有。四智由八个识转成的，也并不是空和没有。有见有闻还有因缘，还是有见闻觉知心，有因缘所生法，并不是把因缘法都废掉不用。</p><p><strong>四、六祖曰：断除烦恼重增病，趣向真如也是邪。</strong></p><p>释：邪正判断的法则依据是，这个法是真实永远不变的根本法，还是不断变化的虚妄法。根本法是正念，虚妄法是不正法，能灭的法，方便说为邪。那么就看断除烦恼这个法是根本法，还是后天出生的虚妄法。烦恼是后天而有的虚妄法，断除烦恼的心和行为是后天而有的虚妄法，是七个识想要去断除烦恼，这个行为是七个识所做的。</p><p>真如心从来没有烦恼，也不想断烦恼，更不去断烦恼。那么断除烦恼这个法就不是正法，是一种病态的心所为，有贪嗔痴烦恼的心才想断烦恼，当然是病态。趣向真如也是邪，是谁趣向真如，求证真如，皈依真如？当然是七个识的妄心，妄心不是本来而有的，那就不是正，方便说为邪。悟道的人证得了真如，但人不是真如，真如是真如，众生是众生。有人说无烦恼可断，还说得过去，但说无真如可趣，就是断灭见，是邪见。</p><p>有人说安详即真如，而安详不是真如，真如没有安详不安详之说，祂不对六尘境界，没有觉受，因此就没有安详。只有众生的意识心对六尘境界，才有安详有不安详。真妄不可混淆，真如就是真实而如如性，不是如真，如真的意思是好像是真的像真的一样，而真如就是真的，没有好像。</p><p>佛住世时证得的是无住处涅槃，不住在涅槃境界里，而是总现出佛的色身来利乐众生，不像阿罗汉把五蕴十八界都灭掉不要色身了，佛慈悲怜悯众生，不为自己享涅槃乐而不顾众生苦。</p><p>有余涅槃是三果四果罗汉们证得的，是说阿罗汉们还有个身体存在着，因为有这个身体，就有一点苦受存在，风吹日晒，蚊虫叮咬，疾病侵袭等等。灭去五阴十八界以后，就入无余涅槃，苦也没有依赖的，就没有苦受了。而佛永远也不取无余涅槃，并且告诫菩萨们也永远不能取无余涅槃，因为入无余涅槃就不能自利修行，也不能利他度众。</p><p><strong>五、六祖曰：佛法只谈见性，不论禅定解脱。因为禅定解脱是二法，不是佛法，佛法是不二法。</strong></p><p>释：我们本有之性，本身就有定，祂常在定中，从来没有出过定。如果另外再修个定，这个定就是觉知心妄心的定，不是真如之本来定，后修的定与真如的本来定，是二种定，不是一种定，因此后修的定就是别于真如的二法，不是真如本具之法。</p><p>解脱也如是，真如本身就是解脱的，没有无明可以束缚祂，没有生死能够束缚祂，祂不求解脱，觉知心妄心才要求解脱，并且也能求得解脱，因此觉知心的解脱与真如本来而有的解脱，就是二法，因此觉知心的解脱就不是本具的佛法。</p><p>佛性就是如来藏所生起的妙真如性，众生所接触感知的一切法，都是佛性，都是如来藏的妙真如性，并没有实质的事物存在。佛性在六根触六尘时显现出来，因此是常存，但是如果缺少一根或者这个根不触尘，没有识出来了别，佛性就不在这个根上显现出来，而在其它根触尘当中显现，因此佛性也非常。</p><p>虽然非常非无常，佛性永远也不断。佛性在善法上显现，在恶法上也显现起妙用，因此佛性就是非善非不善的。五蕴与十八界，凡夫当作是二法，见道的智者了达，都是如来藏的妙真如性，都是佛性，因此也是不二法。</p><p><strong>六、六祖曰：心平何劳持戒，行直何用参禅。</strong></p><p>释：心平，就是对待世间一切人事物理，平等对待，一视同仁，不分善恶、好坏、是非、对错，不分性别、年龄、种族、文化、权势、地位、穷富，不管是佛还是地狱众生，不管造善还是造恶，不管胜境天宫还是劣境地狱。通通平等对待不分别，一视同仁。</p><p>怎么平等对待呢？对待这些法一律按照因果律则如实显现，如实实现，需要给与什么就给与什么，做恶给与做恶的种子，做善给与做善的种子，造天宫给与天宫的种子，造地狱给与地狱的种子，丝毫不犹豫，不采取主观的喜厌的行为造作，没有主观能动性。对待佛是如法供养，对待恶道众生也如法供养，善行也助，恶行也助，平等相与，然后平等如实做记录，又平等如实地实现果报。</p><p>这个心没有主观能动性，也不想特意造作什么，祂没有自己的想法，完全随缘，因此祂就不用去持什么戒行。有心才用持戒，无心就不用持戒。这就是心平何用持戒的真实含义。那么这个心是哪种心呢？观行一下，我们的妄心七转识能做到这样吗？这个七转识无论修到多么清净，如何的不分别，也做不到。</p><p>因为七识心从来都是要分别的，其体性就是有分别性。如果让七转识不去分别，那么世间该怎样安立，五阴身该如何生存？佛道该如何修行和完成呢？妄心如果随缘，随善缘造善业，随恶缘造恶业，那什么时候能修持成就得解脱呢？妄心如果造善也随喜，造恶也随喜，不去惩恶扬善，不主动助善灭恶，世间又会是怎样的，自己又怎么能谈到修行呢？其它方面，仔细思惟就能知道。</p><p>那么真正的平等心就不是妄心七转识，能够随一切缘的心就不是七转识，不用持戒的心就不是七转识，因为即使修到几地菩萨境界，也需要持戒，也还有定共戒和道共戒。排除七转识心，就是真心如来藏，祂确实具足这些功德和体性，又平等又随缘又不用持戒。</p><p>行直何用参禅。是谁的心行最直呢？能够如实地实现一切因果，毫不含糊，一切事情该如何，就让它们如何，世间该是何种样貌，就现何种样貌。五阴身该是何种形象，就现何种形象。对待一切人事物理，没有婉转屈曲心行，不会转弯抹角的掩盖什么、称扬什么。祂总是按照事实真相去行持，去履行自己的职责。这是什么心呢？妄心七转识做不到这样，妄心七转识总想改变什么，总是希望一切人事物理能够按照自己的认知和意图去展现，符合自己的思想意志才欢喜。</p><p>而真心如来藏却不是这样，祂没有自己的主张和知见，该怎样就怎样，直直的。维摩诘经里说：直心是道场，真心如来藏就是个广大的道场，十方世界都在里许。</p><p>再来看参禅，参禅的目的是为开悟证如来藏，破无明。妄心七转识有无明，不知自己虚妄，不知真如心何在，需要参禅明心。真心如来藏没有无明，不需要破无明，因此自性如来藏就没有必要参禅悟道。所以行直何用参禅，是在描述真心如来藏的体性。六祖是个大悟者，对于真心如来藏的体性很清楚，他说法都是围绕着真如而说，宣说真如之理，决不在妄心七识上打转。</p><p>因为识得真如，了知真如心的体性，妄心就会自然而然地发生变化，就会逐渐地依止于真如心的体性，改变自己的心行。只要识得真如，烦恼就不是大问题了，三种无明早晚都会破尽，究竟成就佛道。头一步证真如如来藏是最难的，入了门里，就会做内行事，说内行话。才会渐渐与真如心相应，与佛心相应。我们应该善分别祖师意，善解法义，善于用心，善于行持。</p><p><strong>七、六祖曰：外离相即禅，内不乱即定。</strong></p><p>释：相包括五阴相色受想行识，十八界相六根六尘六识，六尘包括色声香味触法尘，宇宙及十方世界都是相，都在六尘中。思惟观行以后，就知道只有如来藏没有这些相，如来藏从外形形象上根本没有相，这就是外离一切相的含义。</p><p>内不乱，心不对六尘，不着六尘，就不分别，不起心动念，那么六尘境界现在面前时，如来藏心就是不乱的。而禅的定义就是真心如来藏，参禅就是参究如来藏，明如来藏心。那么外离相即禅，内不乱即定，就是在描述如来藏的体性。而定慧等持，定慧一体，都是在描述如来藏的体性。</p><p>整部六祖坛经，都在描述如来藏真如心的体性，这是毫无疑问的。大悟者与佛所说的法义不相违背，与佛同一鼻孔出气。不是像神秀和尚的渐修法门那样，需要七识妄心要降伏烦恼，要修戒定慧，时时精勤地看住自己的妄心不要造业行，不要起心动念。六祖的顿悟法门不如此说。</p><p>起修皆妄动，守住匪真精。修行是五阴身的妄心七转识要修行，因为七识心有无明，才要去修行，以破除无明。而如来藏本身是圆满究竟的，没有无明，因此就不用修行。那么修行的就是妄心七识，七识通过修行，去恶增善，恶业消灭，无明灭尽。</p><p>所以起修皆是七识妄心的行为，就是妄动，起心皆妄动。能守的心，守心守戒，不管守什么，都是妄心七识去守，真心什么也不守，祂不是守的心，因为祂没有执著性，又不对六尘境界，就没有什么可守的。所以守住匪真精，守住不是真心去守，就不是真精。</p><p><strong>八、六祖曰：自性觉源体，随照枉迁流，不入祖师室，茫然趣两头。</strong></p><p>释：自性清净心就是觉体，也是万法的源头，随着七识心的妄念而流转着，七识起心，祂就随着应对配合，随着五阴的身口意行而流转着，身口意只要有所为，祂就随着应对配合着五阴的身口意行。就这样白白地、无原无故地随着妄法迁流。自身无喜无悲又无忧，无有善来也无恶，不受苦来不受乐，既无所得也无失，既不取来也不舍。</p><p>如果不进入祖师室，得以明心，找到那生命的源头，识得不生不灭的真体，就会永远茫茫然然地落在有和无、断和常、生与灭的两种极端之中，趣向于六道生死轮回，不脱烦恼，不得解脱。由此可知，觅得真正的祖师随之修学，就会很快地顿悟觉醒，如果随着不通道的人修学，不觅真正有道的明师修学，结果不是落在生当中，就是落在顽空当中，不得解脱。要知道名师与明师，有着天壤之别，内涵本质不同，差异极大。</p><p><strong>九、六祖曰：一切诸法若无常者，即物物皆有自性，容受生死，而真常性有不遍之处。故吾说常者，正是佛说真无常义。</strong></p><p>释：自性产生了一切法，一切法的本质也是自性，自性是常的，一切法依于自性而说也就是常的。如果一切法是无常，一切法就有自体性了，能够自生自灭，就不是自性所出生的，也不用自性来出生了，那么自性就有不遍之处。然而，这是不可能的，所以一切法依于自性而说，都是真如自性的常性。如果说有一法是无常，那么这一法就有其自体性，因为有自体性才有生死之说，那真如岂不是就有不遍之处了，有不能出生的法了。</p><p>一切诸法依于真如自性来说，都是真如性，不生不灭。因为这些法都是真如自性所生，都具有真如性，因此一切法也是常存不灭的。只要有真如自性，就会总有一切法的出现，如果一切法都是无常的，那么灭了就不能再出生了，不能出生，就说明真如自性不起作用，不能产生法了，那就是真如自性有不遍之处。然而这是不可能的，真如自性遍一切处，一切处一切法都是真如自性，有一切法就有真如自性。况且，真如中本有种子不生不灭，永远长存，只要遇缘，就会生出一切法。</p><p>六祖说的意思是，一切諸法如果是无常的，那么一切的事物都会有自体性，这些事物就能够自生自灭，生灭不息，那样就不用真如自性来出生，自性就有不普遍之处，这是违背经义的。所以六祖说的一切諸法是常的，正是佛所说的真实的无常的义理。一切諸法是常的，就表明了一切諸法都是自性所生所显，那么一切法就没有自体性，因此就是无常的。</p><p><strong> 十、六祖曰：佛法在世间，不离世间觉，离世觅菩提，恰如求兔角。</strong></p><p>释：六祖的意思是说如来藏这个佛法，在五阴十八界这个世间中存在运行着，要想明心开悟找到如来藏，就要在五阴当中来寻觅，离开五阴世间就找不到如来藏了，那就不能开悟了。离开五阴十八界，没有三界世间，那么如来藏这个佛法怎么能发挥其功能作用呢？ 世尊在阿含经中的十因缘法中开示说：识缘名色，名色缘识。识与名色二者犹如束芦，互相依赖着而能显现出来，名色依如来藏而生，如来藏依名色才能显现出其功用，才能被菩萨们所发现和证得。坛经里六祖几乎没有离开如来藏讲过什么世间法，更不用说心灵鸡汤了。</p></div>"
},{
    "title": "第六章　禅宗祖师传法偈语",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>第六章 禅宗祖师传法偈语</strong></p><p><strong>一、黄檗禅师云：法本不有，莫作无见，法本不无，莫作有见，有之于无，尽是情见。</strong></p><p>释：这个法是指实相心，祂是空性的，空性心中一法也无，但不可认为祂不存在。实相心不是没有，祂确实存在，所以称为实相心。但也不可认为祂有什么相，有什么法存在。众生不理解实相心的空与有两种体性，不理解祂的中道性，就会落入两头，不是说祂有，就是说祂无，不能把有和无完美结合起来，因此所有知见都是意识心的情思意解。</p><p>不管我们认为真如是有是无，万法是真是假，这些知见都是我们意识心的看法。意识心即是虚妄心，各种知见就都是情见，不是真如之见。真如无见，真如无知，虽然无知无见，但又没有一法是祂所不知的，没有一法离开祂而能存在。所以知是妄觉，不知是无记。真如既不属知，也不属不知。</p><p><strong>二、庞蕴居士偈：心如境也如，无实也无虚。有也不管，无也不居，不是贤圣。了事凡夫易复易，即此五蕴有真智。十方世界一乘同，无相法身岂有二？若舍烦恼入菩提，不知何方有佛地。</strong></p><p>释：真心对一切境界永远是如如不动的，依真如而有的境界也就是如如不动的。真如既不是实，如境界可见，说祂实，却无相无形不可见，说祂虚却有真实的体性和作用，所以是无实无虚的。一切境界都是真如第八识所出生的，所以境界没有实体没有真实性，但是这些境界也不是虚假不存在的，虚相、假相还是存在的，本质上都是第八识的属性。真如心不落于有，也不居于无，既不是贤也不是圣。已经了了生死大事的凡夫对于此理很容易就了知了，知道自己这个五蕴身中有个真实不灭的智慧心。</p><p>十方世界都是同一真如佛乘，这个无相的法身真如岂有异？如果有人把烦恼舍弃了以后，想入到菩提真如心中，那就不知道什么地方才能有佛心真如了。因为佛心真如就是在烦恼之处显现出来的，烦恼即是菩提真如，没有烦恼就没有真如，真如也就无法显现出来了。</p><p><strong>三、赵州从谂禅师问南泉：如何是道？南泉曰：平常心是道。赵州问曰：还可趣向否？南泉曰：拟向即乖。赵州曰：不拟时，如何知是道？南泉曰：道不属知，不属不知。知是妄觉，不知是无记。若是真达不拟之道，犹如太虚廓然虚豁，岂可强是非耶？赵州言下悟理。</strong></p><p>释：南泉说的平常心是道，这个平常心真是平常普通，以至于众生不能发觉，祂离我们太近太密切了，才觉得自然就是如此，没有什么好奇怪的。吃饭、穿衣、走路、言谈语笑等等日常生活、五阴活动都是非常正常的，没有什么奇特；而且从无始劫以来一直如此，各个都如此，早已习以为常了，因此也就不去探究其中的奥秘了。那我们就要问：死人为什么就没有这些正常事呢？什么叫作死？什么又叫作活？众生从来不去探究自己的生命秘密，生生世世就这样迷惑颠倒下去。</p><p>实际上是这些大家都认为自然而然的平常事里，确实有个所谓的平常心存在着，众生才能有这些平常事，这个平常心就是成佛的真体，实在是很不平常，很奇特的。众生因为无知，才认为平常，有智慧的人，都在探究那个平常心的奥秘。越探究越有智慧，都探究清楚，一点疑惑也没有，无明灭尽，就成就圆满的佛道。众生对于这些平常事为什么不起疑呢？因缘还不成熟，定力不足，智慧还不够。因缘一到，必定会起疑情，发心去探究一切事情的来龙去脉，凡事都会问个为什么。因为有疑问，努力参究之后就能解决疑问，那时智慧就会大开。众生还没有修证上的智慧，因缘不到时，看一切都平常，并不奇特。</p><p>赵州问南泉：这个平常心我们还能趣向吗？意思是说：我们还能够追求祂趋向于祂吗？南泉说：拟向即乖。就是说：我们准备求证祂探究祂的心，就已经不是祂了，不是与祂同一个性质的两个心。那么追求探究这个平常心的心是什么心？当然是我们的意识心和意根这些妄心七识。</p><p>意根想探究解决生死问题，意识就去分别探究参禅，最后证得、明白了其中的奥秘。这些心行造作都是识心七个识的体性功能作用，真心不会有，祂不会起心动念，想探究自己，证得自己，祂没有这些作意和心行，祂所做的事，都不在这些方面。所以七识心的心行与真心的心行是不一样的，南泉才说个乖字，是乖离背离的意思，是不一样的意思。</p><p>赵州又故意问：如果不去探究追求祂，怎么能知道这个心是不是道呢？那我们现在就能够明白了，探究的心是六识妄心，不是道本身。南泉于是就说出了经典语句：道不属知，不属不知；知是妄觉，不知是无记。这是对于真心的如实描述，只是太简练了，所以很多人只会诵读，不知其内涵。里面内涵很复杂广泛，要说得清楚，就得长篇大论。</p><p>道不属知的知，是七识心的知，知六尘境界的知，真心不知这些。道不属不知，真心本身也有知，祂不是呆瓜，只要是识是心，就有识别性，所以真心第八识有知性，祂知的范围很广，很深细，七识心是没有办法做到的。真心知什么呢？大略地说，知一切法的种子，知众生的业缘，知七个识的心行，知众生的根身器界。然后才能输送业种，实现众生的因缘果报，输送识种，与七识心共同和合运作，使得众生有相应的五阴活动。</p><p>其中的细节极其复杂，没有能力一一细说，有些细节就是知道了，也不好对外讲明，因为会涉及密义。南泉说知是妄觉，当然了，众生的知，就是七识心的知，就是妄法，不知是无记，众生不知的时候，就是内心昏暗，睡觉或者昏迷或者入深定或者死亡，这些都是七识心的不知，七识心的无记法。南泉把真心的知与妄心的知，叙述的一清二楚，毫不混淆，悟道的禅师们，知道自己在说什么，往往听者尤其是现在的闻者，仍然不晓其理，不知禅师在说什么。</p><p>南泉接着说，如果真正通达了这个什么也不追求探究的心，智慧就生起了，心量就像虚空一样广大了，不会再很勉强而误会地说，道是什么，不是什么。因为内心很清楚地知道了，什么是道，道究竟是什么，不是什么。</p><p><strong>四、庞蕴居士问马祖道一禅师：不与万法为侣的是什么人？禅师说：待汝一口吸进西江水，我即向汝道。庞蕴居士一听就悟了。他悟了什么？就悟了这个不与万法为侣的，不是东西的东西。是什么东西呢？为什么不与万法为侣？</strong></p><p>庞蕴居士悟的是自性清净心。这个心不与万法为侣，因为如来藏没有色，不与色为侣，没有声音，不与声音为侣，没有香，不与香尘为侣，没有味，不与味尘为侣，没有触，不与触尘为侣，没有法，不与法尘为侣。如来藏没有六根，不与六根为侣，没有六识，不与六识为侣。如来藏没有四圣谛，不与四圣谛法为侣，没有菩萨六度，不与六度为侣，如来藏没有十二因缘，不与十二因缘法为侣，如来藏没有世间法，不与任何世间法为侣，世间都灭了，祂不灭，所以如来藏就是不与万法为侣的心。</p><p>又因为祂与万法不相混合，就是阿含经中所说的不相在，五阴十八界不在如来藏里，如来藏不在五阴十八界里，二者不是同类，不相混合，不是一个事物，不是一样的东西，所以混合不了。五阴灭，如来藏不灭，祂自己能够单独存在，不依赖任何一法而存在，就不与万法为侣。</p><p>马祖禅师开示庞蕴居士：待汝一口吸进西江水时，即向汝道。其实这已经道出来了，只是不是一般人意识思惟想象推理所能知的。庞蕴居士也是个伶俐汉，这时他就知道，那个会出来显现的，祂的智慧非比寻常。不是像我们现在的人认为说，自己根本喝不了西江水，更不能喝干，而放下了，放下就是悟。或者认为西江水也是我心变现，也是空，明白这个理就是悟，这样理解就是错误，不能悟得我们的如来藏心体，更不知道如来藏是如何产生五阴和万法的。</p><p>很多人每日也喝水，都当平常事错过去了，从来不知道这里是有奥秘的，这叫作日用而不知。赵州和尚平日告诉来拜访他的人说：吃茶去。大禅师言语都是有特别用意，别有用心，可惜一般人不解其义而白白地喝了一次茶又一次茶，最终都一无所获。我们就应该在喝茶时问一问自己，是谁在喝茶，喝茶的原理是什么？这样早晚有一天就能悟得其中的秘密。</p><p><strong>五、赵州开示云：至道无难，唯嫌捡择。才有语言，是捡择，是明白，老僧不在明白里。</strong></p><p>释：前两句是禅宗三祖的开示，意思是想要识得那个大道并不难，就怕你把能够进行思惟、选择、分析、判断、推理、识别等等心里活动的意识心当作大道，那就南辕北辙了，把这些心思活动当作大道，与道相违背。这些心思活动是与大道本觉不相应的，本觉自性不会捡择，不会作主，不会分析，不会判断，没有思维。第八识本觉，祂没有这些心思活动，如果有这些心思活动，一定是意识心所为，不是本觉。</p><p>赵州为此作个诠注说：只要语言、文字、内心思维一生起了，这就是捡择，就是明白了，我老僧根本就不在这个明白里。赵州的意思是本觉第八识，没有语言，不会说话，不会思维分析判断，不捡择一切，不明白、不了知一切六尘境界，这种明白了知性是意识心，不是真实的赵州我。</p><p><strong>六、僧问赵州：如何参禅开悟？百龄赵州像有急事似的说：对不起，我现不能告知，因我内急。于是赵州走出去，忽又止步，对僧说：老僧一把年纪，被人称为古佛，可内急这点小事，还须亲自去，无法找人代替。僧听了就大悟。</strong></p><p>释：僧问赵州参禅开悟的事，老赵州一听就亲自把禅示现出来，告诉那僧从哪里悟入，第八识在哪里。那僧问话一落，赵州就开始抖擞禅相，处处告知禅在哪里，是如何起用。那我们就应该知道了，世俗法当中的一切大小事情都是谁做的，谁做谁不做，怎么做的。也应该感悟到，万法确实虚妄不实，犹如梦幻。智者一闻千悟，何必说禅是一种境界，禅有什么境界呢。禅不是境界法，但是在各种境界上，确实有禅，而且离不开禅而有境界法。</p><p>南泉更是经常抖擞第八识，要不然，他就没办法斩猫了。乃至赵州听南泉斩猫以后，脱下鞋子，顶在头顶走出去，更是在抖擞，南泉看见后，大加赞叹说，如果你在场，就会代替我斩猫示现，我就不用斩猫了。</p><p>赵州被人称为古佛，而赵州也并不否认自己是古佛，实际上都知道赵州不是古佛，为什么都要古佛古佛的称呼赵州呢？赵州是古佛吗？有多古？从什么时候开始是古佛的？赵州还说，作为古佛，内急这点小事还要自己亲自解决，古佛不应该自己解决内急的小事吗？古佛有内急之事吗？</p><p><strong>七、</strong>坛经中六祖所说的，不是风动不是幡动是仁者心动的公案。这个公案里涉及到了外相风幡的的动转，也涉及到了识心的动转，而且不止这些，还涉及到了真心第八识的不动转。我们的七识妄心有攀缘，着了境界相，就能看见风动和幡动，六识只要有见有觉受，就是动了，识心一动就见相，见相就取相。六根触六尘，第八识就产生六识，六识再触六尘就有了见闻觉知，就知道一切事情了。</p><p>所以有了知就有识，有识就说明意根攀缘六尘了，七个识心都在动。如果意根不攀缘，就不想触尘，第八识也就不会产生识去了别六尘。意根执著攀缘的越重，六识分别的越多，心越不清静。而在这一切识动当中，真心第八识却是纹丝不动，一直是寂静的，寂然不动。任它风如何的动，任它幡如何的动，真心不觉不知，根本就不理睬，不分别，不动念想，极其寂静。但是在那风幡大动时，足可以找到根本不动的真心第八识，那要看当人的福德和定慧如何了。</p><p>在风幡动时，第八识却是不动，这是对还没有悟道的普通人而说。第八识也可以说是动的，因为第八识从来没有闲着过，总是在输送种子，出生一切法，了别根身器界。第八识如果不起作用，根本就没有六尘的产生，也就没有识心的产生，识心就不知道有风幡动了。但是第八识的动，却不同于七识心的动，祂永远不在三界世间六尘境界法里动心思，所以才说真如不动，如如不动。</p><p><strong>八、黄龙禅师有偈云：“春有百花秋有月，夏有凉风冬有雪，若无闲事挂心头，便是人间好时节。”</strong></p><p>释：这是描述禅师们过牢关的境界，过牢关的人，心得清净，内心不再贪恋世间；他们生活在世间，一事也不牵挂，一法也不再留恋，对自我五阴不再执著，对自己所证得的真如也不执著，内心坦坦荡荡，不留一物。虽然在人间生活着，照样经历一年四季春夏秋冬，可是心中却无一法可当情，景是景，色是色，人是人，物是物，一切法各住法位，与我不相干，活在世间时照吃照喝，却不贪执世间，心地已经得到解脱，没有拘执之故。</p><p><strong>九、永嘉禅师说：不除妄想不求真。</strong></p><p>释：这是从真心的角度来讲的，是说真如没有妄想，因此也不除妄想；真如本身不修行，不修戒定慧，也不追求明心见性，也不想成佛，因此祂没有想证得自己的愿望。永嘉大师是智慧很深的得道者，因此他能够现观真心的体性，开示的都是有关实相心的真理。没有悟的人，讲话就会从觉知心意识心的角度来说话，都是生灭法、虚妄法，不涉及第一义谛。有道与无道，二者智慧往往会有天渊之别。</p><p>我们意识妄心的体性，学佛修行以后，总在琢磨怎样去除妄想杂念呢？如何让心清净呢？如何才能做到不贪不嗔不痴呢？如何才能证得真心找到自性呢？而真心从不想这些事。祂也不想如何得解脱，如何成佛，如何守持戒律，如何修定和慧，真心不考虑这些事情，这些事都与祂无关，因为祂没有生死，所以真心不修行。</p><p><strong>十、悟了同未悟，不动即如如；</strong></p><p><strong>       狂心歇下时，无缺亦无足。</strong></p><p><strong>       打坐见禅心，行住复同根；</strong></p><p><strong>       尔来归一境，何须问浅深。</strong></p><p>释：悟了同未悟，明心开悟以后，意思是，人还是从前的人，只是心行改变了，定慧增长了。不动即如如，如来藏还与未悟前的如来藏一样，仍然是对境如如不动。</p><p>狂心歇下时，无缺亦无足。生灭狂妄的觉知心，依止于真如，一下子歇息下来，再也不向外攀缘，不向外贪求了。因为知道自己的如来藏本自具足一切法，丝毫不缺少什么，也不多出什么，一切种子都能派上用场。</p><p>打坐见禅心，行住复同根。不仅打坐时能彻见本心，行住坐卧也都能见到自心本性，一切时中，都能观察到如来藏的运作和妙用。尔来归一境，何须问浅深。所有这一切境界，都归入如来藏，都是如来藏的起用，那就不用问各种境界有什么浅深不同了。</p><p><strong>十一、</strong>宋朝时苏东坡与了元佛印禅师是好朋友，两人经常在一起论法。有一天佛印禅师说，咱们比试比试对佛法的见解如何？谁输了，就罚谁物，苏东坡说好。禅师先开口说：我看你像一尊佛。苏东坡回答说：我看你像一堆大粪。于是佛印禅师就说，你输了，罚你腰身上的玉带，于是就把苏东坡身上的玉带解下来，自己收了起来。各位评判一下，苏东坡为什么输了？</p><p>佛印禅师因为证悟了，能照见自己如来藏的存在与运作，也能了知众生身当中的如来藏，看众生都有如来藏在显现着，将来因此如来藏就能成佛，因此看一切众生都是佛。而苏东坡由于没有证悟，不明了自己以及众生身中的如来藏和佛性，就会着相，看众生只能看到外表的假相，把佛印禅师的外相看成大粪桶，说明苏东坡的自心不清净，不见诸法实相。</p><p>佛印禅师有智慧，把对方的相变成佛相，心能变佛，就能做佛，与佛相近，靠佛而住，成佛就快了。苏东坡一代文豪，舞文弄墨，文笔辩才都好，可惜口头禅多，实修少，那一世没有证悟。明朝时又脱生为著名的禅师，还是文笔很好，诗情画意也多，写了不少佛法的著作，据说是开悟，实际还不清楚，可是他的智慧仍然不太高。原因是前世文豪的习气，延续到后世，实修的还不够深透。</p><p>苏东坡的意根执著禅师的相为坏相，意识心就分别了为坏相，那么苏东坡的意根和意识心都是染污的，第八识输送出来的两个心的种子是染污的，就说明苏东坡没有把两个识心修行好，识心没有转变，内心仍然是污秽的。意根越执著他人的不好，越受染污，自己无缘无故污了自心，何苦呢？受了污染以后，染污种子就存在第八识里，将来第八识输送出来的识种都是染污不清净的，那将什么时候恢复清净呢？自己染污自己还得自己去清扫，既麻烦，苦恼又多。且不可总是执著别人的不好，要看别人的优点，内心里的相就都是好相了，自心就受好相的影响，心就能变好，存到第八识里的都是好种子，善种子，识心就是善的，这样修行就好了，越善离佛越近。</p></div>"
},{
    "title": "第七章　佛经中语句段落讲解（一）",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>一、</strong>法华经中佛言：<strong>是法住法位，世间相常住。</strong></p><p>释：法，指第八识如来藏，祂本无所住，不在三界内，不在三界外，也不离三界，不住三界中的色声香味触法六尘上，不住眼耳鼻舌身意六根上，不住眼识耳识鼻识舌识身识意识六识上。不住色蕴上，不住受蕴想蕴行蕴识蕴上，三界中的法，如来藏一法也不住。三界外又无法，三界外如果有法，就属于三界内了，无法才是界外，三界之外，有法就有界。但是如来藏也不离三界，因为三界之法都是如来藏所变生和显现的，有三界法就有如来藏，如来藏又不与三界法混合在一起，互不相在。所以如来藏就是这样无所住地住着，尊贵无比。祂的所在，谁也到不了，那就更住不了，地位不同所致。</p><p>世间相常在，如来藏的功能作用，是要不断地变现三界世间法，众生只要有三界世间的种子，如来藏必然要不断的变现三界世间法相。现见世间众生无边，三界种子无量，各个众生的如来藏就会永远变造三界世间，无穷无尽，没有停歇的时日。所以这个世间相必然能够永远常在。虽然世间相能够永远常在，但是在某一段时间，某个局部，这些世间相还是有生有灭的，都是生来灭去，灭去生来，生生灭灭，无穷无尽，这些生灭现象将会永远存在下去。从久远的历史长劫来看，这些生灭现象是常有常在的，但是从单个个体、从时间分段来看，这些世间相是生灭的，是无常的，不是永远存在的，不是真实的。</p><p>比如说某甲，他的如来藏是不生不灭，永远存在的，而某甲即使修学佛法，也不能像阿罗汉那样入无余涅槃灭掉自己。那么某甲的三界世间种子就不断绝，某甲的如来藏就要永远变造某甲的各种五蕴身。此世的某甲五蕴身灭了，下一世他的如来藏就会变造某甲的另一个五蕴身，叫作某乙，未来还会变出某丙某丁等等，无穷无尽。那么某甲无数个五蕴身永远会在三界世间出现和存在着，就叫世间相常在常存。但是某甲的各个五蕴都是生灭的、无常的，并不是真正的某甲，都是暂时而有的假相罢了。</p><p>五蕴一期一期的生命叫作分段生死，修到八地菩萨以后，分段生死的现象没有了，五蕴身的寿命会很久远，好像是没有生死了，但是还有变易生死，如来藏里还有异熟种子，生死现象并没有真正消失和结束。直至佛地，如来藏中的生灭种子全部消尽，再无生死，那么佛地的如来藏就是真常不变异，叫作常乐我净，究竟大涅槃。虽然如此，佛以无量的大慈悲心，悲悯众生，在无生死当中，不妨假现生死，变造出无数个五蕴世间，大作梦中佛事，度脱无量众生离开生死。所以佛不真正灭度自己，而是要永远变现三界世间，以及无量诸佛国土，让世间相常存常住，以此利乐众生无穷无尽。</p><p>这里所说的法与世间相肯定是有所区别，不然世尊不会分开说。世间相是不自在不自主的，生灭变异无常的，为什么这里却说常在呢？生灭无常的法，必须依止于一个不生灭常住的法，才能不断的出生不断的变异和灭亡，只要这个常住法不灭，世间就会永远的不断的生灭不已。世间相的个体在某段时间存在却灭去，总体的世间相却总是不断的存在着，这都得益于不生灭的常住法第八识。</p><p>第八识不同于世间相，不与世间相混在一起，永远处于清净的涅槃状态，不管世间相如何的生灭变异，祂都不参与其中，如如不动，不随世间相而心动，发生什么变异，有什么烦恼和无明。所以说第八识本体这个法永远处于清净无染的涅槃态不动，所出生的世间相依之也就会永远不断的出生和灭亡，世间现象不灭。</p><p>二、圆觉经中佛言：<strong>彼知觉者。犹如虚空。知虚空者。即空华相。亦不可说言知觉性。有无俱遣。是则名为。净觉随顺。何以故。虚空性故。常不动故。如来藏中。无起灭故。无知见故。如法界性。究竟圆满。遍于十方故。是则名为。因地法行。菩萨因此。于大乘中。发清净心。末世众生。依此修行。不堕邪见。</strong></p><p>释：彼知觉者，是有知有觉的妄心七识，七识是第八识如来藏所生，因此说妄心没有自体性，是被出生的虚妄法，犹如虚空一样的虚妄，本无所有。而知道知觉犹如虚空一样的这种知觉，就像虚空当中的花相一样，了不可得，也不可以说这种知觉有自己真实的知觉性，都是如来藏性。有知觉无知觉，这两种知见都要遣除，因为都是虚妄的觉知心的知觉和观点，不是妙明真心，妙明真心中没有无也没有有。</p><p>但也不能说众生没有知觉，因为知觉的假相还是存在的，也不能说知觉性是实有的，知觉性不是实有的而是幻化的，实际上都是如来藏性，是如来藏的功能体性作用，表面上看是有妄心的知觉性，实际是没有的。这样理解知觉性，才是随顺于清净的如来藏心的圆满觉性。为什么这样说呢？因为如来藏性就像虚空性一样，不对六尘，因此对六尘境界不动心思，没有任何心行。如来藏在六尘中，没有起和灭，六尘生祂不生，六尘灭祂不灭。对于三界世间法，如来藏也没有任何知见看法，没有什么主张。</p><p>如来藏清净圆满遍于一切法界，从众生到佛地，十法界都有如来藏，遍布于三界九地众生当中，也遍布于众生的六根、六尘、六识十八界，无一处不在，无一处不有，遍十方世界即是一真法界，即是如来藏性。众生在未成佛之前的菩萨位中，就要这样观察随顺于如来藏的体性，就能对无上菩提发起清净的信心。末世众生照此修行，随顺如来藏的圆满觉性，就能免除邪见和颠倒见，不再认七识知觉心、五阴十八界、三界世间任何一法为真实，就能不随邪见而生死流转。</p><p><strong>三、圆觉经以幻修幻的真实义</strong></p><p>世出世间法，只有如来藏这一法不是幻，不是被其他法幻化出来的，是真实不虚的，是本来而有的，是自在而不生不灭的。除了如来藏这一法，其他的所有一切法，包括十方世界，全部都是如来藏所幻化出来的，不管是诸佛的五蕴身也好，应身佛化身佛也好，都是佛的无垢识所幻化出来。众生所有的一切法，除了如来藏之外，全部都是自己的如来藏所幻化出来。</p><p>学佛修行是谁来修行呢？我们看看如来藏学佛修行吗？如来藏不学佛也不修行，因为祂圆满具足一切法，祂就是法身佛。学佛修行的是五蕴七识妄心幻法学佛修行，所用的方法是戒定慧，戒定慧也是法也是佛陀的无垢识真如心所出生的，是众生的七识心修行的，修的就是七识心，这叫作以幻修幻。把七识心修到去除一切的无明，具足了圆满清净的一切智慧，福德智慧圆满具足，就成佛。</p><p>能修行的六七识心以及五蕴是虚幻的，以这些妄心来修行，就是以幻来修；所修行的法就是幻法，一切修行成佛之法都是幻法。成佛了，成佛这一法也是虚幻，也是被如来藏所变现出来的法。本来没有成佛之法，我们想修行，如来藏就会幻化出这些修行方法，是依止于十方诸佛的教导而幻化出来的；成了佛以后，成佛这一法也没有用了，成佛之法就是虚幻法。</p><p>修行的法门，戒定慧也好，禅宗净土宗唯识宗也好，阿含解脱道也好，都是如来藏依据佛教导的轨则所幻化的。就用七识这个幻心来修行，修行也是修身心这些幻法，修成佛的幻法，这一切修行修到最后，成就的也是一个幻法。最后把幻化的六七识心都变清净，再也没有无明了，就会究竟转识成智，这种修行方法就是以幻修幻。</p><p>圆觉经里说的如木出锲，如木出火，火出木尽，修行就像是这样，都是幻法，以这种幻去代替那种幻法，当然是幻法与幻法还有极大的差别。成佛这个法，就是把六七识都转识成智，福慧两足尊，用这个幻法来代替六七识无明之幻法，代替六道生死转回之幻法；用成佛这一法，代替众生的无量生死烦恼这些幻法，代替众生的分段生死以及变易生死之幻法，这就叫作以幻修幻。</p><p><strong>四、</strong>圆觉经原文：<strong>善男子。但诸菩萨。及末世众生。居一切时。不起妄念。于诸妄心。亦不息灭。住妄想境。不加了知。于无了知。不辨真实。彼诸众生。闻是法门。信解受持。不生惊畏。是则名为。随顺觉性。善男子。汝等当知。如是众生。已曾供养。百千万亿。恒河沙诸佛。及大菩萨，植众德本。佛说是人。名为成就。一切种智。</strong></p><p>释：这是指如来藏的自住境界，是讲如来藏的体性，不是七识心应该住的境界。如来藏的体性是，不管什么时候，从来都不起妄念，也从来都不熄灭七识妄心。在各种妄想境界上都有如来藏的显现，但是如来藏从不知道这些妄想境界，如来藏也不知道自己不了知各种妄想境界，对于自己的不知，如来藏从来不去分辨其真实性，不知道自己有这样的体性。有道种智的菩萨才能懂得如来藏的这些深细的体性，所以是地上菩萨的随顺觉性。</p><p>认取如来藏性的这种境界，就是修行，真正达到这种境界的就是佛。那是一个理性的世界，就是如来藏的境界，大菩萨的觉知心做不到这样，更何况是凡夫。那上面已经说了，闻是法门，这是个法门，是如来藏法门，能够信、能够解、能够受而且能够行这个如来藏的法门，是入地菩萨的随顺觉性，只有地上菩萨能够真正地懂得并且随顺，随顺这个觉性达到圆满时，就是诸佛的圆满觉性。到此，这个众生已经供养了百千万亿诸佛及大菩萨，才能证得一切种智，圆满成就佛道。</p><p><strong>五、</strong>圆觉经原文：<strong>善男子。云何我相。谓诸众生心所证者。善男子。譬如有人。百骸调适。忽忘我身。四支弦缓。摄养乖方。微加针艾。则知有我。是故证取。方现我体。善男子。其心乃至。证于如来。毕竟了知。清净涅槃。皆是我相。</strong></p><p>释：佛说：善男子，什么是我相？我相的表现和特征是什么？我相就是众生的识心所能证取的、能了知的那个能相。善男子，譬如有人浑身骨节肌肉筋脉都非常的舒服，没有任何一点违和不适，于是这个人就忘记了色身的存在，心里没有色身的感觉了，四肢都很放松，连身体在哪里也不知道了，没有身体方面的信息和念头。这时候拿一根细针轻轻扎一下他的身体，他马上就知道自己身体的存在了，因此就证取到我了，我的身体的观念就出现了。善男子，其心乃至于证取到如来，并且能究竟了知清净的涅槃，这都是我相。</p><p>佛说的这段话，表明我相很微细，粗糙的我相阿罗汉们能证得到，也能断除，但是非常微细的我相只能修到地上菩萨的时候才能证得和断除。这里的我相是指众生对自身对一切法的非常微细的知性，只要有一个知，不管知什么，不管知的多么微细，不管多么细微的知，都是我相，没有我就没有知。认取这个知性就是我见，执取这个知性就是我执，也可以叫作法执，法执就是微细的我执。认取了这个知性，就是无明，就有业行，就有变易生死，不能究竟涅槃。</p><p>如果众生说我证果了，认取和执取了能证果的这个心相，这个证取性，就是我相，就是我见；如果有人说我开悟了，认取和执取了这个能开悟的心相，就是我心，就是我见；如果众生认为我好我最好，他坏他最坏，这就有了我相，就是我见；以此我见就要造作生死业了，就有了分段生死和变易生死，不能解脱和涅槃。如果有人认为自己高于他人，从而不断的抬高自己贬低他人，这就是严重的我相，粗糙的我相，生死业重，三恶道不免；如果有人千方百计的掩盖自己的缺点和弱处，就是严重的我相，如果有人千方百计的揭露他人打击他人，同样是严重的我相，都是粗重的我相，我见重，三恶道不免。</p><p>所有的身行、语行、意行都是我相，不认取和执取就没有我见，认取和执取了就是我见我执。护短、争斗的行为就是有我相，脸上的各种表情就是我相，比如不好意思、脸红、尴尬、害羞、喜悦、愤怒、仇视都有我相，一切恶行不善行都有我相，大多数众生的善行也有我相，圣人的善行自然而然，任运而为，没有我相，佛的一切身口意行中没有我相。</p><p><strong>六、</strong>圆觉经原文：<strong>居一切时不起妄念，于诸妄心亦不息灭，住妄想境不加了知，于无了知不辩真实。</strong></p><p>释：这是指如来藏的定慧等持境界，如来藏常在定，没有出定时，因此永远不起念想。因为祂不是虚妄法，因此也没有虚妄法的妄念，也不会想要灭除虚妄的七识心。如来藏变现出七识妄想出来的境界，却不了知那是妄想境界，对于自己这种不了知也不加以辨别，不知道是谁的不了知。</p><p><strong>七、</strong>华严经原文：<strong>信为道源功德母，长养一切诸善根。</strong></p><p>释：众生由信而入道，还没有开始学佛的人，不信有佛，不信有因果，就不能进入佛门来学法。信了佛的人，由于不是正信，还不能真正地来修行，也不想解决烦恼和生死问题，更别说明心见性了。这都是由于根基浅，信佛时劫短，信根不深，信力不足，修行的动力不足，导致修行仍然处于很浮浅的层次。</p><p>信分很多层次，有迷信，有仰信，有崇信，有正信，极大多数学佛人都处于在培养自己对佛法僧三宝的信这个阶段，也就是信位阶段。这个阶段从迷信佛开始，要修行一万劫以上，甚至更长久，这样累积的善根深了，才能有正信，信佛有无量功德智慧，信有十方世界诸佛及诸佛国土，信自己有如来藏能够成佛，信所有众生都有如来藏，也都能成佛。这时信位菩萨的修行圆满，就转入住位菩萨修行，开始修行菩萨的六度波罗密，准备明心见性，成为真实义的菩萨。</p><p>如果这个人还很悭贪，不肯布施，初住位的内容还没有开始修，那就还属于信位的凡夫菩萨。菩萨的各个阶段修行所需的时间长短，是完全因人而异的，所以具足信根信力还是很不容易的。这世学佛很久了，还处在肤浅的表面修行状态，不能深入修学般若经典，那就是前世的根基浅薄，只能自己慢慢打基础，培养对佛法的正信，别人着急也不行。</p><p>十信位修圆满时，信自己有真如佛性，信众生都能成佛，信十方世界有无量佛，信大乘经典，诚信三宝在世间住世。然后就修十住位，初住位主修布施，二住位修持戒，三住位修忍辱，四住位修精进，五住位修禅定，六住位修般若，开悟明心时就是七住位，不退转于菩提道，就是阿弥陀经里讲的不退转的阿惟越致菩萨。修得如幻观，观行出来一切法就像幻化出来的一样不真实，十住位就修完了，就进入十行位修行，证得阳炎观，一切都像海市蜃楼一样虚幻，十行位就修圆满，进入十回向位，证得如梦观，有了一分道种智，就进入初地，入如来家，成为圣人。</p><p><strong>八、问：华严经讲八地菩萨能知世界怎样成，怎样坏; 而不增不减经却说世间有始有终是邪见。世间到底有没有成住坏空？</strong></p><p>答：华严经十地品第二十二之四原文：【菩萨摩诃萨。至第八地。从大方便慧生。无功用心。在菩萨道。思惟诸佛智慧势力。知世界生。世界灭。世界成。世界坏。知以何业因缘集故世界成。何业因缘灭故世界坏。】</p><p>《不增不减经》原文：【舍利弗。依毕竟无涅槃见复起六种见。此六种见与无涅槃见。不相舍离犹如罗网。何谓六见。一者世间有始见。二者世间有终见。三者众生幻化所作见。四者无苦无乐见。五者无众生事见。六者无圣谛见。】</p><p>华严经中，佛依圣义谛如来藏而说，世界有成住坏空四个阶段，成住坏空依如来藏而有，有也是假有，相上是有，实质都是如来藏的空性。八地菩萨以无功用心都能如实彻见世界的成住坏空，能够明见世界是以集起的什么因缘而形成生起的，也能明见世界是以什么因缘的散灭而毁坏的。说明世界的成住坏空在相上是有，在世俗法上存在这些现象。</p><p>不增不减经中这段是说，众生心中有断灭的邪见，认为毕竟没有涅槃心如来藏，如来藏是不存在的，不实有的。因此断灭见而起六种邪见，六种邪见的生起是因为否定有如来藏真实存在的毕竟空邪见而来，因为否定有如来藏能出生万法，他们就认为世界不用有如来藏，而自然就有成住坏空的现象存在，这些现象是真实有的，是自然而然的现象，不是如来藏幻化出来的。总之，这六种邪见就是否定如来藏的断灭见的产物。</p><p><strong>九、楞枷经第二卷简释</strong></p><p>原文：<strong>尔时大慧菩萨摩诃萨白佛言。世尊。世尊修多罗说。如来藏自性清净。转三十二相入于一切众生身中。如大价宝。垢衣所缠。如来之藏常住不变。亦复如是。而阴界入垢衣所缠。贪欲恚痴不实妄想尘劳所污。一切诸佛之所演说。</strong></p><p>释：大慧菩萨请问世尊说：世尊您在佛经当中说，如来藏的自性是清净的，却把三十二相转入一切众生身中，只见众生六道身，不见三十二相。就像价值连城的珠宝，却被污垢的衣服所缠裹。藏着如来的宝藏，常在众生身中永不变异也是如此，却被五阴十二入十八界这样污垢的衣装所缠裹，也被贪嗔痴烦恼，以及种种的不实妄想尘劳烦恼所染污。就像这样被五阴世间妄想尘劳烦恼所缠裹的如来藏法，是一切诸佛所演说之法，一切诸佛都是如此演说如来之藏。</p><p>原文：<strong>云何世尊同外道说言。我有如来藏耶。世尊。外道亦说有常作者。离于求那。周遍不灭。世尊。彼说有我。佛告大慧。我说如来藏。不同外道所说之我。大慧。有时说空。无相。无愿。如实际。法性。法身。涅槃。离自性。不生不灭。本来寂静。自性涅槃。如是等句。说如来藏已。如来应供等正觉。为断愚夫畏无我句。故说离妄想无所有境界如来藏门。</strong></p><p>释：为什么世尊您跟外道说，我有如来藏耶？世尊，外道也说有常存不变的造作者，能创造众生的色身，离于种种因缘，遍于众生五阴，永不灭亡。世尊，他们也说有我，如世尊一样说有我。世尊告诉大慧：我所说的如来藏，不同于外道所说的我。大慧，我说如来藏，有时候说空性心、无相（没有世间相）、无愿（没有愿心）、如实际（符合实际，是真实理）、法性（诸法之真实性，实体性）、法身（出生一切法的法身）、涅槃（寂静的心）、不生不灭心、本来寂静（本来就不了别六尘，没有喧闹的心）、自性涅槃（具有不生不灭的自体体性）等等这些词语，都是指如来藏。</p><p>我用这些语句来描述如来藏。就是为了那些害怕没有了我的愚痴凡夫们而说，为了断除他们的畏惧心理，才说如来藏法门，说这些如来藏的别名（其中每个名字的涵义，都表示如来藏是真实存在的，凡夫知道了，就不用害怕无我而断灭了。）我为这些愚痴凡夫说，没有一切妄想的如来藏法门，没有一切六尘境界的如来藏法门。</p><p>那些愚痴无闻的凡夫，因为害怕断灭空无，害怕五阴当中无我死后一了百了，十方如来应供等正觉就为众生宣说如来藏法门，说五阴当中有我、有如来藏，如来藏离于妄想，没有任何六尘境界，住于众生五阴当中，常住不灭。其实众生的如来藏还不是真正的我，里面含有生灭变异的染污种子没有消除，还不完全具足我性，业不够清净，但却是成佛后真正的我的前身，所以方便说为我。</p><p>原文：<strong>大慧。未来现在菩萨摩诃萨。不应作我见计着。譬如陶家于一泥聚。以人工水木轮绳。方便作种种器。如来亦复如是。于法无我。离一切妄想相。以种种智慧善巧方便。或说如来藏。或说无我。以是因缘故。说如来藏。</strong></p><p>释：大慧，未来世以及现在世的菩萨摩诃萨，都不应该计着有一个像外道那样的我，而有那样的我见。外道所计着的我，是因缘所成的生灭的我，非真实不坏的我。譬如做陶瓷的手工艺者，把泥和土聚在一起的泥团，用人工、水、还有木轮、绳子等等方便手段做成各种器具。这些器具都是无我的，不真实的，外道的我就是这样的，是各种法合成的假我。</p><p>如来也如菩萨摩诃萨一样没有我见计着，对于没有我性的法，离开一切妄想的相，以种种的智慧和善巧方便，把这个法相或者叫作如来藏，或者叫作无我法，以这样的因缘，来宣说如来藏法。</p><p>五蕴不是我，成佛之前的如来藏也不是我，都是无我的。如来藏里有七识的生灭法种存在，所以不是真正的我，如来藏这时也没有我性。菩萨们都不应该把如来藏当作我而生执著，因为如来藏是没有七识那种我性的，并且与众生的无明、烦恼、妄想和合在一起，所含藏的业种还有生灭变异，还不是完全清净不变异的我。</p><p>原文：<strong>不同外道所说之我。是名说如来藏。开引计我诸外道故。说如来藏。令离不实我见妄想。入三解脱门境界。希望疾得阿耨多罗三藐三菩提。是故如来应供等正觉。作如是说。如来之藏。若不如是。则同外道。是故大慧。为离外道见故。当依无我如来之藏。</strong></p><p>释：世尊说：我说的如来藏，不同于外道所说的那个我，外道所说的我，是各种因缘所生成的神识心。我为了开示引导以识心为我的外道们，才宣说如来藏法，让外道们离开不实的识心我见妄想，入到空、无相、无愿三解脱门境界，希望他们迅速地证得阿耨多罗三藐三菩提，是故如来应供等正觉，要这样的来宣说如来藏法。如果不这样宣说如来藏，就是与外道的我等同。因此大慧，为离开外道邪见故，应当依止无我性的如来藏而修学。</p><p>如来藏真实有、真实存在，只是佛地前的如来藏是无我性的心体，成佛以后的如来藏是有我性的心体，叫作无垢识，心体里没有了染污业种，变成纯净的心体，具有常乐我净之性。这是真正的我，纯正的我，完全彻底的我，因此佛法里有我，外道里却没有我。</p><p><strong>十、楞伽经原文：（佛说）大慧。诸识有三种相。谓转相业相真相。大慧。略说有三种识。广说有八相。何等为三。谓真识现识。及分别事识。</strong></p><p>释：佛说：诸所有识具有三种相貌，一种是流转的相貌，能把一切法都流转出来，这是指第七识意根；一种是业报的相貌，显示的是业行的善恶果报相，这是指六识；一种是真实的相貌，不生不灭，能如实的出生和显现出一切法，这是指第八识。</p><p>佛说：大慧，约略的说有三种识，广泛的说有八种相貌。什么是三种识呢？一种是真识，是真实存在有真实功能作用的识心，不生不灭，这是指第八识；一种是现行识，能把一切法现行出来，能引导第八识出生一切法，这是指第七识意根；一种是分别六尘境界事的识，这是指六识，能分别色声香味触法六尘境界。</p><p>原文：<strong>大慧。譬如明镜。持诸色像。现识处现。亦复如是。大慧。现识及分别事识。此二坏不坏。相展转因。大慧。不思议薰。及不思议变。是现识因。大慧。取种种尘。及无始妄想薰。是分别事识因。</strong></p><p>释：佛说：大慧，譬如一面明亮的镜子，能够托显和映照出一切色像。第七识现量呈现出第八识变现出来的一切法，现量了别一切法也是这样。大慧，第七识现识和前六识分别事识这两种识心，一种是能去往未来世无量劫，中间而不毁坏，另一种是能随时随地坏灭的识心，不能去至未来世，这两种识心是一切法相出现的辗转因，直接因是第八识。</p><p>大慧，六识受六尘境界的熏习，再次的熏习第七识，这种熏习也是不思议的，潜移默化的对第七识进行邪教导，致使第七识增加我见邪见，更加的贪执三界世间，无法灭除自己，这是第七识生生不已的一个因。第七识不灭的另一个因，是第八识以收集起来的业种，不断的变幻三界世间法，致使第七识贪执不舍，不断的出生五蕴，以至于生死不断。</p><p>大慧，由于意识取着种种的尘境，不肯舍离，意识自身就会不断的出生，这是意识出生的一个因。另一个因是，意识从出生开始，就一直不断的受第七识无始的妄想熏习，被第七识所诱导，不断的了别尘境，执取尘境，不断的造作，意识就要不断的出生，不能灭去。</p><p><strong>十一、大乘入楞枷经卷三</strong></p><p>原文：<strong>佛言。大慧。我所说者。分别尔炎识灭名为涅盘。大慧言。世尊。岂不建立八种识耶。佛言建立。大慧言。若建立者。云何但说意识灭非七识灭。佛言。大慧。以彼为因及所缘故。七识得生。</strong></p><p>大慧。意识分别境界起执著时。生诸习气长养藏识。由是意俱我我所执思量随转无别体相。藏识为因为所缘故。执著自心所现境界。心聚生起展转为因。大慧。譬如海浪自心所现。境界风吹而有起灭。是故意识灭时七识亦灭。</p><p>释：佛说：大慧，我所说的涅槃，是能够起诸分别和烦恼的六识心灭了，不再进行分别了，就是涅槃。大慧菩萨问世尊说：不是说众生有八种识吗？佛说：是有八种识。大慧说：既然有八种识，为什么只说意识灭众生就得涅槃，不说七识灭得涅槃呢？世尊说：大慧，七识是以六识的不断分别执著为因为缘，才能生起和运转。</p><p>当六识不断的分别六尘，并且执著六尘为实的时候，就熏染第七识，让第七识形成了习气，习气种子就存在第八识藏识里，熏染了第八识，让第八识里的业种有生有灭。众生的五阴身出生时，第七识意根依第八识就有与生俱来的我执和我所执，意根的恒审思量性随之就运转起来，就是因为六识不断分别执著存入种子的缘故。</p><p>六识运行的种子存入第八识以后，后世第八识就会输出种子，现起三界世间万法，第七识就会继续执著这些万法为我和我所。七识以第八识为因为缘，把第八识的见分执为是自己的见，把第八识所出生的六尘境界执为是自己所有的，这样我执我所执就围绕着第八识的见相二分而运转着，七识意根就这样不断地运行不灭，因此不得涅槃。七识意根就像大海的波浪，随着大海所现起的境界风的吹拂而生起。意思是说，第八识这个大海现起了六尘境界，七识就随着六尘境界生起运作，境界风不断，就是六识的分别执著不断，那么七识的海浪就不断。世尊说，因此六识如果灭了，不再分别执著，七识就不会再生起运行，七识也就灭了，众生就涅槃。</p><p>这段楞枷经里所表达的意思，与十二因缘当中的：“无明缘行，行缘识，识缘名色”的道理是一样的。因为众生心中有无明，身口意行就不断，身口意行不断，六识被迫就要现起运行，六识不断生起，其心行就作为习气种子存在第八识当中，意根就执取第八识中的种子，生起现行，这样意根不断，未来世的名色就不断，众生就不能涅槃。</p><p><strong>十二、楞枷经原文：佛说。所谓贪者。若取若舍。若触若味。系著外尘。堕二边见。复生苦阴。生老病死忧悲苦恼。如是诸患皆从爱起。斯由习近世论。及世论者。我及诸佛。说名为贪。是名摄受贪欲不摄受法。</strong></p><p>释：佛说，所谓的贪是什么呢？对于世俗法或者是有执取心，或者是有厌离心，或者是去碰触，或者是沉浸其中，心被外尘牵引着，堕入断常两边邪见，不是认为一切法后世永灭不生，就是认为一切法常存不灭，这些都是贪爱的表现，有这些贪，就会堕入苦受阴之中，生老病死忧悲苦恼就不可避免了。这一切生死过患，全部是由贪爱所引起的。</p><p>贪爱之习，是由熏习了世俗之论法及与世俗论者交往密切所引起的，就生出了对世间法的贪爱。世尊和诸佛都一致把自心熏习之法说名为贪。佛说这样的熏习是摄取了贪欲，而不是摄取了法。这里的摄受是指心中容受了贪，接纳了贪。贪与法是背道而驰的，贪是世间，法是出世间，二者如称之两头，低昂等时。</p><p>原文：<strong>大慧。云何摄受法。谓善觉知自心现量。见人无我。及法无我相。妄想不生。善知上上地。离心意意识。一切诸佛智慧灌顶。具足摄受十无尽句。于一切法无开发自在。是名为法。所谓不堕一切见。一切虚伪。一切妄想。一切性。一切二边。</strong></p><p>释：佛说：大慧，什么样才是摄取法呢？能善于觉察到自己所知所触的一切法都是由自心如来藏所现起的，是三能变识和合显现出来的，是真心如来藏依缘出生的，不是真实存在的。第八识如来藏是第一能出生法的识心，第七识是第二能促使法出生和显现的识心，六识是第三能引导和显现法的识心。三者和合，一切法就会运作出来。</p><p>在接触一切法时，要清楚的觉知五阴十八界是人无我的，觉知一切法相都是无我的，没有真实存在性，都是被出生的法，都是生灭变异无常不可靠的法。证得了人无我和法无我以后，再也没有什么妄想了，就生出了无相、无作、无愿之心，对一切法就不会再有什么想法，内心不会再依赖这些法，对这些法不再生心动念，不会再生起执着，不再生起善恶、是非、对错、有利、有弊等等思想观念。</p><p>证得法无我具有唯识种智，成为地上菩萨以后，要善于了知上地菩萨的相貌和应该修行的法，自心不执取真如意根和六识，一切法都不执取。这样的菩萨一切诸佛都会为他智慧灌顶，内心完全摄受十个无尽句，发起地上菩萨的十个清净大愿。对于一切法再也没有妄想了，不再认为我能如何如何，了知一切法因缘所生都不自在。从此以后再也不会堕在一切知见上，不堕在一切虚伪相上，不堕在一切妄想上，不堕在一切法性上，也不堕在一切的有无等等两边上。</p><p><strong>十三、楞枷经原文：佛告大慧。如来之藏。是善不善因。能遍兴造一切趣生。譬如伎儿。变现诸趣。离我我所。不觉彼故。三缘和合。方便而生。外道不觉。计著作者。为无始虚伪恶习所薰。名为识藏。生无明住地。与七识俱。如海浪身。常生不断。离无常过。离于我论。自性无垢。毕竟清净。</strong></p><p>释：这段是讲如来藏的体性。佛说如来藏是一切善法和恶法的因，由有如来藏才能有一切善法和恶法。如来藏能变造出一切六道众生的生命体，就像一个善于工伎的伎儿一样，能变现出一切六道境界。并且不把自己所变造的法当作是我和我的，不觉知自我，也不觉知这些法到底是什么。这就是如来藏的无我性，与七识的我性截然不同，七识的自我性非常强大。</p><p>一切法都是如来藏、业种和意根妄想和合生出来的，因缘聚合方便而生。外道们却觉悟不了这里的内在之因，就认为这些现象一定有个造作者，比如大自在天、上帝等等，丝毫不觉悟到如来藏的神奇。如来藏无始劫以来，一直被众生无始的虚伪虚妄的恶习所熏染着，存入了众生无量数的邪见和执著一切法实有的恶习种子，所以如来藏也叫作能藏种子的识藏。</p><p>因为如来藏存入的众生这些无明恶业种子，就会出生众生的无明住地三界世俗法五阴十八界，出生这些法以后，就会时时刻刻与七识在一起，共同和合运作变生和执持这些法。就像出生海浪的本体大海一样，常常出生海浪不断绝。如来藏常常出生一切法，自身却没有无常的过失，也没有我性。自体之性没有无明烦恼和污垢，心性毕竟清净，究竟清净。</p><p><strong>十四、楞枷经原文：其余诸识。有生有灭意意识等。念念有七。因不实妄想。取诸境界。种种形处。计著名相。不觉自心所现色相。不觉苦乐。不至解脱。名相诸缠。贪生生贪。</strong></p><p>释：除了如来藏自性清净心，其余都是有生有灭的心意根和意识等等，众生念念都体现出七识心的生灭变异无常性，因为不知法界实相，而生起虚浮的妄想，执取境界为真，执取六尘的种种形色相貌，然后再安上名言名相。都不知道所有这些境界相貌都是自性清净心所显现出来的假相，由此无知，而不觉悟着境所带来的苦乐，有苦有乐就得不到解脱。众生无始劫以来，被世俗名相所缠缚，生起种种贪爱烦恼。</p><p>过去祖师传法印证弟子开悟，就以楞枷经为准来印心，到六祖时，才改为金刚经。楞枷经中对断我见证初果到四果有印证的标准，小乘修行也可以用楞枷经来印证。</p><p><strong>十五、楞枷经原文：大慧。此如来藏识藏。一切声闻缘觉。心想所见。虽自性清净。客尘所覆故。犹见不净。非诸如来。大慧。如来者。现前境界。犹如掌中。视阿摩勒果。</strong></p><p>释：这里说声闻和缘觉辟支佛，他们对于如来藏，只能是想一想而已，心里臆想有个如来藏是自性清净心，是真实的我，他们只是有这种知见观点，并不能真正的证得，只有发大心的菩萨才能证得，不是猜测和臆想。声闻缘觉们虽然知道有自性清净心，但还是被无始劫以来的客尘烦恼所遮蔽覆盖，不能见得祂，因此知见还是不足，虽然他们已经证得了小乘的法眼清净，对于如来藏法，还没有生起法眼，其知见还是不清净。所以说，声闻缘觉并不能证得第八识如来藏，如果能证得，那就是阿罗汉辟支佛菩萨，种性就改变了。</p><p>诸佛诸如来却不是这样，诸佛如来，一切法呈现时都是现前境界，也都是现量观察，不用想象和思惟，更不用臆想，完全是现量境界，境界到面前立时就知，犹如观看自己手掌中的阿摩勒果一样清晰、透明、清澈、真净。</p><p><strong>十六、楞伽经第二卷原文：尔时大慧菩萨摩诃萨。复白佛言。世尊。惟愿为说。离一异俱不俱。有无非有非无。常无常。一切外道所不行。自觉圣智所行。离妄想自相共相。入于第一真实之义。诸地相续渐次。上上增进清净之相。随入如来地相。无开发本愿。</strong></p><p><strong>譬如众色摩尼境界。无边相行。自心现趣部分之相。一切诸法。我及余菩萨摩诃萨。离如是等妄想自性。自共相见。疾得阿耨多罗三藐三菩提。</strong></p><p>释：大慧菩萨请求世尊宣讲第一义谛，菩萨们明了第一义谛之后，能够地地转进，进入如来地，成为究竟的佛世尊。这个第一义諦，离开一和异，离开俱和不俱，离开有和无以及非有非无，离开常和无常。这个第一义諦的智慧境，一切外道们都不了知，都不能证得，只有已经觉悟了的登地的圣人们才能够证得。</p><p>圣人们能够离开七识妄心所具有的自相和共相，而证入真实的甚深之理，也就是第一义諦。然后就能从初地开始，地地辗转增进，心地越来越清净，无明断尽，七识心彻底清净了，就进入如来地，成为究竟的佛。</p><p>这个第一义諦就像一个摩尼宝珠，能现无量无边的光彩，能现无量无边的有为法相。自心所显现出来的一部分现象界的相，以及一切諸法之相。大慧菩萨说，我和其余的菩萨摩诃萨，都能够离开这些由于七识心的妄想而由第一义諦显现出来的虚妄相，离开这些虚妄相的自相和共相，而只见第一义諦相，这样就能迅速地证得阿耨多罗三藐三菩提。</p><p>其中，一异是指第一义諦与諸法的关系，是一同时又不是一，是不一不异的；俱不俱是指第一义諦与諸法的关系，是在一起同时又不在一起，是非俱非不俱的；有无、非有非无，是指第一义諦的有性和无性，非有又非无性，既有又无有性；常无常是指第一义諦的常和无常性，既是常又是无常，既不是常又不是无常。</p><p>妄想的自相和共相，包括了第一义諦产生的色法和心法部分。法有色法和心法，有真法和妄法。色法有色法的自相和共相，心法有心法的自相和共相，妄法有妄法的自相和共相。真法有自己本体之相，没有共相。</p><p><strong>十七、楞枷经对意根断身见我见的证明</strong></p><p>原文：<strong>佛告大慧。有三种须陀洹。须陀洹果差别。云何为三。谓下中上。下者极七有生。中者三五有生而般涅槃。上者即彼生而般涅槃。此三种有三结。下中上。云何三结。谓身见、疑、戒取。是三结差别。上上升进。得阿罗汉。</strong></p><p>释：佛告诉大慧菩萨说：有三种须陀洹，在果位上有差别。是哪三种呢？是上中下三种，下种品位的须陀洹，最多七次人天往返，就般涅槃了；中种品位的须陀洹，再托生三五次就会般涅槃了；上种品位的须陀洹当生就能般涅槃。这三种须陀洹人断除的结缚有三种，分为上中下三种，就是身见、疑见和戒取见三种结缚。这三种结缚不断的升进，断除的逐渐彻底，就证得阿罗汉果了。</p><p>断我见证得须陀洹果的人都要断除三縛结，由于断除结缚的程度不同，须陀洹的品位就不同，离般涅槃的时间就不同。那这三种结缚是意识断的还是意根断的？是断意识的结缚还是断意根的结缚呢？从上品须陀洹当生就能成为阿罗汉进而般涅槃的情况来看，一定是断除了意根的结缚，当然意识的结缚也断了，两个识的结缚都要断尽，我见才能断尽，我执等等烦恼才能断尽，才能般涅槃得解脱。</p><p>每个人的意识意根的烦恼结缚轻重程度不同，导致我见的轻重程度不同，加之每个人观行五蕴的深浅程度也不同，那么断我见时断除的三縛结程度就不同，获得的解脱智慧就不同，品位就不同，解脱三界的时间长短就不同。解脱当然是解脱意根了，生死是由意根的一念无明造成的，断除结缚，不仅要断除意识，更要断除意根的结缚，意根的结缚断尽，我见就断尽，我执就断尽，就不会再主导生死轮回了。</p><p>原文：<strong>大慧。身见有二种。谓俱生及妄想。如缘起妄想。自性妄想。</strong></p><p>释：楞枷经中佛说身见有两种，一种是俱生身见，五蕴生来就有的身见，就是意根的身见，这个需要断除；另一种是妄想身见。妄，就是虚妄，不真实，不是正真，想就是了别和执取为相，执取为实，执取为我和我所，因此妄想的时候也有身见，妄想身见也需要断除。</p><p>妄想有多种，如缘起妄想，不如实的看待由各种因缘所出生的法，虚妄的执取为这些缘起法是我和我所有的，不知道这些法都是因缘出生的，都是虚妄的无常的生灭的变异的苦的，并不是我和我所。缘起妄想不仅有意识的妄想，更是有意根的妄想，二者的妄想都要断除，不要再妄想缘起法是我和我所，根本不是。</p><p>自性妄想，认为一切法都是有自体性的，有真实性的，是可依靠的，是可依赖的，于是就执取为我和我所。这种妄想里既有意识的妄想，更有意根的妄想，二者的妄想都要断除，才是断我见者。各种妄想中，以意根的妄想为主，意识的妄想为辅。</p><p>原文：<strong>譬如依缘起自性。种种妄想自性计著生。以彼非有、非无、非有无。无实妄想相故。愚夫妄想。种种妄想。自性相计著。如热时焰。鹿渴水想。是须陀洹妄想身见。彼以人无我。摄受无性。断除久远无知计著。</strong></p><p>释：譬如依缘起自性，执取缘起法有自性之后，就会生起种种的妄想，普遍计度执著缘起法，妄想缘起法非有或者是非无，不有不无，即有即无。因为这些想法都是不真实的妄想幻相，都是愚痴的凡夫众生的妄想。愚痴的凡夫对于缘起法生起种种的妄想，执著缘起法有自体的真实性，执取缘起法的所有相貌为实，为我我所。</p><p>就像天热之时沙滩上现起的虚幻的炎水，渴鹿却妄想为真实能喝的水。凡夫如渴鹿一样，把不实的幻化的五阴身当作真实的我和我所，而不断的执取之，贪生生贪。断除我见的须陀洹人，对这种妄想的身见，如实观照出五阴身无我我所，如实觉知五阴身没有自体性，断除了自己无始劫以来的对于五阴身的无知执取性。</p><p>以上的妄想身见，还是以意根的身见为主，意识的身见为辅，因为文中处处讲到了种种妄想自性计著，自性相计著，久远的无知计著。这些都是指意根的妄想身见，由意根的妄想身见起意识的妄想身见。意识的妄想身见，并不久远，只一世而已，然后就灭去。意根不灭，致使下一世的意识仍然要生起妄想身见。所以修行如果不处理好根深蒂固的意根问题，所修仅仅是皮毛，还会再生，唐捐其功。</p><p>断身见分为断意识的身见和意根的身见，那么断识心的我见，更要分为断意识的我见和意根的我见。</p><p>原文：<strong>大慧。俱生者。须陀洹身见。自他身等。四阴无色相故。色生。造及所造故。展转相因相故。大种及色不集故。须陀洹观有无品不现。身见则断。如是身见断。贪则不生。是名身见相。</strong></p><p>释：佛说，大慧，所谓的俱生身见，是须陀洹人所断的身见观察自己身和他人身等等。其中受想行识四阴没有色相，不是色身，色身是有色相的。色相出生时，形成了色身，由四大种子所造就，色相是辗转出生色身的相，是形成色身的因相。四大种子生后即灭，不能集聚起来形成色相，色相也就不能集聚成色身。因此须陀洹人观察色身时，证得了色身非有非无，非有无，这样身见就断了。</p><p>色身由各种色法组成，各种色法就是种种色相。种种色相由四大微粒组成，四大微粒由四大种子组成。前边讲表相，后边讲实质和事实。表面看色身相是存在的有作用的好像真实的，实际上没有真实的色身相，是虚幻的，是空的，是假的。比如头昏目眩的人，看见眼前的黑点狂飞乱舞，实际上并没有什么黑点，看错了。不能说黑点是有是无，不能说黑点非有无。色身相也是这样，不能说色身的有和无，以及非有无，非非有无。一切诸法，离四句，绝百非。</p><p>像这样断了身见以后，贪爱就不出生了。以上所说为真实的身见相，不有不无，也不有无。有，相上可见，不有，相是空的散坏的生灭的；无，四大不集聚，相就不集聚，不无，相上可见；非有无，不是有也不是无，有无互摄，有虚假之用，用也不真。</p><p>原文：<strong>大慧。疑相者。谓得法善见相故。及先二种身见妄想断故。疑法不生。不于余处起大师见。为净不净。是名疑相。须陀洹断。</strong></p><p>释：佛说，大慧，疑见的心相，就是所说的心里得到了对于法的如实知见的心相，善知法的相貌，善知法是如理还是不如理，以及刚才说的俱生身见和妄想身见的虚妄想断除的缘故，心里对法的疑念不再出生了，不再怀疑法究竟是如理还是不如理的。因为心中断除了疑念，就不再去别处寻找证据，以证明自己的见解是清净还是不清净的，得到了法眼净还是没有得到法眼净。有此狐疑，就是疑相，初果须陀洹人已经断了疑相。</p><p>余处，是众多外道的有与无的邪见处。须陀洹断身见断疑见以后，不再把外道有无邪见奉为圭臬，那些法清净与否，自己心中很清楚。</p><p>原文：<strong>大慧。戒取者云何。须陀洹不取戒。谓善见受生处苦相故。是故不取。大慧。取者谓愚夫。决定受习苦行。为众具乐。故求受生。彼则不取。除回向自觉胜。离妄想。无漏法相行方便。受持戒支。是名须陀洹取戒相断。</strong></p><p>释：佛说，大慧，禁取戒是什么意思？须陀洹人不取非戒，不持不能得解脱的戒。因为须陀洹善于观察持不如理戒的苦报苦果相，不能解脱生死，因此不取非戒不持不如理戒。大慧，执取不能解脱的非佛制定的戒者是愚痴的凡夫，他们一定会接受苦行而行苦行，其目的是为了得到世间诸乐，所以就会再次受生。而须陀洹人就不会执取非戒，除非是回心趣向成佛之道，自身已经离开了妄想见，心地断除了烦恼达到无漏，为方便摄受众生，才随缘示现持外道非戒相。这说明须陀洹断除了禁取戒。</p><p>原文：<strong>须陀洹断三结。贪痴不生。若须陀洹作是念。此诸结我不成就者。应有二过。堕身见。及诸结不断。大慧白佛言。世尊。世尊说众多贪欲。彼何者贪断。佛告大慧。爱乐女人。缠绵贪著种种方便。身口恶业。受现在乐。种未来苦。彼则不生。所以者何。得三昧正受乐故。是故彼断。非趣涅槃贪断。</strong></p><p>释：佛说须陀洹断除了三个结缚，贪爱和愚痴不出生。如果须陀洹心里有这样的念：这三个结缚我如果不修成就，就会有两种过失，堕入身见中以及诸烦恼结不断。大慧对佛说：世尊，您曾说过众生有众多贪欲，须陀洹人是断了哪种贪欲？佛告诉大慧，爱乐女人，缠绵贪着女人，用种种手段方式，造作身恶行和口恶行，享受当下的快乐，种下未来世的苦果。这种贪爱须陀洹人断了，不再出生了。为什么如此呢？因为须陀洹人观行断我见时有三昧乐受，不需要贪图女人之乐。因此贪爱断，不是断除了趣向于涅槃乐的贪。</p><p>这是说须陀洹人某种贪不生，不是全部的贪不出生，全部贪不出生是三果人。初果身见三缚结断除了，对于异性的缠绵贪不出生，因为有三昧乐受的缘故。所谓的三昧乐受，是初果证果时的禅定觉受和觉明现象。所以证初果必须有禅定，有未到地定，然后证初果时，才有三昧境界，包括禅定和断我见的智慧。</p><p>所以有人说证初果不需要禅定，是违背佛意的。凡是认为自己断我见证得初果的人，如果在证果时没有出现三昧乐受现象，一定没有断我见。证果以后，烦恼仍然如从前一样，也一定没有断我见，没有断除三缚结。那就要对自己负责任，对未来世的果报负责任，再重新修定观行参究五蕴无我法。佛已经说得很清楚了，初果断除三缚结以后一定要断除一部分的贪和痴，烦恼有所降伏。初果人开始法眼净，一定有法眼净的功德受用，一定有一部分解脱的功德受用。如果没有，一定没有断我见，一定没有证果。</p><p>娑婆世界，尤其是去佛二千多年的如今末法时期，绝对不会出现满大街都是圣人的现象，即使是释迦佛在世，也没有出现满大街都是圣人的现象。五浊恶世，毕竟叫作五浊恶世，与其他世界有极大的差别，与弥勒佛出世的时代差别都是极大的。满天下是圣人，那纯属是一厢情愿的妄想，梦中未必能见。</p><p>凡是自我认为断我见和明心了，而仍然有非法男女关系的，一定没有断我见三缚结，一定没有明心。楞枷经中佛说，有三昧乐受故，不受男女乐。岂能断除了三缚结，还能男女之间痴痴绵绵、戚戚爱爱的纠缠不清？那说明自己没有三昧乐受，有三昧乐受就会排斥男女之乐，不再喜欢男女之乐，因为三昧乐受远远殊胜于男女之乐受，谁也不会选择最低劣的乐受，而舍弃殊胜的乐受，一般的人都不会这样做。</p><p><strong>十八、</strong>楞伽经原文：<strong>大慧。云何斯陀含相。谓顿照色相妄想。生相见相不生。善见禅趣相故。顿来此世。尽苦际。得涅槃。是故名斯陀含。大慧。云何阿那含。谓过去未来现在色相。性非性。生见过患。使妄想不生故。及结断。故名阿那含。</strong></p><p>释：佛说，大慧，二果斯陀含有什么相貌？斯陀含在与人接触时能立时看透自他色身相，对色身没有妄想，知其无生，没有真实的出生，其相苦空无常无我，见相即知，不用意识思惟。意根在初果时就知，再熏修到达二果时知的更深更透。斯陀含善于观察禅定的相貌和趣向，命终到天上，再从天上直接回到人间，以灭尽苦际，证得无余涅槃。因此称作斯陀含。</p><p>大慧，三果阿那含是什么相貌？阿那含知过去未来现在的色身相，其性无自体性，能见色身出生的过患，知妄想色身为我和我所的过患，对于色身相没有妄想，加之初禅定的力量，断除了一切贪欲和嗔恚的现行烦恼，因此就称作三果阿那含。</p><p>原文：<strong>大慧。阿罗汉者。谓诸禅三昧解脱力。明烦恼苦。妄想非性。故名阿罗汉。大慧白佛言。世尊。世尊说三种阿罗汉。此说何等阿罗汉。世尊。为得寂静一乘道。为菩萨摩诃萨方便示现阿罗汉。为佛化化。</strong></p><p>释：佛说，大慧，什么是阿罗汉呢？阿罗汉就是证得了四禅八定三昧，以三昧的解脱力，明了世间一切烦恼的苦，因此断除了所有一念无明烦恼，知自心妄想没有实性，因此心离一切妄想，妄想不生，所以称作阿罗汉。大慧对佛说，世尊，您说过有三种阿罗汉，现在说说的是哪种阿罗汉？是一直趣向无余涅槃，得寂静解脱道的阿罗汉，还是菩萨摩诃萨为了度众生方便所故意示现的阿罗汉，还是佛为了度化众生所示现的阿罗汉？</p><p>原文：<strong>佛告大慧。得寂静一乘道声闻。非余。余者。行菩萨行。及佛化化。巧方便。本愿故。于大众示现受生。为庄严佛眷属故。大慧。于妄想处。种种说法。谓得果得禅。禅者入禅。悉远离故。示现得自心现量。得果相。说名得果。</strong></p><p>释：佛告诉大慧，我现在说的是趣向寂静解脱道的阿罗汉，他们为了尽快解脱，努力修四禅八定，以禅定力得解脱，入无余涅槃。不是说的其他两种阿罗汉，行菩萨行的阿罗汉和佛所化现的阿罗汉，是权巧方便示现阿罗汉行，是菩萨和佛的本愿力缘故，在大众中示现受生为阿罗汉的身份，也是为了庄严佛的眷属的缘故。</p><p>大慧，佛菩萨于众生所妄想之处，种种说法，说如此修行能证得阿罗汉果，如此修行能证得四禅八定，修禅定就能入定中。这些也都属于不实的妄想，是幻化不生相，都应该远离（才能入到真实中）。诸佛菩萨示现开大智慧，涌现出自心现量境界，示现得初果到四果相貌，起一个名相，叫作得果，实际没有果，也没有得果人，都是妄想。（只有自心不生灭的那个，才不是妄想。）</p><p><strong>十九、楞伽经中的五法、三自性、七种性自性、七种第一义、两种无我法</strong></p><p>（一）五法就是相、名、分别、正智、如如。</p><p>相，就是如来藏出生出来的一切法相，包括色法相和心法相以及非色非心的法相。色法，是四大组成的六尘，色声香味触法都有其一定的相貌，能被六识所识别和了知；心法是七识心以及心所法，也有一定的相貌，有运行的行相能被意识所识别和了知；非色非心法，如二十四不相应行法，由八个识、心所法和色法所共同显现出来的一种假相，既非色也非心，也有一定的行相，能被意识所了别。</p><p>这些相，还包括四相：我相（五阴十八界的相）、人相、众生相、寿者相，定境相、睡眠相、昏迷相、死亡相、中阴身相、入胎相、住胎相、出胎相、成长相、变异相、毁坏相、欲界相、色界相、无色界相、十方世界相、华藏世界相、世界海相。这些相能被意识了知了别，还有一些能被意根所了知的相，意识不一定能了知到，也包括能被五识所了知的相，也包括暂时还不能被七识所了知的相。</p><p>名，就是名字、名称，与相相符。为了便于区别各种相、称呼各种相、交流各种相，就把各种相分别安立相应的名字，一个相可以有一个名字或者多个名字，从不同的角度立名，依不同的用处立名，不同的人群不同的语言立不同的名字，不同的时代也立不同的名字，有时一个名字也代表一个或者多个相。这些相都是如来藏依各种缘变现出来的虚相，何况依着虚相而立的名字，更是虚幻不实。</p><p>比如依着五阴的相，就把色身立名为色阴，把六识的感受相立名为受阴，把六识的执取相立名为想阴，把六识的运行行相立名为行阴，把六识的了知相立名为识阴。依着十八界的相，分别立名为眼耳鼻舌身意根、色声香味触法尘、眼耳鼻舌身意识，十八界的名字就安立出来了。五阴本虚妄，五阴之名是妄上加妄，何必执取不断，念念攀缘计较，十八界也本虚妄，十八界之名更是虚妄，何必执著不已，结生死之绳缚。</p><p>五法相、名、分别、正智、如如，其中的分别，是指识心的了知性，五识了别五尘，意识和第七识了别法尘。正智，就是正确如实的智慧，正确的知见和见地，依真如自性而有，是证得真如自性以后出生的般若智慧，因此名为正智。如如，就是真如自性，是第八识的真实如如性。</p><p>（二）三自性：依他起性、遍计所执性、圆成实性。依他起性是指六识心之性，六识依第八识、意根、六尘、五根、业缘而现起， 缘散即灭，无有自性，虚妄无实。</p><p>遍计所执性是指意根末那识，依第八识而普遍计度执著一切法为真实，执取为我为我所，七识都如阳炎，幻化不实。</p><p>圆成实性是指第八识，能依缘依业种圆满成就一切法，如实实现众生的业因果报。</p><p>（三）七种性自性：集性自性，性自性，相性自性，大种性自性，因性自性，缘性自性，成性自性。</p><p>集性自性，是第八识能积集收藏众生造作的所有业行，作为业种收存，缘熟即能如实实现众生的善恶无记业报之性。</p><p>性自性，是指第八识所具有的所有体性，比如出生种子的体性，搜集业种的体性，实现业报之性，让众生异时异地异类受报的异熟性，清净寂静性，没有见闻觉知性，八不中道无量不的中道性，圆满成就一切法性，成佛之性，真实而如如之性等等。</p><p>相性自性，是指第八识能出生世间一切法相之性，能出生色法相，也能出生心法相，又能显现非色非心法相。</p><p>大种性自性，是指第八识能依七大种子或者六大种子，出生世出世间一切法之性，其中依四大种子与空大种子共同出生三界世间的色法，依识大种子，能出生五阴世间的心法，依七大种子又能显现出心所法和非色非心法。</p><p>因性自性，是指第八识是世出世间一切万法之因，一切万法依第八识而有而显现，不管是善法和恶法，以及不善不恶之法，都依第八识而有，一切因果都依第八识而实现，一切世俗法都依第八识而生，一切佛法都依第八识而有，总之，第八识是一切万法之因。</p><p>缘性自性，是指第八识能出生一切法，然后又能缘于一切法而运行不断，一切法都是第八识的亲所缘缘，一切法与第八识不可分离，第八识也不离一切法，二者永远互相依赖，犹如束芦。</p><p>成性自性，是指第八识的圆成实性，祂能依各种缘而圆满成就世间一切万法，而无一丝一毫的错乱，一切法都依第八识而安立而出生。</p><p>（四）七种第一义：心境界、慧境界、智境界、见境界、超二见境界、超子地境界、如来自到境界。</p><p>心境界，指第八识的心行，这需要明心证悟，获得般若智慧以后，才能了知到第八识所处的种种心境界，才能证知和现前观察第八识的心行及运行之各种行相，在明心之前，只能想象和猜测，不能实证，也不能真知。</p><p>慧境界，指第八识在五阴世间运行时，于五阴六尘境界不觉不知的无分别智慧境界，而同时又能了别众生的业种、了别七识心行的智慧境界，也能了别根、身、器、界的现行状态的智慧境界。第八识的这种智慧境界，唯有证悟之人能慢慢了别到，证悟之人在明心以后，不仅要有般若的总相智慧，更要有般若的别相智慧，才能观行到第八识在与五阴身配合运行时的分别性与不分别性，了知第八识的慧境界，了知第八识配合七识的运作，了知第八识能与意根一起入胎和舍身，配合意根现起万法，配合意根了别万法的种种智慧境界。</p><p>智境界，指第八识在三界世间运行时的大智慧境界，能依业种出生众生的五阴身，用六大种子变造三界世间五阴世界，用七大种子现起法界当中的一切法相。证悟之菩萨具足般若的别相智之后，能渐渐观察到第八识诸多的法性和法相，知世间一切法相皆是第八识的大种性自性，都是第八识用六大种子变现出来的，皆是第八识的七大种子运行的结果，没有一法能超出第八识之外，由于此妙观察故，渐渐获得甚深的妙观察智。</p><p>见境界，指第八识所具有的人无我、法无我的二无我的空性境界。菩萨在明心见性以后，获得无生法忍智慧，也能依第八识的二无我空境界，证得五阴十八界的人无我，实证色身以及见闻觉知心的虚妄，断尽我执烦恼及烦恼习气，有能力取证无余涅槃；同时也证得诸法无我，了知三界世间一切法，都是第八识与各种业缘和合而有，没有自性，也没有实质性，都是幻化不实的；而第八识也没有自我的执见，不自觉知自我，也是无我性的，菩萨因此而证知诸法确实无我，断尽法有真实性的法我见，从此进入空、无相、无作三昧中，心得大寂静，渐入八地菩萨境界，能随时入无余涅槃中而不入。</p><p>超二见境界，指第八识超越生死和涅槃，既不生死也不涅槃，生死涅槃皆为第八识之性。菩萨无生法忍智慧修证到八地菩萨，其智慧超越了一切法有无的二种知见，超越生死与涅槃的二种知见，实证一切法皆为空中花，实无所得，因此不住生死也不住无余涅槃，念念修行利乐众生，渐渐趣向佛地无住处涅槃。</p><p>超子地境界，八地菩萨继续进修到等觉菩萨果位，超越了佛子之位，处于补佛位，待时节因缘具足，绍继佛位，弘法利生永不停息。</p><p>如来自到境界，诸佛如来八个识全部转识成智，大圆镜智现前，圆满修证了一切法，世出世间无一法不知不晓，不但了分段生死，也断变易生死，生死已尽，无明已灭尽；福德与智慧圆满具足，无人能比，堪为三界之尊，从此除了永无穷尽的利乐众生，别无他事。</p><p>（五）二种无我法：人无我、法无我。人无我是指五阴十八界无我无我所，五阴色受想行识是生灭虚幻的，不是真实的，没有自性，没有自主性，因此不是我，没有我性。十八界六根六尘六识是生灭虚幻的，不是真实的，没有自性，不能自主，因此不是我，没有我性。十二处六根六尘是生灭虚幻的，不是真实的，没有自性，不能自主，因此不是我，没有我性。</p><p>法无我是指世间出世间所存在的一切法，包括色法和心法、非色非心法、真实法和虚妄法、凡是第八识所变出的一切法，都是无我的。</p></div>"
},{
    "title": "第七章　佛经中语句段落讲解（二）",
    "author": "生如法师",
    "date": "2019年07月10日",
    "html": "<div class=\"B1_text\"><p><strong>二十、大乘密严经</strong></p><p>原文：<strong>善男子。色无觉知。无有思虑。生已必灭。同于草木瓦石之类。微尘集成。如水聚沫。受以二法。和合而生。犹如浮泡瓶衣等。想亦二和合。因缘所生。如热时焰。譬如盛热地气蒸涌。照以日光如水波浪。诸鸟兽等。为渴所逼。远而见之。生真水解。想亦如是。无有体性。虚妄不实。</strong></p><p>释：这段经文讲五蕴的不真实性和幻化性。佛说，善男子，色藴犹如草木瓦石，四大微尘组成，如水集聚成的泡沫，本身没有觉知和思虑的作用。受藴是因缘和合而生，识心加之于色身，就有了受藴，就像大海中的泡沫一样，速生速灭；就像泥土做成的泥瓶、布匹做成的衣服一样，非本来有，有也不真。想藴也是因缘和合而有，识心加之于色身，就有了想的功能作用，犹如夏日的阳炎一样，虚妄不实。譬如炎热的夏天，土地热气蒸发，涌向虚空，日光照射下来，水蒸气犹如水波一样。鸟兽们为口渴所逼迫，远远的看见就认为是真的水。想蕴就是这样，没有真正的自体性，虚妄不实。众生贪于色身六尘，就妄见有五欲六尘境界。</p><p>原文：<strong>分别智者。如有性见。各别体相。名字可得。定者审观。犹如兔角石女儿等。但有假名。初无实义。如梦中色。唯想妄见。寤即非有。无明梦中。见男女等。种种之色。成于正觉。即无所见。</strong></p><p>释：有辨别智慧的人，知道这些现象都没有真实的体性可得，全部虚妄幻化，只是名字而已，了不可得。仔细观察，就会发觉，这些法就像兔子的角和石女生出的儿子一样，根本不存在，只有假名字，没有真实义。世间一切法都只是个假名字，本没有实际的意义，就像梦中所见的色一样，因为意根的妄想，才有色可见，才能见色，醒后却一无所有。众生因为无明，处在无明梦中，虚妄地见有男女等等种种色，其实与梦中所见是一样的。佛从无明大梦中彻底醒来，觉知一切法都犹如空花，一法也无，都是自心真如所变现的虚妄相，本质都是自心真如而已，并无一切法。</p><p>想蕴依赖各种条件而暂时存在，生起虚妄的分别作用，于是就有了能取的识心与所取的六尘境界，如果自己能够了知其中的真实相，这一切的虚妄见性与所见的相，就不会存在了，不会再妄取这些虚妄的识心与幻尘，能取所取全部灭去。因此五蕴没有实体，没有实在的功能作用，没有自性，都同于幻化。</p><p>原文：譬如芭蕉。皮叶既除。中无有实。行亦如是。离于身境即无体性。识如幻事虚伪不实。譬如幻师。若幻师弟子。以草木等物。幻作于人。及诸象马。种种形体。具足庄严。愚幻贪求。非明智者。识亦如是。依余而住。而异分别。谓能所取。二种而生。若自了知。即皆转灭。是故无体。同于幻事。</p><p>譬如芭蕉剥皮，皮和叶子已经都除去了，到最后却空空如也，行藴也如此，离开身根等等境界就没有了自体性。识藴如幻化，虚伪不实。譬如一个魔幻师或者是魔幻师的弟子，用草木等等物件，幻化出了人物以及种种大象和马匹，种种装饰庄严。愚痴的人于是就虚妄的生起了贪求和欲望，智者了知都是幻化，不会起諸贪求。</p><p>识藴也是如此没有自体性，依于他法而住，因缘而生暂时存在，再生起虚妄的分别作用，于是就有了能取的识心与所取的六尘境界两种法出现了。如果自己能够了知其中的真实相，那么这一切的虚妄见性与所见的相，就会都灭去不存在了，不再有妄取的识心与幻尘，能取所取全部灭去。因此五蕴没有实体，也没有实在的功能作用，没有自体性，都同于幻化。</p><p><strong>二十一、善恶业报占察经（上卷）</strong></p><p>原文：<strong>学唯心识观者。所谓于一切时一切处。随身口意。有所作业。悉当观察。知唯是心。乃至一切境界。若心住念。皆当察知。勿令使心。无记攀缘。不自觉知。于念念间。悉应观察。随心有所缘念。还当使心。随逐彼念。令心自知。</strong></p><p>释：修学观察一切法皆为是心的人，要这样修行，在一切时一切处，自己身口意所造作的一切心行，全部都要观察清楚，了知身口意行只是一个心，除此无他。乃至于遇到一切境界，如果心识有所攀缘，有所停留，有所着境，认境为实，都应该察觉到了知到，不要使得心识攀缘境界，落入无记当中，而不觉知已经住境失心了。在念念之间，都要观察到，如果心识里有所攀缘境界的念头思想，就应该观察到念头起处，让自己知道自己的念头是什么，然后摄心守心，不令驰散。这就要动用意识的反观力、觉知力、觉察力，多对自心加以观照和把持。</p><p>原文：<strong>知己内心。自生想念。非一切境界。有念有分别也。所谓内心自生。长短好恶。是非得失。衰利有无等见。无量诸想。而一切境界。未曾有想。起于分别。当知一切境界。自无分别想故。即自非长非短。非好非恶。乃至非有非无。离一切相。</strong></p><p>释：这时应当知道自己内心自动生起了念想，并不是一切境界有念想有分别，念想和分别的是心，非境界。内心里遇缘自动生起长短、好恶、是非、得失、利衰、有无等等见解，有无量多的想法和看法。可是一切境界本身并没有什么想法而去起分别。所以应当知道一切境界本身没有什么分别的念想，那么境界本身就没有长短、好恶、以及有无，非有非无，境界离一切相。</p><p>原文：<strong>如是观察。一切法唯心想生。若使离心。则无一法一相。而能自见。有差别也。当应如是。守记内心。知唯妄念。无实境界。勿令休废。是名修学。唯心识观。若心无记。不知自心念者。即谓有前境界。不名唯心识观。</strong></p><p>释：如是观察之后，就知道一切法都是心想而生出来的。如果离开心想，则没有一个法一个相自己能见到其有任何的差别。应当如是守持内心，让心知道都是妄念而已，没有什么真实的境界，不要使心的修行半途而废。这就是修学唯心识观的方法。如果心里处于无记的状态，不觉悟的状态，没有了觉知力觉照力，不知道自己的心念是什么了，那么心里就有了前尘影境，就不能叫作唯心识观。</p><p>原文：<strong>又守记内心者。则知贪想嗔想。及愚痴邪见想。知善知不善。知无记。知心劳虑。种种诸苦。若于坐时。随心所缘。念念观知。唯心生灭。譬如水流灯焰。无暂时住。从是当得。色寂三昧。</strong></p><p>释：另外守持内心觉察内心的人，就应该觉知到自己内心的贪欲想、嗔恚想以及愚痴邪见的妄想，应该能觉知到自己是善、是恶，还是不善不恶的无记，应该能觉知到心里的劳虑之种种苦恼。如果在静坐之时，随着内心的攀缘，念念都要观察到每个念头都只是心的生灭相而已。譬如水的流动和灯的火焰，没有暂时停住之时。这样就能得到色法空寂三昧。</p><p>原文：<strong>得此三昧已。次应学习。信奢摩他观心。及信毗婆舍那观心。习信奢摩他观心者。思惟内心。不可见相。圆满不动。无来无去。本性不生。离分别故。习信毗婆舍那观心者。想见内外色。随心生随心灭。</strong></p><p>释：证得这种三昧以后，再次应当修习信解奢摩他观心方法，以及信解毗婆舍那观心方法。修习奢摩他（止和定）观心的人，要思惟内心里的不可见的那个相貌，圆满一切法而自心却不动摇，在一切法上不来也不去，本性不是生的，是本来就有的，对一切法又离一切的分别。修习信解毗婆舍那（观和慧）观心的人，如果想要见内外一切色法，一切色法就会随心想生，随心想灭。</p><p>原文：<strong>乃至习想。见佛色身。亦复如是。随心生随心灭。如幻如化。如水中月。如镜中像。非心不离心。非来非不来。非去非不去。非生非不生。非作非不作。</strong></p><p>释：乃至于修习想见佛陀的金色身，也能做得到，佛的金色身也能随心想生，随心想灭，如幻如化，如水中的月亮，如镜中的像，非心也不离心而有，非来也非不来，非去也非不去，非生非不生，非作非不作。佛像是心幻化的，在心上显现，没有来相，但是像却出现了，也非不来；非去也非不去，佛像灭去时，心上没有相了，像不是去，但是像不见了，也非不去；非生也非不生，佛像在心上显现，不是生出来的，但是佛像毕竟从无到有，也不是不生的；非作也非不作，佛像是幻化的，不是真实造作出来的，但是佛像是通过观想出来的，也非不是造作出来的。</p><p>原文：<strong>善男子。若能习信。此二观心者。速得趣会。一乘之道。当知如是。唯心识观。名为最上。智慧之门。所谓能令。其心猛利。长信解力。疾入空义。得发无上。大菩提心故。</strong></p><p>释：善男子，如果能修习信解这两种观心法门的人，能快速趣向一佛乘之道。应当知道，这样的唯心识观是为最上智慧的法门，能令其心勇猛精进，增长信解的力量，快速的进入一切法皆为空性的义理中，能发无上大菩提心。</p><p><strong>二十二、善恶业报占察经（下卷）</strong></p><p>原文：<strong>若学习真如实观者。思惟心性。无生无灭。不住见闻觉知。永离一切。分别之想。渐渐能过。空处识处无少处。非想非非想处等。定境界相。得相似空三昧。得相似空三昧时。识想受行。粗分别相。不现在前。从此修学。为善知识大慈悲者。守护长养。是故离诸障碍。勤修不废。展转能入。心寂三昧。</strong></p><p>释：如果有人要修习真如实观，就要思惟无始本来心性的不生不灭性，不住在见闻觉知上，对世俗境无见无闻无觉无知，永远离于一切分别境界之念想。随着甚深的思惟，认识到这样的真实心性之后，心渐入定，七识心念逐渐空净，禅定逐渐转深，入到深定中渐渐不住见闻觉知，永远离开一切有分别的念想，进入四禅之上的外道定中。其禅定渐渐就能到达空无边处、识无边处、无所有处、非想非非想处等等境界相，证得相似空的三昧。</p><p>相似空三昧，以定境为主为上，智慧上还没有证得真如空性只是相似于真如空的境界，是意识由于对空性的认知，心清净寂静，压伏住了意根而得到的一种定境，意根并没有空，是意识单独认识的空。这也是一种三昧，有定有慧，只是慧力还不足。所以只是意识的受蕴想蕴行蕴的粗略的分别没有了不现前了，但细微的受想行蕴的分别还是不断的出现。证得相似空三昧以后，识阴、想阴、受阴、行阴的粗略的分别相，就不再出现了，只有意识的极其微细的分别相存在。</p><p>修到这种境界以后，从此以后的修学，明里暗里就会有善知识和诸佛菩萨大慈悲者来守护培养，就会增长养护自己的善根。因此能让自己的修行避开业障的遮挡，能一直精勤修行下去，永远不会半途而废。这样辗转的就能入到心寂三昧中，就是逐渐进入到真正的空性中，见到那个空空寂寂的心，从而证得心寂三昧。这是在相似空三昧的基础上，继续深入观行参究，慧力又进一步增强，观行空性心的智慧也更深入究竟了，意根受熏成功，心空寂静，进而出现心寂三昧，般若智慧具足了。</p><p>原文：<strong>得是三昧已。即复能入。一行三昧。入是一行三昧已。见佛无数。发深广行。心住坚信位。所谓于奢摩他毗婆舍那。二种观道。决定信解。能决定向。随所修学。世间诸禅。三昧之业。无所乐著。乃至遍修一切。善根菩提分法。于生死中。无所怯畏。不乐二乘。以依能习向二观心。最妙巧便。众智所依。行根本故。</strong></p><p>释：证得这种心寂三昧以后，随即就能入到一行三昧中。入到一行三昧以后，定中能见无数佛，心心念念时时处处见自性佛，见十方诸佛，也就是能见所有众生的如来藏，明了所有众生的如来藏在五阴身上的起用，因此发起广大而甚深的菩萨大行，内心坚信所修之道，住在坚固的对三宝深信位，而不退转。</p><p>对于奢摩他的观行方法和毗婆舍那的观行方法深信不疑，有坚固的信念，决定信解，也能决定趣向。此人能随自己所修学的世间所有禅定境界，而不贪着三昧境界，不乐着三昧境界，修出即舍。最后修遍了所有一切菩提道的分证方法，具足了一切善根，在生死当中再也没有畏惧，不乐于二乘法，不求取涅槃，而依止于修习奢摩他和毗婆舍那二种观心的最妙最巧最便捷的方法，因为这两种观心方法是一切智慧所依止处，是修行的根本方法。</p><p>如果是通过念佛证入一行三昧，在相上就会看见十方诸佛在自己面前立，这是独影境，别人看不见，只能自己见，处于甚深三昧中，行走坐卧都在定中，明了本心，有般若智慧。修道明心证悟，需要经过这三种三昧，没有禅定是不可能明心证悟的，第一层次的三昧也不会出现，意识的粗分别相都断不了，心攀缘不定，降伏不了意根，与相似空也不相应。可是却有很多人还没有修到第一层次的相似空三昧，就认为自己悟了，真是把自己误了。</p><p>原文：<strong>复次。修学如上信解者。人有二种。何等为二。一者利根。二者钝根。其利根者。先已能知一切。外诸境界。唯心所作。虚诳不实。如梦如幻等。决定无有疑虑。阴盖轻微。散乱心少。如是等人。即应学习。真如实观。</strong></p><p><strong>其钝根者。先未能知一切。外诸境界。悉唯是心。虚诳不实故。染著情厚。盖障数起。心难调伏。应当先学。唯心识观。</strong></p><p>释：复次，修学如上两种信解的人有二种，一种是利根之人，一种是钝根之人。其中利根的人，早先就已经知道了一切外面的境界，都是心识所造作出来的，虚诳不实，如梦如幻，其心对此再也没有疑惑，五阴身的遮盖很轻微，散乱心也少。这样的人，应该修习真如实观，观行一切法皆真如自性，包括五蕴十八界也都是真如自性，这就是唯识种智。</p><p>其中钝根的人，原来并不知道一切外在的境界，全部都是心识造作出来的，不知道境界虚诳不实，所以对六尘境界贪染心浓厚，五阴的遮盖时时而起，心难调伏下来，这样的人就应该修学唯心识观，观行一切境界，都是识心所现，是妄想境界，虚诳的妄心所显现出来的。</p><p>唯心识观是观行一切六尘境界，因妄心分别而显现，无分别即无境界，属于基础浅层次的观行方法。真如实观属于大乘唯识深层次的观行方法，观行一切法都是真如自性所出生和显现，全部是真如。两种观行方法，获得的智慧境界不同。</p><p><strong>二十三、大涅槃经原文：又解脱者，名断一切有为之法，出生一切无漏善法，断塞诸道，所谓若我无我、非我非无我。唯断取著，不断我见。我见者名为佛性，佛性者即真解脱，真解脱者即是如来。</strong></p><p>释：所谓的解脱，就是断除了世间一切有为之法，出生了一切无贪嗔痴烦恼的善法，截断堵塞了三界世间一切有为法的通道。这些无漏善法或者是我（第八识）或者是无我（六七识所证），非有我（六七识）与非无我（第八识）。我，一是指第八识，二是指六七识。无我，一是指第八识，二是指六七识。</p><p>证悟之前，六七识是我有我，证悟之后，六七识非我无我，认第八识为我。虽然认第八识为我，第八识也是无我的，没有六七识那样的我性作主性执取性无明性。</p><p>总结起来说，第八识是我无我性，六七识非我却有我性。六七识断我见之后无我，知我非我，明心以后逐渐以第八识为我，逐渐无我性。</p><p>这样只是断除了对五蕴世间法的取着，并没有断除我见。这个我见就是指自身的真如佛性，第八识成佛之性者，即是真解脱，真解脱者即是如来。</p><p><strong>二十四、大涅槃经段落解析</strong></p><p>有智之人，就是明心见性之人，他们知五阴世间的空，也知不空的第八识真如；知五阴世间的无常，也知佛地真如的常；知五阴世间的苦，也知真如的寂灭乐；知五阴世间的无我，也知具足了我性的无垢识，世俗谛与真谛二谛圆通。苦空无常无我者，即是五阴世间的生死轮回，常乐我净者，即是佛地的大涅槃。见一切无我，不见有我者，即是二乘人见，不是中道见；中道见即见空也见不空，即是大乘见道者的中道见。涅槃心即是中道心，见者就是中道见，也名见中道。</p><p><strong>二十五、法灭尽经原文：佛法灭尽时，首楞严经、波舟三昧经先化灭去，十二部经寻后复灭，尽不复现，不见文字。沙门袈裟自然变白。</strong></p><p>释：佛说，佛法灭尽的时候，首楞严经和波舟三昧经首先灭去，佛在娑婆世界所讲的十二部经不久之后也灭去了，一点也找不到了，众生再也看不见这些文字了。出家人的黑色袈裟自然的就变成了在家人穿的白色衣服。</p><p>沙门，是穿黑色袈裟的出家人，穿白色衣服的是在家人。袈裟变白，寓意着出家人都还俗回家了，或者是没有人出家了。结果是，佛法灭尽了。这表明佛法由最初以至最后，都由出家人来荷担和传播，如果没有出家人，就没有人传播，佛法必灭亡。一个恶人如果穿上出家服，走在大街上，有人见到就联想到佛和佛法，那就给这个人种下了种子，种下了善根。这个出家人就是福田，无意当中就积了福。这是佛经里说的，在家人就没有这个功德利益，所以出家就是来表这个法的。</p><p>所以我们作为佛弟子，有义务护持佛留下来的佛法宝藏，最好的护持就是出家修道，以出家身传播佛法，以让佛法发扬光大。如果有人已经心出家了，那就让身也出家。因为身没有自主性，完全由心主宰，听命于心，只要心出家，身出家就没有什么妨碍，心只要一个决定一个命令，身必然无条件服从。</p><p>所以心出家的人，应该在世间里没有什么挂碍了，不贪世俗五欲乐，不贪世俗财色名食睡，不贪世俗色声香味触。至于说世间的职责，那远远不如佛教三宝的职责重要。过去时有多少国王皇帝大臣宰官身肩负着整个国家兴衰的重任，肩负全国人民的重托，又是妻妾成群，儿女家眷众多，可是他们义无反顾的还是出家修道了。而佛世时的人由于妻子孩子没有地位没有自主权，从属于丈夫和父亲，生活全部依赖于丈夫和父亲，男人们为了能够跟随佛陀出家，不得不把自己的妻子儿女送给他人，免得他们没有人照顾，生活没有着落。他们出家修道，一是为求清净，二是为整个佛教。佛教因为有这么多大福德之人出家护持，才得以兴盛，代代相传至今。</p><p>那我们如今末世时的佛弟子，既然已经心出家了，还有什么理由，身不能出家呢？如果是意识心出家，就不能保证和促使身出家；意根如果出家了，才能保证和决定身也要出家。那么只有意识证果和明心见性，意根没有证果和明心见性，就放不下世俗利益，不愿意脱离世俗让身也同时出家。</p><p><strong>二十六、《增壹阿含经》卷第四十六</strong></p><p>原文：<strong>有十一法阿罗汉所不习者。云何为十一。漏尽阿罗汉终不舍法服习白衣行。漏尽阿罗汉终不习不净行。漏尽阿罗汉终不杀生。 漏尽阿罗汉终不盗。漏尽阿罗汉食终不留遗余。漏尽阿罗汉终不妄语。漏尽阿罗汉终不群类相佐。漏尽阿罗汉终不吐恶言。漏尽阿罗汉终不有狐疑。漏尽阿罗汉终不恐惧。漏尽阿罗汉终不受余师。又不更受胞胎。诸贤士。是谓漏尽阿罗汉终不处十一之地。</strong></p><p>释：有十一种法是阿罗汉所不再造作的，是哪十一种？第一种，烦恼已经断尽的阿罗汉永远不会舍弃袈裟而去做在家白衣世俗之事。第二种，烦恼断尽的阿罗汉永远不再有不清净的男女欲贪。第三种，烦恼断尽的阿罗汉永远不再杀生。第四种，烦恼断尽的阿罗汉永远不再偷盗。第五种，烦恼断尽的阿罗汉饭食时，不再剩饭留余食。第六种，烦恼断尽的阿罗汉永远不再妄语。第七种，烦恼断尽的阿罗汉永远不会拉帮结派，自当团体头目。他们与世俗人情不同，喜独而不喜群类相扶相植，没有自我的什么欲望和心思。第八种，烦恼断尽的阿罗汉永远不会口出恶言。第九种，烦恼断尽的阿罗汉永远不会对佛法有所狐疑不信。第十种，烦恼断尽的阿罗汉永远不会再心生恐惧。第十一种，烦恼断尽的阿罗汉，是小乘的无学圣人，不用再跟其他人修学解脱生死之小乘法，也不再投生入母胎。诸位贤士们，这就叫作漏尽阿罗汉永远不处十一种境地。</p><p>如果阿罗汉还搞一点点世间法，心在世间法一点点，就不是阿罗汉，所以阿罗汉都是出家人，不能在家过活一天。如果他还俗回家，马上就是三果人。但是他在世俗法里生活不会超过三个月，就会厌腻，然后又出家，又会证得四果阿罗汉。即使有还俗的阿罗汉也是慧解脱的阿罗汉，禅定不是特别好，俱解脱的阿罗汉永远不会动还俗的念头，他们不能忍受一点点世俗法。</p><p>大乘菩萨如果是证得三果四果，也不愿意在世俗法里过活，不搞世俗事，即使有无数财宝让自己去取，也不愿意费心思。为了度众生与众生在一起，那是没办法的事，即使在一起，心也是远离的。即使弘法用钱，也不愿意动脑筋搞钱，不愿意迎合非法和世俗法。</p><p><strong>二十七、中阿含经第十漏尽经</strong></p><p>原文：<strong>世尊告诸比丘。以知以见故诸漏得尽。非不知。非不见也。云何以知以见故诸漏得尽耶。有正思惟不正思惟。若不正思惟者。未生欲漏而生。已生便增广。未生有漏无明漏而生。已生便增广。若正思惟者。未生欲漏而不生。已生便灭。未生有漏无明漏而不生。已生便灭。</strong></p><p>释：世尊告诉诸比丘们说：因为知法见法的缘故，诸烦恼漏才能断尽，并不是不知法不见法能断尽烦恼漏。为什么说知法见法烦恼才能断尽呢？众生的思惟有正思维和不正思维的区别，如果众生不正思维的话，还没有生起的贪欲烦恼就会生起来，已经生起的贪欲烦恼就会继续增广；还没有生起的三界有的烦恼无明漏就会生起，已经生起的三界有漏和无明漏就会增广。如果众生正思维的话，还没有出生的贪欲烦恼就不会出生，已经出生的贪欲烦恼就会灭去；还没有生起的三界有漏和无明漏就不会生起，已经生起的三界有漏和无明漏就会灭尽。</p><p>原文：<strong>然凡夫愚人不得闻正法。不值真知识。不知圣法。不调御圣法。不知如真法。不正思惟者。未生欲漏而生。已生便增广。未生有漏无明漏而生。已生便增广。正思惟者。未生欲漏而不生。已生便灭。未生有漏无明漏而不生。已生便灭。不知如真法故。不应念法而念。应念法而不念。以不应念法而念。应念法而不念故。未生欲漏而生。已生便增广。未生有漏无明漏而生。已生便增广。</strong></p><p>释：可是一般的凡夫愚痴人闻不到正法，遇不到真知识，不知圣人之法，也不会驾驭圣人之法，不知真实之法，也不能正确如理思惟的人，还没有出生的贪欲烦恼就会出生，已经生起的贪欲漏就会增广；还没有生起的三界有漏和无明漏就会生起，已经生起的就会增广。而能够正确如理思惟的人，还没有生起的贪欲漏就不会出生，已经生起的贪欲漏就会灭去；还没有生起的三界有漏和无明漏就不会再生起，已经生起的就会灭尽。</p><p>众生因为不知道真实的法，不应该念着的不善法而常常念着，应该念着的善法而不念。因为不应该念着的法而念着，应该念着的法而不念的缘故，还没有生起的贪欲烦恼漏就会生起，已经生起的就会增广；还没有生起的烦恼漏和无明漏就会生起，已经生起的就会增广。</p><p>原文：<strong>多闻圣弟子得闻正法。值真知识。调御圣法。知如真法。不正思惟者。未生欲漏而生。已生便增广。未生有漏无明漏而生。已生便增广。正思惟者。未生欲漏而不生。已生便灭。未生有漏无明漏而不生。已生便灭。知如真法已。不应念法不念。应念法便念。以不应念法不念。应念法便念故。未生欲漏而不生。已生便灭。未生有漏无明漏而不生。已生便灭也。</strong></p><p>释：多闻的圣弟子能够闻到正法，得遇真知识，能够驾驭圣人之法，知真实之法。如果还是不能正确如理的思惟，还没有生起的贪欲漏就会生起，已经生起的就会增广；还没有生起的三界有漏和无明漏就会生起，已经生起的就会增广。而能够正确如理思惟的人，还没有生起的贪欲烦恼漏就不会再生起了，已经生起的就会灭尽；还没有生起的三界有漏和无明漏就不会生起，已经生起的就会灭尽。</p><p>多闻圣弟子证得真实之法以后，不应该念着的不善法就不会念着，应该念着的善法就会念着。因为不应该念着的法不念，应该念着的法而念着的缘故，还没有生起的贪欲漏就不会生起，已经生起的就会灭去；还没有生起的三界有漏和无明漏就不会生起，已经生起的就会灭尽。</p><p><strong>二十八、中阿含经第十漏尽经原文：有七断漏烦恼忧戚法。云何为七。有漏从见断。有漏从护断。有漏从离断。有漏从用断。有漏从忍断。有漏从除断。有漏从思惟断。</strong></p><p>释：有七种断除烦恼漏，消除忧戚苦恼的方法。有哪七种呢？三界有的烦恼漏从知见上断；三界有的烦恼漏从护上断；三界有的烦恼漏从离上断；三界有的烦恼漏从用上断；三界有的烦恼漏从忍上断；三界有的烦恼漏从除上断；三界有的烦恼漏从思惟上断。</p><p>原文：<strong>云何有漏从见断耶。凡夫愚人不得闻正法。不值真知识。不知圣法。不调御圣法。不知如真法。不正思惟故。便作是念。我有过去世。我无过去世。我何因过去世。我云何过去世耶。我有未来世。我无未来世。我何因未来世。我云何未来世耶。自疑己身何谓是。云何是耶。今此众生从何所来。当至何所。本何因有。当何因有。</strong></p><p>释：三界有漏从知见上断是什么意思呢？凡夫愚痴人闻不到正法，遇不见真知识，不知圣人之法，也不能驾驭圣人之法，不知世间真实之法，不能正确的思惟，于是便有这样的念头出现：我是有过去世的，我没有过去世，我因为什么有过去世，我的过去世是怎么样的；我有未来世，我没有未来世，我因为什么有未来世，我的未来世是怎么样的；自己疑惑自己的色身是怎么样的，为什么是这样的；他们也疑惑众生到底是从何处而来，死后应当去往何处；当初因为什么而有众生，众生应当因为什么才能有。</p><p>原文：<strong>彼作如是不正思惟。于六见中随其见生而生真有神。此见生而生真无神。此见生而生神见神。此见生而生神见非神。此见生而生非神见神。此见生而生此是神。能语能知。能作教作。起教起。生彼彼处。受善恶报。定无所从来。定不有。定不当有。是谓见之弊。为见所动。见结所系。凡夫愚人以是之故。便受生老病死苦也。</strong></p><p>释：因为凡夫无知，他们就有了这些不正当的思惟，在这六种见处当中，随同他们知见的出生，而生出自己的思想念头，认为众生确实有个叫作神的主宰者存在；或者随同他们知见的出生，而生出自己的思想观点，认为众生确实没有什么神的存在来主宰众生；或者是随同他们知见的出生，而生出这样的看法，认为众生确实有个叫作神的东西才能见到这种神；</p><p>或者是他们认为众生身中确实有个叫作神的东西，才能知道众生身中并不存在什么神；或者是认为众生身中没有什么神去见到神的东西；或者是认为这就是神，祂能说话，能感知，能造作，能教导造作，能起卧，能教导起卧；祂能出生在某某处，受善恶报；祂一定是无所从来，一定是不存在的，一定是不应当存在的。凡夫人的这些思想观点看法，就是他们不正知见产生出来的弊端，被自己的知见所左右了，被自己的知见结缚所系缚住了，所以凡夫人要受生老病死之苦。</p><p>原文：<strong>多闻圣弟子得闻正法。值真知识。调御圣法。知如真法。知苦如真。知苦习。知苦灭。知苦灭道如真。如是知如真已。则三结尽。身见戒取疑三结尽已。得须陀洹。不堕恶法。定趣正觉。极受七有。天上人间七往来已。便得苦际。若不知见者。则生烦恼忧戚。知见则不生烦恼忧戚。是谓有漏从见断也。</strong></p><p>释：多闻圣弟子得闻正法，得遇真知识，用圣法调御自心，知最真实之法，如实知苦，知苦如何灭，如实知苦灭的修道方法。如是知五阴世间真实谛理以后，三縛结就会断尽，身见、戒禁取见、疑见断尽了，就证得须陀洹果。从此以后不再堕入恶道，一定会趣向正真的觉悟，最多在三界经过七次天上人间来往，便灭除了三界的有苦，到了苦的边际了。如果没有具足这样的知见，就会出生烦恼和忧戚；如果具足这些知见，就不受烦恼和忧戚苦。这就是三界有漏从知见上断的道理。</p><p>原文：<strong>云何有漏从护断耶。比丘。眼见色护眼根者。以正思惟不净观也。不护眼根者。不正思惟以净观也。若不护者。则生烦恼忧戚。护则不生烦恼忧戚。如是耳鼻舌身意知法。护意根者。以正思惟不净观也。不护意根者。不正思惟以净观也。若不护者。则生烦恼忧戚。护则不生烦恼忧戚。是谓有漏从护断也。</strong></p><p>释：如何是三界有漏从护断呢？比丘们，眼见色能善护眼根者，用正思维不净观色法，就是从护断。不护眼根者，用不正思维见色身清净，就是不护眼根；如果不护眼根者，就会生起烦恼忧戚，护眼根者就不生起烦恼忧戚。如是像这样护耳鼻舌身意根者，对声香味触法用正思维，来正确的认知声香味触法，就是从护断三界有漏。善护耳鼻舌身意根者，用正思维来观察声香味触法的不净；不护耳鼻舌身意根的，对声香味触法不正思维，观察六尘见法清净。不护根者，就会生起烦恼忧戚；护根者，就不生烦恼忧戚。这就是三界有漏从护断的道理。</p><p>原文：<strong>云何有漏从离断耶。比丘。见恶象则当远离。恶马恶牛。恶狗毒蛇。恶道沟坑。屏厕江河。深泉山岩。恶知识恶朋友恶异道。恶闾里恶居止。若诸梵行与其同处。人无疑者而使有疑。比丘者应当离。恶知识恶朋友恶异道。恶闾里恶居止。若诸梵行与其同处。人无疑者而使有疑。尽当远离。若不离者。则生烦恼忧戚。离则不生烦恼忧戚。是谓有漏从离断也。</strong></p><p>释：如何是三界有漏从离断呢？比丘们，如果你们看见恶象的时候应当远离，看见恶马、恶牛、恶狗、毒蛇、险恶的道路、沟坑、暗蔽的沟厕、江河、深泉、山岩、恶知识、恶朋友、恶的不同道者、恶的街巷、恶的住处，你们应当远离。因为清净的修道者与之同处，人们本来没有什么可怀疑的，也会生出疑惑来，所以应当远离。如果不厌离这些，就会生出烦恼忧戚；远离他们就不会生出烦恼忧戚。这就是三界有漏从离断的意思。</p><p>原文：<strong>云何有漏从用断耶。比丘。若用衣服。非为利故。非以贡高故。非为严饰故。但为蚊虻。风雨寒热故。以惭愧故也。若用饮食。非为利故。非以贡高故。非为肥悦故。但为令身久住。除烦恼忧戚故。以行梵行故。欲令故病断。新病不生故。久住安隐无病故也。若用居止房舍。床褥卧具。非为利故。非以贡高故。非为严饰故。但为疲惓得止息故。得静坐故也。若用汤药。非为利故。非以贡高故。非为肥悦故。但为除病恼故。摄御命根故。安隐无病故。若不用者。则生烦恼忧戚。用则不生烦恼忧戚。是谓有漏从用断也。</strong></p><p>释：如何是三界有漏从用上断呢？比丘们，如果需要衣服，不是因为利益的缘故，不是因为贡高我慢的缘故，不是为了庄严修饰自己的缘故；只为了遮蔽蚊虻和风雨寒热的缘故，因为惭愧的缘故而穿衣。如果需要饮食，不是为了利益的缘故，不是因为贡高我慢的缘故，不是为了健康愉悦的缘故；只为了令色身存留的时间更长一些的缘故，为了除掉烦恼忧戚的缘故，为了修行清净行的缘故，为了要让老病消除、新病不生的缘故，为了长久安稳居住不生病的缘故而饮食。</p><p>如果需要居住房屋、床、被褥、卧具等等，不是为了利益的缘故，不是为了贡高我慢的缘故，不是为了庄严和装饰自己的缘故；只为了疲倦时能得到好好休息的缘故，为了能够静坐修行的缘故。如果饮用汤药，不是为了利益的缘故，不是为了贡高我慢的缘故，不是为了身体健康和快乐的缘故，只为了除去病恼的缘故，摄受和保护命根的缘故，为了色身安稳无病苦的缘故而饮汤药。如果不用这些物品，就会生起烦恼忧戚，使用了这些物品，就不会出生烦恼忧戚。这就是三界有漏从用断的道理。</p><p>原文：<strong>云何有漏从忍断耶。比丘。精进断恶不善。修善法故。常有起想。专心精勤。身体皮肉。筋骨血髓。皆令干竭。不舍精进。要得所求。乃舍精进。比丘。复当堪忍饥渴寒热。蚊虻蝇蚤虱。风日所逼。恶声捶杖。亦能忍之。身遇诸病。极为苦痛。至命欲绝。诸不可乐。皆能堪忍。若不忍者。则生烦恼忧戚。忍则不生烦恼忧戚。是谓有漏从忍断也。</strong></p><p>释：如何是三界有漏从忍断呢？比丘们，精进修行断除恶的不善法，因为修行善法的缘故，常常要生起这样的念想，专心精勤修行，以至于身体、皮肉、筋骨、血液、髓脑，都令其干竭，也不会舍弃精进。除非得到了精进所追求的修道目标，才会舍掉精进。比丘们，你们修道时还应当忍受饥渴、寒热、蚊虻、苍蝇和虱子跳蚤，即使是大风和毒日所逼迫，恶声咒骂和木杖的捶打也能忍受下来。身体遇见疾病的时候极其苦痛，甚至到了要命绝身亡，一切不可乐的事情，都能忍受得住。如果不忍受的话，就会生出烦恼和忧戚；忍受得住，就不会生出烦恼和忧戚了。这就是三界有漏从忍断的道理。</p><p>原文：<strong>云何有漏从除断耶。比丘。生欲念不除断舍离。生恚念害念不除断舍离。若不除者。则生烦恼忧戚。除则不生烦恼忧戚。是谓有漏从除断也。</strong></p><p>释：如何才是三界有漏从除上断呢？比丘们，当心里生出贪欲的念头时不去除断和舍离，生出嗔恚的念头和恼害的念头，不去除断和舍离，如果不除断和舍离者，就会生出烦恼和忧戚；如果能除断和舍离，就不会生出烦恼和忧戚。这就是三界有漏从除断的道理。</p><p>原文：<strong>云何有漏从思惟断耶。比丘。思惟初念觉支。依离依无欲。依于灭尽。起至出要法。精进喜息定。思惟第七舍觉支。依离依无欲依于灭尽。趣至出要。若不思惟者。则生烦恼忧戚。思惟则不生烦恼忧戚。是谓有漏从思惟断也。</strong></p><p>释：如何是三界有漏从思惟上断呢？比丘们，思惟第一念觉支，思惟五蕴、离五蕴、对五蕴无欲望、心里不执取五蕴，想要灭尽五蕴，最后生起出离生死的菩提心，渐渐到达精进觉支、喜觉支、猗觉支、定觉支。之后再思惟第七舍觉支，内心真正的离开了五蕴，对五蕴彻底的无欲，断尽执取，有能力灭尽五蕴，就达到了出离生死的边际。如果不思惟七觉支，就会出生烦恼忧戚，思惟七觉支就不会出生烦恼忧戚。这就是三界有漏从思惟断的道理。</p><p>原文：<strong>若使比丘有漏从见断则以见断。有漏从护断则以护断。有漏从离断则以离断。有漏从用断则以用断。有漏从忍断则以忍断。有漏从除断则以除断。有漏从思惟断则以思惟断。是谓比丘一切漏尽诸结已解。能以正智而得苦际。</strong></p><p>释：如果想要比丘的有漏烦恼从知见上断，就能从知见上断；想要有漏从护上断就能从护上断；想要有漏从离上断就能从离上断；想要有漏从用上断，就能从用上断；想要有漏从忍上断就能从忍上断；想要有漏从除上断，就能从除上断；想要有漏从思惟上断，就能从思惟上断。这样的话，比丘的一切三界有漏就能全部断尽，所有烦恼结全部解开，就能以正智而到达苦的边际。</p><p><strong>二十九、观无量寿经第一观</strong> </p><p>原文：<strong>（佛说）如来今者，教韦提希，及未来世一切众生，观於西方极乐世界。以佛力故，当得见彼清净国土。如执明镜，自见面像。见彼国土极妙乐事，心欢喜故，应时即得无生法忍。佛告韦提希：汝是凡夫，心想羸劣，未得天眼，不能远观。诸佛如来，有异方便，令汝得见。 </strong></p><p><strong>时韦提希白佛言：世尊！如我今者，以佛力故，见彼国土；若佛灭后，诸众生等，浊恶不善，五苦所逼，云何当见阿弥陀佛极乐世界？ 佛告韦提希：汝及众生，应当专心系念一处，想於西方。云何作想？凡作想者，一切众生，自非生盲，有目之徒，皆见日没。当起正念，正坐西向，谛观於日欲没之处，令心坚住，专想不移。见日欲没，状如悬鼓。既见日已，闭目开目，皆令明了。是为日想，名曰初观。 </strong></p><p>释：佛陀为了心力赢劣的人命终往生极乐世界，教导众生一种方便方法，就是首先面向西方观想日落、水观和地观，三观成就以后，保证命终往生极乐世界。总共有十六观，每一观里都有佛力的加持，如果单独靠众生自己观想成就，恐怕很难，因为佛说众生心想赢劣，观想力弱。为什么众生的心想赢劣观想力弱呢？因为众生无量劫以来，业种深重，世俗法的攀缘太多，心思太散乱，无法集中全部精力在一件事上，因此不容易成就一件事，只能依赖佛力的加持来完成观想。</p><p>佛说，我现在教导韦提希夫人以及未来世的一切众生，观想西方极乐世界。以佛力的加持缘故，现世就能见到极乐世界清净的国土，就像手拿一面明亮的镜子看见自己的容貌一样，能现前眼见极乐世界的胜妙庄严之事。于是就心生欢喜，由于内心欢喜，当时就证得无生法忍，知一切法依自心而幻化，都是无生，都不真实存在，忍于此事，就得无生法忍。 佛对韦提希夫人说：你现在还是凡夫，心力很弱，没有观想能力，没有天眼通，观不到太远的距离，更观不到极乐世界，诸佛如来却有一些善巧方便，能让你观见极乐世界。</p><p>韦提希夫人对佛陀说：世尊，像我现在这样，因为佛力加持的缘故，能够见到极乐世界佛国土；如果世尊您灭度以后，后世那些众生心性污浊不善，又被生老病死苦所逼迫，他们怎么能够现前见到阿弥陀佛的极乐世界？ 佛告诉韦提希夫人说：你和这些众生应当专一其心的把心系在一处，想于西方。如何想呢？凡是愿意观想的这些众生，都不是生来就是眼盲的人，有眼能见色的这些人，都能看见太阳要落西山的景观。</p><p>你们应当生起正念，只念一处，面朝西方而端坐，仔仔细细的一心观察太阳要落下来的地方，让心非常坚忍的住在这个景象中，专门观想这个景象不移动。这时应该能可见太阳马上就要落下去了，其形状就像悬在半空中的大鼓一样圆圆的。看完落日以后，闭眼开眼都能很清晰的看见落日的模样。时时能见，不再失去，就成就三昧。这就是日想观，就是十六观中的初观。</p><p>原文佛讲的就是这个意思。我们为了方便观想，在太阳下山时，用手机录像，录像更生动清晰，更有助于观行记忆。落日不要白色的，经中说是橙红色的，红中稍微带黄的那种。落日的真实相是什么样的，要亲眼所见，越真实越好。</p><p>西方的落日，一般是五六点钟时候的，不要想象的，不要P出来的。选定一种自己比较喜欢的，存在手机里，长期观看，长期观想。不要观好几种，一定要专一，不要杂，否则禅定不会出现。也不要加其它图案和背景，有图案和背景会分散注意力，不容易得定，图像越单调越好。我们不是要欣赏景观，有个欣赏的心，就是散乱心和贪爱心，那样就不能有禅定了。</p><p>选好落日景象，然后天天观看，看完之后独头意识再想象回忆。回忆的比较坚固了，时时能回忆得出来，再训练自己闭眼眼前要看见落日景象；闭眼能时时出现落日之后，最后再睁眼闭眼，眼前都是落日，这个景象不会消失不见了，日观三昧成就了。</p><p>第三观成就时，佛陀保证众生命终往生极乐世界，在这期间禅定永不失，这种修法非常殊胜。三昧成就时，重罪变轻，轻罪消失。所以所有禅定三昧成就时都能消业，尤其是修净土有佛力加持的更能消业，还能保持三昧境界不失。等到第七观成就时，三恶道业全部消灭，立时开悟，见十方诸佛在面前立。</p><p>这是改变和降伏意根的方法，意根一旦降伏下来，再修任何一种禅定，很快就能成就，各种三昧一修就容易成就。日想观成就之后，再观水，水观也能很快成就；之后是地观，地观成就，就保证去极乐世界了。</p><p>选定一种落日景象，长期观看，然后回忆。能时刻回忆出来，不会丢掉了，再闭眼时刻在眼前，能时刻闭眼显现出来以后，再练习睁眼看到，如果睁眼闭眼时刻都能见到落日景象，不会丢失散坏，第一观就成就。第一观成就以后，第二观就容易观成功，乃至于第三观也容易观成功。往生极乐世界就有保证了。第一观成就以后，修其它任何观行，都容易成就，念佛三昧，明心见性都不难了。有比较大罪业的，这样观行，佛已经保证能灭罪，而且还能往生极乐世界，还能明心见性。</p><p><strong>三十、大乘十法经简要</strong></p><p>佛说喜乐佛法的菩萨，应该恭敬供养善知识，为闻法故，为得法故，为求法故，忍于世间种种苦恼和不如意事，为成就佛道故，发大誓愿，难行能行，难忍能忍，直至佛地不休不息，这是菩萨们的行持。</p><p>佛说菩萨要怎样行法顺法，菩萨观察色阴受阴想阴行阴识阴这五受阴，是无常的、苦的、空的、非我的，虽然如是观，如是想，然不能像罗汉们那样厌离五受阴。罗汉们修行只想能够灭苦，得解脱，出离三界，不想成就佛道，慈悲心薄，不管众生的生死苦，不想在这个世间利乐众生。菩萨不这样，菩萨们的心量广大，慈悲心大，悲愍众生，发愿要在无量劫的修行过程中，广度无量众，然后成就佛果。</p><p>这样的话，菩萨就不能舍弃五受阴不要而灭度自己，而是要生生世世保有五受阴，用这五阴自利利他。佛说菩萨不但要用五受阴，而且要善于利用五阴，要善用善持善修。罗汉们害怕五阴，认为拥有五阴能给自己带来苦受；菩萨们了知五阴的实质本如来藏，不再害怕五阴世间，因为五阴是虚幻的，是如来藏所变幻出来的，只要自己不对五阴生起颠倒想，不执著五受阴，就不会有苦受。</p><p>佛又讲解菩萨如何观察五受阴苦空无常无我，而又不厌离五受阴。佛用比喻来说明菩萨应该有智慧，不应该厌弃五阴身，譬如一个有智慧的人，贩卖毒物，包装好它，而自己不食这个毒物。又譬如有人供养火神，供了火以后，虽然恭敬赞叹，然不用手去触火，免得被火烧着，生起苦恼。菩萨也如是，虽然心向涅槃，顺于涅槃，然不证取涅槃，不入涅槃。因为一旦入了涅槃，再也不能有五受阴来修学佛法，广利众生，成就佛道了，这样就退失了菩提，损失大矣！菩萨们虽然不证取涅槃，但心无烦恼，不被世间烦恼所染污，这样的菩萨是最值得敬重的。</p><p>佛说偈赞诸大菩萨。首先菩萨有大智慧，有般若无生忍智和方广唯识的无生法忍智；其次菩萨有无畏，不畏惧生死，在三界生死长河中广度无量众；再其次菩萨有慧眼法眼，智慧清净。这样的菩萨是初地以上的大菩萨，具无生法忍慧，入诸佛家，是佛亲儿子，能替佛分担家业，有度众生的方便善巧和胜妙的智慧，其广大名声超越于声闻缘觉二乘人。</p><p>这样的菩萨如实了知五受阴的苦空无常无我性，了知七识妄心的生灭流转性，知自我虚妄不实。虽然如此，不忍灭度，看见世间众生长处生死，渴望解脱，为众生故，不证取涅槃，不处涅槃的无为境界，因为那样无益于众生。关于慢，佛说菩萨摩诃萨已经离却各种慢，心地慈悯，常念众生。常行世间，乞食过活，宣说能使众生都受益的法教。</p><p>世尊四十九年讲法，说了很多秘密语，众生不懂其义，只以表面意思来理解和接受，所以很难做到依义不依语。有以下几种是世尊秘密语，不被众生所知。</p><p>（一）如来授记声闻人得阿耨多罗三藐三菩提，非如所说。之所以这样授记，是因为声闻人也有佛性，有成佛之性，故也能成佛。又因为如来所授记的声闻人，是密行菩萨或者是将来会转入菩萨道修行的声闻，暂时修声闻解脱道，断除烦恼，大乘善根成熟时就会修菩萨六度万行，修般若唯识智慧，以此将来就会成就佛道。</p><p>（二）世尊多次告诉阿难患背痛，非如所说。佛愍众生故如此说，非真实有病痛。因为弟子们有病不肯用药，障碍修道。佛带头用药治病，弟子们见佛都用药，有病时也就不生惭愧心，也用药治疗。</p><p>（三）佛说老迈衰败，要用侍者，非如所说。佛永远不老，永远不衰弱，为众生故示现耳。</p><p>（四）如来与外道争论，非如所说。佛已经没有冤家对头了，是故意示现，那么弟子们遇见冤家对头时，就说佛尚如此，何况我们，再遇到违缘时就不会很惭耻了。</p><p>（五）毒刺伤足，示现受果报，无有其事。佛早已没有恶业果报了，为愍愚痴众生造作业行故，示现受果报。众生见佛尚受果报，何况我们，于是就不敢造业了。</p><p>（六）提婆达多与佛作怨对，非如所说。提婆达多多世是佛的善知识，示现处处与佛作对，借以歌显佛德。众生见得佛的德行就会无比的恭敬，纷纷皈依三宝，随佛修学。</p><p>（七）如来乞食空钵而出，非如所说。佛的福德无量，可以不用饮食，即使饮食，自己可以变化，即使自己不变，也有十方世界无量众生供养于佛。佛如此示现，那些乞不着饮食的薄福弟子，心里与佛比较，就不会自卑，惭愧忧恼了。</p><p>（八）女人木盆置腹谤佛，非如所说。这个女人是示现，没有其事。佛为安慰后世弟子，故作示现。当弟子们受诽谤时，就会想到佛尚被谤，何况我们，于是心就不退于道了。</p><p>（九）佛三月食马麦，非如所说。佛为度五百匹马故，示现如此。其中马的头目也以愿力生到马身中，方便度化五百匹马，佛也辅佐去度化。所以众生要与善知识结善缘，下恶道受报时，善知识会到恶道里去度化，遇见一个善知识何其幸运。佛的福德即使吃任何东西，都是最上味，何况马麦。佛三月当中食马麦，不仅度化五百马，也度化几百比丘。所以我们学法要依如来的真实义，不依如来语的表义；依法不依人；依了义经，不依不了义经；依智不依识；总共有四依四不依，要努力修学。</p></div>"
}]