[
    {
        "title": "《了凡四训》白话文",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n<p><span style=\"color:#ff0000;\"><strong>　　原著</strong></span><strong style=\"color: rgb(255, 0, 0);\"> </strong><strong style=\"color: rgb(255, 0, 0);\">明</strong><strong style=\"color: rgb(255, 0, 0);\"> </strong><strong style=\"color: rgb(255, 0, 0);\">了凡先生</strong></p>\n<p><span style=\"color:#ff0000;\"><strong>　　白话译者 学袁</strong></span></p>\n<p>　　明朝净意室主了凡先生所著《<a href=\"/ctwh/jing/mxjd/lfsx.html\" class=\"keylink\" target=\"_blank\">了凡四训</a>》（白话文版名为《命自我立》），是袁黄先生（字坤仪，号学海，道号了凡，江苏省吴江县人）把自己亲身的经历和毕生学问与修养倾囊传授，教育自己的子孙以正确的处世做人之道而作的。</p>\n<p>　　他在早期验证了命数的准确性，后来进一步通晓了命数的由来，知道人们可以掌握自己的未来，改造自己的<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>。就在他的下半生中，又验证了人们完全可以自我“立命”，自求多福的准确性。这是一本比较完善的有益身心的读物，也是很好的古文学作品，值得大家阅读。因为现在一般人看惯了白话文，对阅读古文感到困难，所以把原文译成白话。</p>\n<p>　　人类文明到了高度发展的今天，人类已经掌握了丰富的历史资料和宇宙知识，人们对于明了宇宙<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>的真相，解决<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>、<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>的问题，在错综复杂、万有不齐的社会中掌握自己的命运，得到幸福安乐，这一强烈的愿望是可以理解的。不过，光是知命安命是消极的无益的；而自强不息改造命运的“立命之学”则是积极的和有益的。关于一个人的<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>，算亦如此，不算亦如此。《命自我立》阐明了<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>的“<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>法”中的许多根本道理。佛法揭示了命和相的原因及由来，却不教人去<a href=\"/remen/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>、看相、求签、问卜，就因为舍本逐末是徒劳无益的。</p>\n<p>　　佛法是万世生灵的眼目，如果没有佛法，就不可能知道三世<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>和<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>的道理。佛法为我们阐明了宇宙人生的真相，破除<a href=\"/remen/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>、幻觉。它指明了一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>在无始无终的“生命之流”六道轮回中生灭<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>，一期生死只不过是其中一个短暂的片段，形成极其错综复杂、万有不齐、苦乐悬殊的景象，其间贯穿着一条“因果规律”。只有明了因果，才知道命运为什么这样，过去造作的“因”形成现在的“果”，就表现为现在的命相；而现在造作的“因”又形成未来的“果”，就形成未来的命相。其中因果虽极其错综复杂，但正如种瓜得瓜，种豆得豆一般的准确。自因自果，自作自受，恰如其分，毫厘不爽。利人即是自利，害人适足自害。</p>\n<p>　　虽然一个“因”种了下去，到“果”的形成（成熟），也同植物一样，必须经过一定的时间，而且要有适当的“缘”去完成，但却是“<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>到头总有报，只争来早与来迟”。所以利人才有益于实际啊！这样做，不仅是自利，而同时也是利人利国，共利群益之道啊！</p>\n<p>　　佛法还有更究竟彻底的出世间法，超出世间而不是厌离世间。一切众生皆具足清净<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。佛的福德智理、<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a><a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>在我们的本性中也不缺少一丝一毫，只因被<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>所带来的无明<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>所蒙蔽而成为众生。只要能依照佛的教导去<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，厉行众善、息灭<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>、消除无明，人人都能够圆<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道，这并不是高不可攀的。</p>\n<p>　　<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>立地要广大，实践却要踏踏实实地去做。《命自我立》就是很好的“明镜”，可以备置案头，对照自己的身、口、意三业，做超凡人圣的功夫。知过必改，<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>必勇，<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a><a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>，利乐有情，这是修行的起点。</p>\n<p>　　最后提请大家注意：<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>者以国家和人民的利益、乃至全人类的利益和幸福为目标。所以要树立高尚的<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>品质，建立优良的<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>教育，响应良好的社会新风尚。在工作中做到尽职负责，作出贡献。总之，在各个领域中，在一言一行上，都要有益于国家和人民，为国争光、振兴中华。这是报上师恩，报国土恩和报众生恩的大善行、大<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>！也是正规<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>与邪教的本质区别！\t\t\t\t</p></div>"
    },
    {
        "title": "一、命运的创立",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n\n<h2>了凡四训（一）</h2>\n<h3>　　一、命运的创立</h3>\n<p>　　我在童年时代就死了父亲，因此，我的母亲叫我放弃求取功名的学业，去学习医学，学成后可以维持<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>，还可以济世利人。母亲还说：“能学成一种技术，就能在社会上得到一定的地位。这是你父亲生前很久就有的心愿啊！</p>\n<p>　　后来有一天，我在慈云寺遇着一位老人，相貌非凡，留着长须，潇洒出尘。我恭敬地向他作礼。他对我说：”你是官场中人，明年就要中秀才了，为什么不读书呢？“我把我的情况告诉了他，并问他姓什么，是哪里人。他回答我说：”我姓孔，云南人，得到宋朝易学大师邵康节的《皇极数》正传。这数应该传授给你。“于是我引他回家，把这详情告诉了母亲。母亲说：”你要好好招待他。“这位老人用《皇极数》为我推算，对我过去的遭遇，就是连很小的事，也都推算出来了。</p>\n<p>　　这就激发了我读书的志愿。于是就和表兄沉称商量。他说：”有位郁海谷先生在沉友夫家开办私垫，我送你去寄学是很方便的。“这样，我就去私垫读书，拜郁为师。</p>\n<p>　　孔先生给我推算：县考童生第十四名，府考第七十一名，提学考第九名。等到第二年去考试，三处的名次完全相符。 孔先生再给我卜终身吉凶，说某年考第几名，某年当廪生，某年当贡生，贡后某年当选为四川的县令，在任三年半就应该告退回乡，在五十三岁八月十四己丑时，寿终在家里，可惜没有儿子。我把他的话，详细地记录下来。</p>\n<p>　　从此以后，凡遇着考试，名次先后，都不出孔先生所算定的。最奇怪的是算我食廪米九十一石五斗当出贡（当贡生，贡生是明、清两朝由府、州、县学推荐到京师国子监学习的人）。可是食米到了七十余石的时候，屠宗师就批准我补贡生。补了贡生，是廪生已经出了缺，把米折为现金发了，所以廪米就停了。我有些怀疑，认为这数不准了。后来不久，就被代行职权的杨公所驳斥，不准我补贡生，于是又食廪米了。直至丁卯年，殷秋溟宗师看到我场里的备卷，叹息着说：”这五篇论文就是五奏议啊！怎么可使学识渊博的读书人终老在寒窗之下呢？“他就吩咐县官写申请的公文，批准补贡。这时廪米又停发了。我把所有领到的廪米加起来，正好是九十一石五斗啊！</p>\n<p>　　我因此更加相信人生的一切遭遇，都是由命注定的。而思想也就很安定，不作妄想追求名利了（当然，作者后来明白了并不是全注定的）。</p>\n<p>　　出贡（当贡生）以后，到了北京，留京一年，一天到晚总是<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>，并不看书，己巳年南归，进南京国子监（国立大学）。在进校以前，我先去访问在栖霞山的云谷禅师，和他对坐三昼夜。</p>\n<p>　　禅师问我：”凡夫所以不得成为<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，只因为妄想缠绕，你坐了三天，不见你起了一个妄想，这是怎么一回事呢？“</p>\n<p>　　我答道：”我被孔先生算定，荣辱死生都有定数，即使要妄想，也是没有用处的。“禅师笑着说：”我以为你是豪杰，原来是个凡夫哩。“</p>\n<p>　　”我问他：“这是什么意思？”</p>\n<p>　　他说：“人们不能达到<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>的境界，就要被定数所束缚。那里会没有数呢？但是普通平凡的人是有数的。大善的人，数就拘不了他；大恶的人，数也是拘他不定的。你二十年来被他算定，不曾转动一毫，岂不是凡夫吗？”</p>\n<p>　　我就问他：“那么，这个数能逃得了吗？”</p>\n<p>　　他说：“诗书里所说的，‘’命是我们自己所造作的，<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>也是我们自己求取得来的‘’，确是很明显的教训。我们佛教的经典里说：‘’求功名的就得功名，求富贵的就是富贵，求男女就得男女。求长寿的就得长寿。‘’要知道，<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>乃是释迦佛的大戒，诸佛和菩萨是不会拿虚妄的假话来欺骗人的。”</p>\n<p>　　我再问他：“孟子说过：‘’求则得之。‘’这是一切都可以由我求得的。但我以为道德和仁义是可以努力去求取的，那功名富贵，怎么能够求得来呢？”</p>\n<p>　　禅师说：“孟子的话没有错，是你自己错解了。你不知道，六祖说过：‘’一切的<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>离不开自己的心，能从自己的心田去找它，是没有得不到感通的。‘’要知道，求不求在于自己，如果专诚去求，不但能得到道德和仁义，还可以得到功名和富贵呢。内外双得，那才算是有益的求。倘使不得认真地遵循正道去求，也就是说，不从心地上去求，不从积善去恶上去求，而徒然费尽精力向外追逐名利，那虽求之有道，不违犯法律道德，但所得的还是你业命中本来有的。若是由于不顾一切，过分贪求，不合道理的事去做了，那就把心里本有的德性也失掉了，岂不是内外双失吗？所以是徒劳无益的。”</p>\n<p>　　禅师又问：“孔公算你终身怎么样？”我照实告诉了他。</p>\n<p>　　他说：“你自己考虑应该登科第吗？应该有儿子吗？”</p>\n<p>　　我考虑了很久，回答道：</p>\n<p>　　“我想，我是都不应该得的。因为科第中人大抵都是有福相的。我生来福薄，又不能积功累德以培植增福；而且不耐厌烦，不能容纳别人，有时还显出自己的才智以凌盖别人；率意行事，轻易发言。像这样的作风都是薄福之相，怎么配得上得科第功名呢？ ‘’污秽的地土里，容易滋长生物；而清澈的泉水里，往往没有鱼类‘’。而我却是有好洁之癖的。这是不应有子的第一点。</p>\n<p>　　”和气能生长万物，可是我却很容易发怒。这是我不应有子的第二点。</p>\n<p>　　“和爱是生生不息的根本，残忍是不繁育的种因。我又爱惜自己的名节，不能舍己以救人。这是我不应有子的第三点。</p>\n<p>　　”多言耗气，而我喜发议论，信口开河，这是我不应有子的第四点。</p>\n<p>　　“喜欢喝酒，损伤精神，这是我不应有子的第五点。</p>\n<p>　　”通宵长坐，不知道保养元气，这是我不应有子的第六点。</p>\n<p>　　“仅就这几点，我是不应该有儿子的了。其他的过恶还多着呢，不能一一都举出来了。”</p>\n<p>　　禅师说：“不但是科第功名的问题啊！世界上凡是享受千金财产的人，那他一定是个千金的人物；享有百金财产的人，他一定是个百金的人物；应该饿死的，那他一定是个饿死的人物。天不过因他的操行厚薄，所作的善恶业轻重，而给他以应得的<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，何曾在应得份上，另外加上一毫的用意呢？</p>\n<p>　　”现在你既然知道自己过去的缺点，就应该把向来不合登科第，不合有子的作风，尽情改刷。</p>\n<p>　　“一定要积德！一定要宽恕人家原谅人家！一定要和爱！一定要爱惜精神！从前种种，譬如昨日死，以后种种，譬如今日生。这是义理再生之身啊！？</p>\n<p>　　”商朝的贤君太甲说过：‘’天作孽犹可违，自作孽不可活‘’。孔先生算你不登科第，不生儿子，乃是自己前世所作的业报，这是天作之孽，是可以违反它、改造它的。你只要尽力去作善事，多积阴德，这是自己所作之福，哪里自己会得不到享受呢？《易经》说：‘’积善之家必有余庆。积不善之家必有余殃‘’，你能相信吗？“</p>\n<p>　　听了他的一番议论，我拜谢他，接受了他的教导。就把往日之罪，在佛前尽情发露<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>，写了一篇<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>，先求登科，誓行三千件善事以赎罪。</p>\n<p>　　云谷禅师取出一本《功过格》给我，教我把所做的事，逐日登记起来，善则记数，恶就退除。还教我持诵《<a href=\"/fozhou/zhuntizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">准提咒</a>》，以期必验，他还说：</p>\n<p>　　”符家有句话，‘’不会写符，被鬼神笑‘’。其实写符也没有什么秘诀，只是不动念就是了。执笔写符，先把杂念<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>，在念头不动的时候，写下一点，叫做混沌开基，由此一笔挥成，更无思虑。这样写成的符也就灵了。凡祈祷立命，创立新的命运，都要从无思无虑处去感格。修身以等待之，那才是积德祈祷的正规行法。</p>\n<p>　　“说到修，所有身口意的过恶，都应当把它除去。说到等待，是静候时机的自然成熟，不存一毫的非分侥幸，一毫的期待思想。如有预期或将迎的心，都应当斩尽杀绝。到这地位，直造无念无求，先天之境，即此便是真实的学问。你不能做到无心的功夫，只要能持诵《<a href=\"/remen/zhunti.html\" class=\"keylink\" target=\"_blank\">准提</a>咒》，不必计较，勿令间断（<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>也有同样功效）。--功夫持得纯熟，于持中不持，不持中持，到了念头空寂不动，那就灵验了。”</p>\n<p>　　我的号原叫学海，从这一天起就改号了凡。因明“了”立命的道理，不愿再落凡夫的窠臼了。</p>\n<p>　　从此以后，一天到晚，心地都在约束着自己，一切心念行就和以前不同了。从前只是悠悠地放任，到此自有战兢惕励的景象。虽在暗室陋屋处，也恐怕得罪天地神鬼。遇到别人憎恨我，或是毁谤我，自能安然容受了。</p>\n<p>　　到了次年礼部考科举，孔先生预算的应该得第三，忽然考中第一。他的话就不应验了。</p>\n<p>　　而秋闱考试就中了举人。但是我检讨自身，还是有许多的错误；或见善而行之不勇，或救人而心犹豫不决，或身勉强为善而口有过言，或醒时能操持而醉后便放逸。以过折功，日常虚度。从己巳岁开始发愿直至已卯岁，经过十余年，这三千善行才算完成。</p>\n<p>　　完成以后，就发起求子的愿，也许愿行三千善事。辛巳岁生了儿子天启。我每次行善事，就用笔记上。你（天启）的母不能写，每做一件善事，就用鹅毛管印一个朱圈在日历本上面。或<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>贫人，或买<a href=\"/remen/fangsheng.html\" class=\"keylink\" target=\"_blank\">放生</a>命，所做种种善事，有时一天多到十几圈。到了癸末年八月，三千之数已经<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。</p>\n<p>　　九月十三日，再发求中进士的愿，许行善事一万条。丙戌年登第，授宝砥县令。我备空格一册，名叫《治心篇》，放在案上，所行善恶事，就是微小的也把它登记起来，夜里在庭前摆了一张桌子，焚香告天。你母见到我所做的善事不多，就皱着眉头说：“以前我在家里帮助做善事，所以三千之数得以完成。现在许下了一万善，可是衙门里无事可做，到什么时候才能完成呢？”</p>\n<p>　　夜间就做了一个梦，梦见一个神人。我告诉他善事难以完成的缘故。神人说：“只减粮一节，一万善事都已经圆满了。”事情是这样的：原来宝砥的田，每亩应纳粮二分三厘七毫，我把它减至一分四厘七毫，使人民减轻了负担。虽然神人这样告诉我，但我自己的心里还有此疑惑。恰遇幻余禅师从五台山来，我便把这梦告诉他，并问这个梦可以相信吗？</p>\n<p>　　禅师说：“只要发心真切，那么，一件事就可以抵得上一万件的善事，何况全县减粮，万民受惠呢？”我就捐出俸银，请他在五台山斋僧一万人，代为<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>。</p>\n<p>　　孔公算我五十三岁要死，我虽不曾祈祷求寿，这一年居然无恙。今年我已六十九岁。</p>\n<p>　　《商书》说：“天道难信，因为命在变异，是不肯定的。”《<a href=\"/ctwh/shi/24s/zhoushu.html\" class=\"keylink\" target=\"_blank\">周书</a>》也说：“天命<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>，修德为要。”这不是古人欺人的话。</p>\n<p>　　我因此相信“所有幸福都是自己可以求得的。”这句话，是圣贤的名言。若是说，祸福是天所掌握，是天所注定的。这就是世俗浅识人的言论了。</p>\n<p>　　你（天启，了凡先生的儿子）的命运前途，现在还不知道是怎样的，但不论如何：</p>\n<p>　　即使命里应该荣耀显达的，也要常作冷落寂莫想；即使时运亨通顺利的，也要常作指意<a href=\"/remen/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>想；即使眼前衣食丰足的，也要常作贫穷想；即使别人对我敬爱的，也要常作谦和不骄傲想；即使门第高名望重的，也要常作卑下低微想；即使学问很优良的，也要常作浅陋想。从远一点来说，要发扬祖先的遗德，近一点来说，要弥补父母的过失，对上要报答国家的恩惠，对下要创造家庭的幸福，对外要救济别人的急难，对内要约束克制自己的私心杂念。天天要检查自己的不是，要改过自新。倘使一天没有认识到自己的缺点和错误。那就是一天安于自是；一天无过可改，就是一天没有进步。</p>\n<p>　　天下聪明俊秀的人不少，他们为什么德不加修，业不加广？只是因为因循二字耽误了一生。云谷禅师所传授的立命学说，乃是很精、很深、很真禅的道理，务必熟读而努力去实行，不得贻误了自己！\t\t\t\t</p></div>"
    },
    {
        "title": "二、错误的改正",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n\n<h2>了凡四训（二）</h2>\n<h3>　　二、错误的改正</h3>\n<p>　　春秋时代有些官员们见到别人的说话和动作，就能凭着自己的推测，来评论这个人未来的祸福遭遇，往往很准确。这从《<a href=\"/ctwh/jing/13j/cqzz.html\" class=\"keylink\" target=\"_blank\">左传</a>》、《战国策》这些书里可以看得到。</p>\n<p>　　大抵吉凶的预兆虽萌芽在心里，而发现常在于四体。行为敦厚的往往得福，过于刻薄的往往遭祸。</p>\n<p>　　但世俗一般人们的眼里多被妄念遮障。他们说，人生的祸福是没有一定的，是测度不准的。要知道、当幸福快要到来，只须观察他的善行就可预知；灾祸将要来临，观察他所作的不善事，也就可以预卜的。</p>\n<p>　　现在，我们想要得福而远祸，暂且不论行善，先须决心改过。</p>\n<p>　　但是改过第一要发羞耻心。应思从前的圣贤们，他们为什么百世可师，而我为什么一身瓦裂？这是因为我耽染着尘劳情欲，在私下做了坏事，还认为别人不知道，傲然没有一点惭愧之心。这样下去，必将沦堕于禽兽，而自己还不知道哩。世间可羞可耻的事是没有比这更大的了！ 孟子说，‘’耻的问题，对于人们是最重要的了‘’。因为知耻则勇于改过；德业日新，成为圣贤；无耻则肆意妄行，人格消失，成为禽兽。所以改过是得福远祸的最切要的一着。</p>\n<p>　　第二要发畏惧心。天地在上，鬼神难欺。我的过恶虽在隐微之间，但是天地鬼神已经看见了、知道了。重则降之百殃，轻则损失后福。我怎么可以不惧怕呢？不仅是这样，任凭我们居住在什么地方，别人总是看得很清楚的。我虽遮盖得很密，伪装得像样，但是肺肝早已露出，到底难以隐瞒，一经被人看破，我的人格真是不值一文了，怎么能不懔然惧怕呢？</p>\n<p>　　不过，只要我们留有一口气，还活着，滔天的<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>还是可以忏悔改过的。从前有人一生作恶，到了临死的时候，方才悔悟，发了一念<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>，就得到安详地善终。这是一念猛厉，足以洗涤百年之恶。譬如千年黑暗的幽谷里，拿灯来一照。那千年的黑暗，立刻就消除了。所以过错不论久近，只是以改为贵。但是世间的一切事物，都是无常的，我们这个身体是容易死亡的，等到一口气不来，再要想改过，就无从悔改了，将永远沉沦在恶道里了。岂不可怕呢？</p>\n<p>　　第三要发勇猛心。人们多是因循退缩，得过且过，不肯发心改过。我们必须奋发振作，不用踌躇、企惑，不烦等待拖延。小的过失，比如芒刺在身，要很快的把它拔除。大的恶行，要像毒蛇咬住了手指，急速把手指斩除，以免蛇毒人心。这是丝毫缓慢不得的！ 《<a href=\"/ctwh/jing/13j/zhouyi.html\" class=\"keylink\" target=\"_blank\">周易</a>》卦上说：“风雷益”；就是说，雷厉风行，直接痛快地去干，是容易得到效益的。</p>\n<p>　　如能具备以上这三种心，那末，有过的能立即改掉了。譬如春天的冰遇到了太阳，是没有不消溶了的。实践改过的工夫，有从事上改的，有从理上改的，更有从起心动念处除净的。工夫既然不同，效用也就有别。</p>\n<p>　　什么是从事上改的呢？例如前日<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>，今日戒杀了；前日怒骂别人，今日不发脾气了，这就是事上而改的。但是强制于外，是会感到很困难的；而且病根还在，东灭西生，这不是究竟的好办法。</p>\n<p>　　什么是从理上改的呢？善于改过的人，是在事件还没有发生以前，就先明白了它道理。</p>\n<p>　　例如，过失在于杀生，自己就想：一切的动物都爱自己生命的，把它活活地杀死，往自己嘴里送，将我的享受建筑在它的<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>上，能忍心吗？这样一想，我的心就会感到不安，而且它被杀，当遇到屠割的时候，痛苦澈骨人髓；至于我为了贪一时的口福，珍膏罗列，食过即空，蔬食菜囊尽可充腹，何必杀害它的生命，减损自己的福报呢？再进一步想，有血气的动物都有灵知，都有佛性，和我是一样的。我虽不能爱之养之，但怎能日日杀割生命，使它们仇我恨我于无穷呢？想到这里，就会对食伤心，不能下咽了。</p>\n<p>　　又如以前，自已是容易恼怒的，就应该想；人们有不到之处，在情理上是应该加以宽恕的。我们不能自以为是而鄙视了所不及的地方，天下没有自以为是的豪杰，也没有怨恨别人的学问，凡是我所行不通的，都是自己的<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>没有修，不能感动他人，这是我自己要加以反省的。如果有人蛮不讲理的来干犯我，那是他的事，于我又有什么干涉。那末，毁谤的发生，都是磨练于我，玉成于我，我将欢然受赐。能够这样想，那还有什么忿怒可发呢？（注：此行不可太过，因为纵容别人不利于他改过也是害他）。</p>\n<p>　　应知听到毁谤而不忿怒的，虽遇到谗焰薰天，也如拿火炬烧<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，结果必自息。若是闻谤而怒，虽竭尽巧思之分辨，反如春蚕作茧，自取束缚，更增<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。所以忿怒不但无益，而且还有害。</p>\n<p>　　其他种种过恶，都应该依理分析。其实，一切过恶都是愚囊的行径，自害的作法，道理明白了，自然不会发生了。</p>\n<p>　　什么叫做从心而改呢？一切过失都是根源于心，是心所造的。我的心不妄动，过失又从哪里发生呢？</p>\n<p>　　从事修养的人，对于好色、好名、好利、好怒，这些过失，不必逐类寻求，但当专注起心动念处，使<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>时时现前，邪念自然污染不上了，正如太阳当空，妖魔鬼怪就由潜伏而归于消灭，这是精密纯一的真传。既然过由心造，还须从心上去改，象斩毒树，必须断其根株，何必一条又一条地伐它的树枝，一片又一片地摘它的树叶呢？</p>\n<p>　　大抵最好的办法是治心。不合理的念头，才一动起，立即发觉，一觉就立即予以消灭，倘使这样做不到，就要反复明理来消灭它。或许还是克制不了，那就要用悬崖勒马的工夫，临事强行克制，坚决地禁止不犯。切实而论，“净心、明理、临事禁戒”三功并施，是改过的要诀。</p>\n<p>　　但是决心要改过，明则要靠良朋提醒，幽则还须诸佛加被。一心忏悔，昼夜不敢<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>，经过一七日、或二七日、以至一月、二月、三月必有效验。见效时，或者感觉心神情旷，或者觉得<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>开朗，或者冗忙的时候而触念皆通，或遇怨仇的人而能回嗔作喜，或梦吐黑物，或梦往圣先贤提携接引，或梦飞步太虚，或梦幛幡宝盖，种种吉祥的事。这些现象都是过消罪灭的实证。但是不得执此自高，自满自足，而不更求进步。</p>\n<p>　　从前藜伯玉二十岁的时候，已经能<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>前日所做的不是，而把它都改掉了，到了二十一岁，才知道自己以前所改的，还没有完全改尽，乃至二十二岁，回顾二十一岁，还象在梦中糊涂过日，错误不少。这样，他年复一年，年年都改过，到了五十一岁的时候，还认为四十九年来所做的不对。</p>\n<p>　　古人对改过作为一种学问，就是这样认真去做的。</p>\n<p>　　我们都是凡夫，过恶像刺猬身上的刺一样，堆积得满身都是的。可是回思往事，往往不见得自己是有过失的，或是心粗而眼障的缘故。但是过恶深重的人，也是有征兆的；或者感到心神昏塞；转头即忘；或无事而心常烦恼；或是看见正派的人而自己有些不好意思，有些沮丧的情绪；或是听到正经的话反而不生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>；或夜梦颠倒，甚至妄言妄动。这都是过去恶<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>重的反映。倘使有一件像这样的情形，那就要自己奋发，舍旧图新，不可自误！</p>\n<h3>　　三、善业的积累</h3>\n<p>　　《易经》说：“积善之家，必有余庆！积不善之家，必有余殃！”</p>\n<p>　　从前有一个姓颜的人，打算把女儿嫁给孔子的父亲叔梁纥（gē），而称道他的祖宗积德，预料他的后人，必定会有出类拔萃的人物。后来事实证明，正是如此，因知《易经》所说确是至理名言。</p>\n<p><span style=\"color:#0000cd;\">　　现在再列举往事来证明：</span></p>\n<p>　　杨少师（杨荣），是福建建宁人，他的家庭是以摆渡为生。有一次，久雨之后，溪里的水泛涨起来。洪水冲毁百姓的房屋。淹死的人顺流而下。其他摇船的人，都乘这机会捞取财物，只有少师的曾祖和祖父接连救人，不去捞取一件财物，大家都嘲笑他们是笨蛋。乃至生了少师的父亲以后，家里的经济情况逐渐宽裕起来。后来生了少师，少师于二十岁就登科，官职做到三公，子孙贵盛，到现在还有许多贤德的后裔。</p>\n<p>　　宁波杨自惩，早年充当县里的官吏，他存心诚厚，守法公平。那时的一个县令办事很严厉，有一回惩罚一个囚犯，把他打得血流满面。可是那县令余怒还是不息。自惩耐心劝解，使他平息怒气，不要鞭打囚犯；自惩家里很穷，别人送他的物品，一概都不接受，遇着犯人缺乏粮食，经常设法替他们解决。有一天来了新的犯人数名，饿着没有吃，可是他自己家里又刚巧缺存粮，如果给囚犯吃了，一家人就没有吃，要挨饿了。但眼看囚犯们都饿得很可怜，自惩就和妻子商量。妻子问他：“囚犯从哪里来的？”自惩说：“他们从杭州来，一路上忍着饥饿，脸色都饿得发青了！”妻子听了也很同情，因此，取了自己待炊的米，拿来煮粥给囚犯们吃。后来杨自惩生了两个儿子，长子名叫守陈，次子名叫守址，做到了南京吏部侍郎（副部长之职）。长孙做了刑部侍郎，次孙做了四川的按察使。他们又都是当朝的名臣。</p>\n<p>　　从前英宗正统年间，邓茂七在福建率众作乱，百姓跟从他的很多，朝廷起用鄞（yín）县张都宪（名楷）南征，用计谋擒贼，委派布政司谢都事，搜杀东路贼党。谢找到贼党的名册，于是对没参加暴动的，秘密发给他们小白旗，约定官兵来到的一天，把白旗插在门口。他严戒官兵不可乱杀，因此保全了万人的性命。后来谢的儿子谢迁中了状元，做到宰相。孙子谢丕中了探花。</p>\n<p>　　冯琢庵太史的父亲是一名秀才，有一天，隆冬严寒，他早起到学校里，看见一人倒卧在雪中，抚摸那人的身体，已经是半僵了。他就把自己身上所穿的绵裘脱下来，给这人穿上，还扶着送到他的家，救活了他。太史的父亲夜间做了一个梦，有神人告诉他：“你救人一命，出于至诚心，我遣韩琦做你的儿子。”等到生了琢庵，取名叫琦。</p>\n<p>　　台州应<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>（部长职位），壮年时代在山里读书，夜间鬼声啸集，使人惊慌。但他并不惧怕。有一夜听到鬼在那里说话：“某妇人因丈夫出门久客不归，公婆逼她嫁人，明天夜里要吊死在这里，她可以替代我了。”应尚书听了以后，偷偷地把自己的田卖了，得银四两，伪造了她丈夫的信，寄银还家。她公婆见到了信，怀疑笔迹不同，但又想起信可以假造，银子是不可能假造的，想必儿子还活着。因此，就不强迫媳妇嫁人了。不久那妇人的丈夫果然回家，<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>团聚。应尚书又听到鬼在说话：“我应该得替身，可是这个秀才破坏了我的好事。”又听另一鬼说：“你为什么不祸祟他？”那鬼回答说道：“这人心好，不久就要做阴德尚书了，我怎能降祸于他呢？”应公因此更加努力做善事。凡是遇到饥荒的年头，就捐出谷来救济穷人，遇到亲友们有急需的，就设法给他们解决；遇上非理侵犯他的事，他总是逆来顺受，不去和别人计较。后来，应公的子孙登科的，至今还很多呢！</p>\n<p>　　常熟徐凤竹，名拭，他的父亲家产本来是殷富的。有一次，遇到荒年，他自己就首先放弃应收的租米，来作为同县富人们的榜样，又分谷以救济贫穷的人们。夜里听到鬼在门外喊道：“千不诓，万不诓，徐家秀才做到了举人郎。”相续而呼，连夜不断。这年凤竹果然中了举人。他的父亲因而更加努力做好事，凡是修桥铺路，供僧接众，只要是有利益于人们的事，没有不尽力做的。不久，又听到鬼在门外喊道：“千不诓，万不诓，徐家举人直做到都堂。”以后凤竹果然做到了两江巡抚。</p>\n<p>　　嘉兴屠康僖公，初任刑部主事，亲自宿在狱中，详细地了解囚犯们的情况。发现有几个无罪的人，康僖公不认为是自已的功劳，他秘密写了报告给刑部的堂官。以后朝廷会审，堂官根据图公的报告，讯问众囚犯，事实完全与屠公的报告相符，就释放了冤枉的十余人。公又写了一份报告说：“在京都的地方，尚且有这么多受冤枉的好人，那么，四海之内广大的人民，难道没有受冤枉被压迫的好人吗？应该每隔五年差一减刑官，复查档案，仔细考查研究其实际的情况，冤枉的给他们平反。”尚书代为转奏皇帝，皇帝批准了他的建议。当时屠公也被派为减刑官之一。有一次，夜梦有人告诉他：“你的命本来是没有儿子的，因为是你提议减刑，为自己造了福，因此<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>，能得到三个好儿子。”当年夫人有妊，生了应损、应坤、应俊，都是官居显要的。</p>\n<p>　　嘉兴包凭，字信之，他的父亲做过安徽池阳太守，生了七个儿子，凭是最小的，入赘在平湖袁氏，和我父亲交情很密切。他博学高才，可是屡次参加考试，都没有被录取，他爱好佛、道之学。有一天，他去仰湖游览，偶然到了一所村寺，看见一尊观音菩萨的像，因房屋破旧，圣像露立着，遭受风雨的淋漓侵蚀。凭立即取出十金，交给寺里的住持僧，叫他修缮屋宇。那和尚说：“工程大、银子少，是难以完成的。”凭再取出松布四匹，衣服七件，再作捐献。其中有一件精细麻布做的外衣是新制的。随从他的仆人劝阻他，要他把这件衣服留着自己穿。凭说：“但求圣像能够安全保存，我虽露着身体也是情愿的。”住持僧听了这话，掉下了眼泪，说道：“布施银子和布衣，还不是一件难事，只此一点<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>的诚心，实在是很难得的！”以后房屋修理完毕，凭邀请他的父亲同游寺中，夜间宿在寺里；凭梦见伽蓝神来谢他，说：“你的儿女当得功名禄位”。后来凭的儿子汴、孙子芳都登科第，做了大官。</p>\n<p>　　嘉善支立的父亲，在刑房工作。有一囚犯没有罪，却被判处重刑。支立的父亲很同情他、怜悯他，意欲为他反案。囚犯告诉他的妻子说：“支公的好意无以为报，明天请他到家，你以身体招待他，他或肯竭力为我设法，那我就可以不死了。”妻无奈，下泪同意。支公来到囚家，囚犯的妻亲自劝酒，并告以丈夫的吩咐。支公以为不可，但他还是尽力为囚犯作了平反。囚犯出狱后，夫妻登门叩谢，说：“你这样的厚德，是世上少有的！现在你还没有儿子，我们有一个女儿，想送给你做妾，这在情理上总是通得过吧？”支公因备了礼物，纳娶他的女儿，生了一个儿子，取名叫立，二十岁就中了状元。立生子名高，高生子名叫禄，都是贡生，很有才学。禄生儿子大纶，又中了状元。</p>\n<p>　　上面所说的十桩故事，虽然表现的事实不同，但归纳起来，只是一个善字罢了。如果更精确地来推论行善，那么善行还有真有假，有端有曲，有阴有阳，有是有非，有偏有正，有半有满，有大有小，有难有易。需要精研明辩，才能做到真实地行善积德，自利利人。\t\t\t\t</p></div>"
    },
    {
        "title": "什么叫真假呢？",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n\n<h2>了凡四训（三）</h2>\n<h3>　　什么叫真假呢？</h3>\n<p>　　从前有几个儒生问中峰和尚：“佛教说，<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>如影随形。可是我们看到的，有人行善子孙不兴，有人作恶而家门隆盛。佛说的因果道理是没有办法证实的。”中峰说：“世俗的人情不曾洗涤掉，看问题就难以准确，以致认善为恶，认恶为善。有了这样的错误看法，还不责怪自己的是非颠倒，反而怨因果报应为无稽。”</p>\n<p>　　儒生们又问：“善恶的问题怎么会看成相反呢？”中峰叫他们各谈善恶的区别。有人说：“贪财妄取是恶，廉洁操守是善。”中峰说：“未必如此。”各人各说出对于善恶的看法，中峰都说不一定是这样。</p>\n<p>　　儒生们因请问那是什么道理呢？中峰说：“凡是有益于人的是善，只利己的是恶。有益于人，就是骂人打人都是善的。利人的就是公，公就是真；利己的就是私，私就是假。还有，从全心出发的是真，表面上装做行善形式的是假。这问题，你们都应该全面考虑的啊！”</p>\n<h3>　　什么叫做端、曲呢？</h3>\n<p>　　“凡是想做好事，决不可被耳目所迷，随世俗见解，应从内心隐微处，默默审察，是不是纯粹从济世利人之心出发。如果这样，那就是端。假使有一毫沽名钓誉的媚世之心，那就是曲。完全是爱人之心的，就是端，行善而有一毫牢骚愤世之心，就是曲。纯是敬人之心的就是端，有一毫玩世不恭，侮弄世人之心的就是曲。这些都应该详细分辩的。”</p>\n<h3>　　什么叫做阴、阳呢？</h3>\n<p>　　“凡做了一件善事，为人们所知道的，叫做阳善；做了善事别人不知道的；这叫做阴德。阴德能转变自己的业力，能获得意料不到的幸福。阳善可得善报，并享受世间的名誉，被人称誉，美名远扬也是福，但必须名符其实；若是享大名，而实际上却没有真实德行的，就往往会得奇灾大祸。相反的，没有过咎的人而横被恶名的，他的子孙却往往会发达起来，所以阴阳之间，是很微妙的啊！”</p>\n<h3>　　什么叫做是非？</h3>\n<p>　　“鲁国的法律规定：鲁人有从诸侯那里替别人赎出姬妾，都得受政府的赏赐。子贡因为自己富有，赎了人而不受赏赐。孔子听到这件事，就极不高兴地说：‘’子贡做错了事啊！要知道圣人做的事，是可以移风易俗的；他的教导是可以为人作榜样，推行于百姓的，不只是求得自己一时的快意。如今鲁国人富的少，穷的多，如果以为受政府的赏赐为不廉，为不清高，怎么还会有人肯替别人相赎呢？从今以后，不会再有人愿向诸侯那里替别人赎人了‘’。 有人失足落水，子路救了他的命。这人牵了一只牛谢子路，子路把牛接受下来。孔子听了，很高兴地说：‘’子路做得对！从今以后，各国就会有许多能够勇于救难的人了！‘’</p>\n<p>　　”照世俗的眼光来看，子贡不接受赏赐是好的表现，子路受了别人的牛是不好的。可是孔子却赞美子路而斥责子贡。可知所行善事的功过得失，不应光从事情的本身来看，还得看它的影响及于当时和以后的，是利还是害，来加以区分和定论的。现行虽善，而其流风足以害人，那是似善而实非善。现在所做的虽似不善，而其流风足以济人，则其实却是善的。这是从是非一点而论，其它如非义之义，非礼之礼，非信之信，非慈之慈，都是应该考虑决择的。”</p>\n<h3>　　什么叫做偏、正呢？</h3>\n<p>　　”从前有一位吕文懿公，他辞了宰相的职位，告老返乡，人们都非常尊敬他。有一次，有个乡下人吃醉了，当着他的面，把他痛骂一顿，懿公无动于衷，面不改色，对他的仆人说：‘’吃醉了酒的人，不必与他计较。‘’把门一关，就避开了。过了一年以后，这个乡下人犯了死刑，关进监狱。吕公才懊梅地说：‘’假使我当时稍与计较，把他送进衙门惩戒一番，是可以做到小惩而大戒，就不会害他犯死罪了。我当时只顾自己存心于厚道，想不到却养成了他的罪恶习性，竞到了这样的地步。‘’这是以善心而做了坏事的一个例子。</p>\n<p>　　“还有以恶心而做善事的，如某一家大富户，有一次逢到荒年，穷人们白昼公开抢他家的米。他向政府去告状，政府不肯受理这件案子。穷人们因此更加嚣张。他就私自执行，把抢米的拿办困辱，人心才安定下来；不然，几乎酿成大乱了。善者为正，恶者为偏，这是大家都知道的。以善心而行恶事，这是正中之偏，以恶心而行善事的，是偏中之正，这是人所不知的。因此，做一件事，应把动机与效果结合起来看。”</p>\n<h3>　　什么叫做半、满呢？</h3>\n<p>　　”从前有一个女子来到佛寺，想要布施供养，可是身边只有二文钱，就把这二文钱捐献了，寺里的方丈老和尚亲自替她忏悔。后来这个女子选进王宫，享受富贵，带了几千两的银子，又到这所佛寺来布施。老和尚叫他的徒弟替她“回向”就算了。这女子就问老和尚，我当初布施二文钱，老师父亲自替我忏悔，今天我布施数千两的银子，老师父倒不替我忏悔，这是什么缘故呢？老和尚说：‘’以前的二文钱；钱虽少而布施心很真，不是老僧亲自代为忏悔，不足以报德；今天钱虽多，而布施之心，不如前日的恳切，所以我派别人代为忏悔就可以了。‘’这是千金为半，而二文为满的道理。</p>\n<p>　　“汉钟离传授丹法给吕祖。这丹法能点铁成金，可以济世。吕祖问道：‘’以后还会还原变成铁吗？‘’钟离说：‘’五百年后，当恢复本质。‘’吕祖说：‘’这就害了五百年以后的人了。我不愿学这样的法术。‘’钟离心中暗喜，说：‘’修仙要积三千功行，你这一句话，三千的功行已经圆满了。‘’</p>\n<p>　　”还有行善而心无所有，不见有人、我及所施之物的，这叫“三轮体空”，也叫“一心清净”，能这样行善的，就是所施的只有一斗米，也种无边的福，一文钱也可以消千劫之罪，所有善行都是圆满。倘使心着于善，斤斤计较得失，虽然布施了万两黄金，也仅止于半善罢了。”</p>\n<h3>　　什么叫做大、小呢？</h3>\n<p>　　”从前卫仲达做官时，被摄引到冥司。冥司命下属官吏检呈有关他的善恶记录。但见恶录盈庭，而他的善录，仅如筷子大小罢了。取秤来秤，那盈庭的恶录反而比筷轻，而像筷子大小的一束善录反而重。“仲达说：‘’我的年龄还不到四十，哪有这么多的过恶呢？‘’冥官说：‘’一念不正即是恶，不一定要做。‘’因问善录轴里所记的是什么。冥官说：‘’朝庭曾计划兴建大工程，修三山石桥（这在封建时代要拉民工去服役的），你上疏拦阻，这轴里就是疏稿。‘’仲达说：‘’我虽谏阻，但是朝庭没有采纳，于事实上无所补救，我能有这样的善功吗？‘’冥官说：‘’朝廷虽没有采纳，但你的存心是为万民着想的。倘使朝廷接受了，那你的善功就要更大了。‘’所以凡是存心为天下国家着想的，那善虽小而大，倘使为了自己一身打算的，那善虽多也是少了。”</p>\n<h3>　　什么叫做难、易呢？</h3>\n<p>　　“先儒说，‘’克已须从难克制的地方去下手‘’。孔子论为仁也说，‘’应从难处去做‘’（注：毛泽东同志也说”事因难能，所以可贵“）。在此必须象江西舒翁那样舍了二年仅得的工资代别人偿还了官银，保全了一家夫妇免于离散。又如邯郸张翁那样，舍了十年所积蓄的钱，代别人还清赎银，救活人家的妻子，这都是所谓难舍处能舍。又如镇江靳翁老来无子，他的妻子给他买了一个少女作妾。他不忍以邻家的幼女为妾，而送她还家，这是难忍能忍的事。因此，他们所获得的福报也是很厚的。凡是有钱有势的人，如果他要立功积德，却是很容易的。易而不做，这是自暴自弃；贫穷的人做福很难，难而能做，这才算是难能可贵。”</p>\n<p>　　<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>济世的事业，门类是很多的。举其大纲约有十条：</p>\n<p style=\"text-align: center;\">第一、与人为善。</p>\n<p style=\"text-align: center;\">第二、爱敬存心。</p>\n<p style=\"text-align: center;\">第三、成人之美。</p>\n<p style=\"text-align: center;\">第四、劝人为善。</p>\n<p style=\"text-align: center;\">第五、救人危急。</p>\n<p style=\"text-align: center;\">第六、兴建大利。</p>\n<p style=\"text-align: center;\">第七、舍财作福。</p>\n<p style=\"text-align: center;\">第八、护持佛法。</p>\n<p style=\"text-align: center;\">第九、敬重师长。</p>\n<p style=\"text-align: center;\">第十、爱惜物命。</p>\n<p><span style=\"color:#0000cd;\">　　第一、与人为善：</span></p>\n<p>　　从前舜在雷泽地方，见有捕鱼的人互相争夺有利条件，对于强横的，他不批评他们的过失，而对那些肯退让的人，则加以表扬称赞，同时，他自已也参加捕捞，并以身作则，把好的地段让给别人。一年后，大家被此之间，都肯相让了。象舜这样聪明的人，岂不能讲一句教训别的人话吗？可是他不用言教，而以身教，自已做榜样给别人看，来转变别人的思想，这正是良工苦心哩。</p>\n<p>　　我们生活在世间，不可以自己之长来掩盖别人，不可以自己的善来比较形容别人的不善，不可以多能而困惑别人的无能。人要收敛才智，若无若虚，见到别人的过失，要包容而遮盖它，一则，使他可改，二则，使他有所顾忌而不敢放肆。</p>\n<p>　　见到别人有些微长可取，有细小善处可以录用的，就应毅然舍已而从之，表扬而赞美之。</p>\n<p>　　在日常生活中发一言，做一事，都要不为自己着想，都应从带动大家向上向善，形成好风尚，从这一方面做，那么，效益便伟大了。</p>\n<p><span style=\"color:#0000cd;\">　　第二、敬爱存心：</span></p>\n<p>　　君子和小人，就其形迹来看是很容易相混的。只有一点存心处那善恶是绝对不同的，就好比黑与白完全不相同了。所以说：“君子所异于人者以其存心也。”君子的存心只是爱人敬人。</p>\n<p>　　因为人类有智愚贤不肖，有亲疏贵贱，万品不齐，哪一个不是我的同胞，我的一体？因此对他们应当要敬爱。爱敬众人，即是爱敬圣贤，爱敬佛菩萨。《<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>》说：“若令一切众生欢喜者，则令如来欢喜。何以故？诺佛如来以大悲心而为体故。”因为圣贤佛菩萨的志愿，是要一切众生离苦得乐，各得其所，能敬爱一切人，即是和圣贤佛菩萨同一志行了。</p>\n<p><span style=\"color:#0000cd;\">　　第三、成人之美：</span></p>\n<p>　　玉含藏在石头里，被人抛弃，它就等于瓦石，如果加以开发、雕刻、琢磨，就成了宝物。所以当看见别人做了一件善事，或这人的志愿颇有可取，他的天资是堪以造就的，都应该提拔他、奖励他、推荐他、或给他设法维持，或替他剖白冤抑，使这个人在社会上有所成就。</p>\n<p>　　大抵人们都不喜欢与他性情或宗旨相反的人。由于善的人比较少，不善的人比较多，因此，少数的善人所做的事，往往遭到多数不善人的攻击。而且有些豪杰，在细小形迹方面不很注意，就容易引起别人的非议和指责。所以善事常易败，善人常得毁谤。这就需要以维护和成全，这是盛德的事啊。</p>\n<p><span style=\"color:#0000cd;\">　　第四、劝人为善：</span></p>\n<p>　　既然做了一个人，哪一个没有善良的心呢？只是为了追求利乐，而所追求的又没有止境，于是容易使人失足堕落。因此，与人相处，应该方便地指引他、警惕他、拨开他的迷感，使他回复善良的心。譬如长夜大梦，使他一觉惊醒；又如久陷烦恼，拔出他到清凉的地方。如能这样，给人的恩泽最深，功德是很广大的。</p>\n<p>　　古人说：“一时劝人以口，百日劝人以书。”以口劝人如对症发药，收效虽易，可是所及到的不远不广，以书劝人普及广泛而时间久远，造福无量。两者应该同时进行。有了机会可以劝说的而不加劝说，这是失人；不能劝的硬加劝说，这是失言。在这不同的情况下，应该加以慎重考虑。有智藏的人是不会失人，也不会失言的。</p>\n<p><span style=\"color:#0000cd;\">　　第五、救人危急：</span></p>\n<p>　　遭到不幸的灾祸，这是人生道路上所难免的事。对这些不幸者，应该象自己遇到不幸一样，急予解救，或者多方设法伸雪其冤屈，或从各方面救济他的困厄。崔子说： “惠不在大，济人之急可也。”这是说，恩惠不在于大小，只要能解救他的急难可也。</p>\n<p><span style=\"color:#0000cd;\">　　第六、兴建大利：</span></p>\n<p>　　小而一乡一地，大而一省一国，凡有关群众福利的事，应该紧急兴建。如开水渠导水，筑堤防患，或修桥梁以便行旅，或施茶饭以济饥渴，随见随闻向人加以劝导，自己协办兴修，勿避嫌疑，勿辞劳苦，任劳任怨，务使经办的事业获得成功。</p>\n<p><span style=\"color:#0000cd;\">　　第七、舍财作福：</span></p>\n<p>　　佛教万行， 以布施为先，所谓布施，只是“舍”的一个字罢了。</p>\n<p>　　先从财上布施，世人以衣食为命，而财能换取衣食，所以施财为最重要。我能舍财，内以破自己的悭吝心，外以济人的急难。舍财，开始会有些勉强，到后来就会成了习惯。这是最可以洗涤内心的私情积垢的啊！</p>\n<p><span style=\"color:#0000cd;\">　　第八、护持佛法：</span></p>\n<p>　　佛法是万世生灵的眼目，如果没有佛法，就不可能知道三世因果和六道轮回的道理，也就无从脱离尘网，<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>净土，乃至究竟成佛。</p>\n<p>　　所以凡见到佛菩萨的圣像和经书，都应加以敬重。见到毁谤佛法<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>都应当<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>，更应该弘法护教，上报佛恩。那功德是特殊优胜的。</p>\n<p><span style=\"color:#0000cd;\">　　第九、敬重尊长：</span></p>\n<p>　　家有父兄，国有长君。以及年高，德高、位高、识高的人都应该对他们加以尊重。在家奉侍父母要做到和颜悦色、柔声和气，养成习惯。在社会上工作，要尽职负责，尊重领导，对社会国家做出贡献。试看忠孝的家庭，他的子孙是没有不发达昌盛的。</p>\n<p><span style=\"color:#0000cd;\">　　第十、爱惜物命：</span></p>\n<p>　　人类之所以为贵，就是因为有恻隐的慈悲心。如见到动物被杀的时候，恻然有动于衷，内心有所不忍。孟子说： “君子远庖厨。”也是因恻隐之心不忍见到或听到生物被烹宰的惨状。</p>\n<p>　　所以前辈由四不食之戒（专为我杀者不食，见杀不食，闻杀不食，知杀不食）做起。待藏心渐惭增进，不特杀生当戒，而且对蠢动含灵，都应该委曲防护它。因为它们都有性命，都是贪生怕死，和人们是相同的。推已之心，以及一切动物，实行<a href=\"/sushi/\" class=\"keylink\" target=\"_blank\">素食</a>、戒杀、放生都是功德善行。</p>\n<p>　　善行无穷，是难以尽述的。由此十条而推广开去，那万物就可以齐备了。</p>\n<h3>　　四、谦和的效益</h3>\n<p>　　在我国传统的教育中，都详明肯切地告诫我们，谦虚是进步受益的基础，而骄傲自满是堕落失败的阶梯）？易经》里的谦卦中六爻都吉。《易经》说“满招损，谦受益”。谦和骄真是祸福关头，不可不慎啊！</p>\n<p>　　我每次结伴投考，往往见到寒士将要发达，必有一段谦光洋溢，虚怀克制自己的景象。可知谦抑的人心气愈收敛，光彩便愈焕发。</p>\n<p>　　辛未年，我赴省考举人，我们嘉善县参加考试的共十人，只有丁敬宇年纪最轻，他的态度极其谦虚。我对费锦坡兄说： “此兄今年必定登科”。他问我： “你怎么知道呢？”我说： “惟谦受福。你看十人之中，哪有信实厚朴、不敢先人，如敬宇的态度的？哪有恭敬对人、一切顺受、小心谨慎，如敬宇的态度的？哪有受侮不答，闻谤不辩，如敬宇的容量的？一个人能够做到这样，就是天地鬼神也会保佑他，岂有不发达之理呢？”到了开榜，敬宇果然登科了。</p>\n<p>　　丁丑年，我在北京和冯开之住在一起，看见他的态度非常谦虚，跟幼年时的他大不相同。李实岩为人很爽直，有时当面批评他的不是。只见开之平怀顺受，没有一句反驳的话。我对他说： “福有福的开端，祸有祸的预兆，此心真的能做到谦虚，表现在行动上，这是得福的开端，你今年可决定及第的了。”过了不久，果然如我所说。</p>\n<p>　　赵始峰山东寇县人，童年就举于乡，可是过了很久，还没有及第。他的父亲任嘉善县的主暴？他随着父亲到任，仰慕钱明吾学问的渊博，把自己的文章拿去向他请教。明吾把他的文章都涂抹了。赵不但不发怒，而且表示心服，完全接受。到了明年，赵就登科了。</p>\n<p>　　壬辰年，我到北京觐见，遇着夏建所，见他心气和平，谦光动人。我对其他的友人说： “一个将要发迹的人，福虽未至而慧先发，智慧一发，那轻浮的就转变为诚实，平时放肆的也就自然收敛了。建所的态度这样地谦和，他的前途必然是光明的了。”及至开榜，果然中了。</p>\n<p>　　江阴张畏岩，学识很渊博，善于作诗文，在文人学士中颇有声誉。甲午年南京乡试，他寄宿在佛寺里，发榜没有他的名，就大骂考官瞎了眼睛。当时有一道人在旁微笑着。张就迁怒到他。</p>\n<p>　　道人说： “相公的文章，一定做得不好的”。张听了更是火冒三丈，就斥诉他： “你没有见过我的文章，怎知道我写得不好呢？”道人说： “听说写文章贵在心气和平，现在听到了你在骂人，满腹牢骚，心气不平极了，文章怎么写得好呢？”张感到他的话有些道理，因而屈服，就向他请教。道人说： “一个人要考中，全得靠命，命不该中，文章虽做得好，是无益的。你今后需要自己做个转变”。张问道人： “既是命定，怎么能够转变呢？”道人说： “所以形成现在之命的是前世的业报，业报是自己所作的，创立今后的却在于你自己啊！只要尽力做善事，广积阴德，有什么福不可求得呢？”张畏岩说： “我是穷人，有什么办法呢？”道人说： “善事阴功都由心造，常存善心功德无量！且如谦虚一节，并不费钱，你为什么不责自己不奋勉努力，而反骂试官！”张很佩服道人的话。从此痛改前非。一切有益于人的善事，每天努力去做，因此品德日增。丁酉年梦到一所大的房屋里，得试录一册，其中有好多行是空白的。于是他问旁边的人。有人说：“这是今科的试录”。张接着又问： “为什么有这许多缺名呢？”那人回答说： “阴间对于科第每三年作一次考核，要积德而没有过失的才有名。如这一册中所缺的，都是本该中试，因新近有了缺德的行为而被删去了的。”后来又指着一行说： “你三年来持身很谨慎，有可能填补这一空白的，你要好好自爱啊？”在这一科，张畏岩果中一百零五名。</p>\n<p>　　由此看来，趋吉避凶，这是断然由我自己作主的。因此，须要自己约束行为，丝毫不得动恶念、行恶事，这样才是受福的基础。凡是骄傲自满的人，必非远大的人才，即使发迹，也是不得长久受用的。稍有见识的人必不忍自狭其量，而自拒其福。况且只有谦虚才有机会受到教育，从而能得到无止境地进步。因此，谦是求学进德所必不可少的啊！古人说：“有志于功名的必得功名；有志于富贵的必得富贵。”人之有志如树之有根。立定此志，要念念谦虚，时时方便，无微不至，这样就自然转变业报，造福由我自主了！\t\t\t\t</p></div>"
    },
    {
        "title": "了凡居士略传",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n\n<h2>了凡<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>略传</h2>\n<p><span style=\"color:#ff0000;\"><strong>　　原文系文言文，为清朝彭绍升撰</strong></span></p>\n<p><span style=\"color:#ff0000;\"><strong>　　学杨 据<a href=\"/ctwh/shi/24s/mingshi.html\" class=\"keylink\" target=\"_blank\">明史</a>订正补撰</strong></span></p>\n<p>　　袁了凡先（1533-1606），生于明世宗嘉靖十二年（西元1533年），卒于明神宗万历三十四年（西元1606年），本名袁黄，字坤仪；世居浙江嘉兴的陶庄（明代并入嘉善县）。其曾祖袁颢年轻时入赘到江苏省吴江县姓徐的人家；在吴江县得了公费做县里的公读生。他于明穆宗隆庆四年（西元1570年）在乡里中了举人；明神宗万历十四年（西元1586年）54岁中进士，奉命到河北省宝坻县做县令。过了七年升拔为兵部职方司主事，万历二十年（1592年）刚好碰到日寇丰臣秀吉带兵侵犯朝鲜，朝鲜向中国求救兵。当时的经略（驻朝鲜军事长官）宋应昌奏准请了凡为“军前赞画”（参谋长）的职务，并兼督导支援朝鲜的军队。</p>\n<p>　　此时提督李如松掌握大明朝援朝军队的兵权，他假装赐给高官俸禄与日寇谈和，日寇信以为真，没有设防；李如松发动突击，攻破形势险要的平壤，因而打败了日寇。了凡先生因为这件事当面指责李如松，不应用诡诈的手段对付日寇，这样有损大明朝的国威；而且李如松手下的士兵随便杀害百姓，并以头来记功。了凡向李如松据理力争，李如松发怒；不但不接受劝诫，反而独自带著军队东走，使得了凡所率领的军队孤立无援。日寇因而乘机攻击了凡的军队，幸赖了凡机智应对，将日寇击退。而李如松的军队，最后终于被日寇击败了；他想要脱却自己的罪状，反而以十项罪名弹劾袁了凡；</p>\n<p>　　在万历二十一年癸巳（1593年）朝廷的“京察”（六年一度的京官核查）中，了凡被言官弹劾“不称职”，实际上是朝廷内部官僚集团的倾轧，终于在“拾遗”（谏官）的仕内，被迫停职返乡。在家里，了凡非常恳切，认真地行善直到去世。明神宗万历三十四年（西元1606年），了凡先生逝世，享年七十四岁。</p>\n<p>　　明熹宗天启年间（1621－1623），了凡的冤案终于真相大白，朝廷追叙了凡征讨日寇的功绩，赠封他为「尚宝司少卿」的官衔。但大明朝此时已经是忠贞在野、奸佞在朝、宦官专权，继续留在朝中的忠臣良将几乎无一例外遭到残酷屠戮，大明气数已尽。仅仅20年后，1644年，大明朝的江山就被清朝取代了。袁氏家族以袁黄被提前罢黜的原因免遭以后许多鲠直大臣被灭门的杀戮。</p>\n<p>　　了凡先生从当学生时，就非常喜欢研究学问，书不论古今，事不分轻重，他都认真研究，并且非常通达。例如：星象、法律、水利、理数、兵备、政治、堪舆等。</p>\n<p>　　了凡先生在宝坻县当县长时，非常注重人民的福利，常常想做些有利地方的事情；宝坻县当时常有水灾泛滥，了凡先生于是积极兴办水利，将三汊河疏通，筑堤防以抵挡水患侵袭；并且教导百姓沿著海岸种植柳树，每当海水泛滥，挟带沙土冲上岸时，遇到柳树就积挡下来，久而久之变成一道堤防。于是了凡先生又督导百姓在堤防上建造沟渠，并鼓励百姓耕种；因此，荒废的土地渐渐地开垦，了凡先生又免除百姓种种杂役以便民，使得百姓安居乐业。</p>\n<p>　　了凡先生家里并不富有，可是却非常喜欢布施，家居生活俭朴，每天诵经持咒，<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a><a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>，修习<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。不管公私事务再忙，早晚定课从不间断。在这当中，了凡先生于万历二十九年（1601年）68岁时写下四篇短文，当时命名为《戒子文》，用来训诫他儿子，就是后来广行于世的《了凡四训》这本书。</p>\n<p>　　《明史》对于袁黄（了凡先生）记载有多篇，偶举可见《历志》、《艺文志》、《循吏列传》等。仅据清朝宰相张廷玉所撰的《明史》所载，了凡的著作包括《历法新书》五卷、《宝坻劝农书》二卷、《皇都水利》一卷、《群书备考》二十卷、批削《四书》《书经集注》而成《删正》等。其余还有《宝坻政书》、《情理论》、《了凡四训》、《祈嗣真诠》（医书）等等。</p>\n<p>　　台湾大学《中国历朝编年史》记载中国公元1606年唯一事件：袁黄（袁了凡，1533-1606）逝，著有《了凡四训》。</p>\n<p>　　了凡先生的夫人非常贤慧，经常帮助他行善布施，并且依照功过格记下所做的功德，因为她没有读过书，不会写字；因此用鹅毛管沾红墨水，每天在历书上做记号。有时了凡先生较忙，当天所做功德较少，她就皱眉头，希望先生能多做些善事。有一次，她为儿子裁制冬天的大袍子，想买棉絮做内里。了凡先生问：“家里有丝绵又轻又暖和，为什么还买棉絮呢？”了凡夫人答：“丝绵较贵，棉絮便宜，我想将家里的丝绵拿去换棉絮，这样可以多裁几件棉袄，赠送给贫寒的人家过冬！”了凡先生听了非常高兴说：“你这样虔诚的布施，不怕我们孩子没有福报了！”他们的儿子袁俨，后来中了进士，最后以广东省高要县的县长退休。</p>\n<h2>关于《了凡四训》</h2>\n<p>　　「了凡四训」，世人几乎都晓得，是改造命运创造幸福的宝典。凡是有福份的人，都能够在获得此书之后，细心阅读，庆幸自己获得人生指南，进而立定志向，力行实践，能够化疾病于无形，扫除穷困的威胁，消除生活的烦恼，改变现状，改变命运，获得新的生命。</p>\n<p>　　「了凡四训」，作为修身之座右铭，人人可以成圣成贤。若作为处世之准则，举世可以消除灾难与业障。确实是自救，救人的最佳捷径。</p>\n<p>　　「了凡四训」，内容通俗明朗，简明易读，适合于不同文化程度，不同<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>，不同阶层的读者，其所含有「修身律己，安身立命」之道，以及「化凡入圣，超生了死」之理，是明明可鉴的。</p>\n<p>　　因此，凡是有先见之明的人，都不会放过阅读此书的机会。凡是有智慧、有志气、有作为的人，想了解宇宙人生真相，服务社会，造福人群的人，在读完此书之后，逢人介绍传颂此书可贵之处。而这些宝贵的收获，正是此书之所以能够流传千古，历久不衰的真正原因。</p>\n<p>　　「了凡四训」，是袁了凡先生，于七十岁高龄，回顾一生的总结，亲身经历，实践改造命运的精华。</p>\n<p><span style=\"color:#ff0000;\"><strong>　　何谓四训：「立命之学」「改过之法」「积善之方」「谦德之效」。</strong></span></p>\n<p>　　第一篇「立命之学」，勉励世人奋发向上，千万不要自暴自弃。因为人生的命运，气数是由前生造因而定，但是命运的好坏，是可以由你今生的善念、善行、或者恶念、恶行、而改变的，因此以立命之学，作为开宗明义。</p>\n<p>　　第二篇「改过之法」，要严以律己，检讨反省自己的过错，敢于面对过错，勇于改过。只有知错改过之后，行善才能收到效益，否则是徒劳无功的。所以改过是立命的首要任务。</p>\n<p>　　第三篇「积善之方」，在知错能改之后，要懂得行善的道理和方法，即是不为名利，默默恒久地行善，行善的同时必须除恶。</p>\n<p>　　第四篇「谦德之效」，袁先生以故事，生动地畅述「积善之方」。初学行善的人，当行善之后获得福报，喜悦的同时，产生骄傲情绪，是常见的毛病。袁先生训子之文中，再三叮咛「满招损，谦受益」的道理。若能够谦虚为怀，时时抱着行善惟恐不足之善念，才能使立命收到效果，而达到改造命运的目的。</p>\n<p>　　中华道德学会为了便于大家阅读，让更多人受益，出版白话「了凡四训」，希望大家阅读之后，都能够学习「了凡先生」，改造命运的精神，创造自己的幸福，以及社会、国家，乃至全人类的光明前途。</p>\n<p style=\"text-align: center;\">往昔所造诸恶业，皆由无始贪嗿痴，</p>\n<p style=\"text-align: center;\">从身意语之所生，一切今我皆忏悔。</p>\n</div>"
    }
]