[
    {
        "title": "了凡四训大意亲闻记",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n<p>　　<a href=\"/ctwh/jing/mxjd/lfsx.html\" class=\"keylink\" target=\"_blank\">了凡四训</a>大意亲闻记 净空法师主讲</p>\n<p>　　刘承符<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>记</p>\n<p>　　净空法师于一九九三年四月二十八日在加州德安乍(DEANZA)学院讲了凡四训大义，为期五日，承张德声居士寄赠录音带五卷，恭听之后，摘要记录，<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>读者。</p>\n<p>　　各位同学：</p>\n<p>　　今天我们研究袁了凡先生<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>四训，这篇文章从明末一直流传到现在将近四百年，其价值几乎等于经典。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>是由真如本性中流露出来的，这就是一般人所说的真理。真理永恒不变，超越时空。此四篇文章亦如此。浅者见浅，深者见深，绝不是由思考中想出来的，而是由真性中发泄出来的。同时又搭配他几十年修学的心得与经验，故能有如此普遍广大的流传，给后人真实的利益。往浅里说，它能改造个人的<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>，深一层讲，它给大乘<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>奠定了非常深厚的基础。</p>\n<p>　　<a href=\"/fjrw/hcrw/ygds/\" class=\"keylink\" target=\"_blank\">印光大师</a>的序文非常好，开头说：‘圣贤之道，唯诚与明。’这两句话把世出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>教育的精髓一语道破。<a href=\"/fojiaogushi/duan/rszs.html\" class=\"keylink\" target=\"_blank\">人生在世</a>都被命运所支配，如果知道事实真相，即可主宰命运。大师前面两句话的重心即‘诚与明’。佛四十九年<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>与孔老夫子教诫我们的也是这两个字。孔子教学的对象是人道，<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>化的范围是九法界，诚与明在境界上孔子说的广泛，若言其根源即佛家的三无漏学。‘诚’属于‘戒定’，‘明’属于‘慧’。迷即凡夫，明则为佛菩萨，世间法的成就亦建立在诚与明。大师说诚之一字，凡圣同具，而凡夫不去用它。诚即真心，不诚即妄心。佛说真心离念，心中无念头即是诚。但不要误会，了凡先生与云谷禅师坐了三天三夜，一念不生，但云谷仍说他是凡夫。<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>说：‘应无所住而生其心’。若只有应无所住，即入了外道的无想定，其<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>在无想天，出不了<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。无念是无<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>，非无<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。六根仍有广大<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>的作用，但没有邪念。对境界无分别无执著，了了分明，清清楚楚，谓之正念。<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>讲‘照见<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>皆空’，用照字，即非思维想像。大师又说诚是本有，而今失掉，把它恢复叫修德，本有的叫性德。恢复的方法要觉要察，觉是醒觉，由内心<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>，察是对外面之观察。修学的三大纲领是觉而不迷，正而不邪，净而不染。迷、邪、染是凡夫，觉、正、净是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。觉是决定不能有妄念，时时刻刻保持自己的清净心，这是很难修的。对人对事对物非常复杂，如何保持清净心乃是真正的工夫。</p>\n<p>　　人有过去现在未来，依佛经所述，释迦佛时代，人寿百年，以后每百年减一岁，算到现在，人的平均<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>应为七十岁。这几十年的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>，极为短促，而未来的时间无限。聪明人不计较现在，假如今生为名闻利养所牵挂，将来后患无穷，应时加警惕，如何起心动念，处世待人，以及言语行为是否有违于情理法之处，应即检点自己习气过失，力求改正，此谓之<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。修行不在形式而在内心。若是坐在佛堂，敲著木鱼，<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>，而心中胡思乱想，甚至于贪嗔痴慢依旧未减分毫，非真修行。印光大师一生，<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>清苦，作到了与人无争，于世无求。他劝人闲邪存诚，老实念佛，对人一无所求，可见其所说的都是真心话。我们对于先贤要认识其人格，先建立<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>，一分诚敬得一分利益。大师又说：‘然作圣不难，在自明其明德。’明德即诚与明。此是性德，真性之流露。在序文小注云：‘明德指在圣不加，在凡不减，人人本具照曜天地之真心。’大师说教是依儒家之修行次序，格物致知，正心诚意，修身齐家治国平天下。儒家讲格物之物字指物欲而言，与佛家所说断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>有同一意义，均为修行之根本。离开物欲乃真<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，自由<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，不再受烦恼的束缚。</p>\n<p>　　致知是破所知障，心中若有<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，真<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>即不能现前。格物最后得定，亦即是诚。致知的效果是慧。一定要从断烦恼下手。用何种推动力使学人努力修学，<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不懈，乃是一大前提。世人熙熙攘攘，奔波勤劳，其推动力是为名为利。佛教我们放弃名闻利养，闻之嗒然若失。因为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>不了解事实真相，不知道名利是假的、是虚幻的，所以<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>人多而肯认真断烦恼者，并不多见。菩萨以大愿心为推动力，众生无边誓愿度，帮助一切世人出于苦难。这个伟大动力可使他们能断一切烦恼，修学一切法门。</p>\n<p>　　每人都希望幸福快乐，安康自在，如照佛法之教诫行之，一定可以得到，<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>，如影随形，作善必有善报。但须参考了凡在四训中所说之积善之方，他说善有真假、端曲、正偏、半满之别，为善必穷理，否则行无益。例如用私曲心打著佛教幌子，兴办佛事，暗中得到名闻利养，可能一时收获颇丰，而后面的苦报不堪设想。</p>\n<p>　　凡夫之烦恼千差万别，有人贪心重，有人嗔恚心重，有人贪名，有人图利。断烦恼如治病，须先治重的症候，大病治好，小病就容易办了。烦恼断，心中清净，然后再广学多门。学一门，心可专，多则杂乱。</p>\n<p>　　心正、言行自正，若心不正，言行虽然尽量掩饰，也会被人看穿。学人应把所学圣教应用到日常生活中，绝不起丝毫自私之念。大师在序文中又讲：‘克己复礼，主敬存诚’。这是修学的纲领，克己复礼是手段，主敬存诚是法则。己是私欲，礼是性德，亦即王阳明先生所说的良知良能。主与存同义。诚是内在的真心，敬是表现于外的恭敬。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>十大愿王第一条礼敬诸佛，佛包括过去现在未来佛，未来佛就是我们尚未<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>的众生。诸佛礼敬九法界一切众生，而众生不知道礼敬诸佛，诸佛当原谅我们无知。至于如何才能作到克己复礼，主敬存诚，具体而言必须用颜子的四勿与曾子的三省。四勿是‘非礼勿视，非礼勿听，非礼勿言，非礼勿动’。如真能明白这四句的意义而且真能作到，修持三年即可成圣成贤。</p>\n<p>　　礼，前面已经说过，就是性德，就是合法<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>，其绝对的标准是三福、<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>、三学、<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>、普贤菩萨十大愿王。相对的标准是世间的风俗习惯，法律规章，以四摄法随顺世俗，如何将此绝对与相对标准相辅相成，乃是当今的重要课题。佛法不能普遍推广，其最大障碍即此两种标准不能调和。有人学佛之后要去当古人，与现代人格格不入。现代人视之亦觉其不能随群，互有矛盾。佛法的原理原则，万古常新，没有时空的限制。至于手段与方法随时适应于每一时代。换言之，绝对的标准不变，相对的标准可以随时在变以适应各地区各时代众生的需要。</p>\n<p>　　曾子的三省：‘为人谋而不忠乎？与朋友交而不信乎？传不习乎？’这三句话适用于每一个人，无论士农工商，凡是天天外出工作者，应检点是否尽心负责，把一份工作作好，对社会国家以及一切众生有无尽到应尽之责。在家庭中，无论家长或主妇，照顾一家人，是否作到尽善尽美？这全包括在为人谋而不忠乎一句范围之内。交友本来是志同道合之结合，应肝胆相照，绝无诡曲之心。美国讲信用是建立在法治的基础上，佛教的信建立在性德上，自动自发，无人管制。传不习乎？对老师的教诫有无认真学习，依教奉行。不辜负父母师长的期许，天下亲师都希望子弟将来成圣成贤，至少也是正人君子，事业有成，并不愿意子弟作奸犯科。</p>\n<p>　　大师讲到修学的次第，完全引用儒家术语，年岁稍长者都读过四书五经，读大师文章倍觉亲切，且其意义与大乘佛法完全相应。他先从格物开始，革除物欲，离开五欲六尘，生活朴素节俭，妄念少，心地清净，快乐自在。反之，若追求奢华，填补欲望，生活必受压力，活的好苦。以美国而言，起码的生活并不困难。衣能御寒则可，不必求时髦。食能得到营养，无须大鱼大肉。住家更不需要豪华。有人请我参观其住宅，建筑高雅，设备讲究，确实不错，但我觉得房主人太可怜了。清洁打扫，整理花园，吸尘除草，一天到晚作房子的奴隶，诚愚不可及。学<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>能突破物欲，即能得<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>最高的享受，无丝毫压力、牵挂、忧虑，作自己最喜欢作的事，读自己最喜欢读的书，心清净，烦恼少，<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>里本有<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>智慧自然透露出来，此为根本智，再接触外面境界，眼一看就清楚，耳一听就明白，此为后得智。性德透出来谓：明明德。单有诚而无明，单有定而无慧，属小乘定。单有慧而无定是狂慧，乃八难中之世智辩聪。真智慧非由研究经典思考而来，是自性里自然流露。一看佛经与我自己的意思一样，乃真智慧。下手一定由断恶修善开始。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>的标准应先了解，凡是为己者皆恶，念念增长<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>，永远在搞<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>。样样不为自己而为众生，不但超越三恶道与人道，而且超越天道。念念为众生是善，善必有善报。‘欲知前世因，今生受者是；欲知来世果，今生作者是。’把这种事实搞清，知道一生遭遇是果报，决不怨天尤人。读诵了凡四训之后，即知了凡先生改造命运之法根据的理论所在。</p>\n<p>　　作一个<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>乃无上光荣，必须作到‘行为世则，言为世法。’一举一动为世人的模范。如是则佛法那有不兴旺，那有不被社会大众尊重的道理。今天佛法未能普遍推广，乃是我们讲的是一套，作的又是一套。能说不能行，使大家瞧不起。甚至于所讲的与所作的完全相违背。劝人修善，而自己作恶，不但自身堕落，也破坏了佛教的形象，这个罪过可大了。</p>\n<p>　　在中国大陆有许多佛教徒听过我的录音带。当我去北京时都想来见我一面，<a href=\"/remen/xintu.html\" class=\"keylink\" target=\"_blank\">信徒</a>很多，场面很大。可惜大家不知遵守秩序，争先恐后，乱遭遭地把我包围。我于是乎大声告诉大家保持肃静，不然把佛教形象破坏了。外面人不知发生什么事情，警察都来维持秩序。甚至于还有人请我签名，拿我当作明星。过去朱熹先生到寺庙参观，正赶上过堂用斋。朱熹一看，一点声音没有，秩序井然，他说：‘三代之礼，尽在是矣。’</p>\n<p>　　了凡四训一书，若照佛经序正<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>三分法分之，立命之学为序分，改过积善为正宗分，谦德之效为流通分。第一篇立命之学，内容最主要的一点，说命运是真有，述明事实真相，有理论的根据。一开端他先说他自己的一段故事，童年时遇云南孔老先生，为其推算一生命运，最初纤细皆验，说明人的命运可以用数理推算休咎。中国一般的<a href=\"/remen/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>看相占卦均发源于易经，易经是高深的数学又是哲学。由数理推算吉凶祸福，荣辱休咎，多有灵验。推理是比量，有时也会推错。最正确是<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>，现量由<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>产生。甚深禅定中，时间空间的界限都消失了，过现未融成一片能亲眼看到，一点不会有错。孔先生对皇极经颇有研究，得邵子皇极数正传，其推算之术相当高明。为了凡先生批算流年大运极为准确。各位同学仔细读完立命之学一章后，方知人的一生，一饮一啄，莫非前定。他算了凡每年收入的俸禄，丝毫不差。每岁考试，考第几名，作官作到什么阶级，在最初二十年一一悉验。他乃恍然大悟，人的一生命运已经定了，无可奈何，打妄想也没有用。后来他到北京一年多时间，终日<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>，不读书，求个心安理得。次年南归，到南京栖霞山访云谷禅师。云谷禅师当时很有名气，也很有道心。他与禅师在禅堂中坐了三天三夜，不瞑目，禅师对他肃然起敬。对他说：‘凡人所以不得作圣者，只为妄念相缠，汝坐三日，不见起一妄念何也？’他答覆道，我的一生命运已被孔先生算定，荣辱<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>皆有定数，打妄想也没有用。云谷笑著说，我原来认为你是一位豪杰，其实仍然是个凡夫。</p>\n<p>　　谈到禅定工夫，佛经里说得非常透彻。了凡的定功三天三夜不起一妄念乃小工夫，倓虚大师开示，<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>工夫好的一坐半个月不出定，再如<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>天，以至于非想非非想天的禅定有八万大劫之久，已非按年数计算，如此甚深禅定还是不管用，因其仍有妄念，不过是伏著，还未断根，如定功失掉，妄念又起，所以<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>也是凡夫。有妄念仍落在数里，逃不出命运之支配。若修到罗汉才真无妄念，称为第九次定，又称灭尽定，灭尽了妄念，超出三界，谓之圣人，已不是凡夫。</p>\n<p>　　了凡最初二十年的经历与孔先生推算的行运完全符合，所以他认为命有定数，数不可逃，亦未作大善大恶之事，乃是一位标准凡夫。云谷禅师告诉他说：‘命由我作，福自己求。’命运是自己造的，佛事门中有求必应，求富贵得富贵，求男女得男女，求长寿得长寿。佛教经典中如此说，岂能诳语欺人。况且净宗经典是求永远不死，无上佛道。成佛都能求，何况其他。应知一切造作都离不开心，动作言语皆以心为主宰。一念善即得善果，一念恶即遭恶报，他引用六祖大师的话：‘一切<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>，不离方寸，从心而觅，感无不通。’我最初同李老师学佛，他告诉我，讲经说法不容易，只靠经教不行。如想通达世出世间一切学问，不要说现代学术以及外国典籍，即以中国古老的四库全书而言，亦无法遍阅。我曾向台湾商务印书馆订购一部，该馆经理对我说，一个小孩一生下来就看这部全书，活一百岁，到死还看不完。何况还有佛法，其最大一套丛书是<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>。大藏经以外之佛学典籍亦不少于大藏经之数量。一生中不能通达世出世间一切学问，如何能讲经说法。光靠读诵研究不能通达，要用至诚感通之法。自古以来<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>里代代相传的就是这个法门。孔孟之学亦用此心传，所谓‘一经通一切经通’，非文字通、义理通，而是以‘真诚心’感通。世出世间一切法都是由心性中流露出来。大师说主敬存诚。内真诚、外尊敬。普贤十大愿王第一个是‘礼敬诸佛’。一即一切，这一个敬字即包括后面九个愿王。</p>\n<p>　　从心性中求，无不可得。最初了凡还有疑惑，认为<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>仁义可以力求，功名富贵如何求得。功名富贵由心性中求亦能求得，如由外面求，则求之有道，而得之有命，仍在数中。两个人同样求发财作生意，一个发财，因其命中有财，一个赔本，因其命中无财，还是逃不出命运。如由心性中求，内外双得。你必须知心性是什么？在有情众生方面叫<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，在无情方面叫法性。外面万事万物均是由心性变现出来，由性中求，求功名富贵，求儿女，求长寿，求罗汉果，求菩萨果，求无上佛果，均能得到。不但其道德仁义成就，其外在的荣华富贵亦得到了。华严毗卢遮那佛之依正<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>，世无伦比，是其性德自然流露。有人怀疑，生活俭朴为美德，而佛的依正二报那样豪华，黄金为地，七宝宫殿，岂不太奢侈了吗？其实佛也不要这些，而是由性德自然流露，不是自己有意如此。</p>\n<p>　　孔先生为了凡算命，在功名方面不能中进士，一生无子，寿命只有五十三岁，官居七品。了凡非常诚恳，他说自己毛病很多，第一不耐烦剧，器量小，不能容人，刻薄傲慢，轻言妄谈，福薄之相。其次自己有洁僻，好发脾气，又过份爱惜羽毛，不能舍己为人，多言耗气，喜饮酒，喜长夜静坐。有此种种毛病，不能有子。了凡勇于认错是其可取处。</p>\n<p>　　四训小注中有一段说：‘大修养人除欲净尽，心境空明，更无阴气足以覆盖，常在定中，智光湛然，永断睡相，此圣境也。’修学一定要知道自己的能力，达不到的勿勉强去作。如了凡之彻夜长坐，即禅宗讲的不倒单。这要很好的工夫，要私欲断尽，名闻利养五欲六尘都没有了，心中无一物，自性里的般若智慧透出来，光明遍照，可以不倒单，否则坐著睡那有躺著舒服，真有工夫，坐几分钟即可以恢复精神。佛门中两种现象，一个不倒单，一个持午。大多数人自不量力，目的在求恭敬供养，完全错了。身体即一副机器，要靠能量，能量不足，毛病就来了。能量百分之九十都消耗在打妄想上。我们念佛人修当生成就的法门，经上并没有叫我们日中一食，夜不倒单，所以不必标榜这些。</p>\n<p>　　云谷又说：‘世间享千金之产者，定是千金人物。享百金之产者定是百金人物。应饿死者，定是饿死人物。天不过因材而笃。几曾加纤毫意思。’这是说一饮一啄，莫非前定。从历史上看，可以得到证明，舍己为人，累功积德者有三个人，第一个是孔老夫子，有教无类，以真诚心、平等心、大慈悲心<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生，其学生代代相传，弘扬夫子之道。二千年来孔氏子孙历代受到世人拥戴，孔子在世时并非有显赫地位，一普通百姓而已。其世代子孙托生孔氏家中定是其前生积德修善所致。</p>\n<p>　　符按：法师说：‘中国历史上舍己为人者有三个人，但只说了孔子一人，其后二人未曾提及。在下猜测第二个人应为范文正公仲淹，作宰相，一生不置产，所得俸禄均施诸鳏寡孤独。后世子孙簪缨不绝，直到民苏州范家后人都是有头有脸的人物。</p>\n<p>　　云谷禅师对了凡说：如想功名儿女，要把无功名没儿女的业因消除，改过刷新，才能有求必应。务要积德，务要包荒。包荒就是能容人，所谓量大福大，不能容人，没有<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。自己没有福报不怕，怕的是不积德不修善。我见过很多人，年轻时高官厚爵，飞黄腾达，到五六十岁下台之后，困苦不堪。真正享福要在晚年，青年得意时，多作<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，舍掉之后，其命中福报仍在，到晚年又发了。佛说富贵、聪明、<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>长寿是由财、法、<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>三种布施得来。</p>\n<p>　　我初学佛时，朱镜宙老居士送我一本了凡四训，读过之后非常感动。我年轻时，我的福气比了凡还薄，习气比了凡还重。有人给我看相算命，都说我很聪明，福薄，寿命到四十五岁。学佛的时间表我就订到四十五岁，到四十五岁那年害了一场病，知道时间到了，也不看医生，只念佛求<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>，结果不药而愈。有一年台北举办仁王护国<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>，在会中遇到甘珠活佛，他把我叫到一边，对我说：‘从前我们都在背后笑你，你福薄又短命，你现在变了，将来福很大，寿也很长。’我前生大概<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>不修福，所以今生聪明有，而福报一点没有。现在的境遇都是今生修的。</p>\n<p>　　我有一位老友刘延武先生，去年过世。多年前他曾一度贫困潦倒，一家七口有五个小孩，几乎活不下去。我给他一本了凡四训，叫他学了凡先生。后来五个小孩有四个博士，晚年完全改变过来。他非常感激我，说我救他一家。其实我不过送他一本书，他肯认真改过积善，扭转了自己一家的命运。</p>\n<p>　　佛门常讲乘愿再来，大家都认为生西以后，再倒驾慈航来世度生，谓之乘愿再来。其实当前即可作到，我们都是受命运支配，如果断恶修善，积功累德，利益众生之愿超过自己的业力，现在就是乘愿再来，已经是愿力身而非业力身。这种转变完全操之于自己手中，与佛菩萨上帝鬼神并不相干。起心动念只想到世人的苦难，众生的迷惑，希望社会国家长治久安，自然<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>日增，不求而自至矣。我们虽然力量有限，不能没有这个心，存此大悲心，<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>不可思议。</p>\n<p>　　云谷禅师说：‘易为君子谋，趋吉避凶。’圣贤之教是为君子，世人只有君子善人才能接受圣教。并不是圣贤有偏爱，不肯施教。他又说：‘凡祈天立命都要从无思无虑处感格’，就是要由清净心中求感应，真诚恭敬心中无界限，如起了一念妄心，即有是非人我变为窄小。清净心尽<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>遍法界与佛菩萨天地鬼神感应道交，冥冥中得到加持。</p>\n<p>　　以上是云谷禅师教他改造命运之法，即所谓立命之学。云谷禅师第一个例，说明真诚之意义，道教有画符之说，画符要一笔下来画到底，心中不能有杂念才灵，心中真诚能与天地鬼神感应道交。<a href=\"/fozhou/\" class=\"keylink\" target=\"_blank\">念咒</a>也是一样，念咒时不得有妄念。佛法中许多<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>为鬼神言语，虽写成梵文，印度人也不懂。代代相传，其音已变，纵然持诵的音调不正确，只要诚心亦有感应。<a href=\"/fozhou/dabeizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">大悲咒</a>只有八十四句，持诵时如不打一个妄想亦不容易，其实‘阿弥陀佛’这一句也是咒，最短最易持，果能以清净心念佛，<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>无量无边。</p>\n<p>　　世出世间一切法，凡用妄心均不能成就。儒家讲正心诚意，修齐治平，基础即在一‘诚’字。由事上下手应先修身，把不正确的思想言行纠正过来，只蓦直行去，认真修行，用平常心对待，不必问收获。佛法叫人发愿广大无边，但不可急于求功，或预计如何如何，如此则落到意<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>上，全是妄想。清净心能生福德智慧，所以求乃是向自性中求，而非向佛菩萨求。</p>\n<p>　　道理明白了，作起来并不简单。平生妄想习气太重，不易断除，不容易接受圣教，往往半信半疑。佛度有善根的人，经中说佛不能度<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>之人。无缘之人就是无善根福德<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>之人，他不肯照佛法去行。善根是世世累积的，福德是对圣教肯信受奉行，因缘是此人一生有无遇到<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。善根福德因缘同时成熟，这一生就有得度的机会。此三者俱足不容易。</p>\n<p>　　真修行就是<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>、修清净心、修真心、修<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。中国在过去无论在家<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>，皆由先断一切知见入门，现在由广学多闻下手，完全不同。民国以来把古老的教学方法完全舍弃，民初唐大圆先生写了一篇文章，畅述此项改革之非，颇有<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>。从前是先求根本智，即清净心，亦即儒家所说的正心诚意。至于修齐治平是后得智。现在学西方人，没有根本智，那里来的后得智，所以两种智慧全失掉了。现已根深蒂固，对古老的教学方法已很难接受。古人教学，儒家教小学生，先教识字，念<a href=\"/ctwh/jing/mxjd/sanzijing.html\" class=\"keylink\" target=\"_blank\">三字经</a>、百家姓，然后读四书五经，只是背诵，并不开讲，使学生心中清净安祥。佛教之教学方法类同，一出家头五年学戒，遵守老师的教诫，祖祖相传，先求心之清净，心要空要寂，空是没有一样东西，本来无一物。寂是不要动，不要胡思乱想。各宗派用的方法不同，禅宗修禅定，用观心之法，不打妄想，也不能不想，什么都不想叫死定枯定，修成功就变成外道的无想定。教下是<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>，不论经文长短，念得字字清楚，句句分明，不许思维经中义理，一研究即是打妄想。何以言之？举例说，金刚经与<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>的古德注解不下一百多种，每种都是打妄想思考出来的。如果是如来真实义，应当只有一个，何以有如此之多，且不一样？因真实义是没有意思，无言说。古大德的注解只能帮助启发学人的后得智，但是没有根本智，那有后得智。佛知道后世修行人契入佛法困难，所以说出四依法，其中之一是依法不依人。法是佛经，人是古德注疏。依经就对了，依古德注疏可能有偏差。今天知道此项事实者不多，往往一开端就把路子走错了。</p>\n<p>　　学经教只能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>一种，如楞严或法华，每天读诵一遍要五六小时。读经是修定，有三五年功夫必见功效。读经是<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>三学一次完成。华严说：‘行步不碍<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>，圆融不碍行步。’行步依次第学习，圆融不涉次第。读经是圆修，不读经时，处世待人接物是次第修。五年学戒是奠定戒定慧基础。戒学总纲领是‘诸恶莫作，众善奉行’。定学纲领是‘自净其意’。慧学纲领是‘般若无知’。心经最后结论是‘无智亦无得’。得到根本智，然后应用于日常生活中，六根接触六尘境界，无所不知，见色闻声不迷。真心里无界限，无分别，无执著。因无隔碍接触任何境界都知道它的前因后果，因为心量是横遍十方，竖穷三际，此古时教学法之特色。</p>\n<p>　　了凡先生粗念没有了而还有细念。云谷禅师又教他念<a href=\"/fozhou/zhuntizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">准提咒</a>。古德说：‘念经不如念咒，念咒不如念佛。’六字洪名最易受持。如大势至菩萨在楞严会上所说：‘都摄六根，净念相继。’在初学时可用<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>记数，起初不妨定得少一点，慢慢增加，不怀疑，不夹杂，念到纯熟时，念而无念，无念而念，自有感应。纵有感应亦不必管它，一喜欢，心就不净。了凡接受云谷之教，认真修学。后来听到云谷说，功名可求，他又心动了。他原来的号叫学海，希望广学多闻，自从受教以后，又将学海改为了凡，取‘明了凡间事’之义。以前只知命运既经算定，无可奈何，似颇消极。用功以后神智清醒，变为积极。存心改过自新，断恶修善，念念中不敢得罪天地鬼神。用现代术语说，就是怕舆论的指责，若是作了亏心事，没有脸见人，颇有警惕之心。西方<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>的人，从下下品到上上品与阿弥陀佛的能力一样，都是天眼洞视，天耳彻听。我们天天想生极乐世界而仍然存坏心作坏事，岂不叫西方人看笑话。有人嗔恨我、毁谤我，以前不能忍受想报复。现在能忍受而且<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>忍受，因为道理明白了，有很大的转变。真心修行之后，孔先生所算的命运就不灵验。某年礼部考科举，孔先生算他该中第三名而了凡考第一名，<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>初步效果已验。但他言行方面缺点仍多，行善不够，救人不彻底，口仍有过，醉酒后仍乱心，过多于功。曾发愿行三千善事，行了十几年才圆满，设无坚固信心，勇猛精进，可能半途而废。后又发愿再作三千善事求子，命本无子，全家行善，四年三千善事圆满，即连生二子。然后再求中进士，许愿作一万件善事。他在河北省宝坻县作县长，每天行功过格，有一夜晚梦见一神仙，对神仙说：我许一万件善事，不易完成，颇为发愁。神仙说：只减粮一节，万行俱完。醒来之后，想想确有减粮一案，但仍然犹疑不决。恰好有一位幻余禅师由五台山来，了凡即将梦中之事请教禅师，请为印证。师告之曰：‘<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>真切，即一行可当万善，况全县减粮，万民受福乎！’他听后心安理得，又用自己的俸禄在五台山斋僧，打万僧斋，其中如有得道的高僧，受其供养，功德很大，对一般僧众亦因而结个善缘。孔先生算他五十三岁即无寿，他写此四训时在六十九岁。晚年命运完全改变过来。</p>\n<p>　　了凡有几句话很重要，他说：‘凡称祸福自己求之者，乃圣贤之言。若谓祸福惟天所命，则世俗之论矣。’又说：‘远思扬祖宗之德，近思盖父母之愆’。想到自己的祖先，要光大祖先之德。人非圣贤，熟能无过，如父母有过失，不可到处宣扬，属大不孝，应知有所愆盖。佛门也一样，远要发扬光大佛菩萨对一切众生教化之德，近对老师要尊重护持，老师尚未成佛，难免有过失，如宣扬老师的缺点，他教化此一地区必有障碍。学生对老师有几分恭敬就得几分利益，有恭敬才能依教专行。若常说老师坏话，不但使人瞧不起你的老师，也瞧不起你这个学生。更有甚者，许多学生退失道心，这个<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>可负不起呀。此种愚人到处都有，我到各地讲经，也有道友讲其道场及法师的是非。我的态度对任何道场与法师只有赞叹，使大家生欢喜心。只要这位法师说的是正法，即应护持。至于其私人生活方面有点小缺陷，对大家修学并无妨碍，何必多加责难。如有不如法者，不赞叹而已，不必谈其过失，更重要的不与众生结冤仇。君子绝交，不言人过。</p>\n<p>　　‘上思报国之恩，下思造家之福。’应常常怀念在心。‘外思济人之急，内思闲己之邪。’闲是防范之意，防非止恶。每天要反醒自己的过失，一天认为没有过失，这一天就空过了。只有佛没有过失，连菩萨都还有一品生相无明未断。改过是真正修行，不觉悟如何能改，一定发大勇猛心。一般人知道自己的过失，但是没有勇气改，因循苟且过日子。在学业上在道业上不能发掘自己的过失，如听到旁人说自己的过失，聪明人感激之不暇，一定以恭敬欢喜心欣然接受，有则改之，无则加勉，切勿与人辨驳。历代帝王中唐太宗确有过人之处，有人说太宗的过失，其实是误会而非太宗之过，太宗并不以为侮，而且还嘉奖他。太宗说：如果我处分他，以后没人敢说我的过失了。</p>\n<p>　　在第一篇里我们明白命运究竟是怎么一回事，事实真相搞清楚后就要谈到如何改过积善，以转变命运。了凡先生引用古代典籍春秋国语里所载，说明一个人在吉凶祸福将要来临时，事先必有预兆。古时候有，现在也一样。只要冷静观察都可看到。大体上说，心地厚道会有福报，刻薄寡恩者，纵然眼前得意，难保一生不遭灾难。福之将至，由其善心善行可以预知。灾难来时亦能预先看出，其心不善，其行不善，必有灾祸发生。明白此理，若想常享幸福，远离灾祸，必须改过积善。改过是因，远离灾祸是果，积善是因，幸福是果。如在一生中不能安身立命，这一生就白过了。佛法的基础建立在因缘果报上。了凡四训等于观经三福之第一项‘<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母，奉事师长，慈心不杀，修十善业’之详细说明。观经三福佛讲的明白切要，在结论中说，此三条是‘三世诸佛净业正因’。一切修行成佛之人，非一个法门，各各法门均可<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>无上佛道。法门虽多，但均建立在三福的基础上。李老师说过，念佛人多，能生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>者不过万分之三五，其原因是三福的基础未能打好，心行习气毛病不能革除为其主因。</p>\n<p>　　说到改过，了凡先生提到三点，第一点发耻心。古人说知耻近乎勇，知道自己不如人，必须发奋努力迎头赶上。诸佛在<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>前与我们一样，同是凡夫，他们今天成佛，我们仍搞六道轮回，此是事实。今天闻到佛法，能发一念欢喜之心，皆是过去生中种的善根，决非偶然。真正<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>求生极乐世界者，其善根决定超过<a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>中所说的阿阇王子。因阿阇王子曾经亲近并供养过四百亿佛，而听到佛说无量寿经尚未下定决心往生净土。可知我们学佛不只这一生，过去生生世世无量劫都在修，修到今天，人家成佛，我们还搞生死轮回，觉得惭愧可耻极了。如能常常反醒，自然勇猛精进，真正回头。</p>\n<p>　　第二要发畏心，即敬畏之意。骗人容易，骗自己也容易，骗天地鬼神可不容易。大多数鬼神都有五通，其能力大小不同。鬼神有他心通，我们心里想什么，他都知道，因为一想心里就有一个相，鬼神就能看见。无量寿经中说的最详细，凡往生西方者，从上上品到下下品，其<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>能力几乎与阿弥陀佛相同，鬼神都不能比。有人怀疑，我们一身<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>，何以有如此能力？其能力之来源有二：一为报得，鬼神的神通亦为报得。二为阿弥陀佛本愿威神之加持。我们很小声说话，怕人听到，西方人早已听到，起心动念无法瞒过西方人。</p>\n<p>　　耻心是惭愧，知道对不起自己。畏心是惟恐对不起人。了凡先生说：‘古人有一生作恶，临死悔悟，发一善念，遂得善终者。谓一念猛厉，足以涤百年之恶也。’这话当真。观经中之阿阇世王受提婆达多之教唆，行五逆十恶之事，<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>真正<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>，念佛求生净土，结果真生到极乐世界。佛说他的品位是上品中生。造五逆十恶尚能生到如此高的品位，一因其一心念佛求生净土。一因其临终忏悔出于至诚。善导大师说：上三品是发大乘心念佛者，发<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心，一心专念。中三品是世间修善之人。下三品是造恶之人。<a href=\"/remen/nianfofamen.html\" class=\"keylink\" target=\"_blank\">念佛法门</a>确是<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>普被，利钝全收。忏悔心真，忏悔力大，一回头即证得很高的品位。</p>\n<p>　　第三要发勇心。人皆有惭愧心，因无勇气不能改过，只是因循，把时光空过，道业不能成就，非常可惜。在修行中一般通病即昏沉与掉举。一用功即打瞌睡，念佛堂在止静时常有睡觉者。掉举与昏沉恰好相反，心里七上八下，一想用功，妄念特别多，其实妄念本来就多，平常不觉得而已。佛在世时，<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>阿冕楼驮(即阿那律)尊者听佛讲经时打瞌睡，佛呵斥他说：‘好睡像蚌蛤一类，一睡一千年，不知佛名字。’他听了非常惭愧，发奋修行，七昼夜不眠，用功过猛，把眼睛搞瞎。佛教他修见光明的禅定，结果他得到天眼通，在十大弟子中天眼第一。</p>\n<p>　　改过一事了凡举出三项法则：第一从事上改，第二从理上改，第三从心上改。事是事项，日常生活方面，属<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒。初学看到<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>觉得太难，不易做到。一出家先受<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>戒，有十条戒，二十四条威仪戒。几乎一举一动都犯错，深觉难持。其实佛家所讲律仪比儒家少得多，儒家讲威仪三千，佛法无如此之多。现代人放逸惯了，忽加以限制，处处觉得不自在。所以小乘比大乘难，小乘由事上改，大乘由理上改，最上乘者由心上改。改过积善，近可避免一切灾祸，远则培养修行<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>之基。</p>\n<p>　　易云：‘积善之家，必有余庆。’了凡举了十个人，行业不同，出身不同，皆是积善修德，得到好报。至于善恶的标准，他又说：‘善有真有假，有端有曲，有阴有阳，有是有非，有偏有正，有半有满，有大有小，有难有易，皆当深辨。为善而不穷理，则自谓行持，岂知造孽，枉费苦心，无益也。’这是人天福报的标准，依此标准而行，必可改造命运，不受命运之束缚。再以此基础念佛求生净土，万修万人去，一个也不会漏掉。他又引述中峰和尚之言曰：‘凡情未涤，正眼未开，认善为恶，指恶为善，往往有之。’凡是我们言语思想造作有益于人者均谓之善，凡有益于己者皆恶。在佛法中也是一般的标准，利大众者为功德，利自己者为私欲。凡利己者只有增长我执，我执是烦恼之本，烦恼不断不能超越六道轮回。利益社会大众者，自己也有一份，因我亦大众之一，只求自利者，反而为自己造了许多成佛的障碍。修善而暗中谋利养者乃是假善。端是正直，纯为济世之心，无丝毫所求。曲是委曲，行善而附带条件。又如爱人之心，敬人之心，要由真心中发出。阴阳之分，如政府表扬者为阳善，无人知晓，更无须乎标榜为阴善，亦称为阴德。是非与利害往往连在一起，很难辨别。有的善会产生副作用，有些事当时看不出来，而日后对社会发生很大的影响。</p>\n<p>　　从前僧人出家须经政府考试及格才发给戒牒，准其出家，限制极严，故出家人的水准很高。自从满清顺治皇帚把僧人考试制度废除之后，任何人均可出家，不识字的、不得意的，均可薙染。现在佛学院的学员有高中毕业者，也有小学未毕业者，均在一班上课。天主教基督教的神父牧师均须受神学院之训练，才有资格作传教人，比较起来，佛教亦应有所改进。有人好心作了坏事，乃正中有偏。有人恶心而作了好事，乃偏中有正。其中错综复杂，宜谨慎从事，免受冤责。</p>\n<p>　　中国古时教学有两门功课很重要，即经与史。经是学向，明理。史是见识，知历代个人成功失败之教训，国家兴亡之明鉴。目前人文学科的学生毕业找不到工作，经史已不被重视，所以伦理道德乃逐渐式微，此今日之实况，若欲研究经史，只可尽其在我而已。</p>\n<p>　　易曰：‘善不积不足以成名，恶不积不足以灭身。’成名不在当时，孔孟之成名均在后代，所积的是阴善。心要真诚，善即圆满，否则为半，故善有半满之说。尽心而力不逮，有障碍，缺缘份，仍属圆满。尽力不尽心，则属于半。吕祖的故事殊令人觉悟。钟离授吕祖点铁成金之术，谓可以济世。吕祖得知铁变金五百年后仍复本质，吕祖说：这样岂不害了五百年后的人，我不学了。钟离说：修仙要积三千功行，你这一念心三千功行已满。所以说最上乘者修心。</p>\n<p>　　作善事心若真诚就能圆满，与大乘经论中所讲慈悲心遍满法界的理论同。善又有大小之说，了凡先生举卫仲达的公案为例。卫被鬼抓去，见到阎罗王，审判时要调查他所作的善恶业多寡，叫小鬼把他一生所作善恶业案卷在天秤上秤一秤，结果恶业案卷多，重量轻，善业只有一卷，反而很重。调查后才知这件善事是他写了一个条陈，建议皇上不要兴办一件不必要的大工程，以免劳民伤财。他记得有这件事，但皇帝并未听他的话，仍把这工程作了。他对阎王说：皇上未采纳我的意见，有何功德可言？阎王说：你这一念悲心已在万民，假使听了，你的功德更大了。此件公案现代人听了，大概不会相信，常有人说：现在人类已登陆月球，仍然说些荒诞不经的话，岂不可笑。说实在的，阴间是真有。我初学佛时，常与朱镜宙老居士相往来，他是民初朴学大师章太炎先生之女婿。朱居士对我说：他老岳丈在世时曾作过东岳大帝之判官，地位相当于秘书长。他白天工作，晚间还要到阴间上班，常与鬼道友人往来，朱居士也听了许多阴间事情，证明阴间确实真有。</p>\n<p>　　儒佛二家都教我们断恶修善，由难行能行处下手。大乘经说，菩萨舍身为他之事甚多，如释迦佛舍身饲虎，割肉喂鹰，一般人听了，可以说这种事不近人情。如不深入<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>，不明其真理所在，就不会相信。真理不是一般人所能了解。发大慈悲心，以一念真诚，大地都会震动，依报随著正报转，此心一发，感应不可思议。他举一个例，江苏舒翁，一位私塾老师，舍二年仅得之束修，代偿官银而全人夫妇。又举一例，邯郸张翁，舍十年所积之钱代完赎银，而活人妻子。这都是难舍能舍之例。为什么能作到，因为有大慈悲心作发动力，儒家谓之‘恻隐之心’。</p>\n<p>　　了凡先生又提到<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>济众之事甚多，略举十项。他先说与人为善，举古代圣王大舜，帝舜在中国历史上是一位圣人，给后世最大的启示是<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>父母，感动一家，作社会大众最好的模范。帝尧知道有这样一位孝子即找他来让与王位，这是最崇高的与人为善的典型。今值乱世，无论何处均有苦难，此乃共业之感，共业中亦有别业，如能断恶修善，亦可幸免灾难。自己过失应认真悔改，看他人有长处，善心善行，应帮助他成全他。</p>\n<p>　　爱敬存心。圣贤存心，端在爱人敬人。普贤菩萨十大愿王第一条是礼敬诸佛。诸佛包括过去现在未来诸佛。敬人是恭敬爱护人，敬事是认真负责作事，敬物是对一切物件放置整齐，保持干净。</p>\n<p>　　成人之美。成就他人之长处或善行，尽心尽力帮助他成全他。俗话说：‘善事常易败，善人常得谤’。又说‘好事多磨’。善人的心都是正直的，不会委曲婉转，谄媚奉承。因而在社会上虽免受人嫉妒陷害。遇此情形，应主持公道，以维护之。</p>\n<p>　　劝人为善。古时只有两种方式，‘一时劝人以口，百世劝人以书’。现在科技发达，有录音带、录影机，弘法的范围比以前更具效果。了凡先生写四训，在当时不过教训其子，假如不写出，其利益仅及于一家。他自己也没有想到这本书普遍流通于后世。民国初年印光大师为社会一般大众所尊重，他一生倡印了凡四训，安士全书、历史感应篇等劝善书籍，使人了解因果<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>，六道轮回，劝人老实念佛，求生净土，决不谈玄说妙。我们能知道有这本书，也是由大师在民初倡印流传下来的版本，今日读之，亦应感谢大师之恩德。一九七七年我到香港，住在倓虚老法师的道场中华佛教图书馆，长达四个月讲<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>，有机会看到印祖弘化社所印的经书甚多。印祖是陕西人，有浓重的乡音，一般人不易听懂，所以他皆用文字弘法，所收供养均用之于弘法利生以及印送经书善书之事。弘化社所印版本最好，字大，美观大方，校对精确，很少有错。我看到的了凡四训已是第二十版，每版所印数量异常庞大，有一万册、二万册、甚至五万册，连同安士全书、历史感应篇，约略估计至少有三百万册。他曾在上海护国息灾法会讲了八天开示，其讲词印有小册子流通。册内曾经提到当时北方有旱灾，他听到之后，马上叫人由印经款内拨三千元现洋赈灾。侍者对他说：这笔钱汇出以后我们银行存款只剩一百元。他听了也不管，仍叫人马上汇去。他已作到难行能行。</p>\n<p>　　救人危急。我们有急难时希望旁人助我一臂之力，人同此心，心同此理。人家有灾难，我们也应当救人之急。任何人不能保证一生不遭灾难。要想得善果，必须修善因。尤其照顾老人最为切要，除非短命，人都有老的时候。对自己年老的父母公婆，务必要尽心尽力照料其生活，绝不可嫌弃，否则等你年老时，儿女们都会跑得远远的，这并不是<a href=\"/remen/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>而是很现实的。</p>\n<p>　　兴建大利。中国五千年来不被瓜分，亦未灭亡，实因两千五百年前接受儒家伦理道德教育，与佛家大乘佛法，知道孝亲尊师，维护伦常。今天提倡<a href=\"/remen/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>应列为第一优先，它能利益整个国家民族。早年政府提倡恢复中国固有文化时，我提出建立百姓祠堂，有许多人响应，也有人赞叹，但是后来事情发展未如理想。不过我们已在佛堂中另外辟出一部份作为祖先堂。师道是建立在孝道基础上。孝亲尊师没有了，要想天下不乱乃不可能。我对于建祠堂始终念念不忘。我的老师<a href=\"/fjrw/jsrw/lbn/\" class=\"keylink\" target=\"_blank\">李炳南</a>先生山东济南人，我与台中同学商量，打算在济南盖一个李炳南先生纪念堂。我们这些学生可以每年轮流回济南讲几天经，以报老师之恩。</p>\n<p>　　舍财作福。大乘菩萨修行，归纳为六度，六度中第一个是布施，其余五度皆可以纳入布施之内。布施分财、法、无畏三种，持戒、忍辱属无畏施，精进、禅定、般若属法施。布施就是舍，四摄六度均以布施为首。将无始劫来的贪嗔痴三毒烦恼先舍掉，恢复本来的清净心，智慧光明自然显出。古往今来有智慧福德之人无不认真修学，恢复自性。禅宗明心见性，念佛人讲一心不乱，从布施下手即能达到目的。</p>\n<p>　　护持正法。首须依教奉行，如自己不修行而劝人修行是假的，自己作出成绩给人看，人家才信服。大乘法要作师，受<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>之后，一举一动，作众生之表率，社会的典型。尽力弘扬正法，使众生有得度的机缘，乃真护持。弘法利生，道场非常重要。从前寺院庵堂是弘法的场所，千百年来逐渐变质，已不能代表正法，我在认识佛教小册子中已有详细说明。要想发扬光大，必须把佛教恢复其本来面目，回归到佛对九法界众生至善圆满的教育。佛四十九年所说一切经是说明宇宙人生之真相，可见佛教与我们有切身之关系，不能不学。</p>\n<p>　　敬重尊长即三福中‘孝养父母，奉事师长’。爱惜物命即三福中之‘慈心不杀’。最后一章谦德之效是全篇之总结，说明谦德最为吉祥。易经在六十四卦中，每卦有六爻，各有吉凶，惟有谦卦，六爻皆吉。谦卦的卦象，上面是地，下面是山。山应在上而在地下，表示谦虚之象。又引书经之文：‘满招损，谦受益。’了凡先生为人，精明细心，以前喜欢挖苦人，找人的缺点，学佛以后改变作风，专看人家长处。他观察人，凡谦虚者，其后来果报必然殊胜。他说：‘予屡同诸公应试，每见寒士将达，必有一段谦光可掬。’从前应试就是赶考。县考秀才，省考举人，殿试考进士。读书人经过三次考试，常常看到特别谦虚之人往往高中。他举几个很明显的例子，第一个是丁敬宇宾。丁宾是名字，敬宇是号，字礼原，嘉善人，隆庆进士。丁宾参加应试，了凡看到即对旁人说：这位青年今年一定考中。问何以知之？他说：‘有恭敬顺承，小心谦畏，闻谤不辩，如敬宇者乎？’及开榜，丁果中式。古时名字是父母起的，如改名为大不孝。在童子时，大家均可称其名，二十岁成年行冠礼之后，其名只有父母可叫，祖父母均不能叫。满二十岁时，其同辈送他一个字，除父母外均称其字。将来作大官，皇帝召见，亦称其字而不称名。称名除父母外，老师可以称其名，古时老师的地位与父母同。如在社会上有了声望，不称其字而送一个号。最极恭敬时连号都不称，而称其地名，如李鸿章称为李合肥。若是出家人称其寺院名称，如智者大师称天台大师，窥基大师称慈恩大师。</p>\n<p>　　过去社会对功名非常重视，如非高官有实权者，想兴大利护持正法很难，自己作不了主，悉听命于人。如编纂四库全书是一大工程，<a href=\"/ctwh/shi/lsrwzj/qianlong.html\" class=\"keylink\" target=\"_blank\">乾隆皇帝</a>有权，一句话，千百学者替他服务。今天社会改变，不作大官亦能作大事，我们可以作社会福利事业，特别关于文理教育大善大利之事，民间都可以办。</p>\n<p>　　此次讲了凡四训，只是简单扼要说其大概，希望大家重视这本小册子，奠定修学的基础，如欲详细研究，我们在大专<a href=\"/remen/jiangzuo.html\" class=\"keylink\" target=\"_blank\">讲座</a>有一套全文的录音带，可以借用参考。谢谢大家。</p>\n<p>　　一九九四年二月二十八日记于西雅图市时年八十八</p>\n</div>",
        "author": "袁黄"
    },
    {
        "title": "善与恶之际——《了凡四训》的启示",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n<p>　　善与恶之际——《<a href=\"/ctwh/jing/mxjd/lfsx.html\" class=\"keylink\" target=\"_blank\">了凡四训</a>》的启示</p>\n<p>　　流风</p>\n<p>　　<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>的分辨是<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>中的大事，做事说话都应该遵<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>的原则。中国自古以来就称为礼仪之邦，特重<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a><a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。有如此优秀的文化传统，自然有很强的善恶<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。不过在实际<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>中这样的道德善恶意识都是与生活习惯和风俗结合在一起的，它最明显的、最强烈的特征是道德准则，而不是道德原则，一字之差便有了天壤之别。</p>\n<p>　　道德准则教导我们如何去做，教导我们做什么、不做什么，怎样做才算是好的、善的，它以一种既定的形式展现出来，符合道德准则的言行便是善，而违反道德准则的就是恶。如此，善恶分明，一目了然。不过这样做存在着一种危险，即我们失去了分辨善恶是非的能力，把判断的能力交给了别人，把行为等同于善恶本身。这就是为什么在我们社会中长久以来都存在着“脸谱化”的思维方式，犹如戏台上红脸关公、黑脸包公、白脸曹操等，忠奸分明，善恶明确。然而事实真是如此简单吗?</p>\n<p>　　道德准则只是告诉我们怎样才是善的，却没有讲明善是什么。所以，如果我们追问善是什么?道德准则无法回答。最后还是要回到道德原则上来说明善本身，只有明了了善本身，才能真正明白善恶的分别。</p>\n<p>　　《了凡四训》中讲： “为善而不穷理，则自谓行持，岂知造孽，枉费苦心，无益也”，实为至理。</p>\n<p>　　袁了凡<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>对佛学有很好的<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，他把毕生的体会凝为四篇文章，简单扼要的阐明了如何分别善恶、如何立身处事，这就是我们今天所能看到的《了凡四训》。</p>\n<p>　　《了凡四训》包含的内容非常丰富，本文仅就它的善业思想作一些分析，探讨一下日常生活中的处事、修行问题。</p>\n<p>　　于<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>义理当身而言，佛教不怎么讲善恶的问题，而是重点在染与净上。因为<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>执著，终日里颠倒<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>，心不清净，我见执著于我，遇法执著于法，便把自己定死在<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>与法执上，不得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>，如此不免犯种种过。故佛教多讲<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>智，以般若化我、法二执，去除众生杂染，心净则不贪、不恨、不私，无为、清净、<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>，如此便“念头不动”。此不动非如死人之不起念头，而是破除执著之后无染清净，</p>\n<p>　　“无所住而生起心”，如此便成就“至善”。之所以用“至善”一词，就是为了区别一般意义上执的、仅符合道德准则的行为。</p>\n<p>　　袁了凡居士对善作了种种分析，</p>\n<p>　　目的就是区别于一般意义上的善的表现形态——善相，从而明了善之体——善之当身、善之之所从来。善相不可过分依赖，因为它可能是沽名钓誉、收买人心：也可能是为求人天<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>、为求好名：也可能是不计回报的真正的善行。</p>\n<p>　　《孟子》中一段话，可为明证：</p>\n<p>　　“今人乍见孺子将入于井，皆有怵惕恻隐之心。非所以内交于孺子之父母也，非所以要誉于乡党朋友也，非恶其声而然也。”看到小孩子将要掉入井中，心中不忍，便要想着救他，这种不忍心不是因为和小孩子的父母私交好，也不是因为要求得一个救人的美名，也不是因为不愿意听到小孩子的惨叫，只是心中不忍自然而发。救小孩子这一善行可以有多种原因，但真正的善行却是自然而出、无所计较的。</p>\n<p>　　1、真假</p>\n<p>　　中峰大师的话可谓是字字珠矶：</p>\n<p>　　“有益于人，则殴人，詈人皆善也；有益于己，则敬人，礼人皆恶也。是故人之行善，利人者公，公则为真；利己者私，私则为假。又根心者真，袭迹者假；又无为而为者真，有为而为者假”。真与假的区别一是内容与形式上的善，二是有无所求的善与有所求的善。</p>\n<p>　　所谓形式与内容之别，真善不一定会遵循善的形式，也就是说不一定会呈现出一种善相，正如金刚怒目，虽现恶相，而能镇摄人之恶念；忠言逆耳，但忠言不因其逆耳就不是忠言了。内容的善才是真正的善，不能仅看外在的表现形式。在一般情况下，人们很容易流入形式的漩涡，如<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>以多为胜，殊不知法重在<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>，于心地用功。</p>\n<p>　　所谓有为、无为之别，有为之行善会贪求福报、名声等，而真善不会计较个人利益、而且行善在心里是平常事，不求别人<a href=\"/remen/ganen.html\" class=\"keylink\" target=\"_blank\">感恩</a>戴德，只是<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>而行，如雁过长空。</p>\n<p>　　《八大人觉经》中讲“菩萨<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>，等念怨亲”，佛菩萨是<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>大慈、同体大悲，不住相布施，于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>平等一味，是真无为无漏之善。</p>\n<p>　　2、端曲</p>\n<p>　　“端曲”即是直心与利心之别。端者直也， 《<a href=\"/fojing/weimojiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">维摩诘经</a>》言“直心是菩萨<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>”、“直心是道场”，直心者，谓质直无谄，诚实无伪，此心乃是万行之本。了凡居士于此甚明：</p>\n<p>　　“凡欲积善，决不可徇耳目，惟从心源隐微处，默默洗涤”，真善要从心而发，有一毫人欲私心而能当下猛然警觉也不失为端正，若有一丝一毫媚世、愤世、玩世之心皆为曲。正善是不以任何条件为原因的，善只是它自身，就是这一颗纯洁的赤诚之心。理易明，而行难达，但若能终日于心灵隐微处时时体察，一定能达到高超的境界。</p>\n<p>　　3、阴阳</p>\n<p>　　“凡为善而人知之，则为阳善：为善而人不知，则为阴德。”被人知道的称为阳善，不为人知的称为阴德，阴德天报之，阳善享世名。行善自然会有好报，无论阴报、阳报、现报、后报，但这是从结果上说。从行善者的心理来说，不能在行善之初就预期这些结果，因为一旦为好报而行善则已经是有为的善，是媚俗的行为，虽然可以帮助很多人，但还是下乘。</p>\n<p>　　4、是非</p>\n<p>　　了凡先生举孔子之徒为例，子贡做好事而不要别人的谢礼，结果被孔子教训了一顿：子路救人而接受了别人的谢礼，结果被孔子表扬。乍看之下，此事很不容易理解，因为真善本不为求名求利，何以孔子如此对待子贡?只因善要与人为善。善不能仅停留在自己的内心与行为上，更应该引导他人发<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>、行善事，正如佛、菩萨大慈大悲，不舍众生，要度一切众生而<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。为利初机而行方便法门，以名、利引之使之向善，而后更悉心教导使之由小善、有为善而迈向大善、无为善。</p>\n<p>　　“乃知人之为善，不论现行而论流弊：不论一时而论久远；不论一身而论天下。”善不可以一时一地而论，更不可简单地加以评判。</p>\n<p>　　5、偏正</p>\n<p>　　常理以善者为正，恶者为偏，但若不拘于定然之势，则又有以善心而行恶事者，是为正中偏：又有以恶心而行善事者，是为偏中正。善心而行恶事，莫过于当今的<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>教育，对孩子过分的溺爱，虽深爱之而终深害之；恶心而行善事者，莫过于受刑罚者，以其恶果而警世人。</p>\n<p>　　6、半满</p>\n<p>　　此半满不以多少论，只以心之真诚而论，犹如真金无论轻重，不妨碍其为纯金。俗语有言：</p>\n<p>　　“百善孝为先，原心不原迹，原迹家贫无孝子”，真情尚且不可以金钱物质多少而论，更何况真心行善，<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>不可思议。须知行善当行无为善，了凡居士所谓“为善而心不著善，则随所成就，皆得<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。心著於善，虽终身勤励，止於半善而已”，行无为之善，则真正坦坦荡荡，无所行之我、无所施之人、无所施之物，因为对于行善无所执著，是真行善。</p>\n<p>　　《<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>》言“菩萨不住相布施”，虽度尽众生而无可度者，此善不可思议，功德无量无边。</p>\n<p>　　7、大小</p>\n<p>　　“志在天下国家，则善虽少而大：苟在一身，虽多亦小”，佛教常言救人一命胜造七级<a href=\"/remen/futu.html\" class=\"keylink\" target=\"_blank\">浮屠</a>，更不用说心怀天下，一念善便已与天下人结善缘。如果善仅停留在自身，还不能算作真明“善”理之人，真明善之人自会推己及人，如佛菩萨之慈悲心，大爱无边。破除拙著才能行大善，而且行善布施等正是破除我执、发大心、行大愿的良好时机。</p>\n<p>　　8、难易</p>\n<p>　　“克己须从难克处克将去”，只因众生执著，<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障重，无明贪爱、嗔、痴，</p>\n<p>　　自己给自己下了解脱不开的束缚，枉受诸苦。故佛教导人要痛下心，发大愿，誓要从心头痛下功夫，于事事、时时磨练，破我法二执。《<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>》有偈言：</p>\n<p>　　“将此身心奉尘刹”，这可谓是至难行之善，若真能破我法二执，舍却众缘、执与不执，终日虽行善而如无事之无为自在，是真行善之人，到此境界也无难易之别。</p>\n<p>　　以此八条，可概括一切行善法则，若以一言以尽之，则曰无执。于人而言，我执、法执深重，不免充满杂染，<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>的灵性隐而不发，枉受<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>与世间诸苦。岂不闻《金刚经》言：</p>\n<p>　　“一切有为法，如梦幻泡影，如露亦如电，应作如是观”，世间万物本是迁流不息、缘起性空，故<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>语重心切地教导：“凡所有相，皆是虚妄，若见诸相非相，即见如来”，不要被外在的现象和内存的心相所迷惑。</p>\n<p>　　心不明而有所执，则不免行善而不能尽善尽美，行善当行无为之善，超越善恶的表相，正如人不可貌相，海水不可斗量，心量广大，犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无尽，自然得正行、正果。孔子在《<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>》中讲“爱之欲其生，恶之欲其死”实在是人之一大错误，一大迷惑，所以菩萨布施能够等念怨亲，实在伟大，是我们立身处事的榜样。</p>\n<p>　　所以“至善”之精髓，便是无为无执，正是《金刚经》所示：</p>\n<p>　　“应无所住而生起心”，不染于善相、不染于恶相，超越善恶的对立状态，这才是清净无为，终日行善而如无事之人，所以菩萨布施，其功德不可思议，若我们能在生活中时时处处警醒自己、于事事物物上磨练自己，定也如菩萨一样，功德<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>不可思议。</p>\n<p>　　摘自《寒山寺》佛教双月刊</p>\n</div>",
        "author": "袁黄"
    },
    {
        "title": "《了凡四训》读后感",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n<p>　　◎邹相</p>\n<p>　　研读过《<a href=\"/ctwh/jing/mxjd/lfsx.html\" class=\"keylink\" target=\"_blank\">了凡四训</a>》的朋友们都很清楚，它本是明朝袁了凡先生所作的家训，以此来训诫他的儿子袁天启，认识<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>的真相，明辨<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>的标准，改过迁善。据史料记载，袁了凡先生与<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>渊源甚深，且与当时著名高僧云谷禅师交情颇深。他在没有遇到云谷禅师前，只知道认命，任凭命运的安排，非常消极被动。之后，在与云谷禅师的交往中，他逐渐<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>到“命运掌握在自己手中”这一道理，并根据“立命之学”自强不息，改造命运，并教导后人以正确的处世做人之道，积善积德，实现<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>的价值。</p>\n<p>　　《了凡四训》共分为四个部分：“立命之学”、“改过之法”、“积善之方”、“谦德之效”。虽然文章篇幅短小，但是寓理深刻，内涵丰富，兼融儒道佛三家思想，体现出中华传统文化的深邃与浑厚。这本书虽然不是<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>，但很多高僧大德却把它当作佛经一样尊重。如在民国初年，<a href=\"/fjrw/hcrw/ygds/\" class=\"keylink\" target=\"_blank\">印光大师</a>对这本书极力提倡，他的弘化社先后印送这本书达百万册以上。细细品读《了凡四训》，我有如下感想：</p>\n<p>　　一、命运掌握在自己手中，也能够被创造</p>\n<p>　　“命由我作，福自己求。”这是《了凡四训》中关于“立命之学”的直接诠释。何谓“立命”？即是指创造命运、改变命运，不为其所束缚、禁锢。我们的命运不是上天注定的，它始终掌握在我们的手中，我们才是命运的主人，命运是可以创造和改变的。了凡先生在少年时，遇到一位孔先生替他<a href=\"/remen/suanming.html\" class=\"keylink\" target=\"_blank\">算命</a>，算他一生的<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>到五十三岁，命中无子，当官的话可以做到县长。他每年拿国家多少待遇，考试第几名，都算得很准，了凡先生一对照，一点都没错，所以就深信不疑。既然一生的命都已定，所以心就定了，没有<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>人追求功名、<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，而了凡先生没有这个念头，因为他晓得命里没有的，求也求不到，所以干脆就不想了。</p>\n<p>　　后来，他和云谷禅师在禅堂里，坐了三天三夜，没有打一个妄想。禅师很佩服他，说道：“你的功夫了不起，一般人做不到。”他回答说：“我的命被人算定了，打妄想也没有用。”云谷禅师听了哈哈大笑说：“我以为你是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>，原来你还是个凡夫。”随后，云谷禅师的一番教导，使得他顿悟。于是，他立志改变自己的命运，不但考取了进士，而且还有了两个儿子，活到了74岁。</p>\n<p>　　现在呢，知识改变命运、机会改变命运的事情太多了，放牛郎能够成为政府高官，贫困户能成为百万富翁……这正如《了凡四训》所讲，“有志于功名者，必得功名；有志于富贵者，必得富贵。人之有志，如树之有根，立定此志，须念念谦虚，尘尘方便，自然感动天地，而造福由我”。</p>\n<p>　　二、人非圣贤，孰能无过，<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>去改，善莫大焉</p>\n<p>　　纵观古今中外历史，再伟大的人，再有声誉的人，也难免会犯错误。有些人，因为一点小错误，断送了性命；有的人，因为犯下错误，成为千古罪人。当然，并不是所有的错误都是致命的，绝大多的过错是能够避免或是改过的。那么，如何去改呢？《了凡四训》中提到“改过之法”，即：第一，要发耻心；第二，要发畏心；第三，须发勇心。“具是三心，则有过斯改，如春冰遇日，何患不消乎？然人之过，有从事上改者，有从理上改者，有从心上改者；工夫不同，效验亦异。”即是说，如果能发这三心，就能去除弊病，找回自我，重新做人。</p>\n<p>　　“何谓从心而改？过有千端，惟心所造；吾心不动，过安从生？学者于好色，好名，好货，好怒，种种诸过，不必逐类寻求；但当一心为善，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>现前，邪念自然污染不上。如太阳当空，魍魉潜消，此精一之真传也。过由心造，亦由心改，如斩毒树，直断其根，奚必枝枝而伐，叶叶而摘哉？”《了凡四训》与佛经有着相似之处，目的皆在“与人为善”、“护善念”。那么，又应如何“护善念”呢？这就需要平定你的心，去掉“贪嗔痴慢疑”这“五毒”，不被名利富贵等物欲所动心，将坚定的正念、正信坚持下去。</p>\n<p>　　只要一心一意地发<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>，做善事，正的念头出现在前，那么邪恶的念头，自然就污染不上我们的心灵。即便是有过错，有过失，只要发心发愿去用心改正，一样能回归自然，回归到我们最真实最善良的一面。</p>\n<p>　　三、虚心使人进步，谦虚是成功的助力器</p>\n<p>　　“满招损，谦受益”，这句训诫一直成为世人的座右铭。在《了凡四训》一书中，同样阐释了“谦虚”的重要性和必要性。“须使我存心制行，毫不得罪于天地鬼神，而虚心屈己，使天地鬼神，时时怜我，方有受福之基。彼气盈者，必非远器，纵发亦无受用。稍有识见之士，必不忍自狭其量，而自拒其福也，况谦则受教有地，而取善无穷，尤修业者所必不可少者也。”这是说，人若谦虚，神明相佑，人若骄满，神明相拒。</p>\n<p>　　如果说积善是自我的<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>，专注于自身的话，那么，谦虚则是在人际关系中不可或缺的重要态度。试想，一个不知道谦虚的人，是多么鲁莽和无知啊！“无知者<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>”，不知谦虚的人肯定能捅出大漏子，后悔莫及。《易经》谦卦上说：天的道理，不论什么，凡是骄傲自满的，就要使他亏损，而谦虚的就让他得到益处。地的道理，不论什么，凡是骄傲自满的，也要使他改变，不能让他永远满足；而谦虚的要使他滋润不枯，就像低的地方，流水经过，必定会充满了他的缺陷。鬼神的道理，凡是骄傲自满的，就要使他受害，谦虚的便使他受福。人的道理，都是厌恶骄傲自满的人，而喜欢谦虚的人。</p>\n<p>　　由此来看，不论是天、地、鬼、神，还是人，都应该注重谦虚的效用，不能熟视无睹，一味自满。因为谦虚，我们能放开心胸，接纳他人，赢得更多的机遇；因为谦虚，我们能反躬内省，及时发现弊病，极力改过，赢得新的<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>；因为谦虚，我们能营造良好的人际关系氛围，获得更多的青睐和赏识，助力于成功……</p>\n<p>　　纵览《了凡四训》一书，才发觉它不仅包括待人接物的技巧，也有安身立命的方法，还有应对人生、处理情感、<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>的策略，真不失为一本全面周到的佳作。相信各位朋友在反复品读《了凡四训》一书之后，定能走出生活与情感中的种种阴霾，并能发无上慈悲心，成为生活中的强者，成为自己命运的主宰，当一个通情达理的智者。</p>\n</div>",
        "author": "袁黄"
    }
]