[
    {
        "title": "寿康宝鉴原文",
        "date": "2014-10-22",
        "html": "<div class=\"B1_text\">\n<p style=\"text-align: center; text-transform: none; text-indent: 0px; font: 12px Arial, Verdana, sans-serif; white-space: normal; letter-spacing: normal; color: rgb(34,34,34); word-spacing: 0px; -webkit-text-stroke-width: 0px\"><img alt=\"&#x5BFF;&#x5EB7;&#x5B9D;&#x9274;&#x539F;&#x6587;\" src=\"https://www.liaotuo.com/uploadfile/uploads/allimg/140216/10-1402161K520.jpg\" style=\"cursor: default\" /></p>\n<p style=\"text-align: center\">寿康宝鉴原文</p>\n<p>　　<a href=\"/fjrw/hcrw/ygds/\" class=\"keylink\" target=\"_blank\">印光大师</a>增订</p>\n<p>　　寿康宝鉴前言与序言</p>\n<p>　　第一章 不可录重刻</p>\n<p>　　第二章 不可录敦伦理序</p>\n<p>　　第三章 <a href=\"/fjrw/jsrw/zas/100129.html\" class=\"keylink\" target=\"_blank\">欲海回狂</a>普劝<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a><a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>序</p>\n<p>　　第四章 训饬士子戒淫文</p>\n<p>　　第五章 戒淫圣训</p>\n<p>　　第六章 戒淫文</p>\n<p>　　第七章 戒淫格言</p>\n<p>　　第八章 邪淫十二害</p>\n<p>　　第九章 四觉观</p>\n<p>　　第十章 九想观</p>\n<p>　　第十一章 劝戒十则</p>\n<p>　　第十二章 戒之在色赋</p>\n<p>　　第十三章 福善案</p>\n<p>　　第十四章 祸淫案</p>\n<p>　　第十五章 悔过案</p>\n<p>　　第十六章 同善养生</p>\n<p>　　第十七章 发誓持戒</p>\n<p>　　第十八章 誓愿文式</p>\n<p>　　第十九章 保身立命戒期及天地人忌</p>\n<p>　　第二十章 保身广嗣要义</p>\n<p>　　第二十一章 辟自由结婚邪说交</p>\n<p>　　第二十二章 不可录纪验</p>\n<p>　　前言与寿康宝鉴序</p>\n<p>　　人从<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>而生。故其习偏浓，一不戒慎。多致由色欲而死。古圣王以爱民之故。即夫妇房事。不惜令人以木铎巡于道路。冀免误送性命之虞。其慈爱为何如也。及至后世。不但国家政令不复提及。即父母与儿女。亦不提及。以致大多数少年。误送性命。可哀孰甚。不慧阅世数旬。见闻颇多。不禁悲伤。因募印此书。冀诸同伦。咸获寿康。所愿得此书者。各各详阅。展转流通。勿令徒费心思钱财。而毫无实益。则幸甚幸甚。</p>\n<p>　　人未有不欲长寿康宁。子孙蕃衍。功业卓著。吉曜照临者。亦未有欲短折疾病。后嗣灭绝。家道倾颓。凶神莅止者。此举世人之常情。虽三尺孺子。莫不皆然。纵至愚之人。断无幸灾乐祸。厌福恶吉者。而好色贪淫之人。心之所期。与身之所行。适得其反。卒至所不欲者悉得。而所欲者悉莫由而得。可不哀哉。彼纵情花柳。唯此是图者。姑勿论。即夫妇之伦。若一贪湎。必致丧身殒命。亦有并不过贪。但由不知忌讳。冒昧从事。以致死亡者。殊堪怜憨。以故前贤辑不可录。备明色欲之害。其戒淫窒欲之格言。福善祸淫之证案。持戒之方法日期。忌讳之时处人事。不惮繁琐。缕析条陈。俾阅者知所警戒。其觉世救民之心.可谓恳切周挚矣。而印光复为增订。以名寿康宝鉴。复为募印广布者。盖以有痛于心而不容已也。一<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>罗济同。四川人。年四十六岁。业船商于上海。其性情颇忠厚。深信<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。与关絅之等合办净业社。民国十二三年。常欲来山归依。以事羁未果。十四年病膨胀数月。势极危险。中西医均无效。至八月十四。清理药帐。为数甚钜。遂<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>曰。我从此纵死。亦不再吃药矣。其妾乃于佛前恳祷。愿终身吃素<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>。以祈夫愈。即日下午病转机。大泻淤水。不药而愈。光于八月底来申。寓太平寺。九月初二。往净业社会关絅之。济同在焉。虽身体尚未大健。而气色淳净光华。无与等者。见光喜曰。师父来矣。当在申归依。不须上山也。择于初八。与其妾至太平寺。同受三归<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。又请程雪楼。关网之。丁桂樵。欧阳石芝。余峙莲。任心白等诸<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>。陪光吃饭。初十又请光至其家吃饭。且曰。师父即弟子等之父母。 弟子等即师父之儿女也。光曰。父母唯其疾之忧。汝病虽好。尚未复原。当慎重。惜未明言所慎重者。谓房事也。至月尽日。于<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>林开监狱<a href=\"/remen/ganhua.html\" class=\"keylink\" target=\"_blank\">感化</a>会。彼亦在会。众已散。有十余人留以吃饭。彼始来。与司帐者交代数语而去。其面貌直同死人。光知其犯房事所致。切悔当时只说父母唯其疾之忧。未曾说其所以然。以致复滨于危也。欲修书切戒。以冗繁未果。九月初六至山。即寄一信。极陈利害。然已无可救药。不数日即死。死时关絅之邀诸居士皆来念佛。其得<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>西方与否。未可知。当不至堕落耳。夫以数月大病。由<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>加被不药而愈。十余日闲。气色光华。远胜常人。由不知慎重。误犯房事而死。不但自戕其生。其孤负三宝之慈恩也甚矣。先闻讣。心为之痛。念世之不知忌讳冒昧从事。以致殒命者。其多无数。若不设法预为防护。殊失如来慈悲救苦之道。拟取不可录而增订之。排印广布。以期举世咸知忌讳。不致误送性命。一居士以母氏遗资千六百元。拟印善书施送。光令尽数印寿康宾鉴。以拯青年男女于未危。则以罗济同一人之死。令现在未来一切阅此书者。知所戒慎。并由展转流通。展转劝诫。庶可举世同享长寿康宁。而鳏寡孤独之苦况。日见其少。如是则由济同一人之死。令一切人各得寿康。济同之死。为有功德。仗此功德。<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>往生。当必俯谢娑婆。高登极乐。为弥陀之弟子。作海众之良朋矣。孟子曰。养心者莫善于寡欲。其为人也寡欲。虽有不存焉者寡矣。其为人也多欲。虽有存焉者寡矣。康健时尚宜节欲。况大病始愈乎。十年前一钜商之子。学西医于东洋。考第一。以坐电车。未驻而跳。跌断一臂。彼系此种医生。随即治好。凡伤骨者。必须百数十日不近女色。彼臂好未久。以母寿回国。夜与妇宿。次日即死。此子颇聪明。尚将医人。何至此种忌讳。懵然不知。以俄顷之欢乐。殒至重之性命。可哀孰甚。前年一商人。正走好运。先日生意。获六七百元。颇得意。次日由其妾处。往其妻处。其妻喜极。时值五月。天甚热。开电扇。备盆澡。取冰水加蜜令饮。唯知解热得凉。不知彼行房事。不可受凉。未三句钟。腹痛而死。是如世之由不知忌讳。冒昧从事。以至死亡者。初不知其有几千万亿也。而古今来福最大者。莫过皇帝。福大寿亦当大。试详考之。十有八九皆不寿。岂非以欲事多。兼以不知忌讳。以自促其寿乎。而世之大聪明人。每多不寿。其殆懵懂于此而致然乎。光常谓世人十分之中。四分由色欲而死四分虽不由色欲直接而死。因贪色欲亏损。受别种感触间接而死。其本乎命而死者。不过十分之一二而已。茫茫世界。芸芸人民。十有八九。由色欲死。可不哀哉。此光流通寿康宝鉴之所以也。愿世之爱儿女者。以及为同胞作幸福防祸患者。悉各<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>印送。展转流传。俾人各悉知忌讳。庶不至误送性命。及致得废疾而无所成就也。彼纵情花柳者。多由自无<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。被燕朋淫书所误。以致陷身于欲海之中。莫之能出。若肯详阅。则深知利害。其所关于祖宗父母之荣宠羞辱。与自己身家之死生成败。并及子孙之贤否灭昌。明若观火。倘天良尚未全昧。能不触目惊心。努力痛戒乎。将见从兹以后。各乐夫妇之天伦。不致贪欲损身。则齐眉偕老。既寿且康。而寡欲之人恒多子。而且其子必定体质强健。心志贞良。不但无自戕之过失。决可成荣亲之令器。此光之长时馨香以祷祝者。愿阅者共表同心。<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>流布。则人民幸甚。国家幸甚。</p>\n<p>　　民国十六年丁卯季春常惭愧僧释印光谨撰</p>\n<p>　　不可录重刻序</p>\n<p>　　女色之祸。极其酷烈自古至今。由兹亡国败家败身绝嗣者。何可胜数。即未至此。其闲颓其刚健之躯。昏清明之志。以顶天履地希圣希贤之姿。致成碌碌庸人。无所树立之辈者又复何限。况乎逆天理。乱人伦。生为衣冠禽兽。死堕三途恶道者。又何能悉知之而悉见之耶。噎。女色之祸一何酷烈至于此极也。由是诸圣诸贤。特垂悲愍。或告之以法言。或劝之以异语。直欲福善祸淫之理。举世咸知。而又征诸事实。以为法戒。企知自爱者见之。当必怖然惊。慢然悟。遏人欲于横流。复天良于将灭。从兹一切同伦。悉亨富寿康宁之福。永离贫病夭折之祸。此不可录所由辑也。张瑞曾居士。欲重刻印施。命余作序。畅演窒欲要义。须知美色当前。欲心炽盛。法言异语。<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>。皆难断其爱心。若能作不净观。则一腔欲火。当下冰消矣。吾秦长安子弟。多玩促织。有兄弟三人。年皆成童。于月夜。捉促织于坟墓闲。忽见一少妇。姿色绝伦。遂同往捉之。其妇变脸。七窍流血。舌佗尺余。三人同时吓死。次日。其家寻得。救活者一。方知其事。活者大病数月方愈。其家子孙。不许夜捉促织。夫此少妇。未变脸时。则爱入骨髓。非遂所欲则不可。及既变脸。则一吓至死。爱心使成乌有。然当其群相追逐时。固未始无血与舌也。何含而藏之。则生爱心。流而佗之。则生畏心。了此。则凡见一切天姿国色。皆当作七窍流血舌佗尺余之钓颈鬼想矣。又何至被色所迷。生不能尽其天年。死必至永堕恶道耶。以故如来令贪欲重者。作不净观。观之久久。则尚能断惑证具。超凡入圣。岂止不犯邪淫。窒欲卫生而已。其女貌娇美。令<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>爱心而行欲事者。不过外面一张薄皮。光华艳丽。为其所惑耳。若揭去此之薄皮。则不但皮里之物。不堪爱恋。即此薄皮。亦绝无可爱恋矣。再进而剖其身躯。则唯见脓血淋漓。骨肉纵横。脏腑屎尿。狼藉满地臭秽腥膻。不忍见闻。校前少妇所受之相其可畏惧厌恶。过百千倍。纵倾城倾国之绝世佳人。薄皮裹面之物。有一不如是乎。人何唯观其外相。而不察其内容。爱其少分之美。遂不计其多分之恶乎。余愿世人遗外相而察内容。厌多恶以弃少美。则同出欲海。共登觉岸矣。又当淫欲炽盛。不能自制之时。但将女阴作毒蛇口。以已阳纳蛇口中想。则心神惊悸。毛骨悚然。无边热恼。当下清凉矣。此文窒欲之简便法也。释印光撰</p>\n<p>　　不可录敦伦理序</p>\n<p>　　天为大父。地为大母。一切男女。皆天地之<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>。皆吾之同胞。既是同胞。当尽友爱。保护扶持。以期各得其所。如是。则为天地之肖子。无忝所生矣。既能保护扶持天地之子女。则天地必常保护扶持于其人。令其福深寿永。诸凡如意也。倘或肆意横行。欺凌天地之子女。则其折福减寿。灭门绝嗣。一气不来永堕恶道。经百千劫。莫复人身者。乃自取其祸。非天地之不慈也。余且勿论。即如妻女姊妹。人各共有。人若熟视己之妻女姊妹。己则愤心怒气。即欲殴击。何见人之妻女姊妹。稍有姿色。心即妄起淫念。意欲污辱乎哉。夫同为天地之子女。是吾同胞。若于同胞。起不<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。则是污辱天地之子女。欺侮同胞。其人尚得自立于天地之间。而犹谓之为人乎。况夫妇之道。与乎三纲五常。男女居室。人之大伦。人之所以异于禽兽者。以其有人伦也。人若行蔑理乱伦之事。则是以人身行禽兽事。身虽为人。实则禽兽不如也。何也。以禽兽不知伦理。人知伦理。知伦理而复蔑伦理。斯居禽兽之下矣。然一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。由淫欲生。故其习偏浓。须深提防。作亲。作怨。作不净想。庶可息灭邪念。而淳全正念矣。怨与不净。前序已明。兹特约亲。而为发挥。冀诸阅者。同敦天伦。毋怀恶念。<a href=\"/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>。示人见诸女云。想其老者如母。长者如姊。少者如妹。幼者如女。生度脱心。息灭恶念。梵网经云。一切男子是我父。一切女人是我母。我生生无不从之受生。当生<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>心。慈悲心。如是则尚保护扶持之不暇。何可以起恶劣心。而欲污辱乎。明有一生患淫。不能自制。问于王龙溪。龙溪曰。譬如有人。谓汝曰。此中有名妓。汝可拳帏就之。汝从其言。则汝母女姊妹也。汝此时一片淫心。还息否。曰。息矣。龙溪曰。然则淫本是空。汝自认做真耳。人果肯将一切女人。作母女姊妹视之。则不但淫欲恶念无由而生。而<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>轮迥。亦当由兹顿出矣。不可录一书。法语异言之训。福善祸淫之景。与夫戒忌之日期处所。一一毕示。其觉世醒迷之心。可谓诚且击矣。维扬张瑞曾居士。利人心切。即为刻行。命光发挥窒欲之要。因以怨。以不净。而叙其大旨。继因其堂兄正勋逝世。拟以此功德。荐其灵识。俾罪障消灭。福智崇朗。出五浊之欲界。生九品之莲邦。因居士孝友之情。故复撰敦伦之序。祈见闻者。各详察焉。则幸甚幸甚。释印光谨撰</p>\n<p>　　欲海回狂普劝受持流通序</p>\n<p>　　民国十六年释印光撰</p>\n<p>　　天下有极惨极烈。至大至深之祸。动辄丧身殒命。而人多乐于从事。以身殉之。虽死不悔者。其唯女色乎。彼狂徒纵情欲事。探花折柳。窃玉偷香。灭理乱伦。败家辱祖。恶名播于乡里。毒气遗于子孙。生不尽其天年。死永堕于恶道者。姑置勿论。即夫妇之伦。傥一沉湎。由兹而死者。何可胜数。本图快乐。卒致死亡。鳏寡苦况。实多自取。岂全属命应尔哉。彼呢情床第者。已属自取其殃。亦有素不狎呢。但以不知忌讳。冒昧从事。致遭死亡者。亦复甚多。故<a href=\"/ctwh/jing/13j/liji.html\" class=\"keylink\" target=\"_blank\">礼记</a>月令。有振铎布告。令戒容止之政。古圣王爱民之忱。可谓无微不至矣。吾常谓<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>人民。十分之中。由色欲直接而死者。有其四分。间接而死者。亦有四分。以由色欲亏损。受别种感触而死。此诸死者。无不推之于命。岂知贪色者之死。皆非其命。本乎命者。乃居心清贞。不贪欲事之人。彼贪色者。皆自戕其生。何可谓之为命乎。至若依命而生。命尽而死者。不过一二分耳。由是知天下多半皆枉死之人。此祸之烈。世无有二可不哀哉。可不畏哉。亦有不费一钱。不劳微力。而能成至高之<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>。享至大之安乐。遗子孙以无穷之福荫。俾来生得贞良之眷属者。其唯戒淫乎。夫妇正淫。前已略说利害。今且不论。至于邪淫之事。无廉无耻。极秽极恶。乃以人身。行畜生事。是以艳女来奔。妖姬献媚。君子视为莫大之祸殃而拒之。必致福曜照临。皇天眷佑。小人视为莫大之幸福而纳之。必致灾星莅止。鬼神诛戮。君子则因祸而得福。小人则因祸而加祸。故曰祸福无门。唯人自召。世人苟于女色关头。不能彻底看破。则是以至高之德行。至大之安乐。以及子孙无穷之福荫。来生贞良之眷属。断送于俄顷之欢娱也。哀哉。安士先生欲海回狂一书。分门别类。缕析条陈。以雅俗同观之笔。述劝诫俱挚之文。于古今不淫获福。犯淫致祸之事。原原委委。详悉备书。大声疾呼。不遗余力。暮鼓晨钟。发人深省。直欲使举世同伦咸享福乐。各尽天年而后已。须知其书。虽为戒淫而设。其义与道。则举凡经国治世。修身齐家。穷理尽性。了生脱死之法。悉皆圆具。若善为领会。神而明之。则左右逢源。触目是道。其忧世救民之心。可谓至深切矣。是以印光于民国七年。特刊安士全书板于扬州藏经院。八年又刻欲海回狂。万善先资。二种单行本。十年又募印缩小本安士全书。拟印数十万。偏布全国。但以人微德薄。无由感通。只得四万而已。而中华书局私印出售者。亦近二万。杭州汉口。俱皆仿排。所印之数。当亦不少。兹有江苏太仓吴紫翔居士。念世祸之目亟。彼新学派。提倡废伦废节。专主自由爱恋。如决江堤。任其横流。俾一班青年男女。同陷于无底欲海漩腹之中。遂发心广印欲海回狂。施送各社会。以期挽回狂澜。然众志成城。众擎易举。恳祈海内仁人君子。大发救世之心。量力印送。并劝有缘。普遍流通。又祈父诲其子。兄勉其弟。师诫其徒。友告其侣。俾得人人知其祸害。立志如山。守身如玉。不但不犯邪淫。即夫妇正淫。亦知撙节。将见鳏寡孤独。从兹日少。富寿康宁。人各悉得。身家由兹清吉。国界于以安宁。秽德转为懿德。灾殃变作祯祥。毕竟不贵一钱。不劳微力。而得此美满之效果。仁人君子。谅皆当仁不让而乐为之也。爰述大义。以贡同仁。</p>\n<p>　　附录  懿德堪钦 元秦昭。扬州人。弱冠游京师。已登舟矣。其友邓某。持酒送行。正饮闲。忽台一绝色女子至。邓令拜昭曰。此女系仆与某部某大人所买之妾。乘君之便。祈为带去。昭再三不肯。邓作色曰。君何如此其固执也。即不能自持。此女即归于君。不过二千五百绘钱耳。昭不得已许之。时天已热。蚊虫甚多。女苦无怅。昭令同寝己怅中。由内河经数十日至京。以女交店主娘。自持书访其人。因问君来曾带家眷否。昭曰。兄我一人。其人勃然愠现于面。然以邓某之书。勉令接女至家。至夜。方知女末破身。其人惭感不已。次日即驰书报邓。盛称昭德。随往拜昭。谓曰。阁下真盛德君子也。千古少有。昨日吾甚疑之。盖以小人之腹。测君子之心耳。惭感无既。</p>\n<p>　　［批］秦昭之心若非了无人欲。浑全天理。与此绝色女子。日同食。夜同寝。经数十日之久。能无情欲乎哉。秦昭固为盛德君子。此女亦属贞洁淑媛。懿德贞心。令人景仰。因附于此。用广流通。</p>\n<p>　　民国十六年丁卯。释印光识。</p>\n<p>　　寿康宝鉴</p>\n<p>　　训饬士子戒淫文</p>\n<p>　　文帝曰。天道祸淫。其报甚速。人之不畏。梦梦无知。苟行检之不修。即灾殃之立至。嗟尔有众。听予训言。惟惠迪吉。自古云然。不善降殃。昔人明戒。春秋之淫乱。皆败国而亡家。风雅之刺讥。尽鹑奔而鹊逐。故逆理乃自戕其性。而贪淫即自夺其名。人事一乖。天心尽怒。桂香上苑。非洁己者难邀。杏宴天恩。岂污名者可得。予莅文衡。尝垂教示。奈士子止贪半晌之欢。罔惜终身之计。淫人人淫。交手为市。业报惨酷。洗心者谁。吾于二八试闱。每多临时去取。一笔勾削。只缘窥彼邻妻。数字增加。端为拒兹室女。欲闻平地之雷。莫起寸心之火。终年潦倒。岂负学苦文高。一世迍邅。悉是瑜闲败节。士人不察于所由。反或怨天而恨地。植来黄甲。只在心田。衣尔紫袍。总由阴骘。棘闱满地皆神。文院三场有鬼。惜哉字字珠玑。忽遇灯煤落卷。怅矣篇篇锦绣。无端墨迹污文。此时予实主持。孰谓苍天无眼。榜发三元。为有惊神之德。莲开并蒂。旋闻坠蕊之凶。倘能持正而不邪。自尔名归而禄得。特颁新谕。咸使闻知。</p>\n<p>　　戒淫圣训</p>\n<p>　　文帝垂训曰。吾奉金阙至尊之命。于每月寅卯日。按行酆都<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。考定天下有罪人民事实。见夫黑籍如山。皆是世人一生孽案。其间作恶多端。惟淫恶之报。天律最严。人奸妻女。玷人闺门。在地狱中。受苦五百劫。方得脱生。为骡为马。又五百劫。乃复人身。为娼为优。设谋造计。奸宿寡妇尼僧。败人操履。在地狱中。受苦八百劫。方得脱生。为羊为豕。供人宰杀。又八百劫。乃复人身。为瞽为哑。以卑乱尊。以长乱幼。败坏纲常。在地狱中。受苦一千五百劫。方得脱生。为蛇为鼠。又一千五百劫。方得人身。或在母胎中死。或在孩抱中亡。毕竟不享天年。更有造作淫书。坏人心术。死入无闲地狱。直至其书灭尽。因其书而作恶者。罪报皆空。方得脱生。淫书之为害。不可胜数。常有名闺淑媛。识字知文。或绿总昼静。或青灯夜阑。展卷视之。魂摇魄荡。不禁欲火之焚。遽成奔窃之行。致节妇失节。贞女丧贞。更有聪明子弟。秀而有文。一见此书。遂起欲想。或手淫而不制。成目挑而苟从。小则欧丧元阳。少年夭折。大则渎乱伦纪。不齿士林。若夫巧作传奇。当场演出。教习狎童备示淫态。乱人清操。不可胜数。职其根由。皆淫书所致。奈何士子以夙世之慧根。握七寸之斑管。不思有功于世。积福于身。徒造无穷之孽。干上帝之怒。自蹈于冰渊火坑而不恤。深可悲也。</p>\n<p>　　戒淫文</p>\n<p>　　盖闻业海茫茫。难断无如色欲。尘寰扰扰。另犯惟有邪淫。拔山盖世之英雄。坐此亡身丧国。绣口锦心之才士。因兹败节堕名。今昔同揆。贤愚共辙。况乃嚣风日炽。古道沦亡。轻狂小子。固耽红粉之场。慧业文人。亦效青衫之湿。言窒欲而欲念愈滋。听戒淫而淫机倍旺。遇娇姿于道左。目注千翻。逢丽色于闺帘。肠回百折。总是心为形役。识被情牵。残容俗女偶然簪草簪花。随作西施之想。陋质村鬟。设或带香带麝。顿忘东妇之形。岂知天地难容。神人震怒。或毁他节行。而妻女酬偿。或污彼声名。而子孙受报。绝嗣之坟墓。无非轻薄狂生。妓女之祖宗。尽是贪花浪子。当富则玉楼削籍。应贵则金榜除名。笞杖徒流大辟。生遭五等之诛。地狱饿鬼畜生。没受三途之罪。从前恩爱。到此成空。昔日雄心。而今何在。普劝青年烈士。黄卷名流。发<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>之心。破色魔之障。芙蓉白面。须知带肉骷髅。美貌红妆。不过蒙衣漏厕。纵对如玉如花之貌。皆存若姊若母之心。未犯淫邪者。宜防失足。曾行恶事者。务即回头。更祈展转流通。迭相化导。必使在在齐归觉路。人人共出迷津。</p>\n<p>　　戒淫格言</p>\n<p>　　◎三丰张真人曰。人生天地间。禀五行之秀。具刚正之气。夫夫妇妇。人道之常。越礼乱伦。等诸禽兽。淫邪之行。志士所当力戒也。夫天下蠢然者莫如物。乃雎鸠定偶而不相乱。哀雁孤鸣而不成行。人不如鸟。负此人名。逊物之灵矣。奈此蚩蚩之氓。不解色即是空。同于幻泡犹羡红颜绿鬓。恩爱缠绵。岂知人同此心。反观皆可自悟。尔等于淫人妇女时。当即自思。设此时吾妇被人淫。枕畔戏笑。曲尽绸缪。吾介于其傍。见此种情形。当必心中如刺。眼内如火奋击追杀。刻不容缓。何至淫人妇女。忘却回想。遽尔牵帷。自鸣得意乎。此时天地鬼神。临之在上。质之在傍。其怨怒犹是。欲杀割犹是。有不嗔目切齿。谋为<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>者乎。灾祸之起。至不旋踵。兴言及此。能不寒心。又况舍身利剑。碎首邻街。台阳之梦未终。而泉台之扈已掩。青磷碧血。皆红粉之变为之。美人原是胭脂虎。岂不信哉。即不至此。而淫人妻者。强者鸣之当道。弱者隐恨终身。宗族含不解之羞。夫妇绝百年之好。死生莫测。变态多端。或阴图报复。或暗地伤惭。祖父本无大咎。附会者即猜为极恶。至若夫若子若孙。世玷清名。移人骨肉。乱我宗祠。纵身登仕籍。名誉彰闻。终必遗臭无穷。既不齿于人伦。亦永传为话柄。是杀人之惨毒。止及一身而无刃之锋铓。不啻杀人数世也。总之淫念根于好色。欲绝淫根。先严色戒。一好色即好淫。则己身不正。而对此柔姿媚骨。不能自制。必多为彼所制。由是徇私情。废孝友。父母兄弟。弃置不顾。舍此一好之外。懵然无知矣。由是妻妾子女。失所防闲。任其秽乱闺闱。默为报应。亦必懵然无知矣。且夫好淫者。子孙必至夭折。后嗣必不蕃昌。何则。我之子孙。我之精神种之。今以有限猜神.供无穷花柳.譬诸以斧伐木。脂液既竭.实必消脱。一己之精神。尚涣散而不积。又安望集于子身。则所生单弱。在所必然。至业已单弱。而父母之淫根不绝。禀气受形。大率都肖。再传而后。薄之又薄。弱之又弱。覆宗绝祀。适得其常。淫祸之烈。可胜言哉。呜呼。人寿几何。百年一瞬。纵不顾名节。不惜身命。未有不念及子孙。谋及宗祀者。苟一计及。方追悔不暇。有何娱乐。尚思逞欲耶。至于尼僧孀寡。仆妇青衣。娼家妓馆。名分所关。身家所系。尤易明察。无庸多赘。是在有志者清净为基。存诚为用。坚忍为守。决烈为志。存之以不动。养之以湛如。举凡诱人入罪.一切诲淫之书。付彼烈火。为天下苍生造福。狎淫之友。摈不与通。易吾好色之心。殚精会神。图为有益。将见何名不立。何利不收。而五福之休。毕集于我躬矣。是为劝。</p>\n<p>　　◎汪舟次曰。诸恶业中。唯色易犯。败德取祸。亦莫过此。常即万恶淫为首一语思之。世间恶业无穷。何至以淫为最。盖淫念一生。诸念皆起。邪缘未凑生幻妄心。勾引无计。生机械心。少有阻碍。生嗔恨心。欲情颠倒。生贪著心。羡人之有。生拓毒心。夺人之爱。生杀害心。廉耻丧尽。伦理俱亏。种种恶业。从此而起。种种善愿。从此而消。故曰万恶淫为首。夫一动淫心。未必实有其事。已积恶造业如此。况显蹈明行。冈知顾忌者乎。世有忠厚善人。而身后不昌。才士文人。而终身潦倒者。其病皆由于此。今欲断除此病。当自起念时。截断病根。太上不言私美色。而言见他色美。起心私之。盖止一起心。而罪已不可逃矣。</p>\n<p>　　◎杀人者止及一身。淫人者毒其数世。不独伊夫闺门不肃。终身难以对人。即上而公姑。下而子女。莫不耻悬眉睫。痛入心脾。更有夫怒而杀其妻。父怒而鸩其女。甚至因是而斩人子息。绝人宗祠。亦念片时娱乐。所得几何。而将良家妻女。无端诱人火坑。无论冥报彰彰。而此心抑何太忍。</p>\n<p>　　◎孀居苦节本是一点贞心。鬼神钦敬。今乃眉来眼去。致他此心一动。不复自持。从前苦节。一时尽丧。罪大恶极。莫此为甚。至于破残闺秀。无论丑声扬播。人所共弃。即或有人娶去。往往败露逐还。父母含羞。兄弟负耻。因而气忿陨命者有之。<a href=\"/remen/yiyu.html\" class=\"keylink\" target=\"_blank\">抑郁</a>伤身者有之。人亦何憾于彼。而必为此害人害己之事哉。</p>\n<p>　　◎妇女何知远大。或因一时之爱慕。而愿结鸾俦。或因年少之无知。而感怀麝诱。可怜无瑕白璧。顿受尘翳。后虽终身抱悔。而此日之淫污莫涤。更有一朝被染。而毕生之廉耻皆忘。兴言及此。实为寒心。是以古之君子。虽彼揽袂相邀。牵帏相就。当不禁严庄拒绝。回娥眉胥溺之狂澜。婉转开陈。示锦帐回头之道岸。倘能收拾芳心。保全贞性。则数世之阴灵。皆被仁人之厚泽矣。</p>\n<p>　　◎至若婢女仆妇。尤易行奸。不知此辈。本属良民。不过因难投充。以贫自鬻；奈何既役其身。又乱其性耶。况家政不肃。家道不和。大都由此。或妒妻鞭挞以伤生。或悍仆反唇以噬主。或父子不知而聚尘。或兄弟交迷而荐寝。甚者以骨肉胞胎。沦为贱疼胜。后人无知。误行亵狎。名为主婢之分。阴有兄妹之戚。伤风败俗。所不忍言。</p>\n<p>　　◎又有假<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>之行踪。诱空门之艳质。敢污佛地。败坏清修。此与寻常淫恶。定加百倍。</p>\n<p>　　◎更有别种狂痴。渔猎男色。外借朋友之名。阴图夫妇之好。彼既见鄙于众人。我亦不齿于正士。等而下之。狎优童。呢俊仆。心因欲乱。内外不分。我既引水入墙。彼必乘风纵火。其间盖有不可知者。</p>\n<p>　　◎他如寄兴青楼。自谓风流雅事。不知淫娼贱质百种温存。无非陷人钩饵。一入其中。极聪明人。亦被迷惑。遂至乱其心志。废其正业。破家荡产。流入匪类。况遇尸痨之妇。疮毒之妓。延染及身。脱眉去鼻。痛楚难堪。岂惟不齿于亲朋。抑且见憎于妻子。即良医疗治。获全性命。而毒气内伤。多致不能生育。纵有生育。而先天毒盛。往往发为异疮恶痘。以致夭折。因此覆宗绝祀。嗟何及哉。</p>\n<p>　　◎颜光衷曰。少年欲心。何所不至。譬如口腹嗜味。愈纵愈狂。力自简制。则味淡将去矣。又有肆邪说以鼓其欲。曰好色。非慧性男子不能。玗鹑之奔奔求偶。狐之绥绥求媚。彼非其慧性哉。任我之欲而无礼。则禽兽何殊焉。且少年才士。染指良家。则阴谴杀祸可惧。恃财嫖荡。则耗家恶疾可虞。渔猎男色。则辱人败行可耻。何如渐忍渐戒。可以省些肠断。积些阴德乎。有倡此蛊惑人者。罪应与此同科。</p>\n<p>　　◎由来纵欲导淫。莫甚于市井。聚谈则无非闺阁。结伴则浪迹花街。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>偶盼。辄谓多情。中道相逢。便矜奇遇。以窃玉偷香为趣事。视败伦伤化若寻常。相扇成风。毫无顾忌。不知心无二用。花柳情深。必至抛荒生理。由是求利者资本渐消。帮人者生涯难保。且恶因日积。罪孽日深。显则倾家荡产。市中之拮据徒劳。阴则削禄减年。命里之荣华尽丧。大则父母无依。肝肠暗裂。小则身在顿隳。流落堪嗟。甚至败露触凶。而七尺之躯。顷刻作刀头之鬼。奈何彰彰淫祸。动日迂谈。而甘心流为匪类哉。</p>\n<p>　　◎世人好于后生小子前。语及淫亵。以为笑乐。彼年少无知。乌知利害。闻此欲念跃跃。由是凿其未破之真。竭其未充之髓。以致奄奄成疾。甚至夭亡。终身祸患。实由傍人之鼓舞始也。夫不能正言规戒。已非益友。况又从而导之。拔舌地狱。当为此等人设。</p>\n<p>　　◎昔人谓阅淫书有五害。妨正业害一。耗精神害二。乱心志害三。或友人借看则害友人。或子孙窃视则害子孙。谈淫秽有三罪。扬人丑。伤己德。亵天地神明。若能以身率物。或逢人观看椑史。谈及香闺。当援引贞淫<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。晓劝一切。或广座危言。或密室苦口。<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>揶榆。无避迂腐。婉转劝导。则千百人中。必有受其益者。近日淫词小说。街坊赁卖者甚众。凡淫秽难堪之语。不可形于齿颊者。公然笔之于书。即就其尤雅者。亦无非偷会私期。败名丧节之事。后来反得显贵团圆。将中篝之丑。说得毫无足怪。无知闺女。遂误认为佳人才子之事。由此丧贞失节。玷辱家风。万年难洗。至于开小儿未萌之窦。启村夫羡慕之心。种种祸害。不可殚述。更有春宫淫昼。尤属导淫之阶。此皆流毒人心之甚者也。居显位有言职者。诚能严行禁止。搜刻板而尽毁之。其有裨于风化。岂浅鲜哉。</p>\n<p>　　◎乐圃朱善曰。闺房之乐。本非邪淫。妻妾之欢。虽无伤碍。然而乐不可极。欲不可纵。欲纵成患。乐极生悲。古人已言之矣。人之精力有限。淫欲无穷。以有限之精力。资无穷之淫欲。无怪乎年方少而寿遽夭。人未老而力先衰也。况人之一身。上承父母。下抚妻子。大之有功名富贵之期。小之有产业家私之受。关系非浅。乃皆付之不问。而贪一时之宴乐。不顾日后之忧危。是诚何心哉。且寡欲者必多男。贪淫者每无后。盖精力衰薄养育难成。遂至子息单微。甚而后嗣灭绝。是其为祸。可殚述哉。</p>\n<p>　　◎周思敏曰。人生天地间。圣贤豪杰。惟其所为。然须有十分精神。方做得十分事业。苟不知节欲以保守精神。虽有绝大志量。神昏力倦。未有不半途而废者。</p>\n<p>　　◎欲火焚烧。精髓易竭。遂至窒其聪明。短其思虑。有用之人。不数年而废为无用。而且渐成痨痵之疾。盖不必常近女色。只此独居时展转一念。遂足丧其生而有余。故孙真人云。莫教引动虚阳发。精竭容枯百病侵。盖谓此也。</p>\n<p>　　◎色是少年第一关。此关打不过。任他高才绝学。都无受用。盖万事以身为本。血肉之躯。所以能长有者。曰精曰气曰血。血为阴。气为阳。阴阳之凝结者为精。精合乎骨髓。上通髓海。下贯尾阎。人身之至宝也。放天一之水不竭。则耳目聪明。肢体强健。如水之润物。而百物皆毓。又如油之养灯。油不竭则灯不减。故先儒以心肾相交为既济。盖心。君火也。火性炎上。常乘未定之血气。炽为淫思。君火一动。则之肝肾相火皆动。肾水遭砾。泄于外而竭于内矣。男子十六而精通。古者必三十而后娶。盖以坚其筋骨。保其元气。且血气稍定。亦不至如少年之自耗也。近世子弟。婚期过早。筋骨未坚。元神耗散。未娶而先拨其本根。既婚而益伐其萌萌糱。不数年而精血消亡。奄奄不振。虽具人形。旋登鬼箓。此固子弟之不才。亦由父兄之失教。今为立三大则。曰勤职业以劳其心。别男女以杜其渐。慎交游以绝其诱。如此则内外交修。德业日进。而父兄之道尽矣。</p>\n<p>　　◎欲戒淫行。必自戒淫念始。淫念起。则淫行随之矣。然则何以制之。曰邪友不宜近。邪地不宜入。邪书不宜看。邪话不宜听。盖邪友一近。则益友日疏。自然渐染引诱。渐入下流。放僻邪侈。无不为已。邪地一入。则正念难持。自然技痒心热。把持不定。游移俄顷。悔恨终身。言念及此。可不戒诸。至邪书邪话。不过文人游戏。闲汉谑谈。彼欲编成一事。自然说得美好团圆。要皆捏造虚诬。岂可信为真实。若以为偶触无妨。焉能动我。则潜滋暗长。有隐受其害而不知者。总之。守身之法。宁可过为防闲。不可稍自宽纵。宁可人笑迂板。不可自命圆通。苟非致严于平日。能保无失于临时哉。</p>\n<p>　　◎赵鸿宝曰。色欲一节。说得硬。拿不定。一念稍疏。陷溺难返。念念坚忍。当境忽移。惟于平日。对先哲于简编。置格言于座右。清心寡欲。胸中于礼法<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。确信不疑。偶动邪念。当下痛除。如此。则当境自能猛省。至于男女之际。务远嫌于瓜李。虽系至亲至厚。定须内外分明。一言一笑不苟。妄心自然不萌动矣。此正本清源之法也。</p>\n<p>　　◎凡人最易失足。只在艳冶当前。勃然难制之一刻。试思闭目不窥。坐怀不乱。不过片念能持。而可以登大魁。致显位。光祖考福子孙。较之半世青灯黄卷。与他途积德累功者。事半功倍。又何苦以俄顷欢娱。弃盖世之功名。博终身之荼毒哉。倘操守不严。纵情任意。彼粉白黛绿。转眼成空。而由此夺算。由此减禄。由此杀身。且命该富贵者注贫贱。应有子者罚无嗣。妻女有淫夫报。子孙受困穷报。种种恶业。不一而足。噫。悔已晚矣。</p>\n<p>　　◎今人平居不知谨饬。或对子女而夫妇嬉笑。或畜胜妾而涂敷脂粉。或纵妻出外游观。或奴婢犯奸不禁。种种不肃。何以齐家。若寡欲清心。笑言不苟。内外有别。防闲有法。则闺门之内。雍肃如宾。有不令人爱敬者哉。</p>\n<p>　　◎姚庭若曰。今人一身不淫。只了得一身事业。何如一劝十。十劝百。百劝千万。并流布后世无穷。同证善果乎。犹如布种然。一升落地。报以石计。种无穷。生亦无穷。但须勤布。莫使田荒。又如传灯然。一灯然。千灯皆然。灯无量。光亦无量。但自我传。莫自我灭。人特未肯实心苦劝耳。倘谓劝人而人不应。是犹布种而种不生。传灯而灯不明也。有是理哉。</p>\n<p>　　◎王大契问<a href=\"/fjrw/hcrw/lcds/\" class=\"keylink\" target=\"_blank\">莲池大师</a>。弟子自看师戒杀文。遂持长斋。惟是色心炽盛。不能灭除。乞师方便教诲。使观欲乐。一如<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>之惨。答云。杀是苦事。故言惨易。欲是乐事。故言惨难。今为一喻。明明安毒药于恶食中。是杀之惨也。暗暗安毒药于美食中。是欲之惨也。智者思之。</p>\n<p>　　◎凡人见美色起邪心。种种恶心都生。恶心生而良心死矣。惟于邪念勃发。不可遏抑之时。思一死字。或思己身患难疾苦事。则必淡然而止。否则思此女死后。腐肉朽骨。臭不可近。眼前色相。无非幻境。则必憬然悟。否则思吾爱此女。而毁其名节。即秽同粪土。全其名节。斯珍如珠玉。当便矜之恤之。成全之。愈爱而愈不忍污。如是则必肃然敬。否则思吾图片刻之欢娱。而折功名。削富贵。夺纪算。遭杀害。斩嗣续。败声名。皆由于此。如是则必猛然省。即不然。则思羞恶之心。人皆有之。女子失节。只因一时之迷。迨见恶于父母兄弟。见弃于舅姑丈夫。见笑于邻里亲族。每致悔不可追。含怨殒命。更或苟合<a href=\"/remen/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>。母子俱毙。冥冥中怨魂。岂肯相舍。如是则必矍然惊。又不然。则思女子背夫外交。夫且忍负。很毒甚矣。更何论乎外人。便当作豺狼看。作蛇蝎看。作勾魂鬼使看。作前生怨家看。如是则必惕然戒。视人之女。要想如己女之恶人犯。视人之妻。要想如己妻之怕人污。人当动念之始。深自警惕曰。我淫人之妻女。设我之妻女亦被人淫。奈何。对面一想。则此心自然遏灭。此降火最速之药。且犯人之女。己女未有不为人犯者。污人之妻。己妻未有不为人污者。不必证之于古。历观近时报应。天道真不差累黍。看已受报应的淫人。个个如是。便知未受报应的淫人。也是个个如是。<a href=\"/ctwh/shici/gushi/\" class=\"keylink\" target=\"_blank\">古诗</a>云。劝君莫借风流债。借得快来还得快。家中自有代还人。你要赖时他不赖。旨哉斯言。唤醒梦梦不少。</p>\n<p>　　◎吴泽云曰。人自赋气成形而后。最重者莫如<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。然未能养生。安知保命。既知保命。即能养生。此不易之理也。乃近世人心不古。风俗浇漓。其最足戕贼人之生命者。要惟色为巨。色犹刃也。蹈之则伤。色犹鸩也。饮之则毙。虽男女居室。为人伦所不废。苟不知制情止义。其中亦有杀身之虞。而入顾甘之如饴。漫无节制者何哉。盖由<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>之心先亡。而邪淫之念遂<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>而起。当其年少气盛。留恋狎邪。尝以有用之精神。消磨于妇人女子之手。而不之惜。甚至钻穴踰墙。视为韵事。宿娼挟妓。自诩风流。甚或对妻孥而诲淫。向闺房而谑笑。因斯门风败坏伦纪丧亡中菁新台贻羞内外。然彼犹以为乐。而不以为苦焉。迨至陷溺已深。精枯髓竭。志气因之堕落。耳目因之瞆聋。形骸因之瘠厄。人格因之卑下。而一切虚弱瘫痪之病。又复乘隙而丛生。以致一身无穷之事业。绝大之希望。均消归于乌有。卒之命殒中年。名登鬼箓且或死不得所。而害及子孙者。要皆未节色欲之过也。其真以生命为儿戏哉。</p>\n<p>　　◎人于钱财。锱铢计较。百计营求。量入为出。犹恐不继。有浪用不节者。指为败子。夫财乃外至之物。犹珍重若此。若精液之可贵。非特钱财也。淫欲之所伤。非特锱铢也。财尽则穷。精尽则死。而乃恣意纵欲。毫不知惜。一旦精竭髓枯。水干火炽。医药罔效。悔之晚矣。苏东坡云。伤生之事非一。而好色者必死。人之一身。神以御气。气以化精。精神充实。百骸强壮。足以有为。若淫欲无度。则竭精气耗。神不守舍。疾病夭亡。职此之由。可不慎欤。</p>\n<p>　　◎身体发肤。受之父母。不敢毁伤。孝之始也。夫毁伤云者。岂戕手折足之谓哉。有如嘉树初生。发荣滋长之际。必戒勿翦伐。朝培夕护。然后可冀其成荫。人当成童婉峦之日。筋力未充。血气未定。而先丧真元。以致形体枯羸。菁华销铄。百病丛生。父母相对惊惶。束手无措。此姑无论阴骘所关。减龄削算。即奈何以自作之孽。贻二亲以无涯之隐痛。古之人一跨步不敢忘父母。以其遗体行殆。况玷其清白乎。其为不孝。孰大于是。</p>\n<p>　　◎轻薄少年。至亲友家。辄窥内室。或倾耳窃听。道逢佳丽。停趾凝瞩。尾缀其后。访其氏族。甚至以所见与同才肆口嘲评。试问此何心也。遽伯玉不以冥冥堕行。司马温公生平无一事不可对人言。而于白昼之时。众人属目之地傲然出之恬不为怪。轻薄如此。尚不入端人正士之目。而谓不干鬼神之怒者乎。交游中有此等辈早宜斥绝。不可与一日居也。</p>\n<p>　　◎毕忠告曰。方今世界之愈形黑暗污浊。青年子女之益多败节丧身者。推其故。皆发端于淫书淫画之流毒也。窃观近年新出版之艳情淫书淫画。不知凡几。层出不穷。触目皆是。少年子女。见报端所载之目录告白。已五花八门。说得形容尽致。意动购阅。不免同伴傅观。致使目醉心迷。神魂颠倒。胆怯者不敢轻于尝试。然身体已无形受耗折矣。胆泼而意不自持者。若一失足。小则失业失学。耗精拜神。大则倾家丧命。绝嗣断宗。当此之时。悔已无及。沪上黑暗淫风。甚于他埠。试观藏垢纳污。引人入罪之地。到处皆是。耳濡目染。平日之志定自重者。尚不免受损友之怂恿失足也。吾故曰。淫书淫昼。实杀人之利刃。雎愿青年子弟。闺阁少女。遇此等淫书。撕毁勿阅。遇此等损友。摈弃勿面。尚望互相警戒。勿蹈无形之杀人危机也。我今九顿首于出版界。著作界之前曰。谁无子弟。谁无妻女。而忍令其入黑暗。陷死亡。断宗绝嗣乎。我又九顿首于各校长。各家长。各号经理之前曰。务各随时严行稽察。循循劝导。使各青年子女。出黑暗。免死亡也。而其源则仍在于出版界。著作界之好行其德也。倘采及刍尧。竟毁版而绝笔焉。吾如其子弟妻女。必为共和国之大伟人。大阎范也。倘谓淫书中寓有恶果报者。阅者自能警惕。试问何册书。不寓果报之说。何以只见阅者之沉沦陷溺乎。我又拜手稽首于作艳情之著作家。绘淫画之美术家之前曰。榬笔辉辉。何求不得。何苦自留污点。自累盛名。引社会于黑暗陷人民于死亡。所博者只蝇头之微利耳。阴骘因果之说。虽为时流所罕言。然五经四书。古今通人。各皆发挥提倡。岂以时流不信。遂致无有乎哉。恶业之中。淫恶为最。生前暗中获种种折福折寿。灭子绝孙之报应。死后灵魂必永受<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。凡我同胞能不触目惊心耶。敬求沪上慈善长者。如不以鄙言为谬。开会集议。妥筹劝导之法。不独造福一方。而德风所被人各景从。则天下同胞。咸受恩泽。不禁馨香百叩祷之。</p>\n<p>　　◎黄孝直曰。<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>云。少之时。血气未定。戒之在色。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>之于色。无时而不戒也。礼。庶人非五十无子。不娶妾。其不二色可知。男子三十而娶。其不杂色可知。诸侯不娶境内。其不夺人之妻可知。先王以分至日<a href=\"/remen/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>。其清心寡欲可知。乃孔子概不之及。特提出少之时血气未定。戒之在色一语。诚重之也。抑畏之也。盖人之方少。犹草木之始萌也。百虫之在蛰也。草木当始萌之曰。而即摧其芽。未有不枯稿者。百虫当藏蛰之会。而忽发其扁。未有不死亡者。圣人提醒少年。使其力制色心。悚然自爱。以保养柔嫩之驱。少年时能于此色欲一关。把得牢。截得断。他年元神不亏。气塞两间。立朝之日。精神得以运其经济。作掀天事业。真人品真学问。皆由于此。即使不成大器。亦必克尽其天年。不致死于非命。此少年所当猛省也。</p>\n<p>　　◎父母爱子甚切。自幼无不管教。惟至色欲伤身大事。则多不甚明切训诲。推原其故。盖因未婚时，以为子弟知识未开。不可明言。及既娶后。又以子弟已壮。兼碍媳面。不便尽言。不知子弟年轻。阅历未深。凡古今好色必死之事。未经目睹亲见。不甚相信。又不能详读远色戒淫之书。兼听匪友荒唐之语。每将房事。视为乐境。遂至伤身毙命。因以绝后者。不可胜数。良可叹息而堕泪也。为父母者。须于子弟十四五岁时。先于暗中。察其动静。省其嗜好。如知识已开。则于易换衣裤时。密为周视。察有遗精斑渍。急须援引古训。与之明言。详告以好色必死之理。引证以好色已死之人。令子弟自知畏惧。即能保养精神。及既娶后。尤须不惮烦碎。婉为开导。父勉其子。婆勉其媳。急须将远色戒淫各书。为媳讲解。令媳私下规劝其夫。万不可懒于一时。碍于情面。而遗终身之痛也。</p>\n<p>　　◎淫祸最大。不止邪缘。即妻妾欲事稍过。或独寝心想欲事。皆足致疾丧身。不可不戒。道书有曰。人生欲念不兴。则精气舒布五脏。荣卫百脉。及欲念一起。欲火炽然。拿撮五脏。精髓流溢。从命门宣泄而出。即尚未泄出。而欲心既动。如以烈火烧锅内之水。立见消竭。未几则水干而锅炸矣。此欲念尤足伤身之实据也。吾愿世人有病自疗。唯在正其心而主于敬耳。</p>\n<p>　　◎少年新婚之日。欲念正盛。若不为之节。往往种死根而促其茂龄。此甚可痛也。昔有一士。婚后赴试。觉孤枕为苦。未毕遽归。一日走百余里。二鼓抵家。其父怒曰。是必在郡生事。惧祸逃归者。命缚而置诸空仓。疾呼觅杖曰。明日当痛笞之。明日父徐起释之。亦弗问也。其子初归。兴甚浓。突遭斥辱。端揣终夕。既释。终莫喻父意。时有一友。与之偕归。翌日死矣。盖以百里行房而精脱也。始悟父缚之之故。古称事亲者视于无形。听于无声。抑知<a href=\"/fjrw/jsrw/zsy1/96308.html\" class=\"keylink\" target=\"_blank\">父母之爱</a>子。乃真有视听于形声之外者乎。噫。家室犹然。而况履蹈危机。风露侵逼于外。惊恐交战于中。更有什百于是者。人子知此。体亲之心以为心。则寿康可得矣。</p>\n<p>　　◎黄书云云。邪淫者。凡属他人之妻女。我以邪心犯之者皆是。即己之妻室。而犯之非其时。非其地。或于其身有生死之关系。或于其日犯人神之<a href=\"/foxue/changshi/153461.html\" class=\"keylink\" target=\"_blank\">禁忌</a>。或于其体失交合之正理。或于其日属神圣之诞期。皆邪淫也。至于娼妓。以宿世恶业。致堕此中。宜生怜悯。乃反幸其下贱。恣行淫秽。其损德招报。诚堪畏惧。若犯幼童。奸处女。乱寡妇。污尼僧。是乃禽兽所不为。人神所同嫉。天律所不容者。尤为罪大恶极。所当惕然省。悚然畏。戒慎自持。战兢勿犯者也。又或交及禽兽。乱至伦常。此为口之所不忍言。乃成事之所竟或有。嗟乎。人心之坏。至于此极。岂止沦于禽兽。殃及子孙耶。<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>篇以见他色美。起心私之为有罪。起心犹不可。况见诸实事。习为故常者乎。夫古人有献女不纳者。而我乃百计以图之。古人有昏夜拒奔者。而我乃强逼以污之。古人有舍金还妾者。而我乃多方以挑之。古人有措资嫁婢者。而我乃恃势以奸之。古人有赎贱为良者。而我乃乘危以胁之。古人有捐金完人夫妇者。而我乃离间以夺之。古人有出财助人嫁娶者。而我乃阴险以破之。隐之为闺阁之羞。显之系全家之辱。小之亦终身之恨。大之成性命之忧。生则负疚于神明。而无以对其丈夫父母儿女。死则沉沦于恶道。而相连以入于地狱饿鬼畜生。我之罪诚不可逃。而彼之怨终未能解。驯至生生世世。久为业缘。子子孙孙。受其惨报。顷刻之欢娱有限。多生之罪累无穷。总由妄认空花。遂沈欲海。风流孽债。何忍结之。须是识得破。忍得过。若是忍不过。仍是识不破耳。故见人妻女。当作自家眷属想。其长者视如母。壮者视如姊。少者视如妹如女。则淫心便无由而起矣。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>曰。菩萨于自妻常自知足。自己之闺房。淫欲过度。犹不可。而敢乱他人妻女乎。速报录云。我不淫人妇。人不淫我妻。冥律云。奸人女者。得绝嗣报。奸人妻者。得子孙淫沃报。古今罪案。见于戒淫宝训。感应阴骘诸书注案者多矣。可不畏乎。须知色相本空。娇姿如幻。画瓶盛粪。锦袋藏刀。每当暗室闲居。莫生<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。即使邪缘凑合。勿丧良心。惟以慧力照之。正念持之。当念自心之良知。炯炯然其在我也。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>之鬼神。森森然其鉴我也。头上之三台北斗。赫赫然其临我也。家中之宠神。身上之三尸。凛凛然其伺我也。天堂之福乐。一转瞬而可登。地狱之苦轮。一失足而将入。临崖勒马。<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>回头。于万难自持之时。存一万不可犯之想。文昌帝君遏欲文。钟离祖师戒淫歌。当熟读而力守之。勿造隐昧之业。勿为败德之行。勿以娼优为贱人。而弗加怜悯。勿以仆婢为卑下。而不与保全。勿以淫奔为自来。而失身蹈火。勿以妻妾为家饭。而纵欲伤生。勿忘长幼之名分。而紊纲常。勿污尼僧之净行。而触神怒。勿紊人禽之界。而与毛羽为缘。勿于仇怨之家。而以闺门泄忿。勿看淫词艳曲。以启邪心。勿谈美色淫声。以惑人意。除自犯外。凡引诱良家子弟淫荡。及好谈闺阁。编作淫书。摸写淫画。以启人情窦者。为教人邪淫。见闻人欲犯淫。而<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>赞成者。与自犯同。<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>曰。十方如来。色目行淫。同名欲火。菩萨见欲。如避火坑。若不断淫。修<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>者。如蒸沙石。欲其成饭。经百千劫。只名热沙。若刻实论之。即不必实有其事。而苟有一念之私。已犯万恶之首。盖恒性降自维皇。元命赋自父母。见美色而起淫心。则客感夺其恒性之主。维皇所降者。便亵渎一次。即大不忠也。外诱摇其元命之根。父母所赋者。即亏损一次。即大不孝也。盖以性不离命。命不离性。动一次淫欲。便耗一次理气。即丢一次性命。即犯一次首恶矣。噫。红颜之白圭未玷。而青年之黑籍已增。故君子先以正心清其源。次以寡欲养其德。何敢恣情纵欲。悖天蔑理。驯至折福减禄。短寿贻殃也乎。华严经曰。邪淫之罪。亦令众生堕三恶道。若生人中。得二种果报。一者妻不贞良。二者得不随意眷属。语曰。世上无如人欲险。几人能不误平生。可哀也夫。</p>\n<p>　　邪淫十二害</p>\n<p>　　冒起宗。注感应篇见他色美。起心私之二句云。见他人妻女之美貌。便起了奸邪的私心。这个念头一起。虽无实事。已难逃鬼神的祸罚。盖万恶淫为首。愚人不知利害。作此罪孽。今试讲种种祸害。指醒迷途。</p>\n<p>　　一害天伦。男女各有配偶。这是天定的伦。乱了他。不要讲到他们情义乖离。他的伦。我去乱了。便与禽兽。披毛带尾。是无别的。戴帽穿衣。岂可做此事乎。</p>\n<p>　　一害人节。妇女一生大事。只重节字。乱了他。使他失节。瓦破岂能再完。</p>\n<p>　　一害名声。凭你机密。无人不知。臭声远播。供人传笑。就是他的亲戚。也是面觉无颜。</p>\n<p>　　一害门风。羞辱他父母公婆。羞辱他丈夫。及兄弟姊妹。羞辱他子女孙媳。一门中耻挂眉额。痛缠心骨。实是杀他三代了。</p>\n<p>　　一害性命。或妇女因受气致死。或其夫愤死。或夫杀妻。或父杀女。或妇杀夫。或夫杀奸人或奸人被众打死。或婢女因妒妻致死。</p>\n<p>　　一害风俗。邻里中有这廉耻丧尽。人面兽心的人。愚人看了榜样。朋比为奸。最足伤风败俗。这种恶习。定遭劫数。这六样害。是害人的。</p>\n<p>　　一害心术。淫念一生。种种恶念都生。如幻妄心。贪恋心。机心。妒心。牵缠不住。意恶最重。</p>\n<p>　　一害阴骘。骘是定说。上天冥冥中有安定人的道理。就是本善的性。做人的胎元。今乱了常道。败德丧行。伤天理。灭良心。斩削了阴骘的理。便要堕入地狱畜生的恶道。</p>\n<p>　　一害名利。感应篇说。三台北斗。三片宠神。随身察过。那有夜深人静。上天不知的理。历看果报。如李登犯了。削去状元宰相。宜兴木客某犯了。黑虎衔他头去。命该富贵。也要削尽。况福分浅薄。狼狈何堪。</p>\n<p>　　一害<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。鬼神削夺人寿。淫恶为最。况且欲火焚烧。精神竭。骨髓枯。又成惊恐死。劳痵死。恶疮死。好色必死。早年短折。</p>\n<p>　　一害祖父。祖父相传的血脉。抛在那里。这最是忤逆路头。并一生的福分削尽。从此败家声。绝祭祀。阴间祖先当作馁鬼了。能不恨极。</p>\n<p>　　一害妻子。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>说。无有子息。乱人妻故。妻女淫乱。乱人室女故。把妻女去还债。又绝了后嗣。这不但看书上的果报。试看故世的淫人。个个这样。便知未故世的淫人。也是个个这样的。这六样害。是害已的。</p>\n<p>　　以上十二害。都从格言因果中来。更兼目睹时事。望我同志。豫把祸患认清。庶不临时迷昧。前贤说。这一关要忍。要坚忍。要很忍。又说常想病时死日。邪念便消。又说早夜点香一炷。<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>半时。使心猿意马。渐渐调伏。依这三说。更把十二害。日日看看。时时想想。便是<a href=\"/remen/jiexieyin.html\" class=\"keylink\" target=\"_blank\">戒邪淫</a>的良法。况如唐皋。罗伦。谢迁。王华的科甲。只因力拒奔女。赵秉忠。周旋。冯京的贵显。只因其父不犯邪淫。片刻间关系祸福。岂不极大。这他字。包括婢女仆妇在内。昔文帝重降阴骘文说。香帏私婢绣榻憩奴。俱膺必诛之律。人同一体。都是不该犯的。要知善人终身不贰色。视老如母。视长如姊。视少如妹。视幼如女。他来就你。终要力拒。守定了远邪十法。一清心地。二守规矩。三敬天神。四养精神。五勿目看。六戒谈秽。七烧淫书。八省房事。九勿晚起。十劝共戒。前人有戒邪淫单式刻送。内说每领一单。劝十人。写名签押。具疏神前。共誓戒淫。这法最好。单式也是易做的。</p>\n<p>　　四觉观</p>\n<p>　　凡夫淫欲念。世世常迁徙。宿生为女时。见男便欢喜。今世得为男。又爱女人体。随在觉其污。爱从何处起。</p>\n<p>　　睡起生觉第一  默想清晨睡起。两眼朦胧。未经盟漱。此时满口粘腻。舌黄堆积。甚是污秽。当念绝世娇姿。纵具樱桃美口。而脂粉末傅之先。其态亦当尔尔。</p>\n<p>　　醉后生觉第二  默想饮酒过度。五内翻腾。未久忽然大呕。尽吐腹中未消之物。饿犬嗅之。摇尾而退。当念佳人细酌。玉女轻餐。而杯盘狼藉之时。腹内亦当尔尔。</p>\n<p>　　病时生觉第三  默想卧病以后。面目黧黑。形容枯稿。又成疮痈腐溃。脓血交流。臭不可近。当念国色芳容。纵或年华少艾。而疾苦缠身之日。形状亦当尔尔。</p>\n<p>　　见厕生觉第四  默想通衢大厕。屎尿停积。白蜡青蝇。处处缭。当念千娇百媚之姿。任彼香汤浴体龙麝熏身。而饮食消融之后。所化亦当尔尔。</p>\n<p>　　九想观</p>\n<p>　　人想死亡日。欲火顿清凉。愚人若闻此。愁眉叹不祥。究竟百年后。同入烬毁场。菩萨九想观。苦海大津梁。</p>\n<p>　　新死想第一  静观初死之人。正直仰卧。寒气彻骨。一无所知。当念我贪财恋色之身。将来亦必如是。</p>\n<p>　　青瘀想第二  静观未敛骸尸。一日至七日。黑气腾溢。转成青紫。甚可畏惧。当念我如花美貌之身。将来亦必如是。</p>\n<p>　　脓血想第三  静观死人初烂。肉腐成脓。势将溃下。肠胃消糜。当念我风流俊雅之身。将来亦必如是。</p>\n<p>　　绛汁想第四  静观腐烂之尸。停积既久。黄水流出。臭不可闻。当念我肌肤香洁之身。将来亦必如是。</p>\n<p>　　虫啖想第五  静观积久腐尸。偏体生虫。处处钻啮。骨节之内。皆如蜂巢。当念我鸾俦凤侣之身。将来亦必如是。</p>\n<p>　　筋缠想第六  静观腐尸。皮肉钻尽。止有筋连在骨。如绳束薪。得以不散。当念我偷香窃玉之身。将来亦必如是。</p>\n<p>　　骨散想第七  静观死尸。筋已烂坏。骨节纵横。不在一处。当念我崇高富贵之身。将来亦必如是。</p>\n<p>　　烧焦想第八  静观死尸。被火所烧。焦缩在地。或熟或生。不堪目击。当念我文章盖世之身。将来或亦如是。</p>\n<p>　　枯骨想第九  静观破冢弃骨。日暴雨淋。其色转白。或复黄朽。人兽践踏。当念我韶光易迈之身。将来亦必如是。</p>\n<p>　　劝戒十则</p>\n<p>　　闺秀岂容玷辱。一生名节攸关。六亲体面没遮栏。结定怨家不散。纵使临婚瞒过。隐含羞耻难安。痛缠心骨怨如山。蒙垢千秋莫干。  处女</p>\n<p>　　人孰不思偕老。可怜独守空房。芳池拆散两鸳鸯。此后双飞绝望。死者别无余愿。只求为我增光。智欺势压太猖狂。终作怨家孽障。  孀妇</p>\n<p>　　有女皆期得所。守贞待字于归。只因穷困两相违。骨肉亲情如水。莫认楷前之草。休贪席上之杯。百年难保旧门楣。只恐后嗣不美。  婢女</p>\n<p>　　仆妇虽然下贱。含羞带耻人同。入牢无奈强相从。<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>一般深重。彼自分明配偶。我当严整家风。从来义仆干奇功。都是主恩感动。  仆妇</p>\n<p>　　他既为我鞠子。吾宁因子奸他。终年琴瑟远违和。只为家贫难过。况彼良人在室。望他守节心多。自羞自恨痛如何。劝尔早些看破。  乳妪</p>\n<p>　　贫窘甘心忍辱。端须仁者保全。逞财乘急肆淫奸。作孽终身不浅。穷富由来无定。家资聚散如烟。阿谁能买子孙贤。只恐后来难免。  贫妇</p>\n<p>　　彼既<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>出世。岂容觅趣调情。败他戒行坏他名。不顾佛家清净。神目赫然如电。地方借隙相乘。官刑冥罚祸非轻　　</p>\n</div>",
        "author": "未知"
    }
]