[
    {
        "title": "第01章 天地之始",
        "html": "<div class=\"B1_text\"><p>道可道也，非恒道也。名可名也，非恒名也。无名，万物之始也。有名，万物之母也。故恒无欲也，以观其妙，恒有欲也，以观其所徼。两者同出，异名同谓，玄之又玄，众妙之门。</p><p class=\"red\"><a>直译：道是可以被言说的，但可以言说的道，并不是那个恒久常存的道。名是可以被定义的，但可以定义的名，并不是那个恒久常存的名。无形无名，是造生万物的起始；有形有名，是孕育万物的母亲。当我们处于无欲的状态时，可以得观从无生有之妙；当我们处于有欲的状态时，可以得观万物成形之徼。有欲无欲，同出于人；有名无名，同出于道。它们虽然名称不一样，可说的都是同一个道理。它们互相缠绕，来回切换，无限延伸。这种“玄”之又“玄”的形态是我们认知天下万物、认知“道”的门径，也是道生天下万物的神妙之门。</a></p></div>"
    },
    {
        "title": "第02章 对立相存 功成弗居",
        "html": "<div class=\"B1_text\"><p>天下皆知美之为美，恶已。皆知善，斯不善矣。有，无之相生也。难，易之相成也。长，短之相形也。高，下之相盈也。音，声之相和也。先，后之相随，恒也。是以圣人居无为之事，行不言之教。万物作而弗始也，为而弗恃也，成功而弗居也。夫唯弗居，是以弗去。</p><p class=\"red\"><a>直译：天下人都知道美之所以为美，恶就已经太多了。天下人都知道什么是善，这里（斯）不善就已经存在了。“有”是由“无”生成的；“难”是由“易”成就的；“长”是由“短”形成的；“高”是由“下”积满而成的；“音”是由“声”应和而起的；“先”是由“后”跟随才有的。这是一个恒定不变的规律。所以圣人以无为的方式行事，以不言的方式设教。万物欣欣向荣而不干涉它们，化育万物而不执掌它们，成就功业也不去占有。只有不去占有这成功，成功才会一直相随，而不会离去。</a></p></div>"
    },
    {
        "title": "第03章 圣人之治",
        "html": "<div class=\"B1_text\"><p>不上贤，使民不争。不贵难得之货，使民不为盗。不见可欲，使民不乱。是以圣人之治也，虚其心，实其腹，弱其志，强其骨。恒使民无知无欲也，使夫智不敢。弗为而已，则无不治矣。</p><p class=\"red\"><a>直译：不拔高贤人的地位，使人民不互相争斗。不看重难得的财货，使人民不偷不盗。不展现容易诱发欲望的东西，使人民不作乱。所以圣人治理天下，让人民内心虚静，而腹内充实；意气减弱，而筋骨强健。总是让人民处于质朴自然而不妄为的状态，让那些善于使用智巧的人不敢有所行动。用无为之道治国，天下就没有治理不好的国家。</a></p></div>"
    },
    {
        "title": "第04章 和光同尘",
        "html": "<div class=\"B1_text\"><p>道盅，而用之又弗盈也。渊呵，似万物之宗。挫其锐，解其纷，和其光，同其尘。湛呵，似或存。吾不知其谁之子也，象帝之先。</p><p class=\"red\"><a>直译：道就好像一个空虚的容器一样，但它的作用无穷无尽，因为这个容器永远也不会盈满。它是那么的幽深啊，好像万物的宗主。它锉去万物锋锐的棱角，理顺纷扰与杂乱，把光调和至柔和，把万物与微尘齐一。它是那么的澄澈啊，若隐若存。我不知道它是由谁所生的，只知道在最早的有形之物出现以前，它就已经存在了。</a></p></div>"
    },
    {
        "title": "第05章 天地不仁 多闻数穷",
        "html": "<div class=\"B1_text\"><p>天地不仁，以万物为刍狗。圣人不仁，以百姓为刍狗。天地之间，其犹橐籥与！虚而不屈，动而愈出。多闻数穷，不若守于中。</p><p class=\"red\"><a>直译：天地没有所谓的仁爱之心，把万物当作祭祀时用的草狗来看待。圣人也没有所谓的仁爱之心，把百姓当作祭祀时用的草狗来看待。天地之间，不是好像一个大风箱一样吗？空虚而不竭尽，鼓动而风愈出。越向外追求见闻见知，内心就会越发失去对道的把握，所以不如安守于中。</a></p></div>"
    },
    {
        "title": "第06章 谷神不死 绵绵若存",
        "html": "<div class=\"B1_text\"><p>谷神不死，是谓玄牝。玄牝之门，是谓天地之根。绵绵呵若存，用之不勤。</p><p class=\"red\"><a>直译：空虚永存，运行不止，如玄奥的生殖之门一样。这个生殖之门，是天地得以产生的根源。它的运行就像丝一样细微，而又连绵不断，无论怎么使用，都不会竭尽。</a></p></div>"
    },
    {
        "title": "第07章 天长地久",
        "html": "<div class=\"B1_text\"><p>天长地久。天地之所以能长且久者，以其不自生也，故能长生。是以圣人退其身而身先，外其身而身存。不以其无私与？故能成其私。</p><p class=\"red\"><a>直译：天地长远恒久。天地之所以能够长久，正是因为天地不生长自己，所以才能得以长久。因此圣人常把自身放在最后，但却能站在最前方领导众人；并不一心为自己谋取福利，却能得到天下人的保护和爱戴。这不正是因为圣人无私吗？反而成全了他自己。</a></p></div>"
    },
    {
        "title": "第08章 上善若水",
        "html": "<div class=\"B1_text\"><p>上善似水。水善利万物而有静，居众人之所恶，故几于道矣。居善地，心善渊，予善天，言善信，政善治，事善能，动善时。夫唯不争，故无尤。</p><p class=\"red\"><a>直译：最上乘的“善”就好像水一样。水之“善”在于，有利于万物而又安然守静，处在众人都厌恶的地方，所以与道很接近了。居住之“善”，在于大地之上。用心之“善”，在于渊博宽广。施予之“善”，在于顺天应物。言语之“善”，在于坦诚有信。为政之“善”，在于安定无为。处事之“善”，在于发挥所长。行动之“善”，在于把握时机。正因为不争，所以从来不会有过失。</a></p></div>"
    },
    {
        "title": "第09章 持而盈之 功遂身退",
        "html": "<div class=\"B1_text\"><p>持而盈之，不若其已。揣而锐之，不可长保也。金玉盈室，莫之守也。贵富而骄，自遗咎也。功遂身退，天之道也。</p><p class=\"red\"><a>直译：把持至盈满，不如停止下来。锻打至尖锐，无法保持长久。金玉填满屋子，不能守护得住。富贵而骄纵，徒留祸端。功业成就了，事情做成了，就不要再牢牢把持，而是退去放下，这才是符合天道的做法。</a></p></div>"
    },
    {
        "title": "第10章 生而不有 长而弗宰",
        "html": "<div class=\"B1_text\"><p>载营魄抱一，能毋离乎？抟气致柔，能婴儿乎？涤除玄鉴，能毋疵乎？爱民治国，能毋以智乎？天门启阖，能为雌乎？明白四达，能毋以知乎？生之畜之，生而弗有，长而弗宰也，是谓玄德。</p><p class=\"red\"><a>直译：身体与魂魄合抱守一，能做到不分离吗？结聚精气而致柔和，能做到像婴儿一样吗？清洗杂念，涤荡心镜，能做到没有瑕疵吗？爱护百姓，治理国家，能做到不运用智巧吗？万物芸芸，出生入死，能做到柔弱安静，生之畜之吗？知晓天下，通达明白，能做到不使用知见吗？生成万物，畜养万物。生养万物而不占有它们，统领万物而不主宰它们，这就是最深的德。</a></p></div>"
    },
    {
        "title": "第11章 有之为利 无之为用",
        "html": "<div class=\"B1_text\"><p>卅辐同一毂，当其无，有车之用也。埏埴为器，当其无，有埴器之用也。凿户牖，当其无，有室之用也。故有之以为利，无之以为用。</p><p class=\"red\"><a>直译：三十根辐条共同汇集在一个车轮毂上，正因为轮毂有了中空的地方，才有车的作用。揉和泥土制作器具，正因为泥土有了中空的地方，才有器具的作用。开凿门窗，正因为墙壁有了中空的地方，才有房屋的作用。所以说，有之所以可以给人便利，是因为空无在发挥作用。</a></p></div>"
    },
    {
        "title": "第12章 五色目盲 去彼取此",
        "html": "<div class=\"B1_text\"><p>五色使人目盲。驰骋田猎使人心发狂。难得之货，使人之行妨。五味使人之口爽。五音使人之耳聋。是以圣人之治也，为腹不为目，故去彼取此。</p><p class=\"red\"><a>直译：绚丽色彩，会让人视力受损，不能正确地辨识事物。纵情追逐猎物，会让人心态受损，心浮气躁，狂乱难收。一味积累财货，会妨碍人行正道。厚味佳肴，会让人味觉受损，失去品味淡然的能力。美妙乐曲，会损害人的听力，让人听而不闻，昏聩莫名。因此圣人治理天下，只会注重经营民众赖以生存的根本，而不会偏向于声色浮华。所以摒弃那些让人偏离正道的物欲，而是取本守根。</a></p></div>"
    },
    {
        "title": "第13章 宠辱若惊 宠辱不惊",
        "html": "<div class=\"B1_text\"><p>宠辱若惊，贵大患若身。何谓宠辱若惊？宠之为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身也。及吾无身，有何患。故贵为身于为天下，若可以托天下矣；爱以身为天下，如可以寄天下矣。</p><p class=\"red\"><a>直译：受到恩宠或折辱都如同惊吓，重视大的忧患比得上自己的性命。什么叫“宠辱若惊”呢？受宠是因为把自身放在下位，因此得到来自上位的恩宠就会惊喜，失去了又是惊吓，这叫“宠辱若惊”。什么叫“重视大的忧患比得上自己的性命”呢？我之所以有大的忧患，正是因为我有自己的身体，如果连身体都丧失了，又还有什么可忧患的呢！所以把养护自己的身体看得比治理天下更加重要，这样就可以把天下托付给他了。如果喜好不顾惜身体而去治理天下，那么终也不过是天下的附庸而已。</a></p></div>"
    },
    {
        "title": "第14章 执今御今 以知古始",
        "html": "<div class=\"B1_text\"><p>视之而弗见，名之曰微。听之而弗闻，名之曰希。捪之而弗得，名之曰夷。三者不可致诘，故混而为一。一者，其上不皦，其下不昧。绳绳不可名也，复归于无物。是谓无状之状，无物之象，是谓忽恍。随而不见其后，迎而不见其首。执今之道，以御今之有，以知古始，是谓道纪。</p><p class=\"red\"><a>直译：看也看不到，称它为“微”；听也听不见，称它为“希”；摸也摸不着，称它为“夷”。这三者的区别很难界定，所以混同为一来看。这个“一”，它上面不显光明，下面也不觉暗昧，延绵不绝而莫可名状，所以只能把它归结为“无”的存在。“无”，并不是说它什么也没有，而是具备没有形状的形状，没有形体的形象，恍惚不明。跟随着它，看不到它的末尾；面向着它，看不到它的前端。把握住它着落在当下的样貌，用来驾驭当下的现实，由此得知其中的规律，进而窥见它本始的面貌。这就是认知“道”的纲领。</a></p></div>"
    },
    {
        "title": "第15章 微妙玄达 浊而静之",
        "html": "<div class=\"B1_text\"><p>古之善为道者，微妙玄达，深不可识。夫唯不可识，故强为之容。曰：豫呵其若冬涉水，犹呵其若畏四邻，严呵其若客，涣呵其若凌释，敦呵其若朴，混呵其若浊，旷呵其若谷。浊而静之，徐清。安以重之，徐生。保此道不欲盈，夫唯不欲盈，是以能敝而不成。</p><p class=\"red\"><a>直译：古时善于以道行事的人，玄妙不可言，通达不可测，幽深而难以认知。正是因为难以认知，所以只能勉强形容。他小心审慎的样子就好像严冬冒着寒冷履冰过河；他迟疑戒惕的样子就好像害怕四方邻国前来围攻；他庄重肃穆的样子就好像自己在做宾客；他涣散不羁的样子就好像冰凌将要消融；他敦厚朴实的样子就好像没有雕琢的素材；他混沌天真的样子就好像江河的浑水；他静寂幽远的样子就好像空旷的山谷。奔流的浊水安静下来以后，就会徐徐澄清。万物在安稳沉静的状态下，就会有生机萌发。持守这个道理的人不会追求盈满，只有不追求盈满，才能不与母本分离，而得以守住自己的根。</a></p></div>"
    },
    {
        "title": "第16章 致虚守静 知常明也",
        "html": "<div class=\"B1_text\"><p>至虚极也，守情表也。万物并作，吾以观其复也。夫物芸芸，各复归于其根。归根曰静，静，是谓复命。复命常也，知常明也。不知常，妄。妄作，凶。知常容，容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。</p><p class=\"red\"><a>直译：到达虚无而至极点，恪守情实而成准则。万物蓬勃兴起，而我观察它们最终仍会返还的地方。万物纷纷芸芸，各自返还它们的本根，返还本根的状态，叫做“静”。持守住了静，也就得以复归于生命之源起。复归于生命之源起，也就知道了固定不变的规律，知道了固定不变的规律，就叫做“明”，否则叫做“妄”。在不知道规律的情况下妄为，就会遭受挫败。掌握了固定不变的规律，就可以做到“能容”。一切按照规律行事，就是“至公”。“至公”者，可以为王。王行道于天下人，则具备天之博德；天行道于万物，则具备道之玄德。依托于道，则能获得长久，终身都不会有失败的危险。</a></p></div>"
    },
    {
        "title": "第17章 下知有之 功成事遂",
        "html": "<div class=\"B1_text\"><p>太上，下知有之。其次，亲誉之。其次，畏之。其下，侮之。信不足，案有不信。犹呵，其贵言也。成功遂事，而百姓谓我自然。</p><p class=\"red\"><a>直译：最好的国君，民众只是知道有这么一个存在。其次的国君，民众亲近并赞誉他。再次的国君，民众畏惧他。最次的国君，民众侮辱谩骂他。信用不足，才会不被信任。审慎啊！好的国君会非常看重自己的发言。事情做成功了，百姓都说“我们本来就是要这样做的”。</a></p></div>"
    },
    {
        "title": "第18章 大仁大义",
        "html": "<div class=\"B1_text\"><p>故大道废，案有仁义。智慧出，案有大伪。六亲不和，案有孝慈。邦家昏乱，案有贞臣。</p><p class=\"red\"><a>直译：大道被废弃，“仁义”就开始被推崇了。智慧已产生，大的伪诈就开始出现了。六亲不和睦，“孝慈”就开始被赞赏了。国家已昏乱，忠贞之臣就开始被赞扬了。</a></p></div>"
    },
    {
        "title": "第19章 见素抱朴 少私寡欲 绝学无忧",
        "html": "<div class=\"B1_text\"><p>绝圣弃智，民利百倍。绝仁弃义，民复孝慈。绝巧弃利，盗贼无有。此三言也，以为文未足，故令之有所属：见素抱朴，少私而寡欲。绝学无忧。</p><p class=\"red\"><a>直译：抛弃“圣明”的名号，放弃“智巧”的心思，人民就可以获得百倍的好处。抛弃“仁爱”的偏私，放弃“义理”的制约，人民就会重新恢复孝与慈。抛弃“巧诈”的行为，放弃“得利”的贪欲，盗贼就不会出现。以上三个说法，还不足以作为遵守的依据，所以更进一步让它们有所归属：表现出本真，恪守住惇朴，减损私心和欲望。如此则无需学习治理天下的技巧，也不会再为治理天下而忧虑。</a></p></div>"
    },
    {
        "title": "第20章 众人熙熙 独异于人",
        "html": "<div class=\"B1_text\"><p>唯与呵，其相去几何？美与恶，其相去何若？人之所畏，亦不可以不畏人。望呵，其未央哉！众人熙熙，若飨于大牢，而春登台。我泊焉未兆，若婴儿未咳。累呵，如无所归。众人皆有余，我独匮。我愚人之心也，沌沌呵。俗人昭昭，我独若昏呵。俗人察察，我独闷闷呵。忽呵，其若海。恍呵，其若无所止。众人皆有以，我独顽以俚。我欲独异于人，而贵食母。</p><p class=\"red\"><a>直译：应诺与呵斥，它们之间的差别有多大？美好与丑恶，它们之间的差距有多远？人所畏惧的，也不能不畏惧人。看不到边际啊！没有尽头的样子。众人兴高采烈，好像参加盛大的筵席，又好像春天登上高台放望美景。但是我却独自停留在尚未萌动的漠然领域，好像婴儿还不会开口嬉笑。颓唐失意啊！好像无处可以归依。众人都有富余，唯独我好像还有不足。我真是有一颗愚人的心啊，混混沌沌。俗人都能看得清楚明白，唯独我好像昏聩不明；俗人都能辨得细致入微，唯独我好像浑浑噩噩。若无所知啊，好像大海一样广漠；恍然不觉啊，好像没有止境。众人都在发挥才干有所作为，唯独我愚顽不灵，粗陋不堪。我表现的总是和俗人不一样，因为我看重的是固守本根。</a></p></div>"
    },
    {
        "title": "第21章 孔德之容",
        "html": "<div class=\"B1_text\"><p>孔德之容，唯道是从。道之物，唯恍唯忽。忽呵恍呵，中有象呵。恍呵忽呵，中有物呵。幽呵冥呵，中有情呵。其情甚真，其中有信。自今及古，其名不去，以顺众父。吾何以知众父之然也，以此。</p><p class=\"red\"><a>直译：“德”之所以表现出深远的样子，正是因为它遵从于道。“道”这个东西，只有在恍然不觉、若无所知的状态下才能察知到它。忽忽恍恍的，就会觉察到它的意象了。恍恍忽忽的，它进一步具现出形体了。它是那么的幽远，又是那么的深邃，其中存在可以让我们察知的实情。它呈现出来的情状是那么真实，因为其中对应着固定不变的规律。从当下到远古，都存在它的名字，以指向万物的本源。我是如何知道万物的本源是什么样的呢？就是通过这种方法。</a></p></div>"
    },
    {
        "title": "第22章 曲则为全",
        "html": "<div class=\"B1_text\"><p>曲则全，枉则正，洼则盈，敝则新，少则得，多则惑。是以圣人执一，以为天下牧。不自视故彰，不自见故明，不自伐故有功，弗矜故能长。夫唯不争，故莫能与之争。古之所谓曲全者，岂语哉！诚全归之。</p><p class=\"red\"><a>直译：曲折行事，可以得到圆满的结果；屈伏不争，可以造就中正的状态。低洼可以获得充盈，老旧可以成就新颖，追求的少则容易有所得，追求的多则容易陷入迷惑。所以圣人执守这个原则，用以治理天下。不用自己的眼光去看待事物，因而道理得以彰显。不用自己的成见去认知事物，因而真相得以显明。不自我夸耀，故而有功。不自作高贵，故而为官长。正是因为不争，天下无人可与之相争。古人说的“曲全”这个道理，可不仅仅只是一句空话，而是真的能够得到至善完满。</a></p></div>"
    },
    {
        "title": "第23章 希言自然",
        "html": "<div class=\"B1_text\"><p>希言自然。飘风不终朝，暴雨不终日。孰为此？天地而弗能久，又况于人乎！故从事而道者同于道，德者同于德，失者同于失。同于德者，道亦德之。同于失者，道亦失之。</p><p class=\"red\"><a>直译：不发言施令，让万物自作自化。狂风不能刮一早上，暴雨不能下一整天，谁制造的狂风暴雨呢？天地强力施为都不能长久，又更何况是人呢？所以用道的行为方式从事，就会获得“有道”的结果；用德的行为方式从事，就会获得“有德”的结果；用失道失德的行为方式从事，就会获得“失道失德”的结果。有德之人，道也会得到他；失德之人，道也会失去他。</a></p></div>"
    },
    {
        "title": "第24章 企者不立 余食赘行",
        "html": "<div class=\"B1_text\"><p>炊者不立。自视者不彰，自见者不明，自伐者无功，自矜者不长。其在道，曰余食赘行，物或恶之，故有欲者弗居。</p><p class=\"red\"><a>直译：吹嘘的人，不能有所建树。用自己眼光看待事物的人，看不显明。用自己成见理解事物的人，不得真相。自我夸耀的人，不能成就功业。自作高贵的人，不能得到敬重。用“道”的理念看待这些行为，就像吃饭的余弃一样是累赘，就像行走的负担一样是多余，大家都会厌恶它。因此想要有所作为的人，不会去干这样的事情。</a></p></div>"
    },
    {
        "title": "第25章 道法自然",
        "html": "<div class=\"B1_text\"><p>有物混成，先天地生。寂呵寥呵，独立而不改，可以为天地母。吾未知其名，字之曰道，吾强为之名曰大。大曰逝，逝曰远，远曰反。道大，天大，地大，王亦大。国中有四大，而王居一焉。人法地，地法天，天法道，道法自然。</p><p class=\"red\"><a>直译：有个东西混然而成，在天地还没有出现的时候就已经存在了。它空虚而又寂静，独立存在而又恒定不变，是造生天地万物的母亲。我不知道它的名字，称呼它为“道”，勉强给了它一个定义叫“大”。大到不论时间如何流逝也无法消减它；大到无论空间如何延伸也无法阻止它；大到无论如何颠倒反转也无法摆脱它。道大，天大，地大，王也大，像这么大的东西有四个，王就是其中之一。人守法于地，地守法于天，天守法于道，而道守法于它自己。</a></p></div>"
    },
    {
        "title": "第26章 轻则失本 躁则失君",
        "html": "<div class=\"B1_text\"><p>重为轻根，静为躁君。是以君子终日行，不离其辎重。唯有环观，燕处则超若。若何万乘之王，而以身轻于天下？轻则失本，躁则失君。</p><p class=\"red\"><a>直译：重是轻的根本，静是躁的主宰。所以君子终日在外行走不离开辎重，只有辎重随身，营寨环绕，才能闲居而表现出很悠然的样子。为什么拥有万辆兵车的君王，却轻易地动用自己的身体，去行治理天下之事呢？过于轻浮，就会失去根本；过于躁动，就会失去依托。</a></p></div>"
    },
    {
        "title": "第27章 善行无迹",
        "html": "<div class=\"B1_text\"><p>善行者无辙迹，善言者无瑕谪，善数者不以筹策。善闭者无关钥而不可启也，善结者无绳约而不可解也。是以圣人恒善救人，而无弃人。物无弃材，是谓袭明。故善人，善人之师，不善人，善人之资也。不贵其师，不爱其资，唯智乎大迷，是谓妙要。</p><p class=\"red\"><a>直译：善于行走的人，不会留下车辙马迹。善于言说的人，不会留下疏漏过失。善于计算的人，不会借助竹筹砝码。善于闭藏的人，不使用门栓插销别人也打不开。善于束缚的人，不使用绳索捆束别人也解不开。所以圣人总是善于救人，而不会抛弃人。万物都能各得其用而不被遗弃，这就可以称得上是沿用了道。所以有道之人，可为有道之人的师友；无道之人，可为有道之人的资材。不珍视自己的师友，不爱惜自己的资材，终不过只是大糊涂中的小聪明而已，这是个精深微妙的道理。</a></p></div>"
    },
    {
        "title": "第28章 知雄守雌",
        "html": "<div class=\"B1_text\"><p>知其雄，守其雌，为天下溪。为天下溪，恒德不离。恒德不离，复归于婴儿。知其荣，守其辱，为天下谷。为天下谷，恒德乃足。恒德乃足，复归于朴。知其白，守其黑，为天下式。为天下式，恒德不忒。恒德不忒，复归于无极。朴散则为器，圣人用则为官长。夫大制无割。</p><p class=\"red\"><a>直译：深知雄强，而安守雌弱，成为天下溪流的归处。成为天下溪流的归处，恒德就不会失去。恒德不会失去，就能复归于婴儿的纯真柔和之境。深知荣华，而安守浊辱，成为畜养天下万物的空谷。成为畜养天下万物的空谷，恒德也就得以充足。恒德得以充足，就能复归于朴实的浑然如一之境。深知清白，而安守暗昧，成为天下清明的范式。成为天下清明的范式，恒德也就不会差失。恒德不会差失，就能复归于无极的深远无限之境。朴实破散则成为器，圣人用朴就能成为众器之官长。所以真正完备的制度，是不会对万物进行分割裁裂的。</a></p></div>"
    },
    {
        "title": "第29章 为者败之 执者失之",
        "html": "<div class=\"B1_text\"><p>将欲取天下而为之，吾见其弗得已。夫天下神器也，非可为者也。为者败之，执者失之。物或行或随，或嘘或吹，或强或羸，或培或堕。是以圣人去甚，去泰，去奢。</p><p class=\"red\"><a>直译：想要通过强行施为的方式来持有天下，我看他不可能成功。天下是有自己运作规律的宏伟之器，不是我们可以强行施为的。强行施为，就会失败；强力抓取，就会失去。天下万物有的喜欢在前行走，有的喜欢在后跟随；有的性情温和，有的性情冷漠；有的心志强盛，有的心志软弱；有的善于培育，有的善于毁坏。所以圣人会去除自己过分的、放纵的、没有节制的行为。</a></p></div>"
    },
    {
        "title": "第30章 物壮则老",
        "html": "<div class=\"B1_text\"><p>以道佐人主，不以兵强于天下，其事好还。师之所居，楚棘生之。善者果而已矣，毋以取强焉。果而毋骄，果而勿矜，果而毋伐，果而毋得已居，是谓果而不强。物壮而老，是谓之不道，不道早已。</p><p class=\"red\"><a>直译：选择用道来辅佐自身的君王，不会强行用兵事来横行天下，因为恶果很容易落在自己身上。大军所到之处，荆棘丛生。以道来行事的人，即使用兵也只是为了解决危难，达到目的就停止了，并不逞强。达到目的也不要骄傲，达到目的也不要自认为了不起，达到目的也不要自夸自赞，达到目的只是因为不得已，这就是使用战争达到目的而不逞强的表现。事物太过壮盛便容易困顿，这叫不合于道，不合于道就会早早消亡。</a></p></div>"
    },
    {
        "title": "第31章 兵者非君",
        "html": "<div class=\"B1_text\"><p>夫兵者，不祥之器也。物或恶之，故有欲者弗居。君子居则贵左，用兵则贵右，故兵者非君子之器也。兵者不祥之器也，不得已而用之，铦袭为上，勿美也。若美之，是乐杀人也。夫乐杀人，不可以得志于天下矣。是以吉事上左，丧事上右。是以偏将军居左，上将军居右。言以丧礼居之也。杀人众，以悲哀莅之。战胜，以丧礼处之。</p><p class=\"red\"><a>直译：兵器是不祥的器物，大家都不喜欢它，所以想要有所作为的人，不会使用它。君子日常生活中以左为尊位，而用兵打仗则以右为尊位，所以兵器不是君子日常需要的器物。兵器是不祥的器物，使用它只是不得已，它以锋利便于杀伤为上，不要去赞美它。如果赞美它，就是喜欢杀人，而喜欢杀人，是不可能在天下得到成功的。所以办喜事以左边为尊位，办丧事以右边为尊位。偏将军处在左位，而上将军处在右位，说是用丧礼来对待兵事。杀人众多，用悲哀的心情来对待；打了胜仗，用丧礼的规制来处理。</a></p></div>"
    },
    {
        "title": "第32章 知止不殆",
        "html": "<div class=\"B1_text\"><p>道恒无名，朴唯小，而天下弗敢臣。侯王若能守之，万物将自宾。天地相合，以雨甘露，民莫之令而自均焉。始制有名，名亦既有，夫亦将知止，知止所以不殆。譬道之在天下也，犹小谷之与江海也。</p><p class=\"red\"><a>直译：道从来都是没有名字的，质朴虽然很低微，可是天下都不敢让它臣服。侯王如果能够持守于朴，万物都将自行归从。地气升腾于天而降下雨露，没有人发号施令但自行分布均匀。万物始生即有规制形成，规制既然已经有了，人也应当知道适可而止，不违逆它就不会遭受失败。如果把道在天下比作江海，那么万物的规制就好像小溪流，统归于江海。</a></p></div>"
    },
    {
        "title": "第33章 自知者明 自胜者强 知足者富",
        "html": "<div class=\"B1_text\"><p>知人者，智也。自知者，明也。胜人者，有力也。自胜者，强也。知足者，富也。强行者，有志也。不失其所者，久也。死而不亡者，寿也。</p><p class=\"red\"><a>直译：能看清别人，说明十分聪慧；能看清自己，才是真的通明。战胜别人，说明很有力量；战胜自己，才是真的高强。知足的人，才是真的富有；行而不止的人，说明心志强盛。不失去身体的居所，方能生命长久；身体死去而精神不亡，才是真正的长寿。</a></p></div>"
    },
    {
        "title": "第34章 不自为大",
        "html": "<div class=\"B1_text\"><p>道氾呵，其可左右也。成功遂事而弗名有也，万物归焉而弗为主，则恒无欲也，可名于小。万物归焉而弗为主，可名于大。是以圣人之能成大也，以其不为大也，故能成大。</p><p class=\"red\"><a>直译：道是这样的广泛啊，可左可右无所不至。事情做成功了也不会说是自己的功劳，万物都来归附也不会做它们的主宰，这是因为从来都没有自己的私欲，可以说很低微了。万物都来归附而不做它们的主宰，又可以说是很伟大了。所以圣人以道为法则，之所以能成就伟大，正是因为从来都没有想要成就伟大，因此最终能够成就其伟大。</a></p></div>"
    },
    {
        "title": "第35章 往而不害",
        "html": "<div class=\"B1_text\"><p>执大象，天下往。往而不害，安平泰。乐与饵，过客止。故道之出言也，曰淡呵其无味也。视之不足见也，听之不足闻也，用之不可既也。</p><p class=\"red\"><a>直译：执守住大道，则天下人都会前来归附。向道而往，就会并行不悖互不相害，得以平和安宁。音乐和美食，可以让过客停留。而道说出来，却是寡淡无味。看也看不见它，听也听不到它，但是用它却用不完。</a></p></div>"
    },
    {
        "title": "第36章 将欲翕之 以柔克刚",
        "html": "<div class=\"B1_text\"><p>将欲翕之，必固张之。将欲弱之，必固强之。将欲去之，必固举之。将欲夺之，必固予之。是谓微明。柔弱胜强。鱼不可脱于渊，邦利器不可以示人。</p><p class=\"red\"><a>直译：将要收拢的，必然是原本已经得到了扩张。将要削弱的，必然是原本已经得到了加强。将要去除的，必然是原本已经得到了推举。将要剥夺的，必然是原本已经得到了给予。这是很容易被忽视的道理。持守柔弱，更好过逞刚强。大鱼不能脱离深渊，国家的利器，不能随意示人逞威。</a></p></div>"
    },
    {
        "title": "第37章 道常无为",
        "html": "<div class=\"B1_text\"><p>道恒无名，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。镇之以无名之朴，夫将不辱。不辱以情，天地将自正。</p><p class=\"red\"><a>直译：道从来都是没有名字的，侯王如果能够持守它，万物就会自作自化。自作自化而有私欲出现，我就要用道的本源之朴来安定他们。用本源之朴安定了他们，也就不会再沾染私欲。不沾染私欲，他们就能保持真情朴实的面貌。如此，天地都将自行回归正态。</a></p></div>"
    },
    {
        "title": "第38章 上德不德",
        "html": "<div class=\"B1_text\"><p>上德不德，是以有德。下德不失德，是以无德。上德无为，而无以为也①。上仁为之，而无以为也。上义为之，而有以为也。上礼为之，而莫之应也，则攘臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄也，而乱之首也。前识者，道之华也，而愚之首也。是以大丈夫居其厚，而不居其薄，居其实，而不居其华。故去彼取此。</p><p class=\"red\"><a>直译：最上乘德性的人，不以施行德为目的，所以才具备了真正的德。低层次德性的人，处处以施行德为目的，所以反而不具备真正的德。最上乘德性的人，以无为来行事，顺从本性而为之。最上乘仁的人，以施行仁德来行事，顺从本性而为之。最上乘义的人，以施行义举来行事，强制自己而为之。最上乘礼的人，以施行礼制来行事，得不到回应，就举起胳膊强迫他人遵从。所以大道失去了，德开始得到推崇；德失去了，仁开始得到推崇；仁失去了，义开始得到推崇；义失去了，礼开始得到推崇。礼是忠信缺失的表现，推行它就是祸乱的开始。先行确立的规范制度，不过是大道的浮华，追随它就是愚昧的开端。所以大丈夫选择敦厚，而不居于浅薄；选择朴实，而不居于浮华。因此取其厚实，而弃其薄华。</a></p></div>"
    },
    {
        "title": "第39章 贱为贵本",
        "html": "<div class=\"B1_text\"><p>昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈，侯王得一而以为天下正。其致之也，谓天毋已清，将恐裂。谓地毋已宁，将恐发。谓神毋已灵，将恐歇。谓谷毋已盈，将恐竭。谓侯王毋已贵以高，将恐蹶。故必贵而以贱为本，必高矣而以下为基。夫是以侯王自谓孤、寡、不谷，此其贱之本与！非也？故致数誉无誉。是故不欲禄禄若玉，硌硌若石。</p><p class=\"red\"><a>直译：以往得到“一”的，天得“一”而清明，地得“一”而安宁，神得“一”而灵动，谷得“一”而充盈，侯王得“一”而成为天下依从的范式。推而言之，天如果不再保持清明，恐怕将要崩裂；地如果不再保持安宁，恐怕将要塌陷；神如果不再保持灵动，恐怕将要停歇；谷如果不再保持充盈，恐怕将要竭尽；侯王如果不再保持贵高，恐怕将要颠覆。所以贵以贱作为根本，高以下作为基础。因此侯王以“孤”、“寡”、“不谷”作为自己的称呼，这正是以贱作为根本啊！不是吗？所以招来太多的赞赏，就等于没有赞赏，因此不愿做尊贵的玉石，而愿做坚实的石头。</a></p></div>"
    },
    {
        "title": "第40章 反者道之动 有生于无",
        "html": "<div class=\"B1_text\"><p>反也者，道之动也。弱也者，道之用也。天下之物生于有，有生于无。</p><p class=\"red\"><a>直译：事物呈现出相反的形态，是道在被发动；事物呈现出柔弱的形态，是道在被使用。天下的万物生于有形质，有形质生于无形质。</a></p></div>"
    },
    {
        "title": "第41章 上士闻道 大器免成",
        "html": "<div class=\"B1_text\"><p>上士闻道，勤能行之。中士闻道，若存若亡。下士闻道，大笑之。弗笑，不足以为道。是以建言有之曰：明道如昧，进道如退，夷道如纇。上德如谷，大白如辱，广德如不足。建德如偷，质真如渝。大方无隅，大器免成，大音希声，大象无形，道褒无名。夫唯道，善始且善成。</p><p class=\"red\"><a>直译：上乘之人听闻了道，会勤奋地践行它；中乘之人听闻了道，有时候放在心上，有时候就遗忘了；下乘之人听闻了道，哈哈大笑。如果他不嘲笑，那道就不足以为道了。所以有立言是这样说的：显明之道好像是暗昧，进取之道好像是后退，平顺之道好像诸多阻碍。最崇高的德，好像空谷一般低下；最大的洁白，好像满是污垢；最宽广的德，好像还有不足；最具建树的德，好像偷偷摸摸；最纯真的品质，好像污浊不堪。最大的方正没有边角，最大的器物不会完成，最大的音律听不到它的声调，最大的形象没有形状，对道的最大褒扬是无名无誉。唯有道，善于滋生万物，且善于成就万物。</a></p></div>"
    },
    {
        "title": "第42章 负阴而抱阳 或损或益",
        "html": "<div class=\"B1_text\"><p>道生一，一生二，二生三，三生万物。万物负阴而抱阳，中气以为和。人之所恶，唯孤、寡、不谷，而王公以自名也。物或损之而益，益之而损。故人之所教，亦议而教人。故强梁者不得其死，我将以为学父。</p><p class=\"red\"><a>直译：道生浑然不可分之无形，无形而生有形，有形与无形结合为一体，继而造生万物。万物背向幽暗之阴，向于昭明之阳，气守中虚而致淳和。人们所厌恶的，就是“孤”、“寡”、“不谷”，但王公却用来自称。所以万物损己致虚，反而能得益；益己强横，反而会受损。因此人们得到教导，也会选择适宜的去教导别人。因此强横的人不得寿终正寝，将是从我这里传下来的一个道理。</a></p></div>"
    },
    {
        "title": "第43章 无有入于无间 不言之教",
        "html": "<div class=\"B1_text\"><p>天下之至柔，驰骋于天下之至坚。无有入于无间，吾是以知无为之有益也。不言之教，无为之益，天下希能及之矣。</p><p class=\"red\"><a>直译：天下最柔弱的事物，在天下最坚强的事物上纵横自如。无形的事物可以进入到没有间隙的地方，我因此知道无为的有益。不言的教化，无为的有益，天下很少有人能做到的。</a></p></div>"
    },
    {
        "title": "第44章 知足不辱 知止不殆",
        "html": "<div class=\"B1_text\"><p>名与身孰亲？身与货孰多？得与亡孰病？甚爱必大费，多藏必厚亡。故知足不辱，知止不殆，可以长久。</p><p class=\"red\"><a>直译：名声与身体，哪一个更亲近？身体和财货，哪一个更贵重？得到和失去，哪一个更让人困扰？过分地喜爱，必然会遭到重大的耗费；过多地收藏，必然会受到严重的折损。知足而不多藏，也就不会受到折辱；知止而不深爱，也就不会受到危害，这样才能得以恒远长久。</a></p></div>"
    },
    {
        "title": "第45章 大成若缺",
        "html": "<div class=\"B1_text\"><p>大成若缺，其用不敝。大盈若盅，其用不穷。大直如屈，大巧如拙，大赢如绌①。躁胜寒，静胜热，清静可以为天下正。</p><p class=\"red\"><a>直译：最大的成就好像有所欠缺，但它的作用不会衰竭。最大的盈满好像空虚，但它的作用不会穷尽。最大的伸展，是好像还在屈伏；最大的灵巧，是好像还显笨拙；最大的获利，是好像还有不足。躁动可以战胜寒冷，而清静可以战胜躁热，所以清静才是天下保持正态的根本。</a></p></div>"
    },
    {
        "title": "第46章 知足恒足",
        "html": "<div class=\"B1_text\"><p>天下有道，却走马以粪。天下无道，戎马生于郊。罪莫大于可欲①，祸莫大于不知足，咎莫憯于欲得。故知足之足，恒足矣。</p><p class=\"red\"><a>直译：天下治理有道，驮马都会被返还用于耕作。天下治理无道，战马都会在战场郊外产子。最大的罪过，是显露可以引发欲望的东西。最大的灾祸，是不知道满足。最惨痛的过错，是贪得无厌。所以自己知道满足的富足，才是真正的富足。</a></p></div>"
    },
    {
        "title": "第47章 其出弥远 其知弥少",
        "html": "<div class=\"B1_text\"><p>不出于户，以知天下。不窥于牖，以知天道。其出也弥远，其知弥少。是以圣人不行而知，不见而明，弗为而成。</p><p class=\"red\"><a>直译：不用走出门户，就能知道天下的状况。不用向窗外窥探，就能知晓天道。向外行走得越远，对道的认知就会越少。所以圣人不用亲身经历，就能得知天下运作的状态；不用亲眼观察，就能明知天道；不用亲力亲为，就能功成事遂。</a></p></div>"
    },
    {
        "title": "第48章 为学日益",
        "html": "<div class=\"B1_text\"><p>为学者日益，闻道者日损。损之又损，以至于无为，无为而无不为。取天下也，恒无事。及其有事也，不足以取天下。</p><p class=\"red\"><a>直译：追求学问的人，掌握的知识会随着时间的推移越来越多；追求大道的人，主观的成见会随着时间的推移越来越少。减损再减损，以至于到了“无为”的状态，无为便没有什么事是做不成的。持有天下一定不要妄为生事，如果妄为生事，也便不能够持有天下了。</a></p></div>"
    },
    {
        "title": "第49章 圣无常心",
        "html": "<div class=\"B1_text\"><p>圣人恒无心，以百姓之心为心。善者善之，不善者亦善之，德善也。信者信之，不信者亦信之，德信也。圣人之在天下也，歙歙焉，为天下浑其心。百姓皆属耳目焉，圣人皆孩之。</p><p class=\"red\"><a>直译：圣人从来都没有自己的主观意志，而以百姓的意志为自己的意志。对于善为道之人，我用善的方式对待他；对于不善为道之人，我也同样用善的方式对待他，这叫出自于德的善。对于有信之人，我用信的方式来对待他；对于无信之人，我也同样用信的方式来对待他，这叫出自于德的信。圣人在位于天下，会收敛自己的主观意志与成见；治理天下，会保持一颗混沌之心。百姓都能得以视听专注，而圣人就像对待孩子一样对待百姓。</a></p></div>"
    },
    {
        "title": "第50章 出生入死",
        "html": "<div class=\"B1_text\"><p>出生入死。生之徒十有三，死之徒十有三，而民生生，动皆之死地之十有三。夫何故也？以其生生也。盖闻善摄生者，陵行不避兕虎，入军不被甲兵。兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故也？以其无死地焉。</p><p class=\"red\"><a>直译：从出生到死去，一生平安自然死亡的人有十分之三，中途夭折意外死亡的人有十分之三，过分地奉养生命，而妄动致死的人，也有十分之三。为什么呢？因为奉养太过度了。听说善于养护生命的人，在山陵中行走不用避让犀牛老虎，在战场上不用穿戴盔甲装备兵器。犀牛用不上它的角，老虎用不上它的爪，兵器用不上它的锋刃。为什么呢？因为他没有给死亡留余地。</a></p></div>"
    },
    {
        "title": "第51章 尊道贵德 生而弗有",
        "html": "<div class=\"B1_text\"><p>道生之而德畜之，物形之而器成之，是以万物尊道而贵德。道之尊，德之贵也，夫莫之爵，而恒自然也。道生之、畜之、长之、育之、亭之、毒之、养之、覆之。生而弗有也，为而弗恃也，长而弗宰也，此之谓玄德。</p><p class=\"red\"><a>直译：道生成万物，而用德来畜养它们；物约束万物，而用器来成就它们，所以万物尊崇道而看重德。道的崇高和德的贵重，并不是因为被授予了尊贵的爵位，而是因为从来都让万物得以自然。道生成万物，畜养万物，成长万物，培育万物，安定万物，繁盛万物，供养万物，庇护万物。生成万物而不占有它们，成就万物而不执掌它们，统领万物而不主宰它们，这就是最深的德。</a></p></div>"
    },
    {
        "title": "第52章 塞兑闭门",
        "html": "<div class=\"B1_text\"><p>天下有始，以为天下母。既得其母，以知其子。既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤。启其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明。毋遗身殃，是谓袭常。</p><p class=\"red\"><a>直译：天下万物都有一个共同的本始，它便是天下万物的母亲。得知了这个本始，就能知道天下万物运作的状态。知道了天下万物，再持守住它们的本源，这样终身都不会有危险。塞住向外视听的孔窍，关闭向外行走的门户，终身都不会被搅扰。开启视听的孔窍，处理纷杂的事务，终身都不得救治。能够察见到细微的本源，这就叫“明”。能持守住这个柔弱的本源，这就叫“强”。运用本源之光，辅助万物复归其明，这样就不会给自己留下灾殃，是承袭了道的做法。</a></p></div>"
    },
    {
        "title": "第53章 行于大道",
        "html": "<div class=\"B1_text\"><p>使我挈有知，行于大道，唯迤是畏。大道甚夷，民甚好径。朝甚除，田甚芜，仓甚虚。服文采，带利剑，厌食而资财有余。是谓盗竽！非道也哉。</p><p class=\"red\"><a>直译：假使我对“道”有所认知，那么在奉行大道的时候，害怕的正是曲折延绵的偏邪小路。大路非常平坦，但人们却喜欢走小路。朝堂干净无人处理政事，田地荒芜无人耕种劳作，仓库空空荡荡没有存储。穿着精美纹路的锦绣华服，带着锋利的宝剑，吃着精致的美食到厌烦，钱财货物多到用不完。这不是在倡导大家做盗贼吗？多么的无道啊！</a></p></div>"
    },
    {
        "title": "第54章 修之于身",
        "html": "<div class=\"B1_text\"><p>善建者不拔，善抱者不脱，子孙以祭祀不绝。修之身，其德乃真。修之家，其德有余。修之乡，其德乃长。修之邦，其德乃丰。修之天下，其德乃博。以身观身，以家观家，以乡观乡，以邦观邦，以天下观天下。吾何以知天下之然哉？以此。</p><p class=\"red\"><a>直译：善于建树的人，他的建树不会被移除；善于持守的人，他的持守不会被解脱。子子孙孙得以祭祀不绝。把道贯彻在自身，那么他就具备了真实的德。把道贯彻在家庭，那么他的德就有余。把道贯彻在乡里，那么他的德就得以深远。把道贯彻在国家，那么他的德就得以丰厚。把道贯彻在天下，那么他的德就得以博大。着眼于身，则能察知身的运作状态；着眼于家，则能察知家的运作状态；着眼于乡，则能察知乡的运作状态；着眼于邦，则能察知邦的运作状态；着眼于天下，则能察知天下的运作状态。我是如何知道天下的运作状态呢？就是凭借于此。</a></p></div>"
    },
    {
        "title": "第55章 含德之厚 物壮则老",
        "html": "<div class=\"B1_text\"><p>含德之厚者，比于赤子。蜂虿虺蛇弗螫，攫鸟猛兽弗搏。骨弱筋柔而握固，未知牝牡之会而朘怒，精之至也。终日号而不嚘，和之至也。知和曰常，知常曰明，益生曰祥，心使气曰强。物壮即老，谓之不道，不道早已。</p><p class=\"red\"><a>直译：藏有深厚之德的人，就好像婴儿一样。蛇蝎毒虫不咬刺他，恶鸟猛兽不攻击他。筋骨很柔弱，但是小手却抓握得很牢固。还不知道男女交合之事，生殖器却自然勃起，这是因为精气充盈到了极点。终日号哭，嗓子却不会嘶哑，这是因为身心状态和顺到了极点。认知万物的和顺状态叫做“常”，知道持守这种状态叫做“明”。增益生命叫做妖祥，用心来指使气叫做强妄。事物过于壮盛，就会陷于困顿，这叫不合于道，不合于道就会早早消亡。</a></p></div>"
    },
    {
        "title": "第56章 知者不言",
        "html": "<div class=\"B1_text\"><p>知者弗言，言者弗知。塞其兑，闭其门，和其光，同其尘，挫其锐，解其纷，是谓玄同。故不可得而亲，亦不可得而疏。不可得而利，亦不可得而害。不可得而贵，亦不可得而贱。故为天下贵。</p><p class=\"red\"><a>直译：对道有所认知的人，不会发言施加于人；发言施加于人的人，对道没有认知。塞住向外视听的孔窍，关闭向外行走的门户，收敛耀眼的光芒而至柔和，放低崇高的位置而与微尘齐一，锉去锐利的棱角，解除纷杂的念头，这就叫深层次的统一。所以既不能被亲近，也无法被疏远；既不能被照顾，也无法被妨害；既不能被高看，也无法被轻贱。因此是天下最为尊贵的。</a></p></div>"
    },
    {
        "title": "第57章 无为自化",
        "html": "<div class=\"B1_text\"><p>以正治邦，以奇用兵，以无事取天下。吾何以知其然也哉？夫天下多忌讳，而民弥贫。民多利器，而邦家滋昏。人多智巧，而奇物滋起。法物滋彰，而盗贼多有。是以圣人之言曰：我无为而民自化，我好静而民自正，我无事而民自富，我欲不欲而民自朴。</p><p class=\"red\"><a>直译：用中正之道治理国家，用奇诡之道用兵作战，用无为之道取得天下。我怎么知道是这样的呢？因为天下太多忌讳，人民就会越发贫困。人民好利急功，国家就会越发昏乱。人民显智斗巧，则奇诡之物层出不穷。祭祀之物繁多，盗贼便会越发猖獗。所以圣人说过这样的话：我不对人民施加自己的意志，人民就会自作自化。我喜好清静，人民就会自行归于正态。我不妄为生事，人民就会自行繁荣富足。我收敛自己的欲望，人民就会自行回归惇朴。</a></p></div>"
    },
    {
        "title": "第58章 福祸相倚",
        "html": "<div class=\"B1_text\"><p>其政闷闷，其民惇惇。其政察察，其民缺缺。祸，福之所倚。福，祸之所伏。孰知其极？其无正也。正复为奇，善复为妖。人之迷也，其日固久矣。是以方而不割，廉而不刺，直而不肆，光而不耀。</p><p class=\"red\"><a>直译：政令宽厚，人民就朴实；政令严苛，人民就狡狯。灾祸，托举着幸福；幸福，潜伏着灾祸。怎么知道尽头在哪里？因为失去了中正。中正转变成了邪僻，正当转变成了妖异，人们的迷惑，已经随着时间的推移越发牢固。因此方正但不要割伤人，端方但不要刺伤人，直率但不要任性放肆，光明但不要耀眼夺目。</a></p></div>"
    },
    {
        "title": "第59章 长生久视",
        "html": "<div class=\"B1_text\"><p>治人事天，莫若啬。夫唯啬，是以早服。早服是谓重积德，重积德则无不克，无不克则莫知其极。莫知其极，可以有国。有国之母，可以长久。是谓深根固柢，长生久视之道也。</p><p class=\"red\"><a>直译：处理人事，保养身体，没有比爱惜精力更重要的了。只有爱惜精力，才能早早地顺从于道。早早地顺从于道，就叫积德深厚。积德深厚，就没有什么是不能胜任的，没有什么不能胜任，也就不知道他的能力极限在哪里。不能知道他的能力极限在哪里，就可以保有国家。能够保有国家不灭亡，根本在于有道。有道，就能得以长久。所以把根扎得更深，把本固得更牢，这就是可以得到长远恒久的方法。</a></p></div>"
    },
    {
        "title": "第60章 治国烹鲜",
        "html": "<div class=\"B1_text\"><p>治大国若烹小鲜。以道莅天下，其鬼不神。非其鬼不神也，其神不伤人也。非其神不伤人也，圣人亦弗伤也。夫两不相伤，故德交归焉。</p><p class=\"red\"><a>直译：治理大的国家就好像烹制小鱼一样。用道来治理天下，鬼怪都不再起作用了。不仅鬼怪不再起作用了，神灵也不能伤人了。不仅神灵不能伤人了，圣人也不伤人。神灵与圣人都不伤人，德就会接连回归于百姓了。</a></p></div>"
    },
    {
        "title": "第61章 各得其所",
        "html": "<div class=\"B1_text\"><p>大邦者，下流也，天下之牝，天下之交也。牝恒以静胜牡，为其静也，故宜为下。大邦以下小邦，则取小邦。小邦以下大邦，则取于大邦。故或下以取，或下而取。故大邦者，不过欲兼畜人。小邦者，不过欲入事人。夫皆得其欲，则大者宜为下。</p><p class=\"red\"><a>直译：大的国家，像水一样往下行，处在天下万物生出的地方，万物都汇聚在这里。雌性总是用安静降伏雄性，因为安静，所以适宜处于下位。大的国家用谦下的态度对待小的国家，就能收服小的国家。小的国家用谦下的态度对待大的国家，就能被大的国家所容纳。所以大的国家，不过是想兼并畜养小的国家；小的国家，不过是想被大的国家所容纳。双方都能得偿所愿，那么大的国家尤其应该处下。</a></p></div>"
    },
    {
        "title": "第62章 美言可市",
        "html": "<div class=\"B1_text\"><p>道者，万物之注也，善人之宝也，不善人之所保也。美言可以市，尊行可以贺人。人之不善也，何弃之有。故立天子，置三卿，虽有拱之璧以先驷马，不若坐而进此。古之所以贵此者何也？不谓求以得，有罪以免与？故为天下贵。</p><p class=\"red\"><a>直译：道，是天地万物的共同归属，是有道者视若珍宝的东西，也是无道者得到保全的东西。嘉美之言可以用来做交易，尊贵之礼可以用来庆贺他人。人们虽说无道，但又何必放弃他们呢。所以立位天子，设置三卿，即使用拱璧在先，驷马在后这样的隆重礼仪，也还不如坐下来进献道给他们。古时候为什么如此看重道呢？不正是说有求于它，就能得到；有了罪过，可以得免吗？所以它是天下最尊贵的东西。</a></p></div>"
    },
    {
        "title": "第63章 为大于细 多易必多难",
        "html": "<div class=\"B1_text\"><p>为无为，事无事，味无味。大小，多少，报怨以德。图难乎其易也，为大乎其细也。天下之难作于易，天下之大作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终于无难。</p><p class=\"red\"><a>直译：用“无为”来作为，用“无事”来处事，用“无味”来品味。这样大的问题会变小，多的事情会变少，深厚之德可以平息怨恨。要想谋划艰难的事情，就要从容易的地方着手进行；要想成就大的功业，就要从细微的地方开始做起。天下的难事都产生于容易的事；天下的大事都兴起于细微的事。因此圣人从来不做大的事情，因而最终能做成大的事情。轻易地许下承诺，必然很少能做到守信，把什么事情都看得很容易，必然经常会碰到困难。所以圣人做事总是犹豫踌躇，好像面对很难的事情一样，因此最终不会碰到困难。</a></p></div>"
    },
    {
        "title": "第64章 慎终如始 合抱之木",
        "html": "<div class=\"B1_text\"><p>其安也，易持也。其未兆也，易谋也。其脆也，易破也。其微也，易散也。为之于其未有也，治之于其未乱也。合抱之木，生于毫末。九层之台，作于羸土。百仞之高，始于足下。为之者败之，执之者失之。是以圣人无为也，故无败也，无执也，故无失也。民之从事也，恒于其成而败之。故慎终若始，则无败事矣。是以圣人欲不欲，而不贵难得之货。学不学，而复众人之所过。能辅万物之自然，而弗敢为。</p><p class=\"red\"><a>直译：状态安稳，就容易持有。迹象未显，就容易谋划。脆弱的时候，就容易破开。细小的时候，就容易消散。在事情还没有发生时开始行动，在局势还没有混乱时着手治理。环抱的大树，生发于微小的种子。九层的高台，兴作于卑弱的薄土。百仞的高度，起始于脚踩的底下。强行施为，就会失败；强行掌控，就会失去。所以圣人不强施为，因此不会失败；不强掌控，因此不会失去。人们做事情，总是败在事成的阶段。因此对待事情的终结，也能像对待事情的开始一样谨慎，就不会有失败的事了。所以圣人以“不欲”作为自己想要的状态，而不会看重难得的财货；以“不学”作为自己所学，而让众人从偏斜复归于正态。能辅助万物回归于自然的状态，而不敢妄自作为。</a></p></div>"
    },
    {
        "title": "第65章 将以愚之",
        "html": "<div class=\"B1_text\"><p>故曰：为道者非以明民也，将以愚之也。民之难治也，以其智也。故以智治邦，邦之贼也，以不智治邦，邦之德也。恒知此两者，亦稽式也。恒知稽式，此谓玄德。玄德深矣，远矣，与物反矣，乃至大顺。</p><p class=\"red\"><a>直译：所以说，用道治理国家的君王，不会让人民开启智巧，而是让他们处于浑然不觉的无知状态。人民之所以难以治理，正是因为他们智巧很多。因此用智巧机心来治理国家，是国家的灾祸，用愚人之心来治理国家，是国家的福德。深刻地认知这两者，也就是知道了治国的法则。持久地贯彻这个法则，就叫最深的德。最深的德，深不可测而又广远长久，与万物的运作是相反的方向，这样才能平复它们的偏差，辅助它们归顺于道。</a></p></div>"
    },
    {
        "title": "第66章 以其无争",
        "html": "<div class=\"B1_text\"><p>江海之所以能为百谷王者，以其善下之，是以能为百谷王。是以圣人之欲上民也，必以其言下之，其欲先民也，必以其身后之。故居前而民弗害也，居上而民弗重也，天下乐推而弗厌也。非以其无争与？故天下莫能与争。</p><p class=\"red\"><a>直译：江海之所以能成为天下水流的归往之处，因为它高明地处在低下的位置，所以能成为天下水流的归往之处。所以圣人想要处在人民的上面，就必须要在言辞上谦下；想要处在人民的前面，就必须要把自身利益放在他们的后面。所以圣人处在人民的前面，但人民不会认为受到妨害；圣人处在人民的上面，但人民不会认为受到负累。天下人都乐于推戴他，而不会厌弃他。不正是因为他不与人争吗？所以天下没有谁可以与他相争。</a></p></div>"
    },
    {
        "title": "第67章 持保三宝",
        "html": "<div class=\"B1_text\"><p>天下皆谓我大，大而不肖。夫唯不肖，故能大。若肖，久矣其细也夫。我恒有三宝，持而宝之。一曰慈，二曰俭，三曰不敢为天下先。夫慈，故能勇，俭，故能广，不敢为天下先，故能为成事长。今舍其慈，且勇，舍其俭，且广，舍其后，且先，则必死矣。夫慈，以战则胜，以守则固。天将建之，如以慈垣之。</p><p class=\"red\"><a>直译：天下人都说我太宽泛（不着边）了，宽泛到不像任何具体的东西。正是因为不像任何具体的东西，才能博大无边，如果和具体的东西相像，那早就很渺小了。我一直都有三样宝贝，持守着它而不敢有失，一个叫做“慈”，一个叫做“俭”，一个叫做“不敢为天下先”。慈，所以能够勇敢；俭，所以能够宽广；不敢为天下先，所以能够领导大家有所成就。如今舍弃了慈，而求勇敢；舍弃了俭，而求广博；舍弃了后，而求居前，这样就必然会走向灭亡。慈，用以作战则无不能胜，用于防守则无不能固。所以上天将要成就一个人，这才会让他恒有慈德。</a></p></div>"
    },
    {
        "title": "第68章 不争之德",
        "html": "<div class=\"B1_text\"><p>善为士者不武，善战者不怒，善胜敌者弗与，善用人者为之下。是谓不争之德，是谓用人，是谓配天，古之极也。</p><p class=\"red\"><a>直译：善于做统帅的人，不会自逞勇武。善于作战的人，不会被激怒。善于战胜敌人的人，不会与敌人正面相抗。善于用人的人，对人态度谦下。这叫不争的德性，这叫善于用人，这叫与天道相匹配，这是自古以来的最高准则。</a></p></div>"
    },
    {
        "title": "第69章 哀者胜矣",
        "html": "<div class=\"B1_text\"><p>用兵有言曰：吾不敢为主而为客，吾不敢进寸而退尺。是谓行无行，攘无臂，执无兵，乃无敌矣。祸莫大于无适，无适近亡吾宝矣。故称兵相若，则哀者胜矣。</p><p class=\"red\"><a>直译：用兵的人说过这样的话，我不敢主动进犯而是被动防守，我不敢前进一寸而是后退一尺。这就是说，行军不成阵列，士气不得提振，手中不拿兵器，这样便能天下无敌了。最大的祸患，是不知道节制，不知道节制，几乎让我丧失了“道”。所以当采取军事行动的双方兵力相当的时候，悲哀的一方获胜。</a></p></div>"
    },
    {
        "title": "第70章 被褐怀玉",
        "html": "<div class=\"B1_text\"><p>吾言甚易知也，甚易行也。而人莫之能知也，而莫之能行也。言有宗，事有君。夫唯无知也，是以不我知。知我者希，则我贵矣。是以圣人被褐而怀玉。</p><p class=\"red\"><a>直译：我说的话非常容易理解，也非常容易实行。但是大家却都听不明白，也不能实行。我说的话，都有凭有据；我做的事，都有准则可依。只有认知不到我说话的那个凭据，认知不到我做事的那个准则，才会不能了解我。了解我的人很少，那么我就尤其珍贵。所以圣人外面穿着粗布衣服，怀中却抱着无价的美玉。</a></p></div>"
    },
    {
        "title": "第71章 知不知矣",
        "html": "<div class=\"B1_text\"><p>知不知，尚矣。不知不知，病矣。是以圣人之不病，以其病病，是以不病。</p><p class=\"red\"><a>直译：知道自己有所不能知，是值得推崇的。不知道自己有所不能知，这就是弊病了。所以圣人不会有弊病，是因为把“全知全能”当成是弊病，因此不会有弊病。</a></p></div>"
    },
    {
        "title": "第72章 自知自爱",
        "html": "<div class=\"B1_text\"><p>民之不畏威，则大威将至矣。毋狭其所居，毋厌其所生。夫唯弗厌，是以不厌。是以圣人自知而不自见也，自爱而不自贵也，故去彼取此。</p><p class=\"red\"><a>直译：当人民不再畏惧强权威压的时候，大的反抗就要到来了。不要让人民的居处越来越狭小，不要让人民的生存越来越窘迫。只有不压迫人民，人民才不会憎恶。所以圣人有自知之明，而不会施加于人；圣人爱惜自身，而不会自作高贵。因此去除后者，而取用前者。</a></p></div>"
    },
    {
        "title": "第73章 天网恢恢",
        "html": "<div class=\"B1_text\"><p>勇于敢则杀，勇于不敢则活。此两者，或利或害。天之所恶，孰知其故？天之道，不战而善胜，不言而善应，不召而自来，坦而善谋。天网恢恢，疏而不失。</p><p class=\"red\"><a>直译：敢于进犯就会身死，敢于退让则会存活。这两种行为，一个让人得益，一个让人受害。上天好像尤其厌恶刚强，谁知道这是什么缘故呢？天道的规律，是不征战而得到胜利，不下令而得到回应，不征召而万物自来归附，坦荡而善于谋算。天道的规则就如同一张宽大的网，但网眼虽然稀疏，却没有谁能钻得过去。</a></p></div>"
    },
    {
        "title": "第74章 民不畏死",
        "html": "<div class=\"B1_text\"><p>若民恒且不畏死，奈何以杀惧之也？若民恒且畏死，而为奇者,吾得而杀之，夫孰敢矣。若民恒且必畏死，则恒有司杀者。夫代司杀者杀，是代大匠斲也。夫代大匠斲者，则希不伤其手矣。</p><p class=\"red\"><a>直译：如果人民一直以来都是不害怕死亡的，那又何必用死亡来恐吓他们呢？如果人民一直以来都是害怕死亡的，对于违法乱禁者，我抓来杀掉，又有谁还敢于反抗呢？就算人民一直以来都是害怕死亡的，那也从来都有专门掌管死亡的存在。代替掌管死亡的存在来杀人，就好像代替技术高明的工匠砍削木头一样。代替技术高明的工匠砍削木头，那么很少有不伤到自己手的。</a></p></div>"
    },
    {
        "title": "第75章 民之轻死",
        "html": "<div class=\"B1_text\"><p>人之饥也，以其取食税之多也，是以饥。百姓之不治也，以其上有以为也，是以不治。民之轻死，以其求生之厚也，是以轻死。夫唯无以生为者，是贤贵生。</p><p class=\"red\"><a>直译：人民之所以饥饿，是因为拿出太多粮食来上税，因此才会饥饿。百姓之所以不能治理，是因为君上妄作有为，因此不能治理。人民之所以看轻死亡，是因为他们求生的意愿非常强烈，因此才看轻死亡。只有不以奉养生命为务的人，才是真正掌握了珍重生命的精髓。</a></p></div>"
    },
    {
        "title": "第76章 柔弱居上",
        "html": "<div class=\"B1_text\"><p>人之生也柔弱，其死也筋仞坚强。万物草木之生也柔脆，其死也枯槁。故曰：坚强者死之徒也，柔弱细微者生之徒也。兵强则不胜，木强则烘。强大居下，柔弱居上。</p><p class=\"red\"><a>直译：人活着时身体柔弱，但死了就筋骨僵硬，变得坚强了。包括草木在内的万物，活着的时候都是柔软而脆弱的，死了以后就变得干枯强硬。所以说，坚强的东西归属于死的那一类，而柔弱细微的东西，归属于生的那一类。军队骄矜逞强就不能胜利，树木坚强干硬只会被取用烧火。所以强大的东西居于下位，而柔弱的东西居于上位。</a></p></div>"
    },
    {
        "title": "第77章 损有余而补不足 为而弗有",
        "html": "<div class=\"B1_text\"><p>天之道，犹张弓者也。高者抑之，下者举之，有余者损之，不足者补之。故天之道，损有余而补不足。人之道则不然，损不足而奉有余。孰能有余而有以取奉于天者乎？唯有道者乎？是以圣人为而弗有，成功而弗居也。若此，其不欲见贤也。</p><p class=\"red\"><a>直译：天道的规则，就好像给松弛的弓上弦一样，压抑高位的，而抬举低位的，多余的进行减损，不足的进行补充。所以天道是减损有余而补充不足。但人道就不一样了，减损不足的，而供奉有余的。谁能在有余时，而把多余的取出献奉给天呢？只有有道的人。所以圣人有所成就而不占有，建立功业而不居功。这样做，是因为不想展示自己贤于众人。</a></p></div>"
    },
    {
        "title": "第78章 弱之胜强",
        "html": "<div class=\"B1_text\"><p>天下莫柔弱于水，而攻坚强者莫之能胜也，以其无以易之也。柔之胜刚，弱之胜强，天下莫弗知也，而莫能行也。故圣人之言云，曰：受邦之垢，是谓社稷之主。受邦之不祥，是为天下之王。正言若反。</p><p class=\"red\"><a>直译：天下没有比水更柔弱的，但是攻克坚强的东西却没有谁能胜过它。因为它的柔弱没有什么能够改变。柔战胜刚，弱战胜强，天下没有人不知道这个道理，但是却没有谁能做得到。所以圣人的话是这么说的：能够承担国家的屈辱，才可以说是国家的君主；能够承担国家的不祥，才可以说是天下的君王。行正道的话，听着就好像说反了一样。</a></p></div>"
    },
    {
        "title": "第79章 和大怨 恒与善人",
        "html": "<div class=\"B1_text\"><p>和大怨，必有余怨，焉可以为善？是以圣人执右契,而不以责于人。故有德司契，无德司彻。夫天道无亲，恒与善人。</p><p class=\"red\"><a>直译：调和大的怨恨，必然有余怨不能消除，又怎么能说是妥善的处理方法呢？所以圣人持有债券，但从不向人讨还。有德之人就像债券的保管人一样，持有但不去讨还；无德之人就像掌管税收的税吏一般，分毫都不能差少。天道不会偏爱谁，它从来都只会回馈有道之人。</a></p></div>"
    },
    {
        "title": "第80章 小国寡民",
        "html": "<div class=\"B1_text\"><p>小邦寡民，使有十百人之器而毋用，使民重死而远徙。有舟车，无所乘之。有甲兵，无所陈之。使民复结绳而用之。甘其食，美其服，乐其俗，安其居。邻邦相望，鸡狗之声相闻，民至老死，不相往来。</p><p class=\"red\"><a>直译：国家很小，人民很少。就算有多人操作的大型器具也不会使用，让人民看重死亡而不迁徙。有船只车辆，但是没有人乘坐。有衣甲兵器，但是不知道用来对付谁。让人民回归到可用结绳来记事的简单生活。人民以其食为甘，以其服为美，以其俗为乐，以其居为安。邻国之间互相看得到，鸡鸣狗叫互相听得到，但两国的人民却直到老死，都不互相往来。</a></p></div>"
    },
    {
        "title": "第81章 信言不美 为而弗争",
        "html": "<div class=\"B1_text\"><p>信言不美，美言不信。知者不博，博者不知。善者不多，多者不善。圣人无积，既以为人，己愈有。既以予人矣，己愈多。故天之道，利而不害。人之道，为而弗争。</p><p class=\"red\"><a>直译：真实的言语不华美，华美的言语不真实。对道有所认知的人，不会追求见闻广博；追求见闻广博的人，对道没有认知。有道的人，不会有过多的欲求；欲求无度的人，不是有道之人。圣人不积累过多，而是都用来成就他人，自己就越富有；都拿来给予他人，自己就越富足。所以天道的规则，是有利于万物而不侵害；人间的规则，是有所成就而不相争。</a></p></div>"
    }
]