[
    {
        "title":"",
        "html":"<div class=\"B1_text\"><p>1973年，长沙马王堆汉墓出土了一批古书，其中就包括我们盛行四海的《道德经》，分甲乙两个版本。结果经过整理复原后发现，该版本与流行的传世版本《道德经》，存在着一些差异。这些差异大多只在只字片语之间，但意义却有千差万别之远。</p><p>如“非常道”对比“非恒道”；“大器晚成”对比“大器免成”；“多言数穷”对比“多闻数穷”；“执古之道”对比“执今之道”；“道隐无名”对比“道褒无名”，“其中有精”对比“其中有情”，不胜枚举。</p><p>而从整体来看，帛书版本的《道德经》明显体系更加圆融，脉络更加清晰，一些有差异的地方，也是帛书版句义更加顺畅，更加符合道家的宗旨。特别是帛书版的《道德经》，更具有现实意义，更能适用于当下。然而直到今天为止，学术界对这个问题还是一种回避的态度，大部分专家学者依然采用被篡改过的传世版本来进行解读。</p><p>2017年，我在知乎上发表了一篇文章，标题是“被篡改的《道德经》，隐藏着什么样的秘密？”获得了三万多赞，一千多条评论，可见大家对这个话题还是非常感兴趣的。因为在马王堆帛书出土以后，《道德经》被后人改动过，已经是不争的事实，对于《道德经》的原本真相，所有人好奇心都很强。</p><p>读经首先要正本，我们要读的是更加贴近原本的老子著《道德经》，而不是经过篡改涂抹的某人撰《道德经》。经过我十多年的研究整理，以马王堆帛书<span>老子甲</span>、乙本为底本，参照王弼注本、河上公注本等传世版本，参考当代注家如高明教授、陈鼓应教授的解读，逐章对帛书本与传世本进行对比，分析它们的不同之处，并进行解读。欢迎大家关注，也欢迎大家参与探讨。</p><p><b>建议收藏，欢迎追更。</b></p><ol><li><b>新增：长沙马王堆帛书老子甲、乙本（文物原图版-中华书局），欢迎加入讨论群领取PDF电子版；</b></li><li><b>重新校定了《道德经》帛书拼音版（2021.12.14最新），更正部分失误，可作诵读之用。欢迎加入讨论群领取WORD版本：</b></li></ol><div>​</span>www.taoistcn.com/news/aboutus/cate_id/66.html</span></span><span style=\"height:60px;\"><hr><figure><noscript></noscript></figure><p>第一章：</p><p><b>帛书版：</b></p><p>道可道也，非恒道也①。名可名也，非恒名也。无名，万物之始也②。有名，万物之母也。故恒无欲也，以观其妙，恒有欲也，以观其所徼。两者同出，异名同谓③，玄之又玄，众妙之门。</p><p><b>传世版：</b></p><p>道可道，非常道。名可名，非常名。无名天地之始，有名万物之母。故常无欲，以观其妙；常有欲，以观其徼。此两者同出而异名，同谓之玄，玄之又玄，众妙之门。</p><p><b>版本差异：</b></p><p>①非恒道也：传世版为“非常道也”。为避汉文帝刘恒的讳，“恒”被改成了“常”。如果把“常”字理解为“恒常”，则恒、常二字无差，但很多人把“常”理解为寻常、一般意义上的、普通、通常，这就完全失去“恒”的字义了。</p><p>②万物之始也：传世版改成了“天地之始”，其实在《道德经》中天地与万物同属。</p><p>③异名同谓：传世版是“同谓之玄”。“谓”本义是“告诉”，“异名同谓”是指名称不一样，可告诉（诉说）的东西一样。而这个东西在传世版中变成了“玄”，把道学变成了玄学，由此而始。</p><p><b>直译：</b></p><p>道是可以被言说的，但言说出来的道，并不是那个恒久常存的道。名是可以被定义的，但定义而来的名，并不是那个恒久常存的名。无形无名，是造生万物的起始；有形有名，是孕育万物的母亲。当我们处于无欲的状态时，可以得观从无生有之妙；当我们处于有欲的状态时，可以得观万物成形之徼。有欲无欲，同出于人；有名无名，同出于道。它们虽然名称不一样，可说的都是同一个道理。它们互相缠绕，来回切换，无限延伸。这种“玄”之又“玄”的形态是我们认知天下万物、认知道的无上法门，也是道生天下万物的神妙之门。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"></div><p>第二章：</p><p><b>帛书版：</b></p><p>天下皆知美之为美，恶已。皆知善，斯不善矣①。有，无之相生也②。难，易之相成也。长，短之相形也。高，下之相盈也③。音，声之相和也。先，后之相随，恒也。是以圣人居无为之事，行不言之教。万物作而弗始也④，为而弗恃也，成功而弗居也。夫唯弗居，是以弗去。</p><p><b>传世版：</b></p><p>天下皆知美之为美，斯恶已。皆知善之为善，斯不善已。故有无相生，难易相成，长短相较，高下相倾，音声相和，前后相随。是以圣人处无为之事，行不言之教；万物作焉而不辞，生而不有，为而不恃，功成而弗居。夫唯弗居，是以不去。</p><p><b>版本差异：</b></p><p>①斯不善矣：传世版是“斯不善已”，“矣”、“已”二字虽可通用，但本章中是各自为用，意义并不相同。“已”有“太多、太过”的意思。</p><p>②有，无之相生也：传世版句式为“<span>有无相生</span>”，“相”成了“相互”的意思。而帛书版句式为“有，无之相生也”，“相”是“表示一方对另一方的动作”，是单向的而不是相互的，比如“相劝”、“相问”。</p><p>③高，下之相盈也：传世版为“高下相倾”。下盈满为高，可高无法盈满成下，所以“盈”字才被改成了“倾”字，可以互相颠倒成就。</p><p>④万物作而弗始也：传世版为“万物作焉而不辞”。“始”作动词为“滋生”的意思，“弗始”表示“不另生事、不作干涉”，正是“处无为之事”。而“不辞”，河上公注：“不辞谢而逆止。”“辞”本义为诉讼、争讼之言；“不辞”即为不违不逆，不拂扰万物的兴起。“弗始”表达的重点在于不生事，“不辞”表达的重点在于不违逆，此处“弗始”意义更为贴切。</p><p><b>直译：</b></p><p>天下人都知道美之所以为美，恶就已经太多了。天下人都知道什么是善，这里（斯）不善已经存在了。“有”是由“无”生成的；“难”是由“易”成就的；“长”是由“短”形成的；“高”是由“下”积满而成的；“音”是由“声”应和而起的；“先”是由“后”跟随才有的。这是一个恒定不变的规律。所以圣人以无为的方式行事，以不言的方式设教。万物欣欣向荣而不干涉它们，化育万物而不命令它们，成就功业也不去占有。只有不去占有这成功，成功才会一直相随，而不会离去。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三章：</p><p><b>帛书版：</b></p><p>不上贤①，使民不争。不贵难得之货，使民不为盗。不见可欲，使民不乱。是以圣人之治也，虚其心，实其腹，弱其志，强其骨。恒使民无知无欲也，使夫智不敢。弗为而已，则无不治矣。</p><p><b>传世版：</b></p><p>不尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。是以圣人之治，虚其心，实其腹，弱其志，强其骨。常使民无知无欲。使夫智者不敢为也。为无为，则无不治。</p><p><b>版本差异：</b></p><p>①不上贤：传世版为“不尚贤”。“上”字本义是“高处、上面”，“不上贤”，是指不给予贤人高人一等的地位。而“尚”字本义是“推崇、注重”，虽说二字相通，但表达的侧重点还是有所不同。《道德经》是注重让人具有贤才的，所以才会讲“事善能，动善时”，讲“善人者，善人之师”，讲“善行”、“善言”、“善为道”，只是说不要“见贤”，显摆自己的贤才，更不要因为有贤才就自伐自矜，认为高人一等。而本章要表达的意思，正是不要主动拔高贤人的地位，诱使他们自认为高人一等。</p><p><b>直译：</b></p><p>不拔高贤人的地位，使人民不互相争斗。不看重难得的财货，使人民不偷不盗。不展现容易诱发欲望的东西，使人民不作乱。所以圣人治理天下，让人民内心虚静，而腹内充实；意气减弱，而筋骨强健。总是让人民处于质朴自然而不妄作的状态，让那些善于使用智巧的人不敢有所行动。用无为之道治国，天下就没有治理不好的国家。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第四章：</p><p><b>帛书版：</b></p><p>道盅①，而用之又弗盈也。渊呵，似万物之宗。挫其锐，解其纷，和其光，同其尘。湛呵，似或存。吾不知其谁之子也，象帝之先。</p><p><b>传世版：</b></p><p>道冲而用之或不盈，渊兮似万物之宗；挫其锐，解其纷，和其光，同其尘，湛兮似或存。吾不知谁之子，象帝之先。</p><p><b>版本差异：</b></p><p>①道盅：传世版为“道冲”。“冲”的古字为盅，代表“空虚的容器”。“冲”字虽也同样有空虚之意，但容易让人误会为动词，解出“摇涌、冲涌”之意。</p><p><b>直译：</b></p><p>道就好像一个空虚的容器一样，但它的作用无穷无尽，因为这个容器永远也不会盈满。它是那么的幽深啊，好像万物的宗主。它锉去万物锋锐的棱角，理顺纷扰与杂乱，把耀眼的光调节至柔和，把万物与微尘相齐一。它是那么的澄澈啊，若隐若存。我不知道它是由谁所生的，只知道在最早的有形之物出现以前，它就已经存在了。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第五章：</p><p><b>帛书版：</b></p><p>天地不仁，以万物为刍狗。圣人不仁，以百姓为刍狗。天地之间，其犹橐籥与！虚而不屈，动而愈出。多闻数穷①，不若守于中。</p><p><b>传世版：</b></p><p>天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。天地之间，其犹<span>橐龠</span>乎﹖虚而不屈，动而愈出。多言数穷，不如守中。</p><p><b>版本差异：</b></p><p>①多闻数穷：传世版改为“多言数穷”。多闻是指增长见闻见知，而多言是指言谈陈述，意义相差甚远。从《道德经》中“博者不知、知者不博”、“不出于户，以知天下”、“塞其兑，闭其门”等语句来看，“多闻数穷”更为契合。</p><p><b>直译：</b></p><p>天地没有所谓的仁爱之心，把万物当作祭祀时用的草狗来看待。圣人也没有所谓的仁爱之心，把百姓当作祭祀时用的草狗来看待。天地之间，不是好像一个大风箱一样吗？空虚而不竭尽，鼓动而风愈出。越向外追求见闻见知，内心就会越发失去对道的把握，所以不如安守于中。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第六章：</p><p><b>帛书版：</b></p><p>谷神不死，是谓玄牝。玄牝之门，是谓天地之根。绵绵呵若存，用之不勤。</p><p><b>传世版：</b></p><p>谷神不死，是谓玄牝。玄牝之门，是谓天地根。绵绵若存，用之不勤。</p><p><b>版本差异：</b></p><p>无</p><p><b>直译：</b></p><p>空虚永存，运行不止，如玄奥的生殖之门一样，造生天地万物。这个生殖之门，是天地得以产生的根源。它的运行就像丝一样细微，同时又连绵不断，无论怎么使用，都不会竭尽。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第七章：</p><p><b>帛书版：</b></p><p>天长地久。天地之所以能长且久者，以其不自生也，故能长生。是以圣人退其身而身先，外其身而身存。不以其无私与？故能成其私。</p><p><b>传世版：</b></p><p>天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人后其身而身先；外其身而身存。非以其无私邪，故能成其私。</p><p><b>版本差异：</b></p><p>无</p><p><b>直译：</b></p><p>天地恒长恒久。天地之所以能够长久，正是因为天地不生长自己，所以才能得以长久。因此圣人常把自身放在最后，但却能站在最前方领导众人；并不一心为自己谋取福利，却能得到天下人的保护和拥戴。这不正是因为圣人无私吗？反而成全了他自己。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第八章：</p><p><b>帛书版：</b></p><p>上善似水。水善利万物而有静①，居众人之所恶，故几于道矣。居善地，心善渊，予善天②，言善信，政善治，事善能，动善时。夫唯不争，故无尤。</p><p><b>传世版：</b></p><p>上善若水。水善利万物而不争，处众人之所恶，故几于道。居善地，心善渊，与善仁，言善信，正善治，事善能，动善时。夫唯不争，故无尤。</p><p><b>版本差异：</b></p><p>①有静：传世版为“不争”。此处“利而不争”则有为的意味居多，“利而有静”，则无为的意味居多，故取“有静”。</p><p>②予善天：传世版为“与善仁”。“予”和“与”都有“给予”的意思，但“天”与“仁”相差甚远。《道德经》全文对“仁义”都并非持肯定态度，且第五章直言“天地不仁”、“圣人不仁”，此处当取“予善天”，给予也要讲究顺天应时，符合对方所需。</p><p><b>直译：</b></p><p>最上乘的“善”就好像水一样。水之“善”在于，有利于万物而又安然守静，处在众人都厌恶的地方，所以与道很接近了。居住之“善”，在于大地之上。用心之“善”，在于渊博宽广。施予之“善”，在于顺天应物。言语之“善”，在于坦诚有信。为政之“善”，在于安定无为。处事之“善”，在于发挥所长。行动之“善”，在于把握时机。正是因为不争，所以从来不会有过失。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第九章：</p><p><b>帛书版：</b></p><p>持而盈之，不若其已。揣而锐之，不可长保也。金玉盈室，莫之守也。贵富而骄，自遗咎也。功遂身退，天之道也。</p><p><b>传世版：</b></p><p>持而盈之，不如其已；揣而棁之，不可长保。金玉满堂，莫之能守；富贵而骄，自遗其咎。功成身退，天之道也。</p><p><b>版本差异：</b></p><p>无</p><p><b>直译：</b></p><p>把持住盈满，不如赶紧停下来。锻打至尖锐，无法保持长久。金玉塞满屋子，不能守护得住。富贵而骄纵，徒留祸端。功业成就了，事情做成了，就不要再牢牢把持，而是退去放下，这才是符合天道的做法。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十章：</p><p><b>帛书版：</b></p><p>载营魄抱一，能毋离乎？抟气致柔，能婴儿乎？涤除玄鉴，能毋疵乎？<span>爱民治国</span>，能毋以智乎①？天门启阖，能为雌乎？明白四达，能毋以知乎②？生之畜之，生而弗有③，长而弗宰也，是谓玄德。</p><p><b>传世版：</b></p><p>载营魄抱一，能无离乎？专气致柔，能婴儿乎？涤除玄览，能无疵乎？爱国治民，能无知乎？天门开阖，能为雌乎？明白四达，能无为乎？生之，畜之。生而不有，为而不恃，长而不宰，是谓玄德。</p><p><b>版本差异：</b></p><p>①能毋以智乎：传世版为“能无知乎”。“毋以智”是“不使用智巧”的意思，与《道德经》第六十五章“以智治邦，邦之贼也，以不智治邦，邦之德也”相呼应。而“爱民治国，能无知乎”，就显得有些不知所云了。此处应取“能毋以智乎”。</p><p>②能毋以知乎：与前文“毋以智”格式对应，表示“不使用知见”的意思。与《道德经》第四十七章“不出于户，以知天下……不行而知，不见而明”相呼应。传世版为“能无为乎”，用在此处缺乏逻辑关联，应取“能毋以知乎”。</p><p>③生而弗有：传世版为“生而不有，为而不恃”，多加了一个“为而不恃”。应该是为了和《道德经》第五十一章讲“玄德”的部分相统一，五十一原文为“生而弗有也，为而弗恃也，长而弗宰也，此之谓玄德”。不过本章突出致虚无为，并没有讲成就万物的“为”，所以取帛书版内容。</p><p><b>直译：</b></p><p>身体和魂魄合抱守一，能做到不分离吗？结聚精气而致柔和，能做到像婴儿一样吗？清洗杂念，涤荡心镜，能做到没有瑕疵吗？爱护百姓，治理国家，能做到不使用智巧吗？万物生灭，同出一门，能做到柔弱安静，生之畜之吗？知晓天下，通达四方，能做到不通过见知吗？生成万物，畜养万物。生养万物而不占有它们，统领万物而不主宰它们，这就是最深的德。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十一章：</p><p><b>帛书版：</b></p><p>卅辐同一毂，当其无，有车之用也。埏埴为器，当其无，有埴器之用也。凿户牖，当其无，有室之用也。故有之以为利，无之以为用。</p><p><b>传世版：</b></p><p>三十辐，共一毂，当其无，有车之用。埏埴以为器，当其无，有器之用。凿户牖以为室，当其无，有室之用。故有之以为利，无之以为用。</p><p><b>版本差异：</b></p><p>无</p><p><b>直译：</b></p><p>三十根辐条共同汇集在一个车轮毂上，正因为轮毂有了中空的地方，才有车的作用。揉和泥土制作器具，正因为泥土有了中空的地方，才有器具的作用。开凿门窗，正因为墙壁有了中空的地方，才有房屋的作用。所以说，有之所以可以给人便利，是因为空无在发挥作用。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十二章：</p><p><b>帛书版：</b></p><p>五色使人目盲。驰骋田猎使人心发狂①。难得之货，使人之行妨。五味使人之口爽。五音使人之耳聋。是以圣人之治也②，为腹不为目，故去彼取此。</p><p><b>传世版：</b></p><p>五色令人目盲，五音令人耳聋，五味令人口爽，驰骋畋猎令人心发狂，难得之货令人行妨。是以圣人为腹不为目，故去彼取此。</p><p><b>版本差异：</b></p><p>①驰骋田猎使人心发狂：从该句开始，传世版更改了语句顺序，显得更加工整。</p><p>②是以圣人之治也：传世版去掉了“之治”二字，意义改变很大。“圣人之治”，对应《道德经》第三章：“是以圣人之治也，虚其心，实其腹，弱其志，强其骨。”是说圣人如何治理天下，属治国方略。而经此一改，就成了个人修养，描述的是两个层面的问题。</p><p><b>直译：</b></p><p>绚丽色彩，会让人视力受损，不能正确地辨识事物。纵情追逐猎物，会让人心态受损，心浮气躁，狂乱难收。一味积累财货，会妨碍人行正道。厚味佳肴，会让人味觉受损，失去品味淡然的能力。美妙乐曲，会损害人的听力，让人听而不闻，昏聩莫名。因此圣人治理天下，只会注重经营民众赖以生存的根本，而不会偏向于声色浮华。所以摒弃那些让人偏离正道的物欲，而是取本守根。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十三章：</p><p><b>帛书版：</b></p><p>宠辱若惊，贵大患若身。何谓宠辱若惊？宠之为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身也。及吾无身，有何患。故贵为身于为天下①，若可以托天下矣②；爱以身为天下，如可以寄天下矣③。</p><p><b>传世版：</b></p><p>宠辱若惊，贵大患若身。何谓宠辱若惊﹖宠为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身﹖吾所以有大患者，为吾有身，及吾无身，吾有何患﹖故贵以身为天下，若可寄天下；爱以身为天下，若可托天下。</p><p><b>版本差异：</b></p><p>①贵为身于为天下：传世版为“贵以身为天下”，与帛书版意义相差甚大。“贵为身于为天下”是指“把治理身体看得比治理天下更加重要”，而“贵以身为天下”是指“珍贵自己的身体是为了治理天下”。</p><p>②若可以托天下矣：传世版为“寄天下”。“托”有“托举、承负”之意，而“寄”为“依赖、依附”的意思，二者意义完全相反。</p><p>③如可以寄天下矣：传世版为“<span>托天下</span>”。更换了“寄”与“托”二字，也就完全颠倒了本章所要表达的意思。</p><p><b>直译：</b></p><p>受到恩宠或折辱都如同惊吓，重视大的忧患比得上自己的性命。什么叫“宠辱若惊”呢？受宠是因为把自身放在下位，因此得到来自上位的恩宠就会惊喜，失去了又是惊吓，这叫“宠辱若惊”。什么叫“重视大的忧患比得上自己的性命”呢？我之所以有大的忧患，正是因为我有自己的身体，如果连身体都丧失了，又还有什么可忧患的呢！所以把养护自己的身体看得比治理天下更加重要，这样就可以把天下托付给他了。如果喜好不顾惜身体而去治理天下，那么终也不过是天下的附庸而已。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十四章：</p><p><b>帛书版：</b></p><p>视之而弗见，名之曰微①。听之而弗闻，名之曰希。捪之而弗得，名之曰夷。三者不可致诘，故混而为一。一者，其上不皦，其下不昧。绳绳不可名也，复归于无物。是谓无状之状，无物之象，是谓忽恍。随而不见其后，迎而不见其首。执今之道②，以御今之有，以知古始。是谓道纪。</p><p><b>传世版：</b></p><p>视之不见名曰夷，听之不闻名曰希，搏之不得名曰微。此三者，不可致诘，故混而为一。其上不皦，其下不昧。绳绳不可名，复归于无物。是谓无状之状，无物之象，是谓惚恍。迎之不见其首，随之不见其后。执古之道，以御今之有。能知古始，是谓道纪。</p><p><b>版本差异：</b></p><p>①微、夷：传世版把“微”和“夷”调换了位置。包括“随而不见其后，迎而不见其首”也被颠倒语序。</p><p>②执今之道：传世版改成“执古之道”，严重破坏了《道德经》文意和道家主旨。结合本章上下文来看，正是因为道“随而不见其后，迎而不见其首”，无法看到其首尾，而只能看到其经过当下的样子，所以才要“执今之道，以御今之有”。</p><p><b>直译：</b></p><p>看也看不到，称它为“微”；听也听不见，称它为“希”；摸也摸不着，称它为“夷”。这三者的区别很难界定，所以把它们混同为一来看。这个“一”，它上面不显光明，下面也不觉暗昧，延绵不绝而莫可名状，所以只能把它归结为“无”的存在。“无”，并不是说它什么也没有，而是具备没有形状的形状，没有形体的形象，恍惚不明。跟随着它，看不到它的末尾；面向着它，看不到它的前端。把握住它着落在当下的样貌，用来驾驭当下的现实，由此得知其间的规律，进而窥见它本始的面貌。这就是认知“道”的纲领。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十五章：</p><p><b>帛书版：</b></p><p>古之善为道者①，微妙玄达，深不可识。夫唯不可识，故强为之容。曰：豫呵其若冬涉水，犹呵其若畏四邻，严呵其若客，涣呵其若凌释，敦呵其若朴，混呵其若浊②，旷呵其若谷。浊而静之③，徐清。安以重之④，徐生。保此道不欲盈，夫唯不欲盈，是以能敝而不成⑤。</p><p><b>传世版：</b></p><p>古之善为士者，微妙玄通，深不可识。夫唯不可识，故强为之容﹕豫兮若冬涉川，犹兮若畏四邻，俨兮其若客，涣兮若冰之将释，敦兮其若朴，旷兮其若谷，浑兮其若浊。孰能浊以静之徐清﹖孰能安以久动之徐生﹖保此道者不欲盈，夫唯不盈，故能蔽不新成。</p><p><b>版本差异：</b></p><p>①古之善为道者：传世版为“古之善为士者”。为“道”者和为“士”者是有差别的，善为道者必善为士，而善为士者却不一定善为道，因此有“上士闻道”一说。</p><p>②混呵其若浊，旷呵其若谷：传世版把这两句调换了位置，或为承接下句“浊而静之”。</p><p>③浊而静之，徐清：传世版为“孰能浊以静之徐清”。这样一改，成了拥有两个主语的病句不说，意义也发生了很大的变化，把对自然现象的描述，变成了对行为准则的考量。</p><p>④安以重之，徐生：“重”，传世版为“动”。在《道德经》中，“重”与“静”等列，而非“动”与“静”等列。对应第二十六章：“重为轻根，静为躁君”。</p><p>⑤敝而不成：传世版为“蔽不新成”，直接与《道德经》第二十三章“敝则新”相矛盾。“新”和“成”，本是不相同的两个概念，被传世版用在一起变成了一个概念，语义不通。</p><p><b>直译：</b></p><p>古时得道之人行事，玄妙不可言，通达不可测，幽深而难以认知。正是因为难以认知，所以只能勉强形容。他小心审慎的样子就好像严冬冒着寒冷履冰过河；他迟疑戒惕的样子就好像害怕四方邻国前来围攻；他庄重肃穆的样子就好像自己在作宾客；他涣散不羁的样子就好像冰凌将要消融；他敦厚朴实的样子就好像没有雕琢的素材；他浑沌天真的样子就好像江河的浑水；他静寂幽远的样子就好像空旷的山谷。奔流的浊水安静下来以后，就会徐徐澄清。万物在安稳沉静的状态下，就会有生机萌发。持守这个道理的人不会追求盈满，只有不追求盈满，才能不与母本分离，而得以守住自己的根。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十六章：</p><p><b>帛书版：</b></p><p>至虚极也，守情表也①。万物并作，吾以观其复也。夫物芸芸，各复归于其根。归根曰静，静，是谓复命②。复命常也，知常明也。不知常，妄。妄作，凶。知常容，<span>容乃公</span>，公乃王，王乃天，天乃道，道乃久。没身不殆。</p><p><b>传世版：</b></p><p>致虚极，守静笃。万物并作，吾以观复。夫物芸芸，各复归其根。归根曰静，是曰复命。复命曰常，知常曰明。不知常，妄作凶。知常容，容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。</p><p><b>版本差异：</b></p><p>①至虚极也，守情表也：传世版是“致虚极，守静笃”。“至”，到达，达到。“极”，极点，最高的，不能更进一步的，不变的，引申为准则。“情”，情实，真实的呈现。“表”，表率，准则。到达虚无而至极点，恪守情实而成准则。“极”与“表”都有准则的意思，前后呼应，故取帛书“守情表也”。“守情”被改为“守静”，一方面是因为“情”多被理解成欲念，另一方面是因为“守情”之法知者甚少，故被后人妄改。</p><p>②静，是谓复命：传世版去掉了“静”字。帛书版的表达，是“静”谓之“复命”，而传世版的表达，却是“归根”谓之“复命”。一个是状态，一个是动作，二者有区别。</p><p><b>直译：</b></p><p>到达虚无而至极点，恪守情实而成准则。万物蓬勃兴起，而我就用这个状态观察它们最终仍会返还的地方。万物纷纷芸芸，各自返还它们的本根，返还本根的状态，叫做“静”。持守住了静，也就得以复归于生命之源起。复归于生命之源起，也就知道了固定不变的规律，知道了固定不变的规律，就叫做“明”，否则叫做“妄”。在不知道规律的情况下妄为，就会遭受挫败。掌握了固定不变的规律，就可以做到“能容”。一切按照规律行事，就是“至公”。“至公”者，可以为王。王行道于天下人，则具备天之博德；天行道于万物，则具备道之玄德。依托于道，则能获得长久，终身都不会有失败的危险。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十七章：</p><p><b>帛书版：</b></p><p>太上①，下知有之。其次，亲誉之。其次，畏之。其下，侮之。信不足，案有不信。犹呵，其贵言也。成功遂事，而百姓谓我自然。</p><p><b>传世版：</b></p><p>大上，下知有之，其次亲而誉之，其次畏之，其次侮之。信不足焉，有不信焉。悠兮其贵言，功成事遂，百姓皆谓我自然。</p><p><b>版本差异：</b></p><p>①太上：传世版为“大上”，王弼注解为“大人在上，故曰大上”，把“大上”理解为“大人”。其实这里应该是讲次递排序，“太上”是指“最好，最上”的意思，后接“其次”、“其下”。如《左传》中“太上有立德，其次有立功，其次有立言”，即为次序之意。</p><p><b>直译：</b></p><p>最好的国君，民众只是知道有这么一个存在。其次的国君，民众亲近并赞誉他。再次的国君，民众畏惧他。最次的国君，民众侮辱谩骂他。信用不足，才会不被信任。审慎啊！好的国君会非常看重自己的发言。事情做成功了，百姓都说“我们本来就是要这样的啊”。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十八章：</p><p><b>帛书版：</b></p><p>故大道废，案有仁义①。智慧出，案有大伪。六亲不和，案有孝慈。邦家昏乱，案有贞臣。</p><p><b>传世版：</b></p><p>大道废，有仁义；智慧出，有大伪；<span>六亲不和</span>，有孝慈；国家昏乱，有忠臣。</p><p><b>版本差异：</b></p><p>①案有仁义：有人把“案”作“安”讲，读成反问句。其实“案”字本义是指“用于安放食物的木盘”，落下而安放，表达肯定之意，在这里作“于是、就”讲。与第十七章“信不足，案有不信”用法相同。</p><p><b>直译：</b></p><p>大道被废弃，“仁义”就开始被推崇了。智慧已产生，大的伪诈就开始被赞许了。六亲不和睦，“孝慈”就开始被赞赏了。国家已昏乱，忠贞之臣就开始被赞扬了。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第十九章：</p><p><b>帛书版：</b></p><p>绝圣弃智，民利百倍。绝仁弃义，民复孝慈。绝巧弃利，盗贼无有。此三言也①，以为文未足，故令之有所属：见素抱朴，少私而寡欲。绝学无忧②。</p><p><b>传世版：</b></p><p>绝圣弃智，民利百倍；绝仁弃义，民复孝慈；绝巧弃利，盗贼无有。此三者以为文不足，故令有所属：见素抱朴，少私寡欲。绝学无忧。</p><p><b>版本差异：</b></p><p>①此三言也：传世版为“此三者”。“此三者”也可理解为“此三言”，表示此前的三个说法，但还可以理解为“圣智”、“仁义”、“孝慈”这三者，这样两种理解就有差别了。</p><p>②绝学无忧：传世版把“绝学无忧”后置到第二十章中了，不过据上下文意，应当在此章。</p><p><b>直译：</b></p><p>抛弃“圣明”的名号，放弃“智巧”的心思，人民就可以获得百倍的好处。抛弃“仁爱”的偏私，放弃“义理”的制约，人民就会重新恢复孝与慈。抛弃“巧诈”的行为，放弃“得利”的贪欲，盗贼就不会出现。之所以会有以上三个说法，是因为用“圣”、“智”、“仁”、“义”、“巧”、“利”来修补和装饰天下并不妥当，所以告诉你应该怎么做：表现出本真，恪守住惇朴，减损私心和欲望。如此则无需学习治理天下的技巧，也不会再为治理天下而忧虑。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十章：</p><p><b>帛书版：</b></p><p>唯与呵，其相去几何？美与恶①，其相去何若？人之所畏，亦不可以不畏人②。望呵，其未央哉！众人熙熙，若飨于大牢，而春登台。我泊焉未兆，若婴儿未咳。纍呵，如无所归。众人皆有余，我独匮。我愚人之心也，沌沌呵。俗人昭昭，我独若昏呵。俗人察察，我独闷闷呵。忽呵，其若海。恍呵，其若无所止。众人皆有以，我独顽以俚。我欲独异于人，而贵食母。</p><p><b>传世版：</b></p><p>唯之与阿，<span>相去几何</span>﹖善之与恶，相去若何﹖人之所畏，不可不畏。荒兮其未央哉﹗众人熙熙，如享太牢，如春登台。我独泊兮其未兆，如婴儿之未孩；儽儽兮，若无所归。众人皆有余，而我独若遗。我愚人之心也哉﹗沌沌兮，俗人昭昭，我独若昏。俗人察察，我独闷闷。澹兮其若海，飂兮若无止。众人皆有以，而我独顽似鄙。我独异于人，而贵食母。</p><p><b>版本差异：</b></p><p>①美与恶：传世版为“善之与恶”。“善”、“恶”相对的话，就很容易让人把“善”理解为“善良”，但是《道德经》全文中的“善”，都并没有“善良”的意思。所以此处应为“美”、“恶”相对，与《道德经》第二章“天下皆知美之为美，斯恶已”相应，表示美好与丑恶的意思。</p><p>②不畏人：传世版为“不畏”，意义相差很大。传世版的“人之所畏，不可不畏”，是指“别人所畏惧的，我也要畏惧”，顺从流俗之意。而帛书的“人之所畏，亦不可以不畏人”，却是指“人所畏惧的，也会很畏惧人”，完全不同的两个意思。</p><p><b>直译：</b></p><p>应诺与呵斥，它们之间的差别有多大？美好与丑恶，它们之间的差距有多远？人所畏惧的，也不能不畏惧人。看不到边际啊！没有尽头的样子。众人兴高采烈，好像参加盛大的筵席，又好像春天登上高台放望美景。但是我却独自停留在尚未萌动的漠然领域，好像婴儿还不会开口嘻笑。颓唐失意啊！好像无处可以归依。众人都有富余，唯独我好像还有不足。我真是有一颗愚人的心啊，浑浑沌沌。俗人都能看得清清楚楚，唯独我好像昏聩不明；俗人都能辨得细致入微，唯独我好像浑浑噩噩。若无所知啊，好像大海一样广漠；恍然不觉啊，好像没有止境。众人都在发挥才干有所作为，唯独我愚顽不灵，粗陋不堪。我表现的总是和俗人不一样，因为我推崇的是固守本根。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十一章：</p><p><b>帛书版：</b></p><p>孔德之容，唯道是从。道之物①，唯恍唯忽。忽呵恍呵，中有象呵。恍呵忽呵，中有物呵。幽呵冥呵，中有情呵②。其情甚真，其中有信。自今及古③，其名不去，以顺众父。吾何以知众父之然也，以此。</p><p><b>传世版：</b></p><p>孔德之容，惟道是从。道之为物，惟恍惟惚。惚兮恍兮，其中有象；恍兮惚兮，其中有物。窈兮冥兮，其中有精；其精甚真，其中有信。自古及今，其名不去，以阅众甫。吾何以知众甫之状哉﹖以此。</p><p><b>版本差异：</b></p><p>①道之物：传世版是“道之为物”，把“道”往“物”的方向靠。“道之物”可以直译为“道这个东西”，把道当作一个“物”来讲，而并不是说“道就是物”。但“道之为物”，却是明明白白地说“道”是“物”了。也有理解成道生物的过程，不过牵强不通。</p><p>②中有情：传世版是“中有精”，也同样是在把“道”物化。“情”这个字，指“实情、情状、情形”，表示我们对事物的认知，代表真实的存在。无论是虚的“事”，还是实的“物”，都可通用。而“精”，却是指“物的细微成份”，专用于物了。把“道”作“精微”之物来讲，以“有”来作为万物本源，并不符合道家贵“虚”，以“无”为本的一贯思想。</p><p>③自今及古：传世版为“自古及今”，更改了“今”、“古”的顺序，或是为了与《道德经》第十四章被篡改过的“执古之道，以御今之有”相对应。如果是原本的“执今之道，以御今之有，以知古始”，正应该是“自今及古”才是。</p><p><b>直译：</b></p><p>“德”，之所以表现出深远的样子，正是因为它遵从于道。“道”这个东西，你只有在恍然不觉、若无所知的状态下才能察知到它。忽忽恍恍的，你就会觉察到它的意象了。恍恍忽忽的，它进一步具现出形体了。它是那么的幽远，又是那么的深邃，其中存在可以让我们察知的实情。它呈现出来的情状是那么的真实，因为其中对应着固定不变的规律。从当下到远古，都存在它的名字，以指向万物的源始。我是如何知道万物的源始是什么样的呢？就是通过这种方法。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十二章：</p><p><b>帛书版：</b></p><p>炊者不立①。自视者不彰②，自见者不明，自伐者无功，自矜者不长。其在道，曰余食赘行，物或恶之，故有欲者弗居③。</p><p><b>传世版：</b></p><p>企者不立，跨者不行，自见者不明，自是者不彰，自伐者无功，自矜者不长。其在道也，曰余食赘行。物或恶之，故有道者不处。</p><p><b>版本差异：</b></p><p>①炊者不立：传世版为“企者不立”。王弼与河上公注本均把“企”理解为“尚进、进取”，表示这样的人会失去安稳的状态，故而“不立”。但《道德经》从来都没有反对人进取，让人安之若命，而只是要“知止”、“功遂身退”。因此这里取“炊者不立”。“炊”通“吹”；“立”，久站，引申为建树。吹嘘的人，不能有所建树，因为气由己出，容量有限而很容易竭尽。下文“自视者”、“自见者”、“自伐者”、“自矜者”，均为“吹者”，和吹嘘一样由自而出。《<span>老子想尔注</span>》和《道德真经次解》此处作“喘者不久”，一个道理。</p><p>②自视者不彰：传世版为“自是者不彰”，“是”，自以为是的意思，以己为是。而“自视者不彰”，则是由己而视。“是”本身就包含了结果，已经自以为对，“不彰”就显得多余。因此取“视”，视之而不得显明，是一个动作造成相应的结果，更加符合此处文义。</p><p>③有欲者弗居：传世版为“有道者不处”。“有道者”和“有欲者”是有差别的，“有欲者”不一定是“有道者”，而“有道者”也可以处于“有欲”的状态，将要有所作为。因为有所作为，所以需要“用人”，所以不能遭“物”所恶，故此处当取“有欲者”。</p><p><b>直译：</b></p><p>吹嘘的人，不能有所建树。用自己眼光看待事物的人，看不显明。用自己成见理解事物的人，不得真相。自我夸耀的人，不能成就功业。自作高贵的人，不能得到敬重。用“道”的理念看待这些行为，就像吃饭的余弃一样是累赘，就像行走的负担一样是多余，大家都会厌恶它。因此想要有所作为的人，不会去干这样的事情。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十三章：</p><p><b>帛书版：</b></p><p>曲则全，枉则正①，洼则盈，敝则新，少则得，多则惑。是以圣人执一，以为天下牧②。不自视故彰，不自见故明，不自伐故有功，弗矜故能长。夫唯不争，故莫能与之争。古之所谓曲全者，岂语哉！诚全归之。</p><p><b>传世版：</b></p><p>曲则全，枉则直，洼则盈，敝则新，少则得，多则惑。是以圣人抱一，为天下式。不自见故明，不自是故彰，不自伐故有功，不自矜故长。夫唯不争，故天下莫能与之争。古之所谓曲则全者，岂虚言哉！诚全而归之。</p><p><b>版本差异：</b></p><p>①枉则正：传世版为“枉则直”。有句话叫“宁向直中取，勿向曲中求”，直与曲相对，因为“直”并不一定是“正”，“曲”也不一定是“枉”。比如孔子说“以直报怨”，他说的“直”明显就不是“正”的意思。而本句的“枉”与“正”相对，有个成语叫“较枉过正”，所以此处取“正”。</p><p>②是以圣人执一，以为天下牧：传世版为“是以圣人抱一，为天下式”。抱一而为天下式，有<span>垂拱而治</span>的意思，但执一而为天下牧，就有使用某种法则治理天下的意思。一种是没有动作，一种是有所行动。从后文“不自视故彰，不自见故明，不自伐故有功，弗矜故能长”来看，应当是有所行动的状态，故此处取“是以圣人执一，以为天下牧”。</p><p><b>直译：</b></p><p>曲折行事，可以得到圆满的结果；屈伏不争，可以造就中正的状态。低洼可以获得盈满，老旧可以成就新颖，追求的少则容易有所得，追求的多则容易陷入迷惑。所以圣人执守这个原则，用以治理天下。不用自己的眼光去看待事物，因而道理得以彰显。不用自己的成见去认知事物，因而真相得以显明。不自我夸耀，故而有功。不自作高贵，故而为官长。正是因为不争，天下无人可与之相争。古人说的“曲全”这个道理，可不仅仅只是一句空话，而是真的能够得到至善完满。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十四章：</p><p><b>帛书版：</b></p><p>希言自然。飘风不终朝，暴雨不终日。孰为此？天地而弗能久，又况于人乎！故从事而道者同于道①，德者同于德，失者同于失。同于德者，道亦德之②。同于失者，道亦失之③。</p><p><b>传世版：</b></p><p>希言自然。故飘风不终朝，骤雨不终日。孰为此者？天地。天地尚不能久，而况于人乎？故从事于道者，道者同于道，德者同于德，失者同于失。同于道者，道亦乐得之；同于德者，德亦乐得之；同于失者，失亦乐得之。信不足焉，有不信焉。</p><p><b>版本差异：</b></p><p>①故从事而道者同于道：传世版是“故从事于道者，道者同于道”，多了一个“道者”，为误入，当删。《<span>淮南子</span>》引用此处文本也为“从事于道者同于道”。</p><p>②同于德者，道亦德之：传世版是“同于道者，道亦乐得之；同于德者，德亦乐得之”，字句出入很大，意义差别也很大。首先“同于道者”本身就代表与“道”相合，“道亦乐得之”是句废话。其次“德”只是一个空泛的概念，不像“道”一样是独立存在，所以“德亦乐得之”无从谈起。“同于德者，道亦德之”意思是说，如果持守于“德”，那么道也不会放弃他，主语始终是“道”，因为“德”只是“道”通行于万物的呈现而已。</p><p>③同于失者，道亦失之：传世版是“同于失者，失亦乐得之”，“失”作主语并不妥当，同样因为它只是一个空泛的概念，并不具备明确的内涵。从上句的“<span>失者</span>”可以看出，这里“失”的是道与德。“德”是“道”通行于万物的呈现，把德失去了，那么道也就会失去他，与上句“道亦德之”对应，因此这里取“道亦失之”。</p><p><b>直译：</b></p><p>不发言施令，而是让万物自作自化。狂风不能刮一早上，暴雨不能下一整天，谁制造的狂风暴雨呢？天地强力施为都不能长久，又更何况是人呢？所以用道的行为方式从事，就会获得“有道”的结果；用德的行为方式从事，就会获得“有德”的结果；用<span>失道失德</span>的行为方式从事，就会获得“失道失德”的结果。有德之人，道也会得到他；失德之人，道也会失去他。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十五章：</p><p><b>帛书版：</b></p><p>有物混成，先天地生。寂呵寥呵，独立而不改①，可以为天地母②。吾未知其名，字之曰道。吾强为之名曰大，大曰逝，逝曰远，远曰反。道大，天大，地大，王亦大。国中有四大③，而王居一焉。人法地，地法天，天法道，道法自然。</p><p><b>传世版：</b></p><p>有物混成，先天地生。寂兮寥兮，独立不改，周行而不殆，可以为天下母。吾不知其名，字之曰道，强为之名曰大。大曰逝，逝曰远，远曰反。故道大，天大，地大，王亦大。域中有四大，而王居其一焉。人法地，地法天，天法道，道法自然。</p><p><b>版本差异：</b></p><p>①独立而不改：传世版为“独立不改，周行而不殆”，添加了一句“周行而不殆”。“周行”是“循环运行”的意思，把道的运行理解为周而复始，其实是错误的。天地日升日落，万物生灭枯荣，看似周而复始，然而决定这日升日落、生灭枯荣的“道”，却非是周而复始，它是固定不变的，也就是“独立不改”。此处去掉“周行而不殆”更合适，因为它误解了道的运作模式。道生之、畜之、长之、育之、亭之、毒之、养之、覆之，用的都是同一个道，而并不是生有个生之道，畜有个畜之道，长、育、亭、毒、养、覆，都只是一个道。王弼将“周行”解为“无所不至”，勉强可通，但是“道”有“不行而至”的意思，也不存在“殆”与“不殆”的状态。</p><p>②可以为天地母：传世版为“可以为天下母”。天地之母，更符合“道”先天地生的定义，在天地还没有出现之前就已经有“道”了，所以“道”是生成天地万物的母亲。而“天下母”，就欠缺了这个含义，此处当取“可以为天地母”。</p><p>③国中有四大：传世版改成了“域中有四大”，可能对国中有道、有天、有地、有王不太能理解，因此改了一个更加广阔的界域，希望可以容下这四大。然而再广阔的界域其实也是容不下“道”的，这里的“国”字与第五十九章的“莫知其极，可以有国”对应，是讲道、天、地、王都具备“莫知其极”之“大”的属性，因此都可成国。</p><p><b>直译：</b></p><p>有个东西混然而成，在天地还没有出现的时候就已经存在了。这个东西空虚而又寂静，独立存在而又恒定不变，是造生天地万物的母亲。我不知道它的名字，称呼它为“道”，勉强给了它一个定义叫“大”。大到不论时间如何流逝也无法消减它；大到无论空间如何延伸也无法阻止它；大到无论如何颠倒反转也无法摆脱它。道大，天大，地大，王也大，像这么大的东西有四个，王就是其中之一。人守法于地，地守法于天，天守法于道，而道守法于它自己。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十六章：</p><p><b>帛书版：</b></p><p>重为轻根，静为躁君。是以君子终日行①，不离其辎重。唯有环观，燕处则超若。若何万乘之王，而以身轻于天下②？轻则失本，躁则失君。</p><p><b>传世版：</b></p><p>重为轻根，静为躁君。是以圣人终日行不离辎重。虽有荣观，燕处超然，奈何万乘之主，而以身轻天下？轻则失本，躁则失君。</p><p><b>版本差异：</b></p><p>①是以君子终日行：传世版为“是以圣人终日行”。“君子”与“圣人”并非一类，“君子”在先秦是指“君王之子”，泛指地位高贵的人，这样的人与“圣人”还是有区别的。此处讲“终日行，不离其辎重”，随从车辆众多，明显是讲贵人这个群体的，而非特指圣人，因此当取“君子”。</p><p>②以身轻于天下：传世版为“以身轻天下”。“以身轻于天下”，和第三十章“以兵强于天下”是相同的结构，可分别读为“轻以身为天下”和“强以兵行天下”，“于”是“为、行事”的意思。因此“以身轻于天下”是指“轻率地用身体去治理天下”，而“以身轻天下”就变成了“用身体轻率地治理天下”。一个是强调身为本，不要轻率地对待它、耗费它，哪怕是治理天下这样的大事；一个却是强调治理天下的态度，不能过于轻率，看重的是治理天下这件事，正好把道家的“贵身”理念给遗漏了。这其实和第十三章的改动是一样的，第十三章把“贵为身于为天下”改成了“贵以身为天下”，也是出于这个目的。</p><p><b>直译：</b></p><p>重是轻的根本，静是躁的主宰。所以君子终日在外行走不离开辎重，只有辎重随身，营寨环绕，才能闲居而表现出很悠然的样子。为什么拥有万辆兵车的君王，却轻易地动用自己的身体，以单薄的力量去行治天下之事呢？过于轻浮，就会失去根本；过于躁动，就会失去依托。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十七章：</p><p><b>帛书版：</b></p><p>善行者无辙迹，善言者无瑕谪，善数者不以筹策。善闭者无关钥而不可启也，善结者无绳约而不可解也。是以圣人恒善救人，而无弃人。物无弃材①，是谓袭明。故善人，善人之师②，不善人，善人之资也。不贵其师，不爱其资，唯智乎大迷，是谓妙要。</p><p><b>传世版：</b></p><p>善行无辙迹，善言无瑕谪，善数不用筹策，善闭无关楗而不可开，善结无绳约而不可解。是以圣人常善救人，故无弃人；常善救物，故无弃物，是谓袭明。故善人者，不善人之师；不善人者，善人之资。不贵其师，不爱其资，虽智大迷，是谓要妙。</p><p><b>版本差异：</b></p><p>①物无弃材：传世版为“常善救物，故无弃物”，强行与上文“常善救人，故无弃人”对应，其实是画蛇添足。人也归属于物，善救人而无弃人，更进一步就是“物无弃材”，从人类社会到自然万物，从个别到普遍。因此人与物是递进关系，而非平行关系，此处当取“物无弃材”。</p><p>②善人之师：传世版改成了“不善人之师”，看上去更容易理解一些，就是贤良之人教授无知之人，然而却并不是本处要表达的意思。善人，是指有道之人，如上文所说善行者、善言者。这类善人，唯善人能识，可引为师友。因为他们行无迹，言无声，被褐而怀玉，故“不善人”不能识。所以善人若为不善人之师，岂非自寻烦恼？俗人察察昭昭，要如何才能教会他们无为大道？这种逆势努行之举，非善人之所为。</p><p><b>直译：</b></p><p>善于行走的人，不会留下车辙马迹。善于言说的人，不会留下疏漏过失。善于计算的人，不会借助竹筹砝码。善于闭藏的人，不使用门栓插销别人也打不开。善于束缚的人，不使用绳索捆束别人也解不开。所以圣人总是善于救人，而不会抛弃人。万物都能各得其用而不被遗弃，这就可以称得上是沿用了道。所以有道之人，可为有道之人的师友；无道之人，可为有道之人的资材。不珍视自己的师友，不爱惜自己的资材，终不过只是大糊涂中的小聪明而已，这是个精深微妙的道理。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十八章：</p><p><b>帛书版：</b></p><p>知其雄，守其雌，为天下溪。为天下溪，恒德不离。恒德不离，复归于婴儿。知其荣，守其辱，为天下谷。为天下谷，恒德乃足。恒德乃足，复归于朴①。知其白，守其黑，为天下式。为天下式，恒德不忒。恒德不忒，复归于无极。朴散则为器，圣人用则为官长。夫大制无割。</p><p><b>传世版：</b></p><p>知其雄，守其雌，为天下溪。为天下溪，常德不离，复归于婴儿。知其白，守其黑，为天下式。为天下式，常德不忒，复归于无极。知其荣，守其辱，为天下谷。为天下谷，常德乃足，复归于朴。朴散则为器，圣人用之则为官长。故大制不割。</p><p><b>版本差异：</b></p><p>①复归于朴：从“知其荣”到“复归于朴”，传世版更改了这段话的位置，把它调到了“朴散则为器”之前，估计是为了以“朴”作为前后语义承接。可这样擅自变动原文是很不妥当的，如《道德经》第五十四章，讲“修之身，其德乃真”，“修之家，其德有余”，“修之乡，其德乃长”，“修之邦，其德乃丰”，“修之天下，其德乃博”，也是在描述“德”之貌，然而每一句都呈递进关系，又怎么知道在本章不是如此呢！整本《道德经》并不是只这一个地方有擅自调换语序的情况，可见后人为追求所谓对仗、承接、工整等表面精致竟不惜篡改经典，堪称病态。</p><p><b>直译：</b></p><p>深知雄强，而安守雌弱，成为天下溪流的归处。成为天下溪流的归处，恒德就不会失去。恒德不会失去，就能复归于婴儿的纯真柔和之境。深知荣华，而安守浊辱，成为畜养天下万物的空谷。成为畜养天下万物的空谷，恒德也就得以充足。恒德得以充足，就能复归于真朴的混然如一之境。深知清白，而安守暗昧，成为天下清明的范式。成为天下清明的范式，恒德也就不会差失。恒德不会差失，就能复归于无极的深远无限之境。真朴破散则成为器，圣人用朴就能成为众器之官长。所以真正完备的制度，是不会对万物进行分割裁裂的。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第二十九章：</p><p><b>帛书版：</b></p><p>将欲取天下而为之，吾见其弗得已。夫天下神器也，非可为者也。为者败之，执者失之。物或行或随，或嘘或吹，或强或羸，或培或堕。是以圣人去甚，去泰，去奢①。</p><p><b>传世版：</b></p><p>将欲取天下而为之，吾见其不得已。天下神器，不可为也。为者败之，执者失之。故物或行或随，或歔或吹，或强或羸，或挫或隳。是以圣人去甚，去奢，去泰。</p><p><b>版本差异：</b></p><p>①去泰，去奢：传世版把“去泰”和“去奢”调换了一下位置，就和第十四章的“微”和“夷”调换位置一样。</p><p><b>直译：</b></p><p>想要通过强行施为的方式来持有天下，我看他不可能成功。天下是有自己运作规律的宏伟之器，不是我们可以强行施为的。强行施为，就会失败；强力抓取，就会失去。天下万物有的喜欢在前行走，有的喜欢在后跟随；有的性情温和，有的性情冷漠；有的心志强盛，有的心志软弱；有的善于培育，有的善于毁坏。所以圣人会去除自己过分的、放纵的、没有节制的行为。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十章：</p><p><b>帛书版：</b></p><p>以道佐人主①，不以兵强于天下，其事好还。师之所居，楚棘生之②。善者果而已矣③，毋以取强焉。果而毋骄，果而勿矜，果而毋伐，果而毋得已居，是谓果而不强④。物壮而老，是谓之不道，不道早已。</p><p><b>传世版：</b></p><p>以道佐人主者，不以兵强天下，其事好还。师之所处，荆棘生焉。大军之后，必有凶年。善有果而已，不敢以取强。果而勿矜，果而勿伐，果而勿骄，果而不得已，果而勿强。物壮则老，是谓不道，不道早已。</p><p><b>版本差异：</b></p><p>①以道佐人主：传世版加了一个“者”字，那么主语就成了“辅佐人主之士”，后文讲的“不以兵强于天下”，“果而不强等等”，都变成了在说“士”的所作所为。这就像第十五章“古之善为道者”一样，传世版也是把这句话改成了“古之善为士者”。“以道佐人主”，即以道为“佐”之人主，意思是选择“道”来作为自己辅佐与倚仗的君王。</p><p>②[大军之后，必有凶年]：本句见于传世版，而帛书本中没有，为后人擅自添加，当删除。劳健说：“《汉书·严助传》淮南王安上书云：‘臣闻军旅之后，必有凶年。’又云：‘此《老子》所谓师之所处，荆棘生之者也。’按其词意，军旅凶年当别属古语，非同出《老子》。又王弼注止云：‘贼害人民，残荒田亩，故曰荆棘生焉。’亦似本无其语。”</p><p>③善者果而已矣：传世版为“善有果而已”，表示“善于达到目的而已”，与帛书版表达的完全是两个意思。帛书版“善者果而已矣”，意思是说有道的君王，战争只是为了解决危难，达到目的就停止了。表达的是不好战，不滥战，而不是善于利用战争达到目的。</p><p>④是谓果而不强：传世版删除了“是谓”二字，这样就与前文“果而毋骄，果而勿矜，果而毋伐，果而毋得已居”呈并列关系。而帛书版“是谓果而不强”，则表示前文所说“果而毋骄，果而勿矜，果而毋伐，果而毋得已居”，统称为“果而不强”，并非并列关系。</p><p><b>直译：</b></p><p>选择用道来辅佐自身的君王，不会强行用兵事来横行天下，因为恶果很容易落在自己身上。大军所到之处，荆棘丛生。以道来行事的人，即使用兵也只是为了解决危难，达到目的就停止了，并不逞强。达到目的也不要骄傲，达到目的也不要自认为了不起，达到目的也不要自夸自赞，达到目的只是因为不得已，这就是使用战争达到目的而不逞强的表现。事物太过壮盛便容易困顿，这叫不合于道，不合于道就会早早消亡。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十一章：</p><p><b>帛书版：</b></p><p>夫兵者①，不祥之器也。物或恶之，故有欲者弗居②。君子居则贵左，用兵则贵右，故兵者非君子之器也③。兵者不祥之器也，不得已而用之，铦袭为上，勿美也④。若美之，是乐杀人也。夫乐杀人，不可以得志于天下矣。是以吉事上左，丧事上右。是以偏将军居左，上将军居右。言以丧礼居之也。杀人众，以悲哀莅之⑤。战胜，以丧礼处之。</p><p><b>传世版：</b></p><p>夫佳兵者，不祥之器。物或恶之，故有道者不处。君子居则贵左，用兵则贵右。兵者，不祥之器，非君子之器。不得已而用之，恬淡为上，胜而不美。而美之者，是乐杀人。夫乐杀人者，则不可以得志于天下矣。吉事尚左，凶事尚右。偏将军居左，上将军居右，言以丧礼处之。杀人之众，以哀悲泣之，战胜，以丧礼处之。</p><p><b>版本差异：</b></p><p>①夫兵者：传世版改成了“夫佳兵者”。这个“佳”字放在这里有些莫名其妙，所以引起了很多猜测。有认为是“唯”字的，有认为是“嘉”字的，也有认为是“善、美”之意的，河上公注本认为是“修饰”的意思，而王弼本这一章是空缺，所以也有学者认为这整章都有可能是后人加的。结果帛书本出土之后，大家才发现这个字原来根本是没有的，之前还各种揣摩，结果是个乌龙。</p><p>②故有欲者弗居：这里传世版的改动与第二十二章相同，都是把“有欲者”改成了“有道者”，好像“欲”就是洪水猛兽一般。其实《道德经》从来都不反对“有欲”，不反对人的主观能动性。在第一章老子就指出了“故恒有欲也，以观其徼”，这里的“有欲”就是“将要有所作为”的状态。无论是“为而弗争”也好，“为而弗恃”也好，“无为而无不为”也好，老子对“有为”都不反对，他反对的是强行施加自己的意志，这种妄作之有为。同样的，对于欲，老子反对的是私欲，因此他说“少私而寡欲”，又说“欲不欲”。欲不欲本身就是有欲，只不过是以“不欲”为欲，而“不欲”的“欲”指的正是个人私欲，偏私、主观之欲。至于说“欲”通假为“裕”，“裕”再通为“道”，如此强解就完全没必要了，《道德经》全文那么多道字，又何需独此一处假借别字。</p><p>③故兵者非君子之器也：这句话，在帛书版中上承“君子居则贵左，用兵则贵右”，然后引出“故兵者非君子之器也”，前后成因果关系，表达的是“就算从礼法来看，兵器也非君子之器”。而传世版把因果关系修改了，改成“兵者，不祥之器，非君子之器”，因为不祥而非君子之器，巧妙地避开了礼法的问题。为什么要避开呢？大概是因为当时提倡礼法的那些人，却又提倡君子佩剑吧，而老子对此是明确反对的。如第五十三章所说的“盗竽”，就有“服文采，带利剑”的描述。</p><p>④铦袭为上，勿美也：为什么兵器非君子之器呢？因为兵器是以锋利为美，便于杀伤为上，所以不要去喜欢它，喜欢它也就意味着喜欢杀人。而传世版把“铦袭”改成了“恬淡”，把“勿美也”改成了“胜而勿美也”，意义相去何止千里。“铦”指锋利，“袭”指重复，二字合用表示“锋利再锋利”，越锋利越好。改成“恬淡”，则与文义不合，哪有“恬淡”地使用兵器杀人的？“勿美”本来是指不要喜欢兵器，改成“胜而勿美”，就变成了用兵胜利也不要自得，同时与“恬淡”也就配合起来了，可谓用心良苦。</p><p>⑤以悲哀莅之：传世版改成了“以哀悲泣之”。悲哀是一种氛围，所以用莅之，表示悲哀笼罩的意思。而“哀悲泣之”，却变成了情绪，或是丧葬礼仪？事实上，“哀兵”之哀，是无声的，沉默的，只是在沉默中蕴含着爆发的力量。</p><p><b>直译：</b></p><p>兵器是不祥的器物，万物都不喜欢它，所以想要有所作为的人，不会使用它。君子日常生活中以左为尊位，而用兵打仗则以右为尊位，所以兵器不是君子日常需要的器物。兵器是不祥的器物，使用它只是不得已，它以锋利便于杀伤为上，不要去赞美它。如果赞美它，就是喜欢杀人，而喜欢杀人，是不可能在天下得到成功的。所以办喜事以左边为尊位，办丧事以右边为尊位。偏将军处在左位，而上将军处在右位，说是用丧礼来对待兵事。杀人众多，用悲哀的心情来对待；打了胜仗，用丧礼的规制来处理。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十二章：</p><p><b>帛书版：</b></p><p>道恒无名，朴唯小①，而天下弗敢臣。侯王若能守之，万物将自宾。天地相合，以雨甘露。民莫之令而自均焉。始制有名，名亦既有，夫亦将知止，知止所以不殆。譬道之在天下也，犹小谷之与江海也。</p><p><b>传世版：</b></p><p>道常无名，朴虽小，天下莫能臣也。侯王若能守之，万物将自宾。天地相合以降甘露，民莫之令而自均。始制有名，名亦既有，夫亦将知止。知止可以不殆。譬道之在天下，犹川谷之于江海。</p><p><b>版本差异：</b></p><p>①朴唯小：传世版是“朴虽小”。“唯”与“虽”，古时二字通用，所以在《道德经》文中也造成了部分意义不明的情况。比如第二十六章“唯有环观，燕处则超若。”这里的“唯”，传世版也作“虽”，但对文意的影响就很大。理解成“唯”，是表示只有环观才能燕处超若，而理解成“虽”，却表示就算有环观也超然处之。一字之差，意义迥然。本处的“朴唯小”，“唯”是对“小”表达肯定之意，与“唯恍唯忽”用法相同，改成“虽”字，侧重就变了。</p><p><b>直译：</b></p><p>道从来都是没有名字的，质朴虽然很低微，可是天下都不敢让它臣服。侯王如果能够持守于朴，万物都将自行归从。地气升腾于天而降下雨露，没有人发号施令但自行分布均匀。万物始生即有规制形成，规制既然已经有了，人也就应当知道适可而止，不违逆于它就不会遭受失败。如果把道在天下比作江海，那么万物的规制就好像小溪流，统归于江海。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十三章：</p><p><b>帛书版：</b></p><p>知人者，智也。自知者，明也。胜人者，有力也。自胜者，强也。知足者，富也。强行者，有志也。不失其所者，久也。死而不亡者，寿也。</p><p><b>传世版：</b></p><p>知人者智，自知者明。胜人者有力，自胜者强。知足者富，强行者有志，不失其所者久，死而不亡者寿。</p><p><b>版本差异：</b></p><p>无</p><p><b>直译：</b></p><p>能看清别人，说明十分聪慧；能看清自己，才是真的通明。战胜别人，说明很有力量；战胜自己，才是真的高强。知足的人，才是真的富有；行而不止的人，说明心志强盛。不失去身体的居所，方能生命长久；身体死去而精神不亡，才是真正的长寿。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十四章：</p><p><b>帛书版：</b></p><p>道氾呵，其可左右也。成功遂事而弗名有也①，万物归焉而弗为主②，则恒无欲也，可名于小。万物归焉而弗为主，可名于大。是以圣人之能成大也③，以其不为大也④，故能成大。</p><p><b>传世版：</b></p><p>大道泛兮，其可左右。万物恃之而生而不辞，功成不名有，衣养万物而不为主，常无欲，可名于小；万物归焉而不为主，可名为大。以其终不自为大，故能成其大。</p><p><b>版本差异：</b></p><p>①成功遂事而弗名有也：传世版把这句话改为“功成不名有”，并在前面加上一句“万物恃之而生而不辞”，和传世版在第二章中增加的“万物作焉而不辞”相呼应。可同样的问题在于，“不辞”二字辞不达意。</p><p>②万物归焉而弗为主：传世版把这句话改成“衣养万物而不为主”，变被动为主动，变无为成有为，不如“万物归焉而弗为主”契合文义。</p><p>③是以圣人之能成大也：这句话被传世版删除，这样就造成了一个主语模糊的问题。本章前文的主语是道，而后文换成了“圣人”，传世版删除了“是以圣人之能成大也”，主语就成了道，与文意不符。</p><p>④以其不为大也：传世版改成了“以其终不自为大”，加了一个“自”字。“不为大”这是在全文中通行的概念，如第六十三章“是以圣人终不为大，故能成其大”，第六十四章“为之于其未有也，治之于其未乱也。”所以本句的“为”字是“作为、行动”的意思，但是加个“自”字，就有人理解成“不自以为”，字意和句义都变了。</p><p><b>直译：</b></p><p>道是这样的广泛啊，可左可右无所不至。事情做成功了也不会说是自己的功劳，万物都来归附也不会做它们的主宰，这是因为从来都没有自己的私欲，可以说很低微了。万物都来归附而不做它们的主宰，又可以说是很伟大了。所以圣人以道为法则，之所以能成就伟大，正是因为从来都没有想要成就伟大，因此最终能够成就其伟大。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十五章：</p><p><b>帛书版：</b></p><p>执大象，天下往。往而不害，安平泰。乐与饵，过客止。故道之出言也①，曰淡呵其无味也。视之不足见也，听之不足闻也，用之不可既也。</p><p><b>传世版：</b></p><p>执大象，天下往；往而不害，安平太。乐与饵，过客止。道之出口，淡乎其无味，视之不足见，听之不足闻，用之不足既。</p><p><b>版本差异：</b></p><p>①道之出言：传世版改成了“道之出口”。首先，“道”不会从口出，因为“道可道也，非恒道也”，口中出的只能是言，而不是道。其次，王弼注本也同样是“道之出言”，他说：“而道之出言，淡然无味。”又在第二十三章注解中说：“听之不闻名曰希，下章言，道之出言，淡兮其无味也，视之不足见，听之不足闻。”此处当为后人妄改。</p><p><b>直译：</b></p><p>执守住大道，则天下人都会前来归附。向道而往，就会并行不悖互不相害，得以平和安宁。音乐和美食，可以让过客停留。而道说出来，却是寡淡无味。看也看不见它，听也听不到它，但是用它却用不完。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十六章：</p><p><b>帛书版：</b></p><p>将欲翕之，必固张之。将欲弱之，必固强之。将欲去之，必固举之①。将欲夺之，必固予之。是谓微明。柔弱胜强。鱼不可脱于渊，邦利器不可以示人。</p><p><b>传世版：</b></p><p>将欲歙之，必固张之；将欲弱之，必固强之；将欲废之，必固兴之；将欲夺之，必固与之，是谓微明。柔弱胜刚强。鱼不可脱于渊，国之利器不可以示人。</p><p><b>版本差异：</b></p><p>①将欲去之，必固举之：传世版改成了“将欲废之，必固兴之”。帛书“举”字原本是“与”，按高明所说，“举”和“与”二字通用，比如古文中“选贤与能”实为“选贤举能”。又“与”字繁体“與”和“兴”字繁体“興”字体相近，后人误作“兴”，又“去”、“兴”二字义不相反，所以改“去”为“废”字，成“将欲废之，必固兴之”，其实并非老子原文。</p><p><b>直译：</b></p><p>将要收拢的，必然是它原本已经得到了扩张。将要削弱的，必然是它原本已经得到了加强。将要去除的，必然是它原本已经得到了推举。将要剥夺的，必然是它原本已经得到了给予。这是很容易被忽视的道理。持守柔弱，更好过逞刚强。大鱼不能脱离深渊，国家的利器，不能随意示人逞威。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十七章：</p><p><b>帛书版：</b></p><p>道恒无名①，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。镇之以无名之朴，夫将不辱。不辱以情，天地将自正②。</p><p><b>传世版：</b></p><p>道常无为而无不为，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。无名之朴，夫亦将无欲。不欲以静，天下将自定。</p><p><b>版本差异：</b></p><p>①道恒无名：传世版改成了“道常无为而无不为”，意义相差甚远。“道恒无名”，侯王守的是“无名”之道；而改成“道常无为而无不为”，侯王守的则是“无不为”之道。“无名”、“无不为”都是道的属性，但是侧重各有不同。守“无名”，是无为、无功、无言；而守“无不为”，则可能就会被理解成“为所欲为”。</p><p>②天地将自正：传世版改成了“天下将自定”。“天地”代表整体大环境，而“天下”则侧重于“治下”，“天地正”与“天下定”，格局大小一目了然。另外，“定”字从“正”从“宀”，本也有安定、治理的意思，不过往往伴随着强力压制，比如平定、镇定。所以“正”必“定”，而“定”未必“正”。《道德经》全文多处讲“正”，比如“侯王得一而以为天下正”，“我好静而民自正”，均可与此处相对应。</p><p><b>直译：</b></p><p>道从来都是没有名字的，侯王如果能够持守它，万物就会自作自化。自作自化而有私欲出现，我就要用道的真朴来安定他们。用真朴安定了他们，也就不会再沾染私欲。不沾染私欲，他们就能保持真情朴实的面貌。如此，天地都将自行回归正态。</p><p><b>解读：</b></p><div>文章</span></span></span><span style=\"height:60px;\"><p>第三十八章：</p><p><b>帛书版：</b></p><p>上德不德，是以有德。下德不失德，是以无德。上德无为，而无以为也①。上仁为之，而无以为也。上义为之，而有以为也。上礼为之，而莫之应也，则攘臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄也，而乱之首也。前识者，道之华也，而愚之首也。是以大丈夫居其厚，而不居其薄，居其实，而不居其华。故去彼取此。</p><p><b>传世版：</b></p><p>上德不德，是以有德；下德不失德，是以无德。上德无为而无以为，下德为之而有以为。上仁为之而无以为，上义为之而有以为，上礼为之而莫之应，则攘臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄而乱之首。前识者，道之华而愚之始。是以大丈夫处其厚，不居其薄；处其实，不居其华。故去彼取此。</p><p><b>版本差异：</b></p><p>①上德无为，而无以为也：传世版在这句话后面添加了一句，“下德为之而有以为”，其实是对本章的误解。本章所讲与“上德”对应的“下德”，是个统称，包括“仁、义、礼”在内，统称为“下德”，而不是单独有一个“下德”。“下德”的共同特性便是“不失德”，都是有目标，有追求，以立“德”为目的而为之，如此反而失去了真正的“德”，所以“建德如偷”。</p><p>第三十九章：</p><p><b>帛书版：</b></p><p>昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈①，侯王得一而以为天下正。其致之也，谓天毋已清，将恐裂。谓地毋已宁，将恐发。谓神毋已灵，将恐歇。谓谷毋已盈，将恐竭②。谓侯王毋已贵以高，将恐蹶。故必贵而以贱为本，必高矣而以下为基。夫是以侯王自谓孤、寡、不谷，此其贱之本与！非也？故致数誉无誉。是故不欲禄禄若玉，硌硌若石。</p><p><b>传世版：</b></p><p>昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈，万物得一以生，侯王得一以为天下贞。其致之。天无以清将恐裂，地无以宁将恐发，神无以灵将恐歇，谷无以盈将恐竭，万物无以生将恐灭，侯王无以贵高将恐蹶。故贵以贱为本，高以下为基。是以侯王自谓孤寡不穀。此非以贱为本邪？非乎？故致数舆无舆。不欲琭琭如玉，珞珞如石。</p><p><b>版本差异：</b></p><p>①[万物得一以生]：这句话在帛书版中没有，传世版添入。第一章的“无名，万物之始”，传世版也是修改成了“无名，天地之始”。天地与万物，其实同属，万物各自遵从于道而获得中正常态，单独一个“生”字不足以描述。</p><p>②[万物无以生将恐灭]:这句话也同样是传世版增添加入，当删。</p><p>第四十章：</p><p><b>帛书版：</b></p><p>上士闻道，勤能行之。中士闻道，若存若亡。下士闻道，大笑之。弗笑，不足以为道。是以建言有之曰：明道如昧，进道如退，夷道如纇。上德如谷，大白如辱，广德如不足。建德如偷，质真如渝。大方无隅，大器免成①，大音希声，大象无形，道褒无名②。夫唯道，善始且善成③。</p><p><b>传世版：</b></p><p>上士闻道，勤而行之；中士闻道，若存若亡；下士闻道，大笑之，不笑不足以为道。故建言有之：明道若昧，进道若退，夷道若颣。上德若谷，大白若辱，广德若不足，建德若偷，质真若渝。大方无隅，大器晚成，大音希声，大象无形。道隐无名，夫唯道善贷且成。</p><p><b>版本差异：</b></p><p>①大器免成：“大方无隅，大器免成，大音希声，大象无形，道褒无名”，无、希、免都是“没有”的意思，但传世版改成了“大器晚成”，“晚”用在这里就不伦不类。“大器免成”，是说最大的器，是不会落成的。因为“成”也就意味着完结，就此固定下来，失去了更进一步的可能，便不能称之为大了，和“大成若缺”一个道理。所以最大的方不会有边角，显现出边角，也就意味着不能更大了。最大的音不会以声相和，最大的象没有形状，对道最大的褒扬是无名无誉，因为任何名、任何誉都不足以加。</p><p>②道褒无名：传世版改成了“道隐无名”，表示隐藏起来连名字都没有，与“道褒无名”刚好完全相反。对道最大的褒扬便是无名无誉，正如第三十九章所说“故致数誉无誉。是故不欲禄禄若玉，硌硌若石。”像石头一样没有人称赞，才是最大的称赞，因为无所遗漏，天地万物无不沐浴其福泽之中，这才是最大的显化，又怎么能说是“道隐”呢！</p><p>③善始且善成：传世版改成了“善贷且成”，“贷”是“施、予”的意思，与第六十八章“圣人无积，既以为人，己愈有。既以予人矣，己愈多”相呼应。可“道”是独立不改的，不能再多也不能再少，它是“不施”的。天地可以不自生而得长生，圣人可以不积而愈有愈多，但用于“道”就不合适了。</p><p>第四十一章：</p><p><b>帛书版：</b></p><p>反也者，道之动也。弱也者，道之用也。天下之物生于有，有生于无。</p><p><b>传世版：</b></p><p>反者，道之动；弱者，道之用。天下万物生于有，有生于无。</p><p>第四十二章：</p><p><b>帛书版：</b></p><p>道生一，一生二，二生三，三生万物。万物负阴而抱阳，中气以为和①。人之所恶，唯孤、寡、不谷，而王公以自名也。物或损之而益，益之而损。故人之所教，亦议而教人。故强梁者不得其死，我将以为学父。</p><p><b>传世版：</b></p><p>道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤寡不穀，而王公以为称。故物，或损之而益，或益之而损。人之所教，我亦教之。强梁者不得其死，吾将以为教父。</p><p>第四十三章：</p><p><b>帛书版：</b></p><p>天下之至柔，驰骋于天下之至坚。无有入于无间，吾是以知无为之有益也。不言之教，无为之益，天下希能及之矣。</p><p><b>传世版：</b></p><p>天下之至柔，驰骋天下之至坚，无有入无间，吾是以知无为之有益。不言之教，无为之益，天下希及之。</p><p>第四十四章：</p><p><b>帛书版：</b></p><p>名与身孰亲？身与货孰多？得与亡孰病？甚爱必大费，多藏必厚亡。故知足不辱，知止不殆，可以长久。</p><p><b>传世版：</b></p><p>名与身孰亲？身与货孰多？得与亡孰病？是故甚爱必大费，多藏必厚亡。知足不辱，知止不殆，可以长久。</p><p>第四十五章：</p><p><b>帛书版：</b></p><p>大成若缺，其用不敝。大盈若盅，其用不穷。大直如屈，大巧如拙，大赢如绌①。躁胜寒，静胜热，清静可以为天下正。</p><p><b>传世版：</b></p><p>大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈，大巧若拙，大辩若讷。躁胜寒，静胜热。清静为天下正。</p><p>第四十六章：</p><p><b>帛书版：</b></p><p>天下有道，却走马以粪。天下无道，戎马生于郊。罪莫大于可欲①，祸莫大于不知足，咎莫憯于欲得。故知足之足，恒足矣。</p><p><b>传世版：</b></p><p>天下有道，却走马以粪；天下无道，戎马生于郊。祸莫大于不知足，咎莫大于欲得，故知足之足，常足矣。</p><p>第四十七章：</p><p><b>帛书版：</b></p><p>不出于户，以知天下。不窥于牖，以知天道。其出也弥远，其知弥少。是以圣人不行而知，不见而明①，弗为而成。</p><p><b>传世版：</b></p><p>不出户，知天下；不窥牖，见天道。其出弥远，其知弥少。是以圣人不行而知，不见而名，不为而成。</p><p>第四十八章：</p><p><b>帛书版：</b></p><p>为学者日益①，闻道者日损②。损之又损，以至于无为，无为而无不为。取天下也，恒无事。及其有事也，不足以取天下。</p><p><b>传世版：</b></p><p>为学日益，为道日损。损之又损，以至于无为，无为而无不为。取天下常以无事，及其有事，不足以取天下。</p><p>第四十九章：</p><p><b>帛书版：</b></p><p>圣人恒无心①，以百姓之心为心。善者善之，不善者亦善之，德善也。信者信之，不信者亦信之，德信也。圣人之在天下也，歙歙焉，为天下浑其心。百姓皆属耳目焉②，圣人皆孩之。</p><p><b>传世版：</b></p><p>圣人无常心，以百姓心为心。善者，吾善之；不善者，吾亦善之，德善。信者，吾信之；不信者，吾亦信之，德信。圣人在天下歙歙，为天下浑其心。百姓皆注其耳目，圣人皆孩之。</p><p>第五十章：</p><p><b>帛书版：</b></p><p>出生入死。生之徒十有三，死之徒十有三，而民生生①，动皆之死地之十有三。夫何故也？以其生生也。盖闻善摄生者，陵行不避兕虎②，入军不被甲兵。兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故也？以其无死地焉。</p><p><b>传世版：</b></p><p>出生入死。生之徒十有三，死之徒十有三。人之生动之死地，亦十有三。夫何故？以其生生之厚。盖闻善摄生者，陆行不遇兕虎，入军不被甲兵，兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故？以其无死地。</p><p>第五十一章：</p><p><b>帛书版：</b></p><p>道生之而德畜之①，物形之而器成之②，是以万物尊道而贵德。道之尊，德之贵也，夫莫之爵，而恒自然也。道生之、畜之③、长之、育之、亭之、毒之、养之、覆之。生而弗有也，为而弗恃也，长而弗宰也，此之谓玄德。</p><p><b>传世版：</b></p><p>道生之，德畜之，物形之，势成之。是以万物莫不尊道而贵德。道之尊，德之贵，夫莫之命而常自然。故道生之，德畜之。长之、育之、亭之、毒之、养之、覆之。生而不有，为而不恃，长而不宰，是谓玄德。</p><p>第五十二章：</p><p><b>帛书版：</b></p><p>天下有始，以为天下母。既得其母，以知其子。既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤。启其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明。毋遗身殃，是谓袭常。</p><p><b>传世版：</b></p><p>天下有始，以为天下母。既得其母，以知其子；既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤。开其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明，无遗身殃，是为习常。</p><p>第五十三章：</p><p><b>帛书版：</b></p><p>使我挈有知①，行于大道，唯迤是畏②。大道甚夷，民甚好径。朝甚除，田甚芜，仓甚虚。服文采，带利剑，厌食而资财有余。是谓盗竽！非道也哉。</p><p><b>传世版：</b></p><p>使我介然有知，行于大道，唯施是畏。大道甚夷，而民好径。朝甚除，田甚芜，仓甚虚。服文彩，带利剑，厌饮食，财货有余，是为盗夸。非道也哉！</p><p>第五十四章：</p><p><b>帛书版：</b></p><p>善建者不拔，善抱者不脱，子孙以祭祀不绝。修之身，其德乃真。修之家，其德有余。修之乡，其德乃长。修之邦，其德乃丰。修之天下，其德乃博。以身观身，以家观家，以乡观乡，以邦观邦，以天下观天下。吾何以知天下之然哉？以此。</p><p><b>传世版：</b></p><p>善建者不拔，善抱者不脱，子孙以祭祀不辍。修之于身，其德乃真；修之于家，其德乃余；修之于乡，其德乃长；修之于国，其德乃丰；修之于天下，其德乃普。故以身观身，以家观家，以乡观乡，以国观国，以天下观天下。吾何以知天下然哉？以此。</p><p>第五十五章：</p><p><b>帛书版：</b></p><p>含德之厚者，比于赤子。蜂虿虺蛇弗螫，攫鸟猛兽弗搏。骨弱筋柔而握固，未知牝牡之会而朘怒，精之至也。终日号而不嚘，和之至也。知和曰常，知常曰明，益生曰祥，心使气曰强。物壮即老，谓之不道，不道早已。</p><p><b>传世版：</b></p><p>含德之厚，比于赤子。蜂虿虺蛇不螫，猛兽不据，攫鸟不搏。骨弱筋柔而握固。未知牝牡之合而全作，精之至也。终日号而不嗄，和之至也。知和曰常，知常曰明，益生曰祥，心使气曰强。物壮则老，谓之不道，不道早已。</p><p>第五十六章：</p><p><b>帛书版：</b></p><p>知者弗言，言者弗知。塞其兑，闭其门，和其光，同其尘，挫其锐，解其纷，是谓玄同。故不可得而亲，亦不可得而疏。不可得而利，亦不可得而害。不可得而贵，亦不可得而贱。故为天下贵。</p><p><b>传世版：</b></p><p>知者不言，言者不知。塞其兑，闭其门，挫其锐，解其纷，和其光，同其尘，是谓玄同。故不可得而亲，不可得而疏；不可得而利，不可得而害；不可得而贵，不可得而贱，故为天下贵。</p><p>第五十七章：</p><p><b>帛书版：</b></p><p>以正治邦，以奇用兵，以无事取天下。吾何以知其然也哉？夫天下多忌讳，而民弥贫。民多利器，而邦家滋昏。人多智巧，而奇物滋起。法物滋彰①，而盗贼多有。是以圣人之言曰：我无为而民自化，我好静而民自正，我无事而民自富，我欲不欲而民自朴。</p><p><b>传世版：</b></p><p>以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳，而民弥贫；民多利器，国家滋昏；人多伎巧，奇物滋起；法令滋彰，盗贼多有。故圣人云：“我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。”</p><p>第五十八章：</p><p><b>帛书版：</b></p><p>其政闷闷，其民惇惇。其政察察，其民缺缺。祸，福之所倚。福，祸之所伏。孰知其极？其无正也。正复为奇，善复为妖。人之迷也，其日固久矣。是以方而不割，廉而不刺，直而不肆，光而不耀。</p><p><b>传世版：</b></p><p>其政闷闷，其民淳淳；其政察察，其民缺缺。祸兮福之所倚，福兮祸之所伏。孰知其极？其无正。正复为奇，善复为妖，人之迷，其日固久。是以圣人方而不割，廉而不刿，直而不肆，光而不耀。</p><p>第五十九章：</p><p><b>帛书版：</b></p><p>治人事天，莫若啬。夫唯啬，是以早服。早服是谓重积德，重积德则无不克，无不克则莫知其极。莫知其极，可以有国。有国之母，可以长久。是谓深根固柢，长生久视之道也。</p><p><b>传世版：</b></p><p>治人事天莫若啬。夫唯啬，是谓早服。早服谓之重积德，重积德则无不克，无不克则莫知其极，莫知其极，可以有国。有国之母，可以长久。是谓深根固柢，长生久视之道。</p><p>第六十章：</p><p><b>帛书版：</b></p><p>治大国若烹小鲜。以道莅天下，其鬼不神。非其鬼不神也，其神不伤人也。非其神不伤人也，圣人亦弗伤也。夫两不相伤，故德交归焉。</p><p><b>传世版：</b></p><p>治大国若烹小鲜。以道莅天下，其鬼不神。非其鬼不神，其神不伤人；非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。</p><p>第六十一章：</p><p><b>帛书版：</b></p><p>大邦者，下流也，天下之牝，天下之交也①。牝恒以静胜牡，为其静也，故宜为下。大邦以下小邦，则取小邦。小邦以下大邦，则取于大邦②。故或下以取，或下而取。故大邦者，不过欲兼畜人。小邦者，不过欲入事人。夫皆得其欲，则大者宜为下。</p><p><b>传世版：</b></p><p>大国者下流。天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国；小国以下大国，则取大国。故或下以取，或下而取。大国不过欲兼畜人，小国不过欲入事人，夫两者各得其所欲，大者宜为下。</p><p>第六十二章：</p><p><b>帛书版：</b></p><p>道者，万物之注也①，善人之宝也，不善人之所保也。美言可以市，尊行可以贺人②。人之不善也，何弃之有。故立天子，置三卿，虽有拱之璧以先驷马，不若坐而进此。古之所以贵此者何也？不谓求以得，有罪以免与？故为天下贵。</p><p><b>传世版：</b></p><p>道者万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有！故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何？不曰以求得，有罪以免邪？故为天下贵。</p><p>第六十三章：</p><p><b>帛书版：</b></p><p>为无为，事无事，味无味。大小，多少，报怨以德。图难乎其易也，为大乎其细也。天下之难作于易，天下之大作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终于无难。</p><p><b>传世版：</b></p><p>为无为，事无事，味无味。大小多少，报怨以德。图难于其易，为大于其细。天下难事必作于易，天下大事必作于细，是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难，是以圣人犹难之。故终无难矣。</p><p>第六十四章：</p><p><b>帛书版：</b></p><p>其安也，易持也。其未兆也，易谋也。其脆也，易破也。其微也，易散也。为之于其未有也，治之于其未乱也。合抱之木，生于毫末。九层之台，作于羸土。百仞之高，始于足下①。为之者败之，执之者失之。是以圣人无为也，故无败也，无执也，故无失也。民之从事也，恒于其成而败之②。故慎终若始，则无败事矣。是以圣人欲不欲，而不贵难得之货。学不学，而复众人之所过。能辅万物之自然，而弗敢为。</p><p><b>传世版：</b></p><p>其安易持，其未兆易谋，其脆易泮，其微易散。为之于未有，治之于未乱。合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。为者败之，执者失之。是以圣人无为，故无败；无执，故无失。民之从事，常于几成而败之。慎终如始，则无败事。是以圣人欲不欲，不贵难得之货。学不学，复众人之所过。以辅万物之自然，而不敢为。</p><p>第六十五章：</p><p><b>帛书版：</b></p><p>故曰：为道者非以明民也，将以愚之也。民之难治也，以其智也。故以智治邦，邦之贼也，以不智治邦，邦之德也。恒知此两者，亦稽式也。恒知稽式，此谓玄德。玄德深矣，远矣，与物反矣，乃至大顺。</p><p><b>传世版：</b></p><p>古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国，国之贼；不以智治国，国之福。知此两者，亦稽式。常知稽式，是谓玄德。玄德深矣，远矣，与物反矣，然后乃至大顺。</p><p>第六十六章：</p><p><b>帛书版：</b></p><p>江海之所以能为百谷王者，以其善下之，是以能为百谷王。是以圣人之欲上民也，必以其言下之，其欲先民也，必以其身后之。故居前而民弗害也，居上而民弗重也，天下乐推而弗厌也。非以其无争与？故天下莫能与争。</p><p><b>传世版：</b></p><p>江海所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之；欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。</p><p>第六十七章：</p><p><b>帛书版：</b></p><p>小邦寡民，使有十百人之器而毋用①，使民重死而远徙②。有舟车，无所乘之。有甲兵，无所陈之。使民复结绳而用之。甘其食，美其服，乐其俗，安其居。邻邦相望，鸡狗之声相闻，民至老死，不相往来。</p><p><b>传世版：</b></p><p>小国寡民，使有什伯之器而不用，使民重死而不远徙。虽有舟舆，无所乘之；虽有甲兵，无所陈之；使人复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。</p><p>第六十八章：</p><p><b>帛书版：</b></p><p>信言不美，美言不信。知者不博，博者不知。善者不多，多者不善①。圣人无积，既以为人，己愈有。既以予人矣，己愈多。故天之道，利而不害。人之道②，为而弗争。</p><p><b>传世版：</b></p><p>信言不美，美言不信；善者不辩，辩者不善；知者不博，博者不知。圣人不积，既以为人，己愈有；既以与人，己愈多。天之道，利而不害。圣人之道，为而不争。</p><p>第六十九章：</p><p><b>帛书版：</b></p><p>天下皆谓我大①，大而不肖。夫唯不肖，故能大②。若肖，久矣其细也夫。我恒有三宝，持而宝之。一曰慈，二曰俭，三曰不敢为天下先。夫慈，故能勇，俭，故能广，不敢为天下先，故能为成事长③。今舍其慈，且勇，舍其俭，且广，舍其后，且先，则必死矣。夫慈，以战则胜，以守则固。天将建之④，如以慈垣之。</p><p><b>传世版：</b></p><p>天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之。一曰慈，二曰俭，三曰不敢为天下先。慈，故能勇；俭，故能广；不敢为天下先，故能成器长。今舍慈且勇，舍俭且广，舍后且先，死矣！夫慈，以战则胜，以守则固，天将救之，以慈卫之。</p><p>第七十章：</p><p><b>帛书版：</b></p><p>善为士者不武，善战者不怒，善胜敌者弗与，善用人者为之下。是谓不争之德，是谓用人①，是谓配天，古之极也。</p><p><b>传世版：</b></p><p>善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天古之极。</p><p>第七十一章：</p><p><b>帛书版：</b></p><p>用兵有言曰：吾不敢为主而为客，吾不敢进寸而退尺。是谓行无行，攘无臂，执无兵，乃无敌矣①。祸莫大于无适②，无适近亡吾宝矣。故称兵相若，则哀者胜矣。</p><p><b>传世版：</b></p><p>用兵有言，吾不敢为主而为客，不敢进寸而退尺。是谓行无行，攘无臂，扔无敌，执无兵。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相加，哀者胜矣。</p><p>第七十二章：</p><p><b>帛书版：</b></p><p>吾言甚易知也，甚易行也。而人莫之能知也，而莫之能行也。言有宗，事有君。夫唯无知也，是以不我知。知我者希，则我贵矣①。是以圣人被褐而怀玉。</p><p><b>传世版：</b></p><p>吾言甚易知，甚易行，天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵，是以圣人被褐怀玉。</p><p>第七十三章：</p><p><b>帛书版：</b></p><p>知不知，尚矣。不知不知①，病矣②。是以圣人之不病，以其病病，是以不病。</p><p><b>传世版：</b></p><p>知不知，上；不知知，病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。</p><p>第七十四章：</p><p><b>帛书版：</b></p><p>民之不畏威，则大威将至矣。毋狭其所居，毋厌其所生。夫唯弗厌，是以不厌①。是以圣人自知而不自见也，自爱而不自贵也，故去彼取此。</p><p><b>传世版：</b></p><p>民不畏威，则大威至。无狎其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知，不自见；自爱，不自贵。故去彼取此。</p><p>第七十五章：</p><p><b>帛书版：</b></p><p>勇于敢则杀，勇于不敢则活。此两者，或利或害。天之所恶，孰知其故？①天之道，不战而善胜②，不言而善应，不召而自来，坦而善谋。天网恢恢，疏而不失。</p><p><b>传世版：</b></p><p>勇于敢则杀，勇于不敢则活。此两者，或利或害。天之所恶，孰知其故？是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟然而善谋。天网恢恢，疏而不失。</p><p>第七十六章：</p><p><b>帛书版：</b></p><p>若民恒且不畏死①，奈何以杀惧之也？若民恒且畏死，而为奇者,吾得而杀之，夫孰敢矣。若民恒且必畏死②，则恒有司杀者。夫代司杀者杀，是代大匠斲也。夫代大匠斲者，则希不伤其手矣。</p><p><b>传世版：</b></p><p>民不畏死，奈何以死惧之！若使民常畏死，而为奇者，吾得执而杀之，孰敢？常有司杀者杀，夫代司杀者杀，是谓代大匠斫。夫代大匠斫者，希有不伤其手矣。</p><p>第七十七章：</p><p><b>帛书版：</b></p><p>人之饥也，以其取食税之多也①，是以饥。百姓之不治②也，以其上有以为也，是以不治。民之轻死，以其求生之厚也，是以轻死。夫唯无以生为者，是贤贵生③。</p><p><b>传世版：</b></p><p>民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。</p><p>第七十八章：</p><p><b>帛书版：</b></p><p>人之生也柔弱，其死也筋仞坚强。万物草木之生也柔脆，其死也枯槁。故曰：坚强者死之徒也；柔弱细微者生之徒也。兵强则不胜，木强则烘①。强大居下，柔弱居上。</p><p><b>传世版：</b></p><p>人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。</p><p>第七十九章：</p><p><b>帛书版：</b></p><p>天之道，犹张弓者也。高者抑之，下者举之，有余者损之，不足者补之。故天之道，损有余而补不足。人之道则不然，损不足而奉有余。孰能有余而有以取奉于天者乎①？唯有道者乎？是以圣人为而弗有，成功而弗居也。若此，其不欲见贤也。</p><p><b>传世版：</b></p><p>天之道，其犹张弓与！高者抑之，下者举之；有余者损之，不足者补之。天之道，损有余而补不足。人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤。</p><p>第八十章：</p><p><b>帛书版：</b></p><p>天下莫柔弱于水，而攻坚强者莫之能胜也，以其无以易之也。柔之胜刚，弱之胜强，天下莫弗知也，而莫能行也。故圣人之言云，曰：受邦之垢，是谓社稷之主。受邦之不祥，是为天下之王。正言若反。</p><p><b>传世版：</b></p><p>天下莫柔弱于水，而攻坚强者莫之能胜，其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云，受国之垢，是谓社稷主；受国不祥，是为天下王。正言若反。</p><p>第八十一章：</p><p><b>帛书版：</b></p><p>和大怨，必有余怨，焉可以为善？是以圣人执右契①,而不以责于人。故有德司契，无德司彻。夫天道无亲，恒与善人。</p><p><b>传世版：</b></p><p>和大怨，必有余怨，安可以为善？是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。</p></div>"
    }
]