[{
    "title": "尊婆须蜜菩萨所集论 第一卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第一卷</p><p>尊婆须蜜菩萨所集论序</p><p>婆须蜜菩萨大士。次继<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>作佛。名师子如来也。从释迦文降生鞞提国。为大<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>梵摩渝子。厥名郁多罗。父命观佛。寻侍四月具睹相表威变容止。还白所见。父得不还。已<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>学。改字婆须蜜。佛般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后。游教周妒国槃奈园。高才盖世。奔逸绝尘。撰集斯经焉。别七品为一揵度。尽十二揵度。其所集也。后四品一揵度。训释佛偈也。凡十一品十四揵度也。该罗深广。与阿毗昙并兴外国。傍通大乘。持明尽漏博涉十法百行之能事毕矣。寻之[漭-廾+卉]然。犹沧海之无崖。可不谓之广乎。陟之瞠尔。犹昆岳之无顶。可不谓之高乎。宝渚极目。厌夜光之珍。岩岫举睫。厌天智之玉。懿乎富也。何过此经。外国升高座者。未坠于地也。集斯经已入<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>定。如弹指顷神升兜术。弥妒路弥妒路刀利。及僧迦罗刹。适彼天宫。斯二三君子。皆次补处人也。弥妒路刀利者。光炎如来也。僧伽罗刹者。柔仁佛也。兹四大士。集乎一堂。对扬权智。贤圣默然。洋洋盈耳。不亦乐乎。罽宾<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>僧伽跋澄。以秦建元二十年。持此经一部来诣长安。武威太守赵政文业者。学不厌士也。求令出之。佛念译传。跋澄难陀禘婆三人执胡文。慧嵩笔受。以三月五日出。至七月十三日乃讫。胡本十二千首卢也。余与法和对校修饰。武威少多润色。此经说三乘为九品。持善<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。以正观迳。十六最悉。每寻上人之高韵。未尝不忘意味也。恨窥数仞之门晚。惧不悉其宗庙之美。百官之富矣</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>聚揵度首第一(秦言地亲也自品首尽七品名聚揵度)</p><p>十力哀出世觉知一切法</p><p>我今礼如来法及诸圣众</p><p>最胜之善句诸贤圣听闻</p><p>瞿昙大众中有益<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>类</p><p>云何为色相。问色相云何。答曰。如觉知诸法。云何觉知诸法。答曰。为有界想为有胜耶。答曰。彼有一想。问一想为有胜耶。答曰。一想之中着欲诸垢诸界所缚。终不缚者是故诸结则衰。问如中诸结为有胜耶。答曰。当有还<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。问如中当还甘露为有胜耶。答曰。依生身意受诸苦恼缘亦不起。是故身意诸苦恼已过去。问如中无色相。问设无色相色亦<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。答曰。若无色相亦无彼色。色相亦无相亦无淫色相。问犹如汝无色相有色。如是我无色相亦无相。亦有色相耶。或作是说。渐渐兴色相。问一色中或兴或不兴。此义云何。或作是说。若色一时渐积彼无色相。或作是说。渐渐分别色相此亦如本所说。或作是说。摄统色相。问过去未来色最别无教便有无色。或作是说。摄系色相。或作是说。及诸盖色相。或作是说。坏败色相。此亦过去未来所说。或作是说。色相有三种。可见有对。不可见有对。不可见无对。问若诸色不可见无对。欲使彼无色相耶。或作是说。色相往来是谓色相。问过去未来义不有异。或作是说。色相为色。或作是说。因四大义为色。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>亦说四大。缘彼四大生色阴受盛问取要言之。彼则不说缘诸所有色。彼一切是四大。四大所造。答曰。此非取要。又作是说。缘更生诸痛阴或作是说。汝问何色相。设青青为色相。设黄即彼色相也。问我问一切色相。设彼是色相相无胜。答曰。色不同一相。此中有何咎。设相相不同。此义不然。犹若地为坚相。如今地异坚异。问一切色同一相。犹如<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。问自相无相地为自相。是故不应作是说。问我无自相我问一切诸相。或作是说。有对色相是色。为色相有对相者。犹如捻箭笞。是谓有色。如种谷子在地。随时溉灌彼便有色。云何非色相。答曰。反上所说义。尊昙摩多罗说。诸物无对彼非色。是谓非色相。无对之物彼亦不生。是谓无对。犹如无对是对迹。彼便是无对。如是非色相。四大所造色。有何等异。或作是说。无有异也。诸四大即是造色。问如世尊言。诸所有色彼一切是四大四大所造耶。于此经有违。答曰。非所造声。更有余根。如说六更乐愚人所贪忍苦乐行从此所兴乐以来于其中间不出六更乐外更有七更乐也。亦无造者。问若无造声者。亦不变易欲色。是我所色。亦是我有耶。或作是说。坚濡热动是四大相。犹如非地色从色造色。问四大转转优劣色不常作。欲使彼有造色耶。答曰。虽彼四大转转优劣得四大相。四大所兴色。非得四大相。彼非所兴色。或作是说。诸缘彼四大四大所兴色。问四大亦因四大。欲使是兴色耶。答曰。彼虽因四大。有若干所因。四大是兴色相。问色缘色相色<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>色。答曰。云何得知色转生色。复不缘四大耶。或作是说有漏四大所兴色。亦有漏亦无漏。问诸有漏所造兴色被四大有何差降。诸无漏所兴色何等四大造耶。或作是说。无记四大所兴。复次所造色者。善不善无记。此亦如上所说。或作是说。依彼四大得兴色。问心心念法亦依四大。欲使彼是兴色耶。答曰。依四大诸根。诸根亦依心心念法。是故彼不依四大。问名色者展转不相依。或作是说。增上四大四大增上兴色。问是谓衰耗增上。是谓增上不生犹如一切法展转增上相生。是故彼不生。尊僧伽多罗说。四大大事兴<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生色。问四大各各不相离。亦非大事兴。此义云何。答曰。若得不离。或四大非色。如风种空流离色种无香味。四大非色入色造。尊婆须蜜说。更乐亦是四大所兴色也。如地色地香地味。尊昙摩多罗说。犹如微妙色四大得解。亦及余色。是谓兴色也。以何等故身识入细滑入。或是四大或非四大。或作是说。彼无因缘。如明识色。或青或非青。是谓身识入细滑入或是四大或非四大。或作是说。谓四大相。彼非一切从细滑得。四大相不同。濡坚相亦不同。粗细轻重寒饥渴。于彼细滑粗地所生。轻者火风所造。重者地所生。寒者水所造。饥渴火风所造。问无有出地坚者。细滑粗是地处所。是谓有增。如地平正故曰细滑。如地不平正故曰坚粗也。是故无粗细滑。设粗细滑当成就者。一切常可得。如青色不可得。是故不成就。彼或有轻因。彼复有重。是故轻重不得成就。若成寒者。云何得生青莲华。不于彼四大得。是故寒不成就。若火盛则饥。风为渴本。或作是说。一切身识细滑入。当言四大也。不离四大有身识也。四大转增各各说。云何无明。或作是说。无智是无明也。问云何无智言非智耶。设是非智彼是无明。草木墙壁皆不智。欲使彼是无明耶。答曰。心念法与<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应。问心所念法众名心法相无智。云何弥沙塞作是说。未辩无明修行无明。彼不有明时彼谓无明。如不有盐彼谓之无盐。问若彼无有明时彼便起明则有无明。犹如彼器无盐彼器谓之无盐。若不有明彼无明。空便有无明。若是明物是无明者。云何行有缘。或作是说。五盖是无明。世尊亦说。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>愚人无明所覆。问结无有要处。或作是说。思惟不净是谓无明。世尊亦说。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>当思惟不净。未生欲漏便生。已生欲漏倍增广。有漏无明漏亦复如是。亦言。无明习即是有漏习。是故思惟不净。是谓无明也。问非思惟不净是无明耶。彼缘思惟不净亦是无明</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第二卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第二卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>偈品首(聚揵度之五)</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。四事摄人。摄人者其义云何。或作是说。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>性坏。如彼洿沙。彼以此四事更相共摄。故曰其义。如彼沙为水所浸。各相粘着。亦复如是。或作是说。众生性自坏。以此四事相摄各成办。是故摄人。犹是作盖升。升摄诸子此亦如是。或作是说。集聚法众生方便故曰摄人。以何等故共义谓之摄人。或作是说。俱有戒行。或作是说。俱同境界。或作是说。俱同所见。复次劝助义谓之摄人。又世尊言。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>是无常法。云何无常云何无常法。或作是说。过去行无常。未来现在行是无常法。亦当求法亦当次住。或作是说。过去未来现在行无常。未来行是无常法。亦当往求彼法。或作是说。过去现在行无常。未来生法不生法是无常法。彼亦与<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应。或作是说。一切诸行亦是无常。亦是无常法。如所说如因是无常。如果是无常法。问因亦缘余果。果亦缘余因。岂彼不是无常无常法耶。答曰。惟<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>余果。果缘余因。如因是无常。如果是无常法。问如今因非无常。如今果非无常法。是故彼即无常即无常法。复次诸行回转彼无常。是法是无常法</p><p>又世尊言。诸有尘垢是尘垢法。云何名尘垢。云何名尘垢法。或作是说。尘垢展转相缘。是谓尘垢法。或作是说。彼尘垢相应法。谓之尘垢法也。或作是说。尘垢杂尘垢。彼回转法。是谓尘垢法也。或作是说。尘垢杂尘垢。彼所起身行口行。是谓尘垢法。或作是说。一切有漏行尘垢是尘垢法。如其因是尘垢。如其果是尘垢法。尊作是说。众生不坏造<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>行众恼见逼。是谓尘垢法</p><p>又世尊言。汝今<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>生老病死。终更受形。生更受形。逝死有何差别。或作是说。中阴诸形此是生。更转阴<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>此是生。中阴坏败谓之逝。初死阴坏败此是死。或作是说。出母胞胎此是生。始入母胎此是更生。形展转增此是逝。初死阴坏败此是死。或作是说。卵[革*莫]合会生。此事云何。此诸根渐渐熟。受生化生合会。彼诸根不渐渐熟(软生赖成)。化生者。若彼命终时。不见其身卵[革*莫]合会。死已见其身。或作是说。无有差别。当说须臾顷。复次趣往生时。最初受阴生造阴住超越。超越造阴受生处所。是谓尔时命终。住超越造阴受生处所。阴更移转。是谓终命断绝。诸阴散落是谓死</p><p>又世尊言。诸比丘结常随从。彼时有死。诸有死是故有数。说是语时此义云何。或作是说。爱随从彼命终时习行。彼谓死受诸有。欲爱欲受欲阴。色爱色受。无色爱无色受无色阴。已得彼阴。是谓有数。若欲界色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。故曰彼有数。或作是说。使所缠诸使缠。受阴受诸有。已得此有。是谓有数。故曰彼有数。或作是说。一切结所使若力胜者。当命终时便自忆彼谓死。故曰彼有数染怒愚。或作是说。软色因缘起诸垢。垢色所使中色起。缘色所使起增上结。故曰有数。或作是说。色着色所使。色着色死。为色所持因生色。故曰有数。或作是说。诸欲有所须。为彼所使。方便求索已得竟。是故有数。如是诸有所须便求索。已得彼物彼便死。彼便有数。泥黎中若。余恶趣。或作是说。爱所使造有。持往生老病死。彼有数。或作是说。垢所使结起行。持往有悔意恶趣中。彼有数。若死时不悔便生天上。或作是说。敷演<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>世尊<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。若比丘使所使。是谓死为现习谛。彼有数。为现苦谛。于是比丘不使所使。则不死。为现道谛。彼有数。为现尽谛。尊作是说。五盛阴非使。唯无明有爱。彼相应五阴缠裹。已缠裹则有数。泥黎若余恶趣</p><p>一切诸爱使软色自缠裹</p><p>若复有余爱行谛后有五</p><p>又世尊言。于是比丘色无常过去未来。况复现在。以何等故世尊说。况复现在。或作是说。过去色坏败。未来色未生。现在色生不坏。彼名无常。若坏若生及未生。况复生法有坏败。故曰况复现在。或作是说。过去未来色无处所。现在有处所。故曰无常。如其无处所无常。况无处所。故曰况复现在。或作是说。过去未来色不可坏。现在可坏。彼名无常。能使坏者可坏。况复能坏。故曰况复现在。或作是说。未来色未来久远住。过去色过去久远住。现在色现在久远一时住。故曰无常。若久远住者。若当久远住。况复一时住。故曰况复现在。或作是说。寿欲终时。世尊故说。过去久远人<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长寿八十四千岁。亦有阿僧祇岁者。未来久远人亦当寿极长寿八十四千岁。亦有阿僧祇岁。如今寿者。极寿百岁。出百岁者少少。故曰况复现在。或作是说。此世尊教戒语。况复众生现在色。言是我所意染着。过去未来未必染着。于中淫意偏多。现无常故。曰况复现在。尊作是说。现在暂现。过去未来不<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>展转往来。按契经句说。又世尊言。比丘当取冢间五纳衣。少易得人无贪爱。云何冢间衣易得。云何少。云何易得。云何不贪爱。或作是说。人著者少故曰少。处处易得故曰易得。是佛所许。人无贪者。价数甚少故曰少。不从人求亦复无主</p><p>又世尊言。比丘行道甚苦。比丘乞求苦。共居苦。彼云何行道。云何乞求。云何共居。或作是说。五盛阴是行道爱身是乞求。结使是共居。尊作是说。如向者语比丘行道苦乞求苦共居苦。众生于彼<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>苦。于此义故说行道苦。于三苦甚苦。身苦行苦变易苦。希望他乐亦是苦。是苦一切乞求。无方便共居苦</p><p>处无常法界生诸着尘垢</p><p>使况复现在补纳衣甚苦</p><p>第五偈品竟</p><p>尊婆须蜜菩萨所集偈品首(聚揵度之六)</p><p>又世尊言。如彼偈所说。不可食彼食。以何等故。佛世尊说偈不可食。或作是说。世尊不以食故往。但欲<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>彼<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。是故不受。问不以偈故说不可食。食非其义故曰不可食。或作是说。彼婆罗门(耕田净意)悭贪嫉妒。受彼食时。彼便作是念。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>瞿昙以食故而说法。如采合诗颂以钱财故叹誉乞者。如彼良医叹誉药草无病不疗。或作是说。欲现神足变化彼婆罗门。佛为现三变化而教戒之。尊作是说以二事故。佛世尊说偈不受取。自现其义。现众生应受化故。使起护心</p><p>又世尊言。断栅断堑而住门阃。门阃者义云何。或作是说。于此慢怠依彼门阃。吾我所造。如婆嵯种说。如是瞿昙沙门于法化中无有枝叶茎节皮牙雹净。牢固不可移动。云何于法化中枝叶茎节皮牙雹净。言牢固者。其义云何。或作是说。戒于此法化中枝叶茎。利养是皮。<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>是雹。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>是牢固。问云何于法化中无有戒。无有业。无有利养。无有三昧。或作是说。戒牢固。是故枝叶茎利养。利养是牢固。皮雹者三昧。现其少相。解脱牢固。或作是说。有诸邪见。于此经中枝叶茎皮雹作是说。如是现其义。此非瞿昙世尊法化见牢固解脱牢固。或作是说。戒成就叶茎现其相类。三昧成就皮雹现其相类。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>成就现其堑。如是瞿昙世尊非以是故修梵行。余解脱牢固<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>之德也</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第三卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第三卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>心揵度首</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。彼心意执持不去乎手。非二心齐等。云何心意执持不去乎手。摩诃僧耆作是说。心自然持。问摄不<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>非善摄不善。昙摩啒作是说。心相应<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>摄。问不善心善智慧摄。非善智慧摄不善心相应。尊弥沙塞作是说。心不相应智慧而摄。问心不相应智慧非心非意。如所说心意所摄。持跋次子作是说。执持人心。问人<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>意。如所说摄心意。或作是说。修不善心时。善心<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>便断。如是彼心乃至不生。如是彼心则有所摄。问不善心修不善心时。善心缘断绝。欲使善心成不善心耶。答曰。非不善心知善心因缘。或作是说。思惟增益心不净。犹如为欲所缚。思惟欲欲不净。彼欲渐少。问欲与不净二事不异。或作是说。思惟校计心有乱。思惟心不有乱。如是彼心则摄。问非思惟不净。及心有乱则等清净。或作是说。心意生时缘现在心。如是当言心有摄持。问心已生未生不缘未生。或作是说。不善心意作大方便。不顺住不善心取其一缘。如是摄持彼心。问如不善心不作方便。如其方便无不善心。是故方便无有定处。或作是说。过去不善心意有处所。秽恶厌不用心常避如是彼心则有摄持。问此义不然。如二人相倚人人执持。复次然二心俱等不有疑错。如灯燃见明。复次当亲近善知识。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>类闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>思惟校计。善心因缘转增益。缚着展转相依渐渐多。如是等相应力有增益。彼力利不善心不普广<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。修<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>心遂有增益。如是彼心则有执持。如所说心广有觉心微有观。云何心广。或作是说。有觉心盛心盛则广。是故心广有觉。或作是说。五识身广。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>身微。或作是说。不善心广善有漏微。或作是说。不修行心广修行心微。或作是说。见谛所断心广思惟所断心微。或作是说。造彼造广便有微。欲界相应心大<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>相应心微。色界相应广<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>相应微。或作是说。泥黎心广畜生心微。畜生心广饿鬼心微。如是相像。乃至有想无想天当是说。复次阿毗昙说。选择<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>心展<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>造广。照明有觉与梵天相应。更不出梵天上。齐是说何。以等故。五识身有欲爱。然非无欲。或作是说。如契经所说。眼见色爱着好色。问眼见色意识地爱着。当如所见。说彼契经。眼见色眼根成就见。不净思惟校计。欲使五识身无有欲耶。或作是说。如所说此六爱身及眼更爱乃至意。问眼更因缘起意地爱。彼有眼更爱。如所见说思惟六识行。欲使五识身有<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>耶。或作是说。五识身无<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。心无三昧。心中结则炽盛。三昧心不<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。是故五识身有欲。非不无故。问不一切等有欲爱。设当一切有者。阿罗汉亦当有爱生。彼阿罗汉于五识身中无有三昧。修行心意便生欲爱。如色爱无色爱。如所喜一切十大地相应。非五识身中有三昧耶。或作是说。不方便求。五识身便有结使。不方便求使欲不生。是故五识身有爱非为无爱。问若我等不勤求者。是故有欲。一切尽相近有方便求。是故一切尽成就欲。或作是说。无有处所便有。五识身生。结使亦生。非不欲有欲便有欲尽。是故五识身有欲非为无欲。此亦如上所说。或作是说。观<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>便缚眼识回转。不于中间广出义。方便修七觉意住求无欲。是故五识身欲非为无欲。或作是说。五识身中不越次。亲近共住中间。中间生意识。彼则有爱。彼一切是五识身全越次。彼五识身休息。五识身观不净欲使无欲。是故五识身有欲。非为无欲或作是说。身亦不有爱。亦不无爱。何以故。世尊亦说</p><p>典六增上王于染甚染着</p><p>不染便无染染者谓之愚</p><p>问我受此语。思惟染便有染。思惟不染便无染。以此契经五识身亦不有欲。亦不无欲。此义云何。答曰。若无护喜五识身。思惟染便有染。思惟无染便无染。是故以此契经五识身亦不有欲亦不无欲。或作是说。五识身不错乱。设不错乱。若有欲若无欲。是故五识身亦不有欲亦不无欲。问彼相应法有错乱。无色界无有错乱。欲使彼亦不有欲亦不无欲耶。答曰。诸相应法或有乱或无乱。此义云何。无色界计有吾我便有爱。复次自相所摄五识身。不言自相欲无欲。是故五识身亦不有欲亦不无欲。犹若此心所念法俱相应生。云何相应义。故作是说乘载义是相应义。问眼识招致意识。欲使眼识与意识相应耶。答曰。此依余不与同。问如所说乘载义是相应义。此事不然。或作是说。不移动义是相应义。问四大不移动。欲使彼各相应耶。答曰。此非因缘。问如所说。不移动义是相应义。此事不然。或作是说。有因缘是相应义。问眼识缘意识有因缘。欲使彼相应耶。答曰。彼依余。问如所说。不移动义是相应义。此事不然。或作是说。有因缘是相应义。问眼识缘意识有因缘。欲使彼相应耶。答曰。彼依余。问如所说。不移动义是相应义。此事不然。或作是说。一因缘义是相应义。问有众多众生。观月初出。欲使同一缘相应耶。答曰。彼依余。问如所说。一因缘义是相应义。此事不然。或作是说。所有希望义是相应义。问<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>暖气生。欲使彼相应耶。答曰。此无因缘。问如所说。寿命暖气是相应义。是事不然。或作是说。俱生义是相应义。问心不相应行等生。欲使彼相应耶。答曰。此非因缘。问如所说。等生义是相应义。是事不然。或作是说。一起一住一尽彼相应。此亦如上所说。或作是说。一希望一因缘一时造。是谓相应。问此义云何。答云。依一缘一时造。或作是说。一事所须义是相应义。问忍智是一。欲使彼相应耶。答曰。彼非一时造。问如所说。一事义者是相应义。是事不然。或作是说。千义是相应义。识所适处各相开避。心所念法则有选数。或作是说。无有相应。何以故。彼非一切不俱生。问如所说心所念法。与心相应。与心缚着。依心回转彼有违。亦说俱生痛想念。彼所说不与相应。亦不俱生。如是彼无惟说<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>应。亦说见谛信不坏智相应。问若相相应声。二<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>亦说。小有诤讼与共相应。欲使彼共相应耶。若已念闻声是念者。亦说眼色以二因缘生。念法识更乐痛行及因缘。欲使识是念耶。若与声俱生者。亦说比丘心俱生。毗摩质阿须伦颈有五缚。而自观见。欲使彼心俱生耶。谁依意识。或作是说。五识身已生依尽。问无色界中不生意识。彼无五识身。或作是说。依六识身。问色有增减则不可知。或作是说。心左右四大依意识。问彼视色无有增减。或作是说。一切身四大依意识。问所造色无有增减。答曰。以彼四大便有依名字。尊僧迦蜜作如是说。自根依身意识见一一心一切自根。身心所作处处有胜。复次心俱有四大。当言依识。识与彼四大各各相依。如索绳綖</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第四卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第四卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>揵度首</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>集聚来会有二<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。若当论经深义。若当贤圣默然口不出言。云何论经深义。云何贤圣默然口不出言。或作是说。于欲不着。观欲恶露不净是谓论经深义。于第二禅贤圣默然思惟。尊者大目揵连亦作是说。于是比丘思惟第二禅。是谓贤圣默然。或作是说。<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。是谓论经深义思惟十二因缘。是谓贤圣默然。或作是说。契经偈决广布是深经义。心专一不乱而听法。是谓贤圣默然。或作是说。弃一切恶行。是深经义。念弃一切行而思惟之。是谓贤圣默然。或作是说。空无想愿分别广布。是深经义。思惟空无想愿。是谓贤圣默然。或作是说。分别四贤圣谛。是深经义。善思惟四贤圣谛。是贤圣默然。或作是说。法论者。合集人民布现等法。贤圣默然者。思惟不净观。法起则起法灭则灭。或作是说。<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>声远闻。是谓法论。思惟内事。是谓贤圣默然。复次集聚来会。亦是其事。当说诸法。已说当善听之。于彼法论亲近贤圣。譬如戒轮定轮<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>轮<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>轮解脱智慧见智慧轮。乃至十二因缘轮。闻此轮已持讽诵读。意不染着不厌。心不乱善思惟。是谓贤圣默然。如所说尊大目揵连贤圣默然。此是其义。昙摩提那<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>作是说。彼比丘从灭尽三昧起。近三更乐寂更乐不用定更乐。无想更乐。云何寂更乐。云何不用定更乐。云何无想更乐。或作是说。空解脱门是寂更乐。无愿解脱门不用定更乐。无想解脱门是无想更乐。或作是说。彼从灭尽三昧起缘<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>无漏故。不用定现在前。即当言不用定。彼不用定彼无想定。无漏不用定。不用定缘涅槃无想也。复次彼从灭尽三昧起。住有想无想。起若干心。当言近无想更乐。彼住时入不用定起若干心。当言近不用定更乐。若住彼时起识处起若干心。当言近寂更乐。是谓其义。于五三昧彼起若干心。当言起心。犹如渐渐睡眠觉便速起疾。如是渐渐入灭尽三昧不渐渐起。当言是观。颇有二斯陀含成就无漏一禅现在前第二禅不现在前耶。或作是说有。若应空者则现在前。若应无愿者不现在前。或作是说。若所依有力者。则现在前。若所依力少则不现在前。或作是说。若利根者则现在前。若钝根者不现在前。或作是说。若厌欲界弃欲界行则现在前。若厌<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>弃三界行则不现在前。复次未曾有所造行入无漏。三昧观应无漏。颇初禅中间近灭尽三昧耶。或作是说。有若得骠骞度三昧。则于禅中间入灭尽三昧也。或作是说。若依初禅等越次取证。则于初禅中间<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>所断结使。则近灭尽三昧。问彼非近初禅中间。入三昧彼便得近。或作是说。初禅中间入第二禅时。梵天上诸相应结。则得灭尽。问必起禅中间。是故不近禅中间。或作是说。若依初禅中间等越次取证。彼于初禅中间四谛所断结。近灭尽三昧。问此非初禅中间。何以故。必起世俗禅中间。贤圣道而现在前。复次非入初禅中间近灭尽三昧。结使未尽。外观尽彼智种俱住之法。当无觉有观即起不灭尽。如乐<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>入慈三昧。非一切众生有乐。彼三昧为缘何等。或作是说。诸乐众生即彼因缘。问不缘一切众生有其慈。或作是说。一切众生有其乐根彼即缘。问非一切众生有乐根现在前。亦有现在众生有乐根。或作是说。若自更乐彼一切众生解脱。问非以此乐使众生乐。或作是说。非以慈堂一切众生有乐。复次以此方便坚住其心灭诸嗔恚成就诸法。问以颠倒故灭诸嗔恚。复次觉诸众生有其乐根。求众乐解脱。施恩众生皆成就之。如本所说。彼三昧当言颠倒。当言不颠倒。或作是说。当言非颠倒。诸乐众生是其因缘。或作是说。当言非颠倒。一切众生皆乐根。此是慈因缘。如本所说。复次当言非颠倒。嗔恚灭尽。如苦众生入慈三昧。非一切众生有苦。彼三昧为缘何等。或作是说。诸苦众生彼即其因缘。或作是说。一切众生有苦根。彼悲是其缘。或作是说。非以悲堂故一切众生有苦。复次以此方便而坚住其心。灭其害心。复次觉诸众生有苦相苦解脱。并及悲一切众生。皆求使安。如本所说。彼三昧当言颠倒。当言非颠倒。或作是说。言非颠倒。诸苦众生即是其缘。或作是说。当言非颠倒。灭其害心。如喜众生入喜三昧。非一切众生喜。彼三昧为缘何等。或作是说。诸喜众生是其缘。或作是说。一切众生有喜根。是喜其缘。或作是说。自得<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。欲使一切众生同。或作是说。非以喜堂故一切众生有喜。复次以此方便坚住其心。灭诸愁忧。复次觉诸众生欢喜相喜解脱。于一切众生同喜。如本所说。彼三昧当言颠倒。当言非颠倒。或作是说。当言非颠倒。诸喜众生即是因缘。或作是说。当言非颠倒。一切众生有喜根。是故是喜因缘。如本所说。复次当言非颠倒。愁有差违。又世尊言。于是比丘当修安般守意断诸观想。云何当修安般守意断诸观想。或作是说。修安般守意入第二禅。已入第二禅观已越过。问亦有余方便入第二禅。是故余方便断诸观想。或作是说。修安般守意依<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>回转。不依观想断诸观想。此亦如上所说。或作是说。计出入息。有一缘于中无观无觉。如是断诸观。此亦如上所说。复次安般守意缘近不缘为若干缘无众生。彼少生业断诸观想。又世尊言。遍观诸身觉出息。遍观诸身觉入息。云何遍观诸身出息。云何遍观诸身入息。或作是说。观身尽<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>觉出入息。问不从三昧起耶。答曰。三昧不起。彼方便必作不疑。或作是说。观身一切不净。出息入息。俱不染着亦不舍。或作是说。一切身中出息入息皆悉觉知。或作是说。一切身<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>色界观回转时。出息入息不摄其想亦不舍。复次以此方便坚住其心。以此事广思惟之。云何入第四禅尽出入息。或作是说。计出入息时。即彼觉知入第四禅。于中出入息能悉灭之。问以余方便入第四禅。彼出入息灭耶。或作是说。入第四禅时。于四禅地息有回转。壅诸毛孔无出入息。问不从起三昧。出入息不回转耶。答曰。起更依余息回转。或作是说。如入初禅遂便增长。第二禅微第三亦微。如是渐渐息时第四禅无有。复次捐弃觉彼时禅出入息不回转。以何等故。生欲界众生得禅。于禅不退。命终时便生色界。已生色界得一切禅。于禅不退。便命终还生色界。或作是说。此间行对地。此间起禅而生彼间。设彼入三昧。设生彼间者有报。不以报有报。问如今无有彼没还生彼间耶。或作是说。入第三禅净气味相应。无漏禅净得生彼间。于气味相应。退以无漏般涅槃。如是生彼间。若净禅三昧即生彼间。若入气味相应禅。于彼间退。若入无漏禅。即于彼间而般涅槃。或作是说。此间入四种禅。渐渐退住退增上退。渐渐退住退生彼间。增上退越彼间。厌退般涅槃。如是生彼间。若入渐渐退三昧。便于彼间退。若入住退三昧即生彼间。若入增退三昧超越彼地。以无漏道于彼间般涅槃。或作是说。非以禅得生彼间。行垢染着得生彼间。若已行对死者。若复住彼间。以行对不死即生彼间。若不以禅生彼间者。非中间禅生彼间。答曰。无苦。若依未来禅还欲爱尽。于中间禅得生彼间。复次此二俱非妙。众生生欲界得诸禅。色爱未尽便命终生色界。色爱尽无色爱未尽。命终不生色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。无色界爱尽。便命终生无处耶。问云何受报耶。答曰。若爱尽报相应则无也。如彼前则随后。中间相应报果生色界。众生得禅色爱未尽。便命终不作方便求生欲界。若不厌弃方便不增。方便求者便生。生色界爱尽。无色爱未尽。便命终不生无色界。无色界爱尽。命终生无处所。问云何今受报耶。答曰。无有定受相应行报。于色界行禅甚难得。况无色界三昧也</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第五卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第五卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>◎四大揵度首</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>色无断智亦无所知。无断灭欲爱未尽不断苦原。云何色无断智。云何亦无所知。云何无断灭。云何爱未尽灭。或作是说。自相断智智相应。观彼自相诸结使尽永断无余。从此以来常怀和合。自断智拔诸结。使彼无欲爱。色拔诸结使更不复染。或作是说。以世俗道断智。以第一道。知彼世俗道者。结使得断。彼已尽。谓第一道拔诸结使彼欲爱尽。或作是说。以<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>道知。以思惟道断。知四谛道灭尽。思惟所断道欲爱尽。或作是说。身谛处所是知<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>处所。是断智施处所。欲爱尽休息处所不起。复次于是此色分别知色。彼色亦<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。知苦空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。彼空无我色恒随愚痴。彼灭无常苦无复爱着。彼欲爱尽。如是自随愚痴不除己爱。无明断爱尽无余。身坏命尽身名识除。如是不有等苦尽。以何等故。地种为坚相。或作是说。于中无有事法性自尔。问设地坚<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>者。水亦当无缘。如水无有坚。如是因无地也。或时为水。是故当说地有缘。或作是说。有不坚缘。不以财果相应有其缘也。问财无有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>则有常。一切相应相类异<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>诸行。或时有或时无。复次地是其事。坚有坚报。问亦曾见软成坚。是故坚无有缘。答曰。一切诸四大。或时有坚有实有软因缘成坚。是故软与坚地为因缘。火种风种亦复如是。如地种坚相可使不坚相耶。或作是说。不可得也。独自思惟自相不知思惟。思惟无量断思。水种火种亦如是。可得四大一时俱生。有多少数也。答曰。可得也。忧钵花以风相知。有一四大处。彼有四四大耶。或作是说。有一大则有四大。不得分离。问有一则有四大者。终不有一欲使无四。或作是说。有一则有四大。世尊亦说。诸所有色彼则有四大。由四大生。问此但说色是谓为色。若如汝经说。则无有四大。或作是说。曾见如石在火精练然后乃软。故彼无者亦不成软。是故一切是也。或作是说。有一则有四。设地无水者则有坏败。问欲使坏败在处处耶。或作是说。不遍有一切。若当遍有一切者。石无有水风不可得。问便有增益。答曰。于中长者则在处处。复次此不有定。不遍有一切所。可无处彼不可得。以何等故。四大谓暖法非冷法耶。或作是说。若四大是冷法者。则在处处。一时有暖有冷。问此所造色则无处处。是故一时有寒暑。或作是说。若四大是冷法者。此非四大。当言五大。问此亦是我疑。何以故无五大。或作是说。暖法冷法大事兴。是故四大当言非冷法。复次此四大亦暖法亦冷法。若无暖法者。但当言冷法。初新眼识当言是微非眼识知。答曰。当言非眼识知。无有根微妙未知智知。问如彼色新者一切无见。答曰。一一不可见。合集然后可见。如身中垢一一不可见。垢尽然后可见。复次色最鲜明。当言造眼识。不习余色有鲜明。如是不可沮坏。得余四大所造色耶。或作是说。不可得也。此在处处。问如色处所。如瞻卜花香甚香好。云何无处所。或作是说。不可得四大增益。四大因缘依彼四大。复次不可得。四大中间。说可得者。则彼无有造色。彼则有非不有。瞻卜花香瞻服当观。如是此身非以瞻卜花香从彼生少有回转。又世尊言。如火焚烧野泽。当言火烧耶。不烧当言烧耶。或作是说。不烧当言烧。如依造色火生当言烧。或作是说。无有不烧而烧。设烧而烧者则无有烧。此变易义。世俗之数所造。火烧者是谓野泽。复作是说。火无所烧到便烧。若未到无因。若起当言烧。若灭当言烧。或作是说。灭当烧彼有此想。火烧野泽当烧。问彼生则有想火烧火。或作是说。火无所烧。此亦如上所说</p><p>色所知相者坚并及多少</p><p>如有一暖色色住二相烧</p><p>诸所有火尽有所烧耶。说有所烧。尽是火耶。答曰。或是火非有烧。过去未来火在木。钻火在舍。火神祠火也。颇有所烧彼非火耶。答曰。汝为寒耶。烧彼非火耶。如所说炎暑繁炽生老病死。颇有火有烧耶。答曰。依彼所造火现在欲怒痴也。颇有非火非烧耶。答曰。除上尔所事则其义也。以何等故。弊恶四大生微妙色。或作是说。缘所造色。依彼四大便有色生。色缘彼色。香缘彼香。味缘彼味。是故展转增。或作是说。四大增上所生色。复以余事彼则有胜。或作是说。缘四大生色。非一因缘想应彼则有胜。如一弦琴高下随曲声与歌同。如众人有咽喉声各有异字亦复异。复次四大境界各有异。是故四大与色不同。问有一人见色。非与色声香味同。答曰。彼非一色。彼或有好丑。依彼色或依香或依味。亦见多少色声香味。如琉璃云母方盐苦摩利瞻卜花自然。自然者当言减当言增。答曰。当言有增有减。或作是说。不增不减。非有增非有减。复次若观彼事。亦不有增亦不有减。是故不作是说。等生四大展转相触。当言不触耶。或作是说。当言触也。各各集聚。或作是说。当言不触。空无所有。初各各不相触。复次当言触<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>中色。彼有触想根依四大。当言根转有下。当言根转有上。或作是说。当言不高不下亦不移动。或作是说。设当有下有高者。则有移动。或作是说。此则散乱。如车轮转转不<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。义无有处彼亦如是。复次观有住相。于中有高下未知根。是故根力四大。于此间是苦法。色声香味依四大色声香味。当言下当言上耶。或作是说。亦不下亦不上。此皆集聚。设有下有上者。则当有散。复次当言杂裸。如车轮转转不常住。若一色可得者。于彼中间色复有色耶。或作是说。可得若亦无边。亦无有中间。尽无所有。问设彼有中间者。则非第一义有余中间。复次不可得空无所有。最细微色者得声香味。或作是说。得皆为集聚。问今非有细微色耶。彼则为微。或作是说。色最细微。彼色声香味不住独处。设当有者。一一不别。复次更有异刹土想。设当少所有者。一切无吾我。我亦如是。色不去离色习不可称。问若四大若小若大者。彼所有色声香味。当言触彼色耶。或作是说。亦离彼色色则有坏。问四大坏色亦有坏。问云何得知四大坏色坏四大亦坏。问亦见希望坏所依亦坏然希望不坏。复次彼不触。设当触者则为细滑更乐。问如触身根。彼非细滑更乐。答曰。非以触身根有细滑更乐也。彼处以何识知。或作是说。用二识知。眼识<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。复次或不以识知。何以故。彼非识处住色声香味细滑法本所造处。声当言耳根来耶。当言于彼间闻。或作是说。当言来。顺风闻声。逆不大闻。问设顺风来者。逆风何以不闻。或作是说。当言彼间闻。如大市中声甚高远四方皆闻。问回转速疾则无方。有方便憍慢。如旋无枝轮其像如轮。若闻其声周遍四面。如以一滴油着水器中皆悉周遍。答曰。观无枝轮人向不同。非以声速疾得住义也。设当声灭者则少有所摄。当言彼相依来。当言彼不相依来。问如人来者彼则有声也。相依来不是其声。若声从耳根来。当言依相依来。当言不相依来。或作是说。当言相依来。问彼则有是各相依来。不以声故而耳根</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第六卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第六卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>更乐揵度首</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言有二乐。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>者所不应学。若于欲中染着乐。现世无事乐。云何于欲中而染着欲乐。云何现在无事乐。或作是说。忆过去欲所生乐者。是谓于欲中染着欲者乐。忆现在欲诸所生乐。是谓现在无事乐。或作是说。结使欲相诸所生乐。是谓欲中染着欲乐。欲相诸所生乐。是谓现在无事乐。或作是说。贪欲相诸所生乐。是谓于欲中染着欲乐。意喜想欲便睡眠乐得利养乐。是谓现在欲乐。复次习着向欲。已得先足身意所生乐。是谓于欲中染着欲乐。已得等意诸所生乐由身意兴。是谓现在无事乐也。又尊者<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗言。诸贤。此十二行法集聚。得贤圣法。说是语时其义云何。答曰。处处止住造处住。住<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>处住应适处。是谓己身威仪。若偏授决则着一事。分别义理则演分别。问疑论者则演其疑。安处论者则论其安。是谓彼身威仪。或有观见。无奸诈无幻惑。性质朴是谓己威仪。分别根义是他威仪。已得人身生中国。得贤圣体。眼耳根意根。诸清净现其实事。秽行诸使意不染着。以智顺从无有过失。得十力尊。佛出世得三喜入本无。如来乐深妙法。如来<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>善成就者。缘彼意无有谬乱。得贤圣法广分布。智慧所摄说微妙法无有狐疑。奉持讽诵初不远离。诸法注者。展转流布。于等法中以法食施于彼。以<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故。以己威仪施彼人。作诸梵行。四无空处现有长益。得贤<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。生彼善处。现五无空处。皆使远离。诸根具足现六无空处。皆使远离。所未曾行现七无空处。皆使远离。六住处现八无处。皆使远离。复次以人贤圣诸入因缘生者。现仁良义他威仪。佛兴出世说微妙法。以因缘故。故丈夫力已威仪者诸入<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。现回转说诸法已住。便求演说。诸根具足现曩昔所作<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a></p><p>又尊者大遍者延说</p><p>信欢喜念者不遍佛境界</p><p>最胜所至处意常连属喜</p><p>说是语。其义云何。答曰。智慧成就信坚固。喜乐<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>志性不乱。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>智法意常专精。如是诸法无有差违。顺从法教于中入定。故曰信欢喜念。瞿昙翼从初无空缺。所至到处意常连属还微妙义。莫作是观此非妙法</p><p>又世尊言。信为第一财。说是语时其义云何。答曰。智者所用故曰信为第一财。钱财之业。贤圣财非贤圣财已得不失心。便作是念。彼非贤圣财。摩尼宝器自然成物。及余杂宝错厕其间。复有异宝。车[(王*巨)/木]码瑙为人所贪。常当拥护。亦无厌足不可藏匿。贤圣财者。各有七相。如信财乃至智慧财。于此间各自娱乐心踊跃喜。然不殷勤自住平等。贪着他财心不坚固。所欲便造不守智慧。除贪爱欲智慧充足。以智胜彼。复次非贤圣财者。邪志业相应。然贤圣财等志业相应。故曰信财第一。复次信名者。信着外财。意无有乱。成就家法善知止足。善有田业善意娱乐。犹如此间<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法出要为乐。乐静处休息乐道场处乐。故曰择法善为乐。先服<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>言无有虚语。甚吉祥功德成就。故曰味味吉祥。缘此因缘知智慧为明。无有愚意不与颠倒相应。故曰最为明</p><p>又世尊言。如阿难<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。于六更乐无余已离。皆使灭尽。亦无有身诸所生苦乐而受其报。亦<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>亦无形体亦无诸入。亦无作所生苦乐而受其报。亦无空缺处。此是苦际。说是语时其义云何。答曰。此六更乐内六更乐永尽无余。舍诸欲着更不复习。欲尽爱使永除。灭尽见结不起。复作是说。无欲思惟恶露诸欲已尽<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a><a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。复作是说。无欲得无愿<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>门。尽成就空解脱门。彼无有身亦无有至智。亦无语亦无彼心。亦无智亦无彼体。及外诸入未尽者则无。有诸入亦无内入。及余未尽者亦复无也。亦无所依亦不永尽。复作是说。彼无有身除去结使。如是一切彼无有身身之相貌。如是一切彼无有身。亦无身行口行。亦无心意行。亦无彼体。境界行报亦不回转。彼诸入亦无邪见。内诸入便具足。依彼诤讼。无有苦乐之报。尊昙摩多罗作是说。六更乐相应之时。则六细滑入也。于彼细滑则有累。彼无有余全具无欲。爱着未尽。于彼性相应便观苦根本。如是无余亦无有欲。如是相应去离爱着。便住无欲。如彼苦相应性。住<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>想示现智慧。如是无余尽修行灭尽。如是修行已。去离愚痴住黠慧中。无明无欲便起有明想。故曰住无余灭尽。彼无有身亦不得四大身。如处所缚己心无有苦乐。无有恶<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。四神止处。入生入诤讼者。或着己或不着己。如其处所。四神止处意回转开避处此尽炽然。又世尊言。眼悕望意欲见色。诸不善色眼不乐。云何眼悕望意欲见色不善色眼不乐。或作是说。悕望由眼门。爱嗔恚现其所由。复次云何眼悕望非境界所摄。复次心相应便有所照生便有益。如尊者舍利弗说。诸所有色见是我所等自观知已。远离分别肢节。云何知色止住不移动。已舍离观肢节想。答曰。如是便有更乐集聚。彼则还境界。或有是或非彼。如长抓梵志作是语。瞿昙一切我不忍。如是经句。说是语时其义云何。或作是说。见尊者舍利弗出家便起是念。我一切不忍。彼二人者。皆出家一切如我所愿。故语世尊。如是见不忍耶。复作是说。一切观皆有疑</p><p>尔时世尊便作语。汝疑复有疑耶。复作是语。现一切非观一切非</p><p>尔时世尊复作是语。此复是汝非见</p><p>又世尊言。闲居乐静意常娱乐。亲近思惟观净乐。思惟与思惟相应。闲居乐静思惟乐静。此有何差别。或作是说。闲居乐静以休息意。思惟乐静已得止观。或作是说。闲居乐静者。现<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>休息。思惟乐静者。现道出要。或作是说。闲居乐静者。现初第二意断。思惟乐静者。第三第四意断。复次有二想。诸结使断。拔诸染着。娱乐彼初不远离。是谓闲居乐静。当观有三思惟。善法住处所。谓相应住。有所益止观相应。故曰娱乐。是为思惟乐静</p><p>又世尊言。于是比丘当身身相观。莫起身想。亦莫作观想。说是语时其义云何。或作是说。观身不净莫味着。身亦莫起净想。或作是说。身<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>空无我。当作是观。莫起身常想乐想是我想。当作是观。复作是说。思惟身身观。莫计身出由。复次净除行地观辩大事。挍计恶露方便思惟。悉了知已尽不生。智慧眼所照分别悉了</p><p>又世尊言。有四法句。不可俎法句。不乱法句。等念法句。等定法句。句义为何等。或作是说。诸法句断故曰法句。不可坏善根无嗔恚善根。等念等定无痴善根。或作是说。修行诸法故曰法句。不起贪欲贪欲尽无。无嗔恚恚尽。等念睡眠等念。等定调戏疑尽。复次沙门法句不可俎坏。无嗔恚戒。等念求定威仪。等定求智慧威仪。如昙摩提<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>说乐痛是苦痛分。分者其义云何。答曰。有对则有分。于彼乐痛便有苦痛自然之对。苦痛有乐痛分自然之分。苦乐痛有不苦不乐痛之分。除去不苦不乐痛。有无明分。明相应无明是明分。展转相尽。因明是行分。行垢是无明分断灭。作如是行是涅槃分。无余涅槃界。灭一切诸行已。作是涅槃无分</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第七卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第七卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>结使揵度第八</p><p>垢秽当言随颠倒。当言不随颠倒。或作是说。或随颠倒或不随颠倒。四颠倒当言随颠倒。欲慢嗔恚邪见当言不随颠倒。问云何不如实染耶。亦说如实观彼便知。是故不与相应。答曰。集聚便可知亦非自相。若观自相知者。皆有厌患意。无有自相意不回转。问如集聚可知。是集聚则有欲也。观彼颠倒如自相观。便染着无有不染着。无有自相意不回转。或作是说。当言随颠倒与痴相应。问愚痴不与愚痴相应。欲使愚痴随颠倒耶。或作是说。当言不随颠倒。颠倒设当随颠倒者。彼则不断灭。非以颠倒还灭颠倒。问如善无记心心法不随颠倒。彼亦可灭。垢亦如是。答曰。善无记心心法。还续如故。结可使永无。是故彼当言颠倒。复次当言不随颠倒。与邪志与使相应。不与相顺生不成就。彼不净成就。以何等故。谓身见是颠倒不净无能有害者。无有实我身见回转。或作是说。意有净相不净回转。答曰。无有净相。彼或有净或不净。问若有净彼有颠倒。彼或曰有常或曰常。欲使<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>相不成就耶。答曰。无常相不成就。设常无常相不成就者。彼亦当有相。然非相。是故无常相不成就。或作是说。见颠倒与愚痴相应。不净非颠倒与智相应。问愚痴不与愚痴相应。欲使愚痴非颠倒耶。智不与智相应。欲使智颠倒耶。或作是说。身见是垢。垢与颠倒相随。是故身见颠倒不净。由智之功。智不智不随颠倒。是故不净非颠倒。问垢相应心心法。然非垢着。欲使彼随颠倒耶。智相应心心法然非智。欲使彼随颠倒耶。复次如其种类。不净相共染着。不可使诸阴自相有所染着。如阴<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>成就。如其种类净成就也。是故身见颠倒然非不净。一切诸见摄六十二见。为六十二见摄一切诸见。或作是说。一切诸见摄六十二见。为六十二见摄一切诸见。或作是说。一切诸见摄六十二见。六十二见亦摄一切诸见。问如所说萨毗梵志。三乃至三十六种种异。云何彼非诸见耶。答曰。此事如是。二及六十亦复如是。或作是说。一切诸见摄六十二见。非六十二见摄一切诸见。不摄何等。彼<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>言无涅槃俱生者。至五邪见无一邪见。复次六十二见所生见。当言所摄也</p><p>如萨毗所说。三乃至六十。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>依<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>依智慧相依字想诸垢尽。云何六十三见。或作是说。无有六十三见。正有此二见。或作是说。言无涅槃者是邪见。是谓六十三见。或作是说。言无道者是邪见。是谓六十三见。复次所见是谓六十三见。如是五邪见身犹豫见邪见见盗戒盗。无因所生见。为何等见所摄。至死不舍见。为何等见所摄。或作是说。无因所生见。言有所因。是邪见习谛所断。复有至死不舍见。无作言有作。此是戒盗苦谛所断。复次无因所生见。无有见有见所摄也。至死不舍见者。当言有见所摄。以何等见使已尽心相应使更生耶。然无有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。或作是说。因缘者结使便尽因缘。未尽有余。尽不复生。问如是谛无漏缘。结使有尽不尽者。缘尽因缘。答曰。缘已尽无余。是谓灭也。问此缘不同诸使。未尽缘便尽。是故非缘。是故结使便尽也。或作是说。常相应无有不相应时。问非因缘。复次或有彼不缘。或作是说。未尽彼即是缘。复以此缘更不复生。复次尽不复生。问若缘有漏诸结使尽。数数彼缘不复更生。不灭亦不生。欲使无漏心是彼缘耶。结使<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>结使。或作是说。彼相应一生一住一灭不如其缘。已尽各散不一处。彼心有使不如其缘。问彼心未尽。诸相应使一起一住一尽不如其缘。欲使不断者是其缘耶。结使非结使缘也。或作是说。诸相应使与心共。住不如其缘。是故已尽。是相应使。彼心有使不如其缘。此亦如上所说。或作是说。诸相应使染着于心不如其缘。是故已尽相应结使。彼心有使不如其缘。此亦如上所说。或作是说。相应使者。彼心染污不如其缘。是故已尽诸相应使。彼心有使不如其缘。此亦如上说。复次设当如彼缘者。彼心有使。亦见无漏心缘使。彼则有使。复次诸相应使当言彼心有使也。若尽若不尽。如力势王所欲自至。以何等故。欲界相应邪见。谓色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>苦。然非于彼界所使。或作是说。自界所使不干余界。问此亦是我疑。何以故不干余界。设于欲界造余界者。欲使有漏界造自有界。邪见故彼界亦使所使或作是说。彼界少慢渐去离。是故彼界非使所使。问若去离者。在自界中亦当去离。是故自界亦为使所使。或作是说。非以彼见有所疑。亦不缘彼界。问云何彼有无此<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>耶。答曰有。彼若以此说使说者。此非其义无长益。问无有苦恼。彼亦不作是念有所说。或作是说。知而言无。设当知而言无者。此非苦智耶。云何言无苦。若不知无知。云何言无。是故尽无尔所事。问知而言无。不知而言无。设无知知而言无者。若不知云何言无。是故无也。复次缘使所使。何以故。彼不为使所使。复次彼见界无定处。一切有苦而言无。欲使欲界越次彼谓不尽。然后与欲界相应。以何等故。缘涅槃邪见言无涅槃。然不于彼使所使。或作是说。彼不有此使问无能诽谤彼者。欲使诽谤缘涅槃耶。或作是说。诽谤之言去涅槃远。是故不于彼所使。问有漏之法亦去离诽谤。是故有漏亦为使所使。此亦如上所说。诽谤所说。亦如本无异。有是诽谤。复次若缘使不为使所使。阴持入中。彼见无生处所。已有所生。何以不为涅槃所使。以何等故。涅槃中无有嗔恚。或作是说。此非嗔恚境界。问彼诽谤境界。欲使诽谤非缘涅槃耶。或作是说。有漏之法。便有嗔恚无是涅槃。是故缘涅槃无有嗔恚。问有漏之法便有嗔恚。无漏是涅槃。欲使嗔恚非涅槃缘耶。或作是说。以方便舍<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。便有嗔恚起。然涅槃非众生之教。是故缘涅槃无有嗔恚。问有漏之法众数中便有名生。复次无造之相。速有嗔恚起。然涅槃无造之事。是故涅槃中无有嗔恚。若作是说。我必堕泥犁中不须涅槃。彼心与何结相应。或作是说。与嗔恚相应。问缘涅槃有嗔恚耶。或作是说。彼染相应无明之数。彼不知涅槃。复次彼心当言与爱相应</p><p>又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。于是<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>欲界之中有<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>乐天。契经句广说。彼云何命终更受形。便自忆我本为欢喜乐天。便作是念。我本为欢喜天。或作是说。于彼退转。复作是念。彼不于欲界起吾我想。问生欲界中怀<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>所更。我本某甲身。如是起吾我想。欲使彼谓退转耶。复次诸所有名色相应结使欲界因缘。彼则有强记。复作是念。寻生之时审有誓愿。复次我见之想不观断灭。复作是念。等故凡夫本为欢乐天。以何等故。凡夫人不于苦观苦。欲界相应身见犹豫见。谓之断灭耶。或作是说。不净灭贪欲。现拔一苦。亦用思惟断。问<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>所断非思惟耶。此二种所断一种乎。四谛所断以尽。若思惟所断不尽不舍。或作是说。种种结已尽永尽渐渐尽。于彼身见已尽不究竟尽。问若渐渐结尽者。更亦当不生。亦说有三种身见。结生身见。使尽身见处所之法。便有所照。于彼作恶露观。如是身见使便生。复次生十想法所种。便作是语。如是意所断。不于中间贤圣道能断结使</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第八卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第八卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>菩萨所集行揵度首</p><p>阿罗汉于欲界般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。云何受色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>相应报。或作是说。速疾受报故。受色无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>行受闲静身。问若能受阴者。何以故。不究竟尽诸行。不得阿罗汉。受色无色界报。设逮阿罗汉。于现法中受报界。是故后世受报缘。则有微妙报。若彼行还阿罗汉不舍<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。以杂行还阿罗汉。则有其缘相应之行。是行果未熟受妙报。或作是说。初第二第三禅地。缘彼行受苦乐报。第四禅地及无色界相应受不苦不乐报。此亦如上所说。复次阿罗汉若般涅槃受善报。拔诸苦原不善善者缘。云何般涅槃有其处所。彼作是念。云何彼无所有耶。当作是观。设彼行无报者。彼行则无所有。亦无果实。行亦无所有。如仓谷欲使不得成就不生萌牙。彼则无所有。若阿罗汉行果已坏。是谓报果。阿罗汉亦无所有。是故此不尔行所有。颇有人自害身命。非阿罗汉父母。受五逆罪耶。或作是说。有也。作父想往杀人者受五逆罪。复次母化为男子。彼人作母想往杀人者。则受五逆罪。颇杀女人。非母非阿罗汉受五逆罪耶。或作是说。有也。作母想杀他女人者。则受五逆罪。复次母化为女人。彼女人作父想杀人者。则受五逆罪也。不成男杀父母。当言受五逆罪。当言不受五逆罪。或作是说。不受五逆。何以故。不成男愚痴不能起上结使。不于中间有上结。有不情罪。或作是说。上结不成男。于中方便必受五逆。如是出要是五逆。彼不有五逆。是故不受。当作是观。或作是说。当言不受报。何以故。彼不有恩慈。向于父母心不一定。设当受报者。受五逆罪。或作是师想。当作是论。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>纯是五逆罪。若畜生还自害父母。当言受五逆罪。当言不受五逆罪。或作是说。当言不受五逆罪。何以故。畜生无有是智。有尊卑想。于其间有是五逆罪。或作是说。有智<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>便受五逆罪。有智能造结使。犹如御马师。以衣缠头合马牡者。便知是我母。还自啮根断。或作是说。彼法自尔。有智众生无有限量。畜生之类如闻音响。千秋(人面鸟身)生子还害其母。后逮阿罗汉果。复次当言无五逆罪。彼无有恩慈于二父母。设有慈心日日衰耗受五逆罪。当以师想作是论。设当尔者。一切世间皆是五逆。凡夫人住杀害心。当言成就<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。当言不成就善心耶。或作是说。当言不成就。彼无此<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>能悉分别。彼无禁戒。问今凡夫人不生天上。唯闻戒生天上。或作是说。当言或成就或不成就。若生天上彼则成就。若入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>者彼不成就。问此义不然。云何亦闻大行。分别契经说。于七处犯则入地狱。不犯则生天上。复次或有成就或不成就。谁成就。于<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>戒具足。不犯<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。禅不退转命终后。是谓成就。谁不成就。三昧戒不具足。犯戒律。于禅退转便命终者。是谓不成就。阿罗汉最住后心有漏界。当言成就当言不成就。或作是说。当言成就不舍戒律。问云何受<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。于彼后心而受果报。问行与报等无有异此非论。是故无此。或作是说。当言不成就。彼三昧戒不受其报。问尽形寿三昧戒不具足。复次阿罗汉遍满世界。复次当言成就。尽形寿彼便作是念。云何今受报。彼言前若后。云何于其中间而受果实耶。若作讲堂房舍。当言身行当言意行。或作是说。当言身行。身求方便勤劳有功。问是何等身善行所摄。答曰。非尽身行。是身三善行所摄。或作是说。当言口行。口有所陈。我施众僧房舍。口行所作。当问是何等口善行所摄。答曰。至诚语知时语不粗犷语。或作是说。当言意行意有决了以物施彼。意已施了后发口言。我今施至诚不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。问是何等善行所摄。答曰。意三善行。不起贪嫉无嗔恚等见。复次若身教戒我有所施。彼身有教戒我有所施。彼当言身行意行。若口有教戒我有所施。彼当言口教意教。若身口有教我有所施。彼当言身教口意教。不于中间起房舍福念。诸善根成就。于此间设复还生为人。若<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>若处俗修法。彼以何故不于现法中不出家<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>法。或作是说。彼善根未熟已。更生诸善根便成熟。或作是说。彼以善因缘有碍不得出家。复以此因缘得豪贵家。复次于此间或有凭依外力。而有成就所依者。强诸结已尽。诸善行。具足。若无方便诸善法。衰耗。彼于此间终更生复得出家。当作是观。有尔所事。以何等故。结有果实行无果实。或作是说。行报是其对已受此报。诸结使尽道是其对。道未生而有果实。问行亦是道对。道生结则灭。复次有报受其教一切消灭。或作是说。若行数数有果实。则上亦无果实。是故不断绝。问欲使不断绝耶。复次此俱有二果共一法。何以故。无果复言有果。若彼有自然行</p><p>受报教男女不成男亦尔</p><p>凡夫人后心施讲堂房舍</p><p>如此地须弥大山王。众生受行教众生般涅槃。彼渐微小耶。答曰。不微小也。何以故。一切众生缘其行报。若不受报者。彼或有众生受报不受报者。此非彼过。有其微小谷子芩鬼芩药草树木。当言自受行报。当言受增上报。或作是说。当言受行报。问则无有不与取。答曰。他所受则无有不与取。问为受谁物。或作是说。若有所受彼是行报。若无所受彼亦是行报。问彼亦是受报。彼亦是不受报。欲使彼是行报。复次受行增上。何以故。不以行报故受其果实。不断苦原乐原。如草木园果。以何等故。往昔人修十善行时。延命长寿田业丰熟。如今日之人修十善行时。亦不长寿亦无田业。或作是说。往昔人长夜修十善。如今日人不长夜修十善。问如今不长夜修十善。彼则得长寿也。亦得好田业。或作是说。彼往昔修十善。如今日人不修十善。问无始之人修清净之行。今可得受长寿耶。及大田业。或作是说。彼非现在受行报。余处受行报。彼时长寿及大田业。于彼行果余处受。如今日修行十善。彼时余处受报。问如今亦不观。或余处受行报。亦得长寿有大田业。复次无量众事延众<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。亦由田业。不独此行行。亦无量众事。如今可观。或有方俗诸趣。或有众行延命长寿。以何等故。持戒人教他不持戒便自堕罪。或不持戒人教他持戒使有戒律。或作是说。持戒人教他不持戒。是故犯戒若犯威仪。然<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>人不精进人不得威仪。若持戒人教他不持教使不持戒。然不持戒人不教使。持戒人教使持戒。或作是说。精进人教他不持戒。处在悕望。悕望以坏教戒。不持戒人教他持戒。不起悕望。悕望坏则戒坏。复次持戒人教他不持戒人。若起想念则曰不持戒。有持戒力而不退转。不持戒人教他不持戒。若起想念。当言持戒人以精进力游。颇有一口行。有福无<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>耶。或作是说有。爱此教彼有是二心。口有一教。本起想念作是语。收某甲缚某甲。问发善心有教有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>生。善法具足起诸教戒。若不善心有教。则有不善福生。心所念有善不善生。复次教戒有众想生。或作是说。口无善<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>心有教。不善口行。不善心口行。不以一教有善心生。是故无也。复次口教相类。亦有虚亦有实。善心生不善心亦生。无记心亦生。复次一切属心行。亦有善亦有不善亦有无记。是心所念口行处所。当言行口一心亦善亦不善。是故无也。以何等故。身行亦善亦不善。或作是说。有作杀害想。一处有教身本起念。当杀某甲当赏某甲。问设善心有教。则有福生善心已生。若不善心有教。则无有善福生。不善心有教心是身本。若心所念有福无福然教戒者有二杀害心。或作是说。善身行善身。口教不善身行不善。身心有教不以一教。当言善当言不善是故无也。复次教相类亦见礼敬。兴起善心。兴起不善心。兴起无记心。复次一切心所念有是教善不善无记。是故心所念不以念有善有不善。是故无也。云何得知阿罗汉有漏戒成就。或作是说。彼非具足有尽威仪。犹如是威仪。不还阿罗汉。如还阿罗汉无异。或作是说。设阿罗汉有漏戒不成就者。彼无有罪犯。已复还悔。或有漏戒成就阿罗汉。复次若阿罗汉不起有漏戒。亦不量有漏此是世俗。是谓因缘。亦不藏匿起众生想。以等圣谛方便之心贤圣妙法。于此戒而随空性。当作是观。又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。于是阿难大爱道<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。若受八重法。则是出家之要。亦是禁戒。亦是<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>尼行。云何出家要。云何禁戒。云何比丘尼行。或作是说。承受重法。亦是出家禁戒。亦是比丘尼行。亦作是说。彼则是禁戒比丘尼行。或作是说。捐弃家业。是谓出家。承受重法。谓是禁戒。到时乞食不失威仪。是谓比丘尼行。复次于现法中习学威仪被<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>服。出家学道得<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。以方便得此禁戒。顺从不失时节。是谓比丘尼行。云何学增上戒。云何学增上心。云何学增上智慧。或作是说。身威仪口威仪众行清净。是谓增上戒。四禅。是谓学增上心。分别<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。是谓学增上智慧。或作是说。等语等行业等方便。是谓学增上智慧。是谓学增上智慧。等念等定。是谓学增上心。等见等志等治。是谓学增上智慧。或作是说。若戒依思惟。是谓学增上戒。若依<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。是谓学增上心。若以止观断诸结使。是谓学增上智慧。或作是说。见不持戒志为秽能去离彼者志在禁戒。彼一一学。是谓学增上戒。见去离秽意不染着。习学三昧。于彼一一学。是谓增上心。无有方便见诸秽露能舍去离。以方便智慧亲近善友。于彼一一学。是谓学增上智慧。复次顺近贤圣八道分别威仪。是谓增上戒。尽寿奉戒当去恶就善贤圣道起诸三昧。以智慧学增上心。于此三昧有方便遂增益。于其中间诸贤圣道智慧。是谓增上智慧。于此智慧方便修行。以何等故。舒尼二十亿(沙门名也)以一房施之。得九十一劫不堕恶趣。菩萨于此中间作无数功德而入地狱。或作是说。舒尼二十亿心偏在施众生。以此好施功德。所生之处常好惠施。意续不断。以是不堕恶趣。然菩萨者意偏在智慧。意甚勇猛不堕恶趣。或作是说。舒尼二十亿意在闲居。有信<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。以此闲居之德不堕恶趣。然菩萨者修行道业。彼或时不堕恶趣。若失志便堕恶趣。若不失志不堕恶趣。便生天上。或作是说。菩萨者九十一劫不入恶趣。古昔经历出九十一劫无数<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>也。尊昙摩多罗作是说。此诽谤语。菩萨方便不堕恶趣。菩萨<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>以来求坐道场。从此以来不入泥犁。不入畜生饿鬼。不生贫穷处裸跣中。何以故。修行智慧不可沮坏。复次菩萨发意还三不退转法。勇猛好施智慧遂增益顺从。是故菩萨当知不堕恶法</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第九卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第九卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>◎</p><p>菩萨所集见揵度第十一</p><p>若诸法是彼法<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。颇有时彼法当言非彼法因缘耶。或作是说。犹如彼法未生。尔时彼法非因缘。或作是说。以事因缘故。因及余因缘非因缘。次定一切诸行。各各自因自果。及获余<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>永不复生。设当尔者界有差违。最有吉法</p><p>阿罗汉从阿罗汉退。还复得阿罗汉果。诸得根力觉道意。当言本得得。当言本不得得。或作是说。若得等<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。当言本得得。若得无碍解脱。当言本不得得。复次阿罗汉有六种根而有增减。诸阿罗汉分别其义。彼于此相应时。彼本不于他得道迹。有益思惟有益断。有益思惟当言本得得。是谓有道思惟断。有长益当言本不得得。若阿罗汉作阿罗汉想<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。假使非阿罗汉。而作阿罗汉想布施。何者最得福多。或作是说。若阿罗汉作阿罗汉想布施者。彼最得福多也。何以故。田业有增益妄处良田。问如心意行如念所起。云何作是说受福最多。若由良田得福多者。诸有施一阿罗汉。彼尽得平等福。是故此事不然。或作是说。二俱受福等。何以故。一以良田第二由心故。问若以良田心有益者。非由心故。云何得平等福。复次若非阿罗汉作阿罗汉想布施者。彼最得福多。何以故。彼阿罗汉<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>心最微妙。问若尼揵子外道异学。作阿罗汉想布施者。彼最得福多耶。答曰。彼不知阿罗汉功德也。若复彼是阿罗汉。作阿罗汉想布施者。如是彼最得福多。彼无是力缘阿罗汉功德。若得知阿罗汉功德。彼不与外道异学尼揵子施。复次取要言之。犹如枯朽燋柱。作阿罗汉想而惠施者。于彼亦大得功德</p><p>不得何等。须陀洹果。设得便失。或作是说。如彼须陀洹。七反往来有信解脱。彼见谛果所摄。不得须陀洹果。彼若得见谛。彼信解脱果所摄。便弃须陀洹果。复次彼须陀洹七反周旋。彼渜须陀洹所摄。诸钝根不得中上。如须陀洹家家游者。若二若三。于彼游行尽其苦本。彼须陀洹下根所摄便次之。已得中上。若须陀洹家家游者。二家周旋尽其苦原。彼下中须陀洹果所摄便弃之。非以无为须陀洹果若得若弃</p><p>若诸法成就。彼<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>成就耶。假使诸法相成就者。彼法成就耶。答曰。若诸法成就者。彼法相成就也。外众相不成就。若诸法自相成就。彼法成就也。若诸法不成就。彼诸法相不成就耶。或法相不成就。彼法非为不成就。外众相不成就。彼法自相成就</p><p>成就者其义云何。自相相应。是谓成就。不成就者其义云何。不自相相应。是谓不成就。又<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。是谓生此生。作如是说。命异身异。设作如是说彼二同一义。分别有若干。云何同一义。答曰。若自依己得彼缘义。作如是说当亲近尊</p><p>诸作此见彼命彼身。云何生此见。或作是说。生身便生此见。乃至有根身与相应。今亦复然。于中复有命复有身。或作是说。观<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>根众生相。众生者众生根众生性众生类众生种。于中便有彼命彼身。如是所说。女身有力。于中不有短。有大身不觉更乐苦者。意根断绝</p><p>诸所生见命异身异。云何生此见。或作是说。展转观身心心者。亦展转相观彼心心法作我想。命异身异而有此见。或作是说。诸有禅者。观其威仪作因缘。观彼因缘。彼便作是意身异命异。身所为行回转时。或作是说。身不坏败便命终。便作是念。身异命异。若身未住便命终。或作是说。睡眠之中梦见身游行。于是有身。彼便作是念。命异身异。若梦中有所游行。或作是说。以<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>自忆<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。于彼彼终生是间。彼见身住于中。便作是说。身异命异。或作是说。彻听以天眼观众生类。众生生时众<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>时。身在中阴缚而见彼。便作是念。是命身俱游。复次身中间忆本所更巧便回转。彼便作是念。命异身异。若后他人曰命异身异</p><p>诸所生见无因<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。众生垢着。非有因非有缘。众生染着。云何生此见。或作是说。若处闲居。或作是说。观诸垢起。观处宫中或见清净。彼便作是念。无因起诸垢着。复次以二力故生诸垢着。若因力若境界力。由是因缘而不知无因无缘。众生染着得诸见。若他人说。诸所生见。无因无缘众生清净。非有因非有缘众生清净。云何生此见。或作是说。于此观至空闲处而不清净。处深宫中或有清净。于中便作是念。无因而有清净。复次以三力故清净。因力境界力方便力。彼相应时因力境界力。善法如回转有清净生。由是故不知无因无缘。众生清净得此见。若以他说</p><p>诸所生见。无因无缘众生无智无见。非有因非有缘众生无智无见。云何生此见。或作是说。彼便有无殷勤者。云何起无智无见。若复生者。如是无智于中便作是念。无因无缘众生无智无见也。复次生死行因缘无方便行亦不勤求。住无智无见中。不思惟彼因与余相应无智无见相应。有不相应时智相应时。无因无缘众生无智无见得诸见。若由他说。诸所生见。无因无缘。众生智见。非有因非有缘。众生智见云何此见。或作是说。观殷勤者不起智见。以少殷勤或起智见。于中便作是念。彼以无因众生有智见。复次有五事智见回转。名所摄义所摄奸伪。知彼因与余相应智见相应不相应。知是时无因无缘。众生智见得诸见。若由他说</p><p>诸所生见无力无<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。云何生此见。或作是说。或见人貌有得田业。有不得田业。或复有人貌少有田业。于中无果人貌无力无精进得诸见。复次有众多相应。于今世后世或有得果报。于彼或以事而不得果报。殷勤人于中不得果时。无力无精进得诸见。若由他说</p><p>因他本所缘须陀洹成就</p><p>四种及二种因命四种力</p><p>诸所生见无施无受者。契经云何生此见。答曰。善行恶行果所生。若亲近时。于中不可知果实无善行恶行得诸见。或由他说。无今世无后世。亦无众生类。有生者如是有彼观无。有父因事而有。世无阿罗汉<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>道人。而无有道</p><p>诸所生见。于此间有命活。后世更不复死。云何生此见。或作是说。是谓人有吾我身。彼若命终时。地身还归地。水归水火归火风归风。诸根归<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。或作是说。度世阴时不见归来。于此间命活得诸见。复次处胎中。若胎中终。而观其命彼亦见终始。于此间命活得诸见。或由他说</p><p>又世尊言有六生。云何有六生。或作是说。如契经所称。黑生之人于黑法生。复次异学言有六生。黑生青生黄生白生赤生微妙白生。于彼黑生屠猪鱼捕鹿放鹰杀牛及余恶行。青生者尼揵子学道者。黄生者处在居家禀受于梵志。赤生者如<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>释子及诸修梵<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。白生者裸形学道。微妙白生者难陀婆磋讫梨舍僧讫栗姤瞿舍卢味迦梨子</p></div>"
},{
    "title": "尊婆须蜜菩萨所集论 第十卷",
    "author": "僧伽跋澄 译",
    "html": "<div class=\"B1_text\"><p>尊婆须蜜菩萨所集论 第十卷</p><p>尊婆须蜜造</p><p>符秦罽宾<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>僧伽跋澄等译</p><p>◎</p><p>菩萨所集偈品首</p><p>尊者优婆夷。谟以水道步。寻往作尺蠖行。乃至入有想<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。更不复见缘能<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>灭有想无想。彼问<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>曰</p><p>我独流无量不依不能度</p><p>与我说其缘所依度<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a></p><p>我独流无量者。独一者谓不二。<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>流不能得度。复作是说。不能度此有想无想。复作是说。一无明流不能得度。与我说其缘者。普眼遍彼缘无眼。度生死流。此谓有想无想度无明流</p><p>观不用念定依彼而度流</p><p>云何断欲爱爱尽于彼观</p><p>观不用念定者。起无漏不用定。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。作如是观念者。专精其神足住止处所。是谓休息。复作是说。观不用定时观<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>休息。如是汝度流。于彼而灭爱。犹如彼爱先尽。问<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>诸爱染着于欲。复作是说。住爱而使尽。亦当使求尽。复作是说。彼爱未尽诸缠着住。非以外道而灭。去离非论。彼听善论爱数数使退。以是故世尊使告离非论爱尽。于彼观者彼于涅槃有堕想。彼自守持。于是世尊说不涅槃休息。一切欲无爱。依不用定。寂寂想<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>最胜。住彼而不起。一切欲无爱者。于三界欲尽。欲界结永尽。以贤圣道尽爱。依不用寂定者。不依不用定三昧周有想无想及余三。若依涅槃想。解脱最胜者。想解脱有想无想。若住涅槃休息者。彼住不起于彼退。亦无所起。世尊说曰</p><p>彼住而不起无数劫净眼</p><p>于彼两解脱识誓知所传</p><p>彼住而不起无数劫净眼者。答曰。亦当久住于彼两解脱。于彼般涅槃。识誓知所传。我于彼退转。亦复不生。不于生入而入誓</p><p>犹火风所吹没灭不可数</p><p>仁能名色脱没灭不可数</p><p>犹火风所吹没灭不可数者。如彼火不于空中灭。亦不可称数。若往东方西方。能仁名色脱者。名四无色阴色身身。彼俱曰名色</p><p>没冥必还明若没如今无</p><p>作有常之想净眼与我说</p><p>没冥必还明。问云何为明。犹如日明照。若没如今无者。若有常若断灭。还处入净聚。净眼与我说与我布现。尊无所不知</p><p>没灭不可数愿说所无者</p><p>散离一切爱亦散一切义</p><p>没灭不可数者。有限之法彼则无也。愿说所无者。诸爱尽者诸爱限数。彼无有此爱诸阴。由行生者诸阴限数。彼无此阴。散离一切爱者。亦散一切义。三界爱尽</p><p>二问释种子净眼不授决</p><p>乃至三大仙授决我欲闻</p><p>二问释种子净眼不授决。彼尔时作二问。云何观<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。亦不见死生。世尊不与授决。何以故。欲教训之。彼亦闻三语而授决。于中作是说。乃至三大仙授决我欲闻</p><p>今世及后世梵天上诸天</p><p>见亦无所知瞿昙者德至</p><p>今世者是人世。后世谓恶趣。梵天者谓梵迦夷天。诸天者谓欲界天。见亦无所知者云何见。瞿昙普德至者。世尊声振四方。如是世谛一切智。犹如转法轮。说声闻乃至梵天</p><p>若欲如是见义论之所归</p><p>云何观世间而不见死生</p><p>若欲如是见者。如是成就妙智。世间及天梵天而不知见。义论之所归者。欲闻受决之所归。云何观世间而不见死生者。云何观六入。不生余境界</p><p>观世皆悉空愚王亦专念</p><p>以能拔我见如是越生处</p><p>观世皆悉空亦自见愚王。尔时世尊为说空常。专不移动念者。不念邪事游意止中。我见者。是愚身见而灭之。如是度死处。亦不生阎浮境界。尊者拔苏卢作是说。闻断灭有常。尔时世尊不与授决。彼亦闻第三句迹而授决。于中作是说。二问释种子。今世后世者是欲界天。梵天者梵迦夷天。及天者及余<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天。见亦不知者。住中迹中而不知。如是越所见者。成就如此妙智。世及天者不能解知。如此中亦断灭有常。观世断灭有常。而不见死生。云何除断灭有常。而住中迹越生死岸。观世皆悉空者。自还所觉。若断灭有常。彼观皆悉空。住其边际。如是观六入。则能越生死岸</p><p>天女众所围亦亲近妖魅</p><p>彼园名愚惑云何获安处</p><p>天女众所围。彼<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人。闻三十三天天女众所围者。以天音乐亦亲近妖魅。三十三天在街巷头。门阈左右园果浴池。四天王有诸女鬼。颜色弊恶声响粗犷。喜恐怖人。彼园名愚惑者。杂园果甚乐无极。天五乐自娱园能惑人。云何获安处者。云何得出要</p><p>彼道名曰等彼方名不恐</p><p>事亦名无声觉法名具足</p><p>彼道名曰等者。无曀亦不曲。彼方名不恐者。涅槃名曰方。于彼无生病老死之恐。事亦名无声者。<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>是名事。无有结着故曰无声若。贤圣无漏三昧。觉法之具足者。觉出要与共相应</p><p>惭亦不有缘念者将从人</p><p><a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>能御车等见先导前</p><p>惭亦不有缘者。惭诸结秽恶。彼犹如船车。如是缘惭而起道意。不复思惟。念者将从人。犹如车以虎皮覆上。若豹皮缠恐不得其便不可亲近。若怨家盗贼不得其便。如是念。将从不得亲近诸恶行。智慧能御车者。犹如侍车人如好车。如是道智慧最。是道犹如御车者。知道非道犹如御车者。侍车而行应进则进。如是智慧欲退时。便起勇猛意。意若炽盛便使休息。犹如御车者。知进便进。如是智慧思惟方便。等见先导前者。等见先在前而修行道。世尊亦说。等见生等志。复作是说。如彼贤<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。八种道本亦说故曰惭。亦是彼缘行学增上戒。念者将从人也。学增上心说智慧御车也。等见先导前者。复作是说。彼车是其处众行具足惭。是其缘者有三种。道等语业等命。念者将从人等念也。智慧能御车者。等志等方便也。等见先导前者。即等见也。复作是说。诸止观是食者。如本车所说。惭亦是缘者。戒是其食。念将从人者。止是其食。智慧能御车者。观是其食</p><p>诸有如此乘众萌男女类</p><p>彼乘如此车往至无住方</p><p>诸有如此乘众萌男女类者。彼已修行道。以乘往至无住方。彼已修行道。未至涅槃。便使至涅槃也</p><p>五断五已灭修行五上者</p><p>五数<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>过是谓已度流</p><p>五断者。五盖也。五已灭者。五下分结也。修行五上者是五根也。五数比丘过者。已越五上分结。是谓度流者。已度生死流也。复作是说。五断者。五邪见也。五已灭是五身结也。修行五上者。五禅种。五数比丘过者。已度彼欲数。如所说着欲是谓欲数。是谓度流者。已度欲流。复作是说。五断者。五趣中结也。已灭五者。是五道也。修行五上者。五解脱入也。五数比丘过者。即越彼五趣。是谓度流者。度生死流也。复作是说。五断者。五心缚也。已灭五者。心五秽也。修行五上者。五念结也。五数比丘过者。已度心五缚也。是谓是度流者。度生死流也</p></div>"
}]