[{
    "title": "金刚般若波罗蜜经论 第1511部",
    "author": "菩提流支 译",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>论 卷上</p><p>天亲菩萨造</p><p>元魏<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>流支译</p><p>法门句义及次第<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>不解离明慧</p><p>大智通达教我等归命无量<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>身</p><p>应当敬彼如是尊头面礼足而顶戴</p><p>以能荷佛难胜事摄受<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>利益故</p><p>如是我闻。一时婆伽婆。在舍婆提城祇树给孤独园。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>众千二百五十人俱。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。食时着衣持钵。入舍婆提大城乞食于其城中。次第乞食已。还至本处饭食讫。收衣钵洗足已。如常敷座结加趺坐。端身而住<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>不动</p><p>尔时诸比丘来诣佛所。到已顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足。右绕三匝退坐一面</p><p>尔时慧命须菩提。在大众中即从坐起。偏袒右肩右膝着地。向佛合掌恭敬而立。白佛言。希有世尊。如来应供正遍知。善护念诸菩萨。善付嘱诸菩萨</p><p>论曰。善护念者。依根熟菩萨说。善付嘱者。依根未熟菩萨说。云何善护念诸菩萨。云何善付嘱诸菩萨。偈言</p><p>巧护义应知加彼身同行</p><p>不退得未得是名善付嘱</p><p>云何加彼身同行。谓于菩萨身中与<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>力。令成就<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>故。又彼菩萨摄取众生。与<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>力。是名善护念应知。云何不退得未得。谓于得未得功德中。惧其退失付授智者。又得不退者。不舍大乘故。未得不退者。于大乘中欲令胜进故。是名善付嘱。应知</p><p>经曰。世尊云何菩萨大乘中。发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。应云何住。云何<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。云何降伏其心</p><p>尔时佛告须菩提。善哉善哉。须菩提。如汝所说。如来善护念诸菩萨。善付嘱诸菩萨。汝今谛听当为汝说。如菩萨大乘中发阿耨多罗三藐三菩提心。应如是住。如是修行。如是降伏其心。须菩提白佛言。世尊。如是愿乐欲闻。佛告须菩提。诸菩萨生如是心。所有一切众生众生所摄。若卵生。若胎生。若湿生。若化生。若有色若无色。若有想若无想。若非有想非无想。所有众生界众生所摄。我皆令入无余<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>而灭度之。如是灭度无量无边众生。实无众生得灭度者。何以故。须菩提。若菩萨有众生相。即非菩萨。何以故非。须菩提。若菩萨起众生相人相寿者相。则不名菩萨</p><p>论曰。云何菩萨大乘中住。问答示现此义。偈言</p><p>广大第一常其心不颠倒</p><p>利益深心住此乘功德满</p><p>此偈说何等义。若菩萨有四种深利益菩提心。此是菩萨大乘住处。何以故。此深心功德满。足是故四种深利益摄取心生。能住大乘中</p><p>何等为四种心。一广二第一三常四不颠倒。云何广心利益。如经诸菩萨生如是心所有一切众生众生所摄。乃至所有众生界众生所摄故</p><p>云何第一心利益。如经我皆令住无余涅槃而灭度之故</p><p>云何常心利益。如经如是灭度无量无边众生实无众生得灭度者。何以故。须菩提。若菩萨有众生相即非菩萨故。此义云何。菩萨取一切众生犹如我身。以此义故。菩萨自身灭度。无异众生得灭度者。若菩萨于众生起众生想。不生我想者则不应得菩萨名。如是取众生如我身。常不舍离。是名常心利益</p><p>云何不颠倒心利益。如经。何以故非。须菩提。若菩萨起众生相人相寿者相。则不名菩萨故。此示现远离依止身见众生等相故</p><p>论曰。自此以下说菩萨如大乘中住修行。此事应知</p><p>经曰。复次须菩提。菩萨不住于事。行于<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。无所住行于布施。不住色布施。不住声香味触法布施。须菩提。菩萨应如是布施。不住于相想。何以故。若菩萨不住相布施。其福德聚不可思量。须菩提。于汝意云何。东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>可思量不。须菩提言。不也世尊。佛言如是。须菩提。南西北方四维上下虚空可思量不。须菩提言。不也世尊。佛言。如是如是。须菩提。菩萨无住相布施。福德聚亦复如是不可思量</p><p>佛复告须菩提。菩萨但应如是行于布施</p><p>论曰。偈言</p><p>檀义摄于六资生<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>法</p><p>此中一二三名为修行住</p><p>何故唯檀波罗蜜。名说<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。一切波罗蜜檀波罗蜜相义示现故。一切波罗蜜檀相义者。谓资生无畏法檀波罗蜜应知。此义云何。资生者。即一檀波罗蜜体名故。无畏檀波罗蜜者有二。谓尸波罗蜜羼提波罗蜜。于已作未作恶不生怖畏故。法檀波罗蜜者有三。谓毗梨耶波罗蜜等不疲惓。善知心如实<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>故此即是菩萨摩诃萨修行住。如向说三种檀摄六波罗蜜。是名菩萨摩诃萨修行住。云何菩萨不住于事行于布施。如是等偈言</p><p>自身及报恩<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>斯不着</p><p>护存已不施防求于异事</p><p>不住于事者。谓不着自身。无所住者。谓不着报恩。报恩者。谓<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>恭敬种种等门。如经无所住故。不住色等者。谓不着果报。何故如是不住行于布施。偈言。护存已不施防求于异事。若着自身不行布施。为护此事于身不着。若着报恩果报舍佛菩提。为异义行于布施。为防是行于事不着</p><p>自此以下说云何菩萨降伏其心。此事应知。云何降伏心。名之降伏。偈言</p><p>调伏彼事中远离取相心</p><p>及断种种疑亦防生成心</p><p>此文说何义。所谓不见施物受者及施者。偈言。调伏彼事中远离取相心故。如经须菩提菩萨应如是布施不住于相想故</p><p>次说布施利益。何以故。此中有疑。若离施等相想。云何能成施福。彼人如是布施。其福转多故</p><p>次说布施利益。如经。何以故。若菩萨不住相布施。其福德聚不可思量。须菩提。于意云何。东方虚空可思量不。须菩提言。不也世尊。如是等。何故说修行后。次显布施利益。以得降伏心故。是以次说布施利益。此义云何。不住相想行于布施。成就义故</p><p>自此以下一切修多罗。示现断生疑心。云何生疑。若不住于法行于布施。云何为佛菩提行于布施断彼疑心</p><p>经曰。须菩提。于意云何。可以相成就见如来不。须菩提言。不也世尊。不可以相成就得见如来。何以故。如来所说相即非相</p><p>佛告须菩提。凡所有相皆是<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。若见诸相非相。则非妄语。如是诸相非相。则见如来</p><p>论曰。偈言</p><p>分别有为体防彼成就得</p><p>三相异体故离彼是如来</p><p>此义云何。若分别有为体。是如来以有为相为第一。以相成就见如来。为防彼相成就得如来身</p><p>如经。不可以相成就得见如来故。何以故。如来名<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>身故。如经。何以故。如来所说相即非相。偈言。三相异体故离彼是如来。彼相成就即非相成就。何以故。三相异如来体故</p><p>如经。佛告须菩提。凡所有相皆是妄语。若见诸相非相。则非妄语。如是诸相非相。则见如来。此句显有为虚妄故。偈言。离彼是如来。示现彼处三相无故。相非相相对故。彼处生住灭异体不可得故。此句明如来体非有为故。菩萨如是知如来为佛菩提行于布施。彼菩萨不住于法行于布施。成如是断疑故</p><p>自此以下。尊者须菩提生疑致问</p><p>经曰。须菩提白佛言。世尊。颇有众生。于未来世末世。得闻如是修多罗章句生实相不。佛告须菩提。莫作是说。颇有众生于未来世末世。得闻如是修多罗章句生实相不。佛复告须菩提。有未来世末世。有菩萨摩诃萨。法欲灭时有持戒修福德智慧者。于此修多罗章句。能生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。以此为实</p><p>佛复告须菩提。当知彼菩萨摩诃萨非于一佛二佛三四五佛所修行供养。非于一佛二佛三四五佛所而种善根</p><p>佛复告须菩提。已于无量百千万诸佛所修行供养。无量百千万诸佛所种诸善根。闻是修多罗。乃至一念能生净信。须菩提。如来悉知是诸众生。如来悉见是诸众生。须菩提。是诸菩萨生如是无量福德聚。取如是无量福德。何以故。须菩提。是诸菩萨无复我相众生相人相寿者相。须菩提。是诸菩萨无<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>亦非无法相。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>亦非无相。何以故。须菩提。是诸菩萨若取法相。则为着我人众生寿者。须菩提。若是菩萨有法相。即着我相人相众生相寿者相。何以故。须菩提。不应取法。非不取法。以是义故。如来常说筏喻法门。是法应舍。非舍法故</p><p>论曰。此义云何。向依波罗蜜说不住行于布施。说因深义。向依如来非有为体。说果深义。若尔未来恶世人不生信心。云何不空说。为断彼疑。佛答此义</p><p>如经。佛告须菩提。莫作是说。乃至非舍法故。此义云何。偈言</p><p>说<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>深义于彼恶世时</p><p>不空以有实菩萨<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>备</p><p>此义云何。彼恶世时。菩萨具足持戒功德智慧故。能生信心。以此义故名不空说。又偈言</p><p>修戒于过去及种诸善根</p><p>戒具于诸佛亦说功德满</p><p>如经。佛复告须菩提。当知彼菩萨摩诃萨非于一佛二佛三四五佛所修行供养。非于一佛二佛三四五佛所而种善根</p><p>佛告须菩提。已于无量百千万诸佛所修行供养。无量百千万诸佛所种诸善根故。此经文明于过去诸佛具足持戒供养彼佛。亦种诸善根。如是次第。彼持戒具足。功德具足故。又偈言</p><p>彼寿者及法远离于取相</p><p>亦说知彼相依八八义别</p><p>此义云何。复说<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>义不断故。说何等义。明彼菩萨离于寿者相离于法相故。以对彼相故说此义。偈言。依八八义别故。此复云何。依四种寿者相。有四种义故。依四种法相有四种义故。是故依八相有八种义差别故。此义复云何。偈言</p><p>差别相续体不断至命住</p><p>复趣于异道是我相四种</p><p>此义云何。明寿者相义故。何者是四种。一者我相。二者众生相。三者<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>。四者寿者相。我相者见<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>差别。一一阴是我。如是妄取是名我相。众生相者。见身相续不断。是名众生相。命相者。一报命根不断住故。是名命相。寿者相者。命根断灭复生<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>。是名寿者相。如经。何以故。须菩提。是诸菩萨无复我相众生相人相寿者相故。云何及法。偈言</p><p>一切空无物实有不可说</p><p>依言辞而说是法相四种</p><p>何者是四种。一者法相。二者非法相。三者相。四者非相。此义云何。有可取能取一切法。无故言无法相。以无物故。彼法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>空实有故。言亦非无法相。彼空无物。而此不可说有无故言无相。依言辞而说故。言亦非无相。何以故。以于无言处依言相说。是故依八种差别义。离八种相。所谓离人相离法相。是故说有智慧</p><p>如经。须菩提。是诸菩萨无法相。亦非无法相。无相亦非无相故。有智慧便足。何故复说持戒功德。为示现生实相差别义故。云何示现。偈言</p><p>彼人依信心恭敬生实相</p><p>闻声不正取正说如是取</p><p>此义云何。彼人有持戒功德。依信心恭敬能生实相。是以说彼义故。次言闻说如是修多罗章句乃至一念生净信者。是故不但说般若。又有智慧者。不如声取义。随顺第一义智正说如是取。能生实相。是以说此义故。次言须菩提不应取法非不取法。不应取法者。不应如声取法。非不取法者。随顺第一义智正说如是取。彼菩萨闻说如是修多罗章句生实相故。又经复言。须菩提。如来悉知是诸众生。如来悉见是诸众生。如是等。此明何义。偈言</p><p>佛非见果知愿智力现见</p><p>求供养恭敬彼人不能说</p><p>此义云何。彼持戒等人。诸佛如来非见果比知。云何知。偈言。愿智力现见故。如来悉知是诸众生便足。何故复说。如来悉见是诸众生。若不说如来悉见是诸众生。或谓如来以比智知。恐生如是心故。若尔但言如来悉见是诸众生便足。何故复说如来悉知是诸众生。若不说如来悉知是诸众生。或谓如来以肉眼等见。为防是故。何故如是说。以有二语故。又何故如来如是说。偈言。求供养恭敬彼人不能说故。此义云何。若有人欲得供养恭敬。自叹有持戒等功德。彼人则不能说。是人自知故。诸佛如来善知彼何等人有何等行。是故彼人不能自说</p><p>又是诸菩萨生如是无量福德聚。取如是无量福德者。此义云何。生者能生因故。取者熏修自体果义故。又何以故。须菩提。是诸菩萨若取法相。则为着我人众生寿者。此义云何。但有无明使无现行粗<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。示无我见故。又经言。以是义故。如来常说栰喻法门。是法应舍非舍法者。有何次第。偈言</p><p>彼不住随顺于法中证智</p><p>如人舍船栰法中义亦然</p><p>此义云何。示修多罗等法中证智不住故。以得证智舍法故。如到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>舍栰故。随顺者。随顺彼证智法。彼法应取。如人未到彼岸取栰故</p><p>自此以下。说何等义。为遮异疑故。云何异疑。向说不可以相成就得见如来。何以故。如来非有为相得名故。若如是云何释迦牟尼佛。得阿耨多罗三藐三菩提。说名为佛。云何说法。是名异疑。为断此疑。云何断疑</p><p>经曰。复次佛告慧命须菩提。须菩提。于意云何。如来得阿耨多罗三藐三菩提耶。如来有所说法耶。须菩提言。如我解佛所说义。无有定法如来得阿耨多罗三藐三菩提。亦无有定法如来可说。何以故。如来所说法。皆不可取不可说。非法非非法。何以故。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>皆以无为法得名</p><p>论曰。以是义故。释迦牟尼佛。非佛亦非说法。此义云何。偈言</p><p>应化非真佛亦非说法者</p><p>说法不二取无说离言相</p><p>此义云何。佛有三种。一者法身佛。二者报佛。三者化佛。又释迦牟尼名为佛者。此是化佛。此佛不证阿耨多罗三藐三菩提。亦不说法。如经无有定法如来得阿耨多罗三藐三菩提。亦无有定法如来可说。若尔何故经言。何以故。如来所说法皆不可取不可说。如是等。有人谤言。如来一向不说法。为遮此故。偈言。应化非真佛亦非说法者故。说法不二取无说离言相者。听者不取法不取非法故。说者亦不二说法非法故。何以故。彼法非法非非法。依何义说。依真如义说。非法者。一切法无体相故。非非法者。彼真如无我相实有故。何故唯言说不言证。有言说者。即成证义故。若不证者。则不能说。如经。何以故。一切圣人皆以无为法得名。此句明何义。彼法是说因故。何以故。一切圣人依真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>清净得名。以无为法得名故。以此义故。彼圣人说彼无为法。复以何义。如彼圣人所证法。不可如是说。何况如是取。何以故。彼法远离言语相。非可说事故。何故不但言佛。乃说一切圣人。以一切圣人依真如清净得名故。如是具足清净如分清净故</p><p>经曰。须菩提。于意云何。若满三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>七宝。以用布施。须菩提。于意云何。是善男子善女人所得福德。宁为多不。须菩提言。甚多婆伽婆。甚多修伽陀。彼善男子善女人得福甚多。何以故。世尊。是福德聚即非福德聚。是故如来说福德聚福德聚</p><p>佛言。须菩提。若善男子善女人。以满三千大千世界七宝。持用布施。若复于此经中<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>乃至四句偈等。为他人说。其福胜彼无量不可数。何以故。须菩提。一切诸佛阿耨多罗三藐三菩提法。皆从此经出。一切诸佛如来皆从此经生。须菩提。所谓佛法。佛法者即非佛法。是名佛法</p><p>论曰。此说胜福德譬喻校量。示现何义。法虽不可取不可说。而不空故。偈言</p><p>受持法及说不空于福德</p><p>福不趣菩提二能趣菩提</p><p>何故说言。世尊是福德聚即非福德聚者。偈言。福不趣菩提二能趣菩提故。此义云何。彼福德不趣大菩提。二能趣大菩提故。何者为二</p><p>一者受持。二者演说。如经受持乃至四句偈等。为他人说故。何故名福德聚。聚义有二种。一者积聚义。二者进趣义。如人担重说名为聚。如是彼福德聚以有积聚义故。说名为聚。于菩提不能进趣故。名为非福德聚。此二能趣大菩提。是故于彼福德中此福为胜。云何此二能得大菩提。如经何以故。须菩提一切诸佛阿耨多罗三藐三菩提法皆从此经出。一切诸佛如来皆从此经生故。云何说一切诸佛菩提法皆从此经出。云何说一切诸佛如来皆从此经生。偈言</p><p>于实名了因亦为余生因</p><p>唯独诸佛法福成第一体</p><p>此义云何。菩提者名为法身。彼体实无为。是故于彼法身。此二能作了因。不能作生因。余者受报相好<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>相好佛。于此为生因。以能作菩提因。是故名因。显彼福德中此福胜故。如经。何以故。须菩提乃至皆从此经生故。云何成此义。偈言。唯独诸佛法福成第一体故</p><p>须菩提所谓佛法佛法者即非佛法者。彼诸佛法余人不得。是故彼佛法名为佛法。是故言唯独诸佛法。第一不共义。以能作第一法因。是故彼福德中。此福为胜。如是成福德多故</p><p>经曰。须菩提。于意云何。须陀洹能作是念。我得须陀洹果不。须菩提言。不也世尊。何以故。实无有法名须陀洹。不入色声香味触法。是名须陀洹。佛言。须菩提。于意云何。斯陀含能作是念。我得斯陀含果不。须菩提言。不也世尊。何以故。实无有法名斯陀含。是名斯陀含。须菩提。于意云何。阿那含能作是念。我得阿那含果不。须菩提言。不也世尊。何以故。实无有法名阿那含是名阿那含。须菩提。于意云何。阿罗汉能作是念。我得阿罗汉不。须菩提言。不也世尊。何以故。实无有法名阿罗汉。世尊。若阿罗汉作是念。我得阿罗汉。即为着我人众生寿者。世尊。佛说我得无诤<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>最为第一。世尊。说我是离欲阿罗汉。世尊。我不作是念。我是离欲阿罗汉。世尊。我若作是念。我得阿罗汉。世尊。则不说我无诤行第一。以须菩提实无所行。而名须菩提无诤无诤行</p><p>论曰。向说圣人无为法得名。以是义故。彼法不可取不可说。若须陀洹等圣人取自果。云何言彼法不可取。既如证如说云何成不可说。自下经文为断此疑。成彼法不可取不可说故。偈言</p><p>不可取及说自果不取故</p><p>依彼善吉者说离二种障</p><p>此义云何。以圣人无为法得名。是故不取一法。不取者不取六尘境界。以是义故。名不取逆流者。如经不入色声香味触法。是名须陀洹故。乃至阿罗汉不取一法。以是义故。名为罗汉。然圣人非不取无为法。以取自果故。若圣人起如是心我能得果。即为着我等者。此义云何。以有使烦恼非行烦恼。何以故。彼于证时离取我等烦恼。是故无如是心我能得果。何故尊者须菩提。自叹身得受记。以自身<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。为于彼义中生信心故。何故唯说无诤行。为明胜功德故。为生深信故。何故言以须菩提实无所行。而名须菩提无诤无诤<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。偈言依彼善吉者说离二种障故。二种障者。一者烦恼障。二者三昧障。离彼<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>故言无所行。以是义故。说名二种诤离彼二种障故。名为无诤无诤行</p><p>经曰。佛告须菩提。于意云何。如来昔在然灯佛所。得阿耨多罗三藐三菩提法不。须菩提言。不也世尊。如来在然灯佛所。于法实无所得阿耨多罗三藐三菩提</p><p>论曰。复有疑释迦如来昔在然灯佛所受法。彼佛为此佛说法。若如是云何彼法不可说不可取。为断此疑。说彼佛所无法可取。如经不也世尊如来在然灯佛所。于法实无所得阿耨多罗三藐三菩提故。何故如是说。偈言</p><p>佛于然灯语不取理实智</p><p>以是真实义成彼无取说</p><p>此义云何。释迦如来于然灯佛所。言语所说不取证法故。以是义故。显彼证智不可说不可取。偈言以是真实义成彼无取说故</p><p>又若圣人无为法得名。是法不可取不可说</p><p>云何诸菩萨取庄严净佛国土。云何受乐报佛取自法王身。云何余世间复取彼是法王身。自下经文为断此疑</p><p>经曰。佛告须菩提。若菩萨作是言。我庄严佛国土。彼菩萨不实语。何以故。须菩提。如来所说庄严佛土者。则非庄严是名庄严佛土。是故须菩提。诸菩萨摩诃萨。应如是生清净心。而无所住。不住色生心。不住声香味触法生心。应无所住而生其心</p><p>须菩提。譬如有人身如须弥山王。须菩提。于意云何。是身为大不。须菩提言。甚大世尊。何以故。佛说非身是名大身。彼身非身是名大身</p><p>论曰。此义如是应知。云何知。偈言</p><p>智习<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>通如是取<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a></p><p>非形第一体非严庄严意</p><p>此义云何。诸佛无有庄严国土事。唯诸佛如来真实智慧习识通达。是故彼土不可取。若人取彼国土形相。作是言我成就清净佛土。彼不实说</p><p>如经。何以故。须菩提如来所说庄严佛土者。则非庄严是名庄严佛土故。何故如是说。偈言非形第一体非严庄严意故。庄严有二种。一者形相二者第一义相。是故说非严庄严。又非庄严佛土者。无有形相故非庄严。如是无庄严即是第一庄严。何以故。以一切功德成就庄严故。若人分别佛国土。是有为形相。而言我成就清净佛国土。彼菩萨住于色等境界中生如是心。为遮此故。如经是故须菩提。诸菩萨摩诃萨。应如是生清净心而无所住。不住色生心。不住声香味触法生心。应无所住而生其心故。前言云何受乐报佛取自法王身。云何余世间复取彼是法王身。为除此疑。说受乐报佛体同彼须弥山王镜像义故。此义云何偈言</p><p>如山王无取受报亦复然</p><p>远离于诸漏及有为法故</p><p>此义云何。如须弥山王势力高远故。名为大。而不取彼山王体我是山王。以无分别故。受乐报佛亦如是。以得无上法王体故名为大。而不取彼法王体我是法王。以无分别故。何故无分别。以无分别故</p><p>如经何以故。佛说非身是名大身。彼身非身是名大身故。何故如是说。偈言远离于诸漏及有为法故。彼受乐报佛体离于诸漏。若如是即无有物。若如是即名有物。以唯有清净身故。以远离有为法故。以是义故。实有我体以不依他缘住故</p><p>金刚般若波罗蜜经论卷上</p><p>金刚般若波罗蜜经论 卷中</p><p>天亲菩萨造</p><p>元魏天竺三藏菩提流支译</p><p>经曰。佛言须菩提。如恒河中所有沙数。如是沙等恒河。于意云何。是诸恒河沙宁为多不。须菩提言。甚多世尊。但诸恒河尚多无数。何况其沙。佛言。须菩提。我今实言告汝。若有善男子善女人。以七宝满尔所恒河沙数世界。以施诸佛如来。须菩提。于意云何。彼善男子善女人得福多不。须菩提言。甚多世尊。彼善男子善女人得福甚多。佛告须菩提。以七宝满尔所恒河沙世界持用布施。若善男子善女人。于此法门乃至受持四句偈等为他人说。而此福德胜前福德。无量阿僧祇</p><p>论曰。前已说多福德譬喻。何故此中复说。偈言</p><p>说多义差别亦成胜挍量</p><p>后福过于前故重说胜喻</p><p>此义云何。前说三千世界譬喻明福德多。今重说无量三千世界故。何故不先说此喻。为渐化众生令生信心上妙义故。又前未显以何等胜功德能得大菩提故。以此喻成彼功德。是故重说胜喻</p><p>经曰。复次须菩提。随所有处说是法门。乃至四句偈等。当知此处一切世间<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗皆应供养如佛塔庙。何况有人尽能受持读诵此经。须菩提。当知是人成就最上第一希有之法。若是经典所在之处。则为有佛。若尊重似佛。尔时须菩提白佛言。世尊。当何名此法门。我等云何奉持。佛告须菩提。是法门名为金刚般若波罗蜜。以是名字汝当奉持。何以故。须菩提佛说般若波罗蜜则非般若波罗蜜。须菩提。于意云何。如来有所说法不。须菩提言。世尊。如来无所说法。须菩提。于意云何。三千大千世界所有微尘是为多不。须菩提言。彼微尘甚多。世尊。何以故。须菩提。是诸微尘。如来说非微尘是名微尘。如来说世界非世界是名世界。佛言。须菩提。于意云何。可以三十二大人相见如来不。须菩提言。不也世尊。何以故。如来说三十二大人相即是非相。是名三十二大人相</p><p>论曰。云何成彼胜福。偈言</p><p>尊重于二处因习证大体</p><p>彼因习烦恼此降伏染福</p><p>此义云何。尊重于二处者。一者所说处。随何等处说此经。令生尊重奇特相故。二者能说人。随何等人能受持及说。以尊重经论故。非七宝等。随何处舍随何人能舍。如是生敬重故。此法门与一切诸佛如来证法作胜因故。如经须菩提言世尊如来无所说法故。此义云何。无有一法唯独如来说。余佛不说故。彼珍宝布施福德是染烦恼因。以能成就烦恼事故。此因示现远离烦恼因故。是故说地微尘喻如经须菩提是诸微尘。如来说非微尘是名微尘。如来说世界非世界是名世界故。何故如是说。彼微尘非贪等烦恼体。以是义故名为地微尘故。彼世界非烦恼染因界。是故说世界。此明何义。彼福德是烦恼尘染因。是故于外无记尘彼福德善根为近。何况此福德能<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>菩提故。及成就大丈夫相福德中胜故。是故受持演说此法门。能成佛菩提胜彼福德。何以故。彼相于佛菩提非相故。以彼非法身故。是故说大丈夫相。以彼相故。此受持及说福德能成佛菩提。是故彼非胜故。又彼福德能降伏珍宝等福。何况此福故能降伏是故。此福最近最胜。如是彼檀等福德中此福德最如是成已</p><p>经曰。佛言须菩提。若有善男子善女人。以恒河沙等身命布施。若复有人于此法门中。乃至受持四句偈等。为他人说其福甚多。无量阿僧祇。尔时须菩提。闻说是经深解义趣。涕泪悲泣扪泪而白佛言。希有婆伽婆。希有修伽陀。佛说如是甚深法门。我从昔来所得慧眼未曾得闻如是法门。何以故。须菩提。佛说般若波罗蜜。即非般若波罗蜜。世尊。若复有人得闻是经。信心清净则生实相。当知是人成就第一希有功德。世尊。是实相者则是非相。是故如来说名实相实相。世尊。我今得闻如是法门。信解受持不足为难。若当来世其有众生。得闻是法门信解受持。是人则为第一希有。何以故。此人无我相人相众生相寿者相。何以故。我相即是非相。人相众生相寿者相。即是非相。何以故。离一切诸相则名诸佛。佛告须菩提。如是如是。若复有人得闻是经。不惊不怖不畏。当知是人甚为希有。何以故。须菩提。如来说第一波罗蜜。非第一波罗蜜。如来说第一波罗蜜者。彼无量诸佛亦说波罗蜜。是名第一波罗蜜</p><p>论曰。自下经文重明彼福德中此福转胜。此义云何。偈言</p><p>苦身胜于彼希有及上义</p><p>彼智岸难量亦不同余法</p><p>坚实解深义胜余修多罗</p><p>大因及清净福中胜福德</p><p>此二偈说何义。捐舍身命重于舍资生珍宝等。彼如是舍无量身命。果报福德此福德胜彼福。何以故。彼舍身命苦身心故何况为法舍故。念彼身苦。慧命须菩提尊重法故。悲泣流泪。如经尔时须菩提闻说是经深解义趣涕泪悲泣故。此法门希有。何以故。尊者须菩提。虽有智眼昔来未曾得闻。是故希有如经我从昔来所得慧眼。未曾得闻如是法门故。又此法门第一。以说名般若波罗蜜故此云何成以上义故。如经何以故须菩提佛说般若波罗蜜。即非般若波罗蜜故。何故如是说彼智岸故。彼智岸无人能量。是故非波罗蜜又此法门不同。何以故。此中有实相故。余者非实相。除佛法余处无实故。以彼处未曾有未曾生信。以是义故。如经世尊若复有人得闻是经。信心清净则生实相。当知是人成就第一希有功德故。又此法门坚实深妙。何以故。受持此经思量修习。不起我等相故。又不起我等相者。示可取境界不倒相故。我等相即非相者。示能取境界不倒相故。此二明我空法空无我智故。如是次第如经何以故。此人无我相人相众生相寿者相。何以故。我相即是非相。人相众生相寿者相即是非相。何以故。离此一切诸相则名诸佛故。如来为须菩提说如是义。惊者谓非处生惧是故名惊。以可诃故。如非正道行故。怖者心体怖故。以起不能断疑心故。畏者一向怖故。其心毕竟惊怖堕故远离彼处。如经不惊不怖不畏故。又此法门胜余修多罗如经。何以故。须菩提如来说第一波罗蜜非第一波罗蜜故。又此法。门名为大因。如经如来说第一波罗蜜者故又此法门名为清净。以无量佛说故。如经彼无量诸佛亦说波罗蜜。是名第一波罗蜜故。彼珍宝檀等无如是功德。是故彼福德中此福为胜。如是成已</p><p>论曰。自下经文复为断疑。云何疑。向说彼身苦以彼舍身苦身果报而彼福是劣。若尔依此法门受持演说。诸菩萨行苦行。彼苦行亦是苦果。云何于此法门不成苦果。为断此疑故</p><p>经曰。须菩提如来说忍辱波罗蜜。即非忍辱波罗蜜。何以故。须菩提。如我昔为歌利王割截身体。我于尔时无我相无人相。无众生相无寿者相。无相亦非无相。何以故。须菩提。我于往昔节节支解时。若有我相人相众生相寿者相应生嗔恨。须菩提。又念过去。于五百世作忍辱仙人。于尔所世无我相无人相无众生相无寿者相。是故须菩提。菩萨应离一切相发阿耨多罗三藐三菩提心。何以故。若心有住则为非住。不应住色生心。不应住声香味触法生心。应生无所住心。是故佛说菩萨心不住色布施。须菩提。菩萨为利益一切众生。应如是布施。须菩提言。世尊。一切众生相即是非相。何以故。如来说一切众生即非众生</p><p>论曰。此示何义。偈言</p><p>能忍于苦行以苦行有善</p><p>彼福不可量如是最胜义</p><p>离我及恚相实无于苦恼</p><p>共乐有慈悲如是苦行果</p><p>此二偈说何义。虽此苦行同于苦果。而此苦行不疲惓。以有羼提波罗蜜名为第一故。彼岸有二种义。一者波罗蜜清净善根体。二者彼岸功德不可量。如经即非波罗蜜故。非波罗蜜者。无人知彼功德岸故。言非波罗蜜。是故为得第一法。此苦行胜彼舍身。何况离我相嗔恚相故。又此行无苦。不但无苦。及有乐以有慈悲故。如经我于尔时无我相。乃至无相亦非无相故。此明慈悲心相应故如是说。若有菩萨不离我相等。彼菩萨见苦行苦。亦欲舍菩提心。为彼故说如经。是故须菩提。菩萨应离一切相等。此明何义。未生第一菩提心者。有如是过。为防此过。偈言</p><p>为不舍心起修行及坚固</p><p>为忍波罗蜜习彼能学心</p><p>此义云何。为何等心起行相而修行。为何等心不舍相。偈言为忍波罗蜜习彼能学心故。又第一义心者。已入初地得羼提波罗蜜故。此名不住心。如经是故须菩提。菩萨应离一切相。发阿耨多罗三藐三菩提心故。何以故。示不住生心义故。若心住于色等法彼心不住佛菩提。此明不住心行于布施。此经文说不住心起行方便。以檀波罗蜜摄六波罗蜜故。云何为利益众生修行。而不名住于众生事。为断此疑。如经须菩提菩萨为利益一切众生。应如是布施故。此明何义。偈言</p><p>修行利众生如是因当识</p><p>众生及事相远离亦应知</p><p>此义云何。利益是因体故。彼修行利益众生。非取众生相事故。何者是众生事。偈言</p><p>假名及阴事如来离彼相</p><p>诸佛无彼二以见实法故</p><p>此说何义。名相众生及彼阴事故。云何彼修行远离众生事相。即彼名相相非相。以无彼实体故。以是义故。众生即非众生。以何等法。谓五阴名众生。彼五阴无众生体。以无实故。如是明法无我人无我。何以故。一切诸佛如来。远离一切相故。此句明彼二相不实。偈言如来离彼相诸佛无彼二以见实法故。此说何义。若彼二实有者。诸佛如来应有彼二相。何以故。诸佛如来实见故</p><p>经曰。须菩提。如来是真语者实语者。如语者不异语者。须菩提。如来所得法所说法。无实无妄语</p><p>论曰。此中有疑于证果中无道。云何彼于果能作因。为断此疑。如经须菩提如来是真语者实语者如语者不异语者故。此四句说何等义偈言</p><p>果虽不住道而道能为因</p><p>以诸佛实语彼智有四种</p><p>此义云何。彼境界有四种。是故如来有四种实语。云何四种。偈言</p><p>实智及小乘说摩诃衍法</p><p>及一切授记以不虚说故</p><p>此明何义。以如来实智不妄说。佛菩提及小乘大乘授记之事皆不妄说。以是四境故。次第说四语。如经须菩提如来是真语者实语者如语者不异语者故。不妄说小乘者。说小乘苦谛等唯是谛故。不妄说大乘者。说法无我真如故。真如者即是真如故。不妄说授记者。一切过去未来现在授记故。如彼义如是说不颠倒故。经复言须菩提如来所得法所说法无实无妄语者。何故如是说。偈言</p><p>随顺彼实智说不实不虚</p><p>如闻声取证对治如是说</p><p>此义云何。诸佛所说法。此法不能得彼法。而随顺义故。以所说法不能得彼证法。何以故。如所闻声无如是义故。是故无实。以此所说法随顺彼证法。是故无妄语。若尔何故说。如来所得法所说法。以依字句说故。何故如来前说如来是真语者。复言所说法无实无妄语。偈言如闻声取证对治如是说故</p><p>经曰须菩提。譬如有人入闇则无所见。若菩萨心住于事而行布施。亦复如是。须菩提。譬如人有目。夜分已尽日光明照见种种色。若菩萨不住于事。行于布施亦复如是</p><p>论曰。复有疑。若圣人以无为真如法得名。彼真如一切时一切处有。云何不住心。得佛菩提则非不住。若一切时一切处实有真如。何故有人能得有不得者。为断此疑故。说入闇等喻。此明何义。偈言</p><p>时及处实有而不得真如</p><p>无智以住法余者有智得</p><p>此义云何。一切时者。谓过现未来。一切处者。谓三世。众生实有真如法何故不得。偈言无智以住法故。彼无智以心住法故。此复何义。不清净故。以有智者心不住法。是故能得。以是义故。诸佛如来。清净真如得名。是故住心不得佛菩提。又此譬喻明于何义。偈言</p><p>闇明愚无智明者如有智</p><p>对治及对法得灭法如是</p><p>此义云何。彼闇明喻者。相似法故。闇者示现无智。日光明者。示现有智。有目者明何义。偈言对治及对法得灭法。如是故如是次第。又有目者。如能对治法故。夜分已尽者。如所治暗法尽故。日光明照者。如能治法现前故。如经须菩提譬如有人入暗则无所见如是等故</p><p>经曰。复次须菩提。若有善男子善女人。能于此法门受持读诵修行。则为如来以佛智慧悉知是人。悉见是人。悉觉是人。皆得成就无量无边功德聚。须菩提。若有善男子善女人。初日分以恒河沙等身布施。中日分复以恒河沙等身布施。后日分复以恒河沙等身布施。如是舍恒河沙等无量身。如是百千万亿那由他劫以身布施。若复有人闻此法门。信心不谤。其福胜彼无量阿僧祇。何况书写受持读诵修行为人广说</p><p>论曰。自下复说何义。偈言</p><p>于何法修行得何等福德</p><p>复成就何业如是说修行</p><p>于何法修行者。示现彼行。云何示现。偈言</p><p>名字三种法受持闻广说</p><p>修从他及内得闻是修智</p><p>此说何义。于彼名字得成闻慧。此有三种。一者受二者持三者读诵。此云何知。偈言受持闻广说故。受持修行依总持法故。读诵修行依闻慧广故。广多读习亦名闻慧。此是名字中三种修行。如经复次须菩提若有善男子善女人。能于此法门受持读诵故。彼修行云何得。偈言修从他及内得闻是修智故。此义云何。为修得相。于他及自身。云何于他及自身。谓闻及修如是次第。从他闻法内自思惟为得修行故。向说名字及以修行。此为自身。偈言</p><p>此为自淳熟余者化众生</p><p>以事及时大福中胜福德</p><p>此义云何。彼名字闻慧修行为自身淳熟故。余者化众生广说法故。得何等福德者。示现胜挍量福德故。偈言以事及时大福中胜福德故。此舍身福德胜于前舍身福德。云何胜以事胜故。以时大故。即一日时多舍身故。复多时故。如经须菩提若善男子善女人。初日分以恒河沙等身布施。乃至若复有人闻此法门信心不谤。其福胜彼无量阿僧祇。何况书写受持读诵修行。为人广说故</p><p>经曰。须菩提。以要言之。是经有不可思议不可称量无边功德。此法门如来为发大乘者说。为发最上乘者说。若有人能受持读诵修行此经广为人说。如来悉知是人悉见是人。皆成就不可思议不可称无有边无量功德聚。如是人等。则为荷担如来阿耨多罗三藐三菩提。何以故。须菩提。若乐小法者。则于此经不能受持读诵修行为人解说。若有我见众生见人见寿者见。于此法门能受持读诵修行为人解说者。无有是处。须菩提。在在处处若有此经。一切世间天人阿修罗所应供养。当知此处则为是塔。皆应恭敬作礼围绕。以诸花香而散其处。复次须菩提。若善男子善女人。受持读诵此经为人轻贱。何以故。是人先世罪业应堕恶道。以今世人轻贱故。先世罪业则为消灭。当得阿耨多罗三藐三菩提。须菩提。我念过去无量阿僧祇阿僧祇劫。于然灯佛前得值八十四亿那由他百千万诸佛。我皆亲承供养无空过者。须菩提。如是无量诸佛。我皆亲承供养无空过者。若复有人于后世末世。能受持读诵修行此经所得功德。我所供养诸佛功德。于彼百分不及一。千万亿分乃至算数譬喻所不能及。须菩提。若有善男子善女人。于后世末世。有受持读诵修行此经。所得功德若我具说者。或有人闻心则狂乱疑惑不信。须菩提。当知是法门不可思议。果报亦不可思议</p><p>论曰。复成就何业修行者。今显彼修行业。偈言</p><p>非余者境界唯依大人说</p><p>及希闻信法满足无上界</p><p>受持真妙法尊重身得福</p><p>及远离诸障复能速证法</p><p>成种种势力得大妙果报</p><p>如是等胜业于法修行知</p><p>此三行偈。说何等义。有不可思议者。示不可思议境界故。不可称量者。谓唯独大人不共声闻等。以为住第一大乘众生说故。此示依止大人故。又说大乘者。最妙大乘修行胜故。以信小乘等则不能闻此。示希闻而能信法故。如经以要言之。是经有不可思议不可称量无边功德。如来为发大乘者说。为发最上乘者说故。希闻者。谓不可思议等文句。得不可思议等福德显满足性故。以福德善根满足故。此说不可思议等文句。如经皆成就不可思议不可称无有边无量功德聚故。如是人等则。为荷担如来阿耨多罗三藐三菩提者。示现受持真妙法故。受持法者。即是荷担大菩提。如经如是人等则为荷担如来阿耨多罗三藐三菩提故。在在处处供养者。当知是人必定成就无量功德。如经在在处处若有此经一切世间天人阿修罗所应供养。当知此处则为是塔。皆应恭敬作礼。围绕以诸花香而散其处故。受持读诵此经为人轻贱者。示现远离一切诸障故。何故为人轻贱而离诸障。以有大功德故。如经是人先世罪业则为消灭故。于然灯佛前供养诸佛功德。于后末世受持此法门功德福多于彼者。此示速证菩提法故。以多福德庄严速疾满足故。如经若复有人于后世末世。能受持读诵修行此经所得功德。我所供养诸佛功德。于彼百分不及一。千万亿分乃至算数譬喻所不能及故。当知。是法门不可思议。果报亦不可思议者。此明何义。偈言。成种种势力。得大妙果报故。所谓摄受四天王释提桓因梵天王等。成就势力故。若闻此事其心迷乱者。以彼果报不可思议甚为胜妙。示非思量智境界故。住彼修行中成如是等功德。是故彼修行等业。应知。如经当知是法门不可思议。果报亦不可思议故</p><p>经曰。尔时须菩提白佛言。世尊。云何菩萨发阿耨多罗三藐三菩提心。云何住。云何修行。云何降伏其心。佛告须菩提。菩萨发阿耨多罗三藐三菩提心者。当生如是心。我应灭度一切众生。令入无余涅槃界。如是灭度一切众生已。而无一众生实灭度者。何以故须菩提。若菩萨有众生相人相寿者相。则非菩萨。何以故。须菩提。实无有法名为菩萨发阿耨多罗三藐三菩提心者故</p><p>论曰。何故前说三种修行。今复重说此有何胜。偈言</p><p>于内心修行存我为菩萨</p><p>此即障于心违于不住道</p><p>此义云何。若菩萨于自身三种修行。生如是心。我住于菩萨大乘。我如是修行。我如是降伏其心。菩萨生此分别。则障于菩提行。偈言。于内心修行存我为菩萨。此即障于心故。障何等心。偈言。违于不住道故。如经何以故。须菩提。实无有法名为菩萨发阿耨多罗三藐三菩提心者故</p><p>经曰。须菩提。于意云何。如来于然灯佛所。有法得阿耨多罗三藐三菩提不。须菩提白佛言。不也世尊。如我解佛所说义。佛于然灯佛所。无有法得阿耨多罗三藐三菩提。佛言。如是如是。须菩提。实无有法如来于然灯佛所。得阿耨多罗三藐三菩提。须菩提。若有法如来得阿耨多罗三藐三菩提者。然灯佛则不与我授记。汝于来世当得作佛。号释迦牟尼。以实无有法得阿耨多罗三藐三菩提。是故然灯佛与我授记。作如是言。摩那婆。汝于来世当得作佛。号释迦牟尼。何以故。须菩提言。如来者即实真如。须菩提。若有人言。如来得阿耨多罗三藐三菩提者。是人不实语。须菩提。实无有法佛得阿耨多罗三藐三菩提。须菩提如来所得阿耨多罗三藐三菩提。于是中不实不妄语。是故如来说一切法皆是佛法。须菩提。所言一切法一切法者。即非一切法。是故名一切法</p><p>论曰。此中有疑。若无菩萨云何释迦如来于然灯佛所。行菩萨行。为断此疑。如经须菩提。于意云何。如来于然灯佛所。有法得阿耨多罗三藐三菩提不。不也世尊。如是等。此明何义偈言</p><p>以后时授记然灯行非上</p><p>菩提彼行等非实有为相</p><p>此义云何。于然灯佛时。非第一菩萨行。何以故。我于彼时所修诸行。无有一法得阿耨多罗三藐三菩提。若我于彼佛所。已证菩提。则后时诸佛不授我记。是故我于彼时行未成佛故。偈言。以后时授记然灯行非上故。若无菩提即无诸佛如来。有如是谤。谓一向无诸佛。为断此疑。如经何以故。须菩提言。如来者即实真如故。实者非颠倒义故。真如者不异不变故。须菩提若有人言。如来得阿耨多罗三藐三菩提者。此示何义。偈言。菩提彼行等故。此义云何。彼菩萨行若人言有实者此则虚妄。如是如来得阿耨多罗三藐三菩提。若人言得者。此亦虚妄故。言菩提彼行等故。若如是有人谤言。如来不得阿耨多罗三藐三菩提。为断此疑。如经须菩提。如来所得阿耨多罗三藐三菩提法。不实不妄语故。此义云何。以如来得彼菩提故。偈言。非实有为相故。有为相者。谓五阴相。彼菩提法无色等相故。此复云何。偈言</p><p>彼即非相相以不虚妄说</p><p>是法诸佛法一切自体相</p><p>此义云何。彼即于色等非相。无色等相故。彼即菩提相故。是故偈言。彼即非相相。以不虚妄说故。是故如来说一切法佛法如是等。此义云何。以如来得如是法。偈言。是法诸佛法一切自体相故。自体相者。非体自体故。此明何义。一切法真如体故。彼法如来所证。是故言一切法佛法。彼处色等相不住故。彼一切色等诸法非法。如是诸法非法。即是诸法法以无彼法相。常不住持彼法相故</p><p>经曰。须菩提。譬如有人其身妙大。须菩提言。世尊。如来说人身妙大则非大身。是故如来说名大身</p><p>论曰。大身譬喻示现何义。偈言</p><p>依彼法身佛故说大身喻</p><p>身离一切障及遍一切境</p><p>功德及大体故即说大身</p><p>非身即是身是故说非身</p><p>此二偈示何义。毕竟远离烦恼障智障。毕竟具足法身故。此复云何有二种义。一者遍一切处。二者功德大。是故名大身。偈言。功德及大体故。遍一切处者。真如一切法不差别故。偈言。非身即是身是故说非身故。如经世尊如来说人身妙大。则非大身。是故如来说名大身故。此说何义。非身者无有诸相。是名非身大者。有真如体。如是即名妙大身。如经是名妙大身故</p><p>经曰。佛言。须菩提。菩萨亦如是。若作是言。我当灭度无量众生则非菩萨。佛言。须菩提。于意云何。颇有实法名为菩萨。须菩提言。不也世尊。实无有法名为菩萨。是故佛说一切法无我无众生无人无寿者。须菩提。若菩萨作是言。我庄严佛国土。是不名菩萨。何以故。如来说庄严佛土。庄严佛土者。即非庄严。是名庄严佛国土。须菩提。若菩萨通达无我无我法者。如来说名真是菩萨菩萨</p><p>论曰。此中有疑。若无菩萨者。诸佛亦不成大菩提。众生亦不入大涅槃。亦无清净佛国土。若如是为何义故。诸菩萨摩诃萨。<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>欲令众生入涅槃。起心修行清净佛国土。自下经文为断此疑。云何断疑。偈言</p><p>不达真法界起度众生意</p><p>及清净国土生心即是倒</p><p>此义云何。若起如是心即是颠倒非菩萨者。起何等心名为菩萨。如经须菩提若菩萨通达无我无我法者。如来说名真是菩萨菩萨故。此示何义。偈言</p><p>众生及菩萨知诸法无我</p><p>非圣自智信及圣以有智</p><p>此明何义。知无我无我法者。谓众生及菩萨。何等众生何等菩萨。于彼法若能自智信。若世间智出世间智。所谓凡夫圣人。是人名为菩萨。此言摄世谛菩萨出世谛菩萨。是故重说菩萨菩萨。如经如来说名真是菩萨菩萨故</p><p>金刚般若波罗蜜经论卷中</p><p>金刚般若波罗蜜经论 卷下</p><p>天亲菩萨造</p><p>元魏天竺三藏菩提流支译</p><p>经曰。须菩提。于意云何。如来有肉眼不。须菩提言。如是世尊。如来有肉眼。佛言。须菩提。于意云何。如来有天眼不。须菩提言。如是世尊。如来有天眼。佛言。须菩提。于意云何。如来有慧眼不。须菩提言。如是世尊。如来有慧眼。佛言。须菩提。于意云何。如来有<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>不。须菩提言。如是世尊。如来有法眼。佛言。须菩提。于意云何。如来有佛眼不。须菩提言。如是世尊。如来有</p></div>"
}]