[{
    "title": "阿毗达磨俱舍论 第一卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第一卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别界品第一</p><p>诸一切种诸冥灭拔<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>泥</p><p>敬礼如是如理师对法藏论我当说</p><p>论曰。今欲造论。为显自师其体尊高超诸圣众。故先赞德方申敬礼。诸言所表谓佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。此能破闇故称冥灭。言一切种诸冥灭者。谓灭诸境一切品冥。以诸无知能覆实义及障真见。故说为冥。唯佛世尊得永对治于一切境一切种冥。证不生法故称为灭。声闻独觉虽灭诸冥。以染无知毕竟未断故非一切种。所以者何。由于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>极远时处及诸义类无边差别。不染无知犹未断故。已赞世尊自利德满。次当赞佛利他德圆。拔众生出生死泥者。由彼生死是诸众生沉溺处故难可出故。所以譬泥。众生于中沦没无救。世尊哀愍随授所应<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>教手拔济令出。已赞佛德。次申敬礼。敬礼如是如理师者。稽首接足故称敬礼。诸有具前自他利德。故云如是。如实无倒教授诫勖。名如理师。如理师言显利他德。能方便说如理正教。从生死泥拔众生出。不由威力与愿<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。礼如理师欲何所作。对法藏论我当说者。教诫学徒故称为论。其论者何。谓对法藏。何谓对法。颂曰</p><p>净慧随行名对法及能得此诸慧论</p><p>论曰。慧谓择法。净谓无漏。净慧眷属名曰随行。如是总说无漏<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>名为对法。此则胜义阿毗达磨。若说世俗阿毗达磨即能得此。诸慧及论。慧谓得此有漏<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>思闻生得慧及随行。论谓传生无漏慧教。此诸慧论。是彼资粮故亦得名阿毗达磨。释此名者能持自相。故名为法。若胜义法唯是<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。若<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>法通<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>。此能对向或能对观。故称对法。已释对法。何故此论名对法藏。颂曰</p><p>摄彼胜义依彼故此立对法俱舍名</p><p>论曰。由彼对法论中胜义入此摄故。此得藏名。或此依彼。从彼引生。是彼所藏。故亦名藏。是故此论名对法藏。何因说彼阿毗达磨。谁复先说阿毗达磨。而今造论恭敬解释。颂曰</p><p>若离择法定无余能灭诸惑胜方便</p><p>由惑<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>漂有海因此传佛说对法</p><p>论曰。若离择法无胜方便能灭诸惑。诸惑能令世间漂<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死大海。因此传佛说彼对法。欲令世间得择法故。离说对法。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>不能于诸法相如理简择。然佛世尊处处散说阿毗达磨。大德迦多衍尼子等诸大声闻结集安置。犹如大德法救所集<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>品等邬拖南颂。毗婆沙师传说如此。何法名为彼所简择。因此传佛说对法耶。颂曰</p><p>有漏无漏法除道余有为</p><p>于彼漏随增故说名有漏</p><p>无漏谓道谛及三种无为</p><p>谓<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>二灭此中空无碍</p><p>择灭谓离系随系事各别</p><p>毕竟碍当生别得非择灭</p><p>论曰。说一切法略有二种。谓有漏无漏。有漏法云何。谓除道谛余有为法。所以者何。诸漏于中等随增故。缘灭道谛诸漏虽生。而不随增故非有漏。不随增义随眠品中自当显说。已辩有漏。无漏云何。谓道圣谛及三无为。何等为三。虚空二灭。二灭者何。择非择灭。此虚空等三种无为及道圣谛。名无漏法。所以者何。诸漏于中不随增故。于略所说三无为中。虚空但以无碍为性。由无障故色于中行。择灭即以离系为性。诸有漏法远离系缚<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。名为择灭。择谓简择即慧差别。各别简择四圣谛故。择力所得灭名为择灭。如牛所驾车名曰牛车。略去中言故作是说。一切有漏法同一择灭耶。不尔。云何随系事别。谓随系事量。离系事亦尔。若不尔者于证见苦所断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>灭时。应证一切所断诸烦恼灭。若如是者。修余对治则为无用。依何义说灭无同类。依灭自无同类因义亦不与他。故作是说。非无同类。已说择灭。永碍当生得非择灭。谓能永碍未来法生。得灭异前名非择灭。得不因择但由阙缘。如眼与意专一色时余色声香味触等谢。缘彼境界五识身等。住未来世毕竟不生。由彼不能缘过去境。缘不具故得非择灭。于法得灭应作四句。或于诸法唯得择灭。谓诸有漏过现生法。或于诸法唯非择灭。谓不生法无漏有为。或于诸法俱得二灭。谓彼不生诸有漏法。或于诸法不得二灭。谓诸无漏过现生法。如是已说三种无为。前说除道余有为法。是名有漏。何谓有为。颂曰</p><p>又诸有为法谓色等五蕴</p><p>亦世路言依有离有事等</p><p>论曰。色等五蕴谓初色蕴乃至识蕴。如是五法具摄有为。众缘聚集共所作故。无有少法一缘所生。是彼类故。未来无妨。如乳如薪。此有为法亦名世路。已行正行当行性故。或为无常所吞食故。或名言依。言谓语言。此所依者即名俱义。如是言依具摄一切有为诸法。若不尔者应违品类足论所说。彼说言依十八界摄。或名有离。离谓永离。即是涅槃。一切有为有彼离故。或名有事。以有因故。事是因义。毗婆沙师传说如此。如是等类是有为法差别众名。于此所说有为法中。颂曰</p><p>有漏名取蕴亦说为有诤</p><p>及苦集世间见处三有等</p><p>论曰。此何所立。谓立取蕴亦名为蕴。或有唯蕴而非取蕴。谓无漏行。烦恼名取。蕴从取生故名取蕴。如草糠火。或蕴属取故名取蕴。如帝王臣。或蕴生取故名取蕴。如花果树。此有漏法亦名有诤。烦恼名诤。触动善品故。损害自他故。诤随增故。名为有诤。犹如有漏。亦名为苦。违圣心故。亦名为集。能招苦故。亦名世间。可毁坏故。有对治故。亦名见处。见住其中随增眠故。亦名三有。有因有依三有摄故。如是等类是有漏法随义别名。如上所言。色等五蕴名有为法。色蕴者何。颂曰</p><p>色者唯五根五境及无表</p><p>论曰。言五根者。所谓眼耳鼻舌身根。言五境者。即是眼等五根境界。所谓色声香味所触。及无表者。谓无表色。唯依此量立色蕴名。此中先应说五根相。颂曰</p><p>彼识依净色名眼等五根</p><p>论曰。彼谓前说色等五境。识即色声香味触识。彼识所依五种净色。如其次第应知。即是眼等五根。如世尊说。苾刍当知。眼谓内处四大所造净色为性。如是广说。或复彼者。谓前所说眼等五根。识即眼耳鼻舌身识。彼识所依五种净色名眼等根。是眼等识所依止义。如是便顺品类足论。如彼论说。云何眼根。眼识所依净色为性。如是广说。已说五根。次说五境。颂曰</p><p>色二或二十声唯有八种</p><p>味六香四种触十一为性</p><p>论曰。言色二者。一显二形。显色有四。青黄赤白。余显是此四色差别。形色有八。谓长为初不正为后。或二十者。即此色处复说二十。谓青黄赤白长短方圆高下正不正。云烟尘雾影光明闇。有余师说。空一显色第二十一。此中正者。谓形平等。形不平等名为不正。地水气腾说之为雾。日焰名光。月星火药宝珠电等诸焰名明。障光明生于中余色可见名影。翻此为闇。余色易了故今不释。或有色处有显无形。谓青黄赤白影光明闇。或有色处有形无显。谓长等一分身表业性。或有色处有显有形。谓所余色。有余师说。唯光明色有显无形。现见世间青等色处有长等故。如何一事具有显形。由于此中俱可知故。此中有者是有智义非有境义。若尔身表中亦应有显智。已说色处。当说声处。声唯八种。谓有执受。或无执受大种为因。及有情名非有情名差别为四。此复可意及不可意差别成八。执受大种为因声者。谓言手等所发音声。风林河等所发音声。名无执受大种为因。有情名声。谓语表业。余声则是非有情名。有说。有声通有执受及无执受大种为因。如手鼓等合所生声。如不许一显色极微二四大造。声亦应尔。已说声处。当说味处。味有六种。甘醋醎辛苦淡别故。已说味处。当说香处。香有四种。好香恶香等不等香有差别故。本论中说。香有三种。好香恶香及平等香。已说香处。当说触处。触有十一。谓四大种滑性涩性重性轻性及冷饥渴。此中大种后当广说。柔软名滑。粗强为涩。可称名重。翻此为轻。暖欲名冷。食欲名饥。饮欲名渴。此三于因立果名故。作如是说。如有颂言</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别界品第一之二</p><p>复次于前所说十八界中。几有见几无见。几有对几无对。几善几不善几无记。颂曰</p><p>一有见谓色十有色有对</p><p>此除色声八无记余三种</p><p>论曰。十八界中<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>有见。以可示现此彼差别。由此义准说余无见。如是已说有见无见。唯色蕴摄十界有对。对是碍义。此复三种。障碍境界所缘异故。障碍有对。谓十色界。自于他处被碍不生。如手碍手或石碍石或二相碍。境界有对。谓十二界法界一分。诸有境法于色等境。故施设论作如是言。有眼于水有碍非陆。如鱼等眼。有眼于陆有碍非水。从多分说。如人等眼。有眼俱碍。如毕舍遮室兽摩罗及捕鱼人虾蟆等眼。有俱非碍。谓除前相。有眼于夜有碍非昼。如诸蝙蝠鸺鹠等眼。有眼于昼有碍非夜。从多分说。如人等眼。有眼俱碍。如狗野干马豹豺狼猫狸等眼。有俱非碍。谓除前相。此等名为境界有对。所缘有对。谓心心所于自所缘。境界所缘复有何别。若于彼法此有功能。即说彼为此法境界。心心所法执彼而起。彼于心等名为所缘。云何眼等于自境界所缘转时说名有碍。越彼于余此不转故。或复碍者是和会义。谓眼等法于自境界及自所缘和会转故。应知此中唯就障碍有对而说。故但言十有色有对。更相障故。由此义准说余无对。若法境界有对。亦障碍有对耶。应作四句。谓七心界法界一分诸相应法是第一句。色等五境是第二句。眼等五根是第三句。法界一分非相应法是第四句。若法境界有对。亦所缘有对耶。应顺后句。谓若所缘有对。定是境界有对。有虽境界有对而非所缘有对。谓眼等五根。此中大德鸠摩逻多作如是说</p><p>是处心欲生他碍令不起</p><p>应知是有对无对此相违</p><p>此是所许。如是已说有对无对。于此所说十有对中。除色及声余八无记。谓五色根。香味触境。不可记为善不善性故名无记。有说。不能记异熟果故名无记。若尔无漏应唯无记。其余十界通善等三。谓七心界与无贪等相应名善。贪等相应名为不善。余名无记。法界若是无贪等性相应等起择灭名善。若贪等性相应等起名为不善。余名无记。色界声界若善不<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>力等起身语表摄。是善不善。余是无记。已说善等。十八界中几欲界系。几色界系。几<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>系。颂曰</p><p>欲界系十八色界系十四</p><p>除香味二识无色系后三</p><p>论曰。系谓系属即被缚义。欲界所系具足十八。色界所系唯十四种。除香味境及鼻舌识。除香味者段食性故。离段食欲方得生彼。除鼻舌识无所缘故若尔触界于彼应无。如香味境段食性故。彼所有触非段食性。若尔香味类亦应然。香味离食无别受用。触有别用持根衣等。彼离食欲香味无用。有根衣等故触非无。有余师说。住此依彼静虑等至见色闻声。轻安俱起有殊胜触摄益于身。是故此三生彼静虑犹相随逐。香味不尔。故在彼无。若尔鼻舌彼应非有。如香味境彼无用故。不尔二根于彼有用。谓起言说及<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>身。若为严身及起说用。但须依处。何用二根。如无男根亦无依处。二根无者依处亦无。于彼可无男根依处。彼无用故。鼻舌依处彼有用故。离根应有。有虽无用而有根生。如处胞胎定当死者。有虽无用而非无因。彼从何因得有根起。于根有爱发殊胜业。若离境爱于根定然。彼离境贪应无鼻舌。或应许彼男根亦生。若谓不生由丑陋者。阴藏隐密何容丑陋。又诸根生非由有用。若有因力无用亦生。男根于彼虽为丑陋。设许有因于彼应起。男根非有鼻舌应无。若尔便违契经所说。彼无支缺不减诸根。随彼诸根应可有者。说为不减。何所相违。若不许然男根应有。如是说者鼻舌二根于彼非无。但无香味。以六根爱依内身生非依境界而得现起。其男根爱依淫触生。淫触彼无。男根非有。故于色界十八界中。唯十四种理得成立。无色界系唯有后三。所谓意法及<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>界。要离<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>于彼得生。故无色中无十色界依缘无故五识亦无。故唯后三无色界系。已说界系。十八界中几有漏几无漏。颂曰</p><p>意法意识通所余唯有漏</p><p>论曰。意及意识道谛摄者。名为无漏。余名有漏。法界若是道谛无为。名为无漏。余名有漏。余十五界唯名有漏。如是已说有漏无漏。十八界中几有寻有伺。几无寻唯伺。几无寻无伺。颂曰</p><p>五识唯寻伺后三三余无</p><p>论曰。眼等五识有寻有伺。由与寻伺恒共相应。以行相粗外门转故。显义决定。故说唯言。后三谓是意法意识。根境识中各居后故。此后<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>皆通三品。意界意识界及相应法界除寻与伺。若在欲界初静虑中有寻有伺。静虑中间无寻唯伺。第二静虑以上诸地乃至有顶无寻无伺。法界所摄非相应法。静虑中间伺亦如是。寻一切时无寻唯伺。无第二寻故。但伺相应故。伺在欲界初静虑中三品不收。应名何等。此应名曰无伺唯寻。无第二伺故。但寻相应故。由此故言有寻伺地有四品法。一有寻有伺。谓除寻伺余相应法。二无寻唯伺。谓即是寻。三无寻无伺。谓即一切非相应法。四无伺唯寻。谓即是伺。余十色界寻伺俱无。常与寻伺不相应故。若五识身有寻有伺。如何得说无分别耶。颂曰</p><p>说五无分别由计度随念</p><p>以意地散慧意诸念为体</p><p>论曰。传说。分别略有三种。一<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>分别。二计度分别。三随念分别。由五识身虽有自性而无余二。说无分别。如一足马名为无足。自性分别体唯是寻。后心所中自当辩释。余二分别如其次第。意地散慧诸念为体。散谓非定。意识相应散慧。名为计度分别。若定若散意识相应诸念。名为随念分别。如是已说有寻伺等。十八界中几有所缘几无所缘。几有执受几无执受。颂曰</p><p>七心法界半有所缘余无</p><p>前八界及声无执受余二</p><p>论曰。六识意界及法界摄诸心所法。名有所缘。能取境故。余十色界及法界摄不相应法。名无所缘。义准成故。如是已说有所缘等。十八界中九无执受。前七心界及法界全。此八及声皆无执受。所余九界各通二门。谓有执受无执受故。眼等五根住现在世名有执受。过去未来名无执受。色香味触住现在世不离五根名有执受。若住现在非不离根过去未来。名无执受。如在身内除与根合。发毛爪齿大小便利洟唾血等。及在身外地水等中色香味触虽在现世而无执受。有执受者。此言何义。心心所法共所执持摄为依处名有执受。损益展转更相随故。即诸<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>说有觉触。众缘所触觉乐等故。与此相违名无执受。如是已说有执受等。十八界中几大种性几所造性。几可积集几非积集。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第三卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第三卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别根品第二之一</p><p>如是因界已列诸根。即于此中根是何义。最胜<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>光显名根。由此总成根增上义。此增上义谁望于谁。颂曰</p><p>传说五于四四根于二种</p><p>五八染净中各别为增上</p><p>论曰。眼等五根各于四事能为增上。一<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>身。二导养身。三生识等。四不共事。且眼耳根庄严身者。谓若盲聋身丑陋故。导养身者。谓因见闻避险难故。生识等者。谓发二识及相应故。不共事者。谓能见色闻声别故。鼻舌身根庄严身者。如眼耳说。导养身者。谓于段食能受用故。生识等者。谓发三识及相应故。不共事者。谓嗅尝觉香味触故。女男命意。各于二事能为增上。且女男根二增上者。一有情异。二分别异。有情异者。由此二根令诸有情女男类别。分别异者。由此二根形相言音乳房等别。有说。此于染净增上故言于二。所以者何。本性损坏扇搋半择及二形人无不<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>无间断善诸杂染法。亦无律仪得果离染诸清净法。命根二者。谓于众同分能续及能持。意根二者。谓能续后有及自在随行。能续后有者。如契经言。时健达缚于一心内随一现前。谓或爱俱。或恚俱等。自在随<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。如契经言</p><p>心能导<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>心能遍摄受</p><p>如是心一法皆自在随行</p><p>乐等五受。信等八根。于染净中如次增上。乐等五受染增上者。贪等随眠所随增故。信等八根净增上者。诸清净法随生长故。有余师说。乐等于净亦为增上。如契经说。乐故心定。苦为信依。亦出离依喜及忧舍。毗婆沙师传说如此。有余师说。能导养身非眼等用。是识增上。识了方能避于险难。受段食故。见色等用亦非异识。故不共事于眼等根。不可立为别增上用。故非由此眼等成根。若尔云何。颂曰</p><p>了自境增上总立于六根</p><p>从身立二根女男性增上</p><p>于同住杂染清净增上故</p><p>应知命五受信等立为根</p><p>未当知已知具知根亦尔</p><p>于得后后道<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>等增上</p><p>论曰。了自境者。谓六识身。眼等五根于能了别各别境识有增上用。第六意根于能了别一切境识有增上用。故眼等六各立为根。岂不色等于能了识亦有增上应立为根。境于识中无增上用。夫增上用谓胜自在。眼于所发了色识中最胜自在故名增上。于了众色为通因故。识随眼根有明昧故。色则不然。二相违故。乃至意根于法亦尔。从身复立女男根者。女男性中有增上故。女男根体不离身根。身一分中立此名故。如其次第。女男身中。此女男根有增上用。此处少异余处身根。故从身根别立为二。女身形类音声作业志乐差别。名为女性。男身形类音声作业志乐不同。名为男性。二性差别由女男根故说女男根于二性增上。于众同分住中命根有增上用。于杂染中乐等五受有增上用。所以者何。由契经说于乐受贪随增。于苦受嗔随增。于不苦不乐受无明随增故。于清净中信等五根有增上用。所以者何。由此势力伏诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>引圣道故。言应知者。劝许一一各能为根。三无漏根于得后后道涅槃等有增上用。言亦尔者。类显一一各能为根。谓未知当知根于得已知根道有增上用。已知根于得具知根道有增上用。具知根于得涅槃有增上用。非心未<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>能般涅槃故。等言为显复有异门。云何异门。谓见所断烦恼灭中。未知当知根有增上用。于修所断烦恼灭中。已知根有增上用。于现法乐住中。具知根有增上用。由此能领受解脱喜乐故。若增上故立为根者。无明等性应立为根。无明等因于行等果。各各别有增上用故。又语具等应立为根。语具手足大小便处。于语执行弃乐事中。如其次第有增上故。如是等事不应立根。由所许根有如是相。颂曰</p><p>心所依此别此住此杂染</p><p>此资粮此净由此量立根</p><p>论曰。心所依者。眼等六根。此内六处是有情本。此相差别由女男根。复由命根此一期住。此成杂染由五受根。此净资粮由信等五。此成清净由后<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>。由此立根事皆究竟。是故不应许无明等及语具等亦立为根。彼无此中增上用故。复有余师别说根相。颂曰</p><p>或<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>所依及生住受用</p><p>建立前十四还灭后亦然</p><p>论曰。或言显此是余师意。约流转还灭立二十二根。流转所依谓眼等六。生由女男从彼生故。住由命根仗彼住故。受用由五受因彼领纳故。约此建立前十四根。还灭位中即约此四义类别故立后八根。还灭所依谓信等五。于三无漏由初故生。由次故住。由后受用。根量由此无减无增。即由此缘经立次第。不应语具于语为根。待学差别语方成故。手足不应于执行事各立为根。无异性故。谓即手足异处异相差别生时名执行故。又离手足亦有执行。如腹行类。是故手足不可于彼建立为根。出大便处于能弃事不应立根。重物于空遍堕落故。又由风力引令出故。出小便处于生乐事不应立根。即女男根起此乐故。又诸喉齿眼睑支节应立为根。于能吞嚼开闭屈申有力用故。或一切因于自所作有力用故皆应立根。彼虽有用非增上故不立根者。此语具等亦非增上不应立根。此中眼等乃至男根如前已说。命根体是不相应故。不相应中自当广辩。信等体是心所法故。心所法中亦当广辩。乐等五受三无漏根。更无辩处故今应释。颂曰</p><p>身不悦名苦即此悦名乐</p><p>及三定心悦余处此名喜</p><p>心不悦名忧中舍二无别</p><p>见修无学道依九立三根</p><p>论曰。身谓身受。依身起故。即五识相应受。言不悦是损恼义。于身受内能损恼者名为苦根。所言悦者是摄益义。即身受内能摄益者名为乐根。及第三定心相应受能摄益者亦名乐根。第三定中无有身受。五识无故心悦名乐。即此心悦除第三定。于下三地名为喜根。第三静虑心悦安静离喜贪故唯名乐根。下三地中心悦粗动有喜贪故唯名喜根。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>相应能损恼受。是心不悦名曰忧根。中谓非悦非不悦即是不苦不乐受。此处中受名为舍根。如是舍根为是身受为是心受。应言通二。何因此二总立一根。此受在身心同无分别故。在心苦乐多分别生。在身不然。随境力故。阿罗汉等亦如是生故。此立根身心各别。舍无分别任运而生。是故立根身心合一。又苦乐受在身在心为损为益。其相各异故别立根。舍在身心同无分别。非损非益其相无异。故总立根。意乐喜舍信等五根。如是九根在于三道。如次建立三无漏根。谓在见道依意等九立未知当知根。若在<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>即依此九立已知根。在无学道亦依此九立具知根。如是三名因何而立。谓在见道有未曾知当知行转故。说彼名未知当知。若在修道无未曾知。但为断除余随眠故。即于彼境复数了知。是故说彼名为已知。在无学道知己已知故名为知。有此知者名为具知。或习此知已成性者名为具知。谓得尽智无生智故如实自知。我遍知苦不复遍知。乃至广说。彼所有根名为未知当知根等。如是已释根体不同。当辩诸门义类差别。此二十二根中几有漏几无漏。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第四卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第四卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别根品第二之二</p><p>今应思择。一切有为如相不同。生亦各异。为有诸法决定俱生。有定俱生。谓一切法略有五品。一色。二心。三心所。四心不相应行。五无为。无为无生此中不说。今先辩色决定俱生。颂曰</p><p>欲微聚无声无根有八事</p><p>有身根九事十事有余根</p><p>论曰。色聚极细立微聚名。为显更无细于此者。此在欲界无声无根。八事俱生随一不减。云何八事。谓四大种及四所造色香味触。无声有根诸极微聚。此俱生事或九或十。有身根聚九事俱生。八事如前。身为第九。有余根聚十事俱生。九事如前加眼等一。眼耳鼻舌必不离身。展转相望处各别故。于前诸聚若有声生。如次数增九十十一。以有声处不离根生。谓有执受大种因起。若四大种不相离生。于诸聚中坚湿暖动。云何随一可得非余。于彼聚中势用增者明了可得。余体非无。如觉针锋与筹合触。如尝盐味与麨合味。云何于彼知亦有余。由有摄熟长持业故。有说。遇缘坚等便有流等相故。如水聚中由极冷故有暖相起。虽不相离而冷用增。如受及声用有胜劣。有余师说。于此聚中余有种子未有体相故。契经说。于木聚中有种种界。界谓种子。如何风中知有显色。此义可信。不可比知。或所合香现可取故。香与显色不相离故。前说<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>香味并无故。彼无声有六七八。有声有七八九俱生。此可准知故不别说。此中言事为依体说。为依处说。若尔何过。二俱有过。若依体说。八九十等便为太少。由诸微聚必有形色有多极微共积集故。重性轻性定随有一。滑性涩性随一亦然。或处有冷有饥有渴。是则所言有太少过。若依处说。八九十等便为太多。由四大种触处摄故。应说四等。是则所言有太多失。二俱无过。应知此中所言事者。一分依体说。谓所依大种。一分依处说。谓能依造色。若尔大种事应成多。造色各别依一四大种故。应知此中依体类说。诸四大种类无别故。何用分别如是语为。语随欲生。义应思择。如是已辩色定俱生。余定俱生今次当辩。颂曰</p><p>心心所必俱诸行相或得</p><p>论曰。心与心所必定俱生。随阙一时余则不起。诸行即是一切有为。谓色心心所心不相应行。前必俱言流至于此。谓色心等诸行生时。必与有为四相俱起。言或得者。谓诸行内唯有情法与得俱生。余法不然。是故言或。向言心所。何者是邪。颂曰</p><p>心所且有五大地法等异</p><p>论曰。诸心所法且有五品。何等为五。一大地法。二大善地法。三大<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>地法。四大不善地法。五小烦恼地法。地谓行处。若此是彼所行处。即说此为彼法地。大法地故名为大地。此中若法大地所有名大地法。谓法恒于一切心有。彼法是何。颂曰</p><p>受想思触欲慧念与作意</p><p>胜解三摩地遍于一切心</p><p>论曰。传说。如是所列十法。诸心<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>和合遍有。此中受谓三种领纳苦乐俱非有差别故。想谓于境取差别相。思谓能令心有造作。触谓根境识和合生。能有触对。欲谓希求所作事业。慧谓于法能有简择。念谓于缘明记不忘。作意谓能令心警觉。胜解谓能于境印可。三摩地谓心一境性。诸心心所异相微细。一一相续分别尚难。况一刹那俱时而有。有色诸药色根所取。其味差别尚难了知。况无色法唯觉慧取。如是已说十大地法。大善法地名大善地。此中若法大善地所有名大善地法。谓法恒于诸<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>有。彼法是何。颂曰</p><p>信及不放逸轻安舍惭愧</p><p>二根及不害勤唯遍善心</p><p>论曰。如是诸法唯遍善心。此中信者。令心澄净。有说。于谛实业果中现前忍许故名为信。不放逸者。修诸善法离诸不善法。复何名修。谓此于善专注为性。余部经中有如是释。能守护心名不放逸。轻安者。谓心堪任性。岂无经亦说有身轻安耶。虽非无说。此如身受应知亦尔。如何可立此为觉支。应知此中身轻安者身堪任性。复如何说此为觉支。能顺觉支故无有失。以身轻安能引觉支心轻安故。于余亦见有是说耶。有如经说。喜及顺喜法名喜觉支。嗔及嗔<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>名嗔恚盖。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>正思惟正勤名慧蕴。思惟及勤虽非慧性随顺慧故亦得慧名。故身轻安顺觉支故得名无失。心平等性无警觉性说名为舍。如何可说于一心中有警觉性无警觉性。作意与舍二相应起。岂不前说诸心心所其相微细难可了知。有虽难了由审推度而复可知。此最难知。谓相违背而不乖反。此有警觉于余则无。二既悬殊有何乖反。若尔不应同缘一境。或应一切皆互相应。如是种类所余诸法此中应求。如彼理趣。今于此中应知亦尔。惭愧二种如后当释。二根者。谓无贪无嗔无痴善根慧为性故。前已说在大地法中。不重说为大善地法。言不害者。谓无损恼。勤谓令心勇悍为性。如是已说大善地法。大烦恼法地名大烦恼地。此中若法大烦恼地所有名大烦恼地法。谓法恒于染污心有。彼法是何。颂曰</p><p>痴逸怠不信惛掉恒唯染</p><p>论曰。此中痴者。所谓愚痴。即是无明无智无显。逸谓放逸。不修诸善。是修诸善所对治法。怠谓<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>心不勇悍。是前所说勤所对治。不信者谓心不澄净。是前所说信所对治。惛谓惛沈。对法中说。云何惛沈。谓身重性心重性。身无堪任性心无堪任性。身惛沈性心惛沈性。是名惛沈。此是心所。如何名身。如身受言。故亦无失。掉谓掉举令心不静。唯有如是六种。名大烦恼地法。岂不根本阿毗达磨中说有十种大烦恼地法。又于彼论不说惛沈。何者十。谓不信懈怠失念心乱无明不正知非理作意邪胜解掉举放逸。天爱。汝今但知言至不闲意旨。意旨者何。谓失念心乱不正知非理作意邪胜解。已说彼在大地法中。不应重立为大烦恼地法。如无痴善根慧为体故非大善地法。彼亦应尔。即染污念名为失念。染污等持名为心乱。诸染污慧名不正知。染污作意胜解名为非理作意及邪胜解故说。若是大地法亦大烦恼地法耶。应作四句。第一句谓受想思触欲。第二句谓不信懈怠无明掉举放逸。第三句谓如前说。念等五法。第四句谓除前相。有执。邪等持非即是心乱。彼作四句。与此不同。又许惛沈通与一切烦恼相应。不说在大烦恼地法。于谁有过。有作是言。应说在此。而不说者顺等持故。彼谓诸有惛沈<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>速发等持。非掉举行。谁惛沈行非掉举行。谁掉举行非惛沈行。此二未尝不俱行故。虽尔应知随增说行。虽知说行随用偏增。而依有体建立地法。故此地法唯六义成。此唯遍染心俱起非余故。如是已说大烦恼地法。大不善法地名大不善地。此中若法大不善地所有名大不善地法。谓法恒于不善心有。彼法是何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第五卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第五卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别根品第二之三</p><p>如是已辩得非得相。同分者何。颂曰</p><p>同分有情等</p><p>论曰。有别实物名为同分。谓诸有情展转类等。本论说此名众同分。此复二种。一无差别。二有差别。无差别者。谓诸有情有情同分。一切有情各等有故。有差别者。谓诸有情界地趣生种姓男女近事苾刍学无学等各别同分。一类有情各等有故。复有法同分。谓随蕴处界。若无实物无差别相名同分者。展转差别诸有情中。有情有情等无差别。觉及施设不应得有。如是蕴等等无差别觉及施设如理应知。颇有死生不舍不得有情同分。应作四句。第一句者。谓是处死还生是处。第二句者。谓入正性离生位时。舍异生同分。得圣者同分。第三句者。谓是趣死生余趣等。第四句者。谓除前相。若别有实物名异生同分。何用别立异生性耶。非异人同分别有人性故。又非<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>现见同分。以非色故亦非觉慧所能了别无别用故。世虽不了有情同分。而于有情谓无差别。故设有体亦何所用。又何因不许有无情同分。诸谷麦豆金铁庵罗半娜婆等。亦有自类互相似故。又诸同分展转差别。如何于彼更无同分。而起无别觉施设耶。又应显成胜论所执。彼宗执有总同句义。于一切法总同言智由此发生。彼复执有同异句义。于异品类同异言智由此发生。毗婆沙师作如是说。彼执与此义类不同。以说一物于多转故。又纵于彼若显不显。然此同分必有实物。契经说故。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。若还来此得人同分。乃至广说。虽有是说而不说言别有实物名为同分。若尔所说同分是何。即如是类诸行生时。于中假立人同分等。如诸谷麦豆等同分。此非善说。违我宗故。已辩同分。无想者何。颂曰</p><p>无想无想中心心所法灭</p><p>异熟居广果</p><p>论曰。若生无想有情天中。有法能令心心所灭名为无想。是实有物。能遮未来心心所法令暂不起如堰江河。此法一向是异熟果。谁之异熟。谓无想定。无想有情居在何处。居在广果。谓广果天中有高胜处如中间静虑名无想天。彼为恒无想为亦有想耶。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>位中多时有想。言无想者。由彼有情中间长时想不起故。如契经说。彼诸有情由想起故从彼处没。然彼有情如久睡觉。还起于想。从彼没已必生欲界。非余处所。先<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>行势力尽故。于彼不能更修定故。如箭射空力尽便堕。若诸有情应生彼处必有欲界顺后受业。如应生彼北俱卢洲必定应有生天之业。已辩无想。二定者何。谓无想定及灭尽定。初无想定其相云何。颂曰</p><p>如是无想定后静虑求脱</p><p>善唯顺生受非圣得一世</p><p>论曰。如前所说有法能令心心所灭名为无想。如是复有别法能令心心所灭名无想定。无想者定名无想定。或定无想名无想定。说如是声。唯显此定灭心心所与无想同。此在何地。谓后静虑。即在第四静虑非余。修无想定为何所求。谓求<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。彼执无想是真解脱。为求证彼修无想定。前说无想是异熟故。无记性摄。不说自成。今无想定一向是善。此是善故。能招无想有情天中<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>异熟。既是善性为顺何受。唯顺生受。非顺现后及不定受。若起此定后虽退失。传说现身必还能起。当生无想有情天中。故得此定必不能入正性离生。又许此定唯异生得非诸圣者。以诸圣者于无想定如见深坑不乐入故。要执无想为真解脱。起出离想而修此定。一切圣者不执有漏为真解脱及真出离故。于此定必不<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。若诸圣者修得第四静虑定时。为如静虑亦得去来无想定不。余亦不得。所以者何。彼虽曾习以<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>故。要大加行方便修得。故初得时唯得一世。谓得现在。如初受得别解脱戒。得此定已。第二念等乃至未舍。亦成过去。以无心故。无未来修。次灭尽定其相云何。颂曰</p><p>灭尽定亦然为静住有顶</p><p>善二受不定圣由加行得</p><p><a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>得非前三十四念故</p><p>论曰。如无想定灭定亦然。此亦然声为例何义。例无想定心心所灭。如说复有别法能令心心所灭名无想定。如是复有别法能令心心所灭名灭尽定。如是二定差别相者。前无想定为求解脱。以出离想作意为先。此灭尽定为求静住。以止息想作意为先。前无想定在后静虑。此灭尽定唯在有顶。即是非想非非想处。此同前定性唯是善非无记染。善等起故。前无想定唯顺生受。此灭尽定通顺生后及不定受。谓约异熟有顺生受。或顺后受。或不定受。或全不受。谓若于下得般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。此定所招何地几蕴。唯招有顶四蕴异熟。前无想定唯异生得。此灭尽定唯圣者得。非异生能起。怖畏断灭故。唯圣道力所能起故。现法涅槃胜解入故。此亦如前。非离染得。由何而得。由加行得。要由加行方<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>故。又初得时唯得现在。不得过去不修未来。要由心力方能修故。第二念等乃至未舍亦成过去。世尊亦以加行得耶。不尔。云何。成佛时得。谓佛世尊尽智时得。佛无一德由加行得。暂起欲乐现在前时。一切圆德随乐而起故。佛众德皆离染得。世尊曾未起灭尽定。得尽智时云何得成俱分解脱。于起灭定得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。如已起者。成俱解脱。西方师说。菩萨学位先起此定后得<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。云何此中不许彼说。若许彼说便顺尊者邬波毱多理目足论。如彼论说。当言如来先起灭定后生尽智。迦湿弥罗国毗婆沙师说。非前起灭定后方生尽智。所以者何。传说。菩萨三十四念得菩提故。谛现观中有十六念。离有顶贪有十八念。谓断有顶九品<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>起九无间九解脱道。如是十八足前十六成三十四。一切菩萨决定先于无所有处。已得离贪方入见道。不复须断下地烦恼。于此中间无容得起不同类心。故诸菩萨学位不应起灭尽定。外国诸师作如是说。若中间起不同类心。斯有何过。若尔便有越期心过。然诸菩萨不越期心。理实菩萨不越期心。然非不越无漏圣道。若尔期心如何不越。谓我未得诸漏永尽。终不解斯结加趺坐。决定不越如是期心。唯于一坐时诸事究竟故。前说为善我所宗故。虽已说二定有多同异相而于其中复有同异。颂曰</p><p>二定依欲色灭定初人中</p><p>论曰。言二定者。谓无想定及灭尽定。此二俱依欲色二界而得现起。若有不许亦依<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>起无想定。便违此文。谓本论言。或有是色有此有非五行。谓色缠有情或生有想天住不同类心。若入无想定。若入灭尽定。或生无想天已得入无想。是谓是色有此有非五行。由此证知。如是二定俱依欲色而得现起。是名同相。言异相者。谓无想定欲色二界皆得初起。灭定初起唯在人中。此在人中初修起已由退为先方生色界。依色界身后复修起。此灭尽定亦有退耶应言亦有。若不尔者即便违害邬陀夷经。经言。具寿有诸苾刍先于此处具净尸罗具三摩地具般罗若能数入出灭受想定斯有是处。应如实知。彼于现法或<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>位。不能勤修令解满足。从此身坏超段食天。随受一处意成天身。于彼生已复数入出灭受想定亦有是处。应如实知。此意成天身。佛说是色界。灭受想定唯在有顶。若得此定必无退者。如何得往色界受生。有余部执第四静虑亦有灭定。依彼所执灭定无退。此义亦成。第四静虑有灭尽定义必不成。所以者何。九次第定契经说故。此若必然如何得有超越定义。此定次第依初学说。得自在时随乐超入。如是二定有多种异。谓地有异。第四静虑有顶地故。加行有异。出离止息想作意为先故。相续有异。异生圣者相续起故。异熟有异。无想有顶异熟果故。顺受有异。顺定不定生二受故。初起有异。二界人中最初起故。二定总以心心所灭为其<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。何缘但说名为无想灭受想耶。二定加行中唯厌逆此故。如亦知受等唯名他心智。今二定中心久时断。如何于后心复得生。毗婆沙师许过去有前心为后等无间缘。有余师言。如生无色色久时断。如何于后色复得生。彼生定应由心非色。如是出定心亦应然。由有根身非由心起。故彼先代诸轨范师咸言。二法互为种子。二法者。谓心有根身。尊者世友问论中说。若执灭定全无有心可有此过。我说灭定犹有细心故无此失。尊者妙音说。此非理。所以者何。若此定中犹有识者三和合故必应有触。由触为缘应有受想。如世尊说。意及法为缘生于<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。三和合触俱起受想思。则此定中受想等法亦应不灭。若谓如经说受缘爱。然阿罗汉虽有诸受而不生爱。触亦应尔。非一切触皆受等缘。此例不然。有差别故。经自简言。若无明触所生诸受为缘生爱。曾无有处简触生受故有差别。由此道理。毗婆沙师说。灭定中诸心皆灭。若都无心如何名定。此令大种平等行故说名为定。或由心力平等至此故名为定。如是二定为是实有。为是假有。应言实有。能遮碍心令不生故。有说。此证理不应然。由前定心能遮碍故。谓前定心与所余心相违而起。由此起故。唯令余心暂时不转。此能引发违心所依令相续故。唯不转位假立为定。无别实体。此唯不转分位假定。入前出后两位皆无。故假说此是有为摄。或即所依由定心引令如是起。假立为定。应知无想亦复如是。谓由前心与所余心。相违而起。由此起故。唯令余心暂时不转。唯不转位假立无想。余说如前。此非善说违我宗故。已辩二定。命根者何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第六卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第六卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别根品第二之四</p><p>如是已说不相应行。前言生相生所生时非离所余<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>和合。此中何法说为因缘。且因六种。何等为六。颂曰</p><p>能作及俱有同类与相应</p><p>遍行并异熟许因唯六种</p><p>论曰。因有六种。一能作因。二俱有因。三同类因。四相应因。五遍行因。六异熟因。对法诸师许因唯有如是六种。且初能作因相云何。颂曰</p><p>除自余能作</p><p>论曰。一切有为唯除自体以一切法为能作因。由彼生时无障住故。虽余因性亦能作因。然能作因更无别称。如色处等总即别名。岂不未知诸漏当起。由已知故诸漏不生。智于漏生能为障碍。日光能障现睹众星。如何有为唯除自体以一切法为能作因。应知此生时彼皆无障住。故彼于此是能作因。若于此生彼能为障。而不为障可立为因。譬如国人以其国主不为损害。咸作是言。我因国主而得安乐。若于此生彼无障用。设不为障何得为因。且如<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>及不生法普于一切有为生中。那落迦等有情相续于<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>诸蕴生中。有如非有无能障用。虽无障用而亦为因。如无力国王亦得如前说。此即通说诸能作因。就胜为言非无生力。如眼色等于眼识等生饮食于身种等于牙等。有作是难。若一切法无障住故皆能作因。何缘诸法非皆顿起。一<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>时何缘一切非如杀者皆成杀业。此难不然。但由无障许一切法为能作因。非由于生有亲作力。有余师说。诸能作因皆于果生有能作力。且涅槃等于眼识生云何名为有能作力。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>缘彼为境而生或善或恶。因此意识后时眼识次第得生。展转因故。彼涅槃等于眼识生有能作力。如是余法由此方隅展转应知有能生力。如是已说能作因相。第二俱有因相云何。颂曰</p><p>俱有互为果如大相所相</p><p>心于心随转</p><p>论曰。若法更互为士用果彼法更互为俱有因。其相云何。如四大种更互相望为俱有因。如是诸相与所相法心与心随转亦更互为因。是则俱有因由互为果遍摄有为法如其所应。法与随相非互为果。然法与随相为俱有因。非随相于法。此中应辩。何等名为心随转法。颂曰</p><p>心所二<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>彼及心诸相</p><p>是心随转法</p><p>论曰。一切所有心相应法。静虑无漏二种律仪。彼法及心之生等相。如是皆谓心随转法。如何此法名心随转。颂曰</p><p>由时果善等</p><p>论曰。略说由时果等善等故说此法名心随转。且由时者。谓此与心一生住灭及堕一世。由果等者。谓此与心一果异熟及一等流。应知此中前一后一显俱显共其义不同。由善等者。谓此与心同善不善无记性故。由此十因名心随转。此中心王极少犹与五十八法为俱有因。谓十大地法。彼四十本相。心八本随相。名五十八法。五十八中除心四随相。余五十四为心俱有因。有说。为心因唯十四法。谓十大地法并心本相。此说非善。所以者何。违品类足论所说故。如彼论言。或有苦谛以有身见为因。非与有身见为因。除未来有身见及彼相应法生老住非常诸余染污苦谛。或有苦谛以有身见为因。亦与有身见为因。即所除法。有余师不诵及彼相应法。迦湿弥罗国毗婆沙师言。彼文必应作如是诵。或应准义知说有余。诸由俱有因故成因彼必俱有。或有俱有非由俱有因故成因。谓诸随相各于本法。此诸随相各互相对。随心转法随相于心。此诸随相展转相对。一切俱生有对造色展转相对。少分俱生无对造色展转相对。一切俱生造色大种展转相对。一切俱生得与所得展转相对。如是等诸法虽名俱有而非由俱有因故成因。非一果异熟及一等流故。得与所得非定俱行。或前或后或俱生故。如是一切理且可然。而诸<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>种等芽等极成<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>相生事中未见如斯同时因果故。今应说。云何俱起诸法聚中有因果义。岂不现见。灯焰灯明芽影同时亦为因果。此应详辩。为即灯焰与明为因。为由前生因缘和合焰明俱起。余物障光明而有影现。如何说此影用芽为因。理不应然。随有无故。善因明者。说因果相言若此有无彼随有无者。此定为因彼定为果。俱有法中一有一切有。一无一切无。理成因果。俱起因果理且可然。如何可言互为因果。即由前说此亦无违。若尔如前所说造色互不相离应互为因。如是造色与诸大种心随相等与心等法皆不相离应互为因。若谓如三杖互相依住如是俱有法因果义成。此应思惟。如是三杖为由俱起相依力住。为由前生因缘合力令彼三杖俱起住耶。又于彼中亦有别物绳钩地等连持令住。此亦有余同类因等。是故俱有因义得成。如是已说俱有因相。第三同类因相云何。颂曰</p><p>同类因相似自部地前生</p><p>道展转九地唯等胜为果</p><p>加行生亦然闻思所成等</p><p>论曰。同类因者。谓相似法与相似法为同类因。谓善<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>与善五蕴展转相望为同类因。染污与染污无记与无记五蕴相望应知亦尔。有余师说。净无记蕴五是色果。四非色因。有余师说。五是四果色非四因。有余师说。色与四蕴相望展转皆不为因。又一身中羯刺蓝位能与十位为同类因。頞部昙等九位一一皆除前位与余为因。若对余身同类十位一一皆与十位为因。由此方隅外麦稻等自类自类应广思择。若不许色为色同类因彼执便违本论文所说故。本论说。过去大种未来大种因增上等。为诸相似于相似法皆可得说为同类因。不尔。云何。自部自地唯与自部自地为因。是故说言自部自地。部谓五部即见苦所断乃至修所断。地谓九地即欲界为一静虑无色八。此中见苦所断法还与见苦所断为同类因非余。如是乃至修所断还与修所断法为同类因非余。于中一一若欲界地还与欲界为同类因。初静虑地与初静应为同类因。乃至有顶与有顶地为同类因。异地相望皆无因义。又此非一切。何者。谓前生唯诸前生与后相似生未生法为同类因。云何知然。本论说故。如发智论说。云何同类因。谓前生善根与后生自界善根及彼相应法为同类因。如是过去与余二世过去现在与未来等皆应广说。然即彼论作是问言。若法与彼法为因。或时此法与彼非因耶。彼即答言无时非因者。此依俱有相应异熟三因密说故无有过。有谓未来正生位法定能与彼为同类因。是故彼文依最后位密作是答无时非因。彼于所难非为善释。以未来法正生位前非同类因后方成故。又若尔者。彼复问言。若法与彼法为等无间。或时此法与彼非等无间耶。彼即答言。若时此法未至已生。若如彼释。应亦答言无时非缘。如何乃答若时此法未至已生。然彼复释。为现二门。如彼处说此亦应尔。如此处说彼亦应尔。如是作文获何<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。唯显论主非善于文。是故应知。前释为善。若尔何故品类足说。或有苦谛以有身见为因。非与有身见为因。除未来有身见及彼相应苦谛诸余染污苦谛。或有苦谛以有身见为因。亦与有身见为因。即所除法。彼文应说除未来有身见相应苦谛。设有如彼说。由义应知非。复云何通施设足论。彼说诸法四事决定。所谓因果所依所缘。应知彼文。因者谓能作俱有相应异熟因。果者。谓增上士用异熟果。所依者谓眼等六根。所缘者谓色等六境。若尔同类因应本无而有。许故无过。约位非体。由和合作用位果非体果。若同类因未来世有如异熟因当有何过。未来若有。本论应说。本论唯说能取与果诸同类因故无有失。无如是义。以同类因引等流果此未来有理必不然。无前后故。不应已生法为未生等流。如过去法非现在果。勿有果先因后过失故。未来世无同类因。若尔异熟因应未来非有。不应异熟果因前及俱故。未来世法无前后故。无如是失。不相似故。谓同类因与果相似。若无前后应互为因。既互为因应互为果。互为因果与理相违。非异熟因与果相似。虽离前后而无上过。故同类因就位建立未来非有。若异熟因就相建立未来非无。言同类因唯自地者定依何说。定依有漏。若无漏道展转相望一一皆与九地为因。谓未至定静虑中间四本静虑三本无色九地道谛皆互为因。所以者何。此于诸地皆如客住不堕界摄。非诸地爱执为己有。是故九地道虽地不同而展转为因。由同类故。然唯得与等胜为因。非为劣因。加行生故。且如已生苦法智忍还与未来苦法智忍为同类因是名为等。又即此忍复能与后从苦法智至无生智为同类因。是名为胜。如是广说。乃至已生诸无生智。唯与等类为同类因。更无胜故。又诸已生见道<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>及无学道。随其次第与三二一为同类因。又于此中诸钝根道与钝及利为同类因。若利根道唯利道因。如随信行及信胜解时<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道随其次第与六四二为同类因。若随法行及见至非时解脱道随其次第与三二一为同类因。诸上地道为下地因云何名为或等或胜。由因增长及由根故。谓见道等下下品等。后后位中因转增长。虽一相续中无容可得随信随法行二道现起而已生者为未来因。为唯圣道但与等胜为同类因。不尔。云何。余世间法加行生者亦与等胜为因非劣。加行生法其体云何。谓闻所成思所成等。等者等取修所成等。因<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>所生功德名彼所成。加行生故唯与等胜为因非劣。如欲界系闻所成法能与自界闻思所成为同类因。非修所成因。欲界无故。思所成法与思所成为同类因。非闻所成因。以彼劣故。若<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>系闻所成法。能与自界闻修所成为同类因。非思所成因。色界无故。修所成法唯与自界修所成法为同类因。非闻所成因。以彼劣故。无色界系修所成法。唯与自界修所成法为同类因。非闻思所成因。以无故劣故。如是诸法复有九品。若下下品为九品因。下中八因。乃至上上唯上上因。除前劣故。生得善法九品相望展转为因。染污亦尔。无覆无记总有四种。谓异熟生威仪路工巧处化心俱品。随其次第。能与四三二一为因。又欲界化心有四静虑果。非上静虑果下静虑果因。非加行因得下劣果。如勤功力种稻麦等。勿设劬劳而无所获。因如是义故。有问言。颇有已生诸无漏法非未生位无漏法因。有。谓已生苦法智品于未生位苦法忍品。又一切胜于一切劣。颇有一身诸无漏法前所定得非后生因。有。谓未来苦法忍品于后已生苦法智品。以果必无在因前故。或同类因未来无故。颇有前生诸无漏法非后已起无漏法因。有。谓前生胜无漏法于后已起劣无漏法。如退上果下果现前。又前已生苦法智得于后已生苦法忍得非同类因。以彼劣故。如是已说同类因相。第四相应因相云何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第七卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第七卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别根品第二之五</p><p>广说因已。缘复云何。颂曰</p><p>说有四种缘<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>五因性</p><p>等无间非后心心所已生</p><p>所缘一切法增上即能作</p><p>论曰。于何处说。谓契经中。如契经中说四缘性。谓因缘性。等无间缘性。所缘缘性。增上缘性。此中性者是缘种类。于六因内除能作因。所余五因是因缘性。除阿罗汉临<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时最后心心所法诸余已生心心所法。是等无间缘性。此缘生法等而无间。依是义立等无间名。由此色等皆不可立等无间缘。不等生故。谓欲界色。或无间生欲界<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>二无表色。或无间生欲界无漏二无表色。以诸色法杂乱现前等无间缘生无杂乱。故色不立等无间缘。尊者世友作如是言。于一身中一长养色相续不断。复有第二长养色生不相违害故不可立等无间缘。大德复言。以诸色法无间生起或少或多。谓或有时从多生少。如烧稻秆大聚为灰。或时复有从少生多。如细种生诺瞿陀树。根茎枝叶渐次增荣。耸干垂条多所荫映。岂不心所无间生时亦有少多品类非等。谓善不善无记心中。有寻有伺三摩地等。此于异类实有少多。然自类中无非等义。谓无少受无间生多。或复从多无间生少。想等亦尔。无非等过。岂唯自类前能为后等无间缘。不尔。云何。前心品法总为后品等无间缘。非唯自类。且于受等自体类中无少生多以说等义。唯执同类相续者。说唯自类有等无间缘。心唯生心受唯生受。乃至广说若从无染无间染生。此染心中所有<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>用先灭烦恼为等无间缘。如出灭定心还用先灭正入灭定心为缘故起。彼说非善。初无漏心应阙此缘而得生故。不相应行亦如诸色。杂乱现前故非等无间缘。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>及不系可俱现前故。何缘不许未来世有等无间缘。以未来法杂乱而住无前后故。如何<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>知未来世此法无间此法应生。比过现法而现知故。传说。世尊见从过去如此类业此类果生。是法无间生如是法。又从现在如此类业此类果生。是法无间生如是法。如是见已。便于未来诸乱住法。能正了达此法无间此法应生。虽如是知而非比智。由佛比类过去现在<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>次第。便于未来乱住诸法能现了达。谓未来世如是有情造如是业招如是果。是愿智摄故非比智。若尔世尊未见前际。于后际法应不能知。有余复言。有情身内有未来世果因先兆。是不相应行蕴差别。佛唯观此便知未来。非要现游静虑通慧。若尔诸佛便于未来占相故知。非为现证。故如经部诸师所言。世尊举意遍知诸法非比非占。此说为善。如世尊说。诸佛德用诸佛境界不可思议。若于未来无定前后次第安立。何故但言世第一法无间唯生苦法智忍不生余法。如是广说。乃至金刚喻定无间。唯生尽智不生余法。若此法生系属彼法要彼无间此乃得生。如芽等生要藉种等。然此非有等无间缘。诸阿罗汉最后心心所。何缘故说非等无间缘。无余心等续此起故。岂不如是无间灭心亦名为意。后心无间识既不生应不名意。意是依所显非作用所显。此最后心有所依义。余缘阙故后识不生。等无间缘作用所显。若法此缘取为果已。定无诸法及诸有情能为障碍令彼不起。故最后心虽得名意而不可说等无间缘。若法与心为等无间。彼法亦是心无间耶。应作四句。第一句者。谓<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>定出心心所。及第二等二定<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。第二句者。谓初所起二定刹那。及有心位诸心心所生住异灭。第三句者。谓初所起二定刹那。及有心位心心所法。第四句者。谓第二等二定刹那。及无心定出心心所生住异灭。若法与心为等无间。与无心定为无间耶。应作四句。谓前第三第四句为今第一第二句。即前第一第二句为今第三第四句。从二定出诸心心所望入定心中间远隔。如何为彼等无间耶。中间不隔心心所故。如是已释等无间缘。所缘缘性。即一切法望心心所随其所应。谓如眼识及相应法以一切色为所缘缘。如是耳识及相应法以一切声。鼻识相应以一切香。舌识相应以一切味。身识相应以一切触。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>相应以一切法为所缘缘。若法与彼法为所缘。无时此与彼非所缘。于不缘位亦所缘摄。被缘不缘其相一故。譬如薪等于不烧时亦名所烧。相无异故。心心所法。如于所缘处事刹那三皆决定。于所依亦有如是决定耶。应言亦有如是决定。然于现在亲附自所依。过去未来与所依相离。有说。在过去亦亲附所依。如是已释所缘缘性。增上缘性即能作因。以即能作因为增上缘故。此缘体广名增上缘。一切皆是增上缘故。既一切法亦所缘缘。此增上缘何独体广。俱有诸法未尝为所缘。然为增上故。唯此体广。或所作广名增上缘。以一切法各除<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>与一切有为为增上缘故。颇有法于法全非四缘不。有谓自性于自性。于他性亦有。谓有为于无为。无为于无为。如是诸缘于何位法而兴作用。颂曰</p><p>二因于正灭三因于正生</p><p>余二缘相违而兴于作用</p><p>论曰。前说五因为因缘性。二因作用于正灭时。正灭时言显法现在灭现前故名正灭时。俱有相应于法灭位方兴作用。由此二因令俱生果有作用故。所言三因于正生者。谓未来法于正生位。生现前故名正生时。同类遍行异熟三种。于法生位作用方兴。已说因缘二时作用。二缘作用与此相违。等无间缘于法生位而兴作用。以彼生时前心心所与其处故。若所缘缘能缘灭位而兴作用。以心心所要现在时方取境故。唯增上缘于一切位皆无障住故。彼作用随无障位一切无遮。已说诸缘及兴作用。应言何法由几缘生。颂曰</p><p>心心所由四二定但由三</p><p>余由二缘生非天次等故</p><p>论曰。心心所法由四缘生。此中因缘谓五因性。等无间缘谓前无间已生。非后心心所法。所缘缘者谓随所应或色等五。或一切法。增上缘者谓随所应各除自性余一切法。灭尽无想二定由三除所缘缘。非能缘故。由因缘者。谓由二因。一俱有因。谓生等相。二同类因。谓前已生同地善法。等无间缘谓入定心及相应法。增上缘者。谓如前说。如是二定心等引生碍心等起故。与心等但为等无间。非等无间缘。余不相应及诸色法由因增上二缘所生。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>唯从如上所说诸因诸缘所起。非<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天我胜性等一因所起。此有何因。若一切成许由因者。岂不便舍一切世间由自在等一因生论。又诸世间非自在等一因所起。次第等故。谓诸世间若自在等一因生者。则应一切俱时而生非次第起。现见诸法次第而生。故知定非一因所起。若执自在随欲故然。谓彼欲令此法今起此法今灭此于后时。是则应成非一因起。亦由乐欲差别生故。或差别欲应一时生。所因自在无差别故。若欲差别更待余因不俱起者。则非一切唯用自在一法为因。或所待因亦应更待余因差别方次第生。则所待因应无边际。若更不待余差别因。此因应无次第生义。则差别欲非次第生。若许诸因展转差别无有边际信无始故。徒执自在为诸法因不越释门因缘正理。若言自在欲虽顿生而诸世间不俱起者。由随自在欲所生故。理亦不然。彼自在欲前位与后无差别故。又彼自在作大功力。生诸世间得何义利。若为发喜生诸世间。此喜离余方便不发。是则自在于发喜中既必待余。应非自在。于喜既尔。余亦应然。差别因缘不可得故。或若自在生<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>等无量苦具逼害有情。为见如斯发生自喜。咄哉何用此自在为。依彼颂言。诚为善说</p></div>"
},{
    "title": "阿毗达磨俱舍论 第八卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第八卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别世品第三之一</p><p>已依<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>分别心等。今次应说。三界是何。各于其中处别有几。颂曰</p><p><a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>傍生鬼人及六欲天</p><p>名欲界二十由地狱洲异</p><p>此上十七处名<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>于中</p><p>三静虑各三第四静虑八</p><p><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>无处由生有四种</p><p>依同分及命令心等相续</p><p>论曰。地狱等四及六欲天并器<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。是名欲界。六欲天者。一四大王众天。二三十三天。三夜摩天。四睹史多天。五乐变化天。六他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天。如是欲界处别有几。地狱洲异故成二十八大地狱名地狱异。一等活地狱。二黑绳地狱。三众合地狱。四号叫地狱。五大叫地狱。六炎热地狱。七大热地狱。八无间地狱。言洲异者。谓四大洲。一南赡部洲。二东胜身洲。三西牛货洲。四北俱卢洲。如是十二并六欲天傍生饿鬼处成二十。若有情界从自在天至无间狱。若器世界乃至风轮皆欲界摄。此欲界上处有十七。谓三静虑处各有三。第四静虑处独有八。器及有情总名色界。第一静虑处有三者。一梵众天。二梵辅天。三大梵天。第二静虑处有三者。一少光天。二无量光天。三极光净天。第三静虑处有三者。一少净天。二无量净天。三遍净天。第四静虑处有八者。一无云天。二福生天。三广果天。四无烦天。五无热天。六善现天。七善见天。八色究竟天。迦湿弥罗国诸大论师皆言。色界处但有十六。彼谓。即于梵辅天处有高台阁。名大梵天。一主所居非有别地。如尊处座<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>围绕。无色界中都无有处。以无色法无有方所。过去未来无表无色不住方所。理决然故。但异熟生差别有四。一空无边处。二识无边处。三无所有处。四非想非非想处。如是四种名无色界。此四非由处有上下。但由生故胜劣有殊。复如何知彼无方处。谓于是处得彼定者。命终即于是处生故。复从彼没生欲色时。即于是处中有起故。如有色界一切有情要依色身心等相续。于无色界受生有情。以何为依心等相续。对法诸师说。彼心等依众同分及与命根而得相续。若尔有色有情心等何不但依此二相续。有色界生此二劣故。无色此二因何故强。彼界二从胜定生故。由彼等至能伏色想。若尔于彼心等相续。但依胜定何用别依。又今应说。如有色界受生有情同分命根依色而转。无色此二以何为依。此二更互相依而转。有色此二何不相依。有色界生此二劣故。无色此二因何故强。彼界此二种从胜定生故。前说彼定能伏色想。是则还同心相续难。或心心所唯互相依故。经部师说。无色界心等相续无别有依。谓若有因未离色爱引起心等。所引心等与色俱生。依色而转。若因于色已得离爱。厌背色故。所引心等非色俱生不依色转。何故名为欲等三界。能持自相故名为界。或种族义如前已释。欲所属界说名欲界。色所属界说名色界。略去中言故作是说。如胡椒饮如金刚环。于彼界中色非有故名为无色。所言色者。是变碍义。或示现义。彼体非色立无色名。非彼但用色无为体。无色所属界说名无色界。略去中言喻如前说。又欲之界名为欲界。此界力能任持欲故。色无色界应知亦然。此中欲言为说何法略说段食淫所引贪。如经颂言</p><p>世诸妙境非真欲真欲谓人分别贪</p><p>妙境如本住世间智者于中已除欲</p><p>邪命外道便诘尊者<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>言</p><p>若世妙境非真欲说欲是人分别贪</p><p><a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>应名受欲人起恶分别寻思故</p><p>时<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>子反质彼言</p><p>若世妙境是真欲说欲非人分别贪</p><p>汝师应名受欲人恒观可意妙色故</p><p>若法于彼三界现行。此法即说三界系不。不尔。云何于中随增三界贪者是三界系。此中何法名三界贪。谓三界中各随增者。今此所言同缚马答。犹如有问缚马者谁。答言马主。即彼复问马主是谁。答言缚者。如是二答皆不令解。今此所言不同彼答。谓于前说欲界诸处未离贪者贪名欲贪。此所随增名欲界系。于前所说色无色中随其所应当知亦尔。或不定地贪名欲贪。此所随增名欲界系。诸静虑地贪名色贪。此所随增名色界系。诸无色地贪名无色贪。此所随增名为无色界系。于欲化心上如何起欲贪。从他所闻。或自退失生爱味故。或观化者自在势力于彼化心生贪爱故。若心能化香味二法。此能化心是欲界系。色界心不能化作香味故。如是三界唯有一耶。三界无边如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>量。故虽无有始起有情。无量无边佛出于世。一一化度无数有情令证无余般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>界而不穷尽犹若虚空。世界当言云何安住。当言傍住故。契经言。譬如天雨滴如车轴。无间无断从空下澍。如是东方无间无断无量世界或坏或成。如于东方。南西北方亦复如是。不说上下。有说亦有上下二方。余部经中说十方故。色究竟上复有欲界。于欲界下有色究竟。若有离一欲界贪时。诸欲界贪皆得灭离。离色无色应知亦尔。依初静虑起通慧时。所发<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>但能往至自所生界梵世非余。所余通慧应知亦尔。已说三界。五趣云何。颂曰</p><p>于中地狱等自名说五趣</p><p>唯无覆无记有情非中有</p><p>论曰。于三界中说有五趣。即地狱等如自名说。谓前所说地狱傍生鬼及人天是名五趣。唯于欲界有四趣全。三界各有天趣一分。为有三界非趣所摄。而于界中说有五趣。有谓善染外器中有虽是界性而非趣摄。五趣体唯无覆无记。若异此者趣应相杂。于一趣中具有五趣业<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>故。五趣唯是有情数摄。体非中有。施设足论作如是说。四生摄五趣非五摄四生。不摄者何。所谓中有。法蕴足论亦作是言。眼界云何。谓四大种所造净色是眼。眼根眼处眼界地狱傍生鬼人天趣修成中有。契经亦简中有异趣。是何契经。谓七有经。彼说七有。谓地狱有傍生有饿鬼有天有人有业有中有。彼经中说五趣及因并趣方便。故趣唯是无覆无记其理极成。简业有因异诸趣故。迦湿弥罗国诵如是契经。尊者舍利子作是言。具寿。若有地狱诸漏现前故造作增长顺地狱受业。彼身语意曲秽浊故于[木*柰]落迦中受<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>异熟。异熟起已名那落迦。除五蕴法彼那落迦都不可得。故趣唯是无覆无记若如是者。品类足论当云何通。彼说五趣一切随眠所随增故。彼说五趣续生心中容有五部一切烦恼趣及入心。总说为趣。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违失。譬如村落及村落边总名村落。有说。趣体亦通善染。然七有经简业有者。非别说故定非彼摄。如五浊中烦恼与见别说为浊。非别说故。彼见定非烦恼所摄。如是业有虽亦是趣。为显趣因。是故别说。若尔中有亦应是趣。不尔。趣义不相应故。趣谓所往不可说言中有是所往。即死处生故。若尔无色亦应非趣。即于死处而受生故。既尔中有名中有故不应名趣。二趣中故名为中有。此若趣摄非中间故。是则不应说名中有。然彼尊者舍利子言异熟起已名地狱者。说异熟起方名地狱。非说地狱唯是异熟。然复说言除五蕴法彼那落迦不可得者。为遮实有能往诸趣补特伽罗故作是说。非遮余蕴故作是言。毗婆沙师说。趣唯是无覆无记。有说。一向是异熟生。有余师言。亦通长养。即于三界及五趣中。如其次第识住有七。其七者何颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第九卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第九卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别世品第三之二</p><p>当往何趣。所起中有形状如何。颂曰</p><p>此一业引故如当本有形</p><p>本有谓死前居生<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>后</p><p>论曰。若业能引当所往趣。彼业即招能往中有。故此中有若往彼趣。即如所趣当本有形。若尔于一狗等腹中容有五趣中有顿起。既有<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中有现前。如何不能焚烧母腹。彼居本有亦不恒烧。如暂游园。况在中有。设许能烧如不可见亦不可触。以中有身极微细故。所难非理。诸趣中有虽居一腹非互触烧。业所遮故。欲中有量虽如小儿年五六岁而根明利。菩萨中有如盛年时形量周圆具诸相好。故住中有将入胎时照百俱胝四大洲等。若尔何故菩萨母梦中见白象子来入己右胁。此吉瑞相非关中有。菩萨久舍傍生趣故。如讫栗枳王梦所见十事</p><p>谓大象井麨栴檀妙园林</p><p>小象二猕猴广坚衣斗诤</p><p>如是所梦。但表当来余事先兆。非如所见。又诸中有从生门入。非破母腹而得入胎。故双生者前小后大。法善现说复云何通</p><p>白象相端严具六牙四足</p><p>正知入母腹寝如仙隐林</p><p>不必须通。非三藏故。诸讽颂言。或过实故。若必须通如菩萨母所见梦相。造颂无失。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>中有量<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>如本有。与衣俱生。惭愧增故。菩萨中有亦与衣俱。鲜白苾刍尼由本愿力故。彼于世世有自然衣。恒不离身随时改变。乃至最后般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时。即以此衣缠尸焚葬。所余欲界中有无衣。由皆增长无惭愧故。所似本有其体是何。谓死有前生有后蕴。总说有体是五取蕴。于中位别分析为四。一者中有。义如前说。二者生有。谓于诸趣结生刹那。三者本有。除生刹那死前余位。四者死有。谓最后念。次中有前。有色有情具足四有。若在无色中阙具三。已说形量。余义当辩。颂曰</p><p>同净天眼见业通疾具根</p><p>无对不可转食香非久住</p><p>倒心趣欲境湿化染香处</p><p>天首上三横地狱头归下</p><p>论曰。此中有身同类相见。若有修得极净天眼。亦能得见。诸生得眼皆不能观。以极细故。有余师说。天中有眼具足能见。五趣中有。人鬼傍生地狱中有见四三二一。谓自下除上。一切通中业通最疾。[夌*欠]虚<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>是谓通义。通由业得名为业通。此通势用速故名疾。中有具得最疾业通。上至<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>无能遮抑。以业势力最强盛故。一切中有皆具五根。对谓对碍。此金刚等所不能遮故名无对。曾闻析破炎赤铁团见于其中有虫生故。应往彼趣中有已生。一切种力皆不能转。谓不可令人中有没余中有起。余类亦然。为往彼趣中有已起。但应往彼。定不往余。欲中有身资段食不。虽资段食然细非粗。其细者何。谓唯香气。由斯故得健达缚名。诸字界中义非一故。而音短者如设建途及羯建途。略故无过。诸少福者唯食恶香。其多福者好香为食。如是中有为住几时。大德说言。此无定限。生缘未合中有恒存。由彼命根非别业引。与所趣人等众同分一故。若异此者中有命根最后灭时应立死有。设有肉聚等妙高山。至夏雨时变成虫聚。应言诸中有渐待此时。为说从何方顿来至此。虽无经论诚文判释。然依正理应作是言。有杂类生数无边际贪着香味寿量短促。彼诸有情因嗅此气贪香味故俱时命终。由爱觉先感虫身业同时于此受细虫身。或多有情应俱生此。多缘未合住中有中。今遇多缘方顿生此。应俱生者定不异时。如有能招转轮王业。要至人寿八万岁时或过此时方顿与果。非于余位。此亦应然。故世尊言。诸有情类业果差别不可思议。尊者世友言。此极多七日。若生缘未合。便数死数生。有余师言。极七七日。毗婆沙说。此住少时。以中有中乐求生有故非久住。速往结生。其有生缘未即和合。若定此处此类应生。业力即令此缘和合。若非定托此和合缘。便即寄生余处余类。有说转受相似类生。且如家牛及狗熊马欲增次属夏秋冬春。野牛野干罴驴无定。前四中有若不遇时。如次<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>后四同类。岂不中有必无与生众同分别。一业引故。如何可言转受相似</p><p>如是中有为至所生。先起倒心驰趣欲境。彼由业力所起眼根虽住远方能见生处父母交会而起倒心。若男缘母起于男欲。若女缘父起于女欲。翻此缘二俱起嗔心。故施设论有如是说。时健达缚于二心中随一现行。谓爱或恚。彼由起此二种倒心。便谓己身与所爱合。所憎不净泄至胎时。谓是已有便生喜慰。从兹蕴厚中有便没生有起已名已结生。若男处胎依母右胁向背蹲坐。若女处胎依母左胁向腹而住。若非男女住母胎时。随所起贪如应而住。必无中有非女非男。以中有身必具根故。由处中有或女或男故入母胎随应而住。后胎增长或作不男。于此义中复应思择。为由业力精血大种即成根依。为业别生根依大种依精血住。有言。精血即成根依谓前无根中有俱灭。后有根者无间续生。如种与芽灭生道理。由斯初位名羯剌蓝。亦妙顺成此经文句。父母不净生羯剌蓝。又告苾刍。汝等长夜执受血滴增羯吒私。有余师言。别生大种。如依叶粪别有虫生。不净聚中生羯剌蓝。故说父母不净生羯剌蓝。故与彼经<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违失。如是且说胎卵二生。余随所应今次当说。若湿生者染香故生。谓远嗅知生处香气便生爱染往彼受生。随业所应香有净秽。若化生者染处故生。谓远观知当所生处。便生爱染往彼受生。随业所应处有净秽。岂于地狱亦生爱染。由心倒故起染无失。谓彼中有。或见自身冷雨寒风之所逼切。见热地狱火焰炽然。情欣暖触投身于彼。或见自身热风盛火之所逼害。见寒地狱心欲清凉投身于彼。先旧诸师作如是说。由见先造感彼业时己身伴类驰往赴彼。又天中有首正上升如从坐起。人鬼傍生中有行相还如人等。地狱中有头下足上颠坠其中。故伽他说</p><p>颠坠于地狱足上头归下</p><p>由毁谤诸仙乐寂修苦行</p><p>前说倒心入母胎藏。一切中有皆定尔耶。不尔。经言。入胎有四。其四者何。颂曰</p><p>一于入正知二三兼住出</p><p>四于一切位及卵恒无知</p><p>前三种入胎谓轮王二佛</p><p>业智俱胜故如次四余生</p><p>论曰。有诸有情。多集福业勤修念慧。故死生时念力所持正知无乱。于中或有正知入胎。或有正知住胎兼入。或正知出兼知入住。兼言为显后必带前。有诸有情福智俱少。入住出位皆不正知。入不正知住出必尔。顺结颂法故逆说四。诸卵生者入胎等位皆恒无知。如何卵生从卵而出言入胎藏。以卵生者先必入胎。或据当来名卵生者。如契经说造作有为。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>亦言煮饭磨麨故说卵生入胎无失。云何三位正不正知。且诸有情若福微薄入母胎位起倒想解。见大风雨毒热严寒或大军众声威乱逼。遂见自入密草稠林叶窟茅庐投树墙下。住时见已住在此中。出位见身从此处出。若福增多入母胎位起倒想解。自见己身入妙园林升花台殿居胜床等。住出如前。是谓三时不正知者。若于三位皆能正知。于入等时无倒想解。谓入胎位知自入胎。住出胎时自知住出。又别显示四入胎者。且前三种谓转轮王独觉大觉。如其次第。初入胎者。谓转轮王。入位正知非住非出。二入胎者。谓独胜觉。入住正知非于出位。三入胎者。谓无上觉。入住出位皆能正知。此初三人以当名显。何缘如是三品不同。由业智俱如次胜故。第一业胜。谓转轮王宿世曾修广大福故。第二智胜。谓独胜觉久习多闻。胜思择故。第三俱胜。谓无上觉。旷劫<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>胜福智故。除前三种余胎卵生福智俱劣合成第四。此中外道执我者言。若许有情转趣余世。即我所执有我义成。今为遮彼。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别世品第三之三</p><p>无明何义。谓体非明。若尔无明应是眼等。既尔。此义应谓明无。若尔无明体应非有。为显有体义不滥余。颂曰</p><p>明所治无明如非亲实等</p><p>论曰。如诸亲友所对怨敌亲友相违名非亲友。非异亲友。非亲友无。谛语名实。此所对治虚诳言论名为非实。非异于实。亦非实无。等言为显非法非义非事等性非异非无。如是无明别有实体。是明所治非异非无。云何知然。说行缘故。复有诚证。颂曰</p><p>说为结等故非恶慧见故</p><p>与见相应故说能染慧故</p><p>论曰。经说无明以为结缚随眠及漏轭瀑流等。非余眼等及体全无可得说为结缚等事。故有别法说名无明。如恶妻子名无妻子。如是恶慧应名无明。彼非无明有是见故。诸染污慧名为恶慧。于中有见故非无明。若尔非见慧应许是无明。不尔。无明见相应故。无明若是慧应见不相应。无二慧体共相应故。又说无明能染慧故。如契经言。贪欲染心令不<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。无明染慧令不清净。非慧还能染于慧体。如贪异类能染于心。无明亦应异慧能染。如何不许诸染污慧间杂善慧令不清净说为能染。如贪染心令不解脱。岂必现起与心相应方说能染。然由贪力损缚于心令不解脱。后转灭彼贪熏习时心便解脱。如是无明染污于慧令不清净。非慧相应。但由无明损浊于慧。如是分别何理相违。谁复能遮自所分别。然异慧类别有无明。如贪异心此说为善。有执<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>皆是无明。此亦应同前理遮遣。若诸烦恼皆是无明。于结等中不应别说。亦不应与见等相应。见等不应自相应故。或亦应说无明染心。若谓此中就差别说。应于染慧不说总名。既许无明别法为体应说此体。其相云何。谓不了知谛实业果。未测何相名不了知。为异了知。为此非有。二俱有过。如无明说。此谓了知所治别法。此复难测。其相是何。此类法尔应如是说。如余处言。云何为眼。谓清净色眼识所依。无明亦然。唯可辩用。大德法救说。此无明是诸有情恃我类性。异于我慢类体是何。经言。我今如是知已如是见已。诸所有爱。诸所有见。诸所有类性。诸我我所执。我慢执。随眠。断遍知故无影寂灭。故知类性异于我慢。宁知类性即是无明。不可说为余烦恼故。岂不可说为余慢等。若更于此巨细研寻。言论繁杂故应且止。名色何义。色如先辩。今唯辩名。颂曰</p><p>名无色四蕴</p><p>论曰。无色四蕴何故称名。随所立名根境势力于义转变故说为名。云何随名势力转变。谓随种种世共立名。于彼彼义转变诠表。即如牛马色味等名。此复何缘标以名称。于彼彼境转变而缘。又类似名。随名显故。有余师说。四无色蕴舍此身已转趣余生。转变如名。故标名称。触何为义。颂曰</p><p>触六三和生</p><p>论曰。触有六种。所谓眼触乃至意触。此复是何。三和所生。谓根境识三和合故有别触生。且五触生可三和合。许根境识俱时起故。意根过去。法或未来。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>现在。如何和合。此即名和合。谓<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>义成。或同一果故名和合。谓根境识三同顺生触故。诸师于此觉慧不同。有说。三和即名为触。彼引经证。如契经言。如是三法聚集和合说名为触。有说。别法与心相应三和所生说名为触。彼引经证。经言。云何六。六法门。一六内处。二六外处。三六识身。四六触身。五六受身。六六爱身。此契经中根境识外别说六触。故触别有。说即三和名为触者。释后所引六六经言。非由别说便有别体。勿受及爱非法处摄无如是失。离爱受触别有所余法处体故。汝宗离触无别有三。可触及三差别而说。虽有根境不发于识。而无有识不托根境。故已说三更别说触便成无用。有余救言。非诸眼色皆诸眼识因。非诸眼识皆诸眼色果。非因果者别说为三。因果所收总立为触。说离三和有别触者。释前所引如是三法聚集和合名触。经言我部所诵经文异此。或于因上假说果名。如说诸佛出现乐等。如是展转更相难释。言论烦多故应且止。然对法者说有别触。即前六触复合为二。颂曰</p><p>五相应有对第六俱增语</p><p>论曰。眼等五触说名有对。以有对根为所依故。第六意触说名增语。所以然者。增语谓名。名是意触所缘长境故偏就此名增语触。如说眼识但能了青不了是青。意识了青亦了是青。故名为长。故有对触名从所依。增语触名就所缘立。有说。意识语为增上方于境转。五识不然。是故意识独名增语。与此相应名增语触。故有对触名从所依。增语触名就相应立。即前六触随别相应复成八种。颂曰</p><p>明无明非二无漏染污余</p><p>爱恚二相应乐等顺三受</p><p>论曰。明无明等相应成三。一明触。二无明触。三非明非无明触。此三如次应知。即是无漏染污余相应触。余谓无漏及染污余。即有漏善无覆无记。无明触中一分数起。依彼复立爱恚二触。爱恚随眠共相应故。总摄一切复成三触。一顺乐受触。二顺苦受触。三顺不苦不乐受触。此三能引乐等受故。或是乐等受所领故。或能为受行相依故名为顺受。如何触为受所领行相依。行相极似触。依触而生故。如是合成十六种触。受何为义。颂曰</p><p>从此生六受五属身余心</p><p>论曰。从前六触生于六受。谓眼触所生受至意触所生受。六中前五说为身受。依色根故。意触所生说为心受。但依心故。受生与触为后为俱。毗婆沙师说。俱时起触受展转俱有因故。云何二法俱时而生能生所生义可成立。如何不立。无功能故。于已生法余法无能。此与立宗义意无别。如言二法俱时而生能生所生义不成立。于已生法余法无能。义意同前。重说何用。若尔便有互相生失。许故非失。我宗许二为俱有因。亦互为果。仁虽许尔。而契经中不许此二互为因果。契经但说眼触为缘生眼触所生受。曾无经说眼受为缘生眼受所生触。又此义非理。越能生法故。若法极成能生彼法。此法与彼时别极成。如先种后芽先乳后酪先击后声先意后识等。先因后果非不极成。亦有极成同时因果。如眼识等眼色等俱。四大种俱有所造色。此中亦许前根境缘能发后识。前大造聚生后造色。何理能遮。如影与身。岂非俱有。有说。触后方有受生。根境为先次有识起。此三合故即名为触。第三<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>缘触生受。若尔应识非皆有受。诸识亦应非皆是触。无如是失。因前位触故。后触位受生故。诸触时皆悉有受。所有识体无非是触。此不应理。何理相违。谓或有时二触境别。因前受位触生后触位受。如何异境受从异境触生。或应许受此心相应非与此心同缘一境。既尔。若许有成触识是触无受。于此位前有识有受而体非触。缘差故然。斯有何过。若尔便坏十大地法。彼定一切心品恒俱。彼定恒俱依何教立。依本论立。我等但以契经为量。本论非量。坏之何咎。故<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。当依经量。或大地法义非要遍诸心。若尔何名大地法义。谓有三地。一有寻有伺地。二无寻唯伺地。三无寻无伺地。复有三地。一善地。二不善地。三无记地。复有三地。一学地。二无学地。三非学非无学地。若法于前诸地皆有。名大地法。若法唯于诸善地中有。名大善地法。若法唯于诸染地中有。名大烦恼地法。如是等法各随所应更代而生。非皆并起。余说如是大不善地法。因诵引来。是今所增益非本所诵。若于触后方有受生。经云何释。如契经说。眼及色为缘生于眼识。三和合触俱起受想思。但言俱起不说触俱。此于我宗何违须释。又于无间亦有俱声。如契经说。与慈俱行修念觉支。故彼非证。若尔何故。契经中言。是受是想是思是识。如是诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>杂不离。故无有识离于受等。今应审思。相杂何义。此经复说。诸所受即所思。诸所思即所想。诸所想即所识。未了于此为约所缘。为约刹那作如是说。于寿与暖俱时起中。亦有如斯相杂言。故例知。此说定约刹那。又契经言三和合触。如何有识而非三和。或是三和而不名触。故应定许一切识俱悉皆有触诸所有触无不皆与受等俱生。傍论已终。应辩本义。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十一卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十一卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别世品第三之四</p><p>如是已说有情<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。器世间今当说。颂曰</p><p>安立器世间风轮最居下</p><p>其量广无数厚十六洛叉</p><p>次上水轮深十一亿二万</p><p>下八洛叉水余凝结成金</p><p>此水金轮广径十二洛叉</p><p>三千四百半周围此三倍</p><p>论曰。许此三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>如是安立形量不同。谓诸有情业增上力。先于最下依止<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>有风轮生广无数。厚十六亿踰缮那。如是风轮其体坚密。假设有一大诺健那。以金刚轮奋威悬击。金刚有碎风轮无损。又诸有情业增上力。起大云雨澍风轮上。滴如车轴积水成轮。如是水轮于未凝结位深十一亿二万踰缮那。如何水轮不傍流散。有余师说。一切有情业力所持令不流散。如所饮食未熟变时。终不流移堕于熟藏。有余部说。由风所持令不流散。如篅持谷。有情业力感别风起。搏击此水上结成金。如熟乳停上凝成膜。故水轮减唯厚八洛叉。余转成金。厚三亿二万。二轮广量其数是同。谓径十二亿三千四百半。周围其边数成三倍。谓周围量成三十六亿一万三百五十踰缮那。颂曰</p><p>苏迷卢处中次踰健达罗</p><p>伊沙驮罗山朅地洛迦山</p><p>苏达梨舍那頞湿缚羯拏</p><p>毗那怛迦山尼民达罗山</p><p>于大洲等外有铁轮围山</p><p>前七金所成苏迷卢四宝</p><p>入水皆八万妙高出亦然</p><p>余八半半下广皆等高量</p><p>论曰。于金轮上有九大山。妙高山王处中而住。余八周匝绕妙高山。于八山中前七名内。第七山外有大洲等。此外复有铁轮围山。周匝如轮围一世界。持双等七唯金所成。妙高山王四宝为体。谓如次四面北东南西金银吠琉璃颇胝迦宝。随宝威德色显于空。故赡部洲空似吠琉璃色。如是宝等从何而生。亦诸有情业增上力。复大云起雨金轮上滴如车轴。积水奔涛。其水即为众宝种藏。由具种种威德猛风钻击变生众宝类等。如是变水生宝等时。因灭果生。体不俱有。非如数论转变所成。数论云何执转变义。谓执有法<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>常存有余法生有余法灭。如是转变何理相违。谓必无容有法<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>可执别有法灭法生。谁言法外别有有法。唯即此法于转变时异相所依名为有法。此亦非理。非理者何。即是此物而不如此。如是言义曾所未闻。如是变生金宝等已。复由业力引起别风。简别宝等。摄令聚集成山成洲。分水甘醎令别成立内海外海。如是九山住金轮上。入水量皆等八万踰缮那。苏迷卢山出水亦尔。余八出水半半渐卑。谓初持双出水四万。乃至最后铁轮围山出水三百一十二半。如是九山一一广量。各各与自出水量同。颂曰</p><p>山间有八海前七名为内</p><p>最初广八万四边各三倍</p><p>余六半半狭第八名为外</p><p>三洛叉二万二千踰缮那</p><p>论曰。妙高为初轮围最后。中间八海。前七名内。七中皆具八<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>水。一甘。二冷。三软。四轻。五清净。六不臭。七饮时不损喉。八饮已不伤腹。如是七海初广八万。约持双山内边周量。于其四面数各三倍。谓各成二亿四万踰缮那。其余六海量半半狭。谓第二海量广四万。乃至第七量广一千二百五十。此等不说周围量者。以烦多故。第八名外。醎水盈满。量广三亿二万二千。颂曰</p><p>于中大洲相南赡部如车</p><p>三边各二千南边有三半</p><p>东毗提诃洲其相如半月</p><p>三边如赡部东边三百半</p><p>西瞿陀尼洲其相圆无缺</p><p>径二千五百周围此三倍</p><p>北俱卢畟方面各二千等</p><p>中洲复有八四洲边各二</p><p>论曰。于外海中大洲有四。谓于四面对妙高山。南赡部洲北广南狭。三边量等。其相如车。南边唯广三踰缮那半。三边各有二千踰缮那。唯此洲中有金刚座。上穷地际下据金轮。一切菩萨将登正觉。皆坐此座上起金刚喻定。以无余依及余处所有坚固力能持此故。东胜身洲东狭西广。三边量等。形如半月。东三百五十。三边各二千。西牛货洲圆如满月。径二千五百。周围七千半。北俱卢洲形如方座。四边量等。面各二千。等言为明无少增减。随其洲相人面亦然。复有八中洲。是大洲眷属。谓四大洲侧各有二中洲。赡部洲边二中洲者。一遮末罗洲。二筏罗遮末罗洲。胜身洲边二中洲者。一提诃洲。二毗提诃洲。牛货洲边二中洲者。一舍搋洲。二嗢怛罗漫怛里拏洲。俱卢洲边二中洲者。一矩拉婆洲。二憍拉婆洲。此一切洲皆人所住。有说。唯一逻刹娑居。颂曰</p><p>此北九黑山雪香醉山内</p><p>无热池纵广五十踰缮那</p><p>论曰。此赡部洲从中向北。三处各有三重黑山。有大雪山。在黑山北。大雪山北有香醉山。雪北香南有大池水。名无热恼。出四大河。一殑伽河。二信度河。三徙多河。四缚刍河。无热恼池纵广正等。面各五十踰缮那量。八功德水盈满其中。非得通人无由能至。于此池侧有赡部林树形高大其果甘美。依此林故名赡部洲。或依此果以立洲号。复于何处置[木*奈]落迦大[木*奈]落迦。何量有几。颂曰</p><p>此下过二万无间深广同</p><p>上七[木*奈]落迦八增皆十六</p><p>谓煻煨尸粪锋刃烈河增</p><p>各住彼四方余八寒<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a></p><p>论曰。此赡部洲下过二万。有阿鼻旨大[木*奈]落迦。深广同前。谓各二万故。彼底去此四万踰缮那。以于其中受苦无间非如余七大[木*奈]落迦受苦非恒故名无间。且如等活[木*奈]落迦中。诸有情身虽被种种斫刺磨捣。而彼暂遇凉风所吹还活如本。由斯理故立等活名。阿鼻旨中无如是事。有余师说。阿鼻旨中无乐间苦。故名无间。余地狱中有乐间起。虽无异熟而有等流。七[木*奈]落迦在无间上重累而住。其七者何。一者极热。二者炎热。三者大叫。四者号叫。五者众合。六者黑绳。七者等活。有说。此七在无间傍。八[木*奈]落迦增各十六。故薄伽梵说此颂言</p><p>此八[木*奈]落迦我说甚难越</p><p>以热铁为地周匝有铁墙</p><p>四面有四门关闭以铁扇</p><p>巧安布分量各有十六增</p><p>多百踰缮那满中造恶者</p><p>周遍焰交彻猛火恒洞然</p><p>十六增者。八[木*奈]落迦四面门外各有四所。一煻煨增。谓此增内煻煨没膝。有情游彼才下足时。皮肉与血俱燋烂坠。举足还生平复如本。二尸粪增。谓此增内尸粪泥满。于中多有娘矩吒虫。[此/束]利如针身白头黑。有情游彼皆为此虫钻皮破骨[口*(一/巾)]食其髓。三锋刃增。谓此增内复有三种。一刀刃路。谓于此中仰布刀刃以为大道。有情游彼才下足时。皮肉与血俱断碎坠。举足还生平复如本。二剑叶林。谓此林上纯以铦利剑刃为叶。有情游彼风吹叶坠。斩刺肢体骨肉零落。有乌驳狗摣掣食之。三铁刺林。谓此林上有利铁刺。长十六指。有情被逼上下树时。其刺铦锋下上镵刺。有铁[此/束]鸟。探啄有情眼睛心肝争竞而食。刀刃路等三种虽殊而铁杖同故一增摄。四烈河增。谓此增量广满中热醎水。有情入中或浮或没。或逆或顺或横或转。被蒸被煮骨肉糜烂。如大镬中满盛灰汁置麻米等。猛火下燃。麻等于中上下回转举体糜烂。有情亦燃。设欲逃亡。于两岸上有诸狱卒。手执刀枪御捍令回。无由得出。此河如堑。前三似园。四面各四增故言皆十六。此是增上被刑害所。故说名增。本地狱中适被害已重遭害故。有说。有情从地狱出更遭此苦。故说为增。今于此中因论生论。诸地狱卒是有情不。有说。非情。如何动作。有情业力。如成劫风。若尔云何。通彼大德法善现说。如彼颂言</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十二卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十二卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别世品第三之五</p><p>如是已约踰缮那等。辩器<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>身量差别。约年等辩寿量有殊。二量不同未说应说。此二建立无不依名。前二及名未详极少。今应先辩三极少量。颂曰</p><p>极微字<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>色名时极少</p><p>论曰。分析诸色至一极微。故一极微为色极少。如是分析诸名及时至一字刹那。为名时极少。一字名者。如说瞿名。何等名为一刹那量。众缘和合法得自体顷。或有动法行度一极微。对法诸师说。如壮士一疾弹指顷六十五刹那。如是名为一刹那量。已知三极少。前二量云何。今且辩前踰缮那等。颂曰</p><p>极微微金水兔羊牛隙尘</p><p>蚁虱麦指节后后增七倍</p><p>二十四指肘四肘为弓量</p><p>五百俱卢舍此八踰缮那</p><p>论曰。极微为初。指节为后。应知后后皆七倍增。谓七极微为一微量。积微至七为一金尘。积七金尘为水尘量。水尘积至七为一兔毛尘。积七兔毛尘为羊毛尘量。积羊毛尘七为一牛毛尘。积七牛毛尘为隙游尘量。隙尘七为虮。七虮为一虱。七虱为穬麦。七麦为指节。三节为一指。世所极成。是故于颂中不别分别。二十四指横布为肘。竖积四肘为弓。谓寻。竖积五百弓为一俱卢舍。一俱卢舍许是从村至阿练若中间道量。说八俱卢舍为一踰缮那。如是已说踰缮那等。今当辩后年等量别。颂曰</p><p>百二十刹那为怛刹那量</p><p>腊缚此六十此三十须臾</p><p>此三十昼夜三十昼夜月</p><p>十二月为年于中半减夜</p><p>论曰。刹那百二十为一怛刹那。六十怛刹那为一腊缚。三十腊缚为一牟呼栗多。三十牟呼栗多为一昼夜。此昼夜有时增有时减有时等。三十昼夜为一月。总十二月为一年。于一年中分为三际。谓寒热雨各有四月。十二月中六月减夜。以一年内夜总减六。云何如是。故有颂言</p><p>寒热雨际中一月半已度</p><p>于所余半月智者知夜减</p><p>如是已辩刹那至年。劫量不同今次当辩。颂曰</p><p>应知有四劫谓坏成中大</p><p>坏从狱不生至外器都尽</p><p>成劫从风起至<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>初生</p><p>中劫从无量减至寿唯十</p><p>次增减十八后增至八万</p><p>如是成已住名中二十劫</p><p>成坏坏已空时皆等住劫</p><p>八十中大劫大劫三无数</p><p>论曰。言坏劫者。谓从地狱有情不复生至外器都尽。坏有二种。一趣坏。二界坏。复有二种。一有情坏。二外器坏。谓此世间过于二十中劫住已。从此复有等住二十坏劫便至。若时地狱有情命终无复新生。为坏劫始。乃至地狱无一有情。尔时名为地狱已坏。诸有地狱定受业者。业力引置他方狱中。由此准知傍生鬼趣。然各先坏本处住者。人天杂居者与人天同坏。若时人趣此洲一人无师法然得初静虑。从静虑起唱如是言。离生喜乐甚乐甚静。余人闻已皆入静虑。命终并得生梵世中。乃至此洲有情都尽。是名已坏赡部洲人。东西二洲例此应说。北洲命尽生欲界天。由彼无能入定离欲。乃至人趣无一有情。尔时名为人趣已坏。若时天趣四大王天随一法然得初静虑。乃至并得生梵世中。尔时彼天有情都尽。是名已坏大王众天。余五欲天例同此说。乃至欲界无一有情。名欲界中有情已坏。若时梵世随一有情无师法然得二静虑。从彼定起唱如是言。定生喜乐甚乐甚静。余天闻已皆入彼静虑。命终并得生极光净天。乃至梵世中有情都尽。如是名已坏有情世间。唯器世间空旷而住。余十方界一切有情感此三千世界业尽。于此渐有七日轮现。诸海干竭众山洞然。洲渚三轮并从焚燎。风吹猛焰烧上天宫。乃至梵宫无遗灰烬。自地火焰烧自地宫。非他地灾能坏他地。由相引起故作是言。下火风飘梵烧上地。谓欲界火猛焰上升为缘引生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>火焰。余灾亦尔。如应当知。如是始从地狱渐减乃至器尽总名坏劫。所言成劫。谓从风起乃至地狱始有情生。谓此世间灾所坏已。二十中劫唯有<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。过此长时次应复有等住二十成劫便至。一切有情业增上力。空中渐有微细风生。是器世间将成前相。风渐增盛成立如前所说风轮水金轮等。然初成立大梵王宫乃至夜摩宫。后起风轮等。是谓成立外器世间。初一有情极光净殁生大梵处为大梵王。后诸有情亦从彼殁有生梵辅。有生梵众。有生他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天宫。渐渐下生乃至人趣俱卢牛货胜身赡部。后生饿鬼傍生地狱。法尔后坏必最初成。若初一有情生无间狱二十中成劫应知已满。此后复有二十中劫名成已住。次第而起。谓从风起造器世间。乃至后时有情渐住。此洲人寿经无量时至住劫初寿方渐减。从无量减至极十年即名为初一住中劫。此后十八皆有增减。谓从十年增至八万。复从八万减至十年。尔乃名为第二中劫次后十七例皆如是。于十八后从十岁增极至八万岁名第二十劫。一切劫增无过八万。一切劫减唯极十年。十八劫中一增一减时。量方等初减后增故。二十劫时量皆等。此总名为成已住劫。所余成坏及坏已空并无减增二十差别。然由时量与住劫同。准住各成二十中劫。成中初劫起器世间。后十九中有情渐住。坏中后劫减器世间。前十九中有情渐舍。如是所说成住坏空。各二十中积成八十。总此八十成大劫量。劫性是何。谓唯<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。经说三劫阿僧企耶<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>方得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。于前所说四种劫中。积何劫成三劫无数。累前大劫为十百千。乃至积成三劫无数。既称无数何复言三。非无数言显不可数。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>经说六十数中。阿僧企耶是其一数。云何六十。如彼经言。有一无余数始为一。一十为十。十十为百。十百为千。十千为万。十万为洛叉。十洛叉为度洛叉。十度洛叉为俱胝。十俱胝为末陀。十末陀为阿庾多。十阿庾多为大阿庾多。十大阿庾多为那庾多。十那庾多为大那庾多。十大那庾多为钵罗庾多。十钵罗庾多为大钵罗庾多。十大钵罗庾多为矜羯罗。十矜羯罗为大矜羯罗。十大矜羯罗为频跋罗。十频跋罗为大频跋罗。十大频跋罗为阿刍婆。十阿刍婆为大阿刍婆。十大阿刍婆为毗婆诃。十毗婆诃为大毗婆诃。十大毗婆诃为嗢蹭伽。十嗢蹭伽为大嗢蹭伽。十大嗢蹭伽为婆喝那。十婆喝那为大婆喝那。十大婆喝那为地致婆。十地致婆为大地致婆。十大地致婆为醯都。十醯都为大醯都。十大醯都为羯腊婆。十羯腊婆为大羯腊婆。十大羯腊婆为印达罗。十印达罗为大印达罗。十大印达罗为三磨钵耽。十三磨钵耽为大三磨钵耽。十大三磨钵耽为揭底。十揭底为大揭底。十大揭底为拈筏罗阇。十拈筏罗阇为大拈筏罗阇。十大拈筏罗阇为姥达罗。十姥达罗为大姥达罗。十大姥达罗为跋蓝。十跋蓝为大跋蓝。十大跋蓝为珊若。十珊若为大珊若。十大珊若为毗步多。十毗步多为大毗步多。十大毗步多为跋逻搀。十跋逻搀为大跋逻搀十大跋逻搀为阿僧企耶。于此数中忘失余八。若数大劫至此数中阿僧企耶名劫无数。此劫无数复积至三。经中说为三劫无数。非诸算计不能数知。故得说为三劫无数。何缘菩萨发愿长时精进修行方期<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。如何不许愿长时修。无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>甚难可得。非多愿行无容得成。菩萨要经三劫无数。修大福德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>资粮<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>多多百千苦行方证无上正等菩提。是故定应发长时愿。若余方便亦得<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。何用为菩提久修多苦行。为欲利乐一切有情故求菩提发长时愿。云何令我具大堪能。于苦瀑流济诸含识。故舍涅槃道求无上菩提。济他有情于己何益。菩萨济物遂己悲心。故以济他即为己益。谁信菩萨有如是事。有怀润己无大慈悲。于如是有情此事实难信。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>润己有大慈悲。于如是有情此事非难信。如有久习无哀愍者。虽无益己而乐损他。世所同悉如是。菩萨久习慈悲。虽无利己而乐他益。如何不信。又如有情由数习力于<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>行不了有为。执以为我而生爱着。由此为因甘负众苦。智者同悉如是。菩萨数习力故。舍自我爱增恋他心。由此为因甘负众苦。如何不信。又由种姓异有此志愿起。以他苦为己苦。用他乐为己乐。不以自苦乐为己苦乐事。不见异益他而别有自益。依如是义故。有颂言</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十三卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十三卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之一</p><p>如前所说有情<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>及器世间各多差别。如是差别由谁而生。颂曰</p><p>世别由业生思及思所作</p><p>思即是意业所作谓身语</p><p>论曰。非由一主先觉而生。但由有情业差别起。若尔何故。俱从业生郁金栴檀等甚可爱乐。而内身形等与彼相违。以诸有情业类如是。若造杂业感内身形。于九疮门常流不净。为对治彼感外具生色香味触甚可爱乐。诸天众等造纯净业故彼所招二事俱妙。此所由业其体是何。谓心所思及思所作。故契经说。有二种业。一者思业。二思已业。思已业者谓思所作。如是二业分别为三。谓即有情身语意业。如何建立此三业耶。为约所依。为据<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。为就等起。纵尔何违。若约所依应唯一业。以一切业并依身故。若据自性应唯语是业。以三种中唯语即业故。若就等起亦应唯一业。以一切业皆意等起故。毗婆沙师说。立三业如其次第由上三因。然心所思即是意业。思所作业分为身语二业。是思所等起故。身语二业自性云何。颂曰</p><p>此身语二业俱表无表性</p><p>论曰。应知如是所说诸业中。身语二业俱表无表性。且身语表其相云何。颂曰</p><p>身表许别形非行动为体</p><p>以诸有为法有<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>尽故</p><p>应无无因故生因应能灭</p><p>形亦非实有应二根取故</p><p>无别极微故语表许言声</p><p>论曰。由思力故。别起如是如是身形名身表业。有余部说。动名身表。以身动时由业动故。为破此故。说非行动。以一切有为皆有刹那故刹那何。谓得体无间灭。有此刹那法名有刹那。如有杖人名为有杖。诸有为法才得自体。从此无间必灭归无。若此处生即此处灭。无容从此转至余方。故不可言动名身表。若有为法皆有刹那。不至余方义可成立。诸有为法皆有刹那。其理极成。后必尽故。谓有为法灭不待因。所以者何。待因谓果。灭无非果故不待因灭既不待因。才生已即灭。若初不灭后亦应然。以后与初有性等故。既后有尽知前有灭若后有异方可灭者。不应即此而名有异。即此相异。理必不然。岂不世间现见薪等由与火合故致灭无。定无余量过<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>者。故非法灭皆不待因。如何知薪等由火合故灭。以薪等火合后便不见故。应共审思。如是薪等为由火合灭故不见。为前薪等生已自灭后不更生无故不见。如风手合灯焰铃声。故此义成应由比量。何谓比量。谓如前说。灭无非果故不待因。又若待因薪等方灭。应一切灭无不待因。如生待因无无因者。然世现见觉焰音声。不待余因刹那自灭。故薪等灭亦不待因。有执觉声前因后灭。彼亦非理。二不俱故。疑智苦乐及贪嗔等自相相违理无俱义。若复有位明了觉声无间便生不明了者。如何同类不明了法能灭明了同类法耶。最后觉声复由谁灭。有执。灯焰灭以住无为因。有执。焰灭时由法非法力。彼俱非理。无非因故。非法非法为生灭因。以刹那刹那顺违相反故。或于一切有为法中。皆可计度有此因义。既尔本诤便应止息。许不待余因皆有刹那故。又若薪等灭火合为因。于熟变生中有下中上。应生因体即成灭因。所以者何。谓由火合能令薪等有熟变生。中上熟生下中熟灭。或即或似生上中因即能为因灭下中熟则生因体应即灭因。或灭生因应相无别。不应由即此或似此彼有。彼复由即此或似此非有。设于火焰差别生中容计能生能灭因异。于灰雪酢日水地合。能令薪等熟变生中。如何计度生灭因异。若尔现见煎水减尽。火合于中为何所作。由事火合火界力增。由火界增能令水聚于后后位生渐渐微。乃至最微后便不续。是名火合于中所作。故无有因令诸法灭。法自然灭。是坏性故。自然灭故。才生即灭。由才生即灭。刹那灭义成。有刹那故定无行动。然于无间异方生中如烧草焰行起行增上慢。既由斯理行动定无。身表是形理得成立。然经部说。形非实有。谓显色聚一面多生。即于其中假立长色。待此长色于余色聚一面少中假立短色。于四方面并多生中假立方色。于一切处遍满生中假立圆色。所余形色随应当知如见火[火*曹]。于一方面无间速运。便谓为长。见彼周旋谓为圆色。故形无实别类色体。若谓实有别类形色。则应一色二根所取。谓于色聚长等差别。眼见身触俱能了知。由此应成二根取过。理无色处二根所取。然如依触取长等相。如是依显能取于形。岂不触形俱行一聚。故因取触能忆念形。非于触中亲取形色。如见火色便忆火暖。及嗅花香能念花色。此中二法定不相离故因取一可得念余。无触与形定不相离。如何取触能定忆形。若触与形非定同聚。然由取触能忆念形。显色亦应因触定忆。或应形色如显无定。则取触位。应不了形。而实不然。故不应说因取于触能忆念形。或锦等中见多形故。便应一处有多实形。理不应然。如众显色。是故形色非实有体。又诸所有有对实色。必应有实别类极微。然无极微名为长等。故即多物如是安布差别相中假立长等。若谓即以形色极微如是安布名为长等。此唯朋党。非极成故。谓若形色有别极微自相极成。可得聚集如是安布以为长等。非诸形色有别极微自相极成犹如显色。云何得有聚集安布。岂不现见诸土器等有显相同而形相异。为不已辩。即于多物安布差别。假立长等。如众蚁等有相不殊。然有行轮安布形别。形依显等理亦应然。岂不闇中或于远处观杌等物了形非显。宁即显等安布为形。以闇远<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>显不了。是故但起长等分别。如于远闇观众树人。但了行军不知别相。理必应尔。以或有时不了显形唯知总聚。既已遮遣行动及形。汝等经部宗立何为身表。立形为身表。但假而非实。既执但用假为身表。复立何法为身业耶。若业依身立为身业。谓能种种运动身思。依身门行故名身业。语业意业随其所应立差别名当知亦尔。若尔何故契经中说有二种业。一者思业。二思已业。此二何异。谓前加行起思惟思。我当应为如是如是所应作事名为思业。既思惟已起作事思。随前所思作所作事。动身发语名思已业。若尔表业则为定无。表业既无。欲无表业亦应非有。便成大过。如是大过有理能遮。谓从如前所说二表殊胜思故。起思差别名为无表。此有何过。此应名为随心转业。如定无表心俱转故。无如是过。审决胜思动发胜思所引生故。设许有表。亦待如前所说思力。以性钝故。毗婆沙师说。形是实故。身表业形色为体。语表业体谓即言声。无表业相如前已说。经部亦说。此非实有。由先誓限唯不作故。彼亦依过去大种施设。然过去大种体非有故。又诸无表无色相故。毗婆沙说。此亦实有。云何知然。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十四卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十四卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之二</p><p>傍论已了。复应辩前表无表相。颂曰</p><p>无表三<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>不律仪非二</p><p>论曰。此中无表略说有三。一者律仪。二不律仪。三者非二谓非律仪非不律仪。能遮能灭恶戒相续故名律仪。如是律仪差别有几。颂曰</p><p>律仪别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>静虑及道生</p><p>论曰。律仪差别略有三种。一别解脱律仪。谓欲缠戒。二静虑生律仪。谓色缠戒。三道生律仪。谓无漏戒。初律仪相差别云何。颂曰</p><p>初律仪八种实体唯有四</p><p>形转名异故各别不相违</p><p>论曰。别解脱律仪相差别有八。一苾刍律仪。二苾刍尼律仪。三正学律仪。四勤策律仪。五勤策女律仪。六近事律仪。七近事女律仪。八近住律仪。如是八种律仪相差别。总名第一别解脱律仪。虽有八名实体唯四。一苾刍律仪。二勤策律仪。三近事律仪。四近住律仪。唯此四种别解律仪皆有体实。相各别故。所以者何。离苾刍律仪。无别苾刍尼律仪。离勤策律仪无别正学勤策女律仪。离近事律仪无别近事女律仪。云何知然。由形改转。体虽无舍得而名有异故。形谓形相。即男女根。由此二根男女形别。但由形转令诸律仪名为苾刍苾刍尼等。谓转根位令本苾刍律仪名苾刍尼律仪。或苾刍尼律仪名苾刍律仪。令本勤策律仪名勤策女律仪。或勤策女律仪及正学律仪名勤策律仪。令本近事律仪名近事女律仪。或近事女律仪名近事律仪。非转根位有舍先得得先未得律仪<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。故四律仪非异三体。若从近事律仪受勤策律仪。复从勤策律仪受苾刍律仪。此三律仪为由增足远离方便立别别名。如只双金钱及五十二十。为体各别具足顿生。三种律仪体不相杂。其相各别具足顿生。三律仪中具三离杀。乃至具足三离饮酒。余数多少随其所应。既尔相望同类何别。由因缘别相望有异。其事云何。如如求受多种学处。如是如是。能离多种憍逸处时。即离众多杀等缘起。以诸远离依因缘发故。因缘别远离有异。若无此事舍苾刍律仪。尔时则应三律仪皆舍。前二摄在后一中故。既不许然。故三各别。然此三种互不相违。于一身中俱时而转。非由受后舍前律仪。勿舍苾刍戒便非近事等。近事近住勤策苾刍四种律仪云何安立。颂曰</p><p>受离五八十一切所应离</p><p>立近事近住勤策及苾刍</p><p>论曰。应知此中如数次第。依四远离立四律仪。谓受离五所应远离。安立第一近事律仪。何等名为五所应离。一者<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。二不与取。三欲邪行。四虚诳语。五饮诸酒。若受离八所应远离。安立第二近住律仪。何等名为八所应离。一者杀生。二不与取。三非梵行。四虚诳语。五饮诸酒。六涂饰香鬘舞歌观听。七眠坐高广严丽床座。八食非时食。若受离十所应远离。安立第三勤策律仪。何等名为十所应离。谓于前八涂饰香鬘舞歌观听开为二种。复加受畜金银等宝以为第十。若受离一切应离身语业。安立第四苾刍律仪。别解律仪名差别者。颂曰</p><p>俱得名尸罗妙行业律仪</p><p>唯初表无表名别解业道</p><p>论曰。能平险业故名尸罗。训释词者。谓清凉故。如伽他言。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>戒乐。身无热恼故名尸罗。智者称扬故名妙行。所作自体故名为业。岂不无表亦名不作。如何今说所作自体。有惭耻者受无表力不造众恶故名不作。表思所造得所作名。有余释言。是作因故。是作果故。名作无失。能防身语故名律仪。如是应知。别解脱戒通初后位无差别名。唯初<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>表及无表得别解脱及业道名。谓<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>时初表无表。别别弃舍种种恶故。依初别舍义立别解脱名。即于尔时所作究竟。依业畅义立业道名。故初刹那名别解脱。亦得名曰别解律仪。亦得名为根本业道。从第二念乃至未舍不名别解脱名别解律仪。不名业道名为后起。谁成就何律仪。颂曰</p><p>八成别解脱得静虑圣者</p><p>成静虑道生后二随心转</p><p>论曰。八众皆成就别解脱律仪。谓从苾刍乃至近住。外道无有所受戒耶。虽有不名别解脱戒。由彼所受无有功能永脱诸恶依著有故。静虑生者。谓此律仪从静虑生。或依静虑。若得静虑者定成此律仪。诸静虑边亦名静虑。如近村邑得村邑名故。有说言于此村邑有稻田等。此亦应然。道生律仪圣者成就。此复有二。谓学无学。于前分别俱有因中说二律仪是随心转。于此三内其二者何。谓静虑生及道生二。非别解脱。所以者何。异心<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>亦恒转故。静虑无漏二种律仪。亦名断律仪。依何位建立。颂曰</p><p>未至九无间俱生二名断</p><p>论曰。未至定中九无间道。俱生静虑无漏律仪。以能永断欲缠恶戒及能起惑名断律仪。由此或有静虑律仪非断律仪。应作四句。第一句者。除未至定九无间道有漏律仪。所余有漏静虑律仪。第二句者。依未至定九无间道无漏律仪。第三句者。依未至定九无间道有漏律仪。第四句者。除未至定九无间道无漏律仪所余一切无漏律仪。如是或有无漏律仪非断律仪。应作四句。准前四句如应当知。若尔<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所说略戒</p><p>身律仪善哉善哉语律仪</p><p>意律仪善哉善哉遍律仪</p><p>又契经说。应善守护应善安住眼根律仪。此意根律仪以何为<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。此二自性非无表色。若尔是何。颂曰</p><p>正知<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>合名意根律仪</p><p>论曰。为显如是二种律仪俱以正知正念为体故。列名已复说合言。谓意律仪慧念为体。即合二种为根律仪。故离合言显勿如次。今应思择。表及无表谁成就何。齐何时分。且辩成无表律仪不律仪。颂曰</p><p>住别解无表未舍恒成现</p><p>刹那后成过不律仪亦然</p><p>得静虑律仪恒成就过未</p><p>圣初除过去住定道成中</p><p>论曰。住别解脱补特伽罗。未舍以来恒成现世。此别解脱律仪无表。初刹那后亦成过去。前未舍言遍流至后。无散无表有成未来。不随心色势微劣故。如说安住别解律仪。住不律仪应知亦尔。谓至未舍恶戒以来恒成现世。恶戒无表初刹那后亦成过去。诸有获得静虑律仪。乃至未舍恒成过未。余生所失过去定律仪。今初刹那必还得彼故。一切圣者无漏律仪。过去未来亦恒成就。有差别者。谓初刹那必成未来非成过去。此类圣道先未起故。若有现住静虑彼道。如次成现在静虑道律仪。非出观时有成现在。已辩安住<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>律仪。住中云何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十五卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十五卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之三</p><p>此别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>静虑无漏三种<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。从彼得一亦余二不。不尔。云何。颂曰</p><p>从一切二现得欲界律仪</p><p>从根本恒时得静虑无漏</p><p>论曰。欲界律仪。谓别解脱。此从一切根本业道及从加行后起而得。从二得者。谓从二类。即情非情性罪遮罪。从现得者。谓从现世蕴处界得。非从去来。由此律仪有情处转。去来非是有情处故。若得静虑无漏律仪。应知但从根本业道。尚不从彼加行后起得此律仪况从遮罪。从恒时者。谓从过去现在未来蕴处界得。由此差别应作四句。有蕴处界从彼唯得别解律仪非余二等。第一句者。谓从现世加行后起及诸遮罪。第二句者。谓从去来根本业道。第三句者。谓从现世根本业道。第四句者。谓从去来加行后起。非于正得善律仪时可有现世恶业道等。是故应言从现处得。理应但说防护未来。定不应言防护过现。诸有获得律不律仪。从一切有情支因有异不。此定有异相云何。颂曰</p><p>律从诸有情支因说不定</p><p>不律从一切有情支非因</p><p>论曰。律仪定从一切有情得。无少分理。支因说不定。支不定者。有从一切得谓苾刍律仪。有从四支得谓所余律仪。唯根本业道名律仪支故。因不定者。谓或有义从一切因。或约余义唯许从一。从一切者。谓从无贪嗔痴。必俱起故。唯从一者。谓从下中上心。不俱起故。此中且就后三因说。或有一类住律仪者。于一切有情得律仪。非一切支非一切因。谓以下心或中或上。受近事勤策戒。或有一类住律仪者。于一切有情得律仪。由一切支非一切因。谓以下心或中或上。受苾刍戒。或有一类住律仪者。于一切有情得律仪。由一切支及一切因。谓以三心受近事勤策苾刍戒。或有一类住律仪者。于一切有情得律仪。由一切因非一切支。谓以三心受近事近住勤策戒。无有不遍。于诸有情得律仪者。以于一切诸有情所住善意乐方得律仪。异则不然。以恶意乐不全息故。若人不作五种定限方可受得别解律仪。谓有情支处时缘定。有情定者。念我唯于某类有情当离杀等。言支定者。念我唯于某律仪支当持不犯。言处定者。念我唯住某类方域当离杀等。言时定者。念我唯于一月等时能离杀等。言缘定者。念我唯除斗战等缘能离杀等。如是受者不得律仪。但得律仪相似妙行。于非所能境如何得律仪。由普于有情发起增上不损命意乐故得律仪。毗婆沙师有作是说。若谓一向于所能境方可受得别解律仪。则此律仪应有增减。以所能境与非所能二类有情有转易故。如是便有别解律仪离得舍缘有得舍过。彼说不然。如生草等先无后起或起已枯于彼律仪无增无减。能不能境所得律仪。境转易时例亦应尔。彼言不尔。所以者何。以诸有情前后性等草等前后性不同故。若尔有情般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>已。如前性类今时既无。于彼律仪如何无减。故如是释于理不然。前所说因于理为善。若尔前佛及所度生已涅槃者。后佛于彼既不发得别解律仪。如何尸罗无减前过。以一切佛别解律仪皆从一切有情处得。设彼有情今犹在者。后佛从彼亦得律仪。故后尸罗无减前过。已说从彼得诸律仪。得不律仪定从一切有情业道。无少分境及不具支不律仪者。此定无有由一切因。下品等心无俱起故。若有一类由下品心得不律仪。后于异时由上品心断<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>命。彼但成就下不律仪。亦成<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>上品表等。中品上品例此应知。此中何名不律仪者。谓诸屠羊屠鸡屠猪捕鸟捕鱼。猎兽劫盗魁脍典狱。缚龙煮狗及罝弶等。等言类显王典刑罚及余听察断罪等人。但恒有害心名不律仪者。由彼一类住不律仪。或有不律仪名不律仪者。言屠羊者。谓为活命要期尽寿恒欲害羊。余随所应当知亦尔。遍于有情界得诸律仪其理可尔。由普欲利乐胜阿世耶而受得故。非屠羊等不律仪人于己至亲有损害意。乃至为救自身命缘亦不欲杀。如何可说普于一切得不律仪。由彼至亲若为羊等于彼亦可有损害心。既知至亲现非羊等。如何于彼可有害心。又圣必无作羊等理。如何于彼得不律仪。若观未来羊等自体。于现相续得不律仪。是则羊等于未来世亦有至亲及圣自体。于彼决定无损害心。是则应观未来自体。不于现在得不律仪。于羊等现身既有害意。如何不于彼得不律仪。于母等现身既无害意。如何亦于彼得不律仪。于等事中应求异理。又屠羊等不律仪人。于一生中不与不取。于己妻妾住知足心。痖不能言无语四过。如何彼亦得具支不律仪。彼遍损善阿世耶故。虽痖不言而身表语所欲说义故得具支。若尔彼人或时先受二三学处。后但受杀。于余不损善阿世耶。如何具发七支恶戒。毗婆沙者作如是言。必无缺支及余一分可得名住不律仪人。经部诸师作如是说。随所期限支具不具及全分一分皆得不律仪。律仪亦然。唯除八戒。由随彼量<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>尸罗性相相违互相遮故。已说从彼得不律仪。得不律仪及余无表。如何方便未说当说。颂曰</p><p>诸得不律仪由作及誓受</p><p>得所余无表由田受重行</p><p>论曰。诸不律仪由二因得。一者生在不律仪家。由初现行杀等加行。二者虽复生在余家。由初要期受杀等事。谓我当作如是事业。以求财物养活自身。当于尔时便发恶戒。得余无表由三种因。一者由田。谓于如是诸<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>所施园林等。彼善无表初施便生。如说有依诸福业事。二者由受。谓自誓言。若未<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>不先食等。或作誓限。于斋日月半月及年常施食施。三由重行。谓起如是殷重作意<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>行恶。由此三因起余无表。如是已说得律仪等。舍律仪等未说当说。具云何舍别解律仪。颂曰</p><p>舍别解调伏由故舍命终</p><p>及二形俱生断善根夜尽</p><p>有说由犯重余说由法灭</p><p>伽湿弥罗说犯二如负财</p><p>论曰。言调伏者意显律仪。由此能令根调伏故。唯除近住所余七种别解律仪。由四缘舍。一由意乐对有解人发有表业舍学处故。二由弃舍众同分故。三由二形俱时生故。四由所因善根断故。舍近住戒由前四缘及由夜尽。是故总说别解律仪由五缘舍。何缘舍戒由此五缘。与受相违表业生故。所依舍故。所依变故。所因断故。过期限故。有余部说。于四极重感堕罪中。若随犯一亦舍勤策苾刍律仪。有余部言。由<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>灭亦能令舍别解律仪。以法灭时一切学处结界羯磨皆止息故。迦湿弥罗国毗婆沙师言。犯根本罪时不舍<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>戒。所以然者。非犯一边一切律仪应遍舍故。非犯余罪有断尸罗。然有二名。谓持犯戒。如有财者负他债时名为富人及负债者。若于所犯发露悔除名具尸罗。不名犯戒。如还债已但名富人。若尔何缘薄伽梵说犯四重者不名苾刍。不名<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>非释迦子。破苾刍体害沙门性。坏灭堕落立他胜名。依胜义苾刍密意作是说。此言凶勃。凶勃者何。谓于<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>了义所说以别义释令成不了。与多<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>者为犯重罪缘。宁知此言是了义说。由律自释有四苾刍。一名想苾刍。二自称苾刍。三乞匃苾刍。四破惑苾刍。此义中言非苾刍者。谓非白四羯磨受<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>苾刍。非此苾刍先是胜义。后由犯重成非苾刍。故知此言是了义说。然彼所说。非犯一边一切律仪应遍舍者。彼言便是征诘大师。大师此中立如是喻。如多罗树若被断头必不复能生长广大。诸苾刍等犯重亦然。大师此中喻显何义。意显于戒随犯一边根本重罪。令余所受必不复能生长广大。谓彼毁犯诸重罪时。违越苾刍根本行故。与极猛利无惭无愧共相应故。行根既断。理应遍舍一切律仪。又犯重人世尊不许食僧祇食下至一抟。践毗诃罗一足跟地。摈出一切苾刍事业。大师依彼说如是言。应速拔除稻禾稗莠。应速简弃腐朽栋梁。应速簸扬种中糠秕。如是应速驱摈众中实非苾刍称苾刍者。彼苾刍体其相如何。随相是何体必应有。以世尊说准他当知有四沙门。更无第五。所言四者。一胜道沙门。二示道沙门。三命道沙门。四污道沙门。虽有此说而彼唯有余沙门相故名沙门。如被烧材假鹦鹉[此/束]涸池败种火轮死人。若犯重人非苾刍者。则应无有授学苾刍。不说犯重人皆成他胜罪。但成他胜罪。定说非苾刍。谓或有人相续殊胜。虽犯极重戒而非他胜罪。由彼无有一念覆心。法主世尊制立如是。若犯他胜便非苾刍。何不重令出家<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。由彼相续已为极重无惭愧怀。无力能发出家律仪。如蕉种故。非观彼有苾刍律仪故。不重令出家受戒。所以然者。设彼后时谓是苾刍更舍所学亦不许彼重出家故。于此无义苦救何为。若如是人犹有苾刍性。应自归礼如是类苾刍。正法灭时虽无一切结界羯磨及毗奈耶。未得律仪无新得理。而先得者无有舍义。静虑无漏二律仪等。云何当舍。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十六卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十六卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之四</p><p>又经中说。业有四种。谓或有业黑黑异熟。或复有业白白异熟。或复有业黑白黑白异熟。或复有业非黑非白无异熟能尽诸业。其相云何。颂曰</p><p>依黑黑等殊所说四种业</p><p>恶<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>界善能尽彼无漏</p><p>应知如次第名黑白俱非</p><p>论曰。佛依业果性类不同所治能治殊说黑黑等四。诸不善业一向名黑。染污性故。异熟亦黑。不可意故。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>善业一向名白。不杂恶故。异熟亦白。是可意故。何故不言<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>善。传说若处有二异熟谓中生有。具三种业谓身语意。则说非余。然契经中有处亦说。欲界善业名为黑白。恶所杂故。异熟亦黑白。非爱果杂故。此黑白名依相续立。非据<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。所以者何。以无一业及一异熟是黑亦白。互相违故。岂不恶业果善业果杂故。是则亦应名为白黑。不善业果非必应为善业果杂。欲善业果必定应为恶业果杂。以欲界中恶胜善故。诸无漏业能永断尽前三业者名为非黑。不染污故。亦名非白。以不能招白异熟故。此非白言是密意说。以佛于彼大空经中告阿难陀。诸无学法纯善纯白一向无罪。本论亦言。云何白法。谓诸善法无覆无记。无异熟者不堕界故。与<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>法性相违故。诸无漏业为皆能尽前三业不。不尔。云何。颂曰</p><p>四法忍离欲前八无间俱</p><p>十二无漏思唯尽纯黑业</p><p>离欲四静虑第九无间思</p><p>一尽杂纯黑四令纯白尽</p><p>论曰。于见道中四法智忍。及于<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>离欲染位前八无间圣道俱行有十二思唯尽纯黑。离欲界染第九无间圣道俱行一无漏思。双令黑白及纯黑尽。此时总断欲界善故。亦断第九不善业故。离四静虑一一地染。第九无间道俱行无漏思。此四唯令纯白业尽。何缘诸地有漏善法。唯最后道能断非余。以诸善法非自性断。已断有容现在前故。然由缘彼<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>尽时方说名为断彼善法。尔时善法得离系故。由此乃至缘彼烦恼余一品在。断义不成。善法尔时未离系故。颂曰</p><p>有说<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>受余欲业黑杂</p><p>有说欲见灭余欲业黑俱</p><p>论曰。有余师说。顺地狱受及欲界中顺余受业如次名为纯黑杂业。谓地狱异熟唯不善业感。故顺彼受名纯黑业。唯除地狱余欲界中异熟皆通<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业感。故顺彼受名黑白业。有余师说。欲见所断及欲界中所有余业。如次名为纯黑俱业。谓见所断无善杂故名纯黑业。欲修所断有善不善故名俱业。又经中说有三牟尼。又经中言有三清净。俱身语意。相各云何。颂曰</p><p>无学身语业即意三牟尼</p><p>三清净应知即诸三妙行</p><p>论曰。无学身语业名身语牟尼。意牟尼即无学意。非意业。所以者何。胜义牟尼<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>为体。谓由身语二业比知。又身语业是远离体。意业不然。无无表故由远离义建立牟尼。是故即心由身语业能有所离故名牟尼。何故牟尼唯在无学。以阿罗汉是实牟尼诸烦恼言永寂静故。诸身语意三种妙行名身语意三种清净。暂永远离一切恶行烦恼垢故名为清净。说此二者为息有情计邪牟尼邪清净故。又经中说有三恶行又经中言有三妙行。俱身语意。相各云何。颂曰</p><p>恶身语意业说名三恶行</p><p>及贪嗔邪见三妙行翻此</p><p>论曰。一切不善身语意业。如次名身语意恶行。然意恶行复有三种。谓非意业贪嗔邪见。贪等离思别有体故。譬喻者言。贪嗔邪见即是意业。故思经中说此三种为意业故。若尔则应业与烦恼合成一体。许有烦恼即是意业斯有何失。毗婆沙师说。彼非理若许尔者。便与众多理教相违成大过失。然契经说是意业者。显思以彼为门转故。由此能感非爱果故。是聪慧者所诃厌故。此行即恶。故名恶行。三妙<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。翻此应知。谓身语意一切善业。非业无贪无嗔<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。正见邪见。既无故思欲益他损他。如何成善恶。能与损益为根本故。又经中言有十业道。或善或恶。其相云何。颂曰</p><p>所说十业道摄恶妙行中</p><p>粗品为其性如应成善恶</p><p>论曰。于前所说。恶妙行中若粗显易知摄为十业道。如应若善摄前妙行。不善业道摄前恶行。不摄何等恶妙行耶。且不善中身恶业道。于身恶行不摄一分。谓加行后起余不善身业。即饮诸酒执打缚等。以加行等非粗显故。若身恶行令他有情失命失财失妻妾等说为业道。令远离故。语恶业道于语恶行不摄加行后起及轻。意恶业道于意恶行不摄恶思及轻贪等。善业道中身善业道于身妙行不摄一分。谓加行后起及余善身业。即离饮酒施<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>等。语善业道于语妙行不摄一分。谓爱语等。意善业道于意妙行不摄一分。谓诸善思。十业道中。前七业道为皆定有表无表耶。不尔。云何。颂曰</p><p>恶六定无表彼自作淫二</p><p>善七受生二定生唯无表</p><p>论曰。七恶业道中。六定有无表。谓<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>不与取虚诳语离间语粗恶语杂秽语。如是六种若遣他为。根本成时自表无故。若有自作彼六业道。则六皆有表无表二。谓起表时彼便死等。后方死等与遣使同。根本成时唯无表故。唯欲邪行必具二种。要是自身所究竟故。非遣他作。如自生喜。七善业道若从受生。必皆具二。谓表无表。受生尸罗必依表故。静虑无漏所摄<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>名为定生。此唯无表。但依心力而得生故。加行后起如根本耶。不尔。云何。颂曰</p><p>加行定有表无表或有无</p><p>后起此相违</p><p>论曰。业道加行必定有表。此位无表或有或无。若猛利缠淳净心起则有无表。异此则无。后起翻前。定有无表。此位表业或有或无。谓若后时起随前业。则有表业。异此便无。于此义中如何建立加行根本后起位耶。且不善中最初杀业。如屠羊者将行杀时。先发杀心从床而起。执持价直趣卖羊廛。[捐-口+左]触羊身酬价捉取。牵还养饭将入屠坊。手执杖刀若打若刺。或一或再至命未终。如是皆名杀生加行。随此表业彼正命终。此<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>顷表无表业。是谓杀生根本业道。由二缘故。令诸有情根本业道杀罪所触。一由加行。二由果满。此刹那后杀无表业随转不绝名杀后起。及于后时剥截治洗。若称若卖或煮或食赞述其美表业刹那。如是亦名杀生后起。余六业道随其所应三分不同。准例应说。贪嗔邪见才现在前。即说名为根本业道。故无加行后起差别。此中应说。为所杀生住死有时能杀生者彼刹那顷表无表业即成业道。为死后耶。若尔何失。二俱有过。若所杀生正住死有能杀生者业道即成。即能杀者与所杀生。俱时命终应成业道。然宗不许彼业道成。若所杀<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>终以后。能杀生者业道方成。是即不应先作是说。随此表业彼正命终。此刹那顷表无表业。是谓杀生根本业道。又应违害毗婆沙师释本论中加行未息。谓本论说颇有已害生杀生未灭耶。曰有。如已断生命彼加行未息。毗婆沙者释此文言。此中于后起以加行声说。应言于根本说加行声。许命终后根本未息故。如无有过此中应说。此中说何名为无过。谓于根本说加行声。若尔于时所有表业如何可成根本业道。何为不成。以无用故。无表于此有何用耶。故业道成非由有用。但由加行果<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>时。此二俱成根本业道。又诸业道展转相望容有互为加行后起。今且应说杀生业道以十业道为起加行。谓如有人欲害怨敌。设诸谋计合构杀缘。或杀<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>祈请助力。或盗他物以资杀事。或淫彼妇令杀其夫。或为乖离彼亲友故起语四过令生猜阻。设有势力无救护心。或于彼财心生贪着。或即于彼起嗔恚心。或起邪见长养杀业然后方杀。如是名为以十业道为杀加行。杀怨敌已复于后时诛其所亲收其财物淫彼所爱。乃至复起贪嗔邪见。次第现前。此十名为杀生后起。所余业道如应当知。贪等不应能为加行。非唯心起加行即成。唯起心时未作事故。又经中说。苾刍当知。杀有三种。一从贪生。二从嗔生。三从痴生。乃至邪见有三亦尔。此中应说。何相杀生名从贪生。问余亦尔。非诸业道一切皆由<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>究竟。然其加行不与彼同。云何不同。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十七卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十七卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之五</p><p>如是已辩十业道相。依何义名业道。颂曰</p><p>此中三唯道七业亦道故</p><p>论曰。十业道中后三唯道。业之道故立业道名。彼相应思说名为业。彼转故转。彼行故行。如彼势力而造作故。前七是业。身语业故。亦业之道。思所游故。由能等起身语业思托身语业为境转故。业业之道立业道名。故于此中言业道者。具显业道业业道义。虽不同类而一为余。于世典中俱极成故。离杀等七无贪等三立业道名类此应释。此加行后起何缘非业道。为此依此彼方转故。又前说此摄粗品故。又若由此有减有增令内外物有增有减立为业道。异此不然。譬喻论师执贪嗔等即是意业。依何义释彼名业道。应问彼师。然亦可言。彼是意业恶趣道故立业道名。或互相乘皆名业道。如是所说十恶业道。皆与善法现起相违。诸断善根由何业道。断续善相差别云何。颂曰</p><p>唯邪见断善所断欲生得</p><p>拨<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>一切渐断二俱舍</p><p>人三洲男女见行断非得</p><p>续善疑有见顿现除逆者</p><p>论曰。恶业道中唯有上品<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>邪见能断善根。若尔何缘本论中说云何上品诸不善根。谓诸不善根能断善根者。或离欲位最初所除。由不善根能引邪见。故邪见事推在彼根。如火烧村火由贼起故<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>说彼贼烧村。何等善根为此所断。谓唯欲界生得善根。色无色善先不成故。施设足论当云何通。如彼论言。唯由此量是人已断<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>善根。依上善根得更远说。令此相续非彼器故。何缘唯断生得善根。加<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>根先已退故。缘何邪见能断善根。谓定拨无因果邪见。拨无因者。谓定拨无妙行恶行。拨无果者。谓定拨无彼果异熟。有余师说。此二邪见犹如无间<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道别。有余师说。断善邪见唯缘有漏。非无漏缘。唯自界缘不缘他界。由彼唯作相应随眠。境不随增。势力劣故。如是说者通一切缘。随因亦增。有强力故。有余师说。九品善根由一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>邪见顿断。如见道断见所断惑。如是说者渐断善根。谓九品善根由九品邪见逆顺相对渐次而断。如<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>断修所断惑。即下下邪见。能断上上善根。乃至下下善根。上上邪见所断。若作是说符本论文。如本论言。云何名微俱行善根。谓断善根时最后所舍者。由舍彼故名断善根。若尔彼文何理复说云何上品诸不善根。谓诸不善根能断善根者。彼依究竟密说此言。由此善根断无余故。谓若犹有一品善根。余品善根因斯可起。未可说彼名断善根。断究竟时方名断善。故唯说上品名能断善根。有余师言。断九品善终无中出如见道中。如是说者通出不出。有余师说先舍<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>后断善根。未易舍故。如是说者若彼律仪是此品心所等起果。此品心断舍彼律仪。以果与因品类同故。为在何处能断善根。人趣三洲非在恶趣。亦非天趣。所以者何。以恶趣中染不染慧不坚牢故。以天趣中现见<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>诸业果故。言三洲者。除北俱卢。彼无极恶阿世耶故。有余师说。唯赡部洲。若尔便违本论所说。如本论说。赡部洲人极少成八根。东西洲亦尔。如是断善依何类身。唯男女身。志意定故。有余师说。亦非女身。欲勤慧等皆昧钝故。若尔便违本论所说。如本论说。若成女根定成八根。男根亦尔。为何<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>能断善根。唯见行人非爱行者。诸爱行者恶阿世耶极躁动故。诸见行者恶阿世耶极坚深故。由斯理趣非扇搋等能断善根。爱行类故。又此类人如恶趣故。此善根断其体是何。善断应知非得为体。以断善位善得不生。非得续生替善根得非得生位名断善根。故断善根非得为体。善根断已由何复续。由疑有见。谓因果中有时生疑。此或应有。或生<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>定有非无。尔时善根得还续起。善得起故名续善根。有余师言。九品渐续。如是说者顿续善根。然后后时渐渐现起。如顿除病气力渐增。于现身中能续善不。亦有能续除造逆人。经依彼人作如是说。彼定于现法不能续善根。彼人定从<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>将殁。或即于彼将受生时能续善根。非余位故。言将生位。谓中有中。将殁时言。谓彼将死。若由因力彼断善根将死时续。若由缘力彼断善根将生时续。由自他力应知亦尔。又意乐坏非加行坏断善根者。是人现世能续善根。若意乐坏加行亦坏断善根者。要身坏后方续善根。见坏戒不坏见坏戒亦坏断善根者应知亦尔。有断善根非堕邪定。应作四句。第一句者。谓布剌拏等。第二句者。谓未生怨等。第三句者。谓天授等。第四句者。谓除前相。已乘义便辩断善根。今应复明本业道义。所说善恶二业道中。有几并生与思俱转。颂曰</p><p>业道思俱转不善一至八</p><p>善总开至十别遮一八五</p><p>论曰。于诸业道思俱转中。且不善与思从一唯至八。一俱转者。谓离所余贪等三中随一现起。若先加行造恶色业不染心时随一究竟。二俱转者。谓嗔心时究竟杀业。若起贪位成不与取或欲邪行或杂秽语。三俱转者。谓以嗔心于属他生俱时杀盗。若尔所说偷盗业道由贪究竟理应不成。依不异心所作究竟故作如是决判应知。若先加行造恶色业贪等起时随二究竟。四俱转者。谓欲坏他说虚诳言或粗恶语意业道一语业道三。若先加行造恶色业贪等现前随三究竟。如是五六七皆如理应知。八俱转者。谓先加行造作所余六恶色业。自行邪欲俱时究竟。后三业道自力现前必不俱行故无九十。如是已说不善业道与思俱转数有不同。善业道与思总开容至十。别据显相遮一八五。二俱转者。谓善五识及依无色尽无生智现在前时无散善七。三俱转者。谓与正见相应<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>现在前时无七色善。四俱转者。谓恶无记心现在前位。得近住近事勤策律仪。六俱转者。谓善五识现在前时得上三戒。七俱转者。谓善意识无随转色。正见相应现在前时得上三戒。或恶无记心现前时得苾刍戒。九俱转者。谓善五识现在前时得苾刍戒。或依无色尽无生智现在前时得苾刍戒。或静虑摄尽无生智相应意识现在前时。十俱转者。谓善意识无随转色正见相应现在前时得苾刍戒。或余一切有随转色正见相应心正起位。别据显相所遮如是。通据隐显则无所遮。谓离律仪有一八五。一俱转者。谓恶无记心现在前时得一支远离。五俱转者。谓善意识无随转色正见相应现在前时得二支等。八俱转者。谓此意识现在前时得五支等。善恶业道于何界趣处。几唯成就几亦通现行。颂曰</p><p>不善地狱中粗杂嗔通二</p><p>贪邪见成就北洲成后三</p><p>杂语通现成余欲十通二</p><p>善于一切处后三通现成</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十八卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十八卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别业品第四之六</p><p>于前所辩三重障中。说五无间为<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>体。五无间业其体是何。颂曰</p><p>此五无间中四身一语业</p><p>三杀一诳语一<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>加行</p><p>论曰。五无间中四是身业。一是语业。三是杀生。一虚诳语根本业道。一是杀生业道加行。以如来身不可害故。破僧无间是虚诳语。既是虚诳语何缘名破僧。因受果名。或能破故。若尔僧破其体是何。能所破人谁所成就。颂曰</p><p>僧破不和合心不相应行</p><p>无覆无记性所破僧所成</p><p>论曰。僧破体是不和合性。无覆无记心不相应行蕴所摄。岂成无间。如是僧破因诳语生。故说破僧是无间果。非能破者成此僧破。但是所破僧众所成。此能破人何所成就。破僧异熟何处几时。颂曰</p><p>能破者唯成此虚诳语罪</p><p>无间一劫熟随罪增苦增</p><p>论曰。能破僧人成破僧罪。此破僧罪诳语为性。即僧破俱生语表无表业。此必无间大<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中经一中劫受极重苦。余逆不必生于无间。若作多逆罪皆于次生熟如何多逆同感一生。随彼罪增苦还增剧。谓由多逆感地狱中大柔软身多猛苦具。受二三四五倍重苦。谁于何处能破于谁。破在何时。经几时破。颂曰</p><p>苾刍见净行破异处愚夫</p><p>忍异师道时名破不经宿</p><p>论曰。能破僧者要大苾刍。必非在家苾刍尼等。唯见<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>非爱行人。住净行人非犯戒者。以犯戒者言无威故。要异处破。非对大师。以诸如来不可轻逼。言词威肃对必无能。唯破异生非破圣者。以诸圣者证法性故。有说。得忍亦不可破。为含二义说愚夫言。要所破僧忍师异佛。忍异佛说有余圣道。应说僧破在如是时。此夜必和不经宿住。如是名曰破法轮僧。能障圣道轮坏僧和合故。何洲人几破法轮僧。破羯磨僧何洲人几。颂曰</p><p>赡部洲九等方破法轮僧</p><p>唯破羯磨僧通三洲八等</p><p>论曰。唯赡部洲人。少至九。或复过此能破法轮。非于余洲。以无佛故。有<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>处方有异师。要八苾刍分为二众。以为所破。能破第九。故众极少犹须九人。等言为明过此无限。唯破羯磨通在三洲。极少八人。多亦无限。通三洲者。有圣教故。要一界中僧分二部。别作羯磨故须八人。过此无遮故亦言等。于何时分无破法轮。颂曰</p><p>初后疱双前佛灭未结界</p><p>于如是六位无破法轮僧</p><p>论曰。初谓世尊转法轮未久。后谓善逝将般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时。此二时中僧一味故。于正戒见疱未起时。要二疱生方可破故。未立<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>第一双时。法尔由彼速还合故。佛灭后时无真大师为敌对故。未结界时无一界中分二部故。于此六位无破法轮。非破法轮诸佛皆有。必依宿业有此事故。且止傍论应辩逆缘。颂曰</p><p>弃坏恩德田转形亦成逆</p><p>母谓因彼血误等无或有</p><p>打心出佛血害后无学无</p><p>论曰。何缘害母等成无间非余。由弃恩田坏德田故。谓害父母是弃恩田。如何有恩。身生本故。如何弃彼。谓舍彼恩。德田谓余阿罗汉等。具诸胜德及能生故。坏德所依故成逆罪。父母形转杀成逆耶。逆罪亦成。依止一故。由如是义故。有问。言颇有令男离命根。非父阿罗汉而为无间罪触不。曰有。谓母转形。颇有令女离命根非母阿罗汉而为无间罪触不。曰有。谓父转形。设有女人羯剌蓝堕。余女收取置产门中生子。杀何成害母逆。因彼血者身生本故。诸有所作应咨后母。能饮能养能长成故。若于父母起杀加行。误杀余人无无间罪。于非父母起杀加行。误杀父母亦不成逆。如子执杖击父母。蚊母隐在床谓余而杀。若一加行害母及余二无表生。表唯逆罪。以无间业势力强故。尊者妙音说有二表。表是积集极微成故。若害阿罗汉无阿罗汉想。于彼依止起定杀心。无简别故亦成逆罪。若有害父父是阿罗汉得一逆罪。以依止一故。若尔喻说当云何通。佛告始欠持。汝已造二逆。所谓害父杀阿罗汉。彼显一逆由二缘成。或以二门诃责彼罪。若于佛所恶心出血。一切皆得无间罪耶。要以杀心方成逆罪。打心出血无间则无。若杀加行时彼非阿罗汉将死方得阿罗汉果。能杀彼者有逆罪耶。无。于无学身无杀加行故。若造无间加行不可转。为有离染及得圣果耶。颂曰</p><p>造逆定加行无离染得果</p><p>论曰。无间加行若必定成中间决无离染得果。余恶业道加行中间。若圣道生业道不起。依止与彼定相违故。于诸恶行无间业中何罪最重。于诸妙行世善业中何最大果。颂曰</p><p>破僧虚诳语于罪中最大</p><p>感第一有思世善中大果</p><p>论曰。虽了法非法。为欲破僧而起虚诳语颠倒显示。此无间中为最大罪。由此伤毁<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>身故。障世生天<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道故。谓僧已破乃至未合。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>入圣得果离染尽漏皆悉被遮。习定温诵思等业息。<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>法轮不转。<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>龙等身心扰乱故招无间一劫异熟。由此破僧罪为最重。余无间罪如其次第第五三一后后渐轻。第二最轻。恩等少故。若尔何故三罚业中。佛说意罚为最大罪。又说罪中邪见最大。据五无间说破僧重。约三罚业说意罪大。就五僻见说邪见重。或依大果害多有情断诸善根。如次说重。感第一有异熟果思。于世善中为最大果。感八万大劫极静异熟故。约异熟果故说此言。据离系果则金刚喻定相应思能得大果。诸结永断为此果故。为简此故说世善言。为唯无间罪定生地狱。诸无间同类亦定生彼。有余师说。非无间生。同类者何。颂曰</p><p>污母无学尼杀住定菩萨</p><p>及有学圣者夺僧和合缘</p><p>破坏窣堵波是无间同类</p><p>论曰。如是五种随其次第是五无间同类业体。谓有于母阿罗汉尼行极污染谓非梵行。或有杀害住定菩萨。或杀学圣者。或夺僧合缘。或破窣堵波。是五逆同类。有异熟业于三时中极能为障。言三时者。颂曰</p><p>将得忍不还无学业为障</p><p>论曰。若从顶位将得忍时感恶趣业皆极为障。以忍超彼异熟地故。如人将离本所居国一切债主皆极为障。若有将得不还果时。欲界系业皆极为障。唯除随顺现法受业。若有将得无学果时。色无色业皆极为障。亦除顺现。二喻如前。如上所言住定菩萨为从何位得住定名。彼复于何说名为定。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第十九卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第十九卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别随眠品第五之一</p><p>前言世别皆由业生。业由随眠方得生长。离随眠业无感有能。所以者何。随眠有几。颂曰</p><p>随眠诸有本此差别有六</p><p>谓贪嗔亦慢无明见及疑</p><p>论曰。由此随眠是诸有本故业离此无感有能。何故随眠能为有本。以诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>现起能为十种事故。一坚根本。二立相续。三治自田。四引等流。五发业有。六摄自具。七迷所缘。八导识流。九越善品。十广缚义。令不能越自界地故。由此随眠能为有本。故业因此有感有能。此略应知差别有六。谓贪嗔慢无明见疑。颂说亦言。意显慢等亦由贪力于境随增。由贪随增义如后辩。及声显六体各不同。若诸随眠体唯有六。何缘经说有七随眠。颂曰</p><p>六由贪异七有贪上二界</p><p>于内门转故为遮<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>想</p><p>论曰。即前所说六随眠中分贪为二。故经说七。何等为七。一欲贪随眠。二嗔随眠。三有贪随眠。四慢随眠。五无明随眠。六见随眠。七疑随眠。欲贪随眠依何义释。为欲贪体即是随眠。为是欲贪之随眠义。于余六义征问亦尔。若尔何失。二俱有过。若欲贪体即是随眠。便违契经。如契经说。若有一类。非于多时为欲贪缠缠心而住。设心暂尔起欲贪缠寻如实知出离方便。彼由此故于欲贪缠能正遣除并随眠断。若是欲贪之随眠义。随眠应是心不相应。便违对法。如本论说。欲贪随眠<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>相应。毗婆沙师作如是说。欲贪等体即是随眠。岂不违经。无违经失。并随眠者并随缚故。或经于得假说随眠。如火等中立苦等想。阿毗达磨依实相说。即诸烦恼说名随眠。由此随眠是相应法。何理为证知定相应。以诸随眠染恼心故。覆障心故。能违善故。谓随眠力能染恼心。未生善不生。已生善退失。故随眠体非不相应。若不相应能为此事。则诸善法应无起时。以不相应恒现前故。既诸善法容有起时。故知随眠是相应法。此皆非证。所以者何。若许随眠非相应者。不许上三事是随眠所为。然经部师所说最善。经部于此所说如何。彼说欲贪之随眠义。然随眠体非心相应。非不相应。无别物故。烦恼睡位说名随眠。于觉位中即名缠故。何名为睡。谓不现行种子随逐。何名为觉。谓诸烦恼现起缠心。何等名为烦恼种子。谓自体上差别功能。从烦恼生能生烦恼。如念种子是证智生能生当念功能差别。又如芽等有前果生能生后果功能差别。若执烦恼别有随眠心不相应名烦恼种。应许念种非但功能别有不相应能引生后念。此既不尔。彼云何然。差别<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>不可得故。若尔六六契经相违。经说于乐受有贪随眠故。经但说有。不言尔时即有随眠。何所违害。于何时有。于彼睡时。或假于因立随眠想。傍论且止。应辩正论。言贪分二。谓欲有贪。此中有贪以何为体。谓色无色二界中贪此。名何因唯于彼立。彼贪多托内门转故。谓彼二界多起定贪。一切定贪于内门转故。唯于彼立有贪名。又由有人于上二界起解脱想。为遮彼故。谓于上界立有贪名。显彼所缘非真解脱。此中自体立以有名。彼诸有情多于等至及所依止深生味着故。说彼唯味着自体。非味着境。离欲贪故。由此唯彼立有贪名。既说有贪在上二界。义准欲界贪名欲贪。故于颂中不别显示。即上所说六种随眠。于本论中复分为十。如何成十。颂曰</p><p>六由见异十异谓有身见</p><p>边执见邪见见取戒禁取</p><p>论曰。六随眠中见行异为五。余非见五积数总成十故于十中五是见性。一有身见。二边执见。三邪见。四见取。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>禁取。五非见性。一贪二嗔三慢四无明五疑。又即所说六种随眠。于本论中说九十八。依何义说九十八耶。颂曰</p><p>六行部界异故成九十八</p><p>欲见苦等断十七七八四</p><p>谓如次具离三二见见疑</p><p>色无色除嗔余等如欲说</p><p>论曰。六种随眠由行部界有差别故成九十八。谓于六中由见行异分别为十。如前已辩。即此所辩十种随眠。部界不同成九十八。部谓见<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>修所断五部。界谓欲色无色<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。且于欲界五部不同乘十随眠成三十六。谓见苦谛至修所断。如次有十七七八四。即上五部。于十随眠一二一一如其次第。具离三见二见见疑。谓见苦谛所断具十。见集灭谛所断各七。离有身见边见戒取。见道谛所断八。离有身见及边执见。修所断四。离见及疑。如是合成三十六种。前三十二名见所断。才见谛时彼则断故。最后有四名修所断。见四谛已后后时中数数习道彼方断故。如是已显。十随眠中萨迦耶见唯在一部。谓见苦所断。边执见亦尔。戒禁取通在二部。谓见苦见道所断。邪见通四部。谓见苦集灭道所断。见取疑亦尔。余贪等四各通五部。谓见四谛及修所断。此中何相见苦所断。乃至何相是修所断。若缘见此所断为境名见此所断。余名修所断。如是六中见分十二。疑分为四。余四各五。故欲界中有三十六。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>五部各除嗔。余与欲同。故各三十一。由是本论以六随眠行部界殊说九十八。于此所辩九十八中八十八见所断。忍所害故。十随眠修所断。智所害故。如是所说见修所断为决定尔。不尔云何。颂曰</p><p>忍所害随眠有顶唯见断</p><p>余通见修断智所害唯修</p><p>论曰。忍声通<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>类智忍。于忍所害诸随眠中有顶地摄唯见所断。唯类智忍方能断故。余八地摄通见修断。谓圣者断唯见非修。法类智忍如应断故。若异生断唯修非见。数习世俗智所断故。智所害诸随眠。一切地摄。唯修所断。以诸圣者及诸异生。如其所应。皆由数习无漏世俗智所断故。有余师说。外道诸仙不能伏断见所断惑。如大分别诸业契经说。离欲贪诸外道类有缘欲界邪见现行。及梵网经亦说。彼类有缘欲界诸见现行。谓于前际分别论者。有执全常。有执一分。有执诸法无因生等。非<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>惑缘欲界生。于欲界境已离贪故。定是欲界诸见未断。毗婆沙师释彼经义。起见时暂退。如提婆达多。由行有殊分见为五。名先已列。自体如何。颂曰</p><p>我我所断常拨无劣谓胜</p><p>非因道妄谓是五见自体</p><p>论曰。执我及我所是萨迦耶见。坏故名萨。聚谓迦耶。即是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>和合蕴义。迦耶即萨名萨迦耶。此萨迦耶即五取蕴。为遮常一想故立此名。要此想为先方执我故。毗婆沙者作如是释。有故名萨。身义如前。勿无所缘计我我所。故说此见缘于有身。缘萨迦耶而起此见。故标此见名萨迦耶。诸见但缘有漏法者。皆应标以萨迦耶名。然佛但于我我所执摽此名者。令知此见缘萨迦耶。非我我所。以我我所毕竟无故。如契经说。苾刍当知。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>等。诸有执我等随观见一切。唯于五取蕴起。即于所执我我所事执断执常名边执见。以妄执取断常边故。于实有体苦等谛中。起见拨无名为邪见。一切妄见皆颠倒转并应名邪。而但拨无名邪见者。以过甚故。如说臭酥恶执恶等。此唯损减。余增益故。于劣谓胜名为见取。有漏名劣。圣所断故。执劣为胜总名见取。理实应立见等取名。略去等言。但名见取。于非因道谓因道见。一切总说名戒禁取。如大<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>生主。或余非世间因妄起因执。投水火等种种邪行。非生天因妄起因执唯<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>戒禁。数相应智等。非解脱道妄起道执。理实应立戒禁等取名。略去等言但名戒禁取。是谓五见自体。应知。若于非因起是因见。此见何故非见集断。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别随眠品第五之二</p><p>诸有情类于此事中随眠随增名系此事。应说过去现在未来何等随眠能系何事。颂曰</p><p>若于此事中未断贪嗔慢</p><p>过现若已起未来意遍行</p><p>五可生自世不生亦遍行</p><p>余过未遍行现正缘能系</p><p>论曰。且诸随眠总有二种。一者自相。谓贪嗔慢。二者共相。谓见疑痴。事虽有多此说所系。如应未断流至后门。若此事中有贪嗔慢。于过去世已生未断。现在已生能系此事。以贪嗔慢是自相惑。非诸有情定遍起故。若未来世<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>相应贪嗔慢三遍于三世乃至未断皆能系缚。未来五识相应贪嗔若未断可生唯系未来世。未来五识相应贪嗔若未断不生亦能系三世。所余一切见疑无明去来未断遍缚三世。由此三种是共相惑一切有情俱遍缚故。若现在世正缘境时。随其所应能系此事。应辩诸事过去未来。为实有无方可说系。若实是有则一切行恒时有故应说为常。若实是无如何可说有能所系及离系耶。毗婆沙师定立实有。然彼诸行不名为常。由与有为诸相合故。为此所立决定增明应略标宗显其理趣。颂曰</p><p>三世有由说二有境果故</p><p>说三世有故许说一切有</p><p>论曰。三世实有。所以者何。由契经中<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说故。谓世尊说。苾刍当知。若过去色非有。不应多闻圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>众于过去色勤修厌舍。以过去色是有故。应多闻圣弟子众于过去色勤修厌舍。若未来色非有。不应多闻圣弟子众于未来色勤断欣求。以未来色是有故。应多闻圣弟子众于未来色勤断欣求。又具二缘识方生故。谓契经说。识二缘生。其二者何。谓眼及色。广说乃至意及诸法。若去来世非实有者。能缘彼识应阙二缘。已依圣教证去来有。当依正理证有去来。以识起时必有境故。谓必有境识乃得生。无则不生。其理决定。若去来世境体实无。是则应有无所缘识。所缘无故识亦应无。又已谢业有当果故。谓若实无过去体者。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>二业当果应无。非果生时有现因在。由此教理。毗婆沙师。定立去来二世实有。若自谓是说一切有宗决定应许实有去来世。以说三世皆定实有故。许是说一切有宗。谓若有人说三世实有。方许彼是说一切有宗。若人唯说有现在世及过去世未与果业。说无未来及过去世已与果业。彼可许为分别说部。非此部摄。今此部中差别有几。谁所立世最善可依。颂曰</p><p>此中有四种类相位待异</p><p>第三约作用立世最为善</p><p>论曰。尊者法救作如是说。由类不同三世有异。彼谓诸法行于世时。由类有殊非体有异。如破金器作余物时。形虽有殊而体无异。又如乳变成于酪时。舍味势等。非舍显色。如是诸法行于世时。从未来至现在。从现在入过去。唯舍得类非舍得体。尊者妙音作如是说。由相不同三世有异。彼谓诸法行于世时。过去正与过去相合。而不名为离现未相。未来正与未来相合。而不名为离过现相。现在正与现在相合。而不名为离过未相。如人正染一妻室时。于余姬媵不名离染。尊者世友作如是说。由位不同三世有异。彼谓诸法行于世时。至位位中作异异说。由位有别非体有异。如运一筹置一名一置百名百置千名千。尊者觉天作如是说。由待有别三世有异。彼谓诸法行于世时。前后相待立名有异。如一女人名母名女。此四种说一切有中。第一执法有转变故。应置数论外道朋中。第二所立世相杂乱。三世皆有三世相故。人于妻室贪现行时。于余境贪唯有成就。现无贪起何义为同。第四所立前后相待。一世法中应有三世。谓过去世前后<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。应名去来中为现在。未来现在类亦应然。故此四中第三最善。以约作用位有差别。由位不同立世有异。彼谓诸法作用未有名为未来。有作用时名为现在。作用已灭名为过去。非体有殊。此已具知。彼应复说。若去来世体亦实有应名现在。何谓去来。岂不前言约作用立。若尔现在有眼等根彼同分摄有何作用。彼岂不能取果与果。是则过去同类因等既能与果。应有作用。有半作用世相应杂。已略推征。次当广破。颂曰</p><p>何碍用云何无异世便坏</p><p>有谁未生灭此法性甚深</p><p>论曰。应说若法自体恒有。应一切时能起作用。以何碍力令此法体所起作用时有时无。若谓众缘不和合者。此救非理。许常有故。又此作用云何得说为去来今。岂作用中而得更立有余作用。若此作用非去来今而复说言作用是有。则无为故应常非无故不应言作用已灭及此未有法名去来。若许作用异法体者。可有此失。然无有异。故不应言有此过失。若尔所立世义便坏。谓若作用即是法体。体既恒有用亦应然。何得有时名为过未。故彼所立世义不成。何为不成。以有为法未已生名未来。若已生未已灭名现在。若已灭名过去。彼复应说若如现在法体实有去来亦然。谁未已生谁复已灭。谓有为法体实恒有。如何可得成未已生已灭。先何所阙。彼未有故名未已生。后复阙何。彼已无故名为已灭。故不许法本无今有有已还无则三世义。应一切种皆不成立。然彼所说恒与有为诸相合故。行非常者此但有虚言。生灭理无故。许体恒有说性非常。如是义言所未曾有。依如是义。故有颂言</p><p>许法体恒有而说性非常</p><p>性体复无别此真<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>作</p><p>又彼所言世尊说故。去来二世体实有者。我等亦说有去来世。谓过去世曾有名有。未来当有。有果因故。依如是义说有去来。非谓去来如现实有。谁言彼有如现在世。非如现世彼有云何。彼有去来二世<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。此复应诘。若俱是有如何可言是去来性。故说彼有。但据曾当<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>二性。非体实有。世尊为遮谤因果见据曾当义说有去来。有声通显有无法故。如<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>说有灯先无有灯后无。又如有言有灯已灭非我今灭。说有去来其义亦应尔。若不尔者去来性不成。若尔何缘世尊依彼杖髻外道说业过去尽灭变坏而犹是有。岂彼不许业曾有性。而今世尊重为说有。依彼所引现相续中与果功能。密说为有。若不尔者。彼过去业现实有性过去岂成。理必应尔。以薄伽梵于胜义空契经中说。眼根生位无所从来。眼根灭时无所造集。本无今有有已还无。去来眼根若实有者。经不应说本无等言。若谓此言依现世说此救非理。以现世性与彼眼根体无别故。若许现世本无今有有已还无。是则眼根去来无体义已成立。又彼所说。要具二缘识方生故。去来二世体实有者。应共寻思。意法为缘生意识者。为法如意作能生缘。为法但能作所缘境。若法如意作能生缘。如何未来百千劫后当有彼法。或当亦无为能生缘生今时识。又<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>性违一切生立为能生不应正理。若法但能为所缘境。我说过未亦是所缘。若无如何成所缘境。我说彼有如成所缘。如何成所缘。谓曾有当有。非忆过去色受等时。如现分明观彼为有。但追忆彼曾有之相。逆观未来当有亦尔。谓如曾现在所领色相。如是追忆过去为有。亦如当现在所领色相如是逆观未来为有。若如现有应成现世。若体现无。则应许有缘无境识。其理自成。若谓去来极微散乱有而非现。理亦不然。取彼相时非散乱故。又若彼色有同现在。唯有极微散乱为异。则极微色其体应常。又色唯应极微聚散竟无少分可名生灭。是则遵崇邪命者论弃背善逝所说契经。如契经说。眼根生位无所从来。乃至广说。又非受等极微集成。如何可言去来散乱。然于受等追忆逆观。亦如未灭已生时相。若如现有体应是常。若体现无。还应许有缘无境识。理亦自成。若体全无是所缘者第十三处应是所缘。诸有达无第十三处。此能缘识为何所缘。若谓即缘彼名为境。是则应拨彼名为无。又若缘声先非有者。此能缘识为何所缘。若谓即缘彼声为境求声无者应更发声。若谓声无住未来位。未来实有如何谓无。若谓去来无现世者。此亦非理。其体一故。若有少分体差别者。本无今有其理自成。故识通缘有非有境。然菩萨说世间所<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>知我见无是处者。意说。他人怀增上慢亦于非有现相谓有。我唯于有方观为有。若异此者则一切觉皆有所缘。何缘于境得有犹豫。或有差别。理必应然。以薄伽梵于余处说善来苾刍。汝等若能为我弟子。无谄无诳有信有勤。我旦教汝令暮获胜。我暮教汝令旦获胜。便知有是有。非有是非有。有上是有上。无上是无上。由此彼说。识有境故有去来者。亦不成因。又彼所言。业有果故有去来者。理亦不然。非经部师作如是说。即过去业能生当果。然业为先所引相续。转变差别令当果生。彼我品中当广显示。若执实有过去未来则一切时果体常有业于彼果有何功能。若谓能生则所生果本无今有其理自成。若一切法一切时有。谁于谁有能生功能。又应显成雨众外道所党邪论。彼作是说。有必常有。无必常无。无必不生。有必不灭。若谓能令果成现在如何令果成现在耶。若谓引令至余方所则所引果其体应常。又无色法当如何引。又此所引应体本无。若谓但令体有差别。本无今有其理自成。是故此说一切有部。若说实有过去未来。于圣教中非为善说。若欲善说一切有者。应如契经所说而说。经如何说。如契经言。梵志当知。一切有者。唯十二处或唯三世。如其所有而说有言。若去来无如何可说有能所系及离系耶。彼所生因随眠有故。说有去来能系<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。缘彼烦恼随眠有故。说有去来所系缚事。若随眠断得离系名。毗婆沙师作如是说。如现实有过去未来。所有于中不能通释。诸自爱者应如是知。法性甚深非寻思境。岂不能释便拨为无。有异门故此生此灭。谓色等生即色等灭。有异门故异生异灭。谓未来生现在世灭。有异门故即世名生。以正生时世所摄故。有异门故说世有生。未来世有多刹那故。傍论已了。今应思择。诸事已断彼离系耶。设事离系彼已断耶。若事离系彼必已断。有事已断而非离系。断非离系其事云何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十一卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十一卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别随眠品第五之三</p><p>如是已辩随眠并缠。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说为漏瀑流等。为唯尔所。为复有余。颂曰</p><p>由结等差别复说有五种</p><p>论曰。即诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>结缚随眠随烦恼缠义差别故。复说五种。且结云何。颂曰</p><p>结九物取等立见取二结</p><p>由二唯不善及<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>起故</p><p>缠中唯嫉悭建立为二结</p><p>或二数行故为贱贫因故</p><p>遍显随惑故恼乱二部故</p><p>论曰。结有九种。一爱结。二恚结。三慢结。四无明结。五见结。六取结。七疑结。八嫉结。九悭结。此中爱结谓<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>贪。余随所应当辩其相。见结谓三见。取结谓二取。依如是理故。有说言。颇有见相应法为爱结系非见结系。非不有见随眠随增。曰有。云何。集智已生灭智未生见灭道所断二取相应法。彼为爱结为所缘系非见结系。遍行见结已永断故。非遍见结所缘相应二俱无故。然彼有见随眠随增。二取见随眠于彼随增故。何缘三见别立见结二取别立为取结耶。三见二取物取等故。谓彼三见有十八物。二取亦然。故名物等。三等所取。二等能取。故名取等。所取能取有差别故立为二结。何故缠中嫉悭二种建立为结非余缠耶。二唯不善自在起故。谓唯此二两义具足。余皆不然。故唯立二。若缠唯八此释可然。许有十缠此释非理。以忿覆二种亦具两义故。由此若许具有十缠。应言嫉悭过失尤重。谓此二种数现行故。又二能为贱贪因故。遍显戚欢随烦恼故。恼乱<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>在家部故。或恼乱天阿素洛故。或恼人天二胜趣故。或恼乱他及自部故。佛于余处依差别门。即以结声说有五种。颂曰</p><p>又五顺下分由二不超欲</p><p>由三复还下摄门根故三</p><p>或不欲发趣迷道及疑道</p><p>能障趣<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>故唯说断三</p><p>论曰。何等为五。谓有身见戒禁取疑欲贪嗔恚。何缘此五名顺下分。此五顺益下分界故。谓唯欲界得下分名。此五于彼能为顺益。由后二种不能超欲界。设有能超由前三还下。如守狱卒防逻人故。有余师说。言下分者。谓下有情即诸异生。及下界即欲界。前三能障超下有情。后二能令不超下界。故五皆得顺下分名。诸得预流六烦恼断。何缘但说断三结耶。理实应言断六烦恼。摄门根故但说断三。谓所断中类有三种。唯一通二通四部故。说断三种摄彼三门。又所断中三随三转。谓边执见随身见转。见取随戒取转。邪见随疑转。说断三种摄彼<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>。故说断三已说断六。有作是释。凡趣异方有三种障。一不欲发。二迷正道。依邪道故。三疑正道。趣解脱者亦有如斯相似三障。谓由身见怖畏解脱不欲发趣。由戒禁取依执邪道迷失正路。由疑于道深怀犹预。佛显预流永断如是趣解脱障故说断三。佛于余经如顺下分。说顺上分亦有五种。颂曰</p><p>顺上分亦五色无色二贪</p><p>掉举慢无明令不超上故</p><p>论曰。如是五种若未断时。能令有情不超上界。顺益上界故名顺上分结。已辩结。缚云何。颂曰</p><p>缚三由三受</p><p>论曰。缚有三种。一贪缚。谓一切贪。二嗔缚。谓一切嗔。三痴缚。谓一切痴。何缘唯说此三为缚。由随三受说缚有三。谓于乐受贪缚随增。所缘相应俱随增故。于苦受嗔。于舍受痴。应知亦尔。虽于舍受亦有贪嗔非如痴故。约自相续乐等三受为缚所缘作此定说。已分别缚。随眠云何。颂曰</p><p>随眠前已说</p><p>论曰。随眠有六。或七或十或九十八。如前已说。随眠既已说。随烦恼云何。颂曰</p><p>随烦恼此余染心所行蕴</p><p>论曰。此诸烦恼亦名随烦恼。以皆随心为恼乱事故。复有此余异诸烦恼染污心所行蕴所摄。随烦恼起故亦名随烦恼。不名烦恼非根本故。广列彼相如杂事中。后当略论缠烦恼垢摄者。且应先辩。缠相云何。颂曰</p><p>缠八无惭愧嫉悭并悔眠</p><p>及掉举惛沈或十加忿覆</p><p>无惭悭掉举皆从贪所生</p><p>无愧眠惛沈从无明所起</p><p>嫉忿从嗔起悔从疑覆诤</p><p>论曰。根本烦恼亦名为缠。经说欲贪缠为缘故。然品类足说有八缠。毗婆沙宗说缠有十。谓于前八更加忿覆。无惭无愧如前已释。嫉谓于他诸兴盛事令心不喜。悭谓财法巧施相违令心吝着。悔即恶作。如前已辩。眠谓令心昧略为性。无有功力执持于身。悔眠二缠唯取染污。掉举惛沈亦如前释。除嗔及害于情非情令心愤发说名为忿。隐藏自罪说名为覆。于此所说十种缠中无惭悭掉举是贪等流。无愧眠惛沈是无明等流。嫉忿是嗔等流。悔是疑等流。有说。覆是贪等流。有说。是无明等流。有说。是俱等流。有知无知如其次第。余烦恼垢其相云何。颂曰</p><p>烦恼垢六恼害恨谄诳憍</p><p>诳憍从贪生害恨从嗔起</p><p>恼从见取起谄从诸见生</p><p>论曰。恼谓坚执诸有罪事。由此不取如理谏悔。害谓于他能为逼迫。由此能行打骂等事。恨谓于忿所缘事中数数寻思结怨不舍。谄谓心曲。由此不能如实自显。或矫非拨。或设方便令解不明。诳谓惑他。憍前已释。如是六种从烦恼生。秽污相粗名烦恼垢。于此六种烦恼垢中。诳憍是贪等流。害恨是嗔等流。恼是见取等流。谄是诸见等流。如言何曲谓诸恶见。故谄定是诸见等流。此垢并缠从烦恼起。是故皆立随烦恼名。此垢及缠为何所断。颂曰</p><p>缠无惭愧眠惛掉见修断</p><p>余及烦恼垢自在故唯修</p><p>论曰。且十缠中无惭等五通见修断。由此通与二部烦恼相应起故。随与见此谛所断相应。即说名为见此谛所断。余嫉悭悔忿覆并垢自在起故唯修所断。唯与修断他力无明共相应故名自在起。此随烦恼谁通何性。颂曰</p><p>欲三二余恶上界皆无记</p><p>论曰。欲界所系眠惛掉三皆通不善无记二性所余一切皆唯不善。上二界中随应所有一切唯是无记性摄。此随烦恼谁何界系。颂曰</p><p>谄诳欲初定三三界余欲</p><p>论曰。谄诳唯在欲界初定。宁知梵世有谄诳耶。以大梵王匿己情事。现相诳惑马胜苾刍。此二于前虽已分别义相应故今复重辩。惛掉憍三通在三界。所余一切皆唯在欲。谓十六中五如前辩。所余十一唯欲界系。已辩随眠及随烦恼。于中有几唯在意地。有几通依六识地起。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十二卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十二卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别贤圣品第六之一</p><p>如是已说<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>等断于九胜位得遍知名。然断必由道力故得。此所由道其相云何。颂曰</p><p>已说烦恼断由见谛修故</p><p>见道唯无漏<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>通二种</p><p>论曰。前已广说诸烦恼断由见谛道及修道故。道唯无漏亦有漏耶。见道应知唯是无漏。修道通二。所以者何。见道速能治<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>故。顿断九品见所断故。非<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>道有此堪能。故见位中道唯无漏。修道有异故通二种。如向所言。由见谛故。此所见谛其相云何。颂曰</p><p>谛四先已说谓苦集灭道</p><p>彼自体亦然次第随现观</p><p>论曰。谛有四种。名先已说。于何处说。谓初品中分别有漏无漏法处。彼如何说。谓彼颂言。无漏谓圣道。此说道谛。择灭谓离系。此说灭谛。及苦集世间。此说苦集谛。<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>次第如彼说耶。不尔。云何。如今所列。一苦二集三灭四道。四谛自体亦有异耶。不尔。云何。如先所辩。为显体同彼故说亦然声。四谛何缘如是次第。随现观位先后而说。谓现观中先所观者便在先说。若异此者应先说因后方说果。然或有法说次随生。如念住等。或复有法说次随便。如正胜等。谓此中无决定理趣起。如是欲先断已生后遮未生。但随言便。今说四谛随瑜伽师现观位中先后次第。何缘现观次第必然。加行位中如是观故。何缘加行必如是观。谓若有法是爱着处能作逼恼。为求脱因。此法理应最初观察。故<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>者加行位中最初观苦。苦即苦谛。次复观苦以谁为因。便观苦因。因即集谛。次复观苦以谁为灭。便观苦灭。灭即灭谛。后观苦灭以谁为道。便观灭道。道即道谛。如见病已次寻病因。续思病愈后求良药。契经亦说谛次第喻。何契经说。谓良医经。如彼经言。夫医王者。谓具<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>能拔毒箭。一善知病状。二善知病因。三善知病愈。四善知良药。如来亦尔为大医王如实了知苦集灭道。故加行位如是次观。现观位中次第亦尔。由加行力所引发故。如已观地纵马奔驰。此现观名为目何义。应知此目现等觉义。何缘说此唯是无漏。对向<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>正觉境故。此觉真净故得正名。应知此中果性取蕴名为苦谛。因性取蕴名为集谛。是能集故。由此苦集<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>性分。名虽有殊非物有异。灭道二谛物亦有殊。何义经中说为圣谛。是圣者谛故得圣名。于非圣者此岂成妄。于一切是谛性无颠倒故。然唯圣者实见非余。是故经中但名圣谛。非非圣谛颠倒见故。如有颂言。圣者说是乐。非圣说为苦。圣者说为苦。非圣说是乐</p><p>有余师说。二唯圣谛。余二通是圣非圣谛。唯受一分是苦自体。所余并非。如何可言诸有漏行皆是苦谛。颂曰</p><p>苦由三苦合如所应一切</p><p>可意非可意余有漏行法</p><p>论曰。有三苦性。一苦苦性。二行苦性。三坏苦性。诸有漏行如其所应与此三种苦性合故。皆是苦谛。亦无有失。此中可意有漏行法与坏苦合故名为苦。诸非可意有漏行法与苦苦合故名为苦。除此所余有漏行法与行苦合故名为苦。何谓为可意非可意余。谓乐等三受如其次第由三受力令顺乐受等诸有漏行得可意等名。所以者何。若诸乐受由坏成苦性。如契经言。诸乐受生时乐住时乐坏时苦。若诸苦受由体成苦性。如契经言。诸苦受生时苦住时苦。不苦不乐受由行成苦性。众缘造故。如契经言。若非常即是苦。如受顺受诸行亦然。有余师释。苦即苦性名苦苦性。如是乃至行即苦性名行苦性。应知此中说可意非可意为坏苦苦苦者。由不共故。理实一切行苦故苦。此唯圣者所能观见。故有颂言</p><p>如以一睫毛置掌人不觉</p><p>若置眼睛上为损及不安</p><p>愚夫如手掌不觉行苦睫</p><p>智者如眼睛缘极生厌怖</p><p>以诸愚夫于无间狱受剧苦蕴生苦怖心。不如众圣于有顶蕴。道谛亦应是行苦摄。有为性故。道谛非苦。违逆圣心是行苦相。非圣道起违逆圣心。由此能引众苦尽故。若观诸有为涅槃寂静者。亦由先见彼法是苦后观彼灭以为寂静故。有为言唯显有漏。若诸法中亦许有乐。何缘但说苦为圣谛。有一类释。由乐少故。如置绿豆乌豆聚中。以少从多名乌豆聚。谁有智者沥水浇痈有少乐生计痈为乐。有余于此以颂释言</p><p>能为苦因故能集众苦故</p><p>有苦希彼故说乐亦名苦</p><p>理实应言。圣者观察诸有及乐体皆是苦。以就行苦同一味故。由此立苦为谛非乐。如何亦观乐受为苦。由性非常违圣心故。如以苦相观色等时非彼苦相一如苦受。有谓。乐受是苦因故。诸圣亦观彼为苦者。此释非理。能为苦因是集行相。岂关于苦。又诸圣者生色无色。缘彼如何有苦想转。非彼诸蕴为苦受因。又经复说行苦何用。若由非常观乐为苦。非常苦观行相何别。生灭法故观为非常。违圣心故观之为苦。但见非常知违圣心故非常行相能引苦行相。有余部师作如是执。定无实乐受唯是苦。云何知然。由教理故。云何由教。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言。诸所有受无非是苦。又契经言。汝应以苦观于乐受。又契经言。于苦谓乐名为颠倒。云何由理。以诸乐因皆不定故。谓诸所有衣服饮食冷暖等事。诸有情类许为乐因。此若非时过量受用便能生苦。复成苦因不应乐因。于增盛位或虽平等但由非时便成苦因能生于苦。故知衣等本是苦因。苦增盛时其相方显。威仪易脱理亦应然。又治苦时方起乐觉。及苦易脱乐觉乃生。谓若未遭饥渴寒热疲欲等苦所逼迫时。不于乐因生于乐觉。故于对治重苦因中。愚夫妄计此能生乐。实无决定能生乐因。苦易脱中愚夫谓乐。如荷重担暂易肩等。故受唯苦。定无实乐。对法诸师言乐实有。此言应理。云何知然。且应反征拨无乐者何名为苦。若谓逼迫既有适悦有乐应成。若谓损害既有<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有乐应成。若谓非爱既有可爱有乐应成。若谓可爱体非成实。以诸圣者于离染时可爱复成非可爱故。不尔。可爱圣离染时。由异门观为非爱故。谓若有受自相可爱。此受未常成非可爱。然诸圣者于离染时。以余行相厌患此受。谓观此受是放逸处。要由广大功力所成变坏<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>故非可爱。非彼自相是非爱法。若彼自体是非可爱不应于中有起爱者。若不起爱于离染时圣者不应以余行相观察乐受深生厌患。故由自相有实乐受。然世尊言诸所有受无非苦者。佛自释通。如契经言。佛告庆喜。我依诸行皆是无常。及诸有为皆是变坏。密作是说。诸所有受无非是苦。故知此经不依苦苦作如是说。若由自相说受皆苦。何缘庆喜作是问言。佛于余经说有三受。谓乐及苦不苦不乐。依何密意此经复言诸所有受无非是苦。庆喜但应作如是问。依何密意说有三受。世尊亦应但作是答。我依此密意故说有三受。经中既无如是问答。故由自相实有三受。世尊既言我密意说诸所有受无非是苦。即已显示此所说经依别意说非真了义。又契经言。汝应以苦观乐受者。应知此经意显乐受有二种性。一有乐性。谓此乐受依自相门是可爱故。二有苦性。谓依异门亦是无常变坏法故。然观乐时能为系缚。诸有贪者啖此味故。若观苦时能令<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。如是观者得离贪故。佛以观苦能令解脱故。劝有情观乐为苦。如何知此自相是乐。如有颂言</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十三卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十三卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别贤圣品第六之二</p><p>如是已说入修二门。由此二门心便得定。心得定已复何所修。颂曰</p><p>依已修成止为观修念住</p><p>以自相共相观身受心法</p><p><a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>闻等慧余相杂所缘</p><p>说次第随生治倒故唯四</p><p>论曰。依已修成满胜奢摩他。为毗钵舍那修四念住。如何修习四念住耶。谓以自共相观身受心法。身受心法各别自性名为自相。一切有为皆非常性。一切有漏皆是苦性。及一切法空非我性名为共相。身自性者。大种造色。受心自性如自名显。法自性者。除三余法。传说。在定以极微<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。各别观身名身念住满。余三满相如应当知。何等名为四念住体。此四念住体各有三。自性相杂所缘别故。自性念住以慧为体。此慧有三种。谓闻等所成。即此亦名三种念住。相杂念住以慧所余俱有为体。所缘念住以慧所缘诸法为体。宁知自性是慧非余。经说。于身住循身观名身念住。余三亦然。诸循观名唯目慧体。非慧无有循观用故。何缘于慧立念住名。毗婆沙师说。此品念增故。是念力持慧得转义。如斧破木由楔力持。理实应言慧令念住。是故于慧立念住名。随慧所观能明记故。由此无灭作如是言。若有能于身住循身观。缘身念得住乃至广说。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>亦说。若有于身住循身观者念便住不谬。然有经言。此四念住由何故集。由何故灭。食触名色作意集故。如次令身受心法集。食触名色作意灭故。如次令身受心法灭。应知彼说所缘念住以念于彼得安住故。又念住别名随所缘缘自他俱相续异故。一一念住各有三种。此四念住说次随生。生复何缘次第如是。随境粗者应先观故。或诸欲贪于身处转。故四念住观身在初。然贪于身由欣乐受。欣乐于受由心不调。心之不调由惑未断。故观受等如是次第。此四念住如次治彼净乐常我四种颠倒。故唯有四不增不减。四中三种唯不杂缘。第四所缘通杂不杂。若唯观法名不杂缘。若于身等二三或四。总而观察名为杂缘。如是熟修杂缘身等法念住已。复何所修。颂曰</p><p>彼居法念住总观四所缘</p><p>修非常及苦空非我行相</p><p>论曰。彼观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。居缘总杂法念住中。总观所缘身等四境修四行相。所谓非常苦空非我。修此观已生何善根。颂曰</p><p>从此生暖法具观<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a></p><p>修十六行相次生顶亦然</p><p>如是二善根皆初法后四</p><p>次忍唯法念下中品同顶</p><p>上唯观欲苦一行一刹那</p><p>世第一亦然皆慧五除得</p><p>论曰。修习总缘共相法念住。渐次成熟乃至上上品。从此念住后。有顺决择分初善根生。名为暖法。此法如暖立暖法名。是能烧惑薪圣道火前相。如火前相故名为暖。此暖善根分位长故。能具观察四圣谛境。及能具修十六行相。观苦圣谛修四行相。一非常二苦三空四非我。观集圣谛修四行相。一因二集三生四缘。观灭圣谛修四行相。一灭二静三妙四离。观道圣谛修四行相。一道二如三行四出。此相差别如后当辩。此暖善根下中上品渐次增长至成满时有善根生。名为顶法。此转胜故更立异名。动善根中此法最胜如人顶故名为顶法。或由此是进退两际如山顶故。说名为顶。此亦如暖具观<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。及能具修十六行相。如是暖顶二种善根。初安足时唯法念住。以何义故名初安足。谓随何善根以十六行相最初游践四圣谛迹。后增进时具四念住。诸先所得后不现前。于彼不生钦重心故。此顶善根下中上品渐次增长至成满时有善根生名为忍法。于四谛理能忍可中此最胜故。又此位忍无退堕故名为忍法。此忍善根安足增进皆法念住。与前有别。然此忍法有下中上。下中二品与顶法同。谓具观察四圣谛境及能具修十六行相。上品有异。唯观欲苦与世第一相邻接故。由此义准。暖等善根皆能具缘<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>苦等义已成立。无简别故。谓瑜伽师于色无色对治道等一一圣谛行相所缘渐减渐略。乃至但有二念作意思惟欲界苦圣谛境。齐此以前名中忍位。从此位无间起胜善根一行一刹那名上品忍。此善根起不相续故。上品忍无间生世第一法。如上品忍缘欲苦谛修一行相唯一刹那。此有漏故名为<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。是最胜故名为第一。此有漏法世间中胜。是故名为世第一法。有士用力离同类因引圣道生。故名最胜。如是暖等四种善根。念住性故。皆慧为体。若并助伴皆<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>性。然除彼得勿诸圣者暖等善根重现前故。此中暖法初安足时。缘三谛法念住现在。修未来四。随一行相现在。修未来四。缘灭谛法念住现在。修未来一。随一行相现在。修未来四。由此种性先未曾得。要同分者方能修故。后增进时缘三谛。随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法念住现在。修未来四。随一行相现在。修未来十六。由此种性先已曾得。不同分者亦能修故。顶初安足缘四谛法念住现在。修未来四。随一行相现在。修未来十六。后增进时缘三谛随一念住现在。修未来四。随一行相现在。修未来十六。缘灭谛法念住现在。修未来四。随一行相现在。修未来十六。忍初安足及后增进。缘四谛法念住现在。修未来四。随一行相现在。修未来十六。然于增进略所缘时。随略彼所缘不修彼行相。世第一法缘欲苦谛法念住现在。修未来四。随一行相现在。修未来四。无异分故。似见道故。已辩所生善根相体。今次应辩此差别义。颂曰</p><p>此顺决择分四皆修所成</p><p>六地二或七依欲界身九</p><p>三女男得二第四女亦尔</p><p>圣由失地舍异生由命终</p><p>初二亦退舍依本必见谛</p><p>舍已得非先二舍性非得</p><p>论曰。此暖顶忍世第一法。四殊胜善根名顺决择分。依何义建立顺决择分名。决谓决断。择谓简择。决断简择谓诸圣道。以诸圣道能断疑故。及能分别四谛相故。分谓分段。此言意显所顺唯是见道一分。决择之分故得决择分名。此四为缘引决择分。顺益彼故得顺彼名故。此名为顺决择分。如是四种皆修所成。非闻思所成。唯等引地故。四中前二是下品摄。以俱可动犹可退故。忍中品摄。胜前二故。有世第一为其上故。世第一法独是上品。此四善根皆依六地。谓四静虑未至中间。欲界中无。阙等引故。余上地亦无。见道眷属故。又<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>心不缘欲界故。欲界先应遍知断故。此四善根能感<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>五蕴异熟为<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>因。不能牵引。憎背有故。或声为显二有异说。谓暖顶二。尊者妙音说。依前六及欲七地。此四善根依欲身起。人天九处除北俱卢。前三善根三洲初起。后生天处亦续现前。第四善根天处亦起。此无初后一刹那故。此四善根唯依男女。前三男女俱通得二。第四女身亦得二种。依男唯得男身善根。已得女身非择灭故。圣依此地得此善根。失此地时善根方舍。失地言显迁生上地。异生于地若失不失。但失众同分。必舍此善根。初二善根亦由退舍。由死退舍唯异生非圣。由失地舍唯圣非异生。忍及世第一异生亦无退。依根本地起暖等善根。彼于此生必定得见谛。厌<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>心极猛利故。若先舍已后重得时。所得必非先之所舍。如舍已重得别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a><a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。以未曾熟修大功用成故。若先已得暖等善根经生故舍。遇了分位善<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>师便生顶等。若不遇者还从本修。失退二舍非得为性。退必起过。失不必然。得此善根有何胜利。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十四卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十四卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别贤圣品第六之三</p><p>已辩住果未断修惑名为预流生极七返。今次应辩断位众圣。且应建立一来向果。颂曰</p><p>断欲三四品三二生家家</p><p>断至五二向断六一来果</p><p>论曰。即预流者进断修惑。若三缘具转名家家。一由断惑。断欲修断三四品故。二由成根。得能治彼无漏根故。三由受生。更受欲有三二生故。颂中但说初后缘者。预流果后说进断惑。成能治彼诸无漏根。义准已成。故不具说。然复应说三二生者。以有增进于所受生。或少或无或过此故。何缘此无断五品者。以断第五必断第六。非一品惑能障得果。犹如一间未越界故。应知总有二种家家。一天家家。谓欲天趣生三二家而证圆寂。或一天处或二或三。二人家家。谓于人趣生三二家而证圆寂。或一洲处或二或三。即预流者。进断欲界一品修惑乃至五品。应知转名一来果向。若断第六成一来果。彼往天上一来人间而般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>名一来果。过此以后更无生故。此或名曰薄贪嗔痴。唯余下品贪嗔痴故。已辩一来向果差别。次应建立不还向果。颂曰</p><p>断七或八品一生名一间</p><p>此即第三向断九不还果</p><p>论曰。即一来者进断余惑。若三缘具转名一间。一由断惑。断欲修断七八品故。二由成根。得能治彼无漏根故。三由受生。更受欲有余一生故。颂中但说初后二缘不说成根。义如前释。如何一品惑障得不还果。由彼若断便越界故。前说三时业极为障。应知<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>亦与业同。越彼等流异熟地故。间谓间隔。彼余一生为间隔故。不证圆寂。或余一品欲修所断惑为间隔故。不得不还果。有一间者说名一间。即断修惑七八品者。应知亦名不还果向。先断三四七八品惑入见谛者。后得果时乃至未修后胜果道。仍不名曰家家一间。未成治彼无漏根故。若断第九成不还果。必不还来生欲界故。此惑名曰五下结断。虽必先断或二或三。然于此时总集断故。依不还位。诸契经中以种种门建立差别。今次应辩彼差别相。颂曰</p><p>此中生有行无行般涅槃</p><p>上流若杂修能往色究竟</p><p>超半超遍殁余能往有顶</p><p>行无色有四住此般涅槃</p><p>论曰。此不还者总说有七。且行<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>差别有五。一中般涅槃。二生般涅槃。三有行般涅槃。四无行般涅槃。五者上流。此于中间般涅槃故。说此名曰中般涅槃。如是应知。此于生已此由有行此由无行。般涅槃故名生般等。此上流故名为上流。言中般者。谓往色界住中有位便般涅槃。言生般者。谓往色界生已不久便般涅槃。以具勤修速进道故。此中所说般涅槃者。谓有余依。有余师说。亦无余依。此不应理。彼于舍寿无<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。有行般者。谓往色界生已长时加行不息。由有功用方般涅槃。此唯有勤修无速进道故。无行般者。谓往色界生已经久加行懈息不多功用便般涅槃。以阙勤修速进道故。有说。此二有差别者由缘有为无为圣道。如其次第得涅槃故。此说非理。太过失故。然契经中先说无行。后说有行般涅槃者。如是次第与理相应。有速进道。无速进道。无行有行而成办故。不由功用得。由功用得故。生般涅槃得最速进最上品道。随眠最劣故生不久便般涅槃。言上流者是上行义。以流与行其义一故。谓欲界殁往色界生。未即于中能证圆寂。要<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>上方般涅槃。即此上流差别有二。由因及果有差别故。因差别者。此于静虑由有杂修无杂修故。果差别者。色究竟天及有顶天为极处故。谓若于静虑有杂修者。能往色究竟方般涅槃。即此复有三种差别。全超半超遍殁异故。言全超者。谓在欲界于四静虑已具杂修。遇缘退失上三静虑。以初静虑爱味为缘。命终上生梵众天处。由于先世串习势力。复能杂修第四静虑。从彼处殁生色究竟。最初处殁生最后天。顿越中间是全超义。言半超者。从彼渐次生下净居乃至中间能越一处生色究竟。超非全故名为半超。圣必不生大梵天处。僻见处故。一导师故。言遍殁者。从彼渐次于一切处皆遍受生。最后方能生色究竟。一切处死故名遍殁。无不还者于已生处受第二生。由彼于生容求胜进。非等劣故。即由此故不还义满。必不还生曾生处故。尚不生本处。况有生于下。应知此谓二上流中由有杂修静虑因故往色究竟般涅槃者。余于静虑无杂修者。能往有顶方般涅槃。谓彼先无杂修静虑。由于诸定爱味为缘。此殁遍生色界诸处。唯不能往五净居天。色界命终于三无色次第生已。后生有顶方般涅槃。二上流中前是观行后是止行。乐慧乐定有差别故。二上流者于下地中得般涅槃见不违理。而言此往色究竟天及有顶天为极处者。由此过彼无行处故。如预流者极七返生。此五名为行色界者。行无色者差别有四。谓在欲界离色界贪从此命终生于无色。此中差别唯有四种。由生般涅槃有差别故。此并前五成六不还。复有不行色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>即住于此能般涅槃名现般涅槃。并前六为七。于行色界五不还中复有异门。显其差别。颂曰</p><p>行色界有九谓三各分三</p><p>业惑根有殊故成三九别</p><p>论曰。即行色界五种不还总立为三。各分三种故成九种。何等为三。中生上流有差别故。云何三种各分为三。且中般涅槃分为三种。速非速经久得般涅槃。由三火星喻所显故。生般涅槃亦分三种。生有行等般涅槃故。此皆生已得般涅槃。是故并应名为生般。于上流中亦分三种。超半超等有差别故。然诸三种一切皆由速非速经久得般涅槃故。更互相望无杂乱失。如是三种九种不还。由业惑根有差别故。有速非速经久不同。且总成三。由造增长顺起生后业差别故。如其次第下中上品烦恼现行有差别故。及上中下根差别故。此三一一如其所应亦业惑根有差别故。各有三别故成九种。谓初二三由惑根别各成三种。非由业异。后三亦由顺后受业有差别故。分成三种。故说如是行色不还业惑根殊成三九别。若尔何故诸契经中。佛唯说有七善士趣。颂曰</p><p>立七善士趣由上流无别</p><p><a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>行不行有往无还故</p><p>论曰。中生各三。上流为一。经依此立七善士趣。有上流法故名上流。由此义同且立为一。何独依此立善士趣。不依所余有学圣者。趣是行义。所余有学皆<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>业无差别故。唯此七种皆行善业不行恶业。余则不然。又唯七种行往上界不复还来。余则不尔。故独依此立善士趣。若尔何故契经中言。云何善士谓若成就有学<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。乃至广说。诸余有学若就异门亦可说为有善士性。以诸有学于五种恶皆获得毕竟不作<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>故。不善烦恼多已断故。立善士趣不就异门约唯行善不行恶故。唯托胜因往上界故。诸在圣位曾经生者。亦有此等差别相耶。不尔。云何。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十五卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十五卷</p><p>　　尊者世亲造</p><p>　　<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>　　分别贤圣品第六之四</p><p>　　如前所说。不动应果。初尽智后起无生智。诸阿罗汉如预流等有差别不。亦有。云何。颂曰</p><p>　　阿罗汉有六谓退至不动</p><p>　　前五信解生总名时<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a></p><p>　　后不时解脱从前见至生</p><p>　　论曰。于契经中说阿罗汉由种性异故有六种。一者退法二者思法。三者<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。四安住法。五堪达法。六不动法。于此六中前之五种从先学位信解性生。即此总名时爱心解脱。恒时爱护及心解脱故。亦说名为时解脱者以要待时及解脱故。略初言故。如言酥瓶。由此待时方能入定。谓待资具无病处等胜缘合时方入定故。不动法性说名为后。即此名为不动心解脱。以无退动及心解脱故。亦说名为不时解脱。以不待时及解脱故。谓三摩地随欲现前不待胜缘和合时故。或依暂时毕竟解脱。建立时解脱不时解脱名。容有退堕时无退堕时故。此从学位见至性生。如是所明六阿罗汉所有种性。为是先有。为后方得。不定。云何。颂曰</p><p>　　有是先种性有后练根得</p><p>　　论曰。退法种性必是先有。思法等五亦有后得。谓有先来是思法性。有先退法性后练根成思。乃至不动随应当说。言退法者。谓遇少缘便退所得。非思法等。言思法者。谓惧退失恒思自害。言护法者。谓于所得喜自防护。安住法者。离胜退缘虽不自防亦能不退。离胜加行亦不增进。堪达法者。彼性堪能好修练根速达不动。不动法者。彼必无退。此六种性先学位中。初二阙恒时及尊重加行。由根有异故有差别。第三唯有恒时加行。第四唯有尊重加行。第五具二而是钝根。第六利根具二加行。退法种性非必定退。乃至堪达非必能达。但约容有建立此名。故六阿罗汉通<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>皆有。若执退者必定应退。乃至堪达必能达者。彼执欲界具足有六。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中唯安住不动。彼无退失自害自防及修练根故唯有二。如是六种阿罗汉中。谁从何退。为性为果。颂曰</p><p>　　四从种性退五从果非先</p><p>　　论曰。不动种性必无退理。前之五种皆有退义。于中后四有从性退。退法一种无退性理。由此种性最居下故。五种皆有从果退义。虽俱有退然并非先。谓诸无学先学位中所住种性。彼从此性必无退理。学无学道所成坚故。若诸有学先凡位中所住种性。彼从此性亦无退理。世出世道所成坚故。若住此位后修练根所得思等四种种性。彼从此性容有退理。二先位中住思等性必亦无退此所得果。唯先退法有退果义。又亦无退先所得果。后所得果容有退义。是故定无退预流果。由此应果退法有三。一增进根。二退住学。三住自位而般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。思法有四。三如前说。更加一种退住退性。余三如次有五六七。应知后后一一增故。思法等四退住学位时。还住退非余。若异此者得胜种性故。应是进非退。何缘定无退先果者。以见所断依无事故。谓有身见依我处转。见所断惑此见为根。我体既无名依无事。以无事故必无退理。若尔应说此惑缘无。非此缘无谛为境故。然于谛境不如实缘。诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>中谁不如是。虽皆如是而有差别。以修断惑各有别事。即是可意不可意等于所缘境此相非无。见所断惑计有我等。非诸谛境有我等相。以无事故。与修断别。谓于色等所缘境中我见妄增。作者受者<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>而转。非实我性。边执见等随此而生。故并说为依无事惑。若修所断贪嗔慢痴。色等境中唯起染着增背高举不了行转故。并说为依有事惑。又见断惑于谛理中执我我所断常见等。非谛中有少我等事。见断贪等缘此而生。是故皆名依无事惑。修所断惑于色等中谓好丑等。然色等境非无少分好丑等别。是故可名依有事惑。又见断惑迷谛理起名依无事。修所断惑迷粗事生名依有事。谛理真实。揩定可依。圣慧已证必无退理。事相浮伪无定可依。断迷彼惑。有失念退。或修断惑非审虑生。昧钝性故。见所断惑由审虑生。推度性故。圣不审虑于粗事中失念或生。审虑不尔。如于绳等率尔谓蛇。故修断惑圣有退起。非由率尔可起见惑。圣若审虑便见谛理。故圣见断定无退义。经部师说。从阿罗汉亦无退义。彼说应理。云何知然。由教理故。知何由教。经言。苾刍圣慧断惑名为实断。又契经言。我说有学应不放逸。非阿罗汉。虽有经言佛告庆喜。我说。利养等亦障阿罗汉而不说退阿罗汉果。但说退失现法乐住。经言不动心解脱身作证。我定说无<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>从此退故。若谓有退。由经说有时爱解脱。我亦许然。但应观察彼之所退。为应果性。为静虑等。然彼根本静虑等持。要待时现前故名时解脱。彼为获得现法乐住数希现前故名为爱。有说。此定是所爱味。诸阿罗汉果性解脱恒随逐故不应名时。更不欣求故不名爱若应果性容有退者。如何<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>但说所证现法乐住有可退理。由此证知。诸阿罗汉果性解脱必是不动。然由利等扰乱过失有于所得现法乐住退去自在。谓诸钝根。若诸利根则无退失。故于所得现法乐住有退无退故名退不退法。如是思等如理应思。不退安住不动何别。非练根得名为不退。练根所得名为不动。此二所起殊胜等至。设遇退缘亦无退理。安住法者。但于已住诸胜德中能无退失。不能更引余胜德生。设复引生从彼可退。是不退等三种差别。然乔底迦昔在学位。于时解脱极啖味故。又钝根故数数退失。深自厌责执刀自害。由于身命无所恋惜。临命终时得阿罗汉便般涅槃。故乔底迦亦非退失阿罗汉果。又增十经作如是说。一法应起。谓时爱心解脱。一法应证。谓不动心解脱。若应果性名为时爱心解脱者。何故于此增十经中再说应果。又曾无处说阿罗汉果名为应起。但说名应证。又说钝根所摄应果名为应起。为显何义。若为显彼能起现前则余利根最应能起。若为显彼应起现前亦余利根最所应起。故时解脱非应果性。若尔何故说时解脱应果。谓有应果根性钝故要待时故定方现前。若与彼相违名不时解脱。阿毗达磨亦作是言。欲贪随眠由三处起。一欲贪随眠未断遍知故。二顺彼经法正现在前故。三于彼正起非理作意故。若谓彼据具因生说。复有何法因不具生。是名由教。如何由理。若阿罗汉有令烦恼毕竟不起治道已生。是则不应退起烦恼。若阿罗汉此道未生。未能永拔烦恼种故应非漏尽。若非漏尽宁说为应。是名由理。若尔应释炭喻契经。如说。多闻诸圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>若行若住有处有时失念故生恶不善觉。此经唯说阿罗汉果。由此经言彼圣弟子心于长夜随顺远离广说乃至临入涅槃。余契经中。有即说此顺远离等名应果力。又此经说。彼于一切顺漏已能永吐已得清凉。由此定知。是阿罗汉。实后所说是阿罗汉。然彼乃至于行住时未善通达容有此事。谓有学者于行住时由失念故容起烦恼。后成无学则无起义。前依学位故说无失。毗婆沙师定作是说。阿罗汉果亦有退义。唯阿罗汉种性有六。为余亦有六种性耶。设有皆能修练根不。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十六卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十六卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别智品第七之一</p><p>前品初说诸忍诸智。于后复说<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>正智。为有忍非智耶。为有智非见耶。颂曰</p><p>圣慧忍非智尽无生非见</p><p>余二有漏慧皆智六见性</p><p>论曰。慧有二种。有漏无漏。唯无漏慧立以圣名。此圣慧中八忍非智性。自所断疑未已断故。可见性摄。推度性故。尽与无生二智。非见性。已息求心不推度故。所余皆通智见二性。已断自疑推度性故。诸有漏慧皆智性摄。于中唯六亦是见性。谓五染污见世正见为六。如是所说圣有漏慧皆择法故并慧性摄。智有几种。相别云何。颂曰</p><p>智十总有二有漏无漏别</p><p>有漏称世俗无漏名法类</p><p>世俗遍为境法智及类智</p><p>如次欲上界苦等谛为境</p><p>论曰。智有十种摄一切智。一世俗智。二法智。三类智。四苦智。五集智。六灭智。七道智。八他心智。九尽智。十无生智。如是十智总唯二种。有漏无漏性差别故。如是二智相别有三。谓世俗智法智类智。前有漏智总名世俗。多取瓶等世俗境故。后无漏智分法类别。三中世俗遍以一切有为无为为所缘境。法类二种如其次第以欲上界<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>为境。即于如是二种智中。颂曰</p><p>法类由境别立苦等四名</p><p>皆通尽无生初唯苦集类</p><p>论曰。法智类智由境差别分为苦集灭道四智。如是六智若无学摄。非见性者名尽无生。此二初生唯苦集类。以缘苦集六种行相观有顶蕴为境界故。金刚喻定境同此耶。缘苦集因。缘灭道异。于前所说九种智中颂曰</p><p>法类道世俗有成他心智</p><p>于胜地根位去来世不知</p><p>法类不相知声闻麟喻佛</p><p>如次知见道二三念一切</p><p>论曰。有法类道及世俗智成他心智。余则不然。此智于境有决定相。谓不知胜及去来心。胜心有三。谓地根位。地谓下地智不知上地心。根谓信解时<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>根智不知见至不时解脱心。位谓不还声闻应果独觉大觉。前前位智不知后后胜位者心。此智不知去来心者。唯以现在他相续中能缘心等为境界故。又法类品不互相知。谓法智摄诸他心智不知类品。类智所摄诸他心智不知法品。由法类智以欲上界全分对治为所缘故。此他心智见道中无。总观谛理极速转故。然皆容作此智所缘。若诸有情将入见道。声闻独觉预修加行。为欲知彼见道位心。彼诸有情入见道位。声闻法分加行若满知彼见道初二念心。若为更知类分心故别修加行。至加行满彼已度至第十六心。虽知此心非知见道。麟喻法分加行若满知彼见道初二念心。若为更知类分心故。别修加行。至加行满知彼第八集类智心。以此但由下加行故。有说。知初二及第十五心。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>欲知不由加行。于彼见道一切能知。尽无生智二相何别。颂曰</p><p>智于<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>知我已知等</p><p>不应更知等如次尽无生</p><p>论曰。如本论说。云何尽智。谓无学位若正自知我已知苦。我已断集。我已证灭。我已<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。由此所有智见明觉解慧光观是名尽智。云何无生智。谓正自知我已知苦不应更知。广说乃至。我已修道不应更修。由此所有广说乃至。是名无生智。如何无漏智。可作如是知。迦湿弥罗诸论师说。从二智出后得智中作如是知故无有失。由此后得二智别故。表前观中二智差别。有说。无漏智亦作如是知。然说见言乘言便故。或于谛理现照转故。由此本论亦作是言。且诸智亦是见。如是十智相摄云何。谓世俗智摄一全一少分。法类智各摄一全七少分。苦集灭智各摄一全四少分。道智摄一全五少分。他心智摄一全四少分。尽无生智各摄一全六少分。何缘二智建立为十。颂曰</p><p>由<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>对治行相行相境</p><p>加行办因圆故建立十智</p><p>论曰。由七缘故立二为十。一自性故立世俗智。非胜义智为自性故。二对治故立法类智。全能对治欲上界故。三行相故立苦集智。此二智境体无别故。四行相境故立灭道智。此二行相境俱有别故。五加行故立他心智。非此不知他心所法。本修加行为知他心。虽成满时亦知心所。而约加行故立他心智名。六事办故建立尽智。事办身中最初生故。七因圆故立无生智。一切圣道为因生故。如上所言。法智类智。全能对治欲上界法。为有少分治上欲耶。颂曰</p><p>缘灭道法智于修道位中</p><p>兼治上修断类无能治欲</p><p>论曰。修道所摄灭道法智。兼能对治上界修断。欲之灭道胜上界故。已除自怨能兼他故。由此类智无能治欲。于此十智中谁有何行相。颂曰</p><p>法智及类智行相俱十六</p><p>世俗此及余四谛智各四</p><p>他心智无漏唯四谓缘道</p><p>有漏自相缘俱但缘一事</p><p>尽无生十四谓离空非我</p><p>论曰。法智类智。一一具有非常苦等十六行相。十六行相后当广释。世智有此及更有余能缘一切法自共相等故。苦等四智。一一各有缘自谛境四种行相。他心智中。若无漏者唯有缘道四种行相。由此即是道智摄故。若有漏者取自所缘心心所法自相境故。如境自相行相亦尔。故此非前十六所摄。如是二种于一切时一念但缘一事为境。谓缘心时不缘心所。缘受等时不缘想等。若尔何故薄伽梵说如实了知有贪心等。非俱时取贪等及心。如不俱时取衣及垢。有贪心者。二义有贪。一贪相应。二贪所系。贪相应心具由二义。余有漏心唯贪所系。有说。经言有贪心者。唯说第一贪相应心。离贪心者。谓治贪心。若贪不相应名离贪心者。余惑相应者应得离贪名。若尔有心非贪对治不染污性。应许此心非有贪心离贪心等。是故应许余师所说。为贪所系名有贪心。乃至有痴离痴亦尔。毗婆沙师作如是说。聚心者谓<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。此于所缘不驰散故。散心者谓染心。此与散动相应起故。西方诸师作如是说。眠相应者名为聚心。余染污心说名为散。此不应理。诸染污心若与眠相应。应通聚散故。又应违害本论所言。如实知聚心。具足有四智。谓法智类智世俗智道智。沉心者谓染心。此与<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>相应起故。策心者谓善心。此与正勤相应起故。小心者谓染心。少净品者所好习故。大心者谓善心。多净品者所好习故。或由根价眷属随转力用少多故名小大。染心根少。极二相应故。善心根多。恒三相应故。染心价少。非功用成故。善心价多。大资粮成故。染心眷属少。无未来修故。善心眷属多。有未来修故。染心随转少。唯三蕴故。善心随转多。通四蕴故。染心力用少。所断善根必还续故。善心力用多。忍必永断诸随眠故。由此染善得小大名。掉心者谓染心。掉举相应故。不掉心者谓善心。能治彼故。不静静心应知亦尔。不定心者谓染心。散动相应故。定心者谓善心。能治彼故。不修心者谓染心。得修习修俱不摄故。修心者谓善心。容有二修故。不解脱心者谓染心。自性相续不解脱故。解脱心者谓善心。自性相续容解脱故。如是所释不顺契经。亦不能辩诸句别义。如何此释不顺契经。经言。此心云何内聚。谓心若与惛眠俱行。或内相应有止无观。云何外散。谓心游涉五妙欲境随散随流。或内相应有观无止。岂不前说。染心眠俱便有一心通聚散过。虽说非理。不许眠俱诸染污心是散心故。岂不又说本论相违。宁违论文勿违经说。如何不辩诸句别义。谓依此释不能辩了散等聚等八异相故。依我所释非不能辩此契经中八句别义。谓虽散等同是染心。而为显其过失差别。及虽聚等同是善心。而为显其<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>差别。故依八义别立八名。既不能通所违经说。所辩句义理亦不成。又若沉心即掉心者。经不应说若于尔时心沈。恐沈修安定舍三觉支者名非时修。若于尔时心掉。恐掉修择进喜名非时修。岂修觉支有散别理。此据作意欲修名修。非现前修故无有失。岂不我说亦不违经。虽诸染心皆名沉掉懈怠增者经说沉心。掉举增者经说掉心。据恒相应我说体一。随自意语谁复能遮。然实此经意不如是。前说。一切贪所系心。皆名有贪心。贪系是何义。若贪得随故。有学无漏心应名有贪。贪得随故。若贪所缘故。无学有漏心应名有贪。贪所缘故。若不许彼为贪所缘。云何彼心可成有漏。若谓由为共相惑缘应名有痴。痴所缘故。然他心智不缘贪得。亦不可说缘缘心贪。宁知他心是有贪等。故非贪系名有贪心。若尔云何。今详经意贪相应故名有贪心。贪不相应名离贪等。若尔何故余契经言。离贪嗔痴心不还堕三有。依离得说故无有过。岂不于前已破此说。余惑相应者。应得离贪名。彼亦与贪不相应故。若依此意。许亦无违。然不说为离贪心者。彼属有嗔有痴等故。且止傍论应述本宗。此所明他心智。为亦能取他心所缘。及亦取他心能缘行相不。俱不能取。知彼心时。不观彼所缘能缘行相故。谓但知彼有染等心。不知彼心所染色等。亦不知彼能缘行相。不尔他心智应亦缘色等。又亦应有能自缘失。诸他心智有决定相。谓唯能取欲<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>系及非所系。他相续中现在同类心心所法。一实自相为所缘境。空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>不相应。尽无生所不摄。不在见道无间道中。余所不遮如应容有。尽无生智除空非我。各具有余十四行相。由此二智虽胜义摄而涉于世俗欲离空非我。谓由彼力于出观时作如是言。我生已尽梵行已立。所作已办不受后有。为有无漏越此十六更是所余行相摄不。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十七卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十七卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别智品第七之二</p><p>如是已辩诸智差别。智所成德今当显示。于中先辩佛不共德。且初<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>尽智位修不共<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>有十八种。何谓十八。颂曰</p><p>十八不共法谓佛十力等</p><p>论曰。佛十力四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>三念住及大悲。如是合名为十八不共法。唯于诸佛尽智时修。余圣所无故名不共。且佛十力相别云何。颂曰</p><p>力处非处十业八除灭道</p><p>定根解界九遍趣九或十</p><p>宿住死生俗尽六或十智</p><p>宿住死生智依静虑余通</p><p>赡部男<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>于境无碍故</p><p>论曰。佛十力者。一处非处智力。具以如来十智为性。二业异熟智力。八智为性。谓除灭道。三静虑<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>等持等至智力。四根上下智力。五种种胜解智力。六种种界智力。如是四力皆九智性。谓除灭智。七遍趣行智力。或声显此义有二途。若谓但缘能趣为境九智除灭。若谓亦缘所趣为境十智为性。八宿住随念智力。九死生智力。如是二力皆俗智性。十漏尽智力。或声亦显义有二途。若谓但缘漏尽为境六智。除道苦集他心。若谓漏尽身中所得十智为性。已辩<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。依地别者。第八第九依四静虑。余八通依十一地起。欲四静虑未至中间。并四无色名十一地。已辩依地。依身别者。皆依赡部男子佛身。已辩依身。何故名力。以于一切所知境中智无碍转故名为力。由此十力唯依佛身。唯佛已除诸惑习气于一切境随欲能知。余此相违故不名力。如<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>舍求度人不能观知鹰所逐鸽前后二际生多少等。如是诸佛遍于所知心力无边。云何身力。颂曰</p><p>身那罗延力或节节皆然</p><p>象等七十增此触处为性</p><p>论曰。佛生身力等那罗延。有余师言。佛身支节一一皆具那罗延力。大德法救说。诸如来身力无边。犹如心力。若异此者则诸佛身应不能持无边心力。大觉独觉及转轮王支节相连如其次第似龙蟠结连锁相钩。故三相望力有胜劣。那罗延力其量云何。十十倍增象等七力。谓凡象。香象。摩诃诺健那。钵罗塞建提。伐浪伽。遮怒罗。那罗延。后后力增前前十倍。有说。前六十十倍增敌那罗延半身之力。此力一倍成那罗延。于所说中唯多应理。如是身力触处为性。谓所触中大种差别。有说。是造触离七外别有佛四无畏相别云何。颂曰</p><p>四无畏如次初十二七力</p><p>论曰。佛四无畏如经广说。一正等觉无畏。十智为性。犹如初力。二漏永尽无畏。六十智性。如第十力。三说障法无畏。八智为性。如第二力。四说出道无畏。九十智性。如第七力。如何于智立无畏名。此无畏名目无怯惧。由有智故不怯惧他。故无畏名目诸智体。理实无畏是智所成。不应说言体即是智。佛三念住相别云何。颂曰</p><p>三念住念慧缘顺违俱境</p><p>论曰。佛三念住如经广说。诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>众一向恭敬能正受行。如来缘之不生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。舍而安住<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>正知。是谓如来第一念住。诸弟子众唯不恭敬不正受行。如来缘之不生忧戚。舍而安住正念正知。是谓如来第二念住。诸弟子众一类恭敬能正受行。一类不敬不正受行。如来缘之不生欢戚。舍而安住正念正知。是谓如来第三念住。此三皆用念慧为体。诸大声闻亦于弟子顺违俱境离欢戚俱。此何名为不共佛法。唯佛于此并习断故。或诸弟子随属如来有顺违俱。应甚欢戚。佛能不起可谓希奇。非属诸声闻不起非奇特故。唯在佛得不共名。诸佛大悲云何相别。颂曰</p><p>大悲唯俗智资粮行相境</p><p>平等上品故异悲由八因</p><p>论曰。如来大悲俗智为性。若异此者则不能缘一切有情。亦不能作三苦行相。如共有悲。此大悲名依何义立。依五义故此立大名。一由资粮故大。谓大福德<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>资粮所成办故。二由行相故大。谓此力能于三苦境作行相故。三由所缘故大。谓此总以<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>有情为所缘故。四由平等故大。谓此等于一切有情作利乐故。五由上品故大。谓最上品更无余悲能齐此故。此与悲异由八种因。一由自性。无痴无嗔自性异故。二由行相。三苦一苦行相异故。三由所缘。三界一界所缘异故。四由依地。第四静虑通余异故。五由依身。唯佛通余身有异故。六由<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。离有顶欲证得异故。七由救济。事成希望救济异故。八由哀愍。平等不等哀愍异故。已辩佛德异余有情。诸佛相望法皆等不。颂曰</p><p>由资粮法身利他佛相似</p><p>寿种姓量等诸佛有差别</p><p>论曰。由三事故诸佛皆等。一由资粮等<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故。二由法身等成办故。三由利他等究竟故。由寿种姓身量等殊。诸佛相望容有差别。寿异谓佛寿有短长。种异谓佛生刹帝利<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>种。姓异谓佛姓乔答摩<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>波等。量异谓佛身有小大。等言显诸佛法住久近等。如是有异由出世时所化有情机宜别故。诸有智者思惟如来三种圆德深生爱敬。其三者何。一因圆德。二果圆德。三恩圆德。初因圆德复有四种。一无余修。福德智慧二种资粮修无遗故。二长时修。经三大劫阿僧企耶修无倦故。三无间修。精勤勇猛<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>刹那修无废故。四尊重修。恭敬所学无所顾惜修无慢故。次果圆德亦有四种。一智圆德。二断圆德。三威势圆德。四色身圆德。智圆德有四种。一无师智。二一切智。三一切种智。四无功用智断圆德有四种。一一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>断。二一切定障断。三毕竟断。四并习断。威势圆德有四种。一于外境化变住持<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>威势。二于寿量若促若延自在威势。三于空障极远速行小大相入自在威势。四令<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>种种本性法尔转胜希奇威势。威势圆德复有四种。一难化必能化。二答难必决疑。三立教必出离。四恶党必能伏。色身圆德有四种。一具众相。二具随好。三具大力。四内身骨坚越金刚。外发神光踰百千日。后恩圆德亦有四种。谓令永解脱三恶趣<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。或能安置善趣三乘。总说如来圆德如是。若别分析则有无边。唯佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>能知能说。要留命行经多大劫阿僧企耶说乃可尽。如是则显佛世尊身具有无边殊胜奇特<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>恩德如大宝山。有诸愚夫自乏众德。虽闻如是佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>山及所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不能信重。诸有智者闻说如斯生信重心彻于骨髓。彼由一念极信重心转灭无边不定恶业。摄受殊胜人天<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。故说如来出现于世为诸智者无上<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。依之引生不空可爱殊胜速疾究竟果故。如薄伽梵自说颂言</p><p>若于佛福田能殖少分善</p><p>初获胜善趣后必得涅槃</p><p>已说如来不共功德。共功德今当辩。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十八卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十八卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别定品第八之一</p><p>已说诸智所成<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。余性功德今次当辩。于中先辩所依止定。且诸定内静虑云何。颂曰</p><p>静虑四各二于中生已说</p><p>定谓善一境并伴<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>性</p><p>初具伺喜乐后渐离前支</p><p>论曰。一切功德多依静虑。故应先辩静虑差别。此总有四种。谓初二三四。四各有二。谓定及生。生静虑体世品已说。谓第四八。前三各三。定静虑体总而言之是善性摄心一境性。以善等持为<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。若并助伴五蕴为性。何名一境性。谓专一所缘。若尔即心专一境位。依之建立三摩地名不应别有余心所法。别法令心于一境转名三摩地非体即心。岂不诸心<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>灭故皆一境转。何用等持。若谓令心于第二念不散乱故须有等持。则于相应等持无用。又由此故三摩地成。宁不即由斯心于一境转。又三摩地是大地法。应一切心皆一境转。不尔。余品等持劣故。有余师说。即心一境相续转时名三摩地。契经说此为增上心学故。心清净最胜即四静虑故。依何义故立静虑名。由此寂静能审虑故。审虑即是实了知义。如说心在定能如实了知。审虑义中置地界故。此宗审虑以慧为体。若尔诸等持皆应名静虑。不尔。唯胜方立此名。如<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>言发光名日非萤烛等亦得日名。静虑如何独名为胜。诸等持内唯此摄支。<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>均行最能审虑。得现法乐住及乐通行名。故此等持独名静虑若尔染污宁得此名。由彼亦能邪审虑故。是则应有太过之失。无太过失。要相似中方立名故。如败种等。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>亦说有恶静虑。若一境性是静虑体。依何相立初二三四。具伺喜乐建立为初。由此已明亦具寻义。必俱行故。如烟与火。非伺有喜乐而不与寻俱。渐离前支立二三四。离伺有二。离二有乐。具离三种。如其次第。故一境性分为四种。已辩静虑。无色云何。颂曰</p><p>无色亦如是四蕴离下地</p><p>并上三近分总名除色想</p><p>无色谓无色后色起从心</p><p>空无边等三名从加行立</p><p>非想非非想昧劣故立名</p><p>论曰。此与静虑数自性同。谓四各二。生如前说。即世品说由生有四。定无色体总而言之。亦善性摄心一境性。依此故说亦如是言。然助伴中此除色蕴。无色无有随转色故。虽一境性体相无差。离下地生故分四种。谓若已离第四静虑生立空无边处。乃至已离无所有处生。立非想非非想处。离名何义。谓由此道<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>下地惑。是离下染义。即此四根本并上三近分。总说名为除去色想。空处近分未得此名。缘下地色起色想故。皆无色故立无色名。此因不成。许有色故。若尔何故立无色名。由彼色微故名无色。如微黄物亦名无黄。许彼界中色有何相若彼唯有身语<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。身语既无。律仪宁有。又无大种何有造色。若谓如有无漏律仪不尔。无漏依有漏大种故。又彼定中亦遮有故。若许于彼有色根身如何可言彼色微少。若谓于彼身量小故水细虫极微亦应名无色。亦身量小不可见故。若谓彼身极清妙故中有<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>应名无色。若谓彼身清妙中极应唯有顶得无色名。如定生身有胜劣故。又生静虑所有色身非下地根所能取故。与彼何异不名无色。若谓欲色随义立名无色不然。此有何理。若谓经说寿暖合故。又说名色与识相依如二芦束相依住故。又说名色识为缘故。又遮离色乃至离行识有来有去故。由此无色有色理成。此证不成。应审思故。谓所引教应共审思且契经言寿暖合者。为约一切界。为约欲界说。名色与识相依住者。为约一切界。为约欲色说。所说名色识为缘者。为说一切识皆为名色缘。为说名色生无不缘于识。遮离色至行识有来去者。为遮随离一。为遮离一切。若谓契经言无简别不应于此更致审思。此说不然。太过失故。谓应外暖亦与寿合。又应外名色依识识为缘。又说四食如四识住。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>应有段食。若谓经说有一类天超段食故。又说彼天喜为食故。无斯过者。则无色界不应有色。契经说彼出离色故。又契经言。无色解脱最为寂静。超诸色故。又契经说。无色有情一切色想皆超越故。若无色界实有色者。定应彼色自相可知。如何可言超色想等。若谓观下粗色故说。则于段食亦应许然。又诸静虑超下粗色。亦应可说出离色言。是则亦应名无色界。又亦应说出离受等。彼亦超下粗受等故。经既不说。知无色中遍超色类非超受等。由此定知。彼界无色。然契经中说有不出有者。于自地有不能出故。非遍出故。非永出故。又薄伽梵于静虑中说有色类乃至识类。于无色中说有受类乃至识类。不说有色。若无色中实有色者。何不如静虑说有色类言。故所立因无不成过。在彼多劫色相续断。后殁生下色从何生。此从心生非从色起。谓昔所起色异熟因熏习在心功能今熟。是故今色从彼心生。彼无色身心依何转。离身何不转。下曾不见故。色界无段食身复依何转。下亦不见身离段食转故。又先说彼心转所依。已释总名。空无边等从缘空等得别名耶。不尔。云何。下三无色如其次第修加行时思无边空及无边识无所有故建立三名。立第四名由想昧劣。谓无明胜想得非想名。有昧劣想故名非非想。虽加行时亦作是念诸想如病如箭如痈。若想全无便同痴闇。唯有非想非非想中与上相违寂静美妙。而不就此加行立名。以若诘言何缘加行作如是念。必应答言以于彼处想昧劣故。由此昧劣故。是立名正因。已辩无色。云何等至。颂曰</p><p>此本等至八前七各有三</p><p>谓味净无漏后味净二种</p><p>味谓爱相应净谓世间善</p><p>此即所味着无漏谓出世</p><p>论曰。此上所辨静虑无色。根本等至总有八种。于中前七各具有三。有顶等至唯有二种。此地昧劣无无漏故。初味等至。谓爱相应。爱能味着故名为味。彼相应故此得味名。净等至名目世善定。与无贪等诸白净<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应起故。此得净名。即味相应所味着境。此无间灭彼味定生。缘过去净深生味着。尔时虽名出所味定。于能味定得名为入。无漏定者。谓出世定。爱不缘故非所味着。如是所说八等至中静虑摄支。非诸无色。于四静虑各有几支。颂曰</p><p>静虑初五支寻伺喜乐定</p><p>第二有四支内净喜乐定</p><p>第三具五支舍念慧乐定</p><p>第四有四支舍念中受定</p><p>论曰。唯净无漏四静虑中初具五支。一寻二伺三喜四乐五等持。此中等持颂说为定。等持与定名异体同。故契经说心定等定名正等持。此亦名为心一境性。义如前释。传说。唯定是静虑亦静虑支。余四支是静虑支非静虑。如实义者如四支军。余静虑支应知亦尔。第二静虑唯有四支。一内等净二喜三乐四等持。第三静虑具有五支。一行舍二<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>三正慧四受乐五等持。第四静虑唯有四支。一行舍清净二念清净三非苦乐受四等持。静虑支名既有十八。于中实事总有几种。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第二十九卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第二十九卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>分别定品第八之二</p><p>如是已说所依止定。当辩依定所起<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。诸功德中先辩无量。颂曰</p><p>无量有四种对治嗔等故</p><p>慈悲无嗔性喜喜舍无贪</p><p>此行相如次与乐及拔苦</p><p>欣慰有情等缘欲界有情</p><p>喜初二静虑余六或五十</p><p>不能断诸惑人起定成三</p><p>论曰。无量有四。一慈二悲三喜四舍。言无量者。无量有情为所缘故。引无量福故。感无量果故。此何缘故唯有四种。对治四种多行障故。何谓四障。谓诸嗔害不欣慰欲贪嗔。治此如次建立慈等。不净与舍俱治欲贪。斯有何别。毗婆沙说。欲贪有二。一色二淫。不净与舍如次能治。理实不净能治淫贪。余亲友贪舍能对治。四中初二体是无嗔。理实应言悲是不害。喜则喜受。舍即无贪。若并眷属<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>为体。若舍无贪性如何能治嗔。此所治嗔贪所引故。理实应用二法为体。此四无量行相别者。云何当令诸有情类得如是乐。如是思惟入慈等至。云何当令诸有情类离如是苦。如是思怆入悲等至。诸有情类得乐离苦岂不快哉。如是思惟入喜等至。诸有情类平等平等无有亲怨。如是思惟入舍等至。此四无量不能令他实得乐等。宁非颠倒。愿欲令彼得乐等故。或阿世耶无颠倒故。与胜解想相应起故。设是颠倒复有何失。若应非善理则不然。此与善根相应起故。若应引恶理亦不然。由此力能治嗔等故。此缘欲界一切有情。能治缘彼嗔等障故。然契经说修习慈等思惟一方一切世界。此经举器以显器中。第三但依初二静虑。喜受摄故。余定地无。所余三种通依六地。谓四静虑未至中间。或有欲令唯依五地。谓除未至。是容豫德。已离欲者方能起故。或有欲令此四无量随其所应通依十地。谓欲四本近分中间。此意欲令定不定地根本加行皆无量摄前虽说此能治四障而不能令诸惑得断。有漏根本静虑摄故。胜解作意相应起故。遍缘一切有情境故。此加行位制伏嗔等。或此能令已断更远故。前说此能治四障。谓欲未至亦有慈等。似所修成根本无量。由此制伏嗔等障已引断道生能断诸惑。诸惑断已离染位中。方得根本四种无量。于此后位虽遇强缘而非嗔等之所蔽伏。初习业位云何修慈。谓先思惟自所受乐。或闻说佛菩萨声闻及独觉等所受快乐。便作是念。愿诸有情一切等受如是快乐。若彼本来<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>增盛不能如是平等运心应于有情分为三品。所谓亲友处中怨仇。亲复分三。谓上中下。中品唯一。怨亦分三谓下中上。总成七品。分品别已。先于上亲发起真诚与乐胜解。此愿成已。于中下亲亦渐次修如是胜解。于亲三品得平等已。次于中品下中上怨亦渐次修如是胜解。由数习力能于上怨起与乐愿与上亲等。修此胜解既得无退。次于所缘渐修令广。谓渐运想思惟一邑一国一方一切世界。与乐行相无不遍满。是为修习慈无量成。若于有情乐求德者能修慈定令速疾成。非于有情乐求失者。以断善者有德可录。麟喻独觉有失可取。先福罪果现可见故。修悲喜法准此应知。谓观有情没众<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。便愿令彼皆得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。及想有情得乐离苦。便深欣慰实为乐哉。修舍最初从处中起渐次乃至能于上亲起平等心与处中等。此四无量人起非余。随得一时必成三种。生第三定等唯不成喜故。已辩无量。次辩解脱。颂曰</p><p>解脱有八种前三无贪性</p><p>二二一一定四无色定善</p><p>灭受想解脱微微无间生</p><p>由自地净心及下无漏出</p><p>三境欲可见四境类品道</p><p>自上苦集灭非择灭<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a></p><p>论曰。解脱有八。一内有色想观外色解脱。二内无色想观外色解脱。三净解脱身作证具足住。四无色定为次四解脱。灭受想定为第八解脱。八中前三无贪为性。近治贪故。然契经中说想观者。想观增故。三中初二不净相转。作青瘀等诸行相故。第三解脱清净相转。作净光鲜行相转故。三并助伴皆五蕴性。初二解脱一一通依初二静虑。能治欲界初静虑中显色贪故。第三解脱依后静虑。离八灾患心澄净故。余地亦有相似解脱而不建立。非增上故。次四解脱如其次第以四无色定善为性。非无记染。非解脱故。亦非散善。性微劣故。彼散善者。如命终心。有说。余时亦有散善。近分解脱道。亦得解脱名。无间不然。以缘下故。彼要背下地方名解脱故。然于余处多分唯说彼根本地名解脱者。以近分中非全分故。第八解脱即灭尽定。彼<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>等如先已说。厌背受想而起此故。或总厌背有所缘故。此灭尽定得解脱名。有说。由此解脱定障。微微心后此定现前。前对想心已名微细。此更微细故曰微微。次如是心入灭尽定。从灭定出或起有顶净定心或即能起无所有处无漏心。如是入心唯是有漏。通从有漏无漏心出。八中前三唯以欲界色处为境。有差别者。二境可憎。一境可爱。次四解脱各以自上苦集灭谛及一切地类智品道。彼非择灭及与虚空为所缘境。第三静虑宁无解脱。第三定中无色贪故。自地妙乐所动乱故。<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>何缘修净解脱。为欲令心暂欣悦故。前不净观令心沈戚。今修净观策发令欣。或为审知自堪能故。谓前所修不净解脱为成不成。若观净相烦恼不起。彼方成故。由二缘故。诸瑜伽师修解脱等。一为诸惑已断更远。二为于定得胜<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故能引起无诤等德及圣<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。由此便能转变诸事起留舍等种种作用。何故经中第三第八说身作证非余六邪。以于八中此二胜故。于二界中各在边故。已辩解脱。次辩胜处。颂曰</p><p>胜处有八种二如初解脱</p><p>次二如第二后四如第三</p><p>论曰。胜处有八。一内有色想观外色少。二内有色想观外色多。三内无色想观外色少。四内无色想观外色多。内无色想观外青黄赤白为四。足前成八。八中初二如初解脱。次二如第二解脱。后四如第三解脱。若尔八胜处何殊三解脱。前修解脱唯能弃背。后修胜处能制所缘。随所乐观惑终不起。已辩胜处。次辩遍处。颂曰</p><p>遍处有十种八如净解脱</p><p>后二净无色缘自地四蕴</p><p>论曰。遍处有十。谓周遍观地水火风青黄赤白及空与识二无边处。于一切处周遍观察无有间隙故名遍处。十中前八如净解脱。谓八自性皆是无贪。若并助伴五蕴为性。依第四静虑缘欲可见色。有余师说。唯风遍处缘所触中风界为境。后二遍处如次空识。二净无色为其自性。各缘自地四蕴为境。应知此中修观行者。从诸解脱入诸胜处。从诸胜处入诸遍处。以后后起胜前前故。此解脱等三门功德。为由何得。依何身起。颂曰</p></div>"
},{
    "title": "阿毗达磨俱舍论 第三十卷",
    "author": "玄奘法师",
    "html": "<div class=\"B1_text\"><p>阿毗达磨<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a> 第三十卷</p><p>尊者世亲造</p><p><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师玄奘奉诏译</p><p>破执我品第九之二</p><p>若唯五取蕴名补特伽罗。何故<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>作如是说。吾今为汝说诸重担取舍重担荷重担者。何缘于此佛不应说。不应重担即名能荷。所以者何。曾未见故。不可说事亦不应说。所以者何。亦未见故。又取重担应非蕴摄重担自取曾未见故。然经说爱名取担者。既即蕴。摄。荷者应然。即于诸蕴立数取趣。然恐谓此补特伽罗是不可说<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>实有。故此经后佛自释言。但随世俗说此具寿有如是名。乃至广说。如上所引人经文句。为令了此补特伽罗可说<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>非实有性。即五取蕴自相逼害得重担名。前前<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>引后后故名为荷者。故非实有补特伽罗。补特伽罗定应实有。以契经说诸有拨无化生有情邪见摄故。谁言无有化生有情如佛所言我说有故。谓蕴相续能往后世不由胎卵湿名化生有情。拨此为无故邪见摄。化生诸蕴理实有故。又许此邪见谤补特伽罗。汝等应言。是何所断。见修所断。理并不然。补特伽罗非谛摄故。邪见不应修所断故。若谓经说有一补特伽罗生在<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>应非蕴者。亦不应理。此于总中假说一故。如世间说一麻一米一聚一言。或补特伽罗应许有为摄。以契经说生世间故。非此言生如蕴新起。依何义说生在世间。依此今时取别蕴义。如世间说能祠者生记论者生取明论故。又如世说有苾刍生有外道生。取仪式故。或如世说有老者生有病者生。取别位故。佛已遮故此救不成。如胜义空契经中说。有业有异熟。作者不可得。谓能舍此蕴及能续余蕴。唯除法假。故佛已遮。颇勒具那契经亦说。我终不说有能取者。故定无一补特伽罗能于世间取舍诸蕴。又汝所引祠者等生。其体是何而能喻此。若执是我彼不极成。若心心所彼念念灭新新生故取舍不成。若许是身亦如心等。又如明等与身有异。蕴亦应异补特伽罗。老病二身各与前别。数论转变如前已遣。故彼所引为喻不成。又许蕴生非数取趣则定许此异蕴及常。又此唯一。蕴体有五。宁不说此与蕴有异。大种有四造色唯一。宁言造色不异大种。是彼宗过。何谓彼宗。诸计造色即大种论。设如彼见应作是质。如诸造色即四大种亦应即<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>立补特伽罗。若补特伽罗即诸蕴者。世尊何不记命者即身。观能问者阿世耶故。问者执一内用士夫体实非虚名为命者。依此问佛与身一异。此都无故一异不成。如何与身可记一异。如不可记龟毛[革*卬]软。古昔诸师已解斯结。昔有大德名曰龙军。三明六通具八<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。于时有一毕邻陀王。至大德所作如是说。我今来意欲请所疑。然诸<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>性好多语。尊能直答。我当请问。大德受请。王即问言。命者与身为一为异。大德答言。此不应记。王言。岂不先有要耶。今何异言不答所问。大德质曰。我欲问疑。然诸国王性好多语。王能直答。我当发问。王便受教。大德问言。大王宫中诸庵罗树所生果味为酢为甘。王言。宫中本无此树。大德复责。先无要耶。今何异言不答所问。王言。宫内此树既无。宁可答言果味甘酢。大德诲曰。命者亦无。如何可言与身一异。佛何不说命者都无。亦观问者阿世耶故。问者或于诸蕴相续谓为命者。依之发问。世尊若答命者都无。彼堕邪见故佛不说。彼未能了缘起理故。非受<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>器。不为说假有。理必应尔。世尊说故。如世尊告阿难陀言。有姓筏蹉<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>外道。来至我所作是问言。我于世间为有非有。我不为记。所以者何。若记为有违法真理。以一切法皆<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>故。若记为无增彼愚惑。彼便谓我先有今无。对执有愚此愚更甚。谓执有我则堕常边。若执无我便堕断边。此二轻重如经广说。依如是义故有颂曰</p><p>观为见所伤及坏诸善业</p><p>故佛说正法如牝虎衔子</p><p>执真我为有则为见牙伤</p><p>拨俗我为无便坏善业子</p><p>复说颂曰</p><p>由实命者无佛不言一异</p><p>恐拨无假我亦不说都无</p><p>谓蕴相续中有业果命者</p><p>若说无命者彼拨此为无</p><p>不说诸蕴中有假名命者</p><p>由观发问者无力解真空</p><p>如是观筏蹉意乐差别故</p><p>彼问有无我佛不答有无</p><p>何缘不记世间常等。亦观问者阿世耶故。问者若执我为世间。我体都无故。四记皆非理。若执<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>皆名世间。佛四种记亦皆非理。谓若常者无得<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。若是非常便自断灭不由功力咸得涅槃。若说为常亦非常者定应一分无得涅槃。一分有情自证圆寂。若记非常非非常者则非得涅槃。非不得涅槃。决定相违便成戏论。然依圣道可般涅槃。故四定记皆不应理。如离系子问雀死生。佛知彼心不为定记。有边等四亦不记者。以同常等皆有失故。宁知此四义同常等。以有外道名嗢底迦。先问世间有边等四。复设方便矫问世尊。为诸世间皆由圣道能得出离为一分耶。尊者阿难因告彼曰。汝以此事已问世尊。今复何缘改名重问。故知后四义与前同。复以何缘世尊不记如来死后有等四耶。亦观问者阿世耶故。问者妄计已解脱我名为如来而发问故。今应诘问计有我者。佛何缘记有现补特伽罗不记如来死后亦有。彼言恐有堕常失故。若尔何缘佛记慈氏汝于来世当得作佛。及记<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>身坏命终某甲今时已生某处。此岂非有堕常过失。若佛先见补特伽罗彼涅槃已便不复见以不知故不记有者则拨大师具一切智。或应许不记由我体都无。若谓世尊见而不说则有离蕴及常住过。若见非见俱不可说则应渐言不可说佛是一切智。非一切智。若谓实有补特伽罗。以契经言谛故住故定执无我者堕恶见处故。此不成证。彼经亦说定执有我者堕恶见处故。阿毗达磨诸论师言。执我有无俱边见摄。如次堕在常断边故。彼师所说深为应理。以执有我则堕常边。若执无我便堕断边。前筏蹉经分明说故。若定无有补特伽罗为说阿谁<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>生死。不应生死自流转故。然薄伽梵于契经中。说诸有情无明所覆贪爱所系驰流生死故应定有补特伽罗。此复如何流<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死。由舍前蕴取后蕴故。如是义宗前已征遣。如燎原火虽刹那灭而由相续说有流转。如是蕴聚假说有情。爱取为缘流转生死。若唯有蕴。何故世尊作如是说。今我于昔为世导师名为妙眼。此说何咎。蕴各异故。若尔是何物。谓补特伽罗。昔我即今体应常住。故说今我昔为师言。显昔与今是一相续。如言此火曾烧彼事。若谓决定有真实我则应唯佛能明了观。观已应生坚固<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。从斯我执我所执生。从此应生我我所爱。故薄伽梵作如是言。若执有我便执我所。执我所故。于诸蕴中便复发生我我所爱。萨迦耶见我爱所缚则为谤佛。去解脱远。若谓于我不起我爱。此言无义。所以者何。于非我中横计为我。容起我爱。非实我中。如是所言无理为证。故彼于佛真圣教中无有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>起见疮疱。如是一类执有不可说补特伽罗。复有一类总拨一切法体皆非有。外道执有别真我性。此等一切见不如理。皆不能免无解脱过。若一切类我体都无。刹那灭心于曾所受久相似境何能忆知。如是忆知从相续内念境想类心差别生。且初忆念为从何等心差别无间生。从有缘彼作意相似相属想等不为依止差别愁忧散乱等缘损坏<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>心差别起。虽有如是作意等缘。若无彼类心差别者则无堪能修此忆念。虽有彼类心差别因若无如是缘亦无能修理。要具二种方可能修。诸忆念生但由于此。不见离此有功能故。如何异心见后异心能忆。非天授心曾所见境后祠授心有忆念理。此难非理。不相属故。谓彼二心互不相属。非如一相续有<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>性故。我等不言异心见境异心能忆。相续一故。然从过去缘彼境心引起今时能忆念识。谓如前说。相续转变差别力故。生念何失。由此忆念力有后记知生。我体既无孰为能忆。能忆是何义。由念能取境。此取境岂异念。虽不异念但由作者。作者即是前说念因。谓彼类心差别。然世间所言制怛罗能忆。此于蕴相续立制怛罗名。从先见心后忆念起。依如是理说彼能忆。我体若无是谁之念。为依何义说第六声。此第六声依属主义。如何物属何主。此如牛等属制怛罗。彼如何为牛主。谓依彼彼所乘所构所役等中彼得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。欲于何所驱役于念。而勤方便寻求念主。于所念境。驱役于念。役念为何。谓令念起。奇哉自在起无理言。宁为此生而驱役此。又我于念如何驱役。为令念起。为令念行。念无行故但应念起。则因名主。果名能属。由因增上令果得生。故因名主。果于生时是因所有故名能属。即生念因足为念主。何劳立我为念主耶。即诸行聚一类相续。世共施设制怛罗牛。立制怛罗名为牛主。是牛相续于异方生变异生因故名为主。此中无一实制怛罗亦无实牛。但假施设。故言牛主。亦不离因。忆念既尔。记知亦然。如辩忆知熟为能了谁之识等亦应例释。且识因缘与前别者。谓根境等。如应当知。有作是言。决定有我。事用必待事用者故。谓诸事用待事用者。如天授行必待天授。行是事用。天授名者。如是识等所有事用。必待所依能了等者。今应诘彼。天授谓何。若是实我此如先破。若假士夫体非一物。于诸行相续假立此名故。如天授能行识能了亦尔。依何理说天授能行。谓于刹那生灭诸行不异相续立天授名。愚夫于中执为一体。为自相续异处生因。异处生名行。因即名<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。依此理说天授能行。如焰及声异处相续。世依此说焰声能行。如是天授身能为识因故。世间亦谓天授能了。然诸圣者为顺世间言说理故。亦作是说。经说诸识能了所缘。识于所缘为何所作。都无所作但以境生。如果酬因。虽无所作而似因起说名酬因。如是识生虽无所作而似境故说名了境。如何似境。谓带彼相。是故诸识虽亦托根生不名了根。但名为了境。或识于境相续生时。前识为因引后识起说识能了亦无有失。世间于因说作者故。如世间说钟鼓能鸣。或如灯能行识能了亦尔。为依何理说灯能行。焰相续中假立灯号。灯于异处相续生时。说为灯行。无别行者。如是心相续假立识名。于异境生时说名能了。或如色有色生色住。此中无别有生住者。说识能了理亦应然。若后识生从识非我。何缘从识不恒似前。及不定次生如芽茎叶等。有为皆有住异相故。谓诸有为<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>法尔微细相续后必异前。若异此者纵意入定。身心相续相似而生。后念与初无差别故。不应最后念自然从定出。诸心相续亦有定次。若此心次彼心应生。于此心后彼必生故。亦有少分行相等心方能相生。种性别故。如女心无间起严污身心。或起彼夫彼子心等。后时从此诸心相续转变差别还生女心。如是女心于后所起严污心等有生功能。异此无功能。由种性别故。女心无间容起多心。然多心中若先数起。明了近起。先起非余。由如是心修力强故。唯除将起位身外缘差别。诸有修力最强盛者。宁不恒时生于自果。由此心有住异相故。此住异相于别修果相续生中最随顺故。诸心品类次第相生因缘方隅我已略说。委悉了达唯在世尊。一切法中智自在故。依如是义故。有颂言</p></div>"
}]