[{
    "title": "阿毗达磨俱舍释论 第一卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第一卷</p><p>阿毗达磨俱舍释论序</p><p>正教本宗。文唯<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>所阐。谅无异说。<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>深微。名实繁旷。若非圆明独朗。孰能通达。自日隐頞多之山。月翳罗睺之手。时移解昧。部执竞兴。或以文释义。或以义判文。虽复得失参差。皆以三藏为本。可谓殊涂同归一致百虑者也。寻十八部。师及<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。并各造论。解其所执。于一部中多有诸论。此土先译萨婆多部。止有毗婆沙及杂心四卷。毗婆沙明义虽广。而文句来不具足。杂心说乃处中。止述自部宗致四卷。过存省略。旨趣难可寻求。此土先译经部正。有成实一论。成实乃以经部驳斥余师。其间所用。或同余部。又于破立之中。亦未皆尽其妙。且传译参差。难可具述。佛灭度后千一百余年。有<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>菩萨。名婆薮盘豆。器度宏旷。神才壮逸。学穷文字。思彻渊源。德隆终古。名盖当世。造大小乘论。凡数十部。并盛宣行。靡不宗学。法师德业。具如别传。先于萨婆多部出家。仍学彼部所立三藏。后见彼法多有乖违。故造此论。具述彼执。随其谬处。以经部破之。故此论本宗是萨婆多部。其中取舍。以经部为正。博综群籍。妙拔众师。谈玄微穷于奥极。述事象略而周遍。显成圣旨。备摧异说。立不可[门@视]。破无能拟。义兼数论。而深广愈之。词不繁而义显。义虽深而易入。故<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>咸称为聪明论。于大小乘学。悉依此为本。有三藏法师俱罗那他。聪敏强记。才辩无竭。硕学多闻。该通内外。为弘法故。远游此国。值梁室将倾。时事纷梗。法师避地东西。垂二十载。欲还天竺。来至番禺。慧恺因请翻讲摄大乘等论经。涉二年。文义方毕。法师尔后犹欲旋归。刺史欧阳纥尚仁贵道。久申敬事。重复请留。弥加殊礼。慧恺与僧忍等。更请翻讲此论。以陈天嘉四年岁次阏逢龙集涒滩正月二十五日。于制旨寺。始就开阐。惑品未毕。仍事徙居于南海郡内。续更敷说。法师游方既久。精解此土音义。凡所翻译。不须度语。但梵音所目。于义易彰。今既改变梵音。词理难卒符会。故于一句之中。循环辩释。翻覆郑重。乃得相应。慧恺谨即领受。随定随书。日夜相系。无懈晷刻。至其年闰十月十日。文义究竟。论文二十二卷。论偈一卷。义疏五十三卷。刺史仍请于城内讲说。既得温故。颇识大宗。非唯闇弱。多有疑滞。又恐所翻不免谬失。至天嘉五年岁次柔兆二月二日。与僧忍等。更请法师。重译论文。再解义意。至光大元年岁次强圉十二月二十五日。治定前本始末究竟。长史袁敬。识鉴沉深。信解明正。长史长子元友。爱文重法。博学多艺。并礼事法师。备尽经始经。南中翻译。悉赖此贵门。方希永传来世。以为后生模式。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>大海。深广无际。若不局一涂。能信顺求学。岂不同飡<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。共嗅詹匐者哉。如或专执。非所喻也</p><p>婆薮盘豆造</p><p>陈天竺三藏<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别界品第一</p><p>一切种智灭诸冥拔出<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>泥</p><p><a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>大师如理教对法俱舍我当说</p><p>释曰。若人欲正造论。当令他知大师不共<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。故说众德为先。后顶礼大师。此偈但依佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。偈曰。一切种智灭诸暝。释曰。灭一切暝。由一切种智。于一切法无明者。能障见真实义。故称为暝。此无明于佛世尊。由得究竟通对治故。一切种于一切法。永不生为法故。故称为灭。独觉及声闻。于一切法虽除无明。由有染污无明极不生故。不由一切种。何以故。诸余<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。于如来不共法。及于余境。最久远时处无边差别。有无染污无明。显自利行究竟。赞叹佛已。次以利他行<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。赞叹世尊。偈曰。拔出众生生死泥。释曰。生死是<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>沉着处故。难可度故。故以譬泥。众生于中沉着无救接者。唯佛世尊欲怜愍度脱。授说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>手应理拔济。是人与自他利益行相应。偈曰。顶礼大师如理教。释曰。头面接足名顶礼。立教不虚称大师。无倒称如理。得善离恶言称教。说此如理教为利他方便。由如理教。从生死泥拔济众生。不由通慧施恩威德等。顶礼如理教师已。欲何所作。偈曰。对法俱舍我当说。释曰。此法通名灭济教。别名云何。阿毗达磨俱舍。何法名阿毗达磨。偈曰。净智助伴名对法。释曰。智谓。择法。净谓无垢。即无流智助伴。谓<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>资粮。若尔则说无流<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。名阿毗达磨。此即真实阿毗达磨。若说假名阿毗达磨。偈曰。能得此法诸智论。释曰。即是有流思慧闻慧生得慧及助伴论。谓能传生无流智。是无流智资粮故。亦名阿毗达磨。因何义立此名。能持自体相故称达磨。或一切法中真实法<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>为相。故称达磨。此智对诸法。于法现前故。称阿毗达磨。此论云何名阿毗达磨俱舍。偈曰。由义对法入此摄。释曰。彼文句名阿毗达磨。由随胜义入此论摄。是故此论于彼得称为藏。复次偈曰。论依对法名俱舍。释曰。阿毗达磨是此论依止。何以故。从彼法中引生此论故。彼于此论亦受藏名。以是义故此论名为阿毗达磨俱舍。复次此法其用云何。何人先说此法。而法师恭敬欲解说之。偈曰。离简择法更不有。为寂静惑别方便。世间由惑转有海。为此传佛说对法。释曰。若离择法觉分。无别方便能除灭诸惑。诸惑能轮转世间于生死海。由此正因。欲令弟子得简择法。故大师佛世尊先说阿毗达磨。若离此正诸说。弟子不能如理简择真法故。佛世尊处处散说此法。大德迦旃延子等诸弟子。撰集安置。犹如大德达磨多罗多撰集优陀那伽他部类。闻毗婆沙师传说如此。何者诸法是所简择。为令他简择彼法。佛世尊说阿毗达磨。偈曰。有流无流法。释曰。略说一切法。谓有流无流。此中何者有流。偈曰。有为除圣道。有流释曰。除道圣谛。所余有为法说。名有流。何以故。偈曰。于中流。由随增眠故。释曰。若有如此义。诸流缘灭道二谛为境起。于中不眠。无随增故。是故于中不可立有流为反质难。是不眠义。后分别惑品中当广说。说有流法已。何者无流法。偈曰。无流法圣道及三种无为。释曰。何者三无为。偈曰。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>及二灭。释曰何者二灭。择灭非择灭。如此空等三无为及圣道。说为无流法。何以故。于中诸流不能眠故略说。三无为中何者为空。偈曰。此中空无碍。释曰。空以无障无碍为性故色于中行。偈曰。择灭谓永离。释曰。与有流法永相离说名择灭。各数简择苦等圣谛名择。即智胜因。此所得己利名为择灭。具足应言择所得灭。以略说故但称择灭。如车与牛相应名为牛车。一切有流为一择灭为不一。不一云何偈曰。各各对诸结。释曰。如结数量。择灭亦尔。若不尔。由证见苦所断惑择灭。则应一时俱证一切惑择灭。若尔修余对治道则空无果。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a></p></div>"
},{
    "title": "阿毗达磨俱舍释论 第二卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第二卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别界品之二</p><p>于十八界中何法能斫何法所斫。何法能烧何法所烧。何法能称何法所称。偈曰。能斫及所斫。谓是外四界。释曰。色香味触名斧名薪。即是能斫所斫。何法名斫。聚流相应生。断隔其生起名斫。身根等非所斫。若斫则无余。不可令二故。何以故。诸根若分为多。则不成根。所斫诸分非根故。亦非能斫。如宝光清净故。如能斫所斫。唯外四界。偈曰。所烧所称尔。释曰。唯外四界。是所烧是所称。非诸根。何以故。微细清净故。犹如光明。声亦尔。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>断故。偈曰。争能烧所称。释曰。有诸师说。外四界是能烧是所称。有诸师说。于中唯火大能烧。唯重触是所称。几界从<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>生。几界从增长生。几界从等流生。几界有实物。几界唯一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>生。偈曰。果报增长生。五内。释曰。五内界。谓眼等五根。从果报及增长生。不从等流生。离果报增长无别等流故。此中从果报因生。名果报生。除中间因名故。譬如牛车。复次是业至果报熟时。说名果报。正能熟故。从此生故。说果报生果者名熟。复次于因可立果名。如果中立因名。如经言。此六种触入。应知是宿业。饮食将养寝卧。三摩提等胜缘所资益。名增长生。有余师说。由梵行故增长。此言不然。何以故。梵行但不为损。无有益义。于果报相续增长相续。能为护持。犹如外城防守内城。声界或增长生。或等流生。偈曰。声非报。释曰。云何不从果报生。随欲生故。若尔于假名论中。云何说由永离恶口。善修不恶口戒故。得<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>大人相生。余师说。声属第三传。从业生霜佉四大。从霜佉四大生声。复有余师说。声属第五传。从业生果报四大。从果报四大。生增长四大。从增长四大。生等流四大。从等流四大生声。若尔身受从业所生四大生。不应成果报。若受如声。则违道理。偈曰。八种无碍界。流生果报生。释曰。何者为八。七识界及法界。是等流所生。从同类因及遍行因所生故。果报生者。谓从果报因生。此八界无增长生。无碍法无增长故。偈曰。余三。释曰。余四界谓色香味触。或果报生。或增长生。或等流生。偈曰。一有物。释曰。是<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>有贞实故成物。此于法界中有故。唯一法界有物。偈曰。后三一刹那。释曰。意界法界<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>界。由文句次第故言后三。此三于初无流。苦法忍一刹那中。非等流生故。言一刹那。此中苦法忍相应心。谓意界意识界。与彼共生相应法。应简择此义。若人不与眼界相应。后至得相应。为与眼识界相应不。若人与眼识界相应。为与眼界相应不。偈曰。眼根与识界。独俱得复有。释曰。独得者。有与眼界相应。不与眼识相应。如人于欲界中次第至得眼根。或从<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>堕。于第二定等中生。有与眼识相应。不与眼界相应。如人已生第二定已。引眼识现前。从彼退于下界生。或俱得者。有与眼界眼识界一时相应。如人从无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>堕生欲界。或生初定。或俱不得者。除前三句。若人与眼界相应。为与眼识界相应不。有四句。第一句者。若人于第二定等中。已受生不引眼识令现前。第二句者。若人于欲界未得眼根。及已失眼根。第三句者。若人于欲界。已得眼根不失。或生初定二定等中<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>色。第四句者。除前三句。眼界与色界。眼识界与色界。至得句义。应如此思量。为引如此思量故。言复有几界为我依。几界为我依外。偈曰。十二界我依。释曰。何者十二。偈曰。除色等。释曰。六识六根。此十二界名我依。色等六尘界名外。我既是无。云何说我依及我依外。我慢依止故。假说心为我。如偈言</p><p>我是我善依异此何胜依</p><p>若我好调伏智人得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a></p><p>有余处佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。唯调伏心。如偈言</p><p>调伏心最胜心调引乐故</p><p>是心<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>说为我。眼等为此依止。及亲近故。是故说眼等名我。依色等为境界故称外。若尔六识界。应不成我依。何以故。六识未至意界位。不得为心依。是时若作意界。即六识作非余故。六识不离意界体。若不尔。意界唯过去。非未来现在。彼部许十八界有三世故。若未来现在识。无意界体相。于过去中。亦不可立为意界。何以故。相于三世。无不定义故。几界有等分。几界非等分。若一向有等分。偈曰。法界等分。释曰。是尘于识定为境。若识于中已生及定生为法。是尘说名等分。无一法界此中无边意识非已生非应生。何以故。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>心缘法界。必如此生。谓一切法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。此心离自性及共有法。余一切法悉为境界。此刹那心。于第二刹那心。皆成境界。于二刹那中。一切法皆成境界。是故法界恒是等分。偈曰。非等分余。释曰。除法界所余界。非等分亦有等分。何法名非等分。偈曰。不作自事。释曰。义至已说。若作自事名有等分。若眼界已见色正见色当见色。说名有等分。乃至意界亦尔。由于尘自功能立名等分。罽宾国师说非等分眼有四种。若眼根不见色。已灭正灭当灭。无生为法。西方诸师说。有五种无生为法。分为二分。一与识相应。一与识不相应。乃至身亦尔。意根但无生为法。名非等分。色者若已见正见当见。名有等分。非等分有四种。若色非所见。已灭正灭当灭。无生为法。名非等分。乃至触亦尔。由自根功能应知。色等有等分非等分义。是一人等分眼。于一切人非等分。乃至意亦尔。色则不尔。随能见者。于此人则成等分。若不能见。于此人则非等分。何以故。有如此义。此色是一人所见。亦可得为多人所见。如观看时中见月舞相攒等色。无如此义。由一眼根二人见色。是故诸根不共得故。就一相续分别等分非等分。色由共得故。不就一相续立等分非等分。如色声香味触界应知如此。声界可许如此。香等<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。随一一人所得。余人不得。何以故。此三皆至到根故不共得。别立似眼等。应是道理。虽不共得。有如此道理可立共得。何以故有如此义。是香等能生一人鼻等识。亦可得生余人鼻等识。眼等则不尔。是故香等如色可得例说。眼等诸识等分非等分义。由定生定不生故。犹如意界。等分者有何义。根尘及识。更互相应。又共作一切能。又同以一触为事故。非等分者。是等分同类。虽似彼非彼。故名非等分。几界见谛所灭。几界<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭。几界非所灭。偈曰。十界修道灭。五亦。释曰。色等十界。并五识界。一向修道所灭。偈曰。后三三。释曰。意界法界意识界。此三各有三种。八十八随眠。或与彼共有法。是彼至得。共彼伴类。皆见谛灭。所余有流皆修道灭。无流非所灭。更有别法。是见谛所灭为。不尔。何者别法。凡夫性能感恶道。身口二业与圣道相违故。此非见谛灭。此中略说见谛灭相。偈曰。非污非见灭。非色非六生。释曰。见谛所灭随一法。无非染污。色亦非见谛灭。凡夫性。是无记无染污。断善根凡夫。及离欲人。与此相应故。身口二业是色故。是故非见谛灭。何以故。不能违四。谛理故。若尔苦法忍生时。凡夫性应在。则成违许难。六谓意入。若离此于余处生。名非六生。谓从五根生。此法亦非见谛灭。十八界中几界是见几界非见。偈曰。眼法界一分名见。释曰。何者为一分。偈曰。有八种。释曰。身见等五见。世间正见。有学正见。无学正见。此八是法界一分名见。所余法界非见。此中身见等五见。分别惑品中。时至当广说。世间正见者。意识相应善有流慧。有学正见者。谓有学无流慧。无学亦尔。此四如有云无云夜昼见色。有染污无染污。世间有学无学见。观诸法亦尔。云何说世间正见。唯与意识相应。由此义。偈曰。五识共生智。非见不度故。释曰。见者度决为体。能起简择是非故五识相应智则不尔。无分别故。是故非见。若彼有染污无染污。悉非见。若尔眼根亦无决度。何故名见。由能观视色故。云何知。偈曰。眼见色。释曰。若眼见色。与余识相应。人应得见色。若非一切眼见色。何者能见。偈曰等分。释曰。是时此眼有识。是时能见。异此则不能见。若尔应许依眼根识能见。偈曰。非能依眼识。释曰。不可立眼识能见。何以故。偈曰。由色非可见。被障彼执尔。释曰。是色壁等所障则不可见。若识能见。识无碍故。于壁等障则不为妨。是故应见被障之色。于被障色识既不生。云何能见。云何不生。若人执唯眼见色。于此人由眼有碍。于所障色无有功能。识不得生与依共一境起故。此义应然。若尔云何眼不至境。犹如身根。由不见被障色。以有碍故。若尔云母琉琉水精净水所障。色云何得见。是故不由有碍被障诸色眼不能见。若尔何故不见。是处光明相通无隔。于被障色眼识得生。若是处光明被隔不通。于中眼识不生。由不生故。不能见被障色。若尔云何经中说。由眼见色。此中明由依止得见。是此经意。如说由意根识法。意不能识法。以过去故。何者能识唯是意识。经说由眼见亦尔。复次于所依中说能依事。譬如楼叫。复次如余经说。眼所识诸色。可爱可欲悦心。此色非眼所识。复次有余经说<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>眼者唯门。为见众色。由此等证故。知藉眼为门以识见色。此义是证所显。于能见眼则成门。何以故。若眼成见为见诸色。是义不然。若识能见。何法。能识。此二何异。何以故。是色识即是色见。譬如有解脱名见或名智。如此有识。或名见或名识。复有余师说。若眼能见。眼则成作者。何法为别见事。有如此过失。此言非难。如汝许识能识。于中不立作者及事差别。眼能见色亦尔。复有余师说。眼识名见。见依止故。说眼能见。譬如打依止故说钟作声。若尔识依止故。义至应言眼能识不应至。何以故。此眼识于世间成立名见。云何知。此识生时。说色是所见。不说是所识。毗婆沙中自说如此。若眼所至眼识所受。乃说所见。故说眼见不说眼识。但由识在。故名能识。譬如说日作昼。经部说。何故共聚破空。何以故。依眼缘色。眼识得生。此中何法能见。何法所见。一切无事。但唯有法。谓因及果。此中为互相解。随意假说。如说眼能见识能识。于中不应执着。佛世尊说。汝等莫执着方言。莫随逐世间所立名字。罽宾国毗婆沙师。悉檀判如此。眼能见。耳能闻。鼻能嗅。舌能尝。身能触。意能识。为用一眼见色。为用二眼见色。此中无定。偈曰。或由二眼见。分明见色故。释曰。亦由二眼根见色。阿毗达磨师说如此。何以故。若开二眼见最明了。若开一眼。半闭一眼。则见二月。由随一变异见则不明。不可由依止处别分识为二。识无住处故。不同于色若眼能见。耳能闻。乃至意能识。彼尘为至为不至耶。偈曰。眼耳及意根。不至尘。释曰。云何如此眼能见远色。若以药涂眼则不能见。耳能闻远声。若眼耳缘至尘。修观行人。天眼天耳。不得应成。犹如鼻等。若尔云何不能见一切不至尘。及最远尘。并所障尘。若尔云何磁石不吸一切不至之铁。若能缘至尘。此难则齐。云何不能见一切至尘。谓眼药及筹等。如鼻等缘至尘。不缘一切至。不能取香等共有故。如此眼尘不至。非一切不至。皆是眼尘。意无色故。无有至能。故不缘至尘。有余师说。耳缘至不至尘。由闻耳内声故。所余鼻舌身。偈曰。三异。释曰。以至到为尘。云何知鼻缘至尘。若断息则不闻香。至是何法。生无间为至。邻虚为互相触。为不相触。罽宾国师说。不相触。何以故。若由一切体相触。诸物则应相杂。若由体一分相触。邻虚则有方分。诸邻虚无方分故。若尔云何发声。由无间故。若言相触。二手相榼则应相着。石投石亦尔。若尔微聚相榼云何不散。风界所持故。何以故。有风界能破散。如劫末时。有风界能合持。如劫成时。云何今说<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>尘由无间至缘于至尘。是彼无间义。说名为至。谓于中间无有别物。复次微聚物有方分故。若相触则无失。若作如此执。毗婆沙中此文句得成。是触为以触为因生。为非触为因生。作如此问。约因为答。有时以触为因。非触得生。若物分散。有时以非触为因。触得生。若物增长。有时以触为因。触得生。若聚与聚共合。有时以非触为因。非触得生。如隙中微尘。大德婆须蜜多罗说。若邻虚相触。应得住至后刹那。大德说。邻虚不相触。于无间中。世间假立触名。大德意可受。若不如此。邻虚则有间。中间既空。何法能断其行。说其有碍。是聚不异邻虚。若聚相触。即是邻虚相触。如可变坏。若汝言邻虚有方分。若触非触。皆成有分过失。若无方分。于汝不可许之。为色若有触。可立此难。眼等诸根取尘。为称其自量。由事速疾故。犹如旋火。乃至遍见大山等。色为能取等不等量尘。是前所说。缘至到尘。偈曰。三根谓鼻等。许取如量尘。释曰。如根量邻虚。尘邻虚亦尔。共合生鼻等识。眼耳则无定。有时取最小尘。若见毛端。有时取等量尘。若见蒲桃子。有时取最大尘。若见大山。即于闻时耳亦如此。或闻蚊声。或闻雷声。意既无体。不可说其形量。眼等诸根邻虚形相云何可知。眼根邻虚。于眼童子中住。如时罗花青色所覆。是故不散。有余部说。如聚重累住。互不相障。清彻如颇梨柯宝。耳根邻虚。于耳中住。如浮休阇皮。鼻根邻虚。于鼻頞中住。前三根横作行度。无有高下。舌根邻虚如半月。彼说于舌中央。如发端量。非舌根邻虚所覆。身根邻虚如身相。女根邻虚如鼓颡。男根邻虚如大指。此中眼根邻虚。或时一切等分。或时一切非等分。或时有等分有非等分。乃至舌根邻虚亦尔。身根邻虚。无一切等分。若然焰<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中。所执驻<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。有无量身邻虚。亦非一切等分。何以故。若一切皆发身识。则身散坏。无唯一邻虚根一邻虚尘能生识。五识以微聚为根尘故。是故邻虚无显。不可见故。是六识界如前所说。谓眼识乃至意识。于中五识尘唯现世。最后识尘三世。彼依为如此不。说不尔。云何不尔。偈曰。后界依过去。释曰。意识界无间灭识为依。偈曰。五界依亦共。释曰。亦言显过去。此中眼识依。共有同一世故。乃至身识亦尔。彼过去依。谓意根。如此五识聚。依二根生。故说如此。若法能为眼识依。为能作彼次第缘不。此中有四句。第一句。谓眼根。第二句。谓次第已灭心法法界。第三句。谓次第已灭心。第四句。除前三句。乃至身识自根。亦应如此说。于意识但无初句。若法为依。必为次第缘故。若有法为次第缘非依。谓无间灭心法法界。识生随属二缘。复有何因。但说眼等为彼依。不说色等。偈曰。随根异识异。故眼等成依。释曰。由眼等根有差别故。诸识亦有差别。眼等根若有增损。诸识随之则有明昧。不由色等差别诸识变异。于识二缘中眼等胜故。立为识依。不说色等。色等是识所识。复有何因。说为眼识乃至意识。不说为色识乃至法识。由眼等是彼依故。约根说识。复次偈曰。由彼不共因。故约根说识。释曰。云何不共因。此眼根不得为余识依色可。得为意识缘缘。及为他眼识境。乃至身亦尔。由识依止。及由不共因。是故约根说识。不约色等。譬如鼓声麦芽。若人在此身中。由眼见色。是身眼色识。为是一地。为是别地。一切皆异。若<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>欲界。由自地眼见自地色。此四种同在自地。若此人由初定眼见自地色。身及色俱在自地。眼及识属初定。若见初定色。则三种属初定。若由二定眼见自地色。身及色在自地。眼属二定。识属初定。若见初定色。色及识属初定。身在自地。眼属二定。若见二定色。眼及色属二定。身在自地。识属初定。如此由三定四定。眼若见自地及下地色。应如理推合。若人生在初定地。由自地眼见自地色。此四皆属自地。若见下地色。则三种在自地。若由二定眼见自地色。则三种在自地。若见欲界色。身及识在自地。色在下界。眼属二定。若见二定色。眼及色属二定。余二在自地。由三定等眼。亦应如理推合。若生二定等地。由自地眼若见自他地色。亦应如理推合。此中是决判。偈曰。眼无下身义。释曰。身眼色有五地。谓欲界地乃至第四定地。眼识有二地。谓欲界及初定。此中随身地。眼根或等地或上地。定无下地。随眼根地。色或等地或下地。是眼境界。偈曰。上色非下境。释曰。未曾有上地。色下地眼能见。偈曰。识。释曰。识。不得在眼上。譬如色。偈曰。于此色遍于身二一切。释曰于此。谓于前所说眼识。一切色是其境界。或上或下或等。二谓识及色。于身此二一切有。如广说眼根。应知如此。偈曰。耳亦尔。释曰耳无下身。义上声非下境。识于此声遍于身二一切。如理广说。应知如眼。偈曰。余三。一切属自地。释曰。鼻舌身界。身自尘及识。皆属自地。如此已通立无差别。后为简别。更立别言。偈曰。身识下自地。释曰。身在欲界。触亦尔。此三恒在自地。身识有处属自地。如人生欲界及初定。有处属下地。如人生二定。偈曰。意根地不定。释曰。有时意根与身意识法。同在一地。有时上下为地。于五地身意等属一切地。谓入观时。及受生时。如此道理。于分别三摩跋提品中当广说。为离繁重言故。不于此品中说。何以故。功多用少故。前来往复。与随所欲说相关竟。今应思量此义。于十八界及六识界。何界所知。何识能知。偈曰。五外二所知。释曰。色声香味触界。如其次第。眼耳鼻舌身识所识。复为意识所知。此外尘随一二识所知。余十三界非五识境故。唯一意识界所知。此是义至所显。十八界中几界<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>几界<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。无一界具足常住。虽尔偈曰。常住法无为。释曰无为是法界一分。即是常住。余界皆是无常。几界是根几界非根。偈曰。法界半名根。及十二我依。释曰。于经中说。根有二十二。何者是耶。眼根耳根鼻根舌根身根意根。女根男根。命根乐根苦根喜根忧根舍根。信根<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>根念根定根慧根。未知欲知根。知根。知已根。阿毗达磨师破。安立六内入次第。次命根后说意根。能缘境故。此中法界半者。命等十一根。是三根分法界一分故。十二我依者。眼等五根。如自名所说。七心界名意根。女根男根。是身界一分。后当说。所余五界。并法界一分。成立非根</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第三卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第三卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别根品之二</p><p>复次。此义应当思量。是诸有为法。如彼自相。更互不同。为如此彼生亦不同。为有诸法决定俱生。亦有。何以故。一切法有五品。一色二心三心法四不相应五无为。此中<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>无生。有色诸法今当决判。偈曰。于欲界八物。无声根邻虚。释曰。极细色聚说名邻虚。欲令知无余物细于彼者。此邻虚若在欲界。离声亦非根。则八物俱生。随一不减。八物谓地等四大及四大所造色香味触。若有根邻虚无声。则九物俱生。或十物俱生。此中偈曰。有身根九物。释曰。若身根邻虚。此中有九物。八如前。身根为第九。偈曰。十物有余根。释曰。此邻虚中若有余根则有十物。九如前。眼等五根中随一为第十。此邻虚若有声俱生。如次第九物十物十一物俱生。何以故。有声与根不相离。谓执依四大为因声。若四大不相离。云何有聚。或见唯坚实。或见唯流湿。或见唯暖热。或见唯轻动。此聚中随一偏多。或功力最胜故。见一明了。譬如针锋及绵触。又如麨盐末味。若尔云何。于彼应知所余亦有。由事故可知。事谓持摄熟引。复次余师说。若得别缘。坚等成软湿等故。于水中由极冷故。或得热触。虽不相离。有冷胜别德。如声及受有胜别德。复有余师说。于聚中由种子彼有。不由自体相。如经言。于木聚中有种种诸界。由此言故知。由种子故有。若尔云何。于风知有显色。此义但可信不可比。何以故。由相杂能持香故。于风四尘不定故。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>香味不有。此义于前已说。是故由此说。于色界有别邻虚。复有由此说邻虚。有六物七物八物。此义已显。不须更说。此中为约物说物。为约入说物。若尔何为。若约物说物。此说则少。谓八物九物十物。何以故。此中必有形色。是邻虚滋长故。轻重触随一。滑涩触随一。有处有冷触。有处有饥渴触。若约入说物。此说则多。谓八物等。何以故。应但说四物。四大亦是触入。是义不然。此中有处约物说物。谓所依止物。有处约入说物。谓能依止物。虽复如此。四大物转成多。能依止物随一依具四大故。此中复有执取物类为物。虽别类四大。不过<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。何须作此功用为分别说。如此义语言如意生起。唯义应思量。说色决定俱起已。所余品生起今当说。此中偈曰。心心法必俱。释曰。何以故。此心及心法。更互相离则不得生。偈曰。一切共行相。释曰。必言流。不但心及心法必定俱起。一切有为中。若有应生。或色心及心法等。是名一切。若起必共有为相俱起。偈曰。与得。释曰。若<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>名是法。必与至得俱起。余法不尔。是故别立是法所说名心法。何者是耶。偈曰。心法五。大地等别故。释曰。心法有五品。一大地。二善大地。三惑大地。四恶大地。五小分惑地。何法名地。是所行处。若法此法行处。是法说为此法地。此中诸法地大故名大地。若法于一切心有。何法于一切心有。偈曰。受作意想欲。触慧念思惟。相了定十法。遍于一切心。释曰。彼说此十法。于一切心<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>皆聚集生。此中受谓三种。随领乐苦非乐非苦。作意谓心故为事。想谓心执境差别相。欲谓求作。触谓根尘识和合所生异法。慧谓<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。即是择法。念谓不忘所缘境。思惟谓心<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>。相了谓于所缘相有法能令心明了。定谓心一心。心法差别最细难可分别。于相续尚难知。何况刹那中。有色药草。有多种味。于中有药其味差别。可以根证。亦难分别。何况此法无色。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>所了。是诸法善为大地。说名善大地。若诸法恒于<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>中起。何者为诸法。偈曰。信不放逸安。舍羞及惭愧。二根非逼恼。<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>恒于善。释曰。如是等法。恒于善心中起。此中信谓心澄净。有余师说。于谛实业果中心决了故名信。不放逸谓修习善法。有何修习。异于善法。恒在善法。名不放逸。于余部经中说。是心护名不放逸。安谓心于事有能。此义可不如此。于余经说。身于事有能名安。非不说如身受。应知此亦尔。若尔云何。于助觉立为分。何以故。于中是身于事有能。说名身安应知。若尔云何说此为觉分。由随顺觉分故。得觉分名。何以故。此身安能引心安觉分令生故。于余处曾见有。如此说不曾有。犹如经言。喜及助喜法。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说名喜觉分。复有别说。嗔及嗔因名害盖。复有<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>正思惟正精进。此三说名般若分。此资粮由随顺。故得彼名。如此身安随顺心安觉分。故得彼名。舍谓心平等。无所偏对。今此言云何相应。何者前说。思惟于心回向为体。今说舍于心无回向为体。此言云何相应。为前不说耶。谓心法义理难知。有难知后方可知。此最难可知。谓于相违立不相违。有余处回向。有余处不回向。此中有何相违。若尔一切相应法。不应共缘一境。如此种类。所余诸法。此中应来。此法道理。汝等必应须知。羞及惭愧后当释。二根谓无贪无嗔二种善根。无痴亦是善根。此善根以智慧为体。前已立为大地故。于善大地中不复重说。非逼恼谓不欲违损他。精进谓勇猛。说十善大地已。是地大故名大地。惑是彼大地故。说彼为惑大地。是诸法恒于染污心起。何者为诸法。偈曰。痴放逸<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。无信无安掉。恒在染。释曰。此中痴谓无明。无智无显。放逸谓不修习善法。此是修习善法对治懈怠谓心无胜能。无信谓心无澄净。此是信对治法。无安谓身重心重。身心于事无能阿毗达磨藏中说。无安有二种。谓身无安心无安。云何心法。说名身法。如说受为身受。掉谓心不静。如此六法。是名染污大地。于阿毗达磨藏中。不说十法为惑大地耶。彼中亦不说无安。何者为十。无信。懈怠。忘念。心乱。无明。不了别。不正思惟。邪相了。掉。放逸。天爱汝知至不知术。此中何者为术忘念。心乱。不了别。不正思惟。邪相了。此法已属大地。不可重安立为惑大地。如无痴于善大地。彼亦如此。若念彼染污。说为忘念。定被染污。说为心乱。所余亦尔。是故作如此说。是大地法可即立为惑大地不。此中有四句。第一句谓受想作意欲触第二句。谓无信懈怠无明掉放逸。第三句。谓念等五法。第四句。谓除前三句。所余诸法。复有诸师。欲心乱异邪定。于彼所说。四句异此。有余师执无安与一切惑相应。于惑大地中不说。于谁有失。彼答应说。由随顺定故。是故不说。何以故。若人无安为行。修观速能得定。掉行人不尔。以无安为行。非掉为行。此人何相。以掉为行。非无安为行。此人何相。何以故。此二法随便不舍。共生事故。虽然此二法。于人随重成此人行。是故立六法为惑大地。何以故。此六法恒于染污心起。余处则不起。偈曰。若恶。及无羞无惭。释曰。于一切恶心。无羞及无惭。恒生起故。立此二法为恶大地。此二<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>后当说。偈曰。嫌恨谄嫉妒。佷覆及悭吝。诳醉并逼恼。是十小惑地。释曰。以小惑为彼地故。说彼为小惑地。唯与<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭。依心地所起。无明相应故。此十惑于小分<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>中当释。说五品心法已。有余心法不定。谓觉观恶作睡等。于中应说。何处心几心法。必定俱起。于欲界中有五种心。善心有一。恶心有二。谓独行及与余惑相应。无记心有二。谓有覆无覆此中欲界心。必有觉有观。是故于中。偈曰。有觉有观故。于欲界善心。二十二心法。释曰。必定俱起。何者二十二。十大地。十善大地。并觉观。偈曰。或处长恶作。释曰。非于一切善心皆有恶作。是处若有。于中为长。则心法成二十三。何法名恶作。于所作恶心生后燋。此心法缘恶作起。故名恶作。此法即是后燋。譬如缘空为境<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>门说名空解脱门。又如无贪观缘不净相起说名不净观。于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>亦曾见此事。由处说有处。如言一切县郡来。一切土地来。此恶作是后燋处。或于果假立因名。如说六种触入名宿业。若尔此后燋。若缘所未作事。云何名恶作。于未作假立作名。如经言。若我不作非我好作。何者后燋名善。由不作善及已作恶故后生燋。是善后燋。翻此名恶后燋。此二各缘二境起。偈曰。于独行恶心。见相应二十。释曰。于独行欲界恶心。有二十心法俱起。谓十大地。六惑大地。二恶大地。并觉观。独行心者。此中唯一独行无明。无有欲等余惑。不但独行恶心。若与见相应恶心中。亦有二十心法。如独行恶心中诸法。若尔由长见故。云何不立二十一。不然。是大地所摄智慧差别说名见故。此中与见相应恶心。于此心中若有邪见见取戒执取。偈曰。与四惑嫌等。恶作二十一。释曰。此恶心与四惑相应。谓欲嗔慢疑。此心中有二十一心法。此惑随一。并独行恶心中所说二十。若与嫌等小分惑相应心中。亦有二十一心法。小惑随一并前二十。若与恶作相应心中。亦有二十一心法。恶作为一。并前二十。若略说于独行恶心及与见相应恶心。但有二十。若与余惑及小分惑相应。有二十一。偈曰。有覆心十八。释曰。于欲界与身见边见相应。名有覆无记。此中有十八心法。大地十。惑大地六。并觉观。此二见如前所释故无长。偈曰。余无记十二。释曰。与有覆无记异。即是无覆无记。此中有十二心法。大地十。并觉观。罽宾国外诸师欲恶作无记。于此诸师。若心与恶作相应。有十三心法。偈曰。睡遍不违故。若有唯此长。释曰。睡与如前所说一切心法不相违。由是<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记性故。于五品心中随若有此应知为长。若二十二。并睡成二十三。若二十三。并睡成二十四。如此等于欲界中。是所说心法定量。偈曰。恶作睡诸恶。于初定皆无。释曰。于如前所说中。恶作及睡。初定一向无诸恶随一。譬如嗔离谄醉诳。谓嫌等及无惭无羞。悉无所余一切皆有此诸法。于初定不有。偈曰。于中定无觉。释曰。此法及觉。于中间定。亦如此无。所余亦如此有。偈曰。过此又无观。释曰。度中间定以上。于第二定等乃至<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。如所遮皆无观。及谄诳亦无。所余皆有。何以故。此谄曲。佛说乃至极大梵处与梵众相应故。上去则无。此梵王于自大集中。阿输实<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>问。是四大何处灭无余。梵王不解。作诡言答。我是大梵<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。作者化者起者。一切所有我为本因。说随地如心法数量义已。如毗婆沙中所立。心法及异相今当说。无羞与无惭异相云何。偈曰。无羞不重德。释曰。于<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>及有德人不尊重于他无自在心。无敬畏心。无随属他心。说名无羞。此心对治尊重。偈曰。非赞不见怖。无惭。释曰。非赞谓若事善人所诃。是名非赞。于中不见怖。是名无惭。此中怖谓非所爱果。能生怖畏故。云何得知。如此为不见怖名不见怖。为见不怖名不见怖。若尔何为。若不见怖应成无明若见不怖应成智慧。不见怖者。我不说不见。亦不说见。何者为是。有小惑为此二因。说名无惭。有余师说。观自身由过失不耻名无羞。观他名无惭。若尔二观一时云何得成。不说如此一时观自观他。何者有非耻类。若观自身生起。说名无羞。有非耻类。若观他生起。说名无惭。翻此名惭羞。由第一解。显有尊重有自在有敬畏有随属名有羞。于非赞见有怖名有惭。由第二解。显观自他生起耻心说名惭羞。爱乐及信此二异相云何。偈曰。乐名信。释曰。爱乐有二种。一有染污。一无染污。此中若有染污名爱乐。如于妻子等。若无染污名信。如于自师尊长及有德人处有信非爱乐。是信缘苦集起。有爱乐非信。谓有染污爱乐。有具二。谓缘灭道生信。有非二。谓除前三句。有余师说。信谓于德决期。以此为先后则生爱。故信非爱。复有余师说。偈曰。重羞。释曰。如前说。以重为羞此何相。不即重名羞。于他起自在心名重。以此为先后则生耻。说耻为羞。是故尊重异羞。偈曰。欲色有。释曰。于无色界无爱乐及尊重。此义云何。信及羞是善大地故。于彼既有前二。云何无羞。信有二种。一信法。二信人。尊重亦尔。信及羞。若缘人起。彼处则无。此二名爱及重。觉与观异相云何。偈曰。觉观谓粗细。释曰。粗细属何法。谓心粗细。心粗名觉。心细名观。此二于一心云何俱起。此中有余师说。譬如酥浮水上。于上为日光所触。非凝非释。如此由觉观相应故。心不过细。亦不过粗。是故此二于一心中俱有事用。若尔此觉观。但是粗细因。非自粗细。譬如水及日光。是酥凝释因。非自凝释。粗细由观他成。由地品类差别故。乃至有顶应有觉观。复次同类生以粗细为差别。此义不应成。是故不可由粗细分别觉观性异。有余师说。言语行名觉观。如经言。已觉已观方有言说非未觉未观。此中若粗名觉。若细名观。若于一心中。有别法名粗。有别法名细。此有何妨无妨。若有种类差别于一生类中。下上二品不得俱起。种类亦有异。若尔汝今应说。此不可说。是故由上下品种类异。则可显示若尔则不可显示。各各自种类有上下故。有余师说。觉观于一心不并起。若尔云何。初定说具五分。约地说五分。不由刹那。慢与醉异相云何。偈曰。心高说为慢。醉爱着自法。心起变异乱。释曰。由随类所分别胜德。心高于他说名慢。醉者此人于自法起爱着。其心乱味。如饮酒惛迷。心<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>差别。从贪欲生说名醉。余师说如此。说心法与心共别异已。如是等法。佛世尊假立众名。于<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>中。由此说教故。云何释异。偈曰。心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>一义。释曰。心以增长为义。能解故名意。能别故名识。善恶诸界所增长故名心。或能增长彼故名心。此心为他作依止说名意。若能依止说名识。如心意识三名一义如此。偈曰。心及余心法。有依境界相。相应。释曰。此四种名亦通一义。此心及心法。或说有依由依根起故。或说有境。皆能取境故。或说有相。是所缘境随类差别能分别故。或说相应。平等聚集故。云何平等聚集名相应。偈曰。义有五。释曰。有五种平等类为相应义。谓依止境界取相时物平等等。何法为物平等。如心一物。如此心法亦各各一物。说心及心法广义及差别义已。偈曰。不相应诸行。至非至同分。无想处二定。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>及诸相。名聚等。释曰。如此等有为法。与心不相应。非是色性。说名不相应行。偈曰。于中。至得及同随。释曰。得有二种。谓未至得已失得。与正得同随。翻此名非至。义至自成。此至非至属何法。偈曰。至非至属带。自相续。释曰。若法堕他相续。无至非至。何以故。无众生与他法相应。及与非堕相续法相应。何以故。无有众生。与非众生数法相应故。于有为法如此决定。若于无为法至非至云何。偈曰。二灭。释曰。一切众生皆与非择灭得及同随相应是。故于阿毗达磨藏说如此言。何者与无流法相应。答一切众生。亦与择灭相应。除具缚及住初刹那人。所余一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。及所余凡夫。皆与择灭相应。无众生与<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>相应。于虚空何故无非至。若法无至。非至亦无。所谓别法。有别法名至非至。此执从何生。从经生。何以故。于经中说。是十种无学法。由生由得由同随。是圣人与五分相离。若尔与非众生数法至得亦应成。何以故。由经言。比丘。转轮王与七宝相应。谓得同随。此经中说自在名得同随。何以故。是王于宝有自在。谓如意作。于转轮王经。汝执自在名得同随。于彼经汝执别物名得同随。此执何<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>成。此中何执非道理。是非道理。此至非至自性不可知譬如色声等又如欲嗔等。其事亦不可知。譬如眼耳等。离实物法故。立此法为有。则非道理。若汝执此至是诸法生因。于无为此法应无。若法未至及已舍。由易地及离欲。此法云何更生。若汝说共有至得为生因今立生相。复何所作及生生。若此即是生因。具缚众生下中上惑生差别。不应有至。无差别故。若由此法余法。有差别生可从其起。是故至非生因。有何人说此言。谓至为生因。汝说云何成立差别因。何以故。此至若无。圣人及凡夫。若同起世心。此人是圣。此人是凡。此差别不可成立。已灭未灭惑有差别故。圣凡差别自成。是义不然。何以故。此差别云何成。此人惑已灭。此人惑未灭。若信有至。如此等事则成。由至非至永灭离故。此事由依止差别故成。诸圣人依止。由见道修道胜力故。如此回转。如不应更生二道所灭诸惑。譬如火所燋种子。依止亦尔。不更为惑种子故说惑已灭。惑由世间道。损坏惑种子相续中。说惑已灭。翻此名未灭。若法未灭。与此法至得相应。若此法已灭。则无至得相应。此言唯是假说善法有二种。有不由功力生起有由功力生起。是法说名生得及修得。此中不由功力所生起善。于依止中善种子不破坏故。说与至得相应。由种子破坏故。说无至得相应。如断善根人。此人相续中。由邪见应知善种子已破坏。于彼相续中。善法种子非永除灭。若善法由功力所生起。由彼正生故。于彼生中相续自在无碍故。说与彼相应。是故此种子。未拔除非破坏。增长自在时。此种子得至得名。无别物。何法名种子。是名色于生果有能。或现时或当时。由相续转异类胜故。何法名转异。是相续差别。谓前后不同。何法名相续。生成<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。三世有为法。何者为胜类与果无间有生果能。有处说如此。若人与贪欲同随。则无复能修习<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>。此经中安受贪爱说名同随。何以故。此人随安受贪爱时量。无有功能。修习四念处。如此至得同随一切种皆是假名法。非实有物翻此名非至得同随。毗婆沙师说此。至非至实是有物。何以故。我等悉檀说如此。彼说此至。偈曰。于三世三种。释曰。过去诸法。有过去至。有未来至。有现在至。如是未来现在诸法。各有三至。偈曰。于善等善等。释曰。若法善恶无记性。至亦次第随法同善恶无记性。偈曰。随法界同界。释曰。若法随与界相应。至得与法同界。若法在欲色无色界。彼至得亦同。在欲色无色界。偈曰。离<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>四种。释曰。离三界法。谓一切无流法。此无流法至得。若略摄有四种。谓三界相应。及无流界相应此中非择灭至得有三界。择灭至得。或在色无色界及无流界。道谛至得。唯是无流故。此至得若略摄。成有四种。有学法至得是有学。无学法至得是无学。非学非无学法至得有差别。偈曰。非学无学三。释曰。非学非无学法。谓有流及无为。由有学等差别。此法至得成三种有流至得。谓非学非无学法。及非圣人所得非择灭择灭至得。是择灭学无学道所得。此至得亦是学无学。见修二道所应灭惑至得。次第应为见修二道所破。若非二道所灭法至得。则有差别。今当说。偈曰。非所灭二种。释曰。非所灭法。谓无流法。此中非择灭至得。唯修道所断。及非圣人所得择灭至得。圣人所得择灭至得。唯是无流故非所灭。道谛至得亦如此。前说于三世三种。此是总说。为简别此总说故说此偈。偈曰。无记至俱起。释曰。若无覆无记法至得。但有现在。无过去未来。此法力弱故。此法若过去。至得则过去。此法若现在。至得则现在。一切无覆无记至得。皆如此耶。偈曰。除二通变化。释曰。二通慧是无记。变化亦尔。除此三所余悉同。此三势力强故。由加行胜类成就故。故此至得通三世。工巧处无记。及别威仪无记。极所数习。有余师欲此至得同三世。唯无覆无记至得但现在耶。偈曰。又覆无记色。释曰。有覆无记有教色至得但现在。何以故。若最上品不能起长无教色故。是故力弱。如无记法至得有差别。善恶法至得。为有如此差别不。答有。偈曰。欲界色无前。释曰。于欲界色过去一向无至得。现在及未来皆有至得。如至得非至得。亦有如此差别不。答无。何者。偈曰。非至无污记。释曰。一切非至。唯无覆无记。约世差别。云何。偈曰。去来世三种。释曰。现世法非至得但现世。若过去未来法非至得。各有三世。偈曰。欲等无垢有。释曰。亦有三种非至。欲界法非至得。或在欲界。或在色无色界。如此色界无色界无流界。非至得亦尔。无有非至得是无流。何故如此。偈曰。许圣道非至。凡夫性。释曰。如发慧阿毗达磨藏说。何法名凡夫性。非至得圣法。非至得即是非至。若非至圣法。是凡夫性。凡夫性不应成无流。不得何圣法。一切圣法不别说故。非至得者。离实有得。若不尔。佛世尊与声闻独觉性不相应故。应不成圣。若尔应作决定说。定非至得圣法。不应说定言。何以故。是直文句能为决定。譬如说人食水食风。有余师说。不得苦法智忍及俱起法。名凡夫性。亦不可说由舍此还成凡夫。何以故。此苦法智忍。及俱起法。非至得永灭除故。若尔苦法智忍。及俱起法。亦有三性。非至得何法。一切。若尔如前难过失更至亦如前救。若尔立文句之功此复何用。若立如此则为最胜。如经部师所说。经部执云何。若未曾起圣法相续。名凡夫性。复次此非至云何。灭是法是非至得。偈曰。由至度余地则舍。释曰。如非至得圣道名凡夫性。由至得圣道。即舍凡夫性。或由度余地。所余诸法非至。应如此思。非至非至若生起。非至至若断。说舍非至。非至及至。为更有至非至不。此二各各有二。若尔于至非至。有无穷过失。无无穷过失。更互相应。故法若生以自体为第三生。第一本法。第二本法至得。第三至得至得。此中由至得生相续。与本法相应。及与至得至得相应。由至得至得生相续。但与至得相应。若作如此是本法以自体为第三。若善若染污。于第二刹那有三至得生。复有三同随至得俱生。合成六。于第三刹那第一第二刹那所生诸法。有九大至得。共同随至得。成十八物。如此后后增长生故。诸至得流。一切过去未来。大惑小惑刹那。一切生得善刹那。共相应及俱生法至得。无始无终轮转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>众生中。随一众生。刹那刹那起成无边物。随一一诸众生身。相续刹那亦如此。今诸至得。最大集会希有生起。唯有一德。谓不相碍。故得处所。若不尔。于一人虚空亦非其器。何况第二。何法名同分。偈曰。同分众生等。释曰。有物名同分。谓众生等类。于阿毗达磨藏说此。名谓聚同分。此有不异异。不异谓一切众生与众生同分。随一众生同分。于一切众生悉有故。异谓是一切众生同分。由界地道杂生男女优婆塞比丘有学无学等差别。各不相应故。亦有法同分。由阴入界等故。不异如前。若无聚同分。非别有实物。于众生由种种别类更互不同。此亦众生。彼亦众生。如此同智。及同言说。不应得成。阴等同智及同言说亦尔。有退亦生。不舍聚同分。不得同分。不立此成四句。第一句者。从此退于中更受生。第二句者。入正定聚。何以故。此人舍凡夫聚同分。得圣人聚同分。第三句者。由度余道。第四句者。除前三句。若有实物。名凡夫同分。何用别立凡夫性。何以故。若离人同分。无别人性可分别。复次世间亦不曾见有人同分法。以无色故。智慧亦不能分别众生生类不异。但许如此众生同分。若实有。于中何所能作。复次云何不许非众生有同分。如<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>谷麦豆波那婆庵罗铁金等。自性类等故。如此等同分更互有异。云何可说不异同分。若尔鞞世师外道。由此执得显成。何以故。此执即是鞞世师悉檀。彼立六句义中。此执是同异句义。由此法于不同物中生起同智。说名同异。毗婆沙师说。彼执有异。彼谓同异唯是一物遍在多物。众生同分则不尔。若显成若不显成。实有同分。由经所证。佛世尊说。若此人还成此类。谓于人聚同分实有如此说。非说别有物。若尔此经所显同分是何法。是有为法。如此生起。于中假说人天等。如说舍利谷等同分。如此义非毗婆沙师所赞许。何法名无想有。偈曰。无想于彼天。能灭心心法。释曰。于无想众生天中受生。有法能遮灭彼心及心法。此说名无想有。由此法心及心法。于未来中暂时不起。于生无有功能。如堰遏江水。此法一向。偈曰。<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。释曰。此是何业果报。无想定业于何处众生有此无想天。偈曰。诸广果。释曰。有诸天名广果。于彼一处有众生名无想天。如初定中间。彼众生为一向无想。为或暂一时有想故名无想。有时有想。谓受生时退堕时。于长时起想故。彼众生从此处方退堕。经言如此。于彼众生如久时熟眠觉起。即便退堕。必欲界受生。更无余处。由宿世定业功能尽故。不能生长未曾有业故。譬如放箭速疾势尽故即便堕地。若众生必应生彼天。此众生定有欲界后报业。譬如北鸠娄必有生天后报业。阿毗达磨藏说。何者为二三摩跋提无想定及灭想受定。何法名无想定。如前所说。无想有能灭心心法偈曰。如此无想定。释曰。无想观行人。定名无想定。又此定无想。名无想定。此定能遮灭心及心法。是如此言所引。此定在何处。偈曰。后定。释曰。最后定。谓第四定最上品。此定于中相应。非于余地何用修此定。偈曰。欲解脱。释曰。诸外观行人。执此定为决定出离。是故由求解脱故。修习此定。无想有是果报故。成无记法此定偈曰。善。释曰。此无想定一向是。善此定于无想天<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>为果报。若善于三报位中是何位。偈曰。必有生报。释曰。此定唯生报。非现报及后报。亦非不定报。若人已生起此定。后更退失。彼说此人必还更得受无想天生。是故若人得此定。必不得入正定聚。此定但凡夫所得。偈曰。非圣。释曰。圣人不得修习此定。彼见此定如见深坑。何以故。若人于此定起解脱心乃修此定。圣人于生死不起解脱心。圣人若已得第四定。为于过去未来得此定。不犹如诸定非圣亦不得。何以故。此定若已曾数数所习。大功用所成故。又<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>故。偈曰。一世得。释曰。但一时得。谓现在得。如波罗提木叉戒。得此定于第二刹那有过去至得。乃至未舍此定。无心故于未来无修。今灭心定其相云何。偈曰。灭定亦如此。释曰。如无想定。无心定亦如此。如此言引何义。能灭心及心法。此二定异相云何。此定偈曰。为静住。释曰。寂静住想为思惟先故。圣人修此定。彼定解脱想为思惟先。彼与第四定同地。此定偈曰。有顶。释曰。此定以非想非非想为地。此定偈曰。善。释曰。此定必是善。无染污故。非无记。虽复是善。偈曰二报不定。释曰。此定由二因有二报。或生报或后报。有时于果报不定有时无果报。若得定人般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。此定于有顶以四阴为果报。此定一向。偈曰。唯圣。释曰。但圣人能得此定非凡夫。何以故。凡夫不能得修此定。怖畏断绝故。又由圣道力所生起故。云何如此。于中生现世涅槃愿乐故。此定虽是圣人所得。非离欲所得云何得。偈曰。由修得。释曰。此定由修习力得。非过去得。未来不可修。由心力强故成。若尔于佛世尊。亦由修习得耶不。云何。偈曰。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>得。释曰。诸佛世尊。与尽智同时得此定。何以故。诸佛无有一德由功用得。由一切圆德现前。皆随佛欲成故。是故一切功德。于佛悉是离欲所得。若尔先未生灭心定。于尽智时。佛世尊云何成俱解脱人。得成如于已生。此中得自在故。西国诸师说。菩萨在有学位。先已生此定。后方得菩提。云何不许如此。若尔与大德优波掘多所造道理足论。彼顺成证。彼论说。先已起灭想受定。后方得尽智。应说如来如此。偈曰。非前。释曰。罽宾国毗婆沙师说。先入无心定后得尽智。是义不然。何以故偈曰。三十四念得故。释曰。彼说三十四心刹那中菩萨得无上菩提。在<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>观有十六心刹那。于离欲有顶有十八心刹那。为除有顶九分惑。由修九品次第道九品解脱道故。合此心足三十四刹那。菩萨先已离欲无所有处。后方入正定聚。下地诸惑不复更除灭。是故于此中间不同类心不生起故。无道理得入灭心定。此何所为。若于中间不同类心生起现前。有更起心。诸菩萨无更起心。实如此无更起心。不由无流道不更起。若尔立不更起。云何佛说。我未坏金刚座。乃至未得诸流尽。如此意无改故。是故说无更起。于一坐时一切事究竟故。此义如前。是外国诸师所说。若此二定。多种别异相。偈曰。二依欲色。释曰。此二定。谓无想定无心定。依欲色二界修得。若人不许于色界修得无色定。是伽兰他。于此人相违。或时色有不成有。此中有五种判。一色界众生。二有想诸天。住于不同分心。三入无想定。四入无心定。五无想诸天。已得无想天生。各是彼有。由此文句。是故此二定。决定依止欲色二界。此中是二定差别。偈曰。灭定初人道。释曰。此灭心定。初于人道中修得已。昔经退人后方于色界修得。于灭心定为退不说有。若不尔。则与大德优陀夷经相违经言净命。有诸比丘。在正法内。具清净戒。具清净定。具清净慧。是人数数入观。修灭想受定。数数出观。则有是处。应如实知。此人于现法。先若不得知已根。及于临死时。由身破灭故。过段食诸天。随一意生诸天中。或于中受生。此人于中生已。数数入无心定观。不更出此定。无有是处。应如实知。此中意生天者。世尊说是色界。是定与有顶相应。若人得此定不退。云何得于色界受生。有余部执。此灭心定。以第四定为地。于此部若离退堕。是义亦成。是义不得成。谓无心定。以第四定为地。何以故。由经言故。经说有九种次第定。若有如此决定超越定云何得成此定次第决定。约初学人。若观行人。已至定自在位超越亦得。修如此二定。约地有差别。一以第四定为地。一以有顶为地。复由加行有异。谓解脱静住想。为思惟先所修习故。复由相续有异。谓生在凡夫圣人相续中故。复由果有异。谓无想有及有顶为果故。复由受报有异。谓定受报不定受报。及二受报故。复由初生有异。谓于二界。及于人道初生故。云何此二定。同灭离心及心法为自性。说第一为无想定。说第二为灭想受定。由违逆想违逆想受故。此二修观得成。譬如于他心通中亦知他受等。但说名知他心通。今云何从久久时灭心后更生心。毗婆沙师说。虽复过去。以是有故。是故前灭成后次第缘。有余师说。云何于无色界生众生。色久久时断尽。后时更生色。此色定从心生。不从色生。若尔心亦从此有根身更生。不从心生。何以故。此二更互为种子。谓心及有根身。宿旧诸师皆说如此。大德婆须蜜多罗。于问中说。若人执灭心定无心。此人则有如此失。我今执灭心定有心。大德瞿沙说。此执不然。若识有从三和合有触。佛世尊说。依触生受想作意等。是故于此定中想受等法不应灭。若汝言佛世尊说缘受生爱。今有受于阿罗汉爱不生。如此于无心定虽复有触。受想等不生。是义不然。有简别故。缘无明触所生受则贪爱生起。于生受中不简别触。是故此义不平。是故毗婆沙师说。灭想受三摩跋提。必定无心。若无心云何成三摩跋提。由成立四大平等义。复由三摩跋提心故至此定。此二定为由实物有。为由假名有。彼说实有物。由能遮碍心相续生故。是义不然。由三摩跋提心此心。相续断故。三摩跋提心与余心相违生起。由此心生起。于中间时唯余心不生起为相故。无有别物。此定能引与余识相违。相续为依止故。名三摩跋提。此定<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>心法不起为相若观行人出定。此定先无后无故。此定假说名有为。复次此定唯能令依止如此平等故。名三摩跋提。应知无想有亦如此。此定但心于此位中与心生起相违。此心唯不起。假说为无想。有毗婆沙师不说如此。彼执实有物</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第四卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第四卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别根品之三</p><p>说二定已。何法为命。偈曰。寿即命。释曰。云何如此。阿毗达磨藏中说。何者为命根。谓<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>寿。此非可知。此寿是何法。偈曰。能持身暖及<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。释曰。此偈是佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所说。寿暖及意识。此三舍身时。所舍身即眠。如枯木无意是故此法能持暖及识。为相续住因。说名为寿。若尔有何别法。能持此寿。此暖及识。还持此寿。若尔此三法。互相持起故。于中何法先谢。由此法谢余法后谢。若执如此。应立三法恒起无谢。是义不然。此寿以业为持。如业所引。相续随生住故。若尔是暖及识。何故不许以业为持。勿执诸识从始至终皆是<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。若尔此暖应以业为持。此识应以暖为持。如此于<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>识应无持。以暖触无故。此识于彼以业为持。君不可随意作。或说暖为识持。或说业为识持。汝前已许何所许。勿执诸识从始至终皆是果报。若尔是故唯有寿于二为持。我亦说此不无但非别实物。若尔汝立寿是何法是。三界业所引聚同分住时。何以故。此聚同分。速疾随宿业所作。谓应住如量时。是聚同分。得如此时住。说名为寿。譬如稻等所引熟时。又如放箭所引住时。若有人执。有别德名速疾。生在箭上。由随此德故。箭行乃至堕。时于此人是德由唯一故。及无碍故。于余处急缓至时。差别不应成。若汝说由风此德有碍。是义不然。放时即应堕。或无堕时。风不异故。毗婆沙师强说如此。此寿有实别物。今为但由寿尽死。为别由余法死。于假名论中说。有死由寿尽死由福尽。此义有四句。第一句者。感<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>报业尽故。第二句者。感富乐报业尽故。第三句者。二业俱尽故。第四句者。由不离不平等事故。若寿命已尽福业尽。于死有何能。于福业尽死中。寿命尽亦尔。是故于二尽死。是名俱尽死。又于发慧论中说。为应说寿随相续起。为一起便住。彼答欲界<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。不入无想定<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>定观。应说寿随相续起。若入二定观。及色无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>众生。应说寿一起便住。此答显何义。若由依止伤害。寿亦被伤害。此寿随相续起。此是第一句义。若寿依止不可伤害。如起便住。此是第二句义。第一句显有障碍。第二句显无障碍。罽宾国师判义如此。是故有夭抂死。于经中说。众生所得身有四种。一有众生。身于中自害得行。他害不得行。此义有四句。唯自害得<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。于欲界中如戏忘诸天恨污诸天。此二天由重喜恨。从此处退堕。不由余缘。说诸佛亦尔。由自死故。唯他害得行者。如在胎卵中身。二俱害者。于欲界多。非二害者一切中阴众生。色界无色界欲界随一。如<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>比鸠娄。在见谛道慈悲灭心定无想定观。王仙佛便佛所记。达寐罗郁多罗强耆罗长者。儿耶舍俱摩罗时婆等人。一切。后生菩萨母。菩萨在胎时。转轮王。转轮王母。王在胎时。于此中俱非二害。复次于经中云何说此言。婆檀多于何众生。自害不行。他害亦不行。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗非想非非想受生众生。诸师解。于余定及余无色处。自害谓依自地圣道。他害谓依上地近分定。于中无此二。若尔依余地圣道。于彼应成他害。若不尔其义云何。或由取后兼显前。或由取前兼显后。取前兼显后者。如经言。如梵众天是第一乐生天。取后兼显前者。如经言。如光曜天是第二乐生天。于彼经如言显譬喻义。是故于彼经此义可然。谓取前兼后。取后兼前。何以故。是譬喻法。由显一类。所余类例可知。此舍利弗问中。无有如言。是故不可引彼经为此经证。若汝执显譬喻。是如言义。则此经中。不应有如言。经言有诸众生。身有别异。想有别异。如人及随一诸天。是故应知。如言唯为显不为譬。勿过多言。说寿命已。偈曰。复有有为相。生老住<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。释曰。有为法唯此四相。若于法中有此四相。应知此法是有为。与前相翻则是无为。此中生者能生此法。住者能安立此法。老者能变异此法。无常者能灭此法。为不如此耶。如经言。有三种有为法有为相。若具言。于经中应说第四相。此经中不说。何相谓住。若尔此经中说何法为住异。此住异是老别名。譬如起是生别名。灭是无常别名。住异亦尔。是老别名。若诸法能起。唯为有为法行于世。此法于经中说是有为相。为起他厌怖心。何以故生者。从未来世。能引有为法令入现在世。老及无常能损其力。从现在世遣入过去世。譬如有人在棘稠林中。有三怨家。一能于稠林中牵令出外。二能损其力。三能断其命。三相于有为亦尔。住者摄持有为法。如欲不相离。是故不立此住为有为相。复有<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。于自相住故。住相相滥。有余师执。此经中住与老合为一故说三相。何用如此。此住于有为是爱着依止故。佛显此住。如吉祥王位与灾横相应。为令他于中不生爱着。是故有为定有四相。复有生等四相有为故。更有别生等四相不。说有。偈曰。生生等彼相。释曰。彼言显四本相。由诸法有本相故成有为。本相亦尔。由随相故成有为。故立本相更有四随相。谓生生住住老老无常无常。若尔随一一相应更有四相。则有无穷过失。此随相更立别相故。无有无穷过失。何以故。偈曰。诸八一<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。释曰。如此诸相于八法有事。何法名事。功能人功。生生等诸相。唯于一法有事。云何如此。一切有为法。若生取自体为第九。共本相及随相八。此中生者。离自体能生八法。生生者唯生本生。譬如雌鸡有生多子。有生一子。二生亦尔。住者离自体能安立八法。住住者唯安立本住。如此老及无常。如前义应合之。是故无有无穷过失。经部师说。此执即是破<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>事。何以故。生等诸法非实有物故。如汝所分。云何得知。非实有物。无量证故。于四相实有物中无随一量。谓证量比量圣言量。譬如于色等诸法。若尔经中云何说。有为法者。若生可知。及灭住异可知。天爱汝今能诵伽兰他。不解伽兰他义。佛世尊说。义是量非文句。何者为义。无明所盲凡夫众生有为<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>续。执为我及我所。于中生爱着。世尊为除彼爱着心。欲显行法相续是有为相及缘生相。故说此经。经言有三种有为法有为相。非为显一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>有为四相是实有物。若法不可知。不堪立为相。是故此经中说。有为法若生可知等。经说重有为名。为令他知此相显有为性。勿如此为显有为法类。是有故立四相。譬如于水白鹭。及于好恶童女相。此中相续。初起名生。终谢名灭。此相续流名住。前后差别名住异。佛世尊显示此义故。约难陀说。难陀。善男子。善知受生。善知受住。预善知受谢灭尽。此中说偈</p><p>生谓相续初断名灭续住</p><p>住异此相续是前后差别</p><p>复次偈曰</p><p>非曾有名生住相续无常</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第五卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第五卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别根品之四</p><p>为不如此耶。是因于他生有分皆是<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。由此言此<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>唯不遮为能故立为因。此义已拨。于余经中说所缘境不说不能遮为因。于经中无为法因义不成。以不说故。虽复不说亦不正拨。无量余经能显此义。皆已磨灭。云何决执此义。非经所说。若尔何法名离灭。为于前不已说耶。择灭谓永离。各各对诸结。于前问何法为择灭。答是离灭。今问何法为离灭。答是择灭。此释更互相依。终不能显<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。是故应引别义显其体性。诸<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>能自证此法体性。若欲说如此等相。亦可得说。谓<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>善有别物。若思量即是离灭择灭。经部师说。一切无为法皆是无物。何以故。此法不如色受等有别体物。云何无别物。唯无有触。说名<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。何故如此。于闇中彼人不得碍。逆说为虚空。由简择力。现在随眠惑及生离灭。后余集苦不更生。说名择灭。离此简择。由缘不具故。诸法不更生。说名非择灭譬如聚同分残于中间死不更生。余部师说。于随眠惑不更生中。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>有功能。唯此名择灭。此中后苦不更生。由随眠惑灭坏生缘不具故。此法得成。于中般若无功能。说此灭名非择灭。此法若离简择则不得成。是故此灭即是择灭。有余师说。若法先已生后灭。是自味灭。说名非择灭。于此执中非择灭应成无常。若法未灭未有非择灭故。为不如此耶。是汝择灭同前难不异。以简择为先故。若我等不执择灭在简择后。何以故。非先简择后方未生诸法不得生。所执云何。先时已有诸法无生。若离简择是法应生。简择起时后永不生。于此中是简择功能。谓先未有生障。今为生障。若汝执唯不生为<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。云何会释此经文句。经言若信等五根。被事被修被数习。为离灭过去未来现世众苦故。生起离灭即是涅槃。不生但约未来。于过去现世无不生义。实有如此。虽然能缘三世惑灭故。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说名苦灭。云何判如此。如别经言。于色贪爱汝等应除灭。若贪爱已灭。此色于汝等则灭则离。广说如经。乃至识亦尔。若尔于三世苦离灭亦尔。若有如此执。为除过去未来现世惑故说此经。解释道理悉应如此。若有如此执。过去惑在过去生。现世惑在现世生。譬如贪爱行中说十八贪爱行。约过去世谓约过去生。乃至现世亦尔。由此二世惑。于今相续中。已安立种子。为生未来惑。由种子灭故说彼亦灭。譬如由<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>尽故亦说业尽。是未来苦。及未来惑。无种子故。永不更生。说名离灭。若执异此过去及现世。有何可灭。于已灭及定向灭。是灭功用复有何果。若无为实无有物。是佛世尊所说经云。所有诸法。谓有为无为。于中说离欲法无等。云何于无中无法说无等。若我等不说无为无。我说如此有。如我所说。如说声有先不有有后不有。虽有有言非有物。终不成有。应知无为法亦尔。有无所有。最可称叹。谓一切。灾横永不复有。此不有于余。不有最胜无。等故可称叹。为令应受化<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>乐求此法。若无为唯无所有。灭离则非圣谛。何以故。此无所有故。若尔谛有何义。为不如此耶。无倒为义。此二亦无倒。如圣人所见苦如苦。苦无所有。如无所有。若尔于圣谛有何相违。君云何无所有。成第三圣谛。成圣谛义。已说第二次无间圣所见所说。故成第三。君若无为唯无所有。缘虚空涅槃为境识。应成无境界。此义于过去未来实有思量中当决判。君若许无为法实有别物。有何所有。复何所有。毗婆沙本义。则便被护。诸天应护。若彼知此。必应可护。此执非真实。云何非真实。此无为不如色受等自性可证。不如眼根等可以事证。此离灭是惑苦离灭。如此安立。云何可成。何以故。此离灭与惑等不相关。<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>等义不有故。唯遮拨彼。是义可然。谓某甲某甲不有。若执实有别物。由惑至得断至得此离灭故。说此是惑离灭。复有何因。能决定此法至得。经中说。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>已至得现法涅槃。若无所有。云何至得。由至得对治故。至得<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>及后生永相违依止故。故说至得涅槃。诸阿含显此法。唯无所有为义。阿含云。是众苦无余灭。弃舍无际。尽离欲离灭。寂静断没。不续余苦不取不生。是法寂静美妙。谓舍一切余爱。尽离欲离灭名涅槃。云何不许如此于彼不生故名无生。我等见此义与理不相应。此文何所显。若与已有相应。本来应无生。涅槃常住故。若与已至得相应。从此至得可分别此法已有惑已得。汝应许若不生。是譬喻最与理相应。譬如光涅槃心<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>亦尔。如光涅槃非有物。世尊心解脱亦尔。阿毗达磨藏。亦说如此。彼藏云何者无类法。答无为法。无类谓无体。此言显无自性。毗婆沙师说。文句义不如此。若尔何义。类有五种。一自性类。如经言。若已得此类。是人必与其相应。二境类。如经言。一切法如类<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>所知。三结类。如经言。若于此类中与欲结相应。即与嗔结相应不。四因类。如经言。何者有类法。一切有为法。五摄类。如经言。田类宅类等。此文中是因以类名显之。是故一切无为实有别物。毗婆沙师说如此。无为法无因无果。说三无为已。果有五种。于中此果何因。此因何果。偈曰。后因果报果。释曰。果报因最后说故称后。此因以果报果为果。偈曰。前因增上果。释曰。随造因最初说故称前。此因以增上果为果。此因唯不能遮为性。有何增上。即此是增上。随造因复有助功能。譬如于五识十入有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。又于器世界诸业有功能。耳等诸根。于眼识生中。传传有增上。由闻欲见生故。如此等应思。偈曰。同类及遍行。等流。释曰。此二因果皆似因故。悉以等流果为果。偈曰。二功力。释曰。二谓俱有因相应因。同以功力果为果。不过丈夫能故名功力。此功力即是其果。何法名功力。此法于余法所有功能。此功力如丈夫能故名功力。如<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>言鸦足草药醉象将军。为余因亦有功力果。为唯此二余因亦有。余果报因由功力果或俱生。或无间生。果报果不尔。此果报因。亦有远功力果。譬如农夫所应得稻。何法名果报果。乃至何法名增上果。偈曰。果报无记法。释曰。是无覆无记法。此果报为非<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>名耶。偈曰。众生。释曰。此法唯属内。非共得故。称众生名。此法为增长为等流。偈曰。有记生。释曰。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>二法。于果报可记故说有记。从此后时生非无间生。是名果报。果报相如此。非众生名法。亦从业生。云何不名果报。共所得故。此法余人亦能如此共用。果报无共得。何以故。是彼所作业果报。此得共用。无有是处。增上果亦是业所生。云何共用。从共业生故。偈曰。等流似自因。释曰。若果与因相似。是名等流果。如同类遍行因果。若同类遍行因果皆同类。云何不许皆是同类因。由此果约地约染污同本因。不由一切类。若法由一切类与果相似故。许此法是同类因。为此义故立四句。若法于此法是同类因。于此法亦是遍行因不。有四句。第一句者。非遍行因。但是同类因。第二句者。别部遍行因。第三句者。一部遍行因。第四句者。除前三句。偈曰。离灭由智尽。释曰。尽谓永离灭。智谓三道中<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>。因此智苦集次第尽故。名永离灭。即是择灭。说名离灭果。偈曰。若由法力生。是果名功力。释曰。若由此法功能彼法生。彼法是此法功力果。如下地加行心。上地三摩提有流无流定心变化心。如是等择灭者。由道功能。应但说至得。偈曰。先未有有为。有为增上果。释曰。从先已生有为法。别生有为法。名增上果。功力果与增上果其异云何。能作所得果名功力果。非能作所得果名增上果。如工巧师所得名功力果亦增上果。若余所得但是增上果。复次如此六因中。何因何时能取果及能与果。偈曰。五现世取果。释曰。离随造因。所余五因。在现世能取自果。非过去果已取故亦非未来无功力故。随造亦尔。此因不定有果。是故不说。偈曰。二是时与果。释曰。俱有相应二因。亦在现世能与果。何以故。此二因取果与果同在一时故。偈曰。二现世过去。释曰。与果同类遍行二因。此二因若过去与果。此义可然。云何此二因于现世与等流果。由次第生故。若果已生此二因即谢过去。若与果已后不更与。有同类因。但能取果不与果不。此中有四句。第一句者。若人断善根。最后所断至得。第二句者。若人还接善根。最初所得至得。应说如此是人还接前至得。第三句者。不断善人于所余位。第四句者。除前三句。若恶同类因。第一句者。是人正得离欲。欲界最后。所舍至得。第二句者。若人退欲界离欲。最初所得至得。应说如此是退人前至得。第三句者。不离欲欲界。于所余位。第四句者。除前三句。如此有覆无记同类。因至得阿罗汉果及退。于中如理应思。无覆无记无后句。若因能与果必能取果。有能取果不能与果。如阿罗汉最后阴。若约有境界同类因。随<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>判。有善同类因。但取果不与果不。此中有四句。第一句者。若从<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>次第起染污无记心现前。第二句者。翻前。第三句者。善心次第起善心。第四句者。除前三句。如善不善等四句。亦应如理思。偈曰。一过去与果。释曰。果报因在过去能与果。何以故。果报无俱起。无无间起故。有余师说。有四种果。一依止果。譬如水轮为风轮果。乃至草等为地果。二加行果。譬如不净观无生智。三集果。譬如眼等眼识等。四修习果。譬如<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>道变化为果。此四种果。属增上果功力果摄。说因及果已。何者为法。由何因生。由几因生。若略<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>有四种。一染污法二果报生法。三初无流法。四前二残法。何者为残法。离果报所余无记。离初无流所余善法。此四种法。偈曰。染污果报余。初无流次第。除果报遍行。二同类余生。释曰。染污法除一果报因。从余五因生。果报生法。除一遍行因。从余五因生。所余法除果报遍行二因。从余四因生。初无流法。除果报遍行二因。又除同类因。从余三因生。此四法是何法。偈曰。心及心法。释曰。此四法从余因生。但是心心法。若尔非相应法及色。此云何。偈曰。如余相应所离。释曰。除一相应因。是染污等余法。如心心法如此生。此中染污法从四因生。果报生法从四因生。所余法皆从三因生。初无流法从二因生。无一法从一因生。广解因究竟。缘是何法有几种。偈曰。说缘有四种。释曰。何处说。于经中说。经云有四缘类。一<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>类。二次第缘类。三缘缘类。四增上缘类。此中类者。是缘自性。此中因缘者。偈曰。因缘是五因。释曰。除一随造因。所余五因说名因缘。偈曰。心心法非后。已生次第缘。释曰。除阿罗汉最后心心法。已生余心心法。名次第缘。云何名次第缘。此法等无间缘故。名次第缘。是故色非次第缘。生不等故。何以故。从欲界色。后时次第欲界色界无教色生。后时欲界色无流色生。后时三种色生。是色现前乱过因生。次第缘无过乱。是缘生义。大德婆须蜜多罗说。于不相违一相续增长。后二生故。大德说。后从因最少最多生故。后时从大色小色生。譬如稻穰生灰。或从小色大色生譬如贝多核中人。次第生乃至垂条繁茂。转成尼瞿卢陀树。为不如此耶。心心法有时生多有时生少。谓于善恶无记位。有觉观等位。于三定。有如此约别类。不约自类无时受多生。想等亦尔。为约自类立次第缘不。无如此义。何以故。具足一聚。于具足二。为次第缘。非从少受等法多受等生。此义已如前说。说相续同类部。作如此执。自类是次第缘非余类。譬如心为心次第缘。受等亦尔。如广应知。若从无染污。次第生染污法。以先灭染污。为今染污次第缘。如入<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>定心于出定心。今不弘此执。非相应行法。亦由现前乱过因生故。不成次第缘。属<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>法及无系属法。一时现前生故。云何不许未来法为次第缘。次第缘杂乱故。未来世无前后差别故。若尔云何世尊得如此智。此未来法应在前生。次此法应在后生。约一切众生。乃至穷<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>际。次第皆知。由约过去现在比知故。彼言佛世尊。见过去世。从如此类业。如此类果报已生。从法法生亦尔。今世亦有如此类业。从此类业如此类果报。来世当生。从法法生亦尔。得知如此如此。是如来愿智非比智。由过去现世比。世尊于未来世众物散乱相杂证见已。生如此智。此人作如是业已。必应摄如是等未来果报。若尔世尊未见前际。应不能知后际。有余师说。于一切众生相续中。有与心相应有为差别法。为当来果相。世尊观此。知未来果。若未现前诸定及通慧。若尔如来则是观相故知。不能更证。是故世尊一切境界。随欲正遍知。经部说如此。何以故。世尊说。诸佛境界不可思议。若未来法。无次第成立。云何世第一法次后苦法智忍生。非余法生。乃至金刚譬心次后尽智生。非余法生。若法能碍余法生。从此法无间余法得生。譬如从种子等芽等无次第缘。云何阿罗汉最后心非次第缘。不与余心相应故。若尔无间灭心为意不。何以故。无间后识不生故。若不立为次第缘。亦应不立最后心为意。意依止性所显。非功能所显。故有依义。由余缘不具故。余识不生不。由彼非依止故识不生。次第缘是功能所显。若有法此缘所取为果。此法一切余法及诸众生。无能遮碍令彼不生。若法与心有次第。可说与心无间不。此中有四句。第一句者。从无心定出观心。及第二三摩跋提刹那等。第二句者。初三摩跋提刹那。于后心位及生等。第三句者。初三摩跋提刹那。及有心位。第四句者。第二三摩跋提刹那等。及生等于出定心。若法与心次第。与三摩跋提为次第不。此中有四句。前第三第四句。即是此中第一第二句。前第一第二句。即是此中第三第四句。出灭定心。于前心断隔极远时。今云何从前心。说为次第。无别心隔故。说次第缘已。缘缘相云何。偈曰。缘缘一切法。释曰。一切法即五聚。此中如理应知缘缘相。譬如眼识及相应法。以色为缘缘耳识声。鼻识香。舌识味。身识触。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>一切法亦尔。若法是此法缘缘。此法无时非此法缘缘。若非所缘。亦是缘缘。体相一故。譬如薪非所烧亦名薪。体相一故。心及心法。由定入物刹那。于如自所缘境定。为由依止定为不定。尔定若生必与依止相应。未生及已过去。与依止相离。余师说。若过去亦依止所立。说缘缘已。偈曰。随造增上缘。释曰。随造因即是增上缘。故增上缘即是缘缘。何以故。一切法是缘缘故。此二缘何者广。俱有法为缘缘。无有是处。有是处。得为增上缘。故增上缘广。由缘义广故名增上。此缘于一切有为法离自性。皆是增上缘。有法于余法。由四缘成缘。不有谓自性于自性。他性于他性。无为于有为。无为于无为。此四缘若起功能。于何位法中起功能。因缘者已说五种。偈曰。于正灭二因。作功能释曰。正灭者。谓现世法。何以故。现世法已得生。今向灭故。此位中俱有因。及相应因作功能。何以故。于俱生果中此因有功能。偈曰。三因。于正生。释曰。正生者。谓未来法。何以故。未来法未得生。今向生故。此位中同类因。遍行因果报因。作功能。因缘功能如此。偈曰。二缘。翻前有功能。释曰。由功能道理。分因缘为二。翻此功能。应知即是次第缘缘缘功能位。次第缘。于正生作功能。为与彼位故。缘缘。于正灭作功能。现世心心法所取故。增上缘于一切位。由不遮故成缘。即是其功能。说诸缘及功能已。复次何者为法。由几缘得生。偈曰。由四缘心法。释曰。此中心及心法。因缘者有五因。次第缘者。在前心心法。非余心心法所间。缘缘者。如应色等五尘及一切法。增上缘者。离自性一切余法。偈曰。二定由三缘。释曰。灭心定无想定<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>缘。此二定不缘境起故。此中因缘者。有二因。谓俱有因。即生等。同类因。即先已生同地善法。次第缘者。谓共相应法三摩跋提心。增上缘如前。此二定由心功用生故。故以心为次第缘。由能遮心生故。自外非次第缘。偈曰。余法由二生。释曰。余法。谓与心不相应法及有色法。由因缘增上缘生。从如前所立六因四缘。一切有生法得生。一切世间。不如<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>我胜性等为一生因。此中以何因为证。若汝执一切成立事因。缘所作。为不如此耶。由此执则乖弃汝所说本义。谓一自在等。为一切世间因。复次偈曰。非自在次故。释曰。世间不从自在等生。次第生故。若汝执唯一自在是一切世间生因。或执余因。一切世间应一时俱起。一切次第生。皆明了可见。若汝执此次第随自在欲成。愿此法于今生。愿此法于今灭。愿此法在后生灭。由欲有异。此义得成。谓因不一。是欲有异。应一时俱起。有欲自在。非有异故。若观余因差别故成。则非自在为因。是欲次第生中。若观别因。则有无穷过失。若不观别因。则无次第义。是因传传无边差别。由信无始故。此人乐执自在为因。不过释迦弟子所显道理。若汝言。自在欲虽复俱起。世间不俱起。随欲生故。是义不然。是自在欲于后世无所以故。由如此大功用化生世间。自在得何利益。若汝言常喜乐为用。是义不然。此乐若离方便自在则不能得故。于乐自在非自在。于余亦尔。复次若自在。见<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>等世间多为抂苦之所逼恼。由此故生乐。咄哉何用此粗恶自在。依自在天。世间首卢柯。则成善哥</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第六卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第六卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品第三</p><p>今当说此义。由决定欲界<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>故。已分别心等诸法。此中何法名欲界色界无色界。为答此问故。偈曰。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>鬼畜生。人道及六天。名欲界。释曰。四道及六天聚。六天者。一四天王天。二三十三天。三唱乐天。四善知足天。五化乐天。六他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天。是名欲界及器世界。此欲界复有几处。偈曰。二十。由地狱洲异。释曰。云何十四成二十。大地狱有八。一更生。二黑绳。三众磕。四叫唤。五大叫唤。六烧然。七大烧然。八无间。是名地狱异。洲有四。一剡浮洲。二东胜身。三西牛货。四北胜生。是名洲异。前说有六天。合数欲界成二十处。若约<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>世。从他化自在天乃至无间地狱。若兼取器世界乃至风轮。从此欲界。偈曰。向上十七处。名色界。释曰。云何偈曰。各各定三地。释曰。此中初定二定三定。各各有三地。偈曰。于中四定有八地。释曰。此中初定三地者。一梵众。二梵先行。三大梵。二定三地者。一小光。二无量光。三遍光。三定三地者。一小净。二无量净。三遍净。四定八地者。一无云。二福生。三广果。又一无大求。二无热。三善现。四善见。五无下。如此十七处名色界。及于中住众生。罽宾国师说。但有十六。何以故。于梵先行处有处。高广最胜。如别层起。唯有一主名大梵处。非有别地。偈曰。无色界无处。释曰。云何无处。无色法无有处。何以故。过去未来有教等无色法。不住于处。此义决定。偈曰。由生有四种。释曰。若无处云何有异。由生差别故。无色界成立四种。一空无边入。二识无边入。三无有无边入四非想非非想入。此四不由处立为高下差别。何以故。是处得无色定人死堕。即于此中生。复从此后死堕。于此处中阴即起。如有色众生依色色相续生。于无色界何所依相续得生。偈曰。聚同分及命。依此心相续。释曰。众生聚同分及命根。依此二彼心相续生。阿毗达磨师说如此。若尔有色众生。云何不依此二心相续生。此力弱故。彼力云何强。从定差别生故。何以故。此定能伏灭色想。若尔由<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>最强。依定心相续起何用立别依。此义应说。如有色众生。依色聚同分及<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>得生。无色众生依何法此二法得相续生。此二互相依。若尔有色众生。此二何故不自相依生。由二力弱故。若尔于无色二法云何力强。从定差别生故。此二如前。与心相续应同。或同心及心法。是故无色众生心相续。无别依止。经部师说如此。复次先所生能引心相续。因于色未离爱欲。此心相续。必与色共起。是故此相续依色得生起。是先所生能引无色心相续。因于色无复爱欲故。心相续不观色生。以弃背色故。云何说此三。为欲界色界无色界。界以持为义能持自相故。或性为义如前。此界与欲相应故名欲界。与色相应故名色界。除相应言。譬如金刚耳珰及弥梨遮饮。于此界中色非有故。不可显现故。不可变坏故。是故名无色界。复次此界是欲界家。界能持欲故。余二界应知亦尔何。法名欲。若略说与段食相应欲。与淫相应欲。故于中名欲。如偈言</p><p>世间希有不名欲于中分别爱名欲</p><p>世间希有住不异智人于中唯除欲</p><p>尼干子对<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。说偈言</p><p>世间希有若非欲汝说分别爱名欲</p><p><a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>恒应受尘欲若起染污尘觉观</p><p>大德舍利弗答</p><p>世间希有若是欲分别爱着若非欲</p><p>汝师恒应受尘欲若见可爱色等尘</p><p>若有诸法。于欲界色界无色界起行。是诸法为与欲界色界无色界相应。不。非何者欲界等。欲若于法随眠名欲界等相应。何法名欲界等欲。是法能随眠于欲色无色界中。是名欲界等欲。此答同缚马答。如问缚马者。谁是马主马主是谁是能缚。此二悉不可解。不同缚马答。何以故。此三处前已于欲界等中分别显了。于中未离欲人所有欲。是名欲界欲。若欲界欲随眠于此法中。此法名欲界相应。如此色无色界欲。若人已离欲下界。如理应知。复次若欲有色。以非寂静为地。名欲界欲于有色定及无<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>。名色界无色界欲。余言如前。于变化心中所起欲。云何名欲界欲。于中若有欲则名为信。由啖此味若退堕定。随变化于能变化人心上欲。亦是欲界欲。复次若变化为香味。即是欲界相应。由此二非色界心所变化故。为唯一<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>耶。三界无边。譬如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。三界亦尔。是故无先未有今有。众生生对对。诸佛出世时。无量众生般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。无众生有尽难。譬如虚空。世界云何住。傍住。经中说譬如车轴渧天雨时。水渧从上空落无间无缺。如此于东方世界正坏正成。无间无缺亦尔。如东方南方西方北方亦尔。不说有上下方。于别部经言有上有下。从阿迦尼吒上更有欲界。欲界下更有阿迦尼吒。若人离欲一欲界。是人即离欲一切欲界。色无色界亦尔。若人依初定起通慧。随所生处世界起通慧。由此通慧得往自世界梵王处。非余处。如前所说三界。偈曰。于中地狱等。名说有五道。释曰。于三界中说有五道。如前所立名。谓地狱畜生鬼神<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。由此自名说道有五。欲界中有四道及第五道一分。色界无色界中。唯天道一分。为有诸界出此道不。由说于界中有诸道。说有善染污器世界。中阴为性。是界非道。五道者偈曰是无覆无记。众生非中阴。释曰。道以无覆无记为性。若不尔。道应相杂但众生名是道。亦非中阴为性。假名论中说。四生摄五道尽。非五道摄四生尽。何者非摄。即是中阴。法阴阿毗达磨说。何者眼界。依四大及四大所造清净色。是眼根眼入眼界。谓地狱畜生鬼神天人。修得及中阴。于经中说。于道却中阴。此经何名七有。经云有七有。谓地狱有畜生有。鬼神有。天有。人有。业有。中阴有。此经中说五道共因共行。是故道定唯无覆无记。由却彼因业。有出彼外故。罽宾国师说。经大德舍利弗说。净命是地狱。或流现前故。即起即长地狱受报业。净命身口意谄曲憎忿粗涩业。于地狱色受想行识<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>熟。果报已起得名地狱众生。净命此中除色等法。地狱众生皆不可得。是故五道定是无覆无记。若尔应救分别道理论。彼论云。于五道一切随眠惑缘起。托五道心有五种。由共前分执道故。是故不相违。譬如说郊外为国土。余部说。诸道不。但无记有善有。染污是汝所。说由于道。却业有出外故不由别。立业有于道成外譬如于。五浊惑浊见浊。亦有别说。诸见非非惑。如此业有亦入道摄。亦有别说。为显道因故。于中阴亦应如此论。是义不然。非道理故。众生往于彼。是故彼名道。中阴非所往。即于死堕处起故。若尔无色界不应成道。即于死堕处起故。若尔由中间有故。故立中阴。非道在二道中间故。若此成道。不应说为中有。复次大德舍利弗说。果报已起得名地狱众生。有说。果报已起。不说即是果报复说净命。此中除色等法地狱众生皆不可得。此言但拨能行五道人故说除色等阴地狱人不可得。不拨余阴。毗婆沙师说。五道定是无覆无记。果报为性。有余师说。增长为<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。于五道三界中。此义次第应知。偈曰。身异及想异。身异同一想。翻此身想一。复有三无色。故识住有七。释曰。经中说。有有色众生身异想异。如人道及诸余天。是第一识住。何者余天。欲界天。初定天。除劫初生天。云何彼身异。色相形不同故。云何彼想异。乐想苦想非乐非苦想不同故。有色众生身异想一。如梵众天劫初受生。是第二识住。何以故。是劫初生。一切梵众同起一想。谓我等是大梵所生。大梵亦作此想。谓彼是我所生。由同思想大梵为一因故。故言想一。大梵王身量高大。异于彼众相貌威德言语光明衣着等亦异彼众。故言身异。于经中说。是诸梵众有如此思想。我等见此众生长寿于久时住。乃至起如此心。愿余众生于我同类中生。是众生起如此心愿。我等即于此处受生。是彼云何见此众生。余师说。彼住遍光天处。见此众生。何以故。是梵众从彼处堕故。梵众已不得第二定三摩跋提。云何能忆第二定地宿住事。若得云何缘大梵为境。起戒执取。有余师说。诸梵众在中阴得见。是义不然。于中阴无道理为得久住。无障碍故。云何彼起如此心。我等见此众生长寿久住此中。是故诸梵众在此处忆昔时事。昔时已见此众生长寿久住。后时更见。是故起如此心。有有色众生身一想异。如遍光天。是第三识住。此中复由执上边处。应知具足取二定。若不尔。小光无量光。何处识住可得安立。于彼天色相形不异故身一。有乐想不乐不苦想故想异。彼说是诸梵。于根本定地厌极喜根。从方便地。引舍根令现前。于方便地厌极舍根。从根本地更引喜根令现前。譬如大富人厌极欲乐别受法乐。厌极法乐更受欲乐。若尔于遍净天为不同此义耶。遍净天由彼乐不生厌极。何以故。是乐最寂静。喜乐非寂静。为没重心故。经部师说。有经显彼想不一。经言。有诸众生于遍光天上新得受生。未明了世间坏聚。未明了世间成散。见下地火光焰。怖畏起厌离心。谓火光焰勿烧空梵王处。已从下至于我处。有诸众生。于遍光天上先旧受生。已明了世间坏聚。已明了世间成散。见彼众生起惊怖心。慰喻之言。勿畏净仙。勿畏净仙。昔时此光烧空梵处竟。自然灭静。是故于火光有来不来想故。怖不怖想故。故说想异。不由乐不乐不苦想。有有色众生身一想一。如遍净天。是第四识住。想一者。同一乐想。此中于初定由染污想彼一想。于第二定由善想彼不一想。于第三定由果报生想彼一想。无色界三识住。如经所显。是七名识住。此中何名识住。于七处相应<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>及四阴。如理应知。是识住所余何故非识住。偈曰。所余有变异。释曰。所余是何法。谓诸恶道第四定及有顶。何以故。于中识有诸变异。故非识住。云何变异。于恶道中苦受是变异。由损害识故。于第四定无想定是变异。于有顶灭心定是变异。能断识相续故。复说住于余处众生。是欲住处。若住于此处不欲更动。说名识住。于恶道无此二义。于第四定中众生恒有动求出心。若凡夫欲见无想天。若<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>欲见五净居。有顶心细昧故。彼非识住。如所说是七识住。偈曰。有顶无想天。众生居有九。释曰。于九处中众生如欲得住。偈曰。不欲住余非。释曰。何者为余。谓恶道。何以故。于中众生不欲住业。罗刹逼之令住。不由自欲住。是故非众生居。譬如牢狱。于余经说七种识住。复有余经说。偈曰。复有四识住。释曰。何者为四。爱色识住。爱受识住。爱想识住。爱行识住。此四体相云何。此次第。偈曰。谓有流四阴。释曰。是阴。偈曰。自地非余地。释曰。此四阴是自地阴。非余地阴。何以故。住者定着为义。于不同地阴中。识随贪爱故。不能得住。云何不说识为识住。由离能住立住故。不说识住。非能住为住。譬如非王为王所使。复次若识乘策此法。此法名识住。由船人道理故。说诸法为识住。非识自乘策识故。不说识为住。毗婆沙师说如此。若尔经中说。于识食有爱有欲。若于中有爱有欲。于中识即乘住。此经云何。七种识住五阴为性。此经复云何有如此。虽然不分别。生处所摄五阴中有受乐识生时。亦说识为识住。若如色等。各各能起识染污。若单识不能为如此。是故于四识住不说单识为识住。复次佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说四识住为田。一切有取识为种子。不可安立种子为种子田。佛世尊意可了别如此。偈曰。住等众生名。释曰。是法为共生识好最胜田。是法说之为识住。为以七识住摄四识住不。为以四识住摄七识住不。偈曰。各异。释曰。七不摄四。四不摄七。偈曰。四句摄。释曰。若思量应知四句相摄。有法七所摄非四所摄等第一句者。七识住中识。第二句者。恶道第四定有顶识所离诸阴。第三句者。谓七识住四阴。第四句者。除前三句</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第七卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第七卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>释论中分别<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品之二</p><p>复次偈曰。如引次第长。相续由惑业。更入于余世。释曰。一切阴相续牵引不平等。能感<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>业有差别故。此相续随能引势。如此次第得增长。何者次第。如偈言</p><p>初名柯罗逻次生頞浮陀</p><p>从此生俾尸俾尸生伽那</p><p>伽那生舍佉及发毛爪等</p><p>并有色诸根次第生身分</p><p>此五位皆在胎内。谓柯罗逻。頞浮陀。俾尸。伽诃那。波罗舍佉。此胎中刺。由时节次第增长至成熟位。于母腹中业报所生。猛风吹之。风转胎刺安置令向母身门。此胎如强粪聚过量难忍。次从此处堕。是时二苦不可为譬。复次或时母饮食威仪执作过差。或由宿业过失。于胎内死。是时有诸女人善识方便。及诸医师解养婴儿。方温以酥油。及睒摩梨滑汁用以涂手。手着小利刃。于胎内譬如粪坑。最剧臭闇不净之器。是无量千虫类住处。秽汁常流。恒须对治。不净及血垢腻洟液。湿烂臭滑之所染污。鄙恶叵见。穿漏薄皮以覆其上。宿业所作。身大创孔手内其中。分分断割牵出于外。此胎中子。由宿后报业引入余道。趣向难知。复次若生无难。是时或母乳子。或余女人能瞻视之。此儿体似新疮。触如刀仗及烈灰汁。爱此儿身及以洗拭。次唅以清酥。饮以母乳。渐次饴以细粗饮食令稍习之。此子由次第增长。由诸根成熟诸惑更起。诸业更生及更增长。由此惑业舍命之后。由中有相续如前。更入余世。偈曰。故有轮无初。释曰。由此道理。生以惑业为因。惑业以生为因。生复以惑业为因。如是应知。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>轮无初。何以故。若分别执有初。此初应成无因。若初实无因。所余一切悉自然生。皆应无因。现见此事。于芽等中有种子等。功能。由处时定故。火等诸因。于熟等果亦尔。是故无生无因。说<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>为因。于前已破。是故生死必定无初。是生死终。由因尽可然。由生属因故。譬如芽属种子。由种子坏故芽灭。是阴相续所说。三生为位。偈曰。如此缘生法。十二分三节。释曰。此中十二分者。一无明二行三识四名色五六入六触七受八爱九取十有十一生。十二老死。三节者。一前际二后际三中际。谓过去未来现世。云何于三节安立十二分。偈曰。前后际二二。于中八。释曰。无明行在前际。生老死在后际。所余八在中际。此八分一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>于此生为具有不。答非。若尔何众生具八。偈曰。具生。释曰。若众生触一切位。说名具生。非于中阴死。非托色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>生。何以故。于大<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>经中。但约欲界众生说经言。阿难。若识不托母胎赤白。为得变异成柯罗逻不。不得<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。广说如经。有时说缘生有二种。有属前际摄缘生。有属后际摄缘生。于中七分说名前际。谓从无明乃至受。所余五分说名后际。合前后际<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>为二分故。何法名无明等。偈曰。宿惑位无明。释曰。于宿世中一切惑位。于今名无明。与无明共行故。由无明力所余得起故。譬如于说王行中说导从行亦名王行。偈曰。及宿业名行。释曰。位言次第流。于宿世中福等业位。于今名行。若今有是彼<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。偈曰。托生阴名识。释曰。于母胎中初托生<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。所有<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>名识。偈曰。此后称名色。先于六入生。释曰。从托生心。后乃至六入未生。此位称名色。应说先于四入生。云何言六。六者如此量立入故。是时四生。六<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故。偈曰。此先三和合。释曰。若六入已生。此位说名六入。乃至根尘识三和合未起。偈曰。触先乐苦舍。能分别因智。释曰。由三和合名触。此人乃至未能了别三受因异。此位名触。若已能了别三受因。偈曰。受先淫欲爱。释曰。受位者。了别三受因为体乃至未起淫欲爱。偈曰。求淫乐具爱。释曰。于欲尘及情色爱欲生起位名爱。乃至未能寻求五尘。偈曰。四取谓生具。为得故遍寻释曰。若于此位中着心寻觅五尘。为得故于一切处驰求。此位名取。如此驰求。偈曰。当来有果报。能造业名有。释曰。此人因求得欲尘心驰求。能生长感未来有报业。此位名有。由此业从今生更退。于未来世正托生位。偈曰。更接有名生。释曰。此位名更接。何以故。于今生是识分。于未来名生。从此后偈曰。老死乃至受。释曰。除生从此后乃至受。此位名老死。是四分谓名色六入触受。于未来名老死。分判十二分如此。此缘生余处说有四种。一约刹那说。二约多时说。三约相应说。四约位说。云何约刹那说。于一刹那中具有十二分。譬如有人由随贪爱染污断众生寿命。此人一刹那具有十二分。是中痴惑名无明。作杀意名行。了别尘类名识。与识俱起四阴名色。约名色清净根名六入。六入相对和合名触。领触名受。是贪名爱。所余与爱相应上心惑名取。彼所生身口二业名有。如此等法起名生。变异名老。灭名死。复说约刹那约相应。如分别道理论说。约位说者。十二分皆有五阴。无间生相续名多时。于四中今说何缘生。偈曰。此今约位说。释曰。若分分具有五阴。云何唯说无明等为分不说余。偈曰。由胜说为分。释曰。若于位中无明为胜。说此位名无明。若于中行胜说名行。乃至老死胜说名老死。是故无失。复云何于经中说缘生有十二分。于分别道理论说异。彼论云。何者为缘生。谓一切有为法。于经有别意。故说十二。于阿毗达磨约<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>说。复有别说。缘生有六种。谓约位说。约刹那说。约多时说。约相应说。约众生名说。约众生非众生名说。云何于经中但说众生名。偈曰。于前后中际。为除他无明。释曰。是故说三节。此中前际无明者。从此生疑。我于过去为已有为非有。何我已有云何我已有。后际无明者。从此生疑。我于未来为更有为不有。广说如前。中际无明者。从此生疑。此何法。此法云何。今何我当来何我。为除此三种无明。是故约众生名。三节说为十二缘生。于经中如次第说。谓无明行乃至生老死。云何得知如此。由经言。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>若比丘。由如实正智能通达缘及缘生所生法。是比丘不约疑耶。思前际谓我于过去为已有为非有。广说如前。复有余师说。爱取有为前际后际无明。何以故。此三是未来果因故。此十二缘生。应知有三种<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。一惑二业三类。此中偈曰。三惑。释曰。三分以惑为性。谓无明爱取。偈曰。二分业。释曰。二分以业为性。谓行及有。偈曰。七分类为果。释曰。七分以类为性。谓识名色六入触受生老死。惑业依故。此类或说名果。此七分于余处说名果。所余诸分说名因。惑业为性故。何因缘于中际说果因广。类有五种差别故。离惑为二分故。于后际说果略。离为二分故。于前际说因略。说惑一门故。偈曰。略果及略因。由中可比二。释曰。由广说中际。前际后际。广因广果。例此可知。是故前后际不复广说。若复广说此言无用。若缘生唯十二分。由不说无明因。生死应至有始。不说老死果故。生死应至有边。若立无明因老死果。应更说别分。若说此二别分。则有无穷之过。若不说别分。又不免前难。不应别立。此中由佛世尊已显此义故。偈曰。从惑惑业生。从业更果类。从类类惑生。有分理如此。释曰。从惑惑生者。谓从爱取生。从惑业生者。谓从取有生。从无明行生。从业果类生者。谓从行识生。从有生生。从类类生者。谓从识名色生。乃至从触受生。从生老死生。从类惑生者。谓从受爱生。由世尊安立有分道理如此。由无明是<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>性故。惑从类生。惑从惑生。此义自显。由老死类以受为边故。从此更生惑。是故于中不可增减如此纯大苦聚缘和合生由此言。若不尔。此文有何义相应。有余师说。于余经中说。无明以不正思惟为因。不正思惟以无明为因。于此经中不正思惟。亦是所说由入取摄故。云何不正思惟入四取摄。若说由相应故。亦应说入爱无明摄。与彼相应故。若在彼摄。此中云何能证。谓无明以不正思惟为因。若但由位摄能证因果义。爱及无明入取摄故。不应立为别分。如不正思惟。有余师说。于余经说不正思惟为无明因。此不正思惟说在触时。如经言。依眼根缘色尘。染浊思惟生。能起无明。于受时无明必生。如经言。缘无明触所生受。故爱得生。由此别经故知。不正思惟于触时起。能为受时所起无明作因缘。是故无明无无因义。故不须立别分。无无穷之过。此不正思惟。由说复从无明生。染浊思惟从痴生。此经言为证。于余经不无此义。若汝意欲立如此义。此中则应更说。彼文句不应说。若不说云何知有。由道理知有。何者为道理。若受无无明。不能为爱因缘。譬如于阿罗汉。若触不颠倒。不能作染污受因。云何知不正思惟从无明生。由于阿罗汉无无明故。触不颠倒。若由此道理故。不更说则成太甚过失。若此义由道理可见不须别说。自可得知。不但不正思惟。所余诸分不说亦应可知。则悉不须说故。此执不成救义。前所立难亦不成难。谓度无明老死。不说余故。故生死有初有边正说非不圆满。何以故。受化众生迷惑于有生。云何从宿世现世起。复从现世来世起。此三世次第相应。如来唯欲说如此多义。此义于前已说。如偈言。于前后中际。为除他无明。佛世尊说。比丘我今为汝等。说缘生及缘生此所生诸法。此二句其义何异。若依阿毗达磨义。此二无别义。何以故。此二是一切有为法故。云何未来法。未生说名所生。若尔。云何未来未是所作。说名有为。由能生故。意所引故。说名有为。若尔无流云何。是彼亦由善故意所引若尔于<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>约至得。亦应有如此义。此有为是所生种类故。虽复未生。亦说名所生。譬如色未变坏亦说名色。由是变坏种类故。是故无失</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第八卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第八卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　中分别<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品之三</p><p>　　行有于业俱舍中当说。爱取于惑俱舍中当说。如此缘生。若略说唯三。谓惑业果类。此三义前已显。偈曰。于中说诸惑。如种子及龙。如根树及糠。释曰。此惑与种子等。云何相似。譬如从种子芽叶等生。如此从惑惑业类生。又如池是龙所镇住处恒不枯涸。如此惑龙镇住生池相续不断。又如树未被拔根。斫斫更生。如此未拔除惑根诸道灭灭更起。又如树时时生花生子。如此诸惑数数生惑业类。又如米为糠所裹。于生有功能非单米。如此业为惑至得糠所裹。于生别生有功能非单业。如此诸惑应知如种子等。偈曰。如有糠米业。及如稻并花。释曰。于前已说惑似糠。今说业如有糠米。又如稻蕉等以果熟位为边。如此诸业已熟不更生报。又如花于生子中是近因。如此业于生<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>中最为近因。偈曰。如熟饮食类。释曰。如已熟食及饮。一向为受用。不可更转为生。如此果报类。不能于别生中更牵别果报。若更牵报无得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>义。如此生相续依因依缘生。不过四有。谓中有生有先时有死有。此四于前已释。偈曰。于四种有中。生有必染污。释曰。此中几有定不定染污。若一向染污。唯是生有。由何惑。偈曰。由自地诸惑。释曰。若生有在此地。一切同地惑皆为染污。于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>无有一惑由此<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>不结生。阿毗达磨师说。如此此染污由大惑。不由小分惑。由<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。若此位最昧钝。随有惑先数数起惑最近。是时于此位中此惑即起为染污。由先疾利故。接中有为必应知如此染污不。偈曰。余三。释曰。所余三有。即中有等。各有三种。谓善染污无记。于诸有中几有于何界相应。偈曰。无色三。释曰。除中有所余有。何以故。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>非隔别处。为至彼故起中阴。于欲<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>不数故。则知皆具四有。如众生依因依缘生。此义已广说。若众生已生。云何得住。偈曰。世间以食住。释曰。有一法<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>自通自知。为他正说。谓一切众生以食为住。经言如此。此食有几种。有四种偈曰。段食。释曰。段食者有粗有细。细者是中有众生食。以香为食故。及诸天劫初众生食。以无变秽流故。此食悉入彼身。如油于沙。复次若细众生彼食亦细。譬如发污虫等。触食第二。作意食第三。识食第四。此中段食者。偈曰。于欲界。释曰。此食于色无色界无。由离欲此于彼生故。偈曰。以三入为体。释曰。于欲界香味触入。一切皆名段食。作段吞故。先以口鼻含之。后分分吞故。影光焰辉。此等云何成食。由从多故。作如此说。此等若非所食能令相续住。亦入细食数。譬如浴涂等。云何色入非食。若作段食必约于色。偈曰。非色入由此。不利自根脱。释曰。食是何法。若能利益自根四大。色入者于正食时。不能利益自根及四大。何况能利益余根及四大。非自境界故。有时见色即起乐及喜。此色亦非食。但缘此为境。能生乐受等触。以此为食非色。复次已得解脱人。谓阿那含阿罗汉。见可爱饮食无利益故。偈曰。触作意及识。三有<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>二。释曰。触者从三和合生。作意者是心业。识者是<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。此三若有流必是食。此三通三界有。云何不立无流为食。由立食以能滋长诸有为义。无流生起能灭尽诸有。毗婆沙师执如此。复次于经中说食义。食有四种。为令已生众生得住。及为愈相续。又为利益寻求生众生。无流法不尔。是故非食。已生者于道中已生众生。此义易解。何者寻求生。偈曰。意生寻求生。乾闼婆中有。对有。释曰。世尊以此五名。说中阴众生。何以故。此众生从意生故。故说意生。不取不净及血所有诸外为生依故。寻求生者。欲得生未得故。处处寻求生。乾闼婆者。由食香故。以香益身行向于道故。对有者。对向生处起故。如经言。对起有碍害自体。生有碍害世间。由此经言故。对有名中阴。复有别经言。有众生对有结已尽。非生有结。此经中有四句。复次已生者。谓阿罗汉。寻求生者。谓有爱众生。复次几种食令已生众生。住几种食能滋益寻求众生生。毗婆沙师说。一切食皆能为二事。何以故。段食亦于有爱众生令得后有。佛世尊说。有四食为病根痈刺老死等缘。作意食亦曾见令现生住。先旧师说如此有一父遭饥饿难。以满囊灰挂置壁上。慰喻二子语云是麨。二子数思麨囊。得多时安住。后时有人。为开彼知是灰。失先作意即便命终。复次于海中有多人。船败见大涛聚。思谓是岸。随往趣彼。至已触之方知是涛。失先作意即便命终。于别诵中说。海中有大身众生。从水登岸。于沙上生卵。以沙覆之还入海中。若母于此卵忆念不忘。卵则不坏。母若于中忘失忆念。此卵即坏。经部解不尔。勿由他食他食得成。若释应如此。于中若卵缘母。忆念不忘。卵则不坏。若忘即坏。有余师说。此忆在触位中。云何说食唯四。为不如此耶。一切有流法。必能滋益有。虽然由胜故说。偈曰。为益此。能依所依二。能引生别。有次第说后。二释。曰所依者。谓有根身。为滋益此身段食为胜。能依者。谓心及心法。为滋益此法触食为胜。如此二食。于滋益现世已生有中胜余。复立作意食者。于引后有为胜。是所引有。从业所薰修识种子生。如此后二。于引生未生有为胜。是前二食如乳母。能将养已生故。后二食如生母。能生未生故。由胜余故唯立四。为一切所吞分段皆是。食不有分段是所吞而非段食。此有四句第一句者。若吞此分段。诸根坏损害四大。第二句者。谓余三食。第三句者。是所吞分段能滋益诸根增长四大。第四句者。除前三句。如此与触等如理应各立四句。为有缘触等得诸根滋益。及四大增长。是诸亦非食不。有谓别地及无流。余句应思。若人食此食。损食者根大。此物亦是食。由执初至故。何以故。段食于二时中作食用。若正食时对治本病。若消时增益身大。毗婆沙师说如此。于何道有几食。于一切道有一切食。于生亦尔。于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>云何有段食。有燃赤铁段为食。锡赤铁汁为饮。若能损害物亦是食。则违前四句。亦违分别道理论。彼论云。何者为段食。若缘此分段滋益诸根。增长四大相续得愈。及识亦尔。广说如论。由约能增益食说。故<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违。损害食于地狱中亦有食相。何以故。此食有能为暂遮饥渴等病。复次有别处地狱。如人道有段食故。是故段食遍五道中。有此义应然。佛世尊说。若有人施一百离欲欲界外仙人食。若有人施一凡夫人食。此人在剡浮密林中行。于此前施后施。福德百千倍胜。是何凡夫在剡浮密林中行。余师说。住于剡浮。或云。是有福凡夫。此执不然。由说一故。此中何所以。施一凡夫食福德。多胜施多离欲凡夫。若施多凡夫食。此福德胜施一凡夫。是义可然。有余师说。是近佛地菩萨。余师不说此义。何以故。若施此菩萨福德最多。不可称数。若施此人所得福德。乃至施百俱胝阿罗汉。亦所不及。毗婆沙师说。有凡夫已得<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>观决择分能。此中说名在剡浮密林中行。此名与义不相称。又不曾于余处但假安立此名。谓经及阿毗达磨藏等中。说剡浮密林中行。必得四谛观决择分能。是故此是自所分别。若尔云何。必约菩萨正在剡浮密林中行。故说此言。何以故。此菩萨于是时与凡夫离欲。欲界二义相应故。于余仙人分别。令异此菩萨。于无边众生无量倍胜。而报百者。由随前所立。此义必应尔。何以故。由除此人于外仙人格量须陀洹故。若不尔。应以剡浮密林中行格量须陀洹说众生依因依缘生。及众生得住义已。众<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>堕义亦已说。谓由福尽。不由命尽等。此义今当说。为于何识正起时众生得死堕及托生。偈曰。断接善离欲。退及死托生。此事于意识。释曰。断善根。更接善根。离欲下界。退失上界死生。如此六法。于意识中成。非于余识。由说生故。托中有义亦是所说。若约受死生云何。偈曰。于舍受死生。释曰。舍命及受生。此二心在不苦不乐受中。此受昧钝故。余受则明了。于明了识中死生不成。于此意识中。偈曰。非一<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>二。释曰。死及生虽复在意识。非一心及无心中。何以故。若人正在定心无死生义。地非同分故。功用所成故。能为利益故。于无心中亦不得死。何以故。若无心人则无横害。是时依止若欲起变异。是时随属依止心。必定起现前。后方舍命非余。若于受生时无心亦不应然。心断因不有故。若离上心惑。不得受生故。是故于中无心不应道理。死有有三种。于前已说。偈曰。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>二无记。释曰。于威仪心及果报心。若于欲界中。有果报名舍。若无于威仪心般涅槃。云何但于无记非余心中。此无记。随顺心断绝。由力弱故。若人正死。于何身。分中意识断灭。若一时死。身根共意识一时俱灭。若人次第死。此中偈曰。次第死脚脐。于心意识断。下人天不生。释曰。若人必往恶道受生。及人道天道。如此等人。次第于脚于脐于心意识断灭。不更受生是名不生。谓阿罗汉。此人于心意识断绝。有余部说于头上。何以故。身根于此等处。与意识俱灭故。若人正死。此身根如热石上水渐渐缩减。于脚等处次第而灭。复次若众生如此次第舍命。于中多众生。为斫末摩苦受所逼方死。云何斫末摩。偈曰。末摩水等。释曰。末摩者。于身有别处。如偈言</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第九卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第九卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品之四</p><p>复次夜摩等天宫其量云何。上四天如须弥娄山量。余部说如此。复有余师说。向上倍倍广。复有余师说。初定地量。同一四洲世界。第二定地量。同小千世界。第三定地量。同二千世界。第四定地量。同三千世界。复有余师说。初定等三地量同一千等世界。第四定无复量。复次何义名小千世界二千世界三千世界。偈曰。四洲及月日。须弥娄欲界。梵处各一千。名小千世界。释曰。一千剡浮洲。乃至一千北鸠娄。一千月日。一千须弥娄山。一千四大王天。乃至一千他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天。一千梵处。说此名小千世界。偈曰。千倍此小千。名二千中世界。释曰。更千倍小千世界。名二千中世界。偈曰。千倍三大千。释曰。更千倍二千中世界。名三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。如此一切。偈曰。共同一坏成。释曰。如此等世界同有小大三灾。此大千世界同坏同成。此义后当广说。如器世界量不同。于中住<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>身量亦有差别。不有。此中偈曰。剡浮洲人量。四肘三肘半。释曰。剡浮洲人从多身长三肘半。或有人长四肘。偈曰。后后倍倍增。东西北洲人。释曰。东毗提诃人身长八肘。西瞿陀尼人身长十六肘。北鸠娄人身长三十二肘。若天云何。偈曰。身量四分增。乃至俱舍半欲界。释曰。四大王天身长一俱卢舍四分之一。三十三天身长四分之二。夜摩天身长四分之三。兜帅多天身长四分。化乐天身长五分。他化自在天身长一俱卢舍半。偈曰<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。初半由旬次第。释曰。色界诸天于初处梵众天身长半由旬。从此次第。偈曰。半半增释曰。于三处半半增。梵先行天身长一由旬。大梵天身长一由旬半。少光天身长二由旬。偈曰。向上从少光。上身倍倍增。唯除无云三由旬。释曰。无量光天身长四由旬。遍光天身长八由旬。如此倍增由旬。乃至遍净天身长六十四由旬。无云天倍增减三由旬。身长一百二十五由旬。从此后福生等天更倍增。乃至阿迦尼师吒天身长十六千由旬。身量向后有如此差别。寿量亦有差别不有。偈曰。北鸠娄千年。于二离半半。释曰。北鸠娄人定寿千年。于西东二洲寿量半半减。西瞿陀尼寿五百年。东毗提诃寿二百五十年。偈曰。此不定。释曰。于剡浮洲寿量不定。有时极多有时极少。多少云何。偈曰。最后十岁。释曰。此寿渐减。最后唯有十岁。偈曰。初叵量。释曰。劫初生众生。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>不可量。由千等数不能计量故。说人寿已。今当说天寿。若先安立日夜。方得计诸天寿。天日。夜云何偈曰。人中五十年。彼天一。日夜。欲下天。释曰。人中五十年。于欲界最下天。谓四大王天。是一日一夜。偈曰。以此彼寿五百年。释曰。以此三十日夜立为一月。以十二月立为一年。以此五百年为彼天寿量。偈曰。向上后倍增。释曰。上地诸天倍增为日夜。以此日夜计彼寿量。彼寿云何。人中一百年。是三十三天一日一夜。以此日夜一千年。为彼天寿量。应知夜摩天等次第如此。人中二百四百八百十六百。为彼一日一夜。以此日夜二千四千八千十六千。天年次第为上天寿量。从由乾陀罗。向上无日月诸天云何安立日夜。用明光事。云何得成。由花开花合。谓俱牟头花。波头摩花等。诸鸟有鸣不鸣。睡有来去。以此等事判日夜。用光明事者。身自然光不须外光。说欲天寿量已。偈曰。色界无日月。由劫判彼寿。劫数如身量。释曰。于色界中若有诸天。身量半由旬。寿量则半劫。若身量一由旬。寿量则一劫。如此彼身随由旬数。彼寿量劫数皆随身量。乃至阿迦尼师吒天。以十六千大劫为寿量。偈曰。无色二十千。劫后二二增。释曰。于空无边入。寿量二十千。劫识无边入。更增二十千劫。无所有入。更增二十千劫。有顶更增二十千劫。此寿量二十四十六十八十千劫。此中应知。云何为劫。为是别劫。为是坏劫。为是成劫。为是大劫。偈曰。从少光大劫。从此下半劫。释曰。从少光梵处。应知寿量约大劫。从此下半大劫说名劫。以分别大梵等寿量。云何如此。是时世间二十别劫成。二十别劫成已住。二十别劫散集。是六十别劫。于大梵处说名一劫半。分别如此。已是半劫。谓四十别劫。立为一劫。说彼寿量。说善道寿量已。恶道寿量今当说。偈曰。与欲界天寿。日夜次第等。于更活等六。寿量如欲天。释曰。如所说六欲天寿量。于六<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>日夜。应知次第皆等。六者谓更活黑绳聚磕叫唤大叫唤烧然。于彼由旬日夜等。六欲天寿量。应知于彼寿量。亦等六天寿量。云何如此所说。四天王寿量。于更活地狱是一日一夜。以此日夜立月立年。以此五百年为其寿量。三十三天寿量。于黑绳地狱是一日一夜。以此日夜于中寿量足一千年。如此于余处次第应知。乃至他化自在天寿量。于烧然地狱是一日一夜。以此日夜于中寿量足十六千年。偈曰。于大烧半劫。阿毗指别劫。释曰。于大烧燃地狱。寿量半别劫。于无间地狱。寿量足一别劫。于畜生寿量无定。偈曰。畜生极别劫。释曰。若畜生中最极长寿。但一别劫。谓诸龙难陀优波难陀阿输多利等。何以故。佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>有八部龙名大龙。皆一劫住持于地轮。广说如经。偈曰。鬼日月五百。释曰。人中一月。于鬼神是一日夜。以此日夜寿量五百年。于寒地狱寿量云何。偈曰。从婆诃百年。除麻尽为寿。頞浮陀二十。倍倍后余寿。释曰。约譬喻佛世尊说。寒地狱寿量如经言。比丘。譬如此中二十佉梨。是摩伽陀量一。婆诃麻遍满高出从。此有人一。百年度除一粒麻。比丘。如此二十佉梨。一婆诃麻。由此方便。我说速得减尽。我未说于頞浮陀生众生寿量得尽。比丘。如頞浮陀寿量。更二十倍为尼剌浮陀寿量。乃至比丘。二十倍波头摩寿量。为分陀利柯寿量。如此等寿量。为有未具足于中间死不。一切处有。偈曰。除鸠娄中夭。释曰。于北鸠娄洲。一切人寿量皆定必具寿量尽方得舍命。于余处寿命不定。若约别人。于中间多不得死。谓住兜帅多天。一生补处菩萨。最后生菩萨。佛所记。佛所使。信行法行。菩萨母。转轮王母。正怀胎。如此等由由旬量说。处所及身量已由年量。说寿命量已。此二齐量未说。如此一切用名分别。此名穷量。亦应显说。为说此三。是故初立方便。偈曰。邻虚字<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。色名时最极。释曰。若分分析色极于邻虚。故邻虚是色极量。时量亦尔。极于刹那。名量亦尔。极于轻字如伊短音。复次刹那者何量。若<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>已具足。随时法得一生。是时名刹那。复次是法若行度一邻虚。是时名刹那。复次若有强力丈夫一弹指顷。经六十五刹那。阿毗达磨师说如此。于此中偈曰。七邻虚阿羺尘铁尘水兔羊。牛隙尘虮虱。麦指节应知。后后七倍增。释曰。以邻虚为初。应知后后皆七倍增。七邻虚为一阿羺。七阿羺为一铁尘。七铁尘为一水尘。七水尘为一兔尘。七兔尘为一羊尘。七羊尘为一牛尘。七牛尘为一隙光中尘。七隙光中尘为一虮。七虮为一虱。七虱为一麦。七麦为指一节。三节为一指。是世间所解故。偈中不说。若横并指。偈曰。二十四指量一肘。四肘一弓。五百弓俱卢舍。此名阿练若。释曰。十二指为一[月*桀]手。二十四指为一肘。四肘名一寻。亦名一弓。五百弓为一俱卢舍。亦名村亦名阿练若。偈曰。此八一由旬。释曰。此八俱卢舍为一由旬。说由旬量已。年量今当说。偈曰。百二十刹那。怛刹那。释曰。一百二十刹那。为一怛刹那。偈曰。六十说名一罗婆。释曰。六十怛刹那。说名一罗婆。偈曰。后三三十增。是一牟休多。及一日夜月。释曰。三十罗婆。为一牟休多。三十牟休多。为一日夜夜。有时长有时短有时等。三十日夜为一月。偈曰。十二月一年。一年共减夜。释曰。寒际有四月。热际有四月。雨际有四月。如此十二月。立为一年共减夜。何以故。有六减夜入一年中。云何如此</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别业品第四</p><p>前已说<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>世及器世。差别有多种不同。如此不同何因所作。非随一作者。以知为先所造。若尔云何诸众生。偈曰。业生世多异。释曰。若<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>多种差别皆从业生。云何因众生业。郁金旃檀等生极胜可爱。而彼身不尔。是彼业种类。如此作杂业众生。彼身有九疮门。甚可厌恶。外具生极可爱。以对治此身。诸天等不造杂业。此二悉可爱。若尔此业是何法。偈曰。故意及所作。释曰。经中说。业有二种。一故意业。二故意所造业。此所造但故意所作。非身口所作。此二业或成三业。谓身口意。云何安立此三。为由依止。为由<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。为由缘起。若由依止但一身业。一切依止身故。若由自性但一口业。于一切中但口是业故。若由缘起但一意业。一切皆故意所起故。次第由此三因安立三业。毗婆沙师说如此。此中偈曰。故意即心业。释曰。心业者但故意故。意何相。谓心思已决。偈曰。故意生身口。释曰。如此故意依身口门起。即以身口还显故意。应知此名身口二业。偈曰。二有教无教。释曰。是身口业。应知一一各有二类。谓有教无教为性。此中偈曰。说身有教相。释曰。由随故意。是身如此如此相貌。说名有教。有余师说。行动名有教。若身行动。必由业行动故。行动是身业。对向彼说。偈曰。非动<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>故。释曰。一切有为法。与刹那相应。何法名刹那。得体无间灭。是名刹那。随法有如此名刹尼柯。譬如有杖人。何以故。一切有为法。从得体后即不有。是时生是时即坏故。执此法得度余处。则非道理。是故身业非行动。此义亦可然。若一切有为皆是刹尼柯。汝今应知。此义成实。谓有为刹那刹那灭。云何知。偈曰。最后灭尽故。释曰。诸有为法。灭不由因。何以故。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>者为生有法。灭非有法。若非有此因何所作。此灭既无所有。故不须因。有法生时次若无灭。后时亦应无有法无异故。若汝言此法变异方有灭。此法即非此变异故。是义不然。何以故。此法自体由自体变异。无如此理。若证见薪等由火相应故。灭不显现。善友为与火相应。薪等灭尽故不可见。为自然灭。余不更生故不可见。譬如与风相应故灯灭。与手相应故铃声灭。是故此义由比量得成。此中何法为比量。已说由灭非因。所作故。复次偈曰。无不从因生。释曰。若灭必由因则无灭。无因所生故。刹那生灭法。如智声光等。见此灭无因。是故知一切灭皆不观因。若有人执由别智故余智灭。由别声故余声灭。是义不然。二智不俱起故。疑智及决智。无道理得俱起。苦乐嗔欲亦尔。若明了智及声生。次第不明了智及声生。云何不明了等类法。能灭明了等类法。若有人执。灯光于余位中无依处故灭。或由随法非法故灭。此执不然。何以故。此无不应成因。所执法非法。为生灭因无道理。于刹那中起如此功能。于一切有为中。可作如此分别余因。且置此诤。若言薪等灭以火相应为因。此执中熟所生德。少熟中熟最熟生中。偈曰。生因成能灭。释曰。此熟中生因即成灭因。何以故。由从火相应熟德生从此不异。后中熟生时。少熟即灭。是彼生因即是灭因。或此灭由因不异。是义不然。偈曰。于决无证故。释曰。从如此因彼先得生复从此因彼更成灭。偈曰。于地等宁有。释曰。于光差别且得分别彼因有异。于灰汁雪酢曰水地相应故。熟德差别生时于中何所分别。是义不然。何以故。水被煮则减尽。于中火相应何所作。由此势力。生长火界。由火界势力。水聚渐渐减少。乃至极减位。不更接后相续。于中此事是火相应所作。是故诸有法灭皆无有因。是坏性故自然而灭。若生即灭。是故彼刹那刹那灭义得成。由刹那灭故无行动。诸有法。于余处无间生中。世间起行动妄执。譬如草光等。行动既<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>貌为身业。此义得成。经部师说。相貌非实有物。何以故。偈曰。向一方聚生。执色假说此。相貌由比量。约色相决判。释曰。若色多生于一方假说名长。观此色于余色少假说名短。若于四方色多生假说名方。若一切处色生等。假说名圆。所余亦尔。譬如火薪。疾向一方。于余处见无间则执为长。若于一切处见则执为圆。是故相貌与色无别类。何以故。若有别类。偈曰。二根取无入。决是意尘故。释曰。若眼见此分别为长。若身触亦尔。是故此相貌。应成二根所取。无有色入为二根所取。偈曰。由分别坚等。长等智生故。释曰。如于触中执长等相貌。汝于色中应知亦尔。于相貌中唯有忆念起。与触相应故。无有证取。譬如人见火色。于火热触生念。闻花香于花色生念。此中是义应理。由彼实有不相离故。是故互得相比。偈曰。于大聚集有。复决定相貌。不同相违故。释曰。无有触尘于相貌中。定因此定故。于二中更互相比知。决定得成。若无定相应取触。比相貌决定成。于色比亦定应成。或如于色于相貌不定故。比不应成。此二义悉不成。是故由触比相貌。是义不然。于有众多相貌物。如[毯-炎+瞿] 毹等。由见众多相貌故。随一所见。是众多相貌所成一分。若是实物。此义不成。譬如显色。是故相貌无有实物。复次随有有碍色。此色必定有邻虚。相貌色无别邻虚。是故多色如此聚集。假说长等名。若汝言。是相貌邻虚聚集如此得长等名。此执一向堕偏助。相貌邻虚不成就故。若彼别相成就。彼聚集可然。相貌邻虚如色等邻虚。自性既不成就。云何得有聚集。若汝言色同不异。但见相貌有异。谓土器等。是义不然。前为不已说耶。若色起如此相。于中假立为长等。譬如蚁等。无有差别。而说有行轮等异。相貌亦尔。复次若汝言。于闇中远不见色。如杌等但见长等相。故相异色。是义不然。何以故。是所见即是色。于此中不明了故。分别为长等。譬如行军等。由如此理。此义必应然。有时不可分别差别。唯众物聚集。见不明了。若尔汝等经部师。除身行动及相貌。此中汝立何法为身业。但立相貌。为身有教业。不由实有故。若汝假说相貌。云何立为身业。以身为依止。此业为身业。若故意能引身。于种种处即立此故意为身业。如此口意二业。如理应知。若尔于前已说。业有二种。一故意业。二故意所造业。此二有何异。分别故意先起。谓我等应作如此如此。是名故意业。故意分别已。后引事故意起。能引身作种种事。是名故意所造业。若尔则无有教业。是有教业于欲界亦无。是故随此执有大过失起。若尔对此过失。复有别对治起。若无教业。从如向所说名身业。故意差别生。何所有此应随从故意起。譬如定无教。此过失不应有。由随本故意差别所引及依事。故意差别生故。若有教起。亦观本能引故意势力故。此方得生。由昧钝故。何况无教。毗婆沙师说。身相貌实有物。身有教业以此为体。偈曰。言教语音声。释曰。是声言语为性。是名有教。言业无教。于前已说。经部师说。此亦非实有物。何以故。先已信求。唯定不作为量故。彼师依过去四大。成立此义故。过去四大已无为性故。由执此色为相故。毗婆沙师说。此无教实有物。云何得知偈曰。三无流色长。不作说道等。释曰。于经中说。色有三种。有三处能摄诸色。有色有显有碍。有色无显有碍。有色无显无碍。佛说有无流色。如经言。何者无流法。若色过去现世未来。于中欲不起嗔不起。乃至于识亦尔。说此名无流法。若除无教色。则无无显无碍色及无流色。经中又说增长。如经言。若善男子善女人。有信根与七种有摄福德业处相应。若行若住若卧若觉。恒时平等。福德增长。福德相续。与无摄相应亦尔。若离无教。异缘心人。福德业处不应有增长。若人自不作但教他作。若无无教业道不应成。何以故。令他教业非是业道。非自所作业故。若已作此性无差别故。亦非佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>诸法是外入。非十一入所摄。谓无显无碍。不说无色。此言则成无用。若不见无教色在法入摄。若离无教色。圣道不成八分。若人入观正语正业正命。不相应故。若尔此经所说云何经言。若人如此知如此见。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>至修习<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。正觉正进<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>正定。先时正语正业正命。已清净离染污。此言约先循世道离欲。故作此说。若无无教色。波罗提木叉戒亦不应成。何以故。从<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>后此戒即无。谓能成异缘心人。为比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>等。于经中说。远离戒为塘。能遮邪戒故。若此无不应成塘。由此等证故知实有无教色。此中经部师说。此证甚多种种希有。理实不然。何以故。是汝所说。由三种色故。有无教色。此中先旧观行师说。诸观行人有定境界。色由定威力生起。此色非眼境故说无显。不遮处所故说无碍。若汝言。此云何名色。此难于无教亦同。是汝所说。由说无流色故。有无教色。此义同前。此色由定威力生。在无流定中。为境界故。观行人说。此为无流色。有余师说。阿罗汉色及外色名无流色。非流依止故。若尔经中云何说。何者有流法。谓一切眼一切色。广说如经。此色非流对治故。说名有流。由此别义。此色可说有流。可说无流。若尔何有相杂过失。由此相此色成有流。不由此相更成无流。于中有何相杂。若色入一向有流。此经中云何简别说。经言有流色者。若色有取心坚覆藏所依。广说如经。是汝所说。由福德增长者。此中先旧师说。此是法尔。如如施主。所施财物。受者受用。如此如此。由受者<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>胜劣故。由财物利益胜劣故。若施主心异缘。由先缘施故意所熏修故。是时相续至得微细转异胜类。由此于未来时。为生多少<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>相续功能。约此义故。说福德增长福德相续。若汝言。由别相续胜劣。于异缘心人别相续转异。今云何得成。此执与无教同。由别相续胜劣。于别相续中有别法名无教。此云何得成。于无摄福德业处。此云何有。由数数修习。能缘此为境故意故。于梦时此亦得随相续并起。若人说有教。于无摄福德业处。于中既无有教业。云何得有无教。有余师说。于有摄福德业处。由数数修能缘此为境故意故。无教得生。若尔云何。于经中说。若比丘。有戒有善法。食施主一食已。修无量心定。由身证触依。此中住因。此生能施施主无量福德无量善流。安乐之食。应信求如此。此中是时有何故意差别。是故相续转异胜类。此义如理。是汝所说。若人教他业道。云何成者。此中经部师说。由此人立教损害他差别成故。于能教人相续中微细转异胜类得生。由此转异。于未来中此相续为生多少果报。则有功能。若人自作事果究竟时。应知此义如前。此相续转异胜类。说名业道。于果立因名故。说此为身口业者。是身口二业果故。譬如说有无教人。于无教立身口业名。大德说。于所取阴中。由三时故意起故。此人为<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>罪所触。谓我今必应杀正杀已杀。若此故意生。由此量业道不得成就。何以故。勿自父母等未被害。由妄分别杀故无间业成。若<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>起如此等故意。业道则成。若作如此意则应道理。汝何憎嫉心偏拨无教。信受相续转异胜类。二俱非所解。无憎嫉心虽然由随故意身加行业道究竟故。若已成此别法。异于二依能行<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>。此义不生爱乐。若由故意起加行事生究竟。因此事相续转异胜类。成此义则生爱乐。从心心<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>续。未来果报生故。是汝所说。由无有教业故。无教则无。如此等义于前已答。是汝所说。由不<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>入非色。此言已答。无显无碍是定境色即法入摄。是汝所说。八分圣道不应成者。善友请汝。为说此义。若人入观<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。正语正业正命。云何应有此人说言。作业求觅衣食不。不尔云何此人得如此相无流无教。由得此分。后时出观。则不更行邪语等事。必能恒行正语等分。是故由于因立果名。说无教为正语等分。若尔此中云何不执如此。若人入观修道。离无教得如此相。谓故意及依止。由得此二。后出观时。不更行邪语等事。恒行正语等分。是故由于因立果名故。得安立圣道八分。有余师说。此中唯不作为量。说名三分。由此圣道势力。此人必得定。不更作邪语等。此定不作。由得无流道为依止。说名无流。何以故。于一切处。不定应数实有体法。譬如八世法。一得二不得三好闻四恶闻五赞六毁七乐八苦。此中不得衣服等。非实有别物。亦被数于余处亦尔。波罗提木叉戒等亦尔。有信求心人。由故意先作受方便。于如所遮业。护持身口。若汝言。心异缘时。即无复戒。是义不然。由数习此。故意欲犯恶事时。是人忆本故意护持。即起塘义。亦有忆持。先不作恶誓。起惭羞心故。不破禁戒。此即塘义。是故依师受不作恶。若如汝所言。唯无教业。能遮断犯戒失则应无人忘念<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。且止广诤。毗婆沙师说。有别物。色为性。名无教。此若有前已说。此依止四大生。为依有教四大生。为不尔。依别四大生。何以故。此一和合。有细粗二果。无如此义。无教所依四大。与有教四大同时起。不一切所造色。若现世若未来。多依过去四大生。此所依云何。偈曰。刹那后无教。欲过去大生。释曰。从初刹那后。欲界无教。依止过去四大生。是四大作此生依止。是身现世四大为相续依止。是二四大。次第为此生流因故。譬如轮行于地。以手转之。以地为依处。所依止四大是何地。能依止身口业是何地。偈曰。依止自四大。身口业有流。释曰。欲界身口业。但依欲界四大生。如此乃至第四定身口业。依止第四定四大生。偈曰。无流随生处。释曰。若无流身口业。随地受生人所得。应知即依此地四大生。由不堕于界故。无流四大无故。由彼力生故。此中有教无教二业应知。偈曰。无教非心取。流果众生名。流心取大生。释曰。无教者其相云何。非心心法。依止等流果。似因故。众生法故。等流果心心法所取四大。依此无教生非定地。无教品类如此。定地云何。偈曰。定生增长果。无取异大生。释曰。定无教无流无教。皆从定心生。依定所生增长。非心所取。不异四大生。不异者。若依止此四大。离杀生无教生。即依此四大。乃至离无义语无教生。云何如此。如心四大不异故。于波罗提木叉戒中。各各依四大。七无教戒。生有教色等流。若属身是心所取。此有教色若生。为破前相貌相续起为不。若尔何有。若破前后生果报色。已断由更相续故。则违毗婆沙执。若不破而生。云何于一四大聚中。有二相貌起。是时有别等流四大生。依此有教色生。若尔依随一身分。有教色生。此分则应大本。彼四大所遍满故。若不遍满。云何由具分起有教色。由身空故。故彼有处。此业由别义说。有二种三种五种。此中无教有二种一善二恶。偈曰。无无记无教。释曰。云何如此。无记心力弱。是故不能引生有力业。若因已灭。此等流果恒相续起。偈曰。余三释曰。余业有三种。谓<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记。何者是余。谓有教及故意。偈曰。复不善欲中。释曰。若恶业应知唯于欲界中非余界。三恶根及无渐无羞灭故。若善无记一切处有。以不遮故。偈曰。色无教。释曰。若<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>有无教。何况欲界。于<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>无。无四大故。若是处有身口生。此中有身口护戒。若尔若人身在欲色界。入四无色定。应有无教。譬如无流无教。是义不然。此不堕<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>故。通无色界无教。不应依止不等类四大生。背一切色故。故无色界定不能引生色。制伏色相故。持戒为对治破戒。破戒但是欲界法。于欲界由四种远。无色界最远。谓依止取相境界对治故。是故于中无无教。毗婆沙师说如此。偈曰。有教有观二。释曰。是有教色。于有观二地中有。谓欲界及初定。上去皆无。偈曰。欲无无记教。释曰。于欲界无有覆无记有教。于梵处则有。何以故。曾闻大梵王有语从谄曲生。此于自大集中。为避净命阿输实难赞叹自身。若尔从第二定以上。若无言说云何有声入。以外四大为因故有声入。余师说。于第二定等亦有言语。但是无覆无记。无善无染污何以故。若人生彼处。如此类下地心。不能引令现前。为生身口。有教业最粗下故。已弃舍故。前义是彼所说。复有何因。离梵处于上无有教业。于欲界无有覆无记有教业。偈曰。缘起无有故。释曰。若有觉观心。能起身口有教业。此心于第二定等则无。此若起必由修道所灭心起。见谛所灭心。依内门起故。是故于欲界中。无有覆无记身口二业。为由随发起。应知诸法善恶性为不尔非。云何。由四种因。一真实。二自性。三相应。四发起。此中偈曰。<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>真实善。释曰。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>者。一切苦寂静。最极平安故。是真实善。譬如无病。偈曰。自性根惭羞。释曰。根谓三善根惭及羞。此法由自性是善。不观别相应发起因故。譬如良药。偈曰。相应彼杂故。释曰。与三善根及惭羞。相应诸法。由相杂故是善。若彼不与此相应则无善性。譬如良药杂水。偈曰。发起有教等。释曰。身业口业。及心不相应诸行。与善根等相应法所发起。由发起故是善。譬如煮良药汁所成乳。诸至得等非同类心所发起。云何是善性。由此义故善。如所说四种善。偈曰。翻此四名恶。释曰。云何名四恶。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>名真实恶。生一切苦为体。最极不平安故。譬如有疾。三恶根及无惭无羞。名自性恶。不观余因成故。譬如恶毒。与彼相应诸法由相应故名恶。譬如恶毒杂水。彼法所发起。身口二业。生等及至得。由发起故名恶。譬如煮恶毒汁所成乳。若尔无一有流法应成无记或成善。皆入生死内故。如汝所言。实皆如此。若有流法。于果报不可记。说名无记。若有流法。于可爱果报有记说名善。若真实无记。必应寻求。偈曰。实无记二常。释曰。二种<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。非有别方便成无覆无记。谓<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>及非择灭。此义应思。若身口业。由随发起成善恶性。四大云何。非善恶性。作者于业中有故意。非于四大。若尔入定观人。于无教无故意。非寂静心。不能发起无教非同类故。云何无教成善。天耳天眼。应立为善性。于中故意所发起故。此中汝应作功力。是汝所说。见谛所灭心。不能发起身口有教业。此义若尔。云何佛世尊说。从邪见邪觉观。生邪语邪业等亦尔。如此等此义不相违。何以故。偈曰。缘起有二种生因刹那起。释曰。有教无教缘起有二种。一生因缘起。二共刹那缘起。于一刹那共起故。偈曰。于二初能生第二随彼起。释曰。生因缘起者。唯能生能引。未有令有故。共刹那缘起者。唯能随共生。于事时不相离故。此心于此事中有何能。虽先被引。若离此心事则不起。譬如死人。若尔若人<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。于生无教戒。此心云何有。若人有心此身口业则明了起。是此心功能。此中偈曰。能生见谛灭<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。释曰。若见谛所应灭心。能为身口业生因。何以故。能发起彼觉观生资粮故。不能随起缘。外门起心事时。此心已无故。是色若以见谛心为缘起生。此色亦是见谛灭。斯有何失。则违阿毗达磨。彼藏云。与明无明不相违故。无色见谛所灭。此立未成。何以故。是四大应成见谛灭。同心所起故。此失不应有。如其非善非恶。若成如此复云何。此亦不可。何以故。此色无道理成见谛灭。亦不成非所灭。与明无明不相违故。是故依生因缘起。于经中说无相违。偈曰。修道灭生随起具能。释曰。若修道所灭意识有二种。谓能生及能随。偈曰。五识唯随起。释曰。五识无分别故。但与身口业共一刹那起。不能为引生因。此中有四句。见谛心但是生因缘起。五识但是共刹那缘起。修道所灭意识具二种。一切无流。无二种如能生缘起。共刹那缘起亦尔不。此义不定。偈曰。于能生善等。随起有三种。释曰。生因缘起若善。共刹那缘起。或善恶无记。生因缘起若恶无记亦尔。偈曰。于佛等或善。释曰。于佛世尊一人。生因缘起共刹那缘起。此二必同。若善同善。若无记同无记。或善者。有时生因缘起无记。共刹那缘起或善。无时生因缘起是善。共刹那缘起是无记。何以故。诸佛正说。无时萎歇。余部师说。诸佛世尊。无无记心。何以故。佛世尊相续。一向自性是善。恒寂静故。于经中说</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十一卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第十一卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　中分别业品之二</p><p>　　分别说无教已。偈曰。复一切与教。正作与中应。释曰。一切人于护不护及中住。乃至造有教业未竟。是时中与现世有教相应。偈曰。<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>后与过。至舍。释曰。从初刹那后乃至舍。与过去有教相应。偈曰。非来应。释曰。无人与未来有教相应。偈曰。与有覆无覆。过去不相应。释曰。若有教或有覆或无覆。与过去不相应。未来亦尔。若法势力弱。至得亦弱。不得相续。此势力弱。何法所作。心所作。若尔心所作有覆无记。勿势力弱。是义不然。身口业昧钝故。依他成故。心则不尔。此无覆有教。亦由弱力故意所起。是故其力最弱。于前已说。有人住于不护。何法名不护。偈曰。不护及恶行。恶戒或业道。释曰。如此等是不护众名。此中不能禁制恶中身口。故名不护。聪慧人所诃故。得非可爱<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>故。故名恶行。善戒对治故。故名恶戒。身口所造故名业。根本所摄故。名业道。有人与有教相应。不与无教相应。此义有四句。此中偈曰。但与教相应。中住下心作。释曰。若故意弱。或作善或作恶。此人住于非护非不护。但与有教相应。不与无教相应。何况作无记。除有摄福德业处及业远。偈曰。舍未生有教。余无教<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。释曰。但与无教相应。不与有教相应者。若圣人已易生。若未作身口业。或已舍身口业。与二相应者。若人住波罗提木叉护。起身口业。或住非护非非护。由最上品故意。或作善或作恶。与二不相应者。除前三句。说住护不护及中人。安立至得有教无教义已。云何能得此护。偈曰。定生由定地得。释曰。是时若得有流定地心。或根本定或近分定。是时即得定生护。以一时俱起故。偈曰。由圣依此无流。释曰。若得此定地无流所依。即得无流护。此中有六定地。或皆无流。谓四定非至中间。此义后当说。偈曰。波木叉。由互令他等。释曰。波罗提木叉护者。由令他方得。若他令彼彼亦令他。此或从大众得。或从一人得。从大众得者。谓<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a><a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>式叉摩那护。从一人得者。谓所余诸护。有毗那耶。毗婆沙师说。受大戒有十种。为摄此故说等。何者为十。一由自然得大戒。如佛婆伽婆及独觉。二由入正定聚得大戒。如憍陈如等五比丘。得苦法智忍时。三由呼善来比丘得大戒。如耶舍等。四由信受大师得大戒。如摩诃<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。五由答问难得大戒。如须陀夷。六由信受八尊法得大戒。如大瞿耽弥。七由遣使得大戒。如达摩陈那比丘尼。八由能持毗那耶为第五。于边地国得大戒。九由十部于中国得大戒。十由三说三归得大戒。如六十贤部共集<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。是诸人波罗提木叉护。非定随有教。此波罗提木叉护。若欲受几时应受。偈曰。随有命善受。正护或日夜。释曰。七部所持波罗提木叉护。随有命应受。优波婆娑护。一日一夜受时决定。如此护时边有二。种谓<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>边。日夜边。于日夜重说。故成半月护。何法名时。此名显有为法义。于四洲是光位说名曰。闇位说名夜。此义可然。谓从命终后。虽复有受护不得生。依止非同分故。由此依止于中不能起加行故。不能令忆本行故。若人一日一夜后。或五日或十日。受优波婆娑护。于多优波婆娑护生中。何法能遮。应有法能遮。由如来于经中说。优波婆娑护。但一日一夜。此义今应思。为如来见一日一夜后优波婆娑护不得生故。但说优波婆娑护一日一夜为。为安立难调伏根<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。正受优波婆娑护。止于一日一夜中。如此事云何可思度。此时若护得生。与何道理相违。此事后不曾见如来为一人说故。毗婆沙师。非如来所说则不敢说。不护决定时云何。偈曰。无日夜不护。释曰。由此人乐一期作恶业。是故不护生。不得止一日一夜。不如优波婆娑护。何以故。如彼执。偈曰。由不受如此。释曰。无人受不护。如受优波婆娑护。愿我一日一夜中。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>不护。由此业是聪慧人所诃。若尔亦无如此受持。愿我一期中受持不护。是故勿一期得不护。虽不受持如此。由一向违善。故意作此恶事。故得不护。不由暂时违善故意得。是故皆得一生不护。优波婆娑护。虽心不一向。由求受故意力。是故一日一夜。得随所求故。若有人求得不护。暂时受不护。必得不护。此义非所曾见故。不可立如此。经部师说。如护无教非有实物。不护亦尔。非有实物。此不护以求恶事故意为体。共随续事。因此若人虽起<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。犹说有不护。以不弃舍此故。复次此优波婆娑护。若人欲一日一夜受。受法云何。偈曰。晨朝从他受。下坐随后说。布萨护具分。离庄饰昼夜。释曰。晨朝者。谓日初出时。此护时最促。唯一日一夜故。若人先已作求受意。谓我恒于第八日等时。必应受优波婆娑护。若食已亦得受。亦应从他受。不得自受。由此观他故。若有犯<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。为不犯故。下坐者。或蹲或跪下心合掌。除病时若人无恭敬心。诸善护则不生。随施戒人语。后说勿前勿俱。若尔可说从他受。若不尔受施皆不成。若受必须具分受。不可减。分离庄饰者。离非旧庄饰。何以故。若常所用庄饰。不生极醉乱心如新庄饰。若受必须尽一日夜。至明旦若不如此法受。但生善行。不得优波婆娑护。此善行能感可爱果报。若执如此行。猎行邪淫人。于夜于日受优波婆娑护。必有果报不违道理。优波婆娑者何义。由此护此人近阿罗汉边住。由随学阿罗汉法故。又近随有命护边住故。或说名布沙他。生长单薄善根众生。复净善根故。名布沙他。如偈言</p><p>　　由此能长养自他净善心</p><p>　　故佛如来说此名布沙他</p><p>　　云何受此护。必须具八分。由此义偈曰。戒分无放逸。分修分次第。前四一后三。释曰。前四名戒分。从离<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>乃至离<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。此四离性罪故。次一名不放逸分。谓离饮酒。若人善受具戒。由饮酒醉乱。能扰动诸学处海。由放逸故。后三名修分。乃至离非时食。能随助厌离心为<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故。若不受无放逸分及修分。有何过失。偈曰。由此失念醉。释曰。若人饮酒。即忘失是事非事念。若人受用高胜卧处及舞歌音乐等。心醉乱即生。于此二中。随用一处。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>不远。若人依时食。由离先所习非时食。忆持优波婆娑护。即起厌离心亦生。若无第八。此二则不有。有余人说。唯离非时食。于此八中。说名优波婆娑。所余八。为此分开。观听舞歌着香花等分为二。若执如此。则为经所违。经云由离非时食。是第八分。我今随学随行诸圣阿罗汉。若尔何别法。名优波婆娑。以此八为分。是聚处随一一法说名分。譬如车分及四分军五分散。应知八分优波婆娑亦尔。毗婆娑师说。离非时食。是优波婆娑。亦是优波婆娑分。譬如<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>是圣道亦是圣道分。择法觉分是觉亦是觉分。三摩提是定亦是定分。宿旧诸师说。不可立正见等为彼分。若前生正见等。于后生成分。初刹那生圣道不应成八分。为唯优婆塞有优波婆娑护。为余人亦有。亦有。偈曰。余人有布萨。若无三归无。释曰。若人非优婆塞。于一日夜中。归依<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧已。后受优波婆娑护。此人则得此护。异此则不得。除不知。经中说。佛言摩诃那摩。若人在家白衣丈夫。与男根相应。归依佛归依法归依僧。亦说此言。愿大德忆持。我今是优婆塞摩诃那摩。唯由此量。此人成优婆塞。为由受三归即成优婆塞。为不尔。外国诸师说非。罽宾国师说。离<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>则不成优婆塞。若尔经中说云何。此中<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违。由此言五戒发故。是故偈曰。由称优婆塞护。释曰。由信受自称名。是优婆塞。此人则发优婆塞护。是时信受已自称言。大德忆持。我是优婆塞。从今时随有命我离命。离夺命等事。由除中间语故。但言离命。已得戒人。为令识可持非可持故。后为说戒。偈曰。说如比丘护。释曰。已得具戒更令受学处。<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>亦尔。为令识戒相。从此从彼汝今应护。优婆塞亦尔。离五护无别优婆塞。偈曰。一切若有护。一处等云何。释曰。若一切优婆塞。皆住优婆塞护。云何佛婆伽婆。说四种优婆塞。一持一处。二持少处。三持多处。四持具处。偈曰。能持故说尔。释曰。若人能持。随所应持。于中说此人为能持故。说一切优婆塞本有护。今此执违经起。云何违经。由信受称言即得五护。谓彼说离命。此言云何违经。经言不尔。经言云何。如摩诃那摩经说。于中是明优婆塞相。于余处则无。是处说如此文。随有命至于命。我今专信愿尊忆持。于此文中。见<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>人。显示见知种类。由寿命信受<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。若为救寿命。我亦无义更舍正法。此文不为显优婆塞相。如汝所说文句。谓为离命。于余处非所曾见。何人能从此不明了文。持一处等文。若依破戒人。说此文句。于中问亦不相应。何况答。何以故。何人已解优婆塞护。不解如此若人不破此戒是人持此戒。若人不识优婆塞护量。依能持如此护量人故问。此问则应理。问言<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>几量为优婆塞持一处。乃至几量。为优婆塞持具处。毗婆沙师说。若离护亦成优婆塞。若不具受护。亦应成比丘及沙弥。犹如优婆塞。优婆塞等护分量。决定云何。随大师分别所立。分别决判立优婆塞等异。汝亦应许。由随大师分别所立。何以故。若未有护。如世尊安立优婆塞安立沙弥比丘。则不如此。罽宾国师。不许此义。一切护偈曰。下中上如意。释曰。八部所持护。有下中上品。云何得成。由求受故。意有差别。若作如此执。阿罗汉波罗提木叉护。应最下劣。凡夫应最上品。若唯受护。不受三归。得成优婆塞不。不得。除无知。若人归依佛法僧。此人归依何法。偈曰。能<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>僧法。无学及二种。归依及<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。归依佛法僧。释曰。若人归依佛。必归依能成佛无学诸法。何者能成法。由彼法胜故此身说为佛。或由得彼法。于一切觉中。有胜能故。说此人为佛。此法何相。尽智等共伴类。色身前后无差别故。若归依佛。为归依一佛。为归依一切佛。若依道理。归依一切佛。道相不异故。若人归依僧。此人即归依能成僧。有学无学诸法。由得彼法。八<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>人成僧。不可破故。若归依僧。为归依一僧。为归依一切僧。若依道理。归依一切僧。道相不异故。经中说于未来世中当有名僧。此人亦归依此僧。此言为显现在僧宝最胜功德。若人归依法。此人即归依涅槃。所谓择灭自他相续中。惑及苦。寂静为一相故。若定以无学法为佛。云何于如来边。起恶心出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。得无间业。由损害依止故。彼法亦被损害。毗婆沙师说如此。阿毗达磨藏不说如此。唯无学法是名佛说。云何成佛诸法名佛。不遮依止为佛故。是故此难不成难。若不尔。佛在世心。则不成佛。僧亦应尔。唯戒能成比丘。是故戒是比丘。如人<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>比丘。则供养能成<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>。如此若人归依佛。则唯归依能成佛无学法。有余师说。若人归依佛。此人即归依十八不共法。归依体性云何。有教言语为性。归依者何义。救济为义。由依止此三。永<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>一切苦故。如佛世尊所说偈</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十二卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十二卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别业品之三</p><p>偈曰。复有五种业。释曰。复有余师说。业有五种。不定受业分为二。谓于报或定。于报或不定。此中现法应受业者。于此生造业。即于此生熟。生应受业者。于此生造业。于第二生熟。后应受业者。于此生造业。从第二生后熟。有余师说。现法应受业<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。于余生亦有。由随此功力立名故。勿最强力业果报劣薄。毗婆沙师不许此义。何以故。彼说有业果报亲近果报非胜。有业翻此。譬如外种子。葵三月半结实。麦等六月结实。偈曰。余师说四句。释曰譬喻部师。说有四句。有业于位定于报不定。若业现报于报不定。有业于报定于位不定。有业二处皆定。若现报等于报亦定。有业于二处皆不定。若业不必应受。于报亦不定。于彼人此业成八种。现报有二种。定不定乃至定不。定亦尔。彼说现报等为定。第四不定。于一<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>中。得引四业。俱起不得。云何得。于三教他自行邪淫。此四若一时究竟。是四业中。偈曰。引聚同分三。释曰。何以故。此现报业。不能引聚同分。现有同分故。于何界何道中。几种业可引。偈曰。一切处四引。释曰。于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>及一切道中。四种业皆有引义。此四或善或恶。此引如相应。此开今更立遮。偈曰。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>引善三。释曰。于地狱中三种善业有引。现报无引。于中无可爱报故。偈曰。凡于离欲处。坚不引生报。释曰。凡夫人若于此地已得离欲。若坚住无退失于此下地中。不得造生报业。能造余三。偈曰。圣不造余报。释曰。坚言流至此句。若<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>于此地已得离欲。无复退堕。不能造二业。谓生报及后报。何以故。此人不能更感下地生故。但能造现报业及不定报业。于随现生处。偈曰。欲顶退不造。释曰。若圣人有退堕。已离欲界及有顶。于此二界不得造生报及后报业。何以故。此人已退果。无舍寿义。此义后当广说。于中阴有引业义不。有。偈曰。二十二种业。于欲中阴引。释曰。若欲界中阴。能引二十二种业。此云何。胎位有五。谓柯罗逻。頞浮陀。俾尸。伽诃那。波罗舍佉。已生位有五。谓婴儿童子少壮中老。于此位中中阴<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。有时引柯罗逻受业。或不定或定。乃至老位应受。及中阴中应受。偈曰。此业但现报。释曰。此中阴所引业。定有十一种。应知必是现报。何以故。偈曰。彼是一果报。释曰。此聚同分。唯有一一业所引故。是中阴聚同分。及中阴后类十位。是故不说别业感中阴。由此二同生报业所引故。复有何相应。知此业是定。偈曰。重惑及净心。或是恒所行。于<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>田定。能损自父母。释曰。是业由重惑所造。或由重<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>所造。或恒时所行。或于有功德田所起。应知此业必定此中有功德田。谓<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>或人差别。人差别者。若人至果胜类。或定胜类。此中若无重惑心。及重善心。此业或善或恶。必成定业。若恒所行亦尔。复次若依自父母。以率尔心造随类违损业。此业亦必定受报。余业则不定。复次现法应受业。其相云何。偈曰。此业成现报。由田意胜异。释曰。现报业者。或由田胜异成。如传说。有一<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。于大众中行女人言。故现身即转根成女。此传有文。由故意胜异者。如传说。有一黄门。由<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>牛黄门事故。现身即转根成男。复次偈曰。永离欲地故。释曰。若业或善或恶。依此地生。由永离欲。此地此业。则成现报业。此业何相。偈曰。若业于报定。释曰。若业于果报定。于位不定。此业是所说现报业。若业于余位中定。此业定于余位中与报。有此业人无离欲故。若不定云何。此业无报。由永离欲故。此田何相。于中所造业。必定得现报。若总说。大比丘众以佛为现前上首。若约人差别有五。偈曰。灭定无诤慈。见罗汉果起。于彼损益业。果于现法受。释曰。若人出无。心定观。即得最极心寂静。由此定似<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>故。此人因此定。如往还于涅槃。若人出无诤三摩提。观无量众生。无诤利益。善意所随逐最猛盛。无量福德熏修所变。相续正起。若人出无量慈观。无量众生安乐善意所随逐最猛盛。无量福德薰修所变相续正起。若人出<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>观。见谛所破惑灭尽无余。故新得转依。清净相续即起。若人出阿罗汉果观。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所破惑灭尽无余。故新得转依。清净相续即起。是故于此五人或作善利益事。或作恶损恼事。此业果报。于现世必定应得。余人所修得道。未究竟故。若出未<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a><a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>果观。新得转依清净不尔。是故彼不及前人<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。若果报受为胜。是故此义应思。有业但以心受为果报非身受不。有业但以身受为果报非心受不。说有。偈曰。若善业无觉。许受为果报。此受是心法。释曰。无觉业者。从中间定乃至有顶。此无觉善业。唯以心受为果报。云何非身受。此身受必与觉观俱起故。偈曰。若恶唯身受。释曰。若恶业定以身受为果报。云何心受非彼报。此业以苦受为报。若苦受在心地则成忧根。此忧根非果报。于前已说。若尔众生有癫狂。此癫狂于何心有。复由何因生。偈曰。心癫于心心。释曰。心心谓<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。何以故。若人在于五识。则无癫乱事。五识无分别故。偈曰。此从业报生。释曰。此心癫乱。从众生业报生。若人以物咒及增加所作。散坏他心。或不求欲众生。令饮毒饮酒。或恐怖众生。于猎等时。或在矿野等处。纵火焚烧。又以坑阱陷坠众生。或由余业令众生失念。因此业报。此众生于未来世心则癫乱。复有别因。偈曰。怖打不平忧。释曰。怖者。诸鬼神作可畏形相来逼。此人见即惊怖。打者诸鬼神。因人恶行起憎恚心。于此人末摩作打拍事。不平者。风热淡互相违反。令身四大皆不调适。忧者。如婆师絺等。若意识癫乱。此心癫乱。从业报生。云何言心受非果报。我等不说此心是果报。何为四大违损是果报。从此心起故。说心从果报生。由业所生四大不平等。故心狂乱。不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>失念。说此心名癫狂。若作如此四句得成。有心狂故乱。非散故乱。广说应知。狂乱非散乱者。心不自在无染污。散乱非狂乱者。心自在有染污。狂乱亦散乱者。心不自在有染污。无狂乱亦无散乱者。心自在无染污。何众生有狂乱心。偈曰。欲界除鸠娄。释曰。于欲界中有。唯除北鸠娄。何以故。于天中亦有狂天。何况于人畜生鬼神道中。地狱众生皆恒狂乱。是彼众生万种损恼恚害。末摩量重难忍。苦受所逼。于自身亦不了别。何况能识是非等事。何心何啼天地狱传此中应说。于圣人亦有心狂乱。由四大不平等故。除佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。若约先定业。受报已毕。若约不定业则无果报。不由怖畏。已度五怖畏故。不由损害。永无恶行能生鬼神憎恚心故。不由忧恼。证见法如实性故。复次于经中说有三曲。身曲口曲意曲。复有三粗。身粗口粗意粗。复有三涩。身涩口涩意涩。此中次第应知。偈曰。说曲粗涩业。谄曲嗔欲生。释曰。若身业从谄曲生。说名身曲业。邪曲性类故。口意曲业亦尔。若身业从嗔恚生。说名身粗业。忿怒性类故。口意粗业亦尔。若身业从贪欲生说名身涩业。染污性类故。口意涩业亦尔。偈曰。黑白等差别。复说业四种。释曰。有黑业黑果报。有白业白果报。有黑白业黑白果报。有不黑不白业不黑不白果报。生能灭尽余诸业故。偈曰。非善欲色有。善次第应知。黑白有二业。能灭彼无流。释曰。非善业者。一向名黑。本性黑故。果报亦黑。果报非可爱故。此业唯欲界。有<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>善业一向白。非黑所杂故。果报亦白。果报可爱故。云何不说<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>业。若是处有二种果报。谓中阴生阴。有三种业。谓身口意。此中说黑白业。余处不说。有余师云。此亦于余经中说。欲界善业名黑白业。非善所杂故。果报亦黑白。果报相杂故。若分别此业。须约相续。不得约性。何以故。无一业如此种类及果报。此业是黑即是白。无如此义。互相违故。若尔恶业为善业所杂故。应成白黑业。恶为善所杂。此义不成。于欲界中恶力强故。唯善可杂。由力弱故。无流业者。若起能灭尽此三。何以故。此业非黑。无染污故。非白。无白果报故。此不白言。是不了义说。有别意故。佛世尊于大空经中。依无学法说。阿难如此法。一向白一向善一向无诃。于阿毗达磨藏中说。何者为白法善法及无覆无记法。无果报者。不堕于界故。与<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>相违故。一切无流业为悉能灭白等三业不。不。此云何。偈曰。于法忍离欲。于八次第道。十二种故意。此能灭黑业。释曰。于见谛道中有四法忍。于离欲欲界中有八次第道。于此中是故意有十二种。此业一向能灭黑业。偈曰。于第九故意。能灭黑白业。释曰。于第九离欲。欲界次第道故意。能灭黑白业及黑业。偈曰。白业离欲定。后次第道生。释曰。若人定定作离欲。是第九次第道。此中有四种故意。一向能灭白业。云何但第九次第道。能灭白业。不由余。此善非自性灭。已灭可更现前故。虽然缘彼为境惑灭故。故说彼灭。是故乃至余一品惑。犹以彼为境未灭。未可说彼已灭。偈曰。余说地狱报。及欲受报二。释曰。有余师见。应受地狱报业。离地狱于欲界余道应受报业。次第应知。是黑业是黑白业。何以故。唯地狱定是恶业报故。说受地狱报业名黑业。离地狱于欲界余道中。有<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业报。是故受彼报业。名黑白业。偈曰。余说见灭黑。释曰。有余师说。见谛所灭业名黑业。与善不相杂故。偈曰。余欲业黑白。释曰。欲界业异见谛所灭业。名黑白业。此异云何。谓修道所灭。何以故。此业有善有恶。于经中说。有三牟那。谓身牟那口牟那意牟那。此中偈曰。无学身口业。意应知次第。三牟那。释曰。无学身口二业。名身口牟那。无学心名意牟那。非意业。何以故。心是真实圣者。此由身口故定可比量。复次此身口二业。离恶为性。意业但思。非有教故。不能比量为离。故说牟那。是故<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>能离故。说名牟那。云何说无学不说余。阿罗汉是真实圣者故。一切或言分别灭故。偈曰。三净。释曰。于经中说。有三种清净。谓身清净。口清净。意清净。此三种清净。偈曰。一切三善行。释曰。一切身善行。名身清净。一切口意善行。名口意清净。能除遮恶行及惑污故。或暂或永。此正说何为。众生信乐邪牟那及邪清净。为令思量远离故。经中复说有三种恶行。偈曰。恶身口意业。说名三恶行。释曰。身口意业若不善。次第应知。名身口意恶行。偈曰。非业贪嗔等。说意恶行三。释曰。亦有恶行非业性。谓三意恶行别类。非故意故。譬喻部说。贪等名意业。于故心作。经中说。若执如此惑业成一性。若尔何有若惑成业。无如此义。于经中由故意因。此门起故。大师由彼显故意。毗婆沙师说如此。若不尔。惑业成一体。十二缘生分。则不成就故。不许如此。由此于果报非可爱。聪慧人所诃故。说身口意行名恶行。偈曰。翻此名善行。释曰。由翻恶行应许为善行。谓善身口意业。及无贪无嗔<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。无利益损恼他事故。云何正见邪见得成。善恶性为损益根本故。是所说恶行及善行。此中偈曰。由摄彼粗品。故说十业道。如理谓善恶。释曰。前所说恶行及善行中。由摄明了易知善恶二业。是故经中说十业道。如理应知。若善从善行出。若恶从恶行出。于中何恶行及善行非所摄。于恶业道中。是身恶行一分非所摄。谓前分后分。所余染污亦尔。此非粗显故。若身恶行。能令他失离<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>财物妻妾。说名业道。欲令他分别离此故。于恶行别立意恶行一分名故意。于善业道中。是身善行一分非所摄。谓前后分。及离饮酒等。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a><a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>等。口善行如爱语等。意善行如故。意如此业道中。偈曰。六恶有无教。释曰。唯六不善业道。定以无教为性。谓杀盗妾语两舌恶口无义语。若教他作。无根本有教故。偈曰。一二种。释曰。邪淫恒以有教无教为性。何以故。此自身所成就故。若令他作<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。不如自作故。偈曰。身作。释曰。是六种业道。若自作亦各二种。谓有教无教。若正起有教时彼即死。则具有教无教。若起有教后方死。但是无教。若善业道。偈曰。七二种唯善。释曰。善有色七业道。必定二种。谓有教无教。受所得戒依属有教故。偈曰。无教从定生。释曰。定所生定无流所摄诸护。说名定生。彼唯无教。但依属心故。偈曰。近方便有教。释曰。业道前方便。必有教为性。偈曰。无教或有无。释曰。若最重上心惑所污惑。蜜味心清净。作方便加行。则有无教。若异此则无。偈曰。后分则翻此。前分<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>生。释曰。翻前分方便义。应如是业道后分。何以故。此后分必无教为性。有教或有或无。若人已作业道。后更起同类法。则有有教。异此悉无。复次此业道前分。根本后分。从何位可得安立。譬如有人欲杀禽兽。从床起捉直行往彼所。揣触其身即买牵还。将入屠所欲就杀之。即便捉仗与一下手或再下手。乃至未令命断。名杀前分。是事能令命断。此中是有教无教身业。共一刹那起。是名根本业道。何以故。由二种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。是人为<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>罪所触。由作加行及果究竟故。从此刹那后无教刹那。悉是业道后分。乃至治洗贩卖。或煮自食称赞其美。如此等有教刹那。悉成后分。如此于余六业道中。前分根本后分义。如理应知。不平贪等三无前后分。由现前起即成业道。汝今应说此为是众生正在死有有教无教成业道。为已死成业道。若尔何有。若所杀众生正在死有。能杀及令杀人。若共一时死。应有犯杀生罪。悉檀义不尔。若已死成业道。是悉檀所说。谓若由此害事。能令彼离寿命。是有教身业。及共一刹那起无教。是名业道。此言不应说。复次于阿毗达磨藏中说。为有如此义不。是众生已被杀。是人未离杀生事。有。譬如已令此众生离命根。能杀加行未舍未息。此中后分由前分名说。此文句与毗婆沙义相违。是根本此时中未灭故。是故如无失道理。应许如此。云何无失。此中用前分名说根本。此则无失。若尔如此相有教。云何成根本业道。云何不成。无能故。若尔无教云何成业道。是故加行果成就时。此二成业道。业道者。有时是余业道前分。或是余业道后分。是杀生事位。有时成业道。有时成前分。譬如有人欲杀怨家。作恶方术杀禽兽祠鬼神。或由偷他物。或于彼妇作邪淫。共彼人欲杀怨家。或说<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>两舌恶口软语。破彼亲友随多少能为救护者。或于彼起不平贪。或于彼生嗔。或为杀彼增长邪见。如此于余业道。如理应思。贪等不应成前分。何以故。若由唯发起心。是人正行前分。无如此义。若离行事经中说。比丘杀生有三种。一从贪欲生。二从嗔恚生。三从无明生。乃至邪见亦尔。此经中如此杀生相云何。杀从贪生者。若为得彼身分。为得物。为戏乐等事。令他失命。或为救济自身及自眷属。从嗔生者如为报怨。从痴生者。如大祠舍施人。由<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>法意故。又如诸王。随法文句量故。行重罚怨家及恶人。诸王得生大福德。又波尸国人杀业亦从痴生。何以故。彼说如此言。若二亲老困。及有重疾。必应为舍命。有频那柯外道说。蛇蜈蚣啮毒等。恒能伤害人。此必应杀鹿羊鸟牛等。为供人庖厨故受生。若杀无失。若杀生从邪见生。亦是从痴生。盗从贪生者。随其所求不与而取。或为得别利养爱重好名。为救济自身及自眷属。从嗔生者。如为报怨。从痴生者。如诸王由随法文句量。为罚恶人故夺其物。又如<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>言。一切物梵王已舍与婆罗门。由婆罗门力弱。诸蛮谩取受用。是故若婆罗门夺取夺取自物。若食食自物。若衣衣自物。若施施自物。于彼无非他财想。若盗从邪见生。亦是从痴生。邪淫从贪生者。于他妻妾先起贪爱方行邪淫。及为得利养爱重。为救济自身及自眷属。从嗔生者。如为报怨。从痴生者。如波尸国人娶母等事。又如于瞿娑婆祠中。有余女吸水啮草。是人行着其亲。或着姑姨姊妹同姓等。又如频那柯外道说。女人如臼花菓熟食水渚道路等。妄语等从贪嗔生如前。妄语从痴生者。如皮陀言</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十三卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十三卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别业品之四</p><p>由分别安立业道。此中是义应说。几种业道故意。与彼相应俱起。偈曰。故意俱乃至。与八恶业道。释曰。有时故意。与一恶业道俱起。离余业道。若贪欲等起现前。若人无染污心。由先教他作有色业道。随一成就时。与二俱起者。若人起嗔恚心<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>时。或贪欲所染心行。盗及邪淫时。或说非应语。与三俱起者。若人起嗔恚心。于他<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>俱时杀盗。若尔是时偷盗不由贪欲成就。若人心不异成就业道时。应知前决义。若人贪欲等所染。由教他有色二业道成就时。如此等与三与四俱起者。若人有欲破他和合意。说<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>恶语。此中意业道随一。口业道有三。有时贪欲等所染。由教他别三成就时。余五六七应知。合如此义。与八俱起者。于六教他。自行邪淫。若彼共一时俱成。由恶业道义极于此偈曰。若善乃至十。释曰。若论故意与善业道相应不相应。乃至得与十业道相应。已作如此通说。为简择此故。更作别说。偈曰。不共一八五。释曰。故意无与一八五业道相应义。此中与二相应者。于善五识起时。入无色定时。尽智无生智起时。与三相应者。与<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>相应<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>起时。与四相应者。恶心无记心起时。正受优婆塞护及<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>护。与六相应者。善五识起时。受前二护。与七相应者。善意识起时。受前二护。或恶心或无记心起时。受<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>护。与九相应者。善五识起时。受比丘护。若意识与尽智无生智相应。是尽智无生智相应心。与定相应。与十相应者。异此于余处善意识起时。受比丘护。一切定护无流护相应故意。离尽智无生智。若与非护所摄。亦得与一相应。若人异心受一远离分。亦得与五八相应。若人善意识起时。一时受二远离分。或受五远离分。复于何道几业道。或恶或善。由现前及至得俱起。偈曰。非应语恶语。嗔于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>二。释曰。是三种业道。于地狱由二种义有。一由现前有。二由至得有。由悲泣有非应语。由互相骂有恶语。由相续恼互相憎故有嗔恚。偈曰。由至得贪欲。邪见。释曰。若由至得有贪爱邪见。不由现前有。无可爱尘故。证知业果故。由业尽死故无杀生。不摄财及妇故无偷盗邪淫。无用故无妄语。恒自无和合故无破语。偈曰。北洲三。释曰。由至得言流。贪欲嗔恚邪见。不由现前有。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>所无摄故。相续软滑故。嗔恚类境无故。无恶意故。偈曰。第七彼自有。释曰。非应语于彼现前有。何以故。彼人有时起染污心歌。无恶意故。无杀生等。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>定故。不摄财及妇故。无用故。彼人云何作非梵行。彼人若欲共此女人和合戏。即执彼手俱往树下。此女若堪行。树即密覆。便与交通。若不堪行树则不覆。即相背去。偈曰。于余欲十恶。释曰。自有言流。除地狱及北洲。于余处十种恶业道。由现前亦有。于畜生鬼神天道中。有非不护业道。于人道中。不护所摄业道亦有。若天不能杀余天。能杀余道众生。诸天若斩首斩腰。即便舍命。说恶业道已。偈曰。后三一切有。现前至得故。释曰。于五道及<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。一切处无贪无嗔正见。由现前及至得皆有。偈曰。无色无想天。由至得七。释曰。身口七善业道。于<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>及无想天中。但由至得有。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>已生无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。与过去未来无流护至得相应故。无想天与定护至得相应。随所依止地。圣人所生及所舍无流护。若生无色界。与此过去护相应。与依五地未来护亦相应。偈曰。余。由现前亦有。除地狱北洲。释曰。余者谓别界别道。于余界余道中。是七种善业道。由现前亦有。除地狱及北洲。是余者谓畜生鬼神。于中唯有非护。于色界但护所摄。于余处具有二种。复次是十种恶业道。及善业道。偈曰。一切皆能与。增上流报果。释曰。今且论恶。由一切十恶所事修习数起故。生于地狱。是名<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>果。若受地狱报竟。得如此类。谓人道等聚同分。由断命故。寿命短促。由偷盗故。有财物障难。由邪淫故多怨憎。于妻妾有障碍。由妄语故。多被诽谤。由破语故。亲友不和穆。由恶语故。恒闻不可爱声。由非应语故。有理实言人不信受。由贪欲故多重贪欲。由嗔恚故多重嗔恚。由邪见故。闇钝多痴。此见多无明故。是名十恶等流果。于人道中寿命若短促。亦是善业果。此云何是杀生等流果。不说人寿命是等流果。何者由恶业令寿命减少。杀生是人道寿命障碍因。此义应知。增上果者。由杀生所事修习数起。一切外资生具无复势味。由偷盗故。多霹雳多尘。由邪淫故多尘垢。由妄语故多臭秽。由破语故。外器有高深。由恶语故其地恶味。高燥相违不宜一切。由非应语故。时节不调适。四大变异不平等。由贪欲故。一切所种菓实少弱。由嗔恚故。一切所生皆悉莶苦。由邪见故。一切资生或少果或无果。是名十恶增上果。为由此业今生寿命短促。为由别业。有余师说即是此业。何以故。昔时此业果报果已。成今时是其等流果。有余师说。昔时由前分。今时由根本。由执共伴类故是所说。杀生等等流果者。非等流种类。由相似差别故说如此。复次云何十业道。有三种果生。若人作杀生事。生被杀者苦故。断彼命故。除彼势味故。是故彼偈曰。由困苦除命。灭势味果三。释曰。由困苦他故。有果报果故。于地狱受害困苦。由行杀故。故有等流果。今生可爱寿命短促。由减他势味故。有增上果。外草药等势味或无或弱。所余业道三果。应知亦尔。善业道三果。应知亦如此。佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所说。有邪语邪业邪命。有何邪命。异于此二。无异此二。偈曰。贪生身口业。别立为邪命。释曰。若于众生从嗔痴生身口二业。名邪语邪业。异此二别立为邪命。偈曰。难治。释曰。贪欲法通引众生。是故从彼所生业。中心难可禁护。是故正命不易可治。于中为生他殷重心故。今此二立为第三。此中说偈</p><p>在家见难治恒执种种见</p><p>比丘命难治资生属他故</p><p>偈曰。资贪生。若执。释曰。若有人执命资粮。贪欲所生身口二业。名邪命非余。何以故。为自身游戏于舞歌等。不立为命资粮。偈曰。非经故。释曰。是义不然。何以故。由经言。于戒聚经中。看象斗等事。佛世尊安立于邪命中。何以故。由邪受用尘故。此义已竟。先于前所说五种果。于中何业由几果有果。偈曰。于灭道有垢。业有果由五。释曰。为得灭故修此道。复由此道故惑灭故。说名灭道。谓次第道。此道若有流。于中所有业。有五种果为果。何以故。此业于自地中所得可爱果。是名果报果。后时或等或胜相似法。是等流果。相离果者。谓择灭心离诸结。功力果者。是道所引生诸法。谓<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道及俱起诸法。未来应得余法。及此择灭。增上果者。离<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>所余有为法。除前生。偈曰。于无垢由四。释曰。于无流灭道中业。由四果有果。除果报果。偈曰。有流余<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。释曰。若善有流业。异于灭道及恶业。此二由四果有果。除相离果。偈曰。所余无流业。由三无记尔。释曰。所有无流业。若异灭道及无记业。由三果有果。除果报果及相离果。偈曰。四二及余三。善业善等果。释曰。此义应知次第。后当说之。有时善业以善法为果则有四果。除果报果。若以恶法为果则有二果。谓功力果增上果。若以无记法为果则有三果。除等流果及相离果。偈曰。若恶善等二。三四如次第。释曰。此义应知次第。若恶业以善法为果则有二果。谓功力果增上果。若以恶法为果则有三果。除果报果及相离果。若以无记法为果则有四果。除相离果等流果。云何。谓无记身见边见。是见苦谛所灭。不善遍行惑等流果。偈曰。无记有二三。三复于善等。释曰若无记业以善法为果则有二果。谓功力果及增上果。若以恶法为果则有三果。除果报果及相离果。云何如此。见苦谛所灭不善惑。是无记二见等流果。若以无记法为果则有三果。偈曰。过去一切四。释曰。一切谓三世法。此法若为过去业果。各有四果除相离果。偈曰。中业来果尔。释曰。若现世业。以未来法为。果则有四果。如前。偈曰中。果二。释曰若现世法为现世业果。但有二果。谓功力果及增上果。偈曰。来业。未来果有三。释曰。若未来业以未来法为果则有三果。除等流果及相离果。偈曰。同地法有四。释曰。除相离果。所余皆有。偈曰。三二若异地。释曰。异地业若无流则有三果。除果报果及相离果。由不堕界故。若有流则有二果。谓功力果及增上果。偈曰。有学三学等。释曰。若有学业以有学法为果则有三果。除果报果及相离果。若以无学法为果亦尔。若以非学非非学法为果则有三果。除果报果及等流果。偈曰。无学业学等。诸法但一果。或三果及二。释曰。若无学业以有学法为果则有一果。谓增上果。若以无学法为果则有三果。除果报果及相离果。若以非学非非学法为果则有二果。谓功力果及增上果。偈曰。异此二学等。二二及五果。释曰。异学无学业。谓非学非无学业。若以有学法为果则有二果。谓功力果及增上果。以无学法为果亦尔。若以非学非无学法为果则有五果。偈曰。三四果及一。见灭业彼等。释曰。若见谛所灭业。以见谛所灭法为果则有三果。除果报果及相离果。若以<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭法为果则有四果。除相离果。若以非所减法为果则有一果。谓增上果。偈曰。二果四及三。修道所灭业。释曰。若修道所灭业。以见谛所灭法为果则有二果。谓功力果及增上果。若以修道所灭法为果则有四果。除相离果。若以非所灭法为果则有三果。除果报果及等流果。偈曰。非灭业彼一。二四果次第。释曰。非所灭业。若以见谛所灭法为果则有一果。谓增上果。若以修道所灭法为果则有二果。谓功力果及增上果。若以非所灭法为果则有四果。除果报果。更说次第言者。应知于前中后。为显<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>重说诸义。由分别业相应义故。此业体相亦应问。于阿毗达磨藏中。说有三业。谓非理作。如理作。非理非非理作。此业其相云何。偈曰。非理作有染。余说非方次。释曰。若业有染污。说名非理作。从不正思生故。余师说如此。或有师说。失方便次第名非理作。若人应如此行。应如此住。应如此啖食。应如此着衣。如此等事若作不如。此名非理作。此业由非应理所造故。悉名非理作。一切善业名如理作。及不失方便次第。亦名如理作。异此二名非理非非理作业。为一业引一生。为一业引多生。复次为多业引一生。为一业引一生。若约此悉檀应说如此。偈曰。一业引一生。释曰。但一生唯一业能引。不能引多生。生者是聚同分名。若得彼说名生。若尔大德阿尼娄驮。云何说言。我今由昔时所施一食果报故。七反生三十三天。七反作转轮王已。乃至今犹于大富释迦家生。由此业果报得大富果。及得忆持宿住事。更生别业。欲显功能故说此言。譬如有人由一金钱作功力得千金钱。方说此言。我今由一金钱故得大富。复说此人。以此时施食为依止。诸故意相续最长大起。于中有诸故意。能引摄果报。不得多业感一生。勿分分所引聚同分。成此聚同分。由一业所引许余业。偈曰。多业能<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。释曰。譬如画师由一色画人形貌。以多色圆满。何以故。于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>中有众生。同人聚同分。有具足根身及。身分色形貌量力端正等相圆满故。于人聚中最分明可爱。有余人于中不具分。不但唯业能引生。何为所余有果报法。若一切种。偈曰。二定非能引。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>及至得。释曰。二无心定亦有果报。不能引聚同分。与业不俱起故。至得亦尔。与业不同果故。佛世尊说。障有三种。谓<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a><a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障果报障此三障体性云何。偈曰。无间等重业。染住惑恶道。北洲无想天。说此名三障。释曰。有五无间业等。是名业障谓杀母杀父。杀阿罗汉。破僧和合。于如来身有害意出血。是名业障。染住惑名烦恼障。惑有二种。一染住。谓恒行。二强利。谓重品。此中染住惑名烦恼障。譬如黄门等。惑强利惑非障。何以故。若惑由重品故强利此惑有时起不恒故。有时可灭。非轻品惑恒起。何以故。若惑恒起为灭。此不得人功时。此惑依轻品成中品。依中品成上品故。此惑是正障。三种恶道名果报障。善道一分亦尔。谓北洲人及无想天。此三障障何法。能障圣道及障圣道加<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>根。复有余业于恶道等报定。谓于卵生湿生。生女人身。生第八有中定。亦应说为业障。若业由五种因可了可说。立此业为障。何者为五。一由依。二由果。三由道。四由生。五由人。故但说五。于中惑障最粗。业障次粗。何以故。由此二于第二生。是人不可治。毗婆沙师说。后后能乘故。故次第说。无间者何义。于生果报中。无别业及别生果能遮碍。复次作此业人。若舍寿命无间生地狱果无法能碍。是人由与此<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应。于生地狱中无间故。说为无间。譬如<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。复次此三种障。应知于何道中有。若决定者。偈曰。于三洲无间。释曰。于北洲及余道皆无。何况余界。于人道中男女二人能作此业。偈曰。黄门等不许。释曰。何因是彼无。护因即是此因。复有别因。偈曰。少恩少惭羞。释曰。次第父母于某。某于父母。父母于某恩少。由不具身分为增上故。爱念少故。某于父母不起重品惭羞。由破此惭羞。为无间罪所触。由此因故。畜生鬼神道中。不许有无间业。大德说。若<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>明了。有五无间。譬如聪慧马故。若人杀非人父母。无无间业。说业障已。偈曰。余障于五道。释曰。何者为余。谓惑障果报障。果报障者。于人道中北洲人。于天道中无想天。此无间业体性云何。四身业为体。一口业为体。三杀生为性。一妄语为性。一杀生前分为性。诸佛如来不可杀害为法。于因立果名故。说僧和合破为无间业。僧由此因破故因得破名。此破其义云何。偈曰。僧破非和合。性非相应法。无染无记法。释曰。和合者。谓与心不相应行无覆无记。僧破亦尔。此云何成无间业。能破人与此不相应何为偈曰。众与此相应。释曰。何以故。是破属所破不属能破。若尔能破。与何法相应。偈曰。依此妄语罪。能破与相应。释曰。能破人与破僧和合罪相应。此罪谓妄语。复次此妄语。与僧和合破俱起有教无教。能破与此罪相应。偈曰。毗指一劫熟。释曰。一别劫果报。于阿毗指大地狱熟。所余无间业不决定。于阿毗指大地狱熟。若人作多无间业。此多业悉无间熟。由此业是人何所得。偈曰。如增苦受增。释曰。此人由多无间业熟。于阿毗指地狱。得最大最厚柔软依止。是苦恼事最多种最难忍。起由此二因。所受苦受。二三四五分增。何人能破僧和合。偈曰。比丘见好行。破。释曰。在家不能破比丘。尼等亦不能破。是比丘多见行。非贪爱行。住于正行。由行不可诃。邪行不能破。何以故。此人教不可信受故。何处得破。偈曰。余处。释曰。若世尊在此处。异此处故得破。不得亲对世尊。诸佛如来不可轻逼故。言教最可信受故。若破何人。偈曰。凡夫。释曰。但破凡夫僧和合不能破圣人。自证见正理法故。是凡夫未得忍前。余师说如此。由几量僧得破。偈曰。别师道忍时。已破。释曰。是时彼僧忍受别师异如来。及信受别道。异如来所说正道。由此量应说僧已破。破已几时得住。此夜。偈曰。不宿住。释曰。大众已破。不度此夜。必定更和合。是所说破僧和合。偈曰。说此名破轮。释曰。何以故。是时佛世尊法轮已破。能障碍圣道生起故。故名轮破。或说僧破。此轮破何处得成。偈曰剡浮洲。释曰。但于剡浮洲破。余处则无。由几人得破。偈曰。九等。释曰。定取九为破。过此无定。八比丘是名僧第九为能破。何以故。僧必定应于二聚二助中住。若尔得破别有僧破。从羯磨破成。若于一别住不和合作羯磨。是名羯磨破。此破偈曰。三洲有破业。释曰。于三洲等若有如来正教。此由几比丘成。偈曰。此由八及余。释曰。此中但作羯磨。不立十四破类法故。以八为定。是破轮于六时不得成。偈曰。初后頞浮前。双前师灭时。未结别住时。破轮不得成。释曰。初者转法轮未久。后者世尊将般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时。此二时中大众恭敬修。同一味故无破。于中间在頞浮陀前僧不破。于<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>中。乃至戒頞浮陀见頞浮陀未起时。于双前亦不破。乃至二<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>奢摩他毗钵舍那双未起时。由已破不经宿故。由二更和合故。若大师已般涅槃时。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>对立故无破。乃至未结别住时亦无破。何以故。若共一别住安立二助。则名僧破。于此六时破轮不成。非一切佛皆有此破轮。此事依业成故。云何杀母等事中有无间业。于余处无。偈曰。有恩<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>田。由舍离除故。释曰。于杀父母中。由舍有恩人。云何彼有恩。是自身生本故。云何舍彼。谓除彼命根。功德田者。谓阿罗汉。阿罗汉身是三界惑择灭。及戒等阴器故。故名功德田。由除此身故成无间业。若父母转根。于此一依止中。偈曰。别根障亦有。释曰。是故经中说云。为有如此不令男人离命根。非父非阿罗汉。而为无间罪所触不。有。若母转根。令女人离命根。非母非阿罗汉。而为无间罪所触不有。若父转根。有女人柯罗逻堕。有别女人。即取安置产门中。此人以何女为母。若杀于何女成无间业。偈曰。从血生是母。释曰。若从此女人血成此人身。此女是其生母。于第二女人。一切事中皆应问听。何以故。此女能饮此儿。及能长养教训是非。若人于母行杀害方便。误杀余人。无无间业。不于自母行杀害方便。误杀自母。亦无无间业。因子欲杀方便母隐床中。父走余处故死。此人成无间业。若人行一害事。杀母及杀余人。二无教业并起。有教唯无间业。由此无间业力强故。大德瞿沙说。邻虚所成故。有教亦有二种。若不想是阿罗汉。杀阿罗汉。有无间业。谓我今必杀。于此依止意决定故。若人杀父。父是阿罗汉。此人但得一无间业。由依止一故。若尔此阿婆陀那经云何。将经云。汝去语始看持。汝今造二无间业。由汝令父离命根。亦令阿罗汉离命根。显此无间业由二<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所成。故说此言。复次由此二门诃责彼人。故说此言。为决定于如来边起恶心出血故。有无间业为不。若由杀意故有无间业。偈曰。于佛打意无。释曰。若人唯有打故意出佛血。则无无间业。若人于非阿罗汉行杀害事。害后成阿罗汉。得无间业不。偈曰。害后无学无。释曰。于此人无无间业。何以故。此杀方便不于阿罗汉起故。若人已作无间方便。未转方便时。为先得离欲及圣果不。偈曰。行无间前人。无离欲及果。释曰。若人作无间业。方便必定应成。是方便时中。无离欲及得圣果。若不定则不如。若人于余业道。作前方便道生时。得离欲及圣果。后业道不生。何以故。是今依止与彼业一向相违故。于五无间中何无间业罪最重。偈曰。破僧和妄语。许最大重罪。释曰。了别法非法人。妄语是僧和合破。因显翻倒理故。于一切邪行是最大重罪。何以故。能害诸如来法身故。能障碍世间天道及涅槃道故。何以故。大众正破时。世间入正定聚<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>。离欲流尽等悉皆被遮。<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>读诵一切正思事并不得起。一切世间及人天。皆纷扰生忧恼乱心。此事乃至僧未更和合。复次由此业报。于阿毗指地狱熟具满一劫。故言大重。所余无间业次第应知。第五第三第一为重。一切中第二最轻。若尔佛世尊说。于三种治罚中。意治罚最重。复说。一切罪中邪见最胜。于无间业中定判破僧为最重罪。此言云何。若约无间一劫果报。无胜破僧妄语。若决判三业。意治罚最重。余治罚随此故。若决判诸见邪见最重。非拨彼境界故。复次依大果报。依杀害多众生。依断除善根。故说此言。次第应知。于善行中何善行果报最大。偈曰。世有顶故意善中最大果。释曰。于善业中非想非非想故意果报最大。何以故。于八万大劫微妙寂静。是其果报故。此言约果报果说。若约相离果。金刚三摩提故意。于一切中为最大果。一切结灭尽为果故。是故说于世间为由无间业于地狱得无间生。为亦由无间同类。由二种。有余师说。唯由无间业必定得无间生。由同类不定。何者为无间同类。偈曰。污母阿罗汉。杀定地菩萨。及有学圣人。夺僧和合缘。是无间同类。五破佛支提。释曰。如此五业与五无间业。应知次第同类。若人污坏自母阿罗汉。由行非梵行故。若人杀至住定地菩萨。若杀有学圣人。若夺大众和合因缘。若起佛支提想。破佛薮斗波。此业说名无间同类。有余业若有果报。于三时中最急起障。何者三时。偈曰。忍那含罗汉。位中业起障。释曰。若人从顶思想忍。是时一切引恶<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>报业。悉起为障。由应过彼果报地故。譬如有人应舍离自国土。一切债主皆起诸业亦尔。若人应至阿那含果。一切欲界杂业。悉起为障。唯除现报业。若人应至阿罗汉果。一切色界无色界业。悉起为障。于前已说。若人杀定地菩萨。偈曰。菩萨从何位。释曰。取何位应说此是菩萨。偈曰。从作相业时。释曰。从<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>能感三十二相八十随相果报业时。何以故。此人于此时中。已入菩萨正定位。云何如此。此人从此时。向后恒尔。偈曰。善道贵家具。男忆宿不退。释曰。善道者。最胜可赞故名善道。由生于人天道中故。复于善道中。生刹帝利种姓。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>种姓。大长者种姓。于中生摩诃婆罗家。此人已生贵家。有贵家人具根。有不具根。此根有二种。谓色根法根。若不具此。是从明向闇。若具此。是从明向明。恒得丈夫身。非女人身。何况作黄门等。此人忆一切生中一切宿住事。由闻思二慧圆满故。于安乐利益众生事中。由一切苦品类。由一切他违逆恶事不厌极故。是世间所说。非直买得陀婆。应知是菩萨。何以故。是诸大士。已至一切胜德最上上品位。无余因缘。唯由系属大悲故。于一切众生。安立自身。似彼仆使。由无憍慢故。于一切众生。能忍受一切最难求。欲恒荷负一切苦行事。由碍他故。不立自事。是故说非直买得是所说。能感相果报业者。偈曰。剡浮洲丈夫。对佛佛故意。思慧类百劫。于余得引此。释曰。唯于剡浮洲菩萨修引相报业。非余洲何以故。剡浮洲人。智根最利故。唯丈夫非女人。过女人位故。此修于何时。大师在现前时。由缘佛为境故意故。此业思慧为类。非闻<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。于余时谓百大劫量。非于多余。一切佛皆尔。唯释迦牟尼世尊。正勤最炽盛故。能超九劫。于九十一劫引所余相业。是故如来说。土主我从此生前所经九十一劫。不忆不见。昔时于一家生中。因施一熟食。有间有损。何况大事。从此时自性念宿住故。已出初阿僧祇。菩萨除灭四种过失。恒得二种最胜德。宿旧师说如此。于菩萨诸相中。偈曰。一一百福生。释曰。此福量云何。除近行菩萨。一切十方众生。能感富乐业为量。余师说如此。如众生业增上缘。能感三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>生。如此量。毗婆沙师说如此。有余师说。唯诸佛能知此业数量。复次今世尊。昔在菩萨位中。事几诸佛。于初阿僧祇事七十五千佛。于第二阿僧祇事七十六千佛。于第三阿僧祇事七十七千佛。一一阿僧祇最后时。何佛世尊出。由逆时应知次第。偈曰。三僧祇后出。毗婆尸燃灯。宝光。释曰。于剌那尸弃佛世尊。第一阿僧祇究竟。于燃灯佛世尊。第二阿僧祇究竟。于毗婆尸佛世尊。第三阿僧祇究竟。于一切佛。偈曰。先释迦。释曰。有佛世尊。号释迦牟尼。昔已出世。于此世尊所。今佛世尊求修菩萨行。初发<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>愿。愿我<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。皆同如此相。昔时世尊。如今末世时生。乃至世尊正法住唯一千年内。菩萨在于何位。圆满何波罗蜜。偈曰。遍处施一切。由大悲施满。释曰。是时于一切众生。平等一切所应施类。若施财乃至眼及骨髓。若施法无师秘密。若施<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>现在未来二世救济。唯有大悲无所求。为由此量施波罗蜜得圆满。偈曰。分斫身无怪。有欲戒忍成。释曰。若是时菩萨未得离欲法。若被斩斫身分分断。于自他无爱憎故。最轻怪心亦不起。是时戒忍波罗蜜二俱圆满。偈曰。赞底沙<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。释曰。昔有如来号底沙。于宝山岩中入火界定。令佛世尊昔在菩萨位。以别意行遇见此如来。一脚着地一脚未下。于七日七夜。诵一偈赞叹已方坐。偈曰</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十四卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十四卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别惑品第五</p><p>前已说。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>多种异从业生。诸业由随属惑故。至得生长。若离随眠惑。于生诸有诸业。无复功能。是故应知。彼偈曰。随眠惑有本。释曰。云何为有本。若惑现在正起。能作十种事。一坚固根本。二安立相续。三数治自田。四生起等流。五能引生业有。六<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>自资粮。七令迷境界。八引将识相续。九令离净品善法类。十成就缚义。由不得过自界故。彼随眠惑有几种。若略说有。偈曰。六。释曰。何者为六。偈曰。谓如欲嗔。憍慢无明见。心疑。释曰。如欲者。显余惑与欲同。由境界随眠故。此义后当说。偈曰。复说彼。六由欲别七。释曰。于前偈中所说。六随眠惑。于中分欲为二。更说彼为七。谓欲欲随眠。嗔随眠。有欲随眠。憍慢随眠。无明随眠。心见随眠。疑随眠。此义云何应知。为随眠即是欲欲。为随眠异欲欲。譬如石子体及提婆达多衣。若尔何有。若欲欲即是随眠。则违<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。经云。世间有人。非欲欲上心惑所染心数数长时住。如实见知是欲欲上心惑出离义。于此人是欲欲上心惑。由根由力。正所断除。及与随眠永得灭离。若汝执别欲别随眠。由立随眠与欲不相应。则与阿毗达磨藏相违。彼藏云。欲欲随眠与<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>相应。毗婆沙师说。欲欲即是随眠。乃至疑即是随眠。前不说与经相违耶。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违。何以故。经云及与随眠永得灭离者。与随从法永得灭离。复次于经中随眠言。是方便语。或至得语。譬如<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>苦天上乐及说火苦。阿毗达磨藏言。皆依直相起。随眠即是惑故。一切随眠皆与受相应。云何得知。由随眠起心染污故。能为障故。与善相违故。由心为随眠惑所染污。未生善不得生。从已生善亦退故。故知随眠惑与心不相离。若由不相应。此义得成。无时善法可得。由彼恒在故。由善法有时可得故。知随眠与心相应。经部师说此义非证。若人执随眠惑不与心相应。此三义彼不执为随眠所作。但是上心所作。若作如此执。则无过失。如经部执。随眠者是欲欲随眠。此随眠不与心相应。亦不与心相离。由非别类故。若惑眠说名随眠。若惑觉说名上心。此惑眠何相。不在现前种子随逐惑觉。何相正现前起。何者惑种子。是身相续功能。从惑生能生惑。说名种子。譬如牙等。从<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a>生。能生<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>子。若人执诸惑种子是别法。谓随眠不相应。此人应立别法为念种子。若说随眠非相应非非相应。于六六经中。此义云何经言。此惑于此人乐受成欲随眠。由此等言。此惑是时未得随眠。若尔于何时。眠时是时。或于因说果名。故称随眠。且置此论。应更显本义。于经中所说欲差别。谓欲欲有欲。此有欲是何法。偈曰。有欲二界生。释曰。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a><a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中生欲。说名有欲。为何因作如此名。偈曰。内门起故说断彼<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>想。释曰。于彼二界人。多起三摩跋提欲。此欲依内门起故。说名有欲。复次于此二界中。有余人起<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>想。为除彼涅槃想故。说此欲名有欲。有者谓身体。即是<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。于彼<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>啖三摩跋提及依止味。离欲欲界故。是故此欲名有欲。此六种随眠。于阿毗达磨藏中复分为十。云何为十。偈曰。见五。谓身见。边见及邪见。见取戒执取。由此复成十。释曰。本立六为随眠惑。于中分见为五故成十。于中五以见为<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。谓身见边见邪见见取戒执取。五以非见为性。谓欲嗔慢无明疑。复次此十随眠惑。于阿毗达磨藏中。更立为九十八。于欲界中有三十六。色界中有三十一。无色界中有三十一。若略说此随眠惑名<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>惑。或说名见修所灭惑。于中欲界见谛所灭有三十二。何者三十二。偈曰。彼十七七八。三二见所离。次第俱断灭。见欲苦等故。释曰。是所说十惑。于欲界具十见苦所灭。于中七见集所灭。七见灭所灭。除身见边见戒执取故。八见道所灭。除身见边见故。如此欲界三十二惑说名见谛所灭。由唯见谛除灭故。偈曰。四惑名修灭。释曰。四惑者。谓欲嗔慢无明。彼云何是修所灭。若人先已见<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。后由数修习道。方能灭除如此身见。于中但一品见苦所灭。边见亦尔。邪见有四品。见苦集灭道所灭。见取疑亦尔。戒执取有二品。见苦道所灭。欲嗔慢无明有五品。见四谛及<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭。于中彼何相见苦所灭。乃至何相修道所灭。由见谛相彼灭。及能缘彼故。说见谛灭。所余名修道所灭。若立如此见成十二。疑成四欲五嗔五慢五无明五。如此欲界惑。合成三十六种。偈曰。合彼唯除嗔。色惑。释曰。除五品嗔。如此名色界惑。合三十一。如色界惑。偈曰。无色尔。释曰。无色界惑亦三十一。偈曰。故立九十八。释曰。如此六随眠惑。所缘<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>及对治并界差别故。阿毗达磨师。立为九十八随眠惑。是见谛所灭随眠惑为决定。唯由见四谛灭。为非。说非。云何偈曰。有顶忍所灭。定见灭。释曰。此随眠惑。于有顶生类忍所灭。是彼必定见谛所灭。非修道所灭。偈曰。余生。见修灭。释曰。忍所灭此言流。于所余地如理法忍类忍所灭随眠惑。于<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>是见谛所灭。于凡夫是修道所灭。偈曰。非忍灭。必修道灭。释曰。于一切地中惑。凡是智所灭。于二人恒修道所灭。有余师说。见谛所灭惑。非外凡夫所灭。何以故。于大分别业经中说。分别前际人说<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。或说随一常住。或说不由因生。此三离欲人。缘欲界起诸见。说有通行。若色界惑。不能以欲界法为境。由离欲界欲故。是故知欲界相应诸见不得灭。同诸见生时。彼已退定。犹如提婆达多毗婆沙师说如此。此五见由名已说。不由自性。彼自性云何。偈曰。我我所常断。无于下胜见。非因道此见。是名五见性。释曰。我及我所见名身见。由<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>刹那坏故说灭。由聚集故名身。以阴为义。此法亦坏亦聚故名灭身。谓五取阴。为除彼计常想。及于聚执一想。故说如此。何以故。彼我见于五阴以此想为先。于灭及身。不如执说名身见。一切见能缘有流法为境。悉缘灭身。而但立我我所见名灭身见者。欲令彼知此见唯于灭于身起。非于我我所。如经言。世间若有<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。起见谓有我。是彼一切唯于五阴起。我见是类彼所许为我。或执见为常。或执见为断。是名边见。由执常边断边故。于实有苦等谛执见为无。故名邪见。一切见皆翻违理起。悉是邪见。但说一见为邪见者。由此见最恶能断善根故。故说为邪见。譬如臭酥及恶旃陀罗。此一向非拨故。所余诸见但有增益。于下品法执为最胜。说名见取。何法名下品。谓一切有流法。圣人所弃舍故。执此法为最胜。是名见取。应说见等胜取见。此中除等见言。非因中因见。非道中道见。名戒执取见。譬如摩醯首罗非世间因。彼观为因。世主天等所余诸物亦尔。入火水等非生天因。彼观为因。唯执僧佉踰伽等智非解脱道。彼观为道。此中应知除等见言。如此五见性应知。若非因中起因见。云何此见非见集所灭。若有人见<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>及世主为因。此人必执此为常为一我作者。是故此偈曰。于自在等处。从常我倒生。因等虚妄执。是故见苦灭。释曰。由见苦谛。于自在等处。常执<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>俱灭。非因执是二倒所作。是故与此见共灭。若人由入火水等方便起生天执。由戒及执计得清净。此执亦见苦所灭。阿毗达磨藏文言如此。复言。若有人执说如此。是时善男子<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>牛戒。行鹿戒狗戒。由此行清净解脱出离。过度苦乐得至过苦乐处。若信非因为因。戒执取见。见苦所灭。广说如彼藏。云何此执见苦所灭。于苦乖违故。此执太过为失。一切缘有流境。或于苦乖违。与非因执因。复有何相。别戒执取。见道所灭。缘见道所灭法为境。此于苦亦乖违。若人缘道起邪见及疑。或谓无解脱道。或思此道为是解脱道。为非依此二。云何分别观为清净。若彼执别有解脱道故。拨无此解脱道。是人由别解脱道。执计为清净。不由邪见。是故此执不成缘见道。所灭惑为境。若人由见集灭二谛所灭邪见。计为清净。云何此戒执取。非见集灭谛所灭。是故汝所执义更须简择。是前所说。有常倒我倒为唯此名倒。为更有余说。颠倒有四。谓于<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>常颠倒。于苦乐颠倒。于不净净颠倒。于<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>我颠倒。此四种颠倒体相云何。偈曰。从二见半生四倒。释曰。从边见中取常见为常颠倒。从见取立乐颠倒净颠倒。从身见立我见为我颠倒。余师说。见取云何以我所为倒。彼见我于是处自在故。于是处起我所见。是故此见皆是身见。由二门起。若汝计我是第一执。我所是第二执。若我与带物称我。此二文应成别执。云何不立余惑为颠倒。由以三因成立颠倒义故。何者为三。偈曰。颠倒故。决度增益故。释曰。此二见半。一向颠倒故。于境界决定度故。增益义故。断见邪见不能增益。非有门起故。戒执取非一向倒。随分量清净为境界故。所余诸惑不能决度。是故不立为颠倒。若尔于经中。说于无常执常。是名想倒心倒见倒。此中云何唯见为倒。偈曰。想心随见故。释曰。由随属见倒与见倒相应。想及心亦说为倒。云何不说受等为倒。由世间成故。于世间说。此人颠倒想颠倒心。此义明了。不说颠倒受。如此颠倒于须陀洹人一切皆灭。由诸见见谛所灭故。余相应法亦同灭。颠倒有十二种。于无常计常。是想心见颠倒。乃至于无我计我。是想心见颠倒。于中八倒见谛所灭。四倒修道所灭。谓于苦计乐。是想心倒。于不净计净。是想心倒。余部说如此。若不尔。离乐想倒及净想倒。未离欲圣人。云何淫欲欲得起。毗婆沙师不许此义。何以故。彼言。若由乐净想心生起故。于圣人立此二为颠倒。众生想心生起故。云何不立此二为我颠倒。何以故。于女人及自身。若离众生想。淫欲欲不应成。复于经中说。由多闻圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>是苦圣谛如实已见已知。乃至此圣弟子。于此时中于无常计常。想倒心倒见倒。皆悉永灭。广说如经。是故若从见生想心。则成颠倒非余。由暂时心乱故。譬如于火轮心乱。及夜叉心乱。若尔大德阿难依婆耆舍大德。说言</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十五卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十五卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>中分别惑品之二</p><p>说世义已。由相应故来。今应思此义。是类已灭<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>于中得相离不。复次众生于此类处已得相离。此类为已灭不。于中若已相离。此类于此人必定已灭。若类已灭。于中众生或已相离或未相离。譬如偈曰。灭苦下惑中。由余遍行应。于前类已灭。余同境惑应。释曰。苦智已生集智未生。见苦所灭类聚皆已灭尽。由见集谛所灭缘彼为境。余遍行惑于彼相应。于<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭类聚中有九品惑。于先已灭品中。由余惑缘彼为境。于彼相应此义应知。于何类中几惑能缘彼类生。若句句答此问。应说无数法。是故先旧师造略集毗婆沙。彼云。云何。由少功力。我等应度最大问流。若略说有十六种法。谓欲色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>相应各有五品。及无流心。亦有十六同此类。于中何法为何心境界。若人已了知如此。于中如此多惑缘彼得生。此义方可思量。此中偈曰。见苦集修灭。是欲相应法。自界三一色。无垢识境界。释曰。此法是自界法。有三部故说自界三。此法一部是<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>法故说一色。于欲界相应行法。见苦集所灭。及修道所灭。皆是五识境。于自界有三识。谓是前三色界心一。谓修道所灭及无流心。偈曰。自界下界三。上一净识境。释曰。于色界相应行。如前三部法。是八心所缘境。谓自界心三如前。下界心三亦如前。上界心一。谓修道所灭心及无流心。偈曰。无色<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>三。无流识境界。释曰。于无色界相应行三部法。是十心所缘境。谓三界心各三如前。无流心一。说三界见苦集所灭及修道所灭已。偈曰。见灭道所灭一切自长境。释曰。见灭道所灭法中是自心。谓见灭道所灭心。此心为长应知。彼法是此心境。云何如此。欲界相应见灭所灭法。唯六识境界谓前所说五识及自长识。见道所灭法亦尔。谓前所说五识及自长识。如此色无色界见灭道所灭法。是见灭道所灭。自长识境界故。是故为九识。及十一识境。说三界五部法已。偈曰。无流三界后。三无流心境。释曰。若无流法为十心境界。谓三界后三部心。即见灭道修所灭心。及无流心。复次为摄此义故。造一偈半</p><p>见苦集修灭于三界无流</p><p>五八及十识十识所缘境</p><p>见灭道所灭一切自长境</p><p>已解安立如此十六心。于十六境随眠正事。于中云何思量。我等为安立此义故显唯方。于缘乐根为境识中。几随眠惑依彼得生。若有如此问来。应自思量。乐根有七种。于欲界中唯有修道所灭。于色界五部及无流。此乐根若略说。是十二心境界。欲界四心。除见灭所灭心。色界心有五。无色有二心。谓见道修道所灭心及无流心。如此十二识能缘乐根为境。于中如理。欲界部惑。色界部惑。缘有为境。无色界二部。并遍行诸惑。于中随眠生。应知如此。于缘能缘乐根为境。心中几随眠惑依彼得生。所说能缘乐根为境。十二识复为何识境界。即是前所说十二识类。复次无色界有二部谓见苦集所灭心。是十四心。应知缘能缘受识为境。此中更增无色界见苦集所灭心。欲界有四心。缘有为境。色界有五心。缘有为境。依此十四心随眠惑得生。此义应知。由此方所余亦应知。若由此惑心则有缚。此诸惑于此心中皆随眠不。得随眠。若惑与心相应不灭。及能缘彼为境亦不灭。有不能随眠。若惑与心相应已灭。若作如此义。偈曰。有缚心二种。染无染由眠。释曰。若心有染污。由惑能随眠是故心有缚。及由与心相应。缘彼为境惑由不能随眠。惑与彼相应未灭。互相应故。若无染污心。但由能随眠惑及能缘彼为境。惑不灭为缚。复次十种惑生起云何。从初者由痴相应故。迷闇于谛境。彼人不乐观苦苦相。于彼人不显现。乃至道亦尔。是故偈曰。从痴疑。释曰。若人已痴闻。二义起疑惑。谓此为是苦。此为非苦。乃至道亦尔。偈曰。邪见。释曰。从疑惑起邪见。若人有疑心。由邪闻邪思故。决定邪智起。乃至拨无苦等。偈曰。从身见释曰。彼说从邪见身见生由苦除<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>由我我所执故。偈曰。边见。释曰从身见边见生。由执我断常二边故。偈曰从此戒执取。释曰。从边见戒执取见生。何以故。若人随执一边。由此边计执清净故。偈曰。次见取。释曰。从戒执取见见取生。何以故。若由此法计执清净。必执此法为最胜。于下执胜为见取故。偈曰。自见。欲慢。释曰。于自见爱着心起故。由自见高心起故。是故从自见欲起慢起。偈曰。于他见嗔起。释曰。若人爱着自见。于他见能对治自见。则起嗔恚。有余师说。于自见已取已。舍中起嗔恚。偈曰。如次第。释曰。见谛所灭欲等诸惑。缘依自相续见起故。生起次第如此。若惑欲生起。必由三<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>得起。能起因缘者。偈曰。从未灭随眠。及对根现尘由不正思惟惑起。释曰。惑者譬如欲随眠。此未灭未永离。欲惑相应。尘对根显现。于中起不正思惟。由具三故欲惑得起。此三次第。谓因缘加行力。偈曰。具因缘。释曰。若余惑有具因生。应知亦如此。彼说有时由尘力惑亦生。起不由因。力譬如退法阿罗汉。是随眠惑于经中<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说为三流。谓欲流有流无明流。或说为四暴河。谓欲暴河有暴河见暴河无明暴河。或说为四系。即是四河或说为四取。谓欲取见取戒执取我言取。于中偈曰。欲界共倒起。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>名欲流。离痴。释曰。除无明所余欲界行惑共诸倒起惑。应知名欲流。有四十一物。三十一随眠惑。除五种无明并十倒起惑。此但惑非随眠。偈曰。唯随眠。色无色有流。释曰。除无明言流。一切色无色界行随眠惑。除无明名有流。有五十二物。色界惑二十六。除五部无明。无色界亦尔。于上界为不有疲弱掉起二种倒起惑邪。如分别道理论说。何者为有流。除无明是所余诸惑。与色无色界相应。谓结缚随眠小惑倒起惑。此中云何不摄。罽宾国师云。由不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。复有何因缘。色无色界合说一有流。偈曰。无记内门起。依寂静地生。故合一。释曰。是二界惑同无记性。依内门起。依定地生。由此三法等。是故合立为一。由此因立有欲义。更由此因立有流义。今三界无明立为无明流。此义自成。有十五物。云何别立此无明为流。一切流偈曰。为根。立无明别流。释曰。一切流无明为根。是故别立无明为流。如说流应知余亦尔。偈曰。暴河系亦尔。别立见明故。释曰。是所说欲流。即是欲暴河。及欲系。是所说有流。即是有暴河。及有系。除诸见。彼言由了别故。于暴河及系。立见为别品。偈曰。非于流无伴。由非顺流故。释曰。能令流故名流。流等名后当释。彼说若见独无伴。不随顺流。由明了故。是故于流不立为别品。合立为流品。是欲暴河。有二十九物。谓欲嗔慢有十五。疑有四并十倒起惑。有暴河有二十八物。谓欲慢有二十。疑八见暴河有三十六物。无明暴河有十五物。如暴河应知系亦尔。偈曰。如所说共痴。有二分见故名取。释曰。是欲系共无明立为欲取。有三十四物。谓欲嗔慢无明有二十。疑有四。并十倒起惑。是有系共无明立为我言取。有三十八物。谓欲慢无明有三十。疑有八。是见系除戒执取。立为见取。有三十物。是戒执取有六物。云何从诸见中。离戒执取立为别取。由对治圣道故。由欺诳二部故。在家部由此惑遭诳计。执自饿为天道故。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>部由舍离可爱尘。修习苦涩为道。计应得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>故。欲取及见取者。是在家出家二部斗诤因故。故立为二取。在家由取五尘故。与在家起斗诤。出家由取诸见各不同故。与出家起斗诤。此二部取定及定果。为解脱道及解脱果故。故立二界惑。为我言取。云何合无明说取不别为取。由能取<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>故立为取。偈曰。由无明。非能取故合。释曰。无明以不了为相故。昧钝故故不能取。是故共惑合为取。于经中佛世尊说。何者为欲系。广说如经。乃至于欲尘。众生欲染污欲求欲爱欲喜欲欲欲乱欲着欲遍着欲乐欲定欲贪。此欲变异众生心住。说此名欲系。乃至有系等亦如此于余经中说。爱欲亦名取。是故知欲等取。于欲等中唯爱欲为取。此义已说。于经中唯随眠惑说名流暴河系取。复次随眠名有何义。乃至取名有何义。偈曰。微细随逐故。二种随眠故。非功用恒故。故说彼随眠。释曰。此中微细者。行相最细故。故非他可知。随逐者。由至得恒有故。二种随眠者。随流行众生相续中能作二种缚。谓境界缚相应缚。非功用恒故者。若不作功用为生。彼若作对治为遮。彼数数现前故。由此三义故。说彼惑名随眠。偈曰。令住及令流。能牵及能合。能取故说彼。名流暴河等。释曰。令住不护中从六门漏能流生死。从有顶至阿毗指故名流。能牵引众生。令入<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>故名瀑河。能合众生令不离苦故名系。因此众生取欲等及生生具故说名取。又若如此解是为最胜。由彼故相续于六尘中流。故说彼名流。如经言。长老。譬如船由大功用牵引逆流。若舍功用此船随流而去则无复难。诸惑亦尔。由随经文句。应知流义过量猛疾。故说此惑名暴河。何以故。由此惑众生漂逝。唯得随顺不可违逆故。若非过量行名系。能令与种种苦和合故。或数数相应故。能取欲等故。取所生故能。生取故故。名为取。由如此义故说彼名流。乃至名取。偈曰。由结等差别。复说彼五种。释曰。是随眠惑。由结缚随眠染污倒起差别更说五种。此中结有九种。谓随顺结违逆结慢结无明结见结取结疑结嫉姤结悭吝结。此中随顺结者。谓三界欲。所余诸结应如理思。见结者谓三见。取结者谓二见。是故说此言。为有此义不。与见相应法中。但由随顺结相应。不由见结。于中见结随眠非非随眠。说有。集智已生灭智未生。于见灭道所灭法中。与见取戒执取相应。何以故。彼法与随顺结相应。与见结不相应。遍行已灭故。非遍行以彼为境界故。相应见结无有故。见随眠于彼随眠。谓二取见。但由相应故。复有何因。于结中合三见立为别见结。复以二见别立为取结。偈曰。物取平等故。立见为别结。释曰。三见唯十八物。二取亦唯十八物。是故彼言。由物等故。离见立为二结。此二见以能取为性。所余不尔。但是所取。由能取所取差别故。立为二结。云何嫉姤悭吝。于诸结中立为二结。不立余倒起偈曰。由一向不善。由二自在故。于中惑姤吝。别立为二结。释曰。无余倒起惑。如此种性。若二在于此处。此处则一向不善。此二又自在起。不随属他。若人执唯八是倒起。于此人可有如此答。若人立十为倒起。于此人忿恨及覆藏。亦有此二种性。是故此救不成救难。偈曰。无贵重富财。因故遍相故。能损二部故。别立姤吝结。释曰。有余师说于倒起中妒吝。有三重失由嫉妒。得轻贱报由悭吝。得贫穷报如偈言</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十六卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十六卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>分别圣<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>人品第六之一</p><p>此义已说。谓如灭得名永断智。复次此义。偈曰。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>灭已说。由见修<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>。释曰。诸烦恼有二种。一由见谛所灭。二由<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所灭。此义于前已广说。彼灭亦尔。见修二道今当说。此二道为是有流。为是无流。是故说此言。偈曰。修道有二种。见道唯无流。释曰。云何修道有二种。由依世修及依出世修故。见道一向是出世。能对治<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>惑故。复能一时灭见谛所灭九品惑故。何以故。世道无如此能。由惑强道弱故。前已说由见四谛。何法名四谛。偈曰。已说谛有四。释曰。何处说。于分别有流无流法中。云何说。如偈言。无流法圣道。此约自名说。灭谛亦已说。如偈言。择灭谓永离。各各对诸结。苦谛集谛亦已说。如偈言。苦集谛<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。见处及三有。四谛次第为如前所说不。说非。虽然复有别义。偈曰。谓苦谛集谛。灭道谛亦尔。释曰。此中是彼次第。如前所说。四谛体性。今说亦尔。为显此义故有尔言。不复重释。偈曰。对正观次第。释曰。若观先缘此谛起。依观立此谛为先。后三亦尔。若不尔应先说因次后说果。何以故。有余法随生立次第。譬如念处及定等。有余法随显相说次第。如说正勤。何以故。无此定义。谓先起欲为灭已生。后起欲为令未生不生。有余法随正说立次第。譬如八分圣道等。今说四谛。随修对正观次第。复有何因。修观有如此次第。是爱着处于处能缚。能所缚<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。因此求解脱。观察位中初发观次第如此故。先简择苦。此苦以何法为因。故次简择集。此苦以何法为灭。故次简择灭。此灭以何法为道。故次简择道。譬如先观病次寻思病<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>及灭病药。于经中。佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>所显。四谛譬如此于何经中。医譬经中。经言。若医与四分德相应。能拔治他刺。何者四分德。一识病。二识病因缘。三识病灭。四识治病药。广说如经。如观察位中次第。简择四谛。修观位中。见四谛次第亦尔。由先习利故。譬如于己所<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>无碍纵马令走。对正观者。此句何义。趣向正觉为义。云何此唯无流非有流。由此趣向于<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>缘真实境起故名正。未曾知知故名觉。如实能通清净境故。此中是果取阴名苦谛。因取阴名集谛。从此聚集苦生故。是故此二谛。由果因义异故名有异不由物异。灭道二谛不但由名异。亦由物异。于经中说有<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>。此说有何义。此法唯是<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>谛。是故经说名圣谛。若尔此四于余人是妄。不于一切人皆是谛。以无颠倒故。此中如圣人观。彼余人不能如此观故。说此唯于圣人是谛。于非圣人则非。由颠倒观故。如偈言</p><p>圣人说是乐余人说为苦</p><p>余人说是净圣人说为苦</p><p>有二谛唯圣谛。有三谛圣非圣谛。余师说如此。若受一分是苦<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。云何说一切有为有流皆名苦谛。偈曰。苦由三苦应。如理皆无余。可爱非可爱。及余有流行。释曰。苦类有三。一苦苦类。二行苦类。三坏苦类。无余与二苦如理相应故。是故一切有为有流皆是苦。此中可爱由坏苦故苦。非可爱由苦苦故苦。异此二所余由行苦故苦。何者为可爱非可爱非二。谓三受如次第。由三受相应故。一切有为有流。得可爱非可爱等名。何以故。此乐受变异即是苦。如经言。乐受生时乐。住时乐。坏时苦。苦受由性故苦。谓生时苦住时苦。不苦不乐受。由行故苦。因缘所生起故。如经言。若<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>即是苦。如受与受相应有为法。亦应说如此。有余师说。苦受唯由苦类故苦。乐受唯由坏故苦。乃至行苦亦尔。由可爱非可爱不遍故。故此二名不具分苦。一切有为由行苦故皆是苦。前二受亦由行苦故苦。故此一名具分苦。此苦唯圣人能见。此中说偈</p><p>譬如一睫毛在掌人不觉</p><p>此若落眼中作损及不安</p><p>凡夫如手掌不觉行苦睫</p><p>圣人如眼睛由此生厌怖</p><p>何以故。凡夫<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>于阿毗指<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>生苦怖意。亦不及圣人于有顶诸阴生苦怖意。若尔于道谛应立行苦义。由是有为故。是义不然。何以故。苦是违逆意为相。故道非苦。何以故。此道生起。不违圣人意故。能引得一切苦灭尽故。若圣人由寂静相观察涅槃。是法由苦相圣人观之为苦。唯此法灭圣人观为寂静。于诸法中若有乐受。云何说唯苦圣谛。由乐少故。譬如乌豆聚中亦有绿豆而说为乌豆聚。余师说如此。何以故。何<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>人。由以冷水稍稍浇痈所生轻乐。计痈为乐。此中余部师说偈</p><p>由能为苦因与众苦杂故</p><p>由苦所爱故故说乐为苦</p><p>一切有苦乐圣人观为苦。由行苦同一味故。是故立苦为圣谛。不立为乐。云何以苦相。观喜乐自性受为苦。由有流无常能违意故苦。譬如彼以苦相观色想等。色等亦非苦如苦受。是汝所言。由苦因故苦。是义不然。何以故。此执是集相非苦相。诸圣人于色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>生中。云何起苦想。何以故。于彼众生五阴非复苦因故。复次于经中说。行苦何用。若圣人于乐由无常故观苦。无常相苦相有何差别。由生灭为法。是故无常。由有流能违意。是故为苦。若见无常此所见即能违意。是故无常想能引苦想。有余部说。决定无乐受一切受唯苦。云何知然。由阿含及道理。云何由阿含佛世尊说。随所有受皆是苦别名。复有别说。应以苦相观乐受。复有别说。于苦计执乐想说名颠倒。由阿含证如此。云何由道理。乐因不定故。何以故。随所有饮食冷热等。众生计为乐因。若过量用非时用。此因复成苦因。此义不应然。谓由乐因增长。或由平等于非时悉皆生苦。是故彼从初皆为苦因。非是乐因。后时此苦渐渐增长。方得显了。威仪差别亦应如此。于苦对治。及于苦差别。由起乐想故。何以故。随世间所有饮食等生具。乃至未为别苦所逼。若受则不许为乐。别苦者。谓饥渴寒热疲惓。爱欲所生苦。是故愚人于苦对治起乐想。非于乐于苦差别亦尔。一切凡夫于中起乐想。譬如担重易肩。是故由此道理。定知无乐。阿毗达磨师说决定有乐。此执应理。云何知然。此中应问拨无乐人。何法名苦。若汝言逼恼为体名苦。此乐云何逼恼。若汝言。损害为苦。乐能增益。云何损害。若汝言非所爱为苦。此即是所爱云何为苦。是所爱后于圣人更非所爱。谓于离欲时。是故此乐不成就。不成就故非所爱。不由余义。何以故。若受由自体性是所爱。此受由自体性。无时无因成非所爱。此义应然。何以故。由圣人以别过失相厌恶此受故。彼观此受。是放逸处。大功力所成易变异无常。由如此义故。非所爱不由自体相。若此受由自体本非所爱。于中无有<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>起爱欲。不应为离欲。此受以别道理观察过失。是故知由自体相定有乐受。是汝所言。佛世尊说。随所有受皆是苦别名。此经世尊自显了其义。经云阿难陀。我依诸行无常及有为变异故说。随所有受皆是苦别名。是故知不依苦苦说此经。此义自然成。复次若由自性。一切受皆是苦。何用净命。阿难陀问佛如此。问云何世尊说。受有三种。谓乐苦不苦不乐。世尊复说。随所有受皆是苦别名。世尊依何义说此言。谓随所有受皆是苦别名。若如汝所执。是理净命。阿难陀应问佛如此。世尊依何义说此言。谓受有三佛世尊应答阿难陀言。阿难陀此说是由别意说。谓受有三。佛世尊既不说如此。是故由体性实有三受。故知此经言依别意说。谓随所有受皆是苦别名。是汝所言。应以苦相观乐受。是义不然。何以故。此受中有二性。一有乐性。由自性是所爱故。二有苦性。由别道理。是变异无常法故。若以乐相观此受。则生他系缚。由有欲众生乐啖此味故。若以苦相观此受。则能解脱。有缚众生由于此得离欲故。如理所见能令解脱。诸佛世尊随如此理。善教众生令修学此观。云何得知。此受由自性故乐。由此偈言</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十七卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十七卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>分别圣<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>人品之二</p><p>复次如此违舍二退。何法为性。偈曰。二退非至得。释曰。此二退以非至得为性。违退必由罪过成。舍退则不定。已得暖人后若退堕。必定以<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>为法。若尔此暖与<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>分能善根何异。由于见<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>位最近故。若无障碍。复次偈曰。暖不受邪教。释曰。若已得暖人。后退于此位。能不受邪教。若不受邪教暖顶何异。偈曰。顶不断善根。释曰。若已得顶人。后退于此位中不能断善根。有入恶道义。亦得起无间业。偈曰。忍不堕恶道。释曰。若由舍退忍。无更入恶道义。由已远离行恶道惑业故。何以故。由得忍位。于道杂生依止。有惑所有别类。皆已得无生法谓恶趣。卵湿杂生。无想天。北鸠娄。大梵生。黄门。作黄门。二根身。第八有。见修所灭惑。此无生法于软位。何况于上。是彼无生如应得故。是故无入恶道义。偈曰。世第一离凡。释曰。若人得世第一善根。由退死二舍无有是处。此人于此位中。已得凡夫非择灭。无更堕凡夫位义。何以故。离功用于第二<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>中。必证苦谛故。是暖等四善根。各有软中上三品。即成三性。由声闻等性差别故。此中偈曰。转<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>性二。<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。释曰。转此暖顶二善根。从声闻性生起。得成大正觉有如此义。若得忍已则无此义。何因故不得。彼说由已过度诸恶道生故。诸菩萨由化作他利益为自胜事。故意能往诸恶趣受生。此性不可回转。故无此义。偈曰。转三余。释曰。从声闻性。转三决择分能善根。成异大正觉。谓成独觉。独觉性不可回转。何以故。偈曰。不求利他故。余转性不遮。释曰。若观行人本发独觉愿。后入修观得暖顶二善根。此善根则不可转为菩萨善根。何以故。由彼不为利益他事故。发愿修观故。此二位虽复可转于彼无可转义。以心愿坚故。若转作声闻不遮此义。复次偈曰。至觉彼一坐。后定佛独觉。释曰。大师佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>及犀角喻佛此二人于一坐中。依止第四定。由明了不动三摩提故。从初发起四决择分能善根。乃至<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。唯于一坐得究竟菩提。谓尽智无生智。此义后当说。有余师说。从修不净观。乃至菩提于一坐得究竟。若有人执。有别独觉异犀角喻独觉。于彼人转二善根成菩萨。此义无遮。于过去生未修解脱分能善根。但于今生作功力生决择分能善根。为有如此义。不必定。无如此义。何以故。偈曰。前彼解脱分。释曰。此义决定。应知于过去生先生解脱分能善根已。今生方得生决择分能善根。若人急疾<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。经几生修得成解脱分能。及决择分能善根。偈曰。速解脱三生。释曰。第一生先生解脱分能善根。第二生次修决择分能善根。第三生修得圣道。譬如次第下种苗成结实。何故如此次第。于此法真理及教中。应令自相续入住成熟解脱。诸师说解脱分能善根。偈曰。闻思性。释曰。此业但是闻思慧类。非<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>类。此有几业。偈曰。三业。释曰。若论最胜。但是意业。由愿所摄。身口二业亦成解脱分能何以故。有人施一食。或守一学处乐解脱力所引故。因此业引生解脱分能善根。引此业于何处。偈曰。引生于人道。释曰。人道中于三洲得引生此业。于余则无。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>厌离二法。如应无故。由义相应。说解脱分能已。入四谛观次第。是今所说。此中乃至世第一已说。所余今说故说此言。偈曰。世第一无间。无流法智忍。释曰。从世第一善根无间。无流法智忍得生。缘于何境。偈曰。欲界苦。释曰。欲界苦是彼境界。此忍说名苦法智忍。为显此无流故。以等流果简别。此忍能得法智故。名法智忍。譬如花果树。说此忍名入正定聚。何以故。因此忍观行人能入正定故。正是何法。经中说涅槃名正。于中定者。是一向不异义。至得此决定故名入。若此忍已生。说此人名道人。此法次一刹那未生时。凡夫性已转灭。是此忍未来功能。此义可然。无余譬如灯生。有余师说。以世第一灭凡夫性。是义不然。同<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>法故。此义无失。此彼相违故。譬如上怨家肩杀怨家。有余师说。由二故灭。此二似无间解脱道故。偈曰。次中。法智。释曰。次苦智忍后无间于欲界苦中法智生。说此为苦法智。无流言应知流至一切处。如于欲界苦中法智忍及法智生。偈曰。复尔生。于余苦类忍。及智。释曰。苦法智后无间。合色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>苦。为一所缘境。类智忍生。说此为苦类智忍。次无间类智生说此为苦类智。于初入观由知法真实理故。此理无坏。若佛出世及不出世。此理恒然。故说名法。由此后观是前观类。后所缘境。是前境类。以后随应前故。说后名类。如于苦有四忍智生。偈曰。三谛尔。释曰。苦类智后无间。于欲界集法智忍生。次无间集法智生。如此无间次第。于所余集类智忍。及集类智生。于欲界灭法智忍。及灭法智生。于所余灭类智忍。及灭类智生。于欲界苦对治。道法智忍及道法智生。于所余道类智忍及道类智生。偈曰。如此十六心。观四谛。释曰。由此次第。是四谛观成有十六心。有余部说。四谛观唯有一心。此观于彼应知是不了义说。何以故。于彼经中说四谛观。类不分别故。此四谛观。偈曰。有三。见境界及事。释曰。见观者。由无流智了别谛相故。境界观者。由与无流智相应同境界故。事观者。由不相应法故。谓戒生等。若已见苦。此<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>即成。于集等余。谛有事观。由断证修故。若彼说约见观。立为一观。此说不然。由四谛相有差别故。若彼说。由<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>相。见一切谛。是义不然。何以故。此观不从苦谛为初成故。若尔与经相违。经云。圣弟子由苦相简择苦。由集相集。由灭相灭。由道相简择道。与无流思惟相应智。说名择法觉分。若汝言。此经为显<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。故说此言。是义不然。如见修故。若汝言。由见一谛于余得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。故说一时观谛。此义无失。四谛观中。有说出观。有说不出观。此义应思。若说如此。是时<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>苦。则灭除集。至得灭修习道故。说一时观谛若执如此。则无过失。于一谛一见观。于余谛说事观故。若约见观。于经中说。四谛定次第观此说可见。经云长者非一时观诸谛。云何观次第观。如此广说。有三经。皆有譬喻。若汝言。若人于苦谛。无疑无不决心。于佛亦无疑无不决心。由此经。是故知有一时观四谛。是义不然。依不更起必定应灭。故说此言。是所说有十六心观。偈曰。世第一同地。释曰。随世第一所依地。十六心观同依此地。世第一所依地有六。于前已说。云何必定应有此义先忍后智。由此义。偈曰。忍智无间道。解脱道次第。释曰。忍谓无间道。约<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>至得断不可间隔故。故说无间道智。谓解脱道。是已解脱惑。至得人法故与灭离至得俱起故。故说解脱道是故此二必定应有。譬如牵却关户。若说第二解脱道。与灭离至得。一时俱起。灭离疑惑智于此境界不应得生。由忍能灭惑故。此难不然。若汝言。九结聚由忍灭。不由智故则与阿毗达磨藏相违。是义不然。忍是智伴类故。譬如臣事说为王事。忍于智亦尔。为一切十六心由见谛故。皆是见道。为不尔。虽然偈曰。由见未曾见见道十五心。释曰。以苦法智忍为初。乃至道类智忍。是十五刹那心名见道。何因得名见道。由见所未曾见谛故。于第十六心无未曾见今始见。由重习所曾见故成修道。为不如此耶。此心亦见非自所曾见道类智忍所缘谛。是义不然。何以故。今思约谛不约刹那。复次不由第八刹那谛非所见。譬如一区田。余一穗未被刈。说未刈田。无如此义。属果摄故。八智十六行修故。由道于先灭故。修道是彼相续故。是故立道类智属修道。此不退义。由执持见谛惑灭离故。若汝言。是故此属见道是义不然。由有太甚失故。七智云何属见道。由见未究竟故。此中见谛未<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。由此七智在见中间。是故数彼为见道。已说此义。谓能决判见修道生及差别。复次已生圣道人所有差别。今当分别说。是前所说见道为性。十五刹那。此中应知有二人。偈曰。钝利根二人。于中信法行。释曰。若钝根人行于彼中说名由信随行。若利根人说名由法随行。由信人故随行于义故。名由信随行。又由信根随行。为此人法。故名由信随行。先由信他故寻思义。由法随行亦尔。先由经等<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。自寻思义。为此义故说四量。法为量非人。义为量非文句。了义为量非不了义。智为量非识。云何判此四。由四种人差别故。一由贡高人差别故。二由路柯耶胝柯人差别故。三由自见取住人差别故。四由闻胜人差别故。此中于贡高人。以法为量非人。由共论说思量为智所得故。不但由威仪差别。复次佛世尊。有说人有<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。此中法为量非人。此法有二种。文句及义。此中义为量非文句。由不爱着国土言说故。何以故。不应成取文句为胜决定。应思量简择义。佛世尊说。经有二种。有了义有不了义。若人简择义。应以了义经为量。非不了义。佛世尊说。随福行及不动行。识为生善道。说四谛智为至得涅槃。若人行于法似法。以智为量非识。复次于四时中有失无失故。约四人立四量。一读诵时。二忆持时。三简择时。四修行时。此二人偈曰。若已灭修惑。于初果道向。释曰。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>果初者。谓须陀洹果。于一切果至得中。为第一故。由未得此果故。若由实有义。但名由信随行由法随行。如先由世间道已灭修惑。或是具缚。说此为向须陀洹果。偈曰。乃至灭五品。释曰。若此人先由世间道。灭欲界修惑。乃至五品尽如此说向初果。偈曰。向二灭九前。释曰。若此二人从第五品后。先灭六七八品已。方入见道中。说此二人向第二果。谓斯陀含。偈曰。离欲欲<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。则向第三果。释曰。此人若已灭第九品。离欲欲界惑已。灭上界惑。乃至无所有处。说此二人向第三果。谓阿那含。偈曰。十六二住果。随所向三人。释曰。若第十六心起不可更说。此人为由信法随行。亦不可说向果云何可说。住果人住何果。于前若向此果。今即住此果。或须陀洹果。或斯陀含果。或阿那含果。阿罗汉果异前三。不可由见道如彼从初得。何以故。由见道能灭修道所灭惑故。无道理先于见谛惑灭离欲有顶故。偈曰。是时信乐得。见至软利根。释曰。是时钝根人先由信随行。今说名信乐得。若利根人先由法随行。今说名见至。由得最上品信智故。是故信乐及见所显。复有何因。若人已断五品修惑。于第十六心但说为须陀洹人不。说为斯陀含向。由此义。偈曰。得果果胜道。由不能得故。未修行胜道。故住果非向。释曰。若人正得果。不得由果胜道。此义为定。是故若人住果。乃至未修行果胜道。为得别果。是时未可说为向别果。于余果亦尔若人离欲第三定。更依下地入正定。此人必定现前由果胜道。若不尔。从下生上界。则不应与乐根相应。安立多灭及离欲人。入正定位中。其义如此。次第安立人今当说。是故且安立此义。如于欲界中说修惑有九品。如此偈曰。诸失有九品。地地德亦尔。释曰。如欲界中所说有九品惑。于色无色界地地乃至有顶应知各有九品惑。如惑德亦尔。为对治此失。名无间道及解脱道。地地各有九九品。云何如此。偈曰。软中上三品。更软等差别。释曰。根本有软中上三品分别。一一品更有软中上三品差别故。安立成九品。此云何有。软软品软中品软上品。有中软品中中品中上品。有上软品上中品上上品。此中由软软品道。上上品惑灭。乃至由上上品道软软品惑灭何以故。从初上上品道品不得生故。于已生上上品道人。相续中上上品惑已无故。譬如浣衣。先除粗尘垢后方除细。又如粗闇由微细光灭。微细闇由大光灭。道惑亦尔。何以故。白法势力强故。黑法势力弱故。是故由一刹那生软软圣道。无始<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>轮转所增益。成上上品诸惑皆得灭离。譬如久时增长三病。以一两三角根散即能牵灭。譬如一刹那小灯。能破坏久时大闇。如此于一切九品惑中。偈曰。未灭修惑品。住果七生竟。释曰。若人已住果。未灭一品修道所灭惑。说此人名须陀洹。唯能作七生故。说七生胜此一切后。何以故。非一切皆作七生故。故经中说七生为胜。七反受生是彼圆满生。何以故。胜言者极为义。道者谓向涅槃流。由此道行至涅槃故。是人已至此流故。说名须陀洹。云何至流。若由得初道故名至流。第八亦应成须陀洹。若由得初果故名至流。多灭修惑人。及已灭九品惑人。亦应成须陀洹。约得一切果人。由得第一果。立为须陀洹。何因得初果立名须陀洹。不立第八。由得向果道故。由得见修二道故。由对证具足流故。于道类智中。是故此人得须陀洹名。向人则非。此人于人道中作七生有及七中有于天道亦尔。此人受二十八生。云何说七生为胜。由七平等故。故说七生为胜。譬如七处胜智及七叶树。毗婆沙师说如此。若尔经中云何说。具见人应生第八有。无有是处。此经意但约一道。若如文分别。中阴亦不应有。如此上流人至有顶为胜亦尔。第八生不应有。由约欲界说。此则无失。此中何证。有经及道理。定以何证。于人天各有七返。非合二有七返。经说于人天道。唯有七返。云何得知此义。七返人道。七返天道。由经言。七返于人及于天。迦尸比部说。有各各语。谓七返于人。七返于天。应同此义。若人于人道得须陀洹果。后必还于人道得阿罗汉果。于天道亦尔。复有何因。须陀洹不生第八有。由如此量时。相续成熟故。道类亦尔。譬如七步毒蛇毒。又如第四日虐。复次由七结为余故。下结余二。上结具五。虽于中间修圣道现前。不得般涅槃。七生应受。业势力所持故下上二业所引故。若诸佛不出世。在家得阿罗汉果。得阿罗汉已。必不住家。法尔必得<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>威仪。有余师说。或作别道人威仪。云何此人不退善道为法行恶道业无增长故。已增长能生<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。业于生果报中。无复功能故。由相续为最强力善根所镇故。行意二清净故。若有定感恶道业。尚不能得忍善根。何况须陀洹。此中说偈</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十八卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>阿毗达磨俱舍释论 第十八卷</p><p>婆薮盘豆造</p><p>陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>分别圣<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>人品之三</p><p>复次如凡夫生初定地以上。由舍欲界惑灭离至得。与彼惑不更相应。于彼亦尔。是故此执非证。复由何地。从何地得离欲。偈曰。由无流非至。离欲一切地。释曰。若依非至定地。修无流道。能离欲一切地乃至有顶若人依近分定。得下地离欲。为如无间道一切<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道亦从近分定起不非。何为。偈曰。从定近分后。脱道三地胜。释曰。一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>生地有九种。谓欲界四色定四无色定。此中从欲界离欲。乃至第二定离欲。名三地胜。于此三地中。最后解脱道。或从近分定起。或从根本定起。偈曰。非上近分。释曰。从三地胜以上。一切最后解脱道。皆从根本定起。悉不从近分定起。舍根平等故。于三定中近分及根本。由受根异故。有余人不能得入根本定。通<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>根难成故。是故于离欲三地。最后解脱道。亦得从近分定起。由无流非至定得离欲一切地。此义已说。由余地未说故今应说。偈曰。圣由八自上灭。释曰。若由八种无流定得离欲。谓色定中间定无色定。从自地及上地。皆得离欲。非从下地。先已离欲故此中出世无间道解脱道缘<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>为境故。如谛十六相起。此义自成。偈曰。解脱无间道。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>如次第。寂静粗重等。想上下地境。释曰。解脱道起。寂静等为相。无间道起。粗重等为相。此二道如其次第。第一缘上地为境起。第二缘下地为境起。若解脱道思量上地。则缘寂静美妙出离随一相故。若无间道思量下地。则缘粗重逼恼厚壁随一相故。由不寂静。故名粗重。由大功用所成非美妙。故名逼恼。由多过失能违逆故。不得出离此地。故名厚壁。譬如罪人不离牢狱重障故。翻此相应知寂静美妙出离相义。说随本应余义已。复次从尽智无间后。何智得生。偈曰。若不坏尽智。后无生不生。尽智或无学。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。释曰。若人成不坏法阿罗汉。从尽智无间后。无生智必生。非尽智无学正见生。若非不坏法人。从尽智更生尽智。或生无学正见。非无生智有退堕故。复次此无学正见。于不坏阿罗汉。为必不生耶。偈曰。此通应。释曰。若不坏法阿罗汉。从无生智后。有时无生智更生。有时无学正见生。何以故。此正见于一切阿罗汉。皆通无差别。是前所说四果。此果属何法。是<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>若果。何法名沙门若。偈曰。沙门无垢道。释曰。若道是无流称为沙门若。由此道人成沙门那。由能寂静惑故。如经言。此人能寂静多种恶法。不应慧法。染污法随顺<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>能感后有。乃至老死故。名沙门那。凡夫非必定能寂静众恶故。非真实沙门那。复次此沙门若。何法为果。偈曰。有为无为果。释曰。有为<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。是沙门若果。此果于前已说有四种。谓须陀洹斯陀含阿那含阿罗汉。如经言。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>沙门若果有四。广说如经。复次此果有几种。偈曰。彼一减九十。释曰。此沙门若。沙门若果。有为无为。各八十九。此是何法。偈曰。解脱道与灭。释曰。为灭见惑。有八无间道八解脱道。为灭修惑。于九地各有九品无间道。各灭九品惑。各有九品解脱道。此中一切无间道。名沙门若。一切解脱道。名有为沙门若果。是无间道等流果。及功力果故。诸惑灭离。名无为沙门若果。由如此义。有为无为果各有一减九十。若尔于佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>此义应合分别。不可分别。若果甚多。偈曰。成立四种果。由五因具有。释曰。于灭道位中。若具有五因。于此位中佛世尊安立沙门若果。何者五因。偈曰。舍前得别道。得通灭果果。及至得八智。修习十六行。释曰。一先舍离前道。二至得未曾得道。由舍离至得向道道果故。三合数至得灭。由一至得。至得一切灭故。四一时得八智故。五四法智及类智。修习十六谛相。谓<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>等相。如此五因。果果皆有此五因。不可于<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>中立。若唯无流道名沙门若。云何世道所得二种果。名沙门若果。偈曰。世道得离故。得无流持果。释曰。于二果中不唯以世道灭为果。谓斯陀含果。阿那含果。云何见道果灭于中相离。同一至得。摄一切灭。为一一果故。是故经中说。何者为斯陀含果。谓三结灭离。及欲嗔痴薄弱。何者为阿那含果。调五下分结灭离。由无流道至得灭离故。故此道被持。由无流道力。至死不退失故。是故此灭如理应成沙门若果。是前所说名沙门若果。复次此偈曰。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>梵轮。说此梵转故。释曰。由能遣荡诸惑故。说名婆罗门。或说名梵轮。由梵转故。与无上梵<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应故。说佛世尊名夫岚摩。如经中说。世尊是夫岚摩。如此寂静。如此清凉。广说如经。故佛世尊名夫岚摩。此轮是佛世尊轮。故名梵轮。唯佛世尊所转故。偈曰。法轮名见道。释曰。轮者何义。因此得行故说名轮。由见道似轮故。说此法名轮。云何相似。偈曰。疾行等辐等。释曰。由疾行故似轮。由舍此趣彼故。由未伏能伏已伏镇令不失故。由从下向上从上向下故。由此疾行等义故言似轮。由辐等义者。八分圣道。由辐等义似轮故。大德瞿沙说此名轮。正见正觉正进<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。此四法似辐。正语正业正命。此三法似毂。正定此一法似辋。是故见道说名法轮。立此见道为法轮。以何法为证。于圣憍陈如见道生时。由说言世尊已转法轮故。云何三转十二相。此法是苦圣谛。此谛必应知。此法已知。如此三转。于一一转中。<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>成智成明成慧成。如此三转及四相。谛谛皆有。由同三及十二故。说三转十二相。譬如说聪慧于二处七处。由此转见道<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>无学道。如数已显现。毗婆沙师说如此。若执如此。不但见道有三转十二相。云何安立此为法轮。是法门本名法轮。此中亦具有三转十二相。若尔云何三转。于中三番转四谛故。云何十二相。三番思想<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>故。谓此法名苦圣谛及集灭道圣谛。此法必应知。必应灭。必应证。必应修。此法已知已灭已证已修。云何说名转。由行度他相续令彼解此义故。复次一切圣道皆是法轮。由能行度于<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>相续故。此法于他相续。由生见道故。正被转说已转。复次于何界中得几沙门若果。偈曰。欲三<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>后。释曰。唯于欲界中得三果。于余无。最后沙门若果。谓阿罗汉。此果于三界通得。此前二果。未离欲人所得故。于上不得。此义应理。第三果云何于上不应得。偈曰。上界无见道。释曰。于欲界上无见道。若离此道。已得离欲人。至得阿那含果。无有是处。由此义。是故但于欲界有三果。由何因于上地无见道。于<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>正闻无故。不能缘下界境故。故无见道。于<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>中。偈曰。无厌故此作。彼究竟经故。释曰。色界凡夫。由爱着三摩跋提乐。由无苦受故。不生厌恶心。若离厌恶。无别道理能引生圣道。如此等名道理。亦有阿含为证。经言有五人。于此造作于彼究竟。何者为五。中灭乃至上流。造作者。谓初发修见道。是<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>正方便故。究竟者。谓至得阿罗汉果。由此经故。知于上界无见道。前已说此义。若不坏法阿罗汉。尽智后必生无生智。阿罗汉为有差别不。说有。偈曰。阿罗汉有六。释曰。于经中说。阿罗汉有六性。一退堕法。二自害法。三守<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>。四住不动法。五应通达法。六不坏法。偈曰。前五信乐性。释曰。除不坏法一人。所余五人信乐得为先。偈曰。彼脱依时爱。释曰。此五人应知。彼解脱依时得成。及最所爱恒守护故。是故说彼有时解脱。彼观时得解脱故。由除观字故。说时解脱。譬如酥瓮。何以故。彼人现前修三摩提。必观时成时者。谓命缘无病住处时等。观此时彼俱解脱成故。偈曰。不坏法无坏。释曰。若不坏阿罗汉所得解脱。则恒成无破坏。由无退堕故。偈曰。故非时解脱。释曰。是故说此人不依时解脱。何以故。此人不观时。恒解脱如意。能现前修习三摩提故。复次由蹔时永时解脱故。立彼为有时解脱无时解脱。由有退失不退失义故。偈曰。此先见至类。释曰。此不坏法阿罗汉。于学位中应知见至为性。此六阿罗汉。为从初有六性。为后得六性。偈曰。有余本得性。有余练根得。释曰。有人从初本以退堕为性。有人从初本以自害为性。所余性亦尔。复次有人。先以退堕法为性。后由修练根行。更进得自害法为性。乃至进得不坏法为性。应知亦尔。此中退堕法者。若人必定从所得法退堕。不能得自害法为性。自害法者。若人必定应杀害自身。守护法者。若人随自所得必定应守护。住不动法者。若人离最强退堕<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。虽不恒守。必定应住于所得不动。无退堕故。离加行故。不得增进。通达法者。若人后时必定通达不坏法为性。不坏法者。若人必定不如前人有退堕。前二人于有学位中。无恒修及尊重修。但根有异。第三人恒修加行根钝。第四人尊重修加行根利。第五人具二修但根钝。第六人具德二<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>根最利。第一退堕法人。非必定应有退堕。乃至通达法人。非必定应通达。不坏法但约有义。故说此名。若人执如此。于三界中皆具六阿罗汉。此义不相违。若人执彼必定有退等事乃至通达。于彼人欲界中有六阿罗汉。色无色界唯有二。谓住不动法及不坏法。此二人更退自害。修练根行。此事不有故。此六人中何人得退。从何法退为从果。为从性。偈曰。退性有四人。五退果。释曰。自害等四人从性退。何以故。退堕法人。无更从<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>退堕。退堕法等五人。皆从果退。此五人虽退。偈曰。非先。释曰。若人先所得性。此人不从此性退。由有学无学道成就令坚实故。若有学性。世出世道所成就。亦无有退。由修练根行。后所得性。此性有退。若人得初果。此人从初果无退。从余果得退。是故从须陀洹果。无有退堕。若作如此执。退法有三人。一在退堕性中般涅槃。二修练根所得性退。三退堕有学。自害有四。三如前。第四更还退性。如此余三增一一品。如次第应知。成五六七人。是本所得性。若退成有学人。于中得住不住余性。若不尔。由得增长性。转增不成退。复有何因从初果不退。偈曰。见惑无类故。释曰。云何无类。一切见谛所灭惑。依我生起故。彼以身见为根本故。此所依我。必定永无。故说无类。若尔彼应成缘无为境。非缘无为境。由缘谛为境故。于谛中不如分别为境。若尔何惑不然。有差别。何以故。我见于色等类。由作者受者<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>者分别故。增益非实有我性起。以身见为依止。所余边见等惑生起。是故说无类。修道所灭惑。欲嗔慢无明。于色等类中。爱增上起。不了为自性生起。是故说有类。何以故。彼有微净等境。由缘此故。彼得起我等皆无仿佛。复次随道所灭惑。有境类各各相对。谓可爱不可爱等。一切见谛所灭惑。通以我等相为境。是故无各相对境类。复次见道所缘境。谓无常苦<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>空。真实是有故。非世道所缘故。于无始生死。先未曾所证见故。是故初果无退事。复次<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。若不至心观察。由念忘失修惑则起。若至心观察则不得起。譬如于藤起蛇想。若人不至心观察。我见等惑则不得生起。诸见由明了决度故。是故圣人。从见谛惑。无有退义。经部师说。从阿罗汉果。无有退义。此义真实可然。云何可知。由阿含及道理。此中是何。阿含经云。比丘此是真灭。若由圣智所灭。复次偈曰。说无放逸事。释曰。经云有学人。于无放逸中。我说必有无放逸事。于阿罗汉我不说。若汝言。于阿罗汉亦有无放逸事。如经言。阿难。于阿罗汉人。利养赞叹等事。我说亦能为障碍。是义不然。此经所说。退但说从现法安乐住退。是不坏心解脱。本来身所证。我说从此无别因缘能令阿罗汉退堕。若汝言。从依时解脱有退。是义可然。我等亦说。如此此依时解脱义。应须思量。为是阿罗汉果。为是九定是根本定及根本三摩提。云何知依时现前故。说名依时解脱。为于现世安乐住数数所寻修故。说名所爱。有余师说。是应所啖味故。说名所爱。阿罗汉解脱恒相随逐故。不可立为依时。非复所爱故。不可立为所爱。若从阿罗汉果有退堕。理云何。佛世尊说。唯从依心学现世安乐住有退。是故应知此义。谓一切阿罗汉解脱。必是不坏法。从现世安乐住。阿罗汉有退。由利养赞叹等心散乱故。由自在退失故。由根钝故。有人亦不退。若利根人。此中若有退说名退法阿罗汉。若不退说名不退法阿罗汉。自害法等义应如此思。不退法住。不动法。不坏法。此三人有何异。不退法者。非练根至。不坏法者。由练根至。此二人随所修得三摩跋提差别。从此无退堕。住不动者。彼于随所得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>中住。从此功德必定不退。亦不增进生余功德。若生余功德从此得动。如此应知三人差别。偈曰时解脱瞿提。释曰。净命瞿提柯在学位中。由数数啖定味故。由根钝故。从依时解脱退堕。生忧悔心。欲舍身命。执仗自害。于将死时得阿罗汉。即般涅槃。是故瞿提柯非退阿罗汉果。于十增经中说此言。有一法必定应生。谓依时所爱心解脱。复有一法必定应证。谓不坏法心解脱。若依时所爱心解脱。是阿罗汉果。云何于十中作两番说。于余处不曾闻说阿罗汉后更应生。云何文必定可证。若汝言。钝根所摄阿罗汉果必应更生。此经文欲证何义。若汝言。欲显于生果有能故。以此文为证。若尔于余果亦可以此为证。若汝言。此果应生故。故说应生。余果最应生。是故依时解脱。非阿罗汉果。若尔云何说阿罗汉依时解脱。若阿罗汉人由钝根故。现前修三摩提观时得成。说此为依时解脱。翻此为非时解脱。阿毗达磨藏说。有由三处欲界随眠欲生起上心。何者为三。一欲界随眠欲未得灭离。二随欲界上心欲法对根现前三。于中起不如思惟若。汝言此。文依具因生惑故说。何惑由不具因得生。依阿含证不退义如此。云何由道理。若阿罗汉人。已得如此对治。由此一切惑至得永不生为法。云何更退。若此对治未生。云何诸流得尽。由未永拔除惑种子。更生为法。若流未尽。云何称阿罗汉。依道理证不退义如此。偈曰。由火聚譬退。释曰。若尔火聚譬经汝宜应救。此经言。多闻圣弟子。如此行如此住。有时有处。由念忘失故。更生恶不应慧觉观。是义不然。何以故。此文中不定显现阿罗汉。云何知。由此经言。阿罗汉心长时归向空寂。乃至垂堕涅槃。由此言故。知前非证。复有余经中说。阿罗汉有如此力。由一切流处诸法。阿罗汉恒时清凉。恒时寂静。由此言故前非证。有如此言。乃至未弃舍行。若尔有学人在行中。亦有此义。于或生中火聚譬经。由依有学位说故。于阿罗汉无如此失。毗婆沙师说。诸阿罗汉人。从果得退。为唯阿罗汉有六性。余人亦有。偈曰。凡学人六性。释曰。不但阿罗汉有六性。凡夫及有学人。皆有六性。何以故。是阿罗汉六性。以彼次第为前。复次偈曰。见道无练根。释曰。于异见道处。有修练根行。于见道中则无。修加行不及故。有人于凡夫位中。修度余根。有人于信乐得位中。修练根行。经中说言。是人所得四种依心现法安乐住。从此随一我说有得退堕。是不坏心解脱。唯一阿罗汉人。本来身所证。我说无别因缘能令阿罗汉从此退堕云何不坏法阿罗汉。从现世安乐住得退。偈曰。退堕有三种。已得未得用。释曰。已得退者。若人从已得功德退堕。未得退者。若人不能得应得功德。受用退者。若人所得功德。不令现前。此三种退堕中。偈曰。最后佛不坏。中间余有三。释曰。佛世尊但有受用退无余。由如来一向行利益他事。不坏法阿罗汉。有受用退及未得退。谓从胜人法差别。未至得故。余诸阿罗汉。亦有已得退未得退受用退。此二可知。由经依受用退。说退。立不坏法阿罗汉不退。此不违经。是故一切无流解脱。皆不可坏。如所说安立不坏法阿罗汉义。此义如非不如。是故此义不可难。谓阿罗汉。皆以不坏为法。此名显不坏义。复次如毗婆沙言。若有阿罗汉。退阿罗汉果。此阿罗汉。为更受生不。不更受生。云何得知。偈曰。退位不死故。释曰。无有一人从圣果退在退位中舍命。何以故。如经言。比丘圣弟子。若忘失忆念皆悉迟缓。虽然若灭此忘失。速得灭尽。由此经言。是故无有死义。若不尔此正梵行。非可安息。若人从此果退。是昔所住果非所作事。为更作不。偈曰。不作非所作。释曰。若人已退。不更作与本果相违事。譬如健人虽趺不躄。若人修练根行。有几无间道及解脱道。偈曰。无间解脱九。不坏。释曰。若人求通达不坏法性。是通达法人所修。有九无间道九解脱道。譬如人求得阿罗汉果无间解脱道。云何如此。是软根性。偈曰。由久事。释曰。此人于长时已数习软根性。此根由少分功用不可回转。由有学无学道所成坚实故。偈曰。于见至一一。释曰。若人欲通达见至性。修无间道唯一。解脱道亦一。于中方便道亦一。是一切无间道解脱道。偈曰。无流。释曰。何以故。由有流道修练根行。无有是处。根无流故。道所缘境皆真如故。何处根可练令增进。偈曰。人道增。释曰。于人道中得修练根行。于余处则无。无退堕故。复次何人依何地得修练根行。偈曰。无学依九地。有学但依六。释曰。若无学人依止九地修练根行。谓未至地中间定四色定及三无色定。若有学人。依六地修练根行。离三无色。何以故。由此义偈曰。舍有差别果。得胜果道增。释曰。若人修练根行。舍果及果胜软根道。即得利根性果及道。无阿那含果是无色界摄。由此因故。有学于无色界无练根行。是故一切阿罗汉。唯有九人。由根差别故。云何如此。偈曰。二佛声闻七。有九由九根。释曰。何者七声闻。退堕法等人有五。不坏法人有二。一由练根至。二从本。是不坏法性。于本不坏性中有差别。谓二佛。一独觉二大正觉。此九人由软软中软上软等根差别故。是故成九阿罗汉。一切圣人唯有七人。谓由信随行。由法随行。信乐。得见至。身证。慧解脱。二分解脱。如此七人。偈曰。加行根灭定。解脱二故成。七人。释曰。若由加行成二人。谓由信随行。由法随行。于前由信受他教。及由法修行。于义修加行故。若由根成二人。谓信乐得见至。由软钝坚利根故。一由信乐胜。二由<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>胜。若由三摩跋提成一人。谓身证。由身<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>灭心定故。若由解脱成二人。谓慧解脱二分解脱。由慧及定解脱惑障及定障故。此人由名成七。偈曰。或六人。三道人双故。释曰。若由实义唯有六人。何以故。于见道中有二人。谓由信随行。由法随行。此二人若于修道中成别二人。谓信乐得见至。此二人若于无学道中。成别二人。谓时解脱非时解脱。此中若由根差别。由信随行人成三人。若由性更成五人。若由道成十五人。住于八忍及七智故。若由离欲成七十三人。一具缚人。于离欲欲界有九人。乃至离欲无所有无色处。各有九人。由依处有九。谓三洲及六欲天生。由根性道离欲依处。合数成百千四十七千八百二十五人。所余诸圣人。如义及理。应如此数。是所说名。二分解脱。此是何人。慧解脱复是何人。偈曰。得灭定俱脱。余人慧解脱。释曰。若人先得灭心定。后于无学位。名二分解脱。由般若及三摩提。解脱惑障及八解脱障故。所余但由般若力。一向解脱惑障故。佛世尊所说偈</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第十九卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第十九卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　分别慧品第七之一</p><p>　　已说诸忍及诸智已。说<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>及正智。诸忍为非智。正智为非正见耶。偈曰。无垢忍非智。释曰。是前所说八种无流忍非智。是所应灭随眠疑惑未灭故。可说彼名见。决度寻觅为体性故。如忍但是见性非智如此。偈曰。尽无生非见。释曰。尽智无生智非见。非决度寻觅为性故。偈曰。异彼圣智二。释曰。异于忍及尽智无生智。所余无流<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。亦见亦智。偈曰。余智。释曰。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>般若一切皆是智。偈曰。见有六。释曰。五见及世间正见。此六种世间般若。名见亦智。所余非见但智。由几量能摄一切智。由十智。若略摄十智。唯有二智。偈曰。有流无流智。释曰。一切智不出二性。谓世智出世智。此二中偈曰。第一名俗智。释曰。有流智说名世俗智。何以故。此智由多缘瓶衣男女等俗类为境故。偈曰。无流智有二。法智及类智。释曰。无流分为二智。谓法智类智。以此二智合前成三智。谓世俗智法智类智。此中偈曰。俗智一切境。释曰。一切有为<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。皆是俗智境。偈曰。欲苦等为境。法智。释曰。法智者。于欲界中以苦苦集苦灭苦灭对治为境。偈曰。若类智。上苦等为境。释曰。类智者。于色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中以苦苦集苦灭苦灭对治为境。偈曰。此二由谛异。成四。释曰。法智类智。由谛有差别故成四智。谓苦智集灭道智。由缘<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>起故。偈曰。四更二。名尽无生智。释曰。法智类智。由境已成四种。于中若非无学正见为性。名尽智无生智。偈曰。此智复初生。苦集类智性。释曰。此二智若初生。名尽智无生智。以苦集类智为性。由苦集各四行相。缘有顶阴为境界故。金刚譬三摩提。与此二所缘境同不。若金刚譬三摩提缘苦集为境则与二智同境。若缘灭道为境则与二智不同。偈曰。从四他心智。释曰。他心智从四智成。谓法类道世俗智。此他心智。更须决判。偈曰。过地根人上。释曰。若过地心。下地不能知上。谓下地定心不能知上地定心。若过根软根不能知上。谓信乐得人。及时<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>人道。不能知见至得人及非时解脱人道。若过人下人不能知上人心。谓阿那含阿罗汉声闻独觉佛道。下不能知上。偈曰。灭未生不知。释曰。若过去未来他心。他心智则不能知。以现在他心为境界故。复有何非所知。偈曰。法类互不知。释曰。法智种性他心智。不能知类智种性他心。类智种性他心智。不能知法智种性他心。何以故。此二心以欲界上界对治为境界故。于见位中无他心智通。以时促故。见位得为他心智境。此中若人由他心智。欲知见道心。先作加行已。偈曰。见位初二念。声闻犀喻二。佛自然具知。释曰。若声闻修他心智。欲知见道中他心。得知前二<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>心。谓法智忍法智。知类智种性境。别加行所成故。是时于中修彼他心智方便。此修观人。已度至第十六心。于中间不能得知。若犀角喻独觉。欲知见道中他心。得知三刹那心。谓前二心及第八集类智心。由加行软故。余师说。知第一二第十五心。佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>一切见道刹那心。不由加行心知。但以<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>心知。复次尽智无生智。此二有何差别。偈曰。尽智于四谛。已知等决知。不更应知等。说名无生智。释曰。阿毗达磨藏云。何者尽智。苦谛我已知厌。集谛我已断除。灭谛我已<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。道谛我已修习。以此义。是知见明觉慧解先正对观。是名尽智。何者无生智。苦谛我已知厌。不更知厌。乃至道谛我已修习。不更修习。以此义。是知乃至正对观。是名无生智。云何由无流智得知如此。由无流智后智出。观已得知如此。由后智有差别故。立尽无生智有差别。罽宾国阿毗达磨师说如此。有余师说。由无流智得知此义。说尽无生智为见者。为以一切名释此义故。复次由证智为性故名见。是故阿毗达磨藏中说。若法是智即此法是见。复次为显今所说见异前所说见。如此名十智。谓法智类智世俗智他心智苦智集智灭智道智尽智无生智。此中世俗智。是一智一智分。法智是一智七智分。类智亦尔。苦智是一智四智分。集智灭智亦尔。道智是一智是五智分。他心智是一智四智分。尽智是一智六智分。无生智亦尔。云何智唯三。安立为十。偈曰。由自性对治。行相行相境。加行作事办。因圆故说十。释曰。彼说由七种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。安立智成十。一由自性故安立世俗智。非能知真实义故。二由对治故安立法类二智。由能对治欲界上界故。三由所缘相异故安立苦集二智。不由境界体异故。四由所缘相及境界体异故安立灭道二智。五由加行异故安立他心智。何以故。由此智他心法非所知故。唯欲知他心故。修加行人。得他心智。六由作事已办故安立尽智。由事已办人相续初生故。七由因缘<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故安立无生智。以一切无流法为因故。是一切<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>具对治故。于前已说。法智唯能对治欲界。复次偈曰。法智于灭谛。及道谛<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。是三界对治。释曰。灭道二法智。若修道所摄。能对治三界。偈曰。类智非欲治。释曰。类智一向不能对治欲界。此智异二故。说具对治。此十种智中。几智有行相。复有几行相。偈曰。法智及类智。有十六行相。释曰。此二智一一皆具十六行相。此行相后当说。偈曰。俗智如不如。释曰。世俗智有十六行相。有别相能缘一切法通相别相等故。偈曰。由自谛相四。释曰。苦集灭道智。由缘自谛行相起故。一一有四行相。偈曰。他心智亦尔。无垢。释曰。无流他心智。亦如此由缘自谛行相故。亦成四行相。唯道智故。偈曰。复有垢。如应知自相。释曰。若有流他心智。是自所应知心及心法如。如彼相思想亦尔。能取别相为境故。此二种偈曰。缘一物为境。释曰。是时若缘心为境。不能缘心法为境。若缘受不能缘想。如此等。若尔云何佛世尊说。若心有欲如实能知。此心有欲。如此等心及心法。不得一时取。譬如衣及衣垢非俱时取故。有欲心者。有欲有二种。一相杂有欲。二相应有欲。此中若心与欲相杂。由二义有欲。若异此有流心由相应义。是故有欲。此经中所说有欲。是相应有欲。若欲对治说名无欲。余师说如此。何以故。若与欲相应说名无欲。何有与别惑相杂亦应成无欲。是义不然。何以故。此心非欲对治故。若无染污心。非有欲非无欲。不应成无欲如此等。是故与欲相应心。此中说名有欲。乃至有痴无痴等。应知亦尔。略心者是<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。由境界少故。散心者是染污心。与散乱相应故。复次略心者与睡眠相应。散心者所余有染污心。西国诸师说如此。毗婆沙师不许作此说。彼说。此一心亦略亦散。染污睡眠相应故。若尔则与阿毗达磨藏相违。彼藏云。若如实知略心。此智成四智。谓法智类智世俗智道智。下劣心者。是染污心。与懒惰相应故。上胜心者。是善心。与<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>相应故。小行心者。是染污心。或善小净品所治故。大行心者。翻于前心。由根价伴类随从力少多故。何以故。若有染污心则与二根相应。若善心则与三善根相应。若染污心则少价。不由功用所成故。若善心则大价。由多功用所成故。若染污心。无未来同类修故。无多伴类若善心有过去未来同类修故。有多伴类。若染污心则少随从。三阴所随从故。若善心则多随从。四阴所随从故。染污心力少。彼所断善根更相续故。善心力多。由一刹那苦法智忍生。能杀害十惑永不生故。是故有染污心说名小。善心说名大。动心者是染污心。与掉起相应故。不动心者是善心。能对治彼故。非寂静心寂静心亦尔。非定心者。是染污心。与散乱相应故。定心者是善心。能对治彼故。非修心者是染污心。非生修及事修所修故。修心者是善心。生事二修所修故。非解脱心者是染污心。由非自性解脱相续解脱所解脱故。解脱心者是善心。由二解脱所解脱故。毗婆沙师说如此。若作此解则不随顺经。亦不能释如此文句差别义。云何不随顺经。如经言。云何心于内成略。若心与羸弱睡眠相应。或于内摄持相应。不与毗钵舍那相应。云何心于外成散。若心于五欲尘倒乱驰动故。于前不已说耶。此心亦略亦散。已说不应理。说睡眠相应染污心不立为散故。于前不已说耶。与阿毗达磨藏相违。阿毗达磨藏相违。此亦可然。但勿与经相违。云何不能释文句差别义。不说散下劣动不寂静不定非修非解脱心差别义故。略上胜等亦尔。若非不已说诸文句差别义。同是染污心。由显彼过失差别故。同是善心。由显彼<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>差别故。是故彼义差别已说。不救经相违故。此所说义。非文句义。若于经中许此心是下劣。心即是动心。汝释可然。经中不说此义。经言是时若心下劣。或疑欲下劣。于此时中轻安三摩提舍觉分。非是修时。是时若心驰动。或疑欲驰动。于此时中择法精进喜觉分非是修时。诸觉分为有散心修不思量。彼此中说名修。由能令现前故。是故无失。此中若心由懒惰胜。说名下劣。若心由掉起胜。说名驰动。是故无失。如此等或共生故。是故我等说。若心下劣即有驰动此语与密意相应。我亦不遮。于经中意不尔故。我说如此。是汝所说。一切欲相应心。说名有欲。何心与欲相应。若汝言欲至得相应故。说与欲相应。无流心应成有欲。谓有学心。若言缘欲为境界说名有欲。阿罗汉心亦应有欲。何以故。此心有时缘有流心分别有欲。由缘欲为境界故。是心云何得成有流。若汝言缘通惑为境故。是故说有欲。若尔是心但有痴非是有欲。由缘痴为境界故。缘他心为境界心。不缘至得为境界。非此心境界。缘欲为境界。是故不由欲相应故心有欲。此中应知。若尔有欲心云何。与欲相杂是名有欲。不与欲相杂。是名无欲。见经意如此。余经中所说是人心无欲无嗔无痴。不回转为法。于欲界<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>无色界依欲等至得灭。故说此文。若尔于前为不已说耶。若心与别惑相杂。由但不与欲相杂故。应成无欲。由此经意则无过失。不得取此心为无欲。云何不取。由经已说。此心有嗔有痴等。故勿复广论。应说本悉檀。为取他心行相。为取他心所缘境。不取此二为境。不观行相境界起故。但知此心有欲。不能知色等境。是心生欲处。若不尔。此心则缘色等为境界。若取他心缘色等为境。他心智应成取自性。一切他心智知物别相。谓心及心法。现世他相续。欲色相应不相应为境界。于见位被遮。于修位中得。非空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>不相应法尽智无生智所摄。无间道所遮。此义应知。说他心智已。偈曰。后二十四相。空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>所杂。释曰。后二者。谓尽智无生智。此二智行相有十四。离空无我二行相故。此二虽缘真如。多缘虚假知。我生已尽。我不见从此后更受别有。由观中智力故。出观说如此言。为有无流别行相心。为无。若依罽宾国师说。偈曰。无净出十六。行相。释曰。彼说无无流行相出四谛十六行相心。偈曰余师有。释曰。西国师说。阿毗达磨藏中说。异十六心别有无流心。云何得知。彼藏云。若不相应心。为得知与欲界相应法不得知。由<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦空无我。或由因集有缘得知。或有是处有是义。由道理相应故得知。无是处无是义。由道理不相应故得知。此执非彼藏义。谓有是处有是义由道理相应故得知等。此何为有是处有是义。由无常等相故得知。是彼藏义。是义不然。何以故。于余文中不说此义故。如此执若是彼藏义。此文句于余处亦必定应说。彼藏云。由见谛所灭心。为知与欲界相应法不。得知。由我由我所由断由常由无因由无事由非拨由胜由上由无等由极由净。由解脱由出离由不决由二心由疑由爱着由嗔恚由高慢由不了。由如此非理相应得知。若为结前此文句中应说前文句。谓有是处有是义等。由不说故。是故知非是此义四谛十六行相。为由名有十六。为由实物有十六。余师说。由实物唯有七。由名有十六。集灭道行相。各共显一物故。毗婆沙师说不尔。彼说云何。偈曰。实物有十六。释曰。此中随属缘故无常。逼恼为性故苦。对治我所执故空。对治我见故非我。同种子法道理故因。和合显现行故集。生所显故有相应能成故缘譬如土聚弋轮绳水等聚集故。能成瓶等果。此法亦尔。诸阴断绝故灭。能杀三火故静。无灾横故妙。出一切过失外故离。由行义故道。与理相应故如。正所成就故行。一向过度故出。复次一向不定故无常。负重故苦。由人所离故空。不如意作故非我来义故因。生起故集。行相应故有。为胜依故缘。无相应相应断故灭。三有为相所离故静真实善故妙。极至止息故离。能对治邪道故道。能对治不如故如。顺趣<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>土故行。一切有对治故出。如我等所信受今当说。生灭为法故无常。违意故苦我所离故空。自非我故非我。因集有缘。如经中说。是五取阴。依欲为根依欲为集。依欲为生。依欲为有。有名应在后说。此四于欲有何差别。爱欲有四种。于自体称我起爱欲。名自体无差别。爱欲。谓我应生名无差别后有爱欲。谓我应生如此如此。名有差别后有爱欲结生爱欲名受生爱欲。此中第一是苦初因似根。譬如于果种子故名因。第二由前所。引譬如果初出芽等故名集。第三是如此种类苦缘。譬如于果田水土等为缘。何以故。由随田等缘于果中香味力熟威德差别得成故名缘等。四即是生。从此生成故。譬如于果华终故名有于爱欲行经中有二五二四有四欲。生起事尽故灭。无苦故静。如经言。<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>如此诸行皆苦唯涅槃寂静。无上故妙。不更回转故离。由成路故道。如实生起故如。定净故行。如经偈言唯此道无余。能清净见故。永破有故出。复次为对治常乐我所我见行故。修无常苦空无我行相。为对治无因一因转变因知先因见行故。修因集有缘行相。为对治无解脱见行故。修灭行相为对治计解脱为苦见行故。修静行相。为对治于定起美妙见行故。修妙行相。为对治数数退故解脱非极定见行故。修离行相。为对治无道邪道有余道此道更回转见行故。修道如行出行相。行相是何法。偈曰。行相谓<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。释曰。若尔行相不成智慧。智慧与别智慧不相应故。若执如此则应道理。谓一切心及心法。于境界中取差别名行相。为但智慧能取境差别耶。非。云何。偈曰。共此缘境法。释曰。般若及一切有境界法。皆能取境差别。偈曰。所取别有法。释曰。若法是有一切必定取差别所取。若如此执。此义则成。智慧是行相。复由取差别能观有法。复为余法所观。所余有境界法。由取差别能观有法。复为余法所观。若无境界法。但是取差别所观。从此后是十种智。今当说善等差别。偈曰。初智三余善。释曰。是一初智谓世俗智最先所说故言初。此智有三性谓<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记。所余九智唯是善性。偈曰。此智通诸地。释曰。一切地者。谓欲界乃至有顶。偈曰。法智六地。释曰。法智于四定及未至中间定所得。偈曰。类。九地。释曰。类智于前六地及三无色所得。偈曰。复六智。释曰。苦集灭道尽无生此六智。若通论亦于九地所得。若别论法智所摄。则于六地得。若类智所摄。则于九地得。偈曰。四定他心智。释曰。他心智但于四定得。非余处。偈曰。欲色身依止。释曰。此他心智。于欲色界得修令现前。偈曰。法智依欲身。释曰。法智但依欲界身现前。非于色无色界身可令现前。偈曰。余智依三界。释曰。何者为余智。除他心智及法智。所余八智。分别诸智地及依止已。以<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>摄诸智今当说。偈曰。念处一灭智。释曰。是一灭智名法念处。偈曰。他心智三念。释曰。他心智若缘他心起。必定缘受想行等。偈曰。所余四念处。释曰。除灭智他心智。所余八智。通四念处摄。何智几智为所缘境。偈曰。法智境九智。释曰。法智缘九智为境。除类智。偈曰。类道智境九。释曰。类智亦缘九智为境。除法智。道智亦缘九智为境。除世俗智。偈曰。苦集智境二。释曰。世俗智若他心智是有流。此二智是苦集智境。偈曰。四智十。释曰。世俗智他心智尽智无生智此四智。缘十智为境。偈曰。非一。释曰。唯一灭智不缘智为境。缘无为法为境故。偈曰。应合法有十。释曰。为分别智境。于十种法中应合十智。何者十法。偈曰。三界无流法。无为二二种。释曰。有为法分为八。欲界色界无色界无流界。与心相应。与心不相应差别故。无为分为二。善无记差别故。是名十法。此云何合。何智缘几。法为境。此中世俗智。缘一切十法为境。法智缘五法为境。欲界及无流四法善无为法。类智缘七法为境。色界无色界及无流六法善无为法。苦智集智缘欲界色界无色界六法为境。灭智但缘善无为一法为境。道智缘无流二法为境。他心智缘三法为境。欲界色界及无流相应法。尽智无生智缘九法为境。除无记无为。由一智能知一切法不。不得。虽不得。偈曰。世智除类初。一智由无我。释曰。世俗智除自类初刹那。一切余法由无我相能解。谓一切法无我。是自体及自体共生诸法名自类。不能缘此法。有境界及境界有差别故。共一境界故。最近同时故。此智若是欲界智。是闻思二慧。若是色界智。但是闻慧非<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。修慧缘别地为境故。此义已度。是义今当说。何人与几智相应。若凡夫人。但与一世俗智相应。若离欲凡夫人。与他心智相应。复次若<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。偈曰。一智应有欲。于无流初念。释曰。若未离欲圣人。若法智忍初生刹那。与一世俗智相应。忍非智故。偈曰。第二三应。释曰。于苦法智刹那。与三智相应。世俗智法智苦智。偈曰。上。于四一一增。释曰。从第二刹那上第四刹那。应知一一智增。苦类智刹那苦类智增。集灭道法智刹那集灭道智增。是故于道法智与七智相应。若先离欲人。应知一切位中。他心智增相应。复次于何位中修习得智有几。偈曰。如生彼所修。忍智于见位。未来。释曰。于见道中若忍若智正生。此二同类。于未来被修。是彼行相有四亦被修。于见道中云何唯修同类智及行相。未通达余性故。偈曰。于中尔。世智于三类。释曰。于见道中世俗智是所修于苦集灭三类智时。非法智时不能对观一切谛故。故偈曰。名对观后智。释曰。是故此世俗智。说名对观后智。于一一谛对观最后时所修故。云何于道类智不修此智。此道先由世道。未曾对观故。对观不遍故。何以故。一切苦可得遍知。一切集可得遍除。一切灭可得圆证。道则不尔。不可圆修故。是故无对观后。于中不得修对观后智。若尔是时一切集未皆灭除。集类智亦无对观后。不应得修对观后智。是义不然。何以故。见集谛所应灭集。皆已灭尽故。道者是见谛所灭惑对治。不可一切皆修令尽。由性多故。是故道有别异。有余师说由见道伴类故。此执不可取。为证不成就故。对观后世俗智。有时可令现前不一向。无时可令现前。此云何。偈曰。此无生为法。释曰。此智于在观及出观位。一向不生为法。若入观不得生此智。以相违故。若出观亦不得生此智。以心粗故。若尔此云何可修。先未曾得今始得故。今时云何得。若不可令现前生。由至得故得。由得故得。此释所未曾闻。是故如此修必定不成。若执如此。修义得成。如宿旧师说。彼说云何。由出世法功力故。此对观后智则是所修。云何已修观后出观人。缘四谛为境。最胜世间智。今得现前。即彼是修如此修即是至得。若得能现前彼依止相续。何以故。若得性已性果必可得。毗婆沙师不乐受此义。复次此世俗智。为依几地修。随见道地。偈曰。自下地。释曰。随见道所依止地。或即依此地。或依此地之下地。修世俗智。若是道依止未至定地生。所修世俗智有二地。或依未至定地。或依欲界地。乃至若见道依止第四定地生。所修世俗智。或同或下。有此世俗智。几念处摄。偈曰。灭后。释曰。若观灭谛已后。所得世俗智。是最后念处摄。谓法念处由决判一世俗智。所余应知。皆是四念处摄。此观后世俗智。偈曰。共谛相。释曰。随正对观谛所得。此智行相则同此谛行相。由说与对观同行相。则已说此智与彼所缘同谛。由见道所得故。偈曰。用得。释曰。世俗。智有二种。一性法得。二修习得。由执此智共同类起。于欲界色界四阴<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>为自性。偈曰。十六六有欲。释曰。所修此言流。若未离欲人。于第十<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>类智刹那中。有二智现在修。有六智未来修。谓法智类智苦集灭道智。偈曰。离欲人有七。释曰。若人先已离欲。于道类智中。他心智是第七所修。偈曰。有欲修道中。从此上七修。释曰。从第十六刹那上。于修道中乃至未得离欲。于一切加行无间解脱增进道中修七智。谓法智类智苦集灭道智世俗智。若修世间道世俗世智。是现在修。若修出世道。四种法智中。随一是现在修。余六智是未来修。偈曰。七地胜通解。得不坏杂修。于无间道。释曰。七智所修此言流。七地者。四定三无色。放彼离欲故名为胜。于五通慧通达不坏性时。若有学人于杂<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>位并论。在一切无间道中。则修七智。如前所说。若修世俗道。现在修世俗智。若修出世道。四种类智及二种法智中。随一现在修。通达不坏性时。不修世俗智。非有顶对治故。此中应知。尽智为第七。偈曰。上。诸八解脱道。释曰。从离欲七地上离欲有顶。于诸八解脱道中修七智。谓法智类智苦集灭道智及他心智。不修世俗智。非有顶对治故。若现在修四种类智。及二种法智中。随修一智。偈曰。学练根解脱。六七智修余。释曰。若有学人。修练根时。于解脱道中。若有欲人。但修六智。谓法智类智苦集灭道智。若离欲人修七智。以他心智为第七。有余师说。世俗智于二位中所修。此二道于前加行中。得修世俗智。偈曰。无间道六修。释曰。若已离欲未离欲有学人。修练根无间道中。但修六智。如前。不得修世俗智。似见道故。不得修他心智。一切无间道中所遮故。云何遮非惑对治故。偈曰。有顶胜亦尔。释曰。若离欲有顶时。于诸无间道中如此修六智。偈曰。于尽智修九。释曰。离欲有顶时第九解脱道。即名尽智。此中修九智。除无生智。偈曰。得不坏修十。释曰。若人本以不坏法为性。此人于尽智位中。得修十智。得无生智故。偈曰。练不坏解脱。释曰。若人练根至不坏性。此人于最后解脱道中。亦得修十智。偈曰。所说余修八。释曰。何者为余。离欲欲界时。第九解脱道中。离欲七地五通慧。有学杂修定中。一切解脱道。为通达不坏性。诸八解脱道中。一切离欲人加行及增进道。于此一切道中得修未来八智。除尽智无生智。若有学判如此。若无学人五通慧杂修定。加行解脱道增进道中。或修九智。或修十智。五通慧杂修定无间道中。或修八智。或修九智。二通慧解脱道中。由无记故。无未来修。若凡夫人欲界及三定离欲。最后解脱道中。依定地修加行。三通慧解脱道无量等功德摄。于时世俗智未来修。他心智亦尔。除决择分能善根见道伴类故。于余处得未曾得道时。但世俗智未来修。复次于何道中所修智有几地。世俗智者。随道所依地。此地或由道初得。以此地为依止。未来修世俗智。无流道者。非一向随道所依地未来修。此云何。偈曰。为离此地欲。是得此下修。释曰。若为离欲此地修二种道。谓加行道等。随地由离欲初所得。或以此地为依止。或以下地为依止。一切无流智必定是所修。偈曰。有流于尽智。释曰。于尽智生时。一切地诸有流功德。凡是尽智所应得。皆是所修。谓不净观。阿那波那。念处。无量八解脱等。譬如同时绳断诸被绞人一时气通。复次此人已至心<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>王位。一切善根由至得故。并皆起迎。譬如有人得大王位。由贡献财物说国土迎。随有所得皆是所修不。于前若未得则是所修。何以故。偈曰。先曾得非修。释曰。若法退已还得。此非所修。已修所弃舍故。为但得为修为复有余。非唯得。何以故。修有四种。一得修。二习修。三对治修。四治净修。此中偈曰。得修及习修。是善有为修。对治治净修。有流诸法修。释曰。得修习修者。谓修一切有为善法。于未来有一修。于现在有二修。此二修依前二正勤成。未生令生。已生令长。对治修治净修者。谓修诸有流法。此二修依后二正勤成。未生令不生。已生令灭。若尔有流善法。则具四修。若无流法。但有前二修。若染污及无记法。但有后二修。西国阿毗达磨师说。有六种修。四修同前。五守修。六择修。守修是六根修。择修是身修。如经言。是六根已善调伏已善修。复次经言。于身中有如此物。谓发齿爪毛等。广说如经。如此于身简择故。自爱不起。罽宾国师说。此二修入对治修及治净修摄</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第二十卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第二十卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　分别慧品之二</p><p>　　说一切凡夫及<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。由通义于一切智修诸德已。十八不共得<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。谓力等。此法唯佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>一人。于尽智生时已至得得修。非于余人。今当说。何者。十八。偈曰。十八不共得。佛法。谓力等。释曰。十力四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>三念处大悲。是名十八。此中解十力有七义。何者为七。一<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。二分别。三独得。四平等。五作事。六次第。七差别。此义应知。此中偈曰。处非处十智。释曰。处非处中智力具十智。偈曰。业力有八智。释曰。于业及<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>中智力具八智。除灭智道智。偈曰。定根欲性力。九智遍行道。或十智。释曰。定<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>三摩提三摩跋提智力。转转根智力。种种欲智力。种种性智力。各九智力除灭智。遍行道智力。或十智。或九智。何以故。若执此道共果说名遍行道智力。则具十智。若执不共果。但有九智除灭智。偈曰。世智。于二。释曰。宿住念智力。及死生智力。但是世俗智。偈曰。六十灭。释曰。流尽智力。或六智为性。谓法智类智灭智尽智无生智世俗智。若执唯灭智名流尽智力。其义如此。若执流尽相续中智说名流尽智。力。则具十智。说十智力性已。彼地今当说。偈曰。宿住退生力。于定。释曰。宿住智力。及死生智力。依四定为地。偈曰。所余力。于诸地。释曰。所余八智力。一切地所摄。一切地有十。一谓欲界未至定中间定四色定四无色定。一切十智力。依止剡浮洲界人身起。离佛世尊不出世时。此十种智力。于余人不说名力。但于佛相续说名力。于他有对怨及碍故。不说名力。偈曰。云何。力由此无碍。释曰。唯佛灭一切流及无明习气等皆尽。于一切境界智生无碍是故于佛威力。于余人有碍。何以故。彼欲知此境。于境中智不生故。是故不应受力名。曾闻大德<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗弃舍求欲<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人。复次曾闻鹞所怖鸟。大德舍利弗。不能知其受生初及受生终。如此由智无对怨及碍故。佛世尊心力。如境界无有边际。若心力如此。身力云何。偈曰。身那罗延力。释曰。复次有余师说佛世尊身那罗延力。偈曰。或节节。释曰。有余师说。于一一节中具那罗延力。大德说。如<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>力无边际。<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>力亦尔。何以故。若不尔。此身则不堪受无边际智力。何以故。一切佛世尊独觉转轮王。节节中有龙结锁钩骨故。那罗延力其量云何。偈曰。百增。象等七种力。释曰。人道中百香象力敌一白象王力。百白象王力敌一摩诃诺那力。百摩诃诺那力敌一钵娑建提力。百钵娑建提力敌一婆郎伽力。百婆郎伽力敌一遮[少/(兔-、)]罗力。百遮[少/兔]罗力敌一那罗延力。如此百百增。香象白象。摩诃诺那。钵娑建提。婆郎伽。遮[少/兔]罗力。成那罗延力。有余师说。二倍此力名那罗延力。随转增为胜。何以故。<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>无量故。偈曰。此触入为性释曰。此身力应知。触入为自性。是四大胜类所造色。异七种触。余师说如此。偈曰。无畏有四种。释曰。依经文说。无畏有四种。偈曰。前二初十力。后二第二七。释曰。处非处智力。如第一无畏。如经言。我今已成三若三<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>。广说如经。应知是第一无畏。流尽智力。如第二无畏。如经言。我今诸流已尽。广说如经。应知是第二无畏。属业智力。如第三无畏。如经言。是我所说。于<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>众。与障碍相应法。广说如经。应知是第三无畏。遍行道智力。如第四无畏。如经言。是我所说。于弟子众。为出离<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>诸净品道。广说如经。应知是第四无畏。如此四法。应知是四无畏。无畏以无怖为性。云何说。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>为无畏。由此四法故。诸佛于大集中。无复疑心故。说彼名无畏。此无疑是智慧所成故。于智说无畏非智。此四显何义。显自利利他义。前二是自利。后二是利他。复次此四唯是利益他事。能除说者垢及所说垢故。说四无畏已。念处者。由弟子众差别故有三。如经说此念处。偈曰。三念念慧性。释曰。此三念处念慧为性。是时若弟子众。恭敬心听及<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。不恭敬心听及修行。复有具二。于中佛世尊无爱欲心。无嗔恚心。无杂污心。云何说此三。为佛不共得法。此三显如来习气灭尽。复次若自弟子众。于师教恭敬受行。不恭敬受行。及具二事中。喜忧等事。如于佛一向不生。于他不尔。此三不生。于佛是希有法。余人则无。故立此法为不共得。大悲今当说。偈曰。大悲世俗智。释曰。大悲以世俗智为性。若不尔则不应成缘一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>为境界。亦不得以三苦为行相。譬如声闻悲。云何名大悲。偈曰。由资粮行相。境平等最上。释曰。一由资粮大。能生长大福德智慧资粮故。二由行相大。以三苦为行相。缘众生起故。三由境界大。通缘<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>众生为境故。四由平等大。于一切众生平等起利益事故。五由最上大。无余悲上此故大悲与悲有何差别。偈曰。差别有八种。释曰。一性差别。由无嗔无痴为性故。二行相差别。由一苦三苦为行相故。三境界差别。由缘一界三界为境起故。四地差别。由依四定。第四定为地故。五相续差别由依声闻等相续。佛相续生故。六至得差别。由离欲欲界有顶所得故。七救济差别。由欲救济欲成救济故。八悲差别。由不同同悲故。已说诸佛由十八法不与他共。为与诸佛一向共不。与诸佛有共不共。此云何。偈曰。由资粮法身。及行他利益。一切佛平等。非寿姓量等。释曰。由三<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。一切诸佛一切平等。一因<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>平等。由昔行福德智慧资粮同圆满故。二果圆满平等。由所得法身同具足成就故。三利益他平等。由对背证转利益他事同究竟故。由此三义诸佛平等。不共者谓差别。由<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>种姓身量等。所成寿命有长短。前世后世生有异故。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>刹帝利种不同故。<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>波瞿多摩等姓不同故。身量光明有大小故。等言者。法住身坏不坏等故。如此由随时生。故有差别。若聪明人。思惟诸佛三种圆满胜德。于佛世尊所。必能得生最极爱念尊重之心。谓圆满因胜德。圆满果胜德。圆满恩胜德。此中圆满因胜德有四种。一一切福德智慧皆数习行。二长时行。三无间行。四尊重行。圆满果胜德有四种。一智胜德。二断胜德。三威力胜德。四色身胜德。圆满恩胜德有四种。谓永解脱三恶道生死恩德。或安立善道及三乘恩德。智胜德复有四种。一无师智。二一切智。三一切种智。四无功用智。断胜德亦有四种。一一切解脱障灭。二一切定障灭。三一切智障灭。四永时灭。威力胜德亦有四种。一于外尘化生转变愿成合散<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>威力。二于寿命舍取安自在威力。三于障及<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>最远最速行。于少令多入自在威力。四种种自性希有法圆德威力。威力胜德复有四种。一难化能化。二答难必能断疑。三立教决定出离。四能制伏恶魔外道等。色身胜德有四种。一大相胜德。二小相胜德。三力胜德。四金刚真实骨身胜德。诸佛胜德若。总说有如此等。若分别此胜德差别。则无有边。此胜德唯有诸佛如来。能具知具说。若诸佛如来。摄持寿命无数阿僧祇劫。说乃可尽。如此诸佛如来。是无边希有<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。智德断德恩德。大宝之池。凡夫众生。由自德贫乏。损害信乐。虽证闻如此等圆满胜德。于佛不起尊重心。于如来<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>亦尔。若聪明人闻此功德。起归依心彻于骨髓。于佛正法亦尔。此人由一向净<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。则已制伏不定报恶业聚已。受人天道吉祥乐报。最后趣般<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>为胜。是故诸佛如来出世。为一切众生无上<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。由能生不空可爱胜疾善后果故。云何得知。佛世尊自说偈以显此义偈曰</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第二十一卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第二十一卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　分别三摩跋提品第八</p><p>　　由依止<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。谓智慧种类分别说已。别性类功德今当分别说。是故最初依定应作分别说。由一切功德依止彼故。偈曰。四定有二种。释曰。若略说定有二种。由生得定修得定差别故。复次此定唯有四种。谓初定二定三定四定。此中受生中定。不应更说。于分别<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品中。偈曰。生得定已说。释曰。云何说。各各定三地。四定有八地。修得定必定应说。故说此言。偈曰。<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>善一类。释曰。若不分别。<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>善一类名定。是三摩提性故。偈曰。共伴类<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。释曰。若分别诸定。共随行相应法。应知五阴为性。何法名一类。谓一境等。若尔唯心一境成定。非别类心法成定。不说诸心是定。由彼法诸心成一类故。说彼法为定。彼法名一类。为不如此耶。一切心<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>刹那灭故。皆是一类。若汝言第二心从此境不散故。是一类。是义不然。于相应法中。定大地应无用。由此是三摩提。是故诸心共缘一境。汝何故不许此义。若言由定大地故诸心成一类。应立一切心皆成一类。此亦成失。是义不然。由此定势力弱故。经部师说。是心同一类故说名定。何以故。三摩提者。谓依心学。心清净为胜。经中说名四定。余师说。如此定者。名持诃那。持诃那是何义。由此得知得见故。名持诃那。何以故。若心得定。则能如实知见。此名以思量为义。思者即是<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。此悉檀作如此说。若尔一切三摩提。皆应名持诃那。由一类能令如实知见故。是义不然。于胜类中立彼名故。譬如作光名曰。于中与何胜法类相应。若定与分相应此定则与胜类相应。何以故。此共奢摩他毗钵舍那。双生起故。故说为现法安乐住。及迟速乐行。由彼最明了思量故。故彼是胜类。若善一类。名持诃那。有染污云何名持诃那。由邪思惟故。若尔则有大过之失。是义不然。于相似中。由但立名故。譬如坏种子。故佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。亦说恶法。为持诃那。复次是善一类。有何相名初定。乃至是善一类。有何相名第四定。偈曰。有观及喜乐。释曰。觉观喜乐相应善一类。说名初定。由说观觉。即被说觉观。如火及烟。相应行故。有不相离相离故。无有观有喜乐与觉相离。所余三定偈曰。前前分所离。释曰。善一类言流。觉观所离。但有喜乐。是第二定觉观喜所离但有乐。是第三定。觉观喜乐所离但有舍。是第四定。如说四定。偈曰。无色尔。释曰。无色有几种。义与定同。彼亦有二种。由修得生得故。亦有四种。由减损想故。是彼生得。于前已说。谓<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>无处。由生有四种聚同分及命。依此心相续。修得无色定。若不分别。但以善一类为性。由此义无色定与四定同。偈曰。四阴。释曰。若分别诸定。共随行相应法。应知四阴为性。无随行色故。偈曰。寂离下地生。释曰。空遍入从寂离第四定生。识遍入从寂离空遍入生。无所有遍入。从寂离识遍入生。非想非非想遍入。从寂离无所有遍入生。无色定由此故成四。何法名寂离。由此道彼<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>他地故。说此道名寂离。彼定至得离欲故。是四无色定。偈曰。制伏色想名。共三种近分。释曰。空遍入近分定。缘第四定为境界故。未得制伏色想名。何以故。于中制伏色想未竟故。未得灭离。是前所说。无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>但有四阴。此言不成就。谓于无色界无色。若无色界有色。云何说为无色界。由色细故。譬如阿宾伽罗。执彼所有色。其相云何。若唯有身口护色。身口既无。云何得有身口护色若无四大。说有四大所造色。无如此义。若汝言如无流护。是义不然。由有流四大有故。于说彼三摩跋提。中乃至有拨言。谓无色等想。若彼有身必定有色根。云何许彼有细色。若汝执由身量极细故说无色。于不可见色水虫。应成无色。若汝执彼色极净故说无色。于中阴及色界。亦应立为无色。若汝执由无胜。彼净色故说无色。则但有顶成无色。所余应非。何以故。如修三摩跋提。三摩跋提生差别亦尔。彼定生色。由非下地根所取故。于彼有何差别。若汝言二界名随义立。第<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>名非随义立。此中以何道理为证。由说<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>暖触相应故。如二芦束互相依持。名色及识。由说互相依故。于十二缘生中。说依识名色生。依名色识生。复有别证。离色乃至离行。由拨识去来故。是故于无色界。有色义成。是义不然。应更思量故。此义必定应共思量。谓说寿命暖触相应义。此言为依欲界寿命说。为依一切寿命说。名色及识互相依言。为依欲界色界识说。为依一切识说。说名色依识生言。说识依名色生言。此中为一切识以名色为依。一切名色以识为依。为不皆尔。此中说离色等。拨识去来言。为离一切色等。拨识去来义。为随离一。若汝言。由佛不分别故。不可自分别思量。是义不然。有大过之失故。是外暖触不应成与寿<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>离。复次外色应依止名。由不分别说故。由佛说四识住及四食。于色无色界应有段食及色识住。若汝言。说过用段食诸天。及说喜食诸天。由此言故。无大过之失。于无色亦应尔。不应立有色。由佛说无色是一切色出离故。如经言。是寂静解脱。过一切色是无色。复有说有<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>无色。复有说由过一切色想及有碍想故。知无色界中无色。何以故。若彼实有色。彼必定应生想分别自色。若汝执。观下地粗色故说无色。是义不然。何以故。于段食中。此义应同。四定出离下地故。于中应立无色。云何不说彼是受等出离。由是下地受等出离故。彼已过一切种色类。不过一切种受等类。是故说彼但是色出离非受等。由有不说出离有者。由有不得出离有故。不能出离一切有。及永出离有故。复次佛世尊。于色定中。说言于色定中。若有色类乃至识类。于无色定中。说言于无色定中。若有受类乃至识类。于无色界。若有色类。云何不说若有色类言耶。是故偈曰。无色定无色。释曰。由此二证应知。于无色界必定无色。说有色者。此是邪言。与理相违故。若尔于彼中<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>色相续已断绝。后从彼退时。色云何更生。偈曰。更生色从心。释曰。色从心更生。昔时色报因所熏习故。此心有功能生于今色。若不依止色。心云何得生起。云何不得生起。此中非所曾见故。若尔离段食。于色界中不应得生起。何以故。此中非所曾见故。于前已说。此依止能令彼心相续生起。说此义已。复次此义今当说。为空无边入等必定以空等为境界故。说彼以此名。为不尔非。此云何前三者。偈曰。空无边及识。无边无所有。由加行立名。释曰。空无边识无边无所有。彼作如此思惟。得修观行。因此加行。是故彼如次第得此三名。偈曰。昧故非想非。释曰。由想软昧故。说名非想非非想。何以故。彼想不明了。非全无想。若彼于中修如此观行。想即是病。想即是痈。想即是刺。无想即是痴闇。是寂静。是美妙。谓非想非非想入。虽然不由此加行立名。云何彼执如此观行。决定应。释曰。相微细故。此义于前已说。偈曰。如此根本定。八物释曰。根本定若约实法。唯有八物。谓四色定四无色定。此中偈曰。有三种。七。释曰。除有顶所余七定。各有三种。何者为三。偈曰。有啖清净。无流。释曰。此七定有与啖味相应。有清净有无流。偈曰。第八二。释曰。第八是有顶。此定有二种。有与啖味相应。有清净无无流。复次此中偈曰。啖味相应定。有爱。释曰。啖味谓贪爱味。是定所有功德。缘此起爱欲心。爱欲即是能啖故。说贪爱所染污定。名与啖味相应。偈曰。世间净。清净。释曰。世间定法若善为性。说名清净。与无贪等白净<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>应故。复次此中何定是啖味相应所啖。偈曰。是堪啖。释曰。是所堪啖即是清净三摩跋提法。此法是彼所啖。必从一刹那等已灭。若是所啖则已出。彼能啖即是所修观偈曰。出世定无流。释曰。出世三摩跋提法。是名无流。此三摩跋提法中。唯四持诃那有分。四无色定无分。此中偈曰。于初有五分。释曰。初持诃那中有五分。五者偈曰。觉观喜乐住。释曰。觉观喜乐善一类。此五于定能引治安。依体故说为五分。此五分中第五彼说亦定亦分。所余但分非定。若实说如四分军。五分持诃那亦尔。偈曰。熹等及内净。于第二四分。释曰。于第二持诃那有四分。一内澄净。二熹。三乐。四善一类。此四应知如前。偈曰。第三有五分。舍念慧乐住。释曰。于第三持诃那有五分。一舍二念三慧四乐五住住即是善一类。何以故。住是三摩提别名故。如经言。何者为三摩提。是心住于正境于正位由此经故。知住是三摩提别名。偈曰。最后有四分。中受舍念住。释曰。第四持诃那是最后。于中有四分。谓非苦非乐受。舍清净念清净善一类。若依如此文。定分有十八。初定三定各有五分。二定四定各有四分故。如此数由名立。若由实物。偈曰。实物有十一。释曰。初定分有五。于第二内澄净增。于第三舍念慧乐增。于第四非苦非乐受增。由此义故有十一。是故说。若分在于初定。于第二为是分不。有四句。第一句是觉观。第二句是内澄净。第三句是喜乐善一类。第四句除前所说是余法。如此一切定分。皆应以四句更互相摄。云何于第三定中。说乐为别物。由此乐于第三定成受乐。于前二定中。偈曰。轻安乐前二。释曰。于第一第二定。是轻安说名乐。于前二轻安乐。于第三是受乐。此义云何成。前二持诃那。与乐根不相应故。何以故。于前二定中所说乐。不应成身乐。入观人五识不有故。不可立为心乐。已说为喜故。喜者谓心踊跃。喜乐二种。一时俱生。无如此义。喜乐或于定中递互生起。此不可执。由说定有五分故。有余师说。于前三定中。心地乐根。皆悉不有。但安立身乐根。以为彼分。若尔经中云何说。如此经云。何者为乐根。缘能起乐触。身心受乐。所爱胜受类。说此名乐根。此文不知何人所增加。何以故。于一切部中。唯有身乐文故。文言修观人由身正受乐。此义由自名所说故。若汝执由心身受者。若作此说。得何功德。于第四定轻安最极。不说为乐故。若汝言。是轻安随顺乐受故。亦得说名乐。是义不然。第三定中何故不说轻安名乐。若汝言。由为舍所损害故。是义不然。由舍彼增进故。品类胜前二故。复次由经轻安与乐有差别如经言。是时圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。从轻安生喜。由身证已生起。此已于其中住。于此经中由别说轻安及乐。是故知轻安非乐。若汝言。正入观人身识云何生。此不相违。何以故。有风从三摩提生。名轻安与乐受相符。依内起遍满身故。若汝言。由外散乱即便退定。是义不然。从定生依内身起。由此身乐与定相随故。无有退义。若汝言。身识起时。观行人即出定。是义不然。由前言所成故若汝言。由欲界所生身根。色界相应触识不应得生。是义不然。自轻安识生故。若尔身根所领触及身识。应成无流。勿有一分有流一分无流。由说身轻安为觉分。是义可然。若汝言。由随顺觉分故。说为觉分。无流义亦应尔。若汝言。此执与经相违。经云。何者名有流法。一切眼根乃至触尘。是故相违。是义不然。由依别触身识别意说故。若汝言。于无流法。无一分有流一分无流。是义不然。不俱时起故。于中复有何失。若汝言。乐及喜不并起故。初定应无五分。是义不然。依应有义说故。譬如说觉观。若汝言。此义未成。由譬不成就故。是义不然。由粗细二心一时相违故。由汝不说此义中过失故。是故于初定五分中。由减二三四分故。安立第二定等。由此义故。于初定说有五分。为欲减前安立后定故。是故不减想等。若不尔。云何唯五为分。若汝言。由有益故立别分。是义不然。觉观二法。于念慧中最有益故。有诸部师。作如此诤论。宿旧诸师。不说如此不随。可知所有法立为定分。是故彼执应须思量。何法名内澄净。觉观散动灭离故。相续清净流。说名内澄净。何以故。如江有浪。由觉观散动故。此相续生起。不得清净。若尔此非别物。云何由此实物定分有十一。是故偈曰。信根内净。释曰。有别物谓信根。此人由得第二定地故。于出离寂静地中。生起决信故。此中说信根。为内澄净。有余师说。觉观三摩提内澄净。悉非别物。若彼非实别物。云何成心法。心位差别。有时说为心法。由心成故。阿毗达磨悉檀。不说如此。是汝所说。喜者是适心。此义云何可知。若不尔。欲以何法为别。如别部所许。别部云何许。彼执有别心法名喜适心。是三定中乐。若非于三定中乐应成适心。偈曰。喜。适心由二证。释曰。佛世尊于毗波利多经中说。第三定已于中先生适心。根灭尽无余。于第四定中。乐根灭尽无余。佛复于余经中说。由乐根苦根灭故。于前忧根适心根灭故。广说如经。由此二证。于第三定中。必定无有适心根。是故喜根即是适心根非乐。如清净定中所说分。于染污定为有不。不有何分于彼不有。偈曰。染污无喜乐。内澄净念慧。及舍念清净。释曰。若定有染污。初定无寂离生喜乐。不能寂离惑故。第二定无内澄净。由惑所染浊故。第三定无念慧。由染污乐所乱故。第四定无舍清净念。清净由与惑相应故。有余师说。唯如此。偈曰。余说无轻舍释曰。有余师说。初定二定。若有染污则无轻安。第三第四定。若有染污则无舍。由此二法是善大地故。佛世尊说。三定有动变。由有过失故。偈曰。离八过失故。说第四不动。释曰何者为八过失。偈曰。觉观及二息。余乐等四种。释曰。觉观乐苦喜忧出息入息。此八是诸定过失。此八过失中随一过失。于第四定中无。是故唯说第四定为不动。觉观喜乐等所不能动变故。故经中说。第四定为不动。譬如内密室无风灯光。余师说如此。于前二定。说有适心受。由与喜相应故。第三乐第四舍。如修观定中受。于生得定中受为如此不。非此云何。偈曰。喜受乐舍受。舍受及喜受。乐舍及舍受。生得定诸受。释曰。于初生得定中有三受。一乐受与三识俱起。二喜受以<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>为地。三舍受与四识相应起。于第二生得定中有二受。谓喜及舍。此二以意识为地。无乐余识不有故。于第三生得定中有二受。谓乐舍。此二以意识为地。于第四生得定中。唯有舍受。由如此义。生得定受。与修得定受不同。于第二定等。若无三识及觉。彼众生云何得见闻触。彼复云何得起有教身口业。不说于彼受生众生眼识等不有。虽有。不属二定等地。此云何偈曰。眼耳身三识。身口业缘起。二等初定得。释曰。眼等三识。及能起有教业识。于第二定等虽不有。彼能令现前。譬如变化心。彼由此识能见闻触。及能起有教业。偈曰。此无染无记。释曰。此四识无染污亦无记。第二定等众生所引四识令现前。此四识应知以初定为地。非有染污。由彼离欲下地故。非善下劣品故。说定事已。复次清净等四色定。及四无色定至得云何。偈曰。不得得清净。由离欲及生。释曰。若人不至得彼。此人能得清净四色定及四无色定。或由离欲下地。或由受生下地。除有顶。何以故。清净有顶。不由受生得故。不得者此言云何。若人未曾得。及舍至得。由加行能得清净。或得决择分清净。由退故得退分定。是故毗婆沙中说此言。为有如此不。或由离欲至得清净定。或由离欲弃舍清净定。由退堕及受生亦尔。说有约退堕分初定。论此六义。何以故。由离欲得此故。由离欲大梵处弃舍此故。由退堕大梵处离欲得此故。由退堕离欲欲界弃舍此故。由舍上大梵处受生得此故。由从此退堕受生欲界弃舍此故。偈曰。无流由离欲。释曰。不得得此言流。若人已曾得。由尽智更得无学无流。若由修练根道。或得有学。或得无学。为不如此耶。由入正定聚。初得无流。次第修观人。不必定由未曾得得此无流定。如必定应得。是今所说。偈曰。染污退生得。释曰。不得得此言流。由退得者。若人退此离欲。更还得此。由受生得者。从上地更生下地。复次从何定法。后几种定次第得生。从无流初定。后有六定。无间得生。于自地清净定无流定为二。于第二第三定。亦各有二。从无所有入后次第生有七。于自地清净无流为二。识无边入。空无边入。亦各有二。于有顶但有清净无无流。从第二定。后次第生有八。于自地清净无流为二。于第三第四及初定。亦各有二。从识无边入后次第生有九。自地有二。空无边入及第四定有四。无所有入及有顶有三。由如此方。所余色无色定次第十十定法。应如此知。此中是略摄。偈曰。从第三上下无流后善生。释曰。由说善性清净及无流皆彼摄。同是善性故。无流定法后次第。或依自地二种定法生。谓清净无流。或上地下地。乃至第三亦尔。何以故。超修观人过第三处求超不得成。云何如此。由过远故。从类智次第能修无色定观。从法智次第不得如此。以下地依止为境界故。如说从无流次第生诸定。所余应知亦尔。偈曰。从净生亦尔。长染污自地。释曰。此中生自地染污定长于前。此从清净定后次第得生。所余诸义如无流。何以故。无流定后。染污不得生故。偈曰。从污自地净。染。释曰。从染污定后次第。于自地清净及染污定得生。偈曰。一下地净。释曰。若人为惑所逼下地若清净。于中亦生尊重。若人已了别此定。谓此定染污行于下地定。则从善行于善。不从染污。若不分别。云何得行于下地清净定。由前引心力。何以故。此人于前。有如此欲乐。谓宁得下地清净。不用上地染污。是先意欲众生相续亦能随逐。譬如人先发愿方眠如所要期时即觉。若无流从染污后。一切种次第不得生。此言约修观时说。谓从清净定及染污定。后次第自地染污定生。非于余地。偈曰。退时从净染。一切。释曰。死堕时从生得清净定。后次第一切地染污定生。偈曰。染非上释曰。从染污四色定四无色定。后死堕时。次第自地下地染污定生。非上地。复次非从一切清净定后无流定生。若尔此义云何。偈曰。清净定有四。退分等。释曰。退堕分。安住分。增进分。决择分。清净定有此四种。有顶有三种。除决择分故。此四其相云何。偈曰。次第。或生自上地。无流随得故。释曰。若此定功德随顺<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>生。名退堕分。若此定功德随顺自地名安住分。若此定功德随顺上地名增进分。若此定功德随顺无流名决择分。是故说此定名无流。此四种定中几定从几定后次第生。偈曰。二三三及一。从退等次第。释曰。退堕分定后。次第二定得生。谓退堕分。及安住分。安住分定后。次第三定得生。除决择分。增进分定。后次第三定得生。除退堕分。所余次第得生。决择分定后。次第一定得生。谓决择分定。修超定观。云何得成。偈曰。去来于二类。八地密超一。修超诸定观。行非等分三。释曰。去者谓次第修观。来者谓逆修观。于二类者。谓有流无流。八地者。谓四色定四无色定。密者谓上下次第。超一者谓过一一地。先于有流八地。或顺或逆修观。修观成熟已。次于七无流地修观亦尔。修观成熟已。后时为成就。于修<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。从有流初定。超入有流第三定。从有流第三定。超入空无边入。从空无边入。超入无所有入。次更如此逆超。若此修已成熟。后于无流定修顺逆超一亦尔。应如此次第修顺逆观为超定加行。是时若从有流初定。能入无流第三定。从无流第三定。能入有流空无边入。从有流空无边入。能入无流无所有入。次修逆超亦如此。是时非等分第三定中去来成故。超修定得成。由最远故。第四不可超修。此修于三洲中。是非时解脱阿罗汉。所修得惑灭尽故。于定有自在故。见至<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。彼根虽利。于定若有自在。彼惑未尽故不得修。时解脱阿罗汉。惑虽已尽。于定不得自在。亦不得修。由何依止。有几色定无色定可令现前。偈曰。自下地依止色无色。释曰有顶定于有顶处可修令现前。于下地乃至欲界皆能修令现前。如判有顶。所余诸定。于自地及下地。皆得修令现前。云何如此。若<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>于上地。不能令下地诸定现前。何以故。于此人偈曰。非下。释曰。生上地人。下地定于彼无毫厘用。由下劣被轻故。说通义已。此中更说别义。偈曰。圣现无所有。入于有顶流尽。释曰。若圣人已生有顶。由现前修无流无所有入。至得流尽。云何已生有顶。能现前修无流无所有入。于自地无故。此熟所悉故。得现前修。复次色定。无色定所缘何境。偈曰。有爱自有境。释曰。若定与啖味相应。说名有爱。缘自地有起。有言者显取有流境。不能缘下地。已离欲故。不能缘上地。由诸地贪爱各所隔碍故。不能缘无流为境。应成清净故。偈曰。善定遍有境。释曰。若定以善为性。谓清净及无流。此定以一切法为境。彼境实有物。谓有为无为。偈曰。本善色无色。非有流下境。释曰。根本清净色定。及无色定。下地有流法。非彼境界。缘自地及上地为境界故。若无流为境界。一切类智种类。是彼境界。非法智种类。非下地灭。若近分定及无间道。以下地为境界。此三种色定无色定中。何定能灭惑。偈曰。由无流惑灭。释曰。惑灭不由清净定。何况由染污定。由此下界惑不得灭。于下未离欲故。自不能对治自故。是故不能灭自地惑。由最胜故。不能灭上地惑。但由无流定得灭。复次偈曰。及诸定近分。释曰。由色无色近分清净定。诸惑亦得灭是下地对治故。此近分有几种。偈曰。彼定近分八。释曰。随一一定。近分亦尔。依近分得入根本故。近分为如根本有三种不。近分受为如根本受不。非。偈曰。清净非苦乐。释曰。彼近分定。但是清净一类。与舍受相应。由功用所引故。未离下地厌怖故。离欲为果故。是故唯舍受无啖味。偈曰。初圣。释曰。最初近分定。名非至定。此有二种。有清净有无流。若由近分心结生。即有染污。若入观必无染污。由前已遮故。偈曰。余说三。释曰。有余师说。非至近分定。亦与啖味相应。此中有说。名近分定。有说。名中间定。此二名为一义。为有别义。有别义。何以故。近分者是离欲道。偈曰。无觉中间定。释曰。此定与觉不相应。说名中间定。与二定异故。由胜初定故。于初定中不立。于第二定等中。亦非所立。由无胜类故。复次此中间定。有几种有几受。偈曰。三种无苦乐。释曰。此定或与啖味相应。或清净或无流。是无苦无乐受。与舍根相应故。不与喜根相应。大功用所引故。故说为苦迟速行。此中间定果差别云何。偈曰。大梵王为果。释曰。若人修习上品中间定。受大梵王报。复次摄一切诸定。于经中说有三定。一有觉有观三摩提。二无觉有观三摩提。三无觉无观三摩提。此中中间定。即是无觉有观三摩提。由此经第二言所证。但遮觉故从此定。偈曰。有觉观此下。释曰。从此向下所有诸定。悉名有觉有观。谓初定及依初定余定。偈曰。此上定无二。释曰。于彼中无二。谓过中间定。向上余定。无觉观二。从第二定近分。乃至有顶皆无二。复次经中说。三摩提有三种。谓空定。无愿定。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>定。此中偈曰。无相应静相。释曰。与灭谛行相相应定。说名无相定。此定有四行相。何以故。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>者由离十相。说名无相。此定以涅槃为境。故名无相。十相者。谓五尘男女三有为相。是名十相。偈曰。空定<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>空。释曰。与无我空二行相相应定。说名空定。此定有二行相。偈曰。无愿定所余。谛相相应故。释曰。与所余诸谛行相相应定。说名无愿定。此定有十行相。何以故。于<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦及彼因生厌背故。于道由栰喻义。必定应弃舍。观行人于彼生过背意故。彼皆不可愿。以彼为境。故名无愿。于无我空中无厌背义。由与涅槃相似故。此三定有二。偈曰。彼清净无垢。释曰。此三定以清净及无流为种类。属世出世故。若世间定。依十一地成。若出世定。随无流道地。偈曰。净三解脱门。释曰。此三定若无流。说名三解脱门。谓空解脱门。无愿解脱门。无相解脱门。由彼是解脱门故。由别义于彼更说别名。偈曰。空空等名定。复有三别定。释曰。有空空定。有无愿无愿定。有无相无相定。以空定等为境界故。彼名空空定等。于中偈曰。二定缘无学。由空无常相。释曰。有二别定。缘无学诸定为境。空空定缘无学空定为境。由空行相故。无愿无愿定。缘无学无愿定为境。由无常行相故。不由苦及因等行相。无流法不以彼为相故。不由道谛行相彼所应厌背故。偈曰。无相无相定。静相非择灭。释曰。无相无相定。缘无学无相定非择灭为境。由寂静行相故。不由灭。妙离行相。何以故。与无常灭同故。无记性故。非永出离故。此三别定一向。偈曰。有流。释曰。由背舍圣道故。彼是有流。若无流则不尔。此定是何道所得。偈曰。人。释曰。于人道中非于天道。于何人相续中生。偈曰。不坏。释曰。唯不坏相阿罗汉。能得此定。由事究竟故。非余阿罗汉。此定依几地生。偈曰。七近分所离。释曰。除七近分定。于十一地。谓欲界。非至定。中间定。四色定。四无色定。复有经说有四三摩提修。经云。有三摩提修。若修若事若习成。为得现世安乐住。广说如经。此中偈曰有别修四定。净初为现乐。释曰。若初定是善性类。或清净或无流。此三摩提。必定能得现世安乐住。初定既尔。余定应知亦然。不必定得未来安乐住。或退堕。或生上地。或入涅槃。于中未来安乐住。或不成就故。偈曰。为知见眼通。释曰。第二三摩提修。为得知见三摩提修。谓天眼通慧修。偈曰。为别慧行生。释曰。第三三摩提修。为得差别慧三摩提修。一切胜德。皆从加行生。谓三界无流诸德。若定能得此德。说此定修。为差别慧三摩提修。偈曰。金刚譬后定。能灭有流修。释曰。于第四定有三摩提。名金刚譬修。此定能得一切流尽。彼言佛世尊说。四三摩提修。依佛自<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>说。此义云何可知。由依第四定。约时分别故。说诸三摩提已。一切德依止三摩提成。说时已至。是故今说。偈曰。无量定有四。释曰。四无量定。谓慈悲喜舍无量。以无量众生为境界故。感无量<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>故。云何立四。偈曰。由嗔等对治。释曰。多行杀害嗔逼恼嗔嫉妒嗔爱起憎嗔。众生为灭此行。是故次第应修此四无量定。不净观及舍无量定。若同对治欲界爱欲。有何差别。毗婆沙师说。<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>对治是不净观。淫欲对治是舍无量观。若执如此则与理相应。淫欲对治是不净观。能除色形貌触威仪欲故。母父及儿亲等欲对治是舍。此四定性类云何。偈曰。慈无嗔及悲。释曰。慈以无嗔善根为性。悲亦如此。偈曰。喜定谓适心。释曰。于他欢适事。心随彼欢适。说名为喜。偈曰。舍无贪。释曰。舍以无贪善根为性。若尔云何对治嗔。由嗔是贪爱所引故。若尔此定应以二善根为性。此义应理。此慈等无量定。行相云何。偈曰。行相。有乐及有苦。得喜及众生。释曰。若众生安乐。是慈定境界。于彼起行相思惟。谓众生安乐。由此得修慈无量观。若众生有苦。是悲定境界。于彼起行相思惟。谓众生有苦。由此得修悲无量观。若众生得喜。是喜定境界。于彼起行相思惟。谓众生得喜。由此得修喜无量观。若不分别。但众生众生。是舍定境界。于彼起行相思惟。谓众生众生。由此得修舍无量观。由是中心故。观若彼无乐于彼乐观乐。云何此观。不成颠倒。由愿得意故。非是颠倒。复由意无颠倒故。复由是愿乐想定故。复次若如此颠倒。有何过失。若汝言。非善性为过失。是义不然。彼以善根为性故。又能对治嗔等恶法故。说彼行相已。若彼缘众生为境。缘何众生为境。偈曰。彼欲众生境。释曰。欲界众生。是彼所缘境。能对治缘彼为境嗔恚等故。若尔经中所说。约一方起慈等心。此义云何。此言由显器。在器中亦是所显。此四无量依几地生。偈曰。于二定喜。释曰。于前二定。修喜无量观。适心为性故。偈曰。余六地。释曰。所余三无量观。于六地中修。谓非至定中间定及四定。偈曰。余说五。释曰。有余师说。除非至定。但于五地修。复有余师说于十地。谓欲界及四近分。由摄不定加行根本故。是前所说。彼能对治嗔恚等。为由彼惑得灭不。偈曰。由彼惑不灭。释曰。根本定为地故。假愿思惟为体故。缘众生为境故。由修彼加行。能制伏嗔恚等故。说彼是嗔恚等对治。已灭能令远故。有慈等观。以欲界及非至定为地。有以根本定为地。由前制伏诸惑已。后由灭道灭除诸惑。次于离欲位中。由得根本无量定故。若得定强力缘时。非复彼所能逼故。初学人云何修慈无量观。如计自身所得胜乐。或见闻他得胜乐。谓佛菩萨独觉声闻。于众生起如此至得胜乐愿乐想。谓愿诸众生。得如此乐。若不能等发此心。由惑最强盛故。先于亲属。分为三品。于最上品亲。起得胜乐愿想。于彼若已成。次于中及下亲。观行亦尔。于三品若得平等慈观已。次于中人。观行应知。皆如前说。次于怨人。复分为三品。于最下怨。愿彼得胜乐次于中怨及上怨亦尔。于最上怨。愿得胜乐想。若起不更退失。如于最上品亲不异。次第于家聚落方土中。起得胜乐愿想。乃至缘一方及遍一切世界。起愿得胜乐想。由慈无量心。周普无余。若人于一切众生。恒乐取德。此人必定速得成就慈观。何以故。于断善根人。若取彼德亦可得。于犀角喻独觉。若取彼过亦可得。由能显昔福非福果故。于悲及喜。修观行亦尔。观彼众生没多灾横流内。愿彼解脱众苦。愿彼众生恒得<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。若人作如此愿想。得入悲喜定观。舍观从中境成。但以众生众生为行相故。四无量定。是何道能修。偈曰。人道生。释曰。若修彼必定在于人道。非于余道。若人与一无量定相应。必定与一切相应不。不定。与一切相应此何为。偈曰。三应定。释曰。若人生第三第四定。与喜不相应。若人得无量定。恒与三相应。偈曰。解脱八。释曰。于内有色想于外观色。是第一解脱。于内无色想于外观色。是第二解脱。净解脱由身证已于修中住。是第三解脱。无色定为四解脱。灭受想定为第八解脱。于彼偈曰。前二。不净观。释曰。前二解脱。不净观为体性。以黑烂等想为行相故。是故于此二。应知如不净观<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>行义。此前二偈曰。二定。释曰。于前二定中。此二解脱是所修。非于余地。次第是欲界及初定。地色欲对治故。偈曰。三后定无贪。释曰。第三净解脱。但于第四定修。此亦以无贪善根为体性。非不净观为体性。由净想为行相故。若摄彼共伴类。五阴为体性。无色解脱者。偈曰。净无色定地释曰。若善若定地四无色观。是四无色解脱。非不定地。譬如于死有中。余部师说。无色定有时非定。如目干连所修。复次无色近分定解脱道。彼亦得解脱名。若是善及定地。非无间道缘下地为境故。何以故。背舍义即是解脱。偈曰。灭心定解脱。释曰。灭受想定。即是第八解脱。此定于前已说。由背受想故名解脱。复由背舍一切有为法故。复有余师说。由此八能解脱一切定障故。若人修灭心定。偈曰。最后细后成。释曰。有顶者由想最细故。此定更修令最细。方得入灭心定。若人已入灭心定。云何得出。偈曰。自地净下圣。心从彼出观释曰。或由于有顶清净心从彼得出。或由无所有入为地。清净心及无流心。从彼得出。如此依有流心。入<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>定。出心通有流无流。于此八解脱中。偈曰。欲界可见境。前三。释曰。于前三解脱。通以欲界色入为境。或可憎或可爱如次第。偈曰。四无色。是类智种类。自上地谛境。释曰。无色解脱缘上地及自地苦。苦集苦灭为境。一切类智种类道。及非择灭<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>为境。云何于第三定不立解脱。于第二定地。色欲不有故。复于清凉乐有动故。云何彼修净解脱观为安乐。先不净观。损羸自相续故。复次为欲观察自能不能故。谓于前二解脱。为成不成。若尔则知彼二成。若更由净相观净境。先惑不起。何以故。修观人由二种因故。修解脱等观。一为令诸惑极远相离。二为于定中得自在。为能引取无诤等诸德。及能引取圣通慧。此通慧能变异物类。成就所愿。延促寿等事。云何于第三第八说身证。于余不说。由二胜故。复由在界地穷际故。偈曰。制入有八种。释曰。于内有色相于外观色小量。或好或恶。制修此色。我见我知。作如此想是第一制入。无量亦尔。于内无色想于外观色。此二如前二合此成四通。无内色想观青黄赤白色。我见我知。作如此想合此成八。偈曰。二如初解脱。释曰。如初解脱。应知二制入亦尔。偈曰。后二如第二。释曰。如第二解脱。应知第三第四制入亦尔。偈曰。余如净解脱。释曰。如净解脱。应知后四制入亦尔。若尔此彼有何异。由前八但背舍。由后八制修。境界令随自意乐显现。及令惑不起。偈曰。十遍入。释曰。能普覆起一类。无间隙故名无边。何法为无边。谓地水火风。青黄赤白。此色相普覆。空无边入。识无边入。此二亦普覆。于中偈曰。无贪。八。释曰。前八以无贪为性。偈曰。后定。释曰。第四定是彼所依地。偈曰。彼境。欲。释曰。欲界色入是彼境。有余师说。风无边入触为境界。复有余师说。前四触为境界。后四色为境界。偈曰。二净无色。释曰。最后二无边入。以清净无色定为性。偈曰。自地四阴境。释曰。自地四阴。是后二无边入境界。八制入是入解脱法门。十无边入是入制入法门。前前于后后胜故。此解脱等。以一切凡夫圣人相续为依止。唯除灭心解脱。偈曰。灭心定已说。释曰。灭心定解脱。于前已说。由一切义差别。偈曰。余离欲行得。释曰。异灭心定。所余解脱等。或离欲所得。或加行所得。由前悉前未悉故。偈曰三界依无色。余人道修得。释曰。无色解脱。无色无边入。此法以三界身为依止。三界人所修得故。所余诸解脱。及诸制入无边入。依止人道相续得成。由正教力缘所生故。云何于色无色界。修得色定无色定差别。由三种<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。四持诃那无色三摩跋提得生。由因业法尔力故。此中偈曰。因业力二界。生色无色定。释曰。于二界。谓色无色界。生无色界定。或由因力。谓近修及数修。或由业力。谓上界分后报。业果报欲至故。何以故。若人于下界不生欲。于上界不能得生。偈曰。于色界。色定由二法尔得。释曰。于色界中生差别定必由二力。谓因力业力。或由法尔力。世界欲坏时。一切众生。是时来下地。生四色定。是时善法。最成就丰饶起故。是佛世尊<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。应更几时住。于中如此等诸法品类。明了可知可见。偈曰。世尊正法二。教修得为体。释曰。此中正教者。即是诸阿含。谓修多罗。毗那耶。阿毗达磨。正修得者。谓阿地伽摩。此是三乘人所修。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>助法。及三乘果。如此名二种正法。此中有几人。偈曰。于中有能持。能说及能行。释曰。于阿含有二人。一能正持。二能正说。于阿地伽摩但有一人。谓能正修得。随此三人相传住时。正法亦随此时得住。何以故。有二因缘。能令正法久住。谓正说正受。有余师说。佛般涅槃后一千年。正法得住。此说约正修得。不约阿含。若约阿含则有多时。何以故。于末世中若能持此正法。诸人有二种。一随闻得信。二随正解得信。诸天皆拥护。彼人令阿含及正修得。于世不速隐没。是故于中。如文如义。应急修正行。此论中。佛世尊阿毗达磨。是我所说。为如经部中所显。为如毗婆沙中所显。偈曰。罽宾毗婆沙理成。我多随彼说此论。正法偏执是我失。判法正理佛为量。释曰。罽宾国毗婆沙师二证所成就。此阿毗达磨。我今多随彼义说。于中若有偏执。是我过失。离证能正判正法。唯佛世尊为最胜量。何以故。由证见一切法故。若佛圣弟子。离阿含及道理。判正法亦非中量</p></div>"
},{
    "title": "阿毗达磨俱舍释论 第二十二卷",
    "author": "三藏真谛 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗达磨俱舍释论 第二十二卷</p><p>　　婆薮盘豆造</p><p>　　陈<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a><a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>译</p><p>　　破说我品第九</p><p>　　大师<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>眼已闭又证教人稍灭散</p><p>　　不见实义无制人由不如思动乱法</p><p>　　<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>已入最妙静荷负教人随入灭</p><p>　　世间无主能坏德无钩制惑随意行</p><p>　　若知<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>寿将尽已至喉</p><p>　　是惑力盛时求脱勿放逸</p><p>　　离此法于余法为无得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>耶。无。云何如此。非如我见诳于心故。何以故。彼人不于<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>相续中假立我言故。何为由彼分别有别实物名我一切。或以<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>为生本故。于余法无解脱义。云何得知。如此但于五阴相续中。假起我言。非于余义。由我非证比二量所知故。余法若实有若无障碍。必定由证量得知。譬如六尘及心。或由比量得知。譬如五根。此中如此比知。若有<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。余因缘不有故。不见事生。若有则见事生。色尘等缘若具有。能障碍法若悉不有。盲聋等人及非盲聋等人。于色等尘眼等识不生生故。可得比量别因不有有义。别因即是眼等根。如此证量及比量。于我不有故。是故说决定<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。是跋私弗多罗部所说。必定有我。与五阴不一不异。此言宜应简择。为彼执由实物故有。由假名故有。实有相云何。假有相云何。若如色等别有。名实有物。若如乳等但聚集有。名假名有。若由实物有与阴别性故。应说与阴有异。譬如别别阴。必定须说此我因。若无因即是无为。则同外论师说。亦无别用。若汝执由假名有故有。此说最胜。我等亦说如此。我等立我有。不由实有说有。亦不由假名有说有。此何为。约内所取现世诸阴执说为我。今此别言。于义复不开显。非我等所解。此约言显何义。若义如此。谓缘诸阴。于诸阴中假名说我。此义应成。譬如缘色。等物假名说乳。复次若义如此。谓因诸阴故。我言成诸阴。是说我言因故。此执亦同前失。我等说我不如此。若不尔云何。如约薪执说火。约阴执说人亦尔。云何约薪执说火。若离薪火不可执说。不可立火与薪有异与薪无异。若火异薪。薪应不热。若火不异薪。所烧应即是能烧。如此离诸阴。不可执说人。亦不可说人异诸阴。由有常过失故。亦不可说人与诸阴不异。由有断过失故。善友愿汝为我说。何物为薪。何物为火。后我当得知约薪执说火义。此中何所应说。所烧是薪。能烧是火。若有应说必如此说。此中汝须更决说。何物是所烧。何物是能烧。于世间中可然物说名薪。亦名所烧。若然能烧光最热说名火。何以故。此物能然彼能烧彼。由能变异彼相续后不如本故。此二各有八物所成。缘薪火得生。譬如缘乳酪生。缘摩偷酢生。是故言约薪热说火。若尔则知火与薪异。由不同时故。若人如火必定缘阴生异于阴则成<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。复次若于然薪中。是热触说名火。所余三大与此共生。许此名薪。此二互有差别。明了易知。由相有异故。约薪有火义。汝今应说。云何约薪热说火。何以故。此薪非是火因。亦非热说火因。何以故。但火是热说火因。若汝说约言。是依止义。或共有义若尔诸阴于人应成依止。应成共生。彼互差别亦明了易知。复次若阴灭人应即灭。譬如薪灭火即灭。是汝所说。若火异薪。薪应不热。此中何物名热。若汝说热性名热。薪应不热。别火性故。复次若汝说。若有热性名热。此物虽与热性火异。此复成热。与热性相应故。是故于别异无过失。复次若汝言。正然物说名薪。亦说名火。是故约义。汝今应说若是阴即是人。此不异义。即至不可遮。是故此譬不成。如前云约薪执说火。约阴执说人亦尔复次若不可说人与阴异所知。有五种。谓过去未来现在无为不可言。此应不可说。何以故。此所知于过去等。不可说为第五及非第五故是时汝等执说人为观诸阴执说人。为观人执说人。若观诸阴执说人名。但约阴中执说人名。由人不可得故。若观人执说人。云何言约阴执说人。何以故。此执说但人是所缘境故。若汝言诸阴若有人则可知是故言约阴执说有人。若尔眼根思惟光明等。若有是时此色方可知。亦应约眼根等执说色。是有此义。汝应说。人于六识中。是何识所知。彼说由六识所知。此义云何。若缘眼所知色分别观人。应说此人是眼所知。不可说即色非即色。乃至若缘意所知法分别观人。应说此人是意所知。不可说即法非即法。若尔此人应成与乳等同。若缘眼所知色分别观乳。或观水等。应说乳水是眼所知。不可说即色非即色。如此应说。鼻舌身所知亦尔。乃至不可说即触非即触。勿乳水等非四物所成。此非所许义。是故如色等具物假说名乳及水等。如此亦应具诸阴假说名人。此义应成。是汝所说。缘眼所知色分别观人。此言有何义。为色是观察人智因。为正证知色即证知人。若色是人智因。亦不可说人异于彼。若尔色与光明眼根觉观等。亦应不可说异。彼是色智因故。若正证知色。即证知人。为即由色证智证知人。为由别智。若即由色证智证知人。人与色不应成异性。或于色但假说人。若不尔。若由一智所证知。此人非色此色非人。此二云何可分别若不能如此分别。云何强立此言。谓色是有。人亦是有。何以故。由随证知可说彼有如色乃至于法亦应说如此。若由别智分别此二。别时所得故。人应成异色。譬如黄色异青等。又如前后<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。乃至于法亦应说如此。若汝言。如色及人一异不可说能证知。此二智一异亦不可说。是故此智亦不可说是有为。则破自悉檀。若说人是有。但不可说即色非即色云何佛<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说。色无我乃至识亦无我。是汝所说。眼识能证见人。此识为缘色生。为缘<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>。为缘二生。若尔何有。若缘色生。则不能缘人生。譬如声等。何以故。若缘此尘此识得生。唯此尘是此识缘缘。若缘人及二。此执与经不相应故。则为<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>所违何以故。经中已决判此义。唯依缘二法诸识得生。复有别经。亦违此执。经云<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>眼是因色是缘。能生眼识。何以故。一切所有眼识。唯因眼缘色生。若如汝所执。此人应成无常。何以故。是因是缘能生眼识。彼皆无常。由此经言故。若汝执。人非眼识境人则非眼识所知。复次若汝立义。人是六识所知。此人由耳识所知故。应成异色。譬如声由眼识所知故。应成异声。譬如色。于余尘应知亦如此复次此经文句。违汝所执。经云<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。是五根各别行处。各别境界。是因自行处境界。彼各各受用。非别根能受用别根行处境界。谓眼根耳根鼻根舌根身根。心能受用五根行处境界。是故心是彼所依止。人非境界。若非境界。不应是六识所知。若尔意根应成别不通经云有六种根。各别行处各别境界。乐欲自自行处境界。此言于六<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>我譬中说。是义不然。于此经中不定说六根为根。是五根乐欲见等事不有故。彼识亦尔。彼增上处所引<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。立此为根。故说名根。是独类心增上缘所引意识。此识非能乐欲受用余根行处境界。是故无失。复次佛世尊说。比丘我今为汝等说一切所应知一切所应识法门。眼根是所应知。是所应识。色眼识眼触。由眼触因缘。于内生受。谓苦乐不苦不乐等。乃至由意触因缘。于内生受。谓苦乐不苦不乐等。是名一切所应知一切所应识法门。由此经。若有所应知及所应识决。唯此量不出于此。于中不说人。是故人决定非所应知。智及识境界同故。执我诸人说云。我等由眼见人。于非我所。见有我故。彼则堕我见处深坑。于经中佛世尊自了义说云。但于五阴说假名人。于人经中说。依眼缘色生眼识。由三和合生触。共生受想作意等。是四种无色阴。及眼根并色。唯如此量说名人。于此中立诸名。谓萨埵那罗摩[少/(兔-、)]阇摩那婆弗伽罗时婆布洒善斗。于中立言。我由眼见色。于中有世传云。此命者如此名。如此姓。如此种类。如此食。如此受苦乐。如此长寿。如此久住。如此寿际。比丘如此事。唯名为量。唯言为量。唯传为量如此等一切法无常有为。故意所造。由因缘生。如此了义经。于此执中。佛世尊说为依为量。此经不可更别思量。复次有别经说。婆罗门若说一切有。唯是十二入。若人非人所摄。此人必定不有。此义则成。若入入摄。非不可言。于彼部中有如此经。经言比丘。若所有眼。若所有色。广说如经。由唯此量。比丘诸佛如来。说一切有穷显一切说。又频琵娑罗经中说。比丘婴儿无闻凡夫随逐假名我言。此中无我无我所。唯苦欲生得生。广说如经。有阿罗汉<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。名世罗。对魔王说此偈言</p></div>"
}]