[{
    "title": "阿毗昙心论经 第一卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>阿毗昙心论经 第一卷</p><p>阿毗昙心论经序</p><p>今欲解释阿毗昙心利益<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>故。问曰。不须解释。所以者何。古昔论师已释阿毗昙心。利益弟子故不须释。答曰。不然应须解释。所以者何。古昔论师虽释阿毗昙心太广太略。彼未学者迷惑烦劳无由能取。我今离于广略。但光显修多罗<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。是故须释。问曰。何故释阿毗昙心利益弟子耶。答曰。彼中已说不颠倒<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。释不颠倒法相令彼<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>真实。是故离诸过恶生诸<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。得勇猛第一义利。问曰。若如是者。随意解释。答曰。我当解释。但诸师造论以吉为初。一切吉中<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>最胜。是故本师为显三宝少分功德故。于论初先说此偈</p><p>法胜论大德优波扇多释</p><p>高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>界品第一</p><p>前<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>最胜离热<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>言</p><p>彼言说相应罗汉见实等</p><p>前者先也。顶礼者净信曲躬礼也。最胜者。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>为应供者之所<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。又于一切法中胜故名最胜。复次世尊。于一切法于一切种而得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故名最胜。离热者。离烧义也。谓<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>热能烧身心。世尊离彼故名离热。此是自己智断成就。彼师如是说者。彰于如来自利满足。次说饶益言者。世尊言说。能饶益一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>。饶益者谓安隐也。安隐饶益一义异名。此彰世尊利他满足。此略说<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师自利利他功德满足。彼二种世尊等作究竟。是故应供中胜。彼言说相应者。谓道理义显示相应如是功德。相应天人师语。礼敬此者名礼法宝。罗汉见实等者。应受天人阿修罗等供养故名阿罗汉。此说无学。实者谓<a href=\"/remen/sishengdi.html\" class=\"keylink\" target=\"_blank\">四圣谛</a>。以学见者彼名见实。此唯说学。此学无学等。谓第一义僧。礼敬此者名礼僧宝。问曰。何故礼敬。答曰</p><p>佛开觉慧眼若知诸法众</p><p>亦为他显现我今说少分</p><p>佛者。知一切法。知一切种。故名为佛。开觉慧眼者。谓无碍智眼义也。若者。若佛所说所显所宣所释法也。知者解也。法者持也。持于自性。为他作缘故名为法。法有积聚。故名法众。法众群聚一义异名。亦为他显现者。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>知己利<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。故为他显示。或有觉知不为他说。如升摄波林经说。我今说少分者。于彼佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>中。我今但说少分法相。岂能尽说如是义已。问曰。何法是佛所说而欲说耶。答曰。所谓有漏无漏。有烦恼无烦恼。受荫有诤无诤。色无色等我今当说</p><p>一切有漏行离我乐常净</p><p>此受于我等不见有漏故</p><p>一切有漏行离我乐常净者。诸有漏行。离我离乐离常离净。彼中世间不能观察。无明覆障闇智。于此四门颠倒而见。故名颠倒。问曰。何因故知诸有漏行离于我耶。答曰。我事无故属<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故行名为他。非我自性。计我者说。我不属他除此更无。是故我性不可得。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>因故诸行离我。问曰。何因故知诸行离乐。答曰。作逼迫故。诸有漏行是苦自性亦是苦缘是故逼迫。逼迫名苦是故离乐。问曰。何因故知诸行离常。答曰。以生灭故。现见诸行生而即灭。无见常者是故离常。问曰。何因故知诸有漏行离于净耶。答曰。污染事故。诸有漏事烦恼境界。不净污染是故离净。问曰。如是诸行离于我等。世间何故取我等耶。答曰。此受于我等不见有漏故。诸有漏行不如实见。世间不能观察作我等解。犹如怨家匿藏恶欲。诈出美言游行家内实非亲友作亲友解。我我所覆故不见无我。是故现见行等作业以迷惑。故无我事中而见于我。对治覆苦事故于行住等想谓为乐。故于苦受阴中而作乐解。相似相续覆<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>事。彼现见色相似相续。记忆宿事诵持经论。故于无常行中而作常解。皮色覆于不净事。故彼于发毛爪齿处等少时见净。于不净中而作净解。虽见[尸@矢]尿。虽复不净。犹生迷惑。此虽不净余者应净。犹如野干看紧叔迦华。问曰。何故论初先说颠倒。答曰。为知不颠倒法相故我先已说。欲令弟子解真实故。以不颠倒心安隐易解。是故论初先说颠倒。问曰。为当但有此离我等诸有漏法。更有余耶。答曰。更有</p><p>若处生烦恼是圣说有漏</p><p>以彼漏名故慧者说烦恼</p><p>若处生烦恼是圣说有漏者。若依若聚若缘。若众生数非众生数。生身见等烦恼是法说有漏。问曰何故。答曰。以彼漏名故慧者说烦恼。观察烦恼为作漏名。故以彼法生于烦恼。依漏起故名为有漏。如有怖道有毒食等。应如是说。若事属漏。为漏所摄。彼名有漏。此说无漏缘生烦恼。非无漏法属于烦恼为烦恼摄。无漏法但缘生烦恼。问曰。漏义云何。答曰。从有顶下至无间狱。于其中间六入疮漏。是故名漏犹如疮漏。又留住<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>故名为漏。问曰。此更有名耶。答曰。更有</p><p>亦名有烦恼取荫及有诤</p><p>烦取诤生故知彼自性说</p><p>亦名有烦恼取荫及有诤者。是有漏法。亦名有烦恼。亦名取荫亦名有诤。问曰。何故彼诸名说。答曰。烦取诤生故知彼自性说。诸烦恼取诤等漏之异名。从烦恼生彼亦生烦恼故名有烦恼。如是从取生彼亦生取故名有取。从诤生彼亦生诤故名有诤。问曰。是荫世尊所说为取荫。即是荫为离取荫别有荫耶。答曰。若取荫者彼即是荫。或有荫而非取荫。问曰。何者是耶。答曰</p><p>若行离烦恼此是无漏荫</p><p>及前有取荫是荫圣所说</p><p>若行离烦恼此是无漏荫者。此荫更有余说。有二种荫。无漏有漏。若行离身见等烦恼。是名无漏。是荫非取荫。及前有取荫。是荫圣所说者。若此无漏荫及前所说取荫合说为荫。谓色等五荫。问曰。荫义云何。答曰。聚义是荫义。问曰。若如是者荫但假名无有实事。非但一物得有聚名和合故名聚。答曰。非但有相亦有实事。有此事者便有彼相故荫有相。如佛所说碍相是色荫等。是故有事界等所摄智识使等境界。如四圣谛故荫有事非但假名。问曰。荫界入等有何差别。答曰</p><p>十种谓色入亦名无教色</p><p>是分别色荫世尊之所说</p><p>色有二种。一者微尘积聚色。二者非微尘积聚色。微尘积聚色者。谓十色入眼乃至触。非微尘积聚色者。名无教色法入所摄。彼业品当说。此等一切是色荫相入色荫数佛说为色荫以此触彼。以彼触此是故名色。以此恼彼以彼恼此义也。如佛所说。如手等触。触故名色。问曰。若如是者。除无教色彼非是色何以故。非手等可触以无对故。汝意若谓。以所依者是可触故。彼亦是可触故无过者。受等亦应是色。汝意若谓。彼所依四大是可触故。彼亦是可触者。我当说言。现见所须作功业事。作画作泥。若如是者受等心数亦应是色。故汝有过。彼等亦依眼等诸根。彼亦应是可触。答曰。非但生心心数因。非心心数依眼等根。如光依珠。彼生时眼等作因。如是眼等是触彼非触也。复次造色依大如光依珠。是故大是触故彼亦是触。问曰。虽如是说汝相犹自不成。何以故。除过去未来微尘色故。答曰。相不可坏过去色触已灭。未来色亦如是相生。如是微尘亦是可触。以微细故不可得知。是故一切诸色皆是可触</p></div>"
},{
    "title": "阿毗昙心论经 第二卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>阿毗昙心论经 第二卷</p><p>法胜论大德优波扇多释</p><p>高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>业品第三别译</p><p>已说诸行<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>力生。次观察<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>生灭差别。由于<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>业因故生。当思彼业师欲广说于业。是故说此</p><p>业庄饰世间趣趣各各异</p><p>是以当思业求离世<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a></p><p>业庄饰世间趣趣各各异者。如是一切世间五趣。种种身生业能庄饰。当思彼业为世间因生种种身。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>差别。由业所作谓高下优劣。是以当思业求离世解脱。彼业<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>种地成就善不善差别。为知彼故当勤思惟。问曰。何者彼业。云何思惟。为世间因生种种身。答曰</p><p>身口意集业在于有有中</p><p>从彼生诸行及受种种身</p><p>身口意集业在于有有中者。有三种业。谓身口意业。彼身所作或业依身名为身业。若口所作名为口业。意相应名为意业。众生世世造作身口意业。从彼生诸行及受种种身者。彼业生于诸行及外众具宅舍色力。罪福命等及受众生种种身。此行有二种。谓众生数非众生数共不共。不共者。各各众生业增上生。共者。一切众生业增上生。如是<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>等五趣净不净。种种业身受苦乐种种差别。以彼众生种种。是故求解脱者必定应知是业</p><p>身业应当知有教及无教</p><p>口业亦如是意业唯无教</p><p>身业应当知有教及无教者。身业二种。谓有教数及无教数。彼有教数者身动。无教者。身动灭已。与余识相应。彼相续转如<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>竟。虽不善无记心善戒随生。如捕鸟等虽善无记心恶戒随生。口业亦如是者。口业亦有二种。谓有教性无教性。意业唯无教者。意业唯无教。性非如色教。此业不可示他故名无教。有言辞故名教。此五业中</p><p>有教当知三善不善无记</p><p>意业亦如是余不说无记</p><p>有教当知三善不善无记者。身教口教当知三种善不善无记。善者谓行施受戒等。<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>起动身。不善者谓<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>等不善心起动身。无记者有二种。谓隐没不隐没。隐没者谓秽污无记心起动身。不隐没者非秽污无记心起动身。所谓威仪工巧。口教亦如是应当知。意业亦如是者。意业亦有三种。彼善心相应必善。不善心相应名不善。秽污无记心相应必隐没无记。非秽污无记心相应。名不隐没无记。余不说无记者。余有二业。谓身口无教。彼有二种。谓善不善。无记。何以故羸劣故。以无记心羸劣故不能起强业。若与余识俱与彼事相续。如执须摩那华。虽复舍之犹见香随。何以故。香势续生故。非如执木石等。已说彼诸业</p><p>色无记二种隐没不隐没</p><p>隐没系在色余在于二界</p><p>色无记二种隐没不隐没者。若色性业教无记名前已说。此有二种。当知隐没不隐没。隐没系在色者。若隐没者。系在<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>梵世非上地。何以故。彼无记作心故。非在上地下地烦恼起现在前。何以故。以离欲故。亦不在欲界。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>断烦恼能起身口业。何以故。外门转故。见道断烦恼内门行故。不能起身口业。欲界修道断烦恼但是不善。非不善烦恼能起无记业。余在于二界者。若不隐没无记系在欲色二界。意业如心说。何以故。彼隐没不隐没通<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。故于中</p><p>若教无教戒略说有三种</p><p>无漏及禅生依顺解脱戒</p><p>若教无教戒略说有三种者。无教戒略说当知有三种。问曰云何。答曰。无漏及禅生依顺解脱戒。无漏戒者与道俱生。谓正语正业正命。禅生戒者与禅俱生。谓离欲不离欲凡夫及<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>。依顺解脱戒者。谓众聚和合。于彼士夫边。启请受得。此三种戒摄一切戒。问曰。如是分别有教无教戒竟。何者与心俱生。何者不与心俱生。答曰</p><p>无教在欲界教依于二有</p><p>当知非心俱谓余心俱说</p><p>欲界无教若顺解脱戒所摄。及不摄。彼一切非心俱。不随心转义。问曰。何故不随心转。答曰。彼受戒已。不善无记心亦随生故。不与善不善无记心随转。何以故。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>亦随转故。教者欲色二界不随心转。何以故。属身故。余心亦有故。谓余心俱说者。余谓禅无漏戒。彼二种随心转。何以故。异心不随转故。以彼心力生二种。彼常随心作随顺义。故彼二种过去过去成就。未来未来成就。现在现在成就。已说业差别。若业成就今当说</p><p>无漏<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>仪见实则成就</p><p>禅生若得禅持戒生欲界</p><p>无漏戒<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>见实则成就者。谓从初苦法忍。及一切圣人成就无漏戒。是戒在于六地。未来中间根本四禅。此色地亦无漏。彼未离欲见谛成就未来地戒。若离欲一切有学极少成就三地。或有六地一切阿罗汉成就六地。禅生若得禅者。成就禅戒非余。是戒在九地。谓禅近地中间四禅。若人若得诸地若凡夫若圣人。是得成就彼地戒。持戒生欲界者。若受戒者彼成就顺解脱戒。是戒欲界人得非余趣受。已略说成就差别。随成就过去未来现在戒。今当说有三种人。谓住戒人。住非戒人。住非戒非非戒人。住戒人者亦有三种。以戒有三种故。彼者</p><p>若住解脱戒彼无教现在</p><p>当知恒成就或尽成过去</p><p>若住解脱戒彼无教现在当知恒成就者。若住顺解脱戒。彼人从初<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>受无教戒。现在一切时成就彼现在无教。常次第相续乃至命未尽。何以故。要期分齐故。或尽成过去者。或有住顺解脱戒。成就过去无教戒。谓已灭不舍。舍事有五因缘。后当说</p><p>若有作于教成就于中世</p><p>彼尽而不舍当知成过去</p><p>若有作于教成就于中世者。中世名现在。若人作身口教求受戒时。成就现在教戒。彼尽而不舍当知成过去者。尽者过去义。彼教尽时若不舍者成就过去教戒。此舍因缘如前说。略说如是初念教时。成就现在教及无教。彼后乃至教未尽未来。成就过去现在教及无教。此教尽已若不舍者。成就过去现在无教。彼但成就于过去教。非现在教</p><p>若得禅无教成就灭未来</p><p>中若入正受教亦如前说</p><p>若得禅无教成就灭未来者。若得禅者成就过去未来禅戒。如成就禅彼人无教。虽决定灭由彼禅力故初如是彼得过去。如禅第二念等三世成就乃至未起禅。若起不舍成就过去未来无漏戒。与禅同故此中不说。既说禅戒亦说彼已。何以故。若有见谛教者彼人决定得于禅戒。故说禅戒即是说彼</p><p>若作不善业住戒成就二</p><p>共烦恼缠俱当知彼尽尽</p><p>若作不善业住戒成就二者。若人住顺解脱戒若住禅戒。彼不见谛作于不善。增上缠时不善无教便起。彼人尔时成就不善教及无教。问曰。何者住禅戒作不善耶。答曰。若未离欲依未来禅得作不善。问曰。几时成就无教耶。答曰共烦恼缠俱。是人乃至未舍于不善缠。当知彼尽尽。若舍彼缠彼教无教亦舍</p></div>"
},{
    "title": "阿毗昙心论经 第三卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>阿毗昙心论经 第三卷</p><p>法胜论大德优波扇多释</p><p>高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>使品之二(别译)</p><p>问曰。彼何者使。何处使</p><p>欲界一切种一切遍使使</p><p>缘缚于自地上地亦如是</p><p>欲界一切种一切遍使使缘缚于自地者。欲界一切遍使使。欲界一切种上地亦如是者。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>自地亦如是</p><p>其余诸结使当知于自种</p><p>缘使于自地一切共依品</p><p>其余诸结使当知于自种缘使于自地者。非一切遍使。于自种类自地法中。缘使所使此彼境界。一切共依品者。一切遍使及不遍使。于自种类自品相应法中相应使</p><p>若无漏所行他地缘<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a></p><p>彼相应所使境界<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>故</p><p>若无漏所行他地缘烦恼彼相应所使者。若使无漏缘。及他界地缘烦恼。彼相应所使非缘使。问曰。何故。答曰。境界解脱故。此使解脱境界故。无漏诸法解脱一切烦恼。问曰。云何缘而不使。答曰。无住处故彼对治无漏。是故不得住处。譬如炎炽琉璃蚊蚋等虫。乐升其上而不能住。如人履于热地以热触故不能停足。彼亦如是。上地诸法解脱下地。是故缘而不使。问曰。此使云何为是不善为是无记。答曰</p><p>身见及边见彼俱生无明</p><p>是欲中无记色无色一切</p><p>身见及边见彼俱生无明是欲中无记者。欲界身边二见。及彼相应无明是无记。何以故。与施戒等不相违故。身见常见于施戒修不相违。何以故。欲受未来可爱果故。是故作施等事。不善则与施等相违。是故无记。又诸<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>常行此见。若此烦恼是不善者。欲界应无有一众生得受乐者。何以故。常行不善故。复次此见愚于自事不逼迫他。是故身见非是不善。断见随顺离欲近于<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。能作厌离<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>行故亦非不善。欲界诸余烦恼皆是不善。色无色一切者。色无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>所有诸使悉是无记。四支五支<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>所制伏故不能生报。譬如善咒制伏毒蛇不能为害。彼亦如是。复次不能为报因者。不善能生苦受报。上无苦受不可欲界受于彼果。问曰。云何一切烦恼。决定于自境界中转。为当不耶。答曰不也问曰。云何。答曰</p><p>贪嗔慢当知过去或缘缚</p><p>未来说一切余一切三世</p><p>贪嗔慢当知过去或缘缚者。若过去世贪嗔慢等彼非一切。于自境界中过去世缚。何以故。非不见不闻。不闻不分别事起贪嗔慢。何以故。分齐缘故。或时有人于眼生贪非余身分。何以故。自相使故。非贪等使共取境界如身见等。未来说一切者。若未来世贪嗔慢等。缘缚三世诸有漏法。彼中若五识身。必定生法系缚未来。若不生法系缚三世。及意地生不生法。亦缘缚三世诸有漏法。何以故。彼缘一切有漏法故。余一切三世者。见疑无明是名为除。彼共相缚故。若过去未来缘缚三世诸有漏法。何以故。彼是共相使故。现在使不定。是故不说。若有者彼自相使随现在前。彼现在未来缚。未来缚者。谓意地及不生五识身等。过去世者。若于彼起已灭不断于彼中缚。若共相使现在前者。彼缚三世诸有漏法。已说使世差别。次第转今当说</p><p>烦恼次第转自地于自地</p><p>上地亦生下次第应当知</p><p>烦恼次第转自地于自地者。谓一切使于自地使次第缘转。一一次第生于一切。上地亦生下次第应当知者。于梵世地命终次第生欲界。一切彼中染污心命终。次第欲界中阴秽污心生。如是乃至有顶中生或生如是生。如生无色界还生无色界。问曰。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说贪等七使。云何差别为九十八。答曰</p><p>欲界五种贪此说欲爱使</p><p>色无色亦尔有爱应当知</p><p>欲界五种贪此说欲爱使者。所谓见苦集灭道<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>断等。五种欲贪说欲爱使。此如前说。色无色亦尔有爱应当知者。色界五种。无色界中亦有五种说有爱使</p><p>嗔即是嗔使五种如前说</p><p>憍慢及无明十五在<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a></p><p>嗔即是嗔使五种如前说者。欲界嗔有五种。见苦断等说为嗔使。憍慢及无明十五在三界者。欲界憍慢亦有五种见苦断等。色无色界亦有五种。此十五种慢说为慢使。无明亦尔</p><p>见使三十六当知在三界</p><p>疑使有十二略说为七种</p><p>见使三十六当知在三界者。见使三十六当知十二系在欲界谓见苦断五。见集断二。见灭断二。见道断三。色无色界亦尔。疑使有十二者。四种系在欲界。谓见苦集灭道断。色无色界亦尔。此十二种说为疑使。略说为七种者。此界性种差别为九十八使。世尊经中略说为七种。问曰。使有何义。答曰。彼微细义是为使义。使微细行。粗者名缠。常随入义名使。如胡麻抟相。着义名使。犹如小儿着于乳母。相续义名使。犹如鼠毒。如四日疟病。如责日息。如铁黑色不舍。如读诵渐积。如是烦恼。世尊说为扼流取漏缚。问曰。何故。答曰</p><p>厄取及漂流泄漏与系缚</p><p>以是义故说厄流取漏缚</p><p>苦系义说厄。此有四种。谓欲厄有厄见厄无明厄。取生生具故说为取。此亦四种。谓欲取见取等。漂众生故说流。亦有四种。如厄中说。彼流出义是漏义。一切生中行漏有三种。谓欲漏有漏无明漏。能系缚<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>义故名缚。问曰。何者为结。答曰。结有九种。谓爱结恚结慢结无明结见结他取结疑结悭结嫉结。已说烦恼名差别。根相应今当说</p><p>诸使在三界尽舍根相应</p><p>随地诸根使相应至色有</p><p>诸使在三界尽舍根相应者。三界一切烦恼尽与舍根相应。何以故。无明与舍根相应。彼随顺一切烦恼。及随顺别烦恼。一切烦恼后时悉皆处中而息。随地诸根使相应至色有者。如梵世有喜根乐根。彼中诸使与此相应。如光曜天有喜根。彼地诸使与喜根相应。遍净天亦有乐根。彼中诸使与乐根相应</p><p>邪见及无明欲界中乐苦</p><p>嗔恚疑唯苦谓余一向乐</p><p>邪见及无明欲界中乐苦者。欲界邪见与苦根乐根相应。邪见者作恶业则喜。作善业则忧。无明者与一切根相应。嗔恚疑唯苦者。欲界疑使不定故不喜故。与忧根相应。嗔恚于不爱相转故。与苦根忧根相应。谓余一向乐者。欲界诸余烦恼与喜根乐根相应。彼除邪见。谓余见贪慢等喜转</p><p>谓熏二种身见断唯意地</p><p>欲界诸烦恼说诸根相应</p><p>谓熏二种身者。修道所断烦恼名熏。彼与身受心受相应。除慢唯意地故。彼苦根乐根是说身受。忧根喜根是说心受。舍根二种受。一切身受修道所断。心受二种断。见断唯意地者。见断烦恼与心受诸根相应。一切见断烦恼在意地故。欲界诸烦恼说诸根相应者。此必定欲界烦恼法如是。上地随地根相应亦如是。疑者色界中唯与喜根乐根相应。彼疑善助道想与喜相应。已说烦恼。起烦恼今当说</p></div>"
},{
    "title": "阿毗昙心论经 第四卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>阿毗昙心论经 第四卷</p><p>法胜论大德优波扇多释</p><p>高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>智品第六(别译)</p><p>今欲分别<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>分智。何以故。以智能断诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>故。欲广释智。故先说此</p><p>若智性能了观察一切有</p><p>有无有涅槃彼相我当说</p><p>有无有者。所谓涅槃。是故智者观有无有。有者一切有漏法谓苦集义。有无有者谓灭谛也。一切有无有。故名有无有。于彼中无有义也。此说有对治谓是灭。是故灭非无也。非无物有对治。如灭尽正受心心数法不行故。对治说灭。是有物如是涅槃一切有对治。是故有事如除病得无病。彼相谓寂灭寂灭相等。彼攀缘智。智者观察于彼。非无境界而有智转。是故若智观察此即是道。问曰。彼何者是。答曰</p><p>三智佛所说最上第一觉</p><p>法智随顺智及以世俗智</p><p>此三智摄一切智。法智者。若智欲界境界。或欲界灭对治。或境界无漏。彼初取法决定行。故名法智。随顺智者。若智色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>境界。色无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>灭对治。或境界无漏。次法智后次第随顺。故名随顺智。世俗智者。若有漏智多受俗数。谓男女等故说世智。如是等名世俗智</p><p>苦集及灭道二智而随生</p><p>如是四种智牟尼随名说</p><p>法智随顺智者。随圣谛转。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>随名说苦谛境界。故说苦智。如是集灭道谛境界。故曰集灭道智。于此苦集二智行差别。苦行转名苦智。集行转名集智。缘无差别同缘<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。故灭道二智行缘差别</p><p>若智观他心是从三中说</p><p>尽无生智二当知在四门</p><p>若智观他心是从三中说者。三智中他心智有漏。是世智。若欲界对治境界。彼是法智。若色无色界对治境界。是随顺智心心数境界。彼心心数方便成就。故名他心智。尽无生智二者。尽智无生智是二智。谓法智随顺智。彼所作究竟受是尽智。不复更作受是无生智。问曰。尽智无生智何谛境界。答曰。当知在四门。此缘<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>义也。除初尽智彼缘二谛。已分别十智。行分别今当说</p><p>二智十六行法智随顺智</p><p>上已说及余是说世俗智</p><p>世智十六行转。前后皆有彼十六行。暖顶忍摄。余<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>慧第一法摄。四行无间等边十二行。彼外更有行。谓施戒慈等</p><p>四智有四行决定行所说</p><p>若知他心智如是行或非</p><p>四智有四行决定行所说者。苦智有四行。集灭道智亦如是。若知他心智如是行或非者。若无漏他心智。彼有四行。如道智是道智少分故。若有漏者行则异。但摄有漏心心数法</p><p>尽智无生智离空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>行</p><p>说有十四行受相为最上</p><p>尽智无生智离空无我行说有十四<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。尽智无生智第一义转。亦亲近世智作意我生尽。如是等取我<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>相似行。空行无我行。定是第一义转非世俗缘。是故尽智无生智。空行无我行不转故有十四行。问曰。所有无漏智。一切十六行摄不耶。答曰。不尔。受相为最上。彼十六行是共行。若复取自相无漏智。如身念处等。彼非十六行摄。已说行差别。得今当说</p><p>最初无漏心或有成就一</p><p>二或成就三于上四增一</p><p>最初无漏心或有成就一者。最初苦法忍相应心。未离欲成就一智谓世智。离欲成就他心智不现在前。非见道次第他心智现在前。何以故。与<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>相违故。二或成就三者。第二无漏苦法智相应心。未离欲成就三法智苦智世智。若离欲成就他心智。于上四增一者。于上四心<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>中。当知一一增苦比智。得比智集法智。得集智灭法智。得灭智道法智。得道智集灭道比智。及忍不得未曾得智。问曰。在何地。答曰</p><p>九智圣所说此依于二地</p><p>当知禅有十无色地中八</p><p>九智圣所说此依于二地者。九智依未来禅中间禅除他心智。当知禅有十者。根本四禅各有十智。问曰。何故中间禅未来禅无他心智。答曰。微细境界故。此境界微细于他身中。心心数法未来禅。少道非少道能取微细义。彼根本禅道<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>双行。是强力道故彼能取。无色地中八者。除法智他心智。法智者欲界境界。无色界于欲界依对治行缘远。是故无色界无法智。他心智缘色能生。是故于色界转非无色中。余未来有顶有一世智。何以故。有漏故。已说地差别。修差别今当说。修有六种。所谓得修习修对治修出离修戒修观察修。彼得修者。若于善法不得。得现在未来故。习修者。先所得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>现前修习。对治修者。诸有漏法修对治道。出离修者。若<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>时舍离秽法。戒修者。若能调伏诸根道。观察修者。若观察身等。此中唯取二修。谓得修习修</p><p>若得修诸智谓在圣见道</p><p>彼即当来修诸忍亦如是</p><p>若得修诸智谓在圣见道彼即当来修者。若见道诸智现前修。彼即当来修。谓苦法智现在修。彼亦未来修。非忍非余智。如是乃至道法忍。诸忍亦如是者。忍中亦如是。苦法忍现在修彼亦未来修。非智非余忍。一切忍亦如是。问曰。何故见道唯修自分道。修道修自分非自分耶。答曰。未修智故。故见道中智未习未练。修道中二种并作</p><p>于彼三心中得修于世智</p><p>或修七或六当知最后心</p><p>于彼三心中得修于世智者。彼见道三心中得修世智。谓苦集灭比智。随彼地见道即彼地有世智。及欲界世智修。若彼依未来地得决定彼修未来及欲界世智。如是依第四禅得决定。彼修七地世俗智。问曰。道比智何故不修。答曰。彼无边故。谛无间等边成就故。名无间等边。无能修一切道。于他道不能修。于自身修。乃至未来彼行者自分不现前。于三谛自他俱能知能断能证。是故随得边故能修。是故彼能修非余。是故法智亦不修。何以故。谛无间等未究竟故。于此谛世俗智本曾作证。是故此智修但有善名。方便犹未得。或修七或六当知最后心者。若离欲界欲道比智彼修七智。阿那含果所摄。除世俗智尽智无生智。若未离欲修六智除他心智。非想非非想处对治彼得<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>果。是以不修世智</p><p>于彼上修道十七无漏心</p><p>当知修七种增益根修六</p><p>于彼上修道十七无漏心当知修七种者。若未离六种欲。从须陀洹果上修道中。十七刹那当知修七智。此道未来禅摄故。无他心智亦无尽智无生智。以无学故。是故彼中修余七智。彼若以世俗道进彼世俗智现在前七种未来。若出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>道四种法智。一一现在前。余七智未来。增益根修六者。增益根者。谓或信<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。练治诸根进得见到。彼增进根。一切无碍道解脱道中得修六智。未离欲故无他心智。又复修道<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>非断烦恼。精进是人未得修进功德。是故不修世智</p></div>"
},{
    "title": "阿毗昙心论经 第五卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>阿毗昙心论经 第五卷</p><p>法胜论大德优波扇多释</p><p>高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>定品之二(别译)</p><p>已说<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a><a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。亦说有漏无漏。成就今当说</p><p>当知未离欲成就味相应</p><p>离下未至上成就净诸定</p><p>当知未离欲成就味相应者。若人若此地未离欲。成就此地味相应。离下未至上成就净诸定者。离欲界欲未生第二禅等中梵世。若离欲若不离欲。成就净初禅。及彼地余善功德</p><p>住上应当知成就下无漏</p><p>方便生功德当知非离欲</p><p>住上应当知成就下无漏者。圣<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>梵世上。成就无漏初禅及余无漏。<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a><a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>及智等诸功德。彼地有漏功德生处缚。无漏断缚。是故离生处舍有漏非无漏。如是一切地随其义说。方便生功德当知非离欲者。已说离下地欲成就诸功德。当知说得成就不现在前。方便现在前者彼非离欲。方便得者如天眼耳。彼无记故。无漏净味相应不摄。是故得彼三种禅时不得灭尽。是灭尽定者方便故。彼得现前二十三种正受。八味相应八净七无漏。问曰。彼中一一几种因。答曰</p><p>所谓无漏定一一七种因</p><p>味净相应禅当知因有一</p><p>所谓无漏定一一七种因者。一一无漏七种无漏中。自分因中因自地者。亦相应共生因。味净相应禅当知因有一者。味相应初禅味相应初禅因非余。初禅因不相似故。非余地秽污因行相违故。非秽污行相违亦非自分。如是净初禅净初禅因。非秽污非无漏。何以故。不相似故。非余地净因自地<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>故及自地系缚故。如是一切。问曰。一一次第生几种。答曰</p><p>无漏禅无色逆顺超次第</p><p>次第生六种当知乃至十</p><p>无漏初禅次第生六种。自地净及无漏。如是第二第三禅如是超越正受。无漏无所有处次第生七。自地二下地四上地一。无漏第二禅次第生八。自地二初禅地二上地四。无漏无边识处次第生九。自地二下地四上地三。余无漏次第生十。自地二下地四上地四</p><p>或六至十一谓净次第生</p><p>从二乃至十当知说有味</p><p>或六至十一。谓净次第生者。净非想非非想处次第生六。自地味相应及净下地四。净及无漏非味相应。离欲故。净初禅次第生七。自地三上地四。净及无漏净不用处次第生八。自地三上地一下地四。净第二禅次第生九。无边识处次第生十。余十一。如是一切当知正受时如是说非死时。是故彼中上下地味相应不摄生。得净次第上下味相应生。从二乃至十当知说有味者。味相应初禅次第生二。自地味相应及净。彼此不相违故。有顶味相应次第生十。正受味三自地二。及下地净自地<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>所恼故。依不用处地净以自救护。如是一切地下地净三。及死时上地退下地一切味相应。问曰。前说正受。烦恼今当说。答曰。净次第正受烦恼说味相应。及受生烦恼。何以故。烦恼力生非<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。是故此中说一切烦恼净必定定力。是故说共正受烦恼。问曰。彼中一一缘几种。答曰</p><p>净及无漏禅一切地中转</p><p>自地有漏法味相应所缘</p><p>净及无漏禅一切地中转者。净及无漏禅缘一切地一切事。自地有漏法味相应所缘者。味相应禅缘自地味相应。及净非无漏。何以故。非无漏缘。有爱亦非爱他地</p><p>无色则不行于下有漏事</p><p>若根本彼善秽污如味禅</p><p>无色则不行于下有漏事者。无色正受不缘下地有漏法。何以故。下地不寂灭故。亦缘下地无漏。如比智分。问曰。一切有漏不缘下地耶。答曰。不尔。若根本彼善。若根本无色净及无漏。彼缘自地及上地不缘下地。未来禅若缘下地。彼于下地粗想缘厌离秽污。如味禅者如味相应禅说。无色秽污亦如是</p><p><a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>若有余无量等功德</p><p>彼欲界境界<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>之所说</p><p>若色界功德。谓四无量一切处。等彼缘欲界。何以故。除神通说无量等。彼五神通缘欲色界。问曰。如前说熏禅中修智。彼云何熏。答曰</p><p>若能熏诸禅是依第四禅</p><p>三地爱尽故净居唯广果</p><p>若能熏诸禅是依第四禅者。得第四禅能熏禅非余。彼人数数入无漏四禅起无漏。数数入有漏禅复还入无漏。还入有漏渐略乃至住二<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>。如是方便若一无漏心若一有漏心。是时一念有漏一念无漏。二念一有漏一无漏。是说成就。问曰。此何处得果。答曰。净居天中。何以故。三地爱尽故。净居唯广果。若得第四禅离三地爱。是故此得第四禅人。净居广果中凡夫共修熏禅。不与凡夫共。五种者。下中上上中上上。彼如是五种不广天无热天善见天善现天及色究竟天。是故彼中得果。问曰。如前说七种愿智是云何。答曰</p><p>无著不动法得一切正受</p><p>彼三昧智力能起顶四禅</p><p>彼人烦恼不能逼恼心相续故一切正受力心相续生故得三功德。谓愿智无诤及无碍。彼愿智者。若欲知过去未来现在及无为。彼时愿智边际。住第四禅正受能知。无诤名于他相续中。烦恼诤不欲起。此人他相续中。不起烦恼诤。无碍名如前说。问曰。愿智何地摄。答曰</p><p>三地有愿智无诤五地中</p><p>二地法辞辩二辩依九地</p><p>三地有愿智者。第四禅初禅及欲界。决定第四禅中得。欲界唯人中能起欲界。梵世相应心记起言说心。彼处有。是故说三地。无诤五地中者。根本四禅及欲界。此决定于四禅中得。人中能起非余处。二地法辞辩者。法辩欲界梵世。此五地根本四禅及欲界。此但名缘言从名转。是故起语言道。有觉观处说辞辩。欲界及梵世。何以故。言语缘故。二辩依九地者。义辩乐说辩。欲界四禅中及四无色定。未来中间禅根本初禅摄。问曰。云何得此正受。答曰</p><p>离欲及受生而得于净禅</p><p>秽污退及生无漏唯离欲</p><p>离欲及受生而得于净禅者。净初禅二时得。离欲时得及上地没生梵世。彼地过舍。如是一切。秽污退及生者。味相应禅退上得下。或第二禅中若欲界缠若梵世缠退。尔时得味相应初禅生得者。如上地没生欲界及梵世。尔时得味相应。初禅如是一切。无漏唯离欲者。无漏禅离欲得。谓<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>离欲界欲。彼得无漏初禅。昔所未得故得。如是一切。问曰。此功德何者能除烦恼。答曰</p><p>无漏除烦恼正受中间者</p><p>一切定中间相应于舍根</p><p>无漏除烦恼者。无漏禅无色除烦恼非世俗。问曰。何故世俗不断烦恼。答曰。同一系缚故。世俗共烦恼一缚。是故自地烦恼不能断。如人被反缚不能自解。若彼对治及断中生。问曰。一切世俗不能断烦恼耶。答曰。有世俗能断烦恼。问曰。何者是。答曰。正受中间者。谓未来禅犹未得根本禅。若作方便得离下地欲。彼初禅未来有漏无漏。余未来一向有漏。为根本禅无色正受。是故说世俗不断烦恼。问曰。此近禅何处。答曰。一切定中间相应于舍根。一切正受中舍根相应。未得所求故不生喜。问曰。虽说神足境界智证神通。未说几种变化心今当说。答曰。十四欲界初禅果。初禅地初禅果。欲界二禅果。初禅地二禅果。二禅地二禅果。乃至第四禅亦如是。问曰。彼谁成就。答曰</p></div>"
},{
    "title": "阿毗昙心论经 第六卷",
    "author": "那连提耶舍 译",
    "html": "<div class=\"B1_text\"><p>　　阿毗昙心论经 第六卷</p><p>　　法胜论大德优波扇多释</p><p>　　高齐<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>那连提耶舍译(六卷成部)</p><p>　　修多罗品之二(别译)</p><p>　　问曰。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>说二十二根。彼云何。答曰</p><p>　　谓眼等四根身根有三种</p><p>　　如意根及命此根<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>依</p><p>　　谓眼等四根者。眼耳鼻舌。彼眼根眼识依净色。于色已见今见未来或当知此。或复有异彼余自分。问曰何谓自分。答曰彼相似义也。如色不曾见今不见当不见。何以故识空故。如是一切如识自依说。身根有三种者。身根亦如是。彼说三种身根男根女根。如意根何者意根。若心<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>彼复六识身。若已知法今知法当知法。或复是自分彼无生法如是当来。及命者命根第九彼<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>寿。此根说生死依故说根。<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>生死故</p><p>　　受是<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>伴信等依<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a></p><p>　　九根若无漏此三依于道</p><p>　　受是烦恼伴者。苦乐忧喜舍受。杂烦恼烦恼伴依地故说根。信等依涅槃者。言<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>念定慧依寂灭伴故说根。九根若无漏。是三依于道者。信等五喜乐舍意根等。有漏无漏此中若无漏。彼依于道<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>说。如贤圣品说。如是诸根名二十二。事十七。男根女根身根少分。三无漏无异。问曰何者是根义。答曰彼增上义是根义。如人主兽王一切法有增上主。彼最胜增上主名根。彼取六境界增上主。男女二根众生差别分别增上主。初时无差别。命根持众生身增上。受有烦恼增上。信等涅槃增上。无漏道差别增上</p><p>　　欲界四善八色种根有七</p><p>　　诸心数有十一心智者说</p><p>　　欲界四者。如是根四在欲界。男女忧苦决定欲界相应。问曰何故<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>无男女根。答曰无受用事故。鼻舌二根亦应无。为端严身故生无妨。又男女二根令身丑恶故无。无苦根非逼迫果故。彼他不恼故无忧根。何以故无知生故。彼智知欲界。余色根意根界品已说。舍根信等五根三界相应不相应。喜乐根<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>相应不相应。无漏三根决定不相应命根。杂品当说。问曰几善。答曰善八。信等五三无漏必定是善非不善。余忧根受等善不善无记忧根命根后当说。余如界品说。如是取色七者眼等五及男女根。此等是色余非色。问曰几心性几非心性如是广说。答曰诸心数有十。五受五信等。一心智者说者。意根一种心<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。无漏前已说九根无漏。三余非心心数决定。问曰几有报几无报。答曰</p><p>　　一及七有报此义应当知</p><p>　　十三中是报见实者所说</p><p>　　一及十有报此义应当知者。忧根一向有报。何以故善不善故。问曰何故忧根无记无。答曰忧根与喜下劣行相违。非身边见相应故。非隐没无记分别转故。非不隐没无记。非工巧报生威仪等分别生。若彼分别生谁在于后。非离欲灭离欲不断故。非不隐没无记。是故非不隐没无记。忧根信等中若有漏彼有报。若无漏彼无报。意根及三受若不善善有漏彼有报。无记无漏无报。苦根善不善有报。无记无报余根非有报。问曰何故不善善有漏有报。答曰坚固住故资助力。如畦水润粪覆烂坏坚固种子生。非无漏无资缘故。如在仓中种子。虽坚不生爱水不润故。余烦恼如粪无故不能烂坏。非无记有报。如烂种子虽置畦中不生。问曰几根是报。答曰十三中是报见实者所说。七色根意根命根。除忧根四受是有报。亦有非报色长养非报余是报。命根正受果寿行数。彼非报余是报。意根及受善秽污非报。威仪工巧变化心数非报。余是报余根决定非报。问曰几根最初生时得报。答曰</p><p>　　二或六七八初念生时得</p><p>　　欲中有报相色六及上一</p><p>　　若众生根次第生。卵生湿生胎生彼初念二根报生身根及命根。意根彼是秽污是故不取。非秽污心为连系报。非秽污是故非报。舍根亦如是。化生无根六色根五及命根。一切化生不少眼根等。一根七二根八。欲中有报根故。此法用欲界众生当知。色六及上一者。色界得六。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>一但命根。问曰死时最后舍几根。答曰</p><p>　　舍四八与九亦说舍于十</p><p>　　渐终及顿没善舍各增五</p><p>　　舍四八与九亦说舍于十渐终及顿没者。无记心渐终舍四身意命舍根。无根一时无记心死舍八。谓眼等根命意舍根。一根九二根十不<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>亦尔。问曰善心舍几根。答曰善舍各增五。于是中加信等五根。色无色随所得亦如是。问曰几见断如是等应当广说。答曰</p><p>　　二断无断四六根则二种</p><p>　　三无漏不断余则<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>尽</p><p>　　二断无断四者。意根及三种受此见断修断。若无漏无断。六根则二种者忧根见修断。信等五根修道断不断。三无漏不断者。一向无漏故。余则修道尽者。余九根修道断。彼眼等八不秽污故。修道断堕生死故非不断。苦根五识身是故修道断。问曰世尊说六识身。彼取何法。答曰</p><p>　　若取识根义五种心境界</p><p>　　若取一切法是则意识界</p><p>　　若取识根义五种心境界者。色等五境界五识身取。眼识取色色形相色者。谓青等无量种。形相者长等无量种。彼眼等不到取眼着药。捭则不见。耳识声亦不到取。鼻香舌味身触此到取。一切五识身能取现在境界。问曰意识云何取。答曰若取一切法是则意识界。若五识身所取。彼若不取过去未来。现在法及无为一切意识取。除彼<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>自体共生相应法。问曰初知不坏境界已说此境界。云何十种差别。答欲界相应不相应如是。色界无色界如是。无漏有为无为善无记。问曰十智一一智几法境界。答曰</p><p>　　五法应当知法智之境界</p><p>　　七种随顺智他心境界三</p><p>　　五法应当知法智之境界者。欲界相应不相应及无漏无为善。七种随顺智者。色无色无漏相应不相应善无为。他心境界三者。欲色界无漏相应</p><p>　　有漏当知十<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>智有六</p><p>　　<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>智一法道智二余九</p><p>　　有漏当知十者。世俗智一切十种法境界。因果智有六者。苦集智三界相应不相应。解脱智一法者。灭智中一无为善。道智二者。道智有为无漏相应不相应。余九者。尽智无生智境界九法除无为。无记使境界如前说。复欲总说故说此</p><p>　　自地诸烦恼定使于自地</p><p>　　自种一切遍在彼种类中</p><p>　　自地诸烦恼定使于自地者。欲界一切使所使。欲界乃至有顶地彼地亦然。胜故对治故下地上地不使。离欲现前上地下地不使。自种一切遍在彼种类中者。自种类法自种类使所使。一切遍他类亦使如身见。见苦断使所使见集断等他类亦使。如是一切遍使说。乃至修道断修道断一切使。所使一切遍使</p><p>　　三界定烦恼如是定三界</p></div>"
}]