[{
    "title": "佛性海藏智慧解脱破心相经 第2885部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p><a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>海藏<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a><a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>破心相经 卷上</p><p>如是我闻。一时佛住拘尸那国□□□□□河边娑罗双树间。二月十五日临□<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>□。与无殃数眾八十亿诸天及人。皆各集在佛所。悲号硬咽。大地震动。泉源沸涌。亦如慈母初丧所爱之子。泣涕盈目。不能自胜。五体投地。如太山崩。一一毛孔血流洒地。如波罗奢华。痛哉苦哉。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>空虚无上慈父。一旦捨弃我等入于涅槃。我等孤穷将何所怙。唯愿<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。悲惻流念。且住于世莫般涅槃。為我徒眾广宣流布无上法药。使后代眾生离苦出世。我等得闻奉持<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。在在处处广宣流布常使不绝。尔时世尊告诸大眾。汝等且止。莫说是语。吾今出世所可度者我已度讫。所可说者今已说竟。于中夜半入般涅槃。尔时眾中有一大士。名曰除疑法王子。从坐而起。整理衣服而白佛言。世尊我观如来智慧辩才<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>无碍无量方便犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。云何而言。所可说者而说已。竟作是语。时一切大眾发声大哭哀动天地。目中泣血。我等徒眾岂非子。例五体投地犹如死尸</p><p>尔时世尊。愍诸大眾告除疑言。善哉汝是大士。于无量阿僧祇劫。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>无量恒河沙诸佛。具足解脱知见。慈愍一切眾生。乃能如是发问。汝等諦听諦听。及诸大眾善思念之。吾当為汝分别解说。唯然世尊愿乐欲闻。善男子。一切眾生弥轮于相或离疑去缚。皆由悟宗相俱丧名為空宗。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>空有并存。名為二乘人也。执相乖宗。是名声闻。凡夫终身<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>无有出期。备受眾苦。未得解脱。寔由三毒箭之所射。四蛇之所嚙。五狗之所盗。六贼之所怖。七杀之所没。八邪之所牵。万恶之所簇。轮迴<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。往来六趣。波迸五道。坠落三涂八难。无有乐时。名无间大<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>覆障眾恶竞生。遂成怨结。慧日奄暉。慈光渐没。迷于正路。甚可哀矣。尔时除疑大士问佛言。世尊云何名為三毒箭。形状大小為可见不。唯愿说之。尔时佛告除疑言。三毒箭者。非有相非<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。除疑复白佛言。世尊云何说言非有相非无相。若非有相不应。是患非是患者。云何如能名之為箭。若非无相则应可见。以可见故亦应可避。云何而能伤害眾生。唯愿世尊。说其<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>普使闻知</p><p>尔时佛告除疑大士。汝今大慈无量愍念罪苦。欲令一切眾生得解脱知见无碍智慧。乃能于此此大眾中显发如来智慧祕藏。自得利益复利眾生。汝等大眾默念諦听。吾当為汝宣<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>要。善男子。三毒箭者。非有非无。<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>有故名為非无。五阴空故是名非有。痴爱欲是也。世间之物既不可得。妄生取心。名之為痴。本是己物。捨离以去。妄生追念。名之為爱。贪著女色。名之為欲。以此三心乱起即名凡夫。地狱人痴心是麴。爱心是米。米麴相和遂成欲酒。饮酒醉故不识翁母兄弟共相杀害。名之為害。以无慈故。断<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>种性。彼我取捨分别名為五辛。以其臭故。污眾生身田。障我慧水久不得出。故言不共一国同住不共一河饮水。汝之所作不与我同。即是彼心。自谓。己作微妙胜他即是我心。法性非闻妄生听受即是取心。法无动摇妄生<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>即是捨心。法性空寂无体妄生异相即是分别。以是故名為迷子。不得出世。名世间有為眾生。说是语时。一切大眾默然信受。善男子。痴心是种。爱心是土。种来入土。降注欲雨无明根本于兹生矣。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>不去痴爱。喻如伐树不去其根。名為株杌。枝条因株杌而生。有长成大树。世间愚痴之人亦复如是。一切烦恼因痴爱如起。遂成我慢疑惑。黑闇託斯弘矣。遂成三障无明堀宅。此之是也</p><p>尔时除疑大士。承佛威神。从坐而起。整理衣服。告诸大眾。我从往昔无量阿僧祇劫。于定光佛所得闻此句。奉持修行。未曾疲懈。今复得闻如上章句。心意快然。得未曾有方。乃始知大圣如来慧光三有广起法门以纳诸子。乃使邪魔归真。六师渐没方便造十二法船以济危厄。皆令发无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>之心。以昇八正涅槃之路。但一切眾生愚痴迷惑信邪背正。睹文取真与性义乖隔。徒劳无用。如车之隻轮。岂可乘之哉。正可声同嚮合未会真諦。如斯之徒甚可哀矣。痛哉苦哉。后悔何及。佛言。善哉如汝所说。真实不虚尔时除疑大士蒙佛印可。即于眾中以偈讚问</p><p>我观如来真妙身清净无垢如莲华</p><p>智慧方便虚空等解脱无碍能开遮</p><p>神通<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>无边际等视一切无偏耶</p><p>我今稽首大慧明愿入无相义空寂</p><p>唯愿為我方便说令除疑惑得惺悟</p><p>一实难知真法性必為现形使知处</p><p>哀愍我等诸迷子普為大眾广分别</p><p>敷演甚深真实义震大法雷為我说</p><p>尔时世尊。即為大眾欲重宣此义。而说偈言</p><p>三界说眾生恒為五阴缚展转三有中</p><p>不得解脱乐亿劫受新苦由有五阴身</p><p>不睹真如性是名生死人常為三毒射</p><p>心热如火然处处皆不安烦恼自相缠</p><p>往返五道中忧愁寧可陈三涂為舍宅</p><p>枷锁禁其身由此三毒箭害我智慧身</p><p>出入不自在云何能见真痴心以為麴</p><p>爱心是其米痴爱欲相合饮者醉不解</p><p>旷劫不惺悟由此三毒酒迷闇失正道</p><p>沈没著三有恒自心昏乱浊酒未得呕</p><p>不值善知识昌狂闇中走见佛不识真</p><p>坐生我慢垢分别心不净由饮无明酒</p><p>痴心是闇种爱心為惑土闇惑相对值</p><p>烦恼由此聚无明根本生皆由贪欲雨</p><p>剎那作枝叶灭须智慧斧伐树不去根</p><p>树性未尽源枝条因根生花果转滋繁</p><p>诸见為子实贡高是墙垣绞假相恃护</p><p>真身被愚吞三毒為根本烦恼亦复然</p><p>除却株杌尽名之為良田菩提牙得生</p><p>由无根株故拔除三毒箭身得安稳处</p><p>痴麴不施用爱米捨置地欲酒既不成</p><p>必获大明慧心空相亦尽智慧思修来</p><p>二帝空无相身处光明臺炎赫如火聚</p><p>光照狱门开无碍不思议应身成如来</p><p>我本行如是今得离三灾安住不动地</p><p>验成人天最汝当懃行此最后必相值</p><p>来世成正觉如我亦无异</p><p>尔时除疑大士复白佛言。世尊云何眾生在于世间。四毒蛇所嚙。其状如何為可识不。唯愿世尊為我解说。令无目之徒得勉此难。佛言。善男子。疽恚嫉妒是也。世尊疽恚嫉妒何心是也。而名之為蛇。佛言。不用他好。名之為疽。瞋不出口。名之為恚。恐人胜己。名之為嫉。见他善不用障其美。名之為妒。此四毒蛇在意井中。嚙断善根闷绝而死。堕落三涂受其大苦。尔时如来说是语已即入<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。从三昧起放大光明。普照三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。一切大眾皆见光明。异口同音问除疑大士言。世尊放光异于常明。昔日放光。先照东方。今日放光。四面一时普照十方。以何因缘如有此瑞。唯愿仁者為我解说。尔时除疑大士告诸大眾。我闻如来慧光长夜应同三有。口吐法药救疗眾病。乃使<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>永息。毒蛇隐穴。迷悟真途生死殄拔。三涂变成涅槃之宫。愚闇改為大明种智。改疽為慈。改恚為悲。修嫉為喜。变妒為捨。即成四无量心。名為智慧门。亦名智慧井。将知此光正是如来大慈智光照。狱门开欲令失道眾生寻光得乐。曾闻如来初说九部经有為<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。喻如呼师瞻地置井。未知水之甘苦。一切眾生亦复如是。若见佛性名為甘水。不会空宗名為苦水。用功等力劳如无用。声闻之人亦复如是。修道之人喻如掘井。渐渐却土。土尽水自然现。眾生亦尔。除去五阴烦恼得尽。佛性自然而出。虽得甘水而无方便井。无塼累必為沙土所奔。不久水乃竭尽。名為枯井。外道眷属亦复如是。然一切声闻初心菩萨。虽得除空而不广。习眾经而无方便。為烦恼所逼名為<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>。魔之眷属亦复如是。菩萨摩訶萨心<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>故。无碍方便為作井。累水即澄清名萨婆若水。用无穷尽名智慧水。能洗心垢。万惑斯尽。眾恶所不能害。烦恼生死不能染污。以是因缘名萨婆若海。亦名智慧海。海中不容死尸。此之是也</p><p>尔时佛告除疑大士。汝善解我意。汝于我灭度后在于大眾中。能施人眼广济群盲。救疗眾病。续人慧命。当于来世于阎浮提成等正觉。号明法王如来应供正遍知明行足善逝世间解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊。当尔时汝出于世。地皆清净无诸秽恶。食自然亦无苦恼。地狱休息。饿鬼饱满。温和调适。四时顺序。畜生改形亦无男女。高下齐平兀无沙土。金银颇梨琉璃珊瑚真珠珍宝以為家具。纯一无杂。游行自在。犹如虚空。广大无对。若见此经<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵书写<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>者皆值汝出世得大安乐。是故汝当受持流布世界莫使断绝。何以故。一闻是经乃至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>不堕三涂以是之故恶道减少。若有见闻如说修行。<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>忍辱持戒不懈续。于汝后亦得作佛。汝当在在处处广宣流布。此经威力不可思议。所至到处恶病除愈。至心受持所求之事无不获得。哑语癖行盲视聋听。身根具足出入无碍。辩才多能。七珍盈满。光明显赫。超世殊特。荣贵自然。乐无忧戚。此经最胜无上法味。求男得男。求女得女。至心敬信无不从意。若复有人轻呰不信。或不恭敬。以不净手捉弄是经。诽谤挣论。以无义语调戏譬喻。如是之人现世得得盲病身根不具。或复口哑耳聋鼻塞。父子分离波迸他土。役力自活為人所使。飢贫顿弊处处恐惧。受苦命终。当堕黑闇地狱八百万岁。然后得出常生下贱。五百世中不闻三宝名字。此人命终已后当受鱼身。经歷十大劫。是故汝等善作方便引喻。莫令诽谤。為智者说莫為愚者施。愚者闻不能解。必生诽谤。现受大苦。死入恶趣。汝失慈悲不名大士。尔时除疑大士為诸大眾及自己身。欲重决疑。以偈问佛</p><p>我观如来身清净如虚空辩才智无碍</p><p>见者无不敬方便智无量能慧眾<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a></p><p>我眾皆疑惑愿為说究竟四毒已得闻</p><p>云何离此病為我广分别昏迷乃可惺</p><p>四毒正是心云何可得除若不除此心</p><p>世尊云道病本心更无二云何更作心</p><p>前心次后心心心云何除一心复二心</p><p>三心忽然至如是心境界广大如虚空</p><p>世尊遣我除不知云何除哀愍大眾等</p><p>必当為我说</p><p>尔时佛告除疑大士言。善男子。汝是大士。愍念后代眾生。作如是问。汝当諦听。及诸大眾善思念之。吾当為汝分别解说。善男子。当行十法游于三界则无四毒。问曰。何者為十。佛言。一者于誉于毁心无增减。二者上中下眾生意常平等。三者于诸愚智起以大悲。四者轻毁供养心无有二。五者见善闻恶心无分别。六者见他闕失莫见其过。七者见种种乘皆是一乘。八者闻三恶苦亦莫惊怖。九者观一切眾生作如来想。十者佛出眾生中作希有想。故言心泆难禁制。喻如猿猴游戏。六根遍缘诸处。以是之故心乱不静波浪。三界受其生死。制心不放逸。喻如猴著琐。繫心在一处。能开智慧门。善男子。四毒心如水。身者喻如墙。水渐浸之。墙则崩倒。眾生亦尔。四毒在心。渐渐渍之。身则败坏。诸佛菩萨能捨离故得<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>身。善男子。四毒蛇者喻如火。身者喻如草。修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>喻如刈草。持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>不缺者得人身。刈草不闕者必获多草。眾生亦尔。修善不懈必得人天。大火一起。焚烧草聚。须申之间尽失无餘。一切行者亦复如是。四毒恶火一发之时。烧我智慧身命。悉皆磨灭。诸佛菩萨能远离故。智慧法身常住不灭。善男子。汝向所问正得其义。我今所答不失其时。利益无量眾生。开阐道教。济诸群盲。令出三有到于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。尔时世尊欲重宣此义。而说偈言</p><p>我观三界有冥寂尽无形起灭如水泡</p><p>水泡本不二水若不动时泡体本不现</p><p>泡现还复灭与水本无异佛性如虚空</p><p>因空如生有因水如生泡泡体是空有</p><p>空有无二形水泡不一二现泡则二形</p><p>泡没还归一有心则有身空有不二一</p><p><a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>则不二全心则不一身有生有心</p><p>歷劫不同一有心万象应象应则放逸</p><p>淫欲从此生四毒因斯有弥轮相惑中</p><p>闇中波浪走以是因缘故不能离诸有</p><p>我今為汝说会当除阴垢阴垢既得尽</p><p>诸垢不名有有体因有身是名诸有垢</p><p>有垢无相空空者体是有有空有无一</p><p>故能无一二虚空无碍故应作无量形</p><p>无心名菩萨有心名眾生无心亦是心</p><p>有心亦是心有心不见心无心是泥洹</p><p>有心即见心不名泥洹心无心见无心</p><p>无心是有心有心有心故是名非无心</p><p>无心无心故不名為无心不见有无心</p><p>不住不有无不住不来去不离于来去</p><p>无心非无心有心非有心住是如如心</p><p>四毒则无病</p><p>尔时除疑大士复白佛言。世尊向来蒙佛為我演说。四毒已讫心生欢欣无量信敬。身意快然得未曾有。复欲请问。举身毛竖身心战惧不敢发问。我所问者不自為己普為一切大眾并及后代无量无边眾生。我闻是已。当自受持。天上人中僧房眾中白衣居处皆令闻知。唯愿听许。乃敢发问。佛言。善哉善哉。汝今所言正。是大士我本往昔。每恒发如是愿。作如是问。修如是行。于<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>中学行。难行苦行无所不作无所不為。如是不可思议皆為一切眾生。今得作佛。汝所愿者亦复如是。今咨汝问。当為说之</p><p>尔时除疑大士。蒙佛许可从坐而起。整理衣服。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>恭敬。于大眾中恭敬而立。如师子王。合一指扴掌。一切大眾皆悉如是立而白佛言。云何名為五狗之所盗。為可见不。唯愿说之。愿乐欲闻。佛言。慳贪痴恶狗是。问曰。為我分别解说。令一切眾生皆悉闻知。佛言。不能捨于诸有。名之為慳。所欲无厌。名之為贪。妄生规度。名之為痴。不识实性挣论取胜。名之為恶。未得无生妄拒三涂。名之為[仁-二+崖]。慳狗入舍则失珍宝。贪狗入舍则被繫缚。痴狗入舍则堕生死。恶狗入舍则坠地狱。[仁-二+崖]狗入舍则永失人身。善男子。譬如一人家贫顿乏无有方计。遥闻他方有一七宝山。其山之下有七宝池。若人至彼多获七宝。若入池者身则安隐。则无老病死苦。饮此水则不飢不渴。身则无碍。飞腾虚空。从意自在。人闻是已事其粮食欲诣彼山。假贷作辨。得米五升蒸炒。中半不加谨慎。為狗破瓮食米荡尽。一切眾生亦复如是。持戒不加忍辱。恶贪慳痴入其心舍。破器食米荡尽更无所食。名法饿眾生。故言痴狗夜入人舍。遣婢把杖驱之令出。此之是也。闻善即信。名之為米。受持不妄。名之為瓮。下下之心。名之為婢。忍恶不报。名之為杖。不受<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之言。名為驱出。无明故名之為夜。五戒名之為米五升。若一切眾生不持五戒者。则不能到于彼岸。一人者喻一切眾生。贫穷喻少法之财宝。遥闻者喻<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>不解其义。山者喻如来身。七宝者喻于诸法。池者喻于智慧。粮食者喻于万善诸行。慳狗死尽得见佛性。贪狗得死身则常住。痴狗得死有无平等。恶狗得死和合同一永无挣论。[仁-二+崖]狗得死则一生补处。尔时除疑大士蒙佛所说。心疑不决。以偈问佛</p><p>如来向所说事事无不实如是诸境界</p><p>我实未能了心不了达故处处皆有疑</p><p>我今虽复问大眾亦如之我若不发问</p><p>眾中皆不解唯愿天中天為我广分别</p><p>五心若起时為从何所出五心前已出</p><p>何心如能灭若当更作心即有六心出</p><p>前五后复一云何可得绝绝心还是心</p><p>除六复生一三世现前后何日得见佛</p><p>我若本应是不须除此心此心以是防</p><p>云何更作心此心不须除即应是涅槃</p><p>云何须修治生心即是病有心即病心</p><p>我今不须修修者遮修心云心是大病</p><p>我若允不修不名出世人欲求出世故</p><p>捉心即是病如是难知见我实未能知</p><p>本若无心是不应遣我修不修是波浪</p><p>云修复作病我今如盲聋处处知有碍</p><p>避火入深坑亦无利益处如猴爱悕胶</p><p>五处皆缠缚唯愿佛世尊為我解绳索</p><p>广说令惺悟获得解脱乐</p><p>尔时世尊。告除疑大士。汝非不解。慈愍一切眾生故。能如是问。汝当諦听。我当為汝说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>要。善男子。一切眾生妄起颠倒。為颠倒故系五阴有。五阴有故则有身心。身心有故则是繫缚。繫缚故处处皆病。今為汝等广说诸法。以除有病。善男子。譬如幻师。于大眾中幻作白马。使人乘之。愚痴之人谓乘白马。幻师<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>从后视之。知两足著地本无白马。如来世尊亦复如是。以慈悲故影现有形。凡夫之人谓五阴是实。菩萨大士亦如幻师弟子。从眾生后睹如示之。知本无五阴。以是之故有者皆病。善男子。譬如镜中有人面像。婴孩小儿谓為是面以手模之。本无面体声闻之。人亦复如是。以狭劣故谓五阴实。菩萨大士以智手模之。知空无五阴。善男子。譬如烛中如□人影。愚痴小儿谓。是活人将身避之。随身如去影不离身。身不离影。诸佛菩萨亦复如是。以慈悲故影现。下方无目之人示。不分明见影故谓。是真身妄继為我。真身无碍。身去影没故唱言道死。真身常住犹如虚空。以虚空故则无灭没。无灭没故则无去来。无去来故则<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>住。无常住故则无动乱。无动乱故则无寂静。无寂静故则无记心。无记心故则无所定。无所定故无所不定。无所不说。无所不作。无所不為。如是不可思议名无碍智。尔时世尊欲重宣此义。而说偈言</p><p>我法妙难思方便随宜说幽玄极空寂</p><p>冥莫是难知去来随心游澄静体真凝</p><p>二乘所不睹何况凡天人如母教子语</p><p>先学其子言诸佛亦如是随慎眾生根</p><p>机根有高下随顺与谈论深浅逐性受</p><p>真业著因缘本自无二境為度有出世</p><p>世间与出世二世本无别世间在世间</p><p>不识于世间唯有出世间乃能别世间</p><p>虽出于世间亦不离世间俱在于世间</p><p>不行世间道所以俱世间欲度世间人</p><p>若不入世间无以出世间若行世间时</p><p>亦无世间心故能入世间同行世间行</p><p>能出于世间故能入世间不能入世间</p><p>不名出世人世间行世间不能出世间</p><p>常行在世间故名世间人世间行世间</p><p>不知是世间贪著世间行故不出世间</p><p>菩萨行世间了知世间相世间虚空相</p><p>虚空亦无相是故俱世间不坏世间法</p><p>虽入行世间如华不著水世间出世间</p><p>无异于世间行同凡夫行亦当似世间</p><p>同异亦异同无同无不同异同相尽法</p><p>同异凡夫同眾圣则异同能同凡夫异</p><p>凡异不能同凡同不能异同凡之所异</p><p>本自未曾异异圣之所同无异何所同</p><p>无异无不异无同无不同无相空寂体</p><p>无同亦无异譬如镜中面同中亦有异</p><p>离镜无面像是名异所同虽镜有面像</p><p>面亦不入镜是同所不同同体未曾同</p><p>譬如地中水体同能為异或作酒[米*(止/少)]浆</p><p>味异体不二或入緋紫黄青异色殊别</p><p>种种诸形相色异未曾同体一相殊别</p><p>眾形尽归如冥心相累灭应行同凡夫</p><p>如是难知法非<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>能知非心非相中</p><p>非凡所能闚為凡说有心令使少分知</p><p>若见心相者即应不住心若在心中住</p><p>住心非真心真心无心所云何久处心</p><p>若不处心者云何道无心无心是波浪</p><p>著心即是病非住非不住非同非不同</p><p>非无非不无非有非不有非异非非异</p><p>非心非非心无无无有异无住无同心</p><p>非见非非见非说非非说非色非非色</p><p>非知非非知非非非非非非是非非是</p><p>非不非非不非修非非修非见非说说</p><p>非色非知知非非非是是非不非修修</p><p>我今如是说汝当如是解无说无解者</p><p>有心亦无病</p><p>尔时除疑大士复问佛言。世尊云何名六贼之所怖。其名云何。為可识不。佛言。善男子。六贼者耳眼鼻舌身意是也</p><p>尔时坐中有一<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。名曰迦难罗。<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>定智慧。所作已辨。无求无欲。于大眾中生慈愍心。从坐而起。白佛言。世尊我所有疑亦不可说。若不发问必起五逆罪。所以者何。如来自说。我是一切眾生父。一切眾生即是我子。不审世尊实尔已不。佛言。真实不虚。迦难罗比丘言。我闻是语。倍更增疑。我若不问眾亦如是必致疑网。譬如一人多饶子息居家臣富多。诸珍宝奴婢牛羊象马驴骡金槃铜案琉璃颇梨珠珍瓔珞穀麦来豆丰盈具足。其父如是。子亦名富。云何世尊為大富长者。一切眾生如名穷子。以是之故心中致疑。唯愿世尊為我解说。佛言。善男子。汝今所问自得决疑。复利眾生。汝当諦听。吾当為汝分别说之。善男子。譬如有人唯有一子。爱之甚重。不问昼夜。及以坐卧心恒忧之。恐人损伤。子亦不知父心爱惜。我亦如是。怜愍眾生。昼夜防护。不令近恶眾生。愚痴与贼人為友。行住坐卧不相捨离。我爱子故。恐贼贪财损子身命。所有珍宝尽著地中。汝不见故之无所用。无财故名為穷子也</p><p>尔时四依菩萨。闻说是语。同声白佛言。如来向说耳眼鼻舌身意為贼。云何如能灭人身命。唯愿為我分别说之。佛言。善哉。汝当諦听。吾当為汝分别解说。善男子。耳识信受声。妄闻有善恶。攀缘乱诸境。丧失禪定慧。破汝无為家。是名第一贼。眼识观好色。淫泆由此兴。荡姿六欲海。致生瞋怨怒。挣讼乱真境。不生禪定解。破汝无為家。名為第二贼。鼻识嗅香气。触乱长十恶。诸根由此动。不得禪定味。外拘恶知友。破汝无為家。是名第三贼。舌识贪五味。妄说是非事。諭謟斗乱人。致生怒怨恶。念念相觅便。杀害日夜增。丧失定慧命。破汝无為家。是名第四贼。身识染细滑。乐著于女色。恩爱由此起。恐畏他人触。相要如胶染。口说无真义。昼夜相忆念。则忌禪定慧。破汝无為家。是名第五贼。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>多攀缘。不住如阳炎。姦滑相规度。曾无一念善。忧喜无常定。往返逕万处。戒定智慧失。皆由此识。破汝无為家。是名第六贼。亦名六师。亦名六国。尔时迦难罗比丘。闻说是已。心生踊跃。欢欣而立而白佛言。世尊我今眾等将大遭遇向者唯问六贼心。尚惊疑已蒙说讫。今复世尊為我广说六师并及六国。身意快然。得未曾有。唯愿世尊。说其法要。迦难罗比丘恐佛不说。以偈请问</p><p>世尊大智炬能照闇冥处我本所不见</p><p>令说使开悟旷劫无原来谓贼是為善</p><p>今蒙世尊说如树果繫折铁爱垢消形</p><p>臣姦国将灭我爱贼如是愿与贼永绝</p><p>蒙佛说已讫<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>心无量复闻名六师</p><p>不解心畅怏亦名為六国心中倍增疑</p><p>我今请世尊必為我说之</p><p>尔时佛答迦难罗比丘言。善男子。汝今问者愍诸眾生沈轮相。惑迷于五阴不得解脱。作如是问。汝今諦听及诸大眾善思念之。吾今為汝广开分别。善男子。何以故名之為师。施為举动则诸方随之迭护相导皆成謨轨。以是之故名之為师。佛自说言。我今成道六师投海。耳如禪定不听丝竹。目如望舒不盻美。□□□嗅香。舌不说是非。身不贪细滑。意不□□□恶。以是因缘名為投海而死。何故名為六国。处境界各自秉执不相臣属。施為法用。各有所据。以是因缘名之為国。明法王出世之时。降此六国乃登正贤。六国知识同归一处。故言六国善知识合同一家。此之是也。若言恶心难禁制。如马驰。恶道没在烦恼军。若人马不调。忍辱為[革*必]勒。此人马调顺能破烦恼军。尔时大眾闻说是语。皆悉低头。默念思惟。皆获心定忍。佛言。善男子。若降得此贼。则四怨大贼亦复不来。即得不生不死不老不病不飢不渴。湛然常住。地中伏藏。从地涌出七珍宝物。随意任用。周穷济乏。用无穷尽。名如来藏。亦名无尽藏。亦名金刚藏。<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>满足胡言阿罗汉。秦言杀贼。今人<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>时弹指。此之谓也</p><p>尔时世尊欲重宣此义。而说偈言</p><p>可怜三界人昏痴无所知不别善以恶</p><p>与贼长相随劫窃善财宝飢贫无所依</p><p>役力执懃苦得物共分之谓是善知识</p><p>毕竟不生疑外补中里恶兼复作歷疷</p><p>财物荡已尽四远拘贼来破汝涅槃舍</p><p>毁坏光明臺分张身良田丧失男女妻</p><p>夫妇不相见离乡作他财假他外境人</p><p>依复作父母昼夜相承时飢饿不辞苦</p><p>如是破亡者族族皆同聚男女不同处</p><p>名离恩爱苦逕年复歷岁皆由此六贼</p><p>今日為说之汝信莫疑或我除成正觉</p><p>汝除成<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>除者皆获利不除无福德</p><p>忆念往昔日伏心求菩提歷劫修苦行</p><p>奉事此六师虽复名<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>实与圣理乖</p><p>形细如心麤贪求著色财迷于正宗理</p><p>疾恶如狼豺毁禁坏方等六师争竞来</p><p>引我入恶趣说言无如来毕竟过去世</p><p>自说天人最我来随顺奉昏闇转不开</p><p>冥寂失正路久受生死灾悟会定光佛</p><p>身处光明臺炎赫如金山空中震法雷</p><p>大音遍虚空光照狱门开天魔自降伏</p><p>外道归化来六师投海死六国空无主</p><p><a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>定光佛住在空中语我始得见佛</p><p>永断生死苦即与我受记汝為眾生父</p><p>号名為释迦得作天中尊常住不变易</p><p>永除无四怨一切成佛者皆当由此门</p><p>汝若如是除亦得天中尊</p><p>说是偈已。有多宝佛塔。从地涌出。高七十万由旬。纵广正等。去地亡多罗树。于虚空中凝然而住。百宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。诸树行列。鼓舞絃歌。种种伎乐。微风徐动。吹诸林木。出微妙音声。真珠罗网弥覆宝塔。下有一宝池。与宝塔正等。其池四岸有种种名华。所谓忧懵藁?形锿坊?ㄍ纺??滞永??H艏?λ?厮?摺5梅ㄑ劬弧5靡??摺5梦奚?ㄈ獭:慰鋈胫卸?孟丛</p></div>"
}]