[{
    "title": "净名经集解关中疏 第2777部",
    "author": "道掖",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>﻿净名经集解关中疏 卷上</p><p>中京资圣寺<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>道液集</p><p>昔汉明中法教始流于葱左肇建塔像翻译尚阻。爰及魏晋创硲宣传而所出诸经犹词疏理蹇。盖习学者未融于大观。传译者闕通于方言。既為大法浸微未可量其得失。自秦弘始三年冬罗什入关。先译大品智论爰及<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>门百使陶染至理。然后重译兹经及法华等。所以文切理诣无间然矣。曰者传习多疏道尚学以胆异端致使大宗芜蔓真极。而关中先製言约旨深将传。后进或惮略而难通。盖时移识昧。岂先贤之闕歟。道液不揆庸浅。輒加脾广净名以肇注作本。法华以生疏為凭。然后傍求诸解共通妙旨。虽述而不作终。愧亡羊者哉。于时上元元年岁次困顿永泰初祀。又于长安<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>道场夏再治定庶法镜转明惠灯益矣</p><p>维摩詰经序</p><p>释僧肇作</p><p>维摩詰不思议经者。盖是穷微尽化妙绝之称也。其旨渊玄非言像所测。道越三空非二乘所议。超群数之表绝有心之境。眇莽无為而无不為罔。知所以然而能然者不思议也。何则夫圣智无知而万品俱照。法身无像而殊形。并应至韵无言。而玄藉弥布冥权无谋而动与事会故。能统济群方开物成务利现天下于我无為而惑者睹感照因谓之智观。应形则谓之身覿。玄藉便谓之言。见变动而谓之权。夫道之极者岂可以形言权智而悟其神域哉。然群生长寝非言莫晓。道不孤运弘之由人。是以如来命文殊于异方召维摩詰于地土爰集毘耶共弘斯道。此经所明统万行则以权智為主。树德本则以<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>為根。济蒙惑则以慈悲為首。语宗极则以不二為言。凡此眾说皆不思议之本也。至若借座灯王请饭香土手接大千室包乾像不思议之迹也。然幽关难啟圣应不同。非本无以垂迹。非迹无以显本。本迹虽殊而不思议一也。故命侍者标以為名焉。大秦天王[倠/乃]神超世玄心独悟。弘至治于万机之上扬道化于千载之下。每寻翫兹典以為栖神之宅。而恨支竺所出理滞于文。常恐玄宗坠于译人北天之运运通有所在也。以弘始八年岁次鶉火命大将军常山公。右将军安城侯与义学沙门千二百人于长安大寺请罗什法师重译正本。什以高世之量冥心真境既尽环中又善方言。于时手执胡文口自宣译。道俗虔虔一言三复陶冶精求务存圣意。其文约而诣其旨婉而彰。微远之言于兹显。然余以闇短时预听。次虽思之参玄然麤得文意。輒顺所闻為之注解略记诚言述而不作庶。将来君子异世同闻焉</p><p>维摩詰所说叡曰。夫经或以人為名。或以法名者。自非佛所说。多随人為名。佛之所说非唯一经。故随所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>以為名。此经总人法二名者。以人為名则明法之所由。以法為名则略经之大体。所以两存耳什曰。维摩詰秦言净名。即五百童子之一人也。从妙乐国来游此境。所应既周将还本土。欲显其淳德以泽群生。显述悟时要必有由。故令同志诣佛而独不行。独不行则知其疾也。何以知之。同志五百共遵大道。至于进德修善动静必俱。今净国之会业之大者。而不同举明其有疾。有疾故有问疾之会。问疾之会由净国之集。净国之集由净名方便。然则此经始终所由良有在也。若自说而观则与圣齐。功推本而寻功由净名。原其所由故曰维摩詰所说也肇曰。维摩詰秦言净名法身大士也。其权道无方隐显殊迹。释彼妙喜现此忍土。所以和光尘俗因通道教。常与宝积俱游為法城之侣。其教缘既毕将返妙喜。故欲显其神德以弘如来不思议<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>之道。至令宝积独诣释迦。因留现疾以生问疾之端。建微言之始。妙唱自彼故称其说也生曰。维摩詰者<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>无垢称也。其晦迹五欲超然无染清名遐布。故致斯号。贵名求实者必重其说。说本表实重之则终得所求。因斯近接有过圣言矣经梵云。修多罗此译云契。谓契理之言当根之教。返迷证实。万圣同规。亦曰。為常故。肇师云经常也。古今虽殊觉道不改。群邪不能沮。眾圣不能异也</p><p>一名不可思议解脱此约法受名也。下文云。佛為增上慢人说离淫怒痴為解脱。若无增慢者淫怒性。即是解脱此谈体也。或就悲愿处染不染非道通道。此约用名之。以昔教权引三乘言同解脱。今将返权归实。故特号不思议也。即大经百句解脱华严诸善知识解脱皆同此也什曰。亦名<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。亦名神足。或令脩短改度。或巨细相容变化随意。于法<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>解脱于阂故名解脱。能者能然物不知所以故曰不思议。亦云。法身大士念则随应不入禪定。然后能也。心得自在不為不能所缚故曰解脱也。若直明法空则乖于常习无以取信故。现物随心变明物无定性。物无定性则其性虚矣。菩萨得其无定故令物随心转则不思议。乃空之明证将显理宗故以為经之标也肇曰。微远幽深二乘不能测不思议也。纵任无碍尘累不能拘解脱也。此经自始于<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。终于法养。其中所明虽殊然其不思议解脱一也。故总以名焉。上以人名经。此以法名经。以法名经所以标牓指归。以人名经所以因人弘道者也生曰。无垢之称或止形迹心不安然。故复言其解脱。更為一名不可思议者。凡有二种。一曰。理空非惑情所图。二曰。神奇非浅识所量。若体夫空理则脱思议之惑。惑既脱矣则所為难测。维摩詰今动静背神奇必脱诸惑。脱惑在乎体空。说空是其所体。是以无垢之名信而有徵名。苟有徵其求愈到。到于求者何患不悟乎叡曰。菩萨<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>应物有说。眾生但睹其教莫测所由。故名所说為不思议。虽说而无心故不阂于有。虽无心而能说故不阂于无。空有所不能累故名之為解脱</p><p>佛国品第一</p><p>什曰。经始终由于净国。故以佛国冠于眾篇也。真应二土会以平等。广如下文。然十四品经大分三别。初此品半為未信令信故名序分。次十一品半信已令悟故名正宗分。三后二品尽经悟已应传名<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分。初序分中复有三别。初列时方处等。是集经者引事证信。次合盖现土。是说经者骇物令信。后称叹讚扬。是问经者使仰德生信也。初文又六。一信经辞。二传经旨。三闻经时。四说经者。五听经处。六闻经眾</p><p>如是此初信经辞也。肇曰。如是信顺辞也。夫信则所言之理顺。顺则师资之道成经无丰约。非信不传故建言</p><p>如是我闻此二传经旨也。肇曰。出经者明己亲承圣旨无传闻之谬也</p><p>一时此三闻经时也。眾生信重為感如来悲愿為应道交故曰一时。肇曰。法王啟运喜集之时也</p><p>佛此四说经者。梵音云。具言佛驮。此翻為知者。大品云。知诸法实义故。大论云。菩提名智。佛名智者。是即解圆德备言诚物信也</p><p>在毘耶离此下五列听经处。有通有别。通為远者知别為近不谬。此初通处。肇曰。毘耶离国名也。秦言广严。其土平广严事因以為名。又云。好稻土之宜也</p><p>菴罗树圆别处。肇曰。菴罗树名也。其果似桃而非。先言奈氏失也。事在他经。园者住处之通称。梵云僧伽蓝摩。此云眾园。言伽蓝者略也</p><p>与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>眾八千人俱此下六列同闻经眾证非己谬传眾有三别。初列声闻。形心俱胜证信最亲故先列也。次列菩萨。心同形异证信小疏故次列也。后列天龙。形心俱乖证信最疏故后列也。初列比丘与者共也。大即极果比丘人名眾言和合。肇曰。比丘秦言或名净乞食。或名破<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。或名能持戒。或名能怖魔。<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>一名该此四义。秦无一名以译之故存其义名焉</p><p>菩萨此下二列菩萨眾。文五。一举名。二辩数。三叹德。四列名。五总结。此初也。肇曰。菩萨正音云菩提萨埵。菩提佛道也。萨埵秦言大心。眾生有大心入佛道也。谓以大悲智无边<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>為物求道故以名之。什曰。大士凡有三种。一者<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。二者在家。三者他方来。复次一者结业身。二者法身也。此中菩萨多是法身。然应感之形与物同迹。物或齐其所见。而生劣想故举大数。然后序德也</p><p>三万二千二辩数也</p><p>眾所知识此下三叹德也。文三。初总叹。次别叹。后结叹。总叹又三。此初叹外化也。闻名钦风為知睹。形饮化為识。肇曰。大士处世犹日月昇天。有目之士谁不知识</p><p>大智本行皆悉成就二自行也。大智叹解本行叹行。肇曰。大智一切种智也。此智以六度六通眾行為本。诸大士已备此本行</p><p>诸佛威神之所建立三结释也。肇曰。天泽无私。不润枯木。佛威虽普不立无根。所建立者道根必深乎。叡曰。凡有二种。或以神化所加令其暂悟名為建立。或以妙法啟心化之同已亦名建立</p><p>為<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>城<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a><a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>此下二明别叹文三。初约护法叹。次约<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>叹。后就近果叹。初文又三。谓护法。护人。结释。护法复二。此初叹修因也。肇曰。外為护法之城。内有受持之固也。什曰。法城即实相法也。使物无异见故言护也。复次一切经法皆名法城。护持宣布令不坏也。有能持正法亦兼护之也。叡曰。真理為法文字為城。城堑固则内不害。文字存则理不亏也</p><p>能师子吼名闻十方二叹功成也。肇曰。师子吼<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>音也。凡所言说不畏群邪异学。喻师子吼。眾兽下之行满天下故称无不普</p><p>眾人不请友而安之此二叹护人。亦二。此先叹心也。肇曰。真友不待请。譬慈母之赴婴儿也</p><p>绍隆<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>能使不绝二叹功圆也。肇曰继佛种则三宝隆。非直显明三宝。宣通经法之谓也。谓能积善累功自致<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。成佛则有法。有法则有僧。不绝之功事在来劫。今言不绝则必能也。又于其中间自行化人。人亦化物。物我俱成三宝弥兴。眾生无尽故宝亦不绝也</p><p>降伏魔怨制诸外道此三释叹。肇曰。魔四魔也。外道九十六种外道也。天台云。禪定伏爱得通。以降眾魔智惠破见。发辩以制外道。如问疾品明</p><p>悉以清净此下二叹修行文。即二别自行化他也。前自行复二。初叹断德。后叹智德。断德文三。此初总叹也</p><p>永离盖缠二别叹也。肇曰。盖五盖。缠十缠。亦有无量缠。身口意净三业悉净则盖缠不能累也。五盖者。一贪欲盖。二瞋恚盖。三睡眠盖。四掉悔盖。五疑盖。初<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>戒。睡眠障惠。掉悔障定。疑障解脱及知见。十缠者无惭无愧慳疾悔眠掉举惛沈及忿覆也。叡曰。凡夫止结暂灭还生。二乘难灭证处由存。大士了虚情尘俱寂灭处尽根生无所寄。法身居然不论故云也</p><p>心常安住无碍解脱三结叹也。什曰。不思议解脱即其类也。于物无碍故名也肇曰。七住所得得此解脱则于诸法通达无阂故心常安住</p><p>念定总时辩才不断此下二叹智德亦三。此初总叹也。肇曰。念<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。定正定。总持持善不失持恶不生。无所漏。念谓之总持辩才七辩也。大论云。一捷疾辩。二利辩。三无尽辩。四不断。五随应辩。六义辩。七<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>最上辩。此四。是大士之要用故常不断。叡曰。念不忘则惠逾增。定不捨则心常一。持善不失则强忆识而恶不生。辩不绝则化无阂备。此四门可以官府万行故曰也。什曰。菩萨得此四法也。深入坚固经身不失。歷劫逾明故言不断也</p><p><a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒忍辱<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>禪定智惠及方便力无不具足二别叹智德。肇曰。具足谓<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>行也七住已上心智寂灭以心无為故无德不為。是以施极于施而未尝施。戒极于戒而未尝戒。七德而殊功其相不异。乃名具足。方便者智之别用耳。智以通幽穷微决定。<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>无知而无不知谓之智也。虽达法相而能不证。处有不失无。在无不捨有。冥空存德。彼我两济故曰方便也</p><p>逮无所得不起法忍三约位结也。肇曰。忍即无生惠也。以能堪受实相故以忍為名。得此忍则于法无取无得。心相永灭。故曰无所得不起法忍也</p><p>已能随顺转不退轮此下二明化他行文二。初明内具化行。后明行化利物内行。复三。初明说法德。次明无畏德。后明名闻德。初说法文二。此初举堪能转不退。转不退轮。肇曰。无生之道无有得而失者不退也。流演圆通无繫于一人名轮也。诸佛既转此轮诸大士亦能随转也</p><p>善解法相知眾生根二释堪能随转。肇曰。诸法殊相无不解。群生异根无不知也。谓由知病识药故能随转也</p><p>盖诸大眾得无所畏此下二明盖眾无畏德文二。此初标也。肇曰。菩萨别有四无所畏。一得闻总持。二知眾生根。三不见能难已使不能答者。四随问能答善决眾疑。有此<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>故能暎盖大眾</p><p><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>智惠以修其心。相好严身色像第一。捨诸世间所有饰好此二释也。什曰。明备此德所以无畏。肇曰。心以智德為严。形以相好為饰。严心所以进道。饰形所以靡俗。亦為尊形者示严相耳。岂俗饰之在心也</p><p>名称高远踰于须弥此下三明具名称德。是即凡以名坏行。圣以名化物。文二。此初标也。肇曰。名自有高而不远。远而不高。前闻十方取其远。今踰须弥取高。高谓高胜也</p><p>深信坚固犹若金刚二释名高所以由信固也。肇曰。七住已上无生信不坏也</p><p>法宝普照而雨<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>此下二明正化益物文三。一明生善益。二明破恶益。三明获果益生善又三。此初标二喻。况说法应根普生物善也。肇曰。法宝光无不照。照痴暝也。泽无不润。润<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>也。喻海有神宝。能放光除暝。亦因光能雨甘露润枯槁也</p><p>于眾言音微妙第一二法合也。谓出世善言故称第一。肇曰。殊类异音既善其言而复超胜</p><p>深入缘起断诸邪见。有无二边无复餘习三释也。凡夫不了缘生故执无因邪因。二乘不了缘灭故滞<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。皆非深也。菩萨悟生非生。证灭非灭。使习俱亡故名深入。故经云。无无明亦无无明尽也。肇曰。深入為智深解也。解法从缘起则邪见无由生。有无二见群迷多惑。大士久尽故无餘习</p><p>演法无畏犹师子吼。其所讲说乃如雷震此下二明破恶益文二。初举二喻。二总结。又前喻破见。后喻破爱见。以迷理爱以滞事固其见则眾惑无由丧。縶其爱则善牙莫能发。故什曰。上明一切时无畏。此明说法无畏。上师子吼德音远振。此明能说实法眾咸敬顺犹师子吼威慑群兽也。又肇曰。法音远震开导萌牙。犹春雷之动百草</p><p>无有量已过量此二结叹。然智依理发。德与智冥理。智无边德何可量。肇曰。既得法身入无為境。心不可以智求。形不可以像取。故曰。无量六住已下名有量也</p><p>集眾法宝如海导师此下三明获果益文二。初标导师得宝喻也。六师邪导不获真果。八正利物必至涅槃故借喻焉。肇曰。导眾生入大乘海。采眾法宝使必获无难。犹海师善导商人必获夜光</p><p>了达诸法深妙之义。善知眾生往来所趣及心所行此下二释能导所以以具权智故也。智达深义能住菩提。权悟眾生往来如幻。所以悲利有情而物不能累大士之德。其在兹焉。故<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>云。智不得有无而兴大悲心</p><p>近无等等佛自在慧十方无畏十八不共此三明近果叹德也。文三。此初明自证也。肇曰。佛道超绝无与等者。唯佛自等故言无等等。所以辩其等者明一大道理无不极。平若<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。岂昇降之有也。自在慧者十力四无畏十八不共即其事也。大士虽未全具佛惠且以近矣关闭一切诸恶趣门。而生五道以现其身此二明化益文二。初明不生而生。后明应生利物。此初证无相故诸趣自闭不捨大悲而现生五道五道者三趣人天也。肇曰。法身无生而无不生。无生故恶趣门闭无不生。故现生五道</p><p>為大医王善疗眾病。应病与药令得服行二明所以应生非己业繫。但為利他作医王耳。肇曰。法药善疗喻医王也</p><p>无量功德皆成就此三总结叹也。文四。此初句正报满也。肇曰。无德不备</p><p>无量佛土皆严净二依报满也。肇曰。群生无量所好不同。故修无量净土以应彼殊好也</p><p>其见闻者无不蒙益三利物德满。肇曰。法身无形声应物故形声耳。岂有见闻而无益哉。叡曰。法身无身。无身故感而后应。感而后应则无应而不会。故使其见闻者无不蒙益</p><p>诸有所作亦不唐捐四自行德满。肇曰。功不虚设。叡曰。法身无為。為不由己為不由己则动无非时。动无非时故能诸有所作亦不唐捐</p><p>如是一切功德皆悉具足此三总结也</p><p>其名曰等观菩萨此下四列名。叡曰。此诸菩萨或以功行為名。亦有因相得称非唯一途。亦如今人字耳。宜為可望文。消息无定义也。什曰。等观四等观眾生也</p><p>不等观菩萨智惠分别诸法也</p><p>等不等观菩萨兼此二也</p><p>定自在王菩萨什曰。于诸定中自在</p><p>法自在王菩萨什曰。说法中在</p><p>法相菩萨什曰。功德法相现于身也</p><p>光相菩萨什曰。光明之相现于身也</p><p>光严菩萨什曰。光明<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>身也</p><p>大严菩萨什曰。明其身相大庄严也</p><p>宝积菩萨什曰。积聚智惠宝也</p><p>辩积菩萨什曰。积聚四辩也</p><p>宝手菩萨什曰。手中出无量宝也</p><p>宝印手菩萨什曰。印者相也。手有出宝之相。亦云有宝印也</p><p>常举手菩萨什曰。现已大慈之手抚慰眾生令不恐畏。是以常举手向人唱言勿怖</p><p>常下手菩萨什曰。现常垂下其手现慈心。屈下无伤物之像</p><p>常惨菩萨什曰。悲念眾生也</p><p>喜根菩萨什曰。喜根喜等也。亦于实相法中生喜及<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>也</p><p>喜王菩萨什曰。喜有二种。一不净喜受也。二清净法喜故言王也</p><p>辩音菩萨什曰。辞辩也</p><p>虚空藏菩萨什曰。实相惠藏如虚空也</p><p>执宝炬菩萨什曰。执惠宝炬除眾冥也</p><p>宝勇菩萨什曰。勇于德宝亦得宝故能勇</p><p>宝见菩萨什曰。以惠宝见诸法</p><p>帝网菩萨什曰。幻术经名帝网也。此大士神变自在犹如幻化。故借帝网以名之。又曰。大士施化如帝王法网也</p><p>明网菩萨什曰。明网自说手有网縵放光明也</p><p><a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>观菩萨什曰。观时不取相故无缘亦深入观莫见其所缘</p><p>慧积菩萨什曰。积聚惠也</p><p>宝胜菩萨什曰。功德宝超于世也</p><p>天王菩萨什曰。一假名<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>王名天也。二生天诸天也。三贤圣天大士皆现生也</p><p>坏魔菩萨什曰。行坏魔道</p><p>电得菩萨什曰。因事為名</p><p>自在王菩萨什曰。于诸法自在如王之于人</p><p>功德相严菩萨什曰。功德之相庄严身也</p><p>师子吼菩萨什曰。以大法音令眾生伏也</p><p>雷音菩萨什曰。所说法能令天人<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。群邪振悚犹若雷音闻者喜惧也</p><p>山相击音菩萨什曰。以大法音消伏刚强音声振击若两山相搏</p><p>香象菩萨什曰。青香象也。身出香风。菩萨身香亦如此也</p><p>白香象菩萨什曰。其香最胜。大士身香亦如是</p><p>常精进菩萨什曰。始终不退</p><p>不休息菩萨什曰。求善不止</p><p>妙生菩萨什曰。生时有妙瑞也。又曰从法化生為妙</p><p>华严菩萨什曰。以三昧力现眾花。遍满虚空大庄严也</p><p><a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>什曰。世有危难称名自归菩萨。观其音声即解脱也。亦名观世念。亦名观世自在</p><p>得大势菩萨什曰。有大势力也。以大神力飞到十方。所至之国六返振动恶趣休息</p><p>梵网菩萨什曰。梵四梵行慈悲喜拾。网言其多</p><p>宝杖菩萨什曰。或物宝。或法宝以為杖</p><p>无胜菩萨功德超胜也</p><p>严土菩萨什曰。净国土</p><p>金髻菩萨什曰。金在髻</p><p>珠髻菩萨什曰。如意宝珠在其髻中。悉见十方世界及眾生行业<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a><a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a></p><p><a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨什曰。姓也。此曰慈氏。阿逸多字也。此云无胜。南天竺<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>子也</p><p>文殊师利法王子菩萨什曰。秦言妙德。以法身游方莫知其所生。又来补佛处故言法王子也</p><p>如是等三万二千人此五结眾数。肇曰。叹德列名。所存名以证经也</p><p>复有万梵天王尸弃等。从餘四天下来诣佛所而听法此下三列杂眾。此梵王眾。肇曰。尸弃梵王名。秦言顶髻</p><p>复有万二千天帝亦从餘四天下来在会坐此帝释眾忉利天主也。肇曰。一佛土百亿四天下。一四天下各有梵释。故言餘亦或从他佛土来</p><p>并餘大威力诸天此诸天眾。肇曰。除上梵释餘大天也</p><p>龙此下八部眾也。肇曰。龙有二种。地龙虚空龙。种有四生也</p><p>神肇曰。神受<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>杂报其形胜。人劣天身轻微难见也</p><p>夜叉肇曰。秦言轻捷有三种。一在地。二在虚空。三天夜叉。居下二天守天城门閤</p><p>乾闥婆此云香荫。肇曰。天乐神也。居地上宝山中天须乐时。此神体上有异相现。然后上也</p><p>阿修罗肇曰。秦言不饮酒。此神类男丑女端正。有大威力能与天共斗也</p><p>迦楼罗肇曰。金翅鸟神也</p><p>紧那罗肇曰。秦言人非人。其形似人而头上有一角。遂称為人非人。亦天乐神小不如乾闥婆</p><p>摩睺罗伽等悉来会坐肇曰。蟒神也。此八神皆有大神力。能自变形在坐听法</p><p>诸比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>此下四眾也。肇曰。比丘义同上尼女名也。上八千比丘别称得道者</p><p>优婆塞肇曰。义名信士。又曰。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>為近事男。八戒為近住男</p><p>优婆夷俱来会坐夷者女也。准上可知</p><p>彼时佛与无量百千之眾恭敬围绕而為说法此二明佛现神变骇物令信投人夜光勘不按剑。况乎深妙。未信而传。凡物易以相从。难以理悟。故神化无方使受行也。文有二别。初明佛现胜身后明宝积献盖前文三法喻合也。此即初现胜身也。昔说小乘法微而相劣。今将说大乘法胜而相胜。法华云。著弊垢衣执除粪器。此表昔说小乘现劣相也。又云。于其门内踞师子床罗列宝物。此表说大乘现胜相也。故下偈文目净修广等叹胜相说法。不有不无等叹胜法。始在佛树等叹劣相。三转法轮等叹权法也</p><p>譬如须弥山王显于大海。安处眾宝师子之座。蔽于一切诸来大眾须弥山等喻也。安处眾宝等合也。肇曰。须弥秦言妙高山。处大海之中水上方三百三十六万里。如来处四部之中威相超绝。光蔽大眾犹金山之显溟海也</p><p>尔时毘耶离城有长者子。名曰宝积。与五百长者子俱。持七宝盖来诣佛所。头面礼足。各以其盖共<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>佛此二明献盖现瑞表说净土之相也。文三。初献盖。次合盖。后归信。此初献盖。表大慈荫物。净土化生即大慈之事也。肇曰。宝积亦法身大士也。常与净名俱诣如来共弘道教。而今独与里人诣佛者。将生问疾之由啟兹典之门也</p><p>佛之威神令诸宝盖合成一盖。遍覆三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>此二合盖文二。初合盖。表内慈无缘绝于彼我二。外现净土表应物差别净秽不同。此初也。彼我未亡宝积等盖殊而慈局执。亡性一诸佛所以盖合而慈覆三千。什曰。现此神变其旨有二。一者现神变无量显<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>必深。二者宝积献其所珍必获可珍之果。来世所成必若此之妙明因小而果大</p><p>而此世界广长之相悉于中现。又此三千大千世界.诸须弥山.雪山.目真邻陀山摩訶目真邻陀山香山宝山金山黑山铁围山大铁围山.大海江河川流泉原及日月星晨天宫龙宫诸尊神宫悉现于宝盖中二外现差别。前合盖既表法身平等慈覆不殊。此差别者亦表应身<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>国土不一文二。初现此界。二现十方。此中文三。初十山表陆居眾生住处。二大海表水族居处。三日月等表空居住处。然此三类等以慈覆故俱现盖中。肇曰。盖亦不广而弥。八极土亦不狭而现盖中</p><p>又十方诸佛诸佛说法亦现于宝盖中二现十方。吴本云。十方诸佛佛国严净及十方佛所在说法皆现宝盖中。此即现相明宗旨可见矣。肇曰。将显佛土殊好不同。故通现十方也。诸长者子皆久发道心而未修净土。欲悦其来供之情啟净土之志。故因其盖而现焉</p><p>尔时一切大眾睹佛神力叹未曾有。合掌<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>瞻仰尊顏目不暂捨此三睹瑞三业归信也。什曰。信乐发中现相于外也</p><p>长者子宝积。即于佛前以偈颂曰此下三明问经者。称扬佛德使物归信為啟问之由。肇曰。形敬不足。以写心故复讚之咏之。三十六行偈。述叹文四。初叹大乘胜应。二叹小乘劣应。三叹现瑞表发。四叹佛三密功德。前文又三。初两行总叹内德。二两行明<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。三五行叹说法。此初也</p><p>目净修广如青莲此初四句此句叹形。肇曰。五情百体目最為长瞻顏而作故先叹目也。天竺有青莲花。其叶修而广。青白分明。有大人目相故以為喻也</p><p>心净已度诸禪定此句叹心。肇曰。形长者。目主德者。心叹目则摄眾相。叹心则摄万德。故作者标二為颂首。禪定之海深广无际。自非如来清净真心无能度者</p><p>久积净业称无量此句叹因。肇曰。于无数劫积三净业故名称无量</p><p>导眾以寂故稽首此句叹果。言与眾同游八正至寂灭涅槃。故敬礼也。肇曰。寂谓无為寂灭之道也</p><p>既见大圣以神变普现十方无量土。其中诸佛演说法。于是一切悉见闻此二叹神通也。以见盖中国土净秽不同。為下致问之由也。肇曰。既见合盖之神变已不可测。方于中现十方国土及诸佛演法。于是忍界一切眾会悉遥见闻為希有也</p><p>法王法力超群生。常以法财施一切此三叹说法文三。此初标法施也。肇曰。俗王以俗力胜民故能泽。及一国法王以法力超眾故能导济无疆也</p><p>能善分别诸法相。于第一义而不动此二两行叹法王义。肇曰。第一义為诸法一相义。虽分别殊相而不乖一相。此美法王莫易之道动為乖矣</p><p>已于诸法得自在。是故稽首此法王肇曰。世王自在于民。法王自在于法。法无定相。随应而辩為好。异者辩异而不乖同為好。同者辩同而不乖异。同异殊辩而俱适法相故得自在</p><p>说法不有亦不无此三释叹所说大乘二空法也。此初明因缘有故即有非有為法空也。不同小乘捨有证空。此即不亡于空故名法执也。肇曰。欲言其有有不自生。欲言其无缘会则形。会形非谓无。非自非谓有。具有有故有无。无有何有无。有无故有有。无无何有有。然则自有则不有。自无则不无。此法王之正说也</p><p>以因缘故诸法生此句释也。肇曰。有亦不由缘。无亦不由缘。以法非有无故由因缘生。论曰。法从缘故不有。缘起故不无也</p><p><a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>无造无受者此下偈明我本不有。即无无我入不二门。不同二乘捨我住无我也。又我造受三计我之别名。此明由业迁形。岂有常我主其异形哉。肇曰。诸法皆从缘生耳。无别有真宰主之者故无我也。夫以有我故能造善恶受祸福法。既无我故无造无受者</p><p>善恶之业亦不亡此句释也。肇曰。若无造无受者则不应有為。善获福而為恶致殃。然眾生<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>相传美恶。由起<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>之道连锁相袭其犹声和响顺形直影端。此自然之理。无差毫分。复何假常我而主之哉</p><p>始在佛树力降魔得甘露灭觉道成此二八偈叹昔说小乘权现劣身益物也。文四。初两行明得道。二两行明转法轮。三两行明得益。四两行怨亲平等。此初光明降魔证灭。谓如来应迹王宫割爱踰城歷试邪道。捨邪坐树。誓取菩提。魔宫振动先权色贪。次伏怨敌。外魔既散方证涅槃。甘露择灭。结习内魔于兹永尽。佛树者菩提也。始言初也</p><p>已无心意无受行。而悉摧伏诸外道此释伏外也。一解云。昔六行修禪及苦行等。菩萨无心受彼邪法。但為示同调伏耳。又肇曰。心者何也。染有以生。受者何也。苦乐是行至人冥真体寂虚空。其怀虽万法普照而心未尝有苦乐。是经而不為受物。我永寂。岂心受之可得。此无心伏于物而物无不伏。受者受著也</p><p>三转法轮于大千。其轮本来常清净此二明诣鹿野苑转法轮也。道成即化物故。次说法文二。此先明转法也。三转者示相转劝修转引证转也。谓初示四諦法相也。次劝修行此四諦也。复言我已获证令信受也。大千者佛一化境也。肇曰。法轮常净犹虚空也。虽复古今不同时移俗易圣。圣相传其道不改</p><p>天人得道此為证。三宝于是现世间此二明功成。肇曰。初转法轮时俱轮等五人。八万诸天得道。此常清净之明证觉道。既成佛宝法轮。既转法宝五人出家得道。僧宝于是言其始也。五人者憍陈如摩訶男阿湿卑婆提婆敷也</p><p>以斯妙法济群生。一受不退常寂然。度老病死大医王。当礼法海德无边此三明得益。明断见修惑得涅槃益也。肇曰。九十六种道上者。亦能断结生<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>天。但其道不真要还坠三途。佛以四諦妙法济三乘。眾生无有。既受还坠生死者。故曰。一受不退。永毕无為故常寂然也。又生老病死患之重者。济以法药故為医王之长也。此则法轮渊旷难测。法海流润无涯德无边也</p><p>毁誉不动如须弥此四叹平等文三。此初八风不动也。肇曰。利衰毁誉称讥苦乐八法之风不动如来犹四风之吹须弥也</p><p>于善不善等以慈此二违顺不动。肇曰。截手不慼捧足不忻。善恶自彼慈覆不二。又顺法违法及不违顺心平等也</p><p>心行平等如虚空。孰闻人宝不敬承三结释也。肇曰。在天為天宝。在人為人宝。宝于人天者岂天人之所能故物莫不敬承也</p><p>今奉<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>此微盖。于中现我三千界。诸天龙神所居宫。乾闥婆等及夜叉。悉见世间诸所有。十力哀现是化变。眾睹希有皆叹佛。今我稽首<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>尊此下四行颂上献盖等三奉微盖等献盖也。于中现等合盖也。眾睹等眾叹也肇曰。微微小也。所奉至微所见至广。此是如来哀愍之所现。十力者是如来别称耳</p><p>大圣法王眾所归。净心观佛靡不欣。各见世尊在其前斯。则神力不共法此下第四叹佛三密利物功德。此初身密也。法王慈惠眾庶怀归净信有殊佛亦随应。肇曰。法身圆应犹一月昇天影现百水。不与二乘共也</p><p>佛以一音演说法。眾生随类各得解。皆谓世尊同其语。斯则神力不共法此下六行叹口密四辩。此初二行法词二辩也。随类各解诸法名字不同。此法辩也。皆谓世尊同其言音此词辩也。佛得一切眾生语。言陀罗尼。无言之言不与二乘共也</p><p>佛以一音演说法。眾生各各随所解。普得受行获其利。斯则神力不共法此两行叹义辩也。凡夫示以<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>善恶之义。二乘示以<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>寂灭等义。大乘示以不生不灭实相之义。肇曰。好施者闻施。好戒者闻戒。各异受异行。获其异利。或人天乐异。或二乘涅槃。或究竟菩提一雨所润三草不同。岂二乘共也</p><p>佛以一音演说法。或有恐畏或欢喜。或生厌离或断疑。斯则神力不共法此二行乐说辩也。肇曰。眾生闻苦报则恐畏。闻妙果则欢喜。闻不净则厌离。闻法法相则断疑。不知一音何演而令欢畏异生。此岂二乘所能共也</p><p>稽首十力大精进。稽首已得无所畏。稽首住于不共法。稽首一切大道师此下七行叹心密文三。初两行叹智德。此两行明断德。后三行明恩德也。智与理冥相如心寂不可以虑知。辩不可以名数定言。十力无畏等者。盖示物方便耳。智不可屈力也。不惧外难无畏也。二乘所无不共也。名数如别</p><p>稽首能断眾结缚。稽首已到于<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>此下断叹德也。二乘自断。大圣兼度。此初自断结缚。结谓九结。爱恚慢无明疑此五钝使。见结身边邪三见也。取结戒取见也。此二结五利使也。慳结嫉结十缠中二缠也。缚者四缚贪欲缚瞋恚缚戒取缚见取缚。亦云。贪瞋痴三缚。又一念取相顿迷真理万惑从起皆名结缚。即一切烦恼皆名為结。皆名為缚也</p><p>稽首能度诸世间。稽首永离生死道此明自度结。即能度诸世间离生死也</p><p>悉知眾生来去相。善于诸法得解脱此下三明无缘悲化即恩德也。此行知生去来于法无著。肇曰。眾生行往来于六趣心驰骋。于是非悉知之也。又我染诸法故诸法缚我。我心无染则万缚斯解</p><p>不著世间如莲花。常善入于空寂行此行知世如幻而大悲不捨。肇曰。出入自在而不乖寂故常善入也</p><p>达诸法相无罣碍。稽首如空无所依此行明解诸法而不取著。肇曰。万法幽深谁识其族。唯佛无阂故独称达而圣心无寄犹空无依</p><p>尔时长者子宝积。说此偈已白佛言。世尊是五百长者子。皆已<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>此下明正宗。前序分既合盖骇心讚扬信发故。此当根啟悟<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>获益文三。初佛国半品法王命宗。二方便下九品大士助佛扬化。三菩萨行见阿閦二品宣扬事讫还归印定。如王宣正令大臣行事事讫朝尊之类也。初文二。初宝积请说。二如来酬答。初请文二。初明发心即堪闻法之根也。肇曰。阿耨多罗秦言无上三藐三菩提。秦言正遍知。道莫之大无上也。其道真正无法不知正遍知也</p><p>愿闻得佛国土清净此请问文二。先问果。后问因。此初也。佛昔说小乘以丈六一身為真身。亦丘陵一国為真土。今将返小归大故。于诸方等经明<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>应物无量。悟丈六之非真。于此经合盖见诸佛国殊。亦了丘陵之非实。故因现盖有此问焉。又眾生业异身殊处别。诸佛道一身土合同现盖。既国土有殊故愿闻其所以。肇曰。诸长者子久发无上心而未修净土。所以宝积俱诣如来现盖。皆啟其萌也。既于盖中见诸佛净土殊好不同志在崇习。故愿闻佛所得殊好之事也</p><p>唯愿世尊。说诸菩萨净土之行此二问因。肇曰。土之所以净。岂校饰之所能净之。必由行故请说行。凡行必在学地故。菩萨此问乃是如来现盖之微旨宝积得诣之本意也</p><p>佛言善哉宝积。乃能為诸菩萨问于如来净土之行此下二如来酬答文四。此初佛讚也</p><p>諦听諦听善思念之当為汝说此二明诫许也。諦听者闻惠也。善思者思惠也。念之者修惠也</p><p>于是宝积及五百长者子受教而听三受教也</p><p>佛言。宝积眾生之类是菩萨佛土此四明如来答文四。初答二问。二身子疑问。三指按现净。四时眾得益。答二问中佛先答果。有法喻合法中又三标释结也。此初标章总答不。经云。虽知诸佛国土永寂如空。而现种种清净佛土。又云。诸佛如来功德平等為<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>眾生故现佛土不同。明镜无像即以所照面為像。亦法身无处即以化眾生处為国土。是以所化眾生之类。是如来应物之国土。肇曰。夫至人空洞无像。应物故形。形无常体。况国土之有恒。以群生万端业行不同。殊化异被。至令报应不一。是以净者应之以宝王。秽者应之以石沙。美恶自彼于我无定。无定之土乃曰真土。然则土之净秽繫于眾生。故曰。眾生之类是菩萨佛土。惑谓土之净秽繫于眾生者则是眾生报应之土非如来土。此盖未喻报应之殊方耳。尝试言之。夫如来所修净土以无方為体。故令杂行眾生同视异见。异见故净秽所以生。无方故真土所以形。若夫取其净秽眾生之报也。本其无方佛土之真也。岂曰殊域异处凡圣两土然后辩其净秽哉</p><p>所以者何。菩萨随所化眾生而取佛土此二明列释四句文四。此初明佛国宽狭不同所以。肇曰。此下释所以眾生即佛土也。佛土者即眾生之影响耳。夫形修影长形短影促。日月使之然乎。形自然耳。故随所化眾生之多少而取佛土之宽狭也。是以佛土或以四天下。或以三千。或以恒沙為一国也</p><p>随所调伏眾生而取佛土此二明佛土净秽不同。肇曰。随所调伏眾生之深浅而取佛土之好丑</p><p>随诸眾生应以何国入佛智慧而取佛土此三明闻法入惠之差别。如香积根熟而淳说大乘。娑婆根钝乃先三后一之类也。肇曰。眾生自有见净好慕。而进修者亦有见秽恶厌。而进修者所好殊方而言之耳。所因虽异然其入佛惠一也</p><p>随诸眾生应以何国起菩萨根而取佛土此下四明起根不同。如香為佛事即于鼻起菩萨根。声為佛事即于耳起根之类也。起根谓信等诸善根即是发菩提心也。又云。或有忻净起根厌秽起根如前</p><p>所以者何。菩萨取于净国。皆為<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>诸眾生故此三结释所以也。肇曰。法身无定何国之有美恶。斯外何净可取。取净国者皆為彼耳。故随其所应而取焉</p><p>譬如有人欲于空地造立宫室随意无阂此二喻文二。此初喻菩萨因化眾生故有净土。肇曰。净土必因眾生。譬立室必因地。无地无眾生室土无以成</p><p>若于虚空终不能成此喻二乘不化眾生故无净土也。肇曰。二乘澄神虚无不因眾生故无净土也</p><p>菩萨如是為成就眾生故愿取佛国。愿取佛国者非于空也此三合文可见</p><p>宝积当知。直心是菩萨净土此二答行因也。文二。前横约一十七行明行净不同致果各异。后竖约一十三位明行。既从麤阶妙国土亦渐微转净。此初也。理实万行遍是净因。文列十七<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>略标宗旨耳。又此诸行皆上半明行因。菩萨成佛等皆举果释因。复次自行直心自招法身正报之果。化人行直心感善眷属得净土之果。又云。自行直心教人行直心。讚叹直心法随喜行直心者。备此名净土行也。准此直心餘行亦尔。肇曰。土之净也必在眾生。眾生之净必因眾行。上直举眾生以释土净。今备举眾行明其所以净也。夫行净则眾生净。眾生净则佛土净。此必然之数不可差也。直心等者此约三心明净土。肇曰。土无洼曲乃出于心直故曰直心。是菩萨净土。此即因说果。犹指金為食也。直心者谓心质直无諂。此心乃万行之本故建章有之</p><p>菩萨成佛时不諂眾生来生其国此下举果释因。肇曰。化彼同已自土既成故令同行斯集。此明<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>相及故果报相连佛土之义显也。自下因果相对。或前后异名。或前略后广。或前因后果类同行耳</p><p>深心是菩萨净土。菩萨成佛时具足功德。眾生来生其国肇曰。树心眾德深固难拔深心也。又自心既深则所化亦深。道因既深则所感国土自然功德具足也</p><p>大乘心是菩萨净土菩萨成佛时大乘眾生来生其国法华云。若有眾生从佛闻法慇懃精进求一切智。如来知见力无畏等愍念。安乐无量眾生利益天人度脱一切。是名大乘。以此化物成佛之时国土无二乘之名。香积佛土即其事也</p><p>布施是菩萨净土。菩萨成佛时一切能捨眾生来生其国此下约六度明净土行也。一切能捨者。肇曰。外捨国财身命贪恚慳嫉名一切能捨也</p><p>持戒是菩萨净土。菩萨成佛时行十善道满愿眾生来生其国肇曰。十善<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>也。亦有无量戒略举十耳。戒其则无愿不故言满愿也</p><p>忍辱是菩萨净土。菩萨成佛时三十二相庄严眾生来生其国肇曰。忍辱顏和故繫以容相耳。岂直形报而已哉</p><p>精进是菩萨净土。菩萨成佛时勤修一切功得眾生来生其国。禪定是菩萨净土。菩萨成佛时摄心不乱眾生来生其国。智慧是菩萨净土菩萨。成佛时正定眾生来生其国肇曰。得正定惠决定法相。三聚眾生中名正定聚也。依仁王经。未发菩提心為邪定聚。十信為不定聚。十住已去為正定聚</p><p>四无量心是菩萨净土。菩萨成佛时成就慈悲喜捨眾生来生其国此慈悲喜捨也。肇曰。此四心周被无际故名无量也。此下杂就万行明也</p><p>四摄法是菩萨净土。菩萨成佛时解脱所摄眾生来生其国肇曰。以四事摄眾生為四。摄也。一者惠施。财法随彼所须。二者爱心。和言随彼所适。三者利行。随彼所利方便利之。四者同事。遇恶同恶而济恶。遇善同善而进善。菩萨以此為解脱生死而摄眾生不同。凡夫為恩爱名利王法等相摄缚也</p><p>方便是菩萨净土。菩萨成佛时于一切法方便无阂眾生来生其国肇曰。方便巧惠也。积小德而获大功。功虽就而不為证。无為而无所不為。此方便无阂也。复此菩萨自<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>巧不退善根。化他善巧能进物善。故云无碍方便也</p><p>三十七道品是菩萨净土。菩萨成佛时念处正懃神足根力觉道眾生来生其国肇曰。念处<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>正懃四正懃也。神足四神足根五根也。力五力也。觉七觉意也。道八正道。菩萨以此正道化物故成佛时正修眾生同生其国。外道邪修土所无也</p><p>迴向心是菩萨净土。菩萨成佛时得一切具足功德国土迴己功德普施眾生。同向菩提不住餘果。此大士迴向也。复次施等善行招人天报。若能迴向俱到菩提。此迴向為大利也。复次事即世善理即菩提。若能即事悟理。此真迴向也。故下文云。布施性即是迴向一切智性。此之谓歟。又迴向菩提何德不具也</p><p>说除八难是菩萨净土。菩萨成佛时国土无有三恶八难八难者三涂北洲无想天世智邪辩佛前佛后生聋生盲也。有说愿生善处轮除初五难。发正愿轮除世智辩。聪值善人轮除佛前佛后。深种善根轮除生聋盲也。又诸经明。或闻佛名菩萨名相好名经名陀罗尼名<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>二字等。皆除三恶八难见佛闻法也。且八难患之极能除利之。最行不至艰功济甚大。凡诸学去可不勉歟</p><p>自守戒行不讥彼闕是菩萨净土。菩萨成佛时国土无有犯禁之名肇曰。犯禁恶名出于讥彼而不自守也</p><p>十善是菩萨净土。菩萨成佛时命不中夭。大富梵行所言诚諦。常以软语眷属不离。善知挣讼言必饶益。不嫉不恚<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>眾生来生其国肇曰。不中夭不杀报也。大富不盗报也。梵行不淫报也。诚諦不<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>也。软语不恶口。不离和挣不两舌也。饶益不綺语也。不嫉不恚正见。嫉恚邪见心患之尤者故别立三善也</p><p>如是宝积菩萨随其直心则能发行此下二明竖约诸行相资至极净土也。叡曰。上但广明眾行因果相对。此明诸行自為始终阶麤至极。始于菩萨自行直心终国土眾生一切都净也肇曰。夫心直则信固。然后能发迹造行。然始于万行者其唯直心乎。此章明行之。次渐微著相因。是以始于直心终于净土。譬犹殖栽丝髮其茂百围。直心树其萌眾行因而成故言随。复次有以位名配此经。句经文虽不明说理亦无违则直心配十住乃至功德净配法云可知</p><p>随其发行则得深心肇曰。既能发行则道情弥深</p><p>随其深心则意调伏肇曰。道情既深则无麤横也</p><p>随意调伏则如说行肇曰。心既调柔则闻斯能行也</p><p>随如说行则能迴向肇曰。闻既能行则能迴。其所行标心胜境</p><p>随其迴向则有方便肇曰。既迴向大乘则大方便之所生也</p><p>随其方便则成就眾生肇曰。方便之所立期在成眾生也</p><p>随成就眾生则佛土净肇曰。眾生既净则无秽土也</p><p>随佛土净则说法净肇曰。既处净土则有净说</p><p>随说法净则智慧净肇曰。既有净说则有净智慧生</p><p>随智慧净则其心净肇曰。净智既生则净心转明也</p><p>随其心净则一切功德净肇曰。积德不已者欲以净心。心既净则无德不净</p><p>是故宝积。若菩萨欲得净土当净其心。随其心净则佛土净肇曰。结成净土义也。净土盖是心之影响耳。夫欲响顺必和其声。欲影端正正其形。此报应之大数也</p><p>尔时<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗承佛威神作是念。若菩萨心净则佛土净者。我世尊本為菩萨时意岂不净。而是佛土不净若此上佛答二问。既不悟解故。次第二记缘生论文二。初身子生疑。后梵王见异。初中又四。一生疑。二质问。三奉对。四解释。此初明声闻不知真土秽净。斯云应土秽净。随物谓佛实报丈六。六依报丘陵故示执果疑因。因若必净土不应秽。如其秽也。不应成佛故疑问焉。肇曰。土之净秽固非二乘之所能及也。如来将明佛土常净美恶生彼故。以威神发其疑念。以生言端故言承也</p><p>佛知其念即告之言。于意云何日月岂不净耶。而盲者不见此二举喻质问</p><p>对曰不也。世尊是盲者过过非日月咎此三对以盲过也</p><p>舍利弗眾生罪故不见如来佛国严净。非如来咎。舍利弗我此土净而汝不见此下四明解释。肇曰。日月岂不明。不见自由瞽。佛土岂不净。罪秽故不睹。岂唯凡夫不睹。身子二乘智眼亦不见</p><p>尔时螺髻梵王语舍利弗。勿作是意。谓此佛土以為不净所以者何。我见释迦牟尼佛土清净。譬如自在天宫。此下二明螺髻见净文三。此初梵王同天见净。什曰。佛国清净阶差不同。或如四天乃至如六天。或如梵天乃至净居。或有过净居。唯补处菩萨生此国也。称适眾心故现国不同。肇曰。佛土真净超绝三界。岂直如天宫世净而已哉。此盖齐其所见而為言耳。舍利弗在人而见土石。梵王居天而见若天宫。自餘所见亦各不同。佛土殊应义存于此也</p><p>舍利弗言我见此土。丘陵坑坎荆蕀沙砾。土石诸山秽恶充满此二身子执秽</p><p>螺髻梵言。仁者心有高下。不依佛惠故。见此土為不净耳。舍利弗。菩萨于一切眾生悉皆平等。深心清净。依佛智慧则能见此佛土清净此三释二见所以。先明身子。次辨梵王也。下文云。虽知诸佛国及与眾生空而常修净土。教化于群生。身子不了净秽。随缘不依佛惠。忻净厌秽心有高下。非真见也。大士了此净秽应现名。依佛惠知生如幻故皆平等。既净秽常一名真见也</p><p>于是佛以足指按地。即时三千大千世界若干百千珍宝严饰。譬如宝庄严佛无量功德宝庄严土。一切大眾叹未曾有。而皆自见坐宝莲花。此三明如来现净文四。此初指按现净文有现净况净眾见也。前佛答二问身子生疑梵王啟论眾既不悟故。假现变使知净秽无定。返权悟实矣生曰。现此变者示无定相以遣封秽之情。使取為净之旨。肇曰。宝庄土净土之最故以為喻也。自见坐花可解</p><p>佛告舍利弗。汝且观是佛土严净此二劝观净也。生曰。且观且寄严净以明无秽。于实乃无事净土矣</p><p>舍利弗言。唯然世尊。本所不见。本所不闻。今佛国土严净悉现此三对佛昔在小乘<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>不见净土。亦不闻说。今届兹会方见严净</p><p>佛语舍利弗我佛国土常净若此為欲度斯下劣人故。示是眾恶不净土耳此下四释。今昔净秽所以也。文三。此初法说也。肇曰。自佛而言故常净。若此外应下劣故不净同彼也</p><p>譬如诸天共宝器食随其福德饭色有异此二喻也。肇曰。饭在器色一在乎。不同饭。岂有异。异自天耳。佛土不同。方此可知。故下文云。诸佛如来功德平等。為教化眾生故而现佛土不同</p><p>如是舍利弗。若人心净便见此土功德庄严三合文可见</p><p>当佛现此国土严净之时。宝积所将五百长者子皆得无生法忍此大段第四时眾得益□。大小二乘各有深浅二益也。此深悟无生也。大品即色明空。悟空色不二亦证无生法忍。法花寿量即伽耶短寿明长寿。悟法身非长非短亦悟无生忍。此经即识明净□□等。悟净秽不二亦得无生忍。以此而观眾经殊唱会归同致。肇曰。佛国之兴其正為□无生忍。同上不起法忍也</p><p>八万四千人发阿耨多罗三藐三菩提心此浅者发心也</p><p>佛摄神足。于是世界还复如故。求声闻乘三万二千天及人。知有為法皆悉无常。远尘离垢得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净此二小乘益既不悟净秽。应缘故执实有為见无常也。肇曰。国土秽而可净。净而复秽。因悟无常故得法眼。法眼名须陀洹道也。始见道迹故得法眼。名尘垢八十八结也</p><p>八千比丘不受诸法漏尽意解肇曰。无著之道于法无受无染漏尽九十八结漏既尽故意得解脱成罗汉也</p><p>方便品第二</p><p>此下第二净名助佛阐扬净土之化。九品经文大。分為二。初三品室外訶弹。后六品室内摄受。又先析仕庶。次訶声闻。后訶菩萨。三品浅深之次也。此以叹净□益物。方便□□品也</p><p>尔时毘那耶离大城中有长者名维摩詰肇曰。此经之□起于净名。其微言幽唱亦备之。后文出经者欲远存其人以弘其道教。故此一品全序其德也。品文二。先叹德。次益物。初中叹本迹二身。法身十德本也。应身三业迹也。天台云。西方贵人称為长者皆具十德。今净名法身长者。十德亦然。十德如科文。已曾供养无量诸佛深殖善本第一姓贵者。殖佛闻法从法化生也。肇曰。树德先圣故善本深殖也</p><p page margintb15></p></div>"
}]