[{
    "title": "净名经关中释抄 第2778部",
    "author": "道掖",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>净名经关中释抄 卷上</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>道液撰集</p><p>天台云。此经理致深远言旨渊玄。若但依文帖释。恐指事数而已。壹教宗极终自难量。犹须略忖幽微显不思议旨趣。今輒于文前撰五重玄义。第壹释名。第二出体。第三明宗。第四辩力用。第五判教相</p><p>此名不思议人法是名。不思议真性<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>為体。不思议佛国<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>為宗。不思议权实折伏為力用。不思议带偏显圆為教相。故今明此经。始从如是我闻终乎<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>奉行。皆明不思议也。所以五义次第尔者。虽理绝名言。非言无以设教。故于无名之道假名相说而名以召法法以应名。是以经之指归蕴在名内。故先标名。夫寻名得理。理即真性解脱。真性解脱即经之体也。故次出经体。体不孤致。求之有方涉行修因然后致果。故用因果為入理纲宗。行因得果。即能巧用权实。析伏摄受利益眾生。故次明力用。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>设教随逗根缘。根缘不壹。是以教有同异。故次明教相也</p><p>第壹释名门中复有三意。初辩教起所由。次明翻译帝代。后正释经题。初教起所由有通有别。通明诸经者有三意。壹為满本愿故壹切诸佛行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>。皆发四弘誓愿。今為答初眾生无边誓愿度故说教也。故肇师云。结僧那于始心终大悲以赴难。如下文云。菩萨取于净国者皆為<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>诸眾生故。又<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>云。我本立誓愿欲令壹切眾如我等无异。二為酬请主故。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>华经明。如来成道经三七日。梵王帝释及四天王请佛转法轮。问。梵王等请佛三转十二行法轮。岂请转大乘耶。答。大论明说<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。由是酬王请。故知亦请大也。又下经中天帝四王皆发誓弘经。岂非庆佛酬请故也。三為赴根缘故。但佛大慈悲根熟即化。何必要须请也。故文云眾人不请友而安之。菩萨尚尔。况如来耶。问。根缘多种。如何称会。答。如来以四悉檀赴诸根缘故能会不失机。然大经明。生生等不可说。以<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>故亦可得说。因缘者即悉檀方便也。是生眾教之缘。是起眾行之因。将明此义三门分别。第壹翻名解释。第二辩其体相。第三明发起教行。初翻释者。悉檀者。或云有翻。或云无翻。其意如释经字中明。言有翻者。或云宗成。或云墨。或云印。或云实。或云成就究竟等。如是对翻非壹。难可定存。此随根<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>离文字之宗印等也。南岳师云。此例如大<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>梵汉称也。悉是随音。檀是梵语。悉之言遍。檀翻為施。佛以此法遍施眾生故云也。第二辩相者。壹世界。二各各為人。三对治。四第壹义。大圣為破外道邪四悉檀故。说此正四悉檀。起壹切大小乘教也。第壹世界悉檀者。即是眾生<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>十二入十八界壹切诸法名相隔别不同故名世界。外人迷此世界。或计无因缘有世界。或计邪因缘有世界。大圣随眾生所欲乐闻為说正因缘世界之法令眾生得<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。即是世间法施。二各各為人悉檀者。大圣观人心而為说法。人心各各不同故于壹事或听不听。如经所说。杂执业故杂生世间杂触杂受。更有破群邪经说无人得触无人得受。此意正為破执生信增长善根施诸善法。故名各各為人悉檀。三对治悉檀者。大智度论云。有法对治则有宝性故无有者。即是贪欲多者教修不净观。瞋恚多者教修慈心观。愚痴多者教观因缘观也。佛说对治之法药遍施眾生為断其恶。故名对治悉檀也。第四第壹义悉檀者。大智论云。明第壹义有二种。壹约不可说。二约可说。初不可说即是诸佛辟支佛阿罗汉真实法。故大论云。言论尽竟心行亦讫。又如大经说。诸行处名世界。说不行处名第壹义。约可说者。如大论云。壹切法实。壹切不实。壹切亦实。壹切非实非不实。皆名诸法之实相。佛于如是等处处诸经说第壹义悉檀相。此即是壹家所明。四门入第壹义竟。中论云。若為向道之人闻说四句即能悟入即是诸法实相。若人闻说四句心生取著皆是戏论。此即初随乐欲。二随便宜。三随对治。四第壹义故。宝积叹佛乐说辩云。佛以壹音演说法。或有恐畏。或欢喜。或生厌离。或断疑。斯则神力不共法。恐畏者。世界悉檀為说<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>火宅故恐怖。欢喜者。為人悉檀发本善根得法喜也。或生厌离者。即是厌患<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>兴对治也。断疑即第壹义悉檀。初入见道见諦理分明故断疑也。第三明起壹切教<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。大论明四悉檀起十二部经八万四千法藏即是世界悉檀。起八万四千诸尘劳门。各各為人悉檀。起八万四千<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>门诸陀罗尼门。对治悉檀。起八万四千诸对治门对治八万四千诸烦恼也。第壹义悉檀起八万四千诸法门。亦名八万四千诸波罗蜜门。乃至大小乘经渐顿诸教通别二论圣说圣默皆因悉檀方便而建立</p><p>第二别明此经起缘。其意多途。略述四种明其大意。餘所委细随品分别。壹為明二解脱不同。二為开<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之宗。三為显净名胜德。四為成胜<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。初為显可思议不可思议二种解脱有异者。诸声闻等稟昔权说之教。自谓与佛同坐解脱床。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>趣大。故今经简之令知有异厌小求大成生苏弄胤。文有多意。略举三种。壹约真性解脱简。如身子云。此座高广吾不能昇。表不思议解脱理深大故非小乘所入。又云。佛為增上慢人说离淫怒痴為解脱。若无增上慢者淫怒痴性即是解脱。是即思议离不离别二约实惠简者。文云不灭痴爱起于明脱此异。二乘灭惑取证。又云。无得无证故辩如是尘劳之畴為如来种等是也。三约方便解脱简者。经云。结习未尽。花著身耳。结习尽者花不著也。二乘虽得解脱未尽惑原。又以小室能藏大座须弥纳芥子中。本相如故。乃至现作魔王掌擎大眾等。皆是菩萨方便示现利物故也。二為开净土之宗者。大圣前于普集等经广说法身正报。未明净土依报故。于此中合盖现土宝积发问。如来酬答。乃至指案现净。空室侍问。眾香之界远现上方。妙喜之国来游斯土。此等种种因缘使诸菩萨上知诸佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>平等為眾生故现佛土不同。下能成就眾生同诸如来净佛国土。广如下文。不可悬述。三為显净名胜德。胜德既彰。则前来宣化咸可宗。承物情信伏。故下文云。汝等捨置菩萨所行。是维摩詰所现神力。汝等声闻百千亿劫尽力变化所不能作也。又什法师云。维摩詰秦言净名。即五百童子壹人也。从妙乐国来游此土。所应既周。将还本土欲显其淳德以泽群生。显迹悟时要必有由。故令同志诣佛而独不行。明其有疾。有疾故有问疾之会。有问疾之会由净国之集。净国之集由净名方便。然则此经始终良有在也。又肇师亦云。教缘既毕将返妙喜故欲显其神德以弘如来不思议之道。四為成就最胜供养故说此经。故下文云。若有读诵解说其义如说<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。则為诸佛之所护念。其有供养如是人者。当知则為供养于佛。又云。天帝。若善男子善女人<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵供养是经者。则為供养去来今佛。况梵天之塔福未足多。五劫施安供养非胜。得柔顺忍获陀罗尼。<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>济人其唯法供养</p><p>第二翻译帝代者。大唐内典录云。教流原起寔本巨周秦正弥之遗踪。间出刘向校书天阁往往见有<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>。依此校量不止汉明之代。今叙中兴之始起于后汉。孝明帝。永平七年夜梦金人。殿庭集议傅毅奉对。臣闻昔西方有神其名為佛。陛下所见将必是乎。帝乃遣使中郎秦景博士王遵等壹十七人往适<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>。于月支国请沙门<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>摩腾竺法兰。写得经像载以白马。至永平十年还达雒阳。立白马寺译出<a href=\"/fojing/sishierzhangjing/\" class=\"keylink\" target=\"_blank\">四十二章经</a>。此即汉地经之祖也。自示释教相继云兴。沙门信士接踵传译。爰至皇朝时移九代。此经翻传总有六译。第壹后汉刘氏灵帝代临淮清信士严佛调于离阳白马寺译二卷。名古维摩詰经。第二吴朝孙氏太皇帝月支国优婆塞支谦于武康译三卷。名维摩詰所说不思法门经。第三西晋司马氏武帝沙门竺法护西域人解三十六国语于雒阳译壹卷。名维摩詰所说法门经。第四东晋惠帝西域沙门竺寂兰元康六年于雒阳译三卷。名毘摩罗詰经。第五后秦姚兴弘始八年<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>沙门鳩摩罗什于常安大寺译三卷。名维摩詰所说经。即今所释之本是也。第六唐三藏沙门玄奘贞观二十壹年于长安大慈恩寺译六卷。名无垢称经</p><p>第三正释经题。略分為二。壹别。二通。别即维摩法华。通即经之壹字。所以名有通别者。略為三义。壹约教。如华严大品等教异故立名异是為别也。皆是佛说同名為经故為通也。二约行者。如泥洹真法宝眾生种种门入入门异為行别故须别名。同趣<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>即壹理故名通也。三约理者。理是壹法名义即多。故云。如天帝释有种种名。解脱亦尔。多诸名字。名字异故名為别。同是壹理故名通也从教起行。从行入理。俱有通别。先明别名。后分人法。所以双标者。非人无以弘法。非法无以显人。是即尊其人重其法也</p><p>初辩人名即為二别。初翻名解释。后明本迹高下。初翻译者。或云毘摩罗结帝。此翻净名无垢称。或云毘摩罗詰。此翻為净名。或云毘摩罗詰栗致。此翻為净无垢称。此梵语轻重不同。故义亦广略随别。次解释者。初翻似觉為繁。难為申释。次净名者似对真应二身。净即真身。真智无惑故云為净。名者即应身。垂形济物名称普闻也。什云。五百童子之壹人也。次翻净无垢称者。似对三身。净即法身。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净皎然无点。即是性净法身也。无垢即报身。报智圆明无有垢染。即是圆净报身也。称者即是应身。大慈化世名称普洽。即是应身也。故智度论云。水银和真金。能度诸色像。功德和法身。处处应现往。餘义释法名中广辩。二明本迹高下者。净名大士补处菩萨。若阿毘曇。即以生兜率為补处。若大品共行十地。即九地菩萨地為补处。若五十二位。即以等觉為补处。若寂灭真如。有何次即初心即补处。此既眾教异明。故须辩其本迹。今明此义略分二意。初正通明本迹。后别明名净名本迹。初正明者。本即所依之理。迹者是能依之事。事理合明故称本迹也。譬如人依住处则有行往之踪迹也。将明此义略為五意。壹约事理。二约理教。三约理行。四约体用。五约权实。初约事理者。理即不可思议真諦之理本。事即不思议俗諦之事迹。由真諦不思议之理本故有不思议俗諦之事迹。寻俗諦之事迹得真諦之理本。本迹虽殊不思议壹也。二约理教者。此经云。三转法轮于大千。其轮本来常清净。此即以前不思议二諦為理本。能詮二諦為教迹。由理垂教。寻教得理。餘如前。三约理行者。法华经云。诸法从本来常自寂灭相。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>行道已。来世得作佛。此经云。无离文字说解脱相。即前理教并以為本。不思议观行為事迹。餘类前明。四约体用者。即以法身体為本。应身用為迹。故金光明经云。佛真法身由如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。应物现形如水中月。餘亦如前。五约权实者。实即齐位<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>真应二身為实本。权化方便现真应二身或高或下随逐物情為事迹。故经云。虽复成道转于法轮。而不捨于菩萨之道也。餘亦如前。是即理事明本迹即是理。即理教明即名字。即理行明即观行。即体用明即真应。即权实明即究竟。即诸菩萨等。或本高迹下。或本下迹高。或俱高俱下。难可格量。第二别明净名本迹者。旧云。本是金粟如来。迹居妙喜為无动补处。或云。本是八地。迹现毘耶位居长者。若执意定判本迹者。為是何位金粟何位补处。若妙觉之金粟為妙喜之补处。此即本高迹下。若初住之金粟现十地之补处。即本下迹高。妙觉现妙觉。则本迹俱高。若初住现小乘补处。本迹俱下。岂别定判其优劣高下之位也</p><p>所说经者。此第二释通名。先总辩所说。后释经字。初所说者。肇曰。维摩詰秦言净名。法身大士也。其权道无方隐显殊迹。释彼妙喜现此忍土。所以和光尘俗因通道教。常与宝积俱游為法城之侣。其教缘既毕将返妙喜。故欲显其神德以弘如来不思议解脱之道。至令宝积独诣释迦因留现疾以生问疾之端建微言之始。妙唱自彼故称其说。生曰。维摩詰<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>无垢称也。其人晦迹五欲。超然无染。清名遐布。故致名斯号。贵名求实者必重其说。说本表实。重之则终得所求。因斯近接有过圣言矣。有说净名。说于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>不说自法。说自法即与佛抗行。今解。净名自证之法即是壹切佛法。故下文云。如自观身实相观佛亦然。问。净名菩萨所说何得称经。答。大论明<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>化人诸天仙人所说為佛所印皆称经也</p><p>二释经字者。依天竺语。佛之教首通标修多罗。或云修妒路。例如此土楚夏之别。古今诸师解释有异。或言有翻。或言无翻。今辩此义略為五意。第壹无翻。第二有翻。第三会通有无。第四正释经字。第五歷法明经。第壹言无翻者。外国有多含之语。即见修多罗名含五义。岂可但用经字翻之。故开善法师云。经非正翻。但以经字代处类比。此方周孔圣教称之為经。外国圣教类比应以此经字代也。言五义者。壹法本有三。壹教本即世界悉檀。二行本即对治為人二悉檀。三理本即第壹悉檀。亦云显示。示真理也。如<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>章示真<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>等也。二微发者。法王起教巧妙玄深。从微至著靡所不詮。是则文义渐显开发物心。初中后善<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>具足故也。亦云。出生谓闻法得道出生法身。经云。诸佛菩提皆从此生。三涌泉义者。此从譬受名。如涌泉流滔滔无竭。如弥勒章。得无所得即菩提之义。无边观眾生品悟生非生。则慈悲之名莫竭故云也。四绳墨义。亦从譬显也。如世绳墨能裁邪就正轨范有度。如不生不灭万行不可乖。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a><a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>四果不可异。又如<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>四等名不可易。蕴界处等数不可加。故云也五结鬘义者。此从譬以显。如缕穿花使无零落。大圣说法贯通理行亦无漏失。复次如百花异色更相辉焕。万行<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>互為映饰。如总持园苑八解浴池大乘宝车驾以白牛等也。此土既无名含。此五之言故用经字代也。第二言有翻者有师言。昔佛法初度。梵汉之语未通。故河西群学谓无翻也。今经论既度。梵汉之语复通。修多罗定有翻也。但诸师各稟异闻。文成非壹。略出五家翻释。壹翻為法本。具如前辩。二翻為契。即初悉檀契情二。三悉檀契行。第四悉檀契理也。此则如<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>解如法相说故也。三翻為綖。此因譬显义。与前结鬘义同。又结成行人三菩提之果也。四翻為善语教。谓大圣明鉴慈心顺理。复悉檀善巧化顺物情故也。五翻為经。以类此方极圣所说故也。第三会通有无唯取经字為正者。无翻者言此无多含之语。此亦未然。如此训字或壹或二。乃至多训如经训法训常及经纬等。岂非多含义也。又有翻者言今语既通定有翻者。此亦未然。若定有翻。何故五译不定。若减而存。壹义复不圆。若无名相中假名相说。悉檀方便起教是壹。适其根性即有翻无翻皆无滞也。故经云。依义不依语也。又两家五义皆以经字标题。不以契綖等為目。今立经字亦是融通无失。第四正释经字。略开四义。壹者经由义。二意。初云。圣言下备经由如来心口故也。二云。三代圣人莫不皆由悉檀之教而致大果。二者经纬义。生法师云。世之经纬成自素帛。斯之经纬显于行人真光綵也。三者常义。有二意。壹者邪不能坏。二者正不能异。故肇师云。古今虽殊觉道不改。群邪不能沮。眾圣不能异。故曰也。四者法义。安法师曰。谓体可楷摸。如此土六经显<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>人伦之是非也。第五歷法明经。有说三种经。壹声。二色。三法。初声经者。声教詮理故。大品经云。若从善知识处闻般若也。二色经者。寻文悟理故。大品云。若从经卷中闻般若也。三法经者。是法尘。谓心与法合思惟得证故。经云。修我法者证乃自知故也。问。餘三尘何故非法。答。此土<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>钝故。复次如法华明六根平等清净。此经下文因食香饭得道广明。六尘俱為佛事。不同小乘唯说娑婆音声為佛事。又大品明。诸法等故般若波罗蜜亦等。金刚云。壹切法皆是佛法也。壹名不可思议解脱者。此是第二大段从法受名。此经流布既多。申释亦眾。略开九家以相比决。初什曰。亦名三昧。亦名神足。或令修矩改度。或巨细相容变化随意于法<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>解脱于碍故名解脱。二者。生曰。不思议有二种。壹曰理空。非惑情所图。二曰神奇。非浅识所量。若体夫空理。则脱思议之惑。惑既脱矣。则所為难测。三肇曰。微远幽深二乘不能测不思议也。纵任无碍尘毕不能拘解脱也。四叡曰。菩萨无心应物有说。眾生但睹其教莫测其所由。故名所说為不思议也。虽说而无心故不碍于有。无心而说故不碍于空。空有所不能累。故名之為解脱也。五关内旧解。六地断正使。七地侵除习气。道观双流名不思议。正习俱尽名為解脱。六地持论师云。不真宗缘修七识智照<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>真理。断界内见思界外无明。是思议解脱。若真宗<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>真修体显<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>皆融无累。名不思议解脱也。七真諦三藏云。解脱有二种。壹不相离。即是诸法如如本有之理未与惑离也。二相离者。得法如如智断心障。与惑相离。相离解脱即不思议。八三论师云。若自他明缚脱。缚是自缚。脱是自脱。即是自性之缚脱。今明缚非自缚。由脱说缚。脱非自脱。由缚得脱。由脱说缚。即是假缚。由缚说脱。即是假脱。假缚非缚。假脱非脱。即是非缚非脱。毕竟清净。而说缚脱者。即是假名不思议之解脱也。九天台疏释有三意。第壹简别思议不思议相。二别释不思议解脱。三类通诸法。初简别中略為七意。壹约理分别者。若见可思议真諦之理而得解脱。即是思议。若见中道实相之理而得解脱。即是不思议也。下文。菩萨病非真非有等。二约智者。若是生灭智照即是思议。若是无生寂照之智即不思议也。故下文云。有惠方便解等。三约断者。若断烦恼而解脱者是思议。若不断烦恼而入涅槃即不思议。故文云。不灭痴爱起于明脱。四约界内外者。若脱界内惑而脱者即思议。若脱界内外者是不思议也。故法华云。但离虚妄名為解脱。其实未得壹切解脱。又下文云。法名无染。若染于法乃至涅槃。是则染著非求法也。五约有体无体者。若思议解脱即空无色心。若不思议有不思议实相体也。故大经云。解脱有二种。亦色非色。非色者声闻缘觉。亦色者诸佛如来。又云。妙色湛然常安住。仁王明法性<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>等。六约有用无用。若不思议解脱无无方大用。若不思议解脱有无方大用。故下文云。不起灭定现诸威议及须弥入芥子等种种大用也。七约共不共简者。若三乘共行侵除习等是思议。若别断五住是不思议。复次缘修与方便共名思议。真修非方便共名不思议。故法华云。正直捨方便也。复次有师云。下地不思议上地名不思议。若尔者声闻不知菩萨。外凡不知内凡。乃至世间伎术如蜂作蜜蜘蟵结网。亦非愚者所惻。岂名不思议。是则下不知上名思议。上能知不还成思议。今明不共不思议。下地不以思议上地上地不以思议下地。寂灭真如有何次。又华严云。究竟离虚妄无染如虚空。又下文云。非但分别思惟之所能得。问。上地不思下。如何得知。答。寂而常照。故知虽照而未常不寂也。二别释不思议解脱者。初约四句。今明不从自脱故。不约自性以立名。不从他缚起故。不约他性以立名。不从自他缚脱起故。不约共性以立名。不从离脱离缚起故。不约无因性以立名。从因缘立解脱名尚不可得。何况无因缘起以立名。是即不在内外两中间而说解脱者不思议也。是即无离文字说解脱相。解脱者即诸法也。约此而明不思议解脱。即具三义。壹真性解脱。二实惠解脱。三方便解脱。此三如上所由门及不思议品广明。三约类通三法者。略有十种。壹三道者苦道烦恼道业道。初即真性。二即实惠。三即方便。如次配之。下九亦尔。二三识。壹阿梨耶即第八。二阿陀那即第七。三波陀那即六识。三三佛性。壹正因。二了因。三缘因。四三般若。壹实相。二观照。三方便。五三种菩提。壹实相。二实智。三方便。六三种大乘。壹性乘。二得乘。三随乘。七三种法身。壹法性身。二<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>法身。三应化法身。八三种涅槃。壹性净涅槃。二圆净。三方便净。九壹体<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。壹真性即法。二二实惠即佛。三方便即僧。十<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。壹法身。二般若。三解脱。如是即真性解脱是净。实惠解脱是垢。方便解脱是称。此乃人从法立名。法从人受称。故得显发不思议大道也</p><p>大段第二明经体者。略开三意。壹辩体所以。二正明经体。三简偽显真。初所以须明体者。若寻经失旨。事同调达虽读八万法藏不免堕大<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。若得意亡言。即槃特壹偈成阿罗汉果。若不识经真性之体。虽复读诵修行终不能得无生法忍。故须辩也。第二正明经体。然此壹门经论异说。今古申释复多紊乱。统论其要不出二种。壹能詮之教。二所詮之理。故瑜伽论云。契经体者略有二种。壹文。二义。是即诸明假实音声名句文等并能詮教摄。如前释名门具以辩讫。若诸明真如性相等并所詮理摄。今此具明旧释。此经多用权实為体体即是宗。此释不然。何则天无二日。国无二主。岂可权实具明。又体据理明。宗据行说。偈得宗体同辩也。今但以不思议真性解脱為体者。此经云。淫怒痴性即是解脱。又云。诸佛菩萨有解脱名不可思议。又云。壹切法亦如也。然此真姓实相离四句绝百非。能轨生行人正智万行故独名体也。故大论明小乘经三法印。无常无我寂灭涅槃。大乘经壹实相印。又下文云。以陀罗尼印印之即经之正体也。若得三法印能入苦忍真明至无学果。若得实相印能入无生法忍得大菩提也。第三简偽显真即為二意。初简非实相。二显真实相。初中复三。壹简世俗经书。二简外人经书。三简声闻经。初世俗经书。但明安国治家偿善罚恶仁义礼智信摄生养性。乃至梵天说出俗论五通神仙之论并属爱论破坏惠眼不见真实。非实相体。二外人经书。多起身边二见。或计神及世间常。是事实餘<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。乃至非常非无常。堕十四难。生六十二见。各谓是实。以有所得起诸行业。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>并属见论破坏惠眼。故非实相体也。三声闻经。明无常等三法印。厌患三界尽苦涅槃。不能求诸法实相。亦非实相体也。二显真相者。摩訶衍教所明為利根菩萨诸法实相。不滞二边体用圆备。自利利他即真性解脱之体也。此中复有共二乘说不共乘说。共二乘者。如大品经三乘共行十地。声闻断正使缘觉侵习气菩萨能穷诸性习气都尽。譬如三兽渡河浅深有异。二不共二乘者。有渐有圆。渐者。双断二障得实相菩提。圆者。淫怒痴性即是解脱。壹切法即佛性涅槃如来藏也。或名壹实諦。或名自性清净。或言如如实际。法性法身中道毕竟空等。故大论云。般若是壹法佛说种种名。大经云。如天帝释有千种名。解脱亦尔。多诸名字。此亦得通為诸大乘经之正体也</p><p>大段第三佛国因果為宗者。斯乃眾行之纲要诣理之关枢。窃寻经论。亦不分宗体之别。但传经者巧宣<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>开发物心使有归趣。前既非因非果真性為眾经体。此乃而因而果。為眾经宗。举因则摄万行。举果则摄万德。故双举因果為眾经之纲要也。如大经明。<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>涅槃之果非无五行十功德之因。大品明。般若智照之因非无种智涅槃之果。此经宝积陈请具问因果。愿闻佛国清净之果。说诸菩萨净土之行為因。如来竖明四句答果。横明眾行答因。乃至入室问权疾果。问。实疾因不思议品明果。次下三品明因。香积净土為果。八无疣行為因。示阿难佛土不同為果。请法退还為因。妙喜来此為果。发愿生彼為因。是知前普集等明法身正报。此中明净土依报故。如来合盖现土使物归心。正明宗之大意</p><p>大段第四权实善巧為用。既修因得果故有权实之妙用。令诸眾生断疑生信。略為三意。壹明权实。二明折伏摄受。三明通此经文。初明权实者。有人偏用权巧。莫测為用。此明用偏也。今言权实悉得為用。问。若实是体。从体起用。那得实亦是用。答。权实有三种。壹化他权实。诸佛菩萨无名相中假名相说种种权实皆是随他意语。二自行化他权实。诸佛菩萨自行随自意语為实随他意语為权。三自行权实者。诸佛菩萨自行所有二諦三諦之理以辩权实也。此中明用即化他权实也。二明折伏摄受者。如胜鬘经云。应折伏者而折伏之。应摄受者而摄受之。所折伏摄受故令<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>久住。今净名菩萨為令不思议法得久住故。是以以方便折伏实智摄受故。室外弹呵室内摄受。使令信受住不思议解脱也。三正通经文略举四。例如方便品。诸仁者此可患厌即权折伏。当乐<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>即实摄受。如善吉章明。于食等者于法亦等。是实折伏。又云。如佛所作化人。若以是事詰是权摄受。若实折伏实摄受。如弥勒身子等。若权折伏权摄受如迦旃延等并至文广辩</p><p>大段第五判教相同异者。前虽广明名等四义。未辩此经与诸经赴缘同异。略出三意。壹明辩教相意。二明古今同异。三正明判此经。初辩教相意者。寻夫至圣无言。言之者為物。物情既异。赴缘之教亦多。如花严独明大乘阿含偏说小教。或乍开半满而同归佛性。或总会三车而俱至宝所。故先德诸师各為理释欲使大小区分权实有在矣</p><p>二明今古同异。有三意。壹约义。二约时。三别料简。壹后魏留支三藏立壹音教引此经云。佛以壹音演说等。二北凉曇无讖立二种教。壹半字小乘。二满字大乘。三陈真諦立三种教。壹转法轮。四諦是。二照法轮。诸般若经是。三持法轮。解深密等是。四隋笈多三藏立四种教。壹四諦教。小乘经是。二<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>教。般若经是。三法相大乘。<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>是。四观行大乘。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>是。又宋地论师大演法师亦立四<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>。壹因缘宗毘曇论等。二假名宗。成实论等。三不真宗。般若经等。四真宗。如华严涅槃经等。乃至齐护身法师立五宗教。开前第四涅槃明佛性為第四真实宗。华严法界為第五法界圆明宗。二就时者。道场观岌二师三时明义。第壹时说有相法轮。第二时说无相法轮。第三时说<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>法轮。若四时明义者。生法师云。始自道树终乎泥洹凡说四种法轮。壹者善净法轮。谓始说壹善乃至四空令去三涂之秽。二方便净法轮。谓无漏道品得二涅槃。三真实法轮。谓破三之偽成壹之实。四者无餘法轮。斯则会归之谈乃说常住妙旨。若开善光宅二法师判三种教。壹顿。二渐。三偏方不定。渐中分為五时。壹顿教。谓华严经也。二十二年前说有相教。小乘教也。三十二年后说无相般若教。四抑扬教。此经是。五同归教。法华涅槃也。三别简此经去取者。先半满明义。此经满字与华严等不异。三时明义属。第二无相得道未明佛性常住。若四宗明义。是真宗大乘及出缘起之教。五时明义是第四抑扬之教由未会三归壹及明常住佛性也。次详定者。若言此经未明佛性者。此明真性解脱。岂非佛性耶。下文明如来种。种即性异名耳。若言未明常住者。下文明金刚之体。夫如者不异。如无有生。如无有灭等。岂非常住耶。若真宗同法花者。何得声闻未受记也。若满字同涅槃者。彼是醍醐。此乃由是生苏教也。备如法花玄义。烦不具载第三明近判释。初约义及时。二就乘兼藏。初中经教有四。壹者顿。二者渐。三者不定。四者祕密。初顿者。如花严经云。譬如日出前照高山。又如大经云。雪山有草名曰忍辱。牛若食者即得醍醐等。二渐者。即五味相生即是从小乘事戒定乳得生灭四諦酪。次方等大乘最初说无生四諦无量无作对破小乘呵责声闻乐小法者。即是从酪出生苏摩訶般若。亦具说无生无量无作令声闻转教。即是从生苏出熟。如是法华说壹实无作四諦。為诸声闻开佛知见。悉受记别。乃至大经為诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>说圆伊三点佛性涅槃安置诸字祕密藏中。即是从熟苏出醍醐。如此明五味之义。与常途壹往似同。细心比并亦大异也。三明不定者。亦不同旧解。别有偏方不定之说。今但于前五味教内利根之人处处悉皆得见佛性。故有满字之义大经云。譬如有人致毒于乳。乃至醍醐亦能杀人。所以梁武流支摄山三家明此经大品皆是满字明佛性常住意在此也。四祕密者。大论云。佛初转法轮显露教中。明五人得须陀洹果八万诸天得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。祕密教中无量菩萨闻说大乘得无生忍。又云。从得道夜至泥洹夜常说般若。又此经云。佛以壹音演说法。眾生随类各得解。此是祕密之相。今判此经非是顿教。乃是五味渐教生苏之味。若约不定。即是至生苏而杀人。入<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>住不思议解脱也。若祕密即不可出也。二就乘兼藏者。先明乘者。有说二乘。壹大。谓满字。二小。谓半字。有说三乘。谓声闻缘觉菩萨。复次法华经于壹佛乘分别说三為权。十方佛土中唯有壹乘法是实。即是权实具论為四。故胜鬘亦云三乘归依非究竟归依故也。复次婆沙等论明生灭三乘。大品经明无生三乘。瓔珞等经次第壹乘。花严等经明圆顿壹乘通明乘者。运载為义。此经具权实半满通论也。二就藏辩者。有说二藏。谓声闻菩萨。婆沙明三藏。谓素怛揽藏经也。毘奈耶藏律也。阿毘达摩藏论也。分别功德经明四藏。三藏外别立杂藏。杂詮戒定惠也。法藏部立五藏。谓四藏外别立菩萨藏。对法论立六藏。谓大小各三。胎藏经说八藏。谓大小乘各四有经律论杂也。总名藏者。梵比摘迦。此名為藏。以蕴积為义也。此经就人明藏。即菩萨藏摄。故文云。菩萨法藏所摄。就法明藏。即<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>摄。故文云。我虽从佛闻百千经。未曾闻此决定实相经典也。问。十二部经此是何部。答。不然。十二部者非是别有部卷。盖随经义类以分别。故今经皆具申明此义。略开二重。初正明义。后对文。初中三意。壹翻释名。二辩体相。三简差别。初释名有总别。总者十二部名意。如前略答。故新云。十二分。释别名者。修多罗。如前明。大经始终通名也。二祇夜。此云重诵。长行未了。偈颂再宣三和伽罗那。此云受记。圣智悬监记当事故。四伽他。此云讽诵。以妙言词结句宣唱。五优陀那。此云无问自说。圣慈哀愍不请而宣。六尼陀那。此云因缘。杂集论云。又有因缘制立学处。七阿波陀那。此云譬喻。法说难明。假喻以况。八伊帝目多伽。此云本生。自说昔因所生事。九闍陀伽。此云本事。宣诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>过事故。十毘佛略。此云方广。真理正直遍诸法故。十壹阿浮陀达摩。此云未曾有。亦云希法。神变无方罕闻见故。十二忧婆提舍。此云论义。宾主往来詮正理故。二辩出体相。如前分别三。诸门有四。初部藏同异者。统据宗詮。是三藏收随分别明。是部分摄。如此经藏唯是经分开十二。又瑜伽云。阿毘达摩摄论议。毘奈耶摄因缘。餘并修多罗摄。复次部藏各有通别。修多罗通詮三学。别唯詮定。部中修多罗是通餘皆别故。第二立所以者。大经云。以能听者所宜闻故。又对治十二入<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>故。又三转十二行法轮故。又诸佛法尔故。第三大小多少有四。壹大具小闕。如法花经云。我此九部法随顺眾生说。小乘不求大果故无授记。必藉师资故无自说。无常理狭故无方广。二小具大闕。大经云。护大乘者授持九部。菩萨上根非藉缘。制戒无因缘法说即悟。无譬喻。又非詰问。无论议。三大具十二小唯十壹。瑜伽云。方广唯菩萨藏。所餘诸分声闻藏。有四大唯有壹小具十壹。瑜伽云。除方广分餘声闻藏也。第四相摄者。契经重颂。长行偈诵。二各别故。契经讽诵亦不相摄。单重别故。所以此三唯有十部二本不相摄。师资别故。此二唯十壹。餘之七部各具十二。可知</p><p>大段第二明对此经文者。此经方等大乘理微辞瞻权实兼备。何所不该。以义对文显。不烦具。复次华严初教依理圆说。三点法界理深意圆。菩萨独证二乘不悟故。次于阿含经中权说小乘。涅槃言。佛与二乘同壹解脱。各<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>故。次于大乘经癈权示实故。此经示不思议解脱点。明二乘解脱非真。故经云。佛為增上慢人说离淫怒痴為解脱耳。若无增上慢者。淫怒痴性即是解脱。二乘既知解脱之不真。鄙小慕大故。次于般若经中明摩訶般若点。照空色平等苦乐壹如。令知十智之非实。既二乘渐见真智故。于法华经等明释迦多宝不生不灭非长非矩同壹法身。示法身点也。二乘既皆会小归大故。最后涅槃明三点圆伊。不偏不别不壹不异。终焉然。今经据理三点常圆。在名偏当解脱。抑小扬大经之意焉</p><p>释序文四</p><p>初统明诸经不思议权实之道。二就群生长寝下别明此经权实本迹大体。三大秦天王下辩译由始。四餘以闇短下明注解之意</p><p>穷微者。穷实相之幽微实体也。尽化者尽权应之变化权用也。此即名故云妙绝之称也。此上辩不思议之名之。旨意也渊深也。玄远也。言像名相也。此句明意趣也三空者。无相无愿也。二乘癈有存空。中道空有不二故非其所能议也。此句明道理也群数者森罗万有。理超事外故言表也。此句明坏三界诸识取相生心名有心也。真境无相故有心自绝也。此句明智无為等者。法身无為应物。而為惑者不测。名不思议也。已前总明也</p><p>何则已下对缘辩也。智无知体也。俱照用也。此明圣心。亦即诸部般若经佛智也。无像真身也。并应应身也。如下七言偈云。各见<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在其前。及佛道品现种种身。皆是佛壹身也。如法华经明。昔说佛寿长。是即法身非短长无像也。应身现短长并应也。如涅槃明。佛入灭度。又云。而常住不灭。即是法身非生灭无像也。应身现王宫生双林灭亦并应也。又弥勒身长二百五十尺。释迦身长丈六短。亦法身非大小而应物有大小。尔皆并应也至韵者。谓至教起于无言之理也玄藉者。十二分教深玄之典藉。应根施教故云弥布。弥即遍也。如法华明。昔说三乘。而至理非三。布教应三壹也。是即至韵无言理壹也。玄藉弥布教殊也冥权等者。此明<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>权实也。至应无心故无谋也。冥与物合名冥权也。而动即应物故无事不会也。如壹月在天影现百盆随器。大小无不会也。又如壹谷在下随声。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无不应也。是即幽谷无善恶。喻圣心无谋也。异响随声喻事会也。又小乘菩提树下得十智為智。大乘了心无生名智。小乘王宫生相好身為身。大乘了相无相為身。小乘以鹿苑说法為说。大乘以了言无言為说。小乘以思惟根感应為化事。大乘<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>而应為化事。复次初句明圣心不思议。第二句明法身不思议。第三句明教不思议。第四明应会不思议也开物成务者。开导三乘為修行。作务皆获<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>无虚设故。惑者。谓惑著之徒。闻智即执心。见形即著身闻教即滞言。观权即谓变。此皆在圣不然。惑谓然也文殊异方者。有云。宝相佛国来下注云。游方菩萨不知所之也不思议本者。万行六度慈悲宗极皆内证实相故名本也。借座请饭等皆外应眾生故名為迹也。又非迹不可以生物信。非本不可以令物证也。如见莲华大方信池水深要睹神变大方信所证妙。复次证理无相故不思。无名故不可议。故经云。言语道断谓名亡也。心行处灭谓相尽也。此释本不思议。又欲言小室能含多座。言其大室相不异变化万端非心所测。此名迹不思议也乾像者乾天也。八未曾有室诸天宫殿常现室中故云室苞乾像也幽关者。实相真筌也。非本无以垂迹者。非见圣人内证实相之本方能外现神变之迹。眾生因睹神变之迹生信方能修行自证实相之本也。是即本迹内外虽殊。而引物证真莫测之心壹也。天台本迹五重如前可见栖神者。言此经是神解所栖託处也支竺者。支谦竺寂兰竺法护等理滞于文者。谓叡疏序云。既蒙鳩摩罗什法师正玄文摘幽旨。始悟前译之伤本谬文之乖趣耳。至如不来相為辱来不见相為相见未缘法為始神缘合法為止心诸如此比无品不有无章不尔。又云。此土先出诸经。于识神性空明言处少存神之文其处甚多。中百二论文未及此又无通监。谁与正之先匠。所以輟章遐慨思决言于弥勒者良有在也北天之运者。大品经云。我灭度后般若流南天竺。次至北天竺当没于地。今此国即北天之东隅。罗什至此大传般若。即佛记北天之运数法合流行此也。弘始八年姚秦时也。什弘始三年冬到秦。而先译大品智度<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>门百。随译随讲。而生肇诸师皆悉啟悟。生公述顿悟义。肇公述般若无知等论。什见妙解至八年方重译兹经及法华等。所以理圆意题迥超万古也岁次鶉火者。尔雅云。子年困顿。丑年赤奋若。寅年摄提格。卯年单閼辰年执徐。巳年大荒落。午年敦祥。未年协洽。申年涒滩。酉年作[木*咢]。戌年阉茂。亥年大渊献。正月析木。二月大火。三月寿星。四月鶉尾。五月鶉火。六月鶉首。七月实帆。八月大梁。九月降娄。十月陬嘴。十壹月玄[木*咢]。十二月星纪。弘始八年太岁在午。应云岁次敦祥。而云鶉火者以月命年也长安者。有本云。常安。以秦王父名姚长讳故改名常也既尽环中者。语出<a href=\"/ctwh/zi/djjd/zhuangzi.html\" class=\"keylink\" target=\"_blank\">庄子</a>。云。是非相待。犹如循环。至道亡是非。由如环中也。今借言以表中道也陶冶者。今造化经文务存圣意。若炉冶之所造也文约而诣者。其文简约而理诣也其旨趣婉顺而彰明也如弥勒章明菩提等。即文约而诣。其佛道品答眷属等是旨婉而彰。诸如此例讲者。叙之时预听次者。什法师随译随讲务传至妙。肇法师等随听随述务流大观。广如传述述而作者。<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>意云。唯圣作法。餘但依教修述而已维摩詰广如玄述。若言净无垢称。净即法身性净。无垢即报身无漏功德也。称即应物称根亦名称也。若单云无垢称亦云净名。无垢即净。称即是名。此即二身释也。谓净真身称即应身。下文云。观身实相。观佛亦然。此净名真身也。从妙喜国来游此界净名应身也。乃至方便品得无生忍等真身也。虽為白衣等应身也显迹悟时者。谓显净名迹示本法身以悟时人也若自说而观等者。自从也。若真从说之功而观。即净名与文殊等诸圣功齐。不应独标名也。寻经本原由于净名故独受名也</p><p>什法师者。高僧传云。什父天竺辅相之子。名炎姓鳩摩罗。祖亡次当袭位。避之东游至龟兹。龟兹王妹白纯体有赤黶。法生智子诸国聘之不受。及见炎心欲当之。王遂逼妻。炎纳生什。什年七岁<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>学小乘十三从师须利耶摩受业。摩為说阿耨达经。闻阴界入空无相。怪曰。何故此经破坏诸法。摩因為说诸法因成故无真实。什遂专务方等受诵三论。初得放光经。魔来蔽文唯见空纸。因发誓习诵。字出如常。复闻空声。空声曰。汝是智人。何故读此。什遂呵叱令去也。又什母将什至北天竺。有壹阿罗汉名达摩瞿沙。见而异之。谓其母曰。善守护之。若三十五不<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。度人如优波鞠多。如不然。可才明绝代而已。后欲东化。什母谓曰。方等深教。大阐真丹唯尔之力。但于自身无益。其可如何。什曰。大士之道利彼亡躯若使大教流传能洗[目*吾]蒙俗。虽复身当鼎鑊苦而无恨。又录云。前秦符坚立十六年有德星现外国分野。当有知人入辅。中国得之者王坚乃使。符丕攻襄阳取释道安。吕光求龟兹取罗什。后坚伐晋败為姚长所戮。即姚长立為后秦。吕光迴至姑臧。闻主既丧遂潜号关外称后凉。长崩兴立弘始三年春有树。连理生于庙庭。逍遥壹园葱变為薤。咸称嘉瑞。冬什到雍兴。加礼遇待以国师。崇敬甚重。大兴法化于大寺草堂及逍遥园。与什及三千硕德亲自翻译。至理之兴其在前矣。什又著实相论注净名经。雅好大乘尝叹曰。吾操笔著摩訶衍阿毘曇。非迦旃延子比。餘广如传</p><p>肇法师者。开皇录云。俗姓张氏。长安人也。家素贫乏。以佣书為业。遂因缮写乃得寓心歷观经史备尽坟藉。性好玄微。每以庄老為心要。尝读老子至道德章。乃叹曰。美则美矣。然期神冥累之方犹未尽也。后因见古维摩经。欢喜顶受披寻翫味。乃言。今始知所归矣。因此出家学善方等兼通三藏。乃至冠年而名振关辅。时竞誉之。徒莫不猜其早达。千里负粮入关。挽辩承机挫锐曾不流滞。什至姑臧。肇自远从之。什嗟赏无极。及什适届常安。肇亦随返。姚兴命肇与叡等助什详定。因此諮稟所悟更多。因出大品。肇便著般若无知论呈什。什读称善乃曰。吾解不谢子词当相楫。什重出此经。肇笔受。因之注解及製序呈什。什又叹曰。解空第壹肇公其人。又庐山隐士刘遗氏见无知论乃叹曰。不意方袍复有平叔。因以呈远。远乃抚几叹曰。未尝有也。及什亡后。又著涅槃无名论见传于世。又常州弘善寺宣法师讚曰。般若唯绝鉴。涅槃固无名。先贤未始觉。之子唱希声。秦王嗟理诣。童寿挹词清微。音闻庐岳精难动中京适验方袍里奇才。复健生注云。法身大士者地前菩萨结业生身。初地至七地随愿受生十方净国也。八地已上了法身无生应物受生也。今言法身即八地已上。此依仁王经分别也</p><p>生法师者。三藏记集云。法师彭城人。幼而颖悟。父知非常。将诣法大道人。改服受学。而俊思卓拔。披<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>文壹览能诵。研味句义即自解说。是以年未至学便登<a href=\"/remen/jiangzuo.html\" class=\"keylink\" target=\"_blank\">讲座</a>。吐纳奇辩词清珠玉。高僧名士屡挫辞。穷年至具戒声遍区夏。初住龙光寺下惟专业。后移庐岳幽栖七年。常以為入道之要惠解為本。故钻仰群经斟酌眾论。遂与严观等同往长安从什受学。关中僧眾咸嗟秀[目*吾]。妙贯龙树大乘之原。兼综提婆小道之要。博以异闻约以壹致。乃喟然叹曰。由自经典东流。译人重阻多守滞文鲜见图义。若亡筌取鱼则可以言道矣。乃立善不受报及顿悟等义。而守文之徒多生嫉妒。与夺之声纷然互起。又六卷泥洹先至京都。剖拆佛性洞入幽微。乃说壹切眾生皆有佛性。于时大本未至。孤明先发独见。迂眾旧学僧以為背经邪说。遂被摈逐。生眾中誓曰。若我所说反于经义者。请现身癘疾。若与实相不相违背。愿捨寿之时据师子座。言竟拂衣而逝。以宋元嘉七年投迹庐山。销影巖阿怡然自得。俄而大经本至。佛性之义与前说符同。生以元嘉十壹年于庐山精舍昇于法座。神色开明德音骏发。观听之眾莫不悟悦。法音罢唱麈尾忽坠。端坐正容隐机而卒。道俗嗟骇远近悲悼。京邑僧眾内惭自疾矣</p><p>製十四科法华涅槃疏及注此经。显畅新异。理切词简。讲学之匠咸共宪章焉。胡音云者滥也。新云梵音印土正言同梵天音也。终南宣律师云。释道安仪法尽正。而以梵為胡。犹崑山之壹砾也晦迹者。晦闇也贵名求实等者。若因菩萨胜名以求实法者。则必因净名之嘉名以重其所说。净名既本表实证以重名。则令学者因名以重法。故得所求也因斯近接者净名同凡接物也有过圣言矣。不以文殊等诸圣名经。独以净名名之故云过也。以净名同凡接物故。独标经名也。经义如玄也。又沮坏也。夫教以陈理理不可易故教自常矣如不净观以治贪欲因缘观以遣邪见等。理不可易也。若外道失理。施教即究竟自坏。如杀羊事火求生天等理必不然也亦名三昧者。证解脱体也。亦名神足。明解脱用也。巨大也。细小也。若直明法空等下。明外现不思议事以证理也肇曰微远幽深者。明中道实相。内证烦恼即菩提名不思议也。外用无碍為解脱也生曰或止形迹心不安然者。谓若单言无垢称。或谓应形迹中不染尘累不委。心安何法。故复言壹名不思议解脱。即是心所住法也其求愈到者。到至到也。彻倒也。若令求者。彻到何患不悟矣</p><p>叡法师者高僧传云。法师魏郡长乐人。少出家二十二博通经论。听僧朗法师讲放光经。屡有讥难。朗与师僧贤有豪上之契谓贤曰叡比难。吾累思不能通。可谓贤。贤弟子罗什至秦命叡入逍遥园详译。秦王兴问姚嵩曰叡公何人。答曰。此实业卫之松柏兴敕见之。观其风韵洼流含吐彬蔚。乃谓嵩曰。此乃及四海之标领。何独业卫之松柏也。什出成实论令叡讲之。什曰。此论有七处破毘曇。而在言少隐。若能不问而解。可谓英才。叡啟发幽微。果不諮什而契然玄会。什译法花至受决品。旧本云天见人人见天。什曰。此语与西域同。但在言过质。叡应声曰。将非人天交接两得相见。什叹曰。吾传译得子真无所恨矣。又佛讚之业皆愿生安养。每行住坐卧不背西方。<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>合掌。五色光从叡而出。又疏记此经及製序。如别注云</p><p>菩萨无心者。非石木之无心也。直以凡夫取相分别心说故名有心。菩萨常观无相无分别心。而方便应物假名相说。故名无心</p><p>佛国品者。夫身非身。亦真土非土。而应身在世示有统御。故各有所化之处。如娑婆香积各有疆域也。亦名佛土所依住也。佛剎世界释亦同也。此有二。壹者真土。如金光明云。毘卢遮那遍壹切处。其佛住处号常寂光。此以真如法身非身為身。亦真空净土非土為土。又花严云。菩萨清凉月智身也。游于法性空(真如土也)眾生心水净(土也)菩提现中(身也)此皆真身真土。二应土者。下文云。眾生之类是菩萨佛土。此明菩萨应眾生之善恶取佛土之净秽。又下文云。诸佛如来功德平等。為度眾生现佛国异(净秽异也)又云。诸佛国土永寂如空(真土也)而现种种殊胜佛土(应土也)又云。虽知诸佛国及与眾生空(真土)而常修净土<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>于群生(应土也)品文及下自明故关中诸师不释也三分者。释文大体略有二种。壹关中注解。真明理宗诸禪师释通但辩观理。并造文便解。不开科段。又近代诸师文起尽各有科酌。而取捨多异。而今讲者必不可偏。然随文生起不可遗于科段。而文理相承正相通会不可隔。以科文取捨之宜异在说者故。兴皇朗云。夫适化无方陶诱非壹。考圣心以息患為主。统教意以开导為宗。若因开道得悟。则圣教為之开。若由合而受道。即圣教為之合。如其两晓并為<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>必也。双迷俱成毒药。此则开合<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>事无恒准序分者。或引时方说处。或<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>合盖。或称叹讚扬。此皆令物生信故也正宗者。或谈真应二身。或示真应二土。皆令悟理剋证故总明悟也<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>者。或讚法供最胜。或慇懃嘱累。此皆委法传通也三序。壹证信者。正宗為智多明无相。事随理显。惑者多疑故。集经者引时及处。化主同闻既事迹炳然。兼翻传不谬。则令听者因事证事证之不虚。亦信无相之真旨。故言引事证信也。即诸师集译经图纪传助宣法化意皆尔也。此中有千圣结集。二土传化。文广不具也二合盖现瑞序者。亦名表发序。之正宗為悟。谈经深旨。凡心信难故。此说者广现神变使观异生信又合盖现土表说净土即表发序。如法华云放壹光以表壹乘之旨。仁王云现莲华以表出生诸佛。有所表彰故言表发。善法先兆故言现瑞。由如嘉禾醴泉孝子之祥兆。河图洛书明王之休禎也三称叹序者。正宗多示修门故行之為艰。此中广讚<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>德。使慕果深于<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>即修行之门不倦故讚之也。又若不仰德无边。何以申其敬请。故先讚德也。证信序般若灯论分七段。我闻分二。我為能闻人。闻為所闻法。餘五同也。智论六段如疏。佛地论五段初如是我闻合為壹段。此盖随时科酌亦非是义无劳烦叙。然佛说经欲令闻者深入实相返生死流。序分证经略通文句。正宗至理须广申明。所以顺佛讚经不可于此繁重。正宗真观便略指点而已</p><p>如是。大论云。如是善信之辞。不信者言是事不如是。信者言是事如是。佛法大海信為能入智為能度也。然论及注但以如是信辞故。直释信不释如是字也。此既非是正宗祕理。不劳广引繁辞我闻者。注文证经意足不烦更释。然欲横叙者。大论云。随俗故说我。和合故称闻。谓阿难等虽悟无我而顺俗传经故称我也。和合闻者。根境识三和合為闻也。若阿难云我说。智既未圆鉴法不深。故不可信。若言传闻即或致偽谬故也。今言我闻乃是亲闻而不自说。故可信也。问。室中六品阿难在菴园不闻何言我闻。答。报恩经说。阿难佛命為侍。乞佛四愿。壹不受故衣。二不随别请。三有欲见佛由我制止。四所未闻為我再说。今室中六品及佛初成道阿难未侍之前兼涅槃之时所未闻经皆為他再说也壹时者生曰。物机感圣圣能垂应。凡圣道交不失良机。谓之壹时又云。说听究竟故言壹时。问。何不定言春秋等。答。佛地论云。昼夜时分诸方不定。不可别说佛在者。此是说经主证成可信。此有二意。壹戒净故。永离虚妄所言诚諦故可信。二悟圆故。智照无瑕说必称理故可信。文中亦菩萨弟子说者佛所印可咸得名经。如世臣下有事奏上于君主依行即名敕也在者住也。大论云。四种住。壹天住。住施戒善。二者梵住。住四禪四无量三圣住。住三脱门。四者佛住。住佛无量功德力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>等。真諦加四。壹境界住。住十六大国。二依止住。住僧伽蓝。三威仪住。行住坐卧。四未捨<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>未般涅槃也。今言住。住菴罗园说也广严城者。旧梵云毘舍离。西域记云。中印土吠舍釐国周五千里。此云广严。说经处也支道林云。法身虽无不在。应迹必有方所。若不记之说处由為猛浪耳。然佛真净法身住本法性广严之城。大悲应物住人间广严之城。此即从本垂迹因迹显本也菴罗园者。此园是菴罗树生壹女。国王异之以园封女。女见佛欢喜捨作伽蓝。故名园也。故西域记云。吠舍离城南不远。精舍前有卒堵波。是菴罗女园持以施佛处。园者梵曰僧伽蓝摩。此云眾园。非以种菜為园。但修治道树為园也。故云总持之园苑。亦如道场是<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之场也。又此园城通指之耳的辩处者。此经佛国弟子菩萨三品及下菩萨行见阿閦法供养嘱累七品的在菴园。问疾下六品文殊入室即在净名室内。方便壹品据本化事还在室中。若宝积对佛宣陈及佛印时即在菴园。又香积品亦有彼国。问答亦随品收之。不别论也。事在他经者。吴本云。奈氏园误也。谓奈女经有人见经说奈女生谓即菴罗女是奈女。失正事也与大比丘下列眾。有云。其意有八。壹為证信助成道。阿难同闻可信。二為显德。释梵围绕显佛德故。三為啟请问净土故。四為发明净名德故。五為当根益故。六為同事。引摄有缘故。七為成就。修行法供养故。八為承受。付嘱誓传经故与大比丘与者共义。谓阿难共闻也。此之壹与贯下诸眾。大论七义共。壹相同无漏相壹心同无漏定。壹见同正见。壹道同无学道。壹解脱同俱解脱。壹时同闻经时。壹处同菴罗园也大者。佛地论四义释之者。壹利根波罗蜜种性。二者无学果。三不定种性迴心向大。四眾数多。大论五义。壹壹切眾中最上故。二诸障断故。三诸王大人敬故。四数多故。五破九十六外道论故比丘四义净乞食者。离四邪故。壹下口食。耕田种植故。二仰口食。仰观星像等。三方口食。通致使命故。四维口食。占卜等。五邪者。壹现异改常。二高声示威。三自说功德。四占相吉凶。五讚所得利萨埵。秦言大心者。大论云。有大誓愿(愿大名大四弘誓愿也)心不可动(心大名大四魔不动)<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>不退(能忍难忍)初愿大。即成眾生义。二心大。即大心眾生义三精进大。即勇健义也。十地论有十种。壹菩提萨埵。从菩提智生故。二摩訶萨埵。住大乘故。三第壹萨埵。证第壹法故。四胜萨埵。<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>胜法。五最胜萨埵。智惠最胜故。六上萨埵。起上精进故。七无上萨埵。开示无上法故。八力萨埵。广知十力故。九无比萨埵。世间无比故。十不思议萨埵。壹念<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>故。又如下不尽有為中明不离大慈不捨大悲生死无数劫意而有勇闻佛无量德志而不倦等皆是明萨埵心也。结业身者。小乘俱舍所明乃至成佛入涅槃皆结业身。不明法身应生。大乘所明法身应生。仁王云。地前菩萨三十心结业生。初地至七地随愿生。八地已去法身无生。应物现生。此法身也大智本行天台云。大智叹解本行叹行。解如于目。行如于足。目足备者到清凉池。又有二智。实皆权智。实智是本故大。又三智。壹壹切智。观空。二道种智。照假。三壹切种智。照中。智体用圆故名大智。又有四智。壹成所作智。二妙观察智。三平等性智。四大圆镜智。此第四為大。小乘十智非此明也法城。韦昭释名云。城者盛也。盛人物故。博物志云。夏禹作城。强者攻。敌者战弱者守。今佛法亦尔。弱以戒守。敌以定战强以惠攻。故借喻也。十地经说四种护。壹护教法。书写演说故。二护理法。自证教他故。三护行法。自行教他故。四护果法自成教他成故也悉以清净者。外道六行断结断已复生。二乘见修二道断惑不了本性寂灭故。皆不名悉已。菩萨了本寂灭故名悉已也五盖十缠如常。无量盖缠者。圆满大乘壹切烦恼同迷真理故。凡起惑等名盖缠。以等覆真理故。下文云。诸烦恼是道场。知如实故。又云。壹念知壹切法是道场。成就壹切智故。准此或若不等覆真理。岂悟时壹念同知壹切法也七辩者。大论云。捷疾辩(于法无畏故)二利辩。利根深入故。三无尽辩。实相无尽故。四不断辩。无诸戏论故。五随应辩。已断法爱故。六义辩。得涅槃利故。七世间最上辩。说大乘事故七德者。七波罗蜜也。治七蔽垢故。壹壹切殊如施治慳等无相不异故言其相不异逮无所得者。逮及也。谓及至第八地以无所得名无生忍。不起即无生也不退转法轮者。小乘但名法轮。有生灭故。大乘名不退转法轮。理无生灭故。转者说也饰形靡俗者。靡偃也。谓三十二相说法生善。如风靡草。书云。君子之德风也。小人之心草也。风偃草化导行也深入缘起等者。谓观智深也。外道邪因无因故堕邪见。二乘观十二因缘生灭无常故。但断正使。菩萨观因缘不生不灭。无无明亦无无明尽。深入达实相故。无复餘习气也。近无等等者无等等佛也。今大士自在智惠能近也。天台云。等观观空也。不等观假名差别也等不等者者。中道正观体圆故等。用异故不等不净喜者。喜受也。清净法喜也。假名天。大论云。如国王名天子也。生天者诸天也肾圣天者。证第壹义天也妙生者。亦可从法化生也四梵行者。思益云。慈悲喜捨也天龙杂眾者。此中有人有天有凡有圣有本有迹。故言杂。问。此等八部若善业所招合受人天之报。若是恶业不合见佛闻法。今形受龙鬼而预会闻法何耶。答。天台云。过去因异壹。若戒急而乘缓者。受人天身不闻正法。二若戒缓而乘急者。受龙鬼身而闻正法。三若乘戒俱急。即受人天身闻法。四若乘戒缓者。受恶身而不闻法。以斯不同故形法异缘也大威力诸天者。壹欲界六天。壹四天王天。在须弥半腹住。二忉利(此云三十三天)在须弥顶。三夜摩(此云妙善)四兜率(此云妙足亦云知足)五须涅密陀。此云化乐。自化宫殿而游乐也。六波舍跋提。此云他化自在他化宫而游也。二<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>有十八天。壹初禪三天。梵眾梵辅大梵。二二禪三天。少光无量光极光。三三禪三天。少净无量净遍净。四四禪九天。壹无云天。二福生。三广果(已上凡夫三品天也)四无相天(外道天也)五无烦。六无热。七善见。八善现。九色究竟(此五那含天也)<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>有四天。壹空处。二识处。三无所有处。四非想非非想处。释此诸天五门不同。壹明身量。<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>颂云。赡部洲人量。三肘半四肘(肘尺五寸)东西北洲人。倍倍增如次。释曰。赡部人身长六尺。东洲倍南。西复倍东。北复倍西也。欲天俱卢舍。四分壹壹增。释曰。俱卢舍二里。四分增壹者。初天半里乃至第六天长三里。色天踰[跳-兆+善]那。初四增半半。此上增倍倍。唯无云减三。释曰。谓梵眾半由旬梵辅壹由旬。梵王壹由旬半。少光二由旬。此上增倍倍者。无量光四由旬等也。唯无云天于增数内减三由旬。二明寿量。论颂云。人间五十年。下天壹昼夜乘斯寿五百上五倍倍增下天者。谓四天王天。言倍倍者。壹倍倍日月壹倍倍寿命。色无昼夜殊。劫数等身量。释曰。谓梵眾身半由旬寿命半劫。梵辅身壹由旬寿命壹劫。已上准知。论颂云。无色初二万后后二二增。释曰。谓空处二万。识处四万等。三明初生量。颂曰。欲初五至十。色圆满有衣。释曰。谓欲界初天初生如五岁。乃至第六天如十岁。色天初生即圆满复身有衣。盖重惭愧心修因故也。四天宫相去。论颂曰。如彼去下量。去上数亦然。释曰。谓四天王天去海四万由旬。去上亦尔。忉利去海八万。去上亦然。此上准知。又如论颂曰。无色界无处。由生有四种。依同分及命根令心等相续。又诸部宗及大乘言有色义如别也。又三趣寿量如何。畜生寿命多无定限。若寿极长亦壹中劫。鬼以人间壹月為壹日。乘斯成岁寿五百年。地狱寿不定。八热地狱者。等活与四天王寿同。黑绳眾合号叫大号叫炎热。此五如次同欲五天。极热半中劫。无间中劫全。大乘经亦有云。八万四千劫等八寒地狱。论颂云。頞部陀寿量如婆訶麻百年除壹尽后倍倍二十婆訶麻者。如二十斛圌油麻百年除壹麻尽。頞部陀寿亦如是。五受生差别者。人傍生具四。地狱及诸天中有唯化生。鬼通胎化。二八寒地狱者。壹頞部陀(此云皰裂)二尼刺部陀(亦云皰裂)此二寒故胞生。三頞哳吒。四臛臛婆五虎虎婆。此三忍寒声。六嗢懵蕖4嗽魄嗔?F咩特摩。此云红莲。八摩訶闾啬Α4嗽拼罅?4巳??硪菜谋娬摺@砗嫌衅弑姟R急惹稹6?惹鹉帷H?讲婺δ恰4嗽普?АK纳趁帧4嗽魄诓摺N迳趁帜帷A?牌湃?4擞卸?R际芪褰洹4嗽平?隆6?馨私洹4嗽平? F哂牌乓摹R恼吲?拆N上同投人夜光者。昔随侯遇伤蛇附药。蛇衔夜光珠来报。未知报恩故随侯按剑相拟。况大乘深旨。若不现通遣疑生信。孰可传也。此现瑞别序诸经不同。如法华放壹光表壹乘。在眉间表中道。照东方表三乘之上涅槃。于面门放种种光表异类眾生同有佛性。大品经遍身支节放光表般若波罗蜜遍法身万德也。此经合盖现土表说此经圆满法界為壹真净土。复于壹真净土现十方诸差别应缘佛土也故此经虽种种异陈。皆以净土為宗而為说法者。昔高齐尚统师问长耳三藏云。说普集经也蔽于大眾者。昔说小乘。以法劣故但现丈六比丘劣身。今说净土大乘。以法胜故故处宝师子座上现巍巍之身映蔽眾会。故法华云。长者在门内则宝机承足。威德特尊。出门外则著蔽垢衣。状有所畏。门内表大乘实相理内。门外表小乘应迹在外。复次昔现劣表小乘可思议解脱。今现胜表大乘不可思议解脱。复次昔教佛现劣故净名亦劣身寝疾。今教现胜故净名现通坐座掌擎大眾等。又下偈叹目净修广反说法不有不无。即是叹此大乘<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>胜身胜法。始在佛树及三转法轮等。即昔说小乘时劣身权教也献盖合盖者。献盖下能奉上表因必趣果。合盖彼异此壹表在因则是殊至果则悟壹。又盖者表慈悲也。在因有缘慈即异。在果无缘慈即壹悉于中现者。于壹盖现三千表壹法性净土能现十方应缘净秽之土。故下文云。诸佛如来功德平等。為教化眾生故现佛土不同。佛土应物有异。佛身亦随应不同。故金光明云。诸佛法身犹若虚空。应物现形如水月。身土既殊。当知说法亦应物差别。然宝积下问疑生此焉叹未曾有口业。合掌<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>身业。目不暂捨心。信心发于内故三业现于外。故注云。现相于外也心净已度诸禪定。梵曰波罗蜜。此云度。亦云<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。此叹如来到禪定之际也导眾已寂者。寂灭涅槃也。言佛以八正道导引苍生到于涅槃。不同六师也善分别者。无名相中应眾生故假名相分别也于第壹义而不动者。外道执见心说。二乘法执心说。皆名动也。如来无见无执故不动也辩同不乖异等者。壹乘為同。三乘為异。应物说三故同不乖异。会三為壹故异不乖同复次于我无我而不二。我无我实性壹故异不乖同。应物说我无我异故同不乖异。净不净等例然。故中论颂云。诸佛或说我。或说于无我。诸法实相中。无我无非我有不自生等者。若法本有生。应不待缘而有。今待缘而有。明非本有。若法定无性。应缘会之时亦无。缘会既有。明非无性也。若定无者。如龟毛兔角。缘会亦无也。此因成假破也有有故有无者。有无相待生诸法。正有之时未有无既未有无。待谁言有。无亦如是。小乘说有為法。四相相迁念生灭。即此生灭亦相待生。且生时无灭。待谁说生。灭时无生。待谁说灭。故云自有即不有。自无即不无也有亦不由缘者。已有故不须缘。无亦不由缘。如兔角故决定无。何用缘。论曰者。大智论也从缘故不有者。藉他缘有非他有也缘起故不无者。被他缘生起故。岂名定无也无我无造等者。既被善恶业牵。即我不自在。我不自在故无我也自然之理者。道理必然也。外道自然也。亦云理其然矣佛树者菩提也。佛于下成道名為佛树。亦名道树。西域记云。摩竭提国迦耶山东有正觉山。山西南十四五里有菩提树。毕懵奘饕病V茉???V杏薪鸶兆?N粝徒俪醭纱蟮鼐闫鹁萸Ы缰?邢录?鸶章稚锨值丶式鸶账?伞V馨兖N步。贤劫千佛坐而入金刚故曰金刚座焉。此树冬夏不凋。唯至佛涅槃日凋落。须生如故。佛涅槃后诸国王等遂以两躯观自在像南北标记。传闻耆旧曰。此像没尽佛法灭矣。今南隅菩萨没过胸矣力降魔等者。三义。壹出家。因果经云。太子十九踰城出家。二习邪坏异。四分律云。壹诣罗阅城同阿蓝迦蓝修不用处定。知非正道而捨之。二诣摩竭提界鬱头蓝弗修非非想定。知非捨。三至象头山同彼外道六年苦行。知非亦捨。故经云。以无心意无受行而悉摧伏诸外道也。三受食成道。因果经云。今我若复以此羸身而取道者。彼外道当言自饿是涅槃。因我当受食然后成道。婆沙云。菩萨知苦行非真。遂受难陀跋难陀二女姊妹所奉具十六德香蜜乳糜。食已身心安隐有力。从吉祥人边受吉祥草。诣菩提树下手自敷设结跏趺坐。坐已便发坚固誓。我若不得无上菩提。誓当不起。尔时大地六种震动。魔王惊摄观动所。因遂见菩萨誓取菩提。使三魔女以惑如来。佛化作三老姥还宫。魔王大怒遂将欲界鬼兵击动如来。魔军败勣。故经云。始在佛树力降魔得甘露灭者。涅槃寂灭也。永息生死如天甘露。大乘以壹念心知壹切法。是道场成就壹切智。故小乘以三十四心得非想择灭為灭諦。涅槃三十四心者。八智八忍断见惑為。十六心九无碍九解脱而下八地修惑。昔修俗禪六行已断故。今唯言非想壹地十八心也。六行者。厌下苦麤障忻上净妙离也。又踰城捨受捨外道弃见能亡爱见名出家也无受行者。叡曰。无受行(音衡)如前引。同外道苦行等无心受行。彼法但欲摧伏外道令知邪法无涅槃果故菩萨不学。即云。我法亦有涅槃以菩萨学而不得故知无也。所以摧伏。肇云。无受行(音幸)谓凡夫二乘取相故有心受。有心受即著。著即起行。佛智不取相故无心。无心即不受。不受即不起行也。故注云。心者染有。染有以生即取相苦乐是行者。谓受著苦乐而造心起行也冥真体寂者。谓境智俱空故无心虚空其坏者。谓不著苦乐故无受也。以无取著即诸见永灭。自见既灭。即能摧伏壹切外道诸见也三转法轮者。壹示相转。谓示四諦相。此是苦。此集。此是灭。此是道。二劝修转。谓劝令修行也。此是苦。汝须知。此是集。汝须断。此是灭。汝须证。此是道。汝须修。三引证转。谓引己為证。此是苦。我已知。此是集。我已断。此是灭。我已证。此是道。我已修。以此名為三转也<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>得道者。大论云。五人证小乘道。八万诸天发大乘心外道上者能断结者。即厌下苦麤障。忻上静妙。离六行断惑。如鬱头蓝等也等以慈者。大悲三念也。有二种。壹色三念。谓刀割涂香不涂不割心无二也。二心三念。谓顺法不喜违法不忧不违不顺心无二也三密者。谓三业神用难思。如来密示非心所测。故云祕密也净心观佛者。净信也获其利者。谓言必有理名义。言有义则物解。依解则起修行。修行则获道利也异受等者。谓三乘教必随根故异受异利也或有恐畏者。说世界悉檀三界火宅故恐畏。说為人悉檀生善故欢喜。说对治悉檀断恶故厌离。说第壹义悉檀证真故断疑。复次说苦諦故恐畏。说灭諦故欢喜。说集諦故厌离。说道諦故断疑稽首者。郑玄云。稽至也。谓屈身至手而表敬也十力者。如来十种智力也。壹是处非是处智力。此知因果决定智。谓因果道理相当名是处。不相当名无是处也。二业力。知三界<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>业差别业智也三<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。谓知诸禪定得自在故四根力。知诸眾生上中下根。五欲力。知诸眾生乐欲不同。六性力。亦云界力。谓知种种性差别也。七至道处力。道因处果谓知行因得果也。八<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>力。知宿生受命差别也。九天眼力。知生死因果故。十漏尽力。知无漏法故。通名力。大论云。遍知究竟名力。成论了知无碍為力。杂心不伏不屈无胜无动為力也无所畏者。四无所畏也。壹壹切智无畏。自言具壹切智。二漏尽无畏。自言诸烦恼漏尽。三障道无畏。自言我识烦恼贪欲能障圣道。四出苦道无畏。自言我知无漏道能出生死。说此四法于大眾中心无怯惧故无畏。二明行相者。如经中说。外道难云。若具壹切智。何故问诸比丘乞食易得不等。佛答。我非不知。但随世师弟法故问。二难云。若漏尽者。何故呵骂调达爱语罗云。佛答。调物应尔。非烦恼漏也。三难云。贪欲障道者何初二果人受五欲也。佛答。决定能障后二果故。四难云。瞿曇说八圣道能出苦。何故罗汉由有寒热飢渴等。佛言。圣道实能尽苦。但罗汉残报未亡也。此后二无畏且随小乘说。理实无上。大道要离壹切惑方证。非二四果知也。又法身真如性无生灭非四大起故出苦也。非二乘结业后边身為出苦也十八不共法。壹身无失。二口无失。三意无失。四无不定心。五无异相。六无不知已捨。七欲无减。八念无减。九精进无减。十<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>无减。十壹解脱无减。十二解脱知见无减。十二身业随智慧。十四业智慧。十五意业随智慧。十六智慧知过去。十七智慧知未来。十八智慧知现在。此中初六是断身口意永离过失。常住定心怨亲平等。知而复捨也。次六是德。谓欲念进智解脱解脱知见圆满无闕减也。后六是智慧。谓三业三世常住正智无忘失也。总言不共者。佛住此法不与凡夫二乘共也。又宝积大集二经并云三业无失為壹。加无挣讼為二。无忘误為第三。餘同前</p><p>佛国品如王宣正令。方便品下九品如大臣行事。菩萨行见阿閦二品事讫之朝尊类也</p><p>空洞无像者。法身空洞无形像也形无常体者。或现丈六。或现千尺。长寿短寿。应物无常空也。应身既大小无常体应物。度亦净秽无恒处美恶自彼等者。眾生住异见。国土美恶。如来住正智。净秽常平等于我无定者。应净即净。应秽品即秽。故云不定。不定净秽即净秽无性。净秽无性即平等真土也无方為体者。净秽性空无方所也或以恒沙為国者。法华经富楼那成佛以恒沙三千為壹国也菩萨根者。或忻净土而生信根。或厌秽土而生信根。随缘万差生信壹也。岂言释能尽直心是菩萨净土者。直心多种。又凡夫质直心。有二乘正见四諦直心。有菩萨正观中道直心。為诸佛法界壹如直心。下诸行类然指金為食者化金买得食。此喻指因為果也前后异名者。直心不諂等前略后广。十善道品等前因后果。忍辱相等正定眾生者。有三聚眾生。壹邪定聚二定聚。三不定聚。俱舍云。五无间眾生名邪定聚。得圣道名正定聚。餘眾生名不定聚。仁王经。十信菩萨不定聚。十住已去正定聚。十信已前邪定聚也。此智鉴邪正决定去取名正定也迴向者。為凡修善皆迴向无上菩提。瓔珞有三种。壹迴事向理。二迴。己功德普施眾生。三迴因向果八难或闻佛名者。如虚空功德等也。佛名经云。闻此佛名礼壹拜。壹切罪障悉皆消灭等也。观佛三昧经海经。闻白毫相名灭三劫生死罪。餘相如文陀罗尼如宝楼阁等。涅槃经。闻常住二字不堕恶趣。提婆达多品。常生佛前莲华化生等。可知十善有二。壹止。谓止十恶為十善。二行十善。為施生<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>礼敬实语软语和合语饶益语修不净观行慈悲住正见也随其直心者。此竖明净土行即十三位列直心对十住。发行对十行。深心对十迴向意。调伏对初地。说行对二地。迴向对三地。方便对四地。成就眾生对五地。佛土净对六地。说法净对七地。智慧净对八地。心净对九地。壹切功德净对十地。前来壹十七行浅深皆然。谓惑渐渐尽智渐渐圆。心渐渐增。土渐渐净也。如此仁王。始从铁轮十信。终至四禪十地。谓惑渐尽而福渐胜悲渐增而化渐宽。如下十地佛果眾德皆净。何独佛土而不净歟<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗作念者。前宝积因果二问佛答已了。理圆行足。听者理合证悟。而不悟者有疑在怀也。故身子託眾疑以申念也事净者。七宝池臺净也。既能执净為净。岂能了秽非。故言昧也螺髻见净者。身子疑佛答既了。亦合得悟。而不悟者眾怀疑念也。世尊自云我此土净意谁见。故梵王证见也净土如四天等者。理亦合然。准仁王经。地前三十心配四种轮王。是结业生身化物。未有净土化物。初地已去至十地配六欲天王及四禪王。既七地已前愿生。八地已去应生。即是游戏神通净佛国土教化眾生故有净土。既诸地王位阶差不同。净土亦合随位昇降有异也。准配可解心有高下者。然佛土应净而净。应秽秽而。则知真土本非净秽。是名佛惠。而身子见净定净胜妙故高。见秽定卑劣故下。是名执见。非佛惠也得无生法忍者。悟垢净无性也。若秽定有性。不应被变便亡。若净定。不应待按方现净。待按方现净明净本无性。被变便亡明秽亦无定性。故无生空故无灭。可谓见垢实则亡净相得无生法忍入不二法门。经虽不言非净非秽。而理自明矣。如法华寿量品。但即伽耶之短寿明长。斯则长短不定。长短不定短亡矣。经虽不明非长非短。而理亦自明。故分别功德品。诸菩萨亦证无生法忍。大品即色明空。亦显色空不异。理可见也。准此诸大乘经虽同缘事迹不同。会理证真壹也。故不二法门品。或生灭两亡。或罪福壹性。或心无所得。或口默不言。此皆事迹不同。非会证异也知有為法皆悉无常者。若依大乘悟。净秽皆是应现应物无自性。今小乘执实故见事变即无常也。如阿难不了佛身应执实病也八十八使此是见道所断烦恼也。谓迷四諦起此诸惑也。迷苦起十使。贪瞋痴慢疑身见边见戒也。迷集諦起七使。除身边二见及戒取。迷灭諦起七使亦然。迷道諦起八使。谓除身边二见。是此欲界三十二。其上二界无嗔。四諦各除嗔。即各有二十八也。三界具言有八十八也。九十八者。谓前见道八十八上更加断十箇修道烦恼。故成九十八也。言十者。谓贪嗔痴慢。欲界具此四。色界有三。除嗔无色三然。故三界合论有十也</p><p>方便品。天台云。此品序净名德。是阿难本愿所未闻经。佛為再说。故此品及室内六品佛说经讫再说付嘱。故结集时诵出也长者具十德者。天台云。有二。壹世间。如别。二出世间净名十德果圆。如经。今且明闻经壹念及<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a><a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>亦具十德。壹姓贵。此经诸佛菩提皆从是生。即般若佛母种姓中生。二位高。初发心时已超二乘法。壹念随喜超二乘四果。三大富。金刚云。壹念净信胜施三千七宝。四威势。下文天帝四王未信生信已信作护等。五智深。大经云。学大乘者虽有肉眼即名佛眼。六年耆。不于壹佛二佛种善根。七行无失。大经云。闻常住二字不堕恶趣。法华化生佛前。八礼仪备足。诸相非相即见佛身威仪。九上人所叹。法华云。应以天花散。生心如佛想等。十下人归敬。法花云。天诸童子而有给事殖诸善本者。发大乘心生在佛家也无生忍者。仁王云。地前三贤伏忍。初二三地信忍。四五六地顺忍。七八九地无生忍。十地佛果寂灭忍。今不言寂灭忍者。天台云。以是佛忍故让之。但云无生忍也心之所趣者。如泉出流必趣大海。凡有心者皆趣佛果也。以无水不水亦无迷不悟故也资财无量本也。摄诸贫人迹也。此从本垂迹也虽為白衣亦也奉持行本也。言律行者。实相真戒性净尸罗也。故罗云章云。是即出家是即具足。谓发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>出生死涅槃家受万行壹心<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>也。梵行谓住真性法身悟非男非女无相梵行也异道者。九十六种著见论世典者。安国处家之爱论。以忠则爱主。孝则爱亲。各亲其故名爱论也治生者业也四衢者。十字路也政法。杜预曰。在君政。在臣為事剎帝利。此云田主。俱舍论颂云。劫初如色天。后渐增贪味。由情贮贼起。為防雇守田。谓劫初人身有光明。食诸地味贪心生。故地味不生。次食林露。贪又不生。次食自然粳米。身光隐蔽。贪贮既多。遂共分田。為防挣乱遂雇有德以為田主。此剎帝利王之始也。又从此始改姓瞿曇新云。乔答摩(此云月种亦云甘遮种)本行集云。彼大茅草王无子。出家得五通仙。弟子以王仙老以笼盛之悬于树上。出行采药。有猎师来谓仙是鸟。遂便射之。血便堕地生两甘庶。壹出童子。壹出女。童复嗣王位。因改為甘蔗种。及日灸生故亦名日种。复从甘蔗改姓释迦。此名能也。五分律云。鬱摩王有四子。神武聪明。宠妃有子。顽薄丑陋。妃念。我子虽长才不及句。国祚所钟必当四子。即作方便令王殯遂四子。四子去已从者如云。到雪山于北近迦夷林筑城营邑。眾人威。王闻三叹。我子有能。因称释迦种也。又剎利<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>毘舍首陀天竺四姓。剎利如上。婆罗门道学為业。毘舍者此云坐。谓坐估财货也。首陀者。谓田农官学者也胜惠者。观四圣諦无漏惠也。梵天爱见心修禪。若无正惠不免轮迴护世者四天王也。东方提头赖吒。此云国主。南方毘楼勒叉。此云增长主。西方毘楼博。又此云杂语。亦云丑眼主。北方毘沙门。此云多闻主是身无常者。有二种无常。壹事无常。谓四时迁变顏貌衰老等。事物变移為无常也。二理无常。谓体有為之法剎那剎那性自迁易。岂待叶落白首相异然后為无常也。下苦观亦然。若病发无色為苦者。此事苦也。若知五阴有漏有為性本是苦為理苦也。第三空观亦二。若灰身坏色為空。此是事。若行之五阴有為性不坚实剎那无常体归空也。此是理也。又此是半字因缘无常之空。又非满字缘生之空也。观此苦理名為苦等諦理之观也苦者。三苦也。苦苦。苦受性。二坏苦。乐受性。三行苦。捨受性也。欲界具三苦。色界具后二。无色唯行苦。又有八苦。如常十喻者。聚沫泡芭蕉浮云电此上五喻通小乘半字无常故空义也。炎幻梦影响此五喻通大乘满字无性空义也无生如地者身四大者。皮肉筋骨為地。血髓目泪為水。动转喘息為风。遍体暖气為火。又俱舍云。坚為性。湿為水性。暖為火性。动為风性。又执地大為我。即眾生相。执火大為我。即我相。火性炎上与我慢同相。执水大為我。即人相。人事随时如水之随器。亦同相也。执风大為我。即寿者相。风息不断名為寿命。故大集云。出人息者名為寿命。故<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>。若心取相即著我人眾生寿者。若壹取我相。即四大齐执也无知如草木者。草木无知。託四气以生落。<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>亦尔。假异境以忧悲。既託缘以分别。即自性而无知三十六物者。外相十二。髮毛爪齿眰泪涎唾屎尿垢污也。身器十二。皮肤血肉筋骨髓方膏脑膜。中合十二。肝胆肠胃脾肾心肺生藏熟藏赤白淡饮形之妙者。谓二乘人不知五阴皆空是佛身。乃取三十二相為佛身。有金鏘马麦之患。何得厌彼忻此也。将示大乘五阴本空。王宫生无生。双林灭不灭。丈六即真為佛身也。故云佛身者即法身也超三界者。谓悟三界如幻也阴不摄者。阴入即空也八极者。八方也措思措投也置也六通者。壹神境通。谓或现大身小身也。二天耳。闻障外声。三天眼。见障外事。四他心。知他故。五宿命。知宿命事故。六漏尽。诸烦恼尽故三明者。壹宿命明。知宿命。二天眼明。三漏尽明。谓壹往知事為通。深监因缘為明。又俱舍云。宿命明除过去愚。天眼除未来愚。漏尽除三世愚。餘三不尔。故但名通不名明也</p><p>净名关中释批卷上</p><p>净名经关中释抄 卷下</p><p>沙门道□述</p><p>弟子品</p><p>宣律师云。学在戒后故称為不解从戒□□□□子菩萨外化不常佛侧<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>暂来不常侍奉故第□□□□□在声闻非餘二也。天台云。品来五意。壹為显净名□□□□□大弟子称述不堪则备显净名之德。<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>生心。文殊入□□□□法二令未入正位声闻迴心向大。若不堪之辞即捨小归大。三成净土之行。若闻菩萨权实难思。即渐识诸佛真应二土。四為已入正位声闻成生苏。教声闻昔说花严如聋。凡夫不变色。故于渐次二乘如乳。次闻阿含得四果。如酪。令闻净名□等智果不真。如生苏。次闻般若许传大乘未得授记。故如熟苏。后说法华涅槃同归佛乘為醍醐。此五味教渐次并对二乘為言。非菩萨也。為印定成经。昔所说者皆不对佛。今对佛陈述。如来印可皆成经也。注云。悬心默通者。谓圣心悬照前心。默然通见。何待言也。冥机潜应者。冥然见机潜相应会故相造也不于三界者。身子入小乘八定及灭尽定。皆三界身心得也。菩萨住实相定。即法身真智证非三界法也。如大论云。比丘离诸欲及恶不善法。依未到地定得初禪。有觉有观。喜乐壹心。离欲火故谓觉观。复作是念。觉观嬈动禪心。如水中波。如睡中唤。如是种种呵觉观。觉观灭内清净。繫心壹处无觉无观。定生喜乐。入第二禪。复次观喜多过。得喜□忧离喜行。捨念智受身乐。入第三禪。复次行者观乐之失如喜。求心不动不苦不乐。捨念清净。入第四禪。复次观色多过。观身中空。外色亦尔。得无边空处。复次行者观空无边。故识缘则多缘多散。故捨虚空缘但缘于识。名识处。复次是识无边识多即散。故呵识讚无所有处□观。此处四阴过患。无想如[病-丙+(雍-〦)]有想如病。入非有想非无想处(无想定灭定及无想天名相餘有相也)此无色皆四阴成故灭受想等心入灭尽定也。故皆是三界身心。今菩萨以中道正观照三界五阴不生不灭定此真灭尽定也神俱灭者。谓菩提不可以身得不可以心得。身即无色无别。心即无根无住。不生不灭故云实灭。大士之灭定如此也道法者。即阴自空也现凡夫事者方便涉假也心不住内外者。三处性空即心实灭。故不住也诸见不动者。执著名為见。二边名為动。二乘<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>观身不净破净倒。观受是苦破乐到。观心无常破常倒。观法无我破我倒。餘品例然。是名二乘类于诸见动修三十七品也。若大乘四念处。观身性空非净非不净。观受不在内外中间非苦非乐。观心但有假名非常非无常。观法如幻化非我非无我。餘品例然。此名大乘于诸见不动修三十七品。广如涅槃及诸法无行明</p><p>不断烦恼者。烦恼性空故云不断。二乘法执如烦恼為实有。故断而入。菩萨悟烦恼性空。故不断而入也七使者。贪嗔痴慢疑為五身见。边见邪见為第六见。戒取见取為第七取使。九结如前时我世尊默然者。应呼云世尊我时默然。但以梵语语约故尔目连章者梵音也。部执论翻為胡豆。法蕴足论云没特伽罗子。此云绿豆子。新云采菽。又前身子智慧第壹。约禪定呵目连。禪定第壹约说法呵。所以以十大弟子此二交络呵者。以定惠是万行之门。故不可偏定。定深必惠明。惠明必定深也法无有我等者。小乘观破我证无我。唯证初果等。今大乘实相法即于我无我而不二。我尚不可得。非我何可得。是法性实相真无我义。证此无我乃得无生忍。七地大士岂同小乘哉离生死者。若前际有生后际有死。故中间名寿命。今菩萨住法身实相。不生故无前际。不灭故无后。无前后故寿者性空灭诸相者。小乘说有法有生住异灭四相相迁。今大乘法性性自寂灭离四相也离觉观者。取相生心说有觉观。离相假名故无觉观也万法万缘者。万法无定法故无法也。缘无定缘故无缘也。如身是菩提界多成眾则无法。如婴垓童子少壮老年眾缘為形。则形无定形也法不属因者。妄法有生灭故属因缘。生其真法不生不灭故不属因缘也。诸边不动者。离四句故诸边不动也。离观行者。妄识缘相起缘相故言观。真智照无相。无相故无观。又取相心缘生缘相故言行。离相心无生。无生故不行也迦叶此云龟者。盖取明义也。知三世故也。或云饮光。亦明也。此呵头陀也。小乘以于四事抖擞不染不著。少欲知足名為头陀。今净名大事于三界五蕴菩提涅槃如般若波罗蜜。抖擞无取无住名曰头陀。故法花经云。是经难持。若能持者是名持戒行头陀者。又善住意天子经云。头陀者抖擞。贪欲嗔恚愚痴三界六入我说此人能善抖擞。如是抖擞不取不捨不修不著。我说此人能善头陀。头陀者此云抖擞也。又行中头陀有二。壹随时。如梵网经。春秋為二月行也。意如冬夏极寒热故安居。春秋暄凉随行也。二随行者。有十二。四分云。壹但三衣。二粪扫衣。三常乞食。四不作餘食法。五壹坐。六壹团。七练若(此云无声处)八塚间。九树下。十露坐。十壹随座。十二常坐而不能普者。迦叶诸声中有二行胜。壹故不普菩萨无缘大慈故能普也。次别呵。云住平等法应次行乞食。呵声闻头陀。乞食為养五荫但少欲耳。不同菩萨為坚住正观养法身也。法身即不食。身怀和合。法身不受三界身也空聚相者。聚落有二。壹者外聚相。村邑也。二者内聚。六根也。故金光明六根聚落贼所止也。谓诸外聚若有人物士女则有可观。若空聚无人唯有劫贼虎狼死尸毒蛇则不可乐也。若菩萨六根如法花经。八百功德威千二百功德则如聚落有人物也。今凡夫六根空无功德。唯有三受毒蛇邪见劫贼<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>死尸。故不可乐也不捨八邪者若捨八邪入八解脱。是小乘禪悦食。若不捨八邪入八解脱。為大乘禪悦食。若捨八邪入八正道。為小乘法喜食。若不捨邪相入正法。</p></div>"
}]