[{
    "title": "十地论义疏卷第一.第三 第2799部",
    "author": "法上",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>十地论义疏卷 第一</p><p>刚结坚义如金刚□□□□□□□□□□□□□□□□便能生道<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>能利他行不能者无能胜夺也。<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>分者。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>门中入寂分凡有二义。一表十地理深非证不说。二欲受加。是故入三昧也问曰。大士静乱平等。何当不定而始云者答曰。盖随化□□□□又解□寂圆道备通万行无障无碍。以之為乘证无出入显在外用。摄用在心故名入也。光明者。如来光同处不相障碍故。论云光明者。显照一切餘法门故。非思量境者。明十地真法体非分别妙绝名相。故<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>云。是法不可示。言辞相寂灭。诸餘眾生类无有能得解。加分以下佛性门中果严因分问曰。上入三昧在于定中。今此加分中。诸佛开基净愿九入十始终广明地体圆极备统万行。敬為谁说也答曰。正為金刚藏说。以金刚藏入法性三昧与诸佛体同故。诸佛在定中為说十地法用辨十地自体无障无碍。加以三业定中具作法用既竟。金刚藏然后出定依向诸佛所教為大眾具辨十地行相差别。故有定中说问曰。若尔何故下论云定无言说答曰。云无言说者。乃可无六识分别言说。非无证说。故经云。无说是名贞说也。加者。向入三昧显已契证。是能说之人。诸佛同加劝令其说。故云加分。夫凡解加有二种。若如来住持力加。须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>说大品令草木能说章句。皆是住持力加。今不论此加。亦不论加其进行。今直取加其教智说同佛说问曰。金刚藏是十地大士。体证相应勘能自说。何假佛加答曰。实自能说。但大人在坐迭相映夺说则成碍。要假佛加说同佛说。故下论云。同化辨才也。就文中有三分。初直明本愿力故加。第二何故加已下為说十地故加。第三明诸佛与力之相。就初经文中有三分。第一至同名金刚藏明出经者意。是诸佛已下明诸佛讚劝。第三是卢舍那佛已下明诸佛助加之义问曰。佛具一切智。一佛便足。何故多佛加者答曰。显诸佛道同。德无彼此。同契不二。显法為重。及法师者。以加力故说同佛说。法在于人。人法俱重也问曰。上知多佛之德。何故同一名号也答曰。愿者是本行之秤。金刚是真理行之名。本在因时同行金刚理行今成正觉。还以此<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>同号其人。故言本愿也问曰。若以理行同故名号同者。何故卢舍那佛而名独异答曰。卢舍那佛名蒲净如来。是自体异用报果圆寂故不与因同名。十方诸佛是自体方便相在对因故与菩萨同名也问曰。万行非一。何故唯金刚為行也答曰。金刚是真理行万用之体多所行。故论云示多佛也。三昧法体者是十地。证智皆名金刚者。十方诸佛及卢舍那佛。昔在因地同行金刚行也。同说者皆显十地也。既契穷本际得即不二。本今齐等故言不异名加也。又者更有义增踊悦者。為辨菩萨与佛所得道同。但增微為异。如来圆证。菩萨分证。庆已必圆故生踊悦也。方便显多佛者。一言两显是集法者巧故言方便。為说十地者。寄圆数表圆道也。先作是愿者。是卢舍那开基<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>。今自加者。非但自立。亦兼一切。故今成正觉。先加金刚藏命其入定也。后餘佛加者。诸佛道同化仪处一必须嚮助也。卢舍那本愿者。前承卢舍那加所以入定。后诸佛加令其起先说。先说之来元由卢舍那為成其人法席建立也。何故加者是问。第二明所為说者是答。生下二十句。复云何加生下第三经文。二十句备如论分。初十句明入。入据其解。后十始终明行。自行义劣但彰名名入。利他行胜故辨始终之称。住信行地者。常徒解信正在习种。性种彰行。道种彰发趣。今明信行。始从习种终讫解行皆為信地。初地已上名证地也。是出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>道品者。是十地法正是<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>故。故指道品為為佛法问曰。今為说十地法所以举佛法者答曰。菩萨地法正以佛法為体故也。见智者是教道。得证者是证道。教有始末。证有初后。始相应名见。淳熟名智。始契名得。终圆名证。以成明也。信乐得证者。此辨入方便<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。通举前智据先成就处语。今言信乐。始解会时為言解行。终心修觉相入证方便以為信乐。始契初地相应以為得证。以成入义问曰。道体平等妙绝名相。非得非证。云何言得证答曰。若言无名相不可得证者。盖非分别之心取相能会。但<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>所证理绝形名无為所不為。是以无言之法寄言说言。无听之旨藉说以悟。故论云。何故不但说无言示现依言求解故。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>地者。本分中六种决定正明实慧体也。根本入者。一而备万以之為本。修多罗中者。本初句与九句為本。又為辨此中开合。九入都就教中证也。依根本入者。九入皆分别。向一句皆是所入。智地差别故悉名為入问曰。向智地一句乃是十地智。九入中始明闻慧。终明佛尽。何得為本也答曰。智地一行具一切行。今始从闻摄终至尽者。就其眾意之相故寄优劣阶降而言。此非根本入中有此优劣。亦非虽根本外有此差别。何故然者。大乘义融一而备眾。眾而是一。浅而备深。深而备浅。故但举初地则彻佛地。理无不尽。其用亦备。此是初地之佛地。非是佛地之佛地。若举佛地亦备初地。此是佛地之初地。非初地之初地。<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>云。住于一地普摄诸地<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。故智理行但融。九入中初四句明地前行相。中间四入明地上行。第九明<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>行。摄一切者。习种性是一切佛法种子根本建立也。道品者。初地已上方便者性种行也。<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>入者。道种性<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>义。二义中知故云彼彼。善知二諦境界故云种种。三慧既成勘能化物故云<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。义者是理。名字是教。善知理教故云具足。应机授药故云善说。世间行满。次明入证。初地始心与理相应名证。证有二种。一缘证。二体证。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>剋证理唯<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>故云缘证。一切眾生皆以法界為体。<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>覆故隐而不现。了因除彰自体显用如如平等故曰体证。初地始心以為见道。后安住以為修道。教化者对料简。第四句举利他以成自利也。修道有行对治成就故云不放逸也。离烦恼染者。前见道除烦恼障。后修道应除智障。而言烦恼者。举烦恼尽以除智障。二地至七地為修道也。地地转入者。八地九地也。出过功用故云出世间。前修道之位<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>义彰得远离之名。今八地无功用道当体无贪性善根净也。复有善根能為因者。料简善差别。世间善能生出世间善根。此异体相生。七地已还善根生八地已上出世道品。同体相生故云因也。菩萨尽者。十地大士因道究竟更无有餘非灭尽也。佛果功德名為祕密。菩萨分证故云入。佛尽者果道穷圆也。一切智者。诸佛一切智。契会相应名入。為校量非根本入者。理而言之。智慧地体一而备万。所以始从闻摄终至佛尽者。為辨行相差别寄优劣而彰。非根本入中有此优劣之根也。一切十句中皆有六种者。此通释十地一部中皆有六种总别义也。言说应知者。為教化故作此优劣之说。真实之相不可依言而取故云应知。又解。一即一切。浅深平等六无六相也。谓阴入者。阴是<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>。入是十二入。界是十八界。事别不融故须除也。六种<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>者。一行為总。眾行為别。总别俱融為同。总别差殊為异相。证相顺為成。相违相背為坏。是总本入者。智慧地体也。别者九入也。依止本者。非本末则不立。非末本则不满。故云满也。九皆是入曰同。九入阶降名增。举一眾无不统為略。歷别而彰為广。如世界成坏者。借喻以况。成时微尘不增。坏时微尘不减。圆极常尔义无障碍故為况也。得十地始终者。问曰。何故名始终。答曰。创入相应名始。后剋成满名之為终。信欲等者。信是解之始。欲是行之始。亲近是道之始。此三位在解行中。解满名念。行满名持。道满名地。满有十阶故言诸地。复有阿含及证者。阿含者就教道以论始终。证者就证道以明始终。如是次第者。论位及教以说此次第。依初相者。位始终也。位中既成证教可知故言应知。摄始终。前九入中语其自行位劣以闻慧為初。此论始终据外化。其行是胜以思慧為初。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>说者。地持八句纵虽不思处说有所捨。是随所闻义。依义不依味。闇说明说。名受持也。修慧中有二句。欲之与行。地持中有四句。前二心观别修行未善成故不取。但取正观合修二句。始相应名欲。行之淳熟名行。修相方便解心造境以為观分别。道品初地得解在心与真境相应体未即是名修觉。初地始心為见道。法体自然為法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。见道据位无我据行。善相应成以為方便。体非分别离诸妄相。以之為择。非择去之择故言胜也。大智慧者。应言大乘。若释名辨义。观照為慧。运通為乘。今据法辨义。一切行俱融以為智慧。无障无碍以為大乘。非二乘境界故云过小乘也。对治无明者。寄对治以显。明非体对治也。此事中者。结法无我智。彼时中者。结见道时。皆善知者。结方便也。修道始终者。出世间智力是初地智。智有姿成二地义。以牒前起后。以明修道之解依前而生也。法义者。二地已上修道行地。此处菩萨五种障者。据位而言。此二地已上也。就行实而言。正是初地。但论主解义多途。或顺释或返释或显发释。今论主将明此处菩萨有五种对治行。故举五障来显答曰。今言有者。是其细障。但无麤障故言寄障显也。就五障中。初一句于法义二辨中障。即二地邪行于眾生障也。第二句于辞乐说二辨中障。即三地闇相于闻思也。第三<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>狭劣障。四地至七地住寂心也。第四不懃化物障。即九地不能善利益眾生也。第五无不能破邪者。不善為客。既不能破邪。己义不立。故言善巧障。即十地于诸法中不能<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>障也。坏也。人无探承故离散也。不能答难者。上明不善為客。此不善為主。显不能立正也。虽能破邪立正。若乐著小乘亦是其障。虽求菩提。而化物<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>亦是其障。虽有心化物。而无方便亦尔障也。各有二过。闕无自行外化。其义可知。对治有五者。对以显行。随彼所著者。外人邪执处也。显己义者。菩萨内具明解。善识邪正。能破邪执。故云对治。正义既兴。学徒还集。幡上离散。即摄眾生戒也。能答难者。既随问能答。得通大法。是无碍义。正义既通。出言人信。幡上人不信受。即三地禪智也乐著小乘对治者。乐小则捨大。愿大则弃小今愿大。捨小即為二得也。大菩提愿者自体行念者方便行。不忘者坚固义。即四地至八地道品菩提分也。利益眾生者。即九地四十辨才也。通达分别即地智<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>等也。加之所為如上所释故。言已说何故加问曰。加须有法。复云何加答曰。诸佛与力乃有无量不出三业。谓口意身。口加益辨。意加增智。身加形安。口加劝说虽益辨才。若智慧不达根性则辨无所寄。故次明意加与其智力。既具辨才智慧勘处眾施化。在定无言。故次明身加摩顶令超。据相三别论理处通。云何口加者。举初章门。何者。是口加事汝当辨说。法门差别者。诸佛上说二十句是略明十地行。金刚藏為眾广说也。得法义者。前二辨也。不妄说者。后二辨也。诸法门者。是十地法即上金刚藏所证法也。种种名相者。十地行相不同也。此法善巧成者。明教道万用殊。能用不永寂故名方便也。此初句辨才与下十句為本。别依止本故云依根本。自分他分加者。明十地之法是不共法。唯佛能尽其宗。金刚藏但分得其旨。今加金刚藏教智同尽其宗。以為他分加。自分加者。于自分中若于己眾实德自在。但大人在坐情有悚怯说不尽趣。要待加被形安志泰方有所说也。二种辨才者。蒙佛加故己智增。智增由加所成。此他力义。自力者。今对佛宣辨虽自力勘能。要须待加故自力亦云加也。不闇加者。加必加于可加。加则己辨释他力问曰。此十地法是金刚藏已成自分。何得名為佛法答曰。差别以人对法则十地法是菩萨法。若据法穷原则世间法亦是佛法。今说地之旨实。故须佛加自力中前二自行。后二利他。有作者。教道于缘中方便无碍也。证道本寂不从外来以為无作。化眾生者。始化相应身净者。化令淳熟身得净果。三种尽者。更开章门。菩萨尽者。因道究竟。八地已上。同相障者。初地已上七地已来所有法界海会菩萨同名菩萨名為同相。正以多相故障于报身不显无功用智。超功用智尽相融无碍成于报佛也二乘不同尽者。初地至七地不同相障尽。言不同者。地前菩萨见声闻相异菩萨相。见菩萨相异佛相。是名异相障。由此别相障故不能见应身佛。初地已上断四住烦恼尽则不同障尽。佛尽者。果德圆备体障尽。障者穷实而言。一佛备一切。是合理之解。若一切备一。覆成其障。何者是也。稠眾果中多百多千。即是其事正以缘智在怀。一佛体上分别作无量佛解。以是故障法身不显。故论云。金刚藏菩萨入体性三昧。十方世界有心有相皆入金刚藏身中。智见通如来。形充法界。周围百万亿阿僧祇世界。即体障尽故云佛尽也。法身者法性身。心者第七心。意者第六意。识者五识识。故<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>云。心為采集主。意為广采集。现识分别五。离此七种识转為智。故云唯智依止。受佛位者方便行满。智处生者报行满。度五道于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>而不著。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>道净者不住于涅槃。智满足者是佛智。校量上上者释转胜义。后上胜前上也问曰。何故意加中明色身名身者答曰。就身口显得意力。无上胜身者。形惧则情悚。形安则志泰。故加<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>上身令其安志。辨才者。口辨诸法说无滞碍。前色身胜结上句。后名身胜生下辨才句。不著辨才者。具四辨才说无滞碍。勘辨才者。辨成就智勘有所说。缘者有為缘集无為缘集体也。既有其缘必有本实。故次辨法。法名自体真如。真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>性也。既有真实之理便有生死涅槃大用义兴。以之為作。于向三无碍大智义成。成有三种。一理成。二智成。三说成。说上三法表理障显名理成。智慧分别证会不差名智成。言不差理名说成。善达此四。為人宣说得生心解。名勘辨才。是為成义。不达上四名曰不成问曰。何者是成。何者不成答曰。一彼现前得相。得证相应。<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>智也。二彼依现前得相。唯已所得比度而知。比量智也。三自种比相。虽非现得要是可得之类。是信言量智。四成相。称向三说成其詮相。五快净语说相。寻此证詮相能生妙解。是為成五种净相七种七者。一彼异相似得相。四諦二諦理相大同故。曰相似得。二彼异不相似得相。若随心行差别万端。名不相似得。三一切相似得相。理相唯一也。四一切不相似得相。行相浅深大小非一也。五异生比相。于上四种法中颠倒异解取不得方也。六不成相。既正解说不成詮也。七不净语说相。寻之者生人邪解长人烦恼也。前四不净教缘。第五不净教因。第六不净教体。第七不净教用。五种净教中。前三净教因。第四净教体。第五净教用。任放者。出言会理。文义具足。不差机会。名任放也。是不忘加者。上论直释任放义。此释得任放之由。由佛加也。能说辨才者。前眾生法说不悟。随其性欲借事陈况开晓其怀。三种同相智者。一缘起。二妄相。三真如。缘起者第七阿梨耶识。是生死本也。<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>者六<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>。妄生分别邪著六尘。真如者佛性真諦。第一义空也。此三解无别异名為同相。终日同处染净常别名不杂。经论互举又解。同相者。谓三空智举相论三。推理唯一為同。证空实觉曰智。晓在心府故曰现前。教出辨才者。以佛十力外化眾生令得出离也。上明十力。此明无畏。说时决定能摧邪显正為无畏也。无量辨才者。今就大乘义中。但举一字无法而不尽。正以善达六种正见故尔。六种正见者。法蠡圆音体是其融。一教一切教。一体一切体。教体既融。但举一教无教不备而无理不统。体含备周无可缺然。以之為本。说本分疏有眾教之别。以之為末。虽复眾教差别教相处一。以之為同。对同眾别以之為异。理不自彰為教。所显教成詮用以為成。对分自立互绝兴举迭无姿成以之為坏。此坏坏正是成坏。本末同异义亦如之。同化者得佛神化也。三种化者三轮教化也。如来加被<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>三业与眾独绝名殊胜也。有力者融因之力。是行平等。慈悲是心平等也问曰。如此平等应无所简。何故唯加金刚藏而不加餘者答曰。下论云金刚藏得大乘光明三昧者。是其法体自体因。因不异果。以果严因得力义显。所以云加也。餘者不得故也问曰。此会无量一生菩萨善行十地。何故云不得答曰。以其非自体行故不得也问曰。若尔金刚藏便是可坏。金刚藏非方便。则不具万德答曰。若体此宗时不应作是难。何以故。此宗中论行一行一切行。语人一人则一切人。是故餘菩萨有自体行正金刚是。金刚藏有方便行正餘菩萨是。本愿现前者。行因既久。行立在今也。三昧摄功德因者。体备法界眷属行也。八种行者。功德乃有无量。略辨八种以明自他行。因净者。行性是因。非前因也。深心者。发心彻于后际。又十住毘婆沙论云。深有三种。一者能于佛果起心玄其处远。二者于佛性理中生信。三者于受苦眾生深起大悲。故云深心也。地尽者。发心非于初地。乃尽十地取菩萨果。深心信乐等者深心义也问曰。若初地是深心者。终至十地弥于深心。何故但言初地深也答曰。正以深心名通故。以信乐来显信在初。论云始者信欲等也。善法根本者。自体因德无不备。智净者。前初地见道但论深心。此以上修道论智净。行周法界亦趣佛果故云地尽。初地自体真照以為观智。此真如观者增三地也。<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>者自体内明。普照者外朗周于法界。下喻况可知。身净者四地。生生者五地六地。善行成满七地。心调伏者八地。至十地无功用。行能断习障故云行也。闻摄净者。上明自利。下明利他。受持祕密具足闻持陀罗尼也。通净者。神通无碍。身业益物也。以决定信者。此语应言以神通力令物决定信也。辨才净者。此三昧能善同方音说无滞碍。是口业益物。善知教旨明闲取捨故言相违也。初章字者。根本圆音无碍教出生无量字句也。离慢净者。意业教授令得真智也。真实智释法界智印也。教授不异释善印。印于眾生同已所得也。上明三昧具八种净功德。此第二明三昧体能作八种因。自利因者并举四句经文。下次第出四种因。<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>因上初句深心。深心能与精进作因。不忘因第二句智圆满。自证圆智与不忘作因。身转净故是势力因。善断烦恼习故是不染因。后四句经论一一相对明因。念持无量法与断疑作因。以神通力故与敬重作因。得总持解故明闲取捨与转法作因。假餘尊法诵持者。正明九十六种道中各有所重名尊。菩萨尔时形同外道。口说佛语。内行佛法也。自得真智勘能化物。与教授作因。如是化者。举化他以成自行。摩顶觉者。上<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>故入定。今佛加故觉。即身加相。身有二种。一据自体行应言灌顶。二据方便行则言摩顶。此中欲令起说故。就方便行云摩顶也。示神通力者。自体不动无所不至。所现神力非世所能。名為奇异也。云何起分者。自下解性门中缘起分。上入三昧有其二意。一欲观机审理。二欲招诸加助。今三昧讫者。观察已周。得力者。得佛威力。说时至者。眾生根熟感道时至问曰。说时既至。何不在定而说答曰。定无言说故起也。云何本分者。自下正明佛性体。向出定欲说。直先略说以起请端。略為广本故明本分。本有二种。一教本。二宗本。略辨地名与后广说為本。是教本。六种决定苞含万行以為宗本。故云本分问曰。何故略说不待请。广说待请也答曰。為显此法是无言之法。其唯自证非缘所得。而备因外彰所以自说。广说所以待请者。為显非唯一向自成。要藉修相方便得彼用也。為说不说者。若不自说。大眾不知金刚藏為受加说為不说也。又不知说何等法者。上诸佛虽劝汝当辨说。未知竟说何法。故略陈地名令大眾寄心有在也。愿善决定如初地中说发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>即此本分愿应知者。明愿与发心左右為名。是故二处互举结会不二也。真实智摄者。真如实智与理相应慧摄非缘智所摄。善决定者。既证初地出世真智明白之解凡地妄想疑倒一切永亡故。云即决定者。即十地体既是出世真证。若以世法来释者则失正义。故直言即是也。此以入初地非信摄者。分其位相。今据初地已上辨其真道。地前是对治方便故名為信问曰。依地持论云。地前亦有真行。何故但云信也答曰。地前实有真行。隐而不彰。所以然者。為显一修成故。取前為方便。当所辨者為正位。若论前虽有真行。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>发起义。据十地修入法用悉皆如此。若辨十地行。贤首為信地。若十行為信地。乃至辨佛地。十地已还皆以為信。故仁王经云。十地菩萨而无相信。灭一切烦恼。照第一义諦。不名為见。就六种决定中有三。前二句明决定行体。第三句明决定所证法。下三句明决定行用。观相决定者。自有辨观地前方便修相觉名观。得证时名依止。此是前后观依止自有理之外。用智為观。即体真照以為依止。今都不取此為观义。正取即理真照自体相应真如一味以為观善也。体非分别不杂无明故言一味。真实决定者。自体真觉性离缘得也。体非分别离诸妄想故云出世间也。胜善决定者。自下所证法无障碍行用。法界超昇累表以之為胜。大法界者。是佛性异名。释胜义。法界有二种。一事法界。二真实法界。声闻所知名事法界。不名為大。真实法界以為大。与此相应成以為胜。诸佛称法界得圆用。菩萨分用。故言佛根本。大胜高广者。超昇独绝莫能加者以之為大。超出位外以之為高。旷苞无限因之為广。此皆行用差别。一体异名者。大乘义融一而备万。此法相义者。大乘法相理正如此。非始造终成出在天真自相<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。有佛无佛不可亏盈故云法尔。复法界大者。下有三句辨如法界义。即是三道真如观明证道幡心契悟如理相应更无异得。以之為证。胜凡夫二乘者。超凡越圣问曰。经云初发心菩萨胜阿罗汉。今辨十地真行。何故始言胜者答曰。此非三乘中凡夫二乘。今以习种前十信人未有行成為凡夫。习种性位是闻慧以為声闻。性种解行据位而言。未得真空但与理相应以為觉。今得证相应过于此位。以之為胜。方便集地者。此辨不住道。于生死而不著。涅槃而不乐。自非善巧。何能尔也。白法界者。明助道。无偏光絜以之為白。因善决定者。十地证智与常<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>二果作因。无常果者示用。因果体是方便集超。但缘有增减故用有。从缘集义以為无常。但非剎那无常。以此无常缘因。所对方便涅槃以為无常果。言爱者。对生死以得此果。生死滓累理非所悕。此果超昇理是可爱。故言爱果也。是因如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>者。成用而无得虚空通有色之用而无相。色自无常。虚空自常。如外用殊能用无用。相虽方便缘显。显则是常。色不尽者。据色以障虚空通色之用无碍不尽。空為色依生色不尽。愿善决定能生报果而无穷尽乃至得涅槃。常果因者。佛性正因為常因。得涅槃者。以此常因得性净涅槃。大善决定者。外化行利他是胜。以之為大也。次前决定非一向住者。常果涅槃是圆寂灭。涅槃语寂万相。俱夷语圆德无不备。德无不备故不住涅槃。相寂故不住世间。此辨次前决定非一向住。此愿非唯是用。用而常寂。不住义不异前释。不怯弱者。是菩萨勇猛精进决定能证三世诸佛所行智地不生疑难也。生<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>智住持故者。十地证智能生佛果。自成建立坚固不坏也。善决定是总者。明义既周。还以六种来融。六义者如上也。何故决定说十地对治十障者。然此十地是菩萨德位之名。论其体也。则旷周法界德无不备。略而言之。不出证教。寂用两行妙绝虚通名曰证。道用分殊能故日教道。此二旨超分别。下经言入于三世真如法中言证。不可传说之在教。盖是倚互以彰名。标相以示实据。相而言。证唯内觉。教则外彰。故就外彰之状分别地义辨相多种。或直彰法体或藉标拟。直陈法体者。如地前三位彰其始行未勉分数。故当相可彰。言标拟者。初地已上同入佛境。于六决定平等无差。然有彰未尽。必有明未之相不可得说。故借世间寄彰其致。寄相虽眾略说有五。或对障别地。或就行标殊。或寄报优劣。或约之数量。或引喻比况。或夷齐一贯。言障别者。对于十障故说十地。就一种障中缘起有十。故初烦恼障。中智障。后体障。餘二十二或三十三各自一彻。类此而言应有十一障。但此中為别十地因行故但说十。理实而言。<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>三障双遣相续<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。经明二十二者。据二障以明。或说三十三者。举三障而对治阶降以障自体无差别之差别。初三据烦恼障。次二智障。次二二障习。后三体障。一凡夫我相障者。初地始证真如见法无我创阶圣位。故说凡夫我相以為障也。邪行于眾生身等障者。二地修道之初。先以持戒之行离<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>垢。故身等邪行以為障也。闇相于<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>等诸法忘障者。三地依净持戒起三昧闻持照见上法。谓之為明。故于闻思闇相以為障也。解法慢障者。四地入道得证除慢。故以解法之慢以為障也。身净我慢障者。五地得不住道染净俱行。故身净我慢以為障。微烦恼习障者。六地逆顺观察染净缘起入深寂法门。故取染净微习以為障也。细相习障者。七地功用行满念念无间。故细相习间以為障也。于无相有行障者。八地正得无生离功用之染。故于无相有行以為障也。不能善利益眾生障者。九地四十无碍功能利物。故不能利益眾生以為障。于诸法中不得自在障者。十地得法自在成大法身。故不得自在以為障。此之十障若后歷别则是世间之障寄之别地。若一中辨十十位皆然。此则当地说障何者。如凡夫我相。乃至九地见法有性。十地犹习亦為初障通于后地。第二大愿能受一切诸法轮。即是法自在除不自在障。然则后障亦该于前十障缘起义显明矣。行标报示约数喻况。文显可知。夷齐一贯者。就相虽差。行实平等。皆周法界。又一解。十地者真体寂绝。何由可悟。显用方便由何而致。是以一道清净平等无二。相状殊能其理莫差。语体澄湛亦无波。此直以时异有净不净。理无品第对语辨十。十者何也。谓一对恚慢我相障以辨<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地。二对解惑相泯障以辨道流离垢地。三对真道现相障以辨心解明地。四对忘超惑恼心智火所烧障以辨观明炎地。五对流来无明惑难可度越障以辨显用自在难胜地。六对平等智用障以辨薄流现前地。七对无始流来解起障以辨顺流远行地。八对念念芬熏解智障以辨安止不动地。九对慧解智照功用障以辨显解善慧地。十对云腾解智理穷自在障以辨法云地。此十名者。盖是玄原之幽智。绝称之灵宅。修途之宗辉。而表还中之妙旨。返本归宗之途要。真心绝灭之詮纬。如建真解之本德。智用两分之区要。而有本末之别。一体一切体。以一体為本。一切体為末。一切体一体。一切体為本。一体為末。一地一切地。一地為本。一切地為末。一切地一地。一切地為本。一地為末。本末有差。体用两别。且论于十万亦如之。十地名教略之云尔自利利他者显行成就。出过二乘故云无上。初得圣处显得正位。多生欢喜者。初喜则多久不必尔。下论云。多欢喜故亦名欢喜。误心犯戒者。犯戒由于内心。犯轻者名之為误心。起于烦恼為能起欲。显微细业迹一切悉离故云能离。清净戒者此指其行。二地修道之始。故以戒标初也。随闻思修慧随顺四地。下论云。以得证智光明故名為明。不忘者。三地缘解為不忘。境智异以為烦恼。可為智烧以之為薪。除遣此障真证无碍。无碍之用以之為炎。此四地是证道位。有证必起外用故光明為首。下论释言。依证智法明放阿含光明入无量法门亦名為炎。得出世间智不住世间。方便善巧不住涅槃。著唯世间解唯涅槃。于此二种以為难度。不住道成于缘无碍以為能度。<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜者。八地所证大无生法。此地得法平等穷尽诸相。彼境界现前故曰现前。下经言。菩萨从六地来能入寂灭定也。以此如见行未淳熟故有间也。前六地有间。此地无间。故曰善修无相行。功用道满以為究竟。能过世间二乘者。前三地修世间行共世间。四五六地修出世间行共二乘。不名為过。此地得过也。报行淳熟。菩萨从初地来广修行道于此淳熟。為前修道所对故曰报行。前第七地方便中断于体障分别功用不亡名為相间。今除此功用故名无间。前六地相间他事动。七地无相。然者有功用。此地得无功用。故曰不动。无碍力者四无碍智力。以能<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>成就利他。慧行中善故曰善慧地。得大法身者。此指菩萨法身普覆如云。又能注法雨灭眾生烦恼尘炎。故寄云以况之。能受云雨之说自利行。能作云雨之说即是利他行。二行满足无复体碍故云具足自在也。受法王位者。圆道满足勘受佛职也。犹如太子者喻况。然子义多种。若以得证相应以為王子。初地以上為王子。若以无障碍解為子者。六地以上為王子。若始成法身為子者。八地以上為王子。若具足子相為王子者。要取第十地受佛位為太子。而得自在者。于九地以还自在也。有微智障。且据二障而论。烦恼与智遣无先后。尽则俱时。就相而言。烦恼相麤在先而除。智障是细在后而遣。故初地断烦恼障。尽在于十地。四地断智之初。尽在于佛地。故言有微智障不自在也。微障既尽佛果圆显故说佛地也。如孕在藏。借女人况。怀胎為喻。初月怀胎十月满足。菩萨亦尔。初地得圣之胎。十地圣体满足。故云亦复如是也。以诸地有障者。问曰。与上十障有何等异也。答曰。障名虽同。明义有异。上辨十障辨解惑不俱。有障故解不得起。此言障者。以生长未足為障。如此為异也。如子生时者。如人受生始託父母入人位也。初喻登初地入圣之胎。满足十月成人之终。如似行满道成佛果。故云事究竟也。诸根觉了者。前明体满。此明智用满也。藏有十时。餘经中有三十八日。日為一时则三十八时。此中為况十故但说十时。陀罗婆身者此方云乳。受胎一日身相微薄喻初地。始证真如形佛胜智名為薄也。押罗婆者此云薄酪。喻二地。进入修道解心转疆故如酪也。尸罗他者此云稠酪。喻三地。具禪定智慧神通化物善根已淳也。坚身者如凝苏。喻四地。入如来家转有契力解心转疆也。形相似色身者喻五地。得不住道广化眾生应同诸佛相似也。性相似者。谓智慧為性。喻六地。般若现前智慧似佛也。业动身喻七地。能功用化行广大名為业也。此三满足喻八地已上功用究竟无功道成。根满足者喻八地。具三自在化道成立也。男女相别者喻九地。善识根病万差对治各异也。具四无碍无方益物名满足也。广长诸根满足者喻十地。功圆行满。现受佛位自在行化。一切道备也。相似者。上列十喻竟。今举十地内合也。我不见不叹说者牒上经文。显此胜法增渴仰者论释也。于中成佛者。如阎浮提成道处乃至為化所及处亦名佛世界。叹说有二种者。此中凡三番明证教二道。初番阿含义证入义者。此释叹说何法。叹说证教二道。阿含名义言无烦恼人所说净教。证入者证道也。摩訶萨有三种大。愿大者发心彻于后际。行大者广周法界也。利益大者无眾生而不度也。胜妙法者举经。最殊胜论释。显是出世间证智。光明者举经。此大乘法。显照餘法门者论释。世间法名之為餘。出世间地法能起世间智明故曰显照。此第二番所以叹说者。正以是明净法门。是以叹说。法门名為法故者。正指十地体為法门也。分别十地事举经。显示所知法者论释。向者光明法门是无漏世间教道也。是事不可思议等者牒经。显示出世间智论释。是证道也。此第三番為何义还结属二道成难说义也。此非世间能成清净道者。以上言分别十地事显示世间智。欲明此是教道殊能差别名為世间。非世间故须拂也。请分者。自下佛性门中明方便姿体分问曰。请分何故而兴者答曰。金刚藏菩萨既受加劝起说本分。略明六种决定十地名字。即止默然。时眾既闻本分渴仰请慇思演其义。解脱月是眾之上首。既知眾心说偈啟请。是故来也问曰。经云菩萨于诸眾生作不请之友。此中何故须请也答曰。凡说法之来。為于偈仰乐闻者说。若不待请则闻者不生难遭之想。既不重法闻则不悟。是以须请。故论云。欲令大眾渴仰请说故也。又解。世间行满邻于正地在修相觉方便现在前相显于己。名之為说。乘之修入入行资体。名之為请也。请分中有五番。要唯有三。初解脱月三请。第二大眾请。第三诸佛加请问曰。解脱月何故先请也答曰。解脱月是眾之上首。行德超群。是故腾意先请。然解脱月数腾意而请。未若大眾各自慇懃发彰于口。是以第二大眾同声而请。然此十地之旨理既渊深。非佛不究际。斯已还说者不能尽其说。故次第三次明如来法王加请问曰。华严中地前明十住十行等皆一请而说。此十地何故多请答曰。前明世间行在修相位。既是位相说之不难。所以请不劳烦。此之十地理既深远幽而难晓。故须多请。浅深不同义在于此。就解脱月腾意请中。凡有三请。初请意。既闻本分略说地名。然未演其义默然而住。大眾咸疑。若说者不能说上则不应说。若听者不勘闻上侧不应闻。以说以闻故说听必无过。说听既无过。理侧须辨。何故不说。是初请意。下金刚藏答。非谓说听之有过。但法是难闻。证信者难得。故我默然。是以第二解脱月更言而请。若以证信者难得。今此眾有能证信。故应广说。下金刚藏复答。虽所叹眾勘能证信。餘乐小法者闻生疑惑有衰无利。我既愍此故不说也。是以第三解脱月请。愿承佛神力说。以佛力故令人易信解。若不说者侧失大利。不得成就一切佛法。此叹法有大利益故请。有解。若据修入次第。初请為表未信者令信。第二请彰未入令入。第三请彰未熟也。就初请中有二。前长行疑念请。偈中腾意请。何因何缘者。是疑骇之辞。说者為因。听者為缘。俱皆无过。以何<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>默然不说。论曰默然住欲令大眾偈仰者為欲于人。复增尊敬者重于法也问曰。解脱月何故此眾中请答曰。有其二义。一者行德超群。彼眾信伏可以详推。二者德明鉴达知眾心疑问则眾请同晓除疑心开。具此二义故所以初请问曰。何故前言金刚藏為上首。今言解脱月為上首者答曰。前列菩萨名中金刚藏為上首。盖是眾之上首。今解脱月者乃是请眾之上首也。餘问则乱者。餘问非一。详心不推问则成乱。此则释上首义问曰。下亦大眾同请。何故不乱答曰。以此上首示请之仪式故。大眾如法而请。一时同声而不乱也。眾调伏者。释不乱义。上首所请情不失衡。互相推长以為调伏。又解。若据修入次第。餘问则乱者永修相次第。眾调伏者从修相觉得入同生异生一切方便行皆随顺相应也。少字摄多者。义入偈中理则易解。故言摄也。若有过则不应说者。此五偈显说听无过义。说法必藉因缘。说者无过因具足。听者无过缘具足。因缘既具。何故不说。因缘不定通于二种。一据正位摄方便。则以金刚藏為因。听者為缘。二据方便入正位。则以听眾為因。说者為缘。净觉无过故者。分处五偈显无过。相净觉无过者。净觉是说因。则初偈说因具足故无过。次二偈叹同生眾有三种决定故无过。次一偈叹异生眾有六种清净故无过。末后一偈。总叹同生异生思法情深渴仰乐闻。听者无过中有二种眾。一者同法眾亦名同生眾。二者异法眾亦名异生眾。同法者同是入证位。证行是一以為同法。异法者入教道之位。教道差分体是别相以為异法。若说法為语言同法异法。若就形状為语言同生异生。同生者同是菩萨。亦可<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>形同。异生者道殊别乃至诸趣形异。云何叹者说者。分处经文一一牒举释问曰。万行非一。何故不叹餘德。咀叹净觉者答曰。将请说法。净觉是说因故唯叹也。是说因者。若以音声章句為说。内觉心為说因。若住前方便行為说。行前方便為因。若理照外用以為说。内用净智為因。觉者是觉知。观者是观知。行者谓心行。心行于缘觉观能动口言為因。既有净说因。何故不说也。一摄对治二离诸过者。念智作对治名。功德具有力作离过称所治者。一杂觉谓四倒。二杂觉因是三倒。四倒据麤念等而除。三倒是细以真智而遣。即论云离诸妄想也。餘显离诸过者。释功德具。离说碍也。有三过者。一者慳愱者。虽有智能说。若有慳愱则不能说法。懈怠者。情惰于所说。不乐说者。无说所辨力也。愱是瞋家分。不贪等除故无初过也。无第二过者。不慳于所说。上说地名故无过。无第三过者。有乐说辨才力也。黠慧明了者。根机疾利必勘受法也。愿大菩提者。明非二乘决定。名闻决定者。不名虚施。施必称德。有大名称為眾敬重也。摄受决定者。凡说法必為于可為说地。故所為之眾必能领纳也。说者善知者。金刚藏善知此眾勘受法。故摄受為说也。心不欲闻亦不得说。生起后偈。虽有利根而无乐欲亦不得说。今明现有乐欲故能听受也。阿含决定者。但勘受教及随顺教行悉非阿含。非证决定者。不能灭除妄相入于正证。此明有乐心有阿含决定无证决定也。非现前决定者。究竟未来有能入证。此句明有乐心无阿含决定无证决定也。现前决定者。现不能入。此句明无乐心无阿含决定无证决定。此三种<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>不具不敢请说也。今示现此眾具足勘能入证故请说也。偈言<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>智无畏者举经释。佛子者称金刚藏。智者彰能知二种机。证法者显有证决定。现受者有阿含决定。若法器不具则恐其不受。善知满足故无所畏。下经请愿说也。已叹同法眾结前偈。乐闻结后偈。次叹异生眾生下清净者不浊故。离听法垢碍故不浊。一不欲者情惰不悕于法。虽复情悕悕不得方亦名不欲。虽心欲听而意不重则身无恭敬。名威仪浊。虽威仪齐整而五盖覆心。名為盖浊。虽无五盖而有异想。谓妒胜破坏。于上生妒于下破坏。或无异想而不足功德多有障难。或功德具而痴浊愚闇之障也。此偈以安住為宗。故独释安心。实想物不能动名坚固。餘可见。是二偈者还结前可知。后一偈者起后解释也。示无杂染心者。眾情齐同一心。在专乐之至更无餘念。非妒心者。人喜于胜生妒。今重法非妒心。下半偈喻一心待法义。十地之旨<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>一味如蜜。万行斯举眾德具足如<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>也。六相如上说。大智无所畏者。金刚藏答其问默之意。初一偈集法者明金刚藏意欲令眾悦。下五偈正是答其默意。五偈中初二偈明难说。第三偈明喻难闻。第四偈喻难说难闻。第五结难说难闻。欲令大眾悦是总者。略举五偈之意以酬解脱月问曰。大眾何时不悦也答曰。上金刚藏略说地名复叹真胜。眾咸乐闻而默然不说。于是违其听情同生疑念名為不悦。故金刚藏显法难说难闻。是故我默。一云。难说则法為深胜复难闻。不绝于言则有可闻之理。是以大眾心生欢喜也。正酬答相者。前解脱月举说听之无过以请。金刚藏今答。非谓说听有过。但理是深胜难说难闻。不可如常所说。如常所闻虽未即说有可说之理。通举五偈酬答意故云正酬答也。酬答有二种。勘答者大智也。不怯弱者说有可说。内具明智情无所惧。大智故离不勘答。是自无过。无所畏故离不正答。明理深难说大眾无过。自他无过者说所听无过也问曰。何者是正答相答曰。论云。难说复难闻故。此总生偈中意正明难说难闻义。云何者牒以释也。难得者会之不易也。最难胜者理深难证。未曾有者虽证而证无证相。偈言下以经帖所说。难者示其难法未出其事问曰。何者是难事而云道难答曰。偈言。菩萨所行示地事分别上。片出难事下复牒以释之。出世间智者证智。示者显示。故别本云。见以体证明白曰见诸地。行事者。十地中德用。行行非一名事。说胜故者。分别显彰名之為说。说之极妙故云上也问曰。何者是菩萨行答曰。论云。诸佛之根本。此明因能满果也。觉佛智者释佛义。以觉故名佛。明分得佛智為佛根本。已说难说者。上来直明法是难说。未辨所以。复说所以难者。下释难之所以。何者是难者。何者难之所以也。行事者牒上地行事。是教道如实相应故云义。住即证道。不可如上说者。非闻思等境界故不可即相彰。此略明后偈意。云何彼义住举不偈释。难得是总者。正偈中意故云总。餘是别。义难证故者。前偈上句难者难得也。难得有四种者。对四相明菩萨行事不可如是说。微者非闻思境界。麤事不须思惟显。闻则能得。今言微。故非麤闻慧相应境界也问曰。若微乃可非麤闻慧境界。思慧应当见答曰。亦非思慧境界。以分别法相名之為思。此法无相故非思境问曰。若是难见非思慧境界。世闻修道智慧应能得。答曰。契合成行名之為修。念所不及。何能修相应</p><p>十地论义疏卷 第三</p><p>槃而不永寂灭。实寂而常用。从初示成道。次第法轮转。教化说法。终讫于此也。法轮复住者。佛智住持缘正法中。护持十二部经。广化眾生。合轨则不失也者。法智通者漏尽通也。世间涅槃无障碍。故不两住也。初愿<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诸佛故功<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>满。第二愿护持正法故智行满。第三至第七教化眾生。以何身。摄法為首身也。如初成道梵王请法之首。<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>毘尼忧波罗為首。末代<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>阿难<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>為首。皆是摄法之人。以何心行。菩萨心行也。化何者眾生。故明知眾生也。自身住何处能化。住净佛国土也。后三显自身者彰行体。胜校量者。拟位则从二地至九地。说行则是自利淳熟。故上明同心同行等菩萨地尽。第十究竟觉地亦可利他淳熟。故明不空行得一切地尽。证报佛亦自利利他行究竟满也。如实化者。自利满故能如实教化也。随心求义者。初发心自体愿行与义相应也。成彼所作者正修行也。大行成就者行满也。何以故者。释之习义。随二境界渐习而证。非可顿阶也。何故名大愿者问愿体。光明者自体真照离无明垢。此是智慧行也。善根者功用行也。常懃修习无量行。如上二愿中说得无功用而进力弥旷以為懃修也。与一切同行者。化无不备。普周法界究竟无餘也问曰。十尽句何以而生也答曰。此有二种。若据法以法成行。若据行以利他行成自利行。故有此文也。就中有三番。初直明境界尽。言尽者是究竟故言尽。可谓尽于无尽。第二辨己之善根与法界相应究竟尽也。第三以法界不尽故成此善根亦相应不尽也。第三过也。眾生是总者。菩萨建心本為化物。故眾生得其总名。餘句显為眾生义名别。九句中有三。初三总明所化眾生及住处。然化须有法。次三明所用化法。然用须得智。下三句明所用智。世界尽是眾生住处。即体以自住无异住也。虚空界者复是世界住处。有為界為世界。无為界以為虚空界。法界尽明用此法化也。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>无记真如平等為法界。说法化眾生置何处。涅槃中也。佛出世界者见佛受化也。如来智界者。上明化法。法须智用。故明如来智也。称眾生性欲而化。心缘界者。上明知心。此明复知心所缘境。智入界者。令修入佛境界无障碍解脱智。已说尽者问曰。此中有九句。始明八句。何故云已说也答曰。為辩三转更无别法。正以前八為体。故言已说也。不断尽者。称法相应成故云尽。非坏尽也。三转者随顺修行义。称法以兴行。转凡成圣。故名為转。世间者是人无我行。初三是也。法转者是法无我行。即中间三句。法界是教。涅槃是证。佛出世明见佛闻法。此三虽异。莫不是法。以為法转也。与人法相应解為智。即后三句。初句如来智。后二是自体境。云何名智。故经云。说智及智处皆名為波若。故為智转也。增上力者。以十尽句成愿勇猛故。眾生不尽。愿亦不尽也。以此无尽愿力道成佛果。不住涅槃广化眾生。名作利益也。云何行校量。上明愿胜。次明行胜。愿以悕求為义。若不修行则所求难悕。故次愿后明行。行有其十。一者信。二者悲。三者慈。四者捨。五者不疲倦。六者知诸经论。七者善解世法。八者惭愧。九者坚固力。十者供养诸佛如说修行问曰。十行之首何故创明信者答曰。凡欲建心立行。非信不成。今欲捨诸妄想证大涅槃。若无<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>以不立行。故经云。信為道元功德种也。发如是愿已者。牒上十大愿结成信义。彼诸善根者。彼安住中亦以信為初。彼之信行由十种愿懃修故行得成就。无碍自在故云胜也。柔软者。上调顺明其体熟此柔软明用熟。此二是初地见道解。在果名调柔果。胜乐行者。释名中欢喜心正是殊胜之悦也。如是则成信者。结成信义。下明信境以显信相。要而言之。不出因果信。始从初地尽為行入因能得果以之為本。是因信也。成菩提觉明果信也。所摄本行者明因行有二。云何行明行体。云何次第成辨地通位修行增长。下举经结也。菩提所摄者明果信。本行入者。果是本行所入处。果德无量略明六种信。此六胜名為信胜。外道立邪信。无畏為对治。魔喜坏善信。十力為对治。二乘狭见自谓究竟信。不共法為对治。不思议者明不思议出世间。虚通无碍得為上也。不杂者安住实性。边中俱正故云无也。证实之义是佛境界故云深也。一切智胜者。智行一切缘用无不在也。离胜者明佛法清净。本今平等故云远离。非谓有烦恼之可遣。信成就果者明因缘故果即是<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>离也。上云有六。今但有五者。通数略句為第六句。如来智地说加者。略说因行果行不出。证教二道说加者。始证十地智终得无上菩提果名也。三种观者。自下明第二悲第三慈。远离乐者。慈明与乐乐之最上為第一。第一义乐一切眾生等有而自远离。甚可愍念故起慈也。具足苦者。悲能拔苦。岂直无乐而已。复眾苦具足苑转其中。甚可怜愍故起悲也。彼二颠倒者。若虽无乐有苦。而自觉智即容返苦得乐。今明于二颠倒显不觉不知甘处无厌。如是甚深者。释上第一义乐。无上菩提至极幽玄名為甚深。故眾生不识不解。仰求在于生死。故云远离。佛果万德皆是甚深。总為一观。离则有九。故云有二番。初列数。第二释义。寂静者。体照相应是证道据果即性净果。离妄计实有者体无分别也。妄计正取者离分别也。寂灭甚深者。外用教道亦即方便净果。法义定者。用称于体。空无相等者。所以行融无碍功由三空门故尔。次辩三空门对治。分别者法体体分名為分别。与空相违。相者执体之相。与无相相违也。取捨愿情与无愿相违。有三為缚。无三為解脱。菩萨观三不曾三名為解脱。不以捨三為解脱。此三句显寂静对治差别。离杂染法者。惑障俱尽尘习永止无垢浊智。不可思量者。佛果万德。既正万德。斯备功德无边。此是不住道真俗杂流等也。上者自利利他更莫能过。谓易道行。此三显寂灭体差别。难得者。明至理幽微非近情所测。修途遐旷非一步可穷。无上菩提道理立仪外。自非积时累劫无以可证也。云何具足苦。明远离上乐具足苦义。苦虽无量。十二缘收苦无不尽名具足也。故六地无明行识是行苦。触受是苦苦。餘因缘分是坏苦。就中有二。初说无明行识三支。第二从名色讫老死一番明惑业<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>问曰。<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。论主何故分两番而明者答曰。初番明妄想纷竞生死弥轮。特由无明為本生。后一番明诸惑妄想无依不立。妄依真有。是故辩阿梨耶识共生以為万惑之本。故经云。以如来藏故说生死。是故如来藏是一切法本。以有二种本故二处而明也。又解作三番。初三辩同时相。中间名色辨依持相。六入已下辨次第相。皆左右互彰。前明同时。中后亦然。中明依持。前后亦尔。后明次第。前二就麤非无此义。為欲言约而理通。若举烦恼业苦同时义亦尽。举依持义亦尽。举次第义亦尽。若就宗别。六识位中始从无明终讫老死。前后不同时容有十二种义。七识位中有相未穷。一体以辩十二。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>位中七识无体依真而用别。即用為体更无别体。正以用為体。即体用同时以辩十二问曰。同时相云何答曰。但是缘心莫不违理。闇于所缘以為无明。即体与集建立于果以之為业。但是有為莫非缘智名之為识。自体形现以之為名。相有外彰以之為色。即此由内外。有相发起以之為入。共相对当以之為触。自住己缘以之為受。体能染著以之為爱取。能有于果以之為有。有自成起以之為生。虚和不固迁变改易以為老死。非谓义说十二而已。体备十二。正以十二為体问曰。如大智度论有三种十二因缘。今此所辨竟是何因缘也答曰。据体而论。唯是六识愚痴因缘。若语观境。通于三种。但得有浅深也。九句中初列名。第二一一相当辩释。九句中初三句无明支。次五句业支。后一句识支。会正道者名為正见。乖正道者名為邪见。皆言邪见者。对向第一义乐。但是生死莫非颠倒。此理外妄倒故悉名邪见也。闇于所缘惑心自覆以為蔽意。此心自取以為憍慢。慢而兴著以為爱念。法名自体。义名功德。亲违理起故名倒。如是次第三句经论相释也。于追求时过者。諂曲诈善在相。嫉妒情忌在心差别。于身财中举果显成过也。集业者。业在相中辨当集起业时。而云受者。欲显大乘辩义同时缘起无别业以论报。彼二颠倒者。顺受故生爱。违受故生憎。欲吹心者业增长相。思是正业体。思转增名炽燃。思后运动三业共相加害名起业邪见问曰。贪瞋痴皆能发业。何故但云瞋也答曰。苦受生瞋。瞋于悲心障重。欲障过起悲故偏云瞋也问曰。若尔未来何故但云爱也答曰。不爱不生為障生后义便也。<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>者。餘处说业為种子。以善恶苦乐正相故尔。此中就因缘体性。故识為种子。此是第七识名為本识。与六识心為本。是生死根原也问曰。何故善业為种子因缘者答曰。善中有是有非。恶一向是生死。今明善体既随生死恶则亡言。又相善体是有漏故也。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>地者。第二寄九支论差别相。自相者。现前支即相差别各有自体。同相者。虽现未之殊。果类不异。生老无常过患处同。颠倒相者。体性实空。情故為有也。人法二无我名离我我所。以不达故名离。非对治离。自下自相同相合释也。报相者。色从识因复有六入果名為报。名色共阿梨耶识以业动故成种子生名色报也。言共者。妄不孤立不能独受苦乐。今明要依于真染净缘起得名眾生。此是依义。共彼生者。上明共生似若名色与藏识二俱相依。今明但名色依所阿梨耶识。应言名色依彼生故也。彼因相者。向託之而起以為依义。今明起也已因之而住不得相离以為持义。彼果者。彼名色果报。既有依持义立种种相集也问曰。餘是果可尔。爱取有是因。何故名果也答曰。阿梨耶识為因故餘悉名果也。离我所此二示现空者。释附前颠倒相义十二因缘是我空义。即此因缘诸法其体即寂以之為空。空故颠倒而有。自体无我者辩真空义。正以真实无二体相俱寂一切无我。唯真為实。离妄想<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>為无知觉。示非妄想眾生数唯真是知餘非知。相缘心体达理以之為动。即缘照理心无相解以為不动。如此动不动事皆亦无知。故借况。草木喻于动。石壁况于不动。又亦如响者。因有山谷音声作本故有于响。响似声而实非声。如依真故有缘心。缘心似心其实非心。故论云相似相类法故也。云何彼二颠倒者。举第三章门释。彼二者上第一义乐十二因缘是苦也。名彼二。颠倒者不知不觉义。佛果至乐而不知因缘至苦而不觉也问曰。前自体空中云不知不觉。与此何异也答曰。上辩真寂法体离觉知相。此以不达故為不知觉也问曰。上开三章门已具释竟。何故此中复举慈悲二行来也答曰。牒上生下。牒上甚深乐因缘苦欲教眾生捨苦取乐。然离苦有方得乐有由。故生下财法二施。先以财施破其贪心。后以法施破其痴心。是故更明此也。不离苦聚者牒悲境。令住涅槃者牒慈境。先以说者如上释也。经曰已下第四明捨行问曰。此文何故而来者答曰。上来至此三种观眾生故起大悲。自下辩随顺大悲故起捨等业求大菩提拔济眾生。求佛智者释能捨义。為求佛智故修行大捨也。是一切物者。以下辩捨相。就中初总明捨相下有九句别明捨相。一切物者此是总句。一外者金银等。二内者头目等。外中二者。一所用严饰代步是也。二贮积者下藏摄是也。如经者总举帖。如是次第者。应次第以经帖。于中广有八种者。应言九种。但先道外中八种所用有七。贮积有一。以為八。内者自身直指内施也。所摄是外事者指外施也。捨中初捨是总者。即上经文中即时所有可施之物乃至财物穀等是也。餘九捨是别者。下通内外皆是也。二种者。贮积故有藏摄喜。所用故有利益喜。谓金银等者释藏摄。八种者释利益义。通内句為八也。一切爱事者。随所染事过于餘者以為坚著。头目等是内捨有何利益。但以称心為益也。随宜而行者。自下并释后六行问。曰何故前四行别说。后六行合说也答曰。前四是方便故别说。后六是行体故合说问曰。六行之中。初不疲倦。第二知经论。何故不释者答曰。上明起大慈悲捨身命财。已知无疲倦得大眾无畏能说深法。则是知诸经论其义以显。故不假释也随宜者。第七行随自己力应当善自量己不得过分而说。应如三量智為物说也。一随自己分。二随彼所受者。前人过分自取宜抑。下分自取宜破。自分相应宜授。故云随宜也。如论中说者。发菩提心地持论并明随宜事故為证也。惭愧者。第八行于修行中进否皆生惭愧。一念时者。如商那和修教忧波鞠提惭愧学心法。此中亦然。日夜时。明始终时必定不断者修行相续。于此时中修之得方宜进。即进不宜则捨。日夜等亦尔也。坚固者第九行不可俎坏。如上所说信等。于向信等离过坚固。精懃者释坚义。于自分坚固名不退。故下云不捨行故。于胜进分中行解转明為不转欲。故论云精进不息也。如说修行者。第十行明修行供养。利养者方便行。修行者自体行。亦云功德智慧行。二种胜者。论分十行相。信悲慈行之未立但云深心。虽未圆证于佛决然。行未普周而心周法界。以為深义。餘之七行名為行成就。于中已下分别行相差异也。摄护信等者。為辩后之三行更无别体依七行而成。于七行不著有过生惭愧除障垢也。坚固者于七行中坚固令不退也。修行彼垢净者。以依七行如法修行供养佛者善根满足。得二种身者。显修行胜满足相。上妙身者是初地菩萨报得妙色庄严身。调柔心者初地证智名智慧身也。亦可<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>二身。前所说者。為辩校量行义。向信增上等亦是持地净法。今辩此不异同。彼前地中修治净地净于见道。今此十句离清净尽是地障净法。应言尽障也。练向修道也。云何果胜者。校量中第三行之淳熟胜出二乘相。调柔者。但志洪远乃至方便满证。居初地体用淳熟。名果校量也。行体淳熟无诸。刚朴由如练金柔软清净。此行如是证行相应。柔软利益即是证道相应。发趣者。<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>相应豫鉴通塞。趣果必达也。前调柔果始证相应。此发趣者是修进观达先后际见道相也。摄报者。行既成满有统御自在现涉生死摄化之力。即教道相也。愿智者。行已淳熟福智用彰。即是证教圆寂无障无碍自体平等不住道也。地之胜分淳熟无碍以之為果。非生因习因果。金相似者。喻调柔义。寄事显法。地前如金在草中。见道相应时名出也。安住中行果中行尽是金体。准下正以菩提心出世间智為体也。信等善者。始得证之解与信名也。三种入者。金师三遍入火。金体明净调柔随用。初入火离草石。二入火莹光色。三入火金体调柔随意所用。喻十地证智调柔果。行功德火熏修成就。略而言之。不出此三。供养具等皆出世间善根所成非世间等。下论云世间不共之物具足奉施。用此三行修治地法如入火数练也问曰。何故但明三入火者答曰。為明初地修三种行火除三种垢。四住惑麤喻矿石。习气闇细障体。不净无明障性不能得证。除此三障得证初地。下论云除外贪等垢也问曰。若依经应先见佛后明喻。何故先明释练金者答曰。為解调柔义便故即释练金也。见佛者。既证地上入佛境界与如来相应。眴眉动目旷周法界与佛不异名见也。神通力者。是教道方便行。见色身者。与报佛相应也。内正愿力者。证真如智是正因也。见法身佛者。与法佛相应已见真如法身。乃至多百者。与一报相应。百千报亦相应。法身亦尔也。示现多佛者。语实而言。佛无限数。而言百千者。為作阶降故如此也问曰。摄报中初地见百。二地见千。调柔中皆言多。何故不同答曰。摄报中為明阶降十地力用不同故。初百。二千。金调柔中不為校量力用多少。直明证体。证体平等故无忧劣也。三种供养谓三业也。不共物者出世间果也。发趣者。初地是诸地之始。為辨修行方法具足在此一切法成。眾地皆成义同问知也。故二地已上更不明发趣果。就文中有四分。第一法说。第二喻说。第三合喻。第四结句。说中有四。第一从初至无厌足名问。第二从是菩萨善知已下名知。第三名行。第四从已得地智已下名到。喻中还四。合中亦四。依文可见问曰。云何地果中由故不知初地中事始请问也答曰。言请问者示彼问故彰知之。善巧知相既得初地后。于二地乃至十地行处相应。但深浅為异。故名请问。就问地法中有四。一地具。此诸地皆然。诸相者。惑為障相。解為治相。是入地方便。即教说修等以之為相。正与出世间智相应。以之為证。安住中地满足无障碍淳熟以之為果。修行校量以之為成地之法。言世间者无漏世间也。所谓信等者是行体。為满彼故者。显相具足。五种方便者。经文有十。论主略為五门。观者除烦恼障。得者除智障。增上者除体障。性离非缘饰是果亡。不退者始显先际自体平等因果也。尽至者无障碍解脱圆穷后际也。观方便中二句。一者障对治。二者成坏。所显真实证道性净名為成。教道方便净<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>差殊為坏。又解。教行除障相显為成。寂证行灭為坏。虽寂而逆乱俱兴為善巧。欲入者未入正证。已入者明正证时。当地行满名胜进也。转下作上名增上。地转行者。十地中地地胜进不停。一地中修行未满未入餘地名住处。增长善巧者。善巧修十地行行转明。此中所辨行皆同时而有。但义有其别。下必阶降别也。不退者。从初地尽十地修行增长不失本解名不退。尽至者。地分既成与如来行相应。成初地既尔。十地同然。喻中令得正行者。知见明了勘任发趣。不迷道者正喻见道。从初至安住心是也。道中者行路中间。喻地道修行。处者宿止处喻地。得位皆有利患。资具者当地行校量分是也。摄报果者应言报摄。何以然者。逐因名果。酬因名报。若果不能更起。摄行者直可名果不名為报。今从厚集善根之所集成对此胜果。果不自住即与方便以摄胜行以為报。故应言教摄。前柔软果此摄报果。义通上下為障也。之阶降上下相别而相不同。后愿智果為障地之实行。故平等无优劣相。柔软果以金差别以辨地位优劣。前三地以练金為喻。四地至七地成就庄严具喻。八地已上以依人為喻。何以然者。初地始离世间如金出草。麤垢未净故以火练。柔软之用以二种火。愿是自体火。供养等以為外火。金得清净。二地以樊石练金除其内垢。所以樊石為况者。石但能去垢之用非是胜用。如戒但能离过非是胜用。故以為况。三地重以火练金体明净称两等住成金之用。以况真实无漏。三地以前是世间行。但除烦恼体得明净。以之為明。未得体用。所以不名為证。未為道用。无其光明外用。不得作庄严具。第四地体证相应以成照用。未成行用。如但以金為庄严具。五地六地七地皆内得证用成就不住道。无量庄严光明外障无漏行立。如似用金种种磨莹眾宝间错為庄严具以成器用。此显自行义。八地已上以此庄严具依人用者。為显八地已上自行已成。今以外化自资。故依人為况。化有差分上下优劣。故有三地之别。此是义通上下而相不同。报果可知。发趣唯在初地。此三既就真实位中以辩阶降也。就理而言之。与法界相应。岂容尔也。此中就人报阶降以报地位。就中有二。在家出家。上胜身者。此真行所得果报是胜高位。阎浮王者。圆通法身统摄祕密是自在义。上胜果者从果起方便胜行义。就胜行中有二。从初讫迴向大菩提故明方便修相。第二為首已下辨修行成就次第增进相。初中有二。前明摄化人行。不离念已下辩自行。不离<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>者。施等善根随顺发心迴向菩提也。事中行已者。此是正觉世间缘起差别故名為事。除妄想者。以无发為发。即无念之念。施等善根皆随顺发心除妄想。念有十句要则唯四。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a><a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>中最以為上。念佛者。诸佛所得相应。我亦相应。念法者。诸佛所得行法。诸佛正以与此法相应得成為佛。我亦应尔也念僧者。如此佛法以方便修行得与相应。我当修行也。念菩萨者。谁解修行。菩萨修行与我同行故云同法也。诸波罗蜜等以為功德。菩萨何由得与相应。因于功德故言功德。念求义者。我所得当来果力无畏等也。何者以下。论辨前十念直名為法。此明修行与此念相应。施者己身即上同法念。受者前因即上三宝念。物者财物即上功德念。菩提果即上求义念。不生分别者。四事皆空。如是一切者结前也。作者不著结施者。境界结受者。作事结财物。果报菩提如是皆空。与空相应不著行成。自然迴向无上菩提。不假作意而成也。為首以下胜进行中第二辩修行成就次第增进相。就中亦有二分。第一从初至為无上七句辨自行相。第二从為导已下五句辩化人行。為首者总也。以胜大二字释為首义。明具足功德智慧二种庄严。成上首义略為二种。庄严广為<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。光明者是波若波罗蜜。功德者是五波罗蜜。具足二种庄严名為胜首也。更无与等名之為大也。胜者有二种。此二句明智断具足。妙智者智具足。离一切烦恼者明断具足。大者有二种。此二句释大义。无与等者自体无等。二无能过者自体无过。如是显示结也。导者化行。阿含教门相似。将者主将义。能破恶相似。上明在家行。行于非道以通正法。复次出家已下第二明出家果问曰。初地至三地皆摄报果中彰出家四地已上。何故调柔果中彰出家者答曰。三地已还為明世间中修出世间行。四地已上為彰自体出离故也。出家行中百三昧者。此是位之阶降也。初地百。二地千。如是转增以数约地。出家果禪定胜。此文中但有禪业。论主依业说禪定胜也。业胜中有十二句。三昧者。于禪定中种种法相自在也。依三昧见佛等名三昧所作胜以得三昧。故下释所作义。于十方佛见百佛也。及佛所加知百佛神力也。修智慧明见佛智力為自修智慧也。动百佛世界令眾生生信。下明為化眾生也。能入等牒释。往至者入百佛世界。及见者能照。正化者能化。住寿百劫第八句明摄取胜生。起向自他利能知过未。各百劫事者第九句。若不达三世无以施化。要须达过因识来果达机施化。化无不益。善入百法门第十句為增自智思惟种种法门。能变身為百下二句為多利益也。愿智者。此初地证智名愿智。作要期之愿力至十地皆名愿问曰。何故须明愿智者答曰。上来為明地位高下故但止百数。不达之徒谓初地之力但止于百。二地止千。不能更过。為显实力过于此数故。须明愿智也。于中身者。十一句中总也。身者真实法身。身為道器万用根本。故言菩萨行根本所依。有光明者。体照内明也。及神通者。无障碍用也。依光明有天眼。光明与天眼為本物无不了也。有天眼见前境界者。缘别殊分也。眼有五种。如摩訶衍说。有音声者。无碍备显也。行者旷周法界。庄严者巧妙殊特也。加者得胜境界。音声者下释四句作业。信者依向神通所作。令眾生信。业者是口业。所以言慧眼所摄者。欲明说法须识根性。应病与药。慧眼善知漏无漏别。以慧眼观照然后為说。故言依慧眼所摄也。陀罗尼名总持。体通无碍名门。现说法故者。以慧眼照空导达<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>观根為说也。略说诸地各有因体果者。犹入住满三渐次。因者地前方便。体者地体。果者地满足果。校量诸地类有此三也</p><p>第二离垢地。从此已下说于四地第三明修道法门问曰。此地何故名修道答曰。慕进所习名修。修通无碍名道故。上明见道。此明修道。言离垢者。毘婆沙云。有三种离。一地体无垢。二离十恶业。三离贪瞋等机恶业根。具足三种故名离垢。此论云。离能起误心犯戒烦恼垢等清净戒具足故名离垢。已证正位者。牒前起后。正位是真空初地已证。依出世间道者。依向证道修清净戒故得三地。就戒行以标地相故云因清净戒。说第二地有二种者。分文為二十种。直心是入地方便名為发起。下三种戒非无优劣。以内是戒行故名自体净。即是地体问曰。此十种入地方便。何处而修也答曰。正是初地胜出心中修也问曰。初地中何故无入地方便答曰。此之十种同是真证无漏位得作方便。地前解行乃是有漏位故不得与初地為方便也问曰。上初地末云诸地皆有因体果。此二地何故但二而无二果者答曰。入地方便地体及果此是地之常准。然论主或二或三或五者。為辨一二之义上下皆通。而一二不定旷周法界。岂可以名局哉。是以开合无准也问曰。依如华严中。地地之初皆有偈讚请说。何故论主不释者答曰。请说之意同上五番更无异义故不释也。十种直心者。毘婆沙云。离諂曲故。此证理之解故也。依直心者。入地方便体是理解。同直心与戒為助故言依也。性戒者。二地戒行。随所应作者。三业行化涉境无染任运不犯故云自然行。此是总句也。九句中前二明<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒方便。次四明威仪摄善法戒方便。下三明摄眾生戒方便也。柔软者。持戒则心喜。心喜则得乐。故毘婆沙云。以直心离諂故心转柔软不刚强也。调柔者。善调于缘不杂烦恼。故论云。已得柔软心生禪定乐。观诸法实相心则勤用。善直心者。守护诸根。故论云。以降伏六根名為伏心。寂灭直心者。贪瞋痴等烦恼灭也。真直心者。善行于缘能忍诸恼。故论云。得寂灭心已必生真妙心。于神通等所愿事中得用如真金随用。不杂者。所得不厌。故论云。守护直心故不与在家出家人杂。何以故。若与眾杂。则眼等六根或时还发也。远求菩提广修万行。以佛果為期名不厌。二地三聚名為胜戒。戒立恶已眾务永息名為寂静。不悕望者。下三句明利他行。无碍能胜诸有不随有生。故论云。已说不杂心。次生不贪心。于父母师长所不贪著。明<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>涅槃而不住寂也。胜心者。不捨世间行。论云。因捨心生广快心。若捨眾受当得禪定生广快法為后多益。故不存小利也。自体净有三者。语离戒无恶而不止。论摄善无善而不修。利眾生无人而不化。行实而言。除烦恼障性离非缘饰圆寂证净為离戒也。二除智障故真性缘起圆通教行体顺十善净也。三除体障故寂用两行缘无不摄為利眾生净也问曰。<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>力乃有无量。何故但列三者答曰。為欲以总取别举纲收目。略明三聚统无不尽。恶止善行化物道备。万行虽旷不出此三问曰。何故先明离戒者答曰。菩萨建心欲也。断恶生善。但善恶相违。若不除恶善无由生。故创明离也。恶止善行。次明摄善。自德既立。次明益物。通而言之。莫不是离过。莫非摄善。莫非利眾生。乃至為他成道。寧容自行而非利他。今此约相而辨故為之三目。若就止行论。律仪為止善。下二為<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>。若以止非论戒者。律仪是止非戒。后二就摄善中方便无过。利物中方便无过。以之為戒律仪。戒有二种。一<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。二持戒。初受要期名為受戒。过缘不犯名為持戒。受语言防。持语现止。小乘中别得无作法。以非色非心為体。此大乘以要期一身不犯诸恶。要期心谢不相应身口相续现前任运不犯诸非以為无作。此中以持戒為戒行。不取受戒為行。何以然。受法一起乃与法界齐也。行不必尔。遇患始障行之分齐故。以持戒為行。然此十善止于十恶。然恶不出于三业。七是身口。三是意地。然非直身口<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>而成。身口起动要藉于心。是以身心相应方便成业。故<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。身口為期业。意為正业。然十业道经辩不同大小乘异。成实论中后三道而非业。以其思。后三道唯是烦恼。能畅于思故名為道。体非思故不名為业。前七身口造作名之為业。能畅于思名之為道。优婆塞经云。后三业而非道。以其同时缘起。染故分别。分别故染更无异通不名為道。意是正业故名為业。畅彼意思故名為道问曰。成实中亦有即思之染。何故不名同时缘起。而更须思后三道畅也答曰。小乘教中辨相不融。虽即思有染。而思强烦恼弱故更须畅。大乘义融。更无异通故但名為业。此云道。今辨十恶业道者。正取十恶业能通六趣以之為道。离戒净谓十善业者。指出戒相。从离<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>乃至正见者。分处经文。亦名正受者。从受為名。此是止戒。摄善于离戒為上者。恶止善行故為上也。从菩萨乃至清净故者。分处经文。利眾生戒為上者。自行已方能兼人故為上。从菩萨乃至生尊心者。分处经文。应言乃至广起持戒行故。理而言之。一品心中具有之戒寧容上下阶差也。今為彰上下优劣故。就用相功能以為昇降故言上也。远离杀生者明不杀戒问曰。何故诸戒之中先明不杀戒者。答曰。菩萨建志化物為怀。杀恼眾生与慈相违。若不止杀。物见生惧。于化有隔。故诸恶之中创离杀生也问曰。楞伽经云。初地菩萨断三界业果俱尽。何故此中二地方断十恶者答曰。若论十恶唯一违理。若广逐事名相恒沙。略要有四。一者异心十恶。三界凡夫违事损物起心造作。二者异心习气十恶。二乘迷理违事失念造作。三者即心十恶。妄相违理。地前菩萨之所造作。四者即智十恶。相顺体违。初地已上十圣所作也。无恶之恶故乐。瓔珞经以断生死為杀生。今断无所断為不杀。尽下皆尔。故至云生死本无体示也。菩提无人与而自取以為盗。今得无所得為不盗。智慧者求法不用欲故欲。如是名邪行。今明无求可求名不邪淫。至寂无言一切语名<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。今妄无妄想名不妄语。破坏诸外道名两舌。今破无所破名不两舌。说于麤恶语教化诸眾生名恶口。今化无所化名不恶口。随因缘而说是名為綺语。今因缘空故名不綺语。施一切眾生乐名贪。今施无施相名不贪。正法欲灭时与外人挣讼名瞋。今挣无挣相名不瞋。执正之解求于平等名邪见。今见无见相名不邪见。此十恶名同而旨异。故云真偽殊伦名同詮讳等也。正可望詮虚会。不得寻名定执。于一切有命不起杀名远离胜也。既断杀心即施物命。利他中极地行善成名利益胜也。因离者。杀之其离于杀具故名离也。防过方便以為对治离。从前因及杀生心造杀业成名果。正对所离名果行离。有二因者。依文可解问曰。此起因中何故乃言有惭愧為对治也答曰。但有方便心故贪瞋心不行。正是因离非对治离也。对治离有二种。正举善因果对治恶因果。安隐心者与乐因。故论云涅槃因故。慈心者与乐果。故论云涅槃乐果故。不颠倒求者。虽有慈心而于因果中谬犹有杀生。今明离愚痴一向无杀。彼能离故者。明即行体。无恶名离恶也。非常非断者。经云杀生故。释眾生义。犹是眾生死名為眾生。是以可杀也。果行离有二种。恼而未损為过。是轻故名细也。身业损他事重名為麤。身者前眾生身。事者是眾生非杌等。想者知是眾生。行者内起杀心。体者命断前业。离此五缘不杀行成也。盗中亦三。自资生不足者。非谓贫故不足。盖意不足对治。言常自满足者。非富有為足。盖意满足问曰。此因离何故言对治也答曰。盖事违故名為对治。非是道除為治也。对治者不盗行体所谓<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>故生生多财。不坏者意存捨施岂盗他物。当来者来果必然。以行满故福资亦满。故為对治。果行离微细者。小物為细。大物為麤。有五种。一者身彰有主义。事者向物属他。若不任用始如陈叶等。此即不犯。今言用事故犯。知是有主故名為想。内起盗心名之為行。离处成盗以之為体也。邪淫亦三问曰。若准上文言不杀不盗。何故不云不淫乃言邪淫也答曰。初地已上皆是出世间。法身体绝名相。现迹施化不离在家。邪行俗所不通菩萨。立行欲止已化他。今现同世法故但言离邪淫。自妻不足者。非无妇妾。盖淫情有餘。自足妻色者。非妻妇满家。盖洁然无染。未来妻色者。未来<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>毕竟不起故言不求也。起心念欲名微细。身相行非名麤重。永绝此二名果行离。不正者依文可解。远离非眾生者。显是可淫境界非不女等也。修梵行时者。前人护。此明法护。菩萨一切常修梵行。当知亦无自妻。非处等者可解也。离口四过。妄语但有二种。闕无因离。故论自料简不同身业。何以故。身有二因。妄语无外事。复无贪等异因。直以狂他心為因离狂他心即实语成问曰。何故贪等非因者答曰。有人一生不妄语而未捨贪痴瞋。有妄不从贪瞋生。故贪等非因问曰。若尔者何故戒律及优婆塞经皆因贪瞋等起答曰。此以贪等成语业轻重不说為因也。又解。圣教隐显难可测。会付在有识。依彼生者。依狂他心即生妄语。故言无异因。对治有三。随想者。不必称事。心实故非妄也。心事相称故名諦语。假令心事相违。但有实益亦非妄语。故论云不起自他衰恼。覆见者。六识中妄语谓见闻触知。眼耳為见闻。鼻舌身為触。意為知。忍见者。以智為见谓三量智中说法有相应不相应。以此名之即言见闻觉知。前是世间语。有虚实。后出世间语。自云得圣等也。有虚实。觉人在方便道中或中不中。今<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>位中一切无失言。易解者。餘经论中有释。但未见彼经由自难解。智见者。谓心明白名见。非唯眼见也。两舌亦二对治者。不破坏行者。释对治义。即和合心。一者心谓根本心。二差别者随相不同差别。三者即明果行离。一身坏者。两舌在口。以身助成。心坏者起语之心。前心此心有何差别。前直是两舌本心。此中明垂发口时心前后為异耳。业坏者正是两舌语时。身心各二可解。业中二。称实而传谓之為细。妄有所申名之為麤。此中业相小难。若依餘经律。三业中皆成语业。可准而释也。离恶口者。就经文有二十八句。初十六句為果行。第二有十二句為对治。果行中有六也。初四语正明语体麤鄙。次有四语正对人谈说。次有二语自违戒行。次有一语令他违戒。次有四语明语能恼乱。末后一语能现有乖背有所损失。治中初润益一语对上四语。软语妙语对上现前四语。喜闻乐闻二语对上不喜不悦二语。入心顺理对上瞋恼一语。多人爱念多人喜乐二语对上不爱不乐二语。和悦心遍喜对上心火能心热二语。能生自心他心欢喜对上不善自坏身亦坏他人一语。论中亦二。果行离中初四语宛转相释。侵恼故生他苦。麤獷故令他瞋。四名虽异同是损他。故言义一名异。相对不相对释经现前不现前语。麤恶释鄙恶语。常行释不断语。麤则难灭名不断。微则易息名有断。以鄙恶不断成现前义。如是说者牒前生后。与戒相违。对面相说犯毁呰罪。能生他苦者。未闻不喜闻释不喜闻也。令他瞋者。明见闻不悦也。作不利益者。说则自他俱损。妒心起者。语从恶口而发。令他戒相违者。麤语起他罪心故违戒也。二种不<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>事者。因瞋恼生二种不善事。下有五句。初四句迭互相释。语从恶心起。使闻者未生瞋能生。如火烧心。何故。如火能生心热如火。闻时不爱。忆时不乐。则心胸闭塞。已有乐事者。上四句明长恶。此句明二俱失落。瞋心交竞非直损他亦自损已也。对治中谓润益语对治上侵恼损他等语。不麤不疾释软语体。可乐即释妙语。戒分所摄者。称法离过与戒相顺。恶语不断则善言不生。恶言既灭则善言常行。名為不断也。治上鄙恶常行语。可乐者含有二语。喜闻语乐闻语。治上不喜闻语闻不悦语。可乐有二者。<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>二语。乐可乐释入心语。安隐可乐释顺理语。治上瞋恼语。人天因果名乐。涅槃因果名安隐问曰。涅槃正是至极大乐。所以不名乐。乃言安隐者答曰。涅槃实至极之乐。但乐名通于暂时。安隐言中究竟。人天因果少有微适得名為乐。无上菩提至极常住危怖斯尽名為安隐。故论云。乐者随顺人天。安隐者随顺涅槃也。又复怨亲中人闻时欢喜者。释多人爱念语。忆时欢喜者。释多人喜乐语。治上不爱不乐语。能作二种益对上二种无益。一未瞋令不生。释心和悦语。治上心火能烧语。能生三昧者。释心遍喜语。治上心热恼语。自身现者。现前作语。令他现作者。已不现前。释自心他心欢喜敬信语。治上不善自坏亦坏他人也。离倚语。对治离中依五种教诫语。谓若制若听若举若折伏若欢喜语则有益故言善知。依彼此者。彼是前眾生。此是菩萨。显自他有益。劝发修行乃教化语故。明思而后言则称心法令捨恶住善。即是若制。不颠倒语者是实语。善说四諦因果与理相应。眾生受悟不同付嘱有缘名為展转。教诲為说称根理教令闻者信用故云义语。法语即是听也。复依展转者。依毘尼灭罪法人非性知道由匠成。故律云。若不识罪听智者示语也。若有挣起依七灭法除名為灭挣。圣者开此正是修行出世之益名為学行。即是若举亦是折伏。如法者如毘尼教诫语阿含者如佛所教语也。说禪法以摄学徒名说法摄受。令如说而行名為修行。行住坐卧中皆得见繫心念法名如威仪住。理深旨玄寄喻显义名為顺义语。即名欢喜果行可解也。离意三中先明离贪有三者。列章门。摄受者。他人自己物随身受用。摄护想者。如封占山宅贮积等知他摄护名想也。所用事者。庄校出生用。饮食等者资用具。亦可将境欲取贪心為体。对治贪心者。菩萨旷断贪心故能不贪。此差别三种释第三门。欲者意有顷欲来对事以有多欲。则通业思名為门行。谓心行。得者起耳方便心。夺者向得起以理方便心。今起非理侵欺心也。离瞋中五种者。瞋心起恶不限于五。但论依经释故言五问曰。经文有六。何故但言五者答曰。第三句同是愍苦故合為一释也。怨所生慈者。慈欲与乐。怨所与乐。彰慈心成就故也。令恶行眾生捨恶住善。终获出世妙乐。故经云安隐心故。贫穷乞丐交切可愍故生怜心。苦生乐心。此二同有现苦故合為一。乐者令住不放逸。即是利润心。发菩提者。此退菩提心眾生虽不放逸。然于无量利益利行中疲劳。故菩萨為说大乘令进也。慈心等五句凡有六障。即经中瞋恨妒害妄想垢等。论释作六对非分别者。非尔许除瞋尔许与乐。亦非一一与前对。六中前二句就怨亲。中间两句就己身明善恶。后之二句就他身明违顺。未必全是外人為他。己之未来身亦名為他也。怨处多瞋。亲处喜恨。对上初对善法名净。故对之说妒也。恶法损物為害。对上善恶不爱者。恶法多恼名為忘想。善法生染為爱。爱则嫉忌故云妒也。对上第三句。此六种从瞋心起与慈相违名為障。无量恶行根者。一一皆能生一切恶。不待具六。彼悉捨离者。修慈永拔也。一切尽慈心者。明慈充满也。离邪见者。违理穴彻也。有七句也。异乘见者。谓外道二乘不归大理。正道者大乘道。虚妄者。以生死為生死。以涅槃為涅槃。不能涅槃生死无二也。戒取净者。想顺而体违也。自谓正见者。见盗以对治。观智為指南也。覆藏者。妄想智体是闇惑也。诈现者。妄智体灵而相彰于外也。非清净见者。虽证寂灭而体是有為也。如是说离戒者。上来十种离戒相已说也。复说离戒增上者。离戒中第二。上来明离恶是律仪戒体。自下正明持戒。故言增长上清净。心心相续名不断。无暂异念名不闕。性善成就名护持。如是具足者牒上。示不断者生下摄善法也。自此已下明摄善法戒。就中有二分。初明摄善法方便。第二观察已下正明所摄善法问曰。此摄善法。何故先明恶道答曰。将辨五番十善体。故先作兴发之由。以十恶是眾苦之本。十善是眾利之门。欲返恶从善故先明十恶问曰。此摄善法非摄眾生。何故经云令他住也答曰。菩萨自成正觉為成他。以成他故所行诸善得成。菩萨若其不尔但為自利。即同声闻。故上论云。菩萨教化眾生即是自成佛法故。下举凡夫二乘及佛十善皆為摄善所摄。堕恶道有三义者。初句是因。后二句是果。果不自有。由因故得。要乘恶因到于苦果故言往也。因本自造。果非他受。故言依止自身。恶业既强遍感三趣。故言种种苦也问曰。经云十不善业道。何故名不善业道答曰。能通行人至于苦果名為业道。论云摄到一切恶果数故。言十不善业道者结也。摄到一切恶果者。重举转释。无恶不统名之為摄。业道者。造作名业。能通名道。摄取十名者此语倒。应言十名摄取。释数义。不善者就业释恶。三涂之报理非可尚。故言可毁。摄取业者此语亦倒。应言业摄取。因能达果名到。不相捨离名摄取。受行故者。领纳果报名受。果起在现名行。如是远离无因等者牒上。苦由恶堕故离无因。从恶得苦故离倒。因善解眾生住苦不能远离者。明必假人又显菩萨自明判因果。菩萨思惟深寂静者。此语倒。应言寂静深思惟。已欲救彼眾生自知勘能者。自住善法是勘能义也。复观察者。第二明摄善法戒以十善為体。即是行善问曰。初地善萨已证真智断有漏十善业尽。何故二地菩萨始修十善也答曰。若论十善五种差别。一者异心有漏十善。三界凡夫著我心修。二者异心无漏十善。二乘解无我修行。三者即心非我非无我平等十善。地前菩萨中道修行。四者即理无相十善。初地至十地无相心中无修之修。五者即理自体十善。万相永尽是佛十善。二地修者是无相十善也。就文中位有其五。论体有三。五者凡夫二乘菩萨与佛。体三者凡夫十善上期三有更不出离。二乘十<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>离体不离。菩萨诸<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>体俱离。以此义异故释名亦异。凡夫果报上下殊途。故善能益而上昇以之為善。损而下沈以之為不善。二乘趣理。故顺理名善。违理名恶。诸佛菩萨体顺故善。体违故恶。行法通故通為摄善。上来总观一切眾生。然眾生万差。自下别观。先列五章门。后次第释。故言后观也。对治者。不善以善為对治。不善业道及果善业道及果。此凡夫十善。及上上清净者。此二乘十善。出在凡夫上名上。但二乘二人有二。上名上上。三界报尽名清净。起增长上心者。菩萨及佛十善。穷尽惑障胜出二乘之上。求学修行者。观上业报不同故欲摄物行善也。此总列五数也。经曰已下乃至有顶明凡夫十善。又上善已下明二乘十善。论云实相观者。小乘不见我我所相名实相。非真如实相观问曰。若依经文次第。应先释凡夫十善。何故先举二乘智慧者答曰。為取凡夫十善因果作二乘四諦观境故在后而明也。又解。何故合辨者。欲明不染而染有為為凡夫。返染显净无為為声闻翻有為即无為故也。恶道身是苦体名苦諦。十恶业是苦之因名集諦。离彼苦集名灭諦。对治智慧名道諦。此就凡夫明四諦。人天善道身名苦諦。有漏十善业道是集諦。上对三途以人天因果為灭道。令望二乘复是苦集。离彼苦集名灭諦。对治智慧名道諦。此二乘因果明四諦问曰。人天是善。何故说為苦集对曰。人天虽免三途重苦。犹在三界以行苦為体。论集乃至有顶。是故苦集通在善道也。同观者。菩萨二乘俱得人无我空名同也。空则无二名无分别。因集者根本种性。畏苦者现无方便一向厌苦。捨心者捨诸眾生。依止者不能自知依止师受。观者观音声。法行浅功轻名微少。无心济他名依自身。故经云狭劣也。果苦等可解。我眾生等者。声闻入证但得无性空。但有名者。既无神我空但假施设也。不得真如空非法无我问曰。经云从他闻声名為声闻。若尔可一切从他闻人皆是声闻也答曰。不尔。若无大悲怖畏三界者所修十善令至声闻地。餘有大悲不畏三界而于佛智慧功德遍学者所修十善能令此人不由声闻经至佛果也。辟支者大智论云。胡名辟支迦。此云因缘。亦名各有三相。不假佛说法者。释自学是胜声闻义。唯自<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>者。是独悟辟支。前佛已谢后佛未兴。二盈中间观因缘法悟。不起心不勘说法者。释不能说义。涅槃经云。辟支出世但现神通以化于物。观微细境者。释观少境界义。声闻总观。缘觉别观名微细。但不尽法性名少。又解。如观树木火出等名少。而通解三世因果名达深因缘也。胜事者自觉等也。上上者出过二乘上之上。依一切善根者。释因集是根本种性义不利自他。依一切善根自行俱利益眾生。外化行随心逞行旷功德深远名广大无量也。菩萨正以大悲愍物為用。依悲故能益。故悲名為用。以四摄善巧益物。故摄為悲之力也。地有三者。上三句是集地方便行。今初地始修行成名地。初地深心穷尽法性三界惑已名净深心。论云十大愿得名。不退转者。二地至八地修行真解进趣迅速中无暂止名不退转。得寂灭者。无功用道无名无相。是无生义。不捨眾生者。九地為物行。解脱者。外道妄修小乘无餘皆自谓究竟名解脱。以细苦苦智拔穷其苦原名不捨。故论云八地得第一寂灭忍起净佛土教化眾生。九地说法利益也。十地行满受佛智职名受大位地求证佛智者。如十地中入佛智解脱大等。地净波罗蜜净。此显深广行成问曰。地与波罗蜜名异体一。但言十地行满名深广行成便足。何须明地净波罗蜜净也答曰。地净者是除障义。波罗蜜者到实相义。此行何由能到佛果实相。由地行除障即是地净。障尽到佛是波罗蜜净。地地展转名上上。成前地净是教道。理用无过名第一净。成上波罗蜜是证道。具足二义得成深广行。第一义波罗蜜义者何故重举者。明第一义理用為波罗蜜义。行彰菩萨以理行為行。异于下地故别指示也。佛十善有四义显上上事。菩萨名上上道清净。如来名上上一切种清净。如来圆极无上佛果行无不集。故统收上下集成佛德。共习气灭者释灭义。如来万德斯尽尘习永已名清净。万德满足名善业成就。二乘捨故者。闻佛果功德高胜无边望凡绝分无心敢悕也。于菩萨所行究竟对菩萨显上上。餘残者餘残经文。无厌足者。佛果万德无有穷尽义同无厌足。一切智中得者。除智障。一切种除烦恼障。降魔者。具足十力通越四魔名降伏。能引小心令归大解亦名降伏也。次上依大悲已下明利眾生戒。功用胜前故言次上问曰。何故后二戒后明摄眾生戒者答曰。菩萨正以益物為心。若自行不立无以化他。是故论云。若人自不行若為他说法令住善者。无有是处也。拔苦与乐名利益也。悲心深重名增上也。五种义中。智明不捨世间方便善巧。于因果如实不颠倒知。即上远离无因倒因也。已知眾生苦由恶招。故念摄眾生与如来无障碍解脱名愿也。修行者。修一切法如实觉也。此三即上摄善法戒。上摄善法為令他住善故。今举自住善法以為利他方便也。十种大悲德无不集故名為集。随种种眾生起利集无不穷名集果也。知受报有先后名时差别。知果轻重不同名报差别。餘报人中名习果差别也。上<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>者。一业各有三时也。时差别且道上品乃至下者但导总也。下经言杀生之罪遍三途者。明报差别。一一句中皆对上三句也。故下论云。前总观因。今别观果报。又解。眾生业行不可思议故作五番释。但文中倚互正有四种略无一番。经文可寻而取解。论曰时者乃至二者可解。是中时报差别者故总时报也。示苦深重者。显报上下三时差别。若在三处处中之重以為示深重。下者。若在饿鬼饿鬼中重。转深者。若在畜生畜生中重。转转深者。上罪在地狱地狱中重。总别令观者。前总观因后别观报。今令观恶道中无量大苦也。愿者摄善方便為利眾生而摄善法也。修行者正摄善也。集者欲令他住善。必于眾生生十种十心。十种心能集利益眾生故名為集。已住佛法者名同行也。不退者明真為虚融无障碍修会胜进无闻也。菩提愿者。初地二地行已同我故念益如己。即是我身者。正明缘摄入实障除体显自他平等无二也。餘二心者。行已高己故生师心尊心。乘大乘行进趣剋果。可师而敬之。既具足功德深可尊重也。集果胜悲所摄者。正对苦与乐益时踰彼以為集果。讫下文是也。初列十句為章门。初為总句。颠倒是也。倒者四倒是邪见。诸见根本名首。颠倒有三以下别作九句。通前番為十也。颠</p></div>"
}]