[{
    "title": "华严经章 第2753部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>章</p><p>奥妙绍名□□□□□□□□□□□□□□□□□<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>之相□□□□□□□□□□□□□□□□□□并举名号以□□□□□□□起□□非在外。所以即□□□□□□□□□□□□□□□□外故。所以即实故名名号品□□□□□□□□□□□□</p><p>四諦品第四</p><p>就此品中前后□□□□□□□□□□准后列十方名号就文可知。其相旨意□□□□□□□</p><p>光明觉品第五</p><p>此品所以兴者。上之二品广□□□理旨之相。正明<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。契实妙用周于法界。但义苞润嘱谅非玄悟。要由大圣<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>道力微见其像。乃有寄心。是以如来从足下相轮放大光明。现真实相含零有心无不啟悟。以是义故首檦名曰光明觉品</p><p>明难品第六</p><p>此品所以兴者。上显光明觉品现证之验。但前<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>圆寂真际之实。而显在于法界名品。然法界名号者。是无相之相。相即之实。眾生海者。亦复如是。此旨冲妙难中之难。是以文殊师利。与诸方大士详参尔迹且举十种諮门。一一随义说正答深旨得彰故曰明难品</p><p>净行品第七</p><p>此品所以兴者。上明圆果微妙非因不对因。虽无量无非净行故。次明净行品</p><p>贤首菩萨品第八</p><p>此品所以兴者。文殊上明行要清净。于中广大深义其相未彰故。问贤首敷演其奥故。次第八明贤首品</p><p>佛昇须弥顶品第九</p><p>此品所以兴者。上明佛果真实之德。略辨回行方便。会果之道。自下复明如来至寂虚凝而用周法界。何以知之。然不起道树之于六天。乃十方亦复如是。后欲广辨菩萨行位超昇有实出要故。次明昇须弥品</p><p>菩萨云集品第十</p><p>此品所以兴者。前明十方法界一合之相。此品欲明平等真寂一切皆是。是故大士十菩萨。皆据实观穷玄乃名见佛泯于分别。何故然也。欲明菩萨发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>决定即是与佛无别故。次明云集品</p><p>菩萨十住品第十一</p><p>此品所以兴者。前明真寂无相妙绝分别為开大士菩提圆道。是故有心晓达其趣。创发弘誓心冥大寂安固不动。谓之為住故。次明十住品也</p><p>梵行品第十二</p><p>此品所以兴者。上明心冥大寂安固不动成就住义。此明真实证修决定胜集。初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>时便成正觉故。次明梵行品</p><p><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>品第十三</p><p>此品所以兴者。上明梵行是之至寂真实之体。此品明功德是方便<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。前彰行体清净平等。此显备用殊致义福尘沙故。次明功德品</p><p>明法品第十四</p><p>此品所以兴者。上明梵行功德体。义广大发与佛同理宜胜进。是以惠菩萨。问于法惠广辨超昇增上之道。其相彰显故。曰明法品也</p><p>昇夜摩天宫<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>品第十五</p><p>此品所以兴者。前明十二种法。是胜进之道。欲彰勇猛大士。冥心玄会不由阶降故。次明昇夜摩宫自在品也</p><p>菩萨说偈品第十六</p><p>此说偈起意法用旨况与上相似。但名品行位处别為异。准上可知</p><p>十行品第十七</p><p>此十行品与前十住有何异相。十住明信解发心决定相应。今此十行明行成建立往待之义。何故知也。夫解明由行懃行成。由于解悟解行相须理数然矣。此為发起次第故。又言解<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>位也。所谓性真明义。拘齐观解行冥符同融一揆。于法界海临玄靡注故言解行。亦名迴向。非谓先后之异。夫言行者。体道归宗安心虚寂土已怀仁无不进达。虽复纵电于八荒之野。如不為非缘所羇慈光等曜十方同一统万乘于焂忽总眾相于一念不动。如大山王而常炽然。特进如斯之义相非量。何以故。前十住初发心诸佛说所不穷。况此行成建立。云何名言能尽品。次相接与十住义一。但行位為异</p><p>十藏品第十八</p><p>此品所兴者。上辨十行超昇增上究竟彻到至融无碍冥心真境法界藏海故。明十种无尽之藏為成上辨十种之行。是故复明十种藏义。十藏者。一信藏。二曰戒藏。三曰惭藏。四曰愧藏。五曰受闻藏。六曰施藏。七曰惠藏。八曰<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>藏。九曰持藏。十曰辨藏。是為十。夫言藏者。盖是法海之名。何故名藏。欲明宗无不统义无不苞德。备眾能理相恒尔故名藏。故次名十藏品</p><p>昇兜率天宫品第十九</p><p>此品所以兴者。上辨十种藏海。明理行始成胜进转妙真解踰明解行冥府方便道备正证无漏自然现前。是以寄一生之运。以表其义故次明也</p><p>十迴向品二十一并讚叹品义势相</p><p>此品所以兴者。上明行成。由于理资真解非行不显解行。均融菩提道立誓与眾生同之。佛果虽未究竟不住意成。是故一豪之善自然趣向萨婆若海故。次明迴向品。此十迴向中有三文。初三就法明迴向。次三据道以明向。后三就乘明向。第十法界无量者。备上三义法界海行具足成就。趣证之义非言能尽故。云法界无量迴向</p><p>十地品第二十二</p><p>此品所以兴者。前迴向中明大士解达玄原无有一法可起志想行烦虚宗。乃至不见一相可存。是以行满惠超成就实证理。现心用一切皆是故次明也。所言地者。决定生<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>知住持。又以常起四种大智□输被化眾生。复自建立五种那罗延幢。以是义故名之為地。故曰十地品也</p><p>十明品第二十三</p><p>此品所以兴。上辨十地大士<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>弥输道无不备故。以法性為身圆照為用。于一切法皆悉了达。為彰此义故次辨十明品。就中大意不出三明寄六通广之為十。何以知然。下结云。菩萨住此知明悉得三世无阂智明。于中一一广解其义可知。初名善知他心知明。了达一切眾生心相差别。第二无阂天眼智明。如来境界迴转死此生彼。悉能都见。第三入过去际无碍<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智明。过明去一切眾生一切事一切佛坐菩萨坐菩提树。乃至或正觉一切诸佛从初发心<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。乃至得无餘<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。一切诸事悉能了知。第深入未来际劫无碍智明。前但明如来境界迴转。此云诸事悉能了知。一切未来世中所有事与过去同。第五无碍清净天耳知明。十方一切音声乃至句味悉能闻知皆不妄失。第六安住<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>神力智明。此是神通相。第七分别一切言音智明。第八出生无量阿僧祇色身庄严智明。第九一切诸法真实智明。第十一切诸法定智明</p><p>十忍品第二十四</p><p>此品所以兴者。上辨圆照之明了达诸法。此显实解平等正住无生安心。于理名之為忍。随相而明故云十忍品</p><p>阿僧祇品第二十五</p><p>此品所以兴者。上来广辨诸佛菩萨德行弥博无量无边不可思议。皆云阿僧祇。乃至不可说。以示其行况未释所以。是故如来敷演此义故次明也</p><p><a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>品第二十六</p><p>此品所以兴者。上明德行弥广不可称说。欲明德以行成人以得立人法成用道被无穷<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>既无穷尽。寿命义亦同然。是故次明寿命品也</p><p>菩萨住处品第二十七</p><p>此品所以兴者。欲明菩萨充满德行寿命无中无边法身平等以无住為住。是以次明菩萨住处品</p><p><a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>不思议品第二十八</p><p>此品所以兴者。上来广明菩萨德行既不可思议。而未知诸佛功德义。复云何故。次更明不思议品。就中明如来八种离声者。一曰梵声。二曰深声。三曰远声。此三是声体。次三就喻。一如鼓声。其音洪韵。二如种声。其音嚮亮。三如金零声。其音清辨。餘有二声疑。一曰鸟声。二曰三尺鸟声</p><p>相海品第二十九</p><p>此品一时兴者。上辨佛法不思议者。欲明体融无碍。此云海者。欲明相无不实融无碍故则无体而不义相无不实故则无义而不体体无不义故则一体一切体义无不体故则一义一切义。是以体无体相义无义相体义融。于彼此眾用则无相不相。今据实相以彰妙德故云相海品</p><p>小相品第三十</p><p>此品与上者异。是拔别之名。好则<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>如是以表彰曰相情玩曰如。准此义以小檦别故云小相品</p><p>普贤菩萨行品第三十一</p><p>此品所以兴者。上明果德称法界海无中无边。自非圆因穷于实际何由能契。是以圆果既彰圆因须显故次明也。亦可言。即是果行寄因彰名。何以故。量周法界名之為普。至顺调柔谓之為贤。菩提道用名之為行故。言普贤菩萨行品</p><p>宝王如来性起品第三十二</p><p>此品所以兴者。上来广辨圆因圆果。圆因称于理实圆果等于后际<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>妙绝之旨者。所谓真性也。是故次明性起之义。然性用未如如不起而真性古今恒尔。以性用常起故。即用而弥寂。真性古今恒尔故。即寂而喻彰。寂用既无障碍。寧有染净之法而可得戒。是故真性為违顺之原。缘集之本妙用以之而兴妄相之而息如兴废出在妄情。于我未曾而為无為而為如无不為故。言性起宝王者喻况也。如意自在名曰宝王。真性亦尔。如来者就圆显以彰性故言如来。是故名曰宝王如来性起品也</p><p>离<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>品第三十三</p><p>此品所以兴者。上辨真性泯。于诸法一切空寂。万相归宗圆明独曜。若唯寂无起便同太虚。云何得為性体真明。是故复明义。兴后际法界等用用备眾能故名世间。无相可得谓之為离。非是有法可离名為离也。故名离世间品</p><p>入法界品第三十四</p><p>此品所以兴者。上辨法界等用义兴后际。若不在已虽妙何益。是故次明入法界。义理相统目名為法界。解融真寂谓之為入。契用无碍名之為行。是佛真子绍<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>种。即成<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>不绝之义故名入法界品</p><p>四弘誓文菩提难入以愿邀期。是以初发心菩萨。将欲逝恶修善广化眾生远求佛果。要以弘誓為本。弘誓既立。则愿无不从。如佛所讚。如来大智遵演说功德证忍慧福业力誓愿力。最胜菩萨一誓过于声闻百千劫行。菩萨<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>乃有无量。略举此四。总收都尽。何等為四。一者我<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>某甲。誓断一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。佛法甚深愿尽其源底。<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>二帝理相幽玄称為甚深。愿穷理源断惑斯尽。虽不则断弘誓力强。生生之处一切烦恼自然衰微。是以经言修心二。常虽有烦恼如无烦恼。是第一愿</p><p>二者誓修一切功德。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>可畏愿常乐处中。如世人不入臣海则不能得如意宝珠。菩萨若不入生死臣海。则不能得佛果无假宝珠。是以大士至崇胜果愿。出生入死广修万行。不计眾苦愿為种子总摄万行。于所生处一切善根自然收蔬称愿增长。是第二愿</p><p>三者誓度一切眾生。眾生无边愿誓令度尽。于怨捨怨。于亲捨亲。怨亲平等。广行四摄愿。与法界眾生一时成佛。既捨怨亲普行大慈。一切怨毒恶心自灭。内善勋修生在佛家种性尊贵无可讥慊。是第三愿</p><p>四者誓度一切种智。佛道长远。其必获得。终不以天胜果二乘涅槃而生足想。三世善根悉皆迴向。无上菩提不计劫数。愿以成佛為期。既志愿高远。不期世报。随所生处常处。豪尊虽极世荣不生深著。但愿胜中胜道。更无餘念。是第四愿</p></div>"
}]