[{
    "title": "四分戒本疏食卷第一.第二.第三 第2787部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p>四分戒本疏食卷 第一</p><p>凡欲开发经题。先作三门分别。后乃随文解释。言三门者。第一举宗摄教旨归。第二知教旨归第三正释戒经题目。言举宗摄教者。圣教虽眾略有三种。一修多罗藏。二毘尼藏。三阿毘达磨藏。言修陀罗者。所谓诸经。言毘尼者。谓诸<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。言阿毘曇者。即是诸论。今此戒本<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>之中。乃是第二毘尼藏摄。言知教旨归者。此戒所言為以义通论兼詮定惠。故四分律云。何名增戒学。所谓增戒增心增惠。是名增戒学。良以止作俱戒故尔。今以宗求唯戒学分别。就此戒学两料简第一<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>法门。第随戒行相。言受戒者。创发要期。断恶修善。建志成就。纳法在心目之為受。言随戒者。受兴于前持心后起义顺受体说之為随。就受随二门各开為两。谓受门二者。為障戒法有為不能孤起。藉因託缘然后方发。故明能发之缘。既有其缘必有所得故。次第二所发戒体。言受缘者。寔以位阶圣凡报殊男女託缘不同。四分律辨五种受戒。一曰善来。二称上法。三名三归。四曰八教。五曰羯磨。斯之五名备如常释。第二言受体者。撮要而论不出二种。一曰作戒。二无作戒。言作戒者。方便身口造趣营為。称之為作。二无作者。一发续现四心三性始末。恒有不藉缘。辩字曰无作。斯之二种俱有悬防。同称為戒。若也作戒以色為体。言无作戒非色非心第二次辩随戒二门者。第一专精不犯。第二犯已能悔。言专精者。上行之流。一往顺教恶离善行。称曰专精。但持有二。一明止持。二明作持。言止持者。念智捨等谨护身□造诸恶。称之為止。止而无违顺受之洁故曰止持。言作持者。奉顺圣教。作法作事对事作法。称之為作。作而顺受故号作持。第二犯已能悔者。不谨之人放纵身口违禁兴过。不修善行污本所受。名之為犯。惭愧追谢还令复本。亦名為持。虽非一往善成然亦毁而还复。第二白法故名犯。已能懺悔持。然犯有二。一者作犯。现违圣教广造诸过。称為作犯。二者止犯。不准教奉修止而有违。故名止犯。对斯二犯悔而还复。并称為持。上来已辨教之宗旨。其唯受随若无其受则行无所起。以有受故眾行得生。若无随行便有戒羸等失。以有随故令受光洁。故地持云。此二种戒摄受无量诸餘净戒。是故须受随二法就受门中广释缘体。先明受缘。后辩受体。言受缘者。八门解义。第一释名。第二解义总别。第三能秉教人师徒位别。第四教所被者。圣凡不等。第五藉缘多少。第六辨此诸缘发戒时节。第七<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>顿渐。第八校量胜劣第一释名者。诸部立名多少不定。或立四受言无上法。或立六受取律中八<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>内。自称比丘。是自誓受戒不然之义。今约四分定立五受。言五受者。谓善来.上法.三归.八敬.羯磨等是。言善来者。此人宿殖妙因道根深。后闻佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>契。谓初果深厌<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>悕求<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。佛言。善来比丘即发戒品故曰善来。亦可此等诸人深厌生死悕求出家。佛命善来即发具足故曰善来。言上法者。性定之理超出相。有物莫能加故称上法。无欲<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>进德。惑尽解满会增上法而发具戒。故曰上法。亦可尽无生智起出学表会而得戒故曰上法。故母经中建立善根上受具足。言三归者。此等诸人未感如来玄悟见道。但说託小圣诸阿罗汉等。以為良缘之深厌三有悕求出家。母云。诸罗汉等教令剃头染衣。凭仗<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>归依心成即发具足。故曰三归。之名三语。言八敬者。佛抑女人不听在道。波闍闻之生厌离。遂自剃头倚立祇桓。阿难见已為其三请。如来遥宣敬法。阿难传授。爱道闻之。尊斯八法作奉行之意即发具足。故曰八敬。言羯磨者。斯等人辈要假强缘。扶彼弱因方能发戒缘。彼僧眾羯磨言下而发戒品隐其能秉就所秉彰名。故曰羯磨受戒。此五受法得名有四。善来体境。善谓<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>求戒心。来是圣教。故惑可讚叹受名有心受戒。佛言善来故尔。上法从境又可当体受。受名建立。善根上受具足故。谓尽无生智归敬二受。约境就心。羯磨从教。亦可<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。谓名辩事故第二总别。四受是别。羯磨是总。以从远缘彰名。或四或六。而羯磨统收故说為总问。羯磨受戒既有四缘。何故独彰羯磨。餘不彰名者何。一释云。从餘缘彰名乃有多种。今且隐别就通以彰名羯磨。何足為妨第三秉人多论判言。见諦自得。餘六从他。彼对七受释故。今类彼论以判此五远而言之。尽从佛受。以佛出世有是法故。若以义推。上法得戒名為自受。餘之四种是从他得。云何上法名為自受。论云。以根本而言。由佛说法得证无漏发于具足。名从佛受。以义而推。自以尽智明明现前而得具戒。又名自得不从他受。故心论云。若法者佛五比丘受师等。若尔何故论云从他教得。答。此据远因而说。善来八敬是佛所秉名从佛受。三归羯磨<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>所是从弟子言敬下得第四所被分别。四分律辨善来受戒局在圣位。故律中云。见法得法得果证已去得无漏解。厌心出家。至顺之极。方应善来发<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。内凡已还想心所闻。非至顺之极。故闕不度。又上法受者。要第四果以其或尽解满故尔。三归八敬内凡已上。是以多论此二受法不羸不捨。故知内凡已去。言羯磨受者。始兴為凡。一兴已后三人通被。如<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>净行梵志得初果。已羯磨為受。四分律中莲花色尼亦同此例第五藉缘多少。善来受戒具。四缘得一证初果。文言。见法得法已前有出家<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。文言。欲于如来法中修梵行故三假对佛形。文云。前白佛言。四假<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。谓圣命善来上法受戒具三缘发。一假佛教授。如见论说。二有祈戒心。是以餘文罗汉<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>无出家意故。但得其果明须有心。三得无漏空解。谓尽智现前即得具戒。三语受戒亦具三缘。一假弟子形对法罗汉。二假弟子教。谓受三归言辞无缺。三归依心成领前归依故能得戒。八敬受戒具四缘发。一假佛八敬之教。二假弟子形。三弟子教。谓口宣八敬四奉行之意故。爱道自陈。我等顶受。羯磨受戒具足四缘。如律所说。一僧数满足缘。二教法成就缘。三结界成就缘。四身无遮难缘。若具此四是大比丘得成戒本。犯戒之人四中若闕非大比丘。顺此四方成比丘问。善来等受以心為缘。羯磨一受何故不尔答。羯磨非不有心。以假外缘作法。从强以辨故没因名。又可羯磨四心俱得。恐滥不辨心缘。又准母论。四以心為缘。羯磨一受虽文不列。要亦须心故。律文眠睡狂等不得戒故第六得戒时节。善来受者。唱善来竟即发具足。故律云。乃至得尽。若原上法受戒尽智现前时得。以小乘分齐罗汉梵行已立。自然戒净故更不从他受戒问。此上法得者得作无作不答。以非作法但得无作问。既非作戒。何因得发无作戒者答。以非学為故无其作。以道力故得无作戒。三归受戒第三语竟即发具戒。八敬受戒说第八讫即得戒品。羯磨一受羯磨竟便发具戒。诸论大同第七受捨渐顿。先明受渐顿。羯磨一受亦渐亦顿。餘之四受顿而非渐。渐顿如何。羯磨渐顿先受<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>次受<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>。后受具戒。是名為渐。若不受五十。直受具戒得三种戒。说之為顿问。若一时受得三种戒者。何须渐受答。染习<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>必须次第。先受五戒以自调伏。信乐渐增。次受十戒善心转深。次受具戒。如是次第得佛法味。好乐坚固可退败不失次第不破威仪。如游大海渐渐深入。一时受者既失次第又彼威仪。故须渐受问。一时顿受得三戒者。其无作体為一為三答。但发具戒一无作体更无餘二无作之体若尔便是一戒如何言三答。比丘受得防杀无作。与沙弥俗人同戒者。其实体一。是以多论家据其体。望三人始终位别言得三戒。理实无三问。所以知但一无三答。即此论文解次第受中。俗人下品五戒。次中品心受沙弥戒前五戒。仍本下品。五戒外发方為中品。上品心受具本前二品。仍犹下中五十外发始為上品。据斯二验次第渐受。三时心别同戒无作不发三。岂况一人时受者而得有三。故知渐次望位别作三。非体有三亦可。心论云。一切因一切支得三戒者。三时渐受。受既时别。重发无作有三体故。若论顿受。受既一时。方可名為望位為三非体有三次解捨之渐顿。若望四受受捨俱顿。羯磨捨受并含渐顿。為但羯磨一受。受制局渐捨兼渐顿问。羯磨顿受既得三戒。捨时云何答。义含渐顿。若也要心三戒俱捨则顿失三。是名顿捨。若言我作沙弥但捨具戒。言作优婆塞者又捨十戒。又言我三归人方捨五戒名為渐顿问。受之与捨俱顿并渐。或以渐受顿捨。此三可尔。若本顿受但得具戒。一无作体云何渐捨。若得渐捨便成三体。如何言一答。比丘一时受防杀。无作通沙弥俗人共有防非。是故捨时要心捨。具不捨十戒。若与沙弥戒同随心则在。故律文言。我作沙弥以十对五义亦同尔。故言。我作优婆塞。是以论说据体通三人共用义。故望位说三。非体有三。如此释时顿受渐捨义亦无防。故多六譬如树叶。夏青黄冬时则白。岂体有殊。随时异故树叶色异。而始终一叶。戒亦如是。常是一戒随位异。是以羯磨一受。受捨俱顿并渐。善来等四唯顿非渐。以无作法捨故第八优劣如多论说。若就灾患有无。四受是胜。羯磨為劣。若取任持佛法利益宽长。羯磨一胜。餘四受劣。言四胜一劣者。羯磨受者内实凡夫。福得浅薄感得此戒。多诸灾患容有厌上忻下。奉持心劣。令戒有羸。餘四受法内凡已去。理解心中受得斯戒。持心坚固。肥而不羸。二者羯磨凡夫容有不乐道法捨本所受。餘四受法乐道情慇理无退捨。三者羯磨容有转為二形。餘四受法复无此变。四者羯磨受人或起邪见断捨善根。餘四理解不断善根。羯磨一受或有上四故称為劣。餘四受法无前过非。是以名胜。此对始兴。若<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>受亦是其胜。言一胜四劣者。羯磨一受乃具六义。一是时长。谓通现未。二安遍三方。除鬱单曰报兼男女。四位该凡圣。五所被无数。六多坐作法。以斯诸义佛法始终。以白四羯磨為宗本。能继续三宝作无边利益。有任持之功莫大羯磨。故说為胜。餘四受中善来一受终尽双林。自外三受中间即止。又局阎浮不该餘二。凡圣位差报局男女。对前六义互各闕少。绍继功徵故称四劣。发戒缘竟第二次辨受体。于中四门料简。第一释名出体二戒先后。第二受随同异。第三辨发戒缘。第四所发多少第一言释名者。戒相虽眾义要二种。一曰作戒。二无作戒。先释别名作与无作。次解通名所目之戒。言作者谓方便身口起动造作。称之為作。故心论云。作者身动方便。言无作者身动灭已与餘识俱彼法随生。名為无作。如善受戒。秽污无记心现在前善戒随生。恶戒亦尔。次释通名戒者。此作无作俱有悬防。咸称為戒。依善生经通有五名。一名為制。制断一切诸不善故名之為戒。又名迮隘。虽有诸恶性不容受故名戒。又名清凉。遮热<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>令不入故。又名為上。能上天堂至无上道。又名学。调伏心智故名戒。此之五咸是义用释名。是故从用立名。称之為戒。然于五中迮隘清凉是义名。餘三用名问。何故得知有作无作答。诸论广明二种戒体。一如心论。第三羯磨剎那作及无作根本业道。又云。身口作前二有对。身口无作俱不可见无对。二多论云。初念戒有身口教及无教。第二念唯有无教无有有教。十住毘婆娑云。律义善根有其二种。一者有作。二者无作。作者是色无作非色非心。以斯文故明知戒有二种问。何须作无作者答。若无其作无作无所从生。若无无作不可一形防非。故须两戒此位言耳。如上法得戒。以道力故得无作戒次辨戒体。若依多论。作无作戒并是色法為体。此义可谓六种分别。一有為无為分别。二戒俱是有為法聚非三无為故。第二有為中三聚分别。作无作戒并色法為体。心及四相不相应法。是其戒因故。论云作及无作假色。是分别色阴。第三色聚中三色分别。一可见有对色。谓五根四坐。三不可见无对色。谓法入中无作。若言作戒前二色收。无作戒者第三色摄故。伽心二论云。身作可见有对。口作不可见有对。身口无作俱不可见无对。论其身作前二色中唯色入摄。口作戒者是声入收。非餘八色其二无作并法入摄。此作无作俱是色阴。第四就色声中报方便分别。色虽通报及方便。然身作是方便非报。故心论云。作者身动身方便。口作唯方便。以声非报法故。身口二无作非报非方便。第五三性分别。身口色声是善非餘两。故心论云。以清净心动身口名善作等。即向初色有二十种。前十二唯无记。后八高下长短方圆正不正。通三性局取善边。身作戒体。三声之中谓除第二因。不受四大声如风零等。唯无记故。就初因受四大声。第三因俱声。此二通三性中亦取善声边為口作体。帆论身口无作通于二性。今论戒故是善性摄。第六始终分别。此善作中通于终始不取始。谓始从请师终至羯磨。未竟要心。未熟善而非戒。第三羯磨一剎那。须要其心满思愿成就善。而是戒故局取终。然依得宗无作之戒。定用非色非心為体。作戒者取文不定。或有取文色心為体。故论文言。业者非直音声。要以心力助成。故知身业亦名以心力助成。明知二业色入為体。又引论文以心為体。是故论言。离心无思无身口业。故知二业用心為体。又假色為身口业体。故论云。身口业依止。四大意业依心。若身口业非四大為体。性者意业依心亦不应。以心為体然意业依心故。即说意业用心為体。故知身业以四大动為业。业无别体。即用四大作体。口业者四大相繫于中出声。声成音曲有所表彰。以為字句為口作业。业无别体。用声作体。是以论云。是法名声性。法入所摄。故以远从四大即声成。故用声為体。身业近依四大故。即用所依止為体。次明二戒先后。依心论说。似一时得故文言。第三一念作无作根本业道。又多云。初念戒者教无教后次第生。第二念戒但有无教无有有教。故知一时然无作。三时有非戒者。一者因时无作。但是作俱是非全戒体。二身是果时无作。无作有二。一是作俱。二是形俱。形俱一种方是戒体。三谓果后唯局形俱。此是戒体。以其果时有形俱故明一时得。若依此宗。以先后发。故实云。问。齐何名為无作。答。第二念须名為无作。以作戒為初念故。名无作為第二念。唯羯磨竟所有无作是兹戒体。前二时中位是能俱所摄。又善生经方便心异作时心异眾缘和合得名為作。以作<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>发生无作。作已过去唯有无作。其心虽在恶无记中。本所作业不名漏失授。斯次辨明先后发。第二受随同异昔解受随义一。譬如一楯能择眾敌為破斯义。故立此受随二法并作无作。先解无作有其七种。一道共无作。二定共无作。三形俱。四要期。如日夜及处中要期等。五随业无作。如随戒无作及处中随作业发者。是六事无作如塔寺桥船等。事在时念念发无作等。七随用无作。即前事在有人用时复发无作者。是就此七中形俱定受要期通二。餘五定随次辨同异。受随无作同义有三。谓名体义。异便有六。第一受中无作义均一品。随中无作乃有优劣。言受中无作一品者。若本上品心受所发无作心增上故。戒亦上品。或容犯罪。或终至罗汉更无增减。以其酬本一品心故。中下心受义亦同然。三品各定故。言义均一品。随中无作多品不定故优劣。对五篇辨此优劣者。若就根条初胜乃至五劣。若自分胜进五胜乃初劣。即应五篇次第之义。又可一一篇一一戒心有增微。事别不等即有九品之持。故随无作有斯阶降。第二总别受中无作<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。总断一切恶意。于生非数顿得<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>。故称為总。随行无作次第渐成不可顿起。故名為别。第三悬对受中无作悬有防非。未即有行。随中无作对事防非。行成皎洁问。悬未有非对即随行受有何用答。若无其受随不成。随以共成一治故。第四长短。受是形俱。说以為长。随行无作从<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>发非形俱。故目之為短。第五有无者受中无作通三体唯善。随无作者体非二性亦不通两。此据剋性分别。受随俱善。餘二并狭。今约有无通不通。受是形具。通在餘二性中。故说為宽。随是作俱。等局善性中。所以言狭。此就一心自作為言。若先后心及以教人。餘二性中随亦通有如教相所詮。犯不犯中亦同此狭。故犯行中无不犯行。若通就先后心及教人。犯行中亦有不犯行。此即受随俱宽。作解者然须约以為三。若局善性俱狭。受随同善性故。若随人等俱宽。以分通三性故。若以自作随行对受分别。方有宽狭。此准多论有四五不同。若实依论不别宽狭长短。然后受中无作定是长宽。随无作者具于二种。以道无作宽长尔。第六受是根本随是根条次解二作同异。同义有五。谓名体义。宽狭长短等不同有四。一一品多品。二总别。三亦悬对。四根条。比说可知。既有此殊。岂同昔解受随义第三辨发戒缘者。若依萨婆多。别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>戒唯约见在。以过未非眾生故。若准得宗。发戒之时不在过未心。得戒以非眾生故。现在相续心中发戒。以是眾生然受戒时。要须三世境上所有之恶皆作断意方能发戒。还防三世境上非。所以然者。过去之境能生恶心故。论云。如人<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>过去所尊是亦得福。律仪亦尔。未来之境亦生恶心故。须普缘总作断意方能发戒。又若过未不发戒者。三世诸佛戒不齐等。以其诸佛戒品齐等故。三世以发戒也问。戒防未非。毘尼殄已起。何故得言缘三世境发。还防三世非也答。境虽过去非非过去等。以斯义故犹防未起非。是以须尔第四发戒多少。诸戒虽眾不过二种。谓作无作。作已还去唯有无作。一形相续。此无作戒乃有多品。以所防之恶既有无量。戒寧是一。故多论云。于一切眾生数非眾生数而发律仪。言于眾生数者。上至非相下至阿鼻。可杀可狂不可狂等。一一眾生乃至如来。就根本而言不过有身口七恶。三因缘故。一贪故起七。二嗔故起七三痴故起七。三七二十一恶。对防此恶受戒之时。谓从无贪等三善根心各得身口七枝。合二十一种戒善。乃至三千大千一一眾生皆亦如是。若十戒五戒得十二种戒。故心多二论于一切眾生一切时戒不断。或二十一种故。经云。眾生无边戒亦戒边。若非眾生数。乃至草木生种大地非法衣食等及一一罪处本受戒时</p><p>﻿四分戒本疏食卷 第二</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>慧述</p><p>诸大德是十三僧伽婆尸沙法半月半月说戒经中来此明第二篇。初□□说仪。次陈本戒后问清净。此句是其标也。且就总相九门分别。后乃别相□□□□□总相者。一起由三毒。二配于身口。三自作教人。四解遮性。五初犯种类。大持犯方轨。七二部同异。八违制不同。九下眾任运。言起由三毒者。初有□□□事起贪染心成。次有二戒。瞋心起成。次有二戒。因三事起痴□□□□□□瞋痴起成二配于身口者。位以為四。初二局身。次二麤语二谤四諫等八□□□□□有助成。次二房戒。身為正犯。口是助业次媒嫁一戒。身口正犯三自作教人□□□為三。一有五戒。自作成重。教人同不同。谓二麤语媒嫁二房自作定残。□□□同不同。若教人作五。于己有润故同犯残。若帆教人于己无润但可兰。二次有二戒。自作教人一向同犯。谓二谤戒。自作教人為己不為己。恼境处齐畅思不殊。故彼我同犯。三有六戒。自作犯残。教人但轻。谓漏失摩触自作犯残。教人偷兰。以无润己故。下四諫戒自违正犯。教人违諫亦得轻罪。若僧未諫教言莫捨但得吉罗。以无僧命眾法可违过轻微故。若僧諫时教言莫捨即结兰罪。以违僧命情过重故四性遮者。媒及二房是遮恶。餘之十戒体是不善。故是性恶第五种类者是论分為四位。初有五戒咸是爱染。初戒气分淫之种类。二二房两戒是盗种类。三污家恶行是杀种类。四餘之戒等<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>种类六持犯是中二房具二持犯。然前房半非除过重故。自餘十一止持作犯亦可□持作犯通十三戒作持止犯前房少分第房全品别阶降。已如上辨。七二部同异者。媒嫁二谤四违諫等。此七同犯。而四諫戒得罪虽齐。对境翻到。谓各违当眾諫故。媒谤三戒境罪俱等。自餘六戒僧尼不同。漏失僧重尼提。多云。女人烦恼深重难拘难。若制与重罪恼眾生。又女人要在私屏多缘多力。若乃盈流故轻。男子不尔。随事能出故重。又可染患。内外不同故有轻重。比丘摩触力能自固以限分制但得僧残。尼则烦恼厚重。既受摩触恐成陵逼深房中制故结夷罪。為四不同故罪阶降。一死活。二大小。三染心有无。四身轻重尼惧陵逼故须活及大等。僧据染患不简死及大小等。二麤恶语僧重尼轻。以希数故。又尼有趣重方尔故得兰罪。僧无八事相资故得僧残。二房戒者。大僧犯残。尼作犯兰。若就过量大僧得独行宿。喜独造房故制僧残。尼须伴假。若共造房自无过义。故律言。多人住屋不犯。见日二人造房不犯。设令独造希故兰罪。若尔覆屋过三。何故同犯。答。此据尺量分齐。故二人不犯。下过三节直辨摧坏招讥。不简大小故同僧提问。尼就有伴假独义希即得兰者。若尔尼是有伴假。独义希屏露二坐不应同犯答。此就损业损微则轻。又设独造希而不数故得轻罪。坐等就讥事虽希数齐招讥过。僧尼同犯。若论不处分者。尼无兰若制居聚落。僧儻无房故宜须造设。不处分情过轻微但结兰罪。比丘大夫得在兰若树下露坐。安身进业。今在聚落营构私房故须重。遮惩其后犯八违制不同者。前之九戒违佛制得罪。后四諫戒违僧制招愆。此僧制者即是佛制。但僧若不秉即无违諫之残。残由违僧故。此四戒违僧制犯九任运有无。七戒容有任运。二麤两房二谤媒嫁得有遣人為已作义。所教事成三性之中犯七僧残。餘无教人故无任运。就十三中初之九戒。若持护眾行法。违则坏眾行法。后之四戒若奉顺僧命息过。不為显眾法成就。有被时之益名护眾教法。违则坏眾教法。前中复三。初五内染。以明坏眾行法。次二两房事和。以明坏眾行法。次二两谤情和。以明坏眾行法。前五复三。初一坏眾行法不坏于时。次三坏眾行坏时。次一坏行义微坏眾坏时故</p><p>故漏失戒第一此戒人之喜犯故在初也。一制戒意。欲是恶法正是生死之原障道之本。理应禁断令梵行清净。多论言。三义故佛制此戒。一令<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>久住故。二欲正诽谤故。三欲生天龙善神信敬心故。四部律中佛并訶责言。云何以此不净手受人信施二释名者。方便动转标心究竟名之為故。体分盈流名為漏失。故曰漏失戒三具缘者。通缘如上。别缘有三。一作究竟意。二方便动转。三失即犯四闕缘。闕初二无犯。闕三或重轻兰已下正明戒本文有三段。一略制。二随开。三满制。言略制者。最初因迦留陀夷比丘起过佛便略制此戒。后因餘比丘梦中失不净。佛因集僧本<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>故开除梦中。是名随开。言满足戒本者</p><p>若比丘故弄阴出精除梦中僧伽婆尸沙此满足戒本四句料简。初略标。次广释。言略标者。一犯人。二人。三开。四结罪。言广释者。若比丘八比丘中第八白四羯磨<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>得处所比丘。是名若比丘义。所言故弄阴出精者。出其境界。先列六名。二次第解。言六名者。律云。实心故作出不净意。前境有六。若于内色外色内外色。若水若风若空。随任方便若出则犯。言内色者。谓眾生身分。心心领纳苦乐故名受色。言外色者。谓非眾生色。以无心心法领纳名不受色。所言内外色者。情非情合名受不受色。所言水风空者。比类可知。水中逆水顺水。风中亦尔。空中自空动身。乃至餘境。所言除梦中者。律云。乱意睡眠有五过失。一者恶梦。二者诸天不护。三者心不入法。四者不思惟明相。五者于梦中失精。善意睡眠有五功德。即反上句也。若欲睡时。手捉而睡。意令梦中漏失。睡中若失即犯。究竟非开限。若本无心意不欲出。梦中若出不在犯限。故曰除梦中。所言僧伽婆尸沙者。此是罪名。律云。僧伽者名眾。婆尸沙者有餘。已行法不绝為名也。若比丘如上于六种境作方便出精。后遂本心皆得残罪。如目连罪报经云。若比丘无惭愧心。轻慢佛谤犯僧伽婆尸沙罪。如不憍乐天寿八千岁。人间数二百三十亿四十千岁堕泥梨中。所言不犯者。律云。若梦中失觉。以恐污身衣故以弊物及。捺弃。若欲想出。若见好色不触而出。若行时自触两[月*坒]而失。若触衣而失。若浴时失。若手揩摩而失。如是一切不作出精意而自出者无犯</p><p>磨触女人戒第二一制意。多论六义故制此戒。一出家人飘然无依止。令制此戒与之。作伴有所依故二為息斗挣。此是争竞根本故。三為息疑慊。不但谓捉而已。谓作大恶故。四為断大恶之原。禁微防著故。五為护<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。若触女人必失正念故。六比丘出家理应超绝尘染。栖心累外為世轨则。若触女则丧世人宗敬心故二释名。身相捫摸為摩。二境交对曰触。故曰摩触戒三具缘。通缘如上。别缘有五。一人女人简非天与畜女异男等。女中不简死活大小轻重等。又通道俗亲疏。广说可知。二人女想。三染心。四相触。五受乐便犯四闕缘。若闕初缘有十一兰。人境差中有三句。初句欲捉人女所前境变為人男得前心兰。或人男来鬚处作人女想亦兰。第二或变為二形。或二形鬚三。或变作男黄门。或黄门鬚处。非畜各四类前可知。故合十一。闕第二缘有三十三兰想疑。双闕各执一。闕第三无罪。闕第四二俱有衣五十四吉罗。衣互有无九十偷兰。闕第五兰。已下正明戒本</p><p>若比丘淫欲意与女人身相触若捉手若捉髮若触一一身分者僧伽婆尸沙此满足戒本五句料简。初略辨。后广释。略中一犯人。二内有染心。三所触境。四身相触。五若触一一下结犯。今广释。言若比丘者义如上辨。言淫欲意者爱染污心。所言女人者如上淫戒中说。為欲通收觉与不觉等四种境故。不以有智未命终释女<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>如上。所言身者从髮至足。见云。若髮抓抓相触兰。以无觉故。所言相触者。若捉手至身分已来九种摩业。初句下一一释。言举者若捉摩重摩。或牵或推。逆摩顺摩。或摩或举或捉或下或捺。若餘触方便也。所言若捉摩者。摩身前后。牵者牵前。推者推却。逆摩者从下至上。顺摩者从上至下。举者捉举上。下者若立捉令坐。捉者若捉前捉后捉乳捉髀。捺者捺前捺后若捺乳捺脾。皆是摩业。所言僧伽婆尸沙。是第五结犯句。于中有三种罪相。初若相触二俱无衣情浓故著便僧残。女触比丘动身同犯。若不动身但吉。第二若相触互有衣情淡著便偷兰。第三若相触俱有衣情最轻微著便犯俱无。衣中若心境相应犯残。若心不当境疑故轻。如于觉境有此阶降。睡死少分坏三境类亦可知。故律云。比丘往触无衣觉女。睡眠新死少分坏者。但使往触著不问。受乐不受乐皆犯残罪。若女来触比丘不必须淫心。而比丘要须动身受乐者犯残。若不动身而受乐者吉。若先有染心虽不动身。而受乐者有触意故犯兰。动则犯残。若与二形身相触偷兰。十诵伽论云。意在女者残。在男者兰。善见云。若以髮髮相触爪爪相触悉皆偷兰。以无觉能触故根互坏相触者皆兰。若触畜生女者一切吉罗。僧祇意。谓男子黄门而是女人触者僧残。谓前有方便心后称本境。祇一时触多女人一残。一一触多残。比丘知法多诈捉女共卧竟夜不移一残。若以欲心触男子身或衣阕?呓约?省R?渫?浮4私撞煌?吆未稹A家曰夹擞谀诖ゾ场K贡缯?馈3┦实⒅?樯畈患虮舜恕DΥシ俏弈谌厩樵迷诰尘场J馊诵笮伪鹉信?榧磁ǖ?视薪捉怠2环钢小B稍啤H粲兴?∮胂啻ァ;蛳沸ΑH粝嘟馐毕啻ヒ磺胁环浮7遣环葛N罪。僧祇若共女人捉物。咒愿捉起。行食捉绳头尾。捉杖竹木。皆非威仪。有欲心者犯吉罗。欲心动物及以器绳或灒水著女皆偷兰。若母等近亲久别相见抱捉。比丘者当正念住不犯。十诵若母女姊妹為病患及水火刀兵深坑恶兽难救者无犯。但无染心。若為所没开。比丘手捉虽淫心起。但捉一处莫放到岸。不应故触触得浅。若女人泻水注比丘手。水流不断。于女生淫心偷兰。僧祇若城门道迮闹者恶待希已便过。若女人要所须令净人与。无者持著机上。语言取之。若物重不举。请比丘者傍无净人。比丘為举著高处令自担重。若乞食时有端正女人。持食来。比丘若起淫心者。放盖著地。令餘人授受之。准此若就女人取针线瓶等物。恐裳触者当语置地。然后比丘自取。餘并例知。十诵四分开处犹多。若据僧祇水溺难缘至死不开。须知急缓之意。过积集僧莫不由此</p><p>与女人麤恶语戒第三自下戒制意。同前凡淫欲之事其热鄙秽故名麤恶。今说其伏表障在口。故麤恶语通缘如上。别缘有七。一人女。二人女想。三有染心。四麤恶语。五麤恶语想。六言障了了。七前女知解闕缘准触戒说。此中但明比丘染心向女麤语。若前女人向比丘麤语。若染心领解亦应犯残。类同前触。文略不辨。五分具有此彼互向麤恶语同犯。已下正明戒本。亦因迦留陀夷闻佛已制前二戒。便于女说麤恶语。比丘举过。佛便制戒</p><p>若比丘淫欲意与人麤恶淫欲语随麤恶淫欲语僧伽婆尸沙此满足戒本文有五句。初列。后释。言五句者。一犯人。二内有染心。三人女出境界。四对说麤恶语。五随已下结犯。次释。言若比丘者义如上。言女人者。有知命根不断。言麤恶者非梵行也。所言淫欲语者。称说二道好恶也。初列麤恶语有八。若求若教他求。若问若答。若解若说。若教若骂。言求者。与我二道作如是如是事。若复作餘语。言教他求者。若天若梵水神摩醯首罗。右助我共汝作如是如是事。所言问者。汝大小便何似汝云何与夫主共事。云何复与外人共通。言答者。汝大小便道如是。所言说者亦如是。所言教者我教汝如是治二道。汝可令夫主外人敬爱。所言骂若言汝破坏腐烂烧燋堕落。与驴作如是。若复作餘语骂言。若复作餘语者。除二道已外说餘处支节。及得表麤恶语之言。故曰若复作餘语如消苏等类。第五随已下结犯者是僧残罪。于中轻重有四。一就本境麤恶语。随语多少一一残罪。二若前人不了者一反麤语一偷兰。随语多少说不了。了一一皆兰。三除二道说餘处支节亦兰。四与非人女黄门二形麤语。知者兰。不知吉。畜生男子亦吉。若与指印遣书作想令彼女。知者如前。不知亦尔。不犯中律云。為女说不净恶露观。大妹当知。此身九疮九孔漏九流。九孔者二眼二耳二鼻口大小便道。当说此不净时。彼女人说麤恶语。若说毘尼时。言此及此彼彼谓麤恶语。若从受经。若二人同受。若彼问。若同诵。若戏笑语。若独语。若疾语。若梦中语。欲说此错说彼。但无欲心一切无犯</p><p>向女人叹身索供养戒第四言多巧為美己之善招诱其情说淫欲事。以用自适故言叹身索供养戒。别缘有七。一人女。二人女想。三染心。四叹身说麤恶语。五麤恶语想。六言辞了了。七女人知解。此戒闕缘准触戒说。已下正明戒本。此戒因迦留陀夷闻佛已制前三戒遂向女人叹身索供养。比丘举过。佛乃制戒</p><p>若比丘淫欲意于女人前自叹身言大妹我修梵行持戒<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>修<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>法可持是淫欲法供养我如是供养第一最僧伽婆尸沙今辨满足戒本文有五句初列。后释。言列者。一犯人。二染心。三境界人女。四自叹索供养。五结犯。言释者。前三句可知。第四自叹索供养句中有二。一自叹五句。二可持已下索供养。言叹五句者。一自叹身。二言修梵行。三持戒。四精进。五修善法。释此五句以為四段。一释叹身有二。一色身丰美。二叹种性。故律云。叹身端政好顏色。我是剎帝利长者<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a><a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>大性种。二解梵行。以精进解梵行故曰勤修离秽浊。三解持戒。治犯戒方便之心名不缺。治根本犯戒之罪名不穿。离后眷属曰不染污。一戒具三。诸戒同尔。故律云。持戒精进者不缺不穿漏无染污。四释善治。谓十二头陀及诸善业同。故律云。修善法者。乐闲净处。时到乞食。著粪扫衣。不作餘食法。一坐食一揣食。塚间坐露地坐树下坐。常坐随坐。持三衣。唄匿多闻能说法。持毘尼坐禪是也。二可持已下解索供养。是第一之义。第五结犯者。此是僧伽婆尸沙。此是结罪句。轻重有三。一若作如上自誉己供养我来即犯残罪。虽叹如上事不说淫欲者犯兰。若在人女前。一自叹誉身一僧伽婆尸沙。随自叹身了了者一一僧残。言不了偷兰。若手印。若遣书信。若遣使。若现知相令彼。知者残。不知者兰。除二道索餘处供养兰。非人女兰。不了吉。畜生吉。境想如上。不犯中律云。若比丘语女人言。此处妙尊最上。此比丘精进持戒修善法。汝等应以身口意业供养于彼。若女意谓。為我叹身。若说毘尼。言此及此彼谓叹身。若错说者并不犯</p><p>媒嫁戒第五一制意。婚娶之礼和合生死。正违出离出家所為。特乖法式。又纷务妨修相招讥丑不勉世呵。是以圣制二释名。為彼男女往返计谋以成婚礼。故曰媒嫁戒三具缘通缘如上。别缘有六。一人男女简非畜。而于人中贵贱亲疏并是犯限。伽论云。指腹媒嫁犯兰。二人男女想。三為媒嫁事。四媒嫁想。五显事了了。六受彼语等还报四闕缘。比说可知。已下正明戒本。此戒因迦罗比丘起过佛便制戒</p><p>若比丘往来彼此媒嫁持男意语女持女意语男若為成妇事若為私通事乃至须臾顷僧伽婆尸沙此满足戒本文有五句。初列后释。言初列者。一犯人。二往来者。三彼此所媒境界。四正作媒嫁事。五结罪所言释者。初句可知。言往来者。可得和合是。言彼此谓媒境界。男女互為彼此。先举数列名。女有二十种。母护父护父母护。兄护姊护兄姊护。自<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>护姓护。宗亲护。自乐婢。与衣婢与财婢。同作业婢。水所标婢。不输税婢。放去婢。容作婢。他护婢。边方得婢是。次释名义。母护者母所保。父护者父所保。父母护兄护姊护兄姊护亦如是。自护者身得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。法护者修梵行。姓护者不与卑下姓。宗亲护者為宗亲所保。自乐為婢者乐為他作婢。与衣者与衣為价。与财者乃至与一钱為价。同业者同供作业。水所漂者水中救得。不输税者若不取输税。放去婢者若买得若家生。客作者雇钱使。他护者受他华鬘為要。边方得者杪劫得。后结是為二十。男亦如是。第四句正作媒嫁事者。父有二初媒业亦成妇等是所传之意。二乃至须臾顷者。谓暂时交会亦得僧残。二十念為一瞬顷。二十瞬為一弹指顷。二十弹指顷為一罗顷。二十罗顷為一须臾。日极长时十八须臾。夜十二须臾。夜极长十八须臾。昼短十二须臾。言僧残者。是结犯句。轻重有三。初使义具三犯残。二自受语往彼不报具二闕一犯兰。三受语不往彼具一闕二犯吉。故律云。若初语吉罗。往说不报偷兰。若还报者僧残。若使若遣书指印现相。随媒多少说而了了。随其往返一一僧残。若不了者偷兰。五分受男语吉。语彼不许还报兰。许还报残。不同四分。但具三时残。一受语。二往彼陈。三还报。除二道已媒餘身分者兰。若诸比丘白二羯磨差人媒嫁一切僧残。今知事白僧媒嫁净人供给婚具问僧同和一切僧残。若用僧物犯重十诵。伽论云。若指腹為媒及自媒者偷兰。若不能男女若道合一道女石女等一切偷兰。若媒人男畜生等并吉。僧祇為他求好马种和合故偷兰。餘畜吉罗。不犯中律。若男女先已通后杂别还和合者。开不犯。又云。不得為白衣作使。不得持他书往而不看。若為报恩。若生善。若灭恶。及佛法僧事一切看书持往不犯</p><p>无主自為过量僧不处分造房戒六一开制意。初辨制意。后明开意。言制意者。然上行之士报力资强。堪耐恼缘不废。正是以大圣制。依塚间树下省缘修道。不畜房捨。而中行之辈资报力劣。不堪寒苦制。同上士交妨正修。乃是被人坏道之缘。故开畜小房。比丘因开广作营构。纷预妨修。长己贪结坏知足行。违法造房。情过不轻。随开还制二释名。专任自由不蒙指示。名僧不处分。大不依称為过量。故云僧不处分过量造房戒三具缘。通缘如上。别缘有六。一无主。二為己。三自乞求。四过量不处分。五过量不处分想。六房成便犯四闕缘。若闕初缘犯后戒或三或二或一罪。若作如法房全可无罪。若闕第二為他作非法房。或二兰二吉或三二一或可无罪。若闕第三缘不自乞求。即无过量容有餘三乃至无罪。若闕第四作不过量处分。则全无罪容得四兰。谓实不过量作过量想兰。疑亦偷兰实处分作处分想兰。疑亦偷兰。上若闕第五亦得四兰。实过量作不过想兰。疑亦偷兰。不处分处分想兰。疑亦偷。若闕第六缘。末后二团埿未境已还尽轻兰。一团埿在重兰。已下正明戒本。此戒因旷野比丘作大房乞求烦多。恼乱居士。故制此戒</p><p>若比丘自求作屋无主自為己当应量作是中量者长佛十二搩手内广七搩手当将餘比丘指授处所彼比丘当指示处所无难处无妨处若比丘有难处妨处自求作屋无主自為己不将餘比丘指授处所若过量作者僧伽婆尸沙此满足戒本文有三句。初列。后释。言列者。一犯人。二自乞求。下正教比丘房量大小指授方轨。三若比丘下若违教作者结犯。言释者。初句义如上。辨第二句文有七。一自乞求有恼施主得过量罪。若其自物则无过量。二作屋除作餘物则无过量不处分。五分房者于中可得行立坐卧行四威仪。三无主者以其有主无过量。四自為甄為他作。于己无闰下犯残罪。五辨房之尺量佛搩手者。诸文不定。一搩手祇二尺四寸。五分二尺。且依五分长十二搩手者。谓二丈四尺。广七搩手者一丈四尺。此据室内。祇亦云纵广量屋内。六当将已下数房主比丘乞处方法文如律中广辨。问。作大小房顷乞处分。见论云。长六搩手广四搩手。作如是房不须处分。律亦成文。小容身屋不犯非為开无过量后房本无过量。何以开中除小容身。若过六搩手四已无问过量不过量诚须处分。七彼比丘下教僧处分。处分法如律广说。第三结罪句中有四种。二残二吉。有无互说可知。此下杂明如上诸文。四分律云。若作此房先知无难妨已。然后来僧中脱革屣。偏露右擘礼上坐足。右膝著地令乞处分法。尔时僧<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>此比丘。若可信者即听使作。若不可信眾僧往看。若僧不去应遣僧中可信者看。若有妨难不应处分。难者诸虎狼师诸恶兽者下至蚁子。言妨者乃至不容草车迴转处。见云。是人田园或怨家贼处尸陀林处王誌护处。四周不通十二。桄抒间有卷。一肘者十诵是捨四边一寻。地内有官地居士外道<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>地。若大石流水大树深坑等是妨处。明了论云。或空山巖石阴等得行住坐卧如作房捨所摄。解云。如上处等欲于中住必须隔断。若不衣量用功则多。若有妨难自损损他。故律云。若于妨难之地輒造房舍得二吉罪。过量不乞得二残罪。互过即犯不得俱也。為他作房舍俱得兰。律不犯中。减量无妨处难。為佛图讲堂。為僧多人住屋。草菴小客身屋者</p><p>有主僧不处分造房戒第七以有主故不辨尺量。与前有异。餘减大同。别缘有六。一有主。二為己作。三长六搩手。四搩手已上房。五不处分想。六房成。已下正明戒本。此戒因阐陀比丘造房斫露中神树。俗人呵嘖。比丘举过。佛便制戒</p><p>若比丘欲作大房有主為己作当将餘比丘往指授处所彼应指授当与处所无难处无妨处若比丘有难有妨处作大房有主為己作不将餘比丘往指授处所者僧伽婆尸沙此满足戒本句亦有三。一犯人。二作房轨则。三违教结罪。犯人者如上。作房立法文亦有七。一欲作大房者。大者多用财作。房者屋也。言有主者。返上无主是也。為己作指授已来。僧中乞法义如上。彼应指授处所者。僧应观察。若有信有<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。即信彼而与白二。若不信者眾僧往看。若僧不去应遣僧中可信者看。若有妨难不应处分。无者应与作法。僧祇律云。若僧中无能羯磨者。一切僧就彼作处。一人唱言。一切僧為某比丘指授□三说亦得无难无妨处者。义如上说。第三句结罪文如前戒可知。唯过量為异</p><p>无根谤戒第八一制意。然出家同住理应和蜜递相将护许不相恼触。今乃怀瞋横摄重事诬人。自坏心行增长生死以灭正法。又复尘坌良善甄在眾殊恼他一生废修正业。欺罔事深故须圣制二释名。内无三实曰无根。重事加诬名之為谤。故曰无根谤戒三具缘。通缘如上。别缘有八。一是大比丘及尼除下二眾。二大比丘及尼想。三内有嗔心。四无<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>。五重事加诬。六下至对一比丘。七言辞了了。八前人知解四闕缘。若闕初缘以餘五眾闕境双即有十兰。闕第二疑想各五。闕瞋心全无谤罪。若有三根但非法举。若轻事如他。或有提吉。闕餘缘等轻兰重兰。已下正明戒本。此戒因慈地比丘得恶房舍又得恶食。便令妹尼重事加诬。佛因制戒</p><p>若比丘瞋恚所[雨/复]故非波罗夷比丘以无根波罗夷法谤欲坏彼清净行若于异时若问若不问知此事无根说我瞋恚故作是语若比丘作是语者僧伽婆尸沙此满足戒本文有七句。初列。后释。言列者。一犯人。二瞋心。三所谤境界。四无三根。五以波罗夷重事加诬。六谤时。七若比丘下结犯。言释者。初句若比丘义如上辨。第二句瞋恚所覆。故律云。有十恶法因缘故瞋。随十事中以一一事而生瞋。十恶法者。祇三世九恼通非情处起瞋。是名十恶法。因缘广说可知。第三句非波罗夷比丘。律云。清净无犯名非波罗夷比丘。第四句以无根夷法谤者。欲解无根先解有根。言根者生后之名。根义不同。若标三别。谓见根闻根疑根。观赤青等称之為见。纳乡餐声名之為闻。见闻之后犹预不决心无定执。号之為疑。此之三种咸生举语故齐名根。故四分律云。见根者。见犯梵行。见偷五钱。见断人命。若他见从彼闻。是谓见根。闻根者。闻犯梵行。闻偷五钱闻断人命。闻自言得上人法。若彼说从彼闻。是谓闻根疑根二种。从见生者。见与妇人入林出林。无衣裸形。不净污身。捉刀血污。恶人為伴是也。从闻生者。若在闇地闻动床声。闻转侧声若共语声若闻我犯非梵行声。乃至若闻我得上人法声。除此三根已更以餘法谤者是无根也。第五句波罗夷法谤者。重事加诬言犯之法。此法要说初篇。即是麤矿言。欲坏彼清净行。此是显己谤意。律云。谓言眾僧灭殯此人我得安乐住。第六句若于异时至作是说已来。是自言非即谤时故曰异时。雪彼清净显己谤情故。因我瞋恚故作是说。律云。若问若不问者。佛敕比丘问能谤者。此事实不。若以无根谤他。获大重罪。自陈谤意。言踏婆清净人无如是事。由前次得恶房恶食。怀瞋恨故便谤彼耳。第七句若比丘作是语者僧伽婆尸沙。此是為结犯轻重有三。一谤比丘。二谤尼。三谤下眾就比丘文中三。初句若已无根四事法谤比丘但使内无三根。莫问有实不实。自作遣使了了皆成谤罪。若不了得偷兰。第二以非比丘法十三难事内无三根谤实比丘了了得残。不了偷兰。若实十三难人虽无三根。实伏说著作比丘相故但得兰罪。不同四重谤人体是污戒比丘故也。若于十三中比丘犯五逆边罪谤之僧残。以教从理同合殯。故若十律云。出血破僧此二谤人得兰。餘者吉罗。以名轻故。即是彼律以理从教。第三若以餘篇谤残提两罪。第二谤尼者亦同比丘。十律谤尼但得吉罗。五分僧谤比丘残。谤尼四眾吉。尼谤尼残。谤比丘提。第三谤下眾者皆得吉罗不犯中律云。见闻疑三粮说实。实有五种。一真实。二想实。三事实。如杀王还道杀王。四三根不互实。五四戒不互实。若反此五谤他犯残。十诵四重互说成谤。四分亦同</p><p>假根谤戒第九此戒要假异事上有见根。取彼事见以谤此人。见虽相当事不相当。名為假根。如见言闻等即是无根。前戒中摄。制意犯缘悉同前戒。唯以假根為异。文牒圣制故。曰我等前闻以无法谤欲明今是有限。故作是言</p><p>若比丘以瞋恚故于异分事中取片非波罗夷比丘以无根以无根波罗夷法谤欲坏彼清净行彼于异时若问若不问知是以异分事中取片是比丘自言我瞋恚故作是作是语者僧伽婆尸沙此满足戒本文有七句。一犯人。二瞋心。三假异分上根。四所谤境界清净。五以无根重谤。六自言。七结罪。广释中初二两句可知。第三句言于异分事中取片者。所言异分者。律说五种异分。一异趣异分。如指羊事為人。二异罪异分。如不犯波罗夷言犯波罗夷。以异分无根法谤僧残。若比丘夷谓犯残。以异分无根夷谤残。不犯残彼见提乃至吉。以异分事无根夷法谤残。若犯残彼言犯夷。以异分无根夷法谤残。若犯残彼谓犯提乃至吉。以异分事无根夷法谤残。乃至第三异人异分。不清净人相似名同姓同想同。以此人事谤彼。以异分无根夷法谤。第四异时异分。若见在家时犯四重。便言我言比丘犯初篇。以异分无根四事法谤。第五异声异分。若闻自称犯四事取自嚮声。以异分无根四事谤。第四句言非波罗夷比丘者。见彼清净。第五句无根夷法谤者。不见闻疑彼犯四重诬他犯重。言欲坏彼清净行者。彰其谤意。谓言眾僧灭殯。此人我得安乐。第六句若于异时至作是语已来。发觉或因检问或不因检问。自言由前得恶房恶食怀瞋恨故便谤彼耳。第七句若比丘下结犯相。经重如前戒破僧违諫戒第十一制意。和眾法同义无乖挣。理应详遵。犹如水乳。今反倚傍圣教说相似语。或乱群情怀僧断法。坠陷无辜為恶兹甚。是故圣制二释名。邪法改真分眾异执称為破僧。固执不捨名曰违諫戒三具缘。通缘如上。别缘有五。一立邪宝。谓是諫所為事故。二行作于时若不行作即无设諫。如法简非法设諫简不设諫故。四固执己心不肯从劝己若从諫不成重故。五三羯磨竟以若未竟但结轻罪。故须言竟四闕缘。若闕初缘亦是闕于第二不行邪化即破僧心息便闕下四。单有立邪三宝方便小吉。若闕第三若不设諫即无违諫容违屏諫。犯于小罪复得前二缘破方便罪。若僧諫不成知不成者亦无违諫。正有破僧方便究竟之罪。若作如法之心拒得兰罪。闕第四缘若未白前捨无违諫罪。有违屏諫。若白竟捨一兰。乃至第三未竟捨四兰。闕第五缘类前可知。已下正明戒本。此戒因提婆达多破僧故制此戒</p><p>若比丘欲坏和合僧坚持不捨彼比丘应諫是比丘大德莫坏和合僧莫方便坏和合僧莫受坏僧法坚持不捨大德应与僧和合与僧和合<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>不挣同一师学如水乳合于佛法中有增益安乐住是比丘如是諫时坚不捨彼比丘应三諫捨此事故乃至三諫捨者善不捨者僧伽婆尸沙此满足戒本文有五句。初略明。后广释。言略者。一明諫所為事。二彼比丘下诸善比丘屏受諫劝。三是比丘下固执己心不肯从。四彼比丘下眾僧諫劝之令捨。五不捨者下结成违諫。初句文二。若比丘者。出犯人即是所諫之者。二欲坏已下正明破僧諫所為事。欲坏者牒前始心方便。方便已下牒前立邪三宝。邪三宝者。是五邪法。坚持不捨者。牒前行化。谓以五法行化。于时诱诸新学。屏諫文二。初举上呵諫中初三句劝捨。故曰彼比丘应諫乃至莫方便等。二大德应与已下。举上呵中二四劝同水乳等。然诸大<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>虽有别所稟师同学法二。理应和合而无异相。犹如水乳和合僧得。故曰同一师学。如水乳合亦可水与水合。乳与乳合。故曰如水乳合。第三句是比丘者。谓诸善比丘。如是諫时者。谓牒前诸善比丘屏諫之时。坚持不捨者。谓调达比丘执心拒劝。第四句三諫捨者。善闻则顺从止不破僧。一无违諫僧残。二无破僧兰罪。离斯二过故曰捨者善问。其实白四师言应三諫。乃至三諫捨者善答。谓取白及二羯磨故曰三除。第四諫所以尔者。一犯不犯位。分前三未犯残。说第三竟犯残。二轻重别。前三犯兰。第三得残。故言三諫捨者善。以未犯残故。据其道理实是白四。又尼律文言。犯三法应捨者。谓过三法不捨者入重位故。第五句罪自下广解戒本五句之文。所言若比丘者。义如上释。言欲坏者。以十八法欲坏和合僧。所言和合者。同一羯磨同一说戒。所言僧者。四比丘若五若十乃至无数。言方便欲坏和合僧法坚持不捨。谓住十八法而破僧也。今辨十八法。一法非法。律非律。犯不犯。若轻若重。有残无残。麤恶非麤恶常所行非常所行。制非制。说非说。法非法者。八正真道能轨生正解。是泥洹之近因名法。调达说為非法。五邪不能轨生真解。是非法说以為法。律非律者。互说亦尔。犯不犯者。夫言髮抓佛制剪剃。而今调达谓髮抓有命。若不剪剃说為不犯。如心念作恶理。虽有违凡夫未制名為不犯。调达说犯。轻者遮过。调达见坏树叶堕长寿龙中。便言杀一切草木。其罪最重。初篇业重。一形永障以见须提。初作得重罪。即言一切盗淫悉皆是轻有残者。犯下四篇。非是永障。是其残说為无。残无残者為犯初篇。永丧道牙字曰无残说為有残。母云。麤恶者初二篇方便身口无惭愧心犯浊重偷兰。名為麤恶说為非麤恶。提罪已下餘兰等皆非麤恶说為麤恶。常所行者。八正五法互说制者。谓五篇禁戒金口吐宣。名之為制说為非制。非制者。即五法非佛金口名為非制。说以為制。说者四禁是重。餘篇是轻。此是正教名為说以為非说。重轻到说此非佛教名為非说。而说以為说。第二屏諫。初比丘屏諫劝不破僧。次劝和合益。故律云。应彼言。可捨此事。若用语者。若不用语。复令餘比丘乃至王大臣。用语者应来諫是名屏諫。第三句若不用语者。此拒屏諫问。屏諫竟得何罪答。此但吉罗。以无眾法故。又所諫人破事未成。违諫未满要待事成览吉。成提。第四句眾諫如前文。第五若不捨者下结罪。于中轻重有二。一自作违諫轻重。二教人轻重。自违諫中复二。初未作諫前但有逆方便吉罗。第二作諫时三羯磨竟犯残。若白二羯磨竟捨犯三兰。白一竟捨二兰。白竟捨一兰问。第三竟时得残者。為揽因成果不答。如五分藉前方便业思势分相资。令后心之业次第增著。得僧残时犹有兰吉。别须懺悔以其业思轻重不同感果有异。故不相成。四分律明但使作恶步步有罪。如生福文证步步有福。多论如欲盗杀步步偷兰。今所言二羯磨竟三偷兰。明因中有罪。然得果之时揽因成果。故律云。白未竟有其吉罗。作白竟直结偷兰。不言别有吉罗可懺。乃至三羯磨竟成残时。不言别有三兰须懺。故知因中虽有罪。以以因成果。第二教人文三。一比丘教。二尼教。三下眾教。不犯中律云。初语时捨通开三种。谓不犯吉罗兰残等三罪文。若破恶友恶知识。及二人三人欲作非法羯磨。或為僧塔和上闍利知亲友等作损减作无住处。若破是人者不犯</p><p>助破违諫戒第十一制意。同前眾僧作法。諫调达时。四伴影响助成破僧。僧寻设諫拒而不受。故曰助破违諫戒别缘有六。一调达作破僧事。二如法设諫。三遮僧设諫助成破僧。四僧眾如法諫此影助。五拒而不从。六羯磨竟即犯四闕缘。比说可知。已下正明戒本。此戒因提婆达故执五法。眾僧諫时伴偿比丘助破諫僧。佛因制戒</p><p>若比丘有餘伴儻若一二三乃至无数彼比丘语是大德莫諫此比丘此比丘是法语比丘律语比丘此比丘所说我等喜乐此比丘所说我等忍可彼比丘言大德莫作是说言此比丘是法语比丘律语比丘此比丘所说我等喜乐此比丘所说我等忍可然此比丘非法语比丘非律语比丘大德莫坏和合僧汝等当乐欲坏和合僧大德与僧和合欢喜不挣同一师学如水乳合于佛法中有增益安乐住是比丘如是諫时坚持不捨彼比丘应三諫捨是事故乃至三諫捨者善不捨者僧伽婆尸沙此满足戒本五句成就。一諫所违事。二彼比丘下屏諫方法。三是比丘下拒諫。四僧眾设諫。五不捨者结罪。初諫所為事文三。一总明其助破僧者。二伴儻之数。三正明助破文两。一劝僧莫諫调达。二此比丘下释劝意所以。我今劝僧莫諫者。以人如法。是故初二句人。如此提婆达发言有轨。故称法语复能灭恶生善。故曰律语。次二句法。是故然令我等庆遇所闻。故曰喜乐。称合道理安心从顺。是故忍可。二屏諫文四。一领前諫辞遮其影助。二然此已下人法但非显影助非理。大德莫欲已下是非相对劝捨乐正。是諫辞所諫捨助顺劝崇乳。四大德劝和有益。释其劝意。第三句是比丘者。谓诸善比丘。如是諫时者。諫牒前诸善比丘。屏諫之时坚持不捨者。谓助破比丘执心拒劝。第四句三諫者捨善。闻即顺从止不助破僧。一无违諫僧残。二无助破僧兰杂。斯二过故曰捨者善。第五句结罪可知此广释初句三。一人若比丘时破僧人。二伴儻之数四人。若过有二从顺。一法顺从。二衣食顺从。无共兴谋名為伴儻。要四人已上。始成邪僧。若佐成群侣名助伴儻。此二伴儻皆须设諫。餘义如上所明。比类可知</p><p>谤僧违諫戒第十二一制意。眾僧自理諫彼是非理分固执拒劝。三諫不捨故结罪二释名。倚傍六人同作四人。不治迹涉爱憎故名曰谤。固执不捨名曰违諫。故曰也三具缘。通缘如上。别缘有七。一作污家恶行。二心无改悔。三作法治殯。四非理谤僧。五如法设諫。六拒面不从。七三羯磨便犯四闕缘。若闕初缘全无轻重。直有污家等罪。闕三闕四同于闕二闕五。谓作七非容得七位阑。然当位中闕缘或一二三兰。诸諫闕如法諫缘。准此闕六七同五。已下正明戒本。此戒因阿湿婆等于羈连聚落起过故佛制戒</p><p>若比丘依聚落若城邑住污他家行恶行污他家亦见亦闻行恶行亦见亦闻诸比丘当语是比丘言大德污他家行恶行污他家亦见亦闻大德汝污他家行恶行今可远此聚落去不须住此是比丘语彼比丘作是语大德诸比丘有爱有恚有怖有痴有如是同罪比丘有驱者诸比丘报大德莫作是语有爱有恚有怖有痴有如是同罪比丘有驱者有不驱者而诸比丘不爱不恚不怖不痴大德污他家行恶行污他家亦见亦闻行恶行亦见亦闻之比丘如是諫时坚持不捨彼比丘应再三諫捨此事故乃至三諫捨者善不捨者僧伽婆尸沙此满足文有五句。一非理傍僧諫所為事。二从诸比丘下自理屏諫。三是比丘下拒屏諫。四彼比丘下僧諫。五若不捨下结违諫罪。初文有四一犯人。二依聚若下正明起过自他俱坏。三诸比丘下牒过驱儐。四是比丘下非理傍僧。傍僧辞者。谓不治违路者名有爱。惧于走者名有怖。谓僧嗔我二人名有恚。此三皆非解心所為。不达治罚之方名有痴。如是同罪下显已谤意。二屏諫文三。一諫莫谤僧故曰莫作是语等。二而诸比丘下得僧自雪已心。故曰而诸比丘不爱等路。懺已无罪可治名不爱。走人不现复不得治名不怖。汝等二人进不懺悔退不巡走。身过俱现。理合治罚名不恚。善达治儐故名不痴。三大德已下推过属彼故曰大德污他家等。三是比丘者為诸善比丘。如是諫时者。谓牒前诸善比丘。屏諫之时坚持不捨者。谓能谤比丘执心拒劝。四三諫捨者善。闻则从顺止不谤僧。离斯重过故曰捨者善。五结罪。自下广释文义。言若比丘者。义如释。言聚落者。村有四种。如上。若城邑者。属王处也。言污他家者。有男有女。名之曰家。污家有四。一总举四数。二别释。三总结。言总举者。污家有四。一依家污家。一家得物又与一家。所得物处闻之不喜。所与物处思当报恩。即作是言。有与我者。我当报之。若不与我。我何故与。二者依利养污家。如法得利。及阒叙N或与一居士。得者生念。当报其恩。若不与我。我何故与。三者依亲友污家。若比丘依王大臣或為一居士。或不為一居士。便生念言。其為我者我当供养。不為我者我不供养。四者依僧伽蓝污家。若比丘取僧华果与一居士。不与一居士。彼有德者思当供养。若不与者我不供养。以此四事故污家名污他家。言行恶行者。彼比丘作如是等非法行也。自种花树。自溉灌。自摘花。自作鬘。以线贯繫。自持与人。若复教人作如上事。村有妇女。同床坐起。同器饮食。言语戏笑。或自歌舞倡伎。或他作己唱和。或作俳说。或繟鼓簧吹唄作眾鸟鸣。或走或扬跛行。或啸或自作弄身。或受戏笑是。是名行恶行。言污他家行恶行亦见亦闻者。律云。时有比丘。彼村止宿。著衣持闳氪迤蚴场7ǚ?胝?腥モ孕颉5湍慷?小蛼味槲挠兴闹帧H缜八?鞑环刚摺H粲α孔鳌H舻靡殉伞H舾钤鼗底髅弊餮N作镊热巾。或作里革履巾一切不犯</p><p>减六年卧具戒第十四制意者。先有故卧具。未满六年。足得资身。长道便罢不捨故者更复造新。长贪妨道。招世讥过。是故圣制别缘有六。一有故卧具减六年。二不捨故者与人。三僧不听许。四更作新者五為己。六作成便犯。已下正明戒本。此戒亦因六群比丘常营卧具。故佛制戒。就中有三。一略制。二牒随开。三广制。今明广戒本</p><p>若比丘作新卧具持至六年若减六年不捨故而更作新者除僧羯磨尼萨耆波逸提此满足戒文有三句。一犯人。二制限六年。三若限已下造新结犯。初句可知。言除僧羯磨者。明开意。律云。有比丘得乾痟病。卧具甚重不堪持行。佛听。随僧乞法作新者。僧当白二听作餘新。僧祇云。若无老病因缘。六年不满不得更作新卧具。若身不羸臞。顏色不恶。白二听作羯磨。眾一一不成言尼萨耆波逸提者。是减限作故犯罪。捨懺如上。不犯者。律云。僧白二听及满六年。若减六年捨更作新。若得已成者。若无若他与作。一切不犯</p><p>不揲尼师坛戒第十五己有故坐具。障身便罢。令嫌故造新。虚损信施。长贪妨道。是以制揲為令息贪长道。物有受用之益。今更造新。不以故揲。违犯圣教。故制得别缘有五。一有故尼师坛。二更作新者。三為己。四不以故揲。五作成便犯问。尼师不揲而复过量得一罪二罪答。一解二罪。捨时先载去量外。然后懺悔若尔不揲者揲已懺悔。何须入捨。答。不揲尼师举体有过。今虽更揲犹有本过。故须入捨。量过者量外有过。若载去已过内无过。何须入捨。又复还主无受用义。故要须载。若故物作但有过量。无不揲之愆。已下正明戒本。此戒因六群违制故结</p><p>若比丘作新坐具当取故者纵广一搩手揲新者上以坏色故若作新坐具不取故者纵广一搩手揲新者上用坏色者尼萨耆波逸提此满足戒本文有三句。一犯人。二制其揲法。三若比丘已下不揲结罪言若比丘义如下辩。言新坐具者故揲一搩手是制揲法。律云。造新坐具时。若故未坏。未有穿孔。当取浣染治之。牵挽舒裁。取方一搩手揲著新者。若揲边若中央。以坏色故。僧祇律云。若自无故者不得从少闻。犯戒者无闻者住坏房。不治者恶名人断见人。远离二师者不喜听问人。不别魔事人。边取者则反上。多论若无故者一搩手拒亦应用。善见云。故者下至一经坐不须揲。言若作新坐具至波逸提已来為不揲故结犯。就句有四义。一须捨物。二须懺罪。三应还物。四不与得罪。律云。若揲若自无得处不揲。若他為作。若得已成。若纯故者作不犯</p><p>担羊毛过三由旬戒第十六然出家之人躬担羊毛。顺俗而行迹同。凡辟动越威仪。招讥损道。故制不听。所以复开。三由旬者有持之利。无以存济。复开三过担结罪别缘有四。一贵羊毛除贱故。律云。头顶足毛不犯。祇云。驼猪等毛越。二是己物。三自知。祇云。三人共有各持齐九由旬。重担者俱犯。四过三由旬即犯。已下正戒本。此戒因跋难陀起过。便制此戒</p><p>若比丘道路行得羊毛若无人持得自持乃至三由旬若无人持自特过三由旬尼萨耆波逸提此满足戒本文有三句。一犯。二开三由旬。三持过结犯。初句可知。第二句持三由旬者。著道行。若住处得羊毛。须者应取。无人持自得持至三由旬。若有人者语。我有此物当助我持。若彼持后。于此中间比丘不得助持。若持犯吉。以非全自持过三故。令尼四眾持过者吉罗。除羊毛持餘衣。若麻等犯吉。若担餘物杖头亦吉。言过限持尼萨耆波逸提者。是犯句。犯相如上。不犯者。律云。若持至三由旬若减三由旬有人语持中间不助者。使尼四眾齐三由旬。若担撬绳。若担头上毛作帽诸巾。并不犯</p><p>使尼浣擗羊毛戒第十七制意犯缘同浣衣戒。但此新故俱犯。以损功痴业。中制故尔。已下正明戒本。此戒因六群比丘使尼等擗染羊毛故起过。佛便制戒</p><p>若比丘使非亲里比丘尼浣染擗羊毛者尼萨耆波逸提此满足戒本句亦有五。一犯人。三非亲尼。三所染毛。四使染擗。五结罪。初二两句可知。言浣染擗羊毛者。擗者下至以水一渍。染者下至一入染汁。辟者下至辟一片。餘义皆如浣故衣戒同。所以不辩</p><p>畜宝戒第十八一制意。宝体利重。长贪妨道。喜生挣竞。招世讥嫌。是故圣制。不听受畜。然由资恶故开。付俗货净物受之故。多论与比丘结戒者有三益故。一為止诽谤。二為灭开挣。三為成圣种知足行故二释名。贮用属己名之為诽。情所珍贵称之為宝。故曰畜宝戒三具缘通缘如上。别缘有四。一是钱宝。二知是钱宝。三為己。四受取便犯四闕缘。若闕初缘犯吉。為宝者金银钱是。餘偽宝畜犯小罪。若闕第二缘犯吉。為想疑故。若闕第三第四罪无。已下正明戒本。此戒因跋难陀比丘起过。居土苦嫌。佛便制戒</p><p>若比丘自手捉钱若金银若教捉若置地受者尼萨耆波逸提此满足戒文有三句。一犯人。二所捉之宝。三自他二业捉而结犯。比丘者如上。言手捉钱者。多论明五种受俱犯。一以手捉取。二以衣捉他取。三器从他取。四若著是中。五若言与是净人并成捉宝罪。三尼钱者。上有文像。言金银者。生色似金。两种皆名金银。多论若捉金薄金像皆名捉罪。所言人捉者。置地受尼萨耆波逸提者。是结罪句。故律云。若教人捉同自捉犯。是以律佛告大臣曰。日有四患不令照。一者修罗。二者烟云。三者尘。四者雾。沙门亦有四种过。中不令威仪清净。一者不捨饮酒。二者不捨淫欲。三不捨手捉金银。四者不捨邪命自活。故经说言。酒為放逸。淫是生死原。金银生患重。邪命坏善根。以此义故佛自说言。若见沙门以我為师。而捉金银我说此人非是沙门。智度论云。出家菩萨守护戒故不畜钱物。以戒功德胜于<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>经云。菩萨持讥戒与性戒无差别。言尼萨耆者。是其捨法。若比丘欲捨钱宝。向信乐优婆塞语。此是我所不应。汝当知之。若彼取还与比丘者。当為彼人物。故受令净人掌。若得净衣恪Sσ资艹帧H舯巳〔换拐摺A铕N比丘语遣还。餘比丘不语者。当日往语佛。為净故遣与汝。若令与僧塔。乃至本主。為不欲使失彼信施故。不犯者如向所说</p><p>货宝戒第十九制意者。以其宝物更互相货為求息利。长贪妨道。招世讥过。故便圣制别缘有五。一是宝物。二互相贸易。三决价。四為己。五领受即犯。已下正明戒本。此戒因跋难陀比丘往市以钱。居士讥。佛制戒</p><p>若比丘种种买卖者尼萨耆波逸提此满足戒文有三句。一是犯人。二互相贸易。三结犯。初句可知。言种种买卖者。解第二句。律云。若已成金未成金已成未成金。此三种相贸易。银亦三种。钱唯一种。此七种交互易。钱者八种。金银铜铁白腊铅锡木钱胡胶八种钱。皆名為钱。言尼萨耆波逸提者。是犯句。犯相如前捉宝戒同。不犯者。律云。若以钱贸瓔珞具。以钱易钱。為三宝。不犯</p><p>贩卖戒第二十制意者。凡出家之人理息缘务<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>修道。何得利自贩博驰骋市肆。动越威仪。招世讥丑。财物既交或容犯重。临危险行非高节。以斯诸过圣不许。多论四义故佛制此戒。一為佛法僧上故。二為止斗挣故。三為成圣种故。四為长信敬不诽谤故别缘有六。一在家。二眾外道亦摄三共相贸易。三决价四為己。五自贸易。六领受即犯。已下正明戒本。此因跋难陀以生薑易食故起过。又共外道博衣悔而不得。遂讥嫌。佛便制戒</p><p>若比丘种种贩卖者尼萨耆波逸提此满足戒文有三句。一犯人。二明卖买。三结犯。初句可知。言种种贩卖者。律云。五种物相易。以时药易非时。以时易七日。以时易尽形。以时易衣。乃至以衣易衣。皆如是相互各五句。所以言贩卖者。谓价直一钱数数上下。增卖者价直一钱言直三钱。重增价者价直一钱言直五钱。言直五钱亦有三种。一买。二增买。三重增买。言尼萨耆波逸提者。是所犯之罪。律云。衣药交货挣价高下数数上下皆犯。多论此贩卖堕一切堕中最重。寧作屠儿。何以故。屠儿止害。一生贩卖一切俱害。不问道俗贤愚持戒毁戒。无往欺常坏恶心故。若居穀恒悕天下荒饿霜雹灾变。若居盐积贮恒愿四边反乱王路隔塞。多有此过故。此贩卖物作塔像不得向礼。又云。但作佛意礼之。设与僧作食。及四方僧房一切不得住中。持戒比丘不应受用。受用得罪。以过多故。若食贩卖因因堕。作衣著著堕。作卧具随转转堕。重于餘堕。僧祇若自问价作不净语。挣价高下皆越得物。若物直五十而索百钱。比丘以五十和之。如是求者不名為下价。若前欲买此物。比丘不得抄市。当问言汝止未為报云我休者。比丘方云。我以是价知是物好不。比丘自货抄市者越。若自举物价前人信之。贵取故犯盗罪。多论如贩卖戒中物。或方便有罪。果头无罪。如為利居盐穀后得好心。即施僧作福。成果头有罪。如為福餘来不卖后见利便卖。以利自入即是方便无罪。或俱有罪俱无罪类知。不犯者。律云。听五眾出家人共交易。应自审定。不应共相高下如市道法。不得与人货易。令净人货。若悔听还。若由苏相易者无犯。开供养灯明故</p><p>畜长愎?藿涞诙??恢埔庹摺H汇為应供之器。资身足。今过贮畜。长贪妨道。招世讥丑。累损坏不轻。是以圣制。然以物变无恒容有失夺资身。要用事不可废。施时不受。后则难求。故开十日说净。而畜违过。圣教过则结犯释名者。五分有比丘得一恪R苑鸩惶?す适┧?邮考ハ印1惹鹁俟?7鸨阒平</p></div>"
}]