[{
    "title": "四部律并论要用抄 第2795部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>四部律并论要用抄</p><p>救当护持佛戒□□□□□</p><p>明<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>缘起第一明<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>法第二明结界法第三明羯磨法第四明说戒法第五明安居及受日法第六明自咨法第七明衣法第八明<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>衣法第九明净地护净法第十明任究僧徒同住眾法第十一明<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>物法第十二明亡<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>轻重物看病嘱授法第十三明五篇七聚持犯轻重第十四明除懺悔法第十五明会通诸律违负第十六明诸部杂威仪第十七</p><p>戒律缘起第一</p><p>大圣如来愍悼群有。示生迦夷树王成道。四十九年<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>化物。临<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>时以此<a href=\"/remen/lvzang.html\" class=\"keylink\" target=\"_blank\">律藏</a>付优波离。如来灭后尊者大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。匡究三宝简得。五百大阿罗汉在王舍城结集<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。当时优波离一夏之中八十度昇高坐。具足诵出大毘尼藏。有八十诵。悉以嘱大迦叶。迦叶将入涅槃。复以律藏付嘱阿难。阿难临灭付二大士。一名商那和修二名末田地。依付法藏经说。末田地向罽宾行化。经中更不记也。商那和修在王舍城行化。临灭之时以法付嘱优波掬多。自掬多已上有五大师。皆总持八万法藏。智辩超群。优波掬多虽得总持<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>智力莫之能比是。优波掬多有五<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。一萨婆多。是十诵律主。二曇无德。此方名法正。有大乘根性。即是四分律主。三名弥沙塞。即五分律主。四名婆麤富那。即是僧祇律主。五名迦叶毘。此土未有此。之五人亦皆是大阿罗汉。不能总持八万法藏。各随己见遂分為五部。释迦出世当此土周幽王时。到汉明帝经像始至。逕百年许方有比丘。支竺微解汉语。少翻胡经。至秦主姚兴深信<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。以弘始八年。于长安草堂寺。请<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>罗什法师重翻。旧什法师善晓方音。明解佛法。于是佛法广流布也十诵律。以秦弘始八年。罽宾国有三藏法师。名弗若多罗。<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>十诵律来到长安。共罗什法师翻出译。一分未讫。三藏身亡。又有芦山远法师。与曇摩流支续翻。后复有三藏律师。名卑摩叉。又复是罗什法师所承习师自来到。寿春石涧寺重校律本。复出三卷。律序置之。于后此土律兴。十诵最初四分律。有晋国沙门支法令。亲向于闐国得胡本还到秦国。秦主姚长以弘始十二年。于长安中兴寺集令德沙门三百人。请罽宾三藏大乘律师名<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>耶舍。翻出四分律。凉州比丘竺佛念。护胡為汉。秦国道云等笔受。律教东流四分第二。第三五分律。有罽宾国三藏法师。名大十。将五分胡本来到杨州。以晋景平元年十月中。晋侍中瑯琊王司马练共比丘竺道生等请令出之。戒律流行五分第三摩訶僧祇律。有此土比丘法显。轻身重法。自诣胡国。求觅经论到摩竭国邑连弗邑。阿育王塔南天王寺写得胡本。将还此国。以晋义熙十二年十一月到杨州。于斗场寺共三藏佛陀跋陀翻出并六卷<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。此土律兴僧祇第四迦叶毘律亦名迦叶维一部律。眾生未感不行此土</p><p>四部律及论明受戒法第二</p><p>十诵明十种受戒法。一自然得戒。谓佛无师自悟。二<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>得戒。谓大迦叶。三见諦得戒。谓居邻等五比丘闻说四諦寻发具足。四善来得戒。谓耶舍等及如来一代善来所度。何以故。佛是法王自与受戒。此是等最后身。比丘终不学地<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>故。五三语得戒。谓未制羯磨前。谓罗汉所度者但為受三归即得<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。六问答得戒。亦名论义。谓须陀耶<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>年始七岁。佛问其义。一一答。佛称可圣心敕诸比丘与受具足。从问答得戒。因敕比丘故亦名敕听得戒。七者八敬得戒。亦名八重。亦名尊师法。亦名八不可过法。谓大爱道及五百释女求佛<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。佛遣阿难授其八敬听之出家。从八敬為名。故称八敬得戒(五分律云)爱道从阿难闻八法已<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>顶受。又语阿难。為我白佛。于八法中更乞愿。愿听<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>随次大小礼比丘。云何百岁尼礼新受戒比丘。佛告阿难。若我听比丘尼随次大小礼比丘者。无有是处。阿难闻已还报。爱道又言。顶受尊敬。佛言。大爱道欢喜奉行。八法听即名出家受具足戒。复白阿难。是五百释女今当云何。更為我白佛。佛言。即听大爱道為作和上。在比丘十眾中白四羯磨听。一时羯磨三人不得至四。此则爱道一人得名八敬受戒。五百释女即羯磨受戒。十诵亦如是。若如依四分。五百释女亦皆八敬得戒。八遣使受戒。谓半迦尸尼顏容端政。若出伽蓝即有坏行留难。圣者开听差一比丘尼。為使往大僧中代其乞戒。故名遣使受戒。九羯磨受戒。谓十僧作法十。边地持律五人受大戒。以边地佛法创行。僧徒希尟。集之至难故。大圣开听五人受戒。又四分云。得阿罗汉者。即名出家受具足戒。此人得最上法。名為上法受戒。故摩夷论云。时有年不满二十。而受生疑问佛。佛言。听教数胎中月及润月犹不满。佛言。此人得阿罗汉不。答言。得。佛言。此人名為上受具戒。又尼眾中女人曾出适年十二听受大戒。通此合有十二种受戒。此十二种中自然得戒。唯佛一人自誓得戒。唯大迦叶一人见諦得戒。局在居邻。五人善来得戒。通及僧尼佛。佛在时有佛灭后更无善来受戒法。三语得戒。居在大僧。未立羯磨已前听。立羯磨已后不听问答得戒。若今末法中有须陀耶沙弥。亦听受戒八敬得戒。唯居尼眾爱道一人不通。餘者遣使得戒。唯在尼眾半迦尸尼。若今末代有如是比丘。听小小顏容不得也。边地五人得戒者。今边方有佛法。初行处皆悉开听曾嫁十二居在尼眾上法受戒通彼僧尼。今若有得阿难汉者。亦即得名戒。唯羯磨一法教通凡圣被及。僧尼该罗现未须知作法。成以不成故。依诸部广明问。羯磨受戒具足几缘得名<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>答。依僧祇律具六缘得成如法。何者為六。一者受戒人年满二十三衣憔摺6?呤芙淙松砦奘??谀选H?咭?峁?删汀K恼呓缒谏?〖?N奁浔鸨姟N逭唪赡コ莆奈抻性黾酢A?呤???闳绶ㄇ寰弧1复肆?档妹?绶āA?猩僖皇芙洳怀晌省D暝坪温???稹I?o云。要年满二十岁。满二十雨。若年满二十。不满二十雨不得戒。但使雨满得受戒。若冬时生夏安居竟受戒。是名不满二十。若春时生安居竟受戒。是名满二十。前安居竟时生还前安居竟受戒。后安居时后安居竟受戒。是名满二十。四分家十二月為一岁。满二十人取本生月。皆名满二十得具足戒。僧祇家逕二十雨满得具足戒。如腊月生者至满二十逕十八雨。故名不满。如是等要满二十夏后方得受戒。然受戒事重。是出家根本。若本法不成即非比丘。与白依无别。受人信施及以<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。皆名為盗。得罪无量。若人定知年小受戒者。虽逕百年犹名沙弥。不应受大比丘礼敬及受信施。当更受戒问。此受戒已来备逕布萨羯磨。何故更得受戒答。此作受大戒。意听羯磨布萨。非盗心听故四分听更受戒答。祇云。若人自不知年几当问父母亲里。若复不知当看生年板。若无是者当观其顏状手足成就。以不若如是不知当问。何王何岁国土丰俭[泳-永+旱]涝等。非谓一切如是特有难知者。如是一一寻究。若实不知满二十。虽手足成就亦不得戒也问。四分云。年不满二十。听数胎中月润月等。此后云何答。有人初受戒时。意谓年满二十。受戒竟方知不满。怀疑问佛。佛言。听数胎中月涧月。若数一切十四日说戒。以满年数无犯。此是大圣开令得戒。依此间国法五年再润十诵云。洴沙王六年一润。五分五年一润。未知依何者是定第二身无遮难者何故须问也答。十三难人為三彰所牵与圣道隔绝。障不发戒名為难。是故须问又问。十三难者名义云何答。一边罪难。此人曾受大戒。犯波罗夷為僧灭摈。后自还复更出家。蠲在眾外。名边障不发戒。名难也。二污净行尼难。从出家已来不犯淫者。名為净行。若白衣时污犯。此人故名為难。三贼心受戒难。此人无师自剃髮。著<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>不受戒。而共他布萨羯磨窃盗佛法。故名贼心。若下三眾盗听说戒羯磨。诈同僧事亦犯也。四破内外道难。此人先是外道来出家。受戒后不捨戒。还入外道。邪见心重。自然失戒。若更欲于佛法求出家受戒者名难也。五黄门难。此人性多<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。闕于持戒。烦恼障重不发大戒。故名為难也。六杀父难。七杀母难。白衣杀父或杀母。违恩处深障。不发戒。八杀阿罗汉难。白衣时杀比丘。临命终时顏色不变。九破僧难。妄说邪法。或乱群情。同界之内别行<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。断坏佛法。知而故為。故名為难。十恶心出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血难。此人方便欲杀佛。而不能断命。侵损圣体。违理处深。得重逆罪。今时末世烧坏精舍形像<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。若见瑞相亦得逆罪。不得受戒。故名為难。十一非人难。若鬼若天变作人形欲受大戒者。名為非人难。十二畜生难。若龙若狐化為人形。不得与受戒。十三二根难。此人身具有男女二根。于僧尼二眾无安置处。故名為难。此十三人中初四及五逆<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>摄。黄门一人烦恼障摄。后三人报障摄。三障所羈一形之中不可改易。未出家莫度已出家当灭摈。广解如论中所说也问曰。不问十三难。為作戒不答。四分云。自制已后不得戒又问。本為防难故。今实无者何须问也答。虽為难故问。若实有难问以不问俱不得戒。若实无难问便得戒。不问不得戒第三明结界成以不成后结界法中当说第四界内僧尽集。不来者与欲眾僧和合无其别眾也第五羯磨称文者。若作白四羯磨。而白五白三白二白一皆不成也第六僧数满者。要清净大比丘十人。若过十人名為眾。满减则不成问。犯重人及十三难人作和上。為得戒不答。四分云。此不足僧数不得戒也。自餘证人犯重。但使证人多则得戒。少则不得戒四分云。时有从不持戒和上受戒。后生疑问佛。佛问。汝知和上持戒不。答言。不知。佛言。得。名受具戒。复有从不持戒和上受戒。佛言。汝知和上不持不。答言。知。汝知不应从如是人受具戒。答言。不知。佛言。此得名受具戒。又后有主疑问佛。佛言。汝知和上<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>不。答言。知。汝知不应从破戒人受戒不。答言。知。佛言。汝知从破戒人受戒不得戒不。答言。不知。佛言。得名受具戒第四人三句俱知者。不名受具足戒问。无和上得受戒不。佛言。不得。十诵律云。优婆离问。无和上得受具戒不。佛言。得名受具戒。羯磨人及眾僧有罪。四分云。时有和上九岁授人具戒。不知成受戒不。佛言。成受戒。眾僧有罪问。无衣愕檬芙洳弧K姆衷啤N抟裸不得受戒又问。借衣愕檬芙洳弧N宸衷啤=枰裸者应教衣主捨。得受戒。毘尼毘婆沙论云。无衣愕媒洳弧4鹧浴5谩H舳?涡胍裸。答言。一為威仪故。二為生前人善故。二為标异相故。须衣憔咭病S稚?o云。以和上足十人数。不名受具戒。又不自称字。不称和上字。不乞戒。皆不名受具戒。与人作和上应具十德。一持戒。二多闻阿毘曇。三多闻毘尼。四学戒。五学定。六学慧。七学自出罪使人出罪。八能自看病。九若弟子有梵行难。能自送使人送脱难。十满十腊(出僧祇律)依止阿闍梨应具十德。一具持二百五<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>。二多闻。三能教授弟子阿毘曇。四能教授弟子毘尼。五能教弟子捨恶善见。六知波罗提木叉戒。七知说波罗提木叉戒。八知作布萨。九知作布萨羯磨。十满十腊(出四分。增十中和上十德亦同也)威仪羯磨二种闍梨应具五德。一知增上威仪(是净身口戒。亦名<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒)二知增上净行(名净心戒。亦名定共戒)三知增上波罗提木叉戒(是净惠戒。亦名道共戒。出世法过于世法故言增上也)四知自羯磨(此一句善眾法文辞成就。言彰辨利)五满五腊(五年学戒。自行既成。堪与人作师也)临檀证人应具五德。一善知有难法。二善知无难法。三善知作白法。四善知作羯磨。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>行清净。具此五德能举眾法(表证威仪)有五法不得无依止。一不能勤修威仪(戒)二不能增净行。三不能增波罗提木叉戒。四若恶见不能捨而住善见。五不满五夏(出四分律)十诵云。五岁比丘五法成就。听不受依止而住。一知犯。二知不犯。三知轻。四知重。五诵波罗提木叉利。若无此五法。虽复多岁尽形依止他住问。大比丘得依止小比丘住不答曰。得。除礼拜餘一切如弟子法。应作有五法失依止。一死(师亡)二去。若师遥宿行。或弟子决意出界外。三休道(若师除戒)四不与依止(师捨教诫)五还在和上目下住。若和上摄受者。阿闍梨不应令请教诫。十诵律制依止法。乃至不得求水操漱。先求依止后因不諳相。委过起故开听。乃至共宿听无依止住过。是则不听。僧祇律云。优波离有二沙弥。欲一时羯磨受戒。以事白佛。佛言。同和上者听。僧祇律有四种师。一无法无食(听不须问而去)二无法有衣食(须问已去)三无衣食有法(虽苦应住)四有法有衣食(是為乐住前二种师。无法应懺谢已而去。后二种师有法者。尽形不得离)师有五失。弟子应懺谢已而去(一应语和上言。我如法和上不知。二我不如法和上不知。三我犯戒捨不教呵。四若犯亦不知。五若犯已懺悔。亦不如既出家训成之益。是以请求在外。諮稟修学胜法)受戒随根虽有多种。总归大要唯作以无作。初对师前作心受戒。运动身口造成此法。名為作戒。一得戒已坏之。在心不复营為。故名无作戒。是出世法作心受之。便得作心捨之。便失善业。不尔必能感报。不同戒法。有捨义。四分云。时有不与沙弥戒便与受具戒。不知成不。佛言。得具足。眾僧有犯。毘尼母论云。时有从破戒师受戒。生疑问佛。佛言。汝先知汝和上从师边受戒得不。答言。不知。佛言。得名受戒问。大僧得与尼受六法及十戒不。答。大僧唯得与尼作三种羯磨。一受。二摩那埵。三出罪。自餘法事诸律无文。设令作者羯磨不成。僧尼得罪问。何故大尼取比丘為师。式叉沙弥尼不取也答。女无独志。是故圣制。受大戒要取大僧作师。或叉摩那尼及沙弥尼。初始出家年幼志弱。但依大尼為师。諮承学戒。不须大僧问。受六法时更须请和上不答。不须。何以然。式叉摩那但于十戒中增学其六八。未是易位故不须请。又四部律皆言。眼见耳不闻处。若对面作羯磨者。不成受六法得罪问。有人言。大比丘尼得礼沙弥。是如法不答。此人不解律相。妄作是说。何以故。四分律房舍健度中。佛自為诸比丘制于敬法。小沙弥应礼大沙弥尼。何况大比丘尼而不礼也。何者不应礼十三难人。三举人灭摈人非法语人。如是等人不应礼。礼者彼此俱得罪耳次明捨戒法。然戒是净法应请昇累表。是故僧尼五眾护持佛戒。寧死不犯。若故犯者不如本不出家也。何以故。自坏道法。污辱师僧。秽乱三宝。欺负四思。不消信施益。罪尤多。若人烦恼迫心。乐道情薄。苟欲為恶不能遮止者。佛言。听捨戒还家。不得倚傍佛法。违犯清禁也。若欲捨戒者。当向一大比丘。故胡跪合掌。作如是言。大德一心念。我比丘某甲。今捨大还作白衣。愿大德境。我是白衣。如是三说。若欲留五戒者。当言。还作优婆塞。若欲留十戒。当言。还作沙弥。愿大德忆。我是沙弥。本从僧受得戒。今还应如法还僧。僧便证知。此推之不得对餘人而捨也(若比丘尼还尼捨)若捨戒已还乐佛法出家者。还听出家。尼则不听。何以故。十诵律中。因白衣见比丘尼<a href=\"/remen/huansu.html\" class=\"keylink\" target=\"_blank\">还俗</a>便讥呵言。此比丘尼先曾敬我法。中问為我所敬。今复敬我。无有正定。诸比丘以是事白佛。佛言。若比丘尼一返戒。不复听出家受大戒</p><p>四部律及论明结界法第三</p><p>界有二种。一作界。二自然界。作界者。僧作白二羯磨结界作法而得。故名作界。自然界者。不待作心自然而有。故曰自然界四部律文互易不同。四分云。聚落自然界者。去村五百弓。弓长中人四肘十诵云。村外尽一箭道。惭愧人大小行处来。名自然界僧祇云。村外牛羊所行流利处。名聚落自然界。又云。七树。结界法不得受。欲以未有界故。令一旧住比丘三唱界相。当结界作羯磨。齐自然界内来。僧应尽集者成结界。若不集者结界不成。若结界不成。在中作一切法事受戒等皆不成也。若未结不失衣界者。于大界外以中人掷石所及处来。為不失衣自然界。若结不失衣戒竟。无有自然不失衣界问。三部明。自然界不定。若自然界内僧不集作法不成。诸师或言成。或言不成。今取何部為定答。三部明自然界者。非结界自然。是独处自然界。為明空地聚落二界。有别所以明也问。何者是结自然界答。餘律更无明文。今依僧祇律明。结界自然界。时舍卫国有<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。问佛种菴罗树法。佛即答之。时优波离知时而问佛言。已闻菴婆罗分齐。今复请问。若有处所城邑聚落界不可知者。若欲作羯磨应齐几许名為善作羯磨。令使异眾僧各各相见而得成就羯磨。不犯别眾。佛告优波离。五肘弓量七弓。种菴罗树齐七树间相去。尔所作羯磨者。名為善作羯磨。虽异眾相见而无别眾之食(一肘尺八。五肘长九尺。一树间有十步半。七树计有七十三步半)十诵云。优波离问中问。佛言。若比丘于无僧坊聚落中起僧坊。未结界。齐几许名為界。佛言。齐是聚落界通行处。又问。若比丘无聚落阿兰若处初起僧坊。未结界。是中齐几许名為界。佛言。面一拘卢舍。是中比丘应尽集作羯磨。若别眾作一切比丘得罪(一拘卢舍者五里)问。若比丘捨大界。不失衣界亦捨不。佛言亦捨。又问。若捨不失衣界。大界亦捨不。佛言不捨。问。先界不捨更得结若大若小不。佛言不得四分明十种界。各有自然势分。一僧伽蓝界有四种。一周匝垣墻。二栅樆。三樆墻不同。四周屋。二树界。谓树荫所覆处名树界。三场界。于中治五穀处是。四车界。谓车迴反处是。五船界。谓迴船反处是。六村界。有四种。如伽蓝说。七舍界。于中有白衣妻子住是。八库界。于中蕴积物处是。九堂界。十仓界。于贮五穀处是(此十种界各从界畔。五掷石所及处来名衣自然也)五分云。若水中行。以眾中有力人水洒所及自然界。结界法极远得三由旬结。过是不得善见论云。结界场最小者得客二十一人。又善见论明八种物作界相有得不得。一者山界相。大者如须弥山。小者下至如鸟。二石界相。大者如牛。小者三十坪。漫石不得作界相。应别安石。三林界相。大者百由旬。小者下至四树相连。亦名林。竹草不得作界相。以体空不实故。四树界相。大者如阎浮提树。小者下至高八寸大如针得作界。若无自生树种树亦得。枯树不得作界相。五道界相。或车道牛道乃至逕三四村得作相。若入田道向井取水道向河水道穷道等不得作界相。六蚁封界相。大者如山。小者至高八寸。得作界相。七河界相。若好王治化。五日一两。此雨河水不得作界相。若四月不雨。河水常流不断。水深二尺得作界相。八水界相。若自然池水得作界相。若通渠入田或器水不得作界相。是名八种。此八种界相结界已后。界相虽灭而界不失。若人掘至水际亦不失五分云。时有比丘。不唱界相。四方相而结界。或以眾生及烟火等作界相。佛言。不成结界。亦不成作界相。犯突吉罗毘尼毘婆沙论云。比丘尼结界唯得方一句卢舍(僧界十句卢舍也)问。何故结衣界独言除村及界也答。毘婆沙论云。村者散乱不定。衣界是定。是故须除。又為除谤故。為除斗挣故。护梵行故。是故除也问有村须除无村。何故除答。羯磨法尔。若无一切除。何以故。若结时无村结界竟有村来入。不须更结。以先结故。若本有村后移去。即此空处名不离衣界。若村先小后大。随村及处皆非衣界。若先大后小。随有空处尽是衣界。又言。如王入寺界内张幕。住近左右作食处。大小行处尽非衣界也问。比丘尼于大僧界上更不结界。得作法事不答。不成作法事。以僧尼界别。不相摄故。应更结僧祇云。夏安居中若有王贼命梵行等难。或水多有虫漉不净者。随四方各三旬<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>结界。若难卒至不得作羯磨法出去。无罪(出诸方界中也)十诵云。比丘作结界羯磨时。一切僧尽变根作女人。名比丘界。名比丘尼界也。结界时有变有不变者。名何界。佛言。餘僧转作羯磨人不转者。名比丘界。若作羯磨人转作女人者。名比丘尼界。比丘尼结界转不转亦如是</p><p>四部律及论明羯磨法第四</p><p>诸部律文但言羯磨有一百一。谓单白白二白四而不至出其事。今依毘尼摩得勒伽论中出其名数。单白有二十四。白四有三十。是為一百一。单白二十四者。谓威仪阿闍梨白。羯磨问遮道法白。布萨时白。一切僧犯罪白。布萨时一切僧疑罪白。欲自咨时白。自咨僧犯罪白。自咨一切僧疑罪白。自咨一切僧中犯罪白。斗净时罪相未定白。安居时白。独受死比丘衣白。分死比丘物白。捨迦絺那衣白。说麤罪白。尊者陀驃比丘分衣白。现前毁呰白。恼然恼他白。学家白。捨学家白。覆惆住Q鲢白。是為二十四单白羯磨。四十七白二者。谓现前布萨白二。羯磨结大界白二。结衣界白二。结小界白二。狂痴白二。差自咨人白二。分卧具白二。结净地白二。功德衣白二。受功德衣白二。守功德衣白二。懺悔白二。略说十二种人白。二十二人白者。已下注。谓差守物人。差维那使如法作饮食人。净果菜人。净扬技人。敷僧卧具人。分粥人。分饭人。分两(衣处分沙弥守园人等也)闥赖吒白二。毘荼白二。灭挣白二。行法舍罗白二。乞作房白二。大房白二。举罪比丘白二。上座白二。捨惆锥?A畎滓虏簧?虐锥?2罱探氡惹鹉崛税锥?P虏ㄔ绨锥?2焕癜莅锥?2还灿锇锥?;俦姲锥?P笳砂锥?P舐缒野锥?N迥甑美?锥?U诓既?锥?J讲婺δ嵌?暄Я?ò锥?1臼掳锥?1惹鹉嵘?庸卜堪锥?A?堪锥?H??乓拱锥?J敲?氖?甙锥?赡ァ;蛴兴嫡摺R磺兴?黥赡ゾ∮τ冒锥?8从兴笛浴3?芫咦慵俺鲎铩pN一切皆应白二。三十白四者。谓受具足戒白四。羯磨与外道四月别住白四。捨三种界白四。种僧和布萨白四。苦切白四。依止白四。驱出白四。不见摈白四。恶邪不除摈白四。别住白四。服日白四。摩那埵白四。服日白四。阿浮呵那白四。忆念毘尼白四。不痴白四。实觅白四。破僧白四。助破僧白四。游行白四。随爱随嗔随怖随痴白四。恶口白四。恶邪白四。灭摈沙弥白四。比丘尼随顺摈比丘尼染污住白四。与学戒白四。是名三十白四羯磨。或有说。一切羯磨皆应白四。此一白一羯磨。唯除结界餘者悉有欲此一白一羯磨。几四人作五人作。几十人作。几二十人作。几四十人作答。除自咨受功德衣边国受戒等。应五人作。少则不成(此四种僧中名為五人僧)二眾受具足戒。应十人作(四种僧中名十七僧)比丘出罪应二十人作(名二十人僧)比丘尼出罪应二眾各二十人。除上四种羯磨餘一切羯磨四人得作(此名四十人僧)此四种僧得乘法者。据极少為言。若过数则益善。若灭则不成十诵律。优波离问。聋人足数。作羯磨成作羯磨不。答曰。若闻白者成作羯磨。问。作羯磨时睡时作羯磨不。答。若闻白已睡眠者成羯磨。若作摈羯磨时。所摈人睡但闻白者成摈也。何等不足僧数。十三难人。举人。犯重人。灭摈人。白衣。比丘尼。式叉摩那。沙弥。沙弥尼。神足在空人。隐没人。如是人不足僧数。若以如是人满僧数者。作法不成得罪。何人得足僧数。若清净如法比丘者。名足僧数四分明五种非羯磨不应作。一非法别眾羯磨(羯磨不成故言非法。同一界内僧不尽集。名為别眾)二非法和合眾(羯磨不成故言非法。同一界内僧不尽集。名為别眾也)二非法和合眾(羯磨不成。僧眾尽集)三法别眾(作羯磨成。僧不尽集)四似法别眾(到作羯磨。僧复不集)五似法和合眾。又一句作呵不止羯磨。应作如是法和合羯磨。七羯磨罚治恶人法。一呵责羯磨(十诵云苦切僧祗名折伏。此人内不护眾。斗乱眾僧。故作羯磨治罚也)二摈羯磨(十诵五分名驱出。此人坏乱白衣。天外护帆尔白衣。欲使未信者信故。说此法遣出聚落)三依止羯磨(此人毁辱眾僧。内不自护。故作此羯磨制。令学律諮受教诲)僧祇名不语羯磨四遮。不至白衣家羯磨(十诵五分名下意。祇云发喜。此人不外护至信。白衣已信者欲令增长。故作此羯磨制勒。此人不听自往别差一<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>比丘。将和合诲谢白衣)五不见举罪羯磨(十诵云。不见摈。僧祇云。犯罪不肯如法举。五分云。不摈。此人不信有恶业体。名无因见故作羯磨遮。在眾外不共同事)六不懺悔举羯磨(此人不信业能招果。名异见故作此羯磨举出罪眾外。不与同事)七恶见不捨举羯磨(此人不信爱欲烦恼能障圣道。名為邪见作此羯磨弃出眾外。不共僧事。前四羯磨治其无行。后三羯磨治其无信。言无<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>无内护外护而行。就内行中呵责治不护眾依止治不护行。外护中摈出者。白衣未信护使生信遮至者。白衣已信使增长。故有四羯磨。三举者不信集諦。业体障道能招苦报故有不见不懺二举也。烦恼缘助故不捨一举也。若不断集还招苦报。苦若不亡灭无由。既不求灭。于道路乖学中无用。故作法举之。此七羯磨治人之法。若不受罚当以恶马治之。一往驱之命出也)若作羯磨先具三法。一作举(出其过人)二作忆念(汝可不自知有是)三与罪(汝合得某罪)问。羯磨法何以不白三白答。事易者单白衣眾便成。事中少难须一白一羯磨便足。事中最难者须白已三。幡羯磨重叠諮决事之难易不改。此三备此三则作法义足。故不须白三白五。作羯磨竟夺三十五事。律文广明日已过</p><p>说戒法第五</p><p>僧祇云。布萨有二种。一十四日名小布萨。二十五日布萨大。中间布萨者。比丘有挣事起未久之间。还和合应作单白。非时说戒。前日已过后日未到。故名中间四分云。八难事起及餘缘听略说戒。若欲略说戒。先作单白。然后略说也。但难有远近。故有十五种略说戒。一者说序已。餘者唱言。大德僧听。是四波罗夷法。僧常闻。乃至七灭挣亦如是。二说序四事已。餘者唱僧闻。三说序四事十三事已。餘者唱僧常闻。四说序讫。二不定已。餘者唱僧常闻。五说序讫。三十事已。餘者唱僧常闻。第二五种者。一说序四事已。餘者唱僧常闻。乃至第五说九十事已。餘者唱僧常闻。第三五种者。一说序讫十三事已。餘者唱僧常闻。合為十五种略说戒。八难事者。一王难。二贼。三水。四火。五病。六人。七非人。八毒虫。及餘缘者。大眾集床坐少。若眾多病。若坐上覆盖不周。或天雨。或布萨多夜已久。或论说阿毘曇。或<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>明相欲出不得逕宿。受欲随近远可广说。便广说不者得罪。可略不略亦得罪。自咨时难及餘缘亦如是。又说戒时应知客来有多少。曰同不同。更说不说。告清净等皆应知。又说戒法清净。若比丘犯突吉罗罪。不懺悔者不得听戒。亦不得作说戒人何况犯重罪五分云。若说戒时忘者。佛言。听傍人授。犹故忘者听更授。授至三犹故忘者应更差人续次诵不应重诵。又六群比丘受欲已出界外去。欲使他法事不成。佛言。成出者犯突吉罗罪。比丘得授比丘尼。不得為诵。尼亦尔。有四种布萨。一三语布萨。二清净布萨。三说波罗提木叉布萨。四自咨布萨摩德伽论云。云何名布萨。布萨者捨诸恶不善法。捨诸烦恼有爱。<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>白法究竟梵行事。故名布萨</p><p>四部律明安居及受日法第六</p><p>四分云。有五种持律。一者诵戒序乃至三十事是初持律。二者诵九十事。三者广诵大僧戒本。四者广诵二部戒。五者都诵一切毘尼。是中春冬二时当依上四种律师住。不依得突吉罗罪。夏安居时当依第五律师住。不依得波逸提罪。安居法使及四月十六日明相未出到住处皆成前安居。四月十七日至五月十六日来名后安居十诵律。要及十五日布萨者。得前安居。不及者后安居。闰四月者前安居人百二十日满。闰七月者后安居人百二十日满。闰五月者前后安居人俱百二十日满僧祇云。若比丘道行前安居日不受安居。一越毘尼。到所住处。后安居日不受安居。二越毘尼。是人破安居不得衣施(问。此人不结安居。以何言破。答。应结不结故名破也)次名破安居不破安居法五分云。难事<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>皆不破安居。难者谓王贼水火非人恶狩毒虫命难梵行难。乃至蚁子壁虱等。皆听破安居而去。无罪。时有比丘。于安居中麤食不足。不知当云何。以事白佛。佛言。听此因缘故破安居。无罪四分云。时有比丘。于安居处不得随意饮食随意医药。不得随意使人。以事白佛。佛言。若有如是不如意事者。听以此事故云。时有比丘。依牧牛羊人安居。佛言。听。若安居中移从随牧牛人所去处听去。依船行人客押油人斫木人安居亦如是。有比丘。依聚落安居。若安居中聚落分為二部。随所供给所须具足处。若移徒遂去。次明受曰法四分明受日事。广略凡有二十五条。三宝事檀越请。布萨依物房舍。五眾请為懺悔出罪受大戒等事。不信大臣请。欲得相见。若有益若无益听受日法。信乐优婆塞请。或有优恼事。若為利养事得受日。不信父母请。欲得相见。得受日看应教令生信乐也。父母请。若為病若忧恼若利益事得受日。兄弟姊妹亲里知识故二本私通寺请亦如是。比丘诵十六种经求同诵人故听受日去。有不信人夺比丘衣物。或作诸衰损。欲往白王。得受日去。时有檀越。请比丘言。我欲<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>及房舍。比丘念。彼处远近不及即日还。佛言。听受七日去。及七日还不应。专為欲食故受日。除餘因缘名為衣阕?哒胪布爸烈┎荨V恋谄呷沼?埂H缡且皇碌檬苋铡pN事亦如受七日。十五日一月日亦如是。时有比丘。受七日出界外。為母至意所留至意欲还不反七日。自念為失岁不白佛。佛言。不失岁。兄弟姐妹本二本私通。或水陆道断等不失岁亦如是问。為看父母故受日。若道闻父母死。应去不答。不应去。本為生存故看。今既无身。云何得去。若去者破夏得罪十诵云。优波离问佛言。阿兰若比丘在于独处。一身当云何说戒。云何受自咨。云何受衣。云何受七日法。云何受七日药。云何与一切请。云何衣物净施。佛言。听阿兰若比丘心念布萨。心念自咨。心念受衣。心念受七日。心念受药。心念与一切请。心念衣总净施又问。何处受七日。佛言。界内受问。从谁受。佛言。从五眾受又问。心念得受七日不。佛言。得。除五种人。一者阿兰若坐禪。二者独住人。三者远行人。四者长病人。五者飢俭时依亲里住人。如是人更无餘人听心念作法又问。若优婆夷欲出家。遣使请比丘。大德来。我欲出家。是比丘破安居去。应去不。答。应去问。比丘应与忆念毘尼不痴毘尼。遣使唤比丘。是比丘应破安居去不。答。应去又问。是比丘中道闻比丘尼死。若返戒。若入外道。若八难中一一难起。应去不。答。不应去问。若去得何罪。答。得突吉罗罪四分律為三宝事不待请唤得受七日十五日一月日。餘事要有请唤得成受日。若无请唤虽受不成十诵。得受七日三十九夜僧祇。要為三宝得受事讫当还问曰。何故三部受日不同答。此制戒法渐次而开。初听七日。次听十五日乃至一月日。事犹不讫。听受三十九夜。犹故不讫听受讫当还。此皆出律。人随事近远分远受日法。散在三部。似有差别如实不异也问。何故唯三宝事得受事讫。而不通餘事答。三宝事重故听。餘事轻重故不听。此事法亦缓亦急。言缓者营事不讫。虽逕夏不还得夏。无罪。言急者若中间事讫。更為私营违限不还。破夏得罪。故言急也问。有人言。初安居时不受七日出界行者破夏。此事云何答。此人不善戒律。妄作是说。何以故。圣者制安居。要逕宿破夏。云何暂出便言破也。若初夏未有缘事。虽受七日不成受日。后若有事更不受日出界外。逕宿破夏问。若為乞三衣故得受七日不答。此非受日因缘。虽受不成。犹故破夏问。有人言。四分得重受七日。此复云何答。此人思文不审。四分但云最后受七日者。夏七日在有缘须行听受七日去。至七月十五日来以不来明不破夏安居。非是重受日问。若人為治生故假言為僧。或受七日乃至事讫后与僧少物。成受日不答。此人实為私已。假言為僧。交犯语罪。设使治生所得尽与眾僧。犹故破夏。况与少物望不破也问。比丘尼夏中得受日以不答。僧祇云。尼无羯磨受日法。若夏中所依大僧若死若休道。三由旬内有大僧寺。听通结界。十五日一往请教戒问。后安居人倍日未满。得夏以不答。四分云。倍日未满。不得数岁。又云。二人同夏。小者前安居。大者后安居。至七月十五日自咨竟。小者得腊。大者未满故未得夏。应一月在小者下坐。倍日满竟还在上坐。故智满日未满不得夏问。若破夏人及倍日不满人在他上坐。得何罪答。若受他礼拜得无量突吉罗罪。若作上坐别受施物。计钱犯重四分增三中云有三种安居。四月十六日明相未出来名在前安居。从四月十七日至五月十五日来名中间安居。五月十六日至明相未出名后安居。安居初应作四事(一解界。二结界。三分房卧具。四结安居也)时有比丘。于住处欲安居。无所依人。无白处。妄不作心安居疑。不知成安居不。往白佛。佛言。若為安居故来便成安居。安居竟作五事(一解界。二还结界。三分房卧具。四自咨。五受功德衣)问。破安居人得何罪答。四分云。不前安居突吉罗。不后安居波逸提僧祇云。有五种不得安居衣。一被举人。二破夏人。三不用道人。四者死。五不嘱授。破夏人小过失(一為诸佛呵责。二為诸天世人所呵。三破夏。四得罪。五不得受功德衣。六不得五事利。七不得摄施。八不得安居衣物。九恶名流布。十后生悔入<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>)</p><p>自咨法第七</p><p>四分云。前安居人应七月十五日自咨。后安居人八月十五日自咨。前后安居人同一处者。当从前安居人自咨。陪日满法。若五人广自咨。四人三人二人对手自咨。一人心念口言自咨僧祇云。自咨时差二人。不得差三人一人。内备五德者為僧作自咨人。五德者。(不随受怖痴知自咨未自咨)问。何故自咨俱差二人。不差三人一人答。若差一人為僧所差。即名僧使正得举餘人罪。若此人自有罪。无人可举。故须差二人。举罪时人人别说。不得一时。故须不三人问。自咨名何法答。自咨是举罪法。本因夏中举罪。令眾斗乱。是故停。至夏不同用共相。举罪懺悔清净。然后随缘问。何故懺悔要须人举答。人多迷己傍嘱者明。若不识罪无由得悔故须人举问。人言。自咨是解夏法。此言若為答。此说非法。何以故。本结今解便当失夏。故知非夏法问。人言。自咨是放捨法。此复如何答。此言非也。自咨若是放捨法者。应捨造过。何故言。我若见罪当如法懺悔。故知非也。若自咨时难事起。听作单白各各共三语自咨。难者如说戒中明。有五种与欲。成与欲(一言与欲。二為我故说欲。三现身相。四口语。五现身相口语。与说戒欲亦尔也)有五种失欲(一受欲比丘死。二休道。三入外道眾。四往别部僧中。五至戒增上)</p><p>四部律及论明衣法第八</p><p>三衣六物。一安多会(此名五条衣。一长一短一重。作院中著用。及以行道大小行时。缝衣洗阒醋髦钍率敝?</p></div>"
}]