[{
    "title": "大乘四法经论广释开决记 第2785部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>大乘四法经论广释开决记</p><p>依何而住。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在世自调恶人灭度之后云何共住。如来在日。佛自说经。灭度之后。一切经首。当置何言。令有情信。世尊告曰。我<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后。以戒為师。断一切恶。生一切善。设我在世无异。此故依<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>。专心而住。观身不净。观受是苦。观心<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。观法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。而除四倒。既出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。得成圣道。是故常应依之而住。诸恶<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>梵坛治之。但莫与语白当调伏。一切经首当置如是我闻等语。则眾生信。因<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>请。而置此文。即是此中起因由也言明所以者。略有四义。一為除疑。二令起信。三為简邪。四為显正。言除疑省。杂事律云。于结集时。阿难昇座。以法威為形忽如佛。眾起三疑。一疑大悲从涅槃起。二疑别佛从他方来。三疑阿难转身<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。说如是等三疑併断。言生信者。智度论云。说时方人。令生信故。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>大海。信為能入。又是道元功得母故。救拔眾生出生死。□须举信手。授于教手。序生信手。正<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>手。两手相接。出淤埿故。如人有手。至山取宝。若无手者。空无所得。有<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>人。入法得证。若无信者。虽解无益。是故经初令生净信。言简邪者。但无如是六句经文。当知皆是外道教收。如有外道一切教初皆必安置阿沤二字。阿表于无。沤表于有。言其教旨不离有无。今置六句為简于彼故。智度云。一切经首。当置何言。简异外道。言显正者。真实论云。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>最吉祥故。我经初说佛為佛宝。我闻阿难及苾芻菩萨名為僧宝。如是一时舍卫国等所说时处皆為法宝。以兹四义。置如是等。立所以竟。释正文者。唯智度论分六成就。一信。二闻。三时。四主。五处。六眾。言初信成就者。经曰如是。举所闻法。令有情信。名信成就。今捨诸说以三义释。初以二字各别训释。次乃总申二字之意。后带我闻以解如是。初言别释者。自古多解。大意不离教理行果。故今依此四义释之。教能显理。□如文不求义称是。理顺教显為如。义不差文称是。依教起行為如。顺理三相為是。依□得果為如。称果于因為是。次言总申者。显说此经离四种过故言如是。一离自说佛所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>正如是故。二离老异文义决定皆如是。故□□不信。若有信者。言如是故。四离非法。若<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>者。称如是。故后言带我闻释如是者。依佛地论及诸释意。如是总言依四义转。一依问答显离自说传闻过失。谓结集时眾成问言。□当所说昔定闻邪故。即答言如是我闻。二依譬喻显离增□共分过失谓。当所说如是文句如我昔闻齐此当说定无有异。三依许可显有<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>堪能<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。眾咸请言。如汝所闻。当如是说。便许彼言。如是当说如我所闻。四依教说显起恭敬信受功德。谓吉结集诸时眾言如是。当听如我所闻应正闻。以如理<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。二言闻成就者。经曰我闻。举能闻人。显自亲闻者。闻成就。谓传法者。自指身言如是法。我自亲闻。我谓诸蕴和合假者有主宰因故称為我。闻谓耳根发识听声。意随耳识而取于声所发名等。薰习在识。聚集显现。总说名闻。废别就总。故名我闻问。何须如是废别就总答。显藉眾缘故。谓闻法时要具心缘。若一一陈遂成繁广。但举其一义。则不周显。假具缘言我闻矣。若尔何不言无我闻。答。除怖畏心。恐诸外道等闻无我声。既言无我。谁闻谁学。怖畏佛法。不背入故。更有问答。如餘处明。三言时成就者。经曰一时。显所闻法。善合时宜。无非时失。时成就也谓明说此一部经时。于一时闻在某家说。则此显说一部经时。餘时复说无量经故。眾生根熟。為感如来逼机而应。药病相应。随言得益。说者听者。时分无差。共相会过。名一时失。外道世典无如是能。故我<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>名一时也。前简说听餘部经时。后简说听前后之时。□显佛教胜令生信也。若尔诸法应非<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>。说一及时心外法故答。虽言一时。不离<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>。谓此<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>随色分瘠。妄相建立一一与时。若离色心。则不可得。故不相应行蕴所摄。摄论说為世识数识所闻之法。尚不离心。况一及时而别有也更有徵答。如餘处明。四言主成就者。经曰薄伽梵。显说经主是最胜尊。表经可信。无非时主失主成就。若不言薄伽梵。不知此经是谁所说。一切生疑。智论说言。能说有王。一佛世尊。二圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。三天龙等。四神仙等。五变化等。若不言薄伽梵。恐谓餘说。今言薄伽梵说表可崇信。薄伽梵者。佛地论云。谓薄伽声依六义转。一自在义。二炽盛义。三端严义。四名称义。五吉祥义。六尊贵义。如有颂言。自在炽盛与端严。名称吉祥及尊贵。如是六种义差别。应知总号名薄伽。如是一切如来。具有于一切种。皆不相离。是故如来名薄伽梵。其义云何。谓。诸如来身。不繫属诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。故具自在义。炎猛智火所烧练。故具炽盛义。妙三十二大士相等所庄饰。故具端严义。一切殊胜功德<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无不和。故具名称义。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>亲近<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>咸称讚。故具吉祥义。具一切德。常起方便。利益安乐。一切有情无懈废。故具尊贵义。或能破坏四魔怨。故名薄伽梵。四魔怨者。谓。烦恼魔。蕴魔。死魔。自在天魔佛具十种功德名号。何故如来教传法者。一切经首但置如是薄伽梵名。谓。此一名世咸尊重故。诸外道皆称本师名薄伽梵。又此一名总摄眾德餘名不尔。是故经首皆置此名。然佛世尊有其三身。今此经者是应身说。若对地前。即<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>说。如对地上。即应身说。若法报身。亦无说法。自受法乐。不说法故。佛佛不相為说法故。非诸菩萨所见身故。既三身者其体不殊。是则三身无说不说五言处成就者。经曰住室罗筏城誓多林给孤独园。是说法处。显说此经必有其处。无非处失处成就也。此有通别。通言罗筏城。别言誓多林给孤独园也。通别令其远者知闻。别则為欲近者不谬若不说处。未知此经何处而说。一切生疑。為令生信故。说其处。言住有其三种。一威仪住。谓。四威仪是身业也。二说法住。谓。教诫门从是语业也。三禪定住。是其意业。此复有三。一梵住。谓。四无量。二无住。谓。四静虑。及四空处。二佛住。谓。三<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。言罗筏城者<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。此云闻有。昔二仙人。一名為闻。二则名為有。此二仙人置此城故。又有释云。此名丰德。谓。丰财宝女色多闻解脱<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>故名丰德。亦名闻物。以多宝物及以人物诸方闻故。言誓多者。此云战胜。即胜军王之太子也。太子生日王破敌军。因而立名。谓之战胜。言林者。战胜有园地。周十里。在于城南五六里餘。花卉兹繁。泉池文影。于园圃中。特為殊胜。言给孤独者。国之大臣。本名苏达多。此云善施。仁而聪敏。积而能散。极济贪哀孤恤老。时美其德。号给孤独焉。有七男子。六已婚聚。因為小儿聘室。遂至王舍大城。佛初成道。正在彼国。见佛闻法。果证预流。遂请世尊降临舍卫。如来既许愿造僧房。佛令鶖子随而瞻拨。唯有此处堪造僧房。遂诣太子。殷求货买。太子戏言。金遍乃卖。须达闻之。心裕如也。即出藏金。随言布地太子感念而告之曰。若佛非是良田寧轻金贵士。我植善种。正是其时也。任乡收树当自施。须达得地大建。僧房崇饰既周。遥请佛降。大圣悬鉴乘通。如来既至伽蓝谓大眾曰。林树祇陀自捨园地。须达买施二人同心。或崇功业。君上臣下。世曲格言。自今已后应谓此地為我陀树给孤独园。游化在城。君止在园。双举城园。显斯二义虽异。俱名住焉。是故经曰住室罗筏等。此举化佛所君化土。為对小根令生信故显佛慈悲。救重部故。理实亦有二身土净秽之方。无别质故。六言眾成就者。经曰与大苾芻眾千二百五十人及无央数菩萨摩訶萨俱。举同闻眾。显说此经必称根宜。无非眾失眾成就也。若不眾不知此经。与谁同闻。一切生疑。為生信故。举同闻眾。此分為二。一声闻眾成就。二菩萨眾成就。苾芻菩萨随次应知。言与者。兼并共从之义。谓。与结集者同在一时。同一集会。同无漏心。同离诸恶。同无学见。同我空道。同断烦恼。具此七义故名為与。言大者。此同闻眾。眾数多故。名称高故。皆罗汉故。离重障故。德难测故。王等敬故。向<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>故。破外道故。总渗诸释。有斯大义。言苾芻者梵音。具含多义。一曰。怖魔宫动故。二称乞士。乞食及法资身心故。三谓净戒离语意诸过恶故。四名净命。离邪不恶活命故。五云破恶。能破见修重烦恼故。言含五义。以译之但存梵语。由此五义故曰苾芻。言眾者僧也。四人已上。理事二和。得僧名故。同戒见等名曰理和。同布萨等名曰事和。以和合故。名之眾也。言千二百五十人者。即优楼频螺迦叶五百弟子。伽耶迦叶那提迦叶各有二百五十门徒。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗目犍连共有二百五十弟子。此等五师外道门徒。共有一千二百五十。佛初成道。初会度之。当随如来故。诸经论多皆举也。理实亦有餘苾芻眾。以此皆是净行<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>故。五师门徒故。捨邪归正故。初会所度故。善来得戒故。得二解脱故。人天所识故。具斯七义故偏举之。大乘经中。何故列此声闻眾耶。有三义故。一為集经者。欲令于自生正信故。二令诸声闻入大乘故。三不捨无上<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>等。是共法故。先列声闻者。為诸声闻不离于佛作待者故。于出家<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>恭敬故。言菩萨摩訶萨者。义如论说。故不明矣。此中菩萨不列其数。但无数者。摄利有情。来往无垣。或增或减。无常准故。故不列也。明证序竟次当第二明发起序。经曰尔时薄伽梵告诸苾芻。言诸苾芻。菩萨摩訶萨。尽形寿不顾身命。行此四法。此段经文正及释自委师故。今当但解广释之中不决定义。释言。谓同一所詮。彼二无有差别者。云何忍辱柔和同一所詮。谓忍能安受他所作害。柔和则能不损恼也。是故名為同所詮也。言不令得此者。谓欲令和忍辱柔和。是其一数非二数故也释言。<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>萨埵大萨埵。具足<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>胜光明最胜之子最胜因。最胜萌芽。為最胜具足勇猛及希有诸大道师。大名称圆满。大慈大<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>自在。如是具法者此十六名中前四之名。初地已上虽然。一一悉皆具有。而今且约分位建立。初四之名。与四愿乐。明德明增一边真如无间之地随次。当知言菩提萨埵者。谓。缘菩提及缘有情。初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>也。言大萨埵者。谓。欲摄化大有情聚。披弘誓甲。行大行故。言具足智慧者。唯思无上广大智故。言胜光明者。具足光能破烦恼所知之障大黑闇。故言最胜之子。最胜因者。此二即是极喜地名。从如来所家心生故。因彼胜智。一切最胜。乃得生故。言最萌芽者。即是第二离垢地名。為因初地二地萌芽而得生故。言為最胜者。即是第三发光地名。即彼萌芽。于此地中。无有损伤。渐令增进。趣大果故。言具足勇猛者。即是第四炎慧地名。于此地中。而能具足趣求菩提大力用故。言及希有者。即是第五难胜地名。為超二乘最胜地故。言大道师者。即是第六现前地名。為证甚深<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜义。而能道利诸群迷故。言大名称者。即是第七远行地名。為能到于加行究竟成就具足大名称故。言圆满大悲者。即是第八不动地名。从于寂静等持而起利有情故。言大福田者。即是第九善慧地名。為能具足四碍辩。说法度生。得大福故。言自在如是具足法者。此二即是第十法云地名。而得生于大自在处。及能<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>大法智故。已上二门。辩序分竟次当大门第二明正宗分。复分為二。一广。二略。初言广者。如经云。何為四至不应远离。此复分二。一示相。二结劝。示相复四。一对治不勤。二对治不了刀便。三对治弃皆有情。四对治乐著于境。此中复有四四异门论自明故是故不列四段经文。所有体义论当具明。今但略解释中。所有未决之义释言。菩提心者是所求事者。菩提之心有其二种。一胜义諦。二也俗諦。言胜义諦者。谓。无分别智缘真如也。世俗諦者而有五种。一<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。二行相。三所缘。四功德。五超过。言菩提自性者。而发愿言。我今為欲利益安乐一切有情。速成无上正等菩提。度有<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。言菩提行相者谓。自能行菩提之行。亦能所于他利行也。言菩提所缘。者。谓缘菩提及有情也。言菩提功德者。谓。初中后善也。言菩提超过者。谓。超二乘及人天也。释言。菩萨善知识者谓诸菩萨及诸佛也者。有其五句。明善知识。一能举故。二令忆念故。三教诫故。四教授故。五说法故。今此五句。约其三学。而当建立初二之句。即令显示增上戒学。若有违化。能举罪故。若忘违化。令善忆持一一<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>教懺悔故。其次二句而即显于增上心学。為能教诫心地法故。若有疑惑。能善断除。而教授故。从末一句即当显现增慧学。為能决释。自相共相无倒说故。夫听法者善知识所作。五种想除种想应住相者。宝想。眼想。明想。果想。大果利想。以难得想。俱生慧故。如实知故。得妙果故。无罪过故。应捨想者。毁戒下族。言辞无辩。声无美妙。于此五事不应见过。释言。忍辱者他所作害安能忍受者。瑜伽论云。云何堪忍。谓。如有一骂不报。骂嗔不报。嗔打不报。打弄不报弄。又彼尊者。堪能忍受寒热飢渴。蚊虻虱曰。蛇蝟毒触。又能忍受他所于犯麤恶语字。又能思受身中所有猛利坚劲辛楚切心夺命苦受。為能堪忍有所容受。是名堪忍。释言。柔和者不恼于他者。瑜伽论云。云何柔和。谓。如有一于大师等。具足成就慈愍身业。具足成就慈愍语业具足成就慈愍意业。与诸有智同梵<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>和同受用应所受用。凡所饮食无有私密。如法所获。如法所得。随在阒小?殂所摄。而為受同戒同见。成就如是六种可乐可受可重无违挣法。易可共住性。不可恼他。与诸有智。同梵行者。共住一处。常令<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。是名柔和释言。為欲对治乐著于境是故经曰等者。此中云何名為空闲。瑜伽论言。云何名為住阿练若。谓。住空闲山林垌野。受用边际所有卧具。述离一切村邑聚落如是名。為住阿练若释言。如经说以十尽句等者。此文出在十地经也。是故最初极喜地云。以十尽句成诸大愿。何等為十。所谓。一眾生界尽。二世界尽。三<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>界尽。四法界尽。五涅槃界尽。六佛出世界尽。七如来智界尽。八心所缘界尽。九佛境界智入界尽。十世间转法转智转界尽。如来生界尽。我愿乃尽。如世界尽。如灵空界尽。如法界尽。如涅槃界尽。如佛出世界尽。如佛智界尽。如心所缘界尽。如佛境界智入界尽。如世间转法转智转界尽。若彼界尽。我愿了尽。如是眾生界尽不尽。我此善根亦不可尽。世界尽不尽虚空界尽不尽。法界尽不尽。涅槃界尽不尽。佛出世界尽不尽。如来智界尽不尽。心所缘界尽不尽。佛境界智入界尽不尽。世间转法转智转界尽不尽。我此诸愿善根亦不可尽。此段经文一一解释。出十地论。如理应思。二言结劝者。经曰是故诸苾芻菩萨摩訶萨尽形寿不顾身命而此四法不应远离。此段文句。如上所说。明广文竟次当第二明略文。复分為二。一明因。二明果。初言因者。如经时薄伽梵说是语已。至有智<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>于空闲后言明果者。如经若诸智者住此法。降伏诸魔。成等觉。两段文句。上广文中已中述故。故不释也。明正宗竟大门第三<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分者。复分為三。初标佛化毕。如经尔时薄伽梵说是经已也。次明眾同闻法。如经诸苾芻眾及诸菩萨摩訶萨也。后钦受导奉。如经一切大眾闻佛所说信受奉行也。智度论云。如是我闻者。令生信也。信受奉行。為生智也。由佛所说有三净胜故。使闻者欢喜奉行。一说者清净。以于诸法得自在故。二所说清净。明如实智清净法体故。三得果清净。已离诸障成<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>故。佛正為说无不信垢领纳在心。敬顺修学。由斯故说信受奉行</p><p>大乘四法经论广释开决记</p></div>"
}]