[{
    "title": "大乘入道次第开决 第2823部",
    "author": "昙旷大师",
    "html": "<div class=\"B1_text\"><p>大乘入道次第开决</p><p>京西明道场<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>曇旷撰</p><p>夫登峻宇者必先拾级。陟层楼者咸歷阶墀。况乎觉道崇高不凭行位。真源绵敻岂越资粮。是以时积三祇行周四等。坚精<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>炳焕二心。乃获圆常方登极果。未可朝闻其道夕希德满。譬乎纔艤方舟即期越海。<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>菩萨非此无谁。故欲远剋<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>必行大道。入道次第繫赖瓢明。虽事具群经然詎能圆揽。不有编录其可覿乎。大唐开元初有朴阳大德身号智周。我大唐<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>曾孙<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。慈恩大师之孙弟子。河南法师之亲弟子。即是青龙大师异方同学。内穷三藏外达九流。為学者师宗作词场雄伯。工手著述妙手讚扬。所撰章钞凡十数部。即法花摄释<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>諠祕因明决择皆所造也。虽不至长安而声闻遐被关辅诸德咸仰高风。然观其述作文约义著。究其所志既慈具悲实。谓间生英贤传法菩萨者也。恐初学者望法海而忙然。瞻义山而永退。遂乃纂大教之枢要。举法网之大纲。爰示方隅撰兹义记。然入道次第通乎三乘。唯我大乘方称至极。今明最胜究竟大乘。故言大乘入道次第言大乘者。总而言之不过四种。谓如常说教理行果。皆广包故名之為大。并能运故称之為乘。此义具如起信义释所言道者。趣向為义。游履為义。通运為义。亦即不离教理行果。随应而有趣向游履通运义。故皆名為道。下文皆有应寻引之入次第者。总即五位。别以四十二贤圣也。于此四种大乘之道。从浅向深从分向满。依大乘教悟大乘理。起大眾行得大乘果。故依大乘五位之中渐次悟入道次第也。故唯识论第九卷云。谓具大乘二种姓者。略于五位渐次悟入。若尔应无超越之义。寧说释迦超<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>等。答。超时可尔。超位不然。以于位位皆有所修所断所证不可越故。如行迟疾时夕虽殊。而于里步不可越故。若尔何故<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>说一地即十地等无所有。何次耶。答。彼约所证<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>道理。此依证位行布道理。彼以初证与后体同。就所证理言无有等。若依证智行位不同。是故得有五位次第。故与彼说亦不相违</p><p>稽首等者。以下释文大分三段。初三行颂致敬述意分。夫欲已下正諫所说分。最后一颂结说迴向分。初分之中又分為二。前之二颂归敬<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。后一行颂述製作意。前中又二。初之二字是能乘相。其无上等是所敬德。言稽首者。稽者屈也。首者头也。屈所尊之头礼所卑之足。显敬之极故言稽首。无上等者。显所乘相。于中有三。谓<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧。前之四句显其佛宝。上之两句显佛二利之因行也。后之两句明佛二利之果德也。前复有二。此句则显自利因行。调谓调和。御谓制御。调和制御身语意业。离恶进善成自利行</p><p>能拔<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>苦沈溺者。此句则显利他因行。自既调御。复以调善大乘御车。于生死泥拔出沈溺苦眾生也。以调御声。具此二义故。以二义而释调御。于调御中更无过比故名无上善调御也</p><p>如空性相无去来者。此下二句显佛二利之果德也。此句显佛自利之果。由行自利感得法报二身极果。皆悉<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>无有去来。故言如空无去来等</p><p>若影随形应所化者。此句显佛利他德果。由利他德从法报身而起应化化诸凡圣。如影随形而得起也又应所化如影随形不捨离也以此句中含二义故。是故亦以二义释也</p><p>实相一味妙<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>等者。此之二句显法宝也。上句显其真如理法。下句显其所流教法。而言一味甘露等者。依<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>而作此说。故彼经云。雪山之中有上妙药。其名甘露。人若服者得寿无量。本唯一味。随其流处生种种味。而其真味停留在山。一味甘露喻实相如。随流诸味喻诸教法。随诸眾生种种根性。以彼真如种种门说。而本真如竟无改易</p><p>三贤永截爱流等者。此后二句显僧宝也。初句显其地前凡僧。不同外凡顺生死流。今截爱河欲超渡也。后句显其地上圣僧。一证不退名曰长驱。无漏圣道故名正路。者谓假者即僧人也</p><p>故我等者。此则后显述申敬意。前之二句述归敬意。后之二句述製作意。第三句意显以法灯常照生死久处愚闇诸眾生也。第四句意永去眾生<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>所覆重昏之闇</p><p>列别名者等。此中列名依旧花严。故与新经时有不同。待至释文一一对会</p><p>菩萨在此创安其心等者。谓创安住空<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>理得住佛家故名安住。故释经中名為十解。解空理故。故本业云。心住空理。名之為住。花严经云。诸菩萨住不可思议。与法界<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>等。是故得住三世佛家。虽解空理名之為解。而未即能依解起于无住妙行。名行未胜</p><p>净治三业等者。譬如大地生长一切<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>草木。若治其地即生善草。眾生三业能生善恶。故喻于地。治三业地离诸过恶生长善行。故能起悲利有识也</p><p>修胜理观等者。观一切法<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>苦空无我等故名胜理观。起此观行名上妙行。非谓依观别起妙行</p><p>所修善根等者。由救物故自得增长。名為方便具足义也。如外典云。夫欲达己先达人等</p><p>所闻讚毁心定不动。谓闻讚毁佛法菩萨。菩萨所行其心安住。名正心住</p><p>闻说三宝三际等者。谓闻三宝有之与无。又闻三世有佛无佛。其心不转名不退住</p><p>三业清洁悟二等者。三业清洁故名為童。谓如童子身语意行皆无咎故。悟二<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>故亦為真。了眾生器悉皆虚假。心无碍故</p><p>解真俗諦悟法王等者。谓善了知说真俗諦。名解真俗。悟法王处轨度法王处宫殿等。名悟法王法</p><p>如王太子堪受王位行渐胜者。所谓振动照曜住持往诣。严净无数世界。开示观察知根。调伏无数眾生。此等诸行胜过于前。渐能增上一切种智。名行渐胜</p><p>此位菩萨行六度等者。同三世佛悟空寂理。而能起彼无住妙行名诸行胜。故花严云。此菩萨行不可思议。与法界虚空等。学三世佛而<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>故。名之為行</p><p>愍生慕法者。但為救护摄受<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>一切眾生。名為愍生。為学忆念爱乐清净增长住持宣说诸佛本所修行。名為慕法</p><p>睹者<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>等者。花严经云。修此行时。令一切眾生欢喜爱乐。若见一切来求索者。菩萨见之倍生欢喜。由此二行名欢喜行</p><p>无恚<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。新经名為无违逆行。若有瞋恚即是违逆忍波罗蜜。违逆诸佛所说空法。违逆摄受一切眾生。若无恚者则不违逆。亦异义一不相乖也</p><p>无尽行者。新经名為无屈挠行。屈者即是退转之义。挠者乃是怯弱之义。故由胜<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>无退弱故所行不息。故此彼亦不相违也</p><p>尊重行者。新花严经名难得行。谓能成就难得善根。即由难得故成尊重。既得难得尊重善根。二利之行更增进也</p><p>四无碍诸陀罗尼门等者。此四无碍诸陀罗尼门既以念慧而為体性。是故即名诸善慧法。能除眾生诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>热。如入池浴而得清凉。是故喻彼清凉池也。然此所行四无碍等。但相似得非真满得。真在地上。满第九地。故此但是相似得耳。四无碍等义如下说。此无繁举</p><p>凡所修行悉皆迴向者。迴向实际。迴向菩提。向迴眾生。以此三种摄于一切。是故名為悉皆迴向</p><p>不著生死不离菩提者。不离菩提即是不住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之义。若住涅槃即离菩提。故唯识论释无餘依涅槃文中。离相湛然寂灭安乐。依斯说彼与佛无差。但无菩提利乐他用。故复说彼与佛有异</p><p>令此善根<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>等者。谓至一切三宝之所作诸<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。至于一切眾生之所為利益事</p><p>修悔过善根离一切<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>者。若准经文。此语倒也。若正应言。悔过懺除一切业障所生善根</p><p>所有善根悉皆<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>者。此中文略。此前应有<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>劝请所生善根。于随喜中语又不足。致令读者皆有谬解。若具应言。于诸如来一切眾生所有善根。皆生随喜所生善根</p><p>以此善根悉皆迴向者。以此懺悔礼拜励请随喜所有善劝根皆迴向也</p><p>常作佛事善巧方便者。即作佛事為巧方便。故花严云。善巧方便常作佛事。佛事即是放<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>明普照世界无有限极</p><p>具诸功德离诸虚妄等者。此中语倒。应先离妄后方具德。故花严云。此菩萨了一切眾生。无眾生解一切法无<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>等。由了此故能离虚妄。心无所著故念念中得不可说十力善地具足。一切功德成就清净善根。所须乐具一切皆种。色相无比。威力光明超诸世间。乃至能得十种无尽藏功德</p><p>坚固安住<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>功德者。若准经文此语亦倒。若正应言安住自在坚固功德。谓此菩萨為转轮王名為安住自在功德。获那罗延不可坏身名為安住坚固功德</p><p>以如是等诸善等者。谓以如前内外物施所有功德及以自在坚固功德而迴向也</p><p>而能增长一切等者。谓能增长一切善者。由修习时究竟安住堪忍也。此中唯举修行一种。花严经中则有数义。谓于一切诸善根所修行安住趣入摄受积集办具悟解开示发起之时堪忍力</p><p>拔出眾生者。于虚妄道拔出眾生令其安住一切善道</p><p>成就念智者。住<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>故其心明了深心不动。成就智故趣一切智终不退转</p><p>所修诸善皆顺如相者。譬如真如是真实性。诸佛行处无能测量。得者无退乃至广说。善根迴向皆亦如是</p><p>离憍慢等缚著等者。谓此菩萨所起一切诸善根时。皆从尊重珍敬心起。名离憍慢。不见我行他人不行而生轻贱。故置等言。谓自能行即名為缚。谓他不行乃名為著。既离憍等所有缚著。名<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>心也</p><p>迴向饶益品物一切者。品物一切其言倒也。应言饶益一切品物。谓即一切诸品物类也</p><p>行普贤行者。所习诸善不执為己及以他人。观一切法悉皆平等无非贤善。是则名為普贤之行。令此菩萨三业皆然。是则名為行普贤行</p><p>离垢繒繫顶者。谓如西方绍高位者。皆以鲜繒而繫其顶。今此菩萨行法施行。以清净法而标其首。故离垢繒而繫顶也。故花严云。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>此菩萨以法施為首。后生一切清净白法。即是净繒繫顶义也</p><p>受大法师记者。谓此菩萨行法施故。便受诸佛记是法师。此即受记见是法师。非受当记為法师也。故花严云住法师位</p><p>此位初首而有等者。前之五种下诸文中数频解释。但释后五于身命财常作捨相。名為捨心。常持菩萨<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>。名為戒心。能于恶世传法不绝。名<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>心。所修善根愿共眾生。名為愿心。咸起诸行咸向菩提。名迴向心。决定信位所得心故。名十<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a></p><p>以初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>而甚等者。初<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>甚难可发。若不广陈行相难见。故于初住离出十信令解进趣。菩提之心总别双举四十心矣</p><p>择简于见见不择者。统论见者有其二种。一推求义。即未见諦诸有漏智。二照理义。即已见諦诸无漏智。今所简者即依前说。以无漏见而能择故</p><p>加行无间此智等者。谓前剎那是加行道。即后剎那是通达是。前加行灭通达智生。是故名為加行。无间谓要前灭后念方生。不与后念而為隔碍。故前念灭名為无间。或前念灭后念即生。无别念隔名无间也。虽有二义前解為胜</p><p>一真见道体离等者。此释真见有其二义。前解真者即是实义。以此智见有实用故。此见即真名真见道。持业释也。后解即约理智不同。真之见故名為真见。依主释也</p><p>為断餘障<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>转依等者。餘障即是俱生障也。是分别障之餘障故。转依义别有其四种。一能转道。此复有二。一能伏道。為伏二障随眠势力令不引起。二障现行。此通有漏无漏二道。加行根本后得三智。随其所应能渐顿伏。二能断道。谓能永断二障随眠。此道定非有漏加行。有漏曾习相执所引未泯相故。加行趣求所证所引未成辨故。二所转依。此复有二。一持种依。谓本识由此能持染净法种。与染净法俱為所依。圣道转令捨染得净。二迷悟依。谓真如由此能作迷悟根本。诸染净法依之得生。圣道转令捨染得净。三所转捨。此复有二。一所断捨。谓二障种。真无间道现在前时。障治相违彼便断灭永不成就。说之為捨。二所弃捨。谓餘有漏劣无漏种。金刚喻定现在前时。所引圆明纯净本识非彼依故皆永弃捨。四所转得。此复有二。一所显得。谓大涅槃。此虽本来<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净。而由客障覆令不显。真圣道生断彼障故。令其相显。名得涅槃。此依真如离障施设。故体即是清净法界。二所生得。谓大菩提。此虽本来有能生种。由所知障碍故不生。真圣道生断彼障故令从种起。名得菩提。起已相续穷未来际。此即四智相应心品。此文所言為断餘障即属第三。证得转依即属第四</p><p>复数修习无分别智。即第一中能断道也</p><p>此修习位能為依持等者。然修习位即以有為能证正智。及以无為所证真理而為其体。此真及智与所修行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>等行。一為依持。二令生长。犹如大地与一切物為所依持令得生长。故法从喻得地名也</p><p>由得胜定及殊妙教等者。胜定即是等持等至。妙教即是法大乘教。四种总持法义咒忍。法谓名等能詮之法。义為所詮差别之义。咒谓祕密文字章句。忍谓菩萨离言法智。此四是境体非总持。由念慧力未闻法义闻之便记长时不妄。故以念慧為法义二陀罗尼也。谓由等持自在力故。加被诸咒所有章句令成神验除诸灾患。故以等持等至為咒陀罗尼。由妙智力了智咒等皆无自性。达一切法离言法性。故以<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>妙智為忍陀罗尼。此胜定教及四总持。即是三地所得功德</p><p>以此為因能起三慧者。由因定故能发<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。因殊妙教发闻思慧。复因总持离妄失障。令心明达于所缘境。故為三慧总别因也瑜伽等云观察诸行者。诸行即是<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>。以<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>故名為诸行</p><p>七地菩萨唯修无相不起功用者。观此所说应是笔误。不尔便与八地何别。又违唯识及摄论等。唯识论云。前之五地有相观多无相观少。于第六地有相观少无相观多。至第七地纯无相观。虽恒相续犹有加行。摄大乘云。谓此地中于功用行得至究竟。虽一切相不能动摇。而于无相犹名有行。准此等文。故知未绝功用之行</p><p>然瑜伽云能远证入无缺无间无相作意者。非缺间言显功用义。无缺无间意说常在无相观中。何妨常起作意住也</p><p>无相之行逾于等者。前三地行施戒定相同世间。次之三地得增上慧相同二乘。今至无相功用后边。已过世间及二乘道。能于定中起有胜行。是故此地名远行地也</p><p>不被一切有相等者。即约三义释不动名。功用即是加行异名。前第七地虽亦无相及无烦恼。而有加行行动相不动。未得名不动。今至第八地相行俱不动。故与第七有差别也</p><p><a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>自在获得等者。以前诸地无碍智于说法时则有过失。今得无碍说法自在既无过失故名无罪</p><p>而有胜智能含等者。摄大乘云。由得总缘一切法智。总缘一切契经等法不离真如。此一切法共相境智。譬如大云陀罗尼门。三摩地门犹如清水。智能藏彼如云含水。有能生彼胜功能故名法云也</p><p>资粮加行剋性等者。谓若相从亦有信等。今据剋性唯取智体。如言现观乃是智名。而即说有信戒思等。相助等故皆名现观。故约相从非唯是慧。今此亦尔。故言剋性。其见道等皆准此智</p><p>谓即三性三无性等者。等即等取二諦有空。三世<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>多种差别皆智境也</p><p>自性即是我法等性者。等即等取但随言说依假名言所立性者。即如龟毛兔角空花毛轮二月皆此所等</p><p>一切有漏心及等者。谓心起时而有见境变境功能。所起见望别境相便熏成种。所变境相当情而现亦熏成种。后心起时从种变起见相二分。后心既尔。前心亦然。种子為因现行為果。现行為因种子為果。如是展转从无始成有见相分种现相生。既从因生故依他摄</p><p>遍计依斯妄执等者。谓萨婆多执识及境皆别实有。清辨所执依胜义諦识境俱无。如数论执彼有法与有性一异。如胜论执彼有法与有性异俱者有二亦有亦无。如清辨执世俗胜义有空相即亦一亦异。如无惭等执一法上一异体同不俱有二非有非无。亦即清辨翻第三句双遮有无非一非异。如邪命等避一异俱过双说非一异。此总意云。相见二分实从因生。是依他性。依此二分妄执定实有无四句一异四句。二相方名遍计所执。非谓缘生相见二分亦名遍计所执性也</p><p>成即成就非生灭义者。以非生灭释成就义。行相难见今应广释。然此真如名圆成者。由具三义简三种法。故唯识论第八卷云。显此遍常体非虚谬。简自共相虚空我等。一者周遍。此简自相。色等诸法各守自相既不周遍故非<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。二者常住。此简共相。苦无常等虽有遍义。不成常住故非成就。三非虚谬。此简妄执虚空我等虽说遍常。是妄所执故非真实。于中第二空无我等生灭共相不成常义。既非生灭成就常义。故不生灭释常义也</p><p>究竟能断烦恼染法成就此能者。谓诸无漏究竟能断烦恼染法。而成就此缘功能也</p><p>有為总摄一切等者。如中边云。圆成实性总有二种。无為有為有差别故。无為总摄真如涅槃。无变异故名圆成实。有為总摄一切圣道。于境无倒亦圆成实。一切圣道谓三乘者所有圣智。皆于证境无颠倒故</p><p>何故瑜伽但以等者。言五法者。相名分别正智如如。若准唯识瑜伽本文。皆云真如。若依楞伽金光明经。即云如如。释此五法诸教不同。是故唯识数般解释。今者且依瑜伽释云。心似所詮说名為相。似能詮现施设為名。以能变心名為分别。无漏心等名為正智。心等实性名曰真如。前二缘生依他起摄。第五真性圆成实收。遍计所执不摄五事。既说正智而属依他。唯说真如圆成实摄。寧言无漏亦成实耶</p><p>漏无漏门但是等者。所言漏者染污漏泄连注流散不绝之义。故旧经论译為有流。然释此漏有其二种。一者性漏。此有三种。一者欲漏。二者有漏。三无明漏。杂集第七释此义之。依外门流注故名欲漏。依内门流注故立有漏。依彼二所依门流注故立无明漏。谓诸现惑令心连注流散不绝是漏义故。若俱舍等诸论所说。有身见等诸烦恼中立漏名相。自体令他心心所等染漏泄故。故以一切现行烦恼為漏自性。二者有漏。此為五种。一五色根。二五尘境。三恶心品。四<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>品。五无记心。此等皆与自身现惑俱时相资境故名有漏。故唯识论第五卷云。然诸有漏由与自身现行烦恼俱生俱灭互相增益方成有漏。自身烦恼即简他身。要自烦恼成自有漏。非由他惑成有漏故。现行烦恼即简惑种。有学圣者虽惑种随。而诸圣道不成漏故。俱生俱灭简色未惑。非前后惑能成现漏。已成未生不俱有故。互相增益简无漏种。虽与五法俱生俱灭。不相资益性相坏故。由此返显自身所有现行烦恼与前五法俱生俱灭。其性同故。互相资益方成有漏。此则五法非本性漏。有彼漏故名為有漏。此能熏成有漏法种。种复能生有漏现行。故无始来有漏成立。若尔世间信等善品应非有漏。无现惑故。答。虽<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>中现惑不起。而末那识诸识常生。此与诸识既非定异。能污信等亦成有漏。若尔末那初地转时。则五<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>亦成无漏。答。虽第七识无现行漏。而有漏种。亦令五八耶识成漏。若尔亦由随眠成漏。如何前说简种子耶。答。前正简者但当识种。今末那种故不应例。此唯识中约剋体说。但取末那為有漏依。若依瑜伽及杂集论。通约诸义辨有漏因。故彼文云。谓由事故。随眠故。相应故。所缘故。生起故。所言事者。即前五体皆漏随眠所随逐故。若三性心漏相应故。若五尘境漏所缘故。若五色根漏所生故。故五体事皆成有漏。言无漏者与前相违。谓由永断漏自性故。内证真理发生圣智及智所起皆名无漏。此无漏体亦有五种。即五<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。无漏体故。无漏性故。无漏起故。无漏伴故。无漏境故。虽有五种总摄為二。五种不离有无為故。故<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>本颂说云。无漏谓道体及三种无為等</p><p>清净增上力等者。清净力者。谓善根力以能降伏所除障故。增上力者。谓大愿力常作善友增进道故。坚固心者。由善根力大菩提心坚固不退。心昇进者。由大愿力修善之心运运增长。此依摄论二释文说。而本释中谬以善根為增上力。智者详之</p><p>名菩萨初心三无数大劫者。然劫不同有其四种。故俱舍论本颂说云。应知有四劫。谓坏成中大。坏从狱不生。至外器都尽。成劫从风起。至<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>初生。中劫从无量。减至寿唯十。次增减十八。后增至八万。如是成已住。名中二十劫。成坏坏已空。时皆等住劫。八十中大劫。大劫三无数。菩萨发此二心之时。即名创入三无数劫之初心也</p><p>眾生成就十六种法等者。未见本义且随愚释。心达本性名之為上。根不染境故因莹磨。因行无替名勤修善。果德剋备名曰<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。止恶而喜故不生悔。集善而欣故无所厌。学观同体名修大悲。常行拔济故云怜愍。<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>普救名大慈悲。以己方他故名信。有行非自利名為诸。难作能作名受行苦。身心逼迫名有苦恼。令永无餘故名破坏。身不起恶名调诸根。心顺真理名具<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。不欣涅槃名心<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。不乐生死名不求有。常行大道名求佛智。不视小逕故远二乘。于乐不憍故云不慢。于苦无恶谓之无悔。崇重贤善惭名恭敬。轻拒憍慢愧名破坏。荷佛慈诲名曰知恩。感而奉行称报恩矣。于善堪能名身有力。荣而无退名為具足。契理真宗谓之<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。自行化彼名曰护持。重佛法僧种為三宝。讚誉光显名不断焉</p><p>于菩萨藏等者。即大乘教名菩萨藏。藏者摄也。大乘教中能摄菩萨理行果义。摄益菩萨名菩萨藏。菩萨藏中说深妙法。既闻法已生悟解心。知说法者有大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。于深大智而生爱乐。為得妙智故发心也</p><p>十随烦恼所恼乱者。谓十烦恼随逐眾生常起不息故得随名。非根本后之随烦恼。故杂集云。又贪嗔痴名随烦恼。随恼于心。令不离染。令不断障。令不解脱。名随烦恼</p><p>菩萨种姓得具足者。种姓有二。一本种姓。无始时来法尔有故。二习种姓。后闻法已新熏起故。自有本种未闻正法无新熏种有。虽闻法新熏法种。无本住种。随闕一种名不具足。以瑜伽论及唯识宗许有一分无姓有情故。虽新熏种有闕本种者。若具二种能发心也</p><p>谓欲从诸不善等者。善不善处通因及果。且因相者。如作诸非法名不善处。令捨恶从善名置善处。言果相者。从三恶道不善之处。置人天道善果之处。惑但行因即必感果。但约因说善不善处</p><p>恒正思惟一切相智者。准大般若说三种智。谓一切智。道相智。一切相智。检文未获。且作一释。谓二乘智名為一切。一切<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>共所得故。其菩萨智名為道相。具证二空真道体故。说<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>智名一切相。圆证一切境界相故。此既果德圆满之智。故正思惟一切相智。更有别义。智者叙之</p><p>得倍轮王护所等者。然其轮王总有四种。皆有七宝四兵卫护。故俱舍论本颂义云。轮王八万上。金银铜铁轮。一二三四洲。逆次独如佛。他迎自往伏。挣陈胜无害。相不正圆明。故与佛非等。既一切时无有损害。发心菩萨所得守护。倍胜轮王所有守护</p><p>胜故无尽故等者。谓显大乘超餘二乘。故以初句标显二义。欲显初句胜无尽义。故以后句而重释之。由能摄益他诸有情。是故大乘名為最胜。由虽涅槃利他不息。是故大乘复名无尽</p><p>三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>者。俱舍颂云。四大洲日月。苏迷卢欲天。梵世各一千。名一小千界。此小千千倍。说名一中千。此千倍大千。皆同一成坏</p><p>初渐起时者。此三千界初渐起时。如俱舍论第十一二及显宗论第十六七颂及长行广释其相。今恐文繁但举其颂。就中更以取要而言。欲令学者易知解故。安立器世间。风轮最居下。其量广无数。厚十六洛叉。次上水轮深。十一亿二万。下八洛叉水。餘凝结成金。此水金轮广。径十二洛叉。三千四百半。周围此三倍于此金轮上。乃有九大山。苏迷卢处中。餘八而围绕。于大洲等外。有铁轮围山。前七金所成。苏迷卢四宝。入水皆八万。妙高出亦然。餘八半半下。广皆等高量。山间有八海。前七名為内。最初广八万。四边各三倍。餘六半半狭。第八名為外。三洛叉二万。四千二百餘。于中大洲相。南赡部如车。三边各二千。南边有三半。东毘提訶洲。其相如半月。三边如赡部。东边三百半。西瞿陀尼洲。其相如满月。径二千五百。周围山三倍。北俱卢畟方。面各二千等。中洲复有八。四洲边各二。此下过二万。无间深广同。上七捺落迦。八增皆十六。谓煻煨尸粪。锋刃烈河增。各住彼四方。餘八寒地狱。日月迷卢半。五十一五十。夜半日没中。日出四洲等。雨际第二月。后九夜渐增。寒第四亦然。夜减昼翻此。昼夜增腊缚。行南北路时。近日自影覆。故见月轮缺。妙高层有四。相去各十千。傍出十六千。八四二千量。坚手及持鬘。恒憍大王眾。如次居四级。亦住餘七山。妙高顶八万。三十三天居。四角有四峰。金刚手所住。中宫名善见。周万踰缮那。高一半金城。杂饰地柔软。中有殊胜殿。周千踰缮那。外四苑庄严。眾车麤杂喜。妙地居四方。相去各二千。东北圆生树。西南善法堂。此上有色天。住持空宫殿。如彼去下量。去上数亦然。离通力依他。下无昇见上。更有文义恐繁不录。此等皆是渐起相也</p><p>当知便為二十五有等者。二十五有而作颂曰。四洲四恶趣。六欲大梵天。无想及净居。四禪四空处。是二十五有。随开合应知。问。如三灾起不及四禪。修渐成住岂能荷负。况能荷负<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>耶。答。以若无下欲色二界。谁修彼定生彼天中。故约展转亦能荷负</p><p>愿者所习等者。愿是菩萨本所修行。故十度中而有愿度。誓即是愿讚助之缘。以誓助愿愿方成故。或由愿乐方能修行。故愿即是行之本矣。后以誓助行得增长。故誓于行為助缘矣</p><p>发心菩萨住乾慧地者。即十住位慧多定少。慧少定水名之乾慧</p><p>了第一义得正法智者。正法智者即正体智。法者即是自体之义</p><p>行一切种菩萨正行者。即行一切种种菩萨所行之也</p><p>无倒加行皆不唐捐者。所修六度名曰加行。行不求报即名无倒。行无倒行皆于佛果為胜因力无虚弃也</p><p>一能坚固其心者。由立誓故恐有违犯招现当恶。故<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>心得坚固也</p><p>能破五盖者。一贪欲盖。二嗔恚盖。三惛沈睡眠盖。四掉举恶作盖。五者疑盖。覆蔽其心不得显了。障诸善品令其不转。故此五种而立盖名。由誓持心除此五种。是故名為破五盖也。遮放逸等准而说之</p><p>观一切法如真实等者。一切法谓善不善等。称真实性皆无二相。顺真实性起于观智。观不善等不起二见。初起观智名之為受。后无间妄故谓之持。故言随顺<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>等也</p><p>若我慳吝心悔等者。我则欺狂十方等文。两处用之。谓我慳吝乃至起于二见相者。便不能起<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。我即欺狂十方佛也。设我能修六波罗蜜。若以施戒忍进禪智求净报者。我亦欺狂十方佛也</p><p>即是趣向一切智门等者。如无门户路拥莫通。无善知识不入真道。故善智识是趣智门</p><p>趣向一切智炬等者。如因执炬光发十方。赖善知识智分十力。故善知识為智炬也</p><p>趣向一切智潮等者。如因潮泛枯涸水盈。蒙善友摄受慈波演溢。故善知识為智海潮</p><p>于善知识生同己心等者。精勤修行辨一切智。是我己事。由善知识而能得之。故善知识无异己也</p><p>生清净自业果心等者。谓即是我清净业果。如须果实必植根灾。与我成根故是我果</p><p>普贤菩萨所有行愿者。我发心时一切眾生同我发心。我修行时同我修行。我成正觉等成正觉。心愿既尔。智见亦然。不见一人不发心者。不行行者不<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>者。即是名為行普贤行也</p><p>于善知识生福智海心等者。谓善知识是我福德智慧之海。如诸珍宝积集海中。一切白法集福智海。既由因善根诸愿方满。既能令我积集白法。故与我作福智海也</p><p>生具一切善根等者。由因善根诸愿方满。既善知识令我愿满。故知具足诸善根也</p><p>天地别乎行潦者。天地即是大海异名。如言南溟北溟浡懈等。行潦乃是流水名也。以水流处小而且浅。与海异也</p><p>及福智二十波罗蜜者。谓显十度皆有福德智慧二性。此义即约前引于后。后净前说以约别相。前五福德后五智慧。若约引净通相而说。皆具福知</p><p>即如来等尽无生智等者。等即等阿罗汉辟支。唯无学位所得智故。尽无生者即是尽智无生智也。释此二智通别不同。若依俱舍通约四諦。谓此是苦集灭道我尽知断证修。所得后智名為尽智。复于四諦起如是相。谓我已知断证修更不知断证修。所起后智名无生智。若依杂集。别依苦集因尽所得智名為尽智。谓此位中永断集因令无有餘。所得之智名為尽故。果断所得智名為无生智。由因尽故当来苦果必竟不生。所境之智名无生故。皆能照境穷其根源。故此二智名為觉也</p><p>集起名心者。若随相增属第八识。集诸法种起诸法故。通而言之亦在七识。采集诸业起诸种故。故所积集而為心义</p><p>轨持称法者。轨為轨则是法则义。持谓任持是法体义。具此二义故名為法</p><p>足者彼因体即缘定等者。如对法论第十卷云。神足自体者。谓三摩地。由已成满三摩地力。发起种种神变等事</p><p>此四非足足之因也者。即杂集论又作是说。神足助伴者。谓欲勤心观。由欲引心起猛利爱方便证触心一境性。由勤励心于初中后长时证触心一境性。由定持心于内寂静速能证触心一境性。由观策心得定依法练心速证心一境性。故此四种為神足因。若尔四中心非是定。不可定与定為因故。答。虽俱是定。初后有别。神足定者心一境性。即三摩地已来满位。心之定者持心為义。即是心一境性加行。故為定因理无失也</p><p>能深忍乐清净等者。忍谓忍可。即是信因。由因忍可方生信故。乐谓乐欲。即是信果。由因有信方乐欲故。性自证清能净心等。如水清珠能清浊水。故清净性名之為信</p><p>念支觉法所依止者。由依繫念令诸善法皆不妄失有觉智故</p><p>精进是觉出离支故者。谓由精进增胜势力能令觉智到所到故</p><p>喜是觉法利益支者。由此势力令身调适喜乐发生胜觉智故</p><p>是以自体及餘等者。犹如四智般若义等。其中虽有非是智者。相从义故亦名智等。当知此中道理亦尔</p><p>麤重為因能生诸染者。麤重有二。一二障种。故唯识论云。二障种子立麤重名。性无堪任违细轻故。二谓障种。所引身中无堪任性。与<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>法不一不异。而离五蕴无别自性。若无此者身必细轻。违细轻故亦名麤重。故唯识云。或二所起无堪任性。今于此中说后非前。有麤重故能生过染。故瑜伽云。有过患义是麤性义。过患增多性故名為麤。不安稳性以為麤重性。是故麤重能生染也</p><p>轻安近能治此等者。有轻安故便离麤重。离麤重故于善堪能。堪任善故不生诸染。故轻安是无染因也</p><p>由依定故方能离染等者。谓要依定方发轻安而离诸染。故说定是离染依也</p><p>捨除障法等者。由捨远离沈掉爱忧。不染污位為自性故</p><p>无漏身语离五邪求者。观诸星像。耕垦营农。通致使命。合和汤药。占相吉凶。以此五种邪求活命。如次名為仰口.下口.方口.维口开口食也</p><p>以自相续身等為境者。自相续者即谓自体。若言自身则不通心等。故以相续言显总包也。言身等者。谓即等取受心法也。观自身境以修不净对治之观。观自受境以修非乐对治之行。餘二准知</p><p>以无常等行相思惟等者。谓即等取非乐非我非净三种。行相即是见解义也</p><p>以无所得行相思惟等者。谓观自他身无身相。而不见有净与不净。而修对治身<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>也。受及心法亦如是说</p><p>于现法中得身等者。谓修行时于现生中远离一切烦恼麤重。便得自身适悦乐也。现法即是现生义故</p><p>常乐宣说可意等者。等即等取諦语法语引义利语。诸如是等一切爱语略有三种</p><p>命进问安者。瑜伽论中先明问安后方命进。故彼文云。或问安稳吉祥。或问诸界调适。或问昼夜怡乐。或命前进善来。据实道理先合命进后方问安。瑜伽及乃据西方语故</p><p>圆满殊胜微妙法教者。瑜伽但有圆满法教。此中更加殊胜微妙。依于上下别文而说。字义具足故名圆满。令得出离故言殊胜。能契真理故谓微妙。此则通谓三乘教也</p><p>但化彼行何假身同等者。此问意者。菩萨所化通乎三乘。但可说法化二乘人。岂要同行二乘行也。不尔便是和光同尘。便与涅槃经文违背。答之意云。菩萨為化他令行故。纵二乘行亦须示行。自嫌不行人不学故。故法花云。内祕菩萨行外现是声闻。虽少欲知足而实净佛道。涅槃但和其光而不同尘。此义故不乖于理也</p><p>若于是义于是等者。义谓境义即是起行。所依道理境界之处。如修<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>之行。必有所依佛功德境。故境即是起行之处。善根乃是所起之行</p><p>能离不善防护受持等者。能离不善谓即是戒。此能防护诸恶不善。于此防护诸恶不善。净戒法中常受持也。七眾谓即近圆男近圆女正学眾求寂女近事男近事女。若兼近住即為八眾。以非常时但日夜戒。是故经论但言七眾</p><p>一切佛法為摄善法戒者。谓正修习力无畏等一切佛法但是所修所<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>法皆此摄也</p><p>若修诸行发起勇捍者。唯识论云。勇表胜进简诸染法。捍表精淳简净无记。即显精进唯善性摄</p><p>而能安住现法等者。若欲安住现身轻安调畅之乐而所入者。此即名為安住静虑。若欲引发六<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>故而所入者。此即名為引发静虑。若欲成辨利有情事而所入者。如是即名辨事静虑</p><p>波罗蜜多相违事者。谓与六度所相违法。于喜乐欲<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>自在深见功德及与胜利。当知即是施相违事。于随所乐纵身口意见功德利。是戒相违。于他轻蔑不堪忍中见功德利。是忍相违。于不勤修著欲乐中见功德利。是进相违。于处憒陋世杂乱行见功德利。是定相违。于见闻觉知诸言说戏论见功德利。是慧相违</p><p>波罗蜜多果异熟者。即是六度所得<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。如下胜德果利中说。此通因中所得果报。是故名為诸果异熟。若在果位是无漏善。则不得称為异熟故。此义如下菩提中说</p><p>无间杂染法等者。深密经云。何等名為间杂染法。略有四种。一无悲加行故。谓行行时于诸有情无拔济心。二不如理加行故。谓若修一波罗蜜时于餘失坏。三不常加行故。谓于所修波罗蜜中多有间断。四不慇重加行故。谓修行时于前境界心生轻慢。离此四种。是名无间杂染法也。云何名為非方便行。谓但财施与生安乐。不行法施成胜利益。所以然者。非但与财名实饶益。唯处善法乃真益故。若离此事。是则名离非方便行</p><p>能裂慳吝贫穷等者。能裂现在慳吝之纲。引得广大福德资粮。能裂当来贫穷苦纲。引得广大财宝胜位</p><p>能息灭恶戒等者。息灭现在所有恶戒引得等持。息灭当来诸险恶趣引得善趣</p><p>能息灭忿怒等者。息灭现在所有忿怒。息灭当来所有怨讎。引得现当善住自在</p><p>能除遣一切见趣等者。言见趣者即五见也。见趣即是诸邪恶慧。既能除遣虚妄见趣。故于品类诸别异法。随其所知悉得真实</p><p>谓要行一切事业者。且如行施。于内外事一切种类皆能善捨。若持戒时。于遮性等诸戒种类悉能修持。忍辱等四准此应知</p><p>况当能得一切智智者。一切智者即正体智。复言智者即后得智。或是一切智人之智。是故得名一切智智</p><p>清净相者当知七种等者。第一不求令他知我是能修行六度行者。第四不于不行六度放逸之人毁而轻蔑。第五不于自所修行恃。而高举于防修事而生逸荡。第七不于能行之人嫉其所行慳所解法不相劝示</p><p>成就八法能净檀等者。不為自利而行名离為我。不求生死染报名离爱结。了施性空而无著名离无明。不背性而求觉名离彼我菩提相。不见<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>非田等名离种种相见。不求报恩供养名离怖望。自行化他名曰离慳。他施而喜故言离嫉。其心平等犹若虚空不见彼此。即是能净真实智也</p><p>成就八法能净尸罗等者。菩提心者即三聚戒。忘菩提心即失净戒。求二乘地异求小果亦非护戒。取著于境障碍净心即失净戒。恃戒陵人是真<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。不捨慈悲名不捨愿。不求当有名不依生。能胜利生名成大愿。戒净相者即第三四。非谓一切皆戒净相</p><p>成就八法成净羼提等者。心无所动名善净内。不悕他报名善净外。世俗三品名上中下法。了皆无碍名究竟无碍。住第一义名顺法性。心无量碍名无染著。无所推求名离诸见。不取诸境名断诸觉。无所希求名為捨愿。无所造作谓除诸行</p><p>成就八法能净毘梨耶等者。勤断诸恶故谓之精。勤修诸善说名為进。见恶可断非极能断。见善可修非极能进。喝可得為真精进乎。即前三种断恶精进。其后五种修善精进。若有断恶净三业相。非谓真实净除三业。今虽為净三业之恶。而了三业如影如响如幻相者。是即名為真净三业。下之五种修诸善品。既知诸法无有自性。何有具足诸波罗蜜。既觉诸法一真无碍。何有所照菩提分耶。既知诸法无念非念。何有所得陀罗尼法。是则名為真波罗蜜真菩提分真陀罗尼。餘文易解。不烦解释。此总意云。既无所断。亦何所精。又无所修。于何而进。则无所精无所不精。亦无所进无所不进。是即名為真精进矣</p><p>成就八法能净禪等者。于中道者即是因也。言不依者无託缘也。依託阴等而修禪者。是有所得世间静虑。非谓真实出世间禪。心无所依与慧平等。是则名為清净禪矣</p><p>成就八法能净般若等者。诸法性空无善不善。断无所断生无所生。故虽断恶生善而无断常二见。有為无自性。皆从缘所生。缘亦无自性。一切皆无生。故虽观缘生而知无生也。一切字句能詮于法。既无所詮何有能詮。故云平等离言说也。无常苦法依有為观。有為既空。无常何有。即非常无常是真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界而无所见。故寂静也。知善恶业招苦乐报。业无所造。既非能感。何有业果為所感耶。故能了知无业报也。表是所酬假名过去表是所引假名未来。对此前后立為现在。故名筹量三世之事。已灭未生中无所住。皆不可得。故知诸法无去来今。如是八法约俗有义而有分别。约真空义而无分别。既此真俗自体无差。观而不观。不观而观。照而无照。无照而照。是谓真实般若波罗蜜也</p><p>由布施故摄受等者。由行布施所有事业故常摄受一切资具施诸有情作饶益事</p><p>有味无味等者。谓在定中得三昧乐。于中耽著名為有味。故在散位无三昧乐即名无味谓修施时禁防忍受者。禁其三业防杀盗等则有戒性。施内外财忍受诸苦则有忍性。餘义易解。准而说之</p><p>若修戒时远离等者。谓起慳恚犯<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>故。修戒时无慳恚故。则于戒中有施忍也。戒能止进。止进即勤。既离懈怠有精进也。一心持戒故无散动。具正信解故无邪见。无乱无邪故有定慧</p><p>修习所餘亦如是说者。谓修忍时于苦堪耐。便能广捨内外财等。又无报怨便施无畏。既能忍故不造诸恶。故有戒性。既有堪能便无懈退。故有精进。一心諦察二空之理。便有定慧。精进遍能策励前后。故精进中有餘五度。又由精进断恶修善能除六弊。故有六度。定慧二度准而说之</p><p>能得广大无尽可爱果者。然此三果具通依正体无限极故名广大。用无穷际谓之无尽。相无麤弊故名可爱。此通因果所得而说。是故说言诸果异熟</p><p>昔于眾生起大悲等者。由行施时令彼获得命色力安无碍辨喜。故自果位得身最胜。能令见者生欢喜也。由修戒时普于一切无诸染為灭苦因。故获净身遍灭诸苦。由修忍时远离嗔怒心无分别离翳障故。色相圆满普施光明。由修精进于一切处勤行利益灭眾生障。故于果位能分身等。由<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>时身心寂静。见者劝喜而生善心。故于果位普劝喜等。由般若故能令自他离愚痴闇得智慧明。故于果位得舒光等</p><p>何果异熟当知六种等者。然准经论说五种果。与此六种而相摄者。先明五果。后显配摄。一异熟果。此有二种。一真异熟。即第八识。由善恶业之所招感正為<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>总报体故。二异熟生。即意识中无记性者。不能招报。非正报体。但从异熟识引生故。合此二种為异熟果。二等流果。此有二种。一真等流。谓有无漏所有三性心心所法种及现行。剎那剎那前灭后生。前因似后故名為等。后果类前故谓之流。二假等流。谓善恶业所引同类好丑诸果。且如<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>得短命报。令他命短自命不长。果似于因名等流矣。实是增上。假名等流。合此二种名等流果。三离繫果。此有二种。一由我空无漏智故。永断烦恼繫缚障故。所显证得我空真如。二由法空无漏智故。永断所知繫缚障故。所得法空真如之理。合此二种為离繫果。四士用果。此亦二种。一法士用。谓诸假者士夫作用假诸作具而营造故。所辨稼穡工巧等果。二喻士用。不唯取于士夫作用。凡是因法而為作者。诸缘助法以為作具。诸所办果亦名士用。如世士夫有造作用而得果故。从喻為名。合此二种為士用果。五增上果。此亦有二。一者有力。谓有為法即因于果有增上力。如因柱等而成屋等。即柱于舍有增上力。故屋望柱為增上果。二者无力。谓此于彼虽无胜力。但于彼法无障碍能。即此于彼為增上缘。故彼于此為增上果。合此二种為增上果。今此六度所得之果。不唯是初异熟果故。是故倒言果异熟也。于六果中。得大财富是增上果。<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>善趣是异熟果。无怨坏等亦增上果。亦是相似等流果摄。第四五六皆增上果。亦是喻说士用果收</p><p>此通因中所得果者。显不唯是佛位果也。以佛非是趣生摄故。不用世间财富乐故</p><p>虽观身等四境无相等者。问。若未除障何假须修。复何故说能除四倒。答。且息四倒不起爱增染净之业。而未即能除彼能起二根本障。故懈怠等障未除也</p><p>谓诸菩萨先于等者。谓即资粮加行二位未能亲证二空真如。凡所修行依胜解力。是故名為胜行地。言胜解者决印為义。于所照解决定印持故名胜解</p><p>修奢摩他等者。奢摩他者此云止品。為欲令心息分别故。止诸境相所有相应心心所等总名為止。毘闵崮谴嗽乒燮贰?橛?钚拿骼?智安簧蛎还省9鄄炀诚嗨?行牡茸苊麨楣邸</p></div>"
}]