[{
    "title": "大乘百法明门论开宗义记 第2810部",
    "author": "昙旷大师",
    "html": "<div class=\"B1_text\"><p>大乘百法明门论开宗义记</p><p>京西明道场<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>曇旷撰</p><p>夫遍知委照浑真俗于心源。深慈普洽演半满于言派。寔由性相更会万法归于一如。文义互融八藏驰于四辩。喝空有之异辙。奚广略之殊途。究其本者必同味于百川。滞其末者竞分流于五谤。是以小乘漂于有有部执烦兴。胜义溺于空空挣论纷起。尚驱妄境未越昏衢。徒向真风虚霑法雨。故我补处<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>大阐瑜伽。杜两见门开一实道。然以理该事博旨散言弥弘。前修倦于传通。后进疲于就业。爰有菩萨厥号世亲。位极三贤德邻十圣。製论千部声高五天。妙契<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>雅扶言记。乃軫时侥代薄根浅性微。怖法海而长睽。怯义山而永阻。遂乃摭精华于广部。綰宗要于略文。诱彼初机纂斯小论。欲使留连至教渐染真宗。示弱丧于归方。引疲徒于捷逕。前明百法之有。后显二我之空。首末交辉终始相映。边执既遣<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>肇彰。识浪由是演微。真源赖之澄廓。至矣哉此论之幽趣也。首称大乘百法明门论者。举所宗之胜益。建自部之通名。复云本事分中略录名数者。标论起之殊依。简异詮之别目。大乘以广运崇号。百法以体数彰名。明门将开慧為功。论者乃詮辩之称。本事则究极法体。分中是当段义门。略录谓抑彼繁词。名数乃举此纲要。用旌雅趣建以鸿名。故言大乘百法明门论本事分中略录名数</p><p>开发论宗五门分别。一明所因。二显所缘。三彰所宗。四辩所归。五解所立。所因有二。一所依因。二所為因。所依因者复有五种。一依了教。谓依建立阿赖耶识。了教大乘而立论故。二依圆理。谓依三性显说有空。处中理门而作论故。三依胜境。具依五法双据二空。一切甄明而起论故。四依妙行。以本后智发深慈悲。弘法利生而兴论故。五依大果。要成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>具说圆宗。依佛满智而為论故所為因者亦有五门。一入大法。谓以略标广散义宗。易入大乘离怯懈故。二起胜解。诸法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>远离二边。令其遍达离偏见故。三生圆照。具明真俗双显有空。令得中道起圆照故。四令进趣。具说染净所断证修。令正<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>无错谬故。五令成就。若分若满或化或真。转依皆成无缺减故。辩所因竟</p><p>显近缘者。论起所缘复有二种。一造论所缘。二传译所缘。造论缘者。此论既从本事分出。所缘不离瑜伽师地。故最胜子瑜伽释云。令说此论所缘云何。谓诸有情无始时来。于一切法处中实相。无知疑惑颠倒僻执。起诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>发有漏业。轮迴五疑受三大苦。如来出世方便為说种种妙法处中实相。令诸有情知一切法。如是如是空故非有。如是如是有故非空。了达诸法非空非有。远离疑惑颠倒僻执。起处中行永断诸障。得三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>证寂灭乐。佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后六百岁来。部执竞兴多著有见。谤大乘法毁灭真宗。龙猛菩萨证极喜地。采集大乘<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>空教。造中论等究畅真要。除彼有见。圣提婆等诸大论师。造百论等弘阐大义。由是眾生复著<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>。至佛灭后九百年初。无著菩萨位证初地。得法光定发大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。事大慈尊请说此论。理无不穷事无不尽。文无不释义无不詮。疑无不遣执无不破。行无不修果无不证。离前二见住中道理。起处中行速证涅槃。无著菩萨有异母弟。位阶加行身号世亲。即佛所记付法藏中第二十二传法主也。本习小乘遍通异部。造论五百隐蔽大乘。无著愍之託疾命诱。中路闻诲方信大乘。改轨弘扬造论五百。具如别传。此但粗明。以瑜伽论义广文繁。学者难寻莫知旨趣。遂造此论略亦方隅。即是造论之缘起也传译缘者。大唐贞观有大<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>遍觉大师。身号玄奘俗姓陈氏。洛邑人也。游五印度境学三藏。玄文名立业成来归本土。文帝待以国师之礼。乃詔令其翻译经论。盛得高踪具如别传。此论即我三藏大师。贞观二十三年于京大慈恩寺译。总是第二论所缘竟</p><p>次下第三论所宗者。统论诸宗不过三种。外道小乘大乘别故。外道所宗虽九十六。然今类摄為十六宗。故显扬论总标颂曰</p><p>执因中有果显了有去来</p><p>我常宿作因<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>等害法</p><p>边无边憍乱见无因断空</p><p>计胜净吉祥名十六异论</p><p>彼论长行广明立破。今略举之显宗计相。一因中有果宗。则雨眾等所说。求此果时唯取此因。唯从此生不从餘故。二从缘显了宗。即声论等所执。彼说声等体常本有。缘至即显非自出故。三去来实有宗。则时论者所说。去来同现皆实有故。小乘有部亦同此执。四计我实有宗。谓兽主等所知。起色受相行识觉时。别有萨埵我等觉故。五诸法皆常宗。伊师迦等所说。极微等法一切<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。以前后际物相续故。六因定宿作宗。即离繫子等所说。苦乐等果定宿因作。见行<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>倒受果故。七自在所作宗。如不平等论说。欲<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>等事皆违返。由<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>事作者别故。八害為<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>宗。爱肉梵志说。于天祠中害生祠祀皆得生天。由咒力故。九边无边等宗。為得世静虑者。忆坏成劫观上下傍。治前所执有边等故。十不死憍乱宗。谓愚无智者计。惧问失名不敢正对。推不死天憍乱答故。十一诸法无因宗。彼见欻尔大风卒起暴河弥漫后见正息宛然无故。十二死后断灭宗。邪思论者所立。若有后身何有作业。我体既空业果无故。十三<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>俱空宗。得世定通者。见行善恶得果皆差。梵行入定后身无故。十四妄计最胜宗。即执梵志论者说。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>最胜白色。梵王种胤性梵行故。十五妄计清净宗。如下劣戒见者。执鸡狗等诸戒清净。四河水净浴除罪故。十六妄计吉祥宗。歷算论者所说。于日月星常行<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>不失度时。所欲成故。此十六种所执邪论。皆依无明邪思所起。背内真理皆名外道。六师皆有此十六法。故总说為九十六种。次小乘宗有二十部。今应总该而為颂曰</p><p>异部有二十本二末十八</p><p>本上座大眾末初从大眾</p><p>有一说出世鸡胤及多闻</p><p>说假制多山西山北山住</p><p>上座名雪转流出一切有</p><p>犊子法贤胄正量密林山</p><p>化地并法藏饮光经量部</p><p>虽所计殊分二十部。于中类束以為六宗。一我法俱有宗。谓犊子部等许有<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>十二处等及依蕴等别有我故。二有法无我宗。一切有部等说。三世蕴等而皆实有。补特加罗实我无故。三法无去来宗。大眾部等说。蕴处戒等现法即有。去来蕴等皆是无故。四现通假实宗。说假部等说现在蕴实积聚法故。处界则假和合法故。五从妄真实宗。说出世部等执。出世可实非虚妄故。世间非实皆虚妄故。六诸法假名宗。一说部等执。世出世间亦皆非实。但是假名无性相故。此等皆依初时教起。故所执宗為小乘矣。后大乘宗而有二种。一胜义皆空宗。即十二门论智度中百<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>灯论掌珍论等。依般若等无相空教。说一切法不离二諦。若世俗门诸法皆有。乃至许有我法心境。与诸小乘义无差别。若胜义门诸法皆空。乃至不立<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>真如。与应理宗所说全别。然其二諦其体不异。以从缘生说名世俗。即缘无性名胜义空。故说二諦体无差别。由迷胜义执有世俗。纵勤修行终滞<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。由悟胜义了世俗空。故能不著速证涅槃。故说般若為究竟理。遣一切相无所得故。解深密等為不了义。不遣依圆有所存故。彼经自说為了义者。以对浅根义易了故。非理究竟名為了义。二应理圆实宗。即摄大乘论瑜伽显扬杂集唯识中边等论。依深密等诸了义经。说一切法世俗胜义不一不异。非有非空。具如五法前后相望立為四重世俗胜义。一虚实二諦。瓶军林等虚為世俗。蕴处界等实為胜义。二理事二諦。蕴等事法麤為世俗。四諦道理细為胜义。三浅深二諦四諦安立浅為世俗。二空真如深為胜义。四詮旨二諦。二空真如带詮世俗。一真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>界亡詮胜义。相对立故非一。无别体故非异。妄所执故非有。体不无故非空。故说深密為极究竟。得中道故。般若等经為非了义。就偏说故。此中具说二种宗义。若<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>性<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>法门即為三宗。如起信疏。今此论者即大乘中应理圆实究竟宗收。前明百法显有依他圆成。后说二空显无遍计所执。既离二边契会中道。二边既离中道亦亡。心无所依都无所得。由无所得无所不得。是谓究竟圆实宗也。辩所宗竟</p><p>显所归者。所归不同有其四种。归藏归乘归时归分。言归藏者即二藏等。然藏不同总有二种。一约人辩唯有二种。一菩萨藏。二声闻藏。独觉智证与声闻同。教既不多入声闻藏。藏者摄也。随摄二人理行果义各摄益故。二随所詮立為三藏。谓前二中各有三藏。一素怛揽此云契经。贯穿缝缀。所詮定学契理契机摄益他故。二毘奈耶此云调伏。所摄戒学调和三业。制伏恶行而摄益故。三阿毘达磨此云对法。所摄慧学对向涅槃对观四諦而摄益故。此义广如起信疏述。此论即是菩萨藏中阿毘达磨。显示菩萨理行果义生胜智故。言归乘者。或说一乘。如法花云。唯说一乘无二三故。或说二乘。如摄论说。上乘下乘有差别故。或说三乘。如法花云。為求声闻等者说应四諦等法故。或说四乘。如胜鬘经。更加无闻非法眾生人天善根而成熟故。或说五乘。如大般若。更加三乘性不定者。闻此法已发大心故。然此五乘义有开合。故诸经论所说有异。此亦具如起信疏述。今此论者即是一乘所收。二乘等中上乘所摄。所说五法及二无我。非是二乘世间法故。言归时者。古立教时多少不定。谓从一时乃至五时。皆无正据。恐繁不叙。今依教量立教三时。如深密经。正说意云。初第一时為小根者唯约有义说四諦教破人<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>。即四阿含等说有隐空名未了义。于第二时為大乘者多就空义说无相教破法我执。即般若等说空覆有亦未了义。后第三时普為诸乘显说三性中道之教令悟真实。即深密等具显有空名真了义。然此三时对不定性。大由小起渐次而说。若顿悟机则不尔故。亦非年月定判后先。但以义类相从而说。花严初说非初时故更有别义。起信疏明。今此论者依第三时了义大乘。第三时摄所引经说诸法无我有空双显不偏说故。言归分者。若依诸经有十二分。谓如旧说十二部经。部谓部分。经即是教。恐滥部袟改置此名。十二分名而作颂曰</p><p>契经应讽颂受记自说缘</p><p>譬喻本事生广希法论义</p><p>广释名义如餘处明。既许三藏俱得教名。故此即是论义分摄。若依论说即有十分。即瑜伽论十支义也。此中分者是支义故。此既是论故归十支。一略陈名数支。即此论是。二粗释体义支。即五蕴论。三广辩名义支。即杂集论。四总包眾义支。即显扬论。五<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>体义支。即庄严论。六綰摄大义支。摄大乘论。七离僻处中支。辩中边论。八摄散归观支。分别瑜伽论。九摧破邪山支。二十唯识论。十高建法幢支。<a href=\"/fojing/chengweishilun/yuanwen.html\" class=\"keylink\" target=\"_blank\">成唯识论</a>。又瑜伽论总有五分。一本地分。略广分别十七地义。二摄决释分。略摄决择十七地中深隐要义。三摄释分。略摄解释诸经仪则。四摄异门分。略摄经中所有诸法名义差别。五摄事分。略摄三藏眾要事义。今此即是本地分收。依此分中录名数故。明所归竟</p><p>解所立者。于中有二。初释所立题目。后释所立文义。解题有二。初正释题目。后显论所依。正释有二。初离后合。离释有四。一释大乘。二显百法。三解明门。四辩论字。凡為释名皆依六释。方于名义而得显然。故于此中先明六释。而此六释总名离合。谓要二法各有别体合為一名。如言金藏。金与藏别故名為离。同目一物故名為合。若唯一法无离合义不名六释。如言无為。无為无离即无合故。其六者何。一持业释。谓若有法依自业用而得其名。如言藏识。以识能藏体持业故。二依主释。谓若有法依他士主而得其名。如言眼识。是眼之识名依主释。三有财释。谓若有法从所有物得其名。如他心智。智有他心。名从物故。四相违释。谓若有法体用各殊同立一名。如言眾生。眾之与生体用别故。五邻近释。谓若有法名非本体。从邻得名。如言念住。体虽是慧。住由念故。六带数释。谓若有法若体若用约数而显。如言五眼。照境体用数有五故。即既显六释。次将释名。言大乘者。谓菩萨乘。剋用理智而為其体。皆该周故名之為大。并能运故称之為乘。理智相对互為大乘。大之乘故依主释也。理智当体各言大乘。大即乘故持业释也。或兼教果即有四法。随应皆有。綺互相望持业依主准前应知。此约菩萨所乘之法。若兼能乘菩萨人者。大之乘故依主释也。偏就能乘菩萨人者。大即乘故持业释也。此即总合释大乘义。若瑜伽论等皆约法体。以七大义别释大名。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>藏经即约诸喻。举诸<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>别释乘义。恐繁不叙。起信疏明。言百法者。名如下列。心法有八。心所有法有五十一。色法有十一。不相应行有二十四。无為有六。法谓轨持。百者数也。法有百数带数释也。言明门者。明者是慧。慧能照法。法因慧显。故慧称明。门者通也。谓前百法通生明慧入佛境界至<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>处。故说為门。是明之门依主释也。百法即明门持业释也。小乘唯明七十五法。今大乘宗广明百法。故言大乘百法明门。所言论者。问徵微释论量正理教诫学徒。故称為论。然论不同有其二种。一随释论。随经律论而造解释。如智度等。二集义论。采集诸义通释诸经。如瑜伽等。今此通是二种论收。以释经言法无我故。采集百法通解释故。已显别释。言合释者。大乘即是论所依宗。百法乃是论所显理。论即百法能詮之教。然即大乘通其教理。其百法论亦通教理。以教对教。以理对理。大乘即百法等。皆持业释也。以教望理。以理望教。大乘之百法等。皆依主释也。更有别义。恐繁不明。正释题竟</p><p>论所依者。然瑜伽论虽有五分。于中即无本事分名。若对法论有本事分。于中不明百法之义。然于今者以义取文。事谓体事。地谓依持。即彼体事有依持义。故地与事名异义同。有说本事广论未译。但录名者是妄言也。以本地分义散文繁。于正法体未為百定。恐初学者迷<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>门。怖文义海不能趣入。略录名数以示方隅。但云文略非义略也。此举初地所观法故。故唯识论说。极喜地于多百门以得自在。多百门者。瑜伽论云。剎那能入百三磨地。净天眼见百世界中。以威神力动百世界。往百世界供百如来。放大光明照百世界。现身百类化百有情。若欲留身住寿百劫。前后百劫各见分明。化百菩萨已為眷属。正思正说百法明门。今此即当第十法也</p><p>论。如<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>言一切法无我何等一切法云何為无我。开曰。上释题目。下释文义。于中有二。初举经问起。后依问辩说。此初也。言世尊者。即起教主。总上九号具包<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>六义差别故名世尊。既具眾德為物钦重故所言说实為定量。即依所说以立论端。说一切法皆无我者。何等名為一切法体。云何此法复称无我。非谓法外别问无我</p><p>论。一切法者略有五种开曰。下依问显说。于中有二。初显一切法。后明二无我。初显法中复分為四。一总标法数。二依标列名。三辩法次第。四别开法相。此初也。所言法者。轨持為义。轨為轨则。生物解故。持谓任持。守<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。虽此二义亦通无我。显不离前故不名法。然此轨持差别有五。一轨唯有体。无法非缘。不生心故。持亦通无。设无法体。性不捨故。二轨唯差别。缘无我等而生解故。持通自性。虽未生解。体不捨故。三轨唯有為。要成同缘方生解故。持通无為。虽都无相。不失性故。四轨唯后说。持通前宣。如立声常。声不失性。闻常<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>方生解故。五轨唯能詮。要名句文方生解故。持通所詮。义亦不失。本自性故。故轨义局。持义即通。通局不同故轨持别</p><p>论。一者心法二者心所有法三者色法四者心不相应行法五者无為法开曰。此依标列名也。所言心者。谓八现识。由有三义并名為心。一缘虑义。攀缘思虑一切法故。二贞实义。是一切法之体性故。三集起义。集诸法种起诸法故。心即是法。持业释也。下之四法当知亦然。心所有法者。谓触作意等。恒依心起与心相应繁属于心故名心所。如属我物立我所名。心于所缘唯取总相。心所于彼亦取别相助成心事。得心所名。如画师资作摸填采。心之所有。依主释也。言色法者。变现為义。变為变坏。由彼手足乃至蚊蛇所触对时即变坏故。现谓示现。若于方所所现骨琐形显等相而示现故。有处说。色对碍為相。对為触对。碍為障碍互相触时而障碍故。所言心不相应<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。谓得成就眾同分等。亦依色法分位建立。非如触等唯依心起繁属于心助成心事心俱生灭与心相应。亦五蕴中行蕴所摄。简行蕴中诸相应行。是故名心不相应行。此有四句。如理应思。无為法者。谓虚空等。自体凝然非三世摄。无生住等行所迁故。其性清净无有漏染。非业烦恼之所為故。具此二义名曰无為</p><p>论。一切最胜故与此相应故二所现影故三位差别故四所显示故如是次第开曰。此辩法次第也。一切法中心最胜故。故最第一明其心法。谓此心法势分用强。缘虑道中心王触胜。故契经说。心远独行染净由心。士夫六界心能道世间。心能遍摄受。如是心一法皆自在随行。是故论言一切最胜故。虽由作意警而方生。及心生已依心而住。如臣引王。非臣胜故。心起必有心所相应故。此第二明其心所。是故论言。与此相应故。心所与心有四等义非定一异故成相应。故唯识云。而时依同所缘事等名相应义。一体等。各有一体故。二依等。同依一根故。三缘等。同缘一境故。四时等。同一剎那故。若依小乘。同一行解。如同缘一青俱作青解故。今大乘宗不许同行。了别领纳等作用各异故。由斯<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>虽各一体。而时依境不必皆同。是故诸识非相应也。心心所起必现色影故。次第三明其色法。是故论言。二所现影故。谓若心起託境方生。必变色影当情而现。故诸色法皆不离心。无有一色非心变者。如<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>卒鬼见脓河眼外毛轮梦中色像。皆自心变都不离心。此心岂唯变色法耶。答。就麤显著且说色言。為破离心有实色执。实色尚尔。况非色乎。心心所色必有分位故。此第四明不相应。是故论云。三位差别故。如唯识论显此义云。得非得等非如色心及诸心所体相可得。非异色心及诸心所作用可得。故非实有。但说色等分位假立。此定非异色心心所有实体用。许蕴摄故。如色心等。若异心等。或心心所及色无為所不摄故。如毕竟无。定非实有。前明诸法后显法性故。次第五明无為法。是故论言。四所显示故。如唯识论显此义云。然诸无為所知性故。或色心等所显性故。如色心等。不应执為离色心等实无為性。若异心等。非法性故。故依前四显示无為。虽与诸法体不相离。而与诸法亦非即一。由常无常性各异故。如是次第总结前说。帆论诸法次第有五。一者生起。十二支等先因后果次第生故。二者观行。如四諦等先果后因次第观故。三者麤细。如<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>等前麤后细次第修故。四者胜劣。心心所等前胜后劣次第有故。五者言说。如正断等虽无前相次第说故。于前五法而配属者。心心所色不相应行而有生起胜劣次第。兼说无為麤细次第。有為事麤无為细故。小乘则依麤细次第故以色法而為其初。一切法中色最麤故。亦依观行以不净观佛法要门依色法故。不许诸法心所变故。不以心心為最初也</p><p>论。第一心法略有八种开曰。次下第四广辨法相。辨前五法即分為五。初心法中复分為二。初标数后辨列。此初也。谓此心法诸教异说。若小乘前及大乘中。随转理门但说前六。仍亦不许一念并生。故于见在随起一识。<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>等开阿赖耶染净二位说有九识。若摄大乘依前六识根境识三立十一识。深密等经于阿赖耶通别分位立七种名。摄论所说一<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>宗不开前六。但总说三。如是等教处处非一。今剋体说但有八种。诸教多少随开合故</p><p>论。一眼识二耳识三鼻识四舌识五身识六意识七末那识八阿赖耶识开曰。此辨列也。然此八识圣教大宗。先德皆有章门广释。今开略论未可文繁。就要而明十门分别。一释名显体。二心所相应。三所缘境界。四诸分行相。五诸量同异。六诸受有无。七所依多少。八所缘所闕。九能所熏异。十断常体殊。此十义门诸论虽说。而唯识论具而且明。今者多依唯识文释。初显名体复有四句。或有教说通中别名。八虽通名為心意识。依相增说心意识殊。第八名心。集诸法种起诸法故。第七名意。性审思量為我相故。前六名识。了境相麤胜餘识故。此于通中显此别名。或有教说别中别名。且前六识虽别名识。依根境用各立三名。依根方名名眼识等。眼之识故并依主释。随境立名名色识等。识有色故并有财释。随用立名名见识等。见即识故并持业释。今此论说随根立名而不随境立识名者。随根立名具五义故。五谓依发属助如根。一依眼之识故名眼识。要根不坏依眼识生。纵色现前盲不见故。二眼所发识故名眼识。如病损眼识并见黄。不由色坏识谬见故。三属眼之识故名眼识。眼识种子随眼种生。不随色种眼识生故。四助眼之识故名眼识。由识合根有所领受。根有损益非由色故。五如眼之识故名眼识。如根能照定是有情。色于是中非决定故。眼识既尔。餘识准之。随境立名。虽顺识义。但依五根未自在说。若自在位诸根互用。一根发识缘一切境。即令六识有杂乱过。随用立名当知亦尔。但所随根无相滥失。又<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>楞伽经中更立别名分别事识。分别内外种种事故。起信论中名分离识。别依六根取六境故。其第七识通中别名名末那者。此译名意。恒审思量為性相故。此名何异第六意识。此持业释如藏识名。识即意故。彼依主释如眼识名。识异意故。此意别名复有三种。一补特伽罗我见相应名染污意。二法我见相应名有覆意。三平等性智相应名清净意。初通一切异生相续二乘有学七地已前一类菩萨有漏心位。彼缘阿赖耶识起补特伽罗我见。次通一切异生声闻独觉相续一切菩萨法空智果不现前位。彼缘异熟识起法我见。后通一切如来相续菩萨见道及<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>中法空智果现在前位。彼缘无垢识等起平等性智。其第八识差别名者。此依位别有三种名。一名阿赖耶此译名藏。能藏所藏执藏义故。谓前七识皆从种生。因果体相不可定异。即揽此种為第八识。七识皆為此识所摄。摄藏诸法于自体中故名能藏。诸识种子七识所熏。是彼气分不离七识。既揽种子為第八识。种子是前七识所摄。藏自体于诸法之中故名所藏。从无始来任运相续。似一似常以实我相。故第七识恒执為我。我见所摄故名执藏。藏是业用。识即是体。藏即是识持业释也。此名唯在异生有学。非无学位不退菩萨。有杂染法执藏义故。故赖耶名依执藏说以前二义通后位故。由是此名过失最重。最初捨故此中偏说。二名毘播迦。此名异熟识。谓此识体性唯无记。乃是能引善不善业界趣生等生死果体。名异熟者。异时而熟。变异而熟。异类而熟。具此三义故名异熟。若前二义名异熟者。前七识等亦得此名。因时异果。由因变异而果方熟。义皆遍故。依后一义名异熟者。唯第八识独得此名。以善恶因感无记果。异类熟义非餘识故。异义通因。熟唯在果。果熟有二。种子现行。若异属因是异之熟。若异属果异即是熟。异熟即识熟属现行。异熟之识熟属种子。故餘转识不得此名。此名唯在异生二乘诸菩萨位。非如来地犹有异熟无记法故。三名阿末罗。此名无垢识。最极清净广大殊胜诸无漏法所依止故。无垢即识持业释也。此名唯在如来地有。菩萨二乘及异生位持有漏种可受熏习。未得善净第八识故。此等皆是别中别名。或有教立别中通名。其前六识通名受用。受用六尘生苦果故。杂集论中名生起识。数从本识而生起故。若兼第七通名转识。见道等中有间转故。若第八识通前三名。及一切位有四种名。或名根本识。是前七识染净诸法生根本故。或名阿陀那。执持种子及诸色根令不坏故。或名所知依。能与染净所知诸法為依止故。或名种子识。能遍任持世出世间诸种子故。此等并是别中通名。或有教说通中通名。谓即此前别中通名。更通名為心意识故。此前通义通名心者。缘虑集起。通诸识故。故前标云。心法有八。或通诸义皆名為意。皆有能生依止义故。故处门中通名意处。或此诸义通名為识。皆能了别诸境相故。故五蕴中皆识蕴摄。而论列中并名识也。小乘通依三世眼等。未来名心。积集义故。入现名识。能了别故。过去名意。开导依故。心起必有心所相应。随心性类与彼俱起。谓八识性有善不善有覆无记无覆无记。能于此世他世顺益故名為善。人天乐果虽于此世能為顺益。非于他世故不名善。能于此世他世违损故名不善。恶趣苦果虽于此世能為违损。非于他世故非不善。于善不善损益事中不可记别故名无记。若性染污能蔽于心障碍圣道故名有覆。若非染污不能蔽心不障圣道故名无覆。第八唯是无覆无记。以此识是异熟性故。异熟若是善染污者。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>还灭应不得成。又此识是善染依故。若善染者互相违故。应不与二俱作所依。又此识是所熏性故。若善染者如极香臭应不受熏。无所熏故染净因果俱不成立。既信贪等是唯善染。故与此识定不相应。恶作等四无记别境性者有间断故亦不相应。其别境五缘别别境。谓欲希望所乐事转。此识任运无所希望胜解即持决定事转。此识瞢昧无所印持。念唯明记曾习事转。此识昧劣不能明记。定能令心专注一趣。此识任运剎那别缘。慧唯简择德等事转。此识微昧不能简择。故此不与别境相应。其触作意受相思五。以是遍行心所法故。若无此五心必不生。无触受等不名心故。其遍行相后当广说。第七唯是有覆无记。性是染污障碍圣道隐蔽自心故名有覆。一类内执不起此世他世损益故名无记。故唯十八心所相应。谓触等五。别境中慧我痴我见我慢我爱。八大随惑。意与遍行定相应故。执我法者必有慧故。愚于我相迷无我故。于非我法妄计度故。恃所执我生高举故。于所执我深耽著故。八大随惑遍染心故。何故此识无餘心所。我见常起无餘见故。无一心中有二慧故。慧与我见义用别故。由见审决不犹豫故。爱所执我不憎恚故。恒缘合境无希望故。恒缘定事无印持故。恒缘现境无记忆故。剎那别缘不专一故。善唯是净。此染污故。小十麤猛。此审细故。中二不善。此无记故。恒缘定境非悔先故。眠依外缘。此内起故。寻伺麤细此一类故。故唯十八心所相应。第六意识通一切性。具诸分别内外门转。于损益性皆可记故。所起染污虽為定伏。性非损益障圣道故。满业所招异熟果心性非染污。不障道故。故容一切心所相应。虽非一时一切俱起。随起三性即彼相应。眼等五识随外门转。亦同意识通其四性。由无计度随念分别。唯三十四心所相应。谓五遍行及五别境。十一善法三本烦恼。中二大八十随烦恼。触等遍与心相应故。能微劣缘别别境故。亦有翻染诸善法故。有贪嗔痴不善根故。无惭无愧通不善故。掉举等八遍染心故。所餘心所何不相应。由称量等起慢等故。小十麤猛此微劣故。追悔睡眠非五法故。寻伺是意不共法故。此随因中三性位说。若在果位皆无漏善。与二十一心所相应。遍行别境及善十一。与一切心恒相应故。常乐证知所观境故。于所观境恒印持故。于曾受境恒明记故。世尊无有不定心故。于一切法常决择故。极净信等常相应故。无染污故无散动故。非不定等心所相应。既随此等心所相应。于所缘境亦有宽狭。因中五识唯缘色等五尘假实。如下所明。而五识缘有其二说。有说五识但缘实境。由任运而起不待名言。及待此餘根境起故。其长短等诸餘假色。要待名言及餘所起。是故不缘长等假色。有说五识亦缘假境。以长短等亦色处收。故眼识缘不违于理。然缘假时心缘于实。缘实之时不缘于假。实不依假。假依实故。第六意识缘一切境。具三七等一切分别。了别识中最為胜故。若第七识唯缘第八见分為我。不缘相分。识中种子及相应法以為我所。我我所执不俱起故。以此识俱萨迦耶见任运一类恒相续生。无容别起我所执故。有处说执我我所者。以执此识是我之我。故于一见义说二言。其第八识虽微细故所缘行相俱不可知。由<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>力自体生时。内变执受种子色根。外变所依器世界相。即以所变為自所缘行相。仗之而得起故。若有<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>具三所缘。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中唯缘种子不变心等為所缘者。有漏识变略有二种。一随因缘势力故变。二随分别势力故变。初必有用。后但為境。异熟识变但随因缘所变色等必有实用。若变心等便為无用。相分心等不能缘故。须彼实用别从此生。是故第八不缘心等。若以此识缘七识种。摄末归本亦得名缘。但依现行则<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>义。此等皆依有漏位说。若无漏位四智相应。遍缘真俗一切境界。不尔佛果非遍知故。此诸境相皆自心变。实不离心。是心分故。然此心分总有四种。一者相分。二者见分。三者自证分。四证自证分。谓有漏识自体生时。皆似所缘能缘相现。彼相应法应知亦然。似所缘相说名相分。似能缘相说名见分。若心心所无所缘相。应不能缘自所缘境。或应一一能缘一切。自境如餘。餘如自故。若心心所无能缘相。应不能缘。如虚空等。或虚空等亦是能缘。故知必有相见二分。相分是所缘。见分名行相。相见必有所依自体。即此自体名自证分。此若无者无自证分。应不自忆心心所法。如不曾受境必不能忆故。相见应无所依体故。所量能量无量果故。故知必有此自证分。心分既同必合相证。若无第四谁证第三故应更有证自证分。此是第三自证分果。诸能量者必有果故。不应见分為第三果。见分或时非量摄故。证自体者必<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>故。若尔应更立第五分。是则复有无穷之失。答但是第三却证第四。皆是现量得相证故。初二是外。后二是内。初唯所缘。后三通二。非即非离皆不离心。具所能缘无无穷过。此有漏识四分皆通。若无漏心有无不定。谓正体智见有相无缘。真之智必有见故。若无见分应不能缘。寧可说為缘真如智。勿真如性亦名能缘故。应许此定有见分。虽有见分而无分别。说无相取不取相故。虽无相分而可说此。带如相起不离如故。如自证分缘见分时。不变而缘。此亦应尔。变而缘者便非亲证。如后得智有境相故。若后得智二分皆有。说此智品有分别故。说此思唯似真如相。不见真实真如相故。分别诸法自共相等。观诸有情為说法故。若后二分二智虽通。缘用有无则各差别。谓根本智即不相缘。若后得智有相缘用。有相无相二用别故。是谓略说四分之义。而前所说诸识境相。应知即是识之相分。是心分故非即离心。离心心所皆有四分。而能量境则有差别。谓八识量总有三种。一者现量。现谓现前。量谓量度。谓于现前明了色等。不迷乱相而得了知。离诸名言种类分别照镜明白。故名现量。现即是量持业释也。二者比量。比谓比类。量义同前。谓于不现在前色等。而藉眾相于所观义有正智生。了知有大或无常等。是名比量。比即是量亦持业释。三者非量。谓若有境非可现知明白而照。亦非眾缘而可比度。境体实无非可量度。于非量处而起心量。故名非量。故非六释。然此三量皆约心论。不约境说。非能量故。故八识中五八二识唯是现量。由无计度随念分别。但于境界任运转故。若末那识唯是非量。缘第八识执為我法。于非我法而横计故。若第六识通有三量。具自性等一切分别。能遍了知一切境故。故四分中初之相分唯是所量。后三通二。次之见分通其三量。其后二分唯是现量。证自体者必现量故。此依因位八识而说。若依果位亦有差别。谓正体智一切现量。若后得智亦通三量。缘自共相一切境故。既量境相应领顺违。此领受相略有三种。领违境相逼迫身心说名苦受。领顺境相适悦身心说名乐受。领中容境相于身于心非逼非悦名不苦不乐受。于苦乐中复各分二。所谓苦忧喜乐别故。逼悦身心相各异故。由无分别有分别故。尤重轻微有差别故。不苦不乐不分二者。非适非悦相无异故。无分别故平等转故。诸适悦受五识相应恒名為乐。意识相应名喜名乐。若在欲界初二静虑近分名喜。但悦心故。若在初二静虑根本名乐名喜。悦身心故。第三静虑根本名乐。安静尤重无分别故。诸逼迫受五识相应恒名為苦。意识相应名忧名苦。人天中者恒名為忧。由有分别非尤重故。傍生鬼界名忧名苦。杂受纯受有轻重故。捺落迦中唯名為苦。纯受尤重无分别故。除此餘位不苦不乐。若身若心皆名為捨。或在第四静虑近分根本已上并名捨者。平等转故。离变异受不动地故。若身若心无别相故。故知六识三受容俱。得自在位唯喜乐捨。诸佛已断苦忧事故。若第七识从无始来任运一类。缘内执我恒无转易。与变异受不俱起故。其第八识极不明了。不能分别违顺境相。微细一类相续转故。故皆唯与捨受相应。虽在果位亦唯捨受。任运恒时平等转故。虽此诸义依心心所。而心心所皆有所依。然彼所依总有三种。一因缘依。谓自种子。诸有為法皆托此依。离自因缘必不生故。然种自类因果不俱。种现相生决定俱有。犹如束芦俱持而有。如是八识及诸心所。定各别有种子所依。二增上缘依。谓内六处。诸心心所皆托此依。离俱有根必不转故。于中五识有四所依。谓五色根六七八识。随闕一种必不生故。同境分别染净根本所依异故。第六意识俱有所依但有二种。谓七八识。随闕一种必不生故。不共根本所依异故。若末那识俱有所依但有一种。谓阿赖耶。藏识若无必不转故。阿赖耶识俱有所依亦有一种。谓末那识。染意若无必不转故。说眼识等十缘等者。依与所依义相杂说。依谓一切有生灭法丈因托缘而得生住。诸所丈托皆说為依。如王与臣互相依等。若法决定有境為主。令心心所取自所缘。乃是所依。即内六处。此但如王非如臣等。故俱有依但唯尔所。三等无间缘依。谓前灭意。诸心心所皆托此依。离开导根必不起故。要有缘法為主能作等无间缘。此于后生心心所法开避引导。此但属心非心所等。若此与彼无俱起义。说此于彼有开导力。一身八识既容俱起。故唯自类為开导依。小乘不许六识并生。随一起时即名為识。随起而灭即名為意。故许互作等无间缘。故大乘宗唯取自类。自类必无俱起义故。虽心心所异类并生。而互相应和合似一。定俱生灭事业必同。一开导时餘亦开导。虽能开导而不名依。于所引生无主义故。此与四缘义有别者。一者因缘。為有為法亲辨自果。此体有二。一者种子。二者现行。种子者。谓本识中善染无记诸界地等功能差别。能引次后自类功能。及起同时自类现果。此唯望彼是因缘性。即三依中初所依义。彼望现识為种子依。此兼后种為因缘性。现行者。谓七转识及彼相应。所变相见性界地等。除佛果善极劣无记。餘熏本识生自类种。此唯望彼是因缘性。三所依中都无此义。现行同类展转相望皆非因缘。自种生故。二等无间缘。谓八现识及彼心所。前聚于后自类无间等而开导令彼定生多同类种俱时转故。知不相应非此缘摄。除入无餘最后一念极微劣故。又无当起等无间法。故非此缘。餘八识聚<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>九地上下死生有漏无漏。随其所应互相开导。故皆得作等无间缘。即三依中开导依义。三所缘缘。谓若有法是带己相。心或相应所虑所託。此体有二。一亲二疏。若与能缘体不相离。是见分等内所虑託。应知彼是亲所缘缘。若与能缘体虽相离。為质能起内所虑託。应知彼是疏所缘缘。亲所缘缘能缘皆有。离内所虑託必不生故。疏所缘缘能缘或有。离外所虑託亦得生故。由是八识及诸心所。各各定有亲所缘缘。疏所缘缘有无不定。若前五识麤钝劣故。及第七识是俱生故。未转依位必丈外质故。皆定有疏所缘缘。若第六识行相猛利。于一切位能自在转。若第八识所变身土。可互受用更互為质。所变根种于他有情无受用理。不互為质。及五七识已转依位。所杖外质或有或无。疏所缘缘有无不定。此就诸识当体而说。若依相望有无不定。恐文增广略而不述。三所依中都无此义。四增上缘。谓若有法有胜势用。能于餘法或顺或违。虽前三缘亦是增上。而今第四除彼取餘。為显诸缘有差别故。此顺违相于四处转。生住成得四事别故。然增上用随事虽多。而胜显者唯二十二。应知即是二十二根。此即摄彼三所依中俱有依义。此义宽故。是故八识更互為缘。有力无力义皆通故。初因缘中种子义者。种子即是习气异名。习气必由熏习而有。依何义故立熏习名。能熏所熏各具四义。令种子生长故名熏习。何等名為能熏四义。一有生灭。若法非常能有作用生长习气。乃是能熏。此遮无為。前后不变无生长用故非能熏。二有胜用。若有生灭势力增盛能引习气。乃是能熏。此遮异熟心心所等。势力羸劣故非能熏。三有增减。若有胜用可增可减摄垣习气。乃是能熏。此遮佛果。<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>善法无增无减故非能熏。彼若能熏便非圆满。前后佛果应有胜劣。四与所熏和合而转。若与所熏同时同处不即不离。乃是能熏。此遮他身。剎那前后无和合义故非能熏。唯七转识及彼心所有胜势用而增减者。具此四义可是能熏。何等名為所熏四义。一坚住性。若法始终一类相续能受习气。乃是所熏。此遮转识及声风等。性不坚住故非所熏。二无记性。若法平等无所违逆能容习气。乃是所熏。此遮善染。势力强盛无所容纳故非所熏。由此如来第八净识唯带旧种非新受熏。三可熏性。若法自在性非坚密能受习气。乃是所熏。此遮心所及无為法。依他坚密故非所熏。四与能熏共和合性。若与能熏同时同处不即不离。乃是所熏。此遮他身。剎那前后无和合义故非所熏。唯异熟识具此四义可是所熏。非心所等。若尔第八种是谁熏。第八唯是所熏识故。答。即前七识而与熏生。说熏成彼相见种故。谓前五识所起相分託第八识相分而生。故与第八熏相分种。若第七识託第八识见分而生。故与第八熏见分种。其第六识具缘第八所有相见熏相见种。此既无始常熏不绝。故无始来有异熟种。若尔第八非唯无记。能熏七识通三性故。答。所丈本质是无记故。所起相分非善恶故。故所熏种性唯无记。更有问答。恐繁止之。熏习虽齐藉缘不等。故令八识断常有殊。谓八识缘总有十种。一总共所依缘。即通依根。彼现行识依种识故。二染净所依缘。即染净根。缘染净事依彼转故。三分别所依缘。即分别根。依分别心缘色等故。四不共所依缘。即五色根。要俱有根识方生故。五亲辨自体缘。谓即种子。要亲从种生识体故。六惊动令起缘。谓即作意。于所引心有警能故。七所託牵引缘。谓所缘境。有境界牵识方生故。八开导令起缘。谓前念识将灭能引后念起故。九非碍令起缘。谓即虚空。若有碍者不能了故。十照了令见缘。谓即光明。以于闇中不能见故。此中眼识具有十缘。随闕一种必不生故。耳具九缘。谓除光明。以于闇中亦能闻故。鼻舌身三具有八缘。皆除空者。合中知故。第六意识唯具六缘。除五色根。不依彼故。除分别根。即自体故。若第八识具有五缘。除第六识及通依根。第八不依间断识故。自体不可依自体故。若第七识唯具四缘。除所缘境。以彼所缘即所依根无别体故。说依彼转而缘彼故。藉缘多少断常有殊。由此三界通局亦异。谓前五识行相麤动。不能思虑唯外门转。起藉多缘。所藉眾缘时多不具故。起时少间断时多。若鼻舌识唯欲界繫。色无香味无段食故。眼等三识不通无色。厌色生彼天。无色根境故。虽有定果色无业果色故。设至佛果成所作智相应净识亦有间断。所缘俗境有断灭故。第六意识虽亦麤动。自能思虑内外门转不藉多缘。而所藉缘无时不具。应一切时常能现起。亦通三界一切地行。由违缘故。五位断灭。故起时多不起时少。五位者何生无想天。即下所说无相异熟。及无想定灭受想定。睡眠闷绝。五位名义如下所明。若至佛果妙观察智相应净识常无间断。于一切时观真俗故。若第七识无始时来一类相续恒无间断。亦通三界一切地中。与赖耶等為所依故。然于三位而有转易。谓阿罗汉及灭尽定。出世道中而无染分净分。末那亦无间断。平等性智常相应起。恒缘平等真俗理故。若第八识于有漏位。三界九地恒转如流。恒言遮断。转表非常。犹如暴流因果法尔。非断非常是缘起理。故与趣生而為报体。乃通三界一切地中。由漏无漏三位名殊。随其名体有捨不捨。谓于二乘无学果位菩萨七地捨赖耶名异熟识体。菩萨将得菩提时捨。声闻独觉入无餘依涅槃时捨。无垢识体无有捨时。大圆镜智常相应故。诸善法影常现前故。利乐有情无尽期故。然八识义差别无边。恐文繁广略示纲要</p><p>论。第二心所有法略有五十一种开曰。次下第二明心所法。于中有三。初总合举数。次六位类分。后随位别列。此初也。然此心所诸论开合。若瑜伽论有五十三。更加邪欲及邪胜解。如邪念慧入烦恼中。邪欲胜解例亦同故。若杂集论有五十五。其邪欲等合入别境。开彼恶见以為五种。虽俱是慧。行相别故。此及五蕴。唯识显扬俱约合义说五十一。以五见者俱恶慧故。虽行相别无异体故。以<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>慧五善根摄。其邪念慧為障乃亲。过失重故开為烦恼。其正欲等非入善根。邪為障轻合在别境。小乘依经说四十六。更就合说义如下明</p><p>论。谓遍行五别境五善十一烦恼有六随烦恼有二十不定有四开曰。此六位类分也。一切心中定可得故。缘别别境而得生故。唯<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>中可得生故。性是根本烦恼摄故。唯是烦恼等流性故。于善染等皆不定故。是故六位如是差别。若瑜伽论总合為五。烦恼随烦恼皆是染法故。以四一切辨五差别。谓一切性及他时俱。五中遍行具四一切。别境唯有初二一切。善唯有一。谓一切地。染四皆无。不定唯一。谓一切性。由此五位种类差别。然此六位诸心所法。诸论虽明皆不具足。唯识论释既最圆明。下文谨依唯识论释</p><p>论。遍行五者一作意二触三受四想五思开曰。次下随位别列也。于中六位即分為六。此即第一遍行相也。作意谓能警心為性。于所缘境引心為业。谓此警觉应起心种引令趣境。故名作意。虽此亦能引起心所。心是主故但说引心。作谓击发。意即心王。意之作故依主释也。触谓三和分别变异。令心心所触境為性。受想思等所依為业。谓根境识更相随顺故名三和。触依彼生令彼和合故说為彼。三和合位皆有顺生心所功能说名变异。触以彼起故名分别。和合一切心及心所令同触境。是触自性。既似顺起心所功能。故以受等所依為业。受谓领纳顺违俱非境相為性。起爱為业。能起合离非二欲故。想谓于境取像為性。施设种种名言為业。谓要安立境分齐相方能随起种种名言。思谓令心造作為性。于善恶等役心為业。谓能取境正因等相。驱役自心令造善等。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>起时无此俱五。故说此五名為遍行。遍通一切心中行故。小乘论名通大地法</p><p>论。别境五者一欲二胜解三念四三摩地五慧开曰。此列别境也。所缘境事多分不同。于六位中次初说故。所言欲者。于所乐境希望為性。勤依為业。所乐境者谓欲观境。于一切事欲观察者。有希望故方有欲生。若不欲观随因势力任运缘者。全无欲故。由斯故说欲非遍行。若善法欲能发正勤。由彼助成一切善事。故论说此勤依為业。言胜解者。于决定境印持為性。不可引转以為其业。為邪正等教理证力于所取境审决印持。由此异缘不可引转故。犹预境胜解全无。非审决心亦无胜解。由斯胜解亦非遍行。所言念者。于曾习境令心明记不忘為性。定依為业。谓数忆持曾所受境。令不忘失能引定故。于曾未受体类境中全不起念。设曾所受不能明记。念亦不生。故念必非遍行所摄。三摩地者。此名等持。谓即是定于所观境平等持心。令心专注不散為性。智依為业。谓观德失俱非境中由定令心专注不散。依斯便有决择智生。若不繫心专注境位。便无定起故非遍行。所言慧者。于所观境简择為性。断疑為业。谓观德失俱非境中由慧推求得决定故。于非观境愚昧心中无简择故非遍行摄。而小乘论同前遍行名通大地。遍诸心者未达理故。如唯识破。然此五种或各别起。谓依所乐唯起一欲。乃至所观唯起定慧。或互相资随应俱起。谓于所乐决定曾习所观境中。起欲胜解念定慧中二三四五。或有心位五皆不起。如非四境率尔堕心二皆与五受相应。于苦忧事欲出离故。于喜乐事欲和合故。于平等事亦希望故。餘相应义准此说之。此五复依性界地等。诸餘门义如理应思</p><p>论。善十一者一信二惭三愧四无贪五无瞋六无痴七<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>八轻安九不放逸十行捨十一不害开曰。此显善位十一心所。唯善心俱名善心所。故信惭等定有十一。所言信者。于实德能深忍乐欲心净為性。对治不信乐善為业。然信差别略有三种。一信有实。谓于诸法实事理中深信忍故。二信有德。谓于<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>真净德中深信乐故。三信有能。谓于一切世出世善深信有力能得能成起希望故。由斯对治不信。彼心爱乐证修世出世善。忍谓胜解即是信因。乐欲谓欲即是信果。此性澄清能净心等。以心胜故立心净名。如水清珠能清浊水。惭等虽善非净為相。此净為相无滥彼失。又诸染法各别有相。唯有不信自相浑浊。复能浑浊餘心心所。如极秽物自秽秽他。信正翻彼故净為相。所言惭者。依自法力崇重贤善為性。对治无惭止息恶行為业。谓依自法尊贵增上。崇重贤善羞耻过恶。对治无惭息诸恶行。所言愧者。依世间力轻拒暴恶為性。对治无愧止息恶行為业。谓依世间訶厌增上。轻拒暴恶羞耻过罪。对治无愧止息恶行。羞耻过恶是二通相。以惭与愧皆羞耻故。崇重轻拒是二别相。依惭与愧各别起故。善心起时<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>何境皆有崇重善及轻拒恶义。故惭与愧俱遍善心。言无贪者。于有有具无著為性。对治贪著作善為业。言无瞋者。于苦苦具无恚為性。对治瞋恚作善為业。善心起时。随缘何境皆于有等无著无恚。观有等立非要缘彼。如前惭愧观善恶立。故此二种俱遍善心。言无痴者。于诸理事明解為性。对治无愚痴作善為业。有说愚痴以慧為性。不遇痴者即有慧故。故<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>不立无痴。是通大地慧数摄故。故善大地唯说十种。有说无痴别有自性。非慧為体。正对无明。如无贪嗔善根摄故。言精进者。于善恶品修断事中勇捍為性。对治<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>满善為业。勇表胜进简诸染法。捍表精淳简净无记。即显精进唯善性摄。此相差别略有五种。所谓被甲加行无下无退无足。以初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>长时无间慇重无餘修差别故。言轻安者。远离麤重调畅身心堪任為性。对治惛沈转依為业。谓此伏除能障定法。令所依止转安适故。故此轻安唯在定地。调畅身心餘位无故。故唯此一不遍善心。除此餘十遍善心起。不放逸者。精进<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>于所断修防修為性。对治放逸成满一切世出世间善事為等。谓即四法于断修事皆能防修名不放逸。非别有体。无异相故。于防恶事修善事中。离四功能无别用故。言行捨者。精进三根令心平等正直无功用住為性。对治掉举静住為业。平等正直无功用住初中后位辩捨差别。由不放逸先除杂染。捨后令心寂静而住。此无别体如不放逸。离彼四法无相用故。能令寂静即四法故。所令寂静即心等故。言不害者。于诸有情不為损恼无嗔為性。能对治害悲愍為业。谓即无嗔。于有情所不為损恼假名不害。无嗔翻对断物命嗔。不害正违损恼物害。无嗔与乐。不害拔苦。是谓此二麤相差别。理实无嗔实有自体。不害依彼一分假立。為显慈悲二相别故。利乐有情彼二胜故。别立不害假实双明。故十一善后三是假。前八实有。相用别故。若尔欣厌不慢不疑不憍狂等应非善法。答。虽皆善收而无别体。相用别者便别立之。餘善不然。不应為例。又诸染法遍六识者胜。故翻之别立善法。慢等忿等唯意识俱。害虽亦然而数现起损恼他故。障无上乘胜因悲故。為了知彼增上过失翻立不害。失念散乱及不正知。翻别境善中不说。染净相翻净寧少染。净胜染劣少敌多故。又解。理通说多同体。述情事局随相分多。故于染净不应齐责。十与五受皆得相应。一除忧苦。所谓轻安。有逼迫受无调畅故。此与别境皆得相应。信等欲等不相违故。轻安非欲。餘通三界。皆学等三非见所断。说唯修断非所断故。餘门分别如应理思</p><p>论。根本烦恼六者一贪二嗔三痴四慢五疑六不<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>开曰。此显六种根本烦恼。以此六种自性尤重。烦扰恼乱有情身心。能生忿等诸随烦恼。是故名為根本烦恼。俱舍论说為大烦恼地法。唯痴一种与此论同。餘五是此大随惑中。放逸懈怠不信惛掉。以遍染心烦杂热恼。是故名為大烦恼法。贪嗔慢疑不定中摄。恶见是慧不别立故。是大小乘宗义差别。所言贪者。于有有具染著為性。能障无贪生苦為业。谓由爱力取蕴生故。所言嗔者。于苦苦具染憎恚為性。能障无嗔不安恶行所依為业。谓嗔必令身心热恼。起诸恶业不善性故。所言痴者。于诸理事述闇為性。能障无痴一切杂染所依為业。谓由无明起疑邪定贪等烦恼随烦恼业能招后生杂染法故。所言慢者。恃己于他高举為性。能障不慢生苦為业。谓若有慢于德有德心不谦下。由此生死轮转无穷受诸苦故。此慢差别有七九种。谓于三品我德处生。所言疑者。于诸諦理犹豫為性。能障不疑善品為业。谓由疑故令慧不决怀。犹豫心善不生故。不正见者。于诸諦理颠倒推度染慧為性。能障善见招苦為业。谓恶见者多受苦故。此见行相差别有五。一萨迦耶见。谓于五取蕴执我我所。一切见趣所依為业。此见差别有二十句六十五等。分别起摄。二边执见。谓即于彼随执断常障处中行出离為业。此见差别。诸见趣中。有执前际四遍常论。四一分常论。及计后际有想十六。无想俱非各有八论。七断灭等。分别起摄。三邪见。谓谤因果作用实事。及非四见诸餘邪执。如增上缘名义遍故。此见差别。诸见趣中。有执前际二无因论。四有边等不死憍乱。及计后际五现涅槃。或计自在世主释梵及餘物类常恒不易。或计自在等是一切物因。或有横计诸邪解脱。或有妄执非道為道。诸餘如是等皆邪见摄。四见取。谓于诸见及所依蕴。执為最胜能得清净。一切斗挣所依為业。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>禁取。谓于随顺诸见戒禁及所依蕴。执為最胜能得清净。无利勤苦所依為业。如是总别十烦恼中。贪与嗔疑定不俱起。爱憎二境必不同故。于境不决无染著故。与慢五见或得相应。所染所恃境可用故。于五见境皆可爱故。嗔与慢疑或得俱起。所蔑所憎境可同故。久思不决便愤发故。与后二见必不相应。执為胜道不憎彼故。与前三见或得相应。于苦乐蕴执身断常生憎恚故。邪见诽拨无好恶事。嗔或有故慢于定境。疑则不然。故慢与疑无相应义。然与五见皆得相应。行相展转不相违故。疑不审决与见相违故。疑与见定不俱起。五见展转必不相应。非一心中有多慧故。痴与九种皆得相应。诸烦恼生必由痴故。又由俱生分别异故。性繫界地等通局亦殊故。此总别十烦恼中。六通俱生及分不起。任运思察皆得生故。疑后三见唯分别起。要由恶友及邪教力。自审思察方得生故。此二烦恼既通三界。随通不善无记二性。若欲界繫分别起者。唯不善摄。发恶行故。若是偈生发恶业者。亦不善摄。损自他故。餘无记摄。细不障善非极损坏自他处故。上二界者唯无记摄。<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>所伏不发恶故。由此故知嗔唯在欲。是不善性损自他故。餘通三界。通二性故。生在下地未离下染。上地烦恼不现在前。要得彼地根本定者。能伏下地诸惑不起。彼上地惑容现在前故。生在上地下地诸惑。分别俱生皆容现起。生第四定中有中者。由谤解脱生地狱故。身在上地将下生时。起下润生俱生爱故。下地烦恼亦缘上地。贪求上地味上定故。既说瞋恚憎嫉灭道。亦应嫉憎离欲地故。总缘诸行执我我所断常慢者得缘上故。餘五缘上其理极成。上地烦恼亦缘下地。说上生者于下有情恃己胜德而陵彼故。总缘诸行执我我所断常爱者得缘下故。疑后三见如理应思。若分别者唯见所断。麤易断故。若俱生者唯修所断。细难断故。故末那识相应烦恼非见所断。极微细故。非非所断。是染污故。见所断十实俱顿断。虽迷諦有总别亲疏。而真见道总缘諦故。其迷諦相有总别者。总谓十种。皆迷四諦。苦集是彼因依处故。灭道是彼怖畏处故。别谓别迷四諦相起二唯迷苦。八通迷四。身边二见唯果处起别空非我属苦諦故。于所迷諦有亲疏者。谓疑三见亲迷苦理。二取执彼三见戒禁及所依蕴為胜能净。于自他见及彼眷属。如次随应起贪恚慢。相应无智与九同迷。不共无明亲迷苦理。疑及邪见亲迷集諦等。二取贪等准苦应知。然嗔亦能亲迷灭道。由怖畏彼生憎嫉故。迷諦亲疏麤相如是。委细统者如唯识明。修所断者有顿渐断。随其三乘根利钝故。若第六识相应烦恼。一类二乘三界九地一一渐次九品别断。一类二乘三界九地合為一聚九品别断。若末那识相应烦恼。与有顶地下下烦恼一时顿断。最微细故。菩萨要至金刚喻定一剎那中三界九地兼末那惑一时顿断。此十烦恼要义如是。诸餘门义如论广明</p><p>论。随烦恼有二十者。一忿二恨三恼四覆五狂六諂七憍八害九嫉十慳十一无惭十二无愧十三不信十四懈怠十五放逸十六惛沈十七桌举十八失念十九不正知二十心乱开曰。此列第五随烦恼也。此二十种唯是烦恼分位差别等流性故名随烦恼。然此二十类别有三。谓忿等十各别起故名小随烦恼。俱舍名為小随烦恼地法。无惭等二遍不善故名中随烦恼。俱舍名為大不善地法。不信等八遍染心故名大随烦恼。俱舍无此大随烦恼。以前五法大烦恼摄。其后三种无别体故。所言忿者。依对现前不<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>境愤发為性。能障不忿执杖為业。為怀忿者多发暴恶身表业故。所言恨者。由忿為先怀恶不捨结怨為性。能障不恨热恼為业。為结恨者不能含忍恒热恼故。所言恼。者由忿恨為先追触暴热很戾為性。能障不恼蛆螫為业。谓追往恶触现违缘心便很戾多发嚣暴凶鄙麤言蛆螫他故。所言覆者。于自作罪恐失利誉隐藏為性。能障不覆悔恼為业。為覆罪者后必悔恼。在因及果不安隐故。所言狂者為获利誉矫现有德诡诈為性。能障不狂邪命為业。谓矫狂者心怀异谋多现不实邪命事故。所言諂者。為网他故矫设异仪俭曲為性。能障不諂教诲為业。為諂曲者為网冒他曲顺时宜矫设方便。為取他意或藏已失不任师友正教诲故。所言矫者。于自盛事染生染著醉傲為性。能障不矫染依為业。谓矫醉者生长一切难染法故。所言害者。于诸有情心无悲愍损坏為性。能障不害逼恼為业。谓有害者逼恼他故。所言嫉者。绚自名利不耐他荣妒忌為性。能障不嫉忧慼為业。谓嫉妒者闻见他荣深怀忧慼不安隐故。所言慳者。耽著财法不能惠捨祕吝為性。能障不慳鄙畜為业。谓慳吝者必多祕涩。畜积财法不能捨故。言无惭者。不顾自法轻拒贤善為性。能障碍惭生长恶行為业。谓于自法无所顾者。轻拒贤善不耻过恶。障惭生长诸恶行故。言无愧者。不顾世间崇重暴恶為性。能障碍愧生长恶行為业。谓于世间无所顾者。崇重暴恶不耻过罪。障愧生长诸恶行故。不耻过恶是二通相。以无惭愧皆不耻故。拒善崇恶是二别相。依无惭愧各别起故。不善心时随缘何境皆有轻拒善及崇重恶义。故此二种俱遍恶心。言不信者。于实德能不忍乐欲心秽為性。能障净信惰依為业。谓不信者多懈怠故。不信三相翻信应知。于实德能不忍乐欲。及于餘事邪忍乐欲。是此因果非此自性。言懈怠者。于善恶品修断事中懒惰為性。能障精进增染為业。谓懈怠者滋长染故。于诸染事而策劝者亦名懈怠。退善法故。于无记事而策勤者。于诸善恶无进退故。是欲胜解非别自性。言放逸者。于染净品不能防修纵荡為性。障不放逸增恶损善所依為业。谓中懈怠及贪嗔痴。于染净品不能防修。总名放逸。无别自性。言惛沈者。令心于境无堪任為性。能障轻安毘闵崮菫橐怠N接蓯干蜃孕赞?亍A罹闵?ㄎ蘅叭喂省4擞氤障嘤胁畋鹫摺N匠沼诰趁蚤湠樾浴U?衔蕹辗寝?毓省Q缘艟僬摺A钚挠诰巢患啪矠樾浴D苷闲袙紊菽λ??罏橐怠N接傻艟僮孕韵??A罹闵?ú患啪补省Q允?钫摺S谥钏?挡荒苊骷菫樾阅苷险?钌⒙宜?罏橐怠N绞?钫摺P纳⒙夜食樟钍?罟拭??睢9室猿漳疃鵀樽孕浴2徽??摺S谒?劬趁?鉃樾浴D苷险??俜笧橐怠N讲徽??叨嗨?俜腹省V?词腔邸N接沙展柿钪?徽??徽??9室猿栈酆蠟樽孕浴Q孕穆艺摺湔呒词窃彶畋鹨濉N逶痰仍啤&gt;涫侵罘ú畋鹪鲇铩H缢抵钚薪晕蕹5取H缙派车染溆形逯帧=褚来蟪司溆卸?帧R患???憔洹</p><p>论。第五无為法略有六种开曰。次下第五四所显示门。于中有二。初总标举数。后依数辨列。此初也。言无為者有其二义。一业烦恼所不為故。二生住等不迁动故。若有后义必具前义。若有前义或闕后义。二义俱闕唯是有為。二义皆具唯名无為。若唯初义有无為具。由此应作四句分别。一唯有為。即五取蕴。二唯无為。即真如理。三具二义。即诸圣道。四二俱非。即无漏蕴。今此六种是真无為。是不生灭真常法故。故集论云。若法生灭住异。可知是有為义。有為相违是无為义。六无為者带数释也。然无為数大小经论从三至八所说有异。若依小乘一切有宗。如俱舍论说有三种。所谓虚空择非择灭。皆异色心有实体性。若经部等说三或九。皆非实有。恐繁不叙。今依大乘从三至八多少不同。若<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>亦立三种。一谓涅槃。二谓虚空。三非智缘灭。若五蕴论及掌珍论至四无為。所谓虚空择非择灭及真如性。唯识及此说六无為。谓虚空等名如下列。瑜伽杂集立八无為。又开真如以為三种。為善不善无记异故。所以如是法教异者。理无為体无宽狭。而显广略开合异明。為显广开总别俱说。故显扬论开為八种。三性真如无别体故。总合為一故说六种。想受不动有其二义。若暂伏者非择灭收。若永害者则择灭摄。四义别说故开為六。断伏随明故合為四。性择别故虽四义殊。皆涅槃性故有三种。由斯诸教皆不相违</p><p>论。一虚空二择灭三非择灭四不动五想受灭六真如开曰。此依教辨列也。此六无為唯识不具。今引诸论共释之云。言虚空者。无障碍义。小乘唯约无色所显。故俱舍云。虚空但為无碍為性。由无障故色于中行。杂集瑜伽大同俱舍。大乘通约五蕴无说。故般若经佛地论云。五蕴无处说為虚空。不能碍物故名為虚。无色等故说之為空。虚即是空持业释也。言择灭者。是离繫义。婆沙论云。择者是慧。灭是彼果。择所得灭故名择灭。此中灭果有其二种一由惑尽。故集论云。是离繫果者永害随眠故。五蕴论云。由烦恼对治故诸蕴毕竟不生。显扬论云。有漏诸行毕竟不起。二由理显。故唯识论。灭诸烦恼究竟证会故云择灭。择之灭故依主释也。非择灭者。非离繫义。婆沙论云。不由择慧名非择灭。非择果故。此非择果亦有二义。一惑自不生。故集论云。是非离繫者不永害随眠故。俱舍论云。永害当生得不因择。但由缘闕名非择灭。二理性自显。故唯识云。不由择力本性清净。非择之灭依主释也。言不动者。不变异义。总摄三受分為二种。苦乐二受名為变异。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>无漏断此种子得第四定。由断彼故所得无為苦乐不行。名為不动。虽初静虑分得此定。以未尽故而不立也。故集论云。谓离遍静欲未离上欲苦乐灭无為。不动二字则非六释。如言无贪无离合故。想受灭者。即灭尽定。由观无漏為加行入。已此无漏观不断变异捨所得无為想受不行。名想受灭。故集论云。以离第三无所有欲。由止息想作意為先。诸不恒行心心所法恒行一分心心所灭所得无為。由想受灭得无為故。灭属想受。想受即灭。灭属无為。想受之灭。持业依主二释皆通。言真如者。无虚妄义。唯识等云。真谓真实。如為如常。表无变易故名真如。又集论云。何故无為名為真如。由彼自性无变异故。真即是如持业释也。若以六名对无為者。虚空即无為等皆持业释也。此六无為皆是假立。以此无為有二体故。一依识变假施设有。谓曾闻说虚空等名。随分别有虚空等相数习力故。心等生时似虚空等无為相现。此所现相前后相似无有变易。假说為常。似常住故立无為相。二依法性假施设有。谓空无我所显真如。有无俱非心言路绝。与一切法非一异等。是法理故名為法性。离诸障碍故名虚空。断障证会故名择灭。本性清净名非择灭。苦乐受灭名為不动。想受不行名想受灭。真如亦是假施设名。遮拨為无故说為有。遮执為有故说為空。勿為虚幻故说為实。理非妄例故名真如。故六无為皆是假有。离心真如不可得故。若依识变可有别体。能熏成种后起相故。若依法性皆但假名。依法性理义施设故。若识变者皆依他起。以所变相从因生故。依真立者皆圆成实。以依真如义所说故。除此餘说皆计所执。是有无等四种谤故。若识所变可通三性。随三性心所变起故。依真立者准是善性。以真唯是善净性故。识所变者可说周遍。依诸色体无碍相故。依真立者非遍不遍。遍与不遍皆无障故。此与五蕴不相摄者。以非聚集蕴积法故。而于法界法处摄者。有生长门种族义故。更有别义如理应思</p><p>论。言无我者略有二种开曰。上来已释一切法意。次下第二显其无我。于中有二。初总标举数。后依数辨列。此初也。若小乘宗明一无我。以一切法皆执為实。补特伽罗我是无故。今大乘宗显二无我。以一切法皆从缘起。离此无别能作者故。既离诸法无别我相。补特伽罗我相无也。说一切法皆无自性。念念无常非自在故。即一切法亦非实我故。即说為法无我也。然断若经说四无我。谓无我人眾生受者。能断金刚说八无我。谓有情命者士夫补特伽罗意生儒童作者受者。大般若经说十三种。于前八上更加无我生者养者智者见者。此等皆依前无我说。彼经所说无法相等乃至菩提皆不可得。则是此中法无我义。诸教同异皆不相违</p><p>论。一者补特伽罗无我二者法无我。开曰。此依数辨列也。此二无我唯识具明。略引唯识论文以释。然无我者对我相立。由所执我有二种相故。说无我有此二名故。应先辨二种我相。补特伽罗此译有二。若随俗译名之為人。随经典翻名数取趣。故新旧译有此二殊。法者即是轨持之义。我者乃是主宰為名。自在割断名為主宰。外道或执一切诸法有别实。我是能作者。即是补特伽罗我相。凡夫或执色等诸蕴皆有自性。是能生等。即是此中法我相也。今佛法中显我相无。是故此中显二无我。若离诸法有别实我。应一切法皆实常住。如能作者无变灭故。故瑜伽云。谓离一切缘生行外别有实我不可得故。若即诸法名為我者。即一切法亦非无常。以是自在实我相故。故瑜伽云。谓即一切缘生诸行性非实我是无常故。而此人法二无我义。广如俱舍唯识等说。此中人法皆称无我。即对人法皆我相论。而唯识中我与法别。我种种相為有情命者等。法种种相為蕴处界等。此依实义。彼约相增。以主宰义约人增故。偏就有情显其我相。故二空理我法又殊。若执实有自在常住。则一切法我义亦通。是故无我通于人法。若尔何故有其二执。依斯圣教说我相耶。答。依妄熏习假施设说。谓诸有情无始虚妄执实有我熏习力故。诸识生时变似我相。此二我相虽在内识。而由分别似外境生。如幻梦者。幻梦力故心似种种外境相现。缘此执為实有我相。此二我相各有二种。一者俱生。二者分别。俱生我执无始时来虚妄熏习内因力故。恒与身俱。不待邪教及邪分别任运而起。故名俱生。此复二种。一常相续。在第七识缘第八识起自心相执為实我。二有间断。在第六识缘识所变五取蕴相。或总或别起自心相执為实我。此二我执细故难断。后修道中数数修习。二胜空观方能除灭分别我执。亦由现在外缘力故非与身俱。要待邪教及邪分别然后方起故名分别。唯在第六意识中有。此亦二种。一缘邪教所说蕴相起自心相。分别计度执為实我。二缘邪教所说有我自性等相起自心相。分别计度执為实我。此二我执麤故易断。入初地时观一切法。二空真如即能除灭。如是所说二种我相。自心外法或有或无。自心内法一切皆有。是故二执皆缘自心所现似法执為我相。若离自心实不可得。故人及法皆无我焉。人法二我义乃无边。恐文繁广就略而述。乐博闻者寻广论文</p><p>大乘百法明门论开宗义</p></div>"
}]