[{
    "title": "大乘起信论广释卷第三.四.五 第2814部",
    "author": "昙旷大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷第三卷</p><p><a href=\"/fojing/dachenqixinlun/yuanwen.html\" class=\"keylink\" target=\"_blank\">大乘起信论</a>广释卷 第三</p><p>京西明道场<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>曇旷撰</p><p>论。又以觉心至非究竟觉释曰。下广二觉。于中有二。先明始觉。后显本觉。前中又三。总标<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>满非满觉。次广寄四相释成其义。后显始觉不异此初也。言心源者。有其三义。本觉真如為染心源。业相细念為诸染心源。旷识妄心為诸境源。前二通二释。后一唯持业。今所觉者依前二说。真妄动静极微细故。觉本觉心。本无所动。今无所静。现业觉业<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>本来无生今无所灭。觉此源者名究竟觉。即<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>位。始觉道圆同于本觉。是满觉故。纵有所觉未至此源。非究竟觉。即前诸位。始末同本非极觉故</p><p>论。此义云何至是不觉故释曰。下寄四相释成其义。于中有二。初正寄四位显其四相。后引经释成心源无念。初显四相。即分為四。此初觉相也。此义云何者问觉不觉义。下举四相而释其义。举前三位未至心源。释非究竟。举后一位觉至心源。释究竟觉。今应先明四相之义。然后依义释文显相。然四相义释者烦多。论意难知。今数四说。此中有义。所说四相即依动念剎那而说。心随妄动名生。生已逕停名住。住已衰变名异。异已迁谢名灭。然生已至灭。灭已复生。总摄四相名為生灭。是故但名生灭门耳。觉此四相故有四位。四位逆次觉四相也。故说凡夫能觉知等。有义。此说其理不成。若念迁谢名灭相者。即凡夫念应永不灭。觉灭相已则不灭故。异住等相為难亦然。若凡夫位虽觉灭相灭相仍在。应至佛位虽觉生相生相犹存。所起觉相何成利益。又既自说生已至灭灭已复生。既觉灭相不灭故不生不生故不灭。即应凡夫位离生灭念。住异等相為难亦尔。故此所说理必不成故。四相者应依识辨。谓由无明违平等性起业转现三种生相。相心今生成黎耶识。故业转现皆名生相。虽此一心為生。所生而亦非是我我所相。无明与前生相和合。迷所生心<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>我所。复能发起我痴我见我慢我爱四种住相。相前生心。今至住位起我我所。内缘而住。即所相心成第七识能相。四惑而為住相。无明与彼住相和合。不觉所计我我所空。复能发起六种异相。谓贪嗔痴慢疑恶见。相前住心今至异位。外向攀缘成六异识。故六<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>名為异相。无明复与异相和合。不觉外尘违顺性离。由是发起七支恶业。能灭异心堕于恶趣。故彼七支名為灭相。能相四相所至之位取境别相皆為心所。由本无明违平等性之所起故。所相之心所至之位取境通相而為心王。由从本心诸法总源之所起故。皆依心起名俱时有。有麤细故觉时差别。有义。此说理亦未然。别有能相所相法者。是小乘宗非大乘故。大乘四相但是假立于起有為无<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故。此中四相虽说虚妄。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所起非假说故。若由无明起业转现相。心今作业转等者。即业转现皆应有二能相二义异故。心若不作业转等者。如何能成黎耶生相。无三分心不成识故。又如何言能相。四相所至之位皆為心所。业转现三非心所故。又若业等皆生相者。三细唯应佛地所断。如何唯说断业相耶。应八九地非断转现说。是生相唯佛断故。细中之麤应非转现说。是菩萨所知境故。细中之细应皆三种许。是生相佛所知故。又业初起可名為生。转现后起寧生相摄。非由本识摄及是不相应。则今转现皆生相摄。转现非是初生心故。若说业识非是已生故兼转现皆生相者。则我痴等非是已住故兼四惑為住相耶。彼既不然。此云何尔。彼异灭等為难亦然。若我痴等為住相者。末那唯应四惑相应。唯许四惑為住相故。便违论说慧等俱起。既<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>身能觉住相。法身唯应能断末那。即不断染现色。能见皆应不断。非四惑故。便违论说。法身菩萨离六染中间四染。既此所离非我痴等。彼住相非谓四惑。若贪等六名异相者。计名执取何所摄耶。非于贪等能摄彼二执惑。行相极差别故。若断贪等名离异相。即此二染二乘不断。便违论说。执相应染二乘<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>究竟离故。又应<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>唯贪等俱说。六异相起意识故。便违论说触等俱起。故知异相非谓贪等。若七支恶是灭相者。即未觉时常起恶业永世恶趣。以未觉时有彼七支诸过恶故。生人天者应离灭相。离七支恶生人天故。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>二趣皆有异熟。岂恶趣业独名灭相。故知灭相非七支恶。既此所说不应正理。由此四相非同前说。今以二门略辨其义。一辨明。二别说。初总明者。心性本来离生灭念。而有无明动心令作生住异灭。故名相无别四相而作能相心。既由无明鼓心令动遂有微著不同。而先后际异。先际名為生相。后际最麤名為灭相。即彼中际名住异相。二别明者。对位分相。即九相中前之八相。生一住四异二灭一生相。一者即初业相。谓由无明动彼净心至此最微动念之位动念初起名為生相。论说佛地断微细念。细中之细是佛境界。故知唯业是生相也。住相四者。谓次四相。所谓转现智相续相。前二本识。麤分之位。是法<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>所住之境。后二事识。细分之位。是法我执能住之心。无明与前生相和合转彼静心。乃至此位行相犹细。但是能所别法执□住未别异故。故下论说法身菩萨觉于念住。麤中之细细中之麤菩萨境界界此四相总名住相。异相二者。谓次二相即是执取计名字相。无明与前住相和合转彼静心至此事识麤分之位。行相稍麤。依于异根取别异境起异执故。故下论说新发意菩萨觉于念异捨麤分别。麤中之麤凡夫境界。此麤中麤既是意识。意识即摄此二相故。故此二相总名為异。灭相一者。即起业相。即由无明转彼静心至此后际周尽之位。能令静心□于<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>如□伎人作牛马等。故下论说造种种业受果不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故。以此九相数处得名。或开九相。或本事识。意意识。或為六染。或名二碍。或辨麤细。故今细位说為四相。即指九染。非谓别指我痴等也。有义。此说亦未应理。既说四相皆非能相。不应起业。是其灭相能□静心是能灭故。四相何不摄。业繫苦亦名所起之妄相故。既生异灭无别能所。寧住相有能所四耶。应生异灭皆有能所。彼既不然。此云何尔。或住异灭皆名异住。随应皆有别异。执著能成能住异趣身故。彼既不尔。此云何然。若许皆通。便成难□。故此四相不应立也。若以论说念无异相念无住相必应立者。何不具言念无灭等。况新论说中间二相不言住异故不為证。下言心相生住异灭者。此义殊故不為证。谓显九相皆有生等。得无念者知此九相生起逕停衰变谢灭皆依心起无有<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。非谓别配前之八相。亦非四位别觉四相不同。初师不应為难。又言。四相俱时等者。谓即指其始觉四位。谓显始觉有四位相。而释经中四种禪义。非谓安立无明四相。新论但言如是知已则知始觉不可得。以于一心前后同时皆不相应无自性故。谓由无明起麤细念念起皆有生住异灭。而诸凡夫都不觉知念之起灭而受轮迴。今以本觉内外熏力觉念浅深有四位相。何要强立无明四相。若谓障谓二义相成勿违古人。故论立者。生一住四异三灭一。生一住四义如前释。异相三者兼起业相。起善恶等别异业故。由其异业令趣别故。是麤中麤。意识摄故。皆三贤等所知境故。灭相一者。即业繫苦。静心□為趣生相故。此是无明所起相故。是最后际终尽处故。至此方成<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>苦故。此释虽胜第三师义。而于至难亦未能净。后有智者辨而通之。然此四相唯一梦心。皆因根本无明之力。是故经云。无明住地其力最大。论说无明能生染法。正谓此也。虽复如是从微至著辨四阶降。然至始终意无前后。麤细鎔融唯一心故。故说四相俱时而有。若未达心源。随行浅深觉有前后。若达心源者。一念四相俱时而知。是故经云。菩萨知终而不知始。诸佛如来始终俱知。依此义说始谓生相终谓灭相。既因无明不觉之力起生相等种种梦念动恶心源转至灭相流转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>备受诸苦。今由本觉内熏為因善发闻熏而為外缘。体用融通同一熏故。益彼真如解性之力。损彼无明迷闇之相。渐白心源始觉灭相终觉生相。朗然方悟。觉了心源本无所动今无所静。平等。平等住一如床。无本始觉二相之异。即经所说梦渡河喻意在于此。举而说之。上辨四相。下释论文。既前三义不应正理。是故释文但依正义。即此第一觉相之中□下四义。一能觉人。二所觉相。三觉利益。四觉分齐。下三觉相其义亦然。如凡夫人者。是能觉人。在十千劫十信位中。以是位前都未觉念未离分别。故名凡夫。觉知前念起恶者。明所觉相。谓此位中心如轻毛随风东西数有进退。前念不觉于身起彼常乐等总而生惑著。即知所起心是恶也。能止后念令不起者。辨觉利益。既觉前恶后。即于身起彼<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>无我等相。而生厌离欣乐<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。不生灭著颠倒心也。虽复名觉即是不觉者。能觉分齐。觉恶能止虽复名觉。而不觉知举体是真妄生厌离。即是不觉。故经说云。说身无常而亦不说厌离于身我。今為汝说胜三修法。此即顺于四相义解。或此位中未达空理。不知一心本无动念。见有所起念念差别。前念不觉起烦恼。念后起厌心而欲除灭。觉念是恶随复名觉不觉念无则是不觉。故经说為愚夫所以行禪。七卷经云。渐次增胜无想灭定名愚夫禪。此释稍好。二论会同故。新论云。前念不觉起于烦恼。后念制伏令不更生。此虽名觉即是不觉</p><p>论。如二乘至名相似觉释曰。此第二觉相也。二觉相也。二乘观智等是能觉人。新发意菩萨是三贤位。十解初心名<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>住。举而等后云初发意。得人空门同二乘说。觉于念异等者。明所觉相。如前所说三种异梦从本静心无明眠起。此三乘人共智无我从异梦觉异相永无名。觉于念异念无异相。已捨麤分别等者。是觉利益。既此异相即是意识起。我我所自他异执随事攀缘分别六尘。名麤分别执著相也。名相似觉者。是觉分齐。虽捨如是麤分别执。而犹未得法空真理。是故但名相似觉耳。或此位中得我空真如。知彼真如本<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>念与无明念体相别异。由此但能捨麤分别。而未能知念即无念。非真觉故名相似觉。故经说為观察义禪。谓知自共相人无我已于法我随顺观察义禪。前释顺古违新论文。后释甚差两论快会。故新论云。觉念无念体相别异捨麤分别</p><p>论。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身至名随分觉释曰。此第三觉相也。法身菩萨是能觉人。初地能证遍行真如。显自法身遍满之位。乃至十地悉同<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。是故皆名法身菩萨。觉于念住等者。是所觉相。四种住梦无明眠起。既得法空真无相智。从住梦觉。住相永无名。觉于念住念无住相。已离分别麤念等者。是觉利益。即此所离法执梦念名為分别麤念相也。异前人我麤执但云分别。异后生相细念故云麤念。于一法执义说二言。名随分觉者。是觉分齐。虽得如是无分别觉。而犹未离微细分别。当复眠于生相之梦觉道未圆。故名随分。或此位中得真证智。念无念相皆悉捨离。名觉于念住念无住相。由此便能捨中分别。名离分别麤念相也。即经所说缘真如禪。故楞伽云。谓若分别无我有二。是虚<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。若如实知。彼念不起名缘真禪。前释顺古违新论。后释顺经兼快新论。故新论云。觉念无念皆无有相捨中分别</p><p>论。如菩萨至名究竟觉释曰。此第四觉相者。如菩萨地尽者。初明能觉人。文中总别显其二道。初句总标能观之位。即是金刚等觉之位。非谓十地名為尽地。以新论说為若超过菩萨地故。其次二句别明二道满足方便。是加行道即是满足之方便故。而新论言究竟道满足。举总取别。即加行道是此摄故。一念相应是无间道。其无间道一剎那中与理契会断细念故。如对法云。究竟道者谓金刚喻定。此有二种。谓方便道摄。及无间道摄。觉心初起等者。显所觉相。根本无明依觉故迷动彼静心令起细念。即是此中初起心也。今至此位方始觉知。离本觉无不觉。即动心本来静。如正迷时谓东為西。及其悟也西即是东。岂于悟时更有西相。故觉初心相也。故言觉心初起心无初相。或始觉心初始而起名觉心初起。故新论言。觉心初起始名為觉离于觉相。前释顺古违新论文。后释顺理不违二论。即经所说诸如来禪。故楞伽云。谓入佛地住自证圣智三种乐為诸眾生作不思议事。前三种位中虽有动念故言念无住等。今此位中动念都尽唯一心在。故云心无初相。是则心无初念相也。远离等者。明觉利益。业相动念。念中最细名微细念。即生相也。或细分别名微细念。不论别配无明业相。谓第三位觉念无念皆无有相捨中分别。今此位中觉相亦无。都无所得故离细念。新论但名细分别故。此念永无故云远离。远离虚相故真心性即得显现。故云得见心性。无明风止性海浪息永无生灭。故言心即<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。依此二义故新论言心根本性常住现前。前三位中念相未尽。是故不云得见心性。觉未至源。无明犹在。动彼静心。业识起灭。是故不云心即常住。名究竟觉者。结观分齐。未至心源。梦念未尽。始末同本非究竟觉。求灭此动。望至<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。今梦念息。觉了心源。本无流转。今无始静。常自一心。始异本得為如来。名究竟觉。若尔始觉既成常住。岂不违彼摄论所说。本既常住。末依于本相续恒存。乃至广说。蕴二意异。故理不相违。此论欲显本由不觉动彼静心。今息不觉还归本静。故成常住。摄论欲明依常法身起福惠行。所感报果既从缘起。故说相续始觉。万德要具二义。依前义故常住。依后义故生灭。生灭常住不相妨碍。以一一念悉通三世。虽遍三世不过一念如一毛孔。遍于十方。虽遍十方不增毛孔。佛德如是无障无碍。岂寧偏执于其间哉。如花严经颂此义云</p><p>牟尼离三世相好悉具足于住无所住法界悉清净因缘故法生因缘故法灭如是观如来究竟离痴或</p><p>是故二论各述一义同契至真不相乖也</p><p>论。是故至向佛智故释曰。下引经证。于中有四。一引经成证。二重释前文。三不觉之失。四觉者之德。此初也。是后三位能观念无皆名觉。故经依此说能观无念。為向佛智。谓因地时虽未离念。而观此念都无念相。能观如是无念道理。说此能观為向佛智。以是证知佛地无念。向佛智者。是证得义。故新论云。若有能观妄念无相。则為证得如来智惠。此是举因望果说也。若约因果通位说者。如金光明第二卷云。依诸伏道起事心灭。依诸断道依根本心灭。依胜拔道根本心尽。诸伏道者。谓三贤位。起事心灭者。即此论中捨麤分别执著相也。诸断道者在法身位。依根本心灭者。犹此论中所捨分别麤念相也。胜拔道者金刚喻定。根本心尽者。犹此论中所言远离微细念也</p><p>论。又心起者至即谓无念释曰。此重释前文也。此释伏疑重举前文。觉心初起故言又心起者。谓前所言觉心初起若谓觉。彼初起之心。则不名觉。有初心故。若无初心。则何所觉。所觉既无。无能觉故。若<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>心初起名觉。既有觉相。不应名觉。起初觉心是不觉故。如何前言觉心初起。显通此难故举此文。前说觉心初起相者。于所觉相无相可知。而言觉心初起相者。觉彼初心即无念起。如觉迷方知西即东更无西相是可觉知。知西相者谓即东也。觉心之时知初动念即本来静。所觉初心既不可得。能觉初相亦何所存。故云即谓无念。故新论云。心尚无有。何况有初</p><p>论。是故一切至无始无明释曰。此显不觉之失也。文中三节。谓标释结。是故等者乘前标也。是前无念名為觉故。除佛已还不名為觉。以从等者。释所以也。若除佛外不名觉者。何故前言随分觉等。以从无始至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>来无明之念念念相续未曾离故。新论意同前对四相梦之差别故说渐觉。今约无明眠之无异故说不觉。如仁王经同此义云。始从伏忍至顶<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>照第一义不名為见。所谓见者是萨婆若故。故说无始无明者。结不觉义。谓从无始而有无明。既依无明而起诸念。故有念者说彼皆是无始无明不名觉也。新论无此文义亦足</p><p>论。若得无念至无念等故释曰。此显觉者之德也。此中意说。若妄未息。不知一心本无相念。若至心源得于无念。则能遍知一切眾生心妄动故生住异灭心本不动实无生等。故新论言。若妄念息即知心相生住异灭皆无有相。以无念等故者。释通上义。佛得无念眾生有念。有无悬隔云何能知。以无念体皆平等故。眾生生虽念体即无念。佛无念体与彼平等。故能遍知诸念无念。新论无此文义似闕</p><p>论。而实无有至同一觉故释曰。上寄四相释成义言。此显始觉不异本觉。而实等者。初标不异。虽曰始得无念之觉。而觉四相方名始觉。然所觉相本来无起待。何不觉始觉别耶。以四相下后以释成。以彼四相无别自体可辨前后故言俱时。依于一心麤细之念故说觉时而有前后。言而有即前后也。非谓四相而俱是有。既离心外皆无自性。无有俱时前后可立。是故说言皆无自立。既本离心皆无自性。由此不离本觉真体故。言本来平等同一觉也。此总意云。既觉四相说為始觉。所觉无故能觉亦无。故无始觉异于本觉。或此真显始不异本。谓前所说四种觉相离于本觉皆不可得。故新论云。如是知已则知始觉不可得。以于一心前后同时皆不相应无自性故不异本觉。若作此释于理无违。令新旧论不相乖返。依此义故<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>云。十地即十地无所有何以等</p><p>论。复次至不相捨离释曰。上广始觉。下广本觉。于中有二。先明随染。后显性净。初中有三。标别辨相。此初标也。以随动门而显本觉故。言本觉随染分别。既<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>动而言生也。虽曰随染不失性净。故言与彼不相捨离。此所随染既有二种。故随此染生下二相。言二染者。一谓自染。即在因时由无明熏所起诸染。二谓他染。即在果时与生同体诸眾生染。随生相者。此中有义。谓随自染生智净相。以说从染得智净故。由随他染生不思业。以化染生起胜业故。有义。俱随自染而起。谓本觉心具有体用。随染显体成智净相。随染显用起不思业。既断自染方能起用。故不思业亦随自染。有义。俱随他染而起。谓诸菩萨<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>得果显现法身起诸业用。皆随眾生染有此事。若度染机无修无得。唯是真如一味相故。若尔此二应是始觉。答由二义故但名本觉。一约所对染差别故。谓始觉者对所俱染说。今此二相对所随染故。二约本有修生别故。以智净等依本有义说。其始觉者约修生说故。虽曰不一而亦不异。以所对染所俱所随皆依真有无别体故。以本始觉皆有修生本有之义无别异故。谓本来始更无异法。从此义故总名本有。以始契本方名本觉。从此义故总名修生。既以本觉作始觉故。即此本觉亦是本有修生。又以对始得本名故。即此始觉亦名修生本有。此缘起理犹如圆珠随举一门无不收尽故。智净等与彼始觉异不等皆无有妨</p><p>论。云何為二至思议业相释曰。此别名也。略以十门分别此二。一者释名。所言智者谓始觉智。净谓离染。同于本觉。果德作用故名业。非下地测名不思议。二相皆通持业依主。相者状也。本觉随染有此体用当相状故。即相之相二释皆通。二者出体。此二皆以生灭门中随染本觉而為自体。以说随染生二相故。三显体用。初智净相还净时体。不思业相还净时用。本觉有此当本末故。四者染净。此二俱净。以皆返染而显说故。亦可俱染。以皆随染之所成故。五约二利。初一自利。非无利他。谓以自他利為他自利故。六者三身。初通法身及自受用。后通<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>他受用。体相麤细二利断故。七者四智。初一镜智亦平等性。普照之智体故。后通三智。由得平等妙察性成化事故。八者二智。初即正体如理之智。后即后得如量之智。返照自体起外用故。九者因缘。初以体相内熏為因。初以体彼用大外熏為缘。后以智净為生起因。眾生染机為发起缘。诸法无有非因缘故。十者得果。初以对染同本智净為所生果。后以对机无方大用為所生果。既有因缘必有果故</p><p>论。智净相者至方便故释曰。次依名辨。于中有二。先明智净相。后不思业相。智中有二。初直明净相。后问答释疑。前中亦二。先因。后果。此初也。谓于地前真如教法内外熏力能修资粮加<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>根。故言依法力熏习。若登地上契证真如称真起行名如实修行。渐渐修习至金刚位因行既极名满足方便。故新论云。功行满足</p><p>论。破和合识至智淳净故释曰。此显果也。果有二种。所谓体用。由前方便能破和合梨耶识内生灭之相显其本觉不生灭性。此即根本无明尽故以无所念显本觉也。故言破和合识相。显现法身断惑显体即果体也。即于此时灭染心中业转现等相续之相故。今随染本觉之心遂即归源為淳净智。成于应身始觉义也。然此始觉无别始起。即是本觉随染作也。始同本故名淳。染缘尽故名净。断障显用即果用也</p><p>论。此义云何释曰。次问答释疑。于中有二。先问。后答。此初也。此问意云。如上所说动静心体举成生灭。若断生灭。应灭静心。如何但破和合识相灭相续心相显法身等。即执真同妄难也</p><p>论。以一切心至非不可坏释曰。次下简妄异真答。于中有三。谓法喻合。此初也。谓生灭相皆是无明。非是本觉体。有识相。觉与不觉体非一故。此无明相虽非觉体。而亦不离本觉之体。觉与不觉体非异故。由非异故而可坏。故涅槃云。明与无明其性不二。由不一故非不可坏。故下文云。除灭无明见本法身。前然非异可坏义故说离静无别动心。今依非一非不坏义说破识相法身显现。所望义殊不相违故</p><p>论。如大海水至湿性不坏释曰。此举喻也。文中显其四种喻相。如大海等者。真随妄转喻。水相等者。真妄相依喻。而水非动性者。真体不变喻。此显动者。非自性动。不尔动灭湿应灭故。若风止灭等者。息妄显真喻。谓显动者。随他动故动相灭时湿性不坏</p><p>论。如是眾生至不坏故释曰。此法合也。于中次第合前四喻。眾生净心等。如水随风动。水不自浪。因风起浪。风不自波。依水现波。故动即水。无别体也。心不自起。因无明起。痴不自动。因心有动。生灭即心。无别体也。心与无明等者。如<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>相依。以水全动故无水相。以动全湿故无风相。心全作识故<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>相。识无非真。无无明相。故梁摄论云。见此不见彼。若见一分性解分性不异。即生死故不见涅槃。即涅槃故不见生死。心非动性者。如水非动性。即显心性本非动念。若无明灭下。如水体不变。无明灭者。根本无明如风灭也。相续灭者。即业识等。如波相灭。智性不坏者。随染本觉。照察之性。如湿性不坏也</p><p>论。不思议业至胜妙境界释曰。次不思议业相。于中有二。初标。后释。此初也。以依智净法身之体起此应身功德之相。与眾生六根胜妙境界。故宝性论云。诸佛如来身如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无相。為诸胜智者作六根境界。示现微妙色。出于妙音声。令嗅佛戒香。与佛妙法味。使觉三昧触。令知深妙法</p><p>论。所谓无量至得利益故释曰。此辨释也。文有七句。显其四义。初之二句横显业德广多无量。次之一句竖显业根流穷三际。次之二句显业胜能无功应机。后之二句显业胜益利润不虚。即是根作真如大用无始无终相续不绝。故金光明经云。应身者从无始生死相续不断故。一切诸佛不共之法能摄持故。眾生不尽用亦不尽故说常住。宝性论云。何者成就自身利益。谓得解脱远离烦恼障智障得无障碍清净法身。是名成就自身利益。何者成就他身利益。既得成就自身利已。无始世来自然依彼二种<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>现<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>自在力行。是名成就化身利益。问。始得自利已方起利他业。云何利他说无始耶。答。有二义。有义。如来一念真智遍应三世。所应无前际。能应亦无始。犹如圆智一念遍达极三际境。境无边故智亦无边。无边之智所现之相故得无始亦能无终。不可难言过去眾生已入现世无所利应。以眾生体遍三际故。三际互融皆具有故。三际时分无定实故。说眾生界无增减故。前际若灭乃成减故。后际若生是增见故。故虽前际亦能利益。此非<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>思量所测。是故复名不思议业。有义。前说理未圆明。于正理教犹乖疏故。若说眾生体遍三际。是则便无利他之义。眾生与佛其体同谁。既眾生界前际不灭。亦即佛界后际不增。谁起化用无始应耶。若虽同体亦有利者亦可应说眾生利佛。以同一体成利他故。更有诸过不能繫取。故知此说理未圆显。应言利他说无始者不约所应无始而说。但约佛。佛体同而异。谓利他者即始觉也。始觉同本。其体不殊。本觉之体诸佛无别。觉体同故佛亦无差。前佛所化即今佛利。前既无始。今亦无初。故虽始得法身自利。而起应化利他无始。此既真用不待作意。是故名為不思议业。此与眾生心本无二。但為无明用则不现。若有厌求真用渐显。则于彼心称根现起而不作意。我现差别故云随根自体相应。现无不尽尽无不益。故云种种而现得利益故等。此等诸文新论少差。能寻其义不越于此</p><p>论。复次觉体至犹如净镜释曰。次显性静。于中有二。初总标。后别释。此初也。前就动门故说随染。今约寂门而言性净。此二本觉体既不殊。则不动而动。动而不动也。下文四义。其义既多。今先略以十门分别。一出体性。此四并以生灭门中本觉真如三大為体。而论但言觉体相者。且就因说未起用故。或体即相。非辨相大。二明染净。此四虽就性净而说。若约相论染。无染异。初二在缠相有染故名有垢。如后二出缠离染相故名无垢如。三辨次第。以显染无方明性净故。最初说如实空义。妄空德身成内熏因故。次又明因熏习义。由熏断妄真体显能故。次明其法出离义。依体起用作外缘熏故。后明其缘熏习义。四约<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。此四既是性净本觉。即是经说三佛性义。初一唯自性住后一唯至得果。因熏亦自性亦引出。法出亦引出亦至果。五辨因果。初二在因。后二在果。因中初举因体。次举因用。六明大义。初一唯体非相用。后一唯用非体相。因熏亦体亦相而非用。法出非用亦体亦是相。此分相门且作是说。若约鎔融。皆具三大甚明净义。此四既是性净本觉。虽说相染而性本净。即初二自性净。后二离垢净。自性净中。初一由妄空故。次一由具德故。离垢净中。初显净体。后显净用。八显大喻有四大义。犹如虚空故。虚空喻有四大义。空无一切相能含一切物。离垢显大空示现一切物。既觉与空具四大义。故言有四大义与虚空等。九辨净喻有四净义。犹如明镜喻有四净义。空无外物体。体净含眾像。出离诸尘垢现像為物用。由四净义如本觉故。故论说言犹如明镜。文中所言有四大义可与空等其如明镜。不言净义是译者失。新论具故。故彼文云。有四大义清净如虚空明镜。又此标中具举二喻。及下释中唯净镜义亦译者失。非本论意。新论具故。下文当辨十明同异。此中法出与前智净皆显法体。此中缘熏与不思业皆显觉用既无差别。何故别开前智净相。以始同本显于本觉能观之智。此法出离举出离义。显于本觉所观之法。前不思业约彼始觉随缘所现相属智用。由其根本随染本觉从来相关有亲疏故。今此缘熏依于本觉平等所现普益法用。由其根本性净本觉等遍一切无亲疏故。此约义门且说差别。能智法等实无有异。以始同本无别体故</p><p>论。云何為四至觉照义故释曰。次下别释。别释四义。即分為四。此初也。文中标释。下准此知。如实空镜者。标其名也。觉体不虚故言如实。于中无妄故名為空。无妄明净故喻之镜。此中略无虚空义喻。新论即具。故彼文云。真实空大义清净如虚空明镜。下辨相中总有四句。其上二句总标离到心境界相。其下二句释其所以。谓妄心境本无所有犹如龟毛。不现镜中故。望本觉非所觉照。觉望心境非能觉照。所照既无能照无故。故云无法可现。非觉照义故。故新论云。谓一切心境界相及觉相皆不可得故。若尔何故下文乃言世间境界悉于中现。答。彼约依他从真似现。不异真如故云即真实性。此约无别遍计所执实法可现故言无法可现。所显义别亦不相违。若尔所现依他似法应不由彼遍计执实。答。虽由执实体唯恒似。如因质现影。镜中不现质。不现质故无法可现。能现影故悉于中现</p><p>论。二者因熏至熏眾生故释曰。因熏习镜者。标其名也。能生觉果名之為因。此能内熏故名熏习。能现诸法故谓之镜。于中现法亦如虚空。文略不举虚空之义。故新论云。真实不空大义清净如虚空明镜。下辨相中文有三节。谓如实不空者。出因体也。以是万德真实体故。故新论云。谓一切法<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>成就无能坏性。由不空故方作正因故。不空者成因义也。一切世间下释其镜义。谓一切法悉起觉中。犹如镜中能现影也。言不出者。待缘力现不能自出所现诸法不出心外。如镜无质影不自出而所现影不出镜故。言不入者心随熏现不从外入。所现诸法不染真体。如镜变影不从外入。虽现染影不染镜故。言不失者。虽无出入不失缘起。虽现诸法不失自真。如影非出入不失所现影。虽现诸影像不失镜本故。言不坏者。所现同真非可对。谓随缘有无非可破灭。如影同镜非可异除。随质有无非可破故。新论所言不灭不坏唯得此义无不失义。常住一心者。会相同体以一切等释同所由。以缘起法心随缘现无出等故。离心无体。本来平等即是真也。如影缘现无出入等离镜无故即是镜也。又一切下释熏习义。谓性净故现染不染。亦以现染返显性净。既由现染方成不染。故云染法所不能染。以本无染今无始净故。本觉智未曾移动。亦由现染故云智体不动。非但无染為体。亦由净德无少故云具足无漏。即此净德内熏眾生令起厌求之心。故云熏眾生也。故胜鬘云。由有如来藏能厌生死乐求涅槃。十佛性中是业性故。能熏妄心起厌求等</p><p>论。三者法出至淳净明故释曰。法出离镜者。标其名也。不空体相故谓之法。从二碍显故名為出。破和合相故谓之离。淳净明故喻之為镜。应言淳净故名為空。以淳明故谓之為镜。文略不出虚空之义。故新论言。真实不空离障大义清净如虚空明镜。前明在缠不空如来藏。今显不空出缠之时身。宝性论云。有二种净。一自性净。以同相故。二离垢净。以胜相故。次下辨相释标中四义。谓不空法者。释前法字。谓前因熏不空之法。新论名為本性清净常安住法。出烦恼等者。释其出字。麤细染心名烦恼碍。根本无明名為智碍。断此<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>而显出。离和合相者。释其离字。出二碍故则不生灭。不与生灭不与生灭而相和合。离此识相成法身故。淳净明者。释其镜字。体离相故名淳。出惑染故名净。无痴闇故名明。淳净明故如镜。新论意同。不能繁举</p><p>论。四者缘熏至示现故释曰。缘熏习镜者。标其名也。用大外熏故谓之缘。令发<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>故名熏习。起善法影故喻云镜。谓此相大出缠之时而為镜智。起大作用為缘熏发眾生之心生厌乐等。名缘熏习。此诸行德是佛智影。即说佛智喻之名镜。故佛地云。大圆镜智能起眾生诸善法影。何故唯现善法影耶。以不善等如闇等质非是影像所起缘故。若说法身。周遍法界示现万化亦名虚空。故新论云。真实不空示现大义清净如虚空明镜。次下辨相。文复二节。谓依法出离故者。出缘熏体。遍照已下显缘熏相。依前出缠法身之体起大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>光明义用能照法界眾生之心随其所应示现万化令其修习随分善根。故云令修善根随念示现等新论少异。义不越此</p><p>论。所言不觉至分离本觉释曰。次显不觉。于中有三。初明根本不觉。次显枝末不觉。后结末归本。亦可三文。初明不觉体。次显不觉相。后结相同体。前中有二。初依觉成迷。后依迷显觉。初中复三。谓法喻合。此初法也。所言等者。初总标举不觉之名。谓不如等者。次显不觉依觉而有。念无已下。后显离觉无别不觉。次中三句。谓不如实知者。即能迷无明也。如谓称顺。实谓真实谓真实真如法。一者即所迷法也。真体一味无念名一。而有其念者即迷所成<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>心也。谓真一味能迷无明不称实知。而有虚妄八识之念。故名无明。然此无明离真无体。故言念无自性不离本觉</p><p>论。犹如迷人至则无所迷释曰。此举喻也。而新论言。迷无自相不离于方者。但语前后而意无别</p><p>论。眾生亦尔至则无不觉释曰。此法合也。本觉真如如正方所。根本不觉似能迷心。业等动念是如邪方。如离正东无别邪西。故言若离。觉性即无不觉。问為此本觉体自不觉為别无明名為不觉。此第有义。无别不觉。觉体自迷说為不觉。岂别无明异于本觉。如睡与寤体性无差。若互无者。常无寤睡。由无别故寤睡更起。若各别者则于一人亦睡亦寤。不应正理。觉不觉性当知亦然。若觉不觉互无性者。既无起妄亦无返迷。由觉不觉体无别故。自迷流转。自悟归源。若各别者。则一眾生半迷半悟。不应道理。由无别故。是故论言念无自相不离本觉。由此经说闇与明合。有义。此说理深乖返。觉名应互失故。起染归源应无定故。觉与不觉性各异故。如苦与乐性不同故。若断无明。觉便断故。说无明缘动性。因缘同体理不闻故。觉体便应自能动故。风与海水喻不齐故。故前所说理必不成。应说二义。其体非一。断灭无明显法身故。自性净心因无明动。能动所动体非一故。能熏香臭与所熏法能熏所熏亦非一故。真妄本来性非染净。由别缘熏成染净故。不相离故名不离觉。非觉不觉定同一体。故下论说。若如来藏体有妄法而使证参永息妄者。则无是处。由新经说灯破闇喻。有义。二说理皆不成。定一定异外道见故。无明非坏非不可坏。由与本觉非一异故。此所举喻水相风相随转微尘非一异故。各取一边皆当所难。合二说者义方具足。前所引文依一义。故觉不觉非一非异</p><p>论。以有不觉至自相可说释曰。此依迷显觉也。以有不觉<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>等者。此明妄有起净之功。若离不觉之心等者。此明真有待妄之义。良以依真之妄方能显真。随妄之真还待妄显。略说虽然。而广说者无明熏真所起分别。由此妄想能知名义故。对此妄说真觉名。然其真觉名体其真妄相待立名。直就真体都无名相。若离不觉无所待故无显说真觉自相故。下文云。染法净法悉皆相待。无相可说。此中意说。若离所待能待亦无能所寂静。终不可说觉与非觉。故楞伽偈云。远离觉所觉</p><p>论。复次不觉至相应不离释曰。次明枝末于有二。先明细相。后显麤相。初中亦二。总标。别释。此初也。无明為体本。三细為相末。不相离故名為相应。非谓王所相应之义。是不相应三染心故。无明起妄。妄起无明。是故名為相应不离。此及六麤先作二释然后消文义方明著。一约喻显意。二就识明相。初说意者。本觉真如其犹净眼。热翳之气如本无明。翳与眼合动彼静眼。业识亦尔。由净眼动故病眼生。能见相亦尔。病眼外视即有空花。境界相亦尔。以有花境分别好恶。智相亦尔。由此分别坚执不改。相续相亦尔。领顺违相起爱憎心。执取相亦尔。随其苦乐立名计著。名字相亦尔。既生贪嗔争而相击。起业相亦尔。被捉送官有所囚繫。业繫苦相亦尔。长眠生死而不能脱。皆由根本无明力也。约识辨相。略叙三释。有义。染心是前七识。此属七识有通有别。通谓九相皆属七识故初业相即自体分。其能见相即诸见分。第三现相即是相分。缘境执法故名智相。执相常流名相续相。依法执我名执取相。由执起名名计名字相。依起惑业名起业相。由业招报名业繫苦相。别而言之。业属第七。依无明动成妄念故。转属第六。依第七根转缘外故。现属五识。随其五尘对至现故。智识即是邪智故。相续即是诸识。我执多执常故。执取相者即是诸识。领纳受蕴。计名字相即是诸识。取像想蕴。起业相者即是诸识。思数行蕴。业繫苦相是五趣。果即是色蕴。故此麤细九种妄心是前七识。今知九相非是黎耶。有二证故知唯七识。一由二和方名黎耶。此中生灭是前七识。其不生灭是如来藏。融同一体是黎耶识。既此九种是唯生灭。非二和合故非黎耶。二以阿黎耶识说有无明。不觉而起。能见现能取境界起念相续说為意等。既依黎耶说有无明。不觉而起方是业等故。业识等是前七识。有义。前说不应正理。乖此论等诸教理故。经说真现分别事识。即应经有重言失故。论说现识一切时起。若是前七。应间断故。说阿赖耶现一切境。现属七识。违诸教故。所现境用既属七识。赖耶应无现境义故。识三细相名不相应。若是七识染相应故。又应业识非佛地断。许是七识菩萨知故。更有诸过。不能广举。故知九相通显八识。谓前三细定属梨耶。后有三分故说三细相。义如下说。若尔黎耶应唯生灭。业等唯是生灭心故。答。实由二义方成梨耶。义如前说。此偏举故。以彼六麤是七识故。故说境缘复生六相。亦即经说。于藏识海境风所动七识。波浪转。于中智相是末那识。经说。六识及心法智如是七法剎那不住以住。以此末那创有惠数执我我所得此名。故其相续相即是意识。论自说云。言意识者即相续识。依诸凡夫取著转深名意识故。餘是四蕴。义如前说。若尔末那应缘外境。便与经论所说相违。答。许缘六尘不违教理。金鼓经说。眼根受色乃至意根分别诸法。大乘意。根即是末那。能缘诸境。不违经故。如对法论十分别中相显现分别者谓六识身及意于器世界所受用义所取相中而显现故。意通缘境。亦不违论意。是意识不共所依。如眼与识得同缘境。由是此中应作比量。意根必与意识同境。是立宗言。以是不共所依必与能依同境如眼等五根。是随同品言。谓若不同境者必非不共所依如次第灭意根。是随远离言。既此比量于理无违。末那遍缘理善成立。不可难言。同能依识缘自体故有自见遍。诸心心所皆证自体。于一心中有诸分故。是故不废同一所缘。而诸教说不缘外者。以所现境不离现识。末那虽缘不计為外。不妨内缘六尘境相。有义。此说理教相违。唯说末那内缘执我。以是微劣任运一类无穷。别起我所见故。不尔何异第六意识非计内外可令相别。尚非我计我亦非外计外。故说心法智。即此智相是末那者亦非证成。末那心所非唯惠故。惠于心所非初胜故。非自所许四相法故。以诸心所助成心事名心法智。总為第七。非即末那名為智相。不尔本识既未有智。何不说為非心法智。意根分别一切法者。此中意根非末那识。意谓思量。此分别故。即说意识名為意根。意识亦名分别根故。如说眼根能受诸色。岂受相应能受色耶。经说境缘七识浪转。论兼说意显现分别。言总意别亦不相违。依本识见而起末那。依本识相别起五识。意识通缘见相而生。不尔诸识便无差别。既所引教不顺所宗故。所立理依似比量。宗有二过。一违正教。多处唯言有我见故。二违比量。乖不遍缘正比量故。因有二过。一有决定相违过失。违后施设正比量故。二有异品一分转过。诸共所依亦同境故。由是此中正比量云。有漏意根必不遍缘。自所餘境不共。所依六根之中随一摄故。如彼有漏意根应不能发无漏意识。理不相应故。又令末那与五色根等无差别。便成大过。使前所说理教相违。故知末那非谓智相。不能分别爱不爱故。应知六麤皆属事识。下五意中广显其义。何故不说末那识者。有二义故略不说之。一义准有故前说赖耶三种细相必有执我末那俱起。故<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>云。随彼所生彼地所繫。又瑜伽说。赖耶识起必二识相应。又由意识缘外境时。必依末那為根方起。故说六麤分别事识必有末那。义准有故。故麤细中略不说也。二义不便故。无明住地动本净心令起和合成黎耶识。末那既无此和合义。故三细中而不说之。又由外境牵起事识。末那既<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>外境义故。六麤中亦略不说。由此义故经中但说真识现识分别事识。餘义同前。委如下说</p><p>论。云何為三至不离因故释曰。次分别释。于中三细。即分為三。此初也。无明业相者。标其名也。谓由无明心起动故。谓无明即名业相。但是依主非持业释。依不觉者。释标中无明也。心动名业者。释标中业字。业有二义。一动作义。故云依不觉故心动名业。觉则不动者反举释成。既始觉时则无动念。是知今动只由不觉。二為因义。故云动即有苦。如得静时即是涅槃妙果。故知今动则有生死苦患。果不离因者。显动即苦。动因苦果无别时故。此虽动念而极微细。缘起一相能所不分。故无相论云。问。此识何相何境。答。相及境界不可分别。一体无异。此依黎耶业相说也</p><p>论。二者能见至则无见释曰。言能见者。即是转相。依前业识转成能见。故言以依动故能见。若性静门则无能见故。云不动即无见也。反显能见必依动义。如是转相虽是能缘。以境微细犹未辨之。如摄论云。意识缘三世境及非三世境。是则可知此识所缘境不可知。境不可知者。以无可知境故。如说<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>始不可知义。此依本识转相说也</p><p>论。三者境界至则无境界释曰。境界相者即是现相。依前转相能现境界。故云依能见故境界妄现。若无分别则无境界。故云离见即无境界。反显境界必。依此义云。譬如明镜持诸色像。现识处现亦复如是。此论下释现识中云。所谓能现一切境界犹如明镜现于色像现识亦尔以一切时任运而起常在前等。并依本识现相而说。此之现相尚在本识。何况业转微细于此而反说在七识中乎。问。此境界相為即是境為是举境显能现心。有义。但是所现境界说。依能见境妄现故。又说。离见即无境界。非有别心是所离故。又依转识说為境界。离转无别取境心故。又说。不知转识所现。不说别心是能现故。此三乃是识三分义。次前是见。此相分。故下五意中名现识者。依识所现从识得名。如说相分亦名為心。此亦应尔。故不相违。有义。不然违论说故。此境界相即下现识。不应说是所现境故。既说现识现一切境。不应境界复现境故。说如明镜现于色像。若唯所现喻不齐故。又说。对至即现五尘。非境对餘而现起故。又第三相得名為意。境无依止非意义故。经说境界现识处现。所现能现心境别故。前后诸文说依转识為境界者。依识体说如说离业即无见相。此亦应尔。故不相违。此文所标境界相者。前后影略互举见相。谓心心所四分合成业相即是证分。是最微细难知心故。转相即是识自体分。以是能缘向内见故。现相即是识之见分。能现境界向外见故。所现境界即是相分。所现所取外境相故。前二是内。是识自体依持别故。开之為二。后二是外。是识之用相带而起合之為一故。于前后互举见相。非谓第三唯是境界。此等并由根本无明动静心起成黎耶位。若尔事识应说此三。八识皆有诸心分故。道理实如是。但于细识破一异执。麤识易知义准有故。如于事识但说相应本识。岂都无相应义。论文巧约影互显耳</p><p>论。以有境界至生六种相释曰。显细相意以显麤相。于中有二。初标。后释。此初也。言境界风所动种种诸识浪腾跃而<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>。新论于境加虚妄言。意欲简别真如实境。真如既说非是境相。但言境界。是显妄也。然下六麤束為三对。初之二种依境生执。法执细惑地上断故。其次二种依执生惑。我执中惑二乘断故。其后二种依业受果。上品麤惑凡夫知故</p><p>论。云何為六至不爱故释曰。别释六麤。即分為六。此初智相由未无明不了现识所现境相皆是妄现无有体性。创起了别执实染净。名為分别爱不爱等。谓执染劣起不爱心。若执净胜起爱分别。故新论言。起爱非爱心</p><p>论。二者相续相至不断故释曰。依前分别爱非爱境而生苦乐觉念之心。常相续故名相续相。谓依前念分别爱境起乐受觉。于爱境起苦受觉。数数起念相续现前。此即自体念相续也</p><p>论。三者执取相至心起著故释曰。于苦乐境不了虚妄深起取著名执取相。谓即于前相续所念苦乐境上复深取著领纳不捨。故言心起著等</p><p>论。四者计名至名言相故释曰。依前颠倒所取境上取分齐相更立名言而生分别。名计名字相。故楞伽云。相名常相随而生诸妄相。故言依妄分别假名言等也</p><p>论。五者起业至种亦业故释曰。依前计名执著心故起贪等惑。发动身口造种种业。能招当来五趣苦果。此即惑业為苦近因也</p><p>论。六者业繫至自在故释曰。业因既成。依业受果。被业所繫。不得自在。循环受苦。名业繫苦。故言依业受果不自在等</p><p>论。当知无明至不觉相故释曰。上已广显枝末。此即结末归本。当知无明能生等者。初正结归。如前九相摄一切染。因本无明迷真而起。故云无明生一切染。以一切染法皆是等。释苦所以。恐疑染法多种差别如何。根本唯一无明。染法虽多皆是无明之气。悉是觉之相不异不觉。是故染法皆是不觉</p><p>论。复次觉与至有二种相释曰。上来已释觉不觉义。次明同异。于中有三。初总标。次别名。后辨相。此初也。前已别释。今将合明故。次前文复更标举。故云复以觉与不觉。前别明者。令知迷悟昇沈有异而生欣厌。今合释者。令知业幻非定一异而有断证。故言觉与不觉有二种相</p><p>论。云何為二至二者异相释曰。此别名也。染净齐真曰同。同义可表名相。染净体殊曰异。有殊状曰相。何故如是有同异耶。以体从缘故异。摄缘因归体故同。缘从体同故真如一味。体从缘异故凡圣两分。凡圣分故世諦义立。真如一故真諦理存。觉与不觉同异如是</p><p>论。同相者至微尘性相释曰。次后辨相。于中有二。初同。后异。同中有三。初举喻。次法合。后引证。此初也。种种瓦器喻染净法。皆以微尘而為性相喻染净法。以真為性。相者体也。亦即是性。非以此中性相言故即说微尘為器之性而说瓦器為尘之相。新论但言皆同出相。即显此中性相无别</p><p>论。如是无漏至真如性相释曰。此法合也。始本二觉名為无漏。本末不觉名曰无明。有用显现故名為业。而非实有故名為别。染净虽殊皆真為体。以动真如成此二故。此中相者亦即体性。非谓相望而言性相。新论但言真如相故</p><p>论。是故修多罗至无可见故释曰。此引证也。是前染净同真相故。经依此义说诸眾生本来涅槃得<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>等。总说虽然。别分别者。本末不觉即真如故。眾生即涅槃不复更灭。本始二觉即真如故。菩提亦本有非新得者。故此涅槃非待修习了因方证。故言非可修相。即此菩提非待生因而方起作。故言非可作相。此之二果既性本有非更得故。故言毕竟无得。亦无已下犹是经文。為遣疑难故论具引。谓有难言若诸眾生已涅槃等何不如佛现报化等色身相耶。故此初句释此义云。法性自体非色可见。如何更能现色相耶。故言亦无色相可见。又复疑云。若以法性非色可见不现色者。诸佛何故现色相耶。故下诸句释此义云。彼见诸佛种种色者并随眾生染幻之心变异所现。非谓不空智性之色。以智真体非可见故。故言而有见色等也。非谓智色不空性者。此文既倒释乖文耳</p><p>论。异相者至各各不同释曰。次显异相。于中有二。初喻后合。此初也</p><p>论。如是无漏幻差别释曰。此法合也。随染幻差别者。是无明法。以彼无明违平等性。是故其性自有差别。说本无明自性差别。我见爱染等烦恼依无明起差别故。诸无漏法顺平等性。直论其性则无差别。但随染法差别相故。故说本觉性德差别。又由对治彼染差别故。成始觉万德差别。如是二法虽现业用。皆是真如随缘显现。似而无体。通名业幻</p><p>论。复次生灭至意识转故释曰。广释立中心生灭竟。次释因缘。于中有二。先明生灭依因缘义。后释所依因缘体相。初中亦二。初总标。后别释。此初也。有义。生灭即是眾生。言因缘者即心意识。心谓黎耶。意谓末那。识谓六识。六皆依意总名意识。生灭眾生依心意识而得生起。故言谓眾生依心意意识转。有义。此说理极麤浅。心意意识自為生灭。如何说是生灭因缘。若彼眾生名生灭者。此心意识应非生灭。应言生灭。即前七识因缘即是本识种為现。本识中种為生灭因。识体现行為生灭缘。谓诸眾生依本识心有意意识七识生起。故言依心意意识转。有义。此说理亦未圆。乃说<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>大乘义故。即黎耶识自待因缘。应知八识总名生灭。言因缘者。有其三种。一者黎耶心体不守自性。是生灭因。根本无明熏动心体。是生灭缘。依此因缘依此因缘成黎耶识。二者现识心体复起麤识。是生灭因。外妄境界熏起诸识。是生灭缘。依此因缘起六麤相成其事识。三者以前因缘為生灭因。以后因缘為生灭缘。本末相依不相离故麤细鎔融唯一心。故依此因缘理方圆。显诸生灭相。聚集而生而為假者。故名眾生。唯依心体故言依心。即是黎耶自相心也。此假者眾生于一心即有五意及意识起。故言眾生依心意意识转</p><p>论。此义云何至说有无明释曰。次下别释。于中有三。先释依心。次释意转。后意识转。此初也。上言依心意等转者。义云何耶。故此释也。依阿黎耶识者。是上依心是生灭因。即阿黎耶二义之中本觉义也。说有无明者是生灭缘。即二义中不觉义也。依此因缘意意识转。故言以依黎耶识等。前标文略。但言依心。今此别释具显因缘。故说依心及无明也。问。前说依觉有不觉力动静心体方成黎耶。如何今说识有无明。有义。此中阿黎耶者即是本觉不生灭心。以此本觉不自知义说有无明。不觉而起即业识等前七识也。故前后说亦不相违。有义。不能违论说故说二和合方成黎耶。有觉不觉二义别故。若如所说。生不生灭觉不觉义应无别故。若尔便无和合之义。寧说和合成此识耶。应知依识有无明者。识有二义。谓觉不觉。前别就本故云依觉有不觉动而成识。今就和合总聚而说故言依识有无明也。有义。此释理亦未圆。今此意显真心為因无明為缘成黎耶识。应说依真有无明动成业转现阿黎耶识寧却就识说有无明。然后复言成业识等。许则便有两熏本识。应知此中黎耶识者唯取真心随缘之义。此随缘义难名目故。或就未起起说依觉有不觉。或约已起故言依识有无明。要就二名方尽其义。是故前后綺互言耳。然起未起虽义有殊。皆与无明為依止故。故于二处皆说无明。非总聚中而无无明。但非就于总聚而说唯依体说有无明也。问。若谓黎耶有无明者。如何会通诸论所说。谓瑜伽等皆说赖耶白净无记一向捨受。若有无明则成杂染。岂堪受彼染净熏耶。答。诸论且约麤义而说以為初入大乘人故。而实此识有本无明。今且略以三义明之。一迷无相不证真故。不尔此识应缘真諦。则一眾生半迷半悟故。二于果位镜智俱故。若因位无明餘识相应者。应果位镜智餘无漏识起。以于二位相敌对故。三于因位性无记故。若一向净唯名為善。则属真心。一向染者则名不善。唯属妄心。二心和合非定染净方成无记。若无无明。何以简染成无记耶。由此三义故知此识定有无明。然其无明有麤有细。麤在事识。细在本识。论许无明在事识者。且约麤相说麤相说麤无明。不妨细者亦在本识。若尔如何受熏持种。既有无明违善熏故。答。虽有无明性非不善。受善等熏于理何失。若无无明一向清净。如何受彼不善熏耶。故受熏者要有无明。不应举彼七识為难。以其无明麤细异故。况受熏体唯是真如。是故赖耶受熟识者。但是如染净分位引迴心者。假就麤相言彼受熏不违教理。若尔佛位亦应受熏。以有受熏真如体故。此难不然。无无明故。离和合相淳净明故。既无能熏非所熏故。由此汝宗佛应受熏。有净能所可熏体故。不可说言满故不熏。以非质碍能所熏故</p><p>论。不觉而起至故说為意释曰。次释意转。于中有三。初略明意转。于中有三。初略明意转。次广显转相。后结成依心。此初也。此中即显五种识相。不觉而起即是业识。能见转识能现现识能取境界即是智识。起念相续即相续识。此既无明迷真所起妄而有。前三成黎耶识。二迷妄為实起。后二相其事识。既此五种合為二识。由二依义总名為意。一本末依。末依本故。前三為本故说為意。二麤细依。麤依细故。后二细故。复说為意。其麤意识非本非细无所依义故不名意。但有分别故名意识</p><p>论。此意复有五种名释曰。广显转相。于中有三。初举数总标。次依名辨释。后显其功能。此初也</p><p>论。云何五至不觉心动故释曰。次下辨释。别释五意。即分為五。此初也。名业识者。标其名也。即九相中第一业相。前对无明故為相。是无明体之相状故。此对真心说名為识。依心所依意故。识成意故。下准此知。无明力者。举所依缘也。明心不自起。起必有缘。不觉心动者。正明业义。谓起动义是业义故</p><p>论。二者名為至能见相故释曰。名转识者标其名也。依于动心者举所依缘也。能见相者释转识义。谓依无明转前业识成此能见故名转识。依识圣教转识有二。為无明转成能见者在本识中。如其境转成能见者在事识中。此中转相约初义说。瑜伽论等说七识等名转识者依后义说</p><p>论。三者名為至常在前故释曰。此文有三。谓法喻合。所谓等者。此举法也。如镜等者。此举喻也。谓此心体无明熏对现种种境。如镜对彼差别质故现种种影。现识亦尔。后明法合。其初二句正合前喻。无明熏真自有二种。一本无明与心和合冥熏静心成三细识。二末无明与心别异对熏动心起六尘境。末无明者即诸烦恼起业熏识生五趣境故。言尘对至即现。非对五尘方起现识。此所现境宽狭云何。诸圣教中所说有异。十卷经云。阿黎耶识智名识相所知体相虚空中有毛转等住不净相所引境界。又有文云。何黎耶识分别现境自身资生器世界等一时知等。瑜伽论说。此识能了二境故转。一内二外。内有三种。谓五色根根所依处所含藏种。若生无色唯了种子。外谓能了器世界相。唯识等论皆与此同。旧中边论说此能了四种境界故。彼偈云。根尘我及识本识生似彼。何故如是诸教。随译者异。非本经论即此差殊。于四七卷二楞伽经但同后文都无前语。但是译者妄加经文。或失本意。故不可依。新中边论不说赖耶缘我及识。故彼颂云。识生变似义。有情我及了。识言通三。谓八七六。此三生时随应变似。根我了别三种境义。旧中边偈妄加本字。长行仍谬。亦不可依。由此但就瑜伽為正。顺楞伽经三本文故。又既此识不能计度。是故不可缘我及识。而论说现一切境者。所谓内外一切境也。有义。此说其理未圆。不能会通诸经论故。若谓本识不缘我者。不应说為虚妄分别。若不证实名虚妄者。岂不由执不证实耶。若无计度故不执者。与证真智有何差别。既许此有自性分别。何不许有自性执耶。不尔如何瑜伽说此缘计所自性习气。若不言唯故无执者。岂说唯缘非执种耶。若有漏善虽不证实亦无执者。此不為倒。意与六识為染净。根与有漏善為漏性。故约无不善有覆无明所起麤相言无执心。何妨亦起无覆无记微细无明所起我相。许此执我理既无违。由是亦能变似识等。若此识变必有实用故能变诸识相者。则应诸识实用都无不是。本识实所变故。若谓诸识所有实用别从此识种子生者。外器亦可但从种生。本识不应别变器等。若谓器等但是相分不可变识為相分者。意是意识不共所依。如五色根变缘何失。若相分心无能缘用故说此识不变心者。亦应不缘诸识种子。种子现行性相同故。若谓种子无能缘用故本识缘识非倒者。则种与现本末因果性繫地等一切应殊。如是推微。故知此识亦缘诸识于理无爽。是故经言。知名识相住不净智所行境界。若尔如何会通诸教。答。诸教所说亦不相违。不言唯缘如此法故。不说餘法非所缘故。虽无相违而有不同。不同之意叵得闻乎。不同之意各有道理。中边及经明现起法皆是识变。唯说现行。习气种子其相不现。与识无异。故略不说。瑜伽為显相不离见故。除识外是所了别。诸心心所离识不立。其义自显故说之。而实此识通缘一切。以有随自他分境故。论言能现一切下合。唯言现五尘者。且举麤显以合镜喻。故前后文亦不乖越。其后三句简异诸识。以一切时等者。此简意识。此所藉缘无时不具。故一切时任运而起。彼所藉缘时多不具。于五位等有间转故。常在前者。对简末那。末那虽常任运而起。非诸识本故非在先。今此黎耶是诸识本。在诸识本在诸识先。故言常在前也。非谓五识对五尘现而常在于意识。前起五识不能现一切境。非一切时任运起故。但随五尘惑业因对故。所现尘无前后耳</p><p>论。四者名為至染净法故释曰。是事识中细分法执不了前心所现境空而起染净胜劣分别。故言分别染净法也</p><p>论。五者名為至不断故释曰。此亦事识细分之位。此细事识法执相应执无断故名相续识。若谓此二是事识者。寧意识中方立名耶。答。以彼亦麤有通别名。通名事识。别名智等。如三细相名亦通别。通名黎耶。别名业等。下意识中方立名者。增显更说影显前故。如现境相说為黎耶。而赖耶名亦通业识。又依我见立意识名。岂意识名唯属我见。许则二乘应离意识。寧说二乘意识熏习。又此黎耶所现境相既是此中所分别事。此于彼境染净苦乐觉念分别。寧非事识。不尔此是何识所收。不应说是七八二识。末那不缘外境相故。本识不起染净相故。故属属事识其理必然。不可难言此二亦我执。虽同事识麤细各别故。如业转现同本识体。业识未有能所相故。若如所难二执无别。便与诸教极相违故。故此但是细分法执同名事识。于理无违故。故此但是细分法执同名事识。于理无违。若尔寧说事识熏习能受凡夫业繫苦相。答。此事识者通法我相。彼就具足二相处说故。事识熏习凡夫苦。若二乘人唯有法执。虽有熏习无业繫苦。已断我相发业用故。如八九地离现见染。岂得说无本识心耶。此亦如是。故唯法执亦名事识。于理无违。若尔六染為是识体。為是事识体应心所。答。是事识体非谓心所。说是所起事识心故。说為不断相应染等。与染心所相应义故。说意识者。即相续识。故知诸染无别体。故但名為意及意识等。非是相应心所义故。事识心所即未无明。乃是能起见爱惑故。此六不摄见爱烦恼。皆是见爱所起识故。随业用别假立多名。如业转现但一识故。由与彼等心所相应而于一识开此诸相。非谓诸相即是心所</p><p>论。住持过去至不觉妄虑释曰。此即第三显功能也。有义。此显五意功能。前但别明五意自相。此总熏显五功能故。非谓别显相续之义。前九相中无此文故。住持过去无量等者。显前三细本识功能。由业转现黎耶识故摄藏诸法善恶业种。故能住持过去多生善恶之业令其不失。此明本识能持种子。摄业种令不失故。随善恶种生善果故。能成就现在未来果等报无差违也。此明本识能起现行能令现在已逕事。下显其后二事识功能。由彼事识法执分别故。能念虑三世之事故。言不觉妄虑等也。有义。但显事识功能。由此能令三世因果不断绝故名相续识。前九相中且约自体。此更就能释相续义。非谓通显五功能也。不尔现识现五尘等。所有义相应通前二。意识起惑。于业有三。一起见惑。发未起业令起。二起修惑。润生未熟业令熟。三双起见修。引未生业令生。由此能令生死相续。今此文中但举后二以能起此润业烦恼。引持过去所发业种不失功能。令成堪生来果之有。故云住持乃至不失。又為能起引业烦恼能使已熟善恶业种随其所应灭彼异熟业果相应。故云成熟无差违也。此则引熟令生如是三世因果流转连持不绝功由意显识用麤。有是功能故依功能名相续识。次举念虑三世之事显别智识微细分别。故言能令乃至妄虑</p><p>论。是故<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>至六尘境界释曰。上显意转。次下结明依心之义。于中有二。先正结属心。后释疑广辨。此初也。文中二节。初顺结三界。言是故者。是前一心随无明动作五意故。是五种意依心成故。而此五意总摄三界。故说三界唯一心转。妄念似现曰虚。诈现实状曰偽。或相有体无名虚。体无似有名偽。虚偽之相虽有种种。能究其因<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>所作故。云<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>三界唯心离心等者。此反结六尘也。离彼现识即无六尘。反验六尘唯是一心。故云离心无六尘也</p><p>论。此义云何释曰。次下释疑。于中有三。初问。次答。后结。此初也。现有尘境异心可见能取所取了然差别。三界六尘固在心外。此唯心者义云何耶</p><p>论。以一切法至无相可得释曰。此答也。文有七句。总分三节。即初三句正答前问。以业相等皆因心起。缘彼无明妄念熏生。既五种识不离于心。故离一心无六尘也。或可。境界皆是此心。随熏所起更无异体。由汝妄念而生异相。故楞伽云。身资生住持如梦中生。若有能取所取相者。梦中所见应有二相。如梦中无二相也。既因此答转起。疑云。念不孤起。託境方生。若无异境。何所分别。故此二句释此难言。一切分别非外分别。如依于面自见其面。梦中所见自见其心。是故经云。无有少法能取少法。即其义也。故言分别分别自心。若尔便成能见所见。何故前言无二相耶。故后二句遣此疑云。為遣尘执说见自心。实非以心而见心也。心尚不起。何有见乎。以本真心无见相故。问。如集量论说诸心心所皆证自体名為<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>。不尔于自心应不能境故。何故今说心不见心。答。二意异故亦不相违。彼约俗諦安立道理。于其妄心开為诸分。故说自证能见见分。此约真实证会道理。说本真心元非动念。既无见故非能所见。若唯俗諦所显亦殊。此显见分不能自见故。以指刀為同法喻。彼说自证能见见分故。以灯焰為同法喻。设唯就真所显亦别。彼说智如能所证别有见可证。以心见心。此说理智既无别体。无见可证。心不见心。此真俗举体通融。说无不当于无故不坏于有。说有不当于有故不乖于无。无不乖有故宛然有而即无。有不妨无故宛然无而即有。由是二论不相违也。即由此中心不见心无相义。故楞伽颂云。非他非自缘。分别分别事。五法及二心。寂静无如是。即前二句依识遣尘明唯识观。今此二句依真遣识明真如观。法门虽二所证是同。但一观成则证外观。故瑜伽论问此义言。诸观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>见遍计所执无相时。当言入何等性。应言入圆成实。若入圆成实性时。当言遣何等性。应言遣依他起。旧中边论亦显此义。由依唯识故境无体义成。以尘无有故。本识即不生。故唯识成即无有识。以识无故便证真如。故知二观同所证也</p><p>论。当知世间至而得住持释曰。次下总结。于中有三。初显依妄有境。次显境体亦无。后结释所以。此初也。言无明者。根本无明。言妄心者。即业转现。世间境界杖此而成。依之而住。不失自体。故言依妄得住持等。若尔劫坏餘残世界谁无明妄所住持耶。答。总详诸教有其四释。有义。眾生本识妄心于所变境為二因力。一為生因。由种势力生近正果故。二為引因。引远残果令不顿绝故。内身既尔。外器亦然。故劫坏时虽无眾生。无明妄心為正生因。由前识中种有引力故。世界不即顿空。此能引力既本是心故。所引果亦妄心也。有义前说其理不然。诸□死时身器顿灭。彼时何无引因力耶。若生界法应顿灭者。此何不尔要色引因。设尔残界应心外有现。无妄心所住持故。由此应说妄心所变有共不共四种句义。故此世界共所变起。或共受用不共受用。虽不共用必共变起。是故设生他方自地彼无明妄亦得住持。如死无心餘变骸骨他变残界。其理善成。有义。此说亦未应理。<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>成坏必同。无有彼此住坏异故。若大千外世界隔远。彼识不能变此界。故不尔。残界应永不空。诸界眾生常共变故。不应倒彼餘骸為救。界地异同远近别故。应言世界将坏之时有得通者往来持用彼识亦得变此残界。如诸圣者往恶趣中必变彼趣而往来故。不尔残界圣应不见。既照见者必变而缘不变。便取外境。故通者变其理。善成有义。此说理亦未然。论说境界皆妄心持。得通圣者无妄心故。设许圣变非利益过变残世界无所用故。若由照见法尔变者。应同凡夫有所缘故。若由往来故所变者。界应不空。常往来故。若有為法自灭坏者。则因于果无力用故。不尔残界尚有眾生往恶趣者不同倒故。应言残界虽无人等必有别类重罪眾生彼识故得变此残界。如人骸骨本识虽无餘鬼畜等所变住故。说前<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>亦杂人间不遮无间移处所故。说诸地狱处不移者。是小乘宗非大乘故。既彼劫坏不无眾生。即彼妄心变残世界。彼眾生尽世界方空。如灯炎灭光乃无故。故诸世界妄心持也</p><p>论。是故一切至唯心虚妄释曰。此显境体亦无也。如镜中像无实体故镜内镜外皆不可得。境但是心虚妄现故。心外心内亦不可得。若尔诸境四义不成。无外境体。唯心妄故。二十唯识难起颂云。若识无实境。则处时决定。相续不决定。作用不应成。答。如梦中境。虽四义成实无别境故。寤时境虽有四义。亦不离心。亦如饿鬼同见脓河。又如地狱同见狱卒。虽无实境。四义亦成故。诸境界唯心虚妄。即二十论答难颂云。处时定如梦。身不定如鬼。同见脓河等。如梦损有用。一切如地狱。同见狱卒等。能為通害事。故四义皆成。若尔善恶应不成。业如梦所见皆无实故。答。理实善恶无实自性。皆虚妄心之所起。故随自执心成彼业果。若如实知无所有。故依如义是故。经颂云。譬如灯破闇一念尽无餘。诸业之闇冥多劫所熏聚牟尼智灯照剎那速灭除。如是等义诸经非一。故彼善恶亦是梦心。如其心妄业亦然故。若尔<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>不断彼命亦无怨等无外境故。答。见生杀命亦是妄心。无生及命无所杀故。谓有為法性自无常。于念念中无住性故。实无能杀所杀二相。但二妄心互相成故。由此念念妄熏习乃成决定怨业等。故二十唯识颂此义云。展转增上力。二识成决定。长行广释广叙引之。如<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。佛依此义破彼闍王杀父罪执。故说蕴空无能所杀。除彼妄心罪自无故</p><p>论。以心生至法灭故释曰。此结释所以也。所言境界心妄现者。以无明力不觉心动。由此能现一切境故。故言心生种种法生。即心妄动而言生也。若妄心灭境随灭故。诸分别识皆灭无餘。故言心灭种种法灭。即心源静故云灭也。既说此心妄现诸境。即验诸境唯心无体。问。上以九相结属无明。今此五识何归心耶。答。前显一心成彼生灭。九染相者。功由不觉故。以九相结属无明。今此因缘和合道理成辨。诸法唯属于心故。以五意结归心也。答。随义增影略而说。非于二处无心无明</p><p>论。言意识者即此相续识释曰。次显意识。于中有二。初标。后释。此初也。明此生起虽麤细殊同是一识更无别体故。即指前第五识相故。言即此相续识也。前胜细分法执相应所止义门则说為意。此约能起见爱麤惑从前起门说名意识。意之识故名為意识。而新论言。一切凡夫依相续识执我等者。即是依前相续法执一切凡夫执我我所。论说我执我等者。即是依前相续法执。一切凡夫执我我所。论说我执依法执起如。要迷杌方谓人。故非谓迷于续本识。凡夫依此执我我所。有此说者皆為谬释</p><p>论。依诸凡夫取著转深释曰。次下别释。于中有五。一约人辨麤。二其麤体。三明执所缘。四製立其名。五明识所依。此初也。简非二乘所起意识。以前智识及相续识通在二乘地前所起故。今约凡显其麤也。以彼凡夫无对治故。追著妄境转极麤显故。言取著转深也</p><p>论。计我我所种种妄执释曰。此出惑体。非直心外计境為麤。亦复于身而计為我。于诸尘境计為我所。即蕴离蕴或执与蕴非离而计為我。乃至能起六十二见。皆是此中种种妄执</p><p>论。随事攀缘分别六尘释曰。此明执所缘也。但缘倒境不了正理故皆名為随事攀缘。随事何谓。取六境故。分别六尘名随事攀缘也</p><p>论。名為意识至分别事识释曰。此製立其名也。既缘六尘应名六识。而今就其一意识义故不别出眼等五识。故涅槃云。譬如一识分别说六。金光明经。心如幻化驰驶六尘而常妄起分别诸法。故缘六尘但名意识。即此意识依于六根别取六尘。故名分离。又能分别知来内外善恶因果种种事相故。复说名分别事识</p><p>论。此识依见至增长义故释曰。此明识所依也。见谓五见。即见道断所有分别发业烦恼。发业惑中见最强故。举此亦摄分别贪等。即五住中见一处住地。爱谓贪爱。<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所断所有俱生润生烦恼。润生惑中爱最强故。举最强故举此亦摄俱生痴等。即欲色有爱三住地也。此能增长事识义者。有义。但增我等麤执说依凡夫取著等。故说二乘人断见爱惑。但离第一执相应故。二乘虽无见爱烦恼。未离分别事识心。故说相续识。亦是事识必非见爱所增长故。说由法执起我等惑。不许烦恼起法执故。言见爱熏成事识者。言说识中所有我执如事识熏起凡夫苦。岂二乘等亦有此耶。故增长者但是识中我等麤执非事识体。谓由境界资熏现识起彼智相及相续相。成事识中法执念相。复由见爱熏事识中法执念相起我等执故。说我执从诸执生。见爱既是凡夫所有熏起我执故。说依凡取著转深说意识等。由此二乘虽断见爱离我等相。而犹未离分别事识。非彼起故。若作此释。妙快理教。有义。此说其理不成。与论文义极乖返故。说见爱熏能成事识不说熏起我我等故。说六染相皆是事识。六染皆无我等义故。我见即是见爱所摄。能熏起他非自起故。诸识皆有依他之义。事识必依见爱生故。说见爱惑亦是无明必有熏真起识用故。既本无明熏起本识。未应如彼起事识故。不尔事识非无明起。不许见爱所熏起故。若谓事识但境熏起非见爱者。我见亦有境熏起义。寧不许然。境有增长取熏义故。若谓事识通法执故不许烦恼所熏起者。于起我执寧则许然。诸论不许惑生执故。应知事识理有法我二种相故。二执相应事识既非即二执体。见爱熏起于理何乖诸论。不说见爱烦恼起事识者。且随麤相。据实亦有起事识义。谓此事识相应心所必有助成心王之义。故说作意惊引心等。心所既多。见爱惑摄。熏起事识于理无违。彼有漏位非解脱分善根所摄。诸善心所从无明起皆此所摄。事识必与善相应故。此既麤动异。于本识必二缘生。一谓境界。二谓见爱相应心所。由此论文互举其一。或说境界之所熏起。或说见爱所增长生。合前后说义方具足。故二乘等虽离见爱有妄境故未离事识。若尔未离执相应染。以有能熏我相境故。答。境非实我得我空智。不為妄境之所熏故。而说依凡夫取著转深及事识熏起凡苦者。谓事识体在凡夫位。取著既深。复起我执发五趣业受凡夫苦。非谓熏起我等麤执。是故见爱所增长者但是事识。其理极成</p><p>论。复次依无明至唯佛穷了释曰。上明生灭依因缘义。次下熏显因缘体相。于中有二。初略明缘起甚深之相。后广显缘起差别之义。初中亦二。先标叹甚深。后释甚深所以。此初也。前已直明缘起之义。此下重约甚深以显。故言复次无明熏等。无明熏习所起识者标缘起体。即本净心是缘起体。為无明熏习所起识者标缘起体即本净心是缘起体為无明熏起诸妄识总。名无明熏所起识。非谓偏取真及妄分。非凡夫能知等者。此凡小绝分。于此根本缘起之理。凡夫业信具彼五住二障碍故。而不能知。二乘虽证由无明住智障碍故亦不能觉。要由此理。是故经言阿那识甚深细。我于凡愚不开演。谓诸菩萨已下菩萨分知。菩萨从初正定信位而发意言比观观察。至地上分分证之。知因真如随缘成识。既能观证故佛為说经。依此义而有颂云。故名阿赖耶胜者我开示。以诸菩萨无明住地未断尽故。业识未亡。纵至第十究竟地中。亦未尽知缘起之理。唯佛穷了者。明佛能知。无明断尽觉道圆明。故能尽知一心缘起</p><p>论。何以故至唯佛能知释曰。此释深所以义也。缘起妙理贯通凡圣唯佛穷了。何以故耶。下答文中有其三节。初明即净而常染。是心本来自性净者。谓即本觉缘起真心据本而言。自体无染非别净法可令净。故此即总显缘起因也。而有无明者。即依心体有此无明不觉缘也。此即显其缘起之缘。為无明染有染心者。心体為此无明所染。而净心体有染心也。此即显其缘起之相。总是释经不染而染。显有染心等者。次明即染而常净。谓本觉心虽被所染。常有染心性自真故。而不不失本净心性。是释经言染而不染。唯佛穷了者。明佛能知此理既深。非餘尽了故。缘起理唯佛能知。故胜鬘云。自性清净心难可了知。彼心為烦恼所染。亦难可了知。楞伽经云。如来藏是清净相。客尘烦恼垢染不净。我今与汝及诸菩萨甚深智者能了分别。今论释此显甚深也</p><p>大乘起信论广释卷第三</p><p>大乘起信论广释卷 第四</p><p>显无明缘起之由。后显缘起染心之相。此初也。是□上言虽有染心而常恒不变之言虽染而有染心常不变作能所念染。故以念染释其不变。一以自性常明洁故而不变。作能念之染。二以自性非可取故而不变。作所念之染。故新论云。虽有染心而常明洁。无有改变。复以本性无分明故。虽复遍一切境界。而无变异。此虽文略而义即具。故言无念名為不变</p><p>论。以不达至名為无明释曰。此显无明缘起之由释上而有无明义也。有义。不达即是自心无别。无明名為不达。谓自不了平等一味。与自本心不相应故。名為无明。无别法故。有义。不能违上所说。无明所染有染心故。能染所染因缘及果缘起体相有差别故。若如前说。觉即不觉。即当如前所破过失。若谓与心不相应故名无明者。即前三染应是觉悟。言相应故。由是别有能迷无明。虽不离真非即真体。是不了达无念法界最极微细即心之惑。此正应言不相应心。未有能所王数别故。言中倒故云心不相应。非谓与分不相应也。故新论云。不觉一法界故不相应。无明分别起唯此能為诸染之源。更无染本。故言忽然念起经说五住处。前无更别法起故名无始无明住地。显无别法始无明者。即是此论忽然起义也。此约细麤相依门说。非约时节起无初故</p><p>论。染心者有六种释曰。次显染心缘起之相。于中有二。总标别解。此初也。此即释上无明所染有染心句。说无明染有染心者。有其六种。即上意识及五种意。前明因缘起义。故从细向麤次第问说。今欲兼显治断义故。从麤至细次第而明。故虽前后而无别也</p><p>论。云何為六至远离故释曰。次释六染。即分為六。此执相应即是意识。亦六麤中执取计名四相义中麤执著相。见爱烦恼所增长故。我我所等麤执相应望污净心故。名执相应染。此即辨障下显对治。若二乘人至无学位断见修惑能离此染菩萨入住信相成就无有退失。名信相应。故十地论及无著论皆说地前名信行地。得人空门见爱烦恼不得现行。故远非约随眠种未亡故。此位何不断惑种耶。有义。地前道力劣故。现惑当起。况能断种。若至初地得无漏道。方断分别烦恼障种。留俱生种助行受生。至成佛时方永断故。所知种现地地断伏。至佛地时方永断尽。是故地前不断惑种。有义。此说理未圆明。但顺法相大乘义故。信位菩萨能得佛身。八相成道。化眾生事。亦能少分见生空理。如何不能断惑种耶。能起胜道永断烦恼。恐妨<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>故留惑种。故梁摄论依此说云。若不断上心不异凡夫。不留种子不异二乘。為利自他故留惑种。又不怖惑。知是真如随缘变化不异真故。以烦恼為道场知如变空故。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>眾尘劳随意所持故。若至地上但断智障。于烦恼障不复更留。不分见修种现俱断。以无力能无所用故。助行受生非要此故。若残习气。成佛方断。是故<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>问经中说。一切烦恼障利生行故。于见道中一切俱断末那烦恼。亦初地即以愿力胜故不堕二乘地。又非但断四住地惑。亦能分断无明住地。故下论说。不了一法界义者。从信相应地观察学断。今此但显麤执染也</p><p>论。二者不断至究竟离故释曰。即五意中名相续识。前六染中名相续相。法执相续即名不断。能污净心名不断染。三贤菩萨修学唯识寻思实智诸方观渐伏如是法执分别。入地证得三无性。如法执分别现种俱亡故。云得净心地究竟离也。新得无漏初名净心。非于后地净心也</p><p>论。三者分别至究竟离故释曰。即五意中名為智识。前六染中名為智相。分别染净名别智。污净心故而名為染。从第二地至第六地。于无漏观非长时住。出观缘事有细分别故。此法执未能永离。然于地地入观之时分分能除故云渐离。若至七地长时入观。此永不行名究竟离。具戒地者。即第二地。此地具足三聚戒故。无相方便即第七地。常作意住无相观故。非谓八地无相之因。即此说者皆為谬释。新论所言从具戒地至具惠地。少分离者即至六地名為具惠。具前三地觉分諦观缘起相应增上惠故</p><p>论。四者现色能离故释曰。此五意中第三现识。上三细中境界相也。犹如明镜现色像故。能污净心故名為染。以八地中得三自在色性随心无有障碍故。说八地名色自在。能证相土自在。真如现身土色从六而起。无明妄境从此永离。故说现染此地能离</p><p>论。五者能见至能离故释曰。此五意中第二转识。上三细中能见相也。所依动心转成能见。能污净心名之為染。第九地中得无碍智。善知眾生心行稠林自在无碍。名心自在。有碍能缘此永不起故。云心自在地能离也。然无碍智略有四广有四十。如餘处说</p><p>论。六者根本至能离也释曰。即五意中名為业识。三细之中无明业相。依本无明而心起动為餘染。本名根本业。能污净心故名為染。依第十地发金刚定。断细念习而入佛地。得见心性心即常住。故云依菩萨地尽入如来地能离。问。于第十地尚有业相。寧入八地离现染耶。说离业识即无见相。岂于九地离见相乎。答。实八九地未离现见十地尚未离业相故。而言离者非究竟离。如信相应地虽说离初染但暂伏离。此亦应尔。以此二染碍彼地故。且伏名离。非谓永断故。后三染安佛方断。离此即起圆镜智故。下细中麤菩萨知者。亦依现起麤相而说。若尔三细应皆生相。答。初起名生故唯业识转现。不尔于理无违</p><p>论。不了一法至究竟离故释曰。上显缘起体相义竟。下重料简。于中有三。初辨上无明约治料简。次释相应义。后显染无明成二碍义。此初也。前言心净而有无明。欲显此相。故次文云达一法界心不相应等。即是释前有无明句。今更约治料简麤细故。言不了一法界义等。然此无明有麤有细。谓名生得作得住地以分别者如道得故。以俱生者生便得故。此二皆有种及现行。若三贤位得无相观。亦能折伏下别现行故。言信相应地观察学断。若入初地永断无种。从此已知至十地半渐断俱生。若种若现故言入净心地随分得离。即初地上总名净心。各有所离故名随分。若至佛地麤细种习一切无餘。名究竟离。故诸经论分所智障為十一种。十一地断。此言净心随分离者。即是十地各离一障。以文略故言中含耳。不尔无明则唯一种。寧于十地随分离耶</p><p>论。言相应义至缘相同故释曰。次释相应不相应义。由是于中即分為二。此释相义也。前六染中其前三染名相应者。谓有二义。一依王数。二依心境。依王数者。由是事识而有总别染净缘。故必所相应。此复五义。一时等故同一剎那。二依等故同依一根。三缘等故同缘一境。四智等故同一行解。五体等故各有一体。心念法异等者。此显体等。心谓心王。念法心所。论说。心所名念法。故王数不同。故名為异。谓依染净差别境故。有此心及念法异也。心念各一故成相应。新论依此异体义故云心分别异染净分别异。知相同者。是智等义。依前染净差别境上心王知染则贪嗔等。诸染心所同王知染。若王知净同者。是缘等义。心已缘等义。心已缘彼染净境时。染净心所与王同缘。以同缘故亦名相应。此中且依此三等义。依等时等准可知故。若尔何故说心心所。但同一所缘不同一所相。答。各有所述亦不相违。且如我见见性之行其我爱性之行。如是行别名不同行。而见爱等皆作自我。</p></div>"
}]