[{
    "title": "大乘起信论略述 第2813部",
    "author": "昙旷大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p><a href=\"/fojing/dachenqixinlun/yuanwen.html\" class=\"keylink\" target=\"_blank\">大乘起信论</a>略述 卷上</p><p>大乘起信论略述序</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>澄漪述</p><p>至觉潜辉异学峰起。不有甄述<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>斯讹。故大士马鸣发挥真諦。括眾论綰群经。破二边协中道。作此正论以奖将来。福润河沙声流法界。张皇教义融会真筌。為学人之宗源作道者之龟镜。故先贤硕德开释巨多。广略之体互殊。是非之途或异。临文俯义得失交。并有建康沙门曇旷者。幼而好学长而成德。妙闲製述善□清词。先造广释后学赖焉。包含事理网罗邪正。无执而不改有疑而不皆遣。恐初心者仰崇崖而起退望渤海而迷神廼。复探其旨归為之略述。可谓寻其源而知其流折其檊而得其枝。至如开发题端该谈教藏。傍探异说委闢义门。引经证成会论宗趣。法喻周举问答折疑略而不明。具如广释。好博闻者寻而究之。且欲指陈綰摄纲要。澄漪不才喜承餘论扬攉深旨以示方来。冀法镜高悬真风不坠耳</p><p>建康沙门曇旷撰</p><p>将释此论。三门分别。一明造论意。二显论宗。三解论文义。初造意者。准论四义及八种因如下广说。今总略摄以為二义。一令离妄。二為显真。此二各二。一自。二他。谓诸眾生一心本性非动非静非生非灭非净非染。由无明熏动成<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a><a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>备受诸苦。今令眾生了自心性本来寂灭。令无动念。有动者皆是无明动念。无明亦无所起。知心无动不起念者契证心源永无流转。即经所说离自心妄相得<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>圣智。此是法经所说宗要。依所通达而能<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。依自所修能為他说。即经所言宗通说通。宗通為修行。说通為愚者。显如是义故造此论</p><p>明宗趣者。修有二种。一明所宗。二明所趣。所宗有二。一大乘教。二大乘理。所趣有二。一大乘行。二大乘果。大乘教者。谓说一心二门等教。此能詮教但是假者巧虽实义。是可崇故。大乘理者。谓法与义。所言法者。谓即一心二门之法。所言义者。谓体相用三大之义。此法与义是实所詮皆无虚妄。可尊主故。大乘<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。谓信与行。信谓四信。行谓五行。是修行者所归趣故。大乘果者。谓大法身。此大身法具体相用。是前所行因所归趣故。此等诸义下文当说示。广说者应寻引之</p><p>解论文者。修有二种。先释题目。后述论文。释题有三。一释大乘。二明起信。三释论字。言大乘者。谓即一心。而言大者。当体立名。以广包故。所言乘者。寄喻立称。由能运故。谓此一心能含二门三大等义。凡圣染净无所不包故谓之大。由此乃能运生万法。运凡至圣运因成果故名為乘。由此依心能所詮证教理行果。皆名大乘。依大乘心之所起故言起信者。起為发起。谓大乘教是能发起信。谓忍乐心净為相。是所发起由大乘教。于胜理果发<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>行故名起信。所言论者。决判為义。决断分判理行果义令物生解。故名為论。总而言之。能令眾生于此大乘起信之论。名大乘起信论。马鸣菩萨造者如广释明门</p><p>论。归命尽十方至如实修行等述曰。以下第二解论文义。于中总分以為三分。初三行颂致敬述意。是序分。论曰已下正立论体。是正宗。其后一颂结愿迴向為<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。序中有二。初显归敬。后明述意。此初也。将欲造论凭力请加。是故最初归命<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。文第二节。归命二字是能归至诚。尽十方下显所归深广。所言归者。有其二义。一敬顺义。二报向义。命有二义。谓教命。二谓身命。欲令眾生修<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>命契本心源而造此论。以其身命归趣三宝凭力请加故云归命。所归之中复有二节。尽十方者所敬分齐。最胜等者。所敬三宝。尽十方者。非唯敬佛一方三宝。尽于十方一一剎土所有三宝悉皆归敬。显敬周尽言尽十方。三宝之中其初三句显其佛宝。言最胜者显佛。三身皆超过故。过小曰最。超因曰胜。业谓业用。谓即<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>三轮<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>二利业用。言遍知者。显佛意业。大智德用。意有大智光明遍照能遍知故。遍知有二。一真智。遍知心真如门恒沙德等。二俗智。遍知心生灭门缘差别等。于此二门理重高鑑无倒遍知。无碍<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>者。显佛身业大定德用。依定发生无碍自在缘色身故。无碍有四。一大小无碍。一一色根虽遍法界。不坏根性不轻根相。二互用无碍。虽一一根更互作用。不受根性不捨根相。三理事无碍。色虽秉然而体性為二。妙体虽寂业用无方。四应机无碍。多机□感身不分而普现。虽皆遍应圆智尽而举体。由大定故色起自真。义不由他故名自在。总是佛宝自利用也。救世等者。显佛语业。大悲利他缘德用也。由大悲德能起语业。说缘妙法利他生故。世谓眾生。可对可坏应救济故。言大悲者。是其能救显佛悲缘故言大悲。即三悲中<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>之悲。非如凡小我法之悲不常遍。度诸眾生故者。谓假者结德属人。具前如是三轮三德二利之人名之為者。以下二句显其法宝。即三大中体相二大。以其用大佛宝摄故。所言及者。有其二义。一相违义。显此法宝与前佛宝是二事故。二含乘义。非直敬前用大佛宝。及亦敬于体相法宝。显斯二义故置及言。言彼身者。即佛三身对此法宝得彼名故。言体相者。体谓体大。相谓相大。是前用大法宝<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>之体相故。故言彼身之体相也。教理行果四法之中。谓显理果深圆法故。是故举佛而记其法。此句正出法宝体相。言法性者。显此法宝非直与前佛為体相。亦与诸法而為体性。法之性故名為法性。言真如者。显此法宝虽与诸法而為体性。不同诸法而有妄。实悉非虚妄故说為真。显非实易故说為如。所言海者喻显二义。一依喻显义。法宝<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>作诸法。性非妄实者。如大海水因风作波。波虽起尽。湿性无实。当知此中道理亦尔。二约喻显德德。显法宝。具德如海故。在常云。譬如深大海珍宝不尽等。乃至广说。僧宝之中有其二句。于中初句举有德人。僧通凡圣及大小乘。此中所归大乘圣僧地上菩萨。随修一行万行举成。其一一行皆等法界积功所得。以是故言无量<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>人。能摄德故名為藏。下句显人所依行位。如下论说。法力熏习是地前行。如实修行是地上行。满足方便是地满位。今举地上兼记满位。是故说言如实修行等</p><p>论。為欲令眾生至佛种不断故述曰。此述意也。谓对三宝述造论意。文中四句。即為四义。初句显其所為眾生。眾生虽多不过三聚。一邪定聚。十千劫前未起信者。二不定聚。十千劫中信未定者。三正定聚。十千劫后十住位人。今此為欲令眾生者。正被中间不定聚人。令其信心成决定故。兼通邪正二聚眾生。令当成信增解行故。此句显其所除之障。障有二种。谓疑及执。由疑迷真故失真乐。因执起妄而种苦因。故下论中显示正义释根本义令悟真乐。对治邪执离人我见令捨苦因。故言除疑捨邪执也。次第三句显所成德位。令眾生依大乘教观大乘理报大乘果发起大乘正信心行故。言起大乘正信。正信行者。即下论说三种<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>四信五行。翻前疑故云信。翻前邪故云正。后句显其所入之位。欲令得入种性位中定绍<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。令自依法佛种相续能為他说。令<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>续。令他佛种亦不断绝。由其自他及正教法三种<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>得相续故。故云佛种不断故也</p><p>论曰。有法能起至是故应说述曰。次下第二明正宗分。于中有二。初举答许说。后正陈所说。此初也。言论曰者。简论异经辨能詮教。有法等者。举所詮法。显有缘益。是故应说者。显能詮教。应法说也。谓能詮教有此所詮。一心二门三大等法能起眾生大乘信根。此能詮教决定应说。大乘信者。即信己性。知心妄动无前境界。此信决定能持能长自及餘善。故名信根</p><p>论。说有五分述曰。次下第二正陈所说。于中有三。初举数总标。次依数列名。后依名辨相。次初也</p><p>论。云何為五至劝修利益分述曰。此数列名也。言不自起製必有由。名為<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。部外餘取故称為分。由致既□略标经要令物生信。名立义分。宗要既略。次宜广释令其生解。名解释分。依释生解。次宜起行。令起行故名修行信分。虽示行仪。钝根懈慢。举益劝修。名劝修利益分</p><p>论。初说因缘分述曰。以下第三依名辨相。别释第五分。即分為五。初因缘中复分為二。初标举分名。后别显其义。此初也。言因缘者是所以义所為义发起义。是因缘义</p><p>论。问曰至而造此论述曰。此下第二别显其义。于中有四问答难通。此初句也</p><p>论。答曰是因缘有八种述曰。下答有三。初举数总答。次依数辨义。后结答所问。此初也</p><p>论。云何為八至利恭敬故述曰。次第二依数辨义。别辨八因。即分為八。于中初一是总相因。其后七种是别相因。言总相者。有其三义。一通诸论而作。所以离苦得乐通诸论故。二通诸根而作。所為非唯為彼不定聚故。三通诸分而作。发起非唯正作立义因故。一切苦者。八苦三苦二生死苦。离此总别一切苦也。究竟乐者。无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>大<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>乐。二乘所得非究竟故。非求等者。意显论主自及眾生非求此等而造此论</p><p>论。二者為欲至不谬故述曰。次下七种是别相因。唯為此论作所以。故显正所為非兼被故。唯為发起七处文故。所言如来根本义者。為即一心是本始觉。如来根本。本觉名如。始觉名来。始本不异名曰如来。由此眾生虽有真理未起智。照如而非来。即以如来依心成故说是如来根本之义。如立义分及解释中显示正义解释此义。令彼三贤诸眾生等观智相应。故云正解。即对治邪执离人我见观智离倒名為不谬</p><p>论。三者為令至不退信故述曰。善根成熟即是十方信终心之人。修十善根自分满足。故云成熟。今為此人说解释中发趣道相三种发心。令其进入初住已上住于大乘堪任修行不退信也</p><p>论。四者為令至习信心故述曰。善根微少即是十信中心之人。修十信善未满足故。故云微少。為彼显说修行分初四信四行。令其遍修到信满位。故言修习信心也</p><p>论。五者為是至出邪网故述曰。十信初心有其三品。谓下中上。其下品人多恶业故。虽无修行而多障碍。為彼显说修行分中<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>诸佛懺悔等文。令其修行消恶<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。善谈其心不令造恶。渐离痴慢恶业因也</p><p>论。六者為示至二乘心过故述曰。十信初心中品之人而有凡夫二乘心故。于趣大乘而為重过。為彼显示<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>等文。令其修行而对治也</p><p>论。七者為示至退信心故述曰。十信初心上品之人。惧于恶世不见佛故难成信行意无退者。為彼显说生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>文。专念诸佛為缘。方便令生佛前。不退信也</p><p>论。八者示至劝修行故述曰。十信初心三品之人初修行故退易进难。為彼显说劝修利益。举彼损益劝令修捨。言示利益劝修行等</p><p>论。有如是因缘所以造论述曰。前成依数辨义。此即结答所问</p><p>论。问曰至何须重说述曰。此第三难也谓前八因所说之诸立义分等诸义等诸经中具有。皆為眾生离苦得乐。今造此论重说彼法。岂非為求名利等邪。以是故言何须重说</p><p>论。答曰至解缘别述曰。自下第四通其所难。于中有二。初略通所难。次广破疑情。后结明此论。此初也。修多罗中虽有此法者。举彼问辞纵其所难。眾生已下答其所难夺彼疑情。根行不等者。显根异同。根谓根性。行谓心行。根有利钝。心示广略。故言眾生根行不等。受解缘别者。显缘增微。缘有二种。一人。二法。人谓如来及<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。法谓经论广略文义。依此二缘胜缘劣受解故。言受解缘别。根胜缘强虽不假论。根微缘劣寧度论乎</p><p>论。所谓如来至则不须论述曰。次下第二广破疑情。于中有二。初显根缘俱胜不须造论。后显根缘差别必须于论。此初也。其初二句举彼胜时以明根胜。能说人下举佛三业以显缘强。色业胜者。具相好故。心业胜者。知<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>故语业胜者。圆音演故。根缘既胜。此时尚无□□之经。何更须论。圆音一演异类解者。谓佛音声无障无碍一即一切一切即一。以一切音即一音故。能以一音说一切法无不显了。又以一音即一切故。能以一音作一切音无不究尽。然一一音悉遍法界。而其音韵恒不杂乱。若此音声曲而不遍。音而非圆。若由等遍失其音曲。即圆非音。然今不坏曲而等遍。不动遍而善韵。由是义故方成圆音。故佛音声名语具足。乃令眾生异类等解也</p><p>论。若如来至而取解者述曰。此下第二显缘差别必依于论。于中别显四种根性。即分為四。此初具足二持根性。最利根者依广经缘而能取解。言自力者即智力。由自智力自依广经而能解义不假论故</p><p>论。或有眾生至而多解者述曰。此即第二义持根性。此利根者依略闻缘而广解义法。不多闻诸经文句而多解者。亦是自智。是故论言亦以自力</p><p>论。或有眾生至而得解者述曰。此即第三文持根性。此钝根者自无智故。不自依经而能解义理。以文持能依广论依他取解</p><p>论。自有眾生至能取解者述曰。此即第四俱□二持最钝根者。重文持故复以广论文多為烦。其心唯乐□□。而行唯无依。于文约义丰略论取解。故言心乐总持等也</p><p>论。如是此论至应说此论述曰。前来已说广破疑情。此即第三结明此论。如是根性差别既尔。此论為彼第四人故。总摄如来广大义等。心法广包故名广大。二门互融故名深法。三大无际故曰无边。是佛所证真实理故说是如来广大深法无边义等。此所证说散在诸经。略皆辨说故言总摄</p><p>论。已说因缘分次说立义分述曰。次下第二明立义分。于中有二。初结前起后。后正陈法义。此初也</p><p>论。摩訶衍者。总说有二种述曰。此下正陈法义。于中有三。初标总开别。次寄句列名。后依名辨相。此初也。总者略也。大乘之理有无量门。今总略说有其二种</p><p>论。云何為二至二者义述曰。此寄句列名也。法者体也。谓即一心持<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>故。轨生智故。名义体故。名之為法。义谓名义。即三大等。依于心体显其大乘差别之义。然此法义。法多在因。约生说故。义多在果。显净用故。法通染净。□二门故。义唯通净。唯所显故</p><p>论。所言法者谓眾生心述曰。次下第三依名辨相。于中有二。先法。后义。法中有二。初就体总立。后依门别立。总中有三。初总出法体。次辨法功能。后释其法名。此初也。此中心者。如来藏心而名法者。為乘体故。谓具随流不变之义。能含二门摄三大故。即大乘体故。名為法</p><p>论。是心则摄至出<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>法述曰。此辨法功能也。谓此一心体相无碍。染净同依。随流返流唯赖此心。是故能摄世出世法。若谓随流本觉及随流成不觉。能摄世间法。若不变之本觉及返流之始觉。能摄出世间法。今此唯约生灭门说真门。含融染净同故。而下真门摄一切者。以彼理事不相离故。由无随缘成染义故。非摄世间出世间法</p><p>论。依于此心显示摩訶衍义述曰。此释其法名也。谓依于此法体之心显三大等大乘名义</p><p>论。何以故。述曰。上总立竟。次下第二依门别立。于中有二。先责总立难。后开别释成。此初也。心通染净。大乘唯净。如何此心显大乘义</p><p>论。是心真如至体相用故述曰。此开别释成也。大乘唯净。彼净相用必对深成。即以一心具含染净故。能显示自体相用。废染之时无净相用故。通染者能显净义。如何能示三大乘义。此心绝相则是真如。而以言说所显义相则一心体之真如相故。此真相显示心体。是心随缘所成生灭。而此生灭所藉因缘及此生灭麤细相状皆依自体而得成故。故生灭等能示自体。此生灭等有染相。故能示体上性功德相。是生灭等染别业用能示自体诸净业用。既此所示自体相用為大乘义故说依心。显大乘义以心真如。是不起门与所示体无别异故。云即示。体以无染故不示相用。以生灭等是起动门能所示别故。言能示。以有染故通示大乘自体相用</p><p>论。所言义者则有三种述曰。前释法竟。次下释义。于中有二。先辨大义。后显乘义。前中亦二。先标。后释。此初标也</p><p>论。云何三至不增减故述曰。次下别别释三大。即分為三。一切法者则染净也。谓心真如染净通依故名平等。由平等故在凡加。染而不增。在圣染。染而不减。故名体大也</p><p>论。二者相大至性功德故述曰。如来藏者有其二义。一者空。谓如来性空无念故。二不空。谓如来藏具性德故。此是眾生如来果性具二义故名之為藏。一摄故名藏。能摄果德。又為佛智所摄藏故。二隐故名藏。未出经时為诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>所隐覆故。言功德者。智光明等照用曰功。离念曰德。而言性者。在真性故。本性有故。无异性故。言无量者。无数量故。无限量故。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>量故。即如来藏具足此相故名相大</p><p>论。三者用大至善<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>故述曰。然用有二。一者因用。内外凡圣菩萨利益。二者果用。佛果三身普别胜益。此用能发有漏善者名生世间善因果也。能发眾生无漏善者名出世间善因果也。此因果益用起自真善无不生故名用大</p><p>论。一切诸佛至如来地故述曰。此释乘义。一切诸佛本所乘者。标果望因以释乘义。即是显其能乘所乘。由乘此乘成正觉故。菩萨乘此到佛地者。举因望果以成运义。此即显其能运所运。以能运因而至果故</p><p>论已说立义分次说解释分述曰。次下第三明解释分。于中有二。初结前起后。后正明解释。此初也</p><p>论。解释有三种述曰。正明解释。于中有三。初举数总标。次依数列名。后依名辨相。此初也</p><p>论。云何為三至发趣道相述曰。此依数列名也。显示正义。所立大乘法义所显非邪故名正义。以教辨明故名显示。正理既陈。情惑斯建。故有第二对治邪执。二见妄著故名邪执。以教令除名曰对治。邪执既除依阶趣正。故有第三发趣道相。本觉虚通目之為道。起行向之名為发趣。之状名之為相。以教宣示名為分别</p><p>论。显示正义至有是二种门述曰。次下第三依名辨相。辨此三名即分為三。初释第一显示正义。复分為二。初则总释。释上总立。后即别释。释下别立。初总释中复分為三。初依法开门。二列其二门。三二门该摄。此初也。谓如来藏一总源心含其二义。一约体绝相门。谓一心性非染净等差别诸相。经依此说眾生即涅槃烦恼即菩提凡夫<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>同一如等。二随缘起灭门。随无明重变或染净。染净难成。性恒不动。正由不动能成染净。是故不动亦在动门。即生灭门本觉义也。依此经说不染而染染而不染。又说如来藏為善不善因。若生若灭。受苦乐等。然此二门举体通融。体相无二。齐限不分。假名為一。是诸法中贞实之性。性有智故说名為心。非谓虚实一心等也</p><p>论。云何為二至心生灭门述曰。此列二门也。即体绝相名真如门。随缘变动名生灭门。体虽无别而义有异。约义异故。故说為门</p><p>论。是二种门至摄一切法述曰。此下二门该摄。于中有二。初正显。后释成。此初也。即释立中是心即摄世间法等。上以一心所该二门故。直言是心摄一切法。今以二门通别相收言各总摄。谓真如门是染净通相。通相之外无别染净。染净皆為通相所摄。故真如门总摄诸法。生灭门者即此真如与缘和合变作染净。而恒不失本真如性。故别相门亦摄真如。是故亦摄一切法也</p><p>论。此义云何至不相离故述曰。此释成也。此云何者。二门若别不合相。从如本一心未容皆摄。如何二门各总摄邪。故次答云。以是二门不相离故。以真如门是心理体。生灭门者是心事相。以彼理事不相离故。举理摄事。举事摄理。故说二门皆各总摄</p><p>论。心真如者至法门体述曰。上总释竟。自下别释释上别立。于中有二。先别释二门显动静非一。后会相归真显动静不异。初中别释二门。即分為二。真如门中亦分為二。初举如体离言以明观智境。后依言辨德以明生信境。初中有二。初正举法体后句答释疑。初中复二。初显真体。后显真名。于中又二。初正举真体。后会相显真。初中又二。初显真如為一心体。后释真如為体所以。此初也。一法界者。即是一心虚通不二故摄為一。圣法之因故云法界。显该二门云大。总相轨生物释故亦為法。圣智通游故谓之门。今显真如是此心体故。云即是一法界体</p><p>论。所谓心性不生不灭述曰。此显真如為体所以。谓心本性不生不灭。不生灭者即是真如。故心真如即是心体。而此心体非前后际可增可灭染净相故。故说心性不生不灭</p><p>论。一切诸法至境界之相述曰。此下显其会相显真。于中有三。初正会疑执。次结法归真。后结真无说。此初也。谓有疑云。如前所言。一切诸法唯是一心。若此心性不生灭者。即无诸法差别之相。何故诸法有差别邪。故此释云。诸法差别唯依遍计妄念心生。若离妄心。即无妄境差别之相</p><p>论。是故一切至故名真如述曰。此结法归真也。此有十句。总為三节。初之二句举所会法。言是故者。是前妄境妄心成故。一切诸法本来空也。次有六句释其空义。前三句显性离妄故其体即真。后三句显离异相故其体即如。离言说相者。非如声有故。离名字相者。无性可詮故。离心缘相者。无可攀缘故。言悟道断心行处灭皆即真也。毕竟平等者。无可差别故。无有变异者。无可转变故。不可破坏者。非可对治故。既皆平等无异等故。体皆如也。下有两句结归。真如唯是一心者。法依法起。念不离心。故一切法唯一心也。既此一心体即真如故。一切法名真如也</p><p>论。以一切至不可得故述曰。此显真无说也。此有疑云。若一切法无有自性皆是真如无说等者。何故于法而有言说。既有言说应有诸法。故此释云。实一切法皆真如故非言说等。而有言者唯是假名。但随眾生妄念安立。非实詮表而可得也</p><p>论。言真如者至因言遣言述曰。以下第二显真如名。于中有三。初标立名之意。次显真体无遣无立。后总结真无名之名。此初也。文中二节。初之二句释外疑情。谓有疑云。若法真故离名等者。不应复立此真如名。既尔。真如应有名相。故此释云。亦无有相。谓但假言说為真如。非谓存于真如名相。其下二句转释立此真如名意。谓复疑云。若此真如无真相者。何要假名。故此释云。谓真如者。言说之边假立极名。為遣餘名言说总处假名真如。此名之后更无名。故犹如以声而正于声。此声之后更无声故</p><p>论。此真如体至皆同如故述曰。此显真体无遣无立。恐闻前说遣真名相谓遣真体强生<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>故。遮之云无有可遣。何不遣者。下句释云。以一切法悉皆真故。诸法无性非虚妄故。悉皆是真故。于真体更何所遣。恐感者闻真体不遣。当情而立强生灭见。故遮之云。亦无可立。何不立者。下句释云。以一切法皆同如故。以诸法空无别无变故。皆同如而此真体更何所立</p><p>论。当知一切至名為真如述曰。此总结。真无名之名。真无名故不别说。真<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>故不可念。故一切法不可说念。名為真如</p><p>论。问曰至而能得入述曰。前明正举法体。此下问答释疑。于中有二。初问。后答。此初也。疑真绝修二种观故而為此问。若说真如无说念者。云何依真起方便观而能随修。云何于真起于正观而能得入</p><p>论。答曰至名為得入述曰。此答也。虽未离念而以念惠观此说。念常无能所。顺于无念故名随顺。离念观心契入无念。是為正观。方名得入</p><p>论。复次真如至有二种义述曰。上明如体离言以明观智境。释上立中心真如竟。次下依言辨德以明生信境。释上立中是真如相。于中有三。初举数总标。次开章略辨。后依章广释。此初也。前说无相是观智境恐生怖故。开二义相。如体无相依言立相。若离于言即唯一味。令信释故假立言相。即显不可如言取也</p><p>论。云何為二至性功德故述曰。此开章略辨也。言如实者。真体不无故。所言空者。真体无妄故。究竟显实者。由妄空无极显真故。以无妄相能总显实故。说如实名為空也。言不空者。具体相故。此性功德言无漏者。无离断等及念漏故。是即如实具有自体及性功德。故名不空</p><p>论。所言空至妄心念故。述曰。次下第三依章广释。于中有二。先明其空后显不空。初中有三。初略明。次广释。后总结。此初也。初句显其非染相应以释空义。一切染法不相应故。故名為空。云何染法不相应邪。次句释云。谓离差别所取相故。何故离此所取相邪。后句释云。以无能取妄心念故。即妄心境情有理无。真如体相理有情无。故与染法不相应也</p><p>论。当知真如至一异俱相述曰。此广释也。谓修学者闻说真如。随情起彼有无等见。皆非契真。故皆非之显真空义。闻有真如。遂存有相。故今遮云。真既无相。非情疑境。云何為有。故云非有相。恐闻非有遂复存无。遮此见云。非汝谓有云非有相。非谓真如是其无相故。云非无相。恐闻皆非。存双非相。破此见云。非汝有无云非有无。非谓真如。非谓真如是双非相。故云非非有相非非无相。恐闻非非返存双。是故遮之云。非汝双非故云非非。非谓双存是真如相故。云非有无谓相。虽闻真如非有无等。恐执与法而是一相。复遮之云。诸法无相悉是真如。是更与法而為一相。故云非一相。恐闻非复存实相故。遮之云。非汝谓一言非一相非谓真如与法实相故云非异相。恐闻皆非存双非相。破此见云。非汝一异云非一异。非谓真如是非一异故。云非三相非非异相。恐闻非非返存双。是故遮之云。非汝双非故云非非。非谓双存是真如相。故云非一异谓相</p><p>论。乃至总说至故為空述曰。此下总结。于中有二。初修结前义。后返结释。此初也。妄染尘沙。难可遍举。今总略说。一切妄心所不染触故说空也</p><p>论。若离妄心实无可空故述曰。此返结释疑也。恐闻说空便成断灭。故此释云。遮诸念相假说為空。若不遮妄不说空。故真既不空。故非断灭。是显真性空而不空</p><p>论。所言不空至空无妄故述曰。此下第二显不空义。于中有三。初牒前显后。次正明不空。后释外疑难。此初也。将明不空故牒前空。由明妄空方显。不空真实体故</p><p>论。即是真心至即明不空述曰。此正明不空也。即是真心者。空无妄处即是真心。总举不空真心。体大不生故。常不起故。恒乘故。不变无念故。净法满足。性德虽多。略举其四。即是不空真心相大具此体相。即名不空</p><p>论。亦无有相至证相应故述曰。此释外疑也。恐闻不空疑存有相故。今遮云。虽曰不空亦无有相而可执取。下释所以。以非妄念所行境界唯是证智所体会故。即显真心不空而空也</p><p>论。心生灭者至有生灭心述曰。上来已释真如门竟。次下第二释生灭门。于中有二。先明生灭之法。后辨所示之义。初中有二。先明染净生灭。后辨染净相资。前中有二。先就体总标。后依义别释。总中有三。初标体。次辨相。后立。此初也。如来藏者。即是清净不生灭心。因无明熏举体动作生灭心也</p><p>论。所谓不生至非一非异述曰。此辨相也。谓如来藏不生灭心举体动故不离生灭生灭心相无非真故。故亦不离不生灭心。如是不离名与和合。俱是不生灭与不生灭和合。以是向末随缘门故。非是生灭与不生灭和合。以非向本归真门故。非一异者。不生灭心全体动故。心与生灭非异。而恒不失真心性故。心与生灭不一。若定一者。生灭尽时真心应灭。即堕断边。若是异者。无明熏时心应不动。即堕常边。既离二边。故非一异。非一异故方成和合</p><p>论。名為阿黎耶识述曰。此立名也。依如来藏故有生灭心等者。名為阿黎耶识。阿黎耶者训翻无没。谓如来藏不生灭心虽随无明而来生灭。如来藏体无灭没故。性功德相无失没故。法示妙用无隐没故。正云阿黎耶。义译為藏所成。生灭而為所熏。与前七识為因果故。能藏诸法于自体中。藏自体于诸法之中。又為我爱之所执藏。我见所摄。故名為藏。离我见时无此名故。若唯生灭。不异七识。若唯不生灭。不异如来藏。由二和合成赖耶矣</p><p>论。此识有二至生一切法述曰。上来就体总标。是次下第二依义别释。于中有三。初显是心生灭。次明生灭因缘。后辨生灭之相。初中亦三。初开数辨德。二寄门别名。三依名辨释。此初也。由此识有觉不觉义随境能摄染净诸法。二义互熏能生一切染净果法</p><p>论。云何為二至不觉义述曰。此寄问列名</p><p>论。所言觉义至说名本觉述曰。此下第三依名辨释。于中有三。初辨觉义。次明不觉。后双辨同异。觉中有二。先略辨二觉。后广明二觉。初中亦二。先本。后始。本中又二。初显本觉体。后显本觉名。此初也。本觉体者。取于一心随缘门中无念真性。而此真性本无不觉。故云觉者心体离念。此约性德翻染得名。异绝于如故。生灭摄离念觉相者等。彼空界横遍三际竖通凡圣。故云无所不通。在缠出缠性恒无二。故云法界一相。欲明觉义。与彼出缠如来法身性无差别。故云即是如来平等法身。既依此觉当显法身即是果位法身之本故。依法身说名本觉</p><p>论。何以故至即同本觉述曰。此显本觉名也。何以故者。责其立名。上开章中直言觉义何故今结乃云本觉。此所结中既摄本觉。何故上标但言觉耶。此即进退二种责也。下释意云。谓以此觉对于当显始觉法身得本名故。故下结中而言本觉。以彼始觉至心源时。即同本觉无二相故。无别可对故。前标中但直言觉</p><p>论。始觉义者至说名始觉述曰。此略明始觉也。始觉者。牒其名也。依本觉故有心者明记始觉之所由也。依不觉故说有始觉者。正显所起始觉之义。谓即本觉真净心体随无明缘动作妄念故。依本觉有不觉也。而以本觉内熏力故渐有微觉起厌求等乃至究竟还同本觉故。依不觉有始觉也</p><p>论。不觉心源至非究竟觉述曰。上略明二觉次下第二广显二觉。于中有二。先明始觉。后显本觉。前中有三。初总标因果满非满觉次广寄四相释成其义。后显始觉不异本觉。此初也。言心源者。有其二义。本觉真如為染心源。业相细念為法染源。持业依主二释皆通。谓究竟位觉。本觉心本无所动。今无所静觉。业<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>本来无生。今无所灭觉。此源者名究竟觉。即佛果位。纵有所觉。未主此源。非究竟觉。即等觉前也</p><p>论。此义云何至是不觉故述曰。次下第二释成其义。于中有二。初正寄四相显其四位。后引经释成心源无念。前中觉四相位分為四。此初觉灭相位也。此义云何者。四其心源觉不觉义下举四相释成其义。今应先明四相之义。然后依义释文显位。心性本来离生灭念。而有无明动心令作生住异灭。故名四相。即九相中前之八相。谓由无明净心起动。虽无能所见相未分。动念初起故名生相。即是第一无明业相。以其初起得生名故。由妄动故而生见相。能所取心成于麤细坚住诸执故名住相。即是转现智相续相。所住能住法执相故。由法执故。复依异根别取异境起我我所自他异执。故名异相。即执取相计名字相。由我我所受想境故。由<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>故。起惑造业能招苦果。能令净心隐于<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>。故名灭相。即是第八起业相也。能成眾生业繫苦故。既由无明动此净心。初起生相终起灭相。而成眾生六道生死。今由本觉内熏之力。初觉灭相终觉生相。故说凡夫能觉知等。此文四节。如凡夫人者。是能觉人也。即是十信外凡夫之位。觉知前念起恶者。是所觉相。未入信位贪著生死起烦恼业而不觉知。今入信已知起惑业招苦果故定是恶也。能止后念令不起者。辨觉利益前由不觉起烦恼业。今既觉故止不造也。虽复名觉即是不觉者。结觉分齐。虽知是恶妄有制伏。未觉是梦故。是不觉</p><p>论。如二乘观至名相似觉述曰。此下第二位觉异相也。文亦四节。二乘观智等者。是能觉人。三贤菩萨名初发意。得人空门同二乘位。觉于念异念无异相。明所觉相。此二乘等证人空而共知<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。离妄根境从异梦觉。名觉念异。返照异相都无所有。名念无异相。以捨麤分别执著相者。是觉利益。即我我所名麤分别执著相也。名相似觉者。是觉分齐。虽捨麤执而由未得无分别故</p><p>论。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身菩萨至名随分觉述曰。此第三位觉住相也。文亦分四。法身菩萨是能观人。十地菩萨证法身故皆名法身。觉于念住等者。是所觉相既证真如得无分别永离二取法执心故。从住相梦而得<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。名觉于念住。返照住相竟无所有。名念无住相。已离分别麤念等者。是觉利益。即法执念异前人执及著外境故名為分别异相。后生微细念故。故云麤念。名随分觉者。是觉分齐。觉道未圆有细念故</p><p>论。如菩萨地至名究竟觉述曰。此第四位觉生相也。文亦分四。菩萨地尽等者。是能觉人。文中三句显有二道。菩萨地尽总举金刚等觉之位。满足方便是加行道。即是满足之方便故一念相应。是无间道剎那契理断细念故。觉心初起心无初相者。是所觉相。根本无明依觉故迷动彼净心令起细念。今乃证知离本觉无不觉。即动心本来净。故云觉心初起等。非觉悟心而初起也。远离微细念故等者。明觉利益生相。最细名微细念。此相永无故云远离。真心性显云见心性。心无生灭名即<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。名究竟觉者结觉分齐。未至心源梦念未尽。始末同本非究竟觉。梦念既尽心归本源。始不异本。名究竟觉</p><p>论。是故修多罗至向佛智故述曰。自下第二引经证诚也。心源无念。于中有四。一引经成证。二重释前文。三举不觉之失。四显觉者之德。此初也。在因地时虽未离念。能观如是无念道理。说此能观為向智故。以是证知佛地无念</p><p>论。又心起者至即谓无念述曰。此重释前义遣外疑也。恐闻前说觉心初起疑有初心是可觉知。故此释云。前说觉心初起相者。无有初相是可觉知。而言觉心初起相者。觉初念心即无念起。其初动心本来静故</p><p>论。是故一切至无始无明述曰。此显不觉之失也。文中有三。谓标释结。是故等者乘前标也。是前无念名為觉故。除佛以外不名為觉。以从等者。释所以也。已从无始至<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>来。无明之念念念相续未曾离故。前对四相故说渐觉。皆有无明故说不觉。故说等者。结不觉义。谓依无明而起诸念故有念者。说彼皆是无始无明。不名觉也</p><p>论。若得无念至无念等故述曰。此显觉者之德。若妄未□不知一心本无相念。若至心源得于无念。即知眾生一心妄动四相差别。心无动念。以无念等故者。释知所以眾生离念体则无念。佛无念体与彼平等。故能遍知诸念无念</p><p>论。而实无有至同一觉故述曰。此即第三始不异本。文中标释。而实无有始觉异者。此标始觉不异本觉。以四相下释成其义。以彼四相无别自体可辨前后。故言俱时。依麤细念觉时差别而有前后。故言而有。离心无有俱时前后自性可立。故言皆无自立。离心无性即同一觉。故言本来同一觉等。此总意云。既觉四相说為始觉。所觉无故能觉亦无。故无始觉异于本觉</p><p>论。复次本觉至不相捨离述曰。广始觉竟。下广本觉。于中有二。先明随染本觉。后显性净本觉。初中有三。初总标。次别名。后辨相。此初也。以随动门而显本觉。故言本觉随染分别。既随缘动故言生也。虽随缘生不失性净。故言与彼不相捨离。此初随染既有二种。故随此染生下二相。言二染者。一谓自染。即在因时由无明熏所起染相。二谓他染。即在果时与生同体。诸眾生染即依自染生智净相。以既从染得智净故。由随他染生不思业。以非染生起胜业故</p><p>论。云何為二至思议业相述曰。此别名也。所言智者。即始觉智。净谓离染。同于本觉果作用故名為业。非下地例名不思议。相者状也本觉随染有此当起二相状故</p><p>论。智净相者至满足方便故述曰。次下第三依名辩相。于中有二。先明智净相。后显不思议业相。智中有二。初直明净相。后问答释疑。前中亦二。先因后果。此初也。谓于地前依真如法内熏之力所流教法外闻熏力能修资粮加<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>根。故言依法力熏习。若登地上契证真如。凡起诸行依真而修。故言如实修行。渐渐修习十地行至金刚位。因行既极。名满足方便</p><p>论。破和合识至淳净故述曰。此明一果也。由前方便能破和合黎耶识。内生灭之相。显不生灭清净法身。故言破和合识相。显现法身灭染心中业转现等。令随染觉遂即归源成于应身淳净之智。故言灭相续心相。智淳净故即离相。名之為淳。染缘尽故名之為净</p><p>论。此义云何述曰。次下第二问答释疑。于中有二。先问。后答。此初也。此问意云。如上所说动彼净心成前生灭。即举生灭尽是净心。若断生灭。净心应灭。如何但破和合识相而显法身灭相续相成淳净智</p><p>论。以一切心至非不可坏述曰。下答。有三。初法。次喻。后合。此初法也。一切生灭<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>之相皆是无明不觉之相。非是本觉体。有识相觉与不觉体非一故。然此无明不觉识相。离非觉体而亦不离本觉之体。觉与不觉体非异故。由非异故无明即明而非可坏。由不一故明无明别非不可坏。前就非可坏义故说离净无别动心。今依非一非不坏义说破识相显法身耳。所望义别不相违也</p><p>论。如大海水至湿性不坏故述曰。此举喻也。有四种喻以况于真如。大海水因风波动者。真随妄转喻水相风相不相捨离者。真妄相依喻水。非动性者。真体不变喻谓水性。但以湿為自性。但随他动非自动故。若风止灭等者。息妄显真喻水。若自动。动相灭时湿性随灭。随他动故。动相灭时湿性不坏</p><p>论。如是眾生至智性不坏故述曰。此法合也。于中次第合前四喻。眾生自性清净心等者。合前第一。水随风动。水不自浪。因风起浪。风不自波。依水现波。故动即水。无别体也。心亦如是。不自起动。因无明动。痴不自起。因心有起。因痴心动。无别动也。心与无明俱无形相等者。合前第二。<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>相依。以水依风。全体动故无别水相。风依水起。全体湿故无别风相。风水相依不相捨离。心亦如是。依妄动。全作诸识。无别心相。妄识依心。无非真故无无明相。真妄相依不相离也。而心非动性者。合前第三水非动性。即显心性本非动念。若无明灭等者。合前第四。湿性不坏显无明断。如风止灭则业识等法相续识如波相灭。随染本觉照察智性。无所坏故如湿性不坏</p><p>论。不思议业至胜妙境界述曰。次显第二不思议业相。于中有二。初标。后释。此初标也。以依智净法身之体起此应身功德之相。与眾生六根作胜妙境界。故宝性论云。诸佛如来身如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无相。為诸胜智者作六根境界示现微妙色。出于妙音声。令臭佛戒香。与佛妙法味。使觉<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>触。令知深妙法</p><p>论。所谓无量至得利益故述曰。此辩释也。所谓无量功德相者。横显业德广多无量。常无断绝者。竖显业根缘穷三际。随眾生根自然相应者。显业胜能无功应机种种而现。得利益者。显业胜益利润不虚。此功德相是真如用。不待作意思议而起。是故名為不思议业。此真如用虽在佛身。与眾生心本来无二。但為眾生无明不觉。随缘现染。用则不现。若彼妄心厌求返流真用渐显。则于彼心称根显现。非谓心外不思议业</p><p>论。复次觉体至犹如净镜述曰。自下第二性净本觉。于中有二。初总标。后别释。此初也。前明本觉随动之门。故说随染。今明本觉不动之门。故说性净。此二本觉既无别体。是显本觉不动而动动而不动也。以觉体有四大净义故与空等。犹如净镜。本觉四义下文当说。空四义者。空无一切相能含一切物离垢显净空示现一切物。镜四义者。空无外物体有体含眾像出离诸尘垢现像為物用。由此空镜以况于真</p><p>论。云何為四至觉照义故述曰。次下别释。别释四义。即分為四。此初也。如实空镜者。标其名也。言如实者。即真体也。真德不虚故言如实。所言空者。对妄得名。以本觉体无妄。法空无妄故云如实空。以无妄故其体明净。喻如净镜。远离已下辩释其义。倒心妄境本不相应故云远离心境界相。以此心境本无所有不现觉中犹如龟毛不现镜中。故言无法可现。无可现故心境妄法望于本觉非所照。觉望心境非能觉照。所照既无。能照无故。故言非觉照义也。此显无有遍计所执。实质可现故非觉照。下言境界于中现者。依他似现亦不相违</p><p>论。二者因熏至熏眾生故述曰。此第二义也。因镜者标其名也。能生觉果名之為因。此能内熏故名熏习。能现诸法故谓之镜。次下辩相。文有三节。谓如实不空者出因体也以有无漏性功德相真实体故。故云如实不空。由不空故方能作彼始觉正因。故不空者成因义也。以一切下释其镜义。谓一切法离此心外无别体性。犹如镜中能现影也。言不出者。明心待熏变现诸法。非不待熏而能自出。所变诸法不出心故。言不入者。谓心随熏变现诸法。而染净法不从外入。而所现影不染体故。言不失者。此诸镜相虽不从真内出外入。而亦不失所现缘起。虽现境相不失真故。言不坏者。法从真起。不异真如性同真故不可破坏。虽复随缘有无起尽。真无坏故。常住一心者。会相同体。以一切下释同所由。以缘起法心中显现无出等故无别体无别体故本来平等不异真如。故云常住一心等也。又一切下释熏习义。由性净故能现染法。虽现染法所不能染。故云染法所不能染。以本无染今无始净故。本觉智未曾移动故。云智体不动。此本觉中非但无染性德无少故云具足无漏。即此净德能熏眾生令厌生死乐求涅槃。故云熏眾生也</p><p>论。三者法出至淳净明故述曰。此第三也。法出离者。标其名也。不空体相故谓之法。从二碍显故名為出。破和合相故谓之离。淳净明故喻之為镜。已下辩相。谓不空法者。释前法字出法体也。谓前因熏不空之法。出烦恼碍智碍者。释其出字显离缠也。永断<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>清净法身从此出故。离和合相者。释其离字。出二碍故更无生灭识相和合。淳净明者。释其镜字。离杂相故名淳。出碍染故名净。以纯净故名明。纯净明故名镜</p><p>论。四者缘熏至念示现故述曰。此第四也。缘熏习镜者。标其名也。用大外熏故谓之缘。令发<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>故名熏习。起善法影故喻之镜。谓此相大出缠之时而為镜智能起大用示现万化。為缘熏发眾生之心。令生厌乐起诸加行名缘熏习。此诸行德是佛智影。不离佛智故名為镜。故佛地云。大圆镜智能起眾生诸善法影。下辩相中文有二节。谓依法出离者。出缘熏体。遍照已下显缘熏相。谓依于前出缠法身离和合相。淳净明故起大<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。光明义用故能遍照法界眾生若干眾心。由遍照故随其所念示现万化令其修习。随分善根故云令修善根。随念示现故</p><p>论。所言不觉至不离本觉述曰。已释觉义。下显不觉。于中有三初明根本不觉。次显枝末不觉。后结末归本。前中又二。初依觉成迷。后依迷显觉。初中又三。谓法喻合。此初法也。谓不如实知真如法一而有其念者。此显不觉依觉而有。念无自相不离本觉者。显离本觉无别不明。前中三义。谓不如实知者。即能迷无明也。如谓称顺实谓真实。真如法一者。即所迷法也。真体一味无念名一。而有其念者。即迷所成<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>心也。谓真一味能迷。无明不称实而知。而知八识之念故名无明。然此无明离真无体。故言念无自相不离本觉</p><p>论。犹如迷人依至则无有迷述曰。此举喻也。文易可知</p><p>论。眾生亦尔至则无不觉述曰。此法合也。本觉真性如正方所。根本不觉似能迷人。心业等动念是如邪方。如离正东无别邪西。故言若离觉性即无不觉。然此不觉与前本觉虽非一异。不离觉性。虽不离觉。非即觉性</p><p>论。以有不觉至自相可说述曰。此即依迷显觉也。以有不觉妄相心故能知名义為说真觉者此明妄有起净之功要。由妄相能知名义。故对此妄说真觉名。以就真体无名相故。若离不觉之心即真觉自相可说名者。此明真有待妄之义。若离不觉无以说真。所待既无。能待无。故能所寂静。终不可说觉与非觉</p><p>论。复次依不觉至相应不离述曰。次下明枝末不觉于中有二。先明细相。后显麤相。初中亦二。总标别释。此初也。三细為相。无明為体。本末体相不相离故名為相应。非谓王所相应之义。以此三细皆是本识不相应染心故也。以依无明而成妄心。又依妄心而起无明。是故名為相应不离</p><p>论。云何為三至不离因故述曰。次下别释。别释三细。即分為三。此初也。无明业相者。标其名也。谓由无明心动名业。名无明业相。非谓无明即名业相。依不觉者。释标中无明即根本无明也。心动名业者。释标中业字也。业有二义。一动作义。故云依不觉故心动说名為业。觉即不动者。返举释成。既始觉时则无动念。是知今动只由不觉。二為因义故云动则有苦。如得寂静无念之时即是涅槃妙果。故知今动则有生死苦患。果不离因者。不动既乐。动必有苦。动因苦果既无别时。故云不离。此虽动念而极微细。缘起一相能所不分。即当黎耶自体分也</p><p>论。二者能见至则无见述曰。能见相者。标其名也。此言能见。即下转相依前业识转成能见。故言以依动故能见。若性净门则无能见。故云不动则无见也。反显能见必依动义。如是转相虽有能缘尚未取境。以微细故即是本识见分心也</p><p>论。三者境界相至则无境界述曰。境界相者。标其名也。此言境界。即下现识至此能现境界相故。依前转相能现境界故。言能见故境界妄现若无分别则无境界故云离见则无境界。反显境界必依能见。即是本识相分心也。此前三相并由根本无明之力动。本静心成此黎耶不相应心</p><p>论。以有境界至生六种相述曰。上明细相。下显麤相。于中有二。总标别释。此标也。六相。皆是分别事识依境界缘而生起故。于中初二。依境生执是其下品。细惑皆是地上断故。其次二种依执起惑是中品惑。二乘断故。其后二种依业受果。上品麤惑。凡夫知故。是故经言。境界风所动种种诸识浪腾跃而<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a></p><p>论。云何為六至爱与不爱故述曰。次下别释。别释六麤。即分為六。此初也。谓未无明不了现识。所现境相皆是自心无有体性。创起恶数分别染净。名為分别染与不爱</p><p>论。二者相续至相应不断故述曰。依前分别爱非爱境而生苦乐。觉念之心常相续故名相续相。谓依前念分别爱境起乐爱觉。于不爱境起苦爱觉。数数起念相续现前。而常相应不断绝也</p><p>论。三者执取相至心起著故述曰。于前所取苦乐等境不了虚无。深起取著。名执取相。谓即于前相续所念苦乐境上复深执著住持不捨。故言心起著等</p><p>论。四者计名至名言相故述曰。依前颠倒所取境上更立名言而生分别计名字相。故经说云相名常相随而生诸妄相。故言依于妄执分别假名等也</p><p>论。五者起业相至种种业故述曰。依前计名执著心故起贪等惑。发动身口造种种业。能招当来五趣苦果。此即惑业為苦近因也</p><p>论。六者业繫至不自在故述曰。业因既成。依业受果。循环诸趣生死长轮。被业所缚不得自在。名业繫苦。故言依业受果不自在等</p><p>论。当知无明至不觉相故述曰。上来广显枝末不觉。此即第三结末归本。文中二节。当知无明能生一切染法者。初正结归。如前三细六麤染相摄一切染。此一切染皆因根本无明不了真如而起。故云无明能生一切染法也。以一切下释其所以。谓有疑云。染法多种差别不同。如何根本唯一无明。故此释云。染法虽多。皆是无明之气。悉是不觉之相不异不觉。是故染法皆是不觉</p><p>论。复次至有二种相述曰。上来已释觉不觉义。次下第三明同异相。于中有三。初总标。次列名。后辩相。此初也。前已别释令知迷悟。昇沈有异令生欣厌。今欲令知迷悟同真无定两体。业幻差别定一亦无。是故合说。故言觉与不觉有二种相</p><p>论。云何為二至二者异相述曰。此列名也。染净齐真曰同。同义可表名相。染净体殊曰异。异有殊状曰相。何故尔耶。以体从缘故异。摄缘归体故同。缘从体同故真如一味。体从缘异故凡圣两分。凡圣分故世諦义立。真如一故真諦理存。觉与不觉同异如是</p><p>论。同相者至微尘性相述曰。次下辩相。于有二。初同后异。同中有三。初喻次合。第三引证。此初也。种种瓦器喻染净法。皆以微尘而為体性喻。染净法以真為性。性者体也。亦即是性。下准此知</p><p>论。如是无漏至真如性相述曰。此法合也。始本二觉名為无漏。本末不觉名曰无明。此二皆有业用显现。故名為业。而非实有故名為幻。虽则如是。染净不同。皆以真如而為体性。以动真如作此生灭。染净二法无别体故</p><p>论。是故修多罗至无可见故述曰。此引证也。是前染净同真相。故经依此义说诸眾生本来涅槃得菩提等。谓二不觉即真如故。眾生本来即涅槃相。不复更灭本始。二觉即真如故。菩提之法亦本来有非新得者。由是义故即此涅槃非待修习了因方证。故言非可修相。即此菩提非待生因而方起作。故言非可作相也。此之二果既性本有。非更得故。故言毕竟无得。亦无以下虽是经文。為遣疑难故论具引。谓有难言。若诸眾生已入涅槃菩提法者。即同诸佛。何故不能现报化等色身相耶。故即释云。法性自体非色可见。如何更能现色相耶。故言亦无色相可见。又复疑云。若以法性非是色相可见法故不现色者。诸佛何故现报化等诸色相耶。故复释云。彼见诸佛种种色者。并随眾生染幻之心变异所现。非谓智性不空色体有此色相。以智真体无可见故。故言而有见色等也</p><p>论。异相者至各各不同述曰。下显异相。于中有二。初喻后合。此初也</p><p>论。如是无漏至幻差别故述曰。此法合也。随染幻差别者。是无漏法性。染幻差别者。是无明法。以彼无明达平等性。是故其性自有差别。诸无漏法顺平等性。直论其性则无差别。但随染法差别染相。故说本觉恒沙性德。又由对治彼染差别故成始觉万德差别。如是差别无漏。无明虽现业用。皆是真如随缘显现。似而无通。通名业幻</p><p>论。复次生灭至<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>转故述曰。上来广释立义分中是心生灭。次下第二释其因缘。于中有二。先明生灭。依因缘义后显所依因缘体相。于中亦二。初总标。后别释。此初标也。谓前九种生灭因缘总有二种。一者黎耶心体不守自性。是生灭因。根本无明熏习心体。是生灭缘。依此因缘起三细相成黎耶识。二者无明住地诸染根本是生灭因。外妄境界熏起识浪是生灭缘。依此因缘起六麤相成其事识。依斯二义以显因缘业转现等诸生灭相。聚集而生而為假者。故名眾生。唯依心体故言依心。即是黎耶自相心也。此假者眾生依于一心即有五意及意识起。故言眾生依心意意识转</p><p>论。此义云何至说有无明述曰。自下别释。于中有三。先释依心。次释意转。后意识转。此初也。此义云何者。问其依心意识转义。依阿黎耶识者是上依心。是生灭因即阿黎耶二义之中本觉义也。说有无明者。是生灭缘即二义中不觉义也。欲明依此因缘意意识转故言以依阿黎耶识等。前标文中略标其因。但言依心。今依此别释具显因缘。故说依心及无明也</p><p>论。不觉而起至故说為意述曰。次下第二释其意转。于中有三。初略明意转。次广显转相。后结成依心。此初也。于中略显五种识相。不觉而起者。第一业识心体。被熏举体动故。言能见者。第二转识转。被动心成能见故。言能现者。第三现识见心。复能现诸境故。能取境界者。第四智识。能取现识所现境故。起念相续者。第五相续识。于境起执不断绝故。然此五义次第转成。依止此义而生意识。故说此五名之為意。而彼意识非所依。故但名為识。故不名意</p><p>论。此意复有五种名述曰。次下第二广显转相。于中有三。初举数总标。次别释其相。后显其功能。此初也</p><p>论。云何為五至不觉心动故述曰。下释五意即分為五。此初也。无明力者举所依缘也。明心不自起。起必有缘。不觉心动者。正明起相释其业义。谓起动义是业义故</p><p>论。二者名為至能见相故述曰。依于动心者举所依缘也。能见相者释转识义。依前业识之动转成能见之相。故名转识。转识有二。此在本识依境转者在事识故</p><p>论。三者名至常在前故述曰。此文有三。谓法喻合。所谓能现一切境者。此举法也。依前转识能见之相起此现识能现之功现一切境。谓此心体与无明合熏习力故现于种种无边境界。能云故现一切境也。犹如明镜现色像者。是举喻也。如镜因质现种种像。心因无明不平等熏现种种境。已下法合。随其五尘对至则现无前后者。此正合前喻对。谓业惑心為惑业所熏对故便现五尘。非待作意前后起也。理实此识现一切境。而此唯言现五尘者。且举麤显以合镜中现色喻。故以一切时任运起者。简异六识。六识间断多不现起。非一切时任运起故。常在前者简异末那。末那非是诸识之本。不常在诸识前起故</p><p>论。四者名為至染净法故述曰。是事识中细分法执。不了现识所现境界。离心无有。而起染净微细分别。故言智也</p><p>论。五者名為至不断故述曰。此亦事识细分之位。此细事识法执相应无有断绝。执无断故名相续识</p><p>论。住持过去至不觉妄虑述曰。下显功能。文中二节。初显前三本识功能。由业转现黎耶识故。摄藏诸法<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业种。能住持过去生善恶之业。令其不失。此明本识能持种子。由摄业种令不失故。随善恶种生善恶果故。能成熟现在未来苦乐等报无差违也。此明本识能起现行。如是三世因果不失功由本识。是故说是本识功能。能令现在已经事下后显二事识功能。由彼事识法执分别故能念虑三世之事。故言不觉妄虑等也</p><p>论。是故三世至六尘境界述曰。上来广显意转之相。次下结明依心之义。于中有二。先正结属心。后释疑广辨。此初也。文中二节。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>虚偽<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>作者。此顺结三界也。言是故者。是前一心随无明动作五种意。五种识等依心成故。而此五意总摄三界。故说三界唯一心转。此心随熏。相有体无名虚。体无似有名偽。虚偽之相虽有种种。然究其因唯心所作。故云<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>三界唯心。离心已下反结。六尘离彼现识即无六尘。反验六尘唯是一心。故云离心无六尘也</p><p>论。此义云何述曰。次下释疑。于中有三。初问。次答。后结。此初也。现有尘境异心可见。能取所取了然差别。如何可言三界六尘皆心所作。此唯心者义云何耶</p><p>论。以一切法至无相可得述曰。此答也。文有七句。总分三节。即初三句正答前问。显境唯心。以一切境皆是此心。随熏所起更无异体。而见异者。但是由汝妄念而生。实无能见所见二相。故云一切皆从心起妄念而生。复有疑云。念不孤起。託境方生。既无异境。何所分别。故次二句释此疑云。一切分别但取自心。非外分别。如依于面自见面像。梦中所见自见其心。妄情不了谓有所见。故云分别即分别自心。复有疑云。若谓分别。分别自心。是亦名為能见所见。何故前言无有二相。故后二句释此疑云。為遮执境说见自心。实非以心而见心也。如彼指刀不自指割。况心不起何有见乎。以本真心无见相故。故言心不见心无相可得</p><p>论。当知世间至而得住持述曰。次下总结。于中有三。初显依妄有境。次显境体亦无。后结释所以。此初也。言无明者。根本无明。言妄心者。即业转现诸妄心也。世间境界伏此而成。依妄心住不失自体。故言境界依于妄心得住持等</p><p>论。是故一切至唯心虚妄述曰。此显境体亦无也。如镜中像无实体故镜外镜内皆不可得。境但是心虚妄现故心外心内无体可得</p><p>论。以心生至种种法灭故述曰。此结释所以也。谓有问言。何故境界依心而住唯心虚妄所显现耶。释所以云。以无明力不觉心动乃至能现一切境等。故言心生种种法生。此即妄动而言生也。若彼无明妄心灭者境界随灭。境界灭故诸分别识皆灭无餘。故言心灭种种法灭。此即心源还静故云灭也。既说此心虽于不觉妄诸法。即验诸法唯心无体</p><p>论。复次至即此相续识述曰。上明意转。次下第三显意识转。于中有二。初标。后释。此初也。明此生起虽麤细殊。同是一识更无别体。故即指前第五识相故言即此相续识也。但前就于细分别法执相应。依前义门则说為意。此中约其能起见爱麤惑相应。从前起门说名意识。意之意识故依主释也</p><p>论。依诸凡夫取著转深述曰。次下别释。于中有五。一约人辨麤。二出其麤体。三明执所缘。四制立其名。五明识所依。此初也。简非二乘所起意识。以前智识及相续识通在二乘地前所起故。今约凡显其麤也。以彼凡夫无对治故。追著妄境转极麤显故言取著转深也</p><p>论。计我我所种种妄执述曰。此出麤体非直心外计境為麤。亦复于身而计為我。于诸尘境计為我所。乃至能起六十二见种种妄执</p><p>论。随事攀缘分别六尘述曰。此明执所缘也。谓但缘于倒境之事不了正理故皆名為随事攀缘。随事者何。所谓分别六尘境也</p><p>论。名為意识至分别事识述曰。此制立其名也。名意识者。既缘六尘。应名六识。而今就其一意识义故。不别出眼等五识。但名意识。故涅槃云。譬如一识分别说六。即此意识依于六根别取六尘故云分离。又能分别去来内外种种事相故复说名分别事识</p><p>论。此识依见至增长义故述曰。此明识所依见。谓五见。即见道断所有分别发业烦恼。发业惑中见最强故。举此名摄分别贪等。即五住中见一处住地。爱谓三界<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>所断所有俱生润生烦恼。润生惑中爱最强故。举此亦摄俱生痴等。即五住中欲色有爱三住地也。以此见修二种烦恼熏于本识令其起此分别事识。故云此识依见爱烦恼所增长也</p><p>论。依无明熏至唯佛穷了述曰。上明生灭依因缘义。次下重显所依因缘体相。于中有二。先标叹甚深。复广缘起差别之义。初中亦二。先标叹甚深。后释甚深所以。此初也。无明熏习所起识者。此句总标缘起体也。即本识心是缘起体。為无明熏起诸妄识。是故总名无明熏习所起识也。非凡夫能知等者。此凡小绝分凡夫学信。具彼五住二障碍故而不能知。二乘虽得我空。智慧障碍故亦不能觉。谓依菩萨已下。菩萨分知。谓依菩萨从其初住正定信位而发意。言比观观察。若至地上分分证知。彼真如依无明熏成诸妄识。以诸菩萨无明住地未断尽故。业识未已。纵至第十究竟地中亦未尽知缘起之理。唯佛穷了者。明佛能知。无明住地永断尽故。觉道圆明故。能尽知一心缘起</p><p>论。何以故至唯佛能知述曰。此释甚深所以也。文中徵释。徵之意者。缘起妙理贯通凡圣。而今说见唯果人者何以故也。答中三节。是心从本已来等者。此明即净而常染。虽有染心常不变者。此显即染而常净。是故此义唯佛能知者。结成难测。初中三句。言是心者。即是本觉缘起心也。从本已来自性净者。自体本来无有染故。此句总显缘起之因体也。而有无明者。即依心体有此无明。此句显其缘起之缘由也。為无明所染有染心者。心体為此无明所染。而净心体有其染心。此句自显缘起相也。虽有染心而常不变者。此性净心虽复所染。常有染心而常不失本净心性。由此染净缘起之理唯佛能知</p><p>论。所谓心体至名為不变述曰。上叹缘起甚深竟。次下广显缘起差别。于中有二。初显缘起体相。后重料简。初中有三。初释心体不变之义。次显无明缘起之由。后显缘起染心之相。此初也。是释上言虽有染心而常恒不变之言。以此一心性常明洁无分别故常不变。非能所念染故以无念名不变也</p><p>论。以不达一法至名為无明述曰。此显无明缘起之由。是释上言而有无明之义句也。以有不达无念。法界不相应。心為诸染源故名无明。法界无念故名為一迷。而起念故云不达。此最微细未有能所主数差别即心之惑。名不相应。此正应言不相应心。非谓与心不相应也。唯此能為诸染之源。更无细染能為此本。是故名為忽然念起。非约时节以明忽起。此无明起无初时故</p><p>论。染心者有六种述曰。次显染心缘起之相。于中有二。初总标。后别释。此初也。此即释上无明所染有染心句。前文所言无明所染有其染心。此染心者有其六种。然其六染即上意识及五种意。前明依因缘起义故。从细至麤而说次第。今欲兼辨治断义故。从麤至细次第而明。故初第一执相应染。第六根本业不相应染也</p><p>论。云何為六至远离故述曰。次下别释。别释六染。即分為六。此中第一执相应染。即上意识我我所等麤执俱起名执相应分。尘污净心名之為染。此及下二相应之义如下所明。若二乘人至无学位见修烦恼究竟离故能离此染。菩萨入住信相成就无有退失。名信相应。此位菩萨得人空门。见爱烦恼不得现行故云远离。非离随眠。种未亡故</p><p>论。二者不断至究竟离故述曰。此言不断相应染者。即五意中名相续识。法执相续名為不断。尘污净心故名為染。初住已上三贤菩萨修学<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>。寻思实智诸方便观渐伏如是法执分别。若得初地无漏净心。证三无性遍满真如。法执分别种现俱亡故。净心地究竟离故</p><p>论。三者分别至究竟离故述曰。即五意中名為智识。念虑染净名分别智。污净心故名之為染。从第二地至第六地入观缘理离分别时分分能除故云渐离。若至七地长时入观故。此法执永不现行。名究竟离。具戒地者。即第二地。此地具足三聚戒故。无相方便即第七地。常作意住无相观故</p><p>论。四者现色至能离故述曰。即五意中第三现识动心现境名為现色。能污净心名之為染。此及下二不相应义如下所明。八地能得相应自在色性随心名色自在。能证相应自在真如现色境用从真而起。无明妄境从此永离。故说现染此地能离</p><p>论。五者能见至能故述曰。此五意中第二转识依于动心转成能见污净心。故名能见染。至第九地得无碍智善知眾生心行稠林自他无碍名心自在。无明碍心永不现行。故云能离</p><p>论。六者根本至能离故述曰。即五意中第一业识依本无明而心起动為餘念本名根本业。能污净心亦名為染。依于第十菩萨尽地发金刚定断细念习得入佛地。细念都尽其心常住。故言依菩萨尽地等</p><p>论。不了一法至究竟离故述曰。上显缘起体相义竟。下重料简。于中有三。初辨上无明约治料简。二释上相应不相应义。三显染无明成二碍义。此初也。欲显无明麤细之相故重约治而為料简。谓前所言不了一法无明义者。有麤有细。谓分别细谓俱生。俱生复有十种麤细。合前分别為十一种。即餘处说十一种障。寧知如是麤细差别。以起治道有差别故。谓三贤位能起比观但能折伏分别现行。故言信相应地观察学断。若入初地断分别种。从此已上地地各断俱生一品。故言入净心地随分得离。若至佛地麤细现种一切无餘。名究竟离</p><p>论。言相应义至缘相同故述曰。次释相应不相应义。由是于中分之為二。此即初释相应义也。谓前三染名相应者。谓事识而有相应心王心所三等义故。心念法异依染净差别者。此显体等心。谓心王念法心所王数不同故名為异。谓依染净差别境故有此心及念法异也。心及念法各有一体。故成相应。知相同者。是知等义。依前染净差别境上。心王知染。则贪嗔等诸染心所同王知染。心王知净。即有信等诸净心所同王知净。以同知故名為相应。缘相同者。是缘等义。心王缘彼染净境时。染净心所与王同缘。同缘故亦名相应</p><p>论。不相应义至缘相故述曰。谓后三染名不相应者。谓是本识微细动心与彼不觉未别异故。若至事识动心相麤与不觉异。动心為王。不觉為所。即此动心相犹细故。与彼不觉既常无异。何有王数之差别耶。故言即心不觉常无别异。此即显无体等义也。既无体等王数之别。何有同知同缘之义。故言不同知相缘相。此即显无知等缘等。翻前相应显不相应义也</p><p>论。又染心者至业智故述曰。次下第三释二碍义。于中有二。初直显二碍。后徵释所由。此初也。文中惑智言染心者。六种染心能障真如根本智者。显其碍义。照寂妙惠如理之智名真如根本智。能照真如根本理故。是依主释。六种染心烦劳恼动障此寂静故。说染心名烦恼碍。烦恼即碍。持业释也。言无明者。根本无明。障业智者。显其碍义。谓即后得如量之智能随世间起。自然业智有世间自然业故。故名世间自然业。有财释也。无明昏迷无所了达。违此智用名為智碍。智之碍故依主释也</p><p>论。此义云何至种种知故述曰。此徵释所由也。文中徵释。徵之意者。既此无明动净心体成于染心。则无明是细应障理智。染心是麤应障量智。而此别显能障法者义云何耶。答中文二。先惑。后智。以依染心能见能现能取境者。即转现智三种染心。于六染中随举三种显其能所不平等相。违平等性者。释成碍义。以此染心能所差别乖根本智能所平等。所以障于真如理智故说染心名烦恼碍。下释智碍。以一切法常静无有起者。是举无明所迷法性。无明不觉妄与法违者。正显无明违于法性故。不能得随顺世间种种知者。由乖静法心境生故。便取碍境碍见拘心故。不能得发如量智。称如量境。随顺世间种种知也。故说无明名為智碍</p><p>论。复次分别至有二种述曰。上释生灭因缘义竟。次下第二明生灭相。于中有三。初举数总标。次列名略显。后广显其相。此初也。所言分别生灭相者。即是辨明立义分中是心生灭相也</p><p>论。云何為二至不相应故述曰。此列名举辨也。所言麤者。即前三染有心心所法麤显相故。与心相应者。释麤义也。谓有境界及有心所与此三种心相应故。所言细者。即后三染无心心所麤显相故。与心不相应者。释细义也。谓彼心所及诸境界与三细心不相应故</p><p>论。麤中之麤至是佛境界述曰。次下辨相。于中有二。初约人对辨。后辨相所依。此初也。前三染心是事识故俱名為麤。于中初执相应染。是我执故复更為麤。三贤内凡得无我智能觉此染故。言麤中之麤凡夫境也。谓不断染分别智染是法执故。染中稍细故。说此二麤中之细。其后三染是本识故。俱名為细。于中初二能见能现。有能所故。对后业相故。得名麤。始从初住修唯识观。乃至十地无分别智。能觉如是四种染相。故言麤中之细细中之麤菩萨境界。第六根本业不相应染能所不分行相微细。于三细中复名為细。唯有如来方能觉了。故言细中复细是佛境</p><p>论。此二种生灭至境界义故述曰。次辨相所依。于中有二。初顺辨生缘。后逆显灭义。此初也。文中二义。先明通缘。后显别因。通而言之。麤细二识皆依无明住地而起。以本无明熏于真如起二细相。无明复熏此三细相转起三麤。故二生灭皆依无明熏习有也。别而言之。依无明因故生三细相。依境界缘起六麤相故。云依因者不觉义故等。此中文闕各举一因具义而说。麤细二识各具二因。即是二种生灭因缘。如前已明。此无烦举。是释经言不思议熏及不思议变。是现识因无始<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。及六尘境界是事识因。以义释经准可知也</p><p>论。若因灭至相应心灭述曰。次下逆显灭义。于中有二。初正辨。后释疑。此初也灭有二义。先通。后别。言通灭者。谓得对治无明灭时。无明所起现识境界亦复随灭。故言因灭即缘灭。别显灭者。以三细灭识亲依无明因生。无明灭时亦复随灭。故云因灭故不相应心灭。其三麤识亲依境界缘生。故境界灭时亦复随灭。故言缘灭故相应心灭。此依始终起尽道理以明二种生灭之义。非约剎那生灭义也</p><p>论。问曰若心至说究竟灭述曰。次下释疑。先问。后答。此初也。谓闻前说境界灭故相应心灭。即谓相应心体亦灭。故作难云。若境灭时相应心体亦随灭者。心体既灭。业转现三且未合尽。依何相续。故言若心灭者云何相续。若谓心体不灭尽故令无明相得相续者。心不灭故彼无明相应常相续。云何治道说究竟灭</p><p>论。答曰所言至非心体灭述曰。下答有三。谓法喻合。此初也。谓前所言境界灭时相应心灭者。妄境灭故但是事识麤心相灭。非谓事识真心体灭。无明既非真心。自体得对治时无明灭。故彼不相应三细心相得究竟灭。而亦非是真心体灭。此即略答前二问也</p><p>论。如风依水至非是水灭述曰。此举喻也。文中四句。答前二喻如风依水有动相者。显妄依真起。若水灭等者。显真灭妄随。以水不灭等者。显真存妄续。以此三句答前问也。唯风灭故等者。妄灭真存。答后问也</p><p>论。无明亦尔至非心智灭述曰。此法合也。无明亦尔依心体动者。显离于心不能自动。若心体灭。眾生断绝。无所依止者。谓境灭时心体灭者。则无明风无所动故。其业转现眾生断绝无所依止。以体不灭心得相续者。以境灭时体不灭故。无明三细不相应心而得相续。良以无明灭故境界灭。非境界灭故无明灭。由是义故。境界灭时无明动心三细相续。此答初问。显其相应心灭义也。唯痴灭故心相随灭非心智灭者。以彼无明痴风尽时业等动相亦随灭尽。非净心体而亦随灭。是答后问。显不相应心灭义也</p><p>大乘起信论略述卷上</p><p>大乘起信论略述 卷下</p><p>宝应贰载玖月初于沙州龙兴寺写讫</p><p>建康沙门曇旷撰</p><p>论。复次有四种至起不断绝述曰。生灭门内大分有二。于其第一生灭法中前来已明染净生灭。显前此识能摄法义。次下辨其染净相资广显能生一切法义。于中有四。一略标举熏习之数。二列染净熏习之名。三广染净熏习之义。四明二熏尽不尽义。此初也染法不断故有有漏六趣凡夫。净法不断故有无漏三乘圣者</p><p>论。云何為四至所谓六尘述曰。此列染净熏习名也。所言净法名真如者。生灭门内本觉真如以体本来自性净故内熏返染□治净故。外熏应机成净缘故。一切染因名无明者。根本无明為□细染因。枝末无明為六尘染因故。所言业识為妄心者。体非真□真中本无。為彼无明妄熏起故。所言六尘為妄境者。从妄心体自妄现。為彼事识妄心取故。然四法中初一净熏。后三染熏。彼□法自性差别故具说三。显彼净法体无别故总明一种</p><p>论。熏习义者至则有香气述曰。次下广释熏习之义。于中有二。先总。后别。□□亦二。初喻。后合。此初也。此中衣者。互通喻于真如无明。而言香者是通好恶。随应亦喻真如无明。互為能所熏成气故</p><p>论。此亦如是至即有净用述曰。此法合也。文中复显染净熏义。真如无染无明熏故有染相者。以生灭门本觉真如非定常一故。為无明熏起染相。妄熏无有返染用故。但言染相不言用也。无明非净真如熏故有净用者。生灭门内本觉真如内熏不觉。令成厌求返流顺真。故言净用。良以一识含此二义更互相熏遍生染净。故说无明熏真如等</p><p>论。云何熏习起染法不断述曰。次下别明熏习之相。于中有二。先染。后净。染中亦二先问。后答。此初也</p><p>论。所谓以依至身心等苦述曰。下答有二。先略。后广。此略也。此中略明三熏习义。所谓以依真如法故有无明者。即举覆熏无明体也。无明妄法不能自立故。说依真有无明也。以有无明染法因故即熏习真如者。根本无明覆熏义也。以熏习故有妄心者。即依无明熏动真如有业识也。此则略辨无明</p></div>"
}]