[{
    "title": "大乘百法明门论开宗义决 第2812部",
    "author": "昙旷大师",
    "html": "<div class=\"B1_text\"><p>大乘百法明门论开宗义决</p><p><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>曇旷撰</p><p>夫广阐宏宗是资畅辩。委陈眾义必藉累论。是以至觉谈经菩萨製论。教门广辩章疏繁兴。杜彼耶师坦兹正道。[这-言+(厂@火)]张智海崇峻义山。遐布慈云普垂法雨者也。余以冥昧滥承传习。初在本乡切<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>俱舍。后游京镐专起信金刚。虽不造幽微而粗知卤亩。及旋归河右方事弘扬。当侥薄之时属艰虞之代。暮道者急急于衣食。学者役役于参承。小论小经尚起悬崖之想。大章大疏皆坏绝尔之心。懵<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>于终身。愚四諦于卒寿。余慷兹虚度慨彼长迷。或补前修之闕文足成广释。或削古德之繁猥裁就略章。始在朔方撰金刚旨赞。次于凉城造起信销文。后于撰煌撰入道次第开决。撰百法论开宗义记。所恐此疏旨敻文幽学者难究遂更傍求眾义开决<a href=\"/remen/shuwen.html\" class=\"keylink\" target=\"_blank\">疏文</a>。使失学徒当成事业。其时巨唐大歷九年岁次(子六月一日)</p><p>谓依建立阿赖耶识了教等者。依瑜伽论。诸圣教中若未建立阿赖耶识。皆非了义顺小乘宗随转理教。若已建立阿赖耶识。当知皆是了义大乘。此论依斯了义教起</p><p>依本后智发深慈悲等者。由根本智得生同体。起后得智见苦生悲。同体智悲是為深矣。此悲与智菩萨所行。依斯造论是依妙行</p><p>三生圆照等者。问。与起胜解有何差别。答。前离二边。此契中道。前离偏见。此生圆智。前约理生解。此依境成证。所望义别故分两门</p><p>具明真俗双显有空等者。于五法中。前之四法具明俗諦。第五无為具明真諦。前五种法即是显有。后二<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>即显其空。既此真俗有之与空体不相离。即此真俗非有非空。不著二边得中道也</p><p>具说染净所断证修等者。染即贪等。净即信等。染即所断。净即所修。所修是智。所证是理。今依起行而进趣也</p><p>若分若满转依等者。然此转依说有六种。一损力益能转。在地前位。损本识中染种势力。益本识中净种功能。令诸<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>或不现行。烦恼现行即深惭愧。由惭愧故崇善拒恶。有二胜得為能转体。信数初增久不增故转染依净。二通达转。在见道中。由见道力通达真如。断分别生<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>麤重。<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>一分真实转依。三明修习转。初在信地已去十地已来。修习十地行故。渐断俱生二障麤重。四果<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>转。谓究竟位。由三大劫阿僧企耶修集无边难行胜行。金刚喻定现在前时。永断本来一切麤重。顿证<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>圆满转依。穷未来际利乐无尽。五下劣转。在二乘位。通无有学。一唯自利。二有欣厌。三唯达悟生空。四唯断烦恼。五唯证真择灭。六无胜功能。择灭者。谓即真如。由慧择得此灭理故。无胜堪能者。无一切智故。六广大转。谓大乘菩萨位。恒利他故趣大<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>俱无欣厌。具能通达二空真如。双断所知烦恼障种。顿证无上菩提涅槃。有胜堪能名广大转。所取转依体者广大。转捨二麤重而证得。不言圆满转者。圆满转对菩萨说。广大转对二乘说。又解。既言广大转。明圆满亦在其中。略举一隅耳。此中转依则满分果。谓如六种转依义中。损力益能转通达转修习转即是分果。究竟转者是满果。下劣广大二种转依通大小乘<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>满分。诸转依恐繁不叙。乐者广之</p><p>无知疑惑颠倒僻执等者。无知即是<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>凡愚。于邪正教都无所解。疑惑即是欲入法人。于邪正教怀犹豫者。颠倒谓是错入邪教谤毁<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。诸外道等。僻执即是佛法之中诸部小乘及胜空者</p><p>龙猛菩萨等者。即旧所云<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>。正云那伽遏罗树那。那伽是龙。遏罗树那是威猛义。古翻错误译云龙树。而此菩萨有龙威猛。一切道俗无敢仰视。人若瞻睹妄言失叙。时表其迹号龙猛焉。造<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>等数十部论盛德高踪。具如别传</p><p>圣提婆者。圣是华言。提婆梵语。此译為天。即广百论主圣天菩萨也。此是龙猛上足<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。造四百论盛行印度。经百广百已传东夏显正摧邪。具如别传</p><p>证法光定者。谓于此中证希有定。能发智光照了法故。或云日光明定。从喻為名也</p><p>即付法藏第二十二传法主者。传中名曰婆修盘陀。法花论云婆藪盘豆。若正论云筏苏伴度。旧译天亲。今名世亲。言筏苏者即世主天。言此天者是世间主。故号此天名為世主。言此世天而為亲友。故新旧译随举一名。圆暉法师楞伽疏中。不许世亲是二十二。传法人数深為迷谬。况法藏传云此圣者造五百论。其名又同。故知定是传法主也。是北印度健驮罗人。兄弟二人皆入佛法。长兄无著修学大乘得证初地。小弟邻持修学小乘得阿罗汉。世亲聪颖五印钦崇。凡所造论千代龟镜。无著菩萨见弟世亲具大乘性。恐证小果欲為开悟令归大乘。遂託有疾而诱唤。世亲闻命不远而来。无著密使二人迎候。令于夜分近世亲房。一人诵阿毘达磨经摄大乘品。一人诵花严经十地品。世亲闻法悲悔交生。如斯妙法我先毁谤。过由此舌。宜断截之。即执利刀欲自断舌。忽见无著住立其前。执持手闭谓之曰。夫大乘者究极之法。吾欲诲尔。尔其自悟。悟其时矣。何善如之。诸佛圣教改轨是悔。先以舌毁谤大乘。今应以舌而广讚释。空断其舌何所益為。作是语已忽然不见。世亲深悟遂不断舌。以至无著请问大乘。无著遂為造摄论本令其造释。授十地经使其造论。故此二论世亲菩萨初入大乘创所造也。盛得极多具如别传</p><p>求此果时唯取此因等者。既求此果唯从此因不取餘故。彼果唯从此因而生不从餘生。故知因中定有果性。若言因中无果性者。则应一因生一切果。既无此果性而能生此果。亦无餘果性何不生餘果。或因一果一切因生。以于一因中本无此果性此果得生者。于一切因中亦无此果性应生此一果。因中有果其理善成。今应问彼执见者曰。因果两相為异不异。若不异者不成因果。因果二相无差别故。因果无别果从因生。因果既同因从果起。因中有果不应道理。若异相者。因中果体為未生相為已生相。為未生相。果犹未生而说是有。不应道理。若已生相。果体已生复从因生。不应理。故知因中非先有果。然要有因待缘生果</p><p>从缘显了宗者。即前因中有果论者及声论师皆说。诸法体自本有从眾缘显。非缘所生。谓既因中先有果性。后从缘生。不应道理。然非不用功力而成。要从功用而果显了。应问从缘显了宗曰。若说因中先有果性。何故不显待缘方显。若有障缘令不显者。何不障因但障于果。譬如黑闇障盆中水亦能障盆。此亦尔故。若彼障缘亦能障因。从缘显了何但显果。<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>两法共成一果。但从缘显不应道理</p><p>去来同现皆实有等者。彼作是执。若法自相安住。此法真实是有。此若未来无者。彼时应未受自相。此若过去无者。彼时应退失自相。若无未来谁生现法。而现在法得成果耶。若无果者则无彼果。寧说现在而為因耶。若定无者诸法自相应不成就性不真实。既许现法是其实有。寧拨过未為非有耶。应问彼曰。去来两相与现在相為异不异。若不异者。立三世相不应道理。若是异者。去来实有不应道理。又更问。汝堕三世法為是常耶為<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>耶。若是常者。其体凝然。堕于三世不应道理。為无常者。于三世中恒是实有不应道理</p><p>起色受相行识显时别有等者。彼作是言。若无我者。见色觉时。唯应但起色相之觉。不应别起我相之觉。受相等觉应知亦然。既先不起思觉五事。唯起五种我相之觉。是故决定知实有我。应问彼云。计我之觉為取<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>境為取比量境。若取现量者。如何唯说色等诸蕴是现量耶。若取比量。如愚稚等不能思度。不应率尔起于我觉。又所执我為善不善。若是善者。何為极恶愚痴之人深起我见而能增长诸恶过失。若所执我是不善者。不应正说及非颠倒。既非是善即是邪倒。计我实有不应道理</p><p>极微等法一切<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>等者。彼依世定所得天眼。自见其身及诸世间。从前世来无有断绝。计我世间皆是常住。或依世定而起是见。计有為先有果生起。离散為先有果灭坏。谓从眾微麤物果生。分析麤物唯至微住。故极微常麤物无常。应告彼曰。我及世间為有变异為无变异。若有变异。执此世间皆是常住不应道理。若无变异则无差别。有种种相不应道理。极微论者我今问汝。所执极微有方分不。若有方分应可分析而计為常不应道理。若无方分则无质碍聚生麤色不应道理</p><p>说苦乐等宿因作等者。彼见世间。虽具正方便而招于苦。虽具邪方便而致于乐。故起是思立如是论。说苦乐因定皆宿作。若现受苦由宿恶业。若勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>极修苦行。能吐旧业现在恶因。由不作因之所害故。如是于后不复有偏宿因所感。及现苦行所招苦恼一切皆尽。能证后身苦尽涅槃。应问彼曰。若说现苦皆用宿作恶业為因。汝于现法所修苦行。為用宿作恶业為因。為用现法方便為因。若用宿作恶业為因者。说是现在新修苦行能吐旧业不应道理。若用现法方便為因。汝先所说世间苦乐皆由宿因不应道理。故知世间所受苦乐亦由现法非定宿作。或由现身听闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。于现身中而得证悟</p><p>欲<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>等事皆返等者。谓见世间诸有情类。于彼因时欲修净业。不遂本心反更為恶。于彼果时愿生善趣。不遂本心反堕恶趣。意欲受乐反受诸苦。由见如是彼作是思。世间诸物必应别有作者生者及变化者。為彼物父谓<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天。或复其餘。应问彼曰。大自在天变化功能。為用先业為不用耶。若用先业為因起者。唯此功能用业為因。非餘世间。不应道理。若无先业而自起者。唯此功能无因而起。非世间物。不应道理。又更问汝。此自在天為世间摄為不摄耶。若言摄者。自同世间遍生世间。不应道理。若不摄者。即非世法能生世间。不应道理</p><p>爱肉梵志等者。谓于挣竞恶劫起时。诸<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>违越古昔婆罗门法。為欲食肉妄起计云。于彼祀中咒术為先害诸<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。若能祠者若谓害者。若诸助伴皆得生天。应问彼云。此咒术力為是正法為非正法。若是正法。害生祠祀非法处用。不应道理。若非正法。用咒害生皆得生天。不应道理。若言如毒為咒所伏不能為害此亦尔者。此咒亦能除三毒不。若言能者。不闻一人贪嗔痴毒静息可得。若不能者。用咒害生除非法业。不应道理</p><p>忆坏成劫观上下傍等者。忆念坏劫即于世间起有边想。忆念成劫即于世间起无边想。下通无间上至四禪更无所得。起有边想。傍一切处不得边际。尔时即起边无边想。翻第三句傍一切处及与上下作非有边非无边想。今问世间有边见者。从前劫坏后劫起不。若言起者。因前有后计世有边。不应道理。若无起者。汝今依此世间而住。计世有边。不应道理。因有边见遂执无边。无边等皆是虚妄</p><p>不死矫乱宗者。谓有四种不死矫乱。一觉未开觉。怖畏他人知其无知。不分明答我无所知。二于所证起增上慢。惧他詰问怖畏<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。故不明说我有所证。三觉已开悟而未决定。怖畏妄语惧他詰问。故不明说我不决定。如是三种假託餘事以言矫乱。四羸劣愚钝。世出世道皆不了知。于世文字亦不能了。惧他詰问知其愚痴。但反问彼。随彼言转便自称言。我所依学不死净天。而乱詰问于彼所问以言矫乱。是故名為不死矫乱。显扬论中不破此计。以是愚痴无定宗故</p><p>诸法无因宗等者。依世静虑及邪思惟。见我世间无因而起。或复有时见诸因缘空无<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。谓见世间都无因缘。大风卒起于一时间亦无因缘寂然止息。大河弥漫宛然空竭果木敷荣颯然衰杂。由如是见立无因论。我及世间无因而起。今应问彼。世间诸物种种生起。或欻然起。為无因耶為有因耶。若无因者。种种生起忽复不生。不应道理。若有因者。计我世间无因而生。不应道理</p><p>死后断灭宗等者。彼依世智而作是思。若我死后复有身者。应不作业而得果报。若我体性一切永无。所受业果岂得為有。观此二种理俱不可。故起此见立如是论。今应问彼。断见灭者為蕴断灭為我断灭。若蕴断者。蕴体无常。既非常有亦非常无。因果展<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>起不绝。而言蕴断灭不应道理。若我断灭。汝先所说麤色之身死后断灭。欲尘诸天色尘诸天四无色处于彼所摄。不应道理</p><p>见行<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>得果皆差者。谓依世间诸静虑故。见世施主一期<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>恒行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。从此命终生下贱家贫穷柜乏。复见有人恒行妙行。命终之后堕诸恶趣。或行恶行反生善趣。又父母却為男女。见有男女却為父母。见如是事故作是斯惟。定无施与无妙恶行。亦无果报无父母等。今应问彼<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>论者。汝许业果有后受不。若许有者。汝先所说都无妙行亦无恶行无业果报。不应道理。若言无彼后所受者。诸有造作净不净业。即于此生顿受一切净不净果。不应道理。又应问彼无父母者。凡从胎藏及从种子而生身者。彼等于此為是父母為非父母。若言是者。即汝所言无父无母不应道理。若言非者。从彼胎藏及从种子而生此身言非父母。不应道理。為父為母时即非男子。為男女时即非父母。故约现身无不定果。故此所言不应道理</p><p>说婆罗门最胜等者。為斗挣劫诸婆罗门贪于名利及恭敬故作如是计。婆罗门种是其最胜。剎帝利等是下劣种。白色黑色当知亦然。是梵王子梵王口生。剎帝利等从脐膝脚跟处生。婆罗门种可得清净。性能修习真梵行故。今应问彼计最胜者。婆罗门种有父母不。若言无者。应是化生。汝傍现事不应道理。若言有者。言修梵行餘不能修。不应道理。又从种故名之為胜。谓从戒闻得名為胜。若由种类故為胜者。汝论中说由祠祀中闻胜戒胜。不应道理。若由戒闻得名胜者。说婆罗门是最胜种餘是下劣。不应道理</p><p>执鸡狗等诸戒清净等者。為有外道得世定通。见鸡狗牛死已生天。或见露形或堕灰土或受苦恼得生天上。不能善知缘起道理。起如是见立如是论。学彼狗等而持彼戒。是名清净皆得生天。或有妄执纷陀利河婆呼陀河伽耶河兢伽河等其水清净。于中沐浴所有罪障一切除灭皆得生天。今应问彼计清净者。执受净物行净行故得清净耶。為受秽物行恶行故得清净耶。若由执净行净<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。世间共许狗恶不净。而汝许执受狗等戒得清净者。不应道理。若执不净行恶行故得清净者。自恶不净能令他净。不应道理。又由内净故究竟净。為外净故究竟净耶。若由内净者。河水沐浴而得清净。不应道理。若由外净者。内具垢惑但除外垢。不应道理</p><p>于日月星常行等者。谓有获得世间净虑。世间同谓是阿罗汉。世人有欲自在快乐所祈遂者便往请问。然彼不知业果相应缘生道理。但见世间日月薄蚀星辰失度。尔时眾生净不净业果报成熟。彼即计為日月等作為信乐者建立此论。今应问彼计吉祥者。世间所有兴衰等事。為是日月星度等作。為净不净业所作耶。若但日月等所作者。现见随造福非福业感盛衰等。不应道理。若由净秽业所作者。言由日月等。不应道理</p><p>小乘宗异部有二十等者。异部执论偈颂中云。十八及本二。皆从大眾出。无是亦无非。我说未来起</p><p>本上坐大眾等者。此义广如宗轮论疏。今应略叙显其本末。佛涅槃后百有餘年。末兔罗国有一商人。婚娶幼妻生一儿子。顏貌端正字曰大天。商人远游多歷年岁。子既长大母逼行丞。后闻父还惧而有嫉。与母设计鴆而杀之。恐秽迹彰共逃他国。于彼遇见门师罗汉。恐泄家事矫请杀之。母后他非子见忿怒。悔怨既极遂亦杀之。虽造三逆不断善根。投僧<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>望灭重罪。既出家已精懃诵习。性识聪敏圣教遂通。王臣道俗无不钦重既耽名利恶见便生。遂自诈称得罗汉果。王迷凡圣频请<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。见诸宫女不正思惟。于夜梦中漏失不净。弟子浣衣怪而问云。既是罗汉寧有漏失。彼矫答言。魔嬈故尔。以彼天魔常恼佛法。纵成无学亦被嬈之。又诸漏失有其二种。烦恼漏失罗汉即无。不净漏失无学容有。我被魔嬈有漏失焉。又彼欲令弟子亲附。次第诈记四沙门果。时诸弟子自怪无知所得果证。咸来请问。彼答。无学亦有无知。以此无知有二种故。染污无知无学即无。染无知者是烦恼障。能障涅槃。令诸眾生受<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>身。不染污无知无学犹有。不染污无知者是所知障。于境不了。令诸菩萨及二乘等受变易身。汝虽得果不能自知。又于一时弟子啟白。曾闻圣者已度诸疑。如何我等尚疑諦宝。彼答。罗汉亦有疑惑。以诸疑惑有二种故。随眠性疑罗汉即无。处非处疑无学犹有。汝于諦实岂得无疑。后诸弟子又复问言。经说圣者得真慧眼自证<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。我等今者如何但由师言悟入。彼即答言。有阿罗汉但由他入不能自知。如<a href=\"/remen/shelizi.html\" class=\"keylink\" target=\"_blank\">舍利子</a><a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>第一。佛若不记当不自知。况汝等辈不由他入。彼虽造罪不起邪见。自怀罪重当受何苦。忧恼所逼夜唱苦哉。近住弟子闻之惊怪。旦问安知。彼答甚善。又问昨夜何唱苦哉。彼矫答言。我呼圣道。谓有圣道若不至诚称苦命唤终不现前。故我昨夜唤圣道耳。大天于后集先所说五恶见事而作颂曰。餘所诱无知。犹豫他令入道因声故起。是名真<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>。十五日夜洒陀时次。当大天昇坐诵戒。后便自诵所造伽他。尔时眾中有学多闻持戒修静虑者。闻彼所说无不惊呵。咸即翻对所说诵云。改第四句言非佛教。于是竟夜斗挣纷然。乃至崇朝朋党转盛。城中士庶乃至大臣相次来和皆不止息。时王闻见亦复生疑。由斯乖挣分成两部。贤圣用内耆年虽多而僧数少名上坐部。大天用内耆年虽少徒眾即多名大眾部。至佛灭后二百年初。大眾部中因有乖挣前后四破分成九部。初第一破分出三部。一者说世出世法皆是假名一说部。二者世法颠倒出世法是实名说出世部。三者部主乃是鸡之种胤名鸡胤部。第二破者。谓此部主学过本宗名多闻部。第三破者。说世出世亦有少假名说假部。第四破者。有一外道大眾部中出家多闻住制多山。重译五事分成三部。一者即此徒眾依本所居制多山部。二者一类住在制多山西名西山住部。三者一类住在在制多山北名北山住部。故大眾部四破分别本末别说共成九部。其上座部。三百年初四百年末。本末七破為十一部。第一破者。有一大德造发智论。本部被难移入雪山名雪转部。即学论者说诸法有名说一切有部。二于有部流出一部。即是古仙染牛生种名犊子部。三者于犊子部分出四部。一者部主有法过人可上名法上部。二者部主性贤是贤圣种名贤胄部。三者部主量法刊正无邪名正量部。四者部主所居山林繁密名密林山部。四从有部流出一部。谓此部主本是国王名化地部。五从化地部流出一部。部主含法如藏之密名法藏部。六从有部流出一部。部主乃是饮光仙种名饮光部。七从有部复出一部。依经立量不依律论名经量部。如是上座本末重破。兼本共成十一部。计通前九部為二十部。是谓此中诸部名义</p><p>及依蕴等别有我者。此宗所说<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>等法。一一别说即无作用。若和合时即有总相主宰作用。如车舍等。林木各别作用便无。若和合时便有实用。此亦如是</p><p>三世蕴等而皆实有者。谓此部执。有為之法三世有体。而其作用或有或无。法在未来未起作用。然為未来生相所生流入现在。住相所住方起作用。异相所异而有衰变。灭相所灭流入过去。所说灭者。但灭作用名入过去。非灭法体。如运一筹至百千位。但名有殊而体无别。由是义故三世皆实</p><p>去来蕴等皆是无者。彼宗所说去来非实。与现在法有差别故。若言三世法体皆实。不应作用唯在现在。不尔作用与体应异。若与体异不应名用。如色异声色非声用故。现法实去来无体</p><p>现在蕴实积聚法故等者。谓此宗说色心等法细实麤假。极微是实色体性故。麤色是假共和合故。一实极微非眼识境。合成麤色方眼识缘。纵一极微亦是蕴摄。蕴者聚义故蕴是实。和合生识即名处界故处界门法皆是假</p><p>世出世法皆非实等者。问。此与大乘义有何别答。由执诸法定是假立。不同大乘假实双泯。但说诸法皆假非实。不说诸法非实之因。不同应理一切诸法皆从心生。又殊胜义空。由胜义故诸法非有。故与大乘有差别也</p><p>深密等经為不了义等者。谓此宗中以三无性為真了义。遣三性故即说三性体不可得。依计所执立想无性。显计所执即无体相。依自依他立生无性。如何但无自然生性。胜义无性当知亦然。故深密等建立三性。有所存故非了义也</p><p><a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经等為非了义就偏说故等者。偏就空门遣一切相。以无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>即名胜义。由胜义故世俗成空。不由世俗胜义成有。故说皆空就偏说也</p><p>独觉智证与声闻同教既不多等者。同生空智证生空理。然独觉性利于声闻。不假广闻方能证悟。是故独觉教习不多。多同声闻入声闻藏</p><p>然此五乘有开合者。或有圣教于三乘外开人天乘。<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>十善因果别故。合不定性入三乘中。随所得果皆出世故。或有圣教人天合一。五戒十善世间法故。于三乘外开不定性。虽同出世种性异故</p><p>亦非年月定判后先者。真諦<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>亦立三时与此不殊而不取者。由约年月定判后先。说佛成道十二年来所说小乘名第一时。从十二年后至三十七年说般若等為第二时。三十八年至涅槃来所说中道名第三时。若作此说。花严经等成道初说。岂即初时。故约年月定判后先。有此过失而不取也</p><p>但以义类相从而说者。谓三时教对不定性。佛随根性说或前后。但虽前说对久根性。义同第三时即第三时摄。虽最后说对初根性。义同初时则初时摄。故花严经成道初说。义同第三时则第三时摄</p><p>契经应讽颂等者。此十二分教义类繁多。今但略释十二名相。一者契经。梵云修多罗。此有二相。一通二别。通即十二皆名契经。别谓长行。缉缀义理会理合机故名契。贯穿缝缀故名為经。能契即经持业释也。契物之经亦依主释。二者应颂。梵云祇夜。旧名重颂偈。应字属平去二声皆通。长行虽说理未尽圆。或有后来圣不重语应更重述应后来人。应有此颂应物之颂。有财依主二释皆通。三者讽颂。梵云伽他。旧云不重颂偈。谓前未说直以颂明。可讽咏故。故名讽颂。可讽之颂依主释也。四者记别。梵云和伽罗耶。此有三相。一记<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>当<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>事。二记弟子死此生彼。三谓记别诸法之义。记即是别持业释也。五者自说。梵云优陀那。谓不待请观机即说令法久住。或显悲深。自与说别相违释也。六者缘起。梵云尼陀那。旧云因缘。此有三相。因犯制戒。因事<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。因请说法。缘即是起持业释也。七者譬喻。梵云阿波陀那。谓以喻况晓所说义。举已见边显未见边令义平等。故名譬喻。譬即是喻持业释也。八者本事。梵云伊帝曰多伽。谓除自身说于过去弟子及法名為本事。本体即事。本世之事。持业依主二释皆通。九者本生。梵云闍陀那。说佛自身在过去世彼彼方所行菩萨行。本体即生。本世之生。亦通持业依主二释。十者方广。梵云毘佛略。此有二相。一谓说行菩萨胜道。二法广多高大长远。理正名方。教多名广。方理之广依主释也。十一希法。梵云阿浮陀达磨。旧名未曾有经。谓说八眾共不共德及餘最胜惊异之法。希有之法。法即希有。通于二释。十二论议。梵云优波提舍。此有二相。一佛自说。谓诸经典修环研窍磨怛理迦。二圣弟子已见諦者。依自所证无倒宣说。论体即议持业释也</p><p>略广分别十七地义者。但直分别十七地义。而不决释深隐奥义。是故但名為本地分。十七地者。一者五识身相应地。二者意地。三者寻伺地。四者无寻唯伺地。五者无寻无伺地。六者三摩呬多地。七非三摩呬多地。八有心地。九<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>地。十闻所成地。十一思所成地。十二修所成地。十三声闻地。十四独觉地。十五菩萨地。十六有餘依地。十七无餘依地。故瑜伽论总摄颂云。五识相应意。有寻伺等三。三摩地俱非。有心无心地。<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>所立。如是具三乘。有依及无依。是名十七地。广释名义如最胜子瑜伽论释</p><p>言大乘者谓菩萨乘者。大乘之言通因及果。是佛菩萨大人乘故言菩萨乘。就因而论。菩萨乘此到佛地故。若言佛乘约果而说。一切诸佛本所乘故。简异声闻小人之乘。故举菩萨而释大乘</p><p>剋用理智而為体者。以是能证所证法故。摄有无為一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故。一切功德之依处故。故与理智正為乘体。而于教果兼名乘者。以教显理。得理云教。智即是行。有行成果。是故教果兼名大乘</p><p>小乘唯明七十五法者。心法有一。心所有法有四十六。色法有十一。不相应行有十四种。无為有三。如是共成七十五法</p><p>有说本事广论未译但录名等者。若有广论此但录名不名别论。何故题中云百法论。若广论中录名数者。应言论中略录名数。寧言分中录名数也。由此故如是妄言耳</p><p>总上九号具包<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>六义差别故名<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>者。言九号者。即十号中前之九号。其第十号名世尊者。由前九号故得名耳。一者如来。二者应正等觉。即旧所云应供正遍知。三明行圆满。即旧所云明行足。四者善逝。五者世间解。六无上丈夫。七调御士。旧云无上士调御丈夫。八天人师。九者佛。十者世尊言三德者。一者恩德。即佛<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。巡数<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>化利眾生有恩德故。二者智德。即佛报身。以大智慧成就一切诸功德故。三者断德即佛法身。由断诸障显现真如万德体故言六义者。一者自在。永不繫属诸烦恼故。二者炽盛。炎猛智火所烧练故。三者端严。殊胜相好所<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>故。四者名称。一切世间咸称讚故。五者吉祥。一切天人皆供养故。六者尊贵。利乐一切无懈废故</p><p>虽此二义亦通无我等者。此通伏难。谓有难言。既言法者是轨持义。此义合通下一无我。何故五种独名為法。為通此难言难此等一轨唯有体无法非缘不生心故者。心缘有无生不生心有其二说。一云。缘无之时亦得生心。缘过去未来等心亦生故。二云不生。虽过未等外质是无。而有影像当情而现。要缘影像方得生心。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>分时心不生故。是故无法不得成缘。非所缘缘心不生故。既轨则者生物解义。是故轨义无法不成</p><p>二轨唯差别缘无我等者。此中差别谓即是句。言自性者谓即是名。故唯识论云。名詮自性句詮差别。且如颂云诸行无常。各别四名但詮自性。未合成句智解未生。合成句时差别于常方解诸行。是其无常故唯差别而在轨义</p><p>三轨唯有為要成因缘方生解等者。谓有為法方成因缘。仗因託缘方能生解。故轨则义唯在有為。其无為者既都无相。心不能缘不成因缘。不能生解不成轨义。不失自性持义则通。虽后得智有漏<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>亦缘无為而生智解。但是影像不是亲缘。不同正智故不為例</p><p>四轨唯后说持通前宣等者。此依因缘比量宗说。如<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>立声无常。声是前宣无常后说。但闻声字未能生解。若闻无常方有解生。是故轨义不通前宣。若论持义通前及后。解与未解守自性故</p><p>五轨唯能詮要名句文等者。能詮即是名句文三。所詮是义。虽所詮义亦能生解。而名句文生解用增。是故轨义唯在名等</p><p>故轨义局持义即通者。有轨义处必有持义。有持义处或无轨义。故轨与持通局异也</p><p>一缘虑义等者。然准四卷<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>注有二种心。一者质多缘虑之心。二者乾栗大贞实之心。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>皆名虚妄分别。攀缘思虑一切妄境。皆名质多缘虑心矣。既能变生一切诸法。是一切法贞实体相。是故亦名贞实心矣</p><p>三集起义等者。谓第八识能集染净诸法种子在识含藏。而能现起染净诸法。若前七识能集熏起。染净种子在本识中。令从本识起染净法。故楞伽云。心名采集业。意名广采集。故集起义八识皆通</p><p>若于方所现等者。于方所者。谓现前色不离方处故。所现骨锁等者。即观行者所观同类影像诸色。形显者。形谓形色。显谓显色。如是总名方所示现</p><p>此有四句等者。自有相应而非是行。即受想蕴。自有是行而非相应。即成就等。有非相应亦非是行。谓即色蕴。有亦相应亦是行者。即除受想诸餘心所。释义可知</p><p>心远独行者。谓说此心远通凡圣一切处行名曰远行。唯独一识唯一意识无别心所名曰独行</p><p>士夫六界者。谓地水火风空识也。于六界中但言识界不说心所。以心胜故</p><p>如<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>卒者。谓彼有情同业果报。同处同时共变狱卒為逼害事。非是心外实有狱卒。不尔云何不同受苦。诸小乘师释此义云。谓由业力感别四大。虽在火等而不受苦。大乘难云。若不受苦非地狱收。何趣所摄。小乘答云。鬼趣所摄。既许天上亦有傍生。地狱有鬼于理何失。大乘难云。天上傍生受天妙乐。地狱中鬼何无苦耶。若不尔者。如诸饿鬼于清水上见火浓河。人见為水。两类同处同时见殊。若法离心寧有是事。故诸色法不相应法皆不离心</p><p>此定非异色心心所有实体用等者。此中量云。此不相应定非异于色心心所有实体用。宗也。许蕴摄故者因也。如色心等者。喻也。并云。色心等法蕴所摄。非异色心有体用。不相应行许蕴摄。非离心等有体用</p><p>若异心等等者。此中量云。不相应行定非实有。宗也。心心所色及诸无為所不摄故。因也。如毕竟无。喻也。毕竟无者。即龟毛等毕竟无。心等不摄。毕竟无非是实有。不相应心等不摄。不相应亦非实有</p><p>然诸无為所知性故等者。此立无為不离心等有二比量。第一量云。然诸无為不应执為离色心等实无為性。宗也。所知性故者。因也。谓即无為是心智等所知性故。如色心等者。喻也。谓此色法是心所知。心心所法亦是所知。意识能知一切心故。总合并云。色心心所是所知。不可执為离心等。无為既是所知性。如何执离于色心。第二量云。然诸无為不应执為离色心等实无為性。宗也。是色心等所显性故。因也。如色心等者。喻也。所言色心所显自性者。此中所显有其四义。一以色显色。如灯照物等。二以心显心。如他心智等。三以色显心。以声说心等。四以心显色。如心缘色等。然三无為一一皆是色心所显。故佛地云。五蕴无处以显<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。断有漏蕴以显择灭。诸蕴不生显非择灭。是故无為是色心等所显性也。总结并云。心等皆是所显性。非是离心实无為。无為亦是所显性。寧离心等有无為</p><p>如正断等虽无前相等者。四正断者。一者已生恶不善法由正懃力断之令灭。二者未生恶不善法由正懃力令不得生起。三者未生诸胜善法由正懃力修之令生。四者已生诸胜善法由正懃力修令增长。此四正懃虽无前相。说四次第相。但约言说而為次第</p><p>应知皆是随转理门者。诸大乘经有二理门一者真实理门。谓说大乘究竟实理。如说八识二无我等。二者随转理门。且随初根说小乘法。如说六识人无我等。此非究竟。应可改转入真实理。名转理门。今大乘中有此义者。当知皆是随转理门。即<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>随人随意随时义也</p><p>然亦不许一念并生者。小乘论云。以一身中无二心故。等无间缘唯有一故。是故不得一念并生</p><p>开阿赖耶染净分位说九识者。真諦三藏译九识论亦同楞伽。其前八识与此不殊。第九名為阿磨罗识。意说赖耶离生灭染。即是真如名阿磨罗识。而亦不离第八净分是故无别第八识也</p><p>摄大乘论依前六识等者。无性论第四卷云。一身识。谓眼等五根。二身者识。谓五识所依意界。三受者识。谓<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>所依意界。此上三识以内六界為体。四彼所受识。谓外六尘。五彼能受识。谓六识界。六世识。谓似三时影现。七数识。谓似一等算数影现。八处识。谓似村等影现。九言说识。谓似见闻等言说相现。十自他差别识。谓即所起我我所执。十一善恶趣生死识。谓似五趣等相现。故十一识依于六识。根境识三而建立也</p><p>深密等经于阿赖耶等者。等即等取阿毘达磨经及唯识论。七种识名如下所列。谓阿赖耶异熟识无垢识是别分位而立别名。其根本识阿陀那所知依种子识通一切位。约通分位而立通名</p><p>摄论所说一意识宗等者。彼论所引一意识菩萨所宗之义。而不破斥彼合前六。但是一识由依六根别取六尘开六识名。非有六识。兼第七八总有三识</p><p>恒审思量胜餘识者。夫言意者思量為义。唯第七识恒审思量。由此应作四句分别。若第八识恒而不审。其第六识审而不恒。若前五识非恒非审。唯第七识亦审亦恒。是故恒审胜餘识也</p><p>纵色现前盲不见者。意显眼识不依色起。若说眼识定依色起。色现前时盲者应见。虽无色时眼识不生。以色比根依根义胜。根若坏时识必不起。纵有色时盲不见故</p><p>如病损眼识并见黄者。显发眼识必由眼根。如迦末罗病损坏眼根故于青色等并见為黄。只由根坏识谬见生。不由色坏眼识谬见。以色境相坏与不坏识称境知。若根坏时识即谬见。故发识用必在眼根不在色境</p><p>眼识种子随眼种生等者。谓根境识三种种子。眼根种起眼识种生。根种不生识种不起。不随色种眼识种起</p><p>若自在位乃至随根无相滥失等者。谓若随境立六识名。至自在位五根互用。眼根发识遍缘五尘為名触识。乃至鼻根发识缘境遍于五尘。是则五识皆名五识。有杂乱过。若其随根即无此过。纵其眼根能发之识缘一切境。但可随根名為眼识。即无杂乱</p><p>初通一切异生相续等者。言相续者谓即蕴身。今举蕴身故言相续。或依于蕴方得相续</p><p>法空智果等者。法空智者取正体智。而言果者取后得智及后智所引灭定。此二皆是正智果故。是故皆名法空智果</p><p>彼缘无垢识等者。等即等取异熟识也。若至<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>平等性智缘异熟识。菩萨第八未得转依但名异熟。有此差别故置等言</p><p>谓前七识皆是种生等者。七识是果。种子是因。然因与果皆名体相。体即是相无差别也。凡因与果虽非定一不可定异。无别性故即揽此种為第八识者。如唯识论第二卷云。阿赖耶识有其三相。一者因相。谓所持种能生染净法故。二者果相。即现识体是善恶业异熟果故。三者自相。即此种现摄持因果為自相故。言自相者即自体义。既摄因果以為自体。故用种子為第八识</p><p>异时而熟变异而熟者。谓诸种子有二因义。一牵引因。谓未润时以能牵引自远果故。二生起因。谓被润时以能生起近自果故。依牵引因立异时熟。未被润时与所生果时不同故。依生起因立变异熟。既被润以由因变异果方熟故</p><p>异类而熟者。由异性因异性果熟。谓诸种子复有二种。一者异熟。即是所熏善恶二种。此望第八无记种子而為因性。若无此种第八种子必不生故。二者名言。即通一切三性种子。各能亲辨自所生果。各望自果為因缘性。由善恶种令第八识名言种熟生五趣果。故善恶种名异熟因。是故说名由异性因异性果熟名為异熟</p><p>异义通因熟唯在果者。因谓识中善恶种子。果谓第八种子现行。此善恶因望无记果。因果各别皆得名异。不偏在果故言通因。及成熟时唯在第八种及现行言唯在果</p><p>异熟有二种子现行者。种子谓即亲生第八名言种子。现行谓即从此种生第八现识。此二皆是善恶业种之所招感异熟并名為果</p><p>若异属因是异之熟者。此下四句约其六释释异熟二字因果。四句名也。此之二句辨依主释。谓既前言异义通因。若将异义属善恶者。因熟唯在果第八种子现行。即是善恶。异家之熟依主释也</p><p>若异属果异即是熟者。既知异义亦在果上。熟唯在果。故异与熟二体无殊。异即是熟名為异熟。持业释也</p><p>异熟即识熟属现行者。此分四句又约六释释异熟识三字名也。此中所言异熟识者。若异熟属于现行现行是识。异熟与识既无别体。异熟即识名异熟识。持业释也</p><p>异熟之识熟属种子者。若以异熟属种子上。种与现识体既不同。乃是异熟种家之识故名异熟。依主释也</p><p>皆有思量能生义者。有思量义如前已明。生长义者谓即八识。十二处中意处所摄。生长门义是意处故。故杂集论第二卷云。谓七识界即是意处</p><p>小乘通依三世眼等者。眼等六识但在未来皆名為心。由未取境但体积集当生起故。随其一识缘会之时流至现在乃名為识。有了别用名為识故。若起用已灭入过去即名為意。能与后念作无间缘开避引导名意根故</p><p>异熟若是善染等者。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>即是生死因果。流谓集諦。转谓苦諦。还灭即是涅槃因果。还谓道諦。灭谓灭諦。凡言异熟皆谓无记。随善恶业任运相续。若是善者不随染缘。流转五趣应不得成。若唯染者不受善熏。还灭涅槃如何得立</p><p>慧与我见义用别故者。此通伏难。谓有难言。若一心中无二慧故。但有我见无餘见者。我即以慧用為自体。既第七识已有慧俱。如何更与我见俱起。故此答言。慧与我见义用别故。简择名慧。推度名见。义用既殊故得俱起。慧实见假而不相违。诸见既皆用慧為体。我见常起诸见更生。则一心中有二慧失。故有我见餘见不生。见与慧俱于理无失</p><p>剎那别缘不专一者。定能令心前念后念于境专注相续而住。此识但能念念前后各自别缘而住。于境无专注义故无定数</p><p>满业所招异熟果心等者。然业及果皆有引满。引业果者。即第八识。彼善恶业之所招引而為五趣总报体故。言引业者。即是能引此第八识善恶二业。满业果者。即六识中劣无记者。随善恶因之所招感。而為六识圆满果故。言满业者。即六识中善恶二业。能引自识无记性者。令自六识得圆满故。故<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>云。一业引一生。多业能圆满。即旧所言总报别报二业果也</p><p>由无计度随念分别者。此约三种分别说也。三分别者。如杂集云。一自性分别。谓于现在所受诸行自相行分别。二随念分别。谓于昔曾所受诸行追念行分别。三计度分别。于去来今不现见事思构行分别。若依俱舍。计度分别即以意地散慧為体。随念分别乃以意地诸念為体。自性分别通在六识。如鱼跃泉但任运故</p><p>由称量等起慢等故者。于称量中等取犹豫推度之义。于慢之下等取疑见。谓由称量上中下品而起七慢。谓由于境犹豫不决而起于疑。于境推求而起我见。故于两句皆置等言</p><p>不待名言及待此餘根境起者。不待名言者。谓不要待色声香等名言而取自所取义。不待餘根者。即分别根。谓眼识生但任运缘不待意根。先分别已然后了别。若缘瓶等要待名言及色香等方起瓶觉。不待餘境者。谓色等境一一皆用眾尘所成。如眼观色但直观色。不待别知此四大种及声香味触诸餘境故方了色相。故名不待餘境</p><p>以长短等亦色处收者。夫言处者生识為义。色生眼识故色為处。若使长短眼识不缘则非生识。寧色处收</p><p>具三七等一切分别等者。三种分别如前已明。七分别者。如杂集云。一任运分别。二有相分别。三无相分别。四寻求分别。五伺察分别。六染污分别。七不染污分别。初即三中自性分别。為五识身无异分别。于自境界任运转故。有相分别即是三中自性随念。取过现境种种相故。无相即是计度分别。而能希求未来境故。所餘分别当知亦用计度為性。所以者何。以思度故或时寻求或时伺察。或时染污或时不染污种种分别</p><p>不缘相分识中种子及相应法等者。谓经论中皆说末那唯是内缘不取外境。若取赖耶所有相分。相分即是外六尘境。即应末那有缘外失。种子虽在赖耶识中是识相分。若缘种子。与缘外相有何差别。是故不缘识中种子。赖耶心所虽不离心。曾无处说缘相分故。但说末那唯缘识蕴故。是故不缘赖耶心所。若尔何故经论皆说此末那识我我所执。疏中所言有处说执我我所者。正释此难。如文应知</p><p>内变执受种子色根者。言执受者有其二义。一识所依託安危事同。二以此為依能生本识。总而言之。摄為自体同安危义故名执受。不执受者谓不摄為自体之义。如器世界外六尘境及他依处。虽本识缘不摄受故</p><p>若变心等便无用等者。等即等取诸心所法。何故变心无实用耶。故下二句释此义云。相分心等不能缘故。若变心等即是相分。既相分心无能缘用。故赖耶识不变心等</p><p>须彼实用别从此生者。此释伏难。谓外难言。若变心等无实用者。寧有实用诸心等耶。故此答云。谓彼实用诸心心所别从此识种子而生。若尔何不一切境界皆从种生须现识变。答凡有二。一因能变。即从种子转变而生。二果能变。即诸现识变现诸境。诸现行识自是能变。不可更从能变识生。是故但从种子而变。由此应作四句分别。一自有因变而非果变。即诸现行心心所等。二自有果变而非因变。如分别变但為境者。三者因果俱变。如五根身器世界等。四者因果俱不变。如不闻见他方境界</p><p>若心心所无所缘相乃至餘如自故者。此立相分有二比量。第一量云。心心所法应不能缘自所缘境。宗也。无所缘相故。因也。如餘识境。喻也。自所缘者。且如眼识色為自境。若缘色时眼识之上不带色相。应不能缘。无色相故。犹如声境。谓眼识上不带声相。不带色相。如何缘色。香味触等准此应知。第二量云。或应一一心心所法能缘一切境。宗也。无所缘相而能缘故。因也。自所缘境。喻也。谓如眼识应能缘声。无声相故。如无色相而能缘色。香味触等准此说之</p><p>若心心所无能缘相乃至亦是能缘等者。此立见分亦有二量。第一量云。心心所法应不能缘。宗也。无能缘相故。因也。如虚空等。喻也。第二量云。或虚空等亦是能缘。宗也无能缘相故。因也。如心心所。喻也。虚空等者。等取真如及色法等。覆合并例准而作之</p><p>无自证分应不自忆心心所法等者。谓心心所但见前境。而不却能返见自体。是故经说刀指等喻。当见境时所有心行及至过后皆能自忆。谓我当时作是心行。向若尚无自证分心证智自心。如何于后能忆自心。如不曾更境不能自忆。故作量云。心心所法应不能自忆。宗也。无自证分缘自心故。因也。如曾更境。喻也。覆结并云。不曾更境无心缘。不曾更境必不忆。无自证分缘自心心等不应能自忆</p><p>勿真如性亦名能缘等者。此中意云。若正体智许无见分而能缘者。则应真如亦合能缘。无见分故。勿犹莫也。以正智无见分故而成能缘。令真如性成能缘义。既真如性无见分故不成能缘。故正体智是能缘故必有见分</p><p>说无相取不取相故者。即瑜伽论七十三说。取有三种。一有言有相取。谓言说随觉者取。二无言有相取。谓言说随眠者取。三无言无相取。谓是于言说离随眠者取。此正体智当第三取。说无相故便无相分。说取言故便有见分。下后智中有二说字。应知皆是瑜伽论说</p><p>带如相起不离如者。此中带者是狭带义。言如相者即真如体。此正体智所有见分。是内证故不离真如。即是狭带真如体相</p><p>离诸名言种类分别者。种类分别即是比度。以彼种种相似比类分别而知。今现量智直观现境。故离名言种类分别</p><p>于所观义有正智生等者。义有二种。一义者境也。如远见烟比厨中烟。定知远处必有于火。于其观火境之上有正智生。二义者理也。如佛弟子立声无常。所作性故。如瓶盆等。于此所观无常理上有正智生</p><p>若后得智亦通三量等者。缘自相故是现量智。缘共相故是比量智。缘过未故是非量智</p><p>若在初二静虑近分等者。然四静虑有四种别。一未至地。二中间禪。三近分定。四根本地。根本地者。即四静虑从前加行至本地中。故所至定名根本地。近分定者。是根本定所有加行。谓由厌下為苦麤障。欣乐上地為静妙离。能与本地而為近因名為近分。中间禪者。即是第二静虑近分。以初静虑有寻有伺。第二静虑无寻无伺。而此近分无寻唯伺。对前有无故名中间。未至地者。即初静虑近分定也。由出欲界未至初禪。故此近分名未至地。上地近分已至定地。不得此名不应為例。已彼初二静虑近分是彼根本静虑加行。未得容豫。虽有适悦而未周遍。故但名喜而不名乐。其二静虑已至根本。无所求趣适悦周遍。故约身心名喜名乐若法决定有境為主等者。為要三义方成所依。一者决定。简识起时不定有者。且于眼识十缘之中。虽要光明未必决定。如天眼等不必依故。二者有境。简决定中非有境法。谓餘六根遍行五法。餘虽决定而非有境故非所依。三者為主。简有境中遍行五法。虽是决定而非主故不名所依。唯五色根六七八识。具此三义具心心所。取自所缘乃是所依</p><p>要有缘法能作等者。谓开导依要具四义。一有缘法。简诸色法不相应行及诸无為。无能缘故不名為依。二者為主。简诸心所。虽有缘义而非主故不名為依。三者能作等无间缘。此简八识异类相望。四者此于后生心心所法开避引导。此简无学将入无餘最后剎那。要具四义方成依义</p><p>多同类种俱时转故者。诸识一一皆有多种一时俱起无开导力。且如眼识有多种子。皆是能生眼识功能。皆眼识种名多同类。此同类种俱时转故。展转相望非无间缘。如彼色法及不相应。同类俱转不得成缘</p><p>餘八识聚三界九地乃至文云故皆得作等无间缘等者。谓第八识三界九地皆容互作等无间缘。下上死生相开导故。有漏无间有无漏生。无漏定无生有漏者。镜智起已更无断故。若与无记相望亦然。若第七识三界九地亦容互作等无间缘。随第八识生处繫故。有漏无漏容互相生。十地位中得相引故。善与无记相望亦然。第六意识三界九地有漏无漏善不善等各容互作等无间缘。润生位等更相引故。若五识中。眼耳身识欲色二界。鼻舌二识唯欲界地。自类互作等无间缘。三性相望应知亦尔。有漏得与无漏开避。无漏不与有漏导引。事智起已必不断故</p><p>谓若有法是带已相心或相应等者。言有法者显其缘义。无法非缘必不生心。要有体法方成缘故。带已相者显所缘义。要带境相现于心上。令心得见成所缘故。心或相应是能带体。心谓心王。相应心所。谓此有法所带已相。乃是心王或<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>所或恶心所所虑所託</p><p>虽前三缘亦是增上等者。此通伏难。谓有难言。若是有法有胜势用名增上缘。前言三缘亦有此义。何故不得名增上缘。為通此难故作是言。虽前三缘亦是增上。若总名為增上缘者。是则四缘更无差别。為显四缘有差别故。除前三缘所不摄者皆入此摄名增上缘</p><p>生住成得四事别故者。诸有為法未有而有。名之為生。有情依器器依风等。名之為住。以宗因喻建立道理。名之為成。若能成立有為无為。名之為得。若有為法有胜势用令生住等。名之為顺。令不生等是则名违</p><p>应知即是二十二根等者瑜伽论九十八云。略由六处增上义故。当知建立二十二根。何等為六。一能取境界增上义故。二继嗣家族增上义故。三活命因缘各别事业加行士用增上义故。四受用先世诸业所作爱不爱果及造新业增上义故。五趣向世间离欲增上义故。六趣向出世间离欲增上义故。当知此中眼根最初。意根為后。如是六根于取境界有增上义。男女二根于能继嗣家族子孙有增上义。命根一种于受命者活命因缘各别事业加行士用有增上义。乐最為初。捨為其后。如是五根于其受用先业所作爱果及造新业有增上义。信為最初。慧為其后。如是五根于趣向世间离欲有增上义。未知当知已知具知三无漏根于能趣向出世间离欲最极究竟有增上义。一切世间所现见义其唯此量。当知是义能究竟者。无出于此二十二根故。一切根二十二摄。故為颂曰。眼耳鼻舌身。男女并命意。苦乐忧喜捨。信进念定慧。未当已具知。是名二十二。前五色根以本识等所变眼等净色為性。男女二根身根所摄。故即以彼少分為性。命根但依本识亲种分位假立非别有性。意根总以行识為性。五受根如应各自受為性。信等五根即以信进及净念等而為自性。未知当知根以资粮加行见道之中许后剎那于此三位信等五根意喜乐捨為此根性。始从见道最后剎那<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>乃至金刚喻定所有信等无漏九根。皆是已知根性。诸无学位无漏九根。一切皆是具知根性</p><p>种子即是习气异名者。然诸习气总有三种。一者名言习气。名言有二。一表义名言。即能詮义音声差别。唯第六识能缘其名。然名是声曲屈差别。唯无记性。不能熏成色心等种。然因名故心随其名变似五蕴三性法等而成熏。因名起种名名言种。一切熏种皆由心所。心所熏种由因外缘。二显境名言。即能了境心心所法。即是一切七识见分等心。非相分心。不能显境。顺趣种种所缘境义。依言说名。分别种种所缘境义。二<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>习气亦有二种。一俱生。二分别。谓虚妄执我我所种。随二我执所熏成种。令有情等自他差别。三有支习气。谓招三界异熟业种。此亦二种。一有漏善。即是能招可爱果业。二诸不善。即是能招非爱果业。此义出唯识论第八卷</p><p>此遮异熟心心所等者。四无记中后之三种。是强盛故而共能熏。唯初第一异熟无记。若第八识都不能熏。若六识中无记性者。有其二种。胜者法执而是能熏。劣者不执则不能熏。今言等者等取此也。若尔此性种从何有。既即无种从何现行。答。以诸种子有其二种。一者本有。二者新熏。此类无记虽不新熏。约本有种而生现行。故虽不熏生亦无失。若尔本识亦应如是。何要前七与熏种耶。答。理实皆须二种种起。若偏说一则成过失。故劣无记亦是六识与熏成就。此义稍难。应更思审</p><p>由此如来第八净识唯带旧种等者。既遮善染非是所熏。佛第八识唯是善故非所熏者。便有难言。若非所熏又非能熏。是则佛果应无种子。如何能生诸功德法。為通此难故云。净识唯带旧种非新受熏</p><p>说熏成彼相见种者。如唯识论第八卷说。前七识能与第八熏相见种。此依难陀新熏义说。若依护月本有义说。前七识熏但令增长</p><p>所仗本质是无记故者。本质即是第八识中相见分性皆无记</p><p>所起相分非善恶者。是七转识影像相分。若前六识所变相分从实质生。是性境故不随见分。故非善恶。若第七识所熏相分是带质境。虽通情本有覆无覆皆无记故</p><p>缘染净事依彼转故者。谓前六识缘染净事起染净相而成相转。虽行施等不能亡相。皆由染意為识依止。彼未灭时相了别转。末那灭已相转解脱。故前六识缘染净事。皆依末那而得成立</p><p>虽有定果色无业果色者。谓诸圣者及定自在变现种种色等境相。以定為因名定果色。若诸凡圣业因所感身色等相名业果色。未得定者唯有业果。<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>中唯有定果。若<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天二色皆无</p><p>谓阿罗汉出世道中等者。以染污意无始时来微细一类任运而转。诸有漏道不能伏灭。三乘圣道有伏灭义。真无我解违我执故。后得无漏现在前时。是彼等流亦违此意。真无我解及后所得。俱无漏故名出世道。灭定既是圣道等流。极寂静故。此亦非有。由未永断此种子故。从灭尽定圣道起已。此复现行乃至未灭</p><p>诸善法影常现前者。佛地经云。譬如明镜安在高臺。世间境界若非处在远闇障者。悉于镜中而现影像。如是如来大圆镜智安在法界真如理上。一切眾生不愚不迷不障中者。诸善法影悉于中现</p><p>谓一切性及地时俱者。一切性者。谓善不善有覆无记无覆无记。一切地者。谓即九地。欲界四禪四空為九。一切时者。但有八<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>起之时无时不有。一切俱者。谓与一切心及心所常相应起</p><p>善唯有一谓一切地者。然一切地有其二种。若前九地名一切地。轻安非欲非一切地。若有寻等名一切地。轻安即通于初静虑。有寻伺地有轻安故</p><p>染四皆无者。谓本烦恼随烦恼并名為染。不通善故非一切性。不遍三界非一切地。善心时无非一切时。非并头起非一切俱。而贪痴慢等亦通三界。如何说言非一切地。答。虽贪痴等通在九地。而嗔烦恼唯在欲界。以不全故非一切地。以随烦恼同根本惑。四义皆无。故瑜伽论合之為一。总為五位</p><p>谓此惊觉应起心种等者。谓此作意性能惊觉。若此种子惊起诸餘心心所种令起现行。若至现行引令趣境。此虽与心同时而起。然有惊能。如信与心虽同时起说能净心。此亦尔故</p><p>触依彼生等者。此中彼者即是三和。触因彼生者从因立名。因彼三和而生触故。令彼和合者从果立名。谓因触力三和合故。说為彼者释上立名。释前触位三合名也</p><p>三和合故皆有顺生等者。谓根境识三和合时。一一皆有顺生受等心所功能故言皆有。三和合位有顺生能。异未合时故名变异</p><p>触似彼起故名分别者。言分别者即领似义。触生似彼顺生功能。领似变异故名分别。如子似父名分别父。非谓能缘之分别也</p><p>能起合离非二欲者。释前起爱為业言也。此中欲者即是爱故。谓领顺境而起合欲。领违境相而起离欲。领俱非境起非二欲。非二欲者即是非合离欲也</p><p>谓能取境正因等相者。谓于境中引发善思為正因相。引发邪思為邪因相。引发无记思為俱非因相。此中意说。由三性思缘三因境。随其所应驱役自心令造善等</p><p>小乘论名通大地法者。地谓行处即是心王。是彼心所所行处故。大谓受等诸心所法通于三性心中行故。心王是此受想思等大家之地。名為大地。受等又是大地心家所有之法。名大地法。此法遍于三性心等。名通大地法。是持业释也。故俱舍颂云。于一切心</p><p>如非四境率尔堕心者。如非所乐决定曾习所观四境。无四境处都无别境。率尔堕心者。谓诸心起有五种心。一者率尔。二者寻求。三者决定。四者染净。五者等流。识初堕境名率尔堕。虽缘善恶未知善恶。次起寻求既识善恶。次起决定。既决定已便起染净。于怨住恶。于亲住善。于中住捨。一剎那后同性而起名等流心。于五心中。染净心后方有欲等。故初堕在率尔心时无别境也</p><p>惭等虽善非净為相等者。此通外难。谓有难言。若说心净名為信者。若净即心应非心所。若令心净惭等何别。惭等亦能令心净故。如何唯说心净名信。為通此难故有此文</p><p>依自法力等者。自谓自身。法谓教法。依杂心论。显三增上而起惭愧。一自增上。即上品人。护于自身不作诸恶。二法增上。是中品人。為护圣教不造诸恶。三世间增上。谓下品人。护世名利不造诸恶。今依自法而起于惭。依世间力而起于愧</p><p>崇重贤善者。贤谓贤圣。善即善法。崇谓崇贤。重谓重善。或贤与善皆有崇重。下无惭愧轻拒贤善。崇重暴恶亦准应知</p><p>于有有具等者。有谓三有之果。有具即生有之因。苦谓三苦。生三苦缘名為苦具</p><p>观有等立非要缘彼等者。此前后文亦通外难。谓有难云。于有无著时则不于苦无恚。若于苦无恚时即不于有无著。故无贪嗔不得并起。寧说此二俱遍善心。故作此通。如惭与愧崇善之时必是拒恶。拒恶之时必是崇善。非要别观善恶二境别起二心。今此亦尔。于有无著时必于苦无恚。于苦无恚时必于有无著。為观待此而说二名。非要别观有之与苦二种别心起无贪等。故无贪嗔俱遍善心谓初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>长时等者。创发大愿名初发心</p><p>修经三大劫名长时修。恒行不断名无间修。于行恭敬名慇重修。无行不修名无餘修。依此五修辩五精进</p><p>远离麤重调畅身心等者。麤重有二。一者二障。二者种子。立麤重名。性无堪任违细轻故。二者二障种子所引身中无堪任性。此与五蕴不一不异。而离五蕴无别自性。此令身心惛昧沈重无所安和。违细轻故亦名麤重。今此文中所远离者说后非前</p><p>令所依止转安适者。即释前文转依之言。前文所言转依為业者。非為佛果转依之义。与彼十种转依别故。此中依者即所依止身及心也。所言转者。转去不安至适故名转依</p><p>平等正直无功用住等者。言平等者辩捨初位。由捨令心离沈掉等不平等性故。初证得心平等性。言正直者辩捨中位。又由捨故令平等心远离加行自然相续。次后证得心平直性。无功用住者辩捨后位。复由捨故令正直心于诸杂染无所怯虑。最后证得无功用住性。具此三义简三受中所有捨受故名行捨</p><p>虽皆善收而无别体者。欣谓欲俱无嗔一分。于所乐境不增恚故。厌谓慧俱无贪一分。于所厌境不染著故。不慳矫等当知亦然。不慢即是惭一分摄。若崇重彼不慢彼故。不疑即是正慧所摄。以<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>者无犹豫故。不忿恨等即无嗔摄。正对忿等嗔一分故。覆狂諂等既以贪痴一分為体。不狂諂等即无贪痴一分所摄故皆善收。而无别体相用无别而不别立</p><p>十与五受皆得相应者。受相应门。修苦行时由有信故。忧当来世堕恶趣故。信有善果心喜乐故。于平等时亦有信故。于信既尔。餘可例知</p><p>皆学等三者。学等分别门。此三学义大小乘论虽皆具说。宽狭有异。且如小乘一切有宗。学人身中有為无漏总名有学。无学身中有為无漏皆名无学。一切有漏及诸无為总名非学非无学法。今大乘宗稍宽于彼。学人身中有為善法皆名有学。无学身中有為善法皆名无学。所餘善法皆名非学非无学法。今此所说十一善法当知亦然。随在有学无学身中及餘身中而得名故</p><p>非见所断等者。三断分别门。以此信等通有无漏故。通修断非所断摄。若虽有漏不迷理故非见所断。而迷事故是修道中渐次而断。若无漏者是正所修非可应断故非所断</p><p>谓由爱力取蕴生故者。释前生苦為业之义。一切烦恼皆名為取。蕴从取生故名取蕴。取蕴即是一切苦因。即此取蕴先从爱生。故说非爱不受生等</p><p>谓由无明起疑邪定等者。此释杂染為所依义。一切杂染有其三种。一烦恼杂染。二业杂染。三生杂染。此中所言疑及邪定。贪等烦恼诸随烦恼。是烦恼杂染。此中邪定即是五见。贪等即是嗔之与慢。所言业者即业杂染。业谓三业。福业非福业及不动业。福业者。欲界人天总业及五趣别业。如地狱中暂遇凉风触身等。又如地狱诸苦轻微名為善业。如不断善等。非福业者。三恶趣总业及是别业。不动业者。诸感色无色异熟能招后生。杂染即是烦恼及业所感异熟果也</p><p>此慢差别有七九种者。言七慢者。五蕴论云。一慢。二过慢。三慢过慢。四卑慢。五邪慢。六我慢。七增上慢。言九慢者。如发智论第二十卷俱舍十九大毘婆沙百九十九。皆说慢类有其九种。谓即我胜。我等。我劣。有胜我。有等我。有劣我。无胜我。无等我。无劣我</p><p>谓依三品我德处生者。依于三品起四慢类。依下中品而起一种。谓即是慢。于劣计己胜。于等计己等。心高举故。于中上品而起一种。谓即过慢。于等计己胜。于胜计己等。心高举故。依上品起二。谓慢过慢及是卑慢。谓于己胜计己為胜。于多胜己计己少劣。心高举故。于我起一。谓即我慢。以于诸行妄执為我。心高举故。于德起二。谓即邪慢及增上慢。以实无德计己有德。用邪思惟令心高举。若于殊胜所证法中未得谓得。令心高举。此显七慢所生依处。若说九慢生依处者。若依俱舍及发智论。从前七慢三中离出。谓从前慢过慢卑慢。言我胜者即是过慢。言我等者谓即是慢。言我劣者即是卑慢。有胜我者即是卑慢。有等我者谓即是慢。有劣我者即是过慢。无胜我者谓即是慢。无等我者即是过慢。无劣我者即是卑慢</p><p>一切见趣所依為业者。一切见者。六十二见者约过去為二十句。执过去云。一如去。二不如去。三亦如去亦不如去。四非如去非不如去。未来二十句。一未来有边。二无边。三亦有边亦无边。四非有边非无边。现在二十句者。一现在常。二无常。三亦常亦无常。四非常非无常。断常二见以為根本。三世各二十。兼本成六十二见。趣谓意趣。六十二见皆有意趣。总名见趣。皆用身见為所依处。故名见趣所依為业</p><p>此见差别有六十五等者。此等皆依五蕴之上执我我所成此二十句。六十五等二十句者。且依色蕴而有四句。一色是我。二我有诸色。三色属于我。四我在色中。初句是我。餘是我所。色蕴既尔。餘蕴例然。五蕴各四成二十句。六十五者。以色為头执色是我。以餘四蕴而為我所。有十三句。谓色是我受是我瓔珞是前有义。受我童僕即前属义。受是我窟宅即前在义。想行识蕴皆亦如是。四蕴之上各有三句。三四十二。是為我所兼色是我即十三句。次受是我历餘四蕴而為我所亦十三句。五蕴共成六十五句。此等是前六十异论。第四计我实有宗也</p><p>有执前际四遍常论者。长阿含经梵动品中。及瑜伽论八十七卷。虽皆具说有少不同。今依瑜伽显此义云。谓依静虑得宿住念有上中下。见有远近计前际常而有四论。一忆过去二十劫成坏。二忆过去四十劫成坏。三忆过去八十劫成坏。其中眾生不增不减。以此故知我及世间皆悉是常。四以天眼见诸眾生。从前世间至后世间无断绝故。计我世间皆悉是常。即前诸法皆常宗也</p><p>四一分常论者。一者有从梵天没来生此间。由<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>故得宿住通。观前来处。梵王犹在不见初后谓常住。我来生此是其无常。故知世界一分常住。二闻梵王有如是见。四大种是常。心是无常。或同彼忍或展转闻。我将梵王以為定量信其所言。故知世间一分是常。三者有从戏笑天没来生此间。得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>通。报彼诸天不戏笑故在彼常住。我由戏笑来生此间。故知世间一分常住。四者有从愤恚天没来生此间。得宿住通。执彼诸天不极愤恚在彼常住。我由愤恚来生此间。故知世间一分是常。此亦诸法无因宗也</p><p>及计后际有想十六等者。此依阿含梵动品说。且初有想十六论者。以相对色有其四句。对边无边有其四句。对苦对乐有其四句。对想多少有其四句。四四共成十六句义。第一对色有四句者。一我此终后有色有想。二无色有想。三亦有色亦无色有想。四非有色非无色有想。第二对边有四句者。一我此终后有边有想。二无边有想。三亦有边亦无边有想。四非有边非无边有想。第三对苦有四句者。一我此终后有苦有想。二有乐有想。三亦有苦亦有乐有想。四非有苦非有乐有想。第四对想有四句者。一我此终后有其一想。二有苦干想。三见境狭故有少想。四缘境宽故有无量想。是為十六有想论也无想八者。对色有四。对边无边亦有四句。对色四者。一我此终后有色无想。二者无色无想。三亦有色亦无色无想。四非有色非无色无想。第二对边有四句者。一我此终后有边无想。二无边无想。三亦有边亦无边无想。四非有边非无边无想。既无想故不可说為苦乐一多。故唯八句所言俱非有八论者。对色有四。对边无边亦有四句。对色有四者。一我此终后有色非有想非无想。二我无色非有想非无想。三者亦有色亦无色非有想非无想。四者非有色非无色非有想非无想。第二对边无边有四句者。一我此终后有边非有想非无想。二我无边非有想非无想。三我亦有边亦无边非有想非无想。四我非有边非无边非有想非无想。既非有想非无想故。故不可说有苦有乐一想多想。故唯八句。此等皆是计我实有宗也</p><p>七断灭等者。我未死时有麤色身。四大所造住持未坏。尔时有病有痈有箭。若我死后断灭无餘。尔时我善断灭。如是欲尘诸天。色尘诸天。无色空处无色识处。无所有处。非想非非想处。悉皆断灭。是故名為七断灭论。即前死后断灭宗也</p><p>谓谤因果作用实事者。言谤因者。谓无施与无爱养无祠祀无恶行无妙行。言谤果者。谓无恶行无妙行所感异熟果等。谤作用者。无此世间无彼世间无父无母。坏实事者。谓无世间真阿罗汉。即是因果皆空宗也</p><p>有执前际二无因论者。谓依世定不正思惟见不相续以為因故诸内外事无量差别。故作是思。我及世间无因而生。即前诸法无因宗也</p><p>四有边等不死矫乱者。四有边者即前第九边无边宗。不死矫乱即四不死矫乱宗也</p><p>或计自在世主释梵等者。自在即是大自在天。世主即是四大天王。释谓常释。梵谓梵王。餘物类者。微尘时方本际自然虚空等类。為常為恒无有变易。总是诸法皆常宗也</p><p>或计自在等是一切物因者。执自在天能生诸法。等即等取大梵王等。亦是世间一切物因。即是自在所作宗也</p><p>或有妄执诸邪解脱者。执非想天及非想地為解脱处</p><p>或有妄执非道為道者。除见已外妄执诸法為正道者。皆是妄计清净宗也</p><p>谓于诸见及所依蕴等者。执所起见是為最胜能得清净。见既如是。依身起见。此见所依五蕴之身。亦是最胜能得清净。既执自身為胜能净。则于他见执為下劣非胜能净。从此即起种种斗挣。故此见取即是斗挣法</p><p>谓于随顺诸见戒禁等者。前既执见為胜能净。随顺诸见而<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>禁。即执此戒及戒所依五蕴之身亦為胜净。名戒禁取取者执也</p><p>生在下地未离下染等者。下上地惑麤细悬殊。下惑未断上惑不起。要伏下惑上惑现前。此总说已别分别者。如初静虑名為下地。修第二定未得根本退生自地。是故名為生在下地。未能捨离初静虑惑。第二静虑烦恼不生。若得二地根本定者。伏初静虑下地烦恼。第二静虑上惑现起。于二静虑下上既然。三四静虑四无色定。伏下起上当知亦尔</p><p>生第四定中有中者由谤解脱等者。此显生上起下分别发业烦恼。婆沙论说。昔者有一少闻苾芻。不学经论直修定得初静虑谓得初果。乃至证得第四静虑谓言我得阿罗汉果。既得彼定合生彼天。后命终已将生彼处。于中有身便起谤言。夫阿罗汉生分已尽。如何今者我有生耶。故知世间无真解脱。但是智人虚妄所说。由谤解脱便即变作地狱中有堕于地狱。既彼中有属第四禪。所起谤毁乃是下地发业烦恼。故生上地能起下地分别烦恼</p><p>身在上地将生下时等者。此显上地起下润生俱生烦恼。谓从上地将生下时。先须起爱润下地业然始下生。经说非爱不受生故。既润下业而起下爱。故知上地起上润生俱生烦恼</p><p>总缘诸行执我我所断常慢等者。此显我见边见及慢得缘上义。此三烦恼约俱生者不能别缘。总缘上界為我我所执断执常。持彼地法而生于慢</p><p>餘五缘上其理极成者。言餘五者。一痴。二疑。三邪见。四见取。五戒取。而此五种大小乘教皆许缘上。以共许故而言极成</p><p>说生上者于下有情恃己胜德而陵彼者。瑜伽论五十九说。生上地者于彼下地诸有情所。由常乐静具胜功德。自谓為胜而陵蔑也</p><p>总缘诸行执我我所断常爱者等者。此显上界俱生身见边见及爱亦缘下义。谓俱生见不能别缘。是故总缘下界谓诸法為我我所。执断执常而起爱也</p><p>疑后三见如理应思者。谓下苦等為有為无。故知有疑即拨為无。是邪见摄。执彼欲界所有见戒為胜為因故有二取</p><p>而真见道总缘諦者。见道有二。一真见道。谓即正体无分别智。从前加行无间而生。亲证二空亲断二障。初照理故故名见道。二相见道。即是后德无分别智。从真见道无间而生。法真见道无间解脱。断惑证理亦名见道。此真见道是无相故。总缘四諦所有真如。一无间道通断四諦。分别烦恼一时顿断</p><p>苦集是彼因依处故等者。以此十种皆迷苦集起诸邪见。是彼因缘所依处故。由烦恼力乐著生死。于涅槃界起悬崖想生大怖故</p><p>身边二见唯果处起等者。此释二见唯迷苦义。谓二迷苦有其二因。一身边二见行想麤浅非强审故唯果处起。二别空非我属苦諦故。谓空非我有通有别。通即四諦皆空。非我非我所故名之為空。皆无我故名之非我。别谓苦諦有漏五蕴非我性故名為非我。非我所故说之為空。身见别迷有漏五蕴空非我故执我我所。边见别迷有漏五蕴执常执断违生灭故。是故二见唯迷苦諦</p><p>谓疑三见亲迷苦理者。谓疑苦諦為有為无。身见执我迷无我理。边执断常迷生灭理。邪见拨无现当皆苦。是故四种亲迷苦理</p><p>二取执彼三见戒禁及所依蕴為胜能净者。此释二取疏迷苦义。谓彼见取执前三见。戒取执彼诸见。戒禁及所依蕴為胜能净。由隔亲迷三见起故。故是疏迷非亲迷也</p><p>于自他见及彼眷属如次随应起贪等者。此中所显贪嗔慢三非亲迷諦。自见谓即自身所起前之三见。眷属即是与见同时心心所等。他见即是他身所起前之三见。眷属同前。即于自见及彼眷属而起贪爱。若于他见眷属起嗔。于自他见眷属起慢。故言如次随应起也</p><p>相应无智与九同迷不共无明亲迷等者。言无智者即是无明。然其无明总有二种。一者相应。通与六识诸惑俱者。二者不共。不与诸识诸惑俱者。然此不共复有二种。一者恒行。唯在末那。二者独行。唯在意识。然此独行又有二种。一者是主。非贪等俱独迷理者。二者非主。非贪等俱忿等俱者。此中相应既诸惑俱随。同诸惑亲疏迷諦。若与亲迷惑相应者即亲迷諦。若与疏迷惑相应者即疏迷諦。此中所说不共无明。即独行中為主之者。唯见所断。亲迷諦理。非主独行通修断故</p><p>一类二乘三界九地一一渐次九品等者。谓于三界分成九地。欲界四禪及四无色。地地皆有九品烦恼。九九共成八十一品。若钝根者别起八十一品。圣道一一渐次断除八十一品烦恼。断欲六品成一来果。断欲九品成不还果。断上界尽成无学果。于地地中。前之八品皆用正体后得智断。以有迷理迷事别故。若第九品根本智断。以唯迷理细难断故。若利根者以其九地八十一品合為九聚。发九圣道九品别断。谓以九地上上品惑合為一聚。一圣道断。如是乃至以九地中下下品惑合為一聚。起上上圣道而顿断之。断欲六品合成一来。由上八地六品皆断。超一来果不入一来。断欲九品合成不还。由上八地九品皆断。超不还果不取不还。超中二果而成无学。虽则利钝超渐有殊。而断惑时俱起无间解脱二道。断惑证理斯心别故</p><p>彼令易解此令易缘者。解谓行解。行解转易。缘谓所缘。所缘改变。由是于中四句分别。一易解不易缘。先计色常后计色断。二易缘不易解。先计色常后计受常。三解缘俱易。先计色常后计受断。四解缘俱不易。前念后念计色常等</p><p>谓非烦恼唯染麤故者。此废立门显由三义唯说二十。初以非是根本烦恼即简贪等六烦恼。次唯染污即简遍行。别境不定通三性故。后唯麤显简愤发等。而依忿等分位立故</p><p>中二一切不善心俱随应皆得小大俱起者。谓如下说。小七唯是不善性收。小三大八通于二性。小七既是不善性收。故与中二皆相应起。小三大八不善性者。中二相应无记性者。即与中二而不俱起為显是义置随应言</p><p>既许大八遍诸染心展转小中皆容起者。谓即染宽而不善狭。染通不善无记二性。故但不善皆是染心。自為染心非是不善。是故大八遍诸染心。既通无记不善二性。由不善故小中俱也。以彼小十不俱起故。由是八大容互相应</p><p>由斯中大五受相应者。谓以五受三性容俱。有染无</p></div>"
}]