[{
    "title": "大辩邪正经 第2893部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>大辩邪正经</p><p>佛说大辩邪<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>门品第一如是我闻。一时佛在眾香城中。领诸徒眾大会<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。于其城中复有文殊师利菩萨摄<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>心菩萨观身二种空菩萨观身二种实菩萨观身不净菩萨观身无瑕秽菩萨。然其座下复有八万四千徒眾及十地菩萨</p><p>十地菩萨品第二何以故。十地菩萨者云何。一地决定信断疑菩萨。二地能进道行菩萨。三地常念断妄菩萨。四地常定不散缘菩萨。五地<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>充满菩萨。六地能依本师教命菩萨。七地绍立先宗菩萨。八地不断<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>体性菩萨。九地万行圆备菩萨。十地常乐我净菩萨</p><p>文殊师利菩萨起请品第三尔时眾中有一菩萨。名曰文殊师利。从座而起。胡跪合掌。白本师释迦牟尼佛言。一切眾生从无始旷大劫来。轮迴六趣。流浪<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。终无间歇。受诸苦恼。至于今日。唯愿本师释迦牟尼佛。大慈大悲怜愍一切眾生。救护一切眾生。為诸徒眾略说法要。佛言文殊师利。諦听諦听。善思念之。吾当為汝分别<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。一切眾生从无始旷大劫来。轮迴六趣。流浪生死。终无间歇。受诸苦恼。至于今日者。皆由本心。何以故。為心从时至时。从日至日。从月至月。从年至年。心缘诸境。情染世尘。心常在乱不定。故身亦还然。佛告文殊师利。汝今殷勤起请。整当其意。汝作何心。文殊师利菩萨言。向者殷勤起请。為诸徒眾略说法要。未知者望欲令知。未觉者望欲令觉。未悟者望欲令悟。未通者望欲令通。未证<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>者望欲令证菩提。未解安心者望欲令解安心。佛告文殊师利。汝若学此安心妙法。先洹归依真善知识。何以故。未知者令知亦当归依真善知识。未觉者令觉亦当归依真善知识。未悟者令悟亦当归依真善知识。未通者令通亦当归依真善知识。未证菩提者令证菩提亦当归依真善知识。未解安心者令解安心亦当归依真善知识</p><p>释迦牟尼佛為初心菩萨说断六种见趣品第四尔时文殊师利菩萨重白释迦牟尼佛言。八万四千徒眾同时发愿。欲当归依真善知识。先修何行。佛告文殊师利。若有<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a><a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>优婆塞优婆夷。归依真善知识者。先断六趣。然后始可归依真善知识。何以故。六趣者云何。一即不得妄起分别。二即不得故量是非。三即不得心生疑悔。四不得意地怀疑。五即不得生增上慢。六即不得言教相违。先能断此六种见趣。始可归依真善知识</p><p><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>品第五尔时释迦牟尼佛叹此真善知识。不可思议不可称量不可比附。恐畏大眾心生疑悔。不能归依真善知识。便為大眾自说本<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。佛告大眾。听吾自说。因地修道之时。所得何等<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。所修何行得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。忆我往昔之时。于三大阿僧祇劫。修学有為功德。多诸过患。不会无為道理。為著相求。经三大阿僧祇劫受诸苦恼。于后遇逢大觉<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。在毘耶离城中<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>山下婆罗双树间功德林中。為我略说法要。我遂能如说<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。大觉世尊等又教我。在毘耶离城中入大等道场。经七七四十九日遂证无生法忍。眾善具足。百福<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。万行圆备。遂成佛道。大觉世尊即与我摩顶授记。大觉世尊言。愿汝当来成道。号為本师释迦牟尼佛。常為一切眾生為四生慈父<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>导师。恒居<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。接引群迷。流传此法。递相嘱付莫使间断。如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>永无尽际。释迦牟尼佛言。我誓不违大觉世尊教命。為是流传此法递相嘱付不使间断。是以今日劝诸大眾。方便亲近真善知识。必得大利益。但能如说修行。当来获无上果。与我无异</p><p>文殊师利菩萨请问大利益品第六尔时文殊师利菩萨重白释迦牟尼佛曰。大利益者云何。佛言文殊师利。大利益者无过能翻一切恶為一切善。此名大利益。文殊师利菩萨言。何等人能翻一切恶為一切善。佛言文殊师利。能翻一切恶為一切善者。无过真善知识是也。何以故。善知识者。能向一事之中乃起万亿等方便譬喻。善知识者。能破二见归依一体。善知识者。能迴三毒恶心為一体三宝。善知识者。能制四毒恶蛇乃成四种威仪。善知识者。能迴五毒乃為<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。善知识者。能制六识治作六斋。善知识者。能向七识之中求得七佛。善知识者。能迴八苦為八解脱。善知识者。能迴<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>颠倒转為恒沙功德。善知识者。能迴无明為慧日。善知识者。能迴<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>為菩提。善知识者。能迴贪瞋痴為三业清净。善知识者。能迴瞋恚疾妒乃成四无量心。善知识者。能迴八邪归入八正道分。善知识者。有大功德不可思议不可称量不可比附。若欲具说穷劫不尽</p><p>文殊师利菩萨决疑品第七尔时文殊师利菩萨又问释迦牟尼佛言。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>有一小疑。云何待决。释迦牟尼佛言。小疑者云何。文殊师利菩萨言。三世诸佛所置三乘妙法。及说万亿等方便。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>一切眾生。皆令眾生存心向道。何為一切眾生炽然流浪生死。佛告文殊师利。諦听諦听。善思念之。吾当為汝分别解说。一切眾生从无始以来炽然流浪生死者。只為不会吾意。何以故。一切眾生若会吾意与吾无异。佛言。善哉善哉。一切眾生唯会摧喻法门。何有眾生会。吾大辩邪正甚深妙法。文殊师利菩萨闻说是事。叹未曾有不可思议。复心生忌怖。自责其身。举身自扑。闷绝在地。良久得苏。呜呼长叹。苦哉痛哉。何期今日逢值法身父母。為说此安心妙法及本因缘。又说大辩邪正甚深妙法</p><p>文殊师利菩萨又问大辩邪正法门品第八尔时文殊师利菩萨重白本师释迦牟尼佛言。大辩邪正甚深法者。云何名為是正。云何名為是邪。佛言文殊师利。正者亦有二种。邪者亦有二种。何以故。二种邪者。其义甚深。一者离体求相名為正中邪。二者不信身中有佛。不信身中有法。贪著世事。随遂因缘常行颠倒。名為邪中邪。二种正者。其义甚深。一者离体求相了知身中具有一体三宝。亦知身中具有恒沙功德。具信身中具有如来藏法身。名為正中正。二者唯直识外不识其内。多著相求名為邪中正。何以故。向者虽说四种邪正。唯有一事是真。何以故。譬如有人身欲远行至他方所。其程可有百万餘里。其道乃有八万四千种邪。唯有一道是真。自外八万三千九百九十九种道皆并是邪。唯有一道是真。眾生欲度其正道者。云何得达前所。佛告文殊师利。若有眾生往其正道者。要藉真善知识。结其善标而可得达前所。何以故。夫求道者先须求一。但能立一為宗方法。于中建立佛置法门八万四千。若欲说真皆当归一。何以故。凡及与圣亦成為一。何以故。凡而求圣者。喻若弃水而求冰。是冰而是水。是水而是冰。冰外而无水。水外而无冰。烦恼与菩提亦成為一。何以故。背烦恼求菩提者。喻若去形而求影。是形而是影。是影而是形。形外而无影。影外而无形。心及与佛亦成為一。何以故。背心而求佛者。喻若背声而求响。是声而是响。是响而是声。声外而无响。响外而无声。无来是一。幻化两名。何名是一。分别解说。一体外求皆并是邪。一体内求即成為一。眾生分别有三。佛置三乘教律。若能了达诸法。三亦本来无三。一亦空名為一。忽悟诸法性空。了知必竟寂灭。悟性无為大道。始名无言无说</p><p>文殊师利菩萨又问三十二相品第九尔时文殊师利菩萨重啟释迦牟尼佛言。又问三十二相者云何。佛告文殊师利菩萨。諦听諦听。吾当為汝分别解说。三十二相者。其义有二。一者在凡夫中。名為三十二种恶相。二者在贤圣中。名為三十二种善相。何以故。三十二种恶相者。為凡夫身中具有八苦。凡夫身中具有八难。凡夫身中具有八疑。凡夫身中具有八邪。四八三十二名為三十二种恶相。释迦牟尼佛言。我于因地未逢大师已前时。亦复如是。自从逢大师已后。乃教我翻此八苦為八解脱。翻此八难為八自在。翻此八疑為八种正信。翻此八邪归入八正道。四八三十二是名三十二种善相。何以故。二相中具有恒沙功德。不可具说。我若具说穷劫不尽</p><p>文殊师利菩萨问八十种好品第十尔时文殊师利菩萨重白释迦牟尼佛言。又问八十种好云何。佛告文殊师利。汝当諦听諦听。善思念之。吾当為汝分别解说。八十种好者。其义甚深。何以故。断得十恶名為十善。断得五逆名為五敬顺。制得七识名為七佛。能迴八种邪命諂曲之风為八种微妙香风。制得六识生<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>。不染六尘名為六通。制迴六贼為六神王。防<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>城。十善五敬顺并為七识。佛八种微妙风。及六波罗蜜。六通性无生。六神防护法身。共成四十八种。善帖三十二相。总成八十种好</p><p>校量功德品第十一佛告文殊师利。汝若是吾上足弟子。能报吾恩。应当存志。其志者云何。汝若能报吾恩。一一依吾教命。弘扬此法王。化一切眾生证无生法忍。此為存志。何以故。我昔曾闻定光如来。及大觉世尊。菩萨摩訶萨诸贤圣等证无生法忍。并由存志所能知。文明知有志者。万行俱备。明知无志者。一行不成。何以故。我于往昔曾共八万四千徒眾。校量存志功德。于此万行门中无过第一甚难甚难希有之事。何以故。譬如有人造纯铜像。数有万万。皆象人形<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a><a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。此者為难不。此者亦未為难。何者為难。若有善男子善女人。闻说大辩邪正甚深妙法。即生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。此者為难。譬如有人造纯银像。数如恒河沙受持供养。此者為难不。此者亦未為难。何者為难。若有善男子善女人。志孝于师僧父母。尽心彻到者。此者為难。譬如有人造纯金像。数如大地草木受持供养。此者為难不。此者亦未為难。何者為难。若有善男子善女人。能除人法二我者。此则為难。譬如有人纯用真檀香木起大浮图。诣至梵天。及用七宝庄严受持供养。此者為难不。此者亦未為难。何者為难。若有善男子善女人。流传此法递相嘱付不使间断者。此者為难。譬如有人造七宝精屋遍满阎浮受持供养。此者為难不。此者亦未為难。何者為难。若有善男子善女人。能依本师释迦牟尼<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>命。修习存志功德决定至成者。此者為难。尔时眾中有八万四千徒眾。闻说是事。<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃。叹未曾有。于时同发弘誓大愿。修存志功德。如说修行</p><p>虽持十二部不能解邪正恒為邪见人</p><p>非為觉法者心口不為恶身亦无所犯</p><p>能持此三事速出生死渊</p><p>虽读千章不得中义不如一句</p><p>足可得道但有学者审自思量</p><p>不得虚费功程恒居迷路</p><p>玄奘及长年师及邪奢等。于如来七宝窟中。得此如来大辨邪正甚深密藏经一卷</p><p>大辨邪正经</p></div>"
}]