[{
    "title": "妙法莲华经马明菩萨品第三十 第2899部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a>马明菩萨品第三十</p><p>佛言。地深二十亿万里。地下有润泽。深二十亿万里。泽下有金粟。深二十亿万里。金粟下有金刚。深二十亿万里。金刚下有大水。深八十亿万里。水下有无极大风。深五百二十亿万里。刚维天地制使不落。天地欲坏时有七日出。二日出时亭住不行。诸源流水皆為枯尽。三日出时诸河水悉皆枯尽。四日出时大河及江皆為枯尽。五日出时大海枯尽。六日出时天下鬱鬱如陶家。如然火有黑烟。七日出时天下都火然烧尽。须弥山及天下万物一切皆尽。其火盛热上烧诸天六天皆尽。其火盛热彻至第十五光音天上。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>人民善多者死上生第十五天上。其善少者死生他方国土。此间<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中罪人皆生他方地狱中受罪。天地烧尽之后有大风。从他方来持云上至第七天。下雨其蒂。大如车轮。如是澍雨经亿千万岁。水长上至第七梵天。其雨乃上上四面皆有大风断使不溢。风起挠动其水亿千万岁。水乃耗减。次有风起。名净<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。扬动其水。波上生厚沫化為七宝。始作第六他化<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>天宫。水渐耗减。净庄严风起吹水沫化為七宝。次作第五化乐天宫。渐渐减。净庄严风起吹水沫化為七宝。次作第四兜率天宫。水渐渐减。净庄严风起吹水沫化為七宝。次作第三夜摩天宫。水渐渐减。净庄严风起吹水沫化為七宝。黄金白银水精琉璃。当天之中作须弥山。高三百三十六万里。水渐渐减。净庄严风起吹水沫化為七宝。须弥山顶作第二忉利天宫。水渐渐减。净庄严风起吹水沫化為七宝。当须弥山半腰于四耸上作四天王宫。水渐渐减。净庄严风起吹水沫化為七宝。黄金水精作日。白银琉璃作月。及作星宿诸尊神宫。水渐渐减。坚固风起吹水沫化為宝。作十宝山。一者金山。二者银山。三者琉璃山。四者马瑙山。五者车磲山。六者琥珀山。七者颇梨山。八者水精山。九者白玉山。十者紫金山。及作二十八部地天宫殿。正宝七种。餘杂宝一百二十种。安住风起吹水沫化作铁围山。大铁围山周围三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。次不动风起吹清水為海。极浊麤沫化成石山。浑浊者用成四大陆地。及作八万小城陆地天地。地城已地自然生地芝。后第十五天上人渐渐来下。至六欲天中住。后复来下在地。或食地芝。食地芝后贪著其味。身重不能复飞。福尽者作世间人。无复光明。人寿无量岁。地芝灭尽。后生地味。人民取共食之。寿数千万亿岁。地味灭尽。后地肥生。人民取黄食之。寿数千万岁之后。地肥灭尽。有自然粳米生。人民共食之粳米。食粳米之后。其人少欲意者变為男子形。多欲意者变女人。身变化男女之后便生染爱。共于屏处行阴阳之事。第十五天上人福命尽者。下生妇人腹中為胎。经三百日乃成為人。从是以来孚男育女。更相婚娶。六亲成篤。当食粳米。时人寿数百万岁。皆有挣竞之心。虽食自然更相偷夺。互相打拍。粳米灭尽。自然[麩-夫+黄]生。便共分疆列畔。各自守护。由有愚人私相篡盗不可禁制。便立王法。公卿百官更相检校。赏善罚恶。政法治国不枉人民。人各各求输衣食以供王。当尔时人寿五百岁。从是已后共相低突。负债不还者即变畜生身。饮水敢草。生即负重。死即剥皮。象马牛羊驴骡骆驼猪狗鸡鵜鹅鸭熊羆虎豹豺狼麋麈獐鹿稚兔</p><p>皆人化作。如是变化不可称数。当尔时人慳贪者即变化饿鬼。身长四十里。举足行时支节头相磨。如五百乘车声。腹大胭如针。若见饮食时化成火炭。若见恒河化為脓血。东西行求食洋洞灌。其胭一口入腹中。百节皆火然。如是苦恼痛毒不可言。其尔时人造作十恶。<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>偷盗邪淫妄言两舌恶口谤语贪欲瞋恚愚痴者。将至铁围两山间。于十八地狱中而考治之</p><p>第一鑵汤地狱第二鑪炭地狱</p><p>第三刀山地狱第四剑树地狱</p><p>第五黑闇地狱第六寒冰地狱</p><p>第七火车地狱第八刀兵地狱</p><p>第九火轮地狱第十铁鐖地狱</p><p>第十一铜柱地狱第十二沸屎地狱</p><p>第十三拔舌地狱第十四钉身地狱</p><p>第十五吐火地狱第十六饮铜地狱</p><p>第十七愚痴地狱第十八火城地狱</p><p>行十恶者。皆悉遍此十八地狱中受罪。一一地狱中经亿千万岁。彼地狱中一日一夜当人间十二万岁。如是长久。尔乃得出。复入畜生中。五千万岁受鸟狩形。畜生罪毕复入饿鬼中五百万岁。饿鬼罪毕复生边地夷狄之中。為王所破為人奴婢。复五百世。尔乃罪毕。持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>者复得人身。行十善者得生天上。行道者得道。佛言。须弥山北陆地名鬱单越。地方四十万里。人寿千岁。身长大四尺。人面似地形正方。树上生衣服及七宝瓔珞。地自然生粳米。味如<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>。食之无病。无尊无卑。其土人民受业常定。亦无中夭者。彼土人民无有乳养之者。生儿堕地抱于道边。令行人舒指内口中唼之。唼指七日便得成人。往诣树下。仰头看树。七宝瓔珞衣服著体。无有染色擣治之苦。亦无割截裁缝之劳。其国人民端政无双。于三天下最為第一。逢女為妇。逢男為夫。其人慈心不杀生。龙王降雨即雨妙华。彼土人民取用严饰。生不相育。死不葬埋。大鸟衔尸著无人之土。魂灵昇天不逕恶趣。上持五戒得生其国须弥山北日出时。山西日中。山南日没。山东夜半。须弥山高三百三十六万里。其状如细腰鼓形。下根入水。亦三百三十六万里至金刚际。从顶至下根凡高六百七十二万里。小铁围小海水际已上高六百七十二万里。入海水深六百七十二万里。从顶至下根凡高一千三百四十四万里。小铁围小围。此四天下须弥山者。秦言崑崙山。四宝合成。东面黄金。西面白银。南面琉璃。北面水精。东面黄金。黄金光明照东方<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>界悉作黄金色。彼方眾生谓言黄天。西方白银。白银光明照西方虚空界悉作白银色。彼方眾生谓言白天也。南方琉璃。琉璃光明照南方虚空界悉作琉璃色。此方眾生谓言青天。北方水精。水精光明照白天也。四宝光明所照诸方。悉同其色无有崖岸。一切眾生空明浊翳為色所障。是故云须弥山也。得天眼者尔乃得见佛言。须弥山东陆地名弗波提。广长三十二万里。其地正圆。人面似地形。身长丈。六百五十岁。其人慈心不杀生。天雨杂宝衣食自然。上持五戒得生其国。须弥山东日出时。山北日中。山西日没。山南夜半佛言。须弥山西陆地名拘耶尼。广长三十六万里。其地如半月形。人面似地形。身长二丈。寿二百五十岁。其人慈心不杀生。天雨华鬚衣食自然。中品持五戒得生其国。须弥山西日出时。山南日中。山东日没。山北夜半佛言。须弥山南陆地名阎浮提。广长二十八万里。其地上广下狭。人面似地形。其土人民修业不定。受报不停。上寿百二十岁。中寿百岁。下寿八十岁。上身长丈二。中身一丈。下身八尺。少出多减情諂偽少。于慈心唯仰食力无有自然。若天雨时雨清冷水。以润五穀及粟果木。龙王降雨等无差别。乃至劫欲尽时。人极恶。揽草成刀剑。即便相杀。当尔之时<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>五岁。一切五穀悉皆灭尽。眾生行业所减不同。下品持五戒生此国土。须弥山南日出时。山东日中。山北日没。山西夜半佛言。日去地八十四万里。黄金作里城。水精作外城。是以故天下常明日行有三道。冬行南道。当冰山之上。是以故天下大寒。春秋行中道。是故寒温适等。夏行北道。当人之上。又人北有三百三十六万里。金莲华身日之精。故天下大热。日城纵广正等。二千四十里。黄金水精作城郭。人寿二百五十岁。身长十里。衣食自然。日天子者放千光明普照百千国。其中亦有男女。行五戒十善然灯照佛。修此<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>得生日中佛言。月去地八十四万里。白银作里城。琉璃作外城。月从始生一日银面转向人。至十五日正向人。是以故月满天下大明。从六日以去琉璃面转向人。至三十日正向人。是天下大暝。月城纵广高下千九百六十里。白银琉璃作城郭。人寿二百五十岁。身长十里。衣食自然。其中亦有男女。行五戒十善然灯照佛。修此功德得生月中佛言。五星者。东方岁星。南方荧惑星西方太白星。北方辰星。中央镇星。是名五星。有三品大中小。大星纵广百二十里。中星八十里。小星四十里。皆用水精作城郭。去地八十四万里。随蓝风而转之故不落也佛言。天有二十八宿。分主四方。以应四时不失常度。东方七宿。角亢氐房心尾箕。南方七宿。井鬼柳星张翼軫。西方七宿。升手女虚危室辟。北方七宿。奎楼胃昴毕嘴参如今日月星宿悉是诸天宫殿七宝庄严。玄处虚空四时转运不失节度者。亦為五风所持。一者持风。二者待风。三者助风。四者转风。五者行风。以制仰之不坠落也。星宿中人身。长十丈。寿命二百五十岁。当今人间四百五十万岁。人间二十五岁于星宿天中一日一夜。衣食自然。项背日光。飞行自在。其中亦有男女。斯由人间<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>五戒十善得生其中。东方天王宫舍治须弥山半腰黄金耸上。去地百六十八万里。须弥山东天王名提头赖吒。汉言治国。主一切乾闥婆毘舍闍鬼。治国天王寿五百岁。当今人间九百万岁。人间五十岁為四天王宫一日一夜。三十日為一月。十二月為一岁。衣食自然。其中亦有男女。身长二十里。行五戒十善得生其中。南方天王宫舍治须弥山半腰琉璃耸上。去地六十万里。须弥山南方天王名毘楼博叉。汉言增长。主一切毒龙及富单那鬼。增长天王寿五百岁。当今人间九百万岁。人间五十岁為四天王宫一日一夜。三十日為一月。十二月為一岁。衣食自然。其中亦有男女。身长二十里。行五戒十善得生其中。西方天王宫舍治须弥半腰白银耸上。去地百六十八万里。须弥山西天王名毘楼勒奇。汉言难过。主一切鳩槃荼薜荔多鬼。难语天王寿五百岁。当今人间九百万岁。人间五十岁為四天王宫一日一夜。三十日為一月。十二月為一岁。衣食自然。其中亦有男女。身长二十里。行五戒十善得生其中。北方天王宫舍治须弥山半腰水精耸上。去地百六十八万里。须弥山北天王名毘沙。汉言多闻。主一切夜叉罗剎鬼。多闻天王寿五百岁。当今人间九百万岁。人间五十岁為四天王宫一日一夜。三十日為一月。十二月為一岁。衣食自然。其中亦有男女。身长二十里。行五戒十善得生其中。四天王宫中虽有日月岁数之名无有日月之形。所以然者。四天王宫诸<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>等。项背光明展转相照。无有昼夜。常明不暝也。欲知无昼夜相者。但看莲华开合即便知也。莲华敷时即名為昼。华合时即名為夜。四气和适。不寒不热。乃至三十三天重重皆尔。但彼日月年岁转长倍不相类也。四天王各领一方天下。常以月八日遣使者。案行天下。伺察帝王臣民天龙鬼神蜎蜚蚑行蠕动之类。心念口言。身行<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。疏善记恶。毛分不错。其<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>者入天曹。行恶业者名人四冥室。十四日太子下。十五日四天王自下。二十三日复遣使者下。二十九日复遣太子。三十日四天王复自下。日月五星二十八宿。其中诸天人一切俱下。微伺世间帝王臣民诸龙鬼神含血之类。谁有<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母。敬事三尊。受持三归五戒十善八斋。起塔造像修诸功德。奉行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>和慈四等。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒忍辱<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。一心<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>慈悲喜捨养育眾生者。即条藏不上奏天帝释。帝释承书关下天曹。寿益算满其百年。临命终时。诸天伎乐导从宝车。五百天女散华<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>而来迎之上生天上天王之宫。衣则玄妙。食则餚膳。行则陵虚。住止华闕。目睹妙色。耳听妙商。口甘百味。鼻嗅妙香。身服文綾。心游净疆。斯之功德十善為粮。其行恶者。帝释承书关下地狱阎罗大王。即遣地狱五官。减寿夺算。名名射死。地狱长士兵人持铁索围之。所见不同。口不能言。各随所习受其殃福。不可以财许求哀得脱。天无枉揽。平直无二。作罪得罪。作福得行道。自作自得。非他授与。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>即说偈言</p><p>十善得生天五戒服人身十恶堕地狱</p><p>低突堕畜生忍辱得端政瞋恚得丑陋</p><p>布施得大富慳贪堕贫穷</p><p>第二天名忉利天。名释提桓因。其四镇大臣者。四天王是也。三十天者。释有三十二臣。通释之身故有三十三天。释提桓因在摩尼宝殿上坐时。前面有八臣。后面有八臣。左面有八臣。右面有八臣。四八三十二故有三十二辅臣。三公者。司徒公司空公司马公。九卿者。八大<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>。八王使者。左社右稷。风伯雨师雷公霹靂。左将军右将军。前将军后将军。四辅武卫四镇天王。五罗大王太子使者。日月五星二十八宿。鬼神将军悉帝释之官僚也。释有皇后。名曰悦意。其身左右各有八万四千资媚。于其面上复有八万四千资容。此后资容于帝释三十二那由他菜女最為第一。须弥山顶去地高三百三十六万里。山顶纵广三百三十六万里。城名喜见。离四天王宫百六十八万里。入海水复深三百三十六万里。下根亦纵广正等。三百三十六万里。其喜见城七宝庄严。其城纵广正等。八万四千由旬。帝释宫殿于其中央七宝宫殿氍[束*毛]毾[登*毛]金床玉机。綩綖软细。以敷其上。天繒宝蓐以藉其体。劫波育衣。自然著身。妙宝天衣。以贯其首。真珠瓔珞以自庄严。摩尼慺悵张施其上。金铃华□。周匝垂下。身色净好。端政无双。头髮紺青。目如明星。鼻如截铜。口如含丹。身毛孔中优慊?恪0税偻蛩那?炫?韵嘤槔帧O布?侵兄钐旃?钇涫?蘖俊3渎?醒搿=窒锏栏簟P行邢嗟薄O缆繁κ鳌&gt;ゾハ嗤?O狼??撞忌蛳恪1娔裼蜗贰6煅荚а斐┖脱乓簟Q菝罟?獭1酥罟?畛亓骰?髀ス鄣钐迷霸费爻亍0斯Φ滤???渲小F渌?憬辔度绺事丁:蔚葹榘恕R磺帷6?洹H??K拿馈N迩寰弧A?怀簟F咭?钡魇省0艘?盐藁肌0松???G嗷瞥喟缀熳峡~绿。弥覆水上。青色青光。黄色黄光。赤色赤光。白色白光。玄黄朱紫各如其色。帝释出游观时。交露宝车驾千疋马。翱翔八方自在无有限碍。广说其中快乐之事不可具说。人寿千岁。当今人间三千六百万岁。人间百岁于忉利天宫一日一夜。三十日為一月。十二月為一岁。衣食自然。揣食入口经七日之中。即<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>长四十里。行欲之法如人间无异。生子之时男从父膝化生。女从母膝化生。如今四岁小儿。许眼能彻视。耳能道听。知化心念自识<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>。项背光明。飞行自在。行五戒十善得生其中。第三天名炎摩天。寿二千岁。当今人间七千三百万岁。人间二百岁于炎摩天上一日一夜。三十日為一月。十二月為一岁。悬处虚空。衣食自然。炎摩天行欲之法。抱则成欲。男女化生。身长八十里。行五戒十善得生其中。第四天名兜率天。寿四千岁。当今人间一亿八百万岁。人间四百岁于兜率天上一日一夜。三十日為一月。十二月為一岁。衣食自然。兜率诸天行欲之法。执手成欲。男女化生。身长百六十里。彼兜率天宫一生补处菩萨。常怖其中為诸天师教授。天人发菩萨心住不退地。行五戒十善得生其中。第五天名化乐天。寿八千岁。当今人间二亿一千六百万岁。人间八百岁于化乐天上一日一夜。三十日為一月。十二月為一岁。衣食自然。化乐诸天行欲之法。捉衣成欲。男女化生。身长三百二十里。行五戒十善得生其中。第六天名他化自在天。寿万六千岁。当今人间四亿三千二百万岁。人间千六百岁于第六天上一日一夜。三十日為一月。十二月為一岁。衣食自然。第六诸天行欲之法。视欲成欲。男女化生。身长六百四十里。第六天上城郭楼观七宝庄严。宫殿楼阁浴池宝树。皆以无量妙宝严饰。光明赫奕。超胜独妙。不可具宣。妇女端正。容姿美妙。六天王者受福超胜。魏魏堂堂不可為喻。行五戒十善得生其中从此已下六天皆有男女受欲。揣食入口故名欲界。于此已上名<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>天第七天名梵天。去地极远离可理论喻。以大石纵广四千里。今年此日下石。明年此日至地。其远如是。从七天已上无有女人之形。容貌微妙。如镜中像。其為天数寿之一劫。见食即饱。行五戒十善加行一禪小增得生其中。第八天名梵辅天。寿二劫。见食即饱。行五戒十善加行一禪小增得生其中。第九天名梵身天。寿四劫。见食即饱。行五戒十善加行一禪小增得生其中。第十天名梵眷属天。寿八劫。见食即饱。行五戒十善加行一禪小增得生其中。第十一天名大梵天。寿十六劫。见食即饱。行五戒十善加行一善小增得生其中。第十二天名光天。寿三十二劫。见食即饱。行五戒十善加行二禪小增得生其中。第十三天名少光。寿六十四劫。见食即饱。行五戒十善加行二禪小增得生其中。第十四天名无量光天。寿百二十八劫。见食即饱。行五戒十善加行二禪小增得生其中。第十五天名光音天。寿二百五十六劫。见食即饱。加行五戒十善加行二禪小增得生其中。第十六天名净天。寿五百一十二劫。见食即饱。行五戒十善加行三禪小增得生其中。第十七天名少净天。寿千二十四劫。见食即饱。行五戒十善加行三禪小增得生其中。第十八天名无量净天。寿二千三十八劫。见食即饱。行五戒十善加行三禪小增得生其中。第十九天名遍净天。寿四千九十六劫。见食即饱。行五戒十善加行三禪小增得生其中。第二十天名密身天。寿八千一百九十二劫。见食即饱。行五戒十善加行四禪小增得生其中。第二十一天名小密身天。寿万六千三百八十四劫。见食即饱。行五戒十善加行四禪小增得生其中。第二十二天名无量密身天。寿三万二千七百六十八劫。见食即饱。行五戒十善加行四禪小增得生其中。第二十三天名密果天。寿六万五千三百三十六劫。见食即饱。行五戒十善加行四禪小增得生其中。第二十四天名不烦天。寿十三万六百七十二劫。见食即饱。行五戒十善加行四禪小增得生其中从此已上四天不复还堕世间。所以者何。其有得阿那含道者。皆生其中。便于现身成阿罗汉道。不為世业所拘。故不受劫所之名。第二十五天名不热天。识食即饱。行五戒十善四禪具得生其中。第二十六天名善见天。识食即饱。行五戒十善四禪具得生其中。第二十七天名不善见天。识食即饱。行五戒十善四禪具得生其中。第二十八天名色究竟天。识食即饱。行五戒十善四禪具生其中色究竟天者。尽色界际名為究竟。亦名有顶。在色有之顶名為有顶。亦名摩醯首罗者。大自在也。能王三千大千世界故名為大自在。又名阿迦贰吒天。阿迦贰吒天者。亦是色界究竟天之别名也。从此已上四天名<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。欲界色界诸天不见其形。故名无色界。第二十九天名空处天。寿一亿五百万劫。念食即饱。行五戒十善四禪度色净得生其中。第三十天名识处天。寿二亿一千万劫。念食即饱。行五戒十善四禪灭悉净得生其中。第三十一天名不用处天。寿四亿二千万劫。念食即饱。行五戒十善四禪断永净得生其中。第三十二天名非相非非相处天。寿八亿四千万劫。念食即饱。行五戒十善四禪念空净得生其中从此已下四天。人身如中阴形。极世之受名之小无為。其著乐难可<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。故属八难。若能觉苦断苦。知尽行道解空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无愿之法。得出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。名之阿罗汉佛言。下至风轮际上至非相非非相天。傍极铁围山畔。是名小世界。从一小世界数至千小世界。有铁围山。周迴围之。名為小千。小千合為一。从一小千数至千。中合為一。从一中千数至千世界。复以铁围山周围之。是名三千。合為一。从一三千数至千世界。复以铁围周迴围之。是名三千世界。名一佛土小千铁围山高至第七天。厚亦尔。周围小千国土。中千铁围山高至第十一天。厚亦尔。周围中千国土。三千铁围山高至第十五天。厚亦尔。周围三千国土。大千铁围山高至第二十四天。厚亦尔。周围大千国土。以四天下须弥山四城。七重宝山及大海水八十亿小洲。洲有一国。八十亿国土悉居海中。小铁围内东西一千八百万里。南北一千八百万里。天下万物悉在其中。于铁围山四面外。两山中间沃燋山下。各安十八地狱。于大海底复安十八阿鼻地狱。一四天下并有九十地狱。以為围遶百亿。四天下合九百亿地狱。地狱以為眷属。若人增上心犯十恶。加作五逆罪。于九十地狱中治罪。虽犯上品十恶不造五逆者。但于七十二地狱中治罪。不入十八阿鼻地狱治罪也。中品犯十恶。于三十六地狱中治罪人。尔乃得出。下品十恶者。但于一方十八地狱中治罪。若遍此十阿鼻地狱中治罪。足满八万四千劫。尔乃得出。若具犯阿鼻地狱。居大海水底。纵广八千由旬。七重铁城。七重铁网弥覆城上。七重城内外有八万四千刀山。八万四千剑树充满中间。于其四门有四大铜狗。吐毒火满阿鼻城中。有十八鬲。一一鬲中有十八苦事。所谓十八小热地狱。十八黑闇地狱。十八寒冰地狱。十八灰河地狱。十八火车地狱。十八鑊汤地狱。十八沸屎地狱。十八刀山地狱。十八剑树地狱。十八刺床地狱。十八铁机地狱。十八铁窟地狱。十八铜柱地狱。十八黑绳地狱。十八铁丸地狱。十八尖石地狱。十八饮铜地狱。有如是等十八苦事。充满其中。下火彻上。上火彻下。其中苦毒不可具说。世间自有愚痴眾生。造作五逆。杀父杀母杀师杀阿罗汉出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。破佛塔寺破和合僧盗物。谤方等经。毁十方佛<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a><a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。作如是等无间重罪。其人命终入阿鼻地狱。犹如射箭经阿僧祇劫。备受眾苦。无有休息。故名无间阿鼻地狱。彼地狱一日一夜。当今人间日月岁数六十小劫。如是受罪逕歷八万四千大劫。尔乃行出。复入东方十八地狱中。南西北方亦复如是。遍九十地狱。一一地狱中皆住亿千万岁。尔乃得出。复堕畜生中。象马牛羊驴骆驼犬豕鹰梟鴙鸭之中数千万岁。以肉供人。偿其罪毕。从畜生出乃得為人。复為奴婢。又五百世常為走使。不得自在。又生為人贫穷下贱。衣不盖形。食不充口。复五百世乃复為人由不及次。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>人身难得。佛世难得。佛世难值。经法难闻。眾僧难遇。明师难遭。以得人身值佛闻法。宜应惻厉行道為先。难身口意慎莫放逸。放逸者一失人根万劫不服。甚难甚难。复得為人。所谓劫者极天地之始终谓之一劫。劫有三品。何等三品。一者大劫。有一大城。纵广高下百二十里。满中盛芥子。人天过百年已取一芥子别著。一大城中如是取尽名一大劫。色界天人寿是八亿四千万劫。尔乃命尽。中劫者。有一大城。纵广高下十八里。满中盛芥子。人天过百年已取一芥子别著。一大城中如是取尽名為中劫。色界天人用是寿命以数。一劫二劫极至十三万六百七十二劫。尔乃命终。小劫者。有一大城。纵广高下四十里。满中盛芥子。人天过百年已取一芥子别著。一大城中如是取尽名一小劫。是名三品劫也。又无色界四空处天。乐寂灭乐。次有色界二十二天。乐禪定乐。次有欲界六天。乐五欲乐。三界虽乐犹不免三灾所坏。何谓三灾。一者火灾。二者水灾。三者风灾。小劫尽时七日并出焚烧天地。六天皆尽故名火灾。中劫尽时天降灾雨。大如车轮。逕亿千万岁。其水洪起高至二十四天。复逕亿千万岁。色界欲界所有大千铁围中千铁围小千铁围。七重宝山及四天下须弥宝山二十四天宫殿。一切烂坏。是名水灾。大劫尽时有恶风起。吹三千大千铁围山百亿铁围山百亿须弥山王百亿三十三天宫殿。山山相搏令如粉尘无有遗餘。三千世界皆悉空旷。是名风灾也曰大楼炭经一百二十卷。广明世界中事。大经难见。是故此中略句其要耳。阎浮提纵广正等。三十二万里。通其山陵河池。故有尔也。宣数平壤之地。广长二十八万里。其中凡有十六大国。统八万四千城。有八大国王四大天子。东方有晋国天子。人民炽盛。南方有<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国天子。土地多饶象。西方有大秦国天子。土地多金银璧玉。北方有月氏国天子。土地多好马。此阎浮提内有十六万亿兵。聚有八万四千。地中有六千四百种人。万亿嚮鱼。有六千四百种鸟。有四千五百种狩。有二千四百种海。海中凡草有八千种。杂药有七百四十种。香有四十种。宝有百二十种正宝。海中有二千五百国。一百八十小国。敢五声三百国。敢鱼鱉黿鼉有五大国王。第一大王主五百小国。王名斯利。国土尽时佛少事眾耶。第二国王亦主五百小国。王名加罗。土地出七宝。第三国王亦主五百小国。王名不罗。土地出四十二种宝及百琉璃。第四国王亦主五百小国。第五国王亦主王百小国。五大城中人多黑短小。五大城相去六十五万里。从此诸国已外但有海水无有人民。去铁围山一百四十万里</p></div>"
}]