[{
    "title": "山海慧菩萨经 第2891部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>山海慧菩萨经</p><p>阿弥陀佛觉诸大眾观身经<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>品第一</p><p>如是我闻。一时佛住业波国。与大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>眾八万人俱。大智本行所作以达。其名曰<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>大势至菩萨药王菩萨药上菩萨普贤菩萨法<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>王菩萨师子吼菩萨陀罗尼菩萨<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>藏菩萨德藏菩萨宝藏菩萨金藏菩萨金刚藏菩萨光明王菩萨山海慧菩萨华严王菩萨珠宝王菩萨月光王菩萨日照王菩萨<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>王菩萨定自在王菩萨大自在王菩萨白像王菩萨大威德王菩萨无边身菩萨。如是等二十五菩萨摩訶萨。皆悉以达。尔时复有八千声闻缘觉。复有二万诸梵天王及以大自在天王。复有万二千大力持咒王。及以四万八千诸龙王等。复有一万亿罗剎王。及以二千五通仙人。复有八万四千诸须弥山王。及以河海水神王等。及诸比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>清信士清信女。如是八部大眾皆在会中。共坐听法</p><p>尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。处于道场七宝<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>树下。其菩提树高四十万由旬。尔时如来处在师子法坐上。為诸大眾转大法轮。雨大法雨。说禪定解脱离八难法。说是法时。天雨七宝华。尔时如来从头顶上放大光明。青黄白赤。上照三十三天。下照十八<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。六种震动。云何名為六种震动。天动地动大海动诸山动草木眾生动一切地狱动。是故名為六种震动。如来放光之时。地狱饿鬼皆得解脱。唯除一阐提。不得解脱。尔时阿难比丘即从坐起。于大眾中以偈讚佛</p><p>世尊大慈悲一切诸法王出现于<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a></p><p>度诸<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>流佛如金刚珠无不<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>者</p><p>是故诸大眾今当合掌礼我等于今日</p><p>得值金刚宝亦如盲眼人得见日月光</p><p>亦如日月王能除生死闇亦如风火王</p><p>烧灭一切恶亦如慈父母见子有重病</p><p>日夜怀悲恼思见无上师世尊大慈悲</p><p>出现于世间广度生死流得见世尊者</p><p>无有不解脱是故诸大眾愿见无上尊</p><p>尔时阿难。讚诵佛已。白佛言。世尊。一切眾生观身之法。其事云何。唯愿世尊為我说之。佛告阿难。諦听諦听。吾今為汝说之。夫观身之法。应当身心正定。身心定即一切法定。一切法定诸法亦定。若欲诸法定者。身心俱定。身心定者。不观东西。不观南北。不观四维。不观上下。不观虚空。不观外缘。不观内缘。不观身色。不观色声。不观他行。不观他身。但自观身不观他恶。但自观行不观色像。唯观<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。若能如是自观身者。更无外事。唯有出息。唯有入息。若能知是数息。坐者当与持身法。当与身触法。当与热顶法。若能如是观身中者。是為正真观身之法。除是观身。十方諦求在在处处。更无别法而得解脱</p><p>尔时阿难复白佛言。世尊。若能如是观身坐者。得何三昧。有我<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。佛言。善哉善哉。汝今发问。諦听諦听。善思念之。吾当為汝说之。比丘比丘尼。若有清信士清信女。净持戒行。不作诸恶。懃修禪定。得禪定以不為眾魔之所得便。当有五定。云何五定。声闻定缘觉定阿罗汉定菩萨定诸佛定。得是五定。复有五眼。云何五眼。声闻眼缘觉眼阿罗汉眼菩萨眼诸佛眼。得是五眼。复有五明。云何五明。声闻明缘觉明阿罗汉明菩萨明诸佛明。得是五明。复得五通。云何五通。声闻通缘觉通阿罗汉通菩萨通诸佛通。得是五通。复有五达。云何五达。声闻达缘觉达阿罗汉达菩萨达诸佛达。得是五达。复有五智。云何五智。声闻智缘觉智阿罗汉智菩萨智诸佛智。得是五智。复有五慧。云何五慧。声闻慧缘觉慧阿罗汉慧菩萨慧诸佛慧。得是五慧。以解一切法了一切义。复有三<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。云何三无常。一切眾生无常声闻无常缘觉无常。解是三无常。复有三有常。云何三有常。诸佛常菩萨常法僧常。得是三常。复能摄持<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。摄持正法以复能常乐禪定。得是禪定以复得四禪。得是四禪以应自见身中事。身中事以得离<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。离烦恼以自厌恶身。厌恶身以即得阿罗汉身。得阿罗汉身以得菩萨身。得菩萨身以复得金刚三昧。得金刚三昧以得法身常身金刚身不坏身安乐无边身<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>身。佛语阿难。汝向所问如是观身坐者。得何三昧。有何功德。如我所说。其义如是</p><p>尔时阿难。复白佛言。世尊。除坐禪功德诵经功德。其事云何。佛告阿难。有能读诵一四句偈。功德无量无边不可思议。复次阿难。若有法师。善能解义。功德无量无边不可思议亦复如是。阿难白佛。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>功德其事云何。佛告阿难。有能一念欢喜捨财。功德无量无边亦不可思议。复次阿难。汝今复听。若复有人以饮食衣服布施百千眾生。不如<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>一病比丘功德无量无边。复置是事。若复有人车马布施放万亿眾生。不如有人起立塔寺供养三比丘功德无量无边。复置是事。若复有人以百千库藏布施一世界眾生。不如有人一发<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。发是向佛一时之间一念听法。是人功德复无量无边不可思议。皆是菩提无上大因大果大报</p><p>尔时阿难。复白佛言。世尊。若有比丘比丘尼清信士清信女。能生一念善心。未来世中有菩提因不。我今心或不能解了。唯愿世尊。為我说之。佛告阿难。我见世諦。一切眾生信佛得自然不信得道难。以何故。譬如有人常怀不善诽谤比丘。有德无德自生分别。以生诽谤相。当知是人必堕地狱心。或诽谤正法亦复如是。尔时阿难闻佛。作是说已。即从坐起。头面<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。白言。世尊。唯愿為诸大眾广分别说。何以故。若广说者。我等从今无有或心。何以故。如是说者。开我耳目。何以故。譬如盲人见眾色像。亦如聋者闻声。譬如死囚上市欲杀。大自在王赦忽然而至。是人得活。即发声言。快哉。我今还得是命。复作是言。我等从今亦发无上菩提善心。复作是言。我今若不发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>者。当知我身与牛无别。阿难白佛。是人因此苦事得发善心。是故我今因问。世尊。一切眾生亦发无上菩提善心。是故从今无有或者。百千眾生皆发无上菩提善心。尔时世尊复告阿难。但自观身。善力自然<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>自然。正法自然解脱自然。三昧自然<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>自然。何以故。譬如有人<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>直心得正解脱即便生天。是人不求解脱。解脱自至。不求生天。生天自至。何以故。譬如有人值国荒乱。破亡失土远至他国。使属于他。是人食息忆念父母心不放捨。是人不时复自念言。我今以失本国远离父母无由见之。复自念言。且自观身。我今属他无由解脱。唯有<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>无上大力。是人尔时复不外念。即便斫木為像。日日<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。未曾放捨。如是正念或一年或二年能至三年。如是礼拜善力自然忽得还国见其父母。无量欢喜。佛告阿难。其实彼木未有恩力。但当是人正念<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>善力所致。世间眾生正念解脱亦复如是</p><p>尔时阿难复白佛言。世尊。世间眾生若能如是正念解脱。应有生天无一地狱饿鬼。佛告阿难。世间眾生不得解脱生天。皆由多虚少实无一正念。以是因缘。地狱者多。解脱者少。何以故。譬如有人于自父母及以师僧。外现<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>内怀不孝。如是恶人虽未报至待来不远。世间眾生外现精进。内怀不实。诽谤正法。虽未交报前涂不远。世间多虚少实。无有正念。不得解脱亦复如是。佛告阿难。汝向所说一切眾生亦应解脱。如我所说。其事如是。尔时阿难白佛言。世尊。修何善根得正解脱。佛告阿难。汝今善听正思正念。吾今為汝说有十<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。云何十往生。一者观身正念。常怀欢喜。已饮食衣服施佛及僧。往生阿弥陀。二者正念甘妙良药施一病比丘及以一切眾生。往生阿弥陀。三者正念不害一<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>。慈悲于一切。往生阿弥陀。四者正念从师所<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>。净慧修梵行心常怀欢喜。往生阿弥陀。五者正念孝顺于父母。敬重于师长。不怀憍逆心。往生阿弥陀。六者正念往诣于僧坊。恭敬于塔寺。问法解一义。往生阿弥陀。七者正念一日一宿中<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>八戒斋。一日一宿中受持不破一。往生阿弥陀。八者正念若能斋月斋日中。远离于房舍。常诣于善师。往生阿弥陀。九者正念常能持净戒。懃修乐禪定。<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>不恶口。若能如是行。往生阿弥陀。十者正念若能无上道不起诽谤心。精进持净戒。复教无智者流布是经法。觉化无量眾。如是诸人等悉皆得往生。尔时阿难复白佛言。世尊。一切眾生处在无明世界。不见过去佛未来佛现在佛。世尊无明世界即是地狱。当何所归。云何名為戒之根本。唯愿世尊。普為说之。佛告阿难。一切眾生若今现在不见过去佛未来佛现在佛。常当受持三归名字。云何名為三归。应作如是言。南无<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>南无达摩南无僧伽。云何南无佛陀南无达摩南无僧伽。胡言南无佛陀者归依佛。达摩者归依法。僧伽者归依僧。如是三归依即是戒本。如是受持。如是读诵。如是忆念。如是正观。当知是人世世生生处处在在。三归依力常得正念不入恶道。皆是三归解脱之力。佛告阿难。汝向所问一切眾生处在无明世界。当何所归如我所说。其义如是</p><p>尔时阿难复白佛言。世尊。若有比丘比丘尼清信士女。受持是经。读诵是经。正念是经。功德云。何。佛告阿难。汝今善能发问。汝今諦听善思念之。吾今為汝解说。若人无善根不得闻是经。若人无本善不得闻是法。若是一阐提眾不闻是语。清净有戒者。今得闻是经。何以故。是经能度八难。及以地狱饿鬼阿修罗等。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>五逆悉皆解脱。唯有一阐提。阿难白佛。世尊。往昔告<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。一切眾生皆是吾子。无有彼此。云何不度一阐提人。佛告阿难。汝今諦听。世间死尸活以不。阿难白佛。世间死尸若得活者无有是处。佛语阿难。一阐提得道亦无是处。阿难白佛。世间死尸戒一日二日三日四日五日六日七日。还得活者其事云何。佛告阿难。戒有死尸一日二日三日四日五日六日七日还得活者。即是一逆二逆三逆四逆能至五逆。如是之人虽堕地狱即生悔心。缘是悔心善力即出地狱。如是出者亦如死尸七日活度。于七日不得活者即是一阐提。何以故。一阐提人无善根故。是故不度。佛告阿难。汝向所问云何不度一阐提人。如我所说。其义如是</p><p>菩萨见佛国往生品第二</p><p>尔时眾中有一菩萨。名為山海慧。威德自在名闻十方。于大眾中即从坐起。正衣服為佛作礼。前白佛言。世尊。一切眾生所修习者。何等功德最為第一。佛告山海慧。汝今諦听諦听。善思念之。吾今為汝解脱说。若有眾生。以饮食衣服布施一世界眾生。不如有人一时之间正念礼拜所得功德无量无边不可思议。复置是事。若得有人终身礼拜。不如有人活一生命功德复多。复置是事。若复有人活百千命。不如有人一发善心造立塔寺。以四事供养。供养四<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>功德复多。复置是事。若复有人供养百千沙门。不如有人一发善心。心怀欢喜放一人<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>功德复多。复置是事。若复有人放百千人出家。不如有人一发善心。处于大眾中一时听法解了一二字义功德复多。复置是事。若复有人处于大眾中解了百千义。不如有人安心坐禪禪定乐功德复多无量无边不可思议。复置是事。若复有人在于世间闻有百千经。不如有人愿闻大方等涅槃常住二字功德无量无边不可思议。何以故。常住二字过去佛未来佛现在佛。如是三世诸佛之所修习所德功德。何以故。如是二字能除眾生过去世未来世现在世。如是无量无边生死重罪。除一阐提。除是罪以得正解脱。即得往生阿弥陀国。以是因缘涅槃义味于诸功德最為第一。佛告山海慧。汝向所说于诸功德何者功德最為第一。如我所说。其义如是</p><p>尔时山海慧菩萨。复白佛言。世尊。彼阿弥陀佛国有何乐。一切眾生皆愿生彼。尔时世尊即告山海慧。汝今应当起立。合掌正身。西面正念观阿弥陀国。愿见阿弥陀佛。尔时一切大眾见山海慧菩萨起立合掌。亦皆起立共观阿弥陀佛。尔时阿弥陀佛现大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>大光明。照山海慧菩萨身。尔时山海慧菩萨即见阿弥陀国土所有<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>妙好之事。一切世界悉皆七宝庄严。所有国土七宝光照。七宝山七宝地七宝树七宝华七宝塔七宝坊七宝池。八功德水六味食七宝恪H赵绿煊昶弑??S昶弑σ隆V钐煜扇俗髦钜衾帧1税⒚滞臃鸸?燎寰蛔?稀U娼鹇尥?指卜鹜痢F溆惺澜纭Oそ员κ髯?厦詈玫谝弧1斯?赵路?殖W?1送寥嗣癫幌巴馐隆U?澳谑隆2幌靶胺āU?澳诜ā2幌巴饨獭U?澳诮獭2恍尥庖濉U?弈谝濉2恍尥獾馈U?弈诘馈2患?馐隆U??谑隆2凰低庥铩U?的谟铩K?斜娚?咚暌陨瞎橐勒?ā?谒捣降扔铩6??降壬?P慕夥降纫濉6?鄙胶;燮腥?⒚滞臃鸫τ诘莱∑弑ζ刑崾飨隆F淦刑崾鞲咚氖?蛴裳?F湎掠惺ψ幼?F涫ψ幼?呶灏儆裳?U娼鹇尥?指沧?稀0⒚滞臃鸫τ诜ㄗ?稀?橹畲蟊娮?蠓?帧S甏蠓ㄓ辍K挡煌朔ㄓ甏蠓ㄓ辍K挡煌朔?帧<?鞘率币嗉 ?僖谑澜绨僖诤M獍僖谛朊稚较そ越鹕?0⒚滞臃鹣执笊裢?ΑR曰股愎饷鳌R园僖谑澜缤潦?钌交垢慈绻省7鸶嫔胶;燮腥?H晗蛩?拾⒚滞庸?泻蚊罾忠磺斜娚?栽干?恕H缛晁??涫氯缡恰J鄙胶;燮腥?追鹧浴J雷稹N业冉裾咴敢磺斜娚?韵ど?恕H缓笪业纫嘣干?恕7鸺侵?照?壅?畹谜?馔严ど?恕8创紊胶;邸H杲袢缡欠⒃浮J谴笃腥?υX萨</p></p><p>尔时眾中有一菩萨摩訶萨。本姓多罗。字摩訶<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>。具本神通威德自在。于一切法悉以通达。常无所畏。于大眾中起立合掌。為眾问事白佛言。世尊。如来是一切眾生大慈法王。普覆一切放大光明。照诸十方一切世界。云何山海慧菩萨得见阿弥陀。一切眾生云何不见。当知如来实无平等。佛告迦叶。汝今諦听。譬如日月普照一切。盲者不见非日月咎。一切眾生罪重烦恼不见。如来亦复如是。复次迦叶汝今复听。一切眾生未有菩萨行。是故不得与菩萨一等。何以故。菩萨有大慈大悲大善大力大法藏大念大愿大因大缘大乘大道大喜大捨大悲普覆。是故名為菩萨大行。复次迦叶菩萨。复能為一切眾生入于地狱。受大苦恼不以為难。所有罪者悉皆愿度。是故名為菩萨大行。佛告迦叶。山海慧菩萨有大威德亦复如是。佛告迦叶。汝向所问云何菩萨得见如来云何眾生不见如来。如我所说其义如是。迦叶白佛。善哉善哉。实如圣教。世尊。我等今者因佛神力。于此事中非為不达。為未来眾生问是义耳</p><p>尔时佛告山海慧菩萨。汝今欲度一切眾生应当受持是经。山海慧菩萨白佛言。世尊。当何名此经。云何奉持。佛告山海慧。汝今善听。是经名為阿弥陀。為诸大眾说观身正念解脱三昧经。二名度诸有流生死八难。三名最后<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>度有缘眾生。如来受持。眾生虽无<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。如是受持。眾生未有菩提因者。是经能与眾生开大菩提道。如是受持。眾生未有法身光明者。是经能与眾生作法身光明。如是受持。眾生未有三昧缘者。是经能与眾生开大三昧门。如是受持。眾生未至涅槃者。是经能与眾生得至涅槃。如是受持。眾生虽无<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。是经能与眾生。除无量无边生死重罪。除一阐提。如是受持。是经能度八难苦。如是受持。是经能与眾生闭大地狱门。如是受持。是经能与眾生破烦恼四魔。如是受持。是经能与眾生作大妙药。如是受持。是经能与眾生除烦恼病。如是受持。是经能摄一切眾生。如是受持。是经能除害人恶鬼殄灭四向悉皆安稳。如是受持。佛告山海慧菩萨。汝向所问当何名此经。如我所说其义如是</p><p>尔时山海慧菩萨白佛言。世尊。顶受尊教。唯然世尊。有眾生多有诽谤。如是之人于后云何。佛告山海慧。于后阎浮提或有比丘比丘尼清信士清信女。见有读诵是经。或相瞋恚心怀诽谤缘。是诽谤正法。是故是人现身之中来致诸恶重病。身根不具。或得聋病盲病哑病癖病鬼病魅病邪病狂病风病冷病热病痔病水病肿病或乱失性病。如是等诸恶重病世世在身。如是致苦。坐卧不安。大便不通。小便不下。求生不得。求死不得。谤是经故致苦如是。或时致死复堕地狱。八万劫中受大苦恼。百千万世未曾闻有外食之名。谤是经故得罪如是。或时得出生在人中。牛马猪羊為人所杀受大苦极。谤是经故受苦如是。又复為人常生下处。百千万世不得自在。谤是经故受苦如是。从此死以还得人中。百千万世未曾闻有三宝名字。谤是经故受苦如是。是故语汝。无智人中莫说是经。闻不解了。亦莫与说。正观正念。如是之人然后与说。常处空山。远离五欲。如是等人然后与说。若见有人孝顺父母恭敬师僧。如是等人然后与说。若见有人慈悲喜捨供养诸佛。如是等人然后与说。若见有人心怀欢喜恭敬沙门。无大无小。有德无德。有道无道。有法无法。心行正士清信女。读诵是经。流布是经。恭敬是经。不谤是经。信乐是经。供养是经。如是人辈缘是信敬。我从今日常使二十五菩萨护持是人。常使是人无病无恼。诸恶鬼神亦不中害。亦不恼之。亦不得便。亦不见恶。亦不横死。常使是人卧安睡安梦安觉安起安立安行安。是人所至之处皆悉得安。若复有人。读诵是经。应当正念。念报佛恩。然后与说。令说听者得发善心。好说是经。说者听者悉皆往生阿弥陀国。不敬是经说者听者堕于地狱。彼此敬重说者听者得正解脱。世世生生在在处处不经八难。随愿往生阿弥陀国。尔时世尊说经欲竟。大地震动。放大光明。度明缘眾生。上照三十三天。下照十八地狱。一切饿鬼悉皆解脱。除一阐提。放光之时百亿世界青黄赤白合以金色。阎浮提人皆见化佛坐宝莲华。尔时阎浮提人八万四千皆得生天。八万四千比丘神通自在得<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>净。万四千声闻缘觉初住地。八万恒河沙初住菩萨得四住地。十恒河沙诸大菩萨得不退不动地。尔时诸梵天王及以四天王等皆作是言。诸佛难值。俱诣佛所。却以头面礼佛。白言世尊。我等今者亦当受持是经。护诸眾生。佛告四天王。汝今受持是经。亦悉汝等后生西方阿弥陀国。复告二十五菩萨。汝等今者亦当受持是经。复告阿难。汝等是吾利慧<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。于我灭后受持是经。八万劫中广宣流布。使至贤劫千佛使诸眾生普得闻知。尔时世尊作是语。以还摄光明。以百亿世界土石诸山不净。如本佛说经竟。诸大菩萨声闻缘觉阿难等。天龙八部一切大眾。作礼欢喜。如说<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a></p><p>山海慧菩萨经</p></div>"
}]