[{
    "title": "律戒本疏 第2788部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>律戒本疏</p><p>谓犯四重戒已捨梵行。圣果<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>退没堕落永无分也。不可悔除亦名波罗夷。是故说言。若<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>不还戒。戒羸不出行淫欲法犯重罪。不应共事。捨戒有十九事。是捨戒餘非捨戒。向内五眾及一切在家<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人说。是名捨戒。言义捨<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧辟支佛。捨学说。捨共住共利。捨经论。捨和上。捨<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a><a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>释子。非我比丘沙门释子。我是<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>外道。是俗人。增上<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>名為学。一切布萨名為说。清净眾似清净眾共住通名共住。共利法财利名為共利。九部经名经论。若言义捨过去未来佛犯偷不名捨戒。若直言捨佛是名捨戒。贪欲捨佛假言捨外道佛犯偷。若戏笑越毘尼。捨学捨僧捨说捨共住捨共利捨经论捨辟支佛捨和上。如捨佛中说。法是涅槃无三世故。若直言捨法。若言捨三世法。是名捨戒。假言捨外道法犯瑜若言我捨阿者梨。不捨戒犯偷。若言我过去未来阿者利越毘尼。若言捨共财利。捨眾多比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>亦如是。假言捨外道共财利犯瑜。若言捨一一比丘比丘尼。及捨过去未来一一比丘比丘尼越毘尼。一切戏笑言捨戒越毘尼。误说心狂无罪。若心念口言说戒戒戒羸事语语犯偷。羸已不捨行欲。罪如上说</p><p>第二若比丘在聚落或在空地不与物取有达[口*贰]吒比丘。是陶师子。先作草菴為人所坏。后作瓦色赤严好。佛见谦责。令阿难坏之。后取阿闍世王城守大财欲造大屋。盗至五钱。依法应死。王将赦之。盗至五钱而死何也。将以物主惜之。后故取者罪之深。是以王道极其法也。如来随宜因而制重。依世烦物物无逆慊。犯罪虽一治之不同。王得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>随宜量断。或时提為极法。或杀以尽形。或但繫缚。或摈之境外。或输金赎罪。或苦责而已。此皆盗取五钱治之极法。佛悉因之。以定重禁所取之物。或在聚落。或空地。聚落多私。空地多官。随物所属则有主也。若二国中间既不属人。有不属非人。斯无主也。若世有转轮圣王。随王所统无物不属。斯有主也。物或有主而不守护。而无主。盗心取至五钱及五钱直捉。选择时犯瑜。离本处犯重。或物在地。或空中。或在器物。或在身上。是名本处界。若曳取未出界犯重瑜。出此等界犯重。若过户限。若度一横物及异色地。从高著下。下高上。即是出界也。又物在状。状為界。在衣衣為果。取他器中物。转上著下。下著上。悉犯重。或盗心在物不在器在器不在物。或两在随心所在物边犯重。非所在者后生心时复犯重。凡属王之物。王护惜所得罪。不护惜取无罪。有三种取。自取物教人取遣使取。取时即犯也。盗心取无主物重瑜。取有主非人五钱犯重。无主重瑜。又欲取人五钱而误得四三二一。重瑜。本欲取四三二一而得四三二一。轻瑜。取畜生宝物五钱重瑜。非宝突。取师子残肉无罪。五宝若似宝。眾生非眾生盗心取直五钱悉犯重。家鸟衔五宝。若似宝夺取犯重。以物应属鸟主故重也。鸟随比丘所属至处处犯重。至餘处重瑜。待鸟时亦重瑜。以咒力故令至处所也。野鸟衔有主物。夺取五钱直重瑜。似鸟心重物。重故不同虎。虎心不重故。鸟随比丘所欲至处亦犯重瑜。至餘处突。待鸟时亦突。若野鸟夺取家鸟物。即或野鸟物。家鸟夺取野鸟物。即或家鸟物。比丘夺取二鸟物亦如上说。若水中有主物捉留。后水到于处便犯重。若次若举令离本处悉犯重。若相言若作树相取他地五钱犯重。若不得重瑜。若為师持衣物盗心取。从左手转著右手犯重。一切身分亦如是。若以木石物举取他物。已离本处。虽还堕本处犯重。关箩不输税五钱犯重。若关主与税不得取。先问。税物為尽入。尽入官者犯。仰限输不犯。若避税间道去重偷。為贾客过物五钱犯重。又贾客令比丘过物。过已或尽与。或半与。税直取五钱悉犯重。若示道路便过。令官失五钱税重瑜。若关箩处有劫盗恶狩飢饿。若自避若示他令过无过罪。唼嚫入僧。不入者犯突。有十种物不输税无犯。一佛物。二法物。三僧物。四和上物。五诸师物。六父物。七母物。八欲以此物与他人及救罪罚。九為欲还主。十欲作法用物。谓欲作比丘百一物。异是十物应输税。不输税罪如上说。比丘与贼期破诸村落。得五钱分犯重。此谓比丘示语彼村。令贼取之得便。共分之偷人有二种。一担去。二共期。担去时两足离地犯重。若共期举二。是犯重。四足眾生若卧若繫一处。若解取若驱起过四足悉犯重。若在兰园拥墙出外四足犯重。见林中方念言。我当盗取重瑜。若杀犯堕。取皮肉直五钱犯重。若亲族师徒知识為劫贼。盗贼失物。不嘱令取。取者犯重。自物人盗去。已作捨意后见夺取犯重。求捨取无罪。若亲属破在他手不得作势力夺。夺者犯重。[虫*(替-日+贝)]虫犯者用[口*束]治脚肿弱故。若许<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>物意决向人说。后不与犯突。来报重。僧食佛不白。白餘僧及主人持与人明。若自食犯突亦来报重。死比丘重物属四方僧。若用作食。若分犯突。来报重。若先许五钱意已决定而后悔不与举虽本处犯重。又前定许彼彼彼未索不与犯重。知他决定许人物毁坏令失五钱重瑜。不输市治五钱犯重。縊死人施物。官若强索不与犯突。取至二钱犯轻瑜。从二钱至少分未满五钱重瑜。有一比丘尼。亦知<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>许。施越比丘尼物。便诈以施越名索取之。佛言。得故忘语罪。又言。诈以他名取得罪。得罪者或犯重瑜。随物所属。随物多少而得罪也。若越施不受物。物故属居士。居士边得罪。施越受而不同意。施越边得罪。今施越先许受居士施。一比丘尼与施越。同意取故不犯重。而但得故忘语罪也。凡七种取人非人物畜生物无罪。一己物想。二同意取。三暂因。四谓无主。五狂。六乱心。七病坏心。异是则把。取人物犯重。非人瑜。畜生物突。若他遗物要有所属。不得取。取之不得藏。应归还主。取粪扫衣无罪。凡三宝物不应货。若货佛物招提僧物。若破至他处得随突偿。若入口物现前僧物则不得也。了事取财突。度国忘奴出家突。有盗心犯重。多人遣一人取五钱多人犯重瑜。取者犯重。二人遣一人二俱犯重也。取非人畜生重物犯重瑜。轻物突。瞋心坏他物犯重瑜。轻物突吉罗也第三若比丘若人自手夺命若持刀与教人持刀与教死叹死乃至因是事死若比丘若人自手夺命若持刀与教死讚死乃至因是事死波罗夷。佛在婆求河上。诸比丘修不净观。厌患其报。或欲<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>。鹿杖梵志手断六十比丘命。因是结戒。夺命有三种。自作教作遣使作。彼命断时比丘犯重。又三种杀。或用身。或用非身。或两用。断彼命犯重。即死不即死因是死犯重。不因死犯重瑜。若作火坑欲杀人。人死者犯重。非人畜<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>者重瑜餘。一切方便杀应如是知。若為非人诈坑。非人死者重瑜。人畜生死者悉突。若為畜生作坑。畜生死者犯堕。人非人死者突。若作坑不定。為害一切命。人死者重。非人死者瑜。畜生堕。都无死者突。若似人者谓初胎始得身根命根。诸根未具名為似人。為杀母故命胎堕。母死者犯重。胎死者重偷。俱死者犯重。俱不死者重偷。為杀胎。胎死者犯重。母死者犯重偷。俱死犯重。俱不死重瑜。求刀有二种。或自求。或遣人求。叹死有三种。恶戒人善或人鬼病人。十二恶<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>人。是名恶戒人。语恶戒人言。汝何用久在世。作恶為不如早死。语七眾善戒人言。汝持善戒。死则生天。何不自杀。语鬼人言。汝何能受苦恼。何不自害。彼因叹死者比丘犯重。不因死者重瑜。人作非人相绝命突。非人作人想断命重偷。若為恼不為杀而彼命断重瑜。方便欲谋仪未去。去未至轻瑜。到之打未死重偷。教死遣使发言令去犯重瑜。意已决故杀盗二戒自作教作犯重。餘二戒自作犯重。教作不犯重。凡不故作不犯如迦留陀夷入居士舍不諦观床。便坐坐他儿上。儿即死。如是一切不犯。但坐时应諦视床上。不諦视者犯突吉罗也</p><p>第四若比丘不知不见空无过人法自言我得如是乃至增上慢若比丘不知不见空无过人法自言我得如是见乃至除增上慢。佛在维耶离。诸比丘在婆求河上夏安居。时世飢饉。乞食难得。為利养故自相称说。于过人法中未得言得。因是结戒。四果四向四禪四空安般不净观等名过人法。邪不得不见未触不证名不知也。不见四諦名见也。出于凡俗名為过人。过人法示得言得。他人解者犯重。不解者重瑜。方便欲言欲说轻瑜。说竟犯重。若言天龙八部来至我所更相问答。不实者犯重。若言我于戒淫欲不起。不实者重瑜。不解者突。乃至言旋风土鬼来至我所。不实者解亦犯重瑜。不解突。向非人畜生不解突。解重瑜。教他忘语突。若语他令说已得道。前人受语犯重。不受语重瑜。前人受初语时突。向他说犯堕。若问答不问者。谓或有人检校。或不检校為求清净故。便自实言。我不知言知空狂忘语耳。圣果是增法。若得<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>上至有顶法。虽求得果果相已现。知见分明。便自谓得增上圣果。以此高物故名增上慢也。虽所言不实而言意不空。意不空故不犯重也。如目连取入定相不取出定相。自言。无所有定中间阿修罗乐音随心想说。如是等比皆不犯也。犯一一法者。四重中趣犯一法也。如前备亦如是者如本末受具戒时。不与共事犯竟。不共亦如是。四事竟</p><p>十三僧残法僧伽婆尸沙。僧伽有二义。一曰秽浊。二曰优恼犯重也。四法如堕淤埿。如坠粪坑。故言秽浊。自惟罪深心常愁怖。故言优恼。已此恶名名四重也。婆尸沙残也。四重為恶根。十三為枝叶。将推其所由。以本自枝故名僧伽残。残者沙也。有餘之谓也。犯四重法则戒体悉秽。无复餘净。故自说邪绝净眾名為无残。十三事戒不悉污。改过自洗还得清净。故名有残。残由重生。今当分别。前五残从淫生。作房二残从盗生。二[言*奇]从忘语生。后四残从<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。生以类相生也。凡作四重未成。有二种瑜。欲作為轻。已作為重。已成通名波罗夷。无复瑜僧残之名。本為四重。亦无突吉罗名。僧残瑜兰遮亦如是。从僧残至眾学。多因六群比丘制。阐怒加留陀夷多欲。后得罗汉。象师两宿多痴。后生龙中。难陀婆难陀多颠。后生天上。夫无因而制物或怨怒。有由而起莫不信悦。故待其先犯。然后结戒也</p><p>第一出不净从初至四。因加留陀夷犯恶故结戒也。有三种犯残。一<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>欲出。二身动。三精出。又三种犯。一為受乐。二為治病。三為自诫。或以受色或不受色发心身动精出悉犯残。或<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中发心身动精出亦犯残。為出故而动身而不出重瑜。动以取乐而不為出轻瑜。若搔按小行处。发心身动精出犯残。内受色者内身也。内不受色外物等也。凡為出精方便欲作轻瑜已作未成重瑜。出已犯残。无复瑜名。餘戒亦如是為尔。未成而止重瑜。弄而不為出。出者犯残。不出而止轻瑜。若炙疥摩触。或行时两髀相摩。或衣触。或骑乘。或车上自动出不犯。或见好危。或不见意想出不犯。教人出精突。云受他欲重瑜。欲令精出。出者犯残。僧残边重瑜兰四人懺轻者。对手佛在舍卫国</p><p>第二若捉髮乃至摩著细滑。凡有九种犯。上摩下摩。若捉若抱。若牵若推。若举若下。按隐处欲心九种摩触。无衣女人犯残。含衣重瑜。向时轻瑜。女欲盛九种摩触。无衣比丘有衣比丘。比丘欲心爱乐亦如是。云小女亦尔。细滑同故。若女人所男想黄门想二想摩著细滑亦犯残。合肉髮扴齿捉著滑细亦犯残。捉虽肉髮扴不触细滑重瑜。若欲行欲故捉男黄门二根重瑜。為欲受色受触乐故捉突。都无欲心无犯。上九种著细滑人女边犯残。非人女边重瑜。畜生女边突。若触细滑人女边瑜。非人女突。若母姊妹女触身无犯。若救水火刀杖恶虫恶鬼诸难。若高处堕无染心捉。无犯也</p><p>第三恶口语既不得触乐欲。纵口以畅意也。如少男女淫欲盛故堕二篇事具说。恶语有九种犯。讚毁乞愿问反问辨教骂。若比丘向女人以九种讚毁三处。一一语解者犯残。不解重瑜。向时轻瑜。若女自以九事讚毁三处。比丘随顺其心少多语出。一一语中犯残。细骂者胡本言相恼。麤骂者如白衣语。若比丘女人所女相男相黄门相二根想。恶口语皆犯残。女人解语意比丘犯残。若少痴聋不解重瑜。非人及男黄门二根解重瑜。不解者突。畜生男女解不解悉突。云发一恶言于眾多女人中得眾多罪也</p><p>第四欲<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>己身嗟言。以身供养。供养中最最上最。如一切供养所不能及。若言能以身行欲供养我等持戒梵行人者。是第一供养。九种叹中一一犯残。若言能以身行欲供养。我等不大持戒行梵行人者。是第一供养。九种叹中一一犯残。若言不以身行欲供养我等持戒行梵行人。是第供养。九种叹中一一语犯重瑜。其人恐犯残。故作斯语也。比尼云前女若解亦犯残也。不以身者意实以身為言。女作非女想欲者犯残。非女女想重瑜。若人女边犯残。非人女边瑜。非人女边突。直言以身供养。我言示辨重瑜。将叹或言未成轻瑜也</p><p>第五媒嫁加罗比丘听明利根。未出家时常為人断疑。媒通男女。出家之后犹故不捨。因是结戒。虽不自行而过亦眾多。一多欲当事自妨正业。二令人忿恼毁灭佛法。三长他欲恶增其生死故。出家之人所不应為女人有十四种守护。父母兄弟姊妹守护。舅姑亲理护。姓护自<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>护天护。或持男家意至女家。或持女家意至男家。随初受语处名主人。或自受主人语。或从使受。或从使使受或自语彼。或使语彼。或使使语彼。或自还报主人。或使使还报。三种语彼。三种还报时一一重瑜。悉未犯僧残。又云。三种受语时轻瑜。凡媒通男女。要彼男女交会时乃犯僧残。已未会重瑜。方便将媒轻瑜。媒二男非残。已交会重瑜。未会突。若父母惰虽和合如始犯重瑜。方便和合轻瑜。以相瞋故犯瑜。若无瞋共要永断还和合犯残。若姊妹等亲直可犯突。作方便说应不应轻瑜。便欲和合轻瑜。有七种妇。三种根本妇。一二亲以水浇夫手手授与之。财货嫁取。三伐国得之。若天违之未与手书。还為和合重瑜。若与手书妇直都绝还令和合犯僧残。餘四种。一自来得。二以衣食得。三生合得。四暂得。非根本得。故去住自任妇。若一都绝不须手书。所以别也。為和合故犯僧残。未绝和之重瑜。受贱人语语贵人还报贱人重瑜者。一以错故。二以贫贱终无成事。若受他语解畜旨还报僧残。僧残者明交会时也。不解畜旨不犯。不犯者如言共供养三宝比也。受畜旨不受语重偷。货钱為令成犯轻偷</p><p>第六无主自作大房阿毘罗比丘自作高广大房。乞求非一。居士所谦。佛已多欲损法。多荣妨学。又外妨难致患非一。因此结戒。令<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>如量。要三乞白眾。眾為作白四羯磨。然后得作也。过量不白二俱犯残。量取内云僧地私地及自钱作皆犯。初论说平地时轻瑜。虽小作不乞地犯残也。难处妨处今悉分别。是舍四边一边内有官地居士地外道地佛地比丘尼地及流水深地深坑大石大树。是名妨处。妨彼自妨故。以后生难故亦名难处。此处作之二俱重瑜。恶蛇恶龙蜈蚣百足诸毒虫处。是名难处。后生难故。自妨妨彼亦名妨处。此处作之亦二俱重瑜。是舍四边。一归内有蚁子死举死。是名妨处。二俱妨后亦难起亦名处。是处作之二俱突。或教人作舍已捨。行了后不白过量难处妨处。或未成行还自成亦不如法罪悉如上。若僧地作房。房中间无一归<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>行路。是亦妨处重瑜。若私房后為白衣沙弥作屋。不白重瑜為三宝作房。眾和便作不羯磨。為三宝作大乞地不犯。若难妨犯四人瑜。买得先成舍。若受施不犯僧残得突。是过量舍应还僧。不应买买犯突。还已听懺悔。私房中作阁无犯。先已白故。若僧房中作当白僧。不白突</p><p>第七有主為身作大房阐陀比丘多知识故。给施所须助作房舍。便伐大树輒作过量。大树义林则处有威灵神树多人所识。又得止息。失林树已人既不识又失荫源哉。共嫌[怡-台+责]。由此故王龙蛇等能作患。害破梵行。毁三宝故。容四威仪。云大者此总说房耳。不必是大也。若僧不与作羯磨。不检挍僧犯突。因此结戒。唯有主為异耳。其餘悉如上无主中说</p><p>第八以无根波罗夷法陀标比丘。是六通罗汉。成就五德。不随爱不随瞋不随痴不随怖。知得不得时。為僧作分房人。慈地比丘。是下生故得最下房。慈地即夜已生恨心。明日复愚得麤食。如是再三。以此二事极大忿恨强令姊尼註访。陀标云。与我通慈言我亦先知。佛以尼自言犯重。即与灭儐。佛问陀标。汝实尔不。答言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>自知。佛言。汝今不得作是语。汝忆念者便说。不忆念者便说。答言。我不忆念。世尊佛语诸比丘。汝等当记。陀标比丘不忆念。為陀标作忆念羯磨。令自忆念為犯不犯。一切比丘不得说其犯恶。此是守护羯磨。教已起入禪室。眾僧即以三事见闻疑。三事苦检挍慈地。慈地首言。无所见闻疑。见闻疑事则為罪根。无三而谤。是名无根。无根而谤则犯僧残。无残而谤则犯堕法。无堕而谤突。作方便时轻。说不解重瑜。闻信闻者得道人所闻也。闻不信者于不可信相瞋谤人闻也。不清净似清净者。犯淫名不清净。不杀等似净比也。如清净似不清净者。唯作毁禁方便不<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>也</p><p>第九异分事中取片慈地前以无根而谤。故姊儐身展常求谤缘。以肆忿参会于灵就山。逢见陀标经行林中。时有二尼。过住问讯。问讯已坐息路侧。陀标脚跌倒卧尼上。慈地见之即以為根。又于山下见群羊和合。复以羊事為根。异分者犯四重法也。犯此罪已眾不共事。分与眾别故名异分。其餘三满是四事之片。三篇方便诸突吉通名似片。似片中有二种分别。眾学一篇名须臾片。将以心悔则除罪。不经时故名须臾。若以欲心与尼屏处倒卧其上。则是异分之片。今陀标屏突<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>倒卧非故。无欲屏处及倒卧身上。突吉罗罪之轻。至片之极。假非其正片故名似片。凡谤者或取片。或取似片。陀标无正片故。是慈地取似片取及似為作罪根而谤。二俱犯残也</p><p>第十破僧缘事共挣调远為坏僧故执行五法。向新学比丘说言。有五法。所谓纳衣乞食。一食露坐不食肉。汝等尽寿受行五法。疾得涅槃。不用八正。于五法边说十四法。非法<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。法说非法。非法者五法。即非法。八正即是法说。言五法是法八正非法。律者胡本言调伏。调伏义者八正能伏三毒。故名為律。五法不能。则非律也。夫八正道向涅槃理。满足故无残。五法不足故是残也。持八道非犯。说是犯。受五法是犯。说非犯。常所行是八道。非常所行是五法。八道是诸<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>也。五法然调达以八道為非。五法為是也。懃心方便受是恶缘。先欲破僧。僧三諫不止。佛后种种方便諫之乃止。尔时有逆未有僧残。僧残边瑜也。佛因是结戒。从今欲破僧者。先应三諫。三諫不止轻瑜。眾应為作白四羯磨。諫一白。二諫不止。三諫重瑜。三諫不止犯僧残。十四法十四重瑜。及諫中瑜。共成一残也。从是有羯磨。三諫后因眾集。调达来入受说上事。佛重諫之。不能令止。世尊知时捨眾而去。复于后时眾僧眾会。调达又来。自起行筹唱言。同昔者捉之。初行助和。离时四人捉之。僧作二部。是名破僧。四事<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>边瑜。一大逆也。二行二百五十人捉筹。三行通前五百新学凡夫比丘捉筹从之而去。三行行行得破僧罪。于此一日<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>趁乱。八正不行。法轮不转。佛在世以遮法轮為破僧。今以坏羯磨為破僧。调达破僧已。以有罗汉尼諫。諫而不受。增恚慢自以手摶杀阿罗汉尼。次后出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血。是时犯三大逆。逆罪破僧不得悔。破羯磨僧得悔。凡一界内作二眾羯磨。即是破僧羯磨。犯僧残边重瑜无僧残也。如法羯磨。意欲坏之而不来听。破僧边重瑜。虽来而不同犯突。作破僧意斗乱令眾作二部。亦名破僧重瑜。非破僧羯磨直不知而散突也如水乳合安乐行水与水合。乳与乳合。则一味不坏。若齐心同法则眾无异趣。一味之眾安和乐道。故言安乐行也。律师云。今破羯磨僧亦应三諫。三諫不止不犯僧残。于例乃未可安也。律师云。今破羯磨僧无白四羯磨也</p><p>第十一有餘比丘同意别异语调达破僧后餘善比丘。先与劬和等亲厚同意。于私隐处愍而諫之。乃至若多皆善比丘也。次下言是同意比丘者。是彼四人与调达同意也。初先一人二人三人諫。是轻瑜。僧中羯磨諫重瑜。助破僧四人犯僧残者。结戒后也。僧諫不止助成破僧。犯四事边逆轻瑜可悔。餘五百比丘犯僧残边重瑜。九清净比丘者。调达自以為佛。不入八中。故当捨破僧同意别异语。意与调达同。即与善眾异。异眾之言。宜速捨之。调达作佛。四人為眾。有佛有眾合而成化。能担法故无首化大逆也。从者重瑜。是比丘说等皆是重偷。羯磨前也</p><p>第十二污他家马师蒲宿等六群比丘所游行处。坐起言语皆越威仪。瑜兰四篇眾恶。斯备信向之人。<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>悉坏。轻贱佛法。不复敬眾。尊者阿难入村乞食。大被轻辱。空愣?埂R蚣??娙绶ㄇ?觥W髦种址欠āC麨槎裥小;偃司恍拿?鬯?摇K姘?娌_随怖随痴。此被驱者怨辞也。于时马师等六群比丘。闻大眾来。知欲驱己。或风远迹。或迎眾归罪。或守迷本处被驱而怨。谓犯恶不异。去留宜同。而今不同。必由爱憎。或轻我畏他。或痴闇不达。处心不均。行事不平。如是瞋恨不肯受諫。未諫时随犯。餘篇得餘篇罪。先一人二人三人别諫时轻瑜兰。僧中一諫二諫二重瑜兰。三諫不止犯僧残也</p><p>第十三恶性不受諫因阐陀恶性恨戾慢。眾专已自用綾悔。他人犯戒不悔。闻諫喻甚。若恶若善。其于不受。是名难共语。难共语犹不可共语也说所犯戒经中事我等说如所犯悉是戒。经中事非忘造也如法如善从理名如法。慈悔名如善共諫共罪中出故凡说戒諫悔及出罪。要共和合。理无专独。故则眾得增长。是故汝勿自专不受諫悔也三諫时恶而不諫。或断善根。毁灭<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。三諫至诚则思忆自受也九初罪四諫至三前五残或作方便成事不容諫。或隐蜜不障不得諫。作二大房。限以应遮。以羯磨于一事中有听有遮。遮则当諫。听则不类。不类前五。又不同后四。又起大房存于宽泰。宽泰之意不至迷执。又恶不至清净。不极重遮之便止。不烦三諫</p><p>波利婆沙秦言别住也。发露已眾与羯磨令其别住。别住时外有客僧来。要向别发露。作如是别住与覆藏日等。昼则為眾执劳。夜则别房止宿。不意谦苦。令眾慈念。然后与六夜摩那埵。摩那埵伏断时有客僧来亦同发露。又日日眾中白眾言。我犯某罪作如是事竟。尔所日过餘尔所曰在屈辱摧伏。故名断伏也。若六日垂满而便犯残。即发露者不须别住。但更与六夜伏断。名為本日治也。若别住未竟重有所犯。覆藏者随覆藏曰更与别住。若后覆藏日少前覆藏日多者。不须臾与别住阿浮呵那名出罪也。满六日已二十眾中為作羯磨令啼出罪。出罪者从罪中出去也。别住断伏四人以上便得与之。出罪要二十人者故也。罪责将毕。宜令心至大眾所。临惭愧必深。又多人证智令后无嫌疑。爪四人得说戒。五人自咨。自咨羯磨一人作自咨人。自咨人则受僧使。餘四人说师。非受使故通有得四人说戒也</p><p>二不空法因迦留陀夷与女人屏处坐。有鹿子母优婆夷得初道。可信人以所见白佛。比丘所犯定是五篇所摄。而彼不知何事何罪何万所摄罪。虽定见而者不定故。以不定為名。若优婆夷据其罪。自以可信故受其所见。以不审故不受所据。又应问是可信人。汝有证不。答言有证。复应问证。证同则受。异则不受。受可信人语已应取定比丘。定比丘首实便随事治之。若其不首与实觅羯磨。羯磨不受便驱出觅罪。中间不得作和上及种种师。与人受戒比丘比丘尼。依止师足数人。如是种种不得。犹如得戒沙弥。凡三归<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>优婆夷亦名可信之人也</p><p>第二因利比丘与女人露坐语居士萨薄呵见而嫌之。即以白佛。以露处亦多人所见。必致讥嫌。是亦不可。虽母姐妹是亦不得。人不达故。律师仪云。所以在二篇之后三篇之前。特以不定轻五篇故受其中也。意以為上二篇罪重说之以竟。若有犯者宜其諦思。故说不定之篇令其首定</p><p>三十事捨堕者长财宜捨。而罪隧恶道。故名捨堕。捨堕物持现前捨。捨而不实何也。令知非法起惭愧心。则贪心薄也。捨有二种。一施捨。二净施捨。不净物应施捨。净物长应净施捨。三衣惆僖环ㄓ梦锓浅ぁ2恍刖粧巍pN一切长悉应净捨。一肘已下不净施突。已上堕。绵糸缕三毛捨[糸*守]不净捨突。若绢若布时已净施。后作衣不须净捨。捨堕衣未截。贸易餘衣。餘衣亦捨堕。若受净捨人取物用突。应夺取强令悔适。若苦索不还受净施人犯重。若满人乃至多人共财不须净捨。绢布等净物大比丘边捨。饭食善沙弥边净捨。宝物白衣边净捨。后求净物。僧祇曰。若僧中分物人得一分。要当作同意净施。若不作犯堕。若二人共得物者。未分时不犯也</p><p>第一讫迦缔那衣长衣十日应畜安居竟得及<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>衣中得者也。十日急施讫即日捨也。一日至十日衣已捨者无罪。但后次续曰不断故。第十日得者有犯者也。為浣过十日不犯者。顽还成故。凡有四句。或三衣及非三衣。是所受用者尽具而未捨。功德衣有二种。具或自具。或少一以功德衣足。令具二戒。以捨功德衣。而三衣不具捨有二种。或八难<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>捨。或曰满捨三。或三衣具亦捨功德衣。功德衣当一名分利。餘功德衣利曰足捨也。若少二及无三衣。不得功德衣。四或三衣不具亦不捨功德衣。此谓已得。少物未乞。而足成衣名為不具也。功德中得七利捨。七戒无罪。安居竟无功德衣。不得离三衣宿。而一月中亦得五利所。谓数数食中前入村中后入村。不白而去。畜长财别眾食。不嘱食唯不得功德衣。中施衣及离衣宿為异也。故后坐比丘不得此日。制已过夏分入冬分。故夏分多游行礼塔师僧故。檀越心喜故。佛听先净施物。初功德衣竟更不净施也</p><p>第二不得离三衣宿為欲异外道故听割截衣。為寒故听三衣。大衣入村。中衣入眾。下衣私处。无功德衣及已捨為离衣。宿后夜时失。后因<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗老而衣重。佛听眾与羯磨留也。凡老而衣重。自咨后无功德衣。九月日中游行。三衣中堕重者。眾為羯磨捨一无罪也</p><p>第三时衣因六群比丘贪求无厌故制也。功德衣时得衣名时衣。时衣长畜无罪。功德衣竟名非时衣。自手受物明非。金银等不净物<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>衣坏。容猫子蹄失应疾纳。却摓更受不捨堕也。唯犯突。若即日补不至多曰不须臾受缘。缘边綖破亦尔也若不定功德衣竟三衣足亦得畜长财十日。若三衣不具而得种种色。各各未足成衣。听畜一月。一月已应连合。异色成衣。合而犹少听更求令足。足时便作无定限。若一种一色衣不足。求足时便作。不至一月。若故不求突。不限日月。知更有得处為补故知大会处。或亲理家应当更得。為欲侍之补合令得足。畜一月不净施。餘不作衣财。如常净施衣。极小二肘半三衣也。若竭支量如埿洹僧者。得下量受当三衣也</p><p>第四从非亲比丘尼取衣花色比丘尼以肉奉眾时著一衣。衣极精好。六群比丘见而贪求。尼即施之。自著弊衣。世尊怪问。因是结戒。以三缘故遮取尼衣。一以尼求衣难得故。二非亲理取无节故。三恐因是后心起非法故。各随所乐贸易则听。若竭支以上钱帛得贸。三衣不贸者埿洹僧。竭支以上犯堕。以下突。转债贸亦犯。多比丘取一尼一衣。多人犯多尼边取随尼為犯。出家尼者未受沙忌戒故也。凡五处不应往。所谓大童女。宽妇。淫女。含新出门女。酤酒家也</p><p>第五非亲理尼浣染打故衣迦留陀夷与掘多尼欲心相视漏失污衣。尼為浣之取计自灌。遂以有身恶名流布。因制。非亲以妨恶缘。乃至一枕头名為故打。一下名為打打浣染。于是三事中越一便犯。何况二三也。语莫打染。打染等犯者由先作方便欲令打故。若先实无心者不犯。云新衣未著故衣浣净得倩摓也。浣时色脱。如本染竟更受。若犹有色虽染不须受也。青黄白紫等衣受。当三衣不戒受也。不净色故也</p><p>第六非亲理居士居士妇得衣跋难陀多知辨说。强乞取衣。居士悔惜。瞋恚大唤贼向佛。佛即结戒。非亲理勿乞。缕缘突。乞衣捨堕。若王若贼怨家所夺。若火曰所烧。若自失。若<a href=\"/remen/fengshui.html\" class=\"keylink\" target=\"_blank\">风水</a>所标。以是因缘失衣听求所。则父母亲中俱取。七世上取。二祖及父下取。儿及二孙中取。自身為七世也。姨姑兄弟姐妹伯叔伯祖等。七世以内是亲故也。小母伯叔母嫂等非亲亲也。赤麻胡麻衣也。翅姨罗者诸沙。染衣也。芻麻即缚麻衣也。无埿洹僧竭支得乞</p><p>第七非亲理居士居士妇自咨与衣乃至上下衣应受前以结戒非亲理向乞。好施之人哉。有怨恨。若唯亲是福。非亲何熟。又诸比丘因缘失衣。无有亲理。求之无所。于是世尊复為开。三衣有上中下。有三衣為上。餘為下。若比丘失衣。施者咨与听。取所少不得过受六肘十八肘。是三衣段為割截故各长一肘也</p><p>第八不得自住非亲理所求好衣跋难陀积财巨亿。又大出息有居士。多负其责。无以归偿欲為难陀作衣。求减息利。所欲作衣。或如是中贾。或如是下贾。又先无慧言咨难陀所求。而难陀既闻便逆往语之。当作如是。如是上贾之衣。得衣便去。不為减利。居士两失。极大瞋恨。世尊闻已因是结戒。好恶贵贱应任施主。不得自住强求好作。若贾若色。若量求而不得突。得衣已捨堕。索此得彼突。因制出息突。若亲理则量其贫富求之。以理求者不过。施者不怨。故制非亲理也。白衣上下衣还者以用处多故。又令生上苦。于乞者易故。比丘少不更索者。以不多畜财故。长不还者以是彼长。既无多用而心已捨故</p><p>第九非亲理各各辨衣贾此亦大负跋难陀出息之物欲為作衣。求咸息利。难陀闻之即念一家求衣。佛所不许。二家合作。不犯所制。便作因缘。诣二居士。强令合作所乐之衣。彼于难陀不随所欲。又今所作染色贾量。以有所在而难陀释子强令合作。于三种中悉过本。言当如是如是。如我所欲又得衣便去。不為减利。二俱两失。极大瞋恨。因是结戒。亦应任彼</p><p>第十有四种人遣使送衣贾乃至比丘法不应受跋难陀博闻辨说。又多财宝二事因缘致供非一。恐物不达四种人。皆称名遣使也。衣贾金银等也。非净物不应受。又无同心净人故不受也。受而不捉突。受提捨堕。沙弥不得捉不得畜。守僧房人僧守园人。凡受三归五戒。若人若奴通名优婆塞也。此等僧同意。能為执事受名净物。其作净使者。应先住劝喻。劝喻已还报。若比丘。比丘然后共守物而语。后须净物得住从索。索而过三彼则瞋恼故。后三默然。令其知意。亦难陀寄商人物住。既非时求之过。其令失利。极大瞋恼。默然之制因斯而起</p><p>十一縞絁耶作敷具縞絁耶绵也。数具房中敷地縟也。俱舍毘国比丘取绵作縟。一以绵贵。二以多害虫。四辈讥嫌。因是结戒。将以害生无慈故。难治妨业故。奢贵非法故。若人為作。若是币故得受用</p><p>十二纯黑羊毛作敷具因六群比丘制也。以极好极贵。难得难治故也</p><p>十三应用二分纯黑羚羊毛既不听纯。开其杂也。杂既易得。入贪著心薄故听也。异色二分。白色半之下。下者半之腹脚边毛為下也。上黑色长一两捨堕。下色少一两堕。白色少一两突吉也</p><p>十四敷具满六年前纯杂及此三种。皆房中地敷具及绵縟也。六群贪积未听便作。或谦薄作厚。或谦厚作薄。轻重大小悉嫌。更作趣作方便欲得多畜。因是结戒。以六年為限。限满而作不须白眾。若示满欲作。要白眾。眾听為作白二羯磨然后得作。眾為筹量故。故坏听易。截长续短减大益小。又观老少亦业力疆弱。堪自随身尔乃令作。云不持行亦无然持之益善也</p><p>十五尼师檀是坐具也。诸比丘多畜地敷及坐具。新故相积盈满。移枷眾僧受请。世尊往后开一房行。视见之人谦曰。受而不用无益于施主。又多欲妨学非沙门法。因是结戒。令用故缘之。施者得福。受者无罪。若有故縟纯新作者捨堕。若无故縟纯新无罪</p><p>十六行道得羚羊毛商人远行。多戴羊毛。车坏牛病无由。致去道路多贼伴车悉重。欲以与之复不肯受。会有比丘。从后而来。商人大喜即以施之。于是比丘负重。随去至前聚落。商伴嫌恨。语比丘言。汝為商也。行至于此。因是结戒。不复听取。后诸居士欲施羊毛。比丘不受。居士甚恨。因是复开。开而限不过。三由旬自担捨堕。若与他共彼亦三由旬。若不共亦如是。令他担过三由旬突吉罗。绵同羊毛。其餘悉异。凡比丘持担悉不得逕村。逕村突吉罗也</p><p>十七非亲里尼浣染擗羊毛迦留陀夷眾中分得羊毛。令尼浣染。既废道业。又年色变坏。后诸比丘尼眾共往佛所。佛问。何故。具以实答。因是结戒。犯者捨堕。将以亲必无恶缘。风尘讥嫌。亦无由而起。故制非亲。而许其亲理也</p><p>十八自手取金银教他取举银则七宝钱等一切宝物皆悉摄也。如是等物物之珍也。有识之类莫不爱重。亡身失道。靡不由之。而六群比丘之徒。手取金银。长者居士减共呵责。沙门释子盍捨。珍翫受持。四衣如何捉金。与贵人无异。因是结戒。不得捉宝。自捉教他比丘捉皆犯捨堕。沙弥得捉不得畜。捉宝之罪要眾中悔过也</p><p>十九银买种种物言种种物则是一切所须之物也。大比丘用捨堕。金银随意所买。若法非法无不备有。因是结戒。悉不听也。凡捨堕物之所买。尽是捨堕物也。唯可食物贪欲得突吉罗。无可捨故。无渐故。其过甚重。要僧中懺悔然后乃除耳</p><p>二十种种贩买有一梵志。著赤色衣来诣跋难陀。跋难陀见之贪心内发。巧说方便以故衣易之。后懺悔还索。难陀不还。彼大愁恼。怨叹盈路。将以难陀贸易。彼衣本為贩买。不為自畜故。因是结戒。不得贩贩之人。于一切人非人。尽生恶心。所得财物以供三宝。三宝不受。令知惭愧。一切贩卖所得之物悉皆捨堕。应眾中悔过。為利故买。买已不卖。卖不买皆突吉罗。若以同易异。以同易同。展转求一一捨堕。贸易衣七日听还悔过也</p><p>二十一长沣以盛食得一便足。六群比丘多畜无节。因是结戒。不得长畜。取时突。过十日捨堕。有三种上恪K?挂汇他羹果等可食物半羹。中者求上。下者下中。大过上小过下非恪2挥κ艹忠</p></div>"
}]