[{
    "title": "持诵金刚经灵验功德记 第2743部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>持诵<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>灵验<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>记</p><p>昔梁时招提寺僧琰师。初作<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。时有相师。语琰曰。师子虽大聪明<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>无那相王短命如何琰闻此语。遂请大德。共详其福。修何功德。更得延年。大德云。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>圣言。依法<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。功德最大。必得延年。琰时奉命遂即入山受持般若经。六年出来。更见前相师云。法师比来修何功德。长寿殊相顿能如此。琰便具说前者被相寿短命。遂以入山受持金刚般若。更无餘业。师曰。不可思议。因兹功德。遂為大德。法师年过百岁。方始受终</p><p>梁时开善寺僧藏师讲说知名时有胤师。何胤之善能占相。过见谓曰藏师。须聪明為讲说。信手依<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>中撰取一卷拟长寿。持乃得金刚般若。藏在房诵持三年不出。后见胤之喜而言曰师有何法改容貌。<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>所相无验。藏云。檀越相大有验。是时度厄难為得受持金刚般若经力如此。胤之言曰大不可思议功德<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。今得相百年餘。岁果如所说记</p><p>隋时有婆罗僧藏法师。能持金刚经禁咒断除一切诸恶。有小僧就学成咒法。数年堪伏之耶。来诣江畔见有一胡神之庙宫庭。即於此中坐心宿诵禁咒其犯遂殯。藏闻弟子身死忿恨自来到神所。亦於庙坐诵咒因即致死。于时同寺有一僧。每恒受持金刚般若经。闻藏师师徒并為神打死遂来神所。亦於庙坐诵般若经。至夜来闻有风声极大迅速。须臾见一物。其形怀异壮丽奇特可畏倍常种种形容眼光似电。师坐<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>诵金刚经不息亦无恐惧。神来至前摄诸威势。右膝著地合掌恭敬。听诵经讫师问神。檀越是何神祇。初来猛迅后乃寂然不动。神即答曰。弟子是此宫庭胡神。為性刚强。戾见师习大乘经典不可思议。是以伏听。檀越既能如此信敬。前者二僧诵咒何缘打杀。神言。彼二僧者不能持大乘经典。见弟子来逆头骂詈口诵恶语咒术。弟子不伏。此二僧见弟子形貌并自怕死。亦非弟子故违杀害。侧近之人。知师入其神庙止宿。恐同前者二僧被打杀。至旦诸人共相率往神所看迎乃见平安。问师<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>所有事意具答诸人诸人因此<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>受持金刚般若经者不少</p><p>开皇十一年。太府寺丞赵文昌身死唯一上愿。家人不敢即敛。然昌遂至阎罗王。问昌曰。从生已来作何福业。昌曰。更无餘功德。唯常诵持金刚般若经。王闻合掌恭敬讚言。善哉受持金刚般若。功德最大不可思议。即语执人曰。汝更勘案勿错将来。不其人实错将来不闻。即语昌曰。可向经藏中取金刚般若经来令一人引。昌西南下至经藏。所见大舍数十餘间甚精丽。其中经满。并金轴宝袟广严妙好华饰不复可言。昌乃一心闭目云。大德最為弟子一经昌怕惧此非般若。求其使人请换不肯。昌即开看乃是金刚般若。将至王所令执人在西。昌在东立诵金刚般若经一遍。并得通利。王即放还约束。昌受持此经实莫废忘。仍令一人引。昌送出门便见周武帝禁在门东房内唤言。汝是我国人也。暂来至此须共语。昌即便见武帝再拜。武帝曰。汝识我以不。昌言。臣昔曾任伏事卫陛下。武帝喜云。卿乃是我故旧也。汝可还家為我向。今帝论说道我诸罪并了。唯有灭<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>事未了当时為卫元嵩谗言不得久禁在。此未知了其。昌问武帝。卫元嵩是<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>外人。非阎罗王所管摄。為此不能追得。汝还家為我从。今帝乞少许功德救拔苦难始敢望了。昌还家更得甦活。已经五日其患渐损。具以此事奏闻。文帝知即為出敕国内诸寺师僧。為周武帝三日持斋行道。转诵金刚般若经。亦录入<a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a></p><p>遂州有一人。贞观元年死经三日得活。说言。初死之时被人遮逐同伴数人至阎罗王所。中有一僧王见先唤。师来一生已来修何功德。师答言。唯诵<a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>。王闻即起合掌讚言。善哉既是受持金刚般若波罗蜜经。当得昇天。何因错将来至此。王言未讫。即见天衣下来引师上天去也。王乃覆坐次问。遂州人汝等从昔已来作何<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。云一生已来所诵经典好习庾信文章诸子集录。近来学诵金刚般若经。犹自未得。王曰大罪人汝见识不。报云。虽读庾信文章实不识面。王即遣示苦人乃见大龟。一身数头。人言此是庚信。龟去少时王言。此人学诵金刚般若。且令放出。来见一人云。我是庚信生存之日。好引诸经用作文章。或生诽谤毁呰经文。今受大罪报向见龟刑。是以甦活。说此因缘。眾人伤悲。悉知是实。其遂州人土地多是移人猎生害命充食。当时知见共相识断除杀害因。得发心悉共受持金刚般若经。信受供人恭敬</p><p>渭州畦彦通一生已来常诵金刚般若。先於李蜜下任武牢县。令為贼破城求觅欲杀。彦通怕急。即踰城东下投涧取死。其涧深峻百丈有餘。从空而下如人扶接不觉到底。乃於盘石安然端坐。良久而起都无损伤。彦通自怪喜惧非常叹息不已。从已来自知大德金刚般若威力。委知经力极大不可思议功德。加心信敬精勤受持不敢轻慢。常获果报得福无量</p><p>鄜州宝室寺僧法藏。戒行精淳。為性质直。隋开皇十三年。於洛交县蔞川城造一所僧房。二十餘间佛堂三口并架塼瓦严丽彩饰精茅。丈六素像总有部部别各有十一事。等身观世音石像一躯千屏风像等。至大业年得寺千。时舍像并令移就州墎伽蓝安置破坏补缺并得成就。更造一切经写得八百餘卷别造长张。於京城月爱寺令人抄写。并檀香為轴<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>妙好。藏至武德二年四月淬患经二旬。乃见一人青衣在高阁上。手把一卷经告言。法师藏作一生已来所造功德悉皆妙好。唯有少互用<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>物得罪未除。我手中者金刚般若最為第一大乘经典。汝自造一卷。所有诸罪悉得除灭。藏闻此教应声答言。若得病差。即发决定心造百部般若。弟子自省一生已来虽修功德实未写金刚般若。诸佛菩萨今见学悟必不<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。弟子唯有三衣瓶恪F?挥壹缡本〗?吨觥4蟮碌茏忧字?迷旖鸶瞻闳簟H?迦漳芷鹨涝讣丛炱刨ゆ渡嵛拦?械谝徊啃雌?2⑸⒏吨钊肆鞔?了小I钪?鸶瞻闳舸蟪司?渫?ψ畲蟛豢伤家槠媲橛性档菹嗳奥食纸鸶瞻闳艟?摺<?窆 ?üΦ挛蘖</p></p></div>"
}]