[{
    "title": "摄大乘论抄 第2806部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>摄大乘论抄</p><p>乃是大乘之副轴。建<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>之胜幢。破异部于当时。□邪正于末代转梵轮于像季。续千载之餘风。致令羊鹿之轮息驾□□之轮更开论其兴也。乃于佛<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后千一百餘年。但以去圣时□□法襄未。群邪映路僻执交途。遂令<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>之理潜隐不通。时有四□菩萨出现于世。号曰阿僧伽。此云无著。亦名无碍。其人内潜□□□法性之际。外应群机而助兴法雨。集二王之胜相。录三性之法印。欲□生及□情于唯识悟非安之实諦。遂依傍大宗制造斯论矣。然菩萨次弟婆藪槃豆。此曰天亲。其人如理之智内融。如量之解秀发。□□□嗟本论辞义渊玄恐后代眾生抱迷不悟。遂即披寻决定要制造释论以解本文。于是破二乘以归一戴。摧异见已同会一心。唯识之道遂尔再通。无性之理于兹重显也</p><p>第二次明藏摄分齐者。然显理□□□乃有尘沙。今且据要而论。对所詮三故教则為三。约所為二故教则為二。言其三者。一曰修多罗。此云綖亦名经。以綖能贯花。经能持纬义用相似。但以此方重于经名不贵綖称。是以翻译家逐其所重故。废綖名存于经目。譬<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>言教能贯穿<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>使不差失令法久住与经綖相似。从譬立名。即詮定教也者毘那耶。此云灭。以身口意恶□烧<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>义同火然。戒能灭之故称灭。此从功能彰目教从所詮亦名為灭。即詮戒行教也三者阿毘达磨。此云无比法亦云对法。欲破<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>□分别法相。无分别慧最為殊胜。更无有法能比此者故曰无比法。此从无他得名。教从所詮亦名无比法。此即詮慧教。若名对法者。即阿毘是能对智。达磨是所对法。即从境用立名。此后二藏皆从所詮得名也。问。若然者。何故下释论云。為说三种修学别立修多罗。為成依戒依心学故立毘那耶。以此文验。应修多罗詮三行。毘那耶詮二行也答。有二义。一相成门。以三学行互相助成。能詮之教亦有兼正。此文即是兼詮助□故云说三。成二宗意為成詮定戒也。為别本末故阿毘达磨不论□□理。理实通有也。二剋性门。修多罗中虽说戒慧。自属毘那耶阿毘达磨。阿毘达磨中虽说心戒。自属餘二藏亦尔。毘婆沙中亦作此二释也。此论即是阿毘达磨藏摄对所為机二者。以根有利钝之殊。于法则有浅深之异。□声闻钝根约分别性立于<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>。為成声闻行法故。判為声闻藏。由声闻所立十一种色。十四不相应四十七心心法。及三无為。此七十五法悉是事法故属分别性也。对菩萨利根通约分别依他真实性立于三藏。為成菩萨行法故。判為菩萨藏。问。经云。為诸缘觉说<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>观法。即缘觉亦有教。何故不立藏。答。依普曜经。三乘教即立三藏。今依此论及地持论。所以不立缘觉藏者。以似佛為说因缘观者。即是似闻他音而得悟道。与声闻同并判入声闻藏摄。唯据上达利根人出在无<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>时无教可闻。宜以思修力故自悟因缘而得<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>。即有行故得立乘。无教可闻故不立藏也。声闻藏内有二。一立性教门。以其人于和合阴内解无神我。于阴等别法计有定性。如说色色<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。心心自性执。三世一切法皆有定性。以未达法空故也二破性教门。此人机根稍利。亦解无神我。知阴等别法缘集故有本无自性。此即分达法空也。此二人观解虽相有浅深。同似闻他音而悟小果故。总对所為判為声闻藏也菩萨藏内有二。一是显示教。此遣分别性内所有诸法。如经说色空乃至涅槃毕竟体空。此即<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>大乘亦名显示教门。二就依他真实说如实因缘如如真实无垢等法。此即缘起大乘自性住乘亦名祕密教门。此二所詮虽相有浅深。同為菩萨利根进成大行而悟大果故。总判為菩萨藏。此论二教中通二教。若说三无性空等即显教。若说初相等即是祕密摄也</p><p>第三次明教下所詮宗旨者。准下文意宗旨有二。一约二諦。二约<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>言二諦者。若论世諦即以唯识為所詮宗旨。若说真諦即以二<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>真如為所詮宗旨。故下释云。一切法以识為相。以真如為体故。又云。知尘无所有是通达真。知唯有识是通达俗也二约性者。论圣人兴教意。正欲显理成行行成得果故。初二胜相即自性住佛性。于中初胜相。若论心功能即是如实因缘。若据实是心真如。故下释云。此即此阿黎耶识界以解為性。此界有五义等也。亦名不空如来藏。地经亦明缘阿黎耶识作第一义諦观即心真如也。何者。是染染依<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。此明心功能与<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>染法為依止。即如实因缘也。第二胜相中。若就相即是三性是前因缘所生果。若据实三性本不有即无三性名空真如亦名空如来藏。故下论云。如取不有故三性成无性也。此空不空二种真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>相所摄。二实体无二故。初二胜相名自性住佛性也。其间六胜相名引出佛性。由行成治障显出自性住理故名引出也。后二胜相名至得果佛性。由得至果位遂前自性住因引出因故名至得果也。圣人兴教意為成此三故。以三种佛性為所詮宗旨也。故下文言。若欲释佛体及<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。其数如此故说次第。故知十胜相是三种佛性也。论能詮教体。即执性宗有二所以。音声性色法為体故彼论云。佛语语情故。二依经本即以名味等不相应法為体。破性宗以二念已去相续似声為体。即法入摄<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>知。大乘宗以似音声性色识為体故。论音声所詮名句味也</p><p>第四次释论之题目所言摄者。帆论摄义有四种。一以文摄文。如以摄大乘论四字為本即摄一部文教皆尽故。下文言。又部当类相摄故名藏也。二以义摄义。如以依止相為本摄一切义皆尽故。下文言。此依止是应知等九义所依藏故言所摄也。三以义摄文。一切文教皆依义施设故。故下论明。由证真如理能摄文及义故名持也。四以文摄义。即此摄大乘论文是也。论文虽简略。总摄诸部大乘所詮之义。為十种胜相聚。此文下此即以文摄义故名摄也言大者有三种。一体大。即目前空不空二种真如平等不增减故也。二相大。即真如体上具恒沙无漏性<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>差别故。名相举一一德皆遍满法界故常故。故名大也。三用大。即此真如在因有任持染净内熏等用。至果有起应化二身无住处涅槃等用。举一一用皆遍法界故常故。所以名大。虽情见有废兴。用恒常也乘者有三种。一理乘。即初二胜相自性住佛性。二行乘。即中六胜相引出佛性。三果乘。即后二胜相至德果佛性。故下释论明。乘有三义。一性。二随。<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>也。三世诸佛菩萨依乘。此法别如来地故名乘也论者有四种。一难论。如中百等。二集义论。如毘曇成实地持等。三释宗论。如法华论<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>论等。四释文论。如智度十地论等。此之四种通名论者。皆假為宾主问答往伏论量道理故名论也。依止者此阿黎识。是一切诸法所依止也。诸依止中此识最胜故名胜相。于此相内有于四品故名中。眾名者依止乃食。眾名在初故名第一也</p><p><a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>不同有其三种一者同相。即佛性之理分為三也。即性理觉照义是佛。轨则义是法。同性宣和是僧义。虽有三义而体是一不异故名同相二别相三宝者。一名宝佛。法身用真常<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>為体。报身修成五阴為体。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>即以化用五阴為体。理教行果等名法。菩萨声僧等為僧也三住持三宝。即取佛形像等為佛。纸素等文字為法。阿难<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>等及凡夫<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>以為僧体。若阿难迦叶等形像等僧及佛法并用四尘為体。若取凡夫僧以有漏五阴為体</p><p>三藏义二门分别修多罗此云綖。以能连持诸法相故毘那耶名灭。灭身口业非故。此二并从义用受名阿毘达磨者有二。一云无比法。即从相形胜义為名。二名对治法。以所观之法所得之法是所对。智為能对。此即从心境合目通名。藏者从义立名二明体者。三藏同以音声色识為体</p><p>二藏义二门分别。一名。一者菩萨。二声闻。教上根之徒行二利之行教名菩萨藏。為下根之人行自利行自利教名声闻二明体。虽就人立二不同。论体同前三藏</p><p>立藏九因。因名所以之义有三对三一就障分三。初爱分障。唯是修式。二<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。即身口意三不善。即苦乐二边因之而起。三自见取障。即以诸见為通首取迷理十使也。二体。初后二体以意為性。中间一种通三业為体第二三者。具詮三学说修多罗。本末通詮故。又修多是教。三学三门并依教生故作是说。毘那耶成二。以依戒生定故作是说。阿毘达唯慧。以是未知但言慧也第三三者法义。宣<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>义因果是修多罗。以此藏宣说语言故。成就法义毘那耶。由于持犯无疑所以故成因果法义也。法义胜智由阿毘达磨。以此藏生智胜故能了法义也</p><p>无悔义十法二门分别。一持戒。二无悔。三心安。四得喜。五问猗。六乐。七定。八见如实。九厌离。十<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>二体性者。是中前六中。初一是持戒為因。后五是戒果。同是戒学摄。并是定因。第七是定果。即慧因。第八是慧果。第九是慧用。第十是三学所问果。若就三业出体。初一通三业。中八唯以心為体。后一以无為為体。若三学。前六是戒。中一是定。次二是慧。后一是前三所得果无為也</p><p>三藏通用五义三分别门。一名。二体。三住地一名者。谓熏.觉.寂.通.解脱。熏者由闻思习之不已熏识成种。即从譬為名。觉者由<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>力故能觉察真理故名觉。寂者远离能所之执名寂。通者若有能所之执即不通。由无能所故平等故通也。解脱者若不通真理可不解脱。由达理故得解脱也。后四并修慧胜用之美立名二体者。熏之一种用闻思為性。中三用修慧為体。后之一种用无為為体三位者。若通一一位皆有此五义。若别而言之。熏在地前。觉在初地。寂在二地至七地。通在八地至十地解脱在佛地</p><p>别用四义修多罗四义二门分别名体名者。一依。处人用為教所依故。二相。谓真俗等相日相形彼此等。三法。即诸法自性故名法也。四义。即义用之义故名义也二体者。依体即以色以及后智胜用之德為体。相者用一切诸法真俗為性。法者用阴等诸法以之為体也。义者即用教法為性。由依此法能生道灭戒故</p><p>五阴义二门分别。一阴名。二体一名有通名别名。五阴者。五是数。阴者积聚。以解阴即从数义為名。别者谓色受想行识。形碍以解色。领纳以明受。取相相是想。行是起作為义。识了别是识。并义果受称也二体。色阴以色识為性。中三阴以随用以心法為性。行中亦可不是心身口业等。识阴通取六七八等為识阴体</p><p>十八界二门分别。一名。二体名者。分前色作五根五尘及无作色。用前三阴作法界。用前识阴作界即六识界。六尘谓色声香味等。六根谓明眼界耳鼻舌界身界意界。六识名同根二体。同阴不须分别</p><p>十二入名体谓六尘此十法是识入处名入处名入。从义為名也体者。与阴不异也。但约义為入也</p><p>四諦义二门分别。一名。二体通名諦即实故。故名諦。名者。谓苦集灭道。苦者逼迫為义。集者招感為义。此二过义受名。灭者能灭三毒火故名灭。道者能生為义。此二从功用為名二体者有二。一就相。出体相。即用苦<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>等理為苦。因等理為集。道如等理為道。灭正等理為灭。此就相出。二就实。若大乘即一味真如為苦实。乃至為道体实。即经云。有实即无作四諦也</p><p>次明定义二门分别。一名。二体名者。谓初禪地二禪地三禪地四禪地。禪者名思惟修亦名功德<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>。二体。四禪有十八支。即已之為体。禪支有十八。初禪有五。觉观為治。喜乐為利益。一心為定体二禪有四支。内净喜乐一心。内净是治。中二是利益。后一心是定体。三禪有五支。行捨净念安慧。捨念慧是治。乐是利益。一心是体。乐一心。四禪有四支。捨念不苦不乐一心捨念是治。不苦不乐是利益。一心是定体二体者。以九法為。谓觉观受猗定行捨念慧。受分為四。猗分二。即初二禪中乐行捨及念各分為二。定分四。餘四不分</p><p>四无色义名体名者。一空处。二识处。三无所有处。并从方便行相立名。四于方便中作空识等解而修故。四非想非处。从相形过义立名。形下名无想。就实犹有细想是过也二体者。以四阴心為体。但上下别不立支者。以是苦道故。乐道者立支。苦道不立支。四禪边亦尔</p><p>十一切入义名体名者。地水火风青黄赤白空处识。此等十法各遍一切无有间故名遍。入為识缘故名入。通名即从数及义為名也。别名即从境為名也二体者。小乘中前八以无会善根為性。眷属四阴五阴也。空识以四阴為体。大乘同以唯识无尘智為体。或以意言唯识為体也。三智分别但加行智也</p><p>无挣<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>二种分别名体名者。无挣者以五因来将护眾生不生烦恼不与他挣。即从无过立名也二体者。明诸佛菩萨以如量智大悲心将护眾生。用此如量智為体也。小乘以等智為体。成论唯圣得故。以名用无漏智定為体</p><p>阿毘达磨四义二名体一对二数三伏四解。对者。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>涅槃是所对。智是能对。即从相形之义立名。数者。明说一法重重显之。伏者。能伏诸说名伏。解者。由此教令前二藏法相明了可见名解。此三从功能胜义立名二体者。唯取论教為体。虽就所詮明于四义。但言取教有此胜用即同教出体。若取所生用体即以闻慧為体</p><p>九种方便。出如实论。以五分论伏破。即立义等五。以四方便难彼义。于彼立有二方便。一检具五分不。二设具五分复离三过不。即相违不实不定。若具三过不须破自坏也。二检彼难亦须二方便。一检难具五分不。二须识彼退意。但彼难者耻受屈。不自受屈言。且休更待后论。即令言下受伏。若不识彼语而為解说。即自无知為是须识彼退意</p><p>八方便义有二。一名。二体名者。五分论即五。一立义。二引证。三譬。四合譬。五结。三方便者。相违不实不定。以五分伏破。以三方便伏彼破。以三方便伏彼立也若论体。虽约教新但取闻思二慧以之為体。若就教即以识声為性也</p><p>五篇二门名体一名者。波罗夷此云极恶。即从重过立名。二僧伽婆尸沙此云僧残。坏僧行不具即从所坏及过受名。三名波逸提此云堕。即从果為名(由犯此必堕恶道故)四名提舍尼此云向彼悔。即从对治方便立名也。五名戒叉加罗尼此云应当学。即从能防行立名。通名篇者。以罪类均等者立之一处名篇。即从义受名二体者。同用身口意作无作业為体。若别身口作无作用色為体。意业用思為体七聚者。更加恶作恶说聚。加偷兰遮聚。此云大障道得名者。恶作恶说者。即以身所作名恶作。口所说名恶说也。大障道若犯此必障圣道故名大障道。并从过為名体性与五篇同以身口意已之為体</p><p>缘起四因义名体名。一无知。由自无明解之智。即无他立名。二放逸。咨心神名放逸。过立名。三烦恼炽盛。由或增上不觉生染犯戒违道。四轻慢。由心轻戒不生敬重故犯佛戒。并从过立名二体性者。无知即无明使。放逸即贪使。由贪故放逸。烦恼炽盛即通贪嗔二惑及缠垢一切惑。轻慢唯是慢使。若三聚中出体唯是心</p><p>八种造业具。一名二体名者。三业中由一不由二有三。由二不由一有三。具三业有一。不由三业有一。由一有三者。一由心不由身口。二由身不由心口。三由口不由身心。由二有三者。由心身不由口。由身口不由心。由心口不由身。七由身口心具犯。不由心口身而犯有二义。一者方便复悔过前使人罪成取罪成时故能教者得罪。不由三也。二<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>狂外国女人亦尔。初时不解未犯。后犯时复无三业也体者。身口二以色识為体。心以意识為性</p><p>毘那耶四二名体名者。一罪过。从过受名。二缘起。则犯戒之缘。从义立名。三还净。明戒还同昔净。四出离。明于罪得出也。此二并从离过受名体者。罪过如五篇七聚中辨。缘起如或四或八中说。还净出离即以方便中身口意善业為体</p><p>出离有七事一各发路遮相读。从义為名。二受与学罚。即从义方便立名。三先制复开。四更捨。五转依比丘<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。六如实观。七法尔。并从义為名也二体。各发路用心口二业為性。亦可三业為体。二受与学罚即以身口意三业為性。三先制后开以色识為体。四更捨与先制同。五转依唯约色。即以色為体。六如实观即如苦无常无我涅槃寂灭四法印為体。苦无常是有為。无我涅槃寂灭是无為。七法尔即以四真諦為体。大乘即以法空之理為四諦体。小乘名有作。大乘名无作。此中但取有作四諦也</p><p>毘那耶复四义名体一人。即从数似者為名。二立制。已说过失立非梵行戒。已说訶欲等过失。三分别。已略立制更广释。即比丘者著搪截衣。四决判明持犯等相。此三并从义為名。二体者。总以二法為体。明人无体还用五阴实法為性。后三以色识法為体。以是音声性故</p><p>十胜相名体名者。一应知依止。二应知。此二从境及劝辞為名。三应知入。从境智及劝辞為名。四入因果。从所成智及能成行住立名。五入因果修差别。因果是行。修是方便。差别是位。从行及能修方便位义立名。三学相者。戒等是行。体依之与。学是心功能。即从行及心功能為名。九学果寂灭相学是因。果是位。寂是义。即从因位义立名。十智差别。智是体。差别是义。从体义受名。通名胜相。胜小乘等即于形胜义立名二体者。初相以梨耶為体。二以三性。三以唯识无分别智。四以<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>行為体。五以十地為性。六以三聚戒行為体。七四定為体。八三智為体。九以无住处涅槃為体。十以三身為体</p><p>圣教胜五种有二名体一正说非方便不同半教。第二破小乘僻执以正对破不了也。第三大乘有小乘无。第四是大<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>因。第五会眾生得一切智体者。前二用大乘教法為体。即后三即十义為体</p><p>三次第义名体名者一境有次第。作缘生识名境。二正行次第。行不倒故名之正行。三果有次第。起遂前因名之為果。此三并义為名二体者。与前十相体同。以前二相是境。即先有后空。中六是行。即先劣后胜。后二相是果。即先法后人。以明次也</p><p>四道理名体。出如实论中。一因果道理。初相是通因。第二相是通果。中六是别因。后二是别果。与此通别因果不违。二相待道理。即因果相待大小相待也。三证成道理。即十义以相证成也。如无生成灭等逆顺相证也。亦可此中十义与菩提因果不相违。故证智成十义唯显也。即是立义等五分论义也。四法如道理。若一切法智如是法如。若别别有体则非法如道理即有三。一无我如。二无常如。三寂静如二体者。前三道理即用十相為体。但约义分三。第四以通理為性。即法空真如是</p><p>三量名体名。一<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>。凡圣所知事非过未名现量。即量度从事时义為名。二教量。即教受之义。三比量。比即比度亦是义。此一从义為名二体者。若现量即凡圣所知诸法為体。即真俗也。教量即用大乘教為体。即是色识為性。比量即用加行智寻思如实等智為体也。若能用三量四道理智即唯思慧智為性</p><p>五种藏义体名一体类义。体者是实类之言流类也。一切眾生取体虽多。然识不异从体义立名。二因义因者即由缘与他也。行法為缘。三生义。生者即是能生长。二从功能义立名。但因取与因作因。生则就果也。四真实义。明此识在世不破出世不尽。此就相形胜义立名。五藏义。明此识体聚积恒沙功德。从胜义立名二体者。同用本觉解心如来藏以之為性</p><p>四种差别义名体名者。一生死因。即烦恼业。二者报道。即以似色心為体。三涅槃因。即用八修正行為体。四涅槃果。即取三身四种涅槃為体</p><p>五种不净品。一者邪师。即取外道拟五阴及方便五阴為体。二者邪<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。同前。三邪戒。用善不善三业為性。四邪定。八禪定為体。五邪慧。用善不善邪思慧意业為体。此法无文。别出名相传出</p><p>二取名体一者色根习气。用根种子為体。二者色相习气。用色尘种子為体。解者用色心二种习气為二种取体。深密经云。一者谓依色心根取。二者依于不分别言语戏论薰习而取</p><p>二种意名体一能与彼生依止。即取次第灭及本识意為体。亦名不染污意。二名染污意。以恒与四惑相应相故。即从过立。即第七识以為体</p><p>四惑名体一身见。积聚名身。对境明白名见。从假及义為名。二我慢。我是境。慢是心。三我爱。此二从心境為名。四无明。对治明故名无明。从过為名二体。同用第七心為体。随义分四使亦可四数也</p><p><a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>义二名体名者。一欲界。欲者即是淫欲及段食欲。界是生性之义。三<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。色即胜色报等欲即<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>也。界与前同。此二从因义為名。三<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。断除色欲由无色欲而生名无色界。从所无立名也二体者。若欲色二界即用色业心业<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>五阴及当界欲爱色惑為体。无色界用心业烦恼及四心报為体</p><p>心意识义二名体者一心。种种义。从义為名。二者意。能生他故名意。三识。取尘了别名识。此二功能力用為名二体者。若通而言之。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>皆有此义。若别而言之。七识名以心执我兹长生死故。第八识意能与他生依止故。<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>心正能取尘了别故</p><p>兹长十义名体名者。一增上缘。与他作不障碍名增上缘。二缘缘。与缘作缘名缘缘。三解相。相识体是解性。四共作。能所共成因果也。五染污。用持他染法名染污。六业熏习。持业故名业熏习。七因。与他為依持因。八果。与他為所生果也。九道。就相為五道。十地。就相為三界九地体者。阿梨识功能為体。以取能兹长故报</p><p>滋长三义名体一由此十法令心相续。即本功能自相续滋长缘也。三义记是能重十法即因。二此心能摄持一切法种子。即由本识成此种子即滋长。本记名缘因。三所滋长。即三界果报也二体者有二。若前一用本识為体。后二是能熏法。于中初是色心习气。第二是三界果。即与前三界体同。若依本记。中间一种本识為体。餘二能熏法為体</p><p>增壹中四种识名体名者。喜乐.爱.习.著阿梨。此等喜乐爱并是能熏。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>就不了教相以能熏从所熏说也。体与前不异。若取所从。喜乐等体者即喜乐爱著。此三贪习气為体。若习阿梨耶已通贪嗔痴等习气為体也</p><p>二爱名体一有爱。缘有生爱名有爱。二无有爱。缘报断生爱名无有爱。并从心境為名二体者。用心习气以為体。即人<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>也。通见修</p><p>四倒二名体一不净净倒。三十六物秽恶名不净。即过净者望计以為妙。非净计净名倒。二苦计為乐。三界皆為三苦所切名苦。以爱少苦记之為乐。三无常常倒。生灭无常计不生灭名常。四无我我倒。不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故名无我。妄计自在有其神主名我。倒者皆解与境违名倒。并从过义立名二体。用二见半為体。即身见取则乐得。断见即边见之半。即无常常息也</p><p>四爱名体一饮食。二衣服。三住处。四有无有爱。并从心境為名体者。同以爱心习气為体四种希有无正文出</p><p>别义有三。一别意。如来本说阿梨耶意為显功德不欲说此义。二别名。但说名不说识义。三别义。大乘微细境别彼苦等智也</p><p>三相名体一自相。自是别他之名。即相形受名。二因相。因是功能。与他作因故。即功能立号。三果相。果酬他能熏法起名之為果。即从果义立目。相者即事相。事相為相。即从义為名体者。若通同以本<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>功能為体。别而语。因取持他生他等义為体。果取从他生边為果体自相取前因果即為自相体也</p><p>三时义二名体名者。一方便时。非正為作业為是正前缘分名方便时。二正作时。正作业根本名正。為正作时。三作后庆快名作后时。并相形受号二体者。若三时同于一事者。若是善即善。恶无记即用恶无记。三业為体。亦即身口心也。若前后不共成一者。此即不定随前事说</p><p>自作等三业义名体一名者。一自作。自相形之名作。运动之义。即从相形及义為名。二教他作。教即是缘。他即相形是义。从相形及义為名。三<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>作。识逐他<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>等事。名之為随。情生适悦為喜。一向从心為名二体者。若自作教他通而言之。用身口意三业為性。若随喜作唯是意业為性。亦得通身口二业</p><p>三缘生名体名者。一自性缘生。自之言体。性之因。亦可是不改為义。缘是因义。生是果。从体因及果义為名。二爱非爱。善报顺情名爱。恶报违情名非爱。从义為名。三受用。即识能纳境名取尘名用。从心功能為名体者。自性以阿梨為体。爱非爱通方便果报五阴為体。受用六识為体</p><p>二种生身名体一善道生身。恶道生身。善恶是因。道是通生之义。报果名生身。以依止為义从因果及义為名。体与爱非爱同</p><p>三业名体名者。一罪业。三途苦果名之為罪。从过為名。二福业。业体善巧能生于乐果名福。从义用為名。三不动业。所得果于地于趣不可动。如欲界恶业得于人天业于恶道受故不名定故。从用為名二体者。罪业用身口意為体。福用欲界善身口意三业為体。不动业用与同时定意思及身口七支定共无作业為体也</p><p>十二因缘义二名体一无明。从无他立名。二行。起作后果名行。三识。了别名识。此二从用立名。四名色。名通一切心法。色即似色等。从义及体立名。五六入。六是数。入是义。以通心入出故。从数义受名。六触。即心触尘也。七受。纳取前境名受。亦是用也。八爱。染心著境名爱。即义名。此三从义用為名。九取。由前爱心更增上发业名取。从义用為名。十有。即见在业能得当果名有。从果為名。十一生。即新诸根起名之生即果。从果為名。十二老死。诸根衰变名老。<a href=\"/remen/shenshi.html\" class=\"keylink\" target=\"_blank\">神识</a>迁谢名死。从过立名二体者。总用烦恼业报為性。于中差别者。前缘起中。无明是烦恼。行是业。识等五是报。后缘起中。爱取是烦恼。有是业。生老死是报。若总而言之。无明爱取是烦恼。行有是业。餘七是报。时分别皆通五阴。以中阴入识支中也</p><p>三道义即烦恼道。沾污净心名為烦恼。以能生业故名道。从过及用為名。二业道。造作名业。能生报故名道。三报道。酬遂前因名报。能生烦恼及业名道。从义及用為名二体者。烦恼用心习气為体。业用身口意三业為性。报用五阴為体</p><p>迷等三惑义名者一无知。即凡夫由无明故名无知。即无他受名。二疑知。即疑当体為名。三颠倒知。违返正义名颠倒。心决执名知。从义用為名体者。无知即四钝使。疑即疑使。颠倒即五邪见。总十使。亦可是凡夫菩萨二乘等三人</p><p>二种见。一不平等见。四见是边中常见我见戒取见见取。常见為本二不平等不会因果正道理故。从过义立名。亦可外道因即定因不可為果。果即定果不可為因。故非平等。二无因。即是邪见也。执无之心坏正因理名无因。即从所无立名</p><p>僧佉二十五諦约五义分别。一由别有总。别是变异。总是自性。二由末有本。变异是末。自性是本。末中有贪瞋痴即知自性亦有。三由事有能。事是事。能用。能作万物。由能有体故能如此。体即自性。四因果差别。因是自性。果即变果也。五由三有无分别。由变异入自性故无分别也二十五諦。自性是本。从自性生智。从智生我慢。我慢生五唯量。五唯量成五大。五大成十一根。五唯量即五尘。五大即四大加空。十一根等五根上加手足口大便男女随一并心平根。加我知即為二十五也</p><p>六执名体名。一计自性。自之言体。性言因。即体用為名。二宿作。事谢于往名之為宿。宿能得报名作。从义用為名。三自在变化。自在者报法。随心名自在。改易色形名变。无而忽有名化。即从胜用為名。四八自在我。作用无碍名自在。自在之者因我。即体义為名。五无因。邪心缘于坏事名之為无。因者即所无之因也。即从心行及无為名。六执我作者受。我者是心。计是神主之体。作者即我能作因。受者受即受者即我能也。从体及用為名二体者。自性以常见即边见少分我见戒取為性。宿作少分邪见。亦可见戒取见為性。自在有常见有戒取亦有见取。八自在我以我见及戒取见為体。因是邪见為体。我作者受以邪见我见边见戒取见四见為体。总而言五见為体</p><p>二十五諦。此是僧佉取加毘罗仙人义。从定起作此执。此是色界地中烦恼之心。八万劫外不觉名之為冥。即迷无明唤之為冥。从冥生大即以业為大。受生之无名大。百论名觉。觉生慢慢是中阴。阴两间生识。百论名我心。从我生二即色心。色有二十一。五尘五大五根五业加心平等為二十一。心法有三。染麤黑。通前二十四。觉与我心為二十六。男女二根一人不并故言二十五也</p><p>八自在名体一于细最细。二于大最大。三遍至。四随意。五无繫属。六变化。七常无变异。八清净无忧体同以我為体。就能分八也</p><p>二种子名体名者。一外种子。体非情道名外。从义為名。二内种子。体是情道之心名内。从义為名。通名种子。从义用為名体者。内用色心习气為体。亦可业烦恼报為性。外种用色等四尘為体</p><p>生引二因义名体名者。一生因。亲能辨果名生。所生是果名生。能生名因。从功能及果為名。二引因。餘世力持名引。并从功能為名二体者。若内生引因业种子為性但取令报未有令有是生。尽后不坏由业引也故论云。种子有二能。一能生。二能引。若外种子用色形四尘為体</p><p>三差别。一依止。眼等诸根各别各别不同。发识名依止。从义及功能為名。二各别缘尘。诸识取尘各别异生识名尘。从义為名。三别觉观别想。并是作意不同也。觉观前方便作意。别想是对尘取相差别作意也。并从义用為名</p><p>四缘名义名体一者因缘。亲能得果名因。用因為缘故名因缘。从功用及义為名。二增上缘。用增上法為缘名增上缘。三次第缘。前心与后次第法為因名次第缘。从果為名。四缘缘。所生是心法。与缘為缘名缘缘。故受二缘之名。从义為名体者。因缘用本识中种子上心同性法亲生法為因缘也。亦可但取种子也。次第缘通色心二法為体。增上缘通一切法也。唯除自己。缘缘亦尔也</p><p>二增上名体名者。一不相离增上。用同时生法故。从义為名。二但有。即是相待之义為名二体者。色心等一切法為体。如似无明生行有二力苦等是不相离<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>但有也。如无明相望既尔。餘法亦尔</p><p>三种道理一净留。二不净品。三顺道理。从戒业而生。体是有流名不净。从过為名。体是无流及有流八定名净。从离过為名。若立阿梨耶即顺灭定等道理。从义為名体者。若取约三以立义理者。即因闻思智為体。若所约法者。不净品用烦恼业报為体。净品以世出世<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>三慧為体。顺道理以有為无為法為体。以若取灭定以无為為体。若因果以有為為体</p><p>大小惑义名体一大惑。二小惑。大小是相形惑是过。从义及过為名二体者。大惑以十使為体。以具五义故。小惑以缠垢為体。不具五义故</p><p>本识三义异六七识一执持无废。以取持报边无一念间故而不持。二通摄持诸根。明此识不扁持一根。三体是果报无记。能与果為依持体故。故并从义功能為名体是本识无别</p><p>四食名体名者。一段食。从相為名。二触食。触对诸尘故。三思食。以有所思求故。此二从功用為名。四识食。以是<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>故名识。从体用為名。通名食者。从功能為名。以能成生故二体者。段以似色识為体。触以六识為体。思以业思求食思以意识為体。食以阿梨耶為体</p><p>受生四义名体一以染污為根。用中阴意识為体。二散动亦意识為体。前取三性别。今约定散别。三有餘用罪福不动三业為性。四果报為体。是阿梨耶识為报作体故</p><p>色界欲界法有四种不同名体一麤细。欲界心无定故麤。色界有定故细。二动静异。三自性修异。四繫缚出离异。并从功能及相形為名二体者。欲界以闻思慧為性。色界以闻思修為体</p><p><a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>二因义名体一从他闻。从义及境為名。二自正思惟。从义心功能為名二体者。以闻思為体</p><p>出世中问。论主出世心从来不生。云何得成出世种子答。有二因缘故成。不同彼宗也。一者增上缘。明此大乘教乃从最清净法界所流。故知增上缘不同彼故得使成出世。明小乘中不知教从本性出。是以不同。二因缘不同。明小乘中立三世性有。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>诸行不成出世因。从彼教亦不生。若思我大乘立义。乃至凡夫身中人天十善亦能作因生闻熏习问。若世间心习出世法可得以生出世法。如十善等本不习作出世解。云何能出世也答。有二义故此得生出世法。一者此十善缘何法故。乃由如来藏力使之而生。由缘处不别所以能生出世法也二者如来立此十善之教意。欲生眾生出世法。由此二种义故。所以能生出世法也。故论云。一切所行之善无非大净清方便也。小乘法亦尔</p><p>信等四法名。一信乐大乘信。是求乐是乐欲。大乘是境。从心境為名。二<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>。三<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>器三昧。虚空器是境。三昧是定。从境体為名。四大悲。二四从功能為名二体。信即用闻慧心為体。般若即用无我知為体。虚空三昧用三无性定為体。大悲即用大悲事定為体。约智即加行智</p><p><a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>仪名体名者。一净德。断除鄙恶名之為净得。即离过為名。二我。自在名我。从用為名。三乐自体寂泊名之為乐。亦可适悦為乐。从义用立名。四常。体无住灭名常。亦可四种。皆从离过為名体者。通而言之。同阿黎解性為体。亦可用法身為性</p><p>五分法身名体戒身。防非為戒。定身。止乱為定。慧身。照察為慧。此三从用為名。解脱。从离过受名。知见身。可境生心名知。明白名见。从义用受名体者。若通而言。则用无分别智為体若别而為论。戒以<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>為体。四定体无分别智為体。解脱则戒定等边见无或无為為体。知见身以后智為体</p><p>出世中三慧义名体名。一者闻慧。闻者即耳识眾缘取得前声名闻。慧者则意识分别名之為慧。二思慧。静心諦察名之為思。三修慧。增明义是修义。修慧非闻思。由闻等生故名修。闻等慧即是并从因為名二体。三慧不同。皆以意识心中随用慧数已之為性</p><p>解脱分等三善二名体名者。一解脱分。解脱是果。分是因。与果為因分故。二通达分。通达是见理之心即是果。用分不异前。此二从果及因义立名。三通达品。通达者证见于理不见能所名為通达。即功能之义。品者品别。则功能之义立名也二体者。若前二正体唯取闻思二慧以為体性。前是闻。后是思。亦通思修二慧為性也。即是意业。若通前后眷属。则通身口意三业以之為性。若正取通达。则唯修慧亦唯意业為体。若取出世心已去。即通身口意三业為体</p><p>闻有三义名体一闻资粮。由音声名味句等资成闻慧及耳识。从义用果為名。二闻体。闻是用。体即义。从义及用為名。三闻果。谓闻慧及闻所了法门并由闻而成。果是义。即因受名二体。闻资粮用音声色识為体。闻体用取识為体。闻果用意识及所缘法门等為体</p><p>四种对治二名者依释论出。一除灭对治。除之与灭即闻思伏惑之力。二远离对治。远离由闻思使障远离也。此二从能治功用立名。三杇坏对治。杇即闻思力使业无有力用名杇坏。从义立名亦可同。四依摄对治。依即行者心功能。摄即佛菩萨大悲心。即从能所受名。通对治从道功能立名二体者。若论初所治见报烦恼业。第二生报。第三后报烦恼业。第四取八难中佛前佛后世智辩聪生盲等及北方长寿天等难為体。若取能治同用十信已上闻思為性亦可通修慧</p><p>多闻四义名体二一多闻因。谓用<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>為体二多闻依止。即善知识佛菩萨五阴為体。三多闻清净。即六波罗行為体。四多闻果。即根本智后得二智為体</p><p>于灭定中灭心定有心。依<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>中。明灭心定中有心者。是婆须蜜多罗立此义。瞿沙论师以三和生触等难之。彼引阿罗汉受不生爱為例也。又依婆沙云。问。入彼定时。徐心数法尽灭。何故世尊但说灭受想定耶。答。譬喻者说。灭定中有心。彼作是说。入彼定时。唯此二法灭故。定是心不相应行。名灭受想定。身作蹬得成就定者四大不动故名定。问。定与灭何别。答。灭一剎那定是久相续。问。何故但名灭受想定。答。心之数中有二种根非根。说受已说根者。说想已说非根性者</p><p>二<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>定义二名体名者。一无想定。即从无过立名。二灭心定。灭即定之功力名灭。定是不动义。即从用及义為名二体者。大乘无定文出。以义论之。用菩萨无漏慧求故。即是慧数心不生故名為数灭。无為為定体也。无想定亦為凡夫心所求故。亦用此非数灭。无為体更须问之</p><p>十过失名义一定义。不立心令定不成也。二解相及境生过。立心则有心境缘尘生过失也。三与善根相应过。立心必有无贪等善根生与心相应过。四恶无记不相应故过。若是心不可立恶无记地法无故。五想及受生过故。若定有心法有受想生起过也。六三和生触过故。若定有心即须有根有尘三法合故即生触也。七灭想不灭受过。违圣说灭想受定以佛说想受俱无故。八作意信等生过。若立有心信等则相随起定故。九以能离所过。若立心不许有想受则违能所不相离过。十立并不齐过。以出入息非身一切行。例心法受想是心王一切行。此义不例故</p><p>二种解相名体一有分别者。心有胜功能名之為有。有之力用名為分别。从义用為名。二无分别。力用轻微名為无。所无之法名為分别。从无他為名体者。无分别即是六识為体。有分别唯用意识為体</p><p>四种无记名体。是正量部义名者。一有覆无记。体是惑性。覆没圣道名有覆。从过立名。二无覆无记。即非是惑性。不覆圣道名无覆。从无过立名也。三自性无记。自是简他之名。性之言体。从及相形為名。自性中分四。谓报生威仪变化功巧。四真实无记。体非有為生灭名真实。从义為名。名无记者。不记善恶名无记。又不能记苦乐等果。从义為名体。第一用七识為性。上二界惑意识亦是。第二无记用本识為体。第三用果报等四无记為体。第四用无為為体</p><p>二种名名体一言说名。从体為名。二思惟名。思惟是心之力用。从功用為名二体有二所以。一者同以音声為性。以论云同以音声為本故。问。如思惟云何是声。答。是意分别名意故亦名声。二者今言声是本者不是体义。乃是因义。言说正以声為体。思惟以心為体。问。若尔何故云同以声為本。答。言是本者。思惟之名。因言而有意地方始分别故言為本也。又问。若尔七识云何。答。七识有助他意识义。意识亦有成七识力。若不尔者。七识不得治七识。既有治义。明知亦有资义。以有资故有远心音声為本也</p><p>色心次第生。是正量部义。立前色生后色次第缘。心亦尔。彼计為因缘。今破不许有次第缘也</p><p>十一种相根名体名者。一共相。山河等是眾所共用名共相。二不共相。内报情道各自不与他共名不共相。三有受受者。是情道觉受。四不受体。非情道无觉名不受。五麤重相。于理事法中心功能名麤重。六细轻。于理事中心有功能名细轻。七有受相。业法得报即尽名有受。八不受。或法得报更增名不受。九譬喻相。比类名譬。以近况深名喻。十具相惑法未為治损名為具相。十一不具相。惑法為道所损名不具相。二体者有通有别。先通者。此十一相中。一一皆用意為即体。本识為依持体十一识悉皆如此。二约别者。相虽十一。约之為五。前之四相。共相无受生。此二用山河大地等依报及此种子等為即体。不共相有受生用各别内入种子為体。麤重相用一切惑及不善种子等為即体。细轻相用有流信等為体。有受用业报等為体。不受相用一切惑為体。譬喻相用执意二识四倒為体。问。何意立譬喻相识。答。前不受相从名言熏习生。未明惑中意报二识本末。所以為此故来也。具相不具相。用静地惑為不具相。用欲界一切惑為具相体</p><p>二结名体一麤重结。惑体妄心而起。名之為麤。结缚為义。从过受名。二相结。所取名相繫缚名结。从境义及过為名体者即用心惑及皮惑為体。相用心惑為性。麤重用皮惑為体</p><p>皮等三惑名体名者。一皮惑。二肉惑。三心惑。并从喻及过立名二体。若三聚论体。<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>习為体。若就识出体。皮惑通六识為体。心惑唯意识為体。若肉惑则以意执二识所起惑為体</p><p>四种世间。即见闻觉知。照境名见。耳识随生名闻。鼻舌身三识名觉。意名知体者以六识為体。若就本唯用意识為体。问。七识四中是何。答。四中名知</p><p>第二相三性义名体一依他性。依即本识之能。他即能熏。诸法能所全目。二分别性。识心了境名分别。从义為名。二真实性。体非似故名真。不同依他处故无体名实。即离為名。性者即是性类故名性。从义為名二体者。且约一门出之。依他用第八识為体。分别即用六七识及所取尘习气等為体。真实即用四真实為体。即有垢如及无垢如无垢道十二部教為体</p><p>十一识名体名者。一身识。身是依止之义。亦是聚义。二身者。七识是执身之者。三受者。受纳之受是用。四应受。尘是识境。名应取义名受。五正受。用在当今即相形之义。并从义為名。六世。法有流动名世。又前中后异名世。从时义為名。七数。即法有一二三名数。从义為名。八处。五大等法是正报所依之所名处。从义為名。九言说。声有詮法名言。披陈名说。因為名。十自他差别。自他即相形义。差别于自他有多相不同。即相形及义為名。十一善恶两道。顺益名善。违损名恶。两是数。道是义名。即从用数义受名二体者有通有别。若通而言之。此十一识以六七心境以之為性。若别而论之。则随相而说也。身识用五根為体。身者用七识為体。受者用意界為体。应受六尘為体。正受用六识為体。世数用十八界為体。处用五大為体。即四尘。自他差别内报十八界為体。善恶两道十八界為体</p><p>四识义二门分别二名体名者。一似尘识。明体无所有相似昔心名似。生识曰尘。从识变故名识。从义及体為名也。二似根识。似识同前。增上是根义。从义用為名。三似我识。我者计人有体名我。从彼体义受名。四似识识。识即了别之用。从用為名二体者。以色等六尘识為体。法尘通取六七心变。若约十一识出体别。应受世数处言就识為体。似根识以六根為体。十一识中取身者受者為体。似我识用意执二法為体。十一识中取自他差别為体。似识识用六七识為体。十一识中取正受识及身者取了别义边為体。善恶两道通四识也</p><p>是时三义二门分别。一名。二体名者。一平等时。明心离高下往正平等。离过為名。二和合时。即说听两心相符名和合。从义為名。三转轮时。明如来说法能受眾生八正道与世轮转相似。从法譬為名二体者。总以佛及菩萨后得智大悲心為体</p><p>外执立有色三义一眼识未生先已有色。二识变為色亦是有色。三由了别色心故知有色</p><p>四生二门分别名体名者。一胎生。胎者是始。从时為名。亦可从相為名。二湿生。水之湋渍名之為湿。因而生。从所依為名。三一卵生。是[穀-禾+卵]一卵。从相為名。四化生。诸根顿有名化。生由化有名化生。从义為名。通名生。从种类义立名。亦可从果為名二体者。胎生用欲界五阴為体。湿一卵亦尔。化生三界五阴性。问。无色无色。云何云是化生有五阴耶。答。若依小乘。无无色非四生摄。今依大乘。无色亦有色故具五阴。以瓔珞经无色有化生。是以是化此生通五道也</p><p>四界义名体名者。即三界名体同前已出。第四无流界。流是过。用无流而生名界。从无过及义為名。用菩萨变易五阴為体</p><p>六界二门分别名体名者。地水火风空识。即六大。界之言性亦是因义。从用义為名二体者。前四即触尘摄。即以色识為体。空大用太虚无為為体。从心变约心是有為。小乘一向有為空。识界若亲成唯是意识。若取发助明通取七识。若依持為论通本识。唯取有為有流不取无流。以是三界生故即体如此</p><p>十八界名体名者。六识即眼耳鼻舌身意。并从根為名。六尘通一切法。即色声香味触法。六根即眼耳鼻舌身意二体者。六尘用色识及识為性。意根六识生后皆名意。即通六识。若意门明义。本识七识心皆有生之义悉名根。前五唯色识為体。六识若取本即以意识心為体。以立一意识故不许有别体五识也。随用有六体此无所仿</p><p>十二入名体即六根六烦。以六识入意根中故。即是十二入。生识以解入。根尘皆生故体与十八界同</p><p>五阴亦尔。以五根五尘入色阴中。六识意根入识阴。法尘入分為三阴。此三法义分。性是界。生识解入。积聚是阴义</p><p>三种唯识观义名体名者。一唯量。二唯二。三种种类。言唯量者。唯之言触量即识量。从义為名。言唯二者。二是数。从义及数為名。三种种即境法非一名种种。类是流类。即从义為名。观者即观察之义為名。亦可<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>并从心境為名。以观是心唯量等是境故二体者。三观虽同以闻思修為体。若地前地上加行道中即以闻等三慧為体。正入地即以正证修慧為体</p><p>二无身义名体一无色身。二无生身。色即以碍為义。生即心等起故名生。无是义名。从义及相為名。通名身以依止為义。从功能為名二体者。无色身用因缘色阴為体。前言无者取无实身。无生用因缘四阴為体。言无身亦取无实四阴也</p><p>唯识四智义名体。名者。一知相违识相。知者即菩萨观心。相违识相是境。二由见无境界识。由之言已知是能知之智。无境界识是所观。三由知离功用。由思慧解知即凡。以离功用应成正智名离功用。从能智及义為名也。四由知义随逐三慧。此及前二并从心境為名。亦可从心境及义為名二体者。此四同以思慧解心為性非餘。亦可通用闻慧為体</p><p>十六諦名体名者。苦下有四。即苦无常空无我。苦逼迫為义。迁流不住是无常。空是无所有名空。不自在是无我。空是无他為名。餘三从过為名。集下有四。即因集有缘。因是生方便义。集是集起之义。有即能有当果之名。缘者能与果為缘。并从力用為名。道下有四。即道如迹乘。道以通生為义。為圣人所行名迹。运以解乘。如不异义。三世诸佛此道不异故名如。从义為名。餘三从功能為名。灭有四。即灭止妙离。灭三毒名灭。正则三火止也。妙灭体无戒名妙。从义為名。离是离惑之义。此三无过為名。諦以实為义。从义為名二体者有二。一约事出体。即苦等為苦等体。即是果义。以业烦恼等四法為体。道用无流圣道為体。通色心。灭用事灭无為為体。二约通出者。即本觉心真如以之為体</p><p>五种真实即行体离五种散动说五真实也。又离五识分别亦名五种无分。即以无分别定慧為体。约离障说五也。佛性论中五种无多别。一无為。二无别异。三离二边。四解脱。五自性清净。五种真实。一无二。二过言说。三过觉观。四过一异。五一味清净</p><p>三分别名体名。一自性分别。谓五识。自是别他之名。性亦可是体即性类。即体义為名。二忆持。追缘名忆。忆不忘名持。从用為名。三显示。境非今有显示令有名显示。从用為名体者二义不同。一者小乘。自性是觉数為体。忆已念為体。显示以慧為性。二大乘体者。自性六七识。皆有缘现在并是自性分别。其餘二种唯是意识。缘过去為怀持。分别缘未来為显示分别也</p><p>自言有二。一者诸熏习各异。各从自因生名自。二者诸法实无所有从心生故名自耳。体者用净不净品法為体云何分别但如万物相不如一物相。问意何故意识心本无有心。何不唯一无相乃作如此万物相也</p><p>六因名体名。一境界。法能生心名境界。生义。从义為名。二相貌。明心取境相状。从义為名。三观见。明心快判明了目為观见。从义為名。四缘起。起报之缘名缘起。从方便為名五言说。宣说之声名言。言有所了名说。亦从方便為名。六增益。于三无性理执有人法名增益。从过為名体者。若约识明体即以意识為体。若三惑出体唯心惑為性</p><p>三熏习义名体一名言熏习。声有表詮名之為说从义為名。识熏习了别名识。从用為名。二色识。色即碍义。当体為名。识识。识六识即用。后识即体。体用為名。见识熏习者。明自名见。见体名识得名同前。三烦恼。从过為名。业者。造作名业。从用為名。果报。酬因名果。遂因名报。从义為名二体者。前五以心惑為性。烦恼用皮肉二惑為体。业用三业為性。亦可三聚為性。果报用五阴為体通色以</p><p>依他体类及义名体者体类义有二种。一果报体类。酬因名果。遂因名报。為他依持名体。类即流类。约他诸法非一也。即从所依及功能义用受名。二闻思等体类。得名相同。但世出為别也二体者。虽约能依分二。论体皆以本识一心功体為体二依他义者。明此识虽约体分二。然此二法皆不偏為一心作所缘境。由不偏為一心境故名依他义也</p><p>分别二义二门名体名。一自性分别。知他诸法之体各别不与他共。共心简他之义。性之□体。识缘此境名為分别。即□相□体用為名也。亦可一向□用為名。二分别差别识有了</p></div>"
}]