[{
    "title": "无量大慈教经 第2903部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>无量大慈教经</p><p>有。尔时阿难白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。唯有阐提眾生。难化难育。尔时世尊答。如牛耕田由人所遣。獼猴作舞由人所教。造罪眾生由人所劝。尔时阿难白佛言。世尊。若有眾生药生西方国者。缘我身及向我口眼中不净我亦不辞。佛语阿难。此经大圣若有眾生勤诵此经者。免得三难苦。一难禁囚。二难病人。三难<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。尔时世尊告言。阿难。我為阎浮眾生难化难育故。开此<a href=\"/remen/jingzang.html\" class=\"keylink\" target=\"_blank\">经藏</a>出其殊别。妙经為汝演说。若人现此经者不生清净。当知是人与我无业。一切经典广说妙言。引度眾生。一称我名者。悉闻悉见。随声往救。今身劫剥师僧者死堕寒冰地狱。又生蚕中為他煮剥。如此等以逕八万之劫。餘受畜生身。以逕五百劫。蠢动眾生皆悉作遍。后受人身。[癃-(阿-可)]残盲跛。五百劫中恒受哑报。尔时世尊答言。阿难。行不净行尼僧死堕铁窟中地狱。八万刀轮一时来下。斩截其身。尔时阿难白佛言。如佛思量。此事超越<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。尔时世尊语阿难。饮酒醉乱死堕饮铜地狱中。尔时阿难白佛言。世尊。酒之无命。何故戒之。尔时世尊复语阿难。饮酒醉乱。不识尊亲。我见振旦国有人因酒淫母。破其<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>。是以禁之</p><p>尔时世尊语诸大菩萨等。我从<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>以来。于今五百餘劫。经典披遍。读诵周匝。未闻是言。未闻是说。若有眾生闻此经者。宿种善因。宿种善果。思寻此经。不可思量。不可称尽</p><p>尔时如来语诸菩萨。我说此语。重如太山。眾生闻者轻如微尘。此法难闻亦复难见。佛语阿难。若有眾生闻此经者。心生叹喜。如此之人尽心為说。尔时世尊复语阿难。我见眾生堕落三涂。若将刀割。我身体由斯可忍。我不忍见于眾生受大苦恼。酸悲忍苦。身上演出光明。遍照十方。有我缘者得见我身。无有缘者不见我想尔时阿难白佛言。世尊。如何二种心。一种眾生则有见者。则无见者。尔时如来复语阿难。日月普照。盲者不见。尔时阿难重白。世尊。云何是盲。云何是明</p><p>尔时世尊答言。阿难。修福者是明。不修福者是盲。阿难复白佛言。世尊。修福者不见由何。世尊告阿难。修福不见我身。障闭<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>污埿<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。是以不得见我。佛语菩萨。闻是此经者心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。如子见母远行得归。如飢得食如渴得浆。如此之人尽心為说。佛语阿难。食肉之者喻如群狗。争骨各各贪多见。其猪羊常作杀想见。其臭肉如猫趣鼠。惠心用意。今身信解<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>者。从人中来。今身不信佛者。从畜生中来。造罪不懺悔者。喻如运金填国损其宝物。造罪悔者如病得药还复差。损汗衣水洗还得清净。佛语普广菩萨。用我语者一偈成佛。不信我者喻如海中求针。狂费功力无得见曰。佛语诸菩萨。今身盗他物者。来生与他作痴牛令他苦打。非时苦使受牛身。以遥五百劫与他作奴。任他驱使心。是逃避令被捉得苦刑。印面非理苦持。佛语菩萨。伽蓝中二种心。一者<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。二者恶心。云何為恶人。若有眾生入寺之时。唯从眾僧乞索。或求僧长短或敢德食都无惭愧。饼果菜茹怀狭归家。如此之死堕铁叉地狱。云何名為善人。若有眾生入寺之时。见僧恭敬。见佛<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>懺悔。捨于财物。经营三宝。不惜身命。护持大法。如此之人举足一步。天堂自来受果。如树提伽。提伽则名為最上善人也。佛告大眾。我向所论种种<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。此经一名殊别。二名殊胜。三名菩萨。若有眾生闻此经者。一发善心得生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。佛告菩萨。闻我说者心生叹喜。如旱得水。苗稼苏活。不受我语者如石浸水。无有润时。尔时阿难白佛言。世尊。汝等见振旦国。有人从七岁修福至于百年。临命终时破其五戒。此人得福以不</p><p>尔时世尊复语阿难。喻如轂车。上万里之阪。临头翻车速本。所损何有得期。纵取少多如云影。日斥时之光喻如一口之食。能得久饱。佛语眾生。我等广说<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>共同。成佛普劝眾生。同修净行。一切<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a><a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>阿修罗等。闻佛所说。皆大欢喜作礼而去</p><p>无量大慈教经</p></div>"
}]