[{
    "title": "无量寿观经义记 第2760部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>无量寿观经义记</p><p>佛道。又复虚言得道。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>虽不受<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>人苦恼。于菩萨根钝不能疾<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。不直往菩萨即其义也问。若凡夫生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>者何故摄大乘论判為别时意耶答。此据无行人故云别时意。故论云。由唯发愿于安乐国即得<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>。是名别时意。案无行之人空发于愿。此但為远生之因故云别时意。要<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>相□方得往生问。如凡夫不断欲界惑不得生。上界凡夫无断<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>惑者。何由得生净土答。如凡夫断欲界惑种不尽而得生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。□□伏惑生上界。此亦如是由<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a><a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>观于净土。深伏深厌三界惑。伏修惑麤品故得生净土问。菩萨<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>救苦。眾生何以愿生净土答。菩萨愿生净土為<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诸佛。愿入恶道為救苦。眾生愿生净土為成就<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。愿入恶道為成就眾生。此二行常行不可闕壹。又凡欲救眾生苦恼。先生净土。自然成就佛法。然后以大悲愿力入恶道利益群生。若未成就佛法先入恶道。此则自為苦恼所缚。何由能救眾生故。智度论云。先须自利。然后利他。若自未利先欲利他。如人未善习浮先欲度。彼相与俱没。此亦如是问。若地前菩萨生净土者。何故仁王经解十迴向云。观壹切法无生无住。乃至入第壹义諦心心寂灭而受生三界。何以故。业习<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>未坏尽故。地持论云。种性菩萨或堕恶道。既云受生三界。云何而言生于净土答。此据菩萨大悲為物受生三界由故。业未尽与之相应故言受生三界或堕恶道。今言生净土者。此据自报业成生于净土也自下次释其文依<a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>唯明三品。此中具论九品往生之行既有多种。此但广略為异也。文中九品即為九分。就上品中文為四分。壹标品名。二显行相。三明往生相。四总结。初文可解。行相中言若有眾生者。此即往生人位在十迴向终心。所以尔者以生彼国已即得无生法忍。故发三种心者。于此位中餘行已成。发此三心愿往生也。至诚心者。离虚狂心也。深心者彻于骨髓也。迴向发愿心者。以已所修壹切善根愿往生也。复有三种者。自下别明行相。慈心者修慈三昧。具诸戒<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。持菩萨三聚戒也。读诵大乘者。方等经中明不可思议甚深之法。读诵之者还得不可思议<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故得生净土也。故<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>说。若善男子善女人闻妙法华经净心信敬不生疑惑者。不堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>饿鬼畜生。生十方佛前。莲华化生即其义也<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>六念者。所谓念佛法僧施戒天。念佛法僧為生福德。念施戒為修行。念天者念壹生补处菩萨為生兜率陀天。以此三种善根迴向愿生也。壹日至七日者。明行修时分。七日之中心心相续具前行业即得往生。所以尔者。由业力不可思议故如壹念起心。诽谤大乘从壹劫至壹劫受十方大地狱苦报。经时虽少苦报极多。此亦如是用时虽少善业力大故得生彼国。信哉。业力不可思议须臾之间昇沈各异。是行者深须自诫。岂非大事者哉自下次明往生相。初明宫殿迎接。二明光照其身。三讚其行业。四正明往生。五明生已悟道。如弹指顷往生彼国者。由业力增上故受生速疾。不同人中业力羸劣故多时方得受生。如恶业猛利故剎那即入恶道。此亦如是即悟无生法忍者。初地无生忍也。歷事诸佛者。得胜<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>故能遍游诸佛世界。犹如诸天生已即能飞行<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。此亦如是也。次第受记者。亦名授记。授即授与。彼人受即彼人纳受。依地持论有六事故為如来授。无上<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>记。壹种性未发心。二种性已发心。三现前。四不现前。五时量定。六时量不定。此中所明是现前授记也自下总结可解</p><p>自下次明上品中生。文中有四。壹标品名。二明行相。三明往生相。四总结。此是十解十行已上菩萨以生彼国壹小劫得无生忍故。不必<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>经典者简前异后此人唯修行大乘非读诵之业也。善解义趣者。善能分别大乘深义不坏假名。而说诸法实相也于第壹义心不惊动者。大乘甚深空义诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>中最胜。故曰第壹。凡夫闻说诸法皆空理与情反故生惊怖。菩萨闻之妙达心原不生怖畏也深信<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>者。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>成就如壹念起。邪见谤无因果。则断灭善根求沈<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。今由深信故得生净土也不谤大乘者。大乘之法其理甚深。其文巧妙。三乘<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>同共修学。出生壹切人天果报。出生三乘圣道。若谤此法得罪不可称量。闻之不谤福德亦不可具说。故胜天王<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经云。阎浮提纵广七千由旬。遍满须陀洹斯陀含阿那含阿罗汉辟支佛密如竹麻中无少空及以间缺。若有善男子善女人。四事供养毕圣人寿。或复七宝遍满此洲积至梵天。壹壹圣人各施尔所毕。是善男子善女人寿日夜三十牟尤多相续不断。若善男子善女人不谤此修多罗。功德胜百分不及壹。百千万分不及壹。乃至算数譬喻所不能及。由功德无边故得生净土也自下次明往生相。初明<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>迎接。二讚其功德。三正明往生。四明生已悟道。经于七日于菩提得不退转者。十解已上犹有念退行退。至彼国已离此二退。以无退缘故。犹如天中得果毕竟不退。以无退缘故此亦如是。经壹小劫得无生忍者。证初地无生忍也。若以此方劫数更经无量大劫。今说彼国劫数故云壹小劫也。故<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>云。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>壹劫于安乐世界為壹日壹夜。此之谓也自下总结可解</p><p>自下次明上品下生人。文中有四。壹标品名。二显行相。三明往生相。四总。结初文可解。亦因果者。此是十信位中信根成就故不谤大乘。由信大乘故发无上道心。以此功德迴向愿求生于净土也自下次明往生相。壹明化佛迎接。二讚其功德。三正明往生。四明悟道。七日之中乃得见佛者。由未得无流心故七日方见佛也。经三小劫得百法明门住<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>地者。若以此方劫数经三大阿僧祇劫方至初地。今亦以彼国劫量故经三小劫至初地也。百法明门者。如瓔珞经说。十信有十心所。谓<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>.<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>心.念心.定心.惠心.不退心.迴向心.<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>心.愿心.戒心。此十心中壹壹心复有十心故有百也自下总结可解</p><p>上来明大乘三贤菩萨。為上品三人。自此已下明小乘方便位人。為中品三人。先明中品上生。文中有四。壹标品名。二显行相。三明往生相。四总结。初文可解。若有眾生受持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>者。此明往生人位在暖法顶法。于此位中发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>迴向愿生净土。此通在家<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。此明在家人故云持五戒八戒。修行眾戒者。此明出家人。具受大<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a><a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>故曰修行诸戒也。不造五逆者。此业极重。造此业已次生必入地狱。故不得生净土。依小乘暖位中犹造五逆及断善根。顶位中造五逆不断善根。故今除此业也。迴向愿生<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>者。此人修行至暖顶位。小乘根性未决定。故忽遇善知识发大乘菩提心。以己所修善迴向愿生极乐世界。若至忍位小乘根性已定及得恶道非灭。更不可转求大乘也自下次明往生相。壹明世尊迎接。二讚叹出家。三明正往生。四明生已悟道。讚叹四諦者。闻小乘法也。由行者先习小乘重习力故还闻小乘法也。四諦者。壹者苦諦。以<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>為体。二者集諦。以业惑為体。三者灭諦。以择灭无為為体。四者道諦。以无流圣智為体得阿罗汉者。此是三生利根人故即得无学果也。阿罗汉者。此云无生。亦名应供。三明者。壹<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>明。二天眼明。三漏尽明。小乘宗初二以等智為体。第三以无流智為体。依大乘初二以后得智為体。第三以无分别智為体六通者。壹神足通。二天眼通。三天耳通。四他心通。五宿命通。六漏尽通。依小乘宗神足天眼天耳宿命并以等智為性。他心通五智性。谓道智法智比智等智他心智漏尽通九智性除等智体是无漏故大乘宗前五通后智為体。漏尽通以无分别智為体八<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>者。壹内有色外观色。二内无色外观色。三净解脱。四空处解脱。五识处解脱。六无所有处解脱。七非想非非想解脱。八灭尽解脱。小乘宗初三解脱以无贪善根為体。次四解脱以四為体。灭尽解脱以非色非為体。依大乘十解已上所得前七并以无流惠為体。灭尽解脱初地方得以无分别智為体。以壹切心心数法不行故自下总结可解</p><p>自下次明中品中生。文中有四。壹标品名。二显行相。三明往生相。四总结。若有眾生者。此明修行人位在总别念处。持八戒者是在家人。<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>戒<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。是出家人。威仪无缺者。不犯轻戒也。行者至此位中忽遇大乘善友令发大乘菩提心。迴向愿生净土也。自下次明往生相。壹明世尊迎接。二化声讚叹。三正明往生。四明生已悟道。经于七日得须陀洹者。由前修习小乘观法故得初果。更经半劫方成无学也问。彼国土曰此方七劫。此人先已修解脱分善根。何以七劫方得初果耶答。声闻根性有三种。壹三生。二六十劫。三百劫。此是中根人故经七劫方得也自下总结可解</p><p>自下次明中品下生人。文中有四。壹标品名。二显行相。三明往生相。四总结。若善男子善女人者。此明往生人位在五停心位。<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母者。此是恩田供养者得大果报。行世人善者。人义礼让等。此人<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>忽遇大乘善友為说净土乐事及讚世尊因中大愿。此人闻已迴向愿生也。自下次明往生相。初明往生。次明生已悟道。此人善根劣故不感世尊来迎业力。自生也。过壹小劫方成阿罗汉者。此人初修观行故至彼过劫方得无学果也问。生净土已并修菩萨之道。云何仍得小乘果耶答。诸佛净土品类大多。或有净土无二乘之名。如眾香世界不眴世界等。或有净土。有二乘及人天名。如妙喜世界。或有净土。有二乘无人天。如极乐世界。此人并先于此土修小乘善根。是故生彼国已依本所习得小乘果。虽得小果而不取证。即修<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>不同。此方得果住而不进。令存其本名故名阿罗汉。故无量寿经云。其诸声闻菩萨人天智惠高明神通洞达。咸同壹类形无异状。但因顺餘方故有人天之名。即其义也自下总结可解</p><p>上来明中品三人讫。自下次明下品三人。此并是凡夫中发菩提心人也。先明下品上生。文中有四。壹标品名。二显行相。三明往生。四总结。或有眾生作眾恶业者。此明行相也。此人先发菩提之心忽遇恶缘造十不善业。由恶法增长故心无惭愧也上来明其过失。自下次明其德。谓命欲终时善友為讚大乘经名。及称阿弥陀世尊名号故能除重罪。所以尔者。由如来<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>清净故。称名获福不可思议故能灭于重罪。如壹念起恶诽谤圣人则累劫受苦。今由壹念信心称名故累劫受乐。因果必然為差失也故大品经云。佛告诸天子。若有天子天女命欲终时。汝但為称般若波罗蜜。以闻般若波罗蜜名号故诸天子不生恶道。还生天中大悲经云。若有眾生闻佛名者。我说是人毕定当得入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。若有眾生以念佛故乃至壹华散于空中。如是福德所得果报不可穷尽。若有眾生以至诚心念佛功德乃至壹华散于空中。于未来世当得释天王梵天王转轮圣王。于其<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>亦不能尽。以其善根福报不可尽故要当入般涅槃。何以故。阿难施佛福田不以有為果报所能尽边。我说是人必得涅槃尽涅槃际。阿难乃至壹称佛名壹生信者。所作功德终不虚。设若有净心诸眾生等作是称名南无佛者。阿难彼人以是善根必定涅槃。得近涅槃流注相续入涅槃际。即其义也自下次明往生相。初明化佛迎接。二讚其功德。三正明往生。四明上已悟道。经十小劫得入初地者。此是凡夫故所以生彼经十小劫方得入初地也。得闻佛法僧名即得往生者。复有眾生临命终时闻<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>名即得往生。所以尔者。由宝功德不可思议故。能令闻者得生净土。故大品经云。菩萨摩訶萨以神通力飞到十方诸有无三宝名处。為讚佛法僧功德。眾生闻已生诸佛前。大集经云。若有眾生乃至壹念深信如来。敬仰尊重叹未曾有。以敬信故得作轮王统四天下七宝具足。乃至得作帝释天王魔王娑婆世界主大梵天王。何况常能具信三宝。即其义也</p><p>自下次明下品中生。文有四。壹标品名。二显行相。三明往生相。四总结。或有眾生毁犯五戒者。此明往生人。先显其过。犯五戒八戒是在家人。犯具足戒是出家人。偷僧祇物者。十方<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>僧物也。现前僧物者。壹住处属现在人物也。不净<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>者。乘诸法实相我心中说或為名利。或為胜他皆名不净说法也。地狱猛火壹时俱至者。恶因既成中阴恶相现也。遇善知识為说阿弥陀佛十力者。此明其德也。能摧邪慢故名為力。并以智為体。壹智在十处。名為十力名者。壹是处非处力。二业力。三<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。四根力。五欲力。六性力。七至处道力。八宿命力。九天眼力。十漏尽力。威德者神通息慢名為威德。亦讚<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>解脱解脱知见者。此即如来五分法身。戒身以<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>為体。惠身以壹切智為体。定身以大乘光明三昧等壹切定為体。解脱身以有為解脱无為解脱為体。解脱知见身以后得智為体。自下明说利益。谓闻如来功德除八十亿劫生死之罪。所以尔者。如来名号及功德皆不可得闻。若闻其名获福无量故。观佛三昧经云。念佛功德者。所谓戒定惠解脱解脱知见。金色身三十二相八十随形好。十力四<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。十八不共法。大悲三念处。是若有眾生壹闻<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>如上功德相好光明。亿亿千劫不堕恶道不生邪见。杂恶之处常得正见。勤修不息。但闻佛名获如是福。何况繫念观佛三昧。即其义也自下次明往生相。初明中阴相灭。谓地狱猛火化為凉风。二明化佛来迎。三明往生。四生已获益。此人由业力劣故莲华六劫乃开也自下总结可解</p><p>自下次明下品下生相。文中有四。壹标品名。二显行相。三明往生相。四总结。或有眾生作不善业者。此明行相也。先明其失。五逆者。杀父。害母。杀阿罗汉。出佛身血破和合僧问。无量经云。唯除五逆诽谤<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。何以此中五逆业得生净土耶答。造五逆者。有二种。壹谓此人先发菩提心。中间忽造五逆。后时由<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>佛名故伏灭<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>得生净土。此经据此而论二者。此人先无菩提之心而复造五逆罪。复无念佛功德。此人不生。无量寿经据此而说。下明其德。善友為说妙法者。说大乘法也。闻大乘经能除重罪教令念佛者。念佛功德能除业障也。不遑念佛者。犹无暇也。此人為死苦所逼无暇念佛功德名号也。具足十念者明时分也。十念之业能除重罪生于净土。故智度论云。有人壹生造恶临命终时得生善道。有人壹生造善临命终时生于恶道。此有二义。壹由后报业熟。二由临命终时<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>心数法生问。此人壹生造恶。云何临终壹念心能胜终身行业答。譬如大将壹人能破大敌。临命终心亦尔。如火如毒壹念之心能胜终身。能胜终身行业。以捨诸根事急故。即其义也自下次明往生相。初见莲华。二正明往生。三明已获益。為其广说诸法实相者。此谓大乘之深极。若思能灭重罪故。普贤菩萨观经云。其有眾生思第壹义甚深空法。壹弹指顷除百万亿阿僧祇生死之罪。是名具足<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>者。不须羯磨自然成就。应受壹切人天供养。即其义也自下总结可解</p><p>上来答问示其观相讫。自下第二明时眾获益。夫人先是十迴向菩萨闻佛说净土之相。即得观佛三昧。见极乐世界<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>之相。及得无生忍问。既是十迴向菩萨。云何上文言汝是凡夫心想羸劣耶答。地前菩萨望初地悉名凡夫。以未证法身故也自下明发愿。既闻希有之法复证法身。故发愿生于极乐世界。如<a href=\"/chanzong/gongan/53414.html\" class=\"keylink\" target=\"_blank\">龙树菩萨</a>。在此证欢喜地已发愿往生极乐世界。此亦如是。此经说上品上生正為于此。若言六地菩萨為上品上生者。云何六地菩萨报在秽国发愿生净土耶。地前菩萨结业未尽故生在秽国。所以在此发愿生于净土。斯即文义昉然不劳异释。生彼国已得诸佛现前三昧者。生彼国已得诸根。常见诸佛不假修习。方见故曰现前三昧。侍女诸天既见夫人获证。所以仰学胜流并发菩提心也自下第三次明<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>分。文中有五。初大德阿难请问持法。二如来為立经名。三重讚修益。四时眾欢喜。五如来还归。初二文可解。讚修益中言现身见佛者。此明现在之益。由三昧之力故现身必见佛也。故华严经云。念佛三昧必见佛。念终之后生佛前。此之谓也。下次举劣显胜。但闻佛名二菩萨名除无量罪。何况繫心忆念也。故华严经云。若能须臾念如来。乃至壹念功德力。因此永离三恶趣。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>光明灭痴闇。又云。寧于<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>具受壹切苦。得闻佛名号不于无量劫具受壹切乐不闻佛名号所以无量劫<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>生死苦不闻佛名故即其义也。下次约喻显法。分陀利华者。白莲华也。此华<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>最胜。念佛行者亦尔。于人中最胜也。复由常念诸佛菩萨故二菩萨為其胜友也。下明未来之益。由念佛功德故未来必得菩提坐于道场也。诸佛家者佛家有二种。壹者生家。谓十王报。二者法家。谓真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>身。由行者念佛故随念必生佛家。如人念生天中随愿必得。此亦如是世尊足步虚空还耆闍掘山者。前為入王宫故密现神通赴请。今现行威仪欲令见者。获福如来凡现行时足恒离地四寸而轮相现。故华手经云。佛行时若有眾生触其足者七日受乐。如来右迴身时地深八万四千由旬如轮旋转。大集经云。如来入出城邑村落舍宅足不蹈地。常行千叶莲华之上。若有眾生遇触佛影七日安乐无饮食想捨是身已生于善有。此谓如来现行之益也。下明弘宣之益。如来既在王宫说法。所以不及餘人。尊者阿难别更為眾弘宣。大眾闻之皆欢喜也</p></div>"
}]