[{
    "title": "法句经 第2901部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>法句经</p><p>佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>句经诸菩萨融心觉序品第一</p><p>闻如是。一时婆伽婆。在日月宫中胜藏殿上。与天菩萨摩訶萨十万人俱。其名曰胜积菩萨。普贤菩萨。文殊师利菩萨。金刚藏菩萨。金刚幢菩萨。金刚慧菩萨。<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>。决定慧菩萨。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨。三世辩菩萨。<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>愿菩萨。势力<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>菩萨。无起作菩萨。常慈菩萨。常视一相光菩萨。如是等菩萨摩訶萨十万人俱。复有菩萨摩訶萨。名曰宝明。与无量<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。优婆塞。优婆夷。百千万人。复有无量天龙夜叉。<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>善神。及餘他方无数菩萨。皆悉集会</p><p>不坏诸法菩萨说宿缘品第二</p><p>于是。眾中有菩萨。名不坏诸法宝明。承佛神力。前白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。我于往昔然灯佛所<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>学道。彼时名字等贤比丘。尔时世尊。即授于我今菩萨记。号曰不坏诸法。尔时宝明菩萨白佛言。世尊。云何授我号為宝明乎。唯愿世尊。说此宝明名字所以</p><p>佛言。諦听諦听。善思念之。今為天眾求天乘者。说斯决定大乘微妙要法。及汝名字金刚语句。尔时天眾奉教如听。佛告宝明菩萨。善男子。汝且观此诸佛名字。為是有耶。為是无耶。為有实耶。為无实耶。善男子。若名字是有。说食与人。应得无饱。若得无。饱一切饮食。则无所用。何以故。说食寻饱不须食故。若名字无者。定光如来不授我记及汝名字。如无授者。我不应得佛。善男子。当知。字句其以久如以其如故。修题诸法名字性空。不在有无。善男子。若名字空者。于诸毁呰诽谤讥呵及以讚誉不应瞋喜。何以故。诽谤毁訾及以讚誉。二俱空故</p><p>观声性空证实际品第三</p><p>善男子。若遇如上境界。应作是念。此音声者為天為小。青黄赤白。从何方来。今来骂我。著我何处。形相何似。上下諦观。都无所得。若无所得。不应生于瞋喜之心。作是观已。坚持不捨。当知。不久得阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。何以故。观音声性空。证于如故。譬如有人夜想飞空及其睡时见身飞行。菩萨摩訶萨亦复如是。观声性空必得空证。乃知音声但狂耳根。如无实体</p><p>观三处空得菩提品第四</p><p>善男子。菩萨摩訶萨。欲得阿耨多罗三藐三菩提者。当观三处。内外中间。是為三处。于三处中。无有实法。即為<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。解脱者即菩提也。宝明菩萨白佛言。世尊。三处观者為何谓也。佛告宝明。善男子。欲知三处。当修身观。眼即為内。色即為外。心处中间。是為三处。或有眾生。从无始已来。不知三事虚之与实。妄起种种<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>到或。是以我今教如实观。令断诸或。善男子。眼不自见。色不自名。心无形质。三事俱无。是故眼不自见。常处于内。色不自名。常处于外。心无形相。处无所在。善男子。眼不自见。属诸<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。缘非见相。眼即是空。色属眼时。名色為色。若眼性空。色亦无实。何以故。从空眼见体无实故。善男子。菩萨摩訶萨。知眼是空于内无染。知色是空于外无著。<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>是空灭于诸行。耳鼻舌身意亦复如是。善男子。知眼属缘见无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。眼终日见。犹為无见。色性属眼而不自名。终日名犹為无名。善男子。以斯空眼常看空色。内外遍观心不可得。常求诸色而不可满。耳声鼻香舌味身触意法亦复如是。善男子。应作是念。若眼与色非為空者。眼住于内不应辩外。色住于外不应从眼。眼是有住。色亦有住。心是无為。不应在有。何以故。有之与无性相违故。是故当知。眼色与心虚通无碍。善男子。意即為内。法即為外。心处中间。意不自知。法不自名。心无形相。三事俱无。是故意不自知。常处于内。法不自名。常处于外。心无形相。实无处所。意不自知。属诸因缘。缘非知相。意即是空。法属意时名法為法。若意性空法亦无实。何以故。从空意知体无性故。善男子。知意是空。于内无染。知法是空。于外无著。知心是空。灭于诸行。知意属缘。知无自性。意终日知犹為无知。法性属意而不自名。名终日名犹為无名。以斯空意常知空法。内外遍观心不可得。是故菩萨应作是念。若意与法非為空者。意住于内不应辩外。法住于外不应从意。意是有住法亦有住。心是无為不应在有。何以故。有之与无性相违故。是故当知。意法与心<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无碍。譬如阳炎远视似水。无智之人為得所逼急走向之。转近转灭。炎边住者知此地中本来无水。见彼走人知其妄相。便生嗤笑语走人言。此中无水但阳气耳。狂汝眼根。彼人闻已热渴心息。色亦如是。凡夫无智谓呼有实。為欲渴所逼生贪求相。炽然起心趣向奔走。色相属缘转观转灭。证实相者知此阴中本来无色。本来无识。见凡夫人贪色。疾走知其<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。便生嗤笑。為说实法语。眾人言。阴中无阴。心中<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。念中无念。但缘气耳。狂汝眼根。若有智者。闻已妄渴心息。阴界诸入亦复如是。善男子。譬如凡夫夜梦见身。种种光明。食百味食。复见远行。至他方所。得好衣马。侍从百方。欻尔起瞋。寻命事力。杀数千人。及其觉时。身光寻灭。亦不远行。光明色相。空无所有。梦中<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。及与事力相。杀之者都无色相。色亦如是。一切眾生。从无始已来。黑闇崖下。无明被底。长夜睡眠。处于梦宅。妄见诸色。起一切法。善男善女。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。相杀相害。无有穷已。一切眾生谓呼為实得道。觉者乃知虚妄始知生死同涅槃相。男女诸色。本性体空。善男子。若色如是。一切诸法亦复如然。如空谷嚮。如芭蕉坚。如水中月。如空中华。如石女儿。如电久住。如水龟毛。如走兔角究竟无实。诸有智者。应除诸见。如世生盲。莫分别色。若不分别。当知不久得阿耨多罗三藐三菩提道。善男女。一切眾生。為诸烦恼弊于慧因无眼生眼想。以斯忘想见外境界。名之為色。如起贪著。以贪著故。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>三有。如旋火轮无有休也</p><p>亲近真善知识品第五</p><p>善男子。一切眾生。欲得阿耨多罗三藐三菩提者。当亲近善知识。请问法要。必闻如斯甚深要句。尔时宝明菩萨白佛言。世尊。云何是善知识。佛言。善知识者。善解深法空相无作无生无灭。了达诸法从本已来究竟平等。无业无报无因无果性相如如。住于实除。于毕竟空中炽然建立。是名善知识</p><p>二十一种譬喻善知识品第六</p><p>善男子。善知识者是汝父母。养育汝等菩提身故。善知识者是汝眼因。示导汝等菩提路故。善知识者是汝脚足。荷负汝等离生死故。善知识者是汝梯橙。扶侍汝等至<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>故。善知识者是汝饮食。能使汝等增长法身故。善知识者是汝宝依。覆盖汝等功得身故。善知识者是汝桥梁。运载汝等度有海故。善知识者是汝财宝。救摄汝等虽贫苦故。善知识者是汝日月。照曜汝等离黑闇故。善知识者是汝身命。护惜汝等无有时故。善知识者是汝鎧仗。降伏诸魔得<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>故。善知识者是汝緪绳椃机汝等离<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>故。善知识者是汝妙药。疗治汝等烦恼病故。善知识者是汝利刀。割断汝等诸爱网故。善知识者是汝时雨。润清汝等菩提身故。善知识者是汝明灯。能破汝等五盖闇故。善知识者是汝善标。教示汝等趣正道故。善知识者是汝薪火。成熟汝等涅槃食故。善知识者是汝弓箭。射杀汝等烦恼贼故。善知识者是汝勇得。能破汝等生死军故。善知识者是汝如来。破汝烦恼至涅槃故。善男子。善知识者有如是无量<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。是故我今教汝亲近</p><p>宝明听眾等悲不自胜品第七</p><p>于是宝明。与诸天眾。闻佛说此妙法及善知识甚深要法。举声号哭。泪下如雨。悲啼懊恼。不能自栽。自念。我身从旷劫已来。為善知识之所守护。是故今日值于如来。得闻深法。如是遇者。善知识力。非我力能自念。我等从本已来未曾报恩便方亲近。说是语已。重复举声悲号懊恼。槌胸天哭。譬如有人。新丧父母。号悼啼泣。死而复甦。尔时世尊。见是事已。生怜愍心。即嘘长叹以叹息故。振动三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。一切佛剎皆亦大动</p><p>普光<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>菩萨等证信品第八</p><p>于是东方百千万亿阿僧祇土有国。名宝土。佛名宝相。有菩萨。名普光庄严。见此地动白宝相佛言。世尊。如此地动是何瑞也。彼佛答言。西方去此百千万亿阿僧祇土有国。名娑婆。<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>释迦牟尼。為诸眾生说于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。决定大乘报善知识恩。故现斯瑞。普光庄严菩萨白宝相佛言。世尊。我欲与此天眾俱。至于彼<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>。释迦牟尼佛所请问。彼佛事善知识。并问深法。宝相佛言。善男子。令正是时宜速疾住。于是普光庄严菩萨。与无量天菩萨。各皆现身。坐宝莲花师子之座。放天光明如天力士。屈身臂来须至娑婆世界。在虚空中湛然而住</p><p>尔时宝明菩萨见此光相。即白佛言。世尊。此何光相。初未曾见。佛告大眾及宝明菩萨言。此是宝相如来所诸天菩萨。闻我為汝说大乘经及善知识现地动相。是以来到宝明菩萨及诸大眾。闻是语已。皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。□□衣服。待佛左右。于是普光庄严菩萨。于虚空中。雨眾宝华。雨华已讫。寻至释迦牟尼佛所。遶无数匝合掌作礼于一面立。佛告普光庄严菩萨言。善男子。汝发来时汝之世尊气力安否。汝涉远来得无劳也。普光庄严菩萨前<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足答言。时我世尊。常命色力更无他也。慇懃嘱者致问无量。于是眾中文殊师利菩萨。谓普光庄严菩萨言。诸善男子。汝等远来何所諮请。普光庄严菩萨。白文殊师利言。大德。我承世尊说甚深法。及善知识所有功德。是故我来欲有諮请事。善知识所有功德。文殊师利言。若有諮者。宜速发问。此诸大眾愿乐欲闻。于是普光庄严菩萨知大眾意。前礼佛足白佛言。世尊。我等昔来慧力微弱。不能善解决定大乘深妙之义。及善知识不有恩德。如佛前说。恩重难议。唯愿世尊為诸大眾。说于亲近善知识法</p><p>佛言。善哉善哉。善男子。乃能為诸眾生问如斯法。諦听諦听。善思念之。当為汝说</p><p>烦恼即菩提品第九</p><p>善男子。善知识者有大功德。能令汝等于贪欲瞋恚愚痴邪见五盖五欲眾尘劳中建立佛法。不起一心得大功德。譬如有人持坚牢船度于大海。不动身心如到彼岸。善知识者亦复如是。以大愿船处生死海。运载汝等。不动身心。到涅槃岸。善男子。譬如有人欲行嶮路恃託一人。善于伎艺鎧仗修有并好宝车。驾以五马。身心无畏。得达无难。善知识者亦复如是。法身壮大善于方便。<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>伎艺。慈悲鎧仗。皆悉修有。来于大乘驾五<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>。运载汝等得无所畏。离于三涂生死诸难。善男子。譬如有人依楞伽宝服<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>妙药消除诸病。命不中夭。善知识者亦复如是依大智宝服于法药消烦恼病。慧命无穷。善男子。譬如有人依师子王行诸兽中。无有怖畏。善知识者亦复如是。若有依者。游尘劳中亦无所畏。善男子。譬如有人依须弥山。假使八风不能吹动。依善知识亦复如是。八难之风不能吹动。善男子。譬如有人依金翅鸟遍观大海。不畏诸灾。魔竭鱼难。依善知识亦复如是。逕生死海不畏诸魔外道之难。善男子。善知识者。无量功德。广欲说者。穷劫不尽</p><p>求善知识不借内外<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>嫌疑品第十</p><p>若有智者。见善知识应当<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>不惜身命。何况揣财眷属妻儿及以国城如得吝惜。若善知识诸有所作种种境界不应起于毛髮疑心。所以者何。若有疑心不得正受甚深法句。汝等大眾于善知识应断疑念</p><p>普光问如来慈偈答品第十一</p><p>尔时普光庄严菩萨白佛言。世尊。云何正受甚深法句。何谓甚深。佛言。勿作是问。若今说者声闻缘觉及新发意菩萨闻说斯法心所迫迮。断坏善根。普光庄严菩萨白佛言。世尊。為我等辈方便演示。与诸眾生作将来业。尔时世尊以偈颂曰</p><p><a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>善諦听我今如实说一切诸法性</p><p>本来无所动诸佛依贪瞋如座于道场</p><p>尘劳诸佛种本来无所动五盖及五欲</p><p>為如来种性常以是庄严本来无所动</p><p>淫欲及邪见并餘结使等究竟解脱相</p><p>本来无所动诸佛从本来常处于三毒</p><p>长养于百法如成于世尊诸法从本来</p><p>无是亦无非是非性寂灭本来无所动</p><p>一切诸眾生实无有生灭生灭即涅槃</p><p>本来无所动一切诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>从缘无起作</p><p>起作性如如本来无所动一切诸文字</p><p>无实无所依俱同一寂灭本来无所动</p><p>诸诸<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>福于中三事空究竟不可得</p><p>施福如野马若说诸持戒无善无威仪</p><p>戒性如虚空持者為迷到若见瞋恚者</p><p>以忍為羈鞅知瞋等阳炎忍亦无所忍</p><p>说诸<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>业為增上慢说无增上慢者</p><p>无善无精进若起精进心是妄非精进</p><p>若能心不妄精进无有虚若学诸<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a></p><p>是动非坐禪心随境界流云何名為定</p><p>参罗及万像一法之所印云何一法中</p><p>如生种种见一亦不為一為欲破诸数</p><p>浅智之所闻见一以為一若有闻此法</p><p>常修寂灭行知行亦寂灭是则菩提道</p><p>若欲证此法亲近善知识善学诸方便</p><p>度脱于群生我今说此法為摄有眾生</p><p>若<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>见者究竟无所说此是金刚句</p><p>决了诸邪见一切外道辈尽力无能坏</p><p>若有诸眾生得闻如是经虽在三涂中</p><p>究竟清凉乐若闻此经名及解一句义</p><p>必生诸佛国何况读诵者若有此经处</p><p>我恒在其中為护如是人令得无上道</p><p>尔时世尊说此偈已普光大眾得无生法忍即為宝明授记品第十二</p><p>宝明菩萨寻得授记。汝当来世过八十万劫当得作佛。号宝明如来应供正遍知明行足善逝<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>解无上士调御丈夫<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师佛世尊。时有眾生。纯一大乘。更无声闻辟支佛。名国土严净。过无量寿百千万倍。与诸菩萨授记已讫。便欲捨坐</p><p>传持品第十三</p><p>尔时文殊师利菩萨前白佛言。世尊。此等当来在何等人手。以何恩缘得闻此经。佛言。善男子。此经甚深难可得闻。譬如金刚一切凡夫不能睹见。唯除帝释。此经亦尔。声闻缘觉所不能见。唯除菩萨譬如师子。一切禽兽无敢向者。唯除龙王。此经亦尔。声闻缘觉断绝悕望。唯除菩萨。假使有人纯以真金满四天下以用布施。不如闻此经名得福万倍。假使有人纯以七宝作诣床榻。以颇梨衣供养眾生。满阎浮提界。于一劫不如闻此经名得福万倍。若有善男子善女人。得闻此经者。当知。是人亲侍无数诸佛。殖眾德本。乃能得闻。善男子。此经当来至于八地菩萨之手</p><p>护经如眼寧丧身命不急品第十四</p><p>佛告诸大眾及宝明菩萨。汝护是经。如护眼目。寧丧身命。莫于此经中。如生<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。若有眾生。于此经中生<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>者。当知。是人真<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>无有疑也。尔时世尊说此经已。一切大眾天龙八部皆各欢喜。<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>奉行</p></div>"
}]