[{
    "title": "法王经 第2883部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>法王经</p><p>于其光□□□□□□□□□菩萨□□□□□□□□即从坐起。绕佛三匝却住一面。五体投地悲泣流涕而白佛言。天中尊如来欲入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。时欲将至。若灭度后千五百岁。五浊眾生多作恶业专行十恶。如此眾生福德力薄。于佛所说十二部经甚深妙法多文广义意趣难解。于其法□不可□揽。愿佛慈悲為说大乘决定真实。令此眾生得真妙药。疗诸毒病悉令得愈。佛告<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>藏菩萨。善哉善哉善男子。汝能為诸眾生问如是事。得大利益不可思议。我当為汝分别宣说真实大乘决定了义。何以故。度眾生故。令诸眾生离<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>故。出<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>苦生<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>故。必定<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>超<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>故。汝等皆当一心。為汝宣说。尔时大眾皆大<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃。异口同音俱发声言。愿佛慈悲為我宣说。佛言。诸善男子。欲求解脱当断攀缘。一心无二捨有心相。心性体空。于心性中无染无捨。若无取捨即无所得。若无所得即名<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。何以故。眾多烦恼皆一心生。心若不生烦恼不生。于诸境智即无取捨。若无取捨即离诸著。若离诸著即不攀缘。虚空藏菩萨白佛言。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。眾生境智能生<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。是缘起处。内外二边诸<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>入。云何于中而不取捨。佛告虚空藏菩萨言。善男子。一禪聚观诸内外必竟不有。何以故。观内顾内真性不生。观外顾外无明不起。无生无起即无涅槃。是為清净。是妙良药。虚空藏菩萨白佛言。世尊。如来所说大乘实相甚深微妙无上良药入一乘諦。而后眾生三业不净。作十恶业行阐提行。根基狭劣难可措心药病差别。作何方便令入大乘。佛告虚空藏菩萨。我有方便令入大乘。虚空藏菩萨白佛言。世尊。我从昔闻如来為大乘人说<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>法。為中乘人说<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>法。為小乘人说四諦法。為阐提人说十善法。皆对病根為说良药。云何今日说一乘法以救四人。佛告虚空藏菩萨言。我说一乘道法。犹如一地能生万物长养一切。犹如大雨普润一切在地生者皆得润泽。犹如一米一味之饭在世眾生人及非人皆以為食。食者悉能长养身命。譬如药王善合妙丹。眾生病热服者清凉。眾生病冷服者温热。诸下痢者服之即断。诸下闭者服之即通。无病不愈。我说一乘法于彼四人疗诸疾病亦复如是。虚空藏菩萨白佛言。世尊。以何方便令彼十恶阐提眾生入一乘道。佛告虚空藏菩萨。善男子。我一乘法即具三乘。更无别说而作三乘。汝当諦听。為汝宣说。善男子。妙道深体一相无二。以方便故而说三乘。诸法三乘皆符一观。一切眾生虽有四种。而于<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>亦无有二。何以故。一切佛一切眾生同一性相一体无异。眾生之心自起分别。佛是眾生。眾生是佛。一切眾生皆有佛性。佛性眾生性皆同一性。一性平等等诸法故。我有方便令入一乘。善男子。令彼眾生牢固心城。勿令贼入六识大门。金刚守护观心住处知心住处。于心住处即不住心。若不住心心则不住。不住诸恶及以境界即不攀缘。离攀缘故心即无求心。若无求心则无住。若无住处即名实住心。善男子。眾生之心作诸烦恼。皆為心神所起不住故。其心若住即无烦恼。若无烦恼即是菩提。虚空藏菩萨白佛言。世尊。一切眾生作诸烦恼其心不住。从何力起而作攀缘。愿佛慈悲為眾宣说。佛言。一切眾生作诸缘起有二性力。何等為二。一者缘外境界起。是缘性力。二者不缘境界起自心自起。是性力。善男子。令诸眾生不起二性。则无烦恼则无菩提。若无烦恼若无菩提入真实处。是真菩提。汝等菩萨若化眾生当令心住。虚空藏菩萨白佛言。世尊。化度眾生令其心住。住在何处而得菩提。佛告虚空藏菩萨言。善哉善哉善男子。汝能善问。如是心义是大菩萨摩訶萨不可思议。汝当諦听為汝宣说。善男子。若化眾生令其心住。住不在内。住不在外。住不中间。诸佛乘法亦不在内。亦不在外。亦不在中间。住一心神于无住处故得菩提。若得菩提亦无菩提可得。是名如如。何以故。烦恼妄生。為妄空故。诸法不自生。法亦空故。此心但有空名。心亦不可得心亦空故。诸善男子。若知心空。不应于一空心中妄见一切。若见一切即名心垢。心垢若无即名漏尽。眼色与心界三空常净。虚空藏菩萨白佛言。世尊。诸法若然。一切眾生应于一身一心一世界能入一佛世界。一佛世界能入遍满虚空一切<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>世界。佛告虚空藏菩萨。善男子。如是如是。一切世界入一世界。一一世界有一一莲华座。一一莲华中各有一如来座。一一如来身充满一切世界。示现一切世界皆悉虚空。诸佛<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>一切世界有一一菩萨。身充满一切世界。有大神力。于一毛孔中安置一切世界。一切世界入一眾生身。一一眾生身一一世界数。一一世界即是一佛。一一佛道场一菩提树。一菩提树下各有一佛座。一<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>充满一切世界。一一佛妙声亦充满一切世界。一切世界皆随所应无不闻解皆為欢喜。诸<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>知法在其身中。不应而于他方一切世界之处而心佛身。应于一心一世界处而求佛身。于一身中能生一切身。于一切身中能生一身。何以故。一身一佛身故。一切眾生身。眾生身及诸佛身皆从一心生。一心若善诸法善尽。一心若恶诸法恶尽。若作恶业则生恶眾生之身。若作善业则生<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>诸身。若于一心离一心想。于心相中空无所得。复离空心界于无取地能生佛身。于佛身中一身无二。一佛性故。一佛性中即一心性。于一心外更无他求。若作他求即為颠倒。何以故。一切心法无由外请。于外请处即名為他。若求他处即名虚妄。虚空藏菩萨白佛言。世尊。于一心中而得佛者。一切心中皆有佛性。一切眾生皆有佛性。若各各能定身心即得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。离此外更无求佛处。佛告虚空藏菩萨言。善男子。如是如是。如汝所言。一切眾生皆有佛性。诸佛如来皆以一心法令诸一切眾生一切之心于一心中而求佛法而得佛身。虚空藏菩萨白佛言。世尊。若诸眾生有佛性。于佛性中而求得佛。一切眾生皆有心亦有佛性。是為可得是為可见。佛告虚空藏菩萨言。善男子。入佛妙性实相之际。亦不可得非不可得。亦不可见非不可见。何以故。菩萨说佛性有即名谤佛。说佛性无亦為谤佛。说佛性亦有亦无亦為谤佛。说佛性非有非无亦為谤佛。何以故。菩萨眾生佛性非有如虚空。非无如菟角。菟角无故。虚空常故。非有质相。非有空相。离诸形相。无所著故。不在生处。是故不垢。不住灭处。是故不断。眾生佛性妙相如是。说佛性有即增益谤。说佛性无损减谤。说佛性非有非无戏论谤。说佛性似有似<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>违谤。虚空藏菩萨白佛言。世尊。眾生佛性若妙如是离诸境界则无所染。由如虚空体性常净。云何眾生作诸烦恼。若作烦恼心则是垢。是心之垢从何而生。唯愿世尊為眾宣说。令诸眾生皆悉闻知。令诸眾生破诸烦恼。除荡心垢永离盖缠。佛即嬉怡微笑。以左手掌摩菩萨顶。放大光明普照一切。尔时大眾一切眾生皆大欢喜踊跃。佛言。菩萨為诸眾生所作如是问是名正问。是度眾生。若作他问是名邪问。是灭眾生。菩萨汝能正问是度眾生。汝等眾生皆当一心专念諦听。除散乱想无营物外坐性坚志。為汝宣说。若闻说者一切十恶眾生皆得解脱。虚空藏菩萨白佛言。世尊。我等大眾一切眾生皆以一心无餘乱想。唯愿世尊為眾宣说。佛告菩萨大眾等。一切烦恼从颠倒生。一切颠倒从<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>生。一切妄想从有我生。一切有我从无本生。一切无本即是无住。无住无本即為不有。有则為垢。无则為净。于其净处是常波罗蜜。是乐波罗蜜。是我波罗蜜。是净波罗蜜。若作是见名為<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。若作餘见名為邪见。如是见者是人有慧。作他见者是人无慧。若有慧者则方便解。若无慧者则方便缚。虚空藏菩萨白佛言。世尊。于其净处若有眾生常起常想。常起乐想。常起我想。常起净想。即是有慧。即非颠倒也。佛言。菩萨若有眾生如是想则名正想。是人正见。是人有慧。何以故。如来法身常波罗蜜。乐波罗蜜。我波罗蜜。净波罗蜜。清净处诸佛法身。作是见者是人是佛。真一<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>从<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>生。从法化生。从佛口生。得佛四依。虽曰凡夫是四依菩萨。善男子。于我灭后。若五百岁若千岁若千五百岁后。若复有人能于此经<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵如说<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。于常乐我净处<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>正见。复以此法教一眾生则名菩萨。虽曰凡夫得受<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。是<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人。虚空藏菩萨白佛言。世尊。夫是出家之人剔除鬚髮而被法服受持具戒不染于俗。是名出家得受供养。如来今说凡夫是出家人得受供养。不了其义。愿佛慈悲為我宣说。佛告虚空藏菩萨言。善男子。剔除鬚髮者。剔除名想伏身<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。而被法服直心无諂曲欲离俗故。持具戒者不起贪嗔痴。我说彼人是名出家。虽是凡夫能伏身心不起我慢心不染尘俗。久离于俗心如金刚不坏戒性。虽是凡夫是真出家。复于此教大乘经中修行如说信佛语故。见常乐我净為眾生宣说。虽是凡夫是四依人。是行菩萨得受供养。名曰行者。得慧方便说大乘法。如是法性皆不离心。从心化生。湛然常一。一相无二。于一相中亦无内外亦无中间。离一切故。若离一切即无生灭。无生灭者即是真如。真如<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。法僧不灭。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>眾生自生自灭。善男子。故说眾生无我。诸佛如来是真实我。能破生死流故。汝等眾生。若求常住当离诸欲作无生行。虚空藏菩萨白佛言。世尊。作何行业名无生行。佛言。诸善男子。我不生他则他不生我。何以故。体性清净空非有非<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。诸境空清净非无非不断。菩萨诸佛如来恒以一味一性之香燻诸眾生一心性净。而诸智者得会空解。而诸愚者入迷执缚。何以故。智者眾生无有痴故。于有觉性觉诸无明不起无觉不空不定。入一清净永离诸恼。愚者眾生為有痴故。于有觉性不觉无明即起无觉作诸尘恼。若有悟觉则无无觉。若无无觉则病不生。若病不生则无有觉。若无有觉若无无觉即无痴心。何以故。一疑心中有二意故。若无疑心即不生病。若有生处即入空舍。一性真空有為无相。逢境缘起如空幻化。菩萨令诸眾生当断疑心而作心师。不师于心离诸可欲无令放逸。若生念处即须当断。前念后念念不相违。即得顺理不起无明。不定有觉本不动故。若起念时止念前起。虚空藏菩萨白佛言。世尊。念前若起作何法觉而能止之。佛言。菩萨令诸行者每观心住处。知心住处即不住心。以是觉故。觉则止之。念欲不起。即无<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。若有起处安住虚空一性。空中染净俱灭。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>清净不取不捨。念亦不生。无生无行。心行处灭言语道断。一佛性觉更无餘觉。妙性常存犹如虚空。不著一切。菩萨若行此行。犹如执杖以打虚空不染而著。是名法行。若有染处即入方外。游行净地一心无二。入定正性观一实諦。而以懺悔。尔时眾中有一阐提名曰多欲。从昔以来多作恶业。专行十恶。為诸憎恚嫉姤四蛇牵引為诸妄想二鼠嚙断心根。犹如有人绳悬在树。四蛇在下吐毒向之。树上二鼠嚙绳欲断。若心灭即三业净。若心不灭眼色与心俱為妄想。為见所缚将堕地狱。尔时一阐提因佛闻法。于一念中心生惭愧。欲问如来懺悔之法。心怀惭愧不能发问。如来<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>即知其意。欲令是人离诸苦恼出地狱门苦。语虚空藏菩萨言。于我涅槃后。若有阐提之人多作恶业。灭佛<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>谤正法作五逆。必当堕落。于诸地狱乃至十二大劫由不得出。汝等菩萨当发慈心。令此眾生发露懺悔皆得解脱。虚空藏菩萨白佛言。世尊。作何法悔而得罪除。愿佛慈悲為分别说。佛言。菩萨若欲懺悔当观实諦。若见实諦诸罪悉除。佛说语已。尔时眾中百千万亿一切眾生人及非人。皆悉一心观一实諦。观见见已罪垢皆灭。唯阐提人不见。其一阐提多欲即从座起五体投地而白佛言。世尊。我心无明。虽复学观不见实諦。从无始以来乃至今日纯行十恶。作何方便令我得见实諦令罪消除。佛告多欲。汝等阐提皆悉一心。為汝分别解说。多欲。汝等眾生当观身心一佛性。法身佛性即一无二。若此二种能作一观。是名正观。亦名一相正见。若见有二即名為邪。若作邪见即烦恼起。若无邪见烦恼不生。烦恼若断即名清净。佛言。汝等眾生皆当一心观一佛性。佛性之外更无所见。若有所见皆為虚妄。作是虚妄则為颠倒。多欲一心净则法法净。一心垢则多法垢。垢则為罪。净则為真。心若离垢罪即不生。多欲白佛言。世尊。我从昔来乃至今日。作诸恶业无量无边。歷千万劫今日<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。观一佛性实諦。无边之罪皆悉除不。愿佛世尊為我解说。令我一心无疑。佛言。多欲。若观实諦诸罪悉除。何以故。多欲。昔日垢心今日净心。一心无二更无别心。今日心净昔心亦净。是故当知从无数劫来诸罪尽灭。譬如千年尘镜以衣一拂。其镜即明。诸尘皆尽无有遗餘。又如千年闇室燃一炬灯。诸闇皆尽。汝等眾生常应一心观一实諦。于诸法内作诸法行。去离<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>一切诸法。何以故。多欲。世间动不动法皆是败坏。其法若坏行亦无常。行若无常法则生灭。离生灭法即名真諦。多欲。譬如瓦师作诸瓦器。随心所欲其器无定。其器相□及以名字皆悉生灭。唯有瓦性一性是常。诸餘体段悉皆生灭。是生灭体即不自生。若不自生即是不有。多欲。佛性如瓦。眾生性如器。是生灭法。若离诸业即是佛身。观一佛身即无他业。多欲白佛言。世尊。我观实諦诸罪已灭。复作何业而生法身。佛告多欲。若观实諦诸病不起罪垢俱息。心如金刚必竟不坏。善能持戒。心如虚空内外清净。善入禪聚。心如风火。诸行悉散善依<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。即名解脱。以解脱故则能知见。多欲。汝能修行是事即得五分法身。多欲白佛言。世尊。五分法身有何<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。佛言。多欲。佛性常因法身常果。何以故。因心佛性缘得果。离因离果则无因果。若无因果是佛真身。多欲。于心净国当住寂净当观实念。则此念中即生净国。可為眾生如如<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。入心真空离诸动说。三识一性金刚不坏</p><p>尔时眾中复有菩萨名曰无行。即从座起偏袒右肩右膝著地。合掌向佛而白佛言。世尊。若佛灭后五百岁。若千岁若千五百岁后。若為眾生说法。当何法说。愿佛慈悲為我宣说令我无疑。佛告无行菩萨。善男子。若一千五百岁后為眾生说法者。说体不说相。说义不说文。如是说者是真说法。若说文相动口动心。皆是诽谤善男子。若于一切眾生处说法。当如如相说平等相说。何以故。当时一切眾生皆同一病。一心一佛性一性平等等诸法故。于中若说高下即名邪说。其口当破其舌当裂。何以故。一切眾生心垢同一垢。一切眾生心净同一净。何以故。一切眾生一心净则同一十善法净。一切眾生一心垢则同一十恶垢。眾生若病同一病眾生须药应须一药。若说多法即名颠倒。何以故。為妄分别善恶法破一切法故。随基说法断佛道故。菩萨若当说法。当如如相说。无行菩萨白佛言。世尊。云何如如相说。佛告无行菩萨言。善男子。说一体真法是如如说。直心具说是如如说。无偏执说是如如说。无分别说是如如说。住心一净处说是如如说。诸说不可说是如如说。尔时无行菩萨欲令大眾一切眾生悉皆明了。重白佛言。世尊。云何说不可说是如如说。佛告无行菩萨言。善男子。一切诸法自相空说则不可说。一切说法无相说即不可说。一切诸法无作说即不可说。善男子。若如是说即不可说是如如说。无行菩萨白佛言。世尊。法若如是说云何直心具说。佛告无行菩萨言。善男子。直心者直以心信如来义说不以自心说。具者具十善义。具四諦义。具十二<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>义。具六波罗蜜义。具三解脱门义。具如是等法。于一心中一佛性地等一净说。是名具说。是如如说。何以故。一切诸法俱為一故。菩萨等一净法。犹如一大海水味种种珍宝所有。求者随心即得。犹如一神丹种种诸杂药和合而以合成疗治一切病。服者一一除愈等。一净法一心净一佛性一性净法亦复如是等诸法故。如是说者是净说。若别说者是秽说。何以故。一切眾生皆有佛性无无佛性。但觉有远近。无无法身分者。若定根机。為小乘人说小乘法。為阐提人说阐提法。若如是说即名不说佛道法。是断佛性是灭佛身。是说法人当歷百千万劫堕诸地狱。纵佛出世由不得出。纵令得出。若生人中即生边地下贱无有三宝处。缺唇无舌。获如是报。何以故。菩萨眾生之性则是法性。法性常净具一切诸实相好。从本以来无得无失无出无没。性常真实。亦无虚妄亦无烦恼。亦无涅槃亦无增减。究竟清净一性清净。即是菩提清净性。菩提性一性无二平等清净言语道断。犹如虚空。内外清净是一清净。亦不处内外亦不处中间。无言无说。云何于中分别病药。若无分别是无分别智。善男子。离一心外一清净外一佛性外。即无佛可求。即无法可说。即无僧可得。何以故。佛是法故。法是僧故。僧是无為。无為则是佛性。佛性则是法身。是故我说。此经唯说一眾生身一心。一清净一佛性一佛道场一菩提树。充满一切世界入一切眾生身。善男子。一切佛从此经生。一切法从此经生。一切僧从此经见。受持是经者即名受持三宝。念此经者即名念三宝。供养此经者即名供养三宝。无行菩萨白佛言。世尊。云何念三宝。若念三宝得几多福。佛告无行菩萨。善男子。若念三宝犹如虚空。其福无量不可思议。若念三宝安住虚空。心中乃至不见佛法僧。是则不见诸法。不见诸法则于法中无疑惑。于清净处念一实相一体三宝。是念三宝。无行菩萨白佛言。世尊。于三宝中一心<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>。于烦恼处自心不起。对缘不起。于诸善法亦复如是。住一净心依一佛性。不动不住不為法体。救眾生如己身。化诸眾生如化一身。爱诸眾生由如护眼。是菩萨行非菩萨行。愿佛世尊為我宣说。佛告无行菩萨。是菩萨行。若化眾生当令眾生持心不持语。持行不持法。若為说法说文不说字。说义不说文。何以故。佛性是义故。何以故。离文相故。若取文相是為虚妄。若捨佛性是為失本。善男子。若失佛性而求佛者。由如影中為人治病。由如攒冰而以求火。由如无翼鸟意欲高飞。终无得法。善男子。于此经中调心取义。不得随文当取其理。若不取理即名虚妄。亦复不得于其理上恶取空相而化眾生。即名<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>一阐提。但令眾生于一心中一佛性相观知实有。是实有相亦不在有亦不在无。观此妙有如如实相。当即住心。依此相处。若住相处即名清净。是清净处住即无本住即是动。是故诸佛如来从无本处建立一切法。尔时无行菩萨欲重宣此义而说偈言</p><p>大圣大佛尊欲入涅槃寂為度眾生故</p><p>说实一乘经我住慈悲地怜愍眾生故</p><p>于诸了义处问佛一乘心如来所说法</p><p>皆离于世间入实说佛性诸法皆清净</p><p>离文离相处亦不中内外说即不可说</p><p>故名说如如是故平等法住在于一性</p><p>一性清净法本来不生灭于空不空中</p><p>妙性常无体解脱非解脱本净不染故</p><p>诸染本不著妄著如埿污是埿自為污</p><p>妙性常净故净即无所净污亦无所污</p><p>埿性是為垢垢性本相空垢性似狂花</p><p>落树还如故树性无生灭狂花自来去</p><p>佛性本无生离诸生灭处无有动不动</p><p>性本常尔故一一不一一不名不可说</p><p>亦复离诸见不见处可见常乐我净故</p><p>见则是菩提菩提妙觉性不动无所觉</p><p>即是眾生身一心一佛性一佛一道场</p><p>一大菩提树能满虚空界普入眾生身</p><p>于真三宝中同一无有二不住形质处</p><p>亦不住空边入于妄有所必竟空寂舍</p><p>本来无本处建立一切法<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>诸眾生</p><p>使入如来藏</p><p>尔时佛见无行菩萨说偈语讫。即以神力故放大光明遍于三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。其光明中现十方净土。其诸国土皆悉严净。具有一切园林池沼。其池水中皆有五色莲华臺座。其一一华上各有一一大城。其一一大城内皆有一一清净大磨尼宝。其一一大磨尼宝内有一如来座。一千二百五十人俱。其诸佛等皆為大眾说一乘法。悉令眾生于一身中一佛一性一清净处住心不动。不缘诸境不入诸智。心如虚空不染。一切心如金刚不坏。诸戒心如海水恒流。智慧皆悉解脱解脱智见得五分法身。尔时无行菩萨及诸大眾一切眾生。见是事已心大欢喜。皆住一心不缘一切入清净处。佛即收光语诸大眾言。诸行者。我欲入涅槃寂。时欲将至。若我灭后五浊恶世。于此经中如诸修行观一身心。不住诸恶不离菩提。必得解脱得一乘道。佛告无行菩萨言。若我灭后五浊恶世。得见此经得闻此义。其人即如值佛。若我灭后若有一人。能于此经受持读诵如说修行。其心不动诸尘不触过无尘迹。复以此经令诸眾生受持读诵。复说其义而以教之。是人虽是凡夫。即是菩萨如师子吼。尔时眾中复有菩萨名曰法王。即从座起绕佛三匝。却住一面五体投地而白佛言。世尊。我于如来灭后五浊恶世阎浮提中。教化眾生说此良药。疗治眾病悉令除愈。复以此经金刚慧刀剪诸眾生无明之意。复以此经清净法杖鞭除眾生三毒之垢。复以此经大智力士解脱眾生十缠之缚。复以此经大智法船运度眾生令至<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。复以此经一性清净法。令诸眾生皆得一身一心一佛一性一清净。决定入一乘决定出地狱。世尊。若我不能救眾生令诸眾生入诸地狱。即為是我灭没佛身。唯愿世尊以此佛法付嘱于我。為我更说。广度眾生。令诸眾生少闻多解少见多知。不求多文以取证义。于少法中必定解脱无餘疑问。愿佛慈悲為我宣说。佛告大眾。是法王菩萨已曾供养百千万亿劫诸佛。善能方便救度眾生。是菩萨能以一味常风接续眾生之命。汝等眾生及未来者。若当受持是菩萨名者。复令大善知识转读此经广说其义。若有疾病皆悉得除。诸恶兽神无能近者。菩萨汝有如是利益眾生。我以此经付嘱于汝。亦為汝说救度眾生之法。少闻多解少见多知。不求多文以取证义。汝等菩萨皆悉一心諦听。為汝宣说。一切眾生皆一心一佛一性。一切烦恼皆一心生。皆从境智二处缘起。何以故。以缘性自性二种性力起。二种力性从一念妄心生。是妄心无本。若一念动时烦恼即起。当观此念知念妄心。妄心无本。无本即无住。若知无住即觉心生。由于本觉净心无念。若心无念心即不动。心若不动亦无住心。是名清净。清净空心体性清净。无净可证。离诸清净故说清净。菩萨于清净心中。无作无起无垢无净无增无减。必竟不染。不在一处。离名数故。常尔不尔。由如金刚不坏一性。犹如虚空容受一切。由如莲华不著爱水。若行此行必定解脱。超生死流出地狱苦。菩萨此一心法。一名懺悔解脱。见实体故。二名法行解脱。住一处故。三名无行解脱。无住著故。此三解脱皆一心生。一切眾生无二心故。一切眾生皆一乘故。佛言。法王菩萨善男子。能知一法即当知一切法。一法不知一切法不知。何以故。诸法无不一相故。菩萨闻是一者即是少闻。无法不知是名多解。何以故。一切法性归一净故。见是一者即见一切佛身。何以故。一切佛身从一清净处生。一净之地是一切佛身。一切佛道场。一切佛菩提树。善男子。于此法中断诸烦恼。由如伐树。唯断一根不断枝叶。何以故。譬如有人。身中毒箭于身受痛。当即拔箭其痛即除。若不拔箭痛则不除。待问箭毛羽是何鸟翼。复问其竹是何山出。复问其箭是谁之射。是人苦痛其命已终。然拔其箭终知无益。善男子。心若有垢当即净心。心若在净即名清净。诸说清净离诸有取能入无取。何以故。无本无住处常乐我净故。无本无住真如真实。不离一切本离离故。性不离道处住无住故。与心等一无异不共故。不在常处本不断故。不动不住性常一故。一亦不一离名数故。善男子。六风不动大树恒安。一性金刚二见不起。有无不在住妙常空。慧剑无生剪诸烦恼。空解无碍降伏自心。魔王不生怨贼不起。善男子。于此法中求实体者。如种一不种枝叶但养其根。若得生者花果自出。我此少法亦复如是。由如一阿摩勤果种此一果即得无穷之果我说此法于诸法中最為第一。于诸乘中最為大乘王。是故此经名為法王。又以此经付嘱法王菩萨故名法王。汝等大眾持是经者即脱诸难。若当持者如在在处处持。何以故。佛性常于心中常空寂。内禪真实清净金刚。六入城门常如如界。在不在处在空处中。汝等大眾皆悉勿语。时欲将至。欲入涅槃。是经名涅槃庄严<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜无碍解脱。佛说语已。尔时大眾皆得涅槃般若波罗蜜空脱无碍。尔时法王菩萨从投地起。即于本处入大涅槃。会空解脱于无著地。举足下足皆游清净。合掌向佛作礼而去</p><p>法王经</p></div>"
}]