[{
    "title": "瑜伽论手记 第一卷",
    "author": "福慧大师",
    "html": "<div class=\"B1_text\"><p>瑜伽论手记 第一卷</p><p>瑜伽论第三十一手记</p><p>谈述<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a></p><p>言谓依缘性等者。谓因前名缘性后□□□缘起言而起胜解者。谓能了知内外诸缘生法唯有因性及与缘性□有我人等□言广说如别者。谓无明有十九种。行有三种等。如前寻思地生杂染中以广分别言不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故者。谓我者是自在之义。由无明中无自在我故不作是念。我能生行。餘皆准此言中间等者。此显空义。谓无明及行二法中间无有传受之法故名空也言如前广说者。说□諍有害等二世过患。如前不净观说言诸业者。谓善等三业也言一自体果者。谓情非情缘起通摄也言受用境界果者。谓唯约有情而论也言今世等者。谓现世五趣果身生也言六处者。谓六根也言令生有芽者。谓无明為因故发生三行芽等也。破展转等也言诸取者。谓我语取欲取戒禁取等也言有内现证者。谓五位行人现见无明等顺逆二法。而能<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>证上果故言比度法者。谓比诸圣者等修顺逆缘起故得彼圣果。我亦比此修行证於上果故言能正解了等者。谓地等六界种姓别故及能寻思言种子义者。谓地等六法為种子故有五趣身也言因义者。谓因地等六法為因故生五趣身也言性义者。谓也等各各有坚等性故言是其界义者。為上四义一□□言一念等者。谓不了知身中有其六界故。但起一我见者名一念相言有正寻思等者。谓诸外道计我為因故得入母胎。此中不尔。因六界故得入母胎也言安住法性者。谓地水等六界诸佛出世不出世法等有故名安住也言长入息者。谓十息為一数等也言都无持入息者等者。谓出□□□□有蕴等诸行此中都无任持二见我人等故言因者。业<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>也言缘者。谓父母精血等也言诸<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。谓果相也言善巧等者。此中有问。四缘之中净行所缘所有六义如上所说。其义已知。第三善巧所缘。第四净惑所缘。六相差别何故不说。故论答云若依止善巧等也言此中者。谓指前四慧行观三门六事观不净而五观破。此终九种加行成前观门故也。故论文言九种等也言得定者。谓五位行人由九种加行故速得五位本定故言於所应往定等者。谓五位行人修九种加行故。於初资粮位者速得加行位等也言等分者。谓贪等五位烦恼不偏在一故名等分也言薄尘者。谓五位行人上上位人也言应随所乐等者。谓等行等二人於五位烦恼中先何起者修对治门故。故论文言举缘一境性等也言相应所缘等者。谓不净等五观门也言不全临入者。随顺等者。谓初中后三时心也言由住如是等者。谓住前出等六法等三种加行不缓名不放逸也言一时半时者。谓一更半更也言法义者。谓所治能治法义之中无颠倒故言九种相心住等者。谓内住等九种住心也言<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>者。谓<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>及我所心也言皆得清净者。谓依止品破观得成就二俱清净故云皆等也言所有加行者。谓止品此彼观品之加行故也言所熏习等者。谓观為能熏故止為所熏。此二<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>依故皆得清净也言所有加行者。谓观品是彼止品之加行故也言谓由等者。谓六随念等中随取一者便名為举言显示等者。谓若心沉没时。以净妙相显示其心自劝其心自庆其心言随顺等者。谓於不净等五观之中勤<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>者是举之相言所缘等者。谓於顺情违情之境中心无染污心平等故。於<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>中亦平等转言谓由所缘者。谓於顺违及止观中心不住者名為捨相言上捨者。谓取上上地之捨也言谓於如是等者。谓於止观二法所有尘义。如上所说中一一皆得善巧故言善趣等者。谓初中后三心也言或时弃捨者。谓若弃捨世出世定所有影像名為出定。若於<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>等说不定地作意思非亦名出定。言於餘所作者。谓於上上果所修行中而追求故言谓於一切等者。谓於所<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>学之中无违越者名不捨軛。谓於无穿穴等八法之中而修习者名不违越言於久所作等者。谓於自所作身业及语意三业中。於诸不善随顺不作。於十善业随顺而作。故论文言能因随忆等也言数起胜解者。谓能治道言数正除遣者。谓所治法也。梵云毘呵婆耶者。具含上二义。一胜解义。二除遣义。此二皆是正加行故标此二名言随相行等者。谓二十贤善定中随行可一皆具能治胜解及所治除遣。此中初修业者亦应如是。如久修观行之人具修上二之行乃名正行人也言当知此中等者。此等五门一一皆具<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>二义。说者应知言由於最初等者。谓修不净观等者必背静等颠倒之相言由缘餘定者等。谓若所修之定道力劣故不能除遣所治法者。当修餘定作其助伴成本定故言由於一切等者。谓由於诸净相等中起染污者。应修不净等观除遣净等诸相言虽遍立等者。此中有问。经中所说五种之相名除遣者意趣何等名為正除遣也。故论答云。然此义中等也难有五种。此中但取初二之法立為除遣言全不於所缘境繫缚心者。谓诸行人根性不等烦恼不同故。初修业时若贪欲多者令於不净观繫缚其心。若嗔多者以慈愍观而繫其心。餘皆准此。故论文言或復处等也言唯作是念等者。谓如不净观等相中有净等相者名有散乱。有不净等相者名无散乱。初修业者应作是念。我心云何得无散乱。意说我於何时得与不净等无散乱法而相应也。下之九种一一皆与唯作是念等相合说之言无寂静者。谓断现行故言猛寂静者。谓断种及现行故言如是精勤等者。与上十文一一相合言即由如是等者。谓由内摄其心為因故。五位行人於不净等所缘境中不念净等作意故也言有相者。谓不净相等也言有分别者。谓不净等有分别影像也言谓由随相行等者。谓行随寻思等三种慧故言彼境界者。谓依三种慧能观不净等五观过患<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。而非但行不净一观者。故论文言而非一向等也言还捨等者。此中有问。修五观时唯用三慧為方便耶。為当处要餘法為方便耶。故论答云还相等也言由於所缘等者。谓若捨於止必当散乱故名為捨。由九种住心止品摄故名為不捨言即於所缘等者。谓由义等六事差别观故。於所治中不作其相不作我不起差别我我所心故。故名不取言有於其中等者。谓由九种住心為因故。而能安住不净等观言取止行故等者。谓义等六事差别寻求不净等故。能為止品作其方便。故名止行能缘所知相也言若於缘等者。谓胜解是观。除遣是止也言由数胜解等者言於狭小境等者。谓修不净等五观之时。先观指节名為狭小。此渐次增长名為广大。后观十方无量。故论文言广大等也言若诸法等者。谓青瘀等。二十贤善定皆是有色影像也言诸无色法等者。谓慈悲等四观所有影像但是心法所变现故名非色也言出离者。谓<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>果也言远离者。谓涅槃因也言染污思慕者。谓贪著五欲等无出离心也言不乐等者。谓涅槃因果法中无欣乐心生忧恼也言下劣智见者。谓无间<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道中证少分时便生高举。故论文言谓我能得等也言广说如前者。唯我能得等。如前出离地中已广说故言谓於随顺盖等者。谓随顺五盖处所法中。非理作意名之為障。寻思自举准前说之。此三皆由非理作意而生起故名<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。因缘者根本义也言谓遍了知等者。谓由怯弱等四障為因缘故生起四种过患言於其四种等者。一未证不证过患。谓於无间解脱二道未证不证故也。二退知失过患。三坏加行过患。四有染污等五法过患言总用随念等者。谓六随念也言用於精进等者。谓用於精进故治羸劣。由平等故治身太过加行。由通达故治初修过加行故言用彼相违等者。谓盖覆寻思自举及不净观等五法对治故言又遍了知等者。若不了知诸障是障性者。不能修对治故。所以第一立遍知<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>也言远离因缘者。谓若不知诸障生起因缘者。必不知自性也言远离因缘者。谓若不知诸障生起因缘者。必不能修对治行故也言随顺教者。谓随顺观所治法有多种故。能治之教亦有多种故毘闵崮堑日摺N届兑灰还壑幸灰恢股?使恃远嘁惭运??痴摺N饺?帕?滤?鄄烊揪黄分幸蚬?骞恃陨砬岚驳日摺4酥杏形省N逦恍腥遂逗问敝腥缡嵌?ǖ镁烤挂?9事鄞鹪迫舻米?赖纫病H舭⒙藓鹤?酒芬谰黄肥狈降镁烤寡运??抡摺N剿?渭澳苤蔚酪惭阅芩程坝?日摺N蕉苏???人?畏ㄖ小3跣牟蝗と搿V行牟话?帧:笮牟恍沤庋阅酥凉闼嫡摺N届端嫠赤另Nデ榫持小3醪蝗と搿V胁话?帧:蟛恍沤狻D酥疗氪嗣麨殪洞软?邸R训镁烤辜拔吹镁烤埂H缜安痪还鬯狄病O氯?劢宰即怂笛运嫠秤蕹辗ㄕ摺N饺?涝灯鸱ㄖ衅鸪@治宜牡拐咚成?蕹辗ü恃苑巧砭巯嗾摺N椒谴由碇衅鹨痪畚蚁胍惭韵仿壅摺N郊炊喾直稹N接?醯纫惭苑ü壑械日摺N接傻瘸譃橐乐构省l端?稻乘?文苤蔚迷稻彻壑性錾匣圩?云毡橄嗾摺N讲痪坏任骞鬯?狄惭杂纱俗饕庹摺N接刹痪坏任逯肿饕鉃橐蚬省l毒怀@值任逯挚裳岱ㄖ辛钚难崂胍病O氯?饕饨宰即怂笛造犊尚蒙蟹ㄕ摺N讲痪坏仁亲钌戏ü恃杂墒窃档日摺N接刹痪坏任骞蹫橐蚬省D芾肷硇乃?芯幌嘀肿友阅谛募啪舱摺N讲痪坏任骞垡惭苑ü壅摺N轿骞壑兴?文苤卧黾跸嘁惭月┱摺N骄坏戎畹叩瓜嘁惭月┐Ψㄕ摺N侥信?瓤梢饧拔デ榈染骋惭陨?日摺N届兑环秩饶章┚持猩?崂胍惭缘热日摺N奖殪吨盥┤饶站持猩?崂胂嘁病O律?岬榷?渥即怂翟蒲晕阶运ニ鸬日摺N轿逦恍腥巳粲凶陨砑白跃焓羯ナР评?碓馑ニ鸹雎尴傅日摺C?运ニ稹K?嗤?恕H缡嵌?呈切扌腥丝裳岽Α9事畚难允?嘉┕实纫病N侥芩嘉┧ニ鹬?ǘ?茏阅占澳账?恃匀糇孕耸⒌日摺K淙蛔陨砑坝胨?行耸⑹隆1暇菇月湫恢?ň》ɑ捣?鸱ɡ肷⒎ū浠捣ü噬?崂胍惭越蛘摺N匠跤攵ㄏ嘤σ惭岳?摺N蕉ńト蟠涡囊惭匀谑收摺:笪灰惭灾ぞ徽摺N缴硇那岚补室惭晕阶魇悄畹日摺4司溆胂露?σ灰幌嗪涎晕医袢舻碌日摺N接删呓涞聻榘槁拦省N胰裘?杖魵屆坏蓖?迫ぱ酝?笮械日摺N较粤?途慈绶ㄑ杂杏汕昂蟮日摺N轿逦恍腥俗魇撬嘉?N异恫痪坏任逯止壑小O纫跃?诩昂笮尴肮省1氐被竦梦骞壑??9事畚难杂伤婺罘ǖ纫惭造赌芩嫠车日摺N接傻髁纷饕鉃橐蚬省P薏痪坏裙壑?恕l毒坏嚷┓ㄖ?小3醪蝗∠颉6?芪ツ嫒?芟怖帧K哪芾敫簟8髯”径ü室惭造犊尚婪ǖ日摺N接刹痪坏瓤尚牢骞墼萌笮墓省l毒坏鹊叩怪?唷3跄艹隼搿6?芰钚娜∠颉H??佟K哪芟怖趾秃稀4怂挠肭安幌虻人姆ㄋ娲味灾窝造妒笔奔涞日摺N接缮?岚矠橐蚬省D芊⑸?闹只坌芯鲈袢揪坏戎罘ㄒ惭杂米饕稻哒摺N接寐痆皮*日*ㄆ]钳锤等也言如是劝修等者。与下文一一相合言彼彼等者。谓於所修不净等观门之中。一一皆与止观双运故。一能亲府。二能善和合。三依定无转谓其心不退。四於定无动等也</p><p>瑜伽论第三十一卷手记竟</p></div>"
},{
    "title": "瑜伽论手记 第二卷",
    "author": "福慧大师",
    "html": "<div class=\"B1_text\"><p>瑜伽论手记 第二卷</p><p>瑜伽论第三十二卷手记</p><p>谈述<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>随听</p><p>言如应安立者。此中意问。初修不净等五观之人。欲於不净等修作意者。彼善知识应以何等方便令住厌离等五种相耶。故论文言如应安立等也言闻等者。此中虽依不净观门厌离法。若是修慈等观者亦同此问言家火者。谓不绍家业男女等也言若汝现见等者。谓若见他自身及彼眷属并村落受苦应生厌离。说者应知广说如前者。谓於自身及自眷属自村邑中遭苦难者应生厌离。同前所说言修者。现行病也言病法性者。谓病之种习也。死亦准此言由是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>等者。谓由他身眷属村邑等各三种相故便生苦恼言即由此等事者。由於盛衰等事生厌离故能尽苦边故也言於断者。谓能断五观所断净等五法也言我或失念等者。谓此下四句依其别相明观察义言於诸学所有违记等者。与上四句一一相合言本性者。谓<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>时求戒心也言以要言之等者。此中有问。总别观察二种之义显何事耶。故论答云於诸学处等也。谓今学处及加行二法<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>故立二观察也言尸罗浮者。谓若有犯尸罗必復后定生悔言復除障等者。谓由喜悦故能除诸障言如是行相等者。此中有问。诸圣教中所说<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>悦悦意。如是三名有何差别。故论答云先名等也言汝於断减等者。谓由调练滋润心故。能断<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>贪忧。及得出世<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>二法言若如是等者。谓厌离离相故背诸黑品。欣乐相故向诸白品。故论文言由调练心等也言诸相者等者。谓色等尘及生老病男女共成十相言欲等八者。谓欲恚害空国土亲属不死。昔所受境□□□也言欲贪等者。谓不净等五观所治五法名随<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。非五盖也言是故如是等者。谓相等三法一一皆有是苦非圣等五种过失言又应於等者。谓由依心一境性等三种心故。能起六种行相。一一对治前三过患。此六种法皆离外道所立我见等立也言或灯明等者。谓若修不净等前之过患起时。应渐次修火光明等四种<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>也言既取如是等者。谓修不净观者虽能取光明相住不净观。由串习力或净相现时。復应了别青瘀等二十种故言先於一境等者。谓於不净等五观之中。随於一境能繫心。能背净等五种颠倒言又於其中等者。谓於六相中能了知者。乱与不乱自然现前言即於其中等者。谓若净等颠倒起时不随彼念言眾善者。谓眾人中最端正男女等也言即此眾善等者。此喻出阿含经及萨遮尼乾子经。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>固化忧陀近国。炎盛王请佛设眾伎乐已白世尊曰。我今设乐巨有诸餘胜此乐不。世尊告曰。我都不闻。汝所作乐谁辨好恶。王曰。上来作乐亲自见闻。何故不辨。世尊因资立斯喻也言大等生者等。谓眾人杂类集会也言由是能令等者。谓由正品為因故。於五位观中贪心相续等六种果利而生故也言<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>者。止品也言正知俱<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。观品也。此中意显。修五观人一一观中上要须止观双运方名善修言无分别者即止品也言有分别者。即观品也言於趣入时等者。此中意说。前者所观青瘀等相从渐多名之為假。今此真相应观所有自他青瘀从无始来不可知数故名真实言又非修习等者。谓非一遍修青瘀等名观成就。於一切时中不假功用任运能见不净等相故名长时齐。此名為观成相。故论文言齐尔所时等也言眾相不显现中等者。谓此品中净等诸相皆不现故言不令弃捨者。亦不捨於观品故言<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>者。无色等十相也言无分别者。无八种寻思也言寂静者。谓无五随烦恼也言光明俱心者。谓灯光明也言照了俱心者。谓火光明也言明净俱心者。谓日光明也言无闇光明者。谓月光明也言修奢摩他等者。与上四文一一相含言狭小者。谓观一人等名為狭小也言数数等者。与上四文一一相合言於自所爱等者。谓於自所爱身中应当发起必死送至塚间已。便有青瘀等二十相渐次而生起故言数数等者。与上青瘀等一一相合言汝復应於等者。谓四无色蕴皆是苦<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a><a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>故即名观受等三法也言无相者。谓依止品观受心法无色等十相言无分别者。谓无八种寻思故言寂静者。无五随烦恼故言无作用者。谓无造作我故言无思慕者。谓无寻思过故言无躁动者。谓色等不倾动故言离烧恼者。无烦恼者言寂灭乐者。谓证<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>故言行於所缘等者。谓色尘等不扰乱故言四无色蕴等者。谓受相行识念念迁变故言汝应於此等者。与上十文一一相合言无乱者。谓若依蕃本不言无乱但云散乱也。此中意说。由观受等三法散乱失乃能修於受等三法无常等观名无散乱言谓汝等者。谓於受等三境界等<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>转者名不定地也言过去尽灭者。受等皆是落谢法故言失念者。若缘受等三法便失正念故言心乱所生者。三法皆由乱心生故。诸相等三准前而说言增上者。由受等三发生乐等三颠倒故言汝应等者。与前诸文一一相合言如是诸法等者。谓受等三法毕竟皆是誑幻所作等五种相故言汝应等者。与上五句一一相合言汝应於此等者。谓捨乐等所缘境也言秽坐卧具者。谓男女交会处也言恒常者。谓是有学所作言毕竟所作者。是无学所作。此二皆有无间严重二种加行言<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>下劣等者。谓证有学果也言广大圆满者。谓无学位也言无罪乐者。谓出世间乐也言欲乐者。谓欲界乐也言有喜乐者。谓初静虑乐也言无喜乐者。谓第二静虑已上至非非想乐也言其中差别者。谓慈等四观所有差别之相。如下一一解释言谓趣入时者。谓趣入慈观时也言四念住等者。谓受等三能坏乐等三种颠倒名坏缘也言表相者。谓<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>是有表色也言唯身念住者。谓於怨亲等三种身而起念住也言胜解作意者。谓假相作意也言又我於彼等者。若於过去落谢有情不起慈者。不能荡除藏识之中嗔恚种习言无量甚过者。谓过去世中所有怨亲等中起慈悲心过於前假相修也言而非真实者。谓非不是真实之义是真实义故言耶波尼杀曇分者梵语。此云因分不及也言条如前说者。谓止品无散乱品观品。此三门义此中应说。与不净观义无别故。故此不说也言分别取相者。谓初修业人取於四倒流浪<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。取无倒相故得出离生死故言生根本业者。谓生善不善等诸业因故言若於自身等者。谓於自身观苦空无常等也。下外身他身等同此所说言餘如前说者。谓依止品无散乱品观品明缘起相。如前不净观所说言日列者。谓极热时时也言炎炽者。谓时气病也言蔓莚者。谓无断绝火也言细分别者。谓前五界由麤显故易可了知。此识界相是微细故要假行人细分别已方了其相言是相已等者。谓应了知四大身中唯有识蕴种已种住<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>能了境界无我也言喉筒者。谓咽喉孔也。及胀胃也言於十种等者。谓十种所造色。是以所依境故。从此分折能依之识也言甚过於此者。谓此真相过彼假相。谓无限量故也言一处分等者。谓一指节等中尚起无量微尘。岂况全身等也言外风者。谓东西风也言麤穴往来者。谓后口门出入息也言风聚所随者。谓诸毛孔来往诸风随身转故言风聚所摄者。毛孔诸风属彼外轮故言风藏隐者。诸毛孔风难可见故言无量风聚等者。如上所说三种风聚悉皆集在彼行人身故二立喻。故论文言如垢罪绵等也言或於未死等者。谓入灭尽定人无出入息故言遍於一切等者。谓依止品观品无散品修<a href=\"/remen/shuxiguan.html\" class=\"keylink\" target=\"_blank\">数息观</a>时。观无相等止品<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>观出入息新新非故等。如前不净观此中应说。义同故指前文故也言安住炽然等者。谓修不净等五观之时。<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>加行等炽然合修故言恒常修作者。谓於国中无间修故言毕境修作者。谓於果中毕竟修故言由因力者。谓由止观為因故能引强盛身心轻安也言前相者。谓若五观中可一欲成就时。於自顶上犹如石压轻安相现前言能障乐断者。谓贪等烦恼能障乐修不净等中断行也言风大偏增者。由五观中轻安生者。行人身心如风。持行无有沉重也言状如充溢者。谓五观能治之道所生轻安遍满身中故。如囊中所置之物极充满故。状如溢出。如是之时行人身心有踊跃等也言饰后者。谓由轻安势力故。身心饰展不假加行言渐次退灭者。谓前位之中踊跃等心是贪性故。此中亦皆除遣。故论文言寂静行等也言於瑜伽等者。谓从顶重轻安风增充溢已后。便得入於修五观人数也言<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>定者。谓得无漏四静虑中可一少分也言得此作意等者。此中有问。初修业者既具顶重轻安风增充溢等四作意者有何相状。故论答云得此作意等也言谓已获得色界所摄等者。谓色界无漏四定中得少分故也言有力有能等者。谓於不净五观等之中有力有能故。能净能除净相等五种所治故言诸行者。谓净等五倒也言虽少生起等者。如不净观能除可净之境。慈愍等观能治可增等境。当知亦尔言不思慕者。谓不极思慕贪欲等境也言不乐忧虑者。谓不乐於衣食等也。而生忧虑也言俱行诸相者。谓不乐净嗔等诸相也言不极者。与下一一相合</p><p>瑜伽论第三十二卷手记竟第三<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>瑜伽处讫</p><p>言广辨二定者。谓无相灭尽二定也言五<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>者。谓静虑等八定果。谓初禪等八根本地也言五神通者。谓静虑言生差别者。谓生初禪等一一不同故言诸相者。谓离欲色二界欲也。此上七门依世道立果也言观察诸諦者。谓决择分修行人也言如实而通达者。此则是其见道位也言广分别於修者。谓此则是其修</p></div>"
},{
    "title": "瑜伽论手记 第三卷",
    "author": "福慧大师",
    "html": "<div class=\"B1_text\"><p>瑜伽论手记 第三卷</p><p>瑜伽论第三十三卷手记</p><p>第四得果瑜伽处初</p><p>谈述<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>随听</p><p>言广辨二定者。谓<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>灭尽二定也言五<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>者。谓初静虑等八定之果即八定根本地也言诸相者。谓离欲色二界欲也。此上七门依世道立果也言观察诸諦者。谓四决择分<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人也言如实而通者。此则是其见道位也言广分别於修者。此则是其修习位也言究竟為其后者。此则是其无学位也言少分乐断者。谓初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>修七作意乐见修二惑人也言彼初修言一者等者。谓诸异生未断见修二惑故言二不具缚等者。谓诸有学已断见惑分断修惑故也言如是乃至等者。谓从第二静虑已上至无所有处故成六也言又於静虑等者。谓静虑等八定為因而能引发<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>灭尽二定及五神通果。故谓天眼等也言若生者。谓前第六生差别门也言若相者。谓前第七离欲相门也。此中不列第八观察诸諦等餘四门者。出世道<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>摄故言骨锁者。此显五欲犹如枯骨。虽食无味显无厌足也言凝血者。此显多所共有义如市缠害眾比有分言草炬火者。此显恶行因义也。谓执草炬不弃者必烧其手言一分炭火者。此显增长爱欲也。若近火坑不能止渴言毒蛇者。此显智人所远离义也言梦所见者。此显速趣消灭义也言假借<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>具者。此显依託眾缘义也言如树端者。此显放逸危六地义也。谓受欲者必堕恶趣故言如是等者。此八喻义如思所成地密意伽他中已广说故言如是诸欲等。一十六句中。前八句与前八喻一一相合。后八依<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>等显其欲过。如论应知言此作意等者。谓由了相作意為因故生后胜解作意言间杂者。谓间杂修闻思二法成了相作意也言唯用修<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。此显依修所成慧行相缘初静虑所缘意也言即此胜解等者。谓由初中后三胜解為因故成后远离作意。故论文言最初生起等也言俱行作意者。谓断欲界麤相<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>之时。与作意俱也。下五门皆取前前為因成后后法言诸烦恼者。谓初静虑中障碍现行也言麤重者。谓无轻安性故也言从是已后等者。谓由远离作意故修七法為乐生因方成远离。一爱乐於断。二爱乐远离。三於诸断中见胜<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。四触证少分。谓初<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>离生乐故。五於时时间欣乐作意。六於时时间厌离作意。七為欲断除初静虑五盖障。故论文言為欲除遣等也言习近等者。谓初中后三心也。谓於初静虑障中未能断除诸种习故。见净妙色等便起妄。故论文言不能捨等也言诸行者。谓色等诸行也言此由暂时等者。此中有难。如是初静虑定断欲界麤相者。為能顿断久远种子。為当但断现行耶。故论答云此由暂时等也言又於远离等者。此中有问。七作意中何故但明远离等四说有受乐之相。不说餘三耶。答。為了相胜解观察此三作意於散位说无定地故不能生乐言无有间隙者。谓受终已来离生喜乐无间断故言五支者。一寻。二伺。三喜。四乐。五心一境性也言住欲界等者。谓能对治欲界麤相及能<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>初静虑果故也。此中有问。七作意中何故但明言了相作意等者。谓五欲应断初静虑应得言能於所得等者。若不观察者於未得中便起得相名增上慢也言又若了相等者。谓此二法总能随顺厌离五欲及修对治故言如是其等者。若依蕃本云。如是六种作意当知摄入四作意中。此中意说。除加行究竟果作意。餘六皆是因位作意故摄入随顺等四法中也言随所在地等者。谓初静虑也。初静虑麤相。第二静虑净相明观待义。餘三道理准前应知言如前应知者。如了相作意遍於初静虑。胜解等六皆亦遍。故如前所说言初静虑者言復次此中等者。若依蕃本。先标经句。后方解释。此中间其样经句。说者应知言样句者。经云。初静虑者谓离欲恶不善法。有寻有伺离生喜乐。於初静虑具足安住言烦恼欲者。谓男女互相爱染也言事欲者。谓贪财宝等也言相应者离者。谓离五欲相应义也言境界离者。谓五欲境也言烦恼者。谓烦恼欲也言欲者。谓事欲也言由此為因者。谓由加行究竟作意為因故也言由所修习者。谓於加行究竟果成辨故也言得随所乐者。谓出入等得<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>故也言艰难者。谓少治便能与定相应也言梗涩者。梗為略也。谓不假功用故言其心尽夜能正者与随顺等三心一一相合言随所乐欲者。谓於欲界中定成就者能於七日方出其定言復次於有寻等者。若依蕃本。此四静虑一一皆先标其经句。后方解释。谓大小乘经皆说言。第二静虑者谓寻伺寂静故。内等静故。心一趣故。定生喜乐。於第二静虑具足安住言成此彼於等者。经云。言第三静虑者。依此离欲安住於捨有<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>正知有身乐受。诸圣宣说具足捨念及与正知。住身受乐依其无喜。第三静虑具足安住。释义如论言喜者。是第二乱心也言喜相违心者。谓捨受也言色身者。前五色根也言意者。意根也言第三静虑已上等者。此二门显说诸因也言下地者。第二静虑已下也言上地者。是第四静虑已上也言诸圣者。谓佛及圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>等。若於蕃本此中合有离喜及具足安住第三静虑。释义同前故译者不出。说者应知言復次等者。此中有难。何故第四静虑之中契经但说乐断不说对治耶。故论答云此中对治等也。谓断乐对治与前断寻伺及喜对治相似故。所以不说也。此中亦合先标经句。是故经云。言第四静虑者。乐断故。苦断故。先忧喜没。彼於尔时不苦不乐捨念清净。於第四静虑具足安住。释义如下言先所断者。谓喜受忧受苦受也言今所断者。谓第四禪所断乐受也言今依此中等者。此中有问。若第四静虑断乐受者。何故经说第四静虑亦断苦喜忧三耶。故论答云今於此中等也。虽断苦乐名為捨受。由先修於初二三静虑时喜忧断故。此中总说為第四断也言青黄赤白等者。谓欲色二界色也言离欲者。谓厌<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>欲也。若於蕃本亦应先标经句。经云。言空无边处者。色相出过故。有对相灭没故。种种相不作意故。入空无边。於空无边处具足安住言眾多品类者。谓欲色界中青黄等皆因形显和合故。能於无色作其障碍也言由远离等者。於色界中虽无饮食等。亦有宫殿衣服庄严具故。故云等相也言復次若由等者。经云。言识无边处者。超过一切空无边处入识无边。於识无识边处具足安住言復次从识无边处等者。经云。言无所有。超过一切识无边处无所有。於无所有处具足安住也。谓由厌於识无边处為因故。於无所有处发起胜解言或色者。色蕴也言非色者。餘四蕴也言一切有者。谓前诸静虑中有相无相非无相等所有相不可得故。故论文言非有相等也言谓非如无等者。谓此二定一切心中无相定灭前六识。若灭尽定有其二种。若不还人入者灭第七识已下。若阿罗汉入者灭第<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>言蜜中者。如蜂等处於蜜中而难得。出世定亦尔。故蕃本云。其身相状而沉於地也言等者。谓无相定依四静虑能入。若灭尽定依四无色定能入故也言暂时止息等者。谓见想受二法恼乱身心故暂时止息也言所缘者。谓想受二法也言不念作意者。谓不念其想也言有心位者。谓修了想相等六作意时。皆有第六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>故言心不復转者。谓第七加行究竟果位时也言心心法灭者。谓第六意识已下心及所俱不行故言根本者。谓已得四静虑加行究竟果作意也言了知依义者。谓五神通义理也言了知依法者。谓了知五神通因果法也言有时者。谓钝根人於此生中修轻举等十二相故。於后生中方能发起五种神通言有分者。谓利根人此生中修便能发起五通相言此想者。谓由轻举於身发起轻举胜解想故也。下九门义并同此也言熟练者。谓帛练也言广说等者。谓如地水相作餘风火相作变化胜解当知亦尔。故论文言广说等也言或以其身等者。谓由空界相成就相言或於其地等者。此柔软轻举相成就故言或於广大等者。此由身心符顺等成就故言随其所应者。已上四相一一相合。谓由摄受空界相胜解故。於诸墻壁等直过无碍。餘皆准此言一分者。谓从欲界至初静虑中间唯有鬼神等造色不能障碍故言谓由此等者。谓由随念相成就故。能知自身从生至老所作事业麤相门中不失次第。於微细相不能忆念。谓是世道麤细皆能随念。此显宿住智通也言又於种种等者。谓於五趣有情所有善不善等业能感<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>果作用之中。能明了知者。亦名光明相也言常变色者。谓若嗔时触误他人面色有变故言广说乃至等者。谓诸有情随其所有贪等诸行变异相者。名他心智通也言变事通者。谓变地為水等也言化事通者。谓於无中现有故也言胜解者。谓变少為多等也言无諍者。谓无諍<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>也。引发有情故言愿智者。谓广大<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>也。餘文可见言文圣等。此中虽说神境通。五神皆有差别言皆能成办者。谓前五相能成办神境通。餘五皆有成办。如前所说言间杂修。谓世出世道俱修故也言若处者。於三品中空处识处合為下品。餘二中上言由彼诸天等者。此中有问。无四定為有处所為无处所。故论答云无有色形等也。虽无处所。但依作用空识等故在差别名也言即於此中下品等者。谓此五品為因故证五净居天也</p><p>瑜伽论第三十三卷手记竟</p></div>"
},{
    "title": "瑜伽论手记 第四卷",
    "author": "福慧大师",
    "html": "<div class=\"B1_text\"><p>瑜伽论手记 第四卷</p><p>瑜伽论第三十四卷手记</p><p>谈述<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a></p><p>言<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a><a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。谓内外诸行生灭故言苦行者。谓逼迫性故言空行者。违我见故言<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>行者。谓违我见故言因引者。谓业<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>是能生法故言集行者。有多种故言起引者。恒资產故言缘行者。各别助故言灭行者。诸蕴尽故言静行者。生老等三相息故言妙行者。无眾患故言离行者。脱眾灾故言道行者。通行义故言如行者。契正理故言行行者。正趣向故言出行者。能永超故言长时安住者。谓劫末坏已来也言七日经者。谓小乘经名也。彼经广说<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>坏时。七日顿现故也言不背者。谓现见不隐义言不由他缘者。谓<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>故不用他人指示而见也言诸光明者。谓日光明等也言一分位等者。谓八位变异也言杂染者。谓贪等诸烦恼变异故言谓缘乐受等者。谓於三受明变异也言又有会者等者。谓依烦恼立变异也言如是眼识等者。谓於六识明变异也言或人所作者。谓怨家人等而损害故言餘如前说者。谓徵答所以二门如前分位所作门同也言醴水者。谓甘美水。其水如酒能益老病也言殉利者。谓求营等也言餘如前说者。谓徵答同前说故也言彼诸色行等者。谓内外缘生诸行虽不假<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>自然而有。灭坏无常其性微细现量不见。要假比量方乃得见。是故第三比量明也成立生灭义中言谓彼诸行要有剎那等者。谓诸外道执微尘胜性等是<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>义。及内法中一类小乘执内外诸行三剎那六剎那等常安住。谓破如是邪辟诸执。故论文云谓彼诸行等也言非如是住者。谓内外缘生实。若从於微尘胜性等言非如也而生起者。体是常故则无前后。变异生灭而可得故言生已不待灭坏因缘等者。谓内外缘生诸行。生起之时假因託缘方得生起。灭坏之时不假因缘自然灭尽。如有世人以石掷空即假人力。石堕之时不假人功任运堕落。此中道理亦復如是等难中言如是所有变异因缘等者。此中有难。若内外缘生诸行灭尽之时无有因者。如前所说八种变异因缘岂不具其灭坏因耶。故论答云如是所有等也。此中意说。如前所立八种变异是内外缘生变异生起因缘非是灭坏因也。如锤破瓶是碎坏因非灭微尘因。此中道理亦復如是言俱灭坏者。谓内外缘生因之与缘俱灭坏已。然后不相似行方乃生超。是故八种变异因缘是生起因非是灭因。若是灭因者。如盛年相状灭时者之相状不合得有。何故得有。是故当知八种变异是生起因非灭因也言或有诸行等者。此是立之辞。难之意者。虽八种变异因缘是内外缘生诸行生起之因非灭坏因者。此非遍义。何以故。世有一分有為诸行与因俱灭非是生起。如火煎水。焚烧器世与因俱灭非生起故言彼亦因缘等者。谓破前成因喻也。此中意显。火之功用德能煎水。焚烧器世无其尽水等功。是故汝言一分有為与因俱灭不应道理。是故论云不由其火等也言他世者。谓过未二世也言如是一切者。谓上好恶等七种差别也言先有等者。谓因灭果生同剎那故。若<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>先者即因义不成也言三增上者。谓初净信是圣教量。餘二现量比量。如论应知言為者。谓与下四文一一相合言退失者。亦与下四文一一相合。谓退失主性等也言恶作加行者。谓不好藏护也言法性者。谓变异等三行法尔道理必成假故。譬如掷石於空必当堕落。此中道理亦復如是言不意行等者。谓苦受顺入诸苦蕴取入苦行故。故下文云顺苦诸蕴等也言不安稳行者。谓行苦不安稳故也言有漏有取等者。谓能依非苦非乐受也言顺非苦乐等者。谓受所依处也言唯有其见者。谓唯有断常等见无我人等也言自相者。谓地水等各各自相也言爱能引苦等者。谓业烦恼為因故能引三界苦果故也。下三文皆以业烦恼立也言能摄受者。谓爱能受诸苦种子故言招引者。谓因集缘起四法皆能招苦果五趣中也言取因者。谓三爱也言招集者。谓取缘三界有也言上首者。谓生也言生為缘者。谓由生故有老死等也言谓正了知等者。谓爱名烦恼随眠也言所依者。谓五趣蕴也。此爱随眠与五趣蕴為所依故。招集当来起缘法故。烦恼随眠是能成因。集起缘三是所成法言所生缠者。谓下所说后有爱等三种也。此三种缠从前烦恼随眠之所生故。故云彼所生也言三种者。即前烦恼随眠及三种爱也言所知境者。谓苦集灭諦也。由<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>等故能通寻求<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a><a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>过患<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故言四门者。谓道如行出。皆由正见等远离故能得随转言比度者言不同分者。谓上二界也言比度者。谓欲界苦諦下无常与五行而观苦。上二界无变异无常及别离无常。合会无常一分通上界。但有灭坏无常。及法性无常一分外十六种无常及内十五种无常上界亦无。三苦行相中上界但有不安稳行苦也。空无我相同於欲界。集諦中上界无嗔。餘准欲界。灭道二行相亦准欲界而比度之言谓彼所有等者。谓苦集二諦遍上界故言一切种者。上界亦有不动行种言一切时者。谓三世时也言如是法者。即苦集法也言如是理者。谓苦集<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>理也言如是住者。谓苦集二諦是染性故言所有道者。八圣道中上界无正命正业。餘同欲界言若观行者等者。谓於欲界十六观行得决定故言復於诸諦等者。谓於上二界诸諦中起胜解也言所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>者。谓前无常等七种无边际法也言更无有餘等者。谓圣道未现前已表更无有法而能息灭生死作方便也言復於如是等者。谓胜解作意行者能於三有四生之中深厌怖故。即苦集二諦也言及於等者。即灭道二諦也言<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>一行者。谓灭道二諦各四行中随於一中心愿乐故言彼於长夜等者。谓从无始时来资长积集五尘种子故。虽乐涅槃心有退转言作是思非等者。即是我慢也言当復<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>者。若不对治当更流转。由我对治故更不流转。如是等十二种法唯我所有。餘皆无者是名我慢长也言以慧通达者。谓苦类等智也言外所知境者。谓五及十二种我慢也言随所生起等者。若彼行人观上界四諦时。如前所说障碍诸法随有生起。由对治力寻便谢灭。对治之心无间生起言第二法者。谓有二种。一蕴法。二我法捨故言妙慧者。谓能观十六行相之慧也言正智得生者。谓类智得生也言妙是行等者。谓三界四諦下共有八忍。胜解作意行者<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>下品八忍<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>之时。以三昧力发生人空无分别智。焚烧无始烦恼业薪。智火耎相初现前故名耎位也。顶忍二位依中上忍随应说之。此中不立八智者。八智是无间道是因位故。此中不别。八忍是<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>道是果位故。此中明也言能缘者。谓人空智也言所缘者。谓四諦十六行相言观心所有加行者。谓四諦十六行相有分别影像也言住无加行者。谓四諦十六行无分别影像也言非灭者。业烦恼种犹未断故言而非<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>者。谓有无分别奢摩他影像现前故言非美睡眠等者。谓彼行者住无间定时。非周蜜蜂三昧惛醉。唯有分明智观双运道现前故言从此无间等者。谓世第一法无间生起远离作意也言起内作意者。谓远离作意也言如其次第者。谓先观欲界。次观上二界十六行相也言现见等者。谓欲界四諦也言非现见者。谓上二界也言无分别者。谓十六行相无分别影像也言决定智者。谓现见智也言此永断故等者。若於世道中离欲界九品惑尽者。今於此中入諦现观得不还果言彼以前说等者。谓如前说於世道中离欲之人有十二种。如前第七门说相状。此亦如是。若尔与世道离欲有何差别。故论答云然於此中等也。谓世道者虽生<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。从彼涅槃还生欲界。若出世道从彼涅槃便取无学。不復还来生於欲界。有此差别也言若先倍离等者。谓欲界九品惑中断前六品故為位也言能知智者。谓能缘人空之智与所缘十六行相和合相对故也言此亦成就等者。虽世道中有十二种相状。此亦有十八种相状。超世道故也言虽法智者。谓了人空智言非断智者。谓预流人离断见道智也言非常智者。谓预流人离常见也言得缘生智者。谓了缘生横如串化无实我也言唯自法见等者。谓四諦法随次配释言四证净者。即四净也。谓<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>及圣所爱惑无碍也言第八有者。谓预流人极钝根者唯有七生并证无学故无第八也言如所得道者。谓四諦十六行相也言然有差别者。谓预流人若起烦恼。由上中下三品对治方能除遣。此一来人若由失念烦恼起时。微劣对治便能除遣。故差别也言上品者。谓於上上五欲境界中起微劣贪也。若初果已前人於下品境界中便起下品贪等。此亦是其差别之相也言一切道者。谓一来乃至无学向一切皆由摄乐远离加行究竟三作意故。於所得道而正修习言谓由定地等者。谓出世道所起之智是有為故。故所修善亦名有為言增长者。初心也。言无间者。中心也言殷重者。后心也。由此三心令所修习所有善法而会合故言殊胜善法者。谓三解六<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>皆由修习二十贤善定之所得故○言安住如前者。谓安住等九种行如修所瑜伽处已说也言修亦如前等者。谓有四种修相亦修瑜伽处说也言尽智者。无间道言无生智者。谓解脱道也言彼於尔时等者。谓证金刚喻定时也言证自在义者。谓如诸佛证自义故言空住等者。谓空解解门等随次配之言慈悲等者。谓於世道修作梵住因故言关键者。谓由业烦恼关键故。令诸有情不能趣入。涅槃云城言深坑者。谓生死深坑也言伊师迦去此云篱[竺-二+(狦-(狂-王))]。谓三界业烦恼也言高慢者。谓我慢也言五支者。谓杀等五也言六支者。谓密护根门等也。如前所说言四所依者。谓依智不依识。依义不依语。依了义经不依不了义经。依法不依人言身行倚息者。谓与轻安相应也言已亲近者。谓与圣道相应也言无上丈夫者。谓小乘中佛是罗汉故名无上也言其心等者。谓罗汉心犹如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>及净水等。所有香嗅不能倾动故。蕃本云。其心如空。假使涂其栴檀及与斧凿。於此二中其心平等。餘文可见言此中都无者。如生死无有流转。於涅槃中亦不贪著言犹如等者。谓一切法皆依名句文建立。彼四果皆依种姓等四瑜伽建立。故喻名句等也言独觉地者。谓种姓<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a><a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>得果四瑜伽处与声闻同。何故此中列五相耶。答。谓谓住及行并是得瑜伽处故与上无别言不爱憒闹者。谓修自利行也言乐寂静者。谓不乐利他也言依说<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>及於少思务者。与自利及不利他随次相合言希愿无师者。由慢行故也言无敌者。由中根故也。谓独成<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>时无诸天魔為怨敌故也言经百劫者。谓於百大却中一一皆值诸佛出世修六善巧故言亲近乘事者。初心也言成熟相续及专心者。中后心也言顺决择等者。此中有问。四决择分合有四种。何故此中但说三耶。答。由世第一与证现观预流之果极邻近故。此未证得言得<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>果者。谓第二第三果也言復有一类等者。百劫<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>同前所说言復有类等者。谓利根故顿证无学。此由中下故渐证无学。故论文言或证法现观等也言麟角喻者。此显独一无侣义也后言部行喻者。此显有部儻义。谓一类修独觉者犹如群鸟。而修习故方<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>故也。此位独觉修之时。乐与眾人杂住修故。得果之时或十或百乃至千万一时出现。於虚空中现十八变化利有情也言乐甚深者。谓乐观顺流逆流也言乐观察者。谓观缘起缘性也言安住等者。谓乐三解脱门也言独胜者。谓即独觉也言所餘等者。住虽有异。所观之相与前无别故言谓一切等者。谓三种独觉入村邑时。一善护身威仪济正护恶剎等。二善护餘根等不随色等故。三善护意根谓住<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>故言下劣等者。谓外道等下劣有情边若不广说现神变必不发心。施衣食等。彼由施故於现世中获大<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a></p><p>瑜伽论第三十四卷手记竟</p></div>"
}]