[{
    "title": "瑜伽师地论分门记 第2801部",
    "author": "法成",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/yuqieshidilun/yuanwen.html\" class=\"keylink\" target=\"_blank\">瑜伽师地论</a>分门记</p><p>瑜伽师地开释分门记五识身相应地等前十二地同卷</p><p>最胜子菩萨。将释此论先立三门之义方释论正文。言三门义者。一归敬等门。有六行颂分為五门。一归敬三尊。谓初一颂。二叹说门。谓次一行颂。三讚造论门。谓次两行颂。四讚论功门。谓次一行颂。五造论意门。谓次一行颂</p><p>第一所為门分十。一久住并益门。二隐不隐门。三破无见有见门。四成就大小门。五离倒生信门。六利略广门。七立正破邪门。八破增损门。九不相违有差别门。十位果差别门</p><p>第三所因门分三。一明教初兴由。二明二宗起由分二。一明胜义皆空宗兴由。二明<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a><a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>兴由分二。一明造论因。二叹论功。三明教所被分二。一大。二小</p><p>释论正文分二。一释论题目。二释论正文</p><p>初释论题分四。一释瑜伽两字分三。一教瑜伽分三。一略标释。二引诸经论广释分四。一依四种道理明教瑜伽义。二依不相应行。三依杂染净。四依究竟清净。三总结二行瑜伽分三。一略标释。二引诸经论广释分十六。一依正修诸行明瑜伽义。二依三十七品。三依<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>。四依三摩地。五依四法。六依九道。七依对治道。八依无颠倒智。九依方便善巧。十依缘起观。十一依八圣道。十二依<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>。十三依世出世道。十四依空作意。十五依无分别空。十六依慧悲双转。三总结三果瑜伽分三。一略标释。二引诸经论广释分二。一总标。二别释分八。一依力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>等广大<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>明果瑜伽。二依无住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。三依无分别<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。四依佛地功德。五依三乘果德。六依三身<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。七依有為无為诸功德聚。八依三乘观行。三总结</p><p>第二释师义分二。一依闻思等因位明师义。二依无学果明师义</p><p>第三释地义分三。一总标。二别释分五。皆有法喻。如论应知。一依境界。二依所依。三依所行。四依所摄。五依十七地。三总结</p><p>第四释论义分三。一总标。二别释分三。此三皆有法喻。一依有学无学地。二依无倒说。三依增长义。三总结</p><p>第二释论正文大门分五。一本地分。谓略广分别十七地义。二摄决择分。谓略摄决择十七地中深隐要义。三摄释分。谓略摄解释诸经仪则。四摄异门分。谓略摄经中所有诸法名义差别。五摄事分。谓略摄<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>眾要事义</p><p>第一释本地分大门分二。一略释。二广解。初文分五。一总问。二总答。三徵问。四以颂略答。五长行列名分十七。谓从五识身相应地至无餘依地。初释五识身相应地名义。释论分四。一辩识。二解身。三释相应。四说地义二释意地名义。释论十一门分别如释应知三四五释有寻伺等三地名义。释论四门分别如释应知六释三多摩呬多地名义。释论四门分别如释应知第七释非三摩呬多地名义。分四同前第八九释有心<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>地名义。释论五门分别如释应知第十十一十二释<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>三地名义。释论四门分别如释应知第十三释声闻地名义。释论分二。一释声闻两字。二释地义第十四释独觉地名义。释论分二。一明独觉两字。二明地义第十五释菩萨地名义。释论分二。一释菩萨两字。二明地义第十六释有餘依地名义。释论四门分别如释应知第十七释无餘依地名义。释论五门分别如释应知第四总结</p><p>第二广解分十七。谓始从五识身相应地乃至无餘依地。第一释五识身相应地。大门分三。一略释。二广解。三明五识生起缘等初略释分二。一总问总答分三。一问。二答。三结。二别问别答分二。一问。二答</p><p>第二广解分五。一明眼识二明耳识。三明鼻识。四明舌识。五明身识</p><p>初明眼识分五一明<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>分二。一问。二答第二明所依分二。一标。二释分三。一明三依分三。一明俱有依分二。一标。二释。二明等无简依分二。一标。二释。三明种子依分二。一标。二释。二明料简分三。一标。二列名。三释。三解释眼等三分三。一明眼。二明等无简。三明种子识第三明所缘分三。一略标。二列名。三解释分五。一广明三色分三。一明显色分二。一标。二列名。二明形色分二。一标。二列名。三明表色分二。一标。二列名。分五中二略释三色分三。一略明显色分二。一标。二释。二略明形色分二。一标。二释。三略明表色分二。一标。二释分三。一依生灭相续。二依有简无简等。三依变异。分五中三明三色差别分三。一明显色差别分二。一标。二释。二明形色差别分二。一标。二释。三明表色差别分二。一标。二释。分五中四明二识所缘差别分二。一眼识所缘。二<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>所缘。分五中五明总摄所缘分二。一标。二释分四。一好。二恶。三俱异。四似色第四明助伴分二。一总标。二别释分二。一依五遍行等法分二。一标。二释。二料简诸法分二。一明非一一转。二明各从自种生第五明作业分二。一总标。二别释分六。如论应知</p><p>第二释耳识分五一明自性分二。一问。二答第二明所依分二。一总标。二别释分二。一明三依分三。一明俱有依分二。一标。二释。二明等无简依分二。一标。二释。三明种子依分二。一标。二释。二释耳等三法分二。一释耳。二例餘意种二法第三明所缘分三。一总标。二略答。三解释分五。一列名分二。一标。二陈数有十七如论。二明声所起因分三。一标。二列名。三解释。三明总摄分二。一标。二释。四明异门分二。一标。二释。五明二识所缘分二。一耳识所缘。二意识所缘第四五合明助伴及作业例同依前</p><p>第三释鼻识分五一明自性分二。一问。二答第二明所依分二。一总标。二释分二。一明三依分三。一俱有依分二。一标。二释。二等无间依分二。一标。二释。三种子依分二。一标。二释。二释鼻等三法分二。一明鼻根。二例餘意种第三明所缘分三。一标。二略答。三解释分三。一列名分二。一标。二陈数。二明异门。三明二识所缘分二。一鼻识所缘。二意识所缘第四五合明助伴及作业例同於前</p><p>第四释舌识分五一明自性分二。一问。二答第二明所依分二。一标。二释分二。一明三依分三。一俱有依分二。一标。二释。二等无间依分二。一标。二释。三种子依分二。一标。二释。二明舌等三法分二。一明舌根二例餘意种第三明所缘分三。一标。二略答。三解释分三。一列名分二。一标。二陈数。二明异名。三明二识所缘分二。一舌识所缘。二意识所缘第四五合明助伴及作业例同於前</p><p>第五释身识分五一明自性分二。一问。二答第二明所依分二。一标。二释分二。一明三依分三。一俱有依分二。一标。二释。二等无间依分二。一标。二释。三种子依分二。一标。二释。二明身等三法分二。一明身根。二例餘意种第三明所缘分三。一标。二略答。三解释分四。一列名分二。一标。二陈数。二明总摄分二。一标。二答。三明异名。四明二识所缘分二。一身识所缘。二意识所缘第四五合明助伴及作业例同於前</p><p>大门第三明五识生起缘等分三一明五识生缘分二。一明眼识生缘分二。一明闕缘。二明具缘。二明例餘四识第二明五识染净生起次第分二。一明眼识染净次第分二。一明三心生起次第分三。一标。二列名。三解释分二。一释三心。二明染净。二明眼识善不善分二。一明随意等<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。二明二识相续转。第二例餘四识第三明依等四法譬喻有二异门。如论应知</p><p>第二广解中分十七第二释意地大门分三。一略释。二广解。三摄相初略释分三。一略问。二略答。三略释</p><p>大门第二广解分五一明自性分三。一问。二略答。三解释分三。一明心。二明意。三明识</p><p>第二明所依分二。一标。二释分二。一明等无间依分二。一标。二释。二明种子依分二。一标。二释</p><p>第三明所缘分二。一标。二释</p><p>第四明助伴分四。一标。二列名分六。一五遍行。二五别境。三十一善。四六根本<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。五二十二随烦恼。六四不定。三总结。四料简分八。一同所缘。二不同行相一时俱有。三一一转。四从自种生。五更互相应。六有相。七有所缘。八有所依</p><p>第五明作业分二。一总标。二别释分二。一明共业分六。一了自境。二了自共相。三了三世。四了剎那相续。五发净不净业。六取爱非爱果等二明不共业分三。一总标。二列名。三解释分十五</p><p>一明分别所缘作业相分五。一总问。二略答。三列名。四别释分七。一明有相分别分二。一标。二释。二明<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>分别分二。一标。二释。三明任运分别分二。一标。二释。四明寻求分别分二。一标。二释。五明伺察分别分二。一标。二释。六明染污分别分二。一标。二释分四。一依三世。二依三觉。三依根本烦恼。四依随烦恼。七明不染污分别分二。一标。二释分四。一依善无记。二依出离三觉。三依十一善。四依三无记。第五总结第二明审虑所缘作业相分四。一问。二略答。三解释分三。一明如理所引分三。一标。二释分二。一依非真实有。二依真实有分三。一依施等。二依法住智。三依出世智。三结。二明不如理所引。三明非如理非不如理所引分二。一标。二释。四总结第三明醉作业相分三。一问。二答有四<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>如论。三结第四明狂作业相分三。一问。二答有五因缘如论。三结第五明梦作业相分三。一问。二答有十因缘如论。三结第六明觉作业相分三。一问。二答有三因缘如论。三结第七明闷作业相分三。一问。二答有五因缘如论。三结第八明醒作业相分二。一问。二答第九明发身语业作业相分三。一问。二答有四因缘如论。三结第十明离欲作业相分三。一问。二答有四因缘如论。三结第十一明离欲退作业相分三。一问。二答有五因缘如论。三结第十二明断善根作业相分四。一问。二答有五因缘如论。三结。四答难第十三明续善根作业相分三。一问。二答有四因缘如论。三结第十四十五合意识捨寿及受生作业相。大门分二。一明内有情<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>捨寿及受生门。二明外器世界坏成门。初门分二。一明捨寿门。二明受生门</p><p>初捨寿门分三。一总问。二略答。三广解分九一明捨寿量分三。一总标。二列名分二。一列寿尽等三名。二列善不善等三名。三别释分六。一明寿尽死相分三。一问。二答。三结。二明福尽死相分二。一问。二答。三明不避不平等死相分五。一总问。二略答。三徵问。四答列名分九如论。五结。四明<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>死相分二。一问。二答分二。一立因。二显果分二。一明可忆念相。二明不可忆念相分三。一立正义。二徵。三答所以。五明不善心死相分二。一总问。二广答分二。一答不善死正义分二。一立因。二显果。二答善不善死相分二。一依受苦不受苦明相分二。一明善死相。二明不善死相。二依见乱不见乱明相分二。一明善死相。二明不善死相。六明无记心死相分二。一问。二答分二。一立因。二显果分九中第二明忆念不忆念相分二。一总标。二别释分二。一明偏强忆念相。二明平等忆念相分九中第三明捨寿因分三。一总标。二别释分二。一明戏论因。二明善不善因。三结分九中第四捨寿善不善相分三。一明行不善业捨寿相分二。一总标。二引经证成。二明<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>业捨寿相分二。一立正义。二明差别。三明不善差别相分二。一明上品不善捨寿相。二明中品不善捨寿相分九中第五明中有因分三。一明异生中有因分二。一立因。二显果。二明初二果人中有相分四。一标。二释。三立喻。四法合。三明不还人中有相分九中第六明断末魔差别相分二。一略释。二广解分三。一总标。二列名分二如论。三别释分二。一明重相。二明轻相分二一依善业明轻相。二依北洲明轻相分九中第七明中有根具不具相分二。一依<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>明根具相。二依欲界明根具不具相分九中第八明调善不调善死相分二。一依清净<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>明调善死相。二依不清净及不解脱明不调善死相分九中第九明识捨身相分三。一明不善人识捨身相。二明行善人识捨身相。三总结</p><p>大门分二中第二明受生相门分二。一总问。二广答分九</p><p>一明中有相分十二。一明受中有<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>相分三。一立因分二如论。二显果。三立喻二明中有根圆不圆义三明中有色相分二。一明不善业中有色相。二明行善中有色相四明中有是谁缘境五明中有不贪故自义分二。一明不贪故身义分二。一标。二释。二明贪后身义分二。一立因。二显果六明中有眼所缘境分三。一明无障碍相分二。一明正义。二立喻。二明见同类中有有情义。三明见自生处相七明中有趣向相分三。一明造不善业中有趣向相。二明生天中有趣向相。三明生人中有趣向相八明中有住限量分五。一明未得生缘量。二明得生缘量。三明极七日量。四明七七日量。五明决定得受生义九明中有业转不转相分二。一明不转义。二明转义十明中有异名分二。一总标。二别释分四如论十一依界明中有有无义十二明中有受恶趣及善趣身义分三。一明趣那落迦中有相分五。一立因。二明受生相。三明诸根具相。四明受果。五明不生因。二明往鬼趣中有相分二。一标。二释。三明往傍生趣等中有相分二。一立因。二显果</p><p>二广答分九中第二明受生三<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>等分三一明三处现前相分二。一总标。二列释分三如论二明三种无障相分三。一总标。二列名分三如论。三别释分三。一明產处过患相分三。一总问。二广答分十。一答產处风逼迫过。二答產处热逼迫过。三答產处癊逼迫过。四答產处有如麻过。五答產处有如麦过。六答其门如车形过。七答其门如螺形过。八答其门有曲过。九答其门有秽过。十答其门有浊过三总结。二明种子过患相分三。一总问。二广答分五如论。三总结。三明宿业过患相分三。一总问。二广答分七如论。三总结第三明总结</p><p>二广答分九中第三明入胎相分二。一总标。二别释分四一明颠倒想分二。一标。二释分四中二明男女差别相分五。一明為女中有於父起贪心相。二明為男中有於母起贪心相。三明為女中有於母起远去相。四明為男中有於父起远离相。五明受生因由分四中三明无福有福受生差别分二。一明无福受生相分二。一立因。二显果分二一闻声。二见色二明有福受生相分二。一立因。二显果分二。一明闻声差别。二明见色差别分四中四明取识续生义分三。一总标略义。二别释差别分二。一问。二答分四。一明藏识任持根大种相。二明诸根大种俱生相分三。一立因。二显果。三结。三明渐次成诸根相分三。一明眼等诸根成相分二。一立因。二显果。二明诸根依处成相分二。一立因。二显果。三总结。四明互相安危相分四。一明依託义。二明损益义。三总结。四明肉心义。第三明总结</p><p>二广答分九中第四明种子具不具差别相分十二一依般涅槃法明种子有无差别分二。一明具相。二明不具相二依界明种子分二。一总标。二别释分三如论三依四大种明种子义分二。一立正义。二明作业分四如论四依二因明种子义分二。一明能生自体戏论因。二明能生族姓等果善不善因五依凡圣明种子义分二。一明凡种子。二明圣种子六依三受明种子义分四。一依异熟所摄受明种子。二依异熟所生受明种子。三依境界生受明种子。四依<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>起受明种子七依所熏明种子义八依因果受用未受用明种子义分四。一明已与果种子分二。一立因。二显果。二明未与果种子分五。一标。二释。三答难。四明已受果义。五明未受果义三明不定种子。四总结九依染净明种子义分二。一明染种。二明净种十依麤重等明种子义分二。一明烦恼所摄种子。二明异熟及无记所摄种子十一依信等十一善法明种子义分四。一立正义。二徵。三答所以。四结引证十二依异名明种子义分四。一总标。二列名分十一如论。三总结。四明转依胜利分二。一明捨一切染污法种子胜利。二明转一切善及无记法种子闕缘胜利</p><p>二广答分九中第五明住胎时等义分三一明住胎时限分三。一立正义。二引证。三明经意趣分三。一明极满足相。二明<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>非极满足相。三明不满足相二明住胎食相三分别住胎八位差别分四。一总标。二徵问。三列名分八如论。四别释分八如论</p><p>二广答分九中第六明胎藏转变义分二一略释分二。一立因分二如论。二显果分四如论二广解分四。一明髮变异相分二。一标。二释分三如论。二明色变异相分二。一标。二释分四如论。三明皮变异相分二。一标。二释分二如论。四明支分变异相分二。一标。二释分三如论</p><p>二广答分九中第七明住胎时男女差别等义分三。一明男女任胎差别相。二明母受苦恼相。三明出胎时分</p><p>二广答分九中第八明诸根受境缘等义分六一明受六尘相分二。一标。二释二明学言说相分二。一标。二释三明耽著家室相分二。一标。二释四明学工巧相分二。一标。二释五明受用境界相分二。一标。二释六明受苦乐相分二。一标。二释分二。一立因分二如论。二显果分二。一明染品果。二明净品果</p><p>二广答分九中第九明种子等四缘之义分七一总标二列名分四如论三别释分四。一明种子所引相。二明饮食资养相。三明随遂守护相。四随学造作身语业相分三。一标。二释。三结四明不<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>过失五明修行胜利分二。一立因。二显果六明难悟相分二。一标。二释分八如论七明总结</p><p>第二明外器世间坏成相分三。一总问。二略答。三广解分二。一明坏相。二明成相</p><p>初明坏相分三。一明所坏差别。二明能坏性相。三总结一明所坏差别分六。一立因。二显果。三徵。四答所以。五明器世成因分二。一立因。二显果。六明有情时无定相分三。一立正义。二徵。三答所以</p><p>坏相分三中第二明能坏性相分二。一总标。二别释分六一明坏之限量分三一明灾坏限分三。一明火灾坏限。二明水灾坏限。三明风灾坏限二明第四静虑无坏因分二。一标。二释三明三灾坏顶分二。一标。二释分三。一明火灾顶。二明水灾顶。三明风灾顶二别释分六中第二明坏空成住相分四如论</p><p>二别释分六中第三明立劫意趣分二。一依八十中劫明立劫意。二依初静虑三天寿量明立劫意趣分二。一标。二释分三如论</p><p>二别释分六中第四明火灾坏相分二。一明中劫相。二明坏相一明中劫相分三。一总问。二略答分五。一明寿量无限义。二明寿量有限时。三明寿量减相。四明寿增因。五总结。三广解分三。一总标。二列名分三如论。三别释分三一明俭灾相分二。一总标。二别释分四。一明兴起时。二明俭相分五。一难得义。二明谨会法。三明守护相。四明无力五总结。三明时限。四明增寿等因分三中二明病灾相分四。一明兴起时。二明病相。三明病息时限。四明寿增等因分三中三明刀灾相分六。一明兴起时。二明刀相。三息时。四明三衰损相分三。一总标。二列名分三如论。三别释分三。一明寿量衰损分二。一标。二释。二明依止衰损分二。一标。二释。三明资具衰损分二。一标。二释分四如论。五明增寿因。六明寿量等增长因分二。一立因。二显果分四如论明火劫分二中第二明坏相分二。一明坏有情世间相。二明坏器世间相一明坏有情世间相分四。一明坏<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>有情。二例明傍生鬼趣有情。三明坏人趣有情分三。一立因。二显果。三结。四例明坏天趣有情二明坏器世间相分六。一明不可得义分四。一明有情不可得。二明资具不可得。三明天雨不可得。四明药草等不可得。二明能烧之相分二。一明此日轮热增大义分二。一立因。二显果。二明六日出因分三。一立因分二如论。二显果。三明作用。三明所烧相分二。一总问。二广答分六如论。四明略义分二。一总标。二别释分三如论。五明影不可得义。六明坏住劫数分二。一明坏限。二明住限</p><p>二别释分六中第五明水灾坏相分二。一总问。二广答分五。一答因。二答果。三立喻。四明俱没相。五明住限</p><p>二别释分六中第六明风灾坏相分二。一总问。二广答分五。一答因。二答果。三立喻。四明俱波相分三。一立正义二徵。三答所以。五明住限</p><p>初明坏分三中第三明总结</p><p>三广解分二中第二明外器世间成相之义分三。一总问。二略答分二。一立因。二显果。三别释分十八</p><p>一明第三静虑已下色天成立相分二一略释分二。一明第三静虑器世成相。二例明第二及初静虑器世成相二广解分三。一明第三静虑器世成相分三。一立因。二显果。三明下餘器渐次成相。二明第二静虑器世成相。三明初静虑器世成相分二。一略释分二。一立因。二显果。二广解分二。一明大梵生相。二明餘天生相分三。一明初思愿。二立生因。三显果</p><p>分十八中第二明欲界四空居天器世成立相分四。一立生起。二明成相。三立喻。四明四空居天生之因由</p><p>分十八中第三明地居诸天所依上从妙高下至铁围成立相分五一明风轮成相分三。一立因。二显果。三明业用分二。一标。二释二明水轮成相分二。一立因。二显果三明地轮成相分三。一立因。二显果。三明业相四明诸山成相分二。一立因分三如论。二显果分三。一明上品果分三。一立因。二显果。三明体性分二。一标。二释。二明中品果分五。一总标。二列名分七如论。三释名。四明妙高山量。五明七金山量。三明下品果分三。一总标。二别释分三如论。三明轮围山住处及量五明非天等四趣住处成相分四。一明非天住处成相。二明大雪等成相。三明四地狱成相四明鬼傍生住处成相</p><p>分十八中第四明四洲成立相分四。一总标。二列名分四如论。三显形分四如论。四量分四如论</p><p>分十八中第五明内外海成立相分二一明内海分二。一明海体。二明所居有情分二。一明龙分四。一总标。二列名分八如论。三明作业。四明种类分二。一标。二释分四如论。二明妙翅鸟第二明外海</p><p>分十八中第六明。坚手神等住处成立相分四。一立住处。二明住处量。三明能住有情分四如论。四明四大峰能住有情分二。一明住处分二。一明处所。二明量二明能住有情分二。一标。二释</p><p>分十八中第七明四大王住处成立相分二一明君住处分二。一明所居处分四如论。二明能居有情分四如论二明诸臣住处</p><p>分十八中第八明善住龙王住处成立相分六。一明住处相。二明能住有情。三明作业。四明游行处。五明眷属。六明彼食</p><p>分十八中第九明四大河成立相分二一明出处分三。一明其量。二明功德。三明端严二明所出分二。一标。二列名分四如论</p><p>分十八中第十明顶天住处成立相分三。一明君住处。二明臣住处。三明妙高四宝成相分二。一标。二释分四如论</p><p>分十八中第十一明轮王道成立相分三。一明体性。二明没量。三明减时</p><p>分十八中第十二明妙翅鸟王住处成立相分二。一明住之处所。二明能住有情</p><p>分十八中第十三明诸小渚成立相分二。一明总相住处。二明别相住处</p><p>分十八中第十四明劫初人住处成立相分八一明来处分二。一立因。二显果二明业差别分二。一明欲界摄相。二明非餘时义三立名四明功德五明住处。六明饮食分五。一明增相。二明减相。三明轨受相。四明好恶色生因。五明食没因由七明男女差别因由分五。一立因。二显果分二如论。三明起恶业。四明他轻相。五明初起屋因由八明立四姓因由分二。一明王种起由分二。一立因。二显果。二例明餘三姓兴起因由</p><p>分十八中第十五明日月星宿成立相分二一略释分二。一立因。二显果二广解分九。一明日月量分二如论。二明日月自性分二如论。三明迟速。四明作业分六如论。五明游行量。六明日行远近分二。一标。二释分三如论。七明月亏盈因由。八明月影因由。九明星宿量分三如论</p><p>分十八中第十六明死王兴之因由分四一明死王生由分二。一立因。二显果二明眷属生相三明害具起相分二。一标。二释四明有情生相</p><p>分十八中第十七明坏限及小千等成立相分四一明大千界俱成坏相二分别三千界相分二。一总标。二别释分三。一明小千界分二。一标。二释。二明中千界分二。一标。二释。三明大千界分二。一标。二释三总结分三。一立正义。二立喻。三法合四明化主</p><p>分十八中第十八明五趣等二十四可得事成立相分三。一立生起因。二列名分二十四如论。三别释分二十一明五趣可得相分二。一明那落迦分二。一问。二答。二例明餘四趣二释四生分四。一卵生分二。总问总答。别问别答。餘三准上。二胎生。三湿生。四化生三释六依持分二。一问。二答。分六。一建立依分三。一标。二释。三结。餘五准上。二藏覆依。三丰稔依。四安稳依。五日月依。六食依四释七摄受事分二。一问。二答。分七如论</p><p>五释十资身具分二。一问。二答。分十如论</p><p>六释八数随行分二。一问。二答。分八如论</p><p>七释三世事分二。一问。二答。分三如论八释三语言分二。一问。二答。分二。一列名分三如论。二别释分三。一释法言。二释非法言。三释餘言九释二十二种发愤分二。一问。二答。分二十二如论十释六十二种有情之类分二。一问。二答。分六十二如论十一释八位分三。初问。次列名。后别释。分八论文自显十二释四种入胎分三。初问。次列名。后释。分四如论十三释四威仪。其义易了故此不明十四释六种活命分二。一问。二答。分六如论十五释六种护守分二。一问。二答。分六如论。十六释七种苦分二。一问。二答。分七如论十七释七慢分二。一问。二答。分七如论十八释七种娇分二。一问。二答。分七如论十九释四种言说分三。初问。次略答。后别释。分四论文自明二十释眾多言说句分三。初问。次略释。后别释</p><p>此眾多言说句。谓诸菩萨化利有情故建立也。大门分二。一摄一切法门。二化利有情门分二。一外道。二所餘化外道分六。一外道所有作用自他等邪所繫者显非真实。二听许功德及其世法令不贪著。三於坚妙智等所有一切顺解脱分劝<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>得。四制及过失顺世之法退捨不示不授持等劝令远离。五七例之句若不善解言论不明而有讹机教令善解。六显决定义。十一.十二.二.六.七.十五句随次配释第二所餘分二。一在家。二<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>。化利在家分三。一显加行作业。二明劬劳营求。三亦营求过失。十二.五.十二句随次配释。二化出家分三。一增上戒学。二增上定学。三增上慧字。以九.二十二.二十二句随次配释。又菩萨化利在家更立三十三句。此分為三。一显营求过。二明此生过。三示他世过。以十五.十八句随次配释</p><p>第三明意地摄相大门分三。一总标。二解释。三总结。解释分九。一明色聚集。二明相应品。三明世相。四明四相。五明缘相。六明三性相。七明差别相。八明善巧相。九明九事相初明色聚集分三。一标。二广释。三结广释分二。一略问略答分三。一标。二释。三结。有五问五答。论文自明。二广释分三一破微尘分二。一破尘分四。一明生起因。二答难。三徵。四答结。二明不相离分三。一释二不相离。二喻显。三明所造住因分二。一住因。二大义二明摄色集分三。一约相摄。二约界摄。三约不相离摄。第一约相摄分二。一标。二分别分四。一根。二处。三五尘。四建立。第二约界文可见。第三约不相离摄分四。一标。二徵。三释。四结。释分四。有四异门。论文自显。四结文亦可见三杂明声等聚之相分八一明声聚相分二。一界有。二相有二分别分二。一标。二释分二。一相续。二不相续三明空界分三。一标。二释分三。一明闇色。二释明色。三明异门四明色聚小大因分三。一标。二释。三结五明经中所说四大性相分二。一明地大坚等相分二。一标。二释有二异门。初门分六。一明坚。二明坚摄。三明近摄。四明执受。五非近摄。六无执受。第二异门文可见。二例餘<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>六明一切色聚悉有能造性分二。一标。二释七明造色三种流转分二。一标。二释分三。一释长养二释等流。三释异熟八略摄色聚之相分二。一标。二释</p><p>大门第二明相应品分二。一总标。二解释分七一依地等建立位分五。论文自显二明心及心所生起缘分三。一标。二释。三结。释分三。一释根不坏分二。一问。二答。二释境现前分三。一问。二答。三明障分二。一标。二释。三释能生作意分二。一问。二答分二。一标。二释分四。一释欲力分二。一问。二答。二释念力分二。问答。三释境力分二。问答。四释数习力分二。问答。三结文可见三明心及心所云何作染净理趣之相分二。一标。二释分三。一明意识云何分别境分三。一明生。二明乱不乱。三分别境。二明云何染净生起分二。一明染净因二明差别分三。一明意功能。二徵。三显因由。三结四明建立一剎相分二。一标分二。一问。二答。二释分二。一问。二答分三。一依一境二明相似不相似。三明缘境差别分二。一过去二现在五明心及心所作用分三。一总明诸识作用。二明五遍行用。三总结六明遍行别境体相分二。一辨遍行体相有五问答。论文自明。二释别境体相有五问答。论文自显七明遍行别境所作之业分二。一明遍行作业有五问答。论文自显。二明别境作业有五问答。论文自明</p><p>大门第三明三世相分二一标有问有答分二。一依法。二依与不与二解释分三。一释过去。二释未来三释现在</p><p>大门第四明四相分三。初标有问有答。次释分四。一明生。二明老分二。一辨体。二差异分二。一标二释。三明住。四明<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。后结文可见</p><p>大门第五明四缘相分四一标二解释分四。一明因缘。二明等无间缘。三明所缘缘。四明增上缘分二。一依根。二依善不善性三建立分四。一立因缘。二立等无间缘。三立所缘缘。四立增上缘四明相摄分二。一因缘。二餘三缘</p><p>大门第六明三性相分二。一问。二答分三一明善分二。一明善体分十。一无罪善。二生得加行善。三自性等善。四顺福等善五施性等善。六善色等善。七<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>分善。八恭敬等善。九方便等善。十有五异门。一有依等善。二世出世善。三十善道善。四无学十善。五福生等善。二明总摄二明不善分二。一与善相违。二能障碍三明无记分三。一标。二解释分四。一异熟生。二一分威仪路。三一分工巧处。四一分变化生。三料简分三。一料简工巧处。二料简威仪路。三料简变化生</p><p>大门第七明差别分三。一依根明差别。二依境明差别。三依根尘释名差别</p><p>第一依根明差别分三一明眼根差别分十增。一观色眼二长养异熟眼。三肉等眼。四瞚等眼五五趣眼。六相续等眼。七有识等眼。八依处等眼。九已得等眼。十过去等眼二例餘四根分二。一例。二料简分二。一标。二释分三。一释耳差别。二释鼻舌差别。三释身差别三明意根差别分十一增。一识法意。二施设等意分三。一标。二释。三果门。三心等意。四善等意。五五位差别意。六六识身意。七七识住意。八增语触相应等意。九九有情居意。十过去等意。十一十二心意</p><p>第二依境明差别分六一明色尘分十。一眼所行色。二内外色。三显等色。四有依光明等色。五五趣差别色。六建立所摄等色。七七种摄受事色。八地分杂等色。九过去等色。十十资具色二明声尘分十。一耳所行声。二了不了声。三因受等声。四善不善等声。五五趣声。六受教等声。七男女等声。八分二。一圣非圣声分三。一标。二释。三果门。二善不善语业道声。九过去等声。十五乐所摄声分三。一标。二徵。三解释三明香尘分十。一鼻所行香。二内外香。三可意等香。四大等香。五根等香。六食等香。七皮叶等香。八俱生等香。九过去等香。十男女等香四明味尘分十。一舌所行味。二内外味。三可意等味。四大麦等味。五饮酒等味。六甘苦等味。七苏油等味。八俱生等味。九过去等味。十可嚼等味分二。一可食味。三药味五明触尘分十。一身所行触。二内外触。三可意等触。四摩等触。五分二。一五趣触。二蚊虻等触。六苦乐等触。七坚鞭等触。八手触等触。九过去等触。十饮食等触六明法尘分三一料简分三。一标。二徵。三答分三。一实有法分三。一心法。二律非律色。三定生色。二假有法分二。一标。二列数。三无為法分三。一标。二列数。三料简二列法数分十。一意所行法。二假非假法。三有色等法。四有色假所摄色。五色心所有等法。六受想等法。七受想思等法。八善不善等法。九过去等法。十一随逐生义等法三总结</p><p>第三依相尘释名差别分三一释根名分六。一释眼名。二耳。三鼻。四舌。五身。六意二释境名分六。一释色。二释声。三香。四味。五触。六法三总结</p><p>大门第八明善巧相分二一明坐起因分二。一颂。二长行二列数</p><p>大门第九明九事相分四。一标。二徵。三列名。四解释分九。一明有情事。二明受用事。三明生起事。四明安住事。五明染净事。六明差别事。七明说者事。八明所说事。九明眾会事</p><p>第三总结有一颂。文义可知</p><p>第二广解分十七中第三四五合释有寻伺等三地大门分二。一略释。二广解初略释分三。一问。二答。三略解二广解分五。一明界施设建立。二明相施设建立。明如理作意施设建立。四明不如理建立。五明杂染等起施设建立</p><p>五中第一明界施设建立分二。一略释。二广解略释分三。一问。二答。三略释二广解分八。一明数建立。二明处建立。三明有情量建立。四明寿建立。五明受用建立。六明生建立。七明自体建立。八明因缘果建立</p><p>八中第一明数建立分三一分别界分二。一堕界分三。一问。二答。三结。二非堕界二配寻伺等地位分三。一配有寻伺。二配无寻唯伺分二。一配地。二明修人。三配无寻伺。三明无寻伺义分二。一有漏界无寻伺义分三。一正义。二徵。三说因由分二。一有欲。二无欲。二无漏界摄无寻伺义分二。一明寻伺。二例餘</p><p>八中第二明处建立分三一建立欲界处分四。一标。二列数分八。一列八热地狱处分二。一问。二答。二八寒处分四。一明住处。二问。三列名。四明二狱处所。三饿鬼处。四非天处。五除傍生。六四大州。七八中州。八六欲天。三料简独一及近地狱分二。一不立处。二人中可得。四总结二建立色界处分二。一标。二列数分四。一列初静虑分二。一果。二因。二列第二静虑分二。一果。二因。三列第三静虑分二。一果。二因。四列第四静虑分二。一列凡夫分三。一果。二因。三明无想天处。二列圣天分二。一小乘天分三。一明住处。二列名。三明因。二大乘天分三。一明住处。二列名。三明因三建立<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>处分二。一有处。二无处</p><p>八中第三明有情量建立分五一人趣身量分四。一南州。二东州。三西州。四北州二天趣身量分二。一欲天分六。六天差别故。二色天分四。四静虑差别故三恶趣身量分三。一地狱二傍生。三鬼趣四明非天身量五明无色天身量</p><p>八中第四明寿建立者分二一明寿量分十。一明人寿量分四。四州差别故。二明欲天寿量分六。六天差别故。三明八热地狱寿量分八。一等活。二黑绳。三眾合。四号叫。五大号叫。六烧热。七极烧热。八无间。四非天寿量。五明傍生寿量。六明鬼趣寿量。七明八寒地狱寿量。八明近及独一寿量。九明色天寿量分四。四禪差别故。十明无色天寿量分四。四定差别故第二明差别分二。一明中夭。二明有尸无尸</p><p>八中第五明受用建立分三。一明受用苦乐。二明受用饮食。三明受用婬欲初受用苦乐分二。一依五趣明受苦乐。二依异门明受苦乐依五趣明受苦乐分二。一明受苦。二明受乐初受苦分二。一略释。二广解分五</p><p>一明地狱受苦分四一明八热地狱受苦分八。一明等活受苦分四。一标。二受苦相。三受苦时。四结二明黑绳受苦分四。一标。二受苦相。三受苦时。四结三明眾合受苦分四。一标。二受苦相分三。一夹石。二铁槽。三崩山苦。三受苦时。四结四明号叫受苦分四。一标。二受苦相。三受苦时。四结五明大号叫受苦六明烧热受苦分四。一标。二受苦相分四。一铁熬。二铁丳。三铁地。四捶斫。三受苦时。四结七明极烧热受苦分四。一标。二受苦相分三。一三支丳。二铁鍱。三鑊汤苦。三受苦时。四结八明无间受苦分六。一标。二受苦相分六。一四方猛焰。二铁箕。三铁山。四钉舌。五铁丸。六洋铜。三受苦时。四结。五受苦因。六总结第二明近狱受苦分四。一标。二明受苦相分二。一略标四增处。二广释四增处分四。一煻煨苦。二尸粪苦分二。一俱没。二虫食。三明刀剑等苦分三。一游行刀剑路苦。二刃叶堕落斫截苦。三登铁树苦。四明灰河苦分二。一煎煮苦。二铁丸苦。第三明受苦时。第四答难第三明寒地狱受苦分八。一明皰狱受苦分三。一标。二受苦相。三结。二皰裂。三喝哳詀。四郝郝凡。五虎虎凡。六青莲花分二。一受苦相。二结。七红莲花分二。一受苦。二结。八大红莲花分二。一受苦相。二结第四明独一狱受苦分三。一标。二受苦相。三结</p><p>第二明傍生受苦分三。一更相残害苦。二不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>苦。三明苦因</p><p>第三明鬼趣受苦分二。一标。二释分三一明外有障碍分四。一问。二明苦因。三明受苦相分三。一明飢渴相。二明外障。三明自业。四结二明内有障碍分四。一问。二明内有障相。三明受苦相。四结三明饮食无有障碍分三。一问。二受苦异门分四。一烧然苦。二食粪秽苦。三食生熟臭秽苦。四食自肉苦。三结</p><p>第四明人趣受苦分三。一标。二释分八。一俱生苦。二所欲不得苦。三麤疏饮食苦。四逼追求苦。五时节变异苦。六无覆障苦。七黑闇障苦。八变坏苦。三料简</p><p>第五明诸天受苦分三一明欲天受苦分三。一标。二明受苦相分三。一死堕苦分二。一明五相。二苦因。二陵蔑苦分三。一标。二徵。三答因由。三斫截等苦分七。一标。二徵。三答因由。四胜劣。五明諍因。六明何趣摄。七明驱摈。三总结第二第三合明色无色天受苦分四。一标。二明不受苦因。三明有微细苦因。四明无漏界中无有麤重分二。一明无麤重。二结</p><p>第二明受乐分五一明四种地狱二鬼趣受乐三大力鬼神及傍生受乐四明人趣受乐分二。一下。二上分二。一总相分二。一标分二。一胜。二胜因。二明七宝分三。一问。二列名。三辨体相分三。一标。二问。三引经二别相分四。一金轮分二。一顺化。二告敕。二银轮。三铜轮。四铁轮五明天趣受乐分三。一明欲天受乐分二。一标。二释分十八。一明形色德。二明久住德。三身德分二。一标。二释。四住处德分二。一标。二释。五所食德分二。一标。二释。六所饮德。七乘骑德分二。一标。二释。八衣服德。九<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>具德分二。一标。二释。十熏香等德。十一大会树德分二。一标。二释分五。一根德。二身。三枝叶。四香。五受用德。十二歌笑等德。十三资具德分二。一标。二释。十四因次明非天及北州受乐德分四。一衣。二食。三无繫属。四定胜德。十五明帝释受乐德分二。一标。二释分九。一宫殿德。二天女德。三地界德。四眾花德。五街<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>。六侍从德分二。一所守德。二能守德。七园苑德分二。一苑德。二地德。八善法堂。九如意石德。十六身光德分三。一明身光。二明昼夜。三明闇相。十七受五欲德分三。一标。二释分五。一声欲。二<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>。三香欲。四味欲。五触欲。三结。十八明人天差别德二明色天受乐分四。一明初禪乐。二二禪乐。三三禪乐。四四禪乐三明无色天受乐</p><p>第二依异所明受苦乐分五一依六差别明受苦乐分二。一明受苦分四。一总标。二列名。三徵。四释分六。一明量。二明柔软。三明总。四明时。五明心。六明所依。二明受乐二依圣非圣财明受苦乐分三。一标。二释分二。一明非圣财分三。一标。二列名。三释分四。一明适悦。二滋长。三清净。四住持。二明圣财分三。一标。二问。三列名。三明差别分三。一标。二徵。三解释分十五。一<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>行二有罪无罪。三遍不遍。四一切时有无。五依三界。六引不引。七有尽无尽。八有夺无夺。九可持不可持。十足不足。十一有怖无怖等。十二有怨无怨。十三有灾无灾。十四有恼无恼。十五断苦不断苦三依圣慧资养明受苦乐分三。一标。二徵。三解释分二。一明受<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>德。二明受欲失。各有五门。论文自明四依三界三受明受苦乐分三。一总标分二。一问。二答。二观三受分三。一乐。二苦。三不苦不乐。皆有问答。论文自明。三配三苦五依有资味无资味等明受苦乐分三。一明堕界三种喜乐捨解脱。二明建立想受灭乐密意。三明非堕界乐</p><p>第二明受用饮食分二。一总标。二分别分二。一以触等三食配於三界。二分别段食分二。一总。二别分二。一细。二麤</p><p>第三明受用婬欲分二一依趣明分五。一地狱分三。一标。二徵。三答。二鬼趣。三傍生。四人趣。五天趣分二。一标。二释分六。一四大王眾天。二三十三天。三无烦天。四都史多天。五乐变化天。六他化自在天二明差别分三。一依州明差别。二依大力鬼神及欲天明差别。三依胎藏明差别分二。一标。二释分三。一地居。二住顶。三空居</p><p>八中第六明生建立分四一明生三欲分二。一标。二释分三。一释於近欲自在分三。一标。二徵。三释。二释於化欲自在分四。一标。二徵。三解。四结。三释於他欲自在分三。一标。二释分二。一明受欲。二释名。三结二明生三乐分二。一标。二释分三。一释离生喜乐分二。一标。二释。二释定生喜乐分二。一标。二释。三释无善善乐分二。一标。二释三明建立三欲及三乐因由分三。一问。二总答。三解释分三。一明欲求。二有求分二。一明有求。二答难。三梵行求四明求梵行差别分二。一有上。二无上</p><p>八中第七明体建立分二。一标。二释分四一自心拾非由他分二。一标。二释分二。一戏忘。二意愤二他心捨非由自心分二。一标。二释三自心亦捨亦由他心分二。一标。二释四自心亦不捨亦非他心分二。一标。二释分十。论自明</p><p>八中第八明因缘果建立分三一明因缘果相等四法分二。一总标分二。一问。二答。二释分四。一明因等三相分二。一标分二。一列名。二略总辩。二别释分六。一依生分二。一问。二答。二依得分三。一问。二答。三释二缘。三依证成分二。一问。二答。四依成辨分二。一问。二答。五依任持分二。一问。二答。六依所作分三。一问。二答。三明自业作用分二。一内。二外。二明因等所依分二。一标。二答。三明因等差别分二。一总标。二别释分三。一因。二缘。三果。四明因等建立分三。一建立因分十一建立随说因分五。一总标。二答。三徵。四释分四。一欲法。二色法。三无色法。四不繫法。五结。二建立观待因分四。一立。二徵。三释分五。一欲乐。二色乐。三无色乐。四不繫乐。五不欲苦。四结。三建立牵引因分四。一立。二徵。三释分二。一明因。二明果分二。一内。二外。四结。四建立生起因分四。一立。二徵。三释分四。一明因。二明灭。三能生。四引经。四结。五建立摄受因分四。一立。二徵。三释分二。一明繫法。二明不繫法。四结。六建立所引发因分四。一立。二徵。三释分三。一善引分四。一欲。二色。三无色。四不繫。二不善分二。一贪二例餘。三无记分二。一善等识引。二引喻。四结。七建立定异因分四。一立。二徵。三释分四。一欲功能。二色功能。三无色功能。四不繫功能。此四总有因果如论。四结。八建立同事因分四。一立。二徵。三释分五。一欲和合二色。三无色。四不繫。五例餘。四结。九建立相违因分四。一立。二徵。三释分五。一欲障碍。二色。三无色。四不繫障碍。五例餘。四结。十建立无相违因分四。一立。二徵。三释分五。一欲无障碍。二色。三无色。四不繫。五例餘。四结。二建立缘分四。一立因缘。二立等无间缘。三立所缘缘。四立增上缘。三建立果分五。一立异熟果。二立等流果。三立离繫果。四立士用果。五立增上果二释因等名分三。一因。二缘。三果三明因之异门分三。一能生因等异门分二。一标。二列名。三释分五如论。二爱因等异门分二。一标。二列名。三无常等异门分三。一标。二释分七。一无常因。二他自性因。三已生未灭因。四餘缘因。五变异因。六功能相应因。七相称因。三结</p><p>广释中大门第二明相施设分二。一略释分二。一颂。二长行。二广解分七一明寻伺体性分二。一标。二释分二。一不深。二深二明寻伺所缘分二。一标。二释三明寻伺行相分二。一标。二释分二。一寻行相。二伺行相四明寻伺等起分二。一标。二释五明寻伺差别分二。一标。二释六明寻伺决择分三。一标。二问。三答七明寻伺流转分二。一标。二释分二。一问分六。一问地狱寻伺行相所触所引相应所求业转六事。二问傍生。三问鬼趣。四问人趣。五问欲天。六问初禪行相所触等六事。二答分六。一答地狱寻伺行相所触所引相应所求业转六事。二答鬼趣。三答傍生及大力饿鬼。四答人趣。五答欲天。六答初禪寻伺所触等六事</p><p>广释中大门第三明如理作意施设建立分二。一略释分二。一问。二答。二广解分四。一标。二列名。三解释分八。一明如理作意处分二。一标。二释分六如论。二明寻伺事分二。一标。二释分八如论。三明寻伺所求分二。一标。二释。四明寻伺受用分二。一标。二释分九如论。五明寻伺正行分二。一标。二释分二。一<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>尊处分三。一利益尊。二德尊。三族尊。二供养於餘分三。一何方便。二何观待。三何所作。六明声闻乘资粮方便分二。一标。二释。七明独觉乘资粮方便分二。一标。二释。八明波罗蜜多引发方便分二。一标。二释。四杂明施主等相分四。一明施主戒修三相。二明受施损恼二相。三明摄益善非善友引摄三相。四明随转供事因果聪慧三学五相</p><p>广释中大门第四明非如理作意施设建立分三。一略释。二广解。三总结初略释分三。一问。二颂总答。三略释分三。一标。二问。三答第二广解分十六。谓从执因中有果乃至计吉祥。如论自明</p><p>初明因中有果论分二一立彼宗见分二。一明标宗计人。二明立论因由分二。一问。二答分二。一总答。二别释分二。一教。二理分四。一明立论人分二。一明计人。二明立论因。二明宗见分五。一从施设立论。二从求取立论。三从所作决定立论。四从生立论。五结。三明过失分四。一施设杂乱过。二所求乱过。三加功杂乱过。四果生杂乱过。四总结二广破邪见分四。一以正理破分四。一无异相破。二未生相破。三已生相破。四明正义。二喻显分二。一标。二释分五如论。三显彼过。四总结</p><p>二明从缘显了论分二一立彼宗见分二。一明标宗计人。二明立论因由分二。一问。二答分二。一总答。二别释分二。一教。二理分五。一明立论因。二非前宗。三立自宗。四答难分二。一问。二答。五结二广破邪见分二。一破显了宗。二破声论见。初破显了宗分六。一有障无障理破分二。一问。二非分二。一无障。二有障分三。一破。二喻。三重破。二有相果相理破分二。一问。二非分二。一有性。二果性分二。一破。二喻。三显异显异理破分二。一问。二非分二。一显不异过。二显异过分二。一问。二破分二。一无因过。二有因过。四总结。五非邪宗见。六说正义分二。一标。二释分六。一远。二四障。三微细。四散乱。五根坏。六未得相应智。二破声论见分三。一破邪见。二明差别。三结</p><p>三明去来实有论分二一立彼宗见分三一计人分二。一外。二内。二标宗。三立论因由分二。一问。二答分二。一总答。二别释分二。一明教分二。一外法。二内法分二。一标。二引经分三。一十二处。二有业。三有色等。二明理分三。一明立论因。二立论宗分三。一标。二释。三立过。三结二广破邪见分二。一破外法论。二破内法论初破外法分三。一有异无异理破分二。一问。二破分二。一有异。二无异。二常无常相理破分二。一问。二破分二。一常。二无常。三来至现在世等七正理破分四。一立难分七。一来至现在难。二死已生此。三生现在。四本无业有业。五本不圆满今圆满。六本有异相今无异相。七於未来有现在分难。二广破分七。一破未来至现在。二破未来死已生现在。三破未来為缘生现在。四破本无业用今有业用分二。一立有业用难。二立有异无异难。五破未圆满圆满相。六破异相。七破未来分相应。三例餘二法。四总结二破内法论分二。一立彼难分二。一违理过。二违教过。二理破分二。一答违理难分二。一问。二破分二。一不起分二。一正破。二引证。二有起分二。一有行。二无行分二。一有事转。二无事转。二答违教难分四。一依一切法有相无相密意破答分四。一立有相无相密意。二徵。三答所以。四显过失。二依说有过去业等密意答分三。一标。二释分二。一明因。二明果。三结。三依说有过去色等密意答分三。一标。二释分三。一明未来密意。二明现在密意。三明过去密意。三结。四破三世有相分三。一总破遮。二徵。三别释分三。一明未来分二。一标。二释。有十二相。如论应知。二明现在分二。一标。二释有十二相。如论应知。三明过去分二。一标。二释有十二相。如论应知</p><p>四明计我论分四。一立邪宗。二广破。三明真我。四明立我胜利初文分三。一明计人立宗。二简人。三明立论因由分二。一问。二答分二。一总答。二别答分二。一明教。二明理分三。一明立论因。二标宗之因。三解释分二。一依先不思觉立我分三。一标。二释分五。一依色。二受。三想。四行。五识三结。二依思觉立我分三。一标。二释分二。一依六根。二依善不善。三结二广破邪宗分二。一正破。二总结。初文分十。一依不思觉破。二依思觉破。三依蕴施设破。四依相安立破五依染净破。六依流转止息破。七依受者等破。八依自他施设有作者破。九依自他施设言说破。十依施设见破初依不思觉破分四。一依<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>破分二。一问。二破分二。一不异。二异分五如论。二依自体餘体法破分二。一问。二破分二。一自体破。二餘体破。三依情非情数破分二。一问。二破分二。一觉起分三。一无情是有情过。二有情是无情过。三餘有情是餘有情过破。二觉不起。四依<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>比量破分二。一问。二破分二。一现量。二比量二依思觉破分五。一依觉我破分二。一问。二破分二。一觉。二我。二依常无常破分二。一问。二破分二。一无常。二常。三依动作无动作分二。一问。二破分二。一有动作。二无动作。四依有因无因破分二。一问。二破分二。一有因。二无因。五依自他破分二。一问。二破分二一依自。二依他三依蕴施设破分二。一问分。二如论。二破分四。一依蕴施设破。二依蕴中施设破分三。一标。二问。三释分二。一常分四。损益过。二法非法不起过。三蕴身不起过。四我常解脱过。二无常分二。一无流转过。二不作而得过。三依蕴外餘处破。四依不属蕴破分二。一无染过。二我与身不相属过四依相安立破分二。一问分二如论。二破分二。一不离破分二。一问。二正破分二。一不离见等分二。一非彼见。二明因由。二离见等破分二。一问分二如论。二破分二。一我所成业分五。一种子喻。二陶师喻有二过如论。三得通喻有三过如论。四地喻分三。一正破。二问所以。三明业。五<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>喻分三。一正破。二明业。三结。二我所执具分二。一鎌喻分二。一喻。二合。二火喻分三。一正破。二徵。三答所以。第二离见等破五依染净破分二。一问。二破分二。一本有染净分三。一正破分二。一明染净相。二成就染净义。二喻。三结。二本无染净破六依流转止息破分二。一问。二破分二。一本有流转及止息破分三。一正破分二。一标。二释。二喻显。三法合。二本无流转及止息破七依受者等破分二。一问。二破分二。一依变异破分二。一诸行是受者等过。二我无常过。二依无变异破八依自他施设无作者破分二。一问。二破分二。一依自破。二依他破九依自他施设言说破分二。一问。二破分二。一依自施设二依他施设分三。一正解。二徵。三答所以十依施设见破分四。一依我见破分二。一问。二破分二。一善有四过如论。二不善分二。一非正颠倒过。二非实有过。二依<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>见破分二。一问。二破分二。一善分三如论。二不善有五过如论。三依我性我见破分二。一问二破分二。一我性。二我见。四结第二总结分十如论应知第三明真我分三。一标。二略释分三。一明非我。二明异不异。三明非实有体。三广解分三。一标。二释分八如论。三引证第四明立我胜利分三。一标。二释分四如论。三结</p><p>五明计常论分三。一立彼宗见。二广破邪宗。三明真<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>相初文分四。一总标计人。二立彼宗见分二。一标。二释分五如论。三别简计人分三。一计前际。二计后际。三计极微者。四明立论因由分二。一问。二答分二。一引教答。二以理答分三。一明计前际之因分六。一依静虑。二依天眼。三依诸识流转相续。四依梵王随意成立。五依四大变异。六依诸识变异。二明计后际之因分二。一明起后际因。二结。三明计极微常住之因分二。一明正因。二结二广破邪宗分二。一略破。二广破分二。一正破二总结。初正破分三。一破前际常住论分二。一依取蕴我破分二。一问。二破分二。依取蕴破。二依取我破。二依识灭转破分二。一问。二破分二。一依灭破。二依转破。二破后际常住论分二。一依想受有变异无变异破分二。一问。二破分二。一有变破。二无变破分二。一无想过。二无受过。二解释三十二见分九。一释有色二释非色。三释亦色亦非色。四释非色非非色。五释有边。六释无边。七释亦有边亦无边。八释非有边非无边。九释解脱。此九中初四释想。次四释边。后一释解脱。三破极微常住论分五。一依观察不观察破分二。一问。二破分二。一不观察。二观察。二依共相破分二。一问。二破分二。一由细。二由相异分二。一麤相不从彼生过。二极微失自相过。三依自相破分二。一问。二破分二。一依不异相破分二。一果常过。二因果无差别过。二依异相破分二。一问。二破分二。一从离散分二。一切时果生过。二因果无决定过。二从聚集分二。一问。二破分三。一不过质量。二过质量分二。一不可分折过。二麤物亦常过。三救难。四依由起造破分二。一问。二破分三。一依种子等喻破。二依陶师等喻破。三依无同喻破。五依根本所用破分二。一问。二破分二。一為有情破。二不為有情破第二总结分二。一双结前际后际常住论。二结极微常住论第三明真常住相分三。一标。二释分五。如论应知。三结</p><p>六明宿作因论分三。一立彼邪宗。二广破邪见。三显正因相初文分四。一总标计人。二引经立彼宗见分二。一标。二释分三。一明故业。二明现业。三明果。三别简计人。四明立论因由分二。一问。二答分二。一总答。二别答分二。一明教。二明理分五。一明造论因。二立理。三徵。四答所以。五结二广破邪见分三。一问。二破分二。一依宿作因破。二依现法因。三明总结第三显正因相分三。一依宿作以显正因分二。一标。二释。二依杂业以显正因分二。一标。二释分五如论。三依现在功用以显正因分二。一标。二释分四如论</p><p>七明自在等乃作者论分二。一立彼宗。二广破邪见初文分四。一总标计人。二立彼宗见。三别简计人。四明立论因由分二。一问。二答分二。一总答。二别答分二。一明教。二明理分四。一明造论因。二立理。三徵。四答所以分五。一依因立。二依果立。三□受。四明起邪见。五所化主二广破邪宗分二。一正破。二总结。初正破分二。一总问。二别破分四。一依功用破。二依摄不摄破。三依有用无用破。四依因性破。初文分二。一问。二破分二。一依功用。二依无功用。二依摄不摄破分二。一问。二破分二。一依摄。二依不摄。三依有用无用破分二。一问。二破分二。一依有用。二依无用。四依因性破分二。一问。二破分二。一依大自在。二依餘因分二。一问。二破分二。一依乐欲分二。一问。二破。二依餘因破分二。一因不可得过。二於欲无自在过。第二总结分四如论</p><p>八明害為正法论分三。一立彼宗见。二广破邪宗。三显非法之相初文分三。一总标计人。二立彼宗见。三明立论因由分二。一问。二答分二。一明无因由。二明起之时代二广破邪宗分二。一正破。二总结。初文分五。一依因破分二。一问。二破分二。一依法自体破。二依非法自体破。二依譬喻破分三。一标彼救难词。二问。三破分二。一依止息。二依不止息破。三依不决定破分二。一问。二破分二。一依遍行理破。二依不遍行理破。四依於果无功能破分二一问。二破分二。一依转因。二依转果破。五依咒术破分二。一问。二破分二。一依有破。二依无破。第二总结分五。如论应知第三显非法相分二。一标。二释分七。一损他。二行人共知。三智人称说。四自所不欲。五染心所起。六待邪咒术。七自性无记</p><p>九明边无边论分二。一立彼宗见。二广破邪宗初文分五。一总标计人。二立彼计宗。三引经。四别简计人。五解释分四。一释有边。二释无边。三释亦有边亦无边。四释非有边非无边二广破邪宗分二。一正破。二总结。初文分二。一问。二破分二。一依有破。二依无破。二总结分二。一结有。二结无</p><p>十明不死矫乱论分五。一总标。二引经分三。一明矫乱义分二。一立他问分二。一依增上道。二依决定胜道。二答他问分四。一标。二依他问。三依餘事。四随他言。二列名。三解释分四如论。三明依经说。四明见归。五结</p><p>十一明无因见论分三。一立彼宗见。二广破邪宗。三总结初文分三。一明起论因分二。一依静虑。二依寻思。二明立论因由分二。一问。二答分五。一依见事差别。二依见无果。三依风。四依河。五依果木。三结二广破邪宗分二。一依无体我破分二。一问。二破分二。一依无体。二依念我。二依内外物破分二。一问。二破分二。一依无因分三。一无种种生过。二无欻然而起过。三无有时不生过。二依有因第三总结分四。一结无体。二结念我。三结无因。四结有因</p><p>十二明断见论分二。一立彼宗。二广破邪见初文分四。一总标计人。二立彼宗见分二。一依欲界人等。二依例餘六天。三别箇计人。四明立论因由分二。一问。二答分二。一总答。二别答分二。一答教。二答理分三。一明立论因。二立断见理分三。一不作业而得过。二现无受用过。三结。三立喻分二。一喻。二合二广破邪见分二。一正破。二总结。初文分二。一问。二破分二。一依蕴破。二依我破分七。如论应知。二总结分二。一结蕴断。二结我断</p><p>十三明<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>论分二。一立彼宗见。二广破邪见初文分三。一明计人。二略标彼宗分二。一依施等。二依诸法体相。三明立论因由分二。一问。二答分二。一总答。二别答分二。一答教。二答理分二。一明造论因。二广明宗见分五。一依生受后受立见分二。一依施分二。一因。二果。二依行分二。一因。二果。二依不决定立见分二。一无从彼来。二无从此去。三依生处立见分三。一依下地。二依父母等。三依无想等分二。一释分三。一明无想。二明无色。三明涅槃。二答难。四依增上慢。五依诸法体相分二。一问。二答分二。一依深经。二依安立法相二广破邪见分二。一正破。二总结。初文分五。一依生受后受理破分二。一问。二破分二。一依俱有。二依无后受。二依非不决定理破分二。一问。二破分三。一依是父母破。二依非父母破。三明正义。三依有生处理破分二。一问。二破分二。一依有破。二依无破。四依增上慢理破分二。一问。二破分二。一依有破。二依无破。五依三种相破分二。一问。二破分二。一依有。二依无。二明总结分五。如论应知</p><p>十四明妄计最胜论分二。一立彼宗。二广破邪见初文分四。一总标计人。二立彼宗见。三别简计人。四明立论因由分二。一问。二答分二。一总答。二别答分二。一答教。二答理分二。一明造论因。二明立见理分二。一见具戒。二贪名利等二广破邪见分二。一正破。二总结。初文有三门分之。一依產生破分二。一问。二破分二。一依种类破二依<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>破。二例餘八法分八。一依作业破分二。一造作善不善。二三业不净净。二依受生破分三。一依现法。二依后生。三依三处现前。三依工巧业处破。四依增上破分四如论。五依顾录破分二。一依给侍。二依老病等法。六依梵住破分二。一因。二果。七依修觉分破。八依证菩提破分三如论。三依戒闻等破分二。一问。二破分二。一依种类破。二依戒闻等破。二明总结分十如论应知</p><p>十五明妄计清净论分二。一立彼宗。二广破邪见初文分四。一总标计人。二立彼宗见分四。一依我解脱立见分二。一标。二释。二依四静虑立见分二。一标。二释。三依沐浴立见分二。一标。二释分二。一依孙陀利迦河。二例餘四河。四依诸戒立见分七。如论应知。三别简计人分四如论。四明立论因由分二。一问二答分二。一总答。二别答分二。一答教。二答理分二。一明立论因。二立理分二。一依得诸纵任。二依自苦其身分二。一正义。二喻显二广破邪见分二。一正破。二总结。初文分四。一依离欲不离欲破分二。一依五妙欲破分二。一问。二破分二。一依已离欲。二依未离欲。二依四静虑破分二。一问。二破分二。一依离。二依未离。二依内外破分二。一问。二破分二。一依内。二依外。三依净不净破分二。一问。二破分二。一依净。二依不净。四依邪正破分二。一问。二破分二。一依邪。二依正。二明总结分四。如论应知</p><p>十六明妄计吉祥论分二。一立彼宗。二广破邪见初文分四。一总标计人。二立彼宗见分四。一违。二顺。三供养等。四明供具。三别简计人。四明立论因由分二。一问。二答分二。一总答。二别答分二。一答教。二答理分二。一明造论因。二立理分二。一明因。二明传说分四。一明往问。二显彼无知三立彼妄计。四明宣说广破邪见分二。一正破。二总结。初文分二。一问。二破分二。一依日月等破。二依业破。二明总结分二。如论应知</p><p>大门第三总结分二。一依二门。二依正理二广释中大门第五明离染等起分二。一明所治法。谓三杂染。二明能治法谓六现观。初文分二。一总标分二。一总问总答。二别问别答。二别释分三。一释烦恼杂染。二释业杂染。三释生杂染</p><p>初释烦恼杂染分二。一略释分三。一问。二颂答。三解释。二广解分九。一自性。二分别。三因。四位。五门。六上品。七颠倒摄。八差别。九过失初文分三。一标。二释分二。一因。二果。三结二释烦恼分别分二。一标。二释分五。一立异门分十一。一依离染。二依所断。三依界。四依记无记。五依见修所断。六依根本。七依随眠。八依烦恼异门。九依结。十依见烦恼。十一依十二諦。二释十二諦分二。一问。二答分二。一依染品二諦立。二依净品遍智果二諦立分三。一欲。二色。三无色。三依界配烦恼分三。一欲界。二色界。三无色界四依界明对治分二。一明对治分三。一欲界。二色界。三无色界。二例餘障。五释十烦恼义分十。如论应知三释烦恼因分四。一标。二列名。三明起因。四解释分六。如论应知四释烦恼位分三。一标。二列名。三明随眠因五释烦恼门分二。一依二门。二依七门。初文分三。一标。二列名。三解释分二。一释缠门分二。一标。二释分五如论。二释随眠门分二。一问。二答分二。一能作所依。二能生苦。二依七门分二。一标。二释分七如论六释烦恼上品相分五。一问。二答。三标。四列名。五解释分六。如论应知七释烦恼颠倒摄分三。一标。二列名。三解释分三。一明三倒。二摄烦恼。三释四倒八释烦恼差别分四。一总标。二列名。三训释名义。四辨体。如论应知九释烦恼过患分三。一标。二释分二十一。如论应知三结</p><p>二别释中第二释业杂染分二。一略释分三。一问。二颂答。三长行解释。二广解分九。一自性。二分别。三因。四位。五门。六上品。七颠倒。八差别。九过患初释业自性分三。一问。二答。三结二释业分别分二。一问。二答分二。一略答。二广答。初文分三。一标。二列名。三解释分二。一标。二释。二广答分二。一依人建立。二依法相建立。初依人差别建立分二。一明不善人。二明善人。初不善人分十。如论应知。二善人分二。一翻上。二释差别分二。一标。二释分二。一释离邪行中差别立句分三。一标。二释分三。一时净。二他信净。三正行净。三略义。二释离<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>中差别立句分二。一释不同句。二明略义。二依法相差别建立分二。一总标。二解释分二。一明不善法分十。如论应知。二明善法分四。一问。二答分二。一明不杀。二例餘。三明差别分二。一明不与取。二例餘。四明摄略义分二。一明摄。二明开合三释业因分三。一问。二略答。三列名四释业位分四。一问。二略答。三列名。四解释分二。一配善不善六业生处。二释耎等五业分二。一不善。二善五释业门分三。一问。二略答。三广解分二。一明与果门。二明损益门。初文分三。一标。二列名。三解释分五。一释异熟果分三。一明<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。二例餘九业。三结。二释等流果分三。一标。二释分十如论。三结。三释增上果分三。一标。二释分十如论。三例善业。四释现法果分三。一标。二列名。三解释分二。一依欲解。二依事。初文分三。一标。二列名。三广解分八。一明有顾欲解分二。一标。二释。二明无顾欲解分二。一标。二释。三明损恼欲解分二。一标。二释。四明慈悲欲解分二。一标。二释。五明憎害欲解分二。一标。二释。六明净信欲解分二。一标。二释。七明弃恩欲解分二。一标。二释。八明知恩欲解分二。一标。二释。第二依事解释分二。一依不善分三。一总标。二释分二。一明无间分五如论。二明无间同分分二。一标。二释分五如论。三结。二依善分二。一总标。二释分二。一依利益分三。一依恩田分二。一母。二父。二依德田分二。一依慈定。二例餘<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>。三依尊田分二。一依佛。二依学无学。二依损害。五释与他增上果分三。一标。二释分二。一依佛。二例餘分三。一轮王。二慈定。三大悲菩萨。三结。第二明损益门分二。一总标。二别解释分二。一明损分三。一标。二问三答分八如论。二明利益六释业增上分四。一问。二略答。三列名。四解释分六。一释加行分二。一标。二释分二。一不善。二善。二释串习分二。一标。二释。三释自性分二。一标。二释分二。一依十不善分八如论。二依施等分三如论。四释事分二。一标。二释。五释所治类分二。一标。二释。六释所治损害分二。一标。二释七释业颠倒分四。一问。二略答。三列名。四解释分三。一释作用颠倒分三。一标。二释。三明差别分二。一依杀业分二。一有情。二无情。二例业道。二释执受颠倒分二。一标。二释分二。一依施等立见分二。一明执受颠倒因。二立彼执分二。一依杀业。二例餘。二依梵天等立见分二。一标。二释分二。一依杀业。二例餘业道。三释喜乐颠倒分二。一标。二释八释业差别分三。一问。二略答列名。三解释分有四十九。如论应知。此四十九业中。前四十一是有漏业。八是无漏业九释业过患分三。一依七过。二依十过。三依五过。初文分四。一问。二略答。三列名。四解释分七。如论应知</p><p>二别释中第三释生杂染分四。一问。二略答。三列名。四广解分四。一释生差别。二释生艰辛。三释生不定。四释生流转初文分三。一标。二列名。三解释分五。一释界差别分二。一标。二释。二释趣差别分二。一标。二释。三释处所差别分三。一标。二释分三。一欲界。二色界。三无色界。三结。四释胜生差别分二。一依黑白。二依三界。初文分二。一标。二释分三。一依黑。二白。三非黑白。二依三界分三。一依欲界分三如论。二色界分三如论。三依无界分三如论。五释自身世间分二。一标。二释第二释生艰辛差别分三。一总标。二引经分三。一总答。二徵。三答所以分四。一依受生分二。一依傍生。二例人。二依丧失。三依财宝资生等。四依饮乳。三总结第三释生不定分二。一标。二引经分五。一依父母。二依受苦乐。三依受生处。四依不易可得。五依受身第四释生流转分三。一总问总答分二。一问。二略答。二别问别答分二。一问。二以颂答。三广解分十。一明缘起体。二明缘起门。三明缘起义。四明缘起差别。五明缘起次第。六明缘起释词。七明缘起性。八明缘起缘。九明摄诸经。十明缘起杂种</p><p>初明缘起体分五。一问。二略答。三列名。四解释。五总结四解标分二。一合明前际中际。二明从中至后际趣流转及清净初文分二。一问。二答分五。一依胎生明流转次第分五。一依无明等五法释续生义分五。一明无明。二明行。三明识。四明名色。五明六处。二释名色义。三释根相依。四总结。五明差别。二依卵生湿生明流转次第。三依化生明流转次第分二。一欲界。二色界。四依无色界明流转次第分三。一明所依。二明转。三明生。五依三业明流转次第分三。一福业。二非福业。三不动业第二明从中至后际趣流转及清净分二。一总问分二。一问清净。二问后际行缘起生。二答分二。一答从中际至后际。二答趣清净。初文分三。一总标。二列名。三解释分二。依内异熟果。二依外增上果。初文分二。一标。二依无名等五法明续生后有分七。一明因。二明无明。三明行。四明识。五明因识。六明识身。七明名色等四法种子。三结。二依外增上果分二。依受爱等七法明续生后有分六。一明受爱。二明取。三明有。四明生。五明老死。六明老死等次第种子。二总结。第二明趣清净分二。一明有餘依。二明无餘依。初文分三。初明因分四。一资粮。二闻。三思。四修。次明果分二。一有学。二无学。后明果功德分四。一慧解脱分二。一明因分二。一断无明爱。二断受二明果。二心解脱分二。一因。二果。三得无生法分三。一明无生。二明因。三结。四得现法涅槃分三。一明现法乐。二明受有无。三明寿量。二明无餘依分四。一明果灭。二明因灭。三明无餘依体。四叹德第五明总结分三。如论应知</p><p>第二明缘起门分三。一问。二略答。三列名</p><p>第三明缘起义分三。一问二答分八。如论应知。三明立缘起义分二。一问。二答</p><p>第四明缘起差别分四。一总问。二略答。三广解。四总结三广解分十二。谓从无明至老死</p><p>初明无明差别分四。一明十九无知。二明七种无知。三明五种愚。四明六种无知初明十九无知分二。一解释。二总结。初解释分十九。一明前际无知分二。一问。二答。二明后际无知分二。一问。二答。三明前后际无知分二。一问。二答。四明内无知分二。一问。二答。五明外无知分二。一问。二答。六明内外无知分二。一问。二答。七明於业无知分二。一问。二答。八明於异熟无知分二。一问。二答。九明於业异熟无知分二。一问。二答。十明於佛无知分二。一问。二答。十一明於法无知分二。一问。二答。十二明於僧无知分二。一问。二答。十三四五六合明四諦分二。一明於苦无知分二。一问。二答。二例餘三諦。十七明於因无知分二。一问。二答。十八明因所生诸行无知分二。一标。二释分七如论。十九明六触处无知分二。一问。二答。第二总结第二明七种无知分三。一标。二列名。三明相摄分二。一问。二答分七如论第三明五种愚分三。一标。二列名。三明相摄分二。一问。二答分五如论第四明六种无知分二。一依七无知事立分二。一标。二释。二依三慧等立分二。一依闻思修。二一依下中上三品三总结</p><p>第二明行差别分三一明身行分四。一问。二略答。三明处。四分别业分二。一下。二上二明语行分三。一问。二略答。三解释三明意行分三。一问。二略答。三分别业分二。一下。二上</p><p>第三明识差别分二。一明识体。二配於界初文分二。一明眼识分二。一问。二答分三。一明识性。二明识因。三明果识。二例餘五识分二。一标。二释分三。一明识性。二明识因。三明果识二配於界分三。一欲界。二色界。三无色界</p><p>第四明名色差别分三。一释名。二释色。三明差别初文分二。一解释。二配界。初文分四。一释受名分二。一问。二答。二释想名分二。一问。二答。三释行名分二。一问。二答。四释识名分二。一问。二答。二配界一明释色分二。一明大种分二。一问。二答分二。一列名。二配界。二明大种所造分二。一问。二答分二。一明色及法处色。二配界分二。一欲界。二色界三明差别分二。一标。二释分二。一因。二果</p><p>第五明六处差别分三一明六处体分二。一明眼处分二。一问。二答分二。一明依。二明业用。二例餘五处分二。一明依。二明业用二明差别分二。一标。二释分二。一因。二果三配界分二。一欲色。二通三界</p><p>第六明触差别分三一明触自体分二。一明眼触分二。一问。二答。二例餘五触二明差别分二。一标。二释分二。一因二果三配界分三。一欲界。二色界。三无色界</p><p>第七明受差别分三一明受自体分三。一明乐受分二。一问。二答。二明苦受分二。一问。二答。三明不苦不乐受分二。一问。二答二配界分三。一欲界。二三静虑已下。三四静虑已上三明差别分二。一标。二释分二。一因。二果</p><p>第八明爱差别分三一明欲界爱分二。一问。二答分二。一因。二果二明色界爱分二。一问。二答分二。一因。二果三明无色界爱分二。一问。二答分二。一因。二果</p><p>第九明取差别分二一明取自体分四。一明欲取分二。一标。二释。二明见取分二。一标。二释。三明戒禁取分二。一标。二释。四明我论取分二。一标。二释二配界分二。一欲界。二三界</p><p>第十明有差别分二一明有自体分三。一明欲有分二。一问。二答分二。一明十有。二破我见。二明色有分二。一问。二答。三明无色有分二。一问。二答二分别七有分二。一问。二答</p><p>第十一明生差别分二一明解释分十。一明生分二。一问。二答。二明遍生分二。一问。二答。三明出生分二。一问。二答。四明成就分二。一问。二答。五明正生分二。一问。二答。六明得蕴分二。一问。二答。七明得界分二。一问。二答。八明得处分二。一问。二答。</p></div>"
}]