[{
    "title": "略诸经论念佛法门往生净土集 第2826部",
    "author": "慧日法师",
    "html": "<div class=\"B1_text\"><p>略诸经论<a href=\"/remen/nianfofamen.html\" class=\"keylink\" target=\"_blank\">念佛法门</a><a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a><a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>集 卷上 (一名慈悲集)</p><p>大唐慈愍<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>慧日集</p><p>稽首归依大导师十方三世诸如来</p><p>今集诸经念<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>救度<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>爱河人</p><p>八万行中詮要行显示西方净土门</p><p>自劝劝他生彼国愿佛慈悲力加被</p><p>稽首归依无量寿彼国他方大悲主</p><p>闻名渴仰遥<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>愿共自他亲奉事</p><p>眾生惑业相缠缚<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>轮迴苦无量</p><p>纵厌娑婆求出离依附何门速<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a></p><p>為引诸经讚净土教令<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>往西方</p><p>奉请弥陀与眷属<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>捧座自来迎</p><p>今為怜愍一切眾生。无明覆心迷于净土。恋著<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>不求往生。六道轮迴漂流生死。為斯颠倒无信凡夫。集诸经论<a href=\"/remen/jingtufamen.html\" class=\"keylink\" target=\"_blank\">净土法门</a>。勒成三卷。令彼见闻迴心修学。上尽一形下沾十念。必定往生高昇净剎。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>清净永断胞胎。见佛闻经剎那成圣。<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a><a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>随意卷舒。供佛他方往来一念。地居不退入圣行流。<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>现前<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>速证。令有智者见倍倾心。遣愚昧者知而息挣。凡夫垢重贪爱昏迷。不了此身四大虚假。脓血不净和合共成。莹饰涂摩便生保重。三毒驱策造罪咨情。不虑泥犁猛苦长劫。耽荒五欲醉饮六尘。但事奢华詎知迴向。临终苦逼方始归依。纵欲虔诚注心何地。荒忙失志无法可凭。甘入三涂无希救护。可伤可念。顽骇凡夫平生放逸不亲善友。临终始悔无趣无归。今為此等无信道俗。成立净土教。令念佛信而迴向。夫立宗者。先破后立。何以故。若不摧邪难以显正。所以初卷先叙异见。以教及理逐遣知非。次第二卷广引圣教。成立净土念佛正宗。次第三卷会释诸教古今疑滞。校量诸行出离迟疾。然于佛法生异见者。或有<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>在家男女四眾。惧生死苦厌恶俗尘。或住山间或依聚落。或居寺舍或复在家。展转相传教人看净。昼则咨情睡眠。夜乃暂时繫念。见世空寂都无一物。将為究竟言。一切诸法。犹如龟毛。亦如兔角。本无有体。谁当生灭。无善可修无恶可断。心所取相及以经佛。尽当远离。但令内心安住空中。知世虚妄万法都无。虽是凡夫能如是解。此即是佛。已证禪定。已断生死。不受后有。何劳勤苦。远觅<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。亦不假念佛诵经為出离因。即此禪定。是无為法。是可修法。是可修法。是速疾法。是出离因。除此之外诸餘行门。悉皆虚妄。即如念佛诵经求生净土。<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒忍辱<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>乃至<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。写经造像建立塔庙。恭敬<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a><a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母。奉事师长等。是生死因非解脱因。何以故。见善可修见恶可断。<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>可欣生死可厌。誓断生死誓证菩提。悉皆动念心有所得。著相修习虚妄分别。是有為法。是生死法。虽复勤修。不免流浪者。余颇寻三藏。推求事理。观彼向来。禪师所见错谬弥甚。违经反理乖背佛意。岂有凡夫但住空门。不断不修<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>懒堕。而得解脱者哉。问曰。向言观空违圣教者。未审与何经教而有相违。答曰。即如无上依经上卷云。复有增上慢人。在<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>中。观空生于有无二见。是真空者。直向无上菩提。一道净解脱门。如是显了开示正说。于中生<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>。我说不可治。阿难。若有人执我见。如须弥山大。我不惊怪亦不毁訾。增上慢人执著空见。如一毛髮作十六分。我不许可。又<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>第七云。苦灭圣諦者。若有多修习学空法。是為不善。何以故。灭一切法故。坏于如来真法藏故。作是修学。是名修空。非苦灭諦。修苦灭者。逆于一切诸外道等。若言修空是灭諦者。一切外道亦修空法。应有灭諦。若有说言。有如来藏虽不可见。若能灭除一切<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。尔乃得入。若发此心。一念<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。于诸法中。而得自在。若有修习如来密藏。<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>空寂。如是之人。于无量世。在生死中。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>受苦。又维摩经第一云。譬如有人。欲于空地造立宫室。随意无碍。若于得见佛。难得禪定。难得解脱难得出离。缘此艰难。无上慈父。殷勤示诲。殷勤教诫。此是秽土。此是牢狱。此是火宅。无乐有苦。佛世难遇苦。正法难闻苦。禪定难得苦。圣果难证苦。邪见眷属苦。老病死逼苦。三涂罪报苦。怨家强会苦。王官逼迫苦。名利驱驰苦。求不随意苦。衣食贫乏苦。更相繫缚苦。常忧不活苦。恒惧恶名苦。贪生畏死苦。六道轮迴苦。有如是等无量苦。聚逼切身。心宜应厌离。专求西方阿弥陀佛国。然彼佛国。无苦有乐。无三恶趣乐超过八难乐。永断轮迴乐。老病死无乐。常见诸佛乐。听闻正法乐。随闻悟解乐。超凡证圣乐。入诸禪定乐。神通自在乐。游歷十方乐。圣眾共往乐。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诸佛乐。所须应念乐。一生不退乐。菩萨眷属乐。随形化生乐。永断生死乐。证大菩提乐。有如是等无量快乐。应当欣乐。发愿往生。愚痴眾生。不知恩德。反生诽谤。毁訾不信。爱著三界。六道轮迴。不乐往生。安乐</p><p>為理。若执己见。不依圣教。言无為法许可修习有增益者。即无為法。便有生灭。何以故。许有增益故。夫有增益者。皆有生灭。许有生灭。便同有為。亦是虚妄。若许虚妄。便违圣教。及害己宗。若不许者。与理相违。何以故。自许无為有生灭等故。又<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>三学皆是有為。禪定即是六度三学随一所摄。如何确执是无為耶。进退徵詰。逃窜无处。无明厚重。我慢山高。执自己见。强违理教。一何迷昧。但学坐者。无问道俗。心多闇塞。触徒抵滞。不闲圣教。语多疏失。确执阿耨多罗三藐三菩提。及彼禪定菩提四智等。有為之法。并是无為。凝然<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。却说无為常住之法。许可修习体有增益。若如此者。无為之法便成有為。有為之法翻作无為。此即说无為。有说有為。<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>与无常。并被迴换。执此谬解。以之為正。纵引圣教。晓彼迷情。令归正理。反生诽谤。亦不信受。譬如迷人随自迷意。东西南北并皆迴换。然不迷者。怜愍彼故。方便告语。如汝所见。东西南北。迷心故尔。非正知也。迷人闻已。倍生忿怒。汝自迷乱。不辨东西。却冤于我。迷彼南北。不以為得。翻以為失。不领好心。便成挣论。今时道俗亦复如是。怖畏生死。各求出离。迷一生路。弃而不修。倾心迂迴。长劫路中。繫念观空。苟偷朝夕。眾迷共执。以為捷径。不知更有。方便要津。贫道自至。伤愍彼故。开张捷路。净土要门。指示西方。令其趣入区分<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。不令混杂。刊定是非。摧邪显正。愚人闻者。倍益瞋心。智者见之。故应迴向。先闻。正法者。邪法不能动其心。先染邪法者。正法卒难令彼信。各怀我见。朋附执心。熏习所师。不肯迴向。如龟藏六。护惜瑕疵。但见他非。不思己过。佛法一味。应无彼此。因行万差。那无迟疾。得胜即须。捨劣遇疾。宜应弃迟固执不移。岂免生死。祇如有為无為。有漏无漏。定与非定。可修不修。证与非证。凡与非凡。迟之与疾。义理分明。尚未能了</p><p>地。变现自在。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长短。延促随意。六者漏尽通。他方此界一切眾生。及自己身。断诸惑漏。品数多少。<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>地位。于一念顷。悉皆具知。无有错谬。此六通即是定果。然今道俗言已证者。未委证何禪定。若证有漏定者除漏尽通。得餘五通。若证无漏定者。应得六通。故<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>第一偈云。又见菩萨。常处空闲。深修禪定。得五神通。圣教明文必不虚说。自禪门东流。未曾闻有证五通者。况六通耶。通义尚未能了。焉知。禪定证与非证。但行欺诈。谤无净土。轻蔑圣教。埋没世尊。显扬己德。阐提无信。何异此也。夫求禪定。先持斋戒。斋戒為因。方能引定。故月灯三昧经第一偈云</p><p>功用无量乃得成若深观此能得定</p><p>无物能将此定来必由净戒之所起</p><p>然坐禪者。于彼斋戒。心全慢缓。多分不持。以何為因。而得禪定。何以得知。学坐之人。不持斋戒。以<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>知。非比知也。出家者。过中药食。种数千般。咨情尽足。在家者。三时饱食。持斋何在。酒通药分。熏秽令补。病服鸟残。及自死者。净戒安存。以此理推。不持斋戒。但养见身。詎修来报。口虽说空。行在有中。以法训人即言。万事皆空。及至自身。一切皆有。不能亡躯。徇道斋戒。一时日夜。资持唯愁不活此。乃行参尘俗。<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>之义远矣。幸有智者。见而思之。弃彼迷徒。应随达者。又禪定者。上人之法。实未<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。言已得者。若约戒结。罪犯波罗夷。据经论。重堕增上慢。然今坐者。多犯此罪。何以故。师资互讚皆云。已得已证故。复言坐者。即于此身。证悟圣果。永断生死。更不受生。禪师错失。事在于此。非但陷他。亦成自累。又诸禪师。劝诸道俗。自内求佛。不假外佛。為善知识者。亦应不假禪师教导。自解看心。然禪师者。即是凡夫。都无证解。令诸道俗奔波奉事。爱过父母。悲泣雨泪。捨命求乞。一言何不令内求遣外求耶。设使得者。浮浅之言。不足可观</p><p>湛然常住。而无生灭。初役可得。禪师亦说。一切虚妄。空无一物。与彼外道空见何殊。又复说言。学无生观者。尽此一生。更不受生。然此与彼断见外道计执何异。复说一切诸法真如体一。湛然常住。不生不灭。无有初念后念可得。此即与彼常见外道见解何别。受佛依廕。不思报思。厌佛嫌经。不念不诵。此即善星不异。调达何殊。缘斯僻见。害于正法。忝為<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>。那不雌黄。乐求解脱。见佛闻法者。净土行门最為捷速。爱著三界。不求解脱者。随分安心以度时日。幸有智者思之察之。随所乐欲简而行之。禪师又云。念佛生净土者。著相修习。是虚妄法。非<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>因者。窃為未可生死。心中出此麤言。非顺圣教。如大宝积经第十七云。若有眾生。发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。专念无量寿佛。及修诸善。迴向愿生。是人临终。无量寿佛与<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>眾。迎生彼国。得不退转。当证无上正等菩提。大<a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>上卷云。一向专念无量寿佛。少.多修善。奉持斋戒。乃至其人临终。无量寿佛。化现其身。光明相好。具如真佛。与诸大眾。现其人前。即随化佛。往生其国。住不退转。<a href=\"/fojing/emituojing/41135.html\" class=\"keylink\" target=\"_blank\">阿弥陀经</a>云。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。若有善男子善女人。闻说阿弥陀佛。执持名号。若一日。若二日。若三日。若四日。若五日。若六日。若七日。一心不乱。其人临命终时。阿弥陀佛。与诸圣眾。现在其前。是人终时。心不颠倒。即得往生阿弥陀佛极乐国土。乃至若有人。已发愿。欲生阿弥陀佛国者。是诸人等。皆得不退转。于阿耨多罗三藐三菩提。观无量寿<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>下文云。善界子善女人。但闻佛名二菩萨名。除无量亿劫生死之罪。何况忆念。若念佛者。当知。此人是人中分陀利华。<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>。大势至菩萨。為其胜友。当坐道场。生诸佛家。此等经文。皆云。念佛往生净土。当成正觉。如何禪师。判為虚妄。非成佛因。岂不与此诸教相违。法华经第一方便品下偈云</p><p>我记如是人来世成佛道以深心念佛</p><p>修持净戒故若人散乱心入于塔庙中</p><p>一称南无佛皆已成佛道</p><p><a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>六十二云。令安住力。念<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>。令入如来十力中故。观佛三昧经第一云。佛告父王。念佛之心亦复如是。以是心故。能得三种菩提之根。观佛三昧经第九云。释迦牟尼佛。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨。过去于彼旃檀佛所。<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>念佛三昧。今乃成佛。又观佛三昧第十云。行念佛者。如大力士挽心王锁断到慧<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。文殊波若经下卷云。若善男子善女人。欲入一行三昧。应处空闲。捨诸乱意。不取相貌。繫心一佛。专称名字。随佛方所。端身正向。能于一佛。念念相续。即是念中。能见过去未来现在诸佛。何以故。念一佛<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>无量无边。亦与无量诸佛功德。无二不思议。佛法等无差别。皆乘一如。成最正觉。如是等文。诚证非一。皆云。念佛是菩提因。何忽专輒以凡情见解。违诸圣教。说為虚妄。非成佛因。一何孟浪。禪师复言。读诵大乘经典。著相虚妄。非成佛因者。此无义言。甚于猛火。焚烧佛法。害人善根。眾生眼目。从冥入冥。长养三涂。断灭佛种。忝為种子。闻此麤言。那不痛切。彻于心髓。引经救义。挫彼邪徒。立破成败。须关典誥。所以广引圣教。示彼迷人。信若不生。诚死难救。请诸禪师。侧耳细听。诸教定量。皆世尊语。无虚妄说。即如金刚波若经云。须菩提。于意云何。若人满三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。七宝以用布施。乃至若复有人。于此经中<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。乃至四句偈等。為他人说。其福胜彼。何以故。须菩提。一切诸佛及诸佛。阿耨多罗三藐三菩提。皆从此经出。下文又云。若有人能受持读诵。广為人说。如来悉知。是人悉见。是人皆得成就。不可量不可称。无有边不可思议功德。如是人等。则為荷担如来阿耨多罗三藐三菩提。何以故。须菩提。若乐小法者。著我见人见。眾生见寿者见。则于此经。不能听受。為人解说。準此经文。不肯读诵。听闻解说。默然坐者。是乐小法人。著我见人见。眾生见寿者见也。又云。复次须菩提。若善男子善女人。受持读诵此经。若為人轻贱。是人先世罪业。应堕恶道。以今世人轻贱故。先世罪业则為消灭。当得阿耨多罗三藐三菩提。涅槃经第六云。譬如<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>虽未具戒。即堕僧数。善男子。若有眾生。<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>始学人。涅槃经书。持读诵。亦复如是。虽未具足位阶十住。则已堕于十住数中。或有眾生。是<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。或非<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。若因恐怖。或因利养。听受具经。乃至一偈。闻已不谤。当知。是人则為已近。阿耨多罗三藐三菩提。又云。若有能听如是经者。即不退转于阿耨多罗三藐三菩提。随其所愿。悉能成就。如我今日所可宣说。又涅槃经说。雪山童子。為求半偈。捨所爱身。以餧罗剎。以此為因。乃致作佛。佛报恩经第二云。转轮圣王。為求半偈。剜身千灯。缘此胜因。乃致作佛。佛报恩经第七云。菩萨勤求十二部经。所以者何。念佛重恩。為欲流布诸佛正法。為欲增长诸佛法故。為令<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>信佛法故。為令一切无量眾生悉得无上菩提故。金光明经第八云。是诸眾生听斯经者。于未来世。无量百千俱胝那庾多劫。天上人中。常受胜乐。得遇诸佛。速成阿耨多罗三藐三菩提。金光明经第九偈云</p><p>昔时宝积大法师為彼善生说妙法</p><p>因彼开演经王故东方见成不动佛</p><p>我昔闻经<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>善所获福聚量难知</p><p>由斯福故证菩提获得法身真妙智</p><p>金光明经第十云。汝等能于如是经王。虔诚流布。乃至于我般涅槃后。不令散灭。即是无上菩提正因。法华经第三云。若声闻辟支佛。及诸菩萨。信是十六菩萨所说经法。受持不毁者。是人皆当得阿耨多罗三藐三菩提。如来之慧。法华经第四偈云</p><p>其有欲疾得一切种智慧当受持是经</p><p>佛时。于一切法。方便无碍眾生。来生其国。三十七道品。是菩萨净土。菩萨成佛时。念处正勤神足根力觉道眾生。来生其国。迴向心。是菩萨净土。菩萨成佛时。得一切具足功德国土。乃至十善道。是菩萨净土。菩萨成佛时。命不中夭大富梵行。所言诚諦。常以软语。眷属不离。善和挣讼。言必<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>。不嫉不恚。<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>眾生。来生其国。华严经第十三云。尔时文殊师利菩萨。问智首菩萨言。佛子。于佛法中。智為上首如来。何故。或為眾生。讚叹布施。或讚持戒。或讚堪忍。或讚精进。或讚禪定。或讚智慧。或复讚叹。慈悲喜捨。而终无有。唯以一法。而得出离。成阿耨多罗三藐三菩提者。时智首菩萨以颂答曰</p><p>佛子甚希有能知眾生心如仁所问义</p><p>諦听我言说过去未来世现在诸导师</p><p>无有说一法而得于道者佛知眾生心</p><p>性分各不同随其所应度如是而<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a></p><p>慳者為讚施毁禁者讚戒多瞋為讚忍</p><p>好懈讚精进乱意讚禪定愚痴讚智慧</p><p>怒害讚大悲忧慼為讚喜曲心讚叹捨</p><p>如是次第修渐具诸佛法如先立基堵</p><p>而后造宫室施戒亦复然菩萨眾行本</p><p>譬如建城郭為护诸人眾忍进亦如是</p><p>防护诸菩萨譬如大力王率土咸戴仰</p><p>定慧亦如是菩萨所依赖亦如转轮王</p><p>能与一切乐四等亦如是与诸菩萨乐</p><p>如是等经。广说诸行。是成佛因。非但六度。如何禪师。确执禪定。成佛正因。非餘度耶。然诸圣教说智胜。成佛正因。餘皆助缘。即如华严经第十三云。文殊师利问智首菩萨言。佛子。于佛法中。智為上首。大无量寿经上卷偈云</p><p>布施调意戒忍精进如是三昧</p><p>智為上首</p><p>进此经文。智為第一。如何偏讚禪定為胜。故博学者辩才无碍。寡闻者辞理俱滞。何不摧伏人我听所。未闻屈节于师。諮量未悟。贡高我慢。不肯稟承。空腹高心发言违教。于人无耻邪不愧佛。然诸禪师。不顾圣教。胸臆自断。不可依信。禪师复言。造像有為功德。非成佛因者。此亦非理。违圣教量。佛有诚言。备在诸经。殷勤称讚。造像功德。灭过现殃。来成正觉。如何卒暴。违佛言教。不许為因证菩提耶。问曰。若能為因感菩提果。凭何典誥而得知耶。答曰。诸经总说。略引二部。证成此义。即如造像经上卷云。若复有人。能于我法。未灭尽来。造佛像者。于弥勒初会。皆得解脱。若有眾生非但為己。而求出离。為欲得无上菩提。造佛像者。当知。此则為三十二相之因。能令其人速致作佛。造像经下卷复云。尔时弥勒菩萨摩訶萨白佛言。世尊。如佛所说。于佛法中。犯波罗夷。不名為生。或复有人。作斯罪已。发心忆念诸佛功德。而造佛像。于佛法中。得再生否。又于今生第二第三第四生中。获证法否。佛告弥勒菩萨言。弥勒。譬如有人。身被五缚。若得解脱。如鸟出网。至无碍处。此人亦尔。若发<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>念佛功德。而造佛像。一切<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。皆得消除。于生死中。速出无碍。弥勒。当知。乘有三种。所谓声闻乘。独觉乘。及以佛乘。此人随于何乘。而起愿乐。即于此乘。而得解脱。若但為成佛。不求餘报。虽有业障。而得速灭。虽在生死。而无苦难。乃至当证无上菩提。获清净土。具诸相好。所得寿命。常住无尽。下文又云。善男子。假使如前。微尘等数。舍利弗等。所有智慧。不及如来一念之智。何以故。如来于念念中。常能出现过前尘数三昧解脱陀罗尼等。种种无量胜功德故。诸佛功德。一切声闻。辟支佛。于其名字。亦不能知。是故若有清信之心。造佛形像。一切业障。莫不除灭。所获功德无量无边。乃至当成阿耨多罗三藐三菩提。永拔眾生一切苦恼。法华经第一方便品下偈云</p><p>若人為佛故建立诸形像刻雕成眾相</p><p>皆已成佛道或以七宝成鋀石赤白铜</p><p>白鑞及鈆锡铁木及与泥或以胶漆布</p><p>严饰作佛像如是诸人等皆已成佛道</p><p>彩画作佛像百福<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>相自作若使人</p><p>皆已成佛道乃至童子戏若草木及笔</p><p>或以指爪甲而画作佛像如是诸人等</p><p>渐渐积功德具足大悲心皆已成佛道</p><p>若欲具引诸经。恐烦纸墨。依斯两教。足明优劣。故知。信心造像。功德无涯。剋证菩提。断除诸难。依经敬造。必至涅槃。若取谬言。婴缠生死。比未闻教。轻佛重人。今见经文。那不迴向。禪师复言。书写经律。著相虚妄。非成佛因者。此语非善。违害圣教。欲陷眾生。堕邪见网。必其书写。有损无益者。何故世尊苦劝眾生。剥皮折骨。令写经律。<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>云。若佛子。常应一心。受持读诵大乘经律。剥皮為纸。刺血為墨。以髓為水。折骨為笔。书写佛戒。树皮穀纸。绢素竹帛。亦悉书持。常以七宝无价香华。一切杂宝。為箱盛经律卷。若不<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>供养者。犯轻垢罪。下文又云。若佛子。皆以信心<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>者。若国王王子。百官四部弟子。自恃高贵。破灭佛法。<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>明作。制法制我。四部弟子。不听出家行道。亦复不听造立形像佛塔。经律立统。制眾安籍。记僧比丘。菩萨地立。白衣高座。广行非法。如兵奴之法。而菩萨正应受一切人供养。而反為官走。使非法非律。若国王百官。好心受佛戒者。莫作是破<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>之罪。而作破法者。犯轻垢罪。準此两节戒文。若不剥皮刺血书写经律。犯轻垢罪。制不令书。亦犯轻垢罪。故知。信心书写。当祈解脱。与作碍缘。必招来苦。法华经第四法师品云。若善男子善女人。于法华经。乃至一句。受持读诵。解说书写。种种供养经卷。华香缨络末香。涂香<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>。繒盖幢幡。衣服伎乐。合掌恭敬。是人一切世间。应所瞻奉。应以如来供养。而供养之。当知。此人</p><p>相既不殊。还同虚妄。由此理故。為证菩提。所修诸行。虽皆取相。而非虚妄。必能為因。证涅槃。故不同妄情。计度分别。我我所执。颠倒虚妄。问曰。修菩萨行。虽皆取相。必能為因。而非妄者。何故。金刚波若楞伽等经云。凡所有相。皆是虚妄。今言有相非虚妄者。与此圣教。岂不相违。答曰。诸圣教中。说虚妄者。有其四义。第一理事相对说虚妄。第二生死离繫<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>相对说虚妄。第三凡圣相对说虚妄。第四有<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>对说虚妄。第一理事相对说虚妄者。理真事妄。何以故。理即圆成实性。无為法故。凝然常故。无去来故。无增减故。无生灭故。体坚实故。无变易故。事即依他起性。有為法故。缘生法故。有增减故。有生灭故。如坏幻故。有变易故。所以将事望理。理真事妄。此即有体虚妄。非如兔角。第二生死离繫因果相对说虚妄者。离繫因果真。生死因果妄。何以故。因真故果真。因妄故果妄。因果相感法尔。如是生死果妄。离繫果真。何以故。生死<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。轮迴不定。得失无恒。离繫之果。得而不失。证而无退。无恒故妄。无退故真。所以因随于果。真妄必同。果从于因。理齐虚实。若将生死。望于离繫。生死因果。虽有体而虚妄。离繫因果。绝羈锁而故实。离繫果者。即菩提涅槃。更无别物。果唯无漏。因通有漏。菩萨有二。顿渐别故。顿悟菩萨地前有漏渐通无漏。七地已前通漏无漏。八地已去无漏相续。第三凡圣相对说虚妄者。凡妄圣真。何以故。凡夫颠倒。不能了知常与无常。生死涅槃。青黄赤白。男女等法。本无名字。随世假立。迷情计实。寻名执著。强生分别。境分违顺。便有憎爱。二心而起。无量烦恼。随二心生。无明厚重。不了假名。依之执实。造生死业。菩萨不尔。远离颠倒。了达一切。常与无常。生死涅槃。青黄赤白。男女等法。本来无名。欲起言说。呼召诸法。随顺世俗。假立名字。了知名法。互不相属。何以故。一切诸法。离于言论。说不及故。但為遮詮假立名目。今知彼此。而无杂乱。炽然说法。度脱眾生。广立名目。开张<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>。指有涅槃。今厌生死。劝遣精进。断恶修善。知立假名。表詮诸法。依名取解。而无封执。封执既无。憎爱不生。烦恼不有。烦恼既亡。虚妄心断。虚妄心息。名之為圣。所以将凡望圣。凡见虚妄。非圣所解。同凡所见。亦虚妄也。经言。虚妄但约妄心。以心妄见。不称境知。说彼妄见。名為虚妄。不可令彼一切诸法。随妄见心总皆虚妄。若言诸法定随妄心虚妄无者。妄心疑杌為人鬼。杌非虚妄。彼既不尔。此云何然。故知。不可以心妄故令境皆妄。第四有无相对说虚妄者。无妄有真。何以故。无即遍计所执性。有即依他起性。然依他起法。缘生幻有。法从缘生。缘从法有。缘法和合。可有形段。可有作用。而知有物。即如遍计所执之我。空无有物。依彼<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>迷情妄执。计有实我。异于五蕴。别有体性。然此我体。无非妄计。无有作用。形段可知。因兹妄执。增诸惑业。忧悲苦恼。从此而生。譬如迷绳。妄生蛇想。蛇无是妄。绳有故真。依他况绳。我类于蛇。我体空无。无故虚妄。依他法有。有如幻有。然诸圣教说虚妄者。不过此四。智者寻文。宜识经意。虚妄言宽有无俱遍。各据一义。与教何违。若言世尊说诸有為。定如空华。无有一物名虚妄者。虚妄无法。非解脱因。如何世尊。敕诸弟子。勤修六度。万行妙因。当证菩提涅槃之果。岂有智者。讚乾闥婆城。坚实高妙。复劝诸人。以兔角為梯。而可举陟者哉。由此理故。虽是凡夫。发菩提心。行菩萨行。誓断生死。趣大菩提。所修诸行。虽然有漏。著相修习。是实是正。有体虚妄。非如龟毛。空无一物。说為虚妄。若能如是解经意者。常行于相。相不能碍。速出生死。速得解脱。迷情局执。于教不通。虽求离相。恒被相拘。欲求解脱。反沈生死。良為禪师。不乐多闻。见解浮浅。执心有在。迷昧圣言。虽复勤苦。专求出离。于彼行门。不了迟疾。妄与非妄。有之与无。邪之与正。假使修行。无利勤苦。故涅槃经云。譬如有人乘船游戏。琉璃宝珠。堕落深水。眾人竞取。各得瓦石。谓為真实。便生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>。若有人说。汝所得者。悉是瓦石。琉璃宝珠。现在水下。亦不信受。然诸禪师。亦复如是。共传虚偽邪僻之法。谓為真实。各自保爱。欢喜而行。若有智者。依诸圣教。為说佛法。真实禪定。修学行门。毁而不信。弃<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>三慧<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>。取无记心。不断不修。以為真实。此即谬中之谬。无过此也。何以故。夫无记者。非善非恶。中庸之心。不从分别。思虑而起。随逐因缘。任运转故。体性羸劣。不能為因。感三有果。况彼解脱出世妙果。而能证耶。闻思<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>。解脱正因。何不安住。自利利他。展转相传。住无记心。确执不移。岂不谬乎。如来法门八万四千。随宜為说。散在诸教。无智懈怠。不能遍览。执自愚见。以為究竟。迷昧捷径。迂路倾心。三界往来。不求见佛。哀哉可愍。颠倒眾生。岂有远离诸佛如来。得成佛耶。或有一类男女道俗。于彼净土。都不信有。但令心净。此间即是。何处别有西方净土。奇哉罪业。不信圣教。岂佛世尊虚妄说耶。然菩提道八万四千。其中要妙。省功易成。速得见佛。速出生死。速得禪定。速得解脱。速得神通。速得圣果。速得自在。速遍十方。供养诸佛。现大神变。遍十方界。随形六道。救摄眾生。有进无退。万行速圆速成佛者。唯有净土一门。尽此一形。专心修学。愿生彼国。如是等法。悉皆咸就。何以得知。得生净土。如是等法。悉皆成就。观无量寿佛经。上品上生文中说云<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>自见其身。坐金刚臺。随从佛后。如弹指顷。往生彼国。即悟无生法忍。经须臾间。歷事诸佛。遍十方界。于诸佛前。次第受记。还至本国。得无量百千陀罗尼门。以此文证得而非谬。祇如坐禪习定久受勤苦。经歷多劫。难行苦行。难得成就。退多进少。难得见佛。难得禪定。难得解脱。难得出难。缘去疑难。无上慈父殷勤示诲。殷勤教诫。此是秽土。此是牢狱。此是火宅。无乐有苦。佛世难遇苦。正法难闻苦。禪定难得苦。圣果难证苦。邪恶眷属苦。老病死逼苦。三涂罪报苦。怨家强会苦。王官逼迫苦。名利驱驰苦。求不随意苦。衣食贫乏苦。更相繫缚苦。常忧不活苦。恒惧恶名苦。贪生畏死苦。六道轮迴苦。有如是等无量苦聚。逼功身心。宜应厌离。寻求西方阿弥陀佛国。然彼佛国无苦有乐。无三恶趣乐。超过八难乐。永断轮迴乐。老病死无乐。常见诸佛乐。听闻正法乐。随闻悟解乐。超凡证圣乐。入诸禪定乐。神通自在乐。游歷十方乐。圣眾共往乐。供养诸佛乐。所须应念乐。一生不退乐。菩萨眷属乐。随形化生乐。永断生死乐。证大菩提乐。有如是等无量快乐。应当欣乐。发愿往生。愚痴眾生不知恩德。反生诽谤。毁呰不信。爱著三界。六道轮迴。不乐往生安乐世界。或有发心。厌生死苦。速求解脱。不遇善友。于净土门。多怀犹豫。不能决定。专心趣向。随逐眾迷。观空拨有。苟偷朝夕。循环火宅。任性沈浮。今為此等无归趣者。迷谬执者。不信净土者。犹豫不决者。搜扬圣教。采撮要妙。念佛法门。鳩集一处。令彼见闻。总皆迴彼。无信者令信。迷谬者令悟。无归者有归不决者令决。若能迴向愿生净土者。端身正向。西方净土。繫心于彼阿弥陀佛。念念相续。称彼名号。行住坐卧。常须称念。兼念观世音菩萨。诵观无量寿佛经。及阿弥陀经。每日一遍。酒肉熏辛。以死為期。断而不食。药分不通。奉持斋戒。清净三业。念佛诵经。迴向愿求。上品上生。尽此一形。必定往生。超昇净剎。顿捨流浪。三界长辞。禪定神通。生便即得。一念之顷。遍十方界。所过国土。歷事诸佛。经百万亿。供养事讫。与恒沙眾。瞬息之间。还至本土。日日如是。乃至成佛。若大悲方便。化导群生。能于一念。分身遍往十方世界。随彼所宜。现身说法。令得解脱。问曰。阿弥陀经唯言。念佛得生净土。何故。今者兼令诵经。及念二大菩萨。方得往生。答曰。阿弥陀经。但令念佛。得生净土。不开九品。行业差别。今依观经。位分三辈。行开九品。上品上生。必须持戒。念佛诵经。并念菩萨所以。观经上品上生文中说云。一者慈心不杀。具诸戒行。二者受持读诵大乘。方等经典。三者修行六念。迴向发愿。愿生彼国。具此功德。一日乃至七日。即得往生。六念者。一者念佛。二者念法。三者念僧。四者念施。五者念戒。六者念天。今念观音势至。即是菩萨。圣僧準此经文。上品上生。要须念佛。诵经并念菩萨。各据一义。亦不相违。若不断酒肉熏辛。命终之后。必堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。人身尚失。况乎净土。故<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>第八。遮食肉品云。是故大慧。我见一切诸眾生等。犹如一子。云何而听以肉為食。亦不随喜。何况自食。大慧。如是一切葱韭蒜薤。臭秽不净。能障圣道。亦障世间人天净处。何况诸佛净土果报。酒亦如是能障圣道能损善业。能生诸过。是故大慧。求圣道者。酒肉葱韭及蒜薤等。能熏之味。悉不应食。下偈又云</p><p>為利杀眾生為肉追钱财彼二人恶业</p><p>死堕叫唤狱</p><p>菩萨戒又云。若佛子故饮酒。而酒生过失无量。若自身手过酒器。与人饮酒者。五百世无手。何况自饮。不得教一切人饮。及一切眾生饮酒。况自饮酒。一切酒不得饮。若故自饮。教人饮者。犯轻垢罪。若佛子故食肉。一切眾生肉不得食。断大慈悲。<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>种子。一切眾生。见而捨去。是故一切菩萨。不得食一切眾生肉。食肉得无量罪。若故食肉者。犯轻垢罪。若佛子不得食。五辛大蒜各葱慈葱兰葱兴渠。是五种一切食中不得食。若故食者。犯轻垢罪。準此经戒。饮酒食肉。及以熏辛。必坠三涂。人身不复。何况净土出世妙果。而可得耶。故须</p></div>"
}]