[{
    "title": "盂兰盆经讚述 第2781部",
    "author": "慧净法师",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/yulanpenjing/\" class=\"keylink\" target=\"_blank\">盂兰盆经</a>讚述</p><p>自他之□□□□□□□□□□□□□畅八辨而动□□□□□声而流□□□□□□□□□□□□言经从教主為名故称佛说盂□□□□□□□□□□□异流上出纔连皮骨命似倒悬既□□□发起□□称曰<a href=\"/remen/menglanpen.html\" class=\"keylink\" target=\"_blank\">盂兰盆</a>者。即成食之器。甘□百味□□□方此无加香积名餐悉俎。在于盆内。奉佛施僧。以救倒悬之苦。故曰盆也。经者能詮之教。梵语云修多罗。新翻云素呾揽。此云為经。亦名為綖。经有五义。略据二途。一曰涌泉。即住而无竭。二称绳墨。即契定正邪。詮定无改故名為经。依佛地论。能贯能摄故名為经。以佛圣教贯穿摄持所应说义所化生故。应知此中宣说兰盆拔苦孝行<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情。依所詮义故名為经。如缘起经集宝论等故名為经</p><p>此经三分。一教起<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>分。二目连大叫下明圣教所说分。三目连白佛言下明依教奉行分。明教起所因所缘故。释教起因缘分。正显圣教所<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>门品类差别故。云圣教所说分。显彼时眾闻佛所说<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>奉行故。名依教奉行分。若依旧解。名序正<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。与新经论三分不异。初教起分中。一明证信分。二明发起分。证信分中。闻者出能闻人。只是传法之人。即阿难是。如是者出所闻法。表经可信。闻者如来圆音纔振。眾即翘心专注。耳识采揽。故名為闻。餘经具道我闻。今此经略去我字。故但言闻。依佛地论。我谓诸蕴世俗假者。闻谓耳根发识听受。废别就总故说我闻。又如来悲愿增上缘力。闻者识上文义相生。此文义相。虽依眾生自善力起。就佛强缘名為佛说。由耳根力自心变现故名我闻。又闻者善根增上缘力。如来识上文义相生。此文义相是佛利他善根所起故名佛说。闻者<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>虽不取得。然似彼相分。明显现故。曰我闻</p><p>经曰如是者述曰。下出所闻法。如者称理之言。是者简非之称。若如不即理以之為非。如即理如故云為是。亦可是信相也。信即内心决定為习。道之某相。乃发言即可劝物同趣。所以口心决定即為信相。信相既入道之始。如是亦经序之初。依佛地论。如是之言信可审定。谓如是法。我昔曾闻此事如是。齐此当言定无有异。又云。如是总言。依四义转。一依譬喻。谓。当所说如是文句。如我昔闻。此以今譬古。二依教海。谓。告时眾汝等当听。我昔所闻。三依问答。谓。有问言。汝当所说昔定闻耶。故次答言。如是我闻。四依许可。谓。结集之时。诸菩萨眾咸共请言。如汝所闻。当如是说。传法菩萨便许彼言如是当说。如我所闻。具此四义故曰我闻。上来证信分讫经曰一时者述曰。下明发起分有四句。一明起教时。二明起教主。三明起教处所。四明起教人。一时者起教时。谓。说者法义天真朗然啟悟。听者即翘心注想文句无倒。斯即法泽降流之日。德侣蒙赖之辰故曰一时。若不尔者。字名句等说听时异。云何言一。或能说者得陀罗尼于一字中。一剎那领能说能持一切法门。或能听者得许耳根一剎那领得一字时。拾餘一切皆无障碍悉能领受故名一时。或相会过时分无别故名一时。即是说听共相会遇同一时义故名一时</p><p>经曰佛者述曰。第二明起教主。如来迥弃嚣尘独超臣庭。圆智之犹明镜。悲愿之似摩尼。彼我之化天戏。自他之利不息故名為佛。依佛地论佛者是一切智一切种智。离<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障及所知障。于一切法一切种相能自开觉。亦能闻觉一切有情。如睡梦觉。如莲花开。故名為佛</p><p>经曰在舍卫国耆树给孤独园者述曰。此第三明起教处所也。舍卫国者此云名物国。以彼国中积有餘物多有异珍。既名振遐邦声流远国。即為名也。祇树者即祇陀也。此云战胜。即太子名也。给孤独者。此云须达即是国臣之号。若依今日<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师新经及论云室罗伐誓多林给孤独园。良以旧来三藏不善方音。遂置讹谬若身梵本。应言室罗伐悉底国。略去悉底也。唐云名闻国。上古之时有兄弟二人居时习仙而获仙证。而此仙人名闻第一。為国之宝。后时于此安国立堵。即以二仙之名為国城之称。或曰多闻国。此国多有聪明学问。能造论记。九十六种外道师弟此中最多。又十六大国。而此国中见有<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>。普胜餘方。一财物德。二欲尘德。三法德。谓施戒修四<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>德。谓出世果故曰多闻。誓多者旧云祇陀。语讹也。此云战胜。太子生时邻国怨至。振而得胜故云战胜。林者国树之总名也。园本誓多所有须达布金买之地。得安金园属须达。树妨布价。林归誓多。给孤独者即须达也。唐言善兴。即国之大臣也。富财丰德。恒以财物给孤济穷。时人所重。故云给孤独也。真諦三藏云。须达多為过去鳩留村驮佛时。已于此地起精舍<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>。尔时地广四十里。佛及人寿四万岁须达尔时名毘沙长者。以金板布地。宝衣覆之。而為供养。俱那含牟尼佛时。佛及人寿三万岁。须达尔时名大家主长者。以银布地而為供养。尔时此地广三十里。<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>波佛。佛及人寿二万岁。须达尔时名大幡相长者。以七宝布地。地广二十里。今第七释迦牟尼佛。佛及人寿百岁。地广十里。以金饼布地。周满其中。皆厚五寸。买园奉佛。后<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>出世时。佛及人寿八万岁。地广四十里。以七宝布地。须达尔时名让佉。<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a><a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>获罗汉果</p><p>经曰大目健连始得六通者述曰。此第四明起教人也。有二。初德。二述孝。大目健连者。据起教之人。但如来对人起说不同。或因孝行兴起。谓大方便报恩经等。彼经中阿难问佛。<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>之中破有<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>父母者不。如来即引须闍太子慈孝因缘。引彼经文出报恩经第一卷中。或因恶逆起说。谓<a href=\"/fojing/guanwuliangshoujing/yuanwen.html\" class=\"keylink\" target=\"_blank\">观无量寿经</a>等。彼经明闍王杀父害母造二逆罪故。如来為说<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>之行。今此经者。盖由目连兴起也。然目连即二行第一。所以对之。一神足第一。谓以天眼通访觅其母。二慈孝第一。谓得果已念报父母乳餔之恩。如似孔子说孝行。上从天子下至庶人。皆当行孝。然别对曾子以说其孝。以曾子有敦孝之性。所以对之。今此亦尔。然一切<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>皆当行孝。然别对目连為起说之由。言目连者。目连是姓。字俱律陀。以祠俱律陀树神故即以為名。以彼国人贵其姓故。从姓為名。故曰目连。始得六通者。叹其德明。目连超间究定。游神七觉道。除三漏果获六通。通现创成。故云始得。问。何故目连先不度母。得通果遂方救母耶。答。未获果时烦恼未尽。即有障碍不能拔苦。是故经云。若有自缚能解彼缚。无有是处。复言。辟如不解浮人能救溺者相共俱得故。须具德方救母苦</p><p>经曰欲度父母报乳哺之恩者述曰。第二明其述孝有二。一述<a href=\"/remen/xiaoxin.html\" class=\"keylink\" target=\"_blank\">孝心</a>。二述孝事。此述孝心也。曩裁我母生我劳悴。怀恩既重。理须酬报。是以阿含经云。佛告诸<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。常念<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>供养父母。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>云。寧于一日受三百钻以钻其身。不应起一念恶心向于父母。何以故。父母恩重故。依末罗经。母怀子十月。如负太山之重。乳哺三年。育养之恩。号天罔报。纵令从地积聚珍宝上至二十八天。悉以施人。所得<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。不如供养父母一分功德也。云乳哺者。依智度论云。乳哺三年。诸母养育。渐次长大。三年之内。在母怀抱。推于去漯以爱子故向变為乳而养育之。依阿含经阎浮提儿生堕地。堕地乃至三岁。母之怀抱為饮几乳。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>答曰。饮乳一百八十斛除母腹中所食血分。东弗婆提儿堕已乃至三岁。饮乳一千八百斛。西拘耶尼儿生堕地已乃至三岁。饮乳八百八十斛。北鬱单越儿生已坐苞陌头。行人授指啛指旨便成大人。彼土无乳故亦云乳哺之内也</p><p>经曰即以道眼观视世界者述曰。此明孝事也。孝事有五。一追访。二得见。三<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>。四往救。五无益。目连即以天眼伸闚<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。傍观六趣。尽其神力追觅其母也</p><p>经曰见其亡母生饿鬼中不见饮食皮骨连立者述曰。此第二得见。目连率已通力竖朗三界。横照十方。追访既周。显然得见。既魂此道受苦难论。不见饮食等者。明见正报。饮食资养其身。即肤包充洁。既绝内资养。唯有皮骨违形</p><p>经曰目连悲哀者述曰。此痛苦也。哀哉父母爱育劬劳一旦永摧。说论恶道。目连虽不灭姓痛彻心肝。悲涕横流。哀声动地。故云悲哀也</p><p>经曰即闶⒎雇?A其母者述曰。往救也。母既皮骨连立。绝食已经多年。子即感结良染。遂将食往救也</p><p>经曰母得惴贡阋宰笫终戏褂沂执?呈澄慈肟诒涑苫鸹艺呤鲈弧4宋抟嬉病C髂苛?迅闯质惩?任抟嬗谀浮W笫终戏拐邞a也。右手揣食者明于贪也。其母纔兴慳吝则掩握纵横隳谙悴退俣?浠?</p></div>"
}]