[{
    "title": "示所犯者瑜伽法镜经 第2896部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>示所犯者瑜伽法镜经</p><p>□□□□□□□□住<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>大□□</p><p>□□□□□在情喻如意珠无价宝</p><p>一切诸法禪观中是大相应观行主</p><p>若得最胜相应法于瑜伽中无与等</p><p>或现梵释四天王或作外道大仙眾</p><p>或复变化作<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>普遍法界能出现</p><p>或现八臂菩萨等或现三目光焰盛</p><p>彼得瑜伽<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>者能作<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>种种身</p><p>能擐慈悲大甲冑执持<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>以為弓</p><p>巧射智慧善法箭破彼无明微细中</p><p>具大势力能速疾执持智慧坚铁杵</p><p>摧彼无明<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>[穀-禾+卵]普遍碎尽无有餘</p><p>一切力士中最尊复执金刚火焰杵</p><p>為欲调伏眾生故即现金刚可畏身</p><p>或复现作真金色光明眾宝自<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a></p><p>為救贫穷眾生故即现转轮圣王身</p><p>若行微妙眾善业能受种种胜乐果</p><p>若能<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>教训人于彼平等无异见</p><p>于彼飢渴热恼者為作种种美饮食</p><p>若在疾病苦恼中现作医王能救疗</p><p>于彼盲冥无智者為作清净智慧眼</p><p>能行百亿佛剎中慈心调伏眾生故</p><p>不患劬劳辞疲倦久习慈悲以為体</p><p>一切神足自在力<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>瑜伽登<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a></p><p>不顾好恶慈悲时一切时中常能度</p><p>諂曲斗挣最恶处终不暂时起捨心</p><p>容仪皎然如日月光明随念应时发</p><p>迅疾速现如电光照彼俱胝诸佛剎</p><p>调伏无量眾生类平等一时使清净</p><p>普能变化诸佛身一念之间悉皆现</p><p><a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>深广如大海普遍涝漉诸有情</p><p>巧能张彼善法网将入调伏<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>城</p><p>由彼调伏网力故遍能救漉诸眾生</p><p>随所救接得济者安置法岸无暂停</p><p>已度有情一切眾犹如大海水中沙</p><p>出已即便示正道佛法中胜勿须疑</p><p>佛能执彼法铃鐸遍令一切普知闻</p><p>以彼振铃传法力烦恼如海咸销尽</p><p>譬如日光明相现黑暗障目并蠲除</p><p>令彼愚痴无智人烦恼锁灭慧光净</p><p>无明烦恼弊其目一切杂染并随行</p><p>為欲利益眾生故次第咸令获清净</p><p>随诸眾生示神变犹如明月水中现</p><p>邪智生盲恶眾生佛对面前而不现</p><p>譬如饿鬼临大海尽见海水皆枯竭</p><p>如是薄德恶眾生口常说言无有佛</p><p>此等薄德有情类诸佛如来不能救</p><p>譬如生盲无目人明珠对前而不见</p><p>谁能有力令观彼无垢清净妙法身</p><p>譬如百亿日光明焰网相覆莫能见</p><p>喻如少福诸天子下界凡人犹不见</p><p>何况自在大天身岂诸凡愚而得见</p><p>于彼自在天色像五通仙人尚不见</p><p>何况非天八部神及恶眾生而能见</p><p>要由承佛神力故能与一切眾生乐</p><p>瑜伽观者净其心彼人聪惠即能见</p><p>若有福德眾生者常感诸佛在其前</p><p>圆光围绕共庄严复具三十二相好</p><p>若知如是大<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>能见智惠深广海</p><p>此等眾生当不久<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>广大亦如海</p><p>若能听此妙伽他自身<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>及得见</p><p>捨命生大莲华中诸佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>而能听</p><p>尔时地藏菩萨摩訶萨。说此颂已。顶<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>足。还复本坐。尔时<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。告地藏菩萨摩訶萨言。善哉善哉。善男子。汝能善说是妙伽他。若有人能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>读诵繫念思惟。是人即得一功诸佛无等法藏。亦得不忘诸佛智慧如来祕密藏。故不久于三界中。即得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。既自解脱。亦令一切眾生而得解脱。能令听者依我教行。说此语时。无量<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>。入一乘道。复有无量他方菩萨。证得究竟不退转位</p><p>瑜伽法镜经常施菩萨所问品第三</p><p>尔时眾中有一菩萨。名曰常施。承佛神力从座而起。偏袒一肩。右膝著地。合掌向佛。而白佛言。今有少疑。敢欲諮问。虑诚烦扰。恐伤圣心。唯愿世尊。不為咎。尔时世尊。告常施菩萨。如来已度世间八法。咨汝所问。何须疑也。尔时常施菩萨。白佛言。世尊。如来入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>已千五百年后。一切下劣诸有情等。不复睹见如来变化色身。不闻真法义味。<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>灭时。像法尽时。眾生恶心恶意炽盛。无真实时。彼时眾生。若為调伏。為说何法。云何而住。云何修行。作何福业。最為殊胜。免堕恶趣。唯愿世尊。哀愍解说</p><p>尔时世尊。告常施菩萨言。苦哉苦哉。未来眾生。无少慈悲。数造恶业。何以故。当尔之时。一切眾生。愚暗力故。不知己益。作福弥积。如妙高山获报甚少。善男子未来世中。一切苾芻及苾芻尼。鄔波索迦。鄔波斯迦。国王。王子。大臣。官长。<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>。长者。筏舍。式达罗等。于我教法<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>之中。无尊重心。于<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>所。无恭敬心。无真法义少分。亦无由此所作一切眾善。一心求名求利求胜他故。无有一念作出世心</p><p>复次善男子。未来世中。像法之时。无量恶事。作恶转盛。云何恶事。何者是也。一切道俗。不识法轨。不依法行。一切俗人无有方便。俗人设会。求福之时。请唤苾芻及苾芻尼。恐来多故。起慳惜心。即便遣人。防门守户。不相识者。莫令放入。贫穷乞人。老病之者。亦不听入。如此设会。徒眾丧饮食。了无善分。复招罪业。由不平等施故。复有眾生。一心為自利故。希求福德。不為利他。不取他教。见他修福。不能<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>。助其少分。善男子。汝应当知。如此眾生。无有少福</p><p>复次善男子。未来世时。复有诸眾生等。见他旧时破塔破寺破经破像零落毁坏。<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>修理。有人劝修。而作是言。非我先宗眷属所造。何用修。為我寧更自造立新者。何假修故。善男子。汝应知之。修理故者。得无造新。根本功德。更得胜福。由此造立新者。不如修故之福无量无边。复有眾生。见他多人聚集一处。作诸福业。及各随力分而行<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。见他施己。嫉姤我慢。為名闻故。倾自家中所有财物。总用布施。如是之人。得福甚少。何以故。為心姤故。无慈悲故。及见贫穷孤独困厄乞人。见已骂辱推摈驱逐。令出门外。不与一物。如是眾生。名為颠倒作福。名為痴狂修福。亦名不正作福。如是善业。<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>诸有。彼诸人等。于飢贫人上。须起慈悲。纵多财物金银严具衣服饮食床卧敷具。如是等施。不患贫之。用财甚多。获福甚少。汝应知之</p><p>复次善男子。我于一时处处经中。為眾说法。若有眾生。无巧方便。无慈悲者。种种布施。于阿僧祇劫中十方佛所及诸菩萨声闻缘觉乃至己身。以用布施。為<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>故。彼人功德。寧為多不。甚多。世尊。佛告常施。若有一人。有慈悲者。尊重之心。及有方便布施畜生一摶之食。此人功德。胜前功德。百千万倍。无数无边。何以故。以慈悲心。爱乐布施。得大果故。以彼难得食故。无所希望故</p><p>复次善男子。我于处处经中说布施者。為令在家<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人。修慈悲心。布施贫穷孤老。恶疾重病。苦恼困厄乃至狗等。常行施。于未来世。我诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。不解我意。专施敬田。不施悲田。敬田者。名為三宝。悲田者。名為贫穷孤老乃至蚁子。何以故。于未来世。此二种田。悲田最胜</p><p>复次善男子。若有富贵之人。多饶财物。独行布施。从年十二。至于百岁。為求名闻。供养三宝。我说。此人功德甚少。不如复有多人同心不问贫富贵贱在家出家。共相劝化。若多若少。各随力分。捨少财物。聚集一处。相续不绝。布施一切贫穷孤老。恶疾重病。困厄悲田。我说。此人福德最大。假使不施。念念之中。施功常生无有穷尽。若有<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。随喜之者。其所获福。亦复如是。独行布施。其福甚少</p><p>复次善男子。未来世中。我诸弟子。乐好衣服。乐好饮食。乐求利养。為痴爱所覆故。慳贪嫉姤。广大积聚。种种财物。于悲田中。了无施心。不修慈悲。专行恚怒。见他作福。详共讥嫌。咸言。此人邪命諂曲。求觅名利。若见贫穷乞者。轻贱毁弄。见人施与。复轻笑之。说其过恶。共讚毁言。出家之人。何用布施。佛如是说。出家苾芻。合行二行。一者诵习。二者禪定。及学多闻智慧。何用布施纷扰之事。善男子。若于眾生。无慈愍心。即去佛道。甚悬远也。是故善男子。汝应当知。如是之人。是魔眷属。若有作善修福德者。若道若俗。说其过恶。如是等人。命终之后。堕大<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>长远。地狱受苦。经歷多劫从地狱死。堕饿鬼中。头如太山。咽如针孔。腹如大海。经十二年。不闻水名。何况得见。受大飢饿。从饿鬼出。于五百世。堕畜生中。从畜生出。五百世中。生贫贱家。常受苦恼。无有一念适意之时。何以故。见他施时。不随喜故。求他过故</p><p>复次善男子。我于过去<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>中。我為贫穷受苦诸眾生故。递相劝化。积物一处。以用布施。由此缘故。速得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。及十方世界。现在诸佛。亦从布施。而得成佛。我于一切经中。说诸波罗蜜。皆从布施。以為初首。善男子。譬如一人双足俱折。意欲远涉诣于宝所。此人能远逝。不所求得不。不也。世尊。何以故。為无足故。世尊。告曰。彼人亦尔。于五波罗蜜中。求觅成熟。乃至经于殑伽沙劫中。不行布施。终不能到涅槃彼岸。何以故。若不布施。则无有戒。若无有戒。则无悲心。若无悲心。则无慈心。若无慈心。则不能忍。若无忍辱。则无精进。若无精进。则无禪定。若无禪定。则无智慧。无智慧故。常為无量客尘烦恼之所得便。善男子。為斯义故。此檀波罗蜜。布施法门。三世诸佛。所共敬重。复化眾生。令于檀波罗蜜尊重布施。是故四摄法中。财摄最胜。善男子。我或一时。讚叹持戒。我或一时。讚叹忍辱。我或一时。讚叹精进。我或一时。讚叹禪定。我或一时。讚叹智慧。我或一时。讚叹头陀。我或一时。讚叹少欲知足。或复一时。讚叹声闻。或复一时。讚叹独觉。或复一时。讚叹菩萨。如是种种。随机不同。善男子。未来世中。多有罪业。苾芻不解我意。各执所见。递相是非。不行我法。為此义故。令我教法颠倒错乱。实是佛法。说為非法。实非佛法。说是佛法。作是说故。我此真法。便被破灭。但有少分相似法。在彼恶苾芻。作如是说。像法亦灭。像法灭已。教法都尽。善男子。如是苾芻。不能解我甚深之义。亦不解我方便智慧。然不知时。昇师子座。自失威仪。為他说法。随文取义。不取真旨。违背实相。常自讚言。我今所说。与佛无异。其餘法师。不闲法义。狂惑道俗。自见己长。于大眾中。為名利故。常讚己德。善男子。如是苾芻。作是语者。堕大地狱。具受诸苦。从地狱出。轮转<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a></p><p>复次善男子。诸恶苾芻。见他坐禪。而起轻嫌。详共讥论。此人愚痴。何所修学。但唯慵嬾。有何禪定。诈现禪相。狂或他人。不听经论。无所知解。岂能坐禪。善男子。如是之人。作是语者。多劫受苦。无有出期</p><p>复次善男子。如是诸恶苾芻。為名利故。递相是非。灭我真实法律。不依师学。自心坐禪。自执己见。以非為是。不能分别是邪是正。向诸道俗。常作是言。我解禪法。我能知实。我能见是。善男子。如是之人。灭我<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。自堕地狱</p><p>复次善男子。我诸恶弟子。自言我解经律。彼实不解。自身<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。不能会解我真实义。作如是言。世尊所说毘奈耶中。听许食肉。善男子。我若解说食肉之过。一切声闻缘觉。初地菩萨。心皆迷闷。无所了知。情怀忧苦。善男子。如是等人。虚妄谤我。善男子。毘奈耶中。為病患人。听食三种清净肉者。皆是不可思议。汝应知之。善男子。吾从成佛已来。乃至今日。我声闻弟子。处处受肉食者。凡夫眾生。见彼食已。作是念言。实见食肉。不知我有善巧方便。颠倒妄说。获大重罪。复有眾生。见诸病患苾芻食肉之时。深入无量智慧法门。复有无量见者。断下烦恼。断上烦恼。断中烦恼。复有苾芻。度脱眾生。出离生死。入如来道。得达彼岸。何以故。善男子。此是如来。<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>说法。不可思议。為欲调伏一切眾生故。汝应知之。我声闻弟子。未曾食敢眾生肉也。况诸菩萨。我于毘奈耶中。為病苾芻。顺世间医。须食三种清净肉者。是何等肉。善男子。当知彼肉不从四大而生。不从胎生不从卵生不从湿生。不从化生。不与识合。不与命合。非实非虚。当知世间。都无此肉是我方便。作如是说。不解我意。自损己身</p><p>复次善男子。未来世中。诸恶苾芻。于国国城城村村寺寺处处。讲说经律论等。随文取义。不达如来深密要义。善男子。我出于世。為大眾说食眾生肉。无有是处。若食肉者。无有慈悲。无慈悲者。非我弟子。我非彼师。何以故。此大眾中。各有异性。各有异见。何况未来世者。善男子。今此眾中。或见如来住世一劫。或见如来入般涅槃。或有或生。都不见我。或见我身。或不见我身。或见我身倍长三人。或见如来光明之身。或见大身。或见<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。或见报身坐莲<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>师子之座。菩萨围绕。住于无量世界海中。随大眾心而為说法。或有见我法身同于<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。无有色像。周遍法界。清净无碍。或有见我住娑罗双树间。或不见者。或见此地土沙砾石。惑见此地种种树林土石墙壁周匝围绕。或见此地及墙壁等俱是七宝。或见四宝庄严。或见眾宝庄严。或见如来过去未来现在起行游化之处。见如是等不可思议希有之事。何以故。一切眾生。业行不同。是故所见。各异。善男子。如来终无异相。应如是知</p><p>复次善男子。诸佛出世。令使一切依法行人皆悉远离染著世间。亦复不离世间。显示实相清净法界。以妙<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。说清净法。以种种方便摄诸眾生。若有不解。依我法者。不得摄受。不得利益。所以者何。為一切眾生业行意乐各各不同。為斯义故。于一切法中。所解各异。一切声闻缘觉。以自力故。不测佛意。何况未来愚痴等辈。善男子。如是如来佛之威力。不可思议。应如是知</p><p>复次善男子。像法时中。多有诸恶苾芻。不能解我善巧方便祕密之义。以彼愚痴。自在说法。随文取义。不得深意。又亦不求祕密之义。而自称言。我解佛之所说甚深之义。我亦能说甚深之义。当知此人。是三世诸佛怨家。灭我法眼。像法正法。亦能灭尽。善男子。诸佛所说。有二种法。一是世諦。二是真諦。所闻法者。亦如是听。亦如是修。若不解者。远离真实。唯有像法。当尔之时。多有乐行恶行苾芻。不会真理。不信我之所说教法。执云。非佛所说。如是等人。為邪见故。堕大地狱。多劫受苦</p><p>复次善男子。未来世中。多有诸恶苾芻。自讚毁他。常作是言。我是法师。我是律师。我是头陀。此三种人。為自讚故能灭我法。更非餘人。善男子。我之教法。一切外道。而不能灭。魔王眷属。亦不能灭。此三种人。以愚痴故。尚灭像法。何况正法。如是等人。增上慢故。颠倒说法。是律非律。错教坐禪。以自高故。毁辱我法。如是等人。捨命之后。速疾堕于阿鼻地狱。譬如高山顶上射箭而下。如是等人。亦复如是。经歷多劫。受大苦恼</p><p>尔时常施菩萨。白佛言。世尊。如是等人。受地狱苦。<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>眾生。何时得出。佛告常施菩萨言。善男子。汝应当知。我说。此罪恶眾生。于地狱中。多时受苦。餘业不尽。难有出期</p><p>复次善男子。我灭度已。一千五百年后。我教法中。恶法渐兴。非法羯磨。出现于世。实非<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。自称沙门。实非梵行。自称梵行。破戒苾芻。遍赡部洲。处处充满。為利养故。不<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>德。弃捨我教。爱乐非法。多畜八种不净之物。自具十恶。不行十善。捨离律仪。未满十夏。畜二<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。以承事己。与他小僧。乐作依止。乐度俗人。出家将為弟子。乐作和上及阿闍梨耶。乐与他人。受其大戒。以自高故。令诸道俗轻贱我法。不生敬重。如是苾芻。堕诸恶趣</p><p>复次善男子。未来世中。多诸道俗。造诸寺舍佛堂塔庙衢路道边。处处充满。及佛形像或在山林旷野。或在道边。或在巷路。多人闠闹臭秽恶处。破落毁坏。无有一人<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>修理。设有见者。便自念言。修他故者。不及造新。為名利故。遂造新寺及以塔庙。虽造塔寺。不生敬重。请僧在寺。不与饮食衣服卧具汤药。反更于中。借取乞贷。餐敢僧食。及借床敷毡褥。奴婢畜生。车乘庄田。及诸珍宝金银等物。借贷不得。即便驱逐。如是檀越。堕三恶趣。经歷多时。受诸苦恼</p><p>善男子。未来世中。多诸官长。上中下类。如是官人。不信罪福。取诸四方僧物。如是等人。皆堕恶道。善男子。自今以后。不应取三宝财物。驱使三宝奴婢畜生。抑逼差科。乃至不应生一念之心。何况檛朾驱使奴婢。更从索物。下至索一斗半斗。如其不与。及被嗔责。起是恶心。皆堕恶道</p><p>复次善男子。一切国王王子大臣长者<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>婆罗门等。教汝行法。若见眾僧。莫问多少。勿简持戒破戒及与大小。应生敬重。不得轻慢。若欲供养。随其力分。若能家内清净。设供备办饮食及净坐处。别有客僧入会。不禁门户。其心欢喜。若能如是普供养者。其福无量。若有俗人。三业麤獷。打骂眾僧。恶心繫念。如是之人。堕诸恶道。若能三业调柔。如法供养。即生善道</p><p>复次善男子。当尔之时。一切道俗。若有欲作大福业者。宜并齐心。為一切眾生。聚集施物。无碍施与一切老病贫穷悲田乞人。如是布施虽少功德甚多</p><p>复次善男子应修破寺破塔破像破经。如前所说。得无量福。复次善男子。于未来世。我法之中。多有三宝。被人轻贱。正以苾芻及苾芻尼不如法故。身披法服。经理俗务。市肆贩卖。涉路往来。或复营农。贮积粜糴。或复使人商贾求利。常行如是非法活命。或作种种工巧之业。為财利故。或作画师。或作金师。或作木匠。或占候星宿。或作卜师。或占相男女种种吉凶。或作医师。或行咒术。并结咒索。或自歌舞。教他歌舞。或乐群聚。竞夸饮兴。每常醉乱。酒酣无礼。不识尊卑。互相嘲謔。或时諂曲。為他说法。以求人意。或时诊候他脉。针炙治眼。或复坐禪。不能自正。以邪定法。占睹吉凶。或策使鬼神说人祸福。专行此事。以求衣食。或有苾芻。託附俗官。為动絃管。并共碁博。或行媒构令彼欢喜。或假他势力。侵削道俗。所得财物。分与俗官。如是苾芻尼等。专行如此非法之事。為衣食故。以自活命。令诸俗人不生敬重。唯除菩萨利益眾生。及以怜愍此等人故</p><p>尔时世尊。复告常施菩萨言。善男子。未来世中。一切道俗多造恶业。造佛形像及菩萨像。或时雕刻。或复彩画。将以贩卖。一切道俗。為功德故。买归供养。行此事者。二俱得罪。堕于地狱。五百生中。常被他卖。何以故。為行非法买卖像故</p><p>复次善男子。未来世中。多有眾生。不知罪福。上祖已来。或自己身。所造佛像。经书幡花伞盖。卖与他人。以活妻子。及邪行处用。善男子。此亦不应买卖。当尔之时。一切国王宰相城主县长。有势力者。捉得此人。应重讁罚。驱令出国</p><p>复次善男子。未来世中。一切道俗。造立形像。皆不具足。即便废罢。或作半身。或手足不成。或有眼耳口鼻。悉不成就。粗有影嚮而已。或造塔庙。不安形像。或造寺宇。亦不具足。彼若破坏。不肯修理。如此人辈。获无量罪</p><p>复次善男子。未来世中。诸恶苾芻。于所住寺。自共立制。若有四方客僧来住。莫令放入。令作食限。下至一日二日。设多饮食。惜不供食。善男子。是诸苾芻。命终之后。堕于地狱饿鬼畜生</p><p>复次善男子。未来世中。苾芻苾芻尼。及以沙弥。以<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>僧物。如似己有。随意取用。非时食敢。或与亲友。餘残饮食。是诸苾芻。及以沙弥。乃至千佛出世。永不闻法。常在三涂无懺悔处。若共此人。同住居止。羯磨布萨。所作<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>。悉不得成。复更得罪</p><p>复次善男子。若有具犯四重五逆。易救可懺。若侵损三宝乃至一豪一粟。自在取与。非时食敢。永沈<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>。终无出时。或现在世。受诸病苦。若共此人同住语论往来狎习。日夜得罪。若不懺悔。不能永捨。彼人命终之后。堕于地狱</p><p>善男子。未来世中。多有苾芻及苾芻尼。鄔波索迦。鄔波斯迦。国王太子王子。大臣官长。中宫妃后。乃至家长。破戒恶行。无羞无耻。无惭无愧。不解懺悔。以是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。令法秽浊。当知即是。三恶趣人。我以方便。令彼罪人随所犯处。还从彼境。慇重懺悔。罪得除灭。而得解脱</p><p>复次善男子。未来世中。诸恶苾芻及苾芻尼。执著寺舍及所住处。如似俗人护己舍宅。不令他入。于我所说毘奈耶藏。不能依法四月一移。恋著房舍。如毘舍遮。见餘苾芻住阿兰若。威仪具足。衣阕运妗S谄渥〈ΑK脑乱灰啤V詹煌?АV疃衿兤c。见是事已。而便轻笑。咸作是言。此之苾芻。志性不定。[跳-兆+参]扰多务。失心狂乱。如颠病人数作移动。彼恶苾芻。自破戒行。见他行法。而生讥誚。以是因缘。获大罪报。便堕地狱</p><p>复次善男子。未来恶时。若苾芻苾芻尼。及诸俗人。欲学大慈大悲心者。须忍受他恼诽谤打骂。若有人能起此心者。即是我弟子。我亦是彼师。何以故。应作是念。我过去世时。曾為一切眾生父母。一切眾生。无始已来。亦曾与我而作父母兄弟姊妹六亲眷属。善男子。以是义故。于一切眾生。而起慈悲愍念。自观己身秽恶危脆。不生爱著。当尔之时。不惜身命。种种方便。救济一切苦厄眾生。若有国主大臣。若城邑聚落主。若势力长者婆罗门等。天龙八部。宜应护持。及有苾芻。若男若女。应劝此人。不令退转。助其势力。莫令恶人為作留难。不令恶人侵欺财物。如是助者。其人功德。说不可尽。善男子。当尔之时若有施主。起慈悲心。布施贫穷孤老一切受苦眾生乃至蚁子。其人功德。无有穷尽。善男子。吾说此布施悲田所有功德。我若广说。穷劫不尽。未来眾生。闻者欢喜。惑复迷闷。涅槃时到。為汝略说。应如是知。说此语已。默然而住</p><p>尔时。一切诸来大眾。闻世尊说像法时事。及像法末时。又闻涅槃时到。举体战慄。身毛皆竖。悲啼号哭。不能自胜。尔时世尊。起大悲心。告诸大眾。止勿悲哭。世间法尔。有生必灭。一切诸法。悉皆<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。无主<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。涅槃空寂。无有过者。更莫啼泣。以法自裁。复告常施菩萨。且置是事。汝以何相观如来耶。复以何相观眾生乎</p><p>常施菩萨白佛言。世尊。我观如来。亦非过去。亦非未来。亦非现在。不住此岸。不到彼岸不住中间。非有非无。不起不灭。非色非不色。非有為非无為。非断非常。非有漏非无漏。同虚空等法性。从初成道乃至涅槃。于其中间。不见如来说一句法。非同眾生见有出没说法度人。如来境界不可思议。不可以识识。不可以智知。出过三界。不离三界。眾生无能輒惟忖之。设对目前。亦不能测。一切眾生之相。亦复如是。非有非无。非内非外。非聚非散。而常流转虚妄受苦。无始已来。执著我见。我见缚故。长夜受苦。无有穷尽。眾生之性。本来寂静。于未来世。一切眾生。亦皆空寂。有无俱空。如镜中像。如水中月。如热时炎。如健达缚城。如空中云。如梦知电如幻如化。如嚮如泡。菩萨由是不捨眾生四大之相。為若此也。执有我者。应如是观。世尊。一切眾生。□□□□皆一心作。更无餘法。我观眾生相貌如是。此是不可思议。唯有如来。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>之法。非诸声闻缘觉。及初地菩萨之所能量。当知。如来于眾生。所有大悲心。应眾生机。普為说法。无能过者。我今观佛及诸眾生。為若此也</p><p>尔时。会中无量天人。闻此语已。成发无上正等觉心。及获圣果。尔时世尊。告常施菩萨言。善哉善哉善男子。汝之所说。正应如是。一切眾生。于如是观。一切诸佛。亦如是观。得无上道。善男子。此经中。说菩萨之法及观行法。应如是行四摄<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。应当如是观眾生相</p><p>复次善男子。行布施时。不观<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>及非福田。不求名闻。若见贫穷孤老一相苦相。应如是施。应如是观。不见施者。不见受者。不见施物。三事体空。平等无碍。无有住著。何以故。一切诸法无我。是真实法。所施之时。不望受报现在未来人天胜乐。為诸眾生。求无上道。令诸眾生得无尽乐故。应如是施。為欲摄取诸恶眾生令住善。法而行布施。我亦如是。摄诸眾生。而行布施。如汝先说。不应住于有无之相而行布施。如是布施。最為殊胜。若有见闻随喜之者。彼人所获。善巧方便。及殊胜福。应如是知</p><p>复次善男子。譬如有人。于夜梦中。见种种事。或见自身。而被繫缚。受种种苦。生大忧恼。然后得脱。即便更见。国人咸集。策立為王。势力自在。受大快乐。作是思惟。我先受苦。今复自在。受大快乐。作是念已。忽然睡觉。苦乐之事。莫知所在。如此梦事。非有非无。一切诸法。亦复如是。作是观者。名為正观。说是法已。无量菩萨。证得无上正等<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。无量菩萨。得入一生补处。无量菩萨。各随所修。皆得昇进。无量人天。得四圣果。无量声闻。入菩萨位。无量眾生。发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a></p><p>佛告常施菩萨。善男子。未来世中。四眾弟子。得闻此经。发起信心。生欢喜者。所得功德。无量无边。如见我身。等无有异。若有诽谤不信毁呰此经。如毁吾身。等无有异</p><p>尔时世尊。告阿难言。及诸大眾。汝好受持。常莫忘失。此经一名像法。二名决疑。三名济拔安养贫穷孤独。四名最下世界悲田胜法。五名示所犯者瑜伽法镜如是受持</p><p>尔时。一切大眾。苾芻苾芻尼。鄔波索迦鄔波斯迦。天龙药叉。[仁-二+达]达缚。阿素洛。揭路荼。紧捺浴。莫呼洛伽。人非人等。闻佛所说。<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>佛足。心大欢喜。信受奉行。各各严办闍维之具。哀动天地</p><p>佛说示所犯者瑜伽法镜经一卷</p><p>景龙元年岁次景午十二月二十三日<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法师室利末多(唐云妙惠)于崇福寺翻译</p><p>大兴善寺翻经大德沙门师利笔受缀文</p><p>大慈恩寺翻经大德沙门道安等证义</p><p>大首领安达摩译语</p><p>至景云二年三月十三日奏行</p><p>太极元年四月日正议大夫太子</p><p>洗马昭文馆学士张齐贤等进</p><p>奉敕太中大夫昭文馆学士郑喜王详定</p><p>奉敕祕书少监昭文馆学士韦利器详定</p><p>奉敕正议大夫行太府寺卿昭文馆学士沈佺期详定</p><p>奉敕银青光禄大夫太子右諭德昭文馆学士延悦详定</p><p>奉敕银青光禄大夫黄门侍郎昭文馆学士上柱国李又详定</p><p>奉敕工部侍郎昭文馆学士上护军卢藏用详定</p><p>奉敕左散骑常侍昭文馆学士权兼检校右羽林将军上柱国寿昌县开国伯贾膺福详定</p><p>奉敕右散骑常侍昭文馆学士权兼检校左羽林将军上柱国高平县开国侯徐彦伯详定</p><p>奉敕银青光禄大夫行中书侍郎昭文馆学士兼太子右庶子崔是详定</p><p>奉敕金紫光禄大夫行礼部<a href=\"/ctwh/jing/13j/shangshu.html\" class=\"keylink\" target=\"_blank\">尚书</a>昭文馆学士上柱国晋国公薛稷详定</p><p>延和元年六月二十日大兴善寺翻经沙门师利检校写</p><p>奉敕令昭文馆学士等详定入目录讫流行</p></div>"
}]