[{
    "title": "维摩经疏卷第三.第六 第2772部",
    "author": "智顗大师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>维摩经疏卷第三</p><p><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>品第三</p><p>此品之内略以三门分别。壹辩来意。二解品名。三释文义。明来意者。然<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>冥通权道无二<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>為眾生而现疾。如来亦怀悲而遣问。因共往来得通化导利益事广。故此品来。又前所明<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>大悲与眾德合行名為方便。此品即彰飞彼二乘诸小菩萨之所能知。今欲对之显其胜德使其捨劣修胜。故此品来。或可前品之中因凡问疾明化凡法。此品之内因圣问疾明化圣法。教圣之中先教声闻。故此品也</p><p>第二释名者。佛具胜德名<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>师。声闻等亲蒙佛度称為弟子。此乃师徒弟子相对得名也。又云。学在佛后名之為弟。从法化生称之為子。所命之人是其弟子。就此题章名弟子品。若依无垢称经云声闻品。若言弟子品恐同菩萨也</p><p>第三释文义者。就此文中三门分别。壹约相显失分别。二就行相始终分别。三随文释义。初显失分别者。此中有五百声闻行。即五百法门。文中略故但明其十。此十即是声闻之人所得之法。今对大乘并是其失相云何。初<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗声闻人中智惠第壹。以其不达常寂<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。是故致呵。二目健连<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>第壹。以其通不现前<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不当故亦被呵。三大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>头陀第壹。以无平等大悲所以被呵。四须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>解空第壹。以其不得平等大空故亦被呵也。第五富楼那辩才第壹。以其不达深远根性故亦被呵。六迦旃延解义第壹。以其不达实相深义故亦被呵。七阿那律天眼第壹。不与<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>智惠合行故亦被呵。八优波离持律第壹。不能观空灭罪故亦被呵。九罗持戒第壹。以其不达无利<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>故亦被呵。第十阿难多闻第壹。不了如来法身<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>故亦被呵。此十并彰弟子失也。二约行相始终分别者。壹舍利弗修不住行。以其此人捨俗归林除乱取静。今教不住取捨行会中道。云不住行也。二目连修入证行。以其目连通不现前说法不当。教修二空契证真理。名入证行也。三大迦叶修助道行。以其此人捨富从贫未会平等。教修等观助成菩萨。云助道行也。四须菩提修大空行。以其善吉见有邪正未解真空。所以教修等观不取邪正之相。云大空行。五富楼那修说法行。以其此人不观根欲说法差机。教知根性称其所宜利无不普。云说法行也。六迦旃延修生解行。以其此人数演五法乖其实相。教离分别之心契会无相之行。名生解行也。七阿那律修起通行。以其那律有相天眼见境未明。教修无相天眼契悟不二。云起通行。八优波离修灭恶行。以其此人不能观空灭罪教修无相懺悔罪垢不生。名灭恶行也。九罗睺罗修出家行。以其覆障不达即相无相真实出家。教修离相平等真实出家。云出家行也。十阿难修法身行。以其<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>不了如来法身<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>。教修出世无為功德永离生灭之心。云法身行</p><p>第三释文义者。文别有三。初明维摩寝疾之意以為起问由致。二佛知下正命问疾。三如是五百已下总结类显前中。尔时维摩詰自念寝疾于床者。尔时者生念时也。长者维摩结起念人也。自念寝疾于床者正兴念心。然此念意念待圣问非念為病。良以维摩悲物情深待问若渴。故兴此念。维摩现病专精為物。心虽為物得佛影响化事方成。故念自已寝疾于床。于者于也。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>大慈寧不垂愍者。佛具眾德為世钦承。故曰世尊。慈中之极餘莫能加。称理而成岂非大也。寧者能也。愍者怜也。维摩自云。我之小子悲心尚劣犹為物缠痾。况佛高人能不垂怜而遣问也。佛知其意即告已下第二正命问疾。以其时会得盖在今故令往问而不可止。然下文中据其正使理归文殊而命餘者略有三意。壹為彰如来心等不偏所以通告。与<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>中并告大眾令问相似。第二為欲广寄眾言显维摩德尊故须通告。命不堪彰其德尊告命堪者显其德妙。第三為欲广寄眾言以显维摩所说之法故须通告。故下文中先告不堪彰昔所说后告堪者明今所说。是以通告就弟子之中人别有十。先命舍利弗者。以其為使不易非通人之不可身子神惠超绝故先命也。智度论云。王舍城内有大论师名摩陀罗王。以聪明封赏壹邑。其生壹女。眼似舍利鸟。即以為名。亦名鶖鷺子。因鶖鷺鸟以彰其号。时南<a href=\"/remen/tianzhu.html\" class=\"keylink\" target=\"_blank\">天竺</a>国有大论师。名优婆提舍。头戴火盆谓物愚闇铜叶叶腹恐诗书溢出。即打论鼓。国人皆集欲定优劣。摩陀罗路见斗牛知彼胜我。于是入眾论难便堕负处。群臣共议夺其封邑以赏提舍。摩陀罗语提舍言。王以汝聪明封赏壹邑。我以女為妻。后时女有娠忽然夜梦。梦见壹人。身被甲冑手执金刚杵摧破壹切山。然后在壹山边立。寤已即向夫说。其夫解曰。汝当有娠。所怀必男。身破甲冑者。此儿必有厚德。手执金刚杵者。此儿聪明有大智惠。摧破壹切山者。此当作大论师破壹切论义师也。然后在壹山边立者。当伏应壹人以為弟子。其母从有娠来神智非常。昔与兄论义兄恒得胜。自妹有娠兄便论屈。即知儿智勋母聪叡。年始七岁十六大国中论义第壹。从佛出家。弟子之中智惠第壹。故餘经论中讚叹舍利弗。唯除佛如来壹切眾生类<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>及多闻欲比舍利弗于十六分中不能及壹。即先告之。何故先告。以其惠胜為是先告。问曰。前说声德劣故佛先告。舍利既是弟子中胜。何故先告。解云。舍利惠行虽上餘行劣他。故得先告。若如此者。餘之九人德有优劣。亦应先告。如此论量理即不通。但是大圣导引多方应告即告。何有先后。文中有四。壹命问疾。二辞不堪。三释所以。四结不堪。下文例尔。初命可知。第二辞不堪者。皆举往昔屈辱之事彰已不堪。非谓此念以有斯耻也。然佛是大人发言如印而不可违。何故致辞者但為佛使。必须达人。忆昔被呵默不能报。今惧此失。恐有辱尊之丑。故下诸人皆致辞也</p><p>第三释中义别有二。壹出昔日被呵之事。二时维摩下明得失教呵之相。呵去其失教修其德。前中所以者何壹句总自徵责。佛令问疾者何若作世尊问意。汝是弟子我使汝问疾所以不去者何自徵问。下例皆有二意。忆念已下正出呵事。曾于林中宴坐树下者。声闻<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>必託静缘不知寂定离诸缘。故身子虽获罗汉法执未亡。见有身意患身劳烦故欲隐形于林。见心动乱复欲藏心于定。以有身意取捨未融。所以被呵。良由未悟法空。见外六尘為能扰。执内六根為所扰。故託林取静避于外尘。宴者默也。默坐树下安心坐禪故云宴坐。第二教呵义中文分三节。壹呵。二教。三詰。不必是坐為宴坐者此呵失也。失有六种下教文中翻成六德。以其身子树下坐禪得身心相故隐身于林藏心于定。虽欲隐藏翻成显现也。此未全非故云不必生云不言非。是但不必是不言非是者。二乘坐法乃可体。然但不必是者未是大乘真极坐法也。庄云。必是有所得住著坐也。身子见有散可辨见静可欣。故今责云不必是坐為宴坐也。若约行辩舍利起不住行。以其此人捨俗归林以為寂定。今教不住取捨。方為大定</p><p>不于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>现身意下第二翻失显得正明教也。教相有六。壹等身心破得身心相。二凝静乱破取静乱相。三融真俗破取凡圣相。四亡内外破取内外相。五泯邪正破取邪正相。六齐缚解破取缚解相。前中不于三界现身意者。第壹等身心也。远云。欲色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>是三界。凡夫于欲色两界受色形果名為现身。在无<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>受心法果称為现意。菩萨了三界虚妄但是心作证实除捨无处可在。所以不于三界地中而现身意。是為宴坐。满云。声闻得身心相。所以隐身林间藏心在定。虽欲隐藏翻成显现。大士悟三界身意其性本空。不取不捨不现身意。名宴坐也。又云。五根空故意不现也。身意性空。是真坐禪也。肇云。法身宴坐形神俱灭。道绝常境视听所不及。岂复现身于三界修意而為定哉。身子以犹有世报生身得其身相。以人间為烦扰故隐身于林藏心于定。虽欲隐藏以自显现。未能形神无迹取捨两亡。何以走长衢而避影煎流水以求冰。被呵之由良為于此。不起灭定现威仪者。第二凝静乱。二乘之人患心劳虑。暂止心想名為灭定。由本识持色身不坏。六识灭故不能起动。所以然者。声闻威仪<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>引起。入灭定时意识灭。故于四威仪捨之入定。菩萨不尔。寂而常用。静乱不殊。何以故。以<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>故不起灭定。无心心而现威仪。如如意珠无心分别自然能雨壹切宝物。但可以神会。难以事求。出入无二是為宴坐。智度论云。普花言。汝信受壹切法常寂灭相否。舍利弗言。我信此事。普花言。诸法常寂无有体也。或可菩萨入灭定。虽无六识有平等性智。引起色身能现威仪。二乘灭定无平等性智不能现威仪也。肇云。小乘入定即形同枯木无运用之能。大士入实相定。心智永寂而形充八极。顺机而化应会无方。举动进止不捨威仪。是真宴坐。不捨道法理凡夫事者。第三融真俗。远云。戒定惠等是圣道法。贪嗔痴等是凡事。小乘未证法空。见有或业。有而可畏。段已入圣不能现行引导眾生。菩萨了空知有。如幻处而<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>。现行<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>。染净无二。是為宴坐。又由大士具根本智恒观真如。名不捨道法。后得智中与物和光。教化眾生现凡夫也。又云。后得智中心常入定不捨道法。大悲心中现起<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>教化眾生。故云现凡夫事也。满云。声闻不能即净有垢。障隔<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>不能处中化物。大士<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>齐止真俗同观。故能处于中道而现凡夫事也。故下经云。示受于五欲明现凡夫事亦复现行禪。名不捨道法。此化用言也。理实大士不见有道法异于凡事。壹相无相平等无差别也。心不住内亦不在外者。第四内外。六根是内。六尘為外。声闻入定心即在内。出即在外。内外未均。体非是定。菩萨悟内外本空相生非有内外平等。是為宴坐。故下经云。不念内外行于平等。或可真諦是内俗諦是外。二乘执有真俗心游内外。菩萨了真俗俱空故不住内外也。又云。依他是内。遍计是外。小乘不了能所取空心游内外。大士知内外性空。所以不住内外也。于诸见不动而<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>三十七品者。第五泯邪正。远云。五见非壹名為诸见。身见边见邪见戒取见取。凡夫恒起不能入正。二乘修正不能入邪。菩萨现行教化眾生故无所动。虽现同邪内心恒正平等。是為宴坐。故下经云。八万四千诸烦恼门而诸眾生為之疲劳。诸佛即以此法而作佛事。肇云。小乘不能即邪為正。要须断见<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。大士通达诸见。与道品无异。故不离见行于道品。故下经云。住正道者不分别邪正。又云。凡夫滞有。二乘乐空。诸见為缠。捨之方脱。菩萨悟见本无其由。空花水月见体常空。即道品也。不断烦恼而入涅槃者。第六齐缚解。庄云。二乘要断烦恼方入涅槃。菩萨了烦恼性空本自不生。今何须断。既无烦恼可断亦无涅槃可入。对彼断入故云不断而入。是真宴坐。远云。随化现起贪嗔痴等故名不断。内心恒寂名入涅槃。智者云。此有四句。壹不断不入是凡夫人。二断而入是二乘人。三断而不入是通教菩萨。四不断而入是圆教菩萨。今约第四门也。问。不断烦恼而入涅槃四种涅槃之中是何涅槃。答。入无住处涅槃。所以得知。净名以二乘人断烦恼而入涅槃即证有餘无餘二果。今明菩萨不同于此。现起烦恼利益眾生。内证涅槃而无所著。故无垢称经云。不捨生死而无烦恼。虽证涅槃而无所住。是為宴坐。<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>涅槃凡夫亦有。恐同于彼是以不说。有餘无餘。声闻亦得。恐滥二乘亦不说证。又解。前胜益有三义。壹自性涅槃本来清净。不由断惑等得。所以不断而入涅槃。第二是无住处。顿悟菩萨留随眠或故云不断。证无住处故云入涅槃。第三入有餘涅槃。二乘入有餘要须断烦恼。渐悟菩萨了烦恼性空。虽断烦恼无所断。不同二乘以断為断。证有餘故名入涅槃。若能如是坐者佛所印可者。上来教呵讫</p><p>此下第三总结。具上六德平等宴坐圣共同遵称可<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>。故云印可。此句结德。时我世尊默然不能加报者。上人境界非己所知理出情外故云不能报也。此句结失良由。向来教呵并明得失俱说。故今双结者。欲令时眾同其得也。故我不堪下第四结不堪也</p><p>佛告目连者。目连是姓字。拘律陀父為无子因求拘律陀树得生此儿。因以為名。依问疾经。目连翻為菜菽其父好食此物。故以為名。依部执论翻為胡豆。是王舍城辅相之子。先与舍利弗同事那若。心专求道而无所得。疑谓无法。那若<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>病卧微笑。二人请问。师何笑也。那若答曰。五念世人恩爱所缚。其南天竺国金地国王身死火殯。夫人恋忆投火而死。吾為是笑之。二人私记。那若死后有商人人从金地国来。二人访问如那若。语二人便云。师定得道。但我非是<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。遂共立契。若有所得必相告语為要。后佛初出世。頞鞞<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>入城乞食。舍利弗见之进止异常知有胜师。舍利便问言。汝师是谁。頞鞞答言。是大<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>。舍利重问。汝大沙门。何所宣说。頞鞞答言。诸法<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>生是大沙门说。诸法因缘灭是大沙门说。舍利闻之豁然悟解。即于言下道证初果。迴至本处。目连闻之亦悟初果。二人各将二百五十弟子投佛出家并得罗汉。弟子之中神通第壹。使不可废故命之也</p><p>文四同前。第二辞不堪中。以其目连智障未遣不能即事无拥。通不现前。说法不称。是以被呵</p><p>第三释中所以下总徵。忆念下别。别中有三。壹出昔日被呵之事。二时维摩下明其教呵得失之相。三明说益。為诸居士说法者。经虽无文以理言之应说施戒修福等事或说小乘生空法等。小不应大。所以被呵。谚云。白衣居士久发大心。目连不识根机為说小法。法药差故。故被呵也。就下教訶相中。先訶后教。訶中不当如仁说者。居士应闻大乘实相乃说有相之法。壹说不应法。二说不当机。此二不当具有四失。壹不知根。二不达深义。三闕于大悲。四不报佛恩。若约行辩目连修入证行。以其此人说施戒等法不随真法。今教二空也</p><p>夫说法者当<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>说者。第二以理正教。于中有二。初约所说法体以教。二夫说法者无说无示下约就能说仪式以教。前中有三。初总次别。后以理返责。初云夫说法当如法说者。当如大乘实相法说法。无眾生下第二随法别教。于中且约<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>十八界门而演说之。餘类可知。先就五阴明法离相。法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>所下就十八界明法离相。眾生起计多执二处。前五阴中句别有十。约义唯二。前之四句明人无我。后之六句明法无我。人无我中四句何别。宣说阴体以為神主。名之為我。和合之中计有定实。以此而生说為眾生。相续之中说有神性。任持不段。名為<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>。作用之中立有主宰说之為人。破相显实故无我人眾生寿者。故胜鬘经说如来藏者。非我非眾生非寿命非人。法无眾生者。远云。正明理无。谓于实相法中无有眾生。所无有三。壹无横计神我眾生。二于假名眾生之中无有定性。三无假名眾生之相。此等皆是虚妄分别相有理无餘门类尔。离眾生垢者破情显理。取我之心名眾生垢。真法之中无此我心名离眾生垢。以无垢心故无眾生也。藏云。眾生者阴界入等诸物和合而生以為主宰。法者实相。实相之法本无眾生。若见有眾生。即乖于实相。故称為垢。若悟实相。则其垢自离也。若依无垢称经云。先云。无我。后云无眾生。所以然者。外道凡夫先计身中有我后执有眾生。以此理推无烦致。或广如无垢称经说也。法无有我者。远云。正明理无。亦真法中无三种我。准前可知。离我垢者破情显理。义同前解。此两句中破情显理后两句中破相显理也。肇云。欲明无有我。非谓有无我。又云。法无我者。执有主名之有我。然我不同。有其二种。壹者分别。二者俱生。分别我见有其二种。壹依邪教外道所起。二依邪思惟内道所起。此二我见体性不善。亦通隐没无记。唯在<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>中有。俱生我见亦有二种。壹在意识。性是不善。亦通有覆无记。二在末那。性唯有覆无记。此二种我悟真法时悉皆求离。故云无我也。法无寿命者。远云。正明理无。亦真法中无三种寿。准前可知。离生死者破相显理。若真法中有其生死故可就之说有寿命。既无生死。就何说寿也。满云。生居命前。死居命后。中间相续连持不段。故称名命。百年之期名之為寿。生死性空则无寿命。法无有人者。远云。正明理无。亦真法中无三种人。准前可知。前后际段者破相显理。有為之法前后相起。前為前际后為后际。若真法中有此二际。则可就之以说于人。真中无此。就何说人。于情為有。于理实无。翻情显理故称為段。非有所除也。释论云。不忍作恶行人法。故名之為人。行因得果往来生死永无朽灭。故外道谓之為常。前际既段。无人造因。后际亦段。无人受果。前后既段。中间亦空。何有人也。无垢称经云。法无补特伽罗。此云。数取趣与人义相似也</p><p>法常寂然下第二有六句明其法空。初二离相。次二离名。次有壹句结前离相。末后壹句结上离名。初两句中前之壹句正明离相。后之壹句破去心缘成前离相。就初句中法常寂然者。远云。真性不动故曰寂然。灭诸相者破相障寂四相五阴等是相也。真中本无名灭。诸相有相即不寂。相灭即寂矣。其由无法可生无法可灭故云寂灭也。谚云。真如<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>如来藏等实相法也。常寂然者。是等诸法性出自古体真无超作故云寂也。灭诸相者。本自无相。灭何所灭。正以非相為相。强称灭也。亦可法者壹切法也。法若有相即非寂灭法。何以寂灭诸相。故法离于相。无所缘故者。缘是心缘。相从心生。心若不缘。即相自空。能所俱寂。故离相也。法离相者。远云。正明理无。于真法中无五阴相名法离相。无所缘者。破相显理。若真法中有相可缘不名离相。于真法中无相可缘。故法离相。以无所缘能缘亦无。能所俱寂。所以离相。又云。法无相者无贪著之相。真法之中既无所缘。亦无贪著能缘之相。故无垢称云。法无贪著无所缘故。次两句中前壹句破名破说。后壹句破去心觉成前离说。就初句中法无名字者。远云。正明理无。谓真法中无有<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>所立名字言语段者。破去言说显成无名。名是言本。以无名故言语不生。故云言语段。举言语段成名无也。此解不然。何处名為语本。只可言為名本也。言语是名字之本。真深离言。岂有名字也。法无有说者。正明理无。于真法中言语不生。故无言说。离觉观者。破情显理。觉观言因。以真法中无觉观故言语不生。故无言说。麤思名觉。细思名观。此皆情相。真法出情故无觉观。问。初禪有觉有观。中间禪无觉有观。二禪已上无觉无观。与此真法离于觉观有何差别。答。真法性灭本自不生。所以云无。二禪已上对治不超云离觉观也。法无形者正辩理无。谓真法中无阴形相。以此结前离相之义。故说无相。如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>者类以显之。真法离相如世虚空故言如空也。法无戏论者正明理无。理外名言悉成戏论。真法离此名无戏论。以此结前离名之义。故说无戏论。毕竟空者释以显无。理绝言论云毕竟空也。上来就阴明法离相</p><p>自下第二就十八界明法离相。文中壹十九句。义分為二。初有壹句明人无我。后十八句明法无我。就初句中。法无我所者正辩理无。谓真法中无我及所。义如上解。离我所故释以显无。下法空中句虽十八相从為三。初有六句。明六根空。法无动下五句明六识空。法离好丑下七句明六尘空。初六句中。前三破相后三即实。就前三中。初句约识以明根空。第二约尘以彰根空。第三约因以显根空</p><p>就初句中。法无分别者正辩理无。于真法中无有六根。生识了尘名无分别。离诸识故者释以显无。于事分齐六根生识。真法之中无此识。故名离诸识。以离诸识故无分别也。又云。无分别者。真法之中无有三种分别。壹者自性分别。二者随念分别。三者计度分别。自性分别者。谓于现世所缘诸行自相行分别。随念分别。谓于昔曾所受诸行上追念行分别。谓于去来今不现前强思构行分别。<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>中唯第六意识具上三分别。自餘七识唯有自性分别。以缘现在故。或可第七末那亦有计度分别。计度执我故。若论体性。依杂心论。计度分别以惠為体。随念分别以念為性。分别為觉為性。真法之中既无虚妄八识。所以无此分别也。法无有比者正辩理无。相尘并对名之為比。真法无此称法无比。无相待者释以显无。以无根尘相形待故说為无相待也。或可有无相比。万法无性何得有待。故显无。有既不有。无何所无有。有无并空故无相待。如无名指。形长為短。望短為长。性非长短。如是真法体性自空有无性离。故无相待。故中论云。若法待因成。是送还成待。今即无因待。亦无所成法也。法不属因者。正明理无。于事分齐果从因起。以因摄果名為属因。真法无此名不属因。不在缘故释以显无。亲生名因。疏而助发称缘。如世諦法。种子為因地水為缘。芽果得生。有缘可在。即可对之说其属因。<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>可在。知复对谁说為属因。或可。缘者因之别称。言不在缘。当知犹是不在因也。不能重言彰不在缘。生不离缘目之為在。真不假缘故曰不在缘。故不属因也</p><p>自下三句约真如法性实际三义以显即实。此三何异。于真法中空名為如。有名法性。非有非无说為实际真。云何空。离相离性。云何不空。具<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>故。起信论云。壹如实空以显法体。空无妄故。二如实不空。次显法体。具足无漏性功德故。云何复名非有非无。有无同体住真实也。又云。法性真如实际此三皆是实相异名。如实不变名。如是诸法因名為法性。穷其际畔称实际也。初中法同法性者。当相正辩。如来藏中壹切佛法名為法性。所辩真法与彼壹体。壹而不异故说為同。入诸法故者释以显同。入犹顺也。由顺诸法故同壹性。此诸法等即是无漏性功德法。非是五阴事法也。故无垢称云。法同法性入法界故。问。法体既壹。云何名顺名入耶。答。体性虽壹义门恒别义别体。同得云顺入。下皆同尔。法随于如者。远云。当相正辩不异真如义也。法界虽别。空理不殊。故说為如。所辩之法顺彼如理故名為随。此与如壹。何故言随。义如前解。门别体同故得说随。前同此。随言左右耳也。无所随者释成随义。以于有法无所随故。故随如也。或可。非但不随于有。亦不随于无。离有离无故随如也。又云。若便如外有法即有所随。壹切皆如无所随也。法住实际者当相正辩。际谓际畔处之别称。穷尽之处名為实际。所辩真法即于实际名之為住。前随此住亦左右耳。诸边不动释成住义。不為有无二边倾动故住实际也。故智度论云。般若波罗蜜犹如大火聚四边不可触。远离于四句。谈云。实外有妄即是边是动。即妄恒真故无边可动也</p><p>自下五句明识空中。前二破相。后三即实。前两句中初句约尘以明识空。后句正就识体明空。初句中法无动摇者。正明理无。六识之心往来取尘名為动摇。真法常住不同于彼名不动摇。不依六尘者。类以显无。不同六识依六尘生故无动摇。或可。妄识取境為尘吹心名為动摇。真心离念虽缘万品缘无所缘故无动摇也。法无去来者。正明理无。六识之心三世<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>名為去来。去是过去。来是未来。真法离此故无去来。常不住者。释以显无。现在名住。若便真法曾住现在故可对之说去说来。法无现住。知复望何说来说去。此二遣相下三即实。法顺空者顺空门也。随无相无相门也。应无作无作门也。依中边论。空有三种。壹无体空。即分别性壹向无体。二不如空。即依他性缘生不实不同分别壹向无也。三自性空。即真实性即上二性无相无生為自性空。无相亦三。壹无人相。二无<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。三无执空分别之相。无愿亦三。三相空故故无三愿。同壹无性故名顺空。即随即应綺互言尔。类通万法悉入三空</p><p>自下七句明尘空中。初有四句正就尘体以说其空。次有壹句约根辩空。次有壹句约就尘体以明其空。末后壹句约识彰空。就初句中法离好丑者。远云。明离相也。于事分齐尘有美恶。美名為好。恶称為丑。真法离此故无好丑。庄云。善法為好。不善為丑。法无善恶。有何好丑。叡云。实智為好。无明為丑。真法性空。何好何丑也。法无增损者。远云。明离尘用。顺益名增。违情称损。真法离此名无增损。叡云。若生即增。若灭即损。法无生灭故离增损。庄云。无相真法有佛无佛。其性常住无有二相。如来说法普度眾生。灭尽法亦不减。涅槃亦不增也。法无生灭。法无归者明离尘体。六尘之体有起有尽。说為生灭。属人曰归。真法离此故无生灭亦无所归。又云。生灭从缘而无体性。虽生不生。虽灭不灭。法若有生即归于灭。以其无生故无归灭也。法过眼耳鼻舌身心者。约对六根以明尘空。于事分齐六尘是其六根所行。二乘不名為过。真中无尘。眼等不及故名过。法无高下常住不动者。还就尘体以辩其空。于事分齐尘有胜劣。上地尘胜為高。下地尘劣為下。三界俱空。真法离此故无高下。又在圣不高。居凡不下。以法性平等体无高下也。生死為下。涅槃為高。空法之中无生死故无下。无涅槃故无高也。常住不动释无高下也。法离观<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。约识辩空。于事分齐尘為识缘。不离观行。于真法中无尘可缘。是故名离壹切观行。问。真法既离观行。无分别智岂不缘如。答言。离观行者。谓离凡夫二乘有相观心缘真不及所言离。若望真智缘亦不离行也。或可。无分别智虽复缘如亦离观行。何以故。智证如时不取如相。所以言离。或可。智虽缘如。缘无所缘。亦离观行也。上来别教也。法相如是岂可说乎者。以理返责牒前所辩名法也。是名相俱绝心行亦无。岂可宣说。上来约就所说法体以教</p><p>自下第二约能说仪式以教。于中有三。壹说仪。二离失具德。三劝说。初说仪有二。壹法。二喻。法中无说无示者。远云。明无说人。将言对法名说。宣法对人名示。理中无此名无说示。其听法者。无闻无得明无听人。以耳对言名闻。以闻解法名得。理中无此名无闻得。谚云。夫说法者明法非无。无说无示彰法非有。非有故离常。非无故离段。非有非无即离段常。是名正说。其听法者明法非无。无闻无得彰法非有。非有离常非无段。离段常名曰正闻。又云。说时离言故云无说。以法示人。实法性空。示无所示。故云无示。无闻无得者。常闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。以法体空故曰无闻。依闻而证。<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>实法。法体性空。得而不得故名不得。测云。实相法体无名故不可说。无相故不可示。不可说故无闻。不可示故无得也。又云。宣说诸法无有实说故称不说。以法示人无有实示故云无示。耳闻正法无有实闻故名无闻。解心得法无有实得云无得。此离遍计情执也。故无垢称经云。夫说法者壹切皆是增益损减。其听法者亦复皆是增益损减。庄云。论说法之人多有示之心。听法之徒并有闻得之相。今言说法之者无说无示。终日谈论未曾有说。终日诲导未曾示人。非是杜口不说不示也。其听法者无闻无得。终日听法而未曾闻。如海吞流。未曾有得。非是塞耳不听以為无闻。非是都无所获以為无得。良由闻者毕竟净也。故思益经云。若有菩萨于此眾中作是念。今说是法。当知是人即非听法。所以者何。不听法者乃為听法也。譬如幻士為幻人说法。当建是意。说法者此举喻况譬如幻士明无说人。為幻人说法明无听者。非谓法无名相即无说。听之者人我性空。谁為说。听之者当建是意。如幻士為幻人说也</p><p>当了已下第二明其说法之德。翻前四失以明<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>。当了根者。第壹彰说法人知根之德。明了眾生根利钝故。善于知见者。二明证法之德。证深法故无所罣碍。大悲心者第三明大悲之德。善為眾生演大乘故。大乘之法拔苦尽原。所以成悲也。报佛恩者。四明报恩之德。善教眾生发菩萨心自致<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。成佛即有法。有法即化眾生。是其僧宝展转相教。故名<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>不段即报佛恩也</p><p>然后说法者。第三识仪离失劝如法说也</p><p>维摩詰说是法时者。上来第二教教呵竟</p><p>此下第三明八百居士<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>。是其教益我无已下第四结不堪也</p><p>佛告迦叶者是性。翻為饮光。饮光是古仙名。此仙身有光明能饮诸光令不现前。故以為名也。其人是饮光仙人种族。即以為名。又自身金色亦有光明。是王舍城<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>种。其家巨富。妇名婆仙。其人昔于迦叶佛时作装像师时。有壹女持壹金珠寄此像师修营佛像。由斯福善恒相逢遇。今值佛出世还為<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>。身并金色。在俗无欲。同皆出家齐得罗汉。迦叶在日常与如来对坐说法。佛灭度后所有法藏悉付迦叶。迦叶后时结集<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>竟。至鸡足山入灭心定。全身不散。后<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>出世之时以足案山而出。在大眾中作十八变度人无量。然后灭身。未来成<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>曰光明。弟子之中头陀第壹。以无平等大悲具有四失故被呵也。文四同前</p><p>就其第三释所以中。初徵后释。所以言我不堪问疾者何忆念已下广释所以。就中。有二壹出昔被呵之事。二时维摩下明其教呵得失之相。前中贫里而行乞者有四义。壹者迦叶本為慈心行。于头陀福利眾生。以其贫者先不殖福招此苦报。今从贫乞令离贫苦。二迦叶是大声闻得灭尽定。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>之者皆得现报。今愍斯长苦。所以从乞。三富者嫡奢难化。贫者受导易从。四若从富乞即有名利之嫌。今从贫乞即念少欲之行。故从贫乞</p><p>第二教呵相中先呵后教。时我世尊已下迦叶闻法发心呵中。有悲心而不普者。捨富从贫。欲使贫者得富。不觉富者还贫。故非普也。就正教中大文有两。壹者正教翻失显得。二如是食者已下以其德故施受二人俱获胜益。前中初先翻彼四失即成四得。然后食下壹句总结。前中言四失者。壹取食相。二畏境界。三见邪正。四心不普。初取食相中自有四失。壹不平等。二不為不食。三不為坏和合相。四不為不受。住平等法应行乞食者。翻其初失欲食。令学者為证清净平等法身而行乞故。然后可食下诸句中类同此释。或平等有四。壹人平等。眾生普视。二法平等。真如佛性。三心平等。须发普心贵贱等观。四行平等。须发普行贫富同乞。今此文中约行平等也。不食故应行乞食者。谈云。翻第二失。真体离缘涅槃平等不假于食。应以此心而行乞食。若然即终日食终日涅槃。其道无二也。庄云。旧诸师解不食即涅槃。為涅槃故行乞食。释还成他义。小乘人乞食并為求涅槃急如火。若作此呵。未成呵责。今此文意皆以实相平等折彼执心。今明即食為不食。汝若能无所食乃可取食。為坏和合相应取揣食者。谈云。翻第三失。阴界入等名和合相。虽取揣食為坏生死五阴身故。唯求离相清净菩萨故行乞也。庄云。三尘假合成其段食名為和合。汝能了食无所食。即是坏和合也。故无垢称云。為欲坏彼于食执故应行乞食也。為不受故应受彼食者。谈云。翻第四失。法身常住不受生死身也。应以此心而受彼食。若然即终日受食而不曾受也。庄云。如受食时了食性空。受无所受也。故无垢称云。為欲受他所施食故应从乞食</p><p>以空聚想入聚落者。第二呵畏境界相翻失显得。于中有二。初句总教。所见色下第二别言。聚落者村坊城邑白衣住处名為聚落。迦叶乞食必入聚落。见有贫富即捨富从贫。今观聚落性空眾生非有。何為捨富从贫畏而不入。若然即终日聚落终日平等也。别中约就根尘等法以理正教。以声闻人未证法<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>尘是有对之起怖故。教令观空。于乞食时多于六尘而生诸结故须教观。此文之中于六尘境依法各异。于色尘境教观根空而為对治。于声尘境教观境空而為对治。于香味两尘教观识空而為对治。于触尘境教观能取所取性空而為对治。于法尘境亦教观境空而為对治。壹相如此互从皆得。所见色与盲等者。夫入聚落必有见闻。凡夫见闻即空诸结。二乘见听怖以六尘。令双厈凡小故辩菩萨法也。盲人无根于境不著故不分别色形美恶。故无达顺。行者观眼从因缘生无性故空。即识不生。故无分别。故下经云。若知眼性于色不贪不恚不痴。是即寂灭安住其中。非是闭目不见名為盲人。常对四色而不取相故是如盲。譬如五指涂空。空无像现。眼亦如是。虽对色尘了眼性空见无所见。故如盲也。若约互从因缘和合眼能见色。今观眼空。识亦非有。识性既空。识即不生。三法体空即无分别。所以如盲也。故法句经云。眼自不见。属诸因缘缘。非见性眼即是空。色属眼时名色為色。若眼性空。色亦无实也。所闻声与响等者。声从缘生。无有自性。无性即空。与响何异。所嗅香与风等者。香随风转。自体不实。既譬如风不空何也。又云。风行香林无心分别。行人亦示了识性空。虽复嗅香竟无别也。远云。风事浮麤人多不著观。香似彼故无贪著也。所食味不分别者。六味缘生根非自有。妄识体空何所分别。远云。瓢杓无心虽在诸味不生分别。行者应尔。当如瓢杓不生分别。受诸触如智证者。如圣人<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>之时理无能所。行者亦尔。观身空故无其能触。境空故无其所触。能所双亡故如智证也。知诸法如幻相无自性无他性者。阴界入等名為诸法。法体性空故云如幻。从缘而生故无自性。无自性故亦无他性。自他既无即不共生。所以不然。不无因故。故不灭。又云。不无因者。有因当不生。无因依何生也。既无有生亦无有灭。故中论云。诸法不自生亦不从他生不共不无因。是故知无生。又云。无自性者籍缘生也。无他性者自因生也。本自不生者谓无作用也。今即无灭者缘生似有也。对法论云。自种有故不从他生。待缘生故非自作。俱无作用故不共生。有功能故不无因也。又云。释有三义。壹总。二即。三相待。总者诸法当分无不是自。但言无自即以总破诸法使无他也。即者举他望自。自即為他。今既无自即亦无他也。相待者自他相待。既明无自。更待谁说他。故前明无自。此明无他也。法本不然。今无灭者然犹生也。解有三义。壹约圆成。二空真如性无生灭。故云不然不灭。二依他从缘而生。生即不生。从缘而灭。灭无所灭。故称不然不灭。三约遍计。愚夫横计当情似有。体性本空实无生灭。故云不然不灭也</p><p>若能不捨八邪已下。第三呵取邪正翻失显得。远云。声闻独善故捨八邪入八<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。菩萨兼利随物视同故不捨八邪入八解脱。谚云。言八解者翻八正道以為八邪。谓邪见邪思惟邪语邪业乃至邪定。入八解脱者遂翻八邪以為解脱。谓<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>乃至正定。亦可是彼内有色相外观色等八解脱也。邪正既异。云何不捨于邪而入正也。是大难解。有人云。谓诸佛菩萨虽自正证而以大悲应同于邪故云不捨。如此释者大成猛狼。既云应同久已捨竟。云何不捨。又此文中呵彼凡小不达法空心有取捨。呵之欲令学于大乘平等真观。何得乃就应同者释。都不相应。今解云何。净名妙契真如体非邪正。妄情分别谬见是非。如此惑与理相违。悲伤不已。今正教之观。此邪倒从妄心起。心尚非有。妄依何生。达妄体空即真解脱。理既不居邪正。岂有缚脱之名。今已无邪可捨名入解脱也。又云。二乘捨八邪而入八正。大士识邪性空与正无异。所以不捨而入。以无可入对彼捨入故云不捨入也。以邪相入正法者。远云。前就因此约果以教。邪相<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>正法涅槃。声闻独善捨邪入正。菩萨兼利随物现同。故不捨邪入正法也。又云。二乘捨邪入正。大士悟邪正俱空。解空不异故名為入。何為离邪而求正也。若欲除邪别觅正者。如第二头第三手等。失之远矣。故下经云。住正道者不分别邪正也。以壹食施壹切</p><p>第四訶心不普翻失显得。凡小之类闕于大悲。其所得食不能广济。但欲自资。无心為物故。今教之食无定相广狭随心。心小故但益壹身。心大故遍于凡圣。若能普施即福利弘多。岂得限心而独食也。庄云。法界之食壹多无二。知壹即多故以壹食施壹切。然后可食者。此之壹句总结。向前具四德者可得食之即显失者不合食也。上来教呵竟</p><p>下次第二以其乞者如法食故能令施受二人各获胜益。文中有三。壹明受者。离六相故行于中道。二其有施下明施人。无四别得平等福。三是為正入已下总结显胜。前中六相者作三对说。初言非有烦恼非离烦恼。是其初对。凡夫有烦恼。二乘离烦恼。菩萨了烦恼性空。非有烦恼故不同凡夫。非离故不同二乘。故无垢称云。非有障染非离障染也。又云。顿悟菩萨段分别<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>。非有烦恼。留俱生惑助悲愿力受生。非离烦恼也。或惭悟菩萨无漏行圆。非有烦恼。随俗现起。非离烦恼也。若能如上平等食者即法身食也。故下经云。住正道者不见邪正等也。非入定意非起定意者。是第二对。诸声闻等摄心為定。起心為散。菩萨不尔。行中道故静乱俱融。于壹切时无不定也。又云。外利他事不同二乘。非入定意心常不乱。不同凡夫。非起定意也。满云。小乘入定即不食。食即不入定。欲食之前要先入定而起方食。食竟还入定生施主福。大士识定乱无二。终日食而终日定。故无出入异也。非住世间非住涅槃者。是第三对。凡夫住世间。二乘住涅槃。法身大士了世间空故不住世间。解涅槃空故不住涅槃。故下经云。我及涅槃此二皆空。又思益经云。诸佛如来不得生死不得涅槃。佛胜弟子得解脱者亦不得生死不得涅槃也。又云。大智成满得涅槃。非住世间。大悲已满常利他。故不住涅槃也。第二施者无四别。无大福无小福者。迦叶意谓施圣人得大福施凡夫得小福。福者果也。法身大士不见凡圣有异。不见由之优劣。何有福之大小。故云无大无小。无垢称经云。无大果无小果也。不為益不為损者。理无增损。无大福故不為益。无小福故不為损也。第三是為正入佛道者。正显叹胜。佛道者佛所得道。谓正体后得二智。既知受者无六相。施者无四别。岂非人平等佛道也。不依声闻者。举劣辩胜。声闻分别未亡故不依也。若如是食為不空食者结叹劝修也。上教訶讫</p><p>时我已下是第三迦叶彰已闻法发心捨小乘执。于中四句。壹自发大心。二复作是念下彰净名德。三其谁已下劝他发心。四我从已下彰己及他俱捨小行。是故已下结不堪也</p><p>佛告须菩提者。此云空生。亦名善吉。故福德经云。舍卫城中有长者名拘留。父為无子故祠天求子。空声应言。汝福得多无堪来者。有天王命终应生君家。后便诞身。其人初生舍宅皆空。父母怪之以问相师。相师告云。现空唯善表大。解空第壹故曰空生。后长大请父延佛。设食即随佛还祇洹精舍作沙门。思念人物俱空获阿罗汉果得无挣三昧。未得大乘究竟平等大空三昧。故今被呵。若就行辩前。大迦叶以无平等大悲捨其大乘乐于小法。不能贫富平等。闕助成之行。所以捨富从贫乞。今须菩提闕平等空智。欲捨小法别求大乘。不能以富等贫。谬见邪正遂捨于贫而从富乞。此并未会不二之真故被呵也。文四同前第三释中。初徵后释。释中有二。壹举昔日被呵之事。二时维摩下辩其得失教呵之相。前中入舍从乞食者。须菩提自念。若从贫乞恐成恼乱令诸眾生得嫌嫉之罪。故须捨贫唯从富乞。故今须入维摩詰舍</p><p>时维摩下广明得失教呵之相。文中有三。壹明翻失显得教呵之相。二时我已下明须菩提自申已屈维摩垂教。三说是法下明教呵益。前中维摩取闶⒎拐呓毯撬?伞:喂示幻?°盛饭而不与者。略有三意。壹取銥榫⊙月邸H舨蝗°。彼得切难恐怖捨去。二若不满施惧招慳过。广开施门彰己无吝。三寄食以兴论端。故先取闶⒙?挂病Nㄐ肫刑嵯抡?鹘毯且病N闹杏兴摹R己怯谑巢坏取6?欢我?掠诟拷獠坏取H?患?鹣掠谑Ψú坏取K娜胄凹?掠谝记蟹ú坏取7?怂氖Ы坛伤牡隆W芎且夥翟鹦肫刑</p></div>"
}]