[{
    "title": "维摩经义记卷第四 第2769部",
    "author": "慧远大师",
    "html": "<div class=\"B1_text\"><p>维摩经义记卷第四</p><p>中闻是故在后而明也。又解。正在此中明亦是次第□□□□□□能现女像。亦能行于非道。以通正道。佛者圆极之果。与□□□□道者能通。人至佛故目此品為佛道品。又解。行于非道為令宝凡终□佛□远则彰菩萨有兼物之德。形夺二乘独善之道。就此品中开為两别。始从品初讫永不能发无上道心。正明通达佛道义。后从普现色身已下是因室空生问。但不别立品名。寄此明也。就佛道中开為三段。第一从品初讫菩萨能如是行于非道是為通达佛道。直明行非□□之义。第二从维摩问文殊何等為如来种讫不入<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>大海则不能得一切智宝。明就缘说于佛□□臣所以□□<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>烦恼之印有如来种能<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>也。第三从尔时大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>叹言已下迦叶讚述文殊之言兼复自慨现分</p><p>就第一段通达佛道中。维摩言菩萨行于非道是為通达佛道者。今云非道。唯除菩萨正道自餘悉為非道也。明菩萨和光以同□為功。谓行于非道内心无染道之以。正即通达佛道。為行之□□藉非道。然后正道得通。物我之行俱申。是故言菩萨行非道是為通达佛道也。又问言何行于非道者。菩萨同其尘便应有染。云何同非而无其恶。答曰。行五无间而无恼恚者。恶从心生不在事理。示行五逆内心无瞋。故不同其恶。就中开為四子段</p><p>第一行五无间讫至于饿鬼而具足<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。就恶因恶德果明行于非道。行五无间而无恼恚者。即恶中重因。凡夫多以恼恚心切造于五逆。欲□□□□现行五逆而无恼恚也。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>畜生饿鬼即是□□□果也。凡堕地狱。罪垢故堕。大士虽现处之实无罪垢故也。□□多故堕于畜生。欲明菩萨虽现畜生而痴慢久断也。慳贪薄福无诸功德故堕饿鬼。大士虽处其中而功德是足也</p><p>第二子段。引<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>道。不以為胜者。就善因善果明行于非道。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>即是善果。道者善因也。欲明大士虽现处之而不可為胜也</p><p>第三子段。示行贪欲讫示行诸烦恼而心常清净。总就一切烦恼因明行于非道。示行贪欲离诸染著者。明菩萨虽示同贪欲之行而无染著之过。自下诸句类在可知也。示行诸烦恼而心常清净者。总举一切烦恼。烦恼因不可道尽故总举结之。欲明大士烦恼□于外心净著于内</p><p>第四子段。示入于魔已下讫不断生死。就□诸<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>明行于非道。示入于魔而随佛<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>不随他教者。欲明菩萨外同眾魔内顺正惠不随魔之教也。已下类可知。现遍入诸道者。果报不可道尽故。总举果报结之。现于<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。涅槃是果报之外故别出之。文殊师利菩萨能為是已下总结行于非道通达佛道义</p><p>于是维摩问文殊已下第二大段。就缘说种。所以问文殊者。欲明二圣互相显扬。就中开為三子段</p><p>第一从于是维摩已下讫一切烦恼皆是佛种。明就诸恶说种。烦恼所以為如来种者。若论道理。万行為佛种。今指烦恼為种。若无烦恼不能发心。缘有烦恼发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。此缘中说种也。又解。所以指烦恼為种。今明法起不定从缘而发。或反邪从正。或改恶修善。是则正由邪起。善因恶生。故缘能种辨。上明非道為道师之功也。今明非种為种<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>德也。是為二乘独善闕师之功。无烦恼种失弟子之德。有身者。身见為万戒之本。无明欲爱已下广就诸烦恼增一明义也。七识住者欲界人天是一三禪三空為七。所以不取三涂者。但三涂是重苦之处。识不乐住。所以不取。第四禪但四禪心。无想是灭心定。识不乐住。所以不取。非想者但非想為灭尽定所怀。是故识不乐住也</p><p>第二子段。曰何谓也已下讫是故当知一切烦恼為如来种。明于释疑。何谓也是致疑之辞。至极妙果应藉胜因而以為种。今言烦恼為种意何所谓。答曰。若见无為者空观也。入正位不能发心者。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>引□上名為正位。明二乘之人勉于尘劳心栖寂怕之理无為自安绝于方外之志也。凡夫烦恼既重遭苦弥重。闻说至乐能发方外之志。发心住取。苟据理而言。二乘之人俱然在先<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。但今所以作此语者。為令二乘明切瑳之美凡夫起于胜求之心。譬如高原不生莲华者。此下有三譬。前二譬凡夫罗通佐譬。后一譬偏与二乘為譬。高原不生莲华与二乘為喻也。卑湿淤埿者与凡夫為喻。如是见无為已下合上高原陆地。烦恼淤埿中已下合上卑湿淤埿也。又如殖种于空已下亦与凡圣两人為喻。但前者据五钝使為言。此就五利使為语。故得為异也。又如殖种于空者与二乘為譬。粪坏之地与凡夫為譬。见无為者合上殖种于空。起我见毕合粪坏之地。起我见如须弥山者。明凡夫我心自高唯胜是从故。闻<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>极乐仰而慕之。是故当知已下总结一切悉如来种</p><p>第三子段譬如不下偏与二乘為譬。前二譬明二乘无弟子之德。后一譬明无师之功。凡欲取珠。要须躬身跋涉大海。声闻不入生□□□□□□□□□□□□宝菩萨入生死□□获于佛果故言得无上智宝也</p><p>尔时大迦叶叹言善哉已下第三大段。善哉已下明讚述文殊之言。尘劳等侣实能发心為佛种也。我等今者不复堪任已下明二乘自慨绝分不能发心叹凡夫能发心也。是故文殊凡夫于<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>有返复而声闻无也。凡夫于佛法有返复。佛本正以救苦為怀。凡夫能发无上之心。广化眾生称佛本意。报恩义足。故言有返复也。而声闻亦稟教<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>。但断<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>惑尽取证涅槃。不能行化于物。乖于佛意。故言无返复之义也。又一解。莫两凡圣无始已来皆曾发大心。中间废忘。今凡夫还发大心。称本旧解。故言返复。二乘之人于大乘绝分。不归本习。故言无返复也。所以者何以下释凡圣两人有无之意。所以凡夫有返复而声闻无返复者何。释云。凡夫闻佛法能起无上道意。发心成佛。传教不绝。悟者常续。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>不断。有报恩之义。故有返复。正使声闻闻佛法。终不能发无上道意。故无返复</p><p>尔时会中有菩萨名普现色身以下讫入<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>品。□□□空生第四论。因室空故普现致问。凡人室家应有父母妻子眷属取与资生。<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>此事如何所在。净名答明大大士与世有异。世人以生死為父母妻子眷属。有為法為资生。大士权实二智為父母。功德以為妻子眷属及与资生。虽知无起灭辨明方便广上父义。不二法门品广上母义。后五千菩萨得无生忍。此皆由空室而来。普现色身问远从空室近因此品初区同非道无恶不兼。今明佛之正道无德不备。德备于内故能外同非道就</p><p>此中开為四段。第一从初说皆何所在。明由室空故普现色身生问也。第二从于是维摩以偈答曰以下讫降伏四种魔胜幡建道场。明□□□父母眷属资生与世有异。第三从虽知无起灭示彼故有生。以下讫品。明方便智广上父义。第四入不二法门品明于实智广上母义也</p><p>第一段普现色身所以致问者。夫為室宅之内应有父母眷属及以资生什物。而今悉无。是故问言。父母妻子悉為是谁。象马车乘皆何所在也</p><p>就第二净名以偈答曰中开為三子段。第一从智度以下讫以此為音乐。有四行偈。就人眷属為语。智度菩萨母方便以為父者。母本明縎家事在于室内。欲明实智据在理内故以為母。父本当宾客。匡正于外方。便外化其犹如父。一切眾道师无不由是生者。此二智长养法身万行之本。岂直是菩萨父母。一切诸佛亦从是生也。法喜以為妻者。妻本适志。法喜适悦故以為妻。又一解。世人纳妻者為求子胤绍继家宗。喻如道从<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>生。以欢喜故则佛种相续法身不断。其由纳妻子胤不绝也。慈悲心以為女者。女人有外出之义。慈悲外被故言為女也。又一解。女人性多慈悲。為怀慈悲之心像女之性故以况之。<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>诚实男者。男性贞干能辨家事為义。欲明诚实之善既有贞干之用能辨佛果<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>家事。毕竟空寂舍者。舍以安身為义。空是栖神之宅。其犹如舍。又一解。舍本遮止风霜掩于雨露。明此空理能遮烦恼风霜掩诸漏雨露也。弟子眾尘劳随意之所转者。弟子本以稟承师训為义。明尘劳眾生从我受化即有弟子之义也。又一解。弟子者敬顺<a href=\"/remen/xiaoyang.html\" class=\"keylink\" target=\"_blank\">孝养</a>资益于我。明化尘劳眾生功来资已故為有弟子也。道品善知识由是成正觉者。善知识能以善相益。正由道品资益成佛故言知识也。诸度法等侣者。世人游江越塞必须结畴敦侣然后得去。欲明大士若游生死江河越烦恼之关塞。若不与<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>共俱无由得去。故说為等侣也。四摄為伎女者。四摄顺物以悦眾情故言伎女。又解。伎女本以音声為义。必多来人眾。四摄化物称适物情。眾必归从也。歌咏诵法言以此為音乐者。世人音乐以自慰悦。菩萨以法音自娱</p><p>第二子段总持之园苑以下讫净心以澡浴戒品為涂香。七偈明资生有异。总持之园苑者。园本遮援林果不令遗失。欲明陀罗尼总持音声<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>不失也。无漏法林树者。见諦无漏树木根深难拔故得枝条兹茂。明无漏深固难倾万善枝条故净扶疏舌犹树也。又一体树木能遮蔽日光则有荫凉之义。明此无漏之体能障邪见烦恼日光获得涅槃清凉妙乐也。觉意净妙华<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>智惠果者。华本由树而生能得于果。以见諦无漏為树能生思惟七觉之华获尽无生智解脱之果也。八解之浴池定水湛然满者。八解脱背捨下恶。其犹浴池除垢也。夫欲修八解脱观事须游心定水。若<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>圆备。则八解池满。故言定水湛然满也。布以七净花俗此无垢人者。此七净者戒净心净见净度疑净道非道净行净行断知见净。谓之七净也。华本芬香鲜净為义。明七净备戒定芬香智慧鲜净其犹华也。罗汉法身大士游心此理。故言浴此无垢人。又解。华本由水而出即能<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>于木。此七净由定而生即庄严于定象马五通驰者。菩萨以五通飞驰处处行化。其犹象马驰骤也。大乘以為车者。大乘有运载之义。其若车也。调御以一心游于八正路者。八正之道虽复平坦。若无调御大乘之车则有越辙之义也。一心者捨心也。心有三相。一者发动。二者敛摄。三者捨心。若心发动太过则应修定。若心沈没太过则应修<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。若动静调适。任之令进容豫之中。是名為捨。捨则调停犹如善仰之者。牛迟则策之。疾则制之。迟疾得所。则纵渐涉夷途无有留难也。具以严容眾好饰其姿者。以三十二相庄严其容。八十种好光饰姿顏也。惭愧之上服者。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>上服以障弊為义。欲明菩萨惭愧自法為上服以彰无惭无愧黑弊鄙立也。深心為华鬘者。世人华鬘首之饰。欲明深心行之上其犹如鬘也。又解。世人杂綖贯宗眾华以為首饰。欲明菩萨以深心之解贯宗诸行终成庄严智慧之首。富有七财宝者。信戒闻惠<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>惭愧谓七财。世人丰七珍為富也。大士积此七法為富也。教授以滋息者。以七财<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>于人。人复化彼。化化相传非滋息如何。如所说修行迴向為大利者。如说能行。迴所修善共成无上道。功来归己。其犹大利也。四禪為床坐从于净命生者。床坐寝卧安身。四禪者安静义同床坐也。又解。世之床坐避毒螫下湿。明菩萨修四禪為除下地卑秽之患也。夫造床座要须运动斤斧然后得成。今朝若不修净命為因。禪定无由可剋言。从净命生也。多闻增智慧以為<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>音者。外国诸王寝睡过多故作糸竹之音奏其耳道令彼<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。欲明菩萨寝在禪定之床太沈。则以多闻增智慧除无明之昏睡也。<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>法之食解脱味為浆者。食以资身养命。浆以息渴。如理无漏甘露资法身养惠命。经脱除生死之渴爱也。净心以澡浴戒品為涂香者。心净故则持戒除垢。犹澡浴除垢秽也。世人浴竟恐直风入体以香涂之。戒防非法能障恶法。其犹涂香也</p><p>第三子段摧灭烦恼贼一偈明举勇健能伏怨敌结上两段。世人身健多有谋略故。眷属资生所以得立。身羸怯愵则為他人侵夺。资生眷属不得存在。欲明菩萨正以智慧法身强故烦恼四魔不能侵毁也。摧灭烦恼贼勇健无能踰者。世人除怨得称為勇健。明菩萨能灭烦恼智慧勇猛。降伏四种魔胜幡建道场。太世人破阵胜幡树胜相。明菩萨叹四魔□正以坐道场為胜幡也</p><p>从虽知无起灭已下第三大段广于父义。所以父母偏广者。惟尊唯重生育之本不过父母也。菩萨二智眾德之宗万行之本故偏广之。就中开為四子段。第一虽知无起灭以下三偈总明外化物示现不同上供诸佛下化眾生也。第二从诸有眾生类以下讫以善方便力皆能给足之二十四偈。虽明外化非一也。第三如是道无量两偈总举结上。如是道无量者。内德无量也。所行无有崖者。正由内行无量故能方便无量也。智慧无边际者。释上道无量。正由智慧无边故内德无量也。度脱无数眾者。释上所引无有崖也。正以能度无数眾故行化无崖。假令一切佛一偈明德量渊旷。谈不能尽。佛叹菩萨之德。岂可不尽。此言不尽者。但言不可累书事不可叠道故言穷劫不能尽也。第四谁闻如是法一偈劝发心也</p><p>入不二法门品</p><p>此品所以来者。上明佛道品。即是明中方便。今明自非照真諦之境穷达无生之理。无由能涉明施化。故次佛道品复明不二法门品。此品是第四大段广上母义。空理一相故言不二。能轨曰法。通智為门。善契此理所以称入。从始以来唯二人相对餘皆默然。今欲各显其德故问眾人也。又一解。至理幽玄隐而难测。自非眾圣详辨无由可究。且时人寄悟不同。应见眾菩萨说然后获悟。就此品中开為三段。从初以下讫随所乐说之。明净名命眾菩萨说。第二从法<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>以下讫净名默然。正明不二法门义。第三从就说是语时五千菩萨以下讫品。明<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>利益时人悟道。就第二段中复开為三段。第一诸菩萨以言遣法。第二文殊以言遣诸人之言。第三净名以不言遣文殊之言。就诸菩萨名中各有三句。第一以事相為二。第二明据理无不二。第三明智会不二之理。下一一菩萨中皆如此。类可知。法自在菩萨曰以生灭為二者。生名起成。灭者缘离曰灭。法相理中不见始起之生亦不见今离散為灭。得此无生忍者即是会不二理也。德身首曰我我所為二者。计身有神我自身之外悉為我所也。既无神我亦无身外之所也。不眴曰受不受為二者。受不受相对為二。受以取相為义。不受者心无存执。若法不受则不可得者。若法相理中不见有取相是受。亦不见心无存执是為不受。正以受不受不可得故无受心。是取不受心為捨。亦无作起受引等相也。德顶曰垢净為二者。烦恼点污為垢。智慧鲜洁為净。若见垢实性则无净相者。若见烦恼实性体空则无智慧净相也。顺于灭相者。顺于空如灭相也。善宿曰。是动是念者。纷乱為动。澄静為念。静乱相对為二也。又一解。微起為动。取相染著為念。始终為二也。亦得六识為动。想受行為念也。不动则无念者。法相理中无六识之动。亦无想等之念。无念则无分别者。既无想等之念故无六<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>。是分别通达此者智会于理也善眼曰一相无相者。追二為一相。除有為无相逐事明空人计云召然有异故。一相无相相对為二。若知一相即是无相者。若知一相体空即是无相空也。亦不取无相入于平等者。亦不见无相可取。解平等空也。妙臂曰菩萨心声闻心為二者。二乘自度心智则狭菩萨兼济心则旷大。计大小心為二。若观心相体空如到者则无大小之别也。弗沙曰善不善為二者。顺理益物為善。违理损物為不善。若起心顺理為善违理為不善。入无相空际者则无二也。师子曰罪福為二者。上云善不善。就因為语。此语则据果為因言。三涂苦果為罪。人天乐报為福。又解。是因中之名因招苦果為罪。感乐名福。若达罪体性空则与福无异。以金刚惠决了此空相。则无罪是缚无福是解也。师子意曰有漏无漏為二者。苦集為有漏。灭道為无漏也。若得诸法等则不起漏不漏相者。若得诸法体空平等则无苦集有漏。灭道為无漏。不著于相亦不住无相者。不著有漏之相亦不住无相无漏之无相也。净解曰有為无為為二者。万像森罗是有為。太<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>寂為无為。此空有相对為二。若离一切数则心如虚空者。若知有為数空则心如虚空。求虚空亦不可得也。那罗延曰世间出世者。从外凡夫迄世第一法已来名世间心。无相已上得真无漏名出世间心。世间性空即是出世间者。若解世间实性证空即是出世间无相也。于其中不入出溢散者。于空理之中。不见世间心入于生死出世间心出于生死亦不见世间心流溢生死出世间心散灭生死也。善意曰生死涅槃者。缚解為二。生死是缚。涅槃為解。若见生死性则无生死者。若解生死体空即是涅槃无生死也。无缚无解不然不灭者。亦无生死為缚涅槃是解。亦无生死烦恼炽然。无涅槃寂灭也。现见曰尽不尽者。烦恼為尽。灭结无為名不尽。若究竟尽若不尽皆是无尽相者。法相理<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>尽与不尽二俱是空不可得故言尽不也普守曰我<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>者。计有神我為我。计定实无我為无我。我尚不可得非我何可得者。法相理中神我尚无。岂有定实无我可得。见实性体空者不复起于我与无我也。电天曰明无明為二者。智慧是明。烦恼為无明也。无明实性即是明者。无明实性体空故即是明也。明亦不可取离一切数者。明体性空离一切心数故亦不可得取也。喜见曰色空為二者。计<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>定有為色定无為空。色即是空者。色体性无故色是空也。非色灭空色性自空者。非是色灭方空。色体本来自空。受想行识亦皆尔也。明相曰四种异空种异為二者。四大对空大也。四种性即是空种性者。四大性空即是空大。对此五大成身故言种也。如前际后际空故中际亦空者。人计现在五大成身故。举过去未来破于现在也。妙意曰眼色者。根尘相对為二也。若知眼性于色不贪不恚不痴者。若解眼性体空则于色不生贪瞋痴。是名寂灭。即体空也。耳等亦然。安住者不见根尘可得也。无尽意曰布施<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>一切智者。六度是己之行体。迴向者以我之行迴向萨婆若。布施性即是迴向一切智性者。明布施空即是一切智性也。持戒亦然。于中入一相者。会空不二也。深惠曰是无相无作者。空是根本。无相无作是者枝条。又解。必未皆二。或可。三四。但是二增数之初故言二也。空即无相无相即无作者。观假实无性為空。正以空故无于眾相亦无造作。若空无相无作即<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a><a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>者。悉皆空也。寂根曰佛法眾者。佛僧是人。法则法体。此人法相对也。佛即法法即眾者。体空不异故得相即也。是三皆无為相与虚空等者。将事无况性空也。一切法亦尔。类万法斯空也。心无碍曰身灭者。五阴缘聚為身。缘散為灭。此计存亡為二。身即是身灭者。见实相体空者不见有身及与灭身。存亡体空故无二也。上善曰身口意善者。身口為外意為内。此内外相对為二。是三业无作相。身口意体空皆无造作也<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>曰福行罪行不动<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。能得三涂苦果為罪行。从欲界人天迄三禪谓福行。第四禪已上至非想為不动行。罪福据苦乐之境。因為麤境四禪已上不苦不乐名為不动。是其细境。此麤细相对也。三行实性即是体空。空则无有罪福之别也。华严曰从我起為二者。据计心為二也。上我我所者。直就前境此明计我之心计所之心也。见我实相者。不起二法。若解我体空。则不计我我所之心。故无二法。若不住二法。则无有识者。若无二法可住。则无我可识亦无我所可识也。德藏曰有所得相者。情存有得不存无得。取捨為二。又解。以能得对所得也。若无所得则无取捨。若解性空空则情无所存。无有取捨為别也月上曰闇与明者。月晦為闇。月光曰明。无闇无明则无為二者。若观明闇体空故无其二。如入灭受想定。举证喻无明闇可得也。宝印手曰。乐涅槃不乐世间者。乐厌相对。不乐涅槃不厌世间则无有二者。若不见涅槃可乐世间可厌。则无乐厌之心。所以无乐厌者何。若有生死之缚。则有涅槃之解。空理之中本来无生死之缚。其谁求涅槃解脱。无缚无解会于不二也。珠顶王曰正道邪道者。据理為正。背理為邪。住正道者则不分别是邪是正者。若然真空正道则无邪正之别也。乐实曰实不实者。第一义諦绝于虚假。称之為实。世諦但名但字。缘用非真。名為不尽实。此虚实相对。实见者尚不见实何况非实者。法相理中尚无第一义諦实之可见。何况世諦非实而可得见也。所以者何以下释上义。先释实见义所以名為实见者。何今云非肉眼见所见。惠眼乃能见故云实也。而此惠眼无见无不见者。所以尚无实之可见。何况非实者何释云。无见无实之可见亦无非实不可见。故云无见无不见。又一解。而此惠眼无见无不见者。虽曰不见而无不见。此是惠眼之体也</p><p>如是诸菩萨各各说已下。第二段明文殊以言遣诸人之言也</p><p>于是文殊问维摩已下。第三段明净名以无言遣文殊之言。文殊叹言善哉者。叹于净名无言会理。上身子默然而被呵詰。今净名无言。何故致叹。但身子不能即言以会空理故在空妨言。所以被呵詰。而净名解言说体空即是无言。虽复默然。不妨言说称理之解。所以致叹。宜以默然遣文殊之言事须默然</p><p>第三大段说是不二法门已下明说法有益。是故五千菩萨会于不二之理得无生法忍也</p><p>香积佛品</p><p>此品因空室而生第五事。正以室中无物故身子生须食之念。净名遣化菩萨请饭香积。于此娑婆广明利益。得饭之来出自彼佛。故云香积佛品也。大意。由空室而来何。意在不二法门品。后明上不二法门。辨明真諦之体。言语道断心行处灭时。情莫知所寄。事须明有因食以入道引级物情也</p><p>就此品中开為九大段。第一从初说当于何食。明身子生念。即為取饭之端也。第二从维摩诸知其意已下讫当令汝得未曾有食。明净名讥<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗结业生身不能无待即县许其所须。第三维摩詰即入<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>讫此诸大眾莫不目见。明将欲取饭先现上方世界。示取饭之端。使此时眾生于钦待之心。第四从时维摩詰问眾菩萨谁能致彼佛已饭下讫亦如眾香国土诸树之香。正明净名取饭于此娑婆广明利益。第五从尔时维摩问眾香菩萨香积如来以何说法以下讫故以一切苦切之言乃可入律。明二国交利。第六从彼诸菩萨闻说是已皆曰未曾有也讫以无量大悲生是佛土。明彼菩萨讚释迦如来并叹此方菩萨。第七从维摩詰言此土菩萨于诸眾生大悲坚固已下讫常以四摄成就眾生是為十。明净名述成其所叹。第八彼菩萨成就几法以下讫恒以一心求诸功德是為八。明香积菩萨為此小行之流请净等之行。第九维摩文殊于大眾中已下明说法利益发心也</p><p>第一段舍利弗心念此诸菩萨当于何食。明声闻非不须食。但食自道则难道他则易。故云菩萨</p><p>时维摩詰已下第二大段。维摩知其意者。知其非直為菩萨亦自為己须食之意。就中开為二句。第一句讥其结业生身不能无待。佛说八解。仁者受行。岂杂欲食而闻法乎者。佛说八解脱。仁者受行斯法。正应游心八解以法食為先。岂得杂须欲食之意而闻<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>乎。又解。揣食有色香味触。是即五欲杂秽之食也。又解。讥身子為法来不食為来。八解本能除患即是法食。今听法除患。亦是病之良药。今存食不為法。似若昔八解不除患。今法亦非良药。故执今昔以呵之</p><p>第二句当令汝等未曾有食已下。即玄许其所须。非常之食。此食凡有三义。一者食之能使身适神悦。二者香味异常。三者食之令人悟道。不准常类故名未曾有也。又解。虽然昔八解。今法但除因累。身子报身果累未亡。犹须食以疗之。故悬许其所须</p><p>维摩詰即入三昧已下第三大段。何故先现上方世界者。持欲取饭。先现彼国令此时眾生钦待之心</p><p>时维摩詰问眾菩萨已下第四大段。正明取饭于此娑婆广明利益。就中开為五子段。第一从时维摩詰问已下讫如佛所言勿轻勿学。明[絳-糸+车][序-予+万]新学进于始行。咸皆默然者。欲使净名发言自取故默然也。仁此大眾无乃可耻者。此[絳-糸+车][序-予+万]新学仁此大眾之中无能致彼佛饭乃是可耻之事。文殊师利曰如佛所言勿轻未学者。进于始行。学则便得。故不可轻也。又解。上以文殊威神力故皆默然者。设饭之来事在主人故默然也。今言勿轻未学者。未学犹尚难轻。而况此坐皆是久习高行之人。非是不能。但设饭之来事在主人。理不关客。所以默然也。第二子段。于是维摩不起于坐已下讫亦使如来名声普闻。正明遣化取饭。第三子段。时化菩萨即于会前已下讫佛為欲化乐小法者不尽现其清<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>耳。明化传净名之意上方取饭也。令彼乐小法者得弘大道者。明外凡夫之人未上性地容得弃小向大故言得弘大道。亦使如来名声普闻者。自此以前未闻香积之名。因此广彰故言普闻也。彼诸大士见化菩萨已下。明香积菩萨见化人即发三发问问于彼佛。第一问言。今此上人从何来也。第二问。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>為在何许。第三问。云何名為乐小法者佛告之曰下方已下讫释迦牟尼今现在。答其第二问娑婆之处也。于五浊恶世為乐小法眾生敷演道教。答第三问乐小法者。彼有菩萨名维摩结已下讫增益功德。答上第一问问其来处。净名遣化来因答第一问。复生两问。第一问。其人何如乃作是化。问人大小许人乃作是化也。德力<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>神足若斯。第二问德量多少有此神力。佛言甚大者。答其初门。是為大人一切十方皆遣化往。答其后门器量甚丰<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>充备。于是香积如来已下明香积佛与饭已而试约之。摄汝身香已下试约有三敕。身有二心有一。摄汝身香无令彼诸眾生起惑著心者敕。身香有二种。<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>两殊。报香起著应香增道。今云摄者摄其报香也。又当捨汝本形勿使彼国求菩萨者而自鄙耻敕身。上方大士形则在妙。下方菩萨身则劣小。故宜诫约。息于始行自鄙之心。又汝于彼莫怀轻贱而作碍想已下敕心。若心生碍。受道则难。是故有此言耶。第四子段。时化菩萨既受惴挂严缕???钐煳糯讼闫?嘟岳慈胛?υ懮帷C饕蚯胂惴垢?卸衫础N糯讼闫?硪饪烊惶疚丛?姓摺C钕愠淝?硇脑檬使试晃丛?幸病5谖遄佣巍J蔽?υ懹锷崂?サ瓤墒骋严缕?嗳缰钍髦?恪C飨惴勾送劣欣?嬉病N抟韵抟馐持?共幌?摺C魅缋创饶畈陨?视兴狗埂1?奈耷钜喾刮蘧∪裟芴逯?拼蟊?馊糇骶窒扌牟怀拼蟊?虿幌?病S纸狻J炒朔拐哂Ψ⒋笮哪芙ù笠当ǘ饕遄恪C麨橄?病6?酥?瞬荒芊⑿奈薇ǘ髦?濉9恃圆幌?S幸焐?拍畲朔股僬摺O啻?庋浴6?酥?饲榧染窒烙衅湎扌摹2煌?笫课换趁植?9噬?乓煊谄腥?9恃杂忠焐?拧S忠唤狻I?派?谝炷罟拭??乓煊谄腥?病K暮S袨橛邢喙室丝山摺4朔勾蟊??????场J枪饰蘧∫</p></div>"
}]