[{
    "title": "维摩经抄 第2773部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>维摩经抄</p><p>维摩经卷第壹佛国品第壹</p><p>夫<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>大纲须识宗趣□□□□具陈。且总為二宗。大乘小乘。且大乘之中分為三。壹<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>宗。经论之中广立法无边无量。<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>.十二处.十八界.<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>.<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>等□□八万四千门。即<a href=\"/fojing/jieshenmijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">解深密经</a>瑜伽论等多<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>相。但经论之中说诸相差别名数皆此宗摄。二破相宗。即诸部<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经中十二门论等说壹切法性相俱空有无双遣。三法性宗。即花严<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>维摩楞伽等经起信论等说壹切法非空非有。亦有亦空。所谓迷真起妄壹切皆有。摄妄归真壹切皆空。就俗諦则有。就真諦则空睡梦则有<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。即空诸法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。即空<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>不亡还有。空不离有有即是空。有不离空即空是有。如是广说空有无边。所以诸佛菩萨慈悲故入有。<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>故观空。观空故虽入有而不染。慈悲故虽证空而不著。凡夫多著有。二乘多著空。双离此二真大乘也。第二小乘有二十部宗趣不同。□□□故略之也。今此维摩经即当第三法性宗所摄。由此经芥子纳须弥方丈容世界。皆表法性<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍之义也。若能悟入此第三宗则于佛法无所滞等论。诸佛说有有不妨空。诸佛说有有不妨空。诸佛说空空不妨有故中论偈云。不生亦不灭。不常亦不断。不壹亦不异。不来亦不去。能说是<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。善灭诸戏论。我稽首<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>。诸说中第壹</p><p>自此已下别就此经曲明宗意。古来贤圣皆断此经。以不思议<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>為宗。只缘前说法性无碍。非空非有亦有亦空。不常不断等故名為不可思议解脱。非凡小等之所测量。心言路绝名不思议。不滞空有等。名為解脱。然此经上下总有五种不可思议摄之略尽。何等為五。壹理不思议。二行不思议。三报不思议。四用不思议。五教不思议。第壹理不思议者。即非空非有不常不断等真<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>性中道之理经云。壹切法皆如也。乃至<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>亦如也。不来相而来。不见相而见等。皆是理不思议。第二行不思议者。即说菩萨无住之行经云。在于<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>不為□行。住于涅槃不永灭度。是菩萨行非凡夫行非贤圣行。菩萨行非净行非垢行。是菩萨行等皆是行不思议。第三报不思议即下经说<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a><a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>十方<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>等。是报不思议。第四用不思议者。下经说<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>变化合盖现土常擎大眾取饭香积借座须弥等。皆用不思议。第五教不思议者。即名句文字巧妙言词善能詮显不思议理。是故经云。壹四句偈所有功德无量无边。是名教不思议。此之五种不思议前后次第者。壹切诸法理為其本。是故第壹理不思议欲悟其理必资起行。是故第二行不思议行不空备必能感报。是故第三报不思议报不徒然必能起用。是故第四用不思议用不空设必能起教。是故第五教不思议略说如是。餘在经文经曰如是述曰。壹切经首皆有此之二字。盖有深意。此之二字亦乃包括壹切佛法议理皆尽。略作三释。第壹云。三世诸佛所说不异。名之為如。称理无非故称為是。第二释云。诸法实相古今不易。名之為如。如而说故称為是。第三释云。何难所传与佛无异故名為如。离诸过失故称為是经曰佛述曰。佛者<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>汉翻為觉。觉有二种。壹本觉。二始觉。即法身佛真如法性以為其体。本性清净如摩尼珠。壹切眾生悉皆平等。只缘眾生无始已来从真起妄。沿流昧源。逐末失本。垢障蒙覆<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。真佛遂作凡夫。多受苦恼。壹念觉时垢妄斯遣。本性湛然。即名為佛。更无所得。是故经言。乃至无□□法可得。是法平等无有高下。是名阿耨多罗三藐三<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。此经亦云。若弥勒得菩提。壹切眾生皆亦应得。所以者何。壹切眾生亦当灭度。所以者何。诸佛知壹切眾生。毕竟寂灭不复更灭。乃至云寂灭。是菩提灭诸相故。花严等经说云。佛及眾生心如是三种法不即亦不离。不壹亦不二。眾生不离佛。佛不离眾生。如是等文名本觉佛。断<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>障得。二始觉佛者。即卢舍那报身如来以四智為体。剋性而论智為佛体。智為能证觉之体故相从而论。即功德相好无漏五蕴总名為佛。广在经论所明壹切菩萨经三大劫十地满足。断所知障名始觉佛</p><p>经曰。眾人不请友而安之述曰。小乘凡夫悲薄智微。要待勤请方為说法。菩萨不然。观见眾生缘合根熟。為不请之友能令眾生出生死之危险。与涅槃之安隐。如有影均于湛水。慈母赴于婴儿经曰。逮无所得不起法忍述曰。此明菩萨证无生法忍。逮者及也至也。起者生也。忍者忍了亦即许之义。此明菩萨位。登八地至无所得无生之位忍了。印证壹切诸法本来如如无生无灭无法可得。是故作忍辱仙节节支解其心不动。亦作摩纳仙人燃灯授记皆此位也经曰。深入缘起断诸邪见。有无二边无复餘习述曰。佛法大宗因缘。是本异诸外道拨无因果邪僻断见故有此文。言缘起者。即十二因缘及十因六因四缘。壹切因缘莫过此门。若入佛法因缘深理即名<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。故云断诸邪见。言有无二边者。因缘无主则非有。业果不亡则非无定执有无皆名边见。故下文云。无我无造无。受者。<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>之业亦不亡。经之断字该于邪见及有二边。是则离有无之二边契。非有非无之中道菩萨之正见也。净尽不残。故云无复餘习。习者习气经曰。善知眾生往来所趣及心所行述曰。往者过去。来者未来及所心行现在。菩萨以<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智知眾生过去之事。善知生也。以死生智知眾生未来之事。善智来也。以他心智知眾生现在心所行也。缘处故云心所。趣者趣向。所谓知三世之事趣向也经曰。诸有所作亦不唐捐述曰。唐者虚也捐者弃也。菩萨用心无壹念弃也经曰。佛之威神令诸宝盖合成。壹盖遍覆三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>述曰。此合多為壹。展小為大也。且合多為壹者。合五百為壹盖也。此来真如法性圆融融无定无有二相故。能合多為壹展小為大。多不定多。菩萨观乎。壹盖壹不定壹。凡小观乎。五百虽合為壹五百宛然。五百宛然只自為壹。其犹方丈之室文殊等入中宽如容十方世界。凡小不及。只自见乎。方丈对凡小而不减。对文殊而不增。圆融法性其在慈乎。下诸文理皆同此。展小為大义亦准之。又可更表空有二门。多表其有。壹表其空。空不定空。展壹為多。有不定有。合多為壹。有不离空。即五百而见壹。有不离空即五百而见壹。空不离有不离壹而见多。维摩要旨始终如是经曰。能善分别诸法相。于第壹义而不动述曰。八万四千名诸法相。二空真如名第壹义。此之二句有其三门。壹空有门。二寂用门。三自他门。第壹门者分别法相有也。第壹不动空也。说而不动。有不妨空。不动而说空。不动妨有。异于凡小空而不有。有而不空。第二门者分别法相用也。第壹义不动寂也。寂而常用。虽不动而说。法用而常寂。虽说法而不动。凡夫则动而不寂。小乘则寂而不动。第三门者自利故证而不动。利他故说而不著。说而不有亦不无。意亦同此。离有无二边行于中道经曰。始在佛树力降魔得<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>灭觉道成述曰。言佛树者亦名菩提树。佛此树下得菩提果。名菩提树。树下<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>名為佛树。言降魔者伏四魔也。菩提<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>沷润身心永除热恼。名為甘露。生死大息名之為灭觉。即是佛名為成也经曰。以<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>意无受行。而悉摧伏诸外道述曰。积集故名心。思量故名意。领纳故名受。造作故名行。证佛果时如如不动。此等皆息故名无也。以斯妙理伏诸外道。岂云览力而降伏乎经曰。毁誉不动如须弥述曰。叹佛平等八风不动如须弥山。言八风者。壹利。二襄。三毁。四誉。五称。六识。七苦。八乐。此之八法摇动人心。如世八风吹动诸物。经中举二摄餘六也</p><p>经曰。孰闻人宝不敬承述曰。佛為人中之宝。希有难见。故喻之宝。孰是谁也。谁闻人宝之名而不敬重修承经曰。各见<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>在其前述曰。此叹佛身功德不共凡小。法身圆应犹壹月昇天故云各见佛身平等。不背眾生故云在其前也。壹音说法眾生各解理亦同此经曰。不著世闻如莲华□常善入于空寂行述曰。此叹如来即染成净。此以下句释上句。常观诸法空而且寂游<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。而不染处淤泥而恒净经曰。达诸法相无罣碍。稽首如空无所依述曰。真俗俱空故云无得。万物依<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>。虚空无所依。诸法依实相。实性无所依经曰。眾生之类是菩萨佛土述曰。眾生是佛土之缘。缘中说土故以眾生而為佛土。道理如何。土本由悲。悲由生起。要有眾生悲心始起。要因悲心方得净土。推末就本。眾生是土不亦宜乎。又因生起悲得净土。壹向观空终不得土。故下喻云。要于空地造立宫室。随意无碍。若于虚空终不能成人喻菩萨空。喻二空地。喻于有造立宫室。喻于修净土。是则依空依地宫室始成。兼有兼空方修净土。有悲故涉有而广度眾生。有智故观空而不著。诸有空有不滞悲智双行契。此通途净土。斯得乃至直心。是净土等其理皆然。离空离有即是直心。著有著空皆成偏曲。乃至下文云。随其心净则佛土净。皆同此义。则知壹念直心十方顿净。剎那偏曲垢秽斯兴净土。壹章大纲如是经曰。于是佛以足指按地即时三千大千世界。若干百千珍宝严饰。譬如宝<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>佛。无量功德宝庄严土述曰。此明净秽二土非壹非二。非即非离心净故即秽见净。心垢故即净见秽。剋实而论以佛眼观佛土常净。凡夫眼见佛土恒秽。今欲变秽成净。託以按地為缘。亦明妄从真生秽从净起。故下经云。从无住本立壹切法。问曰。净秽两土為当同体异见。為当别体异见。為当无体妄见。有古德安法师释曰净秽二土壹质不成。异质不成。无质不成。故净秽亏盈。异质不成故披源即冥。无质不成故缘起不形经曰。譬如诸天共宝器食随其福德饭色有异述曰。饭体是壹。诸天福德厚薄不同。所见饭色胜劣不等。佛土亦尔。净秽是壹。随诸眾生垢净不同。所见各异。世尊常说。水体是壹。诸天福德见為琉璃宝物。人福次胜见其清水湛可受用。鱼龙等次劣见是舍屋窟宅。饿鬼恶业唯见脓血猛火</p><p>方便品第二</p><p>经曰。诸仁者如此身明智者所不怙此上皆三字為句。怙者恃怙。此身廉人明智之人不恃怙也。又方便壹品维摩<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>多欲<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>凡夫眾生新学菩萨。五种观门。壹观身是苦。二观身空。<a href=\"/remen/sanguan.html\" class=\"keylink\" target=\"_blank\">三观</a>身<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。四观身无我。五观身不净经曰。為病為恼眾苦所集苦观也。是身如聚沫已下空观也。是身如浮云已下无常观也。是身无主為如地已下无我观也。是身不净秽恶充满已下不净观也。此之五观大小二乘初修之门。止贪嗔发智慧也</p><p><a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>品第三</p><p>经曰。夫宴坐者。不于<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>现身意相。是為宴坐述曰。此净名居士以大呵小也。小乘见定散之二相。所以捨散而取定。既有定可取著相分别还成非定。或闲林净处结跏趺坐。闭目合口<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>不行出入息断。此是小乘禪定之相。大乘菩萨则不如是。定散俱泯。出入双如真心湛然。是為真定。岂可以闭目合口兀坐林中而為定邪。不妨散走三界以利生散不妨定凝。壹如而不动是故经云。不起灭定而现诸威仪经曰。不断烦恼而入涅槃述曰。小乘著相不了烦恼性空。所以有烦恼可断。不了涅槃性空。有涅槃可入。有断可断虽而不断。有入可入而不入。大乘菩萨了烦恼性空。无断可断悟涅槃<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。无入可入。无断可断乃為真断。无入可入始為真入。若能如是名為宴坐。宴坐定也经曰。法无有人前后际断故述曰。际者畔也。前际者前念也。后际者后念也。有為之法前念后念相续不断。名之為人。以理推之前后两念不相趁。及前念已灭后念方生中间断绝无有。真实故曰无人经曰。法同法性入诸法故述曰。言法性者即真如也。法之实性莫过真如。心悟真如即是入壹切法也经曰。法住实际诸边不动故述曰。言实际者即前真如法性。此之法性乃是诸法真实之边际更无过。此名為际也。言诸边者。即生往异灭四相名边。此之实际湛然<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>不為四相之所摇动故云诸边不动也经曰。法顺空随无相应无作述曰。此上三句皆三字為句也。随者随逐。应字去声呼之。所谓应会也。壹切诸法毕竟门中顺于空寂随逐无相应于无作。不生不灭如如理也。经曰。為坏和合相故应取揣食述曰。夫壹切食总有四种。壹段食。二思食。三触食。四识食。此言揣食即段食也。有其形段可揣聚也。此食最麤。以香味触三事為体。鼻取食中之香。舌取食中之味。身取食中之触。壹切眾生于此三事和合揣食。心生贪著不得解脱。今教观此因缘和合假名為食。因缘性空不起贪著為解脱之初缘。以下因缘文经為不受故应受彼食意亦同。此為疗身病而受段食。非贪著之受名為不受经曰。知诸法如幻相无自性无他性。本自不然。今则无灭述曰。此言诸法者即有為法也。从缘而有。无其实性似有非真如。幻相也。从缘生故无自性也。因缘亦空无他性也。如是空故本无有生。故云不然。既无有生从何有灭经曰。无大福无小福。不為益不為损述曰。凡小著相施。持戒得大福施。<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>得小福施。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>得大福施。凡夫得小福乃至广说得大福则益。得小福则损。大乘无相则不如是。二福双泯三事体空。无大福故不為益。无小福故不為损。经曰。非有烦恼非离烦恼述曰。烦恼性空故云非有繫缚。难解故云非离经曰。于食等者诸法亦等。诸法等者于食亦等述曰。小乘凡夫食外见法法外见食。有麤细不同。法有胜劣差别。故云非等。大乘妙理法食皆如。以皆如故食等。于法法等。于食法食尚等。何有贫富而取捨乎经曰。不断淫怒痴亦不与俱述曰。烦恼本空故云不断。心性本净故不与俱。亦可烦恼既空与何俱也经曰。不灭痴爱起于明脱述曰。痴爱空寂。无痴可灭了。此空寂惠眼即明而得解脱。亦可示行痴爱故云不灭处之不染犹如咒药。何须灭耶。如悉达太子示行五欲纳妃生子。菩提树下成道。前虽云未灭已是佛身犹来明脱经曰。以五逆相而得解脱述曰。外相行逆而内心清清本来解脱。如提婆达多即其事也。亦可达五逆相灭而得解脱。如阿闍世王闻法悟道。五逆罪灭而得解脱经曰。不见佛不闻法述曰。法身真佛无形无相故云不见。真如理法言语道断故云不闻。亦云可相佛。法因缘所成。因缘性空。见无所见。闻无所闻了。此法门然可取食经曰。彼外道六师富兰那等是汝之师。彼师所堕汝亦堕。乃可取食述曰。有相门中佛法是正。外道是邪。凡夫二乘捨邪求正。二相分别未亡而还堕耶。未契真空不应取食。大乘真门离于分别。分别既离邪正。壹如故无邪可捨。无正可归契。此通途乃可取食经曰。同于烦恼离清净法述曰。示同凡夫同于烦恼。示入<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>离清净法。亦可真妄壹体同于烦恼。垢净壹如离清净法经曰。其施汝者不名<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>汝者堕三恶道述曰。有施可施。不了施空。虽施非福。有供可供。不了供空。妄想既兴不出生死轮迴。未休终堕三恶。若能证悟罪福俱空则无福无堕经曰。于壹切眾生而起怨心述曰。憎爱空也。谤诸<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>毁于法不入眾数。讚毁空也。上来多约无相之理释。此壹章若就有相门释即是诸句之中皆翻显即是经曰。如来所作化人。若以是事詰。寧有惧不述曰。言化人者幻化人也。此谓净名语须菩提。如来之身无形无相。无言无说。从真起化方便度生。我今与汝亦复如是。犹如幻化。更相詰问。有何所惧不取阋?9蚀尉?啤R记兄罘ㄈ缁没?唷H杲癫挥τ兴?逡簿?弧1俗晕薮?鹕酥?彩鲈弧N薏≈?砟??拼讨??状笥兄?逦鹪湫〕酥???弧N夜坌〕酥腔畚⑶秤倘缑と恕2荒芊直鹨记斜娚?罡??凼鲈弧B藓罕僦?〕思??I僦と丝瘴粗し?铡I僦ふ嬷B未了俗諦。故有罗汉不识赤盐白鸽。迷于<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>法门故喻盲人。又<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>说。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗前后各观八万。不知鸽之近远。又错為金师之子浣衣之。子观行法门故云不了诸根利钝经曰。迦旃延诸法毕竟不生不灭。是无常义。五受阴洞无所起。是苦义。诸法究竟无所有。是空义。于我无我而不二。是无我义。法本不然。今则无灭。是寂灭义述曰。小乘凡夫于此无常苦空无我寂灭五法之体执為实有。今维摩詰令其破有归空。此中经文隐而难解。且无常等五是妄也。只缘妄故。所以无常苦等第五寂灭即是小乘涅槃。犹如化城。权时施设故亦是妄。真如法界是其真也。此真法界体非无常非苦非空非无我非今寂灭。如如湛然不增不减。无常等五本从真起。犹如波浪从水而生。愚痴之流见波浪而不见水。凡小之辈见无常等不见真如。既不知水為波浪之实体。焉能悟真如為无常等之实义。则知述真逐妄壹切皆有摄妄归真。万法俱空。逐妄则无常受苦归真。乃苦等皆如法花穷子捨父母则漂流苦恼。涅槃贫女迷伏藏则抂受贫穷。皆同此意。真如法界不生不灭。与无常等為所依之事。实义故云不生不灭。是无常义。餘苦等四门义准此释。悟此壹门诸经通身经曰当直除灭勿扰其心述曰。夫罪者是有相之法。从妄而生。壹念悟空万罪皆灭。故云真也。岂同凡小对师偏但说诸委曲。此则以相憎相。适足喧扰真心。何能罪灭经曰。如优波离以心相得解脱时寧有垢不述曰。清净心相证解脱时如如不动。何更见于心外之垢不也经曰。我即如法為说<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>功德之利述曰。小乘出家剃髮染衣。现世安乐名闻利养。当得生天快乐<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。故云功德之利经曰。无常利无功德是為出家述曰。现世安乐当来快乐终非究竟。有為生灭。真出家者去妄想悟无為。不见现世及与当来。如如之心真出家也。又寻经文解了法性。<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>眾生。无我无人。无道无俗。真出家也经曰。我言。世尊身小有疾。当用牛乳。故来至此述曰。准小乘宗。如来色身实有生灭。实有病苦。故求牛乳以疗热也经曰。维摩詰言。止止阿难。莫作是语。如来身者金刚之体。当有何疾。乃至云莫使异人闻此麤言。大威德诸天他方菩萨得闻斯语。勿令我等受斯耻也述曰。疾苦已尽方得成佛。何有邪疾外道名异。<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>也。色<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>名大威德天。如来身上发病苦之语。岂非麤也。外道执常诸天无病。佛过人天最尊最尊胜。今有言病岂非耻耶经曰。时我世尊实怀惭耻。得无近佛而谬听耶述曰。阿难闻净名呵责之时故言时。我亲為侍者故云近。佛有病之言异。于净名之责心生疑怪故云谬听经曰。如是五百大弟子各各向佛说其因缘。皆曰不任诣彼问疾述曰。准此经文。五百弟子皆被呵责。经文具载卷偈。极多结集之家。略述十人。西方梵文应有广本</p><p>菩萨品第四</p><p>经曰。為以何生得受记乎。过去耶未来耶现在耶。过去已灭未来未至。现在无住。云何受记述曰。准大小二乘宗三世有為各有壹念。时之极促莫过壹念。无前故夫论受记须歷多时说授记方了。此之三念已灭未至。无有停住。授记之事如何得成经曰。无生即是正位。于正位中亦无受记等述曰。言正位者即是<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>之正位。此中意者已登正位何劳受记。又念正位之中如如不动言语道断。心行处灭何得。更有有為言说领纳记耶</p><p>经曰。壹切眾生皆如也。壹切法亦如也。眾贤圣亦如也。至于弥勒亦如也述曰。眾生如也。无凡夫诸法如也。无授记圣贤亦如也。无圣人弥勒如也。无得记经曰。若弥勒得受记者。壹切眾生亦应受记。所以者何。不二不异述曰。凡圣同如故云不实。凡圣壹相故云不二。弥勒如彼故而得受记。眾生亦如云何不得。故云亦应受记经曰。障是菩提障诸愿故述曰。障是障碍。云何菩提。此中意者有為法中有愿有求菩提。无為如如不动。岂非障彼分别愿耶经曰直心是道场无虚假故述曰。有相道场有其处所实有来去。无相道场本无处所何有去来。今净名居士于无来去中假名来去故。若彼言从道场来真如平等目之為场。得道之处名曰道场。犹如世闻穀麦场等。于此真如迷即名去悟即是来去。其糠秕至真如实名之為场。除却虚假留其真心。真心即是道场。道即是场故曰道场。已下诸句意皆同此经曰。菩萨若应诸波罗蜜教化眾生。诸有所作举足下足。当知皆从道场来诣于佛法矣述曰。此言应者去声呼之所谓应会也。波罗蜜者<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>也。教化眾生皆与彼岸相应会也。凡小教化皆与生死相应不到彼岸。以著相故出定為举足入定為下足。亦可言说為举足入证。為下足不离真如。皆从道场也经曰。善来憍尸迦。虽福应有。不当自咨。当观五欲无常于身命财而修坚法述曰。憍尸迦帝释名也。前生修福感得此报。故云虽福应有未出生死。故云不当自咨。当观无常。诸天果报不过三法。壹身。二命。三财。身即<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>端正。命即长时不夭。财即自然丰足。终归破散。须修坚固法经曰。正士。受此万二千天女可备扫洒。持世言。此非我宜。维摩詰言。可以与我。如我当受述曰。小乘著相女人共住坏道生染故云此非我宜。大乘无相长道增净故云如我应受经曰。有法乐可以自娱。不应复乐五欲乐也。天女问曰。何谓法乐。答言。乐常信佛。乐欲听法。供养眾等述曰。夫五欲乐者。奔赴六尘諠烦六识攀缘动作恼乱身心。乐少苦多。如犮嚙骨难成易坏费力伤神。凡夫于中妄生乐想。现世忧恼当来受殃。法乐翻此无為寂然法味怡神实為大乐。已下准此经曰。乐闻深法不畏述曰。菩萨闻深法则乐而忘苦。如法花会中六十小劫不起。于座无有壹人而生疲倦。小乘闻深法而则惊。故五千<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>等退座而起经曰。居士可捨此女。壹切有所施于彼者。是為菩萨述曰。夫论菩萨能捨所有求者皆与不违。眾生何况女耶经曰。冥者皆明。明终不尽述曰。夫灯光明照壹照多壹无增减。法之光明亦复如是。壹人<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>壹人得度。无量眾生而共修持穷未来际。终无有尽平等平等经曰。当為法施之会。何用如是财施会為述曰。最后為字平声呼之。夫施会者有為功德不出生死。有其多少好恶差别。有七曰等长短时节。不断妄想徒费营。為法施会者无形无相教化眾生起四无量慈悲喜捨。<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>圆满断妄入真。超出生死登乎。彼岸如如不动名為法施经曰。谓以菩提起于慈心。此之以者因也。因于菩提而起慈心。得菩提故始能慈悲救度眾生。亦可因菩提故始起慈心。不求菩提不起慈心。不得成佛。互释皆得。已下准此经曰。知壹切法不取不捨。入壹相门起于慧业述曰。真如无相。云何可取。证悟不虚。云何可捨。悟斯理者即壹相门。入得此门慧业即起经曰。住是会者。為大施主。亦為壹切世闻福田述曰。清施无尽普霑法界名大施主。施者受者俱出生死。涅槃极果常乐我净。是真福田经曰。净名受彼瓔珞分作二分。壹分施最下乞人。壹分奉难胜如来述曰。二乘著相。乞人下劣施之福少。如来高胜施之福多。此乃常情分别何足尚耶。净名欲明胜劣平等凡圣壹如故。施乞人等于佛福不二之理。斯其见乎故经云。若施主等心施壹乞人。犹如来福田之相无所分别。等于大悲不求果报。是则名曰具足法施</p><p>经卷第二</p><p>文殊师利菩萨问疾品第五</p><p>经曰。即以神力坐其室内。除去所有及诸侍者。唯置壹床以疾而卧述曰。夫论室者喻乎身也。凡小执相不了身空。欲令悟空。託彼文殊以兴问答。空其室内者双明二空。四大五蕴因缘成身人法俱无。故云空其室内也。除去所有者。别喻法空也。法从缘起<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>变生。因缘性空识心本寂故法空。及诸侍者别喻人空也。因缘无主故人空也。唯置壹床者喻其真空。如如不二故云壹也。人法所依故云床也。故法花云。法空為床座。以疾卧者託疾招问。非实病也。有古德谚法师解云。室者即是净心真心。净名初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>时离诸爱见名室不定。今得圣道除其妄想烦恼。恬明得真心。名空室内。故下经云。毕竟空寂舍也。除去所有者。除去壹切生死道中无明父母等恩爱眷属也。去侍者者去彼空有二见凡时侍也。故下经云。外道乐诸见。菩萨于诸见不动。置壹床者妄法斯尽。唯处无相禪定床也。故下经云。四禪為床座也。以疾而卧者。依此禪定起<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>悲。虽复救生不离空定。悲体常寂故云卧也经曰。不来相而来。不见相而见述曰。壹就有為生灭明无来无去见夫去者。是无常法。无常之法此念中生。此念中灭本无来去。念念相续假名来去见亦如是。二约心解。真心如如实无有来。妄心分别见有来也。三约二諦真諦凝寂故云不来。俗諦随相是以有来。四约真化二身。真身湛然故云不来。<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>应现故云来也。下亦皆准此</p><p>经曰。是疾何所因起。问病因也经曰。从痴有爱则我病生述曰。净名答也。夫论病因有其二种。壹凡夫病。则痴爱為因。二菩萨病。即大悲為本。且凡夫病痴爱因者。即是不了。不了即受。受即染著。染著故入生死。生死故何病而不生。故云则我病生。此言我者虽即净名意道眾生。大悲因者。菩萨悲心不避生死。不避苦恼。假名痴也。随逐眾生不敢捨离。假名爱也。示同凡苦故云病也。苦从悲起故云生也。言其生久如者问近远也。此之如字多。是助词。其犹乘鸟斑如泣涕涟也(亦可如者不定之词意云其生久耶)经曰。诸佛国土亦复皆空述曰。以胜况劣故有亦声。非但小室。是空诸佛国土。亦复皆空问。佛土何空答曰。土有二。壹法性真土。即以真如法性而為其体。无形无相无有方所。二有相假土。即碧池莲金沙宝地等四尘為体。有其形相。有其处所。十方差别真土即法性本空相土。即因缘无主所以是空经曰。以何為空述曰。重问。前空真土湛然相土宛然云何空耶经曰。以空空述曰。答也。上之空字是能观空智。下之空字是所观空境。凡夫小乘未得空智心外境界皆成实有不知外境。从妄心起反于其中而生怖畏。犹如驴畜见水中自影反生惊怖。菩萨大士转识成智智无分别了知心外万境皆空以者用也。则用其能观空智令彼所观境空智空境空。故云空空亦可能所皆空。故曰空空经曰。空何用空述曰。此重问前也。法体自空何须空智观竟始空经曰。以无分别故空述曰。答也。法体虽空妄心分别不。是知空要藉空智断。其分别方始见空。此乃分别即有无分别。即空故者因由之义。因无分别法始空也。已下诸句义相连带。六十二见分别妄有见性本空。故云。于六十二见中求。解脱生死皆从心起。故云。解脱心行中求壹念本心即成解脱经曰。说身无常不说厌离于身述曰。说身此下明慰喻。初发心菩萨凡夫小乘而未了悟无常性空。恒為无常之所迫逼。深生厌畏。速求寂灭不度眾生。菩萨了知无常性空。曰施恒沙身命不足為难。所以出生入死随形<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>广度眾生。不欣寂灭下皆准此经曰。说悔先罪而不说入于过去述曰。罪若有体灭已入于过去罪性本空何物名為过去经曰。又此病起皆由著我述曰。执身有我。我為身主。身既有主。即受病苦。我空准法。法中无主。谁其病故。故云。当起法想伿空其我得人空理果成罗汉法之所是空得法空。空理乃成菩萨。是故经云。此之法想亦是颠倒经曰。我及涅槃此二皆空。但以名字故空述曰。我体本空。假立我名寻名谓有。涅槃性空。言语断故离名字。故假名涅槃引眾生也经曰。唯有空病空病亦空述曰。执有成病。以空破有。定执其空。空亦是病。有空双遣乃真定也经曰。内见外见述曰。境外见心名為内见。心外见境名為外见经曰。菩萨断除客尘烦恼而起大悲述曰。悲上起爱名曰客尘。寄居悲上名之為客尘污真。悲名之曰尘。起于悲心广度眾生。不了眾生<a href=\"/remen/kongjian.html\" class=\"keylink\" target=\"_blank\">空见</a>可度名曰爱见经曰。贪著禪味是菩萨缚述曰。世间八禪轻安适悦。凡夫耽嗜故云禪味经曰。无方便惠缚。有方便惠解述曰。出世真智名之為惠。世间俗智名為方便。有真而无俗。闕方便之门。既无方便。触途罣碍名之為缚。有俗而无真触途染著亦成其缚。真俗相济悲智双融。方无缚矣经曰。身不离病。病不离身。是病是身。非新非故述曰。身从病有故云身不离病。病从身起故云病不离身。异名壹体故云是病。是身无始旧有故曰非新。念念续生故云非故经曰。住于生死不為污行。住于涅槃不永灭度述曰。住生死而不染污。异凡夫。住涅槃而不灭。异二乘。凡夫起污滞生死而不出。二乘住灭灰身智以长眠。菩萨悟之乃成大行经曰。非凡夫行非贤圣行。是菩萨行述曰。凡夫则造罪而自苦。二乘乃自利而弃眾生。故皆非也经曰。虽乐远离而不依身心尽述曰。二乘以灰身灭心二皆永尽方為远离。故皆非也经曰。虽行三界而不坏法性述曰。虽游三界之妄境不失真如之法性经曰。虽行四无量心而不贪著生于梵世述曰。四无量者慈悲喜捨也。為利生故而行之。非求报故而起之。梵世者<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>初禪大梵王之世界。修慈心等得生彼天。<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>六十劫经曰。虽行禪定而不随禪生述曰。息心湛如行无漏之禪定。超出三界不随禪生</p><p>不思议品第六</p><p>经曰。夫求法者非有色受想行识之求(五蕴空也)非有界入之求(十二处十八界空也)非有欲色无色之求(三界空也)不著佛求不著法求不著眾求(<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>空也)无见苦求无断集求无造尽证<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>之求述曰。此造字去声呼之。造犹往也。尽证者涅槃性空。漏尽而证名為尽证。既无处所。何往之耶经曰。舍利弗言居士未曾有也。如是小室乃容受此高广之座。乃至云舍利弗诸佛菩萨有解脱名不可思议。若菩萨住是解脱者。以须弥之高广内芥子中亦无增减。须弥山王本相如故。而四天王等不觉不知。唯应度者乃见须弥入芥子中。是名不可思议解脱法门述曰。此之壹章正明不可思议经云。正宗芥子极小须弥极大。二俱色法。须弥山者。准诸经论。阔狭高下各八万由旬。此中解释自古多门。今宜逐要三二门耳。壹就二諦释之。俗諦妄想见其大小。二相悬殊不相容受。真諦之中圆融壹体。壹体故芥子非小。须弥非大。小非定小。大非定大。是故相容。悟斯理者不可思议。二就法相法性二宗以释。法相宗中大小相别不相容受。法性宗中恒沙万法同壹真如不守自性。犹如大海眾水同味。虚通无碍。大得入小。小亦合大。不可思议。三约空有二门。妙有门中大小不无。真空门中小大非有。互相容受不可思议。空不离有。大小宛然。有不离空。故相容受。亦可。就<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>门更释壹念净心微细。犹如芥子。参罗万像虽复眾多。要从壹心变现而起。离心之外毕竟无法。摄境从心故相纳也。更有古德。约三性等诸门解释。恐烦止。且已下毛容大海水等。数量大意同此经曰。我等何為永绝其根。于此大乘已如败种述曰。此<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>呵责小乘之语也。夫论大乘菩萨不出生死不入涅槃不断烦恼不捨眾生。故入三涂往来三界。大悲之心為大乘根。二乘人等已出生死已证涅槃已断烦恼已捨眾生。悲心已亡。故云根断亦同败种</p><p>观眾生品第七</p><p>经曰。维摩詰言。菩萨云何观于眾生问也述曰。幻师了知幻人无实。菩萨了知眾生如幻。于中不著眾生等相。如第五大者。三世诸佛只说四大。地水火风。无第五大之等。第五实其体。眾生同此。如第六阴(只有五荫无有第六)如第七情(只有第六根无第七也)如第十三入(只有六根六识十二入门无第十三也)如第十九界(只有六根六识六境三六十八更无十九)无色界无色。燋穀无芽。如须陀洹身见述曰。身见等第五初入见道得此初果身。第五永断不行故举此见彰其无也。如阿那含入胎述曰。阿那含者。是第三果已超。欲界更不入胎罗汉出三界烦恼都尽故。更无有贪嗔痴三毒。如得忍菩萨贪恚毁禁述曰。七方便中第六忍位修道至此永断破戒界。如佛烦恼习述曰。习者习气。犹如臭气入衣等中浴浣之时垢秽虽净臭气犹在。眾生身心亦复如是。烦恼恶气熏习身心。二乘圣人虽断烦恼。习气仍在。唯有如来种习俱尽。石女无儿。梦中所见窹色即无。定性二乘灰身灭智壹归寂灭更不受身经曰。行不热慈者。烦恼名热。烧眾生故。慈净无恼故云不热经曰。从无住本立壹切法述曰。无住者即真如也。故知从真起妄。即有颠倒等无量诸法。次第相生相依而住。摄妄归真住。万法依空住。虚空无依。诸法从真起。真如无住处。天女散花二乘不落菩萨落者。二乘之人取相分别不了花空。是以不落。菩萨之人分别已亡不取花相。是以不著。二乘神力去花不能令去者。若不证空。神通何益。此花不如法是以去之者。肇公云。香花著身有破戒之相。非<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>法。是以去之。生法师云。花法散身应堕而不堕者。非花法也。勿谓此花為不如法。花无分别。人者自生分别心耳述曰。花是非情亦无心想又是无记。何有善恶二相分别耶。故知如法不如法自从心起。岂关花事经曰。佛化所生吾如彼生述曰。如来现化虽生不生。虽灭不灭。天女如佛故云彼生经曰。如舍利弗还為凡夫乃成佛述曰。壹证圣果更作凡夫。无有是处。菩提无所得也。证智无取无能得也。有佛可成。无有是处经曰。今诸佛于菩提已得当得。云何不得耶述曰。释迦已得。弥勒当得也。天女答云。此皆世俗文字数故假名得也。真中无得</p><p>佛道品第八</p><p>经曰。菩萨行于非道通达佛道述曰。六波罗蜜等是道。五逆等名非道。菩萨為方便示现于五逆非道反成佛事。故云通达。已下广明非道之相行五无间而无恼恚述曰。凡夫五逆要起嗔心定堕无间受大苦恼。提婆达多等诸大菩萨助佛扬化恐怖眾生。示行破僧杀阿罗汉皆从悲心非因恶心。示入阿鼻如三禪乐至于<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>无诸罪垢(悲愿入中非因恶药)至于畜生无有无明憍慢等过述曰。愚痴憍慢多堕畜生。菩萨示之故无此过。至于饿鬼具足功德(无福功德生饿鬼中菩萨示现不因无福)已下同此经曰遍入诸道而断其因缘述曰。救度眾生随形六道悲愿力故非恶因缘经曰。有身為种述曰。此明佛种。罗什云。有漏<a href=\"/remen/wuyin.html\" class=\"keylink\" target=\"_blank\">五阴</a>积聚名身。由此有身能行诸善。故為佛种。亦可。观身厌患发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>成其佛种。推末就根身為佛种。已下诸句义皆同此经曰。九恼处壹爱我怨家。二憎我善友。三损害自身。各通三世名為九恼经曰。诚如所言。尘劳之畴為如来种述曰。尘劳者烦恼之总名。尘污身心名之為尘。能令眾生生死疲倦名之曰劳。菩萨之人留惑润生不出生死救度眾生。当来作佛故以尘劳而為佛种。二乘之辈怖畏生死断除尘劳。既无烦恼。无物润生。不得长劫在生死中救度眾生行菩萨行。当来作佛。佛种已断。是故经言。我等今者不复堪任发菩提心。乃至云凡夫于佛法有反覆而声闻无也。又云。乃至五无间罪犹能发意生于佛法。而今我等不复能发经曰。智度菩萨母(智波罗蜜生佛身故)方便以為父(方便善巧养菩提故)法喜以為妻(法味充身悦乐心故)慈悲心為女(柔和善顺随人意故)<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>成实男(坚固不虚丈夫性故)弟子眾尘劳随意之所转菩萨以<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>称师。以尘劳而為弟子。尘劳无量故云眾也。菩萨分形六道救度眾生。暂用烦恼润生受报用而不染。故云随意转也布以七净花。浴此无垢人述曰。禪定為水洗身心。故七功德花严净禪池。言七净者。壹戒净。不毁犯故。二心净不染污故。三见净。不邪见故。四疑净。心决定故。五道净。不行邪道故。六知见净。证灭修道故。七涅槃净。生死尽故。无垢所洗受禪定乐故云浴无垢人或之因浴得无垢也象马五通驰(神通迅速故云驰也)迴向為大利(迴施眾生功德多故)四禪為床座(安心处故)除彼不肖人痴冥无智者述曰。肖犹似也子不似父母名為不肖。丹朱不肖不堪绍继。二乘之人不堪继嗣。不似于佛名為不肖</p><p>入<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>品第九</p><p>经曰。垢净不二者。对垢有净。垢性本空。净亦无体。故云不二维摩默然以明不二者。恒沙万法皆同壹如如体。复如故无壹二。言语道断唯证相应。证亦如如。心境无二。空可言说而詮得耶</p><p>经卷第三</p><p>香积佛品第十</p><p>述曰。此曰字音从越也。舍利发语之词经曰。岂杂欲食而闻法乎述曰。四食之中欲界段食名為杂欲。能生贪心发染欲故经曰。十方佛国皆如虚空述曰。无有垢净虚通无碍。故如空也经曰。佛欲化乐小法者不尽现其清净土耳述曰。二乘凡夫名小眾生。秽从净起名之為现处净难化故不现也经曰。无以限意食之使不消也述曰。量其多少名為限意。小不容大名不消也经曰。犹故不赐述曰。赐犹尽也。山东呼尽為赐经曰。香积如来无文字说。但以眾香今诸<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>得入律行述曰。香者五尘之壹数。三姓之中唯无记性。不通善恶。又无詮表。六根之中鼻根取也。香积世界眾生利根不假文字音声言语詮表善恶。但闻香气便能入证即皆获得德藏<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。此之三昧具恒沙功德名為德藏经曰。此土眾生刚强难化。说苦切之言方能发心。是地狱是畜生是饿鬼(三恶道也)是难处(八难处也)是愚<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>处(边地下贱)又此土音声亦五尘之壹数。通其善恶有其詮表成其语业。此土钝根要须语业。言词恳切方能教化。又此土声香增染长罪。净土声香皆為佛事。如水鸟树林皆能说法入闻香律经曰。斯诸菩萨亦能劳谦。无量大悲生是佛土</p><p>述曰。劳者疲劳。谦者谦让。于此土中行菩萨行大须疲劳。忍受诸苦。我慢多故大须谦让。<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>此名忍土。乃至世尊六年苦行成佛已后犹更忍受十种残报。金鏘马麦如餘处说</p><p>菩萨行品第十壹</p><p>经曰。此饭势力至于七日然后乃消述曰。理而言之。此出世解脱之饭消之早晚何有定限。随顺世间且言七日。故次下文云若声闻人未入正位饭即未消得入正位然后乃消等准此经文故无定限。言正位者证果之位也经曰。或有佛土。以<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>明而作佛事(见光触身发心入证)有以菩萨而作佛事(他方净土无声闻眾见菩萨而能入证)有以佛所化人而作佛事(千佛之中有壹佛与眾生无缘便入涅槃留壹化身化眾生也)经曰。是故名為三藐三佛陀初三名正。藐之言遍。后三言知。佛陀言觉多陀阿伽度此云如来。佛陀此云觉者经曰。如菩萨者不尽有為不住无為述曰。简二乘之人厌出生死名尽有為。乐住寂灭名住无為。菩萨不然。生死本空不尽有為。涅槃性空不住无為。亦可处生死而不染不尽。有為证涅槃而不著不住无為。又云。有而非有不尽有。為空而不空不住无為。在诸禪定如地狱想(远离世乐故)于生死中如园观想(怜念眾生不受苦故)见来求者為善师想(利益我故)捨诸所有具壹切智想(境界多故)见毁戒人起救护想(不憎嫌也)诸波罗蜜為父母想(生佛身故)于道品法為眷属想(随逐我身不相离故)生死无数劫意而有勇(不怯退故)闻佛无量德志而不倦(求不足故)具福德故不住无為(拔苦与乐福德满故)具智慧故不住有為(无数不经智慧满故)</p><p>见阿閦佛品第十二</p><p>经曰。如自观身实相观佛亦然述曰。身实相者即真如也。真如无相。佛身亦然前际不来(已灭故)后际不去(不生故)今则不住(无前后故)不观色(有空故)不观色如(空空故)不观色性(无定故)色即是空。空即是色。义与此同。已下准释非四大起(离能造也)六入无积(六根空也因缘积空也聚无实性也)眼耳鼻舌身心已过(超六入也)维摩真身本无生没随形化物不动国来</p><p>维摩经抄</p></div>"
}]