[{
    "title": "药师经疏 第2767部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/yaoshijing/yuanwen.html\" class=\"keylink\" target=\"_blank\">药师经</a>疏</p><p>性三主□□□□□□五问答分别。第一释名。言<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>者。净谓□□□□地谓诸净人所居□故名為净土。或出即净故名净土。然此净□有其二种。一者色净所居宫殿眾妙七宝所严饰故。二<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>净大念慧行以為游路。大心妙观以為所乘。大空<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>无愿<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>為□大门。如是等德不可具说。今此净土具说两法以為净土。第二出体。有其二义。一种数差别。二依种出体。言种数者。如成<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>净土差别有其四种。一法体性土。谓二空理是诸法性法性即土名法性土。二自受用土。谓遍法界七宝妙色及诸功德為受用土。三他用土。谓诸如来為十地上诸菩萨眾所现色等。四变化土。谓诸如来為化地前所变净土。若广分别如成唯识第十。及佛地论第七卷说。言出体者。法性净土法数门中真如為体。三科出体非蕴所摄处界门中法处法界以為<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。唯是<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>所缘境故。或可通六种无為為性。五种无為皆依真如假建立故。自受用土。百法门中六十法以為体性。所谓眼等八种净识相应二十一心所有法。谓五遍行五各别境及善十一十一种色及二十种不相应法。除异生性及不和合无想定天六种无為。然六无為有其二种。一依法性建立六种法性五□。二净<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>所摄六种六种皆是自受用土他受用土及变化土。乃法出体应知亦尔。而差别者自受用土真实功德為体。餘之二土皆是变化。三科出体。若妙色土即用色蕴少色香味触四处四界一分為性。通摄功德為净者。即用<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>及十二处十八界法以為体性。如理应思。第三主眾差别者。如成唯识第十卷说。佛有四种。一自性身。谓诸如来真净法界受用变化平等所依离相寂然。绝诸戏论具无边际真当功德亦名法身。大功德法所依止处故此自性身。依自性土虽此身土体无差别。而属<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>性相异故。此<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>土俱非色拣唯有其主而无眷属。二自受用身。谓诸如来三无数劫。修集无量<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>资粮所起无边真实功德。及极圆净常遍色身相续湛然。尽未来际恒自受用广大法乐。此身还依自受用土。谓圆镜智相应净识。由昔所修自利无漏纯净佛土<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>成就。从初<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>尽未来际相续变為纯净佛土。自受用身常依此土。亦唯有佛无诸徒眾。唯佛自利善所生故。三他受用身。谓诸如来由平等智示现微妙净功德身。居纯净土為住。十地诸菩萨眾现大<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>转<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>轮。决眾疑网。令彼受用大乘法乐他受用土以此為主。十地菩萨以為眷属。四变<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。谓诸如来由成事智变现无量随类化身居净秽土為未登地。诸菩萨眾二乘异生称彼机宜现通<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>。令各获得诸利乐事。此化净土以化身佛以為其主。菩萨二乘及诸异生以為眷属。第四形量大小者。一自性身土。离色相故不可说有形量大小而随相说无量无边故。成唯识第十卷云。虽不可说形量大小而随事相其量无边。譬如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>遍一切处。二自受用身及其净土形量无边。无边善根之所生故。是故经云。圆圆无际其量难测。三他受用身。及其净土。随住十地菩萨所宜变為身土。或大或小。或胜或劣。前后改转。若变化身依变化土。或依秽土。随其根机大小不定。五问答分别。问异生二乘生净土不。若言生者如何摄大乘云。若称佛名生净土者是别时意。又解深密及瑜伽论问。何等人不生净土。答异生二乘若言不生者。如阿弥陀等经说。若一日乃至七日。心不乱者即生净土。解云。此义极难。西国诸师两说不同。一云。异生及二乘不生净土故。摄大乘云。生净土者约别时意。由此<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>有初因缘数数修习。乃至十地方得生彼故。诸经说生净土者。约别时说。又深密说。二乘异生不生净土。又<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>论云。女人及根缺。二乘种不生。一云净土有其四种。法性净土是真如故不可说言。生与不生绝诸相故。自受用土。唯佛与佛乃得生彼。他受用者唯是十地菩萨生处。其变化土异生二乘地前菩萨。皆能往生。而摄大乘及瑜伽论说不生者。约他受用说不说化土。问极乐国土四种土中何土所摄。解云。西方自有两释。一云。他受用身。有分限故。一云。极乐有其二种。一他受用。唯是地上菩萨生处二变化土。即是已生地前菩萨皆得往生</p><p>经。于其国中至正法之藏四明持法有二。菩萨摩訶萨者菩萨如前。释摩訶萨者。翻為大觉士。佛地第二云。菩萨有三大士名摩訶萨。一者数大以无量故。二者德大谓住大乘游大乘等。三者业大谓息眾生诸苦恼故。利乐有情。是菩萨业。由斯三义名摩訶萨。一名日光。二名月光者。宋本云。一名日耀。二名月净。唐本云。一名日光遍照。二名月光遍照。是彼国中尊胜上首。犹如□土慈氏妙吉祥等</p><p>经。是故至彼佛国土五劝物愿生。言<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>者。杂集第一云。于有体有德有能忍可清净希望為体乐。欲所依為业。谓于实有体起忍可行信。于实有德起清净行信。于实有能起希望行信。谓我有力能得能成。云何善男子善女人照明菩萨方便经说能化恶有善上下无怨。无彼无此名善男子。若能慈念养育群生如母养子。贞洁远色无男女相名善女人</p><p>经。尔时至不欲分施第四答闻。经除障文分為五。一治多贪。二治<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>。三治妒忌。四治离隙。五治不定。就初文中文分為六。一他求吝惜。二不济亲因。三乘业受生。四闻名往救。五咸蒙愿遂。六好惠无疲。就初文中文分為二分。一辨贪痴。二辨瞋恚。此则初也。不识<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>者是总多贪无厌者贪是欲于他财惜是吝于己物。四分律说。有一<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。池边习定池龙敬德以身绕之。比丘心恶欲令龙去。方便说偈。从索珠云。光耀摩尼宝瓔珞<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>身。若能施我者是名為善亲。池龙慳惜说偈答云。我爱摩尼宝过汝比丘身。我终不施汝任汝不相亲。佛因此事复说偈云。多贪人所恶数乞朋友乖比丘乞龙珠一去不复迴故知贪惜能捨亲友故。天请问经云。慳贪捨亲友即其义也。又由护惜不行惠施。又由贪故。唯欲他财所生之处。贫穷之少无父无母无妻无子。无善知识无亲友人。又花严论第四卷云。贤圣作是说贪嫉最苦器。见于乞求者其心则恼浊。恼浊剎那中则能作鄙漏愚痴慳不施以种贫穷本。又贪者杂集第一云。谓<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>爱為体。生眾苦為业。不知<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>者不识<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>因。及施<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>者不识行善。因能感善果。愚痴无智者显前不识善恶。以愚痴无智故不识善恶。杂集论云。愚痴即是无明。无明者三界无智為体。杂染生起不依為业。闕于信根者。显前不知布施。及施果报不信者。杂集云。谓愚分于诸善法心不忍信以不清净心不希望為体。<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>所依為业。聚财护惜不欲分施者显前多贪无厌</p><p>经。此等眾生至如割身肉二辩瞋恚设不获已而行施时。谓诸有力强逼令施如割身肉深生痛惜</p><p>经。复有无量至及餘乞人二不济亲姻慳者。杂集云。耽著利养于资生具贪以一分以吝為体。不捨所依為业。不捨者由慳吝故非所用。具亦恒积聚。谓自身不受用。不济亲属及来乞者</p><p>经。此等眾生至<a href=\"/remen/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>三乘业受生问人间命终生饿鬼道者有何相貌。答大威德陀罗尼经第二卷云。其人<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>有十种相。一转舌向上及舐下唇。二身体热恼求欲得水。三论说饮食而但口张。四眼目青色如孔雀顶。五瞳人乾燥。六故粪失尿。七右脚先冷。八口言烧我。九右手作拳。十如是慳贪诸遍患故。不捨施故而取命终生饿鬼道中。问生畜生道有何相貌。答彼经中说有五种相。一于妻子所爱心所牵。二手足指等悉皆卷缩。三腹上行出。四作白羊鸣。五口中沫出。临命终时。此五相现。当知决定生畜生道问造何业故生二趣中。答以慳贪故生饿鬼中。以愚痴故生畜生中问何故不生<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>中。答不起重瞋损恼他故不生地狱中</p><p>经。由昔人间至暂得现前四闻名往救。谓昔在人间曾得暂闻药师<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>。后遇恶友造无施业。虽生恶趣由同佛名种子力故。还得忆念药师如来</p><p>经。即于至人道五咸蒙愿遂由念<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>故便捨恶趣生<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>中问暂念佛名有何胜利乃拔如是鬼畜重殃。答那先比丘经说。如人在世百年為恶。临命终时闻佛名者。如放小石水中即没。若持大石置于船上即浮不没。虽一生作恶。以一时中闻佛名故尚不受苦。况当专念更复受彼饿鬼畜生</p><p>经。得<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>智至况餘财物六好惠无疲。宿命有三。一修得。二报得。三业得。依四根本定发得者名為修得。餘二易了。又智论第五云。本事常忆念日月年岁乃至胎中。及过去世一世乃至百千万亿世。大罗汉辟支知八万大劫。大菩萨及佛知<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>名宿命智通。好行惠施者。大庄严论第二卷说。能好展手施者。此手名严胜。受者能缩手。严胜复遇彼若人言施与。是语价难量。受者言我足难量复遇彼悉能捨者。杂集第一云。依止正杂染无怯虑故。最后<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>心无功用住性。以头施者如报恩经第五卷说。大光明王等。因施者如彼经说。忍辱太子等手足血肉身。分施者如智度论第十二云。月光太子等问。檀有何等利益。乃至头目手足血肉身分皆与求者。答智度论十一云。檀為宝藏。常随逐人。檀為破苦。能与人乐。檀為善御。开示天道。檀為善府。能摄善人。檀為安隐。临命终时心不怖畏。檀為慈分。能济一切檀為大将。能伏慳敌。檀為妙果。天人所爱。檀為净道。贤圣所游。檀為积善。福德之门。檀破贫穷。断三恶道。檀為<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>之初缘。入善人中之要法。称誉讚叹之渊府。入眾无难之功德。心不悔恨之窟宅。善法行道之根本。种种欢乐之林藪。富贵安隐之<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>。得道涅槃之津梁。<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>大士智者之所行。餘人俭德宣识之所效</p><p>经。复次至破于<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>二治破戒文分為八。一常亏清禁。二不愿多闻。三恃己陵他。四缘兹遇难。五殃神长劫。六由昔闻名。七愿遂应时。八勤修胜业。此到初也。谓先于如来法中白四羯磨受别解脱戒名<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>学问。破戒者新翻名尸罗。旧译為清凉。谓身语业有缺有穿名為破戒。破<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>依瑜伽论二十二说。谓威仪路戒所作事。或善品加行处所不成就轨则。不随顺<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>。违越世间。不随顺毘奈耶。违越毘奈耶。云何名為于威仪路不成就轨则。乃至违越毘奈耶。谓所不应行。即如是行為诸世间之所讥毁。亦為贞良善士。谓持律者之所訶责。如行既然。于行住坐卧亦尔。云何名為于所作事不成就轨则。乃至违越毘奈耶。谓于所作若衣服事或盪闶碌戎钏?挥ψ鳌</p><p>经。或受学句至甚深之义二不愿多闻护持禁戒者。谓身口意业无缺漏故如如大庄严论第十卷说。有一比丘次第乞食至穿珠家立于门外。时彼珠师為于国王穿摩尼珠。比丘衣色珠註映彼珠其色红赤。彼穿珠师即入其舍。為比丘取食时有一鹅见珠。赤色其状似肉。即便吞之。珠师持食以施。比丘寻即觅珠不知所在。此珠价贵王之所有。时彼珠师家既贫穷失王贵珠以心急故。语比丘言。归我珠来。尔时比丘作是思惟。令此珠者鹅所吞食。若语彼人将必杀鹅以取其珠。如我今者苦恼时至当设何计得免斯患。即说偈言。我今护他命身分受苦恼。更无餘方便。唯以命代彼。我今捨身命。為此鹅命故缘我护戒因用成解脱道。时穿珠师闻斯偈故语比丘言。还我珠来。若不见还汝徒受苦终不相置。比丘答言。谁得汝珠默然而立。珠师语言。更无餘人。谁偷此珠。恃彼珠师即闭门户语比丘言。汝于今日好自坚持比丘寻即四向顾望无可恃怙。如鹿入围莫知所趣比丘无救亦复如是。尔时比丘即自[僉*殳]身端正衣服。彼人又复语比丘言。汝今将欲与我斗耶。比丘答言。不共汝斗。我自共彼结使。贼斗。所以尔者。恐于朾时身形现故。我等比丘设使困苦临终之时。犹尚以衣用自覆护不露形体。尔时珠师执缚。比丘而加朾棒。问比丘言。珠在何处。还我珠来。比丘答言。我不得珠。时穿珠师即便涕泣<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>比丘而白之言。赐我<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>还与我珠。比丘答言。我实不取。时彼珠师复更瞋打比丘念言。<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>受苦。皆应如是。应当坚辞无犯<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>。若当毁戒受地狱罪。有过今苦即说偈言。我于过去世淫盗捨身命。羊鹿及六畜捨身不可计。為戒捨身命胜于毁禁生假欲自摧护会归终当灭。不如為持戒。為他护身命捨此危脆身以求解脱命。时穿珠师涕泣懊恼而说偈言。我虽打扑汝极大生苦恼畏王青我珠复欲苦治汝今汝捨是苦亦使我离恶。汝是<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>人应断于贪欲宜捨贪爱心。还当与我珠。比丘微笑说偈答云。我著粪扫衣乞食以為业。住止于树下。以此我為足。于汝摩尼珠实无贪利心。以何因缘故乃当作偷贼。时穿珠师语比丘言。何用多语。遂加繫缚倍更挝打。以绳急绞耳眼口鼻尽皆血出。时彼鹅者即来饮血。珠师瞋忿打鹅即死。比丘问言。此鹅死活珠师答言。鹅今死活何足故问。时彼比丘即向鹅所见鹅既死涕泣不乐。即说偈言。我受诸苦恼望便此鹅活。今我命未绝。鹅在我前死。我望护汝命受是极奇苦何意。汝先死我果报不成。时穿珠问比丘言。鹅今于汝竟有何亲愁恼乃尔。比丘答言。不满我即说偈言。菩萨往昔时。愿所以不乐。捨身以贸鸽。我亦作是。意捨命欲代鸽。我得最胜心。欲令此鹅命由汝杀鹅故心愿不满足。珠师问言。汝作是语我犹不解。汝当為我广说所由。尔时比丘说偈答言。我著赤色衣映珠似肉色。此鹅谓是肉。即便吞食之。我受是苦恼。為护彼鹅故。逼切甚苦恼。望彼得令命。时彼珠师闻是偈已即开鹅腹而还得珠。即举声哭语比丘言。汝护鹅命不惜于身。使武造此非法之事。时彼珠师叉手合掌求乞欢喜以偈讚言。南无清净行。南无坚持戒。遭是极苦难不作毁缺行不遇。如是恶持戒非希有。要当值此苦能持戒者难。时穿珠师既懺悔已即送比丘还归。所止不求多闻者。谓于佛所说契经深义不能解了弃而不学</p><p>经。或复多闻至為魔伴党三恃己陵他增上慢者。谓未得谓得未证谓证。依杂集论第一卷说。慢者依止萨迦邪见心高举為体。不敬苦生所依為业。不敬者谓于师长及有德所而生憍傲。苦生者谓生后有故。自是非他者。智度论第一云。自法爱染故。毁訾他人法。虽持戒行人不脱地狱苦。又阿含云。虽复诵禪经口中刀剑出好扬他过恶死地狱疾阐提得成佛。斯人由未出嫌谤正法者。如<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>第二卷说。若人不信毁谤此经则断一切世间佛种。乃至下文告<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗谤斯经者。若说其罪穷劫不尽广说如彼大<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经说。佛告须<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>。若破般若波罗蜜多者。则破十方。诸佛一切智智。一切智智破故佛宝破。佛宝破故法宝破。法宝破故僧宝破。僧宝破故则破世间正见等。法华经云。若于一劫中常怀不<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>作色而骂佛获无量重罪。其有读诵持是法华经者。须臾加恶言其罪复过彼。胜天王经说。若四天下悉為微尘。一尘為一佛。若有恶人皆悉杀害尔许多佛得罪多不可称计。不可思量不。若有人障碍此修多罗毁谤不信其罪重彼。正使三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>一切眾生悉成佛已。如此罪人由故不出阿鼻地狱</p><p>经。此等至当堕地狱四缘兹过难当堕地狱者。俱舍十一云。<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>那落迦。此云不可乐处。然以不可乐处即是其狱。在于地下二万由旬。地狱有三。一热。二寒。三边。热地狱有八。一等活。二黑绳。三眾合。四叫唤。五大叫唤。六烧热。七大烧热。八无间。此八在赡部州下重累而住。前二有主治。次三少主治。后三无主治。此八為本。一一各有十六园。一面有四。一煻煨增。谓此增内煻煨没膝有情游彼绕下足时。皮肉与血俱焦烂坠举足还生平复如本。二尸粪增。谓此增内尸粪泥满于中。多有娘矩吒虫紫利如针。身白头黑有情游彼。皆為此虫钻皮破骨唼食其髓。三锋刃增。谓此增内复有三种。一刀刃路。谓于此中仰有刀刃以為大道。有情游彼纔下足时皮肉与血俱断碎坠举足还生平复如本。二剑叶林。谓此林上纯以銛利剑刃為叶。有情游彼风吹叶坠。斩刺支体骨肉零落。有鸟骤狗攎掣食之。三铁刺林。谓此林上有利铁刺长十六指。有情被逼上下树时其刺銛锋下上纔刺。有铁[此/束]鸟探啄。有情眼精心肝争竞而食。刀刃路等三种虽殊。而铁仗同故。一僧摄四烈河增。谓此增量广满中热咸水有情入中。或浮或没。或逆或顺。或横或转。被压被煮骨肉糜烂。如大鑊中满盛灰汁置麻米等猛火下然麻等。于中上下迴转举体糜烂。有情亦然。设欲逃亡于两岸上。有诸狱卒手执刀枪御桿令迴无由得出此河如堑。前三似园。此是增上被刑害所故说名增。四面合十六通本為十七八十七合有一百三十六。所罪人于中受热恼。苦寒地狱有八。一頞浮陀。由寒苦所逼肉生细胞。二尼刺浮陀。由寒风所吹通身成胞。三阿吒吒。由唇不得动唯舌得动故作此声。四阿波波。由舌不得动。唯唇得动故作声。五喉喉。由唇舌不得动振气故作此声。六优懵蕖4耸乔嗔?ā4嘶?栌扇庀赴端拼嘶??F卟ㄍ纺Α4耸浅嗔?āS扇馍?蟀端拼嘶??0朔尥永?4耸前琢?āS杀斯前端拼嘶??岸?4由硐嗍苊?稳?4由?嗍苊?笕?4哟?嗍苊?S智岸?私小4稳?涣私小:笕?唤小4税嗽谒闹藜渲???降籽鱿蚓又埂W锶擞谥惺芎?晨唷1叩赜?腥?R辉谏郊洹6?谒?洹H?诳跻笆鼙鹨当ê?仍邮</p></div>"
}]