[{
    "title": "观心论 第2833部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>观心论</p><p>是观心可名為了又问。上说真如<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>一切<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>因觉為根。未审无明之心一切诸恶以何為根答曰。无明之心虽有八万四千<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>情欲及恒沙眾恶无量无边。取要言之。皆由三毒以為根本。其三毒者即贪瞋痴也。此三毒心自能具足一切诸恶。犹如大树根虽是一所生枝叶其数无量。彼三毒根中生诸恶业。百千万亿倍过于前不可為喻。如是心于本体中自為三毒。若应现六根亦名六贼。其六贼者则名六识。出入诸根贪著万境。能成恶业损真如体。故名六贼。一切眾生由此三毒及以六贼。惑乱身心沈没<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。轮迴<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>受诸苦恼。又有江河因少泉源捐流不绝。乃能弥漫波涛万里。若复有人断其本源。则眾流皆息。求<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>者除其三毒及以六贼。自能除一切诸苦又问。<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>六趣广大无边。若唯观心云何免彼之苦答曰。三界业报惟心所生。本若<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>则无三界。三界者即是三毒。贪為欲界。瞋為<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>。痴為<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>。由此三心结集诸恶业报成就轮迴不具。故名三界。又由三毒造业轻重受趣不同分归六处。故名六趣又问。云何轻重分之為六答曰。若有眾生不了正因迷心修善。未免三界生三轻趣。云何三轻所為。悉修十善妄求快乐。未免贪界。生于六趣。悉持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>妄起爱憎。未免瞋界。生于人趣。迷执有為信邪求福。未免痴界。生阿修罗。如见三类名為三重。云何三重。所谓纵三毒心唯造恶业。堕三重趣。若贪业重者堕饿鬼趣。瞋业重者堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>趣。痴业重者堕畜生趣。如是三重通前三轻遂成六趣。故知一切善业由自心生。但能摄心离诸邪恶。三界六趣轮迴之业自然消灭。能灭诸苦即名解脱又问。如佛所说。我于三代阿僧祇劫无量勤苦乃<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>道。云何今说唯除三毒即名解脱答曰。佛所说言三大阿僧祇劫者即三毒心也。胡言阿僧祇汉言不可数。此三毒心于一念中皆為一切。恒何沙者不可数也。真如之性既被三毒之所覆障。若不超越彼三恒河沙毒恶之念。云何名得解脱也。今者能除贪瞋痴等三种毒心。是则名為度得三大阿僧祇劫。末世眾生愚痴钝根。不解如来三种阿僧祇祕密之说。遂言成歷劫末期。岂不疑悟行人不退<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>方成佛道。今令学者唯须观心不修戒行。云何成量善。聚会者。以能制三毒即有三量善普会于心故名三聚戒也。波罗蜜者。即是梵言。汉言达<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。以六根清净不染世尘。即出烦恼可至菩提岸也。故名<a href=\"/remen/liuboluomi.html\" class=\"keylink\" target=\"_blank\">六波罗蜜</a>又问。如经所说。<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>者。誓断一切恶。誓修一切善。誓度一切眾生。今言制三毒心。岂不文义有所乖也答曰。佛所说经是真实语。应无谬也。菩萨于过去因中修苦行时。对于三毒誓断一切恶常修戒。对于瞋毒誓修一切善故常<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>。对于痴戒誓度一切眾生故常修惠。由持如是戒定惠等三种净法故。能超彼三毒恶业即成佛也。以制三毒则诸恶消灭。故名之為断。以能持三戒则诸善具足。名之為佛。以修能断则万行成就。自他利己普济群生。故名為度。既知所修戒行不离于心。若自清净故一切功德悉皆清净又云。欲得净佛云当净其心。随其心净则佛土净。若能制得三种毒心。三聚净戒自然成就又云。如经中所说。六波罗蜜者亦名<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。所谓<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>持戒忍辱<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>禪定<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。今言六根清净六波罗蜜若為通会。又六度者其义云何答曰。欲修六度当净六根欲净六根先降六贼。能捨眼贼。离诸色境心无顾吝。名為布施能禁耳贼。于彼声尘勿令纵逸。名為持戒。能除鼻贼。等诸香臭<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>调柔。名為忍辱。能制舌贼不贪邪味。讚咏讲说无疲厌心。名為精进。能降身贼。于诸触欲其心湛然不动。名為禪定。能摄意贼。不顺无明常修觉惠乐诸功德名為智慧。又度者运也。六波罗蜜喻如船筏能运载眾生达于彼岸。故名六度又问。所说释迦如来為菩萨时。曾饮三斗六升乳糜方成佛道。即是先因食乳后证<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。岂唯观心得解脱也答曰。诚如所言无虚妄也。必因餐乳然始成佛。佛言食乳。乳有二种。佛所食者非<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>不净之乳。乃是真如清净法乳。三斗者即是三聚净戒。六升者即是六波罗蜜。成佛道时食如是。法乳方证佛果。若言如来食于世间淫欲和合不净之牛羶腥乳者。岂不成谤法之甚也。如来者自是金刚不坏无漏法身。永离世间一切诸苦。岂须如是不净之乳以充飢渴。所说牛不在高原。不在下湿。不食穀麦糟糠麩豆。不与特牛同群。身作紫磨金色。言此牛者即卢舍那佛也。以大慈大悲怜愍故。于清净体中如是三聚净戒六波罗蜜微妙法乳养一切眾生求解脱者。如是真中清净之乳非真如来饮之成道。一切眾生若食者皆得阿耨多罗三藐三菩提又问。经中所说。佛言。眾生修伽蓝铸形像<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>散花然长明灯。昼夜六时遶塔行道持斋<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。种种功德皆成佛道。若唯观心总摄诸行。如是事应妄也答曰。佛所说无量方便。一切眾生钝根狭劣。甚深所以假有為喻无為。若不内行唯只外求。希望获福。无有是处。言伽蓝者。西国<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。此地翻為清净处地。若永除三毒常净六根。身心湛然内外清净。是名為修伽蓝也。又铸形像者。即是一切眾生求佛道所為修诸觉行昉像如来岂遣铸写金铜之作也。是故求解脱者以身為鑪以法為火智慧為工匠三聚净戒六波罗蜜以為画样。鎔练身心真如佛性。遍入一切<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>模中。如教奉行以无缺漏。自然成就真容之像。所為究竟<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>微妙色身非有為败坏之法。若人求道不解。如是铸写真容凭何輒言成就功德。又烧香者。亦非世间有相之香。乃是无為<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>香也。薰诸秽恶业悉令清灭。其正法香有五种体。一者戒香。所谓诸恶能断能修诸善。二者定香。所谓决信大乘心无退转。三者惠香。所谓常于身心内外观察。四者解脱香。所谓能断一切无明结缚。五者解脱知见香。所谓觉照常通达无明碍。如是五香世间无比。佛在世日令诸子以智慧火烧如是无价香<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>十方一切诸佛。今时眾生愚痴钝根。不解如来真实之义。唯将外火烧于世间沈檀薰陆质碍之香者。希望<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>云何可得。又散花者义亦如是。所谓演说正法说功德花。<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情散霑一切。于真如性普施<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>。此功德花佛所称叹。究竟常住无彫落期。若复有人散如是花获福无量。若如来令诸眾生剪截繒綵。复损草木以為散花。无有是处。所以者何。持净戒者于诸大地参罗万像不令触犯。误触犯者获大罪。况复今故毁禁戒伤损万物求于福报。欲益返损。岂有是乎又问。灯者。觉正心觉也。以智慧明了喻之為灯。是故一切求解脱者常以身為灯臺。心為灯盏。信為灯主。增诸戒行以為添油。智慧明达喻灯火常然。如是真如正觉灯明破一切无明痴暗。能以此法转相开悟。即是一灯然百千灯。以灯续明明终不尽。以无尽故号曰长明。过去有<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>曰然灯。义亦如是。愚痴眾生不会如来方便之说。专行虚妄执著有為。遂然世间苏油之灯以照一室乃称依教。岂不谬乎。所以者何。佛放眉间一毫相光。上照万八千世界。若身光尽照普遍十方。岂假如是世俗之灯以為利益。详察斯理应不然乎。又六时行道者。所為六根之中于一切时常行佛。道者觉也。即是修诸觉行调伏六情。净行长时不捨名六时行道。塔者身也。常令觉惠巡遶身心念念不停。名為遶塔。过去圣僧人如是行道得<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。求解脱者不会斯理。何名行道。窃见今时钝根之辈眾生曾未内行唯执外求。将质碍身遶世间塔。日夜走骤徒自疲劳。而于真性一无利益。迷悟之甚诚可愍歟。又持斋者当须达意。其利徒尔虚功。斋者齐也。所谓斋整身心不令散乱。持者护也。所谓戒行<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>护持必须禁六情制三毒勤觉察净身心。了如是义所名斋也。又持斋者。有五种。一者法喜食。所谓依如来正法<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>奉行。二者禪悦食。所谓内外证寂身心悦乐。三者念食。所谓常念诸<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>口相应。四者愿食。所谓行住坐卧常求善愿。五者解脱食。所谓心常清净不染俗尘。此之净食名為斋食。若后有人不食如是五清净食。外持斋者无有是处。言斯食者。于无明恶业之食若转读者。破斋者云何获福。或有愚迷不会斯理。身心放逸诸恶皆為。贪欲咨情了无惭愧。唯断外食自谓持斋。何异见烂坏死尸称言有命。必死见事。又礼拜者。当如法也。必须理体内明随事推变。理恒不捨。事有行藏。会如是义乃名如法。夫礼者敬也。拜者所為。恭敬真性屈伏无明。為礼拜也。以恭敬故不敢毁伤。以屈伏故无令逸纵。若能恶情永断善念恒存。虽不见相常名礼拜。其事法者即身相也。為欲令诸世俗表谦下心故。须屈伏外心示恭敬相。用之则显。捨之则藏。觉外明内以相应也。若复不行理法唯执事门内则故。纵贪痴常為恶业。外则空现身相。无名礼拜。无惭于圣。纵狂于凡。不免沦坠。岂成功德。既无所得。云何救道又问。温室经。洗浴眾僧获福无量。此则凭何事法功德始成。若唯观心可相应不答曰。眾僧者非说世间有為事。<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>当尔為诸<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>说温室经。欲令<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>洗浴之法。是故假诸世事比喻真宗。说七事者。第一净水。二者然火。三者澡豆。四者杨枝。五者纯灰。六者苏膏。七者内衣。举此七事喻于七法。一切眾生由此七法洗浴庄严能除三毒无明垢秽。其七法者。一為净戒洗荡身心。如清净水洗诸尘垢。二谓智惠观察内外。犹如然火能温其水。三谓分别简弃。由如澡豆能除垢腻。四谓真实断诸<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>。如嚼杨枝能消口气。五谓正信决无疑虑。如灰磨身能避诸风。六谓柔和诸刚强。由如苏膏通润皮肤。七谓惭愧悔诸恶业。由如内衣遮蔽丑形。如上七法并是经中祕密之义。如来当尔為诸大乘利根者。非為小智下劣凡夫。所以令人无能悟解。其温室者。即身是也。所以然智慧火温。净戒汤洗荡身中佛性受持七法以自庄严。当尔<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>聪明利智皆悟圣意。以此<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>功德成就。但登圣果。令时眾生愚痴钝根。莫测其事。将世间水洗质碍身。自谓依经。岂非悟也。且如佛性非是凡形。烦恼尘埃本来<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>。岂可将有碍水洗无為身。事不相应。云何可得。若言碍身清净。当观此身无因贪欲不净所生。臭秽駢闐。内外充满。若洗此身求于清净者。犹如洗堑泥尽应停。以此验之。明知外洗非佛说也又问。经所说言至心<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>必得解脱答曰。夫念佛者。当须<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>為正。不了义即為邪。正念必得<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>净国。邪念云何达彼。佛者觉也。所為觉察心源勿令起恶。念者忆也。谓坚持戒行不忘精懃了如来义。名為正念。故知念在于心不在于言。因筌求鱼。得鱼妄筌。因言求言。得意忘言。既称念佛。云名须行念佛之体。若心无实。口诵空言。徒念虚功。有何成益。且如诵之与念。名义悬殊。在口曰诵。在心曰念。故知念从心起。名為觉行之门。诵在口中。即是音声之相。执相求福终无是乎。故经云。凡所有相皆是虚妄。又云。若以色见我。以音声求我。是人行邪道不能见如来。以此观之。乃知事相非真正也。过去诸佛所修功德皆非外说唯正论。心是眾善之源。是万恶之主。<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>。常乐由自心生。三界轮迴六从心起。心為出世之门户。心是解脱之开津。知门户者岂虑难成识。开津者何忧不达。窃见今时浅识唯事见相為功。广费财宝多积水陆。妄营像塔虚役人夫。积木叠泥图丹画绿。倾心尽力于己迷他。未解惭愧。何曾<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>见有勤勤执著说于无相兀兀如迷。但贪目下之小慈不觉当来入大苦。此之修学徒自疲劳。背正归邪诈言获福。但能摄心内照觉观常明。绝三毒永使消亡。六贼不令侵扰。自然恒沙功德种种庄严。无数法门悉皆成就。超凡证圣目击非遥悟。在须臾何烦皓首。法门幽祕寧可具陈。略而论心详其少分</p><p>观心论</p><p>庚申年五月二十三记</p></div>"
}]