[{
    "title": "金刚般若波罗蜜经传外传 第2742部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p><a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>传外传</p><p>法<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>若有彼我见是见所摄。菩萨入相应<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>时不复分别。即此观察為入方便菩萨则人无分别也。一切法则法无分别也。欲愿及摄散二种。则一切住方便也。不住法想则显示不分别也。此则与传总结劝修法空而不住法空。略符同然知见信不明。何者彼云。显示增上心增上智故。於无分别中知见胜解。按知者依止奢摩他也。见者依止毘闵崮恰4硕?そ庹咭乐谷?μ帷Jそ饧慈缡切乓病I菽λ?丛錾闲囊病?炽舍那即增上惠也。三摩提即<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a><a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>也。按此三但是直往者也。修伏大乘也。不是顿悟者。住最上乘也。彼於三僧祇难解难入。此於一剎那易证易得。具如传。我皆令入中广释。天亲以為知是世智。见是第一义智。信是三昧。此则失经之□旨。以见法见我不见真如故。按见法尚不见真如。何况见我。然则世智為知有知无。第一义智為见真见。俗三昧為信住信离。若无有无何名世智。若无真俗何有第一义。若非住离谁入三昧。原夫因定发惠<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>通门。若以此言即合信在前而见知為后。不得言知见信也。差别之名且如上例。按此经文。宣<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>智果之体真化二身之极。六喻三义现观皎然。十圣三贤自修明白。所以如来举兹正入劝彼真乘不是别明定惠也。斯则唯用三无专除<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>。虽云二我终是一空。然则遍计我相妄有妄故但知也。依他我见假有假故须见也。真实我性证有证故方信也。如是不住<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>见性。此是<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>对能悟入总為相分。此相即无自性故曰则非犹是我之习气故曰是名此则不住法空也。具如传释。若诸佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>不言<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>者。则释迦如来谁说是化。按<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>既是福感而现说法。何关佛身。此则常住本法也。缘自得法也。然则化身是影。像增上缘何尝成道何尝言说。假令有法亦不能詮。以法性不可言故。是则劝持经者演说勿生我说想勿生詮义相。如彼迷南為北谓之非北。彼终不悟。若<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>了亦不由他无说明矣。且如来演说向是眾心菩萨宣传。寧容已力。何况能说能听俱是自心所行所证。悉无自性。如<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无世界微尘自性也。故云</p><p>我坐道场时<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>不可得</p><p>空拳狂小儿以度於一切</p><p>按此即<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>之初鉴无性之后心。或演俗諦法门。或说真如理观。皆缘彼识实无自心此则无染也。此不名说也。如此说者是名真说也。所以持一四句偈。菩萨檀度非疋。良由此焉。无著云。於<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>不染。天亲云。不住<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。此则更相表里同為除疑。按此偈四句文即三重。一指法举喻三劝修。<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>云。非有為非离诸如来涅槃。此断疑也。何者若常说法谁入涅槃。故云。佛得涅槃化身说法。化身说法此非无為也。佛得涅槃非有為也。且有无不住是尽法门。菩萨一别行耳。不可用释如来也。然则报佛有始无终。若入涅槃与化何异则如来不来不说。具如上传。岂可以菩萨心量而言佛不住有為无為乎。至若须陀洹果尚离有无品。况佛智乎。净名云。我观如来。前际不来中际不住后际不去。乃至不此岸不<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>非中流。非有為非无為。不可以识识不可以智知此名正观。此名见佛。故知对机演说。则云不住生死涅槃。以彼二性不可得故。自言观佛则云离於有為无為。以彼二為是心量心故。前后既无来去。中间说者是谁。而乃以微尘世界解清净虚空。岂非至惑也。若如彼释。即应云一菩萨涅槃非有為非离。何者尽无尽。是应香积菩萨言非诸菩萨故。按涅槃此云静息。岂可有无而不静息乎。然则法无我智中已离真如无為自性。何况最清净觉。又离法无我智而存不住有无乎。如上传。彼果断中正释弥勒。以九事喻九法。合之為三。一体二用三行识尘根是体也。器身受是用也。过现未是行也。论云。见相识者。见是见分能受识。相是相分所受识。识是身身者受者识。亦不相违。然则识是了别。星有光辉。若满月澂明则小星晦色。太阳曜景则大星不现。故闻思惠起分别则微正惠若生彼识则灭。此对除同也。且六尘相现六识见生空花在瞩眼翳能起此相由见同也。六根成就是地水火风和合灯景照烛因油盏主火共明此缘假同也。器是依报从他受用生幻是妄境依他药草起。此不自生同也。身是正报从业种成露是气积因夜凉。有此依他起同也。受谓三受。由依正而领纳。泡因水激。从风雨而生成。此由触有同也。过去业缘现在思念梦中妄境窹已觉知。此却缘同也。现在假有念念不停。电光纔现新新谢灭。此势速同也。以种约报报在当生。以云约雨雨即未有。此后有同也。由此九观故。佛於有為法中能得自在。故偈云</p><p>观相及受用观於三世事</p><p>於有為法中得无垢自在</p><p>按此於有為得自在。於无為则不然。何者以此九种唯观有為故。前偈云。妙智正观故。未审此智為是菩萨為嘱如来。若是菩萨者不得言诸如来涅槃也。是如来者不可云应作如是观也。师资犹自未明文义如何得晓。若此九喻不通显三无性。是别明九种观者。未知若為作如星观。如星闇中有光明处不现。為起闇相為起明心。若起惠明者此则除星观。不得云如星也。又如翳观。则境从翳生。知生不除则翳境恒起。若除翳境即是除翳观。不可云如翳也。又如灯观。灯从眾缘生。根从四大起。若知从缘生有何所得。若缘生故无灯自性者。此则是除灯观。不得云如灯也。自后六喻皆同此破。故知劝修法空喻显无性此為实论。然此九种皆是十八界受用及行业。无八心及心法。假令观九种成就。只是人空以唯除有為故。摄一切法不尽故。由一切法中有六无為故。此一切者。总於百法成二无我故。无著云。显示四种有為相。一自性相。二著所住味相。三随顺过失相。四随顺出离相。此则四九之各虽别。有為之目不殊。然则以人法我见如翳為当也。不通诸喻还非。又随顺人法无我以攀缘故得出离故。是知三世行<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>已则通达无我。此显示随顺出离相也。餘释与天亲略同。按此出离中。则无人无法总名有為则乖百法无我也。何者如自性相是共相见识真如亦是一切法共相所显。岂无彼自性耶。若无自性者。不得言六种无為。既差别不同。各有自性明矣。是则自性相中具有有无句性何得。唯言有為相也。又出离相是二无我。此则出离。於有為无為之外不是有為无為之间也。无為尚自出离。何得入四有為乎。奚名义之乖谬若此。故知。计著四相所為四相皆无自性。具在传文。故能断本云。诸和合所為则為有為為无為也。诸大乘经多说此喻。或一或二或七或九或十。或广如净名。以一切喻喻身妙德以喻眾生。曇无竭以喻如来岂可星翳定喻相见乎。故知用易解空况难解空是则空中尘界。真应二身尚无自性何况诸法。所以用兹九喻通显三无。皆非有性。此為正释</p><p>问。心及心法已闻。於五眼境中六种无為闻之。於四果论内十一色解之。於<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>图中二十四不相应请為出之答。不相应行法略有二十四种。一得。二命根。三眾同分。四异生性。五无想定。六灭尽定。七无想事。八名身。九句身。十文身。十一生。十二老。十三住。十四<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。十五<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。十六定异。十七相应。十八势速。十九次第。二十方。二十一时。二十二数。二十三和合性。二十四不和合性。问。若说法时出诸经中相违过失及恶心论义堕四恶道。佛有明言何得斥诸经论。及无著天亲所解自称其传诽谤<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>将坠大坑。如何自晓。答。按<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>云。眾生诸根钝著乐痴所盲。如斯之等类云何而可度。我寧不说法疾入於涅槃。寻念过去佛所行方便力。我今所得道亦应说三乘。爰夫有情善种成熟智慧利根。佛则不说三乘唯宣一实。所云诸法寂灭相。不可以言宣。此则所则所知相自性寂灭一实之理也。言语道断也。故知不但对彼三机人天亦须接引故。说<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>十善四禪四空。然有厌俗之情。虽励入真之志未深。所以遍说无生对除人我。是则涅槃<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>僧之差别也。如摩尼珠虽<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>施各充所求。如有病者乞药即遂分外希望终不可得。佛说亦然。他皆放此。<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>云</p><p>若彼心灭尽无乘及乘者</p><p>无有乘建立我说為一乘</p><p>故知无彼五机则一乘不建。亦既宣说深浅有殊。是则后一唯是佛乘。前四并非佛法。或者乃以人法疑於天乘。或以前四而疑后一。或以后一而疑前四。乃至五五相疑成二十五重违滞。此则对机无碍何有相违。且一一乘中自有深浅。於此生惑疑网增多。岂诚言之足深但识照之自浅也。且如不净小观即有正邪想。不净时乃见佛相境。观相违则為邪观。何况观佛见不净相而得為正观者乎。如小乘机人。若為说大乘则诽谤不受堕於大坑。所以三七日中思惟不说一乘良為此也。况正说佛乘。而乃杂以独举声闻人天之法。岂非惑乎。然有解说者。或以声法而解佛法。或以佛法而解人天法。或以初地法而解十地法。对彼本乘虽為<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>。将詮此道正是邪言。况乎悟入。真宗清净妙觉无性无得在五乘之表。杂以无相无生犹甚不可。况以俗中苦空无常无我有為无為释成现观者乎。悲夫悲夫何迷谬之甚也。何以知其然。按摄论云。其有未得真智。觉者於<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>中由教及理应可比知。无性释云。由至教量及由比量虽未<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>。唯识真知应可比知。故知至教即了义经也。非至教即不了义也。且如度量权衡一。於天下格律令式四海不殊。然而狭幅大尺越於程章误出故违乖於彞。则自不遵奉自不较量。既受其事兼累良善知而故。纵岂曰存公至若四量四依為未证者之准的通一切义理格一切经论。安可不从之。安可故违之。岂可以已遵奉以已不较量而责於遵奉乎。而责於较量乎。故知对机正说本不相违。妄程邪愚解释乖谬。是则出诸经中相违过失。魔得其便自取三涂故。云好心论义生五净居。恶心论义堕四恶道。此传唯明悟入成乎。正觉苟违此观咸所不依。且智觉真詮犹為增语。况自心<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>而為至实者乎。所以有同不同。良為此也。故知。一宣净觉则福智无穷。以能斥诸邪妄故。一从菩萨则罪业无量。以毁歿圆照故非但自身留滞柳。亦迷误群生所以。无著云</p><p>下人於此深大法不能觉知及信向</p><p><a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>眾人多如此是以此法成荒废</p><p>原夫诸佛降灵悬远难遇。设使逢遇闻法更难。设得闻法闻深又难。设闻深法信解弥难。设能信解悟入最难。此则悟入不悟入。在於精懃不精懃不在闻说也。愿同修住者无自轻乌无自弃乌如颂云</p><p>集求诸欲无厌足集欲未足而命终</p><p>妻子珍宝及名位临命终时无随者</p><p>唯有施戒不放逸今身后身為伴侣</p><p>金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜经传外传</p></div>"
}]