[{
    "title": "金刚般若经旨赞 第2735部",
    "author": "昙旷法师",
    "html": "<div class=\"B1_text\"><p>第一卷第二卷</p><p>金刚<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>经旨赞 卷上</p><p>京西明道场<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>曇旷撰</p><p>夫实际无言。必即言以辨实。真宗匪相。要假相以显真。言即实故。虽说而无说。相即真故。现形而无形。无说而说。何言说而不尽。<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>之相。何形相而不周。故说非□□□□名具。□无法可说。是<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>焉。斯乃般若之真宗。觉者之师母也。故使四生□□□□积之有惑。二乘渐悟。断深密之无明。诸佛体会。成不坏之四身。菩萨契修□□断之三慧。显斯妙用。迥拔群经。假喻金刚。以彰妙智。既前佛后佛。由如是住。大圣小圣。应如是修故。善现啟迪於真筌。如来式扬於奥旨。三问九喻。终始发明。八执五邪。心言荡成。乃真护念付嘱。佛种不断者歟。既為方广之关枢。大经之钳键。言约而义远。文密而理该。开阐者莫得其宗源。诵持者。但修其章句。故我补处慈氏。创释颂以赞幽。作宣唱之指归。為论者之规矩。乃使初圣无著。列诸住於行。一邻地天亲。遣群疑於真际。金刚仙记。会一实於有空。<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>施论生二智於真俗。各申雅趣。共释兹文。虽曰异端。咸阶至妙。若不会融诸说。何以委赞幽宗耶。纂殊途□遵同□用通理。以闢玄关。题言<a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>者。即到<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>。能断慧教。融理事於行位。故称<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>。碎坚积之疑执。假喻金刚。出<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>而至<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>。云到彼岸。贯法义而摄群品。目以為经。故言金刚般若波罗蜜经</p><p>赞释此经。五门分别。一叙教兴由。二述经宗趣。三显经威力。四明经所被。五赞经本文。初叙教兴。依经及论。总开四义。一為拔苦。二為与乐。三令起行。四令得果。言拔苦者。為除眾生老病死苦<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>。经云由此三事应正等觉。出现於世。為诸眾生。说证法等。此虽总言。於别亦转。佛所证法。唯真般若故。除三事而说。此经令四生等皆入无餘。但灭其生。无老等故。不住色等而生。其心心念不生。离生因故。言与乐者。谓眾生佛知见乐。知见即是<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>涅槃。在果在因。能所知见為开示故。而说此经。故法华云。诸佛唯一大事故。出现於世。开示悟入佛知见等。诸佛及法。从经出生。如来即是诸法如义。是相非相。即见如来。离一切相。即名诸佛。如次即為开示悟入。经文非一。应寻引之。言起<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>。随其所应法。外人等起行位故。故无著论。说六因云。為断疑故。為起信解故。為入甚深义故。為不退转故。為生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>故。為<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>久住故。即是般若波罗蜜令佛种不断。云何以此种不断耶。断二乘等自无分疑。令入大法。故名断疑。初入取相。而心未定。生定信故。名起信解。云定信者。令入二空无為理故。名入甚深。谓得胜处。便乐住寂。令进修故。名不退转。既进修已。无得而得。自庆悦故。名生欢喜。闻法庆慰。转為他说遍<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。故名法久住。由此法故。益遍自他。故说般若佛种不断。随所引文。释广论义。言得果者。為依二諦得无住果故。功德施菩萨。论云佛所说法。咸归二諦。一者俗諦。即人及法差别假相。二者真諦。即此人法无<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>空。此真及俗。体不相离。俗即真故。有而不有。真即俗故。空而不空。非有非空。是中道理。得中道故。不住二边。由此不住<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>寂灭。成无住处大般涅槃。故佛说经。令悟二諦。即俗观真。离诸相故。有正智起。即真观俗。无不达故。有后智生。由后智而兴悲故。四生<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>。皆令灭度。由真智而无住故。实无眾生得灭度者。生智而无住故。不住生死兴悲而度生故。不住涅槃。即成无住大涅槃果。下文皆尔。应寻引之。叙兴由竟</p><p>显宗趣者。复分為二。初显所宗。后明所趣。所宗有三。即三般若。虽餘处说有其五种。今顺智论及论喻故。一者实相。即是真如无相妙理。二者观照。依真所起无相妙智。三者文字。即能筌此名句文等。初即是性。次即是相。后即是因。说智及智处。皆名般若故。更加境界眷為五。既非经宗。如餘处说。虽有三种。今所宗者。正唯前二。兼通文字。非实相观照之智不生。无观照实相之理不显。是故境智為正所宗。其文字者。但是假筌。得证亡教。非正明故。既為证因。兼所宗也。所趣有四。一教般若。谓说无说能筌名等。是实巧筌契真实故。二理般若。谓得无得所筌妙理。如能筌证无倒相故。三行般若。谓行无行无相<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>。能感能证。无上因故。四果般若。无得而得。菩提涅槃。是所筌证无上果故。如是四种所趣般若教浅理深。行分果满。此所说者。正唯理果。是所筌趣。深圆法故。兼通教行虽云浅分。亦是假者。所归趣故显宗趣竟</p><p>言威力者。略显此经有十威力。犹如金刚。故得此名。一最胜威力。最上第一希有之法。所在之处皆应敬故。如彼金刚胜诸宝物。故涅槃云。如诸宝中金刚最胜。随彼宝膜。成彼宝故。二难见威力。经义<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>。皆不思议。乐小法者。不能受故。如彼金刚非餘能见。故正理云。帝释顶宝。名曰金刚。非餘能见。光赫夺故。三除灾威力。下品持经。為人轻贱。先世罪业。尚消灭故。如彼金刚能消灾毒。如真諦记。有六种宝。皆名金刚。青碧二色。除灾毒故。四称求威力。有目能见。普利眾生。能严<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。得菩提故。如彼金刚满人所愿。如六宝中其餘四色。黄赤白空。随须游空。出水火故。五坚实威力。能摧我人眾生寿者。法非<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>非彼破故。如彼金刚非彼物所坏。故涅槃云。金刚拟处。物无不破。而是金刚无折损故。六利用威力。通达<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。得成於忍。以佛眼等。悉知见故。如彼金刚。穿通诸物。故梁摄云。譬如金刚其体锋利。悉能穿割一切物故。七无间威力。不住行施。生无住心。相即非相。无所得故。如彼金刚非物不杂。故对法云。譬如金刚体无间隙。非沙石等所相杂故。八一味威力。皆以无為而有差别。诸法如义。皆<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>故。如彼金刚其体纯一。故对法云。譬如金刚其体一类。纯一无杂。不变异故。九能引威力。诸佛及法。从此出生。成不思议无边福故。如彼金刚能引诸宝。故梁摄云。金刚能招一切宝物。有金刚处宝自集故。十遍满威力。福广如空。利益一切。离一切相。度一切故。如彼金刚遍满一切。故对法云。譬如金刚遍一切处金刚轮等。遍世界故。更有诸文。随应引说。显威力竟</p><p>所被根宜。於中有二。初辨根性。后明教被。辨根性中。复分為二。一者正因究竟远性。二者缘因差别近性。所言正因究竟远性者。即是树通真如本觉。凡圣本来实无二体。眾生及佛。平等一因。由此实无种性差别。但由无明厚薄不同。所闻教法。邪正有异。佛法<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>。大小顿渐。故说眾生有种种界。由其一体正因<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>。内外因缘。薰习力故。究竟皆得无上菩提故。说眾生皆有佛性。所言缘因近别性者。即是横剋近薰五性。一无种性。谓有无明厚重之类。染邪教等。因缘力故。诽谤正法。拨无<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>。焚烧一切善根种子。未可记彼出世时故。谓阿阐提名无种姓。二声闻性。谓曾闻说四諦之教。欣乐力故。薰成识种。因种力故。深厌生死。求自<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。不愿利他。由此当得声闻小果。即说此种。名声闻性。三缘觉性。谓曾闻说十二缘教。欣乐力故。薰成种子。由种力故。乐自寂静。观缘起理。捨说听心。由此当成缘觉中果。即说此种。名缘觉性。四菩萨性。谓曾闻说同体真如。悲利自他。大乘满教。欣乐力故。薰成种子。因缘力故。能发大心。由此当成究竟<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。即说此种。名菩萨性。五不定性。谓闻三乘出世正教。於三乘出世正教。於三乘果。俱有欣求。於三乘法。悉乐修习。於三乘果不定趣求。由此应得三乘圣果。即说此种。名不定性。明种性竟。次教彼者。若据正因究竟远性。此经通被一切眾生。用大外缘。薰内体相。令从无明而显出。故无云信谤。皆使得闻。岂简五乘有无定性大悲。依体无别异故。若据缘因差别近性。此经正為大乘者。由说满字教。被大性故。令起大行。成大果故。乐小法者。不能受故。佛所说法。无虚设故。若约兼被。亦通四乘。般若能辨二乘地故。感不思议人天果故。令不定性。迴趣大故。初后别眾。非唯大故。依兼正通被五乘。明教所被</p><p>次下第五解经文者。於中有二。先释题目。后释经文。释题有五。一解金刚。二明般若。三明波罗。四显蜜多。五辨经字。言金刚者。有总别释。总言金刚。显能断义。然断<a href=\"/remen/erzhang.html\" class=\"keylink\" target=\"_blank\">二障</a>。要具理智。谓若无理。智必不生。因理生智。方能断惑。是故论言。二义相应。恐谓。能断唯属於智。故言二义。显兼於理。如彼邪正二行虽殊。既俱名见故。此理智性相虽异。皆如金刚。既许所宗通於实相。不应金刚唯喻观照。故通理智。稍近论宗。所言别者。有其三义。一者细牢。二者能断。三者相似。如次即喻实相观照文字般若。言细牢者。所喻实相。而為智因。不可坏故谓此实相。其体真实。因证能生真实正智。故说实相。名為智因。非有為相之所间杂。如彼金刚非沙石等所相杂故。名之為细。又非二障所能损坏。如彼金刚其体坚硬。非物所坏。故名為牢。论以细牢义殊故各别释。今以所喻体同故合為一。是则深契论之本意。言能断者。谓即般若波罗蜜中。<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>慧所断之障。乃如金刚断处而断。即此观照闻等三惠所断之障。如彼玉石即是金刚之所断处。而為观照智所断故。故说观照。名為能断。言相似者。谓即如彼尽金刚像。若金刚杵。两头则阔在中即狭。有坚胜用。若金刚神。膊[月*舍]即阔。在腰乃狭。有动作义。文字般若。亦复如是。前后即阔。在中乃狭。前后阔者。信行佛地中间。狭者谓净心地。是胜所依进趣处故。此显示不共义也。谓前二义。名金刚者。即餘般若。皆得此名。实相观照。通诸部故。若依后义。唯在此经。文字阔狭。非餘经故。不同餘经。名不共义。是故此经。独名金刚。言般若者。即是<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>。华言译云无分别慧。此有二种。谓生法空。皆通加行根本后得。随其所应。有漏无漏。然慧与智。而有通别。通谓智慧。其体无别。皆别境中慧数摄故。故说第六。名智慧度。别谓智慧。其用不一。择法决断。用各异故。故说十度。智与慧别。前以相从。通三五种。今据剋性翻為智慧。以能断伏二重障故。故以金刚而為喻也。问。题称般若。既曰所宗。何故行中。乃举其施。答。约前引后。即檀度收。以后净前。即智度摄五。举其一理实皆齐。若尔应名金刚<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。答。施為万行之初。麤而易习。智為百法之极。胜而难成。题令企敬。标般若之胜名。行引初机。举檀那之首号。故题与行所举有殊。皆喻金刚。无理乖返。言波罗者。此云彼岸。即是佛果菩提涅槃。由对此岸。得彼名故。即已起苦集為此岸。当起苦集名中流。六度妙行為舟船。佛菩萨等。是能度。<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>人是所度者。既超生死得至菩提。故说佛果。名為彼岸。言蜜多者。离义到义。要由修习最胜施等。离出生死此岸中流。达至菩提涅槃彼岸。故说施等為离到焉。今此所说。无住六度。故深密云。施等一无染著故。无顾恋故。无罪过故。无分别故。正迴向故。由斯方得到彼岸名。所言经者。梵云素怛揽。乃目四义。谓衣綖席经。今取綖义。及取经义。如綖穿花。风不能散。以教贯义。邪不能除。如经持纬。方织物成。以教摄生。令得圣果故。以教法目乎经。若真实论。说有五义。一曰涌泉。二称绳墨。三名结鬘。四谓出生。五号显示。若准此方。经者常也法也逕也。古今不易故。揩定正邪故。津通物理故。<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>同之。亦无有失。总云。今此所筌。如金刚智慧。能断二障。达到彼岸。以其教法贯穿摄持。是其凡圣常行之道。故云金刚般若波罗蜜经</p><p>经。如是我闻至五十人俱赞曰。上释题目。次解经文。依佛地论。弥天法师。大判经文。以為三分。初从如是我闻。至敷座而坐。教起因缘。说经由致。名為序分。次从时长者须菩提。至应作如是观。圣教所说。正谈经体。名正宗分。后从佛说是经。已讫至经。依教奉行。欢喜弘通。名流通分。序中文二。此段经文。诸经共有。故名通序。尔时已下。当部别缘。名為别序。初传法者。引证令信。亦名证信序。后说位者别缘发起。亦名发起序。释此三门分别。一起之因由。二说之所以。三正释其文。起因由者。佛<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>毕。将归涅槃。侍者阿难。亲爱未除。闷绝擗地。不能自醒。时阿那律。以水洒面。而语之曰。佛付汝法。今迷闷失所受时事。岂得名為护正法者。大师<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>。今日则在。明日则无。设有疑者。当於何问。汝依我语。当问於佛。如来在世。以佛為师。世尊灭后。以何為师。如来在世。依佛而住。世尊灭后。依何而住。世尊在世。自调恶人。灭度之后。云何共住。如来在日。自能说经。灭度之后。一切经首。安置何言。令眾生信。尔时阿难。如从梦觉。既问如来。世尊告曰。我涅槃后。以戒為师。断一切恶。修一切善。设我在世。无异此故。依<a href=\"/remen/sinianchu.html\" class=\"keylink\" target=\"_blank\">四念处</a>。专心而住。观身不净。观受是苦。观心无常。观法无我。由此能除常等四倒。既出生死。得成圣道。是故常应依之而住。诸恶<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>。梵檀治之。但莫与语。自当调伏。一切经首。当置如是我闻等语。则眾生信。因阿难请。而置此文。即是此中起因由也。明所以者。略有四义。一為除疑。二令起信。三為简邪。四為显正。言除疑者。微细律云。於结集时。阿难昇座。以法威力。形忽如佛。眾起三疑。一疑大悲从涅槃起。二疑别佛从他方来。三疑阿难转身<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。说如是等。三疑併断。言生信者。智度论云。说时方。人令生信故。佛法大海。信為能入。又是道元功德母故。又拔眾生。出生死泥。须举信手授於教手。序生信手。正<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>手。两手相接。出於泥故。如人有手至山取宝。若无手者。空无所得。有<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>人。入法得证。若无者。虽解无益。是故经初。令生净信。言简邪者。但无如是六句经文。当知皆是外道教收。如有外道。一切教初。皆必安置阿沤二字。阿表於无。沤表於有。言其教旨。不离有无。今置六句。為简於彼。故智度云。一切经首。当置何言。简异外道。言显正者。真实论云。<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>最吉祥故。我经初说佛為佛宝。我闻阿难及比丘眾。名為僧宝。如是一时舍卫国等。所说时处。皆為法宝。以兹四义。置如是等立。所以竟。正释文者。准智度论。分六成就。一信。二闻。三时。四主。五处。六眾。言如是者。举所闻法。令眾生信。名信成就。今括诸说。以三义释。初以二字。各别训释。次乃总申二字之意。后带我闻以解如是。言别释者。自古多解。大意不离教理行果。故今依此四义释之。教能显理為如。文不乖义称是。理顺教显為如。义不差文称是。依教起行為如。顺理亡相為是。依愿得果為如。果称於因為是。言总申者。显说此经。离四种过。故言如是。一离自说。佛所说法正如是故。二离差异。文义决定。皆如是故。三离不信。若有信者。言如是故。四离非法。若正法者。称如是故。后带我闻释如是者。依佛地论及诸释意。如是总言依四义转。一依问答。显离自离说传闻过失。谓结集时眾咸问言。汝当所说。昔定闻耶。故即答言如是我闻。二依譬喻。显离增减异分过失。谓当所说如是文句。如我昔闻。齐此当说。定无有异。三依许可。显有<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>堪能功德。眾咸请言。如汝所闻。当如是说。便许彼言。如是当说。如我所闻。四依教诲。显起恭敬信受功德。谓告结集诸时眾言。如是当听。如我所闻。应正闻已。如理修行功德施等。所说诸义。应知皆是此四义摄。言我闻者。举能闻人。显自亲闻。名闻成就。谓传法者。自指己身。言如是法我自亲闻。我谓诸蕴和合假者。有主宰用故。称為我。闻谓耳根发识听声。意随耳识而取於声所发名等。薰习在识。聚集显现。总说名闻。癈别就总。答显藉眾缘故。谓闻法要。故名我闻。问。何须如是癈别就总。答。显藉眾缘故。谓闻法时。要具八缘。若一一陈。遂成繁广。但举其一。义用不周。显假具缘。言我闻矣。若尔何不言无我闻。答。除怖畏心故。恐诸外道。及凡夫等。闻无我声。既言无我。谁闻谁学。怖畏佛法。不肯入故。若尔何不言阿难闻。答。显自在德故。我谓主宰自在之义。显传法者有所堪能。总持三乘广大教法。若称名字。无是义故。若尔何异凡愚妄执。答。随世流布故。<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>皆说自他彼我。染净因果。所作事业。今传法者。虽无妄执。随顺世间。令生决定信解之心。入正法故。而顺世俗。假称我焉。若尔何独指阿难邪。答。是传法者故。过去<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>诵经<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>。今得多闻总持第一佛法海藏。流入其心。如彼写瓶。无有遗失。又亲侍佛二十餘年。人天所识。传必生信故。佛以法而付嘱之。既传教主自指己身故。我闻者嘱阿难矣。若尔亦有传闻之失。答。佛為重说故。阿难请佛说已前经。然诸圣者。理无重语。佛粗举其端。则悉通一切。况闻授记菩萨所行。得觉法性自在<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>。诸佛法藏。尚能忆持。况已前经。而不通悟。虽二十年后。方侍佛闻经。称我闻者。理亦无违。若尔应言我见觉。答。推功归佛故。此所传教。属佛世尊。是诸如来。现觉而说。阿难因位。觉道未圆。若称知见。谓言自说。恐餘不信。故但言闻。况乎此界。声為佛事。名等詮法。不依色香希证菩提。要闻深法。多闻薰习。為出世因故。但言闻不云见觉。更有问答。如餘处明。言一时者。显所闻法善合时宜无非时失。时成就也。谓明说此一部经时。於一时间。在某处说。则显说此一部经时。餘时复说无量经故。眾生根熟。為感如来逗机。而应药病相应。随言得益。说者听者。时分无差。共相会遇。名一时矣。外道世典。无如是名能故。我佛教名一时也。前简说听餘部经时。后简说听前后之时。显佛教胜。令生信也。若尔诸法应非<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>。说一及时。心外法故。答。虽言一时。不离<a href=\"/remen/xinshi.html%09\" class=\"keylink\" target=\"_blank\">心识</a>。谓此<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>。随色分齐。妄相建立一之与时。若离色心。则不可得故。不应行蕴取摄。摄论说為世识数识所闻之法尚不离心。况一及时而别有也。若尔三世应皆是有。说一时者。对过未故。答。<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>诸法。生已即灭。生则酬前灭而引后。所酬為过去。所引為未来。已灭未生。虽不可得。假对此二。说现在焉。如知往因。应观现果。知未来果。当观现在因。岂则一人有三身也。但是现在一念妄心。今说听者。随心分限。变作短长。事绪终讫。总名一时。如梦所见。谓有多生。觉后<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>。都无实竟。若尔何不同下经等。言四八时十二时等。答。显佛教胜简外道故。如诸外道。皆是凡愚所说。诸法悉是颠倒虚妄。说者听者。根缘不同。虽有教旨。不成药石。徒增恶业。虚长邪心。既无证悟。寧阶圣道。故彼教首。不言一时。今言简邪。言一时矣。若言四八。何异邪经。不言四时十二时等。更有问答。非要不明。所言佛者。显说经主。是最胜尊。表经可信无非主失。主成就也。若不言佛。不知此经是谁所说。一切生疑。又智度论说。能说有五。一佛世尊。二圣<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>。三天龙等。四神仙等。五变化等。若不言佛。恐谓餘说。今言佛说。表可崇信。佛者梵语。应言勃陀。<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>觉他觉行<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>。具三觉人。故名觉者。谓从<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>。而得开觉。具一切智。永出生死。如从梦寤。故名自觉。断所知障。而得种智。说自觉法。令他开觉。如莲华开。故名觉他。诸障遍断。诸行遍修。诸境遍知。诸果遍证。出过眾圣。故名觉满。初胜人觉贼异凡夫。次觉胜天鼓异声闻。后觉胜千日异菩萨。三者备矣。受佛名焉。然佛世尊。有其三身。今此经者。是何身说。若对地前。则<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>说。如对地上。即应身说。若法报身。亦无说法。自受法乐。不说法故。佛不相為说法故。非诸菩萨所见身故。既三身者。其体不殊。是则三身。无说不说。诸经有言薄伽梵等。依梵本译。今言佛者。随方生善。亦有经说佛婆伽婆。為简辟支及外道故。言在舍卫国祇树等者。是说经处。显说此经。必有其处。无非处失。处成就也。若不说处。未知此经何处而说。一切生疑。為令生信。故说其处。舍卫梵音。此云丰德。谓丰财宝女色。多闻解脱。<a href=\"/remen/side.html%09\" class=\"keylink\" target=\"_blank\">四德</a>故名丰德。亦名闻物。以多宝物。及以人物。诸方闻故。正云室罗筏。谬云舍婆提。是憍萨罗国之都城名。以是王都。而言国也。祇谓祇陀。此云战胜。即胜军王之太子也。太子生日。王破敌军。因而立名。谓之战胜。祇陀有园。地周十里。在於城南。五六里餘。花卉滋繁。泉池交影。於园囿中。特為殊胜。给孤独者。国之大臣。本名藉达多。此云善德。施仁而聪敏。积而能散。拯乏济贫。哀孤恤老。时美其德。号给孤独焉。有七子男。六已婚娶。因為小儿。耽室遂至王舍大城。佛初成道。正在彼国。见佛闻法。果证预流。遂请世尊降临舍卫。如来既许。愿造僧坊。佛命鶖子随而瞻揆。唯有此处。堪造僧坊。遂诣太子。殷求货买。太子戏言。金遍乃卖。须达闻之。心豁如也。即出藏金。随言布地。太子感念。而告之曰。若佛非是良田。寧使轻金贵土。我植善种。亦是其时。地任卿收。树当自施。须达得地。大建僧坊。崇饰已周。遥请佛降。大悲圣悬监。乘通而来。既至伽蓝。谓大眾曰。林树祇陀自施。园地须达买施。二人同心。式崇功业。君上臣下。世典格言。自今已后。应谓此地為祇陀树。给孤独园。游化居心。目之為在。游化在城。居心在园。双举城园。显斯二义。二义虽异。俱名在焉。故名在舍卫国等。此举化佛所居。化土為对小根。令生信故。显佛慈悲。救重障故。理实亦有二身。实土净秽之方。无别质故。言与大等。举同闻眾。显说此经必称根宜。无非眾失。眾成就也。若不列眾。不知此经与谁同闻。一切生疑。為生信故。举同闻眾。与者兼并共及之义。谓与阿难。问在一时。同一集会。同无漏心。同离诸恶。同无学见。同我空道。同断烦恼。具此七义。故名為与。此同闻眾。而言大者。眾数多故。名称高故。皆罗汉故。离重障故。德难测故。王等敬故。向佛果故。破外道故。总□诸释。有斯大义。比丘梵言。具含多义。一曰怖魔。初<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>时。魔宫动故。二称乞士。乞食及法资身心故。三谓净戒。离身语意诸过恶故。四名净命。离五邪求恶活命故。五云破恶。能破见修薰烦恼故。言含五义。无以译之。但存梵语。显斯五义。由此五义。故曰比丘。眾者僧也。四人已上。理事二和。得僧名故。同戒见等。名曰理和。同布萨等名曰事和。以和合故。名之眾也。千二百五十人者。即优楼频迦摄。五百弟子伽耶迦摄。那提迦摄。各有二百五十门徒。<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>弗。目乾连。共有二百五十弟子。此等五师外道。门徒共有一千二百五十人。佛初成道。初会度之。常随如来。影响正法。故诸经律。多皆举也。理实亦有餘比丘眾。以此皆是净行出家故。五师门徒故。邪捨归正故。初会所度故。善来得戒故。得二解脱故人天所识故。具斯七义。故偏举之。俱者同时一处义。前以阿难。对彼名之為与。此以自同时处。名之為俱。故与前说。无重言失。故总说言千二百等。佛说经时。应有菩萨。而今但列声闻眾者。总依经论。略显二义。一令餘声闻趣大果故。见為声闻。说如是法。便生念言。彼尚闻此。求无上果。我亦应然。已迴心者。更不退转。未迴心者。亦<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>故。二令小菩萨不退转故。彼见声闻。尚能听此。求无上果故。便生念言。彼小乘人尚发胜进。况我今者。而生退耶。便励其心。不退转故。由斯二义。但列声闻</p><p>经。尔时世尊至敷座而坐赞曰。上明证信。下显发起。言发起者。即表彰也。言明内真。先与外化。表正宗之意义。行发起之事相。然释此文。总分二义。先别明化相。后总显其意。於中则显十种化相。尔时世尊者。即化主也。指陈控引。名曰尔时。当尔世尊说经时也。具足六义。备有<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>。更无与等。世所钦重。名曰世尊。即十号中。第十号也。故佛地论。六义颂云。自在炽盛。与端严名称。吉祥及尊贵。具此六种。最胜义成。薄伽梵功德名。婆伽婆名。与此无别。言食时者即化时也。谓即辰时以。此时中人家饌食。或即初熟。或当正饭。求之易得。不恼自他。若乞得已。还至本处。正时斋前。不失时节。若过於此。即是外道诸恶鬼神。畜生食时。今显出家清净胜法故。於此时而行乞也。言著衣等。显化具也。著初三衣出家净居之衣。初无田相。后变成故。然出家法。皆畜三衣。若於行道作务之时。著安多会五条之衣。若於大眾及说法时。著鬱多罗僧。七条之衣。若入王宫乞食等时。僧伽梨九条等衣。总名<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>。依色立称。亦名功德衣。成胜功德故。亦名消瘦衣。衰损诸障故。亦名<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>衣。是世福田故。亦名涅槃印。要服得度故。亦名佛标相。诸佛仪服故。持四天王所举石恪&lt;叭?虏⑽?鹊取8饔兴?凇H缋葱?恰U棺?嬖怠V领逗旱亍7侨缛宓馈Nㄓ行槊?4思礊槿氤枪手?隆?槠蚴彻食帚。言入舍卫大城者。显化处也。城过十延居家九亿。处广人多名大。自外之内名入。言乞食者。显化缘也。然<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>者。金刚為体。岂资於食而行乞耶。有多因缘。示行求食。瓔珞女经说二十益。瑜伽论说由十因缘。今总参揉有其十意。一為引摄已乞未乞。令住头陀功德法故。二為未来作大照明故。免生讥毁乞食事故。三為救引麤弊外道。既不归伏因行化故。四為正彼承声起谤。现妙相仪令惊信故。五為处中未信眾生。以其少功获多福故。六為虽信放逸眾生。令生愧耻而修行故。七為六根不具眾生。种种灾患。皆静息故。八為六种有障苦人。见佛植福。离苦障故。九以八部导从世尊。令世间人深归学故。十令八部羡仰世人。勤加护故。宾卫无灾害故。於其等者。明化等也。谓由内证平等理故。慈悲之心。无偏济故。不简贫富贵贱人故。而於美恶无爱憎故。具大威德。无所惧故。永离诸过。无猜谤故。降二乘人之偏济故。止外道之嫌疑故。具斯八义故。於城中次第乞已。还至本处。明化终也。前已知足。乞不过量。此□少欲。显其乐静。本自祇园。入城乞食。既等乞已。故还本处。饭食讫者。显化满也。本言利生。入城乞食。今若不食。事涉凭虚。為满福田。故示饭食。虽金刚身实无食事。為成满福故食讫焉。收衣阏摺O曰?⒁病1疽匀氤瞧蚴彻省=逯?鲁帚。今既事终食讫。迺须併摄资缘衣恪2皇张试敌钠稹&lt;仍隼吐恰F竦冒捕U。虽复佛无散心。為后轨模故。须收置。即迭僧伽梨大衣。还著鬱多罗僧七条。洗涤其恪V?V?Α9恃允找裸也。洗足已者。显化净也。由诸如来受步行法。途跣而行。故须洗足。然佛行时。下生莲华。岂有尘垢而须洗邪。表清净义。故言洗足。敷座而坐。显化仪也。谓将说法。自施座具。敬佛母故。不使人敷。即於此座。结跏趺坐。端其身正。其念一心不乱。对真境也。虽四威仪佛常在定。為后轨摸故。敷座而坐。前来已显发起事相。既发起者。表彰之义。即表眾生本净而后染。因说经故。返动而归寂谓眾生心。本来清净。具恒沙德。是真法身。无明覆染。遂入生死。味著五欲。轮转四生。<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>巡环。八苦更受。因佛说经。返照心本。永离贪著。除灭无明。显净法身。<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>安乐。尔时世尊者。即表眾生真法身也。食时著衣持阏摺&lt;礊槲廾鞲踩臼币病H肷嵛来蟪钦摺H腱渡?来罂嗳ひ病Q云蚴痴摺H局?兰淞?揪骋病l镀涑侵写蔚谄蛞颜摺l读?乐小1甘苈肿?病;怪帘敬φ摺S砂闳袅ΑU招谋疽病7故称?摺S览胩爸?病J找裸者。除灭无明也。洗足已者。显净法身也。敷座而坐者。安乐无為也。从始至终。表彰斯意。是故现此发起事焉</p><p>经。时长者至而白佛言赞曰。上明序分。下显正宗。准无著论。有七义句。一种姓不断。二发起行相。三行所住处。四对治。五不失。六地。七立名。应知前六义句。正所明宗。第七义句。释经名字。就前六中。初三别配经文。后三住处通义。既前三句。别配经文。后正宗分。分之為三。初从时长者。至善付嘱诸菩萨。名种姓不断。次世尊善男子。至愿乐欲闻。名发起行相。后从佛告须菩提。至应作如是观。名行所住处。即初明讚佛。為请说之由。次问修行。為趣大之本。后佛广说。辨修伏之宗。天亲等论。既无科文。但逐便明不假预述。初种姓不断中分二。初善现请仪。后正申不断。此文初也。将申讚问。先整仪形。若处座居。然匪諮諮之。礼故表虔。奉而现敬仪。须菩提者。梵语讹也。梵语典音云苏步位。此云善现。或云善吉。以初生时家物皆空。父母惊怪。以问相师。相师答言。善相现耳。唯善唯吉。因斯瑞相。而以名焉。十弟子中。解空第一。言长老者。叹其德命故。有释云。德长年老故。餘经本名為具寿。谓即具与福惠命故。此即东方青龙陀佛。為弘般若正法。影响正法。示处下乘。為<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。在大眾中者。明混迹於声闻。即从坐起者。彰颖拔於群辈。通肩披衣。示敬之相。袒其一膊。驱荣之容。左膝著地。降今昔之执情。合掌恭敬奉。冥合於妙理。将发疑问。敬法重师。若不避廗虔恭早躬。屈己何以表身心之府顺。明信向之深城。故尽敬仪。方申请问。啟辞道意。而白佛言</p><p>经。希有世尊至付嘱诸菩萨赞曰。此正申不断也。前以身行肃敬。表自恭勤。此乃语尽虔诚。述其尊德。希有世尊者。总谈妙德。善护念等者。别叹胜能。希有有四。一时希有。旷劫难逢故。二处希有。大千唯一故。三德希有。福惠起绝故。四事希有。救护巧便故。虽有四种。今者唯取事之希有。此為总标。善护念等。是别释故。护念付嘱。巧便事故。由能护念付嘱。菩萨未成熟者。而成熟之已。成熟者。转复增进。当成正觉。绍佛菩提。展转相续。佛种不断。故护念等。是佛胜能。善现欲表佛说此经。能令眾生佛种不断。偏举此德。以叹如来。即因讚佛。显经意也。故说此经名种姓不断。加卫覆摄。是名护念。加被拥卫。覆阴摄受。即是此中护念义。故委託授与。是名付嘱。故委大训小。託深化浅。委杖凭託。是付嘱故。谓佛世尊。断一切障。心归本源。名曰如来。由此方能护念付嘱。虽菩萨等亦能摄付。今就最胜。唯说如来。乘如实道。来成正觉。说一切位。极深妙法。能遍摄付。非餘能故。故说如来善护念等。如彼师父胜昆友等。虽佛大悲普皆<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>。然行二利。求三菩提。餘乘不能。唯大乘者故。菩提者智所求果。言萨埵者。悲所度生。具此智悲。名為菩萨。由此能胜。而偏摄付。犹如三子及三田等然菩萨者。有大有小。根熟未熟。可退不退。若佛在世。转法轮时。以菩萨法。而為护念。若入灭时。以菩萨法。及未熟者。付大菩萨。如父在日悉阴诸子。及<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>时而付嘱故。菩萨法者。即下所说依等五义。於中别詮菩萨所行。名菩萨法。以是菩萨三种转道。断惑证理。生智义故。是故论言。其五义中菩萨法。而建立故等。虽所摄付皆菩萨法。然其行相。各有差别。谓各六种。第一义故。且护念中六种义者。一时。二差别。三高大。四牢固。五普遍。六异相。所言时者。显菩萨法。是二世胜得。现世安乐。当来利益故。言差别者。显菩萨法。是超过胜。不同世间二乘法故。言高大者。显菩萨法。是最上胜。非餘护念所能及故。言牢固者。显护念法。是究竟胜。乃至成佛。非可捨故。言普遍者。显护念法。是广大胜。问护念者。诚二利故。言异相者。显护念法。是清净胜。异於地处未净法故。言付嘱中六种义者。一入处。二法尔得。三转教。四不失。五大悲。六尊重。云何入处。為佛以法付嘱。根熟与未熟。作入学故。云何法尔得。谓根熟者。得佛付嘱。於未熟者。法尔摄故。云何转教。谓现以法付嘱根熟。令其转教根未熟故。此三如次。即是后三。云何入处。而名不失。谓前根熟。作入处故。不失而化。应时摄引。令根未熟。不失行故。云何法尔得。名為大悲。得付嘱者。於未熟人。法尔生悲。又由悲故。於未熟人。法尔摄故。云何转教。而名尊重。谓佛付嘱。令其转教。由尊重佛。及尊重教。於未熟人。能转教故。由佛最胜护念力故。乃令根熟诸菩萨等。得智惠力。成就佛法。得<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>力。成熟眾生。初即大智。后即大悲。得此二身。固於佛行。故佛付嘱。名故善巧。由其最胜。付嘱力故。令根未熟。诸菩萨等。於已修得大乘<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>。而不退失。於未修得大乘行愿。而能进求。故佛付嘱。亦名善巧。故天亲论颂此义云</p><p>巧护义应知加彼身同行</p><p>不退得未得是名善付嘱</p><p>经。世尊至降伏其心赞曰。次下第二发起行相。於中有三。初善现发问。次如来印发。三善现敬承。此初也。言行相者。谓即般若。行谓行解。所修行法。相谓体相。所行相状。即行所住。其所修行。能住修伏般若行相。善现创為啟发。如来重垂印发。由斯广说。行所住中。所修智惠。名发起行相。即因问而许宣。亦因许而广说。故问及许。俱发起焉。此文三节。初标所為。善现所问。非自有疑。為善男子善女人故。次彰问本。谓因发心。而為发问。若不发心。不為问故。阿之言无。耨多罗言上。三藐言正。三者言等。菩提云觉。总云无上正等觉。谓显诸佛三身觉智。起因三乘故。言无上。离二邪障。故谓之正。遍达真俗。故称為等。成无上觉。二处明之。无上正觉即正体智。无上遍觉。即后得智。诸释有此开合异故。若人发心。求此菩提。故言发阿耨多罗三藐三<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。后正申所问。即应住等。此问意云。善男子等发心。求此最胜菩提。必有所修。及有所断。安住何行。而成修行。降伏何障。使行清净。由斯当得所求菩提。修觉所要。故申二问。然修行中。有初后位。初住加行。后正修行。故餘本经。开為三问。谓云何住。云何修行。云何降伏。即发心者。求佛果时。安住何心。修行何行。若有障垢。云何降伏。餘经以其初后位。别开住為二。即有三问。此经以其同所修。故合為一住。故唯二问。故此彼本。亦不相违。由此诸论。依三问解。故无著论。释三问云。彼应住者。谓欲愿也。欲谓希求。愿谓思念。凡欲修行。先住欲愿。希求思念。方修得故。即发心者。欲修行时。云何住於欲愿心也。彼应修行者。相应三摩愕凼币病H?︺帝。此云等至。即无分别等持真定。由修此定。发生般若。即发心者。正修行时。云何修行此三昧也。云何降伏者。折伏散时也。若有散乱。执著心生。如实<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。令不得起。即伏执著散乱之心。令还入定。名降伏心。即发心者。若时散乱执著心生。云何降伏。即由三问。显发三道。初成摄道。摄取眾生。诚加行持。成摄生戒。摄取化身。恩德因故。次成熟道。修成佛法大圆满持。成善法戒。及成报身。智德因故。后不失道。折伏烦恼。不起诸通。使行清净。為<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>戒。成其法身。断德因故。修学所要。不过此三。故為三问不增不减。其功德施论。所释三问意。乃令经意问答乖违。既非应理。此中不叙。问般若深宗。正被菩萨。何故大人缄默。而小圣问耶。由此论云。何故上座须菩提问耶。答。般若以无相為宗。善现以解空成德。现冥至理。可以对扬将欲引摄声闻。及以进持菩萨。由斯善现而发问焉。如眾成就所说之相。是故论云。有六因缘。若二乘者。於大乘中。恐自无分。怀犹豫故者。便得断疑向大乘故。初心菩萨。乐著福德。於无相教。心未成熟。闻多福德。起信解故。虽得已定信心得成熟。然於二执。未入二空。便励其心。住真理故。虽得胜理。能不自轻。而乐住寂。便能<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>。有胜福资。不退转故。虽已进修。顺佛摄受。然未真证。尚取相者。便能证悟。极庆慰故。虽能证悟。乐观法流。弘教利生。未能发起。便於现当。能久传故。然此六因。或略為四。合第六因入前五中。即是前五所学法故。合第二三。同名摄受。信解甚深。皆称理故。是故论言。疑者令见乐福。已熟而摄受故。得不轻贱者。令精勤心故。已净心者。令欢喜故</p><p>经。佛言善哉至嘱诸菩萨赞曰。次下如来印发。於中有三。初明证印。次敕听许宣。后正发起。此初也。重言善哉。智度论云。此显佛喜之极甚也。善现所陈有其二意。一所讚称德。护念付嘱。称佛德故。既因叹佛。兼显经宗。种姓不断。意趣玄远实為善哉二所问称根位。修降伏摄诸行尽。称大根姓所应。希学发起行行之相状。故亦為善哉。由所讚问。称德称根。深善其辞。故重赞印。印述等文。文易可解</p><p>经。汝今諦听当為汝说赞曰。此敕听许宣也。汝今諦听。即是敕听。当為汝说。即是许宣。諦谓审諦。显离三失。谓即散乱轻慢颠倒。如次犹如覆漏秽器。而即能生三种功德。谓闻思修。胜三慧也。由此方堪听受正法。故智度论所说偈云。听者端示如飢渴一心。入於语义中。闻法踊跃心悲喜。如是之人可為说。故先敕听。方复许宣</p><p>经。善男子至降伏其心赞曰。此正发起也。言如是者。指陈控引。我当為汝。委细宣说。如是注心。修行降伏。既為控引行所住文故。说此文為正发起</p><p>经。唯然世尊愿乐欲闻赞曰。此善现敬承也。唯然者。敬诺之辞。愿乐者。喜承之意。既蒙敕听。未可安然。况复许宣。寧得缄默。故申唯诺承。奉尊言故。十地论乐法偈云。如渴思冷水。如飢思美食。如病思良药。如眾蜂依蜜。我等亦如是。愿闻<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>法。善现亦尔。言愿乐等</p><p>经。佛告须菩提至降伏其心赞曰。次下第三行所住处。是前所发住心。修行降伏三种。别修行相云总所依。道理处所。名行所住处。谓依此中歷行别明。广分十八所应住法。文义相摄。勒為八种。以行就位。略束為三。言十八者。一发心。如经佛告须菩提。至即非菩提至即非菩萨。二波罗相应行。如经复次须菩提。至如所教住。三欲得色身。如经须菩提於意云何。至即非菩萨见如来。四欲得法身。曲分為三。初言说法身。如经须菩提白佛言世尊。至何况非法。次智相法身。如经须菩提於意云何。至而有差别。后福相法身。如经须菩提於意云何。至即非佛法五修德胜中无慢。如经须菩提须陀桓。至阿兰那行。六不离佛出时。如经佛告须菩提。至无所得。七愿净佛土。如经须菩提於意云何。至而生其心。八成熟眾生。如经须菩提譬如。至是名大身。九远离随顺外道论散乱。如经须菩提如恒河中。至如来无所说。十色及眾生身搏取<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>破相应行。如经须菩提於意云何。至是名世界。十一供养给侍如来。如经须菩提可以三十二相。至是名三十二相。十二远离利养及疲乏热恼故。不起<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>及退失。如经须菩提若善男子。至是名第一波罗蜜。十三忍苦。如经须菩提忍辱波罗蜜。至见种种色。十四离寂静味。如经须菩提当来之世。至执果亦不可思议。十五於证道时离喜动。如经尔时须菩提。至三菩提者。十六求教授。如经须菩提於意云何。至是名一切佛法。十七证道。如经须菩提譬如人身长大。至无眾生无寿者。十八上求佛地。已下文是。於中分為六种具足。一国土净。如经须菩提若菩萨作是言。至说名真实菩萨。二无上见智净。如经须菩提於意云何。至如来说得福多。三随形好身。如经须菩提佛可以具足色身见不。至是名具足色身。四相者如经须菩提如来可以具足诸相见不。至是名诸相具足。五语语具足。如经须菩提汝勿谓如来。至是名说法。六种心具足。已下文是。於中复开有六种心。一念处。经闕此文。餘本即有。谓彼非眾生非不眾生等。至下当知。二正觉。如经须菩提白佛言。至名善法。三施设大利法。如经须菩提若三千大千。至即非凡夫。四摄取法身。如经须菩提於意云何。至不可以具足相故得阿耨菩提。五不住生死涅槃。如经须菩提汝若作是念。至说不受福德。六行住净已下文是。於中显有三行住净。一威仪。如经须菩提若有人。至故名如来。二破名色身自在。如经须菩提若有善男子。至是名法相。三不染。已下文是。於中显有二种不染。一说法。如经须菩提若有人。至如如不动。二流转。如经何以故。至应作如是观。文义相摄。勒為八者。一摄住处。即前发心。於此文中。摄取菩提心。摄取眾生故。二波罗蜜净。即前波罗蜜相应行。由无相智。与行相应。得清净故。三欲住处。合前三四色身法身。皆是所求佛果身故。四离障碍。合前十二。总為一住。始从第五<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>得胜。乃至十六求教授。文皆能离彼所除障故。五净心。即前证道。由证道时净心故。六究竟。即前上求。是所上求究竟果故。第七广大。第八甚深。是前十八住处通义。皆有广大甚深行故。以行就位。束為三者。一信行地。即十八中。前十六住。皆是地前所依行故。二净心地。即第十七证道住处。是无满心所依位故。三如来地。即第十八上求佛地。求如来果所依地故。虽以广略三种料经。然今且依三地料判。依位起行。宽摄狭故。行所住总分三地。信行地中。分之為四。即八住中。前四住处。以信行地三十心中。皆有发心修行求果。离障四行。无不起故。若依无著。十八住处。住处文中。皆答三问。若依天亲。别以三文。单答三问。餘皆断疑。经文是一而论异者。一会之中。根有利钝。乐有广略。行有定散。障有执疑。是故圣教。云有单重。义有横竖。理有隐显。治有破遣。由斯二论。各据一明。具显深宗。不相乖背。无著第一发心住处。即是天亲答住问。文显以四心而明所住。一广大利益心。谓能遍缘一切眾生。而起悲心。思拔其苦。由无所简。名平等恩。二第一利益心。谓起慈心。恩与其乐。令得涅槃第一乐果。由唯与此。名不施恩。三常利益心。离眾生相。不取度相。而常喜庆一切眾生。由心无著。名善意恩。四不颠倒利益心。不见我人寿者等。相<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>住相平等捨相。由无妄取。名真实恩。正是菩萨所应住处故。明四心而答住问。若依无著。此及诸住。皆显三义。而答三义。言三义者。一七义句。二八住处。三即五义。七义句者。文如前列。前六正所明宗。第七释经名字。此一义句题中已显。就前六中。初三别配经文。其义句相。已随文释。后三住处。通义诸住。皆有能治能证所依地故。就后三中。对治显行相為能治。不失显行相為能证。正是诸住所应住修降伏之法地。是此二法之别位。而无别体。不离此故。对治有二。一邪行。二共见正行。若生起心。我能如是行。如是行。是名為邪行。菩萨虽行。不生心故。若谓对治。此邪行故。虽行诸行。不作行相。此即名為邪行对治。虽名正行。仍犹二见。谓能如是不住行。不住行与见俱。名共见正行。為离此见。行不行相皆应不住。即名共见正行对治。若有二见障无相心。虽行诸行。不称般若。故诸住处。皆应住修此对治道。而降伏之。不失是离增损二边。谓一切法皆归二諦。一者俗諦。因缘假有。二者真諦。无自性故空。如是二諦。其体不异。俗即真故。有而非有。真即俗故。空而不空。非有非空。是中道理。若执法有。是增益边。若执法无。是损减边。离此二边。是真般若。故诸住处。皆应住修降二边。心不失中道。次八处住者。有文有义。已如前列。前六别配经文。后二住处。通义广大。甚深通是诸住。住心修行降伏处故。度一切眾生。修一切善法。离一切诸相。名广大行。虽行广大之行。不见能行之相。由证真空甚深理故。行亦甚深。名甚深行。后五义者。一依义。即诸住处所对治法。谓不住修降伏等障。依此所断方说能治。住心修行降伏行故。所治者名為依义。二说相。即一住处。能所断证。依义摄持。安立显现所有文义。名所说相。三摄持。即诸住处。欲愿住心。凡欲修行。初生欲愿。修行降伏。胜行方成。即摄后行以令生。持后行令不退。故说欲愿。亦為摄持。四安立。即诸住处。第一义諦。内证真理。名非安立。今以言说。而施说故。故说真如。名為安立。五显现。即诸住处。所修无相相应。定惠<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>。显了证真如故。名為显了。折伏散心。亦是此摄。如尔焰境。制令住故。即初依义。是所断障。第四安立。是所证理。摄持显现。是能治行。前之三问。但问能治。就胜问故。影略问故。须佛广答。具明三种。欲显断障证理修习。若有一时。必有餘故。前七义句。及八住处。通显住修降伏之处。今则别显断<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>法故。说五义而答三问。如是三义。既遍诸住。此亦三义而答三问。於中有二。初总标。后别显。此文初也。此中应言诸菩萨等应如是住降伏其心。举终括始。但言降伏。谓应如是住其心等。即五义中。初依义也。显示所治不降等故</p><p>经。所有一切眾生之类赞曰。次下别显准天亲论。显别四心。即分為四。所有已下。名广大心。我皆等者。名第一心。如是等者。名為常心。何以故下。不颠倒心。若依无著。显答三问。即分為三。初答住问。即前二心。次答修行。即前常心。后答降伏。即不颠倒心。初答住问。复分為二。初名愿所度之生。即广大心。后欲愿。令生所得之果。即第一心。初中复二。初标举。后差别。此初也。所言眾生。有其三义。一眾多念生。谓本一心。言无动念。而為无明所薰染故。五意<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>。眾多<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>生。而生起故。名曰眾生。即此依於起信意解。二眾多缘生。谓因五蕴。及十二处十八行等。眾多因缘。而生起故。名曰眾生。此即依於智度论解。三眾多类生。谓有四生三界五趣。多生类故。名曰眾生。此即依於无著意解。由初种种妄念生故。即有蕴等眾多缘生。遂受趣等眾多生类。始终三义。名曰眾生。今言一切遍举此等。复言之类。意简非情。谓外道等邪教邪思念说草木名為眾生。而佛教等不同於彼。具前三义。有情识者。方是佛教眾生之类</p><p>经。若卵生至非无想赞曰。次辨差别也。谓以三类。显生差别。卵生等者。受生别故。若有色等。依正别故。若有相等。境界别故。受生别者。卵等异故。五蕴初起。名之為生。依声方出。名為卵生。含藏而起。名曰胎生。假润而兴曰湿生。无而忽有称化生。由内思业外声胎藏湿润四缘。而蕴生起。於四缘中。卵生具四。胎生具三。湿生具二。化生唯一。谓内思业。藉缘多少。如是次第。以此四生。摄五趣者。如<a href=\"/fojing/jushelun/yuanwen.html\" class=\"keylink\" target=\"_blank\">俱舍论</a>颂此义云。人傍生具四。<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>及诸天。中有唯化生。鬼通胎化二。多少胜劣。如餘处明。依止差别。即身异也。身通五蕴及四蕴成。若具五蕴。而成身者。名為有色。即欲界二十处。<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>十七处。皆有形质故。若唯四蕴而成身者。名為无色。则空处等。无色四天。厌色生彼。无形质故。虽有定果色。而无业果色。由此但名<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>耳。境界差别。即心异也。若有分别境界相者。名為有相。即欲界地。除睡闷位。下三静虑。第四静虑。除无想天。三无色全并无麤境。心相分明。故约有境。名為有想。若都无境。名為无想。即第四禪。无想一天。诸外道等。计為涅槃。修行无想定。生彼天中。於五百劫。全无心相。不缘境界。故名為无想。若虽有境。而不分明。则彼心想。亦复昧劣。名非有想非无想也。谓有顶地以次。下地心心所法。而為所缘境。既微细心亦闇劣。不同於前诸有想地。心想分明。名非有想。亦不同前无想有情。全无心想。名非无想。谓此一天。虽无明想。而有闇想。是故双非。如是遍举三类生者。意显普摄眾生界尽。并是欲愿所度之生。菩萨皆以大慈之心。而当济度。无所简故。名广大心</p><p>经。我皆度令入至灭度之赞曰。此欲愿令生所得之果。即第一心。如前所说。三类眾生。為生死苦之所煎迫。菩萨发心希求思念。皆愿度脱。与第一乐。第一乐者。即是涅槃。寂静殊胜。名為第一。希愿彼故。名第一心。涅槃梵音。此云圆寂。圆谓圆满。具足三德故。寂谓寂静。异生死喧故。涅槃不同。有其四种。一自性清净。谓诸眾生本静心体。此体即是诸法真如。具恒沙德。常恒安乐。虽為二障之所覆染。在二生死处於轮迴。而亦不失本清净性。其体本寂。故名涅槃。二有餘依。谓即真如。出烦恼障。此有三种。若二乘人。虽断烦恼。餘苦依身。犹未弃捨。若诸如来。虽无烦恼所感苦身。而有无满功德依身。虽实无苦。而有示现苦所依。所依身皆名有餘。而障永寂。故名涅槃。三无餘依。谓即真如。出生死苦。此有二种。若二乘人。先断烦恼。令捨分段麤苦之身。若诸如来。永离生死。是故皆得名无餘依。而苦永寂。故名為涅槃。四无住处。谓即真如。出所知障。大悲般若。常所辅翼。由斯不住生死涅槃。利乐有情。穷未来际。用而常寂。故名涅槃。一切有情。皆有初一。二乘无学。容有前三。唯我世尊。可言具四。今无餘者。即前第三。离生死苦。永安乐故。言灭度者。灭障度苦。即灭二障。度二死苦。寂静安乐。故名為灭度。唯得无餘。灭障度苦。故入无餘。而灭度之。问。眾生既广。六道类多。亦五乘性别。有缘<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>。可不可度。若一人而能遍救。则诸圣何置劬劳故。令皆入涅槃。此乃非所应。问。何故而愿此不可得义耶。答。菩萨发心。希成佛果。资乎福智。本乎慈悲愿行之兴。依坐以立。若有所弃。岂曰弘慈。凡起大心。皆无所简。生所摄者。我皆度之。性类虽多。皆是生摄。但念普救。胜行剋成。度生无多。速自成佛。睹斯妙益。劝发其心。是故经言。我皆令入。若尔则是。意愿弘通。故知实理。非皆度尽。然应度者。亦通四生。其胎化生。多人夫摄。有色有想。或具身心。既非难处。可容灭度。卵湿二类。固则不然。既居难处。又未成熟。如何亦使入涅槃耶。答。若在难处。要待其时。若未成熟。而令成熟。已成熟者。而解脱之。皆入涅槃。亦何疑难。若尔涅槃言谚四种。足令灭苦。乐果昭宣。长言无餘。起非烦迂。答。但言涅槃。恐滥方便。凡夫外道。六行所成。未免沦迴。尚拘苦网。為简於彼。要举无餘。是故不但言涅槃矣。若尔有餘。亦能灭障。既非方便。圣者方成。何故不言餘灭也答。由三义故。不言有餘。一是共果故。有苦无苦。所依身者。皆共所得。解脱果故。二宿业得故。谓二乘者。要依故业。分限之身。而<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>故。三佛说得故。谓近闻法。修行所得。苦依未灭。非究竟故。非如无餘。是其究竟。要无苦依。故业身尽。任运谢灭。而方证得。是故不说。令得有餘。若尔自性。即是真如。诸佛所师。眾圣所趣。何不令入自性涅槃。答。自性涅槃。眾生本有。但未离障。尚处沦迴。眾生无明。不能契悟真乐本有。失而不知。妄苦本空。得而不觉拔苦与乐。是曰慈悲。愿与本性。何所利益。况皆本有。岂愿与之。是故不愿与其自性。若尔菩萨。有大悲心。应愿与其最胜之果。何不愿与无住涅槃。答。无住涅槃。唯大乘有。而今般若。通被三乘。能辨声闻独觉佛地故。举三乘通得之果。是故但说无餘涅槃。故亦不是佛无餘涅槃也。若尔不应名第一心。二乘无餘非第一故。答。对生死苦。亦名第一。希愿此故。名第一心。如摩訶萨初发心位。亦得此名。此亦尔故。即此无餘。是第一果。是诸眾生。皆所应得。是故菩萨。发大慈悲。四生三界。一切眾生。皆以无餘而令灭度。正是菩萨广大之行。令一切生得灭度故。亦是菩萨。离损减边。能度眾生不执空故。亦是欲愿能摄持心。摄持修伏度生行故。既是应住愿乐之心。故说此文。名答住问</p><p>经。如是灭度至得灭度者赞曰。此常利益心。答修行问也。如是灭度者。牒前第一心。无量等者。牒前广大心。三世言之则无量。十方求之乃无边。种类言之即无数。故言无数无量无边等也。实无等者。释成常义。二论意云。由依无相相应定慧。观一切法。平等真如。生死涅槃本来不异。眾生诸佛。性自无差。由<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>故。菩提為烦恼。若了悟也。生死即涅槃。由此言之。凡圣一如。眾生我身。实无别体。岂我身外。别有眾生。由得如是同体大悲。他缚即我缚。他度即我度。由无彼此。不生劳倦。故能常度一切眾生。如是皆因得无相定慧。悟无相理。此即菩萨菩萨邪行对治。远离执著。我能度故。亦是远离增益之边。不执实有眾生度故。亦名安立。第一义諦。第一义中。无生度故。亦则名為甚深之行。广度眾生。无度相故。亦名显现。二量显了。证真如理。无度相故。既為菩萨常利益心。亦即名為大喜无量。无相定慧。既有此能。是故菩萨。应如是修相应定慧无相之行</p><p>经。何以故至即非菩萨赞曰。此不颠倒利益心。答降伏问。前令修行无相定慧。起同体相。而常度生。此恐散乱起颠倒心。取自他相。故相為遮止。於此文中。有徵有释。徵之意者。何所以故。灭度眾生。不取度相。释之意云。若有自他二相不亡。则於自他身。而起我相。亦於他身。起人等相。是有颠倒之心。寧得名為菩萨。既无同体悲智。岂能常度眾生。且身本无我。孰為能度。眾生本空。喝為所度。妄生取相。见自他耶。故净名云。譬如幻士。為幻人说法。当达是意。夫真菩萨者。一於自身。无其我相。二者於眾生。离其法相。故能常度一切眾生。汝今发心。欲度眾生。故应不起自身我相。亦不於他起人等相。若能如是。名真菩萨。方能济度一切眾生。则是共见正行。对治远离我。能不住相故。亦即同前是显现。心除自他相。了真如故。亦是所住不颠倒心。远离我等颠倒相故。又是菩萨大捨无量。能离自他。住平等故。离自他相。既有此能。菩萨应当如是降伏。勿起妄念而有自他。若能如是菩萨则能摄菩提心。摄取眾生。正是菩萨四利益心。别修行相之总住处。岂唯别答前之三问。及是总答云何住义。故天亲论。颂此义云。广大第一常。其心不颠倒。利益深心住。此乘功德满</p><p>经。复次须菩提至行於布施赞曰。次下第二明其修行八住处中。波罗蜜净。即十八中。波罗蜜相应行住处。前令发心以希佛果。次令修行為菩提因行。若不修果不成故。故说万行為圆满持。能持佛地圆满果故。若尔妙业八万四千。何故此中。但言其施。答。以施為万行之初。且麤而易习。况言包於六度。亦举此而统餘。其义者何。施有三种。一资生施。谓以资财资彼生故。二<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>施。谓以慈爱令彼安故。三者法施。谓以善法济其苦故。以此三施。摄彼六度。初资生施。摄初施度。施彼资财资益彼故。次无畏施。摄彼戒忍。由持戒故。不损恼他。於菩萨所。未加恶者。知不行恶。不生怖故。由忍辱故。能忍他害二菩萨者。知能忍耐。终无返报。亦不怖故。后善法施。摄进定慧。若為眾生。说法之时。由精进故。不惮寒热。不告劳倦。常勤说法。由禪定故。不贪敬养。能善知心称根说法。由智慧故。解了於法。无有倒错。如实而说。既以三施。具包六度。施言通三。即六度也。故天亲论。颂此义云。檀义摄於六。资生无畏法。此中一二三。是名修行住。由行如是六度行故。一一皆得二世果报。现在报恩。恭敬供养。当谓六度诸别异果。施得大<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>。戒成大尊贵。忍招善眷属。进获果不绝。定感身无损。慧根利悦乐。然其修行。有其二种。若求此果。名住相行。不求此果。名不住行。若不求报。而行施者。便与七种最胜相应。既皆得彼。到彼岸名近成。此报远成佛果。若求果报而行。行者心有垢故。行不精淳。既不得到彼岸名焉。感菩提极果。為遮住相之施。故令不住其心。又文中分二。初明不住行施。以答三问。后释此疑难。劝勉令修。初文复二。初明三不住施。答。其住问。后令不住於相。合答修伏问。初中复二。初不住於法施。后不住六尘施。此初也。准餘本经。有三不住。是故诸论依三以解。三不住者。不住於事施。都无所住施。不住六尘施。初中事者。有其三义。谓於现生。自身体事。於彼资生。所施物事。於当来世。施物果事。若於现在。爱著自身。為存己故。起不行障。设不获已而行施时。或复生苦。或复追悔。或由住著。求当物果。由此不成所求胜体。设得当果。而不圆常。為遮此故。是故经言。不住於事。应行布施。既离三事。说此经文。是故三论。各明一义。下二不住。亦准此知。次下所住。有其二义。初住现在。报恩供养。成僻行障。為邪僻因。后住当来邪僻之果。此复有二。或无畏施。戒忍二果。或除财施。餘五度果。皆是通别当来果故。若求此等。心既邪僻。名求异事。胜果不成。為遮此等。是故经言。都无所住应行布施。戒忍等果。不可别分。故总说言都无住也。财及五果。皆当果法。自身报恩。皆现在法资生。无畏皆世道法。是故此经总合两文。名為住法。既皆不住。故总说云。於法无住。虽与此本。作此道理。终成译主咸文妄耳</p><p>经。所谓不住至触法布施赞曰。此不住六尘施也。文言所谓。似释前标三不住施。文义既殊。前文非标。此亦非释。又是译者妄加文耳。此文亦通或总或别。六度所得。二世果报。二世之果。皆有二种。现二报者。外得供养世间五尘乐。内成适悦现法涅槃。当二报者。近得美妙五欲之乐。远得法身万德之果。此二世果。或通六度。或别法施之所成就。若求现当五尘果者。名住色等而行布施。求现涅槃当法身者。名為住法而行布施。若住此等而行施者。心不顺故。名倒行障。不契菩提名求异事。為遮此等。是故经言。不住色声香味触法布施。经以麤细有殊。别开其色。论以宽狭有异。别释其法。经论开合理不相乖。為显如此三不住义故。天亲论而说颂云</p><p>自身及报恩果报斯不著</p><p>护存已不施防求於异事</p><p>如是於三不住行施。正是菩萨邪行对治。以无所住。治住著故。亦是不失中道正行。不住於相。而行布施故。亦是广大甚深二行。以无住心。行大行故。亦名依义。依所住著。显示无住能治法。故亦名说相。说一住处。所治阶治。而证相故。亦是欲愿能摄持行。摄持无住清净行故。亦名安立。第一义諦。顺第一义无所住故。菩萨若时在散位中。应观如是。殊胜道理。应行如是三不住施。故天亲说答修行问。即是无相定前加行。菩萨欲入无相定慧。得成真实。无相施者。应如是住欲愿心也。故无著判為答住问。经有二意。论随一明。所显似殊。理极相顺</p><p>经。须菩提至不住於相赞曰。此即合答修伏问也。一切诸法。其体皆空。何有施者受者财物。不应於中强生分别。起住著心。而行布施。若能离相而行於施。行既清净。心又称理。乃是共见正行。对治离住。不住取相心故。又是显现。不住於相。现量显了。证真如故。既达彼岸。当感菩提故。诸菩萨。应修无相相应定慧。而行布施。勿起散心而住於相。由<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>慧。能不住相。故无著说答修行问。若心散乱取相心生亦应如是。而為降伏。如尔涅槃境。不取於相。由於散住有取相心。应可降伏。是故两论。亦说此文。答降伏问。故天亲论障伏颂云</p><p>调伏彼事中远离取相心</p><p>及断种种疑亦防生成心</p><p>上半显降伏义。释此经文。下半明断诸疑。释徵已下文。然准无著。乃至下文。皆答三问。若天亲论。略答三问。下皆断疑。所以如是两论异者。修行之人。有二种障。既生取相。或复怀疑。由有疑故。不肯修行。由取相故。行非称实。然经為断。而起胜行。略答问而多断疑。令离执而行称真。广答问而明正行。经文既有二意。论者各据一明。同契至真。共彰妙旨。天亲前来。已答问讫下净前义而断法疑</p><p>经。何以故赞曰。此下第二释此疑难。劝勉令修。於中有二。先徵后释。此徵也。以诸菩萨心有相故。贪於福德。疑无相施功德是无。於无相行。心不堪乐。今佛将欲断彼疑心。堪乐修行无相行故。以彼疑情。而徵问之云。夫行施行為住福田。今令不住。何所以也。不存施相。岂有福乎</p><p>经。若菩萨至不可思量赞曰。下释疑情。於中分三。初标福广。次喻校量。后劝修住。此初也夫善以顺理為义。若取相则乖背於真乘。必能离相而修行。乃玄契於如义。法性之体。既自无边顺性而修。福乃无限。亦何必取相而有大福耶。故应捨儒末之小心。从江海之大志。勿谓无福。固滞相迷。是答前徵。是断疑意也故下半颂。释此经文。谓於此中非但降伏。及下诸文。断种种疑。下文所断二十九疑。疑非一故。故云种种其下诸文。亦如此中。防其初后取相之心。故言及断种种疑亦防生成心</p><p>经。须菩提至可思量不赞曰。此下喻显校量。於中有二。初举喻问答。后正显校量。前中有二。初举东方。后例九方。初中复二。初如来问。后善现答。此初也。<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>无像。其际叵量。施而不住。其福无限。故以施福。借喻虚空。西国尊人。坐皆东面。且随所向。偏指东方。故问善现。於汝之谓為云何耶。东方虚空。应可以意思虑。度量得边际不。经不也世尊。赞曰。此善现答也。虚空之体。无际无涯。不可以意思虑度量得其边也</p><p>经。须菩提至可思量不赞曰。此下重例餘九。文亦分二。此初佛问也。前举东方。足彰福广。重问餘九。显利尤多。然虚空者。无碍為名。实不可说。有其方所。且随色相。假说十方。若无其色。无虚空故。言四维者。即四隅也。餘文易解。不繁广释</p><p>经。不也世尊赞曰。此重答也。文准前知</p><p>经。须菩提至不可思量赞曰。此正显校量也。然以虚空总有三义。故无著说有三因缘。若具而言。有其六义。与无相福。正為校量。一周遍碍非碍。无住施福。通感色法。有相无相。二身果故。二含容色非色。无住施福。所有因果。含有為无為一切德故。三该通情非情。无住施福。所有因果。通於凡圣染净心故。四不為尘垢染。无住施福。所有因果。淳净无有业惑染故。五毕竟无变异。无相施福。所有因果。究竟常住。无变异故。六无有穷尽时。无住施福。所有因果。所成利乐。无尽期故。论以义类同故。合之為三。此以具义别故。开之為六。由此诸义。犹如虚空。亦复不可意思量得边际也。故胜天般若经云。若此福德。有形相者。空界不受。且以虚空。為少分喻。然无住福。出过虚空。不举虚空。无所喻故</p><p>经。须菩提至如所教住赞曰。此劝修住也无住布施。顺法性修。既如虚空。其福无限。因之与果。福德如斯。是故菩萨。作应如我所说之教。於无相施。住心修行。勿疑无福</p><p>经。须菩提至见如来不赞曰。次下第三明其求果。即八住中。欲住处也。前既发心。次修诸行。若不求果。心行无依。显行所依。故明求果。然果有二。谓色非色。色相果者。即相妙身。非色果者。即真法身。故於此中。分之為二。初欲色身。后欲法身。初欲色身。即十八中。第三欲得色身住度。断其第一求佛作相疑。令修称真求色身行。谓佛色身。依真而起。欲成色果。要见法身。若执色相為真。迷法身而不成色果。若能不报色相。得真体而成色身故。欲求佛色身。先观无相法体。然初学菩萨。未悟真身。执化相身。為真究竟。既怀慢执。遂有疑生。寧求有相佛菩提。令行无住之施。由执故不成所求之果。由疑故不修感果之因。故执与疑。為果之障。今佛欲断疑执之心。令成所求色身之果。故显佛体非相好身。既為二意。而说此文。是故两论。各明其义。无著约其破执。判為欲得色身。天亲就其断疑。名断求佛住相。文分為二。初问答如来法身非相。后结成前义。以答三问。初中又四。问答徵释。此初也。将欲断彼疑执之心。令其离相而观法体。故寄与问起。此义云何。以有為生住异灭三十二相观。為如来真法身不</p><p>经。不也世尊至得见如来赞曰。此答也。以须菩提悬解佛意。答言不也。不可以有為生住异灭三十二相观。為如来真法身也</p><p>经。何以故赞曰。此徵也。何所以故。不以有為生住异灭三十二相观。见如来真法身耶</p><p>经。如来所说至即非身相赞曰。此释也。如来所说有為诸相。非是法身真实之相。以法身者即是无為无相。為相非有為故。是故化身有為身相。即非法身真实相也。若能如是观於如来。是即名為邪行对治。离执有為邪行心故。亦是远离增益之边。不执化身為实相故。亦是依义。以依所治色身之慢。显能治故。亦名说相。显说欲得色身住处。文义相故。亦是安立第一义諦。第一义中无色相故。由是义故。菩萨但行先住之施。得无相果。勿执化身為真佛体。返疑所修无相之行</p><p>经。佛告须菩提至皆是虚妄赞曰。下显结成前义。以答前三问。於中有二。初答住心问。后答修伏问。此初也。将欲成满善现所言。令於无相而住修伏故。复遍遣一切相也。非但在佛诸相非真。若凡若圣。情与非情。有之与空。相与非相。凡所有相。皆是虚妄焉。由达诸相皆虚妄故。即是欲愿能摄持心。摄持离相观真行故。诸菩萨应如是住</p><p>经。若见诸相非相则见如来赞曰。此答修伏问也。既执诸相。是其虚妄。不见如来。明知离相是其真实。则见如来。故天亲论。颂此义云</p><p>分别有為体防彼成就得</p><p>三相果体故离彼是如来</p><p>既能观相皆是非相。即是共见正行对治。非相相见相皆远离故。亦是不失所修中道。离虚妄相。见真佛故。亦是广大甚深二行。观相非相。见如来故。亦是显现离相观佛。现量显了。见真理故。由如是义故。诸菩萨应修无相相应定慧。离一切相而观法身。若心散乱执相复生还。应如是降伏其心。亦拘执相而為真佛。若能如是见真如来法身。既成色果。亦备依体起相。理恒数故。问。诸佛身相。悲智所成。岂得為说虚妄相也。答。佛之色相。圆智所成。既遍十方。亦无分限。随其根性。所见不同。然非是佛本真实体。若执為实。自為虚妄。岂於佛相。有虚妄耶。但除其病。非除法故</p><p>经。须菩提至生实信不赞曰。下明法身。即十八中。第四欲得法身住处。於中显有三种法身。谓即言说智相福相。欲三法身。即分别為三。第一欲得言说法身。当断第二不信空说疑。令修称实持说之行。前文既言。欲得如来色身果者。当观法身。故此令其欲得法身。然夫法身。有其二种。谓佛菩萨。福之与智。此福及智。是功德法。及依止故。皆名法身。此依言说教法而生故。此言说亦名法身。由能生詮福智身故。犹如实相观照二种。正名般若。能詮文字。能生詮故。亦名般若。故此文字。亦名法身。既此言说。是法身因。若欲希求福智身者。应先欲得言说法身。现在当来。俱流行世。若欲流行。不应取為法非法相。而為持说。既令希愿当现流通故。即於此而生疑念。向法无相行於布施。是因深义。又说如来非有為相。是果深义。因深果远。邃旨难知。佛在之时。尚难信解。况佛灭后。时恶根微。岂更离相而為信解。云何令我当现流通。既无信者。寧非空说。此即由先欲得。有此疑生。疑念既兴。便不希愿。今者欲断彼疑念心。令其希求现当持说。故说恶时有信持者。既為二意。说此经文。由此两论。各明一义。无著约令希愿。名欲得言说法身。天亲就断疑心。名断不信空说。文中有二。初善现发问。后如来為说。此初也。善现意。欲断彼疑心。令希求故。而发问云。於当后世。岂有眾生闻此言说法身章句。而生真实信解以不</p><p>经。佛告须菩提至莫作是说赞曰。以下如来為说。於中有二。初正答前问。后明法身要义。初中复二。初止说无。后正答有。此初也。勿谓当来无信受者。而作是说</p><p>经。如来灭后后五百岁赞曰。下正答有。然此答有。有其二意。近答生实相问。远答住修伏问。於中有二。初明生实相因。以答住问。后明能生实相。答修伏问。初中有二。初有时后有因。此初也。即佛灭后五五百岁。大集经说。佛灭度后。第一五百年。解脱牢固。乐行圣行。多得圣果故。第二五百年。禪定牢固。虽不得圣。深乐禪定故。第三五百年多闻牢固。不习禪定。多持文义故。第四五百年。福德牢固。又捨多闻。乐修塔寺故。第五五百年。斗挣牢固。又捨福德业。多乐忿挣故。如是五种牢固之时。出家之人。於彼行增多分而说。非越此时不修餘行。如初五百解脱坚固。然亦有人。修餘四行。如阿育王。广造塔等故。於后后时。亦有前前行。但约多分而作是说。此望佛在。皆名為后。故经说言后五百岁。皆佛灭后。恶世代故。或可偏指第五五百。以是极恶斗挣时故。明於彼时有信经人。况餘好时而不信也</p><p>经。有持戒至以此為实赞曰。次明有因。於中有四。一久修三学行。二遇佛集妙因。三為佛所摄受。四离障得胜报。由此四因故。能信受。此初因也。言三学者。谓<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>。以此三学。备摄诸行。具三学者。知教顺理。故具三学。能信此经。以此经為真实称理。既有信者。亦不空说。故天亲论。颂此义云</p><p>说因果深义於彼恶世时</p><p>不空以有实菩萨三德备</p><p>言三德者。即三学也。然此文中。闕其智慧。若准餘本。应合有之。以译经者随此义云谓信。经者有教理别。此戒定因。但信於教。下由智因而信於理。故天亲论。隐智不论。离我相中。方明智慧。故於此中。隐智不举。虽有此理。终译者失。佛岂不解而说之耶。持戒二学修福定学。谓有持戒修定慧者。以此经為实而生信心也</p><p>经。当知是人至而种善根赞曰。次遇佛集妙因。於中有三。初非供少佛。次久事多尊。后举劣况胜。此初也。言善根者。即前戒定。谓非少佛修戒定慧。非谓财供而种善根。财供养时。不以為喜。正行供养。方欢喜故</p><p>经。已於无量至种诸善根赞曰。此久事多尊也。显於多佛。具修三学。故言无量千万佛所。种诸善根。故论颂云</p><p>修戒於过去及种诸善根</p><p>戒具於诸佛亦说功德满</p><p>经。闻是章句至生净信者赞曰。此举劣况胜也。意说。一念生净信者。尚於多佛。久种善根。况不取相。而為持说。当知。必有广大功德。是故菩萨。应住欲愿之心。而為摄持持说之行。故诸菩萨。应如是住</p><p>经。须菩提至是诸眾生赞曰。次為佛所摄受也。此显信经。是根熟者。佛所记录。而摄受之。故能於经而生实相。言悉知者知其心。言悉见者见其身。显佛世尊。以其愿智三昧之力。於一切时。现知现见。非比智知。非肉眼见。是故双说悉知悉见。如来知见。有五胜益。不為魔恼坏其道行。修断事中。有勇猛力。不敢懈慢作诸非法。常自庆慰。修行不倦。虽入三空门。不堕二乘地。由此不敢自说己德。求於供养。及求恭敬。便能清净信受持说。勤於断修。喜无倦等。故天亲论。颂此义云</p><p>佛非见果知愿智力现见</p><p>求供养恭敬彼人不能说</p><p>经。得如是无量福德赞曰。此离障得胜报也。显持经人。虽无如前戒定慧等。三种胜因缘。但由过去无法障故。得是无量<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>之身。故能不谤而信持说。即复由此持说经故。当得如是无量福德。显斯二意。总说得言。非准信经当生福也</p><p>经。何以故赞曰。上明生实相因。答□问竟。次明能生实相。答修伏问。於中分五。问答徵释结。此初也。此问意。云何以要由修三学等。前四种因。方能於经生实相耶</p><p>经。是诸眾生至非法相赞曰。此第二答也。文中二节。初我后法。然初我相。有总有别。总谓四种。皆名為我。皆执诸蕴有主宰故。别谓四蕴。於三世蕴。总别分别。执我等故。若约三世差别五蕴。总执主宰。名為我相。执过去我是今世我。多生不断。名眾生相。执现在我一期命住。是我之寿。是名寿者相。执我当来复生异道。数取趣故。名為人相。以梵语云补特伽罗。俗语目人典数取趣。经依俗译。论依典文。故生异道。以释人相。故论释此四相颂云</p><p>差别相续体不断至命住</p><p>复取於异道是我相四种</p><p>如是我相。若随总别。行相不同。乃有四种。若随能起此。我相人合四。总名外道耶。取多是外道妄所起故。然其法相。亦有总别。总则四句。皆名法相。皆是迷真四种谤故。别谓四种不执有。殊法非法等。四种别故。一者法相。即诸声闻。及大乘中内法凡夫。由处下位。不了法空。执有二取实法相体。即增益谤经。随执执相。名之法相。论依起执人。名声闻内法邪取。二非法相。即增上慢菩萨。闻遣相空。便拨真如。及诸功德。皆是空无究竟理。此即损灭谤。经随执著相。名非法相。论依起执人。名增上慢菩萨邪趣故。三者相。即外道等。闻非有无。便执诸法亦有亦无二相违相。即相违谤。由此执故。迷真灭理。执有想定。為胜涅槃。经随执行。故名為相。论随执心所求之境。亦名世间共想定邪取。四者非相。即二乘等。不了诸法非非有无。便执诸法定非有无取。既非遮表。言成戏论。即戏论谤。既执诸法非有非无。便乐灭心。离有无相。执灭定等。為胜果等。经随执行。名為非相。论约执心所求之果。名為无想定邪取。此依人境。或合為五故。无著论名五邪取。若依行相。乃有八种。故天亲论。开為八执。若以类分。总為二种。所谓我相。法相异故。由依执八。有能离八一。是故经言无我相等。故天亲论。总别颂云</p><p>彼寿者及法远离於取相</p><p>亦说知彼相依八八义别</p><p>初句总显我法二相。寿者亦是我总名故。次句显离我法二相。其第三句。明能离心即释。经言无我相等。其第四句。释八所以。由依执八。能离八故。无我相者。谓无我性。以三世蕴。皆无实体。非主宰故。无人相者。其未来蕴。未生无体。非今至后可当得故。无寿者相者。现在诸蕴。念念不住。无有<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>性可得故。无眾生相者。其过去蕴。已灭无体。无有自性可至今故。无法相者。谓真如上。远离能取所取二相。以真空无一切物故。亦无非法相者。谓真如理。虽无二取。而体不无。真如实有功德体故。言无相者。谓真如理。性离言说。非有非无。不可说為有空相故。亦非无相者。谓真如理。虽不可说。而為迷者。以依言辞而演说故。而此本经。但有二者。合彼无相。入无法相。同遣相故。合亦非无相。入亦无非法相。同</p></div>"
}]