[{
    "title": "首罗比丘经 第2873部",
    "author": "未知",
    "html": "<div class=\"B1_text\"><p>首罗<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>经</p><p>罗问曰。更□□□□□□□□□□□□□□有一方亦得免之。首罗□□□□□□□□□□其意。大仙答曰。敬信三□□□□□□□□□□持斋<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>敬信不懈专□□□□□□□□□□大水之难。首罗复问大仙曰。□□□□□□□□□病之灾。大仙曰。比丘僧<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>优□□□□□□□□从今以往持戒奉斋皆使清洁□□□□□行知语应<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>如吾所敕莫如常意可得度□首罗曰。复作何方计得免妖邪之灾。大仙告曰。妖邪乃至多种受吾敕者慎莫信之。月光出世唯有善者尽得见之。五逆大恶眾生终不见也。首罗问曰。城池巷陌其事云何。大仙答曰城池巷陌纵广七百餘里。高千尺下基千尺。激城五百餘尺。开七十二门。城作紫磨金色。中有兜率城。高千尺下基千尺。激城亦五百尺。亦作紫磨金色明。中五百餘里。亦开七十二门。中有八城各三十餘里。亦作紫磨金色。各有千巷。巷巷相当门门相望。出见法王。如此城墎等男女皆悉充满。首罗闻之<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃无量。善哉善哉。大愿将果。首罗告四眾言。大宝将至莫作常意。决定修善莫作狐疑。吾见大仙以来消息审之无有疑惑。但从吾意修善奉道精懃苦行。莫如常意。思之念之必至无為。首罗问大仙曰。受乐之时亦有琴乐以不。大仙答曰。月光出世琴有多种。首罗曰。愿说其意。大仙答曰。琴戏吹咏无量最上音声逍遥无极。振大法鼓吹大法雷。振动三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。种留爵而著琴戏尽畅三十六鼓音声。当尔之时诗天龙宫巍巍而动。首罗比丘问大仙曰。向者妖邪我不畏之。除此小邪更有大邪以不。大仙曰。月光出世之时必有大魔而出。首罗问曰。大魔出时可却以不。大仙答曰。唯有一人能却魔者。為何人也。大仙答曰。三十三天有一童子名曰赫天。乘天龙马从空而来。捉波梨弓录沇箭。唯有此人能却此大魔。首罗比丘问大仙曰。有何方能却。唯有此一人能却。餘人不能。大仙答曰。如此大魔三十六人。各乘龙马要带四十二金杖。左手捉金刚杵。右手捉波梨斧。走来扰去踏石没踝超达永阶。但言唱杀无有当者。首罗问大仙曰。除此大魔。更有何灾。大仙答曰。月光临出觚有灾也。首罗问曰。灾复云何。大仙答曰。当有七日闇当之时。有夜叉罗剎毘舍闍鬼鳩槃荼鬼飞行罗剎食人无量。唯有<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>三归<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>奉行斋法。如此之人皆得度脱。首罗问曰。月光出世古月未复乃当出现。奉善修善皆得见之。首罗曰。更复何处得免眾灾。大仙答曰。唯有阳州。次有玄免。固都棘城柳城破资阳河涧。于此之城最是為良。三相大灾皆起。血流城河白骨如山。唯有东南乃得无為。大仙答曰。首罗言。好敕眾僧及以白衣。坐禪诵经懃修三业莫如常意。明王大圣今在汉境。未见之间催严福德莫如常意。汝信修善奉善。月光出世时前恶后善。恶世难度。好自敕厉更别作心莫如不信。大仙答曰。吾当虚言。若不尔者使我当来之世金刚力士。手捉金杵碎我身体犹如微尘。我若虚言。汝眾生当来之世身当如是。首罗问大仙曰。而今<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>颇有仙人贤圣以不。大仙答曰。贤圣仙人世间无量。首罗问曰。何人是也。大仙答曰。贤古月兴盛。是故不见耳。首罗问曰。贤士之人名号是谁。大仙答曰。我说其名。首罗曰。唯愿说之。大仙告曰。石贤德严贤明孙贤奇花贤德吴贤使郑贤当观贤宝赵贤。思此是八贤名贤字。汝今可往就之。真汝导师能运<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>。首罗曰。今在何处。大仙答曰。今当出世。何复问也。但当严心时至有见之。首罗复稽。除此八人更有贤不。大仙答曰。觚更有之。何人是也。大仙答曰。秦超世潘道成卢惠愿板国兴扶男阳刘道贵王延寿赵显宗张道板故世安李罗剎。如诸贤士皆游巡世间。汝今肉眼不能别之。得闻吾经常行平等。何以故。大贤诸贤难分别故。受吾敕者宜应平等十六正士七十二贤三千人俱。如是大士在人间也。不可识别。或见颠狂。或复愚痴。或复闇钝寒贫下贱。或饮酒食肉。或复夜食破斋。如此示现何能识之。示□生有三毒有见相随顺世法难可了知。唯有平等得值贤圣也。首罗比丘告诸四眾比丘尼优婆塞优婆夷。大灾将至莫如常意。其有本师父母国主檀越朋友知识<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>亲戚等。得吾经者皆示之。莫问近远得吾经者。懃行流布使一切闻之。不听隐匿吾经者。当来之世必堕恶道。首罗比丘曰。设有一人。捨三千大千国土象马七珍及国内人民穀帛财物以用<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。不如有人<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>吾经。诸比丘前<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>倍加百分。首罗曰。若得吾经者。懃行流布城邑聚落男女大小皆使闻之。其有匿吾经者。现世不吉当来得病。首罗曰。有智信之愚者弃之。首罗曰。吾经当来皆应也。莫作不信。一切眾生宜应奉行欢喜信乐。此经如海多有润泽。尔时君子国王大臣宰相一切士官三千餘人。各闻太寧寺上有五百仙人欢喜踊跃。各各严驾诣太寧寺中仙人所。稽首问曰。大仙从何所来欲至何许。愿说其意。大仙曰。我闻月光童子出世。是故我来欲到彼处。王及大臣闻是语时。欢喜踊跃倾心西望而不可止。西国真人修何功德得值入善。作何善业得见月光出世。而我国人远而不见。大仙答曰。月光出世人皆普见。王今云何生懊叹心也。王闻普见并大臣及诸人民皆欢喜。各持严驾今当去来。王问大仙曰。月光童子今在何许。大仙答曰。善哉善哉大王善听吾说。月光明王今三千大眾在蓬来山中海陵山下閔子窟所。止思惟时至现也。君子国大臣宰相一切士官并及国内人民。各白大仙曰。今随从大仙至月光所听见以不。大仙曰。月光明王譬如大海亦如大地。终不生疑作留难也。王及大臣并及人民随从大仙。有五万七千人去君子国七千餘里。到蓬来山中海陵山下閔子窟所。见月光童子。三千徒眾诸贤圣等皆集于所。月光童子问。诸大仙并及大王今从何所来欲何所至。此中嶮难无人行步。汝今云何能来至此。王曰。闻<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>今欲出世故来奉问。月光童子曰。但当修善懃行<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>莫如常意。吾今已竟。何须复现问。大王曰。我闻圣君出世不知法则云何。愿说其意。我当加心修善。月光童子曰。汝若不知当為说之。月光曰。善听复当善念善思念之。内著心中莫如常意。吾见说之。当来之年必有水灾。高于平地四十餘里。当水来时从西北角出东南而流。大水阳波叫声雷电霹靂不得為喻。汝复涌出运波叫声。当尔之时人皆惶怖迫死者多。唯有持戒净洁求懃度世。月光童子使大龙王大引人博著浮山。设复有人造观世音经一卷。设复有人禪思一心。设复有人于恶世懃行劝化。设复有人流通是经不令隐匿章句文字懃行劝乐。如此人等皆得度世。不為水灾之所夭没。复除不至心及<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>尽。月光复告大王言。当来三灾疾病流行。十伤九亡种种异患皆当夭命。王当信之。各敕国内一岁以上能行知语应受三归五戒。若老若少皆应劝尽使受三归五戒奉<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>法。如是之人皆得度世。除不善不至心及命寿。吾今密教语汝使知。恶世流行善法后致夭丧莫生悔心。吾告汝等。世将欲末渐令恶起来年难过。好作向善莫如常意。吾当出世灾亦不善。但当努力懃行善法莫如常意。妖邪不详英雄竞起。自然磨灭终不见吾出见于世。汝等善哉莫如常意受吾教者。诵观世音千遍。防身度世擒获善果。又复有人各受三归五戒。今当行之莫如常意。懃行此经。若老若少皆使闻之得度恶世。设复有人流布此经处处流传。使人闻知得度身命。以懃流布此经者。亦得度世。月光曰。流行此经典者。我于千劫中算计是人<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>。终不能尽。设复有<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>疑不信。我于千劫中算是人罪报。终不能尽。兼复隐文字章句一帖尽不令人闻。覆人慧眼故世世常盲无所复见。及至罗汉常不离盲。為覆慧眼故断障法乃获是殃。受吾敕者城邑聚落国王大臣一人民皆得闻之。能有<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>崇奉此经。莫问远近应往通流使人闻之。千城百国皆使闻之。吾当出世黄河以北弱水以南。于其中间王于汉境。大王白明王言。此经从何所出。月光告大王言。海陵大圣三千餘人参议所造。月光告大王言。等大眾各各分散顺化天下不须复迴。尔时大王受教奉行观喜而去。月光童子曰。向者所说汝若不信。但看<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>石像。是吾出世记耳。善哉索断合丝作。乃有善眾生顺莫惊怖。吾当出时尽皆得无為。王及大眾欢喜奉行近化不懈。吾告汝等。今岁到。汝宜精进莫如常意。各各发愿过度恶世。大仙国王并及臣民欢喜奉行作礼而去。五百仙人在太寧山中。并见月光童子经一卷。金龙城中见一菩萨龙华树下。见一道人下此经时。為一眾生成一切眾生心。王曰。為汝分别解说。法王欲待圣君欲下。為一切童男童女持百二十贤君。申酉年為眾生<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>成我童男童女成道。读此经时善思取此语男取无亿女取恒沙男不用取妇。月光童子欲出圣成欲现成一切眾生道。若读此经语可离此难。月光菩萨欲来下说持戒可得见明君。若欲读此咒时。师子虎狼复恶邪祝帝百鬼自然去。一切眾生枉死者多。為一切眾生贵佛<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a></p><p>优丘尼优丘尼但[卄/泽]但[卄/泽]鬱离鬱离乌呼乌呼尼萨呼萨呼但叉但叉叉阿由池池呼尼要他要他索由富[少/兔]尼富[少/兔]尼</p><p>若读咒时。净洗手嗽口读此咒。使人晨夜安隐即见菩萨。读此咒百遍。见菩萨放大光明现在人前。长杖一面如此金色。头上金华大如车轮。手长一尺半。初来入时莫作怖迫。归命佛归命法归命僧十方法界。三读此经皆得<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>。世尊玄看眾生作罪不少。為分别解脱可离令得免难。明君出时[木*巳]此经向。明君必见我慎迫怖。好念正想正意正身得见我身有人必难。此人或作师子虎狼。手捉金杖打人无度。依此经语行菩萨行。可得见菩萨说法现身著天衣。慎莫言语此人即成道见香华自然不得动心。言语此人必离恶世。第一用意百日在时不用痴贪。申酉年时。公不识儿。母不识女。忆此经语可得改心。改意第一不淫欲。第一不恶眼视。佛為眾生说法还得本心。佛欲出世懃心懺悔。中见月光菩萨一介贤者得活十人。此经不得诽谤。闇君欲起妖邪欲兴懃精进即离此难。诸道义為一切眾生即说法。若解吾语即见法王。道人死尽不罢道行。死者多道人作罪不少。由是持生贩卖。由此国不安寧。道人死时会横贼儿死多。道意师僧欲贵尼僧。千介拔十介。第一用行<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>欲始英雄欲起时节欲到时黄衣长丈二。粳米普地生。懃心作福可得见此事。思此经语即得见我身。七月十四日其有一怪。十五日见佛地动莫作迫怖。见道人渐安义下此经语诽谤即有大病患起。复见一老鸟足长一丈。复见贤者<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>以来七百餘年紫巖山中。复见一道人身著天衣。贤者见之即以<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>七日。道人师从三百餘年。道人口语<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>可得免难。愿佛波多树下為一切转读。视见眾生死尽。月光童子复啟世尊。眾生可化。佛语月光童子。前头随意即复辞罢。五逆甚多云何可度。佛复语月光童子。佛复语。四天龙王眾生可怜。随因缘起。复驱百二十贤君除却眾生好恶欲分别。<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>菩萨普光菩萨咸瑁普贤功德不少。由诸国土药王菩萨贤固菩萨见在人间。千村正有一村。万里有长佛欲见出语。眾生懃心作精进可得见佛。若诽谤之人魂家灭尽。定堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>永不见佛。佛欲出世懃精进比道欲知比难。洛阳口西欲知比恶。在于箜西复有箜北。若有吾<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>解吾口语。即我弟子。指手心上乃思惟思之。不但看后头有杆。十手相指唤赫自去。义哉童子灾后快乐。由欲末头两手相柏穆然自去。善男子耶快以不恶人去尽欲大乐恶人后不问女妇尽成道乃一精进可得免此难。佛复有大慈悲快怜眾生不捨眾生心不迴畏。眾生死尽有缘值我。<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>索索自去。维摩共之定光在人中。维摩朔妻妇人中使人不识。作行世帝下香化人。维摩朔大各四十五里直东。维摩有<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>儿维摩度人无崖。诈人间望行淫溢无淫行眾生敢得此行看。维摩时节欲到无量眾生悔奥。维摩度人决得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>。维摩贪财盗语一切眾生懃心精进可得见。维摩诸道义区此鸟傍海下此经即见王僧庆行徒七人见此鸟即<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>。欢喜踊跃七日不食。若一切眾生闻我语声。懃心精进慎莫异意。恶欲死尽欲大乐貲祖不输</p><p>首罗比丘经</p></div>"
}]